{
  "hash": "788bc8740cea93e7f01a14bba3d8ceaf51eafd4e",
  "title": "Mason Jar Salted Caramel Cheesecake",
  "image": "https://media2.popsugar-assets.com/files/2015/05/14/123/n/1922398/3794bb49_salted_caramel.jpg",
  "href": "http://www.popsugar.com/food/Mason-Jar-Salted-Caramel-Cheesecake-37486542",
  "extension": "Chrome",
  "firstAdded": "2016-06-22T21:16:37.990000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "Blend together the graham cracker crumbs and the butter, creating the crumble base. Spoon mixture into the bottom of the 4-ounce mason jars and press, forming the crust to the cheesecakes.",
    "Using a hand mixer, whip together the strained Greek vanilla yogurt and cream cheese until smooth.",
    "Bring the water to a boil and add the unflavored gelatin, mixing until it has dissolved and the mixture is smooth.",
    "Slowly add the warm gelatin to the cheesecake batter, whipping once again until smooth. Evenly distribute the batter between the jars and then place in the fridge for at least 4 hours or overnight to set.",
    "For the sauce, place the sugar in a heavy-bottomed saucepan over medium heat. Whisk until the sugar has completely melted, turning into a rich, gold liquid.",
    "Remove from heat and add the butter. It will bubble, so stand back while whisking to avoid burns.",
    "Once the butter is incorporated, slowly stream in the cream, whisking again until the caramel sauce comes together. Pour into a glass jar and let cool.",
    "Top each mini cheesecake with the caramel sauce and a touch of sea salt before serving. Or screw on the lids and pop in the fridge for later transport!"
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "For the cheesecake",
    "1 cup graham cracker crumbs",
    "1 tablespoon butter, room temperature",
    "1 8-ounce package cream cheese",
    "1 1/2 cups vanilla Greek yogurt, strained",
    "1/4 cup water",
    "1 .25-ounce packet unflavored gelatin",
    "8 4-ounce mason jars",
    "For the caramel sauce",
    "1 cup sugar",
    "6 tablespoons butter",
    "1/2 cup cream",
    "Salt"
  ],
  "__v": 1
}