{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 400F. Line a 9-by-9-inch pan with aluminum foil, spray with cooking spray; set aside.",
    "In a large mixing bowl combine zucchini, carrot, salt, pepper, and pour the egg over the vegetables; toss to coat.",
    "Pour mixture into prepared pan, lightly packing it and smoothing it down with a spatula. Bake for 25 to 28 minutes, or until vegetables begin to show signs of slight browning on top and have firmed up. Depending on how watery the vegetables were, how much salt was added, and how much water they release will dictate baking time. The vegetable crust doesn't have to be well-done or even very hardened, just not watery and juicy.",
    "Spread sour cream over the top of the crust in a smooth even layer.",
    "Sprinkle about 2 cups cheese uniformly over the sour cream.",
    "Drizzle the salsa (I used a very bean and corn-heavy salsa) uniformly over the cheese.",
    "Top with the remaining cheese, about 1 1/2 cups, sprinkled uniformly. Bake for about 35 to 40 minutes or until cheese has browned and top is bubbly and golden. Depending on the kinds of salsa and cheese used, and how browned you prefer your food, will dictate baking times and could cause them to vary widely; let your eyes be your guide and watch for browning.",
    "Allow lasagna to cool for at least 10 minutes before slicing and serving. Lasagna can be stored in an airtight container in the refrigerator for up to 5 days or frozen for up to 3 months. Leftovers can be served cold or gently reheated."
  ],
  "firstAdded": "2014-04-22T21:45:17.041000",
  "hash": "1577422f3eee3cc2ce3cf41e155798dde9cfe2b5",
  "href": "http://www.averiecooks.com/2012/09/vegetable-lasagna-casserole.html",
  "image": "http://www.averiecooks.com/wp-content/uploads/2012/09/collage1.jpg",
  "ingredients": [
    "0",
    "3 cups coarsely grated zucchini (about 2 medium zucchinis, grated)",
    "1 1/2 cups coarsely grated carrot (about 1 large peeled carrot, grated)",
    "1 teaspoon salt, optional and to taste",
    "1/2 teaspoon black pepper, optional and to taste",
    "1 large egg, beaten (or egg replacer or flax egg)",
    "1 1/2 cups sour cream (or Tofutti)",
    "3 1/2 cups loosely packed shredded cheese, divided (cheddar, American, mozzarella, Ricotta, soy, goat, Daiya, or a favorite cheese blend)",
    "one 16-ounce jar salsa"
  ],
  "keywords": [
    "coarsely",
    "zucchini",
    "medium",
    "zucchinis",
    "carrot",
    "salt",
    "black",
    "pepper",
    "replacer",
    "flax",
    "egg",
    "sour",
    "cream",
    "tofutti",
    "loosely",
    "divided",
    "cheddar",
    "american",
    "mozzarella",
    "ricotta",
    "soy",
    "goat",
    "daiya",
    "favorite",
    "cheese",
    "blend",
    "jar",
    "salsa"
  ],
  "title": "Vegetable Lasagna Casserole",
  "users": [
    null
  ]
}