{
  "hash": "80aaadf15b80aafe0c010df21534ebbe5cb44f40",
  "title": "Stove Top Macaroni & Cheese",
  "image": "http://whiteonricecouple.com/recipe/images/mac-and-cheese-200-thumb-thumb.jpg",
  "href": "http://whiteonricecouple.com/recipes/stove-top-one-pot-macaroni-cheese-recipe/",
  "extension": "Chrome",
  "firstAdded": "2017-03-28T23:16:18.652000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place raw elbow macaroni in colander and quickly rinse under water. Let drain.",
    "In medium sauce pot (about 3.5 qt), add water and raw elbow macaroni. Heat the pot on medium heat to bring the mixture to a low simmer and keep the flame consistent to maintain the low simmer.",
    "Stir the macaroni frequently as it comes up to a simmer. This will separate macaroni and keep them from sticking together. DO NOT LEAVE THE STOVE! The mixture will come to a low boil very quickly and leaving it unattended will leave a big mess on your stove stop.",
    "Once mixture comes to a simmer, add the milk and bring the mixture back to a low simmer. Then immediately turn down heat to LOW. Macaroni will slowly cook in the milk. Having your heat too high will burn the milk and scorch your pan",
    "Continue to stir the mixture frequently so that macaroni will cook evenly and absorb milk evenly. If you don't stir your mixture frequently, you will get a big clump of macaroni in the end! Stir, stir stir!",
    "Cook for about 10 minutes or until macaroni is tender. Make sure there is still some milk in the pot to melt the cheese, which makes the mac and cheese creamy. **If macaroni is not cooked fully, add a little more milk to mixture ( in small amounts) until macaroni is fully cooked.",
    "When the macaroni is plump and cooked, add the mustard powder, salt, nutmeg and grated cheddar cheese. Stir the cheese mixture evenly into the macaroni. We will add more milk to the pot if needed, then add the cheese to make the mixture more creamy.",
    "Take a final taste and add additional salt to taste. Before serving, stir one final time to mix everything together. Turn off heat and serve immediately.",
    "Add bread crumbs for a crunchy bite if you wish."
  ],
  "ingredients": [
    "0",
    "1 pound (455g) small elbow macaroni, uncooked",
    "about 3 cups (710ml) water",
    "2 cups low fat Milk (about 16 oz or 475ml), or more if needed",
    "**if more milk is needed, additional 1/4 cup milk at a time for final cooking. **Macaroni pasta varies so much! have additional milk on hand, or be ready to increase the heat if your macaroni doesn't absorb fast enough.",
    "1 tablespoon Butter, for flavor ( I tried this recipe once without the butter and I didn't notice any difference with the recipe. More heart healthy!)",
    "1/2 teaspoon Mustard powder",
    "1 teaspoon Salt, plus additional for final season later",
    "generous dash of Nutmeg",
    "about 8 oz (225g) Grated Cheddar Cheese, any one or combination of (jack, cheddar, swiss, mozzarella, gouda, parmesan*, asiago*, pecorino*) *Hard cheeses are best combined with a secondary, softer, better melting cheese. Cheese varies in flavor and salt level too! The more cheddar cheese you use, the creamier the mac and cheese will be",
    "additional toppings: bacon bits, bread crumbs, chopped parsley, diced tomatoes (optional)",
    "black pepper to taste (optional)"
  ],
  "__v": 1
}