{
  "hash": "32837988a8dd7e9d4ca54759a061ab0e05ae3f12",
  "title": "Roast carrot & fennel soup",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/1234_18_1421150821_lrg.jpg",
  "href": "http://www.jamieoliver.com/recipes/vegetables-recipes/roast-carrot-fennel-soup/",
  "firstAdded": "2015-01-23T19:46:07.115000",
  "users": [
    null
  ],
  "keywords": [
    "carrots",
    "trimmed",
    "bulbs",
    "fennel",
    "tops",
    "reserved",
    "serve",
    "onion",
    "olive",
    "oil",
    "garlic",
    "unpeeled",
    "litres",
    "stock",
    "single",
    "cream",
    "flatbreads",
    "seeds",
    "strong",
    "bread",
    "flour",
    "fastaction",
    "yeast",
    "sugar",
    "extra",
    "shaping"
  ],
  "directions": [
    "0",
    "Recipe by Alice Hart",
    "1. Preheat the oven to 190C/gas 5. Put the carrots, fennel and onion in a roasting dish and toss with 2 tablespoons of olive oil. Roast for 20 minutes, then add the garlic cloves. Stir everything thoroughly and return to the oven for 20 minutes more, until the vegetables are soft and browned. Remove the papery skins from the garlic cloves.",
    "2. Put the roasted veg in a large pan with the vegetable stock and bring to the boil. Simmer gently for 15 minutes, then liquidise with a stick blender, until completely smooth.",
    "3. Now make the flatbreads. Toast the fennel seeds in a dry frying pan for 30 seconds or so, until fragrant. Crush roughly with a pestle and mortar, then pour into a bowl with the flour and ½ teaspoon of salt. Dissolve the yeast and sugar in 100ml of hand-hot (not boiling) water, then add it to the flour mixture with the oil and 60–75ml of hot water and mix until you have a soft, but not sticky, dough. Knead for 5 minutes.",
    "4. Pop the dough into an oiled bowl, cover with oiled clingfilm and set aside to rise in a warm place for 30 minutes. Then, with oiled hands, divide the dough into 8 and roughly roll each one into a thin oval. Stack them up, separating them with baking paper to stop them from sticking together.",
    "5. Heat a griddle pan until it's smoking hot and add the flatbreads (you'll need to do this in batches). Cook for a couple of minutes on each side, until charred and puffed up. Keep warm in a tea towel while cooking the rest.",
    "6. Gently reheat the soup, and serve with a swirl of cream, a scattering of fennel tops and the hot flatbreads."
  ],
  "ingredients": [
    "0",
    "1 kg carrots, peeled, trimmed and sliced",
    "2 bulbs of fennel, trimmed and sliced, tops reserved to serve",
    "1 onion, sliced",
    "Olive oil",
    "2 cloves of garlic, unpeeled",
    "1.6 litres vegetable stock",
    "100 ml single cream, to serve",
    "For the flatbreads",
    "1 tsp fennel seeds",
    "250 g strong bread flour",
    "1/2 tsp fast-action dried yeast",
    "1 tsp sugar",
    "1 tbsp olive oil, plus extra for shaping"
  ],
  "__v": 1
}