{
  "hash": "360ded5e624a3ef60c711eb6b9974a842aec2363",
  "title": "Poblano Posole",
  "image": "http://food.fnr.sndimg.com/content/dam/images/food/fullset/2013/12/16/0/BP0105_poblano-posole_s4x3.jpg.rend.hgtvcom.616.462.suffix/1493921939594.jpeg",
  "href": "http://www.foodnetwork.com/recipes/rachael-ray/poblano-posole-2283878",
  "extension": "",
  "firstAdded": "2017-07-13T22:57:24.598000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the broiler to high.",
    "Place the peppers in the oven and char all over until the skins are blackened. Spray the corn with the cooking spray and broil until charred evenly.",
    "Place the peppers in a bowl and cover to cool. Peel and seed the poblanos and coarsely chop. Cut the kernels from the cob.",
    "Turn the oven temp to 450 degrees F.",
    "Dress the tomatillos with 1 tablespoon of the EVOO and arrange cut-side down on a baking sheet. Arrange the onions and garlic on a second baking sheet and toss with the remaining EVOO, the coriander and cumin. Roast the tomatillos until charred at the edges and lightly browned, 20 minutes, swapping the trays between the upper and lower racks once. Leave the onions and garlic in the oven and let them cook for an additional 10 minutes.",
    "Puree the tomatillos, onions, garlic and poblanos with 1 cup of the stock, the cilantro and lime juice. Transfer to a large pot along with the remaining stock and the hominy. Bring to a simmer over medium heat and cook to combine the flavors, 15 minutes. Serve the posole topped with the radishes, avocados, scallions and a little more lime juice."
  ],
  "ingredients": [
    "0",
    "2 large or 3 medium poblano peppers",
    "2 ears corn or 1 cup frozen organic corn kernels",
    "Natural cooking spray",
    "6 to 8 medium tomatillos, peeled and halved",
    "2 tablespoons EVOO",
    "1 red onion, cut into wedges",
    "1 1/2 teaspoons ground coriander",
    "1 1/2 teaspoons ground cumin,",
    "4 cloves garlic",
    "4 cups vegetable stock",
    "1 lime, juiced",
    "Handful fresh cilantro, chopped",
    "One 28- to 32-ounce can hominy, drained",
    "To serve: thinly sliced radishes, diced avocado dressed with lime, thinly sliced scallions cut on the bias, lime juice"
  ],
  "__v": 1
}