{
  "hash": "c1c1738d77fc82e1483f5c42a8274150db3b63be",
  "title": "Milk Chocolate Buttercream",
  "image": "https://gt2itsrur3-flywheel.netdna-ssl.com/wp-content/uploads/2013/04/kirs5355edited2-1024x762.jpg",
  "href": "https://comfortablydomestic.com/2012/02/milk-chocolate-buttercream/",
  "extension": "Chrome",
  "firstAdded": "2018-10-24T01:53:56.913000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Put the chopped milk chocolate bars into a small bowl. Heat the chocolate in 30 second increments in the microwave set to 60% power. Stir after each increment, and continue to heat 30 seconds at a time, until the chocolate is melted and smooth. Set aside and allow to completely cool.",
    "Once the milk chocolate has cooled, sift the powdered sugar over the butter, in a large bowl. Cream the butter and sugar together until light and fluffy, scraping the sides of the bowl as needed.",
    "Measure the whipping cream into a cup, and stir in the vanilla extract into the cream. With the mixer running on low speed, gradually pour the cream mixture the bowl.",
    "Once the cream mixture has been incorporated into the frosting, fold on the melted (but cooled) milk chocolate until incorporated. Increase the mixer speed to medium-high, and beat frosting for an additional 3 minutes.",
    "Makes about 2 1/2 cups of frosting.",
    "This makes a medium consistency frosting, which is very spreadable and creamy.",
    "For a stiff decorator frosting: add more powdered sugar, 1/2 cup at a time, until desired consistency (about another cup or so.)",
    "For a thinner consistency to fill cupcakes or sandwich cookies, add about 1/2 cup less powdered sugar."
  ],
  "ingredients": [
    "0",
    "1 Cup unsalted butter, softened",
    "2 1/2 Cup powdered sugar (or more, depending on desired consistency)",
    "4 Hershey’s Milk Chocolate candy bars (1.55 oz. each), chopped (Do NOT use chocolate chips!)",
    "1/4 Cup heavy whipping cream",
    "1/2 tsp vanilla extract"
  ],
  "__v": 2
}