{
  "hash": "69856158a3699493cd2f6b205abcec3a96fd9fc8",
  "title": "Paleo Broccoli \"Cheese\" Sticks",
  "image": "http://physicalkitchness.com/wp-content/uploads/2016/04/paleo-broccoli-cheese-sticks-1.jpg",
  "href": "http://physicalkitchness.com/paleo-broccoli-cheese-sticks/",
  "extension": "Chrome",
  "firstAdded": "2017-08-06T17:41:27.900000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 375 degrees",
    "Bring a pot of water to a boil and add the broccoli florets. Boil for 8-10 minutes, until broccoli is soft, then drain the water",
    "Add the broccoli to a food processor and pulse until broccoli is broken down and scrape the broccoli 'paste' out of the food processor and into a medium bowl",
    "In a separate bowl, combine the almond flour, coconut flour, baking powder, onion powder, garlic powder, salt, and nutritional yeast together",
    "Add the dried ingredients to the broccoli, then add the egg and apple cider vinegar and mix until well combined",
    "Pour the mixture on a parchment-lined baking sheet and place another piece of parchment paper over the top. Using a rolling pin (or your hands), spread the down by pressing it out on the top piece of parchment paper (to avoid it sticking) until it's roughly ⅓ - ½ inch thick",
    "Remove the top piece of parent paper. Using a pizza cutter, score the dough into 1\"-wide pieces to make sticks. Also score the dough in the middle",
    "Place into the oven at 375 degrees for about 30 minutes, until the edges are slightly golden and the middle is cooked through. Let cool, then break the pieces into sticks",
    "Store at room temperature for a few days, or to keep longer, place in an airtight container in the refrigerator. Freeze any leftover sticks and thaw when needed"
  ],
  "ingredients": [
    "0",
    "4 cups broccoli florets",
    "1 cup almond flour",
    "¼ cup coconut flour",
    "½ teaspoon baking powder",
    "¼ teaspoon onion powder",
    "¼ teaspoon garlic powder",
    "½ teaspoon salt",
    "2 tablespoons + 1 teaspoon nutritional yeast",
    "1 large egg",
    "½ teaspoon apple cider vinegar"
  ],
  "__v": 1
}