{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 400 degrees.",
    "Combine the garbanzo flour, water, olive oil, cumin, and salt in a mixing bowl. Whisk thoroughly to combine. Set aside.",
    "Peel the carrots, if desired, and slice them 1/2-inch thick on the diagonal. Place in a large mixing bowl.",
    "In a small bowl, combine the olive oil, smoked paprika, cinnamon, chipotle, cumin, and sea salt. Drizzle over the carrots and mix thoroughly to combine.",
    "Transfer the carrots to a baking sheet. Roast for about 15-18 minutes, until browned at the edges and cooked through but firm.",
    "While the carrots roast, make the pancakes. Heat a large skillet over medium heat and add a little olive oil. Measure a scant 1/4 cup of the batter and pour into the pan. Repeat to work in batches of 3 to 4 pancakes at a time. Cook, undisturbed, until the edges are golden brown, about 5 to 6 minutes. Flip the pancakes and cook for another 4 to 5 minutes, until deeply golden brown. Transfer to a plate and cover with a towel to keep warm.",
    "To serve, slather a dollop of Greek yogurt and a small handful of micro greens on each pancake. Top with a large spoonful of the roasted carrots. These are best eaten immediately."
  ],
  "firstAdded": "2014-06-18T15:46:46.999000",
  "hash": "1e9141c24e82d01434e2d1851f6e79235fbe27f2",
  "href": "http://theyearinfood.com/page/4",
  "image": "http://farm9.staticflickr.com/8551/10173721846_b8183bdd93_c.jpg",
  "ingredients": [
    "0",
    "For the pancakes",
    "1 cup garbanzo bean flour",
    "1 cup water",
    "2 tablespoons olive oil",
    "1/4 teaspoon cumin",
    "1/4 teaspoon sea salt",
    "For the carrots",
    "1 bunch rainbow carrots (about 6-8 carrots)",
    "2 tablespoons olive oil, plus more for cooking",
    "1/2 teaspoon smoked paprika",
    "1/2 teaspoon cinnamon",
    "1/4 teaspoon chipotle powder",
    "1/4 teaspoon cumin",
    "1/4 teaspoon fine sea salt",
    "For serving",
    "Greek yogurt",
    "Micro greens or sprouts"
  ],
  "keywords": [
    "pancakes",
    "garbanzo",
    "bean",
    "flour",
    "water",
    "olive",
    "oil",
    "cumin",
    "salt",
    "carrots",
    "bunch",
    "rainbow",
    "cooking",
    "smoked",
    "paprika",
    "cinnamon",
    "chipotle",
    "greek",
    "yogurt",
    "micro",
    "greens",
    "sprouts"
  ],
  "title": "SAVORY CHICKPEA PANCAKES WITH SMOKY ROASTED CARROTS",
  "users": [
    null
  ]
}