{
  "hash": "ca5dcc48cc95826219cea2f43bb74c807c7dd5b0",
  "title": "How To Make Frozen French Toast Sticks",
  "image": "https://atmedia.imgix.net/e89dba1ef47338285f3d51188299caf4736f4286?auto=format&q=45&w=600.0&h=800.0&fit=max&cs=strip",
  "href": "https://www.thekitchn.com/how-to-make-frozen-french-toast-sticks-247428",
  "extension": "Chrome",
  "firstAdded": "2018-02-06T19:39:30.068000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Slice the bread. Use a serrated knife to cut the loaf of bread into 1 1/4-inch-thick slices. Cut each slice into 3/4-inch wide sticks.",
    "Heat the oven and coat 2 baking sheets with butter. Arrange 2 racks to divide the oven into thirds and heat to 375°F. Generously coat 2 rimmed baking sheets with 2 tablespoons of butter each.",
    "Make the French toast custard. Place the cream, eggs, sugar, cinnamon, and salt in an 8x8-inch baking dish and whisk until completely and thoroughly combined.",
    "Coat the bread sticks in the custard. Working with 1 bread stick at a time, dip and roll it in the custard, swipe off the excess custard back into the baking dish with two fingers, then place the coated stick on a prepared baking sheet. Repeat with the remaining bread sticks, leaving about 1/2 inch between each stick.",
    "Bake the French toast sticks. Bake the French toast sticks until golden-brown, using tongs to flip them halfway through, about 10 minutes total.",
    "Cool the French toast sticks. Immediately transfer them to a cooling rack so they remain crisp. Cool completely before freezing.",
    "Freeze the French toast sticks. Transfer the completely cooled French toast sticks to a gallon-sized zip-top bag, seal, and place in the freezer. It isn't important to individually freeze the sticks first, but they must be completely cool before going into the freezer.",
    "Reheat the French toast sticks from frozen. Once frozen, the French toast sticks can be reheated directly from the freezer. Arrange in a single layer on a baking sheet and bake in a 350°F oven or toaster oven for 5 minutes, flipping once about halfway through baking. Alternatively, you can microwave the French toast sticks for 2 minutes on high, but they will not be as crisp coming out of the microwave as they would from the oven."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 (16-ounce) loaf unsliced soft white bread",
    "4 tablespoons unsalted butter",
    "2 cups heavy cream",
    "2 large eggs",
    "1/2 cup granulated sugar",
    "1/2 teaspoon ground cinnamon",
    "1/2 teaspoon salt",
    "Equipment",
    "Measuring cups and spoons",
    "8x8-inch baking dish",
    "Cutting board",
    "Serrated bread knife",
    "2 rimmed baking sheets",
    "Tongs",
    "Gallon freezer storage bag",
    "Wire rack"
  ],
  "__v": 1
}