{
  "hash": "3739a0b8163dc1097002fe2f674332f96b7f267a",
  "title": "Healthier Broccoli Chicken Casserole",
  "image": "http://www.gimmesomeoven.com/wp-content/uploads/2019/08/Healthy-Broccoli-Chicken-Casserole-Recipe-5-1.jpg",
  "href": "https://www.gimmesomeoven.com/healthier-broccoli-chicken-casserole/",
  "extension": "Firefox",
  "firstAdded": "2020-04-02T23:16:05.670000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat oven to 400°F.",
    "Cook pasta in a large stockpot of generously-salted boiling water until it is al dente. However, about 1 minute before the pasta is done, add the broccoli to the boiling pasta water and stir until combined. Drain both the pasta and broccoli, and set aside.",
    "Meanwhile, heat the butter (or oil) in a large sauté pan over medium-high heat. Add the onion and sauté for 3 minutes, stirring occasionally. Add the mushrooms and garlic and sauté for 5 more minutes, stirring occasionally, or until the mushrooms are cooked through.",
    "Sprinkle the flour evenly over the onion mixture and stir until combined. Cook for 1 minute, stirring occasionally. Add in the stock, and stir everything together until most of the clumps are gone. Add in the milk, Dijon, salt and pepper and stir until combined. Continue cooking the sauce until it reaches a simmer. Then remove from heat and stir in 1 cup of the shredded cheese until it is combined. Taste and season with additional salt and pepper, if needed.",
    "In a large 9 x 13-inch baking dish, combine the cooked pasta, broccoli, mushroom sauce and chicken. Toss until combined. Smooth the casserole out into an even layer.",
    "Bake uncovered for 15 minutes. Then remove pan from the oven, sprinkle the remaining cheddar cheese evenly on top of the casserole, and bake for 10 more minutes or until the cheese is nice and melty.",
    "Serve warm, garnished with extra black pepper and/or fresh herbs, if desired."
  ],
  "ingredients": [
    "0",
    "8 ounces uncooked pasta* (I used whole-wheat rotini)",
    "1 large head of broccoli*, cut into bite-sized florets (about 1 pound of florets)",
    "2 tablespoons butter or olive oil",
    "1 small white onion, thinly sliced",
    "8 ounces baby bella (cremini) mushrooms, thinly sliced",
    "4 cloves garlic, minced",
    "3 tablespoons flour",
    "1 cup chicken or vegetable stock",
    "1 1/2 cups milk",
    "1 teaspoon Dijon mustard",
    "1/2 teaspoon fine sea salt",
    "1/4 teaspoon freshly-cracked black pepper",
    "2 cups (8 ounces) shredded sharp cheddar cheese, divided",
    "2 cups diced (or shredded) cooked chicken"
  ],
  "__v": 1
}