{
  "hash": "ae6ffc0f36a2362077ec9ea5afb09f314d44d66a",
  "title": "Cuban Black Bean Soup",
  "image": "",
  "href": "http://recipe-folder.com/recipe/5bd4c5ea9d3ecd063979207d",
  "extension": "User Added",
  "firstAdded": "2018-10-27T20:09:14.241000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "The night before cooking the soup, place the beans in a colander and rinse with cold running water. Pick out any rocks or beans that are broken or shriveled. Place the beans in a large (4 quarts or larger) Dutch oven or soup pot with a lid and cover with enough cold water so that it comes to one inch over the top of the beans. Soak overnight.",
    "1",
    "Drain the beans, then return the beans to the pot. Add enough cold water so that it covers the beans by an inch. Add the onion, pepper, garlic, ham bone or hock, olive oil, salt, and a generous quantity of black pepper. Stir to combine",
    "2",
    "Bring to a boil over high heat. Skim off any white foam, then reduce the heat to low and cover. Simmer until the beans are very soft and the soup is creamy, not watery, 4 to 5 hours. Check after 2 hours. If the beans seem dry or stewy, add another cup of water. The final consistency should be velvety and thick, and the soup should coat the back of a spoon. (The beans will soften in the first two hours. The goal is to continue cooking the soup until some of the beans break down and create the smooth, thick soup base.)",
    "3",
    "When the soup is nearly finished, stir in the vinegar and simmer uncovered for 15 minutes more. Pull the ham bone out of the pot — the meat that hasn't already fallen off should be easy to pick off; coarsely chop and return the meat to the pot.",
    "4",
    "Serve over rice if desired, garnished with chopped raw onions and sour cream. Also, if you like, little bits of chopped chicharrónes can be garnished on top. Add some sweet fried plantains as a side dish!"
  ],
  "ingredients": [
    "0",
    "1 pound dried black beans",
    "1",
    "1 medium onion, finely chopped",
    "2",
    "1 medium green bell pepper, finely chopped",
    "3",
    "3 cloves garlic, minced",
    "4",
    "1 ham bone or smoked ham hock",
    "5",
    "1/2 cup olive oil",
    "6",
    "2 teaspoons salt",
    "7",
    "Freshly ground black pepper",
    "8",
    "1/3 cup distilled white or apple cider vinegar",
    "9",
    "Cooked rice, for serving (optional)",
    "10",
    "To garnish (optional):",
    "11",
    "Sour cream",
    "12",
    "Chopped raw onion",
    "13",
    "Chopped red pepper"
  ],
  "__v": 1,
  "hidden": true
}