{
  "hash": "d974154e29a438e64b1a459e12195de2447ad5e0",
  "title": "PENNE ALLA VODKA (VODKA CREAM PASTA)",
  "image": "http://www.gimmesomeoven.com/wp-content/uploads/2016/02/Penne-Alla-Vodka-3.jpg",
  "href": "http://www.gimmesomeoven.com/penne-alla-vodka-recipe/",
  "extension": "Chrome",
  "firstAdded": "2016-08-29T00:42:58.459000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat a large stockpot of salted water. Once you reach step 5 below (adding in the heavy cream), add the pasta to the salted water and cook al dente according to package instructions. Drain.",
    "Heat olive oil in a large saute pan over medium-high heat. Add shallots (or red onion), and saute for 4-5 minutes until soft, stirring occasionally. Add garlic and continue sauteing for 1-2 more minutes, or until the garlic is fragrant, stirring occasionally.",
    "Add vodka, and stir to combine. Continue cooking until the sauce has reduced by half, about 3-5 minutes.",
    "Add the crushed tomatoes and crushed red pepper flakes, and stir to combine. Continue cooking until the sauce reaches a simmer. Then reduce heat to medium-low, and continue simmering for about 20-30 minutes, until the sauce has reduced by almost half.",
    "Stir in the heavy cream and half (1/4 cup) of the basil. (<--This is also about the time you should begin cooking the pasta.) Reduce heat to low and let the sauce continue to simmer until the pasta has cooked.",
    "Once the pasta is ready, return it to the stockpot and pour the sauce on top. Toss the pasta until it is evenly coated with the sauce.",
    "Serve immediately, garnished with the extra basil and Parmesan cheese."
  ],
  "ingredients": [
    "0",
    "12 ounces dried penne pasta (or I used fettuccine)",
    "1 Tablespoon extra-virgin olive oil",
    "2 medium shallots or half a medium red onion, peeled and finely diced (about 2/3 cup)",
    "6 cloves garlic, peeled and minced",
    "1 cup vodka",
    "1 (28-ounce) can crushed tomatoes",
    "1/2 teaspoon crushed red pepper flakes*",
    "1/2 cup heavy cream",
    "1/2 cup torn or julienned fresh basil leaves, divided",
    "grated Parmesan cheese"
  ],
  "__v": 1
}