{
  "hash": "8f5b0a4f76317888331cbd84311fe13e99b90c6b",
  "title": "GLUTEN-FREE EGGPLANT PARMESAN WITH ZUCCHINI SPAGHETTI",
  "image": "http://inspiralized.com/wp-content/uploads/2017/02/eggplant.jpg",
  "href": "http://inspiralized.com/gluten-free-eggplant-parmesan-with-zucchini-spaghetti/",
  "extension": "Chrome",
  "firstAdded": "2017-12-26T03:31:52.013000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 375°F, with a rack in the center position. Line a sheet pan with foil and mist with cooking spray.",
    "In a medium bowl, whisk the eggs until smooth. In another medium bowl, stir together the panko, garlic powder, oregano, paprika and salt until combined.",
    "Dip each slice of eggplant first into the beaten egg, allowing the excess to drip off, and then into the panko mixture, pressing to coat. Place the coated eggplant slices on the prepared sheet pan, nestling them as close together as possible. Mist the eggplant with cooking spray.",
    "Transfer to the oven and bake for 30 minutes.",
    "Remove from the oven, carefully flip each slice of eggplant, and evenly distribute one jar of the marinara sauce over the slices. Top with the provolone cheese and Parmesan. Return to the oven and bake until the eggplant is tender and the cheese is melted and bubbling, 10 to 15 minutes.",
    "While eggplant cheese melts, spiralize the zucchinis with blade D and trim the noodles with kitchen shears. Place a large wok over high heat and once the wok heats, add the zucchini. Cook the zucchini until heated through to your preference.",
    "While zucchini cooks, place the other jar of sauce into a medium pot over medium-high heat and bring to a simmer. Let cook until warmed through, about 5 minutes.",
    "Serve the eggplant parm hot with a side of zucchini noodles topped with sauce."
  ],
  "ingredients": [
    "0",
    "2 large eggs",
    "1½ cups almond flour (original recipe calls for panko bread crumbs)",
    "2 teaspoons garlic powder",
    "2 teaspoons dried oregano",
    "2 tablespoons sweet or smoked paprika",
    "1 teaspoon kosher salt",
    "1½ medium eggplants, sliced into ½-inch-thick rounds (about 16 slices)",
    "2 (24-ounce) jars store-bought marinara sauce (I used Victoria Fine Foods)",
    "½ pound sliced provolone cheese (about 12 slices)",
    "¼ cup grated Parmesan cheese",
    "6 zucchinis"
  ],
  "__v": 1
}