{
  "hash": "b6a0d581e306bac20ee102903d31d055ddc15064",
  "title": "Liškové ravioli s babypatizonky",
  "image": "",
  "href": "http://www.menudomu.cz/liskove-ravioli-s-babypatizonky/",
  "extension": "Chrome",
  "firstAdded": "2015-12-08T09:42:42.768000",
  "users": [
    null
  ],
  "keywords": [
    "ingredience",
    "porce",
    "tsto",
    "velkch",
    "raviol",
    "velk",
    "vejce",
    "hladk",
    "mouky",
    "lce",
    "olivovho",
    "oleje",
    "extra",
    "virgin",
    "vody",
    "loutek",
    "pomalovn",
    "mouka",
    "pomouen",
    "vlu",
    "npl",
    "jarn",
    "cibulky",
    "dkg",
    "liek",
    "lze",
    "hiby",
    "nebo",
    "jin",
    "houby",
    "mslo",
    "mozzarella",
    "babypatizonk",
    "pep",
    "tymin",
    "erstv",
    "bylinky"
  ],
  "directions": [
    "0",
    "Na domácí ravioli si připravte tvořítko vyrobené přímo na ně (kulaté v tescomě jsem pořídila za 69 Kč). Bez něho byste prožívali krušné chvilky. Díky němu okraje raviol při vaření opravdu drží, jsou pěkně tvarované do špiček a výsledek tak lahodí i oku. Také si naplánujte tvorbu těsta včas, protože minimálně půl hodinky musí odpočívat ve folii v lednici, ale klidně mu dejte času víc. No a pokud nemáte speciální strojek na lisování těsta, pak bude třeba kuchyňský váleček a trocha vašich sil. Nic z toho ale nevyjde na zmar.",
    "Jednou těsto vyzkoušíte a oceníte přednosti domácích těstovin.",
    "Nasypte hladkou mouku na pracovní plochu, udělejte nahoře žlábek, kam se vejde vajíčko. To tam klepněte, přidejte sůl a olej. Vidličkou jemně promíchávejte, dokud to půjde, pak přijde na řadu ruční práce. Pokud bude těsto moc tuhé, přidejte lžíci vody. Pokud se bude příliš lepit, přidejte trochu mouky. Čím víc ho propracujete, tím bude lepší. Měli byste setrvat až do doby, kdy ani na rukou ani na desce už nebude vůbec nic, vše zůstane čisté. Zálěží, z kolika vajec těsto děláte. Z jednoho to zabere asi tak 10 minut.",
    "Pak ho dejte do lednice odpočinout v potravinové folii.",
    "Během toho si můžete připravit náplň. Lišky s cibulkou podusíte na troše másla a pak rozemelete (mám na to mechanický plastový mlýnek) na kašičku. Pokud k tomu nemáte náčiní, můžete zkusit ponorný mixér a nebo nakrájet na co nejjemnější kousíčky. Směs vraťte na ještě teplou pánev a vmíchejte nadrobno pokrájenou polovinu „bobánku“ mozzarelly. Lehce se rozehřeje a směs se spojí. Osolte, opepřete, přidejte bylinky. Nechte na pánvi. Připravte babypatizonky – omyjte, okrojte stopky a nakrájejte horizontálně na asi 0,5 cm kolečka",
    "(Z jednoho budou 2-4, podle velikosti).",
    "Těsto po odpočinutí vyválejte na pomoučeném válu na co nejtenčí (až se okraje budou kroutit). Čím je tenčí, tím ravioli chutnají lépe. Na okrajích bude těsto dvojitě silné a když ho necháte příliš tlusté, nechutnají moc dobře. Vyválený tvar přeřízněte na 2 co nejpodobnější poloviny, aby jedna druhou dobře překryla. Podle velikosti vašeho tvořítka na těsto pokládejte směs lišek. Počítejte s tím, že mezi jednotlivými kousky musíte mít alespoň půl cm prostor. Na každou raviolu budete potřebovat jednu vrchovatou čajovou lžičku směsi. Kolem ní pomašlujte těsto rozkvrdlaným žloutkem, aby k sobě obě půlky pěkně lepily. Až budete mít dolní placku osázenou směsí, překryjte přes ní horní. V raviolách by neměl zůstat spolu se směsí vzduch navíc, takže ho pěkně kolem dokola vytlačte. Těsto lehce přimáčkněte k sobě. Vemte tvořítko, pořádně jím na těsto zatlačte, pak lehce otočte doprava i doleva a raviola by v něm měla zůstat. Vedle na pomoučené místo ji odložte a tvořte dál. Těsto se znovu na další válení moc nehodí. Tím, jak přidáváte vajíčko a mouku do už propracovaného těsta, ztuhne, jde hodně špatně válet a bude silnější, než první várka. Proto doporučuju se zbytku zbavit a kdyžtak ho prostě na začátku raději udělat víc. Ravioli vaříme v osolené vodě asi 6 minut. Špičky se na okrajích budou lehounce rozvařovat a to je ten správný okamžik. Během varu je lehce promíchněte, aby byly za těch 6 minut oběma stranami otočené ke dnu a lépe se tak vařily. Během vaření už budete restovat patizonky na dostatku másla s bylinkami, ravioli po uvaření k nim přidáme spolu s troškou vody, ve kterých se vařily. Tu necháme spojit s máslem,",
    "opatrně promícháme a můžeme podávat."
  ],
  "ingredients": [
    "0",
    "Ingredience na 2 porce:",
    "Na těsto (8-10 velkých raviol)",
    "1 velké vejce",
    "130 g hladké mouky",
    "Lžíce olivového oleje extra virgin",
    "Lžíce vody",
    "Sůl",
    "Žloutek na pomašlování",
    "Hladká mouka na pomoučení válu",
    "Na náplň",
    "2 ks jarní cibulky",
    "5 dkg lišek (lze i hřiby nebo jiné houby)",
    "Máslo",
    "Mozzarella",
    "8 ks babypatizonků",
    "Pepř",
    "Tymián nebo jiné čerstvé bylinky"
  ],
  "__v": 1
}