{
  "hash": "f90c4a7dbb4b9daed06d312c5acb49262262316c",
  "title": "Cajun Gumbo in Instant Pot",
  "image": "http://simplepressurecookermeals.com/wp-content/uploads/2017/02/abc-2.png",
  "href": "http://simplepressurecookermeals.com/cajun-gumbo-instant-pot/",
  "extension": "Chrome",
  "firstAdded": "2019-01-21T22:42:10.221000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "How to make",
    "Choose a pot that fits easily inside your Instant Pot liner for the pot in pot method.",
    "Begin by adding the chicken, sausage, roux, onions, green pepper, garlic, celery, Tony Chachere seasoning, thyme, and chicken broth into the Instant Pot liner.",
    "Next, add the other pot to the Instant Pot on top of your mixture using a trivet, and pour in 2 cups of water and 1 cup rice.",
    "Report this ad",
    "Close the Instant Pot lid and set to seal. Then set to rice mode for 15 minutes.",
    "When cook time has completed, safely open the valve for a quick release.",
    "Remove the rice and set aside.",
    "Turn the Instant Pot to saute, and add in the okra and shrimp.",
    "Cook for 7-10 minutes stirring occasionally or until the shrimp turns pink and is cooked through.",
    "Recipe for Homemade Roux",
    "Ingredients",
    "1/8 cup oil",
    "1/4 cup flour",
    "Turn your Instant Pot to saute.",
    "Add in oil and flour, and stir constantly for 15-20 minutes until flour is turning brown. The darker in color the richer the flavor will become.",
    "If the mixture becomes too dry, you can add a bit more oil as needed.",
    "This homemade cajun gumbo is a great Instant Pot recipe that is easy and delicious. Using the pot in pot method to cook your rice really keeps it easy to manage. If you have a rice cooker, you can easily cook your rice separately with that method."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1lb Chicken Breast, shredded (I use a rotisserie chicken)",
    "1lb Smoked Sausage",
    "1lb Shrimp, raw, with no shell or tail",
    "1/2- 1 jar of Roux (they sell at the store or recipe is below)",
    "2 cups Onion, diced",
    "1 large Green pepper, diced",
    "3 celery stalks, diced",
    "1 (12oz) bag of okra frozen",
    "2 cloves of garlic",
    "3 tsp of Tony Chachere seasoning (more if you want more flavor)",
    "pinch of thyme",
    "salt and pepper to your liking",
    "3 cups of chicken broth",
    "2 cups water",
    "1 cup of rice"
  ],
  "__v": 1
}