{
  "hash": "d1b560fbd2a84eeafe8b9f3a48b35f75321f5e5c",
  "title": "Creamy Shrimp Risotto with Mascarpone",
  "image": "",
  "href": "https://www.bonappetit.com/recipe/creamy-shrimp-risotto-with-mascarpone",
  "extension": "Chrome",
  "firstAdded": "2018-06-30T13:09:09.015000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat 2 Tbsp. oil in a large saucepan over medium-high. Add shrimp heads and shells and cook, stirring occasionally, until shells and oil are bright red and shells are very fragrant, 5–8 minutes. Use a potato masher to press down very firmly on heads to release their juices. Stir in tomato paste and cook until it starts to brown and stick to bottom of pot, about 1 minute. Add ⅓ cup wine and cook, scraping up brown bits, until almost completely evaporated, about 3 minutes. Add carrot, celery, thyme sprigs, peppercorns, 2 onion halves, all but 4 garlic cloves, and 8 cups water. Toss in a generous pinch of salt and bring to a boil over medium-high. Reduce heat and simmer until stock is reduced by one-quarter and very fragrant, 60–70 minutes.",
    "While stock is simmering, finely chop remaining onion and garlic cloves.",
    "Remove stock from heat and strain through a fine-mesh sieve into a medium saucepan; discard solids. (You should have about 6 cups.) Taste and season lightly with salt. Keep warm over low heat.",
    "Heat remaining 2 Tbsp. oil in a large Dutch oven or other heavy pot over medium. Add chopped onion and garlic and cook, stirring often, until onion is translucent and softened, about 5 minutes (do not let it take on any color). Add rice and cook, stirring often, until grains are almost entirely translucent and starting to stick to bottom of pot, about 3 minutes. Stir in remaining ⅓ cup wine and cook, stirring, until wine is almost completely evaporated. Ladle in about 1 cup warm stock and cook, stirring, until liquid is absorbed. Repeat process, adding more stock as each addition is absorbed, until rice is tender but not mushy, 25–30 minutes. The risotto should be loose, creamy, and saucy, but thick enough that you can see bottom of pot when stirring; if you run out of stock before rice is tender, add water ¼-cupful at a time until rice is cooked and desired consistency is achieved. Season risotto with salt and pepper and stir in shrimp. Cook, stirring, until shrimp are cooked through, about 2 minutes. Remove from heat and finely grate in lemon zest. Add butter and 4 oz. mascarpone and stir until incorporated.",
    "Spoon risotto onto warmed plates and dollop remaining mascarpone; top with chives. Cut lemon into wedges and serve alongside for squeezing over.",
    "Do Ahead: Stock can be made 2 days ahead. Let cool; cover and chill, or freeze 1 month ahead."
  ],
  "ingredients": [
    "0",
    "4 Tbsp. extra-virgin olive oil, divided",
    "1 lb. head-on shrimp, shells and heads removed and reserved, shrimp cut into 1\" pieces",
    "2 Tbsp. tomato paste",
    "⅔ cup dry white wine, divided",
    "1 medium carrot, scrubbed, halved crosswise",
    "1 celery stalk, halved crosswise",
    "6 large sprigs thyme",
    "1 tsp. whole black peppercorns",
    "2 large onions, peeled, halved through root end, divided",
    "1 head of garlic, cloves separated, peeled, divided",
    "Kosher salt",
    "1½ cups arborio rice",
    "Freshly ground black pepper",
    "1 lemon",
    "2 Tbsp. unsalted butter",
    "6 oz. mascarpone, room temperature, divided",
    "2 Tbsp. thinly sliced chives"
  ],
  "__v": 1
}