{
  "hash": "47508eece17ae2bbd22c564d59e44fd71b288ef1",
  "title": "Gnocchi with Sausage and Kale",
  "image": "http://bevcooks.com/wp-content/uploads/2013/02/gno6.jpg",
  "href": "http://bevcooks.com/2013/02/gnocchi-with-sausage-and-kale/",
  "extension": "Chrome",
  "firstAdded": "2015-09-14T11:16:34.675000",
  "users": [
    null
  ],
  "keywords": [
    "gnocchi",
    "want",
    "extravirgin",
    "olive",
    "oil",
    "red",
    "onion",
    "garlic",
    "italian",
    "sausages",
    "casings",
    "crumbled",
    "hands",
    "allspice",
    "yield",
    "flavor",
    "leave",
    "straight",
    "savory",
    "pepper",
    "white",
    "wine",
    "vermouth",
    "broth",
    "roughly",
    "kale",
    "coarse",
    "salt",
    "parmesan",
    "cheese"
  ],
  "directions": [
    "0",
    "Heat the oil in a large skillet over medium-high. Add the onions and sauté until they start to soften, 4 minutes. Add the sausage and all-spice; continue to sauté until the sausage is browned all over, another 5 minutes. Add the garlic and sauté one more minute.",
    "Add the kale and wine. Season with a pinch of salt and pepper. Toss until the kale has wilted and is bright green and gawg. If you need to use a lid to quickly wilt, that’s fine.",
    "In the meantime, cook the gnocchi in boiling water until al dente, like 3 minutes. Drain and reserve 1/3 cup pasta water. Add the gnocchi to the sausage and kale mixture; toss to combine. Add enough pasta water to create a thin sauce.",
    "Off the heat, add the cheese, and maybe another drizzle of oil. Okay taste it. Need anything? Salt? Pepper? Your face in it?",
    "Serve garnished with more cheese!"
  ],
  "ingredients": [
    "0",
    "1 (17.6 oz) package gnocchi (or homemade if you want!)",
    "* 1 tsp extra-virgin olive oil",
    "* 1/2 red onion, diced",
    "* 4 cloves garlic, minced",
    "* 2 Italian sausages, casings removed and crumbled with your hands",
    "* 1/2 tsp all-spice (this will yield a sweet flavor, so leave it out if you want straight savory)",
    "* 1 pinch crushed red pepper",
    "* 1/4 cup white wine (or vermouth. or broth)",
    "* 10 cups roughly chopped kale",
    "* coarse salt and freshly ground pepper",
    "* 1/4th cup parmesan cheese, plus more for garnish"
  ],
  "__v": 1
}