{
  "hash": "0b58936b71553cc6b2d8b6000699b1dbc1910fa4",
  "title": "Churros",
  "image": "http://globetrotterdiaries.com/wp-content/uploads/2011/02/churros_final2.jpg",
  "href": "http://globetrotterdiaries.com/recipes/say-i-love-you-with-churros",
  "extension": "Chrome",
  "firstAdded": "2015-10-21T19:26:52.622000",
  "users": [
    null
  ],
  "keywords": [
    "milk",
    "tsps",
    "kosher",
    "salt",
    "granulated",
    "sugar",
    "unsalted",
    "butter",
    "tbsps",
    "allpurpose",
    "flour",
    "sifted",
    "extra",
    "eggs",
    "egg",
    "yolk",
    "quarts",
    "peanut",
    "oil",
    "frying",
    "cinnamon"
  ],
  "directions": [
    "0",
    "In a pot, bring the milk, 1 cup plus a tbsp of water, salt, 1 1/2 tsps of sugar, and the butter to a boil over medium heat. Remove the pan from the heat, and add the flour at once.",
    "Stir together with a wooden spoon, and return the pan to the stove over low heat.",
    "Stir the batter back and forth with the wooden spoon to sort of dry the batter.",
    "When the dough begins to roll away from the sides of the pan, cook for another 5 minutes.",
    "Let the mixture cool for a few minutes and then transfer it into a mixer.",
    "Beat in the eggs and egg yolk one at a time waiting for each egg to be incorporated before adding the next.",
    "Let the dough rest for at least two hours in a refrigerator.",
    "Mix 1/2 cup of sugar and the cinnamon together in a shallow pan or plate and set aside.",
    "In a cast iron pan or Dutch oven heat your oil to 350 degrees.",
    "Fill a pastry bag fitted with a star tip with your dough.",
    "Pipe the dough into the oil a few at a time and fry for about 2 minutes until browned.",
    "Remove onto paper towels and immediately toss in the sugar and cinnamon mixture."
  ],
  "ingredients": [
    "0",
    "- 1 cup plus 1 tbsp whole milk",
    "- 2 tsps kosher salt",
    "- 1/2 cup plus 1 1/2 tsp granulated sugar",
    "- 8 oz of unsalted butter (2 sticks)",
    "- 1 cup plus 2 tbsps of all-purpose flour, sifted",
    "- 3 extra large eggs",
    "- 1 extra large egg yolk",
    "- 2 to 3 quarts of vegetable oil or peanut oil for frying",
    "- 3/4 tsp of ground cinnamon"
  ],
  "__v": 2
}