{
  "hash": "b7b1e3f2034eacb3b56334075813bf93403dd9a0",
  "title": "New Year's Eve Meat Pie",
  "image": "",
  "href": "https://www.epicurious.com/recipes/food/views/new-years-eve-meat-pie",
  "extension": "Chrome",
  "firstAdded": "2019-01-01T00:33:29.566000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Lightly brush a 12\" cast-iron skillet with oil. Mix beef, potatoes, onion, salt, pepper, cumin, and coriander in a large bowl until just combined. Set aside until ready to use.",
    "Roll out 1 sheet of puff pastry on a lightly floured work surface to a 15\" square. Roll dough loosely around rolling pin, then unfurl into prepared pan. Gently lift and settle dough into pan. Chill until ready to use. Flour a large piece of parchment and roll out remaining sheet of puff pastry to a 12\" square. Chill until ready to use.",
    "Whisk egg and 1 Tbsp. water in a small bowl. Fill dough in pan with meat mixture. Brush edges of dough with egg wash; reserve any remaining egg wash. Place remaining dough over meat mixture, pressing edges of dough together. Trim, leaving a 1\" overhang. Do not throw away any trimmed dough; you can use it to make leaf, polka dot, or stripe decorations on top of the pie.",
    "Fold dough about 1/2\" over itself and crimp decoratively. Using the tip of a knife, cut 10–12 round vents about 1\" in diameter on top of pie. If you cut out any shapes from your leftover trimmings, place them on top as well. Chill pie at least 1 hour and up to 2.",
    "Place a sheet tray on oven rack, then place rack on bottom third of oven; preheat to 375°F. Brush entire pie with reserved egg wash and place onto preheated sheet tray. Bake pie, turning halfway through, until meat is cooked through and crust is well browned, 70–80 minutes. Let cool 30–40 minutes before slicing."
  ],
  "ingredients": [
    "0",
    "Extra-virgin olive oil (for brushing)",
    "2 lb. boneless beef chuck roast, cut into 1/4\" cubes",
    "3 small Yukon Gold potatoes, peeled, cut into 1/2\" cubes",
    "1 large onion, finely chopped",
    "1 Tbsp. kosher salt",
    "2 tsp. freshly ground black pepper",
    "1 tsp. cumin seeds, lightly crushed",
    "1 tsp. ground coriander",
    "2 (14-oz.) packages puff pastry, preferably all-butter",
    "All-purpose flour (for dusting)",
    "1 large egg"
  ],
  "__v": 1
}