{
  "hash": "505f3d0444597a9f5703cad14b0574bee0bb032c",
  "title": "Pickled Red Onions",
  "image": "",
  "href": "http://www.epicurious.com/recipes/food/views/pickled-red-onions-51196620",
  "extension": "Chrome",
  "firstAdded": "2015-07-14T01:02:17.054000",
  "users": [
    null
  ],
  "keywords": [
    "red",
    "onion",
    "vinegar",
    "cider",
    "white",
    "wine",
    "balsamic",
    "agave",
    "nectar",
    "lightcolored",
    "honey",
    "sugar",
    "salt"
  ],
  "directions": [
    "0",
    "Put on a kettle of water to boil. Cut the onion into very thin slices or a mince and place it in a colander in the sink.",
    "In a bowl large enough to comfortably fit all the onion, combine the vinegar, sweetener, and salt and whisk until blended.",
    "Pour the boiling water over the onion and shake to drain. (It's fine if a little water still clings.)",
    "Add the onion to the vinegar solution and stir to coat. Let it sit for at least an hour or up to several days, covered and refrigerated, occasionally stirring and/or shaking to allow maximum exposure to the liquid. Store in a jar with a tight-fitting lid in the refrigerator.",
    "Optional Enhancements For beautiful, exotic pickled fruit, add fresh or frozen cherries, blueberries, or raspberries—or some small watermelon chunks—to the onion after the first hour of sitting time * Add any of the following to the pickle mixture: Raw broccoli stems, peeled and cut into slender matchsticks * Raw fennel, cut into thin slices * Lightly steamed carrot slices * Lightly steamed cauliflower, cut into 1-inch florets",
    "Reprinted with permission from Heart of the Plate: Vegetarian Recipes for a New Generation by Mollie Katzen. Copyright © 2013 by Tante Malka; photographs and illustrations © 2013 by Tante Malka. Published by Houghton Mifflin Harcourt."
  ],
  "ingredients": [
    "0",
    "1 large red onion (3/4 pound)",
    "3 tablespoons vinegar (cider, red or white wine, or balsamic)",
    "1-2 teaspoons agave nectar, light-colored honey, or sugar",
    "1/4 teaspoon salt"
  ],
  "__v": 1
}