{
  "hash": "2e8ed2d7a485d9fc698321a9b11ff82fe5c40db8",
  "title": "Tartiflette",
  "image": "http://uktv.co.uk/images/300240/68181_tartiflette.jpg?Tartiflette-recipe",
  "href": "http://uktv.co.uk/food/recipe/aid/655513",
  "firstAdded": "2014-12-06T07:31:38.760000",
  "users": [
    null,
    null
  ],
  "keywords": [
    "mediumsized",
    "purpose",
    "potatoes",
    "desiree",
    "onion",
    "butter",
    "clove",
    "garlic",
    "drycured",
    "smoked",
    "streaky",
    "bacon",
    "reblochon",
    "cheese"
  ],
  "directions": [
    "0",
    "Preheat the oven to 180C/fan 160/gas mark 4. Place the potatoes, unpeeled, into a large pan, cover with water and bring to the boil and cook for 15 minutes.",
    "Melt the butter in a heavy-based pan over a low heat, add the onion and bacon and cook gently for 10 minutes, stirring occasionally, until softened but not coloured. Drain the potatoes and let them cool a little. As soon as you can, peel them and cut into slices around 5mm thick.",
    "Cut the garlic clove in half and rub the inside of an ovenproof dish or baking tin with it. Place some of the potato slices over the base of the dish, season with salt and pepper and sprinkle with some of the bacon and onion.",
    "Keep layering the potatoes, bacon and onion and continue until all the potatoes have been used up, seasoning with salt and pepper between each layer.",
    "Trim the sides of the petit reblochon cheese all the way around, removing about 5mm of the skin. Place the cheese on the top of the potatoes and cover tightly with foil.",
    "Bake in the oven for 1 hour, until the potatoes are crisp around the edges and the cheese is well melted. Remove the foil and cook for a further 15 minutes, or until it is just crispy around the edges. Serve on its own or with a dressed green salad.",
    "Recipe from Slow Cooking by James Martin, published by Quadrille. Photo © Tara Fisher."
  ],
  "ingredients": [
    "0",
    "1.5 kg medium-sized all purpose potatoes, such as Desiree",
    "1 large onion, finely sliced",
    "50 g butter",
    "1 clove garlic",
    "4 thick dry-cured smoked streaky bacon, finely diced",
    "250 g reblochon cheese"
  ],
  "__v": 2
}