{
  "hash": "f4fb421f18344cef26e347ce9040ca7df794808d",
  "title": "How to Make the Perfect Baked Tofu",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2013/11/How-to-make-baked-tofu.png",
  "href": "http://www.onegreenplanet.org/vegan-food/how-to-make-the-perfect-baked-tofu/",
  "extension": "",
  "firstAdded": "2015-05-04T06:23:38.900000",
  "users": [
    null
  ],
  "keywords": [
    "block",
    "extrafirm",
    "tofu",
    "pressed",
    "choose",
    "organicgmofree",
    "glutenfree",
    "lowsodium",
    "tamari",
    "broth",
    "tbs",
    "canola",
    "oil",
    "garlic",
    "kosher",
    "salt",
    "black",
    "pepper",
    "thyme",
    "paprika",
    "cumin",
    "turmeric"
  ],
  "directions": [
    "0",
    "Press and drain your tofu. It’s very important to do this so the marinade can get into the tofu. If you want your tofu even firmer, freeze it and thaw it out and press it. Cut the tofu into cubes (or whatever shape you want). Combine all ingredients for the marinade in a deep bowl and whisk. Add the tofu to the marinade and make sure all the pieces are covered. Cover the bowl with saran wrap and refrigerate for several hours or overnight – the longer, the better.",
    "Note: since I have a Tofu Press (the BEST gadget EVER), after I press the tofu and cut it into cubes, I put it back into the TofuXpress, pour the marinade in and cover it with the lid that is attached. If you have more than one (and you should), you can stack them in the fridge.",
    "Preheat the oven to 375 degrees. Remove the tofu from the marinade and place the pieces on a baking sheet lined with parchment paper in a single layer. Bake for 25-30 minutes, flipping occasionally, until the tofu is browned and as crispy as you like it. Serve however you choose."
  ],
  "ingredients": [
    "0",
    "1 block extra-firm tofu, pressed and drained (choose organic/GMO-free)",
    "1",
    "¼ cup gluten-free, low-sodium tamari",
    "¼ cup low-sodium vegetable broth",
    "2 Tbs. canola oil",
    "2 garlic cloves, minced",
    "½ tsp. Kosher salt",
    "¼ tsp. black pepper",
    "1 tsp. dried thyme",
    "1 tsp. paprika",
    "1 tsp. cumin",
    "½ tsp. turmeric"
  ],
  "__v": 1
}