{
  "hash": "460e883833bbf763bf0ff8458fe6cd67f0375326",
  "title": "THOMAS KELLER'S COCONUT CAKE",
  "image": "http://www.saveur.com/sites/saveur.com/files/styles/large_1x_/public/import/2014/2014-01/recipe_thomas-keller-coconut-cake_500x750.jpg?itok=aLQzAw2X",
  "href": "http://www.saveur.com/article/recipes/thomas-kellers-coconut-cake",
  "extension": "Chrome",
  "firstAdded": "2015-12-30T19:16:12.533000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "butter",
    "greasing",
    "flour",
    "desiccated",
    "coconut",
    "baking",
    "kosher",
    "salt",
    "sugar",
    "eggs",
    "separated",
    "mayonnaise",
    "milk",
    "buttermilk",
    "vanilla"
  ],
  "directions": [
    "0",
    "Make the cake: Heat oven to 325°. Grease three 9\" cake pans with butter and line with parchment paper; set aside. Whisk flour, desiccated coconut, baking powder, and salt in a bowl; set aside. Place sugar and egg yolks in the bowl of a stand mixer fitted with a paddle attachment; mix until fluffy. Add mayonnaise, coconut milk, buttermilk, coconut and vanilla extracts; mix until combined. With the motor running, slowly add dry ingredients until batter forms; transfer batter to a bowl and set aside. Clean stand mixer bowl and add egg whites; replace paddle with whisk attachment. Whip whites until soft peaks form; fold into cake batter. Divide batter between prepared pans, smoothing tops with a rubber spatula; drop pans lightly on a counter to expel large air bubbles. Bake until a toothpick inserted in middle comes out clean, about 25 minutes. Let cakes cool for 20 minutes in pans; invert onto wire racks and let cool.",
    "Make the meringue: Using an electric hand mixer, beat egg whites in a bowl until medium-stiff peaks form, 5–7 minutes; set aside. Bring sugar and ¼ cup water to a boil in a 2-qt. sauce pan fitted with a candy thermometer; cook, without stirring, until temperature reaches 250°, 4–5 minutes. With the mixer on low, slowly drizzle hot syrup into egg whites until combined. Increase speed to high; beat until meringue forms stiff peaks, about 3 minutes more.",
    "Assemble the cake: Place one cake layer on a cake stand and spread 3 cups meringue over cake; sprinkle with ¼ cup coconut. Repeat with second layer. Place remaining layer on top; cover top and sides with remaining meringue and cover outside of cake with remaining coconut, pressing lightly to adhere. Chill cake 30 minutes to firm meringue; serve chilled or at room temperature."
  ],
  "ingredients": [
    "0",
    "Unsalted butter, for greasing",
    "2 cups flour",
    "1 cup desiccated coconut",
    "1 tsp. baking powder",
    "1 tsp. kosher salt",
    "1 1⁄2 cups sugar",
    "3 eggs, separated",
    "1 1⁄4 cups mayonnaise",
    "3⁄4 cup coconut milk",
    "1⁄2 cup plus 1 tbsp. buttermilk",
    "2 tsp. coconut extract",
    "2 tsp. vanilla extract"
  ],
  "__v": 1
}