{
  "hash": "ea153c5ff06c9bf73e45b507a1563e5257c5cbe7",
  "title": "Buttermilk Biscuits and Sausage Gravy",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2011/06/biscuits-and-gravy-vertical-a2-640-600x732.jpg",
  "href": "http://www.simplyrecipes.com/recipes/buttermilk_biscuits_and_sausage_gravy/",
  "firstAdded": "2015-02-26T00:13:36.273000",
  "users": [
    null,
    null
  ],
  "keywords": [
    "selfrising",
    "flour",
    "extra",
    "flouring",
    "surface",
    "sugar",
    "kosher",
    "salt",
    "shortening",
    "baking",
    "tips",
    "butter",
    "chilled",
    "buttermilk",
    "needed",
    "brush",
    "biscuits",
    "sageflavored",
    "pork",
    "sausage",
    "white",
    "yellow",
    "onion",
    "purpose",
    "milk",
    "poultry",
    "seasoning",
    "nutmeg",
    "dashes",
    "worcestershire",
    "tabasco",
    "cayenne",
    "pepper",
    "hot",
    "bacon",
    "grease"
  ],
  "directions": [
    "0",
    "Buttermilk Biscuits",
    "Baking Tips: 1) Spoon the flour into your measuring cup, and level it off with the back side of a knife. If you scoop the flour, it will pack into the measuring cup, yielding too much flour,Instead of 4 Tbsp each of butter and shortening, feel free to use 8 Tbsp of shortening or butter, or any combination up to 8 Tbsp.",
    "1 Preheat oven to 450 F. Prepare a floured surface for shaping the dough and have an ungreased baking sheet ready (lined with Silpat sheets if you have them).",
    "2 Whisk together flour, sugar and salt in a medium-sized bowl. Using a fork or a pastry blender cut in the shortening and butter. Work quickly, you don’t want the fats to melt – the key to fluffy biscuits is minimal handling. The mixture should be crumbly.",
    "3 Make a well in the flour mixture, and pour in the buttermilk. Stir with a spoon and blend just until the liquid is absorbed and the dough comes away from the sides of the bowl – add 1-2 tbsp more buttermilk if the dough is dry. Do not over mix; the dough will be tacky, neither wet nor dry.",
    "4 With lightly floured hands, turn out the dough onto a lightly-floured surface and gently fold it over on itself 2 or 3 times. Shape into a 3/4” thick round. If you use a rolling pin, be sure to flour it first to keep the dough from sticking to the pin.",
    "5 Using a 2-inch biscuit cutter, cut out the biscuits pressing straight down (avoid the temptation to twist the cutter as twisting keeps the biscuits from rising). Dip the cutter in flour between cuttings to keep the dough from sticking to the cutter. Place biscuits on the baking sheet so that they just touch (for crunchy sides, leave space in between). Reshape scrap dough and continue cutting. Remember to handle the dough as little as possible.",
    "6 Bake for 15-18 minutes or until lightly golden brown on top. Turn the baking sheet around halfway through baking.",
    "7 Optional: Brush the tops of the biscuits with melted butter.",
    "Sausage Gravy",
    "1 Preheat a 4-quart saucepan over medium high heat (put a few drops of water in the pan – when they evaporate, you know the pan is ready). Crumble the sausage into the pan and let it brown for a minute or two, then turn down to medium heat. Continue cooking, breaking up the sausage into smaller pieces, until no pink remains. Stir in the onions and cook until they are transparent.",
    "2 Remove sausage with a slotted spatula or spoon, leaving the drippings in the pan. If less than 3 tbsp of drippings remain, add enough butter (or bacon grease) to equal about 3 tbsp of drippings. Add the cooked sausage back to the pan on medium heat, and sprinkle the flour over the sausage. Stir in the flour and cook for about 6-8 minutes, until the mixture starts bubbling and turns slightly golden brown.",
    "3 Stir in poultry seasoning, nutmeg, Worcestershire sauce, Tabasco sauce and salt – cook for 1 minute to deepen the flavors. Slowly add the milk and cook over medium heat, stirring occasionally, until thickened (about 15 minutes). Be patient, it will thicken!"
  ],
  "ingredients": [
    "0",
    "2 ½ cups self-rising flour (plus extra for flouring your surface)",
    "2 tsp sugar (Optional)",
    "½ tsp kosher salt",
    "4 Tbsp vegetable shortening (see Baking Tips below)",
    "4 Tbsp butter (chilled)",
    "1 cup chilled buttermilk (plus 1-2 tbsp more, if needed)",
    "1 tbsp melted butter (Optional: to brush on top of biscuits after baking)",
    "1 lb sage-flavored pork sausage",
    "¼ cup finely chopped white or yellow onion",
    "6 tbsp all purpose flour",
    "4 cups whole milk",
    "½ tsp poultry seasoning",
    "½ tsp ground nutmeg",
    "¼ tsp salt",
    "1-2 dashes of Worcestershire sauce",
    "1-2 dashes of Tabasco sauce, cayenne pepper, or other hot sauce",
    "1-2 tbsp butter or bacon grease (if needed)"
  ],
  "__v": 2
}