{
  "hash": "6f952a88d441ebf719a610f7bc84909937be1e54",
  "title": "VEGAN MAKHANI",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2014/11/Vegan-Makhani--1200x800.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/vegan-makhani/",
  "firstAdded": "2015-01-06T14:25:14.141000",
  "users": [
    null
  ],
  "keywords": [
    "protein",
    "vegan",
    "chunks",
    "time",
    "used",
    "combination",
    "extra",
    "firm",
    "tofu",
    "cutlet",
    "seitan",
    "tempeh",
    "chickpeas",
    "faux",
    "meat",
    "work",
    "swap",
    "favorite",
    "veggies",
    "mushrooms",
    "cauliflower",
    "mindful",
    "softer",
    "addins",
    "mushy",
    "long",
    "marinade",
    "container",
    "plain",
    "soy",
    "yogurt",
    "garam",
    "masala",
    "spice",
    "available",
    "major",
    "grocery",
    "stores",
    "hand",
    "youll",
    "frequently",
    "reaching",
    "depth",
    "everyday",
    "veggie",
    "sides",
    "clove",
    "mashed",
    "garlic",
    "ginger",
    "juice",
    "lime",
    "recreate",
    "tanginess",
    "missing",
    "raw",
    "cashews",
    "water",
    "olive",
    "coconut",
    "oil",
    "coat",
    "pan",
    "onion",
    "use",
    "curry",
    "flavor",
    "authentic",
    "tomatoes",
    "tomato",
    "nutritional",
    "yeast",
    "completely",
    "adds",
    "cayenne",
    "pepper",
    "salt",
    "dollop",
    "splash",
    "preparation"
  ],
  "directions": [
    "0",
    "Combine marinade ingredients in a bowl and add protein. Set aside and leave to marinate while preparing sauce.",
    "In the meantime, set cashews and water on the stove in a small pot over medium heat and cover. Bring to a low boil and lower heat. Continue to simmer, covered, while preparing other components of the dish.",
    "Heat oil in a heavy-bottomed pot. Add onion and cook over medium-low heat until translucent and beginning to caramelize.",
    "Add garlic, ginger paste, and garam masala. Stir and continue to saute until fragrant.",
    "Add chopped tomatoes, tomato paste, and a pinch of salt to the pan and stir to combine. The tomatoes will release a lot of liquid. Simmer for 30 minutes to an hour, until virtually all of the excess juices have evaporated and the tomatoes concentrate and darken in color. (You can leave the pan unattended and just check it periodically to stir.)",
    "Once mixture is reduced to a paste the consistency of jam, allow to cool slightly and combine in a blender or food processor with cashews and their liquid. Blend until creamy and the consistency of a thick soup, adding additional water by the quarter cup to thin if needed.",
    "Return to pan and add protein and any excess marinade. Simmer until heated through.",
    "Add cayenne (a couple of shakes for medium heat), nutritional yeast, if using, and a pinch of salt. Taste and adjust flavor, adding more garam masala if desired. (Be mindful that the flavor and heat of the cayenne and garam masala will build with each bite, so take a few tastes before adding more. If the gravy still tastes like mild tomato sauce, then it needs to be spiced more aggressively. If it’s bitter or too spicy to comfortably eat, add a splash or water or non-dairy milk to mellow.)",
    "Serve hot in bowls with basmati rice and/or naan. If desired, garnish each bowl with a bit of margarine or coconut oil, or a splash of oil to be stirred in at the table."
  ],
  "ingredients": [
    "0",
    "Protein:",
    "12 ounces vegan protein of your choice, cut into bite-sized chunks (This time, I used a combination of extra firm tofu cutlet and seitan. Tempeh or chickpeas, as well as any faux meat, would also work well. You can also add or swap in your favorite veggies, such as mushrooms or cauliflower. Just be mindful that softer add-ins may get a little mushy if cooked too long.)",
    "Marinade:",
    "1 container plain soy or other vegan yogurt",
    "2 tsp garam masala spice mix (Available at most major grocery stores. Once you have it on hand, you’ll frequently find yourself reaching for it to add depth to everyday veggie sides.)",
    "1 clove crushed or mashed garlic",
    "1/2 teaspoon ginger paste",
    "Juice of 1/2 lime (This is to recreate the tanginess missing from soy yogurt.)",
    "Sauce:",
    "1/2 cup raw cashews",
    "1 cup water",
    "1 tablespoon olive or coconut oil (or enough to thinly coat the bottom of your pan)",
    "1 small onion, diced",
    "2 cloves garlic",
    "1 tsp ginger paste",
    "1 tablespoon garam masala, plus additional to taste (You can also use curry powder in a pinch, but the flavor will be less authentic.)",
    "5 or 6 tomatoes, chopped",
    "1 tablespoon tomato paste",
    "1 tablespoon nutritional yeast (completely optional, but I find this adds extra depth)",
    "Cayenne pepper, to taste",
    "Salt, to taste",
    "A dollop of coconut oil, or a splash of olive oil to garnish (optional)",
    "PREPARATION"
  ],
  "__v": 1
}