{
  "hash": "d80d6dc9e8408b28fc5d1b003451ac7d54c5e2f5",
  "title": "Breakfast Pizza",
  "image": "https://8xdr12e9hk0355djl1l23bnv-wpengine.netdna-ssl.com/wp-content/uploads/2013/08/TheChic_breakfast-pizza-steps-825x1024.jpg",
  "href": "https://msrachelhollis.com/2013/08/21/breakfast-pizza/",
  "extension": "Firefox",
  "firstAdded": "2020-04-02T23:24:51.958000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 450 degrees F. If you have a pizza stone, place it in the oven to preheat, as well. Take pizza dough out of the fridge and let it sit at room temperature for 30 minutes.",
    "Meanwhile, prepare remaining ingredients. Cook tater tots and bacon. Slice Canadian bacon. Set aside until dough is ready.",
    "Place 1 1/2 tablespoons olive oil into 12-inch cast-iron skillet. Place room temperature pizza dough inside skillet. Pat into a disk using the palm of your hand.",
    "Stretch dough out starting from the center, rotating dough in the skillet to form an even 12-inch circle. If the dough is still too elastic, cover lightly with plastic wrap and let dough rest for 5-10 minutes.",
    "Use remaining 1/2 tablespoon of olive oil to coat the top of pizza dough. Place provolone cheese slices on top. Followed by sliced Canadian bacon and bacon. Arrange tater tots in such a way to allow room for cracked eggs.",
    "Place skillet over the stove on high heat. Cook for about 4 minutes. Prop the pizza every other minute or so to check on the underside of the dough. After 4 minutes, the bottom of the pizza should be set and lightly golden brown in the color. The oil should always be bubbling as this point.",
    "Remove from the stove. Crack eggs onto the pizza. Season pizza with salt and pepper. Place in oven for 8-10 minutes until the cheese is bubbling and melted, and the egg whites are cooked through. Let cool slightly in skillet before transferring to cutting board to cut into slices.",
    "TheChic_slice of Breakfast Pizza",
    "the best part of waking up is breakfast pizza",
    "Best part about this pizza– you can eat it anytime of the day. I love pizza because it is the ultimate portable, hand-held meal. No forks, spoons, or plates required. Even if you have a million errands to do, once the pizza is cooked, it becomes the perfect grab-and-go meal to keep you energized and satisfied all day long.",
    "Maryanne’s Chic Tip: No need to make your own pizza dough from scratch. Store-bought pizza dough works perfectly. Let the dough sit out for at least 30 minutes before you plan to use it. Even if the package only says 10-15 minutes, give it more time. Resting the dough at room temperature relaxes the glutens in the dough allowing for easier shaping and less elasticity. If the dough still doesn’t want to cooperate, loosely cover it with plastic wrap and let it sit for another 10 minutes, then try again."
  ],
  "ingredients": [
    "0",
    "1 pound store bought pizza dough",
    "2 tbsp olive oil",
    "5 slices of provolone cheese",
    "1 cup tater tots, fried or baked",
    "4 slices of thick applewood smoked bacon, cooked and cut into small pieces",
    "3 slices Canadian bacon, cut into small pieces",
    "3 large eggs",
    "salt and black pepper, to taste",
    "fresh chives, minced, as garnish",
    "fresh thyme leaves, minced, as garnish"
  ],
  "__v": 1
}