{
  "hash": "74a4d67e106360092a04916e1b80d391d4e50022",
  "title": "Naan Bread",
  "image": "https://cmt.azureedge.net/media/naan_bread_20180806193636864045cpb4v.jpg",
  "href": "https://www.copymethat.com/r/bNvIPLl/naan-bread/",
  "extension": "",
  "firstAdded": "2018-12-29T00:25:33.321000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the oven to 200 F degrees.",
    "In a medium bowl, combine the yeast, sugar and water. Lightly whisk it all together, then let it sit for about 5 to 10 minutes or until the yeast dissolves and starts to foam.",
    "To the same bowl, add the oil, yogurt, egg and whisk well. Set aside.",
    "To the bowl of your mixer, combine the flour with the salt. Add the yeast mixture and mix for a couple minutes, until the dough comes clean from the sides of the bowl. If the dough is too wet, add a bit more flour, starting with a tablespoon at a time. The dough should be nice and soft but not sticky.",
    "Place the dough in an oiled bowl and cover it with a clean kitchen towel or plastic wrap. Turn OFF your oven, place the bowl inside and allow to rise for about 30 minutes to 1 hour or until doubled in size. I use this trick all the time to speed up the rising time. Mine only took about 40 minutes, so the time depends on your yeast and your environment.",
    "After it rises, cut the dough into 12 equal pieces and shape each piece into a small ball.",
    "Heat a large cast iron skillet over medium-high heat and add about 1 tsp of olive oil. Roll out one ball at a time until it's about 1/3 inch thick and about 5 inches in diameter. Add the piece of rolled dough to the hot skillet and cook for about 1 minute, the skillet should be very hot, so you'll see bubbles forming as you cook the dough on the first side. Flip the dough and cook the other side until the bottom is golden.",
    "Repeat with remaining dough until all of the pieces are cooked. Keep the naan covered in a towel so that it doesn't dry out. When all of them are cooked, brush each one with the melted butter and garnish with some parsley."
  ],
  "ingredients": [
    "0",
    "For Dough:",
    "2 tsp active dry yeast",
    "1 tsp sugar",
    "1/2 cup water lukewarm",
    "1/4 cup vegetable oil",
    "1 egg large",
    "1/4 cup yogurt plain",
    "2 1/2 cups all-purpose flour",
    "1/2 tsp salt",
    "Other:",
    "12 tsp olive oil",
    "4 tbsp butter melted",
    "2 tbsp parsley chopped"
  ],
  "__v": 1
}