{
  "hash": "3f6752b6c747e3f4f95cea8924bfd8f313616e2b",
  "title": "Baked Falafel",
  "image": "http://cookieandkate.com/images/2012/05/baked-falafel-recipe-7-80x110.jpg",
  "href": "http://cookieandkate.com/2012/baked-falafel/",
  "firstAdded": "2015-01-07T11:23:21.155000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "chickpeas",
    "rinsed",
    "picked",
    "soaked",
    "hour",
    "overnight",
    "medium",
    "red",
    "onion",
    "parsley",
    "leaves",
    "cilantro",
    "garlic",
    "cumin",
    "cinnamon",
    "kosher",
    "salt",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "With an oven rack in the middle position, preheat oven to 375 degrees Fahrenheit. Coat a large cast iron skillet with 1 to 2 tablespoons olive oil (use more olive oil for more of a fried effect. I couldn't fit all of the falafel into my 12-inch skillet so I used my 8-inch skillet as well, into which I poured in 1 teaspoon of olive oil).",
    "In a food processor, combine the soaked and drained chickpeas, red onion, parsley, cilantro, 2 tablespoons olive oil, garlic, cumin, cinnamon, salt and pepper. Process until smooth, about 1 minute.",
    "Using your hands, scoop out about 2 tablespoons of the mixture at a time. Shape the falafel into small patties, about 2 inches wide and ½ inch thick. Place each falafel on your oiled skillet or pan.",
    "Bake for 13 minutes, then remove the falafel from the oven and carefully flip each one. Return the pans to the oven for another 13 to 15 minutes, until the falafels are lightly browned on both sides."
  ],
  "ingredients": [
    "0",
    "3 to 4 tablespoons olive oil",
    "1 cup dried chickpeas, rinsed, picked over and soaked for at least one hour and up to overnight",
    "⅓ cup chopped red onion (about ¼th of a medium red onion, chopped)",
    "½ cup fresh parsley leaves",
    "½ cup fresh cilantro leaves",
    "3 garlic cloves, minced",
    "¼ teaspoon ground cumin",
    "⅛ teaspoon ground cinnamon",
    "1 teaspoon ground sea salt or kosher salt",
    "½ teaspoon freshly ground black pepper"
  ],
  "__v": 1
}