{
  "hash": "9bf569dfe7b55429e056271a8d412fa80d516f9f",
  "title": "Meatballs",
  "image": "https://cdn.apartmenttherapy.info/image/fetch/f_auto,q_auto,w_600,h_750,c_fit,fl_strip_profile/https://s3.amazonaws.com/pixtruder/original_images/abd338f6b7c142c9d03b060e88bb5e5d99ad1ca4",
  "href": "https://www.thekitchn.com/how-to-make-meatballs-cooking-lessons-from-the-kitchn-108048",
  "extension": "Chrome",
  "firstAdded": "2018-12-23T22:44:14.317000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine the milk and breadcrumbs. Place the breadcrumbs in a small bowl, pour in the milk, and stir to combine. Set aside while preparing the rest of the meatball mixture. The breadcrumbs will absorb the milk and become soggy.",
    "Whisk the egg, salt, pepper, Parmesan, and parsley. Whisk the egg in a large bowl until broken up. Add the Parmesan, parsley, salt, and a generous quantity of black pepper, and whisk to combine.",
    "Add the ground meat. Add the meat to the egg mixture. Use your hands to thoroughly mix the egg mixture into the ground meat.",
    "Add the onions and soaked breadcrumbs. Add the onions, garlic, and soaked breadcrumbs. Mix them thoroughly into the meat with your fingers. Try not to overwork the meat; pinch the meat between your fingers rather than kneading it.",
    "Form the meat into meatballs. Have a rimmed baking sheet ready. Pinch off a piece of the meat mixture and gently roll between your hands to form 1 1/2-inch meatballs (about 2 tablespoons each). Continue shaping until all the meat is used, placing the meatballs on the baking sheet so that they are not touching.",
    "Option 1: Roast or broil the meatballs in the oven. Broil the meatballs 20 to 25 minutes, or roast at 400°F for 25 to 30 minutes. (Watch closely if making meatballs made with lean meat.) The meatballs are done when cooked through and the outsides are browned, and when they register 165°F in the middle on an instant-read thermometer. Serve immediately.",
    "Option 2: Cook the meatballs directly in sauce. Bring a marinara or other pasta sauce to a simmer and add as many meatballs as will fit comfortably in the pan. Cover and simmer for 30 to 35 minutes. The meatballs are done when they're cooked through and register 165°F in the middle on an instant-read thermometer. Serve immediately."
  ],
  "ingredients": [
    "0",
    "1/2 cup fine, dry breadcrumbs",
    "1/2 cup milk",
    "1 large egg",
    "1/2 cup grated Parmesan cheese",
    "1/4 cup finely chopped fresh parsley leaves",
    "2 teaspoons kosher salt",
    "Freshly ground black pepper",
    "1 pound ground meat, such as beef, pork, turkey, chicken, or veal, or a mix",
    "1/2 cup finely chopped onion (or grated on a coarse grater)",
    "1 clove garlic, minced"
  ],
  "__v": 1
}