{
  "hash": "a643f3e9db842950ac26f57324c0410e43f0f0f7",
  "title": "Palak Murgh",
  "image": "http://maunikagowardhan.co.uk/wp-content/uploads/2015/07/Palak-Murgh-31-1024x683.jpg",
  "href": "http://maunikagowardhan.co.uk/cook-in-a-curry/palak-murgh-chicken-curry-with-spinach-cardamom-and-fresh-ginger/",
  "extension": "Chrome",
  "firstAdded": "2019-06-14T03:54:44.232000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Method",
    "In a large bowl mix all the marinade ingredients. Add the chicken pieces to this marinade and put a few cuts on the pieces to let the marinade soak in well. Mix well making sure all the pieces are coated. Leave overnight or even just 30 minutes is fine.",
    "Set aside a handful of spinach for later. Add the remaining spinach to a blender along with 50mls water and blend to a smooth paste. You can do this in batches if you prefer.",
    "In a blender add the ginger, garlic and chilli with 2-3 tbsps of water and blitz to a paste. Set aside.",
    "Heat a sauce pan and add the pureed spinach. Cook it on a low heat to rid of the moisture for 12-14 minutes until all the moisture has evaporated. Make sure to stir every few minutes. Set aside while you make the curry.",
    "Heat the oil in a heavy bottom saucepan. Add the whole spices including cardamom, bay leaves and cinnamon stick. Fry for 20-30 seconds. Add the onions and fry on a medium heat for 10-12 minutes. Stir well as the colour begins to change add the ginger garlic and chilli paste. Fry for a further 2 minutes stirring well. Add a splash of water if it begins to stick to the base of the pan.",
    "Make sure to scrap the base well and add the tomato puree. Fry for a couple of minutes and add the coriander powder. Stir well and add the marinated chicken pieces. Keep stirring making sure to seal the pieces well. Turn the heat up slightly and fry and seal the chicken pieces for 8-10 minutes.",
    "Now turn the heat to a low setting, season to taste and put the lid on cooking the chicken for 15-17 minutes. Stir halfway through the cooking process making sure it doesn’t stick to the bottom of the pan. Now add the pureed spinach along with the garam masala and simmer on a low heat for a further 5-7 minutes with the lid on. Turn the heat off. Chop the handful of spinach you set aside earlier and add to the gravy. Stir well.",
    "Garnish with fresh coriander, slivers of ginger and kasoori methi (if using) Serve with naan or pulao and some raita."
  ],
  "ingredients": [
    "0",
    "1 kg chicken on the bone (thighs and legs skinless)",
    "700gms spinach leaves washed and trimmed",
    "50mls water",
    "3 tbsp vegetable oil",
    "4 green cardamom pods",
    "2 bay leaves",
    "½\" cinnamon stick",
    "250gms white onion finely chopped",
    "1½\" ginger roughly chopped",
    "5 cloves of garlic roughly chopped",
    "1 birds eye chilli",
    "1 heaped tbsp tomato puree",
    "1 heaped tsp coriander powder",
    "Salt to taste",
    "½tsp garam masala powder",
    "1 tbsp chopped coriander for garnish",
    "Slivers of ginger for garnish",
    "Handful of kasoori methi/ dried crushed fenugreek leaves for garnish (optional)",
    "For the marinade;",
    "3 tbsp Greek yoghurt",
    "1 tsp turmeric powder",
    "1 tsp mild chilli powder",
    "1 ½ tsp cumin seeds crushed coarsely"
  ],
  "__v": 1
}