{
  "hash": "64b271b586a56b57e502ac3c159dbf98bf367e95",
  "title": "mediterranean pearl couscous recipe with chopped vegetables, chickpeas, and artichokes",
  "image": "https://www.themediterraneandish.com/wp-content/uploads/2015/02/Couscous-Recipe-The-Mediterranean-Dish-5-150x150.jpg",
  "href": "https://www.themediterraneandish.com/israeli-couscous-recipe/",
  "extension": "",
  "firstAdded": "2018-05-05T18:29:21.139000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To make the lemon-dill vinaigrette, place the vinaigrette ingredients in a bowl. Whisk together to combine. Set aside briefly.",
    "In a medium-sized heavy pot, heat two tablespoons of olive oil. Saute the couscous in the olive oil briefly until golden brown. Add 3 cups of boiling water (or the amount instructed on the package), and cook according to package. When ready, drain in a colander. Set aside in a bowl to cool.",
    "In a large mixing bowl, combine the remaining ingredients minus the basil and mozzarella. Then add the couscous and the basil and mix together gently.",
    "Now, give the lemon-dill vinaigrette a quick whisk and add it to the couscous salad. Mix again to combine. Test and adjust salt, if needed.",
    "Finally mix in the mozzarella cheese. Garnish with more fresh basil. Enjoy!"
  ],
  "ingredients": [
    "0",
    "for the lemon-dill vinaigrette",
    "1 large lemon, juice of",
    "1/3 cup Private Reserve extra virgin olive oil",
    "1 tsp dill weed",
    "1 tsp garlic powder",
    "salt and pepper",
    "for the israeli couscous",
    "2 cups Pearl Couscous (Israeli Couscous)",
    "Private Reserve extra virgin olive oil",
    "Water",
    "2 cups grape tomatoes, halved",
    "1/3 cup finely chopped red onions",
    "1/2 English cucumber, finely chopped",
    "15 oz can chickpeas",
    "14 oz can good quality artichoke hearts, roughly chopped if needed",
    "1/2 cup good pitted kalamta olives",
    "15-20 fresh basil leaves, roughly chopped or torn; more for garnish",
    "3 oz fresh baby mozzarella (or feta cheese), optional"
  ],
  "__v": 1
}