{
  "__v": 1,
  "directions": [
    "0",
    "Season the chicken breasts with taco seasoning on both sides. Heat the skillet on medium-high heat, add oil, then sear chicken about 3-4 minutes on each side. Remove from heat and keep the skillet covered to allow chicken to continue cooking off heat until no longer pink in the middle. Cool the breasts then slice them into small cubes",
    "Combine other ingredients (spinach, tomatoes, green onions, red onion, red bell pepper, grated sharp cheddar cheese) and cubed chicken (from step 1) in a large mixing bowl. Drizzle with the desired amount of Ranch dressing (or Greek yogurt based dressing), and toss.",
    "Spoon the chicken and spinach mixture evenly on top of tortilla. Roll up. Use tooth picks at two opposite ends of each tortilla to help it hold it together, if desired. Serve immediately. Or, remove tooth picks, wrap tightly in plastic wrap and refrigerate."
  ],
  "firstAdded": "2014-06-06T12:20:05.666000",
  "hash": "5e7db5c251fb442715a91b3d5985f3017413afa4",
  "href": "http://juliasalbum.com/2014/05/mexican-chicken-wraps/",
  "image": "https://farm3.staticflickr.com/2923/14225945856_589fa179a2_c.jpg",
  "ingredients": [
    "0",
    "2 tablespoons vegetable Oil",
    "2 skinless chicken breasts",
    "2 tablespoons taco seasoning",
    "6 cups spinach, shredded, or 1 head green leaf lettuce, shredded or torn into bite-size pieces",
    "3 medium tomatoes, diced",
    "4 green onions, chopped",
    "1/4 cup red onion, chopped",
    "1 red bell pepper, thinly sliced",
    "1/2 cup grated sharp cheddar cheese",
    "flour tortilla wraps (or gluten-free tortillas or sandwich wraps)",
    "Ranch salad dressing",
    "Greek yogurt mixed with the taco seasoning and chopped cilantro"
  ],
  "keywords": [
    "oil",
    "skinless",
    "chicken",
    "breasts",
    "taco",
    "seasoning",
    "spinach",
    "head",
    "green",
    "leaf",
    "lettuce",
    "torn",
    "bitesize",
    "pieces",
    "medium",
    "tomatoes",
    "onions",
    "red",
    "onion",
    "bell",
    "pepper",
    "sharp",
    "cheddar",
    "cheese",
    "flour",
    "tortilla",
    "glutenfree",
    "tortillas",
    "sandwich",
    "wraps",
    "ranch",
    "salad",
    "dressing",
    "greek",
    "yogurt",
    "mixed",
    "cilantro"
  ],
  "title": "Mexican chicken wraps",
  "users": [
    null
  ]
}