{
  "hash": "8a5fb1a123acb513f17d88ff8b63f49af1a4a597",
  "title": "honey sriracha chicken and cashew stir fry",
  "image": "http://www.healthyseasonalrecipes.com/wp-content/uploads/2014/12/honey-sriracha-chicken-cashew-stirfry-sq-053.jpg",
  "href": "http://www.healthyseasonalrecipes.com/honey-sriracha-chicken-cashew-stir-fry/",
  "firstAdded": "2014-12-19T17:03:00.576000",
  "users": [
    null
  ],
  "keywords": [
    "honey",
    "sriracha",
    "chicken",
    "cabbage",
    "stirfry",
    "dry",
    "sherry",
    "shao",
    "shing",
    "cooking",
    "wine",
    "white",
    "vinegar",
    "salt",
    "avocado",
    "organic",
    "canola",
    "oil",
    "divided",
    "boneless",
    "skinless",
    "breast",
    "cubes",
    "garlic",
    "ginger",
    "root",
    "green",
    "reducedsodium",
    "broth",
    "corn",
    "starch",
    "scallions",
    "cilantro",
    "leaves",
    "cashews",
    "preferably",
    "roasted",
    "unsalted"
  ],
  "directions": [
    "0",
    "Stir honey, sherry, vinegar, sriracha and salt in a small bowl.",
    "Heat 1tablespoons oil in a large skillet or wok over high heat until shimmering but not smoking. Swirl around the bottom of the wok. Add the chicken in a single layer, and let cook, undisturbed until browned on the bottom, 2 to 4 minutes. Turn over and continue cooking stirring once or twice, until no longer pink on the outside, 2 to 3 minutes longer. Remove the chicken from the skillet or wok with a spatula and set aside on a plate. NOTE: The chicken will continue cooking in a later step.",
    "Add the remaining 2 teaspoons oil to the skillet or wok and return to high heat. Add garlic and ginger, and stir fry until fragrant but not browned about 30 seconds. Add cabbage, and stir to coat with the garlic and ginger. Stir in the sauce. Cover cook until the cabbage is wilted, 2 to 3 minutes.",
    "Stir broth and cornstarch together in a small dish and stir into the chicken, cabbage mixture. Bring to a simmer, stirring constantly. Add the chicken and any accumulated juice from the plate and bring to a simmer, stirring often. Cook until the chicken is cooked through and the cabbage is tender, 2 to 3 minutes.",
    "Remove from the heat and stir in scallions or cilantro and cashews."
  ],
  "ingredients": [
    "0",
    "Honey Sriracha Chicken and Cabbage Stir-fry",
    "¼ cup honey",
    "2 tablespoons dry sherry or Shao Shing cooking wine",
    "1 tablespoon white vinegar",
    "1 tablespoon sriracha, or to taste",
    "1 ¼ teaspoon salt",
    "1 tablespoon plus 2 teaspoons avocado oil or organic canola oil, divided",
    "1 pound boneless, skinless chicken breast, cut into bite-sized cubes",
    "1 tablespoon finely chopped garlic",
    "1 teaspoon grated ginger root",
    "6 cups chopped green cabbage",
    "¼ cup reduced-sodium chicken broth",
    "2 teaspoons corn starch",
    "3 scallions, sliced or 3 tablespoons chopped cilantro leaves",
    "½ cup chopped cashews, preferably roasted unsalted"
  ],
  "__v": 1
}