{
  "hash": "d7341de590c9c8be6c47d487f37fb63eb0d89301",
  "title": "Cucumber Sunomono\nJapanese cucumber salad is a refreshing, light, and delicious side dish. It is made from thinly sliced cucumber marinated in rice vinegar so it is very healthy!",
  "image": "https://www.chopstickchronicles.com/wp-content/uploads/2016/06/Cucumber-sunomono-update-26-680x450.jpg",
  "href": "https://www.chopstickchronicles.com/cucumber-sunomono/",
  "extension": "Chrome",
  "firstAdded": "2018-12-31T04:26:45.357000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Amazu",
    "Combine all Amazu ingredients in a small bowl, stir them, and set aside.",
    "Preparing cucmbers",
    "Wash and slice the cucumbers 2mm(0.078inch) thick.",
    "Place the sliced cucumbers into a small bowl and sprinkle the 2tsp of salt.",
    "Toss the cucumbers and salt in order to coat the cucumbers evenly with salt.",
    "Leave the cucumber with salt for 10 minutes to get the water out of the cucumbers.",
    "Place the dried seaweed in a small bowl with 2 cups of water and set aside for 10 minutes.",
    "Drain and squeeze the water out of the cucumber and seaweed.",
    "Place the cucumber and seaweed in a mixing bowl and pour Amazu vinegar mixture over the cucumber.",
    "Serve it in a small bowl and sprinkle with white sesame seeds.",
    "Notes",
    "Other vinegars can be replaced - white vinegar, apple cider vinegar, balsamic vinegar, wine vinegar but each different vinegar will taste differently.",
    "Vietnamese cucumbers or continental cucumbers are recommended to use for this recipe.",
    "Wakame seaweed can be replaced with bits of cooked octopus, and Shirasu baby fish (cooked and dried)",
    "Instead of sprinkling white sesame seeds, garnish with finely chopped ginger is delicious too.",
    "Nutrition",
    "Calories: 30kcal | Carbohydrates: 5g | Protein: 1g | Sodium: 2723mg | Potassium: 204mg | Fiber: 1g | Sugar: 3g | Vitamin A: 2.2% | Vitamin C: 5.8% | Calcium: 2.1% | Iron: 2.6%"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 cucumber",
    "5 g dried seaweed wakame mix",
    "2 tsp salt",
    "Amazu",
    "2 tsp rice vinegar",
    "2 tsp mirin",
    "2 tsp ususkuchi soy sauce",
    "sesame seeds to sprinkle"
  ],
  "__v": 1
}