{
  "hash": "c16969e70be21c10b2b1da99bc86b1645e528f49",
  "title": "Short Rib Mac and Cheese",
  "image": "https://i2.wp.com/www.thesecretingredientis.com/wp-content/uploads/2016/10/IMG_0673.jpeg?resize=780%2C1170",
  "href": "http://www.thesecretingredientis.com/short-rib-mac-and-cheese/",
  "extension": "Chrome",
  "firstAdded": "2017-06-15T02:43:11.395000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "For the short ribs:",
    "I cooked mine overnight so they were ready the next day, but you can also do this the morning of, just keep in mind that they will take about 8 hours in the slow cooker.",
    "Heat a large cast iron skillet over medium-high heat, add the olive oil. Season the short ribs with salt and pepper, and add the ribs to the skillet. Sear the ribs on all sides for about a minute. Remove, then place the ribs in the crockpot.",
    "Add the onion, garlic, red wine, tomato paste, beef broth, and thyme sprigs to the crockpot. Season with salt and pepper. Cover and cook on low for 8 hours, or on high for 6 hours.",
    "Once the short ribs are done cooking, they should easily fall off the bone. Remove the ribs from the crockpot, discard any of the fat and the bones, and use two forks to shred the ribs into pieces. You can either put the shredded short ribs back into the crockpot to keep warm, or transfer them to a bowl while you prepare the mac and cheese.",
    "For the mac and cheese:",
    "Preheat the oven to 350 degrees F.",
    "Bring a large pot of salted water to a bowl, and cook the pasta. I recommend undercooking the pasta by 2-3 minutes, because it's going to cook more in the oven. Drain the pasta and set aside.",
    "In a large pot, melt the butter over medium-high heat. Add the flour, and whisk until well combined to create a roux, until golden and fragrant.",
    "In a large pot, melt the remaining 4 tablespoons butter over medium-high heat. Add the flour, whisking until combined to create a roux. Cook for 1 to 2 minutes until it's golden and fragrant. Pour in the milk, whisking constantly until the mixture thickens, and cook about 3-5 minutes. Reduce heat to medium-low, and add in the all of the cheddar and 2 ounces of the gruyere cheese, stir until the cheese melts. Season with chili powder, paprika , salt and pepper. Stir in the cooked pasta and the shredded short ribs.",
    "Transfer the mixture to a cast-iron skillet or a baking dish. Top with the panko breadcrumbs and the remaining gruyere cheese. Bake until the top is golden and the cheese is melted, about 15-20 minutes. Garnish with fresh thyme!"
  ],
  "ingredients": [
    "0",
    "For the short ribs:",
    "1 tablespoon olive oil",
    "3 pounds bone-in beef short ribs",
    "1 small yellow onion, chopped",
    "2 cloves garlic, minced",
    "1½ cups red wine",
    "1 6-ounce can tomato paste",
    "1¼ cups beef broth",
    "4 sprigs fresh thyme",
    "Salt and pepper",
    "For the mac and cheese:",
    "8 ounces Barilla proteinplus penne (or simiilar noodle)",
    "4 tablespoons unsalted butter",
    "¼ cup all-purpose flour",
    "2 cups milk",
    "8 ounces white cheddar cheese, freshly grated",
    "4 ounces gruyere cheese, freshly grated",
    "1 teaspoon chili powder",
    "½ teaspoon paprika",
    "¼ cup panko breadcrumbs",
    "Salt and pepper",
    "Fresh thyme sprigs for garnish"
  ],
  "__v": 1
}