{
  "__v": 2,
  "directions": [
    "0",
    "Cut 3 tablespoons butter into 6 pieces and place in a food processor; add bread. Pulse 10 to 15 times, until bread crumbs are no larger than 1/8 inch. Set aside.",
    "If using an electric oven, place an oven rack in the lower-middle position; heat the broiler. If using a gas oven, place an oven rack in the middle position; preheat the oven to 500 degrees.",
    "Meanwhile, bring 4 quarts water to a rolling boil in a Dutch oven over high heat. Add macaroni and 1 tablespoon salt; stir to separate the noodles. Cook until pasta is tender. Drain in colander; set aside.",
    "Add remaining 5 tablespoons butter to the Dutch oven; place over medium-high heat until butter foams. Add flour, mustard and cayenne; whisk well to combine. Continue whisking until the mixture becomes fragrant and deepens in color, about 1 minute. Whisking constantly, gradually add milk; bring to a full boil, whisking constantly, then reduce the heat to medium and simmer, whisking occasionally, until thickened to the consistency of whipping cream, about 5 minutes.",
    "Remove from heat; whisk in the cheeses and 1 teaspoon salt until the cheeses are fully melted. Add pasta; cook over medium-low heat, stirring constantly, until mixture is heated through, about 6 minutes.",
    "Transfer the mixture to a 13x9 inch baking dish (if using an electric oven, use a broiler-safe dish); sprinkle evenly with the bread crumbs. In an electric oven, broil until the crumbs are deep golden brown, 3 to 5 minutes, rotating the pan if necessary for even browning. In a gas oven, bake until the topping is golden brown, about 5 to 7 minutes. Let cool about 5 minutes, then serve."
  ],
  "firstAdded": "2014-11-17T16:56:50.096000",
  "hash": "11c87acbd151963fffc9cb1c56d329f40725bfea",
  "href": "http://www.pepperplate.com/recipes/view.aspx?id=3416293",
  "image": "",
  "ingredients": [
    "0",
    "8 tablespoons cold unsalted butter (1 stick), divided",
    "6 slices good-quality white sandwich bread, torn into rough pieces",
    "1 pound elbow macaroni",
    "* salt",
    "1/4",
    "1/4 cup plus 2 tablespoons all-purpose flour",
    "1 1/2 teaspoons dry mustard",
    "1/4 teaspoon cayenne pepper (optional)",
    "5 cups whole milk",
    "8 ounces Monterey Jack cheese, shredded (2 cups)",
    "8 ounces Sharp cheddar cheese, shredded (2 cups)"
  ],
  "keywords": [
    "cold",
    "unsalted",
    "butter",
    "divided",
    "slices",
    "goodquality",
    "white",
    "sandwich",
    "bread",
    "torn",
    "rough",
    "pieces",
    "elbow",
    "macaroni",
    "salt",
    "allpurpose",
    "flour",
    "dry",
    "mustard",
    "cayenne",
    "pepper",
    "milk",
    "monterey",
    "jack",
    "cheese",
    "sharp",
    "cheddar"
  ],
  "title": "Classic Macaroni and Cheese",
  "users": [
    null
  ]
}