{
  "hash": "b672819a9e8773944b2a83b7180e36ad1f604007",
  "title": "Chocolate Fudge Banana Oat Bars",
  "image": "http://www.runningwithspoons.com/wp-content/uploads/2015/12/Chocolate-Fudge-Banana-Oat-Bars.jpg",
  "href": "http://www.runningwithspoons.com/2015/12/15/soft-baked-chocolate-fudge-banana-oat-bars/",
  "extension": "Chrome",
  "firstAdded": "2016-02-09T11:30:50.493000",
  "users": [
    null
  ],
  "keywords": [
    "medjool",
    "dates",
    "cocoa",
    "water",
    "rolled",
    "oats",
    "divided",
    "baking",
    "salt",
    "bananas",
    "mashed",
    "maple",
    "syrup",
    "vanilla"
  ],
  "directions": [
    "0",
    "Preheat oven to 375F and prepare an 8x8 baking dish by lining it with a sheet of aluminum foil or parchment paper, leaving a few inches of overhang on the sides to allow for easy removal. Spray foil with cooking spray and set aside.",
    "To make the banana oat base, place 1 cup of oats in a food processor or high speed blender, and process until they resemble a fine flour. Transfer the oat flour to a large mixing bowl, and add the remaining rolled oats, baking powder, and salt, mixing well. Add the mashed bananas, maple syrup, and vanilla extract, and mix until everything is well combined and a dough is formed. Set aside.",
    "To make the filling, add the dates, cocoa powder, and water to the now empty food processor or blender, and process until the dates have broken down into a paste. Stop and scrape down the sides of the bowl as needed, and add a splash of water if the mixture is being stubborn.",
    "Transfer ⅔ of the mixture into your prepared baking pan, using your fingers or a spatula to ensure that it is pressed down tightly and evenly. Spoon chocolate fudge filling over the surface, and use a spatula or knife to spread it evenly, making sure to only go within ¼ of the edge to prevent burning. Sprinkle remaining oat mixture on top, using a fork to break up bigger chunks and spread it around.",
    "Bake for 30 minutes until the top turns a light golden brown. Remove from oven and allow to fully cool in pan before cutting into bars. Store in air-tight container for up to a week."
  ],
  "ingredients": [
    "0",
    "1 1/2 cups Medjool dates (~150g)",
    "1/4 cup unsweetened cocoa powder",
    "1/4 cup water",
    "1",
    "2 cups rolled oats, divided*",
    "1 tsp. baking powder",
    "1/4 tsp. salt",
    "2 large ripe bananas, mashed (~1 cup)",
    "¼ cup maple syrup",
    "1 tsp. vanilla extract"
  ],
  "__v": 1
}