{
  "hash": "aecfcffd06ebe38822bd73f3aeea0499742d228e",
  "title": "Dutch Oven Enchiladas - Cabela's",
  "image": "",
  "href": "https://www.keyingredient.com/recipes/2610905032/dutch-oven-enchiladas-cabelas/",
  "extension": "Chrome",
  "firstAdded": "2020-01-22T15:07:24.834000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Trim fat from turkey breasts and then tenderize by soaking in buttermilk overnight in the refrigerator, or tenderize by pounding with tenderizing hammer. Cube tenderized turkey into bite-size pieces and season with favorite poultry or all-purpose seasoning, such as Cabela's Open Season Wild Game or Lawry's; grill until just done, but not overdone.",
    "Cut turkey strips into ½-inch (or bite-size) chunks and place in 12- or 14-inch Dutch oven.",
    "Add diced onions and half the 28-oz can of enchilada sauce and mix everything together.",
    "Remove half of the meat/sauce mixture and place it in a separate bowl.",
    "Place a layer of tortillas over the remaining meat mixture in the Dutch oven. Tear tortillas in pieces to fill gaps in the layer.",
    "Spread a layer (half 30-oz can) of refried beans over tortillas (Add half of the spare can to thicken the layer, if you like refried beans or expect big crowd, big appetites).",
    "Sprinkle with half the grated cheese",
    "Add another layer of tortillas",
    "Pour half of remaining big can of enchilada sauce over top",
    "Then layer of sliced mushrooms and canned whole corn",
    "Add another layer of tortillas",
    "Spread remaining meat mixture, then add a layer of tortillas, then refried bean, then tortillas",
    "After that, pour the rest of the big can of enchilada sauce over the top",
    "Add sliced mushrooms and canned corn",
    "Top with layer of tortillas",
    "Pour 10-ounce can of enchilada sauce over the top",
    "Sprinkle on remaining shredded cheese",
    "Bake with 8 to 10 briquettes on the bottom and 16 to 18 on the top for 30 to 40 minutes. Sauce should be simmering and cheese well melted.",
    "​"
  ],
  "ingredients": [
    "0",
    "2 breasts of wild/tame turkey (or 4-6 chicken breasts)",
    "1 onion, diced",
    "Refried beans, 30-oz can (Have a spare 16-ounce can on hand)",
    "Enchilada Sauce, one 28-oz can and one 10-oz can",
    "Whole kernel corn, one 15-oz can (drained)",
    "Mushrooms, 8-oz, sliced",
    "Tortillas (approx. 4-5 per layer)",
    "1 lb grated cheddar cheese"
  ],
  "__v": 1
}