{
  "hash": "a584e1b780e7f91954bbaa45df7c9d05ea214ec0",
  "title": "Tarta de ricota (cheesecake al estilo argentino)",
  "image": "http://estaticos.fimagenes.com/imagenesred/11244942.jpg",
  "href": "http://cocina.facilisimo.com/blogs/recetas-postres/tarta-de-ricota-cheesecake-al-estilo-argentino_1669942.html",
  "extension": "Chrome",
  "firstAdded": "2015-06-30T12:05:42.916000",
  "users": [
    null
  ],
  "keywords": [
    "para",
    "masa",
    "base",
    "mantequilla",
    "temperatura",
    "ambiente",
    "azcar",
    "huevo",
    "yema",
    "harina",
    "relleno",
    "ricota",
    "requesn",
    "nata",
    "crema",
    "cda",
    "maicena",
    "huevos",
    "ralladura",
    "limn",
    "cdas",
    "dulce",
    "leche",
    "glas",
    "espolvorear",
    "impalpable"
  ],
  "directions": [
    "0",
    "De la masa de base",
    "Batir con varillas eléctricas la mantequilla junto con el azúcar hasta lograr una mezcla cremosa.Añadir el huevo, la yema y batir hasta incorporarlos.Por último, añadir la harina previamente tamizada y unir con una espátula hasta integrar todos los ingredientes. Esta masa no es necesario amasarla demasiado.[En Thermomix: colocar todos los ingredientes en el vaso y programar 20 seg/vel 6]Guardar la masa en una bolsa de plástico y reservar en el frigorífico al menos 30 minutos.Preparar un molde redondo desmontable, y rociarlo con spray desmoldante, o bien engrasarlo con mantequilla.A continuación, estirar la masa con un rodillo sobre una mesada enharinada. Estirarla hasta dejarla de unos 0,5 cm de grosor y volcarla con cuidado sobre el molde, cubriendo el fondo y los laterales y presionando para que quede adherida. Si la masa se rompe al intentar transferirla al molde, no te preocupes, colócala por pedacitos y luego en el molde terminar de unir presionando con los dedos los trozos.",
    "Del relleno",
    "En un bol, batir la ricota con la nata (crema de leche), el azúcar y la ralladura de limón. Agregar los huevos y la maicena y batir suavemente hasta conseguir una mezcla homogénea.[En Thermomix: colocar la ricota con el azúcar, la nata (crema de leche) y la ralladura de limón y programar 10 seg/vel 5. Programar a continuación 20 seg/vel 3 e introducir los huevos por el bocal, uno a uno, y finalmente la maicena]Untar la base de masa con el dulce de leche y verter encima la mezcla de relleno de ricota.Hornear en horno precalentado a 180ºC durante 40 minutos y luego bajar la temperatura a 150ºC y continuar el horneado durante 50 minutos más. Pasado ese tiempo, apagar el horno y dejar la tarta en su interior, hasta que enfríe completamente.Refrigerar al menos 6 horas, y antes de consumir, espolvorear azúcar glas.",
    "Notas",
    "? Yo he utilizado un molde desmontable de 20 cm de diámetro, pero si es la primera vez que haces un cheesecake, te recomiendo empezar usando un molde más grande (25 cm de diámetro) para que el relleno no sea tan alto y no tengas decepciones con el horneado. Debes conocer muy bien tu horno para lograr un cheesecake perfecto, así es que si no es así, hazme caso, hazlo en un molde más grande y hornéalo durante 1 hora a 180ºC. Recuerda dejarlo enfriar dentro del horno!? Un truco para que los cheesecakes no se hundan en el medio y su superficie sea pareja, es hornearlos a baño María: introduce una fuente con agua caliente en la base del horno, a ser posible más grande que el molde de la tarta. Encima, como siempre, la rejilla del horno con la tarta encima, y voilá, a esperar el cheesecake perfecto!? En Argentina es habitual encontrar la Tarta de Ricota en todas las pastelerías, y en algunos casos, también se cubre la superficie con masa..."
  ],
  "ingredients": [
    "0",
    "Para la masa de base",
    "- 75 g de mantequilla a temperatura ambiente- 100 de azúcar- 1 huevo- 1 yema- 250 g de harina",
    "Para el relleno",
    "- 500 g de ricota (requesón)- 200 g de nata (crema de leche) (crema de leche)- 200 g de azúcar- 1 cda. de maicena- 3 huevos- ralladura de 1 limón- 3 cdas. de dulce de leche- azúcar glas para espolvorear (azúcar impalpable)"
  ],
  "__v": 1
}