{
  "hash": "f6f48ea0a48fbd4fc3011e0b56850d99685b1397",
  "title": "Broccoli Aglio e Olio with Gremolata Breadcrumbs",
  "image": "//images.food52.com/-VWBrp7eZtUZQIHPo64BjhTOhzM=/753x502/71f24aac-274a-46c6-b3ae-cdd10e5286da--2014-0311_CP_broccoli-aglio-olio-gremolata-breadcrumbs-013.jpg",
  "href": "http://food52.com/recipes/2655-broccoli-aglio-e-olio-with-gremolata-breadcrumbs?utm_source=yahoofood&utm_medium=referral&utm_campaign=spaghetticrecipestomakeagainandagain",
  "extension": "Chrome",
  "firstAdded": "2016-01-21T09:49:49.454000",
  "users": [
    null
  ],
  "keywords": [
    "salt",
    "bunches",
    "broccoli",
    "florets",
    "olive",
    "oil",
    "spaghetti",
    "wheat",
    "semolina",
    "work",
    "garlic",
    "fat",
    "anchovy",
    "fillets",
    "aleppo",
    "pepper",
    "clove",
    "lemon",
    "zest",
    "parsley",
    "bread",
    "crumbs",
    "use"
  ],
  "directions": [
    "0",
    "Heat oven to 425° F.",
    "Put a pot of salted water on to boil for the spaghetti.",
    "Place broccoli florets on a half sheet pan. Drizzle 2 tablespoons olive oil over top and toss to coat. Sprinkle a little kosher or sea salt over top. Roast in oven for 15 to 20 minutes. You want them to cook through and brown a little. Throw the little tiny florets and bits of broccoli into the pan as well -- they will crisp up a bit and provide a nice crunch.",
    "Once the water is boiling, add the pasta and cook to \"al dente\" according to directions on the package.",
    "Heat a high-sided sauté pan, with enough room for the whole recipe, over medium to medium-low heat. Add the 1/4 cup olive oil and then the 5 cloves of garlic. Let the garlic soften and brown a little, but not burn. Add the anchovies and stir until the anchovies dissolve. Add the Aleppo pepper and a sprinkle of salt. Once everything is mixed, leave the burner on very low to keep this warm.",
    "Heat up a small skillet over medium heat and add 1 tablespoon olive oil. Add the remaining garlic and let it soften and lightly brown. Add the lemon zest and parsley, and then the bread crumbs and mix well. Lower burner to medium-low and let the bread crumb mixture toast lightly.",
    "Once the broccoli is well roasted, add it to the pan with the garlic and anchovy. Mix well to coat.",
    "Reserve 1/2 cup pasta water and drain the pasta. Add the pasta to the pan and toss well. If the mixture seems dry, add some of the pasta water a few splashes at a time.",
    "Add about 3/4 of the bread crumb mixture to the pan and mix well.",
    "Once the pasta mixture is in a serving dish, sprinkle the remaining bread crumbs over the top."
  ],
  "ingredients": [
    "0",
    "Salt, to taste",
    "1 large bunches broccoli, cut into florets (about 6 cups)",
    "1/4 cup olive oil, plus 2 tablespoons",
    "3/4 pound spaghetti, whole wheat or semolina, both work fine",
    "5 cloves garlic, minced",
    "2 fat anchovy fillets",
    "1 teaspoon Aleppo pepper",
    "1",
    "1 tablespoon olive oil",
    "1 clove garlic, minced",
    "2 teaspoons lemon zest",
    "2 tablespoons chopped parsley",
    "1/3 cup bread crumbs (I use whole wheat)"
  ],
  "__v": 1
}