{
  "__v": 1,
  "directions": [
    "0",
    "Put warm water in a bowl, add sugar and yeast. Stir and let sit for a couple of minutes. Gradually stir in flour and salt until dough pulls from sides of bowl. Lightly flour a surface and put dough onto it to knead.",
    "Knead dough for 3 minutes. Then clean and grease the bowl in which you will let the dough rise. Before putting in dough, knead another 3 minutes.",
    "Form the dough into a ball and put into the greased bowl, turning to grease all sides of the dough. Cover with a damp clean dishtowel and let rise until it doubles its size, about 1 to 2 hours.",
    "Punch down the dough with fist and knead for a minute or so to work out the air. Cut dough in half and form two loaves. Sprinkle cornmeal on a baking sheet, place loaves onto the sheet, and let rise for 45 minutes.",
    "Set the oven to 450F (230C / Gas Mark 8) and preheat for 15 minutes. Put a pan on the bottom rack and pour 2 or so cups of boiling water into it. Put the cookie sheet with bread on the rack above the water, and bake for 20 minutes. When the baking time is over, turn off the oven and leave in the bread for 5 more minutes.",
    "To keep, freeze in foil (after cooled) or leave at room temperature in a paper bag. Either of these are better for bread than refrigeration."
  ],
  "firstAdded": "2014-11-18T00:07:28.905000",
  "hash": "f7c6675a7f732887ec40b2a8e37df4686c9db591",
  "href": "http://www.bigoven.com/recipe/basic-bread/159335",
  "image": "http://mda.bigoven.com/pics/rs/256/basic-bread-4.jpg",
  "ingredients": [
    "0",
    "1 package Yeast; active dry yeast",
    "1 tablespoon Sugar",
    "5.5 cups All purpose flour",
    "1 tablespoon Salt",
    "0.25 cup Cornmeal",
    "2 cups Water; warm - not over 110 F",
    "2 cups Water; boiling"
  ],
  "keywords": [
    "active",
    "dry",
    "yeast",
    "sugar",
    "purpose",
    "flour",
    "salt",
    "cornmeal",
    "water",
    "boiling"
  ],
  "title": "Basic Bread",
  "users": [
    null
  ]
}