{
  "hash": "dbca8f0564bf07a15e8b99363524da27e1c3e27b",
  "title": "FARRO GRAIN CACIO E PEPE",
  "image": "https://images.squarespace-cdn.com/content/v1/528997b1e4b0ae3ab6b96563/1399938223165-DQ37MKC0TF9Z6IDKKAVN/ke17ZwdGBToddI8pDm48kLR4HjMe16aCHIVcvgOZ31EUqsxRUqqbr1mOJYKfIPR7LoDQ9mXPOjoJoqy81S2I8N_N4V1vUb5AoIIIbLZhVYxCRW4BPu10St3TBAUQYVKcMZfVDM3pZOlP1hLv09trMZvJLJu3bjM6essiIMkL10uBHc6mzswZt8Q6_XEwuqt1/farro+grain+cacio+e+pepe+%7C+roux+studio?format=750w",
  "href": "http://www.roux-studio.com/roux-studio/what-i-eat-when-i-eat-alone-farro-grain-cacio-e-pepe",
  "extension": "Chrome",
  "firstAdded": "2019-10-04T10:30:15.075000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Begin by covering the farro in water and allow to soak for at least an hour. This step is less necessary for Italian farro (as opposed to the tougher Egyptian variety) but after soaking for 4 hours the farro barley needs 15 minutes to cook.",
    "When you are ready to eat, drain the farro and bring one cup of water to a bowl in a small pan (if you've skipped the soaking step, you will need two cups of water). Salt the water, add the farro, and stir occasionally for 10-15 minutes (depending on soaking time).",
    "When the farro is soft, but still retaining a bit of chew add the cheese and another half cup of water continuing to simmer the grains to form a creamy sauce. Add fresh cracked pepper, 20! 30! 40! turns of the grinder. Or if you are resourceful, perhaps you can use this.",
    "Serve the grains with more cheese, pepper, and olive oil, or skip the frills and eat it from the pot (still using caution not to burn your mouth...you're alone, not uncivil)."
  ],
  "ingredients": [
    "0",
    "Serves 1 (plus a little leftover for late night snacking)",
    "1 cup Italian Farro",
    "1-2 cups water",
    "2 TBS tasty olive (plus more to top)",
    "1/2 cup grated parmesan, pecorino (or other hard cheese of equal Italian-y, saltiness)",
    "+/- 1 tsp fresh ground pepper (I ere on the side of excessive peppering, but it's personal)",
    "sea salt"
  ],
  "__v": 1
}