{
  "hash": "c53d7cc2a0eb2e6476a9dccdf5fd1cfcfa501847",
  "title": "Vegan Collard Greens in a Slow Cooker",
  "image": "https://www.veganrunnereats.com/wp-content/uploads/2013/12/Classic-vegan-collard-greens-recipe.jpg",
  "href": "https://www.veganrunnereats.com/837/vegan-collard-greens-in-a-slow-cooker-a-southern-new-years-day-tradition/",
  "extension": "Chrome",
  "firstAdded": "2018-05-01T22:14:15.536000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Fill up a clean sink halfway with cool water. Add 2 Tbsp of white vinegar. Put the whole collard leaves into the water, stir them for a couple minutes with your hands or a big spoon - this removes any of the sand or dirt that may have stuck to the leaves.",
    "Once the leaves are clean, take them out and remove the thick central stem. Your leaves will look like this:",
    "After the stems are removed, chop all of the leaves into 1-inch squares or strips. Collards will wilt quite a bit during cooking, so there's no need to chop them more finely.",
    "Spray the bowl of your slow cooker lightly with cooking spray, add all of the ingredients except the finishing ones, lightly mix and cover with a lid.",
    "Set the slow cooker on low for 3-4 hours. Ideally, you might need to stir the greens once or twice during this time, but if you can't, they will cook just fine without stirring.",
    "About 10 minutes before the end, add the finishing ingredients, adjusting the flavors to taste."
  ],
  "ingredients": [
    "0",
    "10 cups chopped collard greens (about one large bunch)",
    "1 large yellow onion, sliced",
    "5-6 garlic cloves, sliced or minced",
    "1 cup water/vegetable broth (plus more if needed)",
    "2 Tbsp apple cider vinegar",
    "1 Tbsp smoked paprika (mild or hot, to taste)",
    "1 Tbsp chili powder",
    "1/4 Tbsp cayenne pepper",
    "2 Tbsp white vinegar - to clean the collard leaves only!",
    "1/2 tsp liquid smoke",
    "Low sodium soy sauce, to taste",
    "Black pepper, to taste",
    "6-quart slow cooker (I use this classic Crock Pot slow cooker)"
  ],
  "__v": 1
}