{
  "hash": "c8bd163b42ea84a9cce1f1234eeeb86ddaad148c",
  "title": "Homemade Sauerkraut",
  "image": "https://returntonow.net/wp-content/uploads/2017/12/25577477_10105876347713992_453304780_o-1024x821.jpg",
  "href": "https://returntonow.net/2017/12/19/ward-off-winter-colds-old-fashioned-way-homemade-sauerkraut/",
  "extension": "Firefox",
  "firstAdded": "2017-12-23T12:45:41.087000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "1. Wash your jars well.",
    "2. Chop the cabbage (and any other vegetable you want — peppers, onions, carrots, etc.) into long, thin strands.",
    "3. In a bowl, toss the sliced cabbage with the salt—it will start to weep water, which will dissolve the salt and make your brine.",
    "4. Mash the cabbage down into the quart-sized jar with a mallet, spoon or your hand.",
    "Fill the smaller jar with water and use it to press the cabbage further down into the quart jar, forcing out any air and making sure the cabbage is covered in brine. Leave it there to keep the cabbage from floating.",
    "5. Drape a towel over the jars to keep out dust and flying insects and set it on the back of your counter.",
    "A couple of times a day, plunge down on the inside jar to further pack the cabbage and raise the level of the brine until it is over the surface of the cabbage.",
    "If the brine doesn’t cover the cabbage after about 24 hours, dissolve a teaspoon of salt in 1/3 cup of water and pour it on top of the cabbage to raise the brine level. Then you can stop pushing down the weight jar."
  ],
  "ingredients": [
    "0",
    "Two glass jars, one quart-sized, wide mouth, mason jar, a smaller jar or glass (the right size to fit through the neck of the larger one), some green or purple cabbage, and some high quality salt is all you’ll need to get started.",
    "Follow the instructions below, and in as little as a week you can be eating your very own kraut.",
    "Ingredients:",
    "1 head green cabbage, about 1 3/4 pounds",
    "1 1/8 Tablespoon salt (non-iodized)"
  ],
  "__v": 1
}