{
  "hash": "af4f0ed898fc19949f4b57f5bcec7a9a02ab27a5",
  "title": "Smoked Gouda Mushroom Quesadillas",
  "image": "http://dagzhsfg97k4.cloudfront.net/wp-content/uploads/2014/07/quesadillas-5.jpg",
  "href": "http://pinchofyum.com/smoked-gouda-mushroom-quesadillas",
  "extension": "Chrome",
  "firstAdded": "2015-07-03T03:53:08.693000",
  "users": [
    null
  ],
  "keywords": [
    "yellow",
    "onion",
    "bell",
    "peppers",
    "used",
    "red",
    "olive",
    "oil",
    "butter",
    "divided",
    "white",
    "mushrooms",
    "cheese",
    "obvi",
    "smoked",
    "gouda",
    "fave",
    "flour",
    "tortillas",
    "sour",
    "cream",
    "cilantro"
  ],
  "directions": [
    "0",
    "Prep the peppers: Slice the onion and peppers into thin strips. Heat the olive oil in a large nonstick skillet over medium high heat; add the onions and saute for 3-5 minutes or until soft. Add the peppers and saute for 5 minutes until soft and roasty-looking on the outside. Transfer to a bowl.",
    "Prep the mushrooms: Wipe the skillet with a paper towel and return to the stove. Add 1½ tablespoons butter and melt over medium low heat. Add the mushrooms and saute for 5-8 minutes or until golden brown. Toss in the bowl with the peppers and onions.",
    "Assemble and cook: Wipe the skillet with a paper towel (again) and return to the stove. For each quesadilla, melt ½ tablespoon butter in the skillet and layer these ingredients directly in the pan: 1 tortilla, 2 tablespoons cheese, ⅓ cup pepper mushroom mixture, 2 tablespoons cheese, 1 tortilla. By the time you've layered them, the bottom will probably be getting a little golden brown. Press the quesadilla together with the back of a spatula to help it stick and carefully flip it over in the skillet. I usually hold my hand on the top tortilla as I flip it to keep the filling from falling out. Let the quesadilla brown for another 2-3 minutes on the other side, just enough to turn golden brown and melt the cheese. Remove and cut into wedges (and repeat for the other quesadillas). Top with sour cream, cilantro or anything else you like!"
  ],
  "ingredients": [
    "0",
    "1 yellow onion",
    "2 bell peppers (I used red and yellow)",
    "1 tablespoon olive oil",
    "4 tablespoons butter, divided",
    "16 ounces fresh sliced white mushrooms",
    "1¼ cup shredded cheese (obvi, smoked gouda is my fave)",
    "10 flour tortillas",
    "sour cream and cilantro and anything else for topping"
  ],
  "__v": 1
}