{
  "hash": "124382784ee5fc023dfc2311813b159d71a24023",
  "title": "Hungarian Mushroom Bisque",
  "image": "https://s3-us-west-2.amazonaws.com/images.soupaddict.com/hungarian-mushroom-bisque-8478-1116.jpg",
  "href": "https://soupaddict.com/2016/11/hungarian-mushroom-bisque/",
  "extension": "Chrome",
  "firstAdded": "2018-12-11T13:30:57.529000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "for the dried mushrooms",
    "In a small sauce pot, heat the beef broth on high, just until bubbles start to form on the bottom of the pot. Remove from heat and add the dried mushrooms. Stir, so they're completely submerged in the liquid. Soak for 20 minutes minimum. Pour mushrooms and soaking liquid into a blender and puree until smooth (a bullet blender does a great job here; if you have no blender, remove the mushrooms from the liquid, chop very finely, then remix with the soaking liquid). Set aside.",
    "for the roux",
    "Heat butter in a small sauce pot over medium until melted. Stir in the flour to form a paste and cook until the roux begins to darken just slightly. Pour 1/4 cup of the milk into the pot and stir to thoroughly incorporate, then add the remaining milk and soy sauce; stir. The roux should be loose, neither pasty nor thin like milk. If necessary, add chicken broth by the tablespoon until the proper consistency is reached. Set aside.",
    "for the soup",
    "Heat the olive oil in a 4-5 quart Dutch oven or soup pot until shimmering. Add the mushrooms, stir, and cover. Cook until the mushrooms have given off their liquids and have reduced and darkened significantly, about 10-12 minutes. Remove the cover, season with a big pinch of salt, and cook 5 minutes more uncovered to reduce the amount of liquid in the pot. There will still be extra liquid in the pot; that's okay.",
    "Add a splash of sherry, followed by the onions, celery, and carrots, and sauté until the sherry has cooked off and the vegetables have softened softened (about 5 minutes).",
    "Scootch the veggies and mushrooms to one side, and add 1 tablespoon of soy sauce, a splash of chicken broth, 1 tablespoon sweet paprika, and 1 teaspoon smoked paprika to the cleared space. Stir these 4 ingredients together to create a fragrant paste, then stir thoroughly into the rest of the mushroom mix. Sprinkle the dried dill onto the mix (if using).",
    "Pour in the dried mushroom puree and stir well. Add about half of the roux and mix. The soup should be quite thick. If not, add a little more roux (note that you might not use all of the roux).",
    "Add one cup of chicken broth and incorporate thoroughly. Now's the time to judge how thick/thin you want your soup to be. My preference is to add yet another 1/2 cup of broth (for a total here of 1 1/2 cups). Remember that we will, in a later step, blend up some of the mushrooms, which will add to the thickness. Let the soup come to a nice simmer, then reduce to medium-low heat.",
    "Now for the first tasting, concentrating on the soup liquid. Taste, to get a baseline idea of where things stand. Then add 1/2 tablespoon sugar and a couple of pinches of salt, stir well, and taste again. Continue adding sugar and salt by the big pinches, tasting after each addition, until the flavors are balanced, and allllmost perfect. Add 1 teaspoon of lemon juice, stir well, and taste again. The flavors should deep and earthy, but also bright with just a hint of sweetness (be careful not to tip it over into dessert sweetness - be gentle with the sugar).",
    "One more decision: if you like a chunky mushroom soup, you're good to go!",
    "If, like me, you prefer a thick soup with just a few chunks of mushrooms, remove about one cup of the chopped mushrooms from the soup and set aside. Use an immersion blender (or a regular blender), to smooth out the rest of the soup in the pot, and then return the chopped mushrooms to the pot.",
    "If you like a very smooth, velvety soup, puree the soup in a blender, working in batches as necessary. (Take care with the lid -- it will want to blow off!) You can add small amounts of the leftover chicken broth and/or milk to smooth things out. (If you do, make sure you taste again, and rebalance the salt/sugar as necessary.) Reduce heat to low, or, if storing in the fridge, turn off heat completely and let the soup cool. (To reheat, be gentle, bringing the soup up from low to medium-low and back down to low, rather than down from medium-low to low. If using a slow cooker, use low heat only, and plan on about 45 minutes for the soup to come up to temp, then switch to warm as you get closer to serving.)",
    "Just before serving, stir 1 tablespoon of sour cream into the soup. Ladle into bowls, and garnish with chopped dill leaves and a dollop of sour cream."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "for the dried mushrooms",
    "1 cup beef broth or water",
    "1 ounce dried mushrooms porcinis and shiitakes are a nice mix",
    "for the roux",
    "1 tablespoon butter",
    "1 tablespoon flour",
    "1/2 cup evaporated milk from a 12 ounce can, reserve the extra",
    "1 teaspoon low sodium soy sauce",
    "extra chicken broth from the 3 cups for the soup",
    "for the soup",
    "1 tablespoon olive oil",
    "1 1/2 pounds fresh mushrooms chopped (a mix is nice -- portabello, cremini, shiitake, oyster)",
    "dry sherry",
    "1/2 cup chopped onions",
    "1/4 cup chopped celery",
    "1/4 cup chopped carrots",
    "1 tablespoon Hungarian sweet paprika",
    "1 teaspoon smoked paprika optional",
    "1 teaspoon dried dill optional",
    "2 cups chicken broth total (this will be used in various ways)",
    "1 tablespoon granulated sugar",
    "1 to 2 teaspoons lemon juice",
    "Kosher salt",
    "1 tablespoon sour cream, plus extra for garnish if desired.",
    "Fresh or dried dill leaves for garnish (optional)"
  ],
  "__v": 1
}