{
  "hash": "de9d8e0460d00eb3ee1871f46ff6f54b0be635f2",
  "title": "Quinoa Spicy Tuna Sushi Bowl",
  "image": "",
  "href": "http://www.littlebroken.com/2014/07/28/quinoa-spicy-tuna-sushi-bowl/",
  "extension": "Chrome",
  "firstAdded": "2016-10-31T02:26:36.347000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Season tuna steaks with salt and pepper. Add sesame oil to a skillet along with tuna and sear the steaks on medium/high heat for about 45 seconds on each side or until lightly browned on the outside. You want the tuna to be seared on the outside but still have some pink in the middle.",
    "Set aside and cool completely.",
    "For the spicy mayo, mix the mayo, sriracha, green onions and lemon juice.",
    "Chop the tuna steaks into ½\" inch cubes and add to the mayo, mixing until fully coated. Chill in the refrigerator until serving time.",
    "1",
    "In the meantime, cook the quinoa according to package directions. Hold off on salt.",
    "In a large skillet, heat coconut oil on medium heat. Add garlic and ginger. Cook for 1 minute or just until fragrant. Add kale and cook stirring frequently (do not burn the garlic!) for about 4 minutes or until the kale starts to cook down. Add soy sauce and continue cooking for 4 more minutes until kale is tender soft but not completely wilted. You want your kale to be tender but still have a little crunch to it.",
    "Remove the kale from the stove. Add cooked quinoa to the kale, lemon juice and salt. Season with fresh ground pepper. Mix and set aside.",
    "2",
    "Whisk all ingredients in a small bowl.",
    "3",
    "Spoon the quinoa into a bowl. Add sliced carrots, cucumbers, and avocado to the quinoa. Top with spicy tuna. Drizzle with vinaigrette and sprinkle with sesame seeds and green onions. I served these sushi bowls when the quinoa was still hot but you can completely cool the quinoa and serve cold."
  ],
  "ingredients": [
    "0",
    "1 lb. ahi tuna steaks",
    "1½ Tbsp. sesame oil",
    "3 Tbsp. mayonnaise",
    "1 Tbsp. sriracha",
    "1½ Tbsp. green onions, plus extra",
    "½ tsp. lemon juice",
    "sea salt and fresh ground black pepper",
    "1",
    "1½ cup quinoa",
    "2 Tbsp. coconut oil",
    "2 garlic cloves, minced",
    "1½ tsp. ginger, minced",
    "3 kale leaves, stalk removed and roughly chopped (about 6½ cups)",
    "1 tsp. soy sauce",
    "3 tsp. fresh lemon juice",
    "½ tsp. sea salt",
    "fresh ground black pepper",
    "2",
    "¼ cup sesame oil",
    "2 Tbsp. soy sauce",
    "1 Tbsp. pineapple juice",
    "1 Tbsp. rice vinegar",
    "½ tsp. sriracha",
    "1 tsp. tahini",
    "1 tsp. lemon juice",
    "1 tsp. fresh ginger, grated",
    "1 garlic clove, pressed",
    "3",
    "2 medium carrots, halved and thinly sliced",
    "1 medium cucumber, halved and thinly sliced",
    "2 avocado, sliced",
    "sesame seeds"
  ],
  "__v": 1
}