{
  "hash": "926c12e25b84b4f81c5ab702160e569da120bf2c",
  "title": "Pain Management- 7 Potent and Natural Painkillers To Use Instead Of Opiates Drugs",
  "image": "http://10667-presscdn-0-56.pagely.netdna-cdn.com/wp-content/uploads/2013/06/Coconuts-In-Tree-650X.jpg",
  "href": "http://blogs.naturalnews.com/pain-management-7-potent-natural-painkillers-use-instead-opiates-drugs/",
  "extension": "Chrome",
  "firstAdded": "2016-01-29T13:41:32.481000",
  "users": [
    null
  ],
  "keywords": [
    "white",
    "willow",
    "natural",
    "painkiller",
    "properties",
    "aspirin",
    "used",
    "cure",
    "headache",
    "muscle",
    "contraction",
    "lower",
    "pain",
    "arthritis",
    "chewing",
    "bark",
    "swallowing",
    "juice",
    "help",
    "brew",
    "herb",
    "tea",
    "gums",
    "immediately",
    "treated",
    "best",
    "use",
    "toothache",
    "chew",
    "way",
    "powerful",
    "ingredient",
    "analgesic",
    "effect",
    "called",
    "eugenol",
    "released",
    "handle",
    "unique",
    "clove",
    "flavor",
    "make",
    "strong",
    "turmeric",
    "fighting",
    "kinds",
    "inflammation",
    "chronic",
    "spice",
    "helps",
    "successful",
    "recover",
    "tissues",
    "excellent",
    "detoxification",
    "improving",
    "overall",
    "health",
    "various",
    "dishes",
    "teas",
    "juices",
    "combined",
    "black",
    "pepper",
    "efficient",
    "ginger",
    "root",
    "indigenous",
    "southern",
    "china",
    "phytochemicals",
    "gingerols",
    "structurally",
    "similar",
    "cox",
    "inhibitors",
    "advil",
    "nsaids",
    "clinical",
    "studies",
    "involving",
    "responded",
    "conventional",
    "drugs",
    "didnt",
    "physicians",
    "patients",
    "muscular",
    "discomfort",
    "experienced",
    "relief",
    "andor",
    "swelling",
    "vitamin",
    "known",
    "ascorbic",
    "acid",
    "linked",
    "dutch",
    "study",
    "daily",
    "doses",
    "helped",
    "reduce",
    "people",
    "wrist",
    "fractures",
    "favorite",
    "supplement",
    "truly",
    "coconut",
    "oil",
    "contains",
    "antiinflammatory",
    "antimicrobial",
    "internally",
    "externally",
    "boosting",
    "immune",
    "reducing",
    "joint",
    "great",
    "skin",
    "moisturizer",
    "conditioner",
    "dry",
    "frizzy",
    "hair",
    "kratom",
    "strongest",
    "tropical",
    "deciduous",
    "evergreen",
    "tree",
    "coffee",
    "family",
    "native",
    "southeast",
    "asia",
    "benefits",
    "agonist",
    "means",
    "mimics",
    "effects",
    "oxycodone",
    "hydrocodone",
    "opioid",
    "painkillers"
  ],
  "directions": [
    "0",
    "By Alijuina Herw",
    "Posted Sunday, December 27, 2015 at 03:47pm EST",
    "Keywords: Epic Natural Painkillers, essential oils, food, health, herbs, Natural remedies, Opiates",
    "Lot of us use opiates for pain relief. These medications work well for awhile, but eventually the body adapts to them and develops a tolerance. These drugs are doing more harm than good to your body. Natural painkillers are plentiful and diverse throughout the world."
  ],
  "ingredients": [
    "0",
    "White Willow",
    "The bark of white willow is used as a natural painkiller. The properties found in it are more like that of aspirin. It is used to cure headache, muscle contraction, lower back pain, and arthritis. Chewing the bark and swallowing its juice will also help. You can also brew this herb as tea.",
    "Cloves",
    "Toothache and pain in the gums can be immediately treated with cloves. The best way to use cloves for toothache is to chew it because in that way a powerful ingredient with analgesic effect, called eugenol is released. If you are not able to handle the strong and unique clove flavor, make a strong cloves tea.",
    "Turmeric",
    "Turmeric helps in fighting various kinds of inflammation, chronic pain, back and muscle pain, toothache and arthritis. Also, this spice helps in successful recover of tissues and it is excellent for detoxification and improving overall health. You can add turmeric to various dishes as well as teas and juices. Turmeric is best combined with black pepper because it is most efficient used in this way.",
    "Ginger",
    "A root that is indigenous to southern China, ginger has phytochemicals called gingerols, which are structurally similar to the COX-2 inhibitors in Advil and other NSAIDs. In two clinical studies involving patients who responded to conventional drugs and those who didn’t, physicians found that 75% of arthritis patients and 100% of patients with muscular discomfort experienced relief of pain and/or swelling.",
    "Vitamin C",
    "Also known as ascorbic acid, Vitamin C has also been linked with pain relief. A Dutch study of more than 400 people found that daily doses of Vitamin C helped reduce pain in people with wrist fractures. My favorite supplement is Truly Natural Vitamin C.",
    "Coconut oil",
    "Contains natural anti-inflammatory and anti-microbial properties. It can be used internally or externally for boosting your immune system and reducing back and joint pain. It’s also great skin moisturizer as well as a hair conditioner for dry and frizzy hair.",
    "Kratom",
    "One of the strongest natural painkillers is kratom, a tropical deciduous and evergreen tree in the coffee family native to Southeast Asia. Kratom has natural painkiller benefits because it’s an opioid agonist. This means that it mimics the effects of drugs like oxycodone, hydrocodone, and other opioid painkillers."
  ],
  "__v": 1
}