{
  "hash": "330921de0d62a671fd92dd137ac7914ffc4808ad",
  "title": "Chocolate Covered Raspberry Ice Cream Bon Bons",
  "image": "http://www.allergyfreealaska.com/wp-content/uploads/2014/01/DSC_0239-V1-with-text.jpg",
  "href": "http://www.allergyfreealaska.com/2014/01/27/chocolate-covered-raspberry-ice-cream-bon-bons/",
  "extension": "Chrome",
  "firstAdded": "2016-02-06T17:06:00.625000",
  "users": [
    null
  ],
  "keywords": [
    "frozen",
    "raspberries",
    "water",
    "dates",
    "canned",
    "coconut",
    "milk",
    "extra",
    "directions",
    "make",
    "sure",
    "use",
    "fat",
    "vanilla",
    "drops",
    "nunaturals",
    "stevia",
    "maple",
    "syrup",
    "enjoy",
    "life",
    "chocolate",
    "mini",
    "chips",
    "oil"
  ],
  "directions": [
    "0",
    "In a small heavy bottomed sauce pan, heat the frozen raspberries and water over medium heat. Once the berries melt, continuously whisk them until they are completely broken up (right about when the mixture just starts to boil). Removed from heat.",
    "Place a 6-8 inch fine mesh strainer (like this one) inside a medium sized mixing bowl and pour the raspberry mixture into the strainer (be careful, it's hot!). Use the back of a large spoon to push the liquid and raspberry pulp through the strainer (see important note below) leaving nothing but the seeds behind.",
    "Discard the seeds and strain the raspberry juice a second time to ensure all of the seeds have been strained out.",
    "Place the raspberry juice in a 1 cup liquid measuring cup. Chances are you won’t have a full cup of juice, so fill up the remaining way with canned coconut milk (*this is where you would use extra coconut milk), and then place the mixture in a high powered blender.",
    "Soak the chopped dates in 1 cup of hot water for 5 minutes. Discard the liquid and place the dates in the blender with the raspberry juice mixture. Blend on high for a minute, and then add the additional 1 3/4 cups of coconut milk, vanilla extract, and stevia or maple syrup. Blend until smooth.",
    "Place the raspberry ice cream mixture in an ice cream maker, and process according to your machine’s directions. Freeze in an airtight container for at least 2 hours.",
    "Use the smallest kitchen scoop you have (like the smallest scoop pictured here) to scoop the raspberry ice cream into little balls and place them on a chilled and parchment lined baking sheet. Freeze for 30 minutes.",
    "1",
    "Melt the chocolate chips and the coconut oil over a double broiler or in a microwave (If you use a microwave be very careful not to burn the chocolate).",
    "Dip the raspberry ice cream balls, one by one, into the chocolate (I like to use a fork for this, because the excess chocolate will drip right through the slots), completely coating them. Place back onto the chilled baking sheet and freeze for another 30 minutes.",
    "Store in the freezer in an airtight container and consume within 2 weeks."
  ],
  "ingredients": [
    "0",
    "12 ounces frozen raspberries",
    "1/4 cup water",
    "1/2 cup chopped dates, packed",
    "1 3/4 cup canned coconut milk + extra, *see directions (make sure you use full fat)",
    "1/4 teaspoon vanilla extract",
    "3-5 drops NuNatural's Liquid Stevia or 1-3 teaspoons maple syrup",
    "1",
    "1 cup Enjoy Life Chocolate Mini Chips",
    "3 tablespoons coconut oil"
  ],
  "__v": 1
}