{
  "hash": "278d4a4cc63bb3fcf1f215faa5212f715aea7677",
  "title": "Healthy Fish and Chips with Sweet Potato Fries",
  "image": "http://paleogrubs.com/wp-content/uploads/2015/08/paleofishandchips.jpg",
  "href": "http://paleogrubs.com/fish-and-chips-recipe?awt_l=1mTVDU&awt_m=3giJ8MvJ8vcmO.x&omhide=true",
  "extension": "Chrome",
  "firstAdded": "2016-01-08T15:57:49.001000",
  "users": [
    null
  ],
  "keywords": [
    "potato",
    "wide",
    "strips",
    "fish",
    "filets",
    "sesame",
    "seeds",
    "flour",
    "arrowroot",
    "egg",
    "sparkling",
    "water",
    "baking",
    "salt",
    "avocado",
    "oil",
    "lard",
    "frying",
    "lemon",
    "veggies"
  ],
  "directions": [
    "0",
    "Preheat oven to 425 F.",
    "Line a baking sheet with parchment paper. Place the sweet potato fries on prepared baking sheet, drizzle with 2 tablespoon of oil and sprinkle with salt. Toss well to coat. Arrange the fries in a single layer and bake in preheated oven for 15 minutes, then stir to cook on the other side. Cook for 10 minutes more.",
    "Meanwhile, prepare the fish. In a plate mix 2 tablespoons of sesame seed flour, 1 tablespoon of arrowroot flour and pinch of salt. Mix well to combine. Cut the fish fillets into 5 inch long pieces and pat them dry well with paper towels. Season with salt and set aside.",
    "To make the batter, in a shallow bowl add the egg, remaining sesame seeds and arrowroot flour, baking powder, small pinch of salt and sparkling water. Mix well to combine. Press each fish fillet into the arrowroot-sesame seed flour mixture and shake off the excess, then dip each one in the batter.",
    "Pour oil to depth of 1/2 inch in a large skillet and heat it over medium-high heat just until it's nearly at the smoking point. Fry the fillets, in batches, 2 minutes per side or until golden brown. Remove cooked fillets from pan and place them on paper towels to drain.",
    "Serve with sweet potato fries, lemon veggies and tartar sauce."
  ],
  "ingredients": [
    "0",
    "1 large sweet potato, peeled and sliced into ¼ inch wide strips",
    "1 pound fish filets",
    "½ cup sesame seeds flour",
    "2 tablespoon arrowroot flour",
    "1 egg",
    "6 tablespoons sparkling water",
    "1 teaspoon baking powder",
    "salt to taste",
    "avocado oil or lard for frying",
    "1 lemon, cut into veggies"
  ],
  "__v": 1
}