{
  "hash": "47cfa4cbd41908298e902e05716f55a4925df2c5",
  "title": "Autumn Tabbouleh with Cauliflower, Carrots, and Golden Beets",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2016/10/2016-10-15-AutumnTabbouleh-12.jpg",
  "href": "https://www.simplyrecipes.com/recipes/autumn_tabbouleh_with_cauliflower_carrots_and_golden_beets/",
  "extension": "",
  "firstAdded": "2018-01-28T00:09:28.653000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Make the bulgur: Bring 3 cups of water to a boil in a small saucepan. When the water boils, stir in the bulgur and salt. Cover the pan and remove from heat. Let the bulgur sit for 20 to 30 minutes or until tender. Strain bulgur with a mesh strainer, shaking to remove as much water as possible.",
    "2 Prep the vegetables: Break the cauliflower into large florets and carefully slice them 1/16-inch thick on a mandolin. Next, switch to a julienne blade and julienne 1/8-inch thick to julienne carrots and beets. (The vegetables can be shredded on a box grater or in a food processor, instead.)",
    "3 Marinate the vegetables: Combine the vegetables in a large serving bowl and toss with salt and lemon juice. Set aside 20 minutes to marinate, until crisp-tender.",
    "4 Finish the salad: To the bowl with the vegetables, add the olive oil, cooked bulgur, parsley, scallions, and sherry vinegar. Stir to combine. Taste and add salt, lemon juice, or olive oil as needed.",
    "5 Let stand 30 minutes before serving: Cover and let mixture marinate at room temperature for at least 30 minutes before serving to give the flavors time to combine. (If marinating longer, set in the fridge.)",
    "Salad will keep well covered in the fridge for 3 days."
  ],
  "ingredients": [
    "0",
    "1 cup bulgur wheat",
    "1/2 teaspoon kosher salt",
    "1/4 head medium cauliflower",
    "2 medium carrots, peeled and trimmed",
    "2 small golden beets, peeled and trimmed",
    "1/4 cup freshly squeezed lemon juice",
    "1 teaspoon kosher salt",
    "1/4 cup olive oil",
    "2 cups minced parsley",
    "1 bunch scallions, trimmed and minced",
    "1 tablespoon sherry vinegar",
    "Ground black pepper or to taste"
  ],
  "__v": 1
}