{
  "__v": 1,
  "directions": [
    "0",
    "Heat oven to 160C/140C fan/gas 3.\nGrease a round, deep 20cm tin, then\nline the base and sides with non-stick\nbaking paper.",
    "Using electric beaters or a tabletop\nmixer, beat the butter, sugar, vanilla and\n¼ tsp salt together until pale and fluffy,\nthen pour in the eggs, one at a time,\ngiving the mix a really good beating\nbefore adding the next. Add 1 tbsp of the\nplain flour if the mix starts to look slimy\nrather than fluffy. Beat in the yogurt.",
    "Mix the flours; then, using a large metal\nspoon, fold them into the batter, followed\nby the milk. Spoon the mix into the tin\nand bake for 1 hr 20 mins or until well\nrisen and golden – a skewer inserted into\nthe middle should come out clean.",
    "Meanwhile, make the syrup by gently\nheating 50ml water with the sugar and\nvanilla in a pan until the sugar dissolves.\nSet aside. Once the cake is out of the\noven, leave to cool for 30 mins in the\ntin, then use a skewer to poke holes all\nover the cake, going right to the bottom.\nPour the syrup over, letting it completely\nsoak in after each addition. Leave to cool\ncompletely, then either wrap the cake\nwell or fill and ice it. If you wrap it with\nbaking parchment and cling film, the\nunfilled cake will keep well for up to 3\ndays, or in the freezer for up to a month.",
    "For ideas on how to decorate the cake and to try out some variations on this basic cake mixture, have a look at the 'Goes well with' recipes for Simple elegance wedding cake, Birthday bug cake and Summer celebration cake."
  ],
  "firstAdded": "2014-03-31T14:58:11.722000",
  "hash": "f076bd76a656cfdd0f05172e51fc41c4cc18a8c3",
  "href": "http://www.bbcgoodfood.com/recipes/10860/easy-vanilla-cake",
  "image": "http://www.bbcgoodfood.com/sites/bbcgoodfood.com/files/recipe_images/recipe-image-legacy-id--363895_10.jpg",
  "ingredients": [
    "0",
    "250g pack unsalted butter, softened, plus extra for greasing",
    "250g golden caster sugar",
    "seeds scraped from 1 vanilla pod or 1 tsp vanilla paste",
    "5 large eggs, cracked into a jug",
    "85g plain flour",
    "100g full-fat Greek yogurt (I used Total)",
    "250g self-raising flour",
    "3 tbsp semi-skimmed milk",
    "1",
    "50g golden caster sugar",
    "seeds ½ vanilla pod or ½ tsp vanilla paste"
  ],
  "keywords": [
    "pack",
    "unsalted",
    "butter",
    "softened",
    "extra",
    "greasing",
    "golden",
    "caster",
    "sugar",
    "seeds",
    "scraped",
    "pod",
    "vanilla",
    "eggs",
    "cracked",
    "jug",
    "plain",
    "flour",
    "fullfat",
    "greek",
    "yogurt",
    "used",
    "total",
    "selfraising",
    "semiskimmed",
    "milk"
  ],
  "title": "Easy vanilla cake",
  "users": [
    null
  ]
}