{
  "hash": "e67b09a82c07c889925eb301a33e28ebf9277373",
  "title": "Preserved Pears",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2010/11/preserved-pears-vertical-640.jpg",
  "href": "https://www.simplyrecipes.com/recipes/preserved_pears/",
  "extension": "",
  "firstAdded": "2018-01-28T01:45:05.594000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "If you plan on canning the pears for shelf (non-refrigerated storage), sterilize your jars by either placing them in a 200°F oven for 10 minutes, or in boiling water for 10 minutes. Once the jars are filled with pears, you'll want to process in a water bath as well. You'll need a large (12-quart if you are using pint jars, 16-quart if you are using quart jars) stock pot with a rack at the bottom (we use a steaming rack) so that the jars don't touch the bottom of the pan. Fill three quarters of the way with hot water and put on the stove to bring to a boil. While the water is heating proceed with the recipe. If you plan to freeze or refrigerate your canned pears you can skip this step.",
    "1 Peel, core, and quarter the pears. Add them to a bowl of cold water that has been acidified with lemon juice or citric acid (can use the contents of a vitamin C capsule), to help prevent discoloration of the pears from oxidation.",
    "2 In a large (5 or 6 quart) pot, add the sugar, water, and spices. Bring to a boil. Transfer the pear quarters from their lemon solution to the boiling sugar water. Let come to a boil again, cook for 5 minutes.",
    "3 Pack your canning jars with the pears. Pour the remaining syrup over the pears to cover, leaving 1/2-inch of headroom from the tops of the jars. Wipe the rims with a paper towel. Put on the lids.",
    "4 If canning for long term shelf storage (up to a year), place in a water bath for 20 minutes."
  ],
  "ingredients": [
    "0",
    "5-6 pounds Bartlett pears",
    "2 cups sugar",
    "2 quarts water",
    "2 star anise",
    "4 cardamom pods",
    "1 stick cinnamon",
    "3 to 4 1-quart canning jars or 6-8 pint jars"
  ],
  "__v": 1
}