{
  "__v": 1,
  "directions": [
    "0",
    "Scaldare il forno a 190°C. Portare a bollore abbondante acqua, salarla e lessarvi il riso per una decina di minuti.",
    "Nel frattempo, far rosolare la cipolla e fettine in due cucchiai d'olio d'oliva poi cuocere a fuoco dolce per una decina di minuti (se necessario aggiungere un po' d'acqua).",
    "Scolare il riso, condirlo con la cipolla, 2 cucchiai di parmigiano, sale, pepe e origano. Sbattare le uova poi incorporarle nel riso intiepidito. Aggiungere le olive ei pomodori a pezzi.",
    "3. Foderare una teglia quadrata o rettangolare di 20 cm con carta fornoa. Spalmarevi la metà del riso, cospargere con la mozzarella a pezzi e spalmare il resto del riso. Coaspargere con un po' di parmigiano e cuocere in forno, coperto da alluminio per un quarto d'ora. Poi scoprire e cuocere ancora una ventina di minuti. Lasciar intiepidire, poi tagliare e servire con della rughetta. Si conserva bene fino al giorno do"
  ],
  "firstAdded": "2014-10-08T20:00:14.378000",
  "hash": "2ada457daafb87ea0ec3b9dee3f488bacb6b3abb",
  "href": "http://www.undejeunerdesoleil.com/2013/03/sformato-riso-gateau-riz-sale-italien-tomates-mozzarella.html",
  "image": "http://2.bp.blogspot.com/-8sC_jFVHQj4/UTtUneFeSiI/AAAAAAAABRM/BueFfEz6tWI/s1600/Sformato_riso_gateau_riz_sale_italien.jpg",
  "ingredients": [
    "0",
    "260 g di riso (tipo Originario, Roma o anche Arborio)",
    "180 g di mozzarella di bufala",
    "3- 4 uova intere (180g-200 g)",
    "60 g d'olive nere snocciolate di qualità",
    "60 g di pomodorini secchi sott'olio",
    "1 cipolla rossa",
    "olio d'oliva, origano, parmigiano, rughetta, sale, pepe"
  ],
  "keywords": [
    "riso",
    "tipo",
    "originario",
    "roma",
    "anche",
    "arborio",
    "mozzarella",
    "bufala",
    "uova",
    "intere",
    "dolive",
    "nere",
    "snocciolate",
    "qualit",
    "pomodorini",
    "secchi",
    "sottolio",
    "cipolla",
    "rossa",
    "olio",
    "doliva",
    "origano",
    "parmigiano",
    "rughetta",
    "sale",
    "pepe"
  ],
  "title": "Sformato di riso alla mozzarella, pomodori secchi e olive",
  "users": [
    null
  ]
}