{
  "hash": "eddf6b651b62b5cc9bfd9c7e5063dad77e9aea25",
  "title": "Shrimp Pad Thai",
  "image": "https://prods3.imgix.net/images/articles/2016_09/Feature-Pad-Thai.jpg?auto=format%2Ccompress&ixjsv=2.2.3&w=750",
  "href": "https://www.tastingtable.com/cook/recipes/pad-thai-noodles-recipe-shrimp-authentic",
  "extension": "Chrome",
  "firstAdded": "2017-08-06T06:42:03.886000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium bowl, cover the noodles with boiling water. Let sit until tender, 15 to 20 minutes, then drain.",
    "In a small bowl, whisk together the tamarind, fish sauce, lime juice, sugar and pepper flakes.",
    "In a wok, heat the vegetable oil over medium-high heat. Add the garlic, scallions and ginger, and cook, stirring constantly until aromatic, 1 to 2 minutes. Add the broccoli and cook until tender, 3 to 4 minutes. Add the shrimp, bean sprouts and tofu, and cook until the shrimp is opaque, 2 to 3 minutes.",
    "Push the contents to one side of the wok and pour the eggs onto the other side. Quickly scramble the eggs until set, about 1 minute, then incorporate with the vegetables and shrimp. Add the noodles and the reserved tamarind mixture, and toss until evenly coated and the sugar has dissolved, 2 minutes more.",
    "Divide between plates and garnish with chopped peanuts and cilantro leaves, then serve with lime wedges."
  ],
  "ingredients": [
    "0",
    "8 ounces pad Thai rice noodles",
    "1 tablespoon tamarind paste",
    "1 tablespoon fish sauce",
    "1 tablespoon lime juice",
    "1 tablespoon grated palm sugar or light brown sugar",
    "Pinch red pepper flakes",
    "3 tablespoons vegetable oil",
    "2 garlic cloves, minced",
    "2 scallions, thinly sliced, greens reserved for garnish",
    "One 1-inch piece ginger, peeled and minced",
    "1 cup broccoli florets",
    "8 ounces medium shrimp, peeled and deveined",
    "1 cup bean sprouts",
    "4 ounces pressed tofu, julienned",
    "2 eggs, beaten",
    "Chopped roasted peanuts, for garnish",
    "Cilantro leaves, for garnish",
    "Lime wedges, for serving"
  ],
  "__v": 1
}