{
  "hash": "51f01a2479c64db65431442979687d7d3c353939",
  "title": "Creamy Butternut Squash Mac and Cheese with Kale",
  "image": "https://sallysbakingaddiction.com/wp-content/uploads/2015/09/creamy-butternut-squash-mac-and-cheese-with-kale-2.jpg",
  "href": "https://sallysbakingaddiction.com/2015/10/01/creamy-butternut-squash-mac-and-cheese-with-kale/",
  "extension": "Chrome",
  "firstAdded": "2018-01-05T13:07:56.644000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "Combine the squash, chicken broth, milk, and garlic in a medium saucepan over medium-high heat. Bring to a boil, then reduce heat to medium-low and allow to simmer for 20 minutes. You want the squash very tender, so pierce it with a fork to make sure it is quite soft. Set aside.",
    "Preheat oven to 375°F (191°C).",
    "Begin the pasta. I usually do this as the squash is simmering. Boil enough water for your pasta (check the package directions), then add a pinch of salt and the pasta. Cook the pasta just until al dente-- or when the pasta is still a little firm. Add the kale, and cook for another minute or two. Drain the pasta and kale. Set aside.",
    "Pour the warm butternut squash mixture (squash + liquid) into a blender. Add the yogurt, salt, and pepper. Secure the lid and blend until smooth. Pour into a very large bowl and stir in the cheese until combined. It's ok if the cheese does not fully melt. Taste the sauce-- if you'd like more salt/pepper/garlic, add more.",
    "Add the pasta and kale to the bowl and stir until combined. Pour everything into a large casserole dish, a 9x13 baking pan, or a 12-inch oven-safe skillet. Top with breadcrumbs and an extra sprinkle of cheese, if desired.",
    "Bake for 25-30 minutes or until bubbly on the sides. Serve with a sprinkle of parsley on top. Leftovers keep well in the refrigerator for 5-7 days.",
    "Make ahead tip: Great freezer recipe! Prepare the recipe through step 5, cover tightly, and freeze for up to 3 months. Thaw overnight in the refrigerator, bring to room temperature, and continue with step 6. Or prepare the dish in full and freeze up to 3 months. Thaw overnight in the refrigerator, bring to room temperature, and bake at 350°F (177°C) for 20 minutes or until warmed through.",
    "Recipe Notes:",
    "Any milk works. I typically use skim or 1%, but any dairy or nondairy milks are great.",
    "I always use nonfat Greek yogurt, but low fat or full fat work too. Instead of Greek yogurt, try 1/4 cup of cream cheese. A little more rich, but definitely worth it.",
    "I like to use closer to 1 and 2/3 cups of cheese. Lots of varieties work here! You can also sprinkle the top of the dish with more shredded cheese before going into the oven in step 5."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "4 cups peeled and cubed butternut squash (about 1 large squash)",
    "1 and 1/4 cups (300ml) chicken broth (I use low sodium)",
    "1 and 1/4 cups (300ml) milk1",
    "2 teaspoons minced garlic",
    "1 pound uncooked whole wheat penne pasta (or any shape/variety)",
    "optional: 1 - 2 cups (70-140g) kale, roughly chopped with stems discarded",
    "1/4 cup (60g) plain Greek yogurt2",
    "1 teaspoon salt",
    "1/2 teaspoon freshly ground black pepper",
    "1 and 1/2 heaping cups (150g) shredded cheese (I like gruyère or white cheddar)3",
    "optional: 1/3 cup (30g) whole wheat breadcrumbs",
    "optional: chopped fresh parsley for garnish"
  ],
  "__v": 1
}