{
  "hash": "052a82e7988df824ac2606a6af5851b70120785f",
  "title": "(Almost) raw Kiwifruit + Ginger 'Cheesecake'",
  "image": "http://4.bp.blogspot.com/-32nTMtBgbkE/VbToihAqNSI/AAAAAAAAE9o/N_Mgwg8HX80/s1600/IMG_5659%2Bsm.jpg",
  "href": "http://www.mydarlinglemonthyme.com/2015/07/raw-kiwifruit-ginger-cheesecake.html",
  "extension": "Chrome",
  "firstAdded": "2016-06-22T21:27:36.138000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To make the base, line a 28 x 18cm slice tin with baking paper, extending up and over the sides by a couple of centimetres. Place dates, almonds and coconut oil in a food processor and blend on high until relatively finely ground. Press mixture into the base of the tin, using the back of a spoon to pack down firmly.",
    "To make the filling, place drained cashews, coconut oil, lemon juice, maple syrup, vanilla and salt into a blender and blend of high until smooth (this will take mere moments if you have a high powered blender, or a little longer if you don't. If you don't, you might need to stop a few times and scrape down the sides a few times to assist blending). Transfer a little under half of the mixture to a bowl, then add grated ginger to the mixture remaining in the blender and blend on high until smooth. Pour this ginger mixture over the base and place into the freezer while you continue.",
    "Place spinach, 2 green kiwifruit, the reserved filling and extra 1 tablespoon coconut oil into the (unwashed) blender and blend on high until smooth. Remove tin from freezer and pour kiwifruit filling over the bottom layer. Smooth off with a spoon or palette knife and place into the fridge 4-5 hours (or freezer 2-3 hours if in a hurry) or overnight, until set firm.",
    "Slice remaining green and the gold kiwifruit into thin slices and arrange over the top of the cheesecake. Slice and serve. Store in the fridge in a covered container for 5-7 days or freeze for up to 1 month. Defrost on the bench 20-30 minutes before eating."
  ],
  "ingredients": [
    "0",
    "base",
    "1 1/2 cups (240g) pitted dried dates, roughly chopped",
    "2/3 cup (100g) whole raw almonds",
    "1 tablespoon virgin coconut oil, melted if solid",
    "filling",
    "3 cups (375g) raw cashew nuts, soaked overnight in cold water + drained",
    "3/4 cup (185ml) virgin coconut oil + 1 tablespoon extra, melted if solid",
    "1/2 cup (125ml) lemon or lime juice",
    "1/2 cup (125ml) pure maple syrup or your favourite liquid sweetener",
    "1 teaspoon vanilla extract",
    "1/4 teaspoon fine sea salt",
    "3 tablespoons finely grated ginger",
    "small handful spinach leaves, optional",
    "3 green kiwifruit, peeled",
    "1 gold kiwifruit, peeled"
  ],
  "__v": 1
}