{
  "hash": "b8a9df5cc24217be3102778cc450b460ee8ff253",
  "title": "Greek salad",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/237_1_1349690382_lrg.jpg",
  "href": "http://www.jamieoliver.com/recipes/vegetables-recipes/greek-salad/",
  "firstAdded": "2014-12-31T14:29:01.540000",
  "users": [
    null
  ],
  "keywords": [
    "medium",
    "tomato",
    "cherry",
    "tomatoes",
    "beef",
    "red",
    "onion",
    "cucumber",
    "green",
    "pepper",
    "dill",
    "mint",
    "leaves",
    "black",
    "olives",
    "stoned",
    "salt",
    "wine",
    "vinegar",
    "goodquality",
    "greek",
    "extra",
    "virgin",
    "olive",
    "oil",
    "block",
    "feta",
    "cheese",
    "oregano"
  ],
  "directions": [
    "0",
    "I think it's quite nice to have different shapes and sizes in a salad, so cut your medium tomato into wedges, halve the cherry tomatoes and slice the beef tomato into large rounds. Put all the tomatoes into a large salad bowl. Slice the onion very finely so it's wafer thin and add to the tomatoes. Scratch a fork down the sides of the cucumber so it leaves deep grooves in the skin, then cut it into thick slices. Deseed your pepper, slice it into rings and add them to the salad along with the cucumber.",
    "Roughly chop the dill and most of the mint leaves, reserving the smaller ones for garnish. Add the chopped herbs to the bowl of salad, then squeeze your handful of olives over so they season the vegetables, then drop them in.",
    "Add a pinch of salt, the vinegar and the extra virgin olive oil. Quickly toss everything together with your hands. The minute all those flavours start working with the veg is when the magic starts to happen. Have a taste, and adjust the flavours if need be.",
    "To serve, pop the block of feta right on the top of the salad. Sprinkle the oregano over the top along with the reserved mint leaves, drizzle with extra virgin olive oil and take it straight to the table. It's confident and scruffy with a bit of attitude. Delicious.",
    "PS I've been known to pop leftover Greek salad into a liquidizer with a splash of extra virgin olive oil and a few ice cubes, then blitz it up to a smooth consistency so it's basically a Greek gazpacho. It's not a classic thing to do, but it is very delicious, not to mention a great way of using up leftovers!"
  ],
  "ingredients": [
    "0",
    "1 medium ripe tomato",
    "200 g ripe cherry tomatoes",
    "1 beef tomato",
    "1 medium red onion, peeled",
    "1 cucumber",
    "1 green pepper",
    "1 handful fresh dill",
    "1 handful fresh mint leaves",
    "1 large handful black olives, stoned",
    "sea salt",
    "1 tablespoon red wine vinegar",
    "3 tablespoons good-quality Greek extra virgin olive oil",
    "200 g block feta cheese",
    "1 teaspoon dried oregano"
  ],
  "__v": 1
}