{
  "hash": "c4e1ad9f046f0b2f585f9ba6572cd24227fdfbb5",
  "title": "Skillet Creamy Lemon Chicken Pasta with Broccoli",
  "image": "//www.melskitchencafe.com/wp-content/uploads/2014/05/lemon-pasta1.jpg",
  "href": "http://www.melskitchencafe.com/skillet-lemon-chicken-pasta-with-broccoli/",
  "firstAdded": "2015-02-20T01:50:35.125000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "breasts",
    "cubed",
    "salt",
    "pepper",
    "oil",
    "garlic",
    "pressed",
    "basil",
    "water",
    "lowsodium",
    "broth",
    "zest",
    "lemons",
    "squeezed",
    "lemon",
    "juice",
    "use",
    "ones",
    "zested",
    "penne",
    "pasta",
    "broccoli",
    "florets",
    "milk",
    "cornstarch",
    "parmesan",
    "cheese"
  ],
  "directions": [
    "0",
    "Pat the chicken dry with a paper towel and season well with salt and pepper. Heat the oil in a large, 12-inch nonstick skillet over medium heat until the oil is hot and rippling. Add the chicken and saute, stirring frequently, until the chicken is browned and cooked through. Remove the chicken to a plate, keeping as much oil/liquid in the skillet as possible.",
    "Keep the skillet on medium heat and add another teaspoon of oil if needed (I usually don't but you'll want to keep an especially close eye on the garlic). Add the garlic and basil and stir constantly for about 30 seconds. Add the water, broth, lemon juice and pasta. Stir to combine.",
    "Bring the mixture to a simmer and cook, stirring occasionally just to keep the pasta from sticking, for 10-12 minutes until the pasta is tender - it will cook for a few more minutes in the next step. There will be a bit of liquid left in the skillet; that's ok.",
    "Add the broccoli and lemon zest. Cover and cook for 2-3 minutes until the broccoli is bright green and tender. While the broccoli is cooking, whisk together the milk and cornstarch.",
    "Uncover the skillet and stir in the milk mixture along with the Parmesan cheese and reserved chicken. Simmer, uncovered, until the sauce has thickened slightly, 1-2 minutes.",
    "Season with additional salt and pepper (this is really important - don't skip this step!) and serve."
  ],
  "ingredients": [
    "0",
    "1 1/2 pounds chicken breasts, cubed",
    "Salt and pepper",
    "1 tablespoon oil",
    "4 cloves garlic, finely minced or pressed",
    "1/2 teaspoon dried basil",
    "2 1/2 cups water",
    "2 cups low-sodium chicken broth",
    "Zest of two lemons, about 1 tablespoons",
    "1/3 cup freshly squeezed lemon juice (from about 2 lemons, use the same ones you just zested)",
    "12 ounces penne pasta (see note)",
    "2-3 cups chopped fresh broccoli florets",
    "3/4 cup milk",
    "1 tablespoon cornstarch",
    "1/2 cup freshly grated Parmesan cheese"
  ],
  "__v": 1
}