{
  "hash": "94552e5fb0c6dc5f24483ea2e0e60e22a5241e59",
  "title": "Baked Fish & Kale Lavash Wraps",
  "image": "",
  "href": "http://www.eatingwell.com/recipe/279805/baked-fish-kale-lavash-wraps/",
  "extension": "Chrome",
  "firstAdded": "2020-05-25T18:05:25.449000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Step 1",
    "Preheat oven to 375 degrees F. Line a baking sheet with parchment paper and coat with cooking spray. Put a kettle of water on to boil.",
    "Step 2",
    "Put greens in a bowl. Cover with boiling water and let wilt for about 5 minutes. Drain and squeeze out excess moisture. Chop and return to the bowl. Mix in tarragon (and/or dill), scallions, 1/4 teaspoon salt and 1/8 teaspoon pepper.",
    "Step 3",
    "Pat fish dry and season with the remaining 1/4 teaspoon each salt and pepper.",
    "Step 4",
    "To make each wrap, place a lavash sheet on your work surface with a short side closest to you. Brush with 1 teaspoon oil and place a portion of fish about 2 inches from the bottom edge. Smear 1 tablespoon red pepper sauce on the fish and top with one-fourth of the greens. Roll up like a burrito and place seam-side down on the prepared pan. Brush the wraps with the remaining 2 teaspoons oil.",
    "Step 5",
    "Bake until the lavash is browned and crisp, rotating the pan from back to front halfway through, 20 to 30 minutes. Serve immediately with additional sauce, if desired."
  ],
  "ingredients": [
    "0",
    "5 ounces baby kale or baby spinach",
    "3 tablespoons coarsely chopped fresh tarragon and/or dill",
    "2 tablespoons finely chopped scallions",
    "½ teaspoon kosher salt, divided",
    "⅛ teaspoon plus 1/4 teaspoon ground pepper, divided",
    "1 pound cod, halibut or barramundi, skinned and cut into 4 portions",
    "4 sheets lavash",
    "6 teaspoons extra-virgin olive oil, divided",
    "¼ cup Very Versatile Roasted Red Pepper Sauce (see Associated Recipes), plus more for serving"
  ],
  "__v": 1
}