{
  "hash": "075cdcdd322c81150051cc93b5221aeaec458f41",
  "title": "Kick Ace Extra Sharp Raw Vegan Holiday Cheddar Cheese Ball",
  "image": "http://vedgedout.files.wordpress.com/2013/11/dsc_0017.jpg?w=620",
  "href": "http://vedgedout.com/2013/11/15/kick-ace-extra-sharp-raw-vegan-holiday-cheddar-cheese-ball-virtual-vegan-potluck-edition/",
  "extension": "",
  "firstAdded": "2015-09-22T21:57:56.624000",
  "users": [
    null
  ],
  "keywords": [
    "raw",
    "cashew",
    "pieces",
    "soaked",
    "purified",
    "water",
    "overnight",
    "dry",
    "pack",
    "snipped",
    "kitchen",
    "scissors",
    "cashews",
    "look",
    "brownish",
    "cheese",
    "ball",
    "use",
    "bright",
    "red",
    "sundried",
    "tomatoes",
    "best",
    "results",
    "nutritional",
    "yeast",
    "sherry",
    "heaped",
    "mellow",
    "white",
    "chickpea",
    "miso",
    "sensitive",
    "soy",
    "apple",
    "cider",
    "vinegar",
    "salt",
    "onion",
    "mustard",
    "smoked",
    "paprika",
    "turmeric",
    "cayenne",
    "organic",
    "unrefined",
    "coconut",
    "oil",
    "warmed",
    "room"
  ],
  "directions": [
    "0",
    "Pour the soaking water off the cashews and sun-dried tomatoes and then rinse them with fresh purified water. Drain well.",
    "Place the soaked cashews, sun-dried tomatoes, nutritional yeast, dry sherry, miso, apple cider vinegar, sea salt, onion powder, mustard powder, smoked paprika, turmeric, cayenne, and coconut oil in a food processor or high-speed blender and pulse until the mixture starts to form a paste, scraping down the sides as necessary.",
    "Blend or process until the mixture is completely smooth, scraping down the sides occasionally. If your food processor or blender is struggling to blend the mixture, add purified water, 1 tablespoon at a time to help it to keep turning over, using no more than 3 tablespoons of water. This process takes up to 10 minutes in a food processor and a few minutes in a high-speed blender.",
    "Scrape the soft cheese into a container that holds at least 2 cups. Cover and refrigerate for 4-6 hours or until the cheese is quite firm. Scrape the cheese out of the container and place onto a clean surface. With your hands, form the cheese into one large ball or two or more smaller balls."
  ],
  "ingredients": [
    "0",
    "1 1/2 cups raw cashew pieces, soaked in purified water overnight",
    "2 packed tablespoons dry pack sun-dried tomatoes, snipped into small pieces with kitchen scissors then soaked in the purified water with the cashews. Note: if your sun-dried tomatoes look brownish, so will your cheese ball. Use fresh, bright red sun-dried tomatoes for best results.",
    "1/4 cup nutritional yeast",
    "1 tablespoon dry sherry (optional)",
    "1 heaped tablespoon mellow white miso (use chickpea miso if you are sensitive to soy)",
    "1 tablespoon raw apple cider vinegar",
    "1 teaspoon sea salt",
    "1 teaspoon onion powder",
    "1/2 teaspoon dry ground mustard powder",
    "1/2 teaspoon smoked paprika",
    "1/4 teaspoon turmeric",
    "dash cayenne",
    "1/2 cup organic unrefined coconut oil, warmed to room temperature (liquid)"
  ],
  "__v": 1
}