{
  "hash": "b133824a5195aa949bc2d161ac453d641ba90924",
  "title": "Yellow Rice Chicken Skillet",
  "image": "http://www.budgetbytes.com/wp-content/uploads/2015/09/Yellow-Rice-Chicken-Skillet-text.jpg",
  "href": "https://www.budgetbytes.com/2015/09/yellow-rice-chicken-skillet/",
  "extension": "Chrome",
  "firstAdded": "2017-03-02T02:06:35.854000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Pat the chicken thighs dry with a paper towel, then season both sides with salt and pepper.",
    "Heat a large deep skillet over medium heat. Add the oil, then tilt the skillet to spread the oil over the surface. Place the chicken thighs in the skillet, skin side down, and allow to brown before flipping (about five minutes). Flip the thighs and let brown on the second side (another five minutes). Remove the browned thighs to a clean plate.",
    "If there is excess oil in the skillet, pour it off into a bowl to cool, leaving about 1 tablespoon of oil and fat in the skillet. Add the minced garlic, turmeric, cumin, and cinnamon to the skillet. Sauté for about one minute, or until the garlic is soft and fragrant.",
    "Pour the chicken broth into the skillet and use a wooden spoon to dissolve any browned bits off the bottom of the skillet. Once the browned bits are dissolved, add the frozen peas and rice, and give it a quick stir to distribute the broth and spices. Nestle the browned chicken thighs into the rice and peas.",
    "Place a lid on the skillet and turn the heat up to medium-high. allow it to come to a boil. Once it reaches a boil, turn the heat down to low (or just above low) and let the skillet simmer for 25 minutes. After 25 minutes, turn the heat off and let it sit undisturbed for an additional 10 minutes. Finally, remove the lid and fluff the rice with a fork, mixing the peas in as you go. Top with fresh cilantro, if desired."
  ],
  "ingredients": [
    "0",
    "1 Tbsp vegetable or canola oil $0.02",
    "4 bone-in chicken thighs with skin $3.48",
    "Pinch salt and pepper $0.05",
    "2 cloves garlic, minced $0.16",
    "1 tsp turmeric $0.10",
    "½ tsp cumin $0.05",
    "¼ tsp cinnamon $0.03",
    "1.5 cups long grain jasmine rice $0.78",
    "1.5 cups frozen peas $0.72",
    "2.5 cups chicken broth* $0.33",
    "¼ bunch cilantro (optional) $0.32"
  ],
  "__v": 1
}