{
  "hash": "bfdfd7effc264107a4ef0706b3552fb53ba03205",
  "title": "Lemon Meringue Pie Smoothie",
  "image": "http://www.greenthickies.com/wp-content/uploads/2013/10/7-Day-Diet-Plan-1-Day-FREE-Sample.jpg",
  "href": "http://www.greenthickies.com/healthy-meal-plans-for-weight-loss-3-lemon-meringue-pie/",
  "extension": "Chrome",
  "firstAdded": "2016-08-07T19:50:39.786000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Blend the ingredients in the following order:",
    "1. Blend the dry ingredients and liquid first for a short time",
    "2. Blend the greens next for a short time (if using)",
    "3. Blend the fruit and the rest of the ingredients until smooth (or as smooth as your blender will allow. High speed blenders may need 2 minutes for a Green Thickie, less powerful blenders may need a lot more, sometimes 5-10 minutes)",
    "More tips:",
    "Blending this way allows the dry ingredients to be blended for longest, it means the greens will fit in your blender and your fruit gets less blending so it doesn’t become too hot.",
    "- Add more water if required to thin it out.",
    "- Substitute any of the ingredients for whatever you already have.",
    "- If your smoothie is too warm, you can cool it down in the fridge or freeze some of your ingredients before blending. You can also replace half of the liquids with ice. Add the ice at the end. It is better to add frozen ingredients at the end to cool the smoothie down.",
    "How much should I drink to replace a meal?",
    "- Only use a meal replacement if you’ve added the oats/quinoa.",
    "- This Green Thickie serves 2 so you should DRINK HALF OF THIS RECIPE. But if you have higher calorie requirements you may need to drink more.",
    "Suitable for Special Diets:",
    "- Gluten free (Use GF Oats or Quinoa)",
    "- Raw (Use raw oats/quinoa)",
    "- Vegetarian, vegan, dairy free, egg free, refined sugar free, wheat free, soya free (don’t use soya milk or tofu),",
    "- Salt free (don't add salt)",
    "- Nut free (replace nuts with sunflower or pumpkin seeds. This doesn't include coconuts)",
    "More information about making the perfect Green Thickie",
    "If you are new to Green Thickies and have more questions about making the perfect green thickie, please read this guide on How to make a Green Thickie"
  ],
  "ingredients": [
    "0",
    "2 Cups Water",
    "4 Bananas",
    "½ Cup Dates (or use your own healthy sweetener to taste)",
    "2 Tablespoons Pecans",
    "Juice of 3 Lemons",
    "1 Teaspoon of *Cinnamon * (or to taste)",
    "Pinch of nutmeg",
    "1 Cup Spinach, tightly packed or 2 cups loosely packed (or any other mild greens)",
    "1 Filler* (see notes)"
  ],
  "__v": 2
}