{
  "hash": "7b73971010d6a115b8e91b4ea27a01e9f4516100",
  "title": "No-Bake Cake Batter Truffles",
  "image": "http://www.chef-in-training.com/blog/wp-content/uploads/2011/09/No-Bake-Cake-Batter-Truffles.jpg?8b9b3c",
  "href": "http://www.chef-in-training.com/2011/09/no-bake-cake-batter-truffles-take-2/",
  "extension": "Firefox",
  "firstAdded": "2015-05-02T14:50:05.900000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "butter",
    "softend",
    "sugar",
    "vanilla",
    "flour",
    "salt",
    "yellow",
    "cake",
    "dry",
    "milk",
    "needed",
    "reach",
    "dough",
    "consistency",
    "sprinkles",
    "truffle",
    "coating",
    "white",
    "dipping",
    "chocolate"
  ],
  "directions": [
    "0",
    "In a large bowl, beat together butter and sugar until well combined. Beat in vanilla. Add cake mix, flour, salt, and vanilla and mix thoroughly. Add in milk and mix to combine. If needed, add more to make a dough consistency. Stir in sprinkles. Roll dough into one inch balls and place on a parchment or wax paper lined cookie sheet. Chill balls in the refrigerator or freezer for 15 minutes to firm up.",
    "While dough balls are chilling, melt almond bark in the microwave in 30 second intervals until melted. Make sure to stir between intervals so that chocolate doesn't burn. Using a fork, or however you prefer to dip truffles, dip truffles into almond bark and shake of excess bark by tapping the bottom of the fork on the side of your bowl. Place truffle back on the cookie sheet and top with sprinkles. Repeat with remaining balls until finished.",
    "Chill and keep cake batter truffles in the refrigerator until serving in an air tight container. Store leftover truffles the same way. Makes around 24-30 truffles."
  ],
  "ingredients": [
    "0",
    "½ cup unsalted butter, softend",
    "½ cup sugar",
    "1 tsp. vanilla",
    "1½ cups flour",
    "⅛ tsp. salt",
    "1 cup yellow cake mix, dry",
    "3 Tbsp. milk, more if needed to reach dough consistency",
    "2 Tbsp. sprinkles",
    "- TRUFFLE COATING",
    "16 oz white dipping chocolate"
  ],
  "__v": 1
}