{
  "hash": "00c97783471c8e750e9462e0929056413834b404",
  "title": "Gnocchi Skillet with Chicken Sausage & Tomatoes",
  "image": "http://p-fst2.pixstatic.com/53d82fce697ab0552a001563/_w.540_s.fit_/Skillet-7567.jpg",
  "href": "http://www.thekitchn.com/recipe-gnocchi-skillet-with-sausage-amp-tomatoes-recipes-from-the-kitchn-206429",
  "extension": "Chrome",
  "firstAdded": "2015-09-10T08:00:34.177000",
  "users": [
    null
  ],
  "keywords": [
    "gnocchi",
    "coarse",
    "kosher",
    "salt",
    "black",
    "pepper",
    "links",
    "chicken",
    "sausage",
    "inchthick",
    "coins",
    "cherry",
    "grape",
    "tomatoes",
    "lengthwise",
    "basil",
    "julienned",
    "loosely"
  ],
  "directions": [
    "0",
    "Heat a large pot of salted water to boiling; cook the gnocchi for 2 minutes or according to package directions. Drain and toss with a drizzle of olive oil.",
    "Heat a 10-inch or larger cast iron skillet over medium heat with a light drizzle of olive oil. Add the sausage and cook for 2 to 3 minutes, or until it begins to brown. Push the sausage into a pile at the edge of the skillet and turn the heat up to high.",
    "When the skillet is quite hot, add the tomatoes, skin down, crowding them in if necessary. Cook for 1 to 2 minutes or until they are blistered, then stir in with the sausage. Cook for 2 more minutes, until both tomatoes and sausage are slightly browned. Stir in gnocchi and cook just until all is combined, but the tomatoes have not broken down into sauce.",
    "Remove the skillet from the heat and stir in the basil. Season to taste with salt and pepper and serve immediately.",
    "Recipe Notes",
    "Any cooked chicken sausage is good in this dish, although I do prefer one with a little extra flavor added, like red peppers or garlic.",
    "I specify a cast iron skillet because I think it gives the best color and sear to the tomatoes and sausage. However, any deep skillet or sauté pan should work as well, provided it doesn't have a nonstick coating, which will interfere with browning."
  ],
  "ingredients": [
    "0",
    "1 pound gnocchi",
    "Coarse kosher salt and freshly ground black pepper",
    "9 ounces (about 3 links) cooked chicken sausage, sliced into 1/4-inch-thick coins",
    "1 pint cherry or grape tomatoes, sliced in half lengthwise",
    "1 to 2 ounces fresh basil, julienned (1/2 to 1 cup loosely packed)"
  ],
  "__v": 1
}