{
  "hash": "3338e2876e6ba9a59ef0a26cf0625bf762df63f8",
  "title": "Pumpkin Cookies With Brown Sugar Frosting",
  "image": "http://www.lecremedelacrumb.com/wp-content/uploads/2016/08/pumpkin-cookies-brown-sugar-frosting-101.jpg",
  "href": "http://www.lecremedelacrumb.com/2016/08/pumpkin-cookies-brown-sugar-frosting.html",
  "extension": "Chrome",
  "firstAdded": "2016-09-07T02:53:04.615000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium bowl whisk together flour, baking powder, baking soda, pumpkin pie spice, and salt.",
    "In a large bowl cream together butter and sugars until lightly and fluffy. Add pumpkin, egg, and vanilla and mix until thoroughly.",
    "Add dry ingredients to wet ingredients and mix until combined. Use a cookie scoop (about 1½ tablespoons dough) to drop mounds onto a lightly greased cookie sheet leaving about 2-3 inches between each cookie dough mound. Use the palm of your hand to slightly flatten each mound (press down about ½ inch to flatten the top a little bit).",
    "Bake at 350 degrees for 12-15 minutes. Allow to cool on the pan for about 5 minutes, then transfer to a cooling rack to cool completely.",
    "To make the frosting, melt butter in a medium sauce pan and boil for 2 minutes. Stir in brown sugar, reduce heat to medium-low and boil for 2 minutes. Stir in milk, remove from heat and pour into a large bowl. Stir in powdered sugar. Frost cooled cookies.",
    "Store in airtight container at room temperature up to 5 days."
  ],
  "ingredients": [
    "0",
    "2½ cups flour",
    "1 teaspoon baking powder",
    "1 teaspoon baking soda",
    "1 tablespoon pumpkin pie spice",
    "½ teaspoon salt",
    "½ cup butter, softened",
    "1 cup granulated sugar",
    "½ cup brown sugar, lightly packed",
    "1 cup canned pure pumpkin puree (NOT pumpkin pie filling)",
    "1 large egg",
    "1½ teaspoons vanilla extract",
    "1",
    "½ cup butter",
    "1 cup lightly packed brown sugar",
    "¼ cup heavy cream (or other milk)",
    "2 cups powdered sugar"
  ],
  "__v": 1
}