{
  "hash": "5a2c6ee07b59401bb94e3731c1ade832f9da2000",
  "title": "Classic Ragù alla Bolognese",
  "image": "http://prodstatics3cdn1.tastingtable.com/images/articles/2015_02/Whatshot-Bolognese-Big-Night-In-Project-Home-Cooking-Italian-Ragu-Sauce-Recipes.jpg",
  "href": "http://www.tastingtable.com/cook/recipes/how-to-make-classic-ragu-alla-bolognese-recipe",
  "firstAdded": "2015-02-05T00:03:33.784000",
  "users": [
    null
  ],
  "keywords": [
    "porcini",
    "mushrooms",
    "pancetta",
    "medium",
    "yellow",
    "onion",
    "carrot",
    "rib",
    "celery",
    "kosher",
    "salt",
    "skirt",
    "steak",
    "patted",
    "dry",
    "cubes",
    "lean",
    "pork",
    "shoulder",
    "sage",
    "leaves",
    "bay",
    "sprigs",
    "thyme",
    "white",
    "wine",
    "doubleconcentrated",
    "italian",
    "tomato",
    "beef",
    "chicken",
    "stock",
    "divided",
    "milk",
    "parmesan",
    "rinds",
    "nutmeg",
    "tagliatelle",
    "pasta",
    "parmigianoreggiano",
    "cheese"
  ],
  "directions": [
    "0",
    "Place the porcini in a bowl and cover with ½ cup of boiling water. Allow to sit for 15 minutes to rehydrate. Remove the porcini, reserving the water and finely chop. Set both the chopped mushrooms and the liquid aside.",
    "In a large, heavy-bottomed pot over medium heat, add 2 tablespoons of the olive oil. Add the pancetta and cook, stirring until the fat begins to render out, 3 to 4 minutes. Add the vegetables and season with salt. Cook, stirring often, until the vegetables begin to soften, 6 to 8 minutes. Add the mushrooms and continue to cook until all of the vegetables are very soft and all the liquid has evaporated, 10 to 12 minutes. Transfer the mixture to a bowl and set aside.",
    "Return the pot to the stove over medium-high heat and heat the remaining 2 tablespoons of olive oil. Working in 2 batches, brown the skirt steak, 4 to 5 minutes for each batch. Remove the beef using a slotted and transfer to a plate. Add the ground pork to the pot, and using a wooden spoon, break the pork into small clumps. Season it with salt and brown, 2 to 3 minutes.",
    "Place the sage, bay leaves and thyme in the center of a triple layer of cheesecloth. Gather up the edges and tie using kitchen twine to form a bouquet garni.",
    "Reduce the heat to medium and return the browned beef and reserved vegetable mixture to the pot with the bouquet garni and cook, stirring often, until most of the liquid has evaporated, 4 to 5 minutes. Deglaze the pan by adding the wine. Scrape the brown bits on the bottom of the pan using a wooden spoon. Reduce until all the liquid has evaporated and the contents have taken on a rich chestnut color, 10 to 12 minutes. Add the tomato paste and cook for 3 to 4 minutes.",
    "Add 1½ cups of the stock and ½ cup of the milk and reduce by half, 12 to 15 minutes. Add the Parmesan rinds, nutmeg and remaining stock and milk, skimming any fat that rises to the surface, and continue cooking until the flavors have come together and the sauce has become very thick, 35 to 45 minutes. Season with salt and allow to cool. Remove and discard the bouquet garni. Make ahead: The sauce can be made up to 3 days ahead. Cover and chill. Toss with tagliatelle or the pasta of your choice and top with fresh-grated Parmigiano-Reggiano before serving.",
    "Note: Freezing the skirt steak for 15 minutes before cutting makes it easier to handle."
  ],
  "ingredients": [
    "0",
    "⅓ cup dried porcini mushrooms",
    "4 ounces pancetta, finely diced (about ¾ cup)",
    "1 medium yellow onion, finely diced (about 1 cup)",
    "1 medium carrot, peeled, finely diced (about ½ cup)",
    "1 rib celery, finely diced (about ½ cup)",
    "Kosher salt, to taste",
    "1½ pounds skirt steak, patted dry and cut into ¼-inch cubes",
    "4 ounces lean pork shoulder, ground",
    "4 sage leaves",
    "2 bay leaves",
    "2 sprigs fresh thyme",
    "1 cup dry white wine",
    "3 tablespoons double-concentrated Italian tomato paste",
    "2 cups beef or chicken stock, divided",
    "1½ cups whole milk",
    "¼ pound (about 3 small) Parmesan rinds",
    "Pinch nutmeg",
    "Tagliatelle pasta",
    "Freshly grated Parmigiano-Reggiano cheese, for serving"
  ],
  "__v": 1
}