{
  "hash": "457fb6e0c9ac4597562ca05dbc44bce722d76a0b",
  "title": "Fig Chai Tea Bread",
  "image": "//www.beardandbonnet.com/wp-content/uploads/2013/09/post2.jpg",
  "href": "http://beardandbonnet.com/fig-chai-tea-bread-gluten-free-and-vegan/",
  "extension": "",
  "firstAdded": "2015-11-21T14:16:45.433000",
  "users": [
    null
  ],
  "keywords": [
    "teff",
    "flour",
    "tapioca",
    "baking",
    "soda",
    "kosher",
    "salt",
    "brewed",
    "chai",
    "tea",
    "coconut",
    "oil",
    "evaporated",
    "cane",
    "juice",
    "use",
    "brown",
    "sugar",
    "vanilla",
    "black",
    "mission",
    "figs",
    "spray"
  ],
  "directions": [
    "0",
    "Preheat the oven to 375°F. Lightly grease an 8x4x4-inch loaf pan with coconut oil spray and dust with teff flour.",
    "*In a medium sized mixing bowl, combine the teff flour, tapioca flour, baking soda, and salt. Mix well with a whisk to combine.",
    "In a separate large mixing bowl, combine the chai tea, coconut oil, evaporated cane juice, and vanilla extract. Add the dry ingredients to the wet ingredients and mix with the whisk until no lumps remain and the batter is smooth. Gently fold in the chopped figs.",
    "Pour the batter into the prepared pan and gently tap the pan on the counter to ensure that any air bubbles escape. Place the 4 fig halves upside down on to of the batter and gently press them into the batter so that they stay where you want them. Bake for 1 hour and 10 minutes or until a toothpick inserted in the center comes out clean. The loaf should be golden brown and slightly firm to the touch when it is done. Allow the loaf to cool in the pan on a wire rack for 15 minutes then remove the loaf and allow it to cool the rest of the way before slicing."
  ],
  "ingredients": [
    "0",
    "1 1/2 cups teff flour",
    "3/4 cups tapioca flour",
    "1 1/2 tsp. baking soda",
    "3/4 tsp. kosher salt",
    "*1 cup brewed chai tea",
    "1/2 cup coconut oil",
    "1/2 cup evaporated cane juice, *you can use brown sugar in a pinch",
    "1 1/2 tsp. vanilla extract",
    "3/4 cup black mission figs, chopped",
    "2 black mission figs, halved",
    "coconut oil spray"
  ],
  "__v": 1
}