{
  "hash": "fbc4758db6ae31a05ca0779006303cab1a43497a",
  "title": "Vegan Banana Cream Pie Blizzards",
  "image": "http://cdn.minimalistbaker.com/wp-content/uploads/2014/07/CREAMY-Banana-Cream-Pie-Blizzard-Vegan-7-ingredients-and-SO-easy-fast-and-delicious.jpg",
  "href": "http://minimalistbaker.com/vegan-banana-cream-pie-blizzards/",
  "firstAdded": "2015-02-18T04:20:43.749000",
  "users": [
    null
  ],
  "keywords": [
    "raw",
    "cashews",
    "soaked",
    "hours",
    "overnight",
    "almond",
    "coconut",
    "milk",
    "light",
    "fat",
    "vanilla",
    "medjool",
    "dates",
    "dry",
    "hot",
    "water",
    "minutes",
    "drain",
    "banana",
    "chips",
    "oil",
    "veganfriendly",
    "cookies",
    "nabisco",
    "original",
    "graham",
    "crackers"
  ],
  "directions": [
    "0",
    "The night before, place your ice cream churning bowl in the freezer to properly chill. Also, make sure you soak your cashews overnight OR the next day for at least 6 hours. Be sure to drain thoroughly before adding to blender.",
    "Grind your banana chips in a coffee or spice grinder or with a mortar and pestle. If using a spice grinder, not all of the chips will grind. Pick out parts that didn't grind for other uses.",
    "Add all ice cream ingredients EXCEPT raw banana and cookies to blender and blend until creamy and smooth, scraping down sides as needed. Use the “liquify” or \"puree\" setting if you have it to get it completely creamy and blended. Taste and adjust flavor as needed, adding more banana powder or dates if desired.",
    "Chill mixture in the freezer for 2 hours, or in the fridge overnight. If you don't have an ice cream maker, see notes.",
    "Add chilled mixture to ice cream maker and churn according to manufacturer’s instructions - about 45 minutes. It should look like soft serve.",
    "For a true blizzard experience, spoon directly into 2-3 serving glasses and layer with fresh sliced bananas and crushed vegan cookies. Optional, top with coconut whipped cream.",
    "Alternatively, transfer mixture to a freezer safe container, cover and freezer until firm - about 4-6 hours and scoop as ice cream."
  ],
  "ingredients": [
    "0",
    "1 cup raw cashews (soaked for 6 hours or overnight, then drained)",
    "1 cup unsweetened almond or coconut milk (light or full fat)",
    "1 tsp pure vanilla extract",
    "5-7 medjool dates, pitted (if dry, soak in hot water for 10 minutes, then drain)",
    "2 Tbsp banana powder (ground banana chips)",
    "2 Tbsp coconut oil, melted",
    "1 just ripe banana, sliced",
    "Optional: Crushed vegan-friendly cookies (such as Nabisco Original Graham Crackers)"
  ],
  "__v": 1
}