{
  "hash": "dd6e4c086920b59c934dd7cf7a1726a53083d9bf",
  "title": "Capun Magru",
  "image": "http://www.livingalifeincolour.com/wp-content/uploads/2016/07/meimanrensheng.com-cappon-magro-03832.jpg",
  "href": "https://www.livingalifeincolour.com/recipes/cappon-magro-seafood-and-vegetable-platter-liguria/",
  "extension": "Chrome",
  "firstAdded": "2019-09-25T17:45:45.188000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To make the sauce: Soak the bread in 60 mls of the vinegar and 15 mls water.",
    "In a food processor or finely chop by hand, combine the garlic, chilli, anchovy, parsley, capers, the soaked bread and half the lemon juice.",
    "When combined, if using a food processor, then slowly add 240 mls of the olive oil, blending to emulsify the sauce. If making by hand, use a wooden spoon to beat in the olive oil, bit by bit.",
    "To make the Vegetables: Bring to a boil a small pot of salted water and add the remaining 30 mls of vinegar. Add the beets and boil until they are tender (test by piercing with a knife or fork), about 45 minutes depending on the size of the beets. Remove with a slotted spoon and allow to cool. Cut into bite sized pieces.",
    "Prepare a large bowl of ice water. Separately, bring to a boil a large pot of salted water and boil the carrots, celery, cauliflower and green beans for 7 minutes.",
    "Remove the vegetables with a slotted spoon and place in the bowl of ice water to cool. Reserve the cooking water.",
    "Rinse out the pot used for the beets and refill with salted water. Bring to a boil and add the potatoes and artichokes. After 10 minutes, add the salsify to the water. Cook until tender when pierced with a fork, about another 5 minutes. Remove with a slotted spoon and set aside to cool.",
    "To make the Seafood: In the reserved vegetable water, heat the water to 70 C (160F) and add the prawns and cook for 8 minutes, until cooked through. Remove with a slotted spoon and allow to cool. When cool, remove the shell and the vein running along the back.",
    "In the same water at the same temperature, add the fish and poach until the meat flakes easily (depends on the size but for a 400 gram fish, cook for 10 minutes).If you are using fillets, it will take less time. Remove with a slotted spoon and allow to cool.",
    "In the same water, add the lobster and poach for about 15 minutes, until cooked through. Remove from the water and allow the cool. Twist off the claws and tail and crack the shell with a mallet. Remove the meat from the shell.",
    "To cook any clams or mussels, add to a hot, dry frying pan. Cover and cook until the shells are all open, about 10 minutes. Discard any unopened clams or mussels.",
    "Drizzle the remaining 60 mls olive oil and half of the lemon juice over the seafood. Sprinkle with salt and pepper.",
    "Assembly: Place the vegetables on a large platter along with the preserved mushrooms. Drizzle some of the prepared sauce over top.",
    "Add the seafood over top, drizzling with the sauce.",
    "Open the oysters, being careful not to lose any of their liquid.",
    "Add the lobster on top. Arrange the oysters around the side of the platter along with the bruschetta. Serve!"
  ],
  "ingredients": [
    "0",
    "1 slice of bread, crust removed",
    "90 ml white wine vinegar",
    "2 garlic cloves, skin removed",
    "1 chilli",
    "2 anchovy fillets, drained from oil",
    "10 grams flat leaf parsley, rinsed, dried and leaves removed",
    "10 grams capers",
    "2 lemons, juiced",
    "300 ml extra-virgin olive oil",
    "2 medium beetroot, skin peeled and end removed",
    "2 carrots, peeled and ends removed, cut into bite sized pieces",
    "2 ribs of celery, rinsed and ends removed, cut into bite sized pieces",
    "½ head of cauliflower, rinsed and cut into florets",
    "100 grams green beans, rinsed and ends removed, cut in half",
    "2 large potatoes, peeled and cut into bite sized pieces (soak in cold water until ready to cook)",
    "2 artichokes, prepared and quartered (soak in cold water until ready to cook)",
    "1 black salsify (optional), peeled and soaked in water with lemon juice",
    "10 large prawns",
    "1 kilo white fish, cleaned and scaled (seabass, gurnard, gilt head bream, scorpion fish, hake, etc) or seafood (langoustine and/or clams and/or mussels, prepared)",
    "700 gram to 1 kilo lobster, rinsed",
    "1 jar of preserved porcini mushrooms",
    "6 oysters",
    "4 slices of bruschetta",
    "Sea salt"
  ],
  "__v": 3
}