{
  "hash": "6d2f3406c3783d6cacd5377ee19d8bb87adfd26c",
  "title": "Lefse (the lazy way)",
  "image": "http://4.bp.blogspot.com/-k45etmSynEU/UEagw5ijaWI/AAAAAAAAASA/p-BJ8JVAShM/s640/lefse5edit.jpg",
  "href": "http://www.glutenfreeboulangerie.com/2012/09/ratio-rally-norwegian-potato-lefse.html",
  "extension": "",
  "firstAdded": "2015-12-26T16:58:01.064000",
  "users": [
    null
  ],
  "keywords": [
    "efse",
    "lazy",
    "way",
    "makes",
    "wrapsized",
    "flatbreads",
    "flour",
    "potato",
    "starch",
    "white",
    "rice",
    "rolling",
    "dough",
    "buckwheat",
    "psyllium",
    "husk",
    "pomonas",
    "citrus",
    "pectin",
    "salt",
    "sugar",
    "butter",
    "contributes",
    "fat",
    "cream",
    "weight",
    "come",
    "total",
    "roughly",
    "remaining",
    "counts",
    "water",
    "equals"
  ],
  "directions": [
    "0",
    "Method:",
    "Blend all dry ingredients together in a bowl. Mix in cream, melted butter, & water, knead until dough forms a ball. --At this point I recommend putting the dough in the refrigerator for about half an hour - the dough is much easier to work with if it's cold.-- When the dough is chilled, flour your work surface and rolling pin with some starch, and heat a heavy griddle over medium heat. Divide the dough into eight balls. To roll out, press each ball flat with your hand, making sure there is plenty of starch on both sides, and gently roll as thin as you can without tearing. Picture yourself using the rolling pin to stretch the dough outwards, rather than pressing downwards on it. (If it does tear, use damp fingers to repair it - just make sure to dust extra starch on that spot so it doesn't stick to the rolling pin. Also, don't worry if they're not perfect - it takes practice, and they'll still taste just as good!) To cook, roll the round of dough up onto/around the rolling pin - so it is draped over the rolling pin - then carefully \"roll\" it off onto the hot griddle. It should start to bubble up after about a minute, at most - if it doesn't, turn up the heat a little more. Cook for a couple of minutes on each side. Place the lefse between folded dish towels to cool (this keeps them soft).",
    "Leftover lefse should be frozen for best texture (not refrigerated). Keep them in a freezer bag and thaw in the microwave as needed."
  ],
  "ingredients": [
    "0",
    "efse (the lazy way)",
    "Makes 8 wrap-sized flatbreads",
    "70g potato flour (not potato starch!)",
    "70g white rice flour",
    "55g potato starch, plus more for rolling out dough",
    "15g buckwheat flour",
    "2 tsp psyllium husk",
    "1/4 tsp Pomona's citrus pectin",
    "1/2 tsp salt",
    "2 tsp sugar",
    "2 T butter, melted (this contributes about 22 grams of fat)",
    "35 g cream (approximately 13 grams of this weight come from fat, for a total of 35 g of fat; roughly 20 grams remaining counts as liquid)",
    "190 g water (this plus the ~20 grams from the cream equals about 210 g liquid)"
  ],
  "__v": 1
}