{
  "__v": 1,
  "directions": [
    "0",
    "Place the pork chops in a large Ziploc bag and pour in the whole bottle of salad dressing.",
    "Seal the bag, removing the excess air, and shake to coat the chops well.",
    "Refrigerate the chops and let them marinate 4-6 hours. Remove the chops from the bag and shake off the excess marinade. Set them aside on a platter.",
    "Pour the marinade into a small sauce pan and add the balsamic, honey, rosemary, and black pepper. Bring the mixture to a slight boil over medium heat. Boil the liquid gently for five minutes then remove from the heat. This kills any germs that were hanging out in the marinade.",
    "Start your grill and prepare for direct grilling over medium-high heat (400-450ยบ). Grill the chops until they readily release from the grate, about three minutes. To make them look extra fancy, rotate the chops 45ยบ and continue cooking for about two minutes. Note: These cooking times are approximate, and they are based on chops that are about 3/4\" thick. Each chop is going to vary slightly.",
    "Flip the chops over and grill three minutes more. Brush the chops generously with the finishing sauce. Rotate the chops 45ยบ and continue cooking for about two minutes more. Brush them with another good dose of the finishing sauce.",
    "Remove the chops to a platter and, brush them with the sauce again and let them rest five minutes. Serve with a good drizzle of the finishing sauce and enjoy!"
  ],
  "firstAdded": "2014-04-19T16:18:30.075000",
  "hash": "8e2880cd63c9f7a044268a16a1caabdf352324b4",
  "href": "http://www.sixsistersstuff.com/2012/07/grilled-tuscan-pork-chops.html",
  "image": "http://3.bp.blogspot.com/-FyH5xCfrxKs/T-olxxg_q6I/AAAAAAAAE-4/szTELyL4VQ0/s400/grilled+tuscan+pork+chops.jpg",
  "ingredients": [
    "0",
    "4-6 Pork rib chops, 3/4\" thick (you can use bone-in or boneless)",
    "1 (16 oz) bottle Zesty Italian salad dressing",
    "1/4 cup balsamic vinegar",
    "1/8 cup honey",
    "1 tsp dried rosemary",
    "1/2 tsp black pepper, ground fresh"
  ],
  "keywords": [
    "pork",
    "rib",
    "chops",
    "use",
    "bonein",
    "boneless",
    "bottle",
    "zesty",
    "italian",
    "salad",
    "dressing",
    "balsamic",
    "vinegar",
    "honey",
    "rosemary",
    "black",
    "pepper"
  ],
  "title": "Grilled Tuscan Pork Chops",
  "users": [
    null
  ]
}