{
  "hash": "fb70fae842bb6b860756a1251d3e1a2b0961e6fc",
  "title": "Porcini and Paprika-Crusted Prime Rib with Horseradish and Yukon Gold Gratin",
  "image": "https://www.marketofchoice.com/images/stories/rapidrecipe/th/331-recipe_square.jpg",
  "href": "https://www.marketofchoice.com/?option=com_rapidrecipe&page=viewrecipe&recipe_id=331&Itemid=179",
  "extension": "Chrome",
  "firstAdded": "2019-05-04T04:59:18.707000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Methods/Steps",
    "Preheat oven to 300°. Combine all rub ingredients in food processor to make a rough paste. Spread over entire surface of roast. Cook rib-side down for 90 min. Check internal temp with a meat thermometer and continue cooking until center reaches 110°. Raise oven temp to 400° and continue cooking 15 min or more for desired doneness (internal temp should reach 120-125° for rare-medium rare beef). Allow to rest 10 min before slicing. End cuts will be more well done than center.",
    "*Dried porcini mushrooms and other dried mushrooms can be found in your Market Produce department. Grind them to a powder in a spice grinder before adding to the processor for best results.",
    "Recipe Author/Pairings",
    "Preheat oven to 350°. Make a “bouquet garni” by wrapping thyme, peppercorns, bay leaf, and garlic in cheesecloth and tying closed; cut a small strip of cheesecloth to use as a string for tying. In a large pot over med heat, bring half and half, bouquet garni, salt, and potatoes to a boil. Stir frequently (do not scorch), reducing heat if necessary to a slow simmer, until potatoes are slightly softened, about 10 min. Remove bouquet garni and discard, squeeze out any liquid into pot. Stir in horseradish and half of cheese. Pour into a 9”x13” ovenproof casserole dish, layering uniformly. Top with remaining cheese, cover with foil, and bake 35-45 min until tender. Remove foil and brown slightly, 5 min more. Serve immediately."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Prime Rib",
    "6 lb prime rib roast",
    "2 T ea fresh rosemary and thyme, de-stemmed and rough chopped",
    "3 T fresh garlic cloves",
    "1½ T kosher salt",
    "2 T fresh ground black pepper",
    "1 T smoked Spanish paprika",
    "3 T dried porcini powder*",
    "¼ c extra virgin olive oil",
    "Horseradish and Yukon Gold Gratin",
    "3 lb Yukon gold potatoes, sliced",
    "6-7 cloves garlic, crushed",
    "4 c half and half",
    "½ c (packed) fresh horseradish root, peeled and finely grated",
    "1½ c Parmigiano-Reggiano cheese, shredded",
    "½ bunch fresh thyme, rough chopped",
    "1 T black peppercorns",
    "1 lg fresh bay leaf, or two dried",
    "1 T kosher salt",
    "cheese cloth"
  ],
  "__v": 1
}