{
  "hash": "225deb7a2a0d016aabdb02e382ff86007a8bc5ec",
  "title": "Roasted Beet Borscht",
  "image": "https://www.gustotv.com/wp-content/uploads/2017/10/BEET-SOUP-479x269.jpg",
  "href": "https://www.gustotv.com/recipe/roasted-beet-borscht/",
  "extension": "Firefox",
  "firstAdded": "2018-12-16T18:38:47.142000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "Preheat your oven to 400F and line a sheet pan with aluminum foil to make cleanup easier.",
    "Meanwhile, prepare your beets and carrots by dicing into roughly 2-inch chunks and cut your onion into six wedges. Toss all of your vegetables including the garlic and thyme onto your prepared sheet pan and drizzle with olive oil. Mix well so that all of the veggies are evenly coated with oil and spread into an even layer. Season with ½ teaspoon salt and ¼ teaspoon pepper and pop this into your preheated oven for 30 minutes, stirring once midway through.",
    "When your veggies are done roasting, pop all of the garlic cloves out of their skins, discard all of the papery bits, and transfer the whole pan of veggies into a medium/large pot along with the chicken or vegetable stock. Set this over medium heat to simmer for about 50 minutes or until the vegetables are very tender.",
    "Carefully remove the sprigs of thyme and transfer the mixture into a blender to puree until very smooth. You might need to do this in a couple of batches and do be careful of the steam. Also, it’s important to open the lid valve of the blender and cover with a clean dish towel when you blend. If you don’t, you will have quite the mess on your hands!",
    "Once your soup is nice and smooth, transfer it all back into your pot and place over low/medium-low heat. Stir in the vodka (if using), vinegar, prepared horseradish, mustard and lemon juice, to taste. Season with salt and pepper, cover, and cook for another 10 minutes or so to allow all of the flavours to meld.",
    "Serve hot or cold topped with a dollop or sour cream and a sprinkling of fresh dill!"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "5 medium/medium large beets, peeled",
    "3 medium carrots, peeled",
    "1 medium red onion, peeled",
    "4 cloves garlic, skin on",
    "6 sprigs fresh thyme",
    "2 tbsp extra virgin olive oil",
    "½ tsp salt",
    "¼ tsp pepper",
    "4 cups low or no sodium chicken or vegetable broth",
    "1 tbsp vodka, optional",
    "1-2 tbsp syrupy balsamic or red wine vinegar",
    "2 tsp prepared horseradish",
    "1 tsp Dijon mustard",
    "2 tsp lemon juice, or more to taste",
    "salt and pepper, to taste",
    "sour cream, for garnish",
    "fresh dill, for garnish"
  ],
  "__v": 1
}