{
  "hash": "95232a5ec06fa1320305fc053b563610735e9c54",
  "title": "The Best BBQ Chicken Kebabs Recipe",
  "image": "http://prod-content-uploads.s3.amazonaws.com/wp-content/uploads/2014/05/The-Best-BBQ-Chicken-Kebabs.jpg",
  "href": "http://fabulesslyfrugal.com/best-bbq-chicken-kebabs-recipe/",
  "firstAdded": "2014-11-23T18:38:25.704000",
  "users": [
    null
  ],
  "keywords": [
    "boneless",
    "skinless",
    "chicken",
    "thighs",
    "breasts",
    "kosher",
    "salt",
    "paprika",
    "smoked",
    "sugar",
    "slices",
    "raw",
    "bacon",
    "pieces",
    "favorite",
    "bbq"
  ],
  "directions": [
    "0",
    "Trim chicken of excess fat, then cut the chicken into 1-inch cubes. In a large bowl, toss the chicken with the salt. Then cover with plastic wrap and refrigerate for at least 30 minutes and up to 1 hour.",
    "Turn all grill burners to high, close lid, and heat for about 15 minutes. Leave primary burner on, but turn off other burners.",
    "Meanwhile, pat the chicken dry with paper towels. In a small bowl, combine the paprikas and sugar. Place the raw bacon in a food processor and pulse for about 30-45 seconds, until a smooth paste forms, scraping down the sides of the bowl twice throughout. Add the bacon paste and spice mixture to the chicken. Mix with hands or spatula until the ingredients are blended and chicken is coated. Thread the chicken onto the skewers, rolling or folding as needed to maintain 1-inch cubes.",
    "Grill the chicken over the primary burner with lid closed, turning one-quarter of a turn every 2 minutes or so, until browned and slightly charred (about 8 minutes total for chicken breast and 10 minutes for thighs). Brush the top of kebabs with BBQ sauce; flip and cook until sauce is browned in spots, about 1 minute. Brush second side with sauce; flip and cook for another minute or so, until cooked through.",
    "Remove kebabs from grill and let rest for 5 minutes. Serve, passing remaining BBQ sauce separately, if desired."
  ],
  "ingredients": [
    "0",
    "2 pounds boneless, skinless chicken thighs or breasts",
    "2 teaspoons kosher salt",
    "1 1/2 tablespoons sweet paprika",
    "2 teaspoons smoked paprika",
    "4 teaspoons sugar",
    "2-3 slices raw bacon, cut into 1/2-inch pieces",
    "1 cup of your favorite BBQ sauce"
  ],
  "__v": 1
}