{
  "__v": 1,
  "directions": [
    "0",
    "Heat the vegetable oil in a 12-inch cast iron pan, or a large sauté pan or skillet, over medium-high heat. When the oil is hot, add the thyme and sage and fry them for 30 seconds. Add the squash, immediately toss to coat with the oil, and spread the squash out into as much of a single layer as possible. Cook for 5 minutes, stirring once or twice.",
    "Lower the heat to medium and continue cooking for another 10 minutes or longer, stirring occasionally, until the sides of the cubes vary from light to dark brown and the squash is tender all the way through when poked with a fork. Pay attention to the heat under the pan, taking care not to burn the outsides before the middles are soft, but don’t fear failure if a few of the cubes darken to near black here and there. As the squash cooks, stir and scrape often with a wooden spoon or heatproof spatula that can do the work of getting the tasty bits up off the bottom of the pan without scraping it silly.",
    "While the squash cooks, briskly whisk together the molasses, balsamic and olive oil and set it aside.",
    "As soon as squash is tender throughout, sprinkle with salt and pepper, adding more to taste. Transfer the butternut to a platter and drizzle with the balsamic vinaigrette. Scatter the shards of cheese over top and serve immediately.",
    "Leftovers, if any, can be stored in an airtight container for up to 3 days and reheated in a hot pan until warm. They are also excellent in an arugula salad with red onions and more of the same balsamic dressing."
  ],
  "hash": "6944a53c2943d0cdf4263bdd59de550e796d6b3a",
  "href": "http://www.thekitchn.com/a-side-dish-recipe-for-roast-chicken-balsamic-butternut-saut-with-parmigiano-shards-pick-a-side-from-tara-mataraza-desmond-195791?utm_source=RSS&utm_medium=feed&utm_campaign=Category%2FChannel%3A+Main#52d41df997f2fcdc4f000013",
  "image": "http://p-hw2.pixstatic.com/525345d9dbfa3f2cb100cfbc._w.540_s.fit_.jpg",
  "ingredients": [
    "0",
    "2 tablespoons vegetable or canola oil",
    "5 fresh sage leaves, sliced into a very thin chiffonade",
    "Leaves of 4 fresh thyme sprigs",
    "1 medium (2 pound) butternut squash, peeled and cut into uniform 3/4-inch cubes, about 5 cups worth (if buying pre-cut squash, you’ll need about 1 1/4 pounds)",
    "1 teaspoon pomegranate molasses (See Recipe Note)",
    "2 tablespoons balsamic vinegar",
    "2 tablespoons extra virgin olive oil",
    "1/2 teaspoon coarse sea salt",
    "1/4 teaspoon freshly ground black pepper",
    "Handful of Parmigiano-Reggiano cheese shavings, to serve"
  ],
  "keywords": [
    "canola",
    "oil",
    "sage",
    "leaves",
    "chiffonade",
    "thyme",
    "sprigs",
    "medium",
    "butternut",
    "uniform",
    "cubes",
    "worth",
    "buying",
    "precut",
    "squash",
    "youll",
    "need",
    "pomegranate",
    "molasses",
    "recipe",
    "balsamic",
    "vinegar",
    "extra",
    "virgin",
    "olive",
    "coarse",
    "salt",
    "black",
    "pepper",
    "parmigianoreggiano",
    "cheese",
    "shavings",
    "serve"
  ],
  "title": "Pan-Seared Butternut Squash with Balsamic & Parmigiano Shards",
  "users": [
    null
  ]
}