{
  "hash": "bc0a43e8f54f2357eda67dc9fb7d1331deb1f895",
  "title": "PIZZA POCKETS",
  "image": "",
  "href": "http://www.cooks.com/recipe/tm84u1qc/pizza-pockets.html",
  "extension": "Firefox",
  "firstAdded": "2015-06-14T11:30:31.883000",
  "users": [
    null
  ],
  "keywords": [
    "slices",
    "bread",
    "mozzarella",
    "cheese",
    "pasta",
    "pizza",
    "salsa",
    "italian",
    "seasoning",
    "extra",
    "virgin",
    "olive",
    "oil",
    "butter",
    "garlic"
  ],
  "directions": [
    "0",
    "For this recipe, a sandwich press or grill is needed. It can be a stovetop sandwich press or electric press and any model will do. If a sandwich press is not available, a turnover press can be used, and the sandwich can be baked in a toaster oven. Square, large bread slices work best.",
    "Place four slices of the bread on a work surface and brush lightly with melted butter.",
    "Combine pasta or pizza sauce with Italian seasoning (if you don't have Italian seasoning, you can use 1/4 teaspoon each of basil and oregano, or just use pre-seasoned sauce, or salsa may be used if the extra liquid is removed). Spoon several tablespoons of sauce onto 2 of the slices of bread.",
    "Sprinkle with several tablespoons of shredded cheese (almost any kind may be substituted for the mozzarella, but mozzarella will be the most like a traditional pizza).",
    "Keep the fillings mostly in the middle so that edges can make a better seal.",
    "Drizzle with a few drops of olive oil. Sprinkle ever so lightly with garlic powder.",
    "Cover with the second slice of bread, as you would a sandwich. Brush the outsides of both slices with butter. Brush the inside of the sandwich press with olive oil.",
    "Heat sandwich press and grill until browned on outside and cheese inside has melted, about 3-4 minutes, or follow directions included with the sandwich press.",
    "If using a turnover press, place sandwich in press and fold over to crimp edges well. Toast in a preheated toaster oven at 375-400F for about 4 minutes, or until nicely golden."
  ],
  "ingredients": [
    "0",
    "4 slices bread",
    "1/2 cup mozzarella cheese",
    "about 1/2 cup pasta, pizza sauce or salsa",
    "1/4 teaspoon Italian seasoning",
    "1 teaspoon extra virgin olive oil",
    "1 teaspoon melted butter",
    "garlic powder"
  ],
  "__v": 1
}