{
  "hash": "07af948ad03f0541ef12f63583ee6394c1d9f48b",
  "title": "Vegan Gluten Free Pumpkin Pie",
  "image": "http://cdn.minimalistbaker.com/wp-content/uploads/2014/11/THE-BEST-Vegan-Gluten-Free-Pumpkin-Pie-10-ingredients-simple-methods-SO-delicious.jpg",
  "href": "http://minimalistbaker.com/vegan-gluten-free-pumpkin-pie/",
  "extension": "",
  "firstAdded": "2015-10-27T12:49:24.759000",
  "users": [
    null
  ],
  "keywords": [
    "cold",
    "vegan",
    "butter",
    "chilled",
    "coconut",
    "oil",
    "varied",
    "results",
    "bobs",
    "red",
    "gluten",
    "free",
    "flour",
    "salt",
    "ice",
    "water",
    "pumpkin",
    "puree",
    "maple",
    "syrup",
    "brown",
    "sugar",
    "plain",
    "almond",
    "milk",
    "olive",
    "cornstarch",
    "arrowroot",
    "pie",
    "spice",
    "sub",
    "ginger",
    "cinnamon",
    "nutmeg"
  ],
  "directions": [
    "0",
    "To prepare crust, add gluten free flour and salt to a large mixing bowl and whisk to combine. Slice or dollop the cold butter in and work gently with a fork or pastry cutter to cut it in. Don’t overwork, just get it incorporated.",
    "Next add ice cold water a little at a time and use a wooden spoon to stir. Only add as much water as you need to help it come together.",
    "Once a loose dough is formed, transfer to a piece of plastic wrap and work gently with your hands to form a 1/2 inch thick disc. Wrap firmly and refrigerate for a minimum 30 minutes, up to 2 days. Just let it warm back up a little before using. You don’t want it too warm or it can get too soft to handle.",
    "Once your dough is chilled, preheat oven to 350 degrees F and prepare pie filling.",
    "Add all pie ingredients to a blender and blend until smooth, scraping down sides as needed. Taste and adjust seasonings as needed. Set aside.",
    "To roll out the crust, unwrap the disc and place it between two sizable layers of wax paper (plastic wrap will work OK, but is a little more difficult to work with). Use a rolling pin to gently roll it into the shape of your pie pan. If it cracks, don’t stress - you can reform it with your hands once you get it in the pan. But try and be gentle.",
    "To transfer the crust, remove the top layer of wax paper and gently lay the pie dish face down on top of the crust and use the support of the wax paper to quickly but carefully invert it. Don’t overthink it - just do it.",
    "Once you get the crust inverted, gently use your hands to form it into the pan, working the crust up along the sides. It can be a little tricky but it bakes beautifully, so it’s worth the effort! Just try not to overwork the dough in the process - it shouldn’t take more than a few minutes to perfect the shape. Any holes or cracks can be mended with a little excess dough and the heat of your hand.",
    "TIP: I would advise against trying to be fancy and do any elaborate design with the crust, so just get the crust in, get a flat edge and go.",
    "Pour filling into pie crust and bake at 350 for 58-65 minutes. The crust should be light golden brown and the filling will still be just a bit jiggly and have some cracks on the top. Remove from oven and let cool completely before loosely covering and transferring to the refrigerator to fully set for 4-6 hours, preferably overnight.",
    "Slice and serve with coconut whipped cream and an additional sprinkle of cinnamon, nutmeg, and/or pumpkin pie spice (optional). This would also be amazing with my Vegan Pumpkin Pie Ice Cream and Brown Sugar Pecans!"
  ],
  "ingredients": [
    "0",
    "6 Tbsp cold vegan butter (or chilled coconut oil with varied results)",
    "1 1/4 cup Bob’s Red Mill 1:1 Gluten Free Flour",
    "1/4 tsp salt",
    "4-6 Tbsp ice cold water",
    "1",
    "2 3/4 cups pumpkin puree (~1 1/2 15-ounce cans)",
    "1/4 cup maple syrup",
    "1/4 cup brown sugar",
    "1/3 cup unsweetened plain almond milk",
    "1 Tbsp olive oil, or melted coconut oil",
    "2 1/2 Tbsp cornstarch or arrowroot powder",
    "1 3/4 tsp pumpkin pie spice (or sub mix of ginger, cinnamon, nutmeg & cloves)",
    "1/4 tsp sea salt"
  ],
  "__v": 1
}