{
  "hash": "940be61d552e9a162f85efd9853f39b7d8257918",
  "title": "Easy Vegan and Gluten-Free Pancakes (Strawberry Shortcake w/ Whipped Cream)",
  "image": "http://cdn.ohsheglows.com/wp-content/uploads/2014/02/veganglutenfreepancakes-5612.jpg",
  "href": "http://ohsheglows.com/2014/02/25/easy-vegan-and-gluten-free-pancakes-strawberry-shortcake-w-whipped-cream/",
  "extension": "Chrome",
  "firstAdded": "2016-02-15T22:34:06.058000",
  "users": [
    null
  ],
  "keywords": [
    "raw",
    "buckwheat",
    "groats",
    "flour",
    "brown",
    "rice",
    "arrowroot",
    "baking",
    "salt",
    "cinnamon",
    "almond",
    "milk",
    "maple",
    "syrup",
    "agave",
    "nectar",
    "vanilla",
    "heaping",
    "bananas",
    "smallmedium",
    "coconut",
    "whipped",
    "cream",
    "strawberries"
  ],
  "directions": [
    "0",
    "Directions:",
    "Preheat a large non-stick skillet over medium heat. A drop of water should sizzle on the skillet when it’s ready.",
    "In a blender, blend the buckwheat groats on high speed until a fine flour forms. Place into a large bowl. Now whisk in the rest of the dry ingredients (rice flour, arrowroot, baking powder, salt, and cinnamon).",
    "In a medium bowl, whisk together the almond milk, syrup, and vanilla extract. Pour this onto the dry ingredients and whisk the batter until no clumps remain.",
    "Dice the banana until it's the size of peas or a bit larger. Fold the diced banana into the batter.",
    "Lightly grease skillet (I spray olive oil on it). Scoop a heaping 1/4 cup of batter onto the preheated skillet and quickly spread the batter out into a circle. Cook until some bubbles appear and the edge looks deeper in colour and more firm. Flip and cook for another couple minutes until golden. Adjust heat as needed. Repeat for the other pancakes. I spray the skillet with oil before each pancake is cooked and this seems to work well.",
    "Stack and serve with Coconut Whipped Cream and fresh chopped strawberries, if desired. Or simply serve with pure maple syrup!",
    "Tips:",
    "Notes:",
    "If using frozen blueberries, pour batter onto skillet first and then top with blueberries to prevent bleeding.",
    "I tried subbing the rice flour for oat flour and the pancakes stuck to the pan, so I would advise against that substitution.",
    "If at any time your batter is too thick or if you want thinner pancakes, simply thin it out with a splash or two of almond milk."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "1 cup raw buckwheat groats, ground into a fine flour",
    "1/2 cup brown rice flour",
    "2 tablespoons arrowroot powder",
    "2 teaspoons baking powder",
    "1/4 teaspoon fine grain sea salt",
    "1/2 teaspoon cinnamon",
    "1.5 cups + 3 tablespoons almond milk",
    "2 tablespoons maple syrup (or agave nectar)",
    "2 teaspoons pure vanilla extract",
    "1 heaping cup diced ripe bananas (about 2 small/medium)",
    "Coconut Whipped Cream, for garnish",
    "Chopped Fresh Strawberries, for garnish"
  ],
  "__v": 1
}