{
  "hash": "be8f5e4edf35be66637afdb4b3d0a0ea34426776",
  "title": "VEGAN MOUSSAKA BURGER WITH BECHAMEL CHEESE SAUCE",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2013/11/Moussaka-Burger-with-Bechamel-Cheese-Sauce.png",
  "href": "http://www.onegreenplanet.org/plant-based-recipes/vegan-moussaka-burger-with-bechamel-cheese-sauce/",
  "firstAdded": "2015-01-19T15:53:46.120000",
  "users": [
    null
  ],
  "keywords": [
    "tbs",
    "canola",
    "oil",
    "divided",
    "eggplants",
    "cubed",
    "scallions",
    "tomato",
    "mashed",
    "potatoes",
    "parsley",
    "garlic",
    "cumin",
    "kosher",
    "salt",
    "oregano",
    "black",
    "pepper",
    "cinnamon",
    "nutmeg",
    "glutenfree",
    "bread",
    "crumbs"
  ],
  "directions": [
    "0",
    "In a large skillet, heat 1 Tbs. of the oil over medium-high heat. Add the eggplant cubes and sauté until they are browned and very soft, about 10 minutes. Make sure they are super-soft because they need to be mashed.",
    "Transfer the eggplant to a large bowl. Mash the eggplant up until there are no whole pieces left. I use a potato masher to do this. Once you have a big bowl of mush, add the scallions, tomato paste, mashed potatoes, parsley, garlic and spices. Mix it into the eggplant. Add the bread crumbs. Don’t add them all at once; you want to feel the mix and see whether you need a whole cup. I add 1/2 cup of bread crumbs and mix it. The best way to mix it is wet your hands and use one hand (keep the other hand clean) to gently mix the crumbs into the eggplant. You will probably need more crumbs so add another ¼ cup and mix it again. You want the consistency to feel firm, like it will hold up as a burger. I usually end up putting the whole cup of crumbs in.",
    "Put the eggplant-potato mixture into the fridge for about 30 minutes. Take the bowl out of the fridge and with your hand, divide the mixture into 4 parts. To form the burgers, I use a 3 ½ inch cookie cutter. I spray it with a bit of cooking oil spray and then pack the eggplant mixture into the cookie cutter. Pat it down, let it sit for about 20 seconds and then gently lift the cookie cutter off. Let your perfect burger sit for a few minutes undisturbed while you make the other 3 burgers.",
    "In the same skillet that you sautéed the eggplant in (but cleaned), heat the other Tbs. of oil over medium-high heat and add the burgers to the pan. Let cook until slightly browned on one side and (this is very important) you can lift the burger with a spatula without breaking it. I use 2 thin spatulas to gently turn the burgers. Flip them and let them cook on the other side. When the 2nd side gets golden brown, flip them back over and let the first side cook until golden brown."
  ],
  "ingredients": [
    "0",
    "2 Tbs. canola oil, divided",
    "2 eggplants, peeled and cubed",
    "3 scallions, finely chopped",
    "2 Tbs. tomato paste",
    "1 ½ cup mashed potatoes",
    "2 Tbs. fresh parsley, chopped",
    "2 cloves garlic, minced",
    "1 tsp. ground cumin",
    "1 tsp. Kosher salt",
    "½ tsp. dried oregano",
    "½ tsp. black pepper",
    "¼ tsp. cinnamon",
    "¼ tsp. nutmeg",
    "½ – 1 cup gluten-free bread crumbs"
  ],
  "__v": 1
}