{
  "hash": "659e0b3350c47342c71639e93039161dd82089ab",
  "title": "Pasta with Clams, White Wine and Spicy Italian Sausage",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2014/3/15/0/GI1606H_Spicy-Clams-with-White-Wine-and-Italian-Sausage_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/guy-fieri/pasta-with-clams-white-wine-and-spicy-italian-sausage.html",
  "extension": "Chrome",
  "firstAdded": "2016-08-21T10:58:52.189000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350 degrees F.",
    "Place the clams in a large bowl and cover with cool tap water. Salt the water well and let the clams sit for 20 minutes to an hour to purge them of sand and grit. Drain and scrub the shells well under cold running water.",
    "Set a large roasting pan across two burners. Heat the olive oil over medium-high heat. Add the onions and garlic and saute for 2 to 3 minutes, or until softened. Add the chile, fennel and sausage, and cook for 3 to 4 minutes, stirring occasionally to break up the sausage.",
    "Once the sausage is nicely browned, deglaze the pan with the white wine. Add the clams and stir everything together until well combined. Arrange the tomatoes on top, add the thyme, and sprinkle with salt and pepper. Transfer the pan to the oven and cook until the clams pop open and the cherry tomatoes are roasted and juicy, 10 to 12 minutes.",
    "Meanwhile, in a large pot of boiling, salted water, cook the linguine until al dente. When the clams are done, return the roasting pan to the stovetop over high heat. Simmer to reduce excess liquid and to open any clams that are still closed (stirring vigorously with a wooden spoon also helps).",
    "Taste sauce and season with salt as needed.",
    "Drain the pasta and transfer it directly into the roasting pan. Add the butter, lemon zest and juice, and the parsley. With tongs, toss everything together to coat the pasta in the sauce.",
    "Serve topped with plenty of grated pecorino if using.",
    "Recipe courtesy of Guy Fieri"
  ],
  "ingredients": [
    "0",
    "36 littleneck clams",
    "2 tablespoons extra-virgin olive oil",
    "1/2 yellow onion, diced",
    "2 cloves garlic, minced",
    "1 medium red chile, such as red jalapeno or red Fresno, finely sliced",
    "2 teaspoons fennel seeds",
    "1/2 pound spicy Italian sausage, casings removed",
    "1 cup dry white wine",
    "1 1/2 cups grape tomatoes",
    "3 sprigs fresh thyme, leaves picked",
    "1 pound linguine",
    "Kosher salt and freshly ground black pepper",
    "3 tablespoons butter, cold, cubed",
    "Zest and juice of 1/2 lemon",
    "1/4 cup fresh flat-leaf parsley, chopped",
    "Pecorino Romano, grated, for serving, optional"
  ],
  "__v": 1
}