{
  "hash": "372b7f9f7f259e9385f109982262930ed5172003",
  "title": "carrot soup with tahini and crisped chickpeas",
  "image": "http://farm9.staticflickr.com/8499/8339826009_36377776f1.jpg",
  "href": "http://smittenkitchen.com/blog/2013/01/carrot-soup-with-tahini-and-crisped-chickpeas/",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T22:45:24.267000",
  "users": [
    null
  ],
  "keywords": [
    "soup",
    "olive",
    "oil",
    "carrots",
    "onion",
    "regular",
    "garlic",
    "smashed",
    "coriander",
    "cumin",
    "salt",
    "needed",
    "aleppo",
    "red",
    "pepper",
    "broth",
    "crisped",
    "chickpeas",
    "gram",
    "patted",
    "dry",
    "paper",
    "towels",
    "generous",
    "coarse",
    "lemontahini",
    "dollop",
    "tahini",
    "lemon",
    "juice",
    "water",
    "pita",
    "wedges",
    "pitas",
    "brush",
    "zaatar",
    "middle",
    "eastern",
    "spiceherb",
    "blend",
    "sesame",
    "seeds",
    "sprinkle",
    "flatleaf",
    "parsley",
    "coarsely"
  ],
  "directions": [
    "0",
    "Heat two tablespoons olive oil in heavy large pot over medium heat. Add carrots, onion, garlic, coriander, cumin, salt and pepper flakes and sauté until they begin to brown, about 15 minutes.",
    "Meanwhile, heat your oven to 425 degrees F. Toss chickpeas with one tablespoon olive oil, salt and cumin until they’re all coated. Spread them on a baking sheet or pan and roast them in the oven until they’re browned and crisp. This can take anywhere from 10 to 20 minutes, depending on the size and firmness of your chickpeas. Toss them occasionally to make sure they’re toasting evenly.",
    "Once vegetables have begun to brown, add broth, using it to scrape up any bits stuck to the bottom of the pot. Cover pot with lid and simmer until carrots are tender, stirring occasionally, about 30 minutes.",
    "Meanwhile, in a small dish, whisk together tahini, lemon juice, salt and water until smooth with a yogurt-like consistency. If more liquid is needed to thin it, you can add more lemon juice or water, a spoonful at a time, until you get your desired consistency.",
    "Spread pita wedges on a second baking sheet and brush lightly with olive oil. Sprinkle with za’atar or a combination of sea salt and sesame seeds and toast in oven with chickpeas until brown at edges, about 5 minutes.",
    "Puree soup in a blender or with an immersion blender until smooth. Ladle into bowls. Dollop each with lemon-tahini, sprinkle with crisped chickpeas and garnish with chopped parsley. Serve with pita wedges. Forget January, you’d eat this anytime. Right?"
  ],
  "ingredients": [
    "0",
    "Soup",
    "2 tablespoons (30 ml) olive oil",
    "2 pounds (905 grams) carrots, peeled, diced or thinly sliced",
    "1 large onion, finely chopped",
    "4 regular or 6 small garlic cloves, peeled and smashed",
    "1/4 teaspoon ground coriander",
    "1/2 teaspoon ground cumin",
    "1/2 teaspoon table salt, plus more if needed",
    "Pinch of Aleppo pepper or red pepper flakes",
    "4 cups (945 ml) vegetable broth",
    "Crisped chickpeas",
    "1 3/4 cups cooked chickpeas, or 1 15-ounce (425-gram) can, drained, patted dry on paper towels",
    "1 generous tablespoon (15 ml or so) olive oil",
    "1/2 teaspoon coarse salt",
    "1/4 teaspoon ground cumin",
    "Lemon-tahini dollop",
    "3 tablespoons (25 grams) tahini paste",
    "2 tablespoons (30 ml) lemon juice",
    "Pinch or two of salt",
    "2 tablespoons (30 ml) water",
    "Pita wedges, garnish",
    "A few large pitas, cut into 8 wedges",
    "Olive oil, to brush pitas",
    "Za’atar (a Middle Eastern spice-herb blend) or sesame seeds and sea salt to sprinkle",
    "2 tablespoons flat-leaf parsley, coarsely chopped"
  ],
  "__v": 1
}