{
  "hash": "679bb8e31fda26f389a2933796732f78bd42df66",
  "title": "Haemul Sundubu Jjigae (Seafood Soft Tofu Stew)\nCook Time\n15 mins",
  "image": "https://www.koreanbapsang.com/wp-content/uploads/2012/02/DSC_0106-150x150.jpg",
  "href": "https://www.koreanbapsang.com/haemul-sundubu-jjigae-seafood-soft-tofu/",
  "extension": "Chrome",
  "firstAdded": "2019-01-20T03:32:58.146000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cut the meat into small (about 1-inch long) thin strips. Clean the seafood. Cut the the zucchini into about 1-inch pieces. Dice the onion and scallion.",
    "Add the red chili pepper flakes and sesame oil to a small pot, and place it over medium heat. Stir until the pepper flakes become a bit pasty in the heating pot. (The red chili pepper flakes burn easily, so do not preheat the pot.)",
    "Add the meat, onion, garlic, and soy sauce. Stir fry until the pork and onion are almost cooked, 2 - 3 minutes.",
    "Pour in the broth (or water). Bring it to a boil and continue to boil for 3 - 4 minutes.",
    "Add the soft tofu in big chunks along with the zucchini. Bring to a boil again. Gently stir at the bottom of the pot once or twice so the tofu does not stick to the bottom. Cook for 3 - 4 minutes.",
    "Add the seafood and boil until the clams and mussels open, 2 - 3 minutes. Salt and pepper to taste. Add the chopped scallion right before turning the heat off. If desired, crack an egg into the stew right before serving while it's still boiling hot."
  ],
  "ingredients": [
    "0",
    "1 package 11 ounces sundubu (extra soft/silken tofu)",
    "2 ounces beef or pork rib eye, sirloin, pork loin or pork belly",
    "7 - 8 pieces of seafood assortment shrimp, mussels, clams, and/or oysters",
    "1/2 small zucchini 2 - 3 ounces",
    "1/4 onion 2 - 3 ounces",
    "1 scallion",
    "1 tablespoon red chili pepper flakes gochugaru- adjust to taste.",
    "1 teaspoon sesame oil use a little more if using more gochugaru",
    "1 teaspoon garlic",
    "1 teaspoon soy sauce",
    "salt to taste about 1/2 teaspoon",
    "pinch pepper",
    "1 cup anchovy broth or other broth or water",
    "1 egg optional"
  ],
  "__v": 1
}