{
  "hash": "d368e89ee8bdfbb706bc0b1794c27f1a4046c1f0",
  "title": "Alfajores and Dulce de Leche",
  "image": "http://recipe-folder.com/img/recipe-images/036/395/2656093836.jpg",
  "href": "http://passthesushi.com/baked-elements-review-alfajores-and-dulce-de-leche/",
  "extension": "Chrome",
  "firstAdded": "2017-04-11T20:34:05.571000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparation for dulce de leche:",
    "Stir together the sweetened condensed milk and salt in a microwave safe bowl. Cook at 50% power for 4 minutes, stirring briskly halfway through until smooth. Cook at 30% power for 12-18 minutes, until very thick and caramel colored, stirring briskly every 2 minutes until smooth. Set aside to cool.",
    "Preparation for alfajores:",
    "In a large bowl, whisk together the flour, baking powder, soda, and salt. Sift the cornstarch over the flour and whisk again to combine. Set aside.",
    "In the bowl of a standing mixer, fitted with the paddle attachment, heat the butter and sugar together on medium-high speed until smooth and creamy. Scrape down the sides and bottom of the bowl. Add the lemon zest and beat for another 15 seconds. Add the egg yolks and egg, one at a time, beating until mixture is light and fluffy. Scrape down the sides again and add the rum and vanilla. Beat for 10 seconds.",
    "Add half of the flour mixture and beat for 15 seconds. Add the remaining flour and beat until just incorporated. Transfer the dough to a sheet of plastic wrap and pat into a disk. Wrap and refrigerate for at least 1 1/2 hours.",
    "Preheat the oven to 350 degrees F. Line two baking sheets with parchment paper.",
    "Unwrap the dough and divide into 2 equal portions. Wrap the second portion back in the wrap and return to fridge. Place the portion you are working with on a lightly floured surface and form into a disk. Roll dough out to 1/8″ thick. Use a 2″ round cookie cutter to create the tops and bottoms, transfer them to the prepared baking sheets, leaving about 1″ between each cookie. Continue the process with the second piece of dough. Extra dough scraps can be refrigerated 10 minutes and re-rolled, if desired.",
    "Refrigerate the cookie filled sheet pans for 5 minutes before baking. Bake for 8-11 minutes, rotating half way through. The cookies will be down when they are just beginning to color. They won’t be ‘brown’ but a very soft golden. Place the baking sheets on a wire rack to cool for 5 minutes. Using a spatula, transfer the cookies to the racks to cool completely before filling.",
    "Using a pastry bag fitted with a medium tip, or a small spoon, apply about 2 tablespoons of dulce de leche to the flat side of a cookie. Place another cookie, flat side down, on top. Press slightly so that the filling spreads to the edges. Repeat until all the sandwich cookies are made. Sift confectioners’ sugar over each cookie if desired, and let them set for about 15 minutes before serving.",
    "The cookies can be stored at room temperature, tightly covered, for up to 3 days."
  ],
  "ingredients": [
    "0",
    "Ingredients for Dulce de Leche:",
    "28 ozs sweetened condensed milk",
    "1/2 teas salt",
    "Ingredients for Alfajores:",
    "2 cups flour",
    "3/4 teas baking powder",
    "3/4 teas baking soda",
    "1/2 teas salt",
    "1 cup cornstarch",
    "6 oz unsalted butter, cool but not cold, cut into 1/2″ cubes",
    "2/3 cup sugar",
    "1 tbs lemon zest",
    "3 large egg yolks, plus 1 large egg",
    "2 tbs light rum",
    "1 teas pure vanilla extract",
    "2 to 2 1/2 cups dulce de leche",
    "2 tbs confectioners’ sugar for dusting"
  ],
  "__v": 3
}