{
  "hash": "fed5bc9645a9cb5fbbb20cf674067c3a9425efca",
  "title": "Simple Seedy Slaw",
  "image": "https://cookieandkate.com/images/2016/01/healthy-coleslaw-recipe-with-seeds-1.jpg",
  "href": "https://cookieandkate.com/2016/simple-healthy-coleslaw-recipe/",
  "extension": "Firefox",
  "firstAdded": "2018-01-23T05:41:20.600000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium serving bowl, combine the prepared purple and green cabbage, carrots and parsley. Set aside.",
    "Measure out your seeds into a small skillet. Toast over medium heat, stirring frequently, until the seeds are fragrant and the pepitas are starting to make little popping noises. Pour the toasted seeds into the mixing bowl and toss to combine.",
    "To make the dressing, in a small bowl, combine the olive oil with 2 tablespoons lemon juice. Add the garlic, cumin and salt and whisk until thoroughly blended.",
    "Drizzle the dressing over the slaw and toss until all of the ingredients are lightly coated in dressing. Taste and add an additional tablespoon of lemon juice if the slaw needs a little more zip. Serve immediately or cover and refrigerate to marinate for up to several hours."
  ],
  "ingredients": [
    "0",
    "Coleslaw",
    "2 cups finely sliced purple cabbage (one small cabbage will be more than plenty)",
    "2 cups finely sliced green cabbage (one small cabbage will be more than plenty)",
    "2 cups shredded carrots (I used store-bought shredded organic carrots, but you could also grate them on a box grater, in a food processor, or julienne the carrots with a sharp knife)",
    "¼ cup chopped fresh parsley",
    "Up to ¾ cup mixed seeds (I used mostly pepitas—AKA green pumpkin seeds—and sunflower seeds, with some sesame seeds and poppy seeds)",
    "Lemon dressing",
    "¼ cup olive oil",
    "2 to 3 tablespoons lemon juice, to taste",
    "1 clove garlic, pressed or minced",
    "½ teaspoon ground cumin",
    "½ teaspoon salt"
  ],
  "__v": 1
}