{
  "__v": 2,
  "directions": [
    "0",
    "For the scones:",
    "Preheat oven to 425 degrees. In a food processor pulse together flour, baking powder, baking soda, salt, cinnamon, nutmeg, ginger, cloves, brown sugar and granulated sugar until well blended (if you don't have a food processor you can whisk by hand in a large mixing bowl, then cut in butter with a pastry cutter). Add butter and pulse mixture several times to cut butter into mixture (large pieces of butter should no longer be visible). Pour mixture into a large mixing bowl and create a well in center.",
    "In a bowl whisk together chilled pumpkin puree, buttermilk, egg, vanilla extract and honey. Pour mixture into well in flour/butter mixture. Stir mixture with a wooden spoon to incorporate, then knead in bowl (or on work surface) by hand several times to bring mixture together. Dust a work surface with flour then invert dough onto surface. Pat and shape dough into an even 8-inch round. Using a large knife, slice into 8 equal wedges (dust knife with flour as needed while cutting, it will be fairly sticky).",
    "Transfer scones to a Silpat or parchment paper lined baking sheet. Brush tops with 1 Tbsp half and half then bake in preheated oven 13 - 15 minutes until tops are golden brown and toothpick inserted into center comes out clean. Transfer to a wire rack and cool 10 minutes (no longer) before spreading with glaze.",
    "For the glaze:",
    "In a mixing bowl whisk together powdered sugar and half and half, adding more half and half as needed to reach desired consistency (it should be fairly thick not runny). Spoon and spread mixture scones to evenly coat tops (use all of it). Let glaze set at room temperature.",
    "For the pumpkin glaze:",
    "In a mixing bowl (I just used the one from the glaze above without cleaning out) whisk together powdered sugar, pumpkin puree, cinnamon, nutmeg, ginger and half and half. Transfer mixture to a small Ziploc bag, seal bag, cut a small tip from corner and drizzle mixture over tops of scones. Allow icing to set. Best served day prepared.",
    "Recipe Source: Cooking Classy"
  ],
  "firstAdded": "2014-08-25T19:50:51.399000",
  "hash": "ddb15e042f19cb7ba683f031d7ccc2a590fb8fba",
  "href": "http://www.cookingclassy.com/2014/08/pumpkin-scones-starbucks-copycat/",
  "image": "http://www.cookingclassy.com/wp-content/uploads/2014/08/pumpkin-scones3+text..jpg",
  "ingredients": [
    "0",
    "2 1/4 cups all-purpose flour",
    "2 tsp baking powder",
    "1/4 tsp baking soda",
    "1/2 tsp salt",
    "1 tsp ground cinnamon",
    "1/2 tsp ground nutmeg",
    "1/4 tsp ground ginger",
    "1/8 tsp ground cloves",
    "1/4 cup packed light-brown sugar",
    "3 Tbsp granulated sugar",
    "1/2 cup unsalted butter, cold and diced into 1/2-inch pieces",
    "1/2 cup + 1 Tbsp canned pumpkin puree, chilled (don't chill in can)",
    "3 1/2 Tbsp buttermilk",
    "1 large egg",
    "1 tsp vanilla extract",
    "1 Tbsp honey",
    "1 Tbsp half and half",
    "1 cup powdered sugar",
    "2 Tbsp half and half, then more as needed",
    "3/4 cup powdered sugar",
    "1 Tbsp pumpkin puree",
    "1/4 tsp ground cinnamon",
    "1/8 tsp ground nutmeg",
    "1/8 tsp ground ginger",
    "1 Tbsp half and half"
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "baking",
    "soda",
    "salt",
    "cinnamon",
    "nutmeg",
    "ginger",
    "lightbrown",
    "sugar",
    "granulated",
    "unsalted",
    "butter",
    "cold",
    "pieces",
    "canned",
    "pumpkin",
    "puree",
    "chilled",
    "dont",
    "chill",
    "buttermilk",
    "egg",
    "vanilla",
    "honey",
    "needed"
  ],
  "title": "Pumpkin Scones {Starbucks Copycat}",
  "users": [
    null,
    null
  ]
}