{
  "__v": 1,
  "directions": [
    "0",
    "Add the chicken breasts to the bottom of your slow cooker in a single layer.",
    "In a separate bowl, whisk together the garlic, onion, honey, soy sauce, rice wine vinegar, ginger, and black pepper until combined. Pour the mixture on top of the chicken breasts. Cover slow cooker, and cook on high for 4-5 hours, or until the chicken is cooked through and shreds easily with a fork. Remove the chicken with a slotted spoon to a separate bowl and shred it using two forks. Transfer the remaining teriyaki sauce from the slow cooker to a medium saucepan.",
    "Meanwhile in a separate bowl, whisk together the cold water and cornstarch until the cornstarch is dissolved and no longer lumpy. Pour the cornstarch slurry into the teriyaki sauce mixture, and whisk to combine. Bring the mixture to a boil over medium-high heat, and let it boil for about 1-2 minutes or until thickened. Remove from heat, and pour the sauce on top of the shredded chicken. Toss to combine.",
    "Serve topped with scallions (green onions) and toasted sesame seeds if desired."
  ],
  "firstAdded": "2014-09-28T17:51:18.074000",
  "hash": "68b1291a5ee50ff8eefcd7e87ebfb69c7b3dff3a",
  "href": "http://www.gimmesomeoven.com/slow-cooker-teriyaki-chicken-teriyaki/",
  "image": "http://www.gimmesomeoven.com/wp-content/uploads/2014/01/Slow-Cooker-Teriyaki-Chicken-1.jpg",
  "ingredients": [
    "0",
    "2 lbs boneless, skinless chicken breasts",
    "2 cloves garlic, minced",
    "1/2 cup chopped white onion",
    "1/2 cup honey",
    "1/2 cup soy sauce (use low-sodium if desired)",
    "1/4 cup rice wine vinegar",
    "1 Tbsp. chopped fresh ginger",
    "1/8 tsp. freshly ground black pepper",
    "1/4 cup cold water",
    "3 Tbsp. cornstarch",
    "(optional toppings: sliced scallions and toasted sesame seeds)"
  ],
  "keywords": [
    "lbs",
    "boneless",
    "skinless",
    "chicken",
    "breasts",
    "garlic",
    "white",
    "onion",
    "honey",
    "soy",
    "use",
    "lowsodium",
    "desired",
    "rice",
    "wine",
    "vinegar",
    "ginger",
    "black",
    "pepper",
    "cold",
    "water",
    "cornstarch",
    "toppings",
    "scallions",
    "sesame",
    "seeds"
  ],
  "title": "Slow Cooker Teriyaki Chicken",
  "users": [
    null
  ]
}