{
  "hash": "dd8ac247226dc2816d798f7b2af2eb1f12f5610c",
  "title": "Mint Chocolate Energy Bites",
  "image": "https://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2014/04/Mint-Chocolate-Energy-Bites-3.jpg",
  "href": "https://sallysbakingaddiction.com/2014/04/21/mint-chocolate-energy-bites/",
  "extension": "Chrome",
  "firstAdded": "2018-10-09T17:13:14.315000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "First, make sure your dates are soft by soaking in warm water for 10 minutes. Make sure you drain them and chop in half before using.",
    "Pulse the walnuts and almonds in a food processor until they are coarsely chopped, as shown in the photo above. Then add 1/4 cup cocoa powder, maple syrup, dates, and 1/8 teaspoon peppermint extract - in that order. I usually start with 1/8 teaspoon peppermint extract and then add a little more (up to 1/4 teaspoon) if I feel they need it. Process for 2 minutes or until a thick oily “dough” is formed, as pictured above. The dough will be oily from the nuts. You may have to scrape down the sides of the food processor a few times to get all of the dry ingredients to the bottom. If the dough is too dry, add more maple syrup and/or dates.",
    "Once a dough is formed, scoop the dough (about 1 Tablespoon each) and roll into a smooth ball with your hands. If rolling into cocoa powder, spread the remaining 1 Tablespoon of cocoa powder onto a plate and roll the moist dough ball around to fully cover. Store bites in the refrigerator for up to 7 days.",
    "Make ahead tip: You can freeze these little healthy bites too! Freeze for up to 3 months. Thaw overnight in the refrigerator before serving."
  ],
  "ingredients": [
    "0",
    "1/2 cup walnuts (I use unsalted)",
    "2/3 cup almonds (I use unsalted)",
    "1/3 cup unsweetened cocoa powder",
    "2 Tablespoons pure maple syrup",
    "9 Medjool dates, pitted and soaked in warm water for 10 minutes",
    "1/4 teaspoon peppermint extract"
  ],
  "__v": 1
}