{
  "__v": 1,
  "directions": [
    "0",
    "Combine all ingredients, except chicken, together in a bowl. Whisk until everything is mixed together. Add the chicken. Put the mixture in the fridge for at least 2 hours—preferably overnight.",
    "When you’re ready to cook it, you can put it on skewers and grill it–or you can use your broiler. Heat the oven to Broil. Put the chicken pieces on a rack over a baking sheet lined with aluminum foil.",
    "if some fall through the cracks…that’s okay.",
    "Put them in the oven and broil until they start turning a little black on the edges and look dry. The chicken won’t actually be dry, the yogurt in the marinade will help keep that from happening.",
    "When it’s done, it should look a little like this:",
    "Chicken Tikka Pieces",
    "Curry:",
    "Heat the ghee/oil in a large pan over medium high heat. Once it gets warm, add the cloves, cardamom, cinnamon, nutmeg, cumin, turmeric, coriander powder, and garam masala. Stir until everything becomes fragrant and dry.",
    "Toss in the garlic and ginger. Cook for about a minute before adding the tomato paste, red chilli powder and fenugreek leaves (I think fenugreek and nutmeg are *secret* ingredients). Stir everything together. It will be dry and look something like this:",
    "masala mix",
    "Add the butter and 3 cups curry gravy base and whisk everything together. Once it’s smooth, add the lemon juice and half & half. Transfer the curry to a blender and blend until smooth (this can be skipped if you don’t mind a few little chunks). Season with salt and pepper, to taste.",
    "Add the cooked chicken and let the curry simmer for about 15 minutes. It’ll thicken slightly, use milk to thin…if you’d like. Garnish with chopped coriander. Serve with rice or rotis.",
    "I hope I didn’t miss anything! It’s been a long day, but I really wanted to get this recipe posted!",
    "Chicken Tikka Masala",
    "Because it’s so delicious…and so not good for you!…one thing I do to keep my portion sizes reasonable is that I make my Chicken Tikka Masala extra spicy. Spicier foods tend to fill me up faster, and I feel happy and satisfied (although my mouth is on fire!) on about a half cup of curry.",
    "printer-friendly version",
    "I’m sure leftovers won’t be wasted, but if you can manage to save a couple cups of the chicken tikka masala…you could have this for dinner the next day:"
  ],
  "firstAdded": "2014-05-09T06:13:28.841000",
  "hash": "b98798238e4e92f7a9d44917d2e37b50d808fe76",
  "href": "http://myfancypantry.com/2012/04/06/chicken-tikka-masala/",
  "image": "http://myfancypantry.files.wordpress.com/2012/04/chicken-tikka-04380.jpg?w=625",
  "ingredients": [
    "0",
    "1 lb chicken breast, diced and marinated (recipe below)",
    "1 tablespoon ghee (sub. veg. oil)",
    "1 tbsp vegetable oil",
    "7 cloves garlic – smashed and diced fine",
    "1 inch ginger – smashed and diced fine",
    "3 green cardamom pods",
    "4 whole cloves",
    "1 inch piece of cinnamon",
    "1/4 tsp. grated nutmeg",
    "1 tablespoon cumin",
    "1 tablespoon coriander powder",
    "1 teaspoon turmeric",
    "2 tablespoon fresh fenugreek leaves (leave out if you can’t find)",
    "1 1/2 tablespoon garam masala",
    "2 tablespoons tomato paste",
    "red chilli powder, to taste –taste as you add! Sometimes, less is more!!!!!",
    "juice of 1/2 small lemon",
    "3 cups curry gravy base – (recipe here)",
    "1/2 c. half & half",
    "milk, as needed",
    "1-2 tablespoons butter",
    "1 handful of fresh coriander (cilantro), chopped",
    "salt and pepper to taste"
  ],
  "keywords": [
    "chicken",
    "breast",
    "marinated",
    "recipe",
    "ghee",
    "sub",
    "veg",
    "oil",
    "garlic",
    "smashed",
    "ginger",
    "green",
    "cardamom",
    "pods",
    "cinnamon",
    "nutmeg",
    "cumin",
    "coriander",
    "turmeric",
    "fenugreek",
    "leaves",
    "leave",
    "garam",
    "masala",
    "tomato",
    "red",
    "chilli",
    "juice",
    "lemon",
    "curry",
    "gravy",
    "base",
    "milk",
    "needed",
    "butter",
    "cilantro",
    "salt",
    "pepper"
  ],
  "title": "Chicken Tikka Masala!",
  "users": [
    null
  ]
}