{
  "hash": "c3119ce57a01dbc88538fb64d96c0afdf66cfc10",
  "title": "garlic butter white wine shrimp linguine",
  "image": "http://cdn.pinchofyum.com/wp-content/uploads/Shrimp-Linguine-30.jpg",
  "href": "http://pinchofyum.com/garlic-butter-white-wine-shrimp-linguine",
  "extension": "",
  "firstAdded": "2017-07-13T22:12:03.624000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "For the pasta, heat two tablespoons butter in a large pot over high heat. Add two cloves of garlic and sauté, stirring constantly, for one minute. Add the broth and water; bring to a boil. Add the pasta and boil until the pasta is cooked. Lower the heat and simmer until most of the liquid is absorbed. Do not drain - there should be some liquid left in the pan to help coat the noodles.",
    "While the pasta is cooking, heat two tablespoons butter in a large skillet over medium heat. Add the shrimp and saute for 2-3 minutes on each side until the shrimp are cooked through and lightly browned on the outside.",
    "Add the white wine (you don’t necessarily have to measure - just eyeball a few good glugs), garlic, and sage and cover with a lid. Let the shrimp cook for another 3-5 minutes or until most of the wine has evaporated and the shrimp are lightly browned on the outside. Remove from heat and set aside. Keep the cover on so the shrimp stays warm.",
    "To finish, add the whipping cream, Parmesan, parsley, and the shrimp to the cooked pasta. Toss everything together and finish with a squeeze of lemon juice, salt, and pepper."
  ],
  "ingredients": [
    "0",
    "4 tablespoons butter, divided",
    "4 cloves garlic, minced, divided",
    "4 cups chicken or vegetable broth",
    "2 cups water",
    "1 lb. whole wheat linguine",
    "1½ lb. jumbo raw shrimp",
    "¾ cup Barefoot Pinot Grigio",
    "¼ cup minced fresh sage",
    "1 cup heavy whipping cream",
    "½ cup grated Parmesan cheese",
    "½ cup chopped fresh parsley",
    "1 lemon",
    "salt and pepper to taste"
  ],
  "__v": 1
}