{
  "hash": "95060be8e4e5cb9947054f198e51510c19521b3a",
  "title": "TURRÓN DE GUIRLACHE",
  "image": "http://4.bp.blogspot.com/-5QGrvcPPpak/VJy4kNYB0_I/AAAAAAAAJpE/lX4VRbQBNcQ/s640/IMG_5969.JPG",
  "href": "http://txelluisweet.blogspot.com/",
  "extension": "Chrome",
  "firstAdded": "2015-12-24T12:16:28.979000",
  "users": [
    null
  ],
  "keywords": [
    "ingredientes",
    "grde",
    "azcar",
    "medio",
    "limn",
    "cdade",
    "agua",
    "almendra",
    "marcona",
    "cruda"
  ],
  "directions": [
    "0",
    "DEC",
    "25",
    "TURRÓN DE GUIRLACHE",
    "En Catalunya y Comunidad Valenciana, mañana, día de San Esteban, también es festivo, supongo que en algún sitio más, pero disculpad la ignorancia..,",
    "¡¡Así que por mi tierra, mañana más!!",
    "Otro almuerzo familiar, más cocina, más cava y más turrones.",
    "Así que tanto para los que en San Esteban seguimos de celebración, como los que no, os presento esta sencilla receta: El Turrón de Guirlache",
    "Delicioso, uno de mis favoritos, por cierto, apto para celiacos, intolerantes a la lactosa y veganos.",
    "Ingredientes:",
    "250 gr.de azúcar",
    "Medio limón",
    "1 cda.de agua",
    "250 gr.de almendra marcona cruda",
    "Elaboración:",
    "Forrar un molde para plum cake con un papel sulfurizado. Reservar.",
    "En un cazo al fuego, echar el azúcar, un chorro de jugo de limón y el agua.",
    "La medida de zumo de limón, la hago a ojo, pero para que tengáis una referencia, exprimir medio limón mediano, apretujándolo con la mano, encima de un colador, para recoger las semillas.",
    "Dejar que el azúcar se funda por completo, quedará una crema blanquecina.",
    "Añadir las almendras e ir removiendo de forma constante, hasta que el azúcar caramelice.",
    "No debe quedar demasiado oscuro, amargaría.",
    "Echar esta mezcla en el molde, aplastar bien y dejar endurecer a temperatura ambiente.",
    "Guardaren sitio seco, por ejemplo, dentro de una caja de lata."
  ],
  "ingredients": [
    "0",
    "Ingredientes:",
    "250 gr.de azúcar",
    "Medio limón",
    "1 cda.de agua",
    "250 gr.de almendra marcona cruda"
  ],
  "__v": 1
}