{
  "hash": "a77cf620c99c779ef418a7ca456a2a494cde5a6b",
  "title": "Slow Simmered Black Eye Peas and Greens",
  "image": "https://www.budgetbytes.com/wp-content/uploads/2018/01/Slow-Simmered-Black-Eyed-Peas-and-Greens-V1.jpg",
  "href": "https://www.budgetbytes.com/slow-simmered-black-eyed-peas-greens/",
  "extension": "Firefox",
  "firstAdded": "2018-10-05T17:59:45.190000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "The night before, place the black eyed peas in a large bowl or container and fill with cool water (there should be at least three times as much water as peas). Allow the peas to soak overnight in the refrigerator.",
    "When you're ready to begin cooking, add the olive oil to a large pot. Dice the onion, mince the garlic, and slice the celery. Add the onion, garlic, and celery to the pot and sauté over medium heat until the onions are transparent.",
    "Drain the soaked peas in a colander and rinse them with cool water. Add the rinsed peas to the pot with the vegetables. Also add the oregano, smoked paprika, cayenne pepper, some freshly cracked pepper (about 20 cranks of a pepper mill), bay leaf, and vegetable broth. Stir to combine.",
    "Add a lid to the pot, turn the heat up to high, and bring the pot to a boil. Once it reaches a boil, turn the heat down to low, and allow it to simmer for 1 hour.",
    "After one hour of simmering, the black eyed peas should be tender. Add the greens to the pot and stir them in until wilted. Smash some of the peas against the side of the pot as you stir to help thicken the liquid.",
    "Turn the heat up to medium to bring the pot back up to a simmer, and allow the peas and greens to simmer for 30 minutes more, without a lid. After simmering for 30 minutes, the greens should be tender and the peas should have broken down further and thickened the liquid even more. Taste the peas and add salt to your liking (I added about 3/4 tsp, but the amount needed will depend on the salt content of your vegetable broth). Serve with crusty bread or over rice."
  ],
  "ingredients": [
    "0",
    "1 lb. black eyed peas (dry) $1.69",
    "2 Tbsp olive oil $0.26",
    "1 onion $0.32",
    "3 cloves garlic $0.24",
    "1/2 bunch celery $0.70",
    "1 tsp oregano $0.10",
    "1/2 Tbsp smoked paprika $0.15",
    "1/4 tsp cayenne pepper $0.02",
    "Freshly cracked pepper $0.05",
    "1 bay leaf $0.15",
    "6 cups vegetable broth $1.28",
    "12 oz. fresh greens* $2.00"
  ],
  "__v": 1
}