{
  "hash": "9d680f67b37ea87b717b8b00dd00c75d7de89f65",
  "title": "Polenta Fries",
  "image": "http://cdn.parenting.com/sites/parenting.com/files/styles/story_detail/public/polenta-fries_1.jpg?itok=noGVosEv",
  "href": "http://www.parenting.com/healthy-baked-polenta-fries",
  "firstAdded": "2014-12-31T15:09:42.465000",
  "users": [
    null
  ],
  "keywords": [
    "cooking",
    "spray",
    "water",
    "instant",
    "polenta",
    "milk",
    "parmesan",
    "cheese",
    "unsalted",
    "butter",
    "room",
    "kosher",
    "salt",
    "pepper",
    "ketchup",
    "favorite",
    "storebought"
  ],
  "directions": [
    "0",
    "Spray a large rimmed baking sheet with cooking spray and line the pan with parchment paper.",
    "In a heavy-bottomed saucepan, bring the water to a boil over high heat. Reduce the heat to a simmer and slowly add the polenta while whisking constantly. Cook, continuing to whisk, until the polenta has thickened, about 3 minutes. Remove from the heat. Add the milk, Parmesan, butter, 1 tbsp salt and 1/2 tsp pepper and stir with a wooden spoon until thoroughly incorporated and the polenta is smooth.",
    "Pour the polenta into the center of the prepared baking sheet. Using a rubber spatula, spread it toward one end of the pan, pushing it into the corners and then to the edges, covering about two-thirds of the pan in an even layer. Spray a second piece of parchment with cooking spray and gently press the coated side onto the polenta to level and smooth the surface. Let cool at room temperature until set, about 1 hour.",
    "Preheat the oven to 400°F (200°C). Remove the top sheet of parchment and cut the polenta into strips about 1/2 inch (12 mm) wide and 4 inches (10 cm) long. Using a spatula, transfer the strips to a clean rimmed baking sheet, spacing them about 1/2 inch (12 mm) apart. Spray the fries lightly with cooking spray and sprinkle with salt.",
    "Bake until the fries have developed a crust and the edges are golden, about 30 minutes. Let cool slightly, then serve with the ketchup."
  ],
  "ingredients": [
    "0",
    "Nonstick cooking spray",
    "2 qt (2 l) water",
    "2 1/4 cups (1 lb/500 g) instant polenta",
    "1 cup (8 fl oz/250 ml) whole milk",
    "1/2 cup (2 oz/60 g) grated Parmesan cheese",
    "3 tbsp unsalted butter, at room temperature",
    "Kosher salt and freshly ground pepper",
    "Ketchup, homemade (below) or your favorite store-bought, for serving"
  ],
  "__v": 1
}