{
  "hash": "75d6d5626681bc75061391e7a1ddce31b4032d9a",
  "title": "Raw Chocolate Covered Lemon Bombs",
  "image": "http://www.rawguru.com/images/stories/rapidrecipe/th/1858-raw-chocolate-covered-lemon-bombs1.jpg",
  "href": "http://www.rawguru.com/raw-food-recipes/raw-chocolate-covered-lemon-bombs.html.html",
  "extension": "Chrome",
  "firstAdded": "2015-06-17T13:15:30.226000",
  "users": [
    null
  ],
  "keywords": [
    "cashews",
    "soaked",
    "hours",
    "raw",
    "almond",
    "flour",
    "coconut",
    "himalayan",
    "pink",
    "salt",
    "agave",
    "nectar",
    "lemon",
    "juice",
    "vanilla",
    "zest"
  ],
  "directions": [
    "0",
    "Soak the cashews a few hours before starting the recipe. Once ready to use them be sure to drain and rinse them.",
    "In the food processor, fitted with the “S” blade, combine the almond flour, shredded coconut, coconut flour and salt. Process until everything is well incorporated.",
    "Add the cashews, agave, lemon juice, vanilla and zest. (Tip: Zest the lemon before you juice it) Process until it becomes a thick and cream-like batter.",
    "With a cookie scoop, scoop out the batter and level it off. Plop out onto the counter, roll into a ball shape and place in a baking pan. Slide into the fridge or freezer while you prepare the chocolate.",
    "Once the chocolate is made, dip the lemon bombs into it, rolling it around, making sure it is completely coated. Lift out and tap the fork handle gently on the edge of the bowl to knock off the excess chocolate.",
    "Place the lemon bomb on a piece of wax paper or teflex sheet. Sprinkle with shredded coconut and leave to harden.",
    "Store in an air-tight container in the fridge or on the counter top for 5-7 days."
  ],
  "ingredients": [
    "0",
    "2 cup cashews, soaked 2+ hours",
    "1 1/2 cups raw almond flour",
    "1 1/2 cups dried shredded coconut",
    "1/3 cup raw coconut flour",
    "1/4 tsp Himalayan pink salt",
    "3/4 cup raw agave nectar",
    "1/4 cup lemon Juice",
    "2 tsp vanilla extract",
    "2 Tbsp Lemon zest"
  ],
  "__v": 1
}