{
  "hash": "b3156b752bb40a77e32f408a2c9db4ecc72efa0e",
  "title": "Nina's Vegan Aquafaba Butter",
  "image": "http://plantepusherne.dk/wp-content/uploads/2015/07/image-200x300.jpg",
  "href": "http://plantepusherne.dk/vegan-aquafaba-butter/",
  "extension": "",
  "firstAdded": "2015-12-23T18:58:20.803000",
  "users": [
    null
  ],
  "keywords": [
    "tbs",
    "aquafaba",
    "yes",
    "chickpea",
    "water",
    "solid",
    "oil",
    "prefer",
    "cold",
    "pressed",
    "coconut",
    "refined",
    "make",
    "buttery",
    "mlrapeseed",
    "canola",
    "olive",
    "similar",
    "try",
    "blend",
    "apple",
    "cider",
    "vinegar",
    "squeezed",
    "lemon",
    "juice",
    "lactic",
    "acid",
    "salt"
  ],
  "directions": [
    "0",
    "Let the coconut oil melt gently until it's almost all liquid. Remove the pan from the heat and let the rest melt. Add your rapeseed or other preferred oil. Let the oil mixture cool to room temperature.",
    "Pour the (just under room temperature cold) aquafaba in a narrow container with the salt and vinegar. Start blending it with an immersion blender/stick blender.",
    "With the blender running, slowly pour the oils in, all while making sure all oil thoroughly incorporated before you add more. It should take a couple of minutes to add all the oil and achieve a thick mayo like consistancy. (If you live in a hot area I suggest you place the container on a bag of frozen peas when pouring in the oil, to help the process along)",
    "IF you taste test it, know that it will taste pretty salty and tangy. This will be numbed a bit when it has chilled and remember, that you normally eat butter WITH something and not on it's own (right?) so it will be easier to make final judgements when spreading it on toast...mmm...",
    "Pour it in a suitable container - DO NOT COVER IT - and put it in the fridge (or maybe a short while in freezer if you're in a hurry). It will take some hours for the butter to solidify, I recommend leaving it one night in the fridge.Store it in the fridge, especially if you live in a hot area. Depending on what blend of oils you used (unrefined coconut is softer then the refined one) you should be able to spread it directly from the fridge. Leave it on the counter for 15 minutes to make it even softer."
  ],
  "ingredients": [
    "0",
    "3 tbs (45 ml) Aquafaba (yes, it's chickpea water)",
    "1/3 C + 1 tbs (1 dl) Solid coconut oil (I prefer the cold pressed but you can taste the coconut. Refined will make the taste VERY buttery)",
    "1tbs + 1tsp (20 ml)Rapeseed, canola or olive oil or a similar oil that you like the taste of. Or try a blend!",
    "2/3 tsp Apple cider vinegar or freshly squeezed lemon juice (or if you have, ⅛ tsp of lactic acid)",
    "1/3 tsp salt"
  ],
  "__v": 1
}