{
  "hash": "632fa4da1405c2dc8be4db282b5705ca2fb8d08b",
  "title": "Cilantro Lime Rice Bowl Recipe",
  "image": "http://images.foodfanatic.com/iu/s--HDA6PhBM--/t_medium/f_auto,fl_lossy,q_75/v1407517870/cilantro-lime-rice-bowl-photo.jpg",
  "href": "http://www.foodfanatic.com/recipes/cilantro-lime-rice-bowl-recipe/",
  "extension": "Chrome",
  "firstAdded": "2015-07-12T15:22:16.096000",
  "users": [
    null
  ],
  "keywords": [
    "organic",
    "garlic",
    "herb",
    "rice",
    "black",
    "beans",
    "thoroughly",
    "rinsed",
    "frozen",
    "corn",
    "onions",
    "white",
    "pale",
    "green",
    "parts",
    "cilantro",
    "tomatoes",
    "jalapeo",
    "seeded",
    "sunflower",
    "canola",
    "oil",
    "limes",
    "squeezed",
    "honey",
    "agave",
    "cumin",
    "avocado",
    "tortilla",
    "chips",
    "salt"
  ],
  "directions": [
    "0",
    "Directions",
    "Prepare rice (either in microwave or on stovetop) according to package directions.",
    "Combine black beans and corn with a teaspoon of oil in a small skillet and cook over medium heat until heated through (or combine black beans and corn in a heat-safe bowl and warm in the microwave until heated through).",
    "Meanwhile, prepare the salsa. Set aside 1 tablespoon green onion and 1 tablespoon cilantro.",
    "Using all of the remaining green onion and cilantro, stir and combine with the diced tomato and jalapeño.",
    "Next, prepare the cilantro-lime dressing. In a small mixing bowl, add the oil, juice from two limes, honey, ground cumin, and garlic powder. Add 1 tablespoon green onion and 1 tablespoon cilantro. Season thoroughly with salt and whisk until well combined.",
    "Peel the avocado, remove the pit, and thinly slice it. Pour the juice of the last remaining lime all over the avocado to keep it from browning.",
    "Arrange equal portions of rice, black beans and corn, and salsa in six serving bowls. Add 3-4 thin slices of avocado to each bowl. Drizzle cilantro-lime dressing all over everything.",
    "Top off each bowl with a few crushed tortilla chips. Serve."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "6 ounces organic garlic & herb rice package",
    "1 15 oz can black beans, drained and thoroughly rinsed",
    "2/3 cup organic frozen sweet corn",
    "1/3 cup green onions, chopped, white and pale green parts",
    "3 tablespoons fresh cilantro, chopped",
    "2 large tomatoes, diced",
    "1/2 jalapeño, seeded and finely diced",
    "6 tablespoons sunflower oil, (or substitute canola oil)",
    "3 limes, freshly squeezed",
    "1 1/2 teaspoons organic honey, (or substitute agave)",
    "1/2 teaspoon ground cumin",
    "1/2 teaspoon garlic powder",
    "1 avocado",
    "2 ounces tortilla chips",
    "salt"
  ],
  "__v": 1
}