{
  "hash": "a48f2dcede4334b966a0c926a7e700f41c6311d0",
  "title": "Mac and cheese",
  "image": "https://coop.no/globalassets/extra/mat--trender/mac-and-cheese-2-1200.jpg?preset=Large",
  "href": "https://coop.no/extra/mat--trender/den-amerikanske-klassikeren-absolutt-alle-elsker/",
  "extension": "Chrome",
  "firstAdded": "2015-12-03T00:19:15.279000",
  "users": [
    null
  ],
  "keywords": [
    "trenger",
    "personer",
    "gram",
    "makaroni",
    "smr",
    "mel",
    "melk",
    "paprikapulver",
    "chilipulver",
    "bbqsaus",
    "revet",
    "cheddar",
    "litt",
    "salt",
    "pakke",
    "bacon",
    "cirka",
    "brunt",
    "sukker",
    "vann"
  ],
  "directions": [
    "0",
    "SLIK GJØR DU:",
    "Forvarm ovnen på 200 grader. Sett frem en rist med bakepapir og smør litt olje på bakepapiret.",
    "Hell vannet i en skål, og brunt sukker på en tallerken. Skjær baconbitene i to. Dypp baconskivene i vann før du ruller dem i sukker på begge sider. Legg baconskivene på risten.",
    "Stek baconet i 8 minutter i ovnen før du snur baconet. La baconskivene steke videre i cirka 5 minutter til. Følg nøye med, for baconet kan brenne seg fortere enn du aner. Når baconet er ferdig skal det settes til avkjøling frem til makaronien er klar.",
    "Kok makaroni etter anvisning på pakken. Hell av kokevannet og sett til side. Smelt smør på middels varme i en passende gryte. Ha i melet og sørg for å røre slik at alt fordeler seg. Ha i 2,5 dl melk etter blandingen har fått koke i et par minutter, og rør godt. Tilsett så 2,5 dl melk til når melken er rørt godt inn i den hvite sausen. Ha i paprikakrydder, chilikrydder, revet cheddar og BBQ-saus når sausen har tyknet. Ha makaroni i helt til slutt, rør godt sammen og strø over bacon og revet ost."
  ],
  "ingredients": [
    "0",
    "DU TRENGER (3-4 PERSONER):",
    "700 gram makaroni",
    "3 ss smør",
    "3 ss mel",
    "5 dl melk",
    "2-3 ss paprikapulver",
    "1 ts chilipulver",
    "3-4 ss BBQ-saus",
    "200-300 gram revet cheddar",
    "Litt salt",
    "1 pakke bacon",
    "Cirka 2 dl brunt sukker",
    "2-3 dl vann"
  ],
  "__v": 1
}