{
  "hash": "bf606f7255ab8a635ef9cbee01a7b42a7ab89188",
  "title": "Chickpea Shawarma Sandwich",
  "image": "https://mbkr-minimalistbaker.netdna-ssl.com/wp-content/uploads/2015/08/AMAZING-30-minute-HEALTHY-Chickpea-Shawarma-Wraps-with-a-simple-Garlic-Dill-Sauce-An-easy-weeknight-vegan-plantbased-meal-healthy-recipe-mediterranean-minimalistbaker.jpg",
  "href": "https://minimalistbaker.com/chickpea-shawarma-sandwich/",
  "extension": "",
  "firstAdded": "2017-07-13T22:22:25.381000",
  "users": [
    null,
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400 degrees F (204 C) and line a large baking sheet with foil or parchment paper.",
    "In a small mixing bowl toss rinsed and dried chickpeas with oil and spices and spread on baking sheet. Bake for 25 minutes or until slightly crispy and golden brown. Once slightly cooled, sample and adjust seasonings as desired (I added a bit more sea salt, cumin and garlic powder for extra flavor).",
    "While the chickpeas are roasting, prepare your sauce by adding hummus, lemon juice, dill and garlic to a mixing bowl and whisking to combine. Add enough water or almond milk to thin so it’s pourable (~2-3 Tbsp).",
    "Taste and adjust seasonings as needed. Add more garlic for more zing, salt for savoriness, lemon juice for freshness, and dill for a more intense herb flavor. I found mine didn’t need anything else.",
    "To serve, warm pitas or flatbread in the microwave for 15 -30 seconds (or the still warm oven for 1 minute) and top with desired amount of chickpeas, sauce, and vegetables of choice.",
    "Best when fresh, though leftover chickpeas and sauce will keep well stored separately in the refrigerator for 3-4 days."
  ],
  "ingredients": [
    "0",
    "1 15-ounce (425 g) can chickpeas, rinsed, drained and patted dry",
    "1 Tbsp (15 ml) grape seed or avocado oil",
    "1 tsp each cumin and garlic powder",
    "1/2 tsp each sea salt, black pepper, and smoked (or regular) paprika",
    "1/4 tsp each ground coriander and cinnamon",
    "1",
    "1/4 cup (60 g) hummus (or tahini*)",
    "juice of 1/2 lemon (~1 Tbsp)",
    "3/4 - 1 tsp dried dill (or sub 2-3 tsp fresh)",
    "3 cloves garlic, minced",
    "2-3 Tbsp (30-45 ml) water or unsweetened almond milk to thin",
    "optional: Sea salt to taste (I didn’t need any)",
    "2",
    "optional: Vegan pita or flatbread",
    "Sliced tomato",
    "Sliced red onion",
    "Romaine lettuce or fresh parsley, chopped",
    "optional: Chili garlic sauce (I like this one)"
  ],
  "__v": 2
}