{
  "hash": "00ef78fb8c0707442096bc03e7ba9b3f4dffda08",
  "title": "Baked Sourdough Donuts",
  "image": "https://practical-stewardship.com/wp-content/uploads/2012/10/Sourdough-Donuts.jpg",
  "href": "https://practical-stewardship.com/2012/10/10/baked-sourdough-donuts-recipe/",
  "extension": "Firefox",
  "firstAdded": "2019-07-15T00:07:20.673000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "The night before you bake the donuts, combine starter, maple syrup or honey, water, flour, milk and olive oil in a bowl, mixing well.",
    "Cover with plastic wrap, and leave the batter out at room temperature overnight. You can leave it out up to 24 hours.",
    "Preheat oven to 375 degrees when you are ready bake.",
    "Mix in egg, salt, baking powder, nutmeg, cinnamon and vanilla to the sourdough batter. This works best with an electric mixer.",
    "Spoon batter into a greased donut pan, filling each mold 3/4 of the way. The batter may be a bit stretchy.",
    "Bake for 20-22 minutes in a standard pan or 9 minutes in a mini donut pan.",
    "Donuts are done when they are a golden brown.",
    "Top with your favorite glaze (recipe below), chocolate frosting, roll in cinnamon and organic sugar, or eat them plain. If you want to try making your own sprinkles, see Chocolate Covered Katie's recipe."
  ],
  "ingredients": [
    "0",
    "Day 1 (the night before): 1/2 cup sourdough starter",
    "1/3 cup maple syrup for vegan or honey",
    "1/3 water",
    "1 1/2 cup white whole wheat flour I love Trader Joe's Brand",
    "1 cup non-dairy for vegan or dairy milk (I've used almond milk and regular milk before)",
    "1/3 cup extra-virgin olive oil or melted coconut oil",
    "Day 2 (the day of baking): 1 cage free egg or 1 T ground flax seed mixed with 3 T water for vegan",
    "2 t baking powder",
    "1 t vanilla extract",
    "1/2 t salt",
    "3/4 t freshly grated nutmeg optional",
    "1/2 t cinnamon optional"
  ],
  "__v": 2
}