{
  "hash": "39ab4404ea93d9fad1a6c5138300695b0d28e272",
  "title": "Greek Yogurt Turkish Flatbread (Bazlama)",
  "image": "https://thecafesucrefarine.com/wp-content/uploads/Greek-Yogurt-Turkish-Flatbread-Bazlama.jpg",
  "href": "https://thecafesucrefarine.com/greek-yogurt-turkish-flatbread-bazlama/",
  "extension": "Chrome",
  "firstAdded": "2018-08-25T22:57:01.214000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Combine the yeast, sugar, and water into a medium-large bowl and stir well. Allow to sit in a warm place for 5-10 minutes to activate the yeast. The mixture will be foamy and bubbly when activated.",
    "Whisk in the Greek yogurt olive oil and salt.",
    "Add flour and parley and stir with a wooden spoon or sturdy spatula and until the dough comes together. Turn dough out onto a well-floured counter and turn to coat. Knead for 3-4 minutes or until dough is no longer sticky and springs back when lightly pressed. Sprinkle more flour onto the counter if the dough is sticky during kneading.",
    "Divide dough into 10 equal pieces, sprinkle lightly with flour, then cover with a clean kitchen towel. Allow to rest for 15 minutes.",
    "Preheat a medium saucepan to a medium-low heat. While pan is heating, roll one of the dough portions into an approximately 7-inch circle. Brush the top surface lightly with extra virgin olive oil. When the pan is hot, pick up the first circle with your hand and place in pan, oiled side down. Lightly brush the top surface with oil. Allow to the flatbread to cook for about 1 to 1 1/2 minutes, until top surface is covered with bubbles and underside is golden around the edges and in spots.",
    "Flip to opposite side and cook for another 60-90 seconds until a few small golden spots appear. Don't overcook on the second side. Repeat rolling, oiling and cooking with remaining portions of dough.",
    "Sprinkle flatbreads with a bit more chopped parsley when finished, if desired. Stack flatbreads in a clean kitchen towel after cooking to steam a bit and retain softness.",
    "When cool, store in a ziplock bag. Reheat in a pan without oil for a minute or two on each side OR wrap flatbreads in paper toweling and heat in the microwave on low power until warm.",
    "Recipe Notes",
    "See Café Tips above in post for further instructions and tips.",
    "Adapted from Allrecipes."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 ¼ cups warm water 105-110˚F",
    "2 ¼ teaspoons active dried yeast 1 packet",
    "1 tablespoon sugar",
    "¾ cup Greek-style yogurt",
    "2 tablespoon extra virgin olive oil",
    "1 tablespoon kosher salt",
    "3 ¾ cups all-purpose flour",
    "¼ cup finely chopped flat leaf parsley"
  ],
  "__v": 1
}