{
  "hash": "912e517605e75fa004f90b4dc5392e195914a80d",
  "title": "Homemade Thin Mint Cookies",
  "image": "https://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2016/03/homemade-thin-mints-cookies-2.jpg",
  "href": "https://sallysbakingaddiction.com/2016/03/09/homemade-thin-mint-cookies/",
  "extension": "Chrome",
  "firstAdded": "2018-10-09T17:12:15.912000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the cookies: In a large bowl using a hand-held mixer or stand mixer fitted with a paddle attachment, beat the butter for 1 minute on medium speed until completely smooth and creamy. Add the granulated sugar and beat on medium high speed until fluffy and light in color. Beat in the egg, vanilla extract, and peppermint extract on high speed. Scrape down the sides and bottom of the bowl as needed.",
    "Sift the flour and cocoa powder together in a medium bowl. Whisk in the baking powder and salt until combined. On low speed, slowly mix into the wet ingredients until combined.",
    "Divide the dough into 2 equal parts. Roll each portion out onto a piece of parchment to about 1/4″ thickness. Stack the pieces (with parchment paper between) onto a baking sheet and refrigerate for at least 1 hour. Chilling is mandatory. If chilling for more than a couple hours, cover the top dough piece with a single piece of parchment paper. You can chill up to 2 days.",
    "Once chilled, preheat oven to 350°F (177°C). Line 2-3 large baking sheets with parchment paper or silicone baking mats. Remove one of the dough pieces from the refrigerator and using a 2-inch round cookie cutter, cut in circles. Transfer the cut cookie dough to the prepared baking sheet. Re-roll the remaining dough and continue cutting until all is used.",
    "Bake for 8 minutes-- the cookies will still appear soft. Make sure you rotate the baking sheet halfway through bake time. Allow to cool on baking sheet for 5 minutes, then transfer to a wire rack to cool completely before dipping in chocolate.",
    "Once the cookies are cool, begin the topping: Melt the chopped chocolate and oil together in a double boiler or (carefully!) use the microwave. For the microwave, place the chocolate and oil in a medium heat-proof bowl. Melt in 15 second increments, stirring after each increment until completely melted and smooth. Once melted, stir in the peppermint extract. Dip each cooled cookie completely into the chocolate and use a fork to lift out. Tap the fork gently on the side of the bowl to allow excess chocolate to drip off. Place cookie onto a parchment or silicone baking mat-lined baking sheet. Place the baking sheet into the refrigerator to help the chocolate set. Once set, enjoy! The cookies are best cold. I love eaten straight from the freezer!"
  ],
  "ingredients": [
    "0",
    "3/4 cup (172g) unsalted butter, softened to room temperature",
    "1 cup (200g) granulated sugar",
    "1 large Eggland's Best egg, at room temperature",
    "1 teaspoon pure vanilla extract",
    "1/4 teaspoon peppermint extract1",
    "1 and 1/2 cups (188g) all-purpose flour (spoon & leveled)",
    "3/4 cup (63g) unsweetened natural cocoa powder (or dutch process)",
    "1 teaspoon baking powder",
    "1/8 teaspoon salt"
  ],
  "__v": 1
}