{
  "__v": 1,
  "directions": [
    "0",
    "Portare a bollore abbondante acqua per la pasta.",
    "Tuffare 50 g di noci nell'acqua bollente per 30 secondi poi scolarle e strofinarle per togliere la buccia. In un mortaio pestare l'aglio e un po' di sale grosso con le noci bagnate e i gherigli asciutti (tenendone da parte per servire). Aggiungere poi la mollica di pane e il latte fermentate sempre schiacciando. Infine aggiungere l'olio e la maggiorana. Si deve ottenere una salsa un po' grossolana tipo pesto.",
    "Cuocere la pasta il tempo indicato mescolando di tanto in tanto. Un minuto prima di scolarla prelevare 2 cucchiai d'acqua di cottura e diluire la salsa.",
    "Scolare la pasta (con unpo' d'acqua) e condirla subito con la salsa mescolando rapidamente. Servire subito con i gherigli rimasti (e un po' di formaggio grana se piace)."
  ],
  "firstAdded": "2014-10-09T19:31:47.302000",
  "hash": "9897159be43006d21b9bd5f241916823e69ee861",
  "href": "http://www.undejeunerdesoleil.com/2013/02/linguine-sauce-noix-Ligurie-salsa-noci-recette.html",
  "image": "http://3.bp.blogspot.com/-Kh4-ZBBSHzQ/UREgSSF-d4I/AAAAAAAABFA/YQ_9dNWs0gM/s1600/Linguine_noix.jpg",
  "ingredients": [
    "0",
    "Linguine con salsa alle noci (per 4 persone)",
    "400 g di linguine",
    "120 g di gherigli di noci",
    "30-40 g di mollica di pane un po' bagnata (meglio se consistente)",
    "40 g di ricotta molto morbida o di latte fermentato (ci vorrebbe la prescinsôea, latte cagliato)",
    "30 g circa d'olio extra vergine d'oliva (Ligure ;-)",
    "½ spicchio d'aglio",
    "sale, pepe e maggiorana"
  ],
  "keywords": [
    "linguine",
    "salsa",
    "alle",
    "noci",
    "persone",
    "gherigli",
    "mollica",
    "pane",
    "bagnata",
    "meglio",
    "consistente",
    "ricotta",
    "molto",
    "morbida",
    "fermentato",
    "vorrebbe",
    "prescinsea",
    "latte",
    "cagliato",
    "circa",
    "dolio",
    "extra",
    "vergine",
    "doliva",
    "ligure",
    "spicchio",
    "daglio",
    "sale",
    "pepe",
    "maggiorana"
  ],
  "title": "salsa alle noci",
  "users": [
    null
  ]
}