{
  "hash": "8b7d17c79248d13d084be59bc0d2cf0c87e8af1b",
  "title": "Teriyaki Chicken, Broccoli & Rice",
  "image": "https://www.ninjakitchen.com/include/images/recipes/steps/recipeStep_101351_8_32.jpg",
  "href": "https://www.ninjakitchen.com/recipes/search/0/all/101351/teriyaki-chicken-broccoli-and-rice/",
  "extension": "Chrome",
  "firstAdded": "2019-07-28T19:15:55.787000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Approx. pressure build: 8 minutes",
    "Pressure cook: 2 minutes",
    "Pressure release: 10 minutes",
    "Broil: 12 minutes",
    "Place rice, chicken stock, frozen vegetables, 1 teaspoon salt, 1 teaspoon pepper, and Adobo seasoning into the pot stir to combine.",
    "Place chicken breasts on reversible rack, making sure rack is in the higher position. Place rack inside pot over rice mixture.",
    "Assemble pressure lid, making sure the pressure release valve is in the SEAL position. Select PRESSURE and set to high (HI). Set time to 2 minutes. Select START/STOP to begin.",
    "While chicken and rice are cooking, toss broccoli in a bowl with the olive oil and remaining salt and pepper.",
    "When pressure cooking is complete, allow pressure to natural release for 10 minutes. After 10 minutes, quick release any remaining pressure by turning the pressure release valve to the VENT position. Carefully remove lid when unit has finished releasing pressure.",
    "Brush tops of chicken breasts liberally with teriyaki sauce. Add broccoli to rack around chicken.",
    "Close crisping lid. Select BROIL and set time to 12 minutes. Select START/STOP to begin.",
    "Cooking is complete when internal temperature of chicken reaches 165°F. Serve chicken with rice and broccoli."
  ],
  "ingredients": [
    "0",
    "1 cup long-grain white rice rinsed",
    "1 cup chicken stock",
    "1/2 cup frozen mixed vegetables",
    "2 teaspoons kosher salt, divided",
    "2 teaspoons ground black pepper, divided",
    "1 tablespoon Adobo seasoning",
    "2 uncooked fresh boneless skinless chicken breasts (8 ounces each)",
    "1 head broccoli, cut in 2-inch florets",
    "1 tablespoon extra virgin olive oil",
    "1/4 cup teriyaki sauce"
  ],
  "__v": 1
}