{
  "hash": "a8a4e1aea02b63c07ce442d5414546f3323bc502",
  "title": "Eggplant Ragoût with Tomatoes, Peppers & Chickpeas",
  "image": "http://www.finecooking.com/CMS/uploadedImages/Images/Cooking/articles/issues_41-50/fc47ma068-01_xlg.jpg",
  "href": "http://www.finecooking.com/recipes/eggplant_ragout.aspx",
  "extension": "",
  "firstAdded": "2016-09-13T13:44:45.572000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the broiler. Cut the eggplant crosswise into 3/4-inch rounds and brush both sides with olive oil. Broil until light gold on each side, about 2 min. per side. Let cool and cut into 1-inch pieces. In a medium Dutch oven, heat the 2 Tbs. olive oil over medium-high heat. Add the onion and bell pepper; sauté until the onion is lightly browned, 12 to 15 min. During the last few minutes of browning, add the garlic, paprika, cumin, and cayenne. Stir in the tomato paste and cook, stirring, for 1 min. Stir in 1/4 cup of the water and boil, using a wooden spoon to scrape up the juices from the bottom of the pan. Add the tomatoes, eggplant, chickpeas, remaining 1 cup water and salt. Bring to a boil and then simmer, covered, until the vegetables are quite tender, about 25 min., stirring once or twice. Stir in the parsley, adjust the seasonings, and serve."
  ],
  "ingredients": [
    "0",
    "1-1/2 lb. eggplant, preferably plump round fruits",
    "2 Tbs. olive oil; more for brushing the eggplant",
    "1 large red onion, cut into 1/2-inch dice",
    "1 large bell pepper, red or yellow, cored, seeded, and cut into 1-inch pieces",
    "2 plump cloves garlic, thinly sliced",
    "2 tsp. paprika",
    "1 tsp. ground cumin",
    "Generous pinch cayenne",
    "2 Tbs. tomato paste",
    "1-1/4 cups water",
    "5 plum tomatoes, peeled, quartered lengthwise, and seeded",
    "15-oz. can chickpeas (preferably organic), rinsed and drained",
    "1 tsp. salt; more to taste",
    "1/4 cup coarsely chopped fresh flat-leaf parsley",
    "Freshly ground black pepper to taste"
  ],
  "__v": 1
}