{
  "hash": "d9772bf30a90c33d518c871b730de3b50d6b814f",
  "title": "Crazy Cheese & Bacon Scrolls",
  "image": "https://images.notquitenigella.com/images/cheese-bacon-scrolls/__cheese-bacon-scrolls-11.jpg",
  "href": "https://www.notquitenigella.com/2019/07/01/cheese-bacon-scrolls-rolls/?utm_source=newsletter&utm_medium=email&utm_content=2019-06-30&utm_campaign=newsletter",
  "extension": "Chrome",
  "firstAdded": "2019-07-04T22:23:01.700000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make a roux by whisking the 15g of flour and 65ml milk together until smooth. Heat on medium heat and whisk while it thickens to a roux and reaches 65C/149F. Whisk in the butter until smooth and cool until the mix is lukewarm.",
    "Step 2 - In the bowl of an electric mixer mix the remaining flour, milk, sugar and yeast with a spatula until combined. Add in the roux and mix again and then use a dough hook and knead until you get the window pane effect where you can pull apart the dough with your finger and it doesn't break and you can see through it.",
    "Start of the window pane effect",
    "Step 3 - Shape into a ball and cover with a lid (I use a metal pizza plate) and put in a warm place. I place it in a bowl of hot water changing the water when it gets cold. Allow to rise until double or triple the size (around 1 hour). Punch down and knead in the salt.",
    "Folding into a business letter",
    "Step 4 - Preheat oven to 205C/400F and line a tray with baking paper. Lightly flour a large surface and roll out the dough to around 35x35cms/14x14inches. Cover with bacon, cheese and spring onions and then fold in three like a business letter.",
    "Rolling out the filled dough",
    "Step 5 - Roll out again careful not to break the dough until it measures around 30cms/12inches in height and around 16cms/6.4inches wide. Cut into 8 strips and then take each strips and twist. Tuck in the end underneath and then turn the scroll over. Don't worry about any bacon or cheese that falls out.",
    "Step 6 - Repeat with the remainder of the strips and sprinkle any loose bits of bacon, cheese or onion on top of the scrolls. Brush with beaten egg. Allow to rise for 20 minutes, then bake for 15 minutes. Serve warm and with a warning that these are absolutely heavenly soon out of the oven!"
  ],
  "ingredients": [
    "0",
    "15g/0.5oz. bread flour",
    "65ml/2.3flozs. milk",
    "15g/0.5oz. butter",
    "265g/9.4ozs. bread flour plus extra for rolling",
    "85ml/3flozs. milk",
    "20g/0.7ozs. sugar",
    "1 teaspoon instant dried yeast",
    "1 teaspoon salt",
    "200g/7ozs. bacon, finely diced",
    "2 cups grated tasty cheese",
    "2/3 cup chopped spring onions",
    "Beaten egg for eggwash"
  ],
  "__v": 1
}