{
  "hash": "2a6c4841a736afd07cd5b385c534e8f5bf26abdb",
  "title": "Cinnamon Burst Bread",
  "image": "",
  "href": "http://everydayfoodstorage.net/2009/09/10/fanatic-friday-cinnamon-burst-bread-like-great-harvests/food-storage-recipes",
  "extension": "Firefox",
  "firstAdded": "2015-10-14T03:11:56.951000",
  "users": [
    null
  ],
  "keywords": [
    "yeast",
    "sugar",
    "eggs",
    "lightly",
    "crystal",
    "dry",
    "egg",
    "water",
    "salt",
    "oil",
    "bites",
    "available",
    "health",
    "food",
    "stores",
    "compacted",
    "bits",
    "cinnamon",
    "great",
    "recipe",
    "disguise",
    "flour",
    "allpurpose",
    "really",
    "gutsy",
    "try",
    "wheat"
  ],
  "directions": [
    "0",
    "Combine in mixing bowl 4 cups flour, yeast, and sugar. Add water, eggs, and oil. Beat well to “cake batter” stage. Stir in salt, cinnamon bites, and 7 more cups flour to make bread-dough consistency. Let mixer knead it to the right texture (add up to 1 more cup flour if needed). Place dough in greased bowl, cover, and let rise for 1 hour. Shape dough into 4 loaves. Let rise for another hour or until doubled. Bake at 375 degrees for about 30 minutes. Slice thick and serve warm with butter, or toast slices in the toaster (be careful, the cinnamon bites can burn your fingers), or make slices into French Toast. Yummy!",
    "Teresa says-Here’s a picture of the four loaves I made last week. We ate one loaf for breakfast the next day, I gave one loaf away to a friend, and I froze the other two loaves to take to my Sister’s Weekend. They thawed beautifully and tasted fresh and wonderful this weekend!"
  ],
  "ingredients": [
    "0",
    "3 T. yeast",
    "1/2 cup sugar",
    "4 eggs, beaten lightly (*Note from Crystal, 1/4 C. Dry Egg Powder +1/2 C. Water)",
    "3 3/4 cup warm water",
    "4 1/2 tsp. salt",
    "3 T. vegetable oil",
    "2 1/2 cups cinnamon bites (available at health food stores, these are like compacted bits of cinnamon or here)",
    "11-12 cups flour (*Note from Crystal, this is a great recipe to disguise wheat in! Try it at least half whole wheat flour and half all-purpose or get really gutsy and try it 100% whole wheat!)"
  ],
  "__v": 1
}