{
  "hash": "fd6b6d6ce5ef3df50045ddac06f1a400a731bc2d",
  "title": "Applebee's Crispy Orange Chicken Bowl",
  "image": "http://www.topsecretrecipes.com/images/T/xctmpyB51GC.png",
  "href": "http://www.topsecretrecipes.com/Applebees-Crispy-Orange-Chicken-Bowl-Copycat-Recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-09-30T14:34:37.305000",
  "users": [
    null
  ],
  "keywords": [
    "spicy",
    "orange",
    "juice",
    "light",
    "brown",
    "sugar",
    "marmalade",
    "soy",
    "oil",
    "parsley",
    "chili",
    "garlic",
    "thyme",
    "rice",
    "vinegar",
    "almond",
    "pilaf",
    "butter",
    "uncooked",
    "converted",
    "chicken",
    "broth",
    "salt",
    "slivered",
    "almonds",
    "celery",
    "onion",
    "breaded",
    "fingers",
    "baked",
    "approx",
    "strips",
    "broccoli",
    "florets",
    "red",
    "bell",
    "pepper",
    "mushrooms",
    "snap",
    "peas",
    "carrot",
    "crispy",
    "chow",
    "mein",
    "noodles"
  ],
  "directions": [
    "0",
    "Make the spicy orange sauce by combining all ingredients, except vinegar, in a medium saucepan. Simmer over medium/low heat for 15 minutes or until thick. Remove sauce from heat and add vinegar.",
    "Make rice pilaf by melting 2 tablespoons butter over medium heat in a medium saucepan. Be sure to use a saucepan with a lid. Add 1 cup uncooked converted rice and saute rice for 2 to 4 minutes in the butter or until some of the rice begins to turn light brown. As the rice is cooking heat chicken stock on high in microwave for 3 to 4 minutes or until the stock begins to bubble. When the rice begins to brown, quickly add the hot stock and salt to the pan. Cover the pan, reduce heat to low and simmer rice for 20 minutes. As the rice cooks, melt remaining 1 tablespoon butter in a medium skillet over medium heat. Add almonds and saute for 1 to 2 minutes or until the almonds begin to brown. Add celery and onions and saute for another couple of minutes or until the onion begins to turn translucent. When the rice has cooked for 20 minutes, remove it from the heat. Add almonds, celery, onion and parsley to the rice, then let it sit, covered, for 5 minutes or until the remaining liquid is absorbed.",
    "If you haven't already baked your chicken fingers, now's the time to cook them following the directions on the package.",
    "Steam the broccoli, red bell pepper, mushrooms, sugar snap peas, and carrot in a steamer basket in a covered saucepan over simmering water for 10 minutes or until the broccoli is tender. Salt and pepper the veggies.",
    "Prepare each dish by spooning 2 cups of the rice pilaf into two large bowls. Divide the steamed vegetables in half and spoon them over the rice. Cut each of the chicken fingers in half and slide them into a large bowl. Pour the orange sauce over the chicken and toss. Spoon the chicken and sauce onto the veggies in each bowl. Sprinkle 1/4 cup of chow mein noodles over each dish, followed by about 2 tablespoons of almonds, and serve.",
    "Serves 2."
  ],
  "ingredients": [
    "0",
    "Spicy Orange Sauce",
    "1 cup orange juice",
    "1/2 cup light brown sugar",
    "3 tablespoons orange marmalade",
    "2 tablespoons soy sauce",
    "1 tablespoon vegetable oil",
    "1/2 teaspoon minced parsley",
    "1/4 teaspoon chili flakes",
    "1/4 teaspoon minced garlic",
    "1/8 teaspoon dried thyme",
    "1 tablespoon rice vinegar",
    "Almond Rice Pilaf",
    "3 tablespoons butter",
    "1 cup uncooked converted rice",
    "2 1/4 cups chicken broth",
    "1/8 teaspoon salt",
    "1/3 cup sliced or slivered almonds",
    "1/4 cup diced celery",
    "1/4 cup diced onion",
    "1 teaspoon minced parsley",
    "20 ounces breaded chicken fingers, baked (approx. 12 strips)",
    "1 1/2 cups broccoli florets",
    "1 cup sliced red bell pepper",
    "1 cup sliced mushrooms",
    "3/4 cup sugar snap peas",
    "1/4 cup shredded carrot",
    "1/2 cup crispy chow mein noodles",
    "1/4 cup sliced or slivered almonds"
  ],
  "__v": 1
}