{
  "__v": 1,
  "directions": [
    "0",
    "Preheat the oven to 425 degrees Fahrenheit with the rack at the highest position. In a mortar and pestle or with a spice grinder, grind the spices into a coarse dust.",
    "Core the cauliflower and slice into irregular wedges and slices. Transfer to baking sheet lined with parchment, add chickpeas, spices, torn up chiles de arbol, a generous pinch of salt and pepper and a couple glugs of olive oil. Toss with hands until everything is coated in oil.",
    "Roast cauliflower in the oven for about 20 minutes, using tongs and tossing the cauliflower half-way so both sides brown. Blast them under the broiler for a couple minutes more at the end if you want more browning.",
    "While you wait for the cauliflower to roast, make the yogurt sauce by combining the yogurt, cilantro, garlic, and a small pinch of salt. Add just a tiny splash of water to thin out the yogurt to the consistency of your liking and mix. Personally, I like it just a little bit runny so I add a couple splashes of water.",
    "Plate cauliflower and dollop yogurt over the vegetables.",
    "Enjoy!"
  ],
  "firstAdded": "2014-07-28T19:26:40.910000",
  "hash": "fcc61b4bc935c2e3b9e9c55938653553a039ac7b",
  "href": "http://honestlyyum.com/9358/spicy-roast-cauliflower-and-chickpeas/",
  "image": "http://cdn.honestlyyum.com/wp-content/uploads/2014/03/Roast-cauliflower.jpg",
  "ingredients": [
    "0",
    "1 head of cauliflower",
    "1 15-ounce can of cooked chickpeas, drained and patted dry with paper towels",
    "1 teaspoon of cumin seeds",
    "1 teaspoon of coriander seeds",
    "2-4 chiles de arbol (if you like spicy, add even more!)",
    "6 ounces of plain thick yogurt, like Greek yogurt",
    "small handful of cilantro, finely chopped",
    "1 clove of garlic, finely minced",
    "olive oil",
    "sea salt and freshly ground black pepper"
  ],
  "keywords": [
    "head",
    "cauliflower",
    "chickpeas",
    "patted",
    "dry",
    "paper",
    "towels",
    "cumin",
    "seeds",
    "coriander",
    "chiles",
    "arbol",
    "spicy",
    "plain",
    "greek",
    "yogurt",
    "cilantro",
    "clove",
    "garlic",
    "olive",
    "oil",
    "salt",
    "black",
    "pepper"
  ],
  "title": "roasted cauliflower with whole cumin and coriander seeds and chiles de arbol",
  "users": [
    null
  ]
}