{
  "hash": "b91d68ea4bfe0356066db681fce83e7423c29864",
  "title": "Spinach & Goat Cheese Quiche with Sweet Potato Crust",
  "image": "https://www.ambitiouskitchen.com/wp-content/uploads/2017/03/eggquiche-6.jpg",
  "href": "https://www.ambitiouskitchen.com/spinach-goat-cheese-quiche-sweet-potato-crust/",
  "extension": "Chrome",
  "firstAdded": "2019-05-05T11:49:46.178000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 375 degrees F. Grease a 9 inch pie pan with nonstick cooking spray. Add sweet potato slices all around the base (as the photo shows in the picture above). Cut some in half if you need them to fit on the sides. Spray the sweet potatoes with additional nonstick cooking spray. Bake for 20 minutes. Once done, remove from oven and allow to cool for 5 minutes. Keep heat in oven.",
    "While sweet potato crust is baking, cook the veggies: Add olive oil to a medium skillet and place over medium high heat. Add in onion, jalapeno, diced tomato; saute for a few minutes. Then add spinach and saute for another few minutes, or until spinach wilts. Remove from heat and set aside to cool.",
    "In a medium bowl, whisk together eggs, egg whites, almondmilk, salt and pepper.",
    "Add spinach mixture over the baked sweet potato crust, then pour egg mixture over the top. Sprinkle goat cheese crumbles on top along with an additional sprinkle of salt and pepper.",
    "Bake for 30-45 minutes or until egg sets and puffs up. Remove from heat and allow to cool for a few minutes before cutting into 6 slices. Enjoy!"
  ],
  "ingredients": [
    "0",
    "Coconut oil cooking spray",
    "1 large sweet potato, cut into 1/8th inch slices",
    "1 teaspoon olive oil",
    "1 small white onion, diced",
    "1 large roma tomato, diced",
    "1 jalapeno, seeded and diced",
    "1 (5 oz) bag of spinach",
    "1/4 teaspoon salt",
    "Freshly ground black pepper",
    "4 large egg",
    "4 large egg whites",
    "1/3 cup Almond Breeze unsweetened almondmilk",
    "1/4 teaspoon salt",
    "Freshly ground black pepper",
    "1/2 cup goat cheese crumbles"
  ],
  "__v": 1
}