{
  "hash": "19368367cd3d15475865f61a2dd3eb991397cb47",
  "title": "Jamaican Bammies (Cassava Bread) Recipe",
  "image": "https://www.thespruceeats.com/thmb/9hfi_P-O52DA49yjbKcqvVV16jU=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/casabe--bammy--beiju--bob--biju----flatbread-of-cassava--tapioca-615386628-5af87800eb97de003de6ae42.jpg",
  "href": "https://www.thespruceeats.com/jamaican-bammies-cassava-bread-recipe-2138125",
  "extension": "Chrome",
  "firstAdded": "2018-10-09T17:47:21.711000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the Bammies",
    "Wash and peel the yuca (cassava).",
    "Using a grater, grate the yuca using the finest section.",
    "Using cheesecloth or a clean cotton towel, squeeze the grated cassava to remove as much moisture as possible and discard the liquid.",
    "Add salt to the yuca mixture and stir it in well, breaking up any lumps.",
    "Divide grated yuca into 2 equal parts and set aside.",
    "Heat a frying pan. (A cast-iron skillet works well). Do not add any oil.",
    "When the pan is hot, place half of the grated yuca in the middle of the pan. Spread it out with a spatula, or back of a spoon, into a circular cake that is approximately two inches around and 1/2 inch thick.",
    "Cook until bottom is golden and set, then flip and cook the other side until golden and set.",
    "Remove from the frying pan and scrape off any scorched areas.",
    "Repeat with the other half of grated yuca.",
    "Pour the coconut milk into a shallow bowl or casserole dish big enough to hold the two bammy patties.",
    "Soak the bammies in the coconut milk for 10 minutes. Now either fry or bake them as directed below. When they are cooked, serve them with ackee, callaloo (callalu) or a vegetable run down.",
    "Fry the Bammies",
    "While the bammies are soaking, heat a frying pan filled with 1/2 inch of vegetable oil until it reaches 350 F.",
    "Fry the bammies whole, cut in half, or cut into quarters until they are lightly brown on all sides, flipping over as necessary.",
    "Bake the Bammies",
    "If you choose to bake the bammies instead of frying them, heat an oven to 350 F.",
    "Lightly butter the bammies on each side and bake for 15 minutes."
  ],
  "ingredients": [
    "0",
    "2 pounds of ​cassava (fresh yuca)",
    "Salt to taste",
    "1 to 2 cups coconut milk",
    "1 to 2 cups coconut milk​"
  ],
  "__v": 1
}