{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 350 degrees F. Line muffin tins with cupcake liners.",
    "In the bowl of an electric mixer, cream the softened butter and sugar together. Add the eggs one at a time, beating after each egg. Stir in the vanilla and food coloring.",
    "In a separate bowl, stir together the flour, baking powder, and salt. Chop the dried lavender buds into fine, small pieces. Stir into the flour mixture.",
    "Add the flour mixture to the butter mixture. Stir in the milk.",
    "Scoop batter evenly into lined muffin tins. Bake for 18-24 minutes, or until a toothpick inserted into the center of a cupcake comes out clean. Let cupcakes cool in the tins for about 5 minutes, then remove to a wire rack to cool completely.",
    "For the frosting:",
    "In the large bowl of an electric mixer, beat the butter and cream cheese together. Add the powdered sugar 1 cup at a time, mixing on low, until the frosting is smooth and creamy. Beat in the vanilla extract and honey.",
    "Scoop frosting into a piping bag fitted with a 1M tip. To create the flower, begin in the center of the cupcake's surface, and slowly swirl in wider circles. (It might be helpful to practice on a piece of parchment paper first, then you can just add the frosting back to the bowl.) You can also simply spread the cream cheese frosting over the top of the cupcakes with a knife.",
    "Lightly drizzle a little honey on top of the frosting. Enjoy!"
  ],
  "firstAdded": "2014-07-20T19:33:02.594000",
  "hash": "e8b943ccb2b16931d2d0997f27d267e815ec3620",
  "href": "http://www.huffingtonpost.com/jessie-roberts/lavender-cupcakes-with-ho_b_1819019.html?utm_hp_ref=fb&src=sp&comm_ref=false",
  "image": "http://i.huffpost.com/gen/739232/thumbs/r-LAVENDER-CUPCAKES-large570.jpg?4",
  "ingredients": [
    "0",
    "For the cupcakes:",
    "1/2 cup (1 stick) butter, softened",
    "1 cup sugar",
    "2 eggs",
    "2 teaspoons vanilla extract",
    "About 1/2 teaspoon red and 1/2 teaspoon blue food coloring*",
    "1 1/2 cups all-purpose flour",
    "1/2 teaspoon baking powder",
    "1/4 teaspoon salt",
    "2 1/2 tablespoons dried lavender buds",
    "2/3 cup cold milk",
    "For the frosting:",
    "1/2 cup (1 stick) unsalted butter, softened",
    "8 ounces cream cheese, softened",
    "4 cups powdered sugar",
    "2 teaspoons vanilla extract",
    "2 tablespoons honey, plus a little extra for drizzle"
  ],
  "keywords": [
    "cupcakes",
    "butter",
    "softened",
    "sugar",
    "eggs",
    "vanilla",
    "red",
    "blue",
    "food",
    "coloring",
    "allpurpose",
    "flour",
    "baking",
    "salt",
    "lavender",
    "buds",
    "cold",
    "milk",
    "frosting",
    "unsalted",
    "cream",
    "cheese",
    "honey",
    "extra",
    "drizzle"
  ],
  "title": "Lavender Cupcakes with Honey Frosting",
  "users": [
    null
  ]
}