{
  "hash": "2875aef944922355b681d867f28c99226ccd190e",
  "title": "Maureen’s Avocado Tabbouleh",
  "image": "https://cookieandkate.com/images/2015/07/avocado-tabbouleh-lettuce-wraps.jpg",
  "href": "https://cookieandkate.com/2015/avocado-tabbouleh-recipe/",
  "extension": "",
  "firstAdded": "2018-05-01T16:16:17.027000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Rinse the bulgur a couple of times in a small bowl, letting the bulgur settle for a few seconds before pouring off the water (I used a fine-mesh colander to catch the bulgur when I poured off the water). Add enough fresh water to just cover the bulgur and soak for 30 minutes, or until it is softened. Pour off and squeeze out any excess water.",
    "While the bulgur softens, prepare the parsley. Rinse it well, then dry it in a salad spinner and then gently squeeze it in clean kitchen towels to get rid of any remaining moisture. Or, you can wrap the damp parsley in clean kitchen towels and gently squeeze out excess water, repeating as necessary. The drier the parsley, the easier it will be to chop up and the better your tabbouleh will be.",
    "Pinch off the curls of parsley from their stems. Chop the curls in two or three batches with a large chef’s knife until it’s finely chopped.",
    "In a medium serving bowl, combine the parsley, tomato, avocado, scallions, mint and bulgur. Stir in the olive oil, 2 tablespoons lemon juice, salt, garlic powder and pepper. Taste and adjust the seasonings, adding more lemon and salt if needed. Let the tabbouleh rest for about 15 minutes to give the bulgur time to soak up the flavors.",
    "Serve the tabbouleh as a salad immediately. Or, to serve as lettuce cups: pull the leaves from your lettuce and arrange the nicest, most cup-like leaves on a platter. Fill each cup with a big spoonful of the tabbouleh and serve immediately."
  ],
  "ingredients": [
    "0",
    "⅓ cup #1 fine grade bulgur (see notes for how to turn coarse bulgur into fine)",
    "2 to 3 bunches curly parsley (to yield 2 cups finely chopped parsley)",
    "1 pint cherry tomatoes, diced into ¼-inch wide rounds",
    "1 ripe avocado, diced",
    "5 scallions (green onions), sliced thinly crosswise",
    "4 large sprigs fresh mint leaves, finely chopped (to yield ¼ cup chopped mint)",
    "¼ cup olive oil",
    "2 tablespoons to ¼ cup fresh lemon juice, to taste (about 1 to 2 medium lemons, juiced)",
    "¼ teaspoon salt, more to taste",
    "¼ teaspoon garlic powder",
    "Freshly ground black pepper, to taste",
    "To serve as lettuce cups: 1 head butter lettuce or 2 heads Little Gem romaine, rinsed and dried"
  ],
  "__v": 1
}