{
  "hash": "1f530a4527507e5e752085e5a1a98d5c933ad621",
  "title": "Chile-Eggplant Mazemen Ramen with Pork Belly",
  "image": "http://cdn-image.foodandwine.com/sites/default/files/styles/551x551/public/taiwanese-congee-with-sweet-potato-xl-recipe0117.jpg?itok=8cRYwdF2",
  "href": "http://www.foodandwine.com/recipes/chile-eggplant-mazemen-ramen-pork-belly",
  "extension": "Chrome",
  "firstAdded": "2017-01-26T19:09:26.672000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "prepare the pork belly Preheat the oven to 425°. Rub the pork belly on both sides with the oil, season with salt and pepper and set it on a rack in a medium roasting pan. Add the stock to the pan, cover and roast the pork for about 2 1/2 hours, until very tender. Let the pork rest for 30 minutes. Strain the rendered fat through a cheesecloth-lined sieve into a bowl; the stock will have evaporated. Cut the pork into 1/2-inch-thick slices and keep warm.",
    "meanwhile, make the sofrito In a large saucepan, heat the oil. Add the onion and eggplant and cook over low heat, stirring occasionally, until the vegetables are very soft, about 1 hour. Add the tomatoes and cook, stirring occasionally, until the tomatoes have almost melted, about 1 hour. Stir in the chipotle powder and cook for 15 minutes longer; season with salt. Transfer the sofrito to a bowl and let cool to room temperature. Drain the sofrito in a sieve; discard the oil or reserve it for another use.",
    "make the shoyu tare In a medium saucepan, heat the oil. Add the onion and cook, stirring occasionally, until softened, about 5 minutes. Add the ginger and garlic and cook, stirring occasionally, until lightly caramelized, about 10 minutes. Add the soy sauce, sake and mirin and bring to a boil; simmer for 2 minutes. Add the stock and dashi powder and simmer for 3 minutes. Keep warm.",
    "make the toasted rye noodles Preheat the oven to 275°. In a small ovenproof skillet lined with aluminum foil, spread the baking soda in an even layer and bake for 1 hour. Let cool.",
    "make the toasted rye noodles Meanwhile, in a small nonstick skillet, toast the rye flour over moderately low heat, stirring, until fragrant, about 4 minutes. Using a rubber spatula, scrape the toasted rye flour into the bowl of a standing electric mixer fitted with the dough hook. Add the bread flour and cake flour. In a medium bowl, stir the baked baking soda and salt with the cool water until dissolved. With the mixer at low speed, slowly blend the baking soda solution into the flour in three additions. Mix, scraping down the bowl frequently, until the dough starts to come together. At medium speed, knead the dough until it forms a shaggy ball, about 10 minutes. Cover the bowl with plastic wrap and let stand at room temperature for 30 minutes.",
    "make the toasted rye noodles Pat the dough into a disk and cut into 8 equal pieces. Work with 1 piece at a time and keep the rest covered with a damp kitchen towel: Flatten the dough about 1/4 inch thick. Roll the dough through a pasta machine at the widest setting. Fold the dough in thirds, like a letter, and roll it again at the widest setting. Repeat this folding and rolling until the dough feels smooth and elastic, about 3 more times. Roll the dough through successively narrower settings, two times per setting without folding, until the sheet of dough is 1/16 inch thick. Cut the sheet of dough into roughly 1-foot lengths and transfer them to a baking sheet or work sur-face lightly dusted with cornstarch. Lightly dust the pasta sheets with cornstarch and cover with a dry kitchen towel. Repeat with the remaining dough, slightly overlapping the pasta sheets on the baking sheet.",
    "make the toasted rye noodles Run each sheet of pasta through the spaghetti cutter. Gently toss the noodles with cornstarch and spread them on a baking sheet or work surface in a single layer in 8 even portions (roughly 5 ounces each).",
    "make the toasted rye noodles To build a bowl of ramen: Pour 1/3 cup of the warm shoyu tare and 1 teaspoon of the reserved rendered pork fat into a bowl. Boil one portion of noodles in unsalted water just until al dente, about 1 minute. (If you're assembling multiple bowls of ramen, you can cook up to 4 portions of noodles together at the same time.) Drain the noodles well and add to the bowl. Top with 1/4 cup of the chile-eggplant sofrito and a slice or two of pork belly. Garnish with scallions and chipotle powder."
  ],
  "ingredients": [
    "0",
    "One 2-pound piece of skinless meaty pork belly",
    "1 tablespoon canola oil",
    "Kosher salt",
    "Freshly ground black pepper",
    "3 cups chicken stock or low-sodium broth",
    "1",
    "1 cup canola oil",
    "1 large onion, minced (2 cups)",
    "1/2 small eggplant, minced (1 1/2 cups)",
    "2 medium tomatoes, minced (1 1/4 cups)",
    "2 1/2 teaspoons chipotle chile powder",
    "Kosher salt",
    "2",
    "1/3 cup canola oil",
    "1 large onion, minced",
    "3 tablespoons minced peeled fresh ginger",
    "2 teaspoons minced garlic",
    "2/3 cup reduced-sodium soy sauce",
    "1/2 cup dry sake",
    "1/2 cup mirin",
    "2 cups chicken stock or low-sodium broth",
    "1 tablespoon instant dashi, such as Ajinomoto Hon Dashi",
    "3",
    "20 grams (1 tablespoon plus 3/4 teaspoon) baking soda",
    "70 grams (1/3 cup plus 2 1/2 tablespoons) rye flour",
    "620 grams (4 cups) bread flour",
    "300 grams (2 cups) cake flour",
    "13 grams (1 1/2 tablespoons) kosher salt",
    "430 milliliters (2 cups plus 2 tablespoons) cool water",
    "Cornstarch, for dusting",
    "Thinly sliced scallions and chipotle chile powder, for garnish"
  ],
  "__v": 1
}