{
  "hash": "d4464b49030b3cda35fb3b665e83dcfc09e712a4",
  "title": "Tomato Herb Pull Apart Bread",
  "image": "http://www.budgetbytes.com/wp-content/uploads/2016/08/Tomato-Herb-Pull-Apart-Bread-V.jpg",
  "href": "https://www.budgetbytes.com/2016/08/tomato-herb-pull-apart-bread/",
  "extension": "Chrome",
  "firstAdded": "2017-05-11T02:28:30.714000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare the tomato sauce first, so that it has time to cool. In a small skillet combine the olive oil, garlic, oregano, basil, thyme, rosemary, red pepper, cracked pepper, and salt. Heat the oil and herbs over medium-low for 2-3 minutes to gently infuse the oil with flavor. It's okay for the herbs to sizzle, but do not let them burn.",
    "Add the tomato paste and honey to the skillet. Stir and cook for 3-5 minutes more, or until the tomato paste becomes a deep red color. The tomato paste and oil will not create a smooth sauce, but will stay fairly separated. Let the sauce cool.",
    "While the sauce is cooling, stir the yeast and sugar into one cup of warm water. Let the mixture sit for about 5 minutes, or until it develops a thick layer of foam on top.",
    "In a large bowl, stir together one cup of the flour with the salt. Add the olive oil to the yeast mixture, then pour it into the bowl with the flour and stir until it forms a smooth paste. Continue to add flour, ½ cup at a time, to the bowl until it forms a sticky ball of dough that you can no longer stir with a spoon.",
    "Liberally dust a clean work surface with flour and transfer the sticky dough from the bowl to the work surface. Knead the dough for about 5 minutes, slowly adding more flour as you go, until a smooth ball of dough has formed and you've used about 3 cups of flour total (from beginning to end). Let the dough rest for 5 minutes.",
    "Use a bench scraper or sharp knife to cut the dough into 1-inch chunks. Place the cut dough into a clean bowl, add the cooled tomato sauce, and grated Parmesan. Toss the dough pieces in the sauce and cheese until everything is evenly coated. If the dough pieces stick together before they get coated in the sauce, simply pull them apart.",
    "Coat a 9-inch pie plate or bread loaf pan with non-stick spray. Place the sauce coated bread pieces in the prepared dish. Cover loosely with plastic and let the bread rise for one hour, or until double in size.",
    "Preheat the oven to 350ºF. Bake the bread for 23-25 minutes, or until the top has darkened slightly and the bread sounds hollow when tapped with your finger. Let the bread cool slightly, then serve."
  ],
  "ingredients": [
    "0",
    "¼ cup olive oil $0.42",
    "1 clove garlic, minced $0.08",
    "½ tsp dried oregano $0.05",
    "½ tsp dried basil $0.05",
    "¼ tsp dried thyme $0.03",
    "¼ tsp dried rosemary $0.03",
    "Pinch red pepper flakes $0.02",
    "10-15 cranks of a pepper mill $0.05",
    "½ tsp salt $0.03",
    "3oz. (5 Tbsp) tomato paste $0.33",
    "½ tsp honey $0.02",
    "1",
    "1 cup warm water $0.00",
    "2 tsp active dry yeast $0.19",
    "½ tsp sugar $0.01",
    "1 Tbsp olive oil $0.11",
    "1 tsp salt $0.05",
    "3 cups (approx.) all-purpose flour $0.29",
    "¼ cup grated Parmesan $0.24"
  ],
  "__v": 1
}