{
  "hash": "2557be64760f761db70545018f6784a032a9cf85",
  "title": "World’s Tastiest Chicken, Brown Rice & Broccoli Meal Prep",
  "image": "",
  "href": "http://fitmencook.com/worlds-tastiest-chicken-brown-rice-broccoli-meal-prep/",
  "extension": "Chrome",
  "firstAdded": "2016-11-02T20:50:11.888000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Steps:",
    "First, chop chicken breast (or tofu) into small pieces and set it aside.",
    "Set a nonstick skillet on low-medium heat and add olive oil and garlic. Careful NOT to let the garlic burn. Just let it cook for 1 minute then add chopped green onions. Stir with a wooden spoon or spatula.",
    "After another minute, add cooked brown rice to the skillet, then add the Chinese 5-spice blend. Stir and sear the cooked rice for about 45 seconds and let the aroma fill your kitchen.",
    "Add 1 tablespoon of low sodium Tamari (or soy sauce) and after about 1 minute of searing the rice, increase the heat to medium-high and toss in the chopped chicken breast. Chop and stir.",
    "Note: If you find the mixture is getting too dry, then decrease the heat and/or spray the skillet with olive oil.",
    "Cook for about 5 to 8 minutes, until the outside of the chicken turns brown or has a light sear.",
    "Finally, add frozen or fresh broccoli florets to the skillet and cook for another 4 to 5 minutes.",
    "Add the food to a bowl or meal prep container, and you’re done.",
    "Enjoy the tastiest chicken, brown rice and broccoli your body has been missing!"
  ],
  "ingredients": [
    "0",
    "Ingredients for 1 large serving:",
    "6oz raw chicken breast (or firm tofu or tempeh)",
    "1 cup cooked brown rice (I used Annie Chun’s sprouted brown rice I purchased at Kroger)",
    "3/4 cup frozen (or raw) broccoli florets",
    "1 tablespoon olive oil (or olive oil spray to reduce amount of fat)",
    "1/2 tablespoon minced garlic",
    "1/4 cup chopped green onions (or to taste)",
    "Seasonings:",
    "1/2 tablespoon Chinese 5-spice powder (Private Selection brand)",
    "1 tablespoon low sodium Tamari (or soy sauce or Bragg Liquid Aminos)"
  ],
  "__v": 1
}