{
  "hash": "f1f26df111a9cbd7064ad7cafd7ec511796fce25",
  "title": "Apple crumble cheesecake",
  "image": "",
  "href": "http://www.itv.com/lorraine/food/apple-crumble-cheesecake-dean-edwards-recipe",
  "extension": "Chrome",
  "firstAdded": "2018-02-10T16:19:50.619000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Method:",
    "For the biscuit base, use a mini blender to break down the biscuits to a fine crumb. Pour into a bowl and mix in the melted butter until fully incorporated.",
    "Place the mixture into a 24cm loose-bottomed spring form cake tin with the base lined with non-stick baking paper. Compress down and push some of the biscuit up the sides of the tin, this will hold the apple in place. Chill in the fridge for 20 minutes.",
    "For the apple sauce. melt the butter in a pan then add the apple, cinnamon and sugar and cook gently for around 8-10 minutes until soft. Leave to cool before pouring over the base, and smoothing into an even layer.",
    "For the cheesecake filling, whisk the cream cheese, soured cream, caster sugar and eggs. Gently pour into the cake tin then bake in a preheated oven set at 160C /320F/gas mark 2 for around 55-60 minutes, the centre should have a slight wobble. Allow to cool before chilling in the fridge until set.",
    "For the crumble topping: While the cheesecake is cooling place the softened butter and flour into a bowl and rub together until the mix resembles breadcrumbs. Stir in the sugar and almonds and mix well. Place onto a baking tray then bake in a preheated oven set at 200C /400F/gas mark 6 for 20-25 minutes or until golden.",
    "Before serving scatter the crumble over the top of the cheesecake and serve with a drizzle of toffee sauce"
  ],
  "ingredients": [
    "0",
    "For the biscuit crumb:",
    "250g ginger nut biscuits",
    "70g unsalted butter melted",
    "For the apple filling:",
    "15g unsalted butter",
    "300g bramley apples, peeled and cubed",
    "200g braeburn apples, peeled and cubed",
    "30g caster sugar",
    "½ tsp ground cinnamon",
    "For the cheesecake filling:",
    "400g cream cheese",
    "100ml soured cream",
    "120g caster sugar",
    "4 medium eggs",
    "For the crumble topping:",
    "100g unsalted butter softened",
    "100g plain flour",
    "100g crushed almonds",
    "90g golden caster sugar"
  ],
  "__v": 1
}