{
  "__v": 1,
  "directions": [
    "0",
    "In a food processor, pulse together all of the filling ingredients. Taste and adjust seasonings. Don’t over blend, the filling needs to be somewhat chunky. If yours is more watery, add some more edamame or more basil until you get a thicker consistency.",
    "Lay half of the wonton wrappers out on your work surface. Set the rest in a pile next to you, along with a small bowl of water for dabbing your fingers in. Spoon about a tablespoon of filling in each. Use your finger to wipe a bit of water on all 4 edges. Place a new wrapper on top and gently press down, adhering each edge.",
    "Simmer broth in a medium skillet. Add enough broth so that it covers the bottom of the pan at least an inch deep. Drop wontons in the pan in a single later (you can do this in multiple batches if they don’t all fit. Cover and steam for about 2 minutes or until the wontons are cooked through but still al dente (like pasta).",
    "Divide steamed wontons among plates, pour the broth from the pan on top. Drizzle with some toasted sesame oil and garnish with sprouts and sesame seeds."
  ],
  "firstAdded": "2014-08-24T20:43:46.965000",
  "hash": "19734bdfcbbb6f8b6dc5d07da4fcfac0c7a87bc5",
  "href": "http://www.loveandlemons.com/2012/09/10/edamame-dumplings/",
  "image": "http://d1wcgy4dy6voh7.cloudfront.net/wp-content/uploads/2012/09/edamame-dumplings5_loveandlemons.jpg.jpg",
  "ingredients": [
    "0",
    "filling:",
    "1 cup edamame, shelled, cooked, drained",
    "a big handful of basil leaves (about 10 big leaves)",
    "3 scallions, white and green parts, coarsley chopped",
    "1/2 garlic clove, minced",
    "1 teaspoon fresh ginger, minced",
    "1 teaspoon miso paste",
    "1 teaspoon tahini",
    "squeeze of lemon",
    "splash of sriracha (or to taste)",
    "salt, pepper, to taste",
    "other ingredients:",
    "18 wonton wrappers (plus a few extra to allow for mess-ups)",
    "1-2 cups pre-made veggie broth, for steaming",
    "toasted sesame oil, for drizzling",
    "sprouts and sesame seeds, for garnish"
  ],
  "keywords": [
    "filling",
    "edamame",
    "shelled",
    "basil",
    "leaves",
    "scallions",
    "white",
    "green",
    "parts",
    "coarsley",
    "garlic",
    "clove",
    "ginger",
    "miso",
    "tahini",
    "squeeze",
    "lemon",
    "splash",
    "sriracha",
    "salt",
    "pepper",
    "wonton",
    "wrappers",
    "extra",
    "allow",
    "messups",
    "premade",
    "veggie",
    "broth",
    "steaming",
    "sesame",
    "oil",
    "drizzling",
    "sprouts",
    "seeds"
  ],
  "title": "edamame dumplings",
  "users": [
    null
  ]
}