{
  "hash": "7316d93566a0f8c6f0698d0f5a19dc4646851296",
  "title": "Gluten-Free Buckwheat Quinoa Loaf",
  "image": "http://www.breadexperience.com/wp-content/uploads/buckwheat-quinoa-loaf_415_thumb1-300x200.jpg",
  "href": "http://www.breadexperience.com/gluten-free-buckwheat-quinoa-loaf/",
  "extension": "",
  "firstAdded": "2015-10-04T11:27:18.421000",
  "users": [
    null
  ],
  "keywords": [
    "poolish",
    "flour",
    "unhulled",
    "buckwheat",
    "quinoa",
    "water",
    "instant",
    "yeast",
    "final",
    "dough",
    "scant",
    "chia",
    "seeds",
    "psyllium",
    "husk",
    "salt",
    "honey"
  ],
  "directions": [
    "0",
    "Prepare the overnight poolish:",
    "Combine 150 g of warm water and a pinch (orof instant yeast and let it rest for 10 minutes at room temperature.",
    "Mix in the buckwheat and quinoa flours to form a wet paste. This mixture reminds me more of the texture of clay rather than a poolish. It also looks like clay.",
    "Cover the bowl with plastic wrap or a kitchen towel and allow it to ferment at room temperature for about eight hours.",
    "The poolish seems to work better at a cooler room temperature (64 to 68 degrees F.) than I normally use for wheat bread (70 to 75 degrees F.) It also performs better if you only let it ferment for about 10 hours max. The first time I made this bread, I let the poolish and the final dough ferment longer due to my schedule and the texture was more like a sponge than bread.",
    "Mix the final dough:",
    "Grind the CHIA seeds in a coffee grinder. If you don’t have a coffee grinder, feel free to soak the CHIA seeds in water until softened. Just be sure to reduce the amount of water used in the final dough.",
    "Here are the dry ingredients. The CHIA seeds are in the small green bowl on the left. The milled CHIA is in the small white bowl. The psyllium husk is in the 2nd green bowl (from the left) and the salt is in the last green bowl on the right.",
    "Mix the dry ingredients together gently with a wire whisk to ensure there are no clumps of milled seeds.",
    "Add the remaining water to the poolish and the dry ingredients. Mix well using a wooden spoon or Danish dough whisk. The dough will be stiff, but workable. You may not need all 195 g of the water. I held back about 50 g of the water initially and then added it in gradually. For this final version, I used all of the water; however, on some of the previous attempts, I only used about 150 g of the water.",
    "Bulk fermentation:",
    "Cover the bowl with plastic wrap or a kitchen towel and let the dough rise for one hour in a warm place. I placed the dough in a proofing box at 75 degrees F. You can also place it in the oven with the light turned on.",
    "Shaping the loaf:",
    "Remove the dough from the bowl and knead it for a few minutes. You may need a little extra flour for dusting.",
    "I shaped the dough into a batard shape. It seemed to do really well in this shape. To form the batard, flatten the dough out on the counter or board and form into a rough round. Bring the bottom of the round to the center and and gently press down using the outside edge of you hand. Fold the top of the round down and slightly overlap the bottom of the loaf. Gently pinch the seams together using the outside of your hand and your fingertips if necessary.",
    "Place the loaf seamside down on a baking sheet or parchment paper sprinkled with buckwheat flour. This dough is pretty easy to work with so you can adjust the shape and make the ends more pointed if you like.",
    "Final Proof:",
    "Cover the loaf and let it rise in a warm place, draft-free place for about 2 hours. I put the loaf in the proofing box at 75 degrees F.",
    "Prepare the loaf for baking:",
    "Preheat the oven to 450* degrees F. for 30 to 45 minutes with a baking stone on the bottom rack and a steam pan underneath or a cast iron skillet on the very top rack. You can also bake this loaf directly on a baking sheet if you prefer, but you will still need to bake it at a moderately high temperature.",
    "* I baked this loaf at different temperatures and found that it did best when I preheated the oven to 450 and then reduced it to 425 degrees F. after spritzing it with water. You may need to experiment with the oven temperature to find what works best for you.",
    "Score the top of the loaf before placing it in the oven. This will allow the loaf to expand and minimize the tearing of the crust. I used a lame to score this loaf, but you can also use the tip of a sharp knife.",
    "Bake the loaf:",
    "Slide the loaf (on the parchment paper) onto the baking stone. Add 3 or 4 ice cubes to the cast iron skillet or steam pan, if using, and close the oven door. Open the door and spritz the oven walls with water. Immediately close the door. Repeat the spritzing a couple more times in 30-second intervals, then turn the oven down to 425 degrees F. Bake the loaf for 30 to 35 minutes or until browned and the loaf sounds hollow when thumped on the bottom. The internal temperature of the loaf should be 206 degrees F. when it is ready.",
    "Cooling and slicing the loaf:",
    "Remove the loaf from the oven and cool completely on a wire rack before slicing and serving.",
    "So after all that, I took this loaf to the family party, but no one wanted to try it. I should say none of the gluten-eaters would try it, except my oldest sister and she only took a bite. Everyone else just looked at me like “Who me! I’m not going to try it, you eat it!” Remember that commercial where they always say “Give it to Mikey he’ll eat it?” That’s about what happened. Lol.",
    "My gluten-free relative did try it. She said it reminded her of rye bread. It’s a bit dense so I can see that.",
    "This loaf isn’t a fluffy and light roll, but if you’re looking for honest and edible gluten-free bread, then this just might fit the bill."
  ],
  "ingredients": [
    "0",
    "Poolish:",
    "108 g (~3/4 cup) Buckwheat flour (made from unhulled buckwheat)",
    "42 g (~1/3 cup +1 1/4 tsp.) Quinoa flour",
    "150 g (2/3 cup) warm water",
    ".5 g (a pinch) instant yeast",
    "Final Dough:",
    "150 g (scant 1 cup) Buckwheat flour",
    "50 g (1/3 cup + 1 T + 1 tsp.) Quinoa flour",
    "15 g (1 T + 1 tsp.) chia seeds",
    "15 g (2 scant T) psyllium husk",
    "1 1/2 tsp sea salt",
    "195 g (3/4 cup + 1 T) water",
    "2 tsp. honey",
    "All of the poolish"
  ],
  "__v": 1
}