{
  "hash": "69e3b0b0a520370a205329de684e5cf6170702b3",
  "title": "Mexican Beefy Nacho Casserole",
  "image": "http://i0.wp.com/realfoodbydad.com/wp-content/uploads/2014/05/Beefy-Nacho-Casserole-from-Real-Food-by-Dad.jpg?zoom=1.5&resize=498%2C781",
  "href": "http://realfoodbydad.com/mexican-beefy-nacho-casserole/",
  "extension": "Firefox",
  "firstAdded": "2015-04-08T14:44:04.352000",
  "users": [
    null
  ],
  "keywords": [
    "lean",
    "beef",
    "salsa",
    "preferred",
    "scallions",
    "white",
    "green",
    "parts",
    "separated",
    "clove",
    "garlic",
    "black",
    "pintos",
    "beans",
    "combination",
    "chicken",
    "broth",
    "chili",
    "cumin",
    "paprika",
    "doritos",
    "restaurant",
    "style",
    "tortilla",
    "chips",
    "pepper",
    "jack",
    "cheddar",
    "tomatos",
    "sour",
    "cream",
    "lime"
  ],
  "directions": [
    "0",
    "Preheat oven to 450 degrees F. Cook beef in a large skillet over medium high heat until browned about 5-8 minutes. Use a slotted spoon and transfer beef mixture to a plate. Set aside to cool, then fold in salsa.",
    "Add scallions whites and garlic, cook until soft and fragrant, about 30 seconds. Add in chicken broth, chili powder, cumin and paprika. Stir in beans until combined and heated through. Transfer bean mixture to a blender or food processor and pulse until mixture is pureed. Alternately, you can use a potato masher and mash bean mixture until smooth.",
    "Spread half of chips into casserole pan. Top with half the bean mixture, half the beef mixture, half the cheese. Repeat with remaining ingredients. Bake until cheese melts, about 5-7 minutes. Serve with green scallions, fresh chopped tomatoes. sour cream and lime.",
    "**NOTES** (1) To shortcut this recipe you can replace the spices with 1-2 tablespoon of your preferred taco seasoning. (2) Use any beans you prefer. I like white beans for their mild taste and creaminess. (3) To make this a heavier meal, layer in cooked Mexican rice."
  ],
  "ingredients": [
    "0",
    "1 lb 90% lean ground beef",
    "1/2 cup salsa, your preferred",
    "4 scallions, white and green parts chopped and separated",
    "1 clove garlic, chopped",
    "2 15oz can white beans (or black beans, pintos beans or a combination)",
    "1 cup chicken broth",
    "1/2 teaspoon chili powder",
    "1/4 teaspoon cumin",
    "1/4 teaspoon paprika",
    "12 oz Doritos chips (or restaurant style tortilla chips)",
    "3 cups pepper Jack, cheddar, or a combination",
    "green scallions, chopped tomatos, sour cream and lime for serving"
  ],
  "__v": 1
}