{
  "hash": "7c892f18ec3b17df0293e5920014f86e816fd086",
  "title": "vernight, Refrigerator Focaccia = The Best Focaccia",
  "image": "https://alexandracooks.com/wp-content/uploads/2018/03/focaccia.jpg",
  "href": "https://alexandracooks.com/2018/03/02/overnight-refrigerator-focaccia-best-focaccia/",
  "extension": "Chrome",
  "firstAdded": "2018-12-18T20:31:43.132000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the dough: In a large bowl, whisk together the flour, salt, and instant yeast. Add the water. Using a rubber spatula, mix until the liquid is absorbed and the ingredients form a sticky dough ball. Cover the bowl with a damp tea towel or plastic wrap and place in the refrigerator immediately for at least 12 hours.",
    "Line two 8- or 9-inch pie plates (or something similar) with parchment paper or grease with butter or coat with nonstick cooking spray. Pour a tablespoon of oil into the center of each pan. Using two forks, deflate the dough by releasing it from the sides of the bowl and pulling it toward the center. Rotate the bowl in quarter turns as you deflate, turning the mass into a rough ball. Use the forks to split the dough into two equal pieces. Place one piece into one of the prepared pans. Roll the dough ball in the oil to coat it all over, forming a rough ball. Repeat with the remaining piece. Let the dough balls rest for 2 to 4 hours depending on the temperature of your kitchen.",
    "Set a rack in the middle of the oven and preheat it to 425°F. Pour another tablespoon of oil over each round of dough. Rub your hands lightly in the oil to coat, then, using all of your fingers, press straight down to create deep dimples. If necessary, gently stretch the dough as you dimple to allow the dough to fill the pan. Sprinkle with flaky sea salt all over.",
    "Transfer the sheet pan to the oven and bake for 25 to 30 minutes, until the underside is golden and crisp. Remove the pans from the oven and transfer the focaccia to cooling racks. Let it cool for 10 minutes before cutting and serving; let it cool completely if you are halving it with the intention of making a sandwich."
  ],
  "ingredients": [
    "0",
    "4 cups (512 g) all-purpose flour",
    "2 tsp. kosher salt",
    "2 tsp instant yeast",
    "2 cups lukewarm water, made by combining 1/2 cup boiling water with 1 1/2 cups cold water",
    "butter for greasing",
    "4 tablespoons olive oil, divided",
    "flaky sea salt, such as Maldon"
  ],
  "__v": 1
}