{
  "hash": "6294ec1371fd30be86fc7d5ad898aa9097774301",
  "title": "White Chili",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2005/12/white-chili-horiz-a-1600.jpg",
  "href": "http://www.simplyrecipes.com/recipes/white_chili/",
  "extension": "Chrome",
  "firstAdded": "2017-09-30T17:04:07.980000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 If using dry beans, cook them first: Place the beans in a medium pot and cover with a couple inches of hot water, about 2 quarts. Add 1 1/2 teaspoons salt, 1 chopped garlic clove, and one bay leaf. Heat on high to bring to a simmer, cover, and reduce heat to very low to maintain a low simmer.",
    "Cook for 2 to 3 hours or until the beans are cooked through and tender (note that cannelli beans will cook faster than navy beans, and older dry beans will take longer to cook than newer). Drain.",
    "2 Sauté onions, garlic, spices: In a large thick-bottomed pot, sauté onions in olive oil on medium high heat until tender, about 4 minutes. Add the garlic, cumin, cloves, and cayenne and cook a minute more. Add the green chiles and dried oregano. Add the minced jalapeño or serrano chile if using.",
    "3 Add chicken, chicken stock, bring to simmer: Add the chicken and chicken stock. Increase the heat to high, bring to a simmer, lower the heat to low, cover and maintain the simmer for 20 minutes, until the chicken is cooked through.",
    "4 Add cooked beans, continue to simmer: Add the drained cooked beans and cook for 15 minutes more. Taste for seasonings and add more salt to taste. Depending on how salty your chicken stock and beans are, you may need to add a teaspoon or more.",
    "5 Serve with toppings and tortillas or chips: Serve topped with grated cheese. Garnish with cilantro, chopped fresh tomato, salsa, chopped scallions, and/or guacamole. Serve with fresh warmed flour tortillas or tortilla chips."
  ],
  "ingredients": [
    "0",
    "2 -15-ounce cans white beans, drained OR 1/2 pound dry white beans",
    "1 Tbsp olive oil",
    "1 medium onion, chopped, about 1 1/2 cups",
    "1 clove garlic, minced, about 1 teaspoon",
    "2 teaspoons ground cumin",
    "1/4 teaspoon cayenne pepper",
    "1/8 teaspoon ground cloves",
    "2 4-ounce cans chopped green chilies",
    "1 1/2 teaspoons dried oregano",
    "1 jalapeno or serrano pepper, finely chopped (optional)",
    "2 pounds boneless, skinless chicken thighs (can use breast meat, but thighs will work better), trimmed of excess fat and diced into 1/2 to 3/4-inch pieces",
    "3 cups chicken stock",
    "1 1/2 cups grated Monterey Jack cheese",
    "1 1/2 teaspoons salt",
    "1 clove garlic",
    "1 bay leaf"
  ],
  "__v": 1
}