{
  "hash": "a8e137cf0160ac77c459bdb9b0435741d92c9841",
  "title": "Instant Pot Smothered Pork Chops",
  "image": "https://cdn.ruled.me/wp-content/uploads/2017/07/smothered-pork-chops-second.jpg",
  "href": "https://www.ruled.me/instant-pot-smothered-pork-chops/",
  "extension": "Chrome",
  "firstAdded": "2020-03-03T18:17:37.316000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Mix paprika, garlic powder, onion powder, b lack pepper, salt, and cayenne pepper together in a small bowl.",
    "Rinse the pork chops and pat dry.",
    "Sprinkle both sides of the pork chops with 1 tablespoon of the spice mixture, rubbing the seasoning into the meat. Reserve the remaining spices.",
    "Heat the coconut oil in the bowl of the Instant Pot on the Saute setting.",
    "Brown the pork chops in the hot coconut oil, about 3 minutes per side.",
    "Remove the pork chops to a plate and turn off the Instant Pot.",
    "Add the sliced onions to pot base and then the mushrooms. Top with the browned pork chops.",
    "Add the lid to Instant Pot, making sure the vent is sealed. Cook on the Manual High setting for 25 minutes. Once cooked the pressure can be released naturally or manually.",
    "Remove the pot lid and place just the pork chops on a serving plate.",
    "Press the Saute setting again and whisk the remaining spice mixture, butter, and heavy cream into the hot liquid.",
    "Sprinkle ¼ teaspoon of xanthan gum into the liquid and whisk in immediately. Let the gravy simmer for 3-5 minutes until the butter is melted and the sauce starts to thicken. Turn off the Pot. Start with ¼ teaspoon of xanthan gum and add additional until the gravy thickens to your desired consistency. More may be needed depending on how much juice the meat and vegetables release during cooking. Also note the gravy will continue to thicken as it cools.",
    "Top the pork chops with the onion and mushroom gravy. Sprinkle with parsley and serve."
  ],
  "ingredients": [
    "0",
    "4 (4-6 ounce) boneless pork loin chops",
    "1 tablespoon paprika",
    "1 teaspoon garlic powder",
    "1 teaspoon onion powder",
    "1 teaspoon black pepper",
    "1 teaspoon salt",
    "¼ teaspoon cayenne pepper",
    "2 tablespoons coconut oil",
    "½ medium onion, sliced",
    "6 ounces sliced baby bella mushrooms",
    "1 tablespoon butter",
    "½ cup heavy cream",
    "¼ - ½ teaspoon xanthan gum",
    "1 tablespoon chopped fresh parsley"
  ],
  "__v": 1
}