{
  "hash": "3e08c6c7bf1c781bfa6bcbe4c899052cc4ced289",
  "title": "Skinny Strawberries and Cream Stuffed French Toast",
  "image": "http://77easyrecipes.com/wp-content/uploads/2016/07/Skinny-Strawberries-and-Cream-Stuffed-French-Toast.jpg",
  "href": "http://77easyrecipes.com/skinny-strawberries-and-cream-stuffed-french-toast/",
  "extension": "Chrome",
  "firstAdded": "2017-02-12T22:44:57.808000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "1. On one side of 4 slices of bread spread with 1 tablespoon cream cheese. Next, on top of cream cheese, spread each with 2 teaspoons strawberry preserves. Place ¼ cup strawberry slices on each. Top each with the remaining slice of bread to make a sandwich.",
    "2. In a shallow bowl or pie plate, beat egg whites and vanilla.",
    "3. Dip 2 sandwiches into the egg mixture, making sure to coat both sides.",
    "4. Coat a large nonstick pan with cooking spray. Melt 2 teaspoons reduced-fat butter and swirl around bottom of pan. Add 2 sandwiches, cook about 3 minutes on medium-high heat until golden. Turn over and cook the undersides for about 2 minutes, until golden brown. Place cooked sandwiches on a baking sheet and keep warm in oven while cooking the other 2 sandwiches.",
    "5. Repeat steps 3 and 4 with 2 remaining sandwiches.",
    "6. Transfer each sandwich to a plate. Cut each in half and sprinkle with 2 teaspoons powdered sugar and garnish with strawberry slices.",
    "7. Serve immediately with a fork and knife. Enjoy!",
    "Makes 4 servings (each serving, 1 full sandwich)"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "8 slices whole wheat bread or multi-grain bread, I used Milton’s Multi-Grain bread, see shopping tip",
    "4 tablespoons reduced-fat whipped cream cheese, see shopping tip",
    "8 teaspoons reduced sugar strawberry preserves, see shopping tip",
    "1 cup fresh strawberries, sliced thin",
    "6 egg whites",
    "1½ teaspoons vanilla extract",
    "4 teaspoons reduced-fat butter or Smart Balance Light spread",
    "8 teaspoons powdered sugar",
    "Strawberries slices for garnish"
  ],
  "__v": 1
}