{
  "hash": "e1842b1790cdfcf58a3098fdaf00f5fc5ef11ed7",
  "title": "Twice-Baked Spaghetti Squash with Pesto and Parmesan",
  "image": "http://2.bp.blogspot.com/-C1xXk5n6geY/VoZ5Kh0EM4I/AAAAAAABCZ8/yyKm6qAK9Mo/s1600/1-crop-twice-baked-spsquash-500top-kalynskitchen%2Bcopy.jpg",
  "href": "http://www.kalynskitchen.com/2009/02/recipe-for-twice-baked-spaghetti-squash.html",
  "extension": "Chrome",
  "firstAdded": "2016-04-06T00:06:15.915000",
  "users": [
    null
  ],
  "keywords": [
    "spaghetti",
    "squash",
    "lbs",
    "olive",
    "oil",
    "depending",
    "italian",
    "herb",
    "blend",
    "use",
    "seasoning",
    "basil",
    "pesto",
    "coarsely",
    "parmesan",
    "cheese",
    "salt",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "MONDAY, OCTOBER 06, 2014",
    "Twice-Baked Spaghetti Squash with Pesto and Parmesan",
    "66k",
    "1.51k",
    "1.66k",
    "Spaghetti squash is delicious with pesto and Parmesan and this Twice-Baked Spaghetti Squash with Pesto and Parmesan is low-carb and gluten-free. It makes a nice winter side dish if you're avoiding higher-carb vegetables.",
    "Have you tried spaghetti squash? In Utah it's a trendy plant for home vegetable gardeners that's easy to grow, low in calories, and versatile. For years I grew spaghetti squash in my garden, and although I'm not a fan of spaghetti squash as a substitute for pasta, I love to eat it as a side dish. This easy-to-make Twice-Baked Spaghetti Squash with Pesto and Parmesan is definitely something I'll be making again.",
    "(Twice-Baked Spaghetti Squash with Pesto and Parmesan was updated with better photos step-by-step instructions October 2014. It's prime time for spaghetti squash, so grab some from the farmer's market or from your neighbor's garden and give it a try!)",
    "Spaghetti Squash is low-glycemic and low-carb enough to be considered a phase one food for the South Beach Diet, and it shows up in the garden about the time you've been making Pesto and storing it in the freezer, making this a perfect Meatless Monday dish for this time of year. For more Meatless Monday ideas, visit Vegetarian Recipes in the recipe index or check out my Meatless Monday Pinterest board.",
    "Cut spaghetti squash in half lengthwise and use a sharp spoon to scrape out the seeds and stringy gunk that's around the seeds. Rub the cut sides with some olive oil and sprinkle with a little Italian Herb blend.",
    "Roast the squash at 400F/200C until the squash pulls apart easily with a fork like this.",
    "I had a really big squash so I scraped it all out into a baking dish to mix the pesto and Parmesan with the squash. (You could do this in the same dish you bake it in if you're not taking photos!)",
    "Here's how it looked when the squash, pesto, and Parmesan was evenly mixed.",
    "I transferred it to this baking dish which is about 12 inches by 8 inches. Sprinkle with grated Parmesan.",
    "Bake 20-30 minutes more, or until it's bubbling and starting to brown.",
    "Serve hot, with additional Parmesan to add at the table if desired.",
    "And here's the original photo from 2009, which I never was especially excited about!",
    "Twice-Baked Spaghetti Squash with Pesto and Parmesan",
    "(Makes about 6 servings, recipe created by Kalyn.)",
    "Ingredients:",
    "1 large spaghetti squash (6-8 lbs.)",
    "1-2 T olive oil (depending on how big your squash is)",
    "1-2 tsp. Italian Herb Blend (or use other seasoning of your choice)",
    "3 T basil pesto (more or less to taste)",
    "1 cup + 1/4 cup coarsely grated Parmesan cheese",
    "salt and fresh ground black pepper to taste",
    "Instructions:",
    "Preheat oven to 400F/200C. Wash outside of spaghetti squash if it's dirty, then cut squash in half lengthwise. Use a sharp pointed spoon to scrape out seeds and stringy gunk that's around the seeds.",
    "Cut ends off squash if desired, then rub inside surface with a small amount of olive oil and Italian Herb Blend. Put squash on baking sheet that you've sprayed with non-stick spray. Roast squash, starting to check after about 40 minutes and removing when squash is still firm but strings apart fairly easily into spaghetti-like strands. (It took about 50 minutes for the large pieces of squash I had.)",
    "Let squash cool a few minutes if needed, then scrape out strands into a plastic bowl or baking pan and discard skins. Gently mix in pesto and the cup of coarsely grated Parmesan cheese, season with salt and fresh ground black pepper, then pour squash/cheese mixture into a gratin dish and top with 1/4 cup more Parmesan cheese. Bake 20-30 minutes more, until mixture is slightly bubbling and cheese is melted and starting to brown. Serve hot."
  ],
  "ingredients": [
    "0",
    "1 large spaghetti squash (6-8 lbs.)",
    "1-2 T olive oil (depending on how big your squash is)",
    "1-2 tsp. Italian Herb Blend (or use other seasoning of your choice)",
    "3 T basil pesto (more or less to taste)",
    "1 cup + 1/4 cup coarsely grated Parmesan cheese",
    "salt and fresh ground black pepper to taste"
  ],
  "__v": 1
}