{
  "hash": "002290044d1d24c8e9ed749e72f0878048bbe0aa",
  "title": "Apple Steel-Cut Oatmeal",
  "image": "https://cookieandkate.com/images/2016/10/apple-steel-cut-oatmeal.jpg",
  "href": "https://cookieandkate.com/apple-steel-cut-oatmeal-recipe/",
  "extension": "Chrome",
  "firstAdded": "2019-05-14T05:58:12.688000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium Dutch oven or large saucepan (around 3.5 quarts), melt the butter over medium heat (if you’re not using butter, just warm the pan). Add the steel-cut oats and cook until fragrant, stirring often, about 2 minutes (this step enhances the flavor of the oats).",
    "Add the apple chunks, water and salt. Stir to combine, and raise the heat to high to bring the mixture to a simmer. Once simmering, reduce heat to medium-low and cook for about 35 minutes, until almost all of the liquid has been absorbed and the oats are nice and creamy. Stir every five minutes in the beginning, and more frequently as time goes on (you might need to dial down the heat as well).",
    "Remove from heat and let the oatmeal rest for 5 minutes before serving so it has more time to thicken up. Carefully taste (it’s hot!) and add maple syrup or honey if you’d like sweeter oatmeal (I used tart apples, so I added 1 tablespoon).",
    "Divide the mixture into individual bowls and serve with any toppings you’d like. If you’re saving extra portions for later, let them cool to room temperature, then cover and refrigerate for up to 4 days. Leftovers reheat well in the microwave, and would likely reheat well on the stove if you add some extra water to loosen them up."
  ],
  "ingredients": [
    "0",
    "1 tablespoon butter (optional)",
    "1 cup steel-cut oats (certified gluten-free if necessary)",
    "3 medium-to-large apples (I used 2 Granny Smiths and 1 Honeycrisp), cored and sliced into 1-to-2″ chunks",
    "4 cups water",
    "Pinch of salt",
    "Maple syrup or honey, to taste (optional)",
    "Optional toppings: swirl of nut butter (pecan butter, almond butter or peanut butter), toasted pecans or pepitas, chopped fresh apples, dried cranberries, drizzle of additional maple syrup or honey, light sprinkle of ground cinnamon…"
  ],
  "__v": 1
}