{
  "hash": "eceb34ff27b3ba45c76d753fb91013236f152962",
  "title": "Italiaanse bonensoep",
  "image": "http://www.francescakookt.nl/wp-content/uploads/Italiaanse-bonensoep_1.jpg",
  "href": "http://www.francescakookt.nl/italiaanse-bonensoep/",
  "extension": "Chrome",
  "firstAdded": "2016-11-05T18:00:59.831000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Hak de uien en knoflook helemaal fijn. Snijd de bleekselderij en wortel in fijne blokjes.",
    "Verhit wat olijfolie in een grote pan waar straks 1 liter vocht in kan en bak hier de worstjes rondom bruin en net gaar in. Haal de worstjes uit de pan en fruit de ui en knoflook in hetzelfde vet. Voeg na 1 minuut de bleekselderij en wortel toe en bak dit nog 2 minuten mee. Snijd in de tussentijd de worstjes in stukken (niet te fijn).",
    "Schenk 500ml runderbouillon bij de groenten en voeg het vlees, de laurierblaadjes en tijm eraan toe. Laat dit 10 minuten pruttelen zodat de groenten gaar worden. Laat in de tussentijd zowel de cannellini bonen als linzen uitlekken in een vergiet. De cannellini bonen voeg je toe aan de soep. De linzen doe je samen 250ml runderbouillon in de blender en dit maal je helemaal fijn. Schenk dit daarna bij de soep. Goed doorroeren en nog 5 minuten laten pruttelen. Is de soep naar jouw idee te dik? Schenk er dan nog wat runderbouillon bij. Proef de soep en breng op smaak met peper en eventueel nog wat zout.",
    "Serveer de soep in grote kommen met een lepeltje sour cream in het midden. Bestrooi met Parmezaanse kaas en peterselie en serveer. Lekker met boerenbrood erbij."
  ],
  "ingredients": [
    "0",
    "– 2 uien",
    "– 3 teentjes knoflook",
    "– 2 stengels bleekselderij",
    "– 2 wortels of 1/2 winterwortel",
    "– 6 Italiaans gekruide worstjes",
    "– 1000ml runderbouillon",
    "– 2 laurierblaadjes",
    "– 2 takjes tijm",
    "– 1 blik (400gr) cannellini bonen",
    "– 1 blik (400gr) linzen",
    "– om te serveren: sour cream, geraspte parmezaanse kaas, gehakte peterselie",
    "– olijfolie om in te bakken",
    "– zeezout",
    "– gemalen zwarte peper"
  ],
  "__v": 1
}