{
  "__v": 1,
  "directions": [
    "0",
    "Preparazione della terrina di lasagne alla robiola",
    "1) Lava i pomodori, incidili con un coltellino e tuffali per pochi secondi in acqua bollente; scolali e, una volta freddi, pelali e frullali fino a ottenere una salsa piuttosto liquida.",
    "2) Pulisci i cipollotti, tritali finemente e lasciali imbiondire in una casseruola con 3 cucchiai d'olio; unisci la salsa di pomodoro, regola di sale, profuma con il basilico spezzettato e cuoci a fuoco basso per 5 minuti.",
    "3) Lessa le lasagne in acqua bollente salata con un cucchiaio di olio, scolale al dente e sistemale su carta da cucina ad asciugare.",
    "4) Fodera uno stampo da plum cake lungo 20-22 cm con carta da forno, copri il fondo e le pareti con le lasagne e insaporisci con poca salsa, il grana e qualche fiocchetto di robiola; taglia le sfoglie rimaste a metà nel senso della lunghezza e continua con gli strati della terrina di lasagne fino a esaurire tutti gli ingredienti.",
    "5) Copri lo stampo con un foglio di carta d'alluminio e cuoci nel forno caldo a 180° per 30 minuti; spegni e lascia raffreddare, quindi sforma la terrina di lasagne alla robiola su un piatto di portata e affettala tiepida."
  ],
  "firstAdded": "2014-10-08T15:07:35.921000",
  "hash": "8a69c03faff87d492852ad917f566644cec0ce40",
  "href": "http://www.salepepe.it/ricette/primi/pasta-ripiena/lasagne/terrina-lasagne-robiola/",
  "image": "http://www.salepepe.it/files/2014/04/terrina-di-lasagne-alla-robiola-crop-986-400-986-400.jpg",
  "ingredients": [
    "0",
    "CIPOLLOTTO",
    "2",
    "GRANA",
    "50 GRAMMI",
    "OLIO DI OLIVA EXTRAVERGINE",
    "q.b.",
    "ROBIOLA",
    "300 GRAMMI",
    "SALE",
    "q.b.",
    "POMODORO PERINO",
    "600 GRAMMI",
    "BASILICO",
    "10 FOGLIA",
    "PASTA ALL'UOVO",
    "250 GRAMMI"
  ],
  "keywords": [
    "cipollotto",
    "grana",
    "grammi",
    "olio",
    "oliva",
    "extravergine",
    "robiola",
    "sale",
    "pomodoro",
    "perino",
    "basilico",
    "foglia",
    "pasta",
    "alluovo"
  ],
  "title": "LA TERRINA DI LASAGNE ALLA ROBIOLA",
  "users": [
    null
  ]
}