{
  "hash": "2e70b366945c57691dadceb251cec1bd30c1b829",
  "title": "PALEO MEATBALL BREADCRUMBSPERFECT PALEO MEATBALLS",
  "image": "http://healinggourmet.com/wp-content/uploads/2016/01/Meatballs-Fifth.jpg",
  "href": "http://healinggourmet.com/healthy-recipes/paleo-meatballs/",
  "extension": "Chrome",
  "firstAdded": "2016-02-13T00:54:00.700000",
  "users": [
    null
  ],
  "keywords": [
    "box",
    "lets",
    "organic",
    "creamed",
    "coconut",
    "oil",
    "grassfed",
    "butter",
    "psyllium",
    "husk",
    "pastured",
    "eggs",
    "baking",
    "soda",
    "salt",
    "garlic",
    "lbs",
    "grass",
    "fed",
    "beef",
    "lean",
    "pork",
    "sausage",
    "paleo",
    "breadcrumbs",
    "mixed",
    "herbs",
    "oregano",
    "basil",
    "parsley",
    "thyme",
    "tallow",
    "avocado",
    "panfrying"
  ],
  "directions": [
    "0",
    "Preheat oven to 300 F. Grease a quarter sheet pan.",
    "Warm the creamed coconut in warm water to make pliable.",
    "Add the melted creamed coconut, butter or oil, psyllium, eggs, baking soda, sea salt and garlic to a blender. Blend until smooth and creamy.",
    "Pour batter into prepared pan, smoothing evenly.",
    "Transfer to oven and bake 35-40 minutes. Edges will pull away and a toothpick inserted into the center should come out clean.",
    "Transfer to a cooling rack.",
    "Use a spatula to remove bread from pan. Place on a baking sheet and slice the bread into cubes.",
    "Place cubes back onto quarter sheet pan and toast, in a single layer.",
    "Add toasted cubes to blender or food processor and pulse to create breadcrumbs.",
    "Use what you need and store the remainder in an air-tight, zip-seal bag in the freezer. Each batch makes roughly 4 cubes of Paleo bread cubes or 3 ¼ cups breadcrumbs.",
    "1",
    "Preheat oven to 350F. Grease a baking sheet.",
    "In a medium bowl, add the beef, sausage, Paleo Breadcrumbs, eggs, herbs, garlic powder and salt.",
    "Mix gently to combine all ingredients (Do not overmix). Roll into golfball-sized balls.",
    "In a safe nonstick skillet, heat the tallow or oil. Add the meatballs to the heated pan, taking care to not crowd.",
    "Brown on all sides, then transfer to the baking sheet. Continue in batches until all meatballs are browned.",
    "Transfer to oven and bake 15-20 minutes or until a meat thermometer inserted into the center reaches 160 F.",
    "Remove from oven. Serve or simmer in your favorite sauce."
  ],
  "ingredients": [
    "0",
    "1 box Let’s Do Organic Creamed Coconut",
    "6 Tbsp. coconut oil or grass-fed butter",
    "2 tsp. psyllium husk powder",
    "5 pastured eggs",
    "¾ tsp. baking soda",
    "½ tsp. sea salt",
    "½ tsp. garlic powder (optional)",
    "1",
    "2 lbs. grass fed beef (half 75%/half 85% lean)",
    "1 lb. pork sausage",
    "1 cup Paleo Breadcrumbs (above)",
    "2 pastured eggs",
    "2 Tbsp. mixed dried herbs (oregano, basil, parsley, thyme)",
    "2 tsp. garlic powder",
    "¾ tsp. sea salt",
    "2 Tbsp. grass-fed tallow, coconut oil or avocado oil (for pan-frying)"
  ],
  "__v": 1
}