{
  "hash": "d793463533ff5a07426e7b97a920d077a51be22c",
  "title": "quinoa wrap with black beans, feta and avocado",
  "image": "http://www.marinmamacooks.com/wp-content/uploads/2014/01/quinoa-wrap-with-black-beans-feta-and-avocado1-640x635.jpg",
  "href": "http://marinmamacooks.com/2014/01/quinoa-wrap-with-black-beans-feta-and-avocado/",
  "extension": "Chrome",
  "firstAdded": "2017-01-02T21:15:57.673000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "I usually make the avocado-tahini dip and quinoa ahead of time, so all I have to do is assemble the wrap. But, let's just go through the steps as if you're making this all at the same time.",
    "First, start off by making up the avocado tahini dip. BTW, this dip is amazing on its own served up with some tortilla chips.",
    "Peel and dice your avocado, measure out the ⅓ cup tahini, squeeze up your 3 tablespoons lemon juice and wash and mince your cilantro leaves.",
    "Combine the avocado, tahini, lemon juice, cumin, cilantro and sea salt in a mini prep or food processor and puree until smooth.",
    "Make sure to scrape down the sides one or two times so that everything gets mixed in. The mixture will be pretty thick and chunky at this point.",
    "Add in the ¼ cup water and puree again until blended and smooth. The water helps to get the dip to a creamier consistency. Feel free to add a bit more water to get the dip to a consistency that you like. I found that using ¼ cup or splash more was perfect.",
    "The dip can be stored in a well sealed container in the refrigerator for up to 4 days.",
    "Next, let's make up your quinoa. Bring the 1 cup well rinsed quinoa and 2 cups water to a boil in a medium sauce pan. Once the quinoa has come to a boil, give it a stir, cover it, and reduce the heat to simmer. Cook the quinoa until all the water is absorbed, about 10-15 minutes. Note: Please check your package of quinoa for cooking instructions, as they all vary.",
    "The quinoa is done when its tender and you can see the little quinoa curlicues.",
    "Now, let's assemble the wrap!",
    "Assembling the wrap is all a personal preference. Some of you are going to want huge wraps and others of you are going to want a smaller wrap. So with that being said, take the amount of quinoa that you want to put in your wrap and put it in a small bowl, add in some black beans and then heat up the quinoa and black bean mixture either via the stove top or microwave.",
    "Mix in some of the avocado tahini dip to the quinoa and black bean mixture. The amount of avocado-tahini dip you add in is to taste. I like to add in enough to make the quinoa a bit creamy. The more avocado-tahini dip you add, the more flavor the quinoa will have.",
    "Note: If I'm going to microwave the quinoa mixture, then I just add in the avocado-tahini dip at the same time as the black beans.",
    "You can heat up your tortilla and melt your cheese anyway you wish. This is just what I do. Get out a tortilla and place it in a dry skillet over medium heat. Add to one half of the tortilla the Monterey jack cheese and feta. Flip the other half over like you're making a quesadilla, and let the cheese melt.",
    "Take the cheesy tortilla and place it on a plate. Top the tortilla with some spinach.",
    "Add the quinoa mixture and then top it off with some fresh diced avocado.",
    "Wrap it up like a burrito and enjoy!",
    "I've also enjoyed this quinoa salad sans the wrap. I've taken the black bean and quinoa mixture and put it in a bowl and topped it with some diced avocado and feta cheese. It's good anyway you eat it really."
  ],
  "ingredients": [
    "0",
    "1 cup of dry quinoa, or feel free to use any leftover quinoa you have - Note: This makes up a full batch of quinoa, but I use it up all week in this wrap, as well as other dishes.",
    "2 cups filtered water",
    "1 15-ounce can of black beans, drained - You will also store any unused black beans for future wraps",
    "1 ripe avocado",
    "6-8 spinach leaves",
    "Monterey jack cheese to taste",
    "feta cheese to taste",
    "large (9-inch) multi-grain or spinach tortilla - You could also skip the tortilla and wrap it in lettuce or collard green, or just mix the quinoa mixture with some spinach leaves",
    "1",
    "1 medium ripe avocado, peeled and diced",
    "⅓ cup well stirred tahini – make sure this is a level cup, as too much tahini will overpower the dip",
    "3 tablespoons fresh lemon juice (approx. 1 lemon)",
    "½ teaspoon ground cumin",
    "2 tablespoons cilantro, minced",
    "½ teaspoon coarse sea salt",
    "¼ cup filtered water"
  ],
  "__v": 1
}