{
  "hash": "3587a98f5a1ed1cfc3ed8f7749ef8574335ae1a0",
  "title": "Tex Mex Frito Slab Pie",
  "image": "https://www.washingtonpost.com/rf/image_982w/2010-2019/WashingtonPost/2017/02/15/Food/Images/food_006.JPG",
  "href": "https://www.washingtonpost.com/recipes/turkey-chili-frito-slab-pie/15753/?tid=a_inl&utm_term=.494a180b6474",
  "extension": "Firefox",
  "firstAdded": "2017-12-03T02:03:04.202000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the filling: Preheat the oven to 400 degrees.",
    "For the chili: Cook the chopped bacon or pancetta in a large, straight-sided skillet over medium heat until it is just crisp. Add the onions and cook until translucent, then add the ground pork and beef, breaking it up with two forks. Cook until no pink remains in the meat, about 6 minutes, then pour off and discard most of the accumulated fat.",
    "Add the water, tomato paste, adobo sauce, ancho chile powder, salt, paprika, cumin and cinnamon. Increase the heat to medium-high and bring to a boil, then reduce the heat to low and cook for about 10 minutes. Stir in the scallions and cilantro; remove the pan from the heat. Let the mixture cool while making the corn bread batter.",
    "For the crust: Brush the rimmed baking sheet with butter, especially in the corners and up the sides.",
    "Prepare the corn muffin mixes with the eggs and milk according to the package directions, stirring with a fork until just combined in a mixing bowl. Lumps are okay.",
    "Pour the batter into the baking sheet or jellyroll pan, using an offset spatula to spread it evenly into the corners. Scatter the chili filling evenly across the cornmeal batter, cover with the grated cheese and then top with the crushed Fritos. Don’t worry too much; it’s all going to come together.",
    "Bake (middle rack) for 22 to 24 minutes, until the corn bread is pulling away from the corners and the Fritos are golden brown. If it looks like the crust will bubble over the edges, place a large sheet of aluminum foil or another baking sheet on the rack underneath.",
    "Serve hot, warm or at room temperature. Set out the chopped cilantro, sour cream or Mexican crema, jalapeños and hot sauce.",
    "Make Ahead: This recipe may be baked earlier in the day, refrigerated and then reheated to serve. Starting with a room-temperature pie, cover with aluminum foil and warm in a 350-degree oven for 12 to 15 minutes. The chili can be refrigerated for up to 3 days in advance, or frozen for up to a month. Defrost before using."
  ],
  "ingredients": [
    "0",
    "For the chili",
    "1/2 cup chopped smoky bacon or pancetta",
    "2 medium onions, diced",
    "1 pound lean ground pork",
    "1 pound lean ground beef, preferably ground chuck",
    "1 cup water",
    "4 tablespoons tomato paste",
    "1 1/2 tablespoons sauce from canned chiles in adobo (see headnote)",
    "1 tablespoon ancho chile powder",
    "1 1/2 teaspoons kosher salt",
    "1 teaspoon Spanish smoked paprika (pimenton)",
    "1 teaspoon ground cumin",
    "1/4 teaspoon ground cinnamon",
    "1/2 cup chopped scallions (white and light-green parts)",
    "1/4 cup packed cilantro leaves, chopped"
  ],
  "__v": 2
}