{
  "hash": "3111fdbc46ca1a09c843ec84cb63830ad654ec68",
  "title": "Angela (Oh She Glows)",
  "image": "",
  "href": "http://ohsheglows.com/2016/06/15/one-bowl-jumbo-chocolate-chunk-cookies-vegan-gf/",
  "extension": "Chrome",
  "firstAdded": "2017-08-18T02:43:19.594000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350°F (180°C) and line a very large (approx. 21 by 15 inch) baking sheet with parchment paper.",
    "In a large bowl, stir together the wet ingredients (almond butter, maple syrup, oil, and vanilla) until completely smooth.",
    "Stir the dry ingredients (oats, oat flour, arrowroot, almond flour, baking soda, and salt) into the wet mixture, one by one, until thoroughly combined. The dough will be a bit wet/oily, but this is normal.",
    "Chop the chocolate into small chunks. Set aside 3 tablespoons (for topping the cookie dough later), and stir the rest of the chocolate into the batter until combined.",
    "Using a large retractable cookie scoop (or simply a spoon and your hands), scoop mounds of dough (about 2 1/2 tablespoons of dough per cookie). Add each onto the baking sheet, about 3 inches apart, as they'll spread a lot while baking.",
    "Press the remaining 3 tablespoons of chocolate onto the tops of the cookie dough mounds, evenly distributed. (Reshape the cookie dough mounds if they flatten a bit.)",
    "Bake for 8 to 10 minutes (I prefer 8 1/2 to 9 minutes for gooey and soft cookies), until the cookies are spread out. If you prefer a crispy cookie, bake for about 12 minutes.",
    "Cool the cookies directly on the baking sheet for about 5 to 6 minutes. The cookies will be super delicate until they are cooled. Using a spatula, gently transfer each cookie directly onto a cooling rack for another 10 minutes, where they'll firm up even more. (It's normal to have a small amount of oil on the bottom of the cookies due to the almond butter. If this bothers you, simply place them on a couple sheets of paper towel.) Serve and enjoy! Allow the cookies to cool completely before storing."
  ],
  "ingredients": [
    "0",
    "1/2 cup (120 g) natural smooth almond butter (no subs)*",
    "1/4 cup plus 3 tablespoons (105 mL) pure maple syrup",
    "3 tablespoons (45 mL) virgin coconut oil, softened but not hot**",
    "1/2 teaspoon pure vanilla extract",
    "1/2 cup (50 g) gluten-free rolled oats",
    "1/4 cup plus 2 tablespoons (50 g) gluten-free oat flour",
    "1/4 cup (33 g) arrowroot flour/starch",
    "1/4 cup (25 g) almond flour",
    "1/2 teaspoon baking soda",
    "1/2 teaspoon pink Himalayan salt",
    "(150g) 55% non-dairy dark chocolate (about 1 1/2 bars)***"
  ],
  "__v": 1
}