{
  "hash": "f338f41c325e22fd9ce1c911f8790ef1224310bf",
  "title": "No Bake Golden Oreo Lemon Dessert",
  "image": "http://www.crazyforcrust.com/wp-content/uploads/2014/03/Lemon-Dessert-6-of-6.jpg",
  "href": "http://www.crazyforcrust.com/2014/03/bake-golden-oreo-lemon-dessert/",
  "extension": "Firefox",
  "firstAdded": "2015-09-27T17:20:32",
  "users": [
    null
  ],
  "keywords": [
    "golden",
    "oreos",
    "divided",
    "butter",
    "soft",
    "box",
    "cheesecake",
    "lemon",
    "coconut",
    "vanilla",
    "pudding",
    "milk",
    "whipped",
    "regular",
    "fatfree",
    "curd",
    "jarred"
  ],
  "directions": [
    "0",
    "Directions:",
    "Place 20 cookies in a gallon sized sandwich bag. Seal the bag except for one corner so air can escape and roll with a rolling pin to coarsely crush the cookies. Place cookies and butter in a large bowl. Mix with a spoon (or your hands) until the butter has been worked through. Place in the bottom of a 9x9” pan. Note: this is not a crust in the traditional sense. It’s loose and not compacted.",
    "Wipe out your bowl and add pudding mix and milk. Whisk until smooth and let sit for 2 minutes. Fold in a heaping 1 cup (about 1 1/2 cups) of whipped topping. Carefully spread over cookies in pan.",
    "Crush remaining cookies in a new gallon sized sandwich bag. Sprinkle half over pudding. Reserve the rest for the topping.",
    "Mix lemon curd gently with 1 even cup of whipped topping. Spread over pudding.",
    "Spread remaining whipped topping over the curd mixture. Sprinkle with remaining cookies. Cover with plastic wrap and refrigerate at least 8 hours before serving."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "36 Golden Oreos, divided",
    "3 tablespoons butter, very soft",
    "1 box (3.4 ounces) cheesecake, lemon, coconut, or vanilla pudding",
    "1 cup milk",
    "4 cups whipped topping (about 12 ounces, from two 8-ounce packages), regular or fat-free",
    "1 cup lemon curd (jarred or homemade)"
  ],
  "__v": 1
}