{
  "hash": "3cee91ba56b29055e604ceef42c5183b6c1d6322",
  "title": "Meatballs & pasta",
  "image": "//img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/331_1_1436865256.jpg?tr=w-414,",
  "href": "https://www.jamieoliver.com/recipes/pasta-recipes/meatballs-and-pasta/",
  "extension": "Chrome",
  "firstAdded": "2018-11-22T16:16:58.715000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Wrap the crackers in a tea towel and smash up until fine, breaking up any big bits with your hands, then tip into a large bowl.",
    "Pick and finely chop the rosemary, then add to the bowl with the mustard, minced meat and oregano.",
    "Crack the egg into the bowl, then add a good pinch of sea salt and black pepper.",
    "With clean hands, scrunch and mix everything up well. Divide into 4 large and balls, then with wet hands divide each ball into 6 and roll into little meatballs – you should end up with 24.",
    "Place the meatballs onto a plate, drizzle with oil and jiggle about to coat, then cover and place in the fridge until needed – this will help to firm them up.",
    "Pick the basil leaves, keeping any smaller ones to one side for later. Peel and finely chop the onion and the garlic, and trim and finely slice or crumble the chilli.",
    "Heat 2 tablespoons of oil in a large frying pan over a medium heat, add the onion and cook for 7 minutes, or until softened and lightly golden.",
    "Add the garlic and chilli, and as soon as they start to get some colour add the large basil leaves.",
    "Tip in the the tomatoes, breaking them up with the back of a spoon, then add the balsamic vinegar, and season to taste. Bring to the boil, then reduce to a simmer until needed, stirring regularly.",
    "Meanwhile, heat 1 tablespoon of oil in another large frying pan over a medium heat, add the meatballs and cook for 8 to 10 minutes, or until cooked through, turning regularly To check if they’re cooked, cut one opening – there should be no sign of pink.",
    "Once cooked, add the meatballs to the sauce and simmer while you cook the pasta.",
    "Cook the pasta in boiling salted water according to the packet instructions, then drain, reserving a mugful of cooking water. Return the pasta to the pan.",
    "Spoon half the tomato sauce over the pasta and toss together, adding a little splash of reserved cooking water to loosen, if needed",
    "Transfer to a large platter or divide between bowls, serving the remaining sauce and meatballs on top. Add a fine grating of Parmesan and scatter over the reserved basil, then tuck in."
  ],
  "ingredients": [
    "0",
    "12 Jacob's cream crackers",
    "4 sprigs of fresh rosemary",
    "2 heaped teaspoons Dijon mustard",
    "500 g quality minced beef, pork, or a mixture of the two",
    "1 heaped tablespoon dried oregano",
    "1 large free-range egg",
    "olive oil",
    "1 bunch of fresh basil",
    "1 medium onion",
    "2 cloves of garlic",
    "½ a fresh or dried red chilli",
    "2 x 400 g tin of plum tomatoes",
    "2 tablespoons balsamic vinegar",
    "400 g dried spaghetti or penne",
    "Parmesan cheese"
  ],
  "__v": 1
}