{
  "hash": "1f680986cf5fc125817bf5097bfa9f5c404298ca",
  "title": "Crispy Chicken Dippers",
  "image": "http://media.paleomg.com/2015/11/IMG_8252.jpg",
  "href": "http://paleomg.com/crispy-chicken-dippers/",
  "extension": "Chrome",
  "firstAdded": "2016-02-06T16:18:18.699000",
  "users": [
    null
  ],
  "keywords": [
    "boneless",
    "skinless",
    "chicken",
    "breast",
    "strips",
    "size",
    "egg",
    "whisked",
    "coconut",
    "almond",
    "flour",
    "salt",
    "oil",
    "greasing",
    "pan",
    "maple",
    "mustard",
    "paleo",
    "chef",
    "dipping"
  ],
  "directions": [
    "0",
    "Preheat oven to 350 degrees.",
    "Cut chicken into strips.",
    "In a shallow bowl, whisk together egg. In another shallow bowl, mix together coconut, almond flour and salt.",
    "Dredge chicken strips in the whisked egg, then straight to the coconut mixture. Coat on all sides then place on a plate. Repeat with all chicken strips.",
    "Place a large pan over medium heat. Add a tablespoon or two to the pan. Once the pan is super hot, add the strips to the pan without crowding it. Cook for about 1 minute on both sides. You may need to do this in 2-3 batches depending how big the strips are.",
    "Place the strips on a cooling rack that has been placed on top of a baking sheet. This will help the chicken strips cook on both sides without getting soggy. If you don't have a cooling sheet, you will just have to flip them half way through the baking.",
    "Place baking sheet in the oven and cook for 10-12 minutes or until no pink remains inside the chicken.",
    "Let cool on baking sheet before serving. Dip them into maple mustard sauce!"
  ],
  "ingredients": [
    "0",
    "1 pound boneless, skinless chicken breast, cut into strips (your choice is size)",
    "1 egg, whisked",
    "1 cup unsweetened shredded coconut",
    "½ cup almond flour",
    "pinch of salt",
    "coconut oil, for greasing pan",
    "Maple Mustard Paleo Chef Sauce (for dipping)"
  ],
  "__v": 1
}