{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 425 degrees F.",
    "Scrub potatoes, then poke each several times with a fork (making sure to press well into the potato flesh).",
    "Place the potatoes on a baking tray, and bake for 50-60 minutes, until tender. Once cooked, remove from the oven.",
    "While the potatoes are cooking, prep the kale leaves: Wash and dry, remove and discard the thick inner stems, and roughly chop the leaves.",
    "Cook in a pot of rapidly boiling water for 2 minutes, then drain and run under cold water to stop cooking process. Set cooked kale aside.",
    "Slice potatoes lengthwise, and scoop the insides out into a blender, leaving a good 1/4 inch of potato flesh still attached to the potato skin (otherwise, your potato might fall apart). (Note: If you don't have a blender, you can use a hand blender, a food processor, or simply mash the ingredients with a fork!)",
    "Add the broccoli, kale, and milk to the blender and blend until smooth. Season to taste with salt and pepper.",
    "Scoop the pureed broccoli-kale-potato mixture back into the potato skins. Sprinkle with the grated cheddar cheese, return to the baking sheet, and bake for another 10 minutes.",
    "Change the oven setting to broil, and continue cooking on high for 3 minutes to brown the cheese. Remove from the oven and serve!"
  ],
  "firstAdded": "2014-08-06T21:59:51.174000",
  "hash": "23dd42d4c49e827fb1f79940203e303779884a58",
  "href": "http://greatist.com/health/twice-baked-broccoli-and-kale-stuffed-potatoes",
  "image": "http://greatist.com/sites/default/files/styles/article-content-732/public/Twice-Baked%20Kale-and-Broccoli-Stuffed%20Potatoes.jpg?itok=hxbSiuZl",
  "ingredients": [
    "0",
    "2 russet potatoes",
    "1 cup cooked broccoli (roasted or steamed is fine)",
    "6 large tuscan kale leaves",
    "1/2 cup milk",
    "2–3 tablespoons cheddar cheese, grated",
    "Salt and pepper, to taste"
  ],
  "keywords": [
    "russet",
    "potatoes",
    "broccoli",
    "roasted",
    "steamed",
    "tuscan",
    "kale",
    "leaves",
    "milk",
    "cheddar",
    "cheese",
    "salt",
    "pepper"
  ],
  "title": "Twice-Baked Broccoli-and-Kale-Stuffed Potatoes",
  "users": [
    null
  ]
}