{
  "hash": "ef3305679efac7ade865e8985068ae63d3556777",
  "title": "Stir-Fried Bok Choy",
  "image": "http://thewoksoflife.com/wp-content/uploads/2015/12/bok-choy-stir-fry-6.jpg",
  "href": "http://thewoksoflife.com/2015/12/stir-fried-bok-choy-recipe/",
  "extension": "Chrome",
  "firstAdded": "2017-04-30T03:31:47.688000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Discard any yellowing leaves from your bok choy, and slice it at a slight angle into 1-inch pieces. When you reach the tough base of the leaf, discard. Throw your bok choy into a large bowl with lots of cold water. Agitate the veggies with your hands and/or use your faucet sprayer to loosen any dirt. Soak for 5 to 10 minutes.",
    "Scoop the veggies into a colander and rinse the bowl clean of any sand. Repeat the process until you don’t see any dirt on the leaves or at the bottom of your bowl. We tend to wash leafy greens three times, and then we use the water to water plants! Once the washed bok choy is in a colander, give it a good shake to release any excess water.",
    "Heat your wok or large pan over low heat and add the oil. Immediately add the ginger first (if using) and then the garlic (if you don't feel like mincing garlic, you can use a garlic press, one of our most often used kitchen tools! It gives the dish a much more garlicky flavor.).",
    "Once you have the ginger and garlic in the pan, add the veggies and turn the heat up to the highest setting. Stir-fry using a scooping motion so the ginger, garlic and oil are evenly distributed among the vegetables. This first 30 seconds is a critical time not to let your aromatics burn and to cook your veggies evenly.",
    "Next, add salt, sugar, sesame oil, white pepper, and the MSG and hot chicken stock if using. (Using hot chicken stock is important to maintaining the temperature of the wok). Stir fry uncovered for another 1-2 minutes. Plate and serve immediately. You may have a little or a lot of liquid, depending upon the heat of your stove and how much water was left in your vegetables after washing, so use a deep dish for serving. That veggie soup liquid is full of vitamins and is awesome when poured over a bit of rice!"
  ],
  "ingredients": [
    "0",
    "2 pounds fresh Bok Choy",
    "3 tablespoons canola oil or light olive oil",
    "¼ teaspoon freshly grated ginger (optional)",
    "3 cloves garlic, minced",
    "½ teaspoon salt",
    "Pinch of sugar",
    "½ teaspoon sesame oil",
    "Pinch of white pepper",
    "⅛ teaspoon of MSG (totally optional)",
    "2 tablespoons hot chicken stock (optional)"
  ],
  "__v": 1
}