{
  "hash": "15fef255bccfd521b08acccca6307ca7a58b4893",
  "title": "traditional greek pita bread",
  "image": "https://www.halfbakedharvest.com/wp-content/uploads/2013/02/Traditional-Greek-Pita-Bread-1.jpg",
  "href": "https://www.halfbakedharvest.com/traditional-greek-pita-bread/",
  "extension": "Chrome",
  "firstAdded": "2019-03-18T08:13:55.456000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Mix the water and yeast together in the bowl of a stand mixer (a large bowl will also work if you do not have a mixer), and let sit for about five minutes until the yeast is dissolved. Add 2 1/2 cups of the flour (saving the last half cup for kneading), salt, and olive oil. If using a stand mixer attach the dough and need the dough on medium speed for 8 minutes, adding more flour until you have a smooth dough. If using your hands sprinkle a little of the extra flour onto your clean work surface and turn out the dough. Knead the dough for about 5-7 minutes, until the dough is smooth and elastic. Add more flour as needed to keep the dough from sticking to your hands or the work surface, but try to be sparing. It's better to use too little flour than too much. If you get tired, stop and let the dough rest for a few minutes before finishing kneading.",
    "Clean the bowl you used to mix the dough and run it with a little olive oil. Set the dough in the bowl and turn it until it's coated with oil. Cover with a clean dishcloth or plastic wrap and let the dough rise until it's doubled in bulk, about 1 hour.",
    "At this point, you can refrigerate the pita dough until it is needed. You can also bake one or two pitas at a time, saving the rest of the dough in the fridge. The dough will keep refrigerated for about a week.",
    "Gently deflate the dough and turn it out onto a lightly floured work surface. Divide the dough into 8 equal pieces and gently flatten each piece into a thick disk. Using a floured rolling pin, roll one of the pieces into a circle 8-9 inches wide and about a quarter inch thick. Lift and turn the dough frequently as you roll to make sure the dough isn't sticking to your counter. Sprinkle with a little extra flour if it starting to stick. If the dough starts to spring back, set it aside to rest for a few minutes, then continue rolling. Repeat with the other pieces of dough. (Once you get the hang of it you can be cooking one pita while rolling the next one out.)",
    "Warm a cast iron skillet over medium-high heat (you want a hot pan). Drizzle a little oil in the pan and wipe off the excess.Lay a rolled-out pita on the skillet and bake for 30 seconds, until you see bubbles starting to form. Flip and cook for 1-2 minutes on the other side, until large toasted spots appear on the underside. Flip again and cook another 1-2 minutes to toast the other side. The pita should start to puff up during this time; if it doesn't or if only small pockets form, try pressing the surface of the pita gently with a clean towel. Keep cooked pitas covered with a clean dishtowel while cooking any remaining pitas.",
    "These are best eaten fresh, but will keep in a ziplock bag for a few days or in the freezer."
  ],
  "ingredients": [
    "0",
    "1 cup hot water but not boiling",
    "2 teaspoons active dry or instant yeast",
    "2 1/2 - 3 cups all-purpose flour",
    "2 teaspoons salt",
    "1 tablespoon olive oil"
  ],
  "__v": 1
}