{
  "hash": "a1921a29459d1448adaf5b6927eade82554cb7b3",
  "title": "Lasagne",
  "image": "http://recipe-folder.com/img/recipe-images/010/012/3768668610.jpg",
  "href": "http://recipe-folder.com/recipe/5e6d733e48b07208212957ab",
  "extension": "User Added",
  "firstAdded": "2020-03-15T00:13:50.640000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Step 1",
    "1",
    "Prepare lasagna according to package directions; drain and rinse with cold water.",
    "2",
    "Step 2",
    "3",
    "Stir together ricotta, egg, and 4 cups of the mozzarella in a large bowl until combined; set aside.",
    "4",
    "Step 3",
    "5",
    "Heat a large deep skillet over medium-high. Add ground beef, kosher salt, and pepper; cook, stirring to crumble with the back of a wooden spoon until evenly browned, about 10 minutes. Drain beef, and return to skillet. Stir in marinara and pink salt, and simmer, stirring often, 5 minutes. Remove from heat.",
    "6",
    "Step 4",
    "7",
    "Spread 1 cup meat sauce evenly on bottom of a deep aluminum lasagna pan. Arrange 4 lasagna noodles over sauce, and top evenly with half of the ricotta mixture. Top with 4 more noodles and half of remaining meat sauce. Arrange 4 more noodles over sauce, and spread remaining ricotta mixture evenly on top. Top with remaining 4 noodles, remaining meat sauce, and remaining shredded mozzarella.",
    "8",
    "Step 5",
    "9",
    "Cover with aluminum foil, and bake in preheated oven 45 minutes. Remove foil, and continue to bake until golden and bubbly, about 15 minutes. Let stand 10 to 15 minutes before serving."
  ],
  "ingredients": [
    "0",
    "Fresh lasagna noodles",
    "1",
    "Whole-milk ricotta cheese",
    "2",
    "1 large egg",
    "3",
    "Mozzarella cheese, shredded",
    "4",
    "Ground beef mince",
    "5",
    "1 1/2 teaspoons kosher salt",
    "6",
    "1/2 teaspoon black pepper",
    "7",
    "Marinara sauce",
    "8",
    "1/2 teaspoon pink Himalayan salt"
  ],
  "__v": 1,
  "hidden": true
}