{
  "hash": "33551c750e2f7e8a695c0c0a0b9f4526afac4379",
  "title": "RECIPE FOR OVEN BAKED FISH FINGERS",
  "image": "http://food-4tots.com/wp-content/uploads/2011/08/P6192245-copy.jpg",
  "href": "http://food-4tots.com/2011/08/10/oven-baked-fish-fingers/2/",
  "extension": "",
  "firstAdded": "2017-10-30T07:49:52.268000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 200°C.",
    "Pat the fish dry with paper towels and cut into strips (1/2 inch thick x ¾ inch width). Season with salt and pepper.",
    "Set up your assemble line. Get ready with 3 bowls (even plates or small pan sheets are possible) which are large enough for coating the strips.",
    "The first one is for flour.",
    "The second one (preferably use bowl) is for egg. Crack an egg and whisk well. You may want to add a little bit (eg ¼ tsp) of milk or water to dilute the beaten egg.",
    "The third one is for breadcrumb mixture. Mix breadcrumbs, Parmersan cheese, paprika, garlic powder and black pepper together.",
    "Toss each strip in the flour and shake off any excess. To minimize any messiness, continue for the remaining strips before moving on to the next step.",
    "Next, dip the strip into the egg mixture and allow extra egg liquid to drip back into the bowl.",
    "Then coat the strip with the breadcrumb mixture. Slightly press the strip into the crumbs to make sure it is well coated. Let it stand for 5-10 minutes. It will help the coating adhere to the strip better.",
    "Prepare a baking sheet (I lined it with non-stick parchment paper but it’s optional). Brush/ spray some oil on the sheet/paper.",
    "Arrange strips in a single layer on the prepared baking tray. Drizzle or spray some oil over the strips.",
    "Bake for 8-10 minutes or until the crumbs are golden brown and the fish is cooked through (eg flakes easily). Turning halfway through. Adjust the baking time according to the thickness of your fillet. Do not overcook the fish as it will be dry and hard.",
    "Transfer to serving plates and allow it to cool a little before serving.",
    "Best to dip in some sauce such as ketchup, sweet chilli sauce or tartar sauce."
  ],
  "ingredients": [
    "0",
    "380g skinless fish fillets (such as sole, flounder, tilapia or other firm white fish) [note 1]",
    "5 tbsp plain flour",
    "1 large egg, beaten",
    "20g dried breadcrumbs (normal)",
    "20g panko breadcrumbs (Japanese breadcrumbs), refer to photo at the right [note 4]",
    "20g Parmesan cheese, freshly grated",
    "1 tsp garlic powder",
    "¼ tsp paprika",
    "Pinch of salt",
    "Dash of freshly ground black pepper"
  ],
  "__v": 1
}