{
  "hash": "c578ed5bc9351d991c4567e79b405a52304a2ff9",
  "title": "Chicken in Green Salsa Tamal",
  "image": "https://patijinich.com/wp-content/uploads/2015/04/martin090510patricia0832-912x622.jpg",
  "href": "https://patijinich.com/recipe/chicken-in-green-salsa-tamal/",
  "extension": "Chrome",
  "firstAdded": "2017-10-29T11:56:11.261000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To make the tamal dough or masa: Place lard, vegetable shortening or seasoned oil in an electric mixer and beat until very light, about 1 minute. Add salt and 1 teaspoon of cold water and continue beating until it is white and spongy, a couple more minutes. Add the baking powder and then alternate adding the instant corn masa and the chicken broth a little at a time. Continue beating until dough is homogeneous and as fluffy as can get. You know the tamal masa is ready when you can drop 1/2 teaspoon of the masa in a cup of cold water and it floats.",
    "To make the filling: Combine the salsa verde with the cooked shredded chicken.",
    "To assemble the tamales: Soak the dried corn husks in hot water for a couple minutes, or until they are pliable, and drain. Lay out a corn husk with the tapering end towards you. Spread about 3 tablespoons of masa into about a 2 to 3-inch square, the layer should be about 1/4-inch thick, leaving a border of at least 1/2-inch on the sides. Place 1 tablespoon of filling in the middle of the masa square.",
    "Pick up the two long sides of the corn husk and bring them together (you will see how the masa starts to swaddle the filling) and fold the folded sides to one side, rolling them in same direction around tamal. Fold up the empty section of the husk, with the tapering end, from the bottom up. This will form a closed bottom and the top will be left open.",
    "Assemble all the tamales and place them as vertically as you can in a container.",
    "To prepare the tamalera or steamer: Place water in the bottom pan of a steamer (so that water is under the steamer) and bring it to a simmer. Line the steamer with one or two layers of soaked corn husks.",
    "To cook the tamales: When you have all tamales ready, place them, again as vertically as you can, into the prepared steamer with the open end on top. If there is space left in the steamer, tuck in some corn husks, so the tamales won’t dance around. Cover with more corn husks, and steam covered with a lid for 50 minutes to an hour. You know the tamales are ready when they come easily free from the husks. They will still be moist, and as they are released from the husks, you will see the moisture, like when you remove good moist muffins from their paper baking cups.",
    "Finished tamales will stay warm for about 2 hours in the steamer. They can be made ahead several days before and stored in refrigerator, well wrapped. They can also be frozen for months. In either case, reheat in a steamer. For refrigerated tamales, it will take about 20 minutes and about 45 minutes for frozen tamales.",
    "Note: To make seasoned oil, in a medium saucepan, heat 1 cup vegetable oil over medium heat, add a thick slice of onion and 4 garlic cloves. Cook for 15 minutes until completely browned. Remove onion and garlic before using the oil."
  ],
  "ingredients": [
    "0",
    "For the tamal dough or masa:",
    "3/4cuplard, vegetable shortening, or seasoned oil(see note at end of recipe)",
    "1/2teaspoonkosher or coarse sea saltor to taste",
    "1teaspooncold water",
    "1teaspoonbaking powder",
    "1pound (about 3 1/4 cups)instant corn masa flour(masa harina) for tortillas or tamales",
    "3 1/2cupshomemade chicken brothadd more if needed",
    "For the filling:",
    "1batchsalsa verde",
    "2cupsshredded cooked chickenfrom homemade chicken broth",
    "To assemble the tamales:",
    "25dried corn huskssoaking in hot water"
  ],
  "__v": 1
}