{
  "hash": "06717780ee7be6156be4133381bfedab2b63e69e",
  "title": "Caramel Apple Pecan Bars",
  "image": "http://thehealthygflife.com/wp-content/uploads/2013/11/Caramel-Apple-Bars-3_TheHealthyGFLife.jpg",
  "href": "http://thehealthygflife.com/caramel-apple-pecan-bars-paleogfdf/",
  "extension": "Chrome",
  "firstAdded": "2016-08-18T20:26:18.872000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 375-degrees. Line an 8x8 glass baking dish with parchment paper. Grease the paper lightly.",
    "In a medium bowl, combine dry ingredients.",
    "In the bowl of a stand mixer, combine wet ingredients. Mix well.",
    "With the mixer on low, slowly add the dry ingredients to the wet mixture until fully combined.",
    "Stir in chopped apples. Spoon batter into prepared baking dish, smoothing the top evenly.",
    "Bake 30 minutes (or 35-39 if using flax gel instead of an egg) or until top is golden brown and the center springs back when touched.",
    "While the apple bars are baking, prepare the topping. In a small saucepan over medium heat, combine topping ingredients. Heat until it comes to a simmer. Continue to simmer, stirring occasionally, until thickened, 8-10 minutes. Remove from heat.",
    "When the apple bars are done, remove from the oven and evenly spread the caramel topping over the bars. Place back in the oven for 5-6 minutes until topping is bubbly.",
    "Cool bars in the baking dish for 1 hour on a wire rack. Cut the bars into 16 squares. Cover and refrigerate for 1 hour or until completely cooled. Remove bars from the fridge and baking dish and enjoy! Store leftovers in an airtight container in the fridge for up to 4 days."
  ],
  "ingredients": [
    "0",
    "3/4 C Chesnut Flour (I use RC Farms or Nuts.com)",
    "1 C Almond Flour (Honeyville or Nuts.com)",
    "1/3 C Arrowroot Starch",
    "1/4 tsp sea salt",
    "1 tsp baking powder",
    "1 tsp cinnamon",
    "1",
    "1 egg (or 1 TBSP flax meal mixed w/3 TBSP hot water - let sit 5 min. to gel)",
    "1/4 C pure grade B maple syrup",
    "1 tsp pure vanilla extract",
    "1/4 C water",
    "1/4 C coconut oil, melted",
    "2",
    "1 1/2 C peeled, cored & diced, Granny Smith apples",
    "3",
    "1 C coarsely chopped pecans",
    "2 TBSP organic palm shortening",
    "3/4 C pure grade B maple syrup",
    "2 TBSP coconut milk",
    "1/4 C coconut palm sugar"
  ],
  "__v": 1
}