{
  "hash": "bf3af1c4d5762d9be04a07d2ee85c580a3e4ab54",
  "title": "Lasagna by irish way",
  "image": "http://img.sndimg.com/food/image/upload/w_555,h_416,c_fit,fl_progressive,q_95/v1/img/recipes/13/33/06/picOkja0F.jpg",
  "href": "http://www.food.com/recipe/lasagna-the-irish-way-133306",
  "extension": "Chrome",
  "firstAdded": "2016-09-15T19:08:26.025000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350°F (175°C) Gas Mark 5.",
    "In a medium skillet over medium heat, cook the meat until brown. Once cooked, drain and leave to the side.",
    "Mix your ricotta, egg, basil, thyme, garlic and oregano and half of the mozzarella cheese.",
    "In a 9x13 baking dish with a little of the spaghetti sauce. Place three of the lasagne sheets over the sauce. Spread a layer of the cheese mixture and then a layer of the meat mixture over it and repeat until mixtures are all gone. Top the lasagne with the left over mozzarella and parmesan cheese.",
    "Cover with foil and bake in a preheated oven for 30 minutes, remove foil and bake for a further 15 minutes until the cheese browns and the lasagne appears bubbly.",
    "1",
    "Take a wine glass and pour enough of the coffee to fill it just over half way.",
    "Add the sugar and stir until it dissolves.",
    "Add the whisky and stir.",
    "Slowly pour a thick layer of double cream, over the back of a teaspoon, on to the top of the coffee so that it floats on top.",
    "Do NOT stir the coffee, but drink it through the cream.",
    "2",
    "In a 7 to 8-quart kettle simmer lamb, parsley, thyme, and salt and pepper to taste in 4 cups broth, covered, 1 1/2 hours.",
    "To lamb mixture add potatoes, onion, carrots, celery, and remaining 2 cups broth and simmer, covered, 1 hour.",
    "In a small bowl whisk together flour and oil until smooth and stir into simmering stew until well incorporated.",
    "Simmer stew, uncovered, until thickened, 3 to 5 minutes, and season with salt and pepper."
  ],
  "ingredients": [
    "0",
    "1 lb real irish minced beef",
    "1 pint ricotta cheese",
    "1 egg, beaten",
    "1 pinch dried basil",
    "1 pinch dried thyme",
    "1 pinch dried oregano",
    "2 garlic cloves, crushed",
    "8 ounces shredded mozzarella cheese",
    "1 (8 ounce) jar spaghetti sauce",
    "12 lasagna sheets",
    "3⁄4 cup parmesan cheese",
    "1",
    "1 cup strong black hot coffee",
    "1 -2 teaspoon sugar",
    "25 ml measure Irish whiskey",
    "2 tablespoons double cream",
    "2",
    "3 lbs boneless lamb shoulder, trimmed and cut into 1-inch pieces",
    "1 1⁄2 tablespoons minced fresh parsley leaves",
    "1 teaspoon dried thyme, crumbled",
    "6 cups chicken broth",
    "3 lbs boiling potatoes, peeled and quartered",
    "1 large onion, finely chopped",
    "1 lb carrot, peeled and cut into 1/2-inch pieces",
    "6 stalks celery, trimmed and ribs cut into 1/2-inch pieces",
    "6 tablespoons all-purpose flour",
    "1⁄4 cup vegetable oil"
  ],
  "__v": 1
}