{
  "hash": "e063fb178a343295083a44bdf50f54bc3a1e088e",
  "title": "Creole Chicken and Sausage Jambalaya",
  "image": "http://creolecontessa.com/wp-content/uploads/2013/06/ccccc7-179edited1.jpg",
  "href": "http://creolecontessa.com/2013/06/creole-chicken-and-sausage-jambalaya/",
  "extension": "Chrome",
  "firstAdded": "2016-11-26T20:55:29.927000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Mix seasoning blend and set aside. Slice sausage and set aside. Rinse, pat dry chicken, dice into 2 inch chunks, place in a medium bowl. Season chicken with 1 tablespoonful of seasoning blend, mix well and set aside.",
    "In a large pot add butter and olive oil over medium heat. Add sausage and brown for 5 minutes. Add chicken and brown for 10 minutes more. Add all the vegetables to the pot, except garlic and season with half the seasoning blend.",
    "Cook for about 10 minutes. Add garlic and cook 1 minute more. Add rice to pot and toast for about 4 minutes. Add remaining seasoning blend and mix well. Add broth, tomatoes, and tomato sauce. Mix well. Bring mixture to a boil, stir, making sure to scrape the bottom of the pot. Discard bay leaf.",
    "Reduce heat to simmer, cover pot and cook for 30 minutes. After 30 minutes, stir mixture, scarping the bottom of the pot, cover and cook about 10 minutes more.",
    "Remove pan from heat and allow food to rest covered for about 10 more minutes. Serve with some nice toasted garlic bread and enjoy."
  ],
  "ingredients": [
    "0",
    "1 lb. andouille sausage, or smoked sausage, sliced",
    "1 lb. chicken breast, boneless, skinless, cut into 2″ chunks",
    "14 oz. can of diced tomatoes",
    "1 6oz. can tomato sauce",
    "32 oz. chicken broth",
    "3 cups long grain rice, uncooked",
    "1 bell pepper, diced",
    "1 white onion, diced",
    "3 stalks celery, diced",
    "4 cloves garlic, minced",
    "1/4 cup Italian parsley, chopped",
    "1/2 bunch of green onions",
    "1 bay leaf",
    "4 tablespoon butter, unsalted",
    "4 tablespoon extra virgin olive oil",
    "1 tablespoon creole seasoning",
    "1 tablespoon garlic powder",
    "1 tablespoon onion powder",
    "2 teaspoon black pepper",
    "1 teaspoon paprika",
    "pinch of cayenne pepper"
  ],
  "__v": 1
}