{
  "hash": "f52ddc311b9de1540c5323b1490ca197cf9e1ed1",
  "title": "Instant Pot Frittata Breakfast Casserole",
  "image": "https://peasandcrayons.com/wp-content/uploads/2018/05/instant-pot-frittata-breakfast-casserole-recipe--300x300.jpg",
  "href": "https://peasandcrayons.com/2018/05/instant-pot-frittata-breakfast-casserole.html",
  "extension": "Firefox",
  "firstAdded": "2019-04-04T20:44:14.564000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Spray your 7x3 dish/pan very well with cooking spray (avocado oil spray is my favorite). You can also rub the entire pan with butter if you prefer - just make sure to make that bad boy stick proof or you’ll be eating scrambled eggs for breakfast instead, lol! Cut a circle of parchment paper to line the bottom of the dish for extra easy removal. <-- I do this and love it!",
    "Crack eggs into a large bowl, chop your veggies, and measure out all your ingredients.",
    "Use an egg beater or whisk to whip your eggs until yolks and whites are fully incorporated. Next whisk in heavy cream. Season with salt and pepper and add your cheese. Set aside.",
    "Turn your Instant Pot on to sauté function and heat 1 tsp oil. Sauté onion and pepper until tender, adding garlic and spinach at the very end. Cook for an additional 30-60 seconds then scoop out the mixture and add to your prepared baking dish. Turn IP off.",
    "Give the insert a quick rinse on the inside to remove any stubborn veggie bits left behind, then return to your IP and add 1 cup water. Top with a handled trivet (I use the one my IP came with - super convenient and it has handles!) and, if yours does not have handles, feel free to make a makeshift handle/sling with folded aluminum foil.",
    "Whisk again to mix, then pour egg mixture into your baking dish. Place on top of trivet and lock the lid.",
    "Set to 6 minutes high pressure and make sure vent is in the sealed position.",
    "Once it beeps, allow a natural pressure release for 10-12 minutes before unlocking the lid.",
    "Open the lid, patting the top of the frittata dry with a paper towel as needed. Run a knife along the side to release, allow to cool slightly (it will shrink away from the sides as it cools), then turn it over onto a plate or serve it straight from the bowl by cutting and removing slices with a pie server.",
    "If desired, you can add toppings like I did! I love my frittata topped with an extra sprinkle of cheese!"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "6 Large Nellie’s Free Range Eggs",
    "1/4 cup diced red bell pepper",
    "1/3 cup minced yellow onion",
    "1/2 cup chopped spinach",
    "1 clove garlic, minced",
    "1 tsp oil",
    "1/3 cup heavy cream",
    "1/2 tsp salt",
    "1/8 tsp pepper",
    "1/2 cup grated white cheddar cheese",
    "1 cup water",
    "TOOLS NEEDED",
    "Instant Pot (I use the 6QT duo)",
    "Wire trivet/rack with handles (the one that came with the IP is great!)",
    "1.5 quart round baking dish (also works with a 7 x 3-inch cake pan)",
    "OPTIONAL TOPPINGS - choose your favorites!",
    "grated cheese",
    "sour cream or greek yogurt",
    "fresh chives or scallions",
    "chopped tomatoes or salsa"
  ],
  "__v": 1
}