{
  "hash": "1415a2a4d5ae979c736562c56c5e785695d8ef44",
  "title": "Marshmallow Fondant Recipe",
  "image": "https://media.cheftap.com/wp-content/uploads/beckyrasmussen/13b4f1ae-1025-4466-8c63-4bbf19f39fac.png",
  "href": "https://cheftap.com/recipes/marshmallow-fondant-recipe-37/",
  "extension": "Chrome",
  "firstAdded": "2018-11-12T19:04:00.312000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Dust your counter or a large cutting board with powdered sugar. Place the marshmallows and the water in a large microwave-safe bowl. Microwave on high for 1 minute, until the marshmallows are puffy and expanded.",
    "Stir the marshmallows with a rubber spatula until they are melted and smooth. If some unmelted marshmallow pieces remain, return to the microwave for 30 to 45 seconds, until the marshmallow mixture is entirely smooth and free of lumps. If you want colored or flavored fondant, you can add several drops of food coloring or extracts at this point and stir until incorporated. If you want to create multiple colors or flavors from one batch of fondant, do not add the colors or flavors now. Instead, refer to step 6 below for instructions.",
    "Add the powdered sugar and begin to stir with the spatula. Stir until the sugar begins to incorporate and it becomes impossible to stir anymore.",
    "Scrape the marshmallow-sugar mixture out onto the prepared work surface. It will be sticky and lumpy, with lots of sugar that have not been incorporated yet―this is normal. Dust your hands with powdered sugar and begin to knead the fondant mixture like bread dough, working the sugar into the marshmallow with your hands.",
    "Continue to knead the fondant until it smooths out and loses its stickiness. Add more sugar if necessary, but stop adding sugar once it is smooth―too much sugar will make it stiff and difficult to work with. Once the fondant is a smooth ball, it is ready to be used. You can now roll it out, shape it, or wrap it in cling wrap to use later. Well-wrapped fondant can be stored in a cool room or in the refrigerator and needs to be kneaded until supple before later use.",
    "If you want to add coloring or flavoring to your fondant, flatten it into a round disc. You might want to wear gloves to avoid getting food coloring on your hands during this step. Add your desired amount of coloring or flavoring to the center of the disc, and fold the disc over on itself so that the color or flavor is enclosed in the center of the fondant ball.",
    "Begin to knead the ball of fondant just like you did before. As you work it, you will begin to see streaks of color coming through from the center. Continue to knead until the streaks are gone and the fondant is a uniform color. Your fondant is now ready to be used or stored as outlined above."
  ],
  "ingredients": [
    "0",
    "8 ounces miniature marshmallows (4 cups not packed, or half of a 16-ounce bag)",
    "1 pound powdered sugar (4 cups), plus extra for dusting",
    "2 tbsp. water",
    "Food coloring or flavored extracts (optional)",
    "Unsaturated Fat0 g"
  ],
  "__v": 1
}