{
  "hash": "205f0edb826b84f7271761e790c21c1b1da03986",
  "title": "Fettuccine with Swiss Chard and Mushrooms (and Cannellini Beans)",
  "image": "",
  "href": "http://www.mayoclinic.org/healthy-lifestyle/recipes/fettuccine-with-swiss-chard-and-mushrooms/rcp-20049645",
  "extension": "",
  "firstAdded": "2016-06-10T01:19:03.905000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "In a large skillet, heat the olive oil over medium heat. Add the shallots, garlic and mushrooms. Saute the vegetables until tender, about 5 minutes. Add the Swiss chard, reduce heat and cover for about 3 minutes. Using tongs, turn the chard over so that uncooked leaves are on the bottom and wilted leaves are on top. Cover and cook until completely wilted, about another 3 minutes.",
    "Fill a large pot 3/4 full with water and bring to boil. Add the pasta and cook until al dente (tender), 10 to 12 minutes, or according to the package directions. Drain thoroughly, reserving 1/4 cup of the pasta water. Return the drained pasta to the pot. Add the Swiss chard mixture and the reserved pasta water. Toss to mix evenly.",
    "Divide the pasta onto warmed plates. Top each serving with 1 tablespoon Parmesan cheese and cracked black pepper. Serve immediately.",
    "DIRECTIONS (2)",
    "Tear the chard leaves into large pieces; cut the stems into 1-inch pieces. Heat the olive oil in a large skillet over medium heat. Once hot, add the garlic and cook until fragrant. Toss in the greens and stems by big handfuls. Stir and toss around with tongs, and cook until wilted. Season with some salt and pepper.",
    "Add the cannellini beans, sundried tomatoes and red pepper flakes and toss. Once ingredients are incorporated, remove from heat, top with the red onion and serve."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 tablespoons olive oil",
    "1/2 cup chopped shallots or green onions",
    "2 garlic cloves, sliced",
    "8 to 10 small mushrooms, sliced",
    "1 pound Swiss chard, trimmed of stems, washed thoroughly and chopped into 1-inch pieces",
    "6 ounces uncooked fettuccine",
    "1/4 cup grated Parmesan cheese",
    "1/4 tsp cracked black pepper",
    "INGREDIENTS (2)",
    "2 pounds Swiss chard, washed well",
    "3 tablespoons extra-virgin olive oil",
    "3 cloves garlic, chopped",
    "Kosher salt and freshly ground black pepper",
    "One 15-ounce can cannellini beans, drained and rinsed",
    "1/2 cup oil-packed sundried tomatoes, chopped",
    "Pinch crushed red pepper flakes",
    "1/8 red onion, sliced"
  ],
  "__v": 5
}