{
  "hash": "7c1b80e7672f1b8cd4903a8197f1c2b0ef1e38d9",
  "title": "Warm Farro Salad with Cauliflower, Kale, Goat Cheese and Lemon",
  "image": "https://www.leannebrown.com/wp-content/uploads/2016/12/xfarro-salad-close-up-big-platter-1024x679.jpg.pagespeed.ic.KpXNyr3Jgc.webp",
  "href": "https://www.leannebrown.com/warm-farro-salad-cauliflower-kale-goat-cheese-lemon/",
  "extension": "",
  "firstAdded": "2018-05-01T21:03:00.054000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Rinse the farro in a sieve in the sink.",
    "In a medium-size pot bring the farro, water and salt to a boil on medium heat.",
    "While the farro cooks, chop your vegetables and get everything ready so you can make the salad quickly once the farro is ready.",
    "Once the farro is boiling, turn the heat down to low and place a lid on just slightly askew so some steam can escape. Cook for approximately 30 minutes. Check after 25 minutes and add a bit more water if the pot looks too dry.",
    "Once 30 minutes has passed, taste one of the farro grains and see if it is soft enough to eat but still with a little chew, kind of like good pasta is cooked al dente. If it’s cooked enough, take the farro from the heat and drain any excess water. Add one Tbsp of butter to the top and let it melt and mix in. Put a lid on the pot so it stays warm while you continue with the rest of the meal.",
    "In a pan on medium heat, melt the rest of the butter. Add the garlic and cook for about 30 seconds, just until the garlic smells good.",
    "Turn up the heat to medium high and add the cauliflower and cook, stirring occasionally, for about 6 minutes. Let it get a little brown, with some crunchy bits.",
    "Next add the farro, and toss. Cook for 2 minutes more just until the farro is warmed up. Add a bit of salt and taste to see if the cauliflower is soft enough for your taste. Add kale and the zest of the lemon. Stir to wilt the kale, it shouldn't take more than a minute.",
    "Add a bit more salt and taste, if it’s a bit under-salted that is okay because you’ll get more saltiness from the goat cheese in a moment. If it tastes good, turn off the heat and add the goat cheese and a generous squeeze of lemon juice. Taste one more time and add more salt, lemon or goat cheese if you think it needs it. Serve warm."
  ],
  "ingredients": [
    "0",
    "3/4 cup farro",
    "2 cups water",
    "3 Tbsp butter",
    "2 to 3 cloves garlic minced",
    "1/2 cauliflower chopped into small pieces",
    "1 bunch kale stems removed and sliced into ribbons",
    "1 lemon zested and juiced",
    "2 to 3 oz goat cheese (chevre)",
    "salt to taste"
  ],
  "__v": 1
}