{
  "hash": "36077b3928bc9f63ce483ab5afdfd961fdbd2a2d",
  "title": "Instant Pot Beef Barbacoa Meal Prep Bowls",
  "image": "https://i1.wp.com/mealpreponfleek.com/wp-content/uploads/2019/02/5_BeefBarbacoa_4Containers_Cropped_REVISED.jpg?resize=533%2C800&ssl=1",
  "href": "https://mealpreponfleek.com/recipe/instant-pot-beef-barbacoa-meal-prep-bowls/",
  "extension": "Chrome",
  "firstAdded": "2019-05-05T11:07:52.635000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Set Instant Pot to “Sauté” mode. Once heated, add 1 tablespoon oil.",
    "Next, add chuck roast and let sear for ~3-5 minutes (do not adjust/check beef for at least 3 minutes), or until seared brown crust forms. Repeat on other side then remove from Instant Pot and set aside.",
    "Remaining on “Sauté” mode, add remaining 1 tablespoon of oil and add crushed garlic. Let sauté ~5 minutes.",
    "Add dried aromatics (granulated onion, cumin, cloves, oregano), stir, and let heat ~1 minute. Then, add adobo sauce, chipotles, lime juice, apple cider vinegar — stir well and let sauté ~1 minute.",
    "Now, add beef broth, bay leaves, salt, and black pepper. Stir well once again and return chuck roast to the Instant Pot.",
    "Cover and set to “High Pressure Cook” mode for 70 minutes.",
    "Manually release pressure, flip chuck roast over, and cook again at high pressure for 5 minutes. Once finished, this time, allow for natural steam venting/depressurizing.",
    "Once depressurized, remove chuck roast and place onto a sturdy/durable surface (such as a cutting board) and using 2 forks, shred meat into desired sized pieces and discard large hunks of fat.",
    "Remove and discard all 3 bay leaves.",
    "Return and submerge shredded barbacoa meat into barbacoa sauce and let marinate for ~5 minutes.",
    "Divide meat, quinoa, limes into 6 portions and top with red onion, fresh cilantro, and a drizzle of barbacoa sauce.",
    "Serve, store, and enjoy!"
  ],
  "ingredients": [
    "0",
    "2.5 pounds chuck roast beef",
    "5 cloves garlic crushed",
    "3 bay leaves",
    "2 chipole peppers in adobo sauce de-seeded and sliced",
    "1 lime cut into 6 wedges",
    "1 lime juiced",
    "1 1/4 cup beef broth or bone broth",
    "2 1/4 tbsp cumin",
    "2 tbsp Apple Cider Vinegar",
    "2 tbsp avocado oil",
    "1.5 tbsp Dried oregano",
    "1/2 tbsp granulated onion",
    "2 tsp adobo sauce from the chipotles can",
    "2 tsp Sea Salt",
    "1/2 tsp ground clove",
    "1 tsp black pepper",
    "3 cups cooked quinoa",
    "1/4 small red onion diced",
    "1/2 cup Fresh cilantro"
  ],
  "__v": 1
}