{
  "hash": "e4b23ab5f7bafa374d773cae54eb49666cdc03de",
  "title": "Tamale Pie",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2007/04/tamale-pie.jpg",
  "href": "http://www.simplyrecipes.com/recipes/tamale_pie/",
  "firstAdded": "2014-11-30T21:37:03.361000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "lean",
    "beef",
    "onion",
    "green",
    "bell",
    "pepper",
    "seeds",
    "stem",
    "salt",
    "chile",
    "cumin",
    "fireroasted",
    "tomatoes",
    "anaheim",
    "chiles",
    "kernel",
    "corn",
    "olives",
    "raisins",
    "sharp",
    "cheddar",
    "cheese",
    "water",
    "prepared",
    "cornbread",
    "jiffy",
    "bobs",
    "red",
    "needed",
    "according",
    "instructions",
    "make",
    "batter",
    "egg",
    "milk"
  ],
  "directions": [
    "0",
    "1 Preheat oven to 375°F.",
    "2 Heat olive oil in a large skillet on medium high. Add the ground beef, onion, and bell pepper. Add salt, chile powder, and cumin. Cook, stirring infrequently, until the ground beef has browned on all sides. Remove from heat. Drain excess fat if necessary (if you are using lean beef, there shouldn't be excess).",
    "3 Mix in fire-roasted tomatoes, Anaheim chiles, corn, olives, raisins, cheese, and water. Adjust seasoning. Add more chile powder and cumin if desired. Rub a little olive oil over the insides of a 9x12-inch casserole dish (or use a nonstick cooking spray). Spoon filling into the casserole dish.",
    "4 In a large bowl, prepare the cornbread batter according to the directions on the package. Pour the cornbread batter over the top of the filling in the casserole.",
    "5 Bake for 40 minutes, until the top is browned.",
    "Serves 6-8."
  ],
  "ingredients": [
    "0",
    "1 Tbsp olive oil",
    "1 1/2 pounds lean ground beef",
    "1 onion, chopped",
    "1 green bell pepper, seeds and stem removed, chopped",
    "1/2 teaspoon salt",
    "2 teaspoons chile powder (more or less to taste)",
    "2 teaspoons cumin (more or less to taste)",
    "1 (14 1/2 ounce) can fire-roasted tomatoes",
    "1 (4-ounce) can green Anaheim chiles, drained, chopped",
    "1 (16 ounce) can whole kernel corn, drained",
    "1 (4 ounce) can sliced ripe olives",
    "1/3 cup raisins",
    "1 cup grated sharp cheddar cheese (about 4 ounces)",
    "1/3 cup water",
    "1-pound of prepared cornbread mix (such as Jiffy or Bob's Red Mill).",
    "Whatever is needed according to cornbread mix instructions to make the cornbread batter (water, egg, oil, milk)"
  ],
  "__v": 1
}