{
  "hash": "7225ac80e81e4b0e405bf61bac3c4d5fb5ed396e",
  "title": "Cocoa Graham Crackers (Vegan, Gluten Free)No Churn Vegan Chocolate Banana Ice CreamChocolate Banana Graham Ice Cream Sandwiches (Vegan, Gluten Free)",
  "image": "http://i2.wp.com/willfrolicforfood.com/wp-content/uploads/2015/02/banana-chocolate-graham-ice-cream-sandwiches-vegan-gluten-free-7454.jpg?resize=683%2C1024",
  "href": "http://willfrolicforfood.com/2015/02/chocolate-banana-graham-ice-cream-sandwiches-vegan-gluten-free.html",
  "extension": "",
  "firstAdded": "2015-11-11T16:42:15.341000",
  "users": [
    null
  ],
  "keywords": [
    "sorghum",
    "flour",
    "almond",
    "meal",
    "tapioca",
    "shy",
    "white",
    "rice",
    "cocoa",
    "cinnamon",
    "baking",
    "psyllium",
    "salt",
    "cold",
    "ghee",
    "coconut",
    "oil",
    "honey",
    "maple",
    "syrup",
    "water",
    "bananas",
    "frozen",
    "preferably",
    "dates",
    "milk",
    "butter",
    "graham",
    "crackers",
    "banana",
    "chocolate",
    "ice",
    "cream",
    "dark"
  ],
  "directions": [
    "0",
    "Measure out the sorghum, brown rice flour, arrowroot, and sweet rice flour into a bowl. Place the combination in a food processor and whir to combine. Add cinnamon, baking powder, psyllium, and salt and whir again to combine.",
    "Cut cold ghee or coconut oil into (at least) one inch pieces (I know this is a bit harder with coconut oil. If you can't \"cut\" the coconut oil into pieces just add ½ tablespoon amounts at a time to the food processor). Add ghee/coconut oil to the food processor, and pulse until you have a sandy texture.",
    "Stir together the honey (or maple syrup) and 3 tablespoons water. While the food processor is running, add the honey & water mixture. Let the processor run for a couple of minutes until the dough begins to form a ball (mine took about 5 minutes). If, after processing for a few minutes, it still hasn't come together, add a tablespoon of cold water at a time until it does.",
    "Remove the dough ball from your food processor, and wrap in parchment paper or cellophane. Chill in the refrigerator for 15 minutes. While the dough is chilling, preheat the oven to 325F. Line two cookie sheets with parchment paper, and set aside.",
    "Once the dough is chilled, remove from the fridge and split it in two. Form each half into a ball. Covering a surface with parchment paper, set one ball down. Cover with another sheet of parchment paper. Carefully roll out the dough into a rectangle about half the length of your cookie sheet -- until the dough is ¼ inch thick. Using a paring knife, cut the dough into 8 pieces (or 12 if you would like smaller grahams). Tip: use a pie server to lift each of the graham cracker squares onto the baking sheet. Also, the dough is prone to crack so just press the cracks back together with your fingers or use a pinch of dough to seal any cracks. It's up to you if you would like to cut off the ragged edges of the graham crackers so you'll have a clean looking rectangle. You can always roll out the extra edges into more grahams. Repeat with the second half.",
    "Arrange your grahams about 1 inch apart on your cookie sheet. Prick your crackers with the tines of a fork to get that classic graham cracker look. Bake 15 minutes, until the grahams harden and turn a golden-brown color. Remove from the oven and let cool 30 minutes (the grahams will harden further). Makes 16 medium grahams or 24 smaller grahams.",
    "1",
    "Combine all ingredients in the bowl of a high powered blender. Blend on high until all of the ingredients are smooth and creamy.",
    "Pour your ice cream into an ice cube tray and freeze 3-6 hours, or overnight.",
    "Once your ice cream base is frozen, pop the cubes out of the tray into the base of your high powered blender. Blend on high. If the cubes aren't coming together, add 1 teaspoon of additional almond milk at a time until the base gets creamy.",
    "2",
    "Dollop a spoonful of the ice cream on a base graham cracker and top with another graham, pressing down gently. Use a spoon to perfect the edges. Continue until you've made as many sandwiches as you please. Place the sandwiches on a tray and freeze further at least 1 hour, unless you plan on serving them ASAP without the chocolate dip.",
    "In a double boiler, melt together the chopped chocolate and coconut oil. Remove from heat and spoon the chocolate into a wide bowl.",
    "Dip the frozen ice cream sandwiches in the chocolate dip, shaking off excess chocolate over the bowl. Place the sandwiches back on the tray to freeze further, at least 20 mins."
  ],
  "ingredients": [
    "0",
    "2.5 ounces sorghum flour (about ½ cup, plus 2 tablespoons)",
    "2.5 ounces almond meal (1/3 cup, plus 1 tablespoon)",
    "2.5 ounces tapioca flour (1 tablespoon shy of ⅓ cup)",
    "2.5 ounces white rice flour (1/3 cup, plus 2 tablespoons)",
    "2 tablespoons cocoa powder",
    "1 teaspoon cinnamon",
    "1 teaspoon baking powder",
    "1 teaspoon psyllium",
    "½ teaspoon salt",
    "3.5 ounces cold ghee or coconut oil (7 tablespoons)",
    "3 ounces honey or maple syrup (1/4 cup)",
    "3 - 6 tablespoons cold water",
    "1",
    "2 bananas (frozen preferably)",
    "6 dates, pitted",
    "2 cups unsweetened almond milk",
    "½ cup almond butter",
    "2 tablespoons cocoa powder",
    "*additional almond milk",
    "2",
    "Graham Crackers",
    "Banana Chocolate Ice Cream",
    "3",
    "1.5 ounces dark chocolate, chopped (about ¼ cup)",
    "1 teaspoon coconut oil"
  ],
  "__v": 1
}