{
  "hash": "fe49bf481524b4c2506d823d8ad29590c20156b3",
  "title": "Sheet Pan Cashew Chicken",
  "image": "http://cf.therecipecritic.com/wp-content/uploads/2017/04/Sheet-Pan-Cashew-Chicken-1-e1491914260409.jpg",
  "href": "http://therecipecritic.com/2017/04/sheet-pan-cashew-chicken/",
  "extension": "Chrome",
  "firstAdded": "2017-04-21T22:00:00.530000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium saucepan over medium heat, whisk together soy sauce, hoisin sauce, vinegar, honey, sesame oil, garlic, ginger, cornstarch and water until combined. Bring to a simmer, stirring frequently, until sauce thickens and bubbles. Remove from heat and set aside.",
    "1",
    "Preheat oven to 400°F. Line a large sheet pan with parchment paper or foil coated with cooking spray and set aside.",
    "Season chicken with salt and black pepper then drizzle spoonfuls of sauce over the chicken coating well on both sides. Reserve at least half of the sauce for later.",
    "Cook in preheated oven for 8 minutes then remove the pan.",
    "Arrange the broccoli florets, bell peppers and cashews in a single layer around the chicken. Season the vegetables with salt and pepper and drizzle spoonfuls of the sauce and toss everything to coat. Return to the oven and cook for another 8-12 minutes, or until the chicken is cooked through and juices run clear.**",
    "Remove pan from oven and drizzle with remaining sauce. Serve over rice or quinoa and garnish with green onions and sesame seeds, if desired."
  ],
  "ingredients": [
    "0",
    "6 tablespoons low sodium-soy sauce",
    "1 tablespoon hoisin sauce",
    "¾ tablespoons apple cider vinegar",
    "2 tablespoons honey",
    "1 teaspoon toasted sesame oil",
    "½ teaspoon fresh minced ginger",
    "2 cloves garlic, minced",
    "2 tablespoons cornstarch",
    "½ cup water, plus more as needed to thin out sauce",
    "1",
    "2 medium skinless boneless chicken thighs or breasts, cut into 1\" inch cubes",
    "Salt and black pepper, to taste",
    "1½ cups broccoli florets (about 1 head)",
    "1 red bell pepper",
    "½ green bell pepper, optional",
    "⅔ cup roasted unsalted cashews"
  ],
  "__v": 1
}