{
  "hash": "dfd18f93fd617dd64e34333d35ff5c3704896da5",
  "title": "Roasted Tomato and Basil soup",
  "image": "http://www.recipe30.com/wp-content/uploads/2017/02/tomato-soup-848x477.jpg",
  "href": "http://www.recipe30.com/roasted-tomato-and-basil-soup.html/",
  "extension": "Chrome",
  "firstAdded": "2017-04-07T18:11:35.259000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Remove stems and cores from each tomato. Slice tomatoes in half. Set aside. Peel and slice the red onions, set aside. Peel the garlic cloves and set aside.",
    "add 2 tbsp olive oil to a roasting dish, add the sliced onions, the garlic cloves, scatter the fresh thyme, add all the tomatoes. Add the rest of the olive oil and toss until everything is evenly coated in oil. Bake for 30 to 45 min at 400°F – 200°C.",
    "Place a large soup pot on high heat and transfer roasted tomatoes to pot. Remove any sprigs of thyme and toss out. Add the chili, salt and pepper to taste. (don’t over salt, finish seasoning at the end). Add all the chicken or vegetable stock. Scrunch up the fresh basil and shred finely. Add to soup and simmer gently for 15 to 20 minutes.",
    "Add the cream and using a stick blender (or you can scoop soup with a ladle and use an upright blender in stages) blend until smooth. The soup is ready. If using puff pastry continue…",
    "Place servings in oven proof soup bowls. Fill generously but not to the top. Leave to cool down so pastry doesn’t melt. Doesn’t have to be cold, just not steaming hot.",
    "Make egg wash using one egg yolk and a dash of cream. Set aside.",
    "Take a sheet of puff pastry and cut a circle approx half an inch larger than the top of your soup bowl. Use a plate, saucer, bowl or anything round as a cutting stencil. Place it on the pastry and carefully cut the dough using a sharp pointy knife. Mix the egg wash and brush the top of each pastry. Place the pastry circle over the soup bowl and fold the edges down and press firmly. Repeat process for each soup bowl."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "4.4 lb -2kg tomatoes",
    "2 red onions",
    "6 tbsp olive oil",
    "6 garlic cloves",
    "6 sprigs of thyme (2 tbsp dried)",
    "1 tspn hot chili flakes",
    "4 cups - 1 litre chicken or vegetable stock",
    "1 bunch of fresh basil",
    "¼ cup of heavy cream",
    "1 egg yolk (optional)",
    "3 sheets (cut in 2) of puff pastry"
  ],
  "__v": 1
}