{
  "hash": "6666ce936c7a09c86053f8f8874ba5178e8b5bde",
  "title": "Dark Chocolate Orange Slice & Bake Cookies",
  "image": "https://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2016/10/dark-chocolate-orange-slice-bake-cookies-6.jpg",
  "href": "https://sallysbakingaddiction.com/2016/10/18/dark-chocolate-orange-slice-bake-cookies/",
  "extension": "Chrome",
  "firstAdded": "2018-09-15T22:15:42.472000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large bowl using a hand-held mixer or stand mixer fitted with a paddle attachment, beat the butter for 1 minute on medium speed until completely smooth and creamy. Add the brown sugar and beat on medium high speed until fluffy and creamy. Beat in egg and vanilla extract on high speed. Scrape down the sides and bottom of the bowl as needed, and continue to beat until fully combined.",
    "In a separate bowl, whisk the flour, cinnamon, and salt together until combined. On low speed, slowly mix into the wet ingredients until combined. The cookie dough will be thick and slightly sticky. Switch to high speed and beat in the zest, fresh orange juice, and walnuts (if using). Turn the dough out onto a floured work surface and, with floured hands, divide into two. Shape each half into an 8-inch log, about 2.5 inches in diameter. The measurements don't have to be exact. Tightly wrap the logs in plastic wrap and chill in the refrigerator for at least 4 hours and up to 5 days. Chilling is mandatory for this cookie dough. I always chill mine overnight.",
    "Preheat oven to 350°F (177°C). Line two large baking sheets with parchment paper or silicone baking mats. (Always recommended for cookies.) Set aside.",
    "Remove logs from the refrigerator and roll into coarse sugar, if desired. It's added only for a little crunch! Slice each log into 12 equally thick cookies and place cookies on baking sheets about 2 inches apart. Bake the cookies for 12-14 minutes or until brown around the edges. Allow to cool for 5 minutes on the cookie sheet, then transfer to cooling rack to cool completely.",
    "Melt the chopped chocolate in a double boiler or (carefully!) use the microwave. For the microwave, place the chocolate in a medium heat-proof bowl. Melt in 15 second increments, stirring after each increment until completely melted and smooth. Dip each completely cooled cookie halfway into the chocolate and place onto a parchment or silicone baking mat-lined baking sheet. Sprinkle with sea salt and orange zest (if desired). Place the baking sheet into the refrigerator to help the chocolate set. Once set, enjoy!"
  ],
  "ingredients": [
    "0",
    "3/4 cup (170g) unsalted butter, softened to room temperature",
    "2/3 cup (133g) packed light or dark brown sugar (I prefer light in these!)",
    "1 large egg, at room temperature",
    "1 teaspoon pure vanilla extract",
    "2 cups + 2 Tablespoons (266g) all-purpose flour (spoon & leveled)",
    "1/2 teaspoon ground cinnamon",
    "1/4 teaspoon salt",
    "zest from 1 medium navel Sunkist orange (plus more for sprinkling on top if desired)",
    "2 Tablespoons (30ml) orange juice from 1 medium navel Sunkist orange",
    "optional: 1/2 cup (63g) Diamond of California chopped walnuts",
    "optional: coarse sugar for rolling (I use sugar in the raw brand)",
    "8 ounces (226g) semi-sweet chocolate, coarsely chopped",
    "sea salt for sprinkling on top"
  ],
  "__v": 1
}