{
  "hash": "81f18056ecbba0baaae8c0cc3a2014d9b07178a9",
  "title": "Instant Pot Salted Caramel Cheesecake",
  "image": "http://cookiesandcups.com/wp-content/uploads/2016/01/saltedcaramelcheesecake-700.jpg",
  "href": "http://cookiesandcups.com/instant-pot-salted-caramel-cheesecake-2/",
  "extension": "Chrome",
  "firstAdded": "2016-09-21T17:58:32.050000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Spray a 7- inch Springform pan lightly with cooking spray. Cut a piece of parchment paper to fit the bottom of the pan and spray again. Set aside.",
    "In a large bowl combine the Ritz crumbs, butter and sugar evenly. Press the mixture firmly into the bottom and up the sides of the prepared pan. Set aside.",
    "In the bowl of your stand mixer beat the cream cheese and sugar until combined and even. Add in the sour cream and mix for 30 more seconds until smooth, add in the flour, salt and vanilla, scraping the sides of the bowl as necessary. Finally add in the eggs and mix until just smooth. Don't over-mix.",
    "Pour the cream cheese mixture into the prepared crust.",
    "Pour 2 cups of water into the bottom of your Instant Pot. place the trivet that came with the pot into the bottom. Cut a piece of aluminum foil the same size as a paper towel. Place the foil under the paper towel and put the springform pan on top of the paper towel. Wrap the bottom of the pan in the foil, with the paper towel as a barrier.",
    "Next take another piece of foil about 18- inches long folded into thirds long-wise. Place this under the Springform pan and use the two sides as a \"sling\" to place the cheesecake into the pot. It will also make it very easy to remove the cheesecake from the Instant Pot when it's done.",
    "Once the pan is in the Instant Pot secure the lid and press the manual button. Adjust the pressure to high and set for 35 minutes, making sure the vent is closed.",
    "Let the cheesecake cook and then allow the pressure to release naturally.",
    "Remove the cheesecake from the pot using the sling you prepared and place on a wire rack to cool the cheesecake for an hour. Cover the cheesecake in the pan with foil and place int he refrigerator to chill for at least 4 hours or overnight.",
    "When you're ready to serve, top the cheesecake with the caramel sauce and sprinkle with sea salt. Using a butter knife loosen the sides of the cheesecake from the pan and release the sides of the pan.",
    "Store airtight refrigerated for up to 5 days"
  ],
  "ingredients": [
    "0",
    "1½ cups finely crushed ritz, about 1½ sleeves",
    "4 tablespoons butter, melted",
    "2 tablespoons sugar",
    "1",
    "16 ounces cream cheese, room temperature",
    "½ cup light brown sugar Coupons",
    "¼ cup sour cream",
    "1 tablespoon flour",
    "½ teaspoon kosher salt",
    "1½ teaspoons vanilla",
    "2 eggs",
    "2",
    "½ cup caramel sauce",
    "1 teaspoon flaked sea salt"
  ],
  "__v": 1
}