{
  "hash": "bad568b324899ead73a5f13ef031d27a5cbd9f66",
  "title": "Roasted Quartered Chicken with Herb Sauce",
  "image": "http://www.alexandracooks.com/wp-content/uploads/2014/05/13995009017_937aff628c_o.jpg",
  "href": "http://www.alexandracooks.com/2014/05/14/the-crispiest-spring-chicken/",
  "extension": "Chrome",
  "firstAdded": "2016-01-10T11:04:31.878000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "backbone",
    "room",
    "photosvideo",
    "guidance",
    "notes",
    "recipe",
    "extravirgin",
    "olive",
    "oil",
    "kosher",
    "salt",
    "pepper",
    "redwine",
    "vinegar",
    "parsley",
    "basil",
    "tarragon",
    "pulsed",
    "food",
    "processor",
    "garlic",
    "couple",
    "herbs",
    "redpepper"
  ],
  "directions": [
    "0",
    "An hour before baking, remove chicken from fridge, quarter it (if you haven’t done so already), and let it rest on a cutting board or the rimmed sheetpan you will use to roast it on. Preheat oven to 450 degrees.",
    "Note: I find my chicken gets the most evenly golden brown when I roast it on the highest rack. This definitely creates a more smokey oven, but it does work nicely.",
    "Pat chicken dry really well with paper towels and transfer to rimmed baking sheet (if it’s not already there). Rub chicken with 1 tablespoon oil; season liberally all over with salt and pepper. Arrange, skin-side up and roast until golden (or until a thermometer inserted into thickest part of breast (without touching bone) registers 160 degrees), about 30 minutes.",
    "2. Meanwhile, make the sauce. I use the food processor, and because I omit the 1/4 cup olive oil and use the pan juices in stead, (which amount to about 1/4 cup; see notes below for following original recipe), I simply pulse the basil with the garlic, red pepper flakes, and red wine vinegar, then pour this sauce over the sheetpan after the chicken finishes roasting. If you like this idea, when the chicken finishes roasting, transfer it to a plate for a second, pour sauce over the pan, scrape up those crispy bits, return chicken to pan and let it rest for 10 minutes. Just before serving, spoon the sauce over the chicken pieces. I find that waiting to pour the sauce overtop helps keep the skin crispy.",
    "Note: This is what the original recipe suggests: Transfer chicken to a plate. Pour off and discard fat from baking sheet; return chicken to pan. Whisk together remaining 1/4 cup oil, vinegar, parsley, garlic, and pepper flakes in a bowl. Season with salt. Spoon sauce over chicken and let stand 10 minutes before serving with accumulated pan juices and sauce."
  ],
  "ingredients": [
    "0",
    "1 whole chicken (about 4 pounds), quartered and backbone removed, room temperature (see photos/video below for guidance)",
    "1 tablespoon plus 1/4 cup (optional, see notes in recipe) extra-virgin olive oil",
    "kosher salt and freshly ground pepper",
    "2 tablespoons red-wine vinegar",
    "1 cup packed parsley or basil or tarragon (or whatever), chopped (or pulsed in food processor, see notes)",
    "1/2 teaspoon minced garlic (or a couple of cloves, minced with herbs in the food processor)",
    "1/2 teaspoon red-pepper flakes, or more or less to taste"
  ],
  "__v": 1
}