{
  "hash": "e6205c8e24639e2a1d75ba7ccdd9a6d454f18b7c",
  "title": "Sweet spiced fishcakes with bread salad",
  "image": "",
  "href": "http://www.ottolenghi.co.uk/recipes/fish/sweet-spiced-fishcakes-with-bread-salad-shop",
  "extension": "Firefox",
  "firstAdded": "2016-01-04T18:04:35.622000",
  "users": [
    null
  ],
  "keywords": [
    "skinless",
    "boneless",
    "white",
    "fish",
    "fillet",
    "roughly",
    "red",
    "onion",
    "pine",
    "nuts",
    "dill",
    "zest",
    "lemon",
    "juice",
    "cumin",
    "medium",
    "curry",
    "cardamom",
    "egg",
    "salt",
    "pepper",
    "bread",
    "salad",
    "aubergine",
    "pieces",
    "sunflower",
    "oil",
    "extra",
    "focaccia",
    "broken",
    "chunks",
    "olive",
    "coriander",
    "green",
    "chillies",
    "tomatoes",
    "dice",
    "lebanese",
    "cucumbers",
    "picked",
    "parsley",
    "leaves",
    "torn",
    "greek",
    "yoghurt"
  ],
  "directions": [
    "0",
    "Put the fish and half the onion in a food processor and pulse a couple of times until the fish is chopped into half-centimetre pieces; don't work it any longer than this. Transfer to a bowl and stir in the pine nuts, dill, zest, spices, egg, half a teaspoon of salt and a quarter-teaspoon of white pepper. Mix well, then form into 16 patties weighing 40-50g each. Cover and refrigerate until ready to serve.",
    "Put the aubergine in a strainer and sprinkle over a quarter-teaspoon of salt. Stir and leave to drain for 30 minutes, then rinse and dry well with a clean towel. Heat half the sunflower oil in a medium sauté pan and, once hot, cook half the aubergine until golden brown and soft. Remove with a slotted spoon and place on kitchen paper. Repeat with the remaining oil and aubergine. Set aside to cool.",
    "Heat the oven to 180C/350F/gas mark 4. Mix the focaccia and a tablespoon of olive oil on an oven tray and bake for 10-12 minutes, until golden brown and crunchy. Remove and leave to cool.",
    "Just before serving, use a mortar and pestle to grind the coriander, chilli and a quarter-teaspoon of salt to a paste (or pulse in a food processor). Stir in the remaining two tablespoons of olive oil and set aside.",
    "In a large bowl, mix the aubergine, bread, tomatoes, cucumbers, parsley, lemon juice and remaining onion, and divide between plates. Top with a spoonful of yoghurt and the coriander paste.",
    "Put a large frying pan on a medium high heat and add two tablespoons of sunflower oil. Cook half the fishcakes for three minutes on each side, until golden brown and cooked through. Remove and keep warm while you cook the rest, adding another tablespoon of oil if necessary. Plate the fishcakes next to the salad and serve at once."
  ],
  "ingredients": [
    "0",
    "600g skinless and boneless white fish fillet, roughly chopped",
    "1 small red onion, peeled and finely diced",
    "30g pine nuts, toasted and chopped",
    "10g dill, chopped",
    "Grated zest from ½ lemon, plus 2 tsp lemon juice",
    "¾ tsp ground cumin",
    "2 tsp medium curry powder",
    "½ tsp ground cardamom",
    "1 egg, beaten",
    "Salt and white pepper",
    "For the bread salad:",
    "1 large aubergine, cut into 3cm pieces",
    "120ml sunflower oil, plus 3 tbsp extra",
    "50g focaccia, broken into 2cm chunks",
    "3 tbsp olive oil",
    "35g coriander, roughly chopped",
    "2 green chillies, finely diced",
    "2 medium tomatoes, cut into 2cm dice",
    "2 Lebanese cucumbers, cut into 2cm dice",
    "10g picked parsley leaves, torn",
    "150g Greek yoghurt"
  ],
  "__v": 1
}