{
  "hash": "e004dbc47f0beecf7b1f8a760733741d34cdf6b2",
  "title": "5-Ingredient Vegan Gluten-Free Cookies",
  "image": "https://minimalistbaker.com/wp-content/uploads/2014/01/EASY-5-Ingredient-Vegan-Oatmeal-Cookies-One-bowl-and-30-minutes-required-minimalistbaker.com_.jpg",
  "href": "https://minimalistbaker.com/5-ingredient-vegan-gluten-free-cookies/",
  "extension": "",
  "firstAdded": "2017-11-25T03:50:51.858000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Add dates to a food processor and pulse until small bits remain.",
    "Add banana and almond butter and mix again until combined, scraping down the sides as needed.",
    "Next add the almond meal and rolled oats and pulse until a loose dough is formed. It will be kind of wet and sticky. That’s OK! You’re on the right track.",
    "Scrape your dough into a mixing bowl. If it feels too wet to the touch to form into cookies, add another few Tbsp of almond meal and/or oats and stir. I added another few tablespoons of each until I was able to form them into cookies without them sticking to my hands.",
    "At this point, you can add in 1/4 cup of your mix-in of choice, such as dairy-free dark chocolate chips, raisins or nuts. Then chill dough for 10 minutes and preheat oven to 350 degrees F (176 C).",
    "Scoop out 1 Tbsp amounts of your cookie dough and form into loose discs, then arrange on a parchment lined baking sheet. They won’t expand so pack them closer together (but not touching).",
    "Bake for 15-18 minutes or until golden brown and somewhat firm to the touch. The good thing about these cookies is a little under-baked is OK since there’s no eggs and they’ll ultimately just be a little more moist.",
    "Remove and let set for a few minutes on the pan, then carefully transfer to a plate or cooling rack to cool. Serve immediately.",
    "Store leftovers in an airtight container for several days. Move to the fridge or freezer for longer term storage."
  ],
  "ingredients": [
    "0",
    "1 cup dates, packed (soaked for 10 minutes in warm water and then drained)",
    "1 medium ripe banana",
    "2 Tbsp all natural, salted almond butter or peanut butter",
    "3/4 cup almond meal (ground from raw almonds)",
    "3/4 cup gluten-free rolled oats",
    "Optional add-ins: dried fruit, dairy-free chocolate chips, flaxseed, seeds, nuts"
  ],
  "__v": 1
}