{
  "hash": "686f96c544a350fa859779924f452e497da0a5c7",
  "title": "Bacon-Shrimp Stuffed Sweet Potatoes Recipe",
  "image": "http://paleoleap.com/pictures/2/bacon-shrimp-stuffed-sweet-potatoes-main-large-2.jpg",
  "href": "http://paleoleap.com/bacon-shrimp-stuffed-sweet-potatoes/",
  "extension": "Chrome",
  "firstAdded": "2016-02-06T17:35:40.241000",
  "users": [
    null
  ],
  "keywords": [
    "potatoes",
    "raw",
    "shrimp",
    "tails",
    "thirds",
    "slices",
    "bacon",
    "crumbled",
    "garlic",
    "onions",
    "green",
    "garnishing",
    "paprika",
    "chili",
    "oregano",
    "cayenne",
    "pepper",
    "ghee",
    "clarified",
    "butter",
    "paleo",
    "cooking",
    "fat",
    "olive",
    "oil",
    "coat",
    "salt",
    "black"
  ],
  "directions": [
    "0",
    "Preparation",
    "Preheat your oven to 450 F.",
    "Rub the potatoes with the olive oil, place them on a baking sheet and bake for about 40 to 45 minutes or until soft.",
    "While the potatoes are baking; over a medium high fire, melt some cooking fat and add the garlic and the green onions. Cook for about 2 minutes.",
    "Add the shrimp to the green onions and garlic, cook for 2 to 3 minutes then add the paprika, chili powder, dried oregano and cayenne pepper. Stir and cook until shrimp are done, about another 2 to 3 minutes.",
    "When the potatoes are done, let them cool down and leave the oven on.",
    "Slice the potatoes in half horizontally and carefully scoop out the flesh into a big bowl, making sure to keep the skins.",
    "Mash the sweet potatoes until smooth then add the crumble bacon, the shrimp mixture, the ghee, season to taste and combine everything well.",
    "Stuff the potato skins with the filling, return to the oven and cook for another 15 minutes.",
    "When done remove from the oven and sprinkle with the remaining green onions."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "8 sweet potatoes;",
    "1 lb. large raw shrimp, deveined and tails removed, cut into thirds;",
    "6 slices of bacon, cooked and crumbled;",
    "4 garlic cloves, minced;",
    "4 green onions, thinly sliced; (keep some of the green for garnishing)",
    "1 tbsp. paprika;",
    "2 tbsp. chili powder;",
    "1 tbsp. dried oregano;",
    "½ tsp. cayenne pepper;",
    "6 tbsp. ghee (clarified butter);",
    "Paleo cooking fat;",
    "olive oil, to coat the potatoes;",
    "Sea salt and freshly ground black pepper to taste;"
  ],
  "__v": 1
}