{
  "hash": "7fdbfcd4e0c1c68bb6c764816484da628fe66a78",
  "title": "Shrimp Piccata Pasta",
  "image": "http://media.paleomg.com/2015/11/IMG_8252.jpg",
  "href": "http://paleomg.com/shrimp-piccata-pasta/",
  "extension": "Chrome",
  "firstAdded": "2016-03-12T14:16:21.236000",
  "users": [
    null
  ],
  "keywords": [
    "zucchinis",
    "spiralized",
    "butter",
    "ghee",
    "shrimp",
    "salt",
    "garlic",
    "shallot",
    "lemon",
    "juice",
    "chicken",
    "stock",
    "zest",
    "capers",
    "cracked",
    "black",
    "pepper",
    "parsley"
  ],
  "directions": [
    "0",
    "Peel and spiralize zucchini into noodles. Then place on a couple layers of paper towels and place another paper towel on top then let sit while you prep the shrimp. You'll want it to sit for 5+ minutes to help remove the excess water.",
    "Place a large sauté pan over medium heat and add 2 tablespoons of butter. Once hot, season shrimp with salt and garlic powder then place in the pan to cook for 1-2 minutes per side, until they become pink and the tails begin to curl. Remove from pan and set aside. Add garlic and shallot to the hot pan and sauté for about 3 minutes, until fragrant and the shallot begins to become translucent. Add the butter then once melted, add lemon juice, chicken stock and zest to the pan, scraping up any browned bits from the bottom of the pan. Bring to a low boil. Add lemon slices and capers and reduce heat to low. Cook for 4 to 5 minutes or until lemon slices have softened.",
    "Add shrimp and zucchini noodles to the pan, toss to coat and let cook for another 2-3 minutes, until shrimp is warmed through and noodles have softened a bit.",
    "Serve with freshly cracked black pepper and fresh parsley on top!"
  ],
  "ingredients": [
    "0",
    "4 zucchinis, peeled and spiralized",
    "2 tablespoons butter or ghee",
    "1 pound shrimp, peeled and deveined",
    "½ teaspoon salt",
    "¼ teaspoon garlic powder",
    "2 garlic cloves, minced",
    "1 shallot, thinly sliced",
    "4 tablespoons butter or ghee",
    "½ cup lemon juice",
    "½ cup chicken stock",
    "zest of ½ lemon",
    "1 lemon, thinly sliced",
    "2-3 tablespoons capers",
    "fresh cracked black pepper, to garnish",
    "fresh parsley, chopped (to garnish)"
  ],
  "__v": 1
}