{
  "hash": "be275a8c664fea0e0c71f11bcd8b1fdc79ea542e",
  "title": "Carrot Layer Cake",
  "image": "https://domestocrat.files.wordpress.com/2014/08/img_87342_thumb.jpg?w=244&h=225",
  "href": "https://domestocrat.net/2014/08/20/recipe-the-most-magnificent-carrot-layer-cake/",
  "extension": "Firefox",
  "firstAdded": "2020-04-30T00:16:30.355000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Like all carrot cakes, and layer cakes too for that matter, making them can be tricky because there are a bunch of steps and it’s a little labor intensive. The key is to prepare beforehand and make sure you have plenty of time to complete each step.",
    "Start by making the cake batter. In a big bowl or stand mixer, mix together the eggs, oil, vanilla, and sugar. When that is combined, mix in all of the dry ingredients (flour, baking soda, baking powder, and spices). When the batter is combined, mix in the raisins and shredded carrot.",
    "IMG_8696-2IMG_8698-2IMG_8699-2",
    "Line an 18×13 baking sheet with parchment paper. Grease the paper and any parts of the pan that are showing. Spread the cake batter evenly out onto the baking sheet. It’s ok if it doesn’t fill the entire pan, it will spread out while baking.",
    "IMG_8704-2IMG_8706-2",
    "Bake at 350 degrees for 15-18 minutes, or until the middle of the cake is firm to the touch. Remove the cake from the pan and place on a wire rack to cool. Cool the entire cake completely before proceeding.",
    "IMG_8707-2IMG_8709-2",
    "While the cake is cooling, make the frosting (it’s super simple). In a big bowl or stand mixer, mix together all of the ingredients starting with the sugar, butter, vanilla, and salt, and dropping the cream cheese in piece by piece until the frosting is smooth and uniform. This can stay at room temperature until you’re ready to use it.",
    "IMG_8711-2IMG_8714-2IMG_8719-2",
    "When the cake has cooled, cut it into four equal pieces (I used my pizza cutter for this).",
    "IMG_8720-2",
    "Now it’s time to frost! The original ATK recipe calls for buttermilk powder in order to keep the frosting smooth and easily spreadable. I didn’t use this because I hate buying one esoteric ingredient just to use a tiny bit of it and have the rest sit in my pantry forever. In hindsight, I’m sure it would have made the frosting as spreadable as they promised (it was a little unwieldy without it), ATK has their recipes down to a science and they are always right. Still, I couldn’t be bothered with the buttermilk powder and the results were alright.",
    "Start frosting by placing one quadrant of the cake on the dish/platter/plate you plan to serve the cake on. Take a small scoop of frosting and spread on top of the cake – you want just enough frosting to cover the top of this layer. Repeat with each layer. When all four quadrants are stacked on top of each other, frost the entire outside of the cake. This is where things got tricky for me. I’m terrible at frosting and the cake did start to crumble on me. Still, I got the whole thing frosted and didn’t run out of frosting. However, the cake looked like a hot mess.",
    "IMG_8722-2IMG_8723-2IMG_8725-2",
    "The recipe calls for chopped pecans to be pressed on the sides of the cake but since mine looked a little crazy, I just put nuts all over the whole thing. Voila – all mistakes covered and no one can tell!"
  ],
  "ingredients": [
    "0",
    "For the cake:",
    "1.75 cups AP all-purpose flour",
    "2 tsp. baking powder",
    "1 tsp. baking soda",
    "1.5 tsp. cinnamon",
    "Pinch of nutmeg",
    "1/2 tsp. salt",
    "1.25 cups brown sugar",
    "3/4 cup vegetable oil",
    "3 eggs",
    "1 tsp. vanilla",
    "2 & 2/3 cups shredded carrots (4 carrots)",
    "2/3 cups dried currants, raisins, or golden raisins (I used golden raisins)",
    "2 cups pecans, chopped",
    "For the frosting:",
    "16 tbsp. butter, softened",
    "3 cups confectioners’ sugar",
    "12 oz. (1.5 bricks) cream cheese",
    "2 tsp. vanilla extract",
    "1/4 tsp. salt"
  ],
  "__v": 1
}