{
  "hash": "9f5acb053a4208a89595b9858e3acbbae6bb521a",
  "title": "Country Ham",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/alton-brown/country-ham-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-04-05T16:22:29.828000",
  "users": [
    null
  ],
  "keywords": [
    "country",
    "dry",
    "cured",
    "ham",
    "pepper",
    "pickle",
    "juice"
  ],
  "directions": [
    "0",
    "Unwrap ham and scrub off any surface mold (if you hung in a sack for 6 months you'd have mold too). Carefully remove hock with hand saw. (If this idea makes you eye your first aid kit, ask your butcher to do it. But make sure you keep the hock, it's the best friend collard greens ever had.)",
    "Place ham in cooler and cover with clean water. (As long as it's not too dirty you can use what southerners call the \"hose pipe\"). Stash the cooler in the bushes. If it's summer, throw in some ice. If it's freezing out, keep the cooler inside. Change the water twice a day for two days turning the ham each time.",
    "Preheat oven to 400 degrees F.",
    "Place ham in a large disposable turkey-roasting pan and add enough Dr. Pepper to come about halfway up the side of the ham. Add pickle juice if you've got it and tent completely with heavy-duty foil. Cook for 1/2 hour then reduce heat to 325 degrees F, and cook another 1 1/2 hours.",
    "Turn the ham over, insert an oven safe thermometer (probe-style is best) and cook another 1 1/2 hours, or until the deepest part of the ham hits 140 degrees F (approximately 15 to 20 minutes per pound total).",
    "Let rest 1/2 hour then slice paper-thin. Serve with biscuits or soft yeast rolls.",
    "Cooks note: Even after soaking, country ham is quite salty, so thin slicing is mandatory. If you're a bacon fan, however, cut a thicker (1/4-inch) slice and fry it up for breakfast.",
    "Recipe courtesy Alton Brown"
  ],
  "ingredients": [
    "0",
    "1 country (dry cured) ham",
    "1 liter Dr. Pepper",
    "1 cup sweet pickle juice, optional"
  ],
  "__v": 1
}