{
  "hash": "d6fdc29ae341b96cdccebbddee3e17cc99880764",
  "title": "Holandská omáčka",
  "image": "",
  "href": "http://www.menudomu.cz/holandska-omacka/",
  "extension": "Chrome",
  "firstAdded": "2015-12-08T09:13:55.246000",
  "users": [
    null
  ],
  "keywords": [
    "ingredience",
    "porce",
    "loutky",
    "dkg",
    "msla",
    "citronu",
    "lce",
    "octa",
    "mete",
    "pout",
    "vinn",
    "pep",
    "trocha",
    "drcenho",
    "nebo",
    "kuliky",
    "dcl",
    "lehaky",
    "smetany",
    "vvaru",
    "blho",
    "vna",
    "vody",
    "kapka",
    "worcesteru",
    "uvdna",
    "pvodnm",
    "receptu",
    "ale",
    "nen",
    "nutn"
  ],
  "directions": [
    "0",
    "Do rendlíku nalijete vodu/vývar/smetanu/víno, trochu citronové šťávy, ocet, pepř a asi 5 minut mírně provaříte. Necháte vychladnout. Rozpustíte máslo. Připravíte hrnec v trochou vody, na který sedí dobře vodivá (ideálně kovová) miska, kde budeme šlehat. Voda se nesmí dotýkat dna misky, potřebujeme jen páru. Nad vodou, která mírně vaří, do misky s dvěma čerstvými žloutky přidáme vychladlou provařenou tekutinu a metličkou metláme a metláme. Obecně nemá teplota směsi převýšit 65 °C, v praxi to znamená, abyste tu a tam misku drželi mimo páru a pak zas vrátili nad. Metlejte pořádně, i když proces z počátku vypadá zdlouhavě. Pak začne houstnout rychle. Mě trvalo asi 4 minuty, než začala omáčka tuhnout, pak jsem po čůrku přidávala rozpuštěné máslo a metlala ještě asi minutu. Pak dochutila ještě další citronovou šťávou a solí, zametlala asi 20 vteřin a bylo hotovo. Pokud byste chtěli použít worcester, tak také úplně nakonec. Pokud by se omáčka srazila, přidejte lžičku studené vody a míchejte tak dlouho, až bude opět hladká.",
    "KOKO",
    "Facebook"
  ],
  "ingredients": [
    "0",
    "Ingredience na 2-3 porce",
    "2 žloutky",
    "7 dkg másla",
    "1/2 citronu",
    "1/2 lžíce octa (můžete použít vinný)",
    "bílý pepř (buď trocha drceného nebo 3 kuličky)",
    "0,4 – 0,5 dcl šlehačky, smetany, vývaru, bílého vína nebo vody",
    "sůl",
    "kapka worcesteru (uváděna v původním receptu, ale není nutná)"
  ],
  "__v": 1
}