{
  "hash": "354a96c8bb8e5ea3e9a3779129165189537ae1ab",
  "title": "One-pot chicken & bacon stew",
  "image": "//www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--513824_11.jpg?itok=dkx_Pex0",
  "href": "https://www.bbcgoodfood.com/recipes/748650/onepot-chicken-and-bacon-stew",
  "extension": "Chrome",
  "firstAdded": "2019-11-25T07:58:55.113000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat oven to 200C/180C fan/gas 6. Heat the oil in a large flameproof casserole with a lid. Fry the chicken pieces in batches for 5 mins on each side until well browned, then transfer to a plate. Sizzle the bacon in the casserole for a few mins until beginning to crisp. Stir in the carrots and onions, then cook for 5 mins until starting to soften. Stir in the flour and tomato purée and cook for 1 min more. Finally, splash in the vinegar and stir well.",
    "Pour in the stock and bring to a simmer. Add the bay, cream and seasoning. Slide in the chicken pieces and scatter over the potatoes, turning everything over a few times so that the potatoes are immersed in the sauce. Put the lid on and place in the oven. After 40 mins, remove from the oven and stir in the mushrooms. Cover again and cook in the oven for 10 mins more until the chicken is cooked through and tender but not completely falling off the bone. You can now turn off the heat, and chill and freeze some or all of it (see freezing tips, below). If eating straight away, cook for 10 mins more, then sprinkle over the herbs and serve."
  ],
  "ingredients": [
    "0",
    "3 tbsp olive oil Olive oil ol-iv oylProbably the most widely-used oil in cooking, olive oil is pressed from fresh olives. It's…",
    "16 chicken Chicken chik-enChicken's many plus points - its versatility, as well as the ease and speed with which it… pieces on the bone (about 3kg/6lb 8oz in total)",
    "140g smoked bacon Bacon bay-konBacon is pork that has been cured one of two ways: dry or wet. It can be bought as both rashers… , chopped or lardons or cubetti di pancetta",
    "4 medium carrots Carrot ka-rotThe carrot, with its distinctive bright orange colour, is one of the most versatile root… , thickly sliced",
    "2 onions Onion un-yunOnions are endlessly versatile and an essential ingredient in countless recipes. Native to Asia… , roughly chopped",
    "2 tbsp plain flour",
    "1 tbsp tomato purée",
    "75ml white wine or cider vinegar",
    "1l chicken stock",
    "2 bay leaves",
    "4 tbsp double cream or crème fraîche",
    "600g small new potatoes New potatoes n-ew po-tate-oesNew potatoes have thin, wispy skins and a crisp, waxy texture. They are young potatoes and… , halved",
    "12 large white mushrooms Mushroom mush-roomThe mushroom is a fungus which comes in a wide range of varieties that belong to two distinct… , quartered",
    "chopped herbs, such as parsley Parsley par-sleeOne of the most ubiquitous herbs in British cookery, parsley is also popular in European and… , tarragon or chives"
  ],
  "__v": 1
}