{
  "hash": "3e6e0243e688a143be893ddb231e029c8a81d823",
  "title": "Honey Mustard Brussels Sprout Slaw",
  "image": "",
  "href": "http://cookieandkate.com/2013/honey-mustard-brussels-sprout-slaw/",
  "extension": "Chrome",
  "firstAdded": "2017-05-07T13:03:14.549000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Shred the sprouts: First, cut off the tough ends of the sprouts and any browning outer leaves. Then shred them in a food processor using the slicing blade, pressing the sprouts against the blade with the provided plastic pusher. If you don’t have a food processor, slice them as thinly as possible using a sharp chef’s knife, then give them a few extra chops for good measure.",
    "If you are using raw almonds, toast them over medium heat for three to four minutes, stirring frequently, until they are fragrant and turning golden on the edges.",
    "Whisk together the olive oil, vinegar, honey, mustard and garlic until emulsified. In a medium serving bowl, toss the shredded sprouts with the almonds, chopped dried fruit, Parmesan and dressing. Serve.",
    "NOTES",
    "Recipe inspired by the Justus Drugstore patio’s coleslaw and the seasonal Brussels sprout salad at The Mixx.",
    "MAKE IT VEGAN: Substitute maple syrup or agave nectar for the honey and skip the Parmesan. Mixing a little bit of white miso into the dressing (miso is salty to use less salt) could help make up for the missing Parmesan.",
    "STORAGE SUGGESTIONS: This salad is best consumed within a few hours. Store leftovers in the fridge, covered. The edges of the sprouts might brown lightly over time. Wake up leftovers with a little sprinkle of salt and a tiny splash of vinegar.",
    "Coconut bacon would be a great addition to this salad!",
    "IF YOU LOVE THIS RECIPE: You’ll also love my roasted brussels sprouts with cranberries, raw kale and Brussels sprouts salad with tahini-maple dressing and Deb’s kale salad with apples, cranberries and pecans.",
    "MAKE IT NUT FREE: Omit the almonds, and perhaps add pepitas or sunflower seeds if desired.",
    "Did you make this recipe?",
    "Please let me know how it turned out for you! Leave a comment below and share a picture on Instagram with the hashtag #cookieandkate.",
    "SIMILAR RECIPES",
    "Raw Kale and Brussels Sprouts Salad with Tahini-Maple Dressing",
    "Asian Brussels Sprout Slaw with Carrots and Almonds",
    "Quinoa Broccoli Slaw with Honey-Mustard Dressing",
    "Pin ItFacebookGoogle+TwitterEmail",
    "▸ CATEGORIES Christmas, egg free, gluten free, pack for lunch, recipes, salads, side dishes, soy free, Thanksgiving, vegan",
    "▸ INGREDIENTS almonds, brussels sprouts, dried cherries, honey, parmesan, slaws",
    "ABOUT KATE TAYLOR",
    "Vegetable enthusiast. Dog lover. I'm probably making a big mess in my Kansas City kitchen right now.",
    "More about C+K »",
    "Follow us! Facebook ⋄ Pinterest ⋄ Instagram ⋄ Snapchat",
    "Never miss a new recipe",
    "Subscribe to receive new posts by email! As a thank you, we'll give you our welcome guide with 5 printable dinner recipes. (It's all free.)",
    "Enter your email address...",
    "↢ NEWER",
    "The Easiest Whole Wheat Pizza Dough",
    "OLDER ↣",
    "Roasted Eggplant Spaghetti with Miso Brown Butter Sauce",
    "Comments",
    "Leave a comment below:",
    "Your comments make my day. Thank you!",
    "Rate this recipe ☆ ☆ ☆ ☆ ☆",
    "Comment",
    "Note: Your email is never published or shared. Required fields are marked *",
    "Name *",
    "Email *",
    "Website",
    "Notify me of follow-up comments via e-mail",
    "LISA says",
    "October 25, 2013 at 1:38 PM",
    "Clearly it’s Brussels Sprout season because every blog has a recipe with it. :) I love it! They are my favorite.",
    "I made something similar to this for Thanksgiving last year and it was a huge hit!",
    "Reply",
    "KATY says",
    "October 25, 2013 at 3:04 PM",
    "I love this slaw, I never would have thought of using brussels sprouts and I especially love that there’s no mayo in the dressing. I hate mayo so this lighter slaw sounds absolutely perfect. :)",
    "Reply",
    "GRACE @ EARTHY FEAST says",
    "October 25, 2013 at 3:56 PM",
    "I love brussels sprouts! This looks like a delicious way to celebrate them this season! Yum!",
    "Reply",
    "BETH says",
    "October 25, 2013 at 4:01 PM",
    "It’s not cheating to use the bag of Trader Joe’s grated Brussel Spouts. I buy they all the time and make both hot and cold wonderful dishes from them.",
    "Reply",
    "KATE says",
    "October 28, 2013 at 8:57 PM",
    "Oh, good idea!",
    "Reply",
    "CLAIRE says",
    "October 25, 2013 at 4:01 PM",
    "YES! I’m wondering if I shredded the brussel sprouts in advance (mandolin? I don’t have processor) and keep dressing seperate if I could take this to my father-in-law’s for Thanksgiving. :) Otherwise it will just be pre-packaged mashed potatoes and jarred gravy.",
    "Reply",
    "KATE says",
    "October 28, 2013 at 8:57 PM",
    "Hey Claire! I think you could do that. A mandolin should work great. The edges of the Brussels brown over time but I suspect it’s due to the dressing. Let me know how it works for you!",
    "Reply",
    "SLAVOMIRA says",
    "November 19, 2014 at 1:43 PM",
    "I just took this to a work potluck today. I called it “Winter Slaw” because we have some veggie haters here. Everyone LOVED it and then were shocked when I told them it was ALL Brussels Sprouts. Of note, I brought the dressing separately in a small Tupperware and poured it on the salad immediately before serving. Whole grain Dijon adds a lovely texture. Thank you Kate – I will keep this one in my arsenal of quick, delicious, nutritious, crowd pleasers. What a hit!",
    "Reply",
    "KATE says",
    "November 25, 2014 at 2:21 PM",
    "Haha! Awesome. I’m glad even the veggie haters enjoyed the slaw! Brussels slaws are my favorite. :)",
    "Reply",
    "LIZ says",
    "October 25, 2013 at 4:04 PM",
    "Thank you for this nice recipe. Have a great weekend.",
    "Reply",
    "BATYA says",
    "October 25, 2013 at 5:24 PM",
    "Bam, this salad sounds great! I never liked brussels sprouts as a kid…but now I love them. And they are so good for you! This looks like the *perfect* side for my veggie burger tonight and what a smart way to make slaw. It’s incredible how inspiring restaurants can be when they put out good, fresh, food- but I agree that sometimes their recipes are a bit more difficult (or just not practical) for the average home cook. I love the way you adapted the inspired dish. On a related note, I’ve been toiling away trying to figure out how to make Huitlacoche Agnolotti which I ate last week at The Populist in Denver. It was incredible, but I just can’t nail it…Luckily, I can just go back for another ladies night. Happy weekend! PS: How nice of you to watch your friends baby :)",
    "Reply",
    "KATE says",
    "October 28, 2013 at 8:56 PM",
    "I just looked up that Huitlacoche Agnolotti. It looks amazing! It also sounds more complicated than a raw brussels salad, too.",
    "Reply",
    "ANNE says",
    "October 25, 2013 at 5:38 PM",
    "Gorgeous! I loooove Brussels sprouts – genius idea to use them for slaw.",
    "Reply",
    "MELISSA says",
    "October 25, 2013 at 8:14 PM",
    "I just ate The Mixx salad for dinner and then saw this post. Can’t wait to buy some Brussels Sprouts and make this!",
    "Reply",
    "KATE says",
    "October 28, 2013 at 8:54 PM",
    "Perfect! Let me know how this version compares, please! :)",
    "Reply",
    "TIEGHAN says",
    "October 25, 2013 at 9:06 PM",
    "Yes to the brussel sprouts!! I am eating them now. So good! This slaw looks great! :)",
    "Reply",
    "HARRIET says",
    "October 25, 2013 at 10:32 PM",
    "Oh man, do I love Brussels Sprouts, and how you’ve used them here is just awesome. Unfortunately it’s never cold enough here (Australia) for them to get the frost they need to be really delicious, but I’m sure your awesome recipe has the potential to ramp up even mediocre sprouts!",
    "Reply",
    "KATE says",
    "October 28, 2013 at 8:52 PM",
    "Oh, that’s a bummer! I had no idea. Let me know if you give the slaw a try!",
    "Reply",
    "DANA says",
    "October 26, 2013 at 10:16 AM",
    "This is gorgeous, Kate. I want to put it on a sandwich and eat it to death. Good luck with that baby, yo! ; )",
    "★★★★★",
    "Reply",
    "LAURA (TUTTI DOLCI) says",
    "October 26, 2013 at 11:23 AM",
    "This looks like the kind of slaw I’d love, especially with a honey mustard dressing!",
    "Reply",
    "STEFANIE says",
    "October 26, 2013 at 12:32 PM",
    "I love raw brussels in slaw! I like it waaaaaaay more than cooked brussels. That crunch is to die for! I think I might make this for Thanksgiving.",
    "Reply",
    "HOLLY ; THE HOBBIT says",
    "October 26, 2013 at 2:25 PM",
    "i also used to never eat coleslaw when i was younger, but a few years ago i tried homemade slaw for the first time & it is in a totally different realm! this looks absolutely gorgeous! :)",
    "Reply",
    "HONEY,WHAT'S COOKING says",
    "October 26, 2013 at 10:12 PM",
    "This looks so good, just picked up brussel sprouts from TJs last week. Love the addition of mustard, never seen anything like it.",
    "Reply",
    "LINDSAY says",
    "October 26, 2013 at 10:29 PM",
    "I made this salad for a dinner party tonight and it was a huge hit! No one could believe brussels sprouts could be so tasty. Thanks for another great recipe and congrats on quitting your day job…keep up the good work!",
    "Reply",
    "KATE says",
    "October 28, 2013 at 8:49 PM",
    "Thanks, Lindsay! Glad you all enjoyed it!",
    "Reply",
    "JOANNE says",
    "October 27, 2013 at 8:38 AM",
    "I love doing Brussels slaws instead of cabbage slaws. Although, they are kind of like mini cabbages anyway? The honey mustard dressing is what’s reeling me in. I could drink it.",
    "Reply",
    "KATE says",
    "October 28, 2013 at 8:49 PM",
    "Yep, pretty sure Brussels are just little bitty cabbages. Cute!",
    "Reply",
    "THEFOLIA says",
    "October 27, 2013 at 10:01 AM",
    "I just made celery root into a consistency of a hummus but I can’t wait to try it shredded like this! Thanks for your inspiring combination creation. Happy Nesting!",
    "Reply",
    "JODYE says",
    "October 28, 2013 at 12:28 AM",
    "I’ve long been a fan of brussels sprouts sautéed with a maple dijon dressing, and this slaw looks like it would be just up my alley. I love the combination of sweet and salty flavors with the perfect crunch of the brussels sprouts, and your idea to add coconut bacon would really take it over the top!",
    "Reply",
    "KATE says",
    "October 28, 2013 at 8:46 PM",
    "Those sautéed brussels sound so good!",
    "Reply",
    "HALEY L says",
    "October 28, 2013 at 10:32 AM",
    "I love making honey mustard dressing but I’ve never tried making brussels sprouts into a slaw! I’m adding this to my list!",
    "Haley",
    "Reply",
    "SOPHIE says",
    "October 28, 2013 at 6:39 PM",
    "This slaw is speaking my language! I love raw brussels and the dressing sounds perfectly tangy. Hello Thanksgiving side dish?",
    "Reply",
    "KATE says",
    "October 28, 2013 at 8:33 PM",
    "Yes! This slaw would be such a great, light and fresh Thanksgiving dish!",
    "Reply",
    "COUNTRY CLEAVER says",
    "October 28, 2013 at 10:19 PM",
    "I love brussels sprouts in the fall time and this is so perfect for the holidays! Is it okay that I’m gleeking just thinking about this?!",
    "Reply",
    "THELIZ says",
    "October 29, 2013 at 6:37 PM",
    "I made this tonight subbing agave for honey and we polished it off! My 11yo daughter had THREE helpings. Thank you!",
    "Reply",
    "KATE says",
    "October 29, 2013 at 8:52 PM",
    "That’s so great! Thanks for commenting!",
    "Reply",
    "JOHANNA says",
    "October 30, 2013 at 12:19 PM",
    "Kate,",
    "I’m pretty sure I saw you that night at Justus. Just moved back to KC after 9 years in Brooklyn, NY, and was worried about finding good food! Justus was seriously the best meal of my life. I’d love suggestions for where to eat and food shop in KC!",
    "Anyway, this salad looks great!",
    "Reply",
    "KATE says",
    "November 4, 2013 at 8:22 PM",
    "Did you really?! I was with two tall guys and a girl with curly blond hair. I have an enormous list of places to eat in KC… I’ll email it to you next!",
    "Reply",
    "EMILY says",
    "October 31, 2013 at 10:08 PM",
    "Love this creative way to use brussels sprout. I always have had them roasted. I’m adding this recipe to my “to-make” list!",
    "Reply",
    "ANNA@ANNAMAYEVERYDAY says",
    "November 1, 2013 at 10:08 AM",
    "This looks so delicious! I am making a red autumn slaw this evening but will make a note of this for next time.",
    "Reply",
    "JUDY says",
    "November 6, 2013 at 11:50 PM",
    "What an interesting combination! I’m looking forward to making a raw vegan version of this, with raw almonds, and perhaps pomegranate arils in place of the cherries or dried cranberries, and a raw nut cheese. Your photos are gorgeous. Are those pieces of purple cabbage in one of the photos?",
    "Reply",
    "KATE says",
    "November 7, 2013 at 12:59 PM",
    "No, no purple cabbage. Maybe you’re seeing the dried cherries? Please let me know how the raw/vegan version turns out!",
    "Reply",
    "JENNIFER says",
    "November 11, 2013 at 11:08 AM",
    "I made this last night thinking it would last for a few work-week lunches…but no! My roommate and I ate it all for dinner.",
    "Really delicious.",
    "I chopped the sprouts by hand, and it wasn’t too labor-intensive.",
    "★★★★★",
    "Reply",
    "KATE says",
    "November 13, 2013 at 10:09 AM",
    "Glad you both loved the slaw! Also glad that you didn’t mind chopping the sprouts by hand. Trader Joe’s sells shredded sprouts if you have access to a store/want to take a shortcut next time.",
    "Reply",
    "G FRED says",
    "November 20, 2013 at 4:12 PM",
    "This sounds yummy AND easy :) I’m going to make it for my work potluck tomorrow–I’ll let ya know how it goes. I’ve never used the shreddy thing on top of the food processor, so that sounds exciting ;) And by the way, the Mixx was my favorite food place we went to in KC! They need to franchise up here!!",
    "Reply",
    "G FRED says",
    "November 21, 2013 at 1:35 PM",
    "This was a hit! And it was so easy, even though I ended up chopping the sprouts by hand–2lbs of sprouts mind you, since I doubled the recipe :) Nothin’ like choppin’ sprouts at 6am! haha!",
    "I am definitely going to make this again. Thanks for the good eats friend! :)",
    "★★★★★",
    "Reply",
    "KATE says",
    "November 27, 2013 at 12:31 PM",
    "Yes! That’s a lot of early morning chopping. Glad the slaw was worth the effort!",
    "Reply",
    "DEVON says",
    "November 28, 2013 at 8:37 PM",
    "Hi Kate!",
    "I had to work this Thanksgiving – it’s the first time I haven’t been home in Virginia, and a good friend of mine invited me to join her at her family’s celebration this year. I brought this dish along, and it was such a huge hit that her family applauded me at the dinner table! I just wanted to say thanks for sharing this one – loved it.",
    "Hope you had a great holiday!",
    "★★★★★",
    "Reply",
    "KATE says",
    "December 4, 2013 at 11:06 AM",
    "Devon, thank you so much for your comment. It really brought a smile to my face when I read it last week. I’m glad everyone enjoyed the slaw!",
    "Reply",
    "JD says",
    "November 29, 2013 at 6:52 PM",
    "I made this for Thanksgiving dinner last night and it was DELICIOUS! Thank you!",
    "I boiled the sprouts for just a few minutes and then sliced them by hand. I also added extra garlic which may have been overkill. I’ll trust your garlic suggestion next time! ;0)",
    "Reply",
    "KATE says",
    "December 4, 2013 at 11:04 AM",
    "So glad you enjoyed the slaw! Thank you for commenting! I would have loved your extra garlicky version.",
    "Reply",
    "CHARLOTTE says",
    "January 23, 2014 at 6:15 AM",
    "Just made this. It is undoubtedly great. Thanks so much foe the recipe.",
    "Reply",
    "KATE says",
    "January 24, 2014 at 11:46 AM",
    "Thanks, Charlotte! Glad you loved it!",
    "Reply",
    "HAYLEY says",
    "April 21, 2014 at 10:20 AM",
    "Just checking — do you cook the sprouts? I’m a huge fan of roasted brussel sprouts with olive oil, salt and pepper, and a bit of truffle oil to finish but I’ve never used them raw.",
    "Reply",
    "KATE says",
    "April 23, 2014 at 11:20 AM",
    "Nope, don’t cook the sprouts. If you think about it, most slaws are made with raw cabbage and brussels sprouts are just tiny cabbages. The vinegar in the dressing breaks down or “cooks” the cabbage a little bit. If you like slaws and Brussels sprouts, I think you’ll love this recipe!",
    "Reply",
    "SARA says",
    "June 3, 2014 at 11:34 AM",
    "This has become my new favorite side! It is perfect for warmer weather and I LOVE the fact that it does not use mayo. Thank you!!",
    "★★★★★",
    "Reply",
    "SARAH says",
    "June 5, 2014 at 2:51 PM",
    "Made this last night and just wanted to stop by and say “Yum!” What a great way to mix up regular slaw or other boring sides.",
    "Reply",
    "KATE says",
    "June 10, 2014 at 3:08 PM",
    "Glad you enjoyed the slaw, Sarah! I just posted an Asian spin on this slaw that you might enjoy, too.",
    "Reply",
    "P. VAJDA says",
    "July 7, 2014 at 12:55 AM",
    "I love brussels sprouts, never thought about making them a salad raw. I love that you made this with cranberries, and the honey mustard dressing just really sent me over the top.",
    "Reply",
    "KATE says",
    "July 7, 2014 at 4:22 PM",
    "Thank you, P.! I’m glad you enjoyed the brussels slaw. I have another brussels slaw with Asian flavors that you might like, too!",
    "Reply",
    "CATHERINE says",
    "October 31, 2014 at 7:02 PM",
    "I brought this to a work potluck today and it was perfect! I read your notes about not storing well so I prepped it ahead of time – and just poured the dressing on right before I served it. Huge hit!",
    "Reply",
    "LEAH says",
    "November 23, 2014 at 11:10 PM",
    "So delicious! Thank you, we all scarfed it down happily :)",
    "★★★★★",
    "Reply",
    "KATE says",
    "November 25, 2014 at 1:34 PM",
    "Glad to hear it! Thanks, Leah!",
    "Reply",
    "TIFFANY says",
    "November 25, 2014 at 7:16 PM",
    "Thank you for this little gem! It’s something different and it’s delicious!",
    "★★★★★",
    "Reply",
    "KATE says",
    "December 3, 2014 at 6:43 PM",
    "Thank you, Tiffany! Glad you enjoy it!",
    "Reply",
    "EMMA says",
    "November 30, 2014 at 5:21 AM",
    "Kate! I made this slaw for Thanksgiving. I was a little worried about how it would be received by my very traditional, mid-western in-laws but it was a ROARING success! Everyone asked for the recipe :)",
    "Reply",
    "KATE says",
    "December 3, 2014 at 6:08 PM",
    "Hip hip hooray! I’m so glad they all enjoyed the slaw. :D",
    "Reply",
    "CRYSTAL says",
    "June 6, 2015 at 4:04 AM",
    "I never liked raw brussel sprouts… until I found this recipe and made it.",
    "THANK YOU!",
    "★★★★★",
    "Reply",
    "KATE says",
    "June 6, 2015 at 5:23 PM",
    "High five!!!",
    "Reply",
    "JESS says",
    "July 4, 2015 at 8:08 PM",
    "Just stopping by to say thanks for this recipe! Made it for a BBQ potluck and people loved it. I will be trying some of your other recipes soon!",
    "Reply",
    "KATE says",
    "July 5, 2015 at 10:19 AM",
    "Thank you, Jess! So glad you all enjoyed it!",
    "Reply",
    "SHELLYS says",
    "October 3, 2015 at 12:01 AM",
    "Made this for a beach potluck, and love the simplicity! I didn’t have cranberries so I used diced apricots and tart cherries. Yum! We only rarely get brussel sprouts here but the dressing seems to work equally well with cabbage. Thanks!",
    "★★★★★",
    "Reply",
    "KATE says",
    "October 6, 2015 at 11:30 AM",
    "Hooray! Thanks, Shelly!",
    "Reply",
    "ETC says",
    "November 20, 2015 at 11:40 AM",
    "Thanks for such a reliable, delicious recipe! I’ve made this recipe 4 or 5 times – it’s been amazing every time. Was just looking it up again to make next week for Thanksgiving. Trying to ease my dad back into Brussels Sprouts – he claims he has sprout-related childhood trauma. I think raw with this delicious dressing might be the way! I think I’ll add a bit of crumbled bacon to make it more appealing to him.",
    "Reply",
    "KATE says",
    "November 28, 2015 at 5:19 PM",
    "Thank you! Great to hear that you have been enjoying it. I think a lot of children have been traumatized by whole boiled sprouts. :(",
    "Reply",
    "ETC says",
    "November 20, 2015 at 11:41 AM",
    "whoops, forgot to rate it above!",
    "★★★★★",
    "Reply",
    "CLAIRE says",
    "November 26, 2015 at 6:21 PM",
    "Brought this to an extended family gathering for Thanksgiving 2015. A lovely light & healthy counterpoint to the meal. It was a HUGE hit with the adults. My nephew “taste tested” the dressing before I added it to the slaw and went back for a second tablespoon before it even got added to the sprouts. I used slightly less olive oil proportionately but followed your excellent directions exactly otherwise. Using the Cuisinart meant a double recipe was super fast to put together – I just changed the blade and shredded the Parmigiano Reggiano without having to wash the bowl. Next time I’ll try the Coconut Bacon too. Thank you!",
    "★★★★★",
    "Reply",
    "KATE says",
    "November 28, 2015 at 3:28 PM",
    "Thank you, Claire! I’m glad this slaw was a hit. Great idea to shred the cheese in your food processor, too!",
    "Reply",
    "COLETTE WHELAN says",
    "January 2, 2016 at 5:31 PM",
    "Made this today, recommended by emmaslittlekitchen.com, thank you ladies. Great hit with sprout hating husband – now a sprout loving convert!",
    "Reply",
    "KATE says",
    "January 4, 2016 at 5:30 PM",
    "Hooray! Glad to hear you converted your husband to sprouts with this slaw.",
    "Reply",
    "AMANDA says",
    "July 10, 2016 at 11:26 AM",
    "Love this recipe! What do suggest serving this with if I’m just making it for a week night dinner?",
    "★★★★★",
    "Reply",
    "ALICIA says",
    "November 13, 2016 at 9:31 PM",
    "Made this tonight using pomegranate seeds vs cranberries. I absolutely love the presentation. I found using the food processor worked well for shredding the sprouts and saves time- especially if you’re doubling or tripling the recipe for a family gathering. My favorite is roasted brussel sprouts, but I’m probably going to make this slaw for thanksgiving to ease the brussel sprout haters into trying something new. With a little more dressing, this recipe is right on.",
    "★★★★★",
    "Reply",
    "CRYSTAL says",
    "December 4, 2016 at 2:20 PM",
    "Love this recipe so much! My man loves to smoke meats and this is a great substitute to the old fashion creamy cole slaw. Thanks for sharing!",
    "★★★★★",
    "Reply",
    "GAIL says",
    "December 27, 2016 at 10:14 AM",
    "This was amazing! Served at Christmas dinner and everyone loved it. Will be making this one again and often. Thanks!",
    "★★★★★",
    "Reply",
    "XARA says",
    "February 5, 2017 at 11:09 PM",
    "Well, I haven’t yet made this, but my sister did! She brought a double recipe of it last night (made with dried cherries) to my annual post-Christmas letdown party. It was so delicious that I asked her to leave me some, and today I ate it for both lunch and dinner. And now I am pinning it and planning to make it myself very soon. Thanks for the great recipe!",
    "★★★★★",
    "Reply",
    "KATE says",
    "February 6, 2017 at 9:02 AM",
    "You’re welcome, Xara!",
    "Reply",
    "MAY says",
    "March 22, 2017 at 6:57 AM",
    "Ever since my boss showed me this recipe a few years ago (can’t believe it’s been that long already), I’ve been addicted making it when brussel sprouts are in season! Anytime there’s a potluck or a crowd to impress, this is a great recipe to use. Thank you so much for sharing!",
    "Reply",
    "KATE says",
    "March 22, 2017 at 9:06 AM",
    "Thanks, May! This one has a reputation for being a crowd-pleaser. So glad it’s come through for you!",
    "Reply",
    "SONDRA says",
    "May 2, 2017 at 6:54 AM",
    "Yummy! I added scallions, radishes and broccoli stems cause I had them. I love Slaws!!!!",
    "Mind if I add this to my little website, linked to you of course!",
    "★★★★★",
    "Reply",
    "KATE says",
    "May 2, 2017 at 4:56 PM",
    "Yes! You can certainly include it on your site, just be sure to follow my photo and recipe policy. I don’t allow the ingredients or directions to be copy + pasted, so a link back to this page would suffice. Thanks so much!",
    "Reply",
    "Hello! I cook fresh, vegetarian recipes. My dog, Cookie, catches the crumbs. About C+K » Contact ⋄ Links ⋄ Shop (new!) ⋄ Subscribe",
    "f p i t g h r",
    "OUR COOKBOOK",
    "Pre-Order Today!",
    "Amazon ⋄ Barnes & Noble ⋄ BAM! ⋄ IndieBound ⋄ Indigo ⋄ Details »",
    "OUR VIDEOS",
    "Don’t miss a new recipe",
    "Your email address",
    "LATEST RESOURCES",
    "What to Cook This May",
    "14 Spring Brunch Recipes",
    "More resources »",
    "POPULAR RECIPES",
    "Thai Mango Cabbage Wraps with Crispy Tofu and Peanut Sauce",
    "Sweet Potato Burrito Smothered in Avocado Salsa Verde",
    "More favorites »",
    "BLOGGER RESOURCES",
    "▸ New: How to Start a Blog (any kind!)",
    "▸ How to Start a Food Blog",
    "▸ Essential Food Blogger Resources",
    "▸ Food Photography Tips",
    "▸ 20 Tips for Food Bloggers",
    "Spring Recipes",
    "ROASTED STRAWBERRY RHUBARB AND YOGURT PARFAITS",
    "ASHLEY’S SUN-DRIED TOMATO CAESAR SALAD",
    "LEMONY BROCCOLI, CHICKPEA & AVOCADO PITA SANDWICHES",
    "ROASTED BROCCOLI RABE AND PESTO FLATBREAD",
    "ARUGULA WALNUT PESTO",
    "SEARCH",
    "SUBSCRIBE",
    "RSS • Email • Bloglovin • Feedly",
    "ARCHIVES",
    "Cookie and Kate receives commissions on purchases made through our links to retailers. More details »",
    "© Cookie and Kate 2010 - 2017. All rights reserved. Cookie and Kate is a registered trademark of Kathryne Taylor.",
    "Comment Policy - Nutrition Disclaimer - Photo/Recipe Policy - Privacy Policy",
    "AN ELITE CAFEMEDIA FOOD PUBLISHER",
    "Select Directions",
    "(note: you can drag this box around to make it easier to highlight the recipe)",
    "Please highlight the directions for this recipe and click \"Next\""
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "Coleslaw",
    "1 pound Brussels sprouts",
    "⅓ cup slivered almonds, toasted (hickory smoked almonds would be great if you can find them)",
    "⅓ cup tart dried cherries or cranberries, chopped",
    "⅓ cup finely shredded Parmesan cheese",
    "Honey mustard dressing",
    "¼ cup olive oil",
    "2 tablespoons apple cider vinegar",
    "1 tablespoon honey",
    "1 tablespoon Dijon mustard",
    "1 garlic clove, pressed or minced",
    "¼ teaspoon sea salt"
  ],
  "__v": 1
}