{
  "hash": "13538ad01a856e95e674a43762cdb062e23e3797",
  "title": "Homemade Chicken Pot Pie",
  "image": "https://images-gmi-pmc.edge-generalmills.com/0f8b0cba-584d-461f-9f06-32b085bd8f43.jpg",
  "href": "https://www.bettycrocker.com/recipes/homemade-chicken-pot-pie/16c41885-8101-4fa8-b7e6-b6fda470d9bc",
  "extension": "Chrome",
  "firstAdded": "2019-10-08T12:47:33.425000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat oven to 425°F. Combine flour and salt in large bowl; cut in shortening with pastry blender or fork until mixture resembles coarse crumb. Mix in enough cold water with fork until flour is moistened. Divide dough in half. Shape each half into a ball; flatten slightly. Wrap 1 ball in plastic food wrap; refrigerate.",
    "Roll out remaining ball of dough on lightly floured surface into 11-inch circle. Fold into quarters. Place dough into ungreased 9-inch pie plate; unfold dough, pressing firmly against bottom and sides. Trim crust to 1/2 inch from edge of pan; set aside.",
    "In 2-quart saucepan, melt butter over medium heat. Add onion; cook 2 minutes, stirring frequently, until tender. Stir in flour, salt and pepper until well blended. Gradually stir in broth and milk, cooking and stirring until bubbly and thickened. Stir in chicken and mixed vegetables. Remove from heat. Spoon into crust-lined pie plate.",
    "Roll out refrigerated ball of dough on lightly floured surface into 11-inch circle. Gently fold dough into quarters. Place dough over filling; unfold. Trim, seal and crimp or flute edges.",
    "Bake 30 to 40 minutes or until crust is golden brown. During last 15 to 20 minutes of baking, cover edge of crust with strips of foil to prevent excessive browning. Let stand 5 minutes before serving."
  ],
  "ingredients": [
    "0",
    "2 cups Gold Medal™ all-purpose flour",
    "1 teaspoon salt",
    "2/3 cup plus 2 tablespoons shortening",
    "4 to 6 tablespoons cold water",
    "1",
    "1/3 cup butter",
    "1/3 cup chopped onion",
    "1/3 cup Gold Medal™ all-purpose flour",
    "1/2 teaspoon salt",
    "1/4 teaspoon pepper",
    "1 3/4 cups Progresso™ chicken broth (from 32-oz carton)",
    "1/2 cup milk",
    "2 1/2 cups shredded cooked chicken or turkey",
    "2 cups frozen mixed vegetables, thawed"
  ],
  "__v": 1
}