{
  "hash": "7b949a2e74f92619700edd2057a54bf51999ef21",
  "title": "Sesame Noodles with Swiss Chard and Chicken",
  "image": "https://images.food52.com/yWRsyBxaRhmTSj6aegsEuikRNrQ=/753x502/f7878acf-0c77-48f6-90bb-7b8d0ba89730--sesamenoodleswithchicken2.jpg",
  "href": "https://food52.com/recipes/66191-sesame-noodles-with-swiss-chard-and-chicken",
  "extension": "Chrome",
  "firstAdded": "2018-01-05T13:05:10.483000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Fill a large saucepan 2/3 full of water and bring to a boil over high heat. Salt it so that it tastes good, add the chicken breast, and remove the pot from the heat. Cover and let the chicken sit until cooked but very tender, about 15 minutes. (If you’re using two smaller breasts, decrease the time by about 3 minutes.) Remove the chicken from the water (don’t throw it away!) and cut into it to check its doneness; if it’s still a little pink, return it to the water for another minute or two. Remove the chicken to a plate and let it rest while you cook the noodles.",
    "Bring the water the chicken was cooked in back to a boil over high heat. Add the fettuccine, and cook to al dente according to the package directions. Place the chard in a large colander.",
    "Meanwhile, make the sauce: in a small bowl, whisk together 1 teaspoon of the sesame oil, the peanut oil, tahini, soy sauce, vinegar, chili oil, honey, cayenne, if using, and garlic until smooth. Note: It's very spicy without the cayenne, but if you like heat, start with 1/4 tsp. cayenne, then add more to taste.",
    "Drain the pasta directly over the chard, and shake the colander to allow water to drain out. Transfer chard and noodles to a large bowl. Toss with the remaining teaspoon of sesame oil.",
    "Shred the chicken with your hands into the bowl of noodles and chard. Add the scallions. Add the dressing and toss to coat. Serve immediately."
  ],
  "ingredients": [
    "0",
    "8 ounces boneless skinless chicken breast",
    "8 ounces dried fettuccine",
    "6 ounces Swiss chard, leaves removed from stems, torn into small pieces",
    "2 teaspoons sesame oil",
    "1/4 cup peanut oil",
    "1/4 cup well-stirred tahini",
    "3 tablespoons soy sauce",
    "2 tablespoons red wine vinegar",
    "2 teaspoons chili oil",
    "1 teaspoon honey",
    "1/2 teaspoon cayenne pepper, optional",
    "1 garlic clove, minced",
    "6 scallions, thinly sliced",
    "Kosher salt"
  ],
  "__v": 1
}