{
  "hash": "4005894ebcbd9b5150bd641958168c6f523b15e0",
  "title": "Homemade Aquafaba",
  "image": "",
  "href": "https://www.forksoverknives.com/recipes/homemade-aquafaba/",
  "extension": "Chrome",
  "firstAdded": "2018-01-17T03:32:00.087000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Aquafaba, that viscous liquid you see when you open a can of chickpeas, makes a great egg substitute in vegan baked goods—and if you’re out of canned chickpeas, you can create homemade aquafaba with this simple recipe.",
    "Aquafaba’s unique composition of starches and proteins—which results from soaking and cooking the beans—makes it useful for thickening, binding, emulsifying, and foaming. Try it in French toast, waffles, frittatas, and more. The liquid in canned or boxed chickpeas has the ideal consistency, but you can also make your own. To get the right viscosity, the chickpeas should be soaked overnight and then cooked in their soaking water. Soaking releases the necessary enzymes to give the liquid its viscosity.",
    "Storage tip: Homemade aquafaba will keep in a Mason jar in the refrigerator for two to three days. You can also freeze it in convenient ¼-cup or ½-cup portions for up to two months. (Don’t forget to rinse and drain the chickpeas, and refrigerate or freeze them until ready to use.)",
    "Instructions:",
    "1. Rinse the chickpeas, transfer them to a large pot, and cover with fresh water. Let it stand overnight.",
    "2. In the morning, check the level of the soaking water: If the chickpeas aren’t completely submerged, add just enough water to cover them.",
    "3. If using the stovetop method, place the pot over high heat, bring the water to a boil, then reduce the heat and simmer for 25 to 30 minutes, or until the beans are tender when squeezed.",
    "If using a stovetop pressure cooker, transfer the chickpeas and their soaking water to the pressure cooker, and cook under pressure for 7 to 10 minutes, then let it stand for 10 to 15 minutes for the pressure to be released before opening the cooker.",
    "If using an electric pressure cooker, follow the manufacturer’s instructions for soaked beans.",
    "4. Once the beans are cooked, use a strainer or fine sieve to strain the aquafaba into a large liquid measuring cup, and let it cool. If the aquafaba is the correct consistency, you will have about ¾ cup to 1 cup. If you have more liquid than that, you will need to cook the liquid down to the right consistency. Transfer the liquid to a small pan, bring it to a boil, and simmer for 5 to 10 minutes until you have ¾ cup to 1 cup. (Conversely, if you have less than ¾ cup cooled aquafaba, you’ve probably cooked it down too much; in that case, bring it back to boil, add some water to dilute it, and stop cooking when you have the right amount.)"
  ],
  "ingredients": [
    "0",
    "1½ cups dried chickpeas, rinsed",
    "4 cups water"
  ],
  "__v": 1
}