{
  "hash": "75038c85593b42a6f60533847d455ce57fd527fb",
  "title": "SPAGHETTI AND MEATBALLS",
  "image": "",
  "href": "http://lidiasitaly.com/recipes/spaghetti-and-meatballs-2/",
  "extension": "Chrome",
  "firstAdded": "2018-02-28T16:23:11.239000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine the carrot, celery, and onion in a food processor, pulsing to make a fine-textured paste or pestata. Scrape the pestata into a large bowl, and add the three meats, eggs, oregano, parsley, bread crumbs, and salt, mixing with your hands to combine well. Roll the meat into golf- ball- sized balls, and place on baking sheets lined with parchment paper. (You should get about forty- eight meatballs.) Bake the meatballs until browned all over, about 18 to 20 minutes. (They do not need to be entirely cooked through, because they will cook more in the sauce.) While the meatballs are baking, bring a large pot of salted water to boil for pasta. Slip the spaghetti into the boiling water and cook until al dente. Drain the pasta, reserving 1/2 cup of pasta water.",
    "Begin the sauce: heat the olive oil in a large pot over medium heat. Toss in the onion, and sauté until it turns transparent, about 2 to 3 minutes. Ladle in the reserved pasta water, and simmer the onion to break it down, about 2 to 3 minutes. Once the water has cooked away, sprinkle in 1 teaspoon of the salt, the bay leaves, and peperoncino. Let the peperoncino toast for a minute, then pour in the tomatoes. Slosh out the tomato cans and bowl with 4 cups hot water, add to the pot, and stir. Stir in the remaining teaspoon of salt, and bring the sauce to a simmer while the meatballs finish baking; simmer sauce about 10 minutes more.",
    "When the meatballs have fi nished baking, gently add them to the sauce and return to a simmer. Simmer, shaking the pan periodically to move (but not break) the meatballs, until the sauce is thick and flavorful, about 1⁄₂ hour. Plop the spaghetti back into the empty pasta cooking pot. Add half of the sauce (with no meatballs) and toss. Set in a hot bowl, and top with meatballs and additional sauce if necessary. Serve immediately, offering the remaining sauce and meatballs at the table with the grated cheese."
  ],
  "ingredients": [
    "0",
    "for the meatballs",
    "1 medium carrot, coarsely chopped",
    "2 stalks celery, coarsely chopped",
    "1 medium onion, coarsely chopped",
    "1 pound ground beef",
    "1 pound ground pork",
    "1 pound ground veal",
    "2 large eggs, beaten",
    "1 teaspoon dried oregano",
    "1⁄₂ cup chopped fresh parsley",
    "2 cups bread crumbs",
    "1 tablespoon kosher salt",
    "for the sauce",
    "1⁄₄ cup extra-virgin olive oil",
    "1 medium onion, chopped (about 11⁄₂ cups)",
    "2 teaspoons kosher salt, plus more as needed",
    "2 fresh bay leaves, or 3 dried bay leaves",
    "1⁄₂ teaspoon peperoncino flakes",
    "Three 28- ounce cans Italian plum tomatoes, preferably San Marzano, crushed by hand",
    "1 pound spaghetti",
    "1 cup grated Grana Padano"
  ],
  "__v": 1
}