{
  "__v": 2,
  "directions": [
    "0",
    "Preheat the oven to 350 degrees . Grease a 12-cup Bundt pan. In a saucepan, bring 1 2/3 cups water, the dates and baking soda to a boil. Transfer to a bowl and let cool.",
    "In a large bowl, sift together the flour, ginger, baking powder and 1 1/2 teaspoons salt. In another large bowl, using an electric mixer, beat together 2 sticks butter and 3/4 cup brown sugar until fluffy. Beat in the eggs one at a time. Add half of the flour mixture and beat until just combined. Add half of the date mixture and beat until just combined. Repeat with the remaining flour and date mixtures. Transfer the batter to the prepared pan and bake, rotating once, until a toothpick inserted into the center comes out clean, about 45 minutes.",
    "Meanwhile, in a saucepan, bring the cream, remaining 2 cups brown sugar, 1 stick butter and 1 1/2 teaspoons salt to a boil. Lower the heat and simmer until thickened, about 15 minutes; set aside.",
    "Remove the cake from the oven, leaving the oven on. Using the handle of a wooden spoon, poke holes through the cake and ladle half the toffee sauce over the cake to fill the holes; set aside the remaining sauce. Bake the cake for 15 minutes more. Let cool in the pan for 1 hour, then invert onto a platter and top with the reserved sauce."
  ],
  "firstAdded": "2014-11-16T04:02:37.304000",
  "hash": "2cc9c7b3b867266d1608b62ab253cb04cb99370b",
  "href": "http://www.pepperplate.com/recipes/view.aspx?id=3713270",
  "image": "http://cdn2.pepperplate.com/recipes/3713270.jpg?preset=sitethumb",
  "ingredients": [
    "0",
    "1 1/2 cups chopped dates",
    "2 teaspoons baking soda",
    "3 1/2 cups flour",
    "1 tablespoon ground ginger",
    "2 teaspoons baking powder",
    "1 tablespoon salt",
    "3 sticks (12 ounces) unsalted butter, at room temperature",
    "2 3/4 cups dark brown sugar",
    "3 large eggs",
    "3 cups heavy cream"
  ],
  "keywords": [
    "dates",
    "baking",
    "soda",
    "flour",
    "ginger",
    "salt",
    "unsalted",
    "butter",
    "room",
    "dark",
    "brown",
    "sugar",
    "eggs",
    "cream"
  ],
  "title": "Sticky Toffee Pudding",
  "users": [
    null
  ]
}