{
  "hash": "b16c122239a5953fa6d099442d5ca3c1c70d1afc",
  "title": "All-Natural Pumpkin Butter From Scratch + Many Ways To Use It!",
  "image": "http://cdn.ohsheglows.com/wp-content/uploads/2012/09/homemade-pumpkin-butter-50721.jpg",
  "href": "http://ohsheglows.com/2012/09/11/all-natural-pumpkin-butter-from-scratch-many-ways-to-use-it/",
  "extension": "Chrome",
  "firstAdded": "2016-05-26T17:07:05.836000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Roast your sugar pumpkins (see this tutorial). Cool for 10 minutes on pan before handling.",
    "Add pumpkin flesh (without the skin) in a blender. Add juice and blend until smooth, stopping to push down the pumpkin when necessary. It may take a bit to get it going.",
    "Add the Sucanat (or brown sugar), maple syrup, cinnamon and nutmeg. Process again until super smooth and no clumps remain.",
    "Spoon mixture into a medium-sized pot. Cover with lid and prop lid ajar with a wooden spoon. Over medium-high heat, bring mixture to a low boil. Reduce heat to low-medium and cook for about 10 minutes, or until it’s as thick as you want it. Keep the lid ajar throughout the cooking process – you will find it splatters everywhere so be careful! I like to keep the lid propped up on an angle while I stir the mixture so I don’t get splattered. Remove from heat and stir in vanilla.",
    "Cool completely, stir in lemon juice and a pinch of salt, and then store in a sealed jar in the fridge. Should keep for 2-4 weeks."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "4 – 4.5 cups fresh pumpkin puree (made from ~3.8 pounds sugar pumpkin)",
    "1/4 cup sweet apple cider or apple juice, more if needed",
    "1 cup Sucanat (or brown sugar, unpacked)",
    "3-4 tbsp pure maple syrup, to taste",
    "1 tbsp ground cinnamon",
    "1/2 tsp ground nutmeg",
    "1 tsp fresh lemon juice (enhances flavour and helps preserve)",
    "1 tsp pure vanilla extract",
    "pinch of fine grain sea salt"
  ],
  "__v": 1
}