{
  "hash": "2e2035a0fd29c11664a1b35f69d329827d1b320d",
  "title": "Sichuanese Wontons in Chilli Oil Sauce (Hong You Chao Shou)",
  "image": "http://www.epicurious.com/images/recipesmenus/2013/2013_february/51147600.jpg",
  "href": "http://www.epicurious.com/recipes/food/views/sichuanese-wontons-in-chilli-oil-sauce-em-hong-you-chao-shou-em-51147600",
  "firstAdded": "2015-02-22T18:40:09.691000",
  "users": [
    null
  ],
  "keywords": [
    "ginger",
    "unpeeled",
    "pork",
    "egg",
    "shaoxing",
    "wine",
    "sesame",
    "oil",
    "salt",
    "white",
    "pepper",
    "chicken",
    "stock",
    "spring",
    "onion",
    "greens",
    "wonton",
    "wrappers",
    "flour",
    "dust",
    "aromatic",
    "light",
    "tamari",
    "soy",
    "sugar",
    "chilli",
    "sediment",
    "heaped",
    "garlic"
  ],
  "directions": [
    "0",
    "Crush the ginger with the flat of a cleaver or a rolling pin and put it in a cup with just enough cold water to cover. Place the pork, egg, Shaoxing wine and sesame oil in a bowl with 1 1/2 tsp of the ginger water and salt and pepper to taste. Stir well. Mix in the stock, 1 tbsp at a time. Finally, add the spring onion greens.",
    "Fill a small bowl with cold water. Take a wonton wrapper and lay it flat in one hand. Use a table knife or a small spatula to press about 1 tsp of the pork mixture into the center of the wrapper. Dip a finger into the cold water, run it around the edges of the wrapper and fold it diagonally in half. Press the edges tightly together and lay on a flour-dusted tray or large plate.",
    "Bring a large pan of water to a boil over a high heat. While you are waiting for the water to boil, prepare three or four serving bowls. In each bowl, place 1 tbsp sweet aromatic soy sauce (or 1 tbsp tamari soy sauce and 1/2 tsp sugar), 1 1/2 tbsp chilli oil with sediment and 1/2-1 heaped tsp of crushed garlic to taste.",
    "When the water has come to a boil, drop in the wontons. Stir gently to make sure they do not stick together. When the water returns to a rolling boil, pour in a small cup of cold water to calm it down. Repeat this one more time. When the water has come to a boil for the third time, the wontons should be cooked through (cut one open to make sure). Remove the wontons with a slotted spoon, drain well, and divide between the prepared serving bowls. Scatter each bowl with some of the spring onion greens. Serve immediately, stirring everything together before digging in.",
    "Reprinted from Every Grain of Rice: Simple Chinese Home Cooking by Fuchsia Dunlop. Copyright © 2012 by Fuchsia Dunlop. Photographs copyright © 2012 by Chris Terry. With the permission of the publisher, W.W. Norton & Company."
  ],
  "ingredients": [
    "0",
    "1/2 oz (20g) piece of ginger, unpeeled",
    "5 oz (150g) ground pork",
    "1/2 egg, beaten",
    "1 tsp Shaoxing wine",
    "1/2 tsp sesame oil",
    "Salt",
    "Ground white pepper",
    "3 tbsp chicken stock",
    "3 tbsp finely sliced spring onion greens",
    "7 oz (200g) package of wonton wrappers",
    "Flour, to dust",
    "1",
    "3-4 tbsp sweet aromatic soy sauce, or 3-4 tbsp light or tamari soy sauce with 1 1/2-2 tsp sugar",
    "5-6 tbsp chilli oil, with its sediment",
    "2-4 heaped tsp crushed garlic",
    "2 tbsp finely sliced spring onion greens"
  ],
  "__v": 1
}