{
  "hash": "9b5a5bd1d58d8d44c658c3cde7ea2dbbac510748",
  "title": "Muffaletta Tortellini Salad",
  "image": "http://3.bp.blogspot.com/-_TM8H4APXq4/U8TJbpoQiVI/AAAAAAAAUZA/5WpB8JOdKJw/s1600/Muffaletta-Tortellini-Salad-2014TSRI-wide2.jpg",
  "href": "http://www.theslowroasteditalian.com/2014/07/muffaletta-tortellini-salad-recipe.html",
  "extension": "Firefox",
  "firstAdded": "2015-04-12T23:37:14.617000",
  "users": [
    null
  ],
  "keywords": [
    "genoa",
    "salami",
    "bite",
    "size",
    "pieces",
    "mortadella",
    "capicola",
    "provolone",
    "cheese",
    "mozzarella",
    "frozen",
    "tortellini",
    "olive",
    "salad",
    "star",
    "red",
    "wine",
    "vinegar",
    "extra",
    "virgin",
    "oil",
    "divided",
    "garlic",
    "oregano",
    "parsley",
    "black",
    "pepper",
    "jar",
    "italian",
    "giardiniera",
    "roasted",
    "peppers",
    "pimento",
    "stuffed",
    "olives",
    "kalamata",
    "capers"
  ],
  "directions": [
    "0",
    "Prepare the olive salad: Reserve 2 tablespoons olive oil. In a medium bowl combine vinegar, ¼ cup olive oil, garlic, oregano, parsley and black pepper. Whisk until well combined. Set aside. Cut up remaining ingredients according to ingredient list. Add remaining ingredients to bowl. Toss well until combined and coated. Refrigerate for 30 minutes (up to overnight).",
    "Meanwhile: bring a large pot of salted water to a boil over medium-high heat. Cook tortellini according to package directions. Remove from heat and drain.",
    "While the pasta is cooking, prepare deli meats and cheeses: cut meats and cheese into bite size pieces, approximately ¼”- ½” in size. Shred Parmesan cheese and set aside.",
    "Sprinkle 2 tablespoons reserved olive oil over drained tortellini. Stir to combine. Add olive salad to drained tortellini and gently stir until well combined. Toss in chopped meats and cheeses.",
    "Serve and enjoy.",
    "COOK’S NOTES: Meats and cheeses and be purchased at your grocery store deli counter. As for them to be thick cut (approximately ¼”- ½”).",
    "Giardiniera is an Italian mix of pickled vegetables and can be found in your grocery store near the pickles and olives.",
    "Recipe can be halved.",
    "Salad can be prepped ahead several days ahead by making the olive salad and placing in the refrigerator. Cut meats and cheeses and refrigerate. On the day you wish to serve cook tortellini and prepare salad. Muffaletta Tortellini Salad will keep for several days to a week in the fridge."
  ],
  "ingredients": [
    "0",
    "4 ounces Genoa salami, cut into bite size pieces",
    "4 ounces mortadella, cut into bite size pieces",
    "4 ounces capicola, cut into bite size pieces",
    "4 ounces provolone cheese, cut into bite size pieces",
    "4 ounces mozzarella cheese, cut into bite size pieces",
    "2 (16 ounce) packages frozen tortellini",
    "Olive Salad",
    "¼ cup STAR red wine vinegar",
    "¼ cup plus 2 tablespoons STAR extra virgin olive oil (divided)",
    "2 teaspoons minced garlic",
    "1 teaspoon dried oregano",
    "1 teaspoon dried parsley",
    "½ teaspoon fresh ground black pepper",
    "1 (6 ounce) jar Italian mix giardiniera, chopped",
    "½ cup chopped roasted red peppers",
    "½ cup STAR pimento stuffed olives, sliced",
    "½ cup sliced kalamata olives, halved",
    "½ cup STAR sliced black olives, sliced",
    "2 tablespoons capers, drained"
  ],
  "__v": 1
}