{
  "hash": "5797fca0ef36f705dc4c7a71b06b5e01fe94f6af",
  "title": "Homemade Soft Tortilla Wrap Recipe",
  "image": "https://www.sprinklesandsprouts.com/wp-content/uploads/2016/03/Homemade-Flour-Tortilla-Wraps-SQ-360x361.jpg",
  "href": "https://www.sprinklesandsprouts.com/homemade-soft-tortilla-wraps/",
  "extension": "Chrome",
  "firstAdded": "2020-05-31T13:14:32.748000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Tip the flour, salt and baking powder into the bowl of your stand mixer. (see note 3 for doing the recipe by hand)",
    "cups AP flour",
    "1 tsp salt",
    "1 tsp baking powder",
    "Use the dough hook to give the dry ingredients a mix, then add in the oil and water .",
    "⅓ cup vegetable oil",
    "1 cup hot water",
    "Mix on a low speed (I use speed 1 on my kitchen aid), pushing down any flour, for 3 minutes until a firm smooth ball forms.",
    "Flour you bench top and tip the dough out.",
    "Cut it in half and in half again until you have cut 16 equal pieces (see note 4 if you want bigger or smaller tortillas)",
    "Use the palm of your hand to flatten each of your balls as much as you can and then cover with a tea-towel.",
    "Leave the dough to rise for 15-20minutes.",
    "Place a heavy bottomed frying pan or skillet over a medium heat.",
    "Lightly flour your bench top and then use a rolling pin to flatten a piece of dough until it is almost transparent.",
    "Cook the tortilla for 1 minute then flip it ad cook it for a further 30 seconds.",
    "It should have a few light brown patches on it. If you find it is going too brown then lower the heat.",
    "Transfer the finsihed tortilla to a clean tea-towel and keep wrapped until ready to serve. (see note 5 for make ahead options)",
    "Repeat with each ball of dough.",
    "Serve immediatly or store for later (see note 5)",
    "Notes",
    "You can replace the AP flour/plain flour with wholewheat flour if you wish.",
    "Using hot water means your dough will come together quicker and be smoother. It wants to feel hot to the touch, but not so hot that it burns your fingers.",
    "To make this by hand, combine the dry ingredients into a bowl then add in the oil and hot water. Start to combine with a spoon and once a rough dough forms, use your hands to knead it into a smooth ball. Continue the recipe as instructed.",
    "If you want larger tortillas, divide the mixture into less portions.",
    "Make-Ahead",
    "You can make the dough ahead of time and keep it in the refrigerator for up to 24 hours or the freezer for 3 months.",
    "Allow to come to room temperature before portioning and rolling.",
    "Storing homemade tortillas",
    "Can you store them in the fridge?Pop them in the refrigerator, and they will last for 4-5 days. Or they will keep in a ziplock bag, on the counter or in a bread bin for 24-48 hours.",
    "Can you freeze tortilla wrapsYes! Once cooked, layer the tortillas between parchment/baking paper and freeze in a ziplock bag. Store them flat in the freezer, and they will keep for up to 6 months.",
    "Will all of the above methods, warm the tortillas through before using:",
    "How to reheat flour tortillas?",
    "You can either wrap them in foil and warm them in the oven for 10 minutes, or place them on a plate, cover them with a damp paper towel and microwave for 20-30 seconds.",
    "Nutrition",
    "CALORIES: 128kcal | CARBOHYDRATES: 18g | PROTEIN: 2g | FAT: 5g | SATURATED FAT: 4g | CALCIUM: 17mg | IRON: 1.1mg",
    "Tried this recipe?",
    "Mention @sprinklesandsprouts or tag #sprinklesandsprouts",
    "Find me on:",
    "Pinterest | Instagram | Facebook",
    "Let’s share the food love and make the world a tastier place 🙂",
    "Filed Under: All Recipes, Sides",
    "Reader Interactions",
    "Comments",
    "Raffaella says",
    "May 14th 2020 at 6:22 pm",
    "Tried many recipes but this one was the best! Thanks",
    "Reply",
    "Claire McEwen says",
    "May 14th 2020 at 8:12 pm",
    "Thank you so much, I am so happy you enjoyed it 🙂",
    "Cx",
    "Reply",
    "Mewded says",
    "Apr 29th 2020 at 4:14 am",
    "They were amazing! An all time favorite.",
    "Reply",
    "Claire McEwen says",
    "Apr 29th 2020 at 5:42 am",
    "Oh I am so pleased you liked them 🙂",
    "Cx",
    "Reply",
    "Nicola says",
    "Apr 23rd 2020 at 8:20 pm",
    "I just made these and they tasted lovely but were crispy instead of soft. What did I do wrong? Thanks",
    "Reply",
    "Claire McEwen says",
    "Apr 24th 2020 at 9:16 am",
    "Hi Nicola,",
    "It sounds like you might have cooked them for too long or maybe used too high a heat. Because they are rolled thin, they only need a maximum of 90 seconds cooking in total, over a medium heat.",
    "Hope that helps 🙂",
    "Cx",
    "Reply",
    "Kim says",
    "Apr 18th 2020 at 12:27 am",
    "I don’t have a microwave at home. Can I heat frozen tortilla using a frying pan ?",
    "Reply",
    "Claire McEwen says",
    "Apr 18th 2020 at 9:02 am",
    "You can definitely heat them in a pan instead. I would use a medium-low heat so they don’t get too crispy 🙂",
    "Cx",
    "Reply",
    "Jay says",
    "Apr 15th 2020 at 4:30 pm",
    "Hi Claire,",
    "Thanks a lot for the recipe. It’s so easy and simple; and the wraps are super delicious.",
    "Unfortunately, they were breaking when trying to roll them as wraps! Any advice what ingredient should be increased/decreased to make the wraps less breakable while wrapping??",
    "Thanks a lot 🙂",
    "Reply",
    "Claire McEwen says",
    "Apr 27th 2020 at 2:07 pm",
    "Hi Jay,",
    "I suspect that the wraps might have been cooked too long or they had cooled before you used them. Because they are rolled so thin they only need 90 seconds cooking. This helps to keep them soft and subtle.",
    "Cx",
    "Reply",
    "Alice says",
    "Apr 10th 2020 at 4:25 pm",
    "Hie Claire",
    "I don’t have baking powder, can i use bicarbonate of soda?",
    "Reply",
    "Claire McEwen says",
    "Apr 11th 2020 at 10:48 am",
    "Hi Alice,",
    "Bicarbonate of soda won’t have the same affect, because it needs an acidic element to help it work.",
    "I would just leave out the baking powder, I have done that before (by mistake) and the recipe still works okay 🙂",
    "Hope that helps",
    "Cx",
    "Reply",
    "Ritah says",
    "Apr 7th 2020 at 11:43 pm",
    "I don’t think I’ll ever make tortillas again🙆🏽‍♀️. It’s so much work, difficult to get into that round shape, the first 3 were a flop🤣",
    "Reply",
    "Claire McEwen says",
    "Apr 12th 2020 at 8:47 am",
    "They are definitely a labor of love, rolling them all out!",
    "Cx",
    "Reply",
    "Roxanne says",
    "Apr 2nd 2020 at 5:51 pm",
    "Hi I’m trying out this recipe but need fairly large tortillas. How many sections should I cut it into? What size wraps would they be if I sid 16 sections?Thanks",
    "Reply",
    "Claire McEwen says",
    "Apr 3rd 2020 at 3:53 am",
    "Hi Roxanne,",
    "The recipe, as written, makes 16 small tortillas. If you want more of a jumbo tortilla I would suggest only sectioning the dough into 8 pieces.",
    "Hope that helps",
    "🙂",
    "Reply",
    "Dan Plummer says",
    "Apr 2nd 2020 at 10:15 am",
    "Hi,",
    "Do you need a mixer to make this? Or can you just use a wooden spoon because I don’t have a mixer. 😢",
    "Reply",
    "Claire McEwen says",
    "Apr 2nd 2020 at 4:41 pm",
    "I do use a mixer, but you can do it without, I did it once camping, it works well it just takes a bit of effort!",
    "I use a knife to incorporate the ingredients then turn it out onto my board and knead it with my hands.",
    "Hope that helps",
    "🙂",
    "Reply",
    "Kay says",
    "Mar 28th 2020 at 5:24 am",
    "Hi can you use olive oil instead and how much in grams is 3 cups of flour.",
    "Thanks",
    "Reply",
    "Claire McEwen says",
    "Mar 28th 2020 at 1:00 pm",
    "You could definitely use olive oil instead 🙂",
    "It works out about 420g of flour.",
    "Hope that helps",
    "Cx",
    "Reply",
    "Caroline says",
    "Mar 21st 2020 at 5:49 pm",
    "This recipe came out really well. It was my first time to make wraps; just have to get the rolling and shaping right..",
    "Reply",
    "Claire McEwen says",
    "Mar 23rd 2020 at 5:31 am",
    "Oh yeah 🙂",
    "So pleased you enjoyed them Caroline.",
    "I still get some wonky shaped ones occasionally.",
    "I find constantly turning the wrap as you roll it helps to make it more circular. But I don’t worry too much as they taste great no matter what shape 😉",
    "Cx",
    "Reply",
    "Bronwen Smith says",
    "Mar 17th 2020 at 7:24 pm",
    "These are amazing! I used bread flour as I didn’t have any other in the house. Initially looked at the volume of dough and didn’t think I’d get out 16 wraps and make the first one WAY too thick and big. You need to roll these our super thin, til they’re almost see-through. They shrink a lot in the pan, but OMG they were delicious. MUCH better than bought ones. I’ll be making and freezing my own from now on.",
    "Reply",
    "Claire McEwen says",
    "Mar 18th 2020 at 6:19 am",
    "Oh I am so pleased you enjoyed them Bronwen, they take some rolling but I hope you agree the taste is worth it 🙂",
    "They freeze fabulously too 🙂",
    "Thank you for coming back to comment",
    "Cx",
    "Reply",
    "Bronwen Smith says",
    "Feb 28th 2020 at 10:20 pm",
    "Quick question…. do you think this will work with self raising flour?",
    "Reply",
    "Claire McEwen says",
    "Feb 29th 2020 at 10:43 am",
    "Hi Bronwen,",
    "I am not sure it will. Although the recipe does have some baking powder in it, it isn’t in a high ratio to the flour.",
    "To turn plain flour into self raising flour the ratio is 1 1/2 tsp of baking powder per cup of flour. Here we are only adding 1 tsp to 3 cups of flour.",
    "I think the self raising flour would puff up too much when cooked.",
    "It might make a really nice flat bread, but I don’t think it would be any good as a wrap.",
    "Hope that helps (sort of)",
    "Claire x",
    "Reply",
    "Lynn says",
    "Feb 10th 2020 at 2:21 am",
    "Thanks a lot for sharing this. You’re my hero.",
    "Reply",
    "Claire McEwen says",
    "Feb 11th 2020 at 5:59 am",
    "Hi Lynn,",
    "Thank you so much, glad you enjoyed the recipe 🙂",
    "Reply",
    "« Older Comments",
    "Leave a Reply",
    "Your email address will not be published. Required fields are marked *",
    "Recipe Rating",
    "Comment",
    "Name *",
    "Email *",
    "Website",
    "This site uses Akismet to reduce spam. Learn how your comment data is processed.",
    "Primary Sidebar",
    "HI, I’M CLAIRE,",
    "I believe cooking for those you love should be stress free and simple.",
    "Here on Sprinkles and Sprouts you will find delicious meals all made with easy to find grocery store ingredients. Family friendly mains, sensational sides and delicious desserts. Plus a great selection of party food and appetizers.",
    "READ MORE",
    "RECIPE NEWSLETTER",
    "Signup and get my FREE soup cookbook.",
    "Yes subscribe me",
    "By clicking submit, you acknowledge that the information you provide will be processed in accordance with our Privacy Policy and Terms of Service.",
    "READERS’ FAVORITES",
    "Footer",
    "All content, recipes and photographs are copyrighted to Claire McEwen and are the property of Sprinkles and Sprouts.",
    "THEY MAY NOT BE REPUBLISHED IN PART OR WHOLE WITHOUT PERMISSION AND PROPER CREDIT.",
    "Contact me to see republishing and syndication rights.",
    "2014-2020 Sprinkles and Sprouts",
    "Home",
    "About Sprinkles and Sprouts",
    "Recipe Index",
    "Contact Me",
    "Disclosure and Privacy Policy",
    "COPYRIGHT © 2020 · CRAVINGS PRO THEME ON GENESIS FRAMEWORK · WORDPRESS · LOG IN",
    "UPDATE PRIVACY SETTINGS",
    "EXCLUSIVE MEMBER OF MEDIAVINE FOOD"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "US Customary – Grams",
    "3 cups AP flour – see note 1",
    "1 tsp salt",
    "1 tsp baking powder",
    "⅓ cup vegetable oil",
    "1 cup hot water – s"
  ],
  "__v": 1
}