{
  "hash": "ec8c200cc994d6f1a1cdc452a12d151a691d1207",
  "title": "One Pot Chicken, Rice and Vegetables",
  "image": "",
  "href": "http://livesimply.me/2015/08/05/one-pot-chicken-rice-and-vegetables/",
  "extension": "Chrome",
  "firstAdded": "2017-02-02T22:06:19.676000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Sprinkle the chicken thighs with the salt and pepper. Set aside.",
    "In a large pot with a lid (I use a Dutch Oven), over medium-high heat, melt 2 tablespoons of butter. Once the butter is melted, add the carrots, celery, and onion. Saute for 5 minutes, stirring frequently, until the onions are translucent and veggies begin to \"sweat.\" Add the garlic and saute for 1 minute, until fragrant. Remove the vegetables from the pot and set aside.",
    "Return the pot to the stovetop and melt 1 tablespoon of butter. Once melted, add the chicken thighs, skin side down. Cook the chicken thighs for 10 minutes until they are slightly brown and crispy. Turn the chicken over with tongs and cook for 4-5 minutes.",
    "Add the vegetables back to the pot (with the chicken), followed by the rice, broth, and fresh thyme. Make sure all the ingredients are submerged in the broth.",
    "Bring the broth to a boil. Once boiling, reduce the heat to a simmer and place the lid on the pot. Simmer for 25-30 minutes, until the rice has absorbed the broth and is fluffy, and the chicken is no longer pink. Before serving, add the peas and stir to combine. Allow the peas to rest in the rice until soft (2-3 minutes).",
    "Serve warm."
  ],
  "ingredients": [
    "0",
    "8 chicken thighs (preferably with skin and bones, but boneless and skinless will also work)",
    "1 tsp salt",
    "½ tsp ground pepper",
    "3 TB butter or olive oil, divided",
    "2 large carrots, diced (about 1 cup)",
    "2 celery stalks, diced (about 1 cup)",
    "½ white onion, diced (about ½ cup)",
    "2 garlic cloves, minced",
    "1½ cups white or brown rice (I like white jasmine rice)",
    "3 cups broth (Vegetable or chicken broth work great. Water may also be used as a substitute)",
    "8 sprigs fresh thyme",
    "1 cup frozen peas"
  ],
  "__v": 1
}