{
  "hash": "5a22da7b321283f08cff9296c04586d163b5a2f4",
  "title": "Roasted Broccoli + Cauliflower Soup {with Bacon and White Cheddar!}",
  "image": "http://www.simplyscratch.com/wp-content/uploads/2014/09/Roasted-Broccoli-Cauliflower-Soup-l-SimplyScratch.com-36-620x413.jpg",
  "href": "http://www.simplyscratch.com/2014/09/roasted-broccoli-cauliflower-soup.html",
  "extension": "Chrome",
  "firstAdded": "2015-09-29T00:52:17.344000",
  "users": [
    null
  ],
  "keywords": [
    "head",
    "cauliflower",
    "florets",
    "broccoli",
    "olive",
    "oil",
    "divided",
    "kosher",
    "salt",
    "strips",
    "slab",
    "applewood",
    "pecanwood",
    "bacon",
    "pieces",
    "yellow",
    "onions",
    "garlic",
    "lowsodium",
    "chicken",
    "broth",
    "cream",
    "sharp",
    "white",
    "cheddar",
    "cheese",
    "parsley",
    "torn",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "Preheat oven to 450 degrees. Separate broccoli and cauliflower florets on two sheet pans. Drizzle both pans with two tablespoons of olive oil each and season with a generous pinch of kosher salt. Roast for 20 to 25 minutes or until caramelized and knife tender. Swap racks halfway during roasting. Remove and set a quarter of both the broccoli and cauliflower off to the side.",
    "Meanwhile in a Dutch oven add the bacon and 1 teaspoon olive oil. Heat over medium-low until bacon is cooked and crispy. Use a slotted spoon to transfer the bacon to a paper towel lined plate. Drain off all but a tablespoon of bacon fat.",
    "Add the onions to the pot, stir and cook 5 minutes or until the onions are soft. Add in the garlic and cook for 1 minute. Pour in the broth and the remaining cauliflower and broccoli. Cover, increase the heat to medium and simmer for 15 to 20 minutes.",
    "Ladle the broth and vegetables into a blender and puree until smooth. Pour the soup back into the pot, reduce the heat to low and add in the heavy cream. Stir and add the reserved vegetables and grated white cheddar cheese. Stir until the cheese has melted and the soup is heated through.Taste-check and season with kosher salt to your preference {I added 1-1/2 teaspoons}.",
    "Ladle soup into four bowls, top with crispy bacon, torn parsley, more cheddar cheese and a sprinkle of black pepper."
  ],
  "ingredients": [
    "0",
    "1 large head Cauliflower, cut into small florets {about 8 cups}",
    "1 large head Broccoli, cut into small florets {about 8 cups}",
    "1/4 cup plus 1 teaspoon Olive Oil, divided",
    "Kosher Salt",
    "2 strips slab Applewood or Pecanwood Bacon, cut into 1/2 inch pieces",
    "1 cup diced Yellow Onions",
    "2 cloves Fresh Garlic, minced",
    "4 cups Low-Sodium Chicken Broth",
    "1 cup Heavy Cream",
    "4 ounces Sharp White Cheddar Cheese, grated {plus more for serving}",
    "Fresh Parsley, torn {for garnish}",
    "Black Pepper, for serving"
  ],
  "__v": 1
}