{
  "hash": "539777dff2474d3c3480da771abba5a83175d56d",
  "title": "Beef Short Ribs Gravy",
  "image": "http://cdn0.afamilyfeast.com/wp-content/uploads/2015/07/short-ribs-gravy-200x300.jpg",
  "href": "http://www.afamilyfeast.com/beef-short-ribs-gravy/",
  "extension": "Chrome",
  "firstAdded": "2015-08-25T20:02:54.293000",
  "users": [
    null
  ],
  "keywords": [
    "meaty",
    "beef",
    "short",
    "ribs",
    "kosher",
    "salt",
    "black",
    "pepper",
    "extra",
    "virgin",
    "olive",
    "oil",
    "thickly",
    "shallots",
    "weight",
    "halves",
    "medium",
    "onion",
    "tomato",
    "bottle",
    "dark",
    "ale",
    "stout",
    "beer",
    "sprigs",
    "thyme",
    "left",
    "stem",
    "flat",
    "leaf",
    "parsley",
    "stems",
    "quarts",
    "stock",
    "worcestershire",
    "butter",
    "allpurpose",
    "flour",
    "mashed",
    "potatoes",
    "recipe"
  ],
  "directions": [
    "0",
    "Season the ribs with the salt and pepper.",
    "Heat a large oven proof Dutch oven over medium high heat and add oil.",
    "Once hot, add half the ribs and sear on all sides for 2-3 minutes per side or until browned. Remove to a platter and repeat for rest of ribs. Remove the second batch to the same platter.",
    "Preheat oven to 375 degrees F.",
    "Using same pot, turn the heat to medium and add the shallots and onions and cook for about three minutes or until just slightly cooked.",
    "Add tomato paste and cook and stir for one minute.",
    "Add the ale and stir and cook until reduced by half.",
    "Add the sprigs of thyme and parsley, stock and Worcestershire sauce. Add the seared ribs to the pot, bring to a boil, cover and place in oven for three hours with lid slightly ajar. Halfway through cooking, turn ribs, cover again and finish cooking with lid slightly ajar.",
    "If you are serving with mashed potatoes cook them now.",
    "With a pair of tongs, remove ribs and bones to a platter to cool.",
    "Remove and discard the thyme stems. The parsley will have disintegrated into the sauce.",
    "Pour the liquid into a container and with a ladle, skim off and discard the fat that floats to the top. I removed an entire cup of fat.",
    "Once the meat has cooled enough to handle, separate the meat from the bones, fat, gristle and sinew. Reserve meat and if not already shredded, shred with two forks. Discard bones and gristle. You should have 1 ½ pounds of cooked meat.",
    "Place butter in same pot that the ribs were cooked in and melt over medium heat.",
    "Add flour and stir to form a roux. Note, feel free to omit the two tablespoons of flour and just use the ¼ cup if you like your gravy on the thin side. Cook this mixture for about three minutes. Then one third at a time, add liquid back in whisking at each third.",
    "Adjust seasoning and add shredded beef back in. If too thick, thin down with a little water.",
    "Serve over mashed potatoes or rice or use in Poutine (recipe coming tomorrow)"
  ],
  "ingredients": [
    "0",
    "5 pounds meaty beef short ribs (about 8 ribs)",
    "1 teaspoon kosher salt",
    "½ teaspoon freshly ground black pepper",
    "3 tablespoons extra virgin olive oil",
    "1 ½ cups thickly sliced shallots (6 ounces in weight)",
    "1 ½ cups thickly sliced onion halves (about one medium to large onion)",
    "4 tablespoons tomato paste",
    "1 12-ounce bottle dark ale or stout beer",
    "3 large sprigs fresh thyme, left on the stem",
    "3 large sprigs flat leaf parsley, left on the stems",
    "1½ quarts vegetable stock",
    "1 tablespoon Worcestershire sauce",
    "¼ cup butter ( ½ a stick)",
    "¼ cup all-purpose flour plus 2 tablespoons (*See Note above)",
    "Additional salt and pepper to taste",
    "Mashed potatoes (see recipe here) for serving"
  ],
  "__v": 1
}