{
  "hash": "29123830af9c3066ca47bee8eb089a1327bef345",
  "title": "Chocolate Zucchini Brownies with Sweet Potato Frosting",
  "image": "https://cmt.azureedge.net/media/chocolate_zucchini_brownies_with_sweet_p_20180821125805868542d6v21d.jpg",
  "href": "https://www.copymethat.com/r/xeIKlpb/chocolate-zucchini-brownies-with-sweet-p/",
  "extension": "",
  "firstAdded": "2018-12-29T00:17:03.584000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 175°C/350°F and line a square baking tin with parchment paper.",
    "Add all the dry ingredients to a bowl and whisk together.",
    "Add all the liquid ingredients (except for flax eggs & zucchini) to a blender. Blend until you have a smooth mixture 1-2 minutes.",
    "Pour the wet mixture into the bowl with the dry ingredients. Add the flax egg, grated zucchini and vegan chocolate chips (optional).",
    "Whisk together with a spatula or hand mixer until smooth.",
    "Pour the batter into the baking tin and spread evenly.",
    "Place in the oven and bake for 40-45 minutes until a toothpick comes out clean from the center.",
    "In the meantime, prepare the sweet potatoes and steam/cook them until soft.",
    "Place into a high-speed blender with the remaining ingredients and mix well until very smooth. You want a smooth but firm frosting. Transfer to a bowl and refrigerate.",
    "Once the brownies are done, let them cool down for 30 minutes. Cut the brownies in half (I used a flossing string) and place a layer of the frosting on top of the base layer.",
    "Place the second brownie half on top and add the remaining frosting on top and on the sides.",
    "Decorate as you wish and serve! Stores in the fridge for 3-4 days."
  ],
  "ingredients": [
    "0",
    "Brownies:",
    "dry ingredients:",
    "1½ cup rice flour",
    "½ cup cacao powder",
    "½ cup coconut sugar",
    "¾ cup ground pecans",
    "1 Tbsp baking powder",
    "dash of sea salt",
    "wet ingredients:",
    "1 can black/kidney beans (15 oz)",
    "1½ cup coconut milk",
    "¼ cup maple syrup",
    "½ tsp vanilla extract",
    "2 flax eggs",
    "1 cup grated zucchini",
    "⅓ cup vegan chocolate chips (optional)",
    "Sweet Potato Frosting:",
    "2 small sweet potatoes, peeled & cooked",
    "½ cup 2 Tbsp nut butter (I used cashew)",
    "¼ cup maple syrup",
    "5 Tbsp cacao powder",
    "½ tsp vanilla extract"
  ],
  "__v": 1
}