{
  "hash": "959f016656c750c78077be07e8261843d16ed0a4",
  "title": "rice pudding",
  "image": "https://lh3.ggpht.com/H5SO6KS1UPF-mMPj5zClyRfPST3oFjZsI34r5QQfANGokf4TlWDN1AI1yC3wj5o_oOh9cwpPxOoATvDFIHZetKiyFMc=s535-c",
  "href": "https://www.keyingredient.com/recipes/947145038/creamy-homemade-rice-pudding-pressure-cooker-style/utm_source=from_pinterest_overlay",
  "extension": "Chrome",
  "firstAdded": "2016-10-26T16:39:38.415000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "NOTE: I use an 8-quart electric pressure cooker. I have used a stovetop version, and I would follow the same steps if that is what you have.",
    "In the pressure cooker pot, combine rice, sugar, salt, cinnamon and milk.",
    "For an electric pressure cooker, select saute/brown and bring to a boil, stirring constantly to dissolve sugar. For a stovetop, bring to a boil on medium-high heat, stirring often.",
    "As soon as the mixture comes to a boil, cover and lock lid in place. Select Low Pressure and set timer for 16 minutes.",
    "While rice is cooking, whisk eggs with half and half and vanilla, set aside.",
    "When the beep sounds, turn off pressure cooker, wait 10 minutes and then use a quick pressure release. Carefully remove the lid. Stir the rice in pot.",
    "Stir the egg mixture into the pot. Select saute/brown and cook uncovered until mixture just starts to boil. Turn off pressure cooker. Stir in raisins.",
    "Serve immediately, or pour into servings dishes cool then chill. (Pudding will thicken as it cools. I prefer my rice pudding to be warm. For leftover rice pudding, splash a little whole milk and microwave for about 1 minutes. Stir and enjoy!"
  ],
  "ingredients": [
    "0",
    "Unlock Grocery List!",
    "1½cups Arborio rice",
    "¾cup sugar",
    "½teaspoon salt",
    "¼teaspoon cinnamon",
    "5cups milk",
    "2eggs",
    "1cup half and half",
    "1½teaspoons vanilla extract",
    "1cup raisins (I used golden)"
  ],
  "__v": 1
}