{
  "hash": "b65f87f123979338a453798d7c4dfb937a83b61a",
  "title": "Easy Matcha Avocado Cheesecake",
  "image": "http://recipe-folder.com/img/recipe-images/093/198/862717993.jpg",
  "href": "https://www.tastingtable.com/cook/recipes/matcha-cheesecake-recipe-california-avocado",
  "extension": "Firefox",
  "firstAdded": "2017-05-15T21:12:35.101000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the crust: Preheat the oven to 350°. In a medium bowl, mix together all the crust ingredients until incorporated and press into a 9-inch springform pan. Spread the crumbs evenly along the bottom and 1 inch up the sides of the pan. Bake until golden, 15 minutes. Let cool completely.",
    "Make the filling: In a food processor, purée the eggs and California Avocados until smooth. In a stand mixer fitted with the paddle attachment, combine the cream cheese, sugar, sour cream, matcha powder, lemon zest and salt. Beat on medium speed until smooth. With the motor running, slowly add the egg mixture until a smooth batter forms, scraping as needed.",
    "Wrap the bottom of the springform pan with 2 large sheets of foil and place in a roasting pan. Pour the cream cheese mixture over the crust.",
    "Pour boiling water into the roasting rack halfway up the pan and bake until set, 1 hour and 20 minutes. Remove from the water bath and let cool completely. Refrigerate overnight, then the next day, dust with more matcha powder, slice and serve."
  ],
  "ingredients": [
    "0",
    "For the Crust:",
    "1½ cups graham cracker crumbs",
    "6 tablespoons unsalted butter, melted",
    "½ teaspoon cinnamon",
    "½ teaspoon kosher salt",
    "For the Filling:",
    "4 room–temperature eggs",
    "2 medium California avocados—halves, pitted and peeled",
    "24 ounces room-temperature full-fat cream cheese",
    "1½ cups sugar",
    "½ cup sour cream",
    "1 tablespoon matcha powder, plus more for garnish",
    "1 teaspoon lemon zest",
    "½ teaspoon salt",
    "Boiling water, for baking"
  ],
  "__v": 1
}