{
  "hash": "4f92d0635791f34b1eb3ea2b7b61dc3f553d2ec3",
  "title": "Turkey, Cranberry, and Pesto Sandwich",
  "image": "http://img.sndimg.com/food/image/upload/w_555,h_416,c_fit,fl_progressive,q_95/v1/img/recipes/38/92/42/O4RM3UEoQ7Kod3jgOfxV_DSC_0146.JPG",
  "href": "http://www.food.com/recipe/turkey-cranberry-and-pesto-sandwich-389242",
  "extension": "Chrome",
  "firstAdded": "2015-11-28T17:00:31.694000",
  "users": [
    null
  ],
  "keywords": [
    "baguette",
    "lengthwise",
    "pesto",
    "possible",
    "heirloom",
    "tomatoes",
    "cranberries",
    "roughly",
    "butter",
    "lettuce",
    "leaf",
    "turkey",
    "breast",
    "havarti",
    "cheese"
  ],
  "directions": [
    "0",
    "Build the sandwich by first spreading pesto on both sides of the bread.",
    "Layer turkey, lettuce, tomatoes, cranberries, and cheese on to the bottom piece of bread. Add the top. Slice into 6-8 little sandwiches.",
    "Serve and enjoy with your favorite sparkling wine cocktail at a luncheon. You can also Bake for a few minutes until the cheese melts and serve hot with some warm apple cider in the winter time.",
    "Note1: I like to prepare fresh pesto straight from my garden the traditional way using lots of fresh basil, lemon juice, toasted pine nuts, garlic, Olive Oil, and salt/pepper.",
    "Note2: When preparing the turkey, tomatoes, lettuce, and cheese, ensure the sizes fit the size of your bread. For a small baguette, they need to be fairly small.",
    "Note3: Place the Cranberries directly on the Pesto. They will stick into the sandwich better this way.",
    "Note 4: It is important to use good quality turkey. I prefer to roast my own after soaking in a basic brine for 24-48 hours. If you don't have the time to do this, use your favorite good quality deli cut."
  ],
  "ingredients": [
    "0",
    "1 baguette, sliced in half lengthwise",
    "1⁄2 cup pesto sauce, as fresh as possible",
    "4 small heirloom tomatoes, sliced",
    "1⁄4 cup dried cranberries, roughly chopped",
    "1⁄2 cup butter lettuce leaf",
    "16 ounces turkey breast, sliced",
    "8 ounces havarti cheese, sliced"
  ],
  "__v": 1
}