{
  "hash": "56c91012fc028d346fe6616fa72ba0d57d314fc7",
  "title": "Quarter Pounder Beet Burger",
  "image": "http://farm8.staticflickr.com/7013/6801889691_d493e7a713_z.jpg",
  "href": "http://www.isachandra.com/2012/02/quarter-pounder-beet-burger/",
  "extension": "Chrome",
  "firstAdded": "2018-02-20T20:58:17.609000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Peel beets and shred with the shredder attachment of your food processor, then set aside. Change the attachment to a metal blade. Pulse the brown rice, shredded beets and lentils about 15 to 20 times, until the mixture comes together, but still has texture. It should look a lot like ground meat:",
    "Now transfer to a mixing bowl and add all the remaining ingredients. Use your hands to mix very well. Everything should be well incorporated, so get in there and take your time, it could take a minute or two.",
    "Place the mixture in the fridge for a half hour to chill.",
    "Preheat a cast iron pan over medium-high. Now form the patties. Each patty will be a heaping 1/2 cup of mixture. To get perfectly shaped patties, use a 3 1/2 inch cookie cutter or ring mold (I have pics of how to do it here.) Otherwise, just shape them into burgers with your hands.",
    "Pour a very thin layer of oil into the pan and cook patties for about 12 minutes, flipping occasionally. Do two at a time if you’re pan isn’t big enough. Drizzle in a little more oil or use a bottle of organic cooking spray as needed. Burgers should be charred at the edges and heated through.",
    "Serve immediately. But they taste pretty great heated up as well, so if you want to cook them in advance, refrigerate, then gently heat in the pan later on, then that is cool, too."
  ],
  "ingredients": [
    "0",
    "1 1/4 cups cooked, cooled brown rice (see recipe notes above)",
    "1 cup cooked brown or green lentils, cooled, drained well",
    "1 cup shredded beets",
    "1/2 teaspoon salt",
    "Fresh black pepper",
    "1 teaspoon thyme, rubbed between your fingers",
    "1/2 teaspoon ground fennel (or finely crushed fennel seed)",
    "1 teaspoon dry mustard",
    "3 tablespoons very finely chopped onion",
    "2 cloves garlic, minced",
    "2 tablespoons smooth almond butter",
    "1/2 cup very fine breadcrumbs"
  ],
  "__v": 1
}