{
  "hash": "ee21597eba5dba0357d3ac8ea03f775604d81ea8",
  "title": "Pan Seared Halibut with Kaale and Butternut Squash",
  "image": "http://33.media.tumblr.com/d65be0c6e88c503c2416b56847594dc8/tumblr_inline_msxouujRos1qz4rgp.jpg",
  "href": "http://www.malloryskitchen.com/post/61019733981/pan-seared-halibut-with-kale-and-butternut-squash",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T22:27:21.122000",
  "users": [
    null
  ],
  "keywords": [
    "lbs",
    "halibut",
    "skin",
    "butternut",
    "squash",
    "bulb",
    "fennel",
    "anise",
    "bunch",
    "lacinato",
    "kale",
    "garlic",
    "butter",
    "olive",
    "oil",
    "salt",
    "pepper",
    "sage",
    "leaves"
  ],
  "directions": [
    "0",
    "Preheat oven to 400 degrees. Wash & peel your butternut squash. Remove seeds.",
    "Slice the squash into rounds, then chop into small cubes. Coat lightly with olive oil, salt & pepper and place on a foil lined baking sheet into the oven, stirring occasionally, for 20-30 minutes until crisp and golden brown.",
    "Slice the fennel width-wise into about ¼ inch slices. Coat both sides lightly in olive oil on a foil lined baking sheet. Place in the oven with the butternut squash, checking on it after 5 minutes and flipping the slices over. Return to the oven for another 3-4 minutes until golden and crispy.",
    "Divide the halibut into 4 even pieces. The skin may be difficult to slice through so use kitchen shears if needed. Drizzle with olive oil and sprinkle with salt & pepper. Allow to sit for about ten minutes.",
    "Wash the kale and chiffonade into ribbons, see above picture.",
    "In a medium pan, heat olive oil and sliced garlic cloves over medium-high heat. Add the kale and toss for a few minutes, until the kale turns a deep green color but is still on the crunchy side.",
    "In a large skillet, heat a couple tablespoons of olive oil over high heat and place the halibut, skin-side down, on the skillet. Allow to sear for 5 minutes, until the skin is brown and crispy. Do not move the pieces during those 5 minutes. Then carefully flip the pieces over with a large spatula so that the skin doesn’t stick or tear. Cook for another 2-3 minutes.",
    "In a small saucepan, melt butter, add fresh sage leaves, and keep over medium-high heat until browned.",
    "Plate the dish. Divide the kale evenly among 4 plates, then spoon squash over the kale, then top with the halibut, skin-side up. Add slices of fennel and drizzle with sage brown butter."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "1.5 lbs (24 oz) halibut, skin on",
    "1 small butternut squash",
    "1 bulb of fennel (anise)",
    "1 small bunch of Lacinato kale",
    "2 cloves garlic",
    "4 tbsp butter",
    "olive oil",
    "sea salt",
    "pepper",
    "4-5 fresh sage leaves"
  ],
  "__v": 1
}