{
  "hash": "c97c79f341322ce17189c3fa0cf81ac5d073bc41",
  "title": "Dark Chocolate Peanut Butter Banana Bread",
  "image": "http://kitchenmeetsgirl.com/wp-content/uploads/2013/08/PB-Banana-Bread-2.jpg",
  "href": "http://kitchenmeetsgirl.com/dark-chocolate-peanut-butter-banana-bread/",
  "extension": "Chrome",
  "firstAdded": "2016-07-14T17:29:27.270000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350.",
    "In a microwave safe bowl, combine chocolate peanut butter and 1 teaspoon of the oil. Microwave on high until melted, about 30 seconds; stir. Combine 3 tablespoons oil, butter, brown sugar and banana in a large bowl, and beat with a mixer on medium-high speed until well combined. Add the eggs, 1 at a time, beating well after each addition.",
    "Combine flour, baking soda, baking powder, and salt in a separate bowl. With the mixer running at low speed, all the flour mixture and the buttermilk alternately to banana mixture, beginning and ended with the flour mixture. Mix until just combined.",
    "Pour half of the batter into a greased 9x5 inch loaf pan. Top with peanut butter mixtures. Spread the remaining batter over the top. Using a wooden pick or knife, gently swirl the batter. Sprinkle the top of the batter with dark chocolate chunks.",
    "Bake for 55 minutes, or until a wooden pick inserted in the center comes out with moist crumbs clinging. Cool 10 minutes in the pan on a wire rack. Remove the bread from the pan, then allow to cool completely on rack."
  ],
  "ingredients": [
    "0",
    "5 tablespoons chocolate peanut butter (I used Dark Chocolate Dreams)",
    "3 tablespoons plus 1 teaspoon canola oil, divided",
    "3 tablespoons butter, softened",
    "½ cup packed brown sugar",
    "2 medium ripe bananas, sliced",
    "2 large eggs",
    "1½ cups all-purpose flour",
    "¾ teaspoon baking soda",
    "½ teaspoon baking powder",
    "½ teaspoon salt",
    "⅔ cup buttermilk",
    "¼ to ⅓ cup dark chocolate chunks"
  ],
  "__v": 1
}