{
  "hash": "5f670ba781c4b070d8e52e361de6eec6ff646791",
  "title": "SLOW-COOKED BEEF SHORT RIBS",
  "image": "https://www.gordonramsay.com/assets/Recipes/_resampled/CroppedFocusedImage192072050-50-Bourgignon-Short-Ribs-1650.jpg",
  "href": "https://www.gordonramsay.com/gr/recipes/slow-cooked-beef-short-ribs/",
  "extension": "Chrome",
  "firstAdded": "2016-03-18T12:49:17.034000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "frying",
    "thickcut",
    "meaty",
    "beef",
    "short",
    "ribs",
    "head",
    "garlic",
    "horizontally",
    "heaped",
    "tomato",
    "bottle",
    "red",
    "wine",
    "litre",
    "stock",
    "pancetta",
    "lardons",
    "chestnut",
    "mushrooms",
    "trimmed",
    "salt",
    "black",
    "pepper",
    "flat",
    "leaf",
    "parsley"
  ],
  "directions": [
    "0",
    "METHOD",
    "Serves 4",
    "Preheat the oven to 170°C/Gas",
    "Heat a deep-sided roasting tray on the hob and add a glug of olive oil. Season the short ribs thoroughly, then fry for 10–15 minutes to brown really well on all sides.",
    "Add the halved garlic head, cut side down, pushing it to the bottom of the pan. Add the tomato purée and heat for a minute or two to cook it out. Pour in the wine to deglaze the pan, scraping up the bits at the bottom. Bring to the boil and cook for 10–15 minutes until the liquid is reduced by half, then add stock to nearly cover the ribs (you’ll need less stock if your roasting tray isn’t very large). Bring to the boil again, basting the ribs with the juices.",
    "Cover the roasting tray with foil and cook in the preheated oven for 3–4 hours, basting now and then until the meat is tender and falling away from the bone.",
    "About 10 minutes before the short ribs are ready to come out, fry the pancetta for 2–3 minutes until crisp and golden. Add the mushrooms and cook for 4–5 minutes until tender. Drain off any excess fat.",
    "When the short ribs are ready, remove from the oven and transfer to a serving dish. Squeeze the garlic cloves out of their skins and pass through a sieve. Spoon off any excess fat from the beef cooking liquid, then strain it through the sieve and mix with the garlic. (If the sauce is too thin, reduce the cooking liquid by heating for 10–15 minutes more after straining.)",
    "Serve the short ribs topped with the hot pancetta and mushrooms and the sauce poured around. Garnish with chopped flat leaf parsley."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "Olive oil, for frying",
    "6 thick-cut meaty beef short ribs",
    "1 large head of garlic, cut in half horizontally",
    "1 heaped tbsp tomato purée",
    "1 x 750ml bottle red wine",
    "1 litre beef stock",
    "150g pancetta lardons",
    "250g small chestnut mushrooms, trimmed and halved",
    "Sea salt and freshly ground black pepper",
    "Chopped flat leaf parsley, to garnish"
  ],
  "__v": 1
}