{
  "hash": "adef11f742b38ae5837362fafa131237e9d41d7d",
  "title": "Clam Toasts with Pancetta",
  "image": "",
  "href": "https://www.bonappetit.com/recipe/clam-toasts-with-pancetta",
  "extension": "Chrome",
  "firstAdded": "2018-06-24T13:22:37.017000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat 1 Tbsp. oil in a large skillet over medium. Add pancetta and cook, stirring occasionally, until brown and crisp, 5–7 minutes. Add sliced garlic and cook, stirring often, until garlic is golden around the edges, about 1 minute. Reduce heat to medium-low and add sweet onion and chopped fennel. Cook, stirring occasionally, until softened and onion is translucent, 6–8 minutes. Add lemon zest, bay leaf, ground fennel, ½ cup wine and a pinch of salt. Increase heat to medium-high and cook, stirring occasionally, until wine is mostly reduced but mixture is still a little bit saucy, about 3 minutes. Transfer soffritto to a medium bowl; discard lemon zest and bay leaf. Wipe out skillet.",
    "Heat 2 Tbsp. oil in same skillet over medium. Arrange bread slices in skillet and cook until golden brown, about 1 minute per side. Transfer to paper towels to drain. Cut 1 garlic clove in half and rub one side of each toast with cut side of garlic. Wipe out skillet.",
    "Heat 1 Tbsp. oil in same skillet over medium. Crush remaining garlic clove with the side of a chef’s knife and cook, stirring often, until it begins to turn golden, about 1 minute. Add clams, soffritto, and remaining ½ cup wine. Increase heat to medium-high and bring to a boil. Cook, uncovered, until liquid is reduced by half and clams are open (discard any that do not open), 5–7 minutes. Add parsley and fennel fronds and cook 1 minute longer. Taste and season with salt if needed.",
    "To serve, place fried bread on plates and spoon clam mixture and cooking broth over. Drizzle with oil and sprinkle with red pepper flakes.",
    "Do Ahead: Soffritto can be made 2 days ahead. Let cool; cover and chill."
  ],
  "ingredients": [
    "0",
    "4 tablespoons olive oil, divided, plus more for drizzling",
    "2 ounces pancetta (Italian bacon), finely chopped",
    "4 garlic cloves, 2 thinly sliced, 2 whole",
    "½ medium sweet onion, finely chopped",
    "½ small fennel bulb, finely chopped, plus ¼ cup fennel fronds",
    "2 wide 3-inch strips lemon zest",
    "1 bay leaf",
    "½ teaspoon ground fennel",
    "1 cup dry white wine, divided",
    "2 1½-inch-thick slices sourdough bread",
    "1 pound Manila or littleneck clams or cockles",
    "¼ cup parsley leaves with tender stems",
    "Crushed red pepper flakes (for serving)"
  ],
  "__v": 1
}