{
  "hash": "68aa701f90787aa7de71dfbb6f2b843e7b525893",
  "title": "Wonton Noodles Recipe",
  "image": "https://rasamalaysia.com/wp-content/uploads/images/thumbs/wontonnoodles_thumb.jpg",
  "href": "https://rasamalaysia.com/wonton-noodles-malaysian-wantan-mee-recipe/",
  "extension": "Chrome",
  "firstAdded": "2018-12-11T13:53:32.060000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Prepare pickled green chillies:",
    "Combine vinegar, salt and sugar in a bowl and mix well to dissolve. Taste and adjust salt/sugar if desired. Place sliced chillies in another bowl and pour boiling water over them. Let it stand for 30 seconds, and then drain off the water. Pour the vinegar solution over the chillies, ensuring the chillies are completely covered. Refrigerate for at least 2 hours until chillies turn into an olive-green colour.",
    "Prepare wontons:",
    "Combine all ingredients for pork mince (except wrappers) and mix well. Place a teaspoon of the mixture in the middle of each wonton wrapper, and then lightly moisten the edges of the wrapper with water. Seal the edges to form a triangle shape, then press the edges to thin out the dough. Bring the corners together and squeeze to form a \"money bag\". Repeat with the rest of the wrappers. Set aside on a plate until ready to cook.",
    "Prepare garlic oil:",
    "Heat the oil in a pan and fry the garlic over low-medium heat until it starts to turn lightly golden in colour and crisp. Transfer immediately to a heat proof bowl and set aside.",
    "Prepare mushroom sauce:",
    "Soak mushrooms in 1 cup warm water until softened. Squeeze out excess water from mushrooms, set aside, and reserve the soaking liquid for later. Slice the mushrooms if desired. Heat up 1/2 tbsp vegetable oil in a small saucepan. Fry the garlic and mushrooms for 1 minute. Then add the rest of the ingredients except for the cornstarch solution. Bring to a boil. Cover and simmer for 20 minutes. Add cornstarch solution and stir until the sauce boils and thickens slightly. Taste and adjust seasoning if desired. Turn off the heat, cover the saucepan and set aside.",
    "Prepare vegetables:",
    "Bring a large pot of water to the boil. Add 1 tbsp vegetable oil and a pinch of salt and sugar. Blanch the choy sum stems first, followed by the leaves. Remove, drain and set aside.",
    "Cook wontons:",
    "Boil some water in pot and cook the wontons in batches for about 1-2 minutes until cooked. Stir occasionally to prevent sticking to the bottom of the pot. Drain and set aside. Alternatively, add them to some prepared chicken broth and garnish with spring onions.",
    "Prepare noodles:",
    "In a shallow serving bowl, place 1 serve of the seasoning sauce.",
    "With the same boiling water used for blanching the vegetables, bring it to a rolling boil, and cook 1 bundle (100g / 3oz) of noodles for about 30 seconds or until done to your liking. Use a large sieve to drain the noodles and run it under cold running tap water for 5 seconds, then dip the noodles in the boiling water again just to warm it up. Transfer the noodles into the serving bowl and toss them in the seasoning sauce. Add 6 tbsp of the mushroom sauce and toss again. Add a dash of white pepper.",
    "Garnish the noodles with choy sum, wontons and sliced char siu pork. Serve immediately wth pickled green chillies and a bowl of wonton soup. If you like it spicy, mix the noodles with some Sriracha chilli sauce. Enjoy!"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "400 g 14 oz fresh wonton noodles (egg noodles)",
    "1/2 bunch choy sum washed and cut into 2 inch lengths",
    "Vegetable oil",
    "Approx 300g 10 oz char siu pork thinly sliced into bite-sized pieces",
    "White pepper",
    "Sriracha chilli sauce to serve (optional)",
    "Pickled green chillies:",
    "5-6 long green chillies sliced thinly",
    "Boiling water",
    "2/3 cup Chinese white rice vinegar",
    "1/2 tsp salt",
    "2-3 tbsp sugar",
    "Wontons:",
    "1 packet square wonton wrappers about 40 sheets",
    "150 g 5 oz pork mince",
    "150 g 5 oz prawn meat",
    "1 tbsp egg white",
    "1 tsp grated ginger",
    "2 tsp soy sauce",
    "1/2 tbsp oyster sauce",
    "1/2 tsp chicken stock powder",
    "1 tsp sesame oil",
    "1/4 tsp salt",
    "1/2 tsp sugar",
    "1/8 tsp pepper",
    "Garlic oil:",
    "4 cloves garlic finely chopped",
    "3 tbsp vegetable oil",
    "Mushroom Sauce:",
    "5-6 Chinese dried black mushrooms stems removed",
    "1 cup warm water",
    "2 cloves garlic lightly crushed with the back of a knife",
    "1 1/2 cups water",
    "1 tsp chicken stock powder",
    "1 1/2 tbsp oyster sauce",
    "2 tsp soy sauce",
    "1 tsp mushroom flavoured soy optional",
    "Salt and pepper to taste",
    "1/2 tbsp cornstarch dissolved in 2 tbsp water",
    "Seasoning sauce (per serving of noodles):",
    "1 tbsp thick dark soy sauce Cheong Chan brand thick caramel",
    "1/2 tbsp soy sauce",
    "1 tsp sesame oil",
    "1/8 tsp salt or to taste",
    "1/2 tsp sugar",
    "2 tsp prepared garlic oil"
  ],
  "__v": 1
}