{
  "hash": "853baf5d0af66f3570200bceaf9bb2d4dd229328",
  "title": "Pampushky",
  "image": "",
  "href": "https://recipeland.com/recipe/v/pampushky-45638",
  "extension": "Chrome",
  "firstAdded": "2018-02-25T03:22:54.735000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine the sugar and water, sprinkle with the yeast, and let stand until soft.",
    "Heat the milk to lukewarm, and add the milk and ¼ cup of the flour to the yeast mixture.",
    "Beat well, cover and allow to rise until light and bubbly, about 10 minutes.",
    "In another bowl, cream the butter and sugar.",
    "Beat eggs and egg yolks together, blending well and combine with the sugar-butter mixture, beating thoroughly until the eggs are pale white.",
    "Grate a lemon on a fine grater until all of the yellow color is grated off and add this (the zest), vanilla, and the yeast mixture to the butter-egg mixture.",
    "Mix in 4 cups of flour. If the dough seems a little loose, add a little more, but the dough should be soft.",
    "Knead, by hand, for about 10 minutes.",
    "Replace in a greased bowl, turning once to grease the top, and cover with a damp towel, set in a warm place until double in bulk.",
    "Punch down, knead a few more times, and allow to rise again until the dough is doubled.",
    "When doubled, divide the dough into 4 parts.",
    "On a lightly floured surface, roll one part into a rectangle about ¼ inch thick, turning once or twice during the rolling to achieve a uniform thickness.",
    "Dust with flour sparingly. Place 1 teaspoon of rose preserve at evenly space intervals on the dough, or with a 2½-inch cutter, gently form impressions and place the filling in each.",
    "Roll another portion out, as above, to the same thickness, and gently cover the first, overlapping a little.",
    "Cut circles with the cutter. Place them on a lightly floured cookie sheet and allow rise until double in size.",
    "Repeat until all of the dough is used, rolling out the scraps last.",
    "Heat oil or shortening to 375℉ (190℃). in a deep fryer or wide skillet.",
    "Test the temperature by frying a piece of bread; it should bubble and turn golden quickly.",
    "The fat should not be smoking.",
    "Fry 5 or 6 pampushky at a time."
  ],
  "ingredients": [
    "0",
    "2\ttablespoons\tsugar",
    "2\tpackages\tyeast, active dry",
    "¼\tcup\tmilk",
    "5\tcups\tall-purpose flour",
    "¼\tpound\tbutter",
    "½\tcup\tsugar",
    "2\tlarge\teggs",
    "3\tlarge\tegg yolks",
    "1\tteaspoon\tvanilla extract"
  ],
  "__v": 1
}