{
  "hash": "d2bbae6f0d74275be248fd91360dbf436466718b",
  "title": "One Pot Bacon Broccoli Mac and Cheese",
  "image": "https://www.budgetbytes.com/wp-content/uploads/2017/05/One-Pot-Bacon-Broccoli-Mac-and-Cheese-above-200x200.jpg",
  "href": "https://www.budgetbytes.com/one-pot-bacon-broccoli-mac-cheese/",
  "extension": "Firefox",
  "firstAdded": "2019-03-03T07:59:59.061000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare the ingredients before beginning because the process goes quickly once it's begun. Thaw the broccoli florets and chop them into small bite-sized pieces. Slice the bacon into small pieces. Shred the cheddar cheese.",
    "Cook the pasta according to the package directions (boil 7-10 minutes, or until al dente). Drain the pasta in a colander and set it aside.",
    "Return the pot to the stove, add the bacon, and cook over medium to medium-low heat until the bacon is brown and crispy (about 5 minutes). Use a slotted spoon to remove the bacon from the pot, leaving the grease behind.",
    "Add the evaporated milk, smoked paprika, Dijon, hot sauce, and salt to the pot with the bacon grease. Stir to combine and allow it to heat through (it should heat quickly as the pot will be very hot from cooking the bacon).",
    "Once the evaporated milk is hot, turn the heat to low and begin whisking in the shredded cheddar, one handful at a time, waiting until the cheese is fully melted before adding the next handful. Once all of the cheese has been melted into the sauce, taste the cheese sauce and adjust the salt or hot sauce if desired. If the sauce becomes too thick, simply stir in one to two tablespoons of the remaining evaporated milk in the can.",
    "Return the cooked pasta, crispy bacon (crumble into smaller pieces if desired), and chopped broccoli to the pot with the cheese sauce. Stir to combine. Serve immediately."
  ],
  "ingredients": [
    "0",
    "1/2 lb frozen broccoli florets ($1.05)",
    "4 oz bacon ($1.43)",
    "8 oz medium cheddar ($2.50)",
    "1/2 lb pasta ($0.50)",
    "1 cup evaporated milk ($1.19)",
    "1/2 tsp smoked paprika ($0.05)",
    "1/2 tsp hot sauce ($0.05)",
    "1/2 tsp Dijon mustard ($0.02)",
    "1/4 tsp salt ($0.02)"
  ],
  "__v": 1
}