{
  "hash": "ffae9e81fc158b2a9b10cda27ac93db9d265ca48",
  "title": "ASIAGO CHEESE BREAD",
  "image": "https://www.tastesoflizzyt.com/wp-content/uploads/2014/05/DSC_0946_edited-1.jpg",
  "href": "https://www.tastesoflizzyt.com/asiago-cheese-bread/",
  "extension": "Chrome",
  "firstAdded": "2017-04-11T19:58:35.816000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "In the bowl of a stand mixer, combine 1 1/2 cups flour, yeast, sugar, salt and pepper. Put the milk in a microwave safe bowl. Add the butter. Heat the milk to 120-130 degrees so that the butter starts melting. Make sure the temperature is just right so that it is warm enough to activate the yeast, but not kill it. Stir the milk mixture into the flour mixture and mix on low speed using the paddle attachment until smooth. Add in 1 1/4 cups shredded cheese and mix just until combined.",
    "Gradually add in 1 3/4 cups flour to make a soft dough. Knead in the stand mixer with the dough hook for 5 minutes.",
    "Spray a bowl with cooking spray. Add the dough to the bowl, then turn the dough over so the cooking spray coats both sides of the dough. Cover the bowl and allow the dough to rise in a warm place until it is double (anywhere from 1-2 hours).",
    "After the dough is doubled, punch it down and form it into two loaves. Place the loaves on a baking sheet that has been sprayed with cooking spray. Cover the loaves and allow them to rise again until doubled, which will take 30-45 mintues.",
    "Preheat the oven to 375 degrees.",
    "Make 3-4 cuts in the top of the loaves with a serrated knife. Brush the tops of the loaves with the beaten egg adn then sprinkle the remaining cheese on top. Bake for 30-35 minutes until lightly browned."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "3 1/4 cups all-purpose flour",
    "1 packet Red Star Platinum yeast",
    "1 1/2 teaspoons salt",
    "1 teaspoon sugar",
    "1/4 teaspoon black pepper",
    "1 1/4 cups milk",
    "2 tablespoons butter",
    "1 1/2 cups shredded Asiago cheese, divided",
    "1 egg, beaten"
  ],
  "__v": 1
}