{
  "hash": "078a68fbccdf2020eca44aa510420797c8dc5d14",
  "title": "Pappadeaux Fondue",
  "image": "https://cmt.azureedge.net/media/pappadeaux-fondeaux-20180117152656227316v0p67h.jpg",
  "href": "https://www.copymethat.com/r/OsLXZ5x/pappadeaux-fondeaux/",
  "extension": "Chrome",
  "firstAdded": "2018-12-23T18:25:38.122000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a saucepan, combine 2 TBLS butter, flour, and onion. Cook over medium heat until onions are tender, about 5 minutes.",
    "Slowly stir in stock and white wine, whisking until smooth.",
    "Add cayenne pepper and salt, and simmer for 10 minutes.",
    "Add cream, and simmer 5 minutes more. Remove from heat and set aside.",
    "Season shrimp with blackening seasoning.",
    "Melt 1 TBLS butter in a hot saute pan. Saute shrimp in butter about 2 minutes per side.",
    "Add spinach, mushrooms, crab meat and green onions. Saute until mushrooms and spinach soften, about 2 minutes.",
    "Fold into cream sauce and bring to a simmer.",
    "Add half of the grated mozzarella. Simmer another couple of minutes so the cheese melts.",
    "Slowly add xanthun gum as needed to thicken. (A little goes a long way. Don't overuse.)",
    "Pour mixture into a heatproof dish (or two). Top with remaining grated cheese.",
    "Place under a broiler until cheese melts, about 3-4 minutes.",
    "Top with chives if desired and serve immediately with garlic bread OR pork skins for keto."
  ],
  "ingredients": [
    "0",
    "3 TBLS butter (divided)",
    "3 TBLS all-purpose flour OR almond flour",
    "¼ onion, diced",
    "½ cup chicken stock (or fish stock for extra fish flavor)",
    "¼ cup white wine",
    "⅛ tsp cayenne pepper",
    "1 tsp salt",
    "1 cup heavy cream",
    "12 raw shrimp, peeled and deveined, cut in half",
    "¼ tsp Blackening seasoning (store-bought or make your own)",
    "1 large handful of chopped fresh spinach",
    "6 oz sliced mushrooms",
    "4 oz lump crab meat",
    "½ tsp xanthun gum (+ a tiny bit more if needed for thickening)",
    "8 oz Monterey Jack cheese, grated (divided)",
    "Optional: 1 TBLS chopped chives"
  ],
  "__v": 1
}