{
  "hash": "a2e5667906cd4cbf27f3db28ec593c74ba857b7f",
  "title": "Lobster-Crab Cakes with Lemon-Grass Aioli and Chunky Cucumber-Grapefruit Salad",
  "image": "",
  "href": "http://recipe-folder.com/recipe/5bf3215f780287195894fe92",
  "extension": "User Added",
  "firstAdded": "2018-11-19T20:47:27.508000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Trim and thin lemon grass. Add oils to saucepan and gently heat lemon grass for 10 minutes over medium heat. Cool, cover and let stand for 6 hours.",
    "1",
    "Place panko on a shallow plate. Grate 2 tsp lemon zest. Cut up lobster and crab and season with salt and pepper.",
    "2",
    "Separate egg and refrigerate yolk until ready to use.",
    "3",
    "Add egg white to lobster-crab mixture along with mayo and mix. Stir in herbs and lemon zest; Divide into 8 balls. Add each ball to the breadcrumbs forming into a patty shape once coated. Place on baking sheet. Will keep up to a day in fridge.",
    "4",
    "Whirl reserved yolk and vinegar into food processor. Slowly add lemon grass oil until emulsified. Aioli will keep for a day in fridge with plastic wrap pressed on surface in a sealed container.",
    "5",
    "Prepare salad just ahead of time. Slice cucumber in half, scoop out seeds and cut into chunks. Add grapefruit segments, drizzle with olive oil and scatter parsley and dill over top.",
    "6",
    "Heat oven to 400F. Just before baking dab each side of cake with oil. Bake for 10-12 minutes.",
    "7",
    "Cut zested lemon into 8 wedges. Serve cakes topped with aioli alongside salad. Use lemon foe seasoning."
  ],
  "ingredients": [
    "0",
    "Lemon-Grass Aioli",
    "1",
    "2 lemon grass stalks",
    "2",
    "3/4 cup vegetable oil",
    "3",
    "1/4 cup olive oil",
    "4",
    "2 tsp white vinegar",
    "5",
    "1/2 tsp salt",
    "6",
    "Lobster-Crab Cakes",
    "7",
    "1/2 to 2/3 panko crumbs",
    "8",
    "1 lemon",
    "9",
    "2 pkgs or cans frozen lobster meat (360g total) or 2 lobster tails",
    "10",
    "220g crab meat",
    "11",
    "1 tsp salt",
    "12",
    "1/4 tsp black pepper",
    "13",
    "2Tbsp mayonnaise",
    "14",
    "3 Tbsp chopped parsley",
    "15",
    "3 Tbsp chives",
    "16",
    "1 Tbsp olive oil",
    "17",
    "Cucumber-Grapefruit Salad",
    "18",
    "2 cucumbers",
    "19",
    "2 grapefruits",
    "20",
    "2-3 Tbsp olive oil",
    "21",
    "generous pinch of salt",
    "22",
    "1/2 each cup torn parsley and mint"
  ],
  "__v": 1,
  "hidden": true
}