{
  "hash": "3520161302de8f79f8d8f6e6f7ebb84067a9faa7",
  "title": "20-Minute BLT Pasta Salad",
  "image": "https://s.w.org/images/core/emoji/72x72/1f609.png",
  "href": "http://bakerbynature.com/20-minute-blt-pasta-salad/",
  "extension": "Chrome",
  "firstAdded": "2016-03-29T16:47:30.959000",
  "users": [
    null
  ],
  "keywords": [
    "bow",
    "tie",
    "pasta",
    "zest",
    "salad",
    "dressing",
    "kraft",
    "zesty",
    "italian",
    "herbs",
    "spices",
    "creamy",
    "classic",
    "ranch",
    "creamier",
    "buttermilk",
    "savory",
    "bacon",
    "fried",
    "crispy",
    "crumbled",
    "think",
    "strips",
    "looks",
    "prettier",
    "work",
    "tomatoes",
    "heirlooms",
    "great",
    "hands",
    "leaves",
    "romaine",
    "lettuce",
    "washed",
    "bite",
    "sized",
    "pieces",
    "red",
    "onion",
    "salt",
    "pepper"
  ],
  "directions": [
    "0",
    "Bring a large pot of salted water to boil. Add pasta and cook until al dente, about 10 minutes.",
    "Drain pasta and rinse under cold water until cool.",
    "While the water is coming to a boil, heat a skillet over medium heat, add bacon strips, and cook until crispy, about 4 minutes on each side. Transfer bacon to a paper towel lined plate.",
    "Place cooled pasta in a large serving bowl; set aside.",
    "In a small bowl combine zesty Italian dressing and ranch, mix well. Add dressing to pasta and toss well to coat pasta.",
    "Add bacon, lettuce, tomato, and onion to the pasta bowl, mix well to combine, and season with salt and pepper as desired. Serve at once, or chill until needed."
  ],
  "ingredients": [
    "0",
    "1 pound bow tie pasta",
    "1 cup Kraft Zest Italian Salad Dressing (Kraft Zesty Italian now has even more herbs & spices!)",
    "1/2 cup Kraft Creamy Ranch (The Classic Ranch is now creamier, with more buttermilk and savory herbs.)",
    "1 pound thick cut bacon, fried until crispy then cut into strips or crumbled (I think strips looks prettier, but it *is more work)",
    "2 large ripe tomatoes, diced (heirlooms work great here if you can get your hands on them)",
    "10 leaves of crispy romaine lettuce, washed / dried / and cut chopped into bite sized pieces",
    "1 VERY small onion red onion, diced",
    "Salt and pepper, to taste"
  ],
  "__v": 1
}