{
  "hash": "a6407040888c19864c0976bfb9c12e11a8be6b9b",
  "title": "Grain Free Salted Chocolate Chip Pecan Blondies",
  "image": "https://cmt.azureedge.net/media/grain_free_salted_chocolate_chip_pecan_b_201811032032155571170oh7n.jpg",
  "href": "https://www.copymethat.com/r/W1OD9FF/grain-free-salted-chocolate-chip-pecan-b/",
  "extension": "",
  "firstAdded": "2018-12-28T23:38:46.433000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 degrees. Place the 2 ½ cups of raw pecan halves on small baking sheet. Toast in the oven for 8 minutes, but watch carefully so the nuts do not burn. Once done toasting, allow nuts to cool for a few minutes on the baking sheet. Keep heat in oven.",
    "Line a 8x8 inch baking pan with parchment paper. Set aside.",
    "Add the roasted pecans to the bowl of a food processor and process for 5 minutes, scraping down the sides as necessary. At this point the pecan should start to clump together, so continue to process until you reach a smoothie consistency similar to peanut or almond butter.",
    "Measure out exactly 1 cup of the homemade pecan butter and add it to a large bowl. (Note: If you have any leftover you can save it for toast or spreading on fruit.) Next mix in coconut sugar, maple syrup, eggs, and vanilla extract until smooth. Stir in coconut flour, baking soda and salt. Fold in chocolate chips.",
    "Add batter to pan and spread evenly towards the sides. Sprinkle ½ cup chopped raw pecans and 2 tablespoon chocolate chips on top. Bake for 20-27 minutes or until crust is golden brown around the edges. It’s best to underbake these blondies a bit to keep them extra fudgy. Mine were perfect around 25 minutes. Sprinkle with sea salt.",
    "Allow blondies to cool in pan for at least 20 minutes before removing and cutting into 12 blondies. Enjoy!"
  ],
  "ingredients": [
    "0",
    "For the batter:",
    "2 ½ cups raw pecan halves",
    "½ cup coconut sugar",
    "¼ cup pure maple syrup",
    "2 eggs",
    "1 teaspoon vanilla extract",
    "3 tablespoons coconut flour",
    "½ teaspoon baking soda",
    "¼ teaspoon salt",
    "⅓ cup chocolate chips (dairy free if desired)",
    "For topping:",
    "1/4 cup chopped raw pecans",
    "2 tablespoons chocolate chips (dairy free if desired)",
    "Fancy sea salt, for sprinkling on top"
  ],
  "__v": 1
}