{
  "__v": 1,
  "directions": [
    "0",
    "Lightly crush the peppercorns. (I use a pestle and mortar. They should resemble fine gravel rather than powder.) Tip the ground peppercorns on to a plate and mix in two teaspoons of salt flakes. Lightly oil the fillet of beef, then roll it in the salt and pepper, pressing down firmly so the meat is encrusted with the crushed peppercorns and salt.",
    "Wipe the courgettes, then cut them into thick matchstick-shaped strips. Toss them in a little salt and set them aside in a colander to drain for 20 minutes. This will prevent them from becoming “wet” during roasting. Drain them, pat them dry with kitchen paper, and then add a tablespoon of olive oil. Peel and crush the garlic and add to the courgettes with some ground black pepper and the leaves from the thyme sprigs. Toss gently so the courgettes are evenly oiled and seasoned. Set the oven at 230C/gas mark 8.",
    "Tip the courgettes into a roasting tin then place the peppered beef on top. Roast for 10 minutes then lower the heat to 180C/gas mark 4 and continue to cook for a further 25 minutes. Remove the meat from the tin and place it on a warm plate, cover with foil and leave to rest for 10 minutes. Return the courgettes to the oven – you want them to be tender and golden.",
    "When the courgettes are ready, add the basil leaves, roughly torn, and toss gently taking care not to break them up. Squeeze over a little lemon juice, then place on a warm serving plate.",
    "Slice the beef very thinly, then place on top of the courgettes, season with a little sea salt and serve."
  ],
  "firstAdded": "2014-08-15T12:03:43.902000",
  "hash": "31f5e77ead74c9ca4117b2f9fa028a4bfb2e7272",
  "href": "http://www.theguardian.com/lifeandstyle/2014/jul/27/nigel-slater-summer-roast-recipes",
  "image": "http://static.guim.co.uk/sys-images/Guardian/Pix/pictures/2014/7/23/1406109785132/a81d6abc-165b-42c4-ba0d-c3f4456581de-460x276.jpeg",
  "ingredients": [
    "0",
    "black peppercorns 2 tbsp",
    "white peppercorns 2 tbsp",
    "fillet of beef 700g",
    "courgettes 2 large or 4 small",
    "olive oil",
    "thyme 8-10 bushy stems",
    "garlic 2 plump cloves",
    "basil leaves a good handful",
    "lemon half a large one"
  ],
  "keywords": [
    "black",
    "peppercorns",
    "white",
    "fillet",
    "beef",
    "courgettes",
    "olive",
    "oil",
    "thyme",
    "bushy",
    "stems",
    "garlic",
    "plump",
    "basil",
    "leaves",
    "good",
    "lemon"
  ],
  "title": "Fillet of beef with basil and lemon courgettes",
  "users": [
    null
  ]
}