{
  "hash": "069e4afa4aaba77b191d1fbab6dfdbaf784762c7",
  "title": "LEMON CAKE DOBERGE",
  "image": "https://img.sndimg.com:443/food/image/upload/fl_progressive,c_fill,q_80,w_560,h_315/v1/img/recipes/19/75/87/IALPobrAQJeaWYydSwP5_Lemon Cake Doberge 197587_final_2.jpg",
  "href": "https://www.geniuskitchen.com/recipe/lemon-cake-doberge-197587?photo=cGhvdG8tNDEyNzY4",
  "extension": "Chrome",
  "firstAdded": "2019-01-16T03:45:05.893000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "LEMON FILLING: Make the lemon filling first to allow time for it to cool. In a pan combine, sugar, cornstarch, flour and salt. Stir in cold water and cook till thickened and bubbly. Now cook for two more minutes.",
    "Put the beaten egg yolks into a bowl and mix with 1 cup of the hot sugar mixture. When well blended pour the egg yolks mixture back into the hot sugar mixture in the pan, bringing to a gentle boil. Stirring constantly, cook for two more minutes then remove from heat.",
    "Stir in butter, 1 tsp lemon peel and lemon juice, make sure to mix well. Cover with plastic wrap, cool at room temperature -- Do Not Stir again.",
    "CAKE: Preheat oven to 375 degrees. Grease and flour three 8\" round baking pans. Combine flour, baking powder and salt in medium size bowl. Mix butter and shortening till creamy.",
    "Add sugar, vanilla and lemon extracts, mix until light and fluffy.",
    "Next add egg yolks, one at a time, beating for 1 minute each. Add milk and lemon juice together. set aside.",
    "Now add dry ingredients, and milk/lemon mixture alternating until well blended. Gently, fold in the egg whites. Pour 3/4 cup of batter into each prepared pan. Bake in 375 degree oven for 10 - 13 minutes, or until tested done.",
    "Cool in pan for 5 minutes. Remove from pans and cool on racks. Now wash, grease and flour pans again and repeat procedure. When finished you will have six cake layers.",
    "LEMON FROSTING: Beat cream cheese, icing sugar until fluffy. Add 1 tsp lemon peel, 1/4 tsp vanilla extract and 1/4 tsp lemon extract and beat till smooth.",
    "CAKE ASSEMBLY: To assemble the cake, place one layer on bottom of a cake platter. Pour 1/2 cup of lemon filling on top of cake. Repeat the above procedure with the remaining four cake layers and filling.",
    "Top with final layer of cake. Cover cake with plastic wrap and put in fridge for 2 hours till well chilled.",
    "Spread Lemon Frosting on sides and top of entire cake. Cover and refrigerate until ready to serve. ENJOY! ENJOY! ENJOY!",
    "Submit a Correction"
  ],
  "ingredients": [
    "0",
    "cake",
    "2 1⁄4 cups cake flour",
    "2 teaspoons baking powder",
    "1⁄4 teaspoon fine sea salt",
    "1⁄2 cup sweet butter",
    "1⁄4 cup crisco white shortening",
    "1 1⁄2 cups white sugar",
    "1 teaspoon pure vanilla extract",
    "1 teaspoon lemon extract",
    "3 large egg yolks, room temperature",
    "1⁄2 cup milk",
    "1⁄4 cup fresh lemon juice",
    "3 egg whites, beaten till stiff",
    "lemon filling",
    "1 1⁄4 cups white sugar",
    "3 tablespoons cornstarch",
    "3 tablespoons flour",
    "1⁄8 teaspoon fine sea salt",
    "1 1⁄2 cups cold water",
    "3 egg yolks, lightly beaten",
    "2 tablespoons sweet butter",
    "2 teaspoons lemon peel, finely shredded",
    "1⁄3 cup fresh lemon juice",
    "lemon frosting",
    "6 ounces cream cheese, softened, room temperature",
    "3 cups icing sugar",
    "1 teaspoon lemon peel, finely shredded",
    "1⁄4 teaspoon pure vanilla extract",
    "1⁄4 teaspoon lemon extract"
  ],
  "__v": 1
}