{
  "hash": "696f045a8688a30bf0b52432c3938e144b2647ba",
  "title": "Kale on Garlic Toast, Two Ways",
  "image": "http://3.bp.blogspot.com/-XwLzB3bJ7jI/TsZ-YQl1omI/AAAAAAAAGZQ/lG1PYs6xAC8/s980/Kitchen%2BBlog%2BHeader.jpg",
  "href": "http://fromseedtotablerecipes.blogspot.com/2009/12/kale-on-garlic-toast-two-ways.html",
  "extension": "Chrome",
  "firstAdded": "2015-04-08T09:26:41.592000",
  "users": [
    null
  ],
  "keywords": [
    "prepare",
    "washed",
    "removing",
    "center",
    "ribs",
    "tearing",
    "kale",
    "long",
    "pieces",
    "bring",
    "quarts",
    "water",
    "salt",
    "pot",
    "return",
    "boil",
    "turn",
    "strong",
    "simmer",
    "minutes",
    "yes",
    "cooking",
    "country",
    "depending",
    "size",
    "loaf",
    "fairly",
    "toast",
    "slices",
    "rub",
    "bread",
    "clove",
    "garlic",
    "drain",
    "reserve",
    "recipe",
    "variation",
    "pile",
    "leaves",
    "season",
    "pepper",
    "drizzle",
    "generous",
    "favorite",
    "extra",
    "virgin",
    "olive",
    "oil"
  ],
  "directions": [
    "0",
    "Makes a very tasty appetizer or first course!",
    "Variation: Put the garlic rubbed toast into a warmed wide shallow soup bowl. Pile on the kale. Ladle in anywhere from a few tablespoons to a half cup or more of the kale cooking water. Season with salt and fresh ground pepper and drizzle generously with extra virgin olive oil.",
    "And yet one more take on variation number one. Skip the part about bringing 2 quarts of water to a boil. If you have a pressure cooker, put about a half cup of water in there (or the minimum your cooker needs to come up to pressure). Put the kale into the cooker in a steamer basket. Bring the cooker up to full pressure and cook for 2 to 3 minutes. Release the pressure using the appropriate quick release method for your cooker. Proceed with the recipe.",
    "I also like to add chopped Nero di Toscana kale to long simmering soups. It's great with garbanzo beans (chickpeas) also."
  ],
  "ingredients": [
    "0",
    "Prepare a pound or more of well washed kale by removing the center ribs and tearing the kale into 2-inch long pieces (more or less).",
    "Bring about 2 quarts of water to a boil and add salt to taste. Add the kale to the pot, return to a boil, then turn down to a strong simmer and cook for 25 to 30 minutes (yes, that long!).",
    "While the kale is cooking, toast 4 to 8 slices of country bread (depending on the size of the loaf) into fairly thick slices. Toast the slices of bread and then rub the bread with a peeled clove of garlic.",
    "When the kale is done, drain it well (reserve the cooking water for the recipe variation) and pile the leaves on the pieces of toast. Season with salt and fresh ground pepper to taste and then drizzle with a generous amount of your favorite extra virgin olive oil."
  ],
  "__v": 1
}