{
  "hash": "d485aae16ba16c9b858aee7f76953e38d89ee4df",
  "title": "Kushikatsu (Kushiage)",
  "image": "https://www.justonecookbook.com/wp-content/uploads/2018/08/Kushikatsu-w600-600x400.jpg",
  "href": "https://www.justonecookbook.com/kushikatsu-kushiage/",
  "extension": "Chrome",
  "firstAdded": "2018-08-28T21:26:03.404000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Gather all the ingredients. We will also need a pack of 6-inch bamboo skewers.",
    "Prepare Ingredients",
    "For Kushikatsu Sauce, combine all the Kushikatsu Sauce ingredients in a small bowl and whisk well. Depending on the amount of Kushikatsu, multiple the sauce ingredients as you need.",
    "Boil the water in a small saucepan, and gently submerge the quail eggs into the boiling water. Cook for 3 minutes and transfer to iced water to let cool. Peel the eggs and set aside.",
    "Put panko in the food processor. Run to make the panko finer texture.",
    "Snap the end of asparagus and discard the bottom.",
    "Cut ½ onion into 4 wedges.",
    "Discard the end of garlic chives and cut them into 4 equal pieces.",
    "Cut the pork chop into 4 pieces and pound the meat with the back of the knife to tenderize the meat.",
    "Cut the chicken breast diagonally (which should be against the grain) about ½ inch thickness. Then season with kosher salt and freshly ground black pepper.",
    "Skewer All the Ingredients",
    "Skewer the chicken and pork as if you are stiching. Starting from one end of the meat, move the skewer downward and upward alternately – like stitching.",
    "Equally divide the garlic chives and put them on each end of the four pork belly slices on the cutting board. Roll the garlic chives from one end to the other. Skewer the seam so the pork belly slice will stay in place.",
    "Carefully skewer the sausage and quail eggs.",
    "For sushi ginger, drain it and skewer it as well. For onion, skewer it toward the core.",
    "Prepare all the skewered ingredients on a plate/tray.",
    "Prepare Batter",
    "Whisk the egg in a large bowl, and add water, leaving about ¼ cup in a measuring cup.",
    "Then add the all-purpose flour into the bowl. Whisk all together. Slowly add the rest of water until you reach the right consistency.",
    "The batter is runny, but thick, when you dip your finger, it should cover with the batter. Place the panko in a shallow bowl/tray.",
    "Deep Fry",
    "Bring the oil to 340-360 ºF (170-180 ºC). When the oil is hot and ready for deep frying, you want to start with the vegetables or more plain food first, leaving the meat or strong flavor items for later. That way, the oil stays clean for the vegetables/ plain food, and when you start deep frying the savory food, the oil will turn darker and flavorful.",
    "Dredge the ingredients in the batter and then panko. Remove excess panko and deep fry until crisp and golden brown.",
    "Pick up the panko breadcrumbs between batches to keep the oil clean. Burnt panko will darken your oil, which will change its taste.",
    "Continue with other ingredients. Use a spoon, if you have a hard time coating the batter.",
    "Deep fry meat and seafood at the end.",
    "Drain the deep fried food on a wire rack or paper towel. Serve immediately with Kushikatsu Sauce and Ichimi Togarashi (Japanese chili pepper).",
    "Recipe Notes",
    "Recipe by Namiko Chen of Just One Cookbook. All images and content on this site are copyright protected. Please do not use my images without my permission. If you’d like to share this recipe on your site, please re-write the recipe in your own words and link to this post as the original source. Thank you."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 cup panko (Japanese breadcrumbs) (120 g)",
    "kosher salt",
    "freshly ground black pepper",
    "3 ½ cup neutral flavor oil (vegetable, canola, etc) (enough for 10-inch cast iron skillet)",
    "Kushikatsu Sauce (makes ½ cup)",
    "4 Tbsp Worcestershire sauce (usuta sauce)",
    "2 Tbsp ketchup",
    "2 Tbsp water",
    "2 tsp soy sauce",
    "2 tsp sugar",
    "Kushikatsu Ingredients",
    "9 quail eggs",
    "6 asparagus",
    "½ onion",
    "1 bunch garlic chives about 20 stalks",
    "½ cup sushi ginger",
    "2 sausages",
    "1 piece pork loin chop",
    "½ chicken breast (butterfly one breast but only use half)",
    "4 slices pork belly",
    "Kushikatsu Batter",
    "1 large egg",
    "1 cup all-purpose flour",
    "¾ to 1 cup water (180 to 240 ml)"
  ],
  "__v": 1
}