{
  "hash": "49856c6c7a54be5ccc8c0ff449e0efa79962e20c",
  "title": "Pinto Bean Breakfast Patty Melts",
  "image": "http://4.bp.blogspot.com/-NtzYNLEqCAA/UmcT4IDmg5I/AAAAAAAAXLE/EQpifitX-50/s400/SpotlightPintoBeanMelts2.jpg",
  "href": "http://kahakaikitchen.blogspot.com/2013/10/pinto-bean-breakfast-patty-melts-from.html",
  "extension": "Chrome",
  "firstAdded": "2016-12-10T03:39:22.954000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat 1 tablespoon of the oil in a large heavy-bottomed skillet over medium-high heat. Add the onion and saute until golden, translucent, and fragrant, approximately 5 minutes. Add the zucchini, jalapenos, and garlic and saute for just 2 more minutes. Remove pan from heat.",
    "Meanwhile, place the beans in a large, heat-proof bowl and mash with a fork or potato masher. (Meagan notes: \"I prefer to use a fork here for a chunky, uneven consistency.\") Stir in the breadcrumbs, eggs, cumin, black pepper, coriander and salt. Fold in the cooked onion mixture. Using a half cup measure, portion off and form seven 'burgers'. Refrigerate if not using right away.*",
    "Once ready to cook and assemble your melts, heat 1 tablespoon of oil in a large heavy-bottomed, lidded skillet over medium heat. Add the patties and cook 3-4 minutes on each side, applying pressure to the top of the patties to flatten once you have a cooked side facing up. Note that you may need to work in batches so as not to overcrowd your pan, so you may need to refresh your oil between batches.",
    "Once patties are crisp on the outside and cooked through, top each with a slice of cheese, place the lid on the pan and steam just 30 to 60 seconds to melt the cheese. Remove each patty melt to a toasted English muffin bun and serve immediately.",
    "*Note: Meagan says, \"These patties can be made in advance. I will often make the patty mixture on a Sunday and then fry them up for breakfasts throughout the week. If you form the patties in advance, you simple need to separate them with parchment paper so that they don't stick to each other. Store in the refrigerator until ready to cook and serve\".",
    "Notes/Results: These are excellent bean patties--crispy on the outside, perfectly tender and creamy on the inside and full of flavor. Speaking of that flavor, I was concerned about the amount of black pepper listed in the recipes--2 tablespoons. I am a black pepper fan but that seems like a massive amount to me. I emailed Meagan just to be sure and she was wonderful enough to send me a quick reply saying that she likes to season her patties pretty aggressively due to the lack of flavor in pinto beans but, she always encourages everyone to season food to their own palates. My little asthma lungs that cough at really strong black pepper ;-) led me to start with 1 teaspoon and tasting the mix as I went, I ended up with 2 teaspoons total of black pepper, keeping all the other spices as written. I really liked the flavor--they are cumin forward--with 2 tablespoons of it in the mix but, I loves me some cumin so it worked for me. Between the garlic, onion, kick of jalapeno and the spices these were well-seasoned in my book--but of course you should adapt them to your own taste buds. In order to boost them even more nutritionally, I chose to put them on whole wheat English muffins and add a layer of baby spinach. I also topped my plated one with a bit of guacamole--extra yum. (I thought it might be too messy for the \"portable\" ones.) Easy to prepare, satisfying and oh-so-good, this is definitely a keeper recipe for me."
  ],
  "ingredients": [
    "0",
    "2 Tbsp extra-virgin olive oil divided + more for frying",
    "3/4 cup diced yellow onion",
    "1 cup grated zucchini",
    "2 jalapenos, stemmed and minced",
    "2 Tbsp minced fresh garlic",
    "3 1/2 cups cooked pinto beans (either canned or freshly prepared)",
    "3/4 cup plain dry breadcrumbs",
    "2 large eggs, beaten",
    "2 Tbsp ground cumin",
    "2 Tbsp freshly ground black pepper* (I used about 2 tsps--see Notes/Results below)",
    "1 tsp ground coriander",
    "7 slices Monterey Jack cheese",
    "7 English muffins, sliced and toasted (I used whole wheat)",
    "(I added baby spinach & guacamole)"
  ],
  "__v": 1
}