{
  "hash": "fa869e4701be030dd8796f44dc7fc2171cf16257",
  "title": "Strawberry Rhubarb and Coconut Panna Cotta [Vegan, Gluten-Free]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/06/panna.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/strawberry-rhubarb-and-coconut-panna-cotta/",
  "extension": "Chrome",
  "firstAdded": "2015-06-30T18:31:54.751000",
  "users": [
    null
  ],
  "keywords": [
    "coconut",
    "milk",
    "agar",
    "happened",
    "strawberries",
    "rhubarb",
    "maple",
    "syrup"
  ],
  "directions": [
    "0",
    "Stir the can of coconut milk and pour into a small saucepan with agar agar, stir briefly and let sit without heat for 10 minutes. Meanwhile, lightly grease 3 ramekins and set aside.",
    "Turn the stove on to medium and bring to a small boil, after small bubbles have formed start stirring frequently and let simmer on medium-low for approx. 10 mins if using flakes, and approx. 5 mins if using powder.",
    "Continue stirring and make sure especially with the flakes that the agar agar has completely dissolved. You can move the saucepan around a bit to make sure you don’t see any flakes at the bottom and then you’re ready.",
    "Chop strawberries and puree in a food processor or blender, it should yield approx. 1/2 cup. Add 1/4 cup of the strawberry puree to the coconut milk and whisk until combined and turns a light pink color. Reserve the rest of the puree.",
    "Pour coconut-strawberry mixture into the lightly greased ramekins and let sit for a couple of minutes (if during this step you notice loose flakes, return it to the heat because it will not set if they didn’t dissolve).",
    "Place ramekins in the fridge for approx. 1 1/2 to 2 hours to set.",
    "Just before the panna cotta is ready, make the topping by stewing the rhubarb and remaining strawberry puree by first chopping the rhubarb into 1/4-inch pieces and over low heat in a small saucepan, add remaining strawberry puree, maple syrup, and rhubarb to simmer for approx. 8 minutes stirring with a wooden spoon. Set aside to cool at room temperature.",
    "Once panna cotta has set, gather your plates and with a butter knife, lightly scrape along the inside rim to loosen it. Place a plate on top of the ramekin and flip over (you may need to thrust it a little here until it comes out). Plate and add strawberry-rhubarb topping!"
  ],
  "ingredients": [
    "0",
    "1 can of coconut milk",
    "2 tbsp agar agar flakes or 1 tsp agar agar powder (I happened to have the flakes)",
    "8 strawberries, plus more for topping",
    "1/2 cup sliced rhubarb",
    "1 tsp maple syrup"
  ],
  "__v": 1
}