{
  "hash": "c7f1cd70b864b978f5d69c328419c79b59e1ce78",
  "title": "Sage and Maple-Roasted Chickpeas with Crispy Kale and Sweet Potato Mash",
  "image": "http://ak-hdl.buzzfed.com/static/2015-03/6/14/enhanced/webdr10/enhanced-9629-1425671851-11.jpg",
  "href": "http://www.buzzfeed.com/christinebyrne/sage-and-maple-roasted-chickpeas-with-crispy-kale-and-sweet",
  "extension": "Chrome",
  "firstAdded": "2015-07-12T15:24:52.975000",
  "users": [
    null
  ],
  "keywords": [
    "chickpeas",
    "rinsed",
    "thoroughly",
    "yellow",
    "onion",
    "wedges",
    "olive",
    "oil",
    "divided",
    "maple",
    "syrup",
    "sage",
    "leaves",
    "kosher",
    "salt",
    "pepper",
    "medium",
    "potatoes",
    "bunch",
    "kale",
    "stems",
    "rough",
    "pieces"
  ],
  "directions": [
    "0",
    "PREPARATION",
    "1. Preheat the oven to 400°F and line a large, rimmed baking sheet with parchment paper.",
    "2. In a small mixing bowl, combine a tablespoon of olive oil and a tablespoon of maple syrup and stir them together with a fork. Add the sage, and stir to combine.",
    "3. Add the chickpeas and onion wedges to the baking sheet, drizzle with the syrup-olive oil mixture, season with salt and pepper, and toss to coat and combine. Roast until the chickpeas are browned and crispy and the onions are soft, about 30 minutes. While the chickpeas roast, prepare the sweet potatoes.",
    "4. Poke both sweet potatoes all over with a fork, then put them in a microwave-safe bowl or plate and cover them with a damp paper towel. Microwave them on high for 7 minutes, until soft.",
    "5. When the sweet potatoes have cooled slightly, peel the skin off with your hands. Put the peeled sweet potatoes back in the bowl, add the remaining tablespoon of olive oil and the remaining tablespoon of maple syrup, season with salt and pepper, and mash everything together with a potato masher or a fork.",
    "6. Toss the chopped kale with the chickpeas on the baking sheet, season with a little more salt and pepper, then put everything back in the oven just until the kale starts to wilt, about 5 minutes. When the chickpeas are done and the kale is wilted, divide the sweet potato mash between two plates and top with the chickpea-kale mixture. Serve immediately."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1 15-ounce can chickpeas, rinsed and thoroughly dried",
    "½ large yellow onion, cut in 4 wedges",
    "2 tablespoons olive oil, divided",
    "2 tablespoons maple syrup, divided",
    "2 tablespoons chopped sage leaves",
    "kosher salt and freshly ground pepper",
    "2 medium sweet potatoes",
    "1 bunch kale, stems removed, chopped into rough 2-inch pieces"
  ],
  "__v": 1
}