{
  "hash": "a3be61bad159f2049e774d19982262f89e1f9dee",
  "title": "Hamburger Steak with Creamy Onion Gravy",
  "image": "https://3.bp.blogspot.com/-S5JhgkdDgrs/VEw8CkSkoJI/AAAAAAAAdP8/MSdBuJ56Phc/s1600/Hamburger%2BSteaks%2Bwith%2BOnion%2BGravy%2B01%2BWM.jpg",
  "href": "http://www.deepsouthdish.com/2009/02/hamburger-steak-with-creamy-onion-gravy.html",
  "extension": "Chrome",
  "firstAdded": "2017-01-02T20:50:18.520000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Heat the cooking oil over medium high in a large heavy-bottomed stainless skillet. In a medium sized bowl, gently combine the ground chuck, chopped onion, egg, hot sauce, seasoned salt, garlic powder and pepper. Shape into 4 to 6 equal sized patties. Dip each patty into the flour and cook until browned on both sides; remove and set those aside.",
    "Add the sliced onions to the skillet and cook over medium heat until lightly caramelized, stirring regularly. Whisk together the beef broth, water, 1/4 cup of flour, seasoned salt, pepper, and the Worcestershire and Kitchen Bouquet, if using, until well combined. Pour into the skillet with the onions and stir constantly, until mixture begins to thicken.",
    "Return the hamburger steaks to the skillet, turn to coat, add sliced mushrooms if using, and reduce heat to simmer. Cook, covered, for about 20 minutes longer. Serve with mashed potatoes and some green beans, or a mixed garden salad on the side.",
    "Cook's Notes: The brown gravy for these is pretty good all on its own since its reliant on the pan drippings, but if you have it, just that little bit of Worcestershire and Kitchen Bouquet adds a bit more depth and is delicious. If you find that you need a binder, add in a small amount of fresh bread crumbs to the ground beef. If using pre-made hamburger steak patties, omit the onion, egg and hot sauce, and sprinkle both sides of the patties with the seasoned salt, garlic powder and pepper, pressing in the seasoning a bit. Then dip each patty in the flour and proceed with the remaining recipe."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "For the Patties:",
    "3 tablespoons of cooking oil (canola, vegetable)",
    "1-1/2 pounds of 80/20 ground chuck",
    "3/4 cup of onion, finely chopped",
    "1 large egg",
    "1 teaspoon Tiger Sauce, or hot pepper sauce, or to taste, optional",
    "1 teaspoon of seasoned salt",
    "1/2 teaspoon garlic powder",
    "1/4 to 1/2 teaspoons freshly cracked black pepper",
    "About 1/3 cup of all purpose flour, for dipping the patties",
    "For the Gravy:",
    "1 large onion, halved and sliced (about 3 cups sliced)",
    "1 cup of beef broth",
    "1 cup of water",
    "1/4 cup of all purpose flour",
    "1/4 teaspoon of seasoned salt, or to taste",
    "1/4 teaspoon of freshly ground black pepper, or to taste",
    "1/2 tablespoon of Worcestershire sauce, optional",
    "1 teaspoon of browning & seasoning sauce (like Kitchen Bouquet), optional",
    "2 cups of sliced mushrooms, optional"
  ],
  "__v": 1
}