{
  "hash": "e6cad20e8cc557f284bbd7cf12a71af4153af2aa",
  "title": "Beef Jerky",
  "image": "https://buttoni.files.wordpress.com/2011/10/peggys-beef-jerky2.jpg?w=300&h=225",
  "href": "https://buttoni.wordpress.com/2011/10/08/beef-jerky/",
  "extension": "Chrome",
  "firstAdded": "2016-01-08T20:03:41.768000",
  "users": [
    null
  ],
  "keywords": [
    "lbs",
    "boneless",
    "sirloin",
    "yield",
    "trimmed",
    "meat",
    "walmart",
    "great",
    "value",
    "brand",
    "tomato",
    "pulp",
    "added",
    "sugar",
    "red",
    "wine",
    "water",
    "soy",
    "lowsodium",
    "wheatfree",
    "tamari",
    "coconut",
    "aminos",
    "onion",
    "garlic",
    "coarse",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "DIRECTIONS: Trim all fat, membrane, sinew and gristle off the meat. Any left on will expedite spoilage. Partially freeze meat to facilitate slicing. Slice the partially frozen meat 3/16″ thick. In large plastic/glass marinating pan, blend tomato paste with soy sauce until smooth. Add water and remaining ingredients and stir well. Add meat to the marinade and using hands, toss meat several times to coat well. Cover and marinate 6 hours or overnight, covered, in refrigerator. You can also marinate the meat in gallon zip-log plastic storage bags. I recommend placing them into pans though, in case of leakage you won’t want to mess up the refrigerator ;) Stir once or twice during marinating (or manipulate the bag with your hands to be sure all the meat is touching the marinade.",
    "When ready to dehydrate, lift meat pieces out of marinade and lay on dehydrator trays or non-stick baking sheets, leaving a ¼” space between pieces. You do not want them to touch each other as this will block air/heat circulation. Set dehydrator to meat setting (155º-160º) for 4-6 hours. I check mine every hour, in case small/thin pieces are over drying. No matter how hard you try, some pieces will slice out thinner than others. It just happens!",
    "My jerky takes 4 hours in my dehydrator, but it used to take me 8 hours, for several reasons, mostly tray overcrowding in my old smaller dehydrator. If oven cooking on pans, set oven between 160º-200º. Turn meat every hour (usually 1 or 2 times is enough). Take pieces out of the dehydrator/oven as they appear to be fully dried. It goes without saying, any thick pieces will take longer to fully dry out. Discard any marinate remainders as it is contaminated with raw meat juices. When jerky has cooled, ENJOY!!",
    "For remainders, wrap in small batches in foil and then place the foil packs into a large ziploc bag. Though they can be stored on the counter for 1-2 months, if not properly dried, it can mold/spoil. Refrigerating therefore, is always the safest way to store jerky that has not been done commercially. I actually keep most of mine in the freezer and just thaw 1 foil pack as needed, keeping the one in the fridge until that pack is fully consumed."
  ],
  "ingredients": [
    "0",
    "6-6½ lbs. boneless sirloin (will yield about 5 lb. trimmed meat)",
    "1 T. tomato paste (Walmart Great Value brand is pure tomato pulp, no added sugar)",
    "3/4 c. red wine or water",
    "1/3 c. soy sauce (not low-sodium), wheat-free tamari or coconut aminos",
    "1 tsp. onion powder",
    "1 tsp. garlic powder",
    "2 tsp. coarse black pepper"
  ],
  "__v": 1
}