{
  "hash": "cef7b99d95e43e60e6dca1b189dcf609ba794134",
  "title": "Red Cabbage and Jicama Spring Rolls With Peanut Dipping Sauce [Vegan, Gluten-Free]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/03/spring.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/red-cabbage-and-jicama-spring-rolls/?utm_source=Green+Monster+Mailing+List&utm_campaign=6a43306e45-NEWSLETTER_EMAIL_CAMPAIGN&utm_medium=email&utm_term=0_bbf62ddf34-6a43306e45-106311653",
  "extension": "",
  "firstAdded": "2015-03-27T05:29:16.854000",
  "users": [
    null
  ],
  "keywords": [
    "spring",
    "roll",
    "skin",
    "wrappers",
    "red",
    "green",
    "cabbage",
    "cucumber",
    "strips",
    "jicama",
    "carrots",
    "radish",
    "broccoli",
    "stems",
    "mint",
    "leaves",
    "cilantro",
    "basil",
    "peanut",
    "butter",
    "creamy",
    "crunchy",
    "water",
    "rice",
    "white",
    "vinegar",
    "sugar",
    "agave",
    "syrup",
    "coconut",
    "aminos",
    "tamari",
    "soy",
    "salt",
    "shallot",
    "onion",
    "thai",
    "chili"
  ],
  "directions": [
    "0",
    "Thinly slice all veggies into strips and place in separate clusters on large plate. Remove herbs from stems and add whole leaves to plate as well.",
    "Boil water and fill very wide bowl or pie plate about half way full, let sit for a few minutes to cool ever so slightly. One at a time, soften spring roll sheets by dipping them into the hot water, using your fingers to move them around. Depending on hotness of water, it will take about 2-10 seconds for them to soften. They should be pliable but not mushy and falling apart, think al dente pasta, as they will continue to soften even out of the water. Layer two softened spring roll sheets on top of one another on cutting board (wood works well here) and fill bottom third with a a bit of each veggie and herbs, do not overstuff! Less is more here. Roll up like you would a mini burrito, tucking in sides and rolling up tightly. It will conveniently stick to itself, making this very easy. Cut in half and place on serving plate.",
    "In a blender combine all ingredients for peanut sauce and process 10-20 seconds until creamy. Transfer to small bowl and top with chopped scallions or additional chopped chili pepper, if desired."
  ],
  "ingredients": [
    "0",
    "1 package of “spring roll skin wrappers”",
    "1 cup thinly sliced red (or green) cabbage",
    "1 cup thinly sliced cucumber strips",
    "1 cup thinly sliced jicama (or carrots, radish, or broccoli stems)",
    "1 cup fresh mint leaves",
    "1 cup fresh cilantro leaves",
    "1 cup fresh basil leaves",
    "1",
    "1/2 cup peanut butter (creamy or crunchy)",
    "3/4 cup warm water",
    "1 Tbsp rice or white vinegar",
    "1 Tbsp sugar or agave syrup",
    "1 Tbsp coconut aminos, tamari, or soy sauce",
    "1/2 tsp salt",
    "1 tsp fresh shallot or onion",
    "1/2 tsp (or more) fresh thai chili (optional)"
  ],
  "__v": 1
}