{
  "hash": "35be25d30205c745a05b5957aa75db3e30b96c60",
  "title": "Semi-Instant Pancakes",
  "image": "http://1g3qt034qrei26p6x54fpg09-wpengine.netdna-ssl.com/wp-content/uploads/2015/09/alton-brown-pancakes_200.jpg",
  "href": "https://altonbrown.com/semi-instant-pancakes-recipe/",
  "extension": "",
  "firstAdded": "2018-02-13T18:07:54.239000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Sift all ingredients together and store in an airtight container in the pantry for up to 3 months. Shake vigorously before each use.",
    "1",
    "Heat an electric griddle to 350 degrees F or set a heavy skillet or griddle over medium heat.",
    "Heat the oven to the lowest possible temperate (not more than 200 degrees F).",
    "Place the pancake mix in a large mixing bowl.",
    "Whisk the egg yolks into the cooled melted butter (right in the pan in fine).",
    "Whisk the butter mixture completely into the buttermilk mixture.",
    "Dump the wet team onto the dry team and quickly bring together with a large whisk. I allow myself only 12 stirs, then I just walk away. Yes, there will be some lumps in the batter and that's fine.",
    "Check on the griddle. When a drop of water skittles across the surface like a little hovercraft, it's ready. If you're surface is truly non-stick, no butter or non-stick spray will be needed.",
    "Ladle 1 ounce (by volume) of batter onto the griddle. (How will you know how much batter is 1 ounce? Because you're going to use either a #20 disher or a 1-ounce ladle.) As soon as the batter hits the pan use the underside of the ladle or disher to gently coax the batter out to a disk about 4 inches in diameter. Cook for 3 minutes, or until bubbles around the upside edge set. If you wish to integrate the fruit into the pancake itself, add it after the batter has been on the griddle for about :30 seconds.",
    "Carefully flip with a wide spatula and cook for another 2 to 3 minutes, until golden brown on the bottom.",
    "Serve immediately or keep warm in the oven by placing cakes on a half sheet pan and covering them with a tea towel for up to 20 minutes.",
    "_____",
    "\"1 1/2 cups all-purpose flour",
    "2 tablespoons sugar",
    "2 teaspoons baking powder",
    "1/2 teaspoon baking soda",
    "1/2 teaspoon salt",
    "1 1/4-1 1/2 cups milk",
    "2 eggs",
    "1 teaspoon vanilla (optional)",
    "2 tablespoons vegetable oil\"",
    "\"In a bowl, mix together all the dry ingredients.",
    "Make a well in the centre and pour in the milk.",
    "Start with 1 1/4 cups milk, adding up to another 1/4 cup if necessary, as you mix it with the flour.",
    "Add the two eggs, vanilla if using and oil, whisking until mixed but still a bit lumpy.",
    "Heat a frying pan (if it is not non-stick, you will need to melt a bit of butter or oil in it) and when hot, pour in some pancake mix.",
    "The first pancake is always a bit of a test so adjust the batter by adding more flour if you need to make it thicker or more milk if you want a thinner pancake. In either case, just add a few spoonfuls at a time until you get it right. Repeat. You may need to adjust the heat as pan tends to get hotter as you keep making pancakes.\""
  ],
  "ingredients": [
    "0",
    "28 ounces all-purpose flour (see note)",
    "1 tablespoon baking powder",
    "1 1/2 teaspoons baking soda",
    "1 tablespoon kosher salt",
    "1 ounce sugar",
    "1",
    "10 ounces semi-instant pancake mix (above)",
    "2 large eggs, separated and at room temperature",
    "2 cups low-fat buttermilk at room temperature (plus another ounce to adjust consistency of final batter)",
    "2 ounces unsalted butter, melted in a small saucepan and cooled",
    "1 ounce unsalted butter, shortening or non-stick spray for the pan",
    "8 ounces fresh fruit such as blueberries (optional)"
  ],
  "__v": 2
}