{
  "hash": "62b9c6dac5c627fd54f85d9bc30ce876ca797be8",
  "title": "Grilled Soy-Basted Chicken Thighs With Spicy Cashews",
  "image": "https://static01.nyt.com/images/2017/06/14/dining/24GRILLS4/14GRILLS4-articleLarge.jpg",
  "href": "https://cooking.nytimes.com/recipes/1018763-grilled-soy-basted-chicken-thighs-with-spicy-cashews?action=click&amp;module=Collection+Page+Recipe+Card&amp;region=Our+25+Most+Popular+Recipes+of+2017&amp;pgType=collection&amp;rank=18&amp;regi=1&amp;join_cooking_newsletter=false&amp;login=google",
  "extension": "Chrome",
  "firstAdded": "2018-01-21T07:16:26.002000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat oven to 300 degrees. Combine cashews and Sriracha sauce in a small bowl and stir until nuts are coated. Line a small baking pan with foil and spread the coated cashews out on it, then place in the oven and bake until nuts are dry, approximately 20 minutes. Carefully remove the nuts from the foil and let cool, then chop roughly and set aside in a small bowl.",
    "Meanwhile, in a large bowl, whisk together sesame oil, 1/2 cup soy sauce, the hoisin sauce and the black pepper, and hot sauce if using. Add chicken thighs and stir to coat. Refrigerate until ready to cook.",
    "For the basting sauce, combine the remaining 3 tablespoons soy sauce, the brown sugar and the ginger in a small bowl, and whisk until the sugar has dissolved.",
    "When you are ready to cook the chicken, build a fire in a charcoal grill, leaving about 1/3 of the cooking space free of coals. When coals are covered with gray ash and the temperature is medium (you can hold your hand 5 inches above the coals for 5 to 7 seconds), you are ready to cook. (For a gas grill, turn one burner to high, leaving the others off, then lower cover and heat for 15 minutes.)",
    "Using tongs, remove chicken thighs from marinade and cook, directly over the coals, turning every few minutes, until they are well-browned but not crusty, approximately 8 to 10 minutes. Then, using a pastry brush, begin to baste them with the soy, ginger and sugar mixture, until they develop a lacquer, an additional 8 to 10 minutes, again turning every few minutes. (If chicken threatens to burn, place it over the part of the grill without coals.)",
    "Transfer chicken to a warmed platter, sprinkle with the chopped cashews, the scallions and the cilantro, and serve."
  ],
  "ingredients": [
    "0",
    "½",
    "cup unsalted cashews",
    "2",
    "tablespoons Sriracha sauce",
    "3",
    "tablespoons toasted sesame oil",
    "½",
    "cup plus 3 tablespoons soy sauce",
    "2",
    "tablespoons hoisin sauce",
    "1",
    "tablespoon cracked black pepper",
    "Hot sauce, to taste",
    "2 ½",
    "pounds skinless, boneless chicken thighs",
    "¼",
    "cup brown sugar (light or dark) or molasses",
    "2",
    "tablespoons peeled and minced ginger",
    "4",
    "scallions, sliced thin",
    "5 or 6",
    "springs cilantro, tough stems removed and roughly chopped (approximately 2 tablespoons)"
  ],
  "__v": 1
}