{
  "hash": "997f4896c0c1e182f08eb96c6f26e4f85b5ebb7b",
  "title": "Pasta with Rocket & Walnut Pesto",
  "image": "",
  "href": "http://www.jamieoliver.com/recipes/member-recipes/recipe-detail/4199/",
  "extension": "Chrome",
  "firstAdded": "2017-03-17T07:41:27.109000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "ith this recipe you play with the amount of ingredients based on your likes & the strength of the garlic, arugula, etc.",
    "Best to use a mortar & pestle but if you don't have one the food processor works just fine.",
    "In the mortal & pestle or the processor start off with your arugula and a drizzle of oil to get it working. Once pulverized add in 1 clove of garlic & continue to grind. Now add in your nuts, lemon juice and a bit of salt & pepper & give it one more grind. At this point abandon the mortal & pestle or the machine & dump the mixture into a bowl.",
    "Add a small handful of cheese and while continuously mixing add in the olive oil until you achieve your desired consistency. For crostini I would leave as a paste, for a pasta sauce keep it a bit looser - this is all based on the amount of olive oil you use.",
    "Now recheck your seasonings - more garlic? A little light on the acid? Add a squeeze of lemon. Is it flat? A pinch of salt will wake it up. Let sit for an hour or so to let the flavors incorporate. Store in the fridge. It will last a few days before the arugula will turn.",
    "Serve tossed over fresh pasta or rubbed over toasty bread with a ribbon of parmesan, a delicious topping for pizza or a beautiful frittata with a dollop of arugula pesto! There are a million ways to use this - enjoy!"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 big handfuls of rocket, cleaned",
    "1-2 cloves garlic",
    "small handful of walnuts, crushed",
    "extra virgin olive oil, as needed",
    "lemon juice of half - 1 full lemon",
    "small handful parmesan cheese, grated",
    "salt & pepper to taste"
  ],
  "__v": 1
}