{
  "hash": "933e6eac730bd5e2b46573ee4cca182145c3ac8f",
  "title": "Reese’s Nutter Butter Cookie Truffles Recipe",
  "image": "http://media.sixsistersstuff.com/uploads/2014/05/Reeses-Nutter-Butter-Cookie-Truffles.jpg",
  "href": "http://www.sixsistersstuff.com/2014/05/reeses-nutter-butter-cookie-truffles-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-09-08T22:56:18.060000",
  "users": [
    null
  ],
  "keywords": [
    "nutter",
    "butter",
    "cookies",
    "cream",
    "cheese",
    "reeses",
    "mini",
    "peanut",
    "milk",
    "chocolate",
    "chips",
    "shortening",
    "sprinkles"
  ],
  "directions": [
    "0",
    "Blend the Nutter Butter cookies in a food processor until they are fine crumbs. Then break up the cream cheese into chunks and blend that together with the crumbs in the food processor until well blended. Remove blade or transfer dough to another bowl. Gently fold in the quartered Reese’s peanut butter cups. I used the very small mini Reese’s that come unwrapped. Roll into 1 inch balls and place on a cookie sheet lined with waxed paper or parchment paper. Stick in the freezer for about 30 to 40 minutes.",
    "Melt the chocolate chips and shortening in a microwave safe bowl stirring every 30 seconds until smooth.",
    "Dip the frozen balls into the melted chocolate. Cover them completely with chocolate, then lift up and gently tap to remove the excess chocolate. I used a plastic fork with the two middle tines broken out. Set back onto the cookie sheet covered in waxed paper. Immediately add the sprinkles before the chocolate sets up. The chocolate will set up quickly because the balls are so cold from being in the freezer.",
    "Makes about 35 to 40 truffles"
  ],
  "ingredients": [
    "0",
    "16 ounces Nutter Butter Cookies",
    "8 ounces cream cheese",
    "8 ounces Reese’s Mini Peanut Butter Cups, each one quartered",
    "12 ounces milk chocolate chips",
    "3/4 tablespoon shortening",
    "1 tablespoon sprinkles (optional for top)"
  ],
  "__v": 1
}