{
  "hash": "8c189ea70bb6735a5a90d7d78e3564b0a5ddc58f",
  "title": "EGYPTIAN LENTIL SOUP",
  "image": "http://www.mattersofthebelly.com/wp-content/uploads/2015/06/lentil-soup-24.jpg",
  "href": "http://www.mattersofthebelly.com/egyptian-lentil-soup/",
  "extension": "Chrome",
  "firstAdded": "2018-12-11T13:45:46.224000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large pot over medium heat, melt the ghee. Add the onions, garlic, carrots and potato. Cook, stirring until starting to soften, about 7 min.",
    "Add the lentils, tomatoes & spices. Cook for 1-2 minutes until fragrant.",
    "Add the stock, bring to the boil then turn down the heat to low and simmer for 35-45 min, until vegetables are very soft (test a carrot, if it is soft, then all the rest will be too).",
    "While the soup is simmering, make the croutons: Preheat oven to 200 C. Use scissors or a knife to cut up the pita bread into small squares, or just tear roughly with your hands into bite-sized pieces. Toss with a generous drizzle of olive oil and sprinkle with a little salt then spread on a baking sheet in a single layer. Place in oven for about 10-12 minutes, until golden and crispy.",
    "Puree the soup with a stick blender (also known as an immersion blender), or in a regular blender in batches, until completely smooth. (TIP: if you make lots of soup, I highly recommend buying a stick blender. They are quite cheap and save SO much time and cleaning up!)",
    "Adjust seasoning and serve with croutons and a sprinkle of dukkah if you like."
  ],
  "ingredients": [
    "0",
    "• 2 tbsp. ghee (you may use any fat you prefer, however, I strongly recommend ghee)",
    "• 1 large onion (about 250g), peeled & roughly chopped",
    "• 3-6 garlic cloves, peeled (depending how big they are and how much you like garlic)",
    "• 2 carrots (about 200g), peeled & roughly chopped",
    "• 1 medium potato (about 250g), peeled & roughly chopped",
    "• 2 cups dried red lentils (375g), washed & drained",
    "• 1 large/2 small tomatoes (about 240g), peeled & roughly chopped, seeds removed",
    "• 1 tsp. ground cumin",
    "• 1 tsp. ground turmeric",
    "• ½ tsp. ground coriander",
    "• 2-2.5 liters vegetable or chicken stock",
    "• salt & pepper to taste",
    "FOR THE CROUTONS",
    "• 2 loaves whole-wheat pita bread",
    "• olive oil",
    "• salt"
  ],
  "__v": 1
}