{
  "hash": "416da38f4df441b41eb7b645d7c65939aceac1d2",
  "title": "Classic Sage and Sausage Stuffing (or Dressing) Recipe",
  "image": "http://www.seriouseats.com/recipes/assets_c/2015/10/20150923-Thanksgiving-spread-vicky-wasik-003-thumb-1500xauto-427107.jpg",
  "href": "http://www.seriouseats.com/recipes/2010/11/classic-sage-and-sausage-stuffing-or-dressing-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-10-29T08:43:46.477000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Adjust oven racks to lower middle and upper middle position. Preheat oven to 275°F. Spread bread evenly over two rimmed baking sheets. Stagger trays on oven racks and bake until completely dried, about 50 minutes total, rotating trays and stirring bread cubes several times during baking. Remove from oven and allow to cool. Increase oven heat to 350°F",
    "In large Dutch oven, melt butter over medium high heat until foaming subsides (don't allow butter to brown), about 2 minutes. Add sausage and mash with stiff whisk or potato masher to break up into fine pieces (largest pieces should be no greater than 1/4-inch). Cook, stirring frequently until only a few bits of pink remain, about 8 minutes. Add onions, celery, garlic, and sage and cook, stirring frequently, until vegetables are softened, about 10 minutes. Remove from heat and add half of chicken stock.",
    "Whisk remaining chicken stock, eggs, and 3 tablespoons parsley in medium bowl until homogeneous. Stirring constantly with wooden spoon, slowly pour egg mixture into sausage mixture. Add bread cubes and fold gently until evenly mixed.",
    "Use part of stuffing to stuff bird if desired. To cook remaining stuffing, transfer to buttered 9 by 13 rectangular baking dish (or 10 by 14 oval dish), cover tightly with aluminum foil, and bake until instant read thermometer reads 150°F when inserted into center of dish, about 45 minutes. Remove foil and continue baking until golden brown and crisp on top, about 10 minutes longer. Remove from oven, let cool for 5 minutes, sprinkle with remaining parsley and serve."
  ],
  "ingredients": [
    "0",
    "2 1/2 pounds (about 2 loaves) high quality sandwich bread or soft Italian or French bread, cut into 3/4-inch dice, about 5 quarts",
    "8 tablespoons (1 stick) butter",
    "1 1/2 pounds sage sausage, removed from casing",
    "1 large onion, finely chopped (about 2 cups)",
    "4 large stalks celery, finely chopped (about 2 cups)",
    "2 cloves garlic, minced or grated on microplane",
    "1/4 cup minced fresh sage leaves (or 2 teaspoons dried sage leaves)",
    "32 ounces (4 cups) low-sodium chicken or turkey broth, preferably homemade",
    "3 whole eggs",
    "1/4 cup minced parsley leaves",
    "Kosher salt and freshly ground black pepper"
  ],
  "__v": 1
}