{
  "hash": "6f848adcc7717da91d591f628f33500e0aecb861",
  "title": "Black Bean and Cheese Enchiladas with Ranchero Sauce",
  "image": "http://cdn-image.myrecipes.com/sites/default/files/image/lighten-up-america/vegetarian-enchiladas-ck-x.jpg",
  "href": "http://www.myrecipes.com/recipe/black-bean-cheese-enchiladas",
  "extension": "",
  "firstAdded": "2017-07-13T22:50:38.206000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400°.",
    "Combine chiles and 2 cups water in a saucepan; bring to a boil, reduce heat, and simmer 5 minutes. Remove from heat; let stand 5 minutes. Drain chiles in a colander over a bowl, reserving 1 cup cooking liquid.",
    "Heat oil in a medium saucepan over high heat. Add onion; saute 1 minute. Reduce heat to medium; add garlic and salt. Cook 5 minutes or until golden, stirring occasionally. Add broth and next 3 ingredients (through cumin); cook 8 minutes or until thickened, stirring occasionally.",
    "Pour onion mixture into a blender; add chiles and reserved liquid. Remove center piece of blender lid (to allow steam to escape); secure lid on blender. Place a clean towel over opening in lid. Blend until smooth; stir in lime juice and red pepper.",
    "Combine the beans, 1 cup cheese, and half the green onions in a bowl. Spread 1/2 cup sauce in the bottom of a 13 x 9-inch glass or ceramic baking dish coated with cooking spray. Warm tortillas according to package directions. Spoon 3 tablespoons bean mixture down center of each tortilla; roll up. Place, seam-side down, in prepared dish. Pour remaining sauce over filled tortillas. Top with the remaining cheese. Bake at 400° for 15 minutes or until lightly browned. Sprinkle with remaining green onions; serve with sour cream."
  ],
  "ingredients": [
    "0",
    "2 dried ancho chiles, stemmed and seeded",
    "2 cups water",
    "2 teaspoons olive oil",
    "1 cup chopped yellow onion",
    "5 garlic cloves, sliced",
    "1/4 teaspoon kosher salt",
    "2 cups organic vegetable broth",
    "2 tablespoons chopped fresh oregano",
    "2 tablespoons no-salt-added tomato paste",
    "1/2 teaspoon ground cumin",
    "1 tablespoon fresh lime juice",
    "1/8 teaspoon ground red pepper",
    "1 (15-ounce) can black beans, rinsed and drained",
    "2 cups (8 ounces) preshredded reduced-fat 4-cheese Mexican-blend cheese, divided",
    "3 thinly sliced green onions, divided",
    "Cooking spray",
    "12 (6-inch) corn tortillas",
    "6 tablespoons light sour cream"
  ],
  "__v": 1
}