{
  "hash": "fe00caa9c38d331611092a79eca84cf7615228de",
  "title": "Loaded Up Sweet Potatoes",
  "image": "",
  "href": "https://www.bonappetit.com/recipe/weve-loaded-up-these-sweet-potatoes-with-some-of-your-favorite-flavors",
  "extension": "Firefox",
  "firstAdded": "2018-10-22T18:02:44.884000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 425° and place racks in the upper and lower thirds. Scrub sweet potatoes under running water and poke holes all over with the tip of a paring knife. Wrap each potato tightly in aluminum foil and bake on the upper rack until a knife pierced through the foil slides easily into center of potato, 60–75 minutes.",
    "While potatoes are baking, prep your vegetables: Cut broccoli into ½” florets and transfer to a large rimmed baking sheet (reserve stem for snacking or another use).",
    "Drain can of chickpeas into a strainer, rinse under cold water, then shake to remove excess water. Pat dry with paper towels and transfer to sheet tray with broccoli.",
    "Smash garlic on cutting board with the flat side of a knife and remove skins. Add to baking sheet.",
    "Drizzle broccoli mixture with 3 Tbsp. olive oil and sprinkle with kosher salt. Toss with clean hands to coat, then spread out in an even layer on baking sheet.",
    "Roast on lower rack along with sweet potatoes, shaking baking sheet once or twice, until chickpeas are golden and crisp and broccoli is browned, 20–25 minutes. Remove from oven and let cool.",
    "Combine yogurt, 3 Tbsp. Cholula Original, half of feta cheese, remaining 1 Tbsp. olive oil, and the roasted garlic from the baking sheet in the jar of a hand blender. Season with salt. [NOTE: This amount of Cholula will give the yogurt sauce a reddish tint.] Cut lemon into 6 wedges, remove seeds, and squeeze 2 wedges into jar with yogurt mixture. Blend until mixture is completely smooth; set aside.",
    "When sweet potatoes are tender, remove from oven and let cool slightly, then unwrap foil and discard (watch for hot liquid and steam inside foil). Make long, shallow, lengthwise cuts into tops of each potato. Squeeze sides slightly and press down to expose orange flesh. Let potatoes sit for a few minutes to allow steam to escape.",
    "Season potatoes with more salt, then dollop yogurt mixture over flesh.",
    "Squeeze two more lemon wedges over broccoli mixture, then spoon mixture over top of potatoes.",
    "Crumble remaining feta over broccoli and top with a few more shakes of Cholula Original. Serve with remaining lemon wedges."
  ],
  "ingredients": [
    "0",
    "4 medium sweet potatoes",
    "1 medium head broccoli",
    "1 15-ounce can chickpeas",
    "4 garlic cloves",
    "4 tablespoons olive oil, divided",
    "1 teaspoon kosher salt, plus more",
    "1/2 cup whole milk Greek yogurt",
    "3 tablespoons Cholula® Original Hot Sauce, plus more",
    "6 ounces feta cheese, in brine, divided",
    "1 lemon"
  ],
  "__v": 1
}