{
  "hash": "de5120d20150cb37fd0db9402b440eb0ffea90d2",
  "title": "How to Make Soft Caramel Candies",
  "image": "https://atmedia.imgix.net/cd14fc4018efbe5a8fefe567e1dee1fae96f3bf1?auto=format&q=45&w=540.0&h=675.0&fit=max&cs=strip",
  "href": "https://www.thekitchn.com/how-to-make-soft-chewy-caramel-candies-cooking-lessons-from-the-kitchn-180832",
  "extension": "Chrome",
  "firstAdded": "2017-12-22T14:51:50.941000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Prepare the caramel mold. Line an 8x8 baking dish with parchment so that excess paper hangs over the edges. Spray the parchment and the sides of the pan with nonstick spray.",
    "Melt the butter in the cream. Over medium heat, warm the cream, butter, and salt in the 2-quart saucepan until the butter melts. Remove from heat, but keep the pan close by.",
    "Combine the sugar, corn syrup, and water. In the larger 4-quart saucepan, combine the sugar, corn syrup, and water. Stir until the sugar is evenly moistened and you form a thick grainy paste. Wipe down the sides of the pan with a damp pastry brush so there are no sugar crystals above the surface of the sugar mixture. Clip the instant-read thermometer to the side of the pan so that the heat sensor is immersed in the sugar. Do not stir the sugar after this point.",
    "Note: The large saucepan is necessary because the sugar will bubble up and triple in size when you add the cream. Do not substitute a smaller pan.",
    "Cook the sugar syrup. Place the pot with the sugar mixture over medium to medium-high heat. Let the sugar syrup come to a boil without stirring. At first, you will see small bubbles around the edge of the pan, which will eventually move inward. Around 250°F, the sugar syrup will turn transparent and boil rapidly. Around 320°F, the syrup will darken slightly and smell caramel-like. You can proceed to the next step any time after the syrup reaches 250°F and before it reaches 325°F.",
    "Note: If your instant-read thermometer isn't quite submerged into the sugar, you may need to tilt the pan to get an accurate reading. Simply tilt the pan by the handle until the thermometer is submerged a few inches in the sugar syrup. If the syrup hasn't reached 250°, wipe down the sides with a pastry brush again. If it has, there's no need.",
    "Whisk in the cream and butter. Turn off the heat under the sugar syrup. Slowly pour the warm cream and butter mixture into the sugar syrup while whisking the sugar syrup gently. The sugar syrup will bubble up and triple in size. Stop whisking once all the milk and butter mixture has been added.",
    "Heat the caramel to 245°F - 250°F. Return the pan to medium to medium-high heat. Let the caramel come to a boil without stirring. It will start off as a soft buttery yellow and eventually darken to reddish-brown caramel. Remove from heat when the caramel reaches 245°F to 250°F.",
    "Whisk in the vanilla. Quickly whisk the vanilla into the caramel.",
    "Pour the caramels into the mold. Immediately pour the caramels into the mold. Do not scrape the pan (there are sometimes hard burnt bits on the bottom). Knock the pan agains the counter a few times to help air bubbles work their way out.",
    "Let the caramels set. Set the caramels somewhere out of the way to set, for at least two hours or (ideally) overnight. Once the caramels have cooled to room temperature, you can cover the pan.",
    "Cut the caramels. When the caramels have set, lift them out of the pan by the parchment paper flaps and onto a cutting board. Cut the caramels into candies with a very sharp knife. If the caramels stick to your knife, spray your knife with nonstick cooking spray.",
    "Wrap the caramels in wax paper. Cut squares of wax paper a little longer than your caramels. Wrap each caramel in wax paper and twist the ends closed. Caramels will keep at room temperature for about two weeks.",
    "Recipe Notes",
    "Softer Caramels: The softness of the caramels is mainly a result of the cream. This recipe makes fairly firm, chewy caramels. For softer, taffy-like caramels, experiment with adding an extra 1/4 cup to 1/2 cup of cream to this recipe.",
    "Caramel Variations:",
    "• Salted Caramels - Add two teaspoons of salt to the cream mixture at the beginning of the recipe and sprinkle the finished caramels with coarse sea salt.",
    "• Gingerbread Caramels - Add 2 tablespoons of molasses to the sugar mixture. Add 1/2 teaspoon cinnamon, 1/2 teaspoon ground ginger, 1/4 teaspoon nutmeg, and 1/8 teaspoon ground cloves along with the vanilla at the very end of cooking.",
    "• Chocolate Caramels - Increase the amount of cream to 1 1/2 cups. Melt 10 ounces of good chocolate into the cream mixture along with the butter."
  ],
  "ingredients": [
    "0",
    "What You Need",
    "Ingredients",
    "1 cup heavy cream",
    "4 tablespoons unsalted butter",
    "1/4 teaspoon salt",
    "1 1/2 cups white granulated sugar",
    "1/4 cup corn syrup",
    "1/4 cup water",
    "1/2 teaspoon vanilla extract",
    "Equipment",
    "8x8 baking dish (or similar size)",
    "Parchment paper",
    "2-quart saucepan",
    "4-quart saucepan",
    "Instant-read thermometer or candy thermometer",
    "Spatula",
    "Whisk",
    "Wax paper"
  ],
  "__v": 1
}