{
  "hash": "fa2b4b5b0441ed930f510defdd20d0af26c5a19d",
  "title": "Rotisserie Inspired Roasted Chicken",
  "image": "http://www.tasteloveandnourish.com/wp-content/uploads/2013/10/Rotisserie-Inspired-Roasted-Chicken-3.jpg",
  "href": "http://www.tasteloveandnourish.com/2013/10/28/rotisserie-inspired-roasted-chicken/",
  "extension": "Chrome",
  "firstAdded": "2015-10-13T17:00:45.373000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "giblets",
    "rinsed",
    "olive",
    "oil",
    "kosher",
    "salt",
    "black",
    "pepper",
    "smoked",
    "paprika",
    "poultry",
    "seasoning",
    "chili",
    "onion",
    "garlic"
  ],
  "directions": [
    "0",
    "Place the dried chicken, breast side up, in a cast iron skillet or a roasting pan.",
    "In a small bowl, combine the remaining ingredients.",
    "Gently slide a spoon between the breast meat and the skin to separate the two. Do this on each side. Then using about 1 teaspoon per side, put some of the mixture under the breast skin and rub it around (this is totally optional, but makes the breast meat super flavorful). Use the remaining mixture to rub all over the rest of the bird. Now, tuck the wings under the bird so that the tips don’t burn and tie up the legs with some kitchen twine to cook more evenly (if you’re not into bondage…you certainly can skip that step)!",
    "If you have time, cover the bird up loosely with plastic wrap and refrigerate. Allow the rub to “marinate” for a few hours and even overnight. If you don’t have time…no worries, just put it in the oven at this point. It will still be delicious!",
    "Preheat your oven to 450 degrees.",
    "Put the chicken in the oven and reduce the temperature to 375 degrees. Cook about 20 minutes per pound or until the breast meat is 180 degrees.",
    "When the chicken is done, remove it from the oven and allow it to sit in the pan for at least 15 to 20 minutes.",
    "Move the chicken to a cutting board and set aside.",
    "Tilting the skillet to its side a bit, skim as much of the fat off the top as you can and discard it. Place the skillet or stove top safe roasting pan over medium high heat on the stove and bring to a boil. Allow the sauce to reduce for just about 2 to 3 minutes. Pour into a gravy boat or bowl for serving.",
    "Notes:",
    "I’ve recently started buying smaller chickens for roasting. I find them much more tender and delicate. You are better off roasting two smaller birds at once than one large one.",
    "Be sure to dry the chicken really well before rubbing the olive oil mixture on to ensure a nice crisp skin.",
    "Go ahead and throw a couple of bay leaves, thyme sprigs or onion slices into the cavity for extra flavor. Just don’t overstuff or your cooking time will take longer.",
    "If you love roasted chicken, you will also love this Roasted Herbs de Provence Chicken!"
  ],
  "ingredients": [
    "0",
    "4 – 6 pound whole chicken, giblets removed, rinsed and dried well",
    "2 tablespoons olive oil",
    "1 teaspoon kosher salt",
    "1 teaspoon freshly ground black pepper",
    "1 teaspoon smoked sweet paprika",
    "3/4 teaspoon poultry seasoning",
    "1/2 teaspoon chili powder",
    "1/2 teaspoon onion powder",
    "1/4 teaspoon garlic powder"
  ],
  "__v": 1
}