{
  "hash": "401c110de4af6a4c53e5fd1c63243bc913a6488a",
  "title": "Soupe au pistou",
  "image": "http://fiveandspice.com/wp-content/uploads/2010/07/soupepistou11.jpg",
  "href": "http://fiveandspice.com/2010/07/09/thats-right-youre-not-from-texas-soupe-au-pistou/",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T22:35:15.719000",
  "users": [
    null
  ],
  "keywords": [
    "mild",
    "garlicky",
    "sausage",
    "example",
    "italian",
    "olive",
    "oil",
    "leeks",
    "washed",
    "dark",
    "parts",
    "discarded",
    "light",
    "green",
    "white",
    "carrot",
    "dice",
    "celery",
    "rib",
    "garlic",
    "tbs",
    "parsley",
    "thyme",
    "tarragon",
    "bay",
    "leaf",
    "bunch",
    "chard",
    "tough",
    "portions",
    "stems",
    "zucchini",
    "summer",
    "squash",
    "tomatoes",
    "chicken",
    "broth",
    "orzo",
    "israeli",
    "couscous",
    "beans",
    "salt",
    "pistou"
  ],
  "directions": [
    "0",
    "Squeeze sausage out of casings, and fry over medium in a large soup pot until browned, breaking into chunks as it fries. With a slotted spoon, remove the sausage to a bowl, leaving behind the fat.",
    "Add a little extra dash of olive oil, (if you’re not using sausage, skip those steps and just heat some olive oil in a soup pot) then add the leeks, carrot and celery to the pot. Cook for about 10 minutes, stirring occasionally, until the leeks are beginning to caramelize. Stir in the garlic and herbs and cook for a minute.",
    "Add the chard, zucchini, summer squash, and tomatoes, and stir to coat the vegetables with the leek and herb mixture. Cook for another couple of minutes, then stir in the broth. Bring the soup to a boil, turn down to a simmer, and cook, covered, for about 10 minutes, until the vegetables are just beginning to soften.",
    "Add in the orzo/couscous and beans, and add the sausage back in if using. Cook until the pasta is tender, another 10 or so minutes. Season with salt to taste (remembering that the pistou will also add some salt and flavor). To serve, ladle into bowls, and swirl a large dollop of pistou into each serving. Accompany with crusty bread."
  ],
  "ingredients": [
    "0",
    "1 lb. mild garlicky sausage (for example, sweet Italian), optional",
    "dash olive oil",
    "3 leeks, washed, dark green parts discarded, light green and white part sliced",
    "1 carrot, chopped into a small dice",
    "1 celery rib, chopped",
    "4 garlic cloves, minced",
    "1 Tbs. dried parsley",
    "½ Tbs. dried thyme",
    "½ Tbs. dried tarragon",
    "1 bay leaf",
    "1 bunch chard, washed, tough portions of stems removed, and chopped",
    "1 zucchini, sliced",
    "1 summer squash, sliced",
    "3 tomatoes, chopped into a small dice",
    "6 cups vegetable or chicken broth",
    "1 cup orzo or Israeli couscous",
    "1 can white beans, drained",
    "½ tsp. salt, plus more to taste",
    "pistou (see below)"
  ],
  "__v": 1
}