{
  "hash": "810bac6e883cba85691410998ab312eae03f0c23",
  "title": "Jonathan Waxman's Braised Lamb Shanks",
  "image": "http://a.abcnews.com/assets/images/font-sm_off2.gif",
  "href": "http://abcnews.go.com/GMA/recipe/jonathan-waxmans-braised-lamb-shanks-dates-tangerines-baby-16002431?nwltr=GMAR_tryPic_pos3",
  "extension": "Chrome",
  "firstAdded": "2015-03-27T21:21:09.045000",
  "users": [
    null
  ],
  "keywords": [
    "mixiote",
    "salsa",
    "guajillochiles",
    "pasillanegrochiles",
    "white",
    "onion",
    "garlic",
    "cumin",
    "seed",
    "oregano",
    "allspice",
    "cinnamon",
    "agave",
    "nectar",
    "water",
    "turmeric",
    "rub",
    "mixiotes",
    "sheets",
    "parchment",
    "paper",
    "pieces",
    "banana",
    "leaf",
    "square",
    "lamb",
    "shanks",
    "salt",
    "pepper",
    "needed",
    "blended",
    "oil",
    "dates",
    "cippolini",
    "onions",
    "tangerines"
  ],
  "directions": [
    "0",
    "For the mixiote salsa: Wipe and clean all the chiles. Open them and discard the stems, seeds and veins. Toast them in the oven at 350 degrees for about 2 or 3 minutes, or until the chiles are a tobacco color but not burned. Soak the chiles in plenty of warm water for about 20 minutes.",
    "Roast the onion and the garlic. Heat the spices in a pan to release the oils for about 2 minutes. Blend all of the ingredients together in a blender to achieve a textured puree.",
    "For the cumin and tumeric rub: Mix the two together well.",
    "For the mixiotes: Season the lamb shanks well with salt and pepper.",
    "Heat oil in a pan and sear the lamb shanks well on all sides. When cool enough to handle, rub the lamb shanks with the cumin and turmeric rub. Wet the parchment sheets with warm water to make more pliable. Lay out two sheets of paper on top of each other.",
    "Place the banana leaf in the center of the parchment paper. In each package, put 3 dates, 3 onions and 3 quarters of tangerine. Place the lamb shank on top of the banana leaf, with the bone standing straight up.",
    "Ladle 6oz. of the mixiote salsa on top of and around each shank. Pull up the ends of the paper around the shank bone and tie with string. Place aluminum foil around each package to protect the paper from breaking. Place the 4 packages into a perforated pan.",
    "Set the perforated pan over a pan of water. Cover well with either aluminum foil or a tight fitting lid. Bring to a boil over high heat and then turn down to a simmer. Let simmer for about 2 hours or until the shanks are tender. Remove from the steamer and untie each package. Roll down the sides of each package to create a \"bowl\". Place each package into a bowl and serve.",
    "Recipe courtesy Jonathan Waxman."
  ],
  "ingredients": [
    "0",
    "For the mixiote salsa:",
    "4oz. Guajillochiles",
    "2oz. pasillanegrochiles",
    "2oz. white onion",
    "1.25oz. garlic, peeled",
    "1 teaspoon cumin seed",
    "1 tsp dried oregano",
    "1/2 tsp cloves",
    "1/2 tsp allspice",
    "1/4 tsp cinnamon",
    "2oz. agave nectar",
    "12oz. water",
    "For the cumin and turmeric rub:",
    "2 Tbsp. Ground cumin",
    "2 Tbsp. Ground turmeric",
    "For the mixiotes:",
    "8 sheets Parchment paper",
    "4 pieces of banana leaf, cut about 8 inches square",
    "4 lamb shanks",
    "Salt and pepper as needed",
    "Cumin and turmeric rub",
    "Blended oil as needed",
    "12 dates",
    "12 cippolini onions",
    "3 tangerines",
    "24 oz. mixiote salsa"
  ],
  "__v": 1
}