{
  "hash": "0f0fa817f2c3d40fd1c3586a29b07b6d8fde9f2f",
  "title": "Crispy Panko Fish TacosBrianTori AveybarbaraTori AveyinessaKari@Loaves and DishesTJLindsayLBEdCBarry ScottYolandacaroleJill GreenlawCarlotaTori AveyageddBrandonTori AveyStephenTori AveyWayne, Big Fat Daddy'sMike likes this recipeRisa LevineBetty-AnneTori AveyPrissnbootRachaelPamMary LairdSylviaTori Avey311RockerTori AveyLCTori AveyElizabethTara HCassieTori AveyRachaelTanyaAlyssa HoldsclawTori AveyRuthTori AveyJulieTori AveyNancy in NJTori AveyVicki in TucsonTori AveytaraAmy ClarkTori AveyCaroleTori AveyCaroleTori AveyJohn MJohn MTori AveyJohn MJessica DTony ArellanoTori AveyamyTori AveyCaroleamyCaroleJohn MElizabeth LevyElizabeth DevineTori AveyElizabeth LevyTori AveymelissaTori Avey",
  "image": "http://toriavey.com/images/2012/07/Crispy-Fish-Tacos--640x480.jpg",
  "href": "http://toriavey.com/toris-kitchen/2012/07/crispy-panko-fish-tacos/",
  "extension": "Chrome",
  "firstAdded": "2015-07-06T04:17:53.498000",
  "users": [
    null
  ],
  "keywords": [
    "boneless",
    "skinless",
    "fillets",
    "choose",
    "firm",
    "white",
    "fish",
    "cod",
    "halibut",
    "corn",
    "tortillas",
    "grapeseed",
    "oil",
    "high",
    "smoke",
    "point",
    "frying",
    "beer",
    "seltzer",
    "water",
    "flour",
    "cornstarch",
    "salt",
    "garlic",
    "cayenne",
    "pepper",
    "panko",
    "breadcrumbs",
    "cabbage",
    "avocados",
    "tomatoes",
    "seeded",
    "lime",
    "wedges",
    "taco",
    "toppings",
    "prefer",
    "salsa",
    "fresca",
    "cilantro",
    "jalapeno",
    "hot",
    "kick",
    "sour",
    "cream",
    "mayonnaise",
    "juice",
    "zest",
    "medium",
    "mixing",
    "bowls",
    "plate",
    "skillet",
    "wire",
    "cooling",
    "rack"
  ],
  "directions": [
    "0",
    "Cut the fish fillets into chunks that are roughly 2 inches long and 1 inch wide.",
    "Make Tori's Crunchy Panko Coating. In a medium mixing bowl, whisk together the beer or seltzer, flour, cornstarch, salt, garlic powder and cayenne pepper. Note that the beer will be difficult to measure out due to foam; you’ll need at least 1 1/2 cups of beer to make this batter. The batter should be thick like pancake batter, but if it appears clumpy or overly thick add more beer, seltzer or water until mixture is thin enough for dipping.",
    "Pour the panko breadcrumbs into another bowl. Have an empty plate handy for the breaded fish.",
    "Dip each piece of fish into the batter. When you pull the fish out of the batter, let the excess batter run back into the bowl.",
    "After dipping in the batter, gently roll each piece in panko crumbs to coat. Leaving too much batter on the fish will lead to clumping, so make sure your fish is only lightly coated with batter before breading. Use one hand for wet dipping and the other for dry, otherwise you’ll end up with lots of clumps in the dry coating ingredients. Place the breaded fish onto the empty plate.",
    "When your fish is breaded, heat 1/2 inch of cooking oil in a skillet over medium high. Fry the breaded fish pieces in batches ofIf the oil is at the correct temperature, it should bubble and sizzle evenly—no splatters or popping.",
    "Flip the fish when they turn dark golden brown. It will take 2-3 minutes per side for the fish to become golden and crisp.",
    "While the fish fries, whisk together your sauce ingredients. Reserve the sauce.",
    "Place fried fish pieces on a wire rack to drain, if you have one. This will keep the fish as crisp as possible. Use paper towels to catch the oil drips underneath the rack. If you don’t have a wire rack, you can drain the fish pieces on a double layer of paper towels.",
    "When all the fish pieces are fried, assemble your tacos. Heat the corn tortillas in a skillet till they become warm, fragrant, and flexible. Place 2 pieces of fried fish in each taco. Top with a bit of shredded lettuce, some diced tomato, 2 slices of avocado, and 1 tbsp of sour cream sauce. Serve warm with fresh lime wedges."
  ],
  "ingredients": [
    "0",
    "1 1/2 lb. boneless skinless white fish fillets - choose a firm white fish like cod or halibut",
    "15 corn tortillas for serving",
    "Grapeseed oil or oil with a high smoke point for frying",
    "1 1/2 cups beer (or substitute seltzer water)",
    "1 cup flour",
    "1 tbsp cornstarch",
    "1 tsp salt",
    "3/4 tsp garlic powder",
    "1/4 tsp cayenne pepper",
    "1 1/4 cups panko breadcrumbs",
    "2 1/2 cups shredded cabbage",
    "2 ripe avocados, thinly sliced",
    "2 tomatoes, seeded and diced",
    "Fresh lime wedges for garnish",
    "You can add other taco toppings if you prefer-- salsa fresca, fresh chopped cilantro, jalapeno or hot sauce for a kick",
    "1 cup sour cream (or 1/2 cup sour cream, 1/2 cup mayonnaise)",
    "2 tbsp fresh lime juice (or more to taste)",
    "1 1/2 tbsp chopped cilantro",
    "1 tsp lime zest",
    "Salt to taste",
    "Medium and small mixing bowls, plate, large skillet, wire cooling rack (optional)"
  ],
  "__v": 1
}