{
  "hash": "c0abef2a79a29ed9e9692fad6dc4728297379105",
  "title": "Pollo alle mandorle",
  "image": "http://recipe-folder.com/img/recipe-images/043/198/1550755443.jpg",
  "href": "https://ricette.giallozafferano.it/Pollo-alle-mandorle.html",
  "extension": "Chrome",
  "firstAdded": "2020-02-18T21:07:44.609000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "PREPARAZIONE 10 minuti - COTTURA 20 minuti",
    "Per preparare il pollo alle mandorle, iniziate preparando gli aromi; sbucciate lo spicchio di aglio e affettatelo sottilmente, poi pelate lo zenzero e grattugiatelo infine sbucciate e affettate la cipolla.",
    "Private i petti di pollo delle le parti di grasso più evidenti con un coltellino. Quindi tagliate il petto a bocconcini di 1-2 centimetri. Ponete un colino sopra una ciotola, versate all'interno i bocconcini di pollo e infarinateli, scuotete il colino per eliminare la farina in eccesso.",
    "In una padella Wok, o una padella antiaderente dai bordi alti, riscaldate l'olio di semi, poi aggiungete l'aglio, lo zenzero grattugiato e la cipolla affettata. Lasciate dorare gli ingredienti per alcuni minuti a fuoco medio, mescolando spesso.",
    "Aggiungete al soffritto i bocconcini di pollo infarinati, quindi fate dorare anch'essi mescolando spesso. Solo quando presenteranno una leggera crosticina, versate la salsa di soia e mescolate.",
    "Nella stessa brocchetta che avete usato per la soia, versate 20 g di acqua, per irrorare il pollo (in questo modo non sporcherete due contenitori) e mescolate con un cucchiaio per amalgamare il tutto. Se il pollo tendesse ad attaccarsi, abbassate in fuoco e aggiungete ancora un po’ di acqua calda.",
    "Cuocete il pollo per circa 10 minuti, a fine cottura salate il pollo quanto basta, tenendo in considerazione che la salsa di soia è già piuttosto sapida. Mentre il pollo cuoce, ponete in una padella antiaderente le mandorle pelate e tostatele per 2-3 minuti (In alternativa potete tostare le mandorle in forno: distribuitele su una teglia rivestita con carta da forno e tostatele per pochi minuti a 180° per dorarle).",
    "A questo punto, unite le mandorle tostate al pollo e amalgamate delicatamente con un cucchiaio di legno per alcuni istanti.",
    "Spegnete quindi il fuoco e il vostro pollo alle mandorle sarà pronto per essere servito ben caldo."
  ],
  "ingredients": [
    "0",
    "4 persone",
    "Petto di pollo 500 g",
    "Mandorle pelate 130 g",
    "Zenzero fresco da grattugiare, o in polvere 15 g",
    "Farina 00 q.b.",
    "Sale fino q.b.",
    "Cipolle tritate o a fettine sottili 60 g",
    "Olio di semi 25 g",
    "Salsa di soia 60 g",
    "Aglio 1 spicchio",
    "Acqua 20 g"
  ],
  "__v": 6
}