{
  "hash": "2bb2e8dbd93e800e036af1bc95e4b7d13f7e2d48",
  "title": "Seared Tofu Banh Mi Sandwiches",
  "image": "http://d1wcgy4dy6voh7.cloudfront.net/wp-content/uploads/2015/01/IMG_2014_12_28_02427-flat2.jpg",
  "href": "http://www.loveandlemons.com/seared-tofu-banh-mi-sandwiches/",
  "extension": "Chrome",
  "firstAdded": "2016-08-04T00:59:44.122000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make ahead: Place thinly sliced daikon, carrots, cucumbers, and jalapeños in a medium jar with white wine vinegar, rice vinegar, sugar and salt. If the liquids don’t cover the veggies, add about 2 tablespoons of water and more vinegar if necessary (the amount you need will depend on the size of your jar). Let chill for at least an hour, or store in the fridge for at least a week.",
    "Drain tofu, slice it into approx. ½ inch slices. Place on a towel and gently pat dry to remove excess water.",
    "In a small bowl, whisk together olive oil, tamari, lime, zest, garlic, ginger, and freshly cracked pepper.",
    "Place tofu in a shallow pan and pour the marinade on top. Flip the tofu so that it coats (if it doesn’t coat fully in your pan, add a bit more tamari until all tofu is coated). Let the tofu marinate for at least 15 minutes.",
    "Heat a nonstick skillet to medium-high heat. Add a little oil to the pan and place tofu pieces with enough space between each so that they’re not too crowded (you can cook them in batches). Let the tofu cook (without moving it around too much) for a few minutes per side until they’re deeply golden brown and caramelized (almost blackened) around the edges. Remove from heat. Taste a little piece and add more salt & pepper if necessary.",
    "Assemble sandwiches with mayo, tofu slices, pickled veggies, cilantro and serve with sriracha."
  ],
  "ingredients": [
    "0",
    "1 14oz. pkg. extra firm tofu (see notes)",
    "olive oil, for the pan",
    "fresh baguette, sliced into sandwich sized portions",
    "good quality mayo, or vegan mayo",
    "a few sprigs of cilantro per sandwich",
    "sriracha, to taste",
    "1",
    "1 small daikon sliced into matchsticks",
    "2 small carrots, sliced into matchsticks",
    "½ a small cucumber, de-seeded & sliced into matchsticks",
    "½ jalapeño, thinly sliced",
    "¼ (or more) cup white wine vinegar",
    "¼ (or more) cup rice vinegar",
    "a few pinches of sugar",
    "a few pinches of salt",
    "2",
    "1 tablespoon olive oil",
    "2 tablespoons tamari (or soy sauce)",
    "juice of ½ lime + a little zest",
    "1 clove garlic, minced",
    "½ teaspoon minced ginger",
    "generous amounts of freshly cracked pepper"
  ],
  "__v": 1
}