{
  "hash": "925fc7230d771f61f59b2c9a2459637b9a2557b1",
  "title": "Freeze-Ahead Dinner Rolls",
  "image": "https://images.food52.com/y0emzH6tWzJFiWSYMu9jYS6TuGU=/753x502/3fea570a-c439-43b0-8b76-be33f92b3ba0--Rolls.jpg",
  "href": "https://food52.com/recipes/64998-freeze-ahead-dinner-rolls",
  "extension": "Chrome",
  "firstAdded": "2016-11-06T19:21:06.764000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In the bowl of a stand mixer, whisk together 2 cups flour, sugar, salt, and yeast.",
    "In a small saucepan or microwave, heat the milk, water, and butter together until warm but not hot. It's okay if the butter doesn't melt entirely.",
    "Add the wet ingredients to the dry and mix well. Mix on medium speed with the dough hook for 2 minutes.",
    "Add 1/2 cup of flour and the eggs and beat for another 2 minutes. Add enough flour to make an elastic dough -- the dough will be sticky but shouldn't be wet. You may not use all the flour called for, or you might need a little more than the recipe calls for. Just add it a little at a time until the consistency is right.",
    "Knead the dough for 8-10 minutes.",
    "Transfer the dough to a lightly greased bowl, cover, and let rise for about 20 minutes.",
    "Punch down the dough and, using lightly floured hands, shape into whatever shape you want. My favorite shapes are these three. 1: Cloverleaf rolls: Pinch off small pieces, roll them into balls, and place three small balls each into the wells of well-greased muffin tin. 2: Classic rolls: Divide the dough into 18 pieces, roll each piece into a ball, and place 9 balls in one greased 9\" round pan and 9 in another 9\" round pan. 3: Twist rolls: Divide the dough into 18 equal pieces. Roll each piece out into a thin coil, twist the coil around your hands into a knot, and place on a lightly greased baking sheet.",
    "Once you've shaped your dough, place them into the freezer (for the muffin tin and round pan rolls, just put the entire pan into the freezer) and freeze until very firm. Transfer the frozen shaped rolls into a plastic bag (the round pan rolls should stay in one big round), and freeze for up to 4 weeks.",
    "When you're ready to bake, remove the rolls from the freezer. If you're baking cloverleaf rolls or the pan rolls, transfer them back into the same muffin tin or round baking pan that you shaped them in (grease it first). If baking freeform shapes like twist rolls, just place them on a greased baking sheet. Cover with plastic wrap or a damp towel and let rise until puffy, about 1 1/2 hours. Just before baking, sprinkle with flaky sea salt (if desired).",
    "Preheat the oven to 350°F and bake for about 15 minutes, or until golden brown.",
    "Note: If you want to skip the freezing step, you can. Just preheat the oven after shaping your rolls, let them rise for 15 minutes, and then bake."
  ],
  "ingredients": [
    "0",
    "5 1/2 to 6 1/2 cups all-purpose flour",
    "1/2 cup sugar",
    "1 1/2 teaspoons salt",
    "4 1/2 teaspoons instant or active dry yeast (2 envelopes)",
    "1 1/4 cups water",
    "1/2 cup milk",
    "1/3 cup butter",
    "2 eggs, at room temperature"
  ],
  "__v": 1
}