{
  "hash": "3b82d7cae86799dd0453f263d55ccc982529f05a",
  "title": "Hawthorn Recipe – Hawthorn Herbal Chocolate",
  "image": "https://naturalherballiving.com/wp-content/uploads/2014/02/hawthorn-herbal-chocoloates.jpg",
  "href": "https://naturalherballiving.com/heart-lovin-herbal-chocolate-recipe/",
  "extension": "Chrome",
  "firstAdded": "2015-09-12T04:18:10.036000",
  "users": [
    null
  ],
  "keywords": [
    "brand",
    "make",
    "ownbuy",
    "buy",
    "use"
  ],
  "directions": [
    "0",
    "Directions",
    "Place your solid cocoa butter in the pyrex measuring cup. When you place the cocoa butter in there you want about a cup and a half of the un-melted cocoa butter, so when it melts it equals 1 cup.",
    "Place your glass container into a pot with water in it. The water should go up about 1/4-1/2 the side of your pyrex measuring cup to melt the butter, but not splash boiling water into your chocolates. Turn the stove top to medium and allow the cocoa butter to melt. Be sure you have 1 cup of melted cocoa butter.",
    "While the cocoa butter is melting, place your rose petals and hawthorn berry powder into the coffee grinder and grind it until you reach a fine powder. Although the hawthorn powder would work without grinding it more, the rose petals need some extra bulk to grind into a fine powder. The hawthorn adds just enough extra oomph to turn the rose into a nice fine powder.",
    "Add your coconut cream to the bowl and whisk until combined.",
    "Turn the burner to “keep warm”.",
    "Add stevia and vanilla extract and mix thoroughly.",
    "Add cocoa powder, maca powder, and hawthorn rose powder, cinnamon and salt mix thoroughly.",
    "Taste your mix. At this point you should be able to see how sweet or bitter your mix is, and slowly add more stevia or sugar to reach your personal preference. Add sugar or stevia to taste. Your mix will be more bitter once it cools than it is when it is warm, so I find I need to add a little more sweetener to the warm mix to have a finished product with the right flavor.",
    "Mix everything thoroughly, you don’t want pools of cocoa butter at the top of your mix or your chocolates will look funny.",
    "Pour quickly into chocolate molds or onto a pan lined with parchment paper, smoothing the chocolate into the molds with a chopstick or the back of a butter knife as needed. and refrigerate for an hour. Pop out of molds and enjoy!",
    "I like to keep these refrigerated. They should be good for up to two weeks."
  ],
  "ingredients": [
    "0",
    "I got mine here",
    "I got mine here",
    "this brand",
    "I got mine here",
    "I got mine here",
    "I got mine here",
    "make your ownbuy it here",
    "buy it here",
    "I buy this brand",
    "I got mine here",
    "this is the brand I use"
  ],
  "__v": 1
}