{
  "hash": "8374c2717945b51b07762a4545521103e8786b3e",
  "title": "5 Ingredient Vegan Almond Feta Cheese",
  "image": "http://i2.wp.com/yesiamvegan.com/wp-content/uploads/2014/08/DSC_0076.jpg?w=205",
  "href": "http://yesiamvegan.com/2014/08/05/vegan-almond-feta-5-ingredients/",
  "extension": "",
  "firstAdded": "2015-12-30T13:11:43.030000",
  "users": [
    null
  ],
  "keywords": [
    "raw",
    "almonds",
    "nutritional",
    "yeast",
    "garlic",
    "lemon",
    "juicethis",
    "gives",
    "kickbe",
    "generous",
    "used",
    "saltto",
    "water"
  ],
  "directions": [
    "0",
    "Soak Almonds in 2 cups very hot water for 2 hours.",
    "Skin almonds.",
    "Add the almond kernels & water into a food processor. Make a smooth paste.",
    "Add the other ingredients to the food processor and process until smooth(if you need extra water-add 1 Tbsp at a time)",
    "Transfer to a colander lined with a cheesecloth and squeeze down starting from the open end.",
    "Now, wrap an elastic band on the open end (tight) and keep a container underneath to collect juices [The creamy cheese milk can be added to salads or to my cheesy hummus. I love it]",
    "Leave it overnight refrigerated.",
    "Next day you will find a big mass of almond cheese inside the cheese cloth.",
    "Preheat the oven to 160 deg.",
    "To shape them, you could transfer to a cling-wrapped bowl.",
    "Line a tray with baking paper and flip the bowl onto the tray. Carefully, remove bowl & cling wrap and you will see the cheese sit there on the tray",
    "Bake for 20 minutes. Remove, Make some deep pits using toothpicks to ease cooking.",
    "Back into the oven, Bake the cheese until the cracks start to appear on the top of the cheese. (It took 30 minutes on a middle-tier oven rack)",
    "Remove from oven and there you are-with an awesome almond feta.",
    "Cut into cubes and use it as you do with Feta.",
    "Store in an airtight container (in a refrigerator). Tastes amazing even after a week"
  ],
  "ingredients": [
    "0",
    "Raw Almonds-1.5 cups",
    "Nutritional Yeast-1/4 cup",
    "Garlic-2 cloves",
    "Lemon juice-this is what gives you the kick-be generous. [I used 2 Tbsp + 1 tsp]",
    "Salt-to taste",
    "Water-1.5 cups"
  ],
  "__v": 1
}