{
  "hash": "2b59260e795b28028b9d07fe3c57377de8273452",
  "title": "\"Genius\" Mushroom BorguignonClassic Yukon Gold Mashed Potatoes",
  "image": "http://umamigirl.com/wp-content/uploads/2016/10/30-13649-post/Genius-Mushroom-Bourguignon-Umami-Girl-2(pp_w768_h1159).jpg",
  "href": "http://umamigirl.com/2016/10/mushroom-bourguignon-mashed-potatoes.html",
  "extension": "Chrome",
  "firstAdded": "2016-11-13T22:00:20.987000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a 12-inch, heavy nonstick skillet,** heat one tablespoon each of the olive oil and butter over high heat. Add half the sliced mushrooms and cook without disturbing until golden brown on one side, about 3 minutes. Toss once and cook until some mushrooms start to brown on the other side (don't stress at all about flipping all of them perfectly), about two minutes more. Scrape into a large bowl and repeat with a second tablespoon each of olive oil and butter and the other half of the mushrooms. Set mushrooms aside.",
    "In the same skillet, warm the remaining tablespoon olive oil over medium-high heat. Add onion and carrot along with 1/2 teaspoon salt and a few grinds black pepper and cook, stirring occasionally, for 10 minutes, Onions and carrots should be lightly browned. Stir in the garlic, thyme (stems and all) and sage and cook until very fragrant, a minute or two.",
    "Pour in the wine. Turn heat up to high and simmer briskly until reduced by half. Stir in tomato paste and broth, then add back the mushrooms and all the beautiful accumulated juice from the bowl. If your broth is low-sodium, add an additional 1/2 teaspoon salt. If not, wait and taste at the end. Bring to a boil, then simmer for 20 minutes. (This is a good time to start the mashed potatoes.)",
    "With a fork, thoroughly mash together the remaining tablespoon of butter and the flour in a small bowl to form a paste. Stir paste into stew. Lower heat to simmer gently and cook 10 minutes more. Sauce should be thick and glossy. Taste for salt and pepper. Remove or avoid thyme stems. Serve spooned over mashed potatoes.",
    "1",
    "Peel the potatoes and cut into rough 1-inch cubes. Place in a medium pot and fill with water to cover by an inch. Add 1 tablespoon salt. Bring to a boil, then reduce heat and simmer until tender but not waterlogged, about 15 minutes. Drain and place back in pot. Mash with potato masher until reasonably smooth. (I prefer to mash before adding liquid so the potatoes don't get gummy.)",
    "Place milk and butter in a microwave-safe bowl or liquid measure and heat until just shy of boiling. Pour liquid into pot with potatoes, add remaining 1 teaspoon salt and some pepper, and stir together until creamy."
  ],
  "ingredients": [
    "0",
    "3 tablespoons olive oil, divided",
    "3 tablespoons salted butter, divided",
    "2 pounds cremini mushrooms, trimmed and cut into 1/4-inch slices",
    "1 large yellow onion, diced small",
    "1 small carrot, peeled and diced small",
    "3 garlic cloves, minced",
    "2 generous sprigs fresh thyme",
    "1 fresh sage leaf, minced",
    "1 cup good, dry red wine*",
    "2 tablespoons tomato paste",
    "2 cups good vegetable broth ( this is my favorite by far)",
    "4 teaspoons all-purpose flour***",
    "Salt and pepper, to taste",
    "1",
    "2 pounds Yukon Gold potatoes",
    "1 tablespoon plus 1 teaspoon salt, divided",
    "3/4 cup whole milk",
    "2 tablespoons salted butter",
    "Freshly ground black pepper, to taste"
  ],
  "__v": 1
}