{
  "hash": "91ff22ebc27d52ee9ffe3898b8ae678527cbced5",
  "title": "Recipe Notes",
  "image": "https://atmedia.imgix.net/1443c7e485ba653a9a86445c259afa91015b3632?auto=format&q=45&w=600.0&h=800.0&fit=max&cs=strip",
  "href": "http://www.thekitchn.com/recipe-mediterranean-tuna-noodle-casserole-249766",
  "extension": "Chrome",
  "firstAdded": "2017-11-07T00:10:29.387000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Olive oil 10 ounces wide, dried egg noodles 1 pound small red potatoes, sliced 1/4-inch thick 4 tablespoons (1/2 stick) unsalted butter 1/4 cup all-purpose flour 2 cups milk 2 teaspoons kosher salt, divided Freshly ground black pepper 4 (6-ounce) cans olive-oil packed tuna, drained 1 box (9 ounces) frozen artichoke hearts, thawed and halved 3/4 cup capers, rinsed and drained 1/2 cup sliced black olives 4 medium scallions, thinly sliced 1/2 cup finely chopped fresh flat-leaf parsley 3/4 cup finely grated Parmesan cheese, divided",
    "Arrange a rack in the middle of the oven and heat to 400°F. Lightly coat a 2-quart or 9x13-inch baking dish with oil; set aside.",
    "Bring a large pot of salted water to a boil. Add the noodles and cook for 2 minutes less than recommended on the package directions. Drain the noodles, then transfer them to a large bowl. Toss them immediately with a drizzle of olive oil so they don't clump together; set aside.",
    "Fill the pot with water again and bring to a boil. Add the potato slices and cook for 4 minutes. Drain well, then return them to the pot.",
    "While the noodles and potatoes are cooking, heat the butter in a small saucepan over medium heat. When it melts and foams up, add the flour and cook, stirring frequently, for about 5 minutes. Whisk in the milk. Cook, stirring constantly, until the sauce thickens slightly, about 5 minutes. Stir in 1 teaspoon of the salt and pepper to taste.",
    "Add the egg noodles to the pot of potatoes, then pour the sauce over them. Stir in the remaining 1 teaspoon salt, tuna, artichoke hearts, capers, olives, scallions, parsley, and 1/2 cup of the Parmesan cheese. Taste and season with more salt as needed.",
    "Transfer to the baking dish and spread into an even layer. Sprinkle with the remaining 1/4 cup Parmesan cheese. Bake, uncovered, until bubbly, about 25 minutes. Serve warm.",
    "Reprinted with permission from Not Your Mother's Casseroles Revised and Expanded Edition by Faith Durand, copyright (c) 2017. Published by Harvard Common Press."
  ],
  "ingredients": [
    "0",
    "10 ounces wide, dried egg noodles",
    "1 pound small red potatoes, sliced 1/4-inch thick",
    "4 tablespoons (1/2 stick) unsalted butter",
    "1/4 cup all-purpose flour",
    "2 cups milk",
    "2 teaspoons kosher salt, divided",
    "4 (6-ounce) cans olive-oil packed tuna, drained",
    "1 box (9 ounces) frozen artichoke hearts, thawed and halved",
    "3/4 cup capers, rinsed and drained",
    "1/2 cup sliced black olives",
    "4 medium scallions, thinly sliced",
    "1/2 cup finely chopped fresh flat-leaf parsley",
    "3/4 cup finely grated Parmesan cheese, divided"
  ],
  "__v": 1
}