{
  "__v": 1,
  "directions": [
    "0",
    "Slice your eggplant into 1/2\" thick slices. Salt each slice and set it on a paper towel lined plate for ~20 minutes. This will draw all the extra moisture out, allowing it to caramelize nicely on the grill...instead of just steaming.",
    "In the meantime, prepare the couscous according to package directions.",
    "Make a quick vinaigrette by whisking together some olive oil and lemon juice (3 to 1, oil to acid) and adding the garlic, shallots and some salt and pepper with a pinch of herbs. Toss a smidgeon with the chopped tomatoes. Set the rest aside.",
    "Quick note: I used mint because I have plenty in the garden right now...and I had parsley on hand...I also had some oregano that I dried at the end of last season, so I just crumbled it a bit between my fingers to release the oils before I mixed them together. If you have different herbs, feel free to substitute. It'd be great with chives, cilantro or marjoram, as well!",
    "Okay, once the 20 minutes is up, wipe the perspiration from the eggplant slices. Heat a grill or grill pan. Drizzle a little olive oil on the slices and rub it in; sprinkle w/ a little salt and pepper. When the grill is nice and hot, add the eggplant and grill until you have gorgeous, golden grill marks and then flip and do the same on the other side.",
    "Okay, now to decide which way to go with your meal. If you want to plate it up and dazzle your dinner guests...lay one slice of the grilled eggplant in the center of the plate. Pack some of the warm couscous into a 1/4 - 1/3 c. measure (or something like it) and flip it over on top of the slice of eggplant. Top with some of the tomato mixture. Drizzle with a bit of the vinaigrette and artfully arrange the remaining ingredients around the plate.",
    "Or, if you're in a more casual mood, simply cube the grilled eggplant and toss all the ingredients together for a tasty salad!",
    "Near East brand Toasted Pinenut Couscous has a pretty short \"ingredient\" list...which is good in my book. It contains couscous, toasted pine nuts, autolyzed yeast extract, salt, dried onions, dried garlic, natural flavor, dried leeks, olive oil, dried mushrooms, soy protein, and spices (plus tocopherols for freshness). 12 things...not bad.",
    "Near East has many great varieties which you can find at their site along with recipes on ways to use their products...if you prefer not to go the way of the barbarian which I personally find a bit endearing. Thanks Near East for the opportunity to try your new variety of couscous.",
    "*In the interest of full disclosure, I wanted to make sure you knew that Near East sent me this product FREE (jealous!?) to sample. I promise you they didn't influence my opinion in any way, though...my opinion and thoughts are all mine, baby."
  ],
  "firstAdded": "2014-08-16T22:24:32.045000",
  "hash": "0b291ad1854b22a974a61b4d1b100527c702e2eb",
  "href": "http://www.girlichef.com/2010/06/couscous-ultimate-fast-food.html",
  "image": "http://4.bp.blogspot.com/_5bfRWo-Fpao/TBV9J_cZFaI/AAAAAAAAEt0/yBLI_Hz7Cj8/s640/plated1.jpg",
  "ingredients": [
    "0",
    "One large eggplant",
    "2 ripe tomatoes, seeded & diced",
    "1 (5.6 oz) box Near East brand Toasted Pine Nut Couscous",
    "~1/2 c. Pine Nuts, toasted",
    "Olive oil",
    "salt & freshly ground pepper",
    "fresh mint, parsley and oregano- chopped or chiffonade",
    "juice of a lemon",
    "1 clove garlic, minced",
    "1 small shallot, minced",
    "fresh cheese of some sort, preferably something tangy"
  ],
  "keywords": [
    "eggplant",
    "tomatoes",
    "seeded",
    "box",
    "near",
    "east",
    "brand",
    "pine",
    "nut",
    "couscous",
    "nuts",
    "olive",
    "oil",
    "salt",
    "pepper",
    "mint",
    "parsley",
    "oregano",
    "chiffonade",
    "juice",
    "lemon",
    "clove",
    "garlic",
    "shallot",
    "cheese",
    "sort",
    "preferably",
    "tangy"
  ],
  "title": "Grilled Eggplant W/ Couscous",
  "users": [
    null
  ]
}