{
  "hash": "c86c76ed83f51333afb08757714a94db0f67b8de",
  "title": "Chile Colorado",
  "image": "https://thedomesticatedman.files.wordpress.com/2017/05/img_1419.jpg?w=800",
  "href": "https://thedomesticman.com/2015/04/28/chile-colorado/",
  "extension": "Chrome",
  "firstAdded": "2017-07-10T20:36:19.294000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a stockpot or dutch oven, bring the chicken broth to a boil. As the broth heats, tear the chili peppers into large pieces and place them in a large bowl; once the broth is boiling, add it to the bowl of peppers. Loosely cover with a towel and steep for 20 minutes to soften the peppers. Rinse out the dutch oven.",
    "About 10 minutes before the peppers are softened, prepare the meat and aromatics. Toss the beef with the flour, salt, and pepper. In the dutch oven, heat the oil over med/high heat until shimmering, about 1 minute. Add the beef pieces and brown, about 5 minutes altogether, turning occasionally (brown in batches if needed to keep the beef from overcrowding). Remove the beef and set aside, then reduce heat to medium and add the onions. Sauté until softened, about 5 minutes, stirring occasionally.",
    "As the onions soften, blend the sauce. Pour the reconstituted peppers, chicken broth, and jalapeño into a blender and blend until smooth, then set aside.",
    "Once the onions are soft, add the garlic, cumin, and oregano. Sauté until aromatic, about 30 seconds, then return the beef (and its accumulated juices) to the dutch oven. Through a strainer, pour the sauce into the dutch oven. Discard the solids that accumulate in the strainer (see the picture below). Bring to a simmer, then cover and reduce heat to low. Simmer until the beef is tender, about 45 minutes.",
    "When the beef is ready, uncover and add the lime juice and taste; add salt and/or pepper if needed. Increase the heat to medium and allow to simmer uncovered until slightly thickened, about 5-10 minutes. If you want to add more spice to the dish, now would be a good time to add a hot sauce of your choice, like Chipotle Tabasco sauce. Serve with whatever you’d like, but you can’t go wrong with rice, radishes, peppers, cilantro, and lime wedges. Or maybe some grilled cactus?"
  ],
  "ingredients": [
    "0",
    "4 cups chicken broth",
    "6 dried large red chili peppers (New Mexico, Guajillo, or Anaheim), stems removed and seeded",
    "3 dried Ancho chili peppers, stems removed and seeded",
    "2 lbs beef stew meat",
    "1 tbsp white rice flour (coconut flour okay)",
    "1/2 tsp salt, more to taste",
    "1/4 tsp pepper, more to taste",
    "2 tbsp olive oil or ghee",
    "1/2 medium white onion, chopped",
    "1 jalapeño pepper, seeded and coarsely chopped",
    "6 cloves garlic, minced",
    "2 tsp ground cumin",
    "2 tsp dried oregano",
    "juice of 1/2 lime (1 tbsp)",
    "To serve (optional):",
    "Mexican Rice",
    "sliced radishes",
    "sliced jalapeño peppers",
    "cilantro leaves",
    "lime wedges"
  ],
  "__v": 1
}