{
  "hash": "b3d124025164b281d69d9f3bfce77ecfa9155bcc",
  "title": "Ribolita",
  "image": "",
  "href": "http://www.itv.com/ginositalianescape/recipes/recipe-tuscan-vegetable-cannellini-bean-and-bread-soup",
  "extension": "Chrome",
  "firstAdded": "2016-11-14T21:39:10.281000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "If using the sausages, heat 2 tablespoons of the olive oil in a large frying pan. Add the sausages and fry for about 12-15 minutes, turning frequently until browned and cooked through. Set aside. When cool, cut into slices.",
    "Heat the remaining 2 tablespoons of oil in a large saucepan over a medium heat. Add the onions, garlic, carrots,celery and potato, then the fennel, bay leaf and chilli flakes. Reduce the heat and cover, leaving the lid slightly ajar. Cook gently for 15-20 minutes or until softened but not brown, stirring occasionally.",
    "Add the fresh and tinned tomatoes.Increase the heat and bring to a simmer. Meanwhile, put the bread in a medium bowl and pour over 200ml of the stock. Leave until the bread soaks up the stock(about two minutes).",
    "Add the beans and the remaining stock to the pan and bring to the boil. Stir in the kale. Reduce the heat and simmer for about 30 minutes.",
    "Season with salt and pepper and add the extra virgin olive oil. Stir in the sausage, if using, heat through and then serve."
  ],
  "ingredients": [
    "0",
    "4 tablespoons olive oil",
    "300g Italian pork sausages(optional)",
    "2 small red onions, peeled and chopped",
    "3 garlic cloves, peeled and chopped",
    "2 carrots, peeled and chopped",
    "3 celery sticks, chopped",
    "1 potato, peeled and cut into 5mm cubes",
    "Pinch of fennel seeds, crushed",
    "1 bay leaf",
    "Pinch of dried chilli flakes",
    "2 fresh plum tomatoes, diced",
    "1x300g tin of plum tomatoes",
    "700ml hot vegetable stock",
    "1x400g tin of cannellini beans, rinsed and drained",
    "300g kale, leaves and stalks finely sliced",
    "6 tablespoons extra virgin olive oil",
    "Sea salt and freshly ground black pepper"
  ],
  "__v": 3
}