{
  "__v": 1,
  "directions": [
    "0",
    "Directions",
    "Bring a large pot of salted water to a boil. Cook the pasta according to the package directions.",
    "Meanwhile, add the oil and butter to a large skillet over medium-high heat and melt the butter. Add the garlic and onions and saute until starting to soften, 2 to 3 minutes. Add the chopped red peppers and cook until hot, 2 to 3 minutes.",
    "Carefully transfer the contents of the skillet to a food processor or blender. Put on the lid and puree the pepper mixture until totally blended (there will still be some texture to the peppers).",
    "Pour the pepper puree back into the skillet. Add the broth, 1/2 teaspoon salt and some pepper, and stir until heated. Splash in the cream and stir to combine. Add the parsley and basil and stir to combine. Taste and adjust the seasoning if you need to.",
    "Drain the pasta and add it to the skillet. Add the Parmesan, and then stir it together to coat the pasta.",
    "Serve in bowls with extra Parmesan and a sprinkling of parsley and basil on top."
  ],
  "firstAdded": "2014-09-27T01:46:30.178000",
  "hash": "7a8c6852081bcc3d7a413223c2b0edc8ec54a1e6",
  "href": "http://www.foodnetwork.com/recipes/ree-drummond/quick-and-easy-roasted-red-pepper-pasta.html",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2013/9/17/0/WU0607H_Roasted-Red-Pepper-Pasta_s4x3.jpg.rend.sni18col.jpeg",
  "ingredients": [
    "0",
    "Salt",
    "1 pound pasta of your choice (I prefer short ones like rigatoni, penne, etc.)",
    "1 tablespoon extra-virgin olive oil",
    "2 tablespoons butter",
    "3 cloves garlic, minced",
    "1/2 large onion, finely diced",
    "One 16-ounce jar roasted red peppers, drained and roughly chopped",
    "1 cup vegetable or chicken broth",
    "Freshly ground black pepper",
    "1/4 cup heavy cream",
    "2 tablespoons finely minced fresh parsley, plus more for serving",
    "Several leaves fresh basil, chopped, plus more for serving",
    "1/2 cup Parmesan shavings, plus more for serving"
  ],
  "keywords": [
    "salt",
    "pasta",
    "prefer",
    "short",
    "ones",
    "rigatoni",
    "penne",
    "extravirgin",
    "olive",
    "oil",
    "butter",
    "garlic",
    "onion",
    "jar",
    "roasted",
    "red",
    "peppers",
    "roughly",
    "chicken",
    "broth",
    "black",
    "pepper",
    "cream",
    "parsley",
    "leaves",
    "basil",
    "parmesan",
    "shavings"
  ],
  "title": "Quick and Easy Roasted Red Pepper Pasta",
  "users": [
    null
  ]
}