{
  "__v": 1,
  "directions": [
    "0",
    "In a small bowl, combine the bread crumbs and butter and set aside. Lightly grease a 9X13-inch baking dish and set aside.",
    "Preheat the oven to 400 degrees and make sure the oven rack is placed in the middle of the oven. In a large pot, bring the water for the pasta to a boil. Stir in one tablespoon salt and the broccoli. The broccoli cooks quickly so stay close! Cook the broccoli for 1 minute, until it is bright green. Quickly remove the broccoli with a slotted spoon to a plate. Return the water to a boil and add the pasta and cook until al dente, about 1-2 minutes less than how you would eat it normally (it will cook a bit more in the oven while baking). Drain the pasta in a colander and toss with 1 tablespoon olive oil. Leave it in the colander and set it aside.",
    "Wipe the pot dry. Add the remaining 1 tablespoon oil and return to medium heat until shimmering. Add the onion and cook until softened and beginning to brown, about 5 minutes. Stir in the garlic and thyme; cook until fragrant, about 30 seconds, stirring constantly. Add the flour, salt and pepper, and cook, stirring constantly, until golden, about 1 minute. Slowly whisk in the broth and cream; bring to a simmer, whisking often. Add the chicken and cook, stirring occasionally, until cooked through, about 6-7 minutes. Stir in the sun-dried tomatoes and smoked mozzarella.",
    "Add the cooked pasta and broccoli to the sauce; stir to combine. Transfer the pasta mixture to the prepared baking dish and sprinkle with the bread crumb topping. Bake until the casserole is bubbling and the crumbs are lightly browned, about 15 minutes. Serve immediately."
  ],
  "firstAdded": "2014-07-20T19:12:42.749000",
  "hash": "d51ba2656802a0762284d5549390e2fb32c277fc",
  "href": "http://www.keyingredient.com/recipes/177053119/baked-penne-with-chicken-broccoli-and-smoked-mozzarella/",
  "image": "http://lh4.ggpht.com/slghdsp_HU1NT5pcKREZvB9CM-jjPYaK3jEXuHWfYDIE2-iwwoWGcf1uT-B3Kn_ZeKg0Rn1pb191v3GS1F1AYP0dNA=s450-c",
  "ingredients": [
    "0",
    "¾\tcup bread crumbs (store-bought or make your own)",
    "2\ttablespoons butter, melted",
    "1\tbunch broccoli (about 1 ½ pounds), stalks cut off, florets trimmed into 1-inch pieces",
    "12\tounces penne pasta",
    "2\ttablespoons olive oil",
    "1\tmedium onion, minced",
    "6\tmedium garlic cloves, finely minced or pressed through a garlic press",
    "1\tteaspoon dried thyme",
    "¼\tcup all-purpose flour",
    "2\tcups low-sodium chicken broth",
    "1\tcup heavy cream",
    "1\tteaspoon salt",
    "½\tteaspoon pepper",
    "1\t½ pounds boneless skinless chicken breasts (about 3), trimmed and cut into bite-size pieces",
    "3\tounces smoked mozzarella, shredded",
    "8 ounce jar oil-packed sun-dried tomatoes, drained and chopped into pieces"
  ],
  "keywords": [
    "bread",
    "crumbs",
    "storebought",
    "make",
    "butter",
    "bunch",
    "broccoli",
    "stalks",
    "florets",
    "trimmed",
    "pieces",
    "penne",
    "pasta",
    "olive",
    "oil",
    "medium",
    "onion",
    "pressed",
    "garlic",
    "press",
    "thyme",
    "allpurpose",
    "flour",
    "lowsodium",
    "chicken",
    "broth",
    "cream",
    "salt",
    "pepper",
    "boneless",
    "skinless",
    "breasts",
    "bitesize",
    "smoked",
    "mozzarella",
    "jar",
    "oilpacked",
    "sundried",
    "tomatoes"
  ],
  "title": "Baked Penne with Chicken, Broccoli, and Smoked Mozzarella",
  "users": [
    null
  ]
}