{
  "hash": "83b648110b5ba08df3b821bc31d9dcf62b9d295d",
  "title": "Gluten Free Cinnamon Roll Muffins",
  "image": "https://glutenfreeonashoestring.com/wp-content/uploads/2014/01/Cinnamon-Roll-Cupcake.jpg",
  "href": "https://glutenfreeonashoestring.com/gluten-free-cinnamon-roll-cupcakes/",
  "extension": "Chrome",
  "firstAdded": "2017-11-15T17:49:18.287000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "Preheat your oven to 350°F. Grease or line a standard 12-cup muffin tin, and set it aside.",
    "First, place the swirl/filling ingredients in a small bowl, and mix to combine well. Set the bowl aside.",
    "Make the cupcake batter. In a medium-size bowl, place the flour blend, xanthan gum, baking powder, baking soda and salt, and whisk to combine well. Set the dry ingredients aside. In the bowl of a stand mixer (or a large bowl with a handheld mixer), beat the butter on medium speed until light and fluffy. Add the sugar, and then the eggs and vanilla, and beat on medium speed until well-combined. Add the dry ingredients, alternating with the buttermilk, in 3 parts, beginning and ending with the dry ingredients. The batter will be thick but light and fluffy.",
    "Place half of the cupcake batter in the prepared wells of the muffin tin, and top with half the filling. Swirl the filling around gently in the batter with the end of a long spoon or a toothpick or skewer. Top with the remaining cupcake batter, and then the remaining filling, and swirl again. Shake the tin back and forth until the batter is in an even layer in each muffin well.",
    "Place in the center of the preheated oven and bake for 19 minutes, or until a toothpick inserted in the center comes out clean. Do not over-bake. Remove the cupcakes from the oven and allow to cool in the tin for 10 minutes before transferring to a wire rack to cool completely.",
    "While the cupcakes are cooling, make the glaze. In a small bowl, whisk together the confectioners’ sugar and salt. Add the melted butter and 1/4 teaspoon of the milk, and mix to combine well. You should have a smooth, but very thick paste. Add more milk by the 1/4 teaspoon and mix well until you have a thick, but slowly pourable, glaze. Pour a bit of glaze over each cooled cupcake. Serve immediately. Store any leftovers in an airtight container at room temperature for 2 days, and then wrap tightly and freeze."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "Swirl/Filling",
    "4 tablespoons (48 g) vegetable shortening, melted and cooled",
    "1/4 cup (55 g) packed light brown sugar",
    "1 teaspoon ground cinnamon",
    "Cupcakes",
    "2 cups (280 g) basic gum-free gluten free flour blend (185 grams superfine white rice flour + 61 grams potato starch + 34 grams tapioca starch)",
    "1/2 teaspoon xanthan gum (this must be added – the point is to use a much lower amount of xanthan gum than is in an all purpose gluten free flour blend)",
    "1 teaspoon baking powder",
    "1/2 teaspoon baking soda",
    "1/2 teaspoon kosher salt",
    "8 tablespoons (112 g) unsalted butter, at room temperature",
    "3/4 cup (150 g) granulated sugar",
    "3 eggs (180 g, out of shell) at room temperature, beaten",
    "2 teaspoons pure vanilla extract",
    "2/3 cup (158 ml) low-fat buttermilk, at room temperature",
    "Glaze",
    "3/4 cup (86 g) confectioners’ sugar",
    "1/8 teaspoon kosher salt",
    "1 teaspoon unsalted butter, melted",
    "1/2 to 1 1/2 teaspoons milk (any kind)"
  ],
  "__v": 1
}