{
  "hash": "b44bae1d3c14dfd67814fd37705370ba78d2c276",
  "title": "Greek-Style Leeks with Prunes and Cinnamon",
  "image": "https://images.food52.com/nkbltOipMGj8-5Y41v76VIuZ7ek=/753x502/d555bf1c-87f6-45c3-84eb-b0ca8eef43f0--food52-01-22-13-8042.jpg",
  "href": "https://food52.com/recipes/20270-greek-style-leeks-with-prunes-and-cinnamon",
  "extension": "",
  "firstAdded": "2018-01-28T22:03:25.051000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Clean the leeks, submerging them into water, and then cut them into 1 to 2-inch pieces.",
    "Put the oil in a pan, and once it is hot, add the leeks.",
    "Sauté the leeks by shaking the pan, so that they don't lose their shape.",
    "Once the leeks have begun to soften, add the onion and sauté. Add both sea salt and freshly ground pepper.",
    "After a few minutes, add the tomato juice, the cinnamon stick and about 1/3 cup water.",
    "Bring the mixture to a boil and then, as the liquid begins to evaporate, to a gentle simmer. (The goal is to have most of the liquid evaporate; you may have to turn the heat up to achieve this. However, this will also help the leeks to soften).",
    "Once the liquid has almost evaporated, add the prunes and shake the pan again.",
    "The dish is ready when the leeks and prunes have both become soft and the olive oil and tomato juice have evaporated (following the advice of my boyfriend's mother, I put the leeks in the oven at 325°F for about 10-12 minutes to finish them off).",
    "Remove from the oven and adjust the seasoning, adding more salt and pepper if necessary. Prepare to fall in love with leeks -- if you haven't already."
  ],
  "ingredients": [
    "0",
    "8 Medium-sized leeks, white and light green parts only, cleaned and rinsed",
    "1/4 cup olive oil",
    "1 small onion chopped",
    "8 ounces tomato juice (a small can of diced tomatoes, with juice, also works nicely)",
    "1 cinnamon stick",
    "2/3 cup dried prunes (pits removed)",
    "Sea salt and freshly ground pepper, to taste"
  ],
  "__v": 1
}