{
  "hash": "8754b5725fd1eaaf1b1969e80d138bb6514a0970",
  "title": "tzatziki sauce",
  "image": "https://www.themediterraneandish.com/wp-content/uploads/2016/06/Tzatziki-Sauce-Recipe-11-150x150.jpg",
  "href": "https://www.themediterraneandish.com/tzatziki-sauce-recipe/",
  "extension": "",
  "firstAdded": "2018-05-05T19:57:03.650000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prep the cucumber. In a food processor, grate the cucumbers. Toss with 1/2 tsp kosher salt. Transfer to a fine mesh strainer over a deep bowl to drain. Spoon the grated cucumber into a cheese cloth or a double thickness napkin and squeeze dry. Set aside briefly.",
    "Make the garlic paste. Clean and dry the food processor. Place the garlic cloves in the food processor. Add the remaining 1/2 tsp salt and the vinegar. Turn the machine on and stream the olive oil in through the feed tube, and let the machine run until it pushes the garlic to one side. Stop the machine, and scrape down the sides then run the processor again. Do this for five times or so until the garlic turns into a wet, mushy paste.",
    "Combine and chill. Add the cucumber and garlic paste to a large bowl. Stir in the yogurt and white pepper. Combine thoroughly, sweeping the sides and the bottom of the bowl so the garlic paste gets evenly incorporated. Cover tightly and refrigerate for at least 2 hours.",
    "When ready to serve, stir the tzatziki sauce to refresh and transfer to serving bowls and drizzle a a generous amount of extra virgin olive oil on top. Add a side of warm pita bread and your favorite sliced vegetables. Enjoy!"
  ],
  "ingredients": [
    "0",
    "3/4 English cucumber, partially peeled (striped) and sliced",
    "1 tsp kosher salt, divided",
    "1/2 medium head garlic, about 5 garlic cloves, peeled",
    "1 tsp white vinegar",
    "1 tbsp extra virgin olive oil",
    "2 cups whole milk or 2 % Greek yogurt",
    "1/4 tsp ground white pepper",
    "Warm pita bread for serving",
    "Sliced vegetables for serving"
  ],
  "__v": 1
}