{
  "hash": "6e345fd53b2ffcd7a62fd1b7ffa83cde7850d07e",
  "title": "Chicken Parm Roll-Ups",
  "image": "http://del.h-cdn.co/assets/16/42/640x959/gallery-1476801569-delish-chicken-parm-roll-ups-pin-1.jpg",
  "href": "http://www.delish.com/cooking/recipe-ideas/recipes/a49706/chicken-parm-lasagna-roll-ups-recipe/?zoomable",
  "extension": "Chrome",
  "firstAdded": "2017-04-06T22:00:14.563000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "Preheat oven to 350 degrees F. Lay cooked lasagna noodles flat, in an even layer, on a greased baking sheet.",
    "Bread chicken. Season both sides of chicken with salt and pepper. Put flour and breadcrumbs in two separate medium bowls. Whisk together two eggs in a third separate bowl. Working in batches, dredge chicken in the flour then dip in eggs. Toss in breadcrumbs for the final dredge.",
    "In a large skillet over medium-high heat, heat oil. Add chicken and cook until golden-brown and cooked through, about 6 minutes per side. Transfer to a cutting board and cut into small bite-size pieces, about 1/2” cubes.",
    "Meanwhile, make filling. Whisk together ricotta, remaining egg, garlic powder and 1/2 cup Parmesan. Spread ricotta mixture onto each lasagna noodle, then spoon marinara sauce over the ricotta. Top with cooked chicken and mozzarella then roll up tightly.",
    "In a large deep baking dish, spoon a layer of marinara on bottom of dish. Add the roll-ups and spoon more sauce onto each roll-up. Sprinkle more mozzarella and Parmesan over each roll up. Bake until bubbly and melted, about 20 minutes",
    "Let cool 10 minutes, then garnish with parsley.",
    "PIN FOR LATER"
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1 c. all-purpose flour",
    "3 large eggs, divided",
    "2 c. Italian or panko breadcrumbs",
    "1 lb. boneless skinless chicken breasts, pounded thin",
    "kosher salt",
    "Freshly ground black pepper",
    "2 tbsp. extra-virgin olive oil",
    "2 c. marinara sauce",
    "8 cooked lasagna noodles",
    "1 15- oz. container ricotta",
    "3/4 tsp. garlic powder",
    "1 c. shredded mozzarella",
    "1 c. shredded Parmesan",
    "1 tbsp. parsley, for garnish"
  ],
  "__v": 1
}