{
  "hash": "018b1441cf9b13b3e4c4d9f5b1299f5c834af792",
  "title": "Instant Pot Lemon Chicken",
  "image": "https://i2.wp.com/greenhealthycooking.com/wp-content/uploads/2019/01/Instant-Pot-Lemon-Chicken-3.jpg",
  "href": "https://greenhealthycooking.com/instant-pot-lemon-chicken/",
  "extension": "Firefox",
  "firstAdded": "2020-05-07T20:04:25.550000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Add the zest of the lemon, lemon juice, olive oil, honey, garlic, and thyme (if using) to a measuring cup and add sea salt and pepper to taste.",
    "Then add just enough chicken broth to the measuring cup until you reach exactly 1 cup (if using a 6 quart). (If using an 8-quart I recommend doubling the recipe or using the pot in pot method).",
    "Add sauce to the bottom of your Instant Pot, then add sliced onion and halved baby potatoes and then place chicken thighs on top in one layer.",
    "Put on the lid and turn the valve to the sealing position and set the Instant Pot to 15 minutes on high pressure.",
    "After the 15 minutes let pressure release naturally.",
    "Once the safety pin dropped, open the pot and remove the chicken thighs and put them on a baking sheet under the broiler for 3-5 minutes or until the skin is nice and brown and crisp.",
    "In the meantime, add asparagus to the instant pot, put on the lid and seal it, and depending on the thickness of the asparagus \"steam\" it for 1-2 minutes and manually release the pressure.",
    "You can now serve everything with the liquid sauce OR you can create a more gravy-like sauce by adding 1 Tbsp corn starch and 1 Tbsp cold water to a small bowl and whisk until smooth. Then add slurry to the sauce in the instant pot, hit the soup or saute button and bring the sauce to a boil while constantly stirring or whisking. Within a couple of minutes, the sauce will thicken up. Serve over chicken and potatoes."
  ],
  "ingredients": [
    "0",
    "1 lemon",
    "4 chopped cloves garlic",
    "2 Tbsp olive oil",
    "2 Tbsp honey",
    "sea salt",
    "pepper",
    "1/2 Tbsp fresh thyme leaves (optional but recommended)",
    "3/4 cup chicken broth",
    "1 sliced red onion",
    "1-1.5 lbs halved baby potatoes (or new potatoes) important! NO OTHER potatoes",
    "4 large bone-in skin-on chicken thighs",
    "1 bunch asparagus",
    "1 Tbsp corn starch"
  ],
  "__v": 1
}