{
  "hash": "25363a3b14f512ee5721501dc2cd1911011b34aa",
  "title": "Slow-Cooker Beef Stroganoff",
  "image": "//d3cizcpymoenau.cloudfront.net/images/legacy/30633/detail_CVR_SFS_CCON08_-030609_277782.jpg",
  "href": "https://www.cookscountry.com/recipes/4460-slow-cooker-beef-stroganoff",
  "extension": "Chrome",
  "firstAdded": "2016-09-25T14:46:20.974000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine ½ cup broth and porcini in bowl and microwave until steamy and mushrooms have softened, about 1 minute. Line fine-mesh strainer with one paper towel and strain porcini, reserving liquid. Chop porcini fine and set aside.",
    "Heat oil in large skillet over medium-high heat until shimmering. Cook onions and tomato paste, stirring frequently, until lightly browned, 7 to 10 minutes. Stir in wine, soy sauce, remaining broth, chopped porcini, and reserved porcini liquid, scraping up any browned bits with wooden spoon. Bring broth mixture to boil, then transfer to slow cooker. Add beef and white mushrooms to slow cooker, cover, and cook on high until meat is tender, 6 to 7 hours (or cook on low for 9 to 10 hours).",
    "Set slow cooker to high, if necessary. Skim fat from surface. Transfer 2 cups sauce from slow cooker to large bowl and whisk in flour. Stir flour mixture into slow cooker and cook, covered, until sauce thickens, about 15 minutes. Stir in sour cream and dill and season with salt and pepper. Serve."
  ],
  "ingredients": [
    "0",
    "1 1/2",
    "cups low-sodium beef broth",
    "1/4",
    "cup dried porcini mushrooms, rinsed and patted dry",
    "2",
    "tablespoons vegetable oil",
    "2",
    "onions, chopped fine",
    "2",
    "tablespoons tomato paste",
    "1/2",
    "cup white wine",
    "1/3",
    "cup soy sauce",
    "4",
    "pounds boneless beef chuck stew meat cut into 1 1/2-inch pieces (see note)",
    "1",
    "pound white mushrooms, cleaned and quartered",
    "6",
    "tablespoons all-purpose flour",
    "1 1/2",
    "cups sour cream",
    "2",
    "tablespoons chopped fresh dill leaves",
    "Salt and pepper"
  ],
  "__v": 1
}