{
  "hash": "ab94f7f0a051f99ccf7acbc7703421f69f02ec3f",
  "title": "8 TIPS FOR MAKING THE PERFECT CAKE POP",
  "image": "https://homemakerchic.files.wordpress.com/2012/08/lightly-tap-cake-pops-homemakerchic-com.jpg?w=624",
  "href": "https://homemakerchic.com/2012/08/24/how-to-make-fool-proof-cake-pops/",
  "extension": "Chrome",
  "firstAdded": "2016-12-07T07:21:39.460000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "TIP 1: GREASE AND FLOUR THE PAN.",
    "Definitely grease and flour the cake pop pan before you pour the batter. This will help the cake balls pop out easily. You want perfect little cake balls, not ones that are all mangled from you trying to pry them out with a knife. Do not skip this step, trust me!",
    "TIP 2: CONSIDER YOUR BATTER",
    "Use a batter color that contrasts with your candy coating. This gives a really nice effect when your guests bite into the pops. I used red velvet batter to match the hot pink candy coating. Also, the recipe I used called for 1/3 cup oil and 2 eggs. I adjusted it by only adding 1/4 cup oil and 3 eggs. This made a more firm cake ball that held up better on the sticks. One cake mix made 60 pops exactly.",
    "TIP 3: FULL CUPS MAKE FULL POPS",
    "Fill the bottom cups completely full. I know with cupcakes and such you might be used to filling the pan only 2/3 of the way full but that is not the case with these pops. You want the pops to rise and fill the top half completely so you end up with a nice round ball. If you fill them too shallow you will end up with lop-sided pops. Bake the pops for about 15-18 minutes.",
    "TIP 4: LET THEM COOL",
    "After you have baked the pops, let the cool COMPLETELY before attempting to remove them from the pan. Don’t even take the top pan off. Just leave them as they are and let them cool in the fridge for about 20 minutes. This will save you from having them split in half when you try to open the pan.",
    "Once the pops have cooled, gently remove them from the pan and place them all in a bowl or on a plate. You will notice that they have a slight edge to them.",
    "TIP 5: SHAPE THE POPS",
    "You’ll want to gently cut off the edges using a serrated knife so the balls are perfectly round. Don’t cut too deep, just slide your knife gently around the circumference of each ball, shaving off the excess cake.",
    "Now that the cake balls are prepared, its time to decorate!",
    "TIP 6: USE SHORTENING",
    "Add PLENTY of shortening to your melted candy. I added about 6-7 teaspoons for one package of candy. If you add more candy, add more shortening. You want a nice thin candy coating. If the coating is too thick it will be heavy and the pops are more likely to slide off the sticks. Also ensure that your candy stays hot and melted. If it begins to thicken it will cause problems. If you are using a double boiler like I am (two pyrex measuring cups) be sure to keep freshly boiled water on hand and refresh the water about every five minutes. Another option is to invest in a candy melter available at Bed Bath & Beyond or Michael’s.",
    "TIP 7: PREPARE THE STICKS",
    "Poke holes in the pops using the stick, then drop a little candy into the hole. Dip the stick into the candy and then back into the hole you created. This will give you double glue. It really helps! Let the candy and sticks cool and harden before moving on. I like to use a styrofoam piece to hold them.",
    "TIP 8: GET IN AND GET OUT",
    "And now for the moment of truth. Dipping the pops. If you have done all the previous steps correctly you should be able to dip the pops successfully without having them slide into the candy. I was so nervous trying it this way, but it really worked! Out of 60 pops I only had 2 fall into the candy, and that was because I had allowed the candy to cool and thicken.",
    "You can do this! Don’t swirl around. Just get in a get out. Make sure that you have enough candy to completely submerge the pops without hitting the bottom. You may need to add more candy after dipping several pops. I promise it will work if you follow these tips. Look at this picture. That is a real cake pop dipped all the way into the candy! Gently tap the pop on the edge of the bowl until no more big blops of candy come off. Spin and tap. Don’t do this for too long, or too hard. If you knock off too much candy you will have spots where the cake shows through. Just a few taps should work."
  ],
  "ingredients": [
    "0",
    "As many of you know I get asked to make cake pops for various events. After having some major pop catastrophes and trying to make the best of the rolled cake pop method, I knew there just had to be a better way.",
    "I had originally thought if hand-rolled pops were good enough for Starbucks then they must be easy enough to make. Wrong. Though I did find ways to make it slightly more successful, my cake pop grave yard was growing with sad little cake babies that had bitten the dust and slid off sticks into the candy, while drying, after being decorated… you name a point in the process and I had pops sliding off sticks. Plus, some people didn’t care for the extreme sweetness that came from the additional frosting. The rolled method really has the texture of cake batter rather than actual cake. The softness was part of the problem. I knew I needed something more firm to hold up on the stick. So when I was asked to do the cake pops for my sweet friend Kelly’s baby shower, I knew I needed to find a solution."
  ],
  "__v": 1
}