{
  "hash": "f84e6819628758fa16318d9acbb274f914a6b5f5",
  "title": "Brewed Awakening Rib Roast",
  "image": "//food.fnr.sndimg.com/content/dam/images/food/fullset/2010/12/17/0/RE0809H_brewed-awakening-rib-roast_s4x3.jpg.rend.hgtvcom.616.462.suffix/1371595071546.jpeg",
  "href": "https://www.foodnetwork.com/recipes/sunny-anderson/brewed-awakening-rib-roast-recipe-1922606",
  "extension": "Chrome",
  "firstAdded": "2018-09-08T15:26:34.762000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the brine: In a large bowl, add the water, salt, and coffee. Stir to dissolve the salt and add the rib roast. If the liquid does not cover all of the meat, flip the roast halfway through the marinating time. Or, consider pouring the marinade into a large plastic bag, adding the rib roast, and then sealing tightly so that the roast is completely surrounded by the brine. Refrigerate for 8 hours or overnight.",
    "Preheat the oven to 325 degrees F.",
    "For the rub: In a small bowl, mix together the brown sugar, sage, paprika, parsley, garlic powder, white pepper, bread crumbs, coffee grounds, salt, and a nice grind or two of freshly ground black pepper.",
    "Remove the roast from the refrigerator and discard the brining liquid. Pat the roast dry with a paper towel. Using your hands, coat the roast on all sides with the rub, gently massaging it into the flesh. Let it rest on the counter to come to room temperature, about 1 hour.",
    "Place in a roasting pan and put it in the oven. Cook until medium-rare, 125 degrees F, about 1 hour and 40 minutes. Remove from the oven and cover lightly with aluminum foil while the meat rests, 15 minutes. Slice between the ribs and serve."
  ],
  "ingredients": [
    "0",
    "Brine:",
    "4 cups warm water",
    "1/2 cup kosher salt",
    "4 cups brewed French roast coffee",
    "1 standing rib roast, 3-bones, about 6 pounds",
    "Rub:",
    "1/4 cup dark brown sugar",
    "1 1/2 teaspoons ground sage",
    "1 1/2 teaspoons Hungarian paprika",
    "2 tablespoons chopped fresh parsley",
    "1 1/2 teaspoons garlic powder",
    "1/2 teaspoon ground white pepper",
    "1/4 cup plain bread crumbs",
    "1/4 cup freshly ground French roast coffee, or espresso",
    "1 1/2 teaspoons kosher salt",
    "Freshly ground black pepper"
  ],
  "__v": 1
}