{
  "hash": "626c1395b5af3f24bebd0f7b14e760ac68ca9174",
  "title": "Kremówka po mojemu – tania, szybka, najprostsza (baz jajek)",
  "image": "https://dysk.onet.pl/api/manager/?thumbnail&link=78R7R&id=9deb36545ab68486642383b642f69496&size=F",
  "href": "http://szczypta-slodyczy.blog.pl/2016/09/14/kremowkapo-mojemu-tania-szybka-najprostsza-baz-jajek/",
  "extension": "",
  "firstAdded": "2016-09-17T11:41:24.747000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Masa budyniowa",
    "5 szklanek mleka pełnotłustego",
    "3/4 szklanki cukru",
    "2 1/2 opakowania budyniu waniliowego",
    "2 czubate łyżki maki pszennej",
    "3 żółtka (opcjonalnie)",
    "Szklankę mleka odstawiamy i rozprowadzamy w nim mąkę, budynie, cukier oraz cukier (i ewentualnie żółtka). Resztę przelewamy do rondla i gotujemy. Gdy całość zawre wlewamy zimne mleko do gorącego i energicznie mieszamy. W razie potrzeby budyń słodzimy. Na dnie blaszki umieszczamy jeden blat ciasta, zalewamy gorącym budyniem i przykrywamy drugim zanim utworzy się kożuch. Ciasto studzimy, a przed pokrojeniem możemy jeszcze włożyć je do lodówki. Przed podaniem obficie posypujemy cukrem pudrem."
  ],
  "ingredients": [
    "0",
    "Ciasto",
    "250 g twarożku",
    "1 łyżeczka octu jabłkowego (opcjonalnie)",
    "1 łyżeczka ekstraktu waniliowego",
    "łyżeczka cukru wanilinowego",
    "200 g masła",
    "szczypta soli",
    "400 g mąki pszennej",
    "Wszystko poza mąką rozgniatamy w misce widelcem. do masy dodajemy stopniowo maki i wyrabiamy elastyczne ciasto. Wkładamy na godzinę do lodówki. Ciasto dzielimy an dwie równe części i cienko wałkujemy na dwa placki (prostokąty min 30 – 40cm) Nierówne brzegi przed upieczeniem przycinamy tak, aby placki miały takie same wymiary. Lepiej piec je w nieco większej formie niż w tej w której planujemy je składać, ponieważ nieco się skurczą. Piekarnik nagrzewamy do 200 stopni pieczemy do zrumienienia (około 20 – 25 minut). Studzimy."
  ],
  "__v": 1
}