{
  "hash": "4f865d62adaa27e63733421012c5a921d8782472",
  "title": "Ultimate Keto Buns",
  "image": "http://ketodietapp.com/Blog/image.axd?picture=%2f2014%2f12%2fUltimateKetoBuns11ed.jpg",
  "href": "http://ketodietapp.com/Blog/post/2014/11/12/Ultimate-Keto-Buns",
  "extension": "Chrome",
  "firstAdded": "2015-10-11T00:30:58.650000",
  "users": [
    null
  ],
  "keywords": [
    "makes",
    "buns",
    "dry",
    "flour",
    "almond",
    "meal",
    "husks",
    "psyllium",
    "husk",
    "coconut",
    "flaxmeal",
    "use",
    "instead",
    "garlic",
    "onion",
    "cream",
    "tartar",
    "baking",
    "soda",
    "pink",
    "himalayan",
    "salt",
    "sesame",
    "sunflower",
    "flax",
    "poppy",
    "caraway",
    "seeds",
    "erythritol",
    "wet",
    "egg",
    "whites",
    "eggs",
    "water",
    "boiling",
    "lukewarm",
    "depending",
    "method",
    "intro",
    "tips",
    "substitutions",
    "making",
    "bake",
    "minutes",
    "silicon",
    "loaf",
    "pan",
    "metallic",
    "flaxfree",
    "multipurpose",
    "bread",
    "includes",
    "nutfree",
    "option",
    "keto",
    "include",
    "psylliumfree",
    "nuts",
    "dont",
    "want",
    "havent",
    "tried",
    "twice",
    "reduce"
  ],
  "directions": [
    "0",
    "Instructions",
    "Preheat the oven to 350 F / 175 C. Use scales to measure all the ingredients carefully.",
    "Do not use whole psyllium husks - if you cannot find psyllium husk powder, use a blender or coffee grinder and process until fine. If you get already prepared psyllium husk powder, remember to weigh it before adding to the recipe. I used whole psyllium husks which I grinded myself. Do not use just measure cups - different products have different weights per cup!",
    "Mix all the dry ingredients apart from the sesame seeds in a bowl (almond flour, coconut flour, ground flaxseed, psyllium powder, garlic and onion powder, Erythritol, baking soda, cream of tartar and salt).",
    "Cream of tartar and baking soda act as leavening agents. This is how it works: To get 2 teaspoons of gluten-free baking powder, you need 1/2 a teaspoon of baking soda and 1 teaspoon of cream of tartar. Other options for leavening agents are: gluten and aluminum free baking powder (or baking soda) with apple cider vinegar (4 tsp gluten-free baking powder + 4 tbsp apple cider vinegar per recipe of 10 buns).",
    "Erythritol could be omitted in this recipe - the effect on net carbs is minimum. It works in two ways: It acts as leavening agent and creates the slightly sweet taste burger buns have. Also, if you don't have both onion and garlic powder, you can use just one of them or use freshly mashed garlic cloves (2 cloves per recipe of 5 buns).",
    "Add the egg whites and eggs and process well using a mixer until the dough is thick. Add boiling water and mix until well combined.",
    "The reason you shouldn't use only whole eggs is that the buns wouldn't rise with so many egg yolks in. Don't waste them - use them for making Home-made Mayo, Easy Hollandaise Sauce or Lemon Curd.",
    "Using a spoon, make the buns and place them on a non-stick baking tray or a parchment paper. They will grow in size, so make sure to leave some space between them. You can even use small tart trays. Top each of the buns with sesame seeds (or any other seeds) and press them into the dough, so they don't fall out. Place in the oven and cook for 45-50 minutes.",
    "Remove from the oven, let the tray cool down and place the buns on a rack to cool down to room temperature. Store them at room temperature if you plan to use them in the next couple of days or store in the freezer for future use.",
    "Top with butter or cream cheese, burger meat or any topping you like. Enjoy!",
    "Tip: To save time, mix all the dry ingredients ahead and store in a zip-lock bag and add a label with the number of servings. When ready to be baked, just add the wet ingredients!",
    "Suggestions:",
    "If for any reason you can't get this recipe to work, here are some tips that might help. Most of the above tips apply to any recipes using psyllium husk powder:",
    "Make sure you weigh all the ingredients using scales. Even small differences can affect the final result of this recipe.",
    "If your buns appear to have large hollow bubbles inside, it may be due to the psyllium. Make sure you use powder, not whole husks. Otherwise, use a coffee grinder or blender and pulse until fine and powdery.",
    "For a slightly (but not significantly) better result, incorporate the eggs separately. First, whisk the egg whites until they create soft peaks and add cream of tartar used in this recipe. In another bowl, mix the egg yolks and gently fold them into the egg whites. In a separate bowl, mix the dry ingredients and pour in the hot water. Process well using an electric mixer (hand whisk is not as good in this recipe). Add the foamy egg white mixture into the batter and process well. Try not to deflate the batter completely. Form the buns and place in the oven.",
    "If your buns don't rise properly, use only egg whites and omit the egg yolks.",
    "If the final result is too moist, do not reduce the water used in this recipe or the psyllium will clump. Instead, dry the buns in the oven on low, up to 210 F / 100 C for 30-60 minutes. If needed, cut them in half and place in a toaster.",
    "Do not leave the batter outside the oven for too long. Place in the oven as soon as you form the buns.",
    "If your buns change color to slight purple, it's due to the psyllium husk powder. Whenever I use whole husks and grind them at home, they are always perfect, light brown. However, when I use ready-made psyllium husk powder, they look purple, especially the next day. Although they may not look appetising, they are perfectly fine."
  ],
  "ingredients": [
    "0",
    "Ingredients (makes 10 buns):",
    "Dry ingredients:",
    "1 ½ cup almond flour (almond meal) (150 g / 5.3 oz)",
    "⅔ cup psyllium husks - will be powdered, or ⅓ cup psyllium husk powder (40 g / 1.4 oz)",
    "½ cup coconut flour (60 g / 2.1 oz)",
    "½ cup flaxmeal (75 g / 2.6 oz) - or use more almond flour instead",
    "2 tsp garlic powder",
    "2 tsp onion powder",
    "2 tsp cream of tartar",
    "1 tsp baking soda",
    "1 tsp salt (pink Himalayan or sea salt)",
    "5 tbsp sesame seeds (or sunflower, flax, poppy seeds) or 1-2 tbsp caraway seeds",
    "Optional: 2 tbsp Erythritol (20g / 0.7 oz)",
    "Wet ingredients:",
    "6 large egg whites",
    "2 large eggs",
    "2 cups water, boiling or lukewarm depending on the method - see intro (480 ml / 16 fl oz)",
    "Tips & substitutions:",
    "If making a loaf instead of buns, bake for 75 minutes! Do not use a silicon loaf pan - use a metallic one instead.",
    "flax-free, multi-purpose bread, includes a nut-free option.",
    "nut-free keto buns - include flaxmeal",
    "psyllium-free buns - include flaxmeal and nuts.",
    "if you don't want to use coconut flour: Although I haven't tried it, I'd use twice the amount of almond flour or flaxmeal instead of coconut flour (1 cup of almond flour / flaxmeal instead of ½ cup coconut flour). Or you can use the same amount but reduce the water by ~ ½ cup"
  ],
  "__v": 1
}