{
  "hash": "09b9cfc43fb5a8a6e58632decc01a0da572669cb",
  "title": "John Wayne Casserole",
  "image": "http://amandascookin.com/wp-content/uploads/2015/04/John-Wayne-Casserole-step-9-600x450.jpg",
  "href": "http://amandascookin.com/john-wayne-casserole/",
  "extension": "Firefox",
  "firstAdded": "2015-09-19T23:34:11.141000",
  "users": [
    null
  ],
  "keywords": [
    "beef",
    "browned",
    "taco",
    "seasoning",
    "biscuits",
    "sour",
    "cream",
    "mayonnaise",
    "cheddar",
    "cheese",
    "divided",
    "medium",
    "onion",
    "tomatoes",
    "red",
    "bell",
    "pepper",
    "jalapeno",
    "peppers"
  ],
  "directions": [
    "0",
    "Preheat oven to 350 F and spray a 13x9 glass baking dish.",
    "Place biscuits in pan in a single layer and press into the pen, joining them together, pressing the dough halfway up the sides of the pan. Place pan on a baking sheet and bake dough in preheated oven for 15-25 minutes; checking every few minutes after 15. The dough should be very light brown where the edges are just starting to get color. Remove from oven and set aside, leave oven on.",
    "Combine the browned ground beef with the taco seasoning and water, and cook according to packet instructions. Transfer cooked taco meat to a bowl and set aside. Wipe out pan.",
    "Saute remaining onions and bell peppers on the taco meat pan until slightly tender.",
    "In a separate bowl, combine sour cream, mayonnaise, half of the cheddar cheese, and half of onions. Stir well and set aside.",
    "On top of baked biscuit crust, layer ingredients in the following order: taco meat, tomato slices, bell pepper and onion mixture, Jalapeno peppers, sour cream mixture and sprinkle with remaining shredded cheese. Bake uncovered for 30-40 minutes or until edges of dough are lightly browned and cheese is melted."
  ],
  "ingredients": [
    "0",
    "2 pounds ground beef, browned and drained",
    "1 packet taco seasoning",
    "1 16-ounce can large biscuits",
    "½ cup sour cream",
    "½ cup mayonnaise",
    "8 ounces cheddar cheese, shredded and divided",
    "1 medium onion, halved and sliced",
    "2 medium tomatoes, sliced",
    "1 red bell pepper, halved and sliced",
    "1 (4-ounce) can sliced Jalapeno peppers"
  ],
  "__v": 1
}