{
  "hash": "1c884920671f8dab21a9bc28ac801027ce57b4ea",
  "title": "Grilled Cheese Sandwich",
  "image": "https://theproteinchef.co/wp-content/uploads/2015/01/Bodybuilding-Grilled-Cheese-Recipe-810x456.jpg",
  "href": "https://theproteinchef.co/bodybuilding-grilled-cheese-sandwich-recipe-high-protein/?internal_recirc=RFdriver",
  "extension": "",
  "firstAdded": "2017-07-12T03:07:06.635000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Separately cook your Turkey Bacon, Large Egg, and Large Egg Whites however you want to (the goal is to make your eggs fit into your sandwich so try and make them as big as your pieces of bread). Take out your bread and start by spreading 1/2 Tablespoon (7g) Sundried Tomato & Basil Hommus on each piece, then 2 Slices Fat Free Sharp Cheddar Cheese on one piece, 1 Slice Fat Free American Cheese on the other, evenly divide up your Turkey Bacon, and last your cooked Large Egg + Egg Whites on one piece. Close off your sandwich and spread 1/4 Tablespoon Olive Oil on both the top and bottom. Take out a stove top pan or griddle, turn your burner on Medium Heat, and coat it with some non-stick cooking spray. Once your pan or griddle heats up coat the side of your sandwich that’s going down onto the pan with some non-stick cooking spray and cook that side while pressing down until your cheese is melted (usually around 2:00-3:00). Coat the other side with some non-stick cooking spray and repeat until your cheese is melted. Once both sides of cheese are melted your sandwich is done."
  ],
  "ingredients": [
    "0",
    "2 Pieces Bread (I like whole wheat)",
    "2 Slices Fat Free Sharp Cheddar Cheese",
    "1 Slice Fat Free American Cheese",
    "2 Pieces Turkey Bacon",
    "1 Tablespoon (14g) Sundried Tomato & Basil Hommus (1/2 Tablespoon/7g on each piece of bread)",
    "2 Large Egg Whites",
    "1 Large Egg",
    "1/2 Tablespoon Olive Oil (1/4 Tablespoon on each piece of bread)"
  ],
  "__v": 1
}