{
  "hash": "5ce9b4fca6456a9a6351bfc7f1b87403cb460813",
  "title": "Layered Vegetable Torte",
  "image": "",
  "href": "https://cooking.nytimes.com/recipes/1013213-layered-vegetable-torte?em_pos=medium&ref=headline&nl_art=0&te=1&nl=cooking&emc=edit_ck_20200224&campaign_id=58&instance_id=16194&segment_id=21566&user_id=4264688f24592aeeb06433e5d96d7150&regi_id=79859114emc=edit_ck_20200224",
  "extension": "Firefox",
  "firstAdded": "2020-02-25T00:48:10.332000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat oven to 400 degrees. Put a grill pan over medium-high heat, or prepare a grill; the heat should be medium-high, and the rack about 4 inches from flame. Brush eggplant, zucchini and mushrooms lightly with half the oil and sprinkle with salt and pepper; if roasting, grease 2 baking sheets with oil. Roast or grill vegetables on both sides until soft.",
    "Coat bottom and sides of 8-inch springform pan with oil. Layer a third of the eggplant slices into bottom of the pan, then layer in half the zucchini, mushrooms, tomato, garlic and basil, sprinkling each layer with a bit of salt and pepper. Repeat layers until all vegetable are used. Press the top with a spatula or spoon to make the torte as compact as possible. Sprinkle top with Parmesan and bread crumbs, and drizzle with about 1 tablespoon oil.",
    "Bake torte in oven until hot throughout and browned on top, about 30 minutes. Let sit for 5 minutes before removing outer ring of pan, then let cool for another 10 minutes before cutting into wedges."
  ],
  "ingredients": [
    "0",
    "1",
    "large eggplant, cut into 1/4-inch slices",
    "4",
    "medium zucchini or yellow squash, cut into 1/4-inch slices",
    "2",
    "portobello mushrooms, cut into 1/4-inch slices",
    "½",
    "cup extra virgin olive oil, or more as needed",
    "Salt",
    "freshly ground black pepper",
    "2",
    "plum tomatoes, cut into 1/4-inch slices",
    "2",
    "tablespoons minced garlic",
    "¼",
    "cup chopped fresh basil leaves",
    "¼",
    "cup freshly grated Parmesan",
    "½",
    "cup bread crumbs, preferably fresh"
  ],
  "__v": 1
}