{
  "hash": "b04ffd22c50fa85a8cb6fe1e556b46a348c5f616",
  "title": "CHIMICHURRI CARROTS WITH PARMESAN PARSNIP PURÉE",
  "image": "https://i0.wp.com/www.landeeseelandeedo.com/wp-content/uploads/2014/11/Chimichurri-Carrots-with-Parsnip-Puree.jpg?resize=600%2C900&ssl=1",
  "href": "https://www.landeeseelandeedo.com/roasted-chimichurri-carrots-parmesan-parsnip-puree/",
  "extension": "Chrome",
  "firstAdded": "2020-01-29T18:26:46.141000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare the chimichurri: Pulse the parsley, oregano, garlic, red wine vinegar, and red pepper flakes in a food processor or blender until very finely minced. Scrape contents into a bowl and stir in the olive oil. Let stand for 20 minutes. Add salt and pepper (or additional red pepper flakes for more heat) to taste.",
    "Pre-heat oven to 425 F. Place the peeled and trimmed carrots on a rimmed baking sheet. Pour about 3/4 of the chimicurri liquid over the carrots and about 1/4 of the minced chimichurri. Toss generously with your hands so the carrots are completely coated. Arrange into a single layer on the baking sheet, then position on the oven’s middle rack.",
    "Roast the carrots for 25 minutes or until golden and can be pierced with a fork (but not soft, carrots should still have firmness to them al dente style). Don’t worry if you see that the minced chimichurri bits have turned dark during the roasting.",
    "While the carrots are roasting, prepare the pureé: Add the parsnips (already cut into 1/2″ pieces) to a large pot. Cover with cold water and bring to a boil over medium high heat. Cook until pieces are very tender and can easily be pierced through with a fork, about 10 minutes.",
    "Drain the parsnips and let cool for about 5 minutes. Add to a food processor or blender (you may need to work in batches, depending on the size of your equipment) along with vegetable broth and butter. Process until very smooth, adding additional vegetable broth as needed (i.e. desire a thinner consistency). Scrape contents into a bowl and stir in the Parmesan and salt/pepper to taste. Cover and set aside until carrots are done.",
    "Remove carrots from the oven. Spread the purée into an even layer on the bottom of a serving dish. Pick up the carrots from the baking sheet with tongs or a fork so as not to bring over excess liquid. Wipe off any dark bits of unwanted minced chimichurri. Arrange the carrots in a single layer on top of the purée.",
    "Garnish the carrots with the remaining chimichurri (both liquid and minced bits), drizzling evenly across the carrots."
  ],
  "ingredients": [
    "0",
    "{Chimichurri Sauce}",
    "*Barely modified from Michelle Bernstein, Food & Wine",
    "1/2 cup extra virgin olive oil",
    "1/4 cup fresh Italian flat leaf parsley leaves, chopped",
    "2 TBSP fresh oregano leaves",
    "4 cloves garlic, minced",
    "1/2 TSP red pepper flakes",
    "3 TBSP red wine vinegar",
    "Kosher salt, ground pepper to taste",
    "{Parmesan Purée}",
    "*Inspired by Chef Traci Des Jardins, Epicurious",
    "1 lb parsnips, peeled and cut into 1/2″ pieces",
    "1/4 cup vegetable broth",
    "1/2 TBSP unsalted butter",
    "2 TBSP grated Parmesan",
    "Kosher salt, ground pepper to taste",
    "{Additional Ingredients}",
    "2 bunches carrots (about 14 carrots), peeled and ends trimmed"
  ],
  "__v": 1
}