{
  "hash": "0e333749975f5fbde4a181a95905e3b818c55d0b",
  "title": "Meen Gassi (Fish Curry)",
  "image": "https://static01.nyt.com/images/2020/03/04/dining/tr-meen-gassi/merlin_169211904_179ec60d-5d01-4fde-afe0-4417616cf0f0-articleLarge.jpg",
  "href": "https://cooking.nytimes.com/recipes/1020914-meen-gassi-fish-curry",
  "extension": "Firefox",
  "firstAdded": "2020-03-15T18:47:33.494000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Mix together the salt and turmeric, then rub the mixture all over the fish and set aside.",
    "In a small skillet, heat 1 teaspoon ghee over medium. Add the coriander seeds and toast until lightly brown and fragrant, about 2 minutes. Tip into a large mortar and pestle with red chiles and grind to small pieces. Add the coconut a little at a time and smash until no large pieces of chile or coconut are visible and a smooth paste forms. (This texture is worth the effort, as it gives the tangy, hot sauce its richness.) Add the tamarind last and mash to integrate it into the paste.",
    "Choose a large, heavy skillet that will fit all the fish in a single layer. Add the remaining 1 tablespoon ghee and melt over medium-low heat. Add the onion, ginger and green finger chile, and sauté gently until the onion is cooked through and just starting to color, about 10 minutes.",
    "Stir in the prepared coconut paste and 2 cups water, and bring to a boil over medium heat. Add the fish to the skillet skin-side up, reduce the heat to low, and simmer gently until the fish is cooked through, about 8 to 10 minutes depending on thickness, flipping fish halfway through. Spoon the coconut oil on top, and sprinkle with cilantro, if using."
  ],
  "ingredients": [
    "0",
    "1",
    "teaspoon kosher salt",
    "½",
    "teaspoon ground turmeric",
    "4",
    "skin-on fish fillets (about 1 1/2 pounds total), such as striped bass or snapper",
    "1",
    "teaspoon plus 1 tablespoon ghee",
    "2",
    "teaspoons whole coriander seeds",
    "6",
    "dry red chiles, such as chile de árbol",
    "1",
    "cup fresh or frozen grated coconut",
    "1",
    "tablespoon tamarind pulp",
    "1",
    "small yellow onion, finely chopped",
    "1",
    "(1-inch) piece fresh ginger, peeled and finely chopped (about 1 tablespoon)",
    "1",
    "green finger chile (or serrano chile), finely chopped",
    "2",
    "tablespoons coconut oil",
    "Fresh cilantro sprigs, for garnish (optional)"
  ],
  "__v": 1
}