{
  "hash": "14c5dde79ad379c2f10c4c77341a7a928260bfbb",
  "title": "DOUBLE CHOCOLATE CHEESECAKE BROWNIES",
  "image": "https://s3-eu-west-1.amazonaws.com/deliciouslyella/wp-content/uploads/2012/10/19124128/sjkgs1.jpg",
  "href": "https://deliciouslyella.com/double-chocolate-cheesecake-brownies-gluten-free-dairy-free-sugar-free/",
  "extension": "Chrome",
  "firstAdded": "2017-01-04T17:54:00.960000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Start with the brownie layer. Remove the stones from the dates, then place all of the ingredients into a food processor. Blend for 2-3 minutes until the mixture becomes nice and sticky, you still want some little nutty pieces in there though as this creates a deliciously crunchy texture.",
    "Place the brownie mix into a deep baking tray, using a spatula to press it down firmly. Leave this to one side.",
    "To make the cheesecake layer, simply place all the ingredients needed into the food processor (having removed the date stones) and blend until a really creamy, chocolatey custard-like deliciousness forms! This should take around 5 minutes depending on the strength of your processor.",
    "Pour this mixture over the brownie base, you can then sprinkle a few pecan pieces on the top and placing the whole thing in the freezer. Freeze for about an hour or so before serving. At this point it will be set enough to be eaten, but I’d really recommend moving it into the fridge after this time and letting it fully set there for a few hours, over night is best.",
    "Then slice, serve and enjoy. Everyone will adore this. Between five of us we somehow managed to finish all twenty squares in twelve hours. I think that says enough about how delicious they are! I had some very happy flat mates!"
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "For the bottom layer",
    "– 1 cup of pecans",
    "– 1/2 a cup of almonds",
    "– 2 and ½ cups of medjool dates",
    "– 2 tablespoons of raw cacao",
    "For the cheesecake layer:",
    "– 3 avocados",
    "– 1 banana",
    "– 1 cup of dates",
    "– 3 tablespoons of pure maple syrup",
    "– 2 and a 1/2 heaped tablespoons of raw cacao powder",
    "– 2 tablespoons of almond butter"
  ],
  "__v": 2
}