{
  "hash": "e974a5b8bcfd789c2a78e06d4649d7c9b1972a89",
  "title": "Perfect roast chicken",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/390_1_1436872147_lrg.jpg",
  "href": "http://www.jamieoliver.com/recipes/chicken-recipes/perfect-roast-chicken/",
  "extension": "Chrome",
  "firstAdded": "2015-07-30T17:53:09.967000",
  "users": [
    null
  ],
  "keywords": [
    "higherwelfare",
    "chicken",
    "medium",
    "onions",
    "carrots",
    "celery",
    "bulb",
    "garlic",
    "olive",
    "oil",
    "salt",
    "black",
    "pepper",
    "lemon",
    "bunch",
    "thyme",
    "rosemary",
    "bay",
    "sage",
    "mixture"
  ],
  "directions": [
    "0",
    "To prepare your chicken",
    "Take your chicken out of the fridge 30 minutes before it goes into the oven. Preheat your oven to 240°C/475°F/gas 9. There's no need to peel the vegetables – just give them a wash and roughly chop them. Break the garlic bulb into cloves, leaving them unpeeled.",
    "Pile all the veg and garlic into the middle of a large roasting tray and drizzle with olive oil. Drizzle the chicken with olive oil and season well with salt and pepper, rubbing it all over the bird. Carefully prick the lemon all over, using the tip of a sharp knife (if you have a microwave, you could pop the lemon in these for 40 seconds at this point as this will really bring out the flavour). Put the lemon inside the chicken's cavity, with the bunch of herbs.",
    "To cook your chicken",
    "Place the chicken on top of the vegetables in the roasting tray and put it into the preheated oven. Turn the heat down immediately to 200°C/400°F/gas 6 and cook the chicken for 1 hour and 20 minutes. If you're doing roast potatoes and veggies, this is the time to crack on with them – get them into the oven for the last 45 minutes of cooking.",
    "Baste the chicken halfway through cooking and if the veg look dry, add a splash of water to the tray to stop them burning. When cooked, take the tray out of the oven and transfer the chicken to a board to rest for 15 minutes or so. Cover it with a layer of tinfoil and a tea towel and put aside. Now is the time to make your gravy.",
    "To carve your chicken",
    "Remove any string from the chicken and take off the wings (break them up and add to your gravy for mega flavour). Carefully cut down between the leg and the breast. Cut through the joint and pull the leg off.",
    "Repeat on the other side, then cut each leg between the thigh and the drumstick so you end up with four portions of dark meat. Place these on a serving platter. You should now have a clear space to carve the rest of your chicken. Angle the knife along the breastbone and carve one side off, then the other.",
    "When you get down to the fussy bits, just use your fingers to pull all the meat off, and turn the chicken over to get all the tasty, juicy bits from underneath. You should be left with a stripped carcass, and a platter full of lovely meat that you can serve with your piping hot gravy and gorgeous roast veg."
  ],
  "ingredients": [
    "0",
    "1.6 kg higher-welfare chicken",
    "2 medium onions",
    "2 carrots",
    "2 sticks celery",
    "1 bulb garlic",
    "olive oil",
    "sea salt",
    "freshly ground black pepper",
    "1 lemon",
    "1 small bunch fresh thyme, rosemary, bay or sage, or a mixture"
  ],
  "__v": 1
}