{
  "hash": "39062f7fa737cdf7cb6d1e0c9785102c6a2679aa",
  "title": "Faworki luksusowe – chrust, chruściki",
  "image": "http://www.iv.pl/images/02366602819732137518.jpg",
  "href": "http://to-tylko-blog.blog.pl/2015/02/08/faworki-luksusowe-chrust-chrusciki/",
  "extension": "",
  "firstAdded": "2016-09-24T20:54:32.224000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Faworki luksusowe – chrust, chruściki",
    "08 lut",
    "Faworki to, obok pączków, tradycyjny wypiek w czasie karnawału i z okazji tłustego czwartku. Form samych faworków jest kilka – kruche ja chrust, drożdżowe i z ciasta ptysiowego. Ponieważ najbardziej lubię te kruchutkie toteż najczęściej je smażę. Sekretem idealnej ich chrupkości jest dobrze wyrobione i bardzo cienko rozwałkowane ciasto. Stosując się do tych zasad faworki nie mogą się nie udać :) Idealne chrupiące, kruche, przepełnione pęcherzykami powietrza – niebo na talerzu :)",
    "Składniki:",
    "250 g mąki",
    "1 jajko",
    "4 żółtka",
    "3 łyżki rumu",
    "płaska łyżeczka cukru pudru",
    "1-2 łyżki gęstej śmietany",
    "5 g masła",
    "Dodatkowo: tłuszcz do smażenia i cukier puder do oprószenia",
    "Mąkę z cukrem pudrem przesiać do miski, dodać resztę składników – początkowo składniki posiekać nożem a potem zagnieść ręką na jednolitą masę, wtłaczając w nie dużo powietrza. Wyrabiać tak długo aż w środku będą widoczne pęcherzyki powietrza. Wyrobione ciasto podzielić na kilka partii. Każdą z nich bardzo cienko rozwałkować (cieniej niż na pierogi) delikatnie podsypując mąką i kroić radełkiem w 3 cm szerokości paski. Każdy pasek przekroić po skosie w poprzek na 15 cm kawałki, a na środku każdego z nich wzdłuż nakroić otworek i przewijać przez niego jedną końcówkę faworka. Przewinięte faworki przykryć ściereczką żeby nie wysychały. W płaskim rondlu rozgrzać tłuszcz. Gdy na rozgrzany tłuszcz wrzucimy kawałek ciasta a on natychmiast wypłynie od dna na wierzch oznaczać to będzie, że tłuszcz ma idealną temperaturę do smażenia. Wrzucamy do rondla po kilka faworków i smażymy je na złoty kolor z obu stron, odwracając je np. patyczkiem do szaszłyków. Usmażone wyjmujemy na talerz wyłożony ręcznikiem papierowym, następnie układamy na półmisku oprószając je przesiewanym przez sitko cukrem pudrem. Z podanych proporcji wychodzi czubaty talerz chrupiących chruścików."
  ],
  "ingredients": [
    "0",
    "Składniki:",
    "250 g mąki",
    "1 jajko",
    "4 żółtka",
    "3 łyżki rumu",
    "płaska łyżeczka cukru pudru",
    "1-2 łyżki gęstej śmietany",
    "5 g masła"
  ],
  "__v": 1
}