{
  "hash": "a2ce8a3dfc2df8aa98f31d3acb8ca68e934c3640",
  "title": "Paleo \"Corn\" Chips... Pretty Close to the Real Things I'd Say!",
  "image": "http://1.bp.blogspot.com/-2cR1nlMRlh0/Tbyj-HFxmRI/AAAAAAAAAVA/j9UGrEryRWo/s400/cornchips.jpg",
  "href": "http://tastes4life.blogspot.com/2011/05/paleo-corn-chips.html",
  "extension": "Chrome",
  "firstAdded": "2016-02-22T13:26:13.568000",
  "users": [
    null
  ],
  "keywords": [
    "preheat",
    "oven",
    "medium",
    "kumara",
    "potato",
    "parsnips",
    "garlic",
    "red",
    "capsicum",
    "flax",
    "meal",
    "chai",
    "seeds",
    "cumin",
    "smoked",
    "paprika",
    "celtic",
    "salt",
    "olive",
    "oil"
  ],
  "directions": [
    "0",
    "Place your raw diced sweet potato, parsnips, red capsicum, garlic and olive oil in your food processor and blend until into a fine mash.",
    "Now that your raw vegetables are a mash add the rest of your ingredients. Blend in your food processor until well combined.",
    "Your mix will now look like this.",
    "Place a sheet of plastic wrap on your bench top. Ensure it is flat. Place your mix on your plastic wrap topped bench. Wet your hand and spread it out as well as possible. A square shape would be desired. Place another layer of plastic wrap over the top. With a rolling pin softly and evenly roll your \"corn chip dough\" out into a rectangle shape. Your desired thickness would be slightly thicker than your average corn chip.",
    "Mine looked like this.",
    "5. I first removed the top layer of plastic wrap. I then followed by cutting my rectangle shaped corn chip mix in half with a knife (plastic wrap still under). I then greased two large oven cookie trays. I grabbed the first half of my mix by holding on to the plastic wrap. I very carefully flipped it over onto my greased oven tray dough side down and plastic wrap now on the top (like the photo above shows). I removed my plastic wrap at this stage.",
    "6. I then cut my dough into corn chip shapes with a knife on my oven tray. The key is to cut down rather that slice through. I placed my ready cut \"corn chips\" in the oven. I pulled them out after 7 minutes and flipped them over. After that every 3-4 minutes I turned them. I continued this over 20 minutes. (ovens will vary) I then turned my oven down to its lowest temp to dry them out further. This took a further 10 minutes. Remember each oven is different just ensure you have plenty of time during the cooking period to check and turn as needed. My oven isn't fan bake its old. So yours may crisp up faster!"
  ],
  "ingredients": [
    "0",
    "Ingredients...",
    "Pre-heat oven 170c",
    "1 Medium kumara (sweet potato) peeled and diced small",
    "3 Small Parsnips peeled and diced small",
    "4 lg cloves of garlic",
    "1/2 Red Capsicum diced small",
    "1 cup Flax meal",
    "3 tbsp Chai seeds",
    "1 tbsp Cumin seeds",
    "1 tsp Smoked Paprika",
    "1tsp Celtic Sea Salt",
    "2 tbsp Olive Oil"
  ],
  "__v": 1
}