{
  "__v": 5,
  "directions": [
    "0",
    "First make the Tangzhong.",
    "Put the flour and water in a small saucepan, whisk, and heat over medium. Continue to whisk while heating, and when the tangzhong thickens and swirl lines appear, remove from the heat and continue to whisk for another 30 seconds. (The full recipe will make 1 c. Tangzhong, and you only need 1/2 c. for the bread recipe. So you can store the extra Tangzhong in the refrigerator for 2-3 day, or make a half recipe of tangzhong: fill a 1/3 cup measure halfway with bread flour, and use 1/2 c. water.)",
    "Put the milk into a large measuring cup. Add the sweetened red bean paste, and nix together with a fork until smooth and combined.",
    "Add the egg, and beat the egg into the red bean milk until combined.",
    "Place the sugar, salt, and butter (or coconut oil) into the bottom of your bread machine pan. Add the cooled tangzhong and the red bean milk mixture. Scoop the flour on top of the other ingredients, and make a well in the top of the flour. Put the dry yeast into the well, and turn the machine on the “basic dough setting.” (Or layer the ingredients according to your own bread machine instructions. I use a Zojirushi – for this model, you are not supposed to let the yeast touch any wet ingredients when putting the ingredients into the pan. If you are mixing by hand or using a stand mixer with dough hook – it is ok to mix the yeast into the wet ingredients first.)",
    "When the dough is ready, place on a floured counter. (The dough will be very sticky – so use extra flour as needed.)",
    "With your hands, form the dough into a rough rectangle, and divide into 9 equal pieces (for three mini loaves). **If you prefer to make one large loaf instead, divide your dough into 4 equal pieces instead, and follow the same rolling instructions.**",
    "Take one piece of dough, flour both sides, and roll into a rough oval.",
    "Fold both edges inward by 1/3, overlapping the middle.",
    "Roll the folded piece into a rough rectangle. Roll the short edge of the rectangle up, making a rolled tube.",
    "Set aside and repeat for the remaining pieces, until you have 9 rolled tubes.",
    "Grease three mini loaf pans. (I use Pam for baking non-stick spray.) Squash the tubes from the ends towards the center, to make them shorter and fatter, and place 3 of these tubes (seam side down) into each mini loaf pan. Cover with plastic wrap and allow the loaves to rise in a warm place for 1 hour.",
    "Preheat the oven to 335 degrees. Brush the tops of your loaves with egg wash, then sprinkle with black sesame seeds (if desired).",
    "Bake the 3 mini loaves for about 20-22 minutes. (If you are making one large loaf, bake for about 30 minutes.) Remove from the oven, and allow to cool for 5 minutes. Once the pans are cool enough to handle, remove the bread from the pan and allow the loaves to cool completely on a wire rack before slicing or serving."
  ],
  "firstAdded": "2014-06-17T22:25:15.008000",
  "hash": "e23fd47263c1c7142cb08d1b48cab15a1b8fe0fc",
  "href": "http://www.the350degreeoven.com/2013/07/japanese-hawaiian/japanese-azuki-bean-bread-sweet-red-bean-milk-bread/",
  "image": "http://www.the350degreeoven.com/wp-content/uploads/2013/07/DSC_0651-300x198.jpg",
  "ingredients": [
    "0",
    "1. Tangzhong:",
    "1/3 c. bread flour",
    "1 c. water",
    "2. Sweet Red Bean Milk Bread:",
    "Use canned sweetened red bean paste",
    "2 1/2 c. bread flour",
    "2 tsp. active dry yeast",
    "1/2 c. milk",
    "1 egg",
    "4 T. sugar",
    "1/2 tsp. salt",
    "3 T. unsalted butter or coconut oil",
    "3/4 c. sweetened red bean paste",
    "1/2 c. Tangzhong",
    "Eggwash: 1 egg yolk + 1 T. water",
    "Optional: 1 T. black sesame seeds"
  ],
  "keywords": [
    "tangzhong",
    "bread",
    "flour",
    "water",
    "red",
    "bean",
    "milk",
    "use",
    "canned",
    "sweetened",
    "active",
    "dry",
    "yeast",
    "egg",
    "sugar",
    "salt",
    "unsalted",
    "butter",
    "coconut",
    "oil",
    "eggwash",
    "yolk",
    "black",
    "sesame",
    "seeds"
  ],
  "title": "Japanese Azuki Bean Bread (Sweet Red Bean Milk Bread)",
  "users": [
    null
  ]
}