{
  "hash": "0315d2a4f60977c4ca0eed490bbec5d479617376",
  "title": "Pot-roast chicken with hunters’ sauce",
  "image": "",
  "href": "https://www.cooked.com/uk/James-Martin/Quadrille-Publishing/Slow/Slow-one-pots/Pot-roast-chicken-with-hunters-sauce-recipe",
  "extension": "Chrome",
  "firstAdded": "2018-02-08T13:31:35.023000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 170°C. Cut the onion, garlic and bacon into large dice. Place a 3-litre flameproof casserole dish over a medium heat. Add a little oil, then the bacon and fry until golden brown. Add the onion and garlic and cook for 2 minutes, until softened.",
    "Slice the mushrooms thickly, add to the pan and fry for a further minute. Add the wine and tomatoes, bring to the boil and simmer for 3 minutes, then add the stock. Bring back to the boil and season with salt, pepper and sugar. Chop the tarragon and add half of it to the pan, reserving the rest.",
    "Cut the potatoes into 1cm slices and add them to the pan. Place the chicken on top, pressing it down lightly to immerse it in the stock, then cover with a lid and cook in the oven for 1½ hours. After 1 hour, remove the lid and baste the chicken with the sauce. Return to the oven, uncovered, to allow the chicken to brown.",
    "When the chicken is cooked, remove it and place on a chopping board. Leave to rest for 5 minutes. Add the remaining tarragon to the sauce, stir well and taste to check the seasoning. Carve the chicken into portions: cut the legs off, cut through the joint to separate the drumsticks from the thighs, and carve the breasts off the carcass. Place on a serving dish, then spoon the sauce and potatoes over the chicken."
  ],
  "ingredients": [
    "0",
    "1\tonion",
    "2\tgarlic cloves",
    "6\tsmoked streaky bacon rashers",
    "rapeseed oil, for frying",
    "100g\tbutton mushrooms",
    "125ml\twhite wine",
    "2 x 400g\ttins chopped tomatoes",
    "1 litre\tbrown chicken stock",
    "2 teaspoons\tsugar",
    "2 tablespoons\tfresh tarragon leaves",
    "400g\tnew potatoes",
    "1 x 2kg\tchicken, giblets removed",
    "sea salt",
    "freshly ground black pepper"
  ],
  "__v": 1
}