{
  "hash": "728361ffcfc5a37ccc324042daddd94da4345e2d",
  "title": "Potato, Green Bean, and Tomato Salad\n5",
  "image": "",
  "href": "https://www.cookscountry.com/recipes/11445-potato-green-bean-and-tomato-salad?sqn=X2X72AiGyXCQuPOlMjSPcxUm%2BVVkZpypDT2vY0%2Fvv5w%3D%0A&utm_source=Email&utm_medium=Newsletter&utm_term=NTK&utm_content=FarmersMarket&utm_campaign=190621&j=49377&sfmc_sub=14272391&l=26_HTML&u=22564507&mid=7211371&jb=1711&sk=AB77358693593232C61C58AB0F38D216&extcode=LN19F3QAA&sourcekey=BL19063AA&cds_response_key=&cds_tracking_code=&tag=atkntk1-20&atc=ntkA&Survey_id=&mi_ecmp=",
  "extension": "",
  "firstAdded": "2019-06-21T12:22:12.155000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "BEFORE YOU BEGIN",
    "Make sure to scrub the potatoes well. High-quality extra-virgin olive oil makes a big difference here. You can substitute cherry tomatoes for the grape tomatoes, if desired. For the best results, use a rubber spatula to combine the ingredients in steps 3 and 4.",
    "INSTRUCTIONS",
    "Place potatoes and 2 teaspoons salt in large saucepan and cover with water by 1 inch. Bring to boil over high heat. Reduce heat to medium-low and simmer until potatoes are almost tender, about 7 minutes. Add green beans and continue to cook until both vegetables are tender, about 7 minutes longer.",
    "Meanwhile, whisk oil, vinegar, pepper, and salt together in large bowl; measure out ¼ cup dressing and set aside. Add tomatoes, capers, shallot, and anchovies, if using, to bowl with remaining dressing and toss to coat; set aside.",
    "Drain potatoes and green beans thoroughly in colander, then spread out on rimmed baking sheet. Drizzle reserved dressing over potatoes and green beans and, using rubber spatula, gently toss to combine. Let cool slightly, about 15 minutes.",
    "Add parsley, dill, and potato mixture to bowl with tomato mixture and toss to combine. Season with salt and pepper to taste. Serve."
  ],
  "ingredients": [
    "0",
    "GATHER YOUR INGREDIENTS",
    "1 ½ pounds Yukon Gold potatoes, unpeeled, cut into ¾-inch chunks",
    "¾ teaspoon table salt and ground black pepper, plus salt for cooking vegetables",
    "1 pound green beans, trimmed and cut into 1-inch pieces",
    "½ cup extra-virgin olive oil",
    "¼ cup white wine vinegar",
    "¾ teaspoon pepper",
    "6 ounces grape tomatoes, halved",
    "¼ cup capers",
    "1 shallot, sliced thin",
    "2 anchovy fillets, rinsed and minced (optional)",
    "½ cup fresh parsley leaves",
    "¼ cup chopped fresh dill"
  ],
  "__v": 1
}