{
  "hash": "93a19de5bf8d655e8a3c4f94a976dabeda28f177",
  "title": "Lentil Soup",
  "image": "https://static01.nyt.com/images/2019/01/23/dining/30apperex1/23apperex-articleLarge.jpg",
  "href": "https://cooking.nytimes.com/recipes/1019943-easiest-lentil-soup",
  "extension": "Chrome",
  "firstAdded": "2019-01-30T12:00:52.968000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat 1/4 cup oil in a medium pot over medium-high heat. Stir in onions and 1/2 teaspoon salt, and cook until onions start to brown at the edges, stirring frequently, 6 to 9 minutes.",
    "Stir in stock, lentils, thyme and remaining 1 teaspoon salt. Bring to a simmer, cover, and cook until lentils are tender, 30 to 40 minutes. Discard thyme sprigs.",
    "Stir in garlic, and remaining 2 tablespoons oil, and use an immersion blender to purée the soup to the desired consistency, keeping it chunky or making it smooth. (Alternatively, ladle it into a blender and blend in batches.) Stir in vinegar, then taste and add more salt and vinegar if needed.",
    "In a small bowl, toss radicchio, if using, and parsley with a drizzle of oil and a sprinkle of salt. To serve, ladle soup into bowls and top with a small mound of radicchio and parsley, and/or any other garnishes you like."
  ],
  "ingredients": [
    "0",
    "6",
    "tablespoons extra-virgin olive oil, plus more as needed",
    "1",
    "large onion, diced",
    "1 ½",
    "teaspoons kosher salt, plus more as needed",
    "1",
    "quart chicken, beef or vegetable stock, preferably homemade",
    "1",
    "cup brown or green lentils, rinsed",
    "2",
    "thyme or rosemary sprigs",
    "1 to 2",
    "garlic cloves, finely grated or pushed through a garlic press",
    "1",
    "teaspoon white-wine, sherry or cider vinegar, or lemon or lime juice, plus more to taste",
    "½",
    "cup thinly sliced radicchio, or red or green cabbage (optional)",
    "½",
    "cup parsley leaves, chopped",
    "Toppings (See note)"
  ],
  "__v": 1
}