{
  "hash": "d6349a3ff0b9bcc70c966c9234035be7ca2010be",
  "title": "Indonesian-style spicy noodles with summer cabbage",
  "image": "https://circusgardener.files.wordpress.com/2013/06/indonesian-noodles-and-cabbage3.jpg?w=676",
  "href": "http://circusgardener.com/2013/06/28/staying-true/",
  "extension": "Chrome",
  "firstAdded": "2015-07-19T09:50:07.984000",
  "users": [
    null
  ],
  "keywords": [
    "red",
    "chilli",
    "peppers",
    "garlic",
    "clove",
    "juice",
    "lime",
    "salt",
    "groundnut",
    "oil",
    "organic",
    "spring",
    "cabbage",
    "used",
    "brown",
    "rice",
    "udon",
    "noodles",
    "refreshed",
    "cold",
    "water",
    "onion",
    "firm",
    "tofu",
    "gently",
    "pressed",
    "excess",
    "moisture",
    "roughly",
    "cubes",
    "bunch",
    "onions",
    "white",
    "green",
    "parts",
    "diagonally",
    "soy",
    "bean",
    "sprouts",
    "peanuts",
    "shallots",
    "coriander"
  ],
  "directions": [
    "0",
    "Slice the tops of the chilli pepper. Chop the remainder of the chilli peppers roughly but don’t remove the seeds as this dish relies on their heat. Place in a mini chopper with the garlic, lime and salt and blitz into a paste (alternatively use a pestle and mortar to reduce to a paste). Add the soy sauce and water and stir to combine.",
    "Put a wok or large pan over high heat. Once hot, add the peanuts and dry fry them, stirring constantly for a minute or two until they begin to brown. Remove the peanuts from the wok, lightly crush or chop them and set to one side.",
    "Dry the tofu cubes on kitchen paper to remove any surface moisture. Return the wok to the heat and, when hot and starting to smoke, add the oil. Add the tofu and stir very carefully for 4-5 minutes until the tofu is lightly browned on all sides. Carefully remove the tofu from the wok and drain on kitchen paper.",
    "Add the onion to the wok and cook, stirring frequently, until it begins to soften Add the cabbage and Cook for a further three to four minutes until it is wilted.",
    "Add the spring onions and the bean sprouts and cook for a further two minutes, again stirring frequently, before adding the the chilli paste, soy sauce and water mixture, stirring to combine everything thoroughly.",
    "Now add the noodles and again stir to combine all the ingredients. Return the tofu to the wok. Cook for a further minute.",
    "Add of half the chopped coriander then give everything a quick final stir before piling into bowls. Top with the peanuts, dried shallots and remaining chopped coriander and serve whilst hot. “Selamat Makan!”, as I believe they say in Indonesia."
  ],
  "ingredients": [
    "0",
    "2 red chilli peppers",
    "1 garlic clove, chopped",
    "Juice of 1 lime",
    "pinch of salt",
    "2 tbsp groundnut oil",
    "1 small organic spring cabbage, sliced",
    "300g organic noodles (I used brown rice udon noodles), cooked, drained and refreshed in cold water",
    "1 onion, sliced thinly",
    "240g firm tofu, gently pressed to remove excess moisture and then cut into roughly 1.5 cm cubes",
    "Bunch of organic spring onions, white and green parts, chopped diagonally",
    "2 tbsp soy sauce",
    "1 tbsp water",
    "100g bean sprouts",
    "1 tbsp peanuts",
    "1 tbsp dried shallots",
    "handful fresh coriander, chopped"
  ],
  "__v": 1
}