{
  "__v": 1,
  "directions": [
    "0",
    "Create sweet potato noodles with Blade B of the spiralizer. I chopped off the pointy ends of the sweet potato to make it easier to spiralize. Slice up any parts of the sweet potato that did not get spiralized, and add it to the noodles.",
    "Over medium-high heat, pour the olive oil in a sauté pan. Once the pan is hot, add in the sweet potato noodles and stir. Let the noodles cook for about 4 minutes and season with garlic powder, thyme, and salt. Turn off the heat.",
    "In a bowl, mix the cooked noodles with the egg until well-incorporated.",
    "Oil the pan with the rest of the olive oil.",
    "When the noodles are cool enough to handle, form them into two squares directly on the oiled pan. Make sure that the squares are about the size of sandwich bread.",
    "Turn the stove on to medium-high heat. Cook each side of the squares for about 2-3 minutes.",
    "Once the sweet potato bread is cool enough to handle, start making the sandwich. I spread 1 tablespoon of hummus on each slice, and stacked the turkey, tomatoes, and spinach on the bottom slice. Top with the other slice of bread, hummus side down.",
    "Cut the sandwich in half and enjoy!"
  ],
  "firstAdded": "2014-08-14T20:02:51.560000",
  "hash": "732f0fa5301e29562dec52d794976b26f7e66740",
  "href": "http://healthynibblesandbits.com/2014/07/17/sweet-potato-turkey-sandwich/",
  "image": "http://healthynibblesandbits.com/wp-content/uploads/2014/07/Sweet-Potato-Turkey-Sandwich-2-300x300.jpg",
  "ingredients": [
    "0",
    "1 medium sweet potato (~7.5 oz/210g), peeled",
    "1 and 1/2 TBS oil, divided",
    "1/2 tsp garlic powder",
    "1/2 tsp dried thyme",
    "1/2 tsp salt, add more to taste",
    "1 large egg",
    "2 TBS hummus (I used this caramelized onion hummus)",
    "2 ounces (~55g) deli sliced turkey",
    "2 slices of heirloom tomatoes (or any type of tomato)",
    "small handful of spinach (about 1/4 cup)"
  ],
  "keywords": [
    "medium",
    "potato",
    "ozg",
    "tbs",
    "oil",
    "divided",
    "garlic",
    "thyme",
    "salt",
    "egg",
    "used",
    "caramelized",
    "onion",
    "hummus",
    "deli",
    "turkey",
    "slices",
    "heirloom",
    "tomatoes",
    "type",
    "tomato",
    "spinach"
  ],
  "title": "Sweet Potato Turkey Sandwich",
  "users": [
    null
  ]
}