{
  "hash": "d22ec25000515b83b0bda9ffa7e51f1c659be7aa",
  "title": "Warm + Roasted Winter Salad Bowl",
  "image": "http://recipe-folder.com/img/recipe-images/013/221/3667732713.jpeg",
  "href": "http://ohsheglows.com/",
  "firstAdded": "2015-01-25T14:13:21.013000",
  "users": [
    null
  ],
  "keywords": [
    "uncooked",
    "rainbow",
    "regular",
    "quinoa",
    "water",
    "yukon",
    "gold",
    "potatoes",
    "chunks",
    "green",
    "beans",
    "trimmed",
    "pieces",
    "extralarge",
    "garlic",
    "peel",
    "left",
    "extra",
    "virgin",
    "olive",
    "oil",
    "stemmed",
    "kale",
    "used",
    "lacinato",
    "curly",
    "works",
    "onions",
    "pepita",
    "added",
    "sesame",
    "seeds",
    "minute",
    "avocado",
    "red",
    "wine",
    "vinegar",
    "dijon",
    "mustard",
    "pink",
    "himalayan",
    "salt",
    "pepper"
  ],
  "directions": [
    "0",
    "Preheat oven to 400F and line one extra-large (or 2 large) baking sheets with parchment paper.",
    "Place the chopped potatoes, green beans, and garlic cloves (leave the peel on) onto the baking sheet. Toss with the oil and season with a generous amount of salt and pepper. Spread into an even layer.",
    "Roast for 15 minutes, remove from the oven and flip, and continue roasting about 10-20 more minutes until the potatoes and beans are tender and golden. Watch closely during the last 10 minutes to avoid burning.",
    "Meanwhile, cook the quinoa by adding the quinoa into a medium pot along with 1.5 cups water. Bring to a low boil, reduce heat to medium-low, cover with lid, and cook for 13-17 minutes until the water is absorbed and the quinoa is fluffy. Remove from heat, fluff with a fork, and leave the lid on to keep warm.",
    "Prepare the dressing by whisking the dressing ingredients together in a small bowl. Set aside.",
    "Chop the kale and green onions.",
    "When the vegetables are finished roasting, remove garlic cloves and set aside. Spoon the potatoes and beans into a large serving bowl. Stir in the quinoa and the other chopped vegetables.",
    "Trim the end off each garlic clove and push the roasted garlic out. Finely chop or mash the garlic. Whisk the garlic into the dressing until combined. Pour all of the dressing onto the vegetables and toss to coat.",
    "Season with salt and pepper to taste and serve immediately. Leftovers can be reheated in a saucepan with some oil and the salad will keep in the fridge for a few days."
  ],
  "ingredients": [
    "0",
    "1 cup uncooked rainbow or regular quinoa + 1.5 cups water",
    "3/4 pound Yukon Gold potatoes, chopped into 1/2-inch chunks (about 2 1/2 cups)",
    "1 pound fresh green beans, trimmed and chopped into 1-inch pieces (about 3 cups)",
    "2 extra-large or 3 large garlic cloves (peel left on)",
    "1 tablespoon extra virgin olive oil",
    "1 cup stemmed and finely chopped kale (I used lacinato, but curly works fine too)",
    "3 green onions, thinly sliced",
    "3 tablespoons pepita seeds (I added a handful of sesame seeds at the last minute too)",
    "Sliced avocado",
    "1/4 cup red wine vinegar",
    "1/4 cup extra virgin olive oil",
    "2 teaspoons Dijon mustard",
    "1/4 teaspoon pink Himalayan salt or fine grain sea salt",
    "Freshly ground pepper, to taste"
  ],
  "__v": 1
}