{
  "hash": "0b1148813e34579aaee92f4e2b1a2fbce1818a46",
  "title": "Homemade Vanilla Extract",
  "image": "http://cdn.averiecooks.com/wp-content/uploads/2012/10/vanillaextract-11.jpg",
  "href": "http://www.averiecooks.com/2012/11/homemade-vanilla-extract.html",
  "firstAdded": "2015-01-24T00:29:53.140000",
  "users": [
    null
  ],
  "keywords": [
    "vanilla",
    "beans",
    "split",
    "lengthwise"
  ],
  "directions": [
    "0",
    "Split vanilla beans lengthwise with a knife, stopping about 1-inch from one end. (Use vanilla beans that are flexible, pliable, soft, oily, and not hard or dried out). Place beans in an 8 to 12-ounce jar with a lid (rule of thumb is 5 beans per 8 ounces alcohol). Some people scrape the seeds add the scrapings and beans to the jar separately, but I don't bother scraping.",
    "Pour vodka over the beans to nearly the top of the jar, about 95% full. Seal jar, shake vigorously for about 30 seconds, and set in a corner on the countertop, shelf, or safe place out of direct sunlight, where jar will stay for two months. Once or twice per week, shake the jar for about 10 seconds, otherwise just forget about it.",
    "In 6 weeks, the extract may be ready to use, but it will likely take 8 weeks, and longer is better as the extract will continue to mature. As time elapses, the alcohol will fade and the flavor of vanilla will develop and strengthen. Use your nose and if it smells prominently like alcohol, it's not ready. The extract will always have some scent of alcohol, as storebought vanilla extract does, but it should smell like vanilla extract not like a cocktail. You will be able to discern ready from not ready with a sniff test.",
    "When extract is ready, use it directly out of brewing jar for all your cooking and baking needs. Some people strain extract prior to using to remove the vanilla bean seeds and flecks but I do not. If strained extract is desired, strain it through a fine-mesh filter or sieve). Store extract in the jar in which it's being made or pour into smaller jars (save storebought jars, ask friends and family, they'll be happy to give you old storebought jars if you refill them with homemade). Vanilla extract will keep for many months and year(s) stored at room-temperature out of direct sunlight.",
    "As vanilla extract is used, top off brewing jar with more vodka to allow the vanilla-making cycle to continue. Every six months or so (depends on how fast you're going through it), replace the vanilla beans so they continue to produce flavorful extract. Retired vanilla beans may be dried and added to sugar to make vanilla-sugar. Vanilla-sugar adds extract vanilla oomph to anything it's used in."
  ],
  "ingredients": [
    "0",
    "5 vanilla beans, split lengthwise"
  ],
  "__v": 1
}