{
  "__v": 1,
  "directions": [
    "0",
    "Instructions",
    "Making the dough",
    "Place the flour in a bowl and make a well in the centre (alternatively you can do the whole thing in an electric mixer fitted with a dough hook attachment). Add the egg and mix until it is well combined. Put the milk into a saucepan and scald it (that is, heat it until it starts bubbling and threatening to rise up). Immediately add it to the flour mixture and mix through. Knead the dough for 5 minutes until it is smooth and elastic. Wrap in plastic wrap and leave it for 15 minutes to rest.",
    "Divide the dough into six portions — cover any that you aren’t working with to prevent them from drying out. Roll out a piece of dough on a lightly floured work surface until it is thin enough to see your hands through. You can use a pasta machine to do this if you prefer. When the dough is thin enough, use a pastry cutter to cut out circles with an 8 cm (3 ¼ inch) diameter. Repeat until all the dough is used up — you should have about 45 circles. Arrange the circles on sheets of baking paper in layers.",
    "Making the pierogi",
    "To make the pierogi, place 1 teaspoon of your chosen filling (make sure the filling is cool) into the centre of each circle. Brush one half of the rim with lightly beaten egg, then fold the circle carefully in half, trying to leave as little excess air in the pierogi as possible, and press the edge to seal. The pierogi can be stored at this stage on layers of baking paper. You can freeze them successfully for up to 3 months.",
    "Cooking the pierogi",
    "To cook the pierogi, bring a large saucepan of salted water to the boil. Add the pierogi, in batches if necessary (add roughly the number of pierogi that would cover the surface of the pot in a single layer), and cook for about",
    "3 minutes, or until the pasta is al dente.",
    "It is perfectly acceptable to brush the pierogi with a little melted butter and serve them as is, but at the vodka bar we like to take it a step further and sauté them until they are a little bit crisp. Sauté them in a little vegetable oil and butter with their individual garnish until they start to brown, then serve them with a dollop of sour cream.",
    "Pierogi is one of the things we serve as a late-night bar snack at Borsch, but it is not convenient to have many boiling pots and pans running all night waiting for a few orders so we opt to deep-fry them. All you do is fill a deep-fryer or large heavy-based saucepan with enough oil to come one-third of the way up the pan and heat until it is 180°C (350°F), or until a cube of bread dropped into the oil browns in 15 seconds. Drop the pierogi into the hot oil and remove them when they’re golden brown, about 5 minutes. I must confess that this is one of my favourite ways to eat them, served with a side of sour cream with some capsicum salsa mixed into it and some chopped fresh dill. I’d recommend trying it late at night!",
    "Recipe from Borsch, Vodka and Tears published by Hardie Grant."
  ],
  "firstAdded": "2014-10-11T13:12:08.723000",
  "hash": "323d6c801f634867677956ac1f937856d69e5cca",
  "href": "http://www.sbs.com.au/food/recipes/polish-dumplings-pierogi",
  "image": "http://www.sbs.com.au/food/sites/sbs.com.au.food/files/styles/full/public/Pierogi_0.jpg?itok=_wHq02yG&mtime=1376135510",
  "ingredients": [
    "0",
    "Pierogi dough",
    "325 g plain flour",
    "1 egg, lightly beaten, plus extra, for brushing",
    "185 ml (¾ cup) milk"
  ],
  "keywords": [
    "pierogi",
    "dough",
    "plain",
    "flour",
    "egg",
    "lightly",
    "extra",
    "brushing",
    "milk"
  ],
  "title": "Polish dumplings (pierogi)",
  "users": [
    null
  ]
}