{
  "hash": "4f18dee9ef9492d53ef44f9b62b48befc67eb90d",
  "title": "COQ AU VIN",
  "image": "http://www.gimmesomeoven.com/wp-content/uploads/2016/12/Coq-Au-Vin-Recipe-French-Cuisine-6-1.jpg",
  "href": "http://www.gimmesomeoven.com/coq-au-vin-recipe/",
  "extension": "Chrome",
  "firstAdded": "2017-01-10T04:56:19.150000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS:",
    "Place chicken in a large bowl or ziplock bag. Add wine and beef (or chicken) stock, and gently toss to combine. Cover/seal and refrigerate for anywhere from 1 to 8 hours.",
    "When you're ready to cook the coq au vin, fry the bacon over medium-high heat in a large Dutch oven (or any heavy-bottomed stock pot or deep saute pan) until crispy. Transfer the bacon with a slotted spoon to a separate plate, and set aside. There should be about 3 tablespoons of bacon grease remaining. (If not, add in some extra olive oil to make up the difference.)",
    "While the bacon is cooking, remove the chicken from the wine and pat dry, being sure to reserve the wine. (We'll use it later!) Season the chicken on both sides with salt and pepper. Then, once the bacon has been removed from the pan, add half of the chicken to the remaining bacon grease, and saute the chicken for 2-3 minutes per side until browned. Transfer the cooked chicken to a separate plate, and repeat with the second half of the uncooked chicken. Once the second batch has been cooked, transfer it to a separate plate, and set aside.",
    "Add the shallot to the remaining bacon grease, and saute for 3 minutes until mostly cooked through, stirring occasionally. Add in the pearl onions, mushrooms, and garlic, and saute for 4-5 more minutes, stirring occasionally, until the mushrooms are browned.",
    "Stir in the flour and tomato paste until completely combined, and cook for 1 minute, stirring occasionally. Slowly add in the Cognac (or brandy), and stir for 1 minute. Add in the reserved red wine, thyme sprigs and bay leaves, and stir to combine.",
    "Add the cooked bacon and chicken back to the pot. Continue cooking until the mixture reaches a simmer. Then reduce heat to low, cover, and cook for 60-80 minutes, until the chicken is tender and cooked through.",
    "Remove and discard the bay leaves and thyme sprigs. Season with salt and pepper, to taste.",
    "Serve immediately over mashed potatoes or noodles, garnished with chopped parsley if desired.",
    "Traditionally, coq au vin is made with lighter red wines, like a Bordeaux, Pinot Noir, Côtes du Rhône, etc. But I've found that I prefer it with a more full-bodied red wine, such as Cabernet Sauvignon.",
    "The cooking time listed above does not include the amount of time needed for the chicken to marinate in the red wine, which can vary anywhere from 1 to 8 hours."
  ],
  "ingredients": [
    "0",
    "(I used 4 thighs and 4 legs)",
    "(see suggestions below)",
    "(or 1/2 cup finely-diced white onion)",
    "optional: mashed potatoes or cooked egg noodles, for serving"
  ],
  "__v": 1
}