{
  "__v": 1,
  "directions": [
    "0",
    "Heat the broiler to high and arrange a rack in the upper third of the oven.",
    "Place the tomato halves skin-side up on a baking sheet. Scatter the onion, garlic, and serrano around the tomatoes. Broil until the tomato skins start to blacken and blister, about 7 minutes. Transfer the vegetables to a blender, add the measured lime juice and salt, and blend into a smooth purée. Taste and season with additional salt and lime juice as needed.",
    "Transfer to a small saucepan and keep warm over low heat.",
    "1",
    "Lay 1 chile on a work surface so that it sits flat naturally without rolling. Using a paring knife, make two cuts forming a “T” by first slicing down the middle of the chile lengthwise from stem to tip, then making a second cut perpendicular to the first about a 1/2 inch from the stem, slicing only halfway through the chile (be careful not to cut off the stem end completely). Carefully open the flaps to expose the interior of the chile and, using the paring knife, carefully cut out and remove the core. Scrape the inside with a small spoon to remove the seeds, ribs, and any remaining core. Repeat with the remaining peppers.",
    "Turn 2 gas burners to medium-high heat. Place 1 chile directly on each burner and roast, turning occasionally with tongs, until blackened and blistered on all sides, about 5 to 7 minutes. (Alternatively, heat the broiler to high and arrange a rack in the upper third of the oven. Place all of the chiles directly on the rack. Broil, turning occasionally with tongs, until the chiles blacken and blister on all sides, about 8 to 10 minutes. The chiles will be softer using the broiler rather than a direct flame, so be careful not to tear them while stuffing.) Remove to a large heatproof bowl; repeat with the remaining 2 chiles.",
    "Cover the bowl tightly with plastic wrap or a baking sheet and let the chiles steam until cool enough to handle, about 15 minutes. Using a butter knife, scrape away and discard the chile skins, being careful not to tear the chiles; set the chiles aside.",
    "Heat the oven to 250°F and arrange a rack in the middle. Place a wire rack over a baking sheet and set aside.",
    "Season the inside and outside of the chiles with salt and pepper. Stuff each chile, being careful not to tear them, with a quarter of the cheese (about a heaping 2/3 cup) and close the flaps over the cheese; set the chiles aside.",
    "Whisk the egg yolks in a medium bowl until lightened in color and frothy, about 2 minutes; set aside.",
    "Place the egg whites and measured salt in the clean, dry bowl of a stand mixer fitted with a whisk attachment. Beat on high speed until stiff peaks form, about 1 1/2 minutes. Remove the bowl from the mixer, add the egg yolks, and fold with a rubber spatula until just combined (do not deflate the egg whites); set aside.",
    "Heat the oil in a large frying pan over medium-high heat until hot, about 4 minutes. Check to see if the oil is hot by submerging the handle of a wooden spoon or a wooden chopstick until it touches the bottom of the pan—the oil should bubble vigorously. Working with 1 chile at a time, drop 1/2 cup of the egg batter into the oil and use a rubber spatula to spread it to about the same size as the stuffed chile. Lay the chile seam-side down on top of the mound of batter. Drop another 1/2 cup of batter on top of the chile, spreading it with the rubber spatula to cover the sides and encase the chile. Cook without disturbing until the bottom of the chile relleno is golden brown, about 2 to 3 minutes. Using a flat spatula and a fork, carefully flip the chile relleno over and cook until the other side is golden brown, about 2 to 3 minutes. (If the sides of the chile are not brown, use a spatula or tongs to turn it onto each side to brown.) Transfer the chile relleno to the rack set over the baking sheet, season with salt, and place in the oven to keep warm. Repeat with the remaining stuffed chiles.",
    "To serve, spread 1/3 cup of the roasted tomato salsa on each plate and top with a chile relleno. Serve immediately, passing the remaining salsa on the side."
  ],
  "hash": "002054980b5b8f5fee532132f8ecf100c4c7a0b1",
  "href": "http://www.chow.com/recipes/29565-chiles-rellenos",
  "image": "http://search.chow.com/thumbnail/480/0/www.chowstatic.com/assets/2011/04/29565_chile_rellenos_620.jpg",
  "ingredients": [
    "0",
    "1 pound Roma tomatoes, cored and halved",
    "1/2 medium white onion, cut into 1/2-inch slices",
    "2 medium garlic cloves, peeled and smashed",
    "1 medium serrano chile, stemmed",
    "1 teaspoon freshly squeezed lime juice, plus more as needed",
    "1 teaspoon kosher salt, plus more as needed",
    "1",
    "4 medium poblano chiles (about 1 pound)",
    "Freshly ground black pepper",
    "3 cups shredded Monterey Jack cheese (about 8 ounces)",
    "4 large eggs, separated and at room temperature (see “Game plan” note above)",
    "1/2 teaspoon kosher salt, plus more as needed",
    "1 cup vegetable or canola oil"
  ],
  "keywords": [
    "roma",
    "tomatoes",
    "cored",
    "medium",
    "white",
    "onion",
    "slices",
    "garlic",
    "smashed",
    "serrano",
    "chile",
    "stemmed",
    "squeezed",
    "lime",
    "juice",
    "needed",
    "kosher",
    "salt",
    "poblano",
    "chiles",
    "black",
    "pepper",
    "monterey",
    "jack",
    "cheese",
    "eggs",
    "separated",
    "room",
    "game",
    "plan",
    "canola",
    "oil"
  ],
  "title": "Chiles Rellenos Recipe",
  "users": [
    null
  ]
}