{
  "hash": "01cced3b204442c02f870b14947166eb09f25ff4",
  "title": "Provençal Fish Stew",
  "image": "",
  "href": "https://cooking.nytimes.com/recipes/1016044-provencal-fish-stew?mcubz=1&regi=1&join_cooking_newsletter=false&login=google",
  "extension": "Chrome",
  "firstAdded": "2017-09-07T16:55:42.673000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Drain chickpeas. If you used dried, reserve cooking liquid; if they are canned, discard the liquid and rinse the chickpeas. Put 2 tablespoons oil in a large skillet over medium heat. When it’s hot, add bread crumbs, sprinkle with salt and pepper and cook, stirring frequently, until they’re crisp and toasted, 3 to 5 minutes. Remove from pan.",
    "Add the remaining 2 tablespoons oil to the skillet; increase heat to medium-high. When oil is hot, add garlic, olives, capers and anchovies. Cook, stirring occasionally, until fragrant, a minute or two. Add tomato paste and cook, stirring occasionally, until it darkens slightly, 2 to 3 minutes.",
    "Start adding spinach a handful at a time; keep stirring until all the spinach fits in the pan and starts to release its water; sprinkle with a little more pepper, then add the stock, chickpeas and red chile flakes if you’re using them. Adjust the heat so the mixture bubbles gently but steadily, then stir in the squid and the shrimp. Cook until the seafood is just cooked through, 2 to 3 minutes.",
    "Taste and adjust the seasoning. Divide among bowls, sprinkle with bread crumbs and serve."
  ],
  "ingredients": [
    "0",
    "1 cup cooked or canned chickpeas",
    "4 tablespoons olive oil",
    "1 cup fresh bread crumbs",
    "Salt and ground black pepper",
    "1 tablespoon minced garlic",
    "¼ cup niçoise or oil-cured olives, pitted and chopped",
    "1 tablespoon capers, chopped",
    "2 or 3 anchovy fillets, finely chopped",
    "2 tablespoons tomato paste",
    "1 pound spinach",
    "2 cups fish or vegetable stock, or water",
    "Pinch red chile flakes (optional)",
    "8 ounces squid, roughly chopped",
    "8 ounces shrimp, roughly chopped"
  ],
  "__v": 3
}