{
  "hash": "5e7d4602b13a09f4d224ee9e7885adcf8ea35264",
  "title": "Healthy Dark Chocolate Almond Truffles",
  "image": "https://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2016/02/healthy-dark-chocolate-truffles-8.jpg",
  "href": "https://sallysbakingaddiction.com/2016/02/12/healthy-dark-chocolate-almond-truffles/",
  "extension": "Chrome",
  "firstAdded": "2018-09-30T19:08:33.074000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Line a large baking sheet with parchment paper or a silicone baking mat. Set aside.",
    "Place pitted dates, vanilla extract, cocoa powder, almonds, sunflower seeds, and salt (if using) into your food processor. Blend/pulse until a moist dough forms, as pictured above. This will take a minute or two of blending. If the dough is too dry and crumbly, add 1-2 more soaked dates or even a teaspoon of pure maple syrup.",
    "Once dough is formed, scoop out 1 Tablespoon of dough. Roll into a smooth ball and place onto prepared baking sheet. Repeat with remaining dough. Set aside as you melt the chocolate in the next step.",
    "You can melt the chocolate in a double boiler or the microwave. If using the microwave: place the chocolate in a medium heat-proof bowl. I like to use a liquid measuring cup. Its depth makes it easy for dipping. Melt in 30 second increments in the microwave, stirring after each increment until completely melted and smooth. Let the warm chocolate sit for 5 minutes to slightly cool before dipping.",
    "Dip each ball completely into the chocolate using a dipping tool. When lifting it out of the chocolate, remember to tap the dipping tool gently on the side of the bowl to allow excess chocolate to drip off. Place each back on the baking sheet and refrigerate until the chocolate has set, about 30 minutes.",
    "Make ahead tip: Cover truffles tightly and store in the refrigerator for up to 1 week. You can freeze these truffles, too! Freeze for up to 3 months. Thaw overnight in the refrigerator before serving."
  ],
  "ingredients": [
    "0",
    "14 Medjool dates, soaked in warm water for 10 minutes",
    "2 teaspoons vanilla extract",
    "1/4 cup (21g) unsweetened cocoa powder",
    "1/2 cup (70g) Diamond of California whole almonds",
    "1/2 cup (70g) sunflower seeds (I use salted)1",
    "optional: 1/4 teaspoon salt2",
    "8 ounces (226g) semi-sweet or bittersweet quality chocolate3"
  ],
  "__v": 1
}