{
  "hash": "0bcf676918b23cd26fe64fff477e9e5e7a2e4ab9",
  "title": "BBQ Jerk Chicken with Caribbean Mango Slaw",
  "image": "http://food.fnr.sndimg.com/content/dam/images/food/fullset/2017/5/1/0/KC1308H_grilled-jerk-chicken_s4x3.jpg.rend.hgtvcom.616.462.suffix/1493653428641.jpeg",
  "href": "http://www.foodnetwork.com/recipes/bbq-jerk-chicken-with-caribbean-mango-slaw-3722089",
  "extension": "Chrome",
  "firstAdded": "2017-09-17T15:18:12.802000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "Combine the jerk seasoning, garlic powder and onion powder in a small bowl. Rub the chicken with the jerk mixture (do not over season, or the dry rub will cake up and become too thick) and marinate, refrigerated, at least 1 hour and up to overnight.",
    "Combine the mango puree, honey, sriracha, lime juice, beer and some salt and pepper in a small saucepan and heat until the mixture comes to a boil; set aside.",
    "Preheat a grill or grill pan to medium-high heat. Add the chicken and cook without moving for 3 minutes. Flip over and brush lightly with the mango glaze. Continue cooking until cooked all the way through (to an internal temperature of 165 degrees F), about another 3 minutes. Remove from the grill and brush with more glaze. Tent loosely with foil to keep warm. Serve with Caribbean Mango Slaw.",
    "Caribbean Mango Slaw:",
    "Combine the olive oil, honey, vinegar, mustard, sriracha, lime juice and salt and pepper to taste in a large bowl and whisk until well blended. Add the carrots, parsley, mint, cabbage and most of the almonds and mango and toss until well coated. Transfer to a serving bowl and garnish with the remaining almonds and mango."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1/4 cup jerk seasoning, such as Grace's Dried Jerk Seasoning",
    "1 tablespoon garlic powder",
    "1 tablespoon onion powder",
    "2 boneless chicken breasts",
    "1 cup mango puree",
    "1 tablespoon honey",
    "1 teaspoon sriracha",
    "1 lime, juiced",
    "1/2 bottle beer, such as Red Stripe",
    "Kosher salt and freshly cracked black pepper",
    "Caribbean Mango Slaw, recipe follows, for serving",
    "Caribbean Mango Slaw:",
    "3/4 cup olive oil",
    "3 tablespoons honey",
    "2 tablespoons red wine vinegar",
    "1 tablespoon Dijon mustard",
    "1 tablespoon sriracha",
    "1 lime, juiced",
    "Kosher salt and freshly ground black pepper",
    "2 cups shredded carrots",
    "1 cup fresh Italian parsley leaves, chopped",
    "1/2 cup fresh mint leaves, cut into chiffonade",
    "1 head napa cabbage, thinly sliced",
    "1 cup chopped almonds (reserve some for garnish)",
    "1 mango, sliced thin or julienned (reserve some for garnish)"
  ],
  "__v": 1
}