{
  "hash": "c1671675cb42b122cbd1a03188dc75a7a85d7c74",
  "title": "FRESH PEAR AND PECORINO RAVIOLI WITH CACIO E PEPE SAUCE",
  "image": "",
  "href": "http://lidiasitaly.com/recipes/fresh-pear-and-pecorino-ravioli/",
  "extension": "Chrome",
  "firstAdded": "2018-02-28T17:05:35.255000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the filling: Peel and core the pear and shred it against the large holes of a box grater. Stir the pear shreds with the Grana Padano in a bowl, and blend in the mascarpone.",
    "Roll the dough: Cut the dough into four equal pieces. Flatten a piece of dough into a 4-by-5-inch rectangle, and roll through the widest setting on the pasta machine. Fold this rectangle of dough in three like a letter, and roll through again. Repeat the rolling and folding a few more times to knead and smooth the dough. Repeat with the remaining pieces of dough.",
    "Switch to the next setting on the machine. Roll a dough strip through, short end first. Repeat with remaining dough strips. Continue this process, now rolling only once through each setting, until you’ve gotten to the next-to-last setting and the dough strips are about as wide as the machine (6 to 7 inches).",
    "Lay one strip out on the counter and dollop filling at about 4-inch intervals down in the center of the strip (you will get about six or seven large ravioli per strip). Brush around the filling with water, fold the strip over, and seal. Using a serrated pastry cutter or pizza cutter, cut ravioli into rectangles. Repeat with remaining dough and filling.",
    "Bring a large pot of salted water to a boil for the pasta. Add the ravioli. At the same time, melt the butter in a skillet over medium heat, and add 1 cup pasta water. Simmer while the pasta cooks, just to reduce the sauce and emulsify it. Cook the ravioli until al dente, about 3 minutes after they begin to float, then remove with a spider, transfer directly to the sauce, and toss gently to coat in the sauce. Remove the pan from the heat and sprinkle over it the grated pecorino, mixing gently so the cheese begins to melt into a sauce, then grind abundant coarse black pepper all around, and serve."
  ],
  "ingredients": [
    "0",
    "RAVIOLI",
    "1 large firm but ripe Bartlett or other pear (or 2 small pears, 8 to 10 ounces total)",
    "1 ½ cup freshly grated Grana Padano",
    "2 tablespoons mascarpone, chilled",
    "1 recipe Light Egg Pasta Dough (Recipe)",
    "Kosher salt",
    "SAUCE",
    "12 tablespoons (1 ½ stick) unsalted butter",
    "4 ounces mild 12-month-aged Pecorino Romano, grated",
    "Abundant coarsely ground black pepper to taste"
  ],
  "__v": 1
}