{
  "hash": "3fc33be9263af1c5037810f180c7467abb477f09",
  "title": "Pumpkin Chocolate Chip Bread",
  "image": "https://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2014/09/pumpkin-chocolate-chip-bread-recipe-2.jpg",
  "href": "https://sallysbakingaddiction.com/2014/09/08/pumpkin-chocolate-chip-bread/",
  "extension": "Chrome",
  "firstAdded": "2018-09-15T22:33:33.490000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Adjust the oven rack to the lower third position and preheat the oven to 350F degrees. Lowering the oven rack prevents the top of your bread from browning too much too soon. Spray a 9x5 inch loaf pan with non-stick spray. Set aside.",
    "In a large bowl, whisk the flour, baking soda, cinnamon, nutmeg, cloves, and salt together until combined. In a medium bowl, whisk the eggs, granulated sugar, and brown sugar together until combined. Whisk in the pumpkin, oil, and orange juice. Pour these wet ingredients into the dry ingredients and gently mix together using a rubber spatula or a wooden spoon. There will be a few lumps. Do not overmix. Gently fold in the chocolate chips.",
    "Pour the batter into the prepared loaf pan. Bake for 60-65 minutes, making sure to loosely cover the bread with aluminum foil halfway through to prevent the top from getting too brown. The bread is done when a toothpick inserted in the center comes out clean with only a few small moist crumbs. This may be before or after 60-65 minutes depending on your oven, so begin checking every 5 minutes at the 55 minute mark or so.",
    "Allow the bread to cool completely in the pan on a wire rack before removing and slicing. The bread will stay fresh in an airtight container (it tastes better on day 2!) at room temperature or in the refrigerator for up to 10 days. But it won't last that long.",
    "Make ahead tip: Baked bread can be frozen up to 3 months. Thaw overnight in the refrigerator and bring to room temperature before serving."
  ],
  "ingredients": [
    "0",
    "1 and 3/4 cups (220g) all-purpose flour (measured correctly)",
    "1 teaspoon baking soda",
    "2 teaspoons ground cinnamon",
    "1/4 teaspoon ground nutmeg1",
    "1/4 teaspoon ground cloves1",
    "3/4 teaspoon salt",
    "2 large eggs",
    "3/4 cup (150g) granulated sugar",
    "1/2 cup (100g) packed light or dark brown sugar",
    "1 and 1/2 cups (340g) pumpkin puree (canned or fresh)",
    "1/2 cup (120ml) vegetable oil, canola oil, or melted coconut oil",
    "1/4 cup (60ml) orange juice (or milk works too!)",
    "2/3 cup (120g) semi-sweet chocolate chips2"
  ],
  "__v": 1
}