{
  "__v": 1,
  "directions": [
    "0",
    "Place the saffron in a small bowl with the boiling water and leave to infuse for at least 10 minutes. Then add the eggs and oil and beat to mix. Place the flour and turmeric in the bowl of a food processor and add the saffron mix. blend until a crumbly dough forms. You may need a little more oil or flour to adjust the dough to the required consistency—it should not be sticky nor very dry.",
    "Lightly dust your surface with flour, tip out the dough and knead it into a ball. Work for a few minutes, adding more flour as needed, until it becomes silky soft (I dont really know what that means- knead until smooth). Wrap the dough in plastic wrap and chill for 30 minutes, or up to a day.",
    "Divide the dough into 4 pieces. Keep the pieces you are not working with well covered. Using a rolling pin, or your hands, flatten one of the pieces into a thin rectangle. Set the pasta machine to its widest setting and pass the dough through. Continue rolling the pasta, narrowing the setting by a notch every time, until you get to the lowest setting (I stopped at the second lowest setting, I like a little more heft to my noodles).",
    "Fold up the pasta sheet 2-3 times along its length, sprinkling some flour between the layers. Use a large knife to cut strips that are about 1/2-3/4-inch wide. Hang them on the back of a chair to dry for 10 minutes. Repeat with the remaining dough.",
    "Next make the spiced butter. Place the butter and oil in a frying pan and cook the shallots gently for about 10 minutes, or until they soften and the butter turns slightly brown. Now, add all of the spices, the salt and some pepper. Remove from the heat and keep warm.",
    "Cook the pasta in a large pan of boiling salted water for 2-3 minutes, or until al dente. Drain and return to the saucepan (or, if you used a large frying pan for the butter, you can also add the noodles directly to that pan). Toss the pasta with the spiced butter until evenly coated. Serve topped with pine nuts and chopped herbs.",
    "6 servings."
  ],
  "firstAdded": "2014-06-18T17:25:02.248000",
  "hash": "0d4c6b987527d1203a8db9d2bca04a9edc9000f3",
  "href": "http://www.lottieanddoof.com/2014/02/saffron-pasta-with-spiced-butter/",
  "image": "http://www.lottieanddoof.com/wp-content/uploads/2014/02/IMG_1796.jpg",
  "ingredients": [
    "0",
    "For pasta:",
    "2 teaspoons saffron threads",
    "4 tablespoons boiling water",
    "4 medium eggs",
    "4 tablespoons olive oil",
    "440g 00 pasta flour, plus extra for rolling",
    "1 teaspoon ground turmeric",
    "80 g pine nuts, toasted and roughly chopped",
    "4 tablespoons roughly chopped parsley",
    "4 tablespoons roughly chopped mint",
    "For spiced butter:",
    "113 g unsalted butter (1 stick)",
    "6 tablespoons olive oil",
    "8 shallots, finely chopped",
    "1 teaspoon ground ginger",
    "1 teaspoons sweet paprika",
    "1 teaspoon ground coriander",
    "1 teaspoon ground cinnamon",
    "1 teaspoons cayenne pepper",
    "1/2 teaspoon chilli flakes",
    "1/2 teaspoon ground turmeric",
    "1 1/2 teaspoons kosher salt",
    "black pepper"
  ],
  "keywords": [
    "pasta",
    "saffron",
    "threads",
    "boiling",
    "water",
    "medium",
    "eggs",
    "olive",
    "oil",
    "flour",
    "extra",
    "rolling",
    "turmeric",
    "pine",
    "nuts",
    "roughly",
    "parsley",
    "mint",
    "spiced",
    "butter",
    "unsalted",
    "shallots",
    "ginger",
    "paprika",
    "coriander",
    "cinnamon",
    "cayenne",
    "pepper",
    "chilli",
    "kosher",
    "salt",
    "black"
  ],
  "title": "Saffron Tagliatelle with Spiced Butter",
  "users": [
    null
  ]
}