{
  "hash": "5142149daeaa847f48d6749e3048dd8630e98721",
  "title": "NOT-MEATBALLS",
  "image": "https://oursouthend.files.wordpress.com/2014/05/20140530-144819.jpg?w=640",
  "href": "http://agirlcalledjack.com/2014/05/16/not-meatballs/",
  "extension": "Firefox",
  "firstAdded": "2015-08-16T13:09:09.250000",
  "users": [
    null
  ],
  "keywords": [
    "aubergine",
    "onion",
    "red",
    "white",
    "fat",
    "clove",
    "garlic",
    "chilli",
    "stuff",
    "black",
    "olives",
    "oil",
    "zest",
    "bottled",
    "lemon",
    "juice",
    "slice",
    "bread",
    "stale",
    "fistful",
    "herbs",
    "parsley",
    "mint",
    "coriander",
    "basil",
    "work"
  ],
  "directions": [
    "0",
    "Cut the stems off the ends of the aubergines and halve lengthways. Dice the flesh into chunks and pop into a medium non stick saucepan or frying pan. Peel and finely slice the onion and garlic, chop the chilli as finely as you can, and add these to the pan. Toss in the chopped olives and a tablespoon of oil, and cook on a medium heat for 10 minutes to brown and soften.",
    "Grate over the lemon zest and squeeze in the juice, and, once the aubergines are soft, tip everything into a mixing bowl. Grate the bread over the top (or break it up and blitz it in a blender for a minute to make breadcrumbs), finely chop the herbs and mix in well.",
    "Shape the mixture into tablespoon sized balls with your hands. Put the remaining oil in a frying pan and carefully fry the aubergine balls in batches until browned all over. Remove with a slotted spoon, and serve with extra lemon juice and basil to taste."
  ],
  "ingredients": [
    "0",
    "1 aubergine",
    "1 onion, red or white",
    "a fat clove of garlic",
    "1 red chilli or a pinch of the dried stuff",
    "1 tablespoon finely chopped black olives (optional)",
    "3 tablespoons oil",
    "zest and juice of half a lemon, or a tablespoon of bottled lemon juice",
    "a slice of bread, stale or fresh",
    "a fistful of herbs: parsley, mint, coriander or basil all work well"
  ],
  "__v": 1
}