{
  "hash": "336063d040d141d959cd69c2e40e61eb710c50b6",
  "title": "Spicy Eggplant Pasta",
  "image": "https://d2k9njawademcf.cloudfront.net/indeximages/35496/full/Vegan_Eggplant_Pasta.jpg?1403280807",
  "href": "http://food52.com/recipes/24001-spicy-eggplant-pasta",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T21:31:16.594000",
  "users": [
    null
  ],
  "keywords": [
    "medium",
    "eggplants",
    "salt",
    "olive",
    "oil",
    "divided",
    "black",
    "pepper",
    "onion",
    "garlic",
    "plum",
    "tomatoes",
    "dry",
    "oregano",
    "red",
    "extra",
    "finishing",
    "basil",
    "linguine",
    "pasta"
  ],
  "directions": [
    "0",
    "Cut the eggplants crosswise into 1-inch thick slices. Lay the slices on a baking sheet, salt them well on both sides, and set aside for half an hour or so.",
    "Preheat the oven to 425° F.",
    "Drizzle two tablespoons of olive oil over the eggplant, tossing the slices to coat them. Sprinkle with sea salt and black pepper. Arrange them in a single layer on the baking sheets and roast them until they're tender and browning, about 20 minutes.",
    "While the eggplant roasts, heat remaining tablespoon of the olive oil on low heat in a large saucepan. Add the onions and the minced garlic and sautée them until onions are soft (8 to 10 minutes). Add the tomatoes, oregano, pepper flakes, and basil. Continue to cook, stirring occasionally, till the sauce has thickened up (approximately 10 to 12 minutes). When the eggplant is ready, remove it from the oven, chop it into 1-inch pieces, and add it to the sauce. Continue to simmer gently on very low heat.",
    "Bring a large pot of salted water to boil. Add the pasta and cook until al dente, about 8 minutes. Drain the pasta and gently fold in the sauce. Top the pasta with additional chopped basil and red pepper flakes to taste. Serve."
  ],
  "ingredients": [
    "0",
    "2 medium eggplants",
    "Salt",
    "3 tablespoons olive oil, divided",
    "Freshly ground black pepper",
    "1 medium onion, chopped",
    "2 cloves garlic, minced",
    "2 cups chopped plum tomatoes or one 14-ounce can crushed tomatoes",
    "1 tablespoon fresh oregano, or 1 1/2 teaspoons dry oregano",
    "2 teaspoons red pepper flakes, plus extra for finishing",
    "1/4 cup fresh, chopped basil, plus extra for finishing",
    "1 pound linguine pasta"
  ],
  "__v": 1
}