{
  "hash": "6f7afb23c172760a7b497bbd5702128749e7c9ee",
  "title": "Sous Vide Sesame Chicken",
  "image": "",
  "href": "https://www.simplyrecipes.com/recipes/sous_vide_sesame_chicken/",
  "extension": "Chrome",
  "firstAdded": "2020-04-01T23:02:54.083000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "ETHODSHOW PHOTOS",
    "1 Heat the water: Fill a pot with water and place your immersion circulator inside. Set the temperature to 158°F and let the water come up to temperature.",
    "2 Prepare the chicken: Combine the cubed chicken breast along with ginger, garlic, sesame oil, soy, and rice wine vinegar to a gallon-sized zip-top freezer bag. Make sure the chicken is in a single layer.",
    "3 Seal the bag: Seal the bag with as little air as possible by using water-displacement method to help press out all the air: Just slowly lower the bag with the chicken into the water, letting the pressure of the water press the air through the top of the bag. Once the top of the bag reaches the water line and all the air has been pressed out, seal the bag. (Read more here.)",
    "You can do this in the pot of water as it heats. (Just be careful if the water is already steaming!) Set the chicken aside on a kitchen towel until the water has finished heating. Seal it when it is submerged so most of the air is out of the bag.",
    "4 Cook the chicken: Once the water has come to temperature, submerge the sealed bag of chicken. Make sure the bag is completely submerged so the food cooks evenly.",
    "Cook the chicken for 2 hours. When cooking time ends, remove the chicken from the water and turn off the circulator.",
    "6 Make the sauce and combine with the chicken. Whisk together all of the sauce ingredients in a medium skillet. Bring to a simmer over medium heat; it and should start to thicken immediately.",
    "Scoop out the chicken from the zip-top bag, discard the garlic and ginger, and add the chicken to the pan with the sauce. (The leftover cooking liquid can be saved and used in another recipe, if you like!)",
    "Turn heat down to low, and toss to coat and combine. The sauce should get very thick and stick to the chicken.",
    "7 Serve the chicken: Serve sesame chicken over rice garnished with sesame seeds and scallions.",
    "Hello!"
  ],
  "ingredients": [
    "0",
    "If you like, you can measure out 1/3 cup of the liquid from cooking the chicken and use it in place of the chicken stock when making the sauce for this recipe.",
    "INGREDIENTS",
    "For the chicken:",
    "1 1/2 pounds chicken breast, cubed into 1-inch pieces",
    "1-inch piece fresh ginger, thinly sliced",
    "2 cloves garlic, smashed",
    "1 tablespoon sesame oil",
    "1 tablespoon soy sauce",
    "1 tablespoon rice wine vinegar",
    "For the sesame sauce:",
    "1/4 cup soy sauce",
    "1/4 cup rice wine vinegar",
    "1/3 cup honey",
    "1 tablespoon cornstarch",
    "1/3 cup chicken stock or water",
    "1 tablespoon sesame seeds",
    "2 teaspoons sesame oil",
    "1 teaspoon chili garlic sauce (optional)",
    "Sesame seeds, garnish"
  ],
  "__v": 1
}