{
  "hash": "400c844de58d8574d8aae556e805e0eb6bcd28c9",
  "title": "Śledzie po żydowsku",
  "image": "//static.smaker.pl/photos//c/0/3/c03879c0aa7f938f4312bb8f7552e214_361234_5478a170e80d3_wm.jpg",
  "href": "http://smaker.pl/przepis-sledzie-po-zydowsku,110158,ewam45.html",
  "extension": "",
  "firstAdded": "2016-09-17T21:52:24.467000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Przygotowanie",
    "Śledzie moczymy w wodzie lub w mleku, tak by pozbyć się słonego smaku.",
    "Obieramy cebule i kroimy w piórka. na patelni rozgrzewamy olej , dodajemy cebule i przykrywamy do duszenia. Cebula powinna być miękka, ale nie przypieczona.",
    "Do tak przyrządzonej cebuli dodajemy rodzynki i na chwilę zostawiamy, by zmiękły",
    "Następny etap to koncentrat pomidorowy i musztarda, które dodajemy do cebuli , mieszamy. Możemy dodać odrobinę cukru jeśli będą zbyt kwaśne.",
    "Ostudzamy podstawę do naszych śledzi. Następnie w szklance rozrabiamy olej rzepakowy i ocet. Wlewamy na dno słoika.",
    "Będziemy warstwami układać śledzie i cebulkę.Pierwsza warstwa cebulka, następnie pokrojone na kawałki śledzie. Znowu cebulka i tak na zmianę.",
    "Taka porcja wystarcza na słoik 1,25 litra, Można zrobić w dwóch mniejszych.",
    "Śledzie i oczywiście warstwa je przykrywająca smakują najlepiej po dwóch trzech dniach.",
    "Takie danie możemy spokojnie zrobić na kilka dni przed świętami. Oby tylko wytrzymały do świąt.",
    "Polecam również: Śledzie z pysznie przyrządzoną cebulką:",
    "http://wkuchennymoknieewy.blogspot.com/2014/11/sledzie-w-doskonale-przyrzadzonej.html"
  ],
  "ingredients": [
    "0",
    "1 kg. śledzi -matiasy",
    "4 cebule- duże",
    "20 dag.dag rodzynek",
    "mały słoiczek koncentratu pomidorowego",
    "2 łyżeczki musztardy delikatesowej",
    "1 łyżka oleju do smażenia",
    "Dodatkowo do słoika: 1/4 szklanki oleju ( np rzepakowy z Lidla tłoczony na zimno) 3 łyżki octu winnego jabłkowego"
  ],
  "__v": 1
}