{
  "hash": "fb54aef4ef2aa9b609c3ce718b6dec321470a557",
  "title": "Tich's Chicken Tikka Masala",
  "image": "//media.foodnetwork.ca/recipetracker/5440049e-8047-49d5-8165-85da8321e689_tichs-chicken-tikka-masala_WebReady.jpg",
  "href": "https://www.foodnetwork.ca/recipe/tichs-chicken-tikka-masala/18981/",
  "extension": "Chrome",
  "firstAdded": "2018-08-21T11:51:52.026000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To make a marinade for the chicken, stir together yogurt, ginger garlic paste, red chili powder, garam masala, dried fenugreek, and salt.",
    "Submerge chicken in the marinade; cover and refrigerate for 6 to 8 hours. Add chicken pieces to the bowl and submerge them in the marinade; cover and refrigerate for 6 to 8 hours.",
    "Once chicken is done marinating, preheat barbecue or oven to 400ºF.",
    "Remove chicken from marinade and slide onto skewers.",
    "Grill chicken for 6 to 7 minutes; flip and continue grilling for 6 to 8 minutes, until chicken is no longer pink in the centre.",
    "Set chicken aside while you make the gravy.",
    "1. Heat 1 tablespoon of cooking oil in a large saucepan over medium low heat until oil starts to shimmer.",
    "2. Stir in whole cumin and coriander; heat until spices start to sputter.",
    "3. Add garlic and half of the white onion (1 cup); stir and cook over medium low heat for 12 minutes, until onions are soft and caramelized.",
    "4. Once onions have softened, add ginger garlic paste and chopped tomatoes; continue stirring and cooking for 1 to 2 minutes.",
    "5. Stir in a pinch of salt, turmeric powder, red chili powder, dried fenugreek, garam masala, and cumin; continue stirring and cooking for 2 to 3 minutes.",
    "6. Slide the cooked chicken off the skewers into the pan and add butter, cream, honey, ginger, and cilantro.",
    "7. Simmer chicken in the sauce for 3 to 4 minutes.",
    "8. In a separate pan, heat oil over medium heat.",
    "9. Add peppers and the reserved onions (1 cup) to the pan; stir and cook for 1 to 2 minutes.",
    "10. Transfer peppers and onions into the pan with the chicken and simmer sauce over medium low heat for an additional 2 minutes.",
    "11. Divide chicken and sauce between serving dishes, sprinkle with chopped cilantro, and serve with basmati rice or warm naan bread.",
    "1",
    "Special Equipment: Skewers, barbecue (optional)Chicken must marinate for 6 to 8 hours.",
    "2",
    "Courtesy of Sujoy Saha and Mandy Jawle of Tich"
  ],
  "ingredients": [
    "0",
    "1 cup plain yogurt",
    "1 Tbsp ginger garlic paste",
    "½ tsp red chili powder",
    "½ tsp garam masala",
    "½ tsp dried fenugreek",
    "2 lb(s) boneless chicken breasts",
    "1 pinch salt",
    "1 tsp whole cumin",
    "1 tsp whole coriander",
    "3 cloves garlic, finely chopped (1 Tbsp)",
    "3 white onions, finely chopped (2 cups)",
    "1 Tbsp ginger garlic paste",
    "4 large tomatoes, finely chopped (2 cups)",
    "1 tsp turmeric powder",
    "½ tsp red chili powder",
    "½ tsp dried fenugreek",
    "½ tsp garam masala",
    "1 tsp ground cumin",
    "1 Tbsp butter",
    "½ cup cream",
    "1 tsp honey",
    "1 Tbsp chopped ginger",
    "2 Tbsp chopped cilantro, plus more for plating",
    "½ red bell pepper, sliced (1/2 cup)",
    "½ green bell pepper, sliced (1/2 cup)",
    "Salt",
    "Vegetable oil, for frying",
    "Basmati rice (optional)",
    "Naan, warmed (optional)"
  ],
  "__v": 1
}