{
  "hash": "89c6d988ecb1d650d573918b13eb01dd1fc4b884",
  "title": "Mango Curry Tofu from Vegan Richa's Indian Kitchen",
  "image": "http://ohmyveggies.com/wp-content/uploads/2015/07/Yu_F7nrFKjy-0Z4nj19-iIkssVjeIDLlhri4qY24LLE.jpeg",
  "href": "http://ohmyveggies.com/mango-curry-tofu-from-vegan-richas-indian-kitchen/",
  "extension": "Firefox",
  "firstAdded": "2015-08-16T19:36:02.789000",
  "users": [
    null
  ],
  "keywords": [
    "firm",
    "tofu",
    "safflower",
    "neutral",
    "oil",
    "cayenne",
    "cinnamon",
    "garam",
    "masala",
    "salt",
    "red",
    "onion",
    "knob",
    "ginger",
    "garlic",
    "water",
    "cumin",
    "seeds",
    "bay",
    "leaves",
    "canned",
    "culinary",
    "coconut",
    "milk",
    "mango",
    "pulp",
    "puree",
    "lightly",
    "sweetened",
    "apple",
    "cider",
    "vinegar",
    "generous",
    "black",
    "pepper",
    "cilantro"
  ],
  "directions": [
    "0",
    "Cut the tofu slab into 1/2-inch slices. Place them on a clean kitchen towel. Cover with another kitchen towel. Place a 10-pound (approximate) weight on top and let sit for 10 minutes. (Alternatively, you can use pressed tofu.) Cut the tofu slices into 1/2-inch cubes.",
    "Heat the oil in a large skillet over medium heat. When the oil is hot, tilt the skillet so the oil coats it evenly. Add the tofu and cook until lightly brown on some sides, stirring occasionally, 4 minutes. Add the cayenne, cinnamon, garam masala, and salt and mix well to coat. Cook for another 2 minutes and set aside.",
    "In a blender, combine the onion, ginger, and garlic and blend into a smooth puree with 2 tablespoons of water. Heat the oil in a large skillet over medium heat. When the oil is hot, add the cumin seeds, bay leaves, and cloves. Cook for 1 minute. Add the pureed onion and cook until",
    "the onion mixture is dry and does not smell raw. Stir occasionally to avoid sticking, 13 to 15",
    "minutes. Add the coconut milk, mango pulp, salt, and vinegar and mix well. Add the tofu and all",
    "the spices from the tofu skillet to the sauce skillet. Add a dash of black pepper.",
    "Mix, cover and cook until the sauce comes to a boil, 5 minutes. Reduce the heat to low and",
    "cook uncovered until the sauce thickens and desired consistency is achieved, about 15 minutes. Taste and adjust the salt and tang. Add 1/2 teaspoon or more sugar if the mango pulp was not sweet. Garnish with cilantro and a dash of garam masala and serve hot."
  ],
  "ingredients": [
    "0",
    "14 ounces firm tofu",
    "2 teaspoons safflower or other neutral oil",
    "1/4 teaspoon cayenne",
    "1/4 teaspoon ground cinnamon",
    "1/2 teaspoon Garam Masala",
    "1/4 teaspoon salt",
    "3/4 cup chopped red onion",
    "1 (1-inch) knob of ginger",
    "3 cloves garlic",
    "2 tablespoons water",
    "1 teaspoon safflower or other neutral oil",
    "1/4 teaspoon cumin seeds",
    "2 bay leaves",
    "4 cloves",
    "1 1/4 cups canned or culinary coconut milk",
    "3/4 cup ripe mango pulp or puree (unsweetened or lightly sweetened canned)",
    "1/2 teaspoon salt",
    "2 teaspoons apple cider vinegar",
    "Generous dash of black pepper",
    "1/4 teaspoon Garam Masala, for garnish",
    "2 tablespoons chopped cilantro, for garnish"
  ],
  "__v": 1
}