{
  "hash": "a9a097f670ce6d49b7e900967f33ebbf47c7477f",
  "title": "Oatmeal Cranberry Sandwich Cookies with White Chocolate Creme Filling",
  "image": "http://www.twopeasandtheirpod.com/wp-content/uploads/2013/09/Oatmeal-Cranberry-Sandwich-Cookies-with-White-Chocolate-Creme-Filling-13.jpg",
  "href": "http://www.twopeasandtheirpod.com/oatmeal-cranberry-sandwich-cookies-with-white-chocolate-creme-filling/",
  "extension": "Chrome",
  "firstAdded": "2016-09-22T21:50:23.158000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To make the cookies, preheat the oven to 375 degrees F. Line a large baking sheet with a Silpat baking mat or parchment paper and set aside.",
    "In a medium bowl whisk together the flour, salt, baking powder, baking soda, and cinnamon. Set aside.",
    "Using a mixer, beat the butter and sugars together until smooth and creamy. Mix in the egg and vanilla. Slowly add the dry ingredients. Mix until just combined. Stir in the oats and dried cranberries.",
    "Roll cookie dough into tablespoon size balls and place on prepared cookie sheet. Bake for 10 minutes or until light golden brown. Let cookies cool on the baking sheet for two minutes. Transfer to a cooling rack and cool completely.",
    "While the cookies are cooling, make the white chocolate buttercream. Place white chocolate chips in a microwave-safe bowl and heat in 30-second intervals until chips begin to melt, about 1 minute. Stir and repeat, heating chips about 10 seconds at a time, until thoroughly melted. Stir until chocolate is smooth and no more lumps remain. Beat butter with an electric mixer on medium speed in a mixing bowl until fluffy. Beat in half of the powdered sugar, melted white chocolate, vanilla and milk until mixture is smooth and creamy.Slowly beat in remaining powdered sugar until smooth; if frosting is too stiff, add in a little more milk.",
    "To make the sandwich cookies, spread or pipe white chocolate buttercream on the inside of one cookie. Top with another cookie. Continue making sandwich cookies. Store cookies in an air-tight container at room temperature.",
    "Note-you may have extra buttercream, depending on how much you add between each cookie. You can keep the leftover buttercream in the fridge for up to a week."
  ],
  "ingredients": [
    "0",
    "1 1/4 cups all-purpose flour",
    "1/4 teaspoon salt",
    "1/2 teaspoon baking powder",
    "1/2 teaspoon baking soda",
    "1/2 teaspoon ground cinnamon",
    "1/2 cup unsalted butter, at room temperature",
    "1/2 cup brown sugar",
    "1/2 cup granulated sugar",
    "1 large egg",
    "1 teaspoon vanilla extract",
    "1 1/4 cups old fashioned oats",
    "1 cup of dried cranberries",
    "For the White Chocolate Buttercream:",
    "2 cups white chocolate chips",
    "1 cup unsalted butter, at room temperature",
    "3-4 cups powdered sugar",
    "1 teaspoon vanilla extract",
    "2 tablespoons milk, or as needed"
  ],
  "__v": 1
}