{
  "hash": "3a09d39fedf25b454dc47662ed5ef7b5f784a45a",
  "title": "FRIED CHICKEN (LIKE KFC)",
  "image": "http://img.cooks.com/i/rec/_mg_0559-200a.jpg",
  "href": "http://www.cooks.com/recipe/4m7pc9ii/fried-chicken-like-kfc.html",
  "extension": "Firefox",
  "firstAdded": "2015-06-14T11:27:55.167000",
  "users": [
    null
  ],
  "keywords": [
    "eggs",
    "milk",
    "flour",
    "bread",
    "crumbs",
    "knorr",
    "chicken",
    "bouillon",
    "salt",
    "garlic",
    "onion",
    "paprika",
    "bell",
    "seasoning",
    "sage",
    "parsley",
    "pressed",
    "soy",
    "black",
    "pepper",
    "wondra",
    "separate",
    "precoating",
    "nonhydrogenated",
    "crisco",
    "peanut",
    "oil",
    "frying",
    "pieces"
  ],
  "directions": [
    "0",
    "In a small bowl beat the egg, milk, and soy sauce, then stir in 1/2 tsp. Knorr chicken bouillon (save the other 1/2). Put the garlic cloves through a garlic press and add into the egg mixture. Add half of the parsley and 1 tablespoon Wondra flour. Stir well.",
    "In a separate bowl, combine the 1 cup flour and the bread crumbs, and the remaining ingredients. Mix well with a fork.",
    "Put about 1/2 cup additional flour in a separate small bowl. Use this to dip each chicken piece, prior to dipping in the milk and seasonings.",
    "Roll each piece of chicken around until well covered, first in plain flour, then in milk mixture, then in flour/bread crumbs mixture.",
    "Gently lower the chicken pieces into the hot oil and allow to become a golden color (add the bigger pieces first).",
    "1",
    "Remove from heat after about 7 minutes and reduce pressure following manufacturer's directions. Remove the chicken pieces and place on layers of paper towels. Return the pan to the stove and bring temperature back up and continue until all chicken pieces are fried. If your chicken was too brown, cook the next batch for a minute or so less, and vice-versa if your chicken wasn't browned enough. Do not overload the cooker with too many pieces, as it brings the temperature down too quickly and will cause the pieces to absorb more of the cooking oil than it otherwise would.",
    "2",
    "Cooks Tip: To flavor the oil in this method, you can thickly slice a few large onions and add to the oil before the chicken - skim these out when they are browned, before adding the chicken. It will add an additional layer of flavor to the oil!"
  ],
  "ingredients": [
    "0",
    "2 eggs, beaten",
    "1 1/2 cups milk",
    "1 cup flour",
    "3/4 cup fine bread crumbs",
    "1 tsp. Knorr chicken bouillon",
    "1/2 tsp. salt",
    "1/2 tsp. garlic powder (not salt)",
    "1/4 tsp. onion powder (not salt)",
    "1/2 tsp. paprika",
    "1/3 tsp. Bell Seasoning or pinch ground sage",
    "1 tbsp. freshly chopped parsley",
    "2 large cloves garlic, pressed",
    "1/2 tsp. soy sauce",
    "1 tsp. black pepper",
    "1 tbsp. Wondra flour",
    "additional flour for separate pre-coating",
    "5-6 cups non-hydrogenated Crisco or peanut oil",
    "1 frying chicken, cut in pieces"
  ],
  "__v": 1
}