{
  "hash": "75e15d6b677404d735546f57aa18d5711ddd747b",
  "title": "πίτσα",
  "image": "http://eyzin.minedu.gov.gr/PublishingImages/Lists/Articles_Parents/9467-shutterstock_109359464.jpg",
  "href": "http://eyzin.minedu.gov.gr/Pages/Parents/Cooking/StinKouzina_SyntagesSV.aspx?ArticleID=77",
  "extension": "Chrome",
  "firstAdded": "2016-01-09T12:18:02.163000",
  "users": [
    null
  ],
  "keywords": [],
  "directions": [
    "0",
    "Εκτέλεση:",
    "Για τη βάση της πίτσας:",
    "Διαλύετε τη μαγιά σε 350 ml χλιαρό νερό και προσθέτετε λίγη ζάχαρη. Την αφήνετε 5-10 λεπτά και στη συνέχεια την αδειάζετε σε ένα μεγάλο μπολ. Ρίχνετε το αλεύρι λίγο-λίγο και προσθέτετε το ελαιόλαδο, το αλάτι, λίγη ρίγανη και θυμάρι. Αλείφετε τα χέρια σας με λίγο ελαιόλαδο και ζυμώνετε το μίγμα για 5-10 λεπτά. Προσθέτετε λίγο επιπλέον αλεύρι εάν χρειάζεται. Στη συνέχεια, αφήνετε το μίγμα, σκεπασμένο με μια πετσέτα σε ένα ζεστό μέρος για να φουσκώσει, για περίπου 30-45 λεπτά. Αφού φουσκώσει, χωρίζετε τη ζύμη σε 2 κομμάτια και με τον πλάστη φτιάχνετε 2 πίτσες (με περίπου 35-40 εκατοστά διάμετρο η καθεμία), τις οποίες τοποθετείτε σε λαδόκολλα. Τρυπάτε με ένα πιρούνι τις ζύμες σε διάφορα σημεία.",
    "Για τη σάλτσα ντομάτας:",
    "Τρίβετε με έναν τρίφτη το κρεμμύδι και τις ντομάτες ξεχωριστά, από τις οποίες έχετε αφαιρέσει τη φλοίδα και τους σπόρους. Σε ένα κατσαρολάκι προσθέτετε το ελαιόλαδο και τσιγαρίζετε λίγο το κρεμμύδι. Προσθέτετε τις τριμμένες ντομάτες και τη ζάχαρη. Αφήνετε να πάρει μια βράση και στη συνέχεια χαμηλώνετε τη φωτιά. Αφήνετε να σιγοβράσει για περίπου ½ ώρα με το καπάκι ανοιχτό, ώστε να φεύγουν τα πολλά υγρά. Προς το τέλος, προσθέτετε το αλάτι και τα άλλα μυρωδικά.",
    "Για τη γέμιση:",
    "Αλείφετε κάθε πίτσα με τη σάλτσα ντομάτας που έχετε παρασκευάσει. Προσθέτετε όλα τα υλικά που επιθυμείτε: τυρί, γαλοπούλα, μανιτάρια, πιπεριά και άλλα λαχανικά.",
    "Ψήνετε σε προθερμασμένο φούρνο στους 220 °C για 20-30 λεπτά μέχρι να ψηθεί η ζύμη της πίτσας και να λιώσει το τυρί."
  ],
  "ingredients": [
    "0",
    "Υλικά:",
    "Για τη βάση της πίτσας (υλικά για 2 πίτσες):",
    "500 γρ. σταρένιο αλεύρι",
    "25 γρ. νωπή μαγιά",
    "1 πρέζα ζάχαρη",
    "1 κ.γ. αλάτι",
    "3 κ.σ. ελαιόλαδο",
    "Λίγη ρίγανη, θυμάρι",
    "Για τη σάλτσα ντομάτας (υλικά για 2 πίτσες):",
    "4 ντομάτες αποφλοιωμένες χωρίς σπόρους",
    "1 μέτριο κρεμμύδι",
    "2-3 κ.σ. ελαιόλαδο",
    "½ κ.γ. ζάχαρη",
    "Λίγη ρίγανη, θυμάρι, αλάτι, πιπέρι",
    "Για τη γέμιση:",
    "Μοτσαρέλα φρέσκια (150 γρ για κάθε πίτσα)",
    "Μοτσαρέλα ημίσκληρη (5-6 φέτες)",
    "Γαλοπούλα βραστή (4-5 φέτες σε κάθε πίτσα)",
    "Φρέσκα μανιτάρια κομμένη",
    "Πιπεριά κομμένη",
    "Προαιρετικά άλλα λαχανικά: ντοματίνια, κρεμμύδι"
  ],
  "__v": 1
}