{
  "hash": "2599cfdddad113b21544e7e2b4420eebd74ab21c",
  "title": "BOSTON CREAM CUPCAKES",
  "image": "https://www.browneyedbaker.com/wp-content/uploads/2013/09/boston-cream-cupcakes-26-754.jpg",
  "href": "https://www.browneyedbaker.com/boston-cream-cupcakes-recipe/",
  "extension": "Chrome",
  "firstAdded": "2018-01-02T16:54:37.221000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS:",
    "Make the Pastry Cream: Heat the heavy cream in a medium saucepan over medium heat until simmering, stirring occasionally. Meanwhile, whisk the egg yolks, sugar and salt together in a medium bowl. Add the cornstarch and whisk until the mixture is pale yellow and thick, about 15 seconds.",
    "When the cream reaches a full simmer, slowly whisk it into the yolk mixture. Return the mixture to the saucepan and cook over medium heat, whisking constantly, until thick and glossy, 1 to 2 minutes. Remove the pan from the heat and whisk in the butter and vanilla extract until the butter is completely melted. Transfer the pastry cream to a small bowl and press plastic wrap directly on the surface. Refrigerate until set, at least 2 hours or up to 2 days.",
    "Make the Cupcakes: Preheat oven to 350 degrees F. Line two standard 12-cup muffin pans with paper liners and set aside.",
    "In the bowl of a stand mixer, combine the flour, sugar, baking powder and salt on low speed. Add the butter one piece at time and mix until the mixture resembles coarse sand. Add the eggs, one at a time, scraping down the sides and bottom of the bowl after each addition. Add the milk and vanilla extract, increase the speed to medium, and mix until light and fluffy and no lumps remain, about 3 minutes, stopping to scrape the sides and bottom of the bowl halfway through.",
    "Fill the muffin cups three-quarters full and bake until a toothpick inserted into the center of a cupcake comes out clean, 18 to 20 minutes. Let the cupcakes cool in the pan for 5 minutes, then transfer them to a wire rack to cool completely.",
    "Make the Glaze: Combine the heavy cream, corn syrup, chocolate and vanilla in a small saucepan over medium heat, stirring constantly, until smooth. Set the glaze aside to cool and thicken at room temperature for 30 minutes.",
    "Assemble the Cupcakes: Using a paring knife, cut into the center of the cupcake at a 45-degree angle about ⅛-inch from the edge and cut all the way around. Remove the cone and cut away all but the top ¼ inch, leaving a small disk of cake.",
    "Fill the inside of each cupcake with pastry cream and top with the disk of cake. Spoon the chocolate glaze over top of each cupcake, covering the top completely. Refrigerate the cupcakes until the glaze is set, about 10 minutes. The cupcakes can be refrigerated in an airtight container for up to 2 days; bring to room temperature before serving."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS:",
    "For the Pastry Cream",
    "1⅓ cups (320 ml) heavy cream",
    "3 egg yolks",
    "⅓ cup (66 grams) granulated sugar",
    "Pinch of salt",
    "4 teaspoons cornstarch",
    "2 tablespoons unsalted butter, chilled and cut into 2 pieces",
    "1½ teaspoons vanilla extract",
    "For the Cupcakes",
    "1¾ cups (248 grams) all-purpose flour",
    "1 cup (198 grams) granulated sugar",
    "1½ teaspoons baking powder",
    "¾ teaspoon salt",
    "12 tablespoons (170 grams) unsalted butter, softened but still cool, cut into 12 pieces",
    "3 eggs",
    "¾ cup (180 ml) whole milk",
    "1½ teaspoons vanilla extract",
    "For the Chocolate Glaze",
    "¾ cup (180 ml) heavy cream",
    "¼ cup (78 grams) light corn syrup",
    "8 ounces bittersweet chocolate, finely chopped",
    "½ teaspoon vanilla extract"
  ],
  "__v": 1
}