{
  "hash": "ee0b4302dcc52664b48b246086d59cde7ab0aa79",
  "title": "Overloaded Double Baked Mexican Potatoes",
  "image": "https://patijinich.com/wp-content/uploads/2016/10/Mexican-Overloaded-Double-Baked-Potatoes-912x622.jpg",
  "href": "https://patijinich.com/recipe/overloaded-double-baked-mexican-potatoes-2/",
  "extension": "Chrome",
  "firstAdded": "2017-10-29T13:10:44.685000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400 degrees Fahrenheit.",
    "Using a fork, pierce potatoes all around, about 6 to 8 times. Rub potatoes with olive oil, season with salt, and place on a baking sheet. Bake for 1 hour until tender on the inside and crisp on the outside.",
    "In a medium skillet set over medium heat, cook the bacon until crisp and lightly browned. Transfer to a paper-towel-lined plate and set aside.",
    "In a small bowl, mix the crema with the sauce from chipotles in adobo and minced chiles, if using (I do!). Set aside.",
    "Remove the potatoes from the oven. Using a knife, cut each one open lengthwise and carefully push the ends together, causing the center to open. Scoop out a couple spoonfuls of the cooked potato meat from each and transfer to a bowl. Sprinkle with salt and mix well.",
    "Inside the scooped potatoes, layer a spoonful of the chipotle crema mixture, a spoonful of grated cheese and a spoonful of the seasoned potato meat. Repeat with the crema, cheese and potato meat. End with a bit of crema and cheese.",
    "Raise the oven temperature to 500 degrees, or turn on the broiler. Place the stuffed potatoes back on the baking sheet. Return to the oven for 5 more minutes until the cheese has completely melted and has started to crisp. Remove from the oven, sprinkle with bacon and serve immediately."
  ],
  "ingredients": [
    "0",
    "2largerussett potatoesrinsed and scrubbed",
    "2teaspoonsolive oil",
    "5thick slicesbaconcoarsely chopped",
    "3/4cupMexican crema",
    "3tablespoonsadobo saucefrom chipotles in adobo",
    "2chipotle chiles in adobo sauce(optional)",
    "1/2teaspoonkosher or coarse sea saltplus more to season potatoes",
    "1/2cupOaxaca cheesegrated"
  ],
  "__v": 1
}