{
  "hash": "cd2ffc4083bcb4d9f3da26fa002c40fb17b95913",
  "title": "Southwest Stuffed Chicken Breast with Pepper Jack Cheese",
  "image": "http://thecozyapron.com/wp-content/uploads/2015/08/southwest-stuffed-chicken-breast_thecozyapron_08-02-2015_7.jpg",
  "href": "http://thecozyapron.com/southwest-stuffed-chicken-breast/",
  "extension": "Chrome",
  "firstAdded": "2017-04-11T10:49:43.657000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "-Place the chicken breasts into a medium-size bowl, and add in all of the ingredients beginning with the olive oil, up to and including the black pepper, and toss to season the meat well; marinate the chicken for at least 20 minutes, or even overnight, if preparing ahead.",
    "-Once chicken in marinated, preheat your oven to 350°, and line a baking sheet with foil and top with a wire rack.",
    "-Preheat your grill pan over medium-high heat, and drizzle in about 1-2 tablespoons of oil; once hot, add in the chicken breasts (work in a couple of batches, if necessary) and grill them for about 3 minutes per side, or just until golden on the outside (the chicken will not be cooked through at this point, which is fine.)",
    "-Once the chicken is cool enough to handle, make a pocket in the thickest part of the breast, taking care not to cut all the way through, but just creating a large enough of pocket to stuff with filling; add a generous ¼ cup of the cheese, then a couple of tablespoons each of the black beans and corn, and then a few slices of the roasted red peppers.",
    "-Use a couple of toothpicks to secure the opening, and place the stuffed breasts onto the wire rack, and place into the oven to bake for about 8-10 minutes, or until the chicken is cooked through and the cheese is melty.",
    "-Top each stuffed chicken breast with some of the Pico de Gallo, plus a few cilantro leaves, if desired, and a slice/wedge of lime, for garnish."
  ],
  "ingredients": [
    "0",
    "• 4 skinless, boneless chicken breasts (tenderloins removed and saved for another use)",
    "• 3 tablespoons olive oil, plus more for grill pan",
    "• 1 teapsoon lime zest",
    "• 1-1 ½ teaspoons lime juice",
    "• 1 teaspoon salt",
    "• 1 teaspoon dried oregano",
    "• 1 teaspoon ground cumin",
    "• 1 teapsoon paprika",
    "• ½ teaspoon granulated onion",
    "• ½ teaspoon granulated garlic",
    "• ½ teaspoon ground coriander",
    "• Pinch black pepper",
    "• 1 ¼ cup shredded pepper jack cheese",
    "• ½ cup black beans",
    "• ½ cup corn kernels",
    "• ¼ cup sliced roasted red peppers (from jar)",
    "• Pico de Gallo (prepared), for garnish",
    "• Cilantro leaves, for garnish",
    "• Lime slices/wedges, for garnish"
  ],
  "__v": 1
}