{
  "hash": "65743925de0fc23e43175020144bc8fbb9de8eff",
  "title": "Slow Cooker Mexican Quinoa",
  "image": "https://www.chelseasmessyapron.com/wp-content/uploads/2014/10/Slow-Cooker-Mexican-Quinoa-150x150.jpg",
  "href": "https://www.chelseasmessyapron.com/slow-cooker-mexican-quinoa/",
  "extension": "Chrome",
  "firstAdded": "2017-11-17T16:42:18.763000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Spray your slow cooker with nonstick spray. Be generous!! I use a relatively new (5 years old) 6-quart crockpot for this recipe. Older crockpots don't always cook as quickly or the same temperature throughout the whole crockpot.",
    "Peel and deseed the butternut squash. Cut it into cubes and place in the slow cooker.",
    "Add in the corn, drained and rinsed black beans, rinsed quinoa (I rinse mine in a fine mesh sieve), minced garlic, undrained fire-roasted petite diced tomatoes, diced jalapeno (if desired), the 2 cans of enchilada sauce (make sure you have the right ounce amount - these are the large cans), the vegetable or chicken broth, and the packet of taco seasoning.",
    "Give everything a really good stir, cover and cook on high for 3-4 hours or until the quinoa is cooked and the butternut squash is tender.",
    "Remove the lid and stir everything together really well. Allow the liquid to absorb while on low for another 30 minutes or until mostly absorbed.",
    "Season with any additional spices and/or salt and pepper if desired.",
    "Top bowls with optional toppings - some shredded cheese, fresh lime juice, sour cream, and cilantro is what we love!"
  ],
  "ingredients": [
    "0",
    "1 and 1/2poundsbutternut squash~4 cups",
    "1cupfrozen corn",
    "1can (15.25 ounces)black beansdrained and rinsed",
    "1cupuncooked quinoarinsed",
    "1teaspoonminced garlic",
    "1can (14.5 ounces)fire-roasted petite diced tomatoes",
    "1small jalapenooptional",
    "2cans (19 ounces each)mild red enchilada sauce*",
    "1cupvegetable or chicken broth",
    "1package (1.25 ounces)taco seasoning",
    "Optional toppings: shredded cheddar cheese, fresh lime juice, sour cream, chopped cilantro"
  ],
  "__v": 1
}