{
  "hash": "913aa6616498e52c880fbf320cb980d376b1e1e3",
  "title": "Key Lime Rum Cake",
  "image": "https://img.buzzfeed.com/tasty-app-user-assets-prod-us-east-1/tips/cabd2a44ccb4423b8ef7187682a2ef00.jpeg?output-quality=auto&downsize=180:*",
  "href": "https://tasty.co/recipe/key-lime-rum-cake?fbclid=IwAR1GFRuGFOdJUbVKaVobc5BPKufELM5cePN7xMOaVzaNcluwbNszNtJQzfg",
  "extension": "Chrome",
  "firstAdded": "2019-10-08T13:11:39.253000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparation",
    "Preheat the oven to 325°F (170°C). Grease a 10-12-cup bundt pan with nonstick spray. Dust the inside of the pan with flour and turn the pan to coat evenly, then shake out any excess.",
    "Make the rum cake: In a large bowl, mix together the flour, sugar, pudding mix, baking powder, salt, butter, and canola oil with an electric hand mixer on medium speed until mixture is well incorporated and looks sandy.",
    "With the mixer running on low speed, add the milk and eggs and beat until the batter is smooth. Scrape down the sides of the bowl with a spatula as needed.",
    "Add the rum, vanilla, lime juice, and lime zest and stir with a rubber spatula to incorporate.",
    "Pour the batter into prepared bundt pan, then smooth the top with a spatula.",
    "Bake the cake for 45-55 minutes, until a cake tester inserted in the center comes out clean. Let the cake cool slightly in the pan.",
    "Make the rum soak: In a medium saucepan, combine the butter, sugar, water, salt, and rum. Bring to a boil over high heat, then reduce the heat to low and simmer for 5-10 minutes, until the syrup thickens slightly. Transfer the syrup to a medium bowl and stir in the vanilla and lime juice.",
    "Use a long skewer to poke holes all over the cake. Pour about ¼ cup (60 ML) of the syrup over the cake . Allow the syrup to soak in (this may take 1-2 minutes), then continue pouring over the remaining syrup, ¼ cup at a time.",
    "Cover the pan loosely with plastic wrap and let the cake sit overnight at room temperature.",
    "When ready to serve, loosen the edges of the cake with a butter knife and invert onto a wire rack set inside a rimmed baking sheet. If the cake doesn’t release easily, place it in a 350°F oven for about 10 minutes to soften the syrup.",
    "Make the key lime glaze: In a small bowl, whisk together the powdered sugar, lime juice, and lime zest until combined.",
    "Pour the glaze over the top of the cake.",
    "Transfer the cake to a platter, then slice and serve. Leftover cake can be wrapped in plastic wrap and stored at room temperature for 3-4 days.",
    "Enjoy!"
  ],
  "ingredients": [
    "0",
    "RUM CAKE",
    "nonstick cooking spray, for greasing",
    "2 cups all purpose flour, plus more for dusting",
    "1 ½ cups granulated sugar",
    "1 box instant vanilla pudding mix",
    "2 teaspoons baking powder",
    "1 teaspoon kosher salt",
    "1 stick unsalted butter, softened",
    "½ cup canola oil",
    "½ cup milk, room temperature",
    "4 large eggs, room temperature",
    "½ cup rum",
    "2 teaspoons vanilla extract",
    "¼ cup key lime juice",
    "1 key lime zest",
    "RUM SOAK",
    "1 stick unsalted butter",
    "1 cup granulated sugar",
    "¼ cup water",
    "¼ teaspoon kosher salt",
    "½ cup rum",
    "1 teaspoon vanilla extract",
    "2 tablespoons key lime juice",
    "KEY LIME GLAZE",
    "1 ¼ cups powdered sugar, sifted",
    "3 tablespoons key lime juice",
    "key lime zest"
  ],
  "__v": 1
}