{
  "hash": "3bb463574e41d35d072c57b30da8b03b891b4ac4",
  "title": "Southwestern Kale Power Salad with Sweet Potato, Quinoa & Avocado Sauce",
  "image": "http://cookieandkate.com/images/2015/02/southwestern-kale-power-salad.jpg",
  "href": "http://cookieandkate.com/2015/southwestern-kale-power-salad/",
  "extension": "Chrome",
  "firstAdded": "2015-05-02T03:34:44.481000",
  "users": [
    null
  ],
  "keywords": [
    "quinoa",
    "bunch",
    "kale",
    "ribs",
    "pieces",
    "olive",
    "oil",
    "medium",
    "lime",
    "juiced",
    "salt",
    "potatoes",
    "cubes",
    "cumin",
    "smoked",
    "paprika",
    "avocados",
    "long",
    "strips",
    "limes",
    "jalapeo",
    "deseeded",
    "membranes",
    "roughly",
    "cilantro",
    "leaves",
    "coriander",
    "rinsed",
    "black",
    "beans",
    "crumbled",
    "feta",
    "omit",
    "vegandairyfree",
    "salad",
    "pepitas",
    "green",
    "pumpkin",
    "seeds"
  ],
  "directions": [
    "0",
    "To cook the quinoa: First, rinse the quinoa in a fine mesh colander under running water for a minute or two. In a medium-sized pot, combine the rinsed quinoa and 2 cups water. Bring the mixture to a gentle boil, then cover the pot, reduce heat to a simmer and cook for 15 minutes. Remove the quinoa from heat and let it rest, still covered, for 5 minutes. Uncover the pot, drain off any excess water and fluff the quinoa with a fork. Set it aside to cool.",
    "To cook the sweet potatoes: In a large skillet, warm the olive oil over medium heat. Add the chopped sweet potatoes and toss to coat, then add the cumin, smoked paprika and salt. Stir to combine. Once the pan is sizzling, add a scant ¼ cup water, then cover the pan and reduce heat to low to avoid burning the contents. Cook, stirring occasionally, until the sweet potato is tender and cooked through, about 10 minutes.",
    "Uncover the pan, raise the heat back to medium and cook until the excess moisture has evaporated and the sweet potatoes are caramelizing on the edges, about 3 to 7 minutes (add another little splash of olive oil if the potatoes start sticking to the pan). Set aside to cool.",
    "To prepare the kale: Transfer the kale to a large mixing bowl. Sprinkle the chopped kale with salt and use your hands to \"massage\" it, which improves the flavor. Just grab handfuls of kale in your hands and scrunch it up in your palms. Repeat until the kale is darker green in color and more fragrant. Whisk together 2 tablespoons olive oil, the juice of 1 lime and ½ teaspoon salt. Drizzle over the kale and toss to coat.",
    "To make the avocado sauce: Simply combine the ingredients as listed in a food processor or blender. Blend well and season with salt, to taste.",
    "To toast the pepitas: In a small skillet over medium-low heat, toast the pepitas, stirring frequently, until they are turning lightly golden on the edges and starting to make little popping noises, about 3 to 5 minutes.",
    "Once the quinoa has cooled down a bit, pour it into the bowl of kale and toss to combine. Divide the kale and quinoa mixture into four large salad bowls. Top with sweet potatoes, black beans, a big dollop of avocado sauce, and a sprinkle of feta and pepitas."
  ],
  "ingredients": [
    "0",
    "1 cup quinoa",
    "1 bunch kale, ribs removed and chopped into very small, bite-sized pieces",
    "2 tablespoons olive oil",
    "1 medium lime, juiced",
    "½ teaspoon salt",
    "1",
    "2 medium sweet potatoes (about 1½ pounds), sliced into small, ¼-inch cubes",
    "2 tablespoons olive oil",
    "2 teaspoons ground cumin",
    "1 teaspoon smoked paprika",
    "1½ teaspoons salt",
    "2",
    "2 avocados, sliced into long strips",
    "2 limes, juiced",
    "2 tablespoons olive oil",
    "1 medium jalapeño, deseeded, membranes removed and roughly chopped",
    "1 handful cilantro leaves",
    "½ teaspoon ground coriander, optional",
    "Salt, to taste",
    "3",
    "1 (14-ounce) can black beans, rinsed and drained, or 1½ cups cooked black beans",
    "⅓ cup crumbled feta, omit for vegan/dairy-free salad",
    "¼ cup pepitas (green pumpkin seeds)"
  ],
  "__v": 1
}