{
  "hash": "0225325a7b3c9c029a19ea973b6a191208e11e47",
  "title": "Caipirinha Plätzchen",
  "image": "http://www.daskochrezept.de/sites/default/files/styles/recipe_gallery_image/public/rezept/2012/11/50b5dbf456384.jpg",
  "href": "http://www.daskochrezept.de/rezepte/caipirinha-plaetzchen_257431.html",
  "extension": "Chrome",
  "firstAdded": "2016-11-19T15:37:38.067000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Schritt 1:",
    "Mürbteig: In einer Rührschüssel das Mehl mit dem Backpulver, Rohrzucker, Vanillezucker und der abgeriebenen Limettenschale mischen. Das Ei und die kalte Butter in kleinen Stücken hinzugeben. Alles zu einem glatten Teig verkneten und mindestens 30 Minuten in Frischhaltefolie eingepackt im Kühlschrank rasten lassen.",
    "Schritt 2:",
    "Den Backofen auf 175°C (Ober-/Unterhitze) vorheizen. Den Teig für die Caipirinha Plätzchen portionsweise aus dem Kühlschrank nehmen und zwischen zwei Lagen Frischhaltefolie ausrollen. So lassen sich die Plätzchen leichter lösen. Mit einem Plätzchenausstecher beliebige Formen ausstechen und die Plätzchen auf ein mit Backpapier ausgelegtes Backblech geben. Je nach Dicke des ausgerollten Teigs variiert die Backzeit zwischen 10-15 Minuten. Weiter verfahren, bis der Teig aufgebraucht ist. Anschließend die Plätzchen abkühlen lassen.",
    "Schritt 3:",
    "Glasur und Deko: Den Puderzucker mit Zuckerrohrschnaps (Cachaça) und Limettensaft glatt rühren. Die Caipirinha Plätzchen damit bestreichen und jeweils eine Prise Rohrzucker und etwas abgeriebene Limettenschale darüber streuen. Da die Glasur schnell trocknet, empfiehlt es sich, die Plätzchen portionsweise zu verzieren."
  ],
  "ingredients": [
    "0",
    "300 g Mehl (Typ 405)",
    "2 gestr. TL Backpulver",
    "100g",
    "Rohrzucker",
    "(braun)",
    "1 Ei",
    "150 g Butter (kalt)",
    "1 TL geriebene Limettenschale",
    "100g",
    "Puderzucker",
    "4 EL Rohrzuckerschnaps (Cachaça)",
    "2EL",
    "Limettensaft",
    "etwas geriebene Limettenschale",
    "etwas",
    "Rohrzucker",
    "(braun)"
  ],
  "__v": 1
}