{
  "hash": "85e3c2dbe500c7b701c8f81963d81a39df22c167",
  "title": "Pan Seared Salmon w/ French Green Lentils",
  "image": "https://d2k9njawademcf.cloudfront.net/indeximages/8608/original/DSC_0005.jpg?1403244392",
  "href": "http://food52.com/recipes/6314-pan-seared-salmon-w-french-green-lentils",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T22:49:43.560000",
  "users": [
    null
  ],
  "keywords": [
    "french",
    "green",
    "lentils",
    "olive",
    "oil",
    "rubbing",
    "salmon",
    "onion",
    "leek",
    "white",
    "light",
    "parts",
    "thyme",
    "salt",
    "pepper",
    "garlic",
    "celery",
    "ribs",
    "carrots",
    "chicken",
    "stock",
    "tomato",
    "red",
    "wine",
    "vinegar",
    "fillets"
  ],
  "directions": [
    "0",
    "In a medium heat proof bowl, add the lentils and cover with boiling water. Let sit for about 15-20 minutes. Drain, and set aside.",
    "In a large skillet, add 2 tablespoons of olive oil and add onions, leeks, thyme, salt, and pepper. Saute for about 10 minutes, or until onions start to soften.",
    "Add the garlic and stir until fragrant, about 1 minute or two. Add celery, carrots, chicken stock, lentils, and tomato paste. Stir until tomato paste is well incorporated and cover. Stirring occasionally, simmer for about 20-25 minutes, or until lentils are tender. Slowly stir in the vinegar until you reach the desired taste. Set aside.",
    "Preheat oven to 450 F.",
    "Heat a large oven-proof skillet over high heat. Rub both sides of salmon fillet with olive oil and season with salt and pepper. If you want a crispier skin of the salmon, make about 2-3 diagonal scores on the skin before you add it to skillet. This will create less surface area to heat and allow for the skin to crisp up faster.",
    "Place salmon fillets, skin side down, in the skillet and cook for about 2-3 minutes, or until skin is browned. Carefully flip each fillet over and transfer skillet to oven for about 5 minutes, or until pink throughout. (I'd never cooked salmon this way either, I usually just use that method for steaks, but was pleasantly surprised that the salmon came out PERFECT doing this)",
    "Serve the salmon over a mound of the lentil mixture and dig in!"
  ],
  "ingredients": [
    "0",
    "1 cup French green lentils",
    "2 tablespoons olive oil, plus more for rubbing salmon",
    "1 onion, chopped",
    "1 leek, white and light green parts only, chopped",
    "1 teaspoon dried thyme",
    "salt and pepper to taste",
    "2 cloves garlic, minced",
    "2 celery ribs, chopped",
    "2 carrots, peeled and chopped",
    "1 cup chicken stock",
    "1 tablespoon tomato paste",
    "1 tablespoon red wine vinegar",
    "2 8 oz. salmon fillets"
  ],
  "__v": 1
}