{
  "hash": "bc07a992469585be1c12fb9375bc4176d29df92d",
  "title": "Banana Pudding Icebox Cake",
  "image": "http://cf.lifeloveandsugar.com/wp-content/uploads/2015/06/Banana_Pudding_Icebox_Cake3.jpg",
  "href": "http://www.lifeloveandsugar.com/2015/06/29/banana-pudding-icebox-cake/",
  "extension": "Chrome",
  "firstAdded": "2015-07-31T00:54:49.379000",
  "users": [
    null
  ],
  "keywords": [
    "vanilla",
    "filling",
    "cream",
    "cheese",
    "softened",
    "sugar",
    "milk",
    "whipping",
    "banana",
    "dry",
    "pudding",
    "wafer",
    "cookies",
    "bananas"
  ],
  "directions": [
    "0",
    "To prepare the vanilla filling, beat cream cheese and sugar in the bowl of a mixer until smooth.",
    "Add milk and vanilla extract and beat until smooth. Set aside.",
    "To make the whipped cream, whip heavy whipping cream until it begins to thicken.",
    "Add powdered sugar and whip until stiff peaks form.",
    "Fold whipped cream into cream cheese mixture. Set aside.",
    "To prepare the banana filling, beat cream cheese and sugar in the bowl of a mixer until smooth.",
    "Add milk and beat until smooth.",
    "Add dry banana cream pudding mix and mix until smooth. Mixture will be sticky. Set aside.",
    "To make the whipped cream, whip heavy whipping cream until it begins to thicken.",
    "Add powdered sugar and whip until stiff peaks form.",
    "Fold whipped cream into banana mixture. It might seem like it won't come together at first, since the cream cheese mixture is sticky, but carefully fold the two together and they will smooth out.",
    "To layer the dessert, spread half of the banana filling evenly in the bottom of a 9 inch springform pan.",
    "Top the banana filling with half of the vanilla filling.",
    "Dip vanilla wafer cookies into the milk, one at a time, and add them in a single even layer on top of the vanilla filling.",
    "Spread a very thin layer of banana filling on top of the cookies. You should still be able to see the cookies. This layer is primarily to fill ing the gaps left around the cookies.",
    "Add a layer of sliced bananas.",
    "Top banana slices with remaining banana filling and spread into an even layer.",
    "Add remaining vanilla filling and spread into an even layer.",
    "Place pan in the fridge until firm, 4-5 hours.",
    "Once firm, remove icebox cake from springform pan and place on serving plate.",
    "Add additional heavy whipping cream to a mixer bowl and whip until it begins to thicken.",
    "Add powdered sugar and whip until stiff peaks form.",
    "Pipe whipped cream around the edges of the icebox cake and top with additional wafer cookies and banana slices."
  ],
  "ingredients": [
    "0",
    "Vanilla Filling",
    "8 oz cream cheese, softened",
    "1/2 cup sugar",
    "1/8 cup milk",
    "1 tbsp vanilla extract",
    "1 cup heavy whipping cream",
    "1/2 cup powdered sugar",
    "Banana Filling",
    "8 oz cream cheese, softened",
    "1/2 cup sugar",
    "1/4 cup + 2 tbsp milk",
    "3.4 oz package of dry banana cream pudding mix",
    "1 1/2 cup heavy whipping cream",
    "3/4 cup powdered sugar",
    "Additional Ingredients",
    "Vanilla Wafer Cookies",
    "1/2 cup milk",
    "3-4 Bananas",
    "1/2 cup heavy whipping cream",
    "1/4 cup powdered sugar"
  ],
  "__v": 1
}