{
  "__v": 5,
  "directions": [
    "0",
    "Put your griddle pan on a high heat. Halve and deseed your pepper and cut it into thin strips. Peel, halve, and finely slice your onion. Slice your chicken lengthways into long strips roughly the same size as your pepper strips.",
    "Put the peppers, onion, and chicken into a bowl with the paprika and cumin. Squeeze over the juice of half a lime, drizzle over a lug of olive oil, season with a good pinch of pepper and mix well. Put to one side to marinate for 5 minutes or so while you make your salsa.",
    "Finely chop your chilli. Roughly chop your tomatoes and the coriander, stalks and all. Put the chilli and tomatoes into a second bowl with the salt and pepper and the juice of 1 lime, then stir in your chopped coriander.",
    "Use a pair of tongs to put all the pieces of pepper, onion, and chicken into your preheated pan to cook for 6 to 8 minutes until the chicken is golden and cooked through. As the pan will be really hot, keep turning the pieces of chicken and vegetables over so they don't burn – you just want them to lightly chargrill to give you a lovely flavour. Give the pan a little love and attention and you'll be laughing.",
    "To make the guacamole, squeeze a handful of cherry tomatoes onto a board. Finely chop up the flesh with ½ -1 red chilli and a handful of coriander leaves, including the top part of the stalks.",
    "Halve and stone the avocado, then squeeze it over a board so the flesh comes out of the skin. Discard the skin. Squeeze over the lime juice and chop everything together until fine. Taste and adjust the flavours, if needed.",
    "Warm your tortillas up in a microwave or a warm dry frying pan. Divide your warmed tortillas between your serving plates. Halve your remaining lime and squeeze the juices over the sizzling pan.",
    "At the table, carefully help yourselves to the chicken and vegetables straight from the hot grill pan. Just be sure to put it down on top of something that won't burn, like a chopping board. Serve with bowls of natural yogurt and guacamole alongside your Cheddar, a grater, and your lovely fresh salsa."
  ],
  "firstAdded": "2014-07-27T20:35:20.677000",
  "hash": "9fd5c8ea1744a2a6e538312103fab858713fb5ba",
  "href": "http://www.jamieoliver.com/recipes/chicken-recipes/chicken-fajitas-with-homemade-guacamole-and-salsa",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/127_1_1350895911_lrg.jpg",
  "ingredients": [
    "0",
    "1 red pepper",
    "1 medium red onion",
    "1 skinless, boneless higher-welfare chicken breasts",
    "1 teaspoon smoked paprika",
    "1 small pinch of ground cumin",
    "2 limes",
    "olive oil",
    "freshly ground black pepper",
    "4 small flour tortillas, or 2 large",
    "150 ml good quality fat-free natural yoghurt",
    "50 g Cheddar cheese",
    "For the salsa",
    "½-1 fresh red chilli, to your taste",
    "15 ripe cherry tomatoes",
    "1 small bunch fresh coriander",
    "sea salt",
    "freshly ground black pepper",
    "1 lime",
    "extra virgin olive oil",
    "For the guacamole",
    "1 small handful of mixed-colour cherry tomatoes",
    "½-1 fresh red chilli",
    "a few sprigs of fresh coriander",
    "1 ripe avocado",
    "1 lime"
  ],
  "keywords": [
    "red",
    "pepper",
    "medium",
    "onion",
    "skinless",
    "boneless",
    "higherwelfare",
    "chicken",
    "breasts",
    "smoked",
    "paprika",
    "cumin",
    "limes",
    "olive",
    "oil",
    "black",
    "flour",
    "tortillas",
    "good",
    "quality",
    "fatfree",
    "natural",
    "yoghurt",
    "cheddar",
    "cheese",
    "salsa",
    "chilli",
    "cherry",
    "tomatoes",
    "bunch",
    "coriander",
    "salt",
    "lime",
    "extra",
    "virgin",
    "guacamole",
    "mixedcolour",
    "sprigs",
    "avocado"
  ],
  "title": "Chicken fajitas with homemade guacamole & salsa",
  "users": [
    null
  ]
}