{
  "hash": "72b1b745782a7e244ab79640cfe030c2a7e5b52a",
  "title": "CELERIAC AND BACON SOUP",
  "image": "https://i.guim.co.uk/img/static/sys-images/Observer/Columnist/Columnists/2011/1/21/1295607069557/Nigel-Slater-001.jpg?w=300&q=85&auto=format&sharp=10&s=bd0f1c9c35a9eaae235c639d87676264",
  "href": "http://www.theguardian.com/lifeandstyle/2011/jan/23/nigel-slater-recipes",
  "extension": "Chrome",
  "firstAdded": "2015-10-24T11:13:07.311000",
  "users": [
    null
  ],
  "keywords": [
    "onions",
    "medium",
    "butter",
    "slice",
    "smoked",
    "bacon",
    "celeriac",
    "root",
    "thyme",
    "leaves",
    "sprigs",
    "chicken",
    "stock",
    "water",
    "litre",
    "mustard",
    "parsley",
    "bunch"
  ],
  "directions": [
    "0",
    "Peel and roughly chop the onions. Melt the butter in a large, heavy-based pan and add the onions. Let them cook for 10-15 minutes or so till translucent. As they cook, cut the bacon into short strips or dice and add them to the pan. Stirring occasionally, leave them over a moderate heat till the bacon fat is pale gold and the onions are soft.",
    "While the onions and bacon are cooking, peel and coarsely grate the celeriac, then stir into the onions. Add the thyme leaves and a little salt then pour in the stock and water. Bring to the boil, lower the heat and cover with a lid. Leave to simmer for 30 minutes then stir in the mustard. Chop the parsley then add it to the soup with a seasoning of salt and black pepper. Simmer for a further 5 minutes then remove from the heat.",
    "Remove half of the soup and blitz in a blender or food processor till almost smooth. You may need to do this in two batches. Return the liquidised soup to the remaining soup in the pan. You will probably find the result is creamy enough, but if you wish to add some cream then this is the point at which to do it. Check seasoning and serve."
  ],
  "ingredients": [
    "0",
    "onions 2 medium",
    "butter a thick slice, about 25g",
    "smoked bacon 120g",
    "celeriac 800g (one large root)",
    "thyme the leaves from 3 small sprigs",
    "chicken or vegetable stock 500ml",
    "water 1 litre",
    "grain mustard 4 tsp",
    "parsley a small bunch"
  ],
  "__v": 1
}