{
  "__v": 2,
  "directions": [
    "0",
    "Every time before using a candy thermometer, clip a candy thermometer onto a pan full of cold water and bring it to a boil (make sure the thermometer is not touching the bottom of the pan). I cheat on a lot of things, but I never cheat on this. Boiling water should read 212°. Once the water is boiling, make note of any difference in your reading, and adjust your reading accordingly when you make the candy (for example, if thermometer reads 210° in boiling water instead of 212°, then take caramel off at 242° instead of 244°). High-altitude note: If you live above 7k feet, see the high-alt info below.",
    "Line pan with parchment paper, even up the sides. Prepare any apples, pretzels, or other things you’ll be dipping. Chop any nuts or prepare any candy you’ll be sprinkling on top.",
    "Cut butter into smaller, even sized cubes for even melting. Melt over low in sauce pan.",
    "Carefully add sugar by pouring it into the center of the pan. If any sugar crystals stick to side of pan, push them down with a damp pastry brush so they do not crystallize the entire batch and make you want to cry. Stir slowly until well combined with melted butter.",
    "Add and mix in corn syrup and sweetened condensed milk (or cream).",
    "Cook and stir on medium for one minute, then to med.-high until boiling. You want to change temperatures slowly so you don’t shock the candy. Once boiling, clip on your candy thermometer (again, don’t let it touch the bottom of the pan). By the time your caramel is boiling, if you have been stirring well, you should have the butter fully blended into the caramel mixture, not separated.",
    "Reduce heat to about medium, adjusting so that you keep a moderate, steady boil. Stir frequently. I’m serious about the stirring. If you let your caramel go too long without stirring, you’ll end up with a separated, greasy batch of caramel. No good.",
    "Temperature does not raise at a steady rate, so watch thermometer closely. If you have any doubts about the accuracy of your thermometer, periodically do a test by dropping a little in cold water. When your thermometer reaches thread stage (230–233°), take out any caramel that you would like to use as dip. When thermometer reaches late soft ball stage (234–240°), dip in a few apples for caramel apples (UPDATE: Click here for a great pro tip for perfect caramel apples.)",
    "When thermometer reaches 244°, remove caramel from heat (this is low firm ball stage; reaching this stage from boiling takes me about 30 minutes with sweetened condensed milk and longer with cream, though I have had a reader reach it in less time, so watch closely).",
    "Stir in vanilla. If dipping, start immediately. If making caramels, pour the caramel into the prepared pan. Either way, take care not to burn yourself, this stuff is so so hot.",
    "Allow to cool for several hours and use a butter knife or kitchen shears to cut pieces (UPDATE: a clever reader suggested a pizza cutter, another preferred preferred her trusty Santou knife, lightly buttered, thanks Susan!). Wrap in wax paper. Or to save on cutting time, just leave the whole batch out on the counter with a knife next to it and watch it gradually disappear.",
    "And, for handy reference, here is the candy temperature list:",
    "230–233° Thread",
    "234–240° Soft ball",
    "244–248° Firm ball",
    "250–266° Hard ball",
    "High altitude: I so appreciate this note from Debbie: If you live above, 7000 feet, stop at 227 degrees! I used the NMSU E215 Guide, which I’ve found to be the best reference. I used the lowest temperature listed for chewy candies. It was the perfect temperature. I always select the lower end of the temperatures listed to take into account the extreme drying conditions of H.A!"
  ],
  "hash": "be558fa7133f2de490588b4a28092ff975e7eb6e",
  "href": "http://www.giverslog.com/?p=3168#5245267f5324ffff56000004",
  "image": "http://giverslog.com/wp-content/uploads/2009/10/amazing-homemade-caramel-candy.jpg",
  "ingredients": [
    "0",
    "1 cup butter, unsalted",
    "1 cup light corn syrup (11.5 oz)",
    "1 14-oz. can sweetened condensed milk (or substitute two cups half and half or light cream, I almost always use sweetened condensed milk b/c makes for shorter cooking time)",
    "2 1/4 cup brown sugar (14.5 oz.), white sugar is also okay, but I prefer brown",
    "1 tsp. vanilla"
  ],
  "keywords": [
    "butter",
    "unsalted",
    "light",
    "corn",
    "syrup",
    "cream",
    "use",
    "sweetened",
    "condensed",
    "milk",
    "makes",
    "shorter",
    "cooking",
    "time",
    "white",
    "sugar",
    "okay",
    "prefer",
    "brown",
    "vanilla"
  ],
  "title": "HOMEMADE CARAMEL, my failproof recipe",
  "users": [
    null,
    null
  ]
}