{
  "hash": "28cd6953f027cb4878cefd3c444fc9184375bcfa",
  "title": "Red Wine Poached Pears",
  "image": "https://www.theflavorbender.com/wp-content/uploads/2018/10/Red-Wine-Poached-Pears-Featured-200x200.jpg",
  "href": "https://www.theflavorbender.com/red-wine-poached-pears/",
  "extension": "Chrome",
  "firstAdded": "2020-04-08T19:22:42.557000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place all the ingredients (except pears) in a saucepan. Make sure the saucepan is large enough for the pears to fit snugly in there, with just enough wiggle room for the pears to submerge in the poaching liquid at an angle as well.",
    "Bring the red wine to a simmer while stirring to dissolve the sugar.",
    "When the wine comes to a simmer, strain the red wine liquid (IF YOU USED FRESH FRUITS), to remove the seeds or fruit pulp. Discard the seeds and pulp, but NOT the cloves, orange peel and cinnamon. Add the cinnamon, cloves and peel back into the liquid and return the liquid back to the saucepan. You can skip this step if you didn’t use fresh fruits with seeds and pulp.",
    "Peel the pears ONLY when the poaching liquid is ready (pears will discolor if you peel them too early).",
    "Lower the peeled pears into the poaching liquid.",
    "Let the pears poach in the liquid on medium-low heat (simmering) for 20 - 25 minutes, but rotate the pears every 5 minutes to ensure they poach evenly on all sides, including the tops of the pears.",
    "When the pears have been poached, keep them upright in the poaching liquid, and remove the saucepan from the heat and allow the pears to cool down in the poaching liquid.",
    "I prefer to serve poached pears chilled, but they can be served at room temperature as well.",
    "Before serving, remove the pears from the poaching liquid and leave them on a plate, covered with plastic wrap.",
    "Heat the remaining liquid in the saucepan, and bring it to a simmer. Simmer for a few minutes until the liquid thickens slightly into a syrup. The cooking time depends on how much liquid is left, so keep an eye on it. If the syrup is too thick, add a little water to thin it out.",
    "Serve the pears on a serving plate, and brush them a little with the syrup to make the pears look shiny (optional).",
    "Pour a little syrup over individual pears, and serve with some whipped mascarpone cheese or whipped cream."
  ],
  "ingredients": [
    "0",
    "½ cup sugar 100 g",
    "1 large piece of orange peel",
    "8 - 10 whole cloves",
    "1 stick cinnamon",
    "2 cups red wine I prefer Cabernet Sauvignon or Merlot",
    "½ cup water / orange juice see notes for more options",
    "2 tsp vanilla extract",
    "½ cup raspberries / pitted cherries / blackberries OPTIONAL",
    "3 - 6 medium sized bosc pears"
  ],
  "__v": 1
}