{
  "hash": "e00a4bee51729aefb58fcaa239a258440485f9bf",
  "title": "Spicy Black Bean & Carmelized Onion Tacos (BA)",
  "image": "http://recipe-folder.com/img/recipe-images/093/977/3877972893.jpg",
  "href": "http://recipe-folder.com/recipe/5ea6f992ad2dbf3ebfdf2cfd",
  "extension": "User Added",
  "firstAdded": "2020-04-27T15:26:10.404000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare the ingredients & make the lime sauce:",
    "Place an oven rack in the center of the oven, then preheat to 450 degrees.",
    "Cut the zucchini crosswise and into 1/2-inch rounds.",
    "Peel and thinly slice the onion.",
    "Drain and rinse the beans.",
    "Grate the 2 oz cheddar cheese.",
    "Halve the lime crosswise.",
    "Cut off and discard the ends of the radishes; halve lengthwise, then thinly slice crosswise. Place in a bowl; drizzle with olive oil and season with salt and pepper.",
    "In a bowl, combine the crema or sour cream and the juice of half a lime. Season with salt and pepper to taste.",
    "Roast the zucchini:",
    "Line a sheet pan with aluminum foil. Place the zucchini rounds on the foil. Drizzle with olive oil and season with salt and pepper; turn to coat.",
    "Arrange in an even layer and roast 12 to 14 minutes, or until lightly browned and tender when pierced with a fork.",
    "Leaving the oven on, transfer to a bowl; evenly top with the juice of the remaining lime half. Stir to coat. Cover with aluminum foil to keep warm.",
    "Reserving the sheet pan, remove and discard the foil.",
    "Make the filling:",
    "While the zucchini roasts, in a medium pot, heat 2 teaspoons of olive oil on medium-high until hot. Add the sliced onion and 1 Tbsp brown sugar. Season with salt and pepper. Cook, stirring occasionally and mashing the beans with the back of a spoon, 7 to 9 minutes or until lightly browned and softened.",
    "Add the beans, 3/4 cup of water, and up to 2 tsp chile paste. Season with salt and pepper. Cook, stirring occasionally and mashing the beans with the back of a spoon, 7 to 9 minutes, or until thickened and the beans have slightly broken down.",
    "Turn of the heat; season with salt and pepper to taste.",
    "Make the cheesy tortillas:",
    "While the beans cook, place the tortillas on the same sheet pan. Evenly top with the grated cheddar cheese; season with salt and pepper.",
    "Bake 3 to 4 minutes, or until the cheese is melted.",
    "Transfer to a work surface.",
    "Finish and serve your dish:",
    "Assemble the tacos using the cheesy tortillas, filling, seasoned radishes, and lime sauce.",
    "Serve the tacos with the roasted zucchini on the side. Garnish with the cotija cheese."
  ],
  "ingredients": [
    "0",
    "4 flour tortillas",
    "1",
    "1 15-oz can black beans",
    "2",
    "1 lime",
    "3",
    "2 tsp chipotle chile paste",
    "4",
    "1 Tbsp light brown sugar",
    "5",
    "1/4 cup Mexican crema or sour cream",
    "6",
    "1 sweet onion",
    "7",
    "1 zuchini",
    "8",
    "3 oz radishes",
    "9",
    "2 Tbsp grated cotija cheese",
    "10",
    "2 oz cave-aged cheddar cheese pieces"
  ],
  "__v": 2,
  "hidden": true
}