{
  "hash": "3aa3c09b49731bae07f16f1269974144933f2591",
  "title": "A Burger for Rachael",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2010/4/7/0/0137171_02_my-favorite-burger_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/rachael-ray/a-burger-for-rachael-recipe2.html",
  "extension": "Chrome",
  "firstAdded": "2016-10-19T22:50:45.938000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 500 degrees F.",
    "Cut 10 wedges from each potato and place on a baking sheet. Drizzle a couple tablespoons of oil over the potatoes to coat them lightly, then season with rosemary, salt and pepper, to taste, and 1 teaspoon crushed red pepper flakes. Crack a couple of garlic cloves and add to the potatoes. Roast 25 minutes, turning once. Remove from the oven, set aside and keep warm.",
    "Heat 1 tablespoon oil in a large skillet over medium-high heat. Place ground meats in a bowl and add 2 to 3 cloves of grated garlic, grill seasoning, fennel seed, 1 teaspoon crushed red pepper flakes and Worcestershire sauce. Mix the ingredients well and form into 4 patties. Make patties thinner in the center, since burgers tend to bulge as they cook. Cook burgers 5 to 6 minutes on each side.",
    "While burgers cook, slice the tomatoes and onion.",
    "In a food processor, combine capers, parsley, anchovy paste, lemon zest and olives. Turn processor on and drizzle in 3 to 4 tablespoons oil until a thick paste forms.",
    "Place the cheese on top of the burgers and allow to melt.",
    "Toast buns and place burgers on the bottoms. Top with tomato, onions and basil. Slather the bun tops with some olive tapenade and cover the burgers with bun tops. Serve with oven fries.",
    "Recipe courtesy of Rachael Ray, 2007"
  ],
  "ingredients": [
    "0",
    "4 large Idaho potatoes, scrubbed",
    "1/3 to 1/2 cup extra-virgin olive oil, divided",
    "4 to 5 sprigs fresh rosemary, finely chopped",
    "Salt and freshly ground black pepper",
    "2 teaspoons crushed red pepper flakes, divided",
    "4 to 5 cloves garlic",
    "1/2 pound ground sirloin",
    "1/2 pound ground pork",
    "1 tablespoon grill seasoning",
    "2 teaspoons fennel seed",
    "2 teaspoons Worcestershire sauce",
    "2 vine-ripe tomatoes",
    "1/2 red onion",
    "3 tablespoons capers",
    "Handful fresh flat-leaf parsley",
    "2 teaspoons anchovy paste",
    "1 teaspoon lemon zest",
    "3/4 cup pitted black or green olives",
    "4 slices sharp provolone or thinly sliced smoked mozzarella",
    "4 crusty rolls, such as sesame kaiser rolls, split",
    "10 to 12 basil leaves, torn or shredded"
  ],
  "__v": 1
}