{
  "hash": "884ebb92b19ee951654fd8d49363a17a91c3de85",
  "title": "Fallen Chocolate Cake",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/fallen-chocolate-cake",
  "extension": "Chrome",
  "firstAdded": "2016-04-11T20:50:17.017000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "butter",
    "pieces",
    "room",
    "pan",
    "sugar",
    "divided",
    "semisweet",
    "bittersweet",
    "chocolate",
    "cacao",
    "coarsely",
    "oil",
    "eggs",
    "natural",
    "cocoa",
    "vanilla",
    "kosher",
    "salt",
    "chilled",
    "cream",
    "mascarpone"
  ],
  "directions": [
    "0",
    "A 9”-diameter springform pan",
    "1",
    "Preheat oven to 350°. Lightly butter springform pan and dust with sugar, tapping out any excess.",
    "Combine chocolate, oil, and ½ cup butter in a large heatproof bowl. Set over a saucepan of simmering water and heat, stirring often, until melted. Remove bowl from saucepan.",
    "Separate 4 eggs, placing whites and yolks in separate medium bowls. Add cocoa powder, vanilla, salt, ¼ cup sugar, and remaining 2 eggs to bowl with yolks and whisk until mixture is smooth. Gradually whisk yolk mixture into chocolate mixture, blending well.",
    "Using an electric mixer on high speed, beat egg whites until frothy. With mixer running, gradually beat in ½ cup sugar; beat until firm peaks form.",
    "Gently fold egg whites into chocolate mixture in 2 additions, folding just until incorporated between additions. Scrape batter into prepared pan; smooth top and sprinkle with remaining 2 Tbsp. sugar.",
    "Bake until top is puffed and starting to crack and cake is pulling away from edge of pan, 35-45 minutes. Transfer to a wire rack and let cake cool completely in pan (cake will collapse in the center and crack further as it cools).",
    "DO AHEAD: Cake can be made 1 day ahead. Cover in pan and store airtight at room temperature.",
    "2",
    "Using an electric mixer on medium-high speed, beat cream, mascarpone, and powdered sugar in a medium bowl until soft peaks form.",
    "Remove sides of springform pan from cake. Mound whipped cream mixture in center of cake."
  ],
  "ingredients": [
    "0",
    "½ cup (1 stick) unsalted butter, cut into 1” pieces, plus more, room temperature, for pan",
    "¾ cup plus 2 Tbsp. sugar, divided, plus more for pan",
    "10 ounces semisweet or bittersweet chocolate (61%–72% cacao), coarsely chopped",
    "2 tablespoon vegetable oil",
    "6 large eggs",
    "2 tablespoon natural unsweetened cocoa powder",
    "1 teaspoon vanilla extract",
    "¾ teaspoon kosher salt",
    "1",
    "1 cup chilled heavy cream",
    "½ cup mascarpone",
    "3 tablespoon powdered sugar"
  ],
  "__v": 1
}