{
  "hash": "6fea47b8571dc92e4b80dea3f598c2a0a9b45b41",
  "title": "Karpatka ze śliwkami",
  "image": "http://kuchniaprzemka.blog.pl/files/2016/09/IMG_3161-300x225.jpg",
  "href": "http://kuchniaprzemka.blog.pl/2016/09/13/karpatka-ze-sliwkami/",
  "extension": "",
  "firstAdded": "2016-09-17T11:38:17.948000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Wykonanie:",
    "Wodę podgrzać, dodać masło, sól i zagotować. Kiedy masło się rozpuści dodać mąkę i mieszać drewnianą łyżką aż masa stanie się gładka i lśniąca. Odstawić do wystudzenia.",
    "Następnie do zimnej masy dodawać po jednym jajku i miksować na jednolitą, gładką masę.",
    "Następnym krokiem jest przygotowanie blaszek do pieczenia.",
    "Potrzebujemy dwóch jednakowych, standardowych, prostokątnych blach (25x35cm), które należy wysmarować tylko masłem.",
    "Ciasto podzielić na 2 części i rozsmarować równomiernie.",
    "Śliwki umyć, wypestkować i połówki podsmażyć na patelni z cukrem około 5 minut do momentu aż owoce puszczą delikatnie wodę.",
    "Tak przygotowane śliwki (nadmiar soku odlać) rozłożyć na przygotowanym cieście w obu blaszkach.",
    "Teraz blachy wstawić do piekarnika nagrzanego do 180 stopni Celsjusza z termoobiegiem i piec przez 30-40 minut do uzyskania złotego koloru.",
    "IMG_3148",
    "Krem:",
    "Litr mleka zagotować z cukrem waniliowym. W pozostałym mleku rozmieszać obie mąki, jajko i żółtka. Do gotującego się mleka wlać mieszaninę i ugotować budyń stale mieszając, aby nie powstały grudki. Wystudzić.",
    "Miękkie masło utrzeć z cukrem pudrem i stopniowo, po łyżce dodawać wystudzony budyń. Na koniec wlać rum i jeszcze chwile miksować.",
    "Na jedną część ciasta wyłożyć krem i przykryć drugim.",
    "Ciasto włożyć do lodówki i schłodzić. (Minimum 3 godziny, najlepiej na całą noc.)",
    "Kiedy karpatka stężeje, przed podaniem oprószyć cukrem pudrem.",
    "Smacznego :)"
  ],
  "ingredients": [
    "0",
    "Zapraszam na tradycyjne ciasto w zupełnie nowej odsłonie.",
    "Tym razem karpatka ze śliwkami.",
    "Połączenie kontrowersyjne, ale finalny efekt jest zaskakująco pyszny.",
    "Składniki:",
    "Ciasto",
    "1 szklanka wody",
    "1 szklanka mąki pszennej",
    "150g masła",
    "szczypta soli",
    "5 dużych jaj",
    "Krem",
    "1 1/4 litra mleka",
    "4 cukry waniliowe (120g)",
    "2 kopiate łyżki mąki pszennej",
    "2 kopiate łyżki maki ziemniaczanej",
    "1 jajko",
    "4 żółtka",
    "200g cukru pudru",
    "500g masła",
    "kieliszek rumu",
    "Dodatkowo",
    "500g śliwek",
    "3 łyżki cukru",
    "cukier puder do posypania"
  ],
  "__v": 1
}