{
  "hash": "d2d198ee835f042d156fbcfd4b793d03f492ab30",
  "title": "T.G.I. Friday's Jack Daniel's Grill Glaze\nBy Todd Wilbur",
  "image": "http://www.topsecretrecipes.com/images/T/xctmpSYg2G3.png",
  "href": "http://www.topsecretrecipes.com/TGI-Fridays-Jack-Daniels-Grill-Glaze-Copycat-Recipe.html",
  "extension": "Chrome",
  "firstAdded": "2017-06-01T14:41:10.358000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cut about 1/2-inch off of the top of the garlic. Cut the roots so that the garlic will sit flat. Remove the papery skin from the garlic, but leave enough so that the cloves stay together. Put the garlic into a small casserole dish or baking pan, drizzle olive oil over it, and cover with a lid or foil. Bake in a preheated 325 degrees F oven for 1 hour. Remove the garlic and let it cool until you can handle it.",
    "Combine the water, pineapple juice, teriyaki sauce, soy sauce, and brown sugar in a medium saucepan over medium/high heat. Stir occasionally until mixture boils then reduce the heat until the mixture is just simmering.",
    "Squeeze the sides of the head of garlic until the pasty roasted garlic is squeezed out. Measure 2 teaspoons into the saucepan and whisk to combine. Add the remaining ingredients to the pan and stir.",
    "Let the mixture simmer for 40 to 50 minutes or until the sauce has reduced by about 1/2 and is thick and syrupy. Make sure it doesn't boil over.",
    "Makes 1 cup of glaze.",
    "From Around The Web",
    "Ads by Adblade",
    "People Now Do This With Old Pill Bottles",
    "Why Do The Amish Keep These Practices A Secret?",
    "Take Free Online Test to get Qualified to Carry Concealed Today!",
    "5 Fatal Foods That Are Hurting You On The Inside...",
    "If You Suffer From Callused Feet, Try This Amazing Trick!",
    "20 Incredible Makeup Tricks for 'Older' Women",
    "TGIFriday's Jack Daniels Sauce",
    "Jeff",
    "Submitted on: 04/06/17",
    "Spot on to my favorite sauce to use over baby back pork ribs!!! Also excellent with Salmon, Chicken, Beef dishes & any Pork dish too, just an all around perfect sauce!!!",
    "alternate usage",
    "LC Weiss",
    "Submitted on: 01/01/17",
    "This stuff is Awesome as a Jerky mix in for ground beef.",
    "THE DAMN THING SELF",
    "Paterae",
    "Submitted on: 09/24/16",
    "Absolutely amazing! Did this to serve over my Pan Seared Salmon and it was outta this world. Exactly like TGIF. Did not roast the garlic instead sautéed the cloves and crushed them afterwards. Next up is over STEAKS! And this time I'm gonna double the recipe! I am a teetoller so had to purchase Jack Daniel Tennessee Whiskey specifically for this glaze. Thank you so much Todd for sharing your secret to TGIF 'S Jack Daniel Grill Glaze.",
    "excellent",
    "sarah",
    "Submitted on: 07/10/16",
    "I made it and its the same as TGI,,very tasty greetings from Malta",
    "TGI Friday's Jack Daniels Grill Glaze",
    "Pam",
    "Submitted on: 06/19/16",
    "SCORE!!!!!! It's right on.",
    "Scruptious",
    "Gary",
    "Submitted on: 04/08/16",
    "Thank you sooooooooo much for sharing.",
    "Amazing Glaze",
    "Chris",
    "Submitted on: 02/21/16",
    "Have made it several times. Get's better every time!! I too add a little more JD then it calls for and a little more crushed pineapple. Have people requesting jars of it for their own use! LOVE IT!!",
    "Absolutely spot on!!!",
    "Hazel McKinnon",
    "Submitted on: 02/17/16",
    "This sauce is absolutely spot on and delicious! Tastes exactly like TGI's. I had a little trouble getting it really think though... Not sure why- but it was 100% authentic!",
    "Yes it was Awesome!",
    "Channie",
    "Submitted on: 01/01/16",
    "Awesome sauce is an understatement. I have been wanted this for days. After gathering all of the ingredients I baked some rib and used this sauce. I added a little more Jack Danielsand some additional hot spices. Awesome",
    "Always Great",
    "Steve",
    "Submitted on: 11/16/15",
    "Made this sauce several times. Had ribs at Fridays last week. Same recipe as I got bits of pineapple in mine. Doing a double recipe right now and 4 racks of ribs tomorrow for a party.",
    "Very Tasty!",
    "Katie",
    "Submitted on: 07/26/15",
    "Such a wonderful glaze! This glaze is really the only reason I like going to TGI Friday's, but thats not really budget friendly. Try this, put the time and effort into the glaze, and you won't be disappointed.",
    "On spot",
    "Ken",
    "Submitted on: 07/26/15",
    "I've made this recipe several times over the years and used it in many ways, and my favorite use for it is in a crock pot with chicken wings. great copycat, and much appreciated.",
    "Good but not the original.",
    "Richard Sinkle",
    "Submitted on: 07/21/15",
    "I once was employed at a TGI fridays. I dont remember exactly what was on the sauce bag, but I do remember the following ingredients: Molasses cayenne pepper Caramalized onions Jack daniels Tennessee whiskey Brown sugar Monosodiumglutamate There were several ingredients, but these stood out the most to me. Good luck!",
    "Fantastic",
    "BILLY",
    "Submitted on: 07/11/15",
    "I have made this several times, kids eat it on everything. Making it tonight for birthday celebration.",
    "F.G.I Jack Daniels",
    "Demetris",
    "Submitted on: 07/02/15",
    "I try it many times. It is like Friday's restaurant recipe and taste.",
    "You ca not buy anything this good in stores.",
    "Jillian",
    "Submitted on: 06/20/15",
    "I have made this several times and every last drop is gone, every time. Currently make 5x the recipe to can for all the super dad's in my life. This is even better than TGIF's.",
    "SSP",
    "Submitted on: 06/02/15",
    "In talking to the Manager of TGI's where I live He told me it is a thick onion soup with Molasses and bourbon.",
    "Spot on",
    "Pam",
    "Submitted on: 05/25/15",
    "Ok so I made my first batch and forgot to add the cayenne pepper but it's phenomenal!!!! I am making another batch now (had to make sure I ha enough garlic) and it smells great! Can't wait to make dinner now! Take the time to roast your garlic, follow the recipe and you will love it! No short cuts!",
    "Jim",
    "Submitted on: 05/25/15",
    "I have always loved the Jack Daniels sauce , tried this recipe on shish ka bobs, got to make another batch!",
    "IT'S BETTER THAN THE BEST",
    "Mike",
    "Submitted on: 05/13/15",
    "I double the recipe each time I make it. A couple things I changed was, tripled the green label JACK DANIELS & added a bit of pure vanilla. Also used roasted minced garlic in a jar, dried onions, and a bit more of crushed pineapple. It does take about double of the time to reduce...",
    "Too sweet",
    "Laura",
    "Submitted on: 05/03/15",
    "I have made a version with grape juice that my husband thought was closer to the TGIF sauce. Overly sweet, pineapple taste stood out more than it should have.",
    "the G.O.A.T of all sauces",
    "Duncan",
    "Submitted on: 04/22/15",
    "By far the most delicious thing I have ever had with a steak.",
    "Awesome",
    "Tammy",
    "Submitted on: 03/08/15",
    "I have made this severalove times and I love it. I will make this for years to come. Thanks for sharing",
    "awesome",
    "robert",
    "Submitted on: 02/26/15",
    "You guys nailed it tast just like it thanks it saves me a long ride to go get those ribs thank you",
    "AWESOME!!!!",
    "Steven c",
    "Submitted on: 02/14/15",
    "Takes a while to make the glaze but was well worth the wait. Slapped this on some baby back ribs and I don't think I'll ever be going back to Friday's for there version.",
    "Seriously AMAZING!!!!",
    "Lucy",
    "Submitted on: 02/13/15",
    "My husband and i always order the jack daniels sauce when we visit TGI's as we feel it makes the steak/chick taste AMAZING! We had a dinner party recently and decided to try out this recipe, all the guests asked for more and have asked me to make another batch for them to have at home. For those who rate this recipe with low stars can't have followed the recipe step by step.",
    "Better than Friday's!",
    "Alicia S",
    "Submitted on: 01/20/15",
    "I have made this several times and my family agrees it is better than Friday's sauce!",
    "Perfect",
    "Edwin",
    "Submitted on: 01/19/15",
    "I saw a couple of one star reviews here but thinking is the people that made it messed up at their house because i made this 2 times and it was on point with the sauce at tgi fridays i also took my gf to tgi so we could see if it was different and we coudlnt tell at all. Thank you for this its awesome",
    "Epic!",
    "Shana",
    "Submitted on: 01/11/15",
    "Honestly i was hesitant, but the reviews were good so i wanted to see for myself. I can honestly say it tastes spot on to the TGI fridays sauce!! I am so happy i found this recipe. Our burgers were absolutely amazing.",
    "Deliciosa!",
    "Leandro Ortiz",
    "Submitted on: 01/09/15",
    "Truth is I am not a cook. This was very easy to follow except for the garlic roasting hahaha! But the sauce is delicious it is very close to the original. Everyone thought it was the real thing. At first I was scared becaause it smelled like teriyaki and I can't really stand that smell (but that is me) eventually the smell changed. I made it double and still have extra in the fridge. This was a hit! Love it! Go ahead tryy ittttttt!",
    "Wow!!!",
    "Paul B",
    "Submitted on: 01/05/15",
    "My Daughter who is the fussiest eater in the world ate this and asked for more. I'm not even a cook, the most i've cooked before is Beans on toast. My wife has gone away for a few weeks and im left to fend for myself and my daughter. All I can say is if i can make it anybody can and its the best ive ever had, every bit as good as TGIs if not better. Thanks for sharing. I could get the bug for cooking if its all this good!",
    "Not Quite",
    "Sam",
    "Submitted on: 12/22/14",
    "I was excited to make this after reading the reviews, however excitement turned to disappointment this is way too sweet nearly unpleasant",
    "Miss.Betty Crocker",
    "SO GOOD",
    "Submitted on: 12/21/14",
    "Although Ive never had the sauce from TGIF, this was amazing. I had a friend of mine try it and she said it tastes like the sauce from the restaurant. 10/10 recipe and its so easy to make.",
    "AMAZING!!!",
    "Jcrizz",
    "Submitted on: 12/11/14",
    "I've made this recipe several times. It really is just like the TGI Fridays Jack glaze! Anyone who says it's not, made it wrong!",
    "So So Good",
    "Ms. Green",
    "Submitted on: 11/18/14",
    "There should be a \"Better Than Excellent\" rating! This stuff was so darn good! I did not tell my family it was home made until after they'd eaten (and drunk) it all up. Super easy recipe I'll certainly use again and again.",
    "Out of this world",
    "Nick",
    "Submitted on: 10/04/14",
    "I love TGI, especially their sauces. I have to say that I thought the sauce was better. One of the best sauces I have ever had. The only thing I did not do was put all of the pineapple juice and pineapple in, I only used half, as you can always add more if you want to. It is one of those sauces that I will make again and again. You have to try it!!!!!",
    "Not even Close",
    "Jonathan",
    "Submitted on: 09/29/14",
    "My wife and I diligently made this recipe for some baby back ribs this weekend. It was ok, but it's not even close to the Jack Daniels Glaze at TGI Fridays.",
    "Awesome!",
    "Oscar",
    "Submitted on: 08/15/14",
    "You're my hero! This glaze tastes JUST LIKE the restaurant's. And I agree with those who say if you don't think it's good, then you're not doing it right! Thanks for the recipe!",
    "tom connolly",
    "Submitted on: 08/14/14",
    "Great, I grill out often and will use this on a lot of things I cook, can wait to try it on grilled shrimp, had a dinner for friends and ALL of them loved the sauce, thank you it was better than TGIF",
    "Better than Friday's!!!",
    "Submitted on: 08/04/14",
    "I have made this recipe several times now and we absolutely love it! We put it on chicken, steak, in stir fries, it is delicious!!!!",
    "Absolutely fantastic",
    "Peter M",
    "Submitted on: 07/06/14",
    "Anyone who claims this doesn't taste the same (or extremely similar; or better) than TFIF's Jack Daniel's sauce didn't make it right. I mean that humbly. This is an unbelievable recipe, and if it's different, in any small way, from TGIF's, it's for the better. Seriously.",
    "The wife loved it!!",
    "Eli",
    "Submitted on: 06/22/14",
    "If the wife thought it was just as good then i have to agree, this recipe was pretty darn close. I omitted the crushed pineapple as previous comments said there was too much pineapple. As for KevinZ why not help us out on the supposed 3 missing ingredients. I also have my doubts that every TGI Fridays makes this sauce fresh daily, if that was the case the real recipe would have been leaked out by now. Enjoy the sauce!!",
    "this is awesome",
    "lisa",
    "Submitted on: 06/21/14",
    "I must say this is first time making it and I'm hooked.awesome, awesome, awesome",
    "Absolutely Fantastic",
    "Terry Boughton",
    "Submitted on: 06/06/14",
    "Ive just spent the afternoon making this sauce, i cooked off some fresh chicken in breadcrumbs and covered them in this sauce with sesame seeds on the top, exactly the same as TGIs sauce, amazing, i will be making this over and over again, easy recipe to follow, just takes a couple of hours but well worth the time and effort. Huge thank you for the recipe.",
    "I'm in heaven",
    "Sean mcalphabet",
    "Submitted on: 06/01/14",
    "I can't believe this sauce is SO good! I spent three hours making a large batch last night and now there's loads in the freezer. It went down a bomb as a dipping sauce. I wonder what it'd be like as a marinade. The only change I made was to add some molasses sugar instead of some of the dark brown for a title extra depth of flavor. Outstanding.",
    "amazing just like tgi",
    "sofibubbles",
    "Submitted on: 05/21/14",
    "I love this recipe, might be slightly time consuming but really your just putting on and checking it now and again. It can be slightly sweet but served with a Smokey pulled pork the sweet I'd balanced out perfectly. I don't always use JD (it's expensive where I live) and never add the additional chunks as they really aren't necessary",
    "Fanfreakintabulous",
    "ChefEvil",
    "Submitted on: 05/02/14",
    "I love this stuff. I took some to work and my Chef used to work for TGIF and said it was a spot on copy.",
    "T.G.i sauce",
    "Wendy HIll",
    "Submitted on: 04/29/14",
    "Loved the Sauce, I am sure this will be a regular recipe.",
    "Awesome!!!",
    "Nicole",
    "Submitted on: 04/27/14",
    "This recipe is actually EXACTLY like the TIGF recipe I make it all the time and it turns out perfect!!! Give it a try!",
    "Not even close",
    "Karla",
    "Submitted on: 04/19/14",
    "There is no pineapple in Friday's glaze. This recipe isn't even close!",
    "Liquid Gold",
    "Jay",
    "Submitted on: 04/12/14",
    "I like to make baby back ribs at home and really don't like bbq sauce from a bottle. When I ate at tgif's recently I ordered chicken with this sauce, and it came with sauce on the side for dipping. I was hoping to find this copycat recipe so I could baste my ribs with it, and after reading these reviews, I was confident this sauce was the real deal. It is! First off. If you think skipping the roasted garlic is acceptable, you must not like garlic. DO NOT skip the roasted garlic.",
    "Excellent!!",
    "Holly",
    "Submitted on: 04/07/14",
    "This recipe really takes 2 hours to make due to the garlic cooking time. This was the EXACTLY like the TGIF sauce. I didn't find the flavor to be overpowering in pineapple in any way. I did double the recipe in case it turned out good and I am glad I did.",
    "Too sweet",
    "Tawny",
    "Submitted on: 03/21/14",
    "I followed this recipe to the T and although it came out ok it ended up tasting like garlicky pineapple syrup. If making it again I'd add a little more JD and cut the brown sugar and pineapple juice by at least half.",
    "AmAzInG!!!",
    "kaitlyn bultema",
    "Submitted on: 03/13/14",
    "i make this glaze very often and had nothing but great feedback from family and friends they say they would rather have me make it for them rather then go to tgi friday!!! if it doesnt taste right to you either you made it wrong or you just have bad taste!",
    "VEry good too sweet",
    "jorge ramirez",
    "Submitted on: 02/28/14",
    "it is very good. It's too sweet but maybe depends on the pineapple i used natural juice, and two spicy for me less cayenne pepper next time.",
    "Too much pineapple",
    "Stephen",
    "Submitted on: 02/15/14",
    "The sauce is actually pretty good but the sheer amount of pineapple burns through the rest of the lovely taste and ruins it, I think there should be at least a half of the amount of pineapple in this dish. It might be because I'm extremely sensitive to pineapple but this sauce simply has FAR too much pineapple and it just tastes like pineapple juice with a twist of JD sauce. If you take it out though, you will find it's a really good sauce very close in taste to the TGI recipe.",
    "Yum!",
    "Rose",
    "Submitted on: 02/04/14",
    "This stuff is awesome! I think I like it better than TGI Friday's sauce.",
    "KevinZ",
    "Submitted on: 01/29/14",
    "I make this at TGI Fridays all of the time. This is missing 3 things. Get some from the restaurant and make this and compare it. Not close at all. Also, there are no black cherries in the recipe despite what a past comment said.",
    "ABSOLUTELY LOVE IT !!!",
    "Reni",
    "Submitted on: 01/24/14",
    "Absolutely spot on! delicious !!!",
    "Delicious",
    "Marinda",
    "Submitted on: 01/20/14",
    "I read the reviews and now that I've made the sauce, let me say that it is fantastic and very very close to the same thing. Slightly too pineapple-ey, in my opinion, but my boyfriend disagrees. He disagrees. He says it's perfect. I used minced, canned garlic and sauteed it n some oil and smashed it up. Seems to have worked out just fine. I say go for this recipe! ! Don't let those few reviews discourage or influence you. This is absolutely delicious if u like what tgif has.",
    "OMG perfection",
    "Kristen",
    "Submitted on: 01/19/14",
    "My boyfriend and I love the Jack Daniels menu at tgifridays and he was so stocked when I surprised him with wings in this sauce for the game! It comes out exactly like the one from the restaurant. Side note: I uses two elephant garlic cloves cooked the same way and it worked perfect.",
    "Lover of good recipes",
    "Dianne Rombke",
    "Submitted on: 01/18/14",
    "Wow! This is absolutely amazing! I have been trying to figure out how to make the J.D. sauce at Friday's and this is it! You cannot beat this recipe. Absolutely awesome and thanks for the recipe!",
    "Love it Love it Love it!!!",
    "Dee",
    "Submitted on: 01/11/14",
    "Not sure what Jim is talking about or where he is from to get black cherries in the sauce. Either way who cares that's not on the ingredients. Just add it. I can't wait to have my grilled JD wings and beer for the Super Bowl.",
    "MAKE IT AGAIN MAMA!",
    "REDD KYLES",
    "Submitted on: 01/08/14",
    "I MADE THIS ONCE & NOW THE TOOPS WONT SHUT UP!! THEY BEG 4 IT!!!",
    "Wonderful",
    "Angela",
    "Submitted on: 12/31/13",
    "I've been making this for a couple of years. I make very, very large batches and can it in small, jelly size jars so I only have to make a batch every once in a while. My family actually thinks this is better than the original. The only thing I change is the bourbon. I use either Knob Creek, Maker's Mark or Old Forester (I know, I know...it's called Jack Daniels, but I like the better bourbons).",
    "#1 sauce in our home",
    "Evett",
    "Submitted on: 12/28/13",
    "I've made this a couple of times now and always double the recipe because every one loves it! It does take some time to make, but it is well worth it. For the reviewer who mentioned the recipe missing cherries, this is not so. TGIF'S original recipe does NOT contain cherries. If you follow this recipe, you will not fail.",
    "Delicious but not the same thing.",
    "Lake",
    "Submitted on: 12/26/13",
    "Close to the real thing but not exactly. My taste buds are telling me there was too much pineapple juice. Also, when I taste the real TGIF sauce I think of dark corn syrup. That said I still made a mess eating ribs slathered with this sauce. Delicious!",
    "Tgi jack Daniels sauce",
    "Jay",
    "Submitted on: 12/23/13",
    "Omg ! Unbelievable , absolutely spot on.",
    "Jamie",
    "Submitted on: 12/08/13",
    "I have made this several times and absolutely love it! It boils down quite a bit so I always do double batch and rather than 2 cups pineapple juice I substitute one cup orange juice. works out great!",
    "Absolutely Delicious",
    "Dayle Watson",
    "Submitted on: 11/17/13",
    "So is it nice.....hell yes, is it the same as TGI's......in my view its extremely close, having tasted TGI's on a Friday and making this up on a Sunday i can honestly say it's 99% perfect. I'd personally double the recipe though at the very least seeing as it takes a while to make. I also used Honey JD, and i'm glad i did because i now have a new drink lol. So yes this is a great sauce and just don't skip any corners in making it, raost the garlic as instructed.",
    "where's the cherries?",
    "jim",
    "Submitted on: 11/16/13",
    "The sauce served at the restaurant has black cherries in it. Try again!",
    "Jeneen haack",
    "Submitted on: 11/13/13",
    "omg amazing I make a quadruple recipe my family loves soooo much!!!",
    "Excellent recipe",
    "Linda",
    "Submitted on: 11/08/13",
    "I have been making this sauce for years using this recipe. It always turns out excellent without making any changes. Authentic as what you will get in TGI Fridays!",
    "Jerky",
    "Dave USA",
    "Submitted on: 11/06/13",
    "Used this glaze as a marinade for jerky. It turned out pretty damn good! Used the honey JD for more flavour worked perfectly!!",
    "Pretty close",
    "KayJay",
    "Submitted on: 10/24/13",
    "Just finished up this recipe about an hour ago, and it's close, but not quite the real deal I would recommend using less garlic, maybe more than half of the recommended 2 tsp, but no more than 1 1/2. After simmering and tasting, I found that I had to add more pineapple juice, lemon juice, cayenne and even a bit more sugar and simmer another 10 minutes. Also, I had to simmer for much longer than 50 minutes, much closer to 90. Still, this was my first attempt, and as first attempts go I'm quit",
    "corner cutting",
    "Phloid",
    "Submitted on: 10/17/13",
    "Im an executive chef. Heres what you do. Roast the garlic. Then throw that and everything else into a saucepan. But omit the water. Bring it to a simmer. Take cornstarch and dissoodlve it in a bit of water. Add it to boiling sauce til desired thickness.....done!",
    "brilliant!!",
    "sarah",
    "Submitted on: 09/30/13",
    "Such an amazing likeness!!! Time consuming to make but so totally worth it!! All the family love this and its saving us money because we can now get our TGI fix at home!!",
    "You MUST make this!",
    "Shawna",
    "Submitted on: 09/18/13",
    "We have made this several times and it's such a hit with everyone! SO YUMMY on ribs or chicken. Try it!",
    "Great!!",
    "Teresa Campbell",
    "Submitted on: 09/14/13",
    "I have made this several times and it is awesome. My family loves it!! Just like TGIF sauce. I use the whole garlic clove.",
    "Great Sauce !",
    "Donna",
    "Submitted on: 09/01/13",
    "I didn't have any whole garlic so I used minced garlic sautéed in olive oil and I used caramelized onions because a TGIF server told me she knew it had caramelized onions. It was great!!!",
    "Awesome!",
    "Bryan",
    "Submitted on: 08/08/13",
    "This recipe is perfect! Almost exactly the same as tgi Fridays! I think the roasting of the garlic is key, don't omit this step! I followed the recipe to a tee but I didn't have any jack Daniels in the house so I used captain morgan spiced rum and it was just as good. I also doubled the recipe cause i wanted extra. Highly recommend this recipe!",
    "WOW!",
    "Adara clarton",
    "Submitted on: 07/30/13",
    "Went to TGI's last week as the misses is absolutely obsessed with this sauce, just came across this recipe and followed it step by step.... AMAZING, pretty dam close to the real thing what a find :D",
    "If done as shown, it is it.",
    "Kelly Wood",
    "Submitted on: 07/10/13",
    "Made this last night on a whim, sure enough, it is it. No need for the roasted garlic though as you can't really taste it when you do use it. Impressive. The trick is to just go slow and take your time. It's worth it.",
    "don't rush the cooking time",
    "evett",
    "Submitted on: 07/05/13",
    "For those who write this recipe does not taste even close to the original, I suggest trying it again but play around with the suggested ingredient serving sizes. Each time I make it, it comes out better and better. My family also putsI it on everything. Yes, it is sugary, but there are bunch of other flavors that come alive when cooked slowly.",
    "Tastes like the real deal",
    "Vicky",
    "Submitted on: 06/23/13",
    "This recipe is spot on in terms of fast and authenticity to the TGIF version. It is a labor of love...a time consuming process but it is totally worth it if you love the sauce from TGIF",
    "Brian",
    "Submitted on: 05/19/13",
    "Lot of work for 1 cup of sauce. Tastes like Fridays but not worth the effort.",
    "Eh..",
    "Angelica",
    "Submitted on: 05/18/13",
    "Long process just for a cup of sauce and while I don't think it tastes like the TGIFs' sauce it still tastes pretty good",
    "Terrific",
    "Paige",
    "Submitted on: 05/16/13",
    "Made this sauce last night and it was terrific! We had it on steak last night and I am using the rest on chicken tonight. Thanks!",
    "Not even close",
    "Rick",
    "Submitted on: 05/15/13",
    "I worked fit TGIF and I made the jd glaze this is not the recipe viki you are right not close at all",
    "Amazed!!!",
    "Jason b",
    "Submitted on: 05/11/13",
    "I'm shocked at how much this tastes like the original. Seems just a tiny bit spicier than original but I still am amazed. You could do a side by side taste test with this and no one would be able to tell the difference. roasting the garlic was an interesting process but im sure its crucial. I have to buy this dudes books....all of them!!! Been anybody cares i been a waiter for 15 years and have worked at Fridays.",
    "Jessie",
    "Submitted on: 05/02/13",
    "O.M.G. I can't believe it. It taste JUST like T.G.I. Friday's! I am super excited. I ate it with chicken this evening and I can't wait to make pulled pork with it. It did take me a little longer to reduce down...about an hour and a half but I doubled the recipe so I could have lots of leftovers. Thanks for this awesome recipe!",
    "Amazing",
    "Senetra",
    "Submitted on: 04/16/13",
    "I will def make this again, however I change the Jack Daniels Whiskey to Sherry Cooking Wine, cause I was to lazy to go to the store to pick up that last ingredient, lol, still turned out amazing!!!!!",
    "Maria (NY)",
    "Submitted on: 04/14/13",
    "Thanks for this DELICIOUS recipe, Todd. I just had to try it, and I'm so glad cause my husband and kids love it. Low heat plays a crucial role, may take a little longer to thicken up but it's well worth it. In the mean time my family and I are LOVING IT!!",
    "Epic",
    "Jake",
    "Submitted on: 04/06/13",
    "This came out awesome! I'm sorry Vicki, but I think you should blame your culinary skills instead of the recipe. HIGHLY recommended! The only suggestion I have is to cook it down a little longer to make it thicker. LOW HEAT! It's easy to burn. Be patient.",
    "Boom!",
    "Lianne R (UK)",
    "Submitted on: 03/26/13",
    "Made this today wondering if it will really taste like the sauce we love at TGI's, and omg IT DOES!! The fiance is well-chuffed. Now that I know how to do it, I am sure we are gonna make ourselves sick lol!",
    "AMAZING",
    "Ciara",
    "Submitted on: 03/12/13",
    "LOVE this recipe! Been making for a few years, even replaced the pineapple juice with apple juice when I've forgotten the Pineapple at the store.(reducing the amount by a quarter cup) & it comes out just as tasty! I always add more onions too!",
    "Brooke",
    "Submitted on: 03/11/13",
    "This is amazing...my entire family loved it, and it's identical to Fridays! FANTASTIC!!",
    "YUMMMMMM!!!",
    "suejane",
    "Submitted on: 03/04/13",
    "THANK YOU for this recipe, Todd. I just made a double batch and used my stock pot, since I didn't want to worry about boil-over, and it worked well. Here is what I did differently: I used fresh minced garlic from a jar and didn't roast it, I didn't put in the crushed pineapple, and used slightly less water (1 cup for double recipe instead of 1-1/3 cups). It thickened nicely, is very sticky (just like at TGIF!), and tastes wonderful!!",
    "awesome!!!",
    "Eddie Salazar",
    "Submitted on: 02/23/13",
    "Made this recipe a few years ago and we are hooked!! You can poor this on cartboard n have a great tasty meal...",
    "daniella da silva",
    "Submitted on: 07/31/12",
    "This glaze is absolutely delish! I think it's just like the original this guy did an excellent job copying it. This glaze goes well with egg rolls chicken fingers and meats. I rate this recipe an a++++. Thank u sooo much 4 this recipe!",
    "The best!",
    "nj blemaster",
    "Submitted on: 12/27/11",
    "I have loved this glaze for years but only recently started making it myself...in about two months I've made it about a dozen times because we use it on everything - even salad! I recently bottled it up and gave it to family as gifts for the holiday - they were thrilled!",
    "Kelly Mahon",
    "Submitted on: 04/19/11",
    "Ok, so my hubby and I are obssessed with the JD sauce at TGIF, so I was very eager to try this. It came out ok I suppose, but i definitely don't think it was EXACTLY the same as TGIF. It tasted wayy too pineapple-y. Someone said here that they doctored it because of the overpowering pineapple taste, i wish they would've mentioned how!!! I read all the reviews before I made it and was REALLY hoping that i'd be with everyone except the two people that didn't like it. But Ive got to b",
    "Great!!!",
    "Phil",
    "Submitted on: 04/10/11",
    "This is very close to the original. Don't waste your time with the roasted garlic part, I just use garlic powder and a little less brown sugar.",
    "Gina Cihacz",
    "Submitted on: 02/05/11",
    "I can't tell the difference. I have tried this not only on red meat, but also on Chicken, pork loin. This is all purpose",
    "awesome",
    "Verna Fitzgerald",
    "Submitted on: 11/26/10",
    "I made this and gave it as Christmas gifts last year and everybody wants the same this year...",
    "Kim",
    "Submitted on: 06/28/10",
    "Been making this for years as well - excellent with all meats, seafood and veggies.",
    "Fly Navy",
    "Submitted on: 12/31/09",
    "This recipe is legit. My wife and I have been making it for years and can honestly say it tastes just like the real deal. Everybody who has tried it loves this recipe and wants it for their own.",
    "carol knox",
    "Submitted on: 10/03/09",
    "I thought this glaze was excellent!!! I found it was easy to make and each time I have served it people have raved about it",
    "KC",
    "Submitted on: 09/15/09",
    "I have been making this recipe for years and I have to tell you, it's the BEST! I baste burgers with it, use it on chicken, almost anything! Thank you for coming up with this clone.",
    "BOB",
    "Submitted on: 06/21/09",
    "I been making this recipe for about 9 years and every time I make it everyone says it tastes just like the real thing. My option don't knock it until you try it. What someone else might not like you might enjoy. JUST TRY IT.",
    "Bernie",
    "Submitted on: 05/24/09",
    "I have been uing this recipe foe about 10 years now and every time I do everyone loves it. I just came back to the site to print it again because its getting hard to see the copy I have. I have tried others from this site and they are all great.",
    "Skye",
    "Submitted on: 04/17/09",
    "I'm SOOO glad I stumbled across this site. I made this yesterday and it was awesome, just like TGI's. I used bottled lime juice as I had no lemon, but did everything else as described and it turned out great. Thanks Todd, I'm looking forward to trying some of your other cloned recipes!",
    "Alex&Julia",
    "Submitted on: 04/05/09",
    "It's fantastic! Easy to cook, fantastic taste!",
    "Jerry",
    "Submitted on: 02/02/09",
    "I don't think this tastes anything like Friday's JD sauce. Can't even taste the JD. One tablespoon is not nearly enough. Sure it tastes good, but only because it's mostly SUGAR! Don't waste your time on this recipe.",
    "april",
    "Submitted on: 01/14/09",
    "This is great. I only get to eat TGI once in a great while, now I get to eat it all the time. My husband would'nt try the sauce at TGI, but when I made it here at home he loved it. Now I have to make it with almost every meal. He even eats it with pork chops. It is great. But instead of using the garlic glove and smelling up my whole house I just use minced garlic and I think it works just the same.",
    "Wendy",
    "Submitted on: 12/30/08",
    "OMG I Love this stuff. This recipe is the best. I had Jack Seseme Chicken at TGI Fridays so I decided to try this recipe and it is soooooo close. I have made it several times already. Thank You",
    "Dr Scott",
    "Submitted on: 12/23/08",
    "The best!!!! Only takes looong time to reduce when you increase the quantity.",
    "stacy",
    "Submitted on: 12/10/08",
    "We loved it!!!! taste just like it.",
    "Danny",
    "Submitted on: 11/29/08",
    "This sauce is da bomb! Tasted just like tgi ribs. So tasty, but i think the soy sauce should be dropped if your making ur own teryaki sauce. the guy who made this sauce should get a nobel prize",
    "Troy",
    "Submitted on: 11/22/08",
    "This is the best!!!",
    "Aggie",
    "Submitted on: 09/16/08",
    "This sauce is superb on beef, chicken, fish and pork. I will make it in volume next time. Our guests enjoyed it so much that we ran out of glaze.",
    "Robin",
    "Submitted on: 06/24/08",
    "This is delicious!! I made kabobs with filet mignon, fresh pineapple and vidalia onion and brushed this sauce on as it grilled. I could eat the sauce by itself. Soooo good and worth the time to make it. Can't wait to make it again.",
    "Cherie",
    "Submitted on: 06/03/08",
    "This recipe is the best. It is worth the time it takes to make and I have learned to double the recipe and store it in a mason jar. I leave the Cayenne pepper out though but still tastes awesome.",
    "Miah",
    "Submitted on: 02/14/08",
    "I am a former TGIF Bartender, and I must say, this recipe is awesome. It does take some time to reduce, but its well worth the wait! Stripes & Flare!",
    "Nikki",
    "Submitted on: 02/12/08",
    "Every since my hubby and I tried your recipe a couple of years ago, we have been the Jack Daniels Sauce King and Queen! We love this stuff!!! This web sit is the best!!!Thank you..Thank you!!!!",
    "Andi",
    "Submitted on: 12/18/07",
    "I used to work at TGIFridays a few years ago. While I was there, I fell in love with this stuff. I always wished I could make the stuff at home, or buy it or something. This recipe is dead on.",
    "Kristine",
    "Submitted on: 11/17/07",
    "I loved this recipe! It tastes just like the T.G.I. Fridays sauce.",
    "Robin",
    "Submitted on: 11/03/07",
    "This turned out great. I was really skeptical of trying it but am so glad I did. It tastes just like it. Thank you so much.",
    "Robin",
    "Submitted on: 11/03/07",
    "I was very skeptical about trying this, but I enjoy (the original), so I thought I would give it a try. Well I am so happy I did. It tastes exact. Thank you so much.",
    "Dave",
    "Submitted on: 10/23/07",
    "Perfect, just perfect!",
    "Lynn",
    "Submitted on: 10/04/07",
    "I doubled the recipe and used 2 tsp of roasted garlic from a jar. It was great. Try pouring it over ribs and cooking them in the oven on 350 for an hour. WOW!",
    "Snarky",
    "Submitted on: 09/30/07",
    "My original copy of this recipe was pretty trashed. Glad I was able to get a new version! Cheers.",
    "Susan",
    "Submitted on: 07/21/07",
    "I just about had a heart attack when I lost my recipe. It's been a huge hit with family and friends and always guarantees a big turn-out for BBQ's. It is THE #1 request for cookouts. Thanks so much for such an awesome recipe.",
    "Linda",
    "Submitted on: 03/07/07",
    "I made the glaze tonight for supper. Just used 2 tsp garlic instead of roasting. Put 1 cup of sauce over chicken wings. Put in oven at 325 for 1 hour. Basted every 15 minutes. Served it over rice pilaf (recipe in Todd's latest restaurant cookbook. It was out of this world. My boyfriend went nuts. Loved the taste.",
    "Cindy Kuriscak",
    "Submitted on: 11/24/06",
    "This takes a little time but the results are well worth the time. My husband raved about this sauce. He likes it for chicken or steak.",
    "Candice Pownall",
    "Submitted on: 11/18/06",
    "This is the best sauce I have ever had in my life!! I turn all my friends on to it, and they love it too, thank you for this website!!",
    "Joe",
    "Submitted on: 10/28/06",
    "I doubled the ingredients to make a larger batch. This is what I used to marinate my deer jerky meat. Love the sweet taste and the bite of the pepper",
    "Lisa",
    "Submitted on: 08/22/06",
    "I use frozen chicken wings and pour the sauce over them and bake them for about 1 hour on 350. Best wings I've ever had.",
    "Bob",
    "Submitted on: 07/07/06",
    "Wow! Huge hit at the steak party with 23 guests...I made a gallon and froze what 'little' there was left over. The house smells great!",
    "Leslie",
    "Submitted on: 05/22/06",
    "Absolutely spot on perfect with this one. This is exactly like the TGI Fridays. I only regret that I didn't make a LOT more at the time. It's time consuming to make, but is so very worth it!",
    "Meka",
    "Submitted on: 05/08/06",
    "I love this is is right on T.G.I.F's JD sauce i have had to go to T.G.I.F's in a long time because of this recipe thanks top secret recipes you've saved me some time and money on eating out",
    "Randy",
    "Submitted on: 04/15/06",
    "Great Recipe!! I have been using this recipe for years now. Injected 13 deep fried turkey's with this recipe. I usually triple the recipe, add more cayenne pepper, leave the sugar at 1 1/3 cup and the water at 2/3 cup. I have roasted garlic in freezer ready for next batch.",
    "Ken",
    "Submitted on: 03/26/06",
    "I've been using this recipe for several years now and I love it! My family loves this sauce more then the original, (I add more garlic and onion), I quadruple the recipe because everyone wants to take what's left over home with them to use when they grill ribs.",
    "itsonlyme",
    "Submitted on: 12/21/05",
    "I used this sauce for a foil dinner cookout...The flavors blended with the pork/chicken and or beef, potatoes and vegetables and gave it all an awesome flavor. This is a repeat recipe in my house-and I always quadruple the recipe!!",
    "Chris",
    "Submitted on: 12/17/05",
    "This is the best glaze/sauce I have had. Just give it some extra Jack, and it becomes even better.",
    "Jeff",
    "Submitted on: 11/27/05",
    "Great! Not sure I got the garlic 100% right, but it still tastes dead-on.",
    "Philippa",
    "Submitted on: 11/22/05",
    "This is just like being at TGIF's!!!",
    "Harley",
    "Submitted on: 11/19/05",
    "I'm with you, Angelina! I always make it differently. My husband said it never tastes the same cause I never make it the same, I tell him I do, I just wing it with the measurements (like a lot more JD!) This is the best on anything! Hotdogs, meatloaf, chicken, steak, hamburgers... you get the idea!",
    "Kerry",
    "Submitted on: 11/09/05",
    "Made it for my roommates and they can't tell the difference! Good job.",
    "nick",
    "Submitted on: 11/05/05",
    "I think this tastes just like the real thing. I use jared minced garlic and just roast that according to the instructions, makes it a little easier I also use capt. morgan with jack daniels.",
    "Vicki",
    "Submitted on: 11/02/05",
    "I really don't think it taste like TGI Friday's at all... I have found another \"clone\" JD Sauce and made it and it is way closer. I bought the sauce from TGI Friday's and my version and the original are very close. I tried making this one and it was way off on the taste. Sorry!",
    "Jerrell",
    "Submitted on: 10/26/05",
    "JUST LIKE TGI FRIDAYS!!!!!!!!!!!!!!! The only reason I went to Fridays was for the JD Glaze products. I grilled burgers and pineapple with this glaze tonight, and can't wait to try this on chicken.",
    "DEBBIEK",
    "Submitted on: 10/24/05",
    "CAN'T MAKE STEAK NOW WITHOUT IT!!!IT IS EXACT!!WE LUV LUV LUV IT!!!",
    "helpful hints",
    "Submitted on: 10/11/05",
    "To quicken the thickening time. use just enough cold water to dissolve 1 tbsp of cornstarch in a small glass. Add this to the mixture and repeat if neccessary for the thickness you want. I also recommend using captain morgan instead of jack daniels.",
    "J. LeNoir",
    "Submitted on: 10/11/05",
    "Rated a bunch I see, but I'll still add my two cents. EXCELLENT and just like the original! I use this sauce for many things, but I especially like it as a won-ton/egg roll dip!",
    "Jim G",
    "Submitted on: 10/09/05",
    "Change your 'scale' from 1-5 to 1-10 and I'd give this a 15!!!",
    "Angelina",
    "Submitted on: 09/29/05",
    "I always get the highest comments on this recipe, I never make it the same, and have never made it exactly as it is written here, I always make it \"my own\" I always get asked for the recipe, I can only give the ingredients....lol, b/c I always use different amounts, and sometimes, add different ingredients as well, my husband loves how I do that. This is our favorite glaze....I use it all the time. I get REQUESTS for it quite often. in fact, I'm making it for a pot luck supper TONIGHT!!! mmmmmmmmmm.",
    "UNDERCOVER ANGEL",
    "Submitted on: 09/07/05",
    "THIS TASTES LIKE THE REAL THING! I DIN'T ROAST THE GARLIC I USED THE GARLIC IN A JAR AND IT STILL TASTED THE SAME! GREAT SAUCE AND IT DIDN'T TAKE LONG AT ALL! IT THICKENS UP AS IT SITS THERE DON'T WORRY!",
    "Donika",
    "Submitted on: 09/01/05",
    "The best!! My husband and I made this sauce at the beginning of this week, and have been enjoying it all week long! As fans of Friday's and their JD sauce, my husband made the comment that he liked our version better!! The cayenne adds just enough spice, and the roasted garlic is just the best! Very easy recipe, takes a while to cook, but is very easy to make overall. Thanks so much for this one!!",
    "becky",
    "Submitted on: 08/30/05",
    "It took way longer to thicken up than advertised. I also had to doctor it up because it tasted too pineapple-y. Roasting the garlic was not worth it, couldn't taste that in the sauce.",
    "KC",
    "Submitted on: 08/22/05",
    "This was the absolute best and tastes exactly like the restaurant's sauce! I had no trouble with it thickening up when I doubled the recipe. When it cooled it thickened up for me, especially once it was in the refrigerator.",
    "Cathy",
    "Submitted on: 08/20/05",
    "I made this for a salmon glaze and it was delicious! It does take a while to cook down, but it's worth it.",
    "Lynnet",
    "Submitted on: 08/16/05",
    "This is wonderful! Taste like the real thing. We use it on grilled potatoes, grilled shrimp, ribs, etc. We made a triple batch and canned the rest for the next week! We love it! Thanks!",
    "Lori the Great",
    "Submitted on: 08/09/05",
    "This sauce tastes EXACTLY like the real mccoy! It did seem to take forever to cook down to the correct consistancy - but once it did, it was terrific.",
    "Amy",
    "Submitted on: 08/02/05",
    "I have made this sauce for a good couple of years now. It's awesome basted over shrimp. Can eat white rice with just this and it makes it so much more enjoyable. Also, a really good addition to chicken or even on a burger. It just makes whatever you add it to soo much more exicting and flavorful!",
    "kevin",
    "Submitted on: 07/28/05",
    "could not find a better sauce for grilling meat, especially chicken!!",
    "Marilyn",
    "Submitted on: 07/26/05",
    "This is the ultimate recipe. I have been using it for years now. I don't have a TGIF up here in Canada where I live and really miss having their Jack Daniel Glazed Ribs. I make large batches of the sauce and use it for Ribs,Wings, Salmon and a dipping sauce for Fondues.",
    "kathy",
    "Submitted on: 07/25/05",
    "i have been making huge batches of this sauce,for several years. i make huge batches of the sauce, then hot-pack them into canning jars. men love to get this as thank you gifts. WOW!!! now everone wants the recipe! it also keeps a very long time in the fridge, once the jars are opened.",
    "jennifer",
    "Submitted on: 07/21/05",
    "I made this marinade and used it on shrimp. My husband fell in love with it! It takes a while, but it's worth it.",
    "Em",
    "Submitted on: 07/20/05",
    "Everyone looks forward to this glaze whenever we bbq.",
    "deafdogma",
    "Submitted on: 07/20/05",
    "I tried this recipe about 5 months ago and it was really great.",
    "Alexander",
    "Submitted on: 07/20/05",
    "Use it all the time on ribs... LOVE IT!",
    "Frank",
    "Submitted on: 07/20/05",
    "This tastes just like it does at the restaurant. I have found that if you try and make a double batch, it just doesn't come out the same. It doesn't thicken up enough and if you continue to cook it down to long it will take on an overcooked flavor.",
    "denise",
    "Submitted on: 07/19/05",
    "this is just the best, ever",
    "Free eBooks Download",
    "HOME | FAQs | PRIVACY | USER AGREEMENT | CONTACT | AFFILIATES",
    "©2017 Top Secret Recipes",
    "DeGagne Design & Marketing"
  ],
  "ingredients": [
    "0",
    "1 head of garlic",
    "1 tablespoon olive oil",
    "2/3 cup water",
    "1 cup pineapple juice",
    "1/4 cup teriyaki sauce",
    "1 tablespoon soy sauce",
    "1 1/3 cups dark brown sugar",
    "3 tablespoons lemon juice",
    "3 tablespoons minced white onion",
    "1 tablespoon Jack Daniels Whiskey",
    "1 tablespoon crushed pineapple",
    "1/4 teaspoon ground cayenne pepper"
  ],
  "__v": 1
}