{
  "hash": "08ed11edfe0a9e987e2158286dfefb7fefd1377f",
  "title": "Lasooni dal",
  "image": "https://i.guim.co.uk/img/media/aea3ef6479ed2d28f39b1116280bdf91eadd22c8/0_0_3667_3667/master/3667.jpg?width=300&quality=85&auto=format&fit=max&s=c9af3a438587f8637baef7cfed5f6551",
  "href": "https://www.theguardian.com/food/2018/nov/10/four-aromatic-vegetable-dal-recipes-from-karam-sethi",
  "extension": "Chrome",
  "firstAdded": "2018-11-10T13:18:26.682000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Wash the lentils under cold running water until it runs clear. Put in a bowl, cover with warm water and leave to soak for 30 minutes.",
    "Meanwhile, whisk the yoghurt in a small bowl and set aside.",
    "Drain the lentils and put in a pot with the turmeric, chilli powder and two teaspoons of salt. Cover with about 800ml warm water, bring to a boil, then stir in the garlic and ginger pastes. Cook on a medium heat, stirring occasionally, until the lentils are just tender – about an hour.",
    "Stir in the yoghurt and ghee, cover the pot and leave to simmer for five minutes. Remove the lid, then season to taste.",
    "To temper the dal, gently melt the ghee in a frying pan on a low heat. Add the whole chillies and stir until they begin to darken, then add the cumin and stir until it starts to crackle. Add the garlic and fry until it turns golden-brown.",
    "Pour the tempering into the dal, cover again and simmer for 10 minutes, so the lentils take on the flavours. Adjust the seasoning to taste, and serve warm with roti or rice."
  ],
  "ingredients": [
    "0",
    "200g arhar dal (split yellow lentils)",
    "100g strained yoghurt – about 140g natural yoghurt, strained for five hours",
    "½ tsp ground turmeric",
    "1 tsp yellow chilli powder",
    "Salt",
    "15g garlic paste (peeled, finely chopped and ground to a paste)",
    "10g ginger paste (peeled, finely chopped and ground to a paste)",
    "45g ghee",
    "To temper the dal",
    "15g ghee",
    "4 red chillies",
    "1 tsp cumin seeds",
    "16 garlic cloves, peeled and finely sliced"
  ],
  "__v": 2
}