{
  "hash": "bec66650dca6e6082deee6783b9a3d5fd5cda610",
  "title": "2-Ingredient Banana Pancakes",
  "image": "http://atmedia.imgix.net/ecaaf12a8ed14471cc0704822ed352b25953aaa7?auto=compress&w=640.0&fit=max",
  "href": "http://www.thekitchn.com/how-to-make-2-ingredient-banana-pancakes-cooking-lessons-from-the-kitchn-218658",
  "extension": "Chrome",
  "firstAdded": "2017-01-06T07:18:36.944000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Mash the banana: Peel the banana and break it up into several big chunks in a bowl. Use a dinner fork to thoroughly mash the banana. Continue mashing until the banana has a pudding-like consistency and no large lumps remain; a few small lumps are okay. You should have 1/3 to 1/2 cup of mashed bananas.",
    "Add any extra ingredients: These pancakes are pretty great on their own, but a few extras never hurt. Add 1/8 teaspoon of baking powder for fluffier, lighter pancakes, and whisk in salt, vanilla, cocoa powder, or honey to flavor the pancakes. Save any chunky, heavy ingredients — like nuts or chocolate chips — for when the pancakes are on the griddle.",
    "Stir in the eggs: Whisk the eggs together until the yolks and whites are completely combined. Pour the eggs over the banana and stir until the eggs are completely combined. The batter will be very loose and liquidy, more like whisked eggs than regular pancake batter.",
    "Heat a griddle over medium heat: Melt a little butter or warm a little vegetable oil in the pan to prevent sticking, if you like.",
    "Drop the batter on hot griddle: Drop roughly 2 tablespoons of batter onto the hot griddle. It should sizzle immediately — if not, turn up the heat slightly.",
    "Cook for about 1 minute: Cook the pancakes until the bottoms look browned and golden when you lift a corner. The edges should also be starting to look set, but the middle will still be loose like barely set Jell-O.",
    "Sprinkle with toppings: Sprinkle any loose toppings, like nuts or chocolate chips, over the top of the pancakes as the first side cooks.",
    "Flip the pancakes: I've found it best to do this very gently and fairly slowly — the opposite of regular pancakes. Gently work a spatula about halfway under the pancake, then lift until the unsupported half of the pancake is just barely lifted off the skillet. Lay the pancake back down on its other side. Some of the loose batter will probably spill onto the skillet as you do this; just be sure to lay the pancake on top of the spill and nudge any excess back under the pancake.",
    "Cook for another minute or so: Cook the pancake for another minute or so, until the other side is also golden-brown. You can flip the pancakes a few times if you need to in order to get them evenly browned. (Flipping is much easier once the second side is set!)",
    "Continue cooking the pancakes: Transfer the cooked pancakes to a serving plate and continue cooking the rest of the batter. Keep the finished pancakes warm in the oven if cooking more than a single batch.",
    "Serve warm: These pancakes are best when eaten fresh off the griddle and still warm. Serve with maple syrup, honey, jam, or any extra toppings you'd like.",
    "Recipe Notes",
    "Leftover pancakes: These banana pancakes will keep in the fridge for a few days and can be warmed in the microwave in 30-second bursts until hot. They're not as delicious as when they're fresh, but they make a nice snack."
  ],
  "ingredients": [
    "0",
    "Serves 8",
    "1 medium ripe banana",
    "2 large eggs",
    "Butter or oil, for the pan",
    "Maple syrup, jam, powdered sugar, or any other toppings, to serve",
    "Optional extras (choose a few!):",
    "1/8 teaspoon baking powder, for fluffier pancakes",
    "1/8 teaspoon salt",
    "1/4 teaspoon vanilla",
    "1 tablespoon cocoa powder",
    "1 tablespoon honey",
    "1/2 cup chopped nuts, chocolate chips, or a mix",
    "1/2 cup leftover granola",
    "1 cup fresh fruit, like blueberries, raspberries, or chopped apples"
  ],
  "__v": 3
}