{
  "hash": "76789a2a575504c096e16959b06a3781e2588d22",
  "title": "No-Bake Chocolate-Nutella 'Cheesecake' Verrines",
  "image": "http://www.seriouseats.com/recipes/assets_c/2015/02/20150222-no-bake-chocolate-and-nutella-cheesecake-nila-jones-4-thumb-625xauto-419804.jpg",
  "href": "http://www.seriouseats.com/recipes/2015/02/no-bake-chocolate-nutella-cheesecake-verrines-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-06-19T12:01:05.537000",
  "users": [
    null
  ],
  "keywords": [
    "crust",
    "oreo",
    "cookies",
    "unsalted",
    "butter",
    "nutella",
    "filling",
    "cream",
    "granulated",
    "sugar",
    "cheese",
    "softened",
    "room",
    "chocolate",
    "semisweet",
    "dutchprocessed",
    "cocoa",
    "whipped",
    "hazelnuts",
    "oreos"
  ],
  "directions": [
    "0",
    "1 For the Crust: In a food processor, pulse Oreos until finely ground. Add melted butter and pulse for another few seconds until evenly coated. Alternatively, put the cookies in a zipper-lock bag and crush with a rolling pin before adding the melted butter. Spoon Oreo mixture into 4 to 6 serving glasses in an even layer. Set aside.",
    "2 For the Nutella Filling: In a small bowl, whip cream with sugar until it holds soft peaks. Set aside. In a medium-sized mixing bowl and using an electric hand mixer, whip cream cheese until smooth and fluffy. Add Nutella and whip until smooth, about 2 minutes. Using a rubber spatula, fold in whipped cream until no streaks remain.",
    "3 For the Chocolate Filling: Melt chocolate in the bowl of a double boiler or in the microwave. Set aside to cool slightly.",
    "4 In a small bowl, whip cream with sugar until it holds soft peaks. Set aside. In a medium-sized mixing bowl and using an electric hand mixer, whip cream cheese until smooth and fluffy. Add cooled chocolate and cocoa powder and beat until smooth, about 2 minutes. Mix in two thirds of the whipped cream. If the mixture looks lumpy after 3 minutes of mixing, pass through a fine-meshed sieve. Fold in the remaining whipped cream with a rubber spatula.",
    "5 For Serving: Spoon or pipe filling into serving cups, starting with layers of Chocolate Filling followed by Nutella Filling. Chill in the refrigerator for at least 2 hours and up to 2 days. Garnish with whipped cream, crushed Oreo’s or toasted hazelnuts before serving."
  ],
  "ingredients": [
    "0",
    "For the Crust:",
    "8 Oreo cookies",
    "1 tablespoon unsalted butter, melted",
    "For the Nutella Filling:",
    "1/3 cup plus 2 teaspoons heavy cream",
    "2 teaspoons granulated sugar",
    "5 ounces cream cheese, softened at room temperature",
    "1/3 cup plus 2 teaspoons (4 ounces) Nutella",
    "For the Chocolate Filling:",
    "3 ounces semisweet chocolate",
    "1/2 cup plus 2 teaspoons heavy cream",
    "4 teaspoons granulated sugar",
    "5 ounces cream cheese, softened at room temperature",
    "5 teaspoons Dutch-processed cocoa powder",
    "For Serving:",
    "Whipped cream",
    "Crushed toasted hazelnuts",
    "Crushed Oreos"
  ],
  "__v": 1
}