{
  "hash": "f9b60f742df0837a9f936e2919d6b66fb6bf5d8a",
  "title": "Lemon Marshmallow Pie",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/lemon-marshmallow-pie?mbid=social_facebook",
  "extension": "Chrome",
  "firstAdded": "2016-06-06T05:04:22.628000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350°. Using an electric mixer on low speed, beat butter, sugar, and salt in a medium bowl until butter is almost completely smooth, about 2 minutes. Increase speed to medium and beat until butter is creamy, about 2 minutes more. Mix in egg yolk and vanilla. Reduce speed to low, add flour and poppy seeds, if using, and mix until no dry spots remain.",
    "Firmly press dough into a 9\" pie dish (the firmer you press, the easier it will be to cut the baked crust). Bake until crust is golden brown on bottom and a shade or two darker at the edges, 25−35 minutes.",
    "1",
    "Just before crust is finished baking, combine lemon juice, salt, and ¼ cup sugar in a small saucepan. Scrape in seeds from vanilla bean and add pod. Bring to a simmer over medium heat, stirring to dissolve sugar.",
    "Whisk egg yolks, egg, and remaining ½ cup sugar in a medium bowl until no longer grainy and slightly lightened in color, about 2 minutes.",
    "Whisking constantly, gradually stream hot lemon mixture into eggs, then transfer mixture back to saucepan. Cook over medium heat, whisking constantly, until thickened and marks from whisk are just visible, 5–7 minutes. Remove from heat and whisk in butter until smooth, adding a couple of pieces at a time and whisking until incorporated before adding more.",
    "Reduce oven temperature to 300˚. Strain warm curd through a fine-mesh sieve into warm crust, filling right to top of crust (do not overfill; you may have a tablespoon or so extra).",
    "Bake pie until curd is set around the edges (filling should still wobble when dish is jiggled; it will continue to set as it cools), 15−20 minutes. Do not overbake or filling may curdle.",
    "Transfer pie to a wire rack and let cool, about 2 hours, then chill until cold, at least 1 hour.",
    "Do ahead: Pie can be baked 1 day ahead. Cover and keep chilled.",
    "2",
    "Make sure curd is chilled and set before preparing marshmallow topping. Place ¼ cup cold water in a small bowl and sprinkle gelatin over top. Let sit 10 minutes to soften.",
    "Beat egg whites and salt to soft peaks in the bowl of stand mixer fitted with whisk attachment.",
    "Meanwhile, bring sugar, corn syrup, and ¼ cup water to a boil in a small saucepan over medium heat, swirling pan until sugar is dissolved. Attach thermometer to side of saucepan and continue to cook over medium heat until thermometer registers 250°.",
    "Remove syrup from heat and add gelatin mixture, stirring to dissolve. With mixer on medium-high, carefully pour syrup into beaten egg whites in a slow, steady stream, aiming for the space between the side of the bowl and the whisk (avoid hitting whisk directly to prevent hot sugar from splattering all over). Continue to beat until mixture is dense and fluffy and very stiff peaks have formed (side of bowl will be cool to the touch), 5–10 minutes. Beat in vanilla.",
    "Marshmallow topping will become difficult to work with if given time to set up, so immediately (and quickly) dollop spoonfuls of marshmallow over curd, swirling and making decorative swoops as you go (make sure to extend topping all the way to edge of crust). Let sit until marshmallow is set and firm, at least 2 hours and up to 6 hours.",
    "Just before serving, heat broiler. Broil pie until marshmallow is toasted and golden brown in spots (keep a close eye on it to keep it from burning), about 2 minutes."
  ],
  "ingredients": [
    "0",
    "6 tablespoons chilled unsalted butter, cut into pieces",
    "3 tablespoons granulated sugar",
    "½ teaspoon kosher salt",
    "1 large egg yolk",
    "½ teaspoon vanilla extract",
    "1 cup all-purpose flour",
    "1 teaspoon poppy seeds (optional)",
    "1",
    "⅔ cup fresh lemon juice",
    "½ teaspoon kosher salt",
    "¾ cup granulated sugar, divided",
    "1 vanilla bean, split lengthwise",
    "3 large egg yolks",
    "1 large egg",
    "½ cup (1 stick) chilled unsalted butter, cut into pieces",
    "2",
    "1 envelope unflavored powdered gelatin (about 2 ½ tsp.)",
    "3 large eggs whites",
    "¼ teaspoon kosher salt",
    "⅔ cup sugar",
    "¼ cup light corn syrup",
    "2 teaspoons vanilla extract",
    "3",
    "A candy thermometer"
  ],
  "__v": 1
}