{
  "__v": 1,
  "directions": [
    "0",
    "For the dough: Combine both kinds of flour and 1/4 teaspoon salt in a large bowl and make a well in the center. Stir 1 1/4 cups warm water with the olive oil and yeast and pour into the well in the flour bowl. Stir until a soft and shaggy dough forms and then turn out onto a lightly-floured board and knead until smooth and the dough springs back when pressed with your thumb. Transfer to a bowl coated with nonstick cooking spray, mist the dough ball, cover and let stand until doubled in size, about 1 hour. Divide the dough into 2 pieces and roll each into a ball. Cover loosely and let rest an additional 30 minutes.",
    "For the sauce: Combine the oregano, tomatoes and garlic in a small skillet and bring to a simmer over medium heat. Continue to cook, stirring and lightly mashing the tomatoes with a spatula, until the tomatoes have released their liquid and the sauce has become thick and jammy, about 15 minutes. Remove from the heat, season with salt and pepper and stir in the basil.",
    "For assembling the pizza: Place 2 baking sheets in the oven and turn the oven to 500 degrees F. Stretch and/or roll each piece of dough until very thin and place each on a piece of lightly floured parchment paper that is the same size as the baking sheets heating in the oven (the dough will be a rustic oval shape).",
    "Rub each piece of dough with 1 teaspoon of the oil, sprinkle with 1/4 teaspoon salt and 1/8 teaspoon pepper and carefully transfer to the hot baking sheets. Bake until lightly browned, 8 to 10 minutes. Remove from the oven and evenly spread each pizza crust with the sauce, spreading about 1/2 inch from the edge, and then top with the mozzarella, Parmesan and spinach. Return to the oven and continue to bake until the crust is crisp and the cheese has melted and is browned in spots, 6 to 8 minutes, rotating the pans if necessary.",
    "Remove from the oven and place small spoonfuls of the ricotta on the pizzas and sprinkle with fresh basil. Sprinkle the pizzas with salt and crushed red pepper flakes, if using."
  ],
  "firstAdded": "2014-06-06T13:47:53.427000",
  "hash": "c62f075675df2126d6f60e7046f347541e915c5f",
  "href": "http://www.foodnetwork.com/recipes/food-network-kitchens/healthy-spinach-and-ricotta-pizza-recipe.html",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2012/9/5/1/FNK_Healthy-Spinach-Ricotta-Pizza-Recipe_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "ingredients": [
    "0",
    "2 cups bread flour, plus more for dusting",
    "1 cup whole-wheat pastry flour, such as Bob's Red Mill",
    "Kosher salt",
    "1 teaspoon olive oil",
    "1 envelope active dry yeast",
    "Nonstick cooking spray",
    "1/2 teaspoon dried oregano",
    "4 plum tomatoes, cored and roughly chopped",
    "2 cloves garlic, thinly sliced",
    "Kosher salt and freshly ground black pepper",
    "1/2 cup fresh chopped basil leaves",
    "2 teaspoons olive oil",
    "Kosher salt and freshly ground black pepper",
    "1 1/2 cups grated part-skim mozzarella cheese",
    "2 tablespoons grated Parmesan",
    "One 6-ounce bag baby spinach, steamed, squeezed dry and coarsely chopped",
    "1/2 cup part-skim ricotta cheese",
    "Torn fresh basil, for garnish",
    "Crushed red pepper flakes, for sprinkling, optional"
  ],
  "keywords": [
    "bread",
    "flour",
    "dusting",
    "wholewheat",
    "pastry",
    "bobs",
    "red",
    "kosher",
    "salt",
    "olive",
    "oil",
    "envelope",
    "active",
    "dry",
    "yeast",
    "cooking",
    "spray",
    "oregano",
    "plum",
    "tomatoes",
    "cored",
    "roughly",
    "garlic",
    "black",
    "pepper",
    "basil",
    "leaves",
    "partskim",
    "mozzarella",
    "cheese",
    "parmesan",
    "baby",
    "spinach",
    "steamed",
    "squeezed",
    "coarsely",
    "ricotta",
    "torn",
    "sprinkling"
  ],
  "title": "Healthy Spinach and Ricotta Pizza",
  "users": [
    null
  ]
}