{
  "hash": "ee387245e832a210cf6b4a8ba3f0edcb4c4a011c",
  "title": "Roasted Vegetable Baked Ziti",
  "image": "https://www.budgetbytes.com/wp-content/uploads/2014/12/Roasted-Vegetable-Baked-Ziti-text.jpg",
  "href": "https://www.budgetbytes.com/roasted-vegetable-baked-ziti/",
  "extension": "Firefox",
  "firstAdded": "2018-08-22T02:49:54.948000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 400 degrees. Chop the eggplant into small cubes (1/2-3/4 inch), cut the carrots into matchsticks, slice the onion, cut the squash into quarter rounds, and cut the broccoli into small florets.",
    "Divide the chopped vegetables between to baking sheets covered in foil. Drizzle each sheet with 1 Tbsp olive oil, 1/4 tsp salt, 1/4 tsp dried oregano, and a generous amount of freshly cracked pepper. Toss the vegetables on the baking sheet until they are all lightly coated in oil and spices (the more you toss, the more the oil will spread over the surface of all the vegetables). Roast the vegetables in the preheated oven for 30 minutes, or until they are soft and slightly charred on the edges. Stir once, half way through roasting.",
    "While the vegetables are roasting, cook the pasta according to the package directions (boil for 7-10 minutes, or until al dente). Once cooked, drain the pasta and return it to the pot with the burner turned off. Add the sauce and toss to coat.",
    "In a medium bowl, stir together the ricotta, the egg, one cup of the shredded mozzarella, 1/4 tsp salt, and a generous amount of freshly cracked pepper. Stir until smooth and even.",
    "Coat an 8x8 inch casserole dish with non-stick spray. Spread 1/3 of the pasta and marinara sauce over the bottom. Layer 1/2 of the ricotta mixture over the pasta, then 1/2 of the roasted vegetables. Repeat these three layers, then end with one final layer of pasta and sauce, and the final cup of shredded mozzarella.",
    "Reduce the heat in the oven to 375 degrees and bake the casserole for 30 minutes, or until heated through and the cheese on top is melted and slightly browned on the edges."
  ],
  "ingredients": [
    "0",
    "ROASTED VEGETABLES",
    "1 crown broccoli $1.09",
    "1 small eggplant $1.79",
    "1/2 lb. 4 medium carrots $0.55",
    "1 medium squash, yellow or zucchini $0.86",
    "1 medium yellow onion $0.33",
    "2 Tbsp olive oil $0.32",
    "salt and pepper $0.05",
    "1/2 tsp dried oregano $0.05",
    "PASTA",
    "3/4 lb. 12 oz. uncooked ziti $0.96",
    "1 cup ricotta cheese $1.03",
    "1 large egg $0.21",
    "2 cups shredded mozzarella, divided $2.48",
    "salt and pepper $0.05",
    "1 24 oz. jar marinara sauce $2.16"
  ],
  "__v": 1
}