{
  "hash": "3c3a0b0125a58fa6d0bfc3ebbfeee835538509bc",
  "title": "Kachka\" Cookbook: Braised Chanterelles & Potatoes",
  "image": "",
  "href": "http://katu.com/amnw/am-northwest-cooking-recipes/kachka-cookbook-braised-chanterelles-potatoes",
  "extension": "Chrome",
  "firstAdded": "2017-12-03T03:03:06.858000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Fill a large bowl or salad spinner with water, then thoroughly clean the mushrooms by dunking them in and vigorously swishing them around to shake loose any debris. Remove quickly, and repeat the process with fresh water until all the mushrooms are clean. Spread the mushrooms out on clean dish towels to dry.",
    "Tear any very large chanterelles into halves or quarters. Heat a medium-sized Dutch oven or heavy-sided pot over medium heat, and melt the butter. Add the mushrooms and cook down, stirring occasionally, until the mushrooms give off their liquid and it mostly evaporates, about 10 minutes (you can cover the pot until the liquid comes out, so that the mushrooms don’t scorch, but then remove the cover to help the liquid cook off).",
    "While the mushrooms are cooking, whisk together the heavy cream, smetana, and salt. When the mushrooms have cooked down, pour in the cream mixture, and stir everything together. Add the potatoes and stir again, coating everything with the braising liquid. Bring the mixture to a simmer and partially cover (leave a small crack to let steam escape), then reduce the heat until it’s just high enough to maintain the gentlest possible simmer. Simmer for 2 to 3 hours, or until the potatoes and cream have both turned a light golden brown, and the liquid has cooked down a bit but is still saucy. Check it once an hour or so to see that things are moving along (no need to stir). Serve hot, with a bit of crusty bread to sop up the sauce if desired."
  ],
  "ingredients": [
    "0",
    "2 pounds chanterelles",
    "1 tablespoon unsalted butter",
    "1½ cups heavy cream",
    "1½ cups smetana (page 351) or European-style sour cream",
    "1½ tablespoons kosher salt",
    "2 pounds Yukon Gold potatoes, peeled and cut into 1½-inch chunks"
  ],
  "__v": 1
}