{
  "hash": "ba12fa36c77d5e9bd9b700559b549621c988e4ed",
  "title": "Vegan Cheese Ball - Cheddar Cheese Ball",
  "image": "http://www.veganricha.com/wp-content/uploads/2015/10/V-vegan-cheese-ball-pumpkin-halloween-0796-300x450.jpg",
  "href": "http://www.veganricha.com/2015/10/vegan-cheese-ball-cheddar-cheese-ball.html",
  "extension": "",
  "firstAdded": "2015-12-11T22:13:51.923000",
  "users": [
    null
  ],
  "keywords": [
    "scant",
    "chickpea",
    "garbanzo",
    "bean",
    "flour",
    "besan",
    "nutritional",
    "yeast",
    "prepared",
    "mustard",
    "pickled",
    "jalapeno",
    "onion",
    "garlic",
    "turmeric",
    "color",
    "smoked",
    "paprika",
    "lemon",
    "juice",
    "sharpertangier",
    "tahini",
    "texture",
    "water",
    "salt",
    "generous",
    "black",
    "pepper",
    "red",
    "roasted",
    "hatch",
    "chile",
    "daiya",
    "shreds",
    "vegan",
    "cheddar",
    "rejuvelac",
    "miso",
    "sundried",
    "tomato",
    "tangier",
    "flavor",
    "bread",
    "crumbs",
    "use",
    "tortilla",
    "chips",
    "make",
    "glutenfree",
    "cayenne"
  ],
  "directions": [
    "0",
    "In a blender blend all the ingredients under cheese until smooth. Blend well. Pour into a small skillet over medium-low heat. Add the other add ins like pepper flakes or chili if you like. Cook for 3 to 4 minutes. Stir frequently. The mixture will get lumpy and then smooth out into a custard-ish consistency. You can taste the mixture carefully at this point and adjust salt/tang . So not add too much mustard, the mustard taste gets very strong as the cheese sits. Continue to cook for another 1 to 2 minutes or until the chickpea flour does not taste raw.",
    "Grease the containers you plan to use to store the mixture in. Pour mixture in the container/s. Use greased hands to press or even it out. Let it chill for an hour. I used 2 small bowls. *The chickpea flour thickens up allthe liquid in the recipe into a creamy mixture, that sets as it sits. So you get about a scant ¾ cup cheese mixture from the recipe.",
    "To make the bread crumb coating: Pulse the bread crumbs, nutritional yeast and spices a few times. Place in a bowl.",
    "Remove the cheese from the container, place over each other to form a ball. Press slightly to stick. Roll in the bowl to coat or sprinkle the coating on the ball generously on all sides. Or press finely chopped herbs of choice all over. Place on a plate. Serve as is, or warm for a few seconds in the microwave and serve.",
    "*If it doesn't work out well, melt the cheese with non dairy milk in a skillet and use for mac and cheese."
  ],
  "ingredients": [
    "0",
    "2 scant tablespoons chickpea flour (garbanzo bean flour or 2 full Tbsp besan)",
    "2 tbsp nutritional yeast",
    "½ to ¾ tbsp prepared mustard",
    "½ tbsp sliced pickled jalapeno",
    "1 tsp onion powder",
    "⅓ tsp garlic powder",
    "¼ tsp turmeric (for color)",
    "¼ tsp smoked paprika",
    "1 to 1.5 tbsp lemon juice (more for sharper/tangier)",
    "1 tbsp tahini, 2 tbsp for more texture",
    "½ cup water",
    "¼ tsp or more salt",
    "a generous pinch of black pepper",
    "1",
    "red pepper flakes, chopped roasted hatch or jalapeno chile, 1 to 2 tbsp daiya cheddar shreds or other vegan cheddar",
    "add rejuvelac or miso or sundried tomato for tangier flavor",
    "2",
    "2 tbsp bread crumbs (use tortilla chips to make gluten-free)",
    "2 tsp nutritional yeast",
    "½ to 1 tsp paprika or cayenne"
  ],
  "__v": 1
}