{
  "__v": 1,
  "directions": [
    "0",
    "Combine milk, water and butter in a small saucepan. Heat gently over low heat until liquids are just warm (not hot - it will kill the yeast). Remove from heat and stir until butter is melted.",
    "Place 2 cups of flour, the sugar, salt and yeast in a bowl. If you're using a stand mixer, attach your dough hook. Mix for a few seconds and then gradually add the egg. Mix and then add the liquids and mix for a couple of minutes. (If you are not using a mixer, just do this process in a large bowl and use a wooden spoon and then your hands).",
    "Add remaining cup of flour until dough clings to the hook and cleans the sides of the bowl. Add just enough flour until the dough gathers into a ball. You may have to add a little less or a little more than a cup. Knead for about 5 minutes. Place in a greased bowl. Cover and set in a warm location; let rise until double, about 45 minutes to 1 hour.",
    "Mix the cream cheese, sugar and lemon zest in a small bowl.",
    "Place a piece of parchment paper (the size of a baking sheet) on the counter. Punch the dough down and place on the parchment paper. Roll the dough out with a rolling pin until you have a 13\"x16\" rectangle (don't sweat about the exact size). A piece of wax paper or plastic wrap between your rolling pin and the dough will really help make the rolling easier. Spread the cream cheese mixture down the middle of the dough, in about a 4-inch strip, leaving an inch or two of dough at either end uncovered. Spread the blueberry preserves on top of the cream cheese and top with the fresh blueberries. Squeeze the lemon juice over the blueberries.",
    "With a very sharp paring knife, cut strips on the diagonal down the sides of the dough. Make two cuts on each end to make an \"end flap\" (see photos). Fold the short end flaps over the filling and then start folding the diagonal strips of dough over. You can do all one side at a time or alternate strips from each side. Trim away excess. Slide walkaway and parchment paper right onto a baking sheet. Cover with a light towel; let rise for about 40 minutes. Preheat your oven to 375 F degrees.",
    "Beat the egg with the water in a small bowl and brush the walkway with it, covering the entire surface. Sprinkle with the pearl sugar.",
    "Bake at 375 F for 20 or 25 minutes, until golden brown. Slide off of parchment paper and place on serving platter or cutting board. You can serve it hot or warm or at room temperature. Cover lightly with plastic wrap if any is leftover.",
    "Make ahead tip: If you want to save some time making this in the morning, make your dough the night before, let it do the first rise and then punch it down in the bowl, cover with plastic wrap and refrigerate overnight. In the morning, take the dough out, roll it out and proceed with the rest of the recipe. I even make up the cream cheese mixture the night before and refrigerate."
  ],
  "firstAdded": "2014-07-11T23:09:01.564000",
  "hash": "001fbbc2e4664e3713e44c22e67cba7894430f85",
  "href": "http://italiandish.squarespace.com/imported-20090913150324/2012/6/4/blueberry-walkaway.html",
  "image": "http://italiandish.squarespace.com/storage/walkawaypartthree.jpg?__SQUARESPACE_CACHEVERSION=1338771906341",
  "ingredients": [
    "0",
    "for the dough:",
    "1/2 cup milk",
    "1/3 cup water",
    "2 tablespoons butter",
    "about 3-1/2 cups cups of flour (more or less)",
    "3 Tablespoons sugar",
    "1/2 teaspoon salt",
    "2 teaspoons of instant dry yeast (fast acting yeast) or 1 packages of active dry yeast (I prefer instant yeast)*",
    "1 extra large egg, room temperature",
    "for the filling:",
    "4 ounces of cream cheese, softened",
    "zest and juice of 1 lemon",
    "1 teaspoon sugar",
    "1/2 cup blueberry preserves",
    "1/4 cup fresh blueberries",
    "for the egg wash:",
    "1 egg",
    "1 teaspoon water",
    "2 tablespoons swedish pearl sugar"
  ],
  "keywords": [
    "dough",
    "milk",
    "water",
    "butter",
    "flour",
    "sugar",
    "salt",
    "fast",
    "acting",
    "active",
    "dry",
    "prefer",
    "instant",
    "yeast",
    "extra",
    "egg",
    "room",
    "filling",
    "cream",
    "cheese",
    "softened",
    "zest",
    "juice",
    "lemon",
    "blueberry",
    "preserves",
    "blueberries",
    "wash",
    "swedish",
    "pearl"
  ],
  "title": "Blueberry Walkway",
  "users": [
    null
  ]
}