{
  "hash": "b158444804e893179500508af529710beb028a70",
  "title": "Caprese Mac and Cheese.",
  "image": "https://www.halfbakedharvest.com/wp-content/uploads/2015/08/4-Cheese-Caprese-Mac-and-Cheese-13.jpg",
  "href": "https://www.halfbakedharvest.com/4-cheese-caprese-mac-and-cheese/",
  "extension": "",
  "firstAdded": "2017-07-13T22:33:18.104000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 375 degrees F. Spray a baking dish with nonstick spray or lightly grease with oil.",
    "Bring a large pot of salted water to a boil. Boil the pasta until al-dente. You want it to have a bit of bite to it. It will finish cooking in the oven. Drain well.",
    "While the pasta boils add 3 tablespoons butter to a medium skillet and melt. Add the garlic and sauté 30 seconds then throw in the crushed crackers and toss to coat. Toast the crumbs for 3-5 minutes, stirring frequently to avoid burning. Once the crumbs are lightly toasted remove form the heat and set aside.",
    "In the same pot you boiled the pasta, melt the remaining 4 tablespoons butter over medium heat. Whisk in the flour. Reduce the heat to medium-low and let cook/bubble for 1 minute, stirring once or twice to avoid burning. Gradually whisk in the milk and raise the heat up to medium-high. Bring the mixture to a boil, whisking frequently until the sauce has thickened, about 2-3 minutes. Remove from the heat and stir in all of the cheese, pesto, mustard powder, cayenne, salt and pepper. Stir until the cheese is fully melted (if needed, return the pot to the heat to fully melt the cheese). Stir in the pasta + cherry tomatoes and transfer to the prepared baking dish. Evenly layer the sliced tomatoes on top of the pasta. Sprinkle on the toasted cracker crumbs and place the baking dish onto a baking sheet. Bake for 25-30 minutes or until the crumbs are golden brown and the sauce is bubbling. Remove from the oven and let site five minutes (yeah, right). Top with fresh basil. Dig in!!"
  ],
  "ingredients": [
    "0",
    "7",
    "tablespoons",
    "butter",
    "divided",
    "1",
    "clove",
    "garlic",
    "minced or grated",
    "1",
    "cup",
    "crushed Ritz crackers",
    "1",
    "pound",
    "of your favorite short cut pasta",
    "1/4",
    "cup",
    "all-purpose flour",
    "3",
    "cups",
    "milk",
    "warm",
    "1 1/4",
    "cups",
    "sharp white cheddar cheese",
    "shredded",
    "1",
    "cup",
    "mozzarella cheese",
    "shredded (add an extra 1/4 cup...if you want!)",
    "1 1/4",
    "cups",
    "havarti cheese",
    "shredded",
    "4-6",
    "ounces",
    "Brie",
    "rind removed and chopped (I surely used 6 ounces)",
    "1/4",
    "cup",
    "[homemade basil pesto | https://www.halfbakedharvest.com/20-minute-brown-butter-chunky-basil-pesto-pasta/] or store bought",
    "1/4",
    "teaspoon",
    "mustard powder",
    "1/4",
    "teaspoon",
    "cayenne pepper",
    "1/2",
    "teaspoons",
    "salt + pepper",
    "1",
    "cup",
    "cherry tomatoes",
    "1-2",
    "regular or heirloom tomatoes",
    "sliced",
    "fresh basil",
    "for serving"
  ],
  "__v": 1
}