{
  "hash": "681ae68e79d0709e8d0e5738c83e0d865594282c",
  "title": "Maida Heatter's Budapest Coffee Cake",
  "image": "https://images.food52.com/-QOhbni9kCypLnkL5mh_j2Rocx8=/753x502/a8accfd5-b601-4f1d-a785-a01d5a1bed93--2015-1124_budapest-coffee-cake-with-chocolate_bobbi-lin_14798_2-.jpg",
  "href": "https://food52.com/recipes/39675-maida-heatter-s-budapest-coffee-cake",
  "extension": "Chrome",
  "firstAdded": "2018-01-16T01:44:09.715000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a small bowl, mix together all of the ingredients. Set aside.",
    "1",
    "Preheat the oven to 350° F and butter a 10-inch Bundt pan.",
    "Into a large bowl, sift flour, baking soda, baking powder, and salt. Using a paddle attachment of a stand mixer, cream the butter. Add 2 teaspoons of the vanilla and the sugar and beat on medium speed for a minute or two.",
    "Add eggs, one at a time, beating each until just incorporated. Scrape down sides of bowl, as necessary, to keep mixture smooth. Beat at high speed until mixture is light and creamy, about 1 minute.",
    "Turn mixer to low speed. Add dry ingredients in three additions and sour cream in two additions, beating only until smooth after each addition.",
    "Spread a thin layer of batter in bottom of prepared pan. Sometimes it’s easier to use a small spoon to drop some batter into pan, and then to smooth it together. Top with 1/3 of nut mixture. Repeat until you have 4 layers of batter into pan and smooth it together. Top layer will be batter.",
    "Bake 50 to 60 minutes, or until cake tester inserted in center of cake comes clean. Remove from oven and cool for 5 minutes, then turn out and re-invert on a rack.",
    "Combine confectioners' sugar, hot milk, and remaining 1 teaspoon vanilla extract in a small bowl. Mix well, Mixture should have the consistency of a thick cream sauce. Place a sheet of wax paper underneath a cooling rack. Pour glaze over cake, letting it run down the sides, while still hot. When glaze is set, transfer cake to a serving plate.",
    "Serve cake warm or at room temperature."
  ],
  "ingredients": [
    "0",
    "3/4 cup firmly packed dark brown sugar",
    "1 tablespoon cinnamon",
    "1 tablespoon unsweetened cocoa",
    "2 to 3 tablespoons raisins, coarsely chopped",
    "1 cup toasted walnuts, finely chopped",
    "1",
    "3 cups sifted all-purpose flour",
    "1 1/2 teaspoons baking powder",
    "1 1/2 teaspoons baking soda",
    "1/2 teaspoon salt",
    "6 ounces (1 1/2 sticks) butter, at room temperature",
    "3 teaspoons vanilla extract, vanilla",
    "1 1/2 cups sugar",
    "3 eggs, at room temperature",
    "2 cups sour cream, at room temperature",
    "2 cups confectioners' sugar",
    "2 to 3 tablespoons hot milk"
  ],
  "__v": 1
}