{
  "hash": "34c19b38521f56ad4a9b69eac78a7d7f0f05bdf3",
  "title": "Salted Caramel Pretzel Crunch Bars",
  "image": "https://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2016/09/salted-caramel-pretzel-crunch-bars-recipe-2.jpg",
  "href": "https://sallysbakingaddiction.com/2016/10/07/salted-caramel-pretzel-crunch-bars/",
  "extension": "Chrome",
  "firstAdded": "2018-09-15T22:19:26.590000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350°F (177°C). Line an 8 or 9-inch square baking pan with parchment paper with enough overhang on the sides to easily remove the bars from the pan. Set aside.",
    "Using a handheld or stand mixer fitted with a paddle attachment, beat the butter on high speed until smooth and creamy - about 1 minute. Add the flour, sugar, salt, egg yolk, and vanilla extract and beat on high speed for 2 minutes until crumbly. Get your hands in there to make the dough come together. Press tightly into prepared pan. Press pretzel pieces evenly on top. Bake for 20 minutes. Allow to cool completely before adding the caramel (I stick it in the refrigerator to speed this up).",
    "Prepare caramel and wait for it to cool until it slightly thickens. Pour/spoon over crust. Allow to cool and set completely before topping with chocolate. Again, I stick it in the refrigerator to speed it up.",
    "Melt the chocolate and coconut oil in the microwave in 15 second increments, stopping and stirring until completely melted. Pour over cooled caramel. Top with sea salt. Stick in the refrigerator to cool completely.",
    "Lift the parchment paper out of the pan using the overhang on the sides and cut into squares. Store in an airtight container at room temperature for up to a week."
  ],
  "ingredients": [
    "0",
    "10 Tablespoons (1 stick plus 2 Tbsp or 145g) unsalted butter, slightly soft (see important note!)1",
    "1 cup + 2 Tablespoons (141g) all-purpose flour",
    "1/4 cup (50g) granulated sugar",
    "1/4 teaspoon salt",
    "1 large egg yolk, at room temperature",
    "1 teaspoon pure vanilla extract",
    "1 cup (240ml) salted caramel sauce (the full recipe)",
    "1 cup (50-60g) chopped pretzels",
    "6 ounces chopped semi-sweet chocolate (or 1 cup (180g) semi-sweet chocolate chips)2",
    "2 teaspoons coconut oil",
    "optional: sea salt"
  ],
  "__v": 1
}