{
  "hash": "54857790585eab3d4d02c542eb3139c3a825b209",
  "title": "Spaghetti and Meatballs",
  "image": "",
  "href": "http://www.lidiasitaly.com/recipes/detail/1262",
  "extension": "",
  "firstAdded": "2015-08-21T05:32:02.081000",
  "users": [
    null
  ],
  "keywords": [
    "italian",
    "plum",
    "tomatoes",
    "extra",
    "virgin",
    "olive",
    "oil",
    "medium",
    "onion",
    "red",
    "pepper",
    "bay",
    "leaves",
    "peperoncino",
    "meatballs",
    "pork",
    "beef",
    "breadcrumbs",
    "grana",
    "padano",
    "parmigianoreggiano",
    "parsley",
    "garlic",
    "egg",
    "salt",
    "black",
    "allpurpose",
    "flour",
    "spaghetti"
  ],
  "directions": [
    "0",
    "Pass the tomatoes and their liquid through a food mill fitted with the fine disc or crush by hand. Heat ¼ cup olive oil in a 4 to 5-quart pot over medium heat. Stir in the onions and cook, stirring, until wilted, about 4 minutes. Pour in the tomatoes, add the crushed red pepper, bay leaves and season lightly with salt and pepper. Bring to a boil, then lower the heat so the sauce is at a lively simmer. Cook, stirring occasionally, for 30 minutes.",
    "Crumble the beef and pork into a mixing bowl. Sprinkle the breadcrumbs, 1/3 cup grated cheese, parsley and garlic over the meat. Beat the eggs with the salt and teaspoon pepper in a small bowl until blended, then pour over the meat mixture. Mix the ingredients with clean hands just until evenly blended, and shape the meat mixture into 1 ½-inch balls. Dredge the meatballs in the flour until lightly but evenly coated.",
    "Heat ¼ cup olive oil and the vegetable oil in a large, heavy skillet over medium-high heat. Slip as many meatballs into the skillet as will fit without crowding. Fry, turning as necessary, until golden brown on all sides, about 6 minutes. Adjust the heat as the meatballs cook to prevent them from overbrowning. Remove the meatballs and repeat if necessary with the remaining meatballs. Add the browned meatballs to the tomato sauce and cook, stirring gently with a wooden spoon, until no trace of pink remains at the center of the meatballs, about 30 minutes.",
    "Bring 6 quarts of salted water to a boil in an 8-quart pot over high heat. Stir the spaghetti into the boiling water. Return to a boil, stirring frequently. Cook the pasta, semi-covered, stirring occasionally, until done, about 8 minutes. Drain the pasta and return it to the empty pot. Spoon in about 2 cups of the tomato sauce, tossing well until the pasta is coated with sauce. Remove from the heat and toss in 2/3 cup grated cheese. Check the seasoning and add salt and pepper if necessary.",
    "Serve the pasta in warm bowls or piled high on a large warm platter. Spoon a little more of the sauce over the pasta and pass the remaining sauce separately. Pass the meatballs, family style in a bowl, or top the bowls or platter of spaghetti with them."
  ],
  "ingredients": [
    "0",
    "For the Sauce",
    "Two 35-ounce cans Italian plum tomatoes, with their liquid",
    "¼ cup extra virgin olive oil",
    "1 medium onion, chopped (about 1 cup)",
    "1 teaspoon crushed red pepper",
    "2 bay leaves",
    "½ teaspoon peperoncino (crushed red pepper)",
    "For the Meatballs",
    "½ pound ground pork",
    "½ pound ground beef",
    "1 cup fine dried breadcrumbs",
    "1 cup freshly grated Grana Padano or Parmigiano-Reggiano",
    "¼ cup chopped fresh Italian parsley",
    "2 garlic cloves, peeled and finely chopped",
    "1 large egg",
    "1 teaspoon salt",
    "¼ teaspoon freshly ground black pepper",
    "all-purpose flour",
    "¼ cup olive oil",
    "¼ cup vegetable oil",
    "1 pound spaghetti"
  ],
  "__v": 1
}