{
  "__v": 1,
  "directions": [
    "0",
    "Versa la farina 00 e la farina di semola nella ciotola del Moulinex Masterchef Gourmet, forma una fontana con un buco ampio nel mezzo. Lì rompi le uova, aggiungi l’olio ed il sale. Aziona la planetaria con il gancio per fare la pasta fresca e impasta per circa 5 minuti a velocità media, finché non ottieni un palla di pasta liscia, vellutata e non più appiccicosa, avvolgila nella pellicola trasparente e lasciala riposare per 30 minuti a temperatura ambiente.",
    "Dopo i 30 minuti di riposo, tira la sfoglia.",
    "Suddividi la palla in quattro parti, stendila leggermente con il mattarello e un po' di farina di semola e poi stendila sottile con l'accessorio per lasagne, partendo dalla larghezza uno e arrivando fino alla 8.",
    "Lasciala asciugare sulla tavola, precedentemente cosparsa di semola.",
    "Dopo una ventina di minuti taglia le tagliatelle con l'apposito accessorio.",
    "Adagiale sulla tavola e cospargile di farina di semola, lasciale asciugare e nel frattempo prepara il condimento per la pasta.",
    "Scigli le acciughe con qualche cucchiaio di olio extravergine di oliva a fuoco medio, poi aggiungi le carote tagliate a rondelle, la cipolla a spicchi sottili e le cimette dei broccoli tagliate a metà.",
    "Regola di sale e cuoci a fuoco medio basso per 25 minuti finché le verdure non sono tenere.",
    "Alla fine aggiungi un altro cucchiaio di olio e il pangrattato e mescola per tostare il pane.",
    "Cuoci le tagliatelle al dente in acqua bollente salata – basteranno pochissimi minuti – scolale, versale in padella e saltale con le verdure per un minuto per insaporirle. Servile subito, con del parmigiano grattato a parte per chi dovesse chiederlo."
  ],
  "firstAdded": "2014-10-08T19:24:38.512000",
  "hash": "5863d5b28a29c03902aa1709365b7abc89891320",
  "href": "http://it.julskitchen.com/primi-piatti/pasta-fresca/le-tagliatelle-dellorto",
  "image": "http://farm9.staticflickr.com/8537/10221264906_ae4f9a0bf5_b.jpg",
  "ingredients": [
    "0",
    "100 g farina 00",
    "100 g farina di semola",
    "1 pizzico di sale",
    "1 cucchiaio di olio extravergine di oliva",
    "2 uova medie",
    "1",
    "3 filetti di acciuga sottolio",
    "Olio extravergine di oliva",
    "2 carote medie",
    "2 cipolle rosse piccole",
    "250 g di broccoli",
    "3 cucchiai di pangrattato",
    "Sale"
  ],
  "keywords": [
    "farina",
    "semola",
    "pizzico",
    "sale",
    "cucchiaio",
    "olio",
    "extravergine",
    "oliva",
    "uova",
    "medie",
    "filetti",
    "acciuga",
    "sottolio",
    "carote",
    "cipolle",
    "rosse",
    "piccole",
    "broccoli",
    "cucchiai",
    "pangrattato"
  ],
  "title": "Le tagliatelle dell'orto",
  "users": [
    null
  ]
}