{
  "hash": "6fea2694c68dc3b0435d1eb3eb3cba68573c0247",
  "title": "Isla Flotante (Floating Island) or Torta en Leche (Cake in Milk)",
  "image": "https://images.food52.com/vRivryZ9kz84vxBs--fer-FNbKA=/753x502/fe390327-98f5-4d9f-87bf-ae60c28e50de--IMG_2099.jpeg",
  "href": "https://food52.com/recipes/65603-isla-flotante-floating-island-or-torta-en-leche-cake-in-milk",
  "extension": "Chrome",
  "firstAdded": "2016-12-05T22:03:16.713000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat oven to 350 degrees (180 C).",
    "Put milk in a deep saucepan over high heat. Add half the sugar, vanilla, and cinnamon, and bring to a boil, stirring occasionally to dissolve the sugar. Once bubbles break the surface and the sugar is fully dissolved, remove from the heat and leave aside.",
    "In a standing mixer, whip egg whites and sugar to stiff peaks (you can also prepare this batter using a big bowl and a whisk, it'll just require a lot more energy).",
    "At medium speed (around 4 on a KitchenAid), add the yolks one at a time, waiting to add the next until the previous one has been fully incorporated into the meringue. The finished mixture should be consistently off-white with no streaks of darker yellow from the yolks.",
    "Once the yolks are fully incorporated, add the flour in a slow flurry, scraping down the sides to ensure the batter is smooth. The finished batter should be glossy and thick and without bubbles.",
    "Remove the cinnamon from the milk and pour the mixture into a round baking pan, about 10.5\" in diameter and 2.5\" deep (you can use a range of other sizes for this, too, preferably avoiding anything that's too tall and narrow-mouthed, since that will bring the milk to a stiffer boil in the oven and disturb the batter. Ramekins work for individual cakes. Otherwise, something about 6\" in diameter and 7-8\" inches deep works nicely if you really want the cake to float). If you're using this size, add the whole liter. For other sizes, fill the vessel roughly 2/3 of the way up. Float the batter over the milk in a layer about 1//2 an inch thick.",
    "Bake on a baking tray for 18 minutes, or until the cake is golden and inflated. Remove from the oven and let sit for 10-15 minutes, allowing the cake to deflate.",
    "To serve, bring the cake to room temperature or put it in the fridge for a couple of hours to serve it cold. Use a spoon to serve up messy slices with the milk ladled over. If you used a shallower pan, the milk works as more of a sauce. With a deeper one, this is best served in bowls, with the milk served over the spongey cake like a soup."
  ],
  "ingredients": [
    "0",
    "1 liter whole milk",
    "6 eggs, whites and yolks separated",
    "6 tablespoons all-purpose flour, sifted",
    "12 tablespoons sugar",
    "1 dash vanilla extract (or seeds of one vanilla bean)",
    "1 piece cinnamon stick"
  ],
  "__v": 1
}