{
  "hash": "4056b3468c07eae5c2c4d338784f75c50f683e06",
  "title": "Quinoa Peanut Butter Crunch Cups",
  "image": "http://kriscarr.com/wp-content/uploads/quinoacups.jpg",
  "href": "http://kriscarr.com/recipe/quinoa-peanut-butter-crunch-cups/",
  "extension": "",
  "firstAdded": "2015-12-25T12:33:09.753000",
  "users": [
    null
  ],
  "keywords": [
    "puffed",
    "quinoa",
    "peanut",
    "butter",
    "coconut",
    "oil",
    "maple",
    "syrup",
    "vanilla"
  ],
  "directions": [
    "0",
    "Add the puffed quinoa to a medium-sized mixing bowl.",
    "Add the peanut butter, coconut butter, coconut oil, maple syrup, and vanilla extract to a medium sauce pan. Heat over low, and whisk continuously for 4-5 minutes or until completely melted and smooth.",
    "Pour the peanut butter mixture over the puffed quinoa and stir to coat.",
    "Place 16-18 muffin liners on a baking pan. Drop heaping tablespoons of the quinoa mixture into the muffin liners and gently smooth out with a spoon.",
    "Pop the pan into the freezer for 1 hour to set.",
    "Once the cups have set, you can transfer them to the refrigerator to store.",
    "*You can purchase puffed quinoa, but if you prefer to make your own, this is what I typically do: Heat a large stock pot over medium heat. Once the pot is hot, pour a small amount of pre-rinsed and dried quinoa over the bottom of the pan. Gently move the pan so that the quinoa swirls around as it pops (this helps prevent burning). Once all the quinoa has popped (a minute or two), pour it into a bowl and repeat until you have 1 1/2 cups. You’ll notice that the quinoa has a very quiet crackle rather than a popcorn-like “pop”, and its popped state is only the tiniest bit larger than its unpopped state."
  ],
  "ingredients": [
    "0",
    "1 1/2 cups puffed quinoa*",
    "1/4 cup + 2 tablespoons peanut butter",
    "1/4 cup + 2 tablespoons coconut butter",
    "2 tablespoons coconut oil",
    "1 1/2 tablespoons pure maple syrup",
    "1 teaspoon vanilla extract"
  ],
  "__v": 1
}