{
  "__v": 1,
  "directions": [
    "0",
    "Heat oven to 200 degrees F.",
    "Heat the safflower oil in a 5-quart Dutch oven over high heat until it reaches 320 degrees.",
    "Using a V-slicer with a wide blade, slice the potatoes with the skin on. Place in a large bowl with cold water.",
    "In a bowl, whisk together the flour, baking powder, salt, cayenne pepper, and Old Bay seasoning. Whisk in the beer until the batter is completely smooth and free of any lumps. Refrigerate for 15 minutes. Note: The batter can be made up to 1 hour ahead of time.",
    "Drain potatoes thoroughly, removing any excess water. When oil reaches 320 degrees, submerge the potatoes in the oil. Working in small batches, fry for 2 to 3 minutes until they are pale and floppy. Remove from oil, drain, and cool to room temperature.",
    "Increase the temperature of the oil to 375 degrees. Re-immerse fries and cook until crisp and golden brown, about 2 to 3 minutes. Remove and drain on roasting rack. Season with kosher salt while hot and hold in the oven.",
    "Allow oil to return to 350 degrees. Lightly dredge fish strips in cornstarch. Working in small batches, dip the fish into batter and immerse into hot oil. When the batter is set, turn the pieces of fish over and cook until golden brown, about 2 minutes. Drain the fish on the roasting rack. Serve with malt vinegar."
  ],
  "firstAdded": "2014-05-28T16:21:51.725000",
  "hash": "f29865dafee24245af79973a66aac411adc0cd86",
  "href": "http://www.foodnetwork.com/recipes/alton-brown/chips-and-fish-recipe.html",
  "image": "",
  "ingredients": [
    "0",
    "1 gallon safflower oil",
    "4 large Russet potatoes",
    "Kosher salt",
    "2 cups flour",
    "1 tablespoon baking powder",
    "1 teaspoon kosher salt",
    "1/4 teaspoon cayenne pepper",
    "Dash Old Bay Seasoning",
    "1 bottle brown beer, cold",
    "1 1/2 pounds firm-fleshed whitefish ( tilapia, pollock, cod), cut into 1-ounce strips",
    "Cornstarch, for dredging"
  ],
  "keywords": [
    "safflower",
    "oil",
    "russet",
    "potatoes",
    "kosher",
    "salt",
    "flour",
    "baking",
    "cayenne",
    "pepper",
    "old",
    "bay",
    "seasoning",
    "bottle",
    "brown",
    "beer",
    "cold",
    "firmfleshed",
    "whitefish",
    "tilapia",
    "pollock",
    "cod",
    "strips",
    "cornstarch",
    "dredging"
  ],
  "title": "Chips and Fish",
  "users": [
    null
  ]
}