{
  "hash": "0a4200b22412aadbb95986a06d1de1893640585c",
  "title": "Brazil Goat Cheese with Roasted Rosemary Apricots",
  "image": "http://i0.wp.com/kissmybowl.com/wp-content/uploads/2014/09/1.jpg?resize=640%2C427",
  "href": "http://kissmybowl.com/cycles-seasons-brazil-nut-cheese/",
  "extension": "",
  "firstAdded": "2015-12-17T20:05:03.890000",
  "users": [
    null
  ],
  "keywords": [
    "raw",
    "brazil",
    "nuts",
    "soaked",
    "hours",
    "nutritional",
    "yeast",
    "apple",
    "cider",
    "vinegar",
    "filtered",
    "water",
    "zaatar",
    "salt"
  ],
  "directions": [
    "0",
    "Add the soaked Brazil nuts, nutritional yeast, apple cider, water & salt to a high speed blender and blitz until the mixture has reached a smooth consistency. Grab a glass bowl and place it in the sink. Using a nut milk or sprouting bag, pour the entire contents of the blender into the nut milk bag & squeeze out as much moisture as possible. Once the mixture is slightly moist but slightly crumbly, keeping it in the bag place it into a ramekin or shaped bowl. Allow the nut cheese to sit on the counter for two full days – checking it periodically to make sure that it is fermenting safely. It should smell slightly sour, but not fowl. Residual moisture in the bottom of the ramekin is normal. *If it smells funky at all – turf it and start again. It’s better to be safe than have a sore belly. Home cuturing is fun, but keep it safe!* After two days, remove from ramekin gently and roll out of the nut milk bag. Put the cheese on a small plate – without the ramekin, free standing & refrigerate for one more day. Once the cheese is set, pour the za’atar onto a flat surface and roll to cover the whole cheese ball. Plate with Roasted Rosemary Apricots, fresh seasonal fruit, your favorite preserves and the best crackers possible!"
  ],
  "ingredients": [
    "0",
    "1 Cup Raw Brazil Nuts – soaked for 5-8 hours",
    "1 Tablespoon Nutritional Yeast",
    "3 Teaspoons of Raw Apple Cider Vinegar",
    "3/4 Cups Filtered Water",
    "1/4 Cup Za’atar",
    "Salt to taste"
  ],
  "__v": 1
}