{
  "hash": "d04cdf75d7c7084f31b248f1ed68131d952c582e",
  "title": "Seared Ahi Tuna Poke Salad with Hula Ginger Vinaigrette + Wonton Crisps",
  "image": "http://www.halfbakedharvest.com/wp-content/uploads/2014/04/Seared-Ahi-Tuna-Poke-Salad-with-Hula-Ginger-vinaigrette-+-Wonton-Crisps.-101.jpg",
  "href": "http://www.halfbakedharvest.com/seared-ahi-tuna-poke-salad-hula-ginger-vinaigrette-wonton-crisps/",
  "extension": "Chrome",
  "firstAdded": "2015-07-15T18:25:32.839000",
  "users": [
    null
  ],
  "keywords": [
    "square",
    "wonton",
    "wrappers",
    "strips",
    "use",
    "corn",
    "tortillas",
    "make",
    "gluten",
    "free",
    "ahi",
    "tuna",
    "steaks",
    "soy",
    "starch",
    "pineapple",
    "juice",
    "honey",
    "chile",
    "garlic",
    "sriracha",
    "black",
    "white",
    "sesame",
    "seeds",
    "spring",
    "greens",
    "cilantro",
    "jalapeno",
    "red",
    "hot",
    "oil",
    "rice",
    "vinegar",
    "tahini",
    "lime",
    "zested",
    "juiced",
    "ginger",
    "clove"
  ],
  "directions": [
    "0",
    "Preheat the oven to 400 degrees F.",
    "Arrange the wonton strips in a single layer (or as best you can get them) on a greased baking sheet. Spray the wontons with olive oil spray and a good sprinkle of sea salt. Bake in the preheated oven for 5-10 minutes, watching them closely to make sure they don't burn. They are done when they are a light golden color and crisp. Remove from the oven and set aside.",
    "In a small sauce pot mix together 1/4 cup soy sauce and 1 teaspoon cornstarch until smooth. Add 1/4 cup pineapple juice, 1/4 cup honey and 1 teaspoon chile garlic sauce. Place the pot on the stove over medium heat and bring to a boil. Reduce the heat and simmer 3-4 minutes until the sauce is just beginning to thicken and coat the back of a spoon. Remove from the heat.",
    "Heat a large cast iron skillet on high and add the sesame oil. Sear the tuna steaks in the skillet for 1-2 minutes, flip and brush the seared side with the soy sauce mixture. Sear another minute or 2 and then remove the steaks from the pan, brushing them with the remaining soy sauce mixture. Slice into strips.",
    "Combine the spring greens, cilantro, pineapple chunks and jalapeño (or red chile) in a bowl and toss.",
    "In another small bowl make the vinaigrette. Combine the hot chile sesame oil, soy sauce, pineapple juice, rice vinegar, chile garlic sauce, tahini, 1 teaspoon lime zest and the juice of 1 lime, the fresh ginger and garlic. Add 1-2 tablespoons black and white sesame seeds.",
    "Divide the greens among plates. Top with tuna, avocado slices and wonton crisps. Drizzle with the vinaigrette. Dig in!"
  ],
  "ingredients": [
    "0",
    "20 square wonton wrappers, cut into strips (use corn tortillas to make this gluten free)",
    "2 ahi tuna steaks",
    "1/4 cup soy sauce",
    "1 teaspoon corn starch",
    "1/4 cup pineapple juice",
    "1/4 cup honey",
    "1 teaspoon chile garlic sauce or sriracha",
    "2 tablespoons black and white sesame seeds, toasted",
    "4-8 cup spring greens",
    "1/2 cup fresh cilantro",
    "1 cup fresh pineapple, diced",
    "1 jalapeno or red chile, sliced",
    "1/2 cup hot chile sesame oil or toasted sesame oil",
    "1/4 cup soy sauce",
    "2 tablespoons pineapple juice",
    "2 tablespoon rice vinegar",
    "1 teaspoon chile garlic sauce or sriracha (or more to taste)",
    "1 tablespoon tahini",
    "1 lime, zested + juiced",
    "2 teaspoon fresh ginger, grated",
    "1 clove garlic, grated or minced",
    "back and white sesame seeds, toasted"
  ],
  "__v": 1
}