{
  "hash": "e38d9f886f86298dd4808851e07963923882494c",
  "title": "Cauliflower and Spinach Bake (\"Mac\" and Cheese)",
  "image": "",
  "href": "http://www.littlebroken.com/2016/07/08/cauliflower-and-spinach-bake-mac-and-cheese/",
  "extension": "Chrome",
  "firstAdded": "2016-10-31T02:32:00.172000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350 F degrees.",
    "Cauliflower: Bring a large pot of water to a boil. Season the water with salt and add cauliflower. Cook cauliflower in the boiling water for no more than 4-5 minutes or just until tender crisp. Immediately drain over a colander and let it rest until completely dry.*",
    "Cheese Sauce: In a small saucepan, warm 1½ cups milk, plus a bay leaf over medium heat. Whisk together the remaining ½ cup milk and the flour until there are no lumps.",
    "When the milk begins to lightly bubble around the edges, whisk the flour/milk mixture. Reduce the heat to low and add the cream cheese. Whisk until smooth and slightly thickened, resembling consistency of heavy cream, about 2-3 minutes.**",
    "Discard the bay leaf. Stir in 1 cup of cheddar cheese and whisk just until the cheese melts. Then add 1 more cup of cheese, whisking until melted and smooth.",
    "Remove the saucepan from the heat and stir in the paprika, mustard, and sea salt. Season with ground black pepper, to taste. Set aside.",
    "Breadcrumbs: In a medium non-stick skillet, melt butter over medium heat. Add breadcrumbs and stir until completely coated with butter.",
    "To Assemble: add half of the cauliflower to a 10 X 10 baking dish.*** Top with spinach and then the remaining cauliflower. Pour the cheese sauce over the cauliflower. Using a spoon, lightly move the cauliflower around so it is evenly coated with the sauce.",
    "Top with the remaining 1 cup of cheddar cheese, breadcrumbs, and parmesan cheese.",
    "Bake, uncovered, for 13-15 minutes or just until the cheese has melted. Broil for additional 2-3 minutes until golden brown. Serve immediately."
  ],
  "ingredients": [
    "0",
    "1 large head cauliflower (3 pounds), cut into small florets",
    "2 cups milk, divided",
    "1 bay leaf",
    "2 Tbsp. all-purpose flour",
    "4 oz. cream cheese, cubed",
    "3 cups freshly grated sharp cheddar cheese, divided",
    "½ tsp. paprika",
    "½ tsp. ground mustard",
    "½ tsp. sea salt, plus more for cooking cauliflower",
    "2 Tbsp. unsalted butter",
    "½ cup breadcrumbs",
    "1 cup lightly packed fresh baby spinach",
    "¼ cup shredded parmesan",
    "fresh ground black pepper"
  ],
  "__v": 1
}