{
  "hash": "3be1353b7938eedbc85f5bc966668015bf2d199e",
  "title": "Mini Poblano-Avocado Breakfast Casseroles\nACTIVE TIME\n15m\nTOTAL TIME\n50m\n4 servings",
  "image": "http://target.scene7.com/is/image/Target/c_1068104438?hei=340",
  "href": "http://www.cooking.com/recipes-and-more/recipes/mini-poblano-avocado-breakfast-casseroles-recipe",
  "firstAdded": "2015-02-09T00:42:03.325000",
  "users": [
    null
  ],
  "keywords": [
    "corn",
    "tortillas",
    "eggs",
    "cream",
    "salt",
    "pepper",
    "poblano",
    "peppers",
    "roasted",
    "seeded",
    "avocado",
    "onion",
    "divided",
    "tomato",
    "cilantro",
    "cheese",
    "monterey",
    "jack",
    "mexican",
    "blend"
  ],
  "directions": [
    "0",
    "Preheat the oven to 400 degrees F.",
    "Assemble four 10-ounce ramekins and lightly oil the bottoms. Cut the tortillas to fit the ramekins. Place 1 tortilla on the bottom of each ramekin.",
    "In a small bowl, beat the eggs with the cream. Season with salt and pepper. Divide the eggs into each of the ramekins. Chop the poblano peppers and distribute them between each of the ramekins. Distribute the avocado among each of the ramekins. Sprinkle 1 tablespoon of the cheese over the mixture in each of the ramekins. Layer a tortilla on top of the cheese. Layer the onion, tomato and cilantro over each of the tortillas. Sprinkle 2 tablespoons of cheese over the tomato mixture in each of the ramekins.",
    "Place in the oven and bake for about 25 minutes or until the cheese has completely melted and the eggs have puffed a bit and set.",
    "Serve immediately.",
    "Tip: To roast the poblanos, place them in a nonstick skillet set over high heat and rotate them until all sides are blackened. Transfer to a sealable plastic bag to continue steaming. When cool enough to handle, peel the loosened skin off the flesh."
  ],
  "ingredients": [
    "0",
    "8 corn tortillas",
    "4 eggs, beaten",
    "1/4 cup cream",
    "Salt and freshly ground pepper, to taste",
    "2 poblano peppers, roasted, peeled and seeded",
    "1 avocado, peeled, seeded and chopped",
    "1/4 cup chopped onion, divided",
    "1/2 cup chopped tomato, divided",
    "2 tablespoons chopped cilantro, divided",
    "3/4 cup finely shredded cheese, such as a Monterey Jack or a Mexican blend, divided"
  ],
  "__v": 1
}