{
  "hash": "b0de533371dabdddba10ccad383cb5e71d0e85bd",
  "title": "ENGAGEMENT PASTA",
  "image": "",
  "href": "http://recipe-folder.com/recipe/5b50ba0852855f3235561f87",
  "extension": "User Added",
  "firstAdded": "2018-07-19T16:19:20.007000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Bring a large pot of salted water to a boil, and cook the spaghetti noodles.",
    "1",
    "Meanwhile, in a large not nonstick skillet, melt the butter and thyme over medium heat.",
    "2",
    "Add the sliced mushrooms to the skillet, and stir to coat in butter. Leave them to cook for a few minutes undisturbed so that a nice crust forms. Stir, and repeat until the mushrooms are golden brown. It will take about 15 minutes.",
    "3",
    "Using a slotted spoon, remove the mushrooms from the pan, leaving the butter and thyme in the pan. Add the oil to the pan.",
    "4",
    "Salt and pepper both sides of the chicken breasts.",
    "5",
    "Turn the heat up to medium high,and sear the chicken breasts on both sides in the same pan that the mushrooms were in. Again, let cook undisturbed so that a nice crust forms. If the chicken is sticking to the pan, it's because the first side isn't done searing. It will release when it's golden brown.",
    "6",
    "Remove the chicken from the pan, and cover to keep warm.",
    "7",
    "Turn the heat down to low and add all of the wine",
    "8",
    "Allow the wine to cook down slightly while scraping the bottom of the pan with a wooden spoon to get all of the brown bits into the wine.",
    "9",
    "Dice the cream cheese and place in a large bowl.",
    "10",
    "Discard the thyme sprigs from the pan, and then pour the hot wine over the cream cheese, and stir until it melts. There might be a few small pieces, but the hot pasta will dissolve them.",
    "11",
    "When the pasta is done, drain it, and immediately pour it over the wine cream cheese mixture. Toss the noodles to melt and evenly distribute the cream cheese sauce.",
    "12",
    "Stir the mushrooms into the pasta bowl.",
    "13",
    "Slice the chicken, and serve on top."
  ],
  "ingredients": [
    "0",
    "6 ounces dried spaghetti",
    "1",
    "4 tablespoons unsalted butter",
    "2",
    "10 sprigs fresh thyme",
    "3",
    "10 ounces sliced mushrooms",
    "4",
    "freshly ground black pepper",
    "5",
    "salt",
    "6",
    "2 small chicken breasts",
    "7",
    "2 teaspoons olive oil",
    "8",
    "1/2 cup dry white wine",
    "9",
    "4 ounces cream cheese, softened"
  ],
  "__v": 1,
  "hidden": true
}