{
  "hash": "833b21914f006f97c7deddac124047bb4f9e85d2",
  "title": "Slow Cooker Butternut Squash Soup with Maple Roasted Chickpeas",
  "image": "http://www.twopeasandtheirpod.com/wp-content/uploads/2013/10/Slow-Cooker-Butternut-Squash-Soup-8.jpg",
  "href": "http://www.twopeasandtheirpod.com/slow-cooker-butternut-squash-soup-with-maple-roasted-chickpeas/",
  "extension": "Chrome",
  "firstAdded": "2015-03-05T20:52:18.584000",
  "users": [
    null
  ],
  "keywords": [
    "butternut",
    "squash",
    "soup",
    "medium",
    "yellow",
    "onion",
    "carrots",
    "seeded",
    "cubes",
    "apple",
    "used",
    "granny",
    "smith",
    "low",
    "sodium",
    "broth",
    "cinnamon",
    "nutmeg",
    "maple",
    "syrup",
    "salt",
    "black",
    "pepper",
    "roasted",
    "chickpeas",
    "libbys",
    "organic",
    "garbanzo",
    "beans",
    "canola",
    "oil",
    "brown",
    "sugar"
  ],
  "directions": [
    "0",
    "directions:",
    "1. Add the onion, carrots, butternut squash, and apple to the slow cooker. Pour the vegetable broth over all of the ingredients. Cook on low for 6 hours or on high for 3 1/2 to 4 hours.",
    "2. Once vegetables are cooked and soft, puree the soup using an immersion blender. Add the cinnamon, nutmeg, and maple syrup. Season with salt and pepper, to taste. If you don't have an immersion blender, you can transfer the soup to a blender (in batches) and puree until smooth. Pour the soup back into the slow cooker and season with spices and maple syrup.",
    "3. While the soup is cooking in the slow cooker, make the maple roasted chickpeas. Preheat the oven to 375 degrees F. Rinse and drain the chickpeas and pat dry with a towel. Remove the skins by rolling them on the towel. In a small bowl, combine the canola oil, maple syrup, brown sugar, cinnamon, and salt. Place the chickpeas on a large baking sheet. Pour the maple syrup mixture over the chickpeas and toss until chickpeas are well coated. Place in the oven and bake for 40-45 minutes, stirring every 15 minutes or so. Remove from the oven when chickpeas are crunchy.",
    "4. Pour soup into bowls and garnish with maple roasted chickpeas. Serve immediately."
  ],
  "ingredients": [
    "0",
    "ingredients:",
    "For the Butternut Squash Soup:",
    "1 medium yellow onion, chopped",
    "3 medium carrots, peeled and chopped",
    "1 medium butternut squash, peeled, seeded and chopped into 1-inch cubes (about 5 cups)",
    "1 large apple, peeled and chopped (I used Granny Smith)",
    "2 (14 oz) cans low sodium vegetable broth",
    "1/2 teaspoon ground cinnamon",
    "1/4 teaspoon ground nutmeg",
    "2 tablespoons maple syrup",
    "Salt and freshly ground black pepper, to taste",
    "For the Maple Roasted Chickpeas:",
    "1 (15 oz) can Libby's Organic Garbanzo Beans (chickpeas)",
    "1 tablespoon canola oil",
    "1 1/2 tablespoons pure maple syrup",
    "1 tablespoon brown sugar",
    "1/4 teaspoon ground cinnamon",
    "1/8 teaspoon salt"
  ],
  "__v": 1
}