{
  "hash": "0bfd27f73fdff1e9066973b9ac3ddbb5165c3e28",
  "title": "Charred Corn Guacamole with Corn Chips",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2014/7/2/0/FSSP10_Charred-Corn-Guacamole-with-Corn-Chips_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/bobby-flay/charred-corn-guacamole-with-corn-chips-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-11-12T03:25:04.546000",
  "users": [
    null
  ],
  "keywords": [
    "canola",
    "oil",
    "salt",
    "black",
    "pepper",
    "avocados",
    "serrano",
    "chile",
    "red",
    "onion",
    "lime",
    "juiced",
    "cilantro",
    "leaves",
    "blue",
    "yellow",
    "white",
    "corn",
    "chips",
    "accompaniment",
    "ears",
    "kosher"
  ],
  "directions": [
    "0",
    "4 ears Perfectly Grilled Corn, recipe follows",
    "Heat the grill to high.",
    "Remove the husks from the grilled corn and discard. Brush the ears of corn with 2 tablespoons of the canola oil and season with salt and pepper. Grill the ears until the kernels are lightly golden brown on all sides, about 5 minutes. Remove the kernels from the ears.",
    "Place the avocado in a medium bowl and mash slightly with a fork. Add the corn, serrano, onion, lime juice, remaining 2 tablespoons of oil, cilantro and salt and pepper and gently stir to combine. Serve with fried corn chips or warm flour tortillas.",
    "Heat the grill to medium.",
    "Pull the outer husks down the ear to the base. Strip away the silk from each ear of corn by hand. Fold husks back into place and tie the ends together with kitchen string. Place the ears of corn in a large bowl of cold water with 1 tablespoon of salt for 10 minutes.",
    "Remove corn from water and shake off excess. Place the corn on the grill, close the cover and grill for 15 to 20 minutes, turning every 5 minutes, or until kernels are tender when pierced with a paring knife. Remove the husks and eat on the cob or remove the kernels.",
    "How to remove corn kernels from cob: To remove kernels from cobs of either raw or cooked corn, stand cob upright on its stem end in a large pan, holding tip with fingers. Cut down the sides of cob with sharp paring knife, releasing kernels without cutting into cob. Run dull edge of knife down the cob to release any remaining corn and liquid.",
    "Recipe courtesy of Bobby Flay"
  ],
  "ingredients": [
    "0",
    "4 tablespoons canola oil",
    "Salt and freshly ground black pepper",
    "3 ripe avocados, peeled, pitted and diced",
    "1 serrano chile, finely diced",
    "1 small red onion finely diced",
    "1 lime, juiced",
    "1/4 cup chopped cilantro leaves",
    "Blue, yellow and white corn chips, as accompaniment",
    "4 ears corn",
    "Kosher salt"
  ],
  "__v": 1
}