{
  "hash": "36e2a52a1f5ecbe35820f4166a7f5be4ba9529f5",
  "title": "Thanksgiving Turkey with Holiday Rub",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2011/8/9/1/0165019_roasted-turkey_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/patrick-and-gina-neely/thanksgiving-turkey-with-holiday-rub-recipe.html",
  "firstAdded": "2015-01-24T20:36:30.568000",
  "users": [
    null
  ],
  "keywords": [
    "kosher",
    "salt",
    "black",
    "pepper",
    "thyme",
    "rosemary",
    "sage",
    "garlic",
    "turkey",
    "rinsed",
    "patted",
    "dry",
    "inside",
    "neck",
    "heart",
    "gizzard",
    "reserved",
    "stock",
    "olive",
    "oil",
    "chicken",
    "shallots",
    "allpurpose",
    "flour",
    "lemon",
    "juice",
    "sour",
    "cream"
  ],
  "directions": [
    "0",
    "Preheat the oven to 325 degrees F.",
    "Mix all of the dry rub ingredients in a small bowl.",
    "Put the turkey on a rack in a roasting pan.",
    "Generously season the turkey cavity with salt and pepper, to taste. Brush the turkey with olive oil, and rub it with the seasoning mixture. Tie the legs together loosely to hold their shape, and tuck the wing tips under.",
    "Roast the turkey until an instant-read thermometer inserted into the thickest part of thigh registers 165 to 170 degrees F, about 3 hours.",
    "Transfer the turkey to a platter. Tent it very loosely with foil, and let it rest for at least 30 minutes (the internal temperature will rise 5 to 10 degrees). Reserve the juices in the pan.",
    "Gravy: Scrape the juices and browned bits from the roasting pan into a large glass measuring cup. Spoon off the fat, reserving 2 tablespoons. If necessary, add enough stock to the juices to measure 1 2/3 cups.",
    "Heat the reserved 2 tablespoons fat in a heavy, large saucepan over medium-high heat. Add the garlic, and shallots, and saute for 2 minutes. Add the flour and whisk until golden, about 4 minutes. Add the degreased pan juices, and the 2 cups stock. Bring to a boil, whisking until smooth. Reduce the heat and simmer until the gravy is reduced to the desired consistency, about 4 minutes. Whisk in the lemon juice, and the sour cream. Season the gravy with salt and pepper, to taste. Pour the gravy into a serving bowl. Carve the turkey and arrange it on a serving platter. Serve the turkey with the gravy.",
    "Recipe courtesy The Neelys"
  ],
  "ingredients": [
    "0",
    "2 teaspoons kosher salt",
    "1 teaspoon freshly ground black pepper",
    "2 teaspoons dried thyme",
    "2 teaspoons dried rosemary",
    "1 teaspoon dried sage",
    "1/2 teaspoon garlic powder",
    "1 (14 to 16 pound) turkey, rinsed, patted dry inside and out (neck, heart, and gizzard reserved",
    "for stock)",
    "Salt and freshly ground black pepper",
    "2 tablespoons olive oil",
    "Turkey or chicken stock",
    "2 garlic cloves, thinly sliced",
    "2 shallots, finely chopped",
    "3 tablespoons all-purpose flour",
    "2 tablespoons fresh lemon juice",
    "1/2 cup sour cream",
    "Kosher salt and freshly ground black pepper"
  ],
  "__v": 1
}