{
  "hash": "0602a2569a62e0b1573f288ec1772388dc7737bd",
  "title": "STRAWBERRIES AND CREAM CUPCAKES",
  "image": "https://www.lifeloveandsugar.com/wp-content/uploads/2018/05/Strawberries-And-Cream-Cupcakes5.jpg",
  "href": "https://www.lifeloveandsugar.com/strawberries-and-cream-cupcakes/",
  "extension": "Chrome",
  "firstAdded": "2019-02-10T23:10:10.229000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350°F (176°C) and prepare a cupcake pan with cupcake liners.",
    "In a large mixing bowl, cream butter and sugar together until light in color and fluffy, about 3-4 minutes. Do not skimp on the amount of creaming time.",
    "Add sour cream and vanilla extract and mix until well combined.",
    "Add egg whites in two batches, mixing until well combined after each. Scrape down the sides of the bowl as needed to be sure all ingredients are well incorporated.",
    "Combine dry ingredients in a separate bowl, then combine the milk and water in a small measuring cup.",
    "Add half of the dry ingredients to the batter and mix until well combined. Add the milk mixture and mix until well combined. Add remaining dry ingredients and mix until well combined. Scrape down the sides of the bowl as needed to be sure all ingredients are well incorporated.",
    "Fill the cupcake liners about halfway. Bake for 15-17 minutes, or until a toothpick inserted comes out with a few crumbs.",
    "Remove cupcakes from oven and allow to cool for 2-3 minutes, then remove to cooling rack to finish cooling.",
    "While the cupcakes cool, make the frosting. Add the freeze dried berries to a food processor and grind into a powder. Set aside.",
    "Add the butter to a large mixer bowl and mix until smooth.",
    "Add about half of the powdered sugar and mix until smooth",
    "Add up to 3 tablespoons of water or milk and the salt and mix until smooth.",
    "Add the remaining powdered sugar and powdered berries and mix until well combined and smooth. Add additional water or milk, as needed. Set frosting aside.",
    "To make the filling, add the heavy whipping cream, powdered sugar and vanilla extract to a large mixer bowl. 15. Whip on high speed with the whisk attachment until soft peaks form.",
    "Add the cream cheese and continue whipping until stiff peaks form. It’ll happen quickly.",
    "Stir in the chopped strawberries.",
    "When the cupcakes have cooled, use a cupcake corer or small knife to remove the centers of the cupcakes.",
    "Fill the centers with the cream filling.",
    "Pipe the frosting onto the cupcakes. I used Ateco tip 844.",
    "Top the cupcakes with a strawberry, then refrigerate until ready to serve. Cupcakes are best served at room temperature.",
    "DID YO"
  ],
  "ingredients": [
    "0",
    "VANILLA CUPCAKES",
    "6 tbsp (84g), unsalted butter, room temperature",
    "3/4 cups (155g) sugar",
    "6 tbsp (86g) sour cream",
    "2 tsp vanilla extract",
    "3 large egg whites, room temperature",
    "1 1/4 cups (163g) all purpose flour",
    "2 tsp baking powder",
    "¼ tsp salt",
    "6 tbsp (90ml) milk",
    "2 tbsp (30ml) water",
    "STRAWBERRY FROSTING",
    "1 cup freeze-dried strawberries",
    "1 cup (224g) unsalted butter, room temperature",
    "4 cups (460g) powdered sugar",
    "3-4 tbsp (45-60ml) water or milk",
    "Pinch of salt",
    "Fresh berries, for topping",
    "FILLING",
    "1/2 cup (120ml) heavy whipping cream, cold",
    "1/4 cup (29g) powdered sugar",
    "1/2 tsp vanilla extract",
    "3 oz cream cheese, room temperature",
    "1/2 cup chopped strawberrie"
  ],
  "__v": 1
}