{
  "hash": "02f9d831483b159d5825f3379b0de0e50483e5b4",
  "title": "No Bake Chocolate Tart",
  "image": "",
  "href": "http://recipe-folder.com/recipe/5d73dfa2de7ce5592c205ba5",
  "extension": "User Added",
  "firstAdded": "2019-09-07T16:49:38.797000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To make the crust: Pulse Oreo cookies, with filling, in a food processor until finely ground. Transfer crumbs to a medium bowl, add melted butter, and mix until combined and moistened. Press the mixture onto the bottom and up the sides of a 9-inch (23cm) tart pan. Place it in the fridge for 30 minutes to firm up before adding the filling (or before baking the crust). If possible, I recommend to bake the crust in a 350F/180C preheated oven for 5-6 minutes, then let it cool completely on a wire rack before adding the filling. This will make the crust more crisp and less soft.",
    "1",
    "To make the filling: In a medium heatproof bowl, place chopped bittersweet and milk chocolate. Set aside. In a small saucepan over medium heat, bring the heavy cream and butter to a low boil. Remove from the heat and pour mixture over the chocolate. Let stand for 1 minute. Using a rubber spatula, stir mixture until melted and smooth (if not completely melted, heat in the microwave for several seconds and stir, until melted). Pour mixture over chilled Oreo crust and refrigerate until set, at least 4 hours or overnight. You can make the tart a day ahead of time.",
    "2",
    "Tart will keep, covered well, for up to 4-5 days in the fridge."
  ],
  "ingredients": [
    "0",
    "Oreo Crust:",
    "1",
    "24 Oreo cookies",
    "2",
    "6 tablespoons (3/4 stick/85 g) unsalted butter, melted",
    "3",
    "Ganache filling:",
    "4",
    "170 g/6 oz (1 cup) coarsely chopped bittersweet chocolate",
    "5",
    "170 g/6 oz (1 cup) coarsely chopped milk chocolate",
    "6",
    "1 cup (240 ml) heavy cream",
    "7",
    "¼ cup (1/2 stick/56 g) butter, cut into small pieces"
  ],
  "__v": 1,
  "hidden": true
}