{
  "hash": "abe171b03d5c9ce0975509a6eaf085ba4e073fac",
  "title": "The General Store Chili",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/the-general-store-chili-recipe.html",
  "firstAdded": "2015-01-24T15:36:23.265000",
  "users": [
    null
  ],
  "keywords": [
    "beef",
    "mediumsized",
    "onion",
    "habanero",
    "pepper",
    "seeds",
    "jalapeno",
    "garlic",
    "chili",
    "tomatoes",
    "tomato",
    "chicken",
    "stock",
    "kidney",
    "beans",
    "bittersweet",
    "cocoa",
    "dark",
    "brown",
    "sugar",
    "salt",
    "black"
  ],
  "directions": [
    "0",
    "In a large heavy pot over medium-low heat, add the beef and cook until browned. Make sure to stir it if it starts to stick and break up any clumps that form. Add the diced onion, habanero, jalapeno and garlic. When the fat has rendered from the meat, add the chili powder and stir well. Cook for about 5 minutes on low heat, stirring occasionally.",
    "Stir in the tomatoes, tomato paste and the chicken stock. Stir vigorously to combine and simmer for 1 to 2 minutes. Gently stir in the beans so as not to break the beans. Simmer over very low heat for 1 1/2 hours.",
    "Turn off the heat and add the cocoa powder and brown sugar. Stir vigorously, and then add the salt and pepper. Transfer the chili to a serving bowl and serve.",
    "This recipe was provided by professional chefs and has been scaled down from a bulk recipe provided by a restaurant. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results.",
    "Recipe courtesy Gillian Clark, chef The General Store in Washington, DC"
  ],
  "ingredients": [
    "0",
    "3 pounds ground beef (80/20)",
    "1 medium-sized onion, diced (about 1 cup)",
    "1 habanero pepper with seeds, minced",
    "1 jalapeno pepper, minced (with seeds)",
    "3 cloves garlic, minced",
    "1/3 cup chili powder",
    "1 (16-ounce) can crushed tomatoes",
    "1 (10-ounce) can tomato paste",
    "1 cup chicken stock",
    "1 (40-ounce) can kidney beans",
    "1/4 cup bittersweet cocoa powder",
    "2 tablespoons dark brown sugar",
    "2 teaspoons salt",
    "1 teaspoon freshly ground black pepper"
  ],
  "__v": 1
}