{
  "hash": "c72bd74e61061d8170c1993fde5eaaee8a1fecc4",
  "title": "Pumpkin Nutella Chocolate Chip Cookies",
  "image": "http://www.thesuburbanmom.com/wp-content/uploads/2015/09/Nutella-Pumpkin-Cookies.png",
  "href": "http://www.thesuburbanmom.com/2015/09/25/pumpkin-nutella-chocolate-chip-cookies/?utm_source=spaceshipsandlaserbeams.com&utm_medium=referral&utm_campaign=pubexchange_facebook",
  "extension": "Firefox",
  "firstAdded": "2015-10-14T04:03:36.554000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "browned",
    "butter",
    "egg",
    "whites",
    "brown",
    "sugar",
    "flour",
    "baking",
    "soda",
    "salt",
    "vanilla",
    "pumpkin",
    "spice",
    "puree",
    "pie",
    "filling",
    "chocolate",
    "chips",
    "used",
    "dark",
    "nutella",
    "chilled",
    "cookie",
    "approx"
  ],
  "directions": [
    "0",
    "Brown the butter. To do so slice butter into small chunks and melt over medium heat in a small pan whisking constantly. Continue to heat butter until it begins to bubble and foam giving off a nutty aroma. It should at this time turn a distinct brown color toward the bottom. Remove the butter from heat and set aside to cool.",
    "While butter is cooling, in a separate bowl whisk together flour and baking soda.",
    "Once butter is cooled (approx 10 minutes) mix in butter, salt, brown sugar and sugar. Next add egg whites, pumpkin puree, pumpkin spice and vanilla to mixture and combine thoroughly. Then slowly add the dry ingredients.",
    "Fold in chocolate chips.",
    "Cover and chill dough in refrigerator for at least 2 hours or overnight. If you can't wait, you can put it in the freezer for 30 minutes. Just don't let your dough freeze. If your Nuttella is not already in the refrigerator, put it in the fridge to chill too.",
    "When you are ready, preheat the oven to 350 degrees.",
    "Roll chilled dough in your hand to form a 2 inch ball. Gently press your thumb into the center to form a little hole.",
    "Scoop a couple tablespoons of Nutella into a small dish (refill as needed). Use a knife to place a teaspoon of Nutella in the center of the cookie. Fold the edges of the cookie together around the Nutella closing the Nutella into the center of the cookie and press to seal closed.",
    "Bake cookies for 14 minutes or until cookies are golden brown around the edges.",
    "Cool cookies on baking sheet as they will be soft in the middle. Once they are mostly cooled you can transfer them to a wire wrack, but if you try to move to soon they will break."
  ],
  "ingredients": [
    "0",
    "1 cup of unsalted browned butter",
    "2 egg whites",
    "1¼ cup packed brown sugar",
    "¼ cup sugar",
    "2½ cups flour",
    "1¼ teaspoons baking soda",
    "½ teaspoon salt",
    "1 teaspoon vanilla extract",
    "2 tablespoons pumpkin spice",
    "¼ cup of pumpkin puree (not pumpkin pie filling)",
    "1 cup chocolate chips (I used dark)",
    "Nutella chilled (1 teaspoon per cookie approx 18)"
  ],
  "__v": 1
}