{
  "hash": "1b7f87d97a918afc0c8b152fcc88c497c5f44194",
  "title": "S'MORES BROWNIES",
  "image": "http://www.recipegirl.com/wp-content/uploads/2011/02/Smores-Brownies-15.jpg",
  "href": "http://www.recipegirl.com/2011/02/23/smores-brownies/",
  "extension": "Chrome",
  "firstAdded": "2016-06-06T12:52:12.394000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS:",
    "Report this ad",
    "1. Preheat oven to 325 degrees F. Line 8x8-inch pan with foil so it hangs over the edges a bit. Spray with nonstick spray. (You can use 9x9-inch pan, but baking time might need slight decrease and your end result will be a thinner brownie).",
    "2. Prepare crust: In a medium bowl, mix butter with crumbs, sugar and salt. Press crumb mixture into the bottom of the pan. Bake until golden, 15 to 20 minutes.",
    "3. Prepare the brownie: Place butter and chocolate in microwave-safe bowl. Melt for 1 minute; stir. Melt another minute; stir. Keep microwaving at 1 minute intervals until mixture is completely melted. (Alternately, you can melt this mixture in a heatproof bowl set over a pan of simmering water on the stove). Add sugars, vanilla and salt into the melted chocolate and mix together. Add eggs and beat vigorously until you see a thick and glossy batter. Stir in flour and mix just until incorporated. Pour batter over the baked crust. Bake until top is set and toothpick inserted into the middle comes out mostly clean, 35 to 40 minutes (you don't want to overbake the brownie- a little gooey inside is good).",
    "4. Remove pan from oven. Turn up heat on the oven to broil. Sprinkle chocolate chunks over the baked brownie. Add a nice, thick layer of marshmallows next. Sprinkle graham cracker crumbs on top.",
    "5. Place your pan of brownies back into the oven (they should be 6 to 8 inches away from the heating element). Toast under the broiler until golden- KEEP AN EYE ON IT- it can go from golden to burned in a matter of seconds. 1 to 2 minutes under the broiler should be plenty.",
    "6. Cool for a few minutes, then use foil to remove brownies from the pan and set on a cutting board. Carefully pull the sides of the foil away from the marshmallows and brownies. Cut brownies into 12 squares. Helpful tip: Use a large, WET & SHARP KNIFE to cut the brownies. Slice through the brownie, then clean the knife and slice through again with a clean, wet knife. Keep cleaning off the knife after each cut for the cleanest cuts."
  ],
  "ingredients": [
    "0",
    "7 Tablespoons unsalted butter, melted",
    "1 1/2 cups graham cracker crumbs (8 or 9 whole graham crackers)",
    "2 Tablespoons granulated sugar",
    "pinch of salt",
    "BROWNIE:",
    "8 Tablespoons (1 stick) unsalted butter",
    "4 ounces unsweetened chocolate, chopped",
    "1 cup packed light brown sugar",
    "3/4 cup granulated sugar",
    "1 1/2 teaspoons vanilla extract",
    "1/2 teaspoon salt",
    "4 large eggs",
    "1 cup all-purpose flour",
    "TOPPING:",
    "1 cup semi-sweet chocolate chunks or chips",
    "3 to 4 cups mini marshmallows",
    "about 1/4 cup of graham cracker crumbs (1 whole cracker, crumbled)",
    "DIRECTIONS:",
    "Report this ad",
    "1. Preheat oven to 325 degrees F. Line 8x8-"
  ],
  "__v": 1
}