{
  "hash": "8ca06e856b526d45f8516756d52d10ffb4ddb5f8",
  "title": "One Pan Green Beans, Mushrooms and Shallots",
  "image": "http://www.themerchantbaker.com/wp-content/uploads/2016/11/One-Pan-Green-Beans-with-Mushrooms-and-Shallots-10.jpg",
  "href": "http://www.themerchantbaker.com/side-dishes/one-pan-green-beans-mushrooms-and-shallots/",
  "extension": "",
  "firstAdded": "2016-11-22T21:21:54.288000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Melt butter in a large saute pan. Add shallots and saute over medium heat until shallots are beginning to brown. Lightly season with salt. Your butter will also be browning at this point. (Don't cook on too high of a heat or your butter will burn.) Remove the cooked shallots to a separate bowl or plate with a slotted spoon, leaving the browned butter in the pan. Set the shallots aside.",
    "Add sliced mushrooms to the pan and saute over medium heat until browned, plump and tender. Lightly season with salt. Remove mushrooms and set aside along with the shallots.",
    "Add the fresh green beans to the pan along with the 1/4 cup of water. Bring to a low simmer, then cover, allowing the beans to steam until almost to your desired tenderness, about 8-10 minutes. Check tenderness with a fork.",
    "Remove cover, season with salt and continue to cook until any residual water in the pan has evaporated.",
    "Add the shallots and mushrooms back into the pan (making sure to scrape any butter from the bowl back into the pan) and toss to combine and reheat. Taste and adjust seasoning as necessary.",
    "Transfer mixture to serving bowl, squeeze lemon juice over all (I use about a half lemon's worth, but do it to your taste) and then top with toasted almonds. Serve."
  ],
  "ingredients": [
    "0",
    "3 Tablespoons unsalted butter",
    "4 shallots, sliced thinly (about 1 cup)",
    "8 ounces sliced mushrooms, I used white",
    "1/4 cup water",
    "2 pounds fresh green beans, washed and trimmed",
    "fresh lemon juice",
    "salt",
    "1/4 cup toasted sliced almonds"
  ],
  "__v": 1
}