{
  "__v": 1,
  "directions": [
    "0",
    "Directions:",
    "To make the cookies, in a medium bowl, whisk together the flour, baking powder, salt, cinnamon, and nutmeg. Set aside. In the bowl of an electric mixer fitted with the paddle attachment, beat together the butter and sugars on medium-high speed until light and fluffy, about 2-3 minutes. Blend in the pumpkin puree. Beat in the egg and vanilla until incorporated. With the mixer on low speed, slowly add in the dry ingredients and mix until just incorporated. If you have any more dry streaks on the bottom, fold together gently with a spatula until just combined. Cover and chill the dough for at least 1 hour.",
    "While the dough chills, make the filling. In a small bowl, mix together the cream cheese, sugar, and vanilla until smooth and creamy. Cover and chill this as well (for at least half an hour).",
    "Preheat the oven to 350 degrees F. Line a few baking sheets with parchment paper. In a small bowl, mix together the sugar and spices for the coating thoroughly. Take one tablespoon of dough and flatten it into a pancake shape. Place one teaspoon of the cream cheese mixture in the middle of the pancake. Form another tablespoon of dough into an equally-sized pancake shape, and place on top, keeping the cream cheese in the middle. Gently pinch together the edges of the dough around the cream cheese to seal, then gently roll into a ball. Roll the ball in the cinnamon-sugar mixture to coat. Repeat with the remaining dough to fill the sheets, spacing the dough balls 2-3 inches apart. Dip the bottom of a flat, heavy-bottomed drinking glass in water to moisten slightly. Then dip it in the sugar-spice mixture, and use the bottom to flatten the dough balls slightly (They won't really flatten on their own, though they will puff slightly.). Recoat the bottom of the glass in the sugar-spice mixture as needed.",
    "Bake the cookies for 10-15 minutes, or until they are slightly firm to the touch and the tops are beginning to crackle. Let cool on the baking sheets about 5 minutes, then transfer to a wire rack to cool completely. Store in an airtight container."
  ],
  "firstAdded": "2014-08-13T23:58:26.031000",
  "hash": "ad495c045c3e2f1f233bf97512cbcee602bb7642",
  "href": "http://www.bakeaholicmama.com/2012/10/cream-cheese-filled-pumpkin.html",
  "image": "http://4.bp.blogspot.com/-2Qm_3BsjMN4/UIKFj17jWqI/AAAAAAAAEv0/yUgJglwHAEo/s640/morecookies.JPG",
  "ingredients": [
    "0",
    "Ingredients for the cookies:",
    "3¾ cups all-purpose flour",
    "1½ tsp. baking powder",
    "½ tsp. salt",
    "½ tsp. ground cinnamon",
    "¼ tsp. freshly-ground ground nutmeg",
    "1 cup (2 sticks) unsalted butter, at room temperature",
    "1 cup granulated sugar",
    "½ cup light brown sugar",
    "¾ cup pumpkin puree",
    "1 large egg",
    "2 tsp. vanilla extract",
    "Ingredients for the filling:",
    "8 ounces cream cheese, softened",
    "1/4 cup sugar",
    "2 teaspoons vanilla extract",
    "Ingredients for the cinnamon-sugar coating:",
    "½ cup granulated sugar",
    "1 tsp. ground cinnamon",
    "½ tsp. ground ginger",
    "Dash of allspice"
  ],
  "keywords": [
    "cookies",
    "allpurpose",
    "flour",
    "baking",
    "salt",
    "cinnamon",
    "freshlyground",
    "nutmeg",
    "unsalted",
    "butter",
    "room",
    "granulated",
    "sugar",
    "light",
    "brown",
    "pumpkin",
    "puree",
    "egg",
    "vanilla",
    "filling",
    "cream",
    "cheese",
    "softened",
    "cinnamonsugar",
    "coating",
    "ginger",
    "allspice"
  ],
  "title": "Cream Cheese-Filled Pumpkin Snickerdoodles",
  "users": [
    null
  ]
}