{
  "hash": "27cec99bf91593e18c10efeee41f885c0666d107",
  "title": "Eric Korsh's Farm Lettuces Salad with Dill Vinaigrette",
  "image": "//images.food52.com/dUeoEAGmo4cSx7v5TZhEPMYBcA8=/753x502/4f48c161-84d8-4554-9d62-749dd4d91597--18881773673_837e0e1e85_b.jpg",
  "href": "http://food52.com/recipes/37034-eric-korsh-s-farm-lettuces-salad-with-dill-vinaigrette",
  "extension": "Chrome",
  "firstAdded": "2016-01-03T10:05:23.292000",
  "users": [
    null
  ],
  "keywords": [
    "egg",
    "picked",
    "dill",
    "fronds",
    "bunch",
    "dijon",
    "mustard",
    "champagne",
    "white",
    "wine",
    "vinegar",
    "neutral",
    "oil",
    "canola",
    "grapeseed",
    "olive",
    "salt",
    "pepper",
    "lettuces",
    "belowenough",
    "torn",
    "washed",
    "spun",
    "dry",
    "crumbled",
    "sheeps",
    "milk",
    "feta",
    "scallions",
    "chives",
    "lengths"
  ],
  "directions": [
    "0",
    "Cook the egg in abundant boiling water for 7 minutes and 15 seconds, for barely set yolks and fully set whites. Rinse and peel in cold water to stop it from cooking futher.",
    "Blend egg, dill, Dijon, and Champagne vinegar until smooth. Note: For a lighter-colored dressing with more bits of green in it, you can pulse in the herbs toward the end—this is especially good to do if substituting more strongly flavored herbs like chives for the dill.",
    "Mix canola oil and olive oil and slowly, with the blender running, drizzle oil mixture in until emulsified. Season with salt and pepper to taste.",
    "Any leftover dressing will keep in the fridge for 3 to 4 days, though the color and fresh herb flavor may fade slightly after a day.",
    "In choosing the lettuces, the salad should be bright and fresh. The leaves should be light, but stout enough to hold the other ingredients. Use red oak, green oak, and/or butter lettuce.",
    "Just before serving, toss the lettuce with dressing to taste (it should be just enough to lightly coat the leaves), plus feta, scallions, and chives."
  ],
  "ingredients": [
    "0",
    "1 large egg",
    "1 cup (25 grams) picked dill fronds (from about 1/2 bunch)",
    "1 tablespoon plus 1 teaspoon (19 grams) Dijon mustard",
    "3 1/2 tablespoons (50 grams) Champagne or white wine vinegar",
    "1/4 cup neutral oil, like canola or grapeseed",
    "1/4 cup olive oil",
    "Salt and freshly ground pepper, to taste",
    "1",
    "Lettuces of your choice (see note below)—enough for about 6 cups torn, washed and spun dry",
    "1 cup crumbled fresh sheep's milk feta",
    "2 scallions, thinly sliced",
    "1/3 cup chives cut into 1-inch lengths"
  ],
  "__v": 2
}