{
  "hash": "906fa6f2e34615f28dcda9ae928c8e5911b57227",
  "title": "ALABAMA-STYLE CHICKEN SANDWICHES WITH WHITE SAUCE",
  "image": "https://www.saveur.com/g00/3_c-5eee.aidmcz.kwu_/c-5UWZMXPMCA09x24pbbx78ax3ax2fx2feee.aidmcz.kwux2faqbmax2faidmcz.kwux2fnqtmax2fabgtmax2f433_9f_x2fx78cjtqkx2fqux78wzbx2f0892x2f0892-84x2fnmibczm_itijiui-kpqksmv-aivleqkpma_9088f688_8.rx78ox3fqbwsx3dBJx78fkgI1x26q98k.uizsx3dquiom_$/$/$/$/$/$/$/$/$/$/$",
  "href": "https://www.saveur.com/article/Recipes/Alabama-Style-Chicken-Sandwiches-with-White-Sauce",
  "extension": "Chrome",
  "firstAdded": "2018-04-20T00:59:12.224000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a bowl, whisk together mayonnaise, horseradish, vinegar, sugar, 3 tsp. salt, 1½ tsp. pepper, and cayenne. Place half sauce in another bowl; set one aside for basting and one for serving. Mix remaining salt and pepper with paprika, garlic powder, celery seeds, cumin, and coriander in a bowl; set rub aside.",
    "Prepare your grill using the kettle grill, bullet smoker, or gas grill method, (see links for instructions) using apple wood chunks or chips (see Fuel and Flavor). Season chicken with the rub mixture, and place it, skin side up, on grill grate. Maintaining a temperature of 225°-250° (if using a kettle grill or bullet smoker, replenish fire with unlit coals, as needed, to maintain temperature; see instructions), cook, turning once and basting chicken with sauce every 20 minutes, until a thermometer inserted in the thigh (not touching the bone) reads 175°, about 1½ hours. Remove chicken from grill; let rest, covered loosely with foil, for 10 minutes.",
    "Shred the chicken meat with forks and discard bones and skin. Divide chicken among buns and top with remaining sauce and pickle chips."
  ],
  "ingredients": [
    "0",
    "2 cups mayonnaise",
    "1⁄2 cup prepared horseradish",
    "1⁄4 cup apple cider vinegar",
    "2 tbsp. sugar",
    "4 tsp. kosher salt, plus more to taste",
    "1 tbsp. ground black pepper, plus more to taste",
    "1⁄2 tsp. cayenne",
    "2 1⁄4 tsp. sweet paprika",
    "1 1⁄2 tsp. garlic powder",
    "3⁄4 tsp. celery seeds",
    "1⁄4 tsp. ground cumin",
    "1⁄4 tsp. ground coriander",
    "1 (4-lb.) chicken, spatchcocked (see Barbecue 101) or quartered",
    "8 white hamburger buns Dill pickle chips, for serving"
  ],
  "__v": 1
}