{
  "hash": "901012e4b11af31676378c69a4ea3c327f42d692",
  "title": "Tex-Mex Breakfast Bowls",
  "image": "https://cookieandkate.com/images/2016/06/tex-mex-breakfast-bowl.jpg",
  "href": "https://cookieandkate.com/2016/tex-mex-breakfast-bowl-recipe/",
  "extension": "Chrome",
  "firstAdded": "2017-12-23T19:45:27.104000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To make the pico de gallo: In a small mixing bowl, combine all of the ingredients. Stir to combine, and set the pico de gallo aside to marinate while you make the remaining components.",
    "To cook the black beans: In a medium saucepan over medium heat, warm the olive oil until shimmering. Add the chopped onion and a sprinkle of salt. Cook, stirring occasionally, until the onion has softened and is turning translucent, about 5 to 8 minutes. Add the cumin and garlic. Cook, stirring constantly, until fragrant, about 30 seconds. Pour in the drained beans and water. Stir, cover and cook for 5 minutes.",
    "Reduce the heat to low, remove the lid and use a potato masher or the back of a fork to mash up about at least half of the beans. Continue to cook the beans, uncovered, stirring often, for 3 more minutes. Remove the saucepan from the heat and stir in the salt, pepper and lime juice. Taste and add more salt, pepper, lime juice if necessary. If the beans seem dry, add a very small splash of water and stir to combine. Cover until you’re ready to serve.",
    "To cook the eggs: In a medium mixing bowl, scramble the eggs with the cream or milk, salt, a few twists of freshly ground black pepper and a pinch of red pepper flakes. In a 10-inch non-stick or well-seasoned cast iron skillet, warm 2 teaspoons olive oil over medium heat until shimmering. Swirl the pan so it’s evenly coated with oil. Whisk your egg mixture one last time and pour it into the skillet.",
    "Scramble the eggs by pushing the mixture around until it’s about 90 percent set. Remove the pan from the heat, and stir in the cheese, if using.",
    "To assemble the bowls, divide the beans and scrambled eggs evenly into 4 bowls. Stir the pico de gallo again, and use a slotted spoon or fork to divide the pico de gallo into the bowls, leaving the watery tomato juice in the bowl. Top each bowl with a few slices of thinly sliced avocado, and serve with your favorite salsa, and optional roasted potatoes on the side."
  ],
  "ingredients": [
    "0",
    "Pico de gallo",
    "1 pint cherry or grape tomatoes, quartered",
    "¼ cup finely chopped white onion (about ¼ small onion)",
    "¼ cup chopped fresh cilantro",
    "1 tablespoon lime juice (about ½ medium lime)",
    "¼ teaspoon fine-grain sea salt",
    "Refried black beans",
    "1 tablespoon olive oil",
    "½ cup finely chopped white onion (about ½ small onion)",
    "2 teaspoons Frontier Co-op ground cumin",
    "½ teaspoon Frontier Co-op garlic powder or 2 cloves garlic, pressed or minced",
    "2 cans (15 ounces each) black beans, rinsed and drained, or 3 cups cooked black beans",
    "½ cup water",
    "½ teaspoon fine-grain sea salt",
    "Freshly ground black pepper, to taste",
    "1 teaspoon lime juice",
    "Scrambled eggs",
    "10 eggs",
    "3 tablespoons cream or neutral-flavored milk of choice",
    "¼ teaspoon fine-grain sea salt",
    "Freshly ground black pepper",
    "Pinch of Frontier Co-op red pepper flakes",
    "2 teaspoons olive oil",
    "½ cup grated Monterey Jack cheese or cheddar cheese, optional",
    "Everything else",
    "1 ripe avocado, thinly sliced",
    "Your favorite salsa",
    "Roasted breakfast potatoes, optional"
  ],
  "__v": 1
}