{
  "hash": "08bf7073079fe06d90de105c2fd40bfe0a6ec092",
  "title": "Simple Caramelized Butternut Squash and Kale Florentine Lasagna. prep time: 30 MINUTEScook time: 1 HOUR 15 MINUTEStotal time: 1 HOUR 45 MINUTES yields: ONE (9x13) INCH LASAGNA serving size: 6-8",
  "image": "http://www.halfbakedharvest.com/wp-content/uploads/2014/11/Simple-Caramelized-Butternut-Squash-and-Kale-Florentine-Lasagna-14.jpg",
  "href": "http://www.halfbakedharvest.com/simple-caramelized-butternut-squash-kale-florentine-lasagna/",
  "extension": "Chrome",
  "firstAdded": "2015-05-01T21:09:16.153000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "medium",
    "butternut",
    "squash",
    "cubes",
    "brown",
    "sugar",
    "garlic",
    "salt",
    "pepper",
    "nutmeg",
    "bchamel",
    "sage",
    "leaves",
    "thyme",
    "bunch",
    "kale",
    "roughly",
    "butter",
    "flour",
    "milk",
    "use",
    "parmesan",
    "cheese",
    "blue",
    "crumbled",
    "cream",
    "mozzarella",
    "fontina",
    "boil",
    "wheat",
    "lasagna",
    "noodles",
    "pasta",
    "pumpkin",
    "seeds"
  ],
  "directions": [
    "0",
    "Instructions",
    "Preheat the oven to 400 degrees F. and grease a 9x13 inch baking dish - if baking the lasagna right away.Heat a large skillet over medium heat, add the olive oil. Add the butternut squash and sprinkle with brown sugar and season with salt and pepper. Cook over medium heat stirring frequently to avoid burning for 10 to 15 minutes or until the squash begins to caramelize all over. Add the garlic, nutmeg sage and thyme, cook 5 or so minutes more.Now remove the skillet from the heat and add the kale, cover and let sit for 10 minutes. The heat from the pan will cook the kale down.Meanwhile, make the béchamel sauce. Melt the butter over medium heat and allow the butter to brown lightly. Once the butter begins to brown, add the flour and cook, whisking constantly, for 1 minute. Whisk in the warm milk in a steady stream. Add the a pinch of freshly grated nutmeg and simmer for 2 minutes, whisking. Remove from the heat, stir in the blue cheese (or mozzarella) and parmesan. Season with salt and pepper. Let cool, stirring occasionally to prevent a skin from forming.To assemble the lasagna, spoon a little béchamel onto the bottom of the prepared baking dish. Add a layer of lasagna noodles. Sprinkle about 1/3 of the butternut + kale mixture over the noodles. Now add 1/3 of the fontina cheese and drizzle with a little béchamel. Repeat the layering process until you have three to four layers. Once you get to the very top, spread any remaining béchamel over the noodles. Sprinkle with the last of the fontina cheese. Feel free to add more cheese if desired!! Top the lasagna with sage leaves.Spray a piece of tin foil with cooking spray and cover the the lasagna. At this point the lasagna can be placed in the fridge for up to 3 days or frozen.Bake, covered for 35-45 minutes and then uncovered for 15 minutes more. Let stand for 10 minutes before slicing. If your lasagna was cold prior to baking, bake covered for 15-30 minutes longer."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 tablespoons olive oil",
    "1 medium butternut squash, peeled and cut into small cubes (about 8 cups)",
    "1 tablespoon brown sugar",
    "4 cloves garlic, finely chopped",
    "1/2 teaspoon salt + 1/2 teaspoon pepper",
    "1/4 teaspoon nutmeg, plus a pinch more for the béchamel",
    "6 fresh sage leaves, chopped + more for topping",
    "2 teaspoons fresh thyme, chopped",
    "1 large bunch kale, roughly chopped",
    "4 tablespoons butter",
    "1/4 cup flour",
    "2 1/2 cups warm milk (I use 2%)",
    "1/4 teaspoon nutmeg",
    "1/2 cup parmesan cheese, grated, plus more for serving",
    "4 ounces blue cheese, crumbled (or use cream cheese or mozzarella)",
    "8 ounces fontina cheese, shredded",
    "1 pound no boil whole wheat lasagna noodles (OR 1 pound fresh pasta)",
    "Toasted pumpkin seeds + salt, for topping"
  ],
  "__v": 1
}