{
  "hash": "cf8c5384d1b16405e77fa27f590e917da380e3dc",
  "title": "Dark Chocolate Coconut Treats – Vegan, Gluten-free + Refined Sugar-Free",
  "image": "",
  "href": "http://tasty-yummies.com/dark-chocolate-coconut-treats-vegan-gluten-free-refined-sugar-free/",
  "extension": "Chrome",
  "firstAdded": "2017-01-04T05:07:06.696000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large mixing bowl, combine all of the coconut filling ingredients and mix together until well combined. Evenly divide up the filling between the 12 muffin cups, pressing it in very tightly, making sure it is even. Don’t worry they won’t stick. Place the muffin pan in the freezer make sure it is sitting flat, and freeze until hard, about 30 minutes.",
    "While the coconut filling is cooling, melt the dark chocolate with the coconut oil. Either very carefully in a double boiler setup on the stove top or in small increments in the microwave. After the chocolate and coconut oil is melted and whisked together and well combined, remove from the heat (if you melted it on the stove), and add in the maple syrup. Stir well to combine. Give the chocolate topping a little taste to see if you want it any sweeter. Add more syrup, if you wish. Take the muffin tin with the frozen coconut mixture out of the freezer, and divide your chocolate mixture over it, spooning it on top and smoothing the chocolate out to make sure it totally covers the coconut.",
    "Put the muffin tin back into the freezer, and freeze until the chocolate has set, about another 30 minutes or so. To get the treats out of the pan, slide a knife around the outside of the treat and it will very easily pop out.",
    "After these are set, you could store them in the freezer and keep them really cold and solid or just in the fridge. I keep them in the fridge, myself. Just don’t leave them sitting out on the counter as they will get pretty melty.",
    "*NOTE: if you aren’t worried about making this refined sugar free, you could just melt semi-sweet chocolate chips, I was just hoping to avoid the sugar, so I made my own chocolate topping."
  ],
  "ingredients": [
    "0",
    "Coconut Filling:",
    "2 1/2 cups unsweetened organic coconut, finely shredded",
    "1/2 cup melted coconut oil",
    "1/4 cup maple syrup (you could use honey, coconut nectar or any other liquid sweetener)",
    "1 teaspoon vanilla extract",
    "Chocolate Topping*:",
    "6 ounces 100% unsweetened organic dark chocolate (aka bakers chocolate) I used this",
    "1 tablespoon coconut oil",
    "1/3 cup maple syrup (again any other liquid sweetener would work)"
  ],
  "__v": 1
}