{
  "__v": 3,
  "directions": [
    "0",
    "Drain the cannellini beans of any excess water (the dryer the better). Add beans, Greek yogurt, garlic, tahini/sesame paste and cumin in the food processor. Run until a very smooth puree forms. Season with salt and black pepper to taste. You could cook the puree in a pot for a few minutes to get rid of the “can”-taste, but it doesn’t really bother me so I wouldn’t stress it. Set it aside until needed.",
    "Clean the food processor bowl and towel-dry it really well. Add ground lamb, garlic, shallots, ginger, corn starch, olive oil, allspice, cinnamon, cumin, coriander, salt and black pepper. Pulse until all the ingredients are evenly combined, then keep the machine running on low and start drizzling in 2 tbsp of water. Keep the food processor running for a few seconds until the mixture become “paste-like”. You could also do this on a stand-mixer with a pedal-attachment. This process “beats” the water and the protein together to achieve an “emulsion” if you will. It gives the meatball a silky texture.",
    "Preheat the oven on 430ºF/220ºC.",
    "Line a large baking sheet with parchment paper. Form the lamb mixture into tiny meatballs, approx 1 1/2 tsp each and lay them evenly on the baking sheet. Bake in the preheated oven until the meatballs start to brown and are set in shape. I find this much easier than doing it in the frying pan because I can do it all in one batch and the round shape retains much better in the oven… and… NO SPLATTER! Once the meatballs are set, take them out of the oven. Heat up 2 tbsp of extra virgin olive oil in a large non-stick pan on medium-high heat. Add the meatballs and brown them nicely all over. Add the pine nuts and cumin seeds (updated), and let them toast until golden brown (this would happen relatively quick!). Then add the minced garlic, fresh mint and chili flakes. Cook only for another few seconds. Re-season it with salt’n pepper.",
    "You may now notice that there are seemingly more than enough meatballs for the amount of beans… did that bother my stealthy munching fingers? Not one bit…",
    "Pour the cannellini puree on a big platter and do some pretty swirls. Add the meatballs and pine nuts on top (whatever’s left of it…) and drizzle more extra virgin olive oil and pretty chili flakes on top.",
    "Serve with hot pitas."
  ],
  "firstAdded": "2014-06-19T15:21:31.532000",
  "hash": "1b88afe9cc285cde877c260d40ef5192da461a7d",
  "href": "http://www.ladyandpups.com/2013/03/11/turkish-kofta-platter-eng/",
  "image": "http://www.ladyandpups.com/wp-content/uploads/2013/03/lamb-meatballs-and-beans11.jpg",
  "ingredients": [
    "0",
    "Cannellini puree:",
    "2 cans of cannellini beans",
    "1/2 cup of thick Greek yogurt",
    "1 clove of garlic",
    "1 tbsp of tahini/sesame paste",
    "1/4 tsp of ground cumin",
    "1/4~1/2 tsp of salt",
    "1/4 tsp of ground black pepper",
    "Lamb meatballs:",
    "500 g of ground lamb, or beef/pork",
    "3 cloves of garlic, finely minced",
    "1 shallot, finely minced",
    "1 tsp of ginger, grated",
    "1 small egg, or 1/2 large egg",
    "1 1/2 tbsp of corn starch",
    "1 tbsp of olive oil",
    "1/2 tsp of ground allspice",
    "1/2 tsp of ground cinnamon",
    "1/4 tsp of ground cumin",
    "1/4 tsp of ground coriander",
    "1/2 tsp of salt",
    "1/8 tsp of ground black pepper",
    "2 tbsp of water to drizzle in",
    "extra:",
    "2 tbsp of extra virgin olive oil, plus more to drizzle",
    "2 tbsp of pine nuts",
    "1/2 tsp of cumin seeds",
    "1 clove of garlic, minced",
    "1 bunch of fresh mint, chopped",
    "1~2 tsp of chili flakes"
  ],
  "keywords": [
    "cannellini",
    "puree",
    "beans",
    "greek",
    "yogurt",
    "clove",
    "garlic",
    "tahinisesame",
    "cumin",
    "salt",
    "black",
    "pepper",
    "lamb",
    "meatballs",
    "beefpork",
    "shallot",
    "ginger",
    "egg",
    "corn",
    "starch",
    "olive",
    "oil",
    "allspice",
    "cinnamon",
    "coriander",
    "water",
    "drizzle",
    "extra",
    "virgin",
    "pine",
    "nuts",
    "seeds",
    "bunch",
    "mint",
    "chili"
  ],
  "title": "TURKISH KOFTA PLATTER",
  "users": [
    null
  ]
}