{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 350 degrees (F).",
    "Prepare three 8-inch round pans with cooking spray and parchment rounds. Set aside.",
    "In a large mixing bowl, combine all cake ingredients except boiling water (sugar, flour, baking powder, baking soda, salt, eggs, milk, oil, vanilla and cocoa powder.)",
    "With a hand mixer, beat until just combined.",
    "Add boiling water, and carefully beat until just combined again. Use a spatula to clean sides of bowl, and beat one more time.",
    "Evenly distribute batter between three cake pans (I use a kitchen scale to help).",
    "Bake for 30-35 minutes or until a cake-tester comes out clean.",
    "Cool on a wire rack for 15 minutes, then remove cakes from pans and cool completely.",
    "In the bowl of a stand mixer fitted with the paddle attachment, beat together butter and cream cheese until smooth and creamy.",
    "Add peanut butter and vanilla, and beat until incorporated. Use a spatula to clean the sides of the bowl, and beat again.",
    "Add confectioners sugar and heavy cream, and beat until smooth.",
    "In a heavy-bottomed saucepan, slowly melt butter. Remove from heat.",
    "Immediately add chocolate, and allow the heat to melt the butter, stirring with a rubber spatula until smooth.",
    "Set aside to cool slightly - for about 10 minutes.",
    "Once cake is cool, place bottom layer on cake plate.",
    "Using an offset spatula, smooth about a cup of frosting over the cake.",
    "Add second layer, and repeat with another cup of frosting.",
    "Add the top layer. Use the spatula to smooth the frosting around the outside of the cake, and refrigerate for 15 minutes to help solidify the cake layers.",
    "Remove cake from refrigerator, and spoon a large mound of frosting on the top layer (about 2 cups worth) and smooth the frosting over the top and sides of cake. Add more frosting as needed to completely cover the cake.",
    "Smooth frosting into an even layer on the tops and sides.",
    "Return cake to refrigerator for another 15-20 minutes to chill the frosting. Prepare the ganache during this time.",
    "Once chilled, pour the slightly-cooled ganache over top of the cake, slowly, starting in the middle of the cake.",
    "Once the ganache begins to drip over the sides of the cake, stop pouring.",
    "Top with chopped peanut butter cup candies, and drizzle with another bit of ganache.",
    "Refrigerate again for 10-15 minutes.",
    "Cut 8 full-size peanut butter cups in half. Use them to rim the bottom of the cake.",
    "Enjoy!"
  ],
  "firstAdded": "2014-10-23T14:27:20.953000",
  "hash": "90095d86abda8b0788dc891facde9669af5ae4c6",
  "href": "http://lemon-sugar.com/2014/09/ultimate-peanut-butter-chocolate-cake.html/",
  "image": "http://lemon-sugar.com/wp-content/uploads/2014/09/The-Ultimate-Peanut-Butter-Cup-Chocolate-Cake-0469.jpg",
  "ingredients": [
    "0",
    "3 cups sugar",
    "2 and 2/3 cups all-purpose flour",
    "1 and 1/3 cups cocoa powder",
    "2 and 1/4 teaspoons baking powder",
    "2 and 1/4 teaspoons baking soda",
    "1 and 1/2 teaspoons salt",
    "3 eggs",
    "1 and 1/2 cups milk",
    "3/4 cup vegetable oil",
    "1 Tablespoon vanilla extract",
    "1 and 1/2 cups boiling water",
    "1 cup (2 sticks) unsalted butter, softened but cool",
    "8 oz (1 box) cream cheese, at room temperature",
    "1 teaspoon vanilla extract",
    "1 and 1/4 cup peanut butter",
    "4 cups confectioners' sugar",
    "1/4 cup heavy cream",
    "4 ounces semi-sweet chocolate",
    "4 ounces (1/4 cup) unsalted butter",
    "Chopped Reeses Peanut Butter Cup Candies (I used one bag of bite-size and 8 full-size cups)"
  ],
  "keywords": [
    "sugar",
    "allpurpose",
    "flour",
    "cocoa",
    "baking",
    "soda",
    "salt",
    "eggs",
    "milk",
    "oil",
    "vanilla",
    "boiling",
    "water",
    "unsalted",
    "butter",
    "softened",
    "cool",
    "box",
    "cream",
    "cheese",
    "room",
    "peanut",
    "confectioners",
    "semisweet",
    "chocolate",
    "reeses",
    "candies",
    "used",
    "bitesize",
    "fullsize"
  ],
  "title": "The Ultimate Peanut Butter Chocolate Cake",
  "users": [
    null
  ]
}