{
  "hash": "d34265353d21a4512d09773fdda8d466d24def52",
  "title": "Chorizo empanadas",
  "image": "//images.food52.com/o6m3r0qd6etCB6CfpmJVijp9KOQ=/753x502/69d6fc08-141b-48a3-aba6-6865ab62409e--chorizo_empanada_1.jpg",
  "href": "http://food52.com/recipes/8042-chorizo-empanadas",
  "extension": "Chrome",
  "firstAdded": "2016-02-26T16:02:19.837000",
  "users": [
    null
  ],
  "keywords": [
    "purpose",
    "flour",
    "salt",
    "cold",
    "butter",
    "pieces",
    "ice",
    "water",
    "egg",
    "white",
    "vinegar",
    "glaze",
    "olive",
    "oil",
    "yellow",
    "onion",
    "spanish",
    "chorizo",
    "roasted",
    "red",
    "pepper",
    "couple",
    "arugula",
    "sage",
    "leaves",
    "pine",
    "nuts",
    "clove",
    "garlic",
    "needed",
    "pecorino",
    "romano",
    "creme",
    "fraiche"
  ],
  "directions": [
    "0",
    "In a food processor, pulse together the dry ingredients for the dough. Then quickly pulse in the butter until the mixture looks like a coarse meal. Add in the beaten egg and ice water, and vinegar pulse until everything comes together to form a dough. Then scoop the dough out (don't cut yourself on the food processor blade - it happens!) and form it into a ball. Knead it a few times on a lightly floured surface, flatten it into a disc, cover it with plastic wrap, and chill for an hour in the refrigerator.",
    "Heat a couple of splashes of olive oil in a large skillet over medium-high heat. Stir in the onion and cook for a couple of minutes until it becomes translucent. Then, turn the heat down to low and continue to cook, stirring occasionally, until the onions are well caramelized, about 10 minutes.",
    "Stir in the chopped chorizo, roasted pepper, and arugula and cook for a couple more minutes. Stir in salt and pepper to taste, then remove from the heat and set aside.",
    "In the bowl of a mortar and pestle (this can also be done in the food processor - if you've gotten around to cleaning it since making the dough), pound together the sage leaves, pine nuts, garlic clove, Pecorino, and salt. Little by little, smash in the olive oil, until you have reached a chunky pesto consistency. Stir about half of this into the creme fraiche. Taste, and if you'd like stronger sage flavor, stir in a bit more. (The rest you can reserve for drizzling on top of some other treat.)",
    "When you're ready to make the empanadas, preheat your oven to 400F. Divide the dough into 12 equal pieces (I generally do this by dividing it in half six times) and roll each piece into a ball. Then, on a lightly floured surface, roll each ball into about a 6 inch circle (maybe a bit smaller).",
    "Spread each circle with a layer of the sage-creme fraiche mixture, leaving a space around the edge of about 1/2 inch. Then, scoop a couple Tablespoons of the chorizo mixture into the middle of each. (If you have any extra filling, I recommend snacking on it while you finish baking - for fortification.)",
    "Fold the dough in half to make little half-moons, using a little water to moisten the edges and help them to seal. Then, press the edges with the tines of a fork. Place the empanadas on two parchment lined baking sheets. Whisk together the egg and water for the glaze, and lightly brush each of the empanadas with the mixture.",
    "Bake each sheet of empanadas for 20 minutes, or until they are golden brown. Allow to cool and put out to serve. (You can also serve them warm, of course.)"
  ],
  "ingredients": [
    "0",
    "2 1/4 cups all purpose flour",
    "1 teaspoon salt",
    "1/2 cup cold butter, cut up into pieces",
    "1/3 cup ice water",
    "1 egg, beaten",
    "1 tablespoon white vinegar",
    "1 egg, for the glaze",
    "1 1/2 tablespoons water, for the glaze",
    "1",
    "olive oil",
    "1 yellow onion, diced",
    "6 ounces dried Spanish chorizo, finely diced",
    "1 cup roasted red pepper, finely chopped",
    "a couple of handfuls of arugula, chopped",
    "2 ounces sage leaves",
    "2 ounces pine nuts",
    "1 large clove of garlic",
    "2/3 cup olive oil (plus a little more if needed)",
    "2 ounces grated Pecorino Romano",
    "1 teaspoon salt",
    "1/2 cup creme fraiche"
  ],
  "__v": 1
}