{
  "__v": 1,
  "directions": [
    "0",
    "nizio scaldando il latte a fiamma moderata, inserisco la bacca di vaniglia privata dei semi e lascio in infusione.",
    "Mescolo velocemente i tuorli con lo zucchero avendo cura di non inglobare aria e aggiungo la polpa della vaniglia. Meglio fare questa operazione a mano e stare alla larga dallo sbattitore elettrico.",
    "Verso il latte caldo sulla miscela di tuorli e zucchero, una rapida giratina e rimetto il tutto sul fuoco.",
    "Devo assolutamente rimanere vigili e smuovere continuamente il composto. Quella della crema inglese, infatti, viene definita “coagulazione in movimento” , opposta alla coagulazione statica tipica del crèm caramel e della crème brûlée.",
    "Controllo la temperatura con un termometro, è vitale non superare i fatidici 85°, e raggiungo la cosiddetta cottura “alla rosa”. Per i meno tecnologici vale sempre la nappatura del cucchiaio, se sul dorso si forma un velo è praticamente fatta.",
    "La crema inglese va servita ancora tiepida o raffreddata velocemente in un bagnomaria di acqua e ghiaccio. Decidete voi quando e come gustarla, l’importante è travasarla dal pentolino e tenere d’occhio la temperatura.",
    "Sorry guys ma un’altra partita Italia vs England è stata vinta, la seconda."
  ],
  "firstAdded": "2014-10-08T14:06:09.919000",
  "hash": "fd22cec91c0ccb19d89e531e7b5b936f46f6eabd",
  "href": "http://www.dissapore.com/grande-notizia/video-ricetta-crema-inglese/",
  "image": "http://www.dissapore.com/wp-content/uploads/2014/06/Crema-inglese-640x425.png",
  "ingredients": [
    "0",
    "450 gr di latte intero",
    "50 gr di panna fresca (sostituibile con il latte)",
    "60 gr di tuorlo d’uovo",
    "60 gr di zucchero semolato",
    "1/2 bacca di vaniglia"
  ],
  "keywords": [
    "latte",
    "intero",
    "panna",
    "fresca",
    "sostituibile",
    "tuorlo",
    "duovo",
    "zucchero",
    "semolato",
    "bacca",
    "vaniglia"
  ],
  "title": "Video ricetta della crema inglese",
  "users": [
    null
  ]
}