{
  "hash": "c9daaeb8e92b6eee13138d02323e86d158db1c2d",
  "title": "Parmesan Roasted Cauliflower and Chicken Sheet Pan Dinner",
  "image": "https://www.snixykitchen.com/wp-content/uploads/2018/11/Parmesan-Roasted-Cauliflower-Chicken-Sheet-Pan-Dinner-4.jpg",
  "href": "https://www.snixykitchen.com/parmesan-roasted-cauliflower-and-chicken-sheet-pan-dinner/",
  "extension": "Firefox",
  "firstAdded": "2019-03-03T08:10:43.551000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 425°F.",
    "On a large 10x15 or 12x18 sheet pan or large 9x12 baking pan, toss the cauliflower with 1/4 cup avocado oil and 1/2 teaspoon salt, and 1/4 teaspoon freshly ground pepper. Spread the cauliflower out into an even layer, add the fresh thyme sprigs, and roast for 25 minutes on the bottom rack, tossing every 10 minutes to help the cauliflower evenly brown.",
    "Meanwhile, if serving with pasta, bring a large pot of water to boil.",
    "While the cauliflower roasts, heat a large skillet over medium heat (I use a cast-iron skillet). Rub the skins of the chicken with the 2 teaspoons avocado oil and sprinkle with a few pinches each of salt and pepper. Place the chicken skin-side down on the hot pan and cook until the skin is golden brown and crispy, 5-7 minutes. Transfer to a plate, skin-side up until the cauliflower is ready.",
    "Pull the cauliflower out of the oven and toss with parmesan, butter, and lemon zest. Nestle the chicken into the cauliflower so it rests on the bottom of the pan with cauliflower all around. Return the pan to the oven and roast for 20-25 minutes longer until the chicken registers 165°F.",
    "If serving with pasta, cook the pasta according to the instructions, then toss with butter, olive oil, lemon juice, and parmesan. Set aside for serving.",
    "When the chicken is done, toss the cauliflower with lemon juice and sprinkle with pine nuts. Serve the chicken and cauliflower over pasta."
  ],
  "ingredients": [
    "0",
    "2 small heads cauliflower, cut into 1-inch florets",
    "1/4 cup + 2 teaspoons avocado oil or extra virgin olive oil, divided",
    "4 boneless skin-on chicken breasts",
    "4 sprigs fresh thyme",
    "½ cup freshly grated parmesan cheese, plus more for serving",
    "1 tablespoon unsalted butter",
    "Zest from 1 lemon",
    "3 tablespoons toasted pine-nuts",
    "1 tablespoon lemon juice",
    "Kosher salt & pepper"
  ],
  "__v": 1
}