{
  "hash": "51c34abb1a429f68c4827281710e0dad3e77cc6b",
  "title": "Shanghai-Style Pork Chops",
  "image": "https://thewoksoflife.com/wp-content/uploads/2018/09/shanghai-pork-chop-3.jpg",
  "href": "https://thewoksoflife.com/2018/10/shanghai-pork-chops/",
  "extension": "Chrome",
  "firstAdded": "2018-10-09T17:53:49.747000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Rinse the pork tenderloin and pat it dry with a kitchen towel or paper towel. Slice the pork about 2 inches thick on a 30-degree angle. Then pound the meat to about ½-inch thick using a rolling pin or the back of your knife. Be careful not to pound it too thin.",
    "Marinate the pork chops with 2 beaten eggs, ½ teaspoon white pepper powder, 2 tablespoons light soy sauce, 1 tablespoon Shaoxing wine, 1½ tablespoons oyster sauce, and 1 teaspoon cornstarch. Mix everything well, and marinate for 30 minutes. (Move it to the refrigerator if you’re making this in the summer months.)",
    "Now prepare the dipping sauce. Add 1½ tablespoons light soy sauce, 1 tablespoon dark vinegar, ½ teaspoon sugar, 1 teaspoon Worcestershire sauce, 3 tablespoons water, and chili oil to taste. Stir and set aside.",
    "Add the vegetable oil to a deep pan for frying, at a depth of about 1 inch. Preheat it using low heat. While that’s happening, quickly beat 2 eggs in a large bowl. In another bowl, add ½ cup all-purpose flour, and add 1½ cups panko to another large plate.",
    "Take the pork chop, lightly coat it with flour, then quickly dip it in the beaten egg. Next, dredge it in the panko to coat. Do your best to press the panko flakes into the pork chop to achieve a thick coating. Repeat until all of the pork is coated.",
    "Now turn the heat to medium high, and make sure the oil comes up to 350 degrees F. Fry the pork chops in batches for about 1½ minutes on each side. They’re done once the crust turns golden brown. Don’t over-fry the pork chops. Most people overcook their pork. They should be juicy! In between batches, transfer the pork to a wire rack or plate lined with paper towels.",
    "To serve, cut the pork chop in large strips, and enjoy it with the dipping sauce you prepared."
  ],
  "ingredients": [
    "0",
    "1 pound pork tenderloin",
    "4 eggs (divided)",
    "½ teaspoon white pepper powder",
    "2 tablespoons light soy sauce",
    "1 tablespoon Shaoxing wine",
    "1½ tablespoons oyster sauce",
    "1 teaspoon cornstarch",
    "Vegetable oil for deep frying",
    "½ cup all-purpose flour",
    "1½ cups panko breadcrumbs"
  ],
  "__v": 1
}