{
  "hash": "866d26b02eb48672c04742b49a554d3c9784db0a",
  "title": "Old Fashion Scalloped Potatoes and Ham",
  "image": "",
  "href": "https://www.101cookingfortwo.com/everyday-scalloped-potatoes-and-ham/",
  "extension": "Chrome",
  "firstAdded": "2020-05-10T12:33:58.780000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "nstructions",
    "Preheat oven to 350° convection or 375° conventional.",
    "Scrub and cut four medium russet potatoes. Peeling is optional. Slice thin and a mandolin is recommended. If using a mandolin, please follow the manufacturers safety instructions.",
    "Chop 1 small onion. Chop, slice or cut your ham into bite size pieces.",
    "Over medium-high heat in a medium saucepan melt four tablespoons butter and add the onion. Cook until the onion is clearing some, about 3-4 minutes.",
    "Sprinkle in 4 tablespoons flour and mix well. Continue to cook and whisk for about 2 minutes until browning some.",
    "Add 3 cups of milk slowly while continuing to whisk. Whisk and cook until thickening well - about 3-4 minutes. During this part, add one teaspoon salt and 1/2 teaspoon pepper.",
    "Prep a 9 by 13 baking dish by coating with butter. Add about 1/3 of the potatoes. Top with 1/3 of the ham, 1/2 cup of cheese and 1/3 of the sauce. Repeat two more times but use a full cup of cheese on the top layer.",
    "Cover with aluminum foil.",
    "Bake for 90 minutes then uncover and cook another 20-25 minutes until nicely brown and bubbling. Allow to set for about 10 minutes before serving.",
    "Recipe Notes",
    "Pro Tips:",
    "Easy to cut in half. See the instructions below.",
    "Use a mandolin to slice the potatoes to save your fingers and time. But be careful with the mandolin.",
    "Use potatoes of your choice, but I like Russets. Peeling is optional.",
    "Cheese of your choice. I use cheddar or Monterey Jack.",
    "The original recipes ( many of them) suggest total cooking times of 60-70 minutes. While it is done, there is still a little firm in the potatoes which my wife and I don't like. I have done this 20 plus times, and I now do a total of almost 2 hours total cooking time. So, I have changed the instructions but feel free to cook for the original recommended 40 minutes covered and 25 minutes uncovered if you want firmer potatoes.",
    "I scale this up or down depending on how much leftover ham I have.",
    "Good refrigerated for 3-4 days, and can be frozen for 3-4 months.",
    "Instructions for half size:",
    "Use a 6X9 or 8X8 pan.",
    "In the recipe card, adjust the number of servings to 4. That will do the math and change the ingredient amounts displayed. WARNING- this does not adjust the instructions so you will need to use follow the amounts in the ingredients, and not the instructions.",
    "Cooking time does not change much, but check it a bit early."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "4 russet potatoes - medium cleaned and sliced thin. Peeling optional",
    "1 onion - small chipped",
    "4 tablespoon butter",
    "4 tablespoon flour - 1/4 cup",
    "1 teaspoon salt",
    "1/2 teaspoon pepper",
    "3 cups milk",
    "2 cups shredded cheese of choice - Monterey Jack or cheddar are good choices",
    "3/4 pound ham - dice or cut into small bite size bites. About 3 cups. A bit more or less is fine."
  ],
  "__v": 1
}