{
  "__v": 1,
  "directions": [
    "0",
    "In a medium mixing bowl, mix together the ground pork, ground beef, bread crumbs, egg, garlic, onion and cilantro. Season with salt and pepper. Mix ingredients until well combined.",
    "Shape meat mixture into 1-1/2 inch balls. Place on a plate and refrigerate until ready to use.",
    "Place the tomatoes and dried ancho chilies in a medium saucepan or pot. Fill saucepan with enough water to cover the tomatoes. Bring to boil, over high heat. Remove from heat and let cool slightly.",
    "Remove the stems and seeds from the chilies. Place cooked chilies in a blender cup with the chipotles. Using a slotted spoon, transfer the cooked tomatoes to the blender cup. Puree the chilies and tomatoes until smooth.",
    "Pour puree mixture into a 2 quart saucepan. Add 1-1/2 cups of the liquid in which the tomatoes were cooked. Season with salt and mix well.",
    "Brink sauce to a boil over medium heat. Carefully add the meatballs to the sauce. Cover and let simmer over medium-low heat for about 30 minutes. Serve over cooked spaghetti or Sopa de Arroz Blanco (white rice). Enjoy!",
    "For a Torta de Albondigas al Chipotle (Chipotle Meatball Sandwich) serve meatballs and sauce over a toasted bolillo roll. Top with your favorite cheese (I like queso fresco and/or Oaxaca cheese.) and broil in the oven for a few minutes until the cheese melts. Top with fresh chopped cilantro. Enjoy!"
  ],
  "firstAdded": "2014-08-17T15:37:23.273000",
  "hash": "16b84c88a1a55126920e90f81459187a59b6e514",
  "href": "http://www.lacocinadeleslie.com/2010/01/chipotle-twosday.html",
  "image": "http://2.bp.blogspot.com/-zHyj4NK8qgY/Uj4bCm31PKI/AAAAAAAAON8/NA_0YMX2N2k/s640/Albondigas_Chipotle_Meatballs_2_LCDL.jpg",
  "ingredients": [
    "0",
    "1/2 pound ground pork",
    "1/2 pound ground beef",
    "1/4 cup dry bread crumbs, plain",
    "1 large egg",
    "1 tablespoon fresh cilantro, finely chopped",
    "1 clove garlic, finely chopped",
    "1/2 cup onion, finely chopped",
    "10 to 12 roma tomatoes",
    "2 dried ancho chilies",
    "2 to 3 chipotle peppers in adobo"
  ],
  "keywords": [
    "pork",
    "beef",
    "dry",
    "bread",
    "crumbs",
    "plain",
    "egg",
    "cilantro",
    "clove",
    "garlic",
    "onion",
    "roma",
    "tomatoes",
    "ancho",
    "chilies",
    "chipotle",
    "peppers",
    "adobo"
  ],
  "title": "Albondigas al Chipotle",
  "users": [
    null
  ]
}