{
  "hash": "7b215e219074b50eff2c8f0a96c19661236295b4",
  "title": "AFRICAN PEANUT STEW",
  "image": "http://www.budgetbytes.com/wp-content/uploads/2014/08/African-Peanut-Stew-text.jpg",
  "href": "https://www.budgetbytes.com/2014/08/african-peanut-stew-vegan/",
  "extension": "Chrome",
  "firstAdded": "2017-11-01T22:46:23.204000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Peel and grate the ginger using a small holed cheese grater. Mince the garlic. Sauté the ginger and garlic in vegetable oil over medium heat for 1-2 minutes, or until the garlic becomes soft and fragrant.",
    "Dice the onion, add it to the pot, and continue to sauté. Dice the sweet potato (1/2 inch cubes), add it to the pot, and continue to sauté a few minutes more, or until the onion is soft and the sweet potato takes on a darker, slightly translucent appearance. Season with cumin and red pepper flakes.",
    "Add the tomato paste and peanut butter, and stir until everything is evenly mixed. Add the vegetable broth and stir to dissolve the thick tomato paste-peanut butter mixture. Place a lid on the pot and turn the heat up to high.",
    "While the soup is coming up to a boil, prepare the collard greens. Rinse the greens well, then use a sharp knife to remove each stem (cut along the side of each stem). Stack the leaves, then cut them into thin strips. Add the collard strips to the soup pot.",
    "Once the soup reaches a boil, turn the heat down to low and allow it to simmer without a lid for about 15 minutes, or until the sweet potatoes are very soft. Once soft, smash about half of the sweet potatoes with the back of a wooden spoon to help thicken the soup. Taste the soup and add salt if needed (will depend on the brand of broth used).",
    "Serve the stew hot with a few cilantro leaves if desired."
  ],
  "ingredients": [
    "0",
    "1 Tbspvegetable oil",
    "4 clovesgarlic",
    "1i nchfresh ginger",
    "1 medium sweet potato (1 lb)",
    "1 medium onion",
    "1tsp cumin",
    "1/4 tsp crushed red pepper",
    "6 oz cantomato paste",
    "1/2 cup natural style chunky peanut butter",
    "6 cups vegetable broth$",
    "1/2 bunch 2-3 cups chopped collard greens",
    "1/4 bunch cilantro garnish (optional)"
  ],
  "__v": 2
}