{
  "hash": "8f844fc07f4ebbace4c71d1d78646e4cf20d5fae",
  "title": "Vegan Caramel Sweet Potato Pie",
  "image": "https://www.godairyfree.org/wp-content/uploads/2016/11/Caramel-Sweet-Potato-Pie-ig-close.jpg",
  "href": "https://www.godairyfree.org/recipes/vegan-caramel-sweet-potato-pie",
  "extension": "Chrome",
  "firstAdded": "2017-08-14T18:57:29.035000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine the sugar, water, lemon juice, and salt in a medium-sized saucepan over medium heat. Once the sugar is fully moistened, do not stir the mixture. Instead, gently swirl the pan to mix. This will prevent the sauce from crystallizing.",
    "Cook the sugar, swirling the pan occasionally, until it turns deep amber in color. You want to cook it to a dark shade to give it the most flavor, but it should not smoke or smell burnt. Once it begins to color, it will progress very quickly.",
    "Once deeply colored, VERY CAREFULLY pour in the creamer. The mixture is likely to sputter and bubble up. Continue to cook the mixture for just a minute or two longer until the creamer is fully incorporated.",
    "Let cool completely before using or storing in a glass jar.",
    "1",
    "Preheat your oven to 350ºF.",
    "Add the mashed sweet potatoes, creamer, sugar, tapioca starch, vanilla, spices, and salt to your blender or food processor. Puree until perfectly smooth, stopping to scrape down the sides as needed.",
    "Transfer the filling to your par-baked crust, and smooth down the top.",
    "Drizzle about ½ cup of the cooled caramel sauce all over, and use a knife or thin spatula to marble it throughout.",
    "Bake for 50 to 60 minutes, or until the filling appears to be set and no longer shiny on top. It may still jiggle slightly when tapped, but it will continue to firm up as it cools.",
    "Let cool completely then refrigerate for at least 4 to 6 hours, for the cleanest slices.",
    "Serve with the leftover caramel sauce drizzled on top, if desired."
  ],
  "ingredients": [
    "0",
    "1 cup granulated sugar",
    "2 tablespoons water",
    "1 teaspoon lemon juice",
    "½ teaspoon salt",
    "½ cup unsweetened dairy-free creamer (I use nutpods French Vanilla)",
    "1",
    "1 9-inch dairy-free pie crust, par-baked or blind baked",
    "1 pound (about 2 cups) mashed sweet potatoes",
    "½ cup unsweetened dairy-free creamer (I use nutpods French Vanilla)",
    "½ cup light brown sugar, firmly packed",
    "¼ cup tapioca starch",
    "2 teaspoons vanilla extract",
    "1 teaspoon ground cinnamon",
    "½ teaspoon ground nutmeg",
    "½ teaspoon ground ginger",
    "¼ teaspoon cardamom",
    "½ teaspoon salt"
  ],
  "__v": 1
}