{
  "hash": "337e58dd2d18fd96d0570905ece0da32a73ec147",
  "title": "PORTUGUESE CUSTARD TARTS",
  "image": "http://img.sndimg.com/food/image/upload/w_707,h_398,c_fill,fl_progressive,q_80/v1/img/submissions/recipe/2000864909/1s6at1otSQy6CfW3wNV0_Screen Shot 2016-02-08 at 3.54.26 PM.png",
  "href": "http://www.geniuskitchen.com/recipe/jamie-olivers-portuguese-custard-tarts-525922?photo=cGhvdG8tMzc5Nzc4",
  "extension": "Chrome",
  "firstAdded": "2018-02-11T14:14:50.968000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Begin by preparing pastry shells.",
    "Lay puff pastries out flat, sprinkle with cinnamon and lightly rub it in to spread out and coat surface evenly.",
    "Roll up both pastry sheets and cut each into 6 even pieces.",
    "Stand up each piece on it's end and flatten down with fingers into disc shape, place disc's in standard muffin pan.",
    "Using fingers, spread each piece into a cup shape using the pan as a mold.",
    "Bake for 8-10 minutes at 400°F in oven on top shelf.",
    "While they're baking prepare custard mix.",
    "In a medium sized bowl mix together eggs, sugar, vanilla, creme fraiche and zest from 1 orange.",
    "Shells should still be a little soft and slightly puffed out when they come out of the oven - using a spoon, push back the pastry into the mold and into its cup shape so it can hold the custard.",
    "Fill each shell almost to the top with custard mix.",
    "Put custard-filled pastry shells back into 400°F oven on top shelf and bake for 8-10 minutes.",
    "While tarts continue baking prepare caramel topping.",
    "Heat up a medium sized saucepan on the stove over medium-high heat.",
    "Add sugar and juice from 2 oranges.",
    "Use care and caution when making caramel - it is like molten lava. Only use metal utensils while working with caramel as it will ruin wooden spoons and plastic could melt.",
    "Continuously watching pot and stir occasionally to prevent burning, sugar will melt and bubble as it cooks.",
    "Caramel is ready once it turns a nice amber color and should be done around the same time the tarts are finished baking.",
    "Move tarts onto wire rack to cool. Using a spoon, drizzle caramel over top of each tart.",
    "Submit a Correction"
  ],
  "ingredients": [
    "0",
    "PASTRY SHELLS",
    "2 sheets frozen puff pastry (thawed)",
    "1 tablespoon cinnamon (enough to cover both pastry sheets)",
    "CUSTARD",
    "2 eggs",
    "2 tablespoons sugar",
    "2 teaspoons vanilla",
    "1 cup creme fraiche",
    "2 tablespoons orange zest (zest from 1 orange)",
    "CARAMEL TOPPING",
    "8 tablespoons sugar",
    "1⁄2 cup orange juice (juice from 2 oranges)"
  ],
  "__v": 1
}