{
  "hash": "35f972f690dcd6d34a95d47cd292dd7bb305bb37",
  "title": "Sfenj (Moroccan Doughnuts)",
  "image": "https://images.food52.com/wzEoD7j3__KPOtOxH2kkHTOdJBQ=/753x502/5dbeff95-c76e-4320-b095-bfd9ac6671a1--2016-1129_sfenj-moroccan-fritters_james-ransom-161.jpg",
  "href": "https://food52.com/recipes/65670-sfenj-moroccan-doughnuts",
  "extension": "Chrome",
  "firstAdded": "2018-01-02T17:08:58.288000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Dissolve the yeast and sugar in a medium-sized bowl with the 4 tablespoons of warm water. Let the yeast starter stand for approximately 15 minutes until it is frothy and blooming so the yeast starter doubles in size.",
    "Sift the flour into a large mixing bowl, then add the orange zest and salt. Make a small well in the middle of the flour and pour the yeast starter into the well. Incorporate the yeast mixture by making a swirling motion with your fingers in the middle of the well, while slowly streaming in the remaining ¾ cup of warm water. Knead the mixture inside of the bowl with palm of your hands for approximately 15 minutes until the dough is very smooth. Cover with a clean towel and set aside in a warm place to rise until it’s roughly double in size, approximately 1 hour.",
    "When the dough has almost finished rising, fill a large pot with the canola oil and heat until it reaches 350ºF on a thermometer. With wet hands, lightly punch down the dough to deflate. Pull off a piece of donut batter that is approximately the size of a small egg. Use your thumb to make a hole in the center of the piece of batter. Open the hole with your fingers to form a donut that is approximately 4 inches in diameter. Drop the donut away from you into the pot. Be careful not to crowd the pot (three donuts at a time is about right). Fry the donuts for 2 minutes on one side, then flip and finish cooking on the other side for 1 ½ minutes.",
    "Remove the donuts to a cooling rack lined with paper towels to drain. Cool for approximately 4 minutes and then drizzle each donut with honey, sprinkle with pistachios. Serve immediately, preferably with hot mint tea."
  ],
  "ingredients": [
    "0",
    "1 tablespoon dry active yeast",
    "3 tablespoons sugar",
    "4 tablespoons plus 3/4 cup warm water",
    "2 1/2 cups plus 2 tablespoons flour",
    "Zest from 1 orange",
    "1/2 teaspoon kosher salt",
    "2 cups canola oil",
    "1 cup honey",
    "1/2 cup ground pistachios"
  ],
  "__v": 1
}