{
  "hash": "1cc4dd4202a20d046e8a85d20369bde18b835706",
  "title": "Mujaddara with Spiced Lemon Yogurt",
  "image": "https://purewows3.imgix.net/images/articles/2015_01/purewow_mujaddara_1.jpg?auto=format,compress&cs=strip",
  "href": "https://www.purewow.com/recipes/Mujaddara-with-Spiced-Lemon-Yogurt",
  "extension": "Chrome",
  "firstAdded": "2017-07-03T22:56:46.260000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "1. MAKE THE CARAMELIZED ONIONS: In a large sauté pan, heat the olive oil over medium heat. Add the onions and cook until they begin to wilt, 2 to 3 minutes. Season with salt and pepper, reduce the heat to low and continue to cook, stirring occasionally, until very golden brown and caramelized, 35 to 45 minutes.",
    "2. WHILE THE ONIONS COOK, MAKE THE LENTILS AND RICE: In a small pot, bring the lentils and 3 cups of water to a boil over medium-high heat. Add the salt and continue to simmer until the lentils are tender, 15 to 20 minutes. Drain the lentils and reserve. Rinse out the pot and use it to cook the rice.",
    "3. Bring the rice, bay leaf, cumin seeds, coriander seeds and 1 cup of water to a simmer over medium-low heat. Cover the pot and simmer until the rice absorbs all the liquid, 15 to 20 minutes. Toss the rice with the reserved lentils and three-quarters of the caramelized onions. Set aside the remaining onions to use as garnish.",
    "4. MAKE THE YOGURT MIXTURE: In a small bowl, whisk the ingredients to combine.",
    "5. To serve, place a piece of pita bread on a plate and scoop the rice-and-lentil mixture onto the pita. Top with 2 tablespoons of the yogurt mixture, and garnish with 1 teaspoon mint, 1 teaspoon cilantro and a scoop of the reserved caramelized onions."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "CARAMELIZED ONIONS",
    "2 tablespoons olive oil",
    "2 large sweet onions, thinly sliced",
    "Salt and freshly ground black pepper",
    "LENTILS AND RICE",
    "½ cup French green lentils",
    "Pinch of salt",
    "½ cup jasmine rice",
    "1 bay leaf",
    "½ teaspoon cumin seeds",
    "½ teaspoon coriander seeds",
    "SPICED LEMON YOGURT",
    "1 cup Greek yogurt",
    "1 lemon, zested and juiced",
    "1 teaspoon ground cumin",
    "1 teaspoon ground coriander",
    "Pinch of red-pepper flakes",
    "TO FINISH",
    "Pita bread, for serving",
    "¼ cup chopped cilantro, for garnish",
    "¼ cup chopped mint, for garnish"
  ],
  "__v": 1
}