{
  "hash": "5d5daf8665bb964d13363f3531e6a26623bad334",
  "title": "Blue Cornmeal Pizza Topped with Roasted Tomatillo Salsa",
  "image": "",
  "href": "http://cafelynnylu.blogspot.com/2010/12/blue-cornmeal-pizza-topped-with-roasted.html",
  "extension": "Chrome",
  "firstAdded": "2015-07-05T23:27:11.631000",
  "users": [
    null
  ],
  "keywords": [
    "water",
    "olive",
    "oil",
    "bread",
    "machine",
    "yeast",
    "flour",
    "blue",
    "cornmeal",
    "yellow",
    "salt",
    "canned",
    "chipotles",
    "adobo"
  ],
  "directions": [
    "0",
    "According to manufacturer's for your bread machine, add the ingredients to the pan. Process on the dough cycle. Regarding the chipotles, I usually knead them in after removing the dough from the bread machine pan or during the last knead cycle on the bread machine. Most bread machines have the modes broken down into total time and the duration of each cycle. While dough is being processed, prepare roasted tomatillo sauce. Preheat a baking stone in a 450° oven for at least 30 minutes.When dough cycle is complete, transfer the dough to a lightly floured work surface. Divide into desired number of balls. Cover and let rest for 10 minutes. Roll out dough into a thin circle. Place on a peel which has been dusted with cornmeal. Spread salsa over the dough. Sprinkle with shredded jack cheese, halved cherry tomatoes and dried oregano. Slide pizza onto baking stone in oven. Bake 15-20 minutes or until cheese had melted and pizza is bubbly. Remove from oven. Repeat process with remaining pizza dough.To serve, garnish with diced avocados and cilantro. Makes two large or 4 small pizzas."
  ],
  "ingredients": [
    "0",
    "1-1/2 cups water-12 ounces",
    "2 tablespoons olive oil",
    "3/4 teaspoon bread machine yeast",
    "3 cups bread flour-14 ounces",
    "1/2 cup blue cornmeal-3 ounces",
    "1/2 cup yellow cornmeal-3 ounces",
    "2 teaspoons salt",
    "1 teaspoon minced canned Chipotles en Adobo, or to taste"
  ],
  "__v": 1
}