{
  "hash": "e646e5148525a0057005fb4e5d6b57a3a6c646fb",
  "title": "KENDAL HILLS MUSHROOM & VEGETABLE VEGAN SOUP",
  "image": "https://i1.wp.com/twokooksinthekitchen.com/wp-content/uploads/2017/11/IMG_6296a.jpg?resize=980%2C653&ssl=1",
  "href": "https://twokooksinthekitchen.com/kendal-hills-mushroom-vegetable-vegan-soup/",
  "extension": "Chrome",
  "firstAdded": "2017-11-25T15:54:22.437000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "MAKE BROTH if desired (ALTERNATIVELY, use store bought vegetable broth): Heat oil in large stock pot on medium heat and add all vegetables. Saute, stirring often, until they become soft (approx 5 minutes). Add herbs, peppercorn and bay leaf and stir to combine. Pour in enough water to cover vegetables then bring to a boil. Reduce to a simmer and cook for 2-4 hours (or longer). Remove from heat, cool and strain so you are only left with a clear broth.",
    "REHYDRATE MUSHROOMS: Put dry mushrooms in a bowl and cover with 4 cups of hot water. Set aside for at least 30 mins.",
    "SAUTE VEGETABLES/MAKE SOUP: Put large soup pot on medium heat and add in oil. Add diced onions, celery & carrots. Saute for about 5 mins stirring often. Add minced garlic and cook for another 2 mins. Leeks should be cut in half lengthwise then diced into 1/4\" thickness then added to pot cooking for 6 mins. Add dried herbs and stir to combine. Reduce heat to medium-low and add sweet potato, cooking for 5-10 mins. Trim and chop mushrooms (including stems) or tear them by hand. Add them to the pot and allow them to cook for 2-3 mins. Add rehydrated mushrooms including the soaking liquid into the pot along with the vegetable broth, stirring to combine.",
    "COOK & FINISH SOUP: Bring soup to a boil then reduce to a simmer for 1 hour (until vegetables are tender). Season with salt and pepper to taste and serve."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "MUSHROOM & VEGETABLE SOUP",
    "2 tablespoons oil",
    "2 cups dried mix mushrooms (shiitake, porcini, oyster, etc)",
    "4 cups very hot water",
    "2 large onions, diced",
    "4 large carrots, diced",
    "4 celery stocks, diced",
    "1 teaspoon salt",
    "1/2 teaspoon pepper",
    "2 garlic cloves, minced",
    "1 large leek, (white & pale green parts only)",
    "1 large sweet potato, peeled and chopped into 1\" cubes",
    "2 pounds fresh Kendal Hills mixed mushrooms (cinnamon cap, shiitake, oyster, abalone, etc)",
    "1 tablespoon dried thyme",
    "1 tablespoon dried rosemary, ground",
    "1 tablespoon herbs de provence",
    "4 cups homemade vegetable stock (see recipe below) or store bought",
    "salt & pepper to taste",
    "VEGETABLE BROTH RECIPE",
    "1 tablespoon oil",
    "2 onions, roughly chopped including skins",
    "3 large carrots, roughly chopped including skins and tops",
    "3 celery stalks, roughly chopped including leaves",
    "1 leek, roughly chopped including dark green parts",
    "1/2 pound mushrooms (shiitaki, cinnamon cap, abalone, oyster, etc), roughly chopped",
    "1 small bunch of fresh sage",
    "1 small bunch of fresh parsley",
    "1 teaspoon whole peppercorns",
    "1 bay leaf",
    "Water"
  ],
  "__v": 2
}