{
  "hash": "b041ff87f216a50a7a790ffa3b82dd4e1b6c1f88",
  "title": "Lemon Pepper Chicken with Orzo",
  "image": "http://www.budgetbytes.com/wp-content/uploads/2015/08/Lemon-Pepper-Chicken-with-Orzo-text.jpg",
  "href": "http://www.budgetbytes.com/2015/08/lemon-pepper-chicken-with-orzo/",
  "extension": "Chrome",
  "firstAdded": "2016-08-21T14:01:19.354000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Blot the chicken thighs dry with a paper towel, then season both sides liberally with lemon pepper seasoning (about 1 tsp per chicken thigh).",
    "Heat a large, deep skillet over medium flame. Add 1 Tbsp canola or vegetable oil. When the oil is hot (it should be shimmering), add the chicken thighs, skin side down. Allow the thighs to cook until browned, then flip and brown on the second side (about five minutes on each side for bone-in thighs with skin). Remove the cooked thighs to a clean plate.",
    "While the thighs are browning, mince two cloves of garlic and roughly chop ¼ bunch of parsley.",
    "After removing the chicken from the skillet, pour off the excess fat and turn the heat down to low. Add the garlic and sauté for about one minute. Add the chicken broth and stir to dissolve the browned bits from the bottom of the skillet.",
    "Add about half of the chopped parsley, one additional teaspoon of lemon pepper seasoning, and the orzo to the skillet. Stir to combine. Return the chicken thighs to the skillet, skin side up.",
    "Cover the skillet and turn the heat up to high. Allow the broth to come to a boil, then turn the heat down to low. Let the skillet simmer on low for 10-12 minutes, or until the orzo is tender. (If the broth stops simmering, increase the heat slightly to keep it simmering.)",
    "After 12 minutes, the orzo should be tender and most of the broth absorbed. If there is still too much liquid, allow it to simmer without the lid for a few minutes. It's okay if the orzo is slightly saucy. Sprinkle the remaining parsley over top along with the crumbled feta."
  ],
  "ingredients": [
    "0",
    "4 chicken thighs* $3.28",
    "5 tsp lemon pepper seasoning, divided $0.25",
    "1 Tbsp canola oil $0.04",
    "2 cloves garlic $0.16",
    "2.5 cups chicken broth $0.30",
    "¼ bunch parsley $0.19",
    "1.5 cups orzo $0.89",
    "2 oz. feta, crumbled $1.12"
  ],
  "__v": 1
}