{
  "hash": "22374d71e7ee569554c3db9f4edd99a411f7ae13",
  "title": "Fat-Free Vegan 'Cheese' Sauce [Gluten-Free]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/04/fatfreecheesehand2-1-of-1.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/fat-free-vegan-cheese-sauce/",
  "extension": "",
  "firstAdded": "2015-04-14T08:03:12.670000",
  "users": [
    null
  ],
  "keywords": [
    "need",
    "zucchini",
    "yukon",
    "gold",
    "potatoes",
    "type",
    "potato",
    "necessary",
    "water",
    "nutritional",
    "yeast",
    "garlic",
    "onion",
    "salt",
    "paprika",
    "regular",
    "dont",
    "smoked",
    "aminos",
    "lowsodium",
    "soy",
    "lemon",
    "juice"
  ],
  "directions": [
    "0",
    "First prepare the zucchini by preheating an oven to 415 degrees and line a sheet pan with parchment paper. Peel all the green skin off the zucchini and slice into 1/4 inch slices and salt and pepper well. It’s imperative to peel the zucchini, otherwise your sauce will be an ugly green. Bake for about 15 minutes until tender.",
    "Meanwhile, cook your potatoes your preferred method. Since I wanted a fast dinner, I just cooked them in the microwave for about 5 minutes until very soft. However, feel free to cook them whatever way you like. I left the skins on since I have a Vitamix, but if you are concerned about getting the sauce smooth, peel them before cooking.",
    "After the potatoes are cooked, mash them with a fork and measure out 1 cup. If you followed the correct weight measurement, you should get just about 1 lightly filled cup of mashed potatoes. If your potatoes are large, you may need less. It’s important to measure the mashed potatoes for accurate results. Add them to your high speed blender or a food processor.",
    "Once the zucchini is done, add it along with all of the remaining ingredients to your blender and blend until smooth. You will need to stop and scrape a couple of times during. Do not be too eager to add extra water until you’ve really blended it up a couple of minutes on high to get it completely smooth. It will seem to thick at first, but it will start to turn very smooth from all the water from the zucchini. If necessary, add just a tiny amount of water just to blend it.",
    "Taste and add any extra lemon juice and/or salt/spices if necessary. If you are using worcestershire sauce instead of soy sauce, you will likely need to add more the salt. The soy sauce works amazing in this, so only sub if you are allergic to soy. Add any desired toppings such as red pepper flakes, chopped tomatoes, sliced jalapenos. I like a kick of heat to my cheese so I added red pepper flakes but will totally blend up some jalapenos next time in the sauce.",
    "To make it as a mac ‘n’ cheese, just simply boil your pasta and pour as much (a lot!) cheese sauce over the pasta. You can either warm the cheese by running it awhile in the blender or gently warming over the stove. It gives such an incredible cheesy, thick and stick-to-pasta result. It really reminded me of mac ‘n’ cheese growing up. Considering this is totally fat-free and good for you, I’d say that’s huge!"
  ],
  "ingredients": [
    "0",
    "1 small zucchini, peeled and sliced (you will need about 1 cup sliced zucchini)",
    "5 small yukon gold potatoes (this type of potato is necessary)",
    "1 cup water",
    "1/4 cup nutritional yeast",
    "1/2 teaspoon garlic powder",
    "1/2 teaspoon onion powder",
    "1/2 teaspoon fine sea salt",
    "3/4 teaspoon smoked paprika or regular if you don’t like smoked",
    "2 teaspoons liquid aminos (or low-sodium soy sauce)",
    "1 tablespoon fresh lemon juice, or more to taste"
  ],
  "__v": 1
}