{
  "hash": "21cbf3d3d4b8a7be5807b84a895cc9923f5b7b9f",
  "title": "Thai Red Curry with Vegetables",
  "image": "http://cookieandkate.com/images/2015/10/thai-red-curry-with-coconut-milk-and-vegetables.jpg",
  "href": "http://cookieandkate.com/2015/thai-red-curry-recipe/",
  "extension": "Chrome",
  "firstAdded": "2015-12-18T16:18:05.900000",
  "users": [
    null
  ],
  "keywords": [
    "jasmine",
    "longgrain",
    "brown",
    "rice",
    "rinsed",
    "coconut",
    "olive",
    "oil",
    "white",
    "onion",
    "salt",
    "nub",
    "ginger",
    "garlic",
    "pressed",
    "red",
    "bell",
    "pepper",
    "long",
    "strips",
    "yellow",
    "green",
    "diagonal",
    "wide",
    "rounds",
    "yield",
    "carrots",
    "thai",
    "curry",
    "fullfat",
    "milk",
    "kale",
    "tough",
    "ribs",
    "preferably",
    "tuscanlacinatodinosaur",
    "variety",
    "turbinado",
    "raw",
    "sugar",
    "soy",
    "used",
    "reducedsodium",
    "tamari",
    "vinegar",
    "garnishessides",
    "basil",
    "cilantro",
    "sriracha",
    "chili"
  ],
  "directions": [
    "0",
    "To cook the rice, bring a large pot of water to boil. Add the rinsed rice and continue boiling for 30 minutes, reducing heat as necessary to prevent overflow. Remove from heat, drain the rice and return the rice to pot. Cover and let the rice rest for 10 minutes or longer, until you're ready to serve. Just before serving, season the rice to taste with salt and fluff it with a fork.",
    "To make the curry, warm a large skillet with deep sides over medium heat. Once it’s hot, add a tablespoon of oil. Add the onion and a sprinkle of salt and cook until the onion has softened and is turning translucent, about 5 minutes, stirring often. Add the ginger and garlic and cook until fragrant, about 30 seconds, while stirring continuously.",
    "Add the bell peppers and carrots and cook for until they are fork-tender, 3 to 5 more minutes, stirring occasionally. Then add the curry paste and cook, stirring often, for 2 minutes.",
    "Add the coconut milk and kale to the pan along with ¾ cup water and 1½ teaspoons sugar. Bring the mixture to a simmer over medium heat. Reduce heat as necessary to maintain a gentle simmer and cook until the peppers, carrots and kale have softened to your liking, about 5 to 10 minutes.",
    "Remove the curry from heat and season with rice vinegar and soy sauce. Add salt (I added ¼ teaspoon for optimal flavor), to taste. Divide rice and curry into bowls and garnish with chopped cilantro and a sprinkle of red pepper flakes, if you'd like. If you love spicy curries, serve with sriracha or chili garlic sauce on the side."
  ],
  "ingredients": [
    "0",
    "1 cup brown jasmine rice or long-grain brown rice, rinsed",
    "1 tablespoon coconut oil or olive oil",
    "1 small white onion, diced",
    "Pinch of salt, more to taste",
    "1 tablespoon finely grated fresh ginger (about a 1-inch nub of ginger)",
    "2 cloves garlic, pressed or minced",
    "1 red bell pepper, sliced into thin 2-inch long strips",
    "1 yellow or green bell pepper, sliced into thin 2-inch long strips",
    "3 carrots, peeled and sliced on the diagonal into ¼-inch wide rounds (to yield about 1 cup sliced carrots)",
    "2 tablespoons Thai red curry paste*",
    "1 can (14 ounces) full-fat coconut milk",
    "1½ cups packed thinly sliced kale (tough ribs removed first), preferably the Tuscan/lacinato/dinosaur variety",
    "1½ teaspoons coconut sugar or turbinado (raw) sugar or brown sugar",
    "2 teaspoons soy sauce (I used reduced-sodium tamari)**",
    "1½ teaspoons rice vinegar",
    "Garnishes/sides: handful of chopped fresh basil or cilantro, optional red pepper flakes, optional sriracha or chili garlic sauce"
  ],
  "__v": 1
}