{
  "hash": "c6212b52354a7fd0b9c0bbe9f82443d19ab42aaa",
  "title": "Missir Wot Pizza - Ethiopian Red lentil stew, Kale on Gluten free Teff Pizza Crust. vegan recipe",
  "image": "http://www.veganricha.com/wp-content/uploads/2012/10/missirwot-pizza-088-001.jpg",
  "href": "http://www.veganricha.com/2012/10/missir-wot-pizza-ethiopian-red-lentil.html",
  "extension": "",
  "firstAdded": "2015-10-19T23:01:03.867000",
  "users": [
    null
  ],
  "keywords": [
    "water",
    "active",
    "yeast",
    "raw",
    "sugar",
    "teff",
    "flour",
    "oat",
    "tapioca",
    "starch",
    "potato",
    "salt",
    "baking",
    "apple",
    "cider",
    "vinegar",
    "extra",
    "virgin",
    "olive",
    "oil",
    "evoo",
    "generous",
    "cumin",
    "sabut",
    "masoor",
    "brown",
    "lentils",
    "soaked",
    "atleast",
    "hours",
    "overnight",
    "medium",
    "onion",
    "garlic",
    "berbere",
    "spice",
    "kale",
    "greens",
    "vegan",
    "cheese",
    "cilantro",
    "herbs"
  ],
  "directions": [
    "0",
    "Miss wot: Whole Red lentil Stew:",
    "In a pressure cooker or pan, add oil and heat over low-medium.",
    "Add the onion and garlic and cook until translucent. 10-12 minutes.",
    "Add the berbere spice and mix. cook for a minute.",
    "Add the soaked lentils, salt and water. Mix well and cook over medium for 2 whistles in whistling pressure cooker then on low for 15 minutes. ( 10 minutes after the pressure has reached for electric pressure cooker)",
    "If using pan, Add them to the onion mixture along with salt, water and cook on medium, partially covered until the lentils start to disintegrate. 40-45 minutes.",
    "Taste and adjust salt and spice, take off heat and keep ready.",
    "You can also use pink/red lentils for a quicker cooking time",
    "Crust:",
    "In a bowl, add warm water, yeast and sugar, Mix well and let sit for 10 minutes or until frothy.",
    "In another bowl. mix all the flours, starches, salt, baking powder and spice/cumin if using.",
    "Add dry flours to yeast mixture. Add evoo and vinegar and whisk into a smooth batter.",
    "Let the batter sit for 1.5 hours. The batter with rise and become spongy.",
    "Mix it and drop onto parchment lined sheet.",
    "Drizzle a teaspoon of evoo and 'lightly' pat down the batter into desired shape using your hands. Spray water liberally on top.",
    "(you can also make the crust in an 8 inch cake pan to make a slightly fatter and even more softer crust)",
    "Preheat the oven to 375 degrees F. and let the crust sit near the oven or in a warm place for 10 to 15 minutes. you should see that the crust rises a bit.",
    "Bake in preheated 375 degrees F for 10 minutes. Place a foil on the baking sheet without touching the top of the batter if possible, during baking.",
    "Take crust out and load with chopped kale and then Missir wot lentils and cheese of choice. I used Daiya Cheddar.",
    "Spray water on the edges and bake for another 8-10 minutes.",
    "Take pizza out, top with fresh herbs. Let sit for a minute before slicing.",
    "Best served hot."
  ],
  "ingredients": [
    "0",
    "⅓ cup water",
    "1 teaspoon active yeast",
    "2 teaspoons raw sugar",
    "¼ cup teff flour",
    "¼ cup oat flour",
    "2 Tablespoons tapioca starch",
    "2 Tablespoons potato starch",
    "¼ teaspoon salt",
    "⅛ teaspoon baking powder",
    "½ teaspoon apple cider vinegar",
    "2 teaspoon extra virgin olive oil (evoo)",
    "a generous pinch of cumin powder (optional)",
    "1",
    "½ cup whole lentils (sabut Masoor, brown lentils) soaked for atleast 2 hours to overnight",
    "2 cups water",
    "2 teaspoons extra virgin olive oil",
    "½ medium onion chopped",
    "4-5 garlic cloves",
    "⅓ teaspoon salt",
    "2 teaspoons Berbere spice",
    "2",
    "Chopped Kale or other greens",
    "Shredded vegan cheese",
    "Chopped cilantro or fresh herbs of choice"
  ],
  "__v": 1
}