{
  "hash": "e264f0f80e03af31a905cd9fe602c4f759279a7f",
  "title": "Slow Cooker Chicken Shawarma",
  "image": "http://cdn1.wellplated.com/wp-content/uploads/2015/10/Slow-Cooker-Chicken-Shawarma.-Greek-yogurt-is-the-secret-ingredient-that-makes-this-chicken-recipe-fall-apart-tender-600x798.jpg",
  "href": "http://www.wellplated.com/slow-cooker-yogurt-chicken-shawarma/",
  "extension": "Chrome",
  "firstAdded": "2017-03-29T01:44:55.992000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "In a small bowl, stir together the allspice, oregano, salt, garlic powder, cinnamon, and cayenne. Set aside.",
    "Place the yogurt and lemon juice in the bottom of a shallow baking dish. Add half of the spice mixture (reserve the second half) and stir to combine. Add the chicken thighs and gently turn to coat in the yogurt mixture. Cover and refrigerate for 4 hours or overnight.",
    "Coat the bottom of a 5 or 6-quart slow cooker with cooking spray. Add the chicken and all of the yogurt marinade. Cover and cook on high for 2 hours or low for 4 hours, until the chicken is tender and cooked through.",
    "With a fork or slotted spoon, transfer the chicken to a large bowl (discard the cooking liquid). Shred the chicken with two forks, then sprinkle the remaining spice mixture over the top. Stir to coat with the reserved spices.",
    "Serve the chicken shawarma inside warmed pita bread, sprinkled with any desired toppings."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "1 tablespoon allspice",
    "2 teaspoons oregano",
    "2 teaspoons kosher salt",
    "1 1/2 teaspoons garlic powder",
    "1 teaspoon cinnamon",
    "1/2 teaspoon cayenne pepper",
    "1 cup plain, non-fat Greek yogurt",
    "1/2 cup freshly squeezed lemon juice (about 2 large lemons)",
    "2 1/2 pounds Just BARE Boneless Skinless Chicken Thighs",
    "Whole wheat pita pockets",
    "For serving: thinly sliced red onion, fresh parsley, diced tomatoes, sliced cucumbers, hummus"
  ],
  "__v": 1
}