{
  "hash": "9b18b42af5e9a885b65ef155658d8f6e7123a8fe",
  "title": "One Pan Italian Sausage and Veggies",
  "image": "https://www.chelseasmessyapron.com/wp-content/uploads/2017/01/One-Pan-Sausage-Veggies-with-parmesan.jpg",
  "href": "https://www.chelseasmessyapron.com/one-pan-healthy-italian-sausage-veggies/",
  "extension": "Firefox",
  "firstAdded": "2019-03-03T08:46:24.542000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 400 degrees F. Line a large sheet pan with parchment paper or foil (easy clean-up) and set aside.",
    "Prep the veggies: *It is important to prep the veggies according to directions to ensure they all cook at the same time*",
    "Peel and very thinly slice the carrots. Wash and (if desired peel, we love the peel on) chop the red potatoes. You want the pieces quite small here. (I halve the potatoes and then cut each half into 10-12 pieces)",
    "Halve the zucchini and then cut *thick* coins of zucchini. Coarsely chop the broccoli. Remove the stems and seeds from the peppers and chop into medium-sized pieces. Chop the sausage into thick coins.",
    "Pour all the veggies and sausage on the sheet pan. (I use this 15×21 inch sheet pan)",
    "In a small bowl combine all of the seasonings and salt and pepper if desired (I use about 1/8 teaspoon pepper and 1/2 teaspoon salt) with the olive oil. Stir to combine.",
    "Pour the seasoning & oil mixture on top of the veggies and sausage and thoroughly toss to coat.",
    "Place in the heated oven for 15 minutes. Remove and toss around the veggies + sausage and return to the oven for another 10-20 minutes or until veggies are crisp tender.",
    "Remove and top, if desired, with freshly grated Parmesan cheese and fresh parsley.",
    "Serve on top of rice or quinoa if desired. (Also great plain!)"
  ],
  "ingredients": [
    "0",
    "2 large carrots ~2 cups",
    "2 red potatoes ~2 cups",
    "1 small-medium zucchini ~2 and 1/3 cups",
    "2 red peppers ~2 cups",
    "1 head broccoli ~1 and 1/2 cups",
    "16 ounces Smoked Italian Turkey or Chicken Sausage"
  ],
  "__v": 1
}