{
  "hash": "92110c87b5fcb1dcdefc20ac8c9600352a378bf5",
  "title": "Shaved Brussels Sprout Salad with Bacon, Meyer Lemon, and Tart Dried Cherries",
  "image": "https://images.food52.com/uG3TInkUXl1dTIl-Coyr0j3IxKQ=/753x502/1770813c-af4d-455e-aca8-7a6fdc4de38a--shaved_brussels_sprout_salad_4.jpg",
  "href": "https://food52.com/recipes/31867-shaved-brussels-sprout-salad-with-bacon-meyer-lemon-and-tart-dried-cherries",
  "extension": "Chrome",
  "firstAdded": "2018-03-01T01:37:33.672000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Reserve the zest and juice of 1 Meyer lemon.",
    "In a medium-sized bowl, whisk 1/4 teaspoon sea salt into 3 tablespoons Meyer lemon juice, and then slowly whisk in the olive oil. Toss cherries into vinaigrette and set aside. Reserve any leftover Meyer lemon juice.",
    "Fry the bacon in a medium-sized skillet over medium heat. When edges have crisped, remove to a paper towel-lined plate to cool. Reserve 2 tablespoons bacon grease.",
    "Meanwhile, using all necessary precaution, shave the brussels sprouts lengthwise using the thinnest setting on your mandoline.",
    "In a large bowl, toss shaved brussels sprouts with the warm bacon grease. Next, add the kale leaves, and toss everything with the vinaigrette and tart cherries. Top salad with 1 tablespoon reserved Meyer lemon zest, grated fresh horseradish, black pepper, and sea salt to taste. Crumble the prepared bacon over the top. Flavor will continue to develop for a day or so, covered in the fridge. Before serving, you'll likely want to add a pinch more sea salt and a generous splash reserved Meyer lemon juice."
  ],
  "ingredients": [
    "0",
    "1 Meyer lemon",
    "1/4 teaspoon sea salt, plus more to taste",
    "3 tablespoons extra-virgin olive oil",
    "1/2 cup dried unsweetened tart cherries",
    "5 strips bacon",
    "1 pound brussels sprouts, ends trimmed",
    "6 large leave Tuscan kale (about a half bunch), cut into thin ribbons",
    "2 teaspoons grated fresh horseradish",
    "1/4 teaspoon ground black pepper"
  ],
  "__v": 1
}