{
  "hash": "e33dabfac3e1d5db4920897ea42a5aff9a25ad0f",
  "title": "Chicken Patty Parm",
  "image": "//food.fnr.sndimg.com/content/dam/images/food/fullset/2019/2/0/TM2824_Chicken-Patty-Parm.jpg.rend.hgtvcom.826.620.suffix/1552666966384.jpeg",
  "href": "https://www.foodnetwork.com/recipes/rachael-ray/chicken-patty-parm-with-salami-salad-5637376",
  "extension": "",
  "firstAdded": "2019-04-07T00:05:20.434000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 500 degrees F with rack at center. Line a baking sheet with parchment paper.",
    "Gather your ingredients.",
    "For the patties: Place chicken in large mixing bowl, season with salt and pepper and combine. Make a well in center of the meat and fill with breadcrumbs. Moisten them with milk, add egg and cheese. Peel garlic and grate into bowl. Finely chop parsley and add to bowl. Add fennel, nutmeg and chili flakes, then drizzle in about 3 tablespoons EVOO. Combine meat mixture then score with hand, form 4 large thin patties and arrange on the parchment. Place in oven and roast 12 minutes, remove.",
    "For the sauce: Meanwhile, heat EVOO, 2 turns of the pan, and butter in a deep skillet or a sauce pot over medium to medium-high heat. Peel and finely chop or grate the onion and let it soften a bit while you peel and chop or thinly slice the garlic. Add garlic to onion, stir a minute. Add paste then vermouth or wine and bring to a bubble. Add tomatoes to sauce and season with chili and oregano. Reduce heat and simmer to thicken a bit.",
    "To serve: Top the chicken patties with marinara sauce covering all the way to edges. Top the sauce with mozzarella and Parm and place the patties back in oven to brown the cheese.",
    "Top the patties with basil, parsley and Parm and serve with salami salad."
  ],
  "ingredients": [
    "0",
    "Patties:",
    "1 pound ground chicken breast",
    "1 pound ground dark meat chicken OR buy packaged ground white and dark meat chicken combined",
    "Salt and pepper",
    "2/3 to 3/4 cup breadcrumbs",
    "About 1/3 cup milk, to moisten",
    "1 egg",
    "1 cup loosely packed finely grated Parmigiano-Reggiano cheese",
    "3 large cloves garlic",
    "1/2 cup parsley leaves",
    "1 teaspoon (1/2 a palm full) fennel seed or pollen or a combo of them",
    "1/8 teaspoon grated nutmeg",
    "A pinch red chili flakes or ground pepperoncini",
    "EVOO",
    "Sauce:",
    "EVOO",
    "2 tablespoons butter",
    "1 small yellow or white onion",
    "3 large cloves garlic",
    "3 tablespoons sundried tomato paste",
    "1/2 cup red vermouth or red wine",
    "1 can (28 ounces) Italian crushed tomatoes",
    "1 teaspoon (about a 1/3 palm full) red chili flakes or ground pepperoncini",
    "1 teaspoon dried oregano",
    "To Serve:",
    "2 cups shredded mozzarella",
    "Parm, for garnish",
    "A few leaves of basil, torn, for garnish",
    "Chopped parsley, for garnish"
  ],
  "__v": 1
}