{
  "hash": "c70131846ed6bed5a56f353a4aeec9de2804deae",
  "title": "BIZCOCHO DE ALMENDRA Y NARANJA",
  "image": "http://3.bp.blogspot.com/-3RT-7xuUwrM/VWxY1Q5xpDI/AAAAAAAACJw/ighSrfpiRWo/s640/r7.jpg",
  "href": "http://mraemr.blogspot.com/2015/06/bizcocho-de-almendra-y-naranja.html",
  "extension": "Chrome",
  "firstAdded": "2015-07-01T15:36:42.933000",
  "users": [
    null
  ],
  "keywords": [
    "ingredientes",
    "huevos",
    "azcar",
    "harina",
    "almendra",
    "molida",
    "mantequilla",
    "derretida",
    "zumo",
    "naranja",
    "ralladura",
    "gotitas",
    "esencia",
    "natural",
    "pizca",
    "sal",
    "cucharada"
  ],
  "directions": [
    "0",
    "PREPARACIÓN: Precalentar el horno a 170 º C. Forrar con papel sulfurizado y embadurnar un molde redondo desmontable de 20 cm. Derretir la mantequilla.",
    "Separar las claras de las yemas. En un bol batir las yemas con el azúcar hasta que formen punto de cinta o relieve . Deben quedar blanquecinas y consistentes. Añadir el zumo de naranja y la ralladura y, continuar batiendo, hasta que quede un batido espumoso. Agregar ahora la almendra molida y mezclar. Ahora añadimos la harina tamizada y mezclamos con espátula de silicona. Es el momento de añadir la mantequilla derretida, poco a poco, evitando echar la película blanquecina que queda en el fondo. Yo la he ido añadiendo con una cuchara. Ligamos la masa.",
    "Montamos la claras a punto de nieve hasta que formen picos suaves. Añadimos una cucharada de azúcar. Seguimos batiendo hasta conseguir un merengue firme. Agregamos la cuarta parte del merengue a las yemas. Mezclamos con movimientos envolventes y con suavidad para que la masa no pierda aire. Añadimos el resto del merengue de otra dos veces. Vertemos la masa el molde y horneamos a altura media de horno, temperatura 170 ºC de 30 a 35 minutos. Cuando esté hecho quedará dorado y firme por la superficie. Si pinchamos un cuchillo o una aguja ha de salir limpio."
  ],
  "ingredients": [
    "0",
    "INGREDIENTES:",
    "3 huevos",
    "130 g. de azúcar",
    "70 g. de harina",
    "115 g. de almendra molida",
    "115 g. de mantequilla derretida",
    "75 ml. de zumo de naranja",
    "1 ralladura de naranja",
    "5 gotitas de esencia natural de almendra",
    "1 pizca de sal",
    "1 cucharada de azúcar"
  ],
  "__v": 1
}