{
  "hash": "f61c4441a8510c496f9cb47d5ae88a8e03175f44",
  "title": "Beef Wellington",
  "image": "http://recipe-folder.com/img/recipe-images/092/255/183478492.jpg",
  "href": "https://tasty.co/recipe/beef-wellington-for-two",
  "extension": "Chrome",
  "firstAdded": "2019-03-21T00:48:20.781000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a food processor, place mushrooms, garlic, salt, pepper, and thyme and blend into a fine paste (about 30-60 seconds).",
    "Transfer to a medium-sized frying pan, being sure to spread it evenly across the bottom of the pan.",
    "Cook the mushrooms over medium-low heat while stirring frequently. After about 7-10 minutes the mushroom mixture should shrink to half the original volume and begin to form a paste.",
    "NOTE: The goal here is to cook off the bulk of the water inside the mushrooms. This’ll keep the puff pastry from being too mushy at the end.",
    "At this point, remove the mushroom mixture from the heat and set it aside.",
    "Preheat oven to 400˚F (200˚C).",
    "Liberally season the outside of the tenderloin pieces with salt and pepper.",
    "In another medium-sized frying pan, heat 2 tablespoons of neutral oil over high heat. Once the oil has begun to smoke, quickly sear the tenderloin pieces on both sides (45-60 seconds per-side).",
    "Once seared, transfer the meat to a plate or cutting board to rest.",
    "Using a basting brush, generously paint the mustard over the resting pieces of beef, making sure to coat both sides.",
    "To assemble the Wellingtons, lay out a piece of puff pastry on a lightly floured surface. Place a piece of ham in the center of the pasty.",
    "Next, layer about 1 tablespoon of the mushroom mixture on the center of the ham using the back of a spoon to flatten the paste to about the size of the tenderloin pieces.",
    "Place one of the mustard-coated beef fillet on top of the mushroom mixture, then top the piece of beef with another spoonful of the mushroom mixture, making sure to pat it down flat across the top of the meat.",
    "Layer with another piece of ham and close the the Wellington by folding the puff pastry over the center of the meat.",
    "Using your hands, carefully seal the edges of the pastry then transfer SEAM-SIDE DOWN to a baking tray lined with parchment paper.",
    "Lightly brush the outside of each Wellington with egg wash.",
    "Using the back of a paring knife, lightly score the tops of the pasty in a checkered pattern, being careful not to pierce the pastry.",
    "Bake the Wellingtons in a 400˚F (200˚C) oven until the pastry is fully cooked and golden brown (about 20 minutes).",
    "Allow each Wellington to rest at least 10 minutes before cutting into it.",
    "Enjoy!"
  ],
  "ingredients": [
    "0",
    "8 oz mushrooms (225 g)",
    "1 clove garlic",
    "½ teaspoon salt",
    "½ teaspoon black pepper",
    "fresh thyme, to taste",
    "12 oz beef tenderloin, 2 tenderloins (340 g)",
    "2 tablespoons oil, for searing",
    "english mustard, to taste",
    "¼ lb sliced ham (115 g)",
    "1 sheet puff pastry, thawed, rolled-out, and cut into 2 - 7x7in (18x18cm) squares",
    "egg wash, 1 egg beaten with 1 tablespoon water"
  ],
  "__v": 2
}