{
  "hash": "845511b0a42c884225f5c73ff0982bd903f04018",
  "title": "Lowcountry Hoppin' John",
  "image": "http://www.splendidtable.org/sites/default/files/styles/lede_image/public/17_Lowcountry%20Hoppin%27%20John.jpg?itok=ny7AryBK",
  "href": "http://www.splendidtable.org/recipes/lowcountry-hoppin-john",
  "extension": "Chrome",
  "firstAdded": "2015-08-14T17:42:21.561000",
  "users": [
    null
  ],
  "keywords": [
    "peas",
    "quarts",
    "pork",
    "chicken",
    "stock",
    "blackeye",
    "soaked",
    "pot",
    "water",
    "refrigerator",
    "overnight",
    "medium",
    "dice",
    "onions",
    "carrots",
    "celery",
    "garlic",
    "bay",
    "leaf",
    "thyme",
    "sprigs",
    "jalapeo",
    "kosher",
    "salt",
    "rice",
    "cayenne",
    "pepper",
    "anson",
    "mills",
    "carolina",
    "gold",
    "unsalted",
    "butter",
    "cubed",
    "red",
    "pea",
    "gravy",
    "reserved",
    "cooking",
    "cider",
    "vinegar",
    "chives",
    "scallions"
  ],
  "directions": [
    "0",
    "For the peas:",
    "Bring the stock to a simmer in a small pot. Drain the peas and add to the stock, along with all of the remaining ingredients except the salt. Cook the peas, partially covered, over low heat until they are soft, about 1 hour. Season to taste with salt. (The peas can be cooked ahead and refrigerated in their liquid for up to 3 days; reheat, covered, over low heat before proceeding.)",
    "Drain the peas, reserving their cooking liquid, and measure out 1 cup peas and 2 cups liquid for the gravy; return the rest of the peas and liquid to the pot and keep warm.",
    "Meanwhile, for the rice:",
    "About 45 minutes before the peas are cooked, preheat the oven to 300°F.",
    "Bring the water, salt, and cayenne pepper to a boil in a large saucepan over medium-high heat. Reduce the heat to medium, add the rice, stir once, and bring to a simmer. Simmer gently, uncovered, stirring occasionally, until the rice is al dente, about 15 minutes.",
    "Drain the rice in a sieve and rinse under cold water. Spread the rice out on a rimmed baking sheet. Dry the rice in the oven, stirring occasionally, for 10 minutes. Scatter the butter evenly over the rice and continue to dry it, stirring every few minutes, for about 5 minutes longer. All excess moisture should have evaporated and the grains should be dry and separate.",
    "For the gravy:",
    "Put the 1 cup peas, 2 cups cooking liquid, and the butter in a blender and blend on high until smooth, about 3 minutes. Add cider vinegar to taste.",
    "(The gravy can be made up to 3 days ahead and kept in a covered container in the refrigerator; reheat, covered, over the lowest possible heat, stirring occasionally to prevent scorching.)",
    "To complete:",
    "Use a slotted spoon to transfer the peas to a large serving bowl. Add the rice and carefully toss the rice and peas together. Pour the gravy over them, sprinkle with chives or scallions, and serve."
  ],
  "ingredients": [
    "0",
    "Peas",
    "2 quarts Pork Stock or Chicken Stock",
    "1 cup Blackeye Peas, soaked in a pot of water in the refrigerator overnight",
    "1 1/2 cups medium dice onions",
    "1 cup medium dice peeled carrots",
    "1 1/2 cups medium dice celery",
    "2 garlic cloves, thinly sliced",
    "1 fresh bay leaf",
    "10 thyme sprigs",
    "1/2 jalapeño, chopped",
    "Kosher salt",
    "Rice",
    "4 cups water",
    "1 teaspoon kosher salt",
    "1/4 teaspoon cayenne pepper",
    "1 cup Anson Mills Carolina Gold Rice",
    "4 tablespoons unsalted butter, cubed",
    "Red Pea Gravy",
    "Reserved 1 cup cooked red peas",
    "Reserved 2 cups cooking liquid from the peas",
    "1 tablespoon unsalted butter",
    "Cider vinegar",
    "Sliced chives or scallions for garnish"
  ],
  "__v": 3
}