{
  "hash": "f20fabefa5259e8a1c56633c8cb235e1adfcf653",
  "title": "CAUSA (Serves 4)",
  "image": "http://perudelights.com/wp-content/uploads/2011/04/CAUSA-OSCURA.jpg",
  "href": "http://perudelights.com/causa/",
  "extension": "Chrome",
  "firstAdded": "2015-08-04T17:47:54.377000",
  "users": [
    null
  ],
  "keywords": [
    "floury",
    "potatoes",
    "yellow",
    "white",
    "hot",
    "peppers",
    "aji",
    "amarillo",
    "seeded",
    "chili",
    "oil",
    "juice",
    "limes",
    "salt",
    "eggs",
    "ears",
    "giant",
    "kernel",
    "cob",
    "use",
    "regular",
    "corn",
    "sugar",
    "tuna",
    "mayonnaise",
    "avocado",
    "pepper",
    "black",
    "olives",
    "tomato",
    "parsley"
  ],
  "directions": [
    "0",
    "* Place the yellow hot peppers in a pan of cold water, bring to a boil and cook for 15-20 minutes. Strain, peel and process in the blender with 1 -2 tablespoons of water until creamy. Reserve.",
    "*In another pan cook the eggs in boiling water for 8-10 minutes. Transfer to a bowl with cold water. Peel and reserve.",
    "*In a saucepan over high heat cook the corn in water with 1 tablespoon sugar for 10 minutes. It isn´t necessary to cover the pan. When ready, turn off the heat and reserve the corn in the same water.",
    "*Scrub the potatoes and cook in a pan of boiling water for 20 minutes or until soft but not mushy. Strain. Peel them while hot and mash them immediately or put them through a ricer.",
    "*Add the blended yellow peppers or paste, vegetable oil, lime juice and salt to the mashed potatoes. Mix well and keep tasting them and adding more of any of the above ingredients if needed, till the result is tasty enough for you. Reserve.",
    "*In a bowl combine tuna with mayonnaise. Slice the avocado.",
    "*Lightly oil a large container (we use round or loaf pans, or pastry rings). Line the base with a layer of the potato. Cover with the tuna mixture and then with avocado slices, salt and pepper. Add another layer of potatoes on top. Chill in the refrigerator.",
    "*Prior to serving, decorate with hard boiled eggs, black olives, parsley, tomato and corn. (You can choose any mix of these ingredients, or get creative and add your own!). Serve cold."
  ],
  "ingredients": [
    "0",
    "6 floury potatoes (yellow or white)",
    "6 yellow hot peppers (aji amarillo) seeded and deveined (or 2 tablespoons of yellow chili paste)",
    "¼ cup vegetable oil",
    "Juice of 3 limes",
    "Salt",
    "4 eggs",
    "2 ears giant kernel corn on the cob (or use regular white corn)",
    "1 tablespoon sugar",
    "1 tuna can",
    "3/4 cup mayonnaise",
    "1 avocado",
    "Salt and pepper",
    "6 black olives, sliced",
    "1 tomato, seeded and diced",
    "Parsley"
  ],
  "__v": 1
}