{
  "__v": 1,
  "directions": [
    "0",
    "Prepare grill for indirect grilling. If using a gas grill, heat one side to medium-high and leave one side with no heat. If using a charcoal grill, arrange hot coals on either side of charcoal grate, leaving an empty space in the middle.",
    "Combine mango jam, chives, vinegar, and Sriracha, stirring until smooth. Reserve 1/4 cup mango mixture; set aside.",
    "Brush oil evenly over chicken. Sprinkle chicken with salt and pepper.",
    "Carefully remove grill rack. Place a disposable aluminum foil pan on unheated part of grill. Carefully return grill rack to grill. Place chicken on grill rack over unheated part. Brush chicken with about 2 tablespoons remaining mango mixture. Close lid; grill 90 minutes or until a thermometer inserted into meaty part of thigh registers 165°, turning chicken and brushing with about 2 tablespoons mango mixture every 20 minutes. Transfer the chicken to a platter. Drizzle chicken with reserved 1/4 cup mango mixture.",
    "Wine note: This dish's tropical fruit flavors and spicy heat are ideal for gewürztraminer, a popular grape of Germany and France. The mango and apricot flavors of the highly aromatic Hugel gewürztraminer 2006 ($20) echo those of the glaze, while a slightly sweet lychee nut character helps to balance the heat. —Jeffery Lindenmuth"
  ],
  "firstAdded": "2014-07-22T01:47:38.038000",
  "hash": "454e4924a411b117b9414d9b2b53d9f5f833a85d",
  "href": "http://www.myrecipes.com/recipe/grilled-chicken-with-sriracha-glaze-10000001809129/",
  "image": "http://img4-1.myrecipes.timeinc.net/i/recipes/ck/08/06/grilled-chicken-ck-1809129-l.jpg",
  "ingredients": [
    "0",
    "2/3 cup mango jam",
    "2 tablespoons finely chopped fresh chives",
    "2 tablespoons rice vinegar",
    "2 tablespoons Sriracha (hot chile sauce, such as Huy Fong)",
    "1 tablespoon olive oil $Click to see savings",
    "4 (12-ounce) bone-in chicken leg-thigh quarters, skinned $Click to see savings",
    "1/2 teaspoon kosher salt",
    "1/4 teaspoon freshly ground black pepper"
  ],
  "keywords": [
    "mango",
    "jam",
    "chives",
    "rice",
    "vinegar",
    "sriracha",
    "hot",
    "chile",
    "huy",
    "fong",
    "olive",
    "oil",
    "click",
    "savings",
    "bonein",
    "chicken",
    "legthigh",
    "quarters",
    "skinned",
    "kosher",
    "salt",
    "black",
    "pepper"
  ],
  "title": "Grilled Chicken with Sriracha Glaze",
  "users": [
    null
  ]
}