{
  "hash": "9f1f0c563030890bb59e997155905284bcdbe216",
  "title": "Oyster Dressing",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2013/10/4/1/FNM_110113-Oyster-Dressing-Recipe_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/alton-brown/oyster-dressing.html",
  "extension": "Chrome",
  "firstAdded": "2016-09-26T14:39:58.744000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "The day before making the stuffing, bake the cornbread: Preheat the oven to 425 degrees F and place a 10-inch cast-iron skillet in the oven. In a bowl, combine the cornmeal, salt, sugar, baking powder and baking soda. Whisk to combine well. In a large bowl, combine the buttermilk, eggs and creamed corn, whisking to combine thoroughly. Add the dry ingredients to the buttermilk mixture and stir to combine. If the batter will not pour, add more buttermilk.",
    "Swirl the vegetable oil in the hot cast-iron skillet. Pour the batter into the skillet and bake until the cornbread is golden brown and springs back upon the touch, about 20 minutes. Let cool in the skillet, then crumble 6 cups of the cornbread and spread out on a baking sheet. Let the cornbread dry out at room temperature, uncovered, about 24 hours.",
    "Make the stuffing: Preheat the oven to 350 degrees F. Heat the vegetable oil in a 12-inch cast-iron skillet over medium-high heat. Add the onion, celery, salt and pepper. Cook, stirring frequently, until the onion and celery are semitranslucent, about 15 minutes. Remove the skillet from the heat; add the crumbled cornbread, oyster crackers, thyme and sage and stir well. Next, add the oysters with their liquor and the eggs; stir until combined. Pat the mixture down into an even layer.",
    "Put the skillet on the middle rack of the oven and bake until golden brown and crisp around the edges, about 30 to 35 minutes.",
    "Recipe courtesy of Alton Brown for Food Network Magazine"
  ],
  "ingredients": [
    "0",
    "2 cups yellow cornmeal",
    "1 teaspoon kosher salt",
    "1 tablespoon sugar",
    "2 teaspoons baking powder",
    "1/2 teaspoon baking soda",
    "1 cup buttermilk, plus more if needed",
    "2 eggs",
    "1 cup canned creamed corn",
    "2 tablespoons vegetable oil",
    "1/4 cup vegetable oil",
    "1 large onion, chopped",
    "4 stalks celery, chopped",
    "1/2 teaspoon kosher salt",
    "1/4 teaspoon freshly ground pepper",
    "5 ounces oyster crackers, crushed",
    "1 1/2 teaspoons dried thyme",
    "1 teaspoon dried sage",
    "1 pint small oysters with liquor",
    "2 large eggs, lightly beaten"
  ],
  "__v": 2
}