{
  "hash": "1e64d777e226e0231ebec4cd4caa93d90b11e6f2",
  "title": "Beet and Quinoa Veggie Burgers [Vegan, Gluten-Free]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/05/beet.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/beet-and-quinoa-veggie-burgers/",
  "extension": "",
  "firstAdded": "2015-05-09T10:05:35.896000",
  "users": [
    null
  ],
  "keywords": [
    "eggplant",
    "baba",
    "ganoush",
    "flaxseed",
    "meal",
    "divided",
    "needed",
    "water",
    "medium",
    "beets",
    "quinoa",
    "glutenfree",
    "rolled",
    "oats",
    "garlic",
    "hummus",
    "salt",
    "pepper",
    "oil",
    "cooking",
    "buns",
    "lettucekale"
  ],
  "directions": [
    "0",
    "If using fresh eggplant, add to a steaming basket and steam until fork tender, about 5 minutes. Transfer to a food processor and process on high until smooth. Transfer to a mixing bowl and set aside. If using baba ganoush, simply skip this step.",
    "In a small bowl, add remaining 2 tablespoons of flaxseed meal and water. Quickly stir and set aside.",
    "Add beets, quinoa, oats, 3 tablespoons of flaxseed meal and garlic into a large mixing bowl (or directly into the bowl of a food processor) and mix to combine. Transfer to a food processor and pulse to combine the ingredients. Transfer back to the bowl.",
    "Add flax eggs (flax and water mixture) along with the pureed eggplant and hummus into the bowl. Mix until the dough comes together and you can shape it into patties. Season with salt and pepper. [note: if it seems too wet, let it sit for 10 - 15 minutes until you add more flax to let the oats and flax soak up some of the liquid. You want to be able to shape them into patties]",
    "Once ready, line a baking sheet with parchment paper and shape the dough into 8 patties. Transfer baking sheet to the fridge and let chill for at least 60 minutes and up to overnight.",
    "To cook the burgers, heat up a little oil in a large skillet over medium heat (I think coconut oil would be really good here). Once hot, sear the burgers until brown on either side, about 3 – 4 minutes. Transfer to a wire rack and repeat until all burgers are done.",
    "Serve them with your gluten-free buns and top them with greens and a smear of hummus. Enjoy!"
  ],
  "ingredients": [
    "0",
    "1 1/2 cups chopped eggplant (or 1/2 cup baba ganoush)",
    "5 tablespoons flaxseed meal, divided (+ more as needed)",
    "6 tablespoons warm water",
    "4 cups shredded beets (about 3 medium beets)",
    "1 cup cooked quinoa",
    "1 cup gluten-free rolled oats",
    "2 garlic cloves, minced",
    "1/2 cup hummus",
    "Salt + pepper to taste",
    "Oil for cooking",
    "For serving: gluten-free buns, lettuce/kale, hummus"
  ],
  "__v": 1
}