{
  "hash": "d290cb78ae386229abfd707c45e8cce20e2fed98",
  "title": "Serbian White Bean Soup Recipe - Pasulj",
  "image": "https://www.thespruceeats.com/thmb/3ebF1nJwcwAQNF7ocoLAQankpvI=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/GettyImages-154534603-5821fd9d3df78cc2e82b4ed9.jpg",
  "href": "https://www.thespruceeats.com/serbian-white-bean-soup-recipe-pasulj-1135882",
  "extension": "Chrome",
  "firstAdded": "2018-12-11T13:37:25.459000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Steps to Make It",
    "In a large soup pot, place beans, water, and ham. Bring to a boil, stirring occasionally so beans don't stick, and skimming off any foam that rises to the surface. Add salt and pepper to taste. Lower temperature and simmer 1 hour.",
    "Add vegetables, bring back to the boil, reduce heat and continue to simmer for 1 more hour. Remove the meat from the ham hock or ham bone and return to soup.",
    "If the soup isn't thick enough, you can add an optional zafrig or thickener. In a small saucepan, add oil and flour and cook until light brown. Add paprika off heat, stirring well. Return to low heat and add 1 cup bean soup, mixing well. Pour back into the soup pot and simmer 5 minutes or until soup is thickened to your liking.",
    "Serve in heated bowls garnished with chopped parsley if desired. Tastes even better the next day!"
  ],
  "ingredients": [
    "0",
    "For the Soup:",
    "1/2 pound tetovac beans or Great Northern beans, rinsed",
    "16 cups cold water",
    "1 1/2 pounds ham hock or ham bone or use shortcut above",
    "Salt and pepper to taste",
    "3 carrots, peeled and sliced or medium chopped",
    "3 medium red potatoes, peeled and cut into medium pieces",
    "2 ribs celery, medium chopped",
    "1 medium onion, medium chopped",
    "1 garlic clove, finely chopped",
    "For ​the Zafrig (Thickener):",
    "4 tablespoons oil",
    "4 tablespoons all-purpose flour",
    "1 tablespoon sweet or hot paprika"
  ],
  "__v": 1
}