{
  "hash": "139cf43181bb4b6f149e71dc10bd8cead6e33a79",
  "title": "Chicken Piccatta",
  "image": "https://lh5.googleusercontent.com/-zVxB585eb7g/Tw9z94uG08I/AAAAAAAAFhA/fJzxiNnrpsc/w640-h480-k/Chicken%2BPiccatta%2Bangle.jpg",
  "href": "https://www.budgetbytes.com/2012/01/chicken-piccatta/",
  "extension": "",
  "firstAdded": "2017-03-01T05:29:26.097000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare the ingredients so they’re ready to go when you need them: Roughly chop the parsley leaves, juice the lemon, mince the garlic, and combine the chicken base with ½ cup of hot water to dissolve. Set these ingredients aside.",
    "Trim the chicken breasts of excess fat. Cover them with plastic wrap and pound them with a mallet or rolling pin until they are an even thickness (about ¾ inch). Cut each chicken breast in half so that you have six pieces about the size of the palm of your hand. Season both sides with salt and pepper.",
    "Heat the olive oil in a heavy skillet, over medium heat. While the oil is heating, place the flour in a bowl and lightly coat each piece of chicken on both sides. When the oil is very hot but not smoking, add three pieces of chicken to the skillet and cook until brown on each side (about 3-5 minutes on each side). Place the cooked chicken on a clean plate and cook the second batch of chicken.",
    "After the chicken is cooked, turn the heat down slightly (medium-low) and add the butter and minced garlic. Stir and cook for about one minute. Add the chicken broth and lemon juice and whisk to dissolve (or “deglaze”) the brown bits off of the bottom of the pan.",
    "Add the capers and chopped parsley to the pan. Increase the heat to medium and add the chicken back to the skillet. Spoon the sauce over top of the chicken and allow to simmer in the sauce for 3-5 minutes. The flour on the chicken will help thicken the sauce as it simmers. Serve hot and garnish with any leftover parsley."
  ],
  "ingredients": [
    "0",
    "3 medium chicken breasts $4.99",
    "1 medium lemon $0.69",
    "¼ bunch Italian parsley $0.20",
    "3 cloves garlic $0.20",
    "½ tsp chicken base (or ½ cup broth) $0.07",
    "a pinch salt & pepper $0.05",
    "½ cup flour $0.10",
    "2 Tbsp olive oil $0.22",
    "2 Tbsp butter $0.24",
    "1 Tbsp capers $0.40"
  ],
  "__v": 1
}