{
  "hash": "888528f9880a7059d177900079a8d26acb8b8367",
  "title": "Charred Beef Steak and Veggies with Orzo Pasta",
  "image": "https://www.mushrooms.ca/wp-content/uploads/2016/05/orzo.jpg",
  "href": "https://www.mushrooms.ca/portfolio/charred-beef-steak-and-veggies-with-orzo-pasta/",
  "extension": "Chrome",
  "firstAdded": "2019-07-31T02:52:10.386000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Whisk together chicken broth, honey, olive oil and Italian seasoning in bowl. Season with generous pinch of each salt and pepper.",
    "On large rimmed parchment paper-lined baking sheet, toss red peppers, mushrooms and zucchini with half the broth mixture. Set remaining broth mixture aside.",
    "Season beef with remaining salt and pepper; place on top of vegetables. Place under broiler about 3 inches (8 cm) from heat; broil until lightly charred, about 7 minutes. Remove from oven; toss vegetables and turn beef over. Return to oven and broil for 7 minutes. Remove steak and let rest. Stir corn into vegetables; broil until vegetables are charred and softened, about 5 minutes.",
    "Meanwhile, cook orzo according to package directions; drain and toss with remaining broth mixture, green onions, sun-dried tomatoes and Parmesan cheese. Spoon onto warm deep platter; top with charred mixed veggies. Thinly slice beef across the grain and arrange over veggies. BRIGHT IDEA: This recipe uses the oven broiler, to sear thick-cut steak and colourful veggies to perfection – all at the same time, in just one pan."
  ],
  "ingredients": [
    "0",
    "1/2 cup sodium-reduced chicken broth 125 mL",
    "1/4 cup liquid honey 50 mL",
    "2 tbsp olive oil 30 mL",
    "1/2 tsp EACH dried Italian herb seasoning, 2 mL",
    "salt and pepper",
    "2 sweet red peppers cut into chunks 2",
    "2 cups mushrooms, halved 500 mL",
    "1 small zucchini, thinly sliced 1",
    "1 lb. Beef Top Sirloin Grilling Steak, 500 g (about 1-inch (2.5 cm) thick)",
    "1 cup frozen corn kernels 250 mL",
    "1½ cups dried orzo pasta 375 mL",
    "2 green onions, thinly sliced 2",
    "1/2 cup thinly sliced oil-packed sun-dried tomatoes 125 mL",
    "1/4 cup grated Parmesan cheese 50 mL"
  ],
  "__v": 2
}