{
  "hash": "9fb76501e7c8b2916c99cd10345ce0a49a59953d",
  "title": "Calzone po bieszczadzku czyli pierogi ala kebab",
  "image": "//static.smaker.pl/photos//c/2/8/c28e74db62f226d76ae2a4b91bbc3292_367253_576be7774e0fd_wm.jpg",
  "href": "http://smaker.pl/przepis-calzone-po-bieszczadzku-czyli-pierogi-ala-kebab,118330,alexandra89.html",
  "extension": "",
  "firstAdded": "2016-09-16T22:16:43.066000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "CIASTO:",
    "1kg mąki pszennej",
    "10 dkg drożdży",
    "1/3 kostki masła",
    "2 żółtka",
    "1 jajko",
    "1/2 l ciepłego mleka",
    "1 łyżeczka soli",
    "1 łyżka oregano",
    "FARSZ:",
    "1 por - pokroić w cienkie plasterki i usmażyć",
    "2 cebule - pokroić w kosteczkę i usmażyć",
    "2-3 papryki - pokroić w kostkę i usmażyć( jeśli ktoś nie przepada, można nie dodawać)",
    "80 dkg pieczarek - pokroić w plasterki i usmażyć",
    "1kg piersi z kurczaka - pokroić w kostkę, obtoczyć w przyprawie gyros i usmażyć",
    "25 -30 dag żółtego sera - zetrzeć na grubić oczkach",
    "8wszystkie składniki smażyć osobno, następnie połączyć, dodać łyżkę oregano (ważne, bo nadaje odpowiedniego smaku) i wsypać starty ser. Wymieszać i odczekać aż wystygnie.",
    "CIASTO WYKONANIE:",
    "Z drożdży, 1 szkl ciepłego mleka, łyżeczki cukru i mąki (dodać tyle, żeby powstała papka) zarobić rozczyn i zostawić do wyrośnięcia. Po wyrośnięciu połączyć z resztą składników, wyrobić gładkie, elastyczne ciasto i ponownie odstawić do wyrośnięcia. Kiedy ciasto wyrośnie, przełożyć je na stolnicę i rozwałkować na grubość ok 0,5 cm. Wykrawać koła o średnicy ok 8-10cm (mają być sporej wielkości) .Następnie nakładać farsz i lepić jak pierogi (brzegi dość mocno sciskać, żeby podczas pieczenia się nie rozkleiły i farsz nie wypłynął).Posmarować żółtkiem i piec 15-20 min w 180*",
    "SOS:",
    "1/2 szkl śmietany, 4 łyżki majonezu, 3 łyżki ketchupu, 3 ząbki czosnku przeciśniętego przez praskę (czosnek można pominąć, jeśli ktoś nie lubi). Wszystko razem połączyć. Podawać z pierożkami."
  ],
  "ingredients": [
    "0",
    "CIASTO: 1kg mąki pszennej 10 dkg drożdży 1/3 kostki masła 2 żółtka 1 jajko 1/2 l ciepłego mleka 1 łyżeczka soli",
    "1 por - pokroić w cienkie plasterki i usmażyć 2 cebule - pokroić w kosteczkę i usmażyć 2-3 papryki - pokroić w kostkę i usma",
    "SOS: 1/2 szkl śmietany, 4 łyżki majonezu, 3 łyżki ketchupu, 3 ząbki czosnku przeciśniętego przez praskę"
  ],
  "__v": 1
}