{
  "hash": "f2ab591cdbf6baaacd8892f9378be0710c704a1b",
  "title": "Grilled Fish Tacos with Lime Cabbage Slaw",
  "image": "http://www.cookingclassy.com/wp-content/uploads/2015/02/grilled-fish-tacos-crop.jpg",
  "href": "http://www.cookingclassy.com/2015/02/grilled-fish-tacos-with-lime-cabbage-slaw/",
  "extension": "Chrome",
  "firstAdded": "2016-08-11T15:52:51.400000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a mixing bowl whisk together canola oil, lime juice, garlic, chili powder, cumin, paprika, cayenne and season with salt and pepper to taste (about 1/2 tsp salt 1/4 tsp pepper). Place fish into a gallon size resealable bag and pour marinade over fish. Seal bag (move bag around to evenly coat fish with marinade) and allow to marinate in mixture 20 minutes (and no longer than 30 minutes).",
    "Preheat a grill to medium-high heat. Brush grill grates with oil and place fish on grill. Grill until cooked through, about 3 minutes per side (cook time will vary based on thickness of fish). Transfer to a plate, break into pieces and serve in warmed taco shells with cabbage slaw, avocado slices and other optional toppings.",
    "For the red cabbage slaw:",
    "Add cabbage, red onion and cilantro to a medium mixing bowl. Pour lime juice and canola oil over top and season lightly with salt and pepper. Toss to evenly coat.",
    "Recipe source: inspired by Chow"
  ],
  "ingredients": [
    "0",
    "Tacos",
    "1 lb Tilapia, cod or mahi mahi fillets",
    "2 Tbsp canola oil",
    "1 1/2 Tbsp fresh lime juice",
    "1 clove garlic, minced",
    "1 1/2 tsp chili powder",
    "1/2 tsp ground cumin",
    "1/2 tsp ground paprika",
    "1/8 tsp cayenne pepper (optional)",
    "Salt and pepper",
    "6 corn or flour tortillas",
    "1 large hass avocado, sliced",
    "Sour cream, cotija cheese, hot sauce or salsa, for serving (optional)",
    "1/2 small red cabbage, cored and sliced thin (8 oz)",
    "1/4 cup cilantro, chopped",
    "3/4 cup thinly sliced red onion (run under cool water and drain to remove harsh bite. 1/2 small red onion)",
    "1 1/2 Tbsp lime juice",
    "1 Tbsp canola oil"
  ],
  "__v": 1
}