{
  "hash": "a0ac20b15a32acf91a7756679691ff030484d7a6",
  "title": "Soufflé di Formaggio, Miele e Noci (Souffle with Cheese, Honey and Walnuts)",
  "image": "https://ouritaliantable.com/wp-content/uploads/2014/03/Souffle-Formiaggio2-1-of-1.jpg",
  "href": "https://ouritaliantable.com/food-karma-souffle-di-formaggio-miele-e-noci-souffle-cheese-honey-walnuts/",
  "extension": "Chrome",
  "firstAdded": "2019-09-01T13:09:49.843000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Butter the inside of individual 4 to 6 ounce ramekins or a 2 ½-quart soufflé dish. Dust the inside with a bit of grated Parmigiano cheese.",
    "Preheat the oven to 375 degrees Fahrenheit.",
    "In a medium saucepan, melt the 3 tablespoons of butter over medium low heat. Add in the flour and whisk until blended with the melted butter. Cook for about a minute. Whisk in the milk until the mixture becomes thick and smooth, about 2 minutes. Whisk in the nutmeg.",
    "Remove the pan from the heat. Whisk in the egg yolks, one at a time. Stir in the Asiago and Fontina until melted. Season with a bit of salt and a couple of turns of freshly ground pepper. Let the mixture cool.",
    "Clean and dry a large mixing bowl and its beaters. Beat the egg whites in the bowl on medium speed until foamy. Add a pinch of salt and beat until shiny and stiff but not dry. Try not to overbeat. Using a spatula, fold about one-third of the egg whites into the egg-yolk mixture. Lightly fold in the remaining whites until just incorporated. Do not over mix – it is ok for the batter to be streaky.",
    "Spoon the batter into the prepared dish(es). Bake until puffed and firm to the touch – about 15 minutes for the individual soufflés and about 35 minutes for the single soufflé. (RESIST the temptation to open that oven door!! The cool air will wreak havoc on your rising soufflé!)",
    "Drizzle with yummy chestnut honey and sprinkle with the chopped walnuts. Serve immediately!"
  ],
  "ingredients": [
    "0",
    "or the ramekins:",
    "Unsalted butter, softened",
    "Grated Parmigiano-Reggiano",
    "For the soufflé:",
    "3 tablespoons unsalted butter, softened",
    "3 tablespoons flour",
    "1 cup whole milk",
    "Pinch grated nutmeg",
    "4 egg yolks",
    "½ cup Asiago, grated",
    "¾ cup Fontina, grated",
    "Salt",
    "Freshly ground black pepper",
    "6 egg yolks",
    "Chestnut honey",
    "Walnuts, chopped"
  ],
  "__v": 1
}