{
  "__v": 1,
  "directions": [
    "0",
    "Preheat the oven with the rack in the middle to 325 degrees. Wrap the tea leaves in cheese cloth.",
    "Pour the cream into a small pot and heat over medium high heat, stirring occasionally, until scalding– just when the edge starts to bubble. Remove from the heat and steep tea for about 5 minutes. Meanwhile, mix the egg yolks and the sugar and whisk vigorously until thickened. I like to do this in a large spouted bowl because it is easier to later pour into ramekins or tea cups.",
    "Using the back of a spoon, gently squeeze the satchel of tea against the edge of the pot to extract more tea flavor. Let the cream cool a bit, and then slowly pour the cream into the egg mixture while whisking constantly until you have a thickened custard.",
    "Line a baking dish with a kitchen towel and place your ramekins or tea cups inside. Here, I had to use a deeper baking dish since my tea cups are taller than a normal ramekin. Pour an even amount of the custard in each cup through a fine-mesh sieve.",
    "Then skim the tops of the custard with a spoon, removing any bubbles.",
    "Pour hot water into the baking dish until it reaches about halfway up the tea cup. Tent the baking dish with foil and place in the oven. Bake for about 20-25 minutes, or until the center jiggles slightly when you shake the cup. Mine took an extra 15 minutes in the oven because my cups were pretty deep.",
    "Let the custard cool and then wrap each tea cup tightly with plastic wrap and place in the refrigerator for at least 3 hours up to overnight. When your creme brulees are ready for torching, lightly pat the tops of the brulees with a paper towel to remove excess moisture. Moisture can prevent the sugar from hardening.",
    "Evenly sprinkle a small spoonful of sugar across the custard.",
    "And then comes the fun part. Using a kitchen torch, caramelize the sugar. Alternatively, you can place them under the broiler, about 4 inches away from the heat, for a couple minutes. Keep an eye on the heat because sugar can burn quickly!",
    "When the sugar cools down it will harden into a glassy caramelized layer of sugar.",
    "Crack the top with a spoon . . ."
  ],
  "firstAdded": "2014-08-14T17:26:19.980000",
  "hash": "5722097f12f2e5090cbce020bdd9d00ea44c080c",
  "href": "http://honestlyyum.com/1569/earl-grey-creme-brulee/",
  "image": "http://cdn.honestlyyum.com/wp-content/uploads/2013/03/Creme-Brulee-End-HonestlyYum.jpg",
  "ingredients": [
    "0",
    "2 cups of heavy cream",
    "6 egg yolks",
    "3 heaping teaspoons of loose Earl Grey tea leaves, or about 2 teabags (tea bags vary in size, so check the measurements on the box)",
    "4 tablespoons of granulated sugar, plus more for caramelized sugar",
    "pinch of kosher or sea salt"
  ],
  "keywords": [
    "cream",
    "egg",
    "yolks",
    "heaping",
    "loose",
    "earl",
    "grey",
    "leaves",
    "teabags",
    "tea",
    "vary",
    "size",
    "check",
    "measurements",
    "box",
    "granulated",
    "caramelized",
    "sugar",
    "kosher",
    "salt"
  ],
  "title": "Crème brûlée",
  "users": [
    null
  ]
}