{
  "hash": "8b51f6457c15bc01d33f4dc2e38d257143105e43",
  "title": "Zucchini Quinoa Burgers",
  "image": "//images.food52.com/ZqeMj1DCUqdpIKYbn4-B0xaJtUU=/753x502/998f7343-cca0-42e5-8c99-0a764ebaa3a9.025_food52120707_2L0A2126_025.jpg",
  "href": "http://food52.com/recipes/18585-zucchini-quinoa-burgers",
  "extension": "Chrome",
  "firstAdded": "2015-06-22T06:16:43.497000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "divided",
    "clove",
    "garlic",
    "onion",
    "zucchini",
    "julienned",
    "mandolin",
    "largest",
    "setting",
    "box",
    "grater",
    "pumpkin",
    "seeds",
    "raw",
    "salt",
    "black",
    "pepper",
    "chickpeas",
    "heaping",
    "dry",
    "quinoa",
    "water",
    "dijon",
    "mustard",
    "lemon",
    "juice",
    "dill",
    "oregano",
    "paprika"
  ],
  "directions": [
    "0",
    "To prepare chickpeas, soak beans overnight. In the morning, rinse them and discard soak water. Place beans in a pot with enough water to submerge them by several inches. Heat to a boil, reduce to a simmer, and cook for 45 min to an hour, or until beans are tender. Drain and store in the fridge for up to three days.",
    "To prepare quinoa, rinse quinoa in a sieve. Add to a small pot and add 2/3 cups water and a pinch of salt. Bring to a boil and reduce to a simmer. Cook, with a lid slightly ajar on the pot, until the water is absorbed and you can see the thin “ribs” of the quinoa becoming detached from the grain. Fluff, cover, and let sit for a few moments. Store in the fridge for up to three or four days.",
    "Heat 1 tbsp olive oil in a medium sauce pan. Saute onion and garlic until tender. Add zucchini, and continue to saute until zucchini is cooked through and onion is translucent. Season to taste with salt and pepper. Set aside.",
    "Grind pumpkin seeds, sea salt, and pepper in a food processor till they’re broken into a fine meal.",
    "Add quinoa, chickpeas, the dijon mustard, lemon, dill, paprika, and oregano to the mixture. Pulse to combine a few times. Then, run the motor to continue mixing the mixture. You may need to stop it a few times so that you can scrape the sides of the processor and start the motor again. You want the beans to be broken down and for the mixture to hold together well, but you don’t want to process so extensively that the mix has no more texture. If you need to add a little water to the mixture, that’s totally OK.",
    "Transfer the mixture to a mixing bowl and add the zucchini, onion, and garlic. Mix with hands (as if you were making meatloaf). When everything is incorporated, season once more with salt and pepper, to taste.",
    "Shape mixture into six patties with hands. Heat remaining 1 tbsp olive oil in a sautee pan on medium heat. Cook burgers for five minutes on each side, or until golden brown. Alternately, you can bake them at an oven set to 375 degrees for twenty-five minutes, flipping once halfway through. Serve."
  ],
  "ingredients": [
    "0",
    "2 tablespoons olive oil, divided",
    "1 clove garlic, minced",
    "1 cup onion, chopped finely",
    "1 1/2 cups zucchini, julienned on a mandolin or grated on the largest setting of a box grater",
    "1/2 cup pumpkin seeds, raw or toasted",
    "3/4 teaspoon sea salt, plus more to taste",
    "Black pepper to taste",
    "1 1/2 cups cooked chickpeas (1/2 heaping cup dry)",
    "1 cup cooked quinoa (1/3 cup dry)",
    "2/3 cup water",
    "2 tablespoons dijon mustard",
    "1 tablespoon lemon juice",
    "2 tablespoons fresh dill, chopped",
    "1 tablespoon fresh oregano, chopped",
    "1 teaspoon paprika"
  ],
  "__v": 1
}