{
  "hash": "a5363b91f31b96ab39f87546a4b1dda260e30dfa",
  "title": "LEMON ROASTED CHICKEN",
  "image": "",
  "href": "http://lidiasitaly.com/recipes/lemon-roasted-chicken/",
  "extension": "Chrome",
  "firstAdded": "2018-02-28T16:28:20.498000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 375 degrees. Gently slide your fingers under the skin of the chicken breast to loosen it. Spread the grated lemon zest under the breast skin. Season the chicken with 1 teaspoon of the salt, and rub it all over with 1 tablespoon of the olive oil.",
    "Set the onions and lemon quarters in a roasting pan, and toss with the remaining ½ teaspoon salt and 2 tablespoons olive oil. Stuff some of the lemon quarters in the chicken cavity, along with the rosemary. Set the chicken, breast side up, on the onions and lemons. With a paring knife, cut a small slit in the skin at the tip of the breast. Stick the drumsticks in the opposite sides’ slits, to keep the chicken together and hold its shape while roasting.",
    "Pour the white wine into the pan, and roast the chicken, basting once or twice with the pan juices, until the meat between the thigh and breast reaches 165 on an instant-read thermometer and the skin is crispy and golden, about 1 hour and 20 minutes. Remove the chicken to a cutting board, and let it rest 10 minutes.",
    "Fish out the onions from the pan, and set it in a sauté pan large enough to hold the chicken as well when it is cut into pieces. Strain the pan juices, pushing on the solids to extract all of the sauce, let the juices rest, then skim off any excess fat.",
    "Carve the chicken into serving pieces, and return to the pan with the onions. Add the strained sauce, bring all to a boil, and serve."
  ],
  "ingredients": [
    "0",
    "5-pound roasting chicken",
    "2 lemons, zested and cut into quarters",
    "1 ½ teaspoons kosher salt",
    "3 tablespoons extra-virgin olive oil",
    "3 medium onions, peeled, cut in sixths but left attached at the root end",
    "2 sprigs fresh rosemary",
    "1 cup dry white wine"
  ],
  "__v": 1
}