{
  "hash": "f2f7680314a88a705704a95dfea7b75825813002",
  "title": "Oven Fried Chicken + Broccoli with Honey Garlic Sauce",
  "image": "http://i0.wp.com/cafedelites.com/wp-content/uploads/2016/05/Oven-Fried-Chicken-16.jpg?resize=700%2C1050",
  "href": "http://cafedelites.com/2016/05/06/oven-fried-chicken-with-broccoli-honey-garlic-sauce/",
  "extension": "Chrome",
  "firstAdded": "2016-05-25T12:05:32.055000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 200°C | 390°F. Line a baking sheet with baking / parchment paper or spray a nonstick tray with cooking oil spray; set aside.",
    "Add the broccoli to a bowl with the oil, garlic, salt and pepper, mix to combine. Set aside.",
    "Season chicken with salt and pepper. Set up a work station with 3 shallow bowls. To one bowl, add the flour and set aside. In the second bowl, whisk together eggs, milk, garlic powder, the ¾ teaspoon of salt and paprika. In the third bowl, mix the Panko with the vegetable oil (I find it easier to use my hands).",
    "Working one by one, evenly coat the chicken in the flour, then dip into the egg mixture, then dredge in the Panko mixture, pressing to coat. Place onto prepared baking sheet and repeat with remaining chicken thighs.",
    "Lightly spray each chicken thigh over the top with cooking oil spray (this is optional, but I have found it to crisp the chicken even more). Bake for 25 minutes, remove from the oven and arrange the broccoli next to or around the chicken, and place back into the oven to cook for a further 20 minutes, or until the chicken is cooked through; the crust is crispy and golden brown, and the broccoli is tender-crisp (Note: flip the broccoli after around 10 minutes if you find the tops charring).",
    "While the chicken is in the oven, prepare the Honey Garlic Sauce: In a small saucepan, combine honey soy sauce, vinegar (if using) and garlic. Bring to a simmer over medium heat, and quickly reduce heat to low. Pour the prepared cornstarch mixture into the saucepan and stir through until sauce thickens (about 2 minutes). Set aside and allow to cool.",
    "Garnish chicken with parsley and serve immediately with the honey garlic sauce."
  ],
  "ingredients": [
    "0",
    "2 broccoli heads, washed and dried, cut into florets",
    "2 tablespoons extra-virgin olive oil",
    "2 teaspoons minced garlic",
    "Salt and pepper",
    "1",
    "6 skinless chicken thighs, bone in*",
    "Salt and pepper to season",
    "½ cup all-purpose flour",
    "1 large egg",
    "2 tablespoons milk",
    "1 teaspoon garlic powder",
    "¾ teaspoon salt (or to taste)",
    "1 teaspoon paprika (sweet or smoky)",
    "1¾ cups Panko breadcrumbs",
    "⅓ cup vegetable oil",
    "2 tablespoons chopped fresh parsley leaves, to serve",
    "2",
    "½ cup honey",
    "2 tablespoons soy sauce",
    "2 tablespoons rice wine vinegar (or white or apple cider) optional**",
    "1 tablespoon minced garlic",
    "2 teaspoons cornstarch mixed with 2 tablespoons water"
  ],
  "__v": 1
}