{
  "hash": "3f3baf9a4981d69f0d336045bb15ee508a79ca57",
  "title": "Salted Caramel Chocolate Chip Cookie Bars",
  "image": "http://cdn1.aspicyperspective.com/wp-content/uploads/2016/04/salted-caramel-chocolate-chip-cookie-bars-14-210x210.jpg",
  "href": "http://www.aspicyperspective.com/salted-caramel-chocolate-chip-cookie-bars/2",
  "extension": "Chrome",
  "firstAdded": "2016-09-08T14:23:42.097000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350 degrees F. Line a 9 X 13 inch baking dish with foil and liberally coat with nonstick cooking spray.",
    "In the bowl of an electric mixer, beat the softened butter with both sugars until light and fluffy, about 2 minutes. Add the eggs, vanilla, salt, and baking soda. Mix well, then scrape the sides of the bowl with a spatula.",
    "Turn the speed to low and add the flour. Beat to combine, then mix in the chocolate chips.",
    "Press half of the cookie dough into the bottom of the prepared baking dish.",
    "In a medium sauce pot, add the sweetened condensed milk and unwrapped caramels. Set over medium-low heat and stir until the caramels melt, making a smooth caramel filling. Pour the filling over the cookie dough base.",
    "Drop the remaining cookie dough over the caramel filling in small teaspoons-sized clumps. Bake the bars for 25-30 minutes, until the center is just set.",
    "Sprinkle with sea salt flakes and allow the bars to cool completely. Then lift the bars out of the pan by the edges of the foil and cut. Store in an airtight container at room temperature for up to 3 days."
  ],
  "ingredients": [
    "0",
    "1 cup unsalted butter, softened",
    "1 cup packed light brown sugar",
    "1/2 cup granulated sugar",
    "2 large eggs",
    "1 teaspoon vanilla extract",
    "1 teaspoon kosher salt",
    "1 teaspoon baking soda",
    "2 1/2 cups all purpose flour",
    "2 cups semisweet chocolate chips",
    "14 ounce can sweetened condensed milk",
    "10 ounces soft caramels, unwrapped",
    "1 teaspoon flaked sea salt"
  ],
  "__v": 1
}