{
  "hash": "534c6b86ced496f4a0fee1cd96e615b0844b10e4",
  "title": "Roasted Brussels Sprouts and Cinnamon Butternut Squash with Pecans and Cranberries",
  "image": "https://juliasalbum.com/wp-content/uploads/2015/10/22374902885_a4d2991d78.jpg",
  "href": "https://juliasalbum.com/wprm_print/9097?fbclid=IwAR1xfsKJgKgOU7C7hJDkOEd5msSOtiB_8nHQTt8MF4GnG24K4nea9pP98as",
  "extension": "Chrome",
  "firstAdded": "2019-11-11T17:14:56.878000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "How to roast Brussels Sprouts:",
    "Preheat oven to 400 F. Lightly grease the foil-lined baking sheet with 1 tablespoon of olive oil.",
    "Trim ends of Brussels sprouts and remove yellow leaves.",
    "Then, slice all Brussels sprouts in half.",
    "In a medium bowl, combine halved Brussels sprouts, 2 tablespoons of olive oil, salt (to taste), and toss to combine.",
    "Place onto a foil-lined baking sheet, cut side down, and roast in the oven at 400 F for about 20-25 minutes. During the last 5-10 minutes of roasting, turn them over for even browning, the cut sides should be nicely and partially charred but not blackened (see my photos).",
    "How to roast Butternut Squash:",
    "Preheat oven to 400 F. Lightly grease the foil-lined baking sheet with 1 tablespoon of olive oil.",
    "In a medium bowl, combine cubed butternut squash (peeled and seeded),1 tablespoon of olive oil, maple syrup, and cinnamon, and toss to mix.",
    "Place butternut squash in a single layer on the baking sheet. Bake for 20-25 minutes, turning once half-way through baking, until softened.",
    "Note: You can roast both Brussels sprouts and butternut squash on 2 separate baking sheets at the same time, on the same rack in the oven – that’s what I did.",
    "How to toast pecans:",
    "Toast pecans in the preheated oven at 350 F",
    "Line a baking sheet with parchment paper.",
    "Toast the pecans for about 5 minutes (maybe a bit longer) in the preheated oven at 350 F until they get darker in color.",
    "Note: pecans burn really fast, so make sure to check the nuts after 5 minutes and frequently afterwords.",
    "Assembly:",
    "In a large bowl, combine roasted Brussels sprouts, roasted butternut squash, pecans, and cranberries, and mix to combine.",
    "(OPTIONAL): For more sweetness, add 2 or 4 tablespoons of maple syrup, if desired – do not add all maple syrup at once, start with 2 tablespoons, then add more, if desired, and toss with the salad ingredients to combine."
  ],
  "ingredients": [
    "0",
    "Roasted Brussels Sprouts:",
    "3 cups Brussels sprouts ends trimmed, yellow leaves removed",
    "3 tablespoons olive oil",
    "1/4 teaspoon Salt to taste",
    "Roasted Butternut Squash:",
    "1 1/2 lb butternut squash peeled, seeded, and cubed into 1-inch cubes (Yields about 4 cups of uncooked cubed butternut squash)",
    "2 tablespoons olive oil",
    "3 tablespoons maple syrup",
    "½ teaspoon ground cinnamon",
    "Other Ingredients:",
    "2 cups pecan halves",
    "1 cup dried cranberries",
    "2-4 tablespoons maple syrup optional"
  ],
  "__v": 1
}