{
  "hash": "4f29a0e839f4822a0bfdd4e816157023e6746ddd",
  "title": "Mediterranean Leg of Lamb",
  "image": "http://www.recipes.co.nz/ic/4155010055/Mediterranean-Leg-of-Lamb.1.1.jpg",
  "href": "http://www.recipes.co.nz/shop/ROASTS/Mediterranean+Leg+of+Lamb.html",
  "extension": "Firefox",
  "firstAdded": "2016-02-07T00:21:59.360000",
  "users": [
    null
  ],
  "keywords": [
    "leg",
    "quality",
    "mark",
    "lamb",
    "garlic",
    "oregano",
    "marjoram",
    "leaves",
    "rosemary",
    "sundried",
    "tomato",
    "halves",
    "oil",
    "sugar",
    "white",
    "wine"
  ],
  "directions": [
    "0",
    "Method",
    "Turn the slow cooker on to low to pre-warm while preparing the ingredients.",
    "Use a sharp, long, thin-bladed knife to make 12-18 deep slits all over the lamb. Slice each garlic clove in three. Wrap a slice of garlic and a few leaves of oregano or marjoram and rosemary in a sundried tomato half and push into one of the deep cuts. Repeat with remaining ingredients.",
    "If wishing to brown the lamb: Heat a dash of oil in a frying-pan and brown the lamb well.",
    "Put the lamb into the slow cooker, sprinkle over the sugar and pour the wine around the meat. Cover with the lid and cook on low for 7-8 hours or high for 4-5 hours, until the lamb is well cooked.",
    "The lamb can be enjoyed at this time with the juices that have collected from the cooking. Or, you can finish the dish with the remaining ingredients as follows:",
    "Remove the lamb to a warm plate, cover and leave to rest. Add the tomatoes, chickpeas if using, olives, artichoke hearts and oregano. Cover and cook on high for 20-30 minutes. Season with salt and pepper.",
    "Transfer the lamb to a large meat platter and cover. Allow to rest for 20 minutes before carving. Sprinkle with flaky salt if wished."
  ],
  "ingredients": [
    "0",
    "1 full leg of Quality Mark lamb",
    "4-6 cloves garlic, crushed and peeled",
    "½ cup fresh oregano or marjoram leaves",
    "¼ cup fresh rosemary leaves",
    "12-18 sundried tomato halves in oil, well drained",
    "2 teaspoons sugar",
    "¼ cup white wine"
  ],
  "__v": 1
}