{
  "hash": "1d96377584b03bbf4424f6da046622b28d314c5f",
  "title": "QUINOA AND WHITE BEAN BURGER",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2013/12/Quinoa-White-Bean-Burger.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/quinoa-and-white-bean-burger/",
  "firstAdded": "2015-01-21T23:03:44.289000",
  "users": [
    null
  ],
  "keywords": [
    "quinoa",
    "used",
    "tricolor",
    "water",
    "garlic",
    "thyme",
    "divided",
    "oregano",
    "good",
    "smoked",
    "paprika",
    "chipotle",
    "pepper",
    "white",
    "beans",
    "cannellini",
    "rinsed",
    "frozen",
    "corn",
    "cob",
    "red",
    "bell",
    "shallot",
    "medium",
    "onion",
    "juice",
    "lemon",
    "oat",
    "flour",
    "egg",
    "replacer",
    "flaxegg",
    "flaxseed",
    "meal",
    "tbs",
    "mineral",
    "salt",
    "cracked",
    "coconut",
    "olive",
    "oil",
    "grease"
  ],
  "directions": [
    "0",
    "Start by making your flaxegg or ener-g egg replacer and set aside. If baking in the oven, turn oven to 375 degrees F. (It’s helpful to first read instructions first before making the patties)",
    "In a medium pot, bring water, quinoa, garlic powder and 1 teaspoon thyme to a boil. Cover, reduce heat and simmer for 15 minutes. Once done, remove cover and let set for 10 minutes.",
    "While quinoa is cooking, prepare your corn, shallot and red pepper. Be sure to dice your onion and red pepper fairly fine, they should be about the same size as the corn kernels.",
    "Next, mash your beans. I mashed about 3/4 of the beans leaving a quarter of the batch whole or somewhat whole.",
    "Once quinoa is ready, add the quinoa to the beans along with the shallots, red pepper, corn, remaining 2 teaspoons thyme, smoked paprika and optional chipotle powder and lemon juice. Mix well. Add in the flour and egg replacer, mix well again. Season to taste with salt, pepper and more of the other spices. We all vary on how strong we like our spices…you can’t take out but you can always put in.",
    "Now to divide and make your patties. I like to pat my mixture into the bowl a little and divide it with a knife into 4 sections, making a plus sign if you will. Take each section and pack it tightly into a ball in the palm of your hands. It should be about the size of your hand. Flatten with your palms and place on hard surface. Cup the edges with your palms and tighten them in a bit and flatten the top to the desired size. Mine were about 1/2 inch thick by 3 1/2 – 4 inches."
  ],
  "ingredients": [
    "0",
    "1/2 cup quinoa (I used tri-color)",
    "1 cup water",
    "1 teaspoon garlic powder",
    "3 teaspoons thyme, divided (oregano would be good too)",
    "1/2 – 1 teaspoon smoked paprika",
    "1/2 teaspoon ground chipotle pepper, optional",
    "1 can (15 oz.) white beans (I used cannellini), drained and rinsed",
    "1/2 cup corn, fresh or frozen (about 1/2 fresh corn off the cob)",
    "1/2 cup red bell pepper, finely diced (about 1/2 bell pepper)",
    "1/2 cup shallot, finely diced (about 1 medium) or red onion",
    "juice of one lemon",
    "1/3 cup oat flour, or flour of choice",
    "1 Egg replacer or 1 flaxegg (1 Tbs flaxseed meal + 3 Tbs water), optional*",
    "mineral salt & cracked pepper, to taste",
    "coconut or olive oil, to grease"
  ],
  "__v": 1
}