{
  "hash": "de890350ab4e60fa2e589a616aed1f2070f33291",
  "title": "Mozzarella and Tomato Skillet Pita Pizzas",
  "image": "http://assets.simplyrecipes.com/wp-content/uploads/2016/08/2016-08-31-Caprese-Skillet-Pizza-10.jpg",
  "href": "http://www.simplyrecipes.com/recipes/mozzarella_and_tomato_skillet_pita_pizzas/",
  "extension": "Chrome",
  "firstAdded": "2016-12-31T03:25:24.318000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Prepare the pita rounds: Use scissors to cut around the edge of each pita to make two thin rounds. Separate the rounds and set them on baking sheet with the rough sides facing up.",
    "2 Cut the mozzarella: Use a thin, sharp knife to slice the mozzarella as thinly as possible. It doesn’t matter if you don’t make even or perfect rounds.",
    "3 Assemble the pizzas: Divide the mozzarella among the pitas. The cheese doesn't need to cover the rounds completely. Add a few slices of the large tomatoes, enough to almost cover the mozzarella. Fill in the gaps with cherry tomatoes. Drizzle with olive oil, then sprinkle with salt and pepper.",
    "4 Cook the pizzas: Heat a cast-iron or other heavy skillet over medium heat for 3 minutes, until a flick of water sizzles and evaporates on contact. Add 1 pizza round and cover the pan. Cook for 3 to 5 minutes, or until the mozzarella melts at the edges. Use a wide metal spatula to lift the pizza out of the pan and transfer to a plate. Cook the remaining pizzas in the same way. (If you have more than one skillet, use them to cook several pizzas at once.)",
    "5 Cut the basil: While the pizzas are cooking, prepare the basil. Stack the leaves on top of each other, then roll them up into a tube. Use a sharp knife to slice the tube thinly across. With your hands, fluff up the basil to separate the shreds. (Alternatively, just tear the basil with your fingers.)",
    "6 Finish and serve: Sprinkle the hot pizzas with a pinch of salt and basil. Serve immediately."
  ],
  "ingredients": [
    "0",
    "4 pita rounds, 8- to 12-inches",
    "1 1/2 pounds fresh mozzarella",
    "4 medium tomatoes, thinly sliced",
    "1 pint mixed cherry tomatoes, halved",
    "Olive oil, for sprinkling",
    "Salt and pepper, to taste",
    "Large handful fresh basil leaves"
  ],
  "__v": 1
}