{
  "__v": 1,
  "directions": [
    "0",
    "For the crust:",
    "Add flour, sugar, and salt to the bowl of a food processor. Pulse a few times to combine. Add butter and shortening and pulse until the dough separates into large pebbles, about 5 pulses.",
    "Add 4 Tbs of water and pulse. Add more water, a tablespoon at a time, if needed. Dough should start to clump together into one mass, but should not feel wet or sticky.Turn the dough onto a lightly floured surface and form into a flat disk. Wrap in plastic and chill for at least 30 minutes.",
    "Take dough out of refrigerator and let sit on the counter for 10 minutes. Unwrap, and roll dough out on a lightly floured surface, forming a 12-inch circle. Periodically turn the dough 90 degrees (a quarter turn) to keep the dough from sticking. Dust the surface with a little more flour if necessary.",
    "Cut out rounds and fit dough into mini pie tins. Leave a 1/4” overhang around the edges. Fold the dough under and press so dough is flush with the edge of the pie tin. Reform scraps into a ball, roll out, and cut dough for remaining tins. Reform scraps, cover, and set aside.",
    "For the filling:",
    "Adjust oven rack to lowest position. Preheat oven to 400 degrees. Place 3 cups berries in medium saucepan and set over medium heat. Using potato masher, mash berries several times to release juices. Continue to cook, stirring frequently and mashing occasionally, until most of berries have broken down and mixture is thickened and reduced, about 8 minutes. Let cool slightly.",
    "Place grated apple in a few layers of paper towels and wring dry. Transfer apple to large bowl. Add cooked berries, remaining 4 cups uncooked berries, lemon zest, juice, sugar, tapioca, and salt; toss to combine. Transfer mixture to the mini pie tins.",
    "Roll out the remaining pie dough. Cut into decorative shapes (or strips to form a lattice pattern.) Place dough on top of the filling. Brush top crust and edges of pie with egg mixture.",
    "Place pies on a baking sheet and bake for 25 minutes. Reduce heat to 350 degrees and bake until juices bubble and crust is deep golden brown, about 25-30 minutes longer. Transfer pies to wire rack; cool to room temperature, at least 4 hours."
  ],
  "firstAdded": "2014-08-18T20:29:18.371000",
  "hash": "32341fb4ca981a6c0493dc325de8212229047c6a",
  "href": "http://kokocooks.com/2013/04/mini-blueberry-pies/",
  "image": "http://farm9.staticflickr.com/8520/8681040308_772eb500b9_z.jpg",
  "ingredients": [
    "0",
    "2 c all purpose flour",
    "1 1/2 Tbs sugar",
    "3/4 tsp salt",
    "6 Tbs unsalted butter, chilled and cut into chunks",
    "4 Tbs lard (or vegetable shortening), chilled and cut into chunks",
    "4-5 Tbs ice cold water",
    "7 c fresh blueberries",
    "1 large Granny Smith apple, peeled and grated on large holes of a cheese grater",
    "2 tsp grated lemon zest",
    "2 tsp fresh lemon juice",
    "¾ c sugar",
    "2 Tbs quick-cook (minute) tapioca, ground (you can use a mini-processor, or a mortar and pestle)",
    "Pinch table salt",
    "1 large egg, lightly beaten with 1 Tbs water"
  ],
  "keywords": [
    "purpose",
    "flour",
    "tbs",
    "sugar",
    "salt",
    "unsalted",
    "butter",
    "chilled",
    "chunks",
    "lard",
    "shortening",
    "ice",
    "cold",
    "water",
    "blueberries",
    "granny",
    "smith",
    "apple",
    "holes",
    "cheese",
    "grater",
    "lemon",
    "zest",
    "juice",
    "quickcook",
    "minute",
    "tapioca",
    "use",
    "miniprocessor",
    "mortar",
    "pestle",
    "egg",
    "lightly"
  ],
  "title": "Mini Blueberry Pies",
  "users": [
    null
  ]
}