{
  "hash": "3626268d42aa6e63fb81da562c1ca2d4a7641d14",
  "title": "Bratwurst Sausage",
  "image": "",
  "href": "https://www.chowhound.com/recipes/bratwurst-sausage-27641",
  "extension": "Chrome",
  "firstAdded": "2018-01-19T19:32:15.690000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place a baking sheet, a large mixing bowl, the grinder attachment, and the fine grinding plate (1/8 inch) in the freezer until very cold, at least 30 minutes.",
    "Meanwhile, trim the pork and veal shoulders of any excess fat, gristle, tendons, glands, silver skin, or blood vessels. Cut the pork, veal, and pork fat into 1-inch pieces and mix to evenly combine. Arrange in a single layer on the frozen baking sheet and place in the freezer until stiff but not frozen solid, about 45 minutes to 1 hour. Place the spices in a small bowl and mix to evenly combine; set aside.",
    "When the meat is ready, attach the frozen grinder attachment to the mixer. Sprinkle the spice mixture evenly over the meat. With the mixer on medium speed, grind the meat by the handful into the frozen mixing bowl. (The meat should easily pass through the auger and grinding plate. If it appears to stick to the front of the grinding plate, disassemble the grinder and clean out any tendons or fat that may be entangled in the blade.) Place the ground meat back in the freezer until stiff but not frozen solid, at least 30 minutes. Clean the grinder attachment and place it back in the freezer. (You will no longer need the grinding plate.)",
    "Meanwhile, check the meat mixture for proper seasoning by forming a small, thin patty. Pan-fry until the center is no longer raw. Taste it, keeping in mind that the flavor will develop as the sausage sits, or ages; add additional seasoning to the ground meat as desired."
  ],
  "ingredients": [
    "0",
    "3 pounds pork shoulder",
    "1 1/2 pounds veal shoulder",
    "3/4 pound pork fat",
    "3 tablespoons kosher salt",
    "1 tablespoon marjoram leaves",
    "2 teaspoons caraway seeds",
    "1 1/2 teaspoons ground white pepper",
    "1 teaspoon ground allspice"
  ],
  "__v": 1
}