{
  "hash": "0a196ca3e067fb67011b2608795ef5f968bc2807",
  "title": "Traditional Apple Cake",
  "image": "http://gourmetkoshercooking.com/wp-content/uploads/2011/09/traditional-Jewish-Apple-Cake.jpg",
  "href": "http://gourmetkoshercooking.com/2011/09/traditional-apple-cake/",
  "extension": "Chrome",
  "firstAdded": "2016-08-25T00:26:37.371000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "lace the oven rack in the lower third of the oven and preheat the oven to 350 degrees. Grease a ten inch angel food cake pan. Set it aside.",
    "Apple Mixture: Peel, core and slice 4 of the apples into 1/4\" thick slices. Core, but do not peel, the last 2 apples, and slice into 1/4\" slices. In a medium sized mixing bowl, toss all the apples with the honey or sugar, cinnamon and lemon juice very gently, until coated. Reserve the slices which are not peeled in a separate bowl.",
    "Cake: In the large bowl of an electric mixer combine the flour, sugar, oil, eggs, orange juice, baking powder, vanilla and salt. Increase the speed to medium-high and mix until well-blended, about 2 minutes. Pour 1/3 of the batter into the prepared pan, and smooth the batter. Arrange ½ of the peeled apple slices over the batter (being very careful not to let the apple slices directly touch any par of the pan, as it with stick to the pan and be problematic when the cake is cooked). Cover this apple layer with ½ of the remaining batter, and smooth the batter. Arrange the rest of the peeled apples over the batter. Pour the remaining batter over this second apple layer, and smooth this final layer of batter. Arrange the unpeeled apple slices over this batter, creating a fan of slightly overlapping slices that go all around the center of the tube pan. If there is any cinnamon juice left over from the apple mixture, drizzle it over the apple fan. Place the cake pan on a square of heavy aluminum foil (fold up the edges of the foil to form a tiny pan, thus preventing any juice that may leak out of the pan from dirtying your oven), and place it in the oven to bake for 75 to 85 minutes, or until a toothpick tester inserted into the center of the cake comes out clean.",
    "Remove the cake from the oven and place it on a rack to cool for 10 minutes. Gently release the cake from the sides of the pan with a small thin knife, if it appears to stick, and then remove the sides of the pan. Allow the cake to cool, with the center piece still in place, until room temperature before gently releasing and then removing the center piece. Place the cake on a cake stand. Immediately before serving, sift powdered sugar over the cake. Place some tiny apples or crab apples at the base of the cake for a garnish."
  ],
  "ingredients": [
    "0",
    "Apple Mixture:",
    "6 medium sized apples, Mackintosh or Braeburn if possible",
    "1/3 cup honey or ½ cup sugar",
    "1 tablespoon ground cinnamon",
    "2 teaspoons lemon juice",
    "Cake:",
    "3 cups all-purpose flour",
    "2 cups sugar",
    "1 cup vegetable oil",
    "4 large eggs",
    "1/3 cup orange juice",
    "3 teaspoons baking powder",
    "1 tablespoon vanilla extract",
    "1 teaspoon salt"
  ],
  "__v": 1
}