{
  "hash": "641899e2f0be38e90a9dabc2b0016c26cac3d204",
  "title": "NY Style Pizza (TMNT)",
  "image": "",
  "href": "http://recipe-folder.com/recipe/5b772db73d946d7ece1c64b7",
  "extension": "User Added",
  "firstAdded": "2018-08-17T20:19:03.039000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a food processor, pulse together the flour, 1 tablespoon sugar, 2 teaspoons salt and yeast until well combined. Combine the water and 1 tablespoon of vegetable oil and, with the machine running, slowly drizzle through the feed tube, until a sticky ball of dough forms. Transfer to an oiled surface and knead until smooth about 2 minutes. Transfer to an oiled bowl, cover with plastic wrap and refrigerate overnight.",
    "1",
    "Remove the dough from the refrigerator and divide into two pieces (you only need half the dough for one pizza). Wrap each piece of dough in plastic wrap and let rest at room temperature for 1 hour. While the dough rests, prepare the sauce. In a food processor, combine the tomatoes, garlic, oregano, red pepper flakes, basil and the remaining 1 teaspoon salt. Process until smooth, then transfer to a saucepan. Bring to a gentle simmer over medium-low heat, then cover and cook for 30 minutes.",
    "2",
    "Place a pizza stone in the oven and preheat to 550°F (or its highest setting) for 1 hour.",
    "3",
    "Dust a pizza peel with half of the semolina flour. Generously flour a work surface and place one of the doughs on top. Pressing gently using your fingertips, push the dough out to form a disc, leaving the edge slightly thicker. Once the dough is about 8 inches wide, pick it up and drape it over your knuckles, letting gravity stretch out the dough. Pass the dough hand-over-hand, until it’s stretched into about a 14-inch round. Place the dough on a pizza peel and reshape into a circle, if needed, leaving the edge slightly thicker. Ladle about ½ cup of sauce onto the dough and spread around until evenly coated. Scatter half of the mozzarella over the top, making sure not to get any sauce or cheese on the edge of the dough crust. Slide the pizza onto the preheated pizza stone and bake until the crust is well browned and the cheese is bubbly and browned in spots, about 12 minutes. Use the pizza peel to remove the pie and transfer to a large cutting board or pizza pan. Slice into 6 pieces and serve."
  ],
  "ingredients": [
    "0",
    "16 ounces bread flour, plus more for dusting",
    "1",
    "1 Tbsp plus ½ tsp sugar, divided",
    "2",
    "3 tsp kosher salt, divided",
    "3",
    "½ tsp instant yeast",
    "4",
    "1¼ cups ice water, plus more as necessary",
    "5",
    "1 Tbsp vegetable oil, plus more for oiling",
    "6",
    "One 28-ounce can whole peeled tomatoes",
    "7",
    "2 medium garlic cloves, minced",
    "8",
    "1 tsp dried oregano",
    "9",
    "½ tsp red pepper flakes",
    "10",
    "½ tsp dried basil",
    "11",
    "¼ cup semolina flour",
    "12",
    "8 ounces whole-milk mozzarella, shredded"
  ],
  "__v": 1,
  "hidden": true
}