{
  "hash": "9539cc57ed407e4e47244423e4618f4fd882c791",
  "title": "Warm salad of roast chicken, crisp pancetta, soft-boiled egg and bitter leaves",
  "image": "http://www.masterchef.com.au/recipes//images/recipe/1582_512x288.jpg",
  "href": "http://www.masterchef.com.au/recipes/warm-salad-of-roast-chicken-crisp-pancetta-softboiled-egg-and-bitter-leaves.htm##51c679d87948cb0000000075",
  "keywords": [
    "freerange",
    "chicken",
    "cornfed",
    "lemon",
    "thyme",
    "sprigs",
    "oregano",
    "garlic",
    "olive",
    "oil",
    "slices",
    "flat",
    "pancetta"
  ],
  "directions": [
    "0",
    "Official Masterchef Recipe",
    "Sorry, an error occurred loading your saved recipes: undefined undefined",
    "MasterChef 2013",
    "MasterClass",
    "Gary Mehigan",
    "Cuisine Type",
    "Salad",
    "Main Ingredients",
    "Chicken",
    "Eggs",
    "Parsley",
    "Sage",
    "Print Recipe",
    "Create PDF",
    "Warm salad of roast chicken, crisp pancetta, soft-boiled egg and bitter leaves",
    "Rate this recipe:",
    "2,301582,4,1,0",
    "2,301582,4,2,0",
    "2,301582,4,3,0",
    "2,301582,4,4,0",
    "2,301582,4,5,0",
    "11 votes",
    "Recipe by: Gary Mehigan",
    "Serves: 6",
    "Ingredients",
    "Roast chicken",
    "1 free-range chicken, such as corn-fed, about 1.4kg",
    "1 lemon, quartered",
    "4 thyme sprigs",
    "4 oregano sprigs",
    "2 garlic cloves, peeled",
    "30ml olive oil",
    "8 thin slices flat pancetta",
    "Stuffing balls",
    "80ml (1/3 cup)olive oil",
    "1 onion, finely chopped",
    "1 garlic clove, finely chopped",
    "½ bunch sage, thinly sliced",
    "200g day old breadcrumbs",
    "2 tablespoon flat-leaf parsley, finely chopped",
    "2 eggs",
    "Salt and freshly ground white or black pepper, to taste",
    "Salad dressing",
    "1 teaspoon Dijon mustard",
    "1 egg",
    "2 tablespoons red wine vinegar",
    "¾ cupextra virgin olive oil",
    "1 teaspoon walnut oil",
    "To serve",
    "3 soft boiled eggs, peeled, halved",
    "100gmixed salad leaves, such as witlof, yellow frisee, baby spinach, snow pea tendrils, nasturtium, washed",
    "1 cup firmly-packed herbs, leaves picked, such as chervil, dill, tarragon, parsley,",
    "½ cup pepitas, walnuts, sunflower seeds, toasted",
    "Extra virgin olive oil, to drizzle",
    "Add to Shopping List",
    "Method",
    "Roast chicken",
    "1. Preheat oven to 180°C.",
    "2. Remove wishbone from chicken. Place lemon, thyme, oregano and garlic cloves in the chicken cavity, and truss the chicken using kitchen string.",
    "3. Place a flameproof roasting pan on a stovetop over medium-high heat. Season chicken with salt and pepper. Pour olive oil into the roasting pan, then place chicken in the pan. Cook, beginning with one leg-side, for 12-15 minutes, turning, until lightly golden all over, cook the breast-side last.",
    "4. Turn the chicken breast-side up, place it in the oven and roast for 1 hour or until golden and cooked through (the juices will run clear when the thigh is pierced with a skewer). Remove chicken from pan, and set aside to rest for 10 minutes.",
    "5. Meanwhile, arrange pancetta on a lined baking tray. Place another square of baking paper over the top of the pancetta, then fit a slightly smaller tray over the top to weigh it down. Place in oven for 8-10 minutes or until golden and crisp. Remove from oven, cool and set aside.",
    "Stuffing balls",
    "1. Heat 2 tablespoons of the oil in a non-stick frying pan over low heat. Cook onion and garlic, stirring, for 3-4 minutes until onion is soft and translucent. Remove from heat and stir in sage. Set aside to cool.",
    "2. Add breadcrumbs to a large bowl. Mix in parsley, cooled onion mixture, eggs and season with salt and freshly ground pepper.",
    "3. Roll stuffing into balls, about the size of a 50c piece. Set aside on a tray. Cover and refrigerate for 30 minutes until cold and firm.",
    "4. Heat remaining 2 tablespoons of oil in a large non-stick frying pan over medium heat. Add stuffing balls and cook gently for 4-5 minutes or until completely golden.",
    "Salad dressing",
    "1. For the salad, place mustard, egg and vinegar in the bowl of a small food processor and process until foamy. Add a pinch of salt and pepper, then pour in oils. Process until oil is incorporated and the dressing is combined and emulsified.",
    "To serve",
    "1. Carve chicken into pieces and arrange on a serving platter. Top with crispy pancetta, and arrange with stuffing balls and eggs. Drizzle with dressing, arrange with salad lea"
  ],
  "ingredients": [
    "0",
    "1 free-range chicken, such as corn-fed, about 1.4kg",
    "1 lemon, quartered",
    "4 thyme sprigs",
    "4 oregano sprigs",
    "2 garlic cloves, peeled",
    "30ml olive oil",
    "8 thin slices flat pancetta"
  ],
  "__v": 0
}