{
  "hash": "492a508aba6049a3fa30866baa0100bba274c50c",
  "title": "Teamster Sandwich",
  "image": "",
  "href": "http://recipe-folder.com/recipe/5b7732173d946d7ece1c64cb",
  "extension": "User Added",
  "firstAdded": "2018-08-17T20:37:43.743000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Start by removing the rib roast from the bone. Next, using a sharp knife, make some shallow cuts in the fat of the beef to score it. Set aside.",
    "1",
    "Grind up 1 Tbsp dried rosemary and 1 Tbsp dried thyme until they are almost a powder and then add some kosher salt, freshly ground pepper and optionally some garlic and onion powder. Give it a little mix and then liberally rub all over your rib roast.",
    "2",
    "Place your roast back on top of the bones, and using butcher’s twine, tie them back to each other so the bones can serve as a natural roasting rack.",
    "3",
    "Preheat the oven to 500°F.",
    "4",
    "Place your roast in a pan and rub down with olive oil. Once it’s covered, insert a temperature probe into the thickest part of the roast. Place in the oven for 25 minutes and then turn the temperature down to 300°F. Continue to cook until the internal temperature reaches 115°F.",
    "5",
    "Once cooked, remove from the pan, put on a plate, and cover with aluminum foil. Make sure the probe remains in the roast. Set aside for 15 minutes.",
    "6",
    "Place the pan over a medium high heat and make sure there is about ⅓ of a cup of fat left in the pan. If there is more, pour it into a bowl and set aside. Add 1 Tbsp of all purpose flour and whisk for about 2-3 minutes, then add 32 ounces of high quality beef stock to the pan. Whisk frequently and boil down to your desired consistency. Season with salt and pepper.",
    "7",
    "Once your meat has reached an internal temperature of 130°F, remove the aluminum foil and you’re left with perfect medium rare beef. Cover the meat and place in the fridge overnight to make for easier slicing.",
    "8",
    "Remove meat from the fridge and cut into thin slices. Bring your gravy/sauce to a slight boil and place your beef in the sauce and let sit for a minute.",
    "9",
    "Remove your roasted peppers from the jar and place in a bowl. Combine with 3-4 cloves of garlic along with some olive oil and a little bit of kosher salt. Let chill in the fridge if you have time.",
    "10",
    "Next, take your baguette and slice lengthwise. Place some fresh mozzarella on the bread along with your roasted red peppers and your roast beef.",
    "11",
    "Pour some of your sauce into a small bowl for dipping."
  ],
  "ingredients": [
    "0",
    "1 standing rib roast",
    "1",
    "1 Tbsp dried rosemary",
    "2",
    "1 Tbsp dried thyme",
    "3",
    "Salt",
    "4",
    "Pepper",
    "5",
    "Garlic powder (optional)",
    "6",
    "Onion powder (optional)",
    "7",
    "Olive oil",
    "8",
    "⅓ cup of leftover fat",
    "9",
    "1 Tbsp all purpose flour",
    "10",
    "32 ounces high quality beef stock",
    "11",
    "1 short baguette",
    "12",
    "Fresh mozzarella",
    "13",
    "1 jar of roasted red peppers",
    "14",
    "3-4 cloves of fresh garlic"
  ],
  "__v": 1,
  "hidden": true
}