{
  "hash": "d40d81d87ac04874b9d4414336980146eba29cee",
  "title": "Heidi Swanson's Spicy Green Soup",
  "image": "https://images.food52.com/AfhS1Yw4Q2TNk1ZS3mQD6pa5nVc=/753x502/cb5b7d86-2c35-40a8-8c38-5da12e4875aa--2015-0922_heidi-swansons-spicy-green-soup-with-basil-mint-and-cilantro_alpha-smoot_102.jpg",
  "href": "https://food52.com/recipes/38686-heidi-swanson-s-spicy-green-soup",
  "extension": "Chrome",
  "firstAdded": "2018-03-01T01:45:24.259000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a saucepan, bring water just to a simmer.",
    "As the water heats, combine the garlic, basil, cilantro, mint, ginger, olive oil, chiles, almonds, salt, lemon zest, and honey in a food processor. Blend until smooth, thinning with a couple of tablespoons of cold water and scraping down the sides along the way, until the mixture becomes as smooth as possible.",
    "Taste and adjust to your liking; the paste should be strong and spicy.",
    "Just before serving, add the paste to the simmering water and stir well. Dial back the heat at this point; you don't want it to return to a simmer, but you do want it very hot.",
    "Taste and adjust the seasoning—a bit more salt or a squeeze of lemon juice. (Editors' note: Don't skimp on the lemon!) Ladle into bowls with your chosen accompaniment and enjoy on its own or topped with any of the suggested toppings."
  ],
  "ingredients": [
    "0",
    "4 cups (1 liter) water",
    "3 medium cloves garlic",
    "3/4 cup (20 grams) firmly packed basil leaves",
    "1 1/4 cups (35 grams) firmly packed cilantro leaves and stems",
    "1/4 cup (7 grams) lightly packed mint leaves",
    "A thick 2-inch piece of ginger, peeled and sliced",
    "3 tablespoons extra-virgin olive oil",
    "2 small serrano chiles, stemmed",
    "1/2 cup (45 grams) sliced almonds",
    "1 teaspoon fine-grain sea salt",
    "Zest of 1 lemon",
    "1 tablespoon runny honey",
    "Poached eggs, hot white beans, soba noodles, or brown rice, to serve",
    "Chopped black olives, lemon wedges, toasted almonds, shaved green onions, or roasted, sliced mushrooms (or other oven-roasted vegetable), to top"
  ],
  "__v": 1
}