{
  "hash": "8c3e41f6e07b82fde08496ed13e0e601037f3e97",
  "title": "Classic Beef Pot Pie",
  "image": "https://cookingwithcurls.com/wp-content/uploads/2017/10/Instant-Pot-Irish-Beef-Stew-COPYRIGHT-©-2017-COOKING-WITH-CURLS.jpg",
  "href": "https://cookingwithcurls.com/2017/11/10/classic-beef-pot-pie/",
  "extension": "Chrome",
  "firstAdded": "2018-02-24T23:58:28.693000",
  "users": [
    null,
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cut sirloin steak into bite sized {3/4-inch} pieces. Season with salt and pepper, set aside.",
    "Heat 2 Tablespoons of olive oil in a large Dutch oven over medium-high heat. Add the chopped onion and cook until softened and lightly browned.",
    "Add the steak and cook until browned on all sides, about 8 to 10 minutes.",
    "Stir in the garlic and cook for one minute. Add the tomato paste, red wine, and Worcestershire sauce. Stir until well combined.",
    "Sprinkle flour over the steak, stir to coat. Pour in the beef broth, stir to combine. Add the chopped potatoes and thyme, stir mixture together.",
    "Cover and simmer until the steak is tender, 45 minutes to one hour.",
    "Preheat oven to 400 degrees. Spray a 9-inch deep pie dish with cooking spray and set aside.",
    "Remove the steak mixture from the heat and stir in the peas and carrots. Set aside to cool.",
    "Roll out the pie dough into a 13-inch circle. Cut into random sized strips. Pour the pot pie mixture into the pie dish. Top with 5 strips.",
    "Fold every other strip back on itself about halfway down. Place a horizontal strip over the unfolded strips, then fold the strips back over. Continue this process until the entire pie is covered.",
    "Run a sharp knife around the edge of the pie plate to remove the excess dough. Cut fun shapes out of the leftover dough and place them randomly over the top of the pie {if desired}.",
    "Alternate Crust – Place the entire rolled out dough circle over the pot pie. Fold the excess dough inward to meet up with the inner edge of the pie plate. Crimp the dough evenly around the edge using your fingers. Cut slits around the center of the pie to vent the steam.",
    "Brush the pie crust with the egg wash. {Mix the egg with the salt and white pepper} Place on a baking sheet and bake for 30 minutes, until the crust is golden brown.",
    "Place pot pie on a wire cooling rack and allow to cool for 20 to 30 minutes before serving."
  ],
  "ingredients": [
    "0",
    "2 pounds sirloin steak, cut into 3/4-inch pieces",
    "sea salt and ground black pepper",
    "1 cup yellow onion, finely chopped",
    "4 large cloves garlic, minced",
    "1/4 cup all-purpose flour",
    "1/2 cup red wine, or beef stock",
    "2 Tablespoons tomato paste",
    "1 Tablespoon Worcestershire sauce",
    "1 3/4 cup beef stock",
    "1 pound small, Yukon gold potatoes cut into quarters",
    "1 teaspoon dried thyme",
    "3 cups frozen peas and carrots",
    "1/2 recipe Perfect Pie Crust, or a store-bought pie dough",
    "1 large egg, lightly beaten",
    "pinch sea salt",
    "pinch white pepper"
  ],
  "__v": 2
}