{
  "hash": "effaf368f26062c224c6524d67d37ba4561c2ff7",
  "title": "Homemade Pop Tarts",
  "image": "http://www.hellobee.com/wp-content/uploads/2013/04/IMG_0414.jpg",
  "href": "http://www.hellobee.com/2013/04/08/homemade-whole-grain-pop-tarts-easy-strawberry-jam/",
  "extension": "Chrome",
  "firstAdded": "2015-05-11T23:16:30.293000",
  "users": [
    null
  ],
  "keywords": [
    "spelt",
    "flour",
    "wheat",
    "allpurpose",
    "sugar",
    "salt",
    "butter",
    "pieces",
    "refrigerated",
    "cold",
    "ice",
    "water",
    "egg",
    "lightly",
    "recipe",
    "easy",
    "strawberry",
    "favorite",
    "jam"
  ],
  "directions": [
    "0",
    "In a medium bowl, whisk together the flour, sugar and salt. Add the cold butter cubes and incorporate using a pastry blender or, with a butter knife in each hand, start in the middle of the bowl and cut outward, knives moving in opposite directions. Work the butter until it averages pea-size pieces – some will be larger and some smaller. (Alternatively, add the dry ingredients to a food processor and process the butter into the mixture to achieve the same effect.)",
    "Drizzle the water over the butter-flour mixture and stir until the dough starts to come together. Use your hands to bring the dough into disc. Cover with plastic wrap and refrigerate for an hour or overnight. Bring the dough out of the fridge about 15 minutes before you want to use it so it softens just slightly.",
    "Place the dough on a lightly floured surface and roll into a rectangle 1/8-inch thick. Cut smaller rectangles to desired size – I like 4-inch x 5-inch. Re-roll the scraps to cut more rectangles.",
    "Use a pastry brush to brush egg lightly over the pieces of dough. Add about 2 tablespoons of jam to half the pieces and top each with a second piece. With the tines of a fork, press the sides of each tart together and poke some holes on the top to allow air to escape while baking.",
    "Preheat the oven to 350 degrees. Place the tarts on a baking sheet and refrigerate for at least 30 minutes. (At this point you could transfer some or all of the tarts to the freezer for future use.) Once chilled, bake the tarts until golden brown, about 20 minutes. Serve warm, room temperature, or freeze for future use."
  ],
  "ingredients": [
    "0",
    "1 1/4 c whole spelt flour (or whole wheat, or all-purpose)",
    "1/2 tbsp sugar",
    "1/2 tsp salt",
    "1 stick butter, chopped into 1/2-inch pieces and refrigerated until cold",
    "6 tbsp ice cold water",
    "1 egg, lightly beaten",
    "1 recipe Easy Strawberry Jam, below (or 1 c of your favorite jam)"
  ],
  "__v": 4
}