{
  "hash": "1d05c3068091c6ee4604d2b32f7ce1e83cc67fd8",
  "title": "How to make burgers",
  "image": "http://www.bbcgoodfood.com/sites/bbcgoodfood.com/files/burger_500x347.jpg",
  "href": "http://www.bbcgoodfood.com/howto/guide/how-make-burgers",
  "extension": "Chrome",
  "firstAdded": "2015-03-20T00:27:23.004000",
  "users": [
    null
  ],
  "keywords": [
    "choose",
    "meat",
    "want",
    "burger",
    "remain",
    "juicy",
    "avoid",
    "going",
    "lean",
    "standard",
    "usually",
    "set",
    "leaner",
    "cuisine",
    "fat",
    "dont",
    "typical",
    "used",
    "burgers",
    "use",
    "lamb",
    "mixture",
    "beef",
    "pork",
    "flavourings",
    "world",
    "oyster",
    "comes",
    "flavouring",
    "spring",
    "onion",
    "garlic",
    "spices",
    "cumin",
    "coriander",
    "chilli",
    "fajita",
    "spice",
    "mustard",
    "herbs",
    "black",
    "pepper",
    "pick",
    "flavours",
    "think",
    "tried",
    "tested",
    "combinations",
    "janine",
    "olive",
    "magazine",
    "suggests",
    "italian",
    "parsley",
    "parmesan",
    "mince",
    "moroccan",
    "dollop",
    "harissa",
    "spanish",
    "smoked",
    "paprika",
    "chorizo",
    "sarah",
    "good",
    "food",
    "adds",
    "instead",
    "make",
    "thinner",
    "patties",
    "pop",
    "square",
    "middle",
    "squeeze",
    "edges",
    "seal",
    "cheese",
    "sandwich",
    "warn",
    "guests",
    "molten",
    "oozing",
    "bite"
  ],
  "directions": [
    "0",
    "3. Bind it",
    "If you're going for a leaner meat or adding bulky ingredients (eg spring onions, onions, chillies), add an egg and a handful of breadcrumbs to bind the burgers.",
    "4. Shape it",
    "Give everything a thorough mix, it's good to get your hands in for this, then shape into burgers. \"Squash the burgers really flat before you cook them. As they cook the meat will constrict, which will make the burgers smaller and fatter. Flatten them down with a spatula during cooking,\" suggests Cassie from Good Food magazine.",
    "Season it",
    "\"Don't add salt to the ground meat before it's shaped, it'll draw the liquid out of the meat leaving you with a dry burger. Instead sprinkle the outside with salt as it cooks,\" adds Cassie.",
    "6. Chill it or freeze it",
    "\"Chill your burgers for at least an hour before you cook them,\" says Barney from Good Food magazine. \"This will help them keep their shape when they're cooking and stop them falling apart.\" You can also freeze them before cooking. Lay them on a tray in the freezer and once they're frozen, pop them into freezer bags to save space. To defrost them, lay them back on the tray. Defrost throughly before cooking.",
    "7. Cook it",
    "Pop your burgers on the barbecue or in a hot, non-stick frying pan with a little oil. Cook for 5 - 6 minutes each side for medium and 8 - 9 minutes on each side for well done. The NHS Live Well website recommends not leaving any pink meat in your burger.",
    "Cassie suggests the following delicious tip: \"Steam it! Once the burger has browned on both sides, pop your cheese on top (if using) and cover with a small bowl or lid to finish off cooking, this will melt the cheese and keep all the lovely meaty juices inside the burger.\"",
    "Finally, the buns: \"Always toast soft buns as it keeps the sauce from sinking into them and gives you a nice contrast of textures,\" says Janine.",
    "And there you have it, burgers really are that simple."
  ],
  "ingredients": [
    "0",
    "1. Choose your meat",
    "You want your burger to remain juicy so avoid going too lean. Choose a standard minced meat (usually around 20 % fat) or if you are set on leaner cuisine then 10 % fat is ok, don't go for less. Beef is the typical meat used in burgers but you could use lamb or pork, or a mixture of beef and pork.",
    "2. Add your flavourings",
    "The world is your oyster when it comes to flavouring your burgers. Grated onion, finely chopped spring onion, crushed garlic, ground spices (cumin, coriander, ground chilli, fajita spice mix etc), mustard, chopped fresh or dried herbs, ground black pepper - pick the flavours you like. Think of tried and tested combinations, Janine from olive magazine suggests:",
    "\"For Italian burgers, add crushed garlic, finely chopped parsley and grated parmesan to beef mince.",
    "\"For Moroccan burgers, add chopped coriander, ground cumin and a dollop of harissa paste to lamb mince.",
    "\"For Spanish burgers, add smoked paprika and finely chopped chorizo to pork mince.\"",
    "Sarah from Good Food magazine adds:",
    "\"Instead of topping with cheese, make 2 thinner patties, pop a square of cheese in the middle, then squeeze the edges to seal, like a meat cheese sandwich... just warn your guests about molten oozing when they bite in!\""
  ],
  "__v": 1
}