{
  "hash": "36a4a7a14848c3e2b3de7e9b2e9a0873b6e4083e",
  "title": "Salmon Piccata",
  "image": "http://i1.wp.com/cafedelites.com/wp-content/uploads/2016/02/Salmon-Piccata-9.jpg?resize=700%2C1050",
  "href": "http://cafedelites.com/2016/02/01/easy-salmon-piccata/",
  "extension": "Chrome",
  "firstAdded": "2016-02-08T14:25:46.591000",
  "users": [
    null
  ],
  "keywords": [
    "skinless",
    "salmon",
    "fillets",
    "salt",
    "lemon",
    "black",
    "pepper",
    "flour",
    "divided",
    "reduced",
    "fat",
    "butter",
    "ghee",
    "olive",
    "oil",
    "prefer",
    "medium",
    "garlic",
    "dry",
    "white",
    "replace",
    "extra",
    "broth",
    "wine",
    "adds",
    "amazing",
    "flavour",
    "lowsodium",
    "chicken",
    "stockbroth",
    "free",
    "juice",
    "rinsed",
    "capers",
    "coarsely",
    "parsley",
    "serve"
  ],
  "directions": [
    "0",
    "Season both sides of salmon fillets evenly with salt and pepper. Add ¼ cup of the flour to a shallow dish; dredge the salmon in the flour to evenly coat. Shake off excess.",
    "Melt 1 tablespoon of butter in a large nonstick pan or skillet over medium-high heat. Add 1 tablespoon oil and swirl to mix through the butter. Add salmon; sauté 4 minutes on each side or until just cooked to your liking. Transfer salmon to a warm plate; tent with foil and set aside.",
    "Add remaining 1 tablespoon butter (or oil) to pan and melt. Add the garlic; sauté for a further minute until fragrant. Add wine; bring to a boil scraping any browned bits off of the bottom of the pan. Cook until liquid almost evaporates, stirring occasionally. Add ¾ cup stock/broth to the pan along with the lemon juice; bring to a boil and cook for a further 3 minutes.",
    "Add the remaining 3 teaspoons flour to reserved ¼ cup stock/broth, whisking well to combine. Pour the flour mixture into the pan, stirring through the liquid to create a sauce. Cook for 1 minute or until slightly thickened. Remove from heat; stir capers through the sauce. Place the salmon fillets back into the pan, gently turning each fillet to evenly coat in the sauce. Sprinkle with chopped parsley and extra pepper. Serve immediately over rice, pasta or vegetables of choice."
  ],
  "ingredients": [
    "0",
    "4x 170g | 6 oz skinless salmon fillets",
    "sea salt and lemon pepper (or black pepper), to taste",
    "¼ cup + 3 teaspoons flour, divided",
    "2 tablespoons reduced fat butter or ghee (substitute with olive oil if you prefer)",
    "1 tablespoon olive oil",
    "4 medium garlic cloves, minced",
    "⅓ cup dry white wine (optional. Replace with extra broth, but the wine adds amazing flavour!)",
    "1 cup low-sodium chicken stock/broth (fat free if you can find it)",
    "¼ cup fresh lemon juice",
    "4 tablespoons rinsed and drained capers",
    "2-4 tablespoons coarsely chopped parsley, to serve"
  ],
  "__v": 1
}