{
  "hash": "6767cb77806c6ef108c274767036644ff7f292c1",
  "title": "Cream of Mushroom Soup",
  "image": "http://3.bp.blogspot.com/_TtjHZtf6vtA/SzvTjNgxS1I/AAAAAAAAHVQ/vR76JJ_qk5I/mushs.JPG",
  "href": "http://foodwishes.blogspot.com/2009/12/cream-of-mushroom-soup-pure-liquid-moon.html",
  "firstAdded": "2015-01-14T18:00:36.780000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "butter",
    "white",
    "brown",
    "button",
    "mushrooms",
    "yellow",
    "onion",
    "rounded",
    "flour",
    "sprigs",
    "thyme",
    "tied",
    "bundle",
    "kitchen",
    "string",
    "picked",
    "leaves",
    "garlic",
    "left",
    "chicken",
    "broth",
    "stock",
    "water",
    "cream",
    "salt",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "I can't believe I haven't posted a video recipe for cream of mushroom soup! It's such a classic cool weather staple, and quite simple to make – as long as you have a few hours to spare.",
    "The secret to this deep rich potage is a long slow caramelization, the key to unlocking the mushroom's magic. Oh, and by the way, I mean that literally. Mushrooms are by far the most mysterious and magical things we eat.",
    "Scientists still don't really understand how and why they grow like they do. While every other food you eat gets its energy from the sun, Agaricus bisporus, the common button mushroom, does not. Some believe mushrooms are powered by the moon, which I find fascinating to contemplate.",
    "This is a very minimalist formula, and meant to transform the browned bits of fungus into pure earthy essence of mushroom. You can use whatever exotic mushrooms you can get a hold of, but it works quite well with the ubiquitous white button mushroom. Enjoy!"
  ],
  "ingredients": [
    "0",
    "1/4 cup unsalted butter",
    "2 pounds white or brown button mushrooms, sliced",
    "1 yellow onion, diced",
    "1 rounded tbsp flour",
    "6 sprigs fresh thyme, tied into a bundle with kitchen string, plus some picked leaves to garnish",
    "2 cloves garlic, peeled, left whole",
    "4 cups chicken broth or stock",
    "1 cup water",
    "1 cup heavy cream",
    "salt and fresh ground black pepper to taste"
  ],
  "__v": 1
}