{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 350 degrees. In a large bowl, combine the flour, the baking soda, the baking powder, and the salt. Set aside.",
    "In a large bowl, beat the butter and the peanut butter together until fluffy. Add the sugars and beat until smooth. Add the egg and mix well. Add the milk and the vanilla extract. Add the flour mixture and beat thoroughly. Stir in the peanut butter and chocolate chips. Place sprinkling sugar — the remaining tablespoon — on a plate. Drop by rounded teaspoonfuls into the sugar, then onto ungreased cookie sheets, leaving several inches between for expansion. Using a fork, lightly indent with a crisss-cross pattern (I used the back of a small offset spatula to keep it smooth on top), but do not overly flatten cookies. Bake for 10 to 12 minutes. Do not overbake. Cookies may appear to be underdone, but they are not.",
    "Cool the cookies on the sheets for 1 minute, then remove to a rack to cool completely."
  ],
  "firstAdded": "2014-06-19T07:09:18.026000",
  "hash": "88ffacac6c95738499d2590adb847fd02525710b",
  "href": "http://smittenkitchen.com/blog/2007/12/peanut-butter-cookies/",
  "image": "http://farm3.static.flickr.com/2026/2111095624_61376284bb.jpg",
  "ingredients": [
    "0",
    "1 1/4 cups all-purpose flour",
    "3/4 teaspoon baking soda",
    "1/2 teaspoon baking powder",
    "1/4 teaspoon salt",
    "1/2 cup unsalted butter, softened",
    "1 cup peanut butter at room temperature (smooth is what we used, but I am pretty sure they use chunky at the bakery)",
    "3/4 cup sugar",
    "1/2 cup firmly packed light brown sugar",
    "1 large egg, at room temperature",
    "1 tablespoon milk",
    "1 teaspoon vanilla extract",
    "1/2 cup peanut butter chips",
    "1/2 cup chocolate chips",
    "For sprinkling: 1 tablespoon sugar, regular or superfine"
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "baking",
    "soda",
    "salt",
    "unsalted",
    "butter",
    "softened",
    "peanut",
    "room",
    "smooth",
    "used",
    "pretty",
    "sure",
    "use",
    "chunky",
    "bakery",
    "sugar",
    "firmly",
    "light",
    "brown",
    "egg",
    "milk",
    "vanilla",
    "chips",
    "chocolate",
    "sprinkling",
    "regular",
    "superfine"
  ],
  "title": "Peanut Butter Cookies",
  "users": [
    null
  ]
}