{
  "hash": "255bb3d025bfc7ad09c7d5e047daa56051267d81",
  "title": "Black Forest Oat Cookies",
  "image": "https://www.theglobeandmail.com/resizer/MogmVY4oisTi-ctwGcCfF7eoEyU=/620x0/filters:quality(80)/arc-anglerfish-tgam-prod-tgam.s3.amazonaws.com/public/VBEGGPHISFAUBPN4MDYRWYBL2Y.jpg",
  "href": "https://www.theglobeandmail.com/life/food-and-wine/recipes/article-a-guide-to-getting-the-most-from-your-grains-while-baking/",
  "extension": "Chrome",
  "firstAdded": "2019-02-25T00:12:01.751000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 F with racks in the top and bottom thirds. Line quarter sheet pans with parchment paper and set aside.",
    "In a medium bowl, whisk together the flours, baking powder, baking soda and salt.",
    "Using a stand mixer with the paddle attached, beat the butter, sugar and molasses together on medium-high until light and fluffy, about 5 minutes, scraping the bowl and beater down once.",
    "Knock the motor down to medium and beat in the egg, followed by the extracts.",
    "Stop the machine and scrape down the beater and bowl. Tip in the flour mixture. Set the mixer to stir, and run until the dry and wet are almost incorporated. Scrape down the beater and bowl again, then spill in the oats, coconut, chocolate and dried cherries. Stir to combine, either with the machine or by hand.",
    "Use 2-tablespoon scoop or similar to form 24 portions of dough (or a generous 2½ tablespoons to make 18 larger cookies). Roll each into a ball. Arrange 6 balls on a baking sheet, with space in between. Gently press each to flatten slightly to a generous 3/4-inch. Repeat with the second baking sheet.",
    "Bake the cookies in the hot oven until truly golden brown, about 15 minutes, rotating the trays from front to back and top to bottom halfway through. Transfer cookies to a wire rack to cool.",
    "Let the trays cool to room temperature (run them under cold water, then dry, if looking to expedite the process). Then bake the remaining dough as before.",
    "The cookies are best the day they are made but can be stored up to a week in an airtight container at room temperature."
  ],
  "ingredients": [
    "0",
    "1 cup whole-grain wheat flour (not cake and pastry), sifted",
    "1/4 cup spelt flour",
    "3/4 teaspoon baking powder",
    "1/2 teaspoon baking soda",
    "1 cup unsalted butter, softened",
    "1 1/3 cup granulated sugar",
    "2 tablespoons molasses",
    "1 large egg",
    "1 1/2 teaspoons vanilla extract",
    "1/4 teaspoon almond extract",
    "2 cups old-fashioned rolled oats",
    "1/2 cup shredded coconut, sweetened or not",
    "8 ounces good-quality dark chocolate, chopped",
    "1/2 cup dried cherries"
  ],
  "__v": 1
}