{
  "hash": "6318cc627f5160a87df2a71e5ea05e7ce9be5343",
  "title": "Beef Lo Mein Noodles x6 Servings",
  "image": "https://lifemadesweeter.com/wp-content/uploads/Beef-Lo-Mein-Noodles-with-Broccoli-Recipe-Picture-Photo-3-e1501393439661-1-300x300.webp",
  "href": "https://lifemadesweeter.com/beef-lo-mein/",
  "extension": "",
  "firstAdded": "2019-11-22T00:03:30.429000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "If using dry noodles, prepare noodles according to package directions, drain and set aside. While the noodles are cooking, whisk together all the ingredients for the sauce.",
    "Heat 1-2 tablespoons of cooking oil in a large skillet or wok over high heat, for about 2 minutes. The pan needs to be hot enough that you start seeing a little bit of smoke rising.",
    "Quickly add the beef to the smoking pan and spread the pieces out to a single layer allowing them to sear and brown. Season with salt, black pepper, and cornstarch.",
    "Cook until the meat is no longer pink (about 30 seconds making sure not to over cook). Quickly transfer beef to a serving plate and set aide.",
    "Add the same pan back to the stove and turn the heat to medium-high heat. Add the remaining oil and let it heat up then toss in the broccoli and saute for 3-4 minutes, or until tender-crisp. Add ginger and garlic, stirring for another 30 seconds until fragrant then add the seared beef back to the pan. Pour in sauce and stir until the sauce boils and thickens - about 30 seconds. Add more water if needed to thin out the sauce. Quickly stir in the fresh or cooked noodles and toss everything together to coat well. Season with additional salt and pepper as needed, sprinkle sesame seeds, green onions or parsley over top and serve hot.",
    "For meal prep: Divide noodles into four containers and store in the refrigerator for up to four days."
  ],
  "ingredients": [
    "0",
    "10 ounces dried lo mein noodles or 2 1/2 cups fresh lo mein (*can also use egg noodles, dry spaghetti, angel hair or linguine noodles)",
    "12 ounces (about 1/2 lb) flank steak or sirloin trimmed of fat, very thinly sliced against the grain",
    "salt and black pepper to taste",
    "1.5 teaspoon cornstarch",
    "7 Tablespoons cooking oil divided",
    "4.5 cups broccoli florets",
    "1.5 teaspoon fresh minced or grated ginger",
    "3 garlic cloves minced",
    "----------------------------------------------",
    "0.5 cup low sodium soy sauce can also use gluten free tamari or coconut aminos for paleo",
    "4.5 Tablespoons hoisin sauce",
    "1.5 Tablespoon of rice wine Mirin",
    "3 teaspoons honey or brown sugar",
    "3 teaspoons of sesame oil",
    "3 Tablespoons corn starch",
    "1 cup water plus more as needed to thin out sauce",
    "1.5 teaspoon fish sauce optional but if you already have it in your pantry, give it a try - it adds that extra rich umami flavor",
    "2 teaspoons Thai chili garlic paste red pepper chili flakes or Sriracha sauce - optional or to taste"
  ],
  "__v": 4
}