{
  "hash": "6f6589fcc917f1d2d92359fac997bf37071c787a",
  "title": "Easy Meatballs",
  "image": "http://www.gimmesomeoven.com/wp-content/uploads/2013/01/easy-meatballs-3-576x383.jpg",
  "href": "http://www.gimmesomeoven.com/easy-meatballs/",
  "extension": "Chrome",
  "firstAdded": "2016-08-29T00:57:13.140000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine the beef (or pork), breadcrumbs, onion, Parmesan, garlic, eggs, thyme, oregano, salt and pepper together in a large bowl. Use a potato masher or your hands to combine the mixture until evenly-mixed.",
    "Use a small scoop or a spoon to measure out a rounded tablespoon-full of the mixture, and then roll it into a ball. Set aside. Repeat with the remainder of the mixture and set aside.",
    "Meanwhile, heat the crushed tomatoes in a large, deep sauté pan (or stockpot) over medium-high heat until simmering. Stir in the smoked paprika, season with salt and pepper, and reduce heat to medium-low. Add the meatballs in a single layer, coating with the sauce. Cover and let simmer for about 20-30 minutes until the meatballs are cooked through, turning the meatballs once or twice. Remove and set on a serving plate, ladling any of the extra sauce on top of the meatballs. Serve with bamboo forks or toothpicks if desired.",
    "Stir together the crushed tomatoes and smoked paprika in the bowl of the slow cooker . Add the meatballs in a single layer, coating with the sauce. Cover and cook on low until meatballs are tender, about 4-6 hours."
  ],
  "ingredients": [
    "0",
    "1.5 lb. ground beef or pork",
    "1/2 cup breadcrumbs",
    "1/2 cup finely-diced white onion",
    "1/4 cup freshly-grated Parmesan cheese",
    "1/2 tsp. dried thyme",
    "1/4 tsp. dried oregano",
    "1/4 tsp. salt",
    "1/4 tsp. black pepper",
    "4 cloves garlic, minced",
    "2 eggs",
    "1",
    "1 (28 oz.) can crushed tomatoes (I prefer fire-roasted)",
    "1 tsp. smoked paprika",
    "chopped fresh basil or parsley for garnish"
  ],
  "__v": 1
}