{
  "__v": 1,
  "directions": [
    "0",
    "Method",
    "• Wash and cut lamb into bite size pieces.",
    "• Crush ginger and garlic.",
    "• Slice onion thinly and dice tomatoes in large pieces.",
    "• Heat oil in a pan and add fenugreek, mustard and cumin seeds. As it starts to splatter add cinnamon, cloves and cardamom. Stir for a second or two and add onions.",
    "• Once onions turn translucent add garlic, ginger, chillies and curry leaves and let it brown on medium heat setting. Throw in turmeric and garam masala and give it a quick stir adding lamb soon after that.",
    "• Cook the curry slightly wet/dry on low heat setting. If you find its getting too dry and lamb is still not ready (taste test required) then add a quarter cup of water to cook a little longer.",
    "• Once the water dries and you see some oil float up add potatoes with enough water (as per your preference for gravy) into the lamb curry. Continue to cook on low heat setting.",
    "• After a few minutes check potatoes to see if it’s half cooked using a spoon to break it. If it is then throw in the tomatoes and continue cooking until potatoes are fully done.",
    "• Finish it off with Coriander as garnish and a squeeze or two of lemon juice.",
    "This dish is best served with rice or roti."
  ],
  "firstAdded": "2014-10-16T21:50:11.860000",
  "hash": "2094f2cf6fb497f5c201866ffdf04bfa46789855",
  "href": "http://feedingthesonis.wordpress.com/2013/10/26/lamb-and-aloo-tarkari-lamb-and-potato-curry/",
  "image": "http://feedingthesonis.files.wordpress.com/2014/02/20140216-234126.jpg?w=558",
  "ingredients": [
    "0",
    "Ingredients",
    "1kg Lamb Forequarter Chops (BBQ chops are better as they are thinner cuts)",
    "1 Large Potato Cut Into Bite Sized Chunks",
    "1 Onion Sliced",
    "1 Medium Sized Tomato",
    "2-3 Garlic Cloves",
    "1 Inch Piece Ginger",
    "1 Cinnamon Stick",
    "3-4 Cloves",
    "3-4 Cardamom Pods (or a pinch of just the seeds)",
    "10 Curry Leaves",
    "1/2 Tspn Turmeric Powder",
    "1 Tspn Garam Masala",
    "2-3 Tbspn Oil",
    "Pinch Of Fenugreek, Mustard And Cumin Seeds",
    "Salt To Taste"
  ],
  "keywords": [
    "lamb",
    "forequarter",
    "bbq",
    "chops",
    "better",
    "thinner",
    "cuts",
    "potato",
    "bite",
    "sized",
    "chunks",
    "onion",
    "medium",
    "tomato",
    "garlic",
    "ginger",
    "cinnamon",
    "cardamom",
    "pods",
    "seeds",
    "curry",
    "leaves",
    "tspn",
    "turmeric",
    "garam",
    "masala",
    "tbspn",
    "oil",
    "fenugreek",
    "mustard",
    "cumin",
    "salt"
  ],
  "title": "Lamb And Aloo Tarkari (Lamb And Potato Curry)",
  "users": [
    null
  ]
}