{
  "hash": "3a6624574aae74781572a3c69fb67c8c525e1346",
  "title": "Sweet Potato Pie",
  "image": "http://www.marthastewart.com/sites/files/marthastewart.com/imagecache/wmax-520-highdpi/images/content/tv/martha_stewart_show/show_photos/2101_2200/tvm2125_032007_sweetpotatopie_xl.jpg",
  "href": "http://www.marthastewart.com/316561/sweet-potato-pie",
  "firstAdded": "2014-11-26T23:10:31.075000",
  "users": [
    null
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "work",
    "surface",
    "recipe",
    "pate",
    "brisee",
    "potatoes",
    "butter",
    "pieces",
    "room",
    "granulated",
    "sugar",
    "eggs",
    "allspice",
    "cinnamon",
    "nutmeg",
    "vanilla",
    "juice",
    "lemon"
  ],
  "directions": [
    "0",
    "On a lightly floured work surface, roll pate brisee into a 15-inch round. With a dry pastry brush, sweep off the excess flour; fit dough into a 9-inch pie plate, pressing it into the edges. Trim to a 1-inch overhang all around. Crimp edge as desired. Cover with plastic wrap; chill pie shell until firm, about 30 minutes.",
    "Preheat oven to 375 degrees. Fill a medium saucepan with 2 inches of water; place over high heat and bring to a boil. Fit saucepan with a steamer basket, add sweet potatoes, and cover. Steam until potatoes are easily pierced with a fork, about 1 hour. You may need to add more water as sweet potatoes steam. Let sweet potatoes cool slightly before removing skins by rubbing potatoes with a paper towel.",
    "Place sweet potatoes in the bowl of an electric mixer fitted with the paddle attachment. Beat on medium speed until the sweet potatoes are well mashed and any stringy pieces of sweet potato have wrapped themselves around the paddle attachment. Remove paddle attachment, wipe clean, and return to mixer.",
    "With the mixer on low speed, add butter, and beat until well combined and cooled slightly. Slowly add sugar. Add eggs, one at a time, beating after each addition. Add allspice, cinnamon, nutmeg, vanilla, and lemon juice. Continue beating until well combined.",
    "Pour mixture into prepared pie crust. Transfer to oven and bake until center has set, 45 to 50 minutes."
  ],
  "ingredients": [
    "0",
    "All-purpose flour, for work surface",
    "1/2 recipe Pate Brisee",
    "2 large sweet potatoes, (about 1 1/2 pounds)",
    "1/2 cup (1 stick) butter, cut into pieces, room temperature",
    "1 1/4 cups granulated sugar",
    "2 large eggs",
    "1/2 teaspoon ground allspice",
    "1 teaspoon ground cinnamon",
    "1/2 teaspoon freshly ground nutmeg",
    "1 teaspoon pure vanilla extract",
    "Juice of half a lemon"
  ],
  "__v": 1
}