{
  "hash": "4d10a6ba8bb5b791afb452bdf4c3f6f4d959e4d6",
  "title": "Restaurant Style Orange Chicken",
  "image": "http://www.thecrepesofwrath.com/images/2009/11/Restaurant_Style_Orange_Chicken/Restaurant_Style_Orange_Chicken_17.jpg",
  "href": "http://www.thecrepesofwrath.com/2009/11/11/restaurant-style-orange-chicken/",
  "extension": "Chrome",
  "firstAdded": "2015-12-27T21:53:48.788000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "breasts",
    "pieces",
    "egg",
    "salt",
    "pepper",
    "canola",
    "oil",
    "cornstarch",
    "allpurpose",
    "flour",
    "frying",
    "pot",
    "wok",
    "ginger",
    "garlic",
    "red",
    "extra",
    "spicy",
    "onion",
    "green",
    "onions",
    "rice",
    "wine",
    "vinegar",
    "sesame",
    "water",
    "mixed",
    "soy",
    "granulated",
    "sugar",
    "zest",
    "orange",
    "juice",
    "oranges"
  ],
  "directions": [
    "0",
    "Cut the chicken into bite-sized pieces. Combine with the egg, salt, pepper, and 1 tablespoon of oil. Add in the cornstarch and flour (I found it easiest to mix this together with [clean] hands).",
    "In a wok or a pot, heat enough canola or vegetable oil for frying (about an inch deep in the pot/wok) over high heat for 5 minutes, then turn the heat down to medium-high. Add the chicken to the oil in batches, cooking each batch for about 8-10 minutes until cooked through (take one piece out and slice it open to check that it's cooked). Remove the chicken from the oil with a slotted spoon and allow to drain on a plate covered lined with paper towels. Set aside until ready to toss in the sauce. It's okay if the chicken cools a bit; it'll get heated up again.",
    "In a separate pot, add in the ginger, garlic, crushed red pepper flakes, green onions, 1 tablespoon of rice wine vinegar, and ½ teaspoon of sesame oil. Stir fry for about five minutes, until fragrant. Combine the sauce ingredients and add them to the onion mixture. Bring everything to a light boil, then add in the 1 tablespoon of cornstarch mixed with ¼ cup of water. Heat everything until is starts to thicken a bit, about 3-4 minutes, then add in the fried chicken pieces. Toss to coat, and cook for another 3 or 4 minutes until the sauce is as thick as you'd like it to be. Serve with rice and/or vegetables."
  ],
  "ingredients": [
    "0",
    "2 pounds chicken breasts, cut into bite-sized pieces",
    "1 egg",
    "½ teaspoon salt",
    "¼ teaspoon pepper",
    "1 tablespoon canola or vegetable oil",
    "½ cup cornstarch",
    "¼ cup all-purpose flour",
    "oil for frying, enough to fill a pot or wok with 1 inch of oil",
    "1 tablespoon ginger, minced (or 1 teaspoon ground ginger)",
    "2 cloves garlic, minced",
    "1 teaspoon crushed red pepper (1½ teaspoon if you like it 1extra spicy)",
    "¼ cup green onion, sliced (about 3 or 4 green onions)",
    "1 tablespoon rice wine vinegar",
    "½ teaspoon sesame oil",
    "¼ cup water mixed with 1 tablespoon cornstarch",
    "1",
    "5 tablespoons soy sauce",
    "5 tablespoons granulated sugar",
    "5 tablespoons rice wine vinegar",
    "zest of 1 orange",
    "juice of 2 oranges"
  ],
  "__v": 1
}