{
  "hash": "427d179bc511765f35152e73bcf192b2523bb58c",
  "title": "Vegan Eggless Coriander Quiche",
  "image": "http://4.bp.blogspot.com/_Z-dKySUt_GQ/SO6tBkk5RqI/AAAAAAAACdE/77Spb_YZg-4/s640/051308kolata0006.JPG",
  "href": "http://holycowvegan.net/2008/10/spicy-eggless-coriander-quiche.html",
  "extension": "Chrome",
  "firstAdded": "2015-06-30T11:56:21.897000",
  "users": [
    null
  ],
  "keywords": [
    "crust",
    "wholewheat",
    "pastry",
    "prefer",
    "roll",
    "pat",
    "pan",
    "flour",
    "allpurpose",
    "trasfatfree",
    "shortening",
    "canola",
    "flavorless",
    "oil",
    "salt",
    "icecold",
    "water",
    "filling",
    "olive",
    "red",
    "onion",
    "garlic",
    "box",
    "silken",
    "soft",
    "tofu",
    "mori",
    "almond",
    "use",
    "soy",
    "milk",
    "rice",
    "cornflour",
    "hand",
    "moderately",
    "hot",
    "green",
    "chili",
    "peppers",
    "jalapeno",
    "skinny",
    "ones",
    "indian",
    "grocery",
    "stores",
    "work",
    "coriander",
    "leaves"
  ],
  "directions": [
    "0",
    "To make the crust, put the first three ingredients in a bowl or in a food processor. If doing this by hand, cut the shortening in until the mixture resembles a coarse meal. If doing this in a food processor, break down the shortening into small pieces by pulsing a few times.",
    "Drizzle water as you mix by hand or by running the motor of the food processor. When the dough comes together, pat it into a disc and place in refrigerator.",
    "To make the filling, heat the oil and add the onions.",
    "Saute the onions until they just begin to turn lightly brown.",
    "Add the garlic and saute on low heat for a minute or two until the garlic softens. Don't let it burn. Turn off heat.",
    "Put tofu, almond milk, chilies and rice flour in a blender and blend until smooth and creamy. Add salt as needed. Add the coriander and pulse once or twice until the leaves are broken down into small pieces but not liquefied.",
    "Pour the tofu mixture into the onions and garlic and mix well.",
    "Now take the pastry dough and either pat into a greased tart pan, preferably one with a removable bottom, or roll it into a circle and place inside the tart pan, trimming off any overhanging edges.",
    "Pour the filling into the pastry shell.",
    "Bake in a preheated 350-degree oven about 35-40 minutes until the filling is set and lightly golden.",
    "Cool on a rack for about 10 minutes before unmolding. Serve warm."
  ],
  "ingredients": [
    "0",
    "For the crust:",
    "1¼ cup whole-wheat pastry flour (if you prefer to roll out your crust rather than pat it into the pan, substitute half the flour with all-purpose)",
    "2 tbsp trasfat-free shortening + 1 tsp canola or other flavorless vegetable oil",
    "¼ tsp salt",
    "6-8 tbsp ice-cold water",
    "For the filling:",
    "2 tsp olive oil",
    "1 large red onion, thinly sliced",
    "4-5 large cloves of garlic, very thinly sliced",
    "1 box silken soft tofu, like Mori Nu",
    "¼ cup almond milk (can use soy milk)",
    "1 tbsp rice flour (can use cornflour if you have that on hand)",
    "3 moderately hot green chili peppers (jalapeno or the skinny ones found in Indian grocery stores would work)",
    "¾ cup coriander leaves, chopped",
    "Salt to taste"
  ],
  "__v": 1
}