{
  "__v": 1,
  "directions": [
    "0",
    "In una padella antiaderente preparate il sugo facendo ammorbidire lo scalogno tritato in 2/3 cucchiai di olio evo e aggiungete in ordine (lasciando passare 5 minuti prima di aggiungere l'ingrediente successivo), le carote tagliate a rondelle, le zucchine a cubetti e i peperoni a pezzetti, salate e lasciate cuocere lentamente tutti gli ortaggi; nel frattempo mettete a bollire dell'acqua salata per la cottura della pasta. Continuate la preparazione del condimento tritando metà degli ortaggi cotti nel mixer insieme al parmigiano,la robiola e 2 cucchiai di olio evo; ne verrà fuori una salsina omogenea e colorata che mescolerete alle verdure rimaste nella padella! Dopo aver cotto gli spaghetti, scolateli al dente direttamente nel sugo ,aggiungete un mestolino di acqua di cottura e fate saltare in padella per qualche minuto...una spolverata di parmigiano se ne volete aggungere ed il piatto è pronto!",
    "Ottimo come piatto unico,per chi non si vuole appesantire o per chi non ha tempo di fermarsi troppo a lungo a tavola!",
    "Semplicissimo ma ideale per questi primi e timidi giorni di primavera!",
    "Come sempre scappo dal mio grande amore....com'è bello essere innamorati di uno scricciolo che sta dormendo nel tuo lettone tra due cuscini!!"
  ],
  "firstAdded": "2014-10-08T19:54:47.772000",
  "hash": "b10dc56e1915b91b3994f6e315c837cfa1802838",
  "href": "http://ilcucchiainodimilu.blogspot.it/2013/04/spaghetti-dellorto.html",
  "image": "http://1.bp.blogspot.com/-Q--OUaitCvY/UGcAkTqa6tI/AAAAAAAAA50/b_JSdQ3MiBA/s640/P1000308.JPG",
  "ingredients": [
    "0",
    "1 carota piccola",
    "1 peperone rosso medio",
    "1 zucchina",
    "1/2 scalogno",
    "2 pugnetti di parmigiano",
    "4 cucchiai di robiola",
    "sale qb",
    "olio evo qb",
    "350 gr di spaghetti"
  ],
  "keywords": [
    "carota",
    "piccola",
    "peperone",
    "rosso",
    "medio",
    "zucchina",
    "scalogno",
    "pugnetti",
    "parmigiano",
    "cucchiai",
    "robiola",
    "sale",
    "olio",
    "evo",
    "spaghetti"
  ],
  "title": "Spaghetti dell'orto",
  "users": [
    null
  ]
}