{
  "hash": "467bd8a50d66fa17b647ff008a158364350a9b14",
  "title": "Apricot Yogurt Scones",
  "image": "http://p-fst2.pixstatic.com/5254916b697ab061b400f10b._w.540_h.359_s.fit_.jpg",
  "href": "http://www.thekitchn.com/breakfast-recipe-apricot-yogur-143563",
  "extension": "Chrome",
  "firstAdded": "2015-05-11T23:46:39.416000",
  "users": [
    null
  ],
  "keywords": [
    "apricots",
    "roughly",
    "allpurpose",
    "flour",
    "baking",
    "soda",
    "granulated",
    "sugar",
    "cinnamon",
    "salt",
    "cold",
    "unsalted",
    "butter",
    "pieces",
    "egg",
    "plain",
    "yogurt",
    "regular",
    "lowfat",
    "milk",
    "skim",
    "vanilla",
    "glaze",
    "confectioners"
  ],
  "directions": [
    "0",
    "Preheat the oven to 400°F. Line a baking sheet with parchment.",
    "Plump the apricots in one cup of very hot water for about 10 minutes. Drain, pat dry, and set aside.",
    "Whisk together the flour, baking powder and soda, sugar, cinnamon, and salt in a large mixing bowl. Cut the butter into the flour with your fingertips or a pastry cutter until no pieces larger than a pea remain. Add the drained apricots and toss to coat with flour.",
    "In a separate bowl, whisk together the egg, yogurt, milk, and vanilla. Pour over the dry mix and use a spatula to gently combine them together. Mix just until there is no more dry flour visible in the dough.",
    "Use a 1/2-cup measure to scoop out the dough and drop it onto the baking sheet. Space the scones about an inch apart. Use floured hands to gently pat the mounds into disks or tidy up the edges.",
    "Bake for 20-25 minutes, until the scones are firm to the touch, golden on top, and browned on their bottoms. When the scones have cooled completely, whisk together the glaze ingredients and drizzle a spoonful on the top of each scone. The glaze will harden within fifteen minutes or so.",
    "Scones are best the day that they are made, but will keep in an airtight container for about three days."
  ],
  "ingredients": [
    "0",
    "1 cup (about 5 oz) dried apricots, roughly chopped",
    "2 cups (10 oz) all-purpose flour",
    "1 tablespoon baking powder",
    "1/2 teaspoon baking soda",
    "1/4 cup (2 oz) granulated sugar",
    "1 teaspoon cinnamon",
    "1/2 teaspoon salt",
    "6 tablespoons (3 oz) cold unsalted butter, cut into 12 or so pieces",
    "1 large egg",
    "3/4 cup (6 oz) plain yogurt (regular or low-fat)",
    "1/4 cup (2 oz) milk (whole or skim)",
    "1 teaspoon vanilla extract",
    "For the glaze:",
    "1 cup (6 oz) confectioner's sugar",
    "3 tablespoons milk",
    "1 teaspoon vanilla extract"
  ],
  "__v": 1
}