{
  "__v": 3,
  "directions": [
    "0",
    "Genoise Sponge",
    "--------------------------",
    "Preheat oven to 175 degrees Celcius and lightly grease the bottom of a 9in round cake pan.",
    "Using a hand mixer, whisk constantly the eggs, vanilla and sugar over a double boiler with simmering water until the mixture reaches 'ribbon stage' about 8-10 minutes. (To determine if you have achieved the 'ribbon stage', the mixture has to be stiffen and thickened as you pull the batter up with the beater and it stays atop the rest of the mixture for about 10 seconds or more, forming a ribbon-like effect. It should be tripled in volume)",
    "Fold 1/4 of the egg mixture into the melted butter to lighten the butter. Fold the mixture back into the rest of the egg mixture. Sift 1/3 of the flour onto the egg mixture, and then gently but quickly fold together. Repeat this steps until the flour has been incorporated. (Take precaution on the folding method as how you fold the mixture together is crucial to determine the success of a light and spongy génoise. You want to evenly incorporate the flour into the egg mixture without deflating the aerated eggs. It’s important that you are quick and gentle at the same time, cutting the spatula down toward the center, lifting the batter from the bottom of the bowl, and turning the bowl with your other hand towards the hand that is folding)",
    "Gently pour the batter into the cake pan and bake about 25-30 minutes or until the cake is golden brown and starts to shrink from the sides of the pan. (Do not open the oven door before the minimum time or the cake could collapse.) To determine the doneness, press the centre of the cake with a finger and ensure the cake will have the springback effect after pressing. Remove cake from oven and place on wire rack to allow the cake to cool completely.",
    "Slice the cake into 3 horizontal layers.",
    "Cut the cake with smaller round cutter.",
    "---------------------------------------",
    "Tropical Mango Custard Filling",
    "---------------------------------------",
    "In a bowl, mix gelatin with water, soak until bloomed or plumped up. Heat in the microwave oven for 10 seconds; remove, stir it and set aside.",
    "In a heavy-base saucepan, place custard powder, fresh milk, coconut milk, egg yolks, sugar and cook over medium heat, whisking continuously until mixture is thick and glossy smooth. Turn off the heat once mixture is bubbling.",
    "Add the dissolved gelatin and fresh mango pulp; mix till well incorporated and set to assemble.",
    "To assemble the Tropical Mango Mania",
    "Using a piping bag, scoop the mango custard filling into the bag and pipe the 1st layer onto the cut génoise sponge.",
    "Place another sponge layer on top and pipe another portion of mango custard.",
    "Repeat with the last sponge layer and custard, cover the cakes with cling wrap and refrigerate for 1 hour or until filling sets. Follow the same steps for the rest of the cut sponges and filling, shall be able to make about 4 – 5 mini round cakes.",
    "-----------------------",
    "Mango Topping",
    "-----------------------",
    "Using an electric mixer, whisk the cream and mango pulp until light and fluffy.",
    "Remove cakes from the refrigerator and place the cream into a piping bag with large star tip, pipe along the sides and edge according to your creativity or as shown on the photos, decorate with thin mango slices and some flavoured chocolate or even coconut shavings.",
    "The chilled Tropical Mango Mania is ready to be served."
  ],
  "firstAdded": "2014-10-16T04:48:48.386000",
  "hash": "0a1984a4553cc2fb78aa63b09cd32b2271ed7bcf",
  "href": "http://www.thestar.com.my/Lifestyle/Food/Recipes/2012/01/27/Tropical-Mango-Mania/",
  "image": "http://www.thestar.com.my/~/media/Images/TSOL/Photos-Gallery/Kuali/2012/1/mango.ashx?w=620&h=413&crop=1&",
  "ingredients": [
    "0",
    "Genoise Sponge",
    "----------------------------",
    "4 whole eggs",
    "1 tsp vanilla extract",
    "100g Sugar",
    "125g soft flour (sifted)",
    "80g melted butter",
    "-------------------------------------",
    "Tropical Mango Custard Filling",
    "--------------------------------------",
    "10g gelatine powder",
    "50g water",
    "35g custard powder",
    "150g fresh milk",
    "100g concentrated coconut milk",
    "3 egg yolks",
    "50g sugar",
    "250g fresh mango pulp",
    "--------------------------------",
    "Mango Cream Topping",
    "200g non-dairy whipping cream",
    "100g fresh mango pulp"
  ],
  "keywords": [
    "genoise",
    "sponge",
    "eggs",
    "vanilla",
    "sugar",
    "soft",
    "flour",
    "sifted",
    "butter",
    "tropical",
    "mango",
    "custard",
    "filling",
    "gelatine",
    "water",
    "milk",
    "concentrated",
    "coconut",
    "egg",
    "yolks",
    "pulp",
    "cream",
    "nondairy",
    "whipping"
  ],
  "title": "Tropical Mango Mania",
  "users": [
    null
  ]
}