{
  "hash": "5d90f4134f63a6e18baebf8a805a0ca5581cdaab",
  "title": "Chicken Cauliflower Fried Rice",
  "image": "http://food.fnr.sndimg.com/content/dam/images/food/fullset/2017/1/6/1/KC1201_Cauliflower-Fried-Rice_s4x3.jpg.rend.hgtvcom.616.462.suffix/1483736544990.jpeg",
  "href": "http://www.foodnetwork.com/recipes/katie-lee/chicken-cauliflower-fried-rice-3588745",
  "extension": "Chrome",
  "firstAdded": "2017-08-24T03:44:11.150000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cut the cauliflower into chunks. Working in batches, pulse the cauliflower in a food processor until coarse in texture, like rice. This recipe uses about 4 cups of cauliflower rice. If you have any leftover, save it for another use.",
    "Heat a wok or large skillet over medium-high heat. Add 1 teaspoon of the canola oil. Add the eggs and quickly scramble. Transfer the eggs to a plate and set aside. Heat the remaining 2 teaspoons canola oil. Add the garlic and ginger and cook, stirring constantly, about 1 minute. Add the peas and carrots, scallions and cauliflower. Stir-fry until the vegetables are tender, about 5 minutes.",
    "As the vegetables are cooking, whisk the soy sauce and sesame oil together in a small bowl. Stir the sauce and chicken into the cauliflower mixture. Cook an additional minute or 2. Stir the cooked eggs back into the mixture. Serve with hot sauce and additional soy sauce if desired."
  ],
  "ingredients": [
    "0",
    "1 medium head cauliflower, stem removed",
    "3 teaspoons canola oil",
    "2 large eggs, lightly beaten",
    "3 cloves garlic, minced",
    "One 1-inch piece fresh ginger, peeled and grated",
    "1 cup frozen mixed peas and carrots, thawed",
    "1/4 cup thinly sliced scallions",
    "1/4 cup plus 2 tablespoons low-sodium soy sauce, plus more for serving, optional",
    "2 tablespoons sesame oil",
    "2 cooked chicken breasts, diced (I used a rotisserie chicken)",
    "Hot sauce, for serving, optional"
  ],
  "__v": 1
}