{
  "hash": "66a7dac7d99ee6a248e2e2dc6dfdd2a544ac09d9",
  "title": "פאד תאי של אלופים",
  "image": "//img.mako.co.il/2015/06/22/shasto_padthai_afik_c.jpg",
  "href": "https://www.mako.co.il/food-cooking_magazine/become-a-chef/Recipe-382538f287a1e41006.htm",
  "extension": "Firefox",
  "firstAdded": "2019-08-12T08:13:34.479000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "אופן ההכנה:",
    "משרים את אטריות האורז בהרבה מים קרים כ-45 דקות, עד שהן נהיות רכות. מסננים ממי ההשריה.",
    "מכינים את הרוטב: שמים את כל המצרכים בסיר קטן ומביאים לרתיחה תוך כדי בחישה. ממשיכים לערבב מעל להבה נמוכה עד שמתקבל רוטב סמיך בצבע שוקולדי למדי (זה לוקח בערך 3 דקות).",
    "מחממים מחבת רחבה מעל הלהבה הכי גדולה שיש. כשהמחבת לוהטת מטגנים את הגזר תוך כדי ערבוב כ-30 שניות.",
    "מוסיפים את רצועות הכרוב, הטופו והג'ינג'ר ומקפיצים כדקה, עד שהכרוב מתחיל להיראות רך.",
    "מזיזים בעזרת תרווד או כף עץ את תכולת המחבת לצד אחד, מוסיפים מעט שמן לצד הריק ויוצקים אליו את הביצה הטרופה.",
    "מקשקשים את הביצה עד שהיא מבושלת לחלוטין, ואז מערבבים אותה עם שאר הירקות שבמחבת.",
    "מוסיפים את אטריות האורז ומקפיצים הכל ביחד כ-20 שניות.",
    "מוסיפים את כל הרוטב, מערבבים היטב ומבשלים כחצי דקה. אם כל הסיפור מרגיש סמיך מדי, ניתן להוסיף עוד מים או רוטב סויה (טועמים ומחליטים).",
    "מוסיפים את הבצל הירוק והנבטים, מקפיצים פעם אחרונה ומעבירים לשתי צלחות.",
    "מקשטים בבוטנים קלויים ומגישים לצד רוטב הדגים, שבבי הצ'ילי, הבצל הירוק, הכוסברה והנבטים.",
    "טיפ: אם רוצים להכפיל כמויות מטגנים כל ירק (ואת הטופו) בנפרד, וברגע שכל המרכיבים מוכנים מערבבים עם אטריות האורז והרוטב בסיר גדול, ולא במחבת (כדי שלא יישפך).",
    "טיפ 2: אם מסובך לכם לקשקש את הביצה במחבת תוך כדי ההכנה, אפשר להכין ממנה חביתה רגילה, לחתוך לרצועות קטנות ולהוסיף למנה יחד עם אטריות האורז"
  ],
  "ingredients": [
    "0",
    "100 גרם (1/4 חבילה) אטריות אורז רחבות",
    "2-3 כפות שמן צמחי",
    "1 גזר קטן, חתוך לגפרורים (או מגורר בפומפייה)",
    "1/3 כרוב קטן, חתוך לרצועות דקות",
    "פרוסה עבה (בערך 50 גרם) טופו, חתוך לקוביות (לא חובה)",
    "חתיכה קטנה של ג'ינג'ר, קצוצה דק",
    "1 ביצה, טרופה",
    "1 גבעול בצל ירוק, קצוץ גס",
    "חופן נבטי שעועית (נבטים סיניים) טריים ויפים",
    "לרוטב:",
    "1 כפית גדושה (אבל לא מדי) חמאת בוטנים חלקה",
    "2 כפות רוטב סויה",
    "כף סילאן (או סוכר חום)",
    "כף חומץ בן יין לבן (אפשר גם חומץ תפוחים או אורז)",
    "5 כפות מים",
    "מעט רוטב חריף שאוהבים או שבבי צ'ילי חריפים, לפי הטעם",
    "להגשה:",
    "בוטנים קלויים",
    "רוטב דגים תאילנדי (או רוטב סויה)",
    "שבבי צ'ילי מיובשים",
    "בצל ירוק חתוך גס",
    "גבעולי כוסברה יפים",
    "נבטים טריים"
  ],
  "__v": 1
}