{
  "hash": "b7b11397f33e981891771b1a527ee870c66a2300",
  "title": "Marlboro Man",
  "image": "http://tastykitchen.com/recipes/wp-content/uploads/sites/2/2009/11/Pasta-alla-Marlboro-Man1-420x279.jpg",
  "href": "http://thepioneerwoman.com/cooking/monday-night-dinner-pasta-alla-marlboro-man/",
  "extension": "Chrome",
  "firstAdded": "2016-08-17T15:08:06.241000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat olive oil in large skillet or pot over medium-low heat. Add onion and cook a couple of minutes, until starting to turn translucent. Add garlic and stir, cooking 1 minute, making sure not to brown the garlic.",
    "Add ground beef and cook until brown. Drain most of excess fat. Add salt, pepper, and ground thyme. Stir to combine. Dump in canned tomatoes with their juice. Stir, reduce heat to low, and cover pot. Cook for 30 minutes, stirring a couple of times. Uncover the pot and cook an additional 30 minutes.",
    "Fix Zoodles.",
    "About an hour before starting the sauce, I used my Paderno Spiralizer to make a bunch of zoodles with zucchini and yellow summer squash; it only takes a couple minutes to make a big pile of them. To pull out the excess liquid from the zoodles, I like to spread them out in a single layer on top of a layer of paper towels (placed on top of a dish towel). I lightly salt them (about 1/4 to 1/2 teaspoon for a large batch of zoodles) and then place another layer of paper towels on top. I gently press them down with my hands and then walk away. Within 5 to 10 minutes you will notice the moisture being drawn out of the zoodles by the salt and wicking into the paper towels. After about 20 minutes, I like to roll them up in the paper towels to help press more moisture out. If the paper towels get really wet, I'll change the top layer of paper towels before rolling up. Try and let them wick excess moisture out for at least 30 minutes, up to 1 hour if you have the time. You will find it makes a huge difference in your finished cooked zoodles. I know some folks like to boil their zoodles and that makes me cringe because you are adding water to them instead of removing it. They shouldn't be cooked like regular wheat noodles that are supposed to absorb liquid. To cook, all that needs to be done is heat up a nonstick skillet with a tablespoon of oil on medium-high heat and then stir-fry the zoodles, tossing frequently until al dente. This only takes a few minutes...about 3 to 5 minutes or to your desired tenderness. Don't overfill the skillet. If necessary, cook a larger portion in a couple of batches. This method yields perfectly cooked non-watery zoodles."
  ],
  "ingredients": [
    "0",
    "2 Tablespoons Olive Oil",
    "1/2 whole Large Onion, Diced",
    "2 cloves Garlic, Minced",
    "2 pounds Ground Beef",
    "Salt To Taste",
    "Freshly Ground Black Pepper, To Taste",
    "1 teaspoon (generous) Ground Thyme",
    "2 cans (14 Oz. Size) Whole Tomatoes",
    "1/4 cup Freshly Grated Parmesan Cheese",
    "1-1/2 pound (to 2 Pounds) Rigatoni or",
    "Zoodles"
  ],
  "__v": 5
}