{
  "__v": 1,
  "directions": [
    "0",
    "Combine the yogurt, cream and honey in a bowl, and beat vigorously with a hand mixer until the mixture thickens and forms soft peaks. (You can also use a stand mixer, or whip by hand using a whisk.)",
    "Warm the butter in a large skillet over medium heat. Add the apples and 1 tablespoon sugar to the pan. Stir well and cook the apples for 6-8 minutes, stirring occasionally to avoid sticking, until they just begin to soften. Once softened, sprinkle the apples with the remaining sugar and the cinnamon, and cook for an additional 2 to 3 minutes. Remove from the heat and let sit for 5 minutes to cool slightly.",
    "To serve, spoon a generous serving of whipped yogurt into each bowl and top with warm apples and toasted walnuts.",
    "Recipe Notes",
    "I use a full-fat Greek yogurt for this recipe because I like the flavor better (and the full-fat yogurts generally have less sugar, actually). But I've also tested this recipe with a 2% yogurt and it works just fine."
  ],
  "firstAdded": "2014-09-12T03:27:19.376000",
  "hash": "f7faf6dd4de015c6e36b0e7ebc9f88398d8c05a2",
  "href": "http://www.thekitchn.com/recipe-whipped-yogurt-with-cinnamony-apples-and-walnuts-recipes-from-the-kitchn-206995",
  "image": "http://p-ec1.pixstatic.com/53eada0d697ab0721e001c6f/_w.540_s.fit_/20140812_KitchnWhippedYogurtwithCinnamonyApples-113.jpg",
  "ingredients": [
    "0",
    "1 cup plain Greek yogurt",
    "1/2 cup heavy cream",
    "1 tablespoon honey",
    "2 tablespoons unsalted butter",
    "2 firm apples, cored and chopped into small 1/2-inch cubes",
    "2 tablespoons sugar",
    "1/8 teaspoon ground cinnamon",
    "1/4 cup walnut halves, toasted and coarsely chopped"
  ],
  "keywords": [
    "plain",
    "greek",
    "yogurt",
    "cream",
    "honey",
    "unsalted",
    "butter",
    "firm",
    "apples",
    "cored",
    "cubes",
    "sugar",
    "cinnamon",
    "walnut",
    "halves",
    "coarsely"
  ],
  "title": "Whipped Yogurt with Apples and Walnuts",
  "users": [
    null
  ]
}