{
  "hash": "4a7e4dc5e10fa70a2dece42dcc6b934a9abf5c11",
  "title": "Muhammara Spread",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2011/10/muhammara.jpg",
  "href": "http://www.onegreenplanet.org/vegan-food/recipe-muhammara-spread/",
  "extension": "Chrome",
  "firstAdded": "2015-06-08T09:22:32.836000",
  "users": [
    null
  ],
  "keywords": [
    "mediumlarge",
    "red",
    "peppers",
    "walnuts",
    "hulled",
    "hemp",
    "seeds",
    "crackerbread",
    "crumbs",
    "pulsed",
    "flax",
    "crackers",
    "food",
    "processor",
    "clove",
    "garlic",
    "cumin",
    "coriander",
    "juice",
    "lemon",
    "sriracha",
    "hot",
    "agave",
    "nectar",
    "used",
    "extra",
    "virgin",
    "olive",
    "oil",
    "yummy",
    "salt",
    "pepper"
  ],
  "directions": [
    "0",
    "Roast the peppers: set your oven to the broil function. Place the whole peppers, stems and all, on a parchment lined baking sheet under the broiler. Once the skins start turning black, rotate them so that the non-blackened sides are facing up. Once all of the peppers are charred (about 15 minutes), remove from the oven.",
    "Place peppers in a bowl and cover the top with plastic wrap, forming a tight seal. Allow peppers to steam in the bowl for about 10 minutes. This makes the skin easier to peel off.",
    "Place toasted walnuts, hemp seeds, cracker crumbs, garlic, cumin, coriander, lemon juice, sriracha, agave nectar and oil in the bowl of a food processor. Pulse a couple times just to break up the nuts and garlic clove.",
    "Peel the peppers: when they’re cool enough to handle, start peeling the skins off of the peppers. They should come off pretty easily, but if you’re having trouble use the back of a knife to scrape the skin off. Remove the stems and as many seeds as you can.",
    "Add peeled peppers to the nut and seed mixture in the food processor. Flip it to high until the mixture starts to form a smooth paste. Scrape down the sides once or twice with a spatula. Add the 2 tbsp oil and season with salt and pepper to your liking. Pulse a few times to combine. Serve with flatbreads, veggie sticks, crackers, on sandwiches, whatever you like."
  ],
  "ingredients": [
    "0",
    "3 medium-large red peppers",
    "½ cup walnuts, toasted",
    "½ cup hulled hemp seeds",
    "2/3 cup cracker/bread crumbs (I pulsed some flax crackers in the food processor)",
    "1 clove garlic",
    "1 tsp ground cumin",
    "1 tsp ground coriander",
    "juice of 1 lemon",
    "1 tbsp sriracha or other hot sauce (optional)",
    "1 tbsp agave nectar",
    "2 tbsp oil (I used hemp, but extra virgin olive oil would be yummy)",
    "salt and pepper to taste"
  ],
  "__v": 1
}