{
  "hash": "0f49fa921bb9c9ba5da4221c601f772be2a6d5e7",
  "title": "Instant Pot Pulled Chicken",
  "image": "//food.fnr.sndimg.com/content/dam/images/food/fullset/2018/5/14/0/FNM_060118-Instant-Pot-Pulled-Chicken_s4x3.jpg.rend.hgtvcom.826.620.suffix/1526308666237.jpeg",
  "href": "https://www.foodnetwork.com/recipes/food-network-kitchen/instant-pot-pulled-chicken-5257623",
  "extension": "Chrome",
  "firstAdded": "2019-07-22T01:19:01.373000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine the tomato sauce, 1/2 cup water, the chiles, tortilla and 1/4 cup cilantro in a blender. Add the chili powder, cumin, sugar, 1/4 teaspoon salt and a few grinds of pepper; blend until smooth.",
    "Rub the bottom of an Instant Pot insert with the vegetable oil. Add the chicken breasts to the Instant Pot along with the pureed sauce. Stir to combine. Put on the lid, making sure the steam valve is in the sealing position, and set to cook on high pressure for 8 minutes. When the time is up, press the cancel button and let the steam release naturally, 10 to 15 minutes. (You can also cook frozen chicken breasts in an Instant Pot: Rinse the chicken briefly under cool water and cook on high pressure for 12 minutes.) Remove the lid and transfer the chicken to a bowl.",
    "Set the pot to sauté at high heat. Bring the sauce to a simmer. Break the chicken into large chunks with two forks and return to the sauce; stir to coat. Simmer, stirring to prevent sticking, until the sauce thickens, about 8 minutes. Turn off the Instant Pot. When the sauce stops bubbling, stir in the chopped cilantro and a squeeze of lime juice; season with salt and pepper. Serve the chicken on buns with lime wedges."
  ],
  "ingredients": [
    "0",
    "1 8-ounce can tomato sauce",
    "1 4-ounce can fire-roasted diced green chiles",
    "1 corn tortilla, torn",
    "1/4 cup packed fresh cilantro (leaves and tender stems), plus 2 tablespoons chopped leaves",
    "1 teaspoon chili powder",
    "1 teaspoon ground cumin",
    "1/4 teaspoon sugar",
    "Kosher salt and freshly ground pepper",
    "1 teaspoon vegetable oil",
    "3 skinless, boneless chicken breasts (about 8 ounces each)",
    "1 lime, cut into wedges",
    "4 hamburger buns, for serving"
  ],
  "__v": 1
}