{
  "hash": "bc9ae3bf247c50500899520236a6908fbddc0c50",
  "title": "Broccoli salad",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/98_1_1408639172_lrg.jpg",
  "href": "http://www.jamieoliver.com/recipes/vegetables-recipes/broccoli-salad/",
  "firstAdded": "2014-12-31T14:32:14.153000",
  "users": [
    null
  ],
  "keywords": [
    "heads",
    "broccoli",
    "rashers",
    "higherwelfare",
    "smoked",
    "streaky",
    "bacon",
    "olive",
    "oil",
    "firm",
    "red",
    "tomatoes",
    "deseeded",
    "bunch",
    "chives",
    "flowers",
    "reserved",
    "dressing",
    "clove",
    "garlic",
    "dijon",
    "mustard",
    "extra",
    "virgin",
    "white",
    "wine",
    "vinegar",
    "salt",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "Use a small knife to remove the broccoli florets and cut them up into smaller ones. Basically, this is your opportunity to make the broccoli really delicate and more salady-looking, so spend a bit of time doing this. You'll be left with the stalk, so discard the thick dry base, then cut the remaining stalk in half lengthways and finely slice.",
    "Blanch your broccoli florets and sliced stalks really quickly in boiling salted water for 60 seconds, just long enough to soften the broccoli but still leave it with a bit of a bite. Drain it in a colander, then spread it around a clean tea towel to steam dry (this is important because it will help the dressing cling to the broccoli). Once completely dry, transfer to a serving dish.",
    "Fry the bacon on a medium heat with a small splash of olive oil until crisp and golden, then spoon most of the bacon bits over your broccoli. Any leftover fat in the pan can be used in your salad dressing. Pour it into a mixing bowl with all the other dressing ingredients and whisk.",
    "Add the sliced tomatoes and chopped chives to your broccoli and bacon bits. Dress it all really well, and check the seasoning. If it needs pimping up, add a splash more vinegar. If you've got any chive flowers, sprinkle those over the top and serve straight away. It's beautiful on its own or served next to any grilled or roasted meat or fish.",
    "PS: I also like to toss things like diced feta cheese or chopped fresh chilli through this salad. Different-coloured cherry tomatoes are really nice too.",
    "Wine suggestion:",
    "Italian white – a Falanghina from the south",
    "Find out more about Jamie's American Road Trip tv show and Jamie's America Book"
  ],
  "ingredients": [
    "0",
    "2 large heads of broccoli",
    "6 rashers higher-welfare smoked streaky bacon, finely sliced",
    "olive oil",
    "3 firm red tomatoes, halved, deseeded and finely sliced",
    "1 small bunch of fresh chives (with flowers if you can get them), finely chopped, flowers reserved",
    "For the dressing",
    "½ clove of garlic, peeled and finely grated",
    "2 teaspoons Dijon mustard",
    "6 tablespoons extra virgin olive oil",
    "2 tablespoons white wine vinegar",
    "sea salt",
    "freshly ground black pepper"
  ],
  "__v": 1
}