{
  "hash": "684cdf8d570b8b6a0c7e1f2ca1af4c0997cb8726",
  "title": "Chard and White Bean Stew",
  "image": "https://i1.wp.com/farm6.static.flickr.com/5248/5320894317_9ca2ccfe41_z.jpg",
  "href": "https://smittenkitchen.com/2011/01/chard-and-white-bean-stew/",
  "extension": "Chrome",
  "firstAdded": "2018-09-12T22:54:03.598000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Toasted bread slices, poached eggs (tutorial), chopped herbs such as tarragon, parsley or chives or grated Parmesan or Romano to serve (optional)",
    "Bring medium pot of salted water to boil. Cook chard (or any heavier green; no need to precook baby spinach) for one minute, then drain and squeeze out as much extra water as possible. Coarsely chop chard.",
    "Wipe out medium pot to dry it, and heat olive oil over medium. Add carrots, celery, shallots and garlic and saute for 15 minutes. Barber warns not to brown them but I didn’t mind a light golden color on them. Add wine (scraping up any bits that have stuck to the pot) and cook it until it reduced by three-fourths. Add beans, broth, tomatoes, a few pinches of salt, freshly ground black pepper, thyme and bay leaf and bring to a boil. Reduce heat to medium-low and simmer for 20 minutes. Add chard and cook for 5 minutes more. Remove thyme and bay leaf. Add more broth if you’d like a thinner stew and adjust salt and pepper to taste.",
    "Serve as is drizzled with sherry vinegar. Or you can ladle the stew over thick piece of toasted country bread or baguette that has been rubbed lightly with half a clove of garlic, top that with a poached egg and a few drops of sherry vinegar and/or some grated cheese."
  ],
  "ingredients": [
    "0",
    "1 pound Swiss chard (can also swap kale, spinach or another green), ribs and stems removed and cleaned",
    "3 tablespoons olive oil",
    "1 cup (5 1/4 ounces) chopped carrots",
    "1 cup (5 ounces) chopped celery",
    "1 cup (4 1/4 ounces) chopped shallots, about 4 medium",
    "2 garlic cloves, finely chopped",
    "1 cup dry white wine",
    "2 15-ounce cans (or about 3 3/4 cups) white beans, drained and rinsed",
    "2 cups (or more to taste) vegetable broth",
    "1 cup pureed tomatoes (from a can/carton/your jarred summer supply)",
    "Salt and freshly ground black pepper",
    "3 fresh thyme sprigs",
    "1 bay leaf",
    "1 tablespoon sherry vinegar"
  ],
  "__v": 1
}