{
  "hash": "c9eb12a4f39213afd4c0dcdfa999e89e87d5aeae",
  "title": "SMOKED SAUSAGE, WHITE BEAN AND SPINACH PASTA WITH TOASTED PINE NUTS",
  "image": "http://www.acedarspoon.com/wp-content/uploads/2014/01/Smoked-Sausage-White-Bean-and-Spinach-Pasta-with-Toasted-Pine-Nuts-2-651x1024.jpg",
  "href": "https://www.acedarspoon.com/smoked-sausage-white-bean-spinach-pasta-toasted-pine-nut",
  "extension": "Chrome",
  "firstAdded": "2017-03-28T23:32:19.091000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "In a large pot bring water to a boil and cook pasta according to package. Drain and set aside.",
    "Heat a dry large skillet over medium-low heat and toast pine nuts, stirring frequently, until pine nuts are golden in spots, about 3 minutes. Remove and set aside.",
    "In the same skillet heat 2 tsp. olive oil on medium-high heat and sauté the smoked sausage for 5 minutes, or until golden brown, stirring occasionally. Remove smoked sausage and set aside.",
    "Add the zucchini and vegetable broth to the skillet and simmer until zucchini are soft, about 5 minutes. Add spinach, white beans, cherry tomatoes, basil, oregano and parsley and continue to simmer for 2 minutes until spinach is wilted and tomatoes are soft.",
    "Turn the heat to low, add the pasta and smoked sausage to the vegetables mixing well to combine and cook for 30 seconds.",
    "Garnish with toasted pine nuts, freshly grated parmesan cheese, chopped green onion, fresh parsley and a sprinkle of crushed red pepper."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 (14 ounce) package Hillshire Farm® Smoked Sausage , diagonally cut into 1/4” slices",
    "2 teaspoons olive oil",
    "6 oz bow tie pasta, cooked and drained (or medium sized pasta of your choice)",
    "1/4 cup toasted pine nuts",
    "1 medium zucchini, sliced into thin rounds",
    "1/2 cup vegetable broth",
    "1-6oz package of spinach, pre-washed",
    "1-15oz can white beans, drained and rinsed",
    "1/2 pint cherry tomatoes, sliced in half",
    "1 teaspoon dried basil",
    "1 teaspoon dried parsley",
    "1/2 teaspoon dried oregano",
    "Salt and pepper to taste"
  ],
  "__v": 1
}