{
  "hash": "21a591094cb128616477a4b19c9fe0f428a37d30",
  "title": "Uova da Raviolo (Ravioli with an Egg Inside)",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2009/6/25/3/MB2B24-3_Ravioli-with-Egg-Inside_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/mario-batali/uova-da-raviolo-ravioli-with-an-egg-inside-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-12-08T08:34:40.367000",
  "users": [
    null
  ],
  "keywords": [
    "white",
    "black",
    "truffle",
    "shaved",
    "parmigianoreggiano",
    "garnishing",
    "pasta",
    "sheeps",
    "milk",
    "ricotta",
    "spinach",
    "scant",
    "nutmeg",
    "salt",
    "pepper",
    "basic",
    "dough",
    "recipe",
    "follows",
    "eggs",
    "butter",
    "kept",
    "flour",
    "extravirgin",
    "olive",
    "oil"
  ],
  "directions": [
    "0",
    "In a non-reactive bowl, combine 1/2 the truffle shavings, the Parmigiano, the ricotta and the spinach, mix well, and season to taste with nutmeg, salt and white pepper. Set aside.",
    "Roll out the pasta dough to the thinnest setting on a pasta rolling machine. From the thin pasta sheet, cut 12 circles with a 6-inch diameter. Set 6 of the circles on a sheet tray dusted with flour, cover with plastic wrap and set aside.",
    "In the center of each of the remaining 6 circles, mound an equal portion of the ricotta mixture. With the back of a small ladle or spoon, hollow out a well in the center of each mound. Carefully break the eggs, 1 at a time, into a small bowl, and transfer 1 yolk and a bit of white into the center of each well. It is imperative that the yolk remain unbroken.",
    "Cover each filled circle of pasta with an unfilled circle, and press the edges together with fingers to seal.",
    "Bring 6 quarts of water to a boil and add 2 tablespoons salt. Gently, using a wide spatula, lower each ravioli into the water to cook for 2 minutes. Remove from the water and place gently into a 12 to14-inch saute pan with the remaining butter, shave the remaining truffle over, add a generous grating of Parmigiano-Reggiano and carefully put 1 on each plate.",
    "Mound 3 1/2 cups of the flour in the center of a large wooden cutting board. Make a well in the middle of the flour and add the eggs and the olive oil. Using a fork, beat together the eggs and oil and begin to incorporate the flour, starting with the inner rim of the well.",
    "As you expand the well, keep pushing the flour up from the base of the mound to retain the well shape. The dough will come together when half of the flour is incorporated.",
    "Start kneading the dough with both hands, using the palms of your hands. Once you have a cohesive mass, remove the dough from the board and scrape up and discard any leftover bits. Lightly reflour the board and continue kneading for 6 more minutes. The dough should be elastic and a little sticky. Wrap the dough in plastic and allow to rest for 30 minutes at room temperature. Roll or shape as desired.",
    "Recipe copyright 2000, Mario Batali. All Rights Reserved."
  ],
  "ingredients": [
    "0",
    "1/2 small white or black truffle, shaved",
    "1/2 cup Parmigiano-Reggiano, grated, plus more for garnishing pasta",
    "1/2 cup fresh sheep's milk ricotta",
    "1/2 cup spinach, blanched, drained and chopped",
    "Scant pinch nutmeg",
    "Salt and white pepper to taste",
    "1 recipe basic pasta dough, recipe follows",
    "7 very fresh eggs",
    "12 tablespoons butter, melted and kept warm",
    "3 * to 4 cups flour",
    "4 eggs",
    "1/2 teaspoon extra-virgin olive oil"
  ],
  "__v": 1
}