{
  "hash": "b745d4b70412b5eb8bb36dea4f8e8f3d620232bc",
  "title": "Old Bay Cauliflower Salad",
  "image": "https://noblepig.com/images/2013/05/Old-Bay-Cauliflower-Salad-is-going-to-be-your-new-favorite-side-dish.jpg",
  "href": "http://noblepig.com/2013/05/old-bay-cauliflower-salad/",
  "extension": "Chrome",
  "firstAdded": "2017-04-19T23:37:12.623000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Bring a large pot of water to a boil. Cut heads of cauliflower into 3\" pieces (as seen in the picture above). Have a large bowl of ice water ready as well as a paper-towel lined (many layers) baking sheet. Working in batches, blanch the cauliflower in the hot water, each batch for 3-4 minutes. Remove and immediately place in the ice water to stop the cooking process. Let sit in water for a few minutes and remove to the paper-towel lined baking sheet (you will need to continue to add ice to keep water cold for the other batches). Repeat process with the rest of the cauliflower.",
    "When all cauliflower is done, break into smaller pieces with your hands (stems too) and give a rough chop with a knife. Here is the most important part, you will want your cauliflower to be really, really dry before you mix it with the mayo. Let it sit for a while in a single layer on a dry tray. Not doing this will result in a runny and diluted salad.",
    "Mix together mayonnaise, Old Bay, red pepper flakes and black pepper in a medium-sized bowl (you can do this up to a day ahead).",
    "In a large bowl add blanched cauliflower, celery, peas and red onion. Mix with the mayo-Old Bay mixture and salt to taste. Refrigerate for at least four hours before serving or overnight."
  ],
  "ingredients": [
    "0",
    "2 heads cauliflower",
    "4 large celery stalks, finely diced",
    "1 cup frozen peas, thawed",
    "1/2 cup finely diced red onion",
    "2 cups mayonnaise",
    "1 Tablespoon Old Bay Seasoning",
    "1/2 teaspoon red pepper flakes",
    "1/2 teaspoon coarsely ground black pepper",
    "Salt to taste"
  ],
  "__v": 1
}