{
  "hash": "fbf27438726dc7704acd8d0383748933fe5b749f",
  "title": "easy asparagus recipe with mediterranean salsa",
  "image": "https://www.themediterraneandish.com/wp-content/uploads/2018/03/Easy-Asparagus-Recipe-with-Mediterranean-Salsa-The-Mediterranean-Dish-3-150x150.jpg",
  "href": "https://www.themediterraneandish.com/easy-asparagus-recipe-with-mediterranean-salsa/",
  "extension": "",
  "firstAdded": "2018-05-05T18:15:36.119000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the Mediterranean salsa. In a mixing bowl, add the tomatoes, shallots, garlic and herbs. Season with salt, pepper, and sumac. Add lemon juice and a generous drizzle of extra virgin olive oil. Mix and set aside so flavors will meld nicely (or, if you prefer, cover and chill until ready to serve).",
    "In a large sacuepan, bring 8 cups of water to a boil. Seasoned with 2 tbsp salt. Have a large bowl of ice water ready next to it (ice bath).",
    "When water comes to a rolling boil, add the prepared asparagus. Boil until tender, 3 to 4 minutes (depending on thickness). Remove with tongs, or drain in a colander, and immediately transfer to ice water for 1 minute to stop the cooking process. Drain; set aside to cool down (or if you prefer, chill in the fridge until ready to serve.)",
    "When ready to serve, arrange the asparagus on a serving platter. Season with salt and pepper. Add a drizzle of good extra virgin olive oil and lemon zest. Top with the Mediterranean salsa. Enjoy!"
  ],
  "ingredients": [
    "0",
    "12 oz cherry tomatoes, chopped or halved (place in a small sieve over a bowl to drain a little)",
    "1 shallot, finely chopped",
    "1 garlic clove, finely chopped",
    "1/2 cup chopped fresh parsley leaves",
    "1/4 cup chopped fresh mint leaves (or basil chiffonade, if you prefer)",
    "Salt and pepper, more for later",
    "1/2 tsp sumac",
    "2 to 3 tsp fresh lemon juice",
    "Early Harvest Greek extra virgin olive oil, more for later"
  ],
  "__v": 1
}