{
  "hash": "2a8343dcc015066b1dffef5c55b1ada72522373c",
  "title": "Melted Onions",
  "image": "https://c7cf1aee0f9592118cd3-45a8e764187dff1857a6ffe8280848dc.ssl.cf2.rackcdn.com/uploads/images/cropped/704_388/56df19b8a99f6_FNP1073.jpg",
  "href": "http://www.weber.com/recipes/veggies/melted-onions?utm_medium=rr-email&utm_campaign=row&utm_source=mailchimp&utm_content=0321161002",
  "extension": "Chrome",
  "firstAdded": "2016-03-25T19:56:57.960000",
  "users": [
    null
  ],
  "keywords": [
    "medium",
    "yellow",
    "onions",
    "skin",
    "size",
    "tennis",
    "ball",
    "unsalted",
    "butter",
    "kosher",
    "salt",
    "black",
    "pepper",
    "sherry",
    "vinegar",
    "italian",
    "parsley"
  ],
  "directions": [
    "0",
    "Fill a chimney starter to the rim with charcoal and burn the charcoal until it is lightly covered with ash. Spread the charcoal in a tightly packed, single layer across one-half of the charcoal grate. Let the coals burn down to medium heat. Leave all the vents open.",
    "With the onions still in their skins, place them on the charcoal grate against the charcoal. Close the lid and cook the onions until very tender, 1 to 1½ hours. Occasionally swap the positions of the onions for even cooking and turn the blackened skins away from the charcoal. When very tender, the onions will be blackened in spots all over and a knife blade will slide in and out of each onion like it is a ripe peach. Some onions may take longer than others.",
    "At this point, to finish cooking the onions, you will need to add more charcoal to the fire for medium heat.",
    "Remove the onions from the grill and let cool completely. Carefully remove the skin from each onion, being careful to leave the root ends intact so they hold the layers of the onions together. Cut each onion lengthwise through the stem and root ends.",
    "When the fire is ready, put the cooking grate in place. In a large disposable foil pan over direct medium heat (350° to 450°F), melt the butter. Carefully add the onions in a single layer and season with the salt and pepper. Using tongs, turn the onions in the butter to coat them.",
    "Slide the pan over indirect medium heat and cook, with the lid closed as much as possible, until the onions are very tender and just beginning to brown, 10 to 15 minutes, carefully turning the onions once or twice. If desired, to keep the onions warm, cover the pan with foil and let the onions continue to cook over indirect heat for as long as 30 minutes. Wearing insulated barbecue mitts, remove the pan from the grill. Splash the vinegar and sprinkle the parsley over the onions. Serve warm."
  ],
  "ingredients": [
    "0",
    "6 medium yellow onions (skin on), 8 to 10 ounces each, about the size of a tennis ball",
    "¼ cup (½ stick) unsalted butter",
    "½ teaspoon kosher salt",
    "¼ teaspoon freshly ground black pepper",
    "1 teaspoon sherry vinegar",
    "1 tablespoon minced fresh Italian parsley"
  ],
  "__v": 1
}