{
  "__v": 1,
  "directions": [
    "0",
    "Preheat the oven to 375°. Spray a 9- x13-inch baking dish with olive oil spray.",
    "Bring a large pot of salted water to a boil.",
    "In a medium bowl, combine the ricotta, 6 tablespoons of the Pecorino Romano cheese and half of the mozzarella cheese.",
    "Meanwhile, in a large deep skillet, brown the sausage breaking up into small bits until cooked through; set aside. Add the oil to the skillet and sauté garlic about a minute, careful not to burn. Add spinach and season with a little salt and pepper and cook another minute. Return the sausage to the skillet and add the marinara sauce; cook on low about 2-3 minutes.",
    "When the pasta water comes to a boil, cook pasta according to instructions for al dente, but undercook them by 4 minutes less; drain and return to pot.",
    "Put half of the cooked pasta into the prepared baking dish and top with half of the meat sauce. Spoon the ricotta mixture on top of the sauce in an even layer. Cover with the remaining pasta and the remaining sauce. Top with the remaining mozzarella and Pecorino Romano cheese.",
    "Cover with foil and bake for 20 minutes. Remove foil and bake for an additional 6-7 minutes or until the mozzarella is melted and the edges are lightly browned."
  ],
  "firstAdded": "2014-07-08T22:35:07.049000",
  "hash": "105a67216a69475d83d66c838a10537ff82e44e1",
  "href": "http://www.skinnytaste.com/2012/09/baked-pasta-with-sausage-and-spinach.html",
  "image": "http://2.bp.blogspot.com/-iW-hT2t4_3c/UEYuvCwxfAI/AAAAAAAAHhc/pNARD8b7D40/s1600/Baked-Pasta-with-Sausage-and-Spinach.jpg",
  "ingredients": [
    "0",
    "olive oil spray",
    "1/2 cup grated Pecorino Romano",
    "8 oz fat-free ricotta",
    "8 oz part-skim mozzarella, shredded",
    "14 oz uncooked sweet Italian chicken sausage, removed from casing",
    "12 oz high-fiber or low carb rigatoni pasta",
    "1 tsp olive oil",
    "2 cloves smashed garlic, roughly chopped",
    "10 oz package frozen chopped spinach, thawed and squeezed of excess liquid",
    "salt and fresh pepper to taste",
    "4 cups Quick Marinara Sauce"
  ],
  "keywords": [
    "olive",
    "oil",
    "spray",
    "pecorino",
    "romano",
    "fatfree",
    "ricotta",
    "partskim",
    "mozzarella",
    "uncooked",
    "italian",
    "chicken",
    "sausage",
    "casing",
    "highfiber",
    "low",
    "carb",
    "rigatoni",
    "pasta",
    "smashed",
    "garlic",
    "roughly",
    "frozen",
    "spinach",
    "thawed",
    "squeezed",
    "excess",
    "salt",
    "pepper",
    "quick",
    "marinara"
  ],
  "title": "Spinach and Sausage Baked Pasta",
  "users": [
    null
  ]
}