{
  "hash": "8d5668936818106eb065b5ae5604db46f6da2028",
  "title": "vegan snickerdoodles with vanilla banana \"ice cream\"",
  "image": "http://ourfourforks.com/wp-content/uploads/2014/04/Vegan-Snickerdoodles-Final1-ourfourforks.com_.jpg",
  "href": "http://ourfourforks.com/vegan-snickerdoodles/",
  "extension": "",
  "firstAdded": "2015-10-01T21:16:21.632000",
  "users": [
    null
  ],
  "keywords": [
    "oats",
    "flour",
    "used",
    "vitamix",
    "puffed",
    "brown",
    "rice",
    "baking",
    "soda",
    "salt",
    "cinnamon",
    "sweetener",
    "honey",
    "maple",
    "syrup",
    "notes",
    "coconut",
    "oil",
    "vanilla",
    "evaporated",
    "cane",
    "sugar",
    "bananas",
    "coins",
    "frozen",
    "solid",
    "arrowroot",
    "power",
    "cornstarch",
    "nondairy",
    "easy",
    "semihomemade",
    "milk"
  ],
  "directions": [
    "0",
    "Preheat oven to 350 degrees Fahrenheit and line a baking sheet with parchment paper and set aside.",
    "Mix the six dry ingredients in a medium bowl until well blended. In a separate bowl, whisk together the melted coconut oil, liquid sweetener and vanilla extract.",
    "Add wet ingredients to the dry and mix until well combined.",
    "Divide the batter into 6 or 12 pieces (depending on the size you want - I went big), roll into balls with your hands and coat with cinnamon sugar mixture, if using.",
    "Place cookies several inches apart on the baking sheet and bake for 6 minutes, remove from oven and gently press cookies down with the back of a spoon, and bake for 4-6 minutes more. They should come out a bit soft as they will become harder as they cool.",
    "1",
    "Blend the bananas in a food processor until they are the consistency of soft serve ice cream. You may need to occasionally stop the processor and use a spatula the scrap the banana from the sides.",
    "In a small bowl mix the arrowroot (or cornstarch) with the non-dairy milk and vanilla extract until thoroughly combined.",
    "Once smooth and creamy, add in arrowroot/milk/vanilla mixture and process until well combined.",
    "Transfer to a freezer container and freeze until solid, allowing to thaw for about 5 minutes before serving.",
    "2",
    "Allow the cooled cookies to chill in the the freezer, at least 30 minutes until slightly hardened. Scoop a generous amount of ice cream onto half of the cookies and place the remaining cookies on top. Gently press down and smooth the outer edge. Place back in the freezer to set, at least 20 minutes. Serve anytime."
  ],
  "ingredients": [
    "0",
    "¾ cups oats, ground into flour (I used my Vitamix)",
    "1½ cups puffed brown rice, ground into flour",
    "½ teaspoon baking soda",
    "½ teaspoon baking powder",
    "½ teaspoon salt",
    "1 tablespoon ground cinnamon",
    "⅓ cup liquid sweetener (I used half honey, half maple syrup, see notes)",
    "⅓ cup coconut oil, melted",
    "2 teaspoons pure vanilla extract",
    "1",
    "2 tablespoons evaporated cane sugar",
    "1 tablespoon ground cinnamon",
    "2",
    "4 bananas, cut into coins and frozen until solid",
    "pinch of salt",
    "2 teaspoons arrowroot power or cornstarch (see notes)",
    "2 tablespoons non-dairy milk (I used easy semi-homemade coconut milk)",
    "2 teaspoons pure vanilla extract"
  ],
  "__v": 1
}