{
  "hash": "38a0ad540c70143075385bc9677f1f44852c1bce",
  "title": "Carrot Pasta",
  "image": "http://prodstatics3azcdn1.purewow.com/images/articles/2016_01/gnocchi_big.jpg",
  "href": "http://www.purewow.com/recipes/Carrot-Pasta?utm_medium=email&utm_source=Recipe&utm_campaign=This_Might_Be_Our_Favorite_Use_for_Spaghetti_Squash_Yet_2016_08_02_a&utm_content=Recipe_editorial",
  "extension": "Chrome",
  "firstAdded": "2016-08-02T17:18:51.985000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place the carrots in a medium pot and cover with water. Bring to a boil over medium heat. Continue to boil until the carrots are very tender, 12 to 15 minutes. Drain.",
    "Transfer the drained carrots to a large bowl and mash until very smooth. Stir in the egg yolks, salt and Parmesan. Add the flour and mix just until incorporated.",
    "On a lightly floured surface, roll a third of the carrot dough into a log about ¾ inch thick. Cut the log into 1-inch pieces. Transfer the finished gnocchi to a floured baking sheet. Repeat with the remaining dough.",
    "Bring a large pot of salted water to a boil. Add the gnocchi and cook until they float to the surface, 3 to 4 minutes. Drain.",
    "In a large sauté pan, melt the butter over medium heat. Cook until the butter begins to turn lightly brown and smells nutty, 8 to 10 minutes. Add the garlic and sage, and cook until fragrant, 1 to 2 minutes.",
    "Add the drained gnocchi to the pan and sauté until well coated in butter, garlic and sage. Season with salt and freshly ground black pepper, and garnish with Parmesan. Serve immediately."
  ],
  "ingredients": [
    "0",
    "2 cups peeled and chopped carrots",
    "2 egg yolks",
    "Pinch of salt",
    "⅓ cup grated Parmesan cheese, plus more for garnishing",
    "1½ cups all-purpose flour",
    "8 tablespoons (1 stick) unsalted butter",
    "3 garlic cloves, minced",
    "¼ cup sage leaves",
    "Salt and freshly ground black pepper"
  ],
  "__v": 1
}