{
  "hash": "af88761af1a81679c3d3627158ef6a382de0517c",
  "title": "HONEY BALSAMIC SHEET PAN CHICKEN",
  "image": "http://i0.wp.com/tiphero.com/wp-content/uploads/2016/08/Close-up-Honey-Balsamic-Sheet-Pan-Chicken.jpg?resize=750%2C364",
  "href": "http://tiphero.com/honey-balsamic-sheet-pan-chicken/",
  "extension": "Chrome",
  "firstAdded": "2017-05-06T23:33:44.267000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "Preheat the oven to 425 degrees Fahrenheit (175 degrees Celsius).",
    "In a medium bowl, combine the balsamic vinegar, honey, a tablespoon of olive oil, garlic, thyme, rosemary, chili flakes, salt and pepper. Stir well to mix.",
    "Place the chicken breasts in a resealable plastic bag and pour the marinade over the top. Seal and toss the chicken to evenly coat. Marinate for at least 30 minutes.",
    "While the chicken marinates, place the potatoes and cherry tomatoes on a sheet pan. Drizzle with the remaining olive oil, season with salt and pepper, and stir to coat. Bake for 25 minutes.",
    "Remove the sheet pan from the oven and toss the green beans with the potatoes and tomatoes.",
    "Remove the marinated chicken breasts from the plastic bag, reserving the remaining marinade in the bag. Place the marinated chicken, evenly spaced, on top of the vegetables. Pour the marinade from the bag over the top of the chicken and vegetables."
  ],
  "ingredients": [
    "0",
    "Honey Balsamic Sheet Pan Chicken",
    "TipHero",
    "With the approach of fall, the start of school, and the – sad sniff! – fading of long summer evenings, the more hectic our dinner times are about to get. If you’re already dreading the mad rush of school pickups, after-school practices and rehearsals, dinner dish clean-up and bedtime routines, fear not. We have something to save you time AND cut down on your cleaning: a sheet pan dinner! More specifically, a Honey Balsamic Sheet Pan Chicken dinner, complete with red potatoes, cherry tomatoes, and green beans. It’s easy, delicious, colorful, and when all’s said and done, you’ll only have one pan and one small bowl to clean up! What could be better for busy families? (Prefer a stovetop version? Check out our One-Pan Honey Balsamic Chicken With Veggies!) Watch our short recipe video to learn how to make the sheet pan version, then read on for the recipe!",
    "Honey Balsamic Chicken with Veggies",
    "HONEY BALSAMIC SHEET PAN CHICKEN",
    "Serves 4 to 6",
    "Prep Time: 10 minutes",
    "Total Time: 1 hour 10 minutes",
    "INGREDIENTS",
    "¼ cup balsamic vinegar",
    "6 tablespoons honey",
    "2 to 3 tablespoons olive oil, divided",
    "2 cloves garlic, minced",
    "1 teaspoon dried thyme",
    "¾ teaspoon dried rosemary",
    "½ teaspoon red chili flakes",
    "¾ teaspoon kosher salt",
    "¼ teaspoon black pepper",
    "2 pounds chicken breasts (4 each), trimmed",
    "1­½ pounds baby red potatoes, quartered",
    "1 pint cherry tomatoes",
    "1 pound green beans, trimmed"
  ],
  "__v": 1
}