{
  "hash": "1731823daaa507613d43116162d9c7c099c9b82d",
  "title": "Salted Almond and Pistachio Bark",
  "image": "http://www.epicurious.com/images/recipesmenus/2014/2014_march/51230430.jpg",
  "href": "http://www.epicurious.com/recipes/food/views/salted-almond-and-pistachio-bark-51230430",
  "firstAdded": "2015-02-22T19:18:27.729000",
  "users": [
    null
  ],
  "keywords": [
    "goodquality",
    "cacao",
    "semisweet",
    "chocolate",
    "roasted",
    "unsalted",
    "almonds",
    "shelled",
    "pistachios",
    "vanilla",
    "coarse",
    "flake",
    "salt"
  ],
  "directions": [
    "0",
    "Line a baking sheet with parchment paper.",
    "Place the chocolate in a microwave-safe bowl and melt it in a microwave in 10-second intervals, stirring often, until smooth. Add 1/2 the cup of the almonds, 1/2 the cup of the pistachios, and the vanilla and stir well to coat the nuts.",
    "Use a rubber spatula to spread the mixture evenly on the prepared baking sheet. Sprinkle the salt and the remaining 3/4 cup almonds and 3/4 cup pistachios over the top.",
    "Cover and refrigerate until the chocolate is set, 2 to 4 hours.",
    "Break the bark into pieces and store in an airtight container with parchment or wax paper between the pieces. The bark can be stored for about 1 week.",
    "TIME-SAVER",
    "Use 2 1/2 cups trail mix in place of the almonds and pistachios.",
    "VARIATION",
    "Make French Chocolate Bark like Ina's, which is essentially a combo of dried fruits and nuts sprinkled on top of your bark (as opposed to mixed in). The fruits remind me of shiny jewels. (They know how to do it in France.) Dried apricots, cranberries, cherries, pineapple—anything you like works. Add cashews or peanuts or nuts of your choice. Just coarsely chop your topping; you will need about 2 1/2 cups' worth.",
    "DRESS IT DOWN",
    "Kiddie Candy Bark",
    "Instead of making bark with nuts and salt, try chopped-up candy bar pieces, crushed pretzels, or mini marshmallows. Experiment with interesting combinations.",
    "PAIR IT Capçanes Peraj Petita",
    "Not a sweet wine, but it's so fruity and versatile that it goes with most anything, even salty/sweet dessert."
  ],
  "ingredients": [
    "0",
    "1 3/4 pounds good-quality 60% cacao semisweet chocolate, chopped",
    "1 1/4 cups roasted unsalted almonds, chopped",
    "1 1/4 cups roasted shelled pistachios, chopped",
    "1/2 teaspoon pure vanilla extract",
    "1 1/2 teaspoons coarse flake sea salt"
  ],
  "__v": 1
}