{
  "hash": "a49868190ff6850d10acfd44c6f31b0a9709d6b8",
  "title": "5 Minute Cheez Whiz",
  "image": "http://thevegan8.com/wp-content/uploads/2014/05/fritopie-1-of-1-2.jpg",
  "href": "http://thevegan8.com/2014/05/22/gee-whiz/",
  "extension": "",
  "firstAdded": "2015-12-11T23:55:23.019000",
  "users": [
    null
  ],
  "keywords": [
    "water",
    "needed",
    "depending",
    "nutritional",
    "yeast",
    "use",
    "runny",
    "used",
    "tahiniany",
    "raw",
    "tahini",
    "work",
    "long",
    "smooth",
    "overly",
    "decrease",
    "heaping",
    "tomato",
    "dark",
    "red",
    "wine",
    "balsamic",
    "vinegar",
    "stronger",
    "tang",
    "preference",
    "depend",
    "strong",
    "flavor",
    "start",
    "garlic",
    "onion",
    "salt",
    "isnt",
    "overpowering",
    "neutral",
    "backdrop",
    "pourable",
    "make",
    "highly",
    "rawguru",
    "brand",
    "reasons",
    "need",
    "dont",
    "recommend",
    "subs",
    "ingredient",
    "crucial",
    "tested",
    "ways",
    "finalizing",
    "bowl",
    "yumminess"
  ],
  "directions": [
    "0",
    "Add all of the ingredients to a blender (I used my Vitamix) or food processor and process until smooth and thick. 30 seconds should do it. If you don't have a blender or food processor, you can still make this, it just may not be 100% as smooth. Just add the ingredients to a bowl and whisk it really, really well until completely smooth and thick. Tomato paste is hard to mix, so a blender is best. Adjust seasonings if desired, although I didn't alter it one bit. This does not need to be heated up or recommended, as it would probably get too thick or form skins. If you store yours in the fridge, it will thicken some and you just need to stir it through and let it come back to room temperature. Add in any extras you like such as jalapenos or chili powder to make it spicy or queso for a more nacho cheese flavor!"
  ],
  "ingredients": [
    "0",
    "½-3/4 cup water, as needed depending on how much nutritional yeast you use",
    "3-4 tablespoons runny tahini (I used 4) RAW tahini(any raw tahini should work as long as it's smooth & not overly thick, otherwise decrease the amount to taste)",
    "2 heaping tablespoons tomato paste (not tomato sauce)",
    "2 teaspoons dark red wine balsamic vinegar (add more for a stronger tang, to taste preference)",
    "¼-1/2 cup nutritional yeast (this will depend on how strong you like the flavor to be, start out with a ¼ cup)",
    "1 teaspoon garlic powder",
    "1 teaspoon onion powder",
    "1 teaspoon fine sea salt",
    "1",
    "It is crucial to use a raw tahini here that is smooth, so the tahini isn't too thick or overpowering. The brand I use has a neutral flavor backdrop and is pourable and very smooth. Too thick of tahini can make the flavor too strong. I highly recommend Rawguru brand because of these reasons. Otherwise you may need to decrease the amount of tahini used. I don't recommend any subs here, as each ingredient is crucial for the taste and I tested it several ways before finalizing on this bowl of yumminess."
  ],
  "__v": 1
}