{
  "hash": "e424fb3454f6ba8f89ad103d8ca6853ba6e94e78",
  "title": "Homemade Lemon Pudding Cake",
  "image": "http://recipescool.com/wp-content/uploads/2017/08/Homemade-Lemon-Pudding-Cake-Recipe.png",
  "href": "http://recipescool.com/homemade-lemon-pudding-cake/?fbclid=IwAR2twEYui06hR9kAlmnsTXv2K07OoDGgHnoPhg33RisYwauRZGvRkb_TISQ",
  "extension": "Chrome",
  "firstAdded": "2019-03-15T23:43:19.930000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 325 degrees F. Grease and flour a standard Bundt pan.(the 12 cup capacity)",
    "In a medium bowl, whisk together the flour, cornstarch, baking powder and salt then set aside.",
    "Using an electric mixer on medium speed with a paddle attachment, cream together the butter and granulated sugar until light and fluffy, about 3 minutes.Add in the lemon pie filling mix and combine thoroughly.",
    "Beat in the eggs, one at a time, making sure each is thoroughly incorporated.",
    "Mix in the lemon zest.",
    "Combine the milk, oil and vanilla extract in a large measuring cup or bowl.",
    "Starting with the dry ingredients, alternate pouring a third of the wet and dry ingredients into the bowl, incorporating thoroughly after each addition. You will end on the wet ingredients. Mix on medium speed for 2 minutes after the last addition.",
    "Pour the cake batter into the prepared Bundt pan and bake for 50 to 60 minutes, or until a tester inserted into the center of the cake comes out clean.",
    "Invert the cake onto a baking rack to cool.",
    "Frost with Lemon Buttercream Icing when the cake has completely cooled and sprinkle lemon zest over the icing if wanted"
  ],
  "ingredients": [
    "0",
    "1 package of jello lemon pie filling (small packet, equals 2 cups or 4 servings)",
    "1½ cups of white granulated sugar",
    "¾ cup unsalted butter, softened",
    "4 teaspoons baking powder",
    "1¾ cups all-purpose flour",
    "2 tbsp fresh lemon zest",
    "1 tsp vanilla extract",
    "1¼ cup whole milk",
    "3 tbsp cornstarch",
    "? cup canola oil",
    "1 teaspoon salt",
    "4 eggs"
  ],
  "__v": 1
}