{
  "hash": "93516c8a3202d23c3a8793478e2e065e241fafb2",
  "title": "king arthur baguettes",
  "image": "http://lh5.ggpht.com/_OaYG005JPDs/TPJxfaJxTXI/AAAAAAAACQ4/7j30bRUSER4/s800/Baguettes.jpg",
  "href": "http://www.budgetbytes.com/2010/11/king-arthur-baguettes/",
  "extension": "Chrome",
  "firstAdded": "2016-02-12T15:26:40.710000",
  "users": [
    null
  ],
  "keywords": [
    "cool",
    "water",
    "yeast",
    "bread",
    "flour",
    "wheat",
    "salt"
  ],
  "directions": [
    "0",
    "The night before, prepare the starter. Dissolve 1/16th tsp of yeast in ½ cup cool water. Stir in 1 cup of bread flour until it forms a ball. Loosely cover and let sit at room temperature over night (12-16 hrs).",
    "The next day the starter will no longer be a ball but a large bubbly mass. In a separate bowl, combine 1 tsp of yeast with 1.25 cups of warm water and stir to dissolve the yeast. Combine the starter with the new yeast water and stir to dissolve as best as possible. There may still be a few chunks of the gooey starter but this will be kneaded in.",
    "Add one cup of bread flour (or whole wheat if you are using it) and the salt to the yeast water/starter mix. Stir it in until combined. Begin adding more bread flour, ½ cup at a time until it is a ball that you can no longer stir with a spoon.",
    "Turn the ball of dough out onto a floured surface and knead in the rest of the flour (until you have reached 3 to 3.5 cups total). Only add flour and knead until it is a soft, elastic, slightly tacky ball. You do not want to add too much flour or knead too much or else the dough will become stiff. The dough should be very soft and pliable (this part takes practice).",
    "Form the dough into a ball and place in an oiled bowl. Loosely cover and let rise for one hour. Punch the dough down, reshape into a ball and let rise again. Do this for a total of three rises (three hours).",
    "Punch the dough down a third time and turn it out onto a lightly floured surface. Cut the dough into 3 equal sized piece and let it rest for 15 minutes. Gently pat down each piece into a long oval. Roll the oval into a long baguette.",
    "Place the shaped baguettes onto a baking sheet coated with non-stick spray and/or lightly sprinkled with cornmeal. Let the baguettes rise for 1 – 1.5 hours. Using a sharp knife slit the tops in a long, diagonal fashion. Preheat the oven to 450 degrees.",
    "Spray the baguettes with water (or lightly brush with a soft brush) and bake at 450 for 20-30 minutes or until the crust is deep golden brown. Remove the baguettes from the oven and let cool on a wire rack."
  ],
  "ingredients": [
    "0",
    "½ cup cool water $0.00",
    "1/16th tsp yeast $0.01",
    "1 cup bread flour $0.14",
    "1",
    "1 tsp yeast $0.09",
    "1¼ cup water $0.00",
    "1 cup whole wheat flour $0.16",
    "2½ cups bread flour $0.37",
    "1½ tsp salt $0.05"
  ],
  "__v": 1
}