{
  "hash": "b069d2f39ba6149804882a86e742698905872754",
  "title": "Persian New Year's Noodle Soup",
  "image": "https://images.food52.com/jtnnGjd5NGHDWI8j1tVJKwquei8=/753x502/c47a5ae6-f505-40e8-8865-63845309525c--2014-1216_new-years-noodle-soup-289.jpg",
  "href": "https://food52.com/recipes/32708-persian-new-year-s-noodle-soup",
  "extension": "Chrome",
  "firstAdded": "2018-03-01T01:45:00.210000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the oil in a large pot or dutch oven medium heat. Add the onions, turmeric, and cumin. Sauté the onions until they're very soft, golden, and fragrant (8 to 10 minutes). Add the garlic and chili, and cook for another 2 to 3 minutes, or until the garlic is fragrant but not browning.",
    "Add the chickpeas, navy beans, kidney beans, and lentils, along with the salt and broth. Bring the mixture to a boil, and reduce it to a simmer. Simmer for an hour, with the lid of the pot on but slightly ajar to let steam out, until the beans are tender (this may take up to 80 minutes).",
    "Add an extra cup of broth. Add the spinach and linguine. Simmer until the linguine is tender but slightly al dente (10 minutes). Add the herbs and allow them to simmer for a minute before tasting the soup and adjusting seasonings. Stir in the lemon juice.",
    "Serve the soup with a generous dollop of cashew cream (https://food52.com/recipes/20679-classic-cashew-cream) or a drizzle of olive oil. Leftovers will keep for up to five days, and can be frozen for up to four weeks."
  ],
  "ingredients": [
    "0",
    "1/2 cup chickpeas, soaked overnight in 2 to 3 cups water, rinsed, and drained",
    "1/2 cup navy beans, soaked overnight in 2 to 3 cups water, rinsed, and drained",
    "1/2 cup kidney beans, soaked overnight in 2 to 3 cups water, rinsed, and drained",
    "3 tablespoons olive oil, plus extra for drizzling",
    "2 yellow onions, thinly sliced",
    "1 teaspoon turmeric, ground",
    "1 teaspoon cumin, ground",
    "1 poblano chili, diced",
    "3 cloves garlic, minced",
    "1/2 cup green or brown lentils, rinsed",
    "1 1/2 teaspoons salt",
    "8 to 10 cups vegetable broth (low sodium if possible)",
    "5 cups fresh spinach, washed and chopped",
    "1/2 pound linguine, broken in half",
    "1 cup parsley, chopped",
    "1/2 cup cilantro, chopped (more to taste)",
    "1/3 cup chopped fresh dill (more to taste)",
    "2 tablespoons lemon juice"
  ],
  "__v": 1
}