{
  "hash": "3ddb0f29fba192fe7578501c7b31c8ad0e017c60",
  "title": "How To Caramelize Onions in the Slow Cooker",
  "image": "",
  "href": "http://www.thekitchn.com/how-to-caramelize-onions-in-the-slow-cooker-cooking-lessons-from-the-kitchn-193413",
  "extension": "",
  "firstAdded": "2017-10-28T14:22:25.066000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Thinly slice all the onions: Peel and thinly slice all of the onions into half-moons. Transfer all the onions to the slow cooker — the slow cooker should be half to three-quarters full.",
    "Toss onions with the olive oil: Drizzle the olive oil or melted butter and the salt, if using, over the top of the onions. Toss to evenly coat all the onions with a thin glaze of oil.",
    "Cook for 10 hours on LOW: Cover the slow cooker and cook for 10 hours on LOW. If you're around while the onions are cooking, stir them occasionally — this will help them cook more evenly, but isn't strictly necessary. After 10 hours, the onions will be golden-brown and soft, and they will have released a lot of liquid. If you like them as they are now, stop cooking and pack them up.",
    "Cook an additional 3 to 5 hours with the lid ajar (optional): If you'd like jammier, more concentrated onions with a deeper color, continue cooking for another 3 to 5 hours on LOW. Leave the lid ajar so the liquid can evaporate. Check every hour and stop cooking whenever the onions look and taste good to you.",
    "Refrigerate or freeze the onions: Remove the onions with a slotted spoon and transfer them to refrigerator or freezer containers. If any liquid remains in the slow cooker, transfer the liquid to a separate container — this can be used as cooking broth in another recipe. Onions will keep in the refrigerator for one week or in the freezer for at least 3 months."
  ],
  "ingredients": [
    "0",
    "3 to 5 pounds yellow onions (4 to 5 large onions)",
    "3 tablespoons extra-virgin olive oil or melted butter",
    "1/2 teaspoon salt"
  ],
  "__v": 1
}