{
  "hash": "77971b435c1a3f70fece3f08c91da8446b4eb035",
  "title": "Creamy Mushroom Herb Pasta",
  "image": "http://www.budgetbytes.com/wp-content/uploads/2016/10/Creamy-Mushroom-Herb-Pasta-V1.jpg",
  "href": "https://www.budgetbytes.com/2016/10/creamy-mushroom-herb-pasta/",
  "extension": "Chrome",
  "firstAdded": "2016-12-29T00:31:25.184000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Wash the mushrooms to remove any dirt or debris, then thinly slice them.",
    "Begin cooking the fettuccine according to the package directions. Cook the pasta just until al dente, then drain in a colander. The pasta will continue to soften slightly once it's in the creamy mushroom herb sauce, so do not overcook it.",
    "While the pasta is cooking, add the butter and minced garlic to a large skillet. Sauté the garlic over medium heat for 1-2 minutes, or just until fragrant and tender. Do not let the butter or garlic turn brown.",
    "Add the sliced mushrooms and continue to cook until the mushrooms have turned dark brown and all of the moisture they release has evaporated (5-7 minutes). Turn the heat down slightly to medium-low, add the flour, and continue to sauté until the flour begins to coat the bottom of the skillet and turns golden brown (about 2-3 minutes).",
    "Whisk the vegetable broth into the skillet with the flour and mushrooms. Whisk until all the flour has dissolved off the bottom of the skillet. Add the thyme, sage, and some freshly cracked pepper. Turn the heat up to medium and allow the sauce to come to a simmer, at which point it will thicken.",
    "Stir the half and half into the sauce and allow it to return to a gentle simmer. Taste the sauce and adjust the salt or pepper as needed (the amount of salt needed will depend on the type of broth used. I added approximately ¼ tsp).",
    "Add the drained pasta to the sauce in the skillet. Toss to coat and allow the pasta to heat through over medium-low heat. The pasta will absorb some of the liquid and flavors, and further thicken the sauce. Serve hot."
  ],
  "ingredients": [
    "0",
    "8oz. mushrooms $1.99",
    "12oz. fettuccine $0.75",
    "2 cloves garlic, minced $0.16",
    "3 Tbsp butter $0.33",
    "3 Tbsp all-purpose flour $0.03",
    "1.5 cups vegetable broth $0.19",
    "3 sprigs fresh thyme (or ¼ tsp dried) $0.32",
    "1 tsp rubbed sage $0.10",
    "½ cup half and half $0.62",
    "Salt and pepper to taste $0.05"
  ],
  "__v": 1
}