{
  "__v": 1,
  "directions": [
    "0",
    "To make the dough: In a small saucepan over medium low heat add the milk and butter. Stir until the butter has melted and remove from heat. Let stand until luke warm temperature.",
    "In a large mixing bowl whisk together 2¼ cups flour, yeast, sugar, and salt. Add to the stand mixer with dough hook attached. (You can also make this by hand, just knead until smooth once all of the ingredients are added.) Add the egg and water and mix until just starting to combine. Slowly add in the milk mixture and 1 cup of flour until the dough starts to form and become smooth. Let the dough rest for 10 minutes.",
    "On a lightly floured surface, roll the dough into a large 9×15 square. About ¼-1/2 inch thick. Spread strawberry pie filling evenly on top of the dough. In a small bowl combine the cinnamon and sugar and sprinkle on top of the strawberry filling. Roll up the 15 inch side into a log and pinch the seams. Cut into 9-12 slices depending on how thick you want your cinnamon rolls. Place in a greased 9×13 inch pan and cover with a damp cloth and let rise for 30 minutes.",
    "Preheat oven to 375 degrees. Bake for 30 minutes or until just golden brown on the tops.",
    "To make the glaze: Beat together the cream cheese, butter, and powdered sugar until smooth. Add the half and half, vanilla, lemon juice and lemon zest until combined. Frost over warm cinnamon rolls and enjoy!"
  ],
  "firstAdded": "2014-07-20T19:31:56.550000",
  "hash": "3a5a7b642d60475fb622088bfbd30a77a2596939",
  "href": "http://therecipecritic.com/2014/04/strawberry-cinnamon-rolls-lemon-cream-cheese-glaze/?utm_source=feedburner&utm_medium=email&utm_campaign=Feed:+TheRecipeCritic+(The+Recipe+Critic)",
  "image": "http://therecipecritic.com/wp-content/uploads/2014/04/strawberrycinnamonrolls.jpg",
  "ingredients": [
    "0",
    "Dough Ingredients:",
    "3¼ cups flour",
    "2 tsp instant yeast",
    "¼ cup white sugar",
    "½ teaspoon salt",
    "1 egg",
    "¼ cup water",
    "¾ cup milk",
    "⅓ cup butter, softened",
    "Filling Ingredients:",
    "21 ounce can Lucky Leaf Strawberry Pie Filling",
    "2 teaspoons cinnamon",
    "½ teaspoon sugar",
    "Lemon Cream Cheese Frosting:",
    "4 ounce cream cheese, softened",
    "3 Tablespoons butter, softened",
    "1 cup powdered sugar",
    "¼ cup half and half",
    "2 teaspoons lemon juice",
    "1 Tablespoon lemon zest (one lemon)",
    "1 teaspoon vanilla"
  ],
  "keywords": [
    "dough",
    "flour",
    "instant",
    "yeast",
    "white",
    "sugar",
    "salt",
    "egg",
    "water",
    "milk",
    "butter",
    "softened",
    "filling",
    "lucky",
    "leaf",
    "strawberry",
    "pie",
    "cinnamon",
    "lemon",
    "cream",
    "cheese",
    "frosting",
    "juice",
    "zest",
    "vanilla"
  ],
  "title": "Strawberry Cinnamon Rolls with Lemon Cream Cheese Glaze",
  "users": [
    null
  ]
}