{
  "hash": "9734180bf106e969fdc7c458bffb77665cecca52",
  "title": "Southwestern Chopped Chicken Salad\nyield: SERVES 6 prep time: 10 MINU",
  "image": "",
  "href": "https://sallysbakingaddiction.com/2016/07/01/southwestern-chopped-chicken-salad/",
  "extension": "Chrome",
  "firstAdded": "2018-08-29T19:59:30.733000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "Add all of the salad ingredients to a large bowl. (If you're not serving it right away, add the tortilla chips on last right before serving. They'll stay crunchy that way.)",
    "Whisk the dressing ingredients together, except for the salt. Taste, then add salt to your preference.",
    "Spoon dressing over salad, then give everything a big toss to combine. Serve cold.",
    "Make ahead tip: You can prepare this salad the day before through step 3. The flavors get even better on day 2! Add the tortilla chips right before serving.",
    "Recipe Notes:",
    "For the grilled chicken, I drizzled 3 large chicken boneless skinless breasts with olive oil and seasoned with salt and pepper before grilling. This was about 5-6 cups of cubed chicken. You can also use store-bought rotisserie chicken or just any leftover cooked chicken you have.",
    "Did you make a recipe?",
    "Tag @sallysbakeblog on Instagram and hashtag it #sallysbakingaddiction.",
    "© SALLY’S BAKING ADDICTION. All images & content are copyright protected. Please do not use my images without prior permission. If you want to republish this recipe, please re-write the recipe in your own words, or link back to this post for the recipe.",
    "I love serving cookies as dessert because they’re the essential make-ahead recipe. I default to cookies since cookie dough usually has to chill and even if not, cookies are always still just as tasty the next day or day after. Not to mention, everyone LOVES cookies especially ones with sprinkles and/or M&Ms. And cookies travel well! I made these cake batter chocolate chip cookies yesterday. Chilled the dough in the early afternoon, then baked them later on. Dessert for the entire weekend!",
    "Also made these rainbow M&M cookies on Snapchat yesterday! (@sallysbakeblog)",
    "Post navigation",
    "← Backyard BBQ",
    "Comment & Bake Challenge (with a baking bundle giveaway!) →",
    "88 Comments",
    "All Comments Reviews Questions",
    "Comments",
    "Austria Azaceta on August 2, 2016 at 1:01 pm",
    "Hi Sally!",
    "So i made this salad for dinner last night & it was SO delicious!! My husband & I loved it! I used a half block of cheddar & diced it small instead of shredded, & i chopped up the jalapeno & threw it in the salad instead of the dressing. The crushed tortilla chips was a wonderful touch. I’m thinking some black olives might be a good addition next time. Yum! Also, recently made your lemon herb salmon with brussel sprouts recipe as well & definitely another winner!! Love love love your blog!!",
    "Reply",
    "Sally on August 3, 2016 at 11:50 am",
    "Yes to black olives!! I’m definitely adding those when I make this again. Thanks for reporting back, as always!",
    "Reply",
    "Fran on August 21, 2016 at 1:08 am",
    "Knew when I read the recipe that it was a winner. Had a six friends in for a birthday party and girls night out. Had rave reviews and I have to agree. All of the flavors blend perfectly! Great combination of textures, and so pretty. This is the most gigantic salad I have ever seen, cut it by one third, but hard as we tried, we just barely ate half. Went very light in dressing, so expect it to be tasty tomorrow. It will be a new favorite for main course salads. Love, love, love it!",
    "Reply",
    "Sally on August 21, 2016 at 5:28 pm",
    "It does make a ton! I’m happy it was a hit. Thanks for coming back and letting me know!",
    "Reply",
    "sarah on August 28, 2016 at 3:22 am",
    "hi sally – can’t get greek yogurt here. what can we use as a substitute? light sour cream mixed with some regular plain nonfat yogurt?",
    "Reply",
    "Sally on August 29, 2016 at 2:43 pm",
    "Hi Sarah– that’s what I would do. A mix of sour cream and plain yogurt. Or you can use all plain yogurt.",
    "Reply",
    "Charlsie on September 28, 2016 at 11:11 pm",
    "Hi Sally! I make all my meals on the weekends to eat throughout the week–love all your make-ahead recipes! If I made this salad on a Sunday do you think it would be okay on Wednesday or even Thursday? It might be stretching it, but what do you think?",
    "Thanks!",
    "Reply",
    "Sally on September 29, 2016 at 1:25 pm",
    "I think that if you add a little bit of the dressing to what you are eating that day, it will be fine. The lettuce will be a little wilted by Thursday if you dress it all on Sunday. That’s what I do!",
    "Reply",
    "Marlene on October 18, 2016 at 7:53 pm",
    "Hi Sally! Need to make this dressing fairy-free. What can I use to substitute the Greek yogurt?",
    "Reply",
    "Cyndy Satterfield on April 25, 2017 at 1:29 pm",
    "Try using soft tofu as a sub for the yogurt. It should pick up all the flavors for you.",
    "Reply",
    "Kala on October 19, 2016 at 6:32 pm",
    "SALLY!! This salad is AMAZING!!! I’m a vegetarian, so I used Morningstar chik’n griller strips instead of chicken. The hubs and I devoured it!!! I can’t wait to eat it for lunch tomorrow too!! You can’t even tell that the dressing is made with yogurt!! Thanks for another delicious recipe!! LOVE your blog!!!",
    "Reply",
    "Sally on October 20, 2016 at 12:27 pm",
    "Thank you so much, Kala! Glad you both like the recipe!",
    "Reply",
    "Jillian on November 17, 2016 at 6:24 pm",
    "I detest salad. It never fills me and the feeling of leaves in my mouth is just weird. And yet… this was hands down one of my favorite chicken dishes ever and has been added into the regular schedule.",
    "I’m leaving in a week for Key West, so decided I should try something on the lighter side calorie-wise (yeah, I know I should have started this plan more than a week in advance…), and holy crap am I glad I did. The flavors worked perfectly here, and that dressing is amazing! I seasoned some chicken breasts with more cajun seasoning and browned them in my cast iron. Wouldn’t change a thing (except excluding the red onions because they’re yucky! lol!)!!",
    "Reply",
    "Carmen on January 6, 2017 at 7:33 pm",
    "Just wanted to say, I found this salad last night…I was looking for a salad recipe to change up the traditional winter menu. My husband and I made it tonight and we all loved it! We used rotisserie chicken to help make it a quicker week night meal. I just couldn’t believe the combination of the dressing ingredients would give such awesome flavour. Definitely going in my recipe book! Thanks.",
    "Reply",
    "Debbye on January 18, 2017 at 12:33 am",
    "Loved! Loved! Loved this salad! So delicious, so fresh and so easy to prepare. My entire family loved it, even my very picky little boys. The dressing was absolutely yummy and way better and healthier than ranch for this type of salad. Thank you!",
    "Reply",
    "Laura on March 20, 2017 at 2:43 pm",
    "Has anyone tired the salad without chicken? I’m thinking about making this for a potluck tomorrow where there will be a taco bar so I don’t need to add chicken. Let me know how it is without chicken.",
    "Reply",
    "Laura on March 20, 2017 at 2:47 pm",
    "Never mind. Just read at the top about leaving out the chicken to make it a side dish. Can’t wait to try this salad!",
    "Reply",
    "Sammi Harasymchuk on March 29, 2017 at 9:51 am",
    "Hi!! Made this last night for a dinner and it was SOOO tasty! I even had my boyfriend asking me to make it again soon! The only change I made was omitting the raw tomatoes and adding some medium salsa to the dressing!!! Thanks for the great dinner inspiration Sally!",
    "Reply",
    "Sally on March 29, 2017 at 1:13 pm",
    "I love that addition to the dressing! I’m absolutely going to try it soon.",
    "Reply",
    "steve g on April 30, 2017 at 4:59 pm",
    "Love Chilis Explosion Salads. One of my All time Favorite Salads.",
    "Reply",
    "Kebra on July 6, 2017 at 9:58 pm",
    "Any idea on how many calories?",
    "Reply",
    "Sally on July 7, 2017 at 10:08 am",
    "Hi Kebra! I’m unsure. Calorie counting calculators online can often be inaccurate (different brands/products/etc) and I would hate to publish wrong information on my website. Sometimes I share an estimate, but that’s rare– feel free to calculate at your own discretion!",
    "Reply",
    "Stephanie on July 7, 2017 at 12:32 pm",
    "Just ate this for lunch and it was DELICIOUS! I only used lettuce, chicken, tomatoes, cheese and the dressing. It was perfect! I will add corn next time.",
    "Yummmmmy!",
    "Reply",
    "Heather on August 1, 2017 at 2:11 pm",
    "Can i get the calorie info?",
    "Reply",
    "Sally on August 1, 2017 at 4:43 pm",
    "Hi Heather! Calorie counting calculators online can often be inaccurate (different brands/products/etc) and I would hate to publish wrong information on my website. Sometimes I share an estimate, but that’s rare– feel free to calculate at your own discretion!",
    "Reply",
    "Sarju on August 2, 2017 at 9:45 am",
    "Hi Sally, This salad looks very delicious. I am thinking of trying it as a “jar salad” making it easier to prep for the work week. Are there any items you recommend I avoid in that case?",
    "Reply",
    "Sally on August 2, 2017 at 9:48 am",
    "I would maybe add the avocados the day you’ll eat the salad– other than that, it’s great!",
    "Reply",
    "Daci on August 5, 2017 at 10:48 am",
    "Hi Sally. I can’t wait to make this! I will be making it for a few people who are sensitive to spicy heat. How spicy is the dressing using fresh jalapeños? I know they can handle green Tabasco sauce. Do you think that would work as a substitution? Thanks!",
    "Reply",
    "Sally on August 5, 2017 at 4:00 pm",
    "I’m not a huge fan of SUPER spicy and I love this dressing as is. You can add a little jalapeño and taste OR go for the Tabasco sauce– whichever you prefer.",
    "Reply",
    "Jessica on August 23, 2017 at 11:50 am",
    "I don’t have Greek yogurt. Would mayo work for the dressing? I also have sour cream. I know… not as healthy… but can’t get to a store today",
    "Thanks!",
    "Reply",
    "Sally on August 23, 2017 at 1:18 pm",
    "I would use a mix of sour cream and mayo!",
    "Reply",
    "valerie lester on October 23, 2017 at 4:42 pm",
    "Hi Sally,this is my first time ‘blogging’ but I just had to let you and the rest of your fans know; me,myself, Im a texture type of gal…I especially like the various flavors of the southwest salad,but the textures are extremely yummy too! But you know what kicks it up a notch??? Kale! Yes,good ole kale. It adds such a crunch to the salad that romaine by itself cant touch. I usually just chop it fine and add(to your liking)to the lettuce and i mix all ingredients right before serving (seem to stay crispier that way). Some people may slightly saute, but I love it fresh,hence the ‘fine’ chop.P.S. Dont tell the kids, but kale is loaded with vitamins",
    "Reply",
    "Sarah on December 18, 2017 at 8:26 pm",
    "OH, MY, GOSH Mrs.Sally! Lol",
    "I absolutely LOVE the way you choose to word your recipes!",
    "Rather than having a recipe with no options or alternatives, yours is exactly that, full of options!!",
    "Most people will take a good recipe and tailor it to their liking, then think that they’ve done something outstanding… You, on the other hand, leave the option for customization right there on the table and I genuinely LOVE that!",
    "Thank you so much!",
    "Reply",
    "Sally on December 19, 2017 at 2:33 pm",
    "I’m glad you appreciate that about some of my recipes! It’s defiantly true that not everyone has the exact same tastes",
    "Reply",
    "Tara on May 21, 2018 at 9:53 pm",
    "Oh em gee this salad is good!!!",
    "I went with scallions instead of red onion, added butter lettuce, and added kidney beans along with the black beans. I wasn’t crazy about the dressing, but when added to the salad it was SO GOOD! Thank you Sally for so many azing recipes.",
    "Reply",
    "Chantal on May 27, 2018 at 8:46 pm",
    "Just had this Salad for dinner tonight and my husband and I agreed it’s one of the best salads we’ve had! We followed it exactly and it was perfect",
    "Reply",
    "Olivia on June 5, 2018 at 8:35 am",
    "Wow… I’m lost for words..",
    "This is such a filling, hearty, healthy meal- I packed some for lunch to try it for the first time and could hardly finish it all (but trust me I tried!)",
    "I’ll be making this for dinner again soon because there’s so much nutrition in there, but the seasoning and tortilla chips make it taste sooo good. Even my brother who never eats fruit or veg had to admit it was delicious.",
    "It’s also surprisingly budget friendly- use leftover grilled chicken (is there such a thing?!) and fruit and veg (I mean, you can pretty much fling anything in there!) and you’ve got a decent low-cost meal enough to feed a family of five for a week (not quite, but it does make a lot!)",
    "I added more onion and garlic than the recipe said, and also left out the coriander (not by choice, I love the stuff! Couldn’t find it in any of the shops but next time if I can get it, I’m expecting even greater things from this recipe!)",
    "Anyone who does not try this recipe should be branded a criminal",
    "Reply",
    "Olivia on June 5, 2018 at 8:38 am",
    "Budget friendly,",
    "Filling,",
    "Nutritious,",
    "Delicious,",
    "A crowd pleaser,",
    "Easy to make,",
    "Family friendly,",
    "Healthy,",
    "Totally amazing,",
    "What more can I say?",
    "Reply",
    "Gina on June 16, 2018 at 4:47 pm",
    "Hi Sally. My husband would LOVE this salad. Trying to portion the ingredients for 1-2 people is just too difficult. I’m assuming I could just portion out enough for him as if I were making his regular salads? Any suggestions would be helpful. Hope you are doing well and that Noelle is growing and having fun.",
    "Reply",
    "Sally on June 18, 2018 at 9:54 am",
    "Hi Gina! I suggest using all of these ingredients, but scaled down, to make a smaller portion. You can use more/less of any ingredient based on his taste. Or make the recipe as written and potion into 6 servings for the week.",
    "Reply",
    "Danielle on August 10, 2018 at 11:32 pm",
    "currently eating this salad…it’s amazing! thank you for the recipe!!!",
    "Reply",
    "« Older Comments",
    "Leave a Comment",
    "Comment",
    "I HAVE A... Comment Review Question",
    "Name (required)",
    "Email (will not be published) (required)",
    "Website",
    "Subscribe to comment",
    "This site uses Akismet to reduce spam. Learn how your comment data is processed.",
    "With kitchen-tested quality recipes and step-by-step tutorials, my goal is to give you the confidence to bake and cook from scratch.",
    "Top 5 Recipes",
    "Homemade Strawberry Cake",
    "Super Moist Chocolate Cupcakes",
    "The Best Banana Cake I’ve Ever Had",
    "Lemon Blueberry Layer Cake",
    "The Best Soft Chocolate Chip Cookies",
    "Recipes You'll Love",
    "Light-as-air Angel Food Cupcakes",
    "Homemade Cherry Pie",
    "Seriously Fudgy Homemade Brownies",
    "Chewy Chocolate Chunk Cookies",
    "Categories",
    "Archives",
    "Cookie Palooza",
    "A tradition since 2013, every December we countdown to Christmas with 10 new cookie recipes in a row!",
    "View More...",
    "Baking Challenge",
    "Join the community on the 1st of every month as we tackle a new challenge recipe.",
    "View More...",
    "Pie Week",
    "The first week of every November is all about Thanksgiving Pies.",
    "View More...",
    "My Cookbooks",
    "SALLY'S COOKIE ADDICTION",
    "SALLY'S BAKING ADDICTION",
    "SALLY'S CANDY ADDICTION",
    "@sallysbakeblog",
    "About Sally",
    "Welcome to my kitchen!",
    "I’m Sally, a cookbook author, photographer, and blogger. My goal is to give you the confidence and knowledge to cook and bake from scratch while providing quality recipes and plenty of pictures. Grab a cookie, take a seat, and have fun exploring! more about Sally",
    "TOP RECIPES",
    "Homemade Strawberry Cake",
    "Super Moist Chocolate Cupcakes",
    "The Best Banana Cake I’ve Ever Had",
    "Lemon Blueberry Layer Cake",
    "The Best Soft Chocolate Chip Cookies",
    "SHOP",
    "Sally’s Baking Addiction",
    "Sally’s Candy Addiction",
    "Sally’s Cookie Addiction",
    "READ",
    "Baking Tips",
    "Blogging",
    "FAQ",
    "MORE",
    "Contact",
    "About",
    "Home",
    "FOLLOW ME",
    "SEARCH",
    "© 2018 Sallys Baking Addiction. Created with by Grateful Ventures .",
    "×",
    "HOME",
    "ABOUT",
    "RECIPES",
    "COOKBOOKS",
    "BAKING TIPS",
    "BEHIND THE SCENES",
    "SALLY’S COOKIE PALOOZA",
    "SALLY’S BAKING CHALLENGE",
    "SALLY’S PIE WEEK",
    "CONTACT",
    "Select Directions",
    "(note: you can drag this box around to make it easier to highlight the recipe)",
    "Ple"
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "6 cups chopped romaine lettuce",
    "6 cups cubed cooked chicken1",
    "1 and 1/2 cups corn",
    "1 and 1/2 cups black beans",
    "2 tomatoes, diced",
    "1 avocado, diced",
    "1/2 red onion, diced",
    "3/4 cup shredded cheddar cheese",
    "1 cup crushed tortilla chips",
    "handful chopped cilantro",
    "DRESSING",
    "1/2 cup plain Greek yogurt (I use nonfat)",
    "3 Tablespoons extra virgin olive oil",
    "2 teaspoons honey",
    "2 teaspoons apple cider vinegar",
    "1 teaspoon minced garlic",
    "juice of 1 lime",
    "1/2 jalapeño, finely diced",
    "2 heaping teaspoons taco seasoning (I use mild)",
    "salt, to taste and if needed"
  ],
  "__v": 1
}