{
  "hash": "ab67fe4686b002980489a9a00c849d085231fe4f",
  "title": "Green Onion Pancakes",
  "image": "https://www.thelittleepicurean.com/wp-content/uploads/2018/02/green-onion-pancakes-3.jpg",
  "href": "https://www.thelittleepicurean.com/2018/02/green-onion-pancakes.html",
  "extension": "Firefox",
  "firstAdded": "2018-12-03T23:06:04.414000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "umpling Dough:",
    "Put flour in a large bowl. Add water. Using a rubber spatula, wooden spoon, pair of chopsticks, or your fingers, stir the water and flour together until a shaggy ball of dough starts to form. Use your hands to start kneading the dough and incorporating any remaining flour. The dough should feel slightly tacky but not damp. It should not stick to your fingers.",
    "Dust work surface with flour. Remove dough from bowl and knead for about 2 minutes. It should feel smooth. Cover dough with a damp towel or plastic wrap, and let it rest on the counter for 20 minutes.",
    "Assembly:",
    "Divide dough into quarters. Roll a section out to about 8 1/2 inches in diameter. Brush a coating of oil on the dough. Sprinkle about 1/2 teaspoon salt across oiled dough. Sprinkle 2 to 3 tablespoons of green onions. Start from the bottom edge of the dough, roll dough tightly into a tube, then take one end and create a tightly wound coil. Tuck the end under the coil. Now, roll the coil flat until it's about 6 1/2 inches in diameter and 1/8 inch thick. Repeat with remaining sections of dough.",
    "Preheat an 8-inch skillet over medium-low heat for about 1 minute. Add 2 tablespoons of oil and heat for about 5 seconds, or until it starts to shimmer. Add a pancake and fry for 1 1/2 to 2 minutes, or until golden. Flip and repeat. Remove the pancake and set aside on a plate. Add 1 tablespoon of oil to the pan before cooking each of the remaining pancakes. Cut the pancakes into wedges and serve with dipping sauce.",
    "Soy-Ginger Dipping Sauce:",
    "In a small bowl, combine soy sauce, vinegar, green onion, garlic, cilantro, ginger, and chili sauce. Set aside on the counter for at least 30 minutes, if possible, to let the flavors meld together. The longer the mixture rets, the more intense the flavors becomes. Store dipping sauce in a sealed container in the refrigerator for up to 1 week."
  ],
  "ingredients": [
    "0",
    "1 batch Dumpling Dough (recipe follows)",
    "5 Tablespoons vegetable oil*, plus more for coating the dough",
    "2 teaspoons kosher salt, divided",
    "4 stalks green onions, finely chopped",
    "Soy-Ginger Dipping Sauce, for serving (recipe follows)"
  ],
  "__v": 1
}