{
  "hash": "5241447a8ff773b616477867522438cdca97b96b",
  "title": "King Arthur's Caribean Rum Cake",
  "image": "http://gc.pinchstatic.com/recipe/317/3-1-7-3-6-8_normal.1604082314.jpg",
  "href": "http://www.justapinch.com/recipes/dessert/dessert-cake/king-arthurs-caribean-rum-cake.html?p=106",
  "extension": "Chrome",
  "firstAdded": "2016-08-29T00:45:50.248000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1Preheat oven to 325°F. Spritz a 10 to 12 cup bundt pan with cooking spray. Sprinkle on the pecan flour and turn the pan to coat evenly. Set aside.",
    "2Place all of the cake ingredients except the rum, vanilla and butter rum flavoring in the bowl of your stand mixer and blend on medium speed for 2 minutes. Be sure to scrape down the bowl after one minute.",
    "3Add the rum, vanilla and flavor if using to the batter and blend for another minute. Pour the batter into the prepared bundt pan and spread level with a spatula.",
    "4Bake the cake for 50 to 55 minutes. You may smell the nut flour toasting at first, especially those not covered in cake batter. When done, the cake will test clean on a cake tester. Bundt cakes are difficult to test properly with a short toothpick. Instead try a piece of dry uncooked spaghetti or linguine.",
    "5Leave the cake in the pan to cool slightly while you make the soaking syrup.",
    "6In a medium-sized saucepan combine the syrup ingredients, except vanilla. Bring to a rapid boil then reduce to a simmer and cook for about 5 to 8 minutes, until the syrup thickens slightly. Remove from the heat and stir in the vanilla.",
    "7Pour about 1/4 of the syrup over the cake (still in the pan). Allow the syrup to soak in, then repeat again and again until all the syrup is used.",
    "8Cover the pan loosely with plastic wrap and allow the cake to sit out overnight to cool completely and soak in the syrup. When ready to serve, loosen the edges of the cake and invert on to your serving plate.",
    "9Serve with hot coffee or tea. The cake is very moist, fragrant and potent.",
    "10Yield: one large or two small bundt cakes. Cake freezes very well. kingarthurflour.com/...?go=EP121126J"
  ],
  "ingredients": [
    "0",
    "2 c king arthur all purpose flour",
    "1 1/2 c sugar",
    "1/2 c butter, unsalted, softened",
    "1/2 c pastry cream filling mix or instant vanilla pudding mix",
    "2 tsp baking powder",
    "1 tsp salt",
    "1/2 c vegetable oil",
    "1/2 c milk",
    "4 large eggs",
    "1/2 c white or golden rum",
    "1/4 tsp butter rum flavor",
    "1/4 c pecan flour, for dusting baking pan",
    "1/2 c butter, unsalted",
    "1/4 c water",
    "1 c sugar",
    "1/2 c white or golden rum",
    "1/2 tsp vanilla"
  ],
  "__v": 1
}