{
  "hash": "dd4f64b09522e6beaf365684824b0b769238d880",
  "title": "Butternut Squash Mac 'n Cheese",
  "image": "http://ohsheglows.com/wp-content/uploads/2011/10/IMG_2422_thumb.jpg",
  "href": "http://ohsheglows.com/2011/10/03/butternut-squash-mac-n-cheeze/",
  "extension": "",
  "firstAdded": "2017-11-19T16:56:16.403000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 425°F (220°C). Line a large baking sheet with parchment paper. Lightly spray or brush the oil onto the orange flesh of each squash half. Garnish with salt and pepper. Place the halves cut-side down on the baking sheet. Roast for about 35 to 50 minutes, uncovered, until a fork or knife easily slides through the squash. The skin will be lightly browned and the squash may be brown in some spots (which only adds to the flavour).",
    "When there are about 20 minutes left of the squash’s roasting time, cook the pasta according to the package directions. Drain.",
    "After the squash is finished cooking, flip it flesh-side up and let it cool for 10 minutes or so before handling.",
    "Into a blender, add the cheese sauce ingredients (butter, milk, starch, nutritional yeast, Dijon, garlic and onion powder, lemon juice, salt, pepper, and miso) along with 1 lightly packed cup of the roasted squash (simply spoon it out of the skin and measure). Blend on high until smooth.",
    "Add the cooked and drained pasta back into the pot and stir in all of the cheese sauce. Chop the leftover squash into small cubes, scoop the cubes out of the skin, and add them into the pot (along with any other mix-ins you like). Heat over medium and stir until thickened. Add more salt and pepper to taste (and more lemon juice if you want a bit more brightness). Serve immediately."
  ],
  "ingredients": [
    "0",
    "1 large or 2 medium (2 to 3 pounds total) butternut squash, halved and seeded*",
    "Grapeseed or sunflower oil",
    "Fine sea salt",
    "Freshly ground black pepper",
    "1 cup (180 g) roasted butternut squash",
    "1 tablespoon (14 g) vegan butter**",
    "3/4 cup (180 mL) unsweetened and unflavoured almond milk",
    "1 tablespoon (12 g) potato starch or cornstarch",
    "1/4 cup (20 g) nutritional yeast, or more to taste",
    "2 teaspoons (10 mL) Dijon mustard",
    "3/4 teaspoon garlic powder",
    "1/2 teaspoon onion powder",
    "1 tablespoon (15 mL) fresh lemon juice, or more to taste",
    "1/2 to 3/4 teaspoon fine sea salt, to taste",
    "Freshly ground black pepper, to taste",
    "2 to 3 teaspoons (10 to 15 mL) chickpea miso (or other light miso), to taste",
    "8 ounces (340 g) macaroni, mini shell, or rotini pasta (use gluten-free, if desired)",
    "Mix-ins of choice (e.g., cooked squash, kale, spinach, broccoli, peas, etc.)"
  ],
  "__v": 1
}