{
  "hash": "b62f298def5909ee2539a241857c461b5bfcdac7",
  "title": "no-knead sandwich bread: the easy bread anyone can master",
  "image": "http://blogs.mydevstaging.com/blogs/cooking/files/2014/05/550_close_up_sliced.jpg?r=23",
  "href": "http://www.recipe.com/blogs/cooking/no-knead-sandwich-bread-the-easy-bead-anyone-can-master/",
  "extension": "Chrome",
  "firstAdded": "2015-10-06T12:53:40.268000",
  "users": [
    null
  ],
  "keywords": [
    "bread",
    "flour",
    "wheat",
    "flaxseed",
    "meal",
    "instant",
    "active",
    "dry",
    "yeast",
    "salt",
    "water"
  ],
  "directions": [
    "0",
    "We go through a lot of bread in my house, between toast in the mornings, sandwiches for lunch, and the occasional grilled cheese. And since I’ve been trying to stick to a grocery budget for the past few months, I’ve been making my own for one simple reason: A 5 pound bag of flour, which makes 3-4 loaves depending on the recipe, costs the same or less money than the cost of one store bought loaf. But to make things easier on myself, I’ve mastered a super simple sandwich loaf recipe that creates amazing results. It’s no-knead and once the ingredients are mixed, it basically makes itself!",
    "I know that the original No-Knead recipe is the stuff of internet legends, but I always found the step of transferring the risen dough into a warm baking dish difficult. Relying on loaf pans and making sandwich loaves is much easier and it makes uniform loaves that are ideal for the way we use the finished result in my house. So, I took inspiration from this Whole Wheat Sandwich Bread recipe and this No-Knead Bread recipe and came up with a whole grain version that takes no more than 5 minutes to put together. It makes two loaves, and since the slices freeze beautifully—make sure to let them cool completely, then layer into a gallon freezer bag with parchment in between so they don’t stick together—it makes enough for two weeks.",
    "3 1/4 cups bread flour",
    "3 cups whole wheat flour",
    "1/4 cup flaxseed meal",
    "2 teaspoons instant or active dry yeast",
    "1 1/2 tablespoons salt",
    "3 cups warm water",
    "Mix the ingredients together and let sit for at least 5 hours at room temperature. (I always activate my yeast in one cup of the warm water with a tiny sprinkling of sugar just to be sure it’s working.) Divide dough in half and shape into loaves and place into greased 9×5 loaf pans. Let rise for about an hour or until the dough has risen to about the top of the pan. Bake at 450 F for 30 minutes, remove from oven and pan and let cool on wire racks.",
    "I also took inspiration from this Cinnamon Raisin Loaf recipe and did a similar variation with half of my dough. I simply mixed in 2 teaspoons cinnamon, 1/2 cup raisins, and 2 tablespoons sunflower seeds into the dough as I was shaping it for the loaf pan. It didn’t rise quite as much as the whole wheat loaf due to the weight of the mix-ins, but it smelled delicious when it came out of the oven and has been a big hit in my house.",
    "This recipe is easy enough to make that even a novice can do it, and the texture and flavor of the final result is impressive enough that you might swear off the store bought stuff too!"
  ],
  "ingredients": [
    "0",
    "3 1/4 cups bread flour",
    "3 cups whole wheat flour",
    "1/4 cup flaxseed meal",
    "2 teaspoons instant or active dry yeast",
    "1 1/2 tablespoons salt",
    "3 cups warm water"
  ],
  "__v": 1
}