{
  "__v": 1,
  "directions": [
    "0",
    "To the bowl of a stand mixer fitted with the paddle attachment (or large bowl and electric hand mixer), cream together the first 5 ingredients (through vanilla) on medium-high speed until light and fluffy, about 5 minutes.",
    "Stop, scrape down the sides of the bowl, and add the next 5 ingredients (through optional salt), and mix on low speed until just incorporated, about 1 minute; don't overmix.",
    "Add the candy corn, white chocolate chips, and mix until just incorporated.",
    "Using a medium 2-inch cookie scoop, form heaping two-tablespoon mounds (I made 20). Place mounds on a large plate, flatten mounds slightly, cover with plasticwrap, and refrigerate for at least 3 hours, or up to 5 days, before baking. Do not bake with warm dough because cookies will spread and bake thinner and flatter. Important note - Strategically place candy corn so that it's not baking directly on cookie sheet because it will melt, burn, or turn runny if it is. The candy corn pieces need to be in the interior of the cookies, shielded and buffered by dough.",
    "Preheat oven to 350F, line a baking sheet with a Silpat or spray with cooking spray. Place mounds on baking sheet, spaced at least 2 inches apart (I bake 8 cookies per sheet) and bake for about 9 minutes, or until edges have set and tops are just beginning to set, even if slightly undercooked, pale and glossy in the center. Do not overbake because cookies will firm up as they cool. Baking longer than 10 minutes could result in cookies with overly browned undersides. Allow cookies to cool on the baking sheet for about 5 minutes before transferring to a wire rack to finish cooking. Cookies will keep airtight at room temperature for up to 1 week or in the freezer for up to 4 months. Unbaked cookie dough can be stored airtight in the refrigerator for up to 5 days, or frozen for up to 4 months, so consider baking only as many cookies as desired and save the remaining dough to be baked in the future when desired."
  ],
  "firstAdded": "2014-07-25T23:11:06.698000",
  "hash": "34c43fc47dece322e2778697df7290229c7f22c0",
  "href": "http://www.averiecooks.com/2013/10/candy-corn-and-white-chocolate-softbatch-cookies.html",
  "image": "http://www.averiecooks.com/wp-content/uploads/2013/10/candycorncookies-16.jpg",
  "ingredients": [
    "0",
    "1/2 cup unsalted butter, soften",
    "3/4 cup light brown sugar, packed",
    "1/4 cup granulated sugar",
    "1 large egg",
    "1 tablespoon vanilla extract",
    "2 tablespoons cream or half-and-half",
    "2 cups all-purpose flour",
    "2 teaspoons corn starch",
    "1 teaspoon baking soda",
    "pinch salt, optional and to taste",
    "1 1/2 cups candy corn (1o to 11 ounces)",
    "1 cup white chocolate chips"
  ],
  "keywords": [
    "unsalted",
    "butter",
    "soften",
    "light",
    "brown",
    "sugar",
    "granulated",
    "egg",
    "vanilla",
    "cream",
    "halfandhalf",
    "allpurpose",
    "flour",
    "corn",
    "starch",
    "baking",
    "soda",
    "salt",
    "candy",
    "white",
    "chocolate",
    "chips"
  ],
  "title": "Candy Corn and White Chocolate Softbatch Cookies",
  "users": [
    null
  ]
}