{
  "hash": "d9366b335637deafa6e00a7155e26996a7eee40f",
  "title": "The Simple Biscuit Recipe",
  "image": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB122tcE.img?h=1119&w=1119&m=6&q=60&o=f&l=f",
  "href": "https://www.msn.com/en-us/foodanddrink/recipes/the-simple-biscuit-recipe-that-will-save-any-dinner/ar-BB12lMi1?li=BBnb7Kw",
  "extension": "Chrome",
  "firstAdded": "2020-04-10T01:49:24.859000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Step 1: Get the Dough Going",
    "The first step to making great simple biscuits is to whisk together your dry ingredients. Use the biggest mixing bowl you got and just give the flour, baking powder and salt a quick whisk—just to get them incorporated.",
    "1-800-Flowers.com® - The Trusted Name in Flowers",
    "No Matter the Occasion, 1-800-Flowers.com is the Best Place for Flowers & Gifts!",
    "Best Selling Flowers",
    "Rose Arrangements",
    "Same Day Delivery",
    "Birthday Flowers & Gifts",
    "Ad1800flowers.com",
    "Then grab your cold butter and cut it into cubes. Cut these butter bits into your dry ingredients with a pastry blender until the mixture looks like coarse crumbs. The last step of creating the dough is adding the milk. Stir it in until the dough is just moistened—no need to overwork it.",
    "Step 2: Knead the Biscuit Dough",
    "Next up, you'll give the biscuits a quick knead. Sprinkle your clean work surface with a bit of flour (just so it doesn't stick) and turn the dough out. Knead the biscuits gently eight to ten times. Then press the dough with your hands until it's a half-inch thick. Grab a 2-1/2-inch biscuit cutter and cut out your biscuits.",
    "Editor's tip: If you don't have a biscuit cutter or round cookie cutter, just use a glass or cup with a thin rim. Dip the edge into some flour and use that as a cutter. It works just as well.",
    "COVID-19 Symptoms Survey",
    "Help researchers at the Regenstrief Institute track the outbreak",
    "Go to the survey",
    "Step 3: Bake",
    "Finally, place your biscuits onto an ungreased baking sheet. Give them a little room—about an inch between each. Bake at 450ºF for 10 to 15 minutes or until golden brown. Serve them warm.",
    "Biscuit FAQs",
    "These simple biscuits are a breeze to make once you've got a hang of the recipe. Here are some answers to your most common biscuit questions and some tips to make sure you bake the fluffiest biscuits possible. They'll be so good you won't have leftovers!",
    "How do you keep biscuits fresh?",
    "Biscuits are best served fresh from the oven. Who doesn't love a warm biscuit anyway?",
    "However, you can store biscuits, too. Pop them in an airtight container and they'll keep on the countertop for two to three days. You can also store them in the freezer for up to three months. You can put them in a warm oven for a few minutes to revive them.",
    "How do you make homemade biscuits fluffy?",
    "The key to making fluffy homemade biscuits is not to overwork the dough. The more you stir or knead the dough, the tougher the biscuits will be. The trick is to stir the milk in until just combined and kneading the biscuits very gently.",
    "Also, be sure that you're measuring flour correctly. If you add too much flour, you can make the biscuits heavy and dense.",
    "Are biscuits better with butter or shortening?",
    "There are some recipes out there that call for shortening (like these fluffy biscuits), however, most call for butter. Butter provides more flavor than shortening and can create more flaky layers the way butter creates a flakier pie crust.",
    "What should you serve with biscuits?",
    "Biscuits make a great side with any dinner. As we said, these biscuits can make even simple weekday suppers special.",
    "But you don't need to save biscuits just for dinnertime. They're great served up at breakfast with country gravy or topped with good honey, homemade jam or even a little more butter."
  ],
  "ingredients": [
    "0",
    "2 cups all-purpose flour",
    "3 teaspoons baking powder",
    "1 teaspoon salt",
    "1/3 cup cold butter, cubed",
    "2/3 cup 2% milk"
  ],
  "__v": 1
}