{
  "hash": "494df72b4e6ce333878f9e9b4e1f0dbca017dca4",
  "title": "Whole Wheat Pancake Mix",
  "image": "https://cookieandkate.com/images/2017/12/whole-wheat-pancakes-recipe-2.jpg",
  "href": "https://cookieandkate.com/2017/whole-wheat-pancake-mix/",
  "extension": "",
  "firstAdded": "2018-05-06T12:24:53.938000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To make pancake mix: In a large mixing bowl, simply combine the flour, baking powder, baking soda, salt and cinnamon. Whisk until blended.",
    "Use immediately, or carefully transfer to an air-tight jar for storage (a quart-sized mason jar is perfect—to make it all fit, you may need to let the flour settle in the jar for a few minutes/tap the jar to condense the flour a bit). Store it in a cool, dark, dry place for up to 6 months.",
    "To make pancakes: In a 2-cup liquid measuring cup, combine the milk and vinegar. Stir to combine and let this homemade “buttermilk” mixture rest until it is lightly curdled, about 5 minutes.",
    "To the curdled buttermilk mixture, add the egg, melted butter and maple syrup. Whisk until thoroughly blended.",
    "Measure the pancake mix into a medium mixing bowl. Pour the liquid mixture into the flour mixture. Stir just until combined (a few small lumps are okay). Let the batter rest for 5 minutes so your pancakes will be nice and fluffy.",
    "Meanwhile, if you are using an electric skillet, preheat it to 375 degrees Fahrenheit. Otherwise, heat a heavy cast iron skillet or nonstick griddle over medium-low heat. You’re ready to start cooking pancakes once a drop of water sizzles on contact with the hot surface. If necessary, lightly oil the cooking surface with additional butter, oil, or cooking spray (nonstick surfaces likely won’t require any oil).",
    "Gently stir the batter one last time, in case the liquid has separated. Using a ⅓-cup measuring cup, scoop batter onto the warm skillet, leaving a couple of inches around each pancake for expansion.",
    "Cook until small bubbles form on the surface of the pancakes, 2 to 3 minutes (you’ll know it’s ready to flip when about ½-inch of the perimeter is matte instead of glossy). Flip the pancakes, then cook until lightly golden on both sides, 1 to 2 minutes more.",
    "Repeat the process with the remaining batter, adding more oil and adjusting the heat as necessary. Serve the pancakes immediately with toppings of your choosing, or keep them warm in a 200 degree Fahrenheit oven.",
    "Leftover pancakes can be stored in the refrigerator for up to 3 days, or frozen* for up to 2 months. To reheat, stack leftover pancakes and wrap them in a paper towel before gently reheating in the microwave."
  ],
  "ingredients": [
    "0",
    "4 cups white whole wheat flour or regular whole wheat flour",
    "2 tablespoons baking powder",
    "2 teaspoons baking soda",
    "1 teaspoon fine sea salt",
    "1 teaspoon ground cinnamon"
  ],
  "__v": 1
}