{
  "hash": "f66c39307d204af96f75cfc3a50769f86801dd4a",
  "title": "Deviled Eggs",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2007/04/deviled-eggs-vertical-a-600-600x900.jpg",
  "href": "http://www.simplyrecipes.com/recipes/deviled_eggs/",
  "extension": "Chrome",
  "firstAdded": "2015-06-20T08:47:46.696000",
  "users": [
    null
  ],
  "keywords": [
    "dozen",
    "eggs",
    "dijon",
    "mustard",
    "mayonnaise",
    "shallot",
    "onion",
    "tabasco",
    "salt",
    "pepper",
    "paprika"
  ],
  "directions": [
    "0",
    "1 First hard boil the eggs. (See how to make hard boiled eggs.) Fill up a large saucepan half-way with cold water and gently add the eggs. Cover the eggs with at least an inch of water, preferably two inches. Bring the water to a rolling boil. Cover, and remove from heat. Let sit covered for 10-12 minutes. Drain hot water from pan and run cold water over the eggs. (At this point if you crack the egg shells while the eggs are cooling, it will make it easier to peel the shells.) Let sit in the cool water a few minutes, changing the water if necessary to keep it cool.",
    "If you are working with very fresh eggs which can be difficult to peel when hard boiled, I suggest steaming the eggs to hard cook them instead. Just fill a saucepan with an inch of water and insert a steamer basket. Bring the water to a boil and place the eggs in the steamer basket. Cover and let the eggs steam from the boiling water for about 15 minutes. Then shock with cold water and peel.",
    "2 Peel the eggs. Using a sharp knife, slice each egg in half, lengthwise. Gently remove the yolk halves and place in a small mixing bowl. Arrange the egg white halves on a serving platter.",
    "3 Using a fork, mash up the yolks and add mustard, mayonnaise, onion, tabasco, and a sprinkling of salt and pepper. Add more mayonnaise as necessary to get to the creamy consistency you want.",
    "4 Pipe through a piping bag (star tip) or simply use a spoon to put the egg yolk mixture into the egg white halves. Sprinkle with paprika."
  ],
  "ingredients": [
    "0",
    "1 dozen eggs",
    "2 teaspoons dijon mustard",
    "1/3 cup mayonnaise",
    "1 Tbsp minced shallot or onion",
    "1/4 teaspoon Tabasco sauce",
    "Salt and pepper",
    "Paprika"
  ],
  "__v": 1
}