{
  "hash": "b3180c058e75e99a1737eb783d8032a5d6214678",
  "title": "Recipe Notes",
  "image": "http://atmedia.imgix.net/f5d94400071fe836892e7377739f6dde83430b49?auto=compress&w=640.0&fit=max",
  "href": "http://www.thekitchn.com/recipe-spicy-chicken-skewers-with-sun-dried-tomato-sauce-221801",
  "extension": "Chrome",
  "firstAdded": "2017-03-30T20:09:51.332000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the marinade: 1/4 cup extra-virgin olive oil 3 large garlic cloves, minced 2 tablespoons fresh rosemary leaves, roughly chopped 2 tablespoons freshly squeezed lemon juice 2 teaspoons red pepper flakes 1/2 teaspoon kosher salt 2 to 2 1/2 pounds boneless, skinless chicken thighs, trimmed and cut into 1-inch cubes",
    "For the basting sauce: 1 6.7-ounce jar sun-dried tomatoes packed in oil (do not drain) 1 large clove garlic, smashed 2 tablespoons sherry vinegar (See Recipe Notes) 1 tablespoon tomato paste 1 tablespoon honey 1/2 teaspoon red pepper flakes Kosher salt and freshly ground black pepper",
    "To grill: Canola oil, for brushing grill grates Lemon slices, for garnish Italian parsley, for garnish",
    "For the marinade, combine olive oil, garlic, rosemary, lemon juice, red pepper flakes, and salt in a large bowl and whisk to combine. Fold in chicken and stir to coat. Marinate for a minimum of 1 hour or overnight.",
    "For the basting sauce, place the sun-dried tomatoes along with their oil in a mini food processor and pulse until coarsely chopped. Add garlic, vinegar, tomato paste, honey, and red pepper flakes and process until the mixture is smooth. Season with salt and pepper and set aside.",
    "When ready to grill, thread the chicken onto skewers so the meat will lay flat against the grill, leaving a 1/2-inch space between pieces. Preheat a large grill pan over medium heat. Once hot, brush the grates with canola oil. Season the skewers generously with salt and pepper and place on the grill.",
    "Using a silicone brush, baste the top of the chicken with sun-dried tomato sauce. Cover the grill — if cooking indoors, tent the grill pan with foil to create an oven effect. After 5 minutes, flip the skewers and brush the other side with the basting sauce; cover. Continue cooking, turning if necessary, until chicken is cooked through, about 12 to 15 minutes total. (To check for doneness, cut into a piece with a thin-bladed knife; the center should be white or slightly pink.)",
    "Transfer the skewers to a clean serving platter. Scrape any leftover bits of caramelized basting sauce over the chicken. Serve warm with lemon slices and minced Italian parsley as garnish."
  ],
  "ingredients": [
    "0",
    "1/4 cup extra-virgin olive oil",
    "3 large garlic cloves, minced",
    "2 tablespoons fresh rosemary leaves, roughly chopped",
    "2 tablespoons freshly squeezed lemon juice",
    "2 teaspoons red pepper flakes",
    "1/2 teaspoon kosher salt",
    "2 to 2 1/2 pounds boneless, skinless chicken thighs, trimmed and cut into 1-inch cubes",
    "1 6.7-ounce jar sun-dried tomatoes packed in oil (do not drain)",
    "1 large clove garlic, smashed",
    "2 tablespoons sherry vinegar (See Recipe Notes)",
    "1 tablespoon tomato paste",
    "1 tablespoon honey",
    "1/2 teaspoon red pepper flakes"
  ],
  "__v": 1
}