{
  "hash": "dc9184e8e98aac1067c30f33e17a478ee70b1a9d",
  "title": "Creamy Chicken Quinoa and Broccoli Casserole",
  "image": "",
  "href": "http://pinchofyum.com/creamy-chicken-quinoa-broccoli-casserole",
  "extension": "Chrome",
  "firstAdded": "2015-03-07T14:43:17.106000",
  "users": [
    null
  ],
  "keywords": [
    "reduced",
    "sodium",
    "chicken",
    "broth",
    "milk",
    "used",
    "poultry",
    "seasoning",
    "flour",
    "water",
    "divided",
    "uncooked",
    "quinoa",
    "rinsed",
    "crumbled",
    "bacon",
    "sort",
    "boneless",
    "skinless",
    "breasts",
    "emerils",
    "essence",
    "basic",
    "blend",
    "gruyere",
    "cheese",
    "kind",
    "work",
    "broccoli",
    "florets"
  ],
  "directions": [
    "0",
    "Sauce: Preheat the oven to 400 degrees and generously grease a 9x13 baking dish (seriously, be generous because it really really sticks to the sides). Bring the chicken broth and ½ cup milk to a low boil in a saucepan. Whisk the other ½ cup milk with the poultry seasoning and flour; add the mixture to the boiling liquid and whisk until a smooth creamy sauce forms.",
    "Assembly: In a large bowl, mix the sauce from step one, one cup water, quinoa, and bacon and stir to combine. Pour the mixture into the prepared baking dish. Slice the chicken breasts into thin strips and lay the chicken breasts strips over the top of the quinoa mixture. Sprinkle with the seasoning. Bake uncovered for 30 minutes.",
    "Broccoli: While the casserole is in the oven, place the broccoli in boiling water for 1 minute until it turns bright green and then run under cold water. Set aside.",
    "Bake: Remove the casserole from the oven, check the mixture by stirring it around in the pan, and if needed, bake for an additional 10-15 minutes to get the right consistency. When the quinoa and chicken are cooked and the sauce is thickened, add the broccoli and a little bit of water (up to one cup) until the consistency is creamy and smooth and you can stir it up easily in the pan. Top with the cheese and bake for 5 minutes, or just long enough to melt the cheese."
  ],
  "ingredients": [
    "0",
    "2 cups reduced sodium chicken broth",
    "1 cup milk (I used 2%)",
    "1 teaspoon poultry seasoning",
    "½ cup flour",
    "2 cups water, divided",
    "1 cup uncooked quinoa, rinsed",
    "¼ cup cooked, crumbled bacon (optional... sort of)",
    "1 pound boneless skinless chicken breasts",
    "2 teaspoons seasoning (like Emeril's Essence or any basic blend you like)",
    "¼ cup shredded Gruyere cheese (any kind will work)",
    "3 cups fresh broccoli florets"
  ],
  "__v": 1
}