{
  "hash": "11d00aef648550f289cc714a8dca9a235b0bef1a",
  "title": "CHEESY SCALLOPED POTATOES AND HAM",
  "image": "",
  "href": "https://amindfullmom.com/cheesy-ham-and-scalloped-potatoes/",
  "extension": "Chrome",
  "firstAdded": "2020-05-10T12:36:12.678000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Preheat oven to 375 degrees. Grease a 2 1/2 quart baking dish.",
    "Layer half the potatoes in the baking dish and top with 1 cup diced ham. Repeat layers.",
    "Heat the butter over medium heat until melted, whisk in the flour and cook for 1 minute, to remove the flour taste from the roux. Slowly whisk in milk, salt, garlic powder, and onion powder and cook until milk is just about boiling. Whisk in the cheese until melted. Remove from heat.",
    "Pour the cheese sauce over the ham and potatoes. Use your hands or spoon to push the potatoes and ham into the cheese sauce before baking. This ensures that the nothing dries out.",
    "Sprinkle with paprika. Cover with foil and bake for 60 minutes. Remove foil and bake for an additional 25 minutes or until potatoes are tender.",
    "EQUIPMENT NEEDED",
    "mandoline",
    "2 Quart Casserole Dish",
    "NOTES",
    "If you are using a very salty or smoked ham, decrease the amount of salt to 1/2 teaspoon.",
    "My 6 cups of sliced potatoes was about 2.5 pounds or 3 large potatoes. I find it is easier for you to measure the potatoes after slicing by cups.",
    "If you like your potatoes really fall apart tender, you can parboil the potatoes whole for 7-9 minutes and then slice any layer in your casserole. This step is not necessary but does make the potatoes very creamy and falling apart tender. Personally, I prefer my potatoes to have a bit of texture and chew left to them after the baking.",
    "I used my 2 1/2 quart oval dish but any 2-3 quart casserole dish will work as long as it is deep enough to pour the cheese sauce over.",
    "I love to use sharp cheddar cheese in this Cheesy Ham Bake for really pronounced cheese flavor, but if you have Swiss, Colby, or even mozzarella--use that.",
    "The paprika sprinkling on top is COMPLETELY optional. It just adds color."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "2 cups diced ham",
    "6 cups russet potatoes scrubbed and sliced into 1/4 inch rounds",
    "1 tablespoon butter",
    "2 tablespoons flour",
    "2 cup milk",
    "1 cup shredded sharp cheddar cheese",
    "1 teaspoon kosher salt",
    "1/2 teaspoon garlic powder",
    "1/2 teaspoon onion powder",
    "1 teaspoon paprika optional"
  ],
  "__v": 1
}