{
  "hash": "feb92acdf4e322c05e5e18a92ee82567de1ae7a5",
  "title": "Judy Rodgers' Roasted Applesauce (and Savory Apple Charlottes)",
  "image": "//images.food52.com/4Fl5aZ6UfklpddaFf9rz_r3VJhE=/753x502/b9fb446b-9a75-42f1-8581-e19479ea6c17--food52_10-25-11-3328.jpg",
  "href": "https://food52.com/recipes/14948-judy-rodgers-roasted-applesauce-and-savory-apple-charlottes",
  "extension": "Firefox",
  "firstAdded": "2015-10-09T14:15:57.868000",
  "users": [
    null
  ],
  "keywords": [
    "rodgers",
    "uses",
    "crisp",
    "eating",
    "apples",
    "sierra",
    "beauties",
    "braeburns",
    "pippins",
    "golden",
    "galas",
    "salt",
    "sugar",
    "needed",
    "unsalted",
    "butter",
    "splash",
    "apple",
    "cider",
    "vinegar",
    "chunk",
    "dayold",
    "chewy",
    "peasantstyle",
    "bread",
    "wont",
    "use",
    "need",
    "plenty",
    "work",
    "order",
    "right",
    "shapes",
    "roasted",
    "applesauce"
  ],
  "directions": [
    "0",
    "Heat oven to 375 F.",
    "Peel, core, and quarter the apples. Toss with a little salt and, unless they are very sweet, a bit of sugar to taste. If they are tart enough to make you squint, add the full measure of sugar. Spread in a shallow baking dish that crowds the apples in a single layer. Drape with slivers of the butter, cover tightly with a lid or aluminum foil, and bake until the apples start to soften, 15 to 30 minutes, depending on your apples.",
    "Uncover, raise the heat to 500 F, and return the pan to the oven. Leave the apples to dry out and color slightly, about 10 minutes.",
    "When the tips of the apples have become golden and the fruit is tender, scrape them into a bowl and stir into a chunky mash. Season with salt and sugar to taste, then consider a splash of apple cider vinegar to brighten the flavor. (Try a drop on a spoonful to see if you like it.)",
    "You can stop here or go on to make the Savory Apple Charlottes.",
    "1",
    "Note: Make these ramekins in straight-sided 6-ounce ramekins or custard cups. Heat oven to 350 F.",
    "Slice the bread 1/8 inch thick. (Partially freeze if necessary to get even slices.) Avoiding the crust, cut 8 circles sized to fit the bottom of your custard cups, then cut 4 long rectangles to line the sides. Kitchen shears work well for this. The side piece should rise about 1/8 inch above the rims. (You can cut paper templates first to make this easy, but it's pretty forgiving.) A snug fit and even edges will make your charlottes prettiest. (Save scraps and rejects for croutons or bread crumbs.)",
    "Brush the bread evenly, on one side only, with the melted butter. Line the custard cups with the bread, pressing the buttered faces against the dishes. Set the 4 extra circles aside. Fill each cup with roasted applesauce. Set the remaining bread circles, buttered side up, on top, held in place by the surrounding bread. Press down lightly.",
    "Bake until golden brown on top, about 30 minutes. To serve, slide a knife around the edge of each charlotte, then turn out onto warm plates. If the bottom circles stick to the dish, retrieve them by sliding a salad fork under the edges. The charlottes should be golden brown all over, with tasty caramelized spots where the applesauce bled through the coarse-textured bread."
  ],
  "ingredients": [
    "0",
    "3 1/2 to 4 pounds apples (Rodgers uses crisp eating apples, like Sierra Beauties, Braeburns, Pippins, Golden Delicious or Galas)",
    "Pinch of salt",
    "Up to 2 teaspoons sugar, as needed",
    "About 2 tablespoons unsalted butter",
    "A splash of apple cider vinegar, as needed",
    "1",
    "A chunk of day-old, chewy, peasant-style bread (4 ounces or more -- you won't use more than 2 ounces, but you need plenty to work with in order to get the right shapes)",
    "About 2 to 3 tablespoons unsalted butter, melted",
    "About 1 1/3 cups Roasted Applesauce"
  ],
  "__v": 1
}