{
  "hash": "5ceb9cc49e8cf8c79c49ffca97b689a5fc484a09",
  "title": "Instant Pot Hamburgers",
  "image": "",
  "href": "https://www.simplyhappyfoodie.com/instant-pot-hamburgers/",
  "extension": "Chrome",
  "firstAdded": "2019-03-23T16:40:40.185000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Add 1 1/2 cups of water to the inner stainless liner of the 6 qt pressure cooker (Use 2 1/2 cups for the 8 qt).",
    "Place the trivet in the pot also.",
    "Mix all of the hamburger meat mixture ingredients together in a bowl with the meat.If making Version #2, mix the soup packet with the ground meat.",
    "Divide the meat mixture into 4 equal (4 oz) patties, 3 (5 oz) patties, or 2 (8 oz patties). press your thumb into the center of each patty to make an indentation.",
    "Wrap patties in foil (not heavy duty) or parchment. The wrapping and cooking under pressure is what steams them.",
    "Stack the wrapped patties on the trivet in a staggered pattern. Then place the lid on the pot and set the steam release knob to the Sealing position.",
    "Press the Pressure Cook/Manual button, or dial and then the + or - button, or dial to select:11 minutes for 4 oz patties (7 minutes for a touch rare)13 minutes for 5 oz patties (9 minutes for a touch rare)15 minutes for 8 oz patties (11 minutes for a touch rare)High pressure.",
    "When the cook cycle is finished, do a Quick Release of the pressure/steam (that means turn the steam release knob to the Venting position right after cooking is finished).",
    "Carefully remove the patties from the pot using tongs. Then let them rest for 5 minutes. Then unwrap them on a plate to catch the drippings, and make up your hamburger with all of your favorite fixin's!"
  ],
  "ingredients": [
    "0",
    "Hamburger Meat Mixture #1",
    "1 lb Ground Beef (I use 80% - 85% lean)",
    "1 tsp Salt",
    "1/2 tsp Pepper",
    "1 tsp Garlic Powder",
    "1/4 cup Onion, finely chopped or grated (or 1 Tbsp dehydrated onion or 1/2 tsp onion Powder)",
    "1 tsp Smoked Paprika (optional)",
    "2 tsp Worcestershire Sauce",
    "Hamburger Meat Mixture #2",
    "1 lb Ground Beef (I use 80% - 85% lean)",
    "1 1 oz Packet of Onion Soup Mix (mix with the meat)",
    "Fixings (use whatever you like!)",
    "4 Hamburger Buns",
    "Cheese Slices",
    "Tomato Slices",
    "Lettuce",
    "Mayo",
    "Ketchup",
    "Mustard"
  ],
  "__v": 1
}