{
  "hash": "4ae57e3b2b08466a42dccbd5424889429d8fb0c7",
  "title": "Provencal New Potatoes",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2011/07/provencal-new-potatoes-640.jpg",
  "href": "http://www.simplyrecipes.com/recipes/provencal_new_potatoes/",
  "extension": "Chrome",
  "firstAdded": "2016-03-20T23:29:03.033000",
  "users": [
    null
  ],
  "keywords": [
    "new",
    "look",
    "smallest",
    "potatoes",
    "bigger",
    "pieces",
    "medium",
    "onion",
    "direction",
    "root",
    "garlic",
    "peel",
    "vineripened",
    "plum",
    "tomatoes",
    "chunks",
    "olives",
    "green",
    "black",
    "kalamata",
    "nicoise",
    "red",
    "chile",
    "herbes",
    "provence",
    "olive",
    "oil",
    "wine",
    "vinegar",
    "kosher",
    "salt",
    "pepper",
    "chives"
  ],
  "directions": [
    "0",
    "1 Preheat oven to 400°F",
    "2 Put all ingredients (except chives) into a bowl, toss with your (clean) hands to coat completely with oil and seasonings.",
    "3 Spread out in an even layer in a roasting pan.",
    "4 Put the potatoes in the oven, cook for fifteen minutes at 400°F. Then reduce the heat to 375° and cook for 30 to 40 minutes more, until the onions and tomatoes are somewhat caramelized and the potatoes are cooked through.",
    "Halfway through cooking, stir the potatoes so that they remain well coated with oil and do not get dried out, and the bottom of the pan stays coated with oil.",
    "5 Remove from oven and let sit until cooled to room temperature.",
    "Sprinkle with freshly chopped chives to serve. Excellent served with steak and a side of greens. (You can toss fresh spinach or chard with the oil remaining in the potato roasting pan and put back into the oven for just a few minutes until just wilted.)"
  ],
  "ingredients": [
    "0",
    "2 lb small new potatoes (look for the smallest you can find, the potatoes should be no bigger than 1 1/2 inches, if they are bigger, cut them into 1 to 1 1/2 inch pieces)",
    "1 medium onion, sliced in the direction of root to top",
    "6 cloves of garlic, crushed with peel on (do not remove peel)",
    "2-3 small to medium vine-ripened tomatoes, or plum tomatoes, cut into 1 1/2-inch chunks",
    "10 pitted olives, green and black (Kalamata and Nicoise)",
    "1/2 teaspoon red chile flakes",
    "1/4 teaspoon garlic powder",
    "1 Tbsp herbes de Provence",
    "1/2 cup olive oil",
    "2 teaspoons red wine vinegar",
    "2 teaspoons Kosher salt",
    "Freshly ground black pepper",
    "1 Tbsp chopped fresh chives for garnish"
  ],
  "__v": 1
}