{
  "__v": 1,
  "directions": [
    "0",
    "Adjust oven rack to middle position and heat oven to 200 degrees. Halve chicken horizontally, then cover chicken halves with plastic wrap and pound to an even 1/4 inch thickness with meat pounder. Place flour in a shallow dish or pie plate.",
    "Pat chicken dry with paper towels and season with salt and pepper. Working with 1 cutlet at a time, dredge in four mixture, shaking off excess, and transfer to large plate.",
    "Heat 2 tbs oil in a 12 inch skillet over medium-high heat until shimmering. Place 4 cutlets in skillet and cook until golden brown on first side, about 3 minutes. Flip cutlets, reduce heat to medium, and cook until no longer pink and lightly browned on second side, about 2 minutes longer; transfer to large oven safe plate. Wipe out skillet. Repeat with remaining 2 tbs oil and remaining cutlets. Tent loosely with aluminum foil and transfer to oven to keep warm while making sauce.",
    "Cook pancetta in now-empty skillet over low heat, stirring occasionally and scraping up any browned bits, until crisp, about 5 minutes. remove pancetta with slotted spoon and transfer to paper towel lined plate. Add mushrooms to skillet, increase heat to medium-high and cook stirring occasionally, until softened and lightly browned, about 8 minutes. Stir in garlic and tomato paste, and crisp pancetta and cook until tomato paste begins to brown, about 1 minute. Off heat stir in Marsala, scraping any browned bits. Return to high heat, bring to a vigorous simmer, and cook stirring occasionally, until sauce is thickened and measures 1 1/4 cups, about 5 minutes. Off heat, stir in lemon juice and any accumulated chicken juices. Whisk in butter, 1 piece at a time. Stir in parsley and season with salt and pepper to taste. Pour sauce over chicken and serve immediately."
  ],
  "firstAdded": "2014-05-09T18:05:33.471000",
  "hash": "7d2fd313693720882ca08f27d88e4d5d3d620cc5",
  "href": "http://passthesushi.com/chicken-marsala/",
  "image": "",
  "ingredients": [
    "0",
    "4 (6-8oz) chicken breasts, boneless skinless, tenderloins removed and trimmed",
    "1 cup flour",
    "Salt and pepper",
    "1/4 cup vegetable oil",
    "2 1/2 oz pancetta, cut into pieces 1 inch long and 1/8 inch wide",
    "8 oz white mushrooms, trimmed and sliced thin",
    "1 garlic clove, minced",
    "1 teas tomato paste",
    "1 1/2 cups sweet Marsala wine",
    "4 1/2 teas lemon juice",
    "4 tbs unsalted butter, cut into 4 pieces and chilled",
    "2 tbs chopped fresh parsley"
  ],
  "keywords": [
    "chicken",
    "breasts",
    "boneless",
    "skinless",
    "tenderloins",
    "trimmed",
    "flour",
    "salt",
    "pepper",
    "oil",
    "pancetta",
    "pieces",
    "long",
    "wide",
    "white",
    "mushrooms",
    "garlic",
    "clove",
    "teas",
    "tomato",
    "marsala",
    "wine",
    "lemon",
    "juice",
    "tbs",
    "unsalted",
    "butter",
    "chilled",
    "parsley"
  ],
  "title": "Chicken Marsala",
  "users": [
    null
  ]
}