{
  "hash": "2d5c78653ad1ee1cd5796d04157422e2a4196c5e",
  "title": "courgette, lemon and poppyseed cake",
  "image": "https://assets.riverford.co.uk/live/media/recipes/262X262/courgette, lemon & poppyseed cake262.jpg",
  "href": "http://www.riverford.co.uk/recipes/view/recipe/courgette-lemon-poppyseed-cake",
  "extension": "Chrome",
  "firstAdded": "2016-01-07T14:32:01.349000",
  "users": [
    null
  ],
  "keywords": [
    "cake",
    "poppy",
    "seeds",
    "zest",
    "lemons",
    "milk",
    "unsalted",
    "butter",
    "extra",
    "greasing",
    "tin",
    "light",
    "brown",
    "soft",
    "sugar",
    "eggs",
    "yolks",
    "whites",
    "separated",
    "almond",
    "glutenfree",
    "selfraising",
    "flour",
    "almonds",
    "weight",
    "courgettes",
    "icing",
    "lemon",
    "juice"
  ],
  "directions": [
    "0",
    "Preheat your oven to 180˚C/Gas 4.",
    "Lightly grease a 23cm springform cake tin and line with baking parchment.",
    "Warm the milk, poppy seeds and lemon zest in a small pan for a couple of mins, then remove from the heat and leave to cool.",
    "Cream the butter and sugar in a large bowl until pale, light and fluffy (an electric hand mixer makes life easier). Beat in the egg yolks, one at a time.",
    "Stir in the almond extract, flour and ground almonds.",
    "Fold in the courgettes and cooled milk. Whisk the egg whites in a separate clean bowl to stiff peaks.",
    "Add a large spoonful to the courgette mixture and stir in, then gently fold in the rest, keeping as much air in the mixture as possible. Pour into the tin.",
    "Bake for approx 60 minutes, depending on your oven, until firm to the touch; it should spring back when you lightly press the middle.",
    "Cool in the tin for 15 minutes, then turn onto a wire rack to cool completely. To make the icing, sift the icing sugar into a bowl.",
    "Add the lemon zest. Melt the butter and pour over the icing sugar.",
    "Add the lemon juice and stir together quickly, adding a splash of cold water if needed, until you have a thick but spreadable icing.",
    "Use a pallet knife to spread over the cake.",
    "Leave for approx 30 minutes if you can, so the icing can set a little, before serving sprinkled with poppy seeds."
  ],
  "ingredients": [
    "0",
    "for the cake:",
    "2 tbsp poppy seeds",
    "finely grated zest of 2 lemons",
    "75ml whole milk",
    "250g unsalted butter, plus a little extra for greasing the tin",
    "250g light brown soft sugar",
    "4 eggs, yolks & whites separated",
    "½ tsp almond extract",
    "200g gluten-free self-raising flour",
    "75g ground almonds",
    "250g grated weight of courgettes",
    "for the topping:",
    "300g icing sugar",
    "1½ tsp finely grated lemon zest",
    "30g unsalted butter",
    "2 tbsp lemon juice",
    "1 tbsp poppy seeds"
  ],
  "__v": 1
}