{
  "hash": "efd9042c5bf9eae26fe8f013e7f9308d6201f59d",
  "title": "Sticky Gingerbread",
  "image": "https://atlascafeleicester.files.wordpress.com/2012/04/gingerbreadcomplete-e1335096110485.jpg?w=478&h=261&crop=1",
  "href": "https://atlascafeleicester.wordpress.com/2012/04/22/sticky-gingerbread-recipe-just-like-mcvities-ginger-cake/",
  "firstAdded": "2014-12-26T10:30:23.974000",
  "users": [
    null
  ],
  "keywords": [
    "selfraising",
    "flour",
    "bicarbonate",
    "soda",
    "ginger",
    "cinnamon",
    "mixed",
    "spice",
    "unsalted",
    "butter",
    "chilled",
    "black",
    "treacle",
    "golden",
    "syrup",
    "dark",
    "brown",
    "muscovado",
    "sugar",
    "milk",
    "skimmed",
    "medium",
    "freerange",
    "egg",
    "loaf",
    "tin",
    "greased",
    "lined",
    "greaseproof",
    "paper"
  ],
  "directions": [
    "0",
    "Heat the oven at 180C. Sift the flour, bicarbonate of soda, ginger, cinnamon and mixed spice together in a bowl (I sieve it twice normally, it just makes it lighter).",
    "Add the diced butter and rub into the flour mix.",
    "At this part make sure the butter is quite chilled and you’re only using your finger tips. Rubbing it too much in your hands heats it up too fast; sometimes I stop half way through and run my hands through cold water and dry them off to carry on because my hands are generally warm. Act as if you’re making pastry, the less you maul it the better the mixture will be.",
    "Spoon the treacle and golden syrup into a small pan and warm gently until melted and runny but not hot. Set aside until lukewarm. Put the sugar and milk into another pan and heat gently, stirring well to dissolve the sugar. Leave to cool until lukewarm. Then whisk the milk into the flour mixture, quickly followed by the treacle mixture and the egg, to make a smooth thick batter, the consistency of double cream.",
    "Put the mixture into the prepared tin. Bake the gingerbread in the heated oven for about 45 minutes or until a skewer inserted into the centre of the loaf comes out clean. Run a round-bladed knife around the inside of the tin to loosen the loaf, then set the tin on a wire rack and leave the gingerbread to cool completely before turning out. Wrap the loaf in foil and leave for at least a day before cutting; it will get stickier the longer it is kept. Store in an air tight container.",
    "**Measuring out the golden syrup and treacle is not easy, the stuff gets everywhere and by the time you’ve then transferred it to a pan you’re not sure whether you have the right measurements. What I do is get a small enough pan to fit on your scales, use a heated spoon and spoon your golden syrup directly into the pan and measure. Then dot the scales back to zero and add your treacle the same way, should be close enough to exact.",
    "**I didn’t have a high sided loaf tin to do the lot in one pan. I have two loaf tins measuring 22 x 13 x 7cm – so theirs is that bit longer than mine. If you have the same measurement as mine, you can’t put the lot in as it will spill over the sides and ruin the consistency. I split my mixture between the two tins and reduced my cooking time to about 30 minutes, or again until a skewer comes out clean. I’m really pleased with the result, this way it comes out smaller but quite like McVities Jamaica Ginger Cake."
  ],
  "ingredients": [
    "0",
    "225g Self-Raising Flour",
    "1 tsp Bicarbonate of Soda",
    "1 tbsp Ground Ginger",
    "1 tsp Ground Cinnamon",
    "1 tsp Ground Mixed Spice",
    "115g Unsalted Butter, Chilled and Diced",
    "115g Black Treacle",
    "115g Golden Syrup",
    "115g Dark Brown Muscovado Sugar",
    "275ml Milk (not Skimmed)",
    "1 Medium free-range Egg, beaten",
    "A 900g loaf tin, about 26 x 13 7cm, greased with butter and lined with greaseproof paper."
  ],
  "__v": 2
}