{
  "hash": "45a2a19ce8ebe38b6a6d2bef6c99d119232e5bc7",
  "title": "Spinach-pan pizza with lamb sausage and herb sauce",
  "image": "http://recipe-folder.com/img/recipe-images/006/767/35032406.jpg",
  "href": "http://www.ah.nl/allerhande/recept/R-R1186880/spinazie-panpizza-met-lamsworstjes-en-kruidensaus",
  "extension": "Chrome",
  "firstAdded": "2016-08-28T15:11:28.773000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat 1 tablespoon oil in a frying pan and fry the sausages in 15 min. Until golden brown. Times regularly.",
    "Meanwhile, cut the steal and a small piece of the bottom of the fennel bulbs. Keep it green separately. Cut the turnips and cut into thin slices. Add the fennel last 8 min. To join the sausages and fry with the tomatoes. Remove the sausages from the pan, cut each into 3 pieces and put back in the pan.",
    "Meanwhile, cut half the spinach finely. Mix with the flour, 150 ml of yoghurt and the salt and knead until a cohesive dough. Divide into 4 equal portions and roll each piece on a floured surface into a pizza base Ø 18 cm.",
    "Heat 2 skillets with each 1 tbsp oil and fry 2 pizza crusts in 3 min. Until golden brown. Turn halfway. Repeat with the rest of the pizza bases. Keep the pizza bases on a hot plate under aluminum foil.",
    "Add the rest of the spinach and the rest of the yogurt, dill and garlic into the cup of the hand blender and puree until smooth. Season with pepper and salt.",
    "Divide the pan pizzas on plates, top with the sausage-fennel mixture and sprinkle with the herbs garlic yogurt."
  ],
  "ingredients": [
    "0",
    "5 tbsp olive oil",
    "270g lamb sausages",
    "2 fennel bulbs",
    "400g chopped tomatoes (first look)",
    "200 g baby spinach (100 g bag)",
    "225g self-raising flour",
    "150ml mild yogurt (AH Organic)",
    "1½ tsp salt",
    "2 pinches flour for dusting",
    "150 g mild yogurt (AH Organic)",
    "7½ g dill (half cup)",
    "1 clove garlic"
  ],
  "__v": 1
}