{
  "hash": "1a3e33bd7fe19431f912c0c12e833e150cc2907f",
  "title": "slow-cooker butternut squash & apple soup",
  "image": "https://alexandracooks.com/wp-content/uploads/2016/11/soupandbread.jpg",
  "href": "https://alexandracooks.com/2016/11/11/slow-cooker-butternut-squash-apple-soup/",
  "extension": "Chrome",
  "firstAdded": "2019-01-02T23:45:50.507000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Place the squash, onion or leek, apple, carrot, and water or stock in a slow cooker. If using water, add 1 tablespoon kosher salt. If using stock, add a pinch of salt, then adjust at the end. Cover and cook on high for 4 hours or on low for 8 hours, until the squash and carrots are cooked through.",
    "Stir in the coconut milk. Puree the soup in the slow cooker with an immersion blender until smooth (or in a stand blender in batches.) Taste and adjust seasoning accordingly. I consistently add 3/4 cup coconut milk (total) and another teaspoon of kosher salt, but make your adjustments to taste.",
    "For the garnish, which is optional: Heat a medium skillet over medium-low heat. Add the oil and leeks and cook, stirring occasionally, until golden and crisp, about 10 minutes. Season with salt.",
    "To serve, pour the soup into 6 serving bowls and garnish with the crispy leeks. Drizzle with more coconut milk if desired. I like lots of cracked black pepper over top."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "2 lbs. butternut squash, peeled, seeded, and cubed",
    "1 onion, peeled and roughly chopped or 1 leek (white part only, rinsed and roughly chopped)",
    "1 apple, any kind you like, roughly chopped, no need to peel (I’ve been using Honey Crisp or Fuji)",
    "1 medium (or a couple small) carrots, roughly chopped",
    "kosher salt and pepper to taste",
    "2 1/2 cups water or low-sodium chicken or vegetable stock",
    "1/2 cup unsweetened coconut milk, plus more to tastefor the garnish:",
    "1 tablespoon olive oil",
    "3/4 cup thinly sliced leeks, white part only, rinsed if necessary",
    "pinch sea salt"
  ],
  "__v": 1
}