{
  "__v": 1,
  "directions": [
    "0",
    "Melt the butter in a large, high-walled and heavy-bottomed pan over medium heat. Add the onions, garlic, bay leaf, sprig of thyme, and a sprinkle of salt and pepper and cook until the onions are soft and nearly caramelized, about 20 minutes. Add in the mushrooms (with a little more butter, if necessary), and saute until the mushrooms are soft and slightly browned and the onions have caramelized, about 5 more minutes. Discard the bay leaf and thyme and remove the onions and mushrooms to a bowl.",
    "Heat a tablespoon of oil over medium-high, and sprinkle the steak with salt, pepper, and flour. Saute until browned, about 3 minutes. Remove the steak and set in the bowl with the mushrooms and onions.",
    "Deglaze the pan with the red wine. Add in 1½ cups beef broth and ½ tablespoon Worcestershire sauce and bring to a low simmer. Add back in the steak, mushrooms, and onions and let simmer, covered, until the broth reduces slightly and the steak is cooked, about 8 minutes.",
    "As you wait for the broth to reduce, cook the egg noodles according to the package. Drain and set aside.",
    "Remove the beef mixture from the heat and add in the ⅔ cup of sour cream, stirring well. Mix in the cooked egg noodles.",
    "Top with 1 to ½ cups grated Gruyere. If in a ovenproof pan, put under the broiler until cheese is melted and slightly browned. If not, leave the pan on the burner on medium-low, cover, and heat until cheese melts.",
    "Top with torn parsley and serve."
  ],
  "firstAdded": "2014-09-17T20:02:24.398000",
  "hash": "ca52ea09c0fedde624ec7b58c5da432989a29499",
  "href": "http://hostthetoast.com/french-onion-beef-stroganoff/",
  "image": "http://hostthetoast.com/wp-content/uploads/2014/09/French_Onion_Beef_Stroganoff_11.jpg",
  "ingredients": [
    "0",
    "¼ cup unsalted butter",
    "3 onions, French-cut",
    "1 clove garlic, chopped",
    "1 bay leaf",
    "1 sprig thyme",
    "6 oz mushrooms, sliced",
    "1 tablespoon olive oil",
    "1.5 lbs round steak, cut into chunks",
    "Kosher salt and black pepper",
    "All-purpose flour",
    "¼ cup red wine",
    "1½ cups beef broth",
    "½ tablespoon Worcestershire sauce",
    "3 cups egg noodles",
    "⅔ cup sour cream",
    "1- 1½ cups grated Gruyere or Swiss",
    "Parsley, to top"
  ],
  "keywords": [
    "unsalted",
    "butter",
    "onions",
    "frenchcut",
    "clove",
    "garlic",
    "bay",
    "leaf",
    "sprig",
    "thyme",
    "mushrooms",
    "olive",
    "oil",
    "lbs",
    "round",
    "steak",
    "chunks",
    "kosher",
    "salt",
    "black",
    "pepper",
    "allpurpose",
    "flour",
    "red",
    "wine",
    "beef",
    "broth",
    "worcestershire",
    "egg",
    "noodles",
    "sour",
    "cream",
    "gruyere",
    "swiss",
    "parsley"
  ],
  "title": "French Onion Beef Stroganoff",
  "users": [
    null
  ]
}