{
  "hash": "16cae9d187731e010342594b6360a7e447325f01",
  "title": "Fried Goat Cheese with Honey and Black Pepper",
  "image": "https://d2k9njawademcf.cloudfront.net/indeximages/53089/full/2015_0324_honey-finalist_fried-goat-cheese-w-honey-black-pepper_bobbi-lin_0194.jpg?1427376874",
  "href": "http://food52.com/recipes/34179-fried-goat-cheese-with-honey-and-black-pepper",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T22:02:23.886000",
  "users": [
    null
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "divided",
    "baking",
    "salt",
    "honey",
    "cold",
    "soda",
    "water",
    "black",
    "pepper",
    "goat",
    "cheese",
    "dryer",
    "better",
    "laura",
    "chenel",
    "chevre",
    "canola",
    "oil",
    "frying",
    "coarsely"
  ],
  "directions": [
    "0",
    "To make the batter, sift 2 cups all-purpose flour and baking powder into a large mixing bowl. Stir in 1 teaspoon kosher salt and 2 tablespoons honey. Whisk in the soda water until the batter is smooth. Keep refrigerated until ready to use -- the batter needs to stay as cold as possible until ready to fry.",
    "The prepare the seasoned flour, combine the remaining 1 cup all-purpose flour, 1/2 teaspoon kosher salt, and finely ground black pepper in a shallow bowl or plate. Set aside.",
    "Roll the goat cheese into sixteen 1/2-ounce balls. Refrigerate for 30 minutes.",
    "In a heavy-bottomed pot or deep fryer, heat the canola oil to 375º F. Roll the chilled goat cheese balls in the seasoned flour. Shake off any excess flour, then roll the balls into the batter a few at a time, making sure to fully cover the cheese ball. Remove them one or two at a time and carefully drop them into the oil, using a slotted spoon to move them around so they don’t stick to each other or the pot. Cook until golden brown, about 45 seconds to 1 minute. Using a slotted spoon or strainer, carefully remove the goat cheese from the fryer and drain on a cooling rack or paper towel-lined plate.",
    "Place the fried goat cheese into a warm bowl. Drizzle with the remaining 2 tablespoons of honey and coarsely ground black pepper. Serve immediately."
  ],
  "ingredients": [
    "0",
    "3 cups all-purpose flour, divided",
    "1 teaspoon baking powder",
    "1 1/2 teaspoons salt, divided",
    "4 tablespoons honey, divided",
    "2 1/4 cups very cold soda water",
    "1/8 teaspoon finely ground black pepper",
    "8 ounces fresh goat cheese, cold (the dryer the better, we like the Laura Chenel Chevre)",
    "6 to 8 cups canola oil, for frying",
    "1/2 teaspoon coarsely ground black pepper"
  ],
  "__v": 1
}