{
  "hash": "9dcba4ebf8f224a97fb746e4fdaa62bea27ff596",
  "title": "Roasted Carrots with Feta and Dukkah",
  "image": "http://f.tqn.com/y/mideastfood/1/W/L/8/-/-/aIMG_5875fsq.jpg",
  "href": "http://mideastfood.about.com/od/middleeasternfood101/r/Roasted-Carrots-with-Feta-and-Dukkah.htm",
  "extension": "Chrome",
  "firstAdded": "2017-02-05T04:32:18.275000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To make the dukkah, add the hazelnuts to a dry skillet or cast iron and toast for 1 to 2 minutes, stirring often. Move the hazelnuts to a dish and add the sesame seeds, coriander seeds and cumin seeds to the pan. Toast for another 1 to 2 minutes and remove from the pan. You can also do this in a pre-heated 350 degree oven by spreading the nuts and seeds out on a baking sheet lined with parchment paper and roasting for about 2 minutes.",
    "Add the toasted hazelnuts, sesame seeds, coriander seeds and cumin seeds to a food processor and pulse for 2-4 minutes. You want the ingredients to break down into very small pieces but not to turn into a paste. You can also do this by hand in a mortar and pestle.",
    "Store in an air tight container.",
    "When ready to make the dish, pre-heat the oven to 400 degrees. Peel the carrots and slice in half lengthwise. Toss in the olive oil and place on a baking sheet lined with parchment paper. Roast for approximately 20 minutes or until the carrots are just fork tender.",
    "Place on a serving dish and top with the crumbled feta and the dukka. Serve warm."
  ],
  "ingredients": [
    "0",
    "1 lb. Carrots, peeled and sliced in half vertically",
    "1 Tablespoon olive oil",
    "1/4 Cup crumbled feta cheese",
    "1/4 Cup dukkah (recipe follows)",
    "For the Dukkah:",
    "1/4 Cup hazelnuts",
    "2 Tablespoons sesame seeds",
    "1 Tablespoon coriander seeds",
    "1 Tablespoon cumin seeds",
    "1/4 Teaspoon black pepper",
    "1/4 Teaspoon salt, or to taste"
  ],
  "__v": 1
}