{
  "hash": "1e6d0d9dbbaf278fee41fdbbbced5e2b034f8334",
  "title": "Creamy Shrimp Pasta",
  "image": "http://3.bp.blogspot.com/-IYAv6Jv5k18/UGt58FSkNNI/AAAAAAAAGV8/fab5bgzRXuk/s640/IMG_8184.jpg",
  "href": "http://www.laurenslatestblog.com/2012/10/creamy-shrimp-pasta.html",
  "firstAdded": "2015-02-20T02:06:17.084000",
  "users": [
    null
  ],
  "keywords": [
    "appr",
    "use",
    "frozen",
    "raw",
    "shrimp",
    "good",
    "butter",
    "garlic",
    "block",
    "softened",
    "cream",
    "cheesei",
    "leftover",
    "fridge",
    "perfect",
    "spaghetti",
    "fettucine",
    "linguine",
    "noodles",
    "parsleyi",
    "used",
    "herbs",
    "try",
    "time",
    "basil",
    "salt",
    "lemon",
    "juice",
    "tomatoes",
    "wanted",
    "star",
    "pasta",
    "water",
    "parmesan",
    "cheese"
  ],
  "directions": [
    "0",
    "Get pasta going according to box. This takes forever and the shrimp/sauce takes 10 minutes or less so start it first off.",
    "Melt butter in skillet on medium-medium high.",
    "Make sure you've thawed your shrimp if they were frozen(takes no time at all in a bowl of water), and dry them really well. I just let mine sit on a paper towel-lined plate, topped with more paper towels.",
    "Sprinkle shrimp with herbs, seasoned salt, and a little S&P.",
    "Drop shrimp in melted butter.",
    "Let shrimp cook a couple minutes, then add garlic. Get ready for your kitchen to start smelling heavenly!",
    "Cook shrimp a few minutes per side. It doesn't take long at all, and it will continue cooking once the other ingredients are added.",
    "Add the lemon juice, and you could totally stop here if you wanted to and serve it over pasta this way.",
    "Next, add in your diced tomatoes. You could use regular diced, petite diced, whatever. I liked this size because they were the same size as the shrimp. You could also add peas, mushrooms, red peppers, etc. It's very versatile.",
    "I let the tomatoes and shrimp do their thing for just a couple minutes, then added the cream cheese, a little dollop at a time.",
    "It only takes a couple more minutes for it all to melt together into this creamy, rich deliciousness.",
    "Toss your pasta in the pan, and add in about 1/2 cup pasta water. Toss really well, and top with more herbs and some Parmesan cheese if you wish.",
    "Y'all, this is a winner right here. I could seriously eat the entire thing, but I'd immediately regret that. It is SO easy and quick, and very versatile. You could add in all kinds of veggies, and even use chicken or no protein at all."
  ],
  "ingredients": [
    "0",
    "appr. 1 lb raw shrimp (I use frozen raw peeled and deveined shrimp and they are just as good as fresh!)",
    "1 stick butter",
    "1-2 tsp minced garlic",
    "appr. 1/3 block softened cream cheese(I just had this amount leftover in the fridge and it was perfect)",
    "5-6oz spaghetti, fettucine, linguine noodles (whatever you like)",
    "1-2 tbsp Parsley(I used dried herbs but will try it with fresh next time)",
    "1-2 tbsp Basil",
    "1 tsp Seasoned Salt",
    "S&P to taste",
    "1-2 tbsp fresh lemon juice",
    "3/4 can diced tomatoes (you could use the whole can, I just wanted the shrimp to be the star)",
    "1/2 pasta water",
    "Parmesan cheese for topping"
  ],
  "__v": 2
}