{
  "hash": "ac7763c5e3a2fef9c09cd6874a70a3c35137a788",
  "title": "Kittencal's Scalloped Potato and Ground Beef Casserole",
  "image": "http://img.sndimg.com/food/image/upload/w_555,h_416,c_fit,fl_progressive,q_95/v1/img/recipes/21/54/14/picLy9Ey2.jpg",
  "href": "http://www.food.com/recipe/kittencals-scalloped-potato-and-ground-beef-casserole-215414",
  "extension": "Firefox",
  "firstAdded": "2015-05-03T00:46:04.243000",
  "users": [
    null
  ],
  "keywords": [
    "lbs",
    "use",
    "bulk",
    "italian",
    "sausage",
    "meat",
    "increase",
    "beef",
    "slightly",
    "medium",
    "onion",
    "green",
    "bell",
    "pepper",
    "seeded",
    "garlic",
    "chili",
    "adjust",
    "seasoning",
    "white",
    "salt",
    "black",
    "russet",
    "potatoes",
    "desired",
    "cheddar",
    "cheese",
    "condensed",
    "cream",
    "chicken",
    "undiluted",
    "using",
    "flavor",
    "soup",
    "good",
    "light",
    "sour",
    "parmesan"
  ],
  "directions": [
    "0",
    "In a skillet cook the ground beef with onion, bell pepper and chili flakes (if using) until no longer pink; drain fat over a colander.",
    "Return to pan and add in garlic, season salt and black pepper; cook stirring with a wooden spoon until the meat is lightly browned (I usually add in about 1-2 tablespoons bacon fat that I keep frozen in my freezer to the meat while browning for added flavor and it also helps to brown the meat) set aside.",
    "For the sauce; in a medium bowl mix together the undiluted soup with onion, milk, sour cream, Parmesan cheese, garlic powder, seasoned salt and black pepper to taste; mix well to combine.",
    "In a greased 13 x 9-inch baking dish or a large oval casserole dish, alternately layer the sliced potatoes on bottom of the baking dish, then soup mixture (I like to sprinkle grated cheddar cheese on top of the soup mixture) then the ground beef mixture on top.",
    "Since this is a large casserole I strongly suggest to place the baking dish on a jelly-roll sheet in case of any spills.",
    "Bake covered with foil for about 1 hour at 350 degrees F.",
    "Uncover and continue baking for another 20-30 minutes or until the potatoes are tender (baking time will vary depending on the thickness of your sliced potatoes).",
    "Remove from oven then sprinkle with grated cheddar cheese; return to oven for 4-5 minutes or until the cheese has melted."
  ],
  "ingredients": [
    "0",
    "1 1⁄2 lbs ground beef (or use bulk Italian sausage meat, can increase the ground beef slightly)",
    "1 medium onion, chopped",
    "1 small green bell pepper, seeded and chopped (optional)",
    "4 garlic cloves, finely chopped (or to taste)",
    "1⁄2 teaspoon dried chili pepper flakes (adjust to taste) (optional)",
    "1 teaspoon seasoning salt (or to taste) or 1⁄2 teaspoon white salt (or to taste)",
    "1⁄2 teaspoon fresh ground black pepper (or to taste)",
    "5 -6 russet potatoes (peeled and sliced thinly, or use as many as desired)",
    "2 cups shredded cheddar cheese (or to taste)",
    "SAUCE",
    "2 (10 3/4 ounce) cans condensed cream of chicken soup, undiluted (using any other flavor of soup will not be as good)",
    "1 small onion, chopped (about 1/3 cup)",
    "3⁄4 light cream",
    "1⁄2 cup sour cream",
    "1⁄4 cup grated parmesan cheese",
    "1 teaspoon garlic powder",
    "1⁄2 teaspoon seasoning salt",
    "fresh ground black pepper (to taste)"
  ],
  "__v": 1
}