{
  "hash": "7848f9979f1863aae440ee516f0b751ed40c9e05",
  "title": "Skinny Oatmeal Chocolate Chip Cookies",
  "image": "http://cf.thefoodcharlatan.com/wp-content/uploads/2016/01/pin2.jpg",
  "href": "http://thefoodcharlatan.com/2016/01/12/skinny-oatmeal-chocolate-chip-cookies/",
  "extension": "Chrome",
  "firstAdded": "2017-03-07T22:12:25.719000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 325 degrees F. Line a large baking sheet with parchment paper or a silpat.",
    "Pull out 2 medium bowls, one for dry ingredients, one for wet.",
    "In one bowl, whisk together the oats, flour, baking powder, cinnamon, and salt.",
    "Melt the butter in the other bowl. You don't have to melt it all the way, if there are a couple lumps it's okay. Let cool slightly.",
    "Whisk in the vanilla, then the egg. Whisk in the honey.",
    "Add the wet ingredients to the dry ingredients and use a wooden spoon to stir until it has just come together (don't overdo it).",
    "Save out about half of the chocolate chips. Use a sharp knife to roughly chop the remaining chocolate, then fold it into the dough.",
    "Refrigerate the dough for about 30 minutes, or freeze for about 15 minutes.",
    "Use your hands to shape the dough into roughly 15 cookies (or 12 if you eat a lot of dough like me...)",
    "Place on the prepared baking sheet about 2 inches apart.",
    "Bake in the preheated oven for about 12-13 minutes, or until they have just started to brown on the edges.",
    "Once you remove them from the oven, immediately press the remaining chocolate chips into the tops of the cookies.",
    "Let cool on the pan for a few minutes before removing to a cooling rack.",
    "Drink with lots of milk!"
  ],
  "ingredients": [
    "0",
    "1 cup quick oats",
    "3/4 cup whole wheat flour, spooned and leveled",
    "1 and 1/2 teaspoons baking powder",
    "1 and 1/2 teaspoons cinnamon",
    "scant 1/2 teaspoon kosher salt",
    "2 tablespoons butter, melted and cooled",
    "1 teaspoon vanilla",
    "1 large egg",
    "1/2 cup honey",
    "about 1/2 to 3/4 cup dark chocolate chips, divided"
  ],
  "__v": 1
}