{
  "hash": "d817a1782c524b9f528d6abc3524b3c31fd9dcdf",
  "title": "Cherry Cheesecake Brownies",
  "image": "http://FlavorMosaic.com/wp-content/uploads/2014/02/Cherry-Cheesecake-Brownies-2-1024x805.jpg",
  "href": "http://flavormosaic.com/cherry-cheesecake-brownies/",
  "firstAdded": "2015-02-03T17:02:25.576000",
  "users": [
    null
  ],
  "keywords": [
    "cream",
    "cheese",
    "softened",
    "use",
    "fat",
    "sugar",
    "egg",
    "vanilla",
    "butter",
    "white",
    "eggs",
    "dark",
    "cocoa",
    "allpurpose",
    "flour",
    "salt",
    "baking",
    "cherry",
    "pie",
    "filling",
    "lite",
    "variety",
    "semisweet",
    "chocolate",
    "chips"
  ],
  "directions": [
    "0",
    "Preheat oven to 350 degrees F. Either spray with baking spray or grease and flour an 8 inch square pan.",
    "For the cheesecake layer, in a large bowl, mix together the cream cheese, sugar, egg, and vanilla. Set aside.",
    "For the brownie layer, in a large mixing bowl, cream together butter and sugar. Mix in the eggs, and 1 teaspoon vanilla.",
    "Stir in cocoa, flour, salt, and baking powder. Stir until everything is evenly combined.",
    "Spread the brownie batter evenly into the prepared baking dish.",
    "Spread the cheesecake mixture evenly over the brownie mixture.",
    "Drop the cherry pie filling by spoonfuls on top of the cheesecake layer. Then take a knife and swirl the cherry pie filling through the cheesecake layer.",
    "Bake in a preheated oven for about 45 minutes. The cheesecake layer will still jiggle in the middle even when it has finished cooking.",
    "Let it cool for about an hour.",
    "Then chill in the refrigerator for at least 4 hours.",
    "While the brownies are chilling, make the chocolate drizzle by adding the chocolate chips and 2 teaspoons of butter in a small bowl and microwave for about 30 seconds. Stir until smooth. Microwave again for another 30 seconds if it is not melted after the first 30 seconds. Stir and then spoon over the top of the cheesecake bars before serving."
  ],
  "ingredients": [
    "0",
    "1 (8 ounce) package of cream cheese, softened (I use ⅓ less fat)",
    "⅓ cup sugar",
    "1 egg",
    "½ teaspoon vanilla",
    "1",
    "½ cup butter, softened",
    "1 cup white sugar",
    "2 eggs",
    "1 teaspoon vanilla extract",
    "½ cup unsweetened dark cocoa powder",
    "½ cup all-purpose flour",
    "¼ teaspoon salt",
    "¼ teaspoon baking powder",
    "½ of a (21 ounce) can cherry pie filling (I use the lite variety)",
    "2",
    "¼ cup semi-sweet chocolate chips",
    "2 teaspoons butter"
  ],
  "__v": 1
}