{
  "hash": "2595f358b752d09daed6809686c9912adb18055d",
  "title": "Tamale Pie",
  "image": "//img-aws.ehowcdn.com/640/cme/photography.prod.demandstudios.com/7bab8b85-6eb3-4880-b12e-e96f65fc1b9d.jpg",
  "href": "http://www.ehow.com/how_2302874_make-tamale-pie.html?utm_source=ehow&utm_medium=email&utm_campaign=ehow_general_0826&utm_content=general",
  "extension": "Chrome",
  "firstAdded": "2016-08-26T17:45:00.593000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 425 degrees Fahrenheit. Place a 12-inch skillet over high heat. Add ground beef and cook, using a wooden spoon to stir and break up the meat, until brown, about 6 to 8 minutes. Add in the onion and cook, stirring frequently, until softened, about 5 minutes. Add in the garlic and cook for another minute, or until softened and fragrant but not golden. Add in chili powder, cayenne pepper, ground cumin, and cinnamon. Stir well to combine and cook for another 30 seconds.",
    "Cook the ground beef until brown. (Image: Ashley Manila)",
    "Step 2",
    "Add in the corn, black beans, Rotel, and chicken stock. Bring to a simmer, then stir in half of the cheese. Reduce heat to low and cook, stirring occasionally, until thickened, about 10 minutes. Remove from heat and stir in half of the scallions and cilantro. Season to taste with salt and pepper and set aside.",
    "Add the corn, black beans, tomatoes, and chicken stock. (Image: Ashley Manila)",
    "Stir in half of the cheese. (Image: Ashley Manila)",
    "Remove from heat and stir in scallions and cilantro. (Image: Ashley Manila)",
    "Step 3",
    "In a large bowl combine the cornbread mix with the milk, melted butter, and egg. Using a whisk, carefully stir the ingredients together until evenly moistened. Do not over mix the cornbread or it will bake up dry! Using a large spoon, scoop dollops of the cornbread batter on top of the chili filling. Use a rubber spatula to spread it into an even layer. Sprinkle with remaining cheese and jalapeno pepper, if using. Transfer the skillet to the oven and bake until golden brown, about 20 minutes. Cool for 10 minutes before topping with sour cream and remaining cilantro and scallions. Serve warm."
  ],
  "ingredients": [
    "0",
    "1 pound ground beef",
    "1 large yellow onion, diced",
    "5 cloves garlic, minced",
    "1 and 1/2 tablespoons chili powder",
    "1/2 teaspoon cayenne pepper",
    "1 tablespoon ground cumin",
    "1/4 teaspoon ground cinnamon",
    "1 and 1/2 cups fresh or frozen corn, if using frozen, thaw first",
    "15 oz. can black beans, drained, (1)",
    "10 oz. cans Rotel diced tomatoes with lime juice and cilantro, (2)",
    "1 cup chicken stock"
  ],
  "__v": 1
}