{
  "hash": "eafa36742de96104e070990d3be27f8bd4cc7327",
  "title": "Green Goddess Enchiladas",
  "image": "http://farm8.staticflickr.com/7161/6705430981_319e04c7bf_z.jpg",
  "href": "http://joanne-eatswellwithothers.com/2012/01/recipe-green-goddess-enchiladas.html",
  "extension": "Chrome",
  "firstAdded": "2017-08-06T01:18:31.918000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large nonstick skillet, spray with cooking spray and, over medium-low heat, saute chickpeas, onion, Ro-tel, corn, oregano, 1 teaspoon salt and 1/8 teaspoon black pepper. Saute 5-6 minutes over medium-low heat or until all liquid from tomatoes has evaporated, stirring often. Remove from heat.",
    "In a blender or food processor, puree the vegetable broth, Greek yogurt, kale, chiles, and scallions.",
    "Preheat oven to 400 degrees F. Grease a 9×13 casserole or baking dish. Lightly cover bottom of the dish with 1/2-3/4 cup of the sauce.",
    "Heat corn tortillas by wrapping the stack of them in aluminum foil and placing them in the preheating oven for 5-7 minutes or by microwaving them covered with a wet paper towel for 30 seconds.",
    "Stir 1/2 cup of cheese into the chickpea mixture. Add heaping 1/2 cups of filling to one end of each tortilla and roll up or fold in half placing each one seam side down in the prepared casserole dish.",
    "Pour kale sauce evenly over top of enchiladas. It will be very liquidy, but don’t worry, it will thicken as it cooks. Sprinkle remaining 1/2 cup of cheese over the enchiladas. Bake for about 25 minutes until bubbly all over. Allow to sit for five minutes before serving."
  ],
  "ingredients": [
    "0",
    "1 cup dried chickpeas, soaked overnight and boiled in salted water until tender",
    "1 small onion, diced",
    "1 (10 oz) can Ro-tel diced tomatoes and chilis",
    "1 cup frozen corn",
    "1/2 tsp dried oregano",
    "kosher salt and black pepper",
    "1 cup grated reduced fat cheddar cheese (I used Cabot)",
    "10-12 corn tortillas",
    "1 3/4 cup low sodium vegetable broth",
    "1 cup nonfat Greek yogurt",
    "1 bunch kale, stemmed",
    "1 (4 oz) can green chiles",
    "2 scallions, chopped"
  ],
  "__v": 2
}