{
  "hash": "e054d49fe06abdaad994e3a08a1cc87e9cb12b09",
  "title": "Warm Fall Pasta Salad With Butternut Squash & Leeks",
  "image": "https://www.peacefuldumpling.com/wp-content/uploads/2017/09/warm-vegan-pasta-salad-2-700x973.jpg",
  "href": "https://www.peacefuldumpling.com/recipe/warm-fall-pasta-salad-butternut-squash-leeks",
  "extension": "Chrome",
  "firstAdded": "2019-09-16T14:30:04.772000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a sauté pan, warm 1 tablespoon olive oil over medium heat. Add leeks and onions plus a pinch of salt. Stir to make sure the onions and leeks are evenly coated in olive oil.",
    "After about five minutes, reduce heat to medium-low, add the butternut squash cubes, adding another splash of oil if necessary. Allow the cubes to brown and the onion and leeks to caramelize, about 15 minutes.",
    "Meanwhile, prepare pasta according to package instructions.",
    "Add remaining vegetables to pan with leeks and onions: Brussels sprouts, kale or chard, carrots, and garlic. Stir occasionally until greens begin to wilt, about 5-10 minutes.",
    "Meanwhile, prepare balsamic vinegar reduction in a small saucepan. Add balsamic vinegar and coconut nectar (or liquid sweetener of your choice). Set heat to high and bring to a boil, being careful not to inhale the fumes. Reduce heat to low and simmer until you have a viscous liquid. Remove from heat.",
    "Drain pasta and return to empty pot. Stir in sautéed vegetables and shredded vegan cheese, if using. Plate pasta salad and drizzle with balsamic vinegar reduction. Enjoy!"
  ],
  "ingredients": [
    "0",
    "1 box pasta of your choice",
    "1-2 tablespoons olive oil",
    "1/2 red onion, diced",
    "3 leeks, white parts cut into thin strips",
    "1 small butternut squash, cubed",
    "2 cups chopped kale or Swiss chard",
    "2 cups shredded cabbage or Brussels sprouts",
    "1 carrot, finely chopped",
    "2 garlic cloves, minced",
    "1/2 cup balsamic vinegar",
    "2 tablespoons coconut nectar (or liquid sweetener of choice)",
    "shredded vegan cheese to taste (optional)"
  ],
  "__v": 1
}