{
  "hash": "e25df3092663cf2242ed979de95e71bcd0618b41",
  "title": "Gooseberry Cheesecake",
  "image": "http://womanandhome.media.ipcdigital.co.uk/21348/00000b204/9094_orh2000w570/gooseberry-cheesecake.jpg",
  "href": "http://www.womanandhome.com/recipes/532082/gooseberry-cheesecake-recipe",
  "extension": "Chrome",
  "firstAdded": "2015-07-11T15:14:28.698000",
  "users": [
    null
  ],
  "keywords": [
    "gooseberries",
    "topped",
    "tailed",
    "caster",
    "sugar",
    "hobnob",
    "biscuits",
    "butter",
    "cream",
    "cheese",
    "level",
    "plain",
    "flour",
    "eggs",
    "egg",
    "yolk",
    "elderflower",
    "cordial",
    "sour",
    "springform",
    "roasting",
    "tin",
    "lined",
    "baking",
    "parchment"
  ],
  "directions": [
    "0",
    "Preheat oven to 200C, 180C fan, 400F, Gas 6. Place the gooseberries in a large roasting tin lined with baking parchment, sprinkle over the sugar, mix well and roast in the oven for 15-20 minutes. Remove from the oven and place the gooseberries in a sieve placed over a bowl and leave to drain. Reduce the oven temperature to 170C, 150c fan, 325F, gas 3.",
    "Mix the biscuits with the butter and press into the base of the tin. Bake in the oven for 5 minutes, remove and leave to cool.",
    "Place the cream cheese, flour, eggs and egg yolk, elderflower cordial and sour cream in a large mixing bowl. Beat with an electric mixer until smooth, being careful not to overbeat the mixture.",
    "Place half the drained gooseberries over the biscuit base, making sure that they do not touch the edges of the tin. Pour over the cheesecake filling, gently tap the tin once or twice on the worktop to remove any air bubbles. Place the cheesecake on a baking sheet and bake for 35 minutes. Mix the remaining sour cream and elderflower cordial together then carefully pour it over the top of the cheesecake. Be very careful as the top will be fragile. Return to the oven and bake for a further 15 minutes or until the cheesecake is set but with a slight wobble in the centre. Remove from the oven and run a round bladed knife around the inside of the tin to loosen the cheesecake. Leave to cool completely in the tin then cover and chill overnight.",
    "To serve, remove the cheesecake from the tin, slice and serve with the remaining gooseberries mixed with the roasting juices on top.",
    "The cheesecake will keep for three days, covered in the fridge"
  ],
  "ingredients": [
    "0",
    "800g (1lb 12oz) gooseberries, topped and tailed",
    "75g (3oz) caster sugar",
    "150g (5oz) Hob-Nob biscuits, crushed",
    "50g (2oz) butter, melted",
    "1",
    "600g (1lb 5oz) cream cheese",
    "2 level tbsp plain flour",
    "100g caster sugar",
    "2 large eggs plus 1 egg yolk",
    "3 tbsp Elderflower cordial",
    "150ml (1/4 pt) sour cream",
    "2",
    "2 tbsp Elderflower cordial",
    "3",
    "a 20cm (8in) spring-form tin and a roasting tin lined with baking parchment."
  ],
  "__v": 1
}