{
  "hash": "131e6c2338796c6facd1b8126d6b1e813e132bd6",
  "title": "Roast Muscovy Duck",
  "image": "",
  "href": "http://cooking.nytimes.com/recipes/1569-roast-muscovy-duck",
  "extension": "Chrome",
  "firstAdded": "2016-06-10T14:57:44.868000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "PREPARATION",
    "Preheat oven to 475 degrees.",
    "Cut off and reserve the wing tips and second wing joint of the duck. Leave the main wing bone intact. Remove the fat from inside the duck and rub it all over the duck.",
    "Sprinkle the duck, inside and out, with salt and pepper to taste. Brush the duck with the oil.",
    "Arrange the duck breast-side up in a roasting pan. Add the cutoff wing bones, gizzard and cavity fat. Bake 30 minutes and pour off the fat from the roasting pan. Return the duck to the oven and scatter the celery, onion, carrot, bay leaf, thyme and garlic around the duck. Bake 15 minutes longer if you wish the duck to be medium rare. Or bake it 30 minutes or longer if you wish your duck well done.",
    "Transfer the duck to a warm platter. Pour the fat from the roasting pan, leaving the vegetables in the pan. Place the pan on the stove and cook the vegetables briefly, stirring. Add the wine and let boil about one minute.",
    "Add the broth and accumulated cavity drippings from the duck and cook, stirring, about five minutes. Strain the broth and solids, pushing the solids with the back of a spoon to extract as much liquid as possible.",
    "Heat the butter in a small saucepan, swirling it around until it takes on a nice hazelnut color. Do not burn. Pour the butter over the duck. Carve and serve with the hot pan sauce."
  ],
  "ingredients": [
    "0",
    "1four-pound Muscovy duck",
    "Salt, if desired",
    "Freshly ground pepper",
    "1teaspoon peanut oil",
    "⅓cup coarsely chopped celery",
    "⅓cup coarsely chopped onion",
    "⅓cup coarsely chopped carrot",
    "½bay leaf",
    "½teaspoon thyme",
    "1clove garlic, crushed",
    "⅓cup dry white wine",
    "½cup chicken broth",
    "2tablespoons butter"
  ],
  "__v": 1
}