{
  "hash": "d8d1d34e6028b6cef6e1a0a4faba4f65b5f54453",
  "title": "Twice-Baked Potatoes with Kale",
  "image": "//images.food52.com/LY5p4QpDyy3VlF6v9KxDTJyEYyo=/753x502/44c83b8c-8361-4874-a8d0-3796014fd9b8--kale_potato.jpg",
  "href": "http://food52.com/recipes/20367-twice-baked-potatoes-with-kale",
  "extension": "Chrome",
  "firstAdded": "2016-03-19T12:49:28.463000",
  "users": [
    null
  ],
  "keywords": [
    "russet",
    "potatoes",
    "person",
    "bunch",
    "lacinato",
    "kale",
    "rough",
    "shallots",
    "garlic",
    "cheese",
    "cheddar",
    "gruyre",
    "sour",
    "cream",
    "red",
    "pepper",
    "olive",
    "oil",
    "salt"
  ],
  "directions": [
    "0",
    "Preheat oven to 350° F.",
    "Wash off potatoes and poke some holes in the skin with a fork. To cut back on cooking time, microwave the potatoes to soften the middle. You will bake it later for the \"twice-baked\" part. That step will ensure the skin gets nice and crispy. Cook the potatoes in the microwave for 15 minutes total, turning over every 5 minutes.",
    "As the potatoes cook, sauté the kale. Heat 2 tablespoons olive oil over medium heat. Add shallot and crushed red pepper flakes and cook for 5 minutes, until soft. Add garlic and cook for 3 minutes. Add the kale, salt, and pepper and make sure the kale is coated with olive oil. Cover and let cook until soft and wilted, about 10 minutes, stirring occasionally. Remove from heat and chop up until almost paste-like. You want to be able to stir it into the potato mixture without any large pieces.",
    "Once the potatoes are cool enough to handle, cut in half, lengthwise. Scoop out the center of the potatoes (which should be nice and soft), leaving about 1/4 inch of skin and potato. Put the insides in a large mixing bowl. Mash up the potatoes until they become one cohesive mass. Add the sour cream, cheese, kale, salt, and pepper. Combine into one delicious, creamy mixture. Taste and adjust seasoning as necessary.",
    "Put the potato skins on a baking sheet. Stuff the mixture back into the potato skins and smooth the top. Pop into the oven for 25 minutes to finish."
  ],
  "ingredients": [
    "0",
    "3 russet potatoes (1/2 per person)",
    "1 large bunch lacinato kale (rough chop)",
    "2 shallots (diced)",
    "3 cloves garlic (minced)",
    "1 1/2 cups grated cheese (cheddar or Gruyère)",
    "1 cup sour cream",
    "1 teaspoon crushed red pepper flakes",
    "Olive oil",
    "Salt and pepper"
  ],
  "__v": 1
}