{
  "hash": "e3ec2b94d95857589a93bf1573a0fdaae00fe602",
  "title": "Spaghetti Squash “Pizza” Bowls",
  "image": "https://cookieandkate.com/images/2018/02/pizza-spaghetti-squash-close-up.jpg",
  "href": "https://cookieandkate.com/2018/spaghetti-squash-pizza-bowls-recipe/",
  "extension": "",
  "firstAdded": "2018-05-01T16:28:37.113000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To prepare the spaghetti squash, preheat the oven to 400 degrees Fahrenheit and line a large, rimmed baking sheet with parchment paper for easy clean-up.",
    "Use a very sharp chef’s knife to cut off the tip-top and very bottom ends of each spaghetti squash. Stand the squash upright on a stable surface and carefully slice through it from top to bottom to divide it in half. Repeat with the other squash.",
    "Use a large spoon to scoop out the spaghetti squash seeds and discard them. Drizzle the insides of each squash half with 1 teaspoon olive oil and rub it all over the inside. Sprinkle salt and pepper lightly over the interiors of the squash, then place them cut-side down on the prepared baking sheet.",
    "Bake for 40 to 60 minutes, until the cut sides are turning golden and the interiors are easily pierced through with a fork. Small squash will be done sooner than large squash, naturally! Leave the oven on for later.",
    "Meanwhile, cook the spinach: In a large skillet over medium heat, warm 1 tablespoon olive oil. Add the garlic and sauté until fragrant, about 30 seconds to 1 minute. Add the spinach and cook, stirring often, until it’s wilted. Set aside.",
    "Once the squash is done baking, fluff the interiors with a fork to make the insides spaghetti-like. Divide the spinach and Parmesan into the spaghetti squash and stir them into the squash. Season to taste with salt. Spread marinara sauce generously over each (feel free to eyeball this) and top with mozzarella.",
    "Return the squash to the oven and bake for 20 minutes, or until the cheese is spotty brown. Sprinkle with fresh basil and red pepper flakes, if desired, and serve."
  ],
  "ingredients": [
    "0",
    "2 medium-to-large spaghetti squash (about 5.5 pounds total), or 3 small",
    "4 teaspoons + 1 tablespoon extra-virgin olive oil, divided",
    "Salt",
    "Freshly ground black pepper",
    "4 medium cloves garlic, pressed or minced",
    "6 ounces (6 packed cups) baby spinach",
    "⅔ cup (2 ounces) grated Parmesan cheese",
    "2 cups marinara sauce (I used store-bought)",
    "8 ounces (2 cups) grated part-skim mozzarella cheese",
    "Chopped fresh basil, for garnish",
    "Pinch of red pepper flakes, optional"
  ],
  "__v": 1
}