{
  "hash": "3c97979326fc233d63e8ada1cf9841f2910e1323",
  "title": "“Crispy Skin” Stuffed Tofu",
  "image": "http://thewoksoflife.com/wp-content/uploads/2015/11/stuffed-tofu-7.jpg",
  "href": "http://thewoksoflife.com/2015/11/crispy-skin-stuffed-tofu/",
  "extension": "Chrome",
  "firstAdded": "2017-04-30T03:24:37.035000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Use a cleaver or knife to finely mince the shrimp into a very fine paste. This process entails chopping and then folding the shrimp paste over and onto itself, and continuing to chop until you have a paste. We used this same technique in our Dim Sum Stuffed Pepper recipe. Transfer the shrimp paste to a bowl and add in the rest of the filling ingredients. Mix well until combined.",
    "Carefully remove the soft tofu from the carton, draining the excess water. Cut the block in half lengthwise, and cut each half into 5 equal pieces of tofu so you get 10 tofu blocks.",
    "Next, position the tofu slices on a plate or sheet pan. Measure out 2 tablespoons of cornstarch onto a small plate. Next, scoop 1 teaspoon of the filling with a measuring spoon and dip the open end of the spoon onto the cornstarch to coat it. Place a teaspoon of filling onto the middle of each tofu block cornstarch side down. This cornstarch will “glue” the filling onto the tofu. Repeat another 9 times for the other tofu pieces.",
    "Once all the filling is in place, pour the remaining cornstarch into a sieve, and carefully sift the rest evenly over the stuffed tofu. This will give you an extra crispy top-coating.",
    "Heat 4 cups of oil in a wok or small pot to 375 degrees. While you're waiting for the oil to heat up, mix the ingredients for the dipping sauce in a small bowl and set aside.",
    "Use a metal spatula to carefully pick up a block of tofu and slide it into the oil. You can fry them a few at a time, but make sure the oil temperature remains constant. Fry them until golden brown, moving them gently as needed to cook evenly, 2 to 4 minutes. When cooked through, remove them with a slotted spoon or metal spatula to drain on a plate lined with paper towels. You can sprinkle a bit of salt on top if you like, or simply enjoy them with the dipping sauce. Don’t salt the tofu before frying, or it will crack open, and you’ll have a bit of a mess on your hands.",
    "Transfer to a serving plate and serve with the sauce on the side!"
  ],
  "ingredients": [
    "0",
    "6 ounces shrimp, peeled and deveined",
    "1¼ teaspoons salt",
    "1 teaspoon oil",
    "½ teaspoon sesame oil",
    "½ teaspoon Shaoxing wine",
    "1½ teaspoon cornstarch",
    "Fresh ground white pepper",
    "1",
    "1 block soft tofu",
    "2 tablespoons cornstarch",
    "4 cups oil for frying",
    "2",
    "1 teaspoon sugar",
    "1 tablespoon light soy sauce",
    "¼ teaspoon dark soy sauce",
    "1 tablespoon chopped scallions"
  ],
  "__v": 1
}