{
  "hash": "a24cb8ead4d7c45d831144eb5518e666f4ff7672",
  "title": "Keto Faux Sous Vide Egg Bites",
  "image": "https://cdn.ruled.me/wp-content/uploads/2017/01/FauxSousVideBitesSecond.jpg",
  "href": "https://www.ruled.me/keto-faux-sous-vide-egg-bites/",
  "extension": "Chrome",
  "firstAdded": "2018-04-15T16:47:18.429000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "If you're making bacon, go ahead and put that in the oven now. Otherwise, skip this step by purchasing pre-cooked bacon.",
    "Crack 6 eggs into a container, then add 1/4 cup cottage cheese to your eggs.",
    "Chop the chives into small pieces. Set aside.",
    "Grate the cheeses and add into the mixture. Add seasoning, chives, hot sauce, and butter. Blend smooth.",
    "Add water to the bottom of your poaching pan. Then, turn to medium-high heat. Press 3/4 - 1 slice of bacon in the bottom of each well.",
    "Once the water underneath is streaming steadily, turn heat down to medium. Fill each well with the egg mixture, covering the bacon at the bottom. Cover and cook for 5-7 minutes or until the centers do not jiggle.",
    "Crack 6 eggs into a container, then add 1/4 cup cottage cheese to your eggs.",
    "Dice the red pepper and spinach and set aside.",
    "Grate the cheeses and add into the mixture. Add seasoning and blend smooth.",
    "Heat butter in a pan on high heat. Once hot and bubbling, add red peppers. Cook until browned on the outside. You can skip this step by purchasing pre-roasted red peppers.",
    "Add spinach and red pepper to the blended egg mixture. Stir well to combine.",
    "Add water to the bottom of your poaching pan. Then, turn to medium-high heat. Once the water underneath is streaming steadily, turn heat down to medium. Fill each well with the egg mixture, cover and cook for 5-7 minutes or until the centers do not jiggle."
  ],
  "ingredients": [
    "0",
    "6 strips bacon, cooked",
    "6 large eggs",
    "¼ cup cottage cheese",
    "2 tablespoons chopped chives",
    "¼ cup (~1 oz.) grated gruyere cheese",
    "2 tablespoons grated monterey jack cheese",
    "1 teaspoon hot sauce",
    "2 tablespoons butter",
    "Salt, pepper, and additional seasonings to taste.",
    "6 large eggs",
    "¼ cup cottage cheese",
    "¼ medium red bell pepper, roasted and diced",
    "¼ cup chopped spinach",
    "¼ cup (~1 oz.) monterey jack cheese",
    "2 tablespoons parmesan cheese",
    "1 tablespoon butter",
    "Salt, pepper, and additional seasonings to taste."
  ],
  "__v": 1
}