{
  "hash": "ced274b3424ac91ba44332af882db911b5a23a52",
  "title": "Blueberry Coffee Cake",
  "image": "http://cdn-image.myrecipes.com/sites/default/files/styles/300x300/public/image/recipes/ck/08/05/blueberry-cake-ck-1734304-x.jpg?itok=ypnAGSkz",
  "href": "http://www.myrecipes.com/recipe/blueberry-coffee-cake",
  "extension": "Chrome",
  "firstAdded": "2016-05-13T12:39:38.177000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350°.",
    "Lightly spoon flour into dry measuring cups; level with a knife. Combine flour, baking powder, soda, and salt, stirring with a whisk.",
    "Place granulated sugar and butter in a large bowl; beat with a mixer at medium speed until well blended (about 2 minutes). Add vanilla, egg, and egg white; beat well. Add flour mixture and buttermilk alternately to sugar mixture, beginning and ending with flour mixture; mix after each addition.",
    "Spoon half of the batter into a 9-inch round baking pan coated with cooking spray. Sprinkle evenly with 1 cup blueberries. Spoon remaining batter over the blueberries; sprinkle evenly with remaining 1 cup blueberries. Sprinkle the top evenly with 1 tablespoon turbinado sugar. Bake at 350° for 50 minutes or until a wooden pick inserted in center comes out clean. Cool in pan 10 minutes on a wire rack; remove from pan. Cool completely on wire rack.",
    "Note: If using peak-season fruit, use 1 1/2 cups blueberries instead of 2 cups, and only 1 cup buttermilk instead of 1 1/3 cups. This will make the batter thicker so the berries won't sink to the bottom."
  ],
  "ingredients": [
    "0",
    "1 1/2 cups all-purpose flour (about 6 3/4 ounces)",
    "1 teaspoon baking powder",
    "1/4 teaspoon baking soda",
    "1/4 teaspoon salt",
    "3/4 cup granulated sugar",
    "6 tablespoons butter, softened",
    "1 teaspoon vanilla extract",
    "1 large egg",
    "1 large egg white",
    "1 1/3 cups low-fat buttermilk",
    "Cooking spray",
    "2 cups fresh blueberries",
    "1 tablespoon turbinado sugar"
  ],
  "__v": 1
}