{
  "__v": 1,
  "directions": [
    "0",
    "If your fennel isn't trimmed, cut off the stalks and fronds right where they grow out of the bulb. (Tip: save some of the lacy fronds for garnish or toss in a salad.) Remove any bruised or extremely tough outer leaves and trim the bottom. Cut the fennel into vertical quarters, making sure there is a bit of the core in each piece to keep them intact.",
    "Melt the butter and olive oil in a large (12-inch) skillet that has a well-fitting lid. Add the fennel, arranging them so that they are all in a single layer and one of their cut sides is down. Cook gently over medium heat until browned, 5 to 8 minutes. Do not stir the fennel: you want to get a nice brown color going on the cut side. Gently turn the fennel using a pair of tongs. and brown the other side.",
    "Sprinkle on some salt, and have a lid handy. Add about 1/4 cup of water and quickly cover the pan. Turn down the heat and braise the fennel until it is very soft and most of the water has evaporated (about 20 minutes.) Check on occasion and add a little more water if the fennel isn't completely soft.",
    "Remove the lid and pour in the cream. Simmer gently until the cream starts to thicken and glazes the fennel, about 5 minutes. Add the lemon juice, shaking the pan. Taste for salt or more lemon. Serve hot as a side dish or a first course.",
    "Serves four."
  ],
  "firstAdded": "2014-08-17T02:25:20.090000",
  "hash": "f241392d4198671917ca0e14f4a9fcc7dc879b94",
  "href": "http://www.thekitchn.com/recipe-creambraised-fennel-ala-81120",
  "image": "http://p-ec2.pixstatic.com/506a057ffb04d60a43000a00._w.540_h.405_s.fit_.jpg",
  "ingredients": [
    "0",
    "4 fennel bulbs, trimmed (about 1 1/2 pounds)",
    "1 tablespoon unsalted butter",
    "1 tablespoon olive oil",
    "2 pinches of sea salt",
    "2 to 4 tablespoons heavy cream",
    "1 tablespoon fresh lemon juice"
  ],
  "keywords": [
    "fennel",
    "bulbs",
    "trimmed",
    "unsalted",
    "butter",
    "olive",
    "oil",
    "pinches",
    "salt",
    "cream",
    "lemon",
    "juice"
  ],
  "title": "Cream-Braised Fennel ala Orangette",
  "users": [
    null
  ]
}