{
  "hash": "5e85d7cbc47b72577a3def880d8315d7e3035cf0",
  "title": "Savory Corn Beef Brisket + Irish Cheddar French Toast with Kale Pesto Slaw. prep time: 20 MINUTEScook time: 8 HOURStotal time: 8 HOURS 20 MINUTES yields: 4 FRENCH TOAST SANDWICHES + EXTRA BRISKET",
  "image": "http://www.halfbakedharvest.com/wp-content/uploads/2014/03/Savory-Corn-Beef-Brisket-+-Irish-Cheddar-French-Toast-with-Kale-Pesto-Slaw.-8.jpg",
  "href": "http://www.halfbakedharvest.com/savory-corn-beef-brisket-irish-cheddar-french-toast-kale-pesto-slaw/",
  "extension": "Chrome",
  "firstAdded": "2015-05-07T17:48:23.742000",
  "users": [
    null
  ],
  "keywords": [
    "corn",
    "beef",
    "brisket",
    "stout",
    "beer",
    "used",
    "guinness",
    "garlic",
    "brown",
    "sugar",
    "tomato",
    "balsamic",
    "vinegar",
    "dijon",
    "mustard",
    "soy",
    "paprika",
    "chipotle",
    "chile",
    "adobo",
    "bay",
    "leaf",
    "kale",
    "pesto",
    "slaw",
    "raw",
    "shreds",
    "jalapeno",
    "seeds",
    "basil",
    "lemon",
    "juiced",
    "french",
    "toast",
    "eggs",
    "milk",
    "parmesan",
    "salt",
    "pepper",
    "favorite",
    "soda",
    "bread",
    "slices",
    "irish",
    "cheddar",
    "cheese",
    "butter",
    "pan"
  ],
  "directions": [
    "0",
    "Instructions",
    "!To make in the CrockpotPlace the corn beef in the bowl of a crockpot and pour the beer over top. In a medium bowl whisk together the garlic, brown sugar, tomato paste, balsamic vinegar, dijon mustard, soy sauce, paprika and minced chipotle pepper. Pour the mixture over the corn beef. Add the bay leaf to the crockpot. Cover and cook on low 8-10 hours or on high 6-8 hours.!To cook in the Oven.Preheat oven to 350 degrees F.Place the corn beef in a large heavy bottomed pot and pour the beer over top. In a medium bowl whisk together the garlic, brown sugar, tomato paste, balsamic vinegar, dijon mustard, soy sauce, paprika and minced chipotle pepper. Pour the mixture over the corn beef. Add the bay leaf to the pot. Cover and bake for 3 1/2-4 hours or until the meat is tender and shreds easily.!To make the Kale Pesto SlawAdd the kale and jalapeño to a large bowl. Add 2 tablespoons pesto and 1 teaspoon lemon juice. Massage the pesto into the kale with your hands until evenly combine. Taste and add more pesto if desired.!To make the French Toast for the sandwichesGrab a 9x13 inch pan and whisk together the eggs, milk, parmesan, salt and pepper. Set aside.Now grab 2 pieces of bread and place some corned beef on one slice. Drizzle the beef with some of the sauce from the crockpot (save the rest for serving). Then add the kale slaw and Irish cheddar cheese. Add the top slice of bread. Repeat with the remaining sandwiches.You are now going to soak the sandwich in the egg mixture (already in the 9x13\" pan), soak 1-2 minutes then flip and soak the other side.Heat a large skillet or griddle over medium heat and coat generously with butter. When the skillet is hot, cook the sandwich in batches (do not overcrowd) until golden and crisp, 3 to 4 minutes per side. Remove and serve immediately with the remaining kale pesto slaw and any sauce from the crockpot."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Corn Beef",
    "4 pounds corn beef brisket",
    "2 cups stout beer (I used Guinness)",
    "2 cloves garlic, minced or grated",
    "1/2 cup brown sugar",
    "1/3 cup tomato paste",
    "1/3 cup balsamic vinegar",
    "1/4 cup dijon mustard",
    "1/4 cup soy sauce",
    "1 teaspoon paprika",
    "1 chipotle chile in adobo, minced",
    "1 bay leaf",
    "Kale Pesto slaw",
    "4 cups raw kale, cut into shreds",
    "1 large jalapeno, seeds removed + chopped",
    "1/4 cup basil pesto",
    "1/2 a lemon, juiced",
    "French Toast",
    "4 large eggs",
    "1 cup milk",
    "1/2 cup parmesan, grated",
    "salt and pepper, to taste",
    "8 slices of your favorite bread (I used this Soda Bread), cut into 1/2 inch slices",
    "8 ounces Irish Cheddar Cheese, shredded",
    "butter, for the pan"
  ],
  "__v": 1
}