{
  "hash": "02d2d40478793fb750cdeea3b38ba447f26d5d2d",
  "title": "Colored Mirror Glaze",
  "image": "https://i6.chefiso.com/srv/images/mango-mirror-cover-1400x437.jpg",
  "href": "https://chefiso.com/p/colored-mirror-glaze-recipe/",
  "extension": "Chrome",
  "firstAdded": "2018-12-01T21:48:48.806000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Gel food dye",
    "Preparation",
    "Completely freeze your cake overnight. It must be frozen completely solid before pouring the glaze. Try to smooth out the top and sides as much as possible as any imperfection will show through the glaze.",
    "Once your cake is ready, begin to prepare the mirror glaze. Bloom the gelatin in cold water and set it aside while you heat the liquids.",
    "Quickly sprinkle the gelatin into the water and whisk together until it starts to thicken",
    "Let this mixture sit and bloom until it fully gels and hardens",
    "Meanwhile, prepare the glaze base.",
    "Bring the water, sugar, and condensed milk to a gently simmer",
    "Turn off the heat and stir the bloomed gelatin into the mixture. Pass this mixture through the sieve to remove any gelatin clumps.",
    "Pour the mixture over the chocolate until it dissolves",
    "This should take about 5-10 minutes for all of the chocolate to fully melt. Use an immersion blender fully submerged into the liquid to avoid introducing any air bubbles. Blend this until the entire mixture is smooth and homogenous.",
    "Blend the food dye into the mirror glaze",
    "Allow the mirror glaze to cool to the target temperature, which is about 92°F (33°C). Make sure you stir periodically to prevent a film from forming on the top.",
    "When the glaze is between 90°F and 94°F (32°C - 34°C), it is ready to be poured over the cake. At this point be very careful not to introduce bubbles since the glaze is very viscous and they will not pop on their own. You must manually pop them or strain the mixture through a sieve.",
    "For domes, simply drizzle a bit of the glaze over each dome.",
    "Pour the mirror glaze over your frozen cake",
    "For glazing round cakes, pour the glaze in a circular motion from the center, then scrape off the top with a flat spatula.",
    "Pour the mirror glaze over the top of the cake until it starts running down the sides",
    "Gently use a spatula to scrape off the excess glaze",
    "Beautiful, smooth, and glossy glaze"
  ],
  "ingredients": [
    "0",
    "350 grams white chocolate (12.25 ounces)",
    "150 grams water (5.25 ounces, ~1/2 cups)",
    "300 grams sugar (11.5 ounces, ~1 1/2 cups)",
    "200 grams condensed milk (7 ounces, ~2/3 cups)",
    "19 grams powdered gelatin (0.7 ounces)",
    "1 tablespoon vanilla extract",
    "gel food dye",
    "unglazed frozen cake, such as milk peach entremet"
  ],
  "__v": 1
}