{
  "hash": "2a8bfe83d493d6b0140d5d0e62763747e1c1ce36",
  "title": "Super Simple Marinara Sauce",
  "image": "https://cookieandkate.com/images/2018/03/simple-marinara-sauce-recipe-4.jpg",
  "href": "https://cookieandkate.com/2018/simple-marinara-sauce-recipe/",
  "extension": "Firefox",
  "firstAdded": "2018-10-22T17:44:26.679000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium, heavy-bottomed saucepan, combine the tomatoes (with their juices), halved onion, garlic cloves, olive oil, oregano and red pepper flakes (if using).",
    "Bring the sauce to a simmer over medium-high heat, then lower the heat to keep the sauce at a slow, steady simmer for about 45 minutes, or until droplets of oil float free of the tomatoes. Stir occasionally, and use a sturdy wooden spoon to crush the tomatoes against the side of the pot after about 15 minutes has passed.",
    "Remove the pot from the heat and discard the onion. Smash the garlic cloves against the side of the pot with a fork, then stir the smashed garlic into the sauce. Do the same with any tiny onion pieces you might find. Use the wooden spoon to crush the tomatoes to your liking (you can blend this sauce smooth with an immersion blender or stand blender, if desired).",
    "Add salt, to taste (the tomatoes are already pretty salty, so you might just need a pinch). Serve warm. This sauce keeps well, covered and refrigerated, for up to 4 days. Freeze it for up to 6 months."
  ],
  "ingredients": [
    "0",
    "1 large can (28 ounces) whole peeled tomatoes*",
    "1 medium yellow onion, peeled and halved",
    "2 large cloves garlic, peeled but left whole",
    "2 tablespoons extra-virgin olive oil",
    "1 teaspoon dried oregano",
    "Pinch of red pepper flakes (optional, omit if sensitive to spice)",
    "Salt, to taste (if necessary)",
    "Optional, for serving: Cooked pasta, grated Parmesan cheese or vegan Parmesan, chopped fresh basil, additional olive oil"
  ],
  "__v": 1
}