{
  "hash": "eada74e877ee936c5df00c1fd324805c8b9183ab",
  "title": "The perfect chicken tikka masala",
  "image": "http://recipe-folder.com/img/recipe-images/050/6.5/1157000650.jpg",
  "href": "http://www.theguardian.com/lifeandstyle/wordofmouth/2014/apr/24/how-to-cook-perfect-chicken-tikka-masala",
  "extension": "Chrome",
  "firstAdded": "2015-12-07T16:21:24.242000",
  "users": [
    null
  ],
  "keywords": [
    "serves",
    "chicken",
    "tikka",
    "boneless",
    "skinless",
    "thighs",
    "breasts",
    "juice",
    "lemons",
    "salt",
    "plain",
    "yoghurt",
    "pureed",
    "ginger",
    "use",
    "pestle",
    "mortar",
    "garlic",
    "cumin",
    "garam",
    "masala",
    "smoked",
    "paprika",
    "gheeclarified",
    "butter",
    "flavourless",
    "oil",
    "onions",
    "green",
    "cardamom",
    "pods",
    "black",
    "pod",
    "cinnamon",
    "puree",
    "tomatoes",
    "tomato",
    "chillies",
    "split",
    "sugar",
    "whipping",
    "cream",
    "fenugreek",
    "leaves",
    "lemon",
    "coriander",
    "serve"
  ],
  "directions": [
    "0",
    "Cut the chicken into bite-sized chunks and stir in the lemon juice and salt. Leave to marinade for 30 minutes. Stir the remaining marinade ingredients together and add to the bowl. Stir well to coat, cover and chill overnight, then bring to room temperature before cooking.",
    "To make the sauce, heat the ghee or other fat in a frying pan over a medium-high heat and add the onions. Fry until soft and golden brown, stirring regularly. Meanwhile, grind the seeds from the cardamom pods, the cinnamon stick and cloves to a smooth powder using a pestle and mortar.",
    "Stir the pureed ginger and garlic into the onions and fry for a couple of minutes, stirring, then add the powdered spices and fry for a minute or so. Tip in the tomatoes and tomato puree plus 300ml water, bring to a simmer, turn the heat down to medium and cook until the oil starts to pool around the sides of the pan.",
    "Meanwhile, heat your grill as high as it goes, and thread the chicken on to metal skewers, pushing the pieces well together. Put on a lined baking sheet as close to the grill as possible and grill for six to eight minutes on each side, until nicely charred at the edges.",
    "Puree the sauce until smooth, then, once the chicken is done, return the pureed sauce to the pan on a medium heat. Stir any remaining marinade into the sauce, along with the chillies, sugar, cream and paprika – you can add more of the latter if necessary to give the sauce a deeper colour. Add the chicken, fenugreek and garam masala and cook for about five minutes, then taste for seasoning. Add more salt or sugar or the lemon juice if you like, then serve with chopped coriander.",
    "CTM: beloved, spicy comfort food or shameful British abomination? How do you make yours, and which other restaurant favourites would you like to recreate at home?"
  ],
  "ingredients": [
    "0",
    "(Serves 4)",
    "For the chicken tikka:",
    "4 boneless, skinless chicken thighs",
    "2 boneless, skinless chicken breasts",
    "Juice of 2 lemons",
    "1 tsp salt",
    "150ml plain yoghurt",
    "1 tbsp pureed ginger (use a pestle and mortar)",
    "1 tbsp crushed garlic (about 3 cloves)",
    "1½ tsp ground cumin",
    "1 tbsp garam masala",
    "1 tbsp smoked sweet paprika",
    "For the sauce:",
    "2 tbsp ghee/clarified butter (or flavourless oil)",
    "2 small onions, chopped",
    "6 green cardamom pods,",
    "1 black cardamom pod (optional)",
    "2cm cinnamon stick",
    "4 cloves",
    "2 tbsp pureed ginger (use a pestle and mortar)",
    "8 garlic cloves, crushed to a puree",
    "400g chopped tomatoes",
    "1 tbsp tomato puree",
    "2 small green chillies, split",
    "1 tsp sugar",
    "50ml whipping cream",
    "1 tsp paprika",
    "½ tsp fenugreek leaves, ground",
    "1 tsp garam masala",
    "1 tbsp lemon juice (optional)",
    "Small handful of coriander leaves, to serve"
  ],
  "__v": 1
}