{
  "hash": "c85efa58a6b19d6504995a01af818a85e37c1ee0",
  "title": "EGGPLANT SLICES WITH TAHINI CUMIN SAUCE [VEGAN]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/01/aubergine.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/eggplant-slices-with-tahini-cumin-sauce/",
  "firstAdded": "2015-01-07T11:08:25.766000",
  "users": [
    null
  ],
  "keywords": [
    "medium",
    "sized",
    "eggplant",
    "olive",
    "oil",
    "salt",
    "clove",
    "garlic",
    "super",
    "serve",
    "lots",
    "love",
    "parsley",
    "dont",
    "look",
    "pretty"
  ],
  "directions": [
    "0",
    "Turn the oven to 180 degrees. While it heats up, slice the eggplant lengthwise into ½ cm thick slices. Place them in an oven tray, drip the olive oil over top and sprinkle the salt and the chopped garlic. Bake in the oven for 15 to 25 minutes – until soft and a little brown and crusty on the top.",
    "In the meantime make the sauce. In a frying pan, add the 1 tsp olive oil, the chopped red onion, garlic and the parsley and fry for three to four minutes on low heat (stirring a little bit occasionally). The onions should be soft and golden-ish.",
    "While waiting for the onion/garlic/parsley mix, prepare the base of the sauce: Poor the soy milk into a blender, and while running it on high speed, slowly add the olive oil (it is the slow in the process that helps the sauce thicken so take your time).",
    "Add the onion/garlic/parsley mix to the blender, plus the tahini, the cumin seeds, the agave and the salt. Run the blender again for a minute until the sauce is completely smooth. Taste and adjust the seasoning if needed. Place in a serving bowl in the fridge (where it will thicken further) until the aubergines are ready to serve. Garnish with lots of freshly chopped parsley."
  ],
  "ingredients": [
    "0",
    "3 medium sized eggplant",
    "1 tbsp olive oil",
    "A little sea salt",
    "1 clove garlic, super finely chopped",
    "Fresh parsley to serve, chopped (lots if you love parsley, less if you don’t – it will still look pretty!)"
  ],
  "__v": 1
}