{
  "hash": "9ef765ceb3d0bf8482e5379ab435edea8f98233e",
  "title": "Chickpea Pizza Crust – High Protein Pizza Crust",
  "image": "https://hasfit.com/images/Garbanzo Done.JPG",
  "href": "https://hasfit.com/healthy-recipe/lunch/chickpea-pizza-crust/",
  "extension": "Chrome",
  "firstAdded": "2018-09-30T19:04:53.575000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "So to begin, mix the ground flax and water together and set aside for about 10 minutes to thicken. Also, preheat your oven to 425 degrees.",
    "While the flax seeds are doing their thing, combine the chickpeas, flour, garlic, and 1/2 cup of water and blend until totally combined. I had to open mine and scrape down the sides of the processor to make sure everything is well combined. In total, I processed for about 1 minute.",
    "Next, I removed the thick batter and placed it in a bowl. I then folded in the ground flax, dried basil, dried parsley, salt/pepper until all of the ingredients are well incorporated.",
    "Place a piece of parchment paper on a pizza stone or sheet and place the thick batter on the parchment paper. The batter will be sticky but that’s ok!",
    "Next, wet your hands (to prevent sticking), and flatten the batter out into a round pizza shape and until the batter is about 1 inch thick.",
    "Bake the crust for 15-20 minutes or until a light golden brown.",
    "Next comes the fun part! Add the toppings of your choice…",
    "Since this was my brother’s thing, I let him go nutso on the toppings. He added vegan mozzarella cheese, bell pepper, onion, mushrooms, tomatoes, pepperoni (no longer vegan), and serrano peppers because he can’t eat anything without burning off his taste buds.",
    "Once your toppings are on, bake for an additional 12-15 minutes or until cheese is melted and veggies are roasted!"
  ],
  "ingredients": [
    "0",
    "1 15oz can of chickpeas (drained and rinsed)",
    "1 1/4 cup of garbanzo flour",
    "3 tablespoons ground flax seed",
    "6 tablespoons water",
    "1/2 tsp dried basil",
    "1/2 tsp parsley",
    "1/4 tsp of pepper and salt",
    "1-2 minced cloves of garlic"
  ],
  "__v": 1
}