{
  "hash": "30620a00b3444929faba47d1f8d9a391acdef994",
  "title": "One-Pot Greek Oregano Chicken and Orzo with Tomatoes in Garlic Oil.SammieSuLauren @ Hall NestingMirandaGerlinde @Sunnycovechefdonna rocheLibbytodd wagnerSydney | Modern GranolaTei LaineJordanCassieLaura (Blogging Over Thyme)Laura (Tutti Dolci)Kathryn @ The Scratch ArtistAlishaChristinaLynnenancyabcJohn @ heneedsfoodCindyhalfbakedharvestCatherinehalfbakedharvestAbraKatiehalfbakedharvestBethhalfbakedharvestJillianhalfbakedharvestAngelahalfbakedharvestSheilahalfbakedharvestAlisonhalfbakedharvest",
  "image": "",
  "href": "http://www.halfbakedharvest.com/one-pot-greek-oregano-chicken-and-orzo-with-tomatoes-in-garlic-oil/",
  "extension": "Chrome",
  "firstAdded": "2016-10-30T18:54:45.694000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "!Tomatoes",
    "Add the olive oil, garlic and chili pepper flakes to a small sauce pan. Bring the oil to a low boil and then quickly reduce the heat to low. Simmer for 20-30 minutes and then remove from the heat. Allow to cool and then store in a glass jar for up to a month in the fridge.",
    "Add the tomatoes to a bowl or plate and drizzle with the chili oil mix. Sprinkle with salt + pepper. Serve alongside the chicken.",
    "!Chicken",
    "Heat 2 tablespoons olive oil in a medium size dutch oven or large skillet set on medium-high heat.",
    "Once hot, add the chicken, garlic, balsamic vinegar, smoked paprika, salt and pepper. Toss the chicken to coat and then cook until the chicken is browned all over and cooked through, about 5 minutes. Stir in the oregano and cook another minute. Remove the chicken from the pan and to a plate.",
    "To the same pan, add another tablespoon of olive oil, the bell peppers and a pinch of salt + pepper. Sear the peppers until just beginning to caramelize on the edges, about 3-4 minutes. Add the orzo and another tablespoon of olive oil. Stir the pasta with the peppers on then pour in 2 1/2 cups water. Cook until almost all the water is absorbed and the orzo is creamy. Taste the orzo to make sure it is soft in the middle, if needed, add another 1/2 cup of water and continue cooking the orzo until soft. It is important to stir the orzo often, as it wants to stick to the bottom of the pan.",
    "Once the orzo is cooked, slide the chicken and olives into the orzo and remove from the heat. Allow the chicken to warm through, about 3 minutes.",
    "Serve the dish topped with crumbled feta cheese and a side of tomatoes in chili oil."
  ],
  "ingredients": [
    "0",
    "1/2 cup olive oil",
    "4 cloves garlic, crushed",
    "2 tablespoons crushed red pepper flakes",
    "2 heirloom tomatoes, sliced",
    "2 cups heirloom cherry tomatoes, halved",
    "salt and pepper, to taste",
    "1/4 cup olive oil",
    "1 pound boneless, skinless chicken, cut into bit size pieces",
    "2-3 cloves garlic, minced or grated",
    "2 tablespoon balsamic vinegar",
    "1 tablespoon smoked paprika",
    "1/2 teaspoon salt + pepper",
    "1/2 cup fresh oregano, chopped",
    "2 bell peppers, sliced",
    "1 cup mixed kalamata or green olives",
    "16 ounces orzo pasta (use gluten free if needed)",
    "4-6 ounces feta cheese, crumbled"
  ],
  "__v": 1
}