{
  "hash": "eaeca4f0d85ff968aaf539bff3f13dbdaa39db25",
  "title": "Balsamic Glazed Steak Rolls",
  "image": "http://www.tablespoon.com/-/media/Images/Articles/PostImages/2014/05/week4/2014-05-21-steak-rolls-hero-680x384.jpg",
  "href": "http://www.tablespoon.com/recipes/balsamic-glazed-steak-rolls/c723300c-8122-462d-b8ff-2c85ecd7325d/?nicam4=SocialMedia&nichn4=Pinterest&niseg4=Tablespoon&nicreatID4=Post&crlt.pid=camp.AxUc7qiDDaLm",
  "extension": "Chrome",
  "firstAdded": "2015-11-14T12:50:40.164000",
  "users": [
    null
  ],
  "keywords": [
    "slices",
    "sirloin",
    "flank",
    "steak",
    "length",
    "width",
    "according",
    "personal",
    "preference",
    "extra",
    "virgin",
    "olive",
    "oil",
    "salt",
    "black",
    "pepper",
    "rosemary",
    "red",
    "bell",
    "strips",
    "green",
    "medium",
    "zucchini",
    "yellow",
    "onion",
    "white",
    "button",
    "cremini",
    "mushrooms",
    "clove",
    "garlic",
    "dark",
    "balsamic",
    "vinegar",
    "dry",
    "wine",
    "brown",
    "sugar",
    "sprigs",
    "progresso",
    "beef",
    "flavored",
    "broth"
  ],
  "directions": [
    "0",
    "Rub each side of the steak slices with a little extra virgin olive oil. Sprinkle with salt, freshly ground black pepper and some chopped fresh rosemary.",
    "Heat one tablespoon of extra virgin olive oil in a skillet over medium-high heat and cook the vegetables until crisp-tender, seasoning with salt and pepper.",
    "Place a few of the vegetable strips vertically on one end of each steak cutlet so that once rolled up the end of the vegetables are sticking out of each end of the steak roll. Roll it up, and secure it with a toothpick. Repeat for each steak roll.",
    "For the rosemary balsamic glaze: Heat the olive oil in a small saucepan over medium-high heat. Add the garlic and cook for one minute, until fragrant. Add the balsamic vinegar, red wine, brown sugar and the rosemary sprigs and bring to a rapid boil. Reduce the heat and simmer uncovered for 5 minutes. Add the broth, return to a boil, reduce the heat to low and simmer for another 15 minutes. Discard the rosemary sprigs.",
    "Prepare the grill and grill on each side for about 2 minutes or according to desired doneness. Do the same if cooking them in a skillet, frying over medium-high heat until done. Serve immediately drizzled with the rosemary balsamic glaze. Baked potatoes make a great accompaniment."
  ],
  "ingredients": [
    "0",
    "8 thin slices sirloin or flank steak (length and width according to personal preference)",
    "Extra virgin olive oil",
    "Salt and freshly ground black pepper",
    "Fresh rosemary, chopped",
    "1 red bell pepper, sliced into thin strips",
    "1 green bell pepper, sliced into thin strips",
    "1 medium zucchini, sliced into thin strips",
    "1 medium yellow onion, halved and then thinly sliced",
    "A few white button or cremini mushrooms, cut into thin strips",
    "1",
    "1 teaspoon extra virgin olive oil",
    "1 large clove garlic, minced",
    "1/4 cup dark balsamic vinegar",
    "2 tablespoons dry red wine",
    "2 teaspoons brown sugar",
    "2 sprigs fresh rosemary",
    "1/4 cup Progresso™ beef flavored broth"
  ],
  "__v": 1
}