{
  "hash": "56574e91b29a0132dd11d0bd863ced141b28167b",
  "title": "Fall-Off-The-Bone Sous Vide Ribs",
  "image": "http://recipe-folder.com/img/recipe-images/079/593/3478481479.jpg",
  "href": "http://recipes.anovaculinary.com/recipe/fall-off-the-bone-ribs",
  "extension": "Chrome",
  "firstAdded": "2015-12-07T10:55:10.996000",
  "users": [
    null
  ],
  "keywords": [
    "rack",
    "baby",
    "ribs",
    "membrane",
    "dry",
    "rub",
    "style",
    "barbecue"
  ],
  "directions": [
    "0",
    "Directions",
    "Step 1",
    "Set the Anova Sous Vide Precision Cooker to 160ºF (71ºC).",
    "Step 2",
    "Generously coat both sides of the ribs with the dry rub. Don't be shy; the rub is what gives the ribs a great bark and color.",
    "Step 3",
    "Place the ribs in a large vacuum seal bag and vacuum seal on the moist setting. (Alternatively, slice the rack in half width-wise and divide between two large zipper lock bags. Seal using the water immersion technique.) Place the bag(s) in the water bath and set the timer for 14 or up to 16 hours.",
    "Finishing Steps",
    "Step 1",
    "When the timer goes off, remove the bag(s) from the water bath. Remove the ribs from the bag(s). Decide if if you will smoke or broil the ribs.",
    "Step 2",
    "To smoke the ribs, heat a smoker or a grill to 160 to 180 degrees. If using a grill, place a foil pouch filled with soaked wood chips directly on the coals. Add the ribs and smoke for 1 hour and 45 minutes. Baste the ribs with barbecue sauce and continue to smoke for 15 minutes. Remove from the grill and let rest for 5 minutes.",
    "Step 3",
    "To broil the ribs, heat the broiler to high. Use a pastry brush to coat the ribs with barbecue sauce and place on an aluminum foil-lined broiler-safe baking sheet. Place the ribs under the broiler and cook until the sauce is caramelized, 1 to 2 minutes. Watch the ribs carefully so that the sauce doesn't burn. Let the ribs rest for 5 minutes.",
    "Step 4",
    "Slice the ribs apart and serve."
  ],
  "ingredients": [
    "0",
    "Ingredients for 4",
    "1 (2-pound) rack baby back ribs, membrane removed (see note)",
    "1/2 cup dry rub, any style (see note)",
    "1/4 cup barbecue sauce, any style"
  ],
  "__v": 1
}