{
  "hash": "49858405bf5964ed894aefcbfd6e227254c05c77",
  "title": "Easy Pull-Apart Garlic Rolls",
  "image": "http://www.ruchiskitchen.com/wp-content/uploads/2017/01/pull-apart-bread-recipe-6-150x150.jpg",
  "href": "http://www.ruchiskitchen.com/recipe/easy-one-hour-pull-apart-garlic-rolls/",
  "extension": "Chrome",
  "firstAdded": "2017-08-14T19:07:10.004000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "METHOD",
    "KNEADING THE DOUGH",
    "Measure all the ingredients.",
    "Dissolve yeast and sugar in warm water and let stand for five minutes, or until foamy.",
    "Once the yeast activates (foamy and bubbly), go ahead with the recipe. If the yeast fails to do so, please discard and start over.",
    "In a bowl or a bowl of stand mixer, combine flour, butter, salt and baking powder.",
    "Pour in the activated yeast.",
    "Mix and form a soft dough.",
    "Cover and let the dough rest in a warm place/oven for 20 minutes. Dough will double in size. If it doesn't, allow it to sit for another 20 minutes.",
    "While the dough is resting, let's prepare garlic butter. Assemble ingredients listed under garlic butter. Garlic salt can be substituted with fresh chopped garlic and salt.",
    "With a fork, press down on the soften butter until its smooth. Add garlic salt and herbs. Mix until well blended. Set it aside.",
    "Remove the dough from oven and gently punch the dough down.",
    "SHAPING THE DOUGH",
    "Divide the dough into several equal sized balls and shape them. The above measurements make 18 balls. I have not measured on a scale just eyeballed it.",
    "Preheat the oven @350 degree F. Meanwhile, flatten the dough.",
    "Apply a single layer of garlic spread to the flatten dough.",
    "Start rolling the dough....",
    "Until it looks like a log.",
    "Fold the dough in such a way that the two ends meet each other.",
    "It will form a big 'O'. Pinch the ends together.",
    "Flip the folded roll over and it will look exactly like the one as shown in the pic below.",
    "Grease a baking pan and arrange the dough on top of each other. Make sure to butter the bottom layer before placing the other layer on top.",
    "Butter the top layer as well and generously top with some dried parsley or cilantro.",
    "Bake for 15-20 minutes or until the tops are golden brown. Brush the hot rolls with melted butter and serve.",
    "Served with a dip or with a hot bowl of soup and see these rolls disappear!"
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "FOR THE DOUGH",
    "4 cups All purpose flour",
    "1.5 teaspoon Salt",
    "1 teaspoon Baking powder",
    "3 tablespoon Vegan Butter",
    "2 tablespoon Sugar",
    "1 tablespoon Active dry yeast",
    "1.5 cups Warm Water",
    "FOR GARLIC HERB BUTTER",
    "1 sticks Vegan Butter (1/2 cup)",
    "1.5 teaspoon Garlic Salt",
    "1 teaspoon Dried Parsley",
    "1 teaspoon Dried Basil leaves",
    "1 teaspoon Dried Oregano"
  ],
  "__v": 1
}