{
  "hash": "97531ea5f7be138270902f9ff9f14c369c99c804",
  "title": "Kentucky Derby recipes for bourbon roasted pork, cherry bourbon BBQ sauce, spicy slaw",
  "image": "",
  "href": "http://sports.nbcsports.com/2018/05/05/top-chef-tom-colicchio-kentucky-derby-recipes-bourbon-roasted-pork-cherry-bourbon-bbq-sauce-spicy-slaw/",
  "extension": "Chrome",
  "firstAdded": "2018-05-05T20:48:47.749000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To assemble:",
    "Warm flour tortillas, place shredded pork in center of tortilla, top with a small amount of warm BBQ sauce and slaw. Finish with picked cilantro, mint and thai basil."
  ],
  "ingredients": [
    "0",
    "Slaw",
    "Nappa Cabbage, shredded x ½ C",
    "Peanuts, roasted/chopped x 3 T",
    "Ginger, grated x 1 teaspoon",
    "Garlic, grated x 1 teaspoon",
    "Peanut oil x 2 T",
    "Rice vinegar x 2 T",
    "Pickled red onions x 1 T",
    "Lime juice to taste",
    "Salt/pepper",
    "Method: Combine all ingredients and season with salt, adjust seasoning with lime juice/rice vinegar. Should have a nice tangy balance.",
    "Pork",
    "Pork shoulder x 1 each, approx. 7-9#",
    "Bourbon x ½ C",
    "Brown sugar x 1 C",
    "Salt x ¼ C",
    "Pepper x 2 T",
    "Method: Preheat oven 325 degrees, rinse pork with bourbon and rub the sugar, salt and pepper into the flesh all around. Place on a rack lined sheet tray and roast in oven until golden and tender, depending on size of pork it could take between 3-6 hours. A meat thermometer should read 180 degrees F. Remove from oven and allow to rest 30 minutes, then shred with a couple of forks.",
    "BBQ Sauce",
    "Cherries, dried x 12 oz",
    "Cherry juice x 1.5 C",
    "Onion, yellow, small, minced x 1 each",
    "Garlic, chopped x 2 T",
    "Bourbon x ½ C",
    "Jalapeno, minced x 1 each",
    "Ginger, peeled, minced x 2 T",
    "Molasses x 1 T",
    "Brown sugar x 3 T",
    "Apple cider vinegar x ¼ C",
    "Grape seed Oil x 2 T",
    "Salt to taste",
    "Method: In sauté pan, heat oil over medium heat, add onions, garlic, ginger and jalapenos and season with salt. Sweat until tender and aromatic. Add bourbon and burn off alcohol by slightly reducing. Add all other ingredients and bring to a boil. Turn down to a simmer and cook for 45 minutes, until cherries are tender. Using an immersion blender, puree until smooth then adjust seasoning with salt.",
    "Pickled Red Onions",
    "Onions, red, thinly sliced x 2 each",
    "Apple cider vinegar x 1 C",
    "Habaneros, cut in half x 1 ea",
    "Sugar, granulated x ½ C",
    "Pickling spice x 3 T",
    "Salt x 2 T",
    "Method: Toss onions with salt and set aside for 30 minutes. Meanwhile, combine all other ingredients except habanero and bring to a boil. Remove from heat. After 30 minutes, squeeze the onions in small batches to release any liquid, then place them in a non reactive container, add habanero and strain hot pickling liquid over the top of the onions. Allow to cool at room temperature before putting in fridge."
  ],
  "__v": 1
}