{
  "hash": "08514929515b72c97f12c30d047c790b09c01027",
  "title": "BAGELS",
  "image": "http://uitpaulineskeuken.nl/wp-content/uploads/2017/02/Bagels-3-3.jpg",
  "href": "http://uitpaulineskeuken.nl/2017/02/zelf-bagels-maken.html",
  "extension": "Chrome",
  "firstAdded": "2017-02-21T21:51:35.701000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Zo maak je het",
    "Doe het lauwe (handwarme) water met de gist en de honing in een kom. Meng kort en laat 10 minuten staan. Als het goed is begint het mengsel te bubbelen.",
    "Doe de bloem met het zout en het gistmengsel in de kom van je keukenmachine en kneed er in 10 minuten een soepel deeg van. Met de hand kneden kan ook. Het deeg is klaar als het elastisch aanvoelt en je het als een kauwgombal uit elkaar kunt trekken.",
    "Laat het deeg in een ingevette kom een uurtje rijzen op kamertemperatuur.",
    "Druk de lucht uit het deeg met je vingertoppen en verdeel het deeg in 10 ballen. Vorm van ieder stukje deeg een mooi plat rondje. Maak een gat in het midden, dit kan met je vinger of met de achterkant van je pollepel. Draai ieder stukje deeg nu een paar keer rond op je vinger, zodat het gat groter wordt.",
    "Leg de gevormde bagels op een bakplaat bekleed met bakpapier en laat ze nogmaals 50 minuten tot een uur rijzen.",
    "Verwarm de oven voor op 220 graden (hete lucht)",
    "Verhit een pan met water en breng dit aan de kook. Kook de bagels omstebeurt in ongeveer 1,5 minuut per kant gaar. Het tellen begint pas als de bagel boven komt drijven. Draai ze tussentijds om.",
    "Leg de bagels op een bakplaat bekleed met bakpapier. Strooi nu het sesamzaad en het maanzaad eroverheen.",
    "Bak de bagels in ongeveer 15 tot 20 minuten goudbruin en gaar in een voorverwarmde oven op 220 graden."
  ],
  "ingredients": [
    "0",
    "Ingrediënten voor 10 st.",
    "500 gr speltbloem",
    "300 gr lauw water",
    "5 gr gedroogde gist of 15 gr verse gist",
    "1 el honing",
    "10 gr zout",
    "3 el sesamzaad",
    "3 el maanzaad"
  ],
  "__v": 1
}