{
  "hash": "47eee634596a2c995fd2926779aeb2d4353f7744",
  "title": "Chocolate Coconut Almond Bars.",
  "image": "http://www.halfbakedharvest.com/wp-content/uploads/2016/01/Chocolate-Coconut-Almond-Bars-1.jpg",
  "href": "http://www.halfbakedharvest.com/chocolate-coconut-almond-bars/",
  "extension": "Chrome",
  "firstAdded": "2016-02-16T00:23:05.895000",
  "users": [
    null
  ],
  "keywords": [
    "base",
    "layer",
    "raw",
    "almonds",
    "flaked",
    "coconut",
    "plump",
    "medjool",
    "dates",
    "vanilla",
    "oil",
    "canned",
    "milk",
    "honey",
    "salt",
    "dark",
    "chocolate",
    "semi",
    "rounded",
    "almond",
    "butter",
    "cacao",
    "nibs",
    "hemp",
    "seeds"
  ],
  "directions": [
    "0",
    "Instructions",
    "Line an 8x8 inch square baking pan with parchment paper.In the bowl of a food processor, combine the almonds, 1 cup coconut, dates and vanilla. Pulse until finely chopped, but not pureed. Add the coconut oil and pulse until combined, being careful not to over mix the the mixture. You want it finely chopped and a little chunky.Press the base mixture into the prepared pan. Place the pan in the freezer.Back in the bowl of the food processor (no need to clean it!) combine 2 cups coconut, coconut milk, honey and salt. Pulse until you have a finely ground mixture. Remove the base layer from the freezer and add the coconut layer in an even layer. Return the pan to the freezer.Melt the chocolate over a double broiler or in the microwave, stirring every 30 seconds until melted and smooth.Remove the bars from the freezer and spread the chocolate over top. Now take the almond butter and swirl it into the chocolate. Top with cacao nibs and hemp seeds if desired. Cover the pan and place in the fridge for 30 minutes to 1 hour to allow the chocolate to set.Place the sharp knife under hot water and then cut the bars into about 16 squares. The chocolate layer may pop off of the coconut layer as you cut the bars. Don't worry, just push it back into place. Keep the bars stored in the fridge in a sealed container."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Base Layer",
    "1/2 cup raw almonds",
    "1 cup unsweetened flaked coconut",
    "12 plump medjool dates, pitted",
    "2 teaspoons vanilla",
    "1/4 cup coconut oil",
    "Coconut Layer",
    "2 cups unsweetened flaked coconut",
    "1/2 cup canned coconut milk",
    "2 tablespoons honey",
    "pinch of salt",
    "12 ounces dark chocolate (or semi sweet), chopped",
    "2 rounded tablespoons almond butter",
    "cacao nibs + hemp seeds, for topping (optional)"
  ],
  "__v": 1
}