{
  "hash": "677922248a2e2226a46b3cb0329a742f74655d38",
  "title": "Udon Noodle Soup with Chicken & Mushrooms",
  "image": "http://thewoksoflife.com/wp-content/uploads/2016/05/udon-noodle-soup-11.jpg",
  "href": "http://thewoksoflife.com/2016/05/udon-noodle-soup-chicken-mushrooms/",
  "extension": "Chrome",
  "firstAdded": "2016-08-02T20:58:42.562000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Add the chicken broth, dashi stock, ginger, and 1 tablespoon soy sauce to a large saucepan or pot and bring to a simmer. Cover and continue simmering while you prepare the rest of the dish. Heat the oil in a wok or skillet over medium heat, and add the garlic. Allow the smashed garlic cloves to crisp up in the oil for about 2 minutes.",
    "Season the chicken with salt and pepper, and add 1 teaspoon oil and 1 teaspoon cornstarch. Mix until combined. Add the chicken to the pan in one layer and turn up the heat to medium high. Don’t move the chicken. Allow to sear until it’s browned on one side, and then stir. During this process, move the garlic on top of the chicken so that it doesn’t burn.",
    "Remove the chicken and garlic from the pan and set aside (this prevents the chicken from drying out while the mushrooms are cooking). Add the sliced mushrooms and cook until they're tender. Stir in the mirin and 1 teaspoon soy sauce and cook for another minute. Stir the chicken and garlic back in.",
    "Cook the udon according to package directions and distribute between two soup bowls. Taste the stock and check for seasoning. Too salty? Add water. Not seasoned enough? Add salt. Pour the hot stock over the noodles, and top with the chicken and mushroom mixture. Garnish with scallions and serve."
  ],
  "ingredients": [
    "0",
    "2 cups low sodium chicken broth",
    "2 cups dashi stock (can also substitute more chicken stock)",
    "5 slices ginger",
    "1 tablespoon soy sauce, plus 1 teaspoon (divided)",
    "2 tablespoons oil, plus 1 teaspoon (divided)",
    "3 cloves garlic, smashed",
    "2 boneless skinless chicken thighs, cut into bite-sized pieces",
    "salt and pepper",
    "1 teaspoon cornstarch",
    "4 oz. fresh shiitake mushrooms, cleaned and thinly sliced",
    "1 tablespoon mirin",
    "8 oz. fresh udon noodles",
    "1 scallion, julienned"
  ],
  "__v": 1
}