{
  "__v": 1,
  "directions": [
    "0",
    "Cooking Method",
    "To make the garlic sauce, mix all the ingredients in a small bowl and set aside to allow the flavours to mingle.",
    "Then trim the lamb steaks, removing any visible fat, and cut them into 3cm chunks. Put the lamb mince and steaks in a food processor with the onion, coriander, cumin, salt and lots of freshly ground black pepper. Blitz until as smooth as possible.",
    "Divide the mince mixture into 4 balls. Cut a 60cm sheet of cling film and dust with ¼ teaspoon of sifted flour. Place a lamb portion on half of the film and fold the rest of the cling film over to cover it completely. Use a rolling pin to roll the kebab mixture thinly – about 5mm is just about right. Leave it inside the cling film. Do the same with the remaining portions of lamb.",
    "Put the pitta breads on a baking tray and place them under a preheated medium grill – not too close – for 1–2 minutes on each side until hot. Keep warm. Mist a large non-stick frying pan with oil and place over a medium-high heat.",
    "Lift the cling film off the top of a portion of lamb. Peel off the backing film and, holding the lamb on a spatula or over your hand, very gently and carefully place it in the hot frying pan. Do the same with a second piece of flattened lamb and fry both for about 1 minute on each side until lightly browned and cooked through. Flatten the lamb into the hot pan by pressing it with a spatula as the meat cooks. Put the lamb on a warmed plate and cook the other 2 portions.",
    "Put the warmed pittas on a board and cut them open along one side, then fill with salad and the hot lamb. Spoon over the garlic sauce and chilli sauce too, if you like. Add a couple of pickled chillies for extra authenticity and serve!"
  ],
  "hash": "184e04864a4f11198e1668d45563398eaf8b9551",
  "href": "http://www.hairybikers.com/recipes/dieters-doner-kebabs/1767#52e968cdbf94c9b106000003",
  "image": "http://www.hairybikers.com/storage/media/hairybikers.com/2013/12-30/c/1388411404_3a7bcaec8fcc100e91433b1aae4ad738.png",
  "ingredients": [
    "0",
    "Ingredients",
    "200g lean lamb leg steaks (probably 2 steaks)",
    "200g lean minced lamb",
    "½ medium onion, roughly chopped",
    "1 tsp ground coriander",
    "1 tsp ground cumin",
    "1 tsp flaked sea salt",
    "1 tsp plain flour",
    "4 white or wholemeal pitta breads (each about 60g)",
    "Oil, for spraying",
    "Hot chilli sauce (optional)",
    "Freshly ground black pepper",
    "Garlic sauce",
    "4 tbsp fat-free yoghurt",
    "1 large garlic clove, crushed",
    "pinch of flaked sea salt",
    "2 large tomatoes, sliced",
    "100g cucumber, sliced",
    "Shredded lettuce,",
    "Pickled chillies, finely shredded (optional)",
    "White cabbage and red onion rings (optional)"
  ],
  "keywords": [
    "lean",
    "lamb",
    "leg",
    "probably",
    "steaks",
    "medium",
    "onion",
    "roughly",
    "coriander",
    "cumin",
    "flaked",
    "salt",
    "plain",
    "flour",
    "white",
    "wholemeal",
    "pitta",
    "breads",
    "oil",
    "spraying",
    "hot",
    "chilli",
    "black",
    "pepper",
    "garlic",
    "fatfree",
    "yoghurt",
    "clove",
    "tomatoes",
    "cucumber",
    "lettuce",
    "pickled",
    "chillies",
    "cabbage",
    "red",
    "rings"
  ],
  "title": "DIETER'S DONER KEBABS!",
  "users": [
    null
  ]
}