{
  "hash": "8b92c56935e59152d3ca61c61364655e679d4704",
  "title": "Lemon, Basil, and Mushroom Soup",
  "image": "//images.food52.com/RAcHIEeibvQytJiIIjIWV66iFgY=/753x502/377442f4-fa92-43ab-96a6-ace60c5e8f03--lemon_basil_mushroom_soupA.jpg",
  "href": "http://food52.com/recipes/35173-lemon-basil-and-mushroom-soup",
  "extension": "Chrome",
  "firstAdded": "2016-02-20T14:06:21.538000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "stock",
    "divided",
    "wild",
    "rice",
    "basmati",
    "unsalted",
    "butter",
    "yellow",
    "onion",
    "dice",
    "salt",
    "stalks",
    "celery",
    "carrots",
    "button",
    "mushrooms",
    "cleaned",
    "garlic",
    "pressed",
    "cream",
    "cheese",
    "room",
    "basil",
    "thyme",
    "lemon",
    "juice",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "In a medium saucepan, combine 3 cups of the chicken stock with the wild rice and basmati rice. Cover and bring to a boil, and then let simmer for 30 minutes (the rice may be a bit undercooked, but you will be adding it to the soup later). Remove pan from the heat and set aside.",
    "In a large stock pot, melt the butter and add the onions and 1/4 teaspoon salt. Sauté the onions for 2 to 3 minutes. Add the celery and carrots and continue to cook until the vegetables begin to soften, 3 to 4 minutes more. Add the mushrooms and continue cooking for another 2 to 3 minutes. Add the garlic and cook for 30 more seconds. Add the cooked rice and any leftover liquid to the stockpot. Add the remaining 5 cups of chicken stock and bring to a boil. Reduce the heat and let simmer while you prepare the cream cheese.",
    "Place the cream cheese in a separate bowl along with the basil and thyme. Using an immersion blender, blend the cream cheese and herbs together. Slowly add two cups of the simmered stock to the bowl (try to get only the stock, but a few vegetables and a bit of rice is fine) and blend until everything is combined and very smooth. (You can also do this using an blender or food processor if you do not have an immersion blender). Add the cream cheese mixture back to the soup. Add the chicken if using, and heat the soup through.",
    "Take the soup off the heat and add the lemon juice and black pepper. Taste soup and add more salt if needed."
  ],
  "ingredients": [
    "0",
    "8 cups chicken stock, divided",
    "1/2 cup wild rice",
    "1/4 cup basmati rice",
    "2 tablespoons unsalted butter",
    "1 cup yellow onion, cut in a small dice",
    "1/4 teaspoon salt, plus more to taste",
    "2 stalks celery, cut in a small dice",
    "2 carrots, sliced",
    "1 pound button mushrooms, cleaned and diced",
    "4 cloves garlic, minced or pressed",
    "12 ounces cream cheese, room temperature",
    "1/2 cup minced fresh basil (or 1 tablespoon dried)",
    "2 teaspoons fresh thyme",
    "2 cups cooked, diced or shredded chicken (optional)",
    "1/4 cup fresh lemon juice",
    "1/2 teaspoon black pepper"
  ],
  "__v": 1
}