{
  "hash": "16cdc15b4ff1d6d8f8a06f848cb0d2cc70e83e58",
  "title": "Lemon-Garlic Chicken Thighs",
  "image": "http://www.nutritiouseats.com/wp-content/uploads/2013/04/Lemon-Garlic-Chicken-Thighs-1-590x825.jpg",
  "href": "http://www.nutritiouseats.com/lemon-garlic-chicken-thighs/",
  "firstAdded": "2015-02-20T01:52:59.863000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "thighs",
    "boneless",
    "bonesskin",
    "salt",
    "seasoning",
    "black",
    "pepper",
    "allpurpose",
    "flour",
    "extra",
    "virgin",
    "olive",
    "oil",
    "onions",
    "garlic",
    "smashed",
    "red",
    "bay",
    "leaf",
    "squeezed",
    "lemon",
    "juice",
    "reserve",
    "halves",
    "juicing",
    "throw",
    "pot",
    "low",
    "sodium",
    "organic",
    "broth",
    "angel",
    "hair",
    "pasta",
    "parsley",
    "basil"
  ],
  "directions": [
    "0",
    "Trim fat off chicken thighs. Season with salt and pepper, set aside.",
    "Heat a skillet over medium-high heat, add 2 Tablespoons olive oil. Place flour in a shallow dish; lightly dredge the chicken in the flour, add half of the chicken to pan and cook for 2-3 minutes per side or until a light brown crust forms (repeat with remaining thighs).",
    "Transfer chicken to the slow cooker. Add onions, garlic cloves, crushed red pepper, bay leaf, lemon juice, chicken broth, ½ teaspoon salt and 4 of the lemon halves (that were juiced) to the slow cooker.",
    "Cover and cook for 3½ to 4 hours on high. Serve over angel hair pasta with lots of the broth and juices from the slow cooker. Top with fresh chopped parsley or basil if desired.",
    "1",
    "Brown chicken for 3 minutes per side on medium-high heat, remove chicken from pan. Add onions, cook for about 3 minutes, scraping up brown bits on the pan. Add garlic, crushed red pepper, salt, bay leaf and cook 1 minute. Add lemon juice, broth and browned chicken thighs to pan. Bring mixture to a simmer, cover tightly and place in the oven. Bake at 350 degrees for 20 minutes, remove lid, bake an additional 15 minutes or until cooked through and tender."
  ],
  "ingredients": [
    "0",
    "8 chicken thighs, ~2 pound boneless or 3½ pounds with bones/skin",
    "½ teaspoon salt, plus some for seasoning the chicken",
    "black pepper",
    "½ cup all-purpose flour",
    "2 Tablespoons extra virgin olive oil",
    "3 cups thinly sliced onions",
    "20 cloves of garlic, peeled and smashed",
    "½ teaspoon crushed red pepper",
    "1 bay leaf",
    "½ cup freshly squeezed lemon juice, reserve 4 of the halves after juicing to throw into the pot",
    "1¼ cup low sodium organic chicken broth",
    "1 pound angel hair pasta",
    "chopped fresh parsley or basil for garnish"
  ],
  "__v": 1
}