{
  "hash": "a325c83e1940f63fa2f51389c137a11575aec4ae",
  "title": "Instant Pot® Dark Chocolate Brownies",
  "image": "https://images.media-allrecipes.com/userphotos/560x315/5202439.jpg",
  "href": "https://www.allrecipes.com/recipe/263160/instant-pot-dark-chocolate-brownies/?internalSource=hub%20recipe&referringId=22882&referringContentType=Recipe%20Hub",
  "extension": "Chrome",
  "firstAdded": "2019-03-09T20:17:12.213000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat chocolate and butter in a glass bowl placed inside a saucepan of simmering water. Stir frequently, scraping down the sides with a rubber spatula to avoid scorching, until chocolate is melted and glossy, about 5 minutes.",
    "Let melted chocolate cool to room temperature, about 10 minutes. Add sugar; whisk thoroughly. Mix in yogurt and vanilla extract until combined. Beat in eggs 1 at a time using the whisk. Sift in flour, cocoa powder, baking soda, and salt; gently fold into the chocolate mixture until batter is thick and smooth. Do not overmix.",
    "Butter a 6-inch round cake pan with 2-inch sides. Pour batter into the pan and seal top with a sheet of aluminum foil.",
    "Set a trivet inside the pot of an electric pressure cooker (such as Instant Pot(R)). Add 1 cup water. Make sure the steam release handle is in Sealing position according to manufacturers' instructions. Arrange long strips of aluminum foil crosswise under the cake pan; hold the ends to lower cake onto the trivet. Keep foil strips folded down to prevent contact with the lid.",
    "Close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 25 minutes. Allow 10 to 15 minutes for pressure to build. Release pressure using the natural-release method according to manufacturer's instructions, about 10 minutes.",
    "Check a toothpick inserted into the brownie comes out clean. Cook at high pressure for 3 minutes more if needed. Release pressure using the quick-release method, about 5 minutes. Let brownie cool before cutting."
  ],
  "ingredients": [
    "0",
    "5 ounces dark chocolate (such as Lindt 78% Cocoa), chopped into small pieces",
    "6 tablespoons unsalted butter",
    "1 cup superfine sugar",
    "2 tablespoons Greek yogurt",
    "1 tablespoon vanilla extract",
    "1",
    "3 eggs",
    "3/4 cup all-purpose flour",
    "1 tablespoon unsweetened cocoa powder",
    "1 teaspoon baking soda",
    "1/2 teaspoon salt"
  ],
  "__v": 1
}