{
  "hash": "a357ccc4b8090e827f43c98becc54957faf207c3",
  "title": "Mediterranean Grilled Vegetable Pie",
  "image": "http://w2.fnstatic.co.uk/sites/default/files/styles/recipe_main_pic/public/pictures/recipeImages/mediterranean-veg-pie.jpg?itok=1nskeeVu",
  "href": "http://www.foodnetwork.co.uk/recipes/mediterranean-grilled-vegetable-pie.html",
  "extension": "Chrome",
  "firstAdded": "2015-07-08T09:37:00.482000",
  "users": [
    null
  ],
  "keywords": [
    "red",
    "peppers",
    "yellow",
    "olive",
    "oil",
    "onion",
    "courgettes",
    "aubergines",
    "salt",
    "pepper",
    "bunch",
    "thyme",
    "plain",
    "flour",
    "butter",
    "water",
    "egg",
    "softened",
    "sachet",
    "vegetarian",
    "gelatine",
    "available",
    "supermarkets",
    "litres",
    "stock"
  ],
  "directions": [
    "0",
    "Method",
    "How to make Mediterranean Grilled Vegetable Pie",
    "Pre-heat the grill to a high heat.",
    "Grill the peppers for two to three minutes on each side or until the skin has blackened, turning during cooking. When they are all charred all over, place into a bowl, cover with cling film and allow to cool.",
    "When cooled, peel the skin away, cut in half, take the stalk out and de-seed, you can always use jarred roasted peppers if you prefer. Please make sure you use the highest quality soaked in olive oil.",
    "Pre-heat the oven to 180°C. In a frying pan heat the one tablespoon of olive oil and gently fry the onions for 20 minutes until they start to take on some colour and are soft and sweet.",
    "Thinly slice the courgettes and aubergines lengthways. Place the aubergines in a colander, cover with salt and leave for 15 minutes. Pat dry with a piece of kitchen paper.",
    "In a bowl carefully marinade the courgettes and aubergines in the remaining olive oil, add salt and pepper and the chopped thyme.",
    "Heat a griddle pan and grill the courgettes first, followed by the aubergines, softening the vegetables and colouring on both sides. This may take a while but the results will be worth the wait.",
    "Place all the vegetables in separate bowls. This can all be done a day in advance of making the pie. Mix the flour and salt in a bowl and make a well in the center. In a saucepan bring the butter and water to the boil, then stir it into the flour, with a wooden spoon to form a smooth dough. Leave the pastry for five minutes if too hot to handle.",
    "Using a 20cm x 7.5cm deep, round, non-stick loose bottomed cake tin. Take two thirds of the dough and liberally flour the table, roll it into a circle so it is large enough to line the pie ring and overlap the edge. The pastry needs to be around 1/2cm inches thick.",
    "Roll and place the pastry into the pie ring, carefully pressing into the corners and allow it to just hang over the edge. Roll the remaining pastry into a circle for the lid.",
    "Line the vegetable bowls around the pie dish and begin layering the pie first with a layer of courgettes, then season with salt and pepper. Next, with a layer of red peppers, then aubergines, then yellow peppers and finally a layer of onions, seasoning every layer as you build the pie. Repeat this until the pie is filled. When finished press down the filling so it is tightly packed.",
    "Brush the pie edges with egg wash and place the lid on top. Pinch the lid edge and top edges together with your thumb to crimp the pie and create a seal. Trim the edge with a knife so no pastry is hanging over the edge. Place onto a baking tray.",
    "Brush the top of the pie all over with the beaten egg. Make a hole in the middle of the pastry lid and cook for one hour. Remove the ring and brush the side and top again with egg before baking for a further 15 minutes. Remove from the oven and leave to cool. Once the pie is cold, refrigerate for two to three hours.",
    "When completely cold, check around the pastry for any holes and fill them with softened butter so that the jelly doesn't escape.",
    "Make a stock, following the instruction for one sachet of gelatin. Pour the stock into the round hole in the top of the pastry until the pie is filled. Cool in the fridge until the jelly is set.",
    "Key info",
    "Difficulty › Difficult",
    "Prep time › 1 hr",
    "Cook time › 2 hrs",
    "Serves › 8-10",
    "Related",
    "MEDITERRANEANPASTRYPIESVEGETARIANBAKEDLUNCHMAIN COURSEDINNER PARTYGARDEN PARTYDIFFICULTANDY BATESAUBERGINECOURGETTEPEPPERS",
    "Print recipe"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "4 red peppers",
    "4 yellow peppers",
    "4 tbsp olive oil",
    "2 large red onion, thinly sliced",
    "2 large courgettes",
    "2 large aubergines",
    "Salt and pepper",
    "1 bunch of thyme",
    "780g plain flour",
    "Salt",
    "240g butter",
    "285 ml water",
    "1 egg, beaten",
    "Softened butter",
    "1 sachet of gelatine or vegetarian gelatine (available in most supermarkets)",
    "1 litres vegetable stock"
  ],
  "__v": 1
}