{
  "hash": "a3511cea23c96362016d5f51395eae374ceefdf6",
  "title": "California-Style Fish Tacos",
  "image": "http://del.h-cdn.co/assets/cm/15/10/54f8f7c2a52c6_-_california-style-fish-tacos-recipe-wdy0314-de.jpg",
  "href": "http://www.delish.com/cooking/recipe-ideas/recipes/a36030/california-style-fish-tacos-recipe-wdy0314/?zoomable",
  "extension": "Chrome",
  "firstAdded": "2017-01-03T03:35:45.870000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "In a small bowl, stir together 2 tablespoons lime juice with 1/4 teaspoon each salt and pepper. Add the onion and toss to coat. Let sit, tossing occasionally, until the fish is ready.",
    "In a large bowl, whisk together the sour cream, remaining 3 tablespoons lime juice, 1/2 teaspoon salt, and 1/4 teaspoon pepper. Add the cabbage and jalapeño and toss to coat. Let sit, tossing occasionally, until the fish is ready.",
    "In a medium bowl, whisk together the flour, cornstarch, chili powder, baking powder, cayenne, 1 teaspoon salt, and 1/2 teaspoon pepper. Transfer 1/4 cup of the flour mixture to a shallow bowl or plate. Stir the egg and beer into the remaining flour mixture until smooth.",
    "Fill a large cast-iron or deep skillet with 1/2 inch canola oil and heat to 350 degrees F. Place a cooling rack in a rimmed baking sheet.",
    "Working in batches, coat the fish in the dry flour mixture, patting off any excess, then dip in the batter. Let excess drip off and carefully place in the oil. Cook, turning once, until the batter is golden brown and the fish is opaque throughout, 2 to 3 minutes total. Transfer to the prepared baking rack.",
    "Fold the cilantro into the cabbage mixture. Fill the tortillas with the fish and top with the slaw and pickled onions."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "5 tbsp. fresh lime juice",
    "kosher salt",
    "Pepper",
    "1 small red onion",
    "3 tbsp. sour cream",
    "½ small green cabbage",
    "1 jalapeño (seeded for less heat, if desired)",
    "1 c. all-purpose flour",
    "1 tbsp. cornstarch",
    "1 tbsp. chili powder",
    "1 tsp. baking powder",
    "¼ tsp. cayenne pepper",
    "1 large egg",
    "1 c. beer (such as Corona, Tecate or another lighter beer)",
    "canola oil",
    "1 lb. tilapia fillets",
    "½ c. roughly chopped fresh cilantro",
    "8 small flour tortillas"
  ],
  "__v": 1
}