{
  "hash": "87ebebfb6b787cc7bd31a5bba3bb3d75bcbccfdd",
  "title": "Chocolate marble cake",
  "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--363765_11.jpg?itok=Y0IAzwXZ",
  "href": "http://www.bbcgoodfood.com/recipes/5557/chocolate-marble-cake",
  "extension": "Chrome",
  "firstAdded": "2016-11-04T16:03:45.450000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat oven to 180C/gas 160C/gas 4. Grease a 20cm cake tin and line the bottom with a circle of greaseproof paper. If you want to make life easy, simply put all the ingredients (except the cocoa powder) into a food processor and whizz for 1-2 mins until smooth. If you prefer to mix by hand, beat the butter and sugar together, then add the eggs, one at a time, mixing well after each addition. Fold through the flour, milk and vanilla extract until the mixture is smooth.",
    "Divide the mixture between 2 bowls. Stir the cocoa powder into the mixture in one of the bowls. Take 2 spoons and use them to dollop the chocolate and vanilla cake mixes into the tin alternately. When all the mixture has been used up (and if young kids are doing this, you’ll need to ensure the base of the tin is fairly evenly covered), tap the bottom on your work surface to ensure that there aren’t any air bubbles. Take a skewer and swirl it around the mixture in the tin a few times to create a marbled effect.",
    "Bake the cake for 45-55 mins until a skewer inserted into the centre comes out clean. Turn out onto a cooling rack and leave to cool. Will keep for 3 days in an airtight container or freeze for up to 3 months."
  ],
  "ingredients": [
    "0",
    "butter Butter butt-errButter is made when lactic-acid producing bacteria are added to cream and churned to make an…",
    "egg Egg eggThe ultimate convenience food, eggs are powerhouses of nutrition, packed with protein and a…",
    "milk Milk mill-kOne of the most widely used ingredients, milk is often referred to as a complete food. While cow…"
  ],
  "__v": 1
}