{
  "hash": "a93fd93d0b233e1f1fe39ef44ddac626925edf12",
  "title": "Sponge Cake with Chocolate Frosting",
  "image": "http://clv.h-cdn.co/assets/cm/15/10/640x640/square_54f4a5e679b88_-_clx0505cook04dg_2nd.jpg",
  "href": "http://www.countryliving.com/food-drinks/recipes/a1242/sponge-cake-chocolate-frosting-3344/?zoomable",
  "extension": "Chrome",
  "firstAdded": "2016-07-14T19:16:06.729000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "Make the cake: Heat oven to 350 degrees F. Butter the bottom of a 9-inch by 13-inch baking pan. Fit parchment paper into the bottom of the pan, butter the parchment and pan sides and dust with flour. Set aside. Sift the flour and baking powder together and set aside.",
    "Heat 1 cup of milk just to a boil. Stir in 2 tablespoons butter and keep hot. Beat eggs in a large bowl using a mixer set on high speed until they become foamy. Add the granulated sugar, salt, and 2 teaspoons vanilla and beat until batter doubles in volume and becomes very thick and pale -- about 5 minutes.",
    "Reduce mixer speed to low and add the hot milk and butter. Add the flour mixture, in 1/4 cupfuls, scraping sides occasionally. Pour the batter into the prepared pan and bake until a wooden skewer inserted into the middle of the cake comes out clean -- 25 to 30 minutes. Let cool for 15 minutes on a wire rack. Release the cake and cool completely.",
    "Make the frosting: Melt the remaining 1 cup butter and chocolate over a double boiler. Transfer to a large bowl, add the confectioners' sugar and beat using a mixer set on medium speed. Add the remaining 3 teaspoons vanilla and 1/4 cup plus 3 tablespoons milk and continue to beat until fluffy.",
    "Assemble the cake: Cut the cake into two 9-inch by 6 1/2-inch halves. Split each half into 3 layers using a long serrated knife. Place one layer on a cake plate. Spread 1/2 cup frosting over the layer. Repeat with remaining layers. Frost cake top and sides and decorate with sprinkles."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1¾ c. cake flour",
    "2 tsp. baking powder",
    "1¼ c. milk",
    "1 c. unsalted butter",
    "4 large eggs",
    "2 c. granulated sugar",
    "½ tsp. salt",
    "5 tsp. vanilla extract",
    "6 oz. unsweetened chocolate",
    "6¾ c. confectioners' sugar",
    "1 tbsp. decorative sprinkles"
  ],
  "__v": 1
}