{
  "hash": "b237d43375a4211fd1dc1e93f3000eed0c20737e",
  "title": "Coconut Banana Cream Pie",
  "image": "http://www.spendwithpennies.com/wp-content/uploads/2016/06/Coconut-Banana-Pie-NEW-02pmTiny.jpg",
  "href": "http://www.spendwithpennies.com/coconut-banana-cream-pie/",
  "extension": "Chrome",
  "firstAdded": "2016-07-02T01:40:36.877000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Spray a 9 inch pie plate with nonstick cooking spray & set aside.",
    "In a large skillet, melt butter. Add coconut and continue to cook over medium heat until coconut just turns golden brown. Press the coconut into prepared pie plate. Chill 30 minutes.",
    "1",
    "In a small bowl, whisk together the egg yolks, ¼ cup granulated sugar, cornstarch, salt and flour. Slowly whisk in 1 cup of half and half.",
    "In a medium saucepan, combine remaining half & half and ½ cup sugar and bring just to a boil medium heat. Slowly stir in the egg mixture and continue to cook, stirring constantly until thick & bubbly.",
    "Remove from heat and add food coloring (if using), 2 teaspoons of vanilla and 1½ cups of coconut, stirring until evenly combined. Pour into a bowl and cover the surface with plastic wrap (Plastic should be directly on the surface of the warm custard). Refrigerate for 4-6 hours.",
    "2",
    "Whip the heavy cream in a chilled bowl until soft peaks form. Add the powdered sugar and vanilla and continue to whip until peaks are just stiff.",
    "3",
    "Layer sliced bananas in cooled crust. Pour chilled filling over bananas. Spread whipped cream over the top and shape into a decorative mound. Sprinkle The top evenly with ½ cup toasted coconut and serve immediately"
  ],
  "ingredients": [
    "0",
    "½ Cup Butter",
    "3 Cups Sweetened Flaked Coconut",
    "1",
    "4 Egg Yolks",
    "¾ Cup Granulated Sugar-Divided",
    "3 Tablespoons Cornstarch",
    "¼ Teaspoon Salt",
    "¼ Cup All-Purpose Flour",
    "3 Cups Half and Half-Divided",
    "Yellow Food Coloring-Optional",
    "1½ Cup Sweetened Flake Coconut",
    "2 Bananas, Firm But Ripe, Peeled and Cut Into ½ Thick Slices",
    "2",
    "2 Cups Heavy Cream",
    "3 Tablespoons Powdered Sugar",
    "1 Teaspoon Vanilla Extract",
    "½ Cup Sweetened Flake Coconut, Toasted and Cooled"
  ],
  "__v": 1
}