{
  "__v": 1,
  "directions": [
    "0",
    "Preparate il ripieno.",
    "In una larga casseruola dal fondo spesso, mettete 3 cucchiai di olio extravergine e la carota, cipolla e sedano tritati e fare passire dolcemente, aggiungendo acqua se necessario.",
    "Fate cuocere 5/7 minuti fino a che non saranno morbidi.",
    "Aggiungete tutta la carne macinata e fate rosolare a lungo, fino a che non avrà rilasciato i liquidi e non sarà cotta (ci vorrà una decina di minuti).",
    "Quando il liquido sarà completamente evaporato, alzate la fiamma e bagnate la carne con il vino facendo sfumare.",
    "Aggiungete a questo punto il sale, il pepe e il misto spezie Saporita, che spero riusciate a trovare in giro. A me arriva direttamente dalla suocera, che me l'ha fatta scoprire e che per i ripieni di carne è favolosa.",
    "Mescolate bene e togliete dal fuoco.",
    "Versate la carne in una larga ciotola.",
    "Aggiungete il parmigiano e la crescenza e mescolate fino a che il tutto non sarà amalgamato con cura.",
    "Lasciate raffreddare.",
    "Preparate la pasta usando se preferite delle sfoglie da lasagna secche oppure facendo la pasta a mano come ho spiegato qui, e ricavando dei rettangoli di 8x10 cm c.ca.",
    "Fate asciugare la pasta quindi scottatela in acqua bollente salata per 2/3 minuti e lasciate asciugare su un canovaccio pulito.",
    "Preparate la salsa di pomodoro molto semplicemente cuocendola in poco olio profumato d'aglio e qualche foglia di basilico.",
    "Cominciate a preparare i cannelloni mettendo il ripieno al centro del rettangolo di pasta ed arrotolandolo con cura su se stesso.",
    "Posizionate i cannelloni ben stretti uno vicino all'altro in una pirofila sporcata di salsa di pomodoro.",
    "Coprite i cannelloni con il resto della salsa.",
    "Spolverate con abbondante parmigiano e cuocete in forno a 180° per 30/40 mintui.",
    "Servite ben caldi.",
    "NOTA BENE: Questi sono cannelloni meridionali alla maniera di mia suocera. Per principio non amo e uso pochissimo la bechamelle e non la metto mai in questo genere di piatti, così come nelle lasagne. Uso solo carne ed in questo caso la presenza della crescenza nell'impasto, che lo rende cremoso e pieno. Anche mia nonna paterna, originaria di Roma, li faceva così."
  ],
  "firstAdded": "2014-10-08T14:20:38.310000",
  "hash": "9af809631f0b50e8f856124e5df29d88686bcbb1",
  "href": "http://www.andantecongusto.it/2014/10/cannelloni-alle-tre-carni-quando-la.html",
  "image": "http://4.bp.blogspot.com/-uwkVFuKXHIQ/VC0A8NOEcrI/AAAAAAAAM30/WJRChxF58sc/s1600/PRES.jpg",
  "ingredients": [
    "0",
    "Ricetta per 4/6 persone",
    "250 g di macinato magro di manzo",
    "250 g di macinato di maiale o salsiccia cruda",
    "250 g di macinato di pollo",
    "1 carota piccola tritata",
    "1 cipolla piccola tritata",
    "mezza gamba di sedano tritato",
    "mezzo bicchiere di vino rosso",
    "70 g di parmigiano grattugiato + 50 g per spolverare",
    "120 g di crescenza",
    "un cucchiaino di misto spezie Saporita (Semi di coriandolo, cannella, noce moscata, semi carvi, chiodi di garofano e anice stellato)",
    "Sale - pepe",
    "Olio extravergine",
    "1 spicchio d'aglio",
    "500 ml di salsa di pomodoro",
    "300 g di pasta fresca"
  ],
  "keywords": [
    "ricetta",
    "persone",
    "macinato",
    "magro",
    "manzo",
    "maiale",
    "salsiccia",
    "cruda",
    "pollo",
    "carota",
    "piccola",
    "tritata",
    "cipolla",
    "mezza",
    "gamba",
    "sedano",
    "tritato",
    "mezzo",
    "bicchiere",
    "vino",
    "rosso",
    "parmigiano",
    "grattugiato",
    "spolverare",
    "crescenza",
    "cucchiaino",
    "misto",
    "spezie",
    "saporita",
    "coriandolo",
    "cannella",
    "noce",
    "moscata",
    "semi",
    "carvi",
    "chiodi",
    "garofano",
    "anice",
    "stellato",
    "sale",
    "pepe",
    "olio",
    "extravergine",
    "spicchio",
    "daglio",
    "salsa",
    "pomodoro",
    "pasta",
    "fresca"
  ],
  "title": "Cannelloni alle tre carni",
  "users": [
    null
  ]
}