{
  "hash": "67cac450a09b7d0508ebbc6b6a16ebc7eafdccaf",
  "title": "WAFFLED LATKES",
  "image": "http://www.wholefoodsmarket.com/sites/default/files/styles/header_recipe/public/media/5097-1.jpg?itok=fETsHN-d",
  "href": "http://www.wholefoodsmarket.com/recipe/waffled-latkes",
  "extension": "Chrome",
  "firstAdded": "2016-12-13T19:09:14.840000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "With the shredder blade of a food processor, shred potatoes and then onion. Place shredded vegetables in a clean kitchen towel, bring the edges together and twist to extract as much liquid as possible.",
    "In a large bowl, whisk together eggs, matzoh meal, baking powder, salt and pepper. Add vegetables and stir gently to combine.",
    "Preheat the oven to 225°F. Line a baking sheet with parchment paper. Preheat a waffle iron on medium. Lightly brush the interior of the iron with oil. Scoop out the amount of batter recommended by the manufacturers’ directions for your iron (about 1 cup for a small iron and 1 1/2 to 2 cups for a larger one). Pour batter in the middle of the iron and spread out to the edges. Close the lid and cook until latke is very browned on both sides, 7 to 9 minutes. Use a fork to lift latke out and place on a cutting board. Cut into squares or wedges. Transfer to the prepared baking sheet and keep warm in the oven.",
    "Repeat with remaining potato mixture, brushing waffle iron with more oil between batches. You can keep latkes warm in the oven for up to 1 hour.",
    "Nutritional Info:",
    "Per Serving: 230 calories (45 from fat), 5g total fat, 1.5g saturated fat, 135mg cholesterol, 450mg sodium, 40g carbohydrates, (3 g dietary fiber, 2g sugar), 8g protein."
  ],
  "ingredients": [
    "0",
    "2 1/2 pound Russet potatoes, peeled and cut into large wedges",
    "1 yellow onion, cut into large wedges",
    "5 eggs",
    "1/2 cup matzoh meal or gluten-free all-purpose baking mix",
    "2 teaspoons baking powder",
    "3/4 teaspoon fine sea salt",
    "1/4 teaspoon ground black pepper",
    "2 teaspoons canola oil, or as needed"
  ],
  "__v": 1
}