{
  "hash": "2e7f133114761f5657dfef2c4fa6817ace64d117",
  "title": "Cauli-power Fettuccine “Alfredo” (Vegan)",
  "image": "http://cdn.ohsheglows.com/wp-content/uploads/2014/01/caulifloweralfredo-4983.jpg",
  "href": "http://ohsheglows.com/2014/01/20/cauli-power-fettuccine-alfredo-vegan/",
  "extension": "Chrome",
  "firstAdded": "2016-02-15T22:38:34.445000",
  "users": [
    null
  ],
  "keywords": [
    "heaping",
    "florets",
    "smallmedium",
    "cauliflower",
    "extra",
    "virgin",
    "olive",
    "oil",
    "garlic",
    "medlg",
    "unflavoured",
    "almond",
    "nondairy",
    "milk",
    "nutritional",
    "yeast",
    "lemon",
    "juice",
    "onion",
    "salt",
    "pepper",
    "fettuccine",
    "pasta",
    "used",
    "box",
    "eden",
    "organic",
    "spelt",
    "ribbons",
    "parsley"
  ],
  "directions": [
    "0",
    "Directions:",
    "Add cauliflower florets in a large pot and cover with water. Bring to a low boil. Once boiling, cook for another 3-7 minutes until fork tender. Drain.",
    "Meanwhile, add the oil into a skillet and saute the minced garlic over low heat for 4-5 minutes until softened and fragrant, but not browned.",
    "In a high speed blender, add the cooked and drained cauliflower, sauteed garlic, milk, nutritional yeast, lemon juice, onion powder, garlic powder, salt, and pepper. Blend until a super smooth sauce forms. If using a Vitamix use the tamper stick as needed. The key here is to get a really smooth sauce so don't be afraid to let it run for a minute or so. Set aside.",
    "Bring a large pot of water to a boil. Add your desired amount of pasta and boil for the time instructed on the package. Drain pasta.",
    "Add cauliflower sauce into the pot (you can use the same pot!) and add the drained pasta. Heat over low-medium until heated enough to your liking. Salt again to taste (the pasta dilutes the flavour).",
    "Serve with fresh minced parsley and black pepper. Feel free to add in your favourite sauteed or roasted vegetables. I think peas, spinach, or broccoli would work very nicely! I added mushrooms, but I wasn't overly crazy about them in this dish.",
    "Tips:",
    "1) To make this pasta sauce extra decadent-tasting, add a tablespoon or two of vegan butter into the sauce. 2) To make this dish gluten-free, use gluten-free pasta. 3) To make this nut-free, use a nut-free non-dairy milk such as soy milk instead of almond milk. Be sure to use unsweetened and unflavoured milk."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "4 heaping cups cauliflower florets (1 small/medium cauliflower)",
    "1/2 tablespoon extra virgin olive oil",
    "1 tablespoon minced garlic (from 2 med/lg cloves)",
    "1/2 cup unsweetened and unflavoured almond milk (or non-dairy milk of choice)",
    "1/4 cup nutritional yeast",
    "1 tablespoon fresh lemon juice",
    "1/2 teaspoon onion powder",
    "1/4-1/2 teaspoon garlic powder",
    "3/4 teaspoon fine grain sea salt, or to taste",
    "1/4-1/2 teaspoon pepper, to taste",
    "Fettuccine pasta of choice (I used one (8-oz) box of Eden Organic Spelt Ribbons)",
    "Fresh parsley, for garnish"
  ],
  "__v": 1
}