{
  "hash": "3d3c87ca80d40b3886922d2deb4627879f050459",
  "title": "WONTON SOUP",
  "image": "",
  "href": "http://blogchef.net/wonton-soup-recipe/",
  "extension": "Chrome",
  "firstAdded": "2016-08-09T19:15:19.497000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS:",
    "In a large bowl mix together ground pork, soy sauce, oyster sauce, ¼ teaspoon sesame oil, sherry, sugar, 1 finely minced green onion, cornstarch and white pepper. Mix until well combined.",
    "Lay out one wonton wrapper on a cutting board or plate. Cover the remaining wonton wrappers with a damp towel to keep them from drying out.",
    "Moisten all edges of the wonton wrapper with water. Place one heaping teaspoon of the filling into the center of the wonton wrapper. Fold the wonton wrapper in half lengthwise, making sure that the ends meet. Press down firmly on the ends to seal. Use your thumbs to push down on the edges of the filling to center it. Keeping your thumbs in place, fold over the wonton wrapper on more time. Push the corners up and hold in place between your thumb and index ginger. Wet the corners with your finger. Bring the two ends together so that they overlap and press to seal. Repeat with remaining wontons.",
    "Bring a large pot of water to a boil. Add the prepared wontons a few at a time, so that they can move freely in the water. Boil the wontons for 5-8 minutes until they rise to the top of the water and the filling is cooked through (the internal temperature has reached 165 Degrees F.). Remove from the pot with a slotted spoon.",
    "In another large pot bring the chicken stock to a boil. Add the cooked wontons and bring the soup back to a boil. Add the green onions and remove the pot from the heat. Add a few drops of sesame oil and stir. Ladle into soup bowls with about 6 wontons per bowl."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS:",
    "18-24 wonton wrappers",
    "Filling-",
    "1/2lb ground pork",
    "1 tablespoon soy sauce",
    "1 tablespoon oyster sauce",
    "¼ teaspoon sesame oil",
    "1 teaspoon sherry",
    "½ teaspoon sugar",
    "1 green onion (finely minced)",
    "1 teaspoon cornstarch",
    "1 dash ground white pepper",
    "Other-",
    "Water for boiling wontons",
    "4 ½-5 cups chicken stock",
    "green onion (thinly sliced)",
    "a few drops of sesame oil"
  ],
  "__v": 1
}