{
  "hash": "5edc66363e522e697e07b82dfcf00e318b0562ef",
  "title": "Make Your Own Sun-Dried Tomatoes: Oven, Dehydrator, or Sun",
  "image": "http://img.sndimg.com/food/image/upload/w_614,h_461,c_fit/v1/img/recipes/26/39/29/picB3fVOl.jpg",
  "href": "http://www.food.com/recipe/make-your-own-sun-dried-tomatoes-oven-dehydrator-or-sun-263929",
  "extension": "Chrome",
  "firstAdded": "2015-07-29T13:31:43.955000",
  "users": [
    null
  ],
  "keywords": [
    "lbs",
    "firm",
    "roma",
    "tomatoes",
    "salt",
    "basil",
    "oregano",
    "thyme"
  ],
  "directions": [
    "0",
    "TOMATO PREPARATION ALL METHODS.",
    "Cut out the stem and scar and the hard portion of core lying under it.",
    "Cut the tomatoes in half, lengthwise. If the tomato is more than about 2 inches long, cut it in quarters.",
    "Scrape out all of the seeds that you can without removing the pulp.",
    "Mix together thoroughly basil,oregano, thyme, and salt.",
    "Sprinkle a small amount of this mixture on each tomato.",
    "OVEN-DRYING (approximately 12 hours).",
    "Arrange the tomatoes, with the cut surface up, on non-stick cookie sheets (glass or porcelain dishes are OK.) Do not use aluminum foil or aluminum baking sheets as the acid in the tomato will react with the metal.",
    "Bake in 170°F oven for about 3 hours.",
    "Leave the oven door propped open about 3 inches to allow moisture to escape.",
    "After 3 hours, turn the tomatoes over and press flat with your hand or a spatula.",
    "Continue to dry, turning the tomatoes every few hours, and gently pressing flatter and flatter, until tomatoes are dry.",
    "DEHYDRATOR (approximately 8 hours):.",
    "Place the tomatoes, cut side up, directly onto the dehydrator trays.",
    "Set dehydrator temperature to about 140°F.",
    "After 4 or 5 hours, turn the tomatoes over and press flat with your hand or a spatula.",
    "After a few hours, turn the tomatoes again and flatten gently.",
    "Continue drying until done.",
    "SUN-DRYING (approximately 3 days):.",
    "Dry in hot weather, with relatively low humidity.",
    "Place tomatoes, cut side down, in shallow wood-framed trays with nylon netting for the bottom of the trays.",
    "Cover trays with protective netting or cheesecloth.",
    "Place in direct sun, raised from the ground.",
    "on blocks or anything else that allows air to circulate under the trays.",
    "Turn the tomatoes over after about 1 1/2 days, to expose the cut side to the sun.",
    "Place the trays in a sheltered spot after sundown, or if the weather turns bad.",
    "ADDITIONAL NOTES FOR ALL METHODS.",
    "No matter what method you choose, be aware that not all of the tomatoes will dry at the same rate. They do not all have the same amount of moisture, nor do they experience the same temperature and air circulation while they are drying.",
    "They are done when they are very dry, but still pliable. Texture is about that of a dried apricot. If dried too long, they become tough and leathery. If not dried long enough, they will mold and mildew, unless packed in oil. So watch them carefully while they dry. Try to remove them on an individual basis, before they become tough."
  ],
  "ingredients": [
    "0",
    "7 -8 lbs firm ripe roma tomatoes",
    "2 teaspoons salt",
    "1 teaspoon dried basil (optional)",
    "1 teaspoon dried oregano (optional)",
    "1 teaspoon dried thyme (optional)"
  ],
  "__v": 1
}