{
  "hash": "3ce217591027b1a9b8c566d3d5ff32813f3981d1",
  "title": "CHICKEN ENCHILADAS",
  "image": "http://enchor.ca/uploads/3/5/3/8/35389845/published/enchiladas.jpg?1560194344",
  "href": "http://enchor.ca/practice.html",
  "extension": "Chrome",
  "firstAdded": "2019-06-10T19:22:38.952000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Microwave onion, 2 tbsp (30 mL) oil, chili powder, garlic, coriander and cumin in bowl, stirring occasionally, until onions are softened, about 5 minutes; transfer to slow cooker.",
    "Stir in tomato sauce and sugar. Season chicken with pepper and nestle into slow cooker. Cover and cook until chicken is tender, 4-5 hours on low.",
    "Transfer chicken to cutting board, let cool slightly, then shred into bite-size pieces using 2 forks. Combine chicken, 3/4 cup (180 mL) sauce, 1-1/2 cups (375 mL) Monterey Jack, cilantro, jalapenos and lime juice in bowl. Season with salt and pepper to taste.",
    "Adjust oven rack to middle position and heat oven to 450 F (230 C). Spread 3/4 cup (180 mL) sauce over bottom of 13-by-9-inch (33-by-22-cm) baking dish.",
    "Brush both sides of tortillas with remaining 2 tbsp (30 mL) oil. Stack tortillas, wrap in damp dish towel, and place on plate; microwave until warm and pli­able, about 1 minute.",
    "Using 1 warm tortilla at a time, spread 1/3 cup (80 mL) chicken filling across centre of tortilla. Roll tortilla tightly around filling and place seam side down in bak­ing dish; arrange enchiladas in 2 columns across width of dish. 7 Pour remaining sauce over enchiladas to cover completely and sprinkle with remaining 1/2 cup (125 mL) Monterey Jack:",
    "Cover dish with greased alu­minum foil. Bake until enchi­ladas are heated through and cheese melted, 15-20 minutes. Let cool 5 minutes before serving."
  ],
  "ingredients": [
    "0",
    "Slow cooker: 4-7 quarts (4-7 L)",
    "1 onion, chopped fine",
    "1/4 cup (60 mL) vegetable oil",
    "3 tbsp (45 mL) chili powder",
    "3 garlic cloves, minced",
    "2 tsp (10 mL) ground coriander",
    "2 tsp (10 mL) ground cumin",
    "15-oz (443-mL) can tomato sauce",
    "2 tsp (10 mL) sugar",
    "a 11b (454 g) boneless, skinless chicken thighs, trimmed",
    "Salt and pepper",
    "8 oz (226 g) Monterey Jack cheese, shredded (2 cups/ 500 mL)",
    "1/2 cup (125 mL) minced fresh cilantro",
    "1/4 cup (60 mL) jarred jalape­nos, chopped",
    "1 tbsp (15 mL) lime juice",
    "12 (6-inch/15 cm) corn tortillas"
  ],
  "__v": 1
}