{
  "hash": "56dd9ad088e130a468f4d8b969be76a400e37e8c",
  "title": "Mini Twice Baked Potato Skins",
  "image": "https://www.culinaryhill.com/wp-content/uploads/2013/09/Mini-Twice-Baked-Potato-Skins-Culinary-Hill-9-660x990.jpg",
  "href": "https://www.culinaryhill.com/mini-twice-baked-potatoes-with-cheddar-and-scallions/",
  "extension": "Chrome",
  "firstAdded": "2020-01-29T16:14:03.083000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 450 degrees. Prick each potato a few times with a fork. Arrange the potatoes in a single layer on a microwave-safe plate lined with paper towels.",
    "Microwave on HIGH for 4 minutes. Turn the potatoes over and microwave for an additional 4 minutes on HIGH.",
    "Using an oven mitt or kitchen towel to handle the hot potatoes, halve each potato lengthwise and scoop out the middle into a medium bowl, leaving 1/4\" layer of potato on the side of each skin.",
    "Arrange the potato halves cut side down (skin side up) on a baking sheet. Brush with olive oil and sprinkle liberally with salt.",
    "Bake for 10 minutes or until the skins are crispy. Remove from the oven and set oven to broil.",
    "Meanwhile, to the bowl with the scooped potato filling add cheese, sour cream, scallions, butter, 1 teaspoon salt, and 1/2 teaspoon pepper. Mix well.",
    "Divide the filling among the crisped potato skins. Return filled potato skins to the oven and broil until cheese is melted and bubbly. Remove from oven and top with bacon bits. Garnish with parsley if desired and serve warm."
  ],
  "ingredients": [
    "0",
    "16 baby potatoes scrubbed (about 1 1/2 pounds)",
    "2 tablespoons olive oil",
    "Salt and freshly ground black pepper",
    "½ cup shredded cheddar cheese",
    "¼ cup sour cream",
    "2 tablespoons scallions or chives sliced",
    "1 tablespoon butter melted",
    "2 strips bacon fried and crumbled",
    "Fresh parsley for garnish optional"
  ],
  "__v": 1
}