{
  "hash": "5b346b63eff332e12ecb2f68e9848516ed4c8e14",
  "title": "Creamy Chicken Bacon Pasta",
  "image": "http://recipe-folder.com/img/recipe-images/036/395/1295157036.jpg",
  "href": "http://tiphero.com/creamy-chicken-bacon-pasta/",
  "extension": "Chrome",
  "firstAdded": "2018-07-09T23:53:19.160000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "In a large skillet over medium heat, cook the bacon until crisp. Remove, drain on a paper towel and chop. Drain grease from the pan and reserve.",
    "Add 2­ to 3 tablespoons of the bacon grease back to the pan. In batches, so as not to crowd the pan, add the sliced chicken and season with salt, pepper, Italian seasoning, paprika and chili flakes. When the chicken is cooked and no longer pink, remove it from the pan and set aside. Continue cooking in batches until all the chicken is cooked and set aside.",
    "Add the spinach and tomatoes to the skillet and cook until the spinach is wilted. Add the garlic and cook for 30 seconds more.",
    "Add the heavy cream and bring to a simmer. Cook until thickened, then add the Parmesan cheese. Stir until the cheese has melted and the sauce has thickened.",
    "Add the cooked pasta, chicken and bacon back into the skillet. Stir to evenly mix.",
    "Remove from the heat and let stand for 5 minutes to allow the sauce to absorb and thicken.",
    "Serve with additional shredded Parmesan and chili flakes, if desired."
  ],
  "ingredients": [
    "0",
    "Serves 4 to 6",
    "Prep Time: 10 minutes",
    "Total Time: 45 minutes",
    "-",
    "INGREDIENTS",
    "5 slices bacon",
    "1 pound chicken breasts (2 each), sliced",
    "Salt and pepper, to taste",
    "2 ­½ teaspoons Italian seasoning",
    "1 ­½ teaspoons smoked paprika",
    "½ teaspoon red chili flakes",
    "5 ounces baby spinach",
    "4 to ­5 small tomatoes, diced",
    "5 cloves garlic, minced",
    "1 ­½ cups heavy cream",
    "2 cups Parmesan, shredded",
    "12 ounces penne, cooked al dente"
  ],
  "__v": 4,
  "hidden": true
}