{
  "hash": "04aa140ce083539a162c9cdbfb1dfede190408f4",
  "title": "Paleo Shrimp and Grits (Whole30)",
  "image": "http://40aprons.com/wp-content/uploads/2017/02/paleo-shrimp-grits-whole30-2.jpg",
  "href": "http://40aprons.com/paleo-shrimp-grits-recipe-whole30/",
  "extension": "Chrome",
  "firstAdded": "2017-03-10T18:10:21.628000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Fill a medium saucepan with a couple inches of water and bring to a boil. Place frozen cauliflower in a steamer basket and top with 1 large clove garlic, chopped. Cover and steam until tender.",
    "When tender, place steamed cauliflower and garlic in the bowl of a food processor and add ghee or butter. Do not get rid of steaming water! Blitz until almost the desired texture. Add salt and a bit of steaming water, if desired, and process again until the desired consistency.",
    "Meanwhile, make your shrimp. Pat dry and sprinkle very liberally with Cajun seasoning. You want the shrimp to be almost entirely coated, so don't skimp out here! We probably use about 2-3 tablespoons of seasoning. If your Cajun seasoning does not include salt, salt the shrimp now as well.",
    "Heat 2 tablespoons ghee or butter in a large skillet, preferably cast-iron, over medium-high heat. Once the skillet is very hot, add the shrimp and cook about a minute or two, or until the bottom side begins turning pink. Flip the shrimp and cook until the bottom side is turning pink. When the shrimp are no longer translucent down the middle, where they've been deveined, remove from the skillet immediately.",
    "Spoon the cauliflower \"grits\" into serving bowls and top with half the shrimp. Pour the ghee and Cajun seasoning \"sauce\" from the cast-iron skillet over serving bowls. Serve immediately."
  ],
  "ingredients": [
    "0",
    "1 pound large shrimp, peeled and deveined",
    "A few tablespoons Cajun seasoning, Whole30 compliant. I make [url:http://allrecipes.com/recipe/149221/cajun-spice-mix/]this recipe[/url]",
    "Salt, if there is no salt in the Cajun seasoning",
    "2 tablespoons ghee or butter",
    "1",
    "1 12-ounce bag frozen cauliflower",
    "1 large clove garlic, chopped",
    "2 tablespoons ghee or butter",
    "Salt, to taste"
  ],
  "__v": 1
}