{
  "hash": "154e30cdc917967814600c1171b8420a1559b867",
  "title": "Potstickers",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2011/1/26/0/DV1104H_potstickers_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/potstickers-recipe2.html",
  "firstAdded": "2015-01-24T19:38:18.189000",
  "users": [
    null
  ],
  "keywords": [
    "unbleached",
    "allpurpose",
    "flour",
    "dusting",
    "cornstarch",
    "salt",
    "skinless",
    "boneless",
    "chicken",
    "breast",
    "green",
    "onions",
    "cilantro",
    "frozen",
    "corn",
    "kernels",
    "ginger",
    "puree",
    "garlic",
    "soy",
    "lime",
    "juice",
    "water",
    "sugar",
    "white",
    "wine",
    "rice",
    "vinegar",
    "canola",
    "oil",
    "frying",
    "mixed",
    "greens",
    "sesame",
    "seeds",
    "black",
    "professional",
    "scaled",
    "bulk",
    "provided",
    "restaurant",
    "food",
    "network",
    "kitchens",
    "chefs",
    "tested",
    "recipe",
    "proportions",
    "indicated",
    "make",
    "representation",
    "results"
  ],
  "directions": [
    "0",
    "For the wrappers: In the bowl of an electric mixer with the paddle attachment, combine the flour, cornstarch, and salt. Pour in a small amount of water and turn the mixer onto the slowest setting. Continue to add water until a dough forms. The dough should be firm but pliable. Cover the dough with a damp cloth and rest on a cutting board for 30 minutes. Roll the dough out on a well-floured surface to about 1/8-inch thick. Cut into 4-inch circles.",
    "For the filling: Grind the chicken in a food processer. Transfer to a mixing bowl. Process the green onion and cilantro with a little bit of the chicken and add to the mixing bowl. Stir in the corn, ginger, garlic, soy sauce, and lime juice and mix well.",
    "For the sauce: Place the soy sauce, water, sugar, white wine, and vinegar in a saucepan and bring to a light boil. Lower the heat and simmer for 15 minutes. Cool, and then garnish with the green onions.",
    "To prepare: Place 1 level tablespoon potsticker filling in the center of a wrapper and fold in half to form a moon shape. Pinch the seam to seal the wrapper shut. Repeat with remaining filling and wrappers.",
    "Heat 1 tablespoon canola oil in a nonstick pan. Working in batches, add the potstickers and cook until the bottom is golden brown. Add 1/3 cup water, cover, and steam until the filling is cooked through, about 5 minutes. Plate the potstickers on top a bed of mixed greens and garnish with a sprinkle of black and white sesame seeds.",
    "Recipe courtesy Jane, Picabu Bistro, Spokane, WA."
  ],
  "ingredients": [
    "0",
    "2 1/2 cups unbleached all-purpose flour, plus more for dusting",
    "1/2 cup cornstarch",
    "1/2 teaspoon salt",
    "1 pound skinless boneless chicken breast",
    "4 tablespoons chopped green onions",
    "1/3 cup chopped fresh cilantro",
    "1/3 cup frozen corn kernels",
    "2 1/2 tablespoons ginger puree",
    "1 tablespoon chopped garlic",
    "1 tablespoon soy sauce",
    "2 tablespoons lime juice",
    "2 cups soy sauce",
    "1 cup water",
    "2/3 cup sugar",
    "1 cup white wine",
    "1/3 cup rice wine vinegar",
    "1/3 cup thinly sliced green onions",
    "Canola oil, for frying",
    "Mixed greens, for serving",
    "Sesame seeds, black and white, for garnish",
    "This recipe was provided by professional chefs and has been scaled down from a bulk recipe provided by a restaurant. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results."
  ],
  "__v": 1
}