{
  "hash": "655aa2b7221fea5169feec50f930d5a63e3703ec",
  "title": "brew pub pretzels",
  "image": "http://www.recipe.com/images/brew-pub-pretzels-37653-ss.jpg",
  "href": "http://www.recipe.com/brew-pub-pretzels/",
  "extension": "Chrome",
  "firstAdded": "2015-10-06T13:00:51.362000",
  "users": [
    null
  ],
  "keywords": [
    "milk",
    "cooking",
    "oil",
    "allpurpose",
    "flour",
    "bread",
    "sugar",
    "salt",
    "active",
    "dry",
    "yeast",
    "egg",
    "white",
    "water",
    "coarse",
    "poppy",
    "seed",
    "process",
    "cheese",
    "spread",
    "strong",
    "ale",
    "beer",
    "celery",
    "caraway",
    "pepper"
  ],
  "directions": [
    "0",
    "Add milk, oil, all-purpose flour, bread flour, sugar, the 1/2 teaspoon salt, and yeast to a bread machine according to manufacturer's directions for a 1-pound loaf. Select dough cycle. When cycle is complete, remove dough and punch down. Turn out onto a lightly floured surface. Cover and let rest 10 minutes.",
    "2.",
    "Roll dough into a 10x6-inch rectangle; cut into twelve 1/2-inch-wide strips. Gently pull each strip into a rope about 16 inches long. Shape each rope into a pretzel by crossing the rope's ends over each other, forming a circle with 4-inch tails. Twist once at the crossover point. Fold the tails over the circle. Moisten the ends and press to seal.",
    "3.",
    "Place pretzels 1/2-inch apart on greased or parchment-lined baking sheets. Bake in a 475 degree F oven for 4 minutes. Remove from oven. Reduce oven temperature to 350 degree F.",
    "4.",
    "Dissolve the 2 teaspoons salt in 2 quarts boiling water. Reduce heat. Gently slide pretzels, a few at a time, into simmering water. Simmer for 2 minutes, turning once. Remove with a slotted spoon; drain on a wire rack. Place 1/2-inch apart on a well-greased baking sheet.",
    "5.",
    "Combine egg white and water. Brush pretzels with egg white mixture; sprinkle lightly with coarse salt or poppy seed. Bake in the 350 degree F oven for 20 to 25 minutes or until golden brown. Cool slightly on wire racks.",
    "6.",
    "Meanwhile, combine process cheese spread, ale or beer, celery seed or caraway seed, and dash pepper in a saucepan. heat and stir over medium-low heat until cheese is melted. Serve with pretzels. Makes 12 servings.",
    "NUTRITION INFORMATION",
    "Per Serving: cal. (kcal) 172, Fat, total (g) 6, chol. (mg) 13, sat. fat (g) 4, carb. (g) 19, fiber (g) 1, pro. (g) 7, sodium (mg) 781, Percent Daily Values are based on a 2,000 calorie diet"
  ],
  "ingredients": [
    "0",
    "3/4 cup milk",
    "4 teaspoons cooking oil",
    "1 cup all-purpose flour",
    "1 cup bread flour",
    "2 teaspoons sugar",
    "1/2 teaspoon salt",
    "1 teaspoon active dry yeast",
    "2 teaspoons salt",
    "1 beaten egg white",
    "1 tablespoon water",
    "Coarse salt or poppy seed",
    "1 8 ounce package process cheese spread",
    "1/4 cup strong ale or beer",
    "1/4 teaspoon celery seed or caraway seed",
    "dash pepper"
  ],
  "__v": 1
}