{
  "hash": "ec3a2d733d271875379edae520bcd204535c7a3a",
  "title": "Parmesan and Garlic Baked Potato Wedges",
  "image": "http://hostthetoast.com/wp-content/uploads/2016/01/Parmesan-Garlic-Crusted-Baked-Potato-Wedges38.jpg",
  "href": "http://hostthetoast.com/parmesan-garlic-baked-potato-wedges/",
  "extension": "Chrome",
  "firstAdded": "2017-02-09T20:03:42.565000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place the potato wedges in a large pot, and add in the water, vinegar, and 1 tablespoon salt. Press down on the potatoes gently to make sure they're all submerged. Bring the pot to a gentle boil and continue to boil the potatoes for 10 minutes. Drain and pat the potatoes dry with paper towels. Set aside.",
    "Preheat oven to 400 degrees F.",
    "Set the butter on a large baking sheet. Transfer the baking sheet to the oven and allow the butter to melt as the oven preheats. Once the butter has fully melted, carefully remove the baking sheet from the oven.",
    "Sprinkle parmesan cheese evenly on top of the baking sheet. Do the same with the garlic.",
    "Place the potato wedges on top of the garlic and cheese layer, so that one of the skinless sides is touching the cheese. Bake for 45 minutes, or until the potatoes are lightly golden and the cheese has browned.",
    "As the potatoes cook, combine the parsley, lemon zest, salt and pepper in a small bowl and mix. Set aside.",
    "Let the potatoes sit for 5 minutes. This ensures that the cheese will stick to the potatoes instead of ripping off and staying on the pan. It's very important to leave them be so they can set.",
    "Using a metal spatula, break apart the cheese in-between each wedge and lift the baked cheese and wedges from the baking sheet. Plate and then sprinkle with the parsley mixture.",
    "Serve warm with marinara, ranch, or sauce of choice for dipping."
  ],
  "ingredients": [
    "0",
    "4 russet potatoes, cut into wedges",
    "4 cups water",
    "1 tablespoon white or apple cider vinegar",
    "1 tablespoon salt",
    "¼ cup butter, divided into tablespoon-sized pieces",
    "4 ounces (about 1 cup) shredded parmesan cheese",
    "4 large cloves garlic, minced",
    "¼ cup freshly chopped parsley",
    "Zest of 1 lemon",
    "Salt and pepper, to taste",
    "Marinara or dip of choice, to serve"
  ],
  "__v": 1
}