{
  "hash": "54a3d7eec2184c5d7d0cd64924e727df8bb84cf6",
  "title": "NO-FUSS RICE COOKER BANANA BREAD",
  "image": "http://www.wideislandview.com/wp-content/uploads/2009/07/Amy-Frasca-Banana-Bread.jpg",
  "href": "http://www.wideislandview.com/2009/07/recipe-no-fuss-rice-cooker-banana-bread/",
  "extension": "Chrome",
  "firstAdded": "2015-05-05T08:58:15.241000",
  "users": [
    null
  ],
  "keywords": [
    "enriched",
    "white",
    "flour",
    "sugar",
    "baking",
    "soda",
    "salt",
    "mashed",
    "medium",
    "bananas",
    "softened",
    "butter",
    "milk",
    "egg",
    "cooking",
    "oil"
  ],
  "directions": [
    "0",
    "DIRECTIONS:",
    "In a large mixing bowl, combine the flour, sugar, baking powder, baking soda and salt. Whisk until the ingredients are well mixed.",
    "Next, add the bananas, butter, milk, and egg. These should be mixed until the batter has a uniform and thick, creamy consistency. If you own an electric mixer, let it do the work (low setting recommended). If not, the bananas and butter may give you some difficulty when hand-mixing it. To make things easier, make sure you let the butter soften long enough beforehand. Also, if you put the bananas into a plastic freezer bag, you can make sure they’re well-mashed without making a huge mess.",
    "At this point, you can stir in any other ingredient you may want, like chopped nuts or a bit of dried fruit. Feel free to try out your own variations on the recipe!",
    "Before pouring the batter into the rice cooker’s pot, remember the most important step! Coat the inside of the pot lightly with cooking oil. Paper towels help to spread it properly. Otherwise, the banana bread will stick to the inside as it cooks.",
    "Now simply pour the batter evenly into the pot and start the cooker. I use the same settings as when I make rice. On my rice cooker, the bread isn’t done after just one cycle, so I let it run twice, though this could vary based on your rice cooker. With mine, I have to allow the cooker to cool down for a few minutes in between cycles, as it won’t start again right away.",
    "That’s it! After it’s done, pop the bread out onto a serving tray or plate and enjoy!"
  ],
  "ingredients": [
    "0",
    "INGREDIENTS:",
    "1 1/2 cups enriched white flour",
    "3/4 cups white sugar",
    "2 tsp. baking powder",
    "1/2 tsp. baking soda*",
    "1/2 tsp. salt",
    "1 cup mashed ripe bananas (2 to 3 medium to large bananas)",
    "1/3 cups softened butter",
    "1/4 cups milk",
    "1 egg",
    "Cooking oil"
  ],
  "__v": 1
}