{
  "hash": "b0bb724eb786308fb4a8614a916a4f26b0cfc289",
  "title": "Millionaire’s Shortbread",
  "image": "https://static01.nyt.com/images/2018/05/21/dining/21COOKING-MILLIONSHORTBREAD1/21COOKING-MILLIONSHORTBREAD1-articleLarge-v2.jpg",
  "href": "https://cooking.nytimes.com/recipes/1019333-millionaires-shortbread?em_pos=medium&ref=headline&nl_art=2&te=1&nl=cooking&emc=edit_ck_20191130?campaign_id=58&instance_id=14156&segment_id=19200&user_id=4264688f24592aeeb06433e5d96d7150&regi_id=79859114emc=edit_ck_20191130",
  "extension": "Firefox",
  "firstAdded": "2019-12-01T20:30:07.868000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the shortbread layer: Heat oven to 325 degrees. Line an 8-inch square baking pan with parchment paper, leaving a 2-inch overhang on two sides. In a large bowl, beat together butter and sugar with an electric mixer on medium until fluffy, about 2 minutes. Add flour and salt, and beat on low just until the mixture is evenly combined and the texture of coarse sand.",
    "Tip mixture into prepared pan, and press down firmly into an even layer. Bake until top is dry and light golden brown, 30 to 35 minutes. Transfer to a rack to cool.",
    "Make the caramel layer: In a medium saucepan, combine condensed milk, butter, Golden Syrup and salt. Cook mixture over medium heat, stirring constantly with a heatproof spatula, until it has thickened and changed from a milky yellow color to the color of butterscotch pudding, 10 to 20 minutes. It should read 220 degrees to 225 degrees on an instant-read thermometer. Adjust the heat as necessary to keep the bottom from scorching. Stir in vanilla extract. Immediately pour the caramel over the baked crust and spread it into an even layer.",
    "Prepare the chocolate: In the microwave or over a double boiler, melt the chocolate in short bursts, stirring often. Spread melted chocolate in an even layer over caramel. Chill until chocolate is set, about 30 minutes. To serve, cut the parchment-free sides away from the pan with a sharp knife, then transfer the shortbread to a cutting board using the parchment overhang. Cut into 32 small bars."
  ],
  "ingredients": [
    "0",
    "12",
    "tablespoons/170 grams unsalted butter (1 1/2 sticks), at room temperature but not too soft",
    "½",
    "cup/100 grams granulated sugar",
    "1 ½",
    "cups/190 grams all-purpose flour",
    "½",
    "teaspoon kosher salt"
  ],
  "__v": 1
}