{
  "hash": "77d4142bdc7b5bd0b38c363888111d939c5db6e5",
  "title": "French Onion Beef Sliders For A Crowd",
  "image": "http://hostthetoast.com/wp-content/uploads/2017/01/French-Onion-Beef-Sliders-10-320x320.jpg",
  "href": "http://hostthetoast.com/french-onion-beef-sliders/",
  "extension": "Chrome",
  "firstAdded": "2017-01-13T02:31:04.756000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Melt 2 tablespoons of the butter in a skillet over medium heat. Add in the onions and reduce the heat to medium low. Cook, stirring occasionally, until lightly caramelized, about 25-30 minutes. If the onions start to look dry or burnt, add a tablespoon of water to the pan.",
    "In a large bowl, mix the ground beef with half of the beef base and half of the Worcestershire sauce. Season generously with salt and pepper.",
    "Add the beef to the skillet full of onions. Increase heat to medium-high and brown the beef, breaking it up and mixing with the onions as you go. Once browned, drain off excess grease.",
    "Preheat the oven to 350°F. Lightly grease a large baking sheet. Separate the tops from the bottoms of the slider buns. Fit the slider bottom buns tightly on the baking sheet.",
    "Evenly distribute the beef and onion mixture over the bottom buns. Top with the gruyere cheese. Cover with the top buns.",
    "In a microwave safe bowl, melt the butter with the remaining beef base. Stir in the remaining Worcestershire sauce and continue to mix until well-combined. Using a pastry brush, brush the beefy butter mixture over the top buns. Sprinkle with the sesame seeds, thyme, onion powder, and garlic powder.",
    "Bake the sliders until the cheese is fully melted and the tops of the rolls are lightly browned, about 20 minutes."
  ],
  "ingredients": [
    "0",
    "8 tablespoons (1 stick) butter, divided",
    "2 large sweet onions, sliced",
    "2 pounds ground beef",
    "2 tablespoons beef base (such as Better than Boullion), divided",
    "1 tablespoon Worcestershire sauce, divided",
    "Kosher salt and black pepper, to taste",
    "24 slider buns",
    "12-16 ounces gruyere cheese, chopped",
    "2 tablespoons sesame seeds",
    "1 tablespoon fresh thyme",
    "1 teaspoon onion powder",
    "1 teaspoon garlic powder"
  ],
  "__v": 1
}