{
  "hash": "fcf6304614544cd69dec16b132d2c7d520bceb95",
  "title": "5 Minute Bread",
  "image": "https://opimedia.azureedge.net/-/media/images/men/editorial/articles/magazine-articles/2008/12-01/five-minutes-a-day-for-fresh-baked-bread/five-minutes-a-day-for-fresh-baked-bread.jpg",
  "href": "https://www.motherearthnews.com/print?printid={B65A8F37-D482-4A0B-81B6-91611E284D11}",
  "extension": "Chrome",
  "firstAdded": "2019-11-13T15:27:38.763000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Mixing and Storing the Dough",
    "Heat the water to just a little warmer than body temperature (about 100 degrees Fahrenheit).",
    "Add yeast and salt to the water in a 5-quart bowl or, preferably, in a resealable, lidded container (not airtight — use container with gasket or lift a corner). Don’t worry about getting it all to dissolve.",
    "Mix in the flour by gently scooping it up, then leveling the top of the measuring cup with a knife; don’t pat down. Mix with a wooden spoon, a high-capacity food processor with dough attachment, or a heavy-duty stand mixer with dough hook, until uniformly moist. If hand-mixing becomes too difficult, use very wet hands to press it together. Don’t knead! This step is done in a matter of minutes, and yields a wet dough loose enough to conform to the container.",
    "Cover loosely. Do not use screw-topped jars, which could explode from trapped gases. Allow the mixture to rise at room temperature until it begins to collapse (or at least flatten on top), approximately two hours, depending on temperature. Longer rising times, up to about five hours, will not harm the result. You can use a portion of the dough any time after this period. Refrigerated wet dough is less sticky and easier to work with than room-temperature dough. We recommend refrigerating the dough at least three hours before shaping a loaf. And relax! You don’t need to monitor doubling or tripling of volume as in traditional recipes.",
    "Baking Bread on Baking Day",
    "Prepare a pizza peel by sprinkling it liberally with cornmeal to prevent the loaf from sticking to it when you slide it into the oven.",
    "Sprinkle the surface of the dough with flour, then cut off a 1-pound (grapefruit-sized) piece with a serrated knife. Hold the mass of dough in your hands and add a little more flour as needed so it won’t stick to your hands. Gently stretch the surface of the dough around to the bottom on four “sides,” rotating the ball a quarter-turn as you go, until the bottom is a collection of four bunched ends. Most of the dusting flour will fall off; it doesn’t need to be incorporated. The bottom of the loaf will flatten out during resting and baking.",
    "Place the ball on the pizza peel. Let it rest uncovered for about 40 minutes. Depending on the dough’s age, you may see little rise during this period; more rising will occur during baking.",
    "Twenty minutes before baking, preheat oven to 450 degrees with a baking stone on the middle rack. Place an empty broiler tray for holding water on another shelf.",
    "Dust the top of the loaf liberally with flour, which will allow the slashing, serrated knife to pass without sticking. Slash a 1⁄4-inch-deep cross, scallop or tick-tack-toe pattern into the top. (This helps the bread expand during baking.)",
    "With a forward jerking motion of the wrist, slide the loaf off the pizza peel and onto the baking stone. Quickly but carefully pour about a cup of hot water into the broiler tray and close the oven door to trap the steam. Bake for about 30 minutes, or until the crust is browned and firm to the touch. With wet dough, there’s little risk of drying out the interior, despite the dark crust. When you remove the loaf from the oven, it will audibly crackle, or “sing,” when initially exposed to room temperature air. Allow to cool completely, preferably on a wire rack, for best flavor, texture and slicing. The perfect crust may initially soften, but will firm up again when cooled.",
    "Refrigerate the remaining dough in your lidded (not airtight) container and use it over the next two weeks: You’ll find that even one day’s storage improves the flavor and texture of your bread. This maturation continues over the two-week period. Cut off and shape loaves as you need them. The dough can also be frozen in 1-pound portions in an airtight container and defrosted overnight in the refrigerator prior to baking day."
  ],
  "ingredients": [
    "0",
    "6 cups water",
    "3 tablespoons salt",
    "3 tablespoons yeast",
    "13 cups of flour"
  ],
  "__v": 3
}