{
  "hash": "a6883ca07aba91673ef46519de1c50251dd46a25",
  "title": "Rainbow Seven Layer Cookies",
  "image": "",
  "href": "http://allrecipes.com/personalrecipe/62549166/rainbow-seven-layer-cookies/detail.aspx",
  "firstAdded": "2015-02-24T02:57:13.531000",
  "users": [
    null
  ],
  "keywords": [
    "edit",
    "save",
    "servings",
    "eggs",
    "separated",
    "sugar",
    "almond",
    "unsalted",
    "butter",
    "softened",
    "allpurpose",
    "flour",
    "salt",
    "drops",
    "red",
    "food",
    "coloring",
    "green",
    "jar",
    "apricot",
    "preserves",
    "heated",
    "strained",
    "finequality",
    "bittersweet",
    "chocolate"
  ],
  "directions": [
    "0",
    "Directions",
    "Put oven rack in middle position and preheat oven to 350°F. Butter a 13- by 9-inch baking pan and line bottom with wax paper, leaving a 2-inch overhang on 2 ends, then butter paper.",
    "Beat whites in mixer fitted with whisk attachment at medium-high speed until they just hold stiff peaks. Add 1/4 cup sugar a little at a time, beating at high speed until whites hold stiff, slightly glossy peaks. Transfer to another bowl.",
    "Switch to paddle attachment, then beat together almond paste and remaining 3/4 cup sugar until well blended, about 3 minutes. Add butter and beat until pale and fluffy, about 3 minutes. Add yolks and almond extract and beat until combined well, about 2 minutes. Reduce speed to low, then add flour and salt and mix until just combined.",
    "Fold half of egg white mixture into almond mixture to lighten, then fold in remaining whites gently but thoroughly.",
    "Divide batter among 3 bowls. Stir red food coloring into one and green food coloring into another, leaving the third batch plain. Set white batter aside. Chill green batter, covered. Pour red batter into prepared pan and spread evenly with offset spatula (layer will be about 1/4 inch thick).",
    "Bake red layer 8 to 10 minutes, until just set. (It is important to undercook. They’ll look like they’re not done, but a tester does come out clean.)",
    "Using paper overhang, transfer layer to a rack to cool, about 15 minutes. Clean pan, then line with parchment or wax paper and butter paper in same manner as above. Bake white layer in prepared pan until just set. As white layer bakes, bring green batter to room temperature. Transfer white layer to a rack. Prepare pan as above, then bake green layer in same manner as before. Transfer to a rack to cool."
  ],
  "ingredients": [
    "0",
    "Ingredients Edit and Save",
    "Servings: 24",
    "4 large eggs, separated",
    "1 cup sugar",
    "1 (8-oz) can almond paste",
    "2 1/2 sticks (1 1/4 cups) unsalted butter, softened",
    "1 teaspoon almond extract",
    "2 cups all-purpose flour",
    "1/2 teaspoon salt",
    "25 drops red food coloring",
    "25 drops green food coloring",
    "1 (12-oz) jar apricot preserves, heated and strained",
    "7 oz fine-quality bittersweet chocolate (not unsweetened), chopped"
  ],
  "__v": 1
}