{
  "__v": 1,
  "directions": [
    "0",
    "Rub the down off the quinces and wash them. There is no need to peel or core the quinces.",
    "Chop the quinces carefully, as they are hard it is easy for the knife to slip. I chopped them into quarters and sliced them into 1cm slices.",
    "Place the quince slices in a large saucepan or casserole dish and add water so that they are just floating. Add the zest of half a lemon.",
    "Bring slowly to the boil and then turn the hob down to it’s lowest setting so that the quinces gently simmer (lid on). Simmer the fruit until very soft and the fruit has turned a deep pink colour. This took me about 3 hours. Check the quinces every now and then and top up the water if necessary.",
    "Strain the juice from the fruit overnight using a jelly bag or muslin square. Retain the juice to make quince jelly.",
    "I was loathe to spend hours pressing the quinces through a sieve so I put them through the Magimix (medium grater blade) and then I sieved them.",
    "Measure the pulp using a measuring jug put the pulp into a large heavy bottomed saucepan or casserole dish and add an equal volume of white granulated sugar. Add the juice of half a lemon.",
    "Bring the pulp and sugar gradually to simmering point, stirring to dissolve the sugar and let it simmer, lowest setting for 2-3 hours, stirring every now and then to stop it sticking and burning. It will resemble gloopy mud. Gradually the colour will darken. Eventually the fruit will become very thick (I could stand my spoon up in mine).",
    "Spoon into well oiled sterilised straight sided jars and seal with cellophane lids. This will keep for months. Cut slices to eat with cheese or cold meat. Refrigerate after opening."
  ],
  "firstAdded": "2014-11-09T17:57:48.944000",
  "hash": "3dba225eef89d76237142c429ce86dc9dc043f5a",
  "href": "http://www.cottagesmallholder.com/easy-quince-cheese-recipe-membrillo-467/",
  "image": "http://www.cottagesmallholder.com/quince%20cheese%20membrillo.jpg",
  "ingredients": [
    "0",
    "For the quince pulp:",
    "1 kilo of quinces",
    "Zest of half a lemon",
    "Water to cover",
    "For the quince cheese:",
    "Quince pulp",
    "Juice of half a lemon",
    "Granulated (not castor) white sugar (equal volume to the pulp)"
  ],
  "keywords": [
    "quince",
    "pulp",
    "kilo",
    "quinces",
    "zest",
    "lemon",
    "water",
    "cover",
    "cheese",
    "juice",
    "granulated",
    "castor",
    "white",
    "sugar",
    "equal",
    "volume"
  ],
  "title": "Easy quince cheese recipe (membrillo)",
  "users": [
    null
  ]
}