{
  "hash": "246163345c6c99fe0bf67cf0ad9776aba6853081",
  "title": "How to Make Tamales",
  "image": "",
  "href": "http://www.bhg.com/recipes/ethnic-food/mexican/how-to-make-tamales/",
  "extension": "Chrome",
  "firstAdded": "2015-07-27T17:06:46.882000",
  "users": [
    null
  ],
  "keywords": [
    "cornhusks",
    "used",
    "tamale",
    "wrappers",
    "grocery",
    "stores",
    "mexican",
    "markets",
    "husks",
    "softened",
    "water",
    "using",
    "tortilla",
    "flour",
    "dough",
    "corn",
    "treated",
    "slaked",
    "lime",
    "masa",
    "harina",
    "lard",
    "rendered",
    "pork",
    "gives",
    "tamales",
    "flavor",
    "fat",
    "needed",
    "doughs",
    "texture",
    "use",
    "shortening",
    "buy",
    "market",
    "broth",
    "moistens",
    "helps",
    "create",
    "right",
    "salt",
    "natural",
    "enhancer",
    "boosts",
    "leavening",
    "agent",
    "rise",
    "bit",
    "baking",
    "lighter"
  ],
  "directions": [
    "0",
    "Tamale Step 1: Soak cornhusks",
    "Place the dried cornhusks in a pan or dish and cover with hot water, allowing husks to soak until soft (thin, pliable husks require less soaking time than tough, brittle ones). Softening cornhusks can take up to 30 minutes.",
    "Tamale Step 2: Make the masa (dough)",
    "With an electric mixer, beat the lard or shortening until light and fluffy. Beat in the dry ingredients and liquid as directed in the recipe. The finished dough should resemble a thick, creamy paste that is easy to work with.",
    "Tamale Step 3: Fill the tamales",
    "Remove the husks from the water, drain in a colander, and pat dry.",
    "Top each husk with 2 tablespoons of the masa dough, spreading dough into a rectangle that runs close to one of the long sides of the husk.",
    "Spread about 1 tablespoon desired filling lengthwise down the center of the dough on each husk.",
    "Tip: Use your imagination when it comes to the filling -- almost anything goes, from slow-cooked beef to sweet corn or even fruit.",
    "Tamale Step 4: Wrap the tamales",
    "For each tamale, fold the long end of the husk so it slightly overlaps the dough. Next, roll the husk around the dough and filling.",
    "Tamale Step 5: Tie the cornhusks",
    "Tie the ends of each husk with strips of soaked cornhusk or 100-percent-cotton string. Tying the ends keeps the condensed steam away from the masa (dough) when steaming and keeps the bundles intact. It also gives them the quintessential bundle shape that is so charming.",
    "Tip: To make ahead, place the wrapped (uncooked) tamales in resealable freezer bags or airtight freezer containers and freeze them for up to 6 months. Steam them as directed before serving.",
    "Tamale Step 6: Prep the steamer",
    "Tamales are cooked in a steamer. You can purchase a steamer with a basket or rack inside. Or create your own steamer by using a Dutch oven fitted with a vegetable steamer basket or a metal rack inside.",
    "Arrange the tamales in a single layer or stand them upright in the steamer basket, filling the space but not packing them tightly.",
    "Tip: If desired, place a cone-shape ball of foil in the center of the steamer basket to help tamales stand up.",
    "Tamale Step 7: Steam tamales",
    "Pour at least 1-1/2 inches water in the bottom of the steamer or Dutch oven. Place the filled steamer basket over the water. Bring the water to boiling. Cover and reduce heat to medium-low. Steam the tamales until the dough pulls away from the cornhusks and is spongy and cooked through.",
    "Tip: Check the water in the pan occasionally, replenishing it as needed. This will ensure the steamer won't boil dry and scorch.",
    "Make-Ahead Tip: You can freeze cooked tamales as well. Wrap and freeze cooled tamales in the cornhusks. To serve, thaw in the refrigerator overnight. Place the tamales in a steamer basket over gently boiling water for 15 to 20 minutes or until heated through."
  ],
  "ingredients": [
    "0",
    "Dried cornhusks are used as tamale wrappers and can be found at grocery stores and Mexican markets. The husks are softened in water before using.",
    "Masa harina is corn tortilla flour. \"Masa\" is dough made of dried corn; it's treated with slaked lime and ground, then dried and powdered to become masa harina.",
    "Lard, which is rendered pork fat, gives tamales flavor and the fat needed for the dough's texture. (You can also use shortening.) Buy it at a Mexican market.",
    "Water or broth moistens the masa harina and helps create the right dough texture.",
    "Salt is a natural flavor enhancer and boosts the corn flavor of the tamale dough.",
    "Baking powder is used in some tamale dough as a leavening agent, which helps the dough rise a bit when baking and gives it a lighter texture."
  ],
  "__v": 1
}