{
  "hash": "79a3654fe509d7a8ea910b5217c98a1223b9b584",
  "title": "TAAMEYYA: THE ORIGINAL EGYPTIAN FALAFEL",
  "image": "http://www.mattersofthebelly.com/wp-content/uploads/2016/06/taameyya-37.jpg",
  "href": "http://www.mattersofthebelly.com/taameyya-the-original-egyptian-falafel/",
  "extension": "Chrome",
  "firstAdded": "2018-12-11T13:49:12.567000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "SOAK THE BEANS: Place the dried split fava beans in a large bowl with the 2 tsp. baking soda, cover with plenty of water, cover with a plate or towel and let them soak for at least 4 hours, or up to overnight. Rinse very well, drain and set aside.",
    "MAKE THE FALAFEL MIXTURE: In the bowl of a food processor, combine the onion (or leeks or spring onions or whichever combination you choose), garlic, parsley, fresh coriander, cornstarch, 1.5 tsp. baking soda, ground coriander, ground cumin and salt. Process until everything is quite finely chopped and well mixed, stopping to scrape the sides of the bowl as needed.",
    "Add the well drained fava beans to the food processor and pulse, repeatedly, until a rough, uniform but coarse paste is formed (refer to photos), stopping frequently to scrape down the sides of the bowl. You want the beans to be broken up well into small pieces, but not turned into a puree. Some larger bits are totally ok!",
    "Transfer the mixture into a bowl, cover and chill in the fridge for 15-30 minutes, just so that it firms up a bit and is easier to form into patties. Once it is chilled, take the bowl out of the fridge. Fill a deep frying pan (I use my cast iron skillet) with at least 3cm of oil, and place on medium heat to allow it to heat up while you roll the falafel (it takes 5-10 minutes, depending on the size of you pan and amount of oil used).",
    "FORM THE FALAFEL: Wet your hands and scoop out about 2-3 tbsp. of the mixture at a time and form into falafels; you can go the traditional Egyptian shape of burger-like patties, or make them more round or oval if you prefer! Place them onto a tray lined with baking paper or foil as you form them. Sprinkle each patty with about ½ tsp. of sesame seeds and gently pat them on with your finger so that they stick. *TIP: at this point, you can transfer the entire tray to the freezer and freeze the falafel for later. Once they are frozen solid, transfer them off the tray into an airtight container and store in the freezer until needed (up to 3 months!). To cook, just take them out of the freezer and defrost only slightly, for 30-60min, before frying.",
    "FRY THE FALAFEL: Test the oil by dropping in a small bit of the falafel mixture; it is ready when the mixture bubbles up and starts to fry immediately. Once the oil is hot enough, you can begin to fry the falafel. Gently place 5-6 falafel at a time into the oil, being careful not to splash them into the oil (I use my hands, but please use a flat spatula or slotted server or even a spoon if you are worried! Oil burns are awful! Just make sure the utensil you use to transfer the patties into the oil isn’t too rough or textured, as the falafel mixture if quite delicate and can easily become smushed). Fry for a couple of minutes, until very nicely browned, then flip them over and fry a further minute on the other side till browned all over. Use a slotted spoon to transfer them to a plate or tray lined with plenty of kitchen paper. Continue to fry the falafel in batches until they are all cooked. Serve immediately with warm pita bread, sliced tomatoes, cucumbers, pickles, and tahini sauce or hummus!"
  ],
  "ingredients": [
    "0",
    "• 400g dried split & peeled fava (or broad) beans*",
    "• 2 tsp. baking soda (sodium bicarbonate)",
    "• 1 brown onion, OR 1 leek (white part only), OR 1 bunch of green (spring) onions, OR a combination of any of these, roughly chopped**",
    "• 3-4 cloves garlic, peeled",
    "• 1 bunch fresh parsley, leaves picked***",
    "• 1 bunch fresh coriander, leaves picked***",
    "• 1 tbsp. cornstarch",
    "• 1.5 tsp. baking soda (sodium bicarbonate)",
    "• 1 tsp. ground coriander",
    "• ½ tsp. ground cumin",
    "• 2 tsp. fine salt",
    "• neutral oil, for frying (I use light refined olive oil. See notes)"
  ],
  "__v": 1
}