{
  "hash": "9137d4ec3319fe764abe9f9cec1ea47e862ec5b4",
  "title": "The Milk Truck's Good Morning All Day Sandwich",
  "image": "http://a.abcnews.com/assets/images/font-sm_off2.gif",
  "href": "http://abcnews.go.com/GMA/recipe/milk-trucks-recipe-good-morning-day-sandwich-17043921?nwltr=GMAR_tryHed_pos4",
  "extension": "Chrome",
  "firstAdded": "2015-04-10T19:16:55.962000",
  "users": [
    null
  ],
  "keywords": [
    "slices",
    "balthazar",
    "rye",
    "batard",
    "bread",
    "gruyere",
    "applewood",
    "smoked",
    "ham",
    "eggs",
    "medium",
    "yellow",
    "onion",
    "mushrooms",
    "lemon",
    "clarified",
    "butter",
    "olive",
    "oil",
    "sprigs",
    "thyme",
    "leaves",
    "sugar",
    "salt",
    "seasoning",
    "pepper"
  ],
  "directions": [
    "0",
    "Heat a large skillet over medium heat.",
    "Add 2 tablespoons of oil. Add onions and cook until softened, about 5 minutes.",
    "Add 1 tablespoon sugar and 1 teaspoon salt, toss and continue to cook until onions are golden and slightly caramelized. Remove from pan and place on plate to cool.",
    "Clean and slice the mushrooms.",
    "Heat a large skillet over medium heat. When hot, add 2-3 tbsp. of olive oil. Add the mushrooms and thyme. Saute the mushrooms for a few minutes until browned. Salt to taste and remove from heat. Squeeze a bit of lemon juice over the mushrooms and set aside.",
    "Wipe out the skillet, replace on heat and add 1-2 tbsp. of olive oil. Gently break four eggs into the pan, season with salt and pepper. Let the whites set a bit, then break the yolk. Flip the eggs and cook for another 30 seconds. You want the yolks to be just a little runny. Remove from pan and hold.",
    "Heat a Panini maker according to instructions or a ridged, cast iron pan over medium heat.",
    "Butter the outside of the 8 slices of bread.",
    "On the unbuttered sides of 4 slices, add to each:",
    "2 oz of Gruyere",
    "One slice of ham",
    "One egg",
    "One tablespoon of caramelized onions",
    "One tablespoon of mushrooms",
    "Cover with the remaining bread slices so that the buttered sides are facing out. Place sandwiches in a Panini grill, two at a time, and grill until the bread is crisp and the cheese is melted throughout.",
    "(Note: If using a cast iron pan, place another slightly smaller pan on top of the sandwiches to weight them down. Turn after a couple of minutes and repeat.)",
    "Cut in half and serve hot."
  ],
  "ingredients": [
    "0",
    "8 slices of Balthazar Rye Batard bread",
    "8 oz gruyere, sliced or grated",
    "4 1 oz slices of applewood smoked ham",
    "4 fresh eggs",
    "1 medium yellow onion, sliced thinly",
    "4 oz mushrooms",
    "1/2 lemon",
    "2 oz clarified butter",
    "olive oil",
    "4 sprigs of thyme, leaves only",
    "1 tablespoon sugar",
    "1 teaspoon salt + more for seasoning",
    "pepper"
  ],
  "__v": 1
}