{
  "hash": "02164bff6c6ffd1dfc17c7698a0de890571d1631",
  "title": "Black dal",
  "image": "",
  "href": "http://recipe-folder.com/recipe/5be6db1f780287195894fc8a",
  "extension": "User Added",
  "firstAdded": "2018-11-10T13:20:31.844000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Wash the dals under cold running water until it runs clear. Put in a bowl, cover with warm water and leave to soak for at least three hours.",
    "1",
    "Drain the dal, tip into a pan, add the oil and salt, then cover with 1.2 litres warm water and cook on a low heat until the grains split and go soft – black dal is like a small, rock-hard bullet, so takes a long time to cook, anything from three to six hours-plus (traditionally, it’s cooked overnight on a charcoal tandoor). Alternatively, cook it in a pressure cooker on medium until done – pressure cookers vary hugely: mine’s a",
    "2",
    "very old one with a whistle, and it takes about 90 minutes; more modern ones will be much faster.",
    "3",
    "Heat the tablespoon of oil in a heavy pan, add the ginger and garlic pastes, and stir on medium heat for two minutes, until they start to catch. Add the chilli powders and 100ml water, and cook, stirring, for a minute. Add the tomato puree, cook for 10-15 minutes, then stir into the dal pot and cook for 30 minutes, until combined. Add 90g butter and cook, stirring, for 15 minutes.",
    "4",
    "Stir in the cream and fenugreek, cook, stirring, for 15 minutes, then adjust seasoning to taste. Serve with the remaining butter on top."
  ],
  "ingredients": [
    "0",
    "200g urad dal (black gram lentils)",
    "1",
    "25g chana dal (chickpea lentils)",
    "2",
    "50ml vegetable oil, plus 1 tbsp extra for frying",
    "3",
    "2 tsp salt",
    "4",
    "1 big tbsp ginger paste (peeled, finely chopped and ground to a paste)",
    "5",
    "1 big tbsp garlic paste (peeled, finely chopped and ground to a paste)",
    "6",
    "1 tbsp Kashmiri chilli powder",
    "7",
    "1 tsp deggi mirch powder (Indian chilli powder)",
    "8",
    "160g tomato puree",
    "9",
    "100g unsalted butter",
    "10",
    "50ml single cream",
    "11",
    "2 tsp dried fenugreek leaf, lightly roasted and ground"
  ],
  "__v": 1,
  "hidden": true
}