{
  "hash": "3c0d925d9c3d82a4b3bb4ce976fdaf75b55368b7",
  "title": "Блинчики",
  "image": "http://gotovim-doma.ru/img/img0027_1.jpg",
  "href": "http://gotovim-doma.ru/view.php?r=27-recept-blinchiki",
  "extension": "Chrome",
  "firstAdded": "2016-05-01T13:25:38.405000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Приготовление",
    "В миску разбить яйца, добавить соль и сахар.",
    "Перемешать, венчиком или вилкой до однородности (взбивать не нужно).",
    "Совет. Если готовить сладкие блинчики - к ним можно добавить 2-2,5 столовых ложки сахара, для несладких блинчиков будет достаточно 1 столовой ложки.",
    "Влить к яйцам около 200 мл молока и перемешать.",
    "Добавить муку и перемешать до однородности (по консистенции тесто, как густая сметана).",
    "Влить оставшееся молоко (около 300 мл), перемешать.",
    "Тесто должно получиться жидким и легко льющимся.",
    "Совет. Если добавить в тесто 0,5-1 стакан крутого кипятка, блинчики получатся нежными, тонкими и ажурными.",
    "Влить растительное масло.",
    "Тесто перемешать и дать постоять 15-20 минут.",
    "Хорошо разогреть сковороду для блинов (желательно чугунную) и смазать ее тонким слоем растительного масла.",
    "Совет. Можно смазывать сковороду, смоченной в масле, половинкой очищенной луковицы или картофелины, насаженной на вилку.",
    "Еще более удобный вариант - смазывать сковороду чистой поролоновой губкой, смоченной в масле.",
    "В центр сковороды вылить полчерпака или черпак теста (в зависимости от диаметра сковороды) и быстро распределить по всей поверхности тонким слоем, немного поворачивая сковороду.",
    "Когда края теста начнут подсыхать и слегка румяниться - поддеть блинчик тонкой широкой лопаткой и аккуратно перевернуть."
  ],
  "ingredients": [
    "0",
    "Состав",
    "молоко - 500 мл,",
    "яйца - 3 шт,",
    "мука - 280 г,",
    "сахар - 1-2 столовых ложки,",
    "соль - 1 чайная ложка (без горки),",
    "растительное масло - 3 столовых ложки,",
    "сливочное масло для смазывания готовых блинчиков"
  ],
  "__v": 1
}