{
  "hash": "dc1378e4b5eef5c7e19fb20d7b28b2f75f805b49",
  "title": "Italian Stuffed Flank Steak",
  "image": "http://www.thechunkychef.com/wp-content/uploads/2015/01/IMG_7159-2-cropped-300x206.jpg",
  "href": "http://www.thechunkychef.com/italian-stuffed-flank-steak/",
  "extension": "Chrome",
  "firstAdded": "2016-08-11T15:03:18.674000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine garlic, shallot, parsley, basil, sage, and olive oil in small bowl.",
    "Slicing horizontally across the steak, butterfly and pound flank steak into 2 thin rectangles. Position steak so that the grain runs parallel to the edge of the counter, spread herb mixture evenly over surface of steak.",
    "Lay prosciutto evenly over steak, leaving 1-inch border along top edge.",
    "Cover prosciutto with even layer of cheese, leaving 1-inch border along top edge.",
    "Starting from bottom edge and rolling up away from you, towards the top, roll steak into tight log and place on cutting board seam-side down.",
    "Starting in the middle of the steak roll, tie a piece of kitchen twine to secure the steak. Working outward from the center, place more ties of kitchen twine, in one inch intervals, until the whole steak roll is tied up.",
    "Using a sharp knife, slice roll between pieces of twine into 1-inch-thick pinwheels. Season pinwheels lightly with salt and black pepper.",
    "Skewer each pinwheel with a toothpick.",
    "Preheat oven to 350.",
    "Heat a cast iron skillet over medium high heat. Place pinwheels in pan and brown for 3 minutes or so. Flip over and brown on the other side for 2 minutes.",
    "Slide skillet into preheated oven and cook for about 8-10 minutes or until steak reaches desired doneness.",
    "Remove from oven, tent with aluminum foil and let rest for 5 minutes.",
    "Remove twine and toothpicks and enjoy!"
  ],
  "ingredients": [
    "0",
    "3 - 4 garlic cloves , minced or pressed through garlic press",
    "1 small shallot , minced",
    "2 Tbsp fresh parsley , finely minced",
    "1 tsp sage leaves , finely minced",
    "1 tsp basil, minced",
    "2 Tbsp olive oil",
    "1 flank steak (2- to 2 1/2-pounds)",
    "4 ounces thinly sliced prosciutto",
    "4 ounces thinly sliced provolone cheese",
    "toothpicks, soaked in water for 10 minutes",
    "Salt and pepper, to taste"
  ],
  "__v": 1
}