{
  "__v": 1,
  "directions": [
    "0",
    "Roast your butternut squash in a 400 degree oven for about 40 minutes or until it's soft. I roast mine whole (make a few holes in it with a fork), and then cut it in half lengthwise (and save the other half for another day). When it's cool enough to touch, scoop out the soft flesh. If it's not soft enough continue cooking it.",
    "Using a potato masher or a fork, mash the butternut squash with the garbanzo flour, olive oil, garlic, cumin, paprika, cayenne, a touch of maple syrup, and a generous sprinkling of salt. Stir in the scallions, feta, and chopped cilantro. You can taste it at this point and adjust seasonings... (although keep in mind that the flavor gets infinitely better once they're cooked).",
    "On a large plate, spread out the panko bread crumbs. Spoon about a tablespoon amount of the mash and shape into balls (as best you can, it's messy). Then gently roll them in the panko. (you might not use all the panko, it's ok).",
    "Bake in a 350 degree oven for about 20 minutes or until golden brown.. If you have a broiler, turn it on during the last few to help the golden-ing along.",
    "While the croquettes bake, stir together the yogurt sauce ingredients. Set in the fridge to chill until ready to serve."
  ],
  "firstAdded": "2014-08-24T20:39:47.779000",
  "hash": "4715d7d6752387b627ad12f5cde55319443824ab",
  "href": "http://www.loveandlemons.com/2013/01/23/butternut-squash-croquettes/",
  "image": "http://d1wcgy4dy6voh7.cloudfront.net/wp-content/uploads/2013/01/IMG_00173.jpg",
  "ingredients": [
    "0",
    "1/2 a medium sized butternut squash, roasted until soft (about 1.5 cups of mash)",
    "1/3 cup garbanzo bean flour",
    "1 clove minced garlic",
    "1/2 tablespoon olive oil",
    "1/2 teaspoon cumin",
    "1/2 teaspoon smoked paprika",
    "pinch of cayenne",
    "splash of maple syrup or agave (optional)",
    "1/4 cup chopped scallions, white and green parts",
    "1/4 cup chopped cilantro (optional)",
    "1/4 cup crumbled feta cheese (optional, omit if vegan)",
    "salt & pepper",
    "about 1 cup panko bread crumbs, for rolling",
    "1/2 cup plain yogurt",
    "juice and zest of one lime (or 1/2 a lemon)",
    "splash of olive oil",
    "1 garlic clove, minced",
    "a few tablespoons of chopped cilantro",
    "a few pinches of red pepper flakes (optional)",
    "salt & pepper"
  ],
  "keywords": [
    "medium",
    "sized",
    "butternut",
    "squash",
    "roasted",
    "soft",
    "mash",
    "garbanzo",
    "bean",
    "flour",
    "clove",
    "garlic",
    "olive",
    "oil",
    "cumin",
    "smoked",
    "paprika",
    "cayenne",
    "splash",
    "maple",
    "syrup",
    "agave",
    "scallions",
    "white",
    "green",
    "parts",
    "cilantro",
    "crumbled",
    "feta",
    "cheese",
    "omit",
    "vegan",
    "salt",
    "pepper",
    "panko",
    "bread",
    "crumbs",
    "rolling",
    "plain",
    "yogurt",
    "juice",
    "zest",
    "lime",
    "lemon",
    "pinches",
    "red"
  ],
  "title": "butternut squash croquettes",
  "users": [
    null
  ]
}