{
  "hash": "88c949773870bb456dadc06c48e592534bf074b4",
  "title": "Eggplant Parmesan",
  "image": "http://www.simplyrecipes.com/recipes/eggplant_parmesan/",
  "href": "http://www.simplyrecipes.com/recipes/eggplant_parmesan/",
  "keywords": [
    "lbs",
    "eggplants",
    "kosher",
    "salt",
    "tomatoes",
    "clove",
    "garlic",
    "olive",
    "oil",
    "black",
    "pepper",
    "allpurpose",
    "flour",
    "dry",
    "breadcrumbs",
    "eggs",
    "mozzarella",
    "cheese",
    "rounds",
    "high",
    "quality",
    "parmesan",
    "basil",
    "leaves"
  ],
  "directions": [
    "0",
    "Cut eggplants lengthwise into 1/4 inch slices. Arrange one layer in the bottom of a large colander and sprinkle evenly with salt. Repeat with remaining eggplant, salting, until all eggplant is in the colander. Weigh down the slices with a couple of plates and let drain for 2 hours. The purpose of this step is to have the eggplant release some of its moisture before cooking.",
    "While the eggplant is draining, prepare tomato sauce. Combine tomatoes, garlic and 1/3 cup olive oil in a food processor. Season with salt and pepper to tasted and set aside.",
    "When eggplant has drained, press down on it to remove excess water, wipe off the excess salt, and lay the slices out on paper towels to remove all the moisture. In a wide, shallow bowl, combine flour and breadcrumbs. Mix well. Pour beaten eggs into another wide shallow bowl. Place a large, deep skillet over medium heat, and pour in a a half inch of olive oil. When oil is shimmering, dredge the eggplant slices first in the flour mixture, then in the beaten egg. Working in batches, slide coated eggplant into hot oil and fry until golden brown on both sides, turning once. Drain on paper towels.",
    "Preheat the oven to 350°F. In the bottom of a 10x15 inch glass baking dish, spread 1 cup of tomato sauce. Top with one third of the eggplant slices. Top eggplant with half of the mozzarella slices. Sprinkle with one third of the Parmesan and half of the basil leaves.",
    "Make a second layer of eggplant slices, topped by 1 cup of sauce, remaining mozzarella, half the remaining Parmesan, and all of the remaining basil. Add remaining eggplant, and top with the remaining tomato sauce and Parmesan.",
    "Bake until cheese has melted and the top is slightly brown, about 30 minutes. Allow to rest at room temperature for about 10 minutes before serving.",
    "Yield: Serves 8."
  ],
  "ingredients": [
    "0",
    "2 lbs (about 2 large) eggplants",
    "Kosher salt",
    "1 28-oz can whole peeled tomatoes",
    "1 clove garlic, peeled and minced",
    "Olive oil",
    "Freshly ground black pepper",
    "1/2 cup all-purpose flour",
    "1/2 cup fine dry breadcrumbs",
    "4 large eggs, beaten",
    "1 1/2 lbs of fresh mozzarella cheese, sliced into 1/4 inch rounds",
    "1 cup grated high quality Parmesan cheese",
    "1 packed cup fresh basil leaves"
  ],
  "__v": 0
}