{
  "hash": "232cf2b36fdd518c3b88eba6664d155197736852",
  "title": "Hemp Za'atarSorghum CrackersParsley Hummus",
  "image": "http://i1.wp.com/willfrolicforfood.com/wp-content/uploads/2015/02/hemp-zaatar-sorghum-crackers-gluten-free-vegan-6933.jpg?resize=685%2C457",
  "href": "http://willfrolicforfood.com/2015/02/hemp-zaatar-sorghum-crackers-w-parsley-pesto-vegan-gluten-free.html",
  "extension": "",
  "firstAdded": "2015-11-11T16:45:48.697000",
  "users": [
    null
  ],
  "keywords": [
    "hemp",
    "hearts",
    "sumac",
    "thyme",
    "flakey",
    "coarse",
    "pink",
    "salt",
    "sorghum",
    "flour",
    "baking",
    "nutritional",
    "yeast",
    "olive",
    "oil",
    "brushing",
    "crackers",
    "water",
    "zaatar",
    "organic",
    "chickpeas",
    "tahini",
    "lemon",
    "juice",
    "parsley",
    "smoked",
    "paprika",
    "clove",
    "saut",
    "garlic",
    "browned",
    "deeper",
    "flavor"
  ],
  "directions": [
    "0",
    "Combine all ingredients in a small bowl. Done!",
    "1",
    "Add 2 cups sorghum flour and the baking powder and sea salt to the bowl of a food processor and pulse to combine. If you'd like to add nutritional yeast (for a cheesier, savory flavor) add that now and pulse to combine.",
    "While the food processor is running, drizzle in the olive oil.",
    "Drizzle in ¼ cup warm water. Add one tablespoon at a time more of warm water until your dough begins to come together into a ball in the bowl of the processor as it's running.",
    "Line a work surface with parchment paper. Remove your dough from the food processor, placing it on your work surface, and knead for a couple of minutes. Separate into two dough balls, placing them both on the parchment paper. Drizzle about ½ teaspoon of olive oil on each dough ball, patting the oil all over the surface of the dough. Let rest 10 minutes.",
    "Preheat the oven to 350F. Line a two large baking sheets with parchment paper, or grease lightly with olive oil.",
    "Roll each dough ball out one at a time: place a sheet of parchment paper on top of the dough ball and press the ball down into a round. Using a rolling pin, roll the dough out to about ⅛ inch thickness.",
    "Using cookie cutters in whatever shapes you please, cut out crackers and place them on your parchment lined baking sheets spaced about ½ inch apart. You can re-roll extra dough into balls, flatten, roll out, cut out crackers, place, etc. Continue with this method until you've rolled out and cut out all of your crackers.",
    "Brush each of your crackers with olive oil gently (I drizzled it over the crackers then used a spoon to brush it over).",
    "Sprinkle the hemp za'atar over top of your crackers. Using the back of a spoon, press down on the za'atar gently.",
    "Bake 15 minutes, or until crackers are lightly golden. Let the crackers cool completely (the crackers firm up more once they've cooled).",
    "2",
    "Combine all ingredients in a food processor or high powered blender. Blend on high until everything is well mixed. Enjoy with homemade crackers or, heck, whatever type of chip or veg you like!"
  ],
  "ingredients": [
    "0",
    "2 tablespoons hemp hearts",
    "1 tablespoon sumac",
    "2 tablespoons dried thyme (or 1 tbsp fresh thyme)",
    "1 teaspoon flakey coarse sea salt or coarse pink salt",
    "1",
    "2 cups sorghum flour",
    "1 teaspoon baking powder",
    "½ teaspoon coarse sea salt",
    "*optional 3 tablespoons nutritional yeast",
    "4 tablespoons olive oil, plus more for brushing crackers",
    "¼ cup warm water + up to 4 tablespoons more",
    "hemp za'atar",
    "2",
    "1 can organic chickpeas, drained (or 1.5 cups freshly cooked chickpeas)",
    "¼ cup tahini",
    "¼ cup olive oil",
    "2 tablespoons lemon juice",
    "½ cup packed fresh parsley",
    "1 tablespoon sumac",
    "1 tablespoon thyme",
    "½ teaspoon smoked paprika",
    "1 teaspoon sea salt, to taste",
    "1 clove garlic minced (optional: sauté garlic in olive oil until just browned for a deeper flavor)"
  ],
  "__v": 1
}