{
  "hash": "f4a1c20f71b61eec03f6c3a613ff3e926300f4ba",
  "title": "Boeuf Bourguignon a La Julia Child",
  "image": "http://img.sndimg.com/food/image/upload/w_266/v1/img/recipes/14/80/07/pic1XsGan.jpg",
  "href": "http://www.food.com/recipe/boeuf-bourguignon-a-la-julia-child-148007?scaleto=14.5&mode=null&st=true",
  "firstAdded": "2014-12-19T00:46:49.495000",
  "users": [
    null
  ],
  "keywords": [
    "bacon",
    "solid",
    "chunk",
    "olive",
    "oil",
    "lbs",
    "lean",
    "stewing",
    "beef",
    "cubes",
    "carrot",
    "onion",
    "salt",
    "pepper",
    "flour",
    "red",
    "bodied",
    "wine",
    "bordeaux",
    "burgundy",
    "chianti",
    "simple",
    "stock",
    "posted",
    "site",
    "unsalted",
    "defatted",
    "tomato",
    "garlic",
    "mashed",
    "choose",
    "sprigs",
    "dred",
    "thyme",
    "bay",
    "leaf",
    "preferably",
    "white",
    "pearl",
    "onions",
    "butter",
    "parsley",
    "mushroom"
  ],
  "directions": [
    "0",
    "First prepare the bacon: cut off the rind and reserve.",
    "Cut the bacon into lardons about 1/4\" thick and 1 1/2\" long.",
    "Simmer the rind and the lardons for ten minutes in 1 1/2 quarts of water.",
    "Drain and dry the lardons and rind and reserve.",
    "Pre-heat the oven to 450°F.",
    "Put the tablespoon of olive oil in a large (9\" - 10\" wide, 3\" deep) fireproof casserole and warm over moderate heat.",
    "Saute the lardons for 2 to 3 minutes to brown lightly.",
    "Remove to a side dish with a slotted spoon.",
    "Dry off the pieces of beef and saute them, a few at a time in the hot oil/bacon fat until nicely browned on all sides.",
    "Once browned, remove to the side plate with the bacon.",
    "In the same oil/fat, saute the onion and the carrot until softened.",
    "Pour off the fat and return the lardons and the beef to the casserole with the carrots and onion.",
    "Toss the contents of the casserole with the salt and pepper and sprinkle with the flour.",
    "Set the uncovered casserole in the oven for four minutes.",
    "Toss the contents of the casserole again and return to the hot oven for 4 more minutes.",
    "Now, lower the heat to 325°F and remove the casserole from the oven.",
    "Add the wine and enough stock so that the meat is barely covered.",
    "Add the tomato paste, garlic and herbs and the bacon rind.",
    "Bring to a simmer on the top of the stove.",
    "Cover and place in the oven, adjusting the heat so that the liquid simmers very slowly for three to four hours.",
    "The meat is done when a fork pierces it easily.",
    "While the meat is cooking, prepare the onions and mushrooms and set them aside till needed.",
    "For the onion, if using frozen, make sure they are defrosted and drained.",
    "Heat the butter and oil in a large skillet and add the onions to the skillet.",
    "Saute over medium heat for about ten minutes, rolling the onions about so they brown as evenly as possible, without breaking apart.",
    "Pour in the stock, season to taste, add the herbs, and cover.",
    "Simmer over low heat for about 40 to 50 minutes until the onions are perfectly tender but retain their shape and the liquid has mostly evaporated.",
    "Remove the herbs and set the onions aside.",
    "For the mushrooms, heat the butter and oil over high heat in a large skillet.",
    "As soon as the foam begins to subside add the mushrooms and toss and shake the pan for about five minutes.",
    "As soon as they have browned lightly, remove from heat.",
    "To Finish the Stew:.",
    "When the meat is tender, remover the casserole from the oven and empty its contents into a sieve set over a saucepan.",
    "Wash out the casserole and return the beef and bacon to it (discarding the bits of carrot and onion and herbs which remain in the sieve).",
    "Distribute the mushrooms and onions over the meat.",
    "Skim the fat off the sauce and simmer it for a minute or two, skimming off any additional fat which rises to the surface.",
    "You should be left with about 2 1/2 cups of sauce thick enough to coat a spoon lightly.",
    "If the sauce is too thick, add a few tablespoons of stock.",
    "If the sauce is too thin, boil it down to reduce to the right consistency.",
    "Taste for seasoning.",
    "Pour the sauce over the meat and vegetables.",
    "If you are serving immediately, place the covered casserole over medium low heat and simmer 2 to 3 minutes.",
    "Serve in the casserole or on a warm platter surrounded by noodles, potatoes or rice and garnished with fresh parsley.",
    "If serving later or the next day, allow the casserole to cool and place cold, covered casserole in the refrigerator.",
    "20 minutes prior to serving, place over medium low heat and simmer very slowly for ten minutes, occasionally basting the meat and vegetables with the sauce."
  ],
  "ingredients": [
    "0",
    "14 1/2 ounces bacon, solid chunk",
    "2 1/2 tablespoons olive oil",
    "7 1/4 lbs lean stewing beef, cut into 2-inch cubes",
    "2 1/2 carrot, peeled and sliced",
    "2 1/2 onion, peeled and sliced",
    "2 1/2 teaspoons salt",
    "5/8 teaspoon pepper, freshly ground",
    "4 7/8 tablespoons flour",
    "7 1/4 cups red wine (a full bodied wine like Bordeaux or Burgundy or Chianti)",
    "4 7/8-7 1/4 cups beef stock (Simple Beef stock is posted on the site, unsalted and defatted)",
    "2 1/2 tablespoons tomato paste",
    "4 7/8 garlic cloves, mashed (you may choose to add more)",
    "2 1/2 sprigs thyme (or 1/2 teaspoon dred thyme)",
    "2 1/2 bay leaf, preferably fresh",
    "43 1/2-58 white pearl onions, peeled",
    "3 5/8 tablespoons unsalted butter",
    "3 5/8 tablespoons olive oil",
    "1 1/4 cups beef stock",
    "2 1/2 to taste salt & fresh ground pepper",
    "2 1/2 bay leaf",
    "2 1/2 sprigs thyme",
    "4 7/8 sprigs parsley",
    "2 1/2 lbs mushroom, quartered",
    "4 7/8 tablespoons unsalted butter",
    "2 1/2 tablespoons olive oil"
  ],
  "__v": 1
}