{
  "hash": "b1bba31501c7a2026a639d2baaf6671d6160e4c0",
  "title": "Smoky hake, beans & greens",
  "image": "http://www.bbcgoodfood.com/sites/bbcgoodfood.com/files/recipe_images/smoky-hake-beans-greens-with-quick-garlic-mayonnaise.jpg",
  "href": "http://www.bbcgoodfood.com/recipes/smoky-hake-beans-greens",
  "firstAdded": "2015-02-21T19:21:37.858000",
  "users": [
    null
  ],
  "keywords": [
    "mild",
    "olive",
    "oil",
    "pack",
    "raw",
    "cooking",
    "chorizo",
    "used",
    "unearthed",
    "alfresco",
    "smoked",
    "onion",
    "spinach",
    "skinless",
    "hake",
    "fillets",
    "paprika",
    "red",
    "chilli",
    "deseeded",
    "cannellini",
    "beans",
    "juice",
    "lemon",
    "extra",
    "virgin",
    "quick",
    "garlic",
    "mayonnaise",
    "recipe",
    "tip"
  ],
  "directions": [
    "0",
    "Boil a full kettle of water and heat the grill to high. Heat 1 tsp oil in a large frying pan. Squeeze the meat from the chorizo directly into the pan. Add the onion and fry for 5 mins, crushing the meat with a spatula until broken up, golden and surrounded by its juices. The onion will also be soft and golden.",
    "Meanwhile, put the spinach in a colander, slowly pour over the boiled water to wilt it, then run under the cold tap. Squeeze out the excess water using your hands, then set aside. Line a baking tray with foil, rub with a little oil and place the fish on top. Season, sprinkle over the smoked paprika and drizzle with a little more oil.",
    "Tip the chilli into the pan with the sausages, fry for 1 min more, then add the beans, spinach, lemon juice and extra virgin olive oil. Let it warm through gently, then season to taste.",
    "Grill the fish for 5 mins or until flaky but not dry – you won’t need to turn it. Spoon the bean mixture onto plates, then carefully top with the fish and any juices from the tray. Serve with a dollop of Quick garlic mayonnaise (see recipe, right), if you like."
  ],
  "ingredients": [
    "0",
    "mild olive oil",
    "½ x 200g pack raw cooking chorizo (we used Unearthed Alfresco Smoked)",
    "1 onion, finely chopped",
    "260g bag spinach",
    "2 x 140g skinless hake fillets",
    "½ tsp sweet smoked paprika",
    "1 red chilli, deseeded and shredded",
    "400g can cannellini beans, drained",
    "juice ½ lemon",
    "1 tbsp extra virgin olive oil",
    "1",
    "Quick garlic mayonnaise (optional) - see recipe in tip"
  ],
  "__v": 1
}