{
  "__v": 1,
  "directions": [
    "0",
    "Lavate il cavolo e pulitelo eliminando la \"lisca\" centrale. Fate bollire abbondante acqua salata (dove poi cuocerete la pasta) e fate cuocere il cavolo per una decina di minuti. Scolatelo bene e strizzatelo.",
    "Mettete l'olio in un bicchiere da mixer, aggiungete il cavolo, i formaggi, le noci sminuzzate al coltello, i pinoli ed una manciata di sale grosso. Se vi piace, anche il pepe bianco. Con il mixer a immersione, frullate il tutto per breve tempo, senza far scaldare la lama. Mettete da parte.",
    "Cuocete le fettucce nell'acqua in cui avete cotto il cavolo nero. Scolate al dente. Mescolate bene in una grande ciotola con il pesto ed il cucchiaino di limone grattugiato, quindi impiattate e servite. Potete irrorare la pasta con olio e decorare con alcune noci. Il pesto si conserva in barattolo per c.ca una settimana, ovviamente in frigo. O potete congelarlo.",
    "NOTA: contrariamente a quanto si dice, il cavolo nero in pesto non è assolutamente amaro. La presenza dei formaggi e della frutta secca regala morbidezza ed armonizza il tono amarognolo di questa meravigliosa verdura. Il limone da una sferzata di freschezza. Provatelo."
  ],
  "firstAdded": "2014-10-10T11:50:38.144000",
  "hash": "59727859889ea5369a4bb175b2405c5d4020365b",
  "href": "http://www.andantecongusto.it/2012/03/il-mio-primo-gala-fettucce-garofalo-con.html",
  "image": "http://4.bp.blogspot.com/-2_UxBIXvcE0/T0aryisozsI/AAAAAAAABjk/seWo3lVrCCA/s640/PRIMO+PIANO+BELLO.jpg",
  "ingredients": [
    "0",
    "Per il pesto - 4 persone:",
    "300 gr di cavolo nero",
    "i gherigli di 4 noci",
    "50 gr di pinoli",
    "50 gr di parmigiano grattuggiato",
    "50 gr di Pecorino di Pienza stagionato (io ho usato la Riserva Cugusi, meraviglioso pecorino vincitore di molti premi)",
    "un cucchiaino di scorza grattuggiata di un limone non trattato",
    "200 ml di olio extravergine d'oliva (io ho usato quello di Seggiano - Monte Amiata - straordinario)",
    "Sale - pepe bianco fresco a piacere"
  ],
  "keywords": [
    "pesto",
    "persone",
    "cavolo",
    "nero",
    "gherigli",
    "noci",
    "pinoli",
    "parmigiano",
    "grattuggiato",
    "pienza",
    "stagionato",
    "usato",
    "riserva",
    "cugusi",
    "meraviglioso",
    "pecorino",
    "vincitore",
    "molti",
    "premi",
    "cucchiaino",
    "scorza",
    "grattuggiata",
    "limone",
    "non",
    "trattato",
    "olio",
    "extravergine",
    "doliva",
    "quello",
    "seggiano",
    "monte",
    "amiata",
    "straordinario",
    "sale",
    "pepe",
    "bianco",
    "fresco",
    "piacere"
  ],
  "title": "pesto di cavolo nero",
  "users": [
    null
  ]
}