{
  "hash": "70c3f0e941db54a4b5869df919e4e87a7862681c",
  "title": "Healthy Chicken Pot Pie",
  "image": "https://joyfoodsunshine.com/wp-content/uploads/2018/09/healthy-chicken-pot-pie-recipe-7-150x150.jpg",
  "href": "https://joyfoodsunshine.com/healthy-chicken-pot-pie/",
  "extension": "Firefox",
  "firstAdded": "2020-01-27T21:06:57.460000",
  "users": [
    null
  ],
  "ratings": [
    {
      "user": "5d22848eb48cc4080be13431",
      "rating": 5
    }
  ],
  "keywords": [],
  "directions": [
    "0",
    "Make the sauce: In a small bowl, whisk together flour, onion powder, garlic powder, garlic salt and pepper. Add milk and whisk until combined, set aside.",
    "In a 4-quart pan over medium heat, boil water. Add chicken bouillon and whisk until dissolved. Add milk/dry ingredient mixture to boiling water/bouillon. Cook over medium heat, stirring constantly, until thick (about 3 minutes). Remove from heat and set aside.",
    "Make the filling: Preheat oven to 375 degrees F. Grease a deep dish 9” pie plate or cast iron skillet.",
    "In a saucepan, sauté potatoes, and garlic for 5-10 minutes, or until potatoes just begin to brown. Add onion, celery and carrots and sauté until soft (about 10 minutes).",
    "Add peas, corn and shredded chicken and stir to combine.",
    "Pour the sauce into the pan with the filling mixture and stir to combine. Pour the mixture into the prepared 9” pie plate.",
    "Make the biscuit crust: In a large bowl combine whole wheat flour, all-purpose flour, baking soda, baking powder, sugar and salt, stir to combine.",
    "Cut the butter into small pieces than add it to the dry ingredients using a pastry cutter or your hands until you have coarse crumbs.",
    "Add the sour cream, milk and egg and stir to combine. The mixture will be a a bit tacky to the touch. That’s good!",
    "Putting it together: Divide the batter into 6 pieces, and form each piece into a flat round circle. Gently place biscuits on top of the filling in pie dish.",
    "Bake the chicken pot pie on the lower rack in the preheated oven for 30 to 35 minutes, until the biscuits are golden brown and the filling is bubbly. Once the healthy chicken pot pie has finished baking, remove it from the oven and let it cool for 10 minutes before serving."
  ],
  "ingredients": [
    "0",
    "Filling: 2 chicken breasts cooked and shredded (about 4-5 cups)",
    "2 red potatoes diced (about 2 cups)",
    "1 tsp minced garlic",
    "½ small onion diced (about ½ cup)",
    "3 carrots diced",
    "2 ribs of celery diced",
    "½ cup frozen peas",
    "½ cup frozen corn",
    "Salt and freshly ground pepper",
    "Sauce: 2 cups water",
    "2 ½ TBS better than bouillon chicken base",
    "1 ½ cups 2% milk",
    "¾ cup flour",
    "½ tsp onion powder",
    "½ tsp garlic salt",
    "¼ tsp pepper",
    "½ tsp garlic powder",
    "Biscuit Crust: ½ cup whole wheat flour",
    "½ cup all purpose flour",
    "1 ½ tsp. baking powder",
    "½ tsp. baking soda",
    "1 TBS granulated white sugar",
    "¼ tsp salt",
    "1 TBS cold butter",
    "½ cup sour cream or Greek yogurt",
    "¼ cup milk",
    "1 large egg"
  ],
  "__v": 4,
  "rating": 5
}