{
  "__v": 1,
  "directions": [
    "0",
    "Wash and roughly chop the quinces (no need to peel, decore or depip) and place in a heavy bottomed saucepan.",
    "Barely cover with water. Bring to the boil and simmer gently with a lid on until soft. If the quinces are very firm this could take several hours. Check it every now and then and add more water if necessary.",
    "Pour the cooked fruit through sterilised muslin into a large clean bucket or bowl (how do I sterilise muslin/the jelly bag? See tips and tricks below). The muslin is often referred to as a “jelly bag”. We use tall buckets to catch the drips from the jelly bags. Rather than hang the bags (conventional method-between the legs of an upturned stool) I find it easier to line a large plastic sieve with the muslin. This clips neatly onto the top of a clean bucket. The sieve is covered with a clean tea cloth to protect against flies.",
    "Leave the jelly bag to drip overnight (or about 12 hours).",
    "Measure the juice the next day.",
    "Pour the juice into a deep heavy bottomed saucepan and add 1lb/454g of white granulated sugar for each 1pt/570ml of juice.",
    "Add the lemon juice.",
    "Heat the juice and sugar gently stirring from time to time, so as to make sure that that all the sugar has dissolved before bringing the liquid slowly to the boil.",
    "Continue to boil for about 10 minutes before testing for a set. This is called a rolling boil. Test every 3 to 5 minutes until setting point is reached. (What is testing for a set? See tips and tricks below). Tossing in a nugget of butter towards the end will reduce the frothing that can occur.",
    "When jelly has reached setting point pour into warm sterilised jars using a funnel and ladle. (How do I sterilise jars? See tips and tricks below).",
    "Cover immediately with plastic lined screw top lids or waxed disks and cellophane tops secured with a rubber band. If you don’t think that the jelly has set properly, you can reboil it the next day. The boiling reduces the water in the jelly. I have done this in the past. Ideally you should try for the right set the first time.",
    "Label when cold and store in a cool, dark place. Away from damp."
  ],
  "firstAdded": "2014-11-09T17:59:38.164000",
  "hash": "04f8f6f6f81fe9eba7858d0487729f4a0cdb61d7",
  "href": "http://www.cottagesmallholder.com/quince-jelly-recipe-102/",
  "image": "",
  "ingredients": [
    "0",
    "2 lbs of quinces",
    "1 lemon (just the juice, sieved)",
    "white granulated sugar",
    "water to cover"
  ],
  "keywords": [
    "lbs",
    "quinces",
    "lemon",
    "juice",
    "sieved",
    "white",
    "granulated",
    "sugar",
    "water",
    "cover"
  ],
  "title": "Quince Jelly recipe",
  "users": [
    null
  ]
}