{
  "hash": "037683298ff39d3af70a8d05c80ef1414a7af7ed",
  "title": "FUDGE BROWNIES",
  "image": "",
  "href": "http://www.kingarthurflour.com/recipes/fudge-brownies-recipe",
  "extension": "",
  "firstAdded": "2017-07-14T01:43:42.664000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350°F. Lightly grease a 9\" x 13\" pan",
    "Crack the 4 eggs into a bowl, and beat them at medium speed with the cocoa, salt, baking powder, espresso powder, and vanilla for about 4 minutes. You can do this while you're melting your butter (next step).",
    "In a medium-sized microwave-safe bowl, or in a saucepan set over low heat, melt the butter, then add the sugar and stir to combine. Or simply combine the butter and sugar, and heat, stirring, until the butter is melted. Continue to heat (or microwave) briefly, just until the mixture is hot (about 110°F to 120°F), but not bubbling; it'll become shiny looking as you stir it. Heating the mixture to this point will dissolve more of the sugar, which will help produce a shiny top crust on your brownies.",
    "Add the hot butter/sugar mixture to the egg/cocoa mixture, stirring until smooth.",
    "Add the flour and chips, stirring until smooth. Again, adding the chips helps produce a shiny top crust.",
    "Spoon the batter into a lightly greased 9\" x 13\" pan.",
    "Bake the brownies for about 30 minutes, until a cake tester inserted into the center comes out clean, or with just a few moist crumbs clinging to it. The brownies should feel set on the edges, and the center should look very moist, but not uncooked. Remove them from the oven and cool on a rack before cutting and serving."
  ],
  "ingredients": [
    "0",
    "4 large eggs",
    "1 1/4 cups Double-Dutch Dark Cocoa or Dutch-process cocoa",
    "1 teaspoon salt",
    "1 teaspoon baking powder",
    "1 teaspoon espresso powder",
    "1 tablespoon vanilla extract",
    "1 cup (2 sticks) unsalted butter",
    "2 1/4 cups sugar",
    "1 1/2 cups King Arthur Unbleached All-Purpose Flour",
    "2 cups chocolate chips"
  ],
  "__v": 1
}