{
  "hash": "a21f10d8d1f9235bace75799924b85d7ae6b1b1c",
  "title": "Turkish Pide (Turkish Pizza with 2 Different Fillings)",
  "image": "//d2cgumzzqhgmdu.cloudfront.net/assets/small-dd798fdf2451742a7f2a814cbed52a99fedef028b8a1ced99c1e856a2206286c.png",
  "href": "http://littleferrarokitchen.com/2015/09/turkish-pide-turkish-pizza-with-2-different-fillings/",
  "extension": "Chrome",
  "firstAdded": "2017-01-21T17:36:50.542000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "First, make the dough. In a large boxing bowl, add the water salt, yeast and sugar. Mix lightly with a fork to get all the yeast in the water and allow to rest for about 10-12 minutes until the mixture begins to get foamy.",
    "Then add the egg and yogurt and mix to incorporate well. Then using a dough attachment, slowly mix in flour until a ball of dough forms.",
    "Transfer dough onto a lightly floured surface and knead for a few minutes until the dough is smooth and not sticky. Place in a bowl and allow to rest while you make the fillings. At this point, pre-heat the oven to 425 degrees F.",
    "To make the meat filling, add a tablespoon of butter drizzle a bit of olive oil in a large skillet and add chopped meat. Use a spatula to break it up and saute until just about cooked all the way. Then add green peppers and cook for 2-3 minutes, until they begin to soften. Add chopped tomato, grated onion, smoked paprika, Turkish red pepper (or regular red pepper) and tomato paste. Stir everything together and cook on medium-high heat until the liquid evaporates and vegetables are soft. Season with salt and pepper and taste for seasoning. Remove from heat and allow to cool.",
    "To make the cheese filling, in a bowl add ricotta cheese, crumbled feta, olive oil, chopped mint and thyme, lemon zest and salt and pepper. Stir to combine and taste for seasoning.",
    "Once dough has rested and risen to about double its size, cut the dough into 4 equal portions, rolling each into a ball. (2 will be meat filled and 2 will be cheese).",
    "Use a lightly floured rolling pin to roll out one of the dough balls to about a 9 inch long oval and about an 1/8 inch thick (not too thin). Spoon in the meat filling, leaving a border around the pide to fold in. Use your hands to shape it to a long oval shape, crimping the ends. Then gently place on a parchment lined baking sheet.",
    "Brush egg wash over the border and sprinkle with sesame seeds if desired. Use a small spoon to drizzle a bit of egg mixture over the meat mixture. Bake at 425 degrees F for about 15 minutes, or until crust is golden brown.",
    "For the cheese pide, use a spoon to spread the filling, also leaving a border around and pinching the ends in a long oval shape. Brush the border with egg wash and sprinkle with sesame seeds if desired Bake cheese pide for 6-7 minutes first, then remove from oven and use the back of a spoon to make a small well in the center. Add your egg and place back in the oven and continue cooking for another 9-11 minutes or until crust is golden brown and egg is cooked.",
    "When done, allow to cool slightly before cutting. Garnish with extra chopped parley, zaatar and a drizzle of olive oil."
  ],
  "ingredients": [
    "0",
    "2/3 cups warm water",
    "2 cups flour + more for kneading",
    "1 tsp yeast",
    "1/2 tsp sugar",
    "1 egg",
    "1/4 cup full-fat Greek yogurt",
    "Pinch of salt",
    "1/2 lb chopped beef",
    "2 Anaheim peppers",
    "1 large tomato, chopped",
    "1 onion, grated (or chopped very finely)",
    "1 tsp smoked paprika",
    "1/2 tsp Turkish red pepper (or regular red pepper)",
    "1 Tb tomato paste",
    "Salt and pepper, to taste",
    "Olive oil for drizzling",
    "1 Egg + water for egg wash",
    "1 cup full fat ricotta cheese",
    "1/2 cup crumbled feta",
    "1 Tb olive oil",
    "Few sprigs of fresh mint and thyme, leaves removed and chopped",
    "1 Tb lemon zest",
    "Salt and pepper, to taste",
    "1 whole egg per pide (smaller eggs if possible so whites don't pour over)",
    "Chopped parsley",
    "Sesame seeds",
    "Olive oil",
    "Zaatar"
  ],
  "__v": 1
}