{
  "hash": "6d8545ec68c3ee3e5ef0cbd07f34292a68fe98e2",
  "title": "Baked Turkey Zucchini Meatballs",
  "image": "http://bakerbynature.com/wp-content/uploads/2015/07/IMG_4642-2-copy.jpg",
  "href": "http://bakerbynature.com/baked-turkey-zucchini-meatballs/",
  "extension": "Chrome",
  "firstAdded": "2016-06-22T20:28:21.291000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400 degrees (F). Line a large baking sheet with parchment paper; set aside.",
    "In a large bowl combine ground turkey meat, olive oil, minced garlic, eggs, Italian seasoning, salt and pepper, zucchini, and onion. Using your hands mix the meat mixture until the ingredients are evenly combined; the mixture should be very moist but still hold its shape when rolled into balls.",
    "Scoop two tablespoon sized balls of meat from the mix, roll into a firm ball, and place on prepared baking sheet; repeat with remaining meat.",
    "Place the baking sheet in the oven to bake for 20-25 minutes, or until they're evenly brown and cooked though.",
    "While the meatballs bake, make your marinara!",
    "Warm the oil in a large saucepan over medium-heat. Add in the garlic and sauté for one minute, or until the garlic is just golden (careful not to burn it here) and fragrant. Add the crushed tomatoes, salt, pepper, sugar, seasoning and crushed red pepper flakes, mix well to combine. Simmer the sauce for 15 minutes, stirring occasionally. Season with additional salt and pepper to taste.",
    "When meatballs are done baking, add them to the sauce, stir to coat, and serve."
  ],
  "ingredients": [
    "0",
    "For the Meatballs:",
    "2 pounds ground turkey meat (ground beef will work too!)",
    "1 tablespoon olive oil",
    "3 cloves of garlic, minced",
    "2 large eggs",
    "3 1/2 teaspoons Italian seasoning",
    "Salt and ground black pepper, to taste (I suggest starting with 1 and 1/4 teaspoons of salt and 1/2 teaspoon of black pepper)",
    "2 cups zucchini, finely grated and drained (it will look more like 1 cup once it's been drained of excess liquid; see post if you need more clarity on this)",
    "1 small red onion, grated",
    "For the sauce:",
    "3 tablespoons olive oil",
    "3 cloves garlic, minced",
    "1 (28-ounce) can crushed tomatoes",
    "1 teaspoon salt",
    "1/2 teaspoon black pepper",
    "1/2 teaspoon sugar",
    "2 teaspoons Italian seasoning",
    "1/2 teaspoon crushed red pepper flakes"
  ],
  "__v": 1
}