{
  "hash": "04a3f8e7785eab28c46b56d4167499e4769e6f00",
  "title": "Endive, Pear, and Roquefort Salad",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/ina-garten/endive-pear-and-roquefort-salad-recipe3.html",
  "firstAdded": "2014-12-12T20:23:51.750000",
  "users": [
    null
  ],
  "keywords": [
    "heads",
    "belgian",
    "endive",
    "champagne",
    "white",
    "wine",
    "vinegar",
    "dijon",
    "mustard",
    "egg",
    "yolk",
    "room",
    "kosher",
    "salt",
    "black",
    "pepper",
    "good",
    "olive",
    "oil",
    "bartlett",
    "pears",
    "cored",
    "roquefort",
    "cheese",
    "walnut",
    "halves"
  ],
  "directions": [
    "0",
    "Trim off the core end of each head of endive and slice it in half lengthwise. Cut out the cores, separate the leaves, and place 1 1/2 to 2 heads of endive on each plate.",
    "In a medium bowl, whisk together the vinegar, mustard, egg yolk, salt, and pepper. Slowly whisk in the olive oil to make an emulsion. Toss the pears with some vinaigrette and place on the endive. Drizzle the remaining vinaigrette over the endive leaves to moisten them. Crumble the Roquefort onto the endive. Sprinkle with walnuts and serve at room temperature.",
    "Contains Raw Eggs: The Food Network Kitchen suggest caution in consuming raw and lightly cooked eggs due to the slight risk of salmonella or other food-borne illness. To reduce this risk, we recommend you use only fresh, properly refrigerated, clean grade A or AA eggs with intact shells, and avoid contact between the yolks or whites and the shell. For recipes that call for eggs that are raw or undercooked when the dish is served, use shell eggs that have been treated to destroy salmonella, by pasteurization or another approved method.",
    "Copyright 2004, Barefoot in Paris, All Rights Reserved"
  ],
  "ingredients": [
    "0",
    "4 to 6 heads of Belgian endive",
    "1 1/2 tablespoons Champagne vinegar or white wine vinegar",
    "3/4 teaspoon Dijon mustard",
    "*1 egg yolk, at room temperature",
    "3/4 teaspoon kosher salt",
    "1/2 teaspoon freshly ground black pepper",
    "6 tablespoons good olive oil",
    "2 ripe Bartlett pears, halved, cored, and sliced",
    "1/4 pound good Roquefort cheese",
    "1/2 cup toasted walnut halves"
  ],
  "__v": 1
}