{
  "__v": 1,
  "directions": [
    "0",
    "Iniziamo subito con la cottura delle penne rigate, appena l'acqua bolle le mettete in pentola",
    "Adesso prendiamo la pancetta e la tagliamo a dadini, la potete anche trovare nelle confezioni ci sono ottime marche",
    "Adesso prendiamo una padella e mettiamo la pancetta, aggiungiamo un filo di olio extravergine di oliva, se vi piace cucinare comprate le latte da 5 kg, direttamente dal frantoio,mai e mai marche publicizzate e nemmeno quello che ve lo portano a casa, usano olive greche e spagnole e di italiano non ce niente, parte la marca. andate in internet e cercate frantoi liguri toscani umbri, e vedrete la differenza io uso un olio sardo fruttato sempre extravergine e vi assicuro che e ottimo e pieno di antiossidanti.",
    "Tagliata la pancetta la mettiamo in una padella con un filo di olio, e lasciamo rosolare",
    "Appena l'acqua bolle mettete giu' le penne",
    "Spelate la salciccia e la mettete nella pentola e la rompiamo con una forchetta, abbassando il fuoco.",
    "In una terrina mettete le uova le sbattete con una forchetta e aggiungete del pecorino mescolate molto bene e aggiungete due grattate di noce moscata.",
    "la pasta sarà a metà cottura, la prendete e la mettete nella padella, a me piace così perchè assorbirà tutti i sapori.",
    "Aggiungete acqua di cottura e continuate a cuocerla e vedrete che così diventerà piu buona",
    "Appena al dente spegnete il fuoco",
    "La prendete e la mettete nella terrina con l'uovo, mescolate bene e veloci, se vedrete che rimane licquida la rimettete nella padella a cuocere un secondo facendola asciugare solo un pò, per questo si chiama pasta strascinata, ora andiamo impiattare mettendo ancora una grattugiata di pecorino"
  ],
  "firstAdded": "2014-10-08T14:21:37.411000",
  "hash": "abb8adb81f82c3ef2fbfb2d54452931bd34a3729",
  "href": "http://blog.libero.it/Cucina911/commenti.php?msgid=12851627",
  "image": "http://blog.libero.it/blog/pics/area/logo_1014.jpg",
  "ingredients": [
    "0",
    "500 gr di penne rigate (io uso solo barilla)",
    "3 uova",
    "2 salcicce",
    "3 fette di pancetta tesa non affumicata",
    "Noce moscata",
    "Pecorino",
    "Sale e pepe"
  ],
  "keywords": [
    "penne",
    "rigate",
    "uso",
    "solo",
    "barilla",
    "uova",
    "salcicce",
    "fette",
    "pancetta",
    "tesa",
    "non",
    "affumicata",
    "noce",
    "moscata",
    "pecorino",
    "sale",
    "pepe"
  ],
  "title": "PENNE STRASCINATE ( Umbria )",
  "users": [
    null
  ]
}