{
  "hash": "2de1d13add06f70062767aa426af3f807ca36d3a",
  "title": "CHINESE SPRING ROLLS WITH CHICKEN RECIPE",
  "image": "",
  "href": "http://steamykitchen.com/22276-chinese-spring-rolls-with-chicken-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-02-24T16:04:56.950000",
  "users": [
    null
  ],
  "keywords": [
    "soy",
    "rice",
    "white",
    "wine",
    "black",
    "pepper",
    "cornstarch",
    "chicken",
    "cooking",
    "oil",
    "divided",
    "garlic",
    "ginger",
    "stalk",
    "green",
    "onion",
    "head",
    "cabbage",
    "carrots",
    "julienne",
    "oyster",
    "water",
    "spring",
    "roll",
    "wrappers",
    "defrosted",
    "deep",
    "frying",
    "directions"
  ],
  "directions": [
    "0",
    "DIRECTIONS:",
    "1. In a large bowl, combine the soy sauce, wine, pepper and cornstarch. Add in the chicken and mix well. Let marinate for 10 minutes (or up to overnight in the refrigerator).",
    "2. Heat a wok or large saute pan over high heat. When hot, swirl in just 1 tablespoon of the cooking oil. Stir fry the ground chicken until browned. Remove browned ground chicken from wok to a bowl and set aside.",
    "3. Wipe the wok clean and turn heat to medium. When just starting to get hot, swirl in the remaining cooking oil. Add in the green onion, garlic and ginger and cook for 30 seconds. Take care not to burn these aromatics. Add in the carrots and cabbage. Stir well and turn the heat to medium-high. Stir fry the vegetables for 2 minutes, or until the carrots have softened. Add the cooked chicken back into the wok, stir well. Add in the oyster sauce and toss again. Spread the mixture out on a baking sheet to let cool. Prop up the baking sheet on one end so that any liquid collects on the other side. When the mixture is cool, discard the liquid.",
    "4. In a small bowl, whisk together the cornstarch and water. This is your slurry. Open the egg roll wrapper package, cover with barely damp towel to prevent drying out.",
    "5. Add 1 tablespoon of filling to egg roll (see photos for instructions) and roll up. Secure with cornstarch slurry. Keep rolled egg rolls covered with plastic wrap to prevent drying.",
    "6. When ready to fry, heat 1 1/2\" of oil in a wok or deep, heavy skillet to 350F (see tip in photos if you don't have thermometer). Carefully slide in the egg rolls, a few at a time, to the oil to fry. Turn the egg rolls occassionally to brown evenly and fry for about 3 minutes. Let cool on rack. Repeat with remaining."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS:",
    "1 tablespoon soy sauce",
    "1 teaspoon rice wine (or white wine)",
    "freshly ground black pepper",
    "1 teaspoon cornstarch",
    "1 pound ground chicken",
    "2 tablespoons cooking oil, divided",
    "2 cloves garlic, finely minced",
    "1 teaspoon grated fresh ginger",
    "1 stalk green onion, chopped",
    "1/2 head of small cabbage (about 8 ounces), shredded",
    "2 carrots, thin julienne cut",
    "2 tablespoons oyster sauce",
    "1 tablespoon cornstarch",
    "1/4 cup water",
    "50 spring roll wrappers, defrosted",
    "oil, for deep frying (about 1/2 liter to 1 liter)",
    "DIRECTIONS:"
  ],
  "__v": 1
}