{
  "hash": "a890efdf359c1fbd748dfbf7a94e49ee13d287b4",
  "title": "INSTANT POT LASAGNA",
  "image": "",
  "href": "https://www.pressurecookrecipes.com/instant-pot-lasagna/",
  "extension": "Chrome",
  "firstAdded": "2019-03-09T20:00:01.031000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Create Ricotta Cheese Mixture: In a mixing bowl, beat one large egg, then add in ¾ cup (200g) Ricotta cheese. Season with 1 tsp (1g) Italian seasoning, ground black pepper, and ⅓ tsp kosher salt.",
    "Assemble Instant Pot Lasagna: Line a 7-inch springform pan with cut-out parchment paper (optional). Break the uncooked oven-ready lasagna noodles into smaller pieces, then layer them at bottom of the pan in a single layer. Layer ⅓ portion of the meat sauce on the lasagna noodles. Layer Ricotta cheese mixture on the meat sauce, then add shredded mozzarella cheese on top. Repeat this layering cycle twice. Add ¼ cup (30g - 40g) freshly grated Parmesan cheese on the very top. Then, wrap the springform pan tightly with aluminum foil.",
    "Pressure Cook Lasagna: Pour 1 cup (250ml) cold water, then place a trivet in Instant Pot. Create a sling foil, then place springform pan in Instant Pot. Close lid, then pressure cook at High Pressure for 24 minutes + 10 minutes Natural Release.",
    "Optional Broil Lasagna: Preheat oven to 425°F when Instant Pot is natural releasing. Place the cooked lasagna in a 425°F oven until the cheese is browned on top (~7 - 9 mins).",
    "Serve: For an easier release, use a paring knife to gently release the Lasagna from the springform pan. Slice the glorious lasagna and serve immediately. Enjoy~ 🙂"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "8 (160g - 200g) oven-ready lasagna noodles",
    "2 cups (150g - 180g) Mozzarella cheese , shredded in large pieces",
    "¼ cup (30g - 40g) Parmesan cheese , grated",
    "2.5 - 3 cups (600g - 750g) meat sauce",
    "Salt + pepper to taste",
    "Ricotta Cheese Mixture",
    "¾ cup (200g) Ricotta cheese",
    "1 teaspoon (1g) Italian seasoning",
    "1 large egg",
    "⅓ teaspoon kosher salt"
  ],
  "__v": 1
}