{
  "hash": "ac1e0975861b105d3f37f5ceebdf61e4ea00b41a",
  "title": "ZOETE AARDAPPEL LASAGNE",
  "image": "http://fitbeauty.nl/wp-content/uploads/2016/10/recept-zoete-aardappel-lasagne-23.jpg",
  "href": "http://fitbeauty.nl/recept-zoete-aardappel-lasagne/",
  "extension": "Chrome",
  "firstAdded": "2016-10-05T17:21:08.408000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Verwarm de oven vast voor op 180 graden Celsius",
    "Ik heb bij dit recept gebruik gemaakt van een bakblik in plaats van een ovenschaal. Omdat ik deze voor de hand had liggen.",
    "Schil de zoete aardappel en snijd deze in dunne plakken, leg ze apart op een bord",
    "Tijd om de tomatensaus te maken, ik heb allerlei verschillende tomaten zoals je ziet.",
    "Verhit wat olie in een hapjespan, snijd de tomaten in blokjes en doe ze in de pan. Doe vervolgens alle kruiden die je wilt erbij. Van knoflookpoeder tot Italiaanse kruiden tot peper, zout en paprikapoeder. Laat het geheel lekker intrekken op een laag vuurtje voor zo’n 7-8 minuten.",
    "Snijd de wortel in blokjes en voeg dit ook toe",
    "Na een paar minuten kun je de courgette, in blokjes, toevoegen",
    "En weer een paar minuten later de spinazie",
    "Omdat ik de saus wat dikker wilde, heb ik er een blikje tomatenpuree aan toegevoegd",
    "De plakjes ham in reepjes snijden",
    "En toevoegen aan het geheel",
    "Vervolgens kan de melk erbij en laat je het mengsel op een laag vuurtje wat ‘indikken’. Bij mij duurde dit zo’n 6 minuten tot ik tevreden was met de dikheid.",
    "Nu kan alles bij elkaar in laagjes! Ik begin met een laagje zoete aardappel, daarna een laagje saus",
    "Stapelen tot de top",
    "Bestrooien met wat geraspte kaas, en dan de oven in voor minstens 30 minuten. Die van mij heeft er 45 minuten in gezeten!",
    "En tijd om te eten! Hmmm.."
  ],
  "ingredients": [
    "0",
    "Dus wat heb je nodig voor een ovenschaal zoete aardappel lasagne?",
    "1 grote zoete aardappel (400-500 gram)",
    "(cherry)tomaten 700-800 gram",
    "spinazie 100 gram",
    "wortel 250 gram",
    "courgette 250 gram",
    "geraspte kaas 30 gram",
    "(plantaardige) melk 100 – 150 ml",
    "ham, broodbeleg 4-5 plakjes",
    "tomatenpuree 1 klein blikje",
    "zout, peper, paprikapoeder, knoflookpoeder, Italiaanse kruiden",
    "olie om in te bakken en de ovenschaal / bakblik mee in te vetten"
  ],
  "__v": 1
}