{
  "hash": "fc72d814fdb4b1e4a2205705ffc512cf8ee8820a",
  "title": "Lasagna alla Vodka",
  "image": "http://del.h-cdn.co/assets/16/40/640x959/gallery-1475597610-delish-skillet-vodka-lasagna-pin-1.jpg",
  "href": "http://www.delish.com/cooking/recipe-ideas/recipes/a49513/lasagna-alla-vodka-skillet-recipe/?zoomable",
  "extension": "Chrome",
  "firstAdded": "2017-04-06T22:00:44.677000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "Make sauce: Heat olive oil in a medium saucepan over medium heat. Add onion and sauté until soft. Stir in garlic and cook until fragrant. Add tomatoes and vodka and simmer for 5 minutes to let the alcohol cook off. Stir in red pepper flakes and season with salt and pepper. Stir in heavy cream and remove from heat.",
    "Grease a large skillet with cooking spray or olive oil and place skillet over the burner on the stovetop.",
    "Assemble the lasagna: Spoon a thin layer of sauce into skillet for the bottom layer. Add 4 lasagna noodles, cutting the noodles to fit the bottom of the pan if necessary. Spread 1 cup ricotta over the noodles. Sprinkle with half of spinach and 1/2 cup mozzarella. Pour another thin layer of sauce on top and repeat layering process. For the final layer, lay down four more lasagna noodles, spread another layer of sauce on top and sprinkle with remaining mozzarella.",
    "Cover skillet with a large lid. Cook on medium-low until cheese is melted, about 15 minutes. Uncover the pan and cook 5 to 10 minutes more.",
    "Turn off heat and let the lasagna rest in pan about 5 minutes before slicing. Garnish with parsley and serve warm."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1 tbsp. extra-virgin olive oil",
    "1 Onion, finely chopped",
    "2 garlic cloves, minced",
    "Pinch crushed red pepper flakes",
    "1 28-oz. can crushed tomatoes",
    "1/3 c. vodka",
    "1/2 c. heavy cream",
    "kosher salt",
    "Freshly ground black pepper",
    "12 cooked lasagna noodles",
    "2 c. ricotta",
    "1 1/2 c. shredded mozzarella",
    "10 oz. frozen chopped spinach, defrosted and drained",
    "2 tbsp. Chopped flat-leaf parsley"
  ],
  "__v": 1
}