{
  "hash": "5380c9f6722af4d6fe2c3d0737d4f987d914e25e",
  "title": "Zlatý kuřecí vývar",
  "image": "",
  "href": "http://www.menudomu.cz/zlaty-kureci-vyvar/",
  "extension": "Chrome",
  "firstAdded": "2015-12-08T09:20:14.498000",
  "users": [
    null
  ],
  "keywords": [
    "ingredience",
    "litru",
    "vvaru",
    "skelet",
    "odezky",
    "kuete",
    "vody",
    "men",
    "mrkev",
    "kousek",
    "celeru",
    "velk",
    "apk",
    "cibule",
    "cel",
    "ern",
    "pep",
    "bobkov",
    "list",
    "erstv",
    "bylinky",
    "tymin",
    "saturejka",
    "estragon",
    "nebo",
    "rozmarn",
    "polvky",
    "pak",
    "petrelka",
    "hrek",
    "mrkve",
    "nudle",
    "tstovinov",
    "obran",
    "maso"
  ],
  "directions": [
    "0",
    "Pro tmavší kuřecí vývar všechnu zeleninu nejdřív orestujte. Jinak vložte všechny ingredience na vývar do papiňáku, uzavřete a vařte 30 minut (to je opravdu doba varu… prvních deset minut ohřívání uvnitř nepočítám). Pokud tlakový hrnec nemáte, v tom případě to chce velký hrnec s dobře těsnící pokličkou a vařit tak 75-90 minut. Sketet před tím umyjte, mrkev, celer, řapík i cibuli oloupejte, pokrájejte vždy na 2-3 kusy. Soli dejte 2 čajové lžičky, kdyžtak dochutíte pak. Po uvaření oberte maso (mělo by odpadat od kostí, pokud ne, vařte déle). Přeceďte a zeleninu vyhoďte. Ta už posloužila. Do samotné polévky to chce dát čertvou mrkev, na drobnější kousky, ale i tak se ve vývaru bude 10-15 minut vařit. Pokud nechcete, aby těstoviny vývar lehce zakalily, uvařte je v jiném hrnci normálně ve vodě ke konci varu vývaru, přeceďte a až uvařené je do něho přidejte. No a pak to chce jendochutit solí a pepřem a na poslední chvíli přidat na prohřátí zmražený hrášek a nasekanou petrželku. :)",
    "Jako od maminky!!!"
  ],
  "ingredients": [
    "0",
    "Ingredience na 1,5 litru vývaru:",
    "skelet a odřezky z 1 kuřete",
    "2 l vody",
    "1 menší mrkev",
    "kousek celeru",
    "1 velký řapík celeru + nať",
    "cibule",
    "sůl",
    "celý černý pepř",
    "bobkový list",
    "čerstvé bylinky (tymián, saturejka, estragon nebo rozmarýn)",
    "a do polévky pak:",
    "petrželka",
    "hrášek",
    "1/2 mrkve",
    "nudle nebo těstovinová rýže",
    "obrané maso",
    "sůl a pepř"
  ],
  "__v": 1
}