{
  "hash": "7c9faa399b0734ce9ce37ca404335a8d64ce1fe8",
  "title": "Stuffed Pepper Soup",
  "image": "http://www.cookingclassy.com/wp-content/uploads/2014/09/stuffed-pepper-soup3-srgb..jpg",
  "href": "http://www.cookingclassy.com/2014/09/stuffed-pepper-soup/",
  "extension": "Chrome",
  "firstAdded": "2015-09-14T22:29:18.057000",
  "users": [
    null
  ],
  "keywords": [
    "lean",
    "beef",
    "olive",
    "oil",
    "divided",
    "salt",
    "black",
    "pepper",
    "yellow",
    "onion",
    "red",
    "bell",
    "medium",
    "green",
    "garlic",
    "petite",
    "tomatoes",
    "tomato",
    "broth",
    "parsley",
    "basil",
    "oregano",
    "uncooked",
    "long",
    "white",
    "brown",
    "rice",
    "ive",
    "tried",
    "cheddar",
    "mozzarella",
    "cheese"
  ],
  "directions": [
    "0",
    "In a large pot heat 1 Tbsp olive oil over medium heat, once hot add beef to pot and season with salt and pepper. Cook, stirring occasionally while breaking up beef, until browned. Drain beef and pour onto a plate lined with paper towels, set aside.",
    "Heat remaining 1 Tbsp olive oil in pot then add onions, red bell pepper, green bell pepper and saute 3 minutes, then add garlic and saute 30 seconds longer. Pour in diced tomatoes, tomato sauce, beef broth and add parsley, basil, oregano and cooked beef, then season with salt and pepper to taste. Bring just to a light boil, then reduce heat to low, cover and simmer, stirring occasionally, 30 minutes.",
    "While soup simmers, prepare rice according to directions listed on package, then once soup is done simmering stir in desired amount of cooked rice into soup*. Serve warm topped with optional cheese and garnish with fresh parsley.",
    "*For a thinner soup don't add all of the rice and for a thicker heartier soup add it all. Also, if you plan on having it for leftovers the next day then don't add the rice to the pot of soup, just add it to each individual bowl, then reserve the rice in a separate container in refrigerator to add to the soup the next day (otherwise it would turn into mush).",
    "Recipe Source: inspired by this recipe on allrecipes"
  ],
  "ingredients": [
    "0",
    "1 lb lean ground beef",
    "2 Tbsp olive oil, divided",
    "Salt and freshly ground black pepper",
    "1 small yellow onion chopped (1 cup)",
    "3/4 cup chopped red bell pepper (a little over 1/2 of a medium)",
    "3/4 cup chopped green bell pepper",
    "2 cloves garlic, minced",
    "2 (14.5 oz) cans petite diced tomatoes",
    "1 (15 oz) can tomato sauce",
    "1 (14.5) can beef broth",
    "2 1/2 Tbsp chopped fresh parsley, plus more for garnish",
    "1/2 tsp dried basil",
    "1/4 tsp dried oregano",
    "1 cup uncooked long grain white or brown rice (I've tried and like both)",
    "Cheddar or mozzarella cheese, for serving (optional)"
  ],
  "__v": 1
}