{
  "hash": "8e43b58a37db233d3d22d9a82341a4ca689be9a4",
  "title": "Italian Pork Ribs with Olives (Rosticciana di Maiale e Olive)",
  "image": "",
  "href": "https://www.daringgourmet.com/italian-pork-ribs-with-olives-rosticciana-di-maiale-e-olive/",
  "extension": "Firefox",
  "firstAdded": "2019-12-12T17:06:41.944000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Sprinkle both sides of the rack of ribs with salt and freshly ground black pepper. Slice into individual ribs.",
    "Heat the oil in alarge Dutch oven over medium-high heat. Once the oil is good and hot add the ribs, being careful not to overcrowd or they won't brown, and brown them generously on all sides, working in batches. Transfer the ribs to a plate and set aside.",
    "Add the onions and cook until starting to lightly brown, 8-10 minutes. Add the garlic, rosemary and sage and cook for another minute or two.",
    "Return the ribs to the Dutch oven. Add the red wine and bring it to a rapid boil. Reduce the heat to a moderate boil and continue to boil for 3-4 minutes until the alcohol evaporates and the amount of liquid is slightly reduced.",
    "Add the crushed tomatoes, tomato sauce, tomato puree, bay leaves, salt and pepper. Give everything a few good stirs to combine. Bring it to a boil, reduce the heat to low, cover and simmer for 3-3½ hours or until the pork is fork tender. Stir in the olives and simmer for another 3-4 minutes. Add salt and pepper to taste.",
    "During the final 15 minutes of the ribs cooking, make the polenta: Add the milk and water to a medium stock pot and bring it a boil. Gradually pour in the cornmeal, constantly whisking to prevent lumps. Reduce the heat to low and continue to whisk regularly. If using regular coarse cornmeal it will take 15 minutes or so. Add the butter and stir to combine. You want to have this ready right before serving while it's hot and tender.",
    "Dish up the polenta onto individual plates and top with some ribs and sauce. Serve immediately with some fresh rosemary for garnishing.",
    "Make the Polenta during the final 15 minutes the ribs are cooking: Bring the milk, water and salt to a boil in a large heavy saucepan over medium-high heat. Gradually pour in the cornmeal, whisking constantly to prevent lumps. Reduce the heat to low and simmer for about 15 minutes, stirring regularly. Time this to be done just before serving while it's hot and tender."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "3 pounds baby back pork ribs or country style ribs (if using baby back ribs be sure to remove the membrane on the back), sprinkled with salt and freshly ground black pepper and sliced into individual ribs.",
    "3 tablespoons high heat cooking oil (I use and recommend avocado oil)",
    "1 yellow onion, chopped",
    "2 cloves garlic, minced",
    "1 large sprig fresh rosemary",
    "2 fresh sage leaves",
    "¾ cup dry red wine",
    "1 cup crushed canned tomatoes",
    "1 cup Bertolli Riserva Porcini Mushrooms & White Truffle Oil Sauce (or tomato sauce of choice)",
    "2 tablespoons tomato paste",
    "2 bay leaves",
    "½ teaspoon salt",
    "¼ teaspoon freshly ground black pepper",
    "½ cup sliced black olives",
    "For the Creamy Polenta (Paleo: spaghetti squash is a great alternative):",
    "2½ cups whole milk",
    "2 cups water",
    "1 teaspoon salt",
    "1 cup coarse ground cornmeal"
  ],
  "__v": 1
}