{
  "hash": "d93522a087f7e60e40fe5c472294562d1df72f4a",
  "title": "fajita-style chicken chili\nFajitas without the fuss! Simply sear chicken breasts, then top with vegetables and beans before slow cooking.",
  "image": "http://www.recipe.com/images/fajita-style-chicken-chili-ss.jpg",
  "href": "http://www.recipe.com/fajita-style-chicken-chili/",
  "extension": "Chrome",
  "firstAdded": "2015-10-06T12:39:22.393000",
  "users": [
    null
  ],
  "keywords": [
    "canola",
    "oil",
    "boneless",
    "skinless",
    "chicken",
    "breasts",
    "diagonally",
    "onions",
    "slices",
    "red",
    "peppers",
    "seeded",
    "inchthick",
    "pink",
    "beans",
    "rinsed",
    "tomatoes",
    "chili",
    "cumin",
    "oregano",
    "salt",
    "cheddar",
    "sour",
    "cream",
    "guacamole",
    "flour",
    "tortillas"
  ],
  "directions": [
    "0",
    "Coat slow cooker bowl with nonstick cooking spray.",
    "2.",
    "In a large nonstick skillet, heat oil over medium-high heat. Add chicken and cook 6 minutes, until lightly browned. Cook in 2 batches, if necessary.",
    "3.",
    "In slow cooker bowl, layer onions, peppers, cooked chicken and beans. Combine tomatoes, chili powder, cumin, oregano and salt. Pour over beans.",
    "4.",
    "Cover and cook on HIGH for 3 hours or LOW for 6 hours.",
    "5.",
    "Serve with shredded cheddar, sour cream, guacamole and flour tortillas, if using.",
    "Tip",
    "For easy cleanup:",
    "Line your slow cooker with a disposable slow cooker liner. Add ingredients as directed in recipe. Once your dish is finished cooking, spoon the food out of your slow cooker and simply dispose of the liner. Do not lift or transport the disposable liner with food inside.",
    "NUTRITION INFORMATION",
    "Per Serving: cal. (kcal) 353, Fat, total (g) 8, chol. (mg) 104, sat. fat (g) 2, carb. (g) 24, fiber (g) 8, pro. (g) 44, sodium (mg) 920, Percent Daily Values are based on a 2,000 calorie diet"
  ],
  "ingredients": [
    "0",
    "1 tablespoon canola oil",
    "2 1/2 pounds boneless, skinless chicken breasts, thinly sliced diagonally",
    "2 large onions, cut into 1/4-inch slices",
    "2 large sweet red peppers, seeded and cut into 1/4-inch-thick slices",
    "1 can (15 1/2 oz) pink beans, drained and rinsed",
    "2 cans (14 1/2 oz each) diced tomatoes",
    "2 tablespoons chili powder",
    "1 teaspoon ground cumin",
    "1 teaspoon dried oregano",
    "1 teaspoon salt",
    "Shredded cheddar, sour cream, guacamole and flour tortillas (optional)"
  ],
  "__v": 1
}