{
  "hash": "96ce04d590683cbab6b9b9100b65694cca639c1d",
  "title": "Cocoa Black Bean Chili with Roasted Potatoes",
  "image": "http://thevegan8.com/wp-content/uploads/2015/03/cocoablackbeanchili3-1-of-1.jpg",
  "href": "http://thevegan8.com/2015/03/12/cocoa-black-bean-chili/",
  "extension": "",
  "firstAdded": "2015-12-14T19:32:14.398000",
  "users": [
    null
  ],
  "keywords": [
    "red",
    "potatoes",
    "cubes",
    "salt",
    "pepper",
    "white",
    "medium",
    "onion",
    "bell",
    "huge",
    "use",
    "water",
    "need",
    "tomato",
    "pureesauce",
    "added",
    "chili",
    "increase",
    "really",
    "spicy",
    "cocoa",
    "smoked",
    "paprika",
    "smoky",
    "flavor",
    "desired",
    "saltfree",
    "black",
    "beans",
    "rinsed",
    "corn",
    "used",
    "frozen",
    "toppings",
    "avocado",
    "tomatoes"
  ],
  "directions": [
    "0",
    "Preheat an oven to 415 degrees and line a sheet pan with parchment paper.",
    "Chop your potatoes and spread out on the pan evenly. Sprinkle generously with salt and pepper. Bake for 15-20 minutes until very golden brown.",
    "While the potatoes are cooking, prepare the chili. Add the onion, bell pepper, water and salt to a large pot and bring to a boil. Once boiling, turn to medium-high and cook for 8 minutes.",
    "Add the tomato sauce, chili powder, cocoa powder and smoked paprika (if using) and turn the heat down to medium-low and cook for another 5 minutes. If needed, add a touch more broth if it has cooked down too much.",
    "Add the drained beans and corn and cook another 5 minutes. Taste and add any salt/spices if necessary.",
    "Garnish with avocado, red pepper flakes or anything you like. Serve immediately."
  ],
  "ingredients": [
    "0",
    "8 small red potatoes (560 g) chopped into ½ inch cubes",
    "Salt and pepper",
    "1",
    "1½ cups finely chopped white onion (200 g, 1 medium onion)",
    "1 large red bell pepper, chopped (mine was huge, so use 2 if yours are small)",
    "3 cups water",
    "1½ teaspoons fine sea salt (you may need more if your tomato sauce has no salt)",
    "1 cup tomato puree/sauce (mine has salt added)",
    "1½ tablespoons chili powder (increase to 2 for really spicy)",
    "2 tablespoons unsweetened cocoa powder",
    "Optional: 1 teaspoon smoked paprika (for a smoky flavor if desired)",
    "3 15 oz cans salt-free black beans, drained and rinsed",
    "1 cup corn (135 g, I used frozen)",
    "Optional toppings: chopped avocado, red pepper flakes, tomatoes"
  ],
  "__v": 1
}