{
  "__v": 3,
  "directions": [
    "0",
    "Boil water in a large pot for the noodles. If using the lo mein egg noodles, you can skip this step, as those noodles do not require any pre-cooking. But if using fresh white noodles, you will have to boil them. Just cook until al dente, drain, and rinse in cold water. Set aside.",
    "In a small bowl, combine the soy sauces, sesame oil, dissolved sugar, and five spice powder if using. Heat oil in a wok over high heat and add the garlic, mushrooms, and the white parts of the scallions. Stir-fry for 30 seconds and add the peppers and carrots. Make sure your hot is searing hot, and then hit it with the shaoxing wine. Stir fry for another minute.",
    "Next, add the snow peas and leafy greens to the wok and cook until the greens are just wilted. Then add your noodles. Make sure that before you add them to the pan, they're somewhat loose and not all clumped together (you can rinse them in warm water to loosen them up before adding them to the pan).",
    "Pour your sauce mixture over the noodles and stir-fry until the color of the noodles are uniform. A folding or scoop and lift motion works well for that. Once everything is well-combined, dish out the noodles and serve."
  ],
  "firstAdded": "2014-10-01T06:49:14.556000",
  "hash": "758f92e90de337df0d6d5d0d496bdbf506fd83ab",
  "href": "http://thewoksoflife.com/2014/09/vegetable-lo-mein/",
  "image": "http://thewoksoflife.com/wp-content/uploads/2014/09/vegetable-lo-mein-5.jpg",
  "ingredients": [
    "0",
    "1 pound (450g) fresh white noodles or lo mein egg noodles",
    "1 tablespoon dark soy sauce",
    "2 tablespoons light soy sauce",
    "1 teaspoon sesame oil",
    "1 teaspoon sugar + 1 teaspoon hot water to dissolve the sugar in",
    "pinch of five spice powder (optional)",
    "1 tablespoon oil",
    "1 clove garlic, minced",
    "1 cup sliced mushrooms (shiitakes, button mushrooms, or anything you like)",
    "1 scallion, split at the thick parts and cut into 2-inch lengths",
    "1 red, orange, or yellow bell pepper, julienned",
    "1 small carrot, julienned",
    "1 tablespoon Shaoxing wine",
    "a handful snow peas, trimmed",
    "a handful of leafy greens (bok choy, choy sum, etc.)"
  ],
  "keywords": [
    "white",
    "mein",
    "egg",
    "noodles",
    "dark",
    "soy",
    "light",
    "sesame",
    "oil",
    "hot",
    "water",
    "dissolve",
    "sugar",
    "spice",
    "clove",
    "garlic",
    "shiitakes",
    "button",
    "mushrooms",
    "scallion",
    "split",
    "parts",
    "lengths",
    "red",
    "orange",
    "yellow",
    "bell",
    "pepper",
    "julienned",
    "carrot",
    "shaoxing",
    "wine",
    "snow",
    "peas",
    "trimmed",
    "leafy",
    "greens",
    "bok",
    "choy",
    "sum"
  ],
  "title": "Vegetable Lo Mein",
  "users": [
    null,
    null,
    null
  ]
}