{
  "hash": "b6dedc87e0baa53df38bdeca6ae94fdb58f72050",
  "title": "NO-KNEAD FOCACCIA",
  "image": "https://www.budgetbytes.com/wp-content/uploads/2011/04/Focaccia20pile-380x380.jpg",
  "href": "https://www.budgetbytes.com/2011/04/no-knead-focaccia/",
  "extension": "",
  "firstAdded": "2018-05-02T22:28:08.335000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "The night before, combine the flour, salt and yeast in a large pot or bowl. Stir until everything is evenly combined and then stir in the water. The result should be one cohesive, sticky, shaggy lump of dough. If there is still dry flour in the pot or everything isn’t sticking together, add a little water at a time until it forms one ball. Loosely cover and let sit at room temperature until the next day (about 14 hours).",
    "The next day the dough will be wet, fluffy and may even be bubbling from the fermentation. Using a spatula, scrape the dough from the sides of the pot or bowl and turn it in on itself a few times until it forms a ball in the center of the pot.",
    "Prepare a baking sheet with foil, non-stick spray and a generous sprinkle of corn meal. Dust your hands with flour and sprinkle a little on top of the dough to keep it from sticking to your hands. Transfer the dough to the baking sheet. Stretch and pat the dough out into a large rectangle. You may need to dust your hands with flour throughout this process to keep the dough from sticking. It will be very wet and sticky.",
    "Drizzle olive oil over the surface of the dough and use a soft brush to spread it evenly over the surface. Sprinkle the Italian seasoning (or any type of herbs) over top. Let the dough rise for another hour.",
    "Preheat the oven to 425 degrees. Using your fingers, press dimples into the risen dough (see photos). Bake the focaccia for 20-25 minutes in the preheated oven or until the surface is golden brown. After removing from the oven, transfer the focaccia to a wire rack to cool."
  ],
  "ingredients": [
    "0",
    "1 cup whole wheat flour $0.16",
    "3 cups all-purpose flour $0.44",
    "1/4 tsp instant yeast $0.02",
    "1 1/2 tsp salt $0.05",
    "2 cups water $0.00",
    "2 Tbsp olive oil $0.22",
    "1 Tbsp Italian seasoning $0.15",
    "2 Tbsp corn meal $0.03"
  ],
  "__v": 1
}