{
  "hash": "169c11d3218f915c9e6445ecdd2c27c9f914ce1d",
  "title": "Crock Pot Carnita Tacos with Chipotle Cream",
  "image": "http://i2.wp.com/hostthetoast.com/wp-content/uploads/2014/09/Crock-Pot-Crispy-Carnitas-Tacos-1.jpg?zoom=2&w=205",
  "href": "http://hostthetoast.com/crock-pot-carnita-tacos-chipotle-cream/",
  "extension": "Chrome",
  "firstAdded": "2016-04-05T16:08:28.755000",
  "users": [
    null
  ],
  "keywords": [
    "apple",
    "cider",
    "vinegar",
    "water",
    "red",
    "onion",
    "jalapeno",
    "sugar",
    "kosher",
    "salt",
    "chipotle",
    "peppers",
    "adobo",
    "sour",
    "cream",
    "lime",
    "juice",
    "lean",
    "boneless",
    "pork",
    "roast",
    "trimmed",
    "excess",
    "fat",
    "chunks",
    "oil",
    "beer",
    "white",
    "garlic",
    "cumin",
    "chili",
    "black",
    "pepper",
    "corn",
    "tortillas",
    "cotija",
    "cheese",
    "cilantro"
  ],
  "directions": [
    "0",
    "Start by making the pickled onions and jalapenos. Combine the apple cider vinegar, water, sugar, and salt in a bowl and whisk until the sugar and salt dissolve. Put the onion and jalapeno in a sealable container and pour over the vinegar mixture. Let sit at room temperature while you prepare the cream and pork.",
    "In a small, sealable container, combine the sour cream, chipotles, and lime juice. Mix well and taste-- add more adobo sauce if you like yours spicier, or more sour cream if you'd like to tame the heat. Cover and refrigerate.",
    "In a large skillet over high heat, heat the oil. When hot, add in the pork and sear until browned, about 2-3 minutes per side. Place the pork in the bottom of the crock pot.",
    "Add in the onion, beer, chipotle, garlic, and seasonings, and stir to combine. Cover and cook on low for 6-8 hours. Put the pickled onions and jalapenos in the refrigerator.",
    "After 6 hours, check your pork. When it easily shreds with a fork, it is ready to be removed from the broth and shredded.",
    "Preheat the broiler and prepare two baking sheets with aluminum foil. Scatter the pork around the baking sheets and ladle about ¼ cup of the broth over each sheet of pork.",
    "Place one sheet under the broiler for about 5 minutes, then toss the pork and ladle another ¼ cup of broth over. Broil once more, until crispy but not overcooked, and then ladle another ¼ cup broth over the pork. Repeat with the second sheet.",
    "When the pork is done, serve it in toasted corn tortillas (I like to use 2 corn tortillas per taco to keep in all of the juices) with the chipotle cream and pickled onions and jalapenos. Sprinkle with cotija cheese and cilantro."
  ],
  "ingredients": [
    "0",
    "¾ cup apple cider vinegar",
    "1¼ cup water",
    "1 small red onion, thinly sliced",
    "1 jalapeno, sliced",
    "1½ tablespoons sugar",
    "2 teaspoons kosher salt",
    "1",
    "2 teaspoons chipotle peppers in adobo, finely minced",
    "½ cup sour cream",
    "1 teaspoon lime juice",
    "2",
    "1 (4-5 lb) lean boneless pork roast, trimmed of excess fat and cut into 3\" chunks",
    "1 tablespoon oil",
    "12 oz beer",
    "1 large white onion, diced",
    "5 cloves garlic, minced",
    "1 chipotle in adobo, from can, chopped, plus 1 teaspoon sauce",
    "2½ teaspoons cumin",
    "1 teaspoon chili powder",
    "1½ teaspoons Kosher salt",
    "1 teaspoon black pepper",
    "3",
    "12-16 corn tortillas, toasted",
    "Cotija cheese, for topping",
    "Cilantro, for topping"
  ],
  "__v": 1
}