{
  "hash": "6516a253611028bc3301692203bdfb1f08f8ff69",
  "title": "klasickou Šumavu",
  "image": "",
  "href": "http://www.cuketka.cz/?p=11418",
  "extension": "Chrome",
  "firstAdded": "2016-01-31T12:32:21.975000",
  "users": [
    null
  ],
  "keywords": [
    "kvsku"
  ],
  "directions": [
    "0",
    "Do velké mísy dejte lžičku kvásku a postupně přisypte obě mouky, sůl a kmín. Lehce promíchejte a přidejte všechnu vodu. Rukou nebo měchačkou všechno pořádně zamíchejte. Půjde to trochu ztuha a těsto se bude hodně lepit, ale nebojte se. Stačí míchat jen tak dlouho, aby se mouka s vodou spojila a v míse vám nezůstala žádná suchá místečka.",
    "Očistěte si ruce a připravte si potravinářskou fólii, do které mísu pečlivě zabalíte. Jestli fólii nemáte, stačí mísu zabalit do igelitového pytlíku (bez děr pokud možno ;). Těsto nechejte odležet přes noc 10 až 12 hodin při pokojové teplotě (15 – 22 stupňů).",
    "Na druhý den těsto pěkně naroste a budou v něm drobné dírky. Mělo by se zvednout alespoň o třetinu objemu. Pokud se mu nechce, dejte ho víc do tepla a dejte mu pár hodin navíc. Je to úžasná proměna!",
    "Připravte si pomoučenou pracovní plochu a těsto si na ni z mísy vyklopte (velkou lžící nebo plastovou stěrkou). Po vyklopení ho zakryjte igelitovým pytlíkem nebo velkou mísou (aby neoschlo) a nechte ho 20 minut jen tak ležet.",
    "Po dvaceti minutách se vám těsto trochu rozteče a na stole budete mít velkou neforemnou placku. Aby nám těsto přeci jen trochu drželo a pěkně vyběhlo, je potřeba ho několikrát přeložit.",
    "Chytněte těsto za horní dva konce, vytáhněte je od sebe a přetáhněte je k sobě přes zbytek těsta. To samé udělejte vlevo — opět těsto vytáhněte za dva levé konce a překlopte jej doprava. Obráceným postupem to samé vpravo a nakonec celý balíček zabalíte vytaženými konci zezdola. Na konci balíček těsta překulte na záda a jemně ho v rukách poválejte po desce. Poté mu dejte chvilku pauzu a pokud by se vám zdálo moc tekuté, dejte mu ještě jedno balíčkové kolo.",
    "Připravte si ošatku nebo kulatou mísu vyloženou hrubou utěrkou — celý povrch vysypte žitnou moukou (ideál je celozrnná). Vrstva nesmí být nijak hrubá. Stačí aby na dně nebyla žádná prázdná místa. Když ošatku nemáte nebo pokud budete péct ve větším pekáči, můžete nechat těsto kynout i volně v utěrce.",
    "Tak jak máte balíček těsta před sebou, opatrně jej přeneste na vysypanou utěrku. Sváry by měly směřovat nahoru a hladká strana těsta dolů. Povrch těsta opět trochu vysypte moukou. Zakryjte vše igelitovým pytlíkem nebo taškou a nechte kynout alespoň dvě hodiny v teple (nad 20 stupňů).",
    "Po dvou hodinách by těsto mělo zdvojnásobit objem. Pokud se mu nechce, dejte mu další čas. Použitelné minimum je zvětšení alespoň o třetinu. Těsto bude v ošatce rozlité a na povrchu uvidíte bublinky. Volné těsto v utěrce se krásně lenivě rozvalí a stane se polštářkem.",
    "Odteď můžete péct. Do trouby na spodní mřížku dejte litinový hrnec (nebo pekáč). Pokličku z něho sundejte a dejte ji vedle hrnce (musí být rozpálená taky). Rozehřejte troubu na 250 stupňů a po dosažení této teploty ji nechte vyhřívat alespoň 15 minut. Při další práci s rozpáleným pekáčem nebo hrncem si dávejte vždy velký pozor — popáleniny jsou potvory (ověřeno)!",
    "Vezměte si ochranné rukavice do trouby nebo suchou utěrku. Otevřete troubu, vyndejte hrnec nebo pekáč na sporák a ihned troubu zavřete. Do hrnce vyklopte nakynuté těsto z ošatky. Pokud se vám těsto vyklopí na stranu, nezoufejte a s hrncem opatrně zašoupejte — těsto se srovná na střed. Ihned poté ho dejte zpátky do trouby, přiklopte poklicí a co nejrychleji zavřete dvířka od trouby.",
    "Od této chvíle nechte chleba v troubě 10 minut. Po deseti minutách z hrnce sundejte víko a chleba pečte dál nezakrytý. Budete potřebovat dalších 25–35 minut. Teplotu nesnižujte. Orientujte se hlavně podle barvy kůrky, která by měla být krásně kaštanová. U bochníku v této velikosti se nemusíte trápit s odhadem vnitřní teploty.",
    "Na konci chléb vyndejte z hrnce a nechte ho pomalu vychladnout na mřížce. Patičku můžete zakrojit ještě teplou. Celý pecen ale krájejte až vychladlý, ať si nepotrháte střídku.",
    "V základní verzi recept počítá s dlouhou fermentací (10–12 hodin) při pokojové teplotě přes noc. Poté se chléb krátce zpracuje, kyne něco přes dvě hodiny a pak jde na půl hodiny do trouby. O víkendu byste takto měli chléb už na oběd.",
    "Máte-li hodně dlouhý pracovní den a chcete-li péct až večer, můžete si založení těsta posunout už na brzké ráno. Plně fermentované těsto vás bude čekat po práci. Stačí jej zpracovat, dokynout a ještě ten samý večer upéct.",
    "Pokud vás od těsta něco zdrží, můžete kdykoliv zatáhnout za záchrannou brzdu a fermentaci zpomalit v lednici. Při běžných ledničkových teplotách tam na vás těsto počká klidně i 24 hodin. Jen je třeba počítat s tím, že těsto po vyndání potřebuje delší čas na rozjezd. Těsto se musí znovu ohřát na pokojovou teplotu a to může trvat třeba i dvě hodiny. Pokud byste těsto vychladili pod čtyři stupně, vyřadíte kvasinky z boje téměř úplně.",
    "Hlídejte si tedy hlavně finální období (cca 4 hodiny) od vyklopení fermentovaného těsta až po upečení. Cokoliv předtím můžete odkládat dle libosti a nakynutý bochník si tak můžete poslat i do nabitého diáře s hodinovou přesností. Na první pokus to možná netrefíte, ale jakmile se s receptem i kváskem seznámíte blíže, půjde vám to úplně samo.",
    "Pokud používáte zjednodušené vedení žitného kvásku, budete si muset v kváskovém cyklu udělat malou úpravu. V receptu na Šumavu bez hnětení jdou všechny ostatní suroviny i kvásek hned dohromady a výsledné těsto tak obsahuje i nežádoucí sůl, které kvásku dlouhodobě nesvědčí.",
    "Kvásek si tedy nemůžete odebrat přímo z těsta, namísto toho si ho ale můžete namnožit rovnou ve skleničce. Po odebrání jedné lžičky pro recept tak stačí do skleničky v lednici přidat směs žitné mouky s vodou 1:1. Kvásek si takto v klidu a ve větším množství poradí hned na několik obrátek (třeba i měsíc za sebou). Minimálně co pět chlebů jej ale z lednice provětrejte a namnožte si ho spolu s klasickým receptem, kde se kvásek množí samostatně (třeba tady nebo tutaj)."
  ],
  "ingredients": [
    "0",
    "kvásku"
  ],
  "__v": 1
}