{
  "hash": "8e823f8ed4945ff6b81e6a2a15edec6685f852b0",
  "title": "Lemon Blueberry Scones",
  "image": "http://www.jocooks.com/wp-content/uploads/2013/07/lemon-blueberry-scones-12.jpg",
  "href": "http://www.jocooks.com/bakery/pastries/lemon-blueberry-scones/?utm_source=JoCooks&utm_campaign=fce88da24c-New+Recipes+and+Posts+from+Jo+Cooks+%2F+email&utm_medium=email&utm_term=0_aba32560a5-fce88da24c-56478025",
  "extension": "Chrome",
  "firstAdded": "2016-05-23T18:48:00.660000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400 degrees F.",
    "In a large mixing bowl, stir together the first 5 ingredients, including the butter. In a small bowl, whisk together the milk, eggs, vanilla extract, and lemon zest.",
    "Cut the butter into the dry ingredients until the size of large peas, using a pastry blender. Stir in the wet ingredients, and mix until just combined. Gently fold in the blueberries.",
    "Transfer the dough to a lightly floured surface. Gently roll out the dough into a disc, taking care not to burst the blueberries. Fold the dough over itself and repeat 4-5 times. Depending on the shape you want your scones, roll out your dough into an 1-inch thick disc or rectangle. Cut the dough into wedges (if shaped into a disc), or squares (if shaped into a rectangle), or cut out with a biscuit cutter. Transfer scones to a baking sheet and brush with egg wash. If preferred sprinkle with additional sugar.",
    "Bake for 15-18 minutes, or until the scones are golden brown and do not fall apart when nudged. Immediately transfer from pan to cooling racks.",
    "Meanwhile, in a medium bowl, mix together the powdered sugar, milk, 1 teaspoon vanilla, and lemon juice. Stir until the mixture is smooth and runny. If too thick add more milk; if too thin add more powdered sugar.",
    "While scones are still warm, drizzle a tablespoon of glaze over each. Allow scones to stand for a few minutes until the glaze forms a crust."
  ],
  "ingredients": [
    "0",
    "4 cups all purpose flour",
    "2 tbsp baking powder",
    "1 tsp salt",
    "½ cup sugar",
    "1½ cup cold butter, cut into cubes",
    "1 cup milk (I used 2%)",
    "4 eggs (lightly beaten)",
    "2 tsp vanilla extract",
    "zest from one lemon",
    "2 cups fresh blueberries",
    "1 egg for egg wash",
    "1",
    "3 cups powdered sugar",
    "6 tbsp milk",
    "1 tsp vanilla extract",
    "juice from ½ a lemon (about 2 tablespoons)"
  ],
  "__v": 1
}