{
  "hash": "75a6651b1f4cf1831b1a5ca856345a8cc235fafa",
  "title": "Spinach & Goat Cheese Stuffed Chicken Breast with Caramelized Onions + Mushrooms",
  "image": "https://www.ambitiouskitchen.com/wp-content/uploads/2019/02/Spinach-and-Goat-Cheese-Stuffed-Chicken-2.jpg",
  "href": "https://www.ambitiouskitchen.com/spinach-stuffed-chicken-breast/",
  "extension": "Chrome",
  "firstAdded": "2019-05-05T11:51:08.952000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Preheat oven to 375 degrees F. Use a sharp knife to hasselback each chicken breast, and cut 6 slits into the top of each breast, making sure you don’t cut all the way through to the bottom of the chicken breast. Drizzle each chicken breast with a little olive oil then season with salt and pepper. Set aside.",
    "Place a large ovenproof skillet over medium high heat and add in ½ tablespoon of olive oil. Add in spinach and season with garlic powder. Cook, stirring occasionally until spinach is fully wilted. Transfer cooked spinach to a medium bowl and add in goat cheese. Stir until well combined. Stuff each slit with the spinach/goat cheese mixture.",
    "Next add a 1 tablespoon of olive oil to the same skillet. Add in sliced onions, mushrooms, fresh thyme, optional balsamic vinegar and season with a little salt and pepper. Saute until onions begin to caramelize and mushrooms turn golden brown. Make room for the chicken by moving the mushrooms and onions to the sides of the skillet. Add chicken to the skillet, making sure there is a little bit of room between each chicken breast; you may need to rearrange the mushrooms and onions. Transfer to oven and bake for 20-30 minutes until the chicken is fully cooked and meat thermometer reads 165 degrees F. Serves 4."
  ],
  "ingredients": [
    "0",
    "4 chicken breasts (about 4-6 ounces each)",
    "2 tablespoons olive oil, divided",
    "4 cups organic spinach",
    "½ teaspoon garlic powder",
    "2 ounces goat cheese",
    "1 white onion, sliced",
    "8 ounces sliced baby bella mushrooms",
    "1 teaspoon fresh thyme",
    "Optional: 1 tablespoon balsamic vinegar",
    "Freshly ground salt and pepper"
  ],
  "__v": 1
}