{
  "__v": 1,
  "directions": [
    "0",
    "Приготовление",
    "Филе тунца ополоснуть холодной водой и хорошо обсушить бумажными полотенцами.",
    "Разрезать филе на стейки, весом около 150-200 г (ширина одного стейка около 2 см).",
    "Каждый стейк промакнуть бумажным полотенцем.",
    "Смазать стейк оливковым маслом, посолить и поперчить.",
    "Обжаривание на чугунной(!) сковороде-гриль.",
    "Хорошо разогреть чугунную сковороду-гриль на среднем или сильном огне, без масла.",
    "Совет. Я разогревала чугунную сковороду около 15 минут. Такой длительный нагрев позволяет чугуну хорошо прогреться и стейк не прилипает к сковороде, при этом, оставляя характерный для гриля след на филе. Филе получается сочным и очень вкусным.",
    "Внимание! Сильно нагревать можно только чугунную сковороду! Не всякая сковорода выдержит такой длительный нагрев. Поэтому, если у Вас не чугунная сковорода, прогрейте ее, смазав маслом при помощи силиконовой кисточки, чтобы сковорода была достаточно горячей, и стейк зашипел при выкладывании.",
    "Выложить стейк (если стейков несколько, оставить расстояние между ними).",
    "Готовить на сильном огне 2-4 минуты с одной стороны (засечь время по таймеру).",
    "Перевернуть стейк, уменьшить огонь и готовить еще 2-4 минуты с другой стороны.",
    "За 2 минуты стейк прожаривается до состояния средней прожарки. Филе легко разрезается ножом или вилкой, но остается розовым в середине.",
    "Готовьте филе 4-6 минут, если хотите полностью прожаренный стейк.",
    "Обжаривание на антипригарной сковороде.",
    "В сковороду влить 2-3 столовые ложки оливкового масла и хорошо разогреть сковороду с маслом на среднем огне.",
    "Выложить приправленный солью и перцем стейк.",
    "Совет. Масло должно быть хорошо разогретым и стейк должен шипеть при выкладывании. Горячее масло запечатает соки внутри филе, и оно получится сочным.",
    "Жарить 3-5 минут с одной стороны.",
    "Затем перевернуть и жарить 3-4 минуты с другой стороны, до желаемой степени прожарки.",
    "Сковороду, во время жарки, не нужно накрывать.",
    "Готовый стейк сразу подать к столу.",
    "По желанию, при подаче стейк можно сбрызнуть соком лимона.",
    "На гарнир можно подать овощной салат, отваренные овощи (зеленую фасоль, брокколи и т.п.), а также отварной рис.",
    "Приятного Вам аппетита и с Наступающими! :)"
  ],
  "firstAdded": "2014-06-03T21:37:47.376000",
  "hash": "000de493e676cdb13563497b50f3db3349683fe2",
  "href": "http://gotovim-doma.ru/view.php?r=1114-recept-Steik-iz-tuntsa",
  "image": "http://gotovim-doma.ru/img/img1114_1.jpg",
  "ingredients": [
    "0",
    "на 4-6 порций",
    "тунец (филе) - 800 г,",
    "оливковое масло - 2-3 столовые ложки,",
    "крупная соль (желательно морская),",
    "свежемолотый перец (черный или смесь 5-и перцев)"
  ],
  "keywords": [],
  "title": "Стейк из тунца",
  "users": [
    null
  ]
}