{
  "__v": 2,
  "directions": [
    "0",
    "Preheat oven to 170˚C and place the rack in the center of the oven. Prepare a 9 inch (23 cm) square baking pan that has been lined with aluminum foil.",
    "In a heatproof bowl, placed over a saucepan of simmering water, melt the butter and chocolate.",
    "Remove from heat and stir or whisk in the sugar and vanilla extract. Add the eggs, one at a time, beating well after each addition. Stir in the flour and salt and stir vigorously until the batter is smooth and glossy (about one minute). Remove 1/2 cup (120 ml) of the brownie batter and set it aside (to be used for marbling the cheesy layer). Add in chopped roasted nuts in the remainder of the brownie batter and spread evenly onto the bottom of the prepared pan.",
    "Using a hand mixer beat the cream cheese just until smooth. Add the sugar, vanilla, and egg and process just until creamy and smooth (do not over beat).",
    "Lastly, stir in the lemon zest and juice. Spread the cream cheese filling evenly over the brownie layer. Fill in the remaining brownies into a disposable piping bag and pipe into the surface of the cheese.",
    "Run a knife or wooden skewer back and forth through the two batters until you have a marble effect.",
    "Bake in the preheated oven for about 30 minutes or until the brownies are set and the cream cheese is just beginning to brown. (A toothpick inserted into the brownie comes out with just a few moist crumbs.)",
    "Remove from oven and place on a wire rack to cool completely. Then cover and refrigerate the brownies until they are firm enough to cut into squares (after 5 hours or ideally overnight). Once chilled, remove the brownies from the pan by lifting with the ends of the foil and transfer to a cutting board. With a sharp knife, cut into 8 squares.",
    "It is a good idea to have a damp cloth nearby to wipe your knife between cuts. These brownies can be stored in the refrigerator for several days. Serve chilled and best to go with a dollop of vanilla ice cream."
  ],
  "firstAdded": "2014-10-16T04:02:07.349000",
  "hash": "7fb4dc26b86c96fcea862c2fad29d7c93bf2e11d",
  "href": "http://www.thestar.com.my/Lifestyle/Food/Recipes/2012/04/30/Marble-Cheesy-Brownies/",
  "image": "http://www.thestar.com.my/~/media/Images/TSOL/Photos-Gallery/Kuali/2012/4/marble.ashx?w=620&h=413&crop=1&",
  "ingredients": [
    "0",
    "Brownie Layer",
    "----------------------------",
    "125g unsalted butter, cut into pieces",
    "150g good quality dark chocolate, coarsely chopped",
    "85g brown sugar",
    "1 tsp vanilla extract",
    "2 large eggs",
    "75g all-purpose flour",
    "1/4 tsp salt",
    "85g roasted pecan nuts / macadamia nuts, coarsely chopped",
    "-----------------------------",
    "Marble Cheesy Layer",
    "-----------------------------",
    "250g cream cheese, at room temperature",
    "50g confectioners' sugar",
    "1/2tsp vanilla extract",
    "1 large egg",
    "1 lemon zest",
    "1 tsp lemon juice"
  ],
  "keywords": [
    "brownie",
    "layer",
    "unsalted",
    "butter",
    "pieces",
    "good",
    "quality",
    "dark",
    "chocolate",
    "coarsely",
    "brown",
    "sugar",
    "vanilla",
    "eggs",
    "allpurpose",
    "flour",
    "salt",
    "roasted",
    "pecan",
    "macadamia",
    "nuts",
    "marble",
    "cheesy",
    "cream",
    "cheese",
    "room",
    "confectioners",
    "egg",
    "lemon",
    "zest",
    "juice"
  ],
  "title": "Marble Cheesy Brownies",
  "users": [
    null
  ]
}