{
  "hash": "c4f78e04f5057fc027ebb09e0cecf80ee79bb122",
  "title": "Pumpkin Cinnamon Rolls with Orange Cream Cheese Icing",
  "image": "//images.food52.com/RCd8bPrJA0SPuODe_xWQwxWNP-o=/753x502/2b8062c2-4b78-429c-a156-49175edba8d7--1X2B6058.jpg",
  "href": "https://food52.com/recipes/24962-pumpkin-cinnamon-rolls-with-orange-cream-cheese-icing",
  "extension": "Firefox",
  "firstAdded": "2015-10-09T14:07:40.472000",
  "users": [
    null
  ],
  "keywords": [
    "dough",
    "active",
    "dry",
    "yeast",
    "milk",
    "warmed",
    "purpose",
    "flour",
    "light",
    "brown",
    "sugar",
    "cinnamon",
    "ginger",
    "allspice",
    "salt",
    "unsalted",
    "butter",
    "softened",
    "eggs",
    "pumpkin",
    "puree",
    "cream",
    "cheese",
    "filling",
    "orange",
    "zest",
    "confectioners",
    "sifted",
    "juice"
  ],
  "directions": [
    "0",
    "Combine the yeast and the warm milk and let sit until foamy, about 5 minutes.",
    "In the bowl of a stand mixer fitted with the dough hook combine the flour, sugar, spices and salt. Add in the eggs, pumpkin puree, and yeast mixture. Mix until just combined, then add the butter. Mix the dough until well combined, then knead the dough for 5 minutes until smooth and elastic. The dough will stick to the bottom of the bowl, but resist the temptation to add more flour.",
    "Transfer the dough to a clean, oiled bowl and cover with plastic wrap. Let the dough rise until doubled in volume, 1-½ hours at a warm room temperature. When the dough is almost finished rising, prepare the filling by browning the butter in a skillet until it is golden and toasty. Let the butter cool slightly then combine it with the brown sugar, cinnamon and orange zest. Prepare 2, 8 or 9-inch baking pans by buttering or oiling them generously.",
    "After the dough has risen, transfer it to a well floured surface and pat the dough into a 12-inch square. Break up the cream cheese and gently spread it on top of the dough, being careful not to tear the delicate dough. Fold the dough into thirds, starting from the bottom so the cream cheese is completely sealed inside of the dough. Then roll the dough into a roughly 16-inch by 20-inch rectangle with the long side facing you, dust off any excess flour with a pastry brush. Sprinkle the filling evenly over the top.",
    "Starting from the bottom, gently roll the dough into a log. Use a serrated knife and use very, very gentle and even pressure to cut the log into generous 1-inch slices. Gently place the cut rolls into the prepared pans, cover and let rise until almost doubled in size, 1-1 ½ hours. Note: If you’d like to freeze some rolls to bake off at a later date, now is a good time to do it. Wrap the pan in 2 layers of plastic wrap and a layer of foil and freeze. To bake, let the frozen rolls come to room temperature and complete their final rise before baking.",
    "Twenty minutes before you are ready to bake the rolls preheat your oven to 350º. Bake the rolls until they are cooked through and lightly golden, 20-25 minutes. While they are baking prepare the glaze by whisking the cream cheese, confectioner’s sugar, orange juice, and a tiny pinch of salt together until smooth.",
    "Let the rolls cool for about 5 minutes before glazing and digging in. Be judicious with the glaze, a little goes a long way."
  ],
  "ingredients": [
    "0",
    "Dough",
    "2 tablespoons active dry yeast",
    "1/2 cup milk, warmed to 115º",
    "4 cups all purpose flour",
    "1/3 cup light brown sugar",
    "1 teaspoon ground cinnamon",
    "1/4 teaspoon ground ginger",
    "1/4 teaspoon ground allspice",
    "1 tablespoon salt",
    "4 tablespoons unsalted butter softened",
    "3 eggs",
    "1 cup pumpkin puree",
    "1/2 cup cream cheese",
    "Filling",
    "1 cup light brown sugar",
    "1/2 cup unsalted butter",
    "2 tablespoons ground cinnamon",
    "1/2 teaspoon orange zest",
    "1",
    "1/2 cup cream cheese",
    "1 cup confectioner's sugar, sifted",
    "3 tablespoons orange juice"
  ],
  "__v": 1
}