{
  "__v": 1,
  "directions": [
    "0",
    "Make the pastry - put the flour, icing sugar and butter into a food processor and blitz until you have fine breadcrumbs. Add the egg yolk and whizz for 30 seconds. Add 1tbsp cold water and whizz for another 30 seconds or until it starts to come together. (Don't over-process or the pastry will be tough.) Turn out onto a floured surface, knead into a ball and flatten slightly to make a disc. Wrap in clingfilm and chill in the fridge for at least 30 minutes.",
    "Preheat the oven to 190 C, 170 C fan, 375 F, gas 5. Roll out the pastry between 2 pieces of clingfilm and use to line the tin, leaving the excess to hang over the edges. Prick the surface gently with a fork, line with baking parchment and fill with baking beans. Put in the fridge for at least 20 minutes or in the freezer until needed. Place the pastry-lined tart tin on a baking sheet and bake blind for 15 minutes or until the pastry is beginning to colour. Remove the parchment paper and baking beans, brush with the beaten egg and place back in the oven for another 10 minutes or until the pastry is lightly golden. Remove and leave to cool slightly before carefully trimming the edges with a sharp knife to the level of the top of the tin.",
    "Reduce the oven to 110 C, 90 C fan, 225 F, gas 1⁄4. Whisk the eggs, egg yolks and sugar together in a bowl, then stir in the cream. Add the lemon juice (this will thicken the cream slightly) and pour into a jug.",
    "Pour half the filling into the pastry case. Place the tin on the bottom shelf of the oven. Now for the bit to prevent spillage! Pull the shelf out halfway, keeping the tin level and pour in the remaining filling. Carefully push the shelf back and bake for 50 minutes to 1 hour or until the filling is slightly wobbly in the centre. Leave in the tin to cool.",
    "Transfer the tart to a large plate and dust generously with icing sugar. You can use a blowtorch to \"brûler\" the sugar if you have one but it's just as pretty with a dusting. Serve with fresh raspberries."
  ],
  "firstAdded": "2014-06-26T14:15:51.127000",
  "hash": "dda22a2ff00353cfc9ffe0a1198857552ec40048",
  "href": "http://www.womanandhome.com/recipes/292606/classic-lemon-tart",
  "image": "http://womanandhome.media.ipcdigital.co.uk/21348/000008379/bcff_orh2000w570/WAH-SC-04FOOD8-RT.jpg",
  "ingredients": [
    "0",
    "For the pastry 175g (6oz) plain flour 40g (1½oz) icing sugar 75g (3oz) butter, chilled 1 egg yolk 1 egg, beaten For the filling 2 large eggs 4 large egg yolks 175g (6oz) caster sugar 200ml (7fl oz) double cream juice 2 lemons icing sugar, for dusting"
  ],
  "keywords": [
    "pastry",
    "plain",
    "flour",
    "butter",
    "chilled",
    "yolk",
    "filling",
    "eggs",
    "egg",
    "yolks",
    "caster",
    "double",
    "cream",
    "juice",
    "lemons",
    "icing",
    "sugar",
    "dusting"
  ],
  "title": "Classic lemon tart recipe",
  "users": [
    null
  ]
}