{
  "hash": "5e6eb4f79fba49beca30c0839ed86c1cd3eff03a",
  "title": "HOMEMADE KOMBUCHA SCOBY",
  "image": "https://www.liveeatlearn.com/wp-content/uploads/2015/10/Untitled-15.jpg",
  "href": "https://www.liveeatlearn.com/the-simple-guide-to-kickass-kombucha/",
  "extension": "Chrome",
  "firstAdded": "2020-06-06T00:22:56.974000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Bring water to a boil in a clean pot. Remove from heat and dissolve sugar into it.",
    "Add the tea and allow to steep while water cools to room temperature (a few hours). Only when water is at room temperature is it ready to work with (test by drawing out some water with a paper straw, using your finger to keep the ‘buch in the straw).",
    "Pour the sweetened tea into your jar(s), then pour store-bought kombucha in (if you’re using two jars, pour ½ of the storebought kombucha into each), making sure to include any little gunkies that may be at the bottom. These are good!",
    "Cover with a few layers of the tightly woven cloth (keeps out bugs and debris) and secure with a rubber band.",
    "Set somewhere dark, still, and room temperature (70-75 degrees F, 21-24 C), like a cupboard, for 1 to 4 weeks, until a ¼ inch (½ cm) SCOBY has formed.",
    "Keep SCOBY in its original tea until you’re ready to brew your first batch. The SCOBY should live and grow for years if treated with love. The tea you used to make the SCOBY, however, is very vinegary and should be tossed. Don’t use this tea as the starter to your first fermentation!"
  ],
  "ingredients": [
    "0",
    "7 cups (1.6 L) clean water",
    "½ cup (100 g) white sugar",
    "4 bags black tea (or 1 Tbsp loose tea)",
    "1 cup (235 mL) unpasteurized, unflavored store bought kombucha",
    "A large glass or ceramic container (two jars holding at least ½ gallon (1.9 L) each, or one jug holding at least 1 gallon (3.7 L)). Alternatively, use a glass jug with a built in spigot to make pouring the kombucha out easier!",
    "Tightly woven cloth (coffee filters, paper towels, napkins, cheese cloth)",
    "Rubberbands"
  ],
  "__v": 1
}