{
  "hash": "4e47ab4e2940c328f772c8e8e38ba260188e5826",
  "title": "Vegetarian Phở (Vietnamese Noodle Soup)",
  "image": "https://cdn.apartmenttherapy.info/image/fetch/f_auto,q_auto:eco,c_fill,g_auto/https://storage.googleapis.com/gen-atmedia/3/2015/05/8d9b3e048f88f951488af1ba032d533d3510afa4.jpeg",
  "href": "https://www.thekitchn.com/recipe-vegetarian-pho-vietnamese-noodle-soup-recipes-from-the-kitchn-107312",
  "extension": "Chrome",
  "firstAdded": "2018-10-27T20:10:29.372000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To make the broth, char the onion and ginger over an open flame (holding with tongs) or directly under a broiler until slightly blackened, about 5 minutes on each side. Rinse with water and set aside.Place the cinnamon, star anise, cloves, and coriander in a large pot over medium-low heat and dry-roast, stirring to prevent burning. When you can smell the aroma of the roasted spices, add the vegetable stock, tamari or soy sauce, carrots, and charred onion and ginger.Bring the broth to a boil. Reduce the heat and simmer, covered, for 30 minutes. Strain out the solids and keep hot until ready to serve. Make the noodles while the broth simmers.",
    "Place the noodles in a large bowl and cover with hot water. Let stand for 20 to 30 minutes or until tender but still chewy. Drain. (If soaking does not soften the noodles enough, blanch them in a pot of boiling water for a few seconds.)Prepare the toppings as desired – slice and cook tofu, lightly steam or blanch vegetables, and so on. Toppings should be unseasoned or only lightly seasoned so as not to interfere with the flavor of the broth.",
    "To serve, divide the noodles between 2 bowls. Arrange toppings over noodles. Ladle the broth between the 2 bowls. Serve with garnishes on the side, which diners should add to taste."
  ],
  "ingredients": [
    "0",
    "For the broth:",
    "1 large onion, peeled and halved",
    "1 (2-inch) piece fresh ginger, peeled and halved lengthwise",
    "1 (3-inch) cinnamon stick, preferably Vietnamese cassia-cinnamon",
    "1 star anise",
    "2 whole cloves",
    "1 teaspoon coriander seeds",
    "4 cups unsalted vegetable stock or broth",
    "2 teaspoons tamari or soy sauce",
    "4 medium carrots, peeled and coarsely chopped",
    "For the noodles:",
    "8 ounces dried flat rice noodles (known as bánh phở; use 1/16\", 1/8\", or 1/4\" width depending on availability and preference)",
    "For the toppings (choose a few):",
    "Protein, such as fried or baked tofu, bean curd skin, or seitan",
    "Mushrooms",
    "Vegetables, such as bok choy, napa cabbage, or broccoli",
    "For the garnishes (choose a few):",
    "1/2 large onion, very thinly sliced",
    "2 medium scallions, thinly sliced",
    "1 chile pepper (Thai bird, serrano, or jalapeño), sliced",
    "1 medium lime, cut into wedges",
    "1/2 cup bean sprouts",
    "Large handful of herbs, such as cilantro, Thai basil, or cilantro",
    "Hoisin sauce, Sriracha (optional)"
  ],
  "__v": 1
}