{
  "hash": "cd1c24818adb78c4fcf4386cdf8aa5da83563334",
  "title": "San Francisco Style Garlic Tater Tots",
  "image": "http://tastykitchen.com/recipes/wp-content/uploads/sites/2/2016/12/featuretot1-410x280.jpg",
  "href": "http://tastykitchen.com/recipes/appetizers-and-snacks/san-francisco-style-garlic-tater-tots/",
  "extension": "Chrome",
  "firstAdded": "2017-03-21T17:32:02.915000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cut large potatoes in half or leave them whole if medium or small. Add potatoes to a large pot of water, bring to a boil and cook until potatoes are just cooked (do not overcook them). Drain potatoes and let cool completely.",
    "Place some potato chips in a gallon-size resealable bag, seal and crush with a rolling pin, until crushed well. Measure 1 cup for the recipe.",
    "Coarsely grate potatoes and mix well with crushed potato chips, salt, pepper powder, garlic powder and paprika, until thoroughly incorporated (clean hands are your best friends). Divide into 1 1/2-tablespoon portions and shape each portion into a 1 to 1 1/2 inch cylinder (the shape of a traditional tot).",
    "Add oil in a deep skillet or Dutch oven until it comes to about 1 1/2 inches height up the sides of the pan. Heat over high heat until it reaches 375ºF.",
    "Deep fry tots in 2 batches, until each batch is deep golden on all sides, turning them occasionally, 3–4 minutes per batch. Drain on a paper-towel-lined plate.",
    "Add 2 tablespoons of the same oil in a small skillet and stir in garlic, parsley and red pepper flakes. Place the skillet on low heat and cook just until the raw flavor of garlic is gone. Scrape off every last bit of this garlicky goodness over the cooked tots and toss them around.",
    "Serve hot and watch them disappear.",
    "Makes about 28 tots."
  ],
  "ingredients": [
    "0",
    "1 pound Yokon Gold Potatoes, Peeled",
    "1 cup Finely Crushed Potato Chips, I Used Lay’s Classic",
    "½ teaspoons Salt",
    "½ teaspoons Pepper Powder",
    "½ teaspoons Garlic Powder",
    "¼ teaspoons Paprika",
    "Vegetable Oil, For Frying",
    "10 cloves Garlic, Peeled And Finely Chopped",
    "¼ cups Parsley, Finely Chopped",
    "½ Tablespoons Red Pepper Flakes"
  ],
  "__v": 1
}