{
  "hash": "fc10b6309cc4e119e9b236e27ca3b63131e14c6c",
  "title": "chicken and rice casserole",
  "image": "",
  "href": "http://casserole.cooktopcove.com/2016/03/28/nickos-chicken-casserole-the-easiest-and-quickest-dinner-that-you-can-do/",
  "extension": "Chrome",
  "firstAdded": "2017-01-12T21:26:29.600000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "1. Preheat your oven to 320 F (160 C). Lightly grease a casserole and place your raw rice evenly on it. Slice the chicken and place it over the rice.",
    "2. Add the chopped onion. If you're going to use the mushrooms and the spinach, now it's the time to add them too. It'll add some extra vitamins to the mixture! If you're not a fan of this combination, try other veggies instead. Just remember that when baking tomato or zucchini, you have to be careful because they add more liquids to the mix.",
    "3. Mix the cream of mushroom soup, the dry soup mix and the 2 cups of water. Season to taste and pour the mixture over the rest of the ingredients.",
    "ADVERTISEMENT",
    "4. Cook for 2 hours. Let it cool for 10-15 minutes before serving.",
    "Play Video",
    "RESOURCES BANNER IMAGE VIA NICKO'S KITCHEN",
    "Print this recipe",
    "Share on Facebook"
  ],
  "ingredients": [
    "0",
    "ients",
    "- 1 cup of raw rice (185 grams) - Arborio or Bomba rice are idoneous for baking, but they may be expensive where you live. Try regular white or brown rice instead.",
    "- 3 boneless and skinless chicken breasts.",
    "- 1 package of dry onion soup mix - If you cannot easily find it where you live, try preparing your own with this recipe.",
    "- 1 can of cream of mushroom soup - If you cannot find it where you live, it's basically an easy bechamel with mushrooms and evaporated milk. Try to make your own and freeze it so you can use it whenever you need!",
    "- 3/4 onion, roughly chopped",
    "- 1 package of mushrooms, chopped (optional)",
    "- 1 bundle of spinach, chopped (optional)",
    "- 2 cups of water",
    "- Salt and pepper to taste"
  ],
  "__v": 1
}