{
  "hash": "53b6136a9ca6925e29da1fb95b11367ff1584edd",
  "title": "Chimichanga",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/chimichanga-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-01-29T14:52:26.860000",
  "users": [
    null
  ],
  "keywords": [
    "boneless",
    "shoulder",
    "chuck",
    "roast",
    "salt",
    "milled",
    "black",
    "pepper",
    "bacon",
    "drippings",
    "oil",
    "medium",
    "onion",
    "garlic",
    "beef",
    "stock",
    "tomatoes",
    "preferably",
    "italian",
    "plum",
    "roasted",
    "mild",
    "green",
    "chiles",
    "new",
    "mexican",
    "frozen",
    "seeded",
    "flour",
    "tortillas",
    "warmed",
    "deepfrying",
    "monterey",
    "jack",
    "asadero",
    "cheddar",
    "cheese",
    "combination",
    "sour",
    "cream",
    "tomato",
    "scallions",
    "pico",
    "gallo",
    "page",
    "favorite",
    "salsa"
  ],
  "directions": [
    "0",
    "Rub the roast with salt and pepper.",
    "Warm 2 tablespoons of the bacon drippings in a Dutch oven or other large heavy pot over medium-high heat. Brown the roast on all sides. Reduce the heat to low, scatter half of the onion and half of the garlic over and around the meat. Pour the beef stock over it. Cover and simmer for 1 1/4 to 1 1/2 hours, until the roast is very tender. Let the meat sit in the cooking liquid until cool enough to handle. Drain the meat, reserving the cooking liquid. Shred the meat into bite-size pieces with your fingers or in several small batches in a food processor.",
    "Warm the remaining 2 tablespoons bacon drippings in a heavy skillet over medium heat. Saute the remaining onion and garlic in the fat until the onion softens. Add the meat and saute until well-browned, about 10 minutes. Scrape the meat up from the bottom every few minutes, getting it crusty in some spots. Pour the reserved cooking liquid into the pan and add the tomatoes and chiles. Cook for about 15 minutes, until most of the liquid has evaporated. The meat should remain moist but not juicy. Adjust the seasoning if you wish. (The meat can be made ahead to this point and refrigerated, covered, for up to several days. Warm the meat before proceeding.)",
    "You'll need about 5 cups of the shredded meat mixture for the chimichangas. Spoon it evenly over the tortillas. Roll up each tortilla, tucking in the ends to make a secure fat tube that resembles an overgrown Chinese egg roll. Secure the rolls with toothpicks.",
    "Shortly before you plan to eat the chimichangas, warm at least 4 inches of oil in a Dutch oven or other large heavy pan to 375 degrees F. Fry the chimichangas one or two at a time until golden brown, about 3 minutes. Turn the chimis to fry them evenly. Drain them and arrange on serving plates. Top with cheese, sour cream, tomato, scallions and salsa. Serve immediately.",
    "(Recipe courtesy of Cheryl Alters-Jamison & Bill Jamison, American Home Cooking, Broadway Books)"
  ],
  "ingredients": [
    "0",
    "3 -pound boneless shoulder chuck roast",
    "Salt and freshly milled black pepper",
    "1/4 cup bacon drippings or vegetable oil",
    "1 medium onion, chopped",
    "2 garlic cloves, minced",
    "1 cup beef stock",
    "2 small tomatoes, preferably Italian plum, chopped",
    "1/2 cup chopped roasted mild green chiles, such as New Mexican, preferably fresh or frozen, seeded",
    "4 thin 10- to 12-inch flour tortillas, warmed",
    "Vegetable oil for deep-frying",
    "Grated Monterey Jack, asadero, or mild Cheddar cheese, or a combination",
    "Sour cream, chopped tomato, and sliced scallions",
    "Pico de Gallo (page 77) or other favorite salsa"
  ],
  "__v": 1
}