{
  "hash": "d8a2923ca26af93aeeadf49cea98daa26457a15b",
  "title": "CRISPY CHILLI BEEFPosted on Sun 15th December 2019",
  "image": "",
  "href": "https://schoolofwok.co.uk/tips-and-recipes/crispy-chilli-beef",
  "extension": "Chrome",
  "firstAdded": "2019-12-15T20:36:50.290000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparation",
    "First, peel and finely dice the ginger and garlic, before slicing the chillies into thin rings and placing all together in the same bowl. Remove the leaves of the coriander to be used later as a garnish, and then finely chop the coriander stalks, adding them to the bowl along with the garlic, ginger and chilli.",
    "In a separate bowl or ramekin, thoroughly mix all the sauce ingredients together, making sure to dissolve the honey.",
    "Now, cut the meat into thin strips roughly 3mm wide and place in a mixing bowl. Add the marinade ingredients and, using your hands, massage the pieces until they are evenly coated. Set up a large mixing bowl with the seasoned cornflour, and then add the marinated beef. Rub flour into the meat until fully coated; the meat will stick together in clumps at first but will start to separate as you continue to massage it. Once all the meat has completely separated, and you have shaken off any excess flour, it is ready to be fried.",
    "BUILD YOUR WOK CLOCK: place your meat at 12 o’clock, then arrange the bowl of ginger, garlic, chilli, coriander, and the sauce bowl clockwise around your plate.",
    "Cooking",
    "Half-fill a large pot, wok or deep-fryer with vegetable oil and heat to 180°C (350°F), or until the tip of a wooden chopstick or skewer starts to fizz after a second or so in the oil.",
    "Carefully add the marinated meat, making sure to not overfill the wok, and deep-fry until golden brown, about 2–3 minutes. Remove the pieces carefully with a slotted spoon and drain well on a plate covered with kitchen paper. (TIP: to get an even crispier finish to your beef, double-fry it! Add the raw marinated beef strips to the oil and deep-fry for the first time for just 30 seconds to 1 minute before draining and removing. Making sure that the oil remains at 180°C, return the beef pieces to the wok and fry again for 2-3 minutes until truly crispy and a deep golden-brown, then remove and drain once more.)",
    "In a clean wok, heat 1⁄2 tablespoon of vegetable oil over a high heat until smoking-hot. Add the ginger, garlic, chilli, and coriander, lower the heat to medium and stir-fry for 30 seconds until fragrant.",
    "Pour over the sauce mixture and bring to a vigorous boil, then add the crispy meat and give the wok two or three tosses to mix everything together. Spoon into a serving bowl and scatter over the coriander leaves to finish.",
    "Serve immediately.",
    "TIP: Popping your rump steak in the freezer 30 minutes before slicing will harden the meat and make it much easier to cut into even-sized pieces."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "200g sirloin or rump steak",
    "400g cornflour seasoned with 1⁄2 teaspoon salt and 1⁄2 teaspoon black pepper",
    "a thumb-size piece of ginger",
    "3 garlic cloves",
    "2 fresh bird’s-eye chillies, deseeded",
    "a large handful of coriander",
    "vegetable oil, for frying",
    "1 teaspoon sesame oil",
    "A large pinch of granulated sugar",
    "1-2 tablespoons light soy sauce",
    "1 egg",
    "1⁄2 tablespoon dark soy sauce",
    "3 tablespoons tomato ketchup",
    "6 tablespoons Chinkiang black rice vinegar",
    "4 tablespoons honey"
  ],
  "__v": 2
}