{
  "__v": 1,
  "directions": [
    "0",
    "Taglia il pane raffermo in fette spesse qualche centimetro, mettile in una ciotola grande e coprile di acqua, in modo che si ammollino bene.",
    "Prepara il battuto con sedano, carota e cipolla rossa, in modo che siano fini e omogenei.",
    "Versa qualche cucchiaio di olio extravergine di oliva in una pentola capiente, aggiungi il battuto di verdure e lascialo soffriggere pochi minuti, finché non si ammorbidisce.",
    "Versa la passata di pomodoro in pentola e lasciala sobbollire a fuoco basso, coperta, per circa 15 minuti. Regola di sale e pepe.",
    "Strizza il pane e sbriciolalo nella passata di pomodoro, mescola per amalgamare e cuoci per altri 10 minuti, in modo che il pane si insaporisca.",
    "Schiaccia l’aglio e aggiungilo alla pappa al pomodoro con qualche foglia di basilico, mescolando bene.",
    "Togli la pentola dal fuoco e condisci con un generoso giro del tuo miglior olio extravergine di oliva e del sale, se necessario.",
    "Mettila da parte coperta a riposare per almeno un’ora e poi servila, scaldandola un po' perché torni tiepida."
  ],
  "firstAdded": "2014-10-10T11:43:38.241000",
  "hash": "1cc3a70a571ae521bd64e4320a8ab35d8675f70a",
  "href": "http://it.julskitchen.com/toscana/pappa-al-pomodoro",
  "image": "http://farm8.staticflickr.com/7219/7256833272_2b91394d31_b.jpg",
  "ingredients": [
    "0",
    "250 g pane toscano raffermo",
    "olio extravergine di oliva",
    "½ carota",
    "½ gambo di sedano",
    "½ cipolla rossa, media",
    "750 g passata di pomodoro",
    "sale",
    "pepe nero macinato fresco",
    "1 spicchio di aglio",
    "Basilico"
  ],
  "keywords": [
    "pane",
    "toscano",
    "raffermo",
    "olio",
    "extravergine",
    "oliva",
    "carota",
    "gambo",
    "sedano",
    "cipolla",
    "rossa",
    "media",
    "passata",
    "pomodoro",
    "sale",
    "pepe",
    "nero",
    "macinato",
    "fresco",
    "spicchio",
    "aglio",
    "basilico"
  ],
  "title": "La pappa al pomodoro",
  "users": [
    null
  ]
}