{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 425˚F. Line a large, rimmed baking sheet with foil and mist with cooking spray. Prick potatoes with a fork and transfer to tray. Bake for 50 minutes, turning once, until tender. Set aside to cool for 20 minutes. Reduce oven temperature to 350˚F.",
    "Meanwhile, mist a large skillet with cooking spray and heat on medium-low. Add bacon and cook for 5 to 6 minutes, turning occasionally, until crisp. Transfer to a paper towel–lined plate. When cool enough to handle, chop into small pieces.",
    "To skillet on medium-low, add onion and garlic and sauté for 2 to 3 minutes, until softened. Add spinach and sauté for 3 to 4 minutes, stirring frequently, until wilted. Remove from heat.",
    "If needed, cut a thin slice from long side of each potato so they sit flat on sheet. Cut an oval into the top of each potato and scoop out flesh using a spoon or a melon baller, leaving a shell about 1/3-inch thick. Reserve potato flesh for future use. (MAKE AHEAD: Potatoes can be baked, cooled and scooped up to 2 days in advance. Cover and refrigerate.)",
    "Sprinkle potatoes with salt and pepper. Divide spinach mixture and bacon evenly among potatoes. Carefully crack 1 egg into each potato and top with cheese, dividing evenly. Bake for 18 to 20 minutes, to desired doneness of egg. In a small bowl, combine yogurt and scallions and serve with potatoes."
  ],
  "firstAdded": "2014-07-31T02:15:47.028000",
  "hash": "94e5eee8bf470d90a59d0bef10fa58717f7d3987",
  "href": "http://www.cleaneatingmag.com/recipes/classics-made-clean/egg-n-baked-potatoes/",
  "image": "http://d1ujpofy5vmb70.cloudfront.net/wp-content/uploads/2013/05/EggNCheese.jpg",
  "ingredients": [
    "0",
    "Olive oil cooking spray",
    "4 large Russet potatoes (about 9 oz each), scrubbed",
    "2 slices all-natural turkey bacon (no nitrites or nitrates added)",
    "1/4 cup finely chopped yellow onion",
    "2 cloves garlic, minced",
    "6 lightly packed cups baby spinach",
    "1/4 tsp each sea salt and fresh ground black pepper",
    "4 large eggs",
    "1/4 cup grated reduced-fat cheddar cheese",
    "1/2 cup 2% plain Greek yogurt",
    "2 tbsp chopped scallions or chives"
  ],
  "keywords": [
    "olive",
    "oil",
    "cooking",
    "spray",
    "russet",
    "potatoes",
    "scrubbed",
    "slices",
    "allnatural",
    "turkey",
    "bacon",
    "nitrites",
    "nitrates",
    "added",
    "yellow",
    "onion",
    "garlic",
    "lightly",
    "baby",
    "spinach",
    "salt",
    "black",
    "pepper",
    "eggs",
    "reducedfat",
    "cheddar",
    "cheese",
    "plain",
    "greek",
    "yogurt",
    "scallions",
    "chives"
  ],
  "title": "Egg ‘n’ Baked Potatoes",
  "users": [
    null
  ]
}