{
  "hash": "daaabe27e291f965eccda785f3e2350bb8ff23e5",
  "title": "Marinated Pork",
  "image": "https://patijinich.com/wp-content/uploads/2017/09/613-cesina-912x622.jpg",
  "href": "https://patijinich.com/recipe/cesina/",
  "extension": "Chrome",
  "firstAdded": "2017-10-29T13:32:31.365000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place chiles on an already hot comal or skillet set over medium heat. Toast for about 1 minute per side, flipping as they toast. Place in bowl and cover with boiling hot water. Let them soak until they plump and rehydrate, for about 20 to 30 minutes.",
    "Place the re-hydrated chiles and 1 cup of their soaking liquid in the blender, along with the garlic, vinegar, oregano, marjoram, thyme, salt and pepper and puree until completely smooth. Strain into a container and set aside. It can be stored covered in the refrigerator for up to a couple months.",
    "One by one, or two by two, place the meat slices on a chopping board in between sheets of parchment paper. With a meat mallet, pound until very thin, until you can see the paper under the meat, but it is not completely breaking apart thin, about 1/8-inch thick.",
    "Once you are done, one by one, generously brush with the marinade on both sides of the meat to completely cover. You may cook immediately or refrigerate covered for up to 24 hours.",
    "When ready to cook, set the charcoal or gas grill, outside, to medium-high heat. Or to cook indoors, place a grill pan over medium-high heat. When hot, brush with vegetable oil. Grill the meat for about 1 to 2 minutes per side until completely cooked."
  ],
  "ingredients": [
    "0",
    "12guajillo chilesstemmed and seeded",
    "4garlic cloves",
    "2tablespoonsapple cider vinegar",
    "2teaspoonsdried oregano",
    "1/2teaspoondried marjoram",
    "1/2teaspoondried thyme",
    "1 1/2teaspoonskosher or coarse sea salt",
    "1/2teaspoonfreshly ground black pepper",
    "1poundpork cutletsthinly sliced",
    "Vegetable oil to grill"
  ],
  "__v": 1
}