{
  "hash": "e7460a504a6738962f6877d8f012d889c68bbb9c",
  "title": "Lemon Herb Roasted Potato Nuggets",
  "image": "http://www.rockrecipes.com/wp-content/uploads/2013/01/square-6001.jpg",
  "href": "http://www.rockrecipes.com/lemon-herb-roasted-potatoes/",
  "extension": "Chrome",
  "firstAdded": "2015-11-14T12:51:13.268000",
  "users": [
    null,
    null
  ],
  "keywords": [
    "sized",
    "russet",
    "potatoes",
    "chunks",
    "juice",
    "lemon",
    "olive",
    "butter",
    "work",
    "butterolive",
    "oil",
    "combination",
    "good",
    "kosher",
    "salt",
    "cracked",
    "black",
    "pepper",
    "herbs",
    "oregano",
    "thyme",
    "rosemary",
    "choices",
    "garlic",
    "bulb",
    "broken",
    "pieces"
  ],
  "directions": [
    "0",
    "Parboil the potatoes in salted water for about 3-4 minutes, no longer.",
    "Meanwhile in a 375 degree F oven, heat a baking pan of sufficient size to hold your potatoes without crowding them. A glass or metal pan is fine, as long as it is well heated beforehand. This will help to prevent the potatoes from sticking to the pan.",
    "After parboiling, drain the potatoes and let them stand for 5 minutes. Then toss the potatoes with the lemon juice.",
    "Toss together so that the potatoes absorb the lemon juice.",
    "Add the salt, pepper, herbs, garlic cloves and olive oil.",
    "Transfer the seasoned potatoes, garlic and oil to the hot baking pan. These should sizzle as they hit the pan; a good indication that they will not stick. Roast the potatoes for about 60-75 minutes or until they are nicely golden brown all over, turning them every 20 minutes or so. After the first 10 minutes, give the pan a shake to make sure the potatoes are not stuck to it. The roasted garlic may have to be removed before the potatoes are finished as it generally cooks faster."
  ],
  "ingredients": [
    "0",
    "6- 8 large sized russet potatoes, peeled and cut into 1½ to 2 inch chunks",
    "juice of one lemon",
    "¼ to ⅓ cup olive oil (butter or other oil will work as well; a butter/olive oil combination is very good too)",
    "½ tsp kosher salt",
    "½ tsp cracked black pepper",
    "1½ tbsp dried herbs, oregano, thyme and rosemary are good choices",
    "1 whole garlic bulb broken into about 4 pieces (optional)"
  ],
  "__v": 2
}