{
  "hash": "045185141a14a4e619f6b917dd36dae594c0c81b",
  "title": "Easy Meat-free Lasagna\nRecipe by Amy Webster Preparation: 20-30 minutes Cook time: 30 minutes Serving: 4-6",
  "image": "",
  "href": "https://katu.com/amnw/am-northwest-cooking-recipes/hearty-meat-less-lasagne",
  "extension": "Chrome",
  "firstAdded": "2018-10-01T04:07:18.038000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400? and prepare lasagna noodles according to package, al dente.",
    "While noodles are cooking, prepare your vegan ricotta and crumbles. For the crumbles, heat olive oil in skillet and add soy crumbles, stirring occasionally. Once heated and slightly browned, add 1 ½ to 1 ¾ jars of marinara sauce (depending on sauce preference). Heat on low for 5-10 minutes.",
    "To make vegan ricotta, combine tofu, cashews, plant-based milk, garlic, lemon juice, agave, salt, oregano, and fresh basil to a food processor. Blend until smooth. Add more salt if needed, to desired taste. Remove mixture and place into mixing bowl. Add chopped spinach and mix.",
    "Once lasagna noodles are cooked to al dente, drain and dry. Using a 13”x9” casserole dish, add a small amount of marinara sauce to the bottom and spread around, just enough to prevent the noodles from sticking. Place one layer of lasagna noodles (three noodles) on the bottom, top with crumble-marinara mixture and spread until smooth. Add dollops of vegan ricotta and spread around to make a smooth layer. Top with another layer of lasagna noodles. Add another layer of crumble-marinara mixture and spread until smooth. Top with shredded soy cheese and sprinkle with dried oregano.",
    "Bake for 30-35 minutes until bubbling at edges and cheese is melted. Allow to cool for 10 minutes. Serve and enjoy!"
  ],
  "ingredients": [
    "0",
    "Lasagna noodles, 6",
    "Marinara sauce, 2 jars",
    "1 package vegan soy crumbles (like Gardein or Boca)",
    "1 package vegan soy cheese, shredded (like Daiya or Follow Your Heart)",
    "1 12oz. package of tofu, firm – pressed and drained",
    "½ cup cashews, soaked for 2 hours or boiled",
    "¼ cup plant-based milk (soy, almond, oat, hemp, cashew, etc.)",
    "1 clove garlic, chopped",
    "2 Tbsp olive oil",
    "2 Tbsp lemon juice",
    "1 Tbsp agave",
    "2 tsp salt",
    "1 tsp oregano",
    "Small bunch of basil, fresh",
    "Large bunch of spinach, roughly chopped"
  ],
  "__v": 1
}