{
  "hash": "a239762bed68b90f30c3a6068ac387a3b79e55f8",
  "title": "chicken shawarma",
  "image": "https://www.themediterraneandish.com/wp-content/uploads/2016/01/Chicken-Shawarma-Recipe-The-Mediterranean-Dish-2-150x150.jpg",
  "href": "https://www.themediterraneandish.com/chicken-shawarma-recipe/",
  "extension": "",
  "firstAdded": "2018-05-05T18:25:06.004000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a small bowl, mix the cumin, turmeric, coriander, garlic powder, sweet paprika and cloves. Set aside the shawarma spice mix for now.",
    "Pat the chicken thighs dry and season with salt on both sides, then thinly slice into small bite-sized pieces.",
    "Place the chicken in a large bowl. Add the shwarma spices and toss to coat. Add the onions, lemon juice and olive oil. Toss everything together again. Cover and refrigerate for 3 hours or overnight (if you don’t have time, you can cut or skip marinating time)",
    "When ready, preheat the oven to 425 degrees F. Take the chicken out of the fridge and let it sit in room temperature for a few minutes.",
    "Spread the marinated chicken with the onions in one layer on a large lightly-oiled baking sheet pan. Roast for 30 minutes in the 425 degrees F heated-oven. For a more browned, crispier chicken, move the pan to the top rack and broil very briefly (watch carefully). Remove from the oven.",
    "While the chicken is roasting, prepare the pita pockets. Make tahini sauce according to this recipe or Tztaziki sauce according to this recipe. Make 3-ingredient Mediterranean salad according to this recipe. Set aside.",
    "To serve, open pita pockets up. Spread a little tahini sauce or Tzatziki sauce, add chicken shawarma, arugula, Mediterranean salad and pickles or olives, if you like. Serve immediately!"
  ],
  "ingredients": [
    "0",
    "3/4 tbsp ground cumin",
    "3/4 tbsp turmeric powder",
    "3/4 tbsp ground coriander",
    "3/4 tbsp garlic powder",
    "3/4 tbsp paprika",
    "1/2 tsp ground cloves",
    "1/2 tsp cayenne pepper, more if you prefer",
    "Salt",
    "8 boneless, skinless chicken thighs",
    "1 large onion, thinly sliced",
    "1 large lemon, juice of",
    "1/3 cup Private Reserve extra virgin olive oil"
  ],
  "__v": 1
}