{
  "hash": "b90fd84b9595af9c32f5d6389ead82c8211020be",
  "title": "Quick Chicken Tikka Masala",
  "image": "http://www.cookingclassy.com/wp-content/uploads/2016/05/quick_chicken_tikka_masala5..jpg",
  "href": "http://www.cookingclassy.com/quick-chicken-tikka-masala/",
  "extension": "Chrome",
  "firstAdded": "2016-12-10T06:11:45.839000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Pulse ginger and garlic in a food processor until finely chopped. Add onion and pulse until finely chopped. Toss chicken with 1 1/2 tsp garam masala and 1 tsp salt. Heat 1 Tbsp olive oil in a large skillet over medium-high heat. Add chicken and cook, rotating halfway through cooking, until cooked through, about 6 - 7 minutes total. Transfer chicken to a plate.",
    "Heat remaining 1 Tbsp olive oil in same skillet over medium-high heat. Add chopped onion mixture and saute until onions have softened, about 3 minutes. Add tomato paste, remaining 1 Tbsp garam masala, the paprika, and cayenne and cook, stirring constantly, 30 seconds. Add crushed tomatoes, season with salt to taste, and cook stirring occasionally until mixture is hot, about 2 minutes (you can let it simmer longer if needed if the canned tomatoes used were watery. If the canned tomatoes were thick you can add a few Tbsp of water if needed to thin the sauce mixture). Return chicken to pan and cook 1 minute longer. Remove from heat, stir in Greek yogurt and lemon juice. Serve warm over rice topped with cilantro.",
    "Recipe source: loosely based off of this recipe on Epicurious"
  ],
  "ingredients": [
    "0",
    "1 1/2-inch knob ginger, peeled",
    "4 cloves garlic, peeled",
    "1/2 large yellow onion, peeled",
    "1 1/2 lbs boneless skinless chicken breasts, diced into 1-inch cubes",
    "1 1/2 Tbsp garam masala spice blend, divided (see notes)",
    "Salt",
    "2 Tbsp olive oil, divided",
    "1 Tbsp tomato paste",
    "1 1/2 tsp ground paprika",
    "1/4 tsp cayenne pepper, more or less to taste",
    "1 (28 oz) can crushed tomatoes",
    "1/2 cup plain Greek yogurt (I used fat-free, any kind will work fine though)",
    "1 Tbsp fresh lemon juice",
    "1/4 cup cilantro leaves",
    "Cooked jasmine or basmati rice, for serving"
  ],
  "__v": 1
}