{
  "hash": "7766f283e3aa733f0c4fa45bd94366d1f5789c00",
  "title": "Mochi Pralines",
  "image": "http://blog.wagashi-net.de/wp-content/uploads/2012/01/mochi-chocolate.jpg",
  "href": "http://blog.wagashi-net.de/2012/01/mochi-pralines/",
  "extension": "Chrome",
  "firstAdded": "2015-11-29T19:02:04.005000",
  "users": [
    null
  ],
  "keywords": [
    "shiratamako",
    "japanese",
    "glutinous",
    "rice",
    "flour",
    "sugari",
    "used",
    "guarani",
    "sugar",
    "water",
    "mizuame",
    "syrup",
    "matcha",
    "cocoa",
    "sprinkling",
    "katakurikopotato",
    "starch",
    "dusting",
    "vegan",
    "chocolate",
    "ganache",
    "dark",
    "high",
    "qualityi",
    "lindt",
    "soymilk",
    "soy",
    "creamerprovamel",
    "coconut",
    "oil"
  ],
  "directions": [
    "0",
    "First prepare the filling: place all ingredients in a small bowl, place the bowl in a pan filled with hot water and melt everything together, stirr well. Pour the ganache in small silicon molds, let cool for few hours in the fridge.",
    "Mochi:",
    "Prepare the surface you will use to work with the dough (a cookie sheet or cutting board, for example) by dusting generously with potato or corn starch to prevent it from sticking.",
    "Place shiratamako flour in a glass bowl (glass is better to observe what is going on inside) and add water bit by bit, whisking constantly so it doesn’t clump. Once the water and flour are completely mixed, add sugar and whisk until smooth.",
    "Cover the bowl and microwave for 2 minutes on 600watt(not on high). Take out, stir the mochi dough very well with a wet wooden spatula, then again cover the bowl and heat for another 2 minutes.The mochi dough is done when it is translucent and very sticky( it will go “up” in the glass bowl, please keep an eye on it).",
    "Take the bowl out(careful it’s very hot!) and add mizuame/rice syrup, stir very thoroughly till the mochi is smooth, the syrup makes it soft and keeps the mochi longer fresh.",
    "Scrape the hot mochi on the prepared layer of potato starch, let cool completely, then fold it, sprinkle potato starch on top. Cut it in very small pieces. Take a small piece, brush it with starch and spread it out, try to make a thin, round “mochi sheet”, then carefull wrap it around the chocolate filling. Pinch the ends together to seal/close the mochi and sprinkle a little matcha or cocoa powder on top."
  ],
  "ingredients": [
    "0",
    "50g shiratamako, Japanese glutinous rice flour",
    "100g sugar(I used guarani sugar)",
    "100ml water",
    "10g/2 tablespoons mizuame or rice syrup",
    "Matcha and cocoa powder powder, for sprinkling",
    "Katakuriko/potato starch, for dusting",
    "Vegan Chocolate Ganache",
    "100g dark chocolate in high quality(I used “Lindt” chocolate)",
    "50ml soymilk",
    "2-3 tablespoons soy creamer(Provamel)",
    "2 tablespoons coconut oil"
  ],
  "__v": 1
}