{
  "hash": "b815335e5a755c9a7bd93cb168ea7d2ce8bca565",
  "title": "Shanghai Scallion Pancakes",
  "image": "http://thewoksoflife.com/wp-content/uploads/2016/06/shanghai-scallion-pancakes-18.jpg",
  "href": "http://thewoksoflife.com/2016/07/shanghai-scallion-pancakes/",
  "extension": "Chrome",
  "firstAdded": "2016-08-01T19:59:59.972000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Start by preparing the dough. In a medium mixing bowl, mix 2¼ cups flour, ¼ teaspoon salt, and 1 cup of warm water with a wooden spoon or rubber spatula until a sticky dough forms. The dough should be sticky, but not wet. You can add up to 2 tablespoons more flour if you feel the dough is really wet.",
    "Next, use a teaspoon of oil to coat the top of the dough round. Don’t worry about the dough sticking to the bowl for now. Cover with plastic wrap and let rest for 1 to 2 hours.",
    "Make the flour and oil roux by combining 3 tablespoons of oil, ⅓ cup of flour, and ¼ teaspoon salt. Set aside.",
    "After the dough has rested, use a teaspoon or two of oil to coat your work surface. Any clean stone or wood kitchen surface will do. Take the dough out and use a little more oil if you feel the dough is sticking to your hands or work surface. Is should be soft and pliable, and the oil keeps everything from sticking together.",
    "Divide the dough into 4 equal pieces and roll each piece out lengthwise into a long strip. Next, take about ¼ of the roux, and spread it across the entire length of the dough with your hands. Take ½ cup of the chopped scallions, and spread them generously and evenly across the length of the dough.",
    "Next, roll the dough, folding and tucking in the edges every so often so you don’t have any scallions leaking out of the sides. You end up with a little bundle of joy that you should set aside and cover with a piece of plastic wrap to avoid drying out. Repeat for the other three pancakes.",
    "Heat a cast iron pan over medium heat, and add 4 tablespoons of oil. Next, place the dough ball with the spiral pattern facing up on your work surface. Flatten it with your hands or a rolling pin, so the dough round is about one inch thick. Place it in the pan.",
    "The pan should be hot enough so the dough is sizzling, but browning slowly. Move the dough around the oil to cook the sides of the pancake. When the bottom is slightly browned (about 2 minutes), turn the pancake over gently, being careful not to splash the oil.",
    "Use a cast iron grill press or heavy pot to flatten out the pancake to between ¼-½-inch thick, and let fry in the oil for another 2 minutes. Turn it over if you think more browning is needed.",
    "Next, transfer the scallion pancake to a preheated oven at 350 degrees F, and let bake for another 5 minutes for more crisping. We used our little countertop toaster oven, which worked just fine.",
    "Take the pancakes out of the oven and cut into wedges to serve. If you like, now’s the time to sprinkle some extra salt on top to taste."
  ],
  "ingredients": [
    "0",
    "2¼ cups all-purpose flour",
    "¼ teaspoon salt",
    "1 cup warm water",
    "1 teaspoon peanut oil",
    "1",
    "3 tablespoons vegetable or peanut oil",
    "⅓ cup all-purpose flour",
    "¼ teaspoon salt",
    "2",
    "2 bunches of scallions, finely chopped (about 2 cups)",
    "Vegetable or peanut oil, for cooking the pancakes"
  ],
  "__v": 1
}