{
  "hash": "4f57a0e5dc4a92dd23dca123a5076af36088bd80",
  "title": "Chocolate Chip Cashew Butter Cookies with Turmeric, Teff, and Dried Apple (Vegan, Gluten Free)",
  "image": "http://i1.wp.com/willfrolicforfood.com/wp-content/uploads/2015/09/turmeric-teff-cashew-butter-cookies-chocolate-chip-recipe-9105.jpg?resize=685%2C457",
  "href": "http://willfrolicforfood.com/2015/09/chocolate-chip-cashew-butter-cookies-with-turmeric-teff-and-dried-apple.html",
  "extension": "",
  "firstAdded": "2015-11-11T16:29:48.783000",
  "users": [
    null
  ],
  "keywords": [
    "white",
    "rice",
    "flour",
    "mochiko",
    "teff",
    "oldfashioned",
    "rolled",
    "oats",
    "oat",
    "grind",
    "outs",
    "blender",
    "baking",
    "soda",
    "coarse",
    "salt",
    "turmeric",
    "cinnamon",
    "cashew",
    "butter",
    "cool",
    "coconut",
    "oil",
    "maple",
    "syrup",
    "vanilla",
    "chocolate",
    "chips",
    "preferably",
    "dark",
    "higher",
    "apple",
    "rings",
    "roughly"
  ],
  "directions": [
    "0",
    "Position a rack in the upper third and lower third of your oven. Preheat the oven to 375F.",
    "Line two or three large baking sheets with parchment paper.",
    "In a large mixing bowl, whisk together the the dry ingredients: sweet white rice flour, teff flour, old fashioned rolled oats, oat flour, baking soda, sea salt, turmeric, and cinnamon.",
    "In the bowl of a high powered blender, combine the *cashew butter, coconut oil, maple syrup and vanilla extract. Blend until smooth and creamy.",
    "If you're wet mix is really warm, chill it for 10-15 minutes in the fridge.",
    "Pour the wet mix into the dry mix, scraping out the bowl of the blender completely.",
    "Mix the wet and dry ingredients together vigorously for about 30 seconds (this promotes the glutinous quality in the mochiko flour and makes the cookies chewy).",
    "Stir in the chocolate chips and chopped apple rings.",
    "Using a tablespoon, scoop out heaping mounds of dough and roll them into balls between the palms of your hands. Space the cookie dough about 2 inches apart on your parchment lined baking sheets. Continue until all of the dough has been used up.",
    "Place one tray on the top rack of the oven and another on the bottom rack. Bake for 10 minutes total, turning the trays from front to back and top to bottom after 5 minutes.",
    "Remove the cookies from the oven. Continue this process with a third sheet if you have it.",
    "Let cool completely to room temperature before handling. The cookies will seem soft, crumbly and brittle if you handle them before they're cool. But once cool they hold together, pliable and chewy.",
    "Enjoy (and share!) immediately. Or store cooled cookies in a ziplock or other airtight container at room temperature for up to 3 days."
  ],
  "ingredients": [
    "0",
    "½ cup (80 grams) sweet white rice flour (mochiko)",
    "½ cup (70 grams) teff flour",
    "½ cup (50 grams) old-fashioned rolled oats",
    "½ cup (40 grams) oat flour (I grind whole rolled outs in a blender until fine)",
    "1 teaspoon baking soda",
    "½ teaspoon coarse sea salt",
    "2 teaspoons ground turmeric",
    "1 teaspoon cinnamon",
    "*1 cup (225 grams) toasted cashew butter",
    "6 tablespoons melted but cool coconut oil",
    "¾ cup plus 2 tablespoons (240 grams) maple syrup",
    "1.5 teaspoons vanilla extract",
    "1 cup chocolate chips, preferably 60% dark or higher",
    "½ cup apple rings, chopped roughly"
  ],
  "__v": 1
}