{
  "hash": "bc043eba94e767c6cc67c543fd7e08a5bd7711da",
  "title": "Buttermilk Oatmeal Bread",
  "image": "https://images.food52.com/uVX3dXVGD8ORtl0_nHDHB0UMWSM=/753x502/ca724b86-ec1f-4f86-a705-125889fe38b1--Buttermilk_Oatmeal_Bread.JPG",
  "href": "https://food52.com/recipes/40561-buttermilk-oatmeal-bread-updated",
  "extension": "Chrome",
  "firstAdded": "2019-02-03T17:00:42.140000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "Put the ingredients into the bowl of a stand mixer in the order stated. Use a big wooden spoon or a sturdy spatula to mix the ingredients together until mostly incorporated. Run the dough hook on medium speed, scraping down every so often if necessary, for about 2 minutes, or until the ingredients are all combined into a cohesive mass. Turn off the mixer, remove the hook and cover the bowl with a tea towel. Let rest for 20 – 30 minutes. Knead using the hook on medium fast speed for about 12 minutes. Shape the dough into a ball. Drizzle a bit of oil in the bottom of the bowl. Put the dough in and flip it over to coat with oil. Cover with a tea towel and let rise until doubled, 1 to 1 ½ hours, or more if necessary, which may be the case if your kitchen is cold. Punch the dough down gently and knead it gently by hand. Let it rest for 5 – 10 minutes. Line a loaf tin with parchment to create a sling overhanging the long sides of the pan. Grease the ends and corners. Shape the dough into a loaf and place in the pan. (Or, to make a cob, shape the dough into a tight ball. Using the sides of your hands, pull the dough down from the top, bringing it underneath and rotating a quarter turn each time. Put it on a piece of parchment on a cookie sheet that has at least one open edge.) Cover the dough lightly with a tea towel and allow to rise until nearly double; the top should stand no more than an inch above the rim of the pan. This will take 45 to 60 minutes, depending on the ambient temperature. About 30 minutes before you plan to bake the bread, heat oven to 400 degrees Fahrenheit. If baking a cob, use a pizza stone if you have one. (Otherwise, just bake it on the baking sheet on which it’s proving.) When the dough has risen, brush the top gently with olive oil, slash using a baker’s lame or very sharp knife, and place on a middle shelf of the oven. Bake for 15 minutes; lower the temperature to 350 degrees and bake for another 35 to 40 minutes. Let cool on a wire rack for at least an hour before slicing. This recipe was submitted by AntoniaJames on Food52. (I include this because Food52 shares many recipes with other sites, without requiring any attribution to the Food52 user who created and posted the recipe.)"
  ],
  "ingredients": [
    "0",
    "245 grams buttermilk (1 cup, 237 ml)",
    "30 ml (2 tablespoons, 1 ounce) melted butter, or a neutral vegetable oil",
    "15 ml (1 tablespoon, 15 grams) filtered water",
    "42 grams (2 tablespoons) honey, warmed",
    "6 grams kosher salt (1 heaping teaspoon of Diamond Crystal brand. NB: the density of kosher salts varies widely - another reason to use a scale)",
    "41 grams (1/2 cup / 120 ml) rolled oats",
    "405 grams bread flour (or 375 grams bread flour + 30 grams rye flour) (3 1/3 cups)",
    "7 grams (2 teaspoons + heaping ½ teaspoon) instant (rapid rise) yeast",
    "Oil for greasing the proofing bowl and the baking pan, if using"
  ],
  "__v": 1
}