{
  "hash": "b30f5e82c2192a9aa4653ce339bbe0797013c39e",
  "title": "Red Velvet Cake",
  "image": "https://www.recipetineats.com/wp-content/uploads/2016/06/Red-Velvet-Layer-Cake_4-150x150.jpg",
  "href": "https://www.recipetineats.com/red-velvet-cake/",
  "extension": "Chrome",
  "firstAdded": "2018-04-17T10:06:53.388000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Preheat oven to 180C/350F (all oven types). Butter 2 x 21cm / 8\" round cake pans (sides and base) and dust with cocoa powder.",
    "Sift the Dry Ingredients and whisk to combine in a bowl.",
    "Place butter and sugar in a bowl and beat with electric beater or in stand mixer until smooth and well combined (use paddle attachment if using stand mixer).",
    "Add eggs, one at a time, beating in between to combine. At first it will look curdle - keep beating until it's smooth.",
    "Add vegetable oil, vinegar, vanilla, buttermilk and red food colouring. Beat until combined and smooth (Note 5).",
    "Add Dry Ingredients. Beat until just combined - some small lumps is ok, that's better than over mixing.",
    "Divide batter between cake pans. Bake for 25 - 30 minutes on the same shelf, or until a toothpick inserted into the centre comes out clean. (Note 6)",
    "Rest for 10 minutes in the pan then turn out onto a cooling rack and allow to cool.",
    "Frosting",
    "Beat together cream cheese, butter and vanilla for 3 minutes (this makes it really smooth and changes from yellow to almost white). Add icing sugar and beat for 2 minutes or until frosting is light and fluffy to your taste. If your frosting seems too runny (depends on quality of cream cheese/ if the cream cheese was too soft), just add more icing sugar.",
    "Frost Cake",
    "Cut the top off the cake using a serrated knife (to make the layers neat).",
    "Spread one cake with 1 1/2 cups of frosting. Top with the other cake. Spread top and sides with remaining frosting.",
    "Optional: Crumble offcuts and use to decorate the top rim and base of the cake."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Dry Ingredients",
    "2 2/3 cups / 400 g plain cake flour (Note 1)",
    "2 tbsp / 10g cocoa powder, unsweetened",
    "1 tsp / 5g baking soda / bi-carb soda, , NOT baking powder (Note 2)",
    "Pinch of salt",
    "Wet Ingredients",
    "1/2 cup / 115 g unsalted butter, softened (1 US stick)",
    "1 1/2 cups / 330 g caster / superfine white sugar (Note 3)",
    "2 eggs, at room temperature (around 2 oz / 60g each)",
    "1 cup / 250ml vegetable oil",
    "1 tsp white vinegar",
    "2 tsp vanilla extract (or essence)",
    "1 cup / 250 ml buttermilk, at room temperature (Note 4)",
    "2 1/2 tbsp red food colouring liquid (UK: use Gel, Note 7)",
    "Frosting",
    "14 oz/ 400g Philadelphia Cream Cheese, block (not spreadable tub, UK see Note 9)",
    "1 stick / 1/2 cup / 115g unsalted butter at room temperature",
    "1 1/2 tsp vanilla extract",
    "4 cups / 450 g soft icing sugar / powdered sugar sifted"
  ],
  "__v": 1,
  "hidden": true
}