{
  "hash": "9b123e7bc7288586725f2677a6c3173adf402852",
  "title": "easy wine-braised chicken thighs with mushrooms",
  "image": "https://www.themediterraneandish.com/wp-content/uploads/2018/10/Braised-Chicken-Thighs-Recipe-4.jpg",
  "href": "https://www.themediterraneandish.com/braised-chicken-thighs-recipe/?fbclid=IwAR0g2iOuAyokLKVpcVAT2AKVUGxQ-PfrP7m-LhKj9UmVmluoaKTMt5KF82c",
  "extension": "Chrome",
  "firstAdded": "2020-04-12T02:49:41.137000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 degrees F.",
    "In a small bowl, combine the spices to make the spice mixture.",
    "Pat chicken dry and season well with salt on both sides. Now season with the spice mixture on both sides (make sure to lift skin up and rub some of the spice mixture underneath.) Leave aside for 20 minutes or refrigerate uncovered for 2 hours if you have the time.",
    "In a large braiser or Dutch oven (like this one), heat 1 to 2 tbsp extra virgin olive oil over medium-high heat until shimmering but not smoking (be sure to coat the bottom well with the EVOO.) Add chicken, skin side down, and cook undisturbed for 8 minutes until golden brown (lower heat if it starts to smoke excessively.) Turn chicken over and brown on the other side briefly (about 3 minutes). Transfer chicken to a plate for now.",
    "To the pot, add shallots and garlic. Cook briefly over medium heat until softer and fragrant. Stir in tomato paste, wine, and broth. Add bay leaves and 1tsp dry rosemary. Season with just a pinch of salt. Bring to a simmer for 4 minutes or so.",
    "Carefully nestle chicken into the liquid, making sure the liquid covers only 3/4 of the chicken thighs leaving the skins exposed. Add dry figs (or apricots) to the pot. Bring to a simmer.",
    "Transfer chicken to oven and cook, uncovered, until totally tender and liquid has reduced by about half, about 40-45 minutes (Check half way through to be sure liquid is okay, you should still have some liquid in the end.)",
    "While chicken is cooking, heat a small non stick pan, adding a very small drizzle of extra virgin olive oil. Add mushrooms and saute.",
    "About 10 minutes or before the chicken has finished cooking, add mushrooms. Return to oven for those last 10 minutes.",
    "Remove from oven. Finish with lemon juice and a garnish of fresh parsley.",
    "Serve with Lebanese rice (making sure to get some of the pan juice on top). Add a side of Greek Bean salad, of balela salad or fattoush salad."
  ],
  "ingredients": [
    "0",
    "For Spice Mixture",
    "1 tsp/ 1.20 g dried rosemary, more for later",
    "1 tsp/2 g sweet paprika",
    "1 tsp/ 1.2 g coriander",
    "1/2 tsp/ 1.15 g black pepper",
    "1/2 ts / 0.95 g ground allspice",
    "1/2 tsp / 1 g nutmeg",
    "For Chicken",
    "8 chicken thighs, bone in, leave skin on but trim all extra skin/fat",
    "Private Reserve extra virgin olive oil",
    "7 shallots, peeled and halved",
    "10 garlic cloves, roughly chopped",
    "4 tbsp tomato paste",
    "3/4 cup dry red wine (you can also use white wine if you prefer)",
    "2 cup low-sodium, reduced fat chicken broth",
    "2 bay leaves",
    "1 tsp/ 1.20 g dry rosemary",
    "3 oz/ 85 g dry figs, halved (you can use apricots instead)",
    "12 oz/ 340 g white mushrooms or Baby Bella mushrooms, cleaned, trimmed, and halved",
    "1/2 lemon, juice of",
    "Fresh parsley, a handful for garnish"
  ],
  "__v": 1
}