{
  "hash": "99c4f0498ce89d8f64df2f5e8b7007759ca64388",
  "title": "Egg Foam Pie {Šampita}",
  "image": "https://bakingwithsibella.files.wordpress.com/2014/04/0111.jpg?w=656",
  "href": "https://bakingwithsibella.com/2014/04/03/egg-foam-pie-sampita/",
  "extension": "Chrome",
  "firstAdded": "2018-12-11T13:29:49.813000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparation:",
    "Divide eggs. Place egg whites into a large mixing bowl. Beat egg yolks with sugar until pale yellow, then add milk, oil and at the end flour combined with baking powder.",
    "Pour the batter into the baking pan covered with parchment paper and bake at 350 for about 10-15 minutes or until you notice edges starting to get lightly brown.",
    "While the cake is baking, add a pinch of salt to the egg whites and mix them at the highest speed. When they are done add lemon juice and mix some more. They are done when you turn the bowl upside down and they don’t move. Leave the egg whites in the bowl as you will have to add the syrup.",
    "While the meringue is in making, place sugar and water for the syrup into a small pot and bring it to boil. Let it boil for 2-3 minutes. Then remove from heat and slowly start pouring into the egg whites while they’re still at the highest speed. You will notice the volume of the mixture quickly increasing.",
    "Now the cake should be done too, so remove it from the oven and spread the meringue all over the cake. It doesn’t matter that it’s too hot. Spread evenly and smooth it out and place it in the oven for 2 – 3 minutes. Remove it from the oven and set it on the counter.",
    "If you wish, you can melt chocolate, combine with some sour cream and drizzle over the cake.",
    "Place it in the fridge and let it cool completely. Enjoy this moist, light and fluffy dessert."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "6 large eggs at room temperature (divided)",
    "A pinch of salt",
    "½ tsp lemon juice",
    "6 TBSP sugar",
    "6 TBSP milk",
    "6 TBSP cooking oil",
    "6 TBSP all-purpose flour",
    "2 tsp baking powder",
    "Syrup:",
    "24 TBSP (about 250 g) sugar",
    "About 0.85 cup (2 dl) water",
    "Also needed:",
    "9 X 13 inch baking pan 2 or 3 inches deep (22 X 23 X 5 cm)",
    "Parchment paper",
    "2 oz chocolate (about 50 g)",
    "2 TBSP sour cream"
  ],
  "__v": 1
}