{
  "hash": "604111c9b95f9b1bae7852e523f7c0a72ab696a8",
  "title": "Blueberry Pie Cookies",
  "image": "http://1.bp.blogspot.com/-RiyyMN3htzg/UBdsboA7MwI/AAAAAAAAA4k/ZGEWcWYYIFU/s640/blueberry-pie-cookies-1.JPG",
  "href": "http://buildingbuttercream.blogspot.ca/2012/08/blueberry-pie-cookies.html",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T21:27:25.302000",
  "users": [
    null
  ],
  "keywords": [
    "blueberry",
    "pie",
    "cookies",
    "makes",
    "crust",
    "flour",
    "wheat",
    "pastry",
    "allpurpose",
    "sugar",
    "salt",
    "cold",
    "unsalted",
    "butter",
    "ice",
    "water",
    "filling",
    "blueberries",
    "sour",
    "lower",
    "riper",
    "juice",
    "zest",
    "lemon",
    "cornstarch"
  ],
  "directions": [
    "0",
    "Method",
    "Mix the flour, sugar, and salt together with a fork.",
    "Cube the butter and \"cut\" it into the flour mixture with a pastry cutter until there are no butter bits that are bigger than a pea. Make sure you don't go smaller than this, however, since you'll start to lose flakiness if the butter is too small.",
    "Add the ice water, a tablespoon or two at a time and use a fork to wet the flour/butter mixture.",
    "Keep adding until the dough just starts to hold together. You don't want the dough too wet, and you don't want to mix in the water too much. I find it useful to just use my hands to mix at this point.",
    "Divide the dough in two, cover each half with plastic wrap, and refrigerate for a couple hours at least (overnight is best). This is especially important with the whole wheat pastry flour since it makes the dough a little easier to work with.",
    "Toss the blueberries, sugar, lemon juice and zest, butter, and cornstarch in a medium bowl. Set aside.",
    "Preheat your oven to 350° F.",
    "Line the bottom of a cookie sheet with parchment paper.",
    "Remove one of the covered dough halves from the refrigerator. Divide this in half and roll out on a floured board.",
    "Using a 3-inch round cutter, cut eight circles out of the pie dough. Place these on the parchment paper, evenly spaced.",
    "Spoon a small amount (5-6 blueberries and a little sauce) into the center or each pie circle.",
    "Cut eight more circles out of the pie dough (you may have to gather the scraps and re-roll it out). Place each circle on top of the blueberry-topped bottom circles. Press down the edges with something thin (the top of a paintbrush or pen would work). Brush with egg yolk and sprinkle with sugar. Cut some small slits in the top.",
    "Bake for 10-14 minutes, or until the filling is bubbly. Cool on a wire rack. Repeat in three more batches with the rest of the pie crust and filling."
  ],
  "ingredients": [
    "0",
    "Blueberry Pie Cookies",
    "Makes approximately 32 3-inch pie cookies.",
    "Ingredients for Pie Crust",
    "2 ½ cups flour (whole wheat pastry or all-purpose)",
    "6 tablespoons sugar",
    "1 teaspoon salt",
    "2 ½ sticks cold unsalted butter",
    "~½ cup ice water",
    "Ingredients for Filling",
    "2 ½ cups blueberries",
    "½ cup sugar (my blueberries were a little sour, lower this if yours are riper)",
    "juice and zest from ½ lemon",
    "1 tablespoon melted butter",
    "1 tablespoon cornstarch"
  ],
  "__v": 1
}