{
  "hash": "b10d515f9488e89ef691a86f72fb5404c2f54841",
  "title": "Creamy Roasted Garlic Potato Soup with Crispy Buttery Croutons",
  "image": "http://thecozyapron.com/wp-content/uploads/2015/12/roasted-garlic-potato-soup_thecozyapron_12-31-15_1.jpg",
  "href": "http://thecozyapron.com/creamy-roasted-garlic-potato-soup/",
  "extension": "Chrome",
  "firstAdded": "2017-02-18T20:53:25.679000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "-Preheat oven to 400°.",
    "-Cut the tops off of the three heads of garlic, drizzle with a touch of olive oil, plus a sprinkle of salt and black pepper, and wrap each head tightly in foil; roast for 45 minutes, then once cool enough to handles, squeeze the roasted cloves from their papers and set aside.",
    "-Place a large pot over medium-high heat, and add in the butter and the oil; once melted together, add in the onion, plus a pinch of salt and black pepper, the white pepper and the Herbs de Provence, and saute for about 3-4 minutes until translucent; next add in the two, pressed garlic cloves, plus the reserved roasted garlic, and stir those in.",
    "-Add in the cubed potatoes and the chicken stock and stir to combine, and bring to the boil; cover and simmer the soup for about 30 minutes, or until the potatoes are fork tender.",
    "-Off the heat, use an immersion blender (or use a regular blender, but take care to work in batches as soup is very hot) to puree the soup completely, until smooth; add in the half & half, plus the sour cream, and use the immersion blender once more to incorporate those. (The soup should be velvety and creamy.)",
    "-Check to see if any additional salt/pepper is needed, and serve the soup with some Buttery Croutons, plus a sprinkle of chives, if desired.",
    "Buttery Croutons Ingredients:",
    "• 4 ounces French baguette, small cube",
    "• ¼ cup unsalted, melted butter",
    "• ¼ teaspoon granulated onion",
    "• ¼ teaspoon granulated garlic",
    "• Salt",
    "• Black pepper",
    "Preparation:",
    "-Preheat the oven to 425°, and line a baking sheet with foil.",
    "-Toss the cubed bread with the butter, the granulated onion and garlic, plus a couple of pinches of salt and pepper; turn out onto the baking sheet and bake for about 15 minutes, or until golden-brown and crisp.",
    "-Store any unused croutons in a ziplock bag (can be re-toasted in a toaster oven, as well.)"
  ],
  "ingredients": [
    "0",
    "• 3 whole heads garlic, plus 2 cloves pressed through garlic press, divided use",
    "• Olive oil",
    "• Salt",
    "• Black pepper",
    "• 3 tablespoons unsalted butter",
    "• 1 large onion, diced",
    "• ¼ teaspoon ground white pepper",
    "• 1 teaspoon Herb de Provence",
    "• 6 medium russet potatoes, peeled and cubed (roughly 2 ½ pounds)",
    "• 4 cups chicken stock, hot",
    "• 1 cup half and half",
    "• ¼ cup sour cream",
    "• Buttery Croutons (recipe below)",
    "• Chives, minced for garnish"
  ],
  "__v": 1
}