{
  "hash": "628da3f5a778708f8d19f1b79cd2ccca8a1abbb0",
  "title": "INDONESIAN SEAFOOD CURRY WITH MONKFISH, TIGER PRAWNS AND SQUID",
  "image": "https://www.rickstein.com/wp-content/uploads/2014/11/Rick-Stein-Indonesian-seafood-curry-at-Porthleven-220x250.jpg",
  "href": "https://www.rickstein.com/recipe/indonesian-seafood-curry-with-monkfish-tiger-prawns-and-squid/",
  "extension": "Chrome",
  "firstAdded": "2016-01-02T21:25:39.945000",
  "users": [
    null
  ],
  "keywords": [
    "serves",
    "fillets",
    "monkfish",
    "john",
    "dory",
    "barramundi",
    "gurnard",
    "bass",
    "taken",
    "mediumsized",
    "fish",
    "prepared",
    "squid",
    "pouches",
    "long",
    "raw",
    "prawns",
    "white",
    "pepper",
    "lime",
    "juice",
    "balinese",
    "spice",
    "basa",
    "gede",
    "oil",
    "kaffir",
    "leaves",
    "torn",
    "pieces",
    "fat",
    "lemongrass",
    "stalks",
    "bruised",
    "asian",
    "chicken",
    "stock",
    "coconut",
    "milk"
  ],
  "directions": [
    "0",
    "Cut the fish into 3–4cm chunks. Slit the body pouches of the squid along one side, open them out flat and score the inside into a fine diamond pattern with the tip of a small, sharp knife. Cut the squid pouches lengthways into 4 wide strips, and then each strip across into 3 pieces. This helps the pieces to curl attractively during cooking. Score the fins in the same way and cut each one in half. Separate the tentacles into pairs.",
    "Put the fish and squid into a shallow bowl with the peeled prawns and sprinkle with ½ teaspoon salt, some pepper and the lime juice. Mix together well. Then add half the spice paste and rub it well all over the pieces of seafood.",
    "Heat the oil in a large, deep frying pan over a medium heat. Add the remaining spice paste and fry gently for 2–3 minutes until it starts to smell fragrant. Add the kaffir lime leaves, lemongrass and stock and simmer for 1 minute.",
    "Add the pieces of fish (not the squid or the prawns) to the pan and leave to cook for 1 minute, then turn them over and cook for a further minute. Add the coconut milk to the pan, together with the squid and prawns, and simmer for 2 minutes until all the seafood is just cooked. Season to taste with a little more salt and lime juice to taste if you wish and serve."
  ],
  "ingredients": [
    "0",
    "Serves 4",
    "400g fish fillets, such as monkfish, John Dory, barramundi, gurnard or sea bass, taken from a medium-sized fish",
    "250g prepared medium-sized squid (pouches about 18cm long)",
    "12 large raw peeled prawns",
    "Freshly ground white pepper",
    "1 tbsp lime juice",
    "200g Balinese spice paste (basa gede)",
    "2 tbsp vegetable oil",
    "4 kaffir lime leaves, torn into small pieces",
    "2 fat lemongrass stalks, halved and bruised",
    "120ml Asian chicken stock",
    "250ml coconut milk"
  ],
  "__v": 1
}