{
  "hash": "2c1896ae7e62f46800673c97959903980123f5e7",
  "title": "Spinach and Chickpea Rice Pilaf",
  "image": "http://www.budgetbytes.com/wp-content/uploads/2015/11/Spinach-and-Chickpea-Rice-Pilaf-text.jpg",
  "href": "https://www.budgetbytes.com/2015/11/spinach-and-chickpea-rice-pilaf/",
  "extension": "Chrome",
  "firstAdded": "2017-02-24T02:13:29.331000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Mince the garlic and dice the onion. Sauté the onion and garlic with olive oil over medium heat in a deep skillet until the onion are soft and transparent (about 3-5 minutes).",
    "Add the smoked paprika, oregano, cumin, and dry rice to the skillet. Stir and cook over medium heat for about 2 minutes to toast the rice and spices. You should hear the rice popping and it should begin to look slightly transparent.",
    "Drain the chickpeas and add them to the skillet along with the frozen spinach (no need to thaw). Zest the lemon and set the zest aside. Squeeze about 2 Tbsp of the lemon's juice into the skillet. Add the vegetable broth and stir the ingredients to combine.",
    "Place a lid on the skillet and turn the heat up to medium-high. Allow it to come to a boil, then immediately turn it down to low or just above low. Let the skillet continue to simmer for 20 minutes, with the lid in place. After 20 minutes, turn the heat off and let it sit undisturbed for an additional 5 minutes.",
    "Remove the lid and fluff the skillet with a fork to redistribute the chickpeas and spinach. Sprinkle the lemon zest and crumbled feta over the skillet just before serving."
  ],
  "ingredients": [
    "0",
    "2 Tbsp olive oil $0.32",
    "2 cloves garlic $0.16",
    "1 yellow onion $0.14",
    "1 tsp smoked paprika $0.10",
    "½ tsp oregano $0.05",
    "¼ tsp cumin $0.03",
    "1 cup long grain white rice $0.33",
    "½ lb. frozen chopped spinach $0.80",
    "15oz. can chickpeas $1.15",
    "1 fresh lemon $0.85",
    "1¾ cup vegetable broth $0.22",
    "1 oz. feta, crumbled $0.56"
  ],
  "__v": 1
}