{
  "hash": "bddb0c015cab01c6b5cf5c9585d669e7c74237e3",
  "title": "Cream Cheese Danish From Scratch",
  "image": "https://www.littlehouseliving.com/wp-content/uploads/2017/07/cream-cheese-danish.png",
  "href": "https://www.littlehouseliving.com/cream-cheese-danish.html",
  "extension": "Chrome",
  "firstAdded": "2018-09-07T17:53:03.827000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Mix together the warm water, 1/2 teaspoon sugar, and yeast. Let it sit in a separate bowl for 5 or so minutes.",
    "In a saucepan, mix together the sour cream and the butter on a low heat. Stir together until the butter melts. Make sure you are continually stirring so it doesn’t burn.",
    "Add the sugar and the salt into the sour cream/butter mixture. Stir on a low heat until the sugar is melted. Remove from heat and let it cool for a bit before adding the yeast.",
    "Add the egg to the sour cream mixture and then mix in the yeast.",
    "Add in the flour and mix well. Mine is not mixed well in this picture.",
    "Another breakfast idea! Homemade Toaster Strudels",
    "Cover and let it chill in the fridge for at least 2 hours, you can leave it overnight if you want and finish it the next morning.",
    "Mix together the 1/4 cup sugar, cream cheese, and vanilla extract. It helps if the cream cheese is softened.",
    "Roll out the dough like you are rolling out pizza dough.",
    "Cut slits on either side of the dough about 2 inches long.",
    "Spread the cream cheese mixture in the center of the dough.",
    "Fold the flaps of dough back over the center to make it look like a braid. Bake at 350F for 15-18 minutes. *You may need to bake it longer than this!",
    "Yum! If you want you could create a sweet glaze with powdered sugar and milk. Or you could add jam inside with the cream cheese to give it a little fruit flavor! I’m going to make a glaze with mashed up strawberries and a little sugar. Also, if you want to make this ahead of time this recipe works great! Just prepare as directed above, bake, and freeze whole."
  ],
  "ingredients": [
    "0",
    "1/4 cup warm water",
    "1 Tablespoon yeast",
    "1/2 teaspoon sugar",
    "1/2 cup sour cream",
    "1/4 cup butter",
    "1/4 cup sugar",
    "1/2 teaspoon salt",
    "1 egg",
    "2 cups all-purpose flour",
    "1 8oz package cream cheese",
    "1/4 cup sugar",
    "1/2 teaspoon vanilla extract"
  ],
  "__v": 1
}