{
  "hash": "530ac15c32ae94036f03c6e1dc4c09acdea2be6d",
  "title": "French Bread Rolls",
  "image": "http://www.finecooking.com/CMS/uploadedImages/Images/Cooking/Articles/Issues_41-50/fc48gr068-01_xlg.jpg",
  "href": "http://www.finecooking.com/recipes/french-bread-rolls.aspx",
  "extension": "Firefox",
  "firstAdded": "2016-01-16T19:17:43.178000",
  "users": [
    null
  ],
  "keywords": [
    "unbleached",
    "allpurpose",
    "flour",
    "asneeded",
    "tbs",
    "clarified",
    "butter",
    "storebought",
    "ghee",
    "light",
    "olive",
    "oil",
    "greasing",
    "rising",
    "bowl",
    "plastic",
    "wrap",
    "activedry",
    "yeast",
    "sugar",
    "lukewarm",
    "water",
    "dry",
    "nonfat",
    "milk",
    "scant",
    "salt",
    "grinds",
    "black",
    "pepper",
    "medium",
    "rye",
    "use",
    "dusting",
    "yellow",
    "cornmeal",
    "preferably",
    "bakers",
    "peel",
    "baking",
    "sheets",
    "coarse",
    "sprinkling"
  ],
  "directions": [
    "0",
    "Sift the flour into a medium bowl; set aside. Brush some melted clarified butter on the interior of a large (5-qt.) bowl and one side of a piece of plastic wrap large enough to cover the bowl; set aside.",
    "In a small bowl, stir the yeast and a pinch of sugar into 1/2 cup of the lukewarm water until dissolved. When the yeast is visibly active and bubbling, pour the remaining 1-1/2 cups lukewarm water into another large bowl. Add the 2 Tbs. clarified butter, the 2 tsp. sugar, the dry milk, salt, pepper (if using), and the dissolved yeast mixture. Add about 3 cups of the flour and stir with a wooden spoon until incorporated. Continue to add more flour (about 1/2 cup at a time) and stir until the dough comes together in a mass that leaves the sides of the bowl and is no longer easy to stir; you may not need all the flour.",
    "With a sturdy rubber spatula, scrape the dough out onto a lightly floured work surface. Flour your hands and knead the dough until it’s perfectly smooth and elastic, 3 to 5 minutes. If the dough sticks, use your bench knife or bowl scraper to release it. Add only as much additional flour as necessary to keep the dough from sticking to your hands and the work surface.",
    "Put the dough in the greased bowl and brush the top of the dough with melted clarified butter. Cover with the greased plastic wrap and then with a clean dishtowel. Let the dough rise in a warm, draft-free spot until doubled in volume, about 2 hours.",
    "Uncover the bowl. Lightly flour the back of your hand and punch down the dough by giving it several swift swats. The dough will be quite sticky and spongy, so use your fingertips to help release it from the sides of the bowl, allowing it to deflate. At this point, you can either refrigerate the dough for later (see Make-Ahead Tips, below) or continue the rise. To continue the rise, turn the dough over in the bowl, cover as before, and let rise again until doubled in volume and light in texture, about 2 hours.",
    "Lay two clean, dry dishtowels over two baking sheets and dust them very heavily with a layer of the medium rye or all-purpose flour.",
    "Deflate the dough by pulling it away from the sides of the bowl. Turn the dough out onto your floured work surface and gently knead the dough a few times to finish deflating. Using the blade of your bench knife or bowl scraper, cut the dough in half. Cut each half in-half again and then cut each piece into three equal pieces for a total of twelve. Cover the pieces with a clean dishtowel. Flour your hands and remove one piece of dough from under the towel, leaving the remaining pieces covered. Shape the rolls into either rounds or ovals. Cover the rolls with a clean dishtowel. Let the rolls rise, covered, until they look light and billowy, 45 minutes to 1 hour.",
    "You want to bake your rolls as low in the oven as possible, with a metal baking pan of ice water beneath them. If you have an electric heating element on the oven floor, set an oven rack on the lowest position for the ice water pan, and position your baking stone or baking tiles on a second rack just above the pan. Otherwise, you can set your tiles or stone on the lowest oven rack and put the ice water pan directly on the floor of the oven. If you're using baking sheets instead of a stone or tiles, you may need two racks for the sheets; position them as low as possible.",
    "Begin heating the oven to 450°F at least thirty minutes before baking. Your tiles or stone and the empty ice water pan should be in the oven as it heats; if you're baking the rolls on baking sheets, don't put them in the oven yet.",
    "If baking on tiles or stone, sprinkle your peel with cornmeal. Otherwise, line two large, shallow baking sheets with parchment and sprinkle them with cornmeal. Put 4 ice cubes in a 1-cup measuring cup and add enough cold water to reach the 1/4-cup mark. Set the cup next to the oven.",
    "Gently lift the risen rolls and invert them (smooth side up) onto the prepared peel or baking sheets, but don’t remove any clinging flour from their surface. For oval rolls, use a sharp knife or a razor to make a slash from one end of the top to the other. For round rolls, use scissors to snip a crisscross in the top. Sprinkle the rolls with coarse salt.",
    "If using tiles or a stone, lift the loaded peel by the handle and give it a little shake to make sure that the rolls aren’t sticking. Open the oven door and cover the window with a towel (to prevent contact with the ice water, which could break the window), put the peel all the way in the back of the oven over the tiles. With one swift jerk, remove the peel, leaving the rolls on the hot tiles. (It’s okay if the rolls touch when they land.) Immediately toss the ice water into the hot metal pan, remove the towel, and quickly shut the door.",
    "If using baking sheets, put the loaded baking sheets in the oven and toss the ice water into the pan as directed in the baking-tile instructions above. If you’re using two racks, switch the positions of the sheets after the first 12 minutes of baking.",
    "Bake the rolls at 450°F until light golden brown, 20 to 25 minutes. Reduce the heat to 400°F and bake until deep golden brown, about 5 minutes. Turn the oven off an let the rolls remain in the oven with the door closed to finish crisping for another 5 minutes. Remove the rolls from the oven and let them cool on a wire rack for at least 20 minutes.",
    "You can make the dough up to two days (one day if-you’ve added extra flavorings) before shaping and baking by punching it down after the first rise and storing it, well covered, in the refrigerator. Bring the dough close to room temperature before shaping, and let the shaped rolls rise longer until they’re soft and very billowy. Baked rolls can also be frozen in doubled heavy-duty freezer bags for up to two weeks. Thaw at room temperature in the sealed bags. To reheat, put the rolls on a wire rack set over a shallow baking sheet and bake in a 400°F oven for 5 minutes. Turn off the oven and let the rolls remain there until the crusts become crisp, about 5 minutes more."
  ],
  "ingredients": [
    "0",
    "6 cups unbleached all-purpose flour; more as-needed",
    "2 Tbs. melted clarified butter, store-bought ghee, or light olive oil; more for greasing the rising bowl and plastic wrap",
    "1 package (2-1/4 tsp.) active-dry yeast",
    "2 tsp. sugar, plus a pinch for the yeast",
    "2 cups lukewarm water (about 70ºF)",
    "1-1/4 oz. (1/2 cup) dry nonfat milk",
    "Scant 1 Tbs. table salt",
    "A few grinds of black pepper (optional)",
    "About 1 cup medium rye flour (optional; use all-purpose flour as a substitute) for dusting",
    "Yellow cornmeal (preferably medium ground) for the baker’s peel or baking sheets",
    "Coarse salt for sprinkling"
  ],
  "__v": 1
}