{
  "__v": 2,
  "directions": [
    "0",
    "Mince the garlic, shitake mushrooms, and slice the green garlic finely.",
    "Roughly chop the pork loin and Spam. Dump the meat into the work bowl of a food processor, and pulse until ground into a rough paste. Add the garlic and pulse a few more times to combine.",
    "Put the meat mixture into a mixing bowl, and add the green garlic, shitake mushrooms, egg, panko breadcrumbs, and all seasonings. Mix thoroughly.",
    "Take a tiny spoonful of the meat mixture, and microwave for 45 – 60 seconds until cooked. Taste to check seasonings, and adjust if necessary.",
    "Lay a square won ton skin in the palm of your hand, and moisten all edges with a little water, using your fingertips.",
    "Fill the won ton skin square with a heaping teaspoon of the meat mixture. You don’t want to use so much meat mixture that you have a hard time sealing the gyoza… but you don’t want to use too little either – that would be a very unsatisfying bite, leaving you to wonder, “Where’s the beef?” Or in this case, “Where’s the spam?”",
    "Fold each square over horizontally, forming a long rectangle. Pinch the edges closed, sealing out any air, and haphazardly forming pleats at the top as shown.",
    "Stack the gyoza side by side on a parchment lined baking sheet until you finish. This recipe will approximately fill about 1 package of wonton skins (48 gyoza).",
    "You have the option of steaming, pan frying, or deep frying your gyoza. Today, I decided to pan fry them. You will need to work in batches.",
    "Heat a large wok with 1 tsp oil on medium. Place 12 gyoza into the wok and cook for 2-3 minutes until golden brown on one side. Make sure you have a large lid that will fit the pan or wok.",
    "Flip the gyoza, and cook for 2-3 minutes until golden brown on the other side.",
    "Add 1/4 cup of water to the center, and as the water sizzles, place the lid on top, trapping the steam in the wok. Steam the gyoza for about 1-2 minutes, until all the water has evaporated.",
    "Work in 4 batches, until all the gyoza are cooked.",
    "If you prefer to deep fry them: Heat about 3 inches of canola oil in a small pot, and when the oil is hot, drop 3-4 gyoza in at a time. Deep fry on medium heat until golden brown."
  ],
  "firstAdded": "2014-06-17T23:01:40.934000",
  "hash": "9705b694341fc8071c40462ba66aa0d6e3212bc0",
  "href": "http://www.the350degreeoven.com/2011/02/meat/prize-winning-spam-gyoza-yes-spam/",
  "image": "http://2.bp.blogspot.com/_5T9XUsS-QtY/S3eEKfrLYjI/AAAAAAAAAGg/m4wUzVEbQPs/s400/DSC_0818.JPG",
  "ingredients": [
    "0",
    "1 can of Spam Lite",
    "9 oz raw pork loin (2 small pork loin chops, fat trimmed off)",
    "3 cloves garlic, minced",
    "2 stalks green garlic (or green onion), chopped",
    "8 shitake mushrooms, stems discarded, minced",
    "1 egg",
    "1/2 tsp. salt",
    "1/2 tsp. black pepper",
    "1 tsp. soy sauce",
    "2 tsp. sesame oil",
    "1/2 c. panko breadcrumbs",
    "1 pkg. won ton skins",
    "This recipe will make approximately 48 wontons. You may substitute green onion stalks for",
    "the green garlic – but if you can find it, green garlic imparts a better flavor."
  ],
  "keywords": [
    "spam",
    "lite",
    "raw",
    "pork",
    "loin",
    "chops",
    "fat",
    "trimmed",
    "garlic",
    "stalks",
    "green",
    "onion",
    "shitake",
    "mushrooms",
    "stems",
    "discarded",
    "egg",
    "salt",
    "black",
    "pepper",
    "soy",
    "sesame",
    "oil",
    "panko",
    "breadcrumbs",
    "pkg",
    "won",
    "ton",
    "skins",
    "recipe",
    "make",
    "wontons",
    "imparts",
    "better",
    "flavor"
  ],
  "title": "Spam Gyoza",
  "users": [
    null
  ]
}