{
  "hash": "fda511f6f6577f25274a6f36c5f352ba54bdde8b",
  "title": "Dýňové risotto",
  "image": "",
  "href": "http://www.menudomu.cz/dynove-risotto/",
  "extension": "Chrome",
  "firstAdded": "2015-12-08T09:36:11.273000",
  "users": [
    null
  ],
  "keywords": [
    "ingredience",
    "porce",
    "hovzho",
    "krku",
    "lce",
    "olivovho",
    "oleje",
    "morkov",
    "kosti",
    "cibule",
    "kousek",
    "bulvy",
    "celeru",
    "cca",
    "vvaru",
    "bobkov",
    "listy",
    "vtv",
    "tyminu",
    "trocha",
    "soli",
    "maso",
    "kousk",
    "oitn",
    "oloupan",
    "vtviek",
    "lstk",
    "alvje",
    "liky",
    "trochu",
    "erstv",
    "namletho",
    "pepe",
    "hrsti",
    "risotto",
    "msla",
    "alotka",
    "bannov",
    "dcl",
    "suchho",
    "blho",
    "vna",
    "dov",
    "pyr",
    "ppadn",
    "pep",
    "parmaznu"
  ],
  "directions": [
    "0",
    "Začněte hovězím krkem a základem na omáčku. Po vzoru z restaurace jsem krk pekla v troubě, ale stejně byste mohli postupovat místo toho na plotně a dusit před tím zarestované ingredience. Troubu budete ale stejně zapínat kvůli dýni, tak se vám to takhle možná bude zdát i snazší. Vymažte pekáč olejem. Nejen na dně ale i po stranách, aby se vám pak dobře seškrabávaly připečeninky, které budete po pečení chtít vmíchat do omáčky, aby byla silnější a měla lepší barvu. Poté vložte po celém povrchu lehce naolejovaný kus krku vcelku, měl by být spíše nižší. Morkové kosti, kořenovou zeleninu, bylinky a osolte maso (ne to kolem, to až po redukování na konci). Roztopte v troubě horní ohřev, tedy gril, a nechte všechno asi 20 minut zatáhnout a zapéct. Rychleji by to šlo na velké nepřilnavé pánvi na troše oleje, kde by se všechno opeklo i více dohněda, takže pokud vás nemrzí to udělat takhle a chcete mít výsledek opravdu dokonalý, klidně to zmákněte na plotně. Poté stačí troubu nastavit na 175 °C. Ohřát vývar a asi do poloviny výšky jím vše v pekáči podlít (do pekáčku se musí všechno tak akorát vejít, neměl by být obří). Není-li vývar, musí stačit voda. Přikryjte buď alobalem a nebo poklicí, pokud ji vaše zapékací nádobí má a šup s tím do trouby. Počítejte s tím, že maso bude potřebovat možná i 2,5 nebo 3 hodiny celkem.",
    "Na poslední hodinu k němu přidejte vedle (a nebo položte na to) i dýni, kterou je třeba změkčit, abychom mohli mixovat pyré. Teplotu nechte pořád stejnou. Dýni stačí oloupat a nakrájet na asi dvoucentimetrové kousky. Dát do zapékací misky s pečícím papírem, zakápnout olivovým olejem, osolit, opepřit a přidat další bylinky. Promíchejte rukama, ať se vše dostane všude. A hrc tam s tím. Po téhle době vložte dýni do mixéru a rozmixujte. Chtělo-li by to trochu tekutiny, přidejte pár lžic vývaru, který stejně budete potřebovat na risotto. Směs ochutnejte. Dýně je dosti sladká, takže možná bude chtít dosolit, aby byla tak akorát. Hladce rozmixnuté pyré je připraveno zamířit k rýži.",
    "Co se rýže týče, nejraději na risotto používám druh Carnarolli. Můžete ale stejně tak zakoupit Arborio nebo Vialone Nano. Kulatozrnná je ale na pravé risotto určitě třeba. Na polovině másla orestujte do sklovita jemně nakrájenou šalotku (nemůžete-li ji sehnat, zkuste koupit bílou cibuli, která je také jemnější než obyčejná žlutá). Potrvá to na středním plameni asi 4 nebo 5 minut. Pak přidejte rýži. Tu tam šmrdlete tak minutu dvě. Většinou platí, že stačí dvě hrsti na osobu. Mě tedy dvě moje hrsti stačí až až, navíc když máme ještě maso s omáčkou k tomu. Nicméně třeba Jirkovi Babicovi by stačily spíš dvě jeho hrsti. A to píšu proto, že má velké ruce, ne že by moc jedl, o tom nemám žádné bližší info. Osolte. Ve chvíli, kdy by hrozilo, že začne šalotka už za chvíli zlátnout, šup tam s bílým vínem a nechte vyvařit. To bude zase chvilka. Teď přidejte teplotu plotýnky, ať to neskomírá. Přidejte dýňové pyré, vmíchejte a můžete mít do vývaru. Ten by měl být ideálně zeleninový a nesolený. Pokud solený bude, tak nesolte rýži před tím.",
    "Množství vývaru je přibližné. Každá rýže saje jinak, bude se to každému trochu jinak odpařovat podle toho, jak nabombí plotýnku, kolik porcí bude dělat a taky na jaké pánvi nebo rendlíku. Vždycky přidejte jen tolik vařicího vývaru, aby tekutina těsně pokryla rýži a udělala nad ní milimetrovou hladinku. Chce to také často promíchávat. Vše musí celkem bujaře vařit. Některá rýže je hotová za 12 minut, ale té mé to trvá vždycky tak 18. Prostě pak začněte ochutnávat. Ne že bychom ji měli rozvařit, ale chroupat ještě tvrdé vnitřky zrn rozhodně nemusíme. A jeden můj soukromý tip na závěr. Risotto na mě bylo i přes správné osolení pořád dost sladké kvůli pečené dýni, takže já ho ještě dorovnávám pár kapkami citronové šťávy nebo rýžového octa. Ital by nadšen asi nebyl, ale já jsem takhle třeba rozhodně spokojenější. A úplně ve finiši na poslední minutu, kdy už je plotýnka vypnutá, přidejte zbytek másla a strouhaný parmazán. Ihned podávejte.",
    "Během téhle vařby se ale musíme ještě postarat o maso a omáčku. Po těch třech hodinách by mělo být maso dosti měkké, aby šlo dobře nakrájet na plátky, jak to půjde, ale aby drželo při sobě, protože ho budeme chtít ještě z obou stran opéct na trošince tuku sebraného z omáčky spolu s pár lístky šalvěje. Omáčku stačí zcedit, přidat do ní seškrábnuté přismahnutinky (drží na obracečce jako karamel, ale jak bude omáčka horká, za chvilinku se v tom rozpustí, když ji tam ponoříte). Když omáčku necháte redukovat cca na polovinu, bude táhlá a bude připomínat takovou domácí rychlou demi-glace. Solte až nakonec.",
    "Teď ještě co se týče tapenády. V restauraci se jí nacházela asi jedna lžička nahoře na mase. Já jsem to v domácím provedením nepovažovala za nezbytnou složku pokrmu. Vlastně i jen samotné risotto ozdobené hoblinkami parmazánu a lístky šalvěje by bohatě stačilo na skvělý oběd nebo i večeři. Tapenáda se dá i pořídit. Jedná se o rozmixovanou pastu nejčastěji obsahující tmavé olivy, kapary, ančovičky, česnek, olivový olej, někdy i provensálské koření. Variant je opravdu hodně, stejně tak i poměry jednotlivých ingrediencí. Zpravidla oliv bývá stejně jako kaparů, ančoviček polovina množství. Olivový olej a česnek už nechám na vaší chuti.",
    "Ve videu ukazuju ještě kupovanou demi-glace. Za 125 Kč jsem ji pořídila v lahůdkářství u restaurace La Gare u pražského Náměstí Republiky. Nicméně se mi zdá nějaká podezřele tekutá ve studeném stavu, takže než vám ji tu doporučím, musím ji vyzkoušet. Nechávám si načnutí skleničky na nějakou příležitost, kdy budu servírovat jídlo alespoň čtyřem nebo šesti lidem."
  ],
  "ingredients": [
    "0",
    "Ingredience na 2 porce",
    "250 g hovězího krku",
    "2 lžíce olivového oleje",
    "2 morkové kosti",
    "1 cibule",
    "kousek bulvy celeru",
    "cca 300 ml vývaru",
    "3 bobkové listy",
    "pár větví tymiánu",
    "trocha soli na maso",
    "----------------------------------------------------",
    "200 g kousků z očištěné a oloupané dýně",
    "pár větviček tymiánu",
    "pár lístků šalvěje",
    "2 lžíce olivového oleje",
    "půl lžičky soli",
    "trochu čerstvě namletého pepře",
    "----------------------------------------------------",
    "4 hrsti rýže na risotto",
    "50 g másla",
    "1 větší šalotka (banánová)",
    "0,5 dcl suchého bílého vína",
    "dýňové pyré",
    "cca 600 - 700 ml vývaru",
    "případně sůl",
    "pepř",
    "50 g parmazánu"
  ],
  "__v": 1
}