{
  "hash": "46c606f44076c0556b35ddb9a0b5441feec102e4",
  "title": "Fluffy Ricotta Gnocchi",
  "image": "http://www.recipe30.com/wp-content/uploads/2016/10/gnocchi-ricotta-with-tomato-848x477.jpg",
  "href": "http://www.recipe30.com/gnocchi-made-with-ricotta-cheese.html/",
  "extension": "Chrome",
  "firstAdded": "2017-04-08T21:45:09.797000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Boil a large pot of water. Once boiling, add salt (should taste like sea water).",
    "Grate the Parmesan cheese. Set aside.",
    "In a food processor (or mixing bowl) crack 1 whole egg plus one egg yolk.",
    "Add the cheese, flour, salt and ricotta and blitz until well mixed. Or do it by hand using a spatula to lightly fold together.",
    "Dust your bench or work area with flour. Place the batter on your bench, flour it and lightly roll it into one big loaf. Cut into 4 strips lengthwise and roll each strip into a log approx 3/4 inch thick. Then cut into small pieces and place aside on a large flour dusted plate with spaces in between each piece.",
    "Once water has boiled, add the salt and place all the gnocchi in the boiling water. The gnocchi will rise to the surface and cook for a further 3 minutes. Scoop out of water and rest aside.",
    "In a frying pan, add some olive oil, once oil is hot, add your gnocchi and saute until you get a slight golden brown colour.",
    "Add the marinara (Napolitana) sauce, cook for one minute.",
    "Shred the basil leaves, and to gnocchi, toss and serve hot immediately.",
    "Add a little more olive oil on top and some freshly grated Parmesan cheese."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "350g - 12 oz Ricotta cheese (Good dry quality)",
    "2 eggs (1 whole, 1 yolk)",
    "60g - 2oz Parmesan cheese",
    "100g - 3.5 oz all purpose flour",
    "1/4 tsp salt",
    "Olive oil",
    "Marinara or Napolitana sauce (see recipe here)",
    "A few leaves of fresh bail"
  ],
  "__v": 1
}