{
  "hash": "75a35077151a779d9e5dc33562350067554c7dc7",
  "title": "Classic Chicken Noodle Soup",
  "image": "//www.melskitchencafe.com/wp-content/uploads/2013/04/Chicken-Noodle-Close-Up-jpg.jpg",
  "href": "http://www.melskitchencafe.com/classic-chicken-noodle-soup/",
  "extension": "Chrome",
  "firstAdded": "2015-03-03T20:09:42.220000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "neck",
    "giblets",
    "lowsodium",
    "broth",
    "bay",
    "leaves",
    "salt",
    "pepper",
    "stalks",
    "celery",
    "chunks",
    "carrots",
    "onion",
    "pieces",
    "depending",
    "egg",
    "noodles",
    "cream",
    "halfandhalf",
    "combined",
    "cornstarch",
    "creamystyle"
  ],
  "directions": [
    "0",
    "Rinse the chicken, removing the neck and giblets. Place the chicken in a slow cooker and add the other ingredients. Cover and cook on low for 7-8 hours. Carefully remove the chicken and set aside in a large bowl until the chicken is cool enough to handle without burning your fingertips off. Meanwhile, remove and discard the large solids from the chicken broth and strain the chicken broth into a large pot.",
    "To the same pot, add another 12 cups chicken broth, the chopped vegetables and the salt and pepper. Bring the mixture to a simmer and cook, covered, for 12-15 minutes, until the vegetables are slightly tender (they’ll cook more when the noodles cook). Taste the broth and add salt and pepper to taste, if needed. Add the noodles and cook according to package directions at a rolling boil. While the noodles are cooking, take the chicken off the bones and shred into bite-size pieces. For a creamy version, combine the cream (or half-and-half) and cornstarch in a liquid measuring, whisking to dissolve the cornstarch. Add the slurry to the soup and simmer rapidly for 1-2 minutes, stirring occasionally. Stir in the shredded chicken. Serve."
  ],
  "ingredients": [
    "0",
    "3-4 pound whole chicken, neck and giblets removed",
    "6 cups low-sodium chicken broth",
    "2 bay leaves",
    "1 teaspoon salt",
    "1 teaspoon pepper",
    "3 stalks celery, chopped in large chunks",
    "3-4 carrots, cut in large chunks",
    "1 onion, chopped in large pieces",
    "12 cups low-sodium chicken broth",
    "4 stalks celery, chopped",
    "1 pound carrots, chopped",
    "1-2 teaspoons salt (to taste, depending on the broth)",
    "½ teaspoon pepper",
    "16-20 ounces egg noodles",
    "1 cup cream or half-and-half combined with 1 tablespoon cornstarch (optional for creamy-style)"
  ],
  "__v": 1
}