{
  "hash": "155afa749a2043a9d84d14b32f3f89acd09ca837",
  "title": "The Best Homemade Chicken Pot Pie",
  "image": "https://www.familyfreshmeals.com/wp-content/uploads/2016/03/The-Best-Homemade-Chicken-Pot-Pie-Step-enjoy-FamilyFreshMeals.com-.png",
  "href": "https://www.familyfreshmeals.com/2016/03/best-homemade-chicken-pot-pie.html",
  "extension": "Chrome",
  "firstAdded": "2017-10-30T23:58:12.491000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large pot, add butter, potatoes carrots, onion, celery and garlic. Sauté until tender. Stir in flour until blended.",
    "Gradually add broth.Bring to a boil. Cook and stir for 2 minutes or until thickened. Stir in peas, ½ cup cream, parsley, garlic salt and pepper. Stir in chicken.",
    "Spoon into two ungreased 9 in pie plates. In a small bowl, whisk egg and 1 Tbsp or cream, set aside.",
    "Roll out the pastry to fit the top of each pie. Place over filling and trim, seal and flute edges. Cut slits in pasty to vent. Brush top of pies with egg mixture. Bake at 375 for 40-45 minutes or until golden. Let stand for 10 mins before cutting.",
    "NOTE: You can bake both pies, or cover and freeze one potpie for up to 3 months. To use frozen potpie,remove from the freezer 30 minutes before baking.",
    "Cover pie loosely with foil. Place on a baking sheet. Bake at 425 for 30 minutes. Reduce heat to 350, remove foil. Bake 55-60 minutes longer or until golden brown."
  ],
  "ingredients": [
    "0",
    "4 Tablespoons butter",
    "2 medium potatoes, peeled and cut into 1 in pieces",
    "3 medium carrots, cut into 1in pieces",
    "1 medium onion",
    "1 rib of celery",
    "2-3 garlic cloves, minced",
    "6 Tbsp all purpose flour",
    "3 cups chicken (or veg broth for veg version)",
    "4 cups cooked chicken meat, shredded or cubed",
    "⅔ cups frozen peas",
    "½ cup plus 1 Tablespoon heavy cream, divided",
    "1 Tablespoon minced parsley",
    "1 teaspoon salt",
    "¼ teaspoon pepper",
    "1 package (15 oz) refrigerated pie pastries (2 will be in the package)",
    "1 egg"
  ],
  "__v": 1
}