{
  "hash": "474a50fa0b41f677833ad536314f5a778ad5b234",
  "title": "Butternut Squash and Spinach Tortellini",
  "image": "https://c3.staticflickr.com/6/5668/30688970466_04c4002789.jpg",
  "href": "http://juliasalbum.com/2016/11/butternut-squash-spinach-tortellini/",
  "extension": "Chrome",
  "firstAdded": "2017-10-30T15:28:12.338000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Add 1 cup of butternut squash puree, 1 cup of half and half, 1/4 teaspoon of nutmeg, a pinch of paprika, and 1/4 teaspoon salt to the large skillet, on medium heat. While heating, stir all the ingredients to combine. Add about 1/4 teaspoon of lemon pepper seasoning - don't add all of it at once, add a little and add more, to your taste. Add the spinach on top of the mixture, cover with the lid, remove from heat. Let the spinach wilt in the pan, covered, off heat.",
    "While the spinach wilts, bring the medium pan of water to boil, add 2 cups of uncooked tortellini, and cook according to the package instructions (usually 7 - 10 minutes in boiling water). Once the tortellini is cooked, drain the water.",
    "Add cooked and drained tortellini to the skillet with the butternut squash sauce and spinach and stir to combine. If the sauce is too thick, add more half and half to thin it. Also, taste and add more salt, nutmeg and lemon pepper, if desired.",
    "Serve topped with chopped fresh parsley."
  ],
  "ingredients": [
    "0",
    "1 cup butternut squash puree",
    "1 cup half and half + more, as desired",
    "1/4 teaspoon nutmeg",
    "pinch of paprika",
    "1/4 teaspoon salt",
    "1/4 teaspoon lemon pepper seasoning (approximately)",
    "2 cups tortellini, uncooked",
    "8 oz of fresh, uncooked, spinach",
    "2 tablespoons fresh parsley, chopped",
    "WHAT IS HALF AND HALF? Half and half is the US milk product that combines half milk half cream to form a lighter cream (unlike heavy cream). To make 1 cup of half and half, combine 1/2 cup milk and 1/2 cup regular cream (heavy, or whipping cream)."
  ],
  "__v": 1
}