{
  "hash": "a7275018809d705e18de8dba70489864f418ca17",
  "title": "The best vegan burger",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/1245_15_1405952327_lrg.jpg",
  "href": "http://www.jamieoliver.com/recipes/vegetables-recipes/the-best-vegan-burger/",
  "extension": "Chrome",
  "firstAdded": "2015-06-30T11:59:49.812000",
  "users": [
    null
  ],
  "keywords": [
    "tin",
    "chickpeas",
    "sweetcorn",
    "bunch",
    "coriander",
    "paprika",
    "cumin",
    "zest",
    "lemon",
    "heaped",
    "plain",
    "flour",
    "extra",
    "dusting",
    "salt",
    "rapeseed",
    "oil",
    "round",
    "lettuce",
    "tomatoes",
    "tomato",
    "ketchup",
    "wholemeal",
    "burger",
    "buns"
  ],
  "directions": [
    "0",
    "Drain and place the chickpeas and sweetcorn into a food processor. Pick the coriander leaves, then add half to the processor along with all of the stalks. Add the spices, lemon zest, flour and a pinch of salt, then pulse until combined, but not smooth – you want to retain a bit of texture.",
    "On a flour-dusted surface, divide and shape the mixture into four equally sized patties (roughly 2cm thick). Pop onto a tray and place in the fridge for around 30 minutes to firm up.",
    "Heat a splash of oil in a large frying pan over a medium heat. Once hot, add the patties and cook for around 10 minutes, or until golden and cooked through, turning halfway.",
    "Meanwhile, click off, wash and spin-dry four nice lettuce leaves, then finely slice the tomatoes horizontally.",
    "Squeeze a large dollop of ketchup onto the base of each bun (toast them if you like), then top with the burgers. Layer over a couple of slices of tomato, a lettuce leaf, a few coriander leaves and finally the burger tops. Serve with a crisp, green salad, if you like.",
    "Find more vegan recipes"
  ],
  "ingredients": [
    "0",
    "1 x 400 g tin of chickpeas",
    "1 x 340 g tin of sweetcorn",
    "½ a bunch of fresh coriander",
    "½ teaspoon paprika",
    "½ teaspoon ground coriander",
    "½ teaspoon ground cumin",
    "zest of 1 lemon",
    "3 heaped tablespoons plain flour, plus extra for dusting",
    "sea salt",
    "rapeseed oil",
    "1 small round lettuce",
    "2 large ripe tomatoes",
    "tomato ketchup",
    "4 wholemeal burger buns"
  ],
  "__v": 1
}