{
  "hash": "6766b02f09cc149b78dc98a756e51a50db489bb0",
  "title": "Jamie Oliver’s Tender & Crisp Chicken Legs with Sweet Tomatoes & Basil",
  "image": "https://images.food52.com/TxSytUNaWittZlzIZY7oNzN0aU4=/753x502/182d6759-f632-4162-b2b2-dfefbaca4abc--2017-0718_genius-jamie-oliver-chicken-tomatoes-basil_julia-gartland_602.jpg",
  "href": "https://food52.com/recipes/72191-jamie-oliver-s-tender-crisp-chicken-legs-with-sweet-tomatoes-basil",
  "extension": "Chrome",
  "firstAdded": "2017-12-29T13:39:42.594000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat your oven to 350°F (180°C). Season your chicken pieces all over with salt and pepper and put them into a snug-fitting pan in one layer, skin side up. Throw in all the basil leaves and stalks, then chuck in your tomatoes. Scatter the garlic cloves into the pan with the chopped chile and drizzle over some olive oil. Mix around a bit, pushing the tomatoes underneath. Place in the oven, uncovered, for 1 1/2 hours, turning any of the exposed tomatoes halfway through, until the chicken skin is crisp and the meat is falling off the bone. If after an hour or so the skin isn’t crisping to your liking, you can turn up the heat and switch to convection, or just blast it under the broiler for a bit at the end, rotating the pan occasionally and watching closely, until you get the skin as brown as you like. Just don't let the sauce simmer too vigorously or the meat might toughen up.",
    "If you fancy, you can add some drained cannelini beans or some sliced new potatoes to the pan along with the chicken. Or you can serve the chicken with some simple mashed potato. Squeeze the garlic out of the skins before serving. You could even make it part of a pasta dish—remove the chicken meat from the bone and shred it, then toss into a bowl of linguini or spaghetti and serve at once."
  ],
  "ingredients": [
    "0",
    "4 higher-welfare chicken leg quarters",
    "Sea salt & freshly ground black pepper",
    "1 big bunch fresh basil, leaves picked, stalks finely chopped",
    "2 big handfuls red and yellow cherry tomatoes and ripe plum or beefsteak tomatoes, cherry tomatoes halved, plum tomatoes quartered",
    "1 whole bulb garlic, broken into cloves",
    "1 fresh red chile, finely chopped, or a big pinch of dried chile flakes",
    "Olive oil",
    "One 14.5-ounce/410 g can cannelini beans, drained and rinsed (optional)",
    "2 handfuls new potatoes, scrubbed (optional)"
  ],
  "__v": 1
}