{
  "hash": "0e86fb7fae2fab18d7fdd92bce56fc599fd6a223",
  "title": "Cod with Tomato and Herb Butter",
  "image": "",
  "href": "http://www.littlebroken.com/2016/08/26/cod-with-tomato-and-herb-butter/",
  "extension": "Chrome",
  "firstAdded": "2016-10-30T19:06:48.123000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a small saucepan heat olive oil over medium heat. Sauté shallot and garlic for 4-5 minutes or until soft, stirring occasionally.",
    "Add tomatoes, chicken stock, sea salt, red pepper flakes, and sugar. Simmer, uncovered, for 15-17 minutes or until tomatoes break down and release their juices and liquid has almost evaporated.",
    "Remove the saucepan from the heat and stir in the butter and fresh herbs. The herb butter should be velvety and thick. Cover and keep warm while the cod is baking.",
    "1",
    "Preheat the oven to 400 degrees F.",
    "Drizzle the bottom of a casserole dish lightly with olive oil. You want a dish big enough to fit the cod in a single layer with some room around or you will get too much juice during baking.",
    "Pat dry the cod really well and place in a single layer. Season with salt and pepper to taste but be generous. Drizzle the top lightly with olive oil and squeeze of fresh lemon. I used about ½ lemon. Cover tightly with aluminum foil and bake for 12-18 minutes or until easily flaked. Baking time will depend on the thickness of the cod.",
    "Remove from the oven and evenly spread the tomato butter over the cod. Cover back with aluminum foil and let stand at room temperature for 1-2 minutes before serving. You just want all the flavors to come together.",
    "Garnish with fresh chopped herbs, if desired, and serve immediately."
  ],
  "ingredients": [
    "0",
    "1 medium shallot, finely chopped",
    "2 garlic cloves, minced",
    "1 Tbsp. olive oil, plus extra for drizzling",
    "1 pint grape or cherry tomatoes",
    "½ cup chicken stock",
    "½ tsp. sea salt",
    "¼ tsp. red pepper flakes",
    "¼ tsp. granulated sugar",
    "4 Tbsp. unsalted butter, sliced",
    "3 Tbsp. fresh chopped herbs (basil, parsley, chives, cilantro), plus extra for garnish",
    "1",
    "2 - 2¼ pounds fresh cod fillets, cut into 6-8 oz. portions*",
    "1 lemon",
    "salt and fresh ground black pepper"
  ],
  "__v": 1
}