{
  "hash": "a9a6c325631ca7cd21aded09c0d7f99c2f258256",
  "title": "Easy Make-Ahead Breakfast Casserole",
  "image": "http://sallysbakingaddiction.com/wp-content/uploads/2015/09/easy-breakfast-casserole.jpg",
  "href": "http://sallysbakingaddiction.com/2015/09/18/easy-make-ahead-breakfast-casserole/",
  "extension": "",
  "firstAdded": "2017-05-21T00:26:53.282000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Set a large skillet over medium heat and coat it with nonstick spray or a drizzle of olive oil. Place sausage in the skillet and begin to break it up with a spatula or fork. Stir in the rosemary and brown the sausage, about 6-7 minutes.",
    "Meanwhile, set a 2nd skillet over medium heat and coat it with nonstick spray or a drizzle of olive oil. (If you have a skillet large enough to fit both the sausage and veggies, you can just add the veggies to the sausage that is browning in step 1.) Add the peppers, mushrooms, spinach, onion, garlic, and a sprinkle each of salt and pepper. Begin stirring and cooking the veggies down until tender, about 6-8 minutes.",
    "Set sausage and veggies aside.",
    "Generously grease a 9x13 baking pan. Break the bread into pieces and place in the pan in an even layer.",
    "In a large bowl, whisk the eggs, milk, and 1/4 cup shredded cheese together. Pour half of this egg mixture over the bread. Top with the sausage and vegetables, then the remaining egg mixture and remaining 1/4 cup cheese. Add a sprinkle of salt and pepper on top.",
    "Cover casserole with plastic wrap or aluminum foil and refrigerate for 2 hours or overnight-- or up to 1 day. Allow it to come to room temperature before baking.",
    "Preheat the oven to 375°F (191°C). Bake the casserole, uncovered, until the top is golden, edges are crisp, and a toothpick inserted in the center comes out clean-- about 40-45 minutes. I like mine on the super crisp side, so I bake it for around 45-50 minutes. Allow to cool for 10 minutes, then slice and serve. Kevin loves hot sauce on top of his. Try it! Leftovers keep well in the refrigerator for up to 5 days. Reheat in the microwave to your liking.",
    "Make ahead tip/Freezing instructions: Obviously this is a make ahead recipe! However, you can brown the sausage and cook down the veggies up to 2 days in advance-- simply put the two in a tupperware in the refrigerator until ready to use in the recipe. Also, you can freeze this breakfast casserole. Prepare through step 5, then cover the casserole with plastic wrap, then a layer of aluminum foil. Freeze for up to 3 months. Allow to thaw overnight in the refrigerator. Bring to room temperature, then continue with step 7."
  ],
  "ingredients": [
    "0",
    "3/4 pound uncooked sausage, casings removed1",
    "optional: 1 teaspoon dried rosemary to give the sausage more flavor",
    "2 bell peppers, diced (any color you prefer; about 2 cups)",
    "1 cup sliced mushrooms",
    "1 cup fresh spinach",
    "1/2 medium yellow onion, diced",
    "1 teaspoon minced garlic",
    "salt and fresh ground black pepper",
    "4 slices day-old gluten free bread (or whole wheat, white, sourdough, etc)",
    "10 large Eggland's Best eggs",
    "1/2 cup milk (I use almond milk, any milk works)",
    "1/2 cup shredded cheese2"
  ],
  "__v": 1
}