{
  "hash": "1767c93ba0af88f18531c585322d4d8b1e4305c1",
  "title": "Peren galette met mascarpone en speculaas",
  "image": "http://www.francescakookt.nl/wp-content/uploads/2016/11/peer_mascarpone_speculaas_galette_uitgelicht_1.jpg",
  "href": "http://www.francescakookt.nl/peren-galette-met-mascarpone-en-speculaas/",
  "extension": "Chrome",
  "firstAdded": "2016-11-10T22:24:01.998000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Bereidingstijd: 25 minuten / Oventijd: 30 minuten",
    "Haal de bladerdeegplakjes uit de verpakking en laat ontdooien (duurt max. 10 minuten). Verwarm de oven voor op 200 graden.",
    "Maak ondertussen je eigen speculaaskruiden. Maal daarvoor de speculaasjes helemaal fijn in de keukenmachine en roer daarna de kaneel en nootmuskaat erdoor.",
    "Zodra het bladerdeeg ontdooit is, heb je twee opties. Wil je graag een ronde vorm dan kun je, zoals ik deed, de bladerdeegplakjes samen kneden tot een grote deegbol. Rol deze vervolgens met een deegroller uit tot een dikte van ongeveer 2 mm. Of je legt de plakjes gewoon naast elkaar en plakt ze aan elkaar vast door je vingers nat te maken en bij de randjes goed aan te drukken. Je galette wordt er wat rommeliger door als je straks het bladerdeeg omvouwt, maar daar wordt de smaak zeker niet minder van.",
    "Prik met een vork meerdere gaatjes in het bladerdeeg. Besmeer het vervolgens met een dun laagje mascarpone, laat wel zo’n 5 cm vrij aan de randen (om later dicht te kunnen vouwen). Strooi royaal met het speculaasmengsel over de mascarpone.",
    "Snijd de peren in platte, lange partjes. Verdeel de partjes over het speculaasmengsel en strooi hier vervolgens wat suiker over. Vouw nu de zijkanten van het bladerdeeg over de peertjes heen.",
    "Klop het ei los en besmeer met een kwastje de randen van het bladerdeeg er dunnetjes mee in. Strooi ook hier nog wat suiker over.",
    "Schuif de galette in de oven en bak in 30 minuten goed bruin en gaar.",
    "Laat de galette iets afkoelen en snijd in punten. Serveer deze met extra, losgeklopte mascarpone en speculaaskruiden. Strooi er eventueel ook nog wat poedersuiker over."
  ],
  "ingredients": [
    "0",
    "8 plakjes diepvriesbladerdeeg",
    "10 speculaasjes",
    "2 tl kaneel",
    "½ tl nootmuskaat",
    "3 grote rijpe peren of 6 kleintjes",
    "2 el mascarpone + extra voor het serveren",
    "2 el rietsuiker",
    "1 ei"
  ],
  "__v": 1
}