{
  "hash": "6a9edf2cb28f82361725676eee59b93989c22926",
  "title": "Spinach and Egg Sandwiches",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2012/1/24/2/FNM_030112-WNDinners-017_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/food-network-kitchens/spinach-and-egg-sandwiches-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-11-04T20:03:45.998000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the broiler. Arrange the tomatoes cut-side up on one half of a rimmed baking sheet and season with salt and pepper. Broil the tomatoes until they begin to soften, about 2 minutes. Remove from the broiler. Arrange the English muffins on the other half of the baking sheet and brush with 1 tablespoon olive oil. Set aside.",
    "Heat 1 tablespoon olive oil in a large nonstick skillet over medium heat. Add the shallot and cook, stirring, until soft, about 2 minutes. Add the Canadian bacon and cook, stirring, until lightly browned, about 3 minutes. Stir in the spinach until wilted; season with salt and pepper. Transfer the mixture to a bowl; keep warm. Wipe out the skillet.",
    "Heat the remaining 1/2 tablespoon olive oil in the skillet over medium-high heat. Crack the eggs into the pan, season with salt and pepper, and fry until the whites are set but the yolks are still runny, about 5 minutes. Remove the pan from the heat.",
    "Top the tomatoes with the cheese. Return the tomatoes and English muffins to the broiler; broil until the cheese is melted, 2 to 3 minutes. Divide the English muffins among plates, then top each with some of the spinach mixture and a fried egg. Serve with the broiled tomatoes.",
    "Photograph by Antonis Achilleos",
    "Recipe courtesy of Food Network Magazine"
  ],
  "ingredients": [
    "0",
    "4 plum tomatoes, halved lengthwise",
    "Kosher salt and freshly ground pepper",
    "4 English muffins, split",
    "2 1/2 tablespoons extra-virgin olive oil",
    "1 shallot or 1/4 red onion, thinly sliced",
    "1/4 pound sliced Canadian bacon, cut into thin strips",
    "8 cups baby spinach (about 8 ounces)",
    "4 large eggs",
    "1/3 cup shredded extra-sharp cheddar cheese"
  ],
  "__v": 1
}