{
  "hash": "07719e41c06ce85cf636cf5cfae5cf3162f943c4",
  "title": "Easy Sweet Potato Veggie Burgers with Avocado",
  "image": "https://lh4.googleusercontent.com/-_y-2WQU_ctY/TzxYDTVCvOI/AAAAAAAAhzo/5osVwmHOCp4/s564/sweet-potato-bean-burger24.jpg",
  "href": "http://kblog.lunchboxbunch.com/2012/02/easy-sweet-potato-veggie-burgers-with.html",
  "extension": "Chrome",
  "firstAdded": "2019-07-22T13:22:16.041000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Bake your sweet potato in a 400 degree oven for 40-60 minutes or until tender. If in a hurry, you could use the microwave, but oven-baked yields a bit more flavor.",
    "Add the potato and beans to a large mixing bowl. Using a large fork, mash well. Fold in the onion and keep mashing. Add all the remaining burger ingredients and mash, mash, mash well until thickened and mashed well. Tip! Rinse your beans in hot water before adding to bowl, this heats them, making them easier to mash.",
    "Warm oven to 400 degrees.",
    "Warm a skillet over high heat and add the oil.",
    "Using hands, form the burger mixture into large patties. Place patties in the hot skillet. Note: If using Panko bread crumbs, before placing burgers in skillet, roll patties in Panko to coat well. In skillet: Cook 1-3 minutes on each side, until lightly browned. Repeat until all the burger mixture has been used. Optional: Before forming patties, place mixture in the fridge for a half hour or longer.",
    "Place the skillet-cooked patties on a baking sheet and bake for 10-15 minutes, until cooked through. Note: YES you could skip the skillet part and just bake the veggie burgers, but the flavor is better with those crispy oil-seared edges. If just baking, the baking time will be around 20 minutes, depending on patty size.",
    "Slice up all your burger toppings and toast the buns. Sprouted grain were used! Add vegan mayo or spicy mustard and the patty and toppings. Serve warm!",
    "Store leftover burgers, sealed, in the fridge for up to a day, or freeze and consume within a few weeks for best flavor and texture. To reheat: warm in a 400 degree oven until warmed through, about 12 minutes, depending on burger thickness."
  ],
  "ingredients": [
    "0",
    "1 medium sweet potato, baked and peeled",
    "16oz. cooked white beans (canned, drained and rinsed)",
    "1/2 cup white onion, chopped",
    "2-3 Tbsp tahini",
    "3/4 tsp apple cider vinegar",
    "1 tsp garlic powder",
    "1/2 - 1 tsp chipotle powder (or cajun spice) (use more for spicier burgers)",
    "1/2 tsp salt",
    "1/4 tsp black pepper (add more for more bite!)",
    "1/3 cup nutritional yeast OR any flour (try oat flour)",
    "1/2 - 1 cup finely chopped greens (kale, spinach, parsley)",
    "toppings: avocado, tomato, vegenaise, burger buns, greens",
    "skillet: 1 Tbsp oil ( extra virgin olive oil, coconut oil, or other)",
    "optional: Panko bread crumbs for crispy coating"
  ],
  "__v": 1
}