{
  "hash": "5d72f68d2f32aaa20271fae69e94594562d55f75",
  "title": "Tender Summer Squid with Chorizo & Aïoli",
  "image": "http://www.bbcgoodfood.com/sites/bbcgoodfood.com/files/recipe_images/stew_0.jpg",
  "href": "http://www.bbcgoodfood.com/recipes/tender-summer-squid-chorizo-aioli",
  "extension": "",
  "firstAdded": "2015-06-27T16:29:53.811000",
  "users": [
    null
  ],
  "keywords": [
    "pack",
    "cooking",
    "chorizo",
    "skin",
    "onion",
    "thyme",
    "sprigs",
    "leaves",
    "smoked",
    "paprika",
    "aioli",
    "dry",
    "white",
    "wine",
    "cherry",
    "vine",
    "tomatoes",
    "prepared",
    "squid",
    "tubes",
    "rings",
    "tentacles",
    "new",
    "potatoes",
    "chunks",
    "flatleaf",
    "parsley",
    "roughly",
    "garlic",
    "clove",
    "good",
    "mayonnaise",
    "ideally",
    "olive",
    "oilbased",
    "squeeze",
    "lemon",
    "juice",
    "extra",
    "serve",
    "crusty",
    "bread"
  ],
  "directions": [
    "0",
    "Heat a large wide pan. Add the chorizo and fry for 5 mins, using your spatula to break up, until golden and oozing with oil.",
    "If there’s more than 2 tbsp of oil in the pan, spoon out the excess. Add the onion and thyme and soften for 5 mins.",
    "Stir in the paprika, cook for 1 min, then splash in the wine and scrape any bits from the bottom of the pan. Add the tomatoes, cover with a lid and simmer for 10 mins until the tomatoes have collapsed. Don’t season with salt, as\nthe sausages are salty enough for now.",
    "Add the squid, make sure it’s nestled well into the juices, then cover again and simmer for 1 hr. Add the potatoes, then cook for another 30 mins, adding a splash of water if it looks dry. Mix the garlic, mayo and lemon juice, then set aside. Sprinkle with a little paprika, if you like.",
    "Test the squid; it should be so tender a spoon cuts through it, then check the potatoes are cooked. Stir in the parsley and serve with a dollop of the aïoli, a squeeze of lemon and some crusty bread."
  ],
  "ingredients": [
    "0",
    "215g pack cooking chorizo, skin removed",
    "1 onion, finely chopped",
    "few thyme sprigs, leaves only",
    "1 tsp sweet smoked paprika, plus a little for the aïoli",
    "50ml dry white wine",
    "450g cherry vine tomatoes",
    "500g prepared squid, tubes cut into rings, plus tentacles",
    "450g large new potatoes, peeled and cut into bite-sized chunks",
    "small pack flat-leaf parsley, leaves roughly chopped",
    "1",
    "1 garlic clove, crushed",
    "4 tbsp good mayonnaise, ideally olive oil-based",
    "squeeze of lemon juice, plus extra to serve",
    "crusty bread, to serve"
  ],
  "__v": 1
}