{
  "hash": "bebda6d3bb4612b173704bd12b380d9f21543552",
  "title": "Maangchi’s Cheese Buldak",
  "image": "https://static01.nyt.com/images/2019/07/28/dining/28mag-eat/28mag-eat-articleLarge.jpg",
  "href": "https://cooking.nytimes.com/recipes/1020366-maangchis-cheese-buldak-fire-chicken?em_pos=medium&ref=headline&nl_art=1&te=1&nl=cooking&emc=edit_ck_20190726?campaign_id=58&instance_id=11196&segment_id=15586&user_id=4264688f24592aeeb06433e5d96d7150&regi_id=79859114emc=edit_ck_20190726",
  "extension": "Firefox",
  "firstAdded": "2019-07-27T19:25:30.745000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine the gochugaru, gochujang, brown sugar, garlic, ginger, soy sauce and black pepper in a medium bowl and mix well. Add the chicken and stir until it is well coated.",
    "If you’re using the rice cakes, swirl the oil into a large, oven-safe skillet set over medium-high heat and wait for it to shimmer. Add the rice cakes and cook, turning the cakes often, until they are a little crisp, 3 to 4 minutes. Transfer the rice cakes to a small bowl and set aside. If you’re not using rice cakes, simply swirl the oil into the pan and move along to the next step.",
    "Add the chicken mixture to the pan along with ¼ cup water. Cover and cook over medium-high heat, stirring occasionally, until the chicken is cooked through, 8 to 10 minutes, stirring in the rice cakes halfway through, if using. Meanwhile, heat the broiler in your oven.",
    "Remove the chicken from the heat. Cover the pan with the sliced mozzarella, then slide the pan under the broiler. Cook until the cheese has melted and browned in spots, about 2 minutes. Remove from the oven, and sprinkle with scallions. Serve immediately, with rice."
  ],
  "ingredients": [
    "0",
    "¼ cup gochugaru (Korean red-pepper flakes)",
    "2 tablespoons gochujang (Korean red-pepper paste)",
    "3 tablespoons light brown sugar",
    "3 cloves garlic, peeled and minced (about 2 tablespoons)",
    "1 (1-inch) piece ginger, peeled and minced (about 1 tablespoon)",
    "1 tablespoon soy sauce",
    "½ teaspoon freshly ground black pepper",
    "1 pound boneless, skinless chicken thighs, cut into ¾-inch cubes",
    "2 tablespoons neutral oil, such as canola or peanut",
    "4 ounces sliced Korean rice cakes (optional)",
    "6 to 8 ounces low-moisture mozzarella, thinly sliced",
    "2 scallions, sliced, for garnish"
  ],
  "__v": 2
}