{
  "__v": 1,
  "directions": [
    "0",
    "Heat a large casserole pan and add 1 tbsp goose fat. Season the beef and fry until golden brown, about 3-5 mins,\nthen turn over and fry the other side until the meat is browned all over, adding more fat if necessary. Do this in 2-3 batches,\ntransferring the meat to a colander set over a bowl when browned.",
    "In the same pan, fry the bacon, shallots or pearl onions, mushrooms, garlic and bouquet garni until lightly browned. Mix in the tomato purée and cook for a few mins, stirring into the mixture. This enriches the bourguignon and makes a great base for the stew. Then return the beef and any drained juices to the pan and stir through.",
    "Pour over the wine and about 100ml water so the meat bobs up from the liquid, but isn’t completely covered. Bring to the boil and use a spoon to scrape the caramelised cooking juices from the bottom of the pan – this will give the stew more flavour.",
    "Heat oven to 150C/fan 130C/gas 2. Make a cartouche: tear off a square of foil slightly larger than the casserole, arrange it in the pan so it covers the top of the stew and trim away any excess foil. Then cook for 3 hrs. If the sauce looks watery, remove the beef and veg with a slotted spoon, and set aside. Cook the sauce over a high heat for a few mins until the sauce has thickened a little, then return the beef and vegetables to the pan.",
    "To make the celeriac mash, peel the celeriac and cut into cubes. Heat the olive oil in a large frying pan. Tip in the celeriac and fry for 5 mins until it turns golden. Season well with salt and pepper. Stir in the rosemary, thyme, bay and cardamom pods, then pour over 200ml water, enough to nearly cover the celeriac. Turn the heat to low, partially cover the pan\nand leave to simmer for 25-30 mins.",
    "After 25-30 mins, the celeriac should be soft and most of the water will have evaporated. Drain away any remaining water, then remove the herb sprigs, bay and cardamom pods. Lightly crush with a potato masher, then finish with a glug of olive oil and season to taste. Spoon the beef bourguignon into serving bowls and place a large spoonful of the celeriac mash on top. Garnish with one of the bay leaves, if you like."
  ],
  "firstAdded": "2014-10-25T13:16:46.378000",
  "hash": "55128da140d018ee5f3dd111f3968deb24eebf5b",
  "href": "http://www.bbcgoodfood.com/recipes/5032/beef-bourguignon",
  "image": "http://www.bbcgoodfood.com/sites/bbcgoodfood.com/files/recipe_images/recipe-image-legacy-id--1035610_10.jpg",
  "ingredients": [
    "0",
    "3 tsp goose fat",
    "600g shin beef, cut into large chunks",
    "100g smoked streaky bacon, sliced",
    "350g shallots or pearl onions, peeled",
    "250g chestnut mushrooms (about 20)",
    "2 garlic clove, sliced",
    "1 bouquet garni (See know-how below)",
    "1 tbsp tomato purée",
    "750ml bottle red wine, Burgundy is good",
    "1",
    "600g (about 1) celeriac",
    "2 tbsp olive oil",
    "rosemary and thyme sprigs",
    "2 bay leaves",
    "4 cardamom pod"
  ],
  "keywords": [
    "goose",
    "fat",
    "shin",
    "beef",
    "chunks",
    "smoked",
    "streaky",
    "bacon",
    "shallots",
    "pearl",
    "onions",
    "chestnut",
    "mushrooms",
    "garlic",
    "clove",
    "bouquet",
    "garni",
    "knowhow",
    "tomato",
    "bottle",
    "red",
    "wine",
    "burgundy",
    "good",
    "celeriac",
    "olive",
    "oil",
    "rosemary",
    "thyme",
    "sprigs",
    "bay",
    "leaves",
    "cardamom",
    "pod"
  ],
  "title": "Beef bourguignon",
  "users": [
    null
  ]
}