{
  "hash": "32ac26ca2e67f7577096a93efa15b1ba595b406f",
  "title": "Spicy, Citrusy Black Beans",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2009/07/spicy-citrusy-black-beans-vertical-a-1600.jpg",
  "href": "http://www.simplyrecipes.com/recipes/spicy_citrusy_black_beans/",
  "extension": "",
  "firstAdded": "2017-07-14T02:19:18.510000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Prepare the beans. Rinse and sort the beans, discarding any stones or shriveled beans. You can soak the beans overnight in cold water (cover with several inches of water) OR pour enough boiling water over them to cover by a few inches and soak them for an hour OR skip the pre-soaking step. Soaking will speed up the cooking process. If you soak, discard the soaking liquid after soaking.",
    "2 Add beans to a large pot with 2 1/2 quarts (10 cups) of water. Add oregano, bay leaves, and sage. Bring the beans to a boil and reduce heat to a simmer. Cook until the beans are soft, but not quite done. The time will vary depending on how large, dry, or old your beans are, and if you have pre-soaked them, from anywhere from 30 minutes to an hour and a half.",
    "3 While the beans are cooking, sauté onions and peppers in olive oil until soft. Add chili sauce, chili powder, and/or chili purée, cumin, and garlic. Sauté until spices are fragrant.",
    "4 Fish out and discard the bay leaves, stems of oregano, and sage leaves from the pot of beans. Remove, but reserve, extra cooking liquid until there is about 1/2-inch of liquid above beans.",
    "5 Add the onion mixture and salt to the pot of beans. Cook another hour or so until thickened. Add reserved liquid if needed.",
    "6 Add half of the orange juice, and simmer. Adjust chili heat at this point – you may or may not want to add more of your chili paste. Just before serving, add remaining orange juice, lime juice, and vinegar. Salt to taste. Garnish with chopped fresh cilantro.",
    "Serve with corn tortillas, and/or rice, sour cream, and salsa."
  ],
  "ingredients": [
    "0",
    "4 cups dried black beans",
    "2 1/2 quarts (10 cups) water",
    "2-3 fresh sprigs oregano, or 1 Tbsp dried",
    "3 bay leaves",
    "6 small or 3 large sage leaves",
    "2 teaspoons salt",
    "4 Tbsp olive oil",
    "2 yellow onions, chopped",
    "2 chopped peppers – bell pepper, Anaheim, or jalapeño (your choice, depending on taste for heat), seeds, stems and ribs discarded",
    "6 cloves crushed garlic",
    "2 Tbsp Ancho red chili sauce, or chili powder or Tabasco to taste*",
    "1-2 teaspoons of puréed chipotle in adobo, chipotle Tabasco, or chipotle powder (to taste)",
    "1 Tbsp cumin, (crushed whole toasted cumin seed is best, if possible)",
    "3 Tbsp frozen orange juice concentrate or 1/2 cup fresh orange juice",
    "Juice of 1 lime",
    "2 Tbsp rice wine vinegar",
    "Chopped fresh cilantro for garnish"
  ],
  "__v": 1
}