{
  "__v": 1,
  "directions": [
    "0",
    "Preparazione:",
    "Preparate la besciamella facendo sciogliere il burro in un pentolino, aggiungete la farina setacciata e il latte poco alla volta, continuando a mescolare, aggiustate pepe e sale e unite la noce moscata, aggiungere anche 2-3 sottilette per dare un pò di gusto. Cuocete per 15 minuti continuando a mescolare finchè la crema non sarà addensata.",
    "A parte tagliate finemente il cipollotto e fatelo rosolare, aggiungete i dadini di zucchina, peperone e melanzana, 1 bicchiere d’acqua, salate e lasciate cuocere con un coperchio per 15 minuti, quindi frullate il tutto con un mixer ad immersione lasciando qualche pezzetto di verdura.",
    "Ora componete le vostre lasagne.",
    "Spalmate un pò di besciamella sulla vostra teglia e coprite con il primo strato di sfoglia, distribuitevi sopra un pò di besciamella e un pò di crema di verdure con qualche pezzettino di sottiletta o mozzarella, fate un altro strato di sfoglia e aggiungete sopra solo besciamella e sottilette o mozzarella, continuate ad alternare gli strati fino alla fine delle sfoglie.",
    "Cuocete in forno già caldo a 200° per 15-20 minuti circa, a seconda dello spessore delle sfoglie, io utilizzo sempre sfoglie molto sottili. Servite con abbondante parmigiano grattuggiato."
  ],
  "firstAdded": "2014-10-10T12:06:59.045000",
  "hash": "bedf6a8ff34e2d7174c609c51f98cdfd1b72ed50",
  "href": "http://dieta.pourfemme.it/articolo/ricette-light-lasagnette-al-forno-con-verdure/3793/",
  "image": "http://static.pourfemme.it/625X0/dieta/pourfemme/it/img/lasagnette-con-le-verdure.jpg",
  "ingredients": [
    "0",
    "ngredienti:",
    "Sfoglie di pasta fatta in casa o 1 confezione di lasagne fresche,",
    "1 litro circa di besciamella (100 gr di burro, 100 gr di farina, 1 litro di latte, 1 pizzico di noce moscata, 1 pizzico di sale),",
    "1 peperone,",
    "1 zucchina,",
    "1 melanzana,",
    "1 cipollotto,",
    "olio,",
    "sale,",
    "pepe,",
    "sottilette o mozzarella,",
    "parmigiano grattuggiato."
  ],
  "keywords": [
    "ngredienti",
    "sfoglie",
    "pasta",
    "fatta",
    "casa",
    "confezione",
    "lasagne",
    "fresche",
    "circa",
    "besciamella",
    "burro",
    "farina",
    "litro",
    "latte",
    "noce",
    "moscata",
    "pizzico",
    "sale",
    "peperone",
    "zucchina",
    "melanzana",
    "cipollotto",
    "olio",
    "pepe",
    "sottilette",
    "mozzarella",
    "parmigiano",
    "grattuggiato"
  ],
  "title": "lasagnette al forno con verdure",
  "users": [
    null
  ]
}