{
  "hash": "2ae3b3aa00018ce10658bab0191249e6fe2067b0",
  "title": "Rattatouile",
  "image": "http://recipe-folder.com/img/recipe-images/096/407/3106305396.jpg",
  "href": "http://recipe-folder.com/recipe/5d6676a6de7ce5592c205b16",
  "extension": "User Added",
  "firstAdded": "2019-08-28T12:42:14.678000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Stove vs oven",
    "1",
    "The secret to a good ratatouille is ensuring that all of the vegetables are perfectly cooked. A more traditional recipe would fry them all separately, then finish it on the stove, but it is easier – and, I think, more forgiving on the ingredients – to bake it, as it means you won’t have to keep stirring it to stop it sticking.",
    "2",
    "2 Choose your vegetables",
    "3",
    "Note that the vegetables in this recipe are just a guide: if you happen to have more peppers than aubergines, prefer red onions to white, or can’t stand courgettes, then feel free to adapt the recipe to suit your taste or larder – with the exception of the first lot of tomatoes, which are necessary for the sauce.",
    "4",
    "Prepare the vegetables: Halve the peppers lengthways, and discard the innards.",
    "5",
    "Prepare the vegetables: Halve the peppers lengthways, and discard the innards.",
    "6",
    "3 Prep the peppers ...",
    "7",
    "Heat the oven to 200C (180C fan)/390F/gas 6, and lightly oil a baking tray. Cut the peppers in half lengthways, remove and discard the seeds and any pith, then put them cut-side down on the tray. Bake for about 20 minutes, until the skin has blistered. Take them out and turn the oven down to 160C (140C fan)/325F/gas 3.",
    "8",
    "3 Bake the peppers until they blister and soften. Meanwhile, prep the rest of the veg .",
    "9",
    "Bake the peppers until they blister and soften. Meanwhile, prep the rest of the veg .",
    "10",
    "4 … plus the saffron, onion and garlic",
    "11",
    "Meanwhile, put the saffron in a tablespoon of hot water and leave to soak while you prepare the rest of the vegetables. Peel and finely chop the onion, and peel and finely mince three garlic cloves. Alternatively, use a garlic crusher or a pestle and mortar to do the same job.",
    "12",
    "5 Now for the tomatoes, aubergine and courgettes",
    "13",
    "Peel four of the tomatoes: drop them into a bowl of boiling water for a minute, until the skins split, then slip them off and discard. Cut the peeled tomatoes in half, scoop out and discard the seeds, then finely chop the flesh, retaining any juices. Chop the aubergine, courgettes and the four remaining tomatoes into fairly thin slices.",
    "14",
    "5 For the sauce, blanch three of the tomatoes, peel off the skins, and finely chop the flesh.",
    "15",
    "For the sauce, blanch three of the tomatoes, peel off the skins, and finely chop the flesh.",
    "16",
    "6 Get the sauce going …",
    "17",
    "Heat the oil in a frying pan over a medium-low heat, add the onion and cook until very soft but not browned, stirring regularly. Add the three minced garlic cloves after about five minutes, then gently stir in the tomatoes and their juices. Add the thyme sprigs, and simmer until most of the liquid has evaporated.",
    "18",
    "6 Fry the onion in the oil, then add garlic, the remaining tomatoes, the peeled peppers and some thyme. Fry the onion in the oil, then add garlic, the remaining tomatoes, the peeled peppers and some thyme.",
    "19",
    "7 … and finish it off",
    "20",
    "Meanwhile, peel the pepper (the skin should just slip off), cut it into small cubes and add to the frying pan, along with the saffron and its soaking water. Cook for a couple more minutes, then remove the thyme sprigs, stir in the vinegar and season to taste.",
    "21",
    "8 Build the ratatouille",
    "22",
    "Spread the sauce evenly in a medium-sized oven dish, then arrange the sliced vegetables on top in whatever pattern you wish; it’s a good idea to mix them up so everyone gets a bit of everything in each bite. Peel and mince the remaining garlic clove, mix with the extra-virgin olive oil and thyme leaves, season, then drizzle over the top of the dish.",
    "23",
    "8 Pour the sauce into an oven dish, arrange the courgettes and aubergine on top, season and bake",
    "24",
    "Facebook Twitter Pinterest",
    "25",
    "Pour the sauce into an oven dish, arrange the courgettes and aubergine on top, season and bake",
    "26",
    "9 Bake it",
    "27",
    "Cover tightly with foil and bake for two hours, until the vegetables are tender, then remove the foil and bake for 30 minutes more. If there is any watery liquid left after cooking, pour this into a small pan, simmer to reduce by half, then pour it back into the dish. Put briefly under the grill to toast the top, then serve warm or at room temperature."
  ],
  "ingredients": [
    "0",
    "2 tbsp olive oil, plus extra to grease",
    "1",
    "2 red peppers",
    "2",
    "¼ tsp saffron threads",
    "3",
    "1 medium onion",
    "4",
    "4 garlic cloves",
    "5",
    "8 plum tomatoes",
    "6",
    "1 aubergine",
    "7",
    "3 courgettes (a mix of yellow and green if possible)",
    "8",
    "3 thyme sprigs, plus 1 tsp thyme leaves",
    "9",
    "1 tsp balsamic or red-wine vinegar",
    "10",
    "Salt and black pepper",
    "11",
    "1 tbsp extra-virgin olive oil, plus extra to serve"
  ],
  "__v": 1,
  "hidden": true
}