{
  "hash": "df13550b3fbabe2a43db8f7bd22a7cbb069ed094",
  "title": "Brown Butter Lobster, Bacon + Crispy Kale and Fontina Pasta",
  "image": "http://www.halfbakedharvest.com/wp-content/uploads/2013/09/Brown-Butter-Lobster-+-Crispy-Kale-and-Fontina-Pasta-with-Bacon-51.jpg",
  "href": "http://www.halfbakedharvest.com/brown-butter-lobster-bacon-crispy-kale-fontina-pasta/",
  "extension": "Chrome",
  "firstAdded": "2016-08-21T11:01:25.110000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Preheat oven to 350 degrees. In a large bowl, add kale, olive oil, parmesan cheese, 1/4 teaspoon salt and 1/4 teaspoon pepper. Toss to coat with your hands and massage kale for about 1 minute. Spread on a baking sheet and bake for 15-18 minutes, tossing 1-2 times while cooking, until crispy. Remove and set aside.Bring pasta water to a boil and prepare pasta according to directions.While the kale is cooking and the water comes to a boil start working on the bacon. Cook the bacon in a large skillet over medium heat until the fat has rendered and the bacon is crispy, about 7 minutes. Remove bacon from pan and set aside on paper towels to drain. Once cooled, crumble. Drain all but 1 tablespoon of bacon fat.To prepare the lobster, lay the lobster tails flat on a cutting board with the shell side facing upward. Using a very sharp, large knife, cut the tail in half lengthwise and slice all the way through the shell. Season the meat side lightly with salt and pepper.Bring the skillet used for bacon back to medium-high heat. Once it’s hot, add 1 tablespoon butter and swirl to coat. Place the lobster tails meat-side down in the pan and sear for 5 minutes or until the shells turn bright red. Remove tails from the pan and set aside.To the same skillet add another tablespoon of butter. Add the garlic and cook for 30 seconds, add the pasta, crushed red pepper, cayenne and a pinch of salt and pepper. Toss well and cook for 2 minutes, just until the pasta is hot. Once the pasta is hot add the tomatoes and cubed fontina cheese. Then remove the pasta from the heat, drizzle with lemon juice and toss well. Add in the crispy kale.In a separate small skillet melt 4 tablespoons butter over medium heat until just browned. Butter will melt, foam and froth, then begin to brown along the bottom. Whisk browned bits off of the bottom of the pan.Pop the lobster meat out of the shells and divide the pasta among plates or bowls. Top each plate with lobster meat and a sprinkle of chopped basil. Drizzle with browned butter and top with the crumbled bacon."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "4 slices thick cut bacon",
    "4 (4-8 ounce) lobster tails",
    "6 tablespoon butter, divided",
    "2 cloves garlic, minced or grated",
    "1 bunch kale, leaves torn away from the stem",
    "2 tablespoon olive oil",
    "2 tablespoons parmesan cheese",
    "1/4 teaspoon salt",
    "1/4 teaspoon pepper",
    "1/4 teaspoon cayenne pepper",
    "1/4 teaspoon crushed red pepper",
    "1 pound angel pasta",
    "1/2 lemon, juiced",
    "1 pint grape tomatoes, halved",
    "6-7 ounces fontina cheese, cubed",
    "1/4 cup fresh basil or parsley or both, chopped"
  ],
  "__v": 1
}