{
  "hash": "866c229a6d05745a64e438c72eaf08ab2fb3c554",
  "title": "Mediterranean Rice Noodles",
  "image": "http://www.epicurious.com/images/recipesmenus/2015/2015_april/56389410.jpg",
  "href": "http://www.epicurious.com/recipes/food/views/mediterranean-rice-noodles-56389410",
  "extension": "Chrome",
  "firstAdded": "2015-07-06T17:02:59.581000",
  "users": [
    null
  ],
  "keywords": [
    "king",
    "soba",
    "rice",
    "noodles",
    "extravirgin",
    "olive",
    "oil",
    "green",
    "beans",
    "ends",
    "snipped",
    "cherry",
    "tomatoes",
    "olives",
    "basil",
    "leaves",
    "torn",
    "zest",
    "juice",
    "lemon",
    "salt",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "Cook the rice noodles according to the directions on the package, then run them under cold water, and drain them well. In a medium bowl, toss the noodles with the olive oil.",
    "While the noodles are cooking, bring 4 cups of salted water to a boil. Have a bowl of ice water ready nearby. Blanch the green beans in the boiling water until they are tender and bright green, about 2 minutes, then remove them from the hot water and immediately submerge them in the ice water to stop the cooking. Drain them, and cut each bean into thirds.",
    "Stir the beans, tomatoes, olives, basil, lemon zest, lemon juice, salt, and pepper into the bowl of noodles. Adjust the seasonings to taste, and serve.",
    "Cooks' note: To use for a cleanse replace tomatoes with other vegetables, like thinly sliced fennel bulb or sautéed summer squash.",
    "Buy the full book from HarperCollins or from Amazon.\nRecipe from Clean Eats Over 200 Delicious Recipes to Reset Your Body's Natural Balance and Discover What It Means to Be Truly Healthy, by Alejandro Junger, M.D., Copyright © 2014, published by HarperOne, an imprint of HarperCollins Publishers."
  ],
  "ingredients": [
    "0",
    "1 package King Soba rice noodles",
    "2 to 3 tablespoons extra-virgin olive oil",
    "1/2 pound fresh green beans, ends snipped off",
    "About 10 cherry tomatoes, halved",
    "1/4 cup pitted olives",
    "8 to 10 fresh basil leaves, torn",
    "Zest and juice of 1 lemon",
    "1 to 2 teaspoons sea salt",
    "Freshly ground black pepper"
  ],
  "__v": 1
}