{
  "hash": "c9f8170a6725076b415a230aa7eb17d61df40641",
  "title": "Farro salad with roasted veg (Insalata di farro con verdure al forno)",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/201_1_1350897926_lrg.jpg",
  "href": "http://www.jamieoliver.com/recipes/vegetables-recipes/farro-salad-with-roasted-veg-insalata-di-farro-con-verdure-al-forno/",
  "firstAdded": "2014-12-31T15:02:41.675000",
  "users": [
    null
  ],
  "keywords": [
    "farro",
    "bulgar",
    "wheat",
    "yellow",
    "courgettes",
    "lengthways",
    "deseeded",
    "green",
    "bulbs",
    "fennel",
    "trimmed",
    "thickly",
    "herby",
    "tops",
    "reserved",
    "red",
    "onion",
    "wedges",
    "peppers",
    "chunks",
    "aubergines",
    "garlic",
    "extra",
    "virgin",
    "olive",
    "oil",
    "salt",
    "black",
    "pepper",
    "herb",
    "white",
    "wine",
    "vinegar",
    "good",
    "bunch",
    "herbs",
    "flatleaf",
    "parsley",
    "basil",
    "mint",
    "oregano",
    "squeeze",
    "lemon",
    "juice"
  ],
  "directions": [
    "0",
    "Preheat the oven to 200ºC/400ºF/gas 6. Soak the farro or bulgar wheat in cold water for 20 minutes, then drain. Slice the courgettes across into chunky half-moons and put them into a large roasting tray. Add the remaining vegetables and the garlic cloves and toss together with a good splash of olive oil. Season with pepper and a tiny pinch of salt. Try to spread the vegetables out in one layer, as they'll roast better this way (use 2 trays if you have to). Roast in the preheated oven for 30 to 40 minutes, removing the trays and carefully shaking them now and then, until the vegetables are cooked through and crisp around the edges. Sprinkle a little vinegar over the vegetables as soon as they come out of the oven and set aside to cool. When cool, tip on to a large chopping board, add the fresh herbs and chop finely.",
    "Place the farro or bulgar wheat in a large saucepan, cover with fresh cold water and bring to the boil. Simmer for 20 minutes, or until tender, and drain well. Dress with olive oil and the lemon juice, season with salt and pepper, and toss with the roasted herby vegetables. Scatter over the reserved fennel tops and serve."
  ],
  "ingredients": [
    "0",
    "400 g farro or bulgar wheat",
    "3 yellow courgettes, halved lengthways and deseeded",
    "2 green courgettes, halved lengthways and deseeded",
    "2 bulbs fennel, trimmed and thickly sliced, herby tops reserved",
    "1 red onion, peeled and cut into wedges",
    "2 red peppers, halved, deseeded and cut into chunks",
    "2 aubergines, cut into chunks",
    "4 cloves garlic",
    "extra virgin olive oil",
    "sea salt",
    "freshly ground black pepper",
    "herb or white wine vinegar",
    "1 good bunch fresh herbs (flat-leaf parsley, basil, mint, oregano)",
    "1 squeeze lemon juice"
  ],
  "__v": 1
}