{
  "hash": "d4a303d66599763c1d920552de3c34f1ba14b653",
  "title": "LEMON MERINGUE CUPCAKES",
  "image": "https://www.lifeloveandsugar.com/wp-content/uploads/2017/03/Lemon-Meringue-Cupcakes3.jpg",
  "href": "https://www.lifeloveandsugar.com/lemon-meringue-cupcakes/",
  "extension": "Chrome",
  "firstAdded": "2019-02-10T23:16:07.727000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350°F (176°C) and prepare a cupcake pan with liners.",
    "Add the flour, sugar, baking powder and salt to a large mixer bowl and combine. Set aside.",
    "Add the milk, vegetable oil, vanilla extract, lemon zest and egg to a medium sized bowl and combine.",
    "Add the wet ingredients to the dry ingredients and beat until well combined.",
    "Slowly add the water to the batter and mix on low speed until well combined. Scrape down the sides of the bowl as needed to make sure everything is well combined.",
    "Fill the cupcake liners about half way and bake for 15-17 minutes, or until a toothpick comes out with a few moist crumbs.",
    "Remove the cupcakes from the oven and allow to cool for 2 minutes, then remove to a cooling rack to finish cooling.",
    "To make the lemon curd, combine all the ingredients in a double boiler (or in a metal bowl over a pot of simmering water). Heat while whisking constantly until mixture thickens and reaches 160 degrees, or coats the back of a spoon.",
    "Pour the lemon curd into a small bowl and cover with clear wrap pressed against the top of the curd to prevent a film from forming. Refrigerate until completely cool and firm, 3-4 hours.",
    "When you are ready to build the cupcakes, make the meringue frosting. To make the meringue, combine the sugar, cream of tartar, vanilla extract and egg whites in a large mixer bowl. Place the bowl over a saucepan or pot of simmering water. You can also use a double boiler.",
    "Whisk constantly until sugar is dissolved and egg whites are warm, to between 120 and 140 degrees on a thermometer, about 4-6 minutes. Remove from heat.",
    "Using the whisk attachment, beat the egg white mixture on low speed, gradually increasing to high, until stiff, glossy peaks form, 5 to 7 minutes.",
    "To put the cupcakes together, use a cupcake corer (or a knife) to cut a hole in the center of the cupcakes.",
    "Fill the center of the cupcake with lemon curd.",
    "Frost the cupcakes with the meringue frosting. I use Ateco tip 808.",
    "Finish off the cupcakes with a slice of lemon, if you like, then toast lightly with a kitchen torch.",
    "Refrigerate cupcakes until ready to serve."
  ],
  "ingredients": [
    "0",
    "LEMON CUPCAKES",
    "1 1/4 cups (163g) all purpose flour",
    "1 cup (207g) sugar",
    "1 1/2 tsp baking powder",
    "1/2 tsp salt",
    "1/2 cup (120ml) milk",
    "1/4 cup (60ml) vegetable oil",
    "1 tsp vanilla extract",
    "2 tsp lemon zest",
    "1 large egg",
    "1/2 cup (120ml) water",
    "LEMON CURD",
    "6 tbsp (90ml) fresh lemon juice",
    "1 tbsp finely grated lemon zest",
    "½ cup (104g) sugar",
    "6 large egg yolks",
    "4 tbsp (56g) unsalted butter",
    "MERINGUE FROSTING",
    "1 cup (207g) sugar",
    "1/2 tsp cream of tarter",
    "1 tsp vanilla extract",
    "4 large egg whites"
  ],
  "__v": 1
}