{
  "__v": 1,
  "directions": [
    "0",
    "Method",
    "1. For the flavoured butter, put the butter, parsley, nutmeg, cayenne, lemon zest and juice in a food processor or blender and process for two minutes until well blended. Transfer to a bowl and add the shallots, garlic and salt to taste. Fold together until evenly combined. Lay a sheet of cling film on a work surface and spoon the butter onto it. Wrap the butter in the cling film, rolling it into a long sausage and tie the ends of the cling film to secure. Chill for two hours to firm up before serving. (The butter will keep in the fridge for a week, or it can be frozen.)",
    "2. When ready to serve, heat your grill to medium-high. Oil the grill tray and the white side of the fish, season with salt and lay in the tray, white side down. Drizzle a little more oil over the upper brown side of the fish and season with salt. Slide the tray under the grill and cook the fish for five to six minutes.",
    "3. At the same time, place a large saucepan (that has a tight-fitting lid) over a medium heat. When the pan is hot, add the clams and wine. Put the lid on and steam for two minutes until the shells open. Drain the clams, reserving the juices; discard any that are unopened.",
    "4. Baste the fish under the grill with the cooking juices and a little more oil if needed. Grill for a further five or six more minutes until cooked, checking every minute or so towards the end.",
    "5. Meanwhile, unwrap the butter and slice into discs. When the fish is cooked, place 3 slices of the flavoured butter on top of each lemon sole and soften it slightly under the grill. At the same time, gently warm the clams in some of the flavoured butter. (Refrigerate any leftover butter for another use.)",
    "6. Place a cooked lemon sole on each warmed serving plate and add the fish cooking juices to the clams. Spoon the clams and butter over the lemon soles and sprinkle with some chopped parsley. Serve with lemon wedges and a bowl of crispy deep-fried courgettes or seasonal vegetables of your choice."
  ],
  "firstAdded": "2014-06-26T10:43:53.311000",
  "hash": "3bb289621a36edff2432fd3026d83fafd8b642f4",
  "href": "http://www.redonline.co.uk/food/recipes/lemon-sole-with-parsley-and-clams",
  "image": "http://assets.redonline.co.uk/var/ezflow_site/storage/images/media/banners/article-banners/food/recipe-pics/lemon-sole/5155488-1-eng-GB/lemon-sole_article_banner_img.jpg",
  "ingredients": [
    "0",
    "Serves: 4",
    "Preparation time: 10 minutes, plus time to chill",
    "Cooking time: 15 minutes",
    "You will need",
    "4 lemon soles, about 400g each, prepared to cook whole 2kg live clams, cleaned Light rapeseed oil for cooking 100ml white wine Sea salt For the flavoured butter:",
    "250g unsalted butter, softened 4tsp chopped curly parsley ¼ tsp grated nutmeg 1 tsp cayenne pepper Finely grated zest and juice of 1 lemon 2 shallots, peeled and finely chopped 1 garlic clove, peeled and finely chopped To serve:",
    "1-2 tbsp chopped parsley lemon wedges deep fried courgettes, optional"
  ],
  "keywords": [
    "serves",
    "preparation",
    "minutes",
    "time",
    "chill",
    "cooking",
    "need",
    "lemon",
    "soles",
    "prepared",
    "live",
    "clams",
    "cleaned",
    "light",
    "rapeseed",
    "oil",
    "white",
    "wine",
    "salt",
    "flavoured",
    "butter",
    "unsalted",
    "softened",
    "curly",
    "parsley",
    "nutmeg",
    "cayenne",
    "pepper",
    "zest",
    "juice",
    "shallots",
    "garlic",
    "clove",
    "serve",
    "wedges",
    "deep",
    "fried",
    "courgettes"
  ],
  "title": "Lemon sole with parsley and clam butter",
  "users": [
    null
  ]
}