{
  "hash": "561f33f7060f0786af232af11f097a50a0048682",
  "title": "SPICED AND SUPERJUICY ROAST TURKEY",
  "image": "https://www.nigella.com/assets/uploads/recipes/public-thumbnail/spiced-and-superjuicy-roast-tu-561e3febefca5.jpg",
  "href": "https://www.nigella.com/recipes/spiced-and-superjuicy-roast-turkey",
  "extension": "Chrome",
  "firstAdded": "2017-12-23T09:53:21.368000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "METHOD",
    "Put the water into your largest cooking pot or a bucket or plastic bin. Squeeze the juice from the orange quarters into the water before you chuck the husks in, then add all the other ingredients, stirring to combine the salt, sugar, syrup and runny honey.",
    "Remove any string or trussing from the turkey, shake it free, remove the giblets, if not already done, and put them in the fridge (or straightaway set about making the stock for the gravy), then add the bird to the liquid, topping up with more water if it is not completely submerged.",
    "Keep covered in a cold place, even outside overnight or for up to a day or two before you cook it, remembering to take it out of its liquid (and wipe it dry with kitchen paper) 1-2 hours before it has to go into the oven.",
    "Read the Important Note below, and preheat the oven to 200°C/gas mark 6/400ºF.",
    "Melt the goose fat (or butter) and maple syrup together slowly over a low heat. Paint the turkey with the glaze before roasting in the oven, and baste periodically throughout the cooking time.",
    "Roast for 2½ hours. When you think it’s ready, pierce the turkey with the point of a sharp knife where the body meets the leg, and if the juices run clear, it’s cooked; if still pink, cook it for longer until they run clear, or use a meat thermometer.",
    "Then take the turkey out of the oven, and let it sit, tented with foil, for 20–40 minutes or even longer if you like, as I do."
  ],
  "ingredients": [
    "0",
    "approx. 6 litres water",
    "1 large orange or 2 smaller (quartered)",
    "250 grams maldon salt (or 125g / ½ cup table salt)",
    "3 tablespoons black peppercorns",
    "1 bouquet garni",
    "1 cinnamon stick",
    "1 tablespoon caraway seeds",
    "4 cloves",
    "2 tablespoons allspice berries",
    "4 star anise",
    "2 tablespoons white mustard seeds",
    "200 grams sugar",
    "2 onions (unpeeled and quartered)",
    "1 x 6 centimetres piece of fresh root ginger (unpeeled and cut into 6 slices)",
    "4 tablespoons maple syrup",
    "4 tablespoons runny honey",
    "stalks from 1 bunch fresh parsley",
    "1 x 5½ kilograms turkey"
  ],
  "__v": 1
}