{
  "hash": "e33faae4da6d280706b9084ad6ab08ed978975e1",
  "title": "potato pizza, even better",
  "image": "https://smittenkitchendotcom.files.wordpress.com/2016/04/potato-pizza-pizza-con-potate1.jpg?w=640",
  "href": "https://smittenkitchen.com/2016/04/potato-pizza-even-better/",
  "extension": "Chrome",
  "firstAdded": "2018-09-12T22:53:07.832000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium bowl, combine the 1 quart lukewarm water with salt, stirring until the salt has dissolved. Use a mandoline or your best sharpest knife to slice the potatoes very thin (1/16 inch thick), and put the sliced directly into the salted water, which prevents oxidation and also helps soften them so they cook up nicely. Lahey says to let them soak for 1 1/2 hours or up to 12 in the fridge overnight, but I was quite happy with my results after a 25 to 30 minute soak.",
    "Heat your oven to 500°F with a rack in the center. Brush either 1 13×18-inch rimmed half-sheet pan or 2 9×13-inch quarter-sheet pans (shown) with olive oil. Divide your risen dough in half and use your fingertips, oiled or dusted with flour, to pull, stretch, nudge and press the dough across the bottom of the pan. The dough will be thin and imperfect. If holes form, just pinch them together. It’s all going to work out, promise.",
    "Drain the potatoes in a colander and use your hands to press out as much water as possible, then pat dry on paper towels. In a medium bowl, toss the potato slices with the onion, pepper, and olive oil. Spread this potato mixture over your dough, going all the way to the edges so that there’s no uncovered edge; put a bit more topping around the edges of the pie, as the outside tends to cook more quickly. Sprinkle evenly with rosemary. Usually the salt the potatoes were soaked in is enough, but you can sprinkle more on if desired.",
    "Bake for 25 to 30 minutes, until the topping is starting to turn golden brown and the crust is nicely bronzed underneath. Serve pizza hot or at room temperature."
  ],
  "ingredients": [
    "0",
    "1 recipe pizza dough (below) or about a 2/3 volume of my lazy fitted-to-your-schedule favorite or your favorite, whichever it may be",
    "4 teaspoons fine sea or table salt",
    "6 to 8 (1 kilo) small to medium Yukon Gold potatoes, peeled",
    "1 medium yellow onion, diced",
    "1/2 teaspoon freshly ground black pepper",
    "4 to 5 tablespoons olive oil",
    "About 1 tablespoon fresh rosemary leaves"
  ],
  "__v": 1
}