{
  "hash": "cf059c6a156cfed8734e24749c18fde52e028853",
  "title": "21DSD Lactation Cookies",
  "image": "",
  "href": "http://21daysugardetox.com/news/21dsd-recipe-sugar-and-sweetener-free-lactation-cookies/",
  "extension": "Chrome",
  "firstAdded": "2016-02-11T14:52:30.119000",
  "users": [
    null
  ],
  "keywords": [
    "greentipped",
    "bananas",
    "mashed",
    "measure",
    "coconut",
    "oil",
    "cooled",
    "slightly",
    "eggs",
    "vanilla",
    "anise",
    "fennel",
    "seed",
    "grinding",
    "almond",
    "flourmeal",
    "flax",
    "seedsflax",
    "meal",
    "salt",
    "baking",
    "soda",
    "seeds",
    "macadamia",
    "nuts",
    "walnuts",
    "faves",
    "raw",
    "cacao",
    "nibs"
  ],
  "directions": [
    "0",
    "To Make:",
    "Preheat your oven to 350F.",
    "In a large bowl, mash the bananas. Whisk in the melted coconut oil, eggs, and vanilla extract.",
    "In another bowl, mix together the anise, almond flour, flax meal, sea salt, and baking soda.",
    "Add the dry ingredients to the wet ingredients and mix well.",
    "Add the chopped nuts, shredded coconut, and cacao nibs. Mix well (it will be thick).",
    "Using a small cookie scoop or a rounded tablespoon, scoop out the batter onto Silpat or parchment-lined baking sheets. I leave mine rounded (more of a macaroon shape), but you can also flatten them slightly. They do not spread while cooking.",
    "Bake at 350F for 18-20 minutes or until a light golden brown.",
    "Remove from oven, let cool for 5-10 minutes, then cool completely on a wire rack.",
    "Store in an air-tight container at room temperature for a few days, or refrigerate or freeze to extend shelf life. Note: they will soften over time, but will still taste delicious. They also taste great frozen and slightly thawed!"
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "1 cup green-tipped bananas, mashed (about 2 large, but measure)",
    "¼ cup coconut oil, melted and cooled slightly",
    "2 large eggs",
    "2 tsp. vanilla extract",
    "1 Tbsp. ground anise seed; can substitute ground fennel seed (measure after grinding)",
    "1 cup almond flour/meal",
    "¼ cup ground flax seeds/flax meal",
    "¼ tsp. sea salt",
    "½ tsp. baking soda",
    "½ cup shredded coconut",
    "¼ cup chopped nuts or seeds (macadamia nuts and walnuts are my faves)",
    "¼ cup raw cacao nibs"
  ],
  "__v": 1
}