{
  "hash": "13f8be69874f63a0ce31e4266031957c80e33e5d",
  "title": "Spiced Lamb Skewers With Lemony Onions",
  "image": "https://static01.nyt.com/images/2019/07/03/dining/01Roman1/merlin_157085166_9eb86bcb-a02c-4bdb-ac67-50de1be9aec0-articleLarge.jpg",
  "href": "https://cooking.nytimes.com/recipes/1020316-spiced-lamb-skewers-with-lemony-onions?em_pos=medium&ref=headline&nl_art=0&te=1&nl=cooking&emc=edit_ck_20190703?campaign_id=58&instance_id=10637&segment_id=14889&user_id=4264688f24592aeeb06433e5d96d7150&regi_id=79859114emc=edit_ck_20190703",
  "extension": "Firefox",
  "firstAdded": "2019-07-08T00:08:16.788000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Season lamb with salt and pepper. Add cumin and turmeric and toss to coat. (This can be done up to 24 hours ahead, if you like.)",
    "If you’re using a charcoal grill, build the fire so it’s screaming hot. This lamb is to be cooked hot and fast so it can stay nicely medium-rare, so the hotter the better. If you’re using a gas grill, set it on high. Bring a clean platter, cutting board or baking dish out to the grill for the skewers to rest in after cooking.",
    "Combine onion, sumac (if using) and 3 tablespoons lemon juice; season with salt and pepper and toss to combine. Set aside.",
    "Combine yogurt and remaining 2 tablespoons lemon juice; season with salt and pepper. Set aside.",
    "Skewer the lamb onto wooden or metal skewers, 2 to 4 pieces per skewer.",
    "Once the grill is hot, cook the skewers on all sides until deeply browned and lightly charred all over, 2 to 3 minutes per side (less time for smaller pieces), moving the skewers around as needed to prevent excessive flare-ups. (If you’ve trimmed most of the fat away from the lamb, the flare-ups shouldn’t be too bad.)",
    "Transfer the skewers to the platter, cutting board or baking dish to rest for a few minutes and drizzle with olive oil. Serve with the dressed onions, lemony yogurt, cilantro, olives, lavash and any pickled vegetables or peppers you like."
  ],
  "ingredients": [
    "0",
    "1 ½ to 2 pounds boneless lamb leg or shoulder, excess fat trimmed, meat cut into 1 1/2-inch pieces",
    "Kosher salt and black pepper",
    "1 tablespoon plus 1 teaspoon ground cumin",
    "2 teaspoons ground turmeric",
    "1 small red onion, thinly sliced",
    "1 teaspoon ground sumac (optional)",
    "5 tablespoons fresh lemon or lime juice",
    "1 cup full-fat Greek yogurt",
    "Olive oil, for drizzling",
    "1 cup cilantro, tender leaves and stems",
    "½ cup pitted black olives, finely chopped",
    "Lavash, pita or flatbread, for serving",
    "Pickled cabbage, cucumbers, peppers or a mix, for serving"
  ],
  "__v": 2
}