{
  "__v": 2,
  "directions": [
    "0",
    "To make the dough, combine the flour, cheese, salt, sugar and butter in a medium bowl, and mix with your fingertips until the mixture resembles coarse crumbs. Beat in the egg yolk and add in water 1 tablespoon at a time and mix until the dough comes together and is no longer dry, being careful not to over mix. Flatten the dough slightly, wrap in cling wrap, and refrigerate for at least 45 minutes to an hour or until firm enough to roll out.",
    "On a lightly floured surface, roll out the pastry, about 2mm thickness to fit into 9 inch (23 cm) pie pan for one round quiche or cut the dough with round pastry cutter and gently press the dough onto individual disposable aluminum pie mould. Flute the edges of the pastry and chill for 20- 30 minutes prior to baking. Preheat oven to 200°C. Line pastry with baking paper. Fill half full with dried beans or rice. Blind bake for 12 minutes. Remove paper and beans before portioning the sautéed mushrooms, leeks and custard into the quiche.",
    "To make the filling: Heat oil in a frying pan over medium-high heat. Add shallots, mushrooms, leeks, herbs, mustard and sauté for 15 minutes. Drain off the access liquid, scoop filling onto the pre-baked casing.",
    "To make Savoury Custard: Whisk eggs, cream, milk and seasonings in a jug. Pour over the mushrooms filling and lastly, sprinkle some grated cheddar over the top of each quiche before baking. Bake for another 30 minutes (for one large whole quiche or 18 minutes for mini individual quiches) or until set before removing from the oven.",
    "Let the quiche rest for at least 15 to 20 minutes before cutting, ideally, serve quiche warm or even at room temperature."
  ],
  "firstAdded": "2014-10-16T04:53:38.265000",
  "hash": "b8712b9c77565c3f4fb9dbe15d3c3d1c63632e09",
  "href": "http://www.thestar.com.my/Lifestyle/Food/Recipes/2011/12/26/Wild-Mushroom-and-Leek-Quiche/",
  "image": "http://www.thestar.com.my/~/media/Images/TSOL/Photos-Gallery/Kuali/2011/12/mush.ashx?w=620&h=413&crop=1&",
  "ingredients": [
    "0",
    "Cheesy Crust",
    "------------------------",
    "80g grated parmesan cheese",
    "250g all purpose flour",
    "3g salt",
    "10g sugar",
    "150g butter, chilled and cut into small cubes",
    "1 egg yolk",
    "3 - 4 tbsp ice water, add as necessary.",
    "-----------------------------------",
    "Mushroom and Leek Filling:",
    "-----------------------------------",
    "1 tbsp olive oil",
    "3 shallots, finely chopped",
    "400g assorted wild mushrooms (shitake, oyster, porcini, etc), diced",
    "3 pieces of leeks, thinly sliced",
    "1 1/2 tbsp. fresh tarragon, chopped",
    "1 tbsp fresh parsley, chopped",
    "1 tbsp Dijon mustard",
    "4 medium-sized eggs",
    "300g cream",
    "150g milk",
    "A pinch of ground nutmeg, white and black pepper and salt to taste.",
    "80g shredded cheddar cheese (optional)"
  ],
  "keywords": [
    "cheesy",
    "crust",
    "parmesan",
    "cheese",
    "purpose",
    "flour",
    "salt",
    "sugar",
    "butter",
    "chilled",
    "cubes",
    "egg",
    "yolk",
    "ice",
    "water",
    "necessary",
    "mushroom",
    "leek",
    "filling",
    "olive",
    "oil",
    "shallots",
    "wild",
    "mushrooms",
    "shitake",
    "oyster",
    "porcini",
    "pieces",
    "leeks",
    "tarragon",
    "parsley",
    "dijon",
    "mustard",
    "mediumsized",
    "eggs",
    "cream",
    "milk",
    "nutmeg",
    "white",
    "black",
    "pepper",
    "cheddar"
  ],
  "title": "Wild Mushroom and Leek Quiche",
  "users": [
    null
  ]
}