{
  "hash": "b7ac5e9b589a0e90259e258e41a6bd32f36a540a",
  "title": "Chocolate Chip Mascarpone Cookies with Ricotta and Almonds",
  "image": "http://peasandpeonies.com/wp-content/uploads/2016/01/Chocolate-Chip-Mascarpone-Cookies-6005-600x900.jpg",
  "href": "http://peasandpeonies.com/2016/01/chocolate-chip-mascarpone-cookies-with-almonds/",
  "extension": "Chrome",
  "firstAdded": "2016-07-24T15:50:16.372000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 375F.",
    "In a medium bowl combine dry ingredients: flour, baking powder, cocoa and salt. Whisk and set aside.",
    "In a large bowl using an electric mixer beat the butter and sugars until light and fluffy, about 3 minutes. Add the eggs, one at a time, beating until incorporated. Add the ricotta cheese and mascarpone cheese. Beat to combine. Stir in the dry ingredients, 1 cup chopped almonds and chocolate chips.",
    "Line 2 baking sheets with parchment paper. Spoon the dough (about 2 tablespoons for each cookie) onto the baking sheets. Bake for 15 minutes (switching racks mid baking, lower baking sheet goes up, and the upper one down), until slightly golden at the edges. Remove from the oven and let the cookies rest on the baking sheet for 20 minutes, before moving to a cooling rack.",
    "Once the cookies have cooled, fill a small saucepan with water and bring to a boil and let the water simmer, choose a heat safe bowl that would sit nicely over the sauce pan and add the remaining 5 ounces of chopped chocolate to it.",
    "The bowl should not come into contact with the water in the saucepan as this can cause over heating. Remove the bowl from the saucepan while there are still a couple of small lumps of unmelted chocolate, stir until completely until melted and smooth. If there are a few lumps that didn't melt just put the bowl back over the saucepan of hot water for a minute or two and stir again.",
    "Dip each cookie top into the melted chocolate and sprinkle with the remaining chopped almonds. Place cookies in the fridge for 30 minutes for the chocolate to harden."
  ],
  "ingredients": [
    "0",
    "2½ cups all-purpose flour",
    "1 teaspoon baking powder",
    "1 teaspoon salt",
    "3 tablespoons unsweetened cocoa",
    "1 stick unsalted butter, softened",
    "1 cup granulated sugar",
    "1 cup brown sugar",
    "2 eggs",
    "8 ounces (1 cup) whole milk ricotta cheese",
    "8 ounces (1 cup) mascarpone cheese",
    "1½ cups finely chopped Almonds",
    "1 cup chocolate chips",
    "8 ounces bittersweet chocolate, chopped"
  ],
  "__v": 1
}