{
  "hash": "293bd33a2b409a3849c53d5d7761095d3ef4c758",
  "title": "Instant Pot Chicken Marsala",
  "image": "https://dfbkuy5licyr9.cloudfront.net/wp-content/uploads/2019/03/Chicken-Marsala.jpg?x19846",
  "href": "https://recipes.instantpot.com/recipe/chicken-marsala/",
  "extension": "",
  "firstAdded": "2019-06-08T15:13:55.919000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a shallow bowl, mix together Dredge Mix ingredients. Coat each piece of chicken in the dredge mix, shaking off excess.",
    "Add 1 tbsp olive oil and 1 tbsp butter to the Instant Pot. Using the display panel select the SAUTE function and adjust to HIGH or MORE.",
    "When butter melts, brown the meat on both sides, 3-4 minutes per side until golden. Meat will not be cooked through. Do not crowd the pot--you will have to work in batches. Transfer browned meat to a shallow dish in a single layer and cover loosely with foil.",
    "Add remaining oil, remaining butter, shallot and garlic to the pot and saute until soft, 2-3 minutes. Add mushrooms and cook for 4-5 minutes more.",
    "Add wine and broth to the pot and deglaze by using a wooden spoon to scrape the brown bits from the bottom of the pot. Carefully add back chicken in a single layer.",
    "Turn the pot off by selecting CANCEL, then secure the lid, making sure the vent is closed.",
    "Using the display panel select the MANUAL or PRESSURE COOK function*. Use the +/- keys and program the Instant Pot for 5 minutes.",
    "When the time is up, let the pressure naturally release for 5 minutes, then quick-release the remaining pressure.",
    "Carefully remove the chicken from the pot to a shallow dish in a single layer and cover loosely with foil.",
    "In a small bowl, mix 1/4 cup cooking liquid with 2 tbsp cornstarch. Stir into the pot, along with the cream.",
    "Cook and stir until thickened, about 5 minutes, returning to SAUTE mode as needed. Return chicken to the pot and cook an additional 1-2 minutes.",
    "Serve chicken over rice, mashed potatoes or pasta. Garnish with chopped parsley and fresh ground pepper."
  ],
  "ingredients": [
    "0",
    "Dredge Mix:",
    "1/3 cup flour",
    "1 1/2 tsp salt",
    "1 tsp pepper",
    "1 tsp garlic powder",
    "Chicken Marsala:",
    "2 lbs thin-sliced chicken breast",
    "1 + 1 tbsp olive oil",
    "1 + 1 tbsp butter",
    "1 shallot finely diced",
    "3 cloves garlic minced",
    "8 oz mushrooms sliced",
    "1/2 cup marsala wine",
    "1/2 cup chicken broth",
    "2 tbsp cornstarch",
    "1/3 cup cream",
    "1/4 cup chopped parsley for garnish (optional)"
  ],
  "__v": 1
}