{
  "hash": "ab54d81e8bf374ab21732185d9824cf31492355f",
  "title": "Skinny Teriyaki Pork Chops with Pineapple",
  "image": "http://www.recipe-diaries.com/wp-content/uploads/2016/02/skinny-teriyaki-grilled-porkchops-with-pineapple-025.jpg",
  "href": "http://www.recipe-diaries.com/2016/02/05/skinny-teriyaki-pork-chops-with-pineapple/",
  "extension": "Chrome",
  "firstAdded": "2016-05-16T17:59:08.980000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a small bowl, whisk together the orange juice, soy sauce, rice vinegar, brown sugar, ground ginger, onion powder, and garlic powder to make a marinade.",
    "Place the pork chops in a large resealable bag and add the marinade to coat. Seal the bag and place in the refrigerator for at least 2 hours up to overnight. If possible, turn the bag every hour or so to evenly cover the pork chops with the marinade.",
    "Transfer the pork chops to a shallow dish. Pour the marinade into a small saucepan.",
    "In a small bowl, dissolve the cornstarch into 2 teaspoons of cold water to make a slurry. Place the saucepan of marinade over medium heat and bring to a boil. Reduce the heat to low and whisk in the slurry. Cook, whisking, until the sauce thickens, about 2 minutes. Remove from the heat and set aside to use as a baste for the grilled pork chops and pineapple.",
    "Preheat an indoor grill, grill pan, or outdoor grill to medium-high heat. Lightly coat the grill rack of the indoor grill or grill pan with cooking spray.",
    "Place the pork chops on the grill and cook until the internal temperature reaches 145° F, 4 to 5 minutes per side, brushing often with the baste as you grill.",
    "Add the pineapple slices to the grill and cook for 1 to 2 minutes on both sides.",
    "Let the pork chops rest for 2 to 4 minutes before serving.",
    "To serve, place one grilled pineapple slice on top of each pork chop and serve with any remaining marinade sauce."
  ],
  "ingredients": [
    "0",
    "⅓ cup Tropicana® Trop50® orange juice or canned pineapple juice",
    "2 tablespoons less-sodium soy sauce",
    "1 tablespoon rice vinegar",
    "1 tablespoon brown sugar",
    "½ teaspoon ground ginger",
    "½ teaspoon onion powder",
    "½ teaspoon garlic powder",
    "4 (4-ounce) boneless pork chops, trimmed of fat",
    "2 teaspoons cornstarch",
    "4 thickly sliced fresh pineapple rings"
  ],
  "__v": 1
}