{
  "hash": "7641b130338e91fb8f3012b4664e4b8e890e8b0d",
  "title": "Homemade Beef Broth",
  "image": "https://relishit.files.wordpress.com/2014/12/dsc_0013.jpg?w=500&h=747",
  "href": "https://relishingit.com/2014/12/05/homemade-beef-broth/",
  "extension": "Chrome",
  "firstAdded": "2016-11-18T15:48:51.008000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400°F. Line a rimmed baking sheet with parchment paper (for easy clean-up). Place the beef bones, carrots, celery, onion, and garlic on the pan with a bit of olive oil and a sprinkle of salt. Roast for about 40-45 minutes, or until the beef and vegetables have a bit of color. Remove from oven.",
    "Add the beef, vegetables, and any juices (leave the grease behind) to a large kettle. Top it with the bay leaves, thyme, peppercorns, fresh parsley, cider vinegar, and enough cold filtered water to cover it all.",
    "Bring everything to a high simmer so that it’s almost boiling, but not quite. Then reduce the heat with the lid ajar to just a low simmer that is barely bubbling and let it cook away for as many hours as you can. Three hours for sure, but shoot for more, if you can. If wanting to use the meat from the meaty bone (and you should– it’s great for quick meals and/or snacks), remove from bone after about 2-3 hours, put the bone back in the pot.",
    "After you have finished simmering the broth, remove the large pieces with tongs and strain the liquid through a cheesecloth. This will give you a nice clear broth. At this point you can put it in jars (or BPA-free plastic quart-sized containers) leaving about an inch of head-space (the liquid will expand as it freezes) or leave it in a large pot and refrigerate until completely cold (this will take hours, so overnight works well) and pour into jars afterwards. This makes removing the top layer of grease a cinch. Once that has been completed, throw a lid on it and freeze."
  ],
  "ingredients": [
    "0",
    "about 6 pounds of good quality, preferably grass-fed, beef bones (some containing marrow and some containing a bit of meat)",
    "about 3 carrots, halved",
    "2 celery stalks, halved",
    "1 large onion, quartered",
    "1 garlic bulb (that’s the entire thing), halved and not peeled",
    "3 dried bay leaves",
    "1 teaspoon dried thyme",
    "1 tablespoon black peppercorns",
    "handful of fresh parsley, rough chopped",
    "2 tablespoons kosher salt, or more to taste",
    "6 tablespoons apple cider vinegar (I use Bragg’s)"
  ],
  "__v": 1
}