{
  "hash": "984718bfa666fb3eaf0fbe0d729cd92f8a8e8b64",
  "title": "A Vegan Pumpkin Chili That's NSFW",
  "image": "http://media1.onsugar.com/files/2014/10/07/045/n/1922195/bfe2929197e86a19_pumpkin-chili.xxxlarge_2x.jpg",
  "href": "http://www.popsugar.com/food/Pumpkin-Chili-Recipe-35890481/",
  "extension": "Chrome",
  "firstAdded": "2015-05-26T20:05:00.647000",
  "users": [
    null
  ],
  "keywords": [
    "yellow",
    "onion",
    "carrot",
    "bell",
    "pepper",
    "olive",
    "oil",
    "garlic",
    "jalapeo",
    "soy",
    "tamari",
    "mild",
    "chili",
    "cumin",
    "lowsalt",
    "tomatoes",
    "pureed",
    "pumpkin",
    "broth",
    "water",
    "beans",
    "lime",
    "juice",
    "toppings",
    "cilantro",
    "jalapeos",
    "avocado",
    "tortilla",
    "strips"
  ],
  "directions": [
    "0",
    "DIRECTIONS",
    "Chop up the onion, carrot, and bell pepper into pieces no bigger than a bean.",
    "In a big soup pot, heat the oil over medium heat. Add the onion, carrot, and bell pepper and sauté them until they begin to brown, about 5 minutes. Add the garlic, jalapeño, soy sauce, and spices and cook that all together for another 30 seconds. Add the tomatoes, pumpkin, broth, and beans and stir that up so everything is mixed. Get those flavors mingling and sh*t. Turn down the heat, cover, and let that simmer together for about 15 minutes. Stir it around every now and then.",
    "When it is done simmering, turn off the heat and stir in the lime juice. Serve right away with your favorite toppings.",
    "*Fire-roasted tomatoes are damn delicious if you can find them.",
    "**You can buy canned pumpkin puree, or cut up a fresh pumpkin into chunks, steam it until it is tender, and puree the f*ck out of it until you have 1 1/2 cups. If you try to make this chili with pumpkin pie filling, don't complain about how f*cked up it tastes. You did that dumb sh*t yourself.",
    "***Whatever beans you prefer in a chili are cool, but if you need direction, half black bean and half pinto make a solid combo. And yeah, you can use two 15-ounce cans"
  ],
  "ingredients": [
    "0",
    "1 yellow onion",
    "1 carrot",
    "1 bell pepper",
    "1 teaspoon olive oil",
    "2 to 3 cloves garlic, minced",
    "1 jalapeño, minced",
    "2 teaspoons soy sauce or tamari",
    "2 1/2 tablespoons mild chili powder",
    "1 teaspoon ground cumin",
    "1 can (14.5 ounces) low-salt diced tomatoes*",
    "1 1/2 cups pureed pumpkin**",
    "2 cups vegetable broth or water",
    "3 cups cooked beans***",
    "1 tablespoon lime juice",
    "Toppings: cilantro, chopped onion, jalapeños, avocado, tortilla strips"
  ],
  "__v": 2
}