{
  "hash": "15aa4fb9a5984b74d43a6f3d65e806f84d858827",
  "title": "honey chipotle chicken bowls with lime quinoa.",
  "image": "http://www.howsweeteats.com/wp-content/uploads/2014/01/honey-chipotle-chicken-bowls-I-howsweeteats.com-3.jpg",
  "href": "http://www.howsweeteats.com/2014/01/honey-chipotle-chicken-bowls/",
  "extension": "Chrome",
  "firstAdded": "2017-01-09T04:57:43.093000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Add the chicken breasts to a baking dish or ziplock bag and season with salt and pepper. In a bowl, whisk together the olive oil, adobo, honey, mustards, cilantro and garlic. Pour the marinade over the chicken, covering it evenly. Place it in the fridge and marinate for at least 2 hours, or even overnight.",
    "When you're ready to make the meal, heat a large nonstick skillet over medium-high heat. Add a tiny bit of olive oil and add the chicken, then cover the skillet and cook until the chicken is deeply browned on both sides and cooked in the center, about 6 minutes per side.",
    "To make the salads, add the greens in a large bowl and toss them with a sprinkle of salt and pepper. Add the chicken on top along with the quinoa, the tomatoes, cilantro, green onions and avocado. Drizzle the bowl with the lime juice, olive oil and honey. Serve!",
    "lime quinoa",
    "Add the quinoa and stock (or water) to a saucepan over high heat and bring it to a boil. Once boiling, reduce the heat to low and cover the pot. Cook for about 15 minutes, or until all the liquid is absorbed. Stir in the coconut oil (you can swap butter), lime juice, zest, salt and pepper.",
    "Be sure to follow howsweeteats on instagram and tag your recipes with #howsweeteats! You can also post a photo of your recipe to the howsweeteats facebook page. I appreciate you so much!",
    "(you should probably add some tortilla chips on top. i set a good example.)",
    "posted in Poultry, Recipes, Salads 234 comments »",
    "share:",
    "you may also like...",
    "grilled tomato basil chicken.",
    "easy weeknight chicken tacos. {video!}",
    "no-bake bourbon pecan pie cheesecakes.",
    "234 comments",
    "Older Comments",
    "Pingback: Greatest Quick and Healthy Meal Recipes Ever!",
    "Pingback: Weekly Menu {1/4–1/8} – Cassia & Co.",
    "Pingback: Entretenimiento: 11 recetas que te demostrarán que tu almuerzo o cena son mejores en un bowl | Quitopolis",
    "Pingback: 11 recetas que te demostrarán que tu almuerzo o cena son mejores en un bowl | La Ciudad - El Diario Digital de la Ciudad de Goya -",
    "Pingback: 11 recetas que te demostrarán que tu almuerzo o cena son mejores en un bowl | Secreto Cotidiano",
    "Pingback: 11 recetas que te demostrarán que tu almuerzo o cena son mejores en un bowl - Mascompartido",
    "Pingback: Honey Chipotle Chicken Bowls | Feeding the Chicken-Pig",
    "Pingback: Comida saludable y rica en minutos – Sauma Eventos",
    "Pingback: The 35 Best Quinoa Bowls - Simply Quinoa",
    "Pingback: The Week's End - The District Table",
    "Pingback: Weekly Menu {3/21–3/25} – Cassia & Co.",
    "christie\t— April 11, 2016 @ 8:38 am\tREPLY",
    "these bowls turned out delicious! my family is especially swooning over the marinade! thanks for the healthy inspiration jessica! http://www.thearrowprojects.com/post/142629110669/honey-chipotle-chicken-bowls-with-lime-quinoa",
    "christie\t— April 11, 2016 @ 8:40 am\tREPLY",
    "these bowls turned out delicious! my family is especially swooning over the marinade! thanks for the healthy inspiration jessica!",
    "Pingback: Taking the Lunch Bunch South With a Tex-Mex Menu - A Sweat Life",
    "Pingback: Recipe Roundup: Bowls by Karyl's Kulinary Krusade",
    "Ritika @ R&M\t— August 15, 2016 @ 9:01 pm\tREPLY",
    "I especially love that there are so many flavours and ingredients that go into this. No more boring lunches for me! Thanks for sharing, I’ll be trying this tomorrow.",
    "Pingback: 15 Healthy Colorful Grain Salads That Will Go Perfect With Your Lunch",
    "Sarina\t— September 12, 2016 @ 11:59 am\tREPLY",
    "I love this meal! I can eat it everyday",
    "Do you think this would work with salmon?",
    "Pam\t— September 27, 2016 @ 7:42 am\tREPLY",
    "I’m not familiar with Adobo, do you have a favourite brand I can look for? Thanks!",
    "Pingback: Moroccan Chicken Couscous Bowls | Bourbon and Honey",
    "Pingback: Big Ol’ Menu Plan | Loud Family Living",
    "Susan\t— October 25, 2016 @ 11:18 am\tREPLY",
    "This looks amazing! I’m going to try it this week. This post brought back terrible polar vortex memories for me too. I lived in Iowa during the winter of 2013, and it was miserable! If you’re still in a polar vortex area I hope this winter is mild for you! Thanks for the recipe.",
    "Pingback: What is a Buddha Bowl plus 22 Buddha Bowl Recipes",
    "Cynthia Schreiber\t— November 8, 2016 @ 1:34 am\tREPLY",
    "Just made this, it is delicious. Was wondering how many calories per serving?",
    "Pingback: 8 Recipes That Prove Everything’s Better In A Bowl – Sand & Sangria",
    "Pingback: 47 Delicious Meal Prep Ideas For Weight Loss",
    "Pingback: November Favorites 2016",
    "Pingback: 15 Delicious And Satisfying Lunches To Eat In 2017 - Viral Babel",
    "Older Comments",
    "leave a reply",
    "Your email address will not be published. Required fields are marked *",
    "Comment",
    "Name *",
    "Email *",
    "Website",
    "PREVIOUS POST:",
    "jalapeño honey hummus with spiced olive oil tortilla chips.",
    "NEXT POST:",
    "currently crushing on.",
    "Hey hey! You found me. At the corner of the internet that I've deemed extremely self-indulgent.",
    "MORE ABOUT ME »",
    "let’s be friends!",
    "Subscribe to receive new posts via email:",
    "Email Frequency Daily Weekly",
    "ORDER NOW: Barnes & Noble / Amazon / Indiebound",
    "my latest videos",
    "most recent posts",
    "categories",
    "archives",
    "FOLLOW ON INSTAGRAM",
    "subscribe: Daily Weekly",
    "^ TOP HOME ABOUT FAQS CONTACT RECIPES ©2017 HOW SWEET IT IS. Design by PURR.",
    "Select Ingredients",
    "(note: you can drag this box around to make it easier to highlight the recipe)",
    "Please highlight the ingredients for this recipe and click \"Next\"",
    "Next",
    "Select Directions",
    "(note: you can drag this box around to make it easier to highlight the recipe)",
    "Please highlight the directions for this recipe and click \"Next\"",
    "Back"
  ],
  "ingredients": [
    "0",
    "honey chipotle chicken",
    "1 pound boneless, skinless chicken breasts",
    "1/4 teaspoon salt",
    "1/4 teaspoon pepper",
    "1/4 cup olive oil",
    "3 tablespoons adobo sauce, from a can of chipotles in adobo",
    "2 tablespoons honey",
    "1 tablespoon dijon mustard",
    "1 tablespoon honey mustard",
    "2 tablespoons chopped fresh cilantro",
    "4 garlic cloves, minced",
    "salad",
    "6 cups spring greens",
    "1/2 pint cherry tomatoes, halved",
    "1/4 cup torn fresh cilantro",
    "4 green onions, sliced",
    "1 avocado, sliced",
    "1 lime, juiced",
    "1 tablespoon olive oil",
    "1/2 tablespoon honey",
    "lime quinoa",
    "1/2 cup uncooked quinoa, rinsed",
    "1 cup low-sodium chicken or vegetable stock, or even water",
    "1 tablespoon coconut oil",
    "1 lime, juiced and zest freshly grated",
    "1/4 teaspoon salt",
    "1/4 teaspoon pepper"
  ],
  "__v": 1
}