{
  "__v": 3,
  "directions": [
    "0",
    "Sift the dry ingredients (except the baking soda) into a bowl and set it aside. Cream the butter and sugar until pale and fluffy. While beating the mixture, add the eggs one at a time. Then, add the vanilla and coffee.",
    "Slowly beat the dry ingredients in, alternating with the buttermilk. Make sure to start and end with the dry ingredients.",
    "Once everything is combined, add the black food colouring until you get the desired shade. Six drops should be good enough, although you can always add a few more.",
    "In a bowl, combine baking soda with the vinegar. It will fizz up instantly so add this mixture to the batter immediately, beat for about half a minute.",
    "Pour the batter into two 20cm prepared baking pans and place them in the heated oven. If your oven is too small for two cake pans, you can always do them separately. Each pan should take about 20-30 minutes to bake at 180°C (do the toothpick test after 20 minutes to check).",
    ">>>>> For the frosting: While the cake is baking, prepare your frosting. Combine the butter, shortening and icing sugar and whisk until it is light and fluffly. Add the vanilla and salt. Set aside.",
    "Place the marshmallows with a bit of sugar syrup into a bowl and microwave it for a minute on high or until it melts. Otherwise, stand an over-proof bowl in a pot of boiling water and let the marshmallow melt down into a creamy, fluffy texture. You may need to add a bit of milk or heavy cream to speed up the process. Once done, mix the marshmallow fluff with the buttercream, and then beat the cream cheese in.",
    "* If you’re not too keen on using shortening, you can use 120g of unsalted butter instead.",
    ">>>>> Assembling the cake: When your cakes have cooled down, place a generous amount of frosting on top of one cake and smooth it out; place the second cake on top once that’s done. Slather the whole cake with the remainder of the frosting, beginning from the top and then the sides. Finish it off with some coloured sugar crystals or sprinkles."
  ],
  "firstAdded": "2014-11-02T04:18:23.924000",
  "hash": "a73db48085177a514b2def6101c8cf686fd6fbd2",
  "href": "http://www.thestar.com.my/Lifestyle/Food/Recipes/2014/11/01/Black-Velvet-Cake-with-Marshmallow-Cream-Cheese-Frosting/",
  "image": "http://www.thestar.com.my/~/media/Images/TSOL/Photos-Gallery/features/2014/11/01/str2_chef0111_ga_4.ashx?w=620&h=413&crop=1&",
  "ingredients": [
    "0",
    "280g plain flour",
    "2 tbsp unsweetened cocoa powder",
    "1 tsp baking powder",
    "½ tsp salt",
    "115g unsalted butter",
    "300g sugar",
    "2 eggs (large)",
    "1 tsp vanilla essence",
    "3 tbsp coffee (instant or brewed, cooled down)",
    "1 cup buttermilk",
    "Black food colouring",
    "1 tsp baking soda",
    "1 tsp white vinegar",
    ">>>>>>>>>>>>>>>>>>>>>",
    ">>> Frosting",
    "60g icing sugar, sifted",
    "80g unsalted butter, softened",
    "40g vegetable shortening*",
    "60g cream cheese, softened",
    "½ tsp vanilla essence",
    "Half a bag of marshmallows (about 1.5 cups)",
    "pinch of salt"
  ],
  "keywords": [
    "plain",
    "flour",
    "cocoa",
    "baking",
    "salt",
    "unsalted",
    "butter",
    "sugar",
    "eggs",
    "vanilla",
    "essence",
    "coffee",
    "instant",
    "brewed",
    "cooled",
    "buttermilk",
    "black",
    "food",
    "colouring",
    "soda",
    "white",
    "vinegar",
    "frosting",
    "icing",
    "sifted",
    "softened",
    "shortening",
    "cream",
    "cheese",
    "marshmallows"
  ],
  "title": "Black Velvet Cake with Marshmallow Cream Cheese Frosting",
  "users": [
    null
  ]
}