{
  "hash": "8e6b7bd9450cd4c8208c551c421e54949f2db19e",
  "title": "Salmon Tacos with Guacamole",
  "image": "http://images.meredith.com/bhg/images/recipe/p_RU286987.jpg",
  "href": "http://www.familycircle.com/recipe/salmon-tacos-with-guacamole-1/",
  "extension": "Chrome",
  "firstAdded": "2016-11-15T17:15:20.480000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "In a small lidded pot, combine 1 1/2 cups water, 1 cup Texmati Royal Blend rice and 1 tbsp olive oil. Bring to a boil, reduce heat to low and cook, covered, 15 minutes. Remove from heat and let stand 5 minutes. Fluff with a fork and stir in 1/4 tsp salt and 1/8 tsp pepper. Cover and set aside. Meanwhile, mash 1 ripe avocado in a bowl. Stir in 1 tsp lime juice, 1 clove grated garlic, 1 tbsp chopped cilantro and 1/4 tsp salt. Set aside. Pat dry four 4 oz salmon fillets. Place on a foil-lined baking sheet and rub with 2 tsp olive oil. In a small bowl, combine 1/2 tsp each coriander and sweet paprika, 1/4 tsp salt and 1/8 tsp pepper. Rub onto salmon. Bake at 400 degrees for 15 minutes, until fish flakes easily with a fork. Wrap 8 small corn tortillas in foil; place in oven for a few minutes until warmed through. To assemble, flake salmon into large pieces, leaving skin on foil, and place on warm tortillas with guacamole and Cilantro-Lime Yogurt. Add cilantro and lime wedges, if desired, and serve with rice on the side.",
    "Cilantro-Lime Yogurt",
    "Combine 1 container (6 oz) 0% plain Greek yogurt with 1 tbsp chopped cilantro, 1 tsp each lime juice and lime zest and 1/8 tsp salt.",
    "Nutrition Information for Salmon Tacos with Guacamole",
    "Servings Per Recipe: 4",
    "PER SERVING: 446 cal., 18 g total fat 598 mg sodium, 41 g carb."
  ],
  "ingredients": [
    "0",
    "Cilantro-Lime Yogurt",
    "Combine 1 container (6 oz) 0% plain Greek yogurt with 1 tbsp chopped cilantro, 1 tsp each lime juice and lime zest and 1/8 tsp salt.",
    "Nutrition Information for Salmon Tacos with Guacamole",
    "Servings Per Recipe: 4",
    "PER SER"
  ],
  "__v": 1
}