{
  "hash": "c370628b494d05728152206430eca42d360062e8",
  "title": "Cherry swirl cheesecake",
  "image": "http://www.bbcgoodfood.com/sites/bbcgoodfood.com/files/recipe_images/recipe-image-legacy-id--10143_11.jpg",
  "href": "http://www.bbcgoodfood.com/recipes/6523/cherry-swirl-cheesecake",
  "extension": "Chrome",
  "firstAdded": "2015-06-03T16:55:06.024000",
  "users": [
    null
  ],
  "keywords": [
    "butter",
    "extra",
    "greasing",
    "shortbread",
    "biscuits",
    "golden",
    "syrup",
    "cherries",
    "stoned",
    "caster",
    "sugar",
    "mediumfat",
    "soft",
    "cheese",
    "cornflour",
    "eggs",
    "vanilla",
    "zest",
    "orange",
    "tub",
    "crme",
    "frache",
    "icing",
    "dusting"
  ],
  "directions": [
    "0",
    "Heat oven to 160C/fan 140C/gas 3. Butter a loose-based 20cm cake tin and line the base with baking parchment. Break up the biscuits, then pulse to fine crumbs in a food processor. Melt the butter with the syrup, then stir into the crumbs until they are evenly damp. Tip into the prepared tin and smooth with the back of a dessertspoon. Bake for 10 mins, then leave to cool. Reduce oven temperature to 150C/fan 130C/gas 2.",
    "Tip the stoned cherries into the rinsed-out food processor with 85g of the sugar. Blend until smooth, then tip into a small pan and bring to the boil. Simmer for 5-6 mins, stirring, until it forms a thick syrup. Cool.",
    "Rinse out the food processor again, then tip in the cheese, cornflour, eggs, remaining sugar, vanilla, orange and half the crème fraîche. Blend until smooth. Spoon half the mix into the tin, then spoon half the cherry purée evenly over the top. Spoon the remaining cheesecake mix over this. Stir the mix gently with a fine skewer to swirl the cherry purée through it. Bake for 45 mins, then turn the oven off and leave for 30 mins.",
    "Spread the remaining crème fraîche over the filling, then spoon the remaining cherry purée into the centre. Using a fine skewer draw the cherry purée through the crème fraîche to make a star pattern, wiping the skewer each time. Set the reserved cherries around the edge of the cheesecake, then dust with icing sugar. Chill until ready to serve."
  ],
  "ingredients": [
    "0",
    "50g butter, plus extra for greasing",
    "140g shortbread biscuits",
    "1 tbsp golden syrup",
    "1",
    "350g cherries, 200g of them stoned",
    "225g caster sugar",
    "500g medium-fat soft cheese",
    "1 tbsp cornflour",
    "2 eggs",
    "1 tsp vanilla extract",
    "zest 1 orange",
    "200ml tub crème fraîche",
    "icing sugar, for dusting"
  ],
  "__v": 1
}