{
  "hash": "12e38e1a85ca7d0c1926d7dd9412179e1004b9a7",
  "title": "Wild Rice and Berries With Popped Rice",
  "image": "https://static01.nyt.com/images/2019/11/06/dining/04NativeAmericanrex8/merlin_163486800_9c930916-1662-4987-bfc3-552bcaebf1c7-articleLarge.jpg",
  "href": "https://cooking.nytimes.com/recipes/1020564-wild-rice-and-berries-with-popped-rice",
  "extension": "Firefox",
  "firstAdded": "2020-03-15T18:55:05.393000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the oven to 350 degrees.",
    "In a large saucepan, bring 5 cups water to a boil over high. Stir in 1 cup wild rice along with the dried berries and maple syrup. Once the mixture comes back to a boil, reduce the heat so the liquid is just simmering, cover and cook until the grains begin to open, 20 to 40 minutes, checking doneness after about 20 minutes. (The rice is done when it has opened slightly, is tender and has quadrupled in size.)",
    "Drain the excess liquid from the rice. (The cloudy cooking liquid tastes sweet and nutty and can be sipped on its own, reserved for use in the roast turkey with berry-mint sauce and black walnuts, or used as a stock substitute.)",
    "Meanwhile, toast the hazelnuts: Heat the oven to 350 degrees. Arrange the hazelnuts in a single layer on a baking sheet and toast them until the skin blisters and cracks, and they begin to smell nutty, 10 to 12 minutes. Transfer the nuts to a clean dish towel and massage them aggressively to remove most of the skins. Crush the nuts directly in the towel using the flat side of a knife or the bottom of a small, heavy frying pan.",
    "Add the remaining 1/4 cup rice to a dry medium skillet and cook the rice over high heat, shaking the pan, until it begins to darken and about half of the kernels have popped, 2 to 3 minutes. Remove from the heat.",
    "Drizzle the boiled rice with the hazelnut oil and season to taste with salt. Divide among bowls and garnish with the popped rice, hazelnuts and chives."
  ],
  "ingredients": [
    "0",
    "1 ¼",
    "cups long-grain wild rice (about 8 ounces), rinsed (see Note)",
    "½",
    "cup mixed dried berries (any combination of cranberries, blueberries or sour cherries)",
    "3",
    "tablespoons maple syrup",
    "¼",
    "cup whole hazelnuts, crushed",
    "2",
    "tablespoons hazelnut oil",
    "Fine sea salt",
    "Whole chive stems (or scallions, thinly sliced on the diagonal), for garnish"
  ],
  "__v": 1
}