{
  "hash": "163c5f57e6bb3a8267bdb9aa3a7dfa7fe0630cdf",
  "title": "Chipotle Quinoa Sweet Potato Tacos with Roasted Cranberry Pomegranate Salsa",
  "image": "http://www.halfbakedharvest.com/wp-content/uploads/2013/11/Chipotle-Quinoa-Sweet-Potato-Tacos-with-Roasted-Cranberry-Pomegranate-Salsa-1.jpg",
  "href": "http://www.halfbakedharvest.com/chipotle-quinoa-sweet-potato-tacos-roasted-cranberry-pomegranate-salsa/",
  "extension": "Chrome",
  "firstAdded": "2016-02-15T23:39:42.218000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "onion",
    "clove",
    "garlic",
    "potato",
    "peel",
    "desired",
    "salt",
    "pepper",
    "used",
    "red",
    "quinoa",
    "tomatoes",
    "normally",
    "leaves",
    "chili",
    "canned",
    "chipotle",
    "chilies",
    "adobo",
    "smoked",
    "paprika",
    "cumin",
    "brown",
    "sugar",
    "cayenne",
    "black",
    "beans",
    "using",
    "drain",
    "rinse",
    "lime",
    "juiced",
    "bunch",
    "cilantro",
    "corn",
    "tortillas",
    "warmed",
    "hard",
    "tacos",
    "personally",
    "family",
    "prefers",
    "hards",
    "shell",
    "good",
    "avocado",
    "sharp",
    "cheddar",
    "cheese",
    "cotija",
    "crumbled",
    "roasted",
    "cranberry",
    "pomegranate",
    "salsa",
    "cranberries",
    "zested",
    "jalapeno",
    "seed",
    "arils",
    "learn",
    "deseed"
  ],
  "directions": [
    "0",
    "Instructions",
    "To make the salsa. Heat oven to 450 degrees F. Lightly grease a baking sheet.Place the cranberries, brown sugar, chipotle chili, lime zest + juice, garlic, jalapeño and a pinch of salt and pepper. Use your hands to toss everything together until the cranberries are evenly coated. Place in the oven and roast until the cranberries burst and release their juices, about 15 minutes. Remove from the oven and and let cool 10 minutes. Then add the pomegranate arils and toss well. Taste and season with more salt and pepper if desired. Set aside and keep at room temperature.Well the cranberries are roasting start the tacos. Heat the olive oil over a large skillet set over medium heat. Add the onions and sweet potatoes and toss to coat. Cover the skillet and let cook until the sweet potatoes are fork tender, but not mushy, stirring once or twice for about 15 minutes. Once the sweet potatoes are fork tender, add the garlic and saute 30 seconds. Then crank up the heat to medium-high (adding more oil if needed) and add the quinoa. Let the quinoa get crispy and cook for about 5 minutes. Add 3/4 cup water, tomatoes (if using), the chili powder, chipotle chilies, adobo sauce, smoked paprika, cumin, brown sugar and cayenne, stir to thoroughly combine and bring the mixture to a boil. Cook for 5-10 minutes or until the water has completely evaporated. Remove from the heat and stir in the black beans, 1/4 cup chopped cilantro and the lime juice. Taste and season with salt and pepper if desired.To assemble the tacos place some of the quinoa in a tortilla or shell. Top with shredded cheddar cheese, avocado, a large dollop the the roasted cranberry salsa, crumbled catija cheese and fresh chopped cilantro. Take in their beauty and then EAT!"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 tablespoons olive oil",
    "1/2 a small sweet onion",
    "1 clove garlic, minced or grated",
    "1 large sweet potato, chopped (peel if desired)",
    "salt and pepper",
    "1 1/2 cups cooked quinoa (I used red quinoa)",
    "1 can diced tomatoes (Optional, I normally leaves these out, but sometimes add them)",
    "2 teaspoons chili powder",
    "2 canned chipotle chilies, minced",
    "1 tablespoon chipotle in adobo (from the chipotle chili can)",
    "1 teaspoon smoked paprika",
    "1 teaspoon cumin",
    "1 teaspoon brown sugar",
    "1 teaspoon cayenne (or to your taste)",
    "1 cup cooked black beans (if using canned drain and rinse them)",
    "1 lime, juiced",
    "1 small bunch cilantro",
    "6-8 four tortillas (warmed), corn tortillas (warmed) or hard shell tacos (personally my family prefers hards shell, but all of them are good!)",
    "1 avocado, sliced or diced, for topping",
    "1 cup shredded sharp cheddar cheese, for topping",
    "cotija cheese, crumbled, for topping",
    "Roasted Cranberry Pomegranate Salsa",
    "12 ounces fresh cranberries",
    "1/4 cup brown sugar",
    "1 canned chipotle chili, chopped",
    "1 lime, zested + juiced",
    "1 clove garlic, minced or grated",
    "1 jalapeno, chopped and seed removed if desired",
    "the arils from 1 pomegranate (learn how to deseed a pomegranate here)",
    "salt and pepper, to taste"
  ],
  "__v": 1
}