{
  "hash": "4cc1850d7e34f994b7f2cb2f991d01bd28cac8da",
  "title": "Taiwanese Beef Noodle Soup: In an Instant Pot or On the Stove",
  "image": "https://thewoksoflife.com/wp-content/uploads/2018/03/taiwanese-beef-noodle-soup-instant-pot-9.jpg",
  "href": "https://thewoksoflife.com/2018/04/taiwanese-beef-noodle-soup-instant-pot/",
  "extension": "Chrome",
  "firstAdded": "2019-01-15T20:53:03.260000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Boil enough water in a pot to boil all of your beef. Once the water is boiling, add the beef. Let it come back up to a boil, and boil for 1 minute. Strain in a colander and rinse thoroughly with fresh water to remove any impurities.",
    "Next, in your instant pot, turn on the saute setting. Add the oil, crushed ginger, garlic, scallions, and onions in that order. Stir to lightly caramelize. Let the onion turn translucent. Add the tomato and dried chilies.",
    "Next, add the meat to the pot. Then add the tomato paste, spicy bean paste, sugar, soy sauce, and Shaoxing wine, and mix thoroughly.",
    "Pour 8 cups of water into the instant pot. Add the spice packet. The instant pot should be filled to the 10-cup line; it shouldn’t be more than ⅔ of the way full per safety instructions. Our instant pot is the largest size (8 quarts); if yours is smaller, you can halve the recipe accordingly.",
    "Close the lid of the instant pot, and make sure you have your vent set so it is not venting. Cook for 100 minutes on the aromatic meat stew setting. If you don’t have an instant pot, you can use a regular pot on the stove, but instead, cook the soup on a low simmer for 3-4 hours.",
    "When the instant pot timer is up, carefully release the pressure valve (wear an oven mitt, so you don’t scald yourself!). Boil some noodles per package instructions, and in the last minute or two of the noodles cooking, throw your bok choy in and blanch until just tender.",
    "Serve each bowl of Taiwanese beef noodle soup with a serving of noodles, a few stalks of bok choy, and generous sprinklings of finely minced cilantro, scallions, and Chinese pickled mustard greens. Pro tip, buy the pre-seasoned spicy mustard greens and you can use them straight out of the package. If you are using the non-spicy version (from a can, for example), chop and saute with a little oil, a few chopped dried red chilies, and a pinch of sugar."
  ],
  "ingredients": [
    "0",
    "3 pounds beef shank, cut into 2-inch chunks",
    "2 tablespoons oil",
    "A 2-inch piece of ginger, smashed",
    "6 cloves garlic, smashed",
    "3 scallions, cut into 2-inch segments",
    "1 onion, cut into wedges",
    "1 tomato, cut into wedges",
    "4 dried chilies, ripped in half",
    "1 tablespoon tomato paste",
    "2 tablespoons spicy bean paste (douban jiang)",
    "2 teaspoons sugar",
    "½ cup soy sauce",
    "½ cup Shaoxing wine",
    "Chinese aromatic herbs packet (lu bao) -- do yourself a favor and hunt down the pre-packaged version; if you can’t access it though, see below for ingredients to create your own spice sachet).",
    "Fresh white noodles",
    "A small handful of bok choy for each serving",
    "Cilantro, finely chopped",
    "Scallions, finely chopped",
    "Pickled mustard greens to taste"
  ],
  "__v": 1
}