{
  "hash": "feedb2989424f57423de94dc7234cd7ba771d391",
  "title": "HOMEMADE ENGLISH MUFFINS",
  "image": "https://www.budgetbytes.com/wp-content/uploads/2010/07/English-Muffins-above-200x200.jpg",
  "href": "https://www.budgetbytes.com/english-muffins/",
  "extension": "",
  "firstAdded": "2020-03-05T20:39:14.754000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Dissolve the yeast and half of the sugar into 1/2 cup warm water in a large bowl, and let it sit for about 5 minutes, or until it has developed a thick foam on top.",
    "While waiting for the yeast, combine the milk, butter, and the rest of the sugar in a measuring cup or microwave safe bowl. Microwave on high for 30 seconds, then stir until the butter is dissolved. Add an additional 10 seconds if needed. You want the milk warm enough to melt the butter, but not scalding.",
    "Once the yeast is foamy, pour the milk and butter mixture into the bowl, along with 1 cup of the flour, and the salt. Stir until the mixture is mostly smooth. Add the second cup of flour, about 1/3 cup at a time, stirring to combine each time. Finally, begin to add the third cup of flour, 1/3 cup at a time, until you can no longer stir it with a spoon. At that point, turn the dough out onto a lightly floured surface and knead for about 5 minutes, dusting with small amounts of flour as you go. Once finished kneading, you should have used 2.5-3 cups flour total.",
    "Let the dough rest for 15 minutes, then roll it out to about 1/2-inch thickness. Use a cookie cutter or sharp edged drinking glass to cut several discs out of the rolled dough. Cut them as close to each other as possible to leave few scraps. When you can cut no more circles, ball the scrap dough up, flatten it once again, and cut a few more. Place the cut muffins on a baking sheet coated with a liberal layer of cornmeal.",
    "Let the muffins rise in a warm moist area for about 1.5 hours, or until they are slightly more than double the size. (I placed a casserole dish full of steaming water on the bottom rack of my oven and placed the baking sheet on the top rack to keep the muffins moist as they rose.)",
    "When the muffins are large and fluffy, it's time to cook them in a skillet. Heat a cast-iron or non-stick skillet over medium low heat. Once the skillet is preheated, carefully use a spatula to lift 3-4 muffins from the baking sheet and slide them into the skillet, along with some cornmeal. Let the muffins cook 3-4 minutes, or until lightly golden brown on the bottom. Carefully flip the muffins and cook for 3-4 minutes on the second side. The muffins will puff further as they cook in the skillet. Once the muffins are golden on both sides and sound hollow when tapped, transfer them to a wire rack to cool.",
    "Once completely cool, split the muffins with a fork and toast in a toaster or the oven. Or, transfer the cooled muffins to an air-tight container and keep in the refrigerator for up to one week, or the freezer for up to three months."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1 tsp active dry yeast ($0.10)",
    "1 Tbsp sugar, divided ($0.05)",
    "1/2 cup warm water ($0.00)",
    "1/2 cup milk ($0.15)",
    "2 Tbsp butter ($0.27)",
    "3 cups all-purpose flour, divided ($0.36)",
    "3/4 tsp salt ($0.05)",
    "1/4 cup cornmeal ($0.06)"
  ],
  "__v": 1
}