{
  "hash": "8d71a4442510dae250baec47158946412597d305",
  "title": "Crock Pot Stuffed Cabbage Rolls",
  "image": "//dsms0mj1bbhn4.cloudfront.net/v2/a32c657207fea4d3f76f757cd0bc629fc3e1916f/images/share-buttons/share-headers-new/share-love-hearts.png",
  "href": "http://sugarapron.com/2016/02/12/crock-pot-stuffed-cabbage-rolls/",
  "extension": "Chrome",
  "firstAdded": "2016-12-28T14:20:24.339000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cut approx 1/4 inch off the bottom of the cabbage head and place the whole head in boiling water.",
    "Boil about 2 minutes. Peel off the softened leaves.",
    "Place remaining head back in the boiling water and repeat until all of the leaves are removed.",
    "Remove any tough stems from cooked leaves.",
    "(You can freeze cabbage then thaw and skip the boiling part. We just need the leaves soft enough to roll)",
    "In a large bowl, combine the ground beef, ground pork, uncooked rice, 1/4 cup water/broth or tomato sauce, garlic powder,pepper, salt, sugar, onion.",
    "Stir in egg and combine well.",
    "Whisk together tomato sauce, tomato soup, paprika and Worcestershire sauce in another bowl.",
    "Use the left over cabbage to cover the bottom of the slow cooker.",
    "Place 1/3 cup meat mixture in center of leaf and roll up like a burrito.",
    "Place cabbage rolls seam side down in slow cooker, in two layers so they are touching but not over crowded either.",
    "Mix all sauce ingredients together and pour over rolls.",
    "Cover and cook on low 7-9 hours, or on high for 4 to 5 hours.",
    "Let cool 15 minutes before serving.",
    "Garnish with chopped fresh parsley, and drizzle with tomato sauce.",
    "* You can cook the rice prior to adding it to the meat mixture,",
    "if desired (just follow the rice manufacturer's directions for cooking),",
    "but raw rice is how my mother made it, and the rice has always cooked through perfectly for me."
  ],
  "ingredients": [
    "0",
    "For the cabbage rolls",
    "12 cabbage leaves + leftover",
    "1 egg, beaten",
    "1/4 cup water, broth or tomato sauce",
    "1?4 cup finely chopped onion",
    "1 tsp. garlic powder",
    "1/4 tsp. black pepper Coupons",
    "1 1/4 tsp. salt",
    "1/2 tsp. sugar",
    "1/2 lb ground beef",
    "1/2 lb ground pork",
    "1 cup uncooked rice",
    "For the sauce (If you like lots of sauce, feel free to double this, I’ve done it both ways)",
    "1 (15 ounce) can tomato sauce",
    "2 teaspoon Worcestershire sauce",
    "1 teaspoon paprika",
    "1 can tomato soup"
  ],
  "__v": 1
}