{
  "hash": "5ccf8359b1e37aec6f779d5bb9a8b16cc685119f",
  "title": "warm, crisp and a little melty salad croutons",
  "image": "http://farm8.staticflickr.com/7230/7175889196_bf928c07bd.jpg",
  "href": "http://smittenkitchen.com/blog/2012/05/warm-crisp-and-a-little-melty-salad-croutons/",
  "extension": "Chrome",
  "firstAdded": "2016-01-21T09:20:42.542000",
  "users": [
    null
  ],
  "keywords": [
    "makes",
    "croutons",
    "goat",
    "milk",
    "gouda",
    "coarsely",
    "cheese",
    "softened",
    "allpurpose",
    "flour",
    "egg",
    "panko",
    "breadcrumbs",
    "coarse",
    "salt",
    "olive",
    "oil",
    "frying",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "Mash together cheeses in a bowl, mixing until combined. Form the mixture into four balls then smoosh each slightly into thick patties. Arrange three small dishes for dredging stations: Place the flour in the first one, beat the egg lightly in the second, and mix the breadcrumbs and salt in the last one. Heat a healthy slick of olive oil (the original recipe suggested 3 tablespoons; in a tiny skillet, I used closer to 2) in a small skillet over medium heat. Once hot, fry each patty until golden and crispy, about two minutes per side. It’s going to get melty (I’m not sorry) and seem pesky to flip once warm. I found using two forks made this easy-peasy. Briefly pause the crouton on paper towels to drain excess oil, before landing it on top of your salad of choice, then finish the whole thing with freshly ground black pepper. Repeat with remaining croutons. Eat at once.",
    "* Gouda, a Dutch cheese, is traditionally made with cow’s milk. You can buy it young (smooth, semi-firm and mild flavored), or aged (harder, darker, stronger-flavored with crunchy flecks), smoked, light, and even more ways. However, if you can find the goat milk gouda suggested here, perfect for goat cheese-phobes, it’s really amazing in these croutons, absolutely worth swinging by a cheese shop or grocery store with a great cheese counter for. (It’s also sold online from a variety of stores.) If you cannot get it, you could replace the gouda with another semi-firm cheese good for grating and melting, like a young cow’s milk gouda, gruyere, etc.",
    "** If you can’t find or don’t want to buy Panko, here’s how I fake it: Preheat oven to 350 degrees. Tear one to two slices of soft, crustless white bread into 1-inch pieces and pulse them in the food processor until coarsely ground. This will make a generous half cup. Transfer crumbs to a rimmed baking sheet and bake until just barely golden brown and dry, about 15 minutes, stirring occasionally. Cool. Use."
  ],
  "ingredients": [
    "0",
    "Makes 4 croutons",
    "4 ounces goat milk Gouda, coarsely grated*",
    "4 ounces fresh goat cheese, softened",
    "1 tablespoon all-purpose flour",
    "1 large egg",
    "1/4 cup Panko** breadcrumbs",
    "1/2 teaspoon coarse or sea salt",
    "Olive oil, for frying",
    "Freshly ground black pepper"
  ],
  "__v": 1
}