{
  "hash": "4a60afe29c3349c7b1d421e88702700579938ec4",
  "title": "Vegetarian Bahn Mi",
  "image": "",
  "href": "http://recipe-folder.com/recipe/5ad3f3eed8abf907d8c38fc7",
  "extension": "User Added",
  "firstAdded": "2018-04-16T00:53:02.221000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "At least one day before you plan to make the sandwiches, cut the tofu into ½- to ¾-inch slices and cut each slice into 1- to 2-inch triangles or rectangles. Freeze the tofu overnight, then thaw it in the refrigerator.",
    "1",
    "Combine the carrot, 2 tablespoons of the vinegar, 1 tablespoon of the sugar, and a large pinch of salt in a medium bowl; cover and refrigerate while you prepare the other ingredients. Whisk together the butter or mayonnaise and the Sriracha in a small bowl.",
    "2",
    "Put the remaining ⅓ cup sugar and 1 tablespoon water in a large skillet over medium-low heat. Cook, shaking and swirling the pan occasionally (but not stirring), until the sugar is mostly melted and golden brown, about 10 minutes. Slowly drizzle in the soy sauce or fish sauce, then add the onion. Cook, stirring often, until the onion is tender, 8 to 10 minutes. Add the thawed tofu and the black pepper and cook, turning the tofu occasionally, until it has absorbed most of the sauce, about 15 minutes. Stir in the remaining 1 tablespoon rice vinegar and remove from the heat.",
    "3",
    "Drain the carrot mixture. Split the baguette horizontally with a bread knife. Remove and discard some of the soft inner part of the bread to make more room for the fillings. Spread the butter or mayonnaise mixture on the bottom half of the baguette, and top with the tofu mixture, the carrot mixture, the cilantro, the cucumber, and the jalapeños. Close the sandwich with the top half of the baguette, cut it into 2 or 3 equal lengths, and serve immediately."
  ],
  "ingredients": [
    "0",
    "Tofu Bánh Mì",
    "1",
    "Yield: 2 or 3 servings",
    "2",
    "Time: About 1 hour, plus time to freeze and thaw the tofu",
    "3",
    "One 14-ounce package extra-firm tofu, drained and patted dry",
    "4",
    "1 large carrot, peeled and shredded",
    "5",
    "3 tablespoons rice vinegar",
    "6",
    "1 tablespoon plus ⅓ cup sugar",
    "7",
    "Salt",
    "8",
    "¼ cup butter, at room temperature, or mayonnaise",
    "9",
    "1 tablespoon Sriracha sauce",
    "10",
    "⅓ cup soy sauce or fish sauce",
    "11",
    "1 medium yellow onion, thinly sliced",
    "12",
    "1½ teaspoons black pepper",
    "13",
    "One 18-inch baguette",
    "14",
    "1 cup fresh cilantro leaves",
    "15",
    "½ small cucumber, cut into ½- by 2-inch strips",
    "16",
    "2 medium fresh jalapeños, seeded and cut into thin lengthwise strips"
  ],
  "__v": 1,
  "hidden": true
}