{
  "__v": 1,
  "directions": [
    "0",
    "Add pumpkin puree to a large saucepan along with the cinnamon, salt, nutmeg and ground cloves. Heat over medium heat until mixture measures 1 1/2 cups; about 6 minutes. Measure and add back to the saucepan. Stir in the sugar, brown sugar, cream cheese and vegetable oil. Heat until cream cheese is melted. Whisk until smooth. In a separate dish, whisk together the buttermilk and eggs. Slowly add mixture into to the pumpkin puree, whisking constantly. Remove from heat. Combine the flour, baking powder and baking soda and fold into wet mixture. Allow to cool for a few minutes while you make the streusel.",
    "For the streusel: combine all ingredients and using your clean hands, work the butter into the other ingredients until it resembles coarse sand.",
    "Quickly stir the chocolate chips into the slightly cooled pumpkin mixture. They will begin to melt, so stir quickly. Divide batter between two, well greased, 9x5-inch loaf pans. Sprinkle streusel topping evenly over loaves. Bake at 350 degrees for 50 minutes or until a toothpick inserted in the center comes out with a few moist crumbs. Cool in pan 20 minutes, remove and cool completely. Yield: 2 loaves."
  ],
  "firstAdded": "2014-06-28T17:01:13.836000",
  "hash": "637e1e946f0e865080038ce64ec6409763bef41d",
  "href": "http://www.eatcakefordinner.net/2013/06/cream-cheese-pumpkin-bread.html",
  "image": "",
  "ingredients": [
    "0",
    "1 (15 oz.) can pumpkin puree",
    "1 1/2 tsp. cinnamon",
    "1 tsp. salt",
    "1/4 tsp. ground nutmeg",
    "1/8 tsp. ground clove",
    "1 c. sugar",
    "1 c. light brown sugar",
    "4 oz. cream cheese",
    "1/2 c. vegetable oil",
    "1/4 c. buttermilk",
    "4 large eggs",
    "2 c. all-purpose flour",
    "1/2 tsp. baking powder",
    "1/2 tsp. baking soda",
    "1 c. mini semisweet chocolate chips",
    "Streusel",
    "5 Tbl. light brown sugar",
    "1 Tbl. all-purpose flour",
    "1 Tbl. unsalted butter",
    "1 tsp. cinnamon",
    "1/8 tsp. salt"
  ],
  "keywords": [
    "pumpkin",
    "puree",
    "cinnamon",
    "salt",
    "nutmeg",
    "clove",
    "sugar",
    "light",
    "brown",
    "cream",
    "cheese",
    "oil",
    "buttermilk",
    "eggs",
    "allpurpose",
    "flour",
    "baking",
    "soda",
    "mini",
    "semisweet",
    "chocolate",
    "chips",
    "streusel",
    "tbl",
    "unsalted",
    "butter"
  ],
  "title": "Cream Cheese Pumpkin Bread",
  "users": [
    null
  ]
}