{
  "hash": "f3be6debe20eb467e04e0c1a6ee2a5433803441d",
  "title": "No-Bake Lemon Cheesecake",
  "image": "https://www.spendwithpennies.com/wp-content/uploads/2017/06/No-Bake-Lemon-Cheesecake-Spend-with-Pennies-1-of-1-4.jpg",
  "href": "https://www.spendwithpennies.com/no-bake-lemon-cheesecake/",
  "extension": "Firefox",
  "firstAdded": "2017-12-20T02:03:47.919000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Crust",
    "Combine graham cracker crumbs and sugars in a medium-sized bowl. Add melted butter and use a fork to combine ingredients well.",
    "Pour mixture into a 9″ or 10″ springform pan. Use the (clean!) bottom of a measuring cup to firmly pack crumbs into the bottom of the pan and gently press up the sides. Use your fingers to pack crumbs tightly into the sides of the pan.",
    "Place in refrigerator or freezer while you prepare cheesecake filling.",
    "No-Bake Lemon Cheesecake",
    "Pour Lemon Jello gelatin mix into 1 cup very hot water and stir well. Set aside to cool.",
    "Meanwhile, stir cream cheese and powdered sugar together until smooth and well-combined.",
    "Add sour cream and stir well.",
    "Mix in vanilla extract.",
    "Only once jello mixture is no longer hot to the touch, gradually pour into cream cheese mixture. Stir slowly at first (to avoid splashing) and then increase speed until mixture is completely combined (pause to scrape down sides of the bowl periodically). Stir very well.",
    "In a separate bowl, pour your heavy cream and use an electric mixer with whisk attachment to beat to stiff peaks.",
    "Fold whipped cream into cheesecake mixture until well-combined.",
    "Fold in lemon zest, if using.",
    "Pour over graham cracker crust and transfer to refrigerator for at least 6 hours or overnight to chill.",
    "If desired, top with whipped cream before cutting and serving.",
    "ALTERNATIVE",
    "Instructions",
    "In a medium mixing bowl, mix the jello, and lemon juice with the hot water. Stir until dissolved, then add the cold water. Set the bowl in the fridge until the jello is completely cooled, but not set.",
    "In a separate mixing bowl, beat the cream cheese with the sugar and vanilla until smooth. Slowly add the chilled jello mix, while beating everything together. Once smooth, set in the fridge again, until the mixture begins to thicken- about 1 hour.",
    "Prepare the graham cracker crust by mixing the crumbs with the melted butter and then press it into a large springform pan, minimum of 10 inches. Set in freezer until ready for the crust.",
    "Fold the cool whip into the cream cheese and jello mixture with a rubber scraper. Gently mix until the mixture is smooth and the cool whip is evenly distributed.",
    "Pour the cheesecake mixture into the crust. Let it set in the fridge for at least 6 hours, overnight is best. Do not cover with plastic wrap until the cheesecake is set.",
    "Serve chilled, top each slice with the optional whipped cream and lemon wedge. Keep the cheesecake chilled."
  ],
  "ingredients": [
    "0",
    "Graham Cracker Crust",
    "1 1/2 cups Graham cracker crumbs",
    "3 tablespoons sugar",
    "7 tablespoons butter, melted",
    "Cheesecake",
    "1 package lemon Jell-O (3 oz)",
    "16 oz cream cheese, softened",
    "1 cup powdered sugar",
    "1 teaspoon vanilla extract",
    "2 tablespoons sour cream",
    "1 1/2 cups heavy cream*",
    "1 tablespoon freshly grated lemon zest",
    "ALTERNATIVE",
    "1, 6-ounce box of lemon jello mix (gelatin, NOT pudding)",
    "juice from 1/2 a lemon",
    "1 1/2 cups boiling water",
    "1 1/2 cups cold water",
    "1 cup sugar",
    "2, 8-ounce pkgs cream cheese",
    "1 tsp vanilla",
    "1, 8-ounce container of cool whip",
    "2 cups graham cracker crumbs",
    "1/2 cup butter- melted",
    "extra whipped cream and lemon slices/ wedges optional for garnish"
  ],
  "__v": 3
}