{
  "hash": "044fe4b4d179489c3e17fc68fe45929a8eebc44c",
  "title": "CHOCOLATE HAZELNUT MOUSSE CAKE",
  "image": "http://www.recipegirl.com/wp-content/uploads/2017/02/Chocolate-Hazelnut-Mousse-Cake-RG-4-600x900.jpg",
  "href": "http://www.recipegirl.com/2017/02/11/chocolate-hazelnut-mousse-cake/",
  "extension": "Chrome",
  "firstAdded": "2017-02-12T22:04:47.372000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS:",
    "TO MAKE THE SHORTBREAD CRUST:",
    "Preheat oven to 350 degrees. Invert the bottom of the springform pan (to make it easier to slide the shortbread base off the bottom) then lock on the sides of the pan. Line the bottom with a round of parchment paper.",
    "Place the hazelnuts and granulated sugar in the bowl of a food processor. Pulse until the nuts are finely chopped. Add the flour, butter, cocoa and salt and pulse to form a cohesive dough.",
    "Press the dough evenly onto the bottom of the prepared springform pan. Using a fork, prick the base all over and then bake just until it is just dry to the touch, about 18 to 20 minutes. Cool completely on a wire rack. Remove the sides of the pan and carefully remove the parchment from under the shortbread. Reattach the sides of the pan around the shortbread base. Set aside.",
    "WHILE THE CRUST IS BAKING AND COOLING, PREPARE THE MOUSSE:",
    "Place the water in a small, heavy-bottom saucepan then sprinkle with the gelatin. Set aside until the gelatin is softened, about 5 minutes. Heat the softened gelatin over low heat and stir just until melted. Add the chocolate hazelnut spread and espresso powder and whisk until combined. Remove the pan from the heat source and transfer the mixture to a large mixing bowl. Add the mascarpone cheese and vanilla to the hazelnut mixture and whisk until combined.",
    "In the bowl of a stand mixer fitted with the whisk attachment, beat together 1 1/2 cups of heavy whipping cream, 2 tablespoons cocoa powder and 3 tablespoons sugar on low speed just until combined. Increase speed to high and beat until the cream holds soft peaks. Whisk one third of the whipped cream into the mascarpone mixture. Using a rubber spatula, fold in the remaining whipped cream until blended. Spoon the filling into the springform pan on top of the shortbread crust. Using an offset spatula, smooth the top, cover and refrigerate at least 3 hours.",
    "TO PREPARE THE GANACHE:",
    "In a small saucepan, bring the heavy cream to a simmer over medium heat. Remove from the heat source and add the chopped bittersweet chocolate. Allow the mixture to set for 2-3 minutes, then lightly whisk until the chocolate is completely melted. Set aside to cool until cooled, but still pourable and slightly thickened.",
    "To assemble, run a thin warm knife around the inside of the springform pan. Remove the sides and carefully slide the cake onto a serving plate or cake stand. Pour the ganache onto the top of the cake and gently spread it to the edges, allowing a little ganache to drip decoratively down the sides. Garnish with chopped hazelnuts if desired.",
    "The covered cake can be refrigerated for up to 2 days before adding the ganache glaze.",
    "To cut the cake, warm a large, thin knife under hot running water. Dry the knife then gently cut each piece, wiping the knife clean between cuts.",
    "You will need an 8\" springform pan to prepare this recipe.",
    "The total time does not include refrigeration."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS:",
    "FOR THE SHORTBREAD CRUST:",
    "1/4 cup hazelnuts, skins rubbed off - about 34 hazelnuts",
    "2 tablespoons granulated white sugar",
    "1/2 cup all-purpose flour",
    "1/4 cup unsalted butter, room temperature",
    "2 tablespoons Dutch-process cocoa powder",
    "pinch of salt",
    "FOR THE MOUSSE:",
    "1 teaspoon unflavored gelatin",
    "3 tablespoons cold water",
    "1/2 cup Nutella Hazelnut Spread",
    "1/4 teaspoon espresso powder",
    "1/2 cup mascarpone cheese, room temperature",
    "1 teaspoon vanilla extract",
    "1 1/2 cups heavy whipping cream",
    "2 tablespoons Dutch-process cocoa powder",
    "3 tablespoons granulated sugar",
    "FOR THE GANACHE:",
    "1/3 cup heavy whipping cream",
    "4 ounces bittersweet chocolate, chopped",
    "1/4 cup toasted chopped hazelnuts for garnish"
  ],
  "__v": 1
}