{
  "__v": 1,
  "directions": [
    "0",
    "Allow rinsed and drained nuts and seeds to air dry for at least two hours. (Or soak and dry them in advance.)",
    "Soak the chia seeds in just enough pure water to cover them for 20 minutes. This will become a thick gel.",
    "Roughly chop the figs and soak them in just enough pure water to cover for 20 minutes.",
    "Transfer the figs and their soaking water to a blender or Vitamix and process into a loose paste.",
    "Using a food processor with an S-blade, grind almonds, Brazil nuts and walnuts or pecans into a fine meal. (Note: for a chunkier texture, chop just the walnuts or pecans by hand, and add them with the flaxseed meal and berries, Step 7.)",
    "Add the sesame seeds, pumpkin seeds, sunflower seeds, dulse and cinnamon and pulse briefly. Do not overprocess; the mixture should have bits of seeds visible.",
    "Transfer the mixture to a large bowl.",
    "One at a time, stir in the fig paste, chia seed gel, flaxseed meal, berries, cacao nibs, and coconut flakes (if using).",
    "Stir in the honey or date paste, mixing until evenly incorporated.",
    "If not dehydrating, spread the mixture evenly out on a large jelly roll pan, and carefully score into bars.",
    "Dehydrating the bars is optional, but they hold together better and last longer if you do. To dehydrate them, spread the mixture evenly on each of 2-3 dehydrator trays lined with wax paper or non-stick sheets. Using a spatula, carefully score each tray into bars.",
    "Place an empty, unlined tray on top of your bars, flip the tray over, transferring the bars to the new tray, and carefully peel away the non-stick sheet. This will allow complete airflow during dehydration.",
    "Dehydrate at 105 degrees for 18-24 hours.",
    "Stored in a sealed container in the refrigerator, dehydrated bars will keep for up to 2 months. If not dehydrated, they will keep for about 2 weeks.",
    "Enjoy 1 or 2 anytime you need some energy or can’t eat a good meal."
  ],
  "firstAdded": "2014-05-28T21:16:07.086000",
  "hash": "d5c082e28714ad028936af4fbd1e16fc993303a5",
  "href": "http://www.smallfootprintfamily.com/raw-power-energy-bar-recipe/",
  "image": "http://www.smallfootprintfamily.com/wp-content/uploads/2009/06/rawpower.jpg",
  "ingredients": [
    "0",
    "3 cups chopped, fresh organic figs",
    "2 cups purified water",
    "1 cup raw almonds, soaked for 8 hours, rinsed and drained",
    "1 cup raw Brazil nuts, soaked for 8 hours, rinsed and drained",
    "1 cup raw walnuts or pecans, soaked for 3 hours, rinsed and drained",
    "3 cups raw sesame seeds, soaked for 3 hours, rinsed and drained",
    "1 cup raw pumpkin seeds, soaked for 3 hours, rinsed and drained",
    "1/2 cups raw sunflower seeds, soaked for 3 hours, rinsed and drained",
    "1/4 cup chia seeds",
    "1/4 cup dulse flakes",
    "1 1/2 cups ground flaxseeds or flaxseed meal",
    "1 cup dried goji berries, blueberries or raisins (if too dry, soak in a little purified water to plump them a bit)",
    "2 Tbsps. organic cinnamon",
    "1/3-1/2 cup raw honey or date paste, to taste",
    "1/4 cup raw cacao nibs (optional)",
    "1/2 cup dried, shredded coconut (optional)"
  ],
  "keywords": [
    "organic",
    "figs",
    "purified",
    "water",
    "raw",
    "almonds",
    "soaked",
    "hours",
    "rinsed",
    "brazil",
    "nuts",
    "walnuts",
    "pecans",
    "sesame",
    "seeds",
    "pumpkin",
    "sunflower",
    "chia",
    "dulse",
    "flaxseeds",
    "flaxseed",
    "meal",
    "goji",
    "berries",
    "blueberries",
    "raisins",
    "dry",
    "plump",
    "bit",
    "tbsps",
    "cinnamon",
    "honey",
    "date",
    "cacao",
    "nibs",
    "coconut"
  ],
  "title": "Raw Power Energy Bars",
  "users": [
    null
  ]
}