{
  "hash": "8907e982bfe15b554589de63edbd7558008a8e8d",
  "title": "Κουλουράκια πίτσας",
  "image": "http://3.bp.blogspot.com/-igo6CGn98Xw/VV2O7ncFEoI/AAAAAAAAIVg/mjT6rITJrDw/s640/IMG_5719.jpg",
  "href": "http://www.stroumfaki.org/2015/06/blog-post_108.html",
  "extension": "Chrome",
  "firstAdded": "2016-01-11T20:57:33.131000",
  "users": [
    null
  ],
  "keywords": [],
  "directions": [
    "0",
    "Σε ένα μπωλ βάζουμε το νερό, τη ζάχαρη, τη μαγιά και ανακατέψτε με ένα κουτάλι για να λιώσει καλά.",
    "Στο μπολ του μιξερ μεταφέρουμε το μειγμα μαγιάς τοποθετούμε το γάντζο, ρίχνουμε το κοσκινισμένο αλεύρι το λάδι και προσθέσετε λίγο-λίγο το νερό. Ανακατέψτε το μείγμα σε χαμηλή ταχύτητα για λίγα λεπτά.",
    "Προσθέστε το αλάτι και ανακατεύουμε σε μέτρια ταχύτητα για περίπου 8 λεπτά. Η ζύμη πρέπει να είναι καλά αναμεμειγμένη .",
    "Μεταφέρετε τη ζύμη σε αλευρωμένη επιφάνεια εργασίας, ζυμώνουμε λίγο για να σχηματιστεί μια μπάλα, βάζουμε σε ένα μπολ που καλύπτεται με πλαστική μεμβράνη και αφήνετε να φουσκώσει σε ζεστό μέρος για λιγότερο από δύο ώρες (πρέπει να διπλασιάσει τον όγκο).",
    "Μετά το διάστημα αυτό, ανοίγουμε τη ζύμη με τον πλάστη σε ορθογώνιο φύλλο .Σε κάθε ορθογώνιο βάλτε την γέμιση της αρεσκείας σας αλείψτε ελαφρά με νερό την ακρη κλεισίματος για καλύτερη στεγανοποίηση .",
    "Τοποθετείστε τα ψωμάκια σε λαμαρίνα στρωμένη με λαδόκολλα και αφήστε να αυξηθούν και πάλι για περίπου 30 λεπτά. εάν είναι επιθυμητό, ​​αλείψτε με σάλτσα ντομάτας και πασπαλίζουμε με ρίγανη.",
    "Ψήνουμε σε προθερμασμένο φούρνο στους 180 ° C για 20 λεπτά περίπου (ανάλογα με το φούρνο) θα πρέπει να ροδίσει.",
    "Δοκιμάστε τα κουλουρια πίτσας ζεστά."
  ],
  "ingredients": [
    "0",
    "250 γρ αλεύρι για όλες τις χρήσεις",
    "250 γρ αλεύρι δυνατό",
    "25 γρ νωπή μαγιά",
    "35 γρ ζάχαρη",
    "220/250 ml νερού",
    "60 ml ελαιόλαδο",
    "15 γρ αλάτι...",
    "Για την γέμιση :",
    "καπνιστό τυρί,",
    "μοτσαρέλα ,",
    "σαλάμι,",
    "σάλτσα ντομάτας"
  ],
  "__v": 1
}