{
  "hash": "a843caeb54aefbca95ce67e0cee1e19744f220ff",
  "title": "Цукаты из апельсиновых",
  "image": "",
  "href": "http://www.orangekitchen.ru/cukaty-iz-apelsinovyx-korok-bystro/",
  "extension": "Chrome",
  "firstAdded": "2016-01-15T13:03:56.240000",
  "users": [
    null
  ],
  "keywords": [],
  "directions": [
    "0",
    "Очищаем апельсины от корок, которые, собственно, солируют сегодня. Ну а из мякоти апельсинов можно приготовить пряный напиток, чтоб не пропала зря:)",
    "Апельсиновые корки закидываем в кастрюлю, туда же наливаем 2,5 литра холодной воды.",
    "Доводим воду до кипения, варим корки в течение 10 минут, после чего откидываем их на дуршлаг и ставим под холодную воду.",
    "Повторяем все сначала. Заливаем кожуру 2,5 л. холодной воды. ВНИМАНИЕ: на этот раз добавляем в воду чайную ложку соли, ибо соль помогает удалить лишнюю горечь. Потом доводим до кипения, варим, сливаем, ставим под холодную воду.",
    "В третий раз закинул он невод делаем тоже самое: кастрюля, шкурки, вода, соль, кипение, варка 10 минут, промывание холодной водой — ВСЕ!",
    "Теперь даем воде стечь и нарезаем наши апельсиновые корки на полоски шириной в полсантиметра.",
    "В кастрюле растворяем два стакана сахара в стакане горячей воды, позволяем сахарному сиропу закипеть и опускаем в него цитрусовые полосочки.",
    "Будем варить! Варить придется долго от 40 минут до часа, пока сироп не уварится почти полностью. Ближе к концу варки не забываем выжать в сироп лимонный сок. А когда шкурки станут почти прозрачными, а сиропа останется совсем немного, мы в последний раз откинем цукаты на дуршлаг — пусть стекут излишки.",
    "Кстати, сироп после варки апельсиновых цукатов получается вкуснейший, по консистенции и цвету он напоминает мед, а значит может послужить заменой последнему, мотайте на ус, дорогие мои веганы! Например, блины из тыквы с апельсиновым сиропом — просто объедение.",
    "Освобожденные от сиропа цукаты раскладываем на противне, застеленным бумагой для выпечки. Можно поставить противень около батареи для ускорения процесса, а можно не париться: цукаты из апельсиновых корок и без дополнительного обогрева хорошо подсыхают."
  ],
  "ingredients": [
    "0",
    "потребуется:",
    "корки от 5 апельсинов;",
    "2 стакана сахара;",
    "2 ч.л. соли;",
    "сок одного лимона;",
    "литров десять воды;",
    "немного сахарной пудры."
  ],
  "__v": 1
}