{
  "hash": "74567ebc2913ca7281e618650b1dd27c93e7e0ac",
  "title": "Baked Jalapeño Poppers",
  "image": "https://cookieandkate.com/images/2018/09/baked-jalapeno-poppers-recipe-1.jpg",
  "href": "https://cookieandkate.com/2018/baked-jalapeno-poppers-recipe/",
  "extension": "Firefox",
  "firstAdded": "2018-09-30T17:37:43.752000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 425 degrees Fahrenheit and line a large, rimmed baking sheet with parchment paper for easy clean-up. Cut off one-third of each pepper lengthwise (see photos). Use a small spoon (a serrated grapefruit spoon works great) to scoop out the seeds and membranes from each pepper, and discard those pieces.",
    "In a bowl, combine the cream cheese, ¼ cup chopped cilantro and green onion, garlic powder, onion powder and salt. Stir to combine.",
    "Stuff the peppers with the cream cheese mixture (you might have a small amount left over). Top each of the peppers with a small mound of cheese lengthwise.",
    "Bake for 10 to 13 minutes, until the cheese is bubbling and starting to turn golden.",
    "Meanwhile, place a big handful of chips in a food processor and process until the chips are broken into tiny pieces (or, you can crush them under a rolling pin). Stir the feta, if using, and the remaining 1 tablespoon of cilantro and green onion into the chips.",
    "Transfer the jalapeño poppers to a large serving dish and top each pepper with the crushed chip mixture. Serve!"
  ],
  "ingredients": [
    "0",
    "12 large jalapeño peppers",
    "8 ounces cream cheese, at room temperature",
    "¼ cup chopped fresh cilantro, plus 1 tablespoon for garnish",
    "¼ cup chopped green onion, plus 1 tablespoon for garnish",
    "¼ teaspoon garlic powder",
    "¼ teaspoon onion powder",
    "¼ teaspoon fine sea salt",
    "⅓ cup grated sharp cheddar cheese",
    "2 tablespoons crumbled feta cheese, optional",
    "1 big handful Kettle Brand Country Style Barbecue potato chips"
  ],
  "__v": 1
}