{
  "hash": "2680292e4dbce131f6a44903df5ad8f96a3625a0",
  "title": "Vegan French Toast with Caramelized Bananas",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2016/12/2017-01-01-BlenderGirlRecipes-2.jpg",
  "href": "https://www.simplyrecipes.com/recipes/french_toast_with_caramelized_bananas_vegan_and_gluten_free/",
  "extension": "",
  "firstAdded": "2018-01-27T22:47:23.367000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Set the oven to its lowest temperature or the “warm” setting.",
    "2 Make the French toast batter: Combine the milk, banana, maple syrup, vanilla, chia seeds, cinnamon, and salt into your blender and blast on high for about 30 seconds, until well combined. Pour the mixture into a large shallow baking dish and let rest for about 5 minutes to thicken slightly.",
    "3 Soak the bread in the batter: In batches, place slices of the bread in the baking dish and let soak on one side for 8 to 10 seconds. Flip the slices and let soak for another 8 to 10 seconds, until evenly moistened.",
    "4 Cook the French toast: In a medium skillet (that fits two slices of bread) or on a large griddle (that holds all of the slices) over medium heat, warm 1 to 2 tablespoons of coconut oil per two slices of bread. (Resist the urge to use less coconut oil, or the bread won’t get crispy.)",
    "Add the bread and fry for 4 to 6 minutes on each side, until golden brown and crispy on the edges; you may need to add more coconut oil after you flip the bread. If cooking in batches, transfer the French toast to a lined baking sheet and place in the oven to keep warm, and repeat to fry the remaining bread, adding more coconut oil to cook each batch.",
    "5 While the last pieces of toast are cooking, make the caramelized bananas. Combine the banana slices and the coconut sugar in a zipper-lock bag, seal, and shake to coat evenly. In a skillet over medium-high heat, warm the coconut oil, add the coated bananas and the bourbon booster (if using), and fry for about 2 minutes on each side until nicely caramelized.",
    "6 To serve: Serve two slices of French toast on each plate, topped with one-quarter of the caramelized bananas, one-quarter of the crushed nut boosters, and one-quarter of the coconut booster. Pass maple syrup at the table."
  ],
  "ingredients": [
    "0",
    "1 cup (240ml) unsweetened almond or macadamia milk (strained if homemade)",
    "1 ripe medium banana",
    "2 tablespoons pure maple syrup, plus more to serve",
    "1 teaspoon natural vanilla extract",
    "1 tablespoon white (or black) chia seeds",
    "1 teaspoon ground cinnamon",
    "1⁄4 teaspoon natural salt",
    "8 slices gluten-free sandwich bread",
    "1⁄4 cup (60ml) coconut oil (in liquid form), plus more as needed",
    "2 medium bananas, thickly sliced on the diagonal",
    "1⁄4 cup (37g) coconut sugar",
    "1 to 2 tablespoons coconut oil (in liquid form)",
    "Pure maple syrup, to serve",
    "1⁄4 cup (60ml) bourbon or rum",
    "2 tablespoons crushed raw pecans or walnuts",
    "1 tablespoon unsweetened dried shredded coconut"
  ],
  "__v": 1
}