{
  "hash": "2ef5819ed62191064e8319069a4efff0a0548285",
  "title": "Trenette with Eggplant and Basil Pesto",
  "image": "",
  "href": "https://www.foodnetwork.com/recipes/giada-de-laurentiis/trenette-with-eggplant-and-basil-pesto-recipe-1949836",
  "extension": "Chrome",
  "firstAdded": "2019-01-04T17:41:24.169000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the pesto: In a blender or food processor, pulse the basil, pine nuts, garlic, 1/2 teaspoon salt, and 1/4 teaspoon pepper until finely chopped. With the machine running, gradually add the oil until the mixture is smooth and thick. Add the cheese and pulse until just incorporated. Season with salt and pepper, to taste. Set aside.",
    "For the pasta: Bring a large pot of salted water to a boil over high heat. Add the pasta and cook until tender but still firm to the bite, stirring occasionally, about 8 to 10 minutes. Drain and reserve about 1 cup of the pasta water. Put the pasta into a large serving bowl and add 1/2 cup of the Parmesan. Toss until coated.",
    "In a large, nonstick skillet, heat the oil over medium-high heat. Add the eggplant and season with salt and pepper, to taste. Cook, stirring frequently, until the eggplant turns golden brown, about 8 minutes. Remove the pan from the heat and cool slightly. Add the pesto and toss until the eggplant is coated.",
    "Add the eggplant mixture to the serving bowl with the pasta and toss until all of the ingredients are coated. Thin out the sauce with a little pasta water, if needed. Season with salt and pepper, to taste. Sprinkle with the remaining cheese and serve.",
    "Cook's Note: To toast the pine nuts, arrange them in a single layer on a baking sheet. Bake in a preheated 350 degree F oven until lightly toasted, about 5 to 6 minutes. Cool completely before using."
  ],
  "ingredients": [
    "0",
    "Pesto:",
    "2 packed cups fresh basil leaves",
    "1/4 cup toasted pine nuts (see Cook's Note)",
    "1 clove garlic",
    "1/2 teaspoon kosher salt, plus extra for seasoning",
    "1/4 teaspoon freshly ground black pepper, plus extra for seasoning",
    "2/3 cup extra-virgin olive oil",
    "1/2 cup (1 1/2 ounces) grated Parmesan",
    "Pasta:",
    "1 pound trenette or other short-cut pasta",
    "1/2 cup (1 1/2 ounces) grated Parmesan, plus 1/2 cup",
    "1/4 cup extra-virgin olive oil",
    "1 (1 1/2 pounds) medium eggplant, cut into 1/2-inch cubes",
    "Kosher salt and freshly ground black pepper"
  ],
  "__v": 1
}