{
  "hash": "720a12a647e85ab0eab038c23b76889db6bdbb54",
  "title": "Garlic Butter Fettuccine with Chicken and Zucchini",
  "image": "http://damndelicious.net/wp-content/uploads/2015/07/IMG_1332edit.jpg",
  "href": "http://damndelicious.net/2015/07/11/garlic-butter-fettuccine-with-chicken-and-zucchini/",
  "extension": "Chrome",
  "firstAdded": "2016-06-02T17:49:20.740000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large pot of boiling salted water, cook pasta according to package instructions; drain well.",
    "Season chicken with Italian seasoning; season with salt and pepper, to taste.",
    "Heat 1 tablespoon olive oil in a grill pan over medium high heat. Add chicken and cook, flipping once, until cooked through, about 5-6 minutes on each side; add lemon juice. Set aside and keep warm.",
    "Add remaining 1 tablespoon olive oil to the grill pan. Add zucchini and squash in a single layer and cook until charred on both sides and just beginning to soften, about 2 minutes per side; season with salt and pepper, to taste. Set aside and keep warm.",
    "Melt butter in a saucepan over medium heat. Add garlic, and cook, stirring frequently, until fragrant, about 1-2 minutes.",
    "Gradually whisk in heavy cream, basil, oregano and red pepper flakes. Cook, whisking constantly, until incorporated, about 1-2 minutes. Stir in Parmesan until slightly thickened, about 1-2 minutes. If the mixture is too thick, add more heavy cream as needed; season with salt and pepper, to taste.",
    "Stir in pasta and gently toss to combine.",
    "Serve immediately with chicken and zucchini, garnished with parsley, if desired."
  ],
  "ingredients": [
    "0",
    "8 ounces fettuccine",
    "2 boneless, skinless chicken breasts",
    "1 tablespoon Italian seasoning",
    "Kosher salt and freshly ground black pepper, to taste",
    "2 tablespoons olive oil, divided",
    "Juice of 1 lemon",
    "2 zucchini, sliced",
    "1 yellow squash, sliced",
    "2 tablespoons chopped fresh parsley leaves",
    "1/4 cup unsalted butter",
    "3 cloves garlic, minced",
    "1 cup heavy cream, or more, to taste",
    "1/2 teaspoon dried basil",
    "1/2 teaspoon dried oregano",
    "1/2 teaspoon crushed red pepper flakes, optional",
    "1/2 cup freshly grated Parmesan cheese",
    "2 tablespoons chopped fresh parsley leaves"
  ],
  "__v": 1
}