{
  "hash": "31928ab933ab50ac0d7b6a8ddde35b291f2d316b",
  "title": "Icelandic Thunder Bread Recipe",
  "image": "https://www.thespruceeats.com/thmb/TMiiyi-W-ocUxG23iIA2roFuOlE=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/GettyImages-139838281-56a8338d5f9b58b7d0f1803b.jpg",
  "href": "https://www.thespruceeats.com/icelandic-thunder-bread-recipe-rugbrauo-2952665",
  "extension": "Chrome",
  "firstAdded": "2018-12-11T13:10:48.129000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Steps to Make It",
    "Whisk together the rye flour, all-purpose flour, baking powder and salt in a large bowl or the bowl of a stand mixer. Mix in the brown sugar. Stir the molasses into the lukewarm milk that has been scalded until it dissolves, then slowly stir milk into the dry ingredients (the dough hook of a mixer works great for this). Knead the dough until it is shiny and all the flour is incorporated. Divide into two portions.",
    "Butter the insides of two tin cans (at least 19 ounces each – watch out for sharp edges) or two ceramic bowls or ramekins, each one large enough to hold 1 1/2 cups of batter. Important: The dough will rise while cooking, so whichever molds you use should only be filled 2/3 below the top edge.",
    "Tent the molds with aluminum foil, leaving about an inch of airspace for the bread to rise as it cooks. Secure the edges of the foil tightly around the rims of the molds with twine or rubber bands.",
    "Place the molds in your slow cooker (rest cans, if using, on a trivet or canning jar lid inside the cooker to help the steam circulate). Pour in enough hot water to cover the lower half of the molds (about 2 cups).",
    "Put the lid on the cooker and raise heat to high. Allow to simmer for 4 hours, checking occasionally to ensure that the water hasn't boiled out.",
    "Remove bread and serve immediately with butter, cold pickled herring, lamb pate, cold meats, or cheese."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 1/2 cups rye flour",
    "1 1/2 cups all-purpose flour",
    "1 heaping tablespoon baking powder",
    "1/2 teaspoon salt",
    "1/2 cup brown sugar (packed)",
    "1 cup milk (scalded and slightly cooled until lukewarm)",
    "1 tablespoon molasses",
    "2 cups hot water"
  ],
  "__v": 1
}