{
  "hash": "1e2850ecafd696ece032fbd68e4e9754b49f3623",
  "title": "Goat Cheese and Strawberry Breakfast Tarts",
  "image": "http://www2.worldpub.net/images/saveurmag/103-recipe_poptarts_800x1200.jpg",
  "href": "http://www.saveur.com/article/Recipes/Goat-Cheese-and-Strawberry-Poptarts#518ed8b0655ff2f3af000008",
  "keywords": [
    "allpurpose",
    "flour",
    "kosher",
    "salt",
    "sugar",
    "unsalted",
    "butter",
    "cubed",
    "chilled",
    "goat",
    "cheese",
    "softened",
    "strawberry",
    "jam",
    "egg",
    "lightly",
    "confectioners",
    "strawberries"
  ],
  "directions": [
    "0",
    "Pulse flour, salt, and sugar in a food processor. Add butter and continue to pulse until the mixture resembles coarse sand. With the motor running, add 6 tbsp. cold water and process until dough comes together, 30 seconds to 1 minute. Divide dough in half and form into disks; wrap disks separately in plastic wrap and refrigerate for 1 hour.",
    "Heat oven to 425°. On a lightly floured surface, roll 1 disk of dough into a 9\" square. Cut into six 3\" x 4½\" rectangles; transfer to a parchment-lined baking sheet. Spread each rectangle with about 1 tbsp. goat cheese and top with 1 tbsp. jam, leaving a ½\" border; set aside. Repeat rolling and cutting with remaining disk of dough and lightly prick dough with a fork. Brush edges of dough around cheese and jam with beaten egg and top with pricked dough rectangles. Using the tines of a fork, press edges to seal. Bake until puffed and golden, about 15 minutes. Transfer tarts to a baking sheet with a wire rack; let cool completely.",
    "Whisk confectioners' sugar, strawberries and 2 tbsp. water until smooth. Drizzle over tops of poptarts and let sit until glaze is completely set."
  ],
  "ingredients": [
    "0",
    "2½ cups all-purpose flour",
    "1 tsp. kosher salt",
    "1 tsp. sugar",
    "16 tbsp. unsalted butter, cubed and chilled",
    "3 oz. goat cheese, softened",
    "⅓ cup strawberry jam",
    "1 egg, lightly beaten",
    "2 cups confectioners' sugar",
    "¼ cup finely chopped strawberries"
  ],
  "__v": 0
}