{
  "hash": "d2358e62947e1ce11f62ec1251c33499f9266574",
  "title": "Naked Chicken Chalupa",
  "image": "https://i.kinja-img.com/gawker-media/image/upload/s--Vg11bzsx--/c_scale,fl_progressive,q_80,w_800/niqfp7wbg4trbmixicry.jpg",
  "href": "https://skillet.lifehacker.com/make-your-own-naked-chicken-chalupa-because-taco-bell-i-1792829171",
  "extension": "Chrome",
  "firstAdded": "2017-05-14T22:28:16.938000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Though some, more puritanical eaters may clutch their pearls at the sight of it, when you break it down, the Naked Chicken Chalupa is just a fried chicken cutlet with a salad inside. (To be fair, it’s more “mid-level chain restaurant side salad” than “organic harvest quinoa salad,” but there’s lettuce in there, so I’m calling it “salad.”) But really, if you unfurled the chicken and placed its contents beside it on a plate, you would hardly bat an eye at the resulting meal.",
    "My point is that the components of this dish aren’t very complicated, and that recreating this chalupa is something that is very much within your skill set. The most challenging part is getting the chicken breast to hold a taco shell shape, but this challenge is in no way insurmountable.",
    "To begin, you need to flatten out a boneless, skinless chicken breast. To do this, you just need to sandwich the meat in between two pieces of cling wrap and beat the crap out of it.",
    "Once your meat is all wrapped up, grab a heavy implement like a meat pounder—or wine bottles, small skillets, and even soup ladles work—and pound the meat from the inside out, starting at the thickest part of the breast. You want to flatten it to slightly thicker than a quarter of an inch, as making it any thinner than that will cause the meat to disintegrate. My hunk of chicken actually did fall apart a bit, but it fell apart into two, roughly equally-sized pieces that ended up being perfect for two chalupas.",
    "Next, you need to trim off any little bits of fat and silver skin and season the chicken. I initially just sprinkled a little salt on each side of the pounded-out breast, but that resulted in a chalupa that just didn’t taste processed enough to me. Given the fact that the aim is to makes something that approximates a Taco Bell offering, I wanted more salty, umami-packed goodness in there.",
    "Enter my favorite secret weapon ingredient: Better Than Bouillon (the roasted chicken flavor). I smeared about half a teaspoon on each side of the meat, boosting the chicken-y flavor profile to great new heights. (Besides my precious Better Than Bouillon, I think chicken-flavored ramen seasoning would also work really well here.) Then, it was time to bread.",
    "Initially I had planned to coat the chicken in panko, but I forgot to grab during my last shopping trip. Rather than walk three-quarters of a mile back to the over-priced hippy grocery store to get the crunchy crumbs, I took a page from Taco Bell’s menu and bopped to the corner store to grab a bag of Doritos. I crushed them up in a large freezer bag, then added a quarter teaspoon each of garlic powder, onion powder, and cayenne pepper. I recognize that this is a departure from the “true” Naked Chicken Chalupa, but it is a variation that I am very satisfied with, because Doritos are scientifically engineered to make your mouth happy.",
    "I then dipped the meat in flour, beaten egg, and crushed Doritos (in that order) and heated some Crisco in a large skillet.",
    "To form the chicken into a taco shell, I enlisted the help of an actual taco shell. First, I fried one side of the chicken, flat in the pan for about a minute, to cook the “inside” of the shell.",
    "I then flipped the cutlet over and wrapped it around a hard, store-bought taco shell to help it evolve from a simple chicken cutlet into a Dorito-encrusted chicken chalupa shell.",
    "Then, using tongs and a spatula (and a sense of caution), I gently rotated the chicken taco to fry the outside (about 30 seconds each side), taking care to keep it wrapped around the shell so it would keep its shape.",
    "I stared into the abyss and the abyss stared back.",
    "Though it (obviously) wasn’t as stiff as its processed corn counterpart, it held its shape pretty well, and it performed admirably as a vessel for fillings. You are of course free to fill chicken-wrapped situation however you see fit, but I must say a dollop of queso really takes it to a special place.",
    "A toothpick can help hold the form.",
    "I totally expected the whole thing to disintegrate the moment I took the first bite, but am please to report that I was able to return it to the plate in between bites without it flattening out or loosing any filling.",
    "Not a bad lunch.",
    "In short, it was an absolutely delicious success. The chicken shell was moist and well seasoned with salty, umami flavors that played super well with the fillings. So dry your tears, my friends, and mourn not the loss of Taco Bell’s Naked Chicken Chalupa. You now have a way to make your own, and I bet yours will taste even better than fast food."
  ],
  "ingredients": [
    "0",
    "To begin, you need to flatten out a boneless, skinless chicken breast. To do this, you just need to sandwich the meat in between two pieces of cling wrap and beat the crap out of it."
  ],
  "__v": 2
}