{
  "hash": "416f4f3b8954fb5e75217bab1fbed701ac1cff11",
  "title": "Spinach & Artichoke Sheet Pan Pizza",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2017/07/2017-08-19-ArtichokeSpinachPizza-21.jpg",
  "href": "http://www.simplyrecipes.com/recipes/spinach_artichoke_sheet_pan_pizza/",
  "extension": "Chrome",
  "firstAdded": "2017-08-22T21:27:57.064000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Preheat the oven to 450ºF. Position an oven rack in the lower half of the oven. Grease an 13x18-inch baking sheet with 1 tablespoon of the olive oil.",
    "2 Roll out the dough: If your pizza dough has been in the refrigerator, remove it and set it on the counter at room temperature for 20 minutes.",
    "Generously flour a pastry board, then turn the dough out onto the board. Use a rolling pin to roll the dough into a large rectangle.",
    "3 Transfer the dough to the pan: Transfer the dough to the oiled sheet pan, stretching it out to the corners of the pan. If it springs back, wait a few minutes and then try again.",
    "Drizzle 1 tablespoon of the olive oil onto the dough. Use a pastry brush or your fingers to gently spread the oil all over the dough, taking care not to create any tears. Sprinkle the Italian seasoning evenly over the dough.",
    "4 Wilt the spinach: Heat the remaining tablespoon of oil and the garlic in a large skillet over medium heat. When the garlic begins to bubble, add the spinach. Sauté until the spinach has wilted, about 2 minutes, then turn off the heat.",
    "5 Top the pizza: If the dough has shrunk away from the corners, give it a final stretch to reach the sides of pan. Sprinkle on half of the mozzarella over the pizza, followed by the sautéed spinach and then the artichokes. Sprinkle with the rest of the mozzarella.",
    "6 Bake the pizza: Bake the pizza until the cheese is bubbly and golden brown, 12 to 15 minutes.",
    "7 Slice and serve: Use two spatulas to lift the pizza from the pan and transfer it to a large cutting board to slice into squares, or use a pizza wheel to slice it right in the pan. Serve the pizza piping hot, sprinkled with crushed red pepper flakes (optional)."
  ],
  "ingredients": [
    "0",
    "3 tablespoons olive oil, divided",
    "1 pound pizza dough (store-bought or homemade)",
    "1 teaspoon Italian seasoning",
    "4 cloves garlic, chopped",
    "1 (6-ounce) bag baby spinach",
    "1 (12- to 14-ounce) jar marinated artichoke hearts, drained thoroughly (See Recipe Note)",
    "1 1/2 cups (6 ounces) shredded mozzarella cheese",
    "Crushed red pepper flakes (optional)"
  ],
  "__v": 1
}