{
  "hash": "5a546e235cd21b0168c3da41cedd4251c470d0f4",
  "title": "Healthy Pizza with a Cauliflower Crust",
  "image": "https://www.eatingbirdfood.com/wp-content/uploads/2012/09/Healthy-Cauliflower-Crust-Pizza-300x300.jpg",
  "href": "https://www.eatingbirdfood.com/healthy-pizza-with-a-cauliflower-crust/",
  "extension": "Firefox",
  "firstAdded": "2018-01-28T17:14:54.796000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Pre-heat oven to 400° F.",
    "Prep a cookie sheet or pizza stone by grease it with oil. You can grease the cookie sheet or use greased aluminum foil. It will stick if you don't grease it properly!! (I used a Pampered Chef baking stone, and made sure to spray it before putting on the crust.",
    "Remove the stems and leaves from your cauliflower and chop the florets into chunks. Add to a food processor (I used my Vitamix) and pulse just until the texture is similar to rice. If you don't have a food processor or Vitamix, you can grate the cauliflower with a cheese grater or chop it.",
    "Sauté cauliflower \"rice\" in a non-stick skillet over medium heat and cook until translucent, approximately 6-8 minutes. (You can use the microwave for this as well. Just place cauliflower in an uncovered microwave-safe bowl and cook for 8 minutes.)",
    "In a bowl combine the cooked cauliflower with all remaining ingredients.",
    "Spread dough out evenly over foil (or stone) - about ¼ to ⅓ of an inch thick. The pizza should be about 9-10 inches in diameter.",
    "Bake for 25-30 minutes or until the crust is golden, crispy on the edges and cooked through the middle.",
    "Remove the crust from the oven.",
    "Top with pizza sauce and toppings. Be careful not to add too many heavy toppings as you don't want to weigh down the crust.",
    "Broil the pizza for 5 minutes, or until the toppings are hot and the cheese is melted. Allow the pizza to cool for 2-3 minutes then cut and serve immediately."
  ],
  "ingredients": [
    "0",
    "1/2 head cauliflower (about 2 cups riced)",
    "1 clove garlic, minced",
    "1 cup part-skim shredded mozzarella cheese",
    "1 egg, beaten",
    "1 teaspoon basil",
    "1 teaspoon oregano"
  ],
  "__v": 1
}