{
  "hash": "73f94b3031eb171883972aef06bcec829bc7cd05",
  "title": "Yukon Gold Potato Salad With Tarragon Pesto and Pickled Onions",
  "image": "http://www.seriouseats.com/recipes/assets_c/2014/08/20140811-pesto-variation-tarragon-4-thumb-625xauto-409047.jpg",
  "href": "http://www.seriouseats.com/recipes/2014/08/tarragon-pesto-potato-salad-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-06-11T13:10:19.938000",
  "users": [
    null
  ],
  "keywords": [
    "yukon",
    "gold",
    "potatoes",
    "cubes",
    "kosher",
    "salt",
    "red",
    "wine",
    "vinegar",
    "covering",
    "onion",
    "picked",
    "tarragon",
    "leaves",
    "loosely",
    "parsley",
    "tender",
    "stems",
    "garlic",
    "extravirgin",
    "olive",
    "oil",
    "espelette",
    "pepper",
    "black",
    "olives",
    "kalamata"
  ],
  "directions": [
    "0",
    "1 Place potatoes, 1 tablespoon salt, 1/2 tablespoon vinegar, and 3 cups tepid water in a medium saucepan. Bring to a boil over high heat, stirring occasionally until salt is dissolved. Reduce to a bare simmer and cook until potatoes are completely tender and show no resistance when poked with a paring knife or cake tester, about 17 minutes. Drain potatoes and allow to cool to warm room temperature, about 10 minutes.",
    "2 Meanwhile, add onion to a medium bowl and add just enough vinegar to cover. Let stand until onion is tender and lightly pickled, about 20 minutes.",
    "3 Using a blender, immersion blender, or food processor, blend tarragon, parsley, garlic, and oil until well pureed. Mix in espelette pepper and season with salt and pepper.",
    "4 Drain onions. In a serving bowl, toss potatoes with tarragon pesto, onions, and olives, and serve."
  ],
  "ingredients": [
    "0",
    "1 1/2 pounds Yukon Gold potatoes, cut into 1/2-inch cubes",
    "Kosher salt",
    "1/2 tablespoon red wine vinegar, plus more for covering the onion",
    "1 small red onion, thinly sliced",
    "1/4 cup picked tarragon leaves",
    "1 cup loosely packed parsley leaves and tender stems",
    "2 small cloves garlic",
    "3/4 cup extra-virgin olive oil",
    "Pinch espelette pepper powder (see note above)",
    "Freshly ground black pepper",
    "1/2 cup pitted and halved black olives, such as Kalamata"
  ],
  "__v": 1
}