{
  "hash": "f66bda02bf32935acb9eec44307322affd8304c4",
  "title": "Grilled Corn and Avocado Salad With Feta Dressing",
  "image": "https://static01.nyt.com/images/2019/08/14/dining/sl-corn-and-avocado-salad/merlin_159056649_e9aed760-37ec-4a54-bdfa-6d0f3f4459af-articleLarge.jpg",
  "href": "https://cooking.nytimes.com/recipes/1020403-grilled-corn-and-avocado-salad-with-feta-dressing?em_pos=medium&ref=headline&nl_art=3&te=1&nl=cooking&emc=edit_ck_20190818?campaign_id=58&instance_id=11710&segment_id=16271&user_id=4264688f24592aeeb06433e5d96d7150&regi_id=79859114emc=edit_ck_20190818",
  "extension": "Firefox",
  "firstAdded": "2019-08-19T17:38:34.120000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat a grill or grill pan over medium-high. Brush corn, scallions and jalapeño with the oil and season with salt and pepper. Arrange on the grill and cook, turning occasionally, until corn kernels are browned in spots, 6 to 8 minutes, and the scallions and jalapeño are charred all over and tender, 9 to 10 minutes. Transfer vegetables to a cutting board and let cool slightly.",
    "In a medium bowl, using a whisk, mash the feta into a coarse paste. Whisk in buttermilk, lemon zest and juice and garlic, then stir in chives and parsley. Finely chop the charred jalapeño and stir it into the feta dressing; season with salt and pepper.",
    "In a large bowl, toss lettuce with half the feta dressing and arrange on a platter. Cut corn kernels off the cob and slice scallions into bite-size pieces. Arrange avocado slices, corn and scallions on top of the lettuce. Serve with remaining dressing."
  ],
  "ingredients": [
    "0",
    "6",
    "ears corn (about 3 pounds), shucked and silk removed",
    "1",
    "bunch scallions (about 6), trimmed",
    "1",
    "jalapeño, stemmed and halved lengthwise",
    "3",
    "tablespoons olive oil",
    "Kosher salt and black pepper",
    "4",
    "ounces feta cheese, crumbled (about 3/4 cup)",
    "⅓",
    "cup buttermilk",
    "1",
    "teaspoon freshly grated lemon zest plus 1 tablespoon lemon juice",
    "1",
    "small garlic clove, grated",
    "¼",
    "cup sliced fresh chives",
    "¼",
    "cup finely chopped fresh parsley",
    "1",
    "medium head romaine lettuce, torn into bite-size pieces (about 8 cups)",
    "2",
    "avocados, sliced"
  ],
  "__v": 1
}