{
  "hash": "71f1d3ae02c1c7f3ac48d22508d9837eb765621a",
  "title": "Flank Steak Tacos",
  "image": "https://www.wellplated.com/wp-content/uploads/2018/07/Quick-Flank-Steak-Tacos-600x767.jpg",
  "href": "https://www.wellplated.com/flank-steak-tacos/",
  "extension": "Chrome",
  "firstAdded": "2019-05-27T20:23:24.517000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place the flank steak in a baking dish. In a medium mixing bowl or large measuring cup, stir together the olive oil, garlic, orange juice, lime juice, cumin, salt, and pepper. Pour over the steak. Cover tightly with plastic and refrigerate for at least 1 hour or up to 8 hours (do not marinate for more than 8 hours or the steak will break down and soften too much).",
    "When ready to grill, remove the steak from the refrigerator and let stand at room temperature while you prepare any toppings and preheat the grill. Preheat an outdoor grill or indoor grill pan over medium-high heat. Brush the grill grates with oil. Remove the steak from the marinade, shaking off any excess. Grill (or broil) the steak for about 3-4 minutes per side, flipping once, until medium-rare (The steak should read 135 degrees F on an instant read thermometer.) Remove the steak to a cutting board and cover with foil. Let rest for 5 minutes (this allows the juices to sink into the meat), then cut the steak into thin, 1/4-inch slices, slicing it across the grain.",
    "To heat the tortillas: place them in a dry skillet heated over high or heat them on the grill for about 15-30 seconds per side, until warmed through.",
    "Assemble the tacos: fill the tortillas with a few slices of beef. Sprinkle with cheese and any desired toppings. Enjoy immediately."
  ],
  "ingredients": [
    "0",
    "1 pound flank steak",
    "2 tablespoons extra virgin olive oil",
    "2 cloves garlic — minced (about 2 teaspoons)",
    "Juice of 1 medium orange — about 1/4 cup",
    "Juice of 1 medium lime — about 2 tablespoons",
    "1/2 tablespoon ground cumin",
    "1/2 teaspoon kosher salt",
    "1/4 teaspoon black pepper",
    "Canola oil — for coating the grill",
    "8 7-inch corn or flour tortillas",
    "Cotija cheese (feta is an acceptable substitute)",
    "Other toppings: chopped fresh cilantro — diced red onion, sliced or diced tomatoes"
  ],
  "__v": 3
}