{
  "hash": "aed826340363153ad32a0d545cf353e99be7198e",
  "title": "Honey Sesame Instant Pot Chicken Thighs\nHoney Sesame Instant Pot Chicken Thighs are super easy, tender, and flavorful making for one of the best instant pot chicken recipes ever! This chicken is smothered in a sweet and savory honey sesame garlic sauce that is out of this world and perfect over rice!",
  "image": "https://s3-us-east-2.amazonaws.com/thesaltymarshmallow/wp-content/uploads/2018/04/08173238/honey-sesame-instant-pot-chicken-thighs3-150x150.jpg",
  "href": "https://thesaltymarshmallow.com/honey-sesame-instant-pot-chicken-thighs/",
  "extension": "Chrome",
  "firstAdded": "2019-02-13T00:19:57.416000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Season the chicken thighs on both sides with salt and pepper to taste.",
    "Add the olive oil and 1 teaspoon of the sesame oil to the instant pot and turn to saute.",
    "When the oil is hot, add the seasoned chicken thighs and sear for 2-3 minutes until golden brown on each side.",
    "Remove the chicken thighs from the pot to a plate. Pour the chicken broth into the pot and use a wooden spoon to scrape up any browned bits from the bottom of the pot.",
    "Turn the instant pot to off.",
    "In a medium bowl whisk together the remaining teaspoon of sesame oil, minced garlic, soy sauce, honey, ketchup, red pepper flakes, and water.",
    "Return the chicken thighs to the pot. Pour the sauce over the chicken thighs.",
    "Seal the pot and cook on manual for 8 minutes for boneless chicken thighs or 10 minutes for bone-in chicken thighs.",
    "Remove chicken from the pot to a plate and cover with foil if desired to keep warm.",
    "In a small bowl whisk together the cornstarch and water.",
    "Turn the instant pot to saute and add the cornstarch slurry to the sauce with a whisk. When the sauce is thick, turn off the pot and serve the sauce over the chicken."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 Pounds Chicken Thighs",
    "Salt & Pepper to taste",
    "1 Tablespoon Olive Oil",
    "1/4 Cup Chicken Broth",
    "2 Teaspoons Sesame Oil Divided",
    "2 Cloves Garlic Minced",
    "1/2 Cup Soy Sauce",
    "1/3 Cup Honey",
    "2 Tablespoons Ketchup",
    "1/4 Teaspoon Red Pepper Flakes optional",
    "1/2 Cup Water",
    "2 Tablespoons Cornstarch",
    "2 Tablespoons Cold Water",
    "Sesame Seeds",
    "Green Onion, Chopped",
    "Rice, For Serving"
  ],
  "__v": 1
}