{
  "hash": "1c97897106740996693586fa37d2acba03ef485c",
  "title": "Mc Donald'S Classic French Fries",
  "image": "http://img.sndimg.com/food/image/upload/w_555,h_416,c_fit,fl_progressive,q_95/v1/img/recipes/43/37/45/picSLD5iH.jpg",
  "href": "http://www.food.com/recipe/mc-donalds-classic-french-fries-copycat-433745",
  "extension": "Chrome",
  "firstAdded": "2015-09-22T08:47:41.173000",
  "users": [
    null
  ],
  "keywords": [
    "potatoes",
    "medium",
    "shoestringcut",
    "russet",
    "brine",
    "cold",
    "water",
    "salt",
    "granulated",
    "sugar",
    "white",
    "pepper",
    "citric",
    "acid",
    "vinegar",
    "deepfrying",
    "fat",
    "oil",
    "shortening",
    "blend",
    "used",
    "grassfed",
    "beef",
    "tallow",
    "seasoning",
    "flake"
  ],
  "directions": [
    "0",
    "MIX the BRINE in a 3 quart pot with an accompanying lid.",
    "PEEL 4 medium russet potatoes; CUT potatoes into 1/4\" shoestrings (try to make them as uniform as possible; I use an adjustable-blade French-fry cutter).",
    "PLACE cut potatoes into the brine container; SEAL and refrigerate for at least 2 hours; BRING pot with brine and potatoes to a full boil; BOIL for 1 1/2-2 minutes; DRAIN and rinse potatoes under cold water; BLOT potatoes as dry as possible.",
    "PLACE potatoes side-by-side into freezer bags without touching, and without crowding; SEAL bags and freeze flat in refrigerator for at least 2 hours (just make sure fries are frozen solid).",
    "FILL deep-fryer with proper amount of beef tallow (or oil/shortening blend), to manufacturer's recommended amount; HEAT fryer in gradual increments to 375°F.",
    "PLACE 1/2 of the potatoes at a time into elevated deep-frying basket; GENTLY lower basket into hot fat.",
    "FRY for about 2 minutes but PAY ATTENTION TO THE COLOR -- potato color should be light golden brown with just slightly darker ends (see photo, and pull a french fry with tongs to test doneness if necessary); ELEVATE fry basket and shake to drain excess fat; SECURE basket and let drain for 30 seconds.",
    "TRANSFER fries into colander placed in sink; REPEAT with remaining potatoes.",
    "SEASON french fries lightly with fine flake sea salt while tossing (eat immediately, or keep warmed for a limited time in a 170°F oven).",
    "SERVE french fries with your favorite condiment and ENJOY!"
  ],
  "ingredients": [
    "0",
    "POTATOES",
    "4 medium peeled shoestring-cut russet potatoes",
    "BRINE",
    "8 cups cold water",
    "2 tablespoons fine sea salt",
    "2 1⁄4 teaspoons granulated sugar",
    "3⁄4 teaspoon white pepper",
    "3⁄4 teaspoon citric acid or 2 tablespoons white vinegar",
    "DEEP-FRYING FAT (VEGETABLE OIL SHORTENING BLEND MAY BE USED)",
    "100% grass-fed beef tallow",
    "SEASONING",
    "fine flake sea salt"
  ],
  "__v": 1
}