{
  "hash": "b49f42444251cfcc8d4048d9dcafd07f76596478",
  "title": "Amazing Halloween Rainbow Party Bundt Cake Recipe",
  "image": "",
  "href": "http://www.holidaycottagepage.com/amazing-halloween-rainbow-party-bundt-cake-recipe/",
  "firstAdded": "2014-12-19T00:43:36.595000",
  "users": [
    null
  ],
  "keywords": [
    "box",
    "betty",
    "crocker",
    "supermoist",
    "white",
    "cake",
    "water",
    "oil",
    "eggs",
    "called",
    "dark",
    "chocolate",
    "black",
    "food",
    "coloring",
    "purple",
    "orange",
    "whipped",
    "fluffy",
    "frosting"
  ],
  "directions": [
    "0",
    "Heat oven to 325°F. Generously grease a 12-cup tube cake pan. Make cake batters as directed on boxes. Divide the white cake into two separate bowls.",
    "Add orange food coloring to one bowl and mix to the desired color. Then, add purple to the other and mix to the desired color.",
    "Pour 2/3 of the chocolate cake batter into a bowl and mix with a few drops of the black food coloring. Discard the remainder of the batter or use it for cupcakes. (You only need 2/3 of the chocolate cake batter, because if you use the whole thing in won’t fit in the tube pan).",
    "Pour 1/2 of the chocolate cake mix into the bottom of the greased pan. Carefully pour the purple over the chocolate making sure you don’t stir it. Just pour it on top.",
    "Then, carefully pour the orange batter over the purple batter and pour in the remainder of the chocolate.",
    "Bake as directed on box or until toothpick inserted in center comes out clean. Cool 5 minutes.",
    "Turn pan upside down onto cooling rack that is placed over a cookie sheet. Cool cake completely, about 30 minutes.",
    "Once cake is cool, equally divide your frosting into 3 bowls. Use the food coloring again to make one bowl orange, one purple and one black.",
    "Microwave each bowl of frosting for a few seconds on high until it is smooth enough to drizzle over the cake. With a spoon, drizzle the black frosting back and forth around the whole ring in a striping pattern until you use it all. Then do the same with the purple and then the orange.",
    "Store loosely covered and unrefrigerated.",
    "Cake can be made a day or two in advance."
  ],
  "ingredients": [
    "0",
    "1 box Betty Crocker® SuperMoist® white cake mix",
    "Water, vegetable oil and eggs called for on cake mix box",
    "1 box Betty Crocker® SuperMoist® Dark Chocolate cake mix",
    "Water, vegetable oil and eggs called for on cake mix box",
    "Black food coloring",
    "Purple food coloring",
    "Orange food coloring",
    "1 (12 oz) can Betty Crocker® Whipped Fluffy White Frosting"
  ],
  "__v": 1
}