{
  "hash": "93eaebd60283219e6ca5ef6dbe425991b307b287",
  "title": "RED CHILI SAUCE (TO BE USED WITH TRADITIONAL TAMALES)",
  "image": "http://img.sndimg.com/food/image/upload/w_707,h_398,c_fill,fl_progressive,q_80/v1/img/recipes/15/30/1/zmRzsryRTOFm2aEQDa8Q_tamales-sauce-5338.jpg",
  "href": "http://www.geniuskitchen.com/recipe/red-chili-sauce-to-be-used-with-traditional-tamales-15301?photo=cGhvdG8tMzc3NzIz",
  "extension": "",
  "firstAdded": "2017-12-26T17:19:31.104000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "Remove stems and seeds from dried chili peppers.",
    "Place peppers in a single layer on a baking sheet.",
    "Roast in 350°F oven for 2 to 5 minutes or until you smell a sweet roasted aroma, checking often to avoid burning.",
    "Remove from oven and soak in enough hot water to cover for about 30 minutes or until cool.",
    "Put peppers and 2 1/2 cups of the soaking water into a blender (save the remaining soaking water).",
    "Add garlic, cumin and salt.",
    "Cover and blend until smooth.",
    "In a 2-quart sauce pan, stir flour into oil or melted shortening over med heat until browned.",
    "Carefully stir in blended chili mixture.",
    "Simmer uncovered for 5 to 10 minutes or until slightly thickened. (If sauce gets too thick, stir in up to 1 cup of the remaining soaking water until you reach the desired thickness) Use this sauce for traditional tamales, recipe #15286.",
    "Note: When working with chilies, use rubber gloves to protect your skin, and avoid contact with your eyes. Wash hands throughly with soap and water to remove all of the chili oils."
  ],
  "ingredients": [
    "0",
    "READY IN: 1hr 5mins",
    "YIELD: 4 cups\tUNITS: US",
    "INGREDIENTS Nutrition",
    "15 large dried chilies (such as Anaheim, New Mexico, California, or pasilla)",
    "4 -5 garlic cloves",
    "2 teaspoons ground cumin",
    "1 teaspoon salt",
    "2 teaspoons all-purpose flour",
    "2 teaspoons olive oil or 2 teaspoons melted shortening"
  ],
  "__v": 1
}