{
  "hash": "e580ea54b2231451be317d8dd5865ac6e84cc98b",
  "title": "Sausage, Cranberry and Apple Stuffing",
  "image": "http://recipe-folder.com/img/recipe-images/031/955/2398090131.jpg",
  "href": "http://recipe-folder.com/recipe/5bf38feb780287195894fe9b",
  "extension": "User Added",
  "firstAdded": "2018-11-20T04:39:07.719000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350°F.Place cubed sourdough on 2 baking sheets. Bake 10-15 minutes, stirring bread occasionally until toasted, but not browned. Place toasted bread cubes into extra large bowl, add cranberries and apples. Set aside.",
    "1",
    "Butter 9x13-inch casserole dish. Set aside.",
    "2",
    "In large skillet over medium heat, cook sausage using spatula to break it up as it cooks.",
    "3",
    "Add 1 1/2 tablespoons sage. Cook through, but do not brown. Remove sausage from skillet using slotted spoon and add it to bowl with bread cubes. Leave 2 tablespoons of sausage drippings in the pan (drain any extra) and add shallots. Cook until translucent; add pecans, herbs and remaining sage to skillet. Cook 2 minutes stirring frequently. Pour shallot herb mixture into bowl with bread cubes.",
    "4",
    "Add wine to skillet and scrape browned bits from bottom of pan as it cooks. Add butter and chicken stock. Bring to boil for 3 minutes, remove from heat and pour over bread cubes in bowl. Add eggs.Toss gently until combined and pour into prepared baking dishes.",
    "5",
    "Cover with foil and bake 40 minutes. Remove foil and bake 15 minutes more."
  ],
  "ingredients": [
    "0",
    "1 loaf sour dough bread, cubed (about 10 cups)",
    "1",
    "1 cup sweetened dried cranberries",
    "2",
    "1 medium apple, peeled, cored and chopped",
    "3",
    "2 (12 oz) Jones Dairy Farm All Natural Pork Sausage Rolls",
    "4",
    "1/2 cup shallots, finely diced",
    "5",
    "1/2 cup pecans, chopped",
    "6",
    "1/2 cup fresh parsley, chopped",
    "7",
    "3 tablespoons fresh sage, finely chopped and divided",
    "8",
    "1 tablespoon fresh rosemary, finely chopped",
    "9",
    "1 teaspoon fresh thyme, chopped",
    "10",
    "1 cup chardonnay wine",
    "11",
    "4 tablespoons unsalted butter",
    "12",
    "2 cups chicken stock",
    "13",
    "2 eggs, lightly beaten"
  ],
  "__v": 1,
  "hidden": true
}