{
  "hash": "68641c56aac92e6fac1399b8b2bc5546e1322ee9",
  "title": "Mongolian Beef",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/mongolian-beef-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-08-26T21:53:01.245000",
  "users": [
    null
  ],
  "keywords": [
    "flank",
    "steak",
    "egg",
    "cornstarch",
    "oil",
    "frying",
    "rice",
    "noodles",
    "garlic",
    "long",
    "scallion",
    "slices",
    "green",
    "white",
    "parts",
    "sugar",
    "black",
    "pepper",
    "soy"
  ],
  "directions": [
    "0",
    "Trim the fat of the flank steak and cut into thin pieces against the grain. Marinate the meat for 1 hour in a mix of egg, cornstarch, and 2 tablespoons oil.",
    "In large wok, cook the rice noodles in 2 inches of hot oil for just a few seconds, or until they puff up. Drain the noodles and set to the side. Heat up the wok again with 3 cups of oil to 350 degrees F and add the cut up flank steak. Stir for 3 to 4 minutes, and then remove from the heat and drain well.",
    "Heat the wok up again and add 2 teaspoons oil, ground garlic, all the cut up scallions, and the marinated beef. Cook for 2 to 3 minutes. Now add the sugar, black pepper, and soy sauce and cook for another 3 to 4 minutes. Remove from the heat and serve over the rice noodles.",
    "This recipe was provided by professional chefs and has been scaled down from a bulk recipe provided by a restaurant. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results.",
    "Recipe courtesy of Benny Lin, owner of Pagoda in North Pole, AK."
  ],
  "ingredients": [
    "0",
    "1 (16-ounce) flank steak",
    "1 egg",
    "1 teaspoon cornstarch",
    "3 cups plus 2 tablespoons plus 2 teaspoons vegetable oil, plus more for frying",
    "5 ounces cooked rice noodles",
    "1 tablespoon ground garlic",
    "3/4 cup (3/4-inch long) scallion slices, green and white parts",
    "1/4 cup sugar",
    "1 teaspoon ground black pepper",
    "3 teaspoons soy sauce"
  ],
  "__v": 1
}