{
  "hash": "c81dadde4ce8904f0175a5cbaf047de673ff71a5",
  "title": "Coffee-Crusted Barbecue Beef Ribs",
  "image": "https://images.food52.com/dmqPV4OLze5EIEq-LpsCxX2z5Ys=/753x502/140a706e-f1ff-4ff4-b0a4-9f3fbc5e5258--2014-0923_coffee-crusted-barbecue-ribs-012.jpg",
  "href": "https://food52.com/recipes/21976-coffee-crusted-barbecue-beef-ribs",
  "extension": "Chrome",
  "firstAdded": "2018-01-16T01:43:17.996000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven on 500° F (260° C).",
    "Coarsely grind the coffee beans in a spice grinder (to about the same coarseness as you would for a French press grind), then set them aside. Grind the black peppercorn and sea salts together until the biggest piece of peppercorn is halved or quartered. Mix the coffee, peppercorns, and seat salt together with the smoked paprika.",
    "Lay the beef ribs on a baking sheet and rub with a thin coating of olive oil, then coat with the spice mix. Use your hands to press the spice mix into the ribs, making sure every inch of surface is covered and the spice mix is glued nicely onto the ribs. The ribs should have a thick, “crusty” coating. Roast in the 500° F (260° C) oven for 10 minutes, or until you have a nice sear on the ribs. Remove the baking sheet from the oven, then turn the heat down to 300° F (150° C).",
    "Transfer all of the ribs onto doubled-up sheets of heavy-duty aluminum foil. Wrap the ribs in the foil and make sure there are no openings anywhere. Place the entire pouch on top of a baking rack and score a few slits on the bottom of the pouch with a small knife. Place the baking rack on top of a baking sheet to catch the drippings. Place the entire thing back in the oven and roast for 4 hours.",
    "After 4 hours, turn the heat down to 220° F (100° C) and slow-roast for another 7 hours. During this time, feel free to check the tenderness of the ribs once or twice. If by the end of 7 hours a fork cannot be easily inserted into the meat, I would suggest turning the heat back up to 300° F (150° C) and cooking for an additional 1 to 2 hours. The final product should be sticky, tender, and gelatinous. A darker shade of pink should develop along the outer surface of the muscle tissue.",
    "When your ribs are done, sprinkle with fine sea salt and eat with a bit of Dijon mustard. You could chop the meat up into pieces, or just dig into it in true carnivore style."
  ],
  "ingredients": [
    "0",
    "1/3 cup dark roast coffee beans",
    "1/4 cup black peppercorn",
    "4 tablespoons sea salt, plus more for serving",
    "4 tablespoons hickory smoked sea salt",
    "2 tablespoons smoked Spanish paprika",
    "Olive oil",
    "5 pounds bone-in beef ribs (approximately 4 racks)",
    "Dijon mustard, for serving (optional)"
  ],
  "__v": 1
}