{
  "hash": "682d2f083c1e113e98fe8c0ac42aa3cb9f122ff5",
  "title": "Savory Meat Base",
  "image": "http://cdn-image.myrecipes.com/sites/default/files/styles/300x300/public/image/recipes/sl/02/08/savory-meat-sl-322070-x.jpg?itok=YCgVPYb2",
  "href": "http://www.myrecipes.com/recipe/savory-meat-base",
  "firstAdded": "2015-01-23T21:59:44.536000",
  "users": [
    null
  ],
  "keywords": [
    "lean",
    "beef",
    "click",
    "savings",
    "onions",
    "green",
    "bell",
    "pepper",
    "bottled",
    "garlic",
    "jar",
    "marinara",
    "salt"
  ],
  "directions": [
    "0",
    "Cook first 4 ingredients in a large Dutch oven over medium-high heat; stir until crumbled and no longer pink. Drain mixture; return to Dutch oven.",
    "Stir in marinara sauce, salt, and pepper; cover and simmer, stirring occasionally, 15 minutes. Cool 10 minutes. Spoon about 4 cups each of mixture into 2 heavy-duty zip-top plastic bags; freeze until ready to use.",
    "Spaghetti with Meat Sauce: Heat 1 package (4 cups) Savory Meat Base, thawed, in a Dutch oven over medium heat. Stir in 1 (14 1/2-ounce) can diced tomatoes with Italian herbs, 1 (8-ounce) can tomato sauce, 1 teaspoon dried Italian seasoning, and 1/2 teaspoon dried basil. Cover, reduce heat, and simmer 20 minutes. Serve over 12 ounces hot cooked spaghetti with a tossed green salad and garlic bread. Makes 6 servings.",
    "Sloppy Joes: Heat 1 package (4 cups) Savory Meat Base, thawed, in a Dutch oven over medium heat. Stir in 2 teaspoons chili powder and 1 teaspoon brown sugar. Cover and simmer, stirring occasionally, 15 to 20 minutes. Serve on hamburger buns with potato chips and fresh fruit. Makes 6 servings.",
    "Easy Beef and Macaroni: Heat 1 package (4 cups) Savory Meat Base, thawed, in a Dutch oven over medium heat. Stir in 1 (14 1/2-ounce) can diced tomatoes, 2 teaspoons chili powder, 2 teaspoons paprika, and 1 bay leaf. Cover, reduce heat, and simmer 15 minutes. Discard bay leaf. Stir in 4 cups hot cooked elbow macaroni; cook 5 more minutes. Top with sour cream and sliced green onions. Makes 6 servings."
  ],
  "ingredients": [
    "0",
    "3 pounds lean ground beef $Click to see savings",
    "2 large onions, chopped $Click to see savings",
    "1 large green bell pepper, chopped $Click to see savings",
    "1 teaspoon bottled minced garlic",
    "1 (26-ounce) jar marinara sauce $Click to see savings",
    "1 teaspoon salt $Click to see savings",
    "1/2 teaspoon pepper $Click to see savings"
  ],
  "__v": 1
}