{
  "hash": "2ff8ac53ae64f6cf46d0176e8dbb2b4e0b1e52ff",
  "title": "Dairy-Free Vanilla Cake",
  "image": "https://media.cheftap.com/wp-content/uploads/beckyrasmussen/6cd7f300-020a-4b41-bc0b-21ef6f673d22.png",
  "href": "https://cheftap.com/recipes/dairy-free-desserts-18/",
  "extension": "Chrome",
  "firstAdded": "2018-11-12T18:00:02.979000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 325 F. Lightly grease (with dairy-free margarine) two 8\\\" round cake pans, line with greased parchment and lightly flour, tapping out excess. Set aside.",
    "In a medium-sized mixing bowl, sift together the flour, baking powder, and salt. Set aside.",
    "In another medium-large mixing bowl using an electric hand mixer, beat together the soy margarine and sugar until fluffy, about 4 minutes. Add the vanilla, beating until well combined. Add the eggs, one at a time, beating well between additions.",
    "Add 1/3 of the flour mixture to the margarine mixture, followed by 1/3 cup of the almond milk, and continue adding the remaining ingredients in two more additions, beating well before adding the next. Mix until just combined.",
    "Pour the batter into the prepared pans, smoothing the tops with an offset spatula. Bake for 50 minutes or until a toothpick inserted into the center of the cakes comes out clean. Allow the cakes to cool for 10 minutes in the pans before transferring the cakes to a wire rack to cool completely. Once cool, frost with dairy-free frosting of your choice and serve, either as two single-layer cakes or one layer cake."
  ],
  "ingredients": [
    "0",
    "2 2/3 cups cake flour",
    "2 teaspoon baking powder",
    "1/8 teaspoon salt",
    "1 cup dairy-free soy margarine (2 sticks, slightly cooler than room temperature)",
    "2 cups plus 2 tablespoon sugar",
    "1 1/2 teaspoons vanilla extract",
    "4 eggs (large)",
    "1 cup unsweetened almond milk (or soy milk or rice milk)"
  ],
  "__v": 1
}