{
  "hash": "bc3f72f7fdbb7d8f115483518807626653222f38",
  "title": "Angela (Oh She Glows)",
  "image": "",
  "href": "http://ohsheglows.com/2014/10/15/crispy-smashed-potatoes-with-avocado-garlic-aioli/",
  "extension": "Chrome",
  "firstAdded": "2017-08-18T02:41:33.934000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Add potatoes into a large pot and cover with water (do not peel the potatoes). Turn the heat to high. When the water starts to boil, reduce heat slightly, and simmer the potatoes uncovered for 20 to 25 minutes, until fork tender.",
    "When there is about 10 minutes left of boiling the potatoes, begin preheating the oven to 450°F.",
    "When the potatoes are fork tender, drain in a colander and cool for 5 minutes or so.",
    "Place the potatoes on a large, lightly greased baking sheet. (Skip the parchment paper for this recipe, as an oiled baking sheet with produce crispier potatoes.) With the base of a mug or metal measuring cup, \"smash\" (press down on) each potato until each one is mostly flattened. Some potatoes might break apart a little, but this is totally fine!",
    "Drizzle each potato with about 1 teaspoon of oil and sprinkle on a generous amount of salt and pepper. Finally, sprinkle on some garlic powder.",
    "Roast the potatoes in the oven for 25 to 33 minutes until crispy, golden, and browned on the bottom. Keep an eye on them as cook time will vary depending on the size of your potatoes. I love to roast these until the skins become a deep golden brown and crispy—they are so delicious to eat!",
    "Meanwhile, prepare the Avocado Garlic Aioli: Add garlic into food processor and process until minced. Now add the rest of the aioli ingredients and process until smooth, scraping down the bowl as needed.",
    "Remove the potatoes from the oven and sprinkle each with chopped fresh parsley, more sea salt, and pepper. Serve immediately with avocado aioli (piped or dolloped on) and watch them go lightning fast!!"
  ],
  "ingredients": [
    "0",
    "2 to 2 1/2 pounds Yukon Gold potatoes (or try red or new potatoes)",
    "2 to 3 tablespoons extra-virgin olive oil",
    "Fine sea salt and freshly ground black pepper, for seasoning",
    "Garlic powder or granules, for sprinkling on top",
    "1/3 to 1/2 cup fresh parsley, minced",
    "1 large avocado, halved and pitted",
    "1 large or 2 small garlic cloves",
    "1/2 tablespoon fresh lemon juice, or more to taste",
    "1/4 cup soy-free Veganaise (or vegan mayo of choice)",
    "Fine sea salt and freshly ground black pepper, to taste"
  ],
  "__v": 1
}