{
  "hash": "6459b2fc7f1474d7756d5f62a205288fd35951c5",
  "title": "Egg, Ham and Cheese Crepe Pockets",
  "image": "http://natashaskitchen.com/wp-content/uploads/2015/09/Egg-Ham-and-Cheese-Crepe-Pockets-15-600x400.jpg",
  "href": "http://natashaskitchen.com/2015/09/24/egg-ham-and-cheese-crepes-recipe/",
  "extension": "Chrome",
  "firstAdded": "2016-05-17T15:56:49.845000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "How to Make Perfect Crepes:",
    "In the bowl of a blender, combine all ingredients for crepes in the order listed. Blend until smooth (1 min). Scrape down the sides with a spatula if you see any flour clinging to the walls of your blender.",
    "Over medium/low heat, melt a dot of butter in a good non-stick skillet Add batter and quickly swirl to cover the bottom (about 3-4 Tbsp for a medium pan or 5-6 Tbsp for a large pan). Fill in any gaps with more batter as needed. Saute until golden on each side (1 min per side) then place on a cutting board to cool. Once crepes are at room temp, they can be stacked.",
    "How to Assemble Breakfast Crepe Pockets:",
    "Melt ½ Tbsp butter in a large non-stick pan and saute your scrambled eggs. Cook until fluffy and still somewhat moist. Set aside to cool.",
    "Brush one side of a crepe lightly with dijon mustard, place a generous pinch of shredded cheese in the center then top with ham, eggs and more cheese. Fold the top over and tuck it under the egg slightly. Fold in the sides and roll to close. Repeat with remaining crepes.",
    "To serve right away, saute in butter 3 min per side over med/low heat until golden brown on both sides and warmed through. Serve plain or with diced tomatoes, avocado and hot sauce."
  ],
  "ingredients": [
    "0",
    "Ingredients for Crepes:",
    "½ cup warm water",
    "1 cup milk, any kind",
    "4 large eggs",
    "4 Tbsp unsalted butter, melted. Plus more to sauté.",
    "1 cup all-purpose flour (you can use ½ cup whole wheat flour and ½ cup all-purpose)",
    "1 tsp sugar",
    "Pinch of Salt"
  ],
  "__v": 1
}