{
  "hash": "62768a98a588602d922a6b8d470da042ca02e459",
  "title": "Smoky sausage casserole",
  "image": "//www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe/recipe-image/2016/02/smoky-sausage-casserole.jpg?itok=3IMt0zHx",
  "href": "https://www.bbcgoodfood.com/recipes/smoky-sausage-casserole",
  "extension": "Chrome",
  "firstAdded": "2020-02-25T13:42:55.338000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Put the oil in a large, heatproof casserole dish over a medium heat and add the onion, cooking for 5 mins until starting to soften. Tip in the garlic, celery and peppers, and give everything a good stir. Cook for 5 mins more.",
    "Turn the heat to high and add the sausages. Cook for a few mins until browned all over, then reduce the heat to medium, sprinkle in the spices and season well. Pour over the tomatoes and bring to a simmer. Cover and continue simmering gently for 40 mins, stirring every now and then.",
    "Heat the grill to high and uncover the casserole. Add the beans and spinach, and stir to warm through. Scatter over the breadcrumbs and grill for 2-3 mins until golden and crisp."
  ],
  "ingredients": [
    "0",
    "1 tbsp olive oil Olive oil ol-iv oylProbably the most widely-used oil in cooking, olive oil is pressed from fresh olives. It's…",
    "1 onion Onion un-yunOnions are endlessly versatile and an essential ingredient in countless recipes. Native to Asia… , finely chopped",
    "1 garlic clove, crushed",
    "1 large celery stick, finely chopped",
    "2 peppers Pepper pep-izAlso known as capsicums, bell peppers, sweet peppers or by their colours, for example red and… (any colour), cut into chunks",
    "pack 6 pork sausage (about 400g/14oz)",
    "1 tsp sweet smoked paprika",
    "½ tsp ground cumin",
    "½ tsp chilli flakes",
    "2 x 400g cans chopped tomatoes",
    "400g can cannellini beans Cannellini bean can-a-leen-ee beenSlightly kidney-shaped with squarish ends, cannellini beans are from Italy and are creamy white… , drained",
    "250g bag spinach Spinach spin-atchUsed in almost every cuisine across the world, spinach is an enormously popular green vegetable… ( or use the same quantity as frozen)",
    "2 tbsp fresh breadcrumbs (or frozen with herbs)"
  ],
  "__v": 1
}