{
  "hash": "4c133f0bb419d7bcdcd95eeeb940adfb97cc8f15",
  "title": "Chicken Chili Corn Chip Pie",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2011/1/26/0/DV1104H_chicken-chili-corn-chip-pie_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/chicken-chili-corn-chip-pie-recipe.html",
  "firstAdded": "2015-01-24T15:35:19.099000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "clove",
    "garlic",
    "oil",
    "broth",
    "divided",
    "guajillo",
    "peppers",
    "tomato",
    "tomatoes",
    "butter",
    "spanish",
    "onion",
    "bell",
    "pepper",
    "chili",
    "cumin",
    "salt",
    "black",
    "cayenne",
    "canned",
    "pinto",
    "beans",
    "corn",
    "chips",
    "recommended",
    "fritos",
    "cheese",
    "lettuce",
    "sour",
    "cream",
    "jalapenos",
    "professional",
    "scaled",
    "bulk",
    "provided",
    "restaurant",
    "food",
    "network",
    "kitchens",
    "chefs",
    "tested",
    "recipe",
    "proportions",
    "indicated",
    "make",
    "representation",
    "results"
  ],
  "directions": [
    "0",
    "For the chicken: Add the whole chicken to boiling water and boil until thoroughly and safely cooked. (The skin should take on a visible color change, the temperature can vary depending on the stove, but typically, so long as the water is boiling, you are good to go.) Remove from the water and allow the chicken to drain and cool. Pull the meat in strips from the bone.",
    "For the sauce: In a large saucepan, toast the garlic in the oil over high heat until lightly browned, 1 to 3 minutes. Add half the chicken broth and the peppers and sweat for 2 minutes. Add the tomato paste and crushed tomatoes and bring to a boil. Fold in the pulled chicken. Reduce the heat, add the remaining chicken broth, and allow the mixture to simmer 5 to 10 minutes while stirring continuously. Keep warm.",
    "For the chili base: In a large saucepan, coat the bottom of the pan with the oil and sweat the onions and peppers over low heat . Stir often enough to avoid browning. Add the crushed tomatoes and spices and bring to boil. Add the beans and reduce the heat to a simmer. Let the base reduce to the thickness you like in your chili. Mix in the chicken and sauce and bring back to a boil.",
    "Serve the chili with corn chips, shredded cheese, shredded lettuce, diced tomatoes, sour cream, and/or sliced jalapenos.",
    "Recipe courtesy Jeb Woody, owner of Honey's Sit 'n' Eat, Philadelphia, PA."
  ],
  "ingredients": [
    "0",
    "1 (6 pound) chicken",
    "1 clove garlic, finely chopped",
    "2 tablespoon oil of choice",
    "1/2 cup chicken broth, divided",
    "3 dried guajillo peppers, finely chopped",
    "1 tablespoon tomato paste",
    "1/2 cup crushed tomatoes",
    "Oil or butter",
    "1/2 Spanish onion, diced",
    "1 bell pepper, diced",
    "1 cup crushed tomatoes",
    "1/4 teaspoon chili powder",
    "1/4 teaspoon ground cumin",
    "1/4 teaspoon salt",
    "1/4 teaspoon black pepper",
    "1/4 teaspoon cayenne pepper",
    "1 cup canned pinto beans",
    "1 cup canned black beans",
    "Corn chips (recommended: Fritos), shredded cheese, shredded lettuce, diced tomatoes, sour cream, sliced jalapenos",
    "This recipe was provided by professional chefs and has been scaled down from a bulk recipe provided by a restaurant. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results."
  ],
  "__v": 1
}