{
  "hash": "fc1891f7bc5c0f262a08858a45efa415d5a9246c",
  "title": "Nashville Hot Turkey",
  "image": "http://cdn-image.myrecipes.com/sites/default/files/styles/300x300/public/image/recipes/sl/14/11/nashville-hot-turkey-sl-x.jpg?itok=HWuIY7Nz",
  "href": "http://www.myrecipes.com/recipe/nashville-hot-turkey",
  "firstAdded": "2015-01-23T22:33:17.005000",
  "users": [
    null
  ],
  "keywords": [
    "peanut",
    "oil",
    "frozen",
    "turkey",
    "thawed",
    "kosher",
    "salt",
    "black",
    "pepper",
    "click",
    "savings",
    "bacon",
    "red",
    "dark",
    "brown",
    "sugar",
    "paprika",
    "garlic"
  ],
  "directions": [
    "0",
    "Pour oil into a deep propane turkey fryer 10 to 12 inches from top; heat to 350째 over a medium-low flame according to manufacturer's instructions (about 45 minutes).",
    "Meanwhile, remove giblets and neck from turkey; pat turkey dry. Stir together salt and pepper. Sprinkle 1 Tbsp. salt mixture inside cavity; rub into cavity. Sprinkle outside of turkey with remaining salt mixture; rub into skin. Let turkey stand at room temperature 30 minutes.",
    "Using long-handled tongs, carefully lower bacon, 1 slice at a time, into hot oil. Fry 1 to 2 minutes or until bacon is brown and crisp. Drain bacon on a paper towel-lined baking sheet; reserve bacon for another use.",
    "Place turkey on fryer rod. Carefully lower turkey into hot oil with rod attachment. Fry 35 to 45 minutes or until a meat thermometer inserted in thickest portion of turkey thigh registers 165째 (about 3 minutes per pound plus an additional 5 minutes). Keep oil temperature between 325째 and 345째. Remove turkey from oil; drain and let stand 30 minutes before carving. Reserve 1 cup frying oil from fryer.",
    "Stir together ground red pepper, brown sugar, paprika, and garlic powder in a medium saucepan. Carefully whisk in reserved 1 cup frying oil, and cook over low heat, stirring constantly, 5 minutes. Brush mixture over turkey, and serve immediately.",
    "Note: We tested with LouAna Peanut Oil."
  ],
  "ingredients": [
    "0",
    "Peanut oil (about 3 gal.)",
    "1 (12- to 14-lb.) whole fresh or frozen turkey, thawed",
    "2 tablespoons kosher salt",
    "2 teaspoons freshly ground black pepper $Click to see savings",
    "1 (1-lb.) package thick pepper bacon",
    "1/4 cup ground red pepper",
    "1 tablespoon dark brown sugar $Click to see savings",
    "1 teaspoon paprika",
    "1/2 teaspoon garlic powder"
  ],
  "__v": 1
}