{
  "hash": "a7490266f4a0a6b9d144fef28329de2cf129e5aa",
  "title": "April Bloomfield's lamb meatballs",
  "image": "http://fiveandspice.com/wp-content/uploads/2014/10/lamb-meatballs-1.jpg",
  "href": "http://fiveandspice.com/2014/10/09/april-bloomfields-lamb-meatballs/",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T22:19:08.972000",
  "users": [
    null
  ],
  "keywords": [
    "lbs",
    "lamb",
    "tbs",
    "flaky",
    "salt",
    "bread",
    "crumbs",
    "extra",
    "virgin",
    "olive",
    "oil",
    "onion",
    "garlic",
    "coriander",
    "cumin",
    "spicy",
    "red",
    "recipe",
    "calls",
    "dutch",
    "chilies",
    "pierced",
    "knife",
    "tomatoes",
    "plain",
    "wholemilk",
    "greek",
    "yogurt",
    "fried",
    "egg",
    "person",
    "mint",
    "cilantro",
    "didnt",
    "recent",
    "time",
    "meatballs",
    "definitely",
    "better"
  ],
  "directions": [
    "0",
    "Mix together the ground lamb with the 2½ Tbs. salt and the breadcrumbs. To quote Bloomfield: \"take a bit of the mixture in your hand, give it a few firm but still rather gentle squeezes and roll it into a ball (a little bigger than a golf ball). Overworking the mixture is bac and leads to tough meatballs, but this warning often makes cooks too timid when they form the balls: the outside of each ball should be smooth with no big cracks or crags.\" Now you know.",
    "Add the oil to a large Dutch oven or cast iron pan over high heat. When the oil is hot, cook the meatballs in batches - don't crowd them - turning them occasionally and making sure they get a shiny deep crust on all sides. It should take 12-15 minutes per batch(!). Remove the meatballs to a plate as they're finished and when you're done browning the meat, pour off about half of the fat in the pot.",
    "Lower the heat to medium-high, add the onion, garlic, and ½ tsp. of salt and cook until the onion is lightly browned, about 5 minutes. Add the spices and the peppers and cook for another minute. Then, squish the tomatoes in with your hands, breaking them into little pieces. Turn the heat down to a simmer and cook for 10 minutes.",
    "After 10 minutes, add 4 cups of water and bring the sauce to a boil, then turn it down to a simmer and simmer for 5 minutes. At this point, take two cups of the sauce, transfer it to a blender and blend it to a smooth sauce, then pour this back into the pot (yeah, this part's a bit fussy).",
    "Add the meatballs back to the pot along with any juices that have accumulate and give them a gentle stir. Cover and simmer the meatballs gently for about 30 minutes. This is where the flavor will all start to come together.",
    "To serve, add yogurt in blobs and sprinkle with the mint and cilantro. I like to serve these with either summer or winter squash. A side of couscous is nice too."
  ],
  "ingredients": [
    "0",
    "2½ lbs. ground lamb",
    "2½ Tbs. flaky sea salt",
    "about 1½ cups fine bread crumbs",
    "1 Tbs. extra virgin olive oil",
    "1 large onion, finely chopped",
    "5 garlic cloves, thinly sliced",
    "½ tsp. sea salt",
    "2 tsp. ground coriander",
    "1½ tsp. ground cumin",
    "2 spicy red chilies (the recipe calls for Dutch chilies) pierced all over with a knife.",
    "one 28-oz can of peeled whole tomatoes, drained",
    "plain whole-milk Greek yogurt for serving",
    "optional - a fried egg per person for serving",
    "a handful each of chopped mint and cilantro for garnish (I didn't have these the most recent time I made these meatballs, and it was fine without, but definitely better with)"
  ],
  "__v": 1
}