{
  "hash": "a660f803634bc0e7c6705994a1a6dfc186c22e52",
  "title": "Dishoom’s house black dal",
  "image": "https://i.guim.co.uk/img/media/3973a0bdfc1bed60f35e95c73db4c8d702d523bd/0_0_3479_3570/master/3479.jpg?width=300&quality=85&auto=format&fit=max&s=ed68acd375ff2d0fb6d9dfccbec56449",
  "href": "https://www.theguardian.com/food/2019/sep/07/four-classic-indian-recipes-dishoom-chaat-dal-salad-jackfruit-biyani-chicken-makhani-curry",
  "extension": "Chrome",
  "firstAdded": "2019-09-15T22:36:32.154000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Put the dal into a large bowl, cover with water and whisk for 10 seconds. Let the dal settle, then pour out the water. Repeat three or four times, until the water is clear. Tip the dal into a large saucepan and pour in at least four litres of cold water. Bring to a boil and cook steadily for two to three hours. Skim off any impurities that rise to the surface, and add more boiling water as required to keep the grains well covered. The dal grains need to become completely soft, with the skins coming away from the white grain. When pressed, the white part should be creamy, rather than crumbly. When cooked, turn off the heat and set aside for 15 minutes.",
    "In a bowl, mix the garlic and ginger pastes, tomato puree, salt, chilli powder and garam masala into a paste.",
    "Carefully pour off the dal cooking water, then pour on enough freshly boiled water to cover the dal by 3-4cm. Bring to a boil over a medium-high heat, then add the aromatic paste and butter. Cook rapidly for 30 minutes, stirring regularly to prevent the mixture from sticking.",
    "Lower the heat and simmer for one to one and a half hours more, stirring regularly to prevent it from sticking, and adding a little boiling water if the liquid level gets near the level of the grains. Eventually, the dal will turn thick and creamy. The creaminess must come from the grains disintegrating into the liquid and enriching it, not from the water being allowed to evaporate, leaving only the grains behind.",
    "Add the cream and cook for a further 15 minutes. Serve with chapatis or other Indian breads. When reheating any leftover dal, you may need to add a little more liquid; use cream or cream and water, rather than just water alone."
  ],
  "ingredients": [
    "0",
    "300g urad dal",
    "4 litres cold water",
    "12g garlic paste",
    "10g ginger paste",
    "70g tomato puree",
    "8g fine sea salt",
    "⅔ tsp deggi mirch chilli powder",
    "⅓ tsp garam masala",
    "90g unsalted butter",
    "90ml double cream",
    "Chapatis, to serve"
  ],
  "__v": 1
}