{
  "hash": "f4d0a7997510d5aca15678bbe86f770e06a9a04d",
  "title": "The Vegan Gutbuster Sandwich – Homemade Vegan Italian Sausage on Baguette",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2013/11/Vegan-Gutbuster-Sandwich.jpg",
  "href": "http://www.onegreenplanet.org/plant-based-recipes/the-vegan-gutbuster-sandwich-homemade-vegan-italian-sausage-on-baguette/",
  "extension": "Chrome",
  "firstAdded": "2015-05-01T12:10:05.973000",
  "users": [
    null
  ],
  "keywords": [
    "cannellini",
    "beans",
    "rinsed",
    "cold",
    "mushroom",
    "broth",
    "olive",
    "oil",
    "lowsodium",
    "soy",
    "vital",
    "wheat",
    "gluten",
    "nutritional",
    "yeast",
    "garlic",
    "fennel",
    "seed",
    "red",
    "pepper",
    "paprika",
    "oregano",
    "thyme",
    "parsley",
    "salt",
    "black",
    "french",
    "baguette",
    "lengthwise",
    "green",
    "bell",
    "yellow",
    "onion",
    "tomato",
    "mushrooms",
    "wedges",
    "vegan",
    "mozzarella",
    "cheese",
    "chiffonade",
    "basil"
  ],
  "directions": [
    "0",
    "First set up a steamer that can hold four large sausages. Bring the water to a boil. Set aside 4 square sheets of aluminum foil. This “dough” only takes a few minutes to prepare, so make sure the steamer is ready to go.",
    "In a large bowl, mash the beans. Add all the other ingredients to the beans in the order listed. I found it was easier to mix with my hands, like making meatloaf. Place one fourth of dough onto each of the foil squares and mold into approximately a 5 inch log. Wrap the dough in the foil by folding in the sides then rolling up the foil to make a cigar. The elasticity of the vital wheat gluten will help shape the sausage into a smooth log as it steams.",
    "Place wrapped sausages in the steamer and steam for 40 minutes. Let cool to room temperature and refrigerate overnight.",
    "Unwrap the chilled sausages and let come to room temperature. Saute in canola oil over medium-high heat until brown and crispy on all sides, the interior will remain moist. Drain on paper towels while assembling the Gutbuster.",
    "1",
    "Saute green bell pepper and onion in olive oil until soft. Add oregano, red pepper flakes, salt, and pepper to taste. Stir in tomato sauce to coat the vegetables, then keep warm. Meanwhile saute mushrooms in olive oil until golden, season with salt and pepper.",
    "Cut the baguette into slices about the same length as the sausages. Brush the baguette with olive oil and toast until golden brown. Place the hot sausage on the bread. Top with green pepper/onion mixture on one side, mushrooms and tomatoes on the other side. Secure the sandwich with picks. Top with vegan mozzarella and place under the broiler until the cheese starts to melt. Garnish with fresh basil."
  ],
  "ingredients": [
    "0",
    "1 can cannellini beans, rinsed and drained",
    "1 c. cold mushroom broth",
    "1 T. olive oil",
    "2 T. low-sodium soy sauce",
    "1 1/4 c. vital wheat gluten",
    "1/4 c. nutritional yeast",
    "4 cloves fresh garlic, minced",
    "2 t. toasted fennel seed, crushed",
    "1 t. red pepper flakes",
    "1 t. sweet paprika",
    "1 t. dried oregano",
    "1 t. fresh thyme, chopped",
    "1 T. fresh parsley, chopped",
    "salt & fresh ground black pepper",
    "1",
    "french baguette, sliced in half lengthwise",
    "olive oil",
    "green bell pepper, sliced",
    "yellow onion, sliced",
    "dried oregano",
    "red pepper flakes",
    "tomato sauce",
    "sliced mushrooms",
    "tomato, cut into small wedges",
    "vegan mozzarella cheese, shredded",
    "chiffonade of fresh",
    "basil",
    "salt and pepper"
  ],
  "__v": 1
}