{
  "hash": "4778bfb1f76ea47dc50a34e854d43f67c664716b",
  "title": "Stuffed Zucchini",
  "image": "http://img.sndimg.com/food/image/upload/w_555,h_416,c_fit,fl_progressive,q_95/v1/img/recipes/32/08/0/iIfa2aqqTMKdn0uNbtnn_190%20stuffed%20zucchini.jpg",
  "href": "http://www.food.com/recipe/drop-dead-delicious-stuffed-zucchini-32080",
  "extension": "Chrome",
  "firstAdded": "2016-07-22T00:49:36.443000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Wash zucchini, and put in a pot of cold water (do not remove ends).",
    "Bring to a boil and cook until tender, about 10-15 minutes, maybe a little longer depending on the size of your zucchini.",
    "Meanwhile, heat olive oil in a fairly large skillet.",
    "Saute garlic first, then add onions, green pepper, thyme, and oregano.",
    "When the veggies begin to soften, add ground meat (or whatever you are using), season with salt and pepper, and brown until cooked through.",
    "Drain off any excess grease.",
    "Set aside to cool slightly.",
    "When the zucchini have cooked through, remove from water, and allow to cool enough to handle.",
    "Slice cooled zucchini lengthwise, and scoop out center, leaving a little veggie flesh to form a\"boat.",
    "\"Mix ground meat mixture with the red peppers, and the scooped out zucchini (chopped), and the egg.",
    "Fill the zucchini boats with the mixture, and top each with a slice of cheese.",
    "Bake in a 375ºF oven for 20-30 minutes, until heated through, and cheese begins to bubble and brown.",
    "Serve hot.",
    "Note: If making this dish with tuna or fish, I like to add a little mayo or garlic mayo, and substitute the raw egg for a hard boiled and chopped one."
  ],
  "ingredients": [
    "0",
    "4 medium zucchini",
    "1 medium onion, minced",
    "1 (7 ounce) can roasted red peppers, chopped",
    "1⁄2 green pepper, chopped",
    "2 garlic cloves",
    "1 egg, beaten",
    "2 thyme, sprigs",
    "1⁄4-1⁄2 teaspoon oregano",
    "salt and pepper",
    "3⁄4 lb ground beef (or chicken, turkey, fish, 1 can of tuna, or other veggies...you get the idea)",
    "2 tablespoons olive oil",
    "8 slices cheese (any kind really, we use Gouda or Gruyere, though this really is a matter of personal preference)"
  ],
  "__v": 1
}