{
  "hash": "9217a0c175964cd4ca50d9c4ed4f71f0acfb6bd3",
  "title": "Creamy Vegan Queso",
  "image": "https://cookieandkate.com/images/2017/04/healthy-queso-recipe-4.jpg",
  "href": "https://cookieandkate.com/2017/vegan-queso-recipe/",
  "extension": "",
  "firstAdded": "2018-05-01T16:35:30.596000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large saucepan, warm the olive oil over medium heat. Add the onion and a pinch of salt and cook, stirring often, until the onion is tender and turning translucent, about 5 minutes.",
    "Add the grated potato, garlic, paprika, chili powder, cumin, garlic powder, onion powder and salt. Stir to combine, and cook, stirring constantly, for 1 to 2 minutes to enhance their flavors.",
    "Add the cashews and water, and stir to combine. Let the mixture come to a simmer. Continue simmering, stirring frequently and reducing heat as necessary to avoid a rapid boil, until the potatoes are completely tender and cooked through, about 5 to 8 minutes.",
    "Carefully pour the mixture into a blender, but keep the pot handy for later. Add the nutritional yeast, sun-dried tomatoes, hot sauce and vinegar. Blend until the mixture is completely smooth, about 2 minutes, stopping to scrape down the sides if necessary. If the mixture won’t blend easily or if you would prefer a thinner consistency, add water in ¼ cup increments, blending after each one.",
    "Taste, and blend in additional salt until the queso is utterly irresistible (I typically add about ½ teaspoon more). Pour the mixture back into the pot and add the tomatoes or salsa and jalapeños, if using. Cook over medium heat, stirring constantly, until the mixture is very warm.",
    "To serve it as a dip, transfer to a serving bowl and top with any garnishes you’d like. Or to make nachos, drizzle it generously over a bed of tortilla chips and garnish as desired. Serve immediately. Leftovers taste even better the next day! Store cooled leftover queso in a bowl, covered, in the refrigerator for up to 5 days. Gently reheat on the stove or in the microwave, stirring frequently, until warmed throughout."
  ],
  "ingredients": [
    "0",
    "2 tablespoons avocado oil or extra-virgin olive oil",
    "1 medium yellow onion, chopped",
    "1 cup peeled and grated russet potato (4 ounces, about 1 small or ½ medium potato), preferably organic",
    "4 cloves garlic, pressed or minced",
    "½ teaspoon smoked paprika",
    "½ teaspoon ground chili powder",
    "½ teaspoon ground cumin",
    "½ teaspoon garlic powder",
    "½ teaspoon onion powder",
    "½ teaspoon salt, more to taste",
    "1 cup (5 ounces) raw cashews*",
    "1 ½ cups water, more as necessary",
    "¼ cup nutritional yeast",
    "1 tablespoon rinsed oil-packed sun-dried tomatoes",
    "2 teaspoons hot sauce (I used Chipotle)",
    "1 teaspoon white wine vinegar or distilled white vinegar",
    "⅔ cup well-drained fire-roasted tomatoes (I recommend Muir Glen brand) or chunky salsa",
    "2 tablespoons chopped pickled jalapeños, optional",
    "Optional toppings: additional fire-roasted tomatoes or salsa or chopped fresh tomatoes, chopped fresh cilantro, thinly sliced fresh jalapeños or pickled jalapeños, and/or finely chopped red onion"
  ],
  "__v": 1
}