{
  "hash": "1f32347a10f30bb2a828d83879aafc758c2b7959",
  "title": "Berry Bomb Pops",
  "image": "https://cdn.ruled.me/wp-content/uploads/2017/06/berry-bomb-pops-second.jpg",
  "href": "https://www.ruled.me/berry-bomb-pops/",
  "extension": "Chrome",
  "firstAdded": "2018-04-16T12:17:38.761000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place the raspberries, ½ cup water, and ½ teaspoon liquid stevia in a small saucepan. Bring the mixture to a boil over medium-high heat. Simmer for about 5 minutes until the fruit starts to break down and a little of the liquid has been reduced.",
    "Remove from the heat and use an immersion blender (or blender) to make a smooth red puree.",
    "Repeat the above process with the blueberries. Place the blueberries, ½ cup water and ½ teaspoon liquid stevia in a small saucepan over medium-high heat. Simmer for about 5 minutes.",
    "Remove from the heat and use an immersion blender (or blender) to make a smooth blue puree. Set aside to cool or place in the refrigerator until ready to use.",
    "While the fruit is cooking mix the coconut cream, ½ teaspoon liquid stevia and vanilla extract in a separate small bowl. Set aside or place in the refrigerator until ready to use.",
    "To assemble the popsicles start by dividing the raspberry puree into the molds. Carefully add approximately 2-3 full tablespoons of mixture into the center of each mold, filling about ? full.",
    "Place the molds into the freezer and chill for at least 1 hour until set.",
    "Using the same spoon method divide the coconut cream into the molds, about 3-4 tablespoons in each. Try to work quickly so the raspberry layer doesn’t melt and bleed into the coconut.",
    "Place back in the freezer for about 30 minutes until partially set. This is the only time you really need to watch them. The coconut layer should be firm enough to hold the popsicle sticks but soft enough they can still be inserted.",
    "Add one stick to each mold, leaving a little bit of stick poking above the top (to hold it by) and place back into the freezer for at least another hour until completely solid.",
    "Finally add the blueberry puree using the same spoon method, about 2-3 full tablespoons in each.",
    "Place the molds back in the freezer until completely set, at least another 1-2 hours."
  ],
  "ingredients": [
    "0",
    "1 cup frozen raspberries",
    "1 cup frozen blueberries",
    "1 cup water, divided",
    "1 ½ teaspoons liquid stevia, divided",
    "1 ½ cups canned coconut cream",
    "½ teaspoon vanilla extract",
    "Popsicle molds and sticks"
  ],
  "__v": 1
}