{
  "hash": "64231a790960883f78d2359eeb9705596f56d580",
  "title": "Turkey meatballs and kale in lemon broth",
  "image": "//i.guim.co.uk/static/w-620/h--/q-95/sys-images/Guardian/About/General/2015/1/13/1421165700735/Yotam-Ottolenghis-turkey--012.jpg",
  "href": "http://www.theguardian.com/lifeandstyle/2015/jan/16/winter-broth-recipes-yotam-ottolenghi",
  "firstAdded": "2015-01-19T21:01:53.940000",
  "users": [
    null
  ],
  "keywords": [
    "turkey",
    "meatballs",
    "kale",
    "lemon",
    "broth",
    "iranian",
    "distinctive",
    "ingredient",
    "spread",
    "wonderfully",
    "unique",
    "sharp",
    "sweetly",
    "aromatic",
    "stew",
    "middle",
    "eastern",
    "grocers",
    "online",
    "theres",
    "really",
    "alternative",
    "flavour",
    "texture",
    "improves",
    "soup",
    "set",
    "aside",
    "hour",
    "removing",
    "limes",
    "adding",
    "juice",
    "minute",
    "serves",
    "thigh",
    "breast",
    "mince",
    "white",
    "breadcrumbs",
    "spring",
    "onions",
    "trimmed",
    "parsley",
    "picked",
    "tarragon",
    "allspice",
    "salt",
    "black",
    "pepper",
    "oil",
    "stalks",
    "discarded",
    "leaves",
    "widthways",
    "strips",
    "litre",
    "unsalted",
    "chicken",
    "stock",
    "prunes",
    "berries",
    "cardamom",
    "pods",
    "star",
    "anise",
    "rind",
    "shaved",
    "long",
    "pierced",
    "times",
    "lightly",
    "bashed",
    "rolling",
    "pin",
    "chickpeas",
    "rinsed"
  ],
  "directions": [
    "0",
    "Combine the first six ingredients in a large bowl with a teaspoon of salt and a good grind of black pepper, then roll into 4cm wide balls, weighing about 30g each: you should have about 20. Refrigerate for 30 minutes.",
    "Add the oil to a large frying pan and put on a medium-high heat. Once hot, fry the meatballs for seven to eight minutes, turning them throughout so they go golden-brown on all sides, then transfer to a plate lined with kitchen paper.",
    "Fill a large saucepan with salted water and bring to a boil. Add the kale, blanch for two minutes, drain, refresh, drain again and set aside.",
    "Return the saucepan to a medium-high heat and pour in the stock and a litre of water. Add the prunes, allspice, cardamom, star anise, lemon rind, Iranian limes and half a teaspoon of salt. Bring to a boil, then lower the heat to medium and simmer gently for 30-35 minutes, until the liquid has reduced by half. Press the dried limes and prunes with the back of a spoon, to help release their flavour, then strain into a large bowl and discard the prunes, spices, lemon rind and limes. Return the stock to the pan, add the chickpeas and meatballs, and simmer for 10 minutes. Add the lemon juice and kale, stir for a couple of minutes, to warm the kale through, and serve at once."
  ],
  "ingredients": [
    "0",
    "Turkey meatballs and kale in lemon broth",
    "Dried Iranian limes are a distinctive ingredient that spread their wonderfully unique sharp and sweetly aromatic flavour throughout any stew or soup: get them from Middle Eastern grocers or online. (There’s really no alternative here.) The flavour of the broth and the texture of the meatballs improves if the soup is set aside for an hour or two after removing the limes and before adding the kale and lemon juice, which should go in only at the very last minute. Serves four to six.",
    "500g turkey thigh (or breast) mince",
    "30g fresh white breadcrumbs",
    "3 spring onions, trimmed and finely chopped",
    "15g parsley, picked and finely chopped",
    "10g tarragon, picked and finely chopped",
    "1 tsp ground allspice",
    "Salt and freshly ground black pepper",
    "1 tbsp vegetable oil",
    "250g kale, thick stalks discarded, leaves cut widthways into 5cm strips",
    "1 litre unsalted chicken stock",
    "10 prunes",
    "1 tsp allspice berries",
    "10 cardamom pods",
    "6 star anise",
    "1 lemon, rind shaved into long, thin strips, plus 2½ tbsp lemon juice",
    "2 dried Iranian limes, pierced a few times or lightly bashed with a rolling pin",
    "480g cooked chickpeas (or 2 cans), rinsed and drained"
  ],
  "__v": 1
}