{
  "hash": "08bccbd95cbc42755dde9b21d9453a4ffb82ce80",
  "title": "WHITE SAUCE PIZZA WITH SAUSAGE & BRUSSEL SPROUTS",
  "image": "https://static1.squarespace.com/static/5a45133832601e14c4a7d06e/t/5a4e9922005559236df8e5ba/1515120094620/white-sauce-pizza.jpg?format=750w",
  "href": "https://www.foodpleasureandhealth.com/blog/2013/10/healthy-white-sauce-pizza-with-sausage-brussel-sprouts.html",
  "extension": "",
  "firstAdded": "2018-05-08T16:13:30.442000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Get the dough ready so it has maximum time to rise (or thaw if frozen) - In a medium saucepan, pour milk, cauliflower, garlic cloves and allow it to simmer for about 5 minutes. - Add cheese, peppers, and oregano and continue simmering until cauliflower softens up a little bit (additional 15 minutes). - In the meanwhile, cook sausage in a little bit oil. Remove from heat and set aside. - Saute Brussels sprouts in the remaining oil until it is wilted. - Remove sauce from heat and once it cools down a little bit, blend it until its really smooth. Adjust salt and seasonings as necessary. - In a pre-heated oven at 500F (or per your crust's instructions), bake the crust until it is slightly browned (10-12 minutes). - Remove from the oven then spread about 3/4 cup of sauce evenly on the crust. - Arrange sausage, Brussels sprouts, and cheese then bake for another 5 minutes or until cheese melts completely. - Slice, serve, enjoy.",
    "On a scale of 1-10, where does your love for pizza stand? Red sauce or White?",
    "PS- I miss my pizza night partner"
  ],
  "ingredients": [
    "0",
    "For the white sauce: (makes about 2.5 cups total and I used about 3/4 cups)",
    "about 2 cups cauliflower, chopped into small pieces (1/2 cauliflower head) 2 cups 2% milk (or use milk of your choice) 3/4 cups parmesan cheese, shredded 3 garlic cloves, sliced generous amount of pepper 1 dried red chili pepper (optional) 1 teaspoon dried oregano oil or cooking spray (to cook toppings) pinch of salt",
    "For the crust: I used this but feel free to use whatever you like",
    "Toppings: 2 chicken sausage, thinly sliced 1 cup shredded Brussels sprouts 1/2 cup part skim shredded Mozzarella cheese"
  ],
  "__v": 1
}