{
  "hash": "634c39c425d8636435a9d7e866413d91f24bb545",
  "title": "Soft Pumpkin Cookies - Gluten Free & Vegan",
  "image": "http://www.tessadomesticdiva.com/wp-content/uploads/2013/10/Soft-Pumpkin-Cookies-Gluten-Free-Vegan-4239-682x1024.jpg",
  "href": "http://www.tessadomesticdiva.com/2013/10/soft-pumpkin-cookies-gluten-free-vegan.html",
  "extension": "Chrome",
  "firstAdded": "2016-10-29T23:03:59.679000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat your oven to 350 degrees.",
    "In a bowl of mixer, beat the fat and sugar until creamy.",
    "Add in the pumpkin and vanilla.",
    "With the mixture still running, sprinkle in the cinnamon, baking soda, powder, salt, and guar gum.",
    "Continue with the flours.",
    "Beat well, and then reduce the speed and mix in the chocolate chips as preferred.",
    "Using a scant tablespoon, drop the stiff and sticky dough onto a cookie sheet. These cookies do not spread or move much, so they can be quite cozy together on the sheet.",
    "With damp fingers, slightly press the cookies down to flatten to a uniform depth.",
    "Bake for about 8 minutes, remove and let cool for a few minutes before transferring to a cooling rack. They will look barely done...that is ok, you don't want to over-bake these little morsels!"
  ],
  "ingredients": [
    "0",
    "½ cup any mix of palm shortening, coconut oil, or vegan butter",
    "¾ cup palm sugar (or brown sugar)",
    "½ cup fresh pumpkin puree (see link above for how to make: MINE ALMOST POURS, if you are using a variety that is super stiff and dry, it contains less water)",
    "2 teaspoons vanilla extract",
    "1 teaspoon cinnamon",
    "½ teaspoon EACH baking soda, baking powder, sea salt, & guar gum",
    "⅓ cup EACH tapioca flour, sorghum flour, brown rice flour - if your pumpkin puree is very soft and pourable, you made need to add an additional ¼-1/3 cup here, do a test cookie to be sure!)",
    "½ cup (or more) chocolate chips, raisins, or cranberries"
  ],
  "__v": 1
}