{
  "hash": "85b0cabb47500c7c6b7ff83143f210642143af63",
  "title": "Chunky S'mores Dipped Cupcakes",
  "image": "http://recipe-folder.com/img/recipe-images/053/945/1565879453.jpeg",
  "href": "http://snappygourmet.com/2011/05/25/chunky-s%E2%80%99mores-dipped-cupcakes/",
  "firstAdded": "2015-01-03T01:42:24.629000",
  "users": [
    null
  ],
  "keywords": [
    "cracker",
    "crumbs",
    "sheets",
    "graham",
    "crackers",
    "allpurpose",
    "flour",
    "baking",
    "soda",
    "salt",
    "unsalted",
    "butter",
    "softened",
    "granulated",
    "sugar",
    "eggs",
    "vanilla",
    "milk",
    "containers",
    "marshmallow",
    "fluff",
    "confectioners",
    "mini",
    "chocolate",
    "chips",
    "candy",
    "melts"
  ],
  "directions": [
    "0",
    "Preheat oven to 350 degrees F. Line a cupcake pan(s) with 20 paper liners.",
    "Whisk together graham cracker crumbs, flour, baking powder, baking soda, and ¼ teaspoon salt in a small bowl until well combined.",
    "In a large mixing bowl, beat together ¾ cup butter and granulated sugar with an electric mixer on medium speed until well combined. Beat in eggs one at a time until combined. Beat in 2 teaspoons vanilla. Alternate beating in 1¼ cup milk and flour mixture until combined.",
    "Spoon cake batter into paper liners. Bake at 350 degrees F for about 20-25 minutes or until golden brown on top and toothpick comes out clean when inserted into middle of cupcakes. Cool completely.",
    "Meanwhile, prepare frosting by beating together marshmallow fluff and 2 cups butter in large mixing bowl with electric mixer on medium speed until well combined. Beat in 2 teaspoons vanilla and ½ teaspoon salt. Beat in confectioners’ sugar until well combined. Beat in milk 1 tablespoon at a time until frosting just comes together. Refrigerate frosting for about 30 minutes or until firmer.",
    "Spoon or pipe frosting (see notes below) onto cupcakes to desired height. Refrigerate again for about 30 minutes or until frosting is firm (or freeze for about 15-20 minutes.).",
    "When frosting on cupcakes is firm enough to turn upside down, melt chocolate. I suggest using a double boiler (rather than the microwave) so that chocolate stays warm and smooth while dipping cupcakes. Dip cupcakes in chocolate letting extra chocolate to run off before placing cupcakes on a baking sheet (or dish). Sprinkle graham cracker crumbs on top of cupcakes if desired while chocolate is still warm, then place cupcakes in refrigerator for a few minutes for chocolate to firm."
  ],
  "ingredients": [
    "0",
    "2¼ cup graham cracker crumbs (about 20 whole sheets graham crackers)",
    "¾ cup all-purpose flour",
    "2 teaspoons baking powder",
    "1 teaspoon baking soda",
    "¼ teaspoon salt",
    "¾ cup unsalted butter, softened",
    "1 cup granulated sugar",
    "3 eggs",
    "2 teaspoons vanilla",
    "1¼ cup milk",
    "1",
    "2 (16oz) containers marshmallow fluff",
    "2 cups unsalted butter, softened",
    "2 teaspoons vanilla",
    "½ teaspoon salt",
    "8 cups confectioners’ sugar",
    "2-3 tablespoons milk",
    "4 cups chopped chocolate (or chocolate chips or mini chocolate chips)",
    "2",
    "Melted chocolate (such as 3-4 14oz. bags chocolate candy melts)",
    "3",
    "Graham cracker crumbs"
  ],
  "__v": 1
}