{
  "hash": "a73d0500c0cd9f79aa4a398b6ee400033ce02876",
  "title": "Aubergines with olive oil, garlic, parsley & feta cheese",
  "image": "https://cook-recipe.com/wp-content/uploads/2019/01/22-150x150.jpg",
  "href": "https://cook-recipe.com/aubergines-with-olive-oil-garlic-parsley-feta-cheese/",
  "extension": "",
  "firstAdded": "2019-01-09T17:06:22.780000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Heat an overhead grill to medium hot.",
    "Run a small, sharp knife round the neck of each aubergine, about a quarter inch below the stalk and only just cutting through the skin.",
    "Then make 4 evenly spaced, shallow cuts along the length of the aubergine",
    "right down to the bulbous end. Grill them, turning every 5–7 minutes or so, until evenly cooked and the aubergine feels soft but not too collapsed within. In the case of the purple aubergines, their skins will also have turned a dull brown color.",
    "Transfer to a large, oval white plate and allow to cool for a couple of minutes. Now, using a small knife, deftly lift o틱 the skin in 4 long, narrow sheets and discard (this peeling a틱air is an extremely pleasurable task). Without cutting right through the stalk end, cut the aubergine in half lengthways and gently pry apart until you have 2 horizontal halves, but remaining attached at the top end; a kind of elongated heart shape, if you like.",
    ". Mix the garlic and parsley with the olive oil and spoon over the assembly. Season lightly with salt (the cheese is salty anyway) and pepper, crumble feta cheese over the top and squeeze over some lemon juice. If necessary, trickle over more olive oil to nish. Serve warm, or at room temperature."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "4 long, thin-skinned purple aubergines",
    "1-2 garlic cloves, finely chopped",
    "handful parsley leaves, finely chopped",
    "little sea salt and black pepper",
    "3-5 oz feta cheese",
    "5–6 tbsp extra virgin olive oil",
    "lemon for serving"
  ],
  "__v": 1
}