{
  "hash": "87163ee6f11b3a7d8b3c3bf6c7a4662b9682cd10",
  "title": "Homemade Oreo Cookies",
  "image": "http://www.errenskitchen.com/wp-content/uploads/2014/05/Homemade-oreos.jpg",
  "href": "http://www.errenskitchen.com/homemade-oreo-cookies/",
  "extension": "Chrome",
  "firstAdded": "2015-05-25T02:09:30.894000",
  "users": [
    null
  ],
  "keywords": [
    "cupsg",
    "cocoa",
    "allpurposeplain",
    "flour",
    "dusting",
    "baking",
    "salt",
    "cupg",
    "butter",
    "softened",
    "granulated",
    "sugar",
    "soft",
    "brown",
    "egg",
    "yolk",
    "vanilla",
    "instant",
    "coffee",
    "dissolved",
    "water",
    "ozg",
    "rolling",
    "fondant",
    "icing"
  ],
  "directions": [
    "0",
    "Sift together the cocoa powder, flour, baking powder, salt in a large bowl, and set aside",
    "In a large mixing bowl, cream the butter, sugar and brown sugar. Add the egg & yolk one at a time, then the vanilla, followed by the instant coffee, mixing in each ingredient before adding the next.",
    "Add the dry ingredients and mix until incorporated.",
    "Divide the dough into 2 pieces, wrap with plastic wrap and cool in the refrigerator at least 1 hour.",
    "Knead the dough slightly to help soften and avoid cracks when rolling.",
    "Place one piece between 2 lightly floured sheets of parchment paper and roll into a ¼-inch-thick rectangle. Repeat with the other piece of dough.",
    "Using a 2 inch round cookie cutter, cut the dough into about 64 circles. Any scraps will have to be re-chilled before you can re-roll it.",
    "Place the cookies about 2 inches apart on ungreased baking sheets and chill for 20 minutes.",
    "Preheat the oven to 325f/165c.",
    "Bake the cookies until they are set (about 20 minutes) be sure not to let them get too dark or the cookie will become bitter.",
    "Cool completely on cooling racks.",
    "For the Filling:",
    "Roll out the fondant, using icing sugar for rolling (not flour) to just over a quarter of an inch thickness and cut into circles using the same cookie cutter as for the cookies.",
    "Brush one side of the fondant with a little milk and press this onto the bottom of one cookie.",
    "Brush the other side of the fondant with a little water and place the bottom of a second cookie, pressing gently to secure the sandwich.",
    "Repeat with the remaining cookies, re-rolling the fondant if needed."
  ],
  "ingredients": [
    "0",
    "1¼ cups/155g cocoa powder",
    "1½ cups/190g all-purpose/plain flour, plus more for dusting",
    "½ teaspoon baking powder",
    "¼ teaspoon salt",
    "1 cup/228g butter, softened",
    "1½ cups/300g granulated sugar",
    "½ cup/110g soft brown sugar",
    "1 large egg",
    "1 egg yolk",
    "1 teaspoon vanilla extract",
    "½ teaspoon instant coffee, dissolved into ½ teaspoon warm water",
    "6oz/170g rolling fondant icing"
  ],
  "__v": 1
}