{
  "hash": "38b540dc9cb5575da867fe791c41a0f38b6ea94d",
  "title": "Beef Rice Paper Rolls",
  "image": "http://recipe-folder.com/img/recipe-images/028/093/3048560428.jpg",
  "href": "http://recipe-folder.com/recipe/5c92dc0003e4741f30e5e0c1",
  "extension": "User Added",
  "firstAdded": "2019-03-21T00:34:08.425000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the oil in a wok over high heat. Add the garlic and stir-fry for 30 seconds or until aromatic. Add the mince and stir-fry, breaking up lumps with a wooden spoon, for 5 minutes or until it changes colour. Add the sugar and reduce heat to medium-low. Cook, stirring often, for 10 minutes or until beef is caramelised. Stir in the fish sauce and season with salt and white pepper. Set aside to cool to room temperature.",
    "1",
    "Meanwhile, place the noodles in a heatproof bowl. Add enough boiling water to cover. Set aside for 15 minutes to soak. Drain. Use scissors to cut into smaller lengths. Set aside.",
    "2",
    "Soak a rice paper wrapper in warm water for 10-20 seconds. Transfer to a clean tea towel to absorb excess water. Place a little of the noodles in the centre of the wrapper. Add about 1 tablespoon each of the mince and coleslaw. Top with 2 mint leaves. Fold in the ends and roll up to enclose filling. Place on a plate and cover with a slightly damp cloth to prevent drying out. Continue with remaining wrappers and fillings. Scatter with chilli and extra mint. Serve with the dipping sauce."
  ],
  "ingredients": [
    "0",
    "1 tablespoon peanut oil",
    "1",
    "2 large garlic cloves, finely chopped",
    "2",
    "350g beef mince",
    "3",
    "70g (1/3 cup) caster sugar",
    "4",
    "1 tablespoon fish sauce",
    "5",
    "Ground white pepper",
    "6",
    "60g rice vermicelli noodles",
    "7",
    "12 round 22cm rice paper wrappers",
    "8",
    "100g (1 1/4 cups) rainbow coleslaw",
    "9",
    "24 fresh mint leaves, plus extra, to serve",
    "10",
    "Sliced fresh red chilli, to serve",
    "11",
    "Vietnamese dipping sauce, to serve"
  ],
  "__v": 1,
  "hidden": true
}