{
  "hash": "b9eb93c942a1ac806a65883b99992e98599f0b8f",
  "title": "Crispy Asian Brussels Sprouts",
  "image": "",
  "href": "http://thebakermama.com/recipes/crispy-asian-brussels-sprouts/",
  "extension": "Chrome",
  "firstAdded": "2016-10-02T15:28:51.370000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400°F and set a rack on the very top.",
    "Prepare the brussels by cutting off the base of each sprout, slicing them in half from top to bottom and remove the excess or loose exterior leaves.",
    "Soak the cut brussels for a minute in water to clean them.",
    "Drain and spread Brussels out on a paper towel to dry while the oven is preheating.",
    "Cover a large rimmed baking sheet with foil (makes cleaning it easier later on) and spread the brussels out on the pan.",
    "Generously drizzle the brussels with the oil and sprinkle with kosher salt. Stir with your hands to ensure brussels are all well-oiled and salted.",
    "Place in the oven on the top rack for about 45-60 minutes. After 20 and 40 minutes, stir the brussels to ensure all sides get crispy and charred.",
    "During the last 5-10 minutes of cooking, reduce remaining ingredients (soy sauce, maple syrup, garlic, sriracha, lemon juice and black pepper) in a sauté pan over medium-high heat until sauce is thickened, about 5 minutes.",
    "Remove brussels from the oven once all brussels are crispy and slightly charred.",
    "Place them in a bowl and toss with some of the reduced sauce. Do this a little at a time as you don’t want the brussels to be soaked in sauce so they retain their crispy texture. You may have a little leftover sauce. Eat & enjoy!"
  ],
  "ingredients": [
    "0",
    "1 pound fresh brussels sprouts",
    "3 tablespoons vegetable oil (or other high-heat oil such as grapeseed)",
    "3 tablespoons soy sauce (you can also use fish sauce here if you want something with a bit more flavor)",
    "2 tablespoons maple syrup",
    "2 tablespoons fresh squeezed lemon juice (about half a large lemon)",
    "1 garlic clove, minced",
    "1 tablespoon Sriracha sauce",
    "Pinch of black pepper",
    "Kosher salt"
  ],
  "__v": 1
}