{
  "hash": "f3c0c1076c08495e0e76483ba5e185241d476536",
  "title": "Lemony chicken stew with giant couscous",
  "image": "http://www.bbcgoodfood.com/sites/bbcgoodfood.com/files/recipe_images/lemony-chicken-stew-with-giant-couscous.jpg",
  "href": "http://www.bbcgoodfood.com/recipes/lemony-chicken-stew-giant-couscous",
  "extension": "",
  "firstAdded": "2015-05-05T18:06:13.954000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "onions",
    "skinless",
    "boneless",
    "chicken",
    "thighs",
    "chunks",
    "tagine",
    "ras",
    "hanout",
    "tomato",
    "mixed",
    "olives",
    "oregano",
    "leaves",
    "picked",
    "lemons",
    "flesh",
    "skin",
    "rinsed",
    "clear",
    "honey",
    "stock",
    "cube",
    "giant",
    "couscous",
    "parsley"
  ],
  "directions": [
    "0",
    "Heat the oil in a large flameproof casserole dish with a lid. Add the onions and cook for 10 mins until starting to caramelise. Push the onions to one side of the dish and add the chicken. Cook over a high heat for 5 mins\nor so until the chicken is browning.",
    "Add the tagine paste, tomatoes, oregano, preserved lemons and honey, and crumble in the stock cube. Fill one of the tomato cans halfway with water and pour this into the dish. Season with a little salt and plenty of black pepper. Give everything a good stir, then cover with a lid and simmer for 40 mins, on a gentle bubble, or for up to 4 hrs over a very low heat if you’re eating at different times.",
    "Add the couscous 10 mins before you’re ready to serve, cover and simmer for 10 mins or until cooked. If you’re eating at different times, scoop your portion into a pan, add 50g couscous and cook in the same way. Stir in some parsley just before serving."
  ],
  "ingredients": [
    "0",
    "1 tbsp olive oil",
    "2 onions, chopped",
    "500g skinless boneless chicken thighs, each cut into 2-3 chunks",
    "3 tbsp tagine paste or 2 tbsp ras el hanout",
    "2 x 400g cans tomato with chopped mixed olives",
    "small handful fresh oregano, leaves picked and chopped",
    "2 preserved lemons, flesh removed, skin rinsed and finely chopped",
    "2 tbsp clear honey",
    "1 chicken stock cube",
    "200g giant couscous",
    "handful parsley, chopped"
  ],
  "__v": 1
}