{
  "hash": "2f8452efe36fe3c5f5a802b2ac5a3b8a44df6d22",
  "title": "SHRIMP TACOS WITH AVOCADO SALSA VERDE",
  "image": "https://reciperunner.com/wp-content/uploads/2018/03/Shrimp-Tacos-Avocado-Salsa-Verde-Photo-680x984.jpg",
  "href": "https://reciperunner.com/shrimp-tacos-with-avocado-salsa-verde/",
  "extension": "",
  "firstAdded": "2018-04-30T22:52:15.208000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Avocado Salsa Verde:",
    "Preheat oven to 425° F. Put the onion, jalapeño, and tomatillos on a rimmed baking sheet lined with foil. Drizzle with olive oil, season with salt and pepper and toss together until coated. Roast for approximately 8-10 minutes or until the vegetables are soft. Remove from the oven and let them cool for a few minutes.",
    "Add the roasted vegetables and the remaining ingredients to a food processor or blender. Pulse or blend until the salsa is mostly smooth. Taste for seasoning and set aside until ready to use.",
    "Shrimp Tacos:",
    "Heat 2 teaspoons of olive oil in a large skillet over medium-high heat. In a large bowl toss together the shrimp, cumin, chili powder, salt and pepper until coated. Cook the shrimp until translucent, about 1 1/2 to 2 minutes on each side.",
    "Char the tortillas over an open flame on a gas stove or grill or warm them in the microwave wrapped in a damp paper towel until they are pliable. Fill the tortillas with 3 shrimp and top with the avocado salsa verde, chopped red onions, cilantro and diced avocado. Serve with a lime wedge on the side."
  ],
  "ingredients": [
    "0",
    "AVOCADO SALSA VERDE",
    "1/2 of a red onion, cut into quarters",
    "1 jalapeño, deseeded and halved lengthwise",
    "6 tomatillos, husk removed, rinsed and cut in half",
    "1/2 of a small avocado",
    "1/4 cup cilantro",
    "1/2 of a lime, juiced",
    "1/4 teaspoon garlic powder",
    "Kosher salt and fresh ground black pepper to taste",
    "SHRIMP TACOS",
    "1 pound peeled and deveined shrimp (approximately 24)",
    "2 teaspoons olive oil",
    "1 teaspoon ground cumin",
    "1/2 teaspoon chili powder",
    "Kosher salt and fresh ground black pepper to taste",
    "8 corn tortillas",
    "Cilantro, red onion, diced avocado and lime for toppings"
  ],
  "__v": 1
}