{
  "hash": "092b159ead36c6934bb907cabfbb3991bb183599",
  "title": "Shepherd’s Pie with Cheese Champ Topping",
  "image": "http://cdn.lifestyle.com.au/cache/620x310/recipes/thumbnails/GordonRamsay-Shepards-pie-with-cheese-champ-toppping.jpg",
  "href": "http://www.lifestylefood.com.au/recipes/22608/shepherds-pie-with-cheese-champ-topping",
  "firstAdded": "2014-12-24T03:58:48.171000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "frying",
    "lamb",
    "garlic",
    "onion",
    "leeks",
    "trimmed",
    "lengthways",
    "worcestershire",
    "tomato",
    "red",
    "wine",
    "chicken",
    "stock",
    "rosemary",
    "sprigs",
    "leaves",
    "salt",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "Preheat the oven to 180ºC/Gas 4. Place a large, wide frying pan or hob-proof casserole dish over a medium-high heat. Add a dash of oil and fry the mince in batches, seasoning each lot, until well browned. Add the garlic for the last 2 minutes. Transfer to a plate.",
    "2.",
    "Put a little more oil in the same pan and cook the onion and leeks over a medium heat for 5–7 minutes, until completely softened. Add Worcestershire sauce to taste, then stir in the tomato purée.",
    "3.",
    "Return the mince to the pan and stir well. Pour in the wine, scraping up any bits from the bottom. Bubble for a couple of minutes to burn off the alcohol, then add the stock and bring to the boil. Reduce to a simmer, then add the rosemary and adjust the seasoning as necessary. Cook gently for 10–15 minutes, until the sauce has reduced slightly and the flavours are well combined. Set aside to cool.",
    "4.",
    "Meanwhile, prepare the topping. Boil the potatoes until tender, then drain and mash until smooth. Mix in the butter and seasoning, then add the spring onions and three-quarters of the cheese and mix again. Taste and adjust the seasoning as necessary. If the mash is too dry add a splash of milk to loosen.",
    "5.",
    "Put the lamb mixture into a 28 x 22cm baking dish and top with the mashed potato. Sprinkle with the remaining cheese and a little salt and pepper. Bake for 15–20 minutes or until the potato is golden brown and the meat is bubbling underneath, and serve."
  ],
  "ingredients": [
    "0",
    "Olive oil, for frying",
    "1kg minced lamb",
    "2 garlic cloves, peeled and finely chopped",
    "1 onion, peeled and diced",
    "2 leeks, trimmed, halved lengthways and finely sliced",
    "1–2 tbsp Worcestershire sauce",
    "1 tbsp tomato purée 100ml red wine",
    "250ml chicken stock",
    "2 rosemary sprigs, leaves only, chopped",
    "Sea salt and freshly ground black pepper"
  ],
  "__v": 1
}