{
  "hash": "b6f2e32e6e2fb11768f629efa630dd9cb727a2a9",
  "title": "Crockpot Lobster Bisque",
  "image": "http://onegoodthing.wpengine.com/wp-content/uploads/2014/03/crockpot-contest-4.jpg",
  "href": "http://www.onegoodthingbyjillee.com/2014/03/announcing-our-crockpot-recipe-contest-winners.html?utm_source=getresponse&utm_medium=email&utm_campaign=onegoodthing&utm_content=%5B%5Brssitem_title%5D%5D",
  "extension": "Chrome",
  "firstAdded": "2016-04-05T15:58:07.629000",
  "users": [
    null
  ],
  "keywords": [
    "shallots",
    "clove",
    "garlic",
    "petite",
    "tomatoes",
    "juice",
    "carton",
    "lowsodium",
    "chicken",
    "broth",
    "old",
    "bay",
    "seasoning",
    "dill",
    "parsley",
    "cracked",
    "black",
    "pepper",
    "paprika",
    "lobster",
    "tails",
    "cream"
  ],
  "directions": [
    "0",
    "Put minced shallots and garlic in a microwave safe bowl and microwave on high for 2-3 minutes or until the shallots are wilted and starting to turn translucent. (You can also cook them in a small skillet if you don’t have a microwave.) ?Add shallot and garlic mixture to a 4-quart or larger crock-pot.",
    "Continue adding tomatoes, chicken broth, old bay seasoning, dill, parsley, pepper & paprika to the crock-pot.",
    "With a sharp knife cut off the fan part of the very end of the lobsters and add those to the crock-pot.? Stir, cover and cook on low for 6 hours or 3 hours on high.",
    "Remove the lobster tail ends and discard.",
    "Using a blender or immersion blender puree the soup mixture to your desired chunkiness. (I pureed half until smooth and the other half just a light puree.)? Add the soup back into the crock-pot if you used a regular blender.? Add your lobster tails to the soup, cover and cook 45 minutes on low or until the shells turn red and the lobster meat is cooked.",
    "Remove lobster tails from the soup and let cool slightly.",
    "While the lobster is cooling add the cream and stir.? With a sharp knife cut each lobster tail in half long-ways and remove the lobster flesh from the shells.",
    "Discard shells and roughly chop lobster meat and add back into the soup.",
    "Serve and enjoy!"
  ],
  "ingredients": [
    "0",
    "2 Shallots, Finely Minced",
    "1 Clove Garlic, Finely Minced",
    "2 (14.5 Oz.) Cans Petite Diced Tomatoes, With Juice",
    "1 (32 Oz.) Carton Low-Sodium Chicken Broth",
    "1 Tablespoon Old Bay Seasoning",
    "1 Teaspoon Dried Dill",
    "1/4 Cup Fresh Parsley, Chopped",
    "1 Teaspoon Freshly Cracked Black Pepper",
    "1/2 Teaspoon Paprika",
    "4 Lobster Tails",
    "1 Pint Heavy Cream"
  ],
  "__v": 1
}