{
  "__v": 1,
  "directions": [
    "0",
    "Preparare la pizza in casa è un piacere irrinunciabile, che in molti casi si trasforma in un appuntamento fisso, specie se si dispone di un metodo ben collaudato, che non richiede tempi esageratamente dilatati per la sua realizzazione.",
    "Con questa ricetta, che rappresenta, secondo il mio modesto parere, il giusto compromesso tra tempi di lievitazione non eccessivamente lunghi, bassa quantità di lievito di birra e resa del prodotto finale, ho ottenuto risultati molto più che soddisfacenti: bordo alto con presenza di bolle, superficie croccante – grazie al tocco della semola prima della cottura e alla corretta regolazione del forno – interno soffice e ben alveolato.",
    "Per realizzarla non sono necessarie chissà quali tipologie di farine o strumentazioni professionali, anzi questa ricetta è stata più volte testata con farine che si trovano comunemente sugli scaffali dei supermercati e cotta in un forno casalingo affinché possa essere facilmente replicabile da tutti. Per fornire un’idea sulle tempistiche, diciamo che, iniziando ad impastare verso le ore 11.00, si può iniziare a stendere la pizza verso le 19.00, condirla a proprio piacimento, e averla pronta per cena di lì a poco.",
    "PROCEDIMENTO",
    "In una tazza versa 50 g di acqua tiepida (da sottrarre dal totale) insieme al lievito di birra secco e allo zucchero. Mescola con un cucchiaino per farlo sciogliere e lascialo attivare seguendo il tempo indicato sulla confezione (circa 10 minuti).",
    "Nella ciotola dell’impastatrice versa le due farine facendole cadere a pioggia e aggiungi i rimanenti 320 g di acqua a temperatura ambiente a filo, impastando con il gancio a velocità minima. Unisci, sempre a filo, il contenuto della tazza con il lievito. Impasta fino ad incordare, dovrai ottenere un impasto composto, ben idratato e i bordi della ciotola dovranno essere puliti. Versa l’olio extravergine di oliva poco alla volta, continuando ad impastare fino a quando sarà stato completamente assorbito, unisci il sale e lavora, sempre con il gancio e aumentando progressivamente la velocità, per circa 15 minuti o comunque fino a quando la massa sarà di nuovo in corda e risulterà elastica e non troppo appiccicosa (un po' potrebbe risultarlo, ma con le successive fasi di lavorazione lo sarà sempre meno). Metti l’impasto all’interno di una ciotola spolverizzata con un po’ di farina e fai lievitare, coperto con la pellicola per alimenti bucherellata, per 1 ora.",
    "Trascorso questo tempo, lasciando l’impasto all’interno della ciotola, preleva un lembo di impasto dal bordo e tiralo verso il centro, ruota la ciotola e prosegui in questo modo per 10 volte. Fai passare 20 minuti ed esegui questa operazione per altre due volte. Con il passare del tempo l’impasto dovrebbe offrire sempre maggiore resistenza.",
    "Dopo l’ultima piega suddividi con un raschietto l’impasto ottenuto in 4 panetti da 225 g ciascuno. Sulla spianatoia leggermente infarinata falli ruotare su loro stessi, verso il basso e verso il centro, con entrambe le mani fino ad ottenere delle palline lisce. Disponile, opportunamente distanziate, all’interno di una teglia capiente, copri con la pellicola per alimenti bucherellata, e fai lievitare dentro al forno spento con la luce accesa per 6 ore. Se, trascorso questo tempo dovessero essersi attaccate, basterà staccarle delicatamente con un raschietto facendo attenzione a non sgonfiarle.",
    "Accendi il forno alla massima temperatura. Disponi sulla spianatoia un po’ di semola e con le mani stendi delicatamente, con movimenti circolari e paralleli alla superficie di lavoro, ciascuna pallina, una alla volta, avendo cura di non schiacciare mai i bordi che formeranno il cornicione della pizza.",
    "Con una pala trasferisci il disco ottenuto su una leccarda o una teglia per pizza spolverata sempre con un po’ di semola e finisci di stenderla allo spessore desiderato. Distribuisci a pioggia un po’ di semola sul bordo della pizza. Con un cucchiaio distribuisci il condimento desiderato sulla pizza e inforna le pizze, una alla volta, nel ripiano più basso. Cuoci per circa 15 minuti con il grill a media potenza o fino a quando il bordo avrà assunto un colore nocciola.",
    "PER SAPERNE DI PIÙ",
    "- con queste quantità si ottengono 4 pizze che possono passare da un minimo di 18 cm di diametro ad un massimo di 24 cm circa, a seconda dello spessore dell'impasto e del cornicione;",
    "- se si desidera stendere l'impasto su teglie più grandi, sarà sufficiente aumentare il peso dei panetti, suddividendo la massa totale ad esempio in due parti uguali;",
    "- l'operazione di stesura dell'impasto é molto importante e per questo incide in maniera significativa sul risultato finale. La pasta va manovrata con delicatezza, senza strapparla, con movimenti leggeri e circolari e senza mai fare pressioni sul bordo. La superficie al suo interno dovrà essere il più possibile regolare o si cuocerà in maniera disomogenea, lasciando aree più sottili che in cottura potrebbero rischiare addirittura di bruciarsi;",
    "- altrettanto importante é la fase di cottura: sarà necessario infatti prendere inizialmente confidenza con il proprio forno. Io utilizzo il grill a media potenza, perché é l'unica funzione (le ho provate tutte) che permetta di ottenere un bordo ben cotto e con la crosticina croccante, ma questo non significa che sia il metodo più corretto;",
    "- per la cottura ho sperimentato con successo una teglia circolare in alluminio con rivestimento in ceramica (acquistabile comunemente in molti supermercati) che non necessita di carta da forno. In alternativa andrà benissimo una leccarda ricoperta con un foglio di quest'ultima;",
    "- per migliorare la cottura si può utilizzare una piastra di materiale refrattario che andrà posizionata nel forno a freddo, scaldandosi dunque in maniera progressiva insieme ad esso."
  ],
  "firstAdded": "2014-10-08T14:09:40.373000",
  "hash": "54a46239795bef39ff4d34556b2ef170d8206a0b",
  "href": "http://www.cucchiaio.it/ricette/ricetta-impasto-base-pizza",
  "image": "http://www.cucchiaio.it/sites/www.cucchiaio.dev.softecspa.it/files/imagecache/ricetta_immagine_grande_620/ricetta/immagini/2014/02/pizza_impasto_diretto2.jpg",
  "ingredients": [
    "0",
    "350 g di farina 0 per pizza",
    "150 g di manitoba",
    "370 g di acqua"
  ],
  "keywords": [
    "farina",
    "pizza",
    "manitoba",
    "acqua"
  ],
  "title": "Impasto base per pizza",
  "users": [
    null
  ]
}