{
  "hash": "8e2cbbe1464c525730944b0d54db2854d70ee071",
  "title": "Sweet and Creamy Warm Summer Corn Salad",
  "image": "http://www.cookthestory.com/wp-content/uploads/2011/06/pool-600x900.jpg",
  "href": "http://www.cookthestory.com/2011/06/02/trading-corn-for-mangoes/",
  "extension": "Firefox",
  "firstAdded": "2015-05-07T14:57:14.756000",
  "users": [
    null
  ],
  "keywords": [
    "shave",
    "cobs",
    "corn",
    "defrost",
    "frozen",
    "stuff",
    "red",
    "bell",
    "pepper",
    "onion",
    "green",
    "onions",
    "work",
    "jalapeno",
    "peppers",
    "seeded",
    "decide",
    "jalapenos",
    "use",
    "based",
    "spicy",
    "things",
    "cilantro",
    "leaves",
    "salt",
    "coarsely",
    "black",
    "cream",
    "cheese",
    "butter"
  ],
  "directions": [
    "0",
    "Directions:",
    "Preheat the oven to 350ºF.",
    "Warm a large skillet over medium-high heat. Once hot, add the corn kernels and spread them in a single layer. Ignore them for a few minutes. Check their undersides for browning. If browned, stir them up and neglect them for another couple of minutes. Repeat this until all the kernels have light brown spots. Remove from heat. (Note, you can instead grill the corn on the cob and then shave the kernels off. Or, if you use frozen, you can skip the toasting step since the corn is ready to eat).",
    "In a medium casserole dish, combine the corn, bell pepper, onion, jalapeno, cilantro, salt and pepper.",
    "Squeeze the cream cheese and butter into a microwave-safe dish. Microwave on high for 20 seconds. Stir. Repeat until the butter is melted and the cream cheese and butter are a smooth white cloud. Pour the hot bowlful of goodness over the corn mixture. Stir. Cover and bake for 25-30 minutes, until heated through."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "3 cups of corn (you can either shave it* from 3-4 cobs of corn or defrost some frozen stuff)",
    "1/2 of a red bell pepper, finely chopped",
    "1/3 cup of finely chopped red onion (green onions work too!)",
    "2-3 fresh jalapeno peppers, seeded and finely minced (decide how many jalapenos to use based on how spicy you like things)",
    "a handful of cilantro leaves, chopped (about 1/4 cup)",
    "1/4 tsp salt",
    "1/8 tsp coarsely ground black pepper",
    "4 ounces cream cheese",
    "3 tbsp butter"
  ],
  "__v": 1
}