{
  "hash": "9518d671d9daeaa97abf23f9f91a58e26cd692a6",
  "title": "Thai Fish En Papilotte With Lime & Garlic Butter SauceTime for Thai Grilled Fish With Chili-Lime Sauce",
  "image": "http://img.sndimg.com/food/image/upload/w_614,h_461,c_fit/v1/img/recipes/30/81/48/pic1Ip7TY.jpg",
  "href": "http://www.food.com/recipe/thai-fish-en-papilotte-with-lime-garlic-butter-sauce-477613",
  "extension": "Chrome",
  "firstAdded": "2015-08-14T09:02:27.895000",
  "users": [
    null
  ],
  "keywords": [
    "fish",
    "bass",
    "tilapia",
    "chunky",
    "fillets",
    "white",
    "knob",
    "ginger",
    "medium",
    "red",
    "chili",
    "shallot",
    "lime",
    "kaffir",
    "leaves",
    "lemongrass",
    "marinade",
    "garlic",
    "coarsely",
    "cilantro",
    "stems",
    "low",
    "sodium",
    "soy",
    "sugar",
    "salt",
    "pepper",
    "canola",
    "olive",
    "oil",
    "lbs",
    "salmon",
    "tuna",
    "snapper",
    "cod",
    "catfish",
    "juice",
    "jalapeno"
  ],
  "directions": [
    "0",
    "Preheat the oven to 180°C.",
    "If you are serving rice, put this on first – you can keep it warm while the other components cook.",
    "Prepare the ingredients for the fish. Cut the shallot in half width-ways and finely slice. Finely slice the chilli, ginger and lime zest into very thin matchsticks – take time to do this carefully, you want thin, delicate pieces.",
    "Cut the lemongrass stalks in half lengthways.",
    "Mix together the fish sauce, lime juice and sugar.",
    "Cut two pieces of parchment paper about 25cm long and lay them flat on a surface. Place four kaffir lime leaves in a row in the centre of each piece and lay a fish fillet on top.",
    "Put the two halves of the lemongrass stalk either side of the fillet and sprinkle the slivers of shallot, ginger, lime zest and chilli across the top of the fillet evenly. Gently spoon over the fish sauce and sugar mixture.",
    "Gather up the edges of the parchment paper over the fish. Twist it at both ends and fold over the edges of the paper in the middle, leaving space between the fish and paper to allow space for steam. Seal the edges well to trap the steam. It should look like this:.",
    "Bake in the oven for 10-13 mins depending on the size of your fillet.",
    "For the lime butter sauce, finely chop the shallot, garlic lime zest. Heat a little olive oil in a small saucepan, gently fry the shallot, garlic and lime zest over and fry over a medium heat until softened but not coloured (about a minute).",
    "Add the white wine and lime juice, bring to the boil and cook for 2 minutes.",
    "Strain through a sieve and return the strained sauce to pan, discarding the rest.",
    "Re-heat over a low heat and add the butter a few pieces at a time. Whisk continuously until all the butter has melted and incorporated into the sauce and season with a pinch of salt.",
    "Once the butter has all been incorporated remove from the heat and cover - don’t let the sauce overheat as this will make the butter clarify (separate) and your sauce will be ruined. You can re-heat it for a moment right before serving.",
    "If you are also serving pak choi, put a large wok on a high heat with a little water and stir-fry the greens for 2-3 minutes stirring continuously.",
    "Remove the fish from the oven and transfer from the paper to a dinner plate using a spatula. Leave the lemongrass and kaffir lime leaves behind. Pour the juices from the bag over the fish. Plate up the rice and vegetables and serve the sauce alongside.",
    "Cooking ahead? The fish can be prepared several hours in advance (up to the end of step 8 and refrigerated). The sauce may split if made ahead however.",
    "1",
    "Marinade:.",
    "Combine garlic, cilantro, fish sauce, soy sauce, sugar, salt, pepper, and oil in a food processor or blender and grind to a smooth paste. Transfer to a large zip-lock bag and add fish fillets. Turn gently to season well. Set aside for 30 minutes, or refrigerate up to 1 day.",
    "Sauce: Combine sauce ingredients in a small bowl, stirring to dissolve sugar. Sprinle with chili and cilantro and set aside.",
    "Coat a grill rack with cooking spray and preheat, or lightly oil a shallow baking pan and preheat oven to 425 degrees. Remove fish from marinade and cook until done, turing once, about 5 minutes per side.",
    "Arrange on serving platter along with a small bowl of sauce, if using, to spoon over the fish. Serve hot or warm."
  ],
  "ingredients": [
    "0",
    "For the fish",
    "2 sea bass (chunky fillets of white fish) or 2 tilapia fillets (chunky fillets of white fish)",
    "1 small knob ginger, peeled",
    "1 medium red chili",
    "1 shallot",
    "1 lime",
    "8 kaffir lime leaves",
    "2 sticks lemongrass",
    "3 tablespoons fish sauce",
    "1",
    "Marinade",
    "3 tablespoons garlic, coarsely chopped",
    "3 tablespoons cilantro leaves and stems, coarsely chopped",
    "2 tablespoons fish sauce",
    "1 tablespoon low sodium soy sauce",
    "1⁄2 teaspoon sugar",
    "1⁄2 teaspoon salt (optional)",
    "1⁄2 teaspoon fresh ground pepper",
    "2 tablespoons canola oil (or olive oil)",
    "1 1⁄2 lbs salmon fillets (or tuna, snapper, cod, catfish or tilapia)",
    "Sauce",
    "2 tablespoons fish sauce",
    "3 tablespoons lime juice",
    "2 tablespoons sugar",
    "1 teaspoon garlic, finely chopped",
    "1 teaspoon jalapeno pepper, finely chopped",
    "1 teaspoon cilantro, finely chopped"
  ],
  "__v": 1
}