{
  "hash": "82e8008d6c499a68292b8e96cb554dc3006e2bcc",
  "title": "Keto Lasagna",
  "image": "",
  "href": "https://www.dietdoctor.com/recipes/keto-lasagna",
  "extension": "Chrome",
  "firstAdded": "2017-04-11T19:58:01.927000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Start with the pasta sauce, perhaps even the day before, for a more flavorful sauce.",
    "Peel and finely chop onion and garlic and fry in olive oil until soft. Add the ground beef and fry until golden. Add tomato paste and spices.",
    "Stir thoroughly and add water. Bring to a boil, lower the heat, and let simmer for at least 15 minutes or until most of the water has evaporated.",
    "Meanwhile, make the lasagna sheets according to the recipe below.",
    "Preheat the oven to 400°F (200°C). Mix shredded cheese with sour cream and most of the Parmesan cheese. Reserve one or two tablespoons for topping. Add salt and pepper and stir in the parsley.",
    "Place lasagna sheets and pasta sauce in layers in a greased 9″ x 13″ baking dish.",
    "Spread the sour cream mixture and the remaining parmesan cheese on top.",
    "Bake in the oven for about 30 minutes or until the lasagna has a nicely browned surface. Serve with a green salad and your favorite dressing.",
    "Lasagna sheets",
    "Preheat the oven to 300°F (150°C). Whisk together eggs, cream cheese and salt into a smooth batter. Continue to whisk while stirring in the psyllium husk, a little at a time. Let sit for a few minutes.",
    "Spread the batter on a baking sheet lined with parchment paper using a spatula. Place another parchment paper on top and flatten with a rolling pin until the batter is at least 13 x 18 inches (33 x 45 cm). You can also divide into two batches and use another baking sheet for an even thinner pasta.",
    "Let both pieces of parchment paper remain in place. Bake for about 10-12 minutes. Let cool and remove the paper, slice into sheets that fit your baking dish.",
    "Tip!",
    "Want to change it up and make it a little easier? You can substitute thinly sliced zucchini for the low-carb lasagna sheets."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "servingsUSMetric",
    "2 tablespoons olive oil",
    "11⁄3 lbs ground beef",
    "1 yellow onion",
    "1 garlic clove",
    "3 tablespoons tomato paste",
    "½ tablespoon dried basil",
    "1 teaspoon salt",
    "¼ teaspoon ground black pepper",
    "½ cup water",
    "Keto pasta",
    "8 eggs",
    "2⁄3 lb cream cheese",
    "1 teaspoon salt",
    "51⁄3 tablespoons ground psyllium husk powder",
    "Cheese topping",
    "2 cups sour cream or crème fraiche",
    "1⁄3 lb shredded cheese",
    "2 oz. grated parmesan cheese",
    "½ teaspoon salt",
    "¼ teaspoon ground black pepper",
    "8 tablespoons fresh parsley, finely chopped"
  ],
  "__v": 1
}