{
  "hash": "e15fa485f9936e18ac5e7c69561715ee65575e59",
  "title": "WALNUT LENTIL BURGERS WITH CAULIFLOWER PUREE AND RED ONION RELISH [VEGAN, GLUTEN-FREE]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/01/walnutburgers.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/walnut-lentil-burgers-with-cauliflower-puree-and-red-onion-relish/",
  "firstAdded": "2015-01-21T11:40:01.882000",
  "users": [
    null
  ],
  "keywords": [
    "green",
    "lentils",
    "boiled",
    "stock",
    "boil",
    "according",
    "instructions",
    "red",
    "onion",
    "garlic",
    "thyme",
    "oregano",
    "walnuts",
    "dates",
    "salt",
    "water",
    "soy",
    "flour"
  ],
  "directions": [
    "0",
    "Soak and boil the lentils with the vegetable stock (follow package instructions).",
    "Bring the oven to 325 degrees.",
    "Bring a pan to medium heat and add the red onion, the garlic, the thyme, the oregano, the walnuts, the dates, the salt and the water. Let it boil for three to four minutes, until the onions start to soften.",
    "Take the pan off the stove, add the soy flour and the boiled lentils and mix it all together using a hand blender. The consistency should be firm, but not too dry. Adjust with more water or more flour if needed.",
    "Place a cooking paper onto a baking tray. Shape burgers out of the lentil/walnut mix and place on the paper. Place in the oven and bake for 20 minutes (or until crusty on top).",
    "Now make the relish. Place the chopped onion, raisins, dates, sage leaves, salt and the water into a pot and bring to boil on low heat. Leave boiling until time to serve. Stir occasionally and add more water if needed.",
    "In the meantime, boil the broccoli and the cauliflower together with the vegetable stock for about three minutes. Then remove all water, add the salt and the milk and blend into a pure.",
    "Get the patties from the oven, the relish from the stove and serve."
  ],
  "ingredients": [
    "0",
    "¾ cups dried green lentils – boiled with 2 tbsp. vegetable stock (otherwise soak and boil according to package instructions).",
    "1 small red onion, chopped",
    "2 cloves garlic, chopped",
    "1 tbsp. dried thyme",
    "½ tbsp. dried oregano",
    "⅔ cup walnuts",
    "3 dates, finely chopped",
    "1 tsp. salt",
    "½ cup water",
    "⅓ cup soy flour"
  ],
  "__v": 1
}