{
  "hash": "b0c10c3e5e33777cb69033b26d9b09536d58bde7",
  "title": "Corned Beef and Cabbage",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2014/03/corned-beef-cabbage-vertical-a-640-600x732.jpg",
  "href": "http://www.simplyrecipes.com/recipes/corned_beef_and_cabbage/?",
  "extension": "Chrome",
  "firstAdded": "2015-04-09T02:37:29.471000",
  "users": [
    null
  ],
  "keywords": [
    "lbs",
    "corned",
    "beef",
    "hot",
    "honey",
    "mustard",
    "brown",
    "sugar",
    "spice",
    "olive",
    "oil",
    "butter",
    "medium",
    "yellow",
    "onion",
    "garlic",
    "head",
    "cabbage",
    "wide",
    "slices",
    "salt",
    "couple",
    "carrots",
    "pieces",
    "new",
    "potatoes"
  ],
  "directions": [
    "0",
    "Corned Beef (Baked)",
    "1 Take the corned beef from the package and discard the spice packet. Note that one side of the roast should have a layer of fat, the other side should have distinct lines indicating the grain of the beef.",
    "Corned beef can be very salty, especially when baked. To remove some of the salt before cooking, place it in a pot fat side up. Cover with water, bring to a boil, discard the water, add fresh water and bring to a boil again. Again discard the water.",
    "2 Preheat oven to 350°F. Lay the corned beef, fat side up, on a large piece of heavy duty, wide, aluminum foil (you may have to get creative with the way you wrap the beef if your foil isn't wide enough). Insert the cloves into the top of the slab of corned beef, evenly spaced. Spread the top with the hot sweet honey mustard. Sprinkle brown sugar over the top.",
    "3 Wrap the corned beef with foil in a way that allows for a little space on top between the corned beef and the foil, and creates a container to catch the juices. Place foil-wrapped corned beef in a shallow roasting pan and bake for 2 hours.",
    "4 Open the foil wrapping, spread a little more honey mustard over the top of the corned beef, and broil it for 2-3 minutes, until the top is bubbly and lightly browned. Let rest for 5 to 10 minutes, then place on cutting board. Pull out and discard the cloves.",
    "Lift the corned beef up to see which direction the grain of the meat is. Then cut the meat at a diagonal, across the grain of the meat, into 1/2-inch thick slices.",
    "Serve immediately.",
    "Corned Beef (Boiled)",
    "1 Place corned beef in a large (6 to 8 quart) pot. Cover the beef with an inch water. Add the contents of the spice packet to the water. Bring to a boil, reduce heat to a simmer. Simmer for 2-3 hours, until the corned beef is fork tender. Remove from pot to a cutting board. (Reserve cooking liquid for boiling cabbage, if you plan to boil and not sauté the cabbage.) Cut slices against the grain, into 1/2-inch thick slices. Serve.",
    "Cabbage (Sautéed)",
    "1 Heat 2 Tbsp olive oil (enough to well coat the pan) on medium high to high heat in a large, wide pot (8-quart if available) or large, high-sided sauté pan. Add chopped onions, cook for a couple of minutes, then add garlic.",
    "2 Add a third of the sliced cabbage to the pan. Sprinkle with a little salt and stir to coat with oil and mix with onions. Spread out the cabbage evenly over the bottom of the pan and do not stir until it starts to brown. If the heat is high enough, this should happen quickly. The trick is to have the burner hot enough to easily brown the cabbage, but not so hot that it easily burns. When the bottom of the cabbage is nicely browned, use a metal spatula to lift it up and flip it, scraping the browned bits as you go.",
    "3 Once the cabbage in the pan has browned on a couple of flips, add another third of the cabbage to the pan. Mix well, then spread out the cabbage and repeat. Add a bit of butter to the pan for flavor, and to keep the cabbage from sticking too much to the pan. Once this batch has cooked down a bit and browned, add the remaining third of the cabbage and repeat.",
    "Serve with the corned beef. Serve with boiled new potatoes. Can be made ahead and reheated.",
    "Cabbage (Boiled)",
    "1 Once you have removed the corned beef from the pot, add the cabbage and any other vegetables (carrots, new potatoes) to the pot. Taste the liquid. If it is too salty, add more water to the pot. Raise the heat until the liquid is simmering well. Simmer until the cabbage and any other vegetables are cooked through, 15-30 minutes.",
    "Place vegetables in a serving bowl, add a little of the cooking liquid to the bowl."
  ],
  "ingredients": [
    "0",
    "3 lbs corned beef (in package)",
    "10 whole cloves",
    "1/4 cup hot sweet honey mustard",
    "2 Tbsp brown sugar",
    "3 lbs corned beef (in package, including spice packet)",
    "Olive oil and butter",
    "1 medium yellow onion, chopped",
    "1 cloves garlic, minced",
    "1 large head of cabbage, sliced into 3/8-inch to 1/2-inch wide slices",
    "Salt",
    "1 large head of cabbage, sliced into 3/8-inch to 1/2-inch wide slices",
    "Additional vegetables such as a couple carrots (cut to 1 inch pieces) or several new potatoes (quartered)"
  ],
  "__v": 1
}