{
  "hash": "ce244638b4aa92d1e9ed81c0efb106e8dce3332f",
  "title": "Mediterranean Tuna Pasta",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2015/08/mediterranean-tuna-pasta-vertical-a-1600.jpg",
  "href": "http://www.simplyrecipes.com/recipes/mediterranean_tuna_pasta/",
  "extension": "Chrome",
  "firstAdded": "2018-01-15T04:50:05.849000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Put pasta water on to boil: Heat 2 quarts of salted water (1 Tbsp kosher salt), to a boil. While heating the pasta water, prep the ingredients.",
    "Stir drained tuna with tomato, olives, onion, parsley, capers, lemon juice, olive oil, salt, pepper: Place drained tuna in a medium bowl. Stir with a fork to break up the largest chunks of tuna. Add the tomato, olives, red onion, parsley, capers, lemon juice, olive oil, salt and pepper. Stir to combine.",
    "Boil pasta until al dente: When the pasta water comes to a boil, add the pasta and boil, uncovered, on a rolling boil until al dente (cooked through, but still a little firm to the bite). Reserve 1/4 cup of the pasta water.",
    "Add pasta to tuna mixture, sprinkle with Mozz: Drain the pasta and immediately add the pasta to the tuna mixture.",
    "Sprinkle with the grated Mozzarella cheese and stir until everything is well combined. If the pasta seems a little dry, add some of the reserved pasta water and/or some more olive oil.",
    "Serve warm."
  ],
  "ingredients": [
    "0",
    "2 5-ounce cans of albacore tuna (preferably packed in olive oil), drained*",
    "1 tomato, cored, cut in half crosswise and squeezed of excess juice, chopped (about 1 cup)",
    "1/4 cup pitted, kalamata olives, coarsely chopped",
    "1/4 cup chopped red onion",
    "2 Tbsp chopped parsley",
    "1 Tbsp capers, coarsely chopped",
    "2 teaspoons lemon juice",
    "2 Tbsp extra virgin olive oil (more if you are using tuna packed in water)",
    "1/2 teaspoon kosher salt",
    "Pinch of freshly ground black pepper",
    "3/4 pound fusilli pasta, dry",
    "1 cup grated Mozzarella cheese"
  ],
  "__v": 1
}