{
  "hash": "16d0b9e63b0a115ff926ee15459243b793732b3f",
  "title": "Sausage and Cheese Bread",
  "image": "http://2.bp.blogspot.com/_OFpCCX-zBts/TMHxtV_YagI/AAAAAAAAMyU/2FULF-Fnp_k/s400/Sausage+and+Cheese+Bread+Cross+Section.jpg",
  "href": "http://www.deepsouthdish.com/2010/10/sausage-and-cheese-bread.html",
  "extension": "Firefox",
  "firstAdded": "2015-10-15T04:46:04.155000",
  "users": [
    null
  ],
  "keywords": [
    "loaves",
    "frozen",
    "bread",
    "rhodes",
    "thawed",
    "refrigerated",
    "pizza",
    "dough",
    "canisters",
    "pillsbury",
    "classic",
    "hot",
    "breakfast",
    "sausage",
    "jimmy",
    "dean",
    "onion",
    "green",
    "bell",
    "pepper",
    "jack",
    "cheddar",
    "favorite",
    "cheese",
    "egg",
    "water"
  ],
  "directions": [
    "0",
    "Put the frozen bread dough on a greased baking sheet and allow it to thaw and rise. I use the quick rise method on the package. Meanwhile brown the sausage in a skillet, remove to a paper towel to drain, transfer to a plate and set aside. To the pan drippings, add the onion and bell pepper and saute until tender. Remove and add to the sausage. Let cool completely.",
    "Preheat the oven to 350 degrees F. Butter or spray a large baking sheet generously with non-stick spray; set aside. Place one of the bread dough rolls on a sheet of lightly floured, wax or parchment paper, rolling or pressing into a long rectangle, about 1/4 inch thick. Add half of the meat and veggie mixture along the length of the bread directly in the center, leaving a border all around. Top the sausage with half of the shredded cheese. Brush the very edges of the bread dough with water or the egg wash, then fold the bottom part of the bread dough up over the filling, fold the sides in, applying more egg wash, and then fold the top half over, pressing seam gently together to seal. Transfer the bread to the prepared baking sheet by lifting the paper and rolling the dough off, so that it is seam side down on the baking sheet. Repeat with the second bread loaf.",
    "Brush bread all over with the remaining egg wash if desired, and poke several vent holes into the top of the bread with a fork or the tip of a knife. Bake at 350 degrees F for about 35 to 40 minutes or until golden brown all over. Transfer to a rack to let rest and cool for 5 to 10 minutes or until set, then using a serrated knife, slice into pieces about 1-1/2 inch wide. Arrange on platter and serve immediately.",
    "Cook's Note: Can substitute any other raw sausage such as chorizo, Bratwurst, or Italian sausage, or use plain ground beef. Add additional seasonings as needed for flavoring.",
    "Breakfast Bread: For each loaf prepared, fry 1/4 pound of breakfast sausage or 4 slices of bacon to crisp; drain and set aside. Saute onion and bell pepper in pan drippings if desired. Beat 4 large eggs with a tablespoon of water and soft scramble without butter in a non-stick skillet. Arrange 3/4 cup of shredded cheese on the dough, top with scrambled eggs and veggies if using, scatter sausage, bacon or ham on top. Finish as above.",
    "Muffuletta Bread: For each loaf, spread a light layer of olive salad across the center of the dough. Layer sliced deli meats and cheeses, beginning with Cappicola ham, Swiss cheese, Mortadella or bologna, Provolone and salami. Top with additional olive salad and finish bread as above.",
    "Stuffed Pizza Bread Variation: Make this pizza bread by adding your favorite pizza toppings. Pre-cook pepperoni a few seconds to render fat, then dab with a paper towel to remove excess fat, and let cool. Use cooked, well drained and cooled ground beef, bacon, grilled chicken, ham, whatever you love. Add favorite veggies you like - onion, mushrooms, sweet peppers or jalapeno are all good, though I do suggest sauteing many of them first. Let all ingredients cool before adding to the bread dough. Sprinkle lightly with Italian seasoning and red pepper flakes if you like a little kick. You can also spread a thin layer of pizza sauce on the dough, though it isn't necessary. I prefer to save the sauce for dipping and make a nice marinara instead, which is delicious. Don't forget the cheese - mozzarella or provolone with a little Parmesan, Romano or Asiago are great choices!",
    "Source: http://deepsouthdish.com"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 loaves of frozen bread dough (like Rhodes), thawed, or two refrigerated pizza dough canisters (like Pillsbury classic)",
    "1 pound of hot breakfast sausage (like Jimmy Dean)",
    "1 cup of chopped onion",
    "1 cup of chopped green bell pepper",
    "1 cup of shredded pepper jack, cheddar or your favorite cheese",
    "1 egg beaten with 1 tablespoon of water, optional"
  ],
  "__v": 1
}