{
  "hash": "683bcbd2a148dc60d202604d478c3129367a172e",
  "title": "Pressure Cooker Chicken Cacciatore",
  "image": "http://whole9life.com/wp-content/uploads/2011/01/Chicken-Cacciatore-Recipe.jpg",
  "href": "http://whole9life.com/2011/01/stm-pressure-cooker-cacciatore/",
  "extension": "Chrome",
  "firstAdded": "2016-10-19T15:58:08.576000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "Heat the oil in a 4-quart or larger cooker. Add the shallots and bell pepper and cook over medium-high heat, stirring frequently, until the shallots soften slightly, about 2 minutes",
    "Stir in the broth and boil for 2-3 minutes. Scrape up any browned bits sticking to the bottom of the cooker.",
    "Stir in the mushrooms and garlic. Set the chicken on top. Cover the chicken with crushed tomatoes. Do not stir. Plop the tomato paste on top.",
    "Lock the lid in place.",
    "Over high heat bring to high pressure.",
    "Reduce the heat just enough to maintain high pressure and cook for 8 minutes.",
    "Turn off the heat.",
    "Allow the pressure to come down naturally. Remove the lid.",
    "Stir in the olives, parsley, red pepper flakes, salt and pepper.",
    "I served mine over a HEAPING serving of shredded cabbage (instead of the traditional noodles), and it was AWESOME!"
  ],
  "ingredients": [
    "0",
    "Extra Virgin Olive Oil",
    "3 Shallots, Chopped",
    "4 Garlic Cloves, Crushed",
    "1 Green Bell Pepper, seeded & diced",
    "1/2 cup Imagine brand Organic Chicken or Vegetable Broth (make your own or buy another brand – just be careful of sneaky sugars/soy/gluten/etc.)",
    "1 8-10 oz package mushrooms, sliced",
    "5-6 Boneless Skinless Chicken Breasts (good sized ones, not midgets – you’ll want leftovers!)",
    "2 Cans Organic Crushed Tomatoes",
    "2 Tb Organic Tomato Paste",
    "1 Can Pitted Black Olives (I used Whole Foods Brand – just olives, water, salt)",
    "Fresh Parsley",
    "Red Pepper to taste (I used a healthy 1/2 tsp, but I like spicy!)",
    "Sea Salt & Black Pepper to taste"
  ],
  "__v": 1
}