{
  "hash": "0760e76e0d06dc0d1a02846562650d51c20d1bf3",
  "title": "Keto Pizza- Grilled Chicken and Spinach",
  "image": "",
  "href": "https://howtothisandthat.com/keto-pizza-grilled-chicken-spinach/",
  "extension": "Chrome",
  "firstAdded": "2018-04-15T14:56:48.859000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To make the pizza crust: Melt mozzarella and cream cheese in the microwave for 30 seconds at a time. Mixing often. In a separate bowl mix beaten egg with almond flour and remaining dough ingredients.",
    "Combine cheese mixture with flour and mix. Mix. Keep mixing! Once a sticky dough consistency has been reached, refrigerate while preparing sauce and chicken.",
    "Saute the chicken in a skillet over medium heat until done. Remove, set aside.",
    "Add garlic plus the xantham gum with half & half to the skillet and bring to a boil. Reduce to simmer when sauce starts to thicken.",
    "Fold in spinach, cook just until wilted.",
    "Using hands, work dough out into a circle on a pizza pan. Bake on 350 for 10 minutes. Crust must be pre-baked to hold up to the sauce and toppings.",
    "Spread sauce/spinach mixture onto your cooked pizza crust. Top with chicken and shredded cheese",
    "Bake 5 minutes or until cheese is melted.NOTE* if your oven and pizza crust wasn’t already hot from making the dough, bake for 10 minutes instead.Allow to cool a few minutes. Cut into 4 pieces. Serves 2"
  ],
  "ingredients": [
    "0",
    "1 boneless skinless chicken breast",
    "1/2 tablespoon Olive oil",
    "1 clove garlic minced",
    "1/2 cup half & half or heavy whipping cream I used half & half, nutrition facts will change if using something else",
    "1/4 tsp xanthan gum thickener found near the yeast or sweetener aisle This comes in a small packet like yeast and is only about 40¢",
    "1 cup fresh spinach roughly chopped",
    "1/2 cup part skim shredded mozzarella",
    "Sea salt & pepper to taste",
    "FOR THE FATHEAD DOUGH:",
    "2oz cream cheese 3/4 cup shredded mozzarella 1 egg, beaten 1/4 tsp garlic powder 1/3 cup almond flour"
  ],
  "__v": 1
}