{
  "hash": "bdb7093db4b10b407c871d7ff4d7582432381518",
  "title": "Asparagus Risotto",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2008/03/asparagus-risotto-vertical-a2-1200.jpg",
  "href": "http://www.simplyrecipes.com/recipes/asparagus_risotto/",
  "extension": "",
  "firstAdded": "2017-07-13T22:08:14.785000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Heat the stock: Heat the stock in a small saucepan until it comes to a low simmer.",
    "2 Cook shallots in butter to soften, then add rice: In a separate 3 or 4 quart saucepan, heat 1 tablespoon butter on medium heat. Add the shallots and cook for a minute or two, until translucent. Add the arborio rice and cook for 2 minutes more, stirring until nicely coated.",
    "3 Add the white wine: Add the white wine. Slowly stir, allowing the rice to absorb the wine.",
    "4 Add the stock, 1/2 cup at a time, adding only after the previous addition has been absorbed by the rice: Once the wine is almost completely absorbed, add 1/2 cup of hot stock to the rice. Continue to stir until the liquid is almost completely absorbed, adding more stock in 1/2 cup increments. Stir often to prevent the rice from sticking to the bottom of the pan.",
    "Continue cooking and stirring rice, adding a little bit of broth at a time, cooking and stirring until it is absorbed, until the rice is tender, but still firm to the bite, about 20-25 minutes.",
    "5 Add the asparagus: With the last ladle of stock, add the asparagus. Turn off the heat.",
    "Note the stock amount given is approximate. You may need a little more or less. If you end up needing more stock and you find yourself without, just use water.",
    "6 Stir in the Parmesan, remaining butter, add salt, pepper: Gently stir in the Parmesan cheese and the remaining 1 tablespoon butter. Add salt and pepper to taste. Serve immediately."
  ],
  "ingredients": [
    "0",
    "About 4 cups chicken stock (or vegetable stock for vegetarian option)",
    "2 Tbsp unsalted butter, divided",
    "1/2 cup chopped shallots",
    "1 cup arborio rice",
    "1/4 cup dry white wine (or 1 Tbsp lemon juice and 3 Tbsp water)",
    "1/2 pound asparagus, trimmed, tips cut off, tough skins of the spears peeled (if working with thick apparatus spears), and the spears cut into thin disks",
    "1/2 cup freshly grated Parmesan cheese",
    "Salt and pepper"
  ],
  "__v": 1
}