{
  "__v": 1,
  "directions": [
    "0",
    "Put the onions and cinnamon stick in one bowl. Have the garlic and ginger chopped and ready to go. Measure the salt, pepper, turmeric, cumin, coriander, garam masala and cayenne into a separate bowl.",
    "Clockwise: onions and cinnamon, ginger, garlic, spices",
    "~",
    "2. Drain the tomatoes, if you’re using canned.",
    "3. Heat the oil in a large skillet for 1 minute.",
    "4. Add the onions and cinnamon to the oil and cook, stirring occasionally, until the onions are starting to turn golden, about 10 minutes.",
    "5. Add the garlic and cook for 4 minutes.",
    "6. Add the ginger, tomatoes, and the spices to the skillet.",
    "~",
    "7. Cook for about 5 minutes, until the oil separates from the masala.",
    "You can see the oil separated from the masala here:",
    "8. While the masala is cooking, remove the skin from the chicken thighs. Grab an end of it with a paper towel and pull it off. (The paper towel gives you a better grip.)",
    "9. Add the chicken thighs to the masala and stir well. Cook for about 10 minutes, turning them over after about 5 minutes.",
    "~",
    "10. Stir in the sour cream and the water and increase heat to bring it to a boil.",
    "Stirring in the sour cream",
    "~",
    "Water added",
    "11. Once it is boiling, reduce the heat to a simmer, cover and cook for 15 minutes, stirring 2 or 3 times.",
    "12. Check the chicken with a meat thermometer, or cut into a thigh to see if it’s done. If it’s not done, cook for about another 5 minutes. (Mine was done after the 15 minutes simmer.)",
    "13. Remove the cinnamon stick, and let the curry cool for at least 30 minutes.",
    "14. Remove the chicken from the masala. Using latex gloves, tear the meat from the bones and put the meat back in the sauce. (At this point the curry could be refrigerated to serve later or the next day.)",
    "~",
    "15. When ready to serve, gently heat the curry until it is hot. Stir in the cilantro.",
    "Share this:"
  ],
  "firstAdded": "2014-05-10T01:37:18.680000",
  "hash": "b63e286f9fb5246f96256c9429d879e0fa033267",
  "href": "http://kathdedon.wordpress.com/2010/09/20/vijs-familys-chicken-curry/",
  "image": "http://kathdedon.files.wordpress.com/2010/09/vijs-chicken-curry-33.jpg?w=600&h=600",
  "ingredients": [
    "0",
    "½ cup canola oil (I actually used light olive oil)",
    "2 cups finely chopped onions",
    "One 3-inch stick of cinnamon",
    "3 tablespoons finely chopped garlic",
    "2 tablespoons finely chopped ginger",
    "2 cups chopped tomatoes (2 large) or 1 (28-ounce) can chopped tomatoes, drained",
    "1 tablespoon salt",
    "½ teaspoon ground black pepper",
    "1 teaspoon turmeric",
    "1 tablespoon ground cumin",
    "1 tablespoon ground coriander",
    "1 tablespoon garam masala",
    "½ teaspoon ground cayenne pepper",
    "3 pounds chicken thighs, bone in",
    "1 cup sour cream, stirred",
    "2 cups water",
    "½ cup chopped cilantro (including stems)"
  ],
  "keywords": [
    "canola",
    "actually",
    "used",
    "light",
    "olive",
    "oil",
    "onions",
    "cinnamon",
    "garlic",
    "ginger",
    "tomatoes",
    "salt",
    "black",
    "pepper",
    "turmeric",
    "cumin",
    "coriander",
    "garam",
    "masala",
    "cayenne",
    "chicken",
    "thighs",
    "bone",
    "sour",
    "cream",
    "stirred",
    "water",
    "cilantro",
    "stems"
  ],
  "title": "Vij’s Family’s Chicken Curry",
  "users": [
    null
  ]
}