{
  "hash": "bc316308dfec3ab5ee27c0c1885c5925ccae1b6a",
  "title": "Layered Mushroom and Cannellini Bean Vegan Easter Pie",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/03/pie2.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/layered-mushroom-and-cannellini-bean-vegan-easter-pie/",
  "extension": "Chrome",
  "firstAdded": "2015-05-27T08:27:00.399000",
  "users": [
    null
  ],
  "keywords": [
    "mushrooms",
    "red",
    "onion",
    "garlic",
    "fat",
    "ones",
    "stock",
    "salt",
    "pepper",
    "bunch",
    "thyme",
    "balsamic",
    "glaze",
    "olive",
    "oil",
    "frying",
    "cannellini",
    "beans",
    "spinach",
    "sheets",
    "filo",
    "pastry",
    "vegan",
    "butter",
    "brushing"
  ],
  "directions": [
    "0",
    "Preheat your oven to 350 degree.",
    "To prepare your vegetables – slice the mushrooms, Finely dice the red onion, crush the garlic cloves, wash the spinach.",
    "Begin by drizzling a little oil in a large frying pan and add the chopped red onion. Cook for 6-8 minutes on a medium heat until translucent and beginning to brown slightly. Add the crushed garlic for a further minute.",
    "Add the sliced mushrooms and cook for approx 6-10 minutes until wilted and a lot of the moisture released has been evaporated.",
    "Then add the stock, balsamic glaze, seasoning and thyme and simmer on a gentle heat for 15-20 minutes until you have a rich, thick sauce which can be separated by dragging a wooden spoon through the pan. Season to taste.",
    "In a blender add the cannellini beans, oil and seasoning and blend until you have a thick puree. You may need to stop the blender every now and then to scrape down the sides.",
    "Wilt the spinach, I just did mine in the microwave, then place the spinach between a few pieces of kitchen roll and squeeze out any excess liquid. Unwrap it and put to one side.",
    "Grease your pie dishes and line with 2-3 layers of Filo pastry, brush with oil or vegan butter between each layer. First spoon in the bean puree and smooth down with the back of a spoon, this will also help the pastry mould to the shape of the pie dish better. Then top with wilted spinach, make sure you arrange it for an even covering. Then top with the mushrooms.",
    "Scrunch up the sides of the pastry and brush or spray with oil and place in the oven for 25-30 minutes. The pastry should be golden brown on top and the filling should be piping hot.",
    "Allow to cool slightly then either remove from the molds or serve in the pie dish."
  ],
  "ingredients": [
    "0",
    "10 ounces mushrooms",
    "1 large red onion",
    "2-3 garlic cloves (2 fat ones will do)",
    "200ml vegetable stock",
    "salt and pepper",
    "small bunch thyme",
    "1 tbsp balsamic glaze",
    "olive oil for frying",
    "1 can cannellini beans",
    "1 tbsp olive oil",
    "salt and pepper",
    "2 large handfuls spinach",
    "4 sheets filo pastry, cut in half",
    "vegan butter for brushing"
  ],
  "__v": 1
}