{
  "hash": "70f22acefd74dcf1464112e7d6b955d1eb469f79",
  "title": "Doner Kebab",
  "image": "https://www.recipetineats.com/wp-content/uploads/2017/11/Chicken-Doner-Kebab-2-150x150.jpg",
  "href": "https://www.recipetineats.com/homemade-chicken-doner-kebab/?fbclid=IwAR2OFPGIcnVtegZVWndzLhf2gvDeKzez8W5bHRyGrABxRlpZ057IrWlJj8w",
  "extension": "Firefox",
  "firstAdded": "2019-07-21T20:36:19.435000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Mix Marinade in a large bowl. Add chicken and mix to coat well.",
    "Cover and marinate in the fridge for a minimum of 3 hours, 24 hours is ideal. If only 3 hours, add an extra 1/2 tsp salt.",
    "Preheat oven to 220C / 430F (standard) or 200C / 390F (fan / convection).",
    "Choose a pan of a size such that the skewers will stay propped up on the pan walls (see photos in post or video) and the chicken will be elevated off the base. Line with foil.",
    "Remove chicken from fridge. Divide the chicken into 2 piles.",
    "Take one piece of chicken, fold in half then thread onto two skewers (see video). Repeat and push the chicken snugly up against each other. Repeat with other skewer.",
    "Prop the 2 skewers on the edges of the baking pan. Drizzle surface with oil.",
    "Bake for 35 minutes or until the surface is golden with some charred bits (char is good!).",
    "Spoon the pan juices over the chicken. Then turn, drizzle with oil and bake for 20 minutes (or 25 - 30 minutes if you had large thighs). If you need / want more colour, switch to grill/broil for a few minutes on high - I don't do this.",
    "Baste again with pan juices and stand for 5 minutes.",
    "Carving: Stand the skewers upright or on an angle, and slice meat fairly thinly. Use to make Doner Kebabs or Kebab Plates.",
    "Doner Kebabs:",
    "Place a lebanese bread (or pita bread or other flatbread) on a piece of foil. Spread with a generous dollop of Hummus (or yoghurt - Note 2). Top with shredded lettuce, slices of tomato, Tabbouleh (for a truly authentic experience! Note 3), cheese (I usually go this) and Chicken. Drizzle with chilli sauce if desired (I use Sriracha, it's perfect).",
    "Roll up tightly and wrap in foil. Consume and be happy!",
    "Kebab Plates:",
    "Serve chicken with Mejadra (Middle Eastern Spiced Rice with Lentils), shredded lettuce, tomatoes, slices of red onion, tabbouleh, dollop of hummus. Optional to serve flatbread / lebanese bread on the side."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 kg / 2 lb chicken thighs , skinless and boneless (Note 1)",
    "Olive oil , for drizzling",
    "Marinade:",
    "1 cup plain yoghurt , unsweetened (I use Greek)",
    "3 garlic cloves minced",
    "1 1/2 tsp coriander powder",
    "2 tsp cumin powder",
    "2 tsp paprika",
    "1 tsp cayenne pepper , optional",
    "1 1/2 tsp onion powder",
    "1/2 tsp black pepper",
    "2 1/2 tbsp tomato paste",
    "1 1/2 tsp salt",
    "1 tbsp lemon juice",
    "2 tbsp olive oil"
  ],
  "__v": 1
}