{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 350 F. Using a small, sharp knife, trim the stalk ends of the beans and the snow peas, keeping the two separate. Bring plenty of unsalted water to a boil in a large saucepan with lots of space for the beans to preserve their colour. Blanch the beans in the water for 4 minutes, then drain into a colander and run them under plenty of tap water until cold. Leave to drain and dry.",
    "Repeat with the snow peas, but blanch only for 1 minute. While beans are cooking, scatter the hazelnuts over a baking sheet and toast in the oven for 10 minutes. Leave until cool enough to handle, then rub them in a clean kitchen towel to get rid of most of the skin. Chop the nuts with a sharp knife. They should be quite rough; some can even stay whole.",
    "Using a vegetable peeler, remove the zest from the orange in strips, being careful to avoid the bitter white pith. Slice each piece of zest into very thin strips (a citrus zester could do the whole job).",
    "To assemble the dish, mix all the ingredients together in a bowl, toss gently, then taste and adjust the seasoning. Serve at room temperature.",
    "Makes 6 servings"
  ],
  "firstAdded": "2014-05-09T23:47:47.987000",
  "hash": "e41a1072d6a65049e299ba9fff2888ae72211f74",
  "href": "http://www.vancouversun.com/life/Wine+Match+Haricots+Verts+Snowpeas+with+Hazelnut+Orange/8999573/story.html",
  "image": "http://www.vancouversun.com/life/Wine+Match+Haricots+Verts+Snowpeas+with+Hazelnut+Orange/8999573/cms/binary/8999574.jpg",
  "ingredients": [
    "0",
    "14 oz./400 g haricots verts",
    "14 oz./400 g snow peas",
    "½ cup/125 mL unskinned hazelnuts",
    "1 orange",
    "¾ oz./20 g chives, coarsely chopped",
    "1 clove garlic, chopped",
    "3 tbsp./45 mL olive oil",
    "2 tbsp./30 mL hazelnut oil",
    "hazelnut oil (or another nut oil)",
    "Coarse sea salt, freshly ground",
    "Black pepper"
  ],
  "keywords": [
    "haricots",
    "verts",
    "snow",
    "peas",
    "unskinned",
    "hazelnuts",
    "orange",
    "chives",
    "coarsely",
    "clove",
    "garlic",
    "olive",
    "oil",
    "hazelnut",
    "nut",
    "coarse",
    "salt",
    "black",
    "pepper"
  ],
  "title": "Green Beans and Snowpeas with Hazelnut and Orange",
  "users": [
    null
  ]
}