{
  "hash": "4b55cf8ba8dfae8cd4ce507011147223d5ff7502",
  "title": "Fish Taco Bowls",
  "image": "//theliveinkitchen.com/wp-content/uploads/2013/07/FishTacoBowlsXCU-833x1024.jpg",
  "href": "http://theliveinkitchen.com/2013/07/12/fish-taco-bowls-tasty-food-photography-giveaway/",
  "extension": "Chrome",
  "firstAdded": "2016-04-05T09:24:53.135000",
  "users": [
    null
  ],
  "keywords": [
    "chili",
    "cumin",
    "cayenne",
    "pepper",
    "garlic",
    "cod",
    "fillets",
    "white",
    "fish",
    "tilapia",
    "salt",
    "black",
    "olive",
    "oil",
    "red",
    "onion",
    "bell",
    "frozen",
    "thawed",
    "corn",
    "cob",
    "beans",
    "rinsed",
    "brown",
    "rice",
    "avocado",
    "cilantro",
    "lime",
    "juice"
  ],
  "directions": [
    "0",
    "In a small bowl combine chili powder, cumin, cayenne pepper, and garlic powder. Sprinkle evenly over bothl sides of the fish (I didn't use all of it, but you could if you like things spicier) and salt and pepper to taste.",
    "Heat a drizzle of olive oil in a large nonstick skillet over medium high heat. Add the fish and cook, undisturbed, for several minutes per side. Check the middle of the fish for doneness. It should flake easily and be opaque throughout. Remove the fish from the pan and set aside.",
    "If necessary, add another drizzle of olive oil to the pan and add the onion, pepper, and corn. Cook over medium high heat, stirring occasionally, until crisp tender, about 7 minutes. Add the black beans and heat through.",
    "Layer rice, bean mixture, and fish in a bowl and top with avocado, cilantro, and lime juice if desired."
  ],
  "ingredients": [
    "0",
    "2 teaspoons chili powder",
    "2 teaspoons cumin",
    "Dash of cayenne pepper",
    "Pinch of garlic powder",
    "3-4 cod fillets (or other white fish such as tilapia)",
    "Salt and freshly ground black pepper",
    "Olive oil",
    "1 red onion, chopped",
    "1 red bell pepper, chopped",
    "1 cup frozen corn, thawed, or fresh corn cut off the cob",
    "1 15 ounce can black beans, rinsed and drained",
    "2 cups cooked brown rice",
    "Avocado, cilantro, and lime juice for garnish (optional)"
  ],
  "__v": 1
}