{
  "hash": "11b057607ec8866646e84f5f88410eda19330c2a",
  "title": "Beet Caviar",
  "image": "http://www.101cookbooks.com/mt-static/images/food/beet_caviar_recipe.jpg",
  "href": "http://www.101cookbooks.com/archives/beet-caviar-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-12-30T07:32:03.479000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "If you have bourbon or vodka on hand, you can use one of those in place of the cognac.",
    "Preheat the oven to 400F with a rack in the center. Puncture the beets with a fork a few times, and roast for an hour, or until the beets are completely tender when you test by cutting into the center with a knife.",
    "In the meantime, gently heat the cognac in a small saucepan. Place the dates in a glass bowl, and, when just hot, pour the alcohol over the dates. Jostle around a bit, and soak for at least 10 minutes.",
    "When the beets are cooked and cool enough to peel, remove the skins and chop into cubes. Place in a food processor with the dates, cognac, and garlic. Puree until the texture is to your liking - I left a bit of texture here, but you can go smoother if you prefer.",
    "Transfer to a serving bowl before adding the lemon juice, walnuts, and salt. Taste, and adjust the seasoning if needed. Serve swirled with the creme fraiche, and finished with chives.",
    "Serves",
    "Adapted from The Eastern and Central European Kitchen: Contemporary and Classic recipes by Silvena Rowe (200.",
    "Print Recipe"
  ],
  "ingredients": [
    "0",
    "4 medium beets, washed and trimmed",
    "5 plump dates, pitted and chopped",
    "2 tablespoons cognac (bourbon, or vodka)",
    "4 garlic cloves, peeled and smashed",
    "2 tablespoons lemon juice, plus more to taste",
    "1/2 cup chopped toasted walnuts",
    "3/4 teaspoon fine grain sea salt",
    "3 tablespoons creme fraiche, plain yogurt, or sour cream",
    "1",
    "4 medium beets, washed and trimmed",
    "5 plump dates, pitted and chopped",
    "2 tablespoons cognac (bourbon, or vodka)",
    "4 garlic cloves, peeled and smashed",
    "2 tablespoons lemon juice, plus more to taste",
    "1/2 cup chopped toasted walnuts",
    "3/4 teaspoon fine grain sea salt",
    "3 tablespoons creme fraiche, plain yogurt, or sour cream"
  ],
  "__v": 1
}