{
  "hash": "9b15e4d1e9bad2974715c322cbd94534d3bba398",
  "title": "Sticky Onion Crunch Wings",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/sunny-anderson/sticky-onion-crunch-wings.html",
  "extension": "Chrome",
  "firstAdded": "2015-11-12T03:27:26.867000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "wings",
    "separated",
    "kosher",
    "salt",
    "black",
    "pepper",
    "peanut",
    "oil",
    "frying",
    "frenchfried",
    "onions",
    "frenchs",
    "hoisin",
    "pomegranate",
    "juice",
    "dark",
    "brown",
    "sugar",
    "garlic",
    "prepared",
    "horseradish",
    "scallions",
    "white",
    "green",
    "parts"
  ],
  "directions": [
    "0",
    "Put the wings on a baking sheet and season both sides with salt and pepper. Let stand at least 30 minutes and up to 2 hours.",
    "To make the sauce, in a small saucepan, mix together the hoisin, pomegranate juice, brown sugar, garlic, horseradish, scallions, and a few grinds of black pepper. Cook, stirring, over medium-high heat. When the sauce starts to boil, reduce the heat to a simmer and cook until thickened, about 20 minutes. Taste and season with salt.",
    "In a deep heavy pot, Dutch oven, or deep fryer, fill with oil to a depth of about 6 inches, and heat to 360 degrees F. Working in batches, fry the wings; the oil temperature will settle at about 350 degrees try to maintain that temperature by adjusting the heat while you fry. Fry the wings until golden brown, 12 to 14 minutes. Drain on paper towels.",
    "Put some of the sauce in a large mixing bowl and toss the wings in batches, adding more sauce as needed, until completely coated. Put the onions into another large bowl, add the sauced wings in batches and toss to thoroughly coat. Serve warm.",
    "\"Sunny's Kitchen: Easy Food for Real Life\" by Sunny Anderson (C) Clarkson/Potter 2013. Provided courtesy of Sunny Anderson. All rights reserved."
  ],
  "ingredients": [
    "0",
    "3 pounds chicken wings, whole or separated",
    "Kosher salt and freshly ground black pepper",
    "Peanut or vegetable oil, for frying",
    "1/2 cup French-fried onions (I like French's), crushed",
    "1 cup hoisin sauce",
    "1/2 cup pomegranate juice",
    "1/4 cup packed dark brown sugar",
    "2 garlic cloves, grated or minced",
    "1 tablespoon prepared horseradish",
    "4 scallions (white and green parts), finely chopped",
    "Kosher salt and freshly ground black pepper"
  ],
  "__v": 1
}