{
  "hash": "d9c7e238dea8a4fa0d3476d6ea2381763892ee65",
  "title": "Kruche babeczki z lekkim kremem Advocat",
  "image": "http://kuchniaprzemka.blog.pl/files/2015/10/IMG_10891-300x225.jpg",
  "href": "http://kuchniaprzemka.blog.pl/2015/10/18/kruche-babeczki-z-lekkim-kremem-advocat/",
  "extension": "",
  "firstAdded": "2016-09-17T13:04:52.053000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Wykonanie:",
    "Mąkę przesiewamy na stolnicę, dodajemy sól i cukier puder oraz cukier wanilinowy, mieszamy. Następnie dodajemy zimne masło i dokładnie siekamy wszystkie składniki aby powstała kruszonka. Teraz dodajemy żółtka (jeśli używamy pasty waniliowej to mieszamy ją z żółtkami i dodajemy razem do mąki). Całość najpierw zarabiamy nożem a następnie kilkoma zdecydowanymi ruchami zagniatamy ciasto, aby go zbytnio nie ogrzać. Jeśli ogrzejemy ciasto wtedy po upieczeniu wyjdzie niestety twarde. Ciasto zawijamy w folię spożywczą i wkładamy na około 2 godziny do lodówki.",
    "Po schłodzeniu ciasto wałkujemy na grubość około 4-5mm i wyklejamy nim foremki na babeczki wysmarowane wcześniej rozpuszczonym masłem. Ja użyłem płaskich i niskich foremek o śr. 8cm i z tej porcji ciasta wyszło 22 babeczki. Można oczywiście upiec je w mniejszych foremkach, to już zostawiam Waszej fantazji.",
    "Tak przygotowane ciasto nakłuwamy widelcem i wstawiamy d piekarnika nagrzanego do 200 stopni Celsjusza z termoobiegiem i pieczemy w zależności od piekarnika około 12-15 minut (u mnie 13 minut i babeczki były upieczone).",
    "IMG_1078",
    "Po upieczeniu babeczki wyciągamy z foremek i układamy na ruszcie aby pozostały kruche.",
    "Przygotowujemy krem.",
    "Serek mascarpone miksujemy z cukrem pudrem i pasta waniliową. Następnie ubijamy śmietanę i delikatnie łączymy obie części za pomocą łyżki lub szpatułki.",
    "Na koniec wlewamy likier i dalej mieszamy do połączenia składników.",
    "Tak przygotowanym kremem napełniamy wystudzone kruche spody. Na krem fantazyjnie układamy ulubione i najlepiej świeże, sezonowe owoce.",
    "Całość opruszamy startą czekoladą.",
    "Oczywiście w kwestii dekoracji mamy ogromne pole do popisu. Możemy użyć owoców, cukierków, żelków, kolorowych galaretek, posypek, orzechów, bakalii etc.",
    "Smacznego :)"
  ],
  "ingredients": [
    "0",
    "Idealnie kruche ciasto, puszysty i delikatny krem oraz sezonowe owoce, które dopełnia starta gorzka czekolada. Oto właśnie przepis na pyszne babeczki.",
    "Bardzo często w cukierniach spotykamy takowe ciastka, jednak najczęściej ciasto jest twarde lub rozmiękłe a krem ma „dziwny” i sztuczny smak.",
    "Ja dzisiaj proponuję przygotować taki przysmak własnoręcznie we własnej kuchni. Gwarantuję, że efekt będzie pyszny.",
    "Zapraszam do przepisu :)",
    "Składniki:",
    "300g mąki pszennej",
    "200g masła (standardowa kostka)",
    "100g cukru pudru",
    "5 żółtek",
    "1 łyżeczka pasty waniliowej lub 1 cukier wanilinowy",
    "szczypta soli",
    "250g serka mascarpone",
    "300ml śmietanki 30%",
    "70g cukru pudru",
    "1 łyżeczka pasty waniliowej lub 1 cukier wanilinowy",
    "100ml likieru jajecznego typu Advokat",
    "Owoce sezonowe",
    "Czekolada gorzka"
  ],
  "__v": 1
}