{
  "hash": "ab0f804f892448e5bd4949f784f53098cec4b917",
  "title": "Bacon Cheese and Spring Onion Scones",
  "image": "http://i.huffpost.com/gen/2052344/thumbs/o-CHEESE-SCONES-570.jpg?1",
  "href": "http://www.huffingtonpost.co.uk/2014/09/17/edd-kimber-baking-tips-scone-recipe_n_5784842.html",
  "firstAdded": "2014-12-16T15:17:15.671000",
  "users": [
    null
  ],
  "keywords": [
    "rashers",
    "streaky",
    "bacon",
    "spring",
    "onions",
    "mature",
    "cheddar",
    "selfraising",
    "flour",
    "baking",
    "caster",
    "sugar",
    "flora",
    "block",
    "chilled",
    "milk",
    "egg",
    "extra",
    "glazing",
    "dukah"
  ],
  "directions": [
    "0",
    "Method",
    "1.To make the scones preheat the oven to 180C (160C fan) and line a baking tray with parchment paper.",
    "2. Place the bacon into a non-stick frying pan and cook until beginning to crisp. Tip out onto a plate and allow to cool, before mixing together with the spring onions and the cheese.",
    "3. Place the flour, baking powder and sugar into a large bowl and mix together to combine. Add the diced flora block and using a pastry blender or two knives cut in the fat until it resembles coarse breadcrumbs - some pieces should be about pea sized. Add the bacon, spring onions and cheese and mix together. In a jug whisk together the milk and the egg.",
    "3. Make a well in the flour mixture and pour in the liquid. Using a knife bring the mixture together. Once a shaggy dough has been formed tip out on a lightly floured work surface and bring together into a uniform dough - don’t work too much or your scones will be tough.",
    "4. Pat the dough into a flat round a couple centimetres thick then use a knife to cut into 8 equal sized pieces. Place onto the prepared baking tray and brush the tops of the scones with a little egg or milk and sprinkle with the dukah. Bake in the preheated oven for 25-30 minutes or until golden brown. Allow to cool for a few minutes before serving. Best served warm on the day baked."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "8 rashers streaky bacon, diced",
    "5 spring onions",
    "150g mature cheddar, grated",
    "340g self-raising flour",
    "1 tsp baking powder",
    "1 tbsp caster sugar",
    "85g flora baking block, diced and chilled",
    "135ml whole milk",
    "1 large egg (plus extra for glazing)",
    "2 tbsp dukah"
  ],
  "__v": 1
}