{
  "hash": "87c856f85355527c7a316780ef1f3cc68a4666ee",
  "title": "Pasta carbonara",
  "image": "http://3.bp.blogspot.com/-l3Go8eM1EHc/U_vqTwJ_5sI/AAAAAAAAAf0/fizRV-YU9No/s1600/Pasta%2Bcarbonara%2Bno%2Bcream%2Bis%2Bused%2Band%2Ball%2Bgrease%2Bis%2Bdrained%2Bfrom%2Bbacon%2BPlus%2Blots%2Bof%2Bfresh%2Bparsley%2Bonions%2Band%2Bsome%2Bgarlic.png",
  "href": "http://foodie-place.blogspot.com/2014/08/pasta-carbonara-no-cream-is-used-and.html",
  "firstAdded": "2015-02-20T01:47:53.847000",
  "users": [
    null
  ],
  "keywords": [
    "bacon",
    "pancetta",
    "onion",
    "garlic",
    "white",
    "wine",
    "chicken",
    "stock",
    "bunch",
    "parsley",
    "eggs",
    "parmesan",
    "cheese",
    "linguine",
    "pasta",
    "butter",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "Slice bacon into thin slices and cook on stove top until cooked. Drain bacon from grease on paper towels and set aside. Reserve some grease for cooking onions in step 2.",
    "Chop onion finely and cook diced onion in a reasonable amount of bacon grease (1 or 2 tablespoons) for 2-3 minutes over medium-high constant stirring to avoid burning.",
    "Slice the garlic and add it to the onions, after the onions have cooked for a couple of minutes. Cook garlic and onion together for 2 more minutes and remove them from the pan, using slotted spoon. Discard the grease.",
    "Place the same pan (where you cooked onion and garlic in bacon grease) back on high heat, pour in the white wine (or stock) to deglaze the pan. Stir, scraping the bits off the bottom of the pan. Add 1/2 cup chicken stock. Return bacon, onion and garlic back to the pan. Let simmer covered over low heat, do not let too much liquid (chicken stock) to evaporate.",
    "Chop the parsley. Crack eggs into a large bowl. Add Parmesan cheese and chopped parsley to the eggs. Leave a little Parmesan and parsley out for a garnish. Mix well with a fork.",
    "Cook pasta in a large pot of boiling water according to pasta instructions, al dente. Drain the pasta and add very hot pasta to the egg mixture and mix thoroughly. Then add bacon, onion, and garlic mixture to the pasta, mix again. Add 2 tablespoons of butter to mix. Salt and pepper to taste and garnish with grated Parmesan cheese and chopped parsley."
  ],
  "ingredients": [
    "0",
    "1/2 pound bacon or pancetta",
    "1 whole small onion",
    "5 cloves garlic",
    "1/2 cup white wine (or chicken or vegetable stock)",
    "1/2 cup chicken stock",
    "1/2 bunch parsley",
    "2 whole eggs",
    "1/2 cup Parmesan cheese plus more for garnish",
    "1/2 pound linguine pasta",
    "2 tablespoons butter",
    "1 teaspoon black pepper"
  ],
  "__v": 1
}