{
  "hash": "344fb45eacde7f09070c851e46c5f15d2b2c4c88",
  "title": "Angela (Oh She Glows)",
  "image": "http://cdn.ohsheglows.com/wp-content/uploads/2014/04/easiestspelttortillas.jpg",
  "href": "http://ohsheglows.com/2014/04/14/easiest-5-ingredient-spelt-flatbread/",
  "extension": "",
  "firstAdded": "2015-11-02T12:32:40.765000",
  "users": [
    null
  ],
  "keywords": [
    "light",
    "spelt",
    "flour",
    "salt",
    "baking",
    "soda",
    "boiling",
    "water",
    "extra",
    "virgin",
    "olive",
    "oil"
  ],
  "directions": [
    "0",
    "In a large bowl, whisk together the flour, salt, and baking soda.",
    "Stir in the hot water and oil until a shaggy looking dough comes together.",
    "Knead the dough with your hands about 15 times, soaking up the extra flour at the bottom of the bowl as you go. If the dough is still too wet, add a touch of flour and knead again.",
    "Shape dough into a ball and place in the bowl. Cover with a tea towel so it doesn’t dry out.",
    "Preheat a large skillet over medium heat.",
    "Grab a chunk of dough just larger than a golf ball. Shape into a ball and sprinkle on some spelt flour to coat lightly.",
    "Place a large nonstick baking mat on the counter and flour a rolling pin. You can also use parchment paper instead of a nonstick mat. Sprinkle the mat with a dusting of flour.",
    "Roll the dough all directions into a circular shape until it's paper thin. It’s ok if it’s not a perfect circle - mine usually come out all kinds of odd shapes! Drizzle the tortilla with a tiny bit of olive oil and spread it out to coat the entire surface.",
    "Place the tortilla on the preheated skillet, oil side down. Cook over medium heat for around 30 seconds and then flip it with a spatula and cook for another 30 seconds or so. If you cook for too long, your tortilla might be prone to tearing or drying out, so keep that in mind.",
    "Place cooked tortillas on a plate and cover with a tea towel to prevent drying. Repeat steps for the rest.",
    "Store leftovers on a plate with a lightly damp paper towel spread out on top. Cover the plate with plastic wrap and place in fridge."
  ],
  "ingredients": [
    "0",
    "2 cups + 2 tablespoons light spelt flour (see note)",
    "1/2 teaspoon fine grain sea salt",
    "1/2 teaspoon baking soda",
    "3/4 cup almost boiling water",
    "1 tablespoon extra virgin olive oil"
  ],
  "__v": 1
}