{
  "hash": "395e1645d0cf18db62bbb02f90506d984974d775",
  "title": "One-Pan Bucatini with Leeks and Lemon",
  "image": "https://images.food52.com/wPGSqVr3D9ZDrGhyb-_LOuwRnas=/753x502/57ca5cee-58ce-42b5-8402-dad7072adf83--bucatiniwithleeksandlemon.jpg",
  "href": "https://food52.com/recipes/64978-one-pan-bucatini-with-leeks-and-lemon",
  "extension": "Chrome",
  "firstAdded": "2016-11-03T09:25:26.035000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Trim off the root end and dark green portions of each leek. Slice in half lengthwise. At this point, you want to slice the leek into long, thin strips. This is the method I have been using: Place each half cut side up, and slice in half again, then slice each half in half again — essentially you're cutting the leek into eights. Once the leek is in eighths, most of the strips will be nice and thin — you may just need to cut the outer most layers in half again. If leeks are dirty, soak them in a bowl of cold water to allow dirt to settle. Once clean, scoop leeks out from bowl.",
    "Combine leeks, pasta, garlic, 1/4 teaspoon red pepper flakes (or more if you like heat), oil, 2 teaspoons kosher salt, pepper to taste, and water in a large straight-sided skillet (the bucatini should nearly lay flat).",
    "Bring to a boil over high heat. Simmer mixture, stirring and turning pasta frequently with tongs or a fork, until pasta is al dente and water has nearly evaporated, about 9 minutes. Add lemon zest and parsley and toss to coat.",
    "Season to taste with salt (I consistently add another 1/2 teaspoon kosher salt plus more to taste), pepper, and pepper flakes for more heat. Serve with Parmesan, if using."
  ],
  "ingredients": [
    "0",
    "1 to 1 1/2 pounds leeks",
    "12 ounces bucatini, see notes above",
    "4 cloves of garlic, thinly sliced",
    "1/4 to 1/2 teaspoons red pepper flakes",
    "2 tablespoons extra-virgin olive oil",
    "kosher salt",
    "freshly cracked black pepper",
    "4 1/2 cups water",
    "Zest of one lemon",
    "1/2 cup finely chopped parsley",
    "Parmigiano Reggiano, for serving, optional"
  ],
  "__v": 1
}