{
  "hash": "e0cfa18cc343d296a411ea2a331e556bedc00fa5",
  "title": "Easy Crispy Honey Garlic Salmon",
  "image": "http://ifoodreal.com/wp-content/uploads/2014/08/FG-easy-crispy-honey-garlic-salmon-recipe.jpg",
  "href": "http://ifoodreal.com/easy-crispy-honey-garlic-salmon-recipe/",
  "extension": "Chrome",
  "firstAdded": "2015-09-14T12:40:15.785000",
  "users": [
    null
  ],
  "keywords": [
    "honey",
    "lemonlime",
    "juice",
    "squeezed",
    "best",
    "garlic",
    "salt",
    "black",
    "pepper",
    "salmon",
    "fillets",
    "skin",
    "onoff",
    "coconut",
    "extra",
    "virgin",
    "olive",
    "oil",
    "green",
    "onions"
  ],
  "directions": [
    "0",
    "In a small bowl, whisk together honey, lemon/lime juice, garlic, salt and pepper. Place salmon fillets in a large resealable Ziploc bag and pour marinade over. Squeeze as much air out as possible and seal the bag. Gently move fillets around inside the bag to make sure they are all evenly coated. Place flesh side down and let marinate 15 minutes.",
    "Preheat large non-stick skillet on low - medium heat and add oil, making sure it coats the bottom of the skillet evenly. Place salmon fillets flesh side down leaving enough space in between them. Cover with a lid and cook for 3 minutes. Remove the lid, cook another minute and flip over. Repeat: cover, cook for 3 minutes, remove the lid and cook for another minute. If your skillet is not large enough, I recommend cooking in two batches. If you over crowd the skillet, cooking time increases by a few minutes for each step. Serve hot garnished with green onions, alongside quinoa and steamed broccoli - my favourite."
  ],
  "ingredients": [
    "0",
    "2 tbsp honey",
    "1 tbsp lemon/lime juice (freshly squeezed is best)",
    "2 - 3 large garlic cloves, crushed",
    "1/2 tsp salt",
    "1/2 tsp ground black pepper",
    "6 x 3 oz each salmon fillets, skin on/off",
    "1 - 2 tsp coconut oil or extra virgin olive oil",
    "2 green onions, finely chopped"
  ],
  "__v": 1
}