{
  "hash": "5f430658d4103f51b0beb3569c02149b1c7b4244",
  "title": "Soba and Tofu in Ginger Broth",
  "image": "",
  "href": "http://recipe-folder.com/recipe/5bd4c9239d3ecd0639792089",
  "extension": "User Added",
  "firstAdded": "2018-10-27T20:22:59.406000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium saucepan, combine scallion whites, ginger, garlic, soy sauce, rice vinegar, and 8 cups water; bring to a boil. Cover and reduce to a simmer. Cook until broth is flavorful, about 10 minutes.",
    "1",
    "Meanwhile, heat a grill pan over medium-high; lightly oil. Slice tofu in half; season with salt and pepper. Add tofu pieces to hot pan and cook, turning to grill all sides, about 15 minutes total. Remove from pan; once cool enough to handle, cut into small cubes.",
    "2",
    "Strain aromatics from broth with a slotted spoon; discard solids. Bring broth to a boil; add soy sauce and soba. Cook soba according to package directions. About 1 minute before the end of cooking, add bok choy, snow peas, and chile. Cook until veggies are tender-crisp. Add more soy sauce, if desired. To serve, place noodles in bowl with broth; top with tofu, scallion greens, and sesame seeds."
  ],
  "ingredients": [
    "0",
    "1 bunch scallions (6 scallions), whites and greens separated, greens cut into 2-inch lengths and thinly sliced lengthwise",
    "1",
    "1 ounce ginger, peeled and sliced",
    "2",
    "2 garlic cloves, smashed",
    "3",
    "2 teaspoons reduced-sodium soy sauce, plus more for seasoning",
    "4",
    "1 tablespoon rice vinegar",
    "5",
    "Canola oil, for grill pan",
    "6",
    "1 package (14 ounces) extra-firm tofu, drained and pressed",
    "7",
    "Coarse salt and freshly ground pepper",
    "8",
    "Morton Iodized Salt",
    "9",
    "26 oz",
    "10",
    "Find at a store",
    "11",
    "6 ounces soba noodles",
    "12",
    "1 head baby bok choy (4 ounces), trimmed, thinly sliced on bias",
    "13",
    "4 ounces snow peas, trimmed, halved on the bias",
    "14",
    "1 red serrano chile, thinly sliced crosswise",
    "15",
    "1 teaspoon black sesame seeds, for garnish"
  ],
  "__v": 1,
  "hidden": true
}