{
  "hash": "260cfd7debd5abc6acf5abe0485c93f992f1c6a7",
  "title": "\"Pot-Stuck\" Brussels Sprouts",
  "image": "https://images.food52.com/GoCp2lVkWG-e5w7LClKYFRaFNVw=/753x502/0a4868f2-e23e-49ad-a89e-feb1b46fca84--Brussles2.jpg",
  "href": "https://food52.com/recipes/24488-pot-stuck-brussels-sprouts",
  "extension": "Chrome",
  "firstAdded": "2016-10-01T15:55:10.924000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Bring a pot of heavily salted water to a boil. Blanch your brussels sprouts for 30 seconds, drain, and dry thoroughly.",
    "The key to getting a good char on your brussels sprouts is making sure they don't crowd. If you're working with a large pan (e.g. a 10-inch cast iron skillet), cook them all at once. If your pan is smaller, fry in two batches. Heat oil over medium to medium-high heat. Add one sprout, cut-side down; if it begins to sizzle immediately, add the rest. You want most of them to land cut-side down, but don't drive yourself crazy.",
    "Let your sprouts cook, untouched, for a minute or so, and then check them. If they're white or light brown on the bottom, let them cook a bit more. You want to wait to flip them until they are charred and almost black. Once they are, flip to the other side, and wait for side two to cook until crispy. Add salt, toss a few times, then move them all to the edge of the pan.",
    "Add your onion (or half of the onion, if you're working in batches) to the pan. If it looks very dry, add a touch more oil. If you're worried about them burning, turn the heat down a bit. Let them cook for a minute or two, stirring lightly, until they soften slightly.",
    "Toss onions and sprouts together; let them cook for 30 more seconds. Add a squeeze of lemon juice, allow everything to steam for a moment, and then you're done! Taste for salt. Fry your second batch now, if it's still waiting for you.",
    "Note: These taste great at any temperature, so don't stress about timing."
  ],
  "ingredients": [
    "0",
    "1/2 pound medium-sized brussels sprouts, quartered",
    "2 to 3 tablespoons extra-virgin olive oil",
    "1/4 cup finely diced onion",
    "1/2 lemon",
    "Salt, to taste"
  ],
  "__v": 1
}