{
  "hash": "ba47cad835c8d3f73bfa81ae26e9cca22b6c6c99",
  "title": "Seville orange marmalade",
  "image": "",
  "href": "http://www.bbcgoodfood.com/recipes/3383/seville-orange-marmalade",
  "extension": "Chrome",
  "firstAdded": "2016-11-14T11:24:45.382000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Method",
    "Halve the oranges and squeeze the juice into a large stainless-steel pan. Scoop the pips and pulp into a sieve over the pan and squeeze out as much juice as possible, then tie the pulp and pips in the muslin. Shred the remaining peel and pith, either by hand with a sharp knife or in a food processor (a food processor will give very fine flecks rather than strips of peel). Add the shredded peel and muslin bag to the pan along with the water. Leave to soak overnight. This helps to extract the maximum amount of pectin from the fruit pulp, which will give a better set. It also helps to soften the peel, which will reduce the amount of cooking needed.",
    "Put the pan over a medium heat, then bring up to a simmer. Cook, uncovered, for 1½-2 hrs, until the peel has become very soft. (The cooking time will be affected by how thickly you have cut the peel.) To see if the peel is ready, pick out a thicker piece and press it between your thumb and finger. It should look slightly see-through and feel soft when you rub it.",
    "Carefully remove the muslin bag, allow to cool slightly, then, wearing the rubber gloves, squeeze out as much liquid as possible to extract the pectin from the fruit pulp. Discard the bag and weigh the simmered peel mixture. There should be between 775-800g; if less, then top up with water to 775g.",
    "Put 4 small plates in the freezer, ready to use when testing for setting point. Add the sugar to the pan, then put over a low heat. Warm gently so that the sugar dissolves completely, stirring occasionally. Do not boil, before the sugar is dissolved.",
    "Increase the heat and bring up to the boil but do not stir while the marmalade is boiling. After about 5 mins the marmalade will start to rise up the pan (it may drop back and then rise again) and larger bubbles will cover the surface. After 8-10 mins boiling, test for setting point. Times will vary according to the size of the pan – in a large pan this takes 7-8 mins, in other pans it may take 12-15 mins. As setting point can be easily missed it’s better to test too early than too late.",
    "To test the setting point: take the pan off the heat and allow the bubbles to subside. Take a plate from the freezer and spoon a little liquid onto the plate, then return to the freezer for 1 min. Push the marmalade along the plate with your finger. If setting point has been reached then the marmalade surface will wrinkle slightly and the marmalade won’t run back straight away. If it’s not at setting point, return to the heat and boil again for 2 mins before re-testing. Repeat until setting point is reached. If you have a sugar thermometer, setting point is reached at 105C, but it’s good to do the plate test as well.",
    "Leave the marmalade to stand for 10 mins or until starting to thicken. If there’s any scum on the surface, spoon it off. Transfer the marmalade to sterilised jars. Cover with a wax disc (wax side down) and seal. When cold, label the jars and store in a cool, dark cupboard. The marmalade should keep for up to a year."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "4 Seville orange",
    "(about 500g/1lb 2oz in total), scrubbed",
    "1.7l water",
    "1kg granulated sugar"
  ],
  "__v": 1
}