{
  "hash": "1d97f002052e03eb64f1025c6eeed2807c1d29ba",
  "title": "Phở Bo Tai",
  "image": "",
  "href": "http://www.menudomu.cz/pho-bo/",
  "extension": "Chrome",
  "firstAdded": "2015-09-10T09:16:04.238000",
  "users": [
    null
  ],
  "keywords": [
    "ingredience",
    "velk",
    "men",
    "porce",
    "vvaru",
    "vsledku",
    "cca",
    "morkovch",
    "kost",
    "hovz",
    "ohky",
    "nebo",
    "ebra",
    "kousek",
    "zzvoru",
    "cel",
    "skoice",
    "lut",
    "cibule",
    "badynu",
    "kardamomu",
    "liky",
    "soli",
    "lika",
    "cukru",
    "pop",
    "lce",
    "ryb",
    "omky",
    "konen",
    "dochucen",
    "porc",
    "polvky",
    "viz",
    "dkg",
    "hovzho",
    "masa",
    "tenk",
    "pltky",
    "tvereky",
    "rovch",
    "nudl",
    "erstv",
    "koriandr",
    "podle",
    "chuti",
    "jarn",
    "mlad",
    "cibulky",
    "nat",
    "stedn",
    "erven",
    "hrst",
    "mungo",
    "klk",
    "chilli",
    "paprika",
    "citron",
    "limeta",
    "ppadn",
    "perila"
  ],
  "directions": [
    "0",
    "Než se dostaneme k nástrahám v receptuře, věnujme se svízeli s výslovností. Počesku přečtené prostě phó je samozřejmě tragicky nesprávné. Googlila jsem výslovnosti nahrané ženami i muži z Vietnamu a shodovali se s tím, co mě učili i naši trhovníci na rohu, kam chodím každý den pro gambáč = fá – trochu, jako byste chtěli říct spíš fhá, ale „h“ téměř zmizí. Rozumy k samotnému vaření jsem sbírala jak u Wiet Food Friends na blogu, tak po videích na youtube a vůbec skrze internety. Všude se návody v různých bodech liší.",
    "Těžké chvilky vás mohou provázet už během nákupu. Pražským a skoro pražským rovnou radím: jeďte do SAPY, seženete tam všechno po kupě a navíc za pár kaček. Do pravé Phở patří perila. Mimo SAPU ji maloobchodně neseženete, jen některé restaurace ji zjara braly z Itálie, protože jaksi nebyly české kopřivy a jarní meníčka si tuto ingredienci žádají. Jedno důležité upozornění – perila hodně jako naše kopřiva vypadá, ale absolutně jinak chutná. Pokud byste trvali na tom, že nesmí absentovat, kupte perilu v semínkách (tu mají celkem běžně), zasaďte a uvařte vietnamskou polévku až za dva měsíce. S mexickým (nebo také čínským) koriandrem je to ještě víc na houby – nicméně myslím, že je to nejpostradatelnější složka věci. Chutná jako koriandr, ale mnohem víc mýdlovitě. Už takhle budete mít v polévce zeleno do sytosti. Obě tyto rostliny seženete v obřím pytli v SAPĚ po dvacce :-D Stejně tak celý pytel papriček, klíčků, koriandru…",
    "Triangl koření: badyán, kardamom a skořice jsou pro výsledný šmak i charakteristickou vůni polévky nepostradatelné. Opět pytle s jednotlivými zmíněnými stojí v Libuši dvacet až třicet korun. Všechny položky jistě seženete i v obchodech, které se specializují na koření, ale mnohem menší množství za vyšší cenu. Čtvrtého mušketýra, zázvor, dnes už seženete v pohodě v každém supermarketu. O cibuli nemluvě.",
    "Na Phở Bo Tai není třeba žádné vařené maso – dává se sem jen to syrové přelité vývarem. Klasická Phở Bo obsahuje ale plátky masa, ze kterého celou dobu táhnete vývar, takže s tím chce počítat už rovnou. Buď stačí nakoupit jen morkové kosti a oháňku a pak doplnit třeba tou falešnou svíčkovou a nebo rovnou vzít plec nebo kližku a morkové kosti a následně maso dovnitř nakrájet. Kosti se všude vždy i několikrát převařují a proplachují – jejich prvotní zapečení je můj vynález, abychom si ušetřili starosti, čas i nehezkou podívanou. Nemyslím, že by to výslednému aromatu vývaru dávalo cokoli, co by bylo proti požadovanému výsledku.",
    "Co se týče rýžových nudlí, vezměte střední cestu co do jejich šířky (asi 4 mm). Můžete je do polévky uvařit i podle návodu, tedy bez namáčení asi 3 minuty a pak propláchnout. Nemyslím, že poznáte rozdíl oproti předešlému namočení a pak vaření v sítku – tuhle frajeřinku jsem ale viděla ve většině videích a možná má svůj důvod, leč mně zatím tedy skrytý. V restauracích dávají často více než jeden čtverec, spíš tak jednu a půl porce na úkor množství vývaru. Já mám ten voňavý vývar ráda, takže jsem ho dala víc na nudlový úkor.",
    "Obvykle se dává celkový objem polévky včetně všech surovin uvnitř na jednu porci cca 650 ml, z čehož je minimálně 300 ml vývar – záleží na množství nudlí. Jedná se pak o hlavní jídlo. Lehké, voňavé, ale nasytí až až. Doma si porci můžete samozřejmě zmenšit."
  ],
  "ingredients": [
    "0",
    "Ingredience na 3 velké, 4 menší porce vývaru (ve výsledku cca 1,2 l )",
    "500g morkových kostí",
    "500g hovězí oháňky nebo žebra",
    "5 cm kousek zázvoru",
    "1 ks celé skořice",
    "1 velká žlutá cibule",
    "5 ks badyánu",
    "4 ks kardamomu",
    "3 lžičky soli",
    "1 lžička cukru",
    "popř. lžíce rybí omáčky na konečné dochucení",
    "Ingredience do 3 porcí polévky",
    "1,2 l vývaru, viz výše",
    "15 dkg hovězího masa na tenké plátky",
    "3 porce (čtverečky) rýžových nudlí",
    "čerstvý koriandr podle chuti",
    "3-4 jarní nebo mladé cibulky i s natí",
    "1 střední červená cibule",
    "3-5 hrstí mungo klíčků",
    "chilli paprička",
    "citron nebo limeta",
    "případně perila"
  ],
  "__v": 1
}