{
  "hash": "1e6489d75373c8435ca642d3a7a63da51f7d0771",
  "title": "Bacon, Tomato and Cheddar Breakfast Bake with Eggs",
  "image": "http://ds.serving-sys.com/BurstingCachedScripts/Res/blank_1X1.gif",
  "href": "http://www.foodandwine.com/recipes/bacon-tomato-and-cheddar-breakfast-bake-with-eggs",
  "extension": "Chrome",
  "firstAdded": "2016-02-11T22:58:36.458000",
  "users": [
    null
  ],
  "keywords": [
    "bakery",
    "white",
    "bread",
    "cubes",
    "extravirgin",
    "olive",
    "oil",
    "applewoodsmoked",
    "bacon",
    "pieces",
    "onion",
    "italian",
    "tomatoesdrained",
    "patted",
    "dry",
    "red",
    "pepper",
    "extrasharp",
    "cheddar",
    "monterey",
    "jack",
    "cheese",
    "snipped",
    "chives",
    "lowsodium",
    "chicken",
    "broth",
    "salt",
    "eggs",
    "hot"
  ],
  "directions": [
    "0",
    "Preheat the oven to 350°. Lightly oil a 9-by-13-inch glass baking dish. In a large bowl, toss the bread with the olive oil and spread on a large rimmed baking sheet. Bake for about 20 minutes, tossing once or twice, until the bread is golden and lightly crisp.",
    "Meanwhile, in a large skillet, cook the bacon over moderately high heat, stirring occasionally, until crisp, about 8 minutes. Transfer the bacon to paper towels to drain; reserve 2 tablespoons of the fat in the skillet.",
    "Add the onion to the skillet and cook over moderate heat, stirring occasionally, until softened, about 5 minutes. Add the tomatoes and crushed red pepper and cook until any liquid is evaporated, about 3 minutes.",
    "Return the toasted bread cubes to the bowl. Add the contents of the skillet, along with the bacon, shredded cheeses, chives and broth. Stir until the bread is evenly moistened. Season with salt. Spread the mixture in the baking dish and cover with lightly oiled foil.",
    "Bake the bread mixture in the center of the oven for 30 minutes. Remove the foil and bake until the top is crispy, about 15 minutes longer. Carefully remove the baking dish from the oven and, using a ladle, press 8 indentations into the bread mixture. Crack an egg into each indentation. Return the dish to the oven and bake for about 15 minutes, until the egg whites are set but the yolks are still runny. Serve the breakfast bake right away with hot sauce."
  ],
  "ingredients": [
    "0",
    "1 pound bakery white bread, cut into 1-inch cubes (16 cups)",
    "1/4 cup extra-virgin olive oil",
    "1 pound sliced applewood-smoked bacon, cut into 1/2-inch pieces",
    "1 large onion, halved and thinly sliced",
    "One 28-ounce can whole Italian tomatoes—drained, chopped and patted dry",
    "1/2 teaspoon crushed red pepper",
    "1/2 pound extra-sharp cheddar, shredded (about 2 cups)",
    "1/2 pound Monterey Jack cheese, shredded (about 2 cups)",
    "2 tablespoons snipped chives",
    "1 3/4 cups low-sodium chicken broth",
    "Salt",
    "8 large eggs",
    "Hot sauce, for serving"
  ],
  "__v": 1
}