{
  "__v": 1,
  "directions": [
    "0",
    "Begin by preparing the lemon curd filling for the croissants.",
    "Place the lemon zest and juice, butter and sugar in a heat proof bowl set over a saucepan of gently simmering water – make sure that the bottom of the bowl doesn’t touch the water in the pan.",
    "Stir gently until the butter and sugar has melted.",
    "In a separate bowl, mix the egg and egg yolk with a fork, then pour into the lemon mixture. Cook, stirring regularly, over the simmering water for approx. 10 minutes, until the mixture is thick and custardy.",
    "Remove from the heat and let cool. Pour into a clean bowl or jar and pop into the fridge until needed*",
    "Preheat oven to 200C",
    "Place the puff pastry sheet on a lightly floured surface and halve lengthways, to create to equal sized rectangles. With a rolling pin, roll out each rectangle to approx. 18cm x 25cm.",
    "Cut each rectangle in half diagonally to create 4 triangles.",
    "With the widest edge of the triangle closest to you, place a dollop of the lemon curd about 1.5cm in from the wide edge of the triangle.",
    "Carefully roll the lemon curd filled end towards the point of the triangle, pinching the pastry together as you begin to roll to make sure that the curd is nice and secure inside the dough during the time in the oven.",
    "When you reach the end of the pastry, curl the ends in towards the centre slightly to create a half moon shape.",
    "Repeat with remaining triangles.",
    "Place the rolled croissants on a baking tray lined with baking paper.",
    "Brush with beaten egg and pop the croissants into the oven – reducing the heat to 180C immediately – bake for 15-20 minutes, until puffed, crisp and golden.",
    "Remove from oven and allow to cool slightly before dusting with icing sugar.",
    "*If sealed properly in a jar, the curd should last in the fridge for a few weeks",
    "Makes 4 croissants"
  ],
  "firstAdded": "2014-09-08T19:35:13.959000",
  "hash": "b142ae3a9e216ce5b07cc4dd06dba3e9bf708ac8",
  "href": "http://fingerforkknife.com/2013/06/06/lemon-curd-croissants/",
  "image": "http://fingerforkknife.files.wordpress.com/2013/06/photo-1-51.jpg?w=610",
  "ingredients": [
    "0",
    "1 sheet good quality all-butter puff pastry – I used the Carême brand",
    "For the lemon curd:",
    "Zest a juice of 2 lemons",
    "50g unsalted butter, cut into cubes",
    "1 egg and 1 egg yolk",
    "100g caster sugar",
    "Egg, for brushing",
    "Icing sugar, for dusting"
  ],
  "keywords": [
    "sheet",
    "good",
    "quality",
    "allbutter",
    "puff",
    "pastry",
    "used",
    "carme",
    "brand",
    "lemon",
    "curd",
    "zest",
    "juice",
    "lemons",
    "unsalted",
    "butter",
    "cubes",
    "egg",
    "yolk",
    "caster",
    "sugar",
    "brushing",
    "icing",
    "dusting"
  ],
  "title": "Lemon Curd Croissants",
  "users": [
    null
  ]
}