{
  "hash": "4cc08498dbeb1a6938acb7ac4fbbe84272245eae",
  "title": "Butterscotch Caramel Peach Cobbler",
  "image": "http://i0.wp.com/parsleysagesweet.com/wp-content/uploads/2013/04/cob11.jpg?resize=600%2C483",
  "href": "http://www.parsleysagesweet.com/2013/04/08/butterscotch-peach-cobbler-and-part-20-2/",
  "extension": "Chrome",
  "firstAdded": "2016-07-14T17:55:13.053000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine the ¾ cup brown sugar and ¼ cup water in a saucepan and mix well. Bring to a boil then turn the heat to medium low and let simmer until the sugar is dissolved. Stir in the heavy cream, corn syrup, and butter (be careful as it may bubble up) and let simmer until it very lightly coats the back of a spoon. Stir in sliced the peaches and simmer for 2 more minutes. Remove the saucepan from the heat and stir in vanilla extract and salt. Pour the butterscotch caramel peaches into a large bowl, using a rubber spatula to scrape out every bit of sauce as you don't want to lose any of this deliciousness! Let sit and cool while you prepare the batter.You can also use all white sugar, as stated in the ingredients section, for a more predominant caramel than butterscotch flavor. See Notes at the end of the recipe.",
    "Place the stick of butter on the bottom of an 8 x 8 square glass baking dish and let it melt in a 350 F oven. While butter is melting (keep checking so it doesn't burn), make the batter. Leave the oven at 350 F after you remove the baking dish with melted butter.",
    "For the batter. In a bowl, mix the ½ cup sugar, flour, baking powder and salt together. Slowly pour in the milk, stirring, to prevent clumps, until smooth. Stir in vanilla extract. Pour mixture over melted butter, but DO NOT STIR. Carefully spoon all the peaches and syrup on top of the batter. Do not mix or stir. You want three separate layers; 1. melted butter, 2. batter,fruit in syrup.",
    "Place the baking dish on the middle rack in the oven and bake for 40-50 minutes. The batter will rise to the top and it's done when it's golden brown. Serve warm with ice cream, yogurt, creme fraiche and/or whipped cream."
  ],
  "ingredients": [
    "0",
    "1½ to 2 lbs fresh peaches (about 3 or 4 large peaches), peeled, pitted and sliced, to equal 3 to 4 cups)",
    "⅔ cup light or dark brown sugar. You can also use all white sugar for a more predominant caramel over butterscotch flavor. See Notes *",
    "1 tablespoon butter",
    "¼ cup water",
    "¼ cup heavy cream",
    "3 tablespoons corn syrup (either light or dark is fine)",
    "½ teaspoon pure vanilla extract",
    "⅛ teaspoon salt",
    "1",
    "1 stick of butter (4 oz), melted in the baking dish (I used an 8 x 8-inch glass square)",
    "1 cup All-Purpose flour",
    "1½ teaspoons baking powder",
    "½ teaspoon salt",
    "½ cup sugar",
    "1 cup milk",
    "½ teaspoon pure vanilla extract"
  ],
  "__v": 1
}