{
  "hash": "38ff9dc0dcc7624e5056b8106380fce0ad13639a",
  "title": "Matzo Ball Soup Recipe for Passover [Vegan]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/04/matzoball.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/matzo-ball-soup/",
  "extension": "Chrome",
  "firstAdded": "2015-05-13T12:22:47.839000",
  "users": [
    null
  ],
  "keywords": [
    "flaxseeds",
    "egg",
    "replacer",
    "seltzer",
    "water",
    "matzo",
    "meal",
    "flour",
    "create",
    "grinding",
    "quinoa",
    "strong",
    "blender",
    "salt",
    "black",
    "pepper",
    "dill",
    "coconut",
    "oil",
    "yellow",
    "onion",
    "celery",
    "slices",
    "garlic",
    "pressed",
    "stock",
    "carrot",
    "mushrooms",
    "try",
    "cremini",
    "button"
  ],
  "directions": [
    "0",
    "Prepare the matzo balls: Place water in a large pot and bring to a boil over high heat. Meanwhile, place the ground flaxseeds in a bowl with 3/4 cup plus 2 tablespoons of the seltzer water and stir well. Add the remaining matzo ball ingredients and mix well. Form into a loaf. Add a small amount of additional seltzer water, if necessary, to hold the loaf together. You are looking for a slightly moist consistency, just enough to have all the ingredients come together. Transfer to a clean, dry cutting board. Pinch off twelve equal portions to form balls about 1 inch in diameter.",
    "Place the matzo balls in the boiling water. Lower the heat to medium-high. After a few minutes, the matzo balls will rise to the top. Cook for an additional 45 minutes.",
    "Meanwhile, prepare the soup: Place the oil in a 3-quart pot over medium-high heat. Add the onion, celery, and garlic and cook for 5 minutes, stirring frequently and adding small amounts of water, if necessary, to prevent sticking.",
    "Lower the heat to medium, add the vegetable stock, carrot, mushrooms, salt, and pepper, and cook for 20 minutes, stirring occasionally.",
    "When the matzo balls are done cooking, transfer them to the pot of soup, add the dill, and cook for 5 minutes, stirring occasionally. Serve one or two matzo balls per serving of soup."
  ],
  "ingredients": [
    "0",
    "1/4 cup ground flaxseeds or egg replacer",
    "1 cup seltzer water or water",
    "1 cup matzo meal",
    "1/4 cup quinoa flour (you can create it yourself by grinding quinoa in a strong blender)",
    "1 1/2 teaspoons sea salt",
    "1/4 teaspoon ground black pepper",
    "1/4 teaspoon dried dill (optional)",
    "1",
    "1 tablespoon coconut or other oil",
    "1 1/2 cups thinly sliced yellow onion",
    "1 cup sliced celery (1/4 inch slices)",
    "4 garlic cloves, pressed or minced",
    "7 cups vegetable stock or water",
    "1 1/4 cups sliced carrot (1/2 inch slices)",
    "1 cup sliced mushrooms (try cremini or button)",
    "2 teaspoons sea salt, or to taste",
    "1/2 teaspoon ground black pepper",
    "1 1/2 tablespoon minced fresh dill"
  ],
  "__v": 1
}