{
  "hash": "358a3f944099145a0c296225577ef707063310d0",
  "title": "20 Minute Lemon Broccoli Pasta Skillet",
  "image": "http://cf.thefoodcharlatan.com/wp-content/uploads/2015/11/IMG_7432.jpg",
  "href": "http://thefoodcharlatan.com/2015/12/09/20-minute-lemon-broccoli-pasta-skillet-recipe/",
  "extension": "Chrome",
  "firstAdded": "2016-04-05T23:06:08.375000",
  "users": [
    null,
    null
  ],
  "keywords": [
    "quarts",
    "water",
    "salt",
    "broccoli",
    "rotini",
    "pasta",
    "spinach",
    "butter",
    "lemon",
    "zested",
    "juiced",
    "garlic",
    "red",
    "pepper",
    "parmesan",
    "olive",
    "oil",
    "wedges"
  ],
  "directions": [
    "0",
    "In a large skillet or pot, bring the salt and water to a boil.",
    "While you wait, prep your broccoli by trimming the stems and cutting the florets into similar sized pieces (I like mine bite-size.)",
    "Add the rotini and boil on high for 4 minutes. Add the broccoli, cover, and set a timer for 3 minutes (Leave the burner on high enough to keep a rolling boil).",
    "When the timer goes off, turn off the heat and drain the pasta using a lid or colander. Return to the pan and stir in the spinach.",
    "Sprinkle with lemon zest. Let it sit for a few minutes so the spinach wilts.",
    "Meanwhile, in a small skillet melt the 4 tablespoons butter over medium heat. (I let mine get brown, because that's just how I roll, but that's not necessary).",
    "Add the minced garlic and crushed red pepper and saute for about 1 minute, until fragrant.",
    "Turn off the heat and add 2-3 tablespoons fresh lemon juice. Add the lemon butter to the pasta and stir.",
    "Stir in 1 cup fresh parmesan cheese. Add a drizzle of olive oil and season with salt and pepper to taste.",
    "Garnish with more cheese, fresh lemon wedges, and eat hot!"
  ],
  "ingredients": [
    "0",
    "3 quarts water",
    "1 tablespoon salt",
    "1 and 1/2 to 2 pounds fresh broccoli",
    "1 pound rotini pasta",
    "3-4 cups spinach",
    "4 tablespoons butter",
    "1 large lemon, zested and juiced",
    "2 cloves garlic, crushed and minced",
    "1/4 or 1/2 teaspoon crushed red pepper",
    "1 cup fresh Parmesan, plus more to garnish",
    "olive oil, to garnish",
    "salt and pepper to taste",
    "fresh lemon wedges, to garnish"
  ],
  "__v": 2
}