{
  "hash": "279dae0d426a5ed701013e6e9e9738addb0507d4",
  "title": "Slow Cooked Pulled Lamb",
  "image": "http://www.recipes.co.nz/ic/2453057077/Slow-Cooked-Pulled-Lamb.1.jpg",
  "href": "http://www.recipes.co.nz/shop/mEAT+MAGAZINE/Slow+Cooked+Pulled+Lamb.html",
  "extension": "Firefox",
  "firstAdded": "2016-01-06T04:41:48.517000",
  "users": [
    null
  ],
  "keywords": [
    "quality",
    "mark",
    "lamb",
    "shoulder",
    "bonein",
    "butter",
    "onions",
    "bulb",
    "garlic",
    "white",
    "wine",
    "campbells",
    "real",
    "stock",
    "chicken",
    "stalks",
    "rosemary",
    "bay",
    "leaves",
    "zest",
    "lemon",
    "dijon",
    "wholegrain",
    "mustard",
    "anchovies",
    "cumin",
    "seeds",
    "cornflour",
    "mixed",
    "water",
    "herbs"
  ],
  "directions": [
    "0",
    "Preheat the oven to 130°C conventional bake.",
    "Heat a little oil in a large frying pan over a high heat. Add the lamb, skin side down, and cook until browned. Turn over and brown the other side until browned, then set aside on a plate. Drain excess fat from the pan.",
    "Reduce the heat to medium-high, add the butter to the same pan and cook the onions for a few minutes until golden. Add the garlic cloves and cook for another few minutes. Add the wine, turn up the heat and let it bubble rapidly for a minute (scrape up any caramelised meat juices stuck to the bottom). Add the stock, rosemary stalks, bay leaves and lemon zest. Stir and carefully pour everything into your largest roasting dish.",
    "Add the lamb to the dish, skin-side up. Spread the mustard and anchovies over top and drizzle with olive oil. Sprinkle with the cumin seeds and season.",
    "Cover the dish tightly with tinfoil and bake in the oven for 5 hours or until falling off the bone. Baste the lamb a couple of times whilst cooking. Remove the tinfoil, turn up the oven to 200°C and cook for another 10-15 minutes until the lamb is browned and crunchy on top.",
    "Transfer the lamb to a warmed plate or platter (you can use a dinner plate to transfer it instead of tongs, as it will be falling apart and very tender) and cover with the foil. Let it rest for 10-15 minutes before serving.",
    "To remove the layer of oil on top of the pan juices, gently lay 6-7 paper towels flat on the surface without pressing down. Wait a few minutes for them to soak through, then discard. Pour the remaining pan juices through a sieve into a clean saucepan. Add the cornflour mixture and boil until reduced to a nice pouring sauce while the lamb rests. Taste and season as required.",
    "To serve",
    "Pull the lamb into nice big chunks. Serve on mashed potatoes or kumara with seasonal vegetables, pour gravy over and scatter with fresh herbs if you like."
  ],
  "ingredients": [
    "0",
    "1- 1.5kg Quality Mark lamb shoulder, bone-in",
    "25g butter",
    "4 large onions, quartered",
    "1 whole bulb garlic, cloves peeled",
    "1 cup white wine",
    "1 cup Campbell’s Real Stock - Chicken",
    "4 stalks fresh rosemary",
    "3 bay leaves",
    "Zest of 1 lemon",
    "1 tablespoon Dijon or wholegrain mustard",
    "2 anchovies, finely chopped",
    "1 tablespoon cumin seeds",
    "3 teaspoons cornflour mixed with 1/4 cup water",
    "Fresh chopped herbs, to garnish"
  ],
  "__v": 1
}