{
  "hash": "833e2a7db4fe42394f9e683bac3dab2a5e6f227a",
  "title": "Shakshuka",
  "image": "http://farm9.staticflickr.com/8391/8473703206_ae376866a5.jpg",
  "href": "http://www.davidlebovitz.com/2013/02/shakshuka-recipe-eggs/",
  "firstAdded": "2014-12-26T09:06:35.495000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "medium",
    "onion",
    "garlic",
    "chile",
    "pepper",
    "stemmed",
    "deseeded",
    "dicedminced",
    "salt",
    "black",
    "paprika",
    "smoked",
    "caraway",
    "seeds",
    "cumin",
    "turmeric",
    "cored",
    "tomatoes",
    "tomato",
    "honey",
    "red",
    "wine",
    "cider",
    "vinegar",
    "loosely",
    "radish",
    "greens",
    "watercress",
    "kale",
    "swiss",
    "chard",
    "spinach",
    "coarsely",
    "feta",
    "cheese",
    "generous",
    "cubes",
    "eggs"
  ],
  "directions": [
    "0",
    "In a wide skillet, heat the olive oil over medium high heat. Add the onions and the garlic and cook for 5 minutes, until soft and wilted. Add the chile pepper, the salt, pepper, and spices. Cook for a minute, stirring constantly, to release their fragrance.",
    "Add the fresh or canned tomatoes, tomato paste, honey, and vinegar, reduce the heat to medium, and cook for 12 to 15 minutes, or until the sauce has thickened somewhat but is still loose enough so that when you shake the pan it sloshes around. (Fresh tomatoes may take a little longer to cook than canned.) Stir in the chopped greens.",
    "If you want to finish the Shakshuka on the stovetop, turn off the heat and press the cubes of feta into the tomato sauce. With the back of a spoon, make 6 indentations in the sauce. Crack an egg into each indentation, then drag a spatula gently through the egg whites so it mingles a bit with the tomato sauce, being careful not to disturb the yolks.",
    "Turn the heat back on so the sauce is at a gentle simmer, and cook for about 10 minutes, taking some of the tomato sauce and basting the egg whites from time-to-time. Cover, and cook 3 to 5 minutes, until the eggs are cooked to your liking.",
    "4. To finish them individually, preheat the oven to 375ºF (180ºC.) Divide the sauce into 6 baking dishes and press the feta cubes into the sauce. Set the baking dishes on a baking sheet, make an indentation in each, and crack and egg into the center. Bake until the eggs are cooked to your liking, basting the whites with some of the sauce midway during baking, which will take anywhere from 10 to 15 minutes – but begin checking them sooner to get them just right. If the yolks begin to get a little firm on top before the whites are cooked, drape a sheet of foil over them, but avoid having it touch the yolks.",
    "Serve with lots of crusty bread for scraping up the sauce."
  ],
  "ingredients": [
    "0",
    "2 tablespoons olive oil",
    "1 medium onion, peeled and diced",
    "3 cloves garlic, peeled and thinly sliced",
    "1/2 – 1 chile pepper (or to taste), stemmed, sliced in half and deseeded, finely diced/minced",
    "1 1/2 teaspoons salt",
    "1 teaspoon freshly ground black pepper",
    "1 teaspoon paprika, smoked or sweet",
    "1 teaspoon caraway seeds, crushed",
    "1 teaspoon cumin seeds, crushed, or 3/4 teaspoon ground cumin",
    "1/2 teaspoon turmeric",
    "2 pounds (1kg) ripe tomatoes, cored and diced, or two 14-ounce cans of diced or crushed tomatoes",
    "2 tablespoons tomato paste",
    "2 teaspoons honey",
    "1 teaspoon red wine or cider vinegar",
    "1 cup (20g) loosely packed greens, such as radish greens, watercress, kale, Swiss chard, or spinach, coarsely chopped",
    "4 ounces (about 1 cup, 115g) feta cheese, cut in generous, bite-sized cubes",
    "4 to 6 eggs"
  ],
  "__v": 1
}