{
  "hash": "40674e846596bcb20561a23cbd01daba82a92960",
  "title": "Single-Skillet Salmon With Parsnips, Olives, and Sage",
  "image": "http://ak-hdl.buzzfed.com/static/2015-03/6/17/enhanced/webdr05/enhanced-20778-1425682394-16.jpg",
  "href": "http://www.buzzfeed.com/christinebyrne/single-skillet-salmon",
  "extension": "Chrome",
  "firstAdded": "2015-07-12T15:56:47.408000",
  "users": [
    null
  ],
  "keywords": [
    "apple",
    "juice",
    "red",
    "wine",
    "vinegar",
    "olive",
    "oil",
    "kalamata",
    "olives",
    "reserved",
    "kosher",
    "salt",
    "pepper",
    "onion",
    "parsnips",
    "diagonally",
    "coins",
    "sage",
    "leaves",
    "roughly",
    "fillets",
    "salmon",
    "skin",
    "try",
    "pieces",
    "thickness"
  ],
  "directions": [
    "0",
    "PREPARATION",
    "1. First, make a lid for your skillet out of parchment paper (see below for a diagram): Cut a square of parchment paper that’s about three inches wider than the circumference of a large skillet. Fold the square in half diagonally, so that it’s a triangle. Fold the two furthest corners of the triangle together, so that you have a smaller triangle. Do the same thing again, so that you have an even smaller triangle with eight layers of parchment. Take the tip of the triangle (where all of the folds converge) and pinch it together between two fingertips. Put that tip in the very center of your skillet, and mark where the outer edge of the skillet hits the parchment paper. Cut the folded parchment triangle along the curve of the skillet, then cut about half an inch from the tip of the triangle. Unfold the triangle, and you’ll have a round piece of parchment the size of your skillet, with a hole in the center. Set this aside while you prep your ingredients.",
    "2. In a large skillet off the heat, combine the apple juice, red wine vinegar, olive oil, and sliced olives plus one tablespoon of the olive brine, a teaspoon of salt, and a few grinds of black pepper. Stir everything together just until it’s all combined.",
    "3. Add the onion, parsnips, and sage to the skillet, then stir together to coat the vegetables with the liquid. Spread everything out in an even layer over the bottom of the skillet.",
    "4. Generously season the salmon fillets with salt and pepper on both sides, then place the salmon fillets atop the bed of parsnips and onions in the skillet. Cover everything with the parchment lid, then heat the skillet over medium-high heat until the liquid starts to simmer, about a minute. Turn the heat down to medium-low and cook until the bottom half of the salmon is opaque, about 3 minutes. Carefully lift the parchment lid just enough to flip both salmon fillets over, then cook until the salmon is opaque on the outside and cooked through but still slightly pink on the inside, about 3 minutes more.",
    "5. Divide the parsnip and onion mixture between two plates, then top each one with a salmon fillet."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "½ cup apple juice",
    "1 tablespoon red wine vinegar",
    "1 tablespoon olive oil",
    "2 tablespoons sliced kalamata olives, liquid reserved",
    "kosher salt and freshly ground pepper",
    "½ large sweet onion, thinly sliced",
    "2 large or 4 small parsnips (about ½ pound), sliced diagonally into coins ¼-inch thick",
    "2 tablespoons sage leaves, roughly chopped",
    "2 4-ounce fillets salmon, skin removed (try to get two pieces that are the same thickness)"
  ],
  "__v": 1
}