{
  "hash": "85c26d981039d1a495964a7bdc99d22952606f41",
  "title": "The Best Cheesy Uncheese Sauce Recipe",
  "image": "http://2.bp.blogspot.com/_PaQOnNlC2xI/SrAlEDLj-pI/AAAAAAAAGmo/hnxq_mb_eJs/s400/Cheesy_Uncheese_Sauce_.jpg",
  "href": "http://glutenfreegoddess.blogspot.com/2007/12/cheesy-uncheese.html",
  "extension": "Chrome",
  "firstAdded": "2015-03-29T04:09:21.342000",
  "users": [
    null
  ],
  "keywords": [
    "light",
    "olive",
    "oil",
    "rice",
    "flour",
    "plain",
    "soy",
    "hemp",
    "nut",
    "coconut",
    "milk",
    "rounded",
    "good",
    "tasting",
    "nutritional",
    "yeast",
    "salt",
    "garlic",
    "onion",
    "glutenfree",
    "dijon",
    "honey",
    "mustard",
    "golden",
    "balsamic",
    "vinegar",
    "lemon",
    "juice",
    "nutmeg",
    "paprika",
    "orange",
    "turmeric",
    "yellow",
    "color",
    "omit",
    "white",
    "wine",
    "alcoholfree",
    "almond",
    "butter",
    "sesame",
    "tahini",
    "mixture"
  ],
  "directions": [
    "0",
    "In a saucepan, heat the olive oil over medium heat, and stir in the rice flour (I like to use a whisk to do this). Cook and stir the flour for about 30 seconds- it will make thick paste- and continue stirring to cook the raw flour taste out of it.",
    "Slowly add in the hemp milk, whisking to blend the flour paste and hemp milk.",
    "Bring the mixture to a bubble (it will thicken as it heats) then reduce the heat to low. Add the nutritional yeast, sea salt, garlic and onion powder, mustard, vinegar, nutmeg, paprika or turmeric, wine (and sesame tahini, if using), and whisk to blend.",
    "Continue heating and stirring the sauce over gentle heat for about five to ten minutes. Taste test. Does it need a hint more salt? Wine?",
    "Stir and gently heat through.",
    "Remove from heat and use on pasta, rice, potatoes, vegetables or casserole fillings.",
    "Makes about three cups sauce."
  ],
  "ingredients": [
    "0",
    "4 tablespoons light olive oil",
    "5 tablespoons sweet rice flour",
    "2 1/2 cups unsweetened plain soy, hemp, nut, or coconut milk",
    "2 rounded tablespoons good tasting nutritional yeast*",
    "1/2 teaspoon sea salt, or more, to taste",
    "A good dash or two of Garlic Powder, to taste",
    "A good dash or two of Minced Onion, to taste",
    "1/2 teaspoon gluten-free Dijon or honey mustard, or to taste",
    "1 tablespoon golden balsamic vinegar, rice vinegar, or lemon juice- to taste",
    "1/4 teaspoon nutmeg",
    "1/2 teaspoon paprika (for orange) or turmeric (for yellow) color- may omit",
    "1/4 cup white wine - may omit for alcohol-free",
    "Note: I now add a rounded tablespoon of almond butter or sesame tahini to the sauce mixture as well."
  ],
  "__v": 1
}