{
  "hash": "a0595a94d4970b83e5c040c25ab5a024bf614c15",
  "title": "The Pioneer Woman’s Patty Melt [Vegan, Gluten-Free]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/03/melt.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/the-pioneer-womans-patty-melt/",
  "extension": "",
  "firstAdded": "2015-03-26T07:52:02.507000",
  "users": [
    null
  ],
  "keywords": [
    "white",
    "onion",
    "water",
    "navy",
    "beans",
    "caraway",
    "seeds",
    "flax",
    "whisked",
    "smoke",
    "soy",
    "salt",
    "pepper",
    "cashews",
    "soaked",
    "minutes",
    "light",
    "miso",
    "yellow",
    "tahini",
    "nutritional",
    "yeast",
    "dijon",
    "mustard",
    "garlic",
    "lemon",
    "juice"
  ],
  "directions": [
    "0",
    "Preheat the oven to 400 degrees F. Warm about 2 tbsp of water in a skillet over medium heat and add the sliced onions. Let cook untouched until water has evaporated and add about 2 tbsp more water and mix. Continue to do this for about 1 hour or until onions are a deep golden brown color and are sweet tasting.",
    "While the onions are cooking, add your beans to a large mixing bowl and mash them until most of them are mashed, though some large bits can remain. Mix in the remaining ingredients and form the mixture into 4 balls. Flatten each ball and place on a lightly greased cookie sheet. Bake for 10 minutes, flip, and bake 10 minutes more.",
    "While the burgers are cooking, prepare your cheese sauce. Drain the cashews and rinse once more. Add the cashews to a food processor or blender and pulse once or twice. Add remaining ingredients except for the water and pulse until well combined. Stream in the water while pulsing until desired consistency is achieved. I left it fairly thick so it wouldn’t run off of the sandwich.",
    "Once all components are done, assemble the sandwiches by buttering two pieces of bread. Top with a bean burger, a heaping pile of caramelized onions, and some cheese sauce. Grill the sandwich over medium heat until both sides are golden brown. Serve."
  ],
  "ingredients": [
    "0",
    "1 large white onion, sliced",
    "water",
    "1",
    "2 cups cooked navy beans",
    "1 tsp caraway seeds",
    "1 tbsp ground flax + 3 tbsp water (whisked together)",
    "1/4 tsp liquid smoke",
    "1 tsp soy sauce",
    "salt and pepper to taste",
    "2",
    "1/2 cup cashews, soaked 30 minutes",
    "1 tbsp light miso (white or yellow)",
    "1 tbsp tahini",
    "1/3 cup nutritional yeast",
    "1 tbsp dijon mustard",
    "1 tsp onion powder",
    "1 tsp garlic salt",
    "3 tbsp lemon juice",
    "1/4 cup water"
  ],
  "__v": 1
}