{
  "hash": "5fa03d8f13bb9b02b62c9590ba342e451b624736",
  "title": "Best Veggie Burger",
  "image": "http://recipe-folder.com/img/recipe-images/092/814/2347075992.jpg",
  "href": "https://www.inspiredtaste.net/36554/veggie-burger-recipe/itr_print/",
  "extension": "Chrome",
  "firstAdded": "2019-08-04T00:26:07.555000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "PREPARE VEGGIES AND BEANS",
    "Heat the oven to 400 degrees F. Line two rimmed baking sheets with foil, parchment paper or silicon baking mats.",
    "Using a damp paper towel, brush all dirt from mushrooms. Cut away and discard any hard stems. Roughly chop the mushrooms, carrot, broccoli and onion into 1/2-inch chunks. Toss vegetables into the bowl of a food processor. Add the garlic, olive oil, smoked paprika, chili powder, salt and pepper. Close the lid and pulse 10 to 20 times until coarsely ground.",
    "Spread the ground vegetables onto one of the lined baking sheets. Pat them down with a spatula until a very thin layer of vegetables covers the majority of the baking sheet. Roast the vegetables for 15 minutes. (If the veggies around the outer edges start to turn dark brown, stir and press them back down into a thin layer).Spreading the Vegetables",
    "Meanwhile, spread the drained black beans onto the second baking sheet in one layer. When the vegetables have roasted for 15 minutes, stir them and press into a thin layer once more. Transfer both baking sheets (vegetables and the black beans) to the oven. Roast until the beans begin to split and look dry and the vegetables look drier and toasted, about 15 minutes. Let everything cool.",
    "MAKE BURGER MIX",
    "While the beans and vegetables roast, rinse the food processor bowl and pat dry.",
    "Place the walnuts, spinach and fresh herbs in it. Pulse until they are about the size of breadcrumbs.",
    "Add cooled beans and pulse 5 to 10 times until the beans look crumbly with large crumbs.",
    "Add the roasted vegetables, panko breadcrumbs, eggs and the tomato paste. Pulse until everything is just combined. You want to keep some texture, don’t pulse until a smooth mixture.",
    "Scrape the mixture into a bowl and fold in the rice.",
    "Refrigerate the veggie burger mix up to 24 hours. Or make patties, cook them and freeze wrapped in foil up to 3 months.",
    "COOK BURGERS",
    "When you are ready to make the burgers, divide into 8 equal portions (about 3 1/4 ounces or 90 grams each). Form each portion into a 1/2-inch thick patty.",
    "Heat a skillet over medium-low heat, add oil, and then place patties in one layer. (We use about 1 tablespoon of oil to cook 4 burgers). Cook until heated through, firm and browned on both sides, about 4 to 6 minutes on each side. If any bits fall from the sides as you flip, press them back into the sides of the patty. Be careful when flipping so they stay together.",
    "For an outdoor grill, we recommend placing a cast iron pan or griddle over a low fire to cook the burgers.",
    "To reheat frozen cooked burgers: Bake in a 350 degree F oven until heated through, 15 to 20 minutes. Or reheat in a skillet over medium-low heat until heated through, 5 to 10 minutes on each side. We do not recommend microwaving the patties (they steam and become floppy)."
  ],
  "ingredients": [
    "0",
    "8 ounces (225 grams) mushrooms",
    "1 medium carrot",
    "1 1/2 cups (85 grams) broccoli florets",
    "1/4 medium onion",
    "2 medium garlic cloves",
    "2 tablespoons (30 grams) oil such as olive oil, avocado oil or grape seed, plus more for cooking",
    "1 teaspoon smoked paprika",
    "1 teaspoon chili powder",
    "3/4 teaspoon fine sea salt",
    "1/4 teaspoon fresh ground black pepper",
    "1 (15-ounce) can black beans, drained and rinsed",
    "1/3 cup (35 grams) walnut halves (about 14 halves)",
    "2 cups packed (85 grams) spinach leaves",
    "Handful tender fresh herbs like chives, parsley or cilantro (optional)",
    "1/2 cup (100 grams) panko breadcrumbs",
    "2 large eggs",
    "1 tablespoon (15 grams) tomato paste",
    "3/4 cup (115 grams) cooked brown rice",
    "Bread rolls, lettuce, tomato, cheese and favorite burger sauces"
  ],
  "__v": 3
}