{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 200C",
    "Place the pumpkin in a roasting tin. Smash the garlic cloves with the flat side of your knife and add to the pumpkin. Throw in some sprigs of thyme and drizzle with olive oil. Toss everything together, season with salt and pepper and pop into the oven to roast until caramalised and tender (approx. 35 minutes).",
    "While the pumpkin is roasting make the tomato and cauliflower sauces.",
    "For the tomato sauce, drizzle a little olive oil into a pan and add red pepper flakes, garlic and a pinch of sea salt. Stir and cook over medium-high for 1 minute until fragrant. Add tomatoes and water and heat to a gentle simmer. Cook for 5 minutes. Remove from heat, season with salt and pepper. Set aside to cool.",
    "For the cauliflower sauce, bring the water or vegetable stock to a boil in a large saucepan. Add cauliflower and cook gently, covered, for 7-10 minutes, until tender. Remove from heat but do not drain the cooking liquid.",
    "Using a slotted spoon, transfer cauliflower into the bowl of a food processer or a blender. Add 1 cup of the cooking liquid, milk, salt and pepper. Puree the mixture until smooth, adding more stock if you feel the sauce is too thick. Transfer to a bowl and set aside.",
    "Wilt the spinach for the pumpkin filling but putting the spinach into a saucepan along with a splash of water. Once the spinach has wilted, remove it from the pan and let cool. Squeeze any excess liquid from the spinach leaves before chopping. Set aside.",
    "Once the pumpkin has cooked, remove it from the oven and transfer to a large bowl. Using a fork, mash the pumpkin until quite smooth. Add the ricotta, lemon juice and zest, and chopped spinach. Mix well. Taste and adjust seasoning.",
    "Spread the tomato sauce across the bottom of a baking dish. Cut each lasagne sheet into 14cm x 16cm pieces. Spoon some of the pumpkin mixture (about 1/3 cup) along the length of the lasagne sheet and roll up to form a tube.",
    "Lay tubes side by side in the baking dish. Spoon over cauliflower sauce and top with some extra ricotta cheese and a drizzle with olive oil. Add a few splashes of water to the dish, cover with foil and bake for 30 minutes, uncover for the final 15 minutes, or until the pasta is cooked through. Sprinkle with thyme leaves and some lemon zest and serve hot.",
    "Serves 4-6"
  ],
  "firstAdded": "2014-09-08T19:37:25.374000",
  "hash": "02059c51ab7ba86d50e9c5013d01ec59acc75132",
  "href": "http://fingerforkknife.com/2013/07/14/roast-pumpkin-spinach-ricotta-cannelloni-with-cauliflower-sauce/",
  "image": "http://fingerforkknife.files.wordpress.com/2013/07/l2.jpg?w=610&h=915",
  "ingredients": [
    "0",
    "For the pumpkin filling:",
    "½ butternut pumpkin, approx. 700g, diced",
    "2 tbsp olive oil",
    "2 garlic cloves",
    "3 sprigs of thyme",
    "½ cup ricotta cheese, plus extra to top before baking",
    "Juice and finely grated zest of ½ lemon",
    "¼ cup flat leaf parsley, finely chopped",
    "6 large handfuls of spinach, washed",
    "For the tomato sauce:",
    "2 x 400g tins of tomatoes",
    "2 cloves garlic, finely chopped",
    "1 tsp crush red pepper flakes",
    "½ cup (use the empty tomato tin as a rough measure) water",
    "Sea salt",
    "Freshly ground black pepper",
    "For the cauliflower sauce:",
    "½ cauliflower, florets chopped",
    "1 litre vegetable stock, or water",
    "¼ cup milk",
    "Sea salt",
    "Freshly ground black pepper",
    "16 fresh wholemeal lasagne sheets*",
    "Extra thyme leaves, for serving",
    "Lemon zest, for serving"
  ],
  "keywords": [
    "pumpkin",
    "filling",
    "butternut",
    "approx",
    "olive",
    "oil",
    "garlic",
    "sprigs",
    "thyme",
    "ricotta",
    "cheese",
    "extra",
    "baking",
    "juice",
    "zest",
    "lemon",
    "flat",
    "leaf",
    "parsley",
    "spinach",
    "washed",
    "tomato",
    "tins",
    "tomatoes",
    "crush",
    "red",
    "pepper",
    "use",
    "tin",
    "rough",
    "measure",
    "water",
    "salt",
    "black",
    "cauliflower",
    "florets",
    "litre",
    "stock",
    "milk",
    "wholemeal",
    "lasagne",
    "sheets",
    "leaves"
  ],
  "title": "Roast Pumpkin, Spinach + Ricotta Cannelloni with Cauliflower Sauce",
  "users": [
    null
  ]
}