{
  "hash": "de391d88e7b96d2ce5bbedd92e0e466394c3a8eb",
  "title": "Roasted Eggplant and Butternut Squash with Tahini-Yogurt Sauce",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2017/08/2017-08-26-Roasted-Eggplant-8.jpg",
  "href": "https://www.simplyrecipes.com/recipes/roasted_eggplant_and_butternut_squash_with_tahini_yogurt_sauce/",
  "extension": "",
  "firstAdded": "2018-01-28T01:29:02.729000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Make the yogurt-tahini sauce: In a bowl, whisk the yogurt, tahini, and lemon juice until smooth. Taste for seasoning and add salt and pepper, if you like.",
    "2 Prep and salt the eggplant: Cut the eggplant in half lengthwise. Use the tip of a paring knife to score the cut sides in a cross-hatch pattern about 1/2 inch deep.",
    "Sprinkle with salt and set the eggplant on a large rimmed baking sheet, cut side up, for 30 minutes. You’ll see liquid coming out of the cuts.",
    "After 30 minutes are up, rinse the eggplant and pat dry with paper towels. Use the towels to wipe the baking sheet.",
    "3 Roast the eggplant and squash: Heat the oven to 450 degrees F. Set the eggplant halves on the baking sheet cut sides up. Brush with 3 tablespoons of the olive oil and sprinkle with cumin. Arrange the sliced butternut in the spaces between the halves, and sprinkle with 1 tablespoon of the olive oil and salt.",
    "Roast the eggplant and butternut for 35 to 40 minutes, or until the eggplant is golden brown, the squash is browned on the bottom, and both are tender when pierced with a skewer. If the eggplant isn’t browned, remove the butternut from the baking sheet and continue cooking the eggplant for 5 more minutes.",
    "Keep the eggplant warm covered loosely with foil on the top of the stove while you finish the vegetable topping.",
    "4 Make the vegetable topping: In a large bowl, combine the red onion, vinegar, and a pinch of salt. Let them sit for 5 minutes to mellow the onion. With a large spoon, stir in the remaining 2 tablespoons oil.",
    "Transfer the roasted butternut to a cutting board and cut into 1/2-inch pieces. Fold the butternut, jalapeno, and parsley into the bowl with the onions. Taste for seasoning and add more salt and pepper, if you like.",
    "5 Plate and serve: Scoop the pilaf on a serving platter, or divide between 4 plates. Add the eggplant halves and top with the butternut mixture. Drizzle with yogurt sauce and serve the remaining sauce separately."
  ],
  "ingredients": [
    "0",
    "1/2 cup whole-milk or low-fat plain yogurt",
    "2 tablespoons tahini paste",
    "2 tablespoons lemon juice",
    "2 medium eggplants (1 1/2 pounds total)",
    "2 teaspoons salt",
    "5 tablespoons olive oil",
    "1 teaspoon ground cumin",
    "1/2 peeled, seeded butternut squash, and cut into 1/2-inch slices (about 1 pound)",
    "1/2 teaspoon salt",
    "1/4 teaspoon pepper",
    "1/4 red onion, thinly sliced",
    "3 tablespoons white wine vinegar",
    "1 jalapeno or other small green chili pepper, cored, seeded, and thinly sliced",
    "1/2 cup whole parsley leaves",
    "Rice pilaf, made with 1 cup rice"
  ],
  "__v": 1
}