{
  "hash": "9ce9cb10ae5459f7333e0e8dc9d79945f8a4968f",
  "title": "Sour Cream Coffee Cake with Orange & Chocolate",
  "image": "https://alexandracooks.com/wp-content/uploads/2014/05/13886352167_50c6b39c1b_o1.jpg",
  "href": "https://alexandracooks.com/2014/05/01/sour-cream-coffee-cake-with-orange-chocolate/",
  "extension": "Chrome",
  "firstAdded": "2019-01-08T01:39:53.697000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Position a rack in the center of the oven and preheat to 325˚F. Grease a 9 x 5 x 3-inch loaf pan or a bundt pan with butter or nonstick spray.",
    "Whisk together the flour, sugars, baking powder, baking soda, and salt in a medium bowl. Mix in the orange zest with your fingers until evenly distributed. Set aside.",
    "Whisk together the orange juice, vanilla, eggs, and sour cream in a separate medium bowl until thoroughly combined.",
    "Whisk wet and dry ingredients together. Pour in melted coconut oil and stir to combine — it will seem as though the oil will never incorporate, but just keep going. It will. Fold in chocolate chips or chopped chocolate.",
    "Pour the batter into the prepared pan. Bake for 45 minutes to an hour, or until the cake is golden brown on top and a skewer inserted into the center comes out clean. If you have an instant-read thermometer, it should register 200ºF. Cool the cake in the pan for 20 minutes, then turn out onto a plate."
  ],
  "ingredients": [
    "0",
    "1¾ (224 g) cups unbleached all-purpose flour",
    "1/2 (114 g) cup sugar",
    "1/2 (116 g) cup light brown sugar",
    "1½ teaspoons baking powder",
    "1 teaspoon baking soda",
    "½ teaspoon kosher salt",
    "Zest of 1 orange",
    "1 tablespoon freshly squeezed (or not) orange juice",
    "2 teaspoons pure vanilla extract",
    "2 large eggs",
    "1 cup sour cream",
    "1 cup virgin coconut oil, melted",
    "a scant cup semisweet chocolate chips or chopped chocolate from a bar"
  ],
  "__v": 1
}