{
  "hash": "67002aaf9b1992fc5cc097fbfee7a5df18c06ed7",
  "title": "Braised Leeks",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2011/01/braised-leeks-a.jpg",
  "href": "https://www.simplyrecipes.com/recipes/braised_leeks/",
  "extension": "",
  "firstAdded": "2018-01-28T20:43:46.830000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Cut off the ends of the leeks until you get to the shank; a little of the light green part is fine, but not too much of it. If you want, you can save the unused portion of the leeks in the freezer for making stock later. Slice through the shank of the leek lengthwise until you get to the root end—do not cut through the root just yet. Clean the leeks under cold running water, as leeks are usually dirty. Once the leeks are free of any dirt or grit, cut through the root to make two long pieces of leek.",
    "2 Get a sauté pan large enough to hold the leeks in one layer and heat the butter in it over medium-high heat. When the butter has melted and begins to foam, turn the heat down to medium and add the minced garlic and then the leeks, cut side down. Cook for 1-2 minutes, just to get them a little browned and to let the butter get into the leeks. Turn over and sprinkle with salt, then cook the other side for 1-2 minutes.",
    "3 Turn the leeks back over so the cut side is down, sprinkle the leeks with the sugar, the thyme leaves and a touch more salt. Add the white wine with the bay leaf and bring to a gentle simmer. Cover and cook 35-45 minutes over medium-low heat.",
    "4 When the leeks are tender enough so that a knife blade pierces them easily, uncover the pot and bring the braising liquid to a rolling boil. Let this reduce by half, then turn off the heat. Add the parsley, swirl it around and serve."
  ],
  "ingredients": [
    "0",
    "4-6 leeks",
    "1 garlic clove, minced",
    "3-4 Tbsp unsalted butter",
    "Salt",
    "2 teaspoons fresh thyme or 1 teaspoon dried",
    "1 teaspoon sugar",
    "1 bay leaf",
    "1 cup white wine or vegetable stock",
    "1/4 cup parsley, chopped"
  ],
  "__v": 1
}