{
  "hash": "4817def2e8d0f8341f1802a1b9547be093395dbf",
  "title": "Chicken Marsala\nTasteBook.com\nThis Italian-American classic tastes fantastic as-is––or add a twist to create Chicken Lombardy: Finish the sauce, return the chicken to the pan, then top with 1/2 cup shredded fontina or mozzarella cheese and 1/2 cup grated Parmesan. Broil 1 to 2 minutes until lightly browned.",
  "image": "http://content1.tastebook.com/content/photo/user_photo/KAXg8RcE13c223233353035393WfgVZzKU_1429823633.jpg",
  "href": "http://www.tastebook.com/recipes/4203583-Chicken-Marsala",
  "extension": "Chrome",
  "firstAdded": "2015-04-23T22:59:10.541000",
  "users": [
    null
  ],
  "keywords": [
    "boneless",
    "skinless",
    "chicken",
    "breasts",
    "allpurpose",
    "flour",
    "parmigianoreggiano",
    "cheese",
    "olive",
    "oil",
    "divided",
    "butter",
    "mushrooms",
    "salt",
    "black",
    "pepper",
    "shallot",
    "clove",
    "garlic",
    "dry",
    "marsala",
    "broth",
    "flatleaf",
    "parsley"
  ],
  "directions": [
    "0",
    "Directions",
    "1",
    "Place the chicken breasts in a gallon ziplock bag (or between two sheets of plastic wrap) and pound to a fairly even 1/4-inch thickness. Cut into 4 equal-size pieces. In a shallow dish, combine the flour and Parmigiano-Reggiano cheese, and set it aside.",
    "2",
    "Heat 3 tablespoons of the olive oil and 1 tablespoon of the butter in a large skillet over medium heat. Dredge the chicken in the flour mixture and immediately place in the pan (work in batches if necessary to avoid crowding). Cook just until golden and cooked through, about 2 minutes per side. Remove to a serving platter, cover, and keep warm.",
    "3",
    "Add the mushrooms and a pinch of salt to the oil/butter mixture in the pan, along with the remaining 1 tablespoon olive oil. Sauté over medium heat 3 minutes. Add the shallot and garlic and stir 1 minute more. Add the Marsala and broth, stirring up any browned bits. Raise the heat and cook at a brisk simmer until reduced and thickened, about 5 minutes. Remove the pan from the heat and swirl in the remaining tablespoon of butter. Add salt and pepper to taste. Top the chicken with the sauce, sprinkle with parsley, and serve."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 pound boneless, skinless chicken breasts",
    "1/3 cup all-purpose flour",
    "1/3 cup freshly grated Parmigiano-Reggiano cheese",
    "4 tablespoons olive oil, divided",
    "2 tablespoons butter, divided",
    "8 ounces sliced mushrooms",
    "Salt and freshly ground black pepper",
    "1 small shallot, minced",
    "1 clove garlic, minced",
    "1/2 cup dry Marsala",
    "1/4 cup chicken broth",
    "2 tablespoons minced flat-leaf parsley"
  ],
  "__v": 1
}