{
  "hash": "13b8c4501f6c5a76bb17e8eae30535a593ad124a",
  "title": "Thai Style Chicken Meatballs with Rice Noodle Salad",
  "image": "https://farm4.staticflickr.com/3930/15289470700_e04cb5a156_o.jpg",
  "href": "http://www.fussfreecooking.com/recipe-categories/meat-recipes/thai-style-chicken-meatballs-rice-noodle-salad-recipe/",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T22:38:41.968000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "mince",
    "slice",
    "bread",
    "thai",
    "red",
    "curry",
    "use",
    "brand",
    "recipe",
    "salt",
    "black",
    "pepper",
    "rice",
    "noodles",
    "hot",
    "water",
    "blanch",
    "lemongrass",
    "tender",
    "white",
    "french",
    "shallot",
    "chilli",
    "vinegar",
    "cucumbers",
    "peeler",
    "carrots",
    "coriander",
    "leaves"
  ],
  "directions": [
    "0",
    "In a small bowl, wet a slice of bread with some water and mash it into fine pieces with a fork. Alternatively you can process the bread in a food processor (without water) until resembles breadcrumbs.",
    "In a mixing bowl, add chicken mince, bread pieces (or fresh breadcrumbs), a tablespoon of Thai red curry paste, salt and pepper. Knead the meat dough until pliable.",
    "Roll a tablespoon of the meat dough into a ball and repeat this step to the remaining meat dough.",
    "Heat up a non-stick stir fry pan over a medium flame with a teaspoon of oil. Brown the meatballs until all surface has turned golden brown and cooked through. Remove from the pan and set aside.",
    "While waiting for the meatballs to be cooked, I'd start prepping the salad ingredients.",
    "Start by re-hydrating the rice noodles in hot water in a bowl for about 10 minutes or until they are softened. Drain the water and set the noodles aside.",
    "Slice the lemongrass and French shallots. Add them to a separate bowl with sweet chilli sauce and white vinegar. Set aside.",
    "Peel the cucumber and carrot into paper thin slices, using a vegetable peeler.",
    "Add half of the dressing into the rice noodles and toss to mix evenly. Add sliced cucumber and carrots and toss gently.",
    "Divide the noodle salad in 4 small plates (as appetizers or two as main meal) , top with the meatballs and coriander leaves (roughly torn). Drizzle with the remaining sweet chilli dressing and serve immediately."
  ],
  "ingredients": [
    "0",
    "500g chicken mince",
    "1 slice of bread",
    "1 Tbsp Thai red curry paste (I use this brand for this recipe)",
    "1 tsp salt",
    "Freshly ground black pepper",
    "125g dried rice noodles",
    "Hot water to blanch the noodles",
    "1 lemongrass (the tender white part only), finely sliced",
    "1 small French shallot, thinly sliced",
    "1/2 cup sweet chilli sauce",
    "1/4 cup white vinegar",
    "300g cucumbers, thinly sliced with a peeler",
    "300g carrots, thinly sliced with a peeler",
    "A handful of fresh coriander leaves"
  ],
  "__v": 1
}