{
  "__v": 1,
  "directions": [
    "0",
    "Directions",
    "Sift 2 cups of all-purpose flour. If you have it, you can use bread or cake flour instead.",
    "Make 3 holes in the flour and add 2 Tbsp of sugar, 2 tsp of active dry yeast, and ¾ tsp of salt in each hole. Cover the holes with flour around them gently.",
    "Make another hole in the center and add 3 Tbsp of unsalted butter. Cover the hole with flour again.",
    "Make a trench around the edge of the flour in a circular shape and pour ¾ cup lukewarm milk in it.",
    "Mix everything gently and knead the dough.",
    "Knead the dough for about 10 to 20 minutes, or until the surface of the dough becomes smooth and gets a nice elastic texture. Form the dough into a ball. If you have a bread machine, you can let the machine knead the dough for you. :)",
    "Place the dough ball in a bowl and cover it with plastic wrap. Let the dough rise for about an hour to one and a half hours, or until it doubles in size. Let it rise in a warm place such as an unheated oven with light on, or under a lamp.",
    "Meanwhile, prepare the other ingredients. Cut 4 strips of bacon into ¼-inch slices. Slice 1 cup worth of an onion thinly. Obtain 1 cup worth of mozzarella cheese. I used precooked turkey bacon for this recipe, but you can use normal bacon if you want.",
    "Mix the onion, cheese, and bacon with 2 pinches of black pepper in a bowl.",
    "In about 1 hour, the dough doubled in size.",
    "Poke the dough to let out the air from it. This recipes makes a little more dough than you need for the loaf, so take some bread (about ½ cup) out and bake it separately if you don’t want to throw it out. I gave the leftover dough to my son. He played with it, making his own baby rolls. Then we baked them with my onion bread together.",
    "Roll the remained dough into a 12 X 10 inch rectangle shape.",
    "Spread about ⅔ of the onion mixture in the center of the dough. Spread out the mixture evenly across an area that is similar in size to the size of your bread pan.",
    "Fold the dough inwards from both sides. Seal the top by pinching the two sides together with your fingers.",
    "Place the sealed bread in a loaf bread pan.",
    "Cover the pan with some plastic wrap and let it rise again for about 20 minutes.",
    "Spread 1 Tbsp of mayonnaise evenly on the top surface of the bread. Preheat the oven to 375 F in this step.",
    "Sprinkle 1 pinch of black pepper on top of the mayonnaise.",
    "Put the remained onion mixture evenly on top of the bread and sprinkle about ½ tsp of parsley on top of everything.",
    "Bake the bread for about 45 minutes at 375 F. Then turn off the oven and finish baking the bread for another 15 minutes.",
    "It is important to cook this bread at the right temperature for proper amount of time. Otherwise, the top of the bread will burn and the inside of the bread will not be cooked enough. Let it cool a little before slicing the bread.",
    "It has a great crunch on the outside and it is soft and cheesy inside. Slice the bread into the desired size and serve it when it is still warm."
  ],
  "firstAdded": "2014-06-17T22:45:51.194000",
  "hash": "c3289914c3b0c6f0234802c87c484e50b813e94e",
  "href": "http://aeriskitchen.com/2013/12/onion-bread/",
  "image": "http://aeriskitchen.com/wp-content/uploads/2013/11/onion_bread_00-.jpg",
  "ingredients": [
    "0",
    "Main Ingredients",
    "1 Cup Onion",
    "1 Cup Mozzarella Cheese",
    "4 Strips Bacon or Turkey Bacon (½ Cup)",
    "1 Tbsp Mayonnaise",
    "½ tsp Parsley (for Garnish)",
    "3 Pinches Black Pepper",
    "Dough Ingredients",
    "2 Cups All-Purpose Flour",
    "¾ Cup Lukewarm Milk",
    "3 Tbsp Unsalted Butter",
    "2 Tbsp Sugar",
    "2 tsp Active Dry Yeast",
    "¾ tsp Salt"
  ],
  "keywords": [
    "main",
    "onion",
    "mozzarella",
    "cheese",
    "strips",
    "turkey",
    "bacon",
    "mayonnaise",
    "parsley",
    "pinches",
    "black",
    "pepper",
    "dough",
    "allpurpose",
    "flour",
    "lukewarm",
    "milk",
    "unsalted",
    "butter",
    "sugar",
    "active",
    "dry",
    "yeast",
    "salt"
  ],
  "title": "Onion Bread 양파빵, YangPaBbang",
  "users": [
    null
  ]
}