{
  "hash": "2ca3f4c2bb0f759afd65cadd67066d43e0dff830",
  "title": "one-skillet chicken thighs with brussels sprout hash",
  "image": "http://eatbetterdrinkbetter.com/wp-content/uploads/2016/01/ChickenBrusselsSprouts.jpg",
  "href": "http://eatbetterdrinkbetter.com/one-skillet-chicken-thighs-with-brussels-sprout-hash/",
  "extension": "Chrome",
  "firstAdded": "2016-03-08T03:56:47.648000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "grapeseed",
    "oil",
    "boneless",
    "skinless",
    "chicken",
    "thighs",
    "total",
    "excess",
    "fat",
    "trimmed",
    "salt",
    "pepper",
    "shallots",
    "medium",
    "seeds",
    "cumin",
    "water",
    "brussels",
    "sprouts",
    "crosswise",
    "butter",
    "lemon",
    "juice"
  ],
  "directions": [
    "0",
    "In a large skillet, heat 1 tablespoon of oil until shimmering. Season the chicken with salt and pepper and add in a single layer. Cook over moderately high heat without moving until golden brown and it pulls away easily from the skillet, about 6 to 8 minutes. Flip the chicken and reduce the heat to moderate; cook until the pieces are nearly cooked through, 5 to 6 minutes longer. Transfer the chicken to a plate.",
    "Add the remaining 1 tablespoon oil, the shallots, and a pinch of salt and cook, stirring and scraping the bottom of the pan, until softened, about 2 minutes. Add the cumin and cook until fragrant, about 1 minute (or 30 seconds for ground). Add the water and cook, scraping up any browned bits from the bottom of the pan, until the liquid is reduced slightly. Stir in the Brussels sprouts, then cover and cook for 2 minutes, until wilted. Uncover, add the butter and cook, stirring frequently, until the Brussels sprouts are tender and lose their raw taste. Stir in the lemon juice, then return the chicken and any accumulated juices to the pan and heat through, about 2 minutes. Serve hot."
  ],
  "ingredients": [
    "0",
    "2 tablespoons olive or grapeseed oil",
    "4 boneless skinless chicken thighs (about 1 ½ pounds total), excess fat trimmed",
    "Salt and freshly ground pepper",
    "¼ cup thinly sliced shallots (from 2 medium)",
    "½ teaspoon cumin seeds (or ground cumin)",
    "½ cup water",
    "1 pound Brussels sprouts, halved and thinly sliced crosswise",
    "½ tablespoon butter",
    "1 tablespoon fresh lemon juice"
  ],
  "__v": 1
}