{
  "hash": "8b26810319d70b3dd6758e90466b2d8c18b9adfd",
  "title": "Yam Kai (Thai Eggs) with Leftover Grains",
  "image": "http://www.epicurious.com/images/recipesmenus/2013/2013_september/51194830.jpg",
  "href": "http://www.epicurious.com/recipes/food/views/yam-kai-thai-eggs-with-leftover-grains-51194830",
  "firstAdded": "2015-02-22T19:18:23.216000",
  "users": [
    null
  ],
  "keywords": [
    "squeezed",
    "juice",
    "lime",
    "fish",
    "chile",
    "sambal",
    "oelek",
    "barley",
    "sorghum",
    "quinoa",
    "millet",
    "brown",
    "rice",
    "cooled",
    "eggs",
    "oil",
    "shallots",
    "scallions",
    "lengths",
    "green",
    "white",
    "parts",
    "separated",
    "leftover",
    "pork",
    "meat",
    "bone"
  ],
  "directions": [
    "0",
    "In a medium bowl, stir together the lime juice, fish sauce,\n1 teaspoon of the chile paste, and the cooked grain of your\nchoice; set aside.",
    "Put the eggs and the remaining 1/2 teaspoon of chile paste in a small bowl and beat with a fork to combine; set aside.",
    "In a large heavy sauté pan, heat 1/2 tablespoon of the oil over medium-high heat. Add the shallots, the white sections of the scallions, and the pork, if using, and cook, stirring occasionally, until the shallots are very dark brown and shriveled, about 4 minutes. Add the scallion greens and the remaining 1/2 tablespoon of oil and cook for 1 minute. Pour in the egg mixture and cook without disturbing for 30 seconds, then turn and stir, breaking it up a little but keeping good-size pieces together, cooking until just set, about 45 seconds. Pour in the grain mixture and cook, turning with a spatula, until heated through, about 1 minute. Serve.",
    "Reprinted with permission from Whole Grains for a New Generation: Light Dishes, Hearty Meals, Sweet Treats, and Sundry Snacks for the Everyday Cook by Liana Krissoff. Copyright © 2012 Liana Krissoff; photographs copyright © 2012 Rinne Allen. Published in 2012 by Stewart, Tabori & Chang, an imprint of ABRAMS."
  ],
  "ingredients": [
    "0",
    "1 1/2 tablespoons freshly squeezed lime juice (from 1/2 lime)",
    "1 1/2 tablespoons fish sauce",
    "1 1/2 teaspoons chile paste (sambal oelek), or to taste",
    "1 cup (190 g) cooked barley, sorghum, quinoa, millet, or brown rice cooled",
    "4 large eggs",
    "1 tablespoon vegetable oil",
    "4 shallots, thinly sliced",
    "4 scallions, cut into 2-inch (5-cm) lengths, green and white parts separated",
    "1 leftover cooked pork chop, meat removed from the bone and thinly sliced (optional)"
  ],
  "__v": 1
}