{
  "hash": "cd009d1e1ed4eebe2d5f398cd9b98e199445cfb7",
  "title": "Braised Pork and Eggs (Thit Kho Tau)",
  "image": "http://www.sprigandflours.com/wp-content/uploads/2015/02/8-Thit-Kho-Tau-Sprig-and-Flours.jpg",
  "href": "http://www.sprigandflours.com/braised-pork-and-eggs-thit-kho-tau/",
  "extension": "Chrome",
  "firstAdded": "2018-08-07T16:53:52.688000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place the eggs in a saucepan and cover with water. Bring the water to a boil. As soon as it reaches a rolling boil, take it off the heat, cover with the lid, and let it sit for 8 minutes. Peel, then set aside.",
    "In a large mixing bowl, mix together the pork, garlic, shallots, fish sauce, soy sauce, star anises, and black pepper. Set aside.",
    "In a dutch oven or medium-sized pot, heat only the sugar over medium-low heat to caramelize it, about 5 minutes, stirring occasionally. The sugar will melt, turn into a syrup, then become darker in color. The sugar burns very easily so keep a close eye! Once it turns golden brown, add the pork, increase the heat to medium-high, and stir to coat and brown the meat. After the meat is brown all over, simmer for 5 minutes to let the sauce cook down.",
    "Pour in the coconut milk or juice, bring to a simmer, and cook for 15 minutes, stirring occasionally. At this time, ladle and discard any fat or foam that rises to the surface.",
    "Add the peeled and boiled eggs and simmer for 30 minutes on low heat, gently stirring occasionally. Plate, top with sliced green onions (optional), and serve over rice."
  ],
  "ingredients": [
    "0",
    "8 eggs",
    "2 lbs pork belly or pork shoulder, sliced into 1 inch pieces",
    "2 cloves garlic, minced",
    "2 shallots, diced",
    "3 tablespoons fish sauce",
    "3 tablespoons soy sauce",
    "2 whole star anise",
    "½ teaspoon ground black pepper",
    "⅓ cup granulated sugar",
    "2 cups light coconut milk or coconut juice",
    "green onions, thinly sliced for ganishing"
  ],
  "__v": 1
}