{
  "hash": "89a4f1560870dfec783a08f8daffcdd95146cb95",
  "title": "The Best Ever Vegan Double Chocolate Chip Cookies",
  "image": "http://tfv.goodblogscdn.com/sites/www.theflamingvegan.com/post_images/cropped/3521.jpg?v=1428324007",
  "href": "http://www.theflamingvegan.com/view-post/Best-Double-Chocolate-Chip-Cookies",
  "extension": "Chrome",
  "firstAdded": "2015-04-19T14:12:27.240000",
  "users": [
    null
  ],
  "keywords": [
    "heaping",
    "spelt",
    "flour",
    "salt",
    "flax",
    "seeds",
    "baking",
    "tbs",
    "cacao",
    "cane",
    "coconut",
    "sugar",
    "xylitol",
    "prepared",
    "regular",
    "natural",
    "peanut",
    "butter",
    "oil",
    "room",
    "water",
    "cold",
    "almond",
    "milk",
    "cause",
    "start",
    "solidifying",
    "vanilla",
    "vegan",
    "chocolate",
    "chips",
    "used",
    "mega",
    "chucks",
    "enjoy",
    "life",
    "cinnamon"
  ],
  "directions": [
    "0",
    "Directions:",
    "Add the ingredients appearing above in bold into a medium-sized bowl and mix. In a smaller bowl, add in the rest of the ingredients except for the chocolate chips, mix and then add them into the medium-sized bowl. Stir until just mixed and then fold in the chocolate chips. Place bowl in the fridge to chill up the dough while you preheat the oven to 350F.",
    "Remove the dough after it has chilled in the fridge for about 15 minutes. Scoop tablespoon sized pieces, flatten them slightly and place onto a parchment paper-lined baking sheet.",
    "Bake for around 8-9 minutes. Remove from oven and leave them for about 10 minutes, then you can transfer to a baking sheet if needed. They will firm up and should be crispy, but not really hard to bite down on. I find if I left them in the fridge they would get too hard, so I left them out on the counter in an air-tight container."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "heaping 1/2 cup spelt flour",
    "pinch of sea salt",
    "heaping 1/2 tbsp ground flax seeds (not whole flax seeds)",
    "1/2 tsp baking powder",
    "1/2 tbs cacao powder",
    "heaping 1/4 cup coconut sugar / cane sugar / xylitol (I sometimes do 2 tbs coconut sugar, 2 tbs xylitol)",
    "2 tsp prepared PB2 (powdered peanut butter) or regular natural peanut butter",
    "3 tbsp melted coconut oil",
    "1 tbsp room temperature unsweetened almond milk (or water) (cold almond milk will cause the oil to start solidifying)",
    "1/2 tsp vanilla extract",
    "2 tbsp vegan chocolate chips (I used Mega Chucks by Enjoy Life)",
    "optional: 1/4 tsp of ground cinnamon"
  ],
  "__v": 1
}