{
  "hash": "41fafc5a05612f25a429e5d7a50a982d3faa72b3",
  "title": "FONTINA CHICKEN & PASTA BAKE RECIPE",
  "image": "https://cdn2.tmbi.com/TOH/Images/Photos/37/300x300/exps167310_SD142780B08_16_5b_WEB.jpg",
  "href": "https://www.tasteofhome.com/recipes/fontina-chicken---pasta-bake",
  "extension": "Chrome",
  "firstAdded": "2018-01-24T18:28:51.494000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350°. Cook pasta according to package directions for al dente.",
    "Meanwhile, heat 3 teaspoons oil in a Dutch oven over medium-high heat. Add chicken in batches; cook and stir 3-5 minutes or until no longer pink. Remove from pan.",
    "In same pan, add mushrooms to remaining oil; cook and stir over medium-high heat 3-5 minutes or until tender. Add garlic; cook 1 minute longer. Stir in soup, broth, 1 cup cheese, oregano and pepper. Add spinach and tomatoes; return chicken to pan.",
    "Drain pasta; add to soup mixture and toss to combine. Divide between two greased 8-in. square baking dishes. Sprinkle with remaining cheese. Bake, covered, 15-20 minutes or until heated through.",
    "Freeze option: Cool unbaked casseroles; cover and freeze. To use, partially thaw in refrigerator overnight. Remove from refrigerator 30 minutes before baking. Preheat oven to 350°. Cover casseroles with foil; bake as directed, increasing baking time to 1-1/4 hours or until heated through and a thermometer inserted in center reads 165°. Yield: 2 casseroles (4 servings each)."
  ],
  "ingredients": [
    "0",
    "1 package (16 ounces) uncooked spiral pasta",
    "4 teaspoons olive oil, divided",
    "2 pounds boneless skinless chicken breasts, cut into 3/4-inch cubes",
    "1/2 pound sliced fresh mushrooms",
    "4 garlic cloves, minced",
    "3 cans (10-3/4 ounces each) condensed cream of mushroom soup, undiluted",
    "1-1/2 cups chicken broth",
    "1-1/2 cups shredded fontina cheese, divided",
    "4 teaspoons minced fresh oregano or 1-1/4 teaspoons dried oregano",
    "1/2 teaspoon pepper",
    "2 packages (6 ounces each) fresh baby spinach, coarsely chopped",
    "2 medium tomatoes, chopped"
  ],
  "__v": 1
}