{
  "hash": "8d7c2d3fea6303a8f8ca3eb66227b9b6a78f8d7d",
  "title": "Creamy Ranch and Cheese Bread Bowl Dip",
  "image": "http://cdn.averiecooks.com/wp-content/uploads/2014/05/ranchcheesediptext1.jpg",
  "href": "http://www.averiecooks.com/2014/05/creamy-ranch-and-cheese-bread-bowl-dip.html",
  "firstAdded": "2015-01-23T23:53:17.583000",
  "users": [
    null
  ],
  "keywords": [
    "cream",
    "cheese",
    "soft",
    "lite",
    "okay",
    "sour",
    "measured",
    "loosely",
    "piled",
    "american",
    "colby",
    "pepper",
    "monterey",
    "jack",
    "cheddar",
    "mozzarella",
    "favorite",
    "ranch",
    "dip",
    "seasoning",
    "used",
    "mccormick",
    "individual",
    "spices",
    "preferred",
    "garlic",
    "onion",
    "salt",
    "round",
    "loaf",
    "bread"
  ],
  "directions": [
    "0",
    "In a large mixing bowl, combine all ingredients (except bread) and stir until combined. The softer the cream cheese is, the easier stirring is; set aside.",
    "With a serrated knife, slice off the top of bread in a circle, about 1-inch from the edge. Go down deep enough with knife to hollow out and remove interior section of the bread. If necessary, use your fingers to remove interior section of bread; save for dipping if desired.",
    "Transfer dip into bread bowl and serve immediately with chips, crackers, veggies, etc. Dip can be made up to 3 days in advance and kept airtight in the refrigerator. Do not place dip into bread bowl until ready to serve because the bread will get soggy. Dip will keep airtight in the refrigerator for about 5 to 7 days."
  ],
  "ingredients": [
    "0",
    "8 ounces cream cheese, very soft (lite is okay)",
    "8 ounces sour cream (lite is okay)",
    "about 1 1/2 cups shredded cheese, measured loosely piled (American, Colby, pepper Jack, Monterey Jack, cheddar, mozzarella, or your favorite)",
    "1-ounce packet ranch dip seasoning mix (I used McCormick; substitute with individual spices to taste if preferred, including garlic powder, onion powder, salt and pepper, etc.)",
    "one 6 to 8-inch round loaf of bread"
  ],
  "__v": 1
}