{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 400 degrees. Generously mist a 9 x 13 baking dish with nonfat cooking spray.",
    "Place a medium sized saucepan over medium high heat, and pour in 2 cups of the broth and 1/2 cup milk. Bring to a boil, then whisk in the flour, poultry seasoning and remaining 1/2 cup milk. Whisk well until the sauce is creamy and smooth. Season with salt and pepper as desired. Pour into a large bowl.",
    "To the large bowl of sauce, add remaining 1 cup broth and quinoa, and mix well.",
    "Place broccoli florets evenly into baking dish, pour quinoa and sauce mixture over the broccoli.",
    "Season chicken strips with salt and pepper and lay them evenly over top of the casserole.",
    "Cover with foil, and bake for about 30 minutes. Remove from oven and stir around a bit.",
    "Return to oven, uncovered this time, and bake for another 10-12 minutes or until chicken is golden brown, and quinoa grains are cooked and tender.",
    "Remove from oven and top with the mozzarella cheese. Bake for another 5 minutes or until the cheese is melted and bubbly. Let cool for 5 minutes before serving."
  ],
  "firstAdded": "2014-09-23T22:45:07.782000",
  "hash": "a454e5b3b11253d9890a696cd19de434ea2f9a45",
  "href": "http://www.laaloosh.com/2014/06/10/chicken-broccoli-quinoa-casserole-recipe/",
  "image": "http://www.laaloosh.com/wp-content/uploads/2014/06/chicken-broccoli-quinoa-casserole-675x453.jpg",
  "ingredients": [
    "0",
    "1 lb skinless boneless chicken breasts, sliced into strips",
    "1 16oz bag fresh broccoli florets",
    "1 cup quinoa, uncooked and rinsed",
    "1 cup 2% milk",
    "3 cups fat free chicken broth",
    "1/2 cup whole wheat flour",
    "1/2 cup reduced fat shredded mozzarella cheese",
    "2 tsp poultry seasoning",
    "Salt & pepper to taste"
  ],
  "keywords": [
    "skinless",
    "boneless",
    "chicken",
    "breasts",
    "strips",
    "broccoli",
    "florets",
    "quinoa",
    "uncooked",
    "rinsed",
    "milk",
    "fat",
    "free",
    "broth",
    "wheat",
    "flour",
    "reduced",
    "mozzarella",
    "cheese",
    "poultry",
    "seasoning",
    "salt",
    "pepper"
  ],
  "title": "Chicken, Broccoli, Quinoa Casserole",
  "users": [
    null
  ]
}