{
  "hash": "79ac57099a8b0139e2caa7aa1352fc2974c8a6c7",
  "title": "One Pan Tandoori Chicken with Spiced Coconut Rice",
  "image": "https://cmt.azureedge.net/media/one_pan_tandoori_chicken_with_spiced_coc_20180503151242648073o5nvvs.jpg",
  "href": "https://www.copymethat.com/r/UAQDjxl/one-pan-tandoori-chicken-with-spiced-coc/",
  "extension": "",
  "firstAdded": "2018-12-27T18:26:52.476000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Steps",
    "Add chicken, coriander, cumin, paprika, turmeric, cayenne pepper, garam masala, greek yogurt, lemon juice, garlic, ginger and salt and pepper to a large bowl; mix with a spoon to combine and coat the chicken and then cover with plastic wrap and place in fridge for anywhere from 1-8 hours to marinate the chicken.",
    "Place a large deep 10 inch skillet over medium high heat. (If you do not have a skillet a large pot will also work very well!) Add in oil; once hot, add in chicken and season generously with freshly ground salt and pepper. Cook until browned 4-5 minutes, then flip and and cook an additional 2 minutes. Remove from pan and transfer to a plate.",
    "In the same skillet, add in coconut milk, red pepper flakes, turmeric, cumin, coriander and salt and pepper. Bring to a simmer, then fold in the uncooked rice and peas, making sure it is evenly distributed. Add browned chicken on top. Reduce heat to low, cover the skillet immediately and cook for 20-25 minutes. After 20-25 minutes, most of the liquid should be absorbed and rice should be cooked. Serve immediately. Garnish with cilantro and serve with extra yogurt if you'd like.",
    "To meal prep: This meal serves four. Place rice in a meal prep containers and top with 1 chicken thigh. Garnish with cilantro and green onions.",
    "Notes",
    "Do not use brown rice. It takes a lot longer to cook and I would NOT recommend. Cauliflower rice works well in this recipe!",
    "If you are looking for an alternative, I would recommend subbing about 2/3 cup quinoa. The cooking time will stay the same."
  ],
  "ingredients": [
    "0",
    "For the marinade:",
    "1 ½ pounds boneless skinless chicken thighs",
    "1 teaspoon coriander",
    "1 teaspoon cumin",
    "1 teaspoon paprika",
    "1 teaspoon ground turmeric",
    "1 teaspoon cayenne pepper",
    "½ tablespoon garam masala",
    "3/4 cup nonfat plain greek yogurt",
    "Juice of 1 small lemon",
    "3 garlic cloves, minced",
    "1 tablespoon freshly grated ginger",
    "¾ teaspoon salt",
    "Freshly ground black pepper",
    "For the dish:",
    "1 tablespoon olive oil or coconut oil",
    "1 (15 ounce) can lite coconut milk",
    "½ teaspoon red pepper flakes",
    "1/2 teaspoon turmeric",
    "1/2 teaspoon cumin",
    "⅛ teaspoon coriander",
    "1/2 teaspoon salt",
    "Freshly ground black pepper",
    "1 cup uncooked basmati white rice",
    "¾ cup frozen green peas"
  ],
  "__v": 1
}