{
  "hash": "a60e2dd554843b14835127891a8e0c5a56aae20e",
  "title": "smashed chickpea salad",
  "image": "http://farm4.static.flickr.com/3404/3204897788_3a50cc2f11.jpg",
  "href": "http://smittenkitchen.com/blog/2009/01/smashed-chickpea-salad/",
  "extension": "Firefox",
  "firstAdded": "2015-08-16T13:12:07.453000",
  "users": [
    null
  ],
  "keywords": [
    "chickpeas",
    "rinsed",
    "black",
    "olives",
    "red",
    "onion",
    "parsley",
    "zest",
    "lemon",
    "youve",
    "sad",
    "juiceless",
    "lemons",
    "use",
    "sides",
    "juice",
    "couple",
    "good",
    "pinches",
    "salt",
    "grinds",
    "pepper",
    "glugs",
    "olive",
    "oil",
    "original",
    "quite",
    "breadsoaking",
    "oily",
    "went",
    "lighter",
    "ways"
  ],
  "directions": [
    "0",
    "Mix everything but the olive oil in a small to midsize bowl. Very lightly smash the chickpea mixture with the back of a fork or a potato masher. You’re not looking for a hummus-like puree but something closer to a coarse chop with a few smaller bits to hold it together. Add the glugs of olive oil, mix it lightly and enjoy.",
    "This is also awesome as a sandwich on toasted bread, and it needs nothing else on it. But, if you want to doll it up, here are some ideas: A slice of roasted red pepper (as they do at ‘wichcraft), watercress (ditto), a slice of pickled garlicky red pepper (our way). We schmeared the bread with a tahini dressing, which was just tahini, lemon juice and a minced garlic clove thinned with water, but if you’ve got some harissa, I bet that would also be delicious."
  ],
  "ingredients": [
    "0",
    "1 15-ounce can chickpeas, drained and rinsed",
    "2 tablespoons pitted, halved and very thinly sliced black olives",
    "1 tablespoon finely chopped red onion",
    "1 tablespoon chopped fresh parsley",
    "Zest and juice from half a lemon (if you’ve got one of those sad, juiceless lemons, use both sides for juice)",
    "Couple good pinches of salt",
    "A few grinds of black pepper",
    "A few glugs of olive oil (the original is quite oily, like bread-soaking oily, I went a little lighter. Both ways are delicious)"
  ],
  "__v": 1
}