{
  "hash": "c6a129f4dbb1e91495747ace8ea2d166fbd864fa",
  "title": "DIY Burrito Bowl",
  "image": "http://cdn.ohsheglows.com/wp-content/uploads/2015/10/DIYveganburritobowl5.jpg",
  "href": "http://ohsheglows.com/2015/11/02/diy-burrito-bowl/",
  "extension": "Chrome",
  "firstAdded": "2016-02-15T22:12:09.498000",
  "users": [
    null
  ],
  "keywords": [
    "burrito",
    "bowl",
    "dry",
    "white",
    "longgrain",
    "rice",
    "refined",
    "coconut",
    "oil",
    "vegan",
    "butter",
    "salsa",
    "needed",
    "green",
    "onion",
    "grape",
    "tomatoes",
    "spicy",
    "black",
    "beans",
    "extra",
    "virgin",
    "olive",
    "medium",
    "garlic",
    "chili",
    "oregano",
    "cayenne",
    "pepper",
    "salt",
    "tomato",
    "rinsed",
    "unpacked",
    "cilantro",
    "stems",
    "avocadolime",
    "makes",
    "heaping",
    "clove",
    "avocado",
    "lime",
    "juice",
    "water"
  ],
  "directions": [
    "0",
    "Directions:",
    "For the rice: Add the rice and 1 tablespoon of oil or butter into a medium pot along with 2 cups of water. Increase heat to medium-high and bring to a simmer. Immediately reduce the heat to low-medium, and cover with a lid. Cook the rice until it’s tender and the water is absorbed. For white long-grain rice this will take 13-20 minutes, but please follow the directions on your specific package for best results.",
    "Meanwhile, prepare the Spicy Black Beans: In a large wok or skillet, add the oil and melt it over medium heat. Stir in the onion and garlic, along with a pinch of salt, and saute for about 5-6 minutes, until softened.",
    "Stir in the chopped tomatoes, chili powder, garlic powder, dried oregano, cayenne (if using), and 1/2 teaspoon of salt. Continue sauteing for another 3-5 minutes (increasing/reducing heat if necessary), until the tomato softens.",
    "Now stir in the tomato paste and drained and rinsed black beans. Cook for a few more minutes until heated throughout. Taste and add more salt if desired. Stir in the cilantro. You can leave the mixture over low heat until ready to serve or simply turn off the heat and reheat before serving.",
    "For the Avocado-Lime Sauce: Mince the garlic clove in a mini food processor (or use a regular size processor, if necessary). Now add the avocado flesh, lime juice, water, and salt. Process until smooth. Taste and adjust lime juice if desired. I usually add another teaspoon.",
    "When the rice is ready, reheat the bean mixture, if necessary. Divide the rice between 2-3 bowls. Top each with a couple scoops of the hot black bean mixture, and a large spoonful of both the salsa and the Avocado-Lime Sauce. Garnish with sliced green onion and optional sliced grape tomatoes. Serve immediately.",
    "Tips:",
    "* Why the use of refined coconut oil? Unlike virgin coconut oil, refined coconut oil doesn't have a light coconut flavour. I use it whenever I don't want a coconut flavour to come through. That being said, if you don't mind a bit of coconut flavour feel free to use the virgin kind."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "For the burrito bowl:",
    "1 cup dry white long-grain rice (or rice of choice)",
    "1 tablespoon refined coconut oil or vegan butter*",
    "Salsa, as needed",
    "Sliced green onion, for garnish",
    "Sliced grape tomatoes, for garnish (optional)",
    "For the Spicy Black Beans:",
    "2 tablespoons refined coconut oil or extra virgin olive oil",
    "1 cup diced sweet onion",
    "4 medium garlic cloves, minced",
    "3/4-1 cup chopped fresh tomatoes",
    "1 teaspoon chili powder",
    "1 teaspoon garlic powder",
    "1 teaspoon dried oregano",
    "1/4 teaspoon cayenne pepper, optional",
    "1/2 + 1/8 teaspoon fine sea salt, or to taste",
    "2 1/2 tablespoons tomato paste",
    "1 (14-oz) can black beans, drained and rinsed",
    "1/2 cup unpacked cilantro, large stems removed and finely chopped",
    "For the Avocado-Lime Sauce (makes heaping 1/2 cup):",
    "1 large garlic clove",
    "1 large avocado, pitted",
    "1 tablespoon fresh lime juice, plus more to taste",
    "1 tablespoon water",
    "1/4 teaspoon fine sea salt, or to taste"
  ],
  "__v": 1
}