{
  "hash": "fff677cce58f46e08112a91a84b2ade4e8c13651",
  "title": "Cherry flans",
  "image": "//img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/46264571.jpg?tr=w-414,",
  "href": "https://www.jamieoliver.com/recipes/fruit-recipes/cherry-flans/",
  "extension": "Chrome",
  "firstAdded": "2018-11-22T16:24:05.300000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 175ºC/gas 3-4.",
    "For the caramel, place the sugar and 60ml of water in a pan and bring to the boil.",
    "When the syrup starts to colour, reduce the heat and continue to cook until the caramel turns golden brown.",
    "Remove from the heat and divide between 6 x 150ml ramekins or metal tins, swirling it around the sides. Set aside.",
    "Destone the cherries, then place in a pan with the kirsch and the 2 extra tablespoons of sugar. Cook over a low heat for 5 to 7 minutes, or until the cherries are soft, then set aside.",
    "Place the milk, cream and lemon zest in a pan over a medium heat and bring to a simmer.",
    "Remove from the heat and stir in the sugar until it has dissolved. Set aside for 10 minutes to allow the flavours to infuse.",
    "Beat the eggs and egg yolks together in a bowl, then whisk in the cooled milk mixture. Strain the liquid into a bowl then gently stir in the cherries, reserving half the cherry liquid.",
    "Pour the cherry mixture into the caramel-lined ramekins and place in a deep roasting tin.",
    "Add enough boiling water to the roasting tin to come halfway up the sides of the ramekins. Carefully place the tin in the preheated oven and cook the ramekins for 45 minutes, or until a skewer inserted in the centre comes out clean.",
    "To serve, run a sharp knife around the edges, invert onto plates and serve with the remaining cherry syrup and any extra cherries."
  ],
  "ingredients": [
    "0",
    "260 g cherries , plus extra to serve (see tip)",
    "3 tablespoons kirsch",
    "150 g sugar , plus 2 tablespoons extra",
    "200 ml milk",
    "3 tablespoons single cream",
    "1 lemon",
    "3 large free-range eggs",
    "2 free-range egg yolks",
    "CARAMEL",
    "100 g sugar"
  ],
  "__v": 1
}