{
  "hash": "6e7e9a547d5e1b748b23554981cee33eb3047a8e",
  "title": "SWEET POTATO & GARLIC CONFIT HUMMUS",
  "image": "http://iwillnoteatoysters.com/wp-content/uploads/2016/01/Sweet-Potato-Hummus-10-522x783.jpg",
  "href": "http://iwillnoteatoysters.com/sweet-potato-garlic-confit-hummus/",
  "extension": "Chrome",
  "firstAdded": "2016-01-11T13:04:09.701000",
  "users": [
    null
  ],
  "keywords": [
    "heads",
    "garlic",
    "clean",
    "olive",
    "oil",
    "bay",
    "leaf",
    "peppercorns",
    "sprig",
    "thyme",
    "chickpeas",
    "baking",
    "soda",
    "clove",
    "sesame",
    "lemon",
    "juice",
    "cumin",
    "salt",
    "ovenroasted",
    "potatoes",
    "cubes",
    "confit",
    "flaky",
    "maldon",
    "regular",
    "urfa",
    "smoked",
    "paprika",
    "cilantro",
    "soft",
    "fluffy",
    "pitas"
  ],
  "directions": [
    "0",
    "For the garlic confit: Pre-heat the oven to 200˚F. Place the garlic cloves in a small oven-safe sauce pot with lid. Pour in enough olive oil to cover the garlic cloves. Toss in the bay leaf, peppercorns, and thyme sprig. Place over medium-low heat until the garlic begins to sizzle. Immediately remove from the heat, cover and place in the oven. Slowly roast the garlic until browned and your whole kitchen smells of sweet garlic. This will take anywhere between 30 minutes to an hour depending on the size of the garlic cloves. Be sure to keep checking them. This recipe makes more garlic confit than you will need. It can be kept in an air tight container for up to 2 weeks in the fridge.",
    "For the hummus: Place the dried chickpeas in a large glass or plastic bowl and cover with at least 6 cups of cool water. Leave on the counter top for at least 12 hours or over night. Drain and change the water out at least once, no earlier than 2 hours after the soak starts. Try and change the water out at least twice though the hummus will be delicious if you forget to do so.",
    "Place the soaked chickpeas in a large stock pot and cover with 8-10 cups of water. There should be at least 3-inches of water above the chickpeas. Add the baking soda and bring to a boil over high heat. Once it boils, it will begin to foam. You want to skim away all that foam. That’s “dirty water”. Boil for 2 minutes while skimming. Turn the heat down to medium-low and simmer, uncovered, for 35-45 minutes. It should be an active simmer where you can see the chickpeas moving around with the water as it simmers. There really isn’t a need to stir the chickpeas while they cook. You should be able to mash the chickpeas with your fingers when they’re ready. Turn the heat off and set aside to cool to room temperature.",
    "Once cooled, drain the chickpeas SAVING AT LEAST A HALF CUP OF COOKING LIQUID! Make sure to drain the chickpeas as well as possible to be sure that you get a nice thick hummus. Place the chickpeas in a food processor. Process until a thick paste forms, about a minute of two. Add the garlic clove and process again until smooth. Add the sesame paste, lemon juice, cumin and salt and process again on high. If the hummus is too thick, slowly stream in a little of the chickpea cooking liquid to loosen it up. You may not need to add any liquid at all. Check the consistency of this hummus before adding too much liquid. It should be super smooth with the texture of soft served ice cream. Taste for seasoning and adjust with salt and lemon juice.",
    "Plate the hummus and make a well in the middle with a spoon. Place the sweet potatoes and a few garlic confit cloves in the middle. Drizzle with the oil from the garlic confit. Season with some flaky sea salt, or regular salt, urfa, and chopped cilantro. Enjoy with a warm fluffy pita!"
  ],
  "ingredients": [
    "0",
    "2 heads of garlic, cloves peeled clean",
    "olive oil",
    "bay leaf",
    "5-8 peppercorns",
    "1 sprig thyme",
    "1 cup dried chickpeas",
    "1 tsp baking soda",
    "1 clove garlic",
    "1 1/3 cup sesame paste",
    "3 tbsp lemon juice",
    "1/4 tsp cumin",
    "1/2-3/4 tsp salt",
    "2 large oven-roasted sweet potatoes, cut into 1″ cubes",
    "oil from garlic confit",
    "Flaky sea salt such as Maldon, or regular salt",
    "urfa, or smoked paprika",
    "chopped cilantro",
    "soft fluffy pitas"
  ],
  "__v": 1
}