{
  "hash": "97a22f35100233842745775560dadf5f1ba693d8",
  "title": "Meat Pies",
  "image": "http://food.fnr.sndimg.com/content/dam/images/food/fullset/2016/12/4/4/WU1506H_meat-pies_s4x3.jpg.rend.hgtvcom.616.462.jpeg",
  "href": "http://www.foodnetwork.com/recipes/ree-drummond/meat-pies-3591684?soc=socialfnvideo",
  "extension": "",
  "firstAdded": "2017-06-09T07:16:54.871000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Total:",
    "3 hr 50 min",
    "Active:",
    "40 min",
    "Yield:",
    "20 meat pies",
    "Directions",
    "For the crust: Put the frozen rolls on a baking sheet. Cover with a tea towel and let thaw and rise for 2 to 3 hours.",
    "For the filling: Add the oil to a large skillet and set it over medium heat. Cook the peppers and onion until soft, about 5 minutes. Add the red pepper flakes and garlic, then cook for another minute. Transfer to a bowl or plate and set aside.",
    "Put the same skillet over medium-high heat, add the beef and cook, breaking up any lumps. Add the chili powder, cumin and 3/4 teaspoon salt and cook until the meat is no longer pink, 5 to 7 minutes. Add the tomato paste and 1/4 cup water and stir until combined. Mix in the cooked vegetables. Transfer to a bowl and set aside to cool. When the meat is cool, add the cheese and parsley, then season with salt and pepper.",
    "Preheat the oven to 400 degrees F.",
    "To form: Roll out each dinner roll on a lightly floured surface into a 4-inch circle about 1/4 inch thick. Put 1 1/2 tablespoons of the meat mixture in the center of each circle. Brush around the outside of the circles with the egg wash and fold over the dough to form half-moon shapes. Press the edges together and crimp them with a fork. Put on a parchment-lined baking sheet and brush the tops with the egg wash.",
    "Bake until golden brown, 10 to 12 minutes."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Crust:",
    "20 frozen unbaked dinner rolls, such as Rhodes",
    "All-purpose flour, for rolling",
    "2 eggs mixed with 2 tablespoons water, for an egg wash",
    "Filling:",
    "1 tablespoon vegetable oil",
    "2 poblano peppers, seeded and chopped",
    "1 onion, chopped",
    "1/2 teaspoon red pepper flakes",
    "4 cloves garlic, chopped",
    "1 1/2 pounds ground beef",
    "1 tablespoon chili powder",
    "1 teaspoon ground cumin",
    "Kosher salt and freshly ground black pepper",
    "3 tablespoons tomato paste",
    "1 cup grated pepper Jack cheese",
    "1/2 cup chopped fresh parsley"
  ],
  "__v": 1
}