{
  "hash": "8ca4917cf4b76ff5de10757b535c570f571c8a01",
  "title": "Cajun Chicken Pasta",
  "image": "http://www.gimmesomeoven.com/wp-content/uploads/2012/09/cajun-chicken-pasta-1.jpg",
  "href": "http://www.gimmesomeoven.com/cajun-chicken-pasta/",
  "extension": "Chrome",
  "firstAdded": "2016-08-29T01:11:59.761000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat 2 tablespoons olive oil in a large skillet over medium-high heat. Add the sliced chicken breasts and sprinkle evenly with 1 tablespoon of the Cajun seasoning. Give them a quick stir to combine. Then saute for 5-7 minutes, stirring occasionally, until chicken is cooked through and is no longer pink. Remove chicken with a slotted spoon and set aside in a large bowl.",
    "Add an additional 1 tablespoon of olive oil, then add the bell peppers, tomatoes and onion. Saute for 5 minutes, stirring occasionally. Then add garlic. Continue sauteing for an additional 3-5 minutes until the edges of the veggies begin to brown just slightly. Transfer the veggies with a slotted spoon to the bowl with the chicken and set aside.",
    "(I recommend adding the pasta to the boiling water at this point.)",
    "Add the tablespoon of butter to the skillet, and once it is nearly melted, sprinkle the flour over it. Stir together to make a roux, and then cook for an additional minute, stirring occasionally. Add the white wine, and stir immediately to combine it with the roux, being sure to also scrape the brown bits on the bottom of the pan to grab that extra flavor. Let the wine reduce for 2 minutes, then add the chicken stock. Reduce heat to medium-low, and let simmer for 5 minutes to reduce. Add the cream, pinch of cayenne, and remaining 1 1/2 tablespoons of Cajun seasoning, and stir until combined. Season with additional salt and pepper if need be.",
    "Add your cooked pasta, chicken and veggies to the sauce and stir until evenly combined. Serve the pasta garnished with Parmesan and sliced green onions."
  ],
  "ingredients": [
    "0",
    "3 Tbsp. olive oil",
    "2 boneless skinless chicken breasts, sliced thin",
    "2 1/2 Tbsp. Cajun seasoning, divided",
    "3 small bell peppers, cored and thinly sliced (I used a red, orange and yellow bell pepper)",
    "3 roma tomatoes, diced",
    "1 medium red onion, peeled and thinly sliced",
    "3 cloves garlic, minced",
    "1 Tbsp. butter",
    "1 Tbsp. flour",
    "1/2 cup dry white wine",
    "1 cup chicken stock",
    "1/2 cup heavy cream (or you can reduce to 1/4 cup)",
    "pinch of cayenne pepper",
    "12 oz. dried pasta of your choice (I used penne), cooked al dente according to package instructions",
    "sliced or grated Parmesan cheese, for garnish",
    "thinly sliced green onions, for garnish"
  ],
  "__v": 1
}