{
  "hash": "16b3baf8c268ef337b9356fc7f2e5f7d033b250c",
  "title": "Scrumptious Grain-Free Snickerdoodles",
  "image": "https://www.godairyfree.org/wp-content/uploads/2010/12/grainfreesnickerdoodles2.jpg",
  "href": "https://www.godairyfree.org/recipes/gluten-free-snickerdoodles",
  "extension": "Chrome",
  "firstAdded": "2017-10-06T21:40:49.010000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat your oven to 375ºF.",
    "In a mixing bowl, beat the ½ cup of white sugar, coconut or brown sugar, eggs, vanilla, and coconut oil together (make sure those eggs aren’t cold, otherwise the coconut oil may solidify and leave little chunks).",
    "In a small bowl, stir the coconut flour and salt together, and then stir them into your wet mixture.",
    "Let it sit for 5 minutes. If the dough appears too soft or wet to handle, place it in the refrigerator for 30 minutes. It will set up quite a bit as the coconut oil chills and solidifies.",
    "Combine the two topping ingredients in a small bowl.",
    "Scoop the dough and roll it into balls. Jamie suggests using a small melon ball scooper, but I did them by hand and they were just a little smaller than a golf ball.",
    "Roll the balls in the cinnamon-sugar mixture, place the cookies on a baking sheet (preferably lined with parchment paper or a silicone baking mat – I use a baking mat), and flatten them a bit. They don’t spread much.",
    "Bake the cookies for 15 minutes. They will darken slightly. Let the cookies sit on the baking sheet for a few minutes, before removing them to a wire rack to cool completely."
  ],
  "ingredients": [
    "0",
    "½ Cup White Sugar (see note above for unrefined)",
    "¼ Cup Coconut Sugar, Evaporated Cane Juice, or Brown Sugar (I used the coconut sugar from Blue Mountain Organics)",
    "4 Eggs, brought to room temperature",
    "½ Teaspoon Vanilla Extract",
    "½ Cup Coconut Oil, melted (I buy Nutiva brand here)",
    "¾ Cup Coconut Flour (I buy Bob’s Red Mill brand)",
    "¼ Teaspoon Salt",
    "1",
    "2 Tablespoons White Sugar",
    "2 Tablespoons Ground Cinnamon"
  ],
  "__v": 1
}