{
  "hash": "9b3baa1fcd462aee630da3444776ae36ebe0e8f2",
  "title": "Sweets and Pies-Fresh Apple Pie",
  "image": "",
  "href": "http://www.chowhound.com/recipes/basic-apple-pie-29108",
  "extension": "Chrome",
  "firstAdded": "2015-12-04T17:02:54.390000",
  "users": [
    null
  ],
  "keywords": [
    "crust",
    "allpurpose",
    "flour",
    "rolling",
    "dough",
    "salt",
    "shortening",
    "frozen",
    "pieces",
    "unsalted",
    "butter",
    "chilled",
    "ice",
    "water",
    "squeezed",
    "lemon",
    "juice",
    "pie",
    "light",
    "brown",
    "sugar",
    "granulated",
    "cinnamon",
    "lightly",
    "zest",
    "nutmeg",
    "apples",
    "equal",
    "mixture",
    "granny",
    "smith",
    "gala",
    "pink",
    "lady",
    "milk",
    "halfandhalf",
    "cream",
    "coarsegrained",
    "turbinado"
  ],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "To make the crust:",
    "1Whisk together the flour and salt in a large bowl. Add the shortening and butter and toss with your fingers until well coated in the flour mixture. Using a pastry blender or your fingers, cut the shortening and butter into the dry ingredients until reduced to pea-size pieces, about 4 to 5 minutes.",
    "2Drizzle in 6 tablespoons of the ice water and the lemon juice and mix just until the dough comes together. (Add the last 2 tablespoons of ice water if it’s too dry, but don’t overwork the dough or it will become tough.)",
    "3Divide the dough into 2 flat disks, one slightly larger than the other. Wrap tightly in plastic wrap and refrigerate for at least 1 hour.",
    "To assemble and bake:",
    "1Heat the oven to 450°F and arrange a rack in the lower third. Place a baking sheet lined with aluminum foil on the rack.",
    "2On a lightly floured surface, roll out the slightly larger disk of dough to about 12 inches in diameter and 1/4 inch thick. Line a 9-inch pie plate with the dough and trim to leave a 1-inch overhang.",
    "3Place both sugars and the flour, cinnamon, lemon zest, salt, and nutmeg in a small bowl and whisk until evenly combined; set aside. Peel, halve, core, and slice the apples about 1/8 to 1/4 inch thick and place in a large bowl. Sprinkle with the lemon juice and toss to combine. Add the sugar mixture to the apples and toss until evenly coated; set aside.",
    "4Roll out the remaining disk of dough on a lightly floured surface to about 11 inches in diameter and 1/4 inch thick.",
    "5Brush the overhang of the crust in the pie plate with a thin layer of the milk, half-and-half, or cream. Add the apple mixture, piling it slightly in the center. Scatter the butter pieces over the apples and cover with the top crust. Trim the excess dough of the top crust to leave a 1-inch overhang. Press together the edges of the bottom and top crusts to seal.",
    "6Using your fingers or the back of a fork, crimp the dough to seal it tightly. With a sharp knife, cut 6 slits in the top crust, evenly spaced and radiating out from the center. Brush the top of the pie with the remaining milk, half-and-half, or cream and sprinkle with the coarse-grained sugar.",
    "7Place the pie on the hot baking sheet and bake for 20 minutes. Reduce the oven temperature to 375°F and bake until the pie crust is golden brown and the filling is thick and bubbling, about 40 to 50 minutes more. Remove from the oven and let sit on the baking sheet until the filling stops bubbling, then place on a wire rack to cool completely (at least 2 hours) before serving."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS (18)",
    "For the crust:",
    "2 1/2 cups all-purpose flour, plus more for rolling out the dough",
    "1/2 teaspoon fine salt",
    "1/2 cup shortening, frozen and cut into small pieces",
    "10 tablespoons unsalted butter (1 1/4 sticks), chilled and cut into small pieces",
    "6 to 8 tablespoons ice water",
    "2 teaspoons freshly squeezed lemon juice",
    "For the pie:",
    "1/3 cup packed light brown sugar",
    "1/3 cup granulated sugar",
    "3 tablespoons all-purpose flour",
    "3/4 teaspoon ground cinnamon",
    "1/2 teaspoon lightly packed lemon zest",
    "1/2 teaspoon fine salt",
    "1/4 teaspoon freshly grated nutmeg",
    "2 1/2 pounds apples (about 6), an equal mixture of Granny Smith and Gala or Pink Lady",
    "1 tablespoon freshly squeezed lemon juice",
    "2 teaspoons whole milk, half-and-half, or cream",
    "1 tablespoon unsalted butter, cut into small pieces",
    "1 teaspoon coarse-grained sugar, such as turbinado"
  ],
  "__v": 1
}