{
  "hash": "12b0c4a926f5791bf0c41e36692be1c3f1b09122",
  "title": "Hash Brown Bombs",
  "image": "http://recipe-folder.com/img/recipe-images/040/988/3224527340.jpg",
  "href": "https://tasty.co/recipe/hash-brown-bombs",
  "extension": "Chrome",
  "firstAdded": "2018-10-03T09:29:16.079000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large pan over medium heat, heat the olive oil until shimmering, then add the onion.",
    "Sauté the onion until golden and translucent, about 5 minutes.",
    "Add the garlic, ground beef, 1 teaspoon of salt, and ½ teaspoon of pepper. Break down with a spatula and cook until brown and cooked through.",
    "Add the spinach and stir until wilted. Remove the pan from the heat and set aside.",
    "Peel the potatoes and grate.",
    "Place the shredded potatoes in a kitchen towel over a bowl and wring out the water.",
    "In another large bowl, add the shredded potato, egg, remaining teaspoon of salt, remaining ½ teaspoon of pepper, onion powder, garlic powder, and Parmesan cheese. Mix until combined.",
    "Line a small bowl with plastic wrap.",
    "Place 1 cup (250 g) of the potato mixture in the bowl and use a spoon to spread the potatoes around the sides of the bowl.",
    "Sprinkle cheddar cheese on top of the potatoes and add a large spoonful of the beef mixture, being careful not to overfill.",
    "Pick up the sides of the plastic wrap and close the potatoes, twisting to create a sealed ball.",
    "Chill for 30 minutes.",
    "Preheat oven to 375°F (190°C).",
    "Place the potato balls on a greased baking sheet and bake for 35-40 minutes, or until the potatoes are crispy and brown.",
    "Serve topped with marinara sauce and parsley.",
    "Enjoy!"
  ],
  "ingredients": [
    "0",
    "1 tablespoon",
    "olive oil",
    "1",
    "small yellow onion, diced",
    "2 cloves",
    "garlic, minced",
    "1 lb",
    "ground beef",
    "(455 g)",
    "2 teaspoons",
    "salt, divided",
    "1 teaspoon",
    "pepper, divided",
    "2 cups",
    "fresh spinach",
    "(80 g)",
    "5",
    "large russet potatoes",
    "1",
    "large egg",
    "1 teaspoon",
    "onion powder",
    "1 teaspoon",
    "garlic powder",
    "½ cup",
    "shredded parmesan cheese",
    "(50 g)",
    "½ cup",
    "shredded cheddar cheese",
    "(50 g)",
    "marinara sauce, warmed, for serving",
    "fresh parsley, chopped, for serving"
  ],
  "__v": 1
}