{
  "hash": "0bd9f84453b3217776aa6cf2875fc37d3b63df5a",
  "title": "Mexican breakfast",
  "image": "//cdn.jamieoliver.com/recipe-database/oldImages/335_448/969_1_1436865889.jpg",
  "href": "http://www.jamieoliver.com/recipes/eggs-recipes/mexican-breakfast/",
  "extension": "Chrome",
  "firstAdded": "2016-08-18T00:56:19.548000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Method",
    "The Mexican name for this dish is ‘huevos rancheros’ – eggs with chillies, tomatoes and peppers in burritos. It’s absolutely great if you've got a few mates round, and even better if you've got a hangover you’re trying to shake off. If you wanted to take this dish one step further, for a late brunch you could serve it with black beans, some steamed rice and a bottle of Tabasco or chilli sauce beside it. Give it a go.",
    "Get a large frying pan (make sure you’ve got a lid to go with it) on a high heat and add several good lugs of olive oil. Add the onion, garlic, peppers, fresh and dried chillies, bay leaves and a good pinch of salt and pepper. Stir and cook for 15 minutes to soften and caramelize the veg. Pour in your tinned tomatoes and use a spoon or potato masher to break them up a bit. Bring to the boil, then turn down to a medium heat and cook for a further 5 minutes so the sauce starts to reduce down.",
    "When you’ve got a nice thick tomato stew consistency, have a taste and add a pinch more salt and pepper if you think it needs it. Lay your sliced tomatoes over the top of the mixture, then use a spoon to make small wells in the tomato stew, and crack in your eggs so they poach in the thick, delicious juices. Try to crack them in as quickly as you can so they all get to cook for roughly the same amount of time. Season from a height, put the lid on and let the eggs cook for around 3 to 4 minutes. Warm your tortillas while this is happening. You can pop them into the oven at 180ºC/350ºF/gas 4 for a few minutes, microwave them for a few seconds or even lay them over the lid of the pan so they heat up as the eggs cook.",
    "Take the lid off and check your eggs by giving them a poke with your finger. When they’re done to your liking, turn the heat off and take the pan to the table with your warmed tortillas, your Cheddar and a grater so everyone can get involved and make their own. Personally, I like to grate a bit of cheese right on to a warm tortilla, spoon an egg and some of the wonderful tomato stew on top, wrap it up, and eat it right away. What a beautiful way to wake up!"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "olive oil",
    "1\tonion\t, peeled and finely sliced",
    "2\tcloves of\tgarlic\t, peeled and finely sliced",
    "2\tred peppers\t, deseeded and finely sliced",
    "2\tfresh red or orange chillies\t, deseeded and finely sliced",
    "1\tlarge\tdried chilli",
    "3\tfresh bay leaves",
    "sea salt and freshly ground black pepper",
    "2 x 400\tg\ttins of chopped tomatoes",
    "2\tlarge\ttomatoes\t, sliced",
    "6\tlarge\teggs\t, preferably free-range or organic",
    "6\ttortillas",
    "Cheddar cheese\t, to serve"
  ],
  "__v": 1
}