{
  "__v": 1,
  "directions": [
    "0",
    "Preheat the oven to 220 degrees.",
    "Get your pestle and mortar out! Pour about 4 tbsp olive oil in, with the sliced garlic and chilli. Squeeze in the juice of half a lemon. Grind it into a paste and then marinate the chicken pieces. Place them in an oven tray, ready to bake. Make sure every part of the chicken is covered.",
    "Put the shallots and olives in the mortar to pick up any remaining marinade and then add to the tray with the fresh thyme and mix it all together with a pinch of salt and pepper. Place in the middle of the hot oven for 1 hour.",
    "Cut up the sweet potatoes to small roasties size. Drizzle with a little olive oil and place in the hot oven for 1 hour.",
    "During the hour that everything is cooking, check the food twice and turn both the chicken and the sweet potatoes. This helps keep the chicken juicy and stop the potato going crispy.",
    "You can make your salad or vegetables in this time.",
    "After the cooking hour, stick a fork in the chicken and check that the juice is running clear. If not, put back in the oven for another 15 minutes and check again. Make sure you turn the chicken pieces so that they stay juicy.",
    "Take the sweet potato out the oven. Gently peel the skins off and put the soft part of the potato in a bowl. Keep the skins as we’ll use those for something else! Add a pinch of salt and pepper and mash the soft sweet potato.",
    "Take the chicken out the oven and check again. When it is cooked through and running clear, add the other half of the lemon juice.",
    "Everything should now be ready to serve with your favourite veg or salad. (Or if you are making this for Shabbat, you can place it on your hot plate now!)",
    "It really is quite delicious and I hope you agree!",
    "Enjoy!"
  ],
  "firstAdded": "2014-11-12T10:49:45.038000",
  "hash": "5ac876300839c5a175d0851bdabb38d1e5877ea5",
  "href": "http://eatnowtalklater.wordpress.com/2012/04/11/chicken-sweet-potato-mash/",
  "image": "http://eatnowtalklater.files.wordpress.com/2012/04/p10123161.jpg?w=610&h=457",
  "ingredients": [
    "0",
    "Serves: 3",
    "Prep time: 25 mins",
    "Cooking Time: 1 hr 15 mins",
    "Ingredients:",
    "8 chicken thighs, skinless",
    "8 shallots, peeled and halved",
    "Handful of black olives, pitted and halved",
    "1 lemon",
    "1 tsp dried chilli flakes",
    "Fresh thyme sprigs",
    "3 cloves garlic, peeled and sliced",
    "Olive oil",
    "Salt & Pepper",
    "Sweet Potato Mash",
    "3 large sweet potatoes, skin on",
    "Olive oil"
  ],
  "keywords": [
    "serves",
    "prep",
    "time",
    "mins",
    "cooking",
    "chicken",
    "thighs",
    "skinless",
    "shallots",
    "black",
    "olives",
    "lemon",
    "chilli",
    "thyme",
    "sprigs",
    "garlic",
    "olive",
    "oil",
    "salt",
    "pepper",
    "potato",
    "mash",
    "potatoes",
    "skin"
  ],
  "title": "Baked Chicken with Thyme and Shallots",
  "users": [
    null
  ]
}