{
  "hash": "b7f8eb9bbba5749d97738256ce70f54f9b6f6173",
  "title": "Lentil Baked Ziti",
  "image": "https://cookieandkate.com/images/2017/01/baked-ziti-recipe.jpg",
  "href": "https://cookieandkate.com/2017/lentil-baked-ziti-recipe/",
  "extension": "Firefox",
  "firstAdded": "2018-08-22T02:54:44.505000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To cook the lentils: In a large saucepan over medium heat, warm the olive oil until shimmering. Add the onion and salt. Cook, stirring occasionally, until the onion is turning translucent, about 4 to 5 minutes. Add the garlic and cook until fragrant, about 30 seconds. Add the lentils and water, and stir to combine.",
    "Raise the heat to high and bring the mixture to a simmer, then reduce heat to medium-low and gently simmer until the lentils are tender and cooked through, about 30 to 40 minutes. Drain the mixture well in a fine-mesh sieve and return the lentils to their pot. Set aside.",
    "Meanwhile, preheat the oven to 350 degrees Fahrenheit and bring a large pot of salted water to boil. Cook the pasta just until al dente, according to package directions. Drain and return the pasta to the pot.",
    "Add the lentils to the pasta. Add ½ cup of the cheese, reserving the rest for later. Season to taste with salt (I usually add ¼ to ½ teaspoon), freshly ground black pepper and red pepper flakes (if using).",
    "Pour 1 cup of the marinara sauce into a 13×9-inch baking dish. Spread the sauce around with a spatula so the base of the baker is evenly coated. Pour the lentil and pasta mixture into the baker and spread it so it’s evenly distributed. Using a spoon, dollop cottage cheese in big spoonfuls over the pasta, then just lightly swirl the mixture a bit so the cottage cheese is still concentrated in those areas.",
    "Drizzle the rest of the sauce evenly over the dish (adding extra sauce if you’d like) and gently spread it over the pasta. Sprinkle the remaining mozzarella evenly over the dish. Cover the baker tightly with aluminum foil—don’t let it touch the cheese—or stick a few wooden toothpicks down the center and place a generously sized piece of parchment paper, folded in the middle to make a “tent” over the baker.",
    "Bake for 30 minutes, then remove the covering, increase the heat to 450, and continue baking until the cheese on top is golden and spotty, 3 to 9 more minutes. Remove the baker from the oven and let it cool for 10 minutes before serving (trust me). Sprinkle freshly torn basil on top, slice and serve."
  ],
  "ingredients": [
    "0",
    "Lentils*",
    "1 tablespoon olive oil",
    "1 red onion, chopped",
    "¼ teaspoon salt",
    "2 cloves garlic, pressed or minced",
    "1 ¼ cups regular brown lentils, picked over for debris and rinsed",
    "3 cups water",
    "Pasta and everything else",
    "12 ounces whole grain ziti, rigatoni or penne pasta",
    "8 ounces (2 packed cups) grated part-skim mozzarella cheese, divided",
    "Salt, to taste",
    "Freshly ground black pepper, to taste",
    "Pinch of red pepper flakes (omit if sensitive to spice)",
    "23.5 ounces Newman’s Own Organics Marinara (plus 1 cup extra sauce, if you like extra-saucy ziti like me), divided",
    "1 cup cottage cheese or ricotta cheese**",
    "Handful of torn fresh basil leaves, for garnishing"
  ],
  "__v": 1
}