{
  "hash": "1ebff3cad7e935a42ff819045173b3406fae5770",
  "title": "Buttermilk Clementine Cinnamon Rolls\nmakes 8-10 Buttermilk Clementine Cinnamon Rolls Recipe note: About 6 clementines are needed for this recipe. Zest all clementines first, then peel and chop 3, then juice 3.",
  "image": "",
  "href": "http://katu.com/amnw/am-northwest-cooking-recipes/not-just-baked-buttermilk-clementine-cinnamon-rolls-12-04-2017",
  "extension": "Chrome",
  "firstAdded": "2017-12-07T03:47:27.994000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Method:",
    "dough:",
    "Combine warm water, yeast, and 1 teaspoon sugar in a small bowl or in liquid measuring cup. Stir to combine using a fork, let sit for about 5 minutes, until foamy. Add remaining sugar, buttermilk, clementine zest, and egg, use fork to combine. Add flour and salt to bowl of a stand mixer fitted with dough hook, whisk to combine, then add egg/buttermilk mixture.",
    "Turn mixer on to medium for 3-4 minutes. Turn off mixer and add butter, mix until dough on medium until it is smooth and pulls away from the side of the bowl, about 5-6 minutes. Cover bowl with plastic wrap or clean dish towel, set aside in a warm place and allow the dough rise for 1 hour, until it has doubled in size. Tip: turn oven on it’s lowest setting for 10-15 minutes, turn off, and place the covered mixer bowl with dough in it until it doubles in size. (especially in colder months)",
    "To make the filling: Combine brown sugar,melted butter, clementine zest, cinnamon, and salt in a medium bowl. Mix well to combine using a fork. Butter a 10 inch cast iron or oven safe pan, or 2 quart/ 8×11 baking dish.",
    "Gently remove the dough from the bowl onto a lightly floured counter. Gently press fingers into dough creating a circle. Using a rolling pin, roll the dough to a 10 x 20 rectangle. Evenly spread butter/sugar/zest mixture onto dough using hands (fun) or large spatula to keep clean. Top sugar evenly with chopped clementine pieces. Roll dough up tightly and place dough seam side down.",
    "Using a sharp knife or pizza/pastry cutter, trim edges. Cut into 8-10 equal 2 inch slices. Place rolls, cut sides up into buttered baking pan or cast iron pan. Completely cover pan with plastic wrap and set aside in a warm place to rise for 30 minutes. (Alternatively, the rolls may be refrigerated overnight to bake following day.)",
    "Place oven rack in center of oven and preheat to 375 degrees while the rolls rise.",
    "Uncover rolls. (If refrigerated, allow them to sit at room temperature for 10 minutes.) Bake for 30 minutes, or golden brown. Remove from oven and allow to cool 5-10 minutes before icing and serving.",
    "Making the icing: While the rolls are baking, whisk together buttermilk, sugar, and clementine juice in a small bowl until completely smooth. Place in fridge to thicken while rolls continue to bake.",
    "Clementine Icing: Dip tines of a fork into icing and drizzle all over the rolls or dip tops into icing. Enjoy and serve immediately. Store leftover rolls on counter for up to 3 days, and in fridge for up to 5. Store icing in fridge for up to 5 days. But certainly best served fresh :)."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "•\t1/4 cup water, heated to 110 degrees",
    "•\t1 (1/4 oz) packet active dry yeast",
    "•\t1/4 cup sugar, reserve 1 teaspoon",
    "•\t1/2 cup Bulgarian style buttermilk, room temperature",
    "•\t1 tablespoon clementine zest",
    "•\t1 egg",
    "•\t2 3/4 cups Bob’s Red Mill all purpose flour, plus more for kneading/rolling out",
    "•\t3/4 teaspoon fine sea salt",
    "•\t4oz unsalted butter, cubed, room temperature, plus more for coating pan",
    "for filling:",
    "•\t1/2 cup brown sugar, I use organic brown sugar",
    "•\t4oz unsalted butter, melted",
    "•\t1 tablespoon clementine zest",
    "•\t1 tablespoon ground cinnamon",
    "•\t1/2 teaspoon fine salt",
    "•\t1/2 cup clementines, chopped",
    "for the icing:",
    "•\t1/4 cup confectioners sugar, I use organic confectioners sugar",
    "•\t1/4 cup Bulgarian style buttermilk",
    "•\t3 tablespoons clementine juice"
  ],
  "__v": 1
}