{
  "__v": 1,
  "directions": [
    "0",
    "Combine first 5 ingredients, and stir very well. In a separate bowl, combine all liquid ingredients for the cookies. Mix wet into dry to form a dough, then refrigerate 30 minutes before baking. Preheat oven to 300 degrees F. Put dough in a plastic bag, and smush into one big ball. Remove from bag, roll into a thin dough, and cut flat circles using a circle cutter or a circle-shaped lid. Bake on a greased cookie tray for 10 minutes; they’ll still look a little underdone when they come out of the oven, but that’s ok. Important: allow to cool 10 minutes before removing from the tray.",
    "To make the filling, mix all filling ingredients in a small food processor (or patiently, with a fork). (If using coconut butter, make sure it is melted.) Put about a scant teaspoon-full (3g) on half of the cookie discs, then top each with remaining cookie discs and fridge so filling firms up. Store in the fridge so the filling stays hard."
  ],
  "firstAdded": "2014-08-31T03:28:48.244000",
  "hash": "cf9f20ee7e1e13d4fa69ecf08ed6636c0044eb97",
  "href": "http://chocolatecoveredkatie.com/2012/10/24/healthy-oreos/",
  "image": "http://www.chocolatecoveredkatie.com/wp-content/uploads/oreos_F01C/healthy-oreos_thumb_5.jpg?73e30c",
  "ingredients": [
    "0",
    "3/4 cup spelt flour (or all-purpose, or gluten-free all-purpose) (120g)",
    "1/4 cup plus 2 tbsp dutch cocoa powder (30g) (regular cocoa is fine; they just won’t taste as authentic)",
    "1/4 cup plus 2 tbsp xylitol or sugar (or coconut sugar or evaporated cane juice) (78g)",
    "1/4 tsp salt",
    "1/4 tsp baking soda",
    "1 tsp pure vanilla extract",
    "1/4 cup vegetable or coconut oil (44g)",
    "3 tbsp milk of choice (45g)",
    "2 tbsp pure maple syrup (or agave) (30g)"
  ],
  "keywords": [
    "spelt",
    "flour",
    "glutenfree",
    "allpurpose",
    "dutch",
    "regular",
    "cocoa",
    "wont",
    "authentic",
    "xylitol",
    "coconut",
    "sugar",
    "evaporated",
    "cane",
    "juice",
    "salt",
    "baking",
    "soda",
    "vanilla",
    "oil",
    "milk",
    "maple",
    "syrup",
    "agave"
  ],
  "title": "Healthy Oreos",
  "users": [
    null
  ]
}