{
  "hash": "76e4716f4c549630b3d8dd6088ef687da18a9f44",
  "title": "Instant Pot sesame chicken",
  "image": "https://littlesunnykitchen.com/wp-content/uploads/Instant-pot-sesame-chicken-3-683x1024.jpg",
  "href": "https://littlesunnykitchen.com/instant-pot-sesame-chicken/",
  "extension": "Firefox",
  "firstAdded": "2020-04-04T06:08:12.940000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Wash and cube the chicken breasts. Mince garlic, and peel and grate ginger.",
    "Add the chicken to the Instant Pot, followed by soy sauce, garlic, ginger, ketchup, hot sauce or sriracha, and black pepper. Give the ingredients a quick mix.",
    "Cover the pot with the lid, and make sure that the valve is in sealing position. Click on MANUAL or PRESSURE COOK (this depends on which Instant Pot do you have), and cook on high for 3 minutes.",
    "Allow the Instant Pot to come to pressure, and count down to When it beeps, quickly release the steam by turning the vent to RELEASE position and make sure that it's not close to your face as the steam will be really hot!",
    "Carefully open the lid, and click on SAUTE and set for about 5 minutes. Add the honey, sesame oil and make the slurry.",
    "To make the slurry, mix 2 tbsp of corn starch with 1-2 tbsp water. Add it to the sauce, and mix with a wooden spoon until the sauce thickens. You might not need to thicken it for 5 minutes on sauté, just switch it off when it’s thick enough and you may even want to remove the pot from the Instant Pot and set it aside.",
    "Garnish with sesame seeds, and scallions. Serve with plain white rice."
  ],
  "ingredients": [
    "0",
    "2 pounds Chicken breast",
    "½ cup Soy sauce",
    "¼ cup Ketchup",
    "1 tsp Hot sauce or sriracha",
    "2 cloves Garlic",
    "1 inch Ginger",
    "¼ cup Honey",
    "1 tbsp Sesame oil",
    "2 tbsp Corn starch + 1-2 tsbp water",
    "1 tbsp Sesame seeds to garnish",
    "Scallions or spring onions to garnish"
  ],
  "__v": 1
}