{
  "hash": "6745e8db28ce2405fe65e28a39f850f76c85e501",
  "title": "cinnamon crunch braided brioche bread",
  "image": "https://www.halfbakedharvest.com/wp-content/uploads/2013/11/Cinnamon-Crunch-Braided-Brioche-Bread-1-224x224.jpg",
  "href": "https://www.halfbakedharvest.com/cinnamon-crunch-braided-brioche-bread/",
  "extension": "Chrome",
  "firstAdded": "2020-01-03T16:56:39.956000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine warm water, yeast, salt and sugar in a large mixer bowl and mix on low speed until incorporated. Add eggs and melted butter and mix until combined. Gradually mix in the flour until the dough comes together. Remove the dough from the bowl and place on a lightly floured surface. Grease a large bowl and add the dough to the bowl. Cover the bowl with plastic wrap and let sit 1-2 hours or until the dough has doubled in size.",
    "Once the dough has doubled in size place the bowl in the fridge overnight or up to 5 days. When ready to bake the bread remove the dough and let sit at room temperature for 15 minutes.",
    "In the meantime gather the ingredients for the Cinnamon Sugar Coating. Add the 1/2 cup melted butter to a large shallow bowl, stir in the vanilla.",
    "In another medium size bowl combine the 1 cup brown sugar with 2 teaspoons cinnamon. Mix well.",
    "Grease a loaf pan and sprinkle the inside of the loaf pan with the Cinnamon Sugar Coating.",
    "Sprinkle the dough with flour and cut into three equal pieces. Carefully roll each piece into a 12-inch rope.",
    "Now take each rope and dip it through the butter, then generously sprinkle each rope with the Cinnamon Sugar Coating. Now gently roll each rope in the remaining coating that has gathered around the rope on your work surface. I used most of my cinnamon sugar for this.",
    "To make the braid, start at one end and pinch the ends of the rope together. Bring the right outside rope over the center rope; that rope now becomes the center. Bring the left outside rope over the new center rope; that rope now becomes the center. Continue braiding until you reach the end. Pinch the ropes together to seal.",
    "Carefully lift the braid and place it in the greased and sugared loaf pan. Cover the pan with plastic wrap and let rise in a warm draft free area another 1-2 hours, or until double in size. About 20 minutes before you are ready to bake the bread preheat the oven to 350 degrees F.",
    "Make the streusel. In a bowl add the brown sugar, butter, cinnamon and pecans. Using your hands work the butter into the sugar until the mixture resembles small peas.",
    "Place the loaf on a baking sheet and and sprinkle the streusel overtop. Bake in a preheated 350 degree F oven for 45 to 55 minutes, tenting with foil after 15 to 20. Cool in the pan for 10 minutes and then carefully turn the bread out of pan to cool completely before slicing. If some of the streusel falls off, just place it back on the loaf."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1/2 cup warm water",
    "3 teaspoons yeast",
    "1 1/2 teaspoons salt",
    "3 tablespoon sugar",
    "3 cups flour",
    "3 eggs",
    "12 tablespoons butter melted",
    "CINNAMON SUGAR COATING",
    "1/2 cup butter melted",
    "1 teaspoon vanilla extract",
    "1 cup brown sugar",
    "2 teaspoons cinnamon",
    "STREUSEL TOPPING",
    "1/4 cup brown sugar",
    "1 tablespoon butter cold",
    "1 teaspoon cinnamon",
    "2 tablespoons chopped pecans optional"
  ],
  "__v": 1
}