{
  "hash": "def9abd527637cba3d699432043a428ec356d355",
  "title": "Spinach-Broccoli Soup with Garlic and Cilantro",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/spinach-broccoli-soup-with-garlic-and-cilantro",
  "extension": "Chrome",
  "firstAdded": "2016-09-14T15:50:15.880000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400°. Separate broccoli stalk from florets. Finely chop florets, transfer to a rimmed baking sheet, and toss with olive oil. Season with salt and pepper and roast, tossing halfway through, until dark brown and tender, 15–20 minutes. Meanwhile, trim and peel broccoli stalk; chop and set aside.",
    "Heat 2 Tbsp. coconut oil in a large heavy pot over medium-high. Add onion and chopped garlic; season with salt and pepper. Cook, stirring occasionally, until onion begins to soften, about 5 minutes. Reduce heat to medium-low, cover pot, and cook, checking and stirring occasionally, until onion and garlic are very soft, 25–30 minutes (this long, slow cooking draws maximum flavor out of the vegetables). Add broccoli stem, cover, and cook, stirring occasionally, until softened, 5–10 minutes. Increase heat to medium-high, add 5 cups broth, and bring to a boil. Reduce heat and simmer, stirring occasionally, until flavors meld, 10–15 minutes. Let cool slightly.",
    "Set aside 1/4 cup cilantro for serving. Blanch spinach and remaining cilantro in a large pot of boiling salted water until bright green and just wilted, about 30 seconds. Drain and transfer to a bowl of ice water to stop cooking; let cool. Drain; squeeze out excess liquid.",
    "Working in batches, purée soup base and blanched spinach and cilantro in a blender until very smooth (make sure lid is slightly ajar to let steam escape; cover with a towel). Transfer to a large bowl or pitcher.",
    "Pour soup back into pot and thin with broth, if needed. Taste and season with salt and pepper; keep warm.",
    "Heat remaining 1 Tbsp. coconut oil in a small skillet over medium. Cook sliced garlic, swirling skillet often, until golden brown, about 1 minute. Transfer garlic to a small bowl with a slotted spoon; set garlic oil aside.",
    "Add roasted broccoli florets, lemon zest, and reserved cilantro leaves to garlic and toss to combine. Serve soup topped with broccoli-garlic mixture and drizzled with reserved garlic oil.",
    "Do ahead: Soup (without broccoli-garlic mixture) can be made 4 days ahead, though its bright green color will fade over time. Let cool; cover and chill. Cover and chill raw broccoli florets separately. Roast broccoli and prepare topping just before serving."
  ],
  "ingredients": [
    "0",
    "1 head of broccoli (about 10 oz.)",
    "1 tablespoon olive oil",
    "Kosher salt, freshly ground pepper",
    "3 tablespoons virgin coconut oil or olive oil, divided",
    "1 large onion, chopped",
    "6 garlic cloves, 4 cloves chopped, 2 cloves thinly sliced",
    "5 (or more) cups low-sodium chicken broth",
    "¾ cup cilantro leaves with tender stems",
    "2 bunches spinach, trimmed",
    "½ teaspoon finely grated lemon zest"
  ],
  "__v": 1
}