{
  "hash": "15d60693f387d0c761fc59ae3b41afee6c3ad524",
  "title": "Mushroom Black Bean-Quinoa Burger",
  "image": "https://d1c8xu194km6ge.cloudfront.net/assets/332601/Black_Bean_Quinoa_Burgers-44_HD1280.jpg",
  "href": "https://rouxbe.com/recipes/5556-mushroom-black-bean-quinoa-burger",
  "extension": "Chrome",
  "firstAdded": "2018-02-18T10:19:24.205000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Step 1: Make the Tomato Chutney",
    "For the best results, make the Tomato Chutney a few hours, or the day before.",
    "Step 2: Making the Burger Mixture",
    "To make the burgers, first gather and prepare all of your mise en place.",
    "The amount of chili powder needed, will depend on how spicy you like your food and how spicy the chili powder is. We used this Chili Powder recipe, which was a nice balance of flavor and spice.",
    "Next, place a large fry pan over medium heat. Once the pan is hot, dry-sauté the onions until golden and translucent — adding a touch of water to the pan as needed, so the onions and/or pan do not burn.",
    "Next, add the garlic and cook for 30 seconds or so and then add the mushrooms. Let this cook for 5 minutes or so, or until all of the moisture has cooked out of the mushrooms.",
    "At this point, transfer the mushroom mixture to a food processor. Add the quinoa, black beans, oats, spices and flax meal. Pulse the mixture a few times. Do not over pulse the mixture, the texture should course/chunky, but still hold together. Taste the mixture for seasoning and adjust as desired.",
    "Note that these burgers can be made a day or two ahead of time and stored in the refrigerator. They also freeze very well.",
    "Step 3: Cooking the Burgers",
    "To cook the burgers, preheat the oven to 400°F (200°C).",
    "Next, form the mushrooms mixture into patties — using a round mould will help to evenly shape the burgers — it also makes them easier to firmly press together. This can be done directly on a baking tray lined with parchment or a silicone baking sheet. We used a 3 1/2 inch mould and filled it about halfway with the mushroom mixture.",
    "Pace the burgers into the oven and bake for 15 to 20 minutes. If desired, the burgers can be flipped halfway through cooking. This will just brown them on both sides, but it’s not entirely necessary.",
    "Note: These burgers can also be cooked on a hot grill or barbecue with good success."
  ],
  "ingredients": [
    "0",
    "1 onion, minced",
    "2 cloves garlic, minced",
    "12 shiitake mushrooms, stemmed and sliced",
    "12 cremini mushrooms, sliced",
    "1 cup cooked red quinoa",
    "1 cup cooked black beans",
    "1/2 cup rolled oats",
    "1 tbsp Chili Powder",
    "1 tsp garlic powder",
    "1 tsp onion powder",
    "1/2 tsp paprika (smoked or regular)",
    "Seasoning, to taste",
    "3 tbsp flax meal (ground flax seeds)"
  ],
  "__v": 4
}