{
  "hash": "1700e76d619db8c3c636ffd70d6909eeab2611b8",
  "title": "Melty mushroom Wellingtons",
  "image": "//www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--441520_11.jpg?itok=0GorThoH",
  "href": "https://www.bbcgoodfood.com/recipes/12804/melty-mushroom-wellingtons",
  "extension": "",
  "firstAdded": "2017-12-16T00:19:26.315000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Method",
    "Heat oven to 220C/200C fan/gas 7. Remove the stalks from the mushrooms. Heat half the oil in a large frying pan and sizzle the mushrooms for 3-4 mins on each side until golden and cooked through – add a drop more oil if needed. Lift the mushrooms out onto kitchen paper to drain.",
    "Place the same pan back on the heat with the rest of the oil. Fry the garlic for a moment, add the spinach to the pan, then cook for 2-3 mins over a high heat until completely wilted. Season with salt and pepper, then tip the spinach into a large sieve to drain thoroughly.",
    "On a lightly floured surface scattered with the thyme leaves, roll the pastry out to the thickness of a £1 coin. Using a saucer and a larger-size plate, cut out 4 circles about 5cm wider than the mushrooms (for the bottoms) and 4 circles about 10cm wider (for the tops), re-rolling the trimmings if you need to.",
    "Place the 4 smaller circles on a baking tray and top each with a quarter of the spinach, making sure the pile of spinach isn’t wider than the mushrooms. Top the spinach with a slice of cheese, then a mushroom, smooth-side up, and top the mushroom with another slice of cheese. Brush the border to each circle with egg, then gently stretch the larger circle over the mushroom, trying not to trap any air, then press the edges together with a fork. Trim the edges with a knife if you want, then brush each generously with egg. Bake for 40 mins until golden, then leave to cool for a few mins before serving."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "4 large field mushrooms",
    "4 tbsp olive oil",
    "1 garlic clove, chopped",
    "about 400g/14oz spinach",
    "leaves",
    "a dusting of flour",
    "1 tbsp picked thyme",
    "leaves",
    "500g block all-butter puff pastry",
    "140g Stilton",
    ", sliced",
    "1 egg",
    ", beaten"
  ],
  "__v": 1
}