{
  "__v": 1,
  "directions": [
    "0",
    "Rinse the quinoa thoroughly under running water. In a 2-quart (or larger) saucepan, heat a drizzle of olive oil over medium heat. Add the drained quinoa and cook, stirring, for 1 minute. Add the salt, the lemon juice (about 3 tablespoons), 1/4 cup white wine, and 1 1/2 cups water.",
    "Bring to a boil, then cover and lower the heat. Simmer for covered for 15 minutes. Turn off the heat. Let stand covered for 5 minutes. Remove the lid and fluff the quinoa. Stir in the lemon zest and half of the minced parsley.",
    "While the quinoa is cooking, melt 1 tablespoon of butter over low heat in a deep heavy skillet. Add the garlic, red onion or shallot, bell pepper, and tomatoes. Cook over low heat, stirring frequently, until the garlic and tomatoes are soft and fragrant. Do not let the garlic burn or get crispy; let it cook slowly in the butter. Turn the heat to medium and add the second tablespoon of butter and the remaining 2/3 cup white wine. Whisk constantly and bring the wine to a simmer. Cook until slightly reduced and shiny. Turn the heat to its lowest setting and keep the sauce warm while you cook the shrimp.",
    "Pat the shrimp dry and season with salt and pepper. In a separate large skillet or wok, heat the remaining tablespoon of butter over high heat and sear the shrimp quickly until cooked — about 1 to 2 minutes. Add to the pan with the vegetables and sauce and toss with the remaining parsley. Taste and season with more salt and pepper if needed.",
    "Serve immediate, topping the lemon quinoa with shrimp and its sauce."
  ],
  "hash": "95380c29576a9f55b7901f504cddf61276c504cf",
  "href": "http://www.thekitchn.com/recipe-saucy-sauteed-shrimp-over-lemon-quinoa-25525?utm_source=RSS&utm_medium=feed&utm_campaign=Category%2FChannel%3A+Main#52d41df997f2fcdc4f000013",
  "image": "http://p-hw1.pixstatic.com/524cc4d8697ab0616600628c._w.540_s.fit_.jpg",
  "ingredients": [
    "0",
    "1 cup golden quinoa",
    "Olive oil",
    "1/4 teaspoon salt",
    "1 lemon, zested and juiced",
    "1 cup full-bodied white wine, divided",
    "1/2 cup finely chopped Italian parsley leaves, divided",
    "3 tablespoons unsalted butter, divided",
    "2 garlic cloves, minced",
    "1/2 small red onion or 2 large shallots, minced",
    "1/2 red bell pepper, diced",
    "1/4 cup sundried tomatoes, finely sliced",
    "1 pound fresh small pink shrimp"
  ],
  "keywords": [
    "golden",
    "quinoa",
    "olive",
    "oil",
    "salt",
    "lemon",
    "zested",
    "juiced",
    "fullbodied",
    "white",
    "wine",
    "divided",
    "italian",
    "parsley",
    "leaves",
    "unsalted",
    "butter",
    "garlic",
    "red",
    "onion",
    "shallots",
    "bell",
    "pepper",
    "sundried",
    "tomatoes",
    "pink",
    "shrimp"
  ],
  "title": "Saucy Sautéed Shrimp over Lemon Quinoa",
  "users": [
    null
  ]
}