{
  "hash": "57088af148e3342fd238552e9dcba59ecf2abe76",
  "title": "Easy Creamy Buffalo Chicken Quinoa Bake",
  "image": "https://www.halfbakedharvest.com/wp-content/uploads/2013/09/Easy-Creamy-Buffalo-Chicken-Quinoa-Bake-7.jpg",
  "href": "https://www.halfbakedharvest.com/easy-creamy-buffalo-chicken-quinoa-bake/",
  "extension": "Chrome",
  "firstAdded": "2017-08-06T01:24:34.853000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place quinoa in a fine-mesh strainer and rinse thoroughly under running water.",
    "Transfer quinoa to a medium saucepan. Add water or broth, and bring to a boil. Reduce heat to medium-low and add the chopped kale and broccoli right on top of the water, do not stir. Cover and simmer for 15-20 minutes or until water is absorbed. Remove from heat and let sit, covered, for 5 minutes. Fluff quinoa with a fork and stir the veggies into the quinoa. Add the chicken, toss and set aside.",
    "Preheat oven to 350 degrees F.",
    "Heat a medium saucepan over medium heat. Add the 1 tablespoon of butter, once it’s melted and bubbly add the flour. Whisk together to create a roux and cook for 1-2 minutes until mixture gets a bit golden in color. Add milk, stir and turn down heat to low. Continue stirring until milk thickens. Add in gouda and half of the cheddar cheese and continue to stir until mixture is smooth. Remove from the heat and stir in the 1/4 melted butter, hot sauce, seasoned salt and pepper.",
    "Pour the sauce over the quinoa mixture and mix well to combine. Once combined, spray an 8x8 or 9x9 baking dish with non-stick spray and pour the entire quinoa mixture into the dish. Top with remaining fresh cheddar cheese, sliced (for an extra gooey top) or shredded.",
    "Bake for 10 to 15 minutes and then turn the broiler on and broil for 1 to 2 minutes or until cheese is golden and bubbly.",
    "Remove from the oven and top with blue cheese, fresh cilantro and green onions. Allow to sit five minutes and then serve."
  ],
  "ingredients": [
    "0",
    "2cupswater",
    "1cupuncooked quinoa",
    "1 1/2cupsbaby kale",
    "1small head broccolichopped",
    "2small cooked chicken breastchopped or shredded (the chicken can be left out for a vegetarian version)",
    "1tablespoonflourmay use whole wheat",
    "1tablespoonbutter",
    "1cupmilkI used 2%",
    "1/2cupshredded gouda cheese",
    "3/4cupshredded cheddar cheesedivided in half (slices work too)",
    "1/4cupbuttermelted",
    "1/2cuphot sauceI used Franks",
    "1/2teaspoonseasoned salt",
    "1/4teaspoonpepper",
    "1/4cupcrumbled blue cheese",
    "fresh cilantrochopped, for garnish",
    "green onionschopped, for garnish"
  ],
  "__v": 1
}