{
  "hash": "c2f013e4f7d07304b2adc21911dc7b84f5db5225",
  "title": "Biscuit-Topped Chicken Pot Pie",
  "image": "https://munchies-images.vice.com/wp_upload/chicken-pot-pie.jpg?crop=1xw:0.84375xh;center,center&resize=1536:*",
  "href": "https://munchies.vice.com/en_us/article/4x5emj/biscuit-topped-chicken-pot-pie",
  "extension": "Chrome",
  "firstAdded": "2017-07-08T06:10:09.649000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the biscuits: In a large bowl, stir together the flour, baking powder, salt, and baking powder. Add in the butter and mix until pea-sized crumbles form. Add in the buttermilk and mix until just combined, taking care not to overmix.",
    "Transfer the dough to a lightly floured work surface. Pat the dough into a 3/4-inch thick rectangle and fold the dough over onto itself a total of 5 or 6 times. Pat the dough out again into a rectangle and, using a biscuit cutter, cut out the biscuits making sure to cut straight down and up, instead of twisting the cutter as you are pulling it out of the dough (this will seal the edges of the dough, not allowing the layers of the biscuit to form or rise). The dough should make about 12-15 biscuits. Place the biscuits onto a parchment paper-lined baking sheet and freeze until ready to use.",
    "Make the chicken stock: Place the chicken in a large pot and cover with water. Add in half the carrots, the celery, garlic, and onion and bring to a boil. Cook until the chicken is tender, about 90 minutes. Using tongs, remove the chicken and place on a sheet tray to cool. Once the chicken is cool enough to handle, pick all of the meat off of the bones, discarding the bones and skin. Strain the stock, discarding the remaining solids. Set aside 2 cups of stock, saving or freezing the rest for another use.",
    "Make the pot pie: Heat the oven to 450°F|230°C. Bring a large pot of water to a boil. Add the pearl onions and cook for 3 minutes, then drain and transfer to an ice bath. When the onions are cool enough to handle, peel them and pat them dry.",
    "Melt the butter in a medium saucepan. Add the remaining carrots and cook until the carrots are soft, about 5 minutes, then add the onions and mushrooms. Cook another 3 minutes, then add in the flour. Cook for 2 to 3 minutes, then add in the reserved stock and the milk. Cook, stirring, until thick, 6 to 7 minutes. Stir in the reserved shredded chicken and the peas and season with salt and pepper. Transfer to a casserole dish and spread into an even layer. Arrange the biscuits on top of the pie and brush them with melted butter.",
    "Bake until the biscuits are golden and the pot pie is bubbling, 35 minutes. Serve with mashed potatoes and a nice arugula salad or something."
  ],
  "ingredients": [
    "0",
    "for the biscuits:",
    "5 cups all-purpose flour, plus more for dusting",
    "1 tablespoon baking powder",
    "2 1/2 teaspoon kosher salt",
    "1/4 teaspoon baking soda",
    "16 tablespoons unsalted butter, frozen and grated (keep frozen until ready to use), plus more, melted",
    "2 cups buttermilk",
    "for the chicken stock:",
    "1 (3-4 pound) whole chicken",
    "4 medium carrots, peeled and diced",
    "2 ribs celery, chopped",
    "1 head garlic, halved",
    "1 yellow onion, quartered",
    "for the pot pie:",
    "8 tablespoons unsalted butter",
    "8 ounces pearl onions",
    "12 ounces button mushrooms, quartered",
    "3/4 cup all-purpose flour",
    "2 cups whole milk",
    "1 cup fresh or frozen peas, defrosted",
    "kosher salt and freshly ground black pepper, to taste"
  ],
  "__v": 1
}