{
  "hash": "21f8b7974f5cce9134dddff3e226218852b12866",
  "title": "Sausage & courgette rigatoni",
  "image": "http://www.bbcgoodfood.com/sites/bbcgoodfood.com/files/styles/bbcgf_recipe/public/recipe_images/sausage-courgette-rigatoni.jpg?itok=doHE7xUi",
  "href": "http://www.bbcgoodfood.com/recipes/sausage-courgette-rigatoni",
  "extension": "",
  "firstAdded": "2015-09-12T16:26:01.495000",
  "users": [
    null
  ],
  "keywords": [
    "goodquality",
    "pork",
    "sausages",
    "used",
    "cumberland",
    "olive",
    "oil",
    "fennel",
    "bulb",
    "trimmed",
    "green",
    "leafy",
    "fronds",
    "reserved",
    "onion",
    "fat",
    "garlic",
    "rigatoni",
    "zest",
    "juice",
    "lemon",
    "mascarpone",
    "mediumlarge",
    "courgette",
    "pine",
    "nuts",
    "serve",
    "parmesan"
  ],
  "directions": [
    "0",
    "Take the skins off the sausages and break the meat into small chunks. Heat the oil in a non-stick frying pan and fry the sausagemeat until really golden and crispy, breaking up the meat with a wooden spoon as you cook, so the end result is a bit like chunky mince. Scoop out the sausagemeat with a slotted spoon, leaving the sausage oil in the pan, then add the fennel, onion and garlic. Fry gently for about 10 mins until the veg are softened but not coloured. Add a splash of water if it starts to catch.",
    "Bring a large pan of water to the boil, add the pasta and cook following pack instructions until al dente. Drain the pasta, saving a ladleful of the water.",
    "Put the frying pan back on the heat and stir in the lemon zest, juice, mascarpone, courgette and reserved pasta water. Bubble for 2 mins, then stir in the rigatoni with the sausagemeat. Season, scatter over any fennel fronds, some toasted pine nuts (if you like) and a little grated Parmesan. Scoop straight from the pan into pasta bowls."
  ],
  "ingredients": [
    "0",
    "3 good-quality pork sausages (we used Cumberland)",
    "1 tsp olive oil",
    "½ small fennel bulb, trimmed of any green and diced, any leafy fronds reserved",
    "½ onion, diced",
    "2 fat garlic cloves, finely chopped",
    "200g rigatoni",
    "zest and juice 1 lemon",
    "100g mascarpone",
    "1 medium-large courgette, grated",
    "1 tbsp toasted pine nuts (optional), to serve",
    "1 tbsp grated Parmesan, to serve"
  ],
  "__v": 1
}