{
  "hash": "1a62c8384252f904c00beb1c910e85a277cfb1e9",
  "title": "Cafe Mocha",
  "image": "http://1.bp.blogspot.com/-nE35E-9XwWU/USus_kGguHI/AAAAAAAAWBg/BxvGtQyUitY/s640/Homemade-Cafe-Mocha-Recipe-Serenity+Now+blog.jpg",
  "href": "http://www.serenitynowblog.com/2013/02/how-to-make-cafe-mocha-at-home-drink.html",
  "extension": "Chrome",
  "firstAdded": "2015-09-21T11:43:47.421000",
  "users": [
    null
  ],
  "keywords": [
    "hersheys",
    "naturally",
    "cocoa",
    "baking",
    "aisle",
    "sugar",
    "salt",
    "roast",
    "decaf",
    "regular",
    "coffee",
    "really",
    "need",
    "espresso",
    "make",
    "real",
    "cafe",
    "mochaespresso",
    "drink",
    "milk",
    "skim",
    "flavored",
    "syrup"
  ],
  "directions": [
    "0",
    "Combine the cocoa powder, sugar, and salt in your mug and add 2 Tablespoons of hot water. Stir until dissolved...it makes a syrup. Set mug aside.",
    "*",
    "This is not the same as pouring Hershey's chocolate syrup in with your coffee. This recipe is really more of what you'd order at a coffee shop.",
    "2. Measure out your espresso roast. For one serving, I usually fill it to the 2 or 4 line...sometimes less if I want to water down my caffeine intake if I don't have the decaf roast on hand.",
    "3. When your espresso is finished brewing according to the machine instructions, you can pour about half of it into your mug and stir really well. If you don't want to steam your milk, you can add the milk at this point and just microwave to the temperature you want it to be (I've had to do this since my steam application broke).",
    "4. For a small to medium size mug, you'll want to measure out about 1/2 cup of milk. I do 3/4 cup for really big mugs. You can use a measuring cup to froth your milk like I am here, or a frothing mug. I picked a frothing mug up from IKEA for about $I prefer skim milk, but I've been using whole milk because that's what my kids drink. Almond milk and soy milk are also delicious alternatives!",
    "5. Place the cup of milk under the frothing tip, making sure it doesn't touch the bottom of your cup. Slowly turn the steam application on and watch your milk steam!",
    "6. Add your milk and then the rest of the espresso to the mug and stir well. You can also add in a Tablespoon of flavored syrup for an extra punch of flavor. Torani's peppermint or sugar-free raspberry are my faves.",
    "7. Top the whole thing off with some whipped cream and Hershey's chocolate syrup. Caramel can be fun too. It makes such a pretty drink!"
  ],
  "ingredients": [
    "0",
    "-1 Tablespoon Hershey's Naturally Unsweetened Cocoa Powder (on every baking aisle)",
    "-1 Tablespoon Sugar",
    "-Dash of salt",
    "-Espresso Roast (Regular or Decaf) **This is NOT the same as regular coffee! You really do need espresso to make a real cafe mocha/espresso drink!**",
    "- 1/2 cup to 3/4 cup of Milk (skim, 2%, or whole-- it's your call)",
    "- 1 Tablespoon Flavored Syrup (optional)"
  ],
  "__v": 1
}