{
  "hash": "62bbea6cd27daa6f09e08793dd68c6f2864b2ced",
  "title": "Steak and Ale Soup with Mushrooms",
  "image": "http://thecozyapron.com/wp-content/uploads/2017/02/steak-and-ale-soup_thecozyapron_02-02-17_social.jpg",
  "href": "http://thecozyapron.com/steak-and-ale-soup-with-mushrooms/",
  "extension": "Chrome",
  "firstAdded": "2017-02-18T20:46:48.332000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "-Add the cubed steak to a large bowl, sprinkle with a couple of good pinches of salt and black pepper, as well as 2 tablespoons of the flour, and toss to coat.",
    "-Place a large soup pot over medium-high heat, add in the butter and the oil, and once melted together and super hot, add in the steak cubes and brown on all sides, about 3 minutes or so (steak should be rare on the inside, you only want color on the outside); remove from pot and set aside.",
    "-Add into the pot a drizzle more oil if needed, and add in the onions and the mushrooms, along with a pinch or two of salt and pepper, and saute those together for about 10-12 minutes or so, until slightly golden.",
    "-Stir in the garlic, and once aromatic, stir in the Italian seasoning, and add in the cup of ale; allow the ale to simmer vigorously for about 5 minutes or so, until it reduces and thickens slightly.",
    "-Sprinkle in the remaining 2 tablespoons of the flour and whisk to blend, followed by the hot beef stock; stir together and then bring to a simmer over medium heat, allowing the soup to simmer uncovered for about 20-22 minutes so that it slightly reduces.",
    "-Turn off the heat and return the browned steak back into the pot with it’s juices; allow the soup to sit for about 5 minutes or so before serving, just to allow the steak to cook through a bit more in the heat of the soup (you want it to remain tender—medium-rare to medium—and not become overcooked).",
    "-Finish with the parsley and the thyme, ladle into bowls, and enjoy with some crusty bread and a cold ale!"
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "• 2 rib eye steaks (about 1 pound each), trimmed of excess fat and cubed",
    "• Salt",
    "• Black pepper",
    "• 4 tablespoons flour, divided use",
    "• 2 tablespoons butter",
    "• 2 tablespoons avocado (or olive) oil",
    "• 2 small white onions, quartered and sliced",
    "• 16 ounces (1 pound) sliced mushrooms",
    "• 4 cloves garlic, pressed through garlic press",
    "• 1 teaspoon Italian seasoning",
    "• 1 cup ale",
    "• 6 cups beef stock, hot",
    "• 1 tablespoon chopped flat-leaf parsley",
    "• 1 teaspoon fresh thyme leaves"
  ],
  "__v": 1
}