{
  "hash": "466f4d1214621c22a510b094e9371a063b4475f0",
  "title": "French Dip Sandwiches",
  "image": "",
  "href": "https://www.coloradocountrylife.coop/recipe/french-dip-sandwiches/",
  "extension": "",
  "firstAdded": "2019-10-14T21:56:01.847000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Using your hands, rub salt and pepper generously all over the roast. In a labeled gallon-size freezer bag, combine broth, onions, tamari sauce, Worcestershire sauce, mustard, garlic and bay leaves. Add roast and seal, removing as much air as possible.",
    "Make It Now",
    "Marinate beef in refrigerator for a minimum of 1 hour or up to 12 hours. Pour contents of bag into a large slow cooker. Cook on low for 7 hours, until beef is tender. Remove roast, reserving jus left in slow cooker. Discard bay leaves. Transfer roast to a cutting board and, using two forks, shred. Preheat broiler.",
    "Slice buns in half, spray with a little cooking spray or brush with olive oil, and place on a baking sheet lined with aluminum foil. Broil for 1 minute or until golden and toasted. Remove from oven. Place shredded meat on bottom half of bun and add a slice of provolone cheese. Broil for 30 seconds to 1 minute, until cheese is melted. Remove from oven and cover with top half of bun. Skim any fat off top of jus in slow cooker and ladle liquid into small bowls. Serve sandwiches with jus on the side for dipping.",
    "Make It a Freezer Meal",
    "Freeze roast and marinade in bag.",
    "Thaw and Cook",
    "Place bag in refrigerator for at least 24 hours or up to 48 hours to thaw. Transfer contents to a large slow cooker. Cook on low for 7 to 8 hours, until beef is tender. Remove roast, reserving jus left in slow cooker. Discard bay leaves. Transfer roast to a cutting board and, using two forks, shred. Preheat broiler.",
    "Slice buns in half, spray with a little cooking spray or brush with olive oil, and place on a baking sheet lined with aluminum foil. Broil for 1 minute or until golden and toasted. Remove from oven. Place shredded meat on bottom half of bun and add a slice of provolone cheese. Broil for 30 seconds to 1 minute, until cheese is melted. Remove from oven and cover with top half of bun. Skim any fat off top of jus in slow cooker and ladle liquid into small bowls. Serve sandwiches with jus on the side for dipping.",
    "Makes 8 servings.",
    "Text and photo from Seriously Good Freezer Meals by Karrie Truman. Text copyright © 2018 Karrie Truman. Photographs by Charity Burggraaf. Published by Robert Rose, Inc. Reproduced by arrangement with the Publisher. All rights reserved."
  ],
  "ingredients": [
    "0",
    "1 teaspoon salt",
    "1 teaspoon freshly ground black pepper",
    "3 pounds boneless beef shoulder roast, trimmed",
    "4 cups beef broth",
    "1 1/2 onions, puréed or minced",
    "1/2 cup tamari sauce",
    "1/3 cup Worcestershire sauce",
    "2 tablespoons yellow mustard",
    "1 1/2 teaspoons minced garlic",
    "4 bay leaves",
    "To Serve:",
    "8 buns or rolls",
    "Cooking spray or olive oil",
    "8 slices provolone cheese"
  ],
  "__v": 1
}