{
  "hash": "099ba0a8cf08d7f12887cba537cc3ff51f5330d2",
  "title": "Bramborové knedlíky",
  "image": "",
  "href": "http://www.menudomu.cz/bramborove-knedliky/",
  "extension": "Chrome",
  "firstAdded": "2015-12-08T09:18:34.628000",
  "users": [
    null
  ],
  "keywords": [
    "ingredience",
    "pro",
    "osob",
    "cca",
    "koleek",
    "knedlk",
    "den",
    "pedem",
    "uvaench",
    "brambor",
    "vejce",
    "dtsk",
    "krupika",
    "solamyl",
    "hrub",
    "mouka"
  ],
  "directions": [
    "0",
    "Postup přípravy:",
    "U sypkých ingrediencí nepíšu přesnou gramáž, protože hodně záleží na kvalitě brambor a velikosti vejce.",
    "Brambory se nebojte koupit co nejkvalitnější, jako byste dělali druhý den bramborový salát. Den předem je vařit je opravdu základ.",
    "Po uvaření ( všechny podobně velké, středně veliké, vaříme asi 20 minut) je nechte vychladnout a oloupejte.",
    "Takhle je v chladu nechte odpočívat do příštího dne. Pokud knedlíky chcete podávat opravdu čerstvé,",
    "naplánujte si jejich přípravu asi 50 minut před podáváním jídla. Ve velké míse je na jemno nastrouhejte,",
    "uprostřed utvořte důlek a do něj rozklepněte vajíčko (vel. M). Všechno pořádně osolte, brambory toho hodně snesou.",
    "Brambory v míse po obvodu posypejte krupičkou. Řekněme 3-4 hrstmi. Přisypejte i solamyl (polovinu množství krupičky).",
    "Přidejte i tak decku mouky. Píchněte prstem do žloutku a začněte kroužit o do brambor a vmíchávejte tímhle pohybem ingredience do hmoty.",
    "Pak celou rukou. Pak oběma. Hmota se vám začne lepit na ruce, takže to bude chtít přisypat zas 1 dcl mouky.",
    "Takhle budete muset přidávat ještě 2-3x. Vše tvarujte do velké koule. Z mísy těsto vyndejte ve chvíli, kdy už se skoro na prsty nelepí,",
    "hmota je kompaktní a měkká.",
    "Na válu nebo přímo na desce kuchyňské linky začněte z koule tvarovat spíš válec, rukama válejte, rozšiřujte a ztenčujte tvar.",
    "Pokud se vám lepí, na povrch ještě přidejte hrst hrubé mouky. Dlouhý válec o průměru cca 6 cm rozřízněte nožem na dva a dotvarujte průřezy",
    "také do oblého pomoučeného konce.",
    "Na každý knedlík budete potřebovat plátno, do kterého ho zabalíte – fungují staré ubrusy, pánské kapesníky apod.",
    "Oba zabalené knedlíky hned opatrně vložte do velkého hrnce s pořádně vroucí vodou. Ta by neměla přestat vařit ani po jejich vložení.",
    "Vařte minimálně na středním ohni, možná i víc, pod poklicí 23-24 minut.",
    "Po uplynutí doby vidličkou zatáhněte za plátno, rozbalte knedlík ještě ve vodě a klasickým „vyndavákem“ na knedlíky ho vyjměte.",
    "Hned položte na prkýnko a režnou nití rozpulte. Stejně tak s tím druhým. Vše co nejrychleji, aby se vám tam nerozvařoval.",
    "Pak nití tvořte 1,5cm silné plátky a ihned podávejte. To, že jsou knedlíky vařené, poznáte tak, že po proříznutí nebude uprostřed nedovařené kolečko.",
    "Pokud budete dodržovat daný průměr, tak se vám to při 23minutovém vaření nemůže stát."
  ],
  "ingredients": [
    "0",
    "Ingredience pro 6 osob (cca 25 koleček knedlíků):",
    "700 g den předem uvařených brambor",
    "1 vejce",
    "dětská krupička",
    "solamyl",
    "hrubá mouka",
    "sůl"
  ],
  "__v": 1
}