{
  "hash": "abffe279dbd68783966fd5b4ed75dad09ab3b4d0",
  "title": "Chocolate brownie peanut butter cheesecake stuffed french toasts",
  "image": "http://i1.wp.com/cafedelites.com/wp-content/uploads/2015/03/Chocolate-Brownie-Peanut-Butter-Cheesecake-French-Toast-42.jpg?w=205",
  "href": "http://cafedelites.com/2015/03/27/peanut-butter-cheesecake-stuffed-chocolate-brownie-french-toasts/",
  "extension": "Chrome",
  "firstAdded": "2016-07-14T17:40:16.298000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Whisk together the milk, cocoa powder and sugar until dissolved (it's ok if there are still small lumps). Add in the egg and the vanilla, and continue to whisk until everything is combined. Set aside.",
    "Combine all Peanut Butter Cheesecake ingredients together and mix until smooth. Divide the 'cheesecake' mixture between two pieces of bread, and spread them with the mixture. Top with remaining bread slices; dip each 'sandwich' into the chocolate egg wash; turn to evenly coat.",
    "Heat a nonstick pan/griddle over medium heat and lightly grease with cooking oil spray (or a drizzle of oil/butter).",
    "Cover pan with a lid; fry on both sides until a darker brown and firm to the touch on the outside, and cooked through.",
    "Serve with fruit of your choice or dust with icing sugar, drizzle with melted chocolate and sprinkle over crushed nuts."
  ],
  "ingredients": [
    "0",
    "½ cup low fat/skim milk (or almond milk)",
    "2 tablespoons unsweetened cocoa powder (or dutch cocoa powder)",
    "2 tablespoons raw sugar (or any sugar/natural sweetener of choice)",
    "1 large egg",
    "1 teaspoon pure vanilla extract",
    "4 slices of your bread of choice (sweet, white, grain or sourdough)",
    "1",
    "1 tablespoon powdered peanut butter (in dry form) or creamy peanut butter",
    "3 tablespoons 5% (or reduced fat) cream cheese, at room temperature",
    "1 tablespoon maple syrup (or sugar)",
    "2",
    "Icing sugar",
    "¼ cup melted chocolate (milk or dark)",
    "Crushed peanuts (or nuts of choice)"
  ],
  "__v": 1
}