{
  "hash": "db0b7b648082e6d1fd4320f8d1ca4e92d253f1b8",
  "title": "Char Kway Teow Malaysian Rice Noodle Stir-fry",
  "image": "https://thewoksoflife.com/wp-content/uploads/2018/08/char-kway-teow-11.jpg",
  "href": "https://thewoksoflife.com/2018/09/char-kway-teow/",
  "extension": "Chrome",
  "firstAdded": "2018-09-12T22:54:50.035000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "nstructions",
    "Soak the dried noodles in warm water for 30 to 45 minutes. Transfer to a colander and let the excess water drain. If you have fresh rice noodles, cut them into 1½-inch wide strips, and set them aside. You can even try making your own rice noodles at home using Judy’s recipe for Homemade Rice Noodles.",
    "Add 2 teaspoons dark soy sauce, 2 tablespoons regular soy sauce, 1 tablespoon fish sauce, 1 teaspoon shrimp paste, 1 tablespoon oyster sauce, ⅛ teaspoon ground white pepper, and 1 teaspoon sugar in a small bowl. Mix until combined, and set aside.",
    "Heat your wok to medium heat, and spread 1 tablespoon of vegetable oil around the perimeter of your wok. Add the sliced Chinese sausages and stir-fry for 20 seconds.",
    "Add the 2 cloves of sliced garlic, the shrimp, and the fish tofu. Continue stir-frying for another 20 seconds.",
    "Now, turn the wok to high heat. Spread 1 tablespoon shaoxing wine around the perimeter of the wok.",
    "Stir-fry for another 15 seconds. Add the noodles. Gently fold them into the rest of the ingredients. Gather everything in the middle of the wok to let the sides of the wok superheat. Pour the sauce mixture evenly over the noodles, and spread another tablespoon of vegetable oil around the perimeter of the wok.",
    "Next, add the garlic chives. Gently mix the noodles (to minimize breakage) while spreading them around the perimeter of the wok to get that wok hay sear from the superheated sides of the wok. Because of the hot wok and the oil, the rice noodles shouldn’t stick.",
    "While the noodles are searing, work quickly to create a space at the bottom of the wok and add the last tablespoon of oil with the slightly beaten egg. Stir the egg around for 15 seconds to cook it and break it up. You may want to pre-cook the egg the first time if you are more of a beginner cook!",
    "Next add the mung bean sprouts and gently mix everything together for 1 minute.",
    "If your Char Kway Teow looks dry, sprinkle 2 tablespoons of water over the noodles while stir-frying. You can also add a bit more vegetable oil if you like. Serve your Char Kway teow with chlli garlic paste or homemade chili oil on the side."
  ],
  "ingredients": [
    "0",
    "8 ounces (250 grams) dried wide rice noodles or 1 pound fresh rice noodles",
    "2 teaspoons dark soy sauce",
    "2 tablespoons regular soy sauce",
    "1 tablespoon fish sauce",
    "1 teaspoon shrimp paste or shrimp sauce",
    "1 tablespoon oyster sauce",
    "⅛ teaspoon ground white pepper",
    "1 teaspoon sugar",
    "3 tablespoons vegetable oil, divided",
    "2 Chinese sausages (about 115 grams), sliced ⅛ inch thick",
    "2 cloves garlic, sliced",
    "4 ounces (115 grams) shrimp (31 to 40 size)",
    "4 ounces (115 grams) fish cake or fish tofu, thinly sliced",
    "4 ounces (115 grams) garlic chives, cut into 2 ½-inch pieces",
    "1 tablespoon shaoxing wine (optional)",
    "1 egg, lightly beaten",
    "6 ounces (172 grams) mung bean sprouts"
  ],
  "__v": 1
}