{
  "hash": "b0f03c3e4f88374dfecc8d4b57e3ec90f61640bd",
  "title": "{One Pot} Creamy Chicken, Broccoli, and Rice Divan",
  "image": "http://i2.wp.com/www.chelseasmessyapron.com/wp-content/uploads/2014/10/Broccoli-Chicken-Rice-1.jpg?resize=600%2C900",
  "href": "http://www.chelseasmessyapron.com/one-pot-creamy-chicken-broccoli-and-rice-divan/",
  "extension": "Chrome",
  "firstAdded": "2015-03-13T16:12:08.849000",
  "users": [
    null
  ],
  "keywords": [
    "water",
    "chicken",
    "broth",
    "boneless",
    "skinless",
    "breasts",
    "regular",
    "white",
    "rice",
    "broccoli",
    "stems",
    "lemon",
    "juice",
    "mayo",
    "used",
    "light",
    "cream",
    "reducedfat",
    "sour",
    "fat",
    "free",
    "salt",
    "preference",
    "curry",
    "parmesan",
    "cheddar",
    "cheese"
  ],
  "directions": [
    "0",
    "Bring a large pot of 6 cups of water or chicken broth to boil (The broth gives the chicken much more flavor. I used chicken bouillon powder or cubes and water for this broth)",
    "Remove any fat from the chicken breasts and cut them into 2 inch pieces. Place the chicken pieces in the boiling water and cover the pot. Allow to boil for about 10 minutes or until the chicken is all the way cooked through.",
    "Drain water from the chicken and shred it with 2 forks.",
    "1",
    "Add in the white rice and the 3 cups chicken broth to the shredded chicken, Stir everything together and then place the chopped broccoli on top (gives the broccoli a steamed effect)",
    "Bring the mixture to a boil on high heat and then reduce the heat to medium low and cover with a lid.",
    "Everyone's stove is going to cook a little differently so watch yours. If the rice isn't cooking quick enough, maybe increase the heat a little and if the water is evaporating before the rice is cooked, add a little more chicken broth or water. Mine takes right around 10-12 minutes when I make this meal.",
    "2",
    "When all the liquid has been absorbed in the rice and broccoli, turn off the heat. Stir in the lemon juice, mayo, cream of chicken, and sour cream. Add in the seasoned salt or curry powder to your taste preference. If you don't like curry powder don't add it in, if you do add it in and even increase the amount if desired.",
    "If desired add in any other seasonings to taste preference - some onion or garlic powder, poultry seasoning, etc. (I like how it is seasoned without these additions)",
    "Top each bowl with a handful of freshly grated Parmesan cheese. We've also tried this with cheddar cheese and that is great too!"
  ],
  "ingredients": [
    "0",
    "6 cups water or chicken broth",
    "1 and 1/2 pounds boneless skinless chicken breasts",
    "1 cup regular white rice",
    "2 and 1/2 cups broccoli, stems removed, chopped",
    "3 cups chicken broth",
    "1/2 tablespoon lemon juice",
    "1/2 cup mayo, I used light",
    "1 can cream of chicken, I used reduced-fat",
    "1/2 cup sour cream, I used fat free",
    "1/4 teaspoon seasoned salt, or to taste preference",
    "1/2 teaspoon curry powder, optional",
    "Freshly grated Parmesan cheese or Cheddar cheese"
  ],
  "__v": 1
}