{
  "hash": "3b32af53dbd29c5094265405e8a2078d9d6c285f",
  "title": "Tafelspitz (Austrian Boiled Beef) With Apple-Horseradish",
  "image": "",
  "href": "http://cooking.nytimes.com/recipes/10931-tafelspitz-austrian-boiled-beef-with-apple-horseradish",
  "extension": "Chrome",
  "firstAdded": "2015-05-19T01:48:37.030000",
  "users": [
    null
  ],
  "keywords": [
    "onion",
    "horizontally",
    "carrots",
    "scrubbed",
    "parsnip",
    "celery",
    "root",
    "stalks",
    "leek",
    "beef",
    "bones",
    "pieces",
    "triangle",
    "salt",
    "black",
    "peppercorns",
    "bay",
    "leaves",
    "garlic",
    "branches",
    "flatleaf",
    "parsley",
    "dill",
    "sprigs",
    "lovage",
    "horseradish",
    "granny",
    "smith",
    "apple",
    "cored",
    "juice",
    "lemon",
    "chives"
  ],
  "directions": [
    "0",
    "PREPARATION",
    "Char onion on cut side over open flame or by placing cut-side down in cast-iron skillet over high heat. Place in 16-quart stockpot with carrots, parsnip, celery root, celery, leek and beef bones. Add 8 quarts cold water. Bring to boil, and cook 10 minutes, skimming constantly. Add beef, allow to boil 5 minutes and skim.",
    "Reduce heat to simmer, and cook, skimming from time to time, 1 hour. Add 1 tablespoon sea salt, peppercorns, bay leaves and garlic. Tie herbs together, and add. Continue simmering 1 to 1 1/2 hours, until meat is very tender.",
    "While meat is cooking, mix horseradish and apple with lemon juice, and set aside.",
    "Remove meat from pot, and cover with foil. Line large sieve or colander with cheesecloth or linen napkin, and place over very large bowl. Pour in contents of pot. Do not press liquid from vegetables. Transfer strained broth to 6-quart saucepan.",
    "Set carrots, parsnip, celery root and celery stalks aside. Discard everything else. Peel and dice carrots, parsnip and celery root. Dice celery stalks. Set aside.",
    "Gently reheat broth. Add salt to taste. Serve some of the broth as a first course, with diced celery root, parsnip and celery stalks. Then serve meat. If it needs to be reheated, steam briefly over remaining broth. Slice meat 1/2-inch thick across grain. Place in soup plates, with diced carrots, moisten with hot broth, and top with apple-horseradish, sea salt and chives. Serve."
  ],
  "ingredients": [
    "0",
    "1large onion, halved horizontally but not peeled",
    "3large carrots, scrubbed",
    "1large parsnip, scrubbed",
    "1small celery root, scrubbed",
    "2celery stalks",
    "1leek, cut in half",
    "1pound beef bones",
    "2pieces beef triangle, each about 1 1/2 pounds",
    "Sea salt",
    "15black peppercorns",
    "2bay leaves",
    "4cloves garlic, peeled",
    "8branches flat-leaf parsley",
    "4branches fresh dill",
    "2sprigs lovage (optional)",
    "½cup freshly grated horseradish",
    "1Granny Smith apple, peeled, cored and grated",
    "Juice of one lemon",
    "¼cup minced chives"
  ],
  "__v": 1
}