{
  "hash": "f8a306e5ea7f05367d9fd647854b5d73719f8e62",
  "title": "HIBISCUS TEA",
  "image": "https://www.lifeslittlesweets.com/wp-content/uploads/2018/06/Hibiscus-Tea-Recipe-www.lifeslittlesweets.com-680x1020-horizontal-680x453.jpg",
  "href": "https://www.lifeslittlesweets.com/hibiscus-tea/",
  "extension": "Chrome",
  "firstAdded": "2020-01-08T14:11:25.160000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Bring 8 cups of water to a boil (about 5 minutes).",
    "Add 1/2 cup dried hibiscus flowers to a tea diffuser.",
    "When water is boiling, add the prepared tea diffuser to the hot water.",
    "Remove from heat onto a trivet to allow to steep for 15-20 minutes.",
    "Remove diffuser after 15-20 minutes. At this point, if you wish to enjoy the tea hot, you can. You can also mix in your desired sweetener (sugar or honey) at this point and stir to combine.",
    "After the tea is cooled to room temperature, transfer it to a large pitcher or beverage serving dispenser. Refrigerate for 1-2 hours until cold or overnight.",
    "Before serving, add ice (optional) and sliced lime (optional) in the pitcher/beverage dispenser and for garnishing. Enjoy!",
    "NUTRITION INFORMATION:YIELD: 8 SERVING SIZE: 1",
    "Amount Per Serving:CALORIES: 88\tTOTAL FAT: 0g\tSATURATED FAT: 0g TRANS FAT: 0g\tUNSATURATED FAT: 0g\tCHOLESTEROL: 0mg\tSODIUM: 11mg CARBOHYDRATES: 23g\tNET CARBOHYDRATES: 0g\tFIBER: 0g\tSUGAR: 22g SUGAR ALCOHOLS: 0g\tPROTEIN: 0g",
    "Please note that the Calculated Nutrition is an estimate at best.",
    "© Sara Maniez",
    "CUISINE: American\t/ CATEGORY: drinks",
    "Check out our Recipe index and DIY index",
    "AuthorRecent Posts",
    "Follow me",
    "Sara Maniez",
    "Owner at Life's Little Sweets",
    "Sara is an architectural designer turned work-at-home Mom.She lives in New Jersey by way of New England and New York, with her husband, two kids under 5 and family dog Cayli. She loves design, being creative and spending time with family and friends. She loves checking out local businesses and eats and being apart of the local farm to table community.",
    "SHARING IS CARING!:",
    "FacebookPinterestTwitterTumblrLinkedInMore",
    "SHARES",
    "Share2",
    "Tweet",
    "Pin287",
    "LinkedIn",
    "Yummly11",
    "FILED UNDER: ANY SEASON, APRIL, AUGUST, BRUNCH RECIPES, COLD DRINKS, DRINKS, ENTERTAINING, FALL, FOOD, GLUTEN-FREE, JULY, JUNE, MARCH, MAY, PALEO, RECIPES BY MONTH, RECIPES BY SEASON, SPRING, SUMMER, VEGAN, VEGETARIAN, WINTER",
    "MONTHLY EMAIL NEWSLETTER",
    "READER INTERACTIONS",
    "LEAVE A REPLY",
    "Your email address will not be published. Required fields are marked *",
    "Comment",
    "Name *",
    "Email *",
    "Website",
    "Notify me of follow-up comments by email.",
    "Notify me of new posts by email.",
    "This site uses Akismet to reduce spam. Learn how your comment data is processed.",
    "PRIMARY SIDEBAR",
    "MEET SARA, AUTHOR OF LIFE’S LITTLE SWEETS",
    "Sara is an architectural designer turned work-at-home Mom.She lives in New Jersey by way of New England and New York, with her husband, two kids under 5 and family dog Cayli. She loves design, being creative and spending time with family and friends. She loves checking out local businesses and eats and being apart of the local farm to table community. Continue Reading",
    "MONTHLY EMAIL NEWSLETTER & FREE EBOOK!",
    "OUR FOOD + LIFESTYLE MANTRA"
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1/2 cup dried hibiscus flowers",
    "8 cups water",
    "1/2 cup granulated or turbinado sugar, or 1/4 cups honey",
    "2 limes, sliced, for garnishing or to add to the serving container"
  ],
  "__v": 1
}