{
  "__v": 1,
  "directions": [
    "0",
    "Preheat the oven to 200°C / 400°F and line a baking tray with baking paper. Coarsely chop the cauliflower, place in food processor and blend until it is a fine rice-like texture. Measure 600 ml (3 cups / 20 fl oz) of the cauliflower ‘rice’ and place in a mixing bowl. Add the ground almonds, oregano and seasoning and mix with your hands. Make a well in the centre and add the eggs. Use your hands to pull the dry ingredients towards the middle until everything is combined and you can shape it into a ball. It should be more loose and sticky than a traditional pizza dough. Transfer to the baking paper and form into a pizza base by flattening the dough with your hands. Make the edges slightly higher. Pre-bake for 25 minutes or until golden. Meanwhile, prepare the pizza topping. Remove the crust from the oven. Cover it with tomato sauce, shaved zucchini and spinach and put it back in the oven for 5-10 more minutes. Take it out the oven and top with Basil & Lemon sauce, shaved pecorino, fresh herbs and green leaves. Serve."
  ],
  "firstAdded": "2014-08-07T18:47:18.586000",
  "hash": "dabbfd4dcd6dd4bc18edf9f232cee6c63b35c133",
  "href": "http://www.greenkitchenstories.com/green-pizza-with-a-cauliflower-base/",
  "image": "http://www.greenkitchenstories.com/wp-content/uploads/2013/09/Cauliflower_pizza_4.jpg",
  "ingredients": [
    "0",
    "Pizza base",
    "florets from 1 cauliflower",
    "80 g / 3 oz / 3/4 cup ground almonds (almond flour)",
    "1 tbsp dried oregano",
    "sea salt and freshly ground black pepper",
    "3 organic eggs, beaten (or see tip for a vegan alternative)",
    "Topping",
    "1 zucchini, shaved with a potato peeler",
    "2 handfuls fresh spinach or leafy greens of your choice",
    "pecorino cheese, shaved with a potato peeler"
  ],
  "keywords": [
    "pizza",
    "base",
    "florets",
    "cauliflower",
    "almonds",
    "almond",
    "flour",
    "oregano",
    "salt",
    "black",
    "pepper",
    "organic",
    "eggs",
    "tip",
    "vegan",
    "alternative",
    "zucchini",
    "shaved",
    "potato",
    "peeler",
    "spinach",
    "leafy",
    "greens",
    "pecorino",
    "cheese"
  ],
  "title": "Green Pizza with a Cauliflower Base",
  "users": [
    null
  ]
}