{
  "hash": "7ef6ed829f4b74cef37e5196cab5ca4c82ced6d2",
  "title": "Pan de Muerto",
  "image": "http://2.bp.blogspot.com/-p1j-43gO8zY/VEa8z1xzGcI/AAAAAAAAnIw/y9c3xRiEegI/s1600/Pan%2Bde%2Bmuerto.JPG",
  "href": "http://www.gustausted.com/2012/10/mi-delicioso-pan-de-muerto-receta-como.html",
  "extension": "Chrome",
  "firstAdded": "2015-11-10T03:28:47.727000",
  "users": [
    null
  ],
  "keywords": [
    "tazas",
    "pie",
    "levadura",
    "fermentado",
    "sourdough",
    "starter",
    "harina",
    "trigo",
    "cucharadas",
    "azcar",
    "granulada",
    "mantequilla",
    "vegetal",
    "margarina",
    "manteca",
    "cerdo",
    "huevos",
    "enteros",
    "chicos",
    "yemas",
    "huevo",
    "cafeteras",
    "ans",
    "entero",
    "hervidos",
    "agua",
    "ralladura",
    "naranjas",
    "cucharadita",
    "sal"
  ],
  "directions": [
    "0",
    "Preparación:",
    "Saca del refrigerador una taza del pie de levadura (sourdough starter) y combina con 1 taza de harina todo uso y 1 taza de agua calientita; mezcla bien con la cuchara de palo. No te preocupes por los grumos en la mezcla, la fermentación los disolverá en pocas horas. Cubre con una toalla o papel film y déjalo en un lugar tibio varias horas o toda la noche. (Lo dejé toda la mañana) Regresa media taza al pie de levadura del refrigerador para reponerlo antes de comenzar a hacer el pan. (Quedaron exactamente 2 tazas, después de regresar la media taza).",
    "Coloca en el tazón de la batidora las 2 tazas de sourdough starter (pie de levadura fermentado) que haz sacado del refrigerador en la mañana o desde la noche anterior, que ha levado.",
    "Pon ha hervir las semillas de anís con el agua para hacer el té. Cuela y Reserva.",
    "Pon a funcionar la batidora en velocidad baja #2-3 y añade 15 cucharadas de azúcar, la sal, 2 huevos, las 6 yemas, 5 cucharadas de té de anís, la raspadura de naranja, la harina poco a poco para que se vaya integrando. Cuando se vea todo incorporado, añade los 100 g de manteca y la mantequilla suave, poco a poco. Sigue batiendo raspando y tomando harina de los lados del tazón de vez en cuando y llevándola al centro. Cuando haz incorporado perfectamente todos los ingredientes aproximadamente 20 minutos, o lo que tarde) Debes obtener una masa tersa, elástica y pegajosa. Si observas que está muy aguada, vas a agregar harina por cucharadas hasta que se vea cohesiva y se limpien los lados del tazón, pero no agregues mucha porque quedará duro el pan. Viértela sobre la mesa enharinada y amásala con las manos enharinadas.",
    "Forma una bola, úntala con aceite o manteca vegetal y colócala dentro de un tazón, cubriendo con un trapo limpio y húmedo. Déjala en un lugar tibio hasta que doble su volumen, aproximadamente de 2 a 4 horas (Depende del clima). O en este punto, guárdala en el refrigerador hasta que vayas a hacer el pan. Que fue lo que yo hice.",
    "Transcurrido este tiempo, vuelve a amasar ligeramente, forma un rollo largo, tómalo por los extremos y azota la masa en la mesa varias veces para desarrollar el gluten. Forma una bola alargada y colócala sobre la charola engrasada con manteca vegetal. Aparta 2-3 tazas de masa, aproximadamente, para formar los huesitos y la bolita de arriba. A esta masa agrégale un poco más de harina y amasa hasta incorporarla, quedará un poco más firme que el bollo.",
    "Los huesitos se forman alargando una bolita de la misma masa con los dedos, como cuando jugabas con plastilina, a modo de formar un rollito sobre la mesa enharinada y con las manos enharinadas. Cuando se ha hecho el rollito se abren los dedos y se sigue con el mismo movimiento de manos, presionando el rollito con los dedos abiertos para que se formen las bolitas. Es recomendable hacer por lo menos 2 huesitos por pan. Los huesitos y las bolitas de en medio también se dejan levar. Las cuencas de los ojitos se las marqué con un popote."
  ],
  "ingredients": [
    "0",
    "2 tazas de Pie de levadura fermentado (Sourdough starter)",
    "3 ½ tazas de harina de trigo (500 g)",
    "16 cucharadas de azúcar granulada",
    "125 g de mantequilla",
    "100 g de manteca vegetal margarina o manteca de cerdo",
    "3 Huevos enteros chicos",
    "6 yemas de huevo chicos",
    "3 cucharadas cafeteras de anís entero hervidos en 150 ml de agua",
    "Ralladura de 2 naranjas",
    "½ cucharadita de sal"
  ],
  "__v": 1
}