{
  "hash": "7ffb60e391e5e14477b039264b1b3d69cb54fb94",
  "title": "One Pot Creamy Sun Dried Tomato Pasta",
  "image": "http://www.budgetbytes.com/wp-content/uploads/2015/11/One-Pot-Creamy-Sun-Dried-Tomato-Pasta-close-above.jpg",
  "href": "https://www.budgetbytes.com/2015/11/one-pot-creamy-sun-dried-tomato-pasta/",
  "extension": "Firefox",
  "firstAdded": "2016-12-27T09:44:03.789000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cut the sun dried tomatoes into small pieces and set aside. Mince the garlic and sauté it with butter in a deep skillet over medium heat for 1-2 minutes, or just until it's soft and fragrant (don't let it brown).",
    "Add the chicken broth, milk, fettuccine (I like to break it in half first), sun dried tomato pieces, and a healthy dose of freshly cracked pepper (15-20 cranks of a pepper mill) to the skillet. Make sure the pasta is submerged below the liquid.",
    "Place a lid on the pasta and allow the liquid in the skillet to come to a boil. Once it reaches a boil, give it a quick stir to make sure the pasta is not stuck to the bottom. Return the lid to the top, turn the heat down to low (or just above low), and let it simmer for about 10-12 minutes, or until the pasta is tender. Stir briefly every 4-5 minutes as it simmers to keep the pasta from sticking to the bottom of the skillet.",
    "If the pasta is still very soupy at that point, remove the lid and let it simmer for 3-5 minutes more, or until the sauce has reduced and thickened slightly. Once thickened, sprinkle the Parmesan over top and serve. The sauce will continue to thicken after the pasta is removed from the heat."
  ],
  "ingredients": [
    "0",
    "2 Tbsp butter $0.26",
    "2 cloves garlic $0.16",
    "2 cups chicken broth* $0.25",
    "1.5 cups whole milk $0.47",
    "8oz. fettuccine $0.50",
    "12 pieces sun dried tomatoes $0.82",
    "Freshly cracked pepper $0.05",
    "¼ cup grated Parmesan $0.35"
  ],
  "__v": 1
}