{
  "hash": "f1d1bad3779b5098b884fb49418e08b5bd1ad8c3",
  "title": "Lacto-Fermented Eggplant",
  "image": "",
  "href": "http://www.culturesforhealth.com/lacto-fermented-eggplant-recipe",
  "extension": "",
  "firstAdded": "2015-09-21T22:45:16.077000",
  "users": [
    null
  ],
  "keywords": [
    "medium",
    "eggplants",
    "garlic",
    "smashed",
    "oregano",
    "basil",
    "red",
    "pepper",
    "salt",
    "salting",
    "eggplant",
    "water"
  ],
  "directions": [
    "0",
    "nstructions:",
    "Cut eggplant into slices and then strips. Place these in a colander set over a plate and sprinkle generously with salt. Gently massage the salt into the eggplant. Let sit, covered with a towel, for 1 to 2 hours to allow the bitter liquid to drain out.",
    "Meanwhile, prepare brine by heating water, adding salt, and stirring to dissolve. Cool to room temperature.",
    "After 1 to 2 hours have passed rinse the salted eggplant under water to remove some of the salt. Place garlic, red pepper flakes, and herbs in a quart jar. Add eggplant strips, squishing them in as you go. Cover all with brine, leaving 1½ inches of headspace.",
    "Cover jar with lid and set in an undisturbed room temperature space for 3 to 7 days to ferment. During this time, “burp” the jar every day to release gases. To do this, simply loosen the lid until gases are released, then immediately tighten lid.",
    "Once the eggplant is fully fermented, move to cold storage.",
    "Ready for More Delcious Cultured Vegetable Recipes?",
    "Fermented Okra Pickles",
    "Fermented Salsa",
    "Simple Grated Zucchini Kraut",
    "Related Articles",
    "Fermented Vegetable Expert Advice Articles and Recipes",
    "How to Ferment Vegetables: The Basic Culturing Process",
    "Ferment Your Garden: Summer Recipes",
    "Related Products"
  ],
  "ingredients": [
    "0",
    "2 medium eggplants",
    "6 garlic cloves, smashed and peeled",
    "2 teaspoons chopped fresh oregano",
    "2 tablespoons chopped fresh basil",
    "1 teaspoon red pepper flakes",
    "2 tablespoons sea salt, plus more for salting eggplant",
    "1 quart water"
  ],
  "__v": 1
}