{
  "hash": "c9911dfb0033e65a08959f1a6220ba38b9926772",
  "title": "Reese's Cheesecake Brownies",
  "image": "http://therecipecritic.com/wp-content/uploads/2014/12/reeses_cheesecake_brownies-650x975.jpg",
  "href": "http://therecipecritic.com/2014/12/reeses-cheesecake-brownies/",
  "firstAdded": "2015-02-21T03:19:21.971000",
  "users": [
    null
  ],
  "keywords": [
    "brownie",
    "layer",
    "butter",
    "dark",
    "chocolate",
    "sugar",
    "brown",
    "vanilla",
    "eggs",
    "allpurpose",
    "flour",
    "mini",
    "reeses",
    "peanut",
    "divided",
    "fourths",
    "cheesecake",
    "block",
    "cream",
    "cheese",
    "softened",
    "egg",
    "salt",
    "creamy",
    "milk",
    "chips"
  ],
  "directions": [
    "0",
    "Preheat your oven to 350 degrees. Line a 9x13 inch pan with aluminum foil for easy removal of the bars. Spray with cooking spray and set aside. Chop your reese's peanut butter cups into fourths and divide them in half.",
    "In a microwave safe bowl or using a double broiler, melt the ¾ cup of butter and chopped dark chocolate. Stirring ever 30 seconds being careful not to let the chocolate burn.",
    "Whisk sugar and brown sugar to the melted chocolate mixture. Then add the vanilla and eggs until it it is fully incorporated. Stir the flour until incorporated. Fold in half of the chopped Reese's Peanut butter cups. Pour this mixture into your prepared 9x13 inch pan.",
    "To make the cheesecake layer, in a stand mixer using the paddle attachment, cream together the cream cheese and softened butter about 2 minutes until fluffy. Mix in the egg, sugar, salt, and vanilla on high for another 2 minutes. Mix in the peanut butter for 2 minutes.",
    "Pour the cream cheese layer over the brownie layer and spread it out so that it is smooth on the top and completely covers the brownie layer. Bake for 35-40 minutes. The top and edges should be slightly golden and the center is set.",
    "Let the bars completely cool and refrigerate for at least an hour before the chocolate layer on top. To make the chocolate layer, in a microwave safe bowl, add the chocolate chips. Melt 30 seconds at a time until melted and smooth. Pour over the top of the peanut butter cheesecake layer and spread evenly. Sprinkle the rest of the chopped Reese's Peanut Butter Cups on top. Pop in the fridge until the chocolate is set. Cut into squares and serve."
  ],
  "ingredients": [
    "0",
    "Brownie layer:",
    "¾ cup butter",
    "6 oz dark chocolate, chopped",
    "1½ cups sugar",
    "½ cup brown sugar, packed",
    "1½ tsp vanilla",
    "3 large eggs",
    "1 cup all-purpose flour",
    "1 (12 oz) bag mini reese's peanut butter cups, divided and chopped into fourths",
    "For the peanut butter cheesecake layer:",
    "8 oz block cream cheese, softened",
    "¼ cup butter, softened",
    "1 egg",
    "½ cup sugar",
    "½ tsp salt",
    "½ tsp vanilla extract",
    "1 cup creamy peanut butter",
    "For the chocolate layer on top:",
    "1 (12 oz) bag milk chocolate chips"
  ],
  "__v": 1
}