{
  "__v": 4,
  "directions": [
    "0",
    "Double-boiler (I just make my own with a glass bowl over a pot of shallow simmering water)",
    "Kitchen scale",
    "Whisk",
    "Container for finished product",
    "Using your scale and the tare function, measure and combine the first five ingredients into the glass bowl into your double-boiler.",
    "DO NOT add the zinc oxide, cocoa powder, or cinnamon!",
    "Completely melt the first five ingredients, stirring occasionally with your whisk.",
    "Remove from heat and allow time to cool a bit (a few minutes…and wipe excess moisture off the outside of your bowl, too).",
    "Place your bowl back on the scale, hit tare, and add in spoonfuls of zinc oxide until you get to .5oz. This gives you approximately a 20 SPF coverage (as it’s approximately 10% of the total weight…read more about sunscreen here). Whisk to completely combine.",
    "Add 1/8t cinnamon; whisk to combine.",
    "Add cocoa powder a little at a time and whisk to get to the color you need…",
    "1/2T cocoa powder is a light foundation",
    "1/2T plus 1t is a medium foundation",
    "1/2T plus 2t is a medium-dark foundation",
    "Simply start with 1/2T of cocoa powder, whisk to combine, check on your wrist for a color match, and add more cocoa powder (1/2t at a time) until you reach your perfect color",
    "Pour into your selected container and allow to cool.",
    "FYI… T=Tablespoon and t=Teaspoon"
  ],
  "firstAdded": "2014-07-28T23:00:10.812000",
  "hash": "07ee26bea7339b77b9a496d4f2c915894c2be21c",
  "href": "http://www.scratchmommy.com/smooth-finish-diy-organic-foundation-sunscreen/",
  "image": "http://www.scratchmommy.com/wp-content/uploads/2014/02/Smooth-Finish-DIY-Organic-Foundation-With-Sunscreen-Scratch-Mommy.jpg-1024x682.jpg?6b2415",
  "ingredients": [
    "0",
    "1.5oz Almond Oil (or unrefined, raw, organic carrier oil of your choice)",
    "1oz Shea Butter",
    ".5oz Cocoa Butter",
    ".5oz Beeswax",
    "1/8t Vitamin E",
    ".5oz Zinc Oxide",
    "Cocoa Powder",
    "Cinnamon"
  ],
  "keywords": [
    "almond",
    "unrefined",
    "raw",
    "organic",
    "carrier",
    "oil",
    "shea",
    "butter",
    "cocoa",
    "beeswax",
    "vitamin",
    "zinc",
    "oxide",
    "cinnamon"
  ],
  "title": "Smooth Finish DIY Organic Foundation With Sunscreen",
  "users": [
    null
  ]
}