{
  "hash": "1e1b3dac5072dfb4513f6ca513f12ec4d7a1b792",
  "title": "Peach Upside-Down Cake",
  "image": "https://static01.nyt.com/images/2017/05/23/dining/23COOKING-PEACH-UPSIDEDOWN-CAKE2/23COOKING-PEACH-UPSIDEDOWN-CAKE2-articleLarge.jpg",
  "href": "https://cooking.nytimes.com/recipes/6355-peach-upside-down-cake?smid=pi-nytfood&smtyp=cur",
  "extension": "",
  "firstAdded": "2019-07-02T14:57:43.391000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "PREPARATION",
    "Heat oven to 350 degrees. Butter a 9-inch cake or pie pan. Line the bottom of the pan with a round of parchment paper and butter that as well.",
    "Pit the peaches and cut into slices about 1/2-inch thick. Arrange the slices in a pattern on the bottom of the pie pan.",
    "Combine 1/2 cup/100 grams of the sugar with 1/4 cup/60 milliliters of water in a saucepan or skillet. Cook over medium-high heat until the mixture turns amber, about 10 to 12 minutes. Remove from heat immediately and pour this caramel evenly over the peaches in the pie pan.",
    "In a medium bowl, sift together the flour, baking powder and nutmeg, and set aside.",
    "In another medium bowl, beat together the butter and remaining 3/4 cup/150 grams sugar until light. Beat in the eggs 1 at a time. Stir in the flour mixture. Spread the batter evenly over the peaches and caramel.",
    "Bake for 30 to 35 minutes, until top is golden brown and cake is set. Remove from the oven and set on a cooling rack. Run a knife around the sides, place a platter on top and invert the cake onto the platter. If any of the peach slices stick to the pan, lift them off carefully and replace them on top of the cake. Serve the cake warm or cooled to room temperature, with crème fraîche on the side.",
    "Tip",
    "Your caramel might harden by the time you spread the batter on top of the peaches. Don't worry. It'll melt by the time it comes out of the oven."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "¼ pound/114 grams unsalted butter, softened, plus more for greasing the pan",
    "3 large, ripe peaches",
    "1 ¼ cup/250 grams sugar",
    "1 cup/128 grams flour",
    "¾ teaspoon baking powder",
    "¼ teaspoon ground nutmeg",
    "3 eggs",
    "¾ cup crème fraîche"
  ],
  "__v": 1
}