{
  "hash": "6466ca0cb2dce325fcec390b84700f3ba69e29a5",
  "title": "Gluten-Free Honey Almond Cake with Raspberries, Orange and Pistachios",
  "image": "http://cookieandkate.com/images/2014/06/gluten-free-honey-almond-cake-with-raspberry-and-orange-270x372.jpg",
  "href": "http://cookieandkate.com/easyrecipe-print/11864-0/",
  "firstAdded": "2015-01-07T11:17:28.376000",
  "users": [
    null
  ],
  "keywords": [
    "flour",
    "almond",
    "meal",
    "firmly",
    "measuring",
    "baking",
    "soda",
    "cardamom",
    "ginger",
    "finegrain",
    "salt",
    "eggs",
    "honey",
    "divided",
    "extravirgin",
    "olive",
    "oil",
    "orange",
    "preferably",
    "organic",
    "raspberries",
    "sprinkle",
    "sugar",
    "raw",
    "pistachios"
  ],
  "directions": [
    "0",
    "Preheat the oven to 325 degrees Fahrenheit. Grease a 9-inch pan (I used a springform pan) with butter and dust with almond flour/meal.",
    "In a large mixing bowl, whisk together the almond meal, baking powder, baking soda, cardamom, ginger and sea salt.",
    "In another bowl, combine the beaten eggs, honey, olive oil and the zest of your orange. Use a whisk to mix well. Pour the wet ingredients into the dry. Stir just until there are a few clumps remaining, then gently fold in the raspberries.",
    "Bake for 45 to 50 minutes, until the cake is deeply golden brown and the center is firm to the touch. A toothpick inserted in the center should come out clean. Place the cake on a wire rack to cool to room temperature.",
    "Once the cake is out of the oven, slice your orange in half and squeeze out ¼ cup juice. Combine the juice with 1 teaspoon honey in a small saucepan. Warm over medium heat, while stirring, just until the honey is blended into the juice. Brush the orange-honey glaze over the warm cake. It should soak right in.",
    "Once the cake is cool, use a sharp knife to slice into 8 pieces. Transfer each piece to a plate, sprinkle with powdered sugar (optional) and finish with a sprinkle of chopped pistachios."
  ],
  "ingredients": [
    "0",
    "2 cups (8 ounces) almond flour or almond meal, firmly packed into measuring cups",
    "1 teaspoon baking powder",
    "½ teaspoon baking soda",
    "½ teaspoon ground cardamom",
    "½ teaspoon ground ginger",
    "½ teaspoon fine-grain sea salt",
    "3 eggs, beaten",
    "⅔ cup + 1 teaspoon honey, divided",
    "¼ cup extra-virgin olive oil",
    "One orange, preferably organic",
    "6 ounces raspberries, preferably organic",
    "1",
    "Sprinkle of powdered sugar (optional)",
    "½ cup chopped raw pistachios"
  ],
  "__v": 1
}