{
  "hash": "e1e9350767e520436fede6b7388a99665edbc27e",
  "title": "Golden Semolina Quinoa Spinach Cakes",
  "image": "http://www.foodandwine.com/assets/images/201204-r-golden-semolina-quinoa-spinach-cakes.jpg/variations/original.jpg",
  "href": "http://www.foodandwine.com/recipes/golden-semolina-quinoa-spinach-cakes",
  "firstAdded": "2015-01-17T08:42:55.357000",
  "users": [
    null
  ],
  "keywords": [
    "quinoa",
    "extravirgin",
    "olive",
    "oil",
    "shallot",
    "baby",
    "spinach",
    "salt",
    "pepper",
    "lowfat",
    "milk",
    "semolina",
    "parmigianoreggiano",
    "cheese",
    "egg",
    "panko",
    "japanese",
    "bread",
    "crumbs",
    "whites"
  ],
  "directions": [
    "0",
    "In a small saucepan, combine the quinoa with 1 cup of water and bring to a boil. Cover and cook over low heat until the water has been absorbed, about 15 minutes. Lightly fluff the quinoa with a fork and cover it again.",
    "Meanwhile, in a large skillet, heat 1 tablespoon of the olive oil. Add the shallot and cook over moderate heat, stirring, until softened, about 1 minute. Add the spinach and cook until most of the liquid has evaporated, about 5 minutes. Season with salt and pepper. Transfer the spinach to a strainer and let cool slightly; press out any remaining liquid and finely chop the spinach.",
    "In a large saucepan, combine the milk, 1 1/2 cups of water, 1 tablespoon of the olive oil and 2 teaspoons of salt and bring to a boil. Remove the pan from the heat and gradually whisk in the semolina until very smooth. Cook over moderate heat, stirring constantly with a wooden spoon, until the semolina is thick enough to hold soft peaks when the spoon is lifted, about 7 minutes. Remove the semolina from the heat and stir in the quinoa and Parmigiano. Season with salt and pepper and let cool for 15 minutes.",
    "Stir the beaten whole egg and spinach into the quinoa mixture and spread in an ungreased 7-by-11-inch pan; it will be about 2 inches thick. Let cool at room temperature, then cover loosely with plastic wrap and refrigerate for at least 4 hours or overnight.",
    "Preheat the oven to 250°. Cut the chilled semolina mixture into 12 squares. Put the panko in a shallow dish and season with 1 teaspoon of salt. In another shallow dish, whisk the egg whites with 1/2 teaspoon of salt and 1 tablespoon of water. Dip the cakes into the whites and turn to coat, letting the excess drip off. Coat the cakes in the panko and shake off excess crumbs. Transfer to a clean baking sheet.",
    "In a large skillet, heat 2 tablespoons of the olive oil. Add half of the cakes and cook over moderately high heat until golden on both sides and on the edges, about 6 minutes; adjust the heat as necessary to prevent the cakes from burning. Drain the cakes on a paper towel–lined plate, then transfer to a baking sheet and keep warm in the oven. Wipe out the skillet and cook the remaining cakes in the remaining 2 tablespoons of olive oil. Serve hot."
  ],
  "ingredients": [
    "0",
    "1/2 cup quinoa",
    "1/4 cup plus 2 tablespoons extra-virgin olive oil",
    "1 tablespoon minced shallot",
    "10 ounces baby spinach",
    "Salt",
    "Freshly ground pepper",
    "1 cup low-fat milk",
    "3/4 cup finely ground semolina",
    "1/4 cup freshly grated Parmigiano-Reggiano cheese",
    "1 large egg, beaten",
    "1 1/2 cups panko (Japanese bread crumbs)",
    "3 large egg whites"
  ],
  "__v": 1
}