{
  "hash": "2c579a558d9373395f624178c11a85d5dda1063b",
  "title": "Halva Cream Frosting (Vegan)Chiffon Cake (gluten free, dairy free)",
  "image": "http://i0.wp.com/willfrolicforfood.com/wp-content/uploads/2015/06/gluten-free-chiffon-cake-angel-food-cake-blueberry-halva-tahini-frosting-4618.jpg?resize=682%2C1024",
  "href": "http://willfrolicforfood.com/2015/06/mini-naked-chiffon-cake-with-halva-cream-frosting-blueberries-gluten-free-dairy-free.html",
  "extension": "",
  "firstAdded": "2015-11-11T16:38:03.826000",
  "users": [
    null
  ],
  "keywords": [
    "cream",
    "skimmed",
    "refrigerated",
    "fat",
    "coconut",
    "milk",
    "maple",
    "syrup",
    "honey",
    "mild",
    "tahini",
    "oil",
    "vanilla",
    "white",
    "mochiko",
    "rice",
    "flour",
    "arrowroot",
    "almond",
    "meal",
    "sorghum",
    "evaporated",
    "cane",
    "sugar",
    "psyllium",
    "husk",
    "work",
    "baking",
    "salt",
    "unsweet",
    "nut",
    "works",
    "eggs",
    "yolks",
    "whites",
    "carefully",
    "separated",
    "tartar",
    "halva",
    "frosting",
    "blueberries",
    "peach",
    "slices",
    "sesame",
    "seeds"
  ],
  "directions": [
    "0",
    "Combine all ingredients in a blender until creamy.",
    "Refrigerate the liquid frosting for a minimum of 3 hours.",
    "Spoon the frosting into a piping bag, and pipe designs onto your cakes OR spread with a spatula as you would any frosting.",
    "1",
    "Preheat the oven to 325F. Line the bottom of a 9\" cake pan with a circle of parchment paper (you can use a spring form pan to make removing the cake really easy, but it's not necessary). Set the pan aside.",
    "In a medium mixing bowl, whisk together the sweet rice flour, arrowroot, almond meal, sorghum, 1 cup sugar, psyllium, baking powder, and sea salt until everything this well combined.",
    "In a separate medium bowl, combine the coconut oil, almond milk, vanilla extract, and the egg yolks and whisk together until you have a creamy, pale golden mixture.",
    "Add the wet mix to the dry mix and combine until your batter is totally saturated and even. Set aside.",
    "In a large, clean metal bowl combine the egg whites and the cream of tarter.",
    "Using an electric beater, beat the egg whites on high for 3-5 minutes, until you have soft peaks.",
    "While the beater is running, slowly shake in the remaining 2 tablespoons of sugar.",
    "Continue to beat until your have firm peaks, being careful not to over mix.",
    "Fold in about ⅛ of the fluffy egg whites at a time into the batter, working slowly. Continue until all of the egg whites are folded into the batter -- don't over mix. You still want to see streaks of the egg whites in the batter.",
    "Gently pour the batter into your parchment lined cake pan.",
    "Bake 35 minutes, turning the cake half-way through, until the top of the cake is golden brown and set.",
    "Remove the cake from the oven and cool to room temperature. To remove the cake from the pan, run a knife around the edges of the cake. If using a standard cake pan, flip the cake upside down onto a parchment lined plate, then flip the cake right side up and place on a platter. If using a springform, release the form and gently slide the cake out from the bottom of the pan (you can use a pie server to help, but I was able to grab onto an edge of the parchment and pull it out from the base). Place on a platter, frost, top with berries and sesame seeds, and serve!",
    "2",
    "Cut 3-4 rounds out of the cake using a biscuit cutter and stack, layering with halva frosting and berries/peach slices. Garnish with sesame seeds on top. Voila!"
  ],
  "ingredients": [
    "0",
    "1 cup coconut cream (skimmed from the top of a refrigerated can of full fat coconut milk)",
    "¼ cup maple syrup or honey",
    "¼ cup mild tahini",
    "2 tablespoons coconut oil",
    "1 teaspoon vanilla extract",
    "1",
    "½ cup sweet white mochiko rice flour",
    "½ cup + 1 tablespoon arrowroot flour",
    "½ cup almond meal",
    "½ cup sorghum flour",
    "1 cup + 2 tablespoons evaporated cane sugar",
    "1.5 tablespoons psyllium husk (whole or powdered both work)",
    "½ teaspoon baking powder",
    "½ teaspoon fine sea salt",
    "4.5 tablespoons coconut oil, melted",
    "½ cup almond milk (any unsweet nut milk works)",
    "1.5 teaspoons pure vanilla extract",
    "5 eggs (yolks and whites carefully separated)",
    "½ teaspoon cream of tartar",
    "halva frosting",
    "blueberries & peach slices",
    "sesame seeds, to garnish"
  ],
  "__v": 1
}