{
  "hash": "0b63a11bf3fe5fe5705dee358b6b0cfd7317b5f1",
  "title": "Sandwich Bread (Gluten-free, Egg-free, Oil-free)",
  "image": "",
  "href": "http://www.healthfulpursuit.com/2013/04/best-gluten-free-bread/",
  "extension": "",
  "firstAdded": "2015-09-21T00:53:07.230000",
  "users": [
    null
  ],
  "keywords": [
    "water",
    "fleishmanns",
    "dry",
    "active",
    "yeast",
    "coconut",
    "sugar",
    "nut",
    "used",
    "hazelnut",
    "butter",
    "nectar",
    "flax",
    "seeds",
    "raw",
    "apple",
    "cider",
    "vinegar",
    "teff",
    "flour",
    "arrowroot",
    "starch",
    "chia",
    "salt",
    "instructions"
  ],
  "directions": [
    "0",
    "Lightly oil an 8 x 4-inch loaf pan with a small dab of whatever oil you have on hand.",
    "Place the warm water and teaspoon of coconut sugar into a small bowl (a 2-cup liquid measure works well). Make sure the water is the right temperature. If the water is too cold the yeast will not become active and if the water is too hot it will kill the yeast. Add the yeast and stir. Proof the yeast by allowing it to stand for 5 to 10 minutes. It should become bubbly, if not start over with fresh yeast and water.",
    "Add nut butter, nectar, , oil, and ground flax seeds. Stir well with a spoon, just until mixed. Allow to sit again for 5 minutes.",
    "Stir in vinegar.",
    "Meanwhile, add flour, starch, chia and salt to a large mixing bowl.",
    "Pour in wet ingredients and stir well to mix thoroughly.",
    "Transfer dough to your prepared loaf pan and flatten top with the back of a spoon. Cover pan with a towel and allow to rest in a very warm spot to rise. I like letting it sit in an UNHEATED oven but any warm spot will do the trick. Let it sit for 60 minutes.",
    "Then, bake in a 350F oven for 35- 40 minutes - until top is golden and a toothpick inserted comes out relatively clean. The bread will firm up and continue cooking out of the oven.",
    "Allow loaf to cool in pan for 5 minutes before removing it from the pan and placing on a wire rack to cool. Cool completely, for an hour, then cut into 16 slices.",
    "Can be stored in an air-sealed bag for 2 days on the counter, in the fridge for 5 days, or in the freezer for up to 2 months. The bread does firm up after 2 days so it's best to heat before enjoying."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 ½ cups warm water (100F to 110F)",
    "1 package Fleishmanns dry active yeast",
    "1 teaspoon coconut sugar",
    "¼ cup nut butter - I used hazelnut butter",
    "2 tablespoons coconut nectar",
    "2 tablespoons ground flax seeds",
    "1 tablespoon raw apple cider vinegar",
    "2 cups teff flour",
    "1 cup arrowroot starch",
    "2 teaspoons freshly ground chia seeds",
    "1 teaspoons sea salt",
    "Instructions"
  ],
  "__v": 1
}