{
  "hash": "1663b5e7b223af977adaecdb0f58f1e168462c1a",
  "title": "Chunky minestrone with basil paste and pecorino",
  "image": "",
  "href": "http://www.ottolenghi.co.uk/recipes/mediterranean-feast/chunky-minestrone-with-basil-paste-and-pecorino-shop",
  "extension": "Chrome",
  "firstAdded": "2016-01-02T00:18:10.605000",
  "users": [
    null
  ],
  "keywords": [
    "aubergine",
    "chunks",
    "net",
    "olive",
    "oil",
    "red",
    "peppers",
    "deseeded",
    "long",
    "strips",
    "wide",
    "medium",
    "courgettes",
    "lengthways",
    "onions",
    "wedges",
    "beef",
    "tomatoes",
    "cherry",
    "sprigs",
    "rosemary",
    "stock",
    "vermicelli",
    "egg",
    "angel",
    "hair",
    "pasta",
    "rice",
    "noodles",
    "green",
    "peas",
    "frozen",
    "minutes",
    "pecorino",
    "cheese",
    "coarsely",
    "salt",
    "black",
    "pepper",
    "herb",
    "basil",
    "parsley"
  ],
  "directions": [
    "0",
    "To make the herb oil, place all the ingredients in the small bowl of a food processor, along with a pinch of salt. Blitz to form a thick paste and set aside.",
    "Preheat the oven to 230C.",
    "Place the aubergine in a large bowl with 3 tablespoon of the olive oil, ¼ teaspoon of salt and a good grind of black pepper. Stir well to coat then transfer to a baking tray. Roast for about 35 minutes, until cooked through and golden brown. Keep aside somewhere warm until ready to serve.",
    "Meanwhile, place the peppers, courgettes and onions in the bowl, add 3 tablespoons of the olive oil, ½ a teaspoon of salt and some black pepper. Toss to combine, transfer to a large baking tray, spread out and roast in the oven for about 30 minutes, stirring once or twice during the cooking, until everything is cooked through and starting to gain some colour. Keep warm until ready to serve.",
    "At the same time, place all the tomatoes in the bowl with the remaining 2 tablespoons of oil, the rosemary, ½ teaspoon of salt and some black pepper. Toss, transfer to a baking tray and roast for about 25 minutes, until starting to colour but still retaining their shape. Again, keep warm until ready to serve.",
    "Bring the stock to a rapid simmer and add the pasta. Cook according to the instructions on the packet.",
    "To serve, spoon the vegetables into the base of a large flat-bottomed bowl, ladle over the stock and the pasta. Top with the peas and pecorino and finish with the herb paste. Serve immediately."
  ],
  "ingredients": [
    "0",
    "1 large aubergine, cut into 3 or 4 cm chunks (350g net)",
    "120ml olive oil",
    "2 red peppers, halved, de-seeded and cut into long strips, 2 cm wide (350g net)",
    "2 medium courgettes, halved lengthways and then cut into 3 or 4 cm chunks (350g net)",
    "2 onions, peeled, halved and then each half cut into 4 wedges, 3 cm wide (300g net)",
    "2 beef tomatoes, halved and each half cut into 3 or 4 wedges (570g net)",
    "300g cherry tomatoes",
    "3 large sprigs of rosemary (15g net)",
    "2lt vegetable stock",
    "80g vermicelli egg noodles, angel hair pasta or thin rice noodles",
    "100g green peas, fresh or frozen, blanched for 2 minutes and drained",
    "70g pecorino cheese, coarsely grated",
    "Salt and black pepper",
    "Herb oil:",
    "25g basil",
    "30g parsley",
    "60ml olive oil"
  ],
  "__v": 1
}