{
  "hash": "f956822b0df3ff2b4bd6eef6bb29b6f0a8e37345",
  "title": "Easy Biscuit Chicken Pot Pie",
  "image": "http://media.sixsistersstuff.com/uploads/2014/09/Easy-Biscuit-Chicken-Pot-Pie-700x1050.jpg",
  "href": "http://www.sixsistersstuff.com/2014/09/easy-biscuit-chicken-pot-pie.html",
  "extension": "Firefox",
  "firstAdded": "2015-08-03T14:02:26.202000",
  "users": [
    null
  ],
  "keywords": [
    "oil",
    "onion",
    "carrots",
    "broccoli",
    "cauliflower",
    "kosher",
    "salt",
    "black",
    "pepper",
    "unsalted",
    "butter",
    "allpurpose",
    "flour",
    "milk",
    "lowsodium",
    "chicken",
    "broth",
    "regular",
    "size",
    "cream",
    "soup",
    "thyme",
    "frozen",
    "peas",
    "thawed",
    "refrigerated",
    "pilsbury",
    "grands",
    "biscuits"
  ],
  "directions": [
    "0",
    "Preheat the oven to 400 degrees.",
    "In a large pan heat your oil on medium-high heat. Once the oil is hot, saute the onions, carrots, broccoli, cauliflower, and peas until tender, about 5-7 minutes. Season with salt and pepper to taste. Transfer cooked vegetables to a bowl with the chicken; set aside.",
    "Reduce the heat to medium and add the butter to the same pot. When melted, stir in the flour and cook, stirring constantly for 1 minute. Whisk in the milk, chicken broth, cream of chicken soup and thyme. Allow the sauce to come to a simmer and let it simmer for 1 minute to thicken. Season with salt and pepper.",
    "Turn off the heat and transfer the vegetables and chicken to the pot, stirring until the filling is well-combined. If the filling is too thick, stir in some extra chicken broth milk.",
    "Pour the filling into a 13x9-inch baking dish and bake for 18 minutes. Remove the dish from the oven (keeping the oven on and door closed) and top the filling with 8 biscuits (yes, raw biscuits). Return the baking dish to the oven and bake for an additional 10-12 minutes, until the biscuits are golden brown and the filling is bubbly. Cool for 5 minutes before serving."
  ],
  "ingredients": [
    "0",
    "2 Tablespoons vegetable oil",
    "1 onion, chopped fine",
    "½ cup of chopped carrots",
    "½ cup of chopped broccoli",
    "½ cup of chopped cauliflower",
    "Kosher salt and freshly ground black pepper",
    "4 tablespoons unsalted butter",
    "½ cup of all-purpose flour",
    "1½ cups milk",
    "2 to cups of low-sodium chicken broth",
    "1 regular size can of cream of chicken soup",
    "½ teaspoon dried thyme",
    "2 cups (about 1 pound) of cooked, shredded chicken",
    "¾ cup frozen peas, thawed",
    "1 refrigerated package of Pilsbury Grands Biscuits (8 biscuits)"
  ],
  "__v": 1
}