{
  "hash": "78d88f6caf1f966f8931afcf158581dd9977549d",
  "title": "Cream Of Celeriac Soup with Brussels Sprouts Chips",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2016/12/2016-12-21-Celeriac-Soup-2.jpg",
  "href": "https://www.simplyrecipes.com/recipes/cream_of_celeriac_soup_with_brussels_sprouts_chips/",
  "extension": "",
  "firstAdded": "2018-01-28T02:17:16.526000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Make the Brussels sprouts chips: Heat the oven to 350F. Line a baking sheet with parchment paper or a silicone liner.",
    "Slice the bottom tip of each sprout, and peel off the outer leaves. Trim off a bit more of the bottom, and peel off the next layer of leaves. Continue this process until you've removed all of the leaves.",
    "Toss the leaves with the olive oil and salt, and spread them out in a single layer on the baking sheet. Roast for about 10 minutes, until the leaves are browned and crisp.",
    "Set aside until needed.",
    "2 While the Brussels sprouts are roasting, start the soup: In a large saucepan, warm the oil over medium heat and sauté the onion, garlic, and 1/4 teaspoon of salt for about 5 minutes, until the onions are soft and translucent. Add the cauliflower and celeriac, and sauté for another minute.",
    "3 Add the broth and simmer: Add the vegetable broth and 1/2 teaspoon of the salt, increase the heat to high, and bring just to a boil. Reduce the heat to medium-high and simmer for 20 to 30 minutes, until the cauliflower and celeriac are just tender.",
    "4 Remove the saucepan from the heat and stir in the almonds: Allow the soup to cool slightly for 10 minutes. (This gives the nuts time to soften.)",
    "5 Puree the soup: Pour the soup into your blender in batches and puree on high for 30 to 60 seconds, until smooth and creamy. Return the soup to the saucepan and warm it over low heat. Stir in the remaining 1⁄4 teaspoon the salt, and add the pepper. Season with additional salt and pepper, to taste.",
    "6 To serve: Ladle portions of the soup into bowls, and top with the Brussels sprouts chips."
  ],
  "ingredients": [
    "0",
    "10 brussels sprouts",
    "1 tablespoon extra-virgin olive oil",
    "1/8 teaspoon natural salt, plus more to taste",
    "2 tablespoons grapeseed oil or extra-virgin olive oil",
    "2 cups diced yellow onion",
    "2 teaspoons minced garlic (from 2 whole cloves)",
    "1 teaspoon salt, plus more to taste",
    "1 medium head cauliflower, cut into florets (See How to Cut and Core Cauliflower)",
    "3 cups peeled and diced celeriac (from 1 large root)",
    "8 cups vegetable broth, plus more as needed",
    "1/4 cup blanched slivered almonds",
    "1/8 teaspoon freshly ground black pepper, plus more to taste"
  ],
  "__v": 1
}