{
  "hash": "6b748d64ebdd4d692c33a39c5f1a66f5f266ce40",
  "title": "Roasted Tomato Soup with Basil",
  "image": "https://cookingformysoul.com/wp-content/uploads/2018/09/roasted-tomato-basil-soup.jpg",
  "href": "https://cookingformysoul.com/roasted-tomato-soup/",
  "extension": "Chrome",
  "firstAdded": "2019-01-22T15:03:48.453000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 425 degrees F.",
    "Cut 1/4 inch of the head of garlic from the top. Place garlic on a sheet of aluminum foil and drizzle with 1 tablespoon of olive oil, 1/2 teaspoon salt and 1/4 teaspoon ground black pepper. Fold up the aluminum foil and seal by twisting the foil. For mored details on roasting garlic, see here.",
    "In a large sheet pan, toss roma tomatoes with 3 tablespoons olive oil, and salt and pepper to taste. Place prepared the garlic head on the same sheet pan. Roast for about 35 minutes. After they have roasted, let tomatoes and garlic cool slightly. Squeeze out garlic cloves from skin.",
    "Heat a large dutch oven to medium heat. Add the remaining 1 tablespoon olive oil, 1 tablespoon unsalted butter, the diced onions. Sauté until onions are translucent and browned, about 8 minutes. Add thyme and Italian seasoning and cook until fragrant, about 2 minutes.",
    "Add the 3 cups chicken stock, roasted tomatoes, roasted garlic cloves, the can of plum tomatoes, and basil leaves. Stir until well combined. Bring to a boil, then reduce heat to simmer, uncovered, until liquid has reduced by a third, about 20-25 minutes. Stir occasionally.",
    "Using an immersion blender, puree soup until smooth and desired consistency. Adjust for seasonings. If too thick, add more chicken stock and simmer for another 5-10 minutes.",
    "Adjust seasonings with salt and pepper, if needed. Serve warm and garnish with basil leaves, if desired. Enjoy!"
  ],
  "ingredients": [
    "0",
    "2 1/2 pounds roma tomatoes, cut in half",
    "1 garlic head",
    "5 tablespoons olive oil, divided",
    "Salt and pepper to taste",
    "1 tablespoon unsalted butter",
    "1 cup diced yellow onions",
    "1 teaspoon finely chopped fresh thyme",
    "1/2 teaspoon dried Italian seasoning",
    "1 (14 oz) can whole tomatoes, with juice",
    "1 cup fresh basil leaves",
    "3 to 4 cups chicken stock, plus more as needed"
  ],
  "__v": 1
}