{
  "hash": "77a3805eb3b1e0205ba0747f9ff48cc3d089c0af",
  "title": "Firecracker Chicken Thighs",
  "image": "http://recipe-folder.com/img/recipe-images/098/745/3405781298.jpg",
  "href": "http://recipe-folder.com/recipe/5b253d112269a46331a7591f",
  "extension": "User Added",
  "firstAdded": "2018-06-16T16:38:41.098000",
  "users": [
    null
  ],
  "ratings": [
    {
      "user": "56dc229fef9940481800153b",
      "rating": 4
    }
  ],
  "keywords": [],
  "directions": [
    "0",
    "Make the sauce:",
    "1",
    "Place all the ingredients in a medium saucepan over medium heat. Bring to a boil, stirring to dissolve the sugar. Reduce the heat to low and simmer until slightly thickened, about 10 minutes. Remove from the heat. The sauce will thicken slightly as it cools. Meanwhile, arrange a rack in the center of the oven and heat to 400°F.",
    "2",
    "Make the chicken:",
    "3",
    "Pat the chicken dry with paper towels, then season all over with salt and pepper. Heat a 10-inch or larger cast iron or oven-safe skillet over medium-high heat for 5 minutes. Add the chicken skin-side down (work in batches if needed to not overcrowd the pan) and cook until the fat is rendered and the skin is crisp and golden-brown, 6 to 8 minutes.",
    "4",
    "Using tongs, flip the chicken. Pour about 1/2 of the sauce evenly over the chicken. Place the skillet in the oven and roast for 5 minutes. Remove the pan from the oven and spoon the sauce from the bottom of the skillet over the chicken. Pour the remaining reserved sauce over the top. Return to the oven and roast until chicken reaches an internal temperature of 165°F, 5 to 7 minutes more. Serve the chicken with the sauce."
  ],
  "ingredients": [
    "0",
    "For the sauce:",
    "1/2 cup hot sauce, such as Frank’s RedHot",
    "3/4 cup packed light brown sugar",
    "1 tablespoon apple cider vinegar",
    "2 cloves garlic, minced",
    "1/2 teaspoon kosher salt",
    "1/4 teaspoon red pepper flakes",
    "For the chicken:",
    "2 pounds bone-in, skin-on chicken thighs (4 to 6 thighs)",
    "Kosher salt",
    "Freshly ground black pepper"
  ],
  "__v": 3,
  "hidden": false,
  "rating": 4
}