{
  "hash": "fcd4bcd83147a6a8c8a9c4230b63a297a4107dae",
  "title": "Perfect summer rolls",
  "image": "https://i.guim.co.uk/img/static/sys-images/Lifeandhealth/Pix/pictures/2013/8/6/1375806703396/Felicity-Cloakes-perfect--010.jpg?w=300&q=55&auto=format&usm=12&fit=max&s=2c3081bd0e02a91304a85635edab112c",
  "href": "https://www.theguardian.com/lifeandstyle/wordofmouth/2013/aug/07/how-to-make-perfect-vietnamese-summer-rolls",
  "extension": "Chrome",
  "firstAdded": "2016-10-20T12:48:03.509000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Put the pork belly in a pan and cover with water. Add 1 tbsp salt and bring to the boil, then turn down the heat, cover and simmer for about 20-25 minutes, until cooked through. Allow to cool, then slice thinly.",
    "Bring a small pan of water, with the lemongrass and 1 tbsp salt added, to the boil. Add the prawns, turn down the heat and poach for two minutes until pink. Drain and cut in half.",
    "Put the noodles in a large bowl and pour over boiling water. Add ½ tsp salt, leave for about four minutes until al dente, then rinse well in cold water and drain thoroughly.",
    "Set out all the ingredients within easy reach of a clean, dry chopping board. Half fill a bowl big enough to fit the wrappers in with cold water, and then dunk one in and keep patting until it's pliable, but not completely soft. Lay flat on the chopping board.",
    "Arrange two crossed chives, if using, horizontally towards the bottom edge of the wrapper. Top with four prawn halves in a horizontal line, and top these with a line of herb leaves. Add a pinch of carrot and a few cucumber sticks, some of the sliced pork, then a small clump of rice vermicelli. Finish with some shredded lettuce and a line of crushed peanuts.",
    "Bring the bottom edge of the wrapper tightly up over the filling, and then fold the sides in over it. Continue to roll up tightly and place on a plate, join-side down. Cover rolls with lettuce leaves to keep them fresh.",
    "Once all the rolls are made, make the sauce. Whisk the sugar into the lime juice to dissolve, then add the remaining ingredients. Adjust to taste if necessary."
  ],
  "ingredients": [
    "0",
    "150g pork belly, rind removed (optional)",
    "16 large raw, peeled prawns",
    "1 stalk of lemongrass, crushed",
    "1 block of rice vermicelli",
    "4 sprigs of mint, leaves picked",
    "4 sprigs of coriander",
    "4 sprigs of perilla leaves or thai basil leaves (optional)",
    "2 chinese chives, cut into 10cm lengths (optional)",
    "1 carrot, peeled and grated",
    "¼ cucumber, cut into thin matchsticks",
    "1 soft lettuce, ½ shredded",
    "4 tbsp salted roasted peanuts, roughly chopped",
    "8 rice paper wrappers",
    "For the dipping sauce:",
    "1 tbsp sugar",
    "2 tbsp lime juice",
    "1 tbsp fish sauce",
    "1 garlic clove, crushed",
    "1 bird's eye chilli, finely sliced"
  ],
  "__v": 1
}