{
  "hash": "f8f2907732dcf45eb4d9d8a1bd40e94801ce89dd",
  "title": "Homemade Corned Beef",
  "image": "http://davidlebovitz.com.s3.amazonaws.com/wp-content/uploads/2016/02/French-corned-beef-drawing-640x854.jpg",
  "href": "http://www.davidlebovitz.com/homemade-corned-beef-brisket-recipe/",
  "extension": "Chrome",
  "firstAdded": "2016-09-19T16:54:00.742000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To make the corned beef, put the water, salt, and brown sugar in a large pot and bring to a boil.",
    "While the salted water is heating up, in a skillet, toast the cloves, peppercorns, allspice berries, and mustard seeds, until they smell fragrant. It will take just a couple of minutes. Remove from heat and let cool. Once cool, lightly crush the spices in a mortar and pestle or in a zip top bag with a hammer or rolling pin. (Note: In the photo in my post, because I was so excited to have brisket, I neglected to crush them, which I do recommend to help release their flavor.) Add them to the brine, along with the bay leaves, cinnamon stick, red pepper flakes, ginger, and pink curing salt.",
    "Once the brine is hot enough so the sugar and salt are completely dissolved, remove from heat and add 2 pounds (900g) of ice cubes. Put the brine in the refrigerator until it’s completely chilled.",
    "Once cool, put the brisket in a large, zip top freezer bag set in a larger bowl. (The bowl is in case there is any overflow or spillage.) Make sure the beef is lying flat in the bag and pour the cold brine over the meat so it’s completely covered. If you have too much brine, strain out the spices, add them to the meat bag and discard the excess brine. Close the bag and let the meat sit in the refrigerator for 7 to 10 days, turning it every couple of days so the meat marinates evenly.",
    "To cook the corned beef, rinse the corned beef with cold water and put it in a large pot or Dutch oven. Add the onion, garlic, and any seasonings, and enough water to cover the beef. Bring to a boil then reduce the heat until the water is at a gentle simmer. Put the lid on the pot so it’s ajar and cook, turning the beef a few times while it’s cooking until very tender.",
    "About 45 minutes before the meat is done, add the carrots and potatoes. (And cabbage wedges, if using.) When the meat is tender and the vegetables are cooked through, the corned beef is ready to serve. The meat will take about 3 1/2 hours to cook.",
    "Serving: Serve slices of corned beef with the potatoes and carrots, along with some of the broth. Mustard is obligatory to serve alongside. A few condiments are mentioned in the headnote.",
    "*Note: I mentioned Baked Corned Beef in the post and I did get around to trying it. (I used a store-bought corned beef to test it.) Because I had heard it produced a saltier corned beef, I brought the corned beef to a boil in two changes of water to desalt it a bit, then patted it dry. In a small bowl, I mixed 1/3 cup mustard and 1/4 cup light (or you can use dark) brown sugar with 1 teaspoon cider vinegar and a few good turns of black pepper. I reserved a few tablespoons of it then smeared the rest over the corned beef. It got placed fat side up on a large sheet of aluminum foil, set on a rimmed baking sheet or baking dish, and closed tightly.",
    "I baked it at 350ºF/160ºC for 2 1/2 hours. Then I opened the foil (carefully, as there was hot liquid in it), then smeared the rest of the glaze on the corned beef and ran it under the broiler until browned. The results? I thought it was still saltier than regular corned beef, which may be because I used a store-bought corned beef, but I found it tougher than a simmered corned beef. However it was firmer and easier to slice, so it might be preferable if you were planning to use the corned beef for sandwiches."
  ],
  "ingredients": [
    "0",
    "For the corned beef",
    "One beef brisket (4 to 5 pounds, about 2kg), trimmed of most of the excess fat",
    "2 quarts water (1,9l)",
    "1 1/4 cups (310g) coarse sea or kosher salt",
    "1/2 cup (90g) light or dark brown sugar",
    "12 whole cloves",
    "1 1/2 teaspoons black peppercorns",
    "1 teaspoon allspice berries",
    "2 teaspoons mustard seeds, light or dark",
    "4 crumbled bay leaves",
    "1 cinnamon stick, crumbled",
    "1 teaspoon red pepper flakes",
    "1/2 teaspoon ground ginger",
    "5 teaspoons pink curing salt",
    "For cooking the corned beef",
    "1 large onion, peeled and quartered",
    "4 large cloves garlic, peeled and minced",
    "Seasoning for the cooking water, such as a few bay leaves, thyme or parsley sprigs",
    "10 large carrots (about 2 pounds, 900g), peeled and cut into sticks (quartered)",
    "2 pounds (900g) boiling potatoes, peeled and cut in pieces similar in size to the carrots"
  ],
  "__v": 1
}