{
  "__v": 1,
  "directions": [
    "0",
    "DIRECTIONS:",
    "Add all ingredients except the goat cheese and parsley (and any additional salt and pepper) to a large, heavy pot - I use a 7-quart dutch oven.",
    "Place the pot over high heat and bring to a rolling boil. As soon as it comes to the rolling boil, set the timer for 9 minutes. Stir and toss with tongs as it cooks, stirring frequently for the first few minutes and then constantly as it thickens and begins to stick to the bottom of the pot. When the 9 minutes is up, the pasta should be tender and the sauce will have thickened slightly. If the pasta is not yet cooked, continue for one more minute. Remove from heat.",
    "Crumble goat cheese into the pasta. Stir gently until melted and combined. Let sit for 5 minutes (at this point, the pasta will seem somewhat soupy, but it will thicken as it sits).",
    "Stir and taste. Add additional salt and pepper if desired.",
    "Divide between bowls and sprinkle parsley over the tops.",
    "*Sour cream - or even vegan sour cream - may be substituted for the goat cheese, but the sauce may not thicken"
  ],
  "firstAdded": "2014-10-04T06:14:33.937000",
  "hash": "7ab9592080466654030fc5ee8986568ce584c38e",
  "href": "http://www.kitchentreaty.com/one-pot-creamy-pumpkin-pasta/",
  "image": "http://www.kitchentreaty.com/wp-content/uploads/2014/09/One-Pot-Creamy-Pumpkin-Pasta-5-sq-160x160.jpg",
  "ingredients": [
    "0",
    "INGREDIENTS:",
    "8 ounces linguine pasta",
    "4 cups vegetable broth",
    "1 cup pumpkin puree",
    "1/2 cup white wine (I recommend Chardonnay or another wine that's on the dry side)",
    "2 tablespoons olive oil",
    "1/2 medium onion, chopped small (about 1 cup)",
    "3-4 large cloves garlic, peeled & minced (about 2 tablespoons)",
    "1/2 teaspoon ground nutmeg",
    "1/8 teaspoon crushed red pepper flakes (or more or less to taste)",
    "1 teaspoon kosher salt plus more to taste",
    "1/4 teaspoon freshly ground black pepper plus more to taste",
    "1 (4-ounce) log fresh goat cheese (chevre)*",
    "1 small bunch parsley, chopped"
  ],
  "keywords": [
    "linguine",
    "pasta",
    "broth",
    "pumpkin",
    "puree",
    "white",
    "recommend",
    "chardonnay",
    "wine",
    "thats",
    "dry",
    "olive",
    "oil",
    "medium",
    "onion",
    "garlic",
    "nutmeg",
    "red",
    "pepper",
    "kosher",
    "salt",
    "black",
    "log",
    "goat",
    "cheese",
    "chevre",
    "bunch",
    "parsley"
  ],
  "title": "One Pot Creamy Pumpkin Pasta",
  "users": [
    null
  ]
}