{
  "hash": "bf01fffe51c4216c4c5f5f373b48be44da27b436",
  "title": "Grain Free Mexican Wedding Cookies",
  "image": "",
  "href": "http://www.thenourishinggourmet.com/2014/10/grain-free-mexican-wedding-cookies.html",
  "extension": "",
  "firstAdded": "2015-04-29T04:40:57.277000",
  "users": [
    null
  ],
  "keywords": [
    "coarsely",
    "almonds",
    "pecans",
    "walnuts",
    "room",
    "recommend",
    "organic",
    "andor",
    "pastured",
    "butter",
    "salt",
    "sugar",
    "notes",
    "glutenfree",
    "vanilla",
    "tapioca",
    "flour",
    "almond",
    "extra",
    "dusting",
    "desired"
  ],
  "directions": [
    "0",
    "Preheat the oven to 350F degrees. On a large sheet pan, place the chopped nuts, and toast, stirring occasionally, for about 5-8 minutes, or just until you start to smell their aroma released. Set aside to cool, and turn off oven. Once cool, grind further in the food processor (you want fairly fine bits, not chunks). Don't over-process and make it oily or powdery.",
    "Dump out into a small bowl and set aside.",
    "Now place the butter, salt, ½ cup powdered sugar, and vanilla extract into the food processor and process (scrapping down the sides as needed) until smooth and fluffy. Add the nuts back in and process until combined. Now add the two flours. and process once more. If you have a small food processor that can't handle all of the ingredients, simply scrap out the butter/sugar mixture into a bowl, and hand mix the flours into it.",
    "Now place in the refrigerator for 30 minutes at least, or until the dough has firmed up enough to be able to roll into balls (You may find it necessary to leave for up to 2 hours, depending on how cold your refrigerator is).",
    "Once ready, preheat the oven again to 350F, and use a teaspoon to scoop out batter and roll lightly into balls, and place on a parchment covered sheet about 1-inch apart (there will be some spreading). Baking one sheet at a time (placing dough back into the fridge between batches), bake for about 10-12 minutes, or until the edges are just starting to brown.",
    "Remove from oven and allow to cool on sheet for about ten minutes to firm before removing to cool rack. Repeat rolling/baking/cooling process until all of the cookies are cooked.",
    "Using a sieve, lightly dust the cookies with powdered sugar, if desired, for that snowy sweet look."
  ],
  "ingredients": [
    "0",
    "1 cup of coarsely chopped almonds (or pecans or walnuts)",
    "½ pound (2 sticks) room temperature butter (I recommend organic and/or pastured butter)",
    "¼ teaspoon salt",
    "½ cup organic powdered sugar (see notes above)",
    "2 teaspoons gluten-free vanilla extract",
    "1¼ cup tapioca flour",
    "1 cup finely ground almond flour",
    "Extra powdered sugar for dusting, as desired"
  ],
  "__v": 1
}