{
  "hash": "83320aa324cab4f6e97828b16c7205225ec3071c",
  "title": "Sherrill's Secret Soft Gingerbread Boys",
  "image": "https://www.washingtonpost.com/rf/image_982w/2010-2019/WashingtonPost/2017/11/27/Food/Images/fd-studio_025-001.JPG",
  "href": "https://www.washingtonpost.com/recipes/sherrills-secret-soft-gingerbread-boys/6864/?tid=a_inl&utm_term=.061814f39938",
  "extension": "Firefox",
  "firstAdded": "2017-12-10T00:49:11.780000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the cookies: Combine the butter, oil, honey, molasses and brown sugar in a large saucepan over medium-high heat. Cook, stirring, until the butter melts and the mixture just comes to a full boil; immediately start timing and cook for exactly 1 minute, stirring occasionally. Let cool slightly.",
    "Combine the flour, cinnamon, ginger, cloves, baking powder, baking soda and salt in the bowl of a stand mixer or handheld electric mixer. Beat on low speed; working carefully to avoid splashes, add the cooled butter-molasses mixture, beating (low speed) until the ingredients are incorporated. Increase the speed to medium, beating until very well blended; if the mixer motor labors, stop and complete the mixing by hand. (The dough will seem too soft at this point.) Cover and refrigerate for 30 minutes or until the dough has stiffened and is barely warm.",
    "Divide the dough into thirds. Roll out the portions a generous 1/4-inch thick between sheets of parchment or wax paper. Stack the rolled portions (paper still attached) on a tray or baking sheet. Refrigerate for at least 30 to 40 minutes, or freeze for 20 to 25 minutes or until cold and firm. (The dough may be refrigerated for up to 12 hours, if preferred.)",
    "Preheat the oven to 350 degrees. Line several baking sheets wlth parchment paper or silicone liners",
    "Working with one dough portion at a time (leaving the remainder chilled), gently peel away one sheet of paper, then lightly pat it back into place. (That will make it easier to lift cookies from the paper later.) Flip the dough over, then peel off and discard the second sheet. Using a 4- to 5-inch gingerbread girl or boy cutter, cut out the cookies. Using a spatula, transfer cookies to baking sheets, spacing about 2 inches apart. (If at any point the dough softens too much to handle easily, transfer the paper and cookies to a tray or baking sheet, and chill until firm again.) Gather up and reroll the dough scraps between sheets of paper. Continue cutting out cookies until all the dough is used. Very firmly press raisins into the cookies for eyes and front buttons.",
    "Bake one sheet at a time (middle rack) for 9 to 14 minutes, until the cookies are slightly colored on top and slightly darker at the edges; it's better to over-bake than under-bake. Cool on the sheet for about 4 minutes; then, use a wide spatula to transfer to wire racks set over a sheet of wax paper. Have all the cookies lined up and slightly separated before beginning the glaze.",
    "For the glaze: Whisk together the confectioners' sugar, oil and water in a medium saucepan until well blended over medium-high heat. Bring to a boil, stirring, for 30 to 45 seconds or just until the mixture is smooth and becomes translucent. Stir to recombine the glaze, then use right away while it is still hot. (If the glaze is allowed to stand and cool, it may thicken and become sugary. In that case, add a teaspoon of hot water to thin it again, place over medium heat and continue stirring until the sugar dissolves. Immediately remove from the heat and use.)",
    "Use a pastry brush or a paper towel dipped in the glaze to brush the cooled cookies until their tops are coated all over with an even layer, not too thick or too thin. Stir the glaze frequently to prevent it from separating. Let the glazed cookies cool completely, at least 1 hour; the glaze may become slightly sugary and flaky."
  ],
  "ingredients": [
    "0",
    "For the cookies",
    "16 tablespoons (2 sticks) unsalted butter, cut into chunks",
    "1/3 cup corn oil or other flavorless vegetable oil",
    "1/2 cup clover honey",
    "2/3 cup light (mild-flavored) molasses",
    "1/3 cup packed light brown sugar",
    "3 1/3 cups flour",
    "2 1/2 teaspoons ground cinnamon",
    "1 1/2 teaspoons ground ginger",
    "1/2 teaspoon ground cloves",
    "1 1/2 teaspoons baking powder",
    "1/2 teaspoon baking soda",
    "1/2 teaspoon salt",
    "Raisins or currants for the eyes and buttons"
  ],
  "__v": 1
}