{
  "__v": 2,
  "directions": [
    "0",
    "Brown the butter: In a medium saucepan, heat the butter over medium-low heat and cook until the butter melts and browns, taking on a nutty aroma, 8-10 minutes. Be careful not to overcook or the butter will burn. Remove from heat and cool to warm before using.",
    "While the butter is cooling, prepare the pan: Grease a decorative 10-inch (25cm) cake or tart pan with butter and flour, or line with parchment. Heat the oven to 190°C.",
    "In the bowl of a stand mixer fitted with the whisk attachment, or in a large bowl, sift together the icing sugar with the almond flour, cake flour and salt. With the mixer running, or using a hand mixer, add the egg whites in a steady stream. Once combined, quickly add the hazelnut oil, then the butter, and mix just until combined; be careful not to overmix.",
    "Pour the mixture into the prepared pan, filling the pan three-fourths of the way full. Sprinkle with the chopped chocolate and hazelnuts, as well as the granulated sugar. Bake until the torte is puffed and medium brown on top, about 35 minutes. Cool before serving."
  ],
  "firstAdded": "2014-10-14T18:06:27.499000",
  "hash": "ab23d691426219be82309e18b63c0d2aa38e343b",
  "href": "http://www.thestar.com.my/Lifestyle/Food/Recipes/2013/10/03/Hazelnut-Brown-Butter-Torte-With-Bittersweet-Chocolate/",
  "image": "http://www.thestar.com.my/~/media/Images/TSOL/Photos-Upload/From DCX/2013/10/03/doc6c3mymwmj09li9io876.ashx?w=620&h=413&crop=1&",
  "ingredients": [
    "0",
    "250g butter",
    "325g icing sugar",
    "100g almond meal",
    "85g cake flour",
    "¾ tsp salt",
    "1 cup egg whites, from about 7 eggs",
    "½ tbsp hazelnut oil (use canola oil if unavailable)",
    "¼ cup chopped bittersweet chocolate",
    "¼ cup chopped roasted hazelnuts",
    "2 to 3 tbsp caster sugar, for sprinkling"
  ],
  "keywords": [
    "butter",
    "icing",
    "sugar",
    "almond",
    "meal",
    "cake",
    "flour",
    "salt",
    "egg",
    "whites",
    "eggs",
    "hazelnut",
    "use",
    "canola",
    "oil",
    "unavailable",
    "bittersweet",
    "chocolate",
    "roasted",
    "hazelnuts",
    "caster",
    "sprinkling"
  ],
  "title": "Hazelnut Brown Butter Torte With Bittersweet Chocolate",
  "users": [
    null
  ]
}