{
  "hash": "01893a00cbee5e8740428aaac2b572ce65ae5599",
  "title": "KETO CHEESECAKE",
  "image": "https://preview.redd.it/vefybus02xg11.jpg?width=576&s=92c5046d9e931b1a32a10099e9b911fd1bddd98d",
  "href": "https://old.reddit.com/r/ketorecipes/comments/98exk4/super_proud_of_my_first_keto_cheesecake/",
  "extension": "Chrome",
  "firstAdded": "2018-09-18T17:41:49.585000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions:",
    "Set the 2 bricks of Cream Cheese out on the counter at least 1 hour before you start this recipe so that they can properly soften.",
    "Preheat your oven to 350*F because it’s not going to take you long to whip up this cheesecake batter.",
    "In a medium glass bowl melt the 4 Tablespoons (half a stick) of butter, and then begin mixing in the 1 Cup of Almond Flour with a fork. At first it will seem like this may not be enough butter, but you will just need to quickly work with it. Trust me, you do not want to add more butter to the crust, even though you might feel tempted to. If you, do it might just come dripping out of your springform pan.",
    "Add in 1 Teaspoon Ground Cinnamon and 2 Tablespoons of Pyure Granulated Sweetener. You can also use Swerve, though they do not sweeten at the same ratios.",
    "Press the crust mixture into the bottom of your 9-inch springform pan and spread around evenly. This will produce a rather thin crust that should be about 1/8″ thick all around. Bake the crust for about 5 minutes in the oven at 350*F and then remove immediately and set on the counter.",
    "In a large bowl, begin to blend the Cream Cheese together with a hand mixer until evenly whipped.",
    "Add in the 2 Tablespoons of Vanilla Extract, 2 Eggs, 1/2 Cup Pyure Granulated Sweetener, and a dash of Sea Salt. Blend until evenly distributed.",
    "Spoon the cheesecake batter into the springform pan, and spread as evenly across the pan as you can.",
    "Place the cheesecake into the oven at 350*F on the middle rack and allow to cook for at least 20 minutes. Around that time begin to watch it carefully, as you want to make sure you cook the cheesecake long enough for the mixture to set, but not so long that you brown the top of the cheesecake.",
    "Remove from the oven when you believe it is done, and set on the counter to cool for about 20 minutes before placing in the refrigerator to cool for at least 4 hours (overnight preferably). Do not plastic wrap or cover the cheesecake with foil before putting in the fridge or else it will retain too much moisture on the top, but also do not add to a fridge that had exposed seafood or onions, as those flavors will seep into the cheesecake and ruin your day."
  ],
  "ingredients": [
    "0",
    "KETO CHEESECAKE RECIPE",
    "Ease of Preparation: Easy",
    "Prep Time: 15 Minutes",
    "Cooking Time: 20-25 Minutes",
    "Total Time: 35-40 Minutes",
    "Ingredients:",
    "16 Ounces Cream Cheese (room temperature)",
    "1 Cup Almond Flour",
    "4 Tablespoons Butter",
    "2 Tablespoons Vanilla Extract",
    "2 Eggs",
    "1/2 Cup Pyure Granulated Sweetener",
    "1 Teaspoon Ground Cinnamon",
    "Sea Salt (optional)",
    "2 Tablespoons Pyure Granulated Sweetener (for crust)"
  ],
  "__v": 1
}