{
  "hash": "0b54212d0bedacb532dd88ec3e7469f36dc7b0c5",
  "title": "Mango Mousse Cake",
  "image": "http://recipe-folder.com/img/recipe-images/061/395/3948286761.jpg",
  "href": "https://www.thespruceeats.com/mango-mousse-cake-3029175",
  "extension": "Chrome",
  "firstAdded": "2018-07-10T00:15:50.870000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Bake the Cake",
    "Preheat the oven to 350 F.",
    "Beat the egg whites with a standing or hand mixer until stiff. Slowly add the sugar and continue to beat until you have a stiff and glossy meringue.",
    "In a separate bowl, whisk the egg yolks until they are well-mixed.",
    "Whisk 1/4 cup of the meringue into the egg yolks.",
    "Fold the egg yolk mixture gently back into the meringue with the vanilla and coconut flavoring.",
    "Gently fold the flour and salt into the meringue, in two parts, until the flour is just mixed in.",
    "Place the mixture in a ziplock bag, seal and cut off one corner to make a 1/2-inch wide hole.",
    "Place a piece of parchment onto a baking sheet.",
    "With a pencil, lightly trace the inside diameter of a 9-inch springform pan in two places. Fill in the circles with the cake batter, piping it in a spiral fashion. You should use about half of the cake batter to fill the two circles.",
    "On a separate baking sheet lined with parchment, mark with a pencil two bands with a width equal to the height of the springform pan. The bands should be about two-thirds the length of the cookie sheet, enough to line the inside of the springform pan with a little extra in case of mistakes. Pipe diagonal lines of batter to fill the bands. These bands of cake will line the springform pan.",
    "Dust the top of the cake pieces with powdered sugar. Bake for about 10 to 12 minutes, until just golden brown.",
    "Remove the cakes from the oven and peel the parchment off the backs while still warm.",
    "-",
    "Make the Syrup",
    "Bring the sugar and water to a boil and boil for 2 minutes.",
    "Remove from heat and let cool briefly.",
    "Stir in liqueur.",
    "Generously brush the bottom and inside walls of the springform pan with melted butter.",
    "Place one circle of cake in the bottom of the pan, trimming to fit if necessary. Brush the cake generously with the syrup.",
    "Brush the plain sides of the bands of cake with syrup and place them in the pan so that the visible stripes face outward and are pressed against the sides of the pan. Trim them so that they fit tightly into the pan, completely lining the sides.",
    "-",
    "Make the Mousse",
    "Puree the mango with the lime juice until smooth.",
    "Strain and set aside.",
    "In a bowl, sprinkle the gelatin over 1/4 cup of water and let rest for 5 minutes. Place the bowl over a pot of simmering water (do not let bowl touch the water) and stir until the gelatin is dissolved.",
    "Stir the mango puree into the gelatin and mix well. Strain once more and set it aside.",
    "Bring the sugar and 1/4 cup water to boil in a small saucepan.",
    "Beat the egg whites until stiff. Leave the mixer on the lowest speed until the sugar syrup reaches 248 F.",
    "Remove the syrup from the heat and slowly pour it into the egg whites while continuing to beat them.",
    "When the egg whites are stiff and shiny -- now meringue -- stir 1/4 cup of the mixture into the mango puree. Fold this mixture back into the meringue.",
    "Beat the whipping cream until soft peaks form. Gently fold the whipping cream into the meringue/mango mixture.",
    "Assemble the Cake",
    "Fill the cake pan halfway with the mousse mixture, spreading it over the circle of cake on the bottom. Place the other circle of cake on top.",
    "Brush the cake generously with the rest of the syrup.",
    "Fill the pan to the top with the mousse, using a long spatula or the flat side of a knife to smooth across the top, making it level with top of the pan.",
    "Place the cake in the freezer for 2 to 3 hours.",
    "Remove the cake and place it on serving platter.",
    "Using a hairdryer, gently warm the outside of the springform pan. Carefully open the band of the pan slightly and lift the sides up and off the cake.",
    "Decorate the top of cake with fresh mango slices or raspberries.",
    "Chill the cake until you are ready to serve."
  ],
  "ingredients": [
    "0",
    "3 hrs 12 mins",
    "Prep: 3 hrs,",
    "Cook: 12 mins",
    "Yield: 1 cake (22 servings)",
    "-",
    "For the Sponge Cake:",
    "4 eggs (separated)",
    "1/2 cup sugar",
    "1/2 teaspoon vanilla",
    "1/2 teaspoon coconut flavoring",
    "3/4 cup plus 2 tablespoons flour (sifted)",
    "1/8 teaspoon of salt",
    "1/4 cup powdered sugar (for dusting)",
    "-",
    "For the Syrup:",
    "1 cup sugar",
    "1 cup water",
    "2 tablespoons fruit flavored liqueur (or 1 teaspoon orange extract plus 1 teaspoon vanilla)",
    "4 tablespoons butter (melted)",
    "-",
    "For the Mousse:",
    "2 cups mango (in chunks, fresh or frozen)",
    "Juice of 1 to 2 limes",
    "1 tablespoon gelatin with 1/4 cup water",
    "3/4 cup sugar",
    "1/4 cup water",
    "2 egg whites",
    "1 1/2 cups whipping cream"
  ],
  "__v": 6,
  "hidden": true
}