{
  "__v": 2,
  "directions": [
    "0",
    "Preheat oven to 150°C. Draw eight 7cm circles, spacing them at least 3cm apart, onto a piece of parchment paper (tracing paper) large enough to line a baking tray. Place the paper drawing side down on the tray. You will still be able to see the circles through the paper.",
    "Sift ½ tbsp castor sugar, icing sugar, coffee and cornflour together.",
    "In a glass or metal bowl and with an electric whisk, beat egg white with cream of tartar and salt until foamy, about 30 seconds.",
    "Beat in 1 tbsp castor sugar. Keep whisking until soft peaks form, 1-2 minutes. Add the remaining 1 tbsp of castor sugar and whisk until stiff, glossy peaks form, 2-3 minutes. Fold in the icing sugar mixture.",
    "Pipe or spread batter within the circles on the baking sheet. Bake for 40-45 minutes until cookies are crisp on the outside. Turn off the oven and prop the door open with a wooden spoon. Leave meringues to dry in the oven, about 1 hour, then place on a wire rack to cool completely.",
    "To assemble, spread a large scoop of ice cream onto the flat side of four of the meringue cookies. Cover with the remaining discs and press down lightly to flatten the ice cream. Roll the sides in the garnish, if using. Freeze for 30 minutes before eating."
  ],
  "firstAdded": "2014-10-15T13:14:29.644000",
  "hash": "0a0951a4e89c80f9cde03df66bd1f9fc9ab65b59",
  "href": "http://www.thestar.com.my/Lifestyle/Food/Recipes/2013/07/26/meringue-ice-cream-sandwiches/",
  "image": "http://www.thestar.com.my/~/media/Images/TSOL/Photos-Upload/Food and Drink/2013/07/meringue ice cream sandwich.ashx?w=620&h=413&crop=1&",
  "ingredients": [
    "0",
    "Good quality ice cream, left in the fridge for 15 minutes to soften",
    "Optional garnishes (chopped toasted nuts, coconut, sprinkles etc)",
    "----------------------",
    ">>> Coffee Meringue Cookies",
    "1 large egg white, at room temperature",
    "¼ tsp cream of tartar",
    "Pinch of salt",
    "2½ tbsp castor sugar, divided",
    "1 tbsp icing sugar",
    "½ tsp instant coffee",
    "½ tsp cornflour (corn starch)"
  ],
  "keywords": [
    "good",
    "quality",
    "ice",
    "cream",
    "left",
    "fridge",
    "minutes",
    "soften",
    "garnishes",
    "nuts",
    "coconut",
    "sprinkles",
    "coffee",
    "meringue",
    "cookies",
    "egg",
    "white",
    "room",
    "tartar",
    "salt",
    "castor",
    "sugar",
    "divided",
    "icing",
    "instant",
    "cornflour",
    "corn",
    "starch"
  ],
  "title": "Coffee Meringue Ice Cream Sandwiches",
  "users": [
    null
  ]
}