{
  "hash": "b38987d4df2d72e5ac982ec3a2aec39d3be014b8",
  "title": "Crêpes Bretonnes with Apples and Brandy",
  "image": "http://recipe-folder.com/img/recipe-images/054/593/3684627854.jpg",
  "href": "http://www.lidl.co.uk/en/2374.htm",
  "extension": "Chrome",
  "firstAdded": "2015-12-24T14:00:21.079000",
  "users": [
    null
  ],
  "keywords": [
    "serves",
    "batter",
    "crpes",
    "plain",
    "flour",
    "caster",
    "sugar",
    "medium",
    "eggs",
    "milk",
    "butter",
    "oil",
    "frying",
    "filling",
    "crisp",
    "eating",
    "apples",
    "cinnamon",
    "juice",
    "lemon",
    "brandy",
    "crme",
    "frache"
  ],
  "directions": [
    "0",
    "Place the flour and sugar in a mixing bowl and add the eggs. Beat well gradually adding the milk until the mixture is smooth, thick and creamy. Whisk in the melted butter, it will set in tiny droplets. Heat a small frying pan, non-stick if possible, until really hot, then turn down the heat to medium. Drizzle the pan with a tiny amount of oil and add a large spoonful of crêpe mixture, swirling the pan to coat the surface.",
    "Allow to cook for 1-2 minutes until golden brown then toss the crêpe or use a palette knife to flip the crêpe over. Cook until this side has browned lightly. Stack on a plate and cover with cling film.",
    "Cut the apples in quarters, remove the core then cut each quarter into 3 slices. Melt the butter and fry the apples in a clean frying pan for about 5 minutes, turning halfway until lightly browned. Add the sugar and cinnamon, stirring gently until the sugar caramelises. Add the lemon juice and remove from the heat. Add the brandy (optional) and bring to the boil for 12 minutes. Divide the apples between the crêpe, fold over and serve with a dollop of crème fraîche."
  ],
  "ingredients": [
    "0",
    "(Serves 4)",
    "Batter for 8 crêpes:",
    "100g plain flour",
    "1 tbsp caster sugar",
    "2 medium eggs",
    "250ml milk",
    "25g butter (melted)",
    "Vegetable oil for frying",
    "For the filling:",
    "2 crisp eating apples",
    "25g butter",
    "4 tbsp caster sugar",
    "Pinch of ground cinnamon",
    "Juice of ½ a lemon",
    "3 tbsp brandy (optional)",
    "200g crème fraîche"
  ],
  "__v": 3
}