{
  "hash": "3597f62d8519ca5d23d7c6bef0dfe4dd9885fb5a",
  "title": "Beetroot chocolate cake",
  "image": "",
  "href": "http://www.bbc.co.uk/food/recipes/beetroot_chocolate_cake_82388",
  "extension": "Chrome",
  "firstAdded": "2015-09-10T19:39:46.990000",
  "users": [
    null
  ],
  "keywords": [
    "goz",
    "butter",
    "extra",
    "greasing",
    "beetroot",
    "dark",
    "chocolate",
    "cocoa",
    "solids",
    "hot",
    "espresso",
    "plain",
    "flour",
    "heaped",
    "baking",
    "freerange",
    "eggs",
    "separated",
    "golden",
    "caster",
    "sugar",
    "crme",
    "frache",
    "double",
    "cream",
    "serve"
  ],
  "directions": [
    "0",
    "Preheat the oven to 180C/350F/Gas 4. Grease a 20cm/8in cake tin with a little butter and line the bottom of the tin with a disc of baking parchment.",
    "Blend the beetroot in a food processor to a rough purée.",
    "Melt the chocolate in a bowl suspended over a pan of hot water (do not allow the bottom of the bowl to touch the water), then pour in the hot coffee. Technique: Melting chocolate Watch technique 1:06 mins",
    "Stir in the butter in small pieces and leave to soften. Remove from the heat and allow to cool slightly.",
    "Meanwhile, sift the flour, baking powder and cocoa together in a bowl and set aside.",
    "Separate the eggs. Whisk the yolks in a bowl until frothy. Stir the eggs into the chocolate and butter mixture, then fold in the beetroot. Technique: How to separate eggs Watch technique 0:58 mins",
    "Whisk the egg whites until still peaks form when the whisk is removed. Fold in the sugar. Technique: Whisking egg whites Watch technique 0:59 mins",
    "Fold the sugar and egg whites into the chocolate mixture, then fold in the flour and cocoa mixture. Technique: Folding Watch technique 0:35 mins",
    "Pour the batter into the prepared tin and bake for 40 minutes, or until a skewer inserted into the cake comes out clean. Technique: Testing to see if a cake is cooked Watch technique 0:29 mins",
    "Allow to cool in the tin, then serve with crème fraîche or double cream."
  ],
  "ingredients": [
    "0",
    "200g/7oz butter, plus extra for greasing",
    "250g/9oz cooked and peeled beetroot",
    "200g/7oz dark chocolate (70% cocoa solids)",
    "4 tbsp hot espresso",
    "135g/5oz plain flour",
    "1 heaped tsp baking powder",
    "3 tbsp cocoa powder",
    "5 free-range eggs, separated",
    "190g/6½oz golden caster sugar",
    "crème fraîche or double cream, to serve"
  ],
  "__v": 1
}