{
  "hash": "25842fa526c04f3365eef91d1dd29c3482ad6b7d",
  "title": "Scotcheroos (Rice Krispies with Peanut Butter, Butterscotch & Chocolate)",
  "image": "//images.food52.com/TFi2YF4xDGY4PC6AP-9OAw1ozHw=/753x502/a126d2c1-3f26-48ba-ac7e-5f1941762da0--4f0cd34d-4c26-4109-b54e-fe44ac1bd951-DSC_0388.JPG",
  "href": "http://food52.com/recipes/38091-scotcheroos-rice-krispies-with-peanut-butter-butterscotch-chocolate",
  "extension": "",
  "firstAdded": "2015-09-19T08:16:02.224000",
  "users": [
    null
  ],
  "keywords": [
    "sugar",
    "light",
    "corn",
    "syrup",
    "creamy",
    "peanut",
    "butter",
    "rice",
    "krispies",
    "cereal",
    "semisweet",
    "chocolate",
    "chips",
    "butterscotch"
  ],
  "directions": [
    "0",
    "Measure out all your ingredients and have them at the ready. Line a 9- by 13-inch pan with parchment and lightly grease the parchment.",
    "In a small saucepan, combine the sugar and the corn syrup. Stir to form a grainy paste. Bring to a boil and cook until the sugar dissolves and large bubbles form across the surface. Remove from heat and quickly stir in the peanut butter. Mix well.",
    "Measure the Rice Krispies into a large mixing bowl and pour the peanut butter mixture over top. Stir to coat evenly. Pour the cereal mixture into your prepared pan.",
    "Wet your hands and press the cereal mixture evenly and firmly into the pan.",
    "In a medium heatproof bowl, combine the chocolate and butterscotch chips and microwave in 30-second increments until melted. Stir between each 30-second increments (it usually takes a total of about 1 1/2 minutes). Stir to ensure the chocolate is all melted smoothly.",
    "Pour the chocolate mixture over the top of the cereal. Use a spatula to smooth the chocolate layer.",
    "Let the bars cool at room temperature or in the refrigerator for at least an hour to firm up. Slice and eat!"
  ],
  "ingredients": [
    "0",
    "1 cup sugar",
    "1 cup light corn syrup",
    "1 cup creamy peanut butter",
    "6 cups Rice Krispies cereal",
    "1 cup semisweet chocolate chips",
    "1 cup butterscotch chips"
  ],
  "__v": 1
}