{
  "hash": "bba7776c1e70b1b061d8e22f79144414d23ef980",
  "title": "How to Make Smoked Coconut Gouda",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2013/12/smoked-coconut-gouda-sliced.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/how-to-make-smoked-coconut-gouda/",
  "extension": "",
  "firstAdded": "2015-04-01T06:39:27.736000",
  "users": [
    null
  ],
  "keywords": [
    "fat",
    "coconut",
    "milk",
    "pays",
    "best",
    "quality",
    "recipe",
    "lemon",
    "juice",
    "smoke",
    "water",
    "vegemite",
    "marmite",
    "vegan",
    "worcestershire",
    "salt",
    "nutritional",
    "yeast",
    "agar",
    "concentrated",
    "potato",
    "starch",
    "cornstarch",
    "arrowroot",
    "tapioca",
    "dry",
    "pectin",
    "xanthan",
    "gum"
  ],
  "directions": [
    "0",
    "Blend coconut milk, water, agar powder, pectin, liquid smoke, salt, vegemite (or substitutes above), and nutritional yeast until fully combined in your blender.",
    "Heat this mixture in a small saucepan over medium high heat, stirring constantly, until it all comes to a boil.",
    "Reduce heat to medium (still boiling) and continue to stir for 5 more minutes. Remove from heat. Have your tapioca starch, potato starch and xanthan gum mixed all together in a small container. This is your powder mixture.",
    "Quickly and carefully pour hot cheez mixture into your power blender or food processor.",
    "Add your powder mixture from above and promptly process until thick, scraping down sides if necessary.",
    "Immediately pour into a lightly oiled container and use a silicone (or other) spatula to scrape it out. I used a small round glass container, but an 8 or 9 inch round pie or cake tin. Put the uncovered Smoked Coconut Gouda in the fridge.",
    "Allow to set up for an hour or two. Turn out onto a plate and leave uncovered for an additional 5 hours or overnight in the fridge. The cheese gets firmer the longer it sets. Once firm, store the cheese in a covered container and use or freeze within the week."
  ],
  "ingredients": [
    "0",
    "1 can full fat coconut milk (it pays to go with the best quality in this recipe)",
    "1 T. lemon juice",
    "1 T. liquid smoke",
    "1/4 C. water",
    "1/2 t. vegemite, marmite or vegan worcestershire sauce",
    "2 t. sea salt",
    "2 T. nutritional yeast",
    "2 T. agar powder or 8 T. of agar agar flakes (the powder is much more concentrated)",
    "2 T. potato starch, cornstarch or arrowroot",
    "1 T. tapioca starch",
    "1 T. dry pectin",
    "1 t. xanthan gum"
  ],
  "__v": 1
}