{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 350. Line two baking sheets with parchment.",
    "Cream butter, peanut butter and sugar together until lightened.",
    "Add egg, beat to combine, then add vanilla bean. Beat well until combined and lightened.",
    "Sift together flour, baking soda and salt. Fold into butter mixture thoroughly, but gently.",
    "Place rounded teaspoons of dough on the sheet pan, about 2\" apart, and press down gently with a fork or with two floured fingers.",
    "Bake about 10-12 minutes, until barely golden on top, and golden brown on the bottom. The cookies will be very soft, so don't fuss with them until they cool.",
    "Allow the cookies to cool completely while you make the sandwich cream.",
    "1",
    "Beat the sugar, butter and peanut butter together.",
    "Stir in vanilla and chocolate. Add cream until smooth enough to spread.",
    "Put the little cookies together, gluing one half to the other with a very generous schmear of sandwich cream. If you are very lucky, there will be broken halves, or uneven numbers - as that means a little snack for the baker."
  ],
  "firstAdded": "2014-08-17T11:11:42.402000",
  "hash": "52b6c167afc7b7b4ed73d3f56d35c5052e145291",
  "href": "http://food52.com/recipes/2253-all-i-want-for-christmas-peanut-butter-cookies",
  "image": "https://d2k9njawademcf.cloudfront.net/indeximages/22159/original/100411-food52-4.jpg?1403261924",
  "ingredients": [
    "0",
    "6 ounces unsalted butter, best quality",
    "3/4 cups creamy peanut butter (I use Jif - do not use natural peanut butter)",
    "1/2 cup light brown sugar",
    "1/2 cup white sugar",
    "1 egg",
    "1/2 vanilla bean, scrape seeds",
    "2 cups all purpose flour",
    "1/2 teaspoon baking soda",
    "1/4 teaspoon salt",
    "1",
    "8 tablespoons butter",
    "2 cups confectioners sugar",
    "1 cup creamy peanut butter",
    "1 cup finely chopped semisweet chocolate or miniature chips",
    "4-6 tablespoons heavy cream",
    "1/2 teaspoon vanilla extract"
  ],
  "keywords": [
    "unsalted",
    "butter",
    "best",
    "quality",
    "creamy",
    "jif",
    "use",
    "natural",
    "peanut",
    "light",
    "brown",
    "sugar",
    "white",
    "egg",
    "vanilla",
    "bean",
    "scrape",
    "seeds",
    "purpose",
    "flour",
    "baking",
    "soda",
    "salt",
    "confectioners",
    "semisweet",
    "chocolate",
    "miniature",
    "chips",
    "cream"
  ],
  "title": "All I Want For Christmas Peanut Butter Cookies",
  "users": [
    null
  ]
}