{
  "hash": "a34c7da727b5fba22b8157e15616a1eed1cf177e",
  "title": "KOSHARY",
  "image": "http://www.mattersofthebelly.com/wp-content/uploads/2016/11/koshary-25.jpg",
  "href": "http://www.mattersofthebelly.com/koshary-egypts-favourite-street-food/",
  "extension": "Chrome",
  "firstAdded": "2018-12-11T13:48:09.250000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "THE NIGHT BEFORE YOU COOK THE KOSHARY: Make sure you remember to soak the lentils in a big bowl of water the night before you want to cook the koshary. A minimum of 4 hours will work as well, so if you are short on time, soak them in the morning before cooking.",
    "FRY THE ONIONS: In a large pot, add vegetable oil until it reaches about 2 centimetres up the side of the pot. The amount of oil used will differ depending on the size of your pot. Place the pot on medium-high heat, and once the oil is hot (that takes about 2 minutes, you can test with one slice of onion; it should sizzle right away), add the sliced onions. Sprinkle with the salt and continue to fry the onions until deep golden brown, stirring them often so that they brown evenly. This takes about 7-10 minutes.",
    "Remove them from the oil with a slotted spoon and place them on a large plate lined with several layers of kitchen paper towels to drain the excess oil, and set aside. Tip: You want the onions to be nicely browned, but not burnt! Take them out slightly before you think they are ready, as they do continue to darken slightly after.",
    "There should still be plenty of oil left in the pot after frying the onions; do not discard it! Pour half of it into a smaller pot (the one you will be using to make the tomato sauce), and keep the rest in this large pot for making the koshari base (next step).",
    "MAKE THE KOSHARY BASE: In the same pot you fried the onions, while the oil is still hot, add the soaked, rinsed & drained lentils. Stir them for 2 minutes, then add the washed, drained rice. Stir for a further 2 minutes to toast the grains nicely, then add the water and salt.",
    "Bring to a full boil on high heat, then turn down the heat to the lowest possible setting and cover the pot (if you have a metal heat diffuser, place that under the pot for more even cooking). Cook for 30-40 minutes, until everything is soft and cooked through but still holds its shape. I like to give the mixture a stir just once, halfway through the cooking time, but it isn’t necessary.",
    "MAKE THE TOMATO SAUCE: Meanwhile, as the rice & lentils cook, make the tomato sauce. Place the smaller pot where you added half the oil from the onions on medium heat. Add the garlic, and cook for just a minute until fragrant, then add the tomato paste and cook for 2-3 minutes.",
    "Add the water, then add the rest of the ingredients for the sauce. Bring to a simmer and cook, partially covered for about 20 minutes, until thickened slightly. Taste and adjust seasoning as needed.",
    "MAKE THE DAKKA: Combine all the ingredients for the dakka in a jar or small bowl, mix and set aside.",
    "BOIL THE PASTA: Cook the pasta in plenty of water according to packet instructions, then drain and toss with a tablespoon of oil to prevent the from sticking to each other.",
    "TO ASSEMBLE THE KOSHARY: When it is time to serve the koshary, it is best done in a banquet style; I like to lay out all the components and people get to construct their own bowl according to preference. The usual serving order is as follows: in a bowl, start with the rice & lentils as the base, then add some pasta, then chickpeas, a little dakka (a little goes a long way!), some tomato sauce then fried onions to top it off. Serve hot!"
  ],
  "ingredients": [
    "0",
    "FOR THE FRIED ONIONS",
    "• neutral vegetable oil as needed (I use light,refined olive oil)",
    "• 3 brown onions, thinly sliced into half-rings",
    "• ½ tsp. salt",
    "FOR THE KOSHARY BASE",
    "• 250g brown lentils, soaked overnight or at least for 4 hours",
    "• 500g white rice (medium-short grain), washed 4 times & drained well*",
    "• 800ml water",
    "• 1.5 tsp salt",
    "FOR THE TOMATO SAUCE",
    "• 6 cloves garlic, minced",
    "• 500g tomato paste (salsa in Arabic)",
    "• 1L water",
    "• 1 tsp. ground cumin",
    "• 1 tsp. ground coriander",
    "• 1 tsp. chilli powder, optional",
    "• 1 tbsp. sugar",
    "• salt & pepper to taste",
    "• 3 tbsp. white vinegar",
    "FOR THE DAKKA",
    "• 3 cloves garlic, minced",
    "• 1 tsp. ground cumin",
    "• 1 tsp. ground coriander",
    "• ½ tsp. chilli powder",
    "• ½ tsp. salt",
    "• 3 tbsp. white vinegar",
    "• ¼ cup water",
    "• a squeeze of lemon juice",
    "TO SERVE:",
    "• 1 packet (500g) ditalini pasta, cooked according to packet instructions",
    "• 1 (400g) can of cooked chickpeas, rinsed and drained"
  ],
  "__v": 1
}