{
  "__v": 1,
  "directions": [
    "0",
    "In a medium bowl, whisk together the egg yolk, lemon juice, mustard, salt and 1 teaspoon cold water until frothy. Whisking constantly, slowly dribble in the oil until mayonnaise is thick and oil is incorporated. When the mayonnaise emulsifies and starts to thicken, you can add the oil in a thin stream, instead of drop by drop.",
    "YIELD 1 cup",
    "VARIATIONS FOOD PROCESSOR MAYO: In the bowl of a food processor, whip together the yolk, lemon juice, mustard, salt and 1 teaspoon cold water. With the motor running, slowly drizzle in the oil until mayonnaise is thick and oil is incorporated. This works best if you double the recipe.",
    "ELECTRIC MIXER MAYO: Double the ingredients for the mayonnaise and use an electric mixer instead of a whisk, dribbling the oil down the side of the bowl.",
    "FLUFFY WHOLE-EGG MAYO: Use a whole egg instead of just the yolk, and eliminate the water. This works best in the food processor or mixer.",
    "OLIVE OIL MAYO: Substitute extra virgin olive oil for all, or at least 1/2 cup, of the neutral oil.",
    "GARLIC AIOLI: Finely chop 2 garlic cloves and mash with a pinch of salt until it forms a paste; mix with egg yolk before adding oil. Substitute extra virgin olive oil for at least half ofthe neutral oil.",
    "ROUILLE: Combine a large pinch of crumbled saffron threads with 2 teaspoons boiling water. Let mixture cool completely. Whisk saffron water with 1 egg yolk, 2 teaspoons lemon juice, 2 finely chopped garlic cloves, 1/2 teaspoon tomato paste, 1/4 teaspoon salt and a pinch of cayenne. Whisking constantly, dribble in 1/2 cup extra virgin olive oil and 1/4 cup neutral oil until mayonnaise is thick and oil is incorporated.",
    "LIME PICKLE MAYO: Whisk in 2 tablespoons finely chopped lime pickle at the end. (Lime pickle can be found in Middle Eastern and Asian markets.)",
    "SRIRACHA MAYO: Whisk in 1 1/2 teaspoons sriracha, or more to taste, at the end.",
    "ANCHOVY MAYO: Whisk in 4 minced anchovies at the end.",
    "WALNUT MAYO: Substitute 1/3 cup walnut oil for an equal amount of the neutral oil.",
    "OLIVE OR CAPER MAYO: Whisk in 2 tablespoons chopped olives or capers at the end.",
    "SPICY CHIPOTLE MAYO: Whisk in 2 to 3 teaspoons chopped chipotle chile in adobo sauce at the end.",
    "ROSEMARY BLACK PEPPER MAYO: Whisk in 2 teaspoons chopped rosemary leaves and 1/2 teaspoon freshly cracked black pepper at the end. If you like you can add 1/2 teaspoon grated lemon zest and a minced garlic clove, too.",
    "SMOKY CHILE BACON MAYO: Fry 3 strips of bacon until crisp; chop and set aside. Pour the fat from the pan into a heatproof liquid measuring cup and add enough oil to make 3/4 cup total. Make mayonnaise, omitting mustard and using bacon fat-oil mixture. Stir in chopped bacon and 1/4 teaspoon hot smoked paprika at the end."
  ],
  "firstAdded": "2014-03-02T12:44:10.985000",
  "hash": "9611ee4452ba947dfc4758cf8616856e341c564c",
  "href": "http://www.nytimes.com/recipes/12459/mayonnaise.html",
  "image": "",
  "ingredients": [
    "0",
    "1 large egg yolk, at room temperature",
    "2 teaspoons lemon juice",
    "1 teaspoon Dijon mustard",
    "1/4 teaspoon kosher salt",
    "1 teaspoon cold water",
    "3/4 cup neutral oil such as safflower or canola"
  ],
  "keywords": [
    "egg",
    "yolk",
    "room",
    "lemon",
    "juice",
    "dijon",
    "mustard",
    "kosher",
    "salt",
    "cold",
    "water",
    "neutral",
    "oil",
    "safflower",
    "canola"
  ],
  "title": "Mayonnaise",
  "users": [
    null
  ]
}