{
  "hash": "3da6bee6be2d2e857ac7dc99ba11f9287261b8be",
  "title": "Vegetable Chow Mein Noodles",
  "image": "https://thewoksoflife.com/wp-content/uploads/2018/06/vegetable-chow-mein-15.jpg",
  "href": "https://thewoksoflife.com/2018/06/vegetable-chow-mein/",
  "extension": "Chrome",
  "firstAdded": "2019-03-29T20:52:52.313000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Bring 2 quarts of water to a boil (we use our wok because it heats quickly), and add the Hong Kong-style noodles. Fresh noodles should be boiled for about 1 minute. For dried noodles, boil for 2-3 minutes. Rinse in cold water and drain very thoroughly.",
    "Rinse the mung bean sprouts in cold water twice to ensure they are cleaned. Drain just before you are ready to cook the dish so they stay hydrated and crunchy.",
    "In a small bowl, mix the hot water and sugar, the soy sauces, sesame oil, 2 teaspoons Shaoxing wine and white pepper, and set aside.",
    "Place your wok over high heat, and add 2 tablespoons of oil to coat the wok. Spread the Hong Kong noodles in a thin, even layer, and let the noodles cook for 1-2 minutes. Adjust the heat lower if the noodles start to scorch or higher if the noodles are not turning golden brown.",
    "Flip the noodles over, and add another tablespoon of oil around the perimeter of the wok. Let the other side of the noodles crisp up. During this stage, the goal is to crisp and lightly brown the noodles as evenly as possible. After 90 seconds, flip the noodles again. Once they’re golden brown and crispy to your liking, gather the noodles to the middle of the wok and pour in the soy sauce mixture.",
    "Next use a upward scooping motion to mix the noodles until the noodles are coated, almost glazed in the soy sauce mixture – about 30 seconds.Transfer your noodles to a plate and set aside.",
    "Heat your wok once again over high heat, and add a ½ tablespoon of oil to coat the wok. Stir-fry the mushrooms for about a minute and transfer to a plate.",
    "Heat the wok over high heat, and add a final tablespoon of oil to coat the wok. Add the garlic. After 5 seconds, add the bok choy, the remaining 2 teaspoons of Shaoxing wine, and stir-fry for 1 minute.",
    "Add ¼ teaspoon salt, the MSG if using, and the oyster sauce, and continue to stir-fry for another 15 to 30 seconds.",
    "At this point. you can add the optional hot vegetable stock if you like a moist vegetable chow mein or skip to the next step if you like it crispy. Some folks like to eat this dish with dry and crispy noodles. Others like a softer, chewier noodle, so the decision is yours. If you use the extra stock or if the there is visible liquid cooking out of the vegetables, add in the water and cornstarch mixture to thicken the liquid into a thin sauce. Continue to stir fry on high heat for another 30 seconds.",
    "Your wok should be really hot at this point. Add the mushrooms and noodles back into the wok and toss everything together using a lifting motion (this aerates the dish, rather than gunking up the noodles) until the noodles, bok choy and mushrooms are well incorporated – about 30 seconds.",
    "Toss in the scallions and the mung bean sprouts, and stir fry for another 30-60 seconds, or until the mung bean sprouts are just cooked but still crunchy. Plate and serve your vegetable chow mein noodles with your favorite hot chili oil!"
  ],
  "ingredients": [
    "0",
    "8 ounces fresh thin Hong Kong Style Egg Noodles",
    "1½ cups mung bean sprouts",
    "1 tablespoon hot water",
    "¼ teaspoon sugar",
    "2 teaspoons soy sauce",
    "1 teaspoon dark soy sauce",
    "½ teaspoon sesame oil",
    "4 teaspoons Shaoxing wine, divided",
    "¼ teaspoon freshly ground white pepper",
    "4½ tablespoons vegetable oil, divided",
    "1½ cups (about 135 grams) beech mushrooms (or any other mushroom), sliced",
    "1 clove of garlic, minced",
    "3-4 cups (about 250 grams) of bok choy, cut into 3-inch pieces",
    "¼ teaspoon salt",
    "Pinch of MSG (totally optional)",
    "2 teaspoons vegetarian oyster sauce or regular oyster sauce",
    "¼ cup vegetable stock or water with salt according to taste(optional)",
    "2 teaspoons water, mixed with 1½ teaspoons cornstarch (optional if you add more stock for a moist chow mein)",
    "2 scallions, julienned"
  ],
  "__v": 1
}