{
  "hash": "1bf2482c9cfecf76a71d89c70984ae6edfc1c6fb",
  "title": "Chicken Piccata",
  "image": "http://www.platingsandpairings.com/wp-content/uploads/2014/12/Chicken-Piccata-4.jpg",
  "href": "http://www.platingsandpairings.com/chicken-piccata/",
  "firstAdded": "2015-01-19T05:24:00.301000",
  "users": [
    null
  ],
  "keywords": [
    "boneless",
    "skinless",
    "chicken",
    "breast",
    "halves",
    "horizontally",
    "pounded",
    "salt",
    "pepper",
    "allpurpose",
    "flour",
    "tbs",
    "olive",
    "oil",
    "unsalted",
    "butter",
    "garlic",
    "dry",
    "vermouth",
    "white",
    "wine",
    "lemon",
    "juice",
    "broth",
    "capers",
    "flatleaf",
    "parsley"
  ],
  "directions": [
    "0",
    "Season the chicken on both sides with salt and pepper. Place the flour in a shallow bowl and dredge the chicken in it. Shake off the excess.",
    "In a large frying pan over medium-high heat, warm 2 Tbs. of the olive oil. Place 2 pieces of chicken in the pan and cook, turning once, until browned on both sides, 2 to 3 minutes per side. Transfer to a platter and keep warm under a tent of foil. Warm the remaining 1 Tbs. oil in the pan and repeat to brown the remaining chicken. Place that chicken under your foil tent as well.",
    "Reduce the heat to medium and melt 1 Tbs. of the butter in the pan. Add the garlic and cook until golden brown, about 30 seconds. Add the wine, lemon juice and broth, increase the heat to medium-high and cook until the liquid is slightly reduced, about 5 minutes.",
    "Remove the pan from the heat and whisk in the remaining 2 Tbs. butter, the capers and parsley. Season with salt and pepper. Drizzle the sauce over chicken and serve immediately."
  ],
  "ingredients": [
    "0",
    "2 boneless, skinless chicken breast halves, cut in half horizontally and pounded ¼ inch thick",
    "Salt and freshly ground pepper, to taste",
    "½ cup all-purpose flour",
    "3 Tbs. olive oil",
    "3 Tbs. unsalted butter",
    "2 cloves garlic, thinly sliced",
    "¼ cup dry vermouth or white wine",
    "3 Tbs. fresh lemon juice",
    "¼ cup chicken broth",
    "2 Tbs. capers, drained",
    "2 Tbs. minced fresh flat-leaf parsley"
  ],
  "__v": 1
}