{
  "hash": "bb218a962cd15e4cc8cb14c261ad271838e03504",
  "title": "Brined Roasted Chicken and Vegetables",
  "image": "http://www.rachaelrayshow.com/images/recipes/10013BrineChicken800.jpg",
  "href": "http://www.rachaelrayshow.com/recipes/21933_brined_roasted_chicken_and_vegetables/",
  "extension": "Chrome",
  "firstAdded": "2016-06-06T05:12:34.338000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To brine the chicken, bring 2 quarts of water to a boil with the salt, light brown sugar, peppercorns and bay. Dissolve salt and sugar then remove from heat and add lemon juice. Add an equal amount of ice to the liquid to quick-cool the brine. Place chicken in a 2-gallon plastic food storage bag with a zip top, add the cooled brine then close bag, letting out excess air. Store in the lowest part of the refrigerator at least overnight or up to 2 days.",
    "Preheat oven to 425°F.",
    "In a roasting pan or on a rimmed baking sheet, toss vegetables with about 3 tablespoons olive oil, season liberally with salt and pepper. Place chicken on a roasting rack over the top of the vegetables or wipe an oven rack with olive oil and arrange chicken on the rack over the vegetables on the rack below. Roast chicken 45 minutes or until the internal temperature reaches 165°F. Let chicken rest then carve and serve with vegetables and drippings."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "For the Brine:",
    "1 cup Kosher salt",
    "1/4 cup light brown sugar",
    "1 teaspoon black peppercorn",
    "1 large fresh bay leaf",
    "Juice of 1 lemon",
    "1 to 2 3-pound chickens, spatchcocked (backbone removed) or left whole or 4 pieces of split breast and/or 4 dark meat quarters (leg and thigh attached)",
    "3 tablespoons olive oil",
    "Salt and pepper",
    "3 to 4 carrots or rainbow carrots, peeled and quartered lengthwise",
    "1/2 pound green beans or baby zucchini, halved",
    "3 large shallots, peeled and quartered lengthwise",
    "1 1/2 pounds baby Yukon Gold potatoes, halved"
  ],
  "__v": 1
}