{
  "hash": "c7a375b998263eddc2d41580878cbb8ea5dedf08",
  "title": "Κλάμπ Σάντουιτς με Κοτόπουλο",
  "image": "http://3.bp.blogspot.com/-53tSY4TAjx8/Uc0ToeLZVvI/AAAAAAAAKA0/NnqyYB57iZs/s400/club_el.jpg",
  "href": "http://eri-captaincook.blogspot.gr/2013/06/blog-post_28.html",
  "extension": "Chrome",
  "firstAdded": "2016-01-11T18:51:21.515000",
  "users": [
    null
  ],
  "keywords": [],
  "directions": [
    "0",
    "Τοποθετούμε ένα αντικολλητικό τηγάνι σε μέτρια προς δυνατή φωτιά και όταν το τηγάνι ζεσταθεί προσθέτουμε το bacon. Το αφήνουμε να ψηθεί καλά και απο τις δυο πλευρές να γίνει τραγανό. Όταν είναι έτοιμο, αφαιρούμε απο το τηγάνι και το αφήνουμε σε απορροφητικό χαρτί κουζίνας.",
    "Ψήνουμε τις φέτες ψωμιού είτε στο προθερμασμένο γκριλ και απο τις δυο πλευρές για 1-2 λεπτά είτε στην τοστιέρα μόνες τους να πάρουν χρώμα και απο τις δύο πλευρές.",
    "Σε ένα μπολάκι ανακατεύουμε τα υλικά της κρέμας φέτας και δοκιμάζουμε. Αν θέλουμε μπορούμε την κρέμα να την κάνουμε τυροκαυτερή προσθέτοντας λίγη καυτερή πιπεριά ή λίγο ταμπασκο.",
    "Αλατοπιπερώνουμε ελαφρώς τις ντομάτες και το αγγουράκι.",
    "τοποθετούμε δυο ψημένες φέτες στο ξύλο κοπής και αρχίζουμε και στήνουμε το κλαμπ.",
    "Αλείφουμε στις φέτες μια κουταλιά της σούπας (ίσως και λίγο παραπάνω) απο την κρέμα φέτας.",
    "Στην συνέχεια προσθέτουμε το αγγουράκι και απο πάνω το κοτόπουλο.",
    "Καλύπτουμε με άλλες δυο φέτες ψωμιού.",
    "Αλείφουμε τις φέτες απο πάνω με λίγη απο την πάστα ελιάς.",
    "Προσθέτουμε την ντομάτα, το μπέικον και το τυρί.",
    "Αλείφουμε τις δυο φέτες που περίσσεψαν με μουστάρδα απο την μία πλευρά και κλείνουμε τα σάντουιτς.",
    "Τοποθετούμε οδοντογλυφίδες στο κέντρο περίπου της κάθε πλευράς και κόβουμε με μεγάλο οδοντωτό μαχαίρι απο γωνία σε γωνία κρατώντας σταθερότητα με το χέρι μας.",
    "Σερβίρουμε με τηγανητές πατάτες ή σαλάτα!"
  ],
  "ingredients": [
    "0",
    "Υλικά για 2 κλαμπ σάντουιτς",
    "6 φέτες ψωμί για τόστ της αρεσκείας σας (χρησιμοποίησα ολικής και πολύσπορο)",
    "4 φέτες μπέικον",
    "3/4 της κούπας βραστό ή ψητό κοτόπουλο κομμένο σε φέτες.",
    "1/3 αγγούρι σε φέτες",
    "1/2 ντομάτα σε φέτες",
    "2 φέτες για τοστ κίτρινο τυρί της αρεσκείας σας",
    "2 κουταλάκια μουστάρδα",
    "2 κουταλάκια πάστα ελιάς (προαιρετικά)",
    "Για την σάλτσα φέτας",
    "1 κουταλιά της σούπας μαγιονέζα ελαιολάδου",
    "1 κουταλιά της σούπας γιαούρτι",
    "1/2 κούπα τριμμένο τυρί φέτα",
    "Λίγο ξύδι",
    "Πιπέρι κ ελάχιστο αλάτι"
  ],
  "__v": 1
}