{
  "__v": 1,
  "directions": [
    "0",
    "Method",
    "1. First make the chilli paste. Put the vegetable oil in a large, heavy-based saucepan. Heat over medium heat and then add the chillies, and onion. Sauté over low heat for about 10 minutes, stirring regularly. Add the crushed garlic cloves and sauté for five minutes until everything is very soft, being careful to make sure it doesn’t take on any colour. Put the contents of the saucepan into a food processor or blender and blitz until smooth. Store in the fridge in a sterilised jar. This makes about 190g.",
    "2. Next, make the tiger’s milk. Put the ginger, garlic, coriander and lime juice in a bowl. Stir and then leave to infuse for five minutes. Strain the mixture through a sieve into another bowl. Add half a teaspoon of salt and two teaspoons of the chilli paste and mix well. This will keep for four hours in the fridge.",
    "3. Wash the sliced red onion and then leave it to soak in iced water for five minutes. Drain thoroughly, spread out on kitchen paper or a clean tea towel to remove any excess water and then place in the fridge until needed. This will reduce the strength of the onions and help to keep them crisp.",
    "4. Cut the fish into uniform strips of around three by two centimetres. Place in a large bowl, add a good pinch of salt and mix together gently with a metal spoon. The salt will help open the fish’s pores. Leave this for two minutes and then pour over the tiger’s milk and combine gently with the spoon. Leave the fish to ‘cook’ in this marinade for two minutes.",
    "5. Add the onions, coriander, chilli and the cubed sweet potato to the fish. Mix together gently with the spoon and taste to check the balance of salt, sour and chilli is to your liking. Divide between serving bowls and serve immediately.TIPSKeep your fish refrigerated until just before using. We recommend using fine sea salt for making any kind of ceviche as it is higher quality than other salts and more beneficial in cold ‘cooking’.There are over 150 types of sweet potato in Peru with varying skin and flesh tones as well as degrees of sweetness; some are much nuttier in flavour. The best way to cook them is to bake them whole in the oven as you would a potato, although they also make very good chips."
  ],
  "firstAdded": "2014-06-26T10:41:08.143000",
  "hash": "bcac588c4def721bcc588e0ee6240fc74cc5d219",
  "href": "http://www.redonline.co.uk/food/recipes/sea-bass-ceviche",
  "image": "http://assets.redonline.co.uk/var/ezflow_site/storage/images/media/banners/article-banners/food/recipe-pics/sea-bass-ceviche-ceviche/5961888-1-eng-GB/sea-bass-ceviche-ceviche_article_banner_img.jpg",
  "ingredients": [
    "0",
    "Serves: 4",
    "Preparation time: 25 minutes",
    "You will need",
    "1 large red onion, very thinly sliced 600g sea bass fillet (or other white fish), skinned and trimmed A few coriander sprigs, leaves finely chopped 1 limo chilli, deseeded and finely chopped 1 sweet potato, cooked and cut into small cubes (see below) Fine sea salt For the basic chilli paste:",
    "1 tbsp vegetable oil 100g frozen or fresh deseeded chillies or 35g reconstituted deseeded and roughly chopped dried chillies ½ small onion, finely chopped 2 garlic cloves, crushed For the Amarillo chilli tiger’s milk:",
    "5mm piece of fresh root ginger, cut in half 1 small garlic clove, cut in half 4 coriander sprigs, roughly chopped Juice of 8 limes ½ tsp salt"
  ],
  "keywords": [
    "serves",
    "preparation",
    "time",
    "minutes",
    "need",
    "red",
    "onion",
    "bass",
    "fillet",
    "white",
    "fish",
    "skinned",
    "trimmed",
    "coriander",
    "sprigs",
    "leaves",
    "limo",
    "deseeded",
    "potato",
    "cubes",
    "salt",
    "basic",
    "chilli",
    "oil",
    "frozen",
    "reconstituted",
    "roughly",
    "chillies",
    "garlic",
    "amarillo",
    "tigers",
    "milk",
    "root",
    "ginger",
    "clove",
    "juice",
    "limes"
  ],
  "title": "Sea bass ceviche",
  "users": [
    null
  ]
}