{
  "hash": "a510fed2ef8d161996be3b420f1466ac40571039",
  "title": "Basic Scottish Shortbread from Brown Bag Recipe booklet from 1990",
  "image": "",
  "href": "http://www.amazon.com/gp/customer-reviews/R12WR6LLAOGMLJ/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B000DINFSS",
  "extension": "Chrome",
  "firstAdded": "2016-04-05T23:45:57.751000",
  "users": [
    null
  ],
  "keywords": [
    "soft",
    "butter",
    "sugar",
    "unsifted",
    "vanilla",
    "use",
    "bump",
    "purpose",
    "flour"
  ],
  "directions": [
    "0",
    "Spray your clean, dry and cool shortbread pan very lightly with a non-stick vegetable oil spray. Use a pastry brush if clumping occurs. Be sure to go up the sides of the pan! Set aside. (NOTE: I do NOT do this, any longer! Some of the sprays have a nasty taste that transfers to the shortbread. Instead, I use a pastry brush and use the wrapper from the butter to transfer the leftover bits of butter to grease the mold. It works beautifully!)",
    "Preheat oven to 325 F. degrees (162.8 C).",
    "In a medium-sized bowl, use a wooden spoon to cream butter in the bowl. Mix in the powdered sugar and vanilla and stir until well combined. Add the flour and cut into the butter mixture, using the wooden spoon to combine until it forms a ball of dough.",
    "With very lightly floured hands, take out dough ball and knead in your hands until smooth and plastic-feeling. It should NOT be sticky, at all!!!",
    "With your hands, patty-cake the dough into a round disk, making it easier to spread inside the pan. I manage to get it about 6\" across this way. Place the dough disk in the pan, and then with your fingers and palm, press the dough to the edges, making sure that it's of even thickness.",
    "Prick disk all over the top with fork tines. It can be a pattern or not; it doesn't matter.",
    "Bake your shortbread directly in the pan on the oven rack for 30-35 minutes or until the edges are light brown and the centre is a very pale golden brown.",
    "Immediately remove from oven and with a wooden utensil, slightly lift the edges of the shortbread, to make it easier in the long run. Set the timer for 10 minutes, make a pot of tea while the shortbread is cooling!",
    "Once the shortbread has set and cooled, use the same wooden tool to go back over the edges. Many times, my shortbread will lift completely up without having to give it a *wack*. If your shortbread is still in the pan, using a pot holder, grab the pan, tap it firmly on a wooden cutting board and it will fall out into your other hand. Place on cutting board and IMMEDIATELY cut into wedges!!!! The longer you wait, the harder it is to cut because it fractures into bits & pieces.",
    "-------------",
    "Update: Nov. 18, 2014: After 24 years of owning this booklet and having taken the time to add seven requested recipes, I felt it was HIGH TIME to make both this recipe and also the raspberry jam-filled shortbread. I am providing very detailed instructions on HOW TO SUCCEED with these recipes because the ones printed in the book will NOT work!!! I kept the original instructions below, for purists.",
    "-------------------------------------------------------------------------------------------------------------",
    "LEO'S SHORTBREAD",
    "Introduction from book: \"I made this recipe in the memory of my friend, Leo, and the wonderful cardamom scented, apricot studded tea bread he used to make.\"",
    "INGREDIENTS:",
    "1/2 Cup (4 oz. or 113 g.) Butter at Room Temperature",
    "1/3 Cup (1 3/4 oz. or 50 g.) Powdered Sugar, unsifted",
    "1/2 to 3/4 tsp. Ground Cardamom",
    "1 Cup (4 3/4 oz. or 135 g.) All Purpose Flour (I use King Arthur, exclusively)",
    "1/4 (3 oz. or 85 g.) Excellent quality Apricot Jam",
    "(My amended directions FOLLOW the creation of the dough. Also, I used 1/2 tsp. of cardamom and it was too light. I made it again and bumped it up to 1 tsp., which for our Scandinavian family, was perfect. Go light at first, and then increase each time you make it until you have the perfect ratio for your tastes.)",
    "MY AMENDED DIRECTIONS: (ORIGINAL instructions for using a mold follow, below)",
    "DIRECTIONS:",
    "Unless you plan on doubling the dough recipe, you will NOT have adequate dough to achieve this recipe using a shortbread pan! Believe me, I tried it today on my 9\" pan and 8\" pan with zero success! The dough recipe's yield 8 ounces of shortbread dough; divided in half, that leaves 4 ounces of dough. It is perfect for a 7\" circle but NOT the pan!",
    "So, before you make the dough, find SOMETHING in your home that is 7\" in diameter. It may be a bowl, a pot lid, the base of a vase...anything that you can use as a template to draw a 7\" circle onto a sheet of parchment paper. Use a Black Magic Marker that will create a very visible circle and trace the 7\" circular item onto the middle of the parchment. Now, flip the parchment over so that the dough does NOT come in contact with it's chemicals.",
    "Tear off two pieces of waxed paper, large enough to very adequately cover the 7\" circle: you will be rolling out your shortbread dough ONTO the waxed paper and assembling the filled shortbread on the parchment paper.",
    "Place the jam into a small saucepan, over low heat. Heat only long enough for it to spread out in the pan and become warm. Cover it up and set aside.",
    "Make your shortbread dough. Using a scale, divide the dough EXACTLY in half: this should yield 4 ounces for each top and bottom.",
    "Place the 1st sheet of waxed paper OVER the black circle on the parchment paper: you will be using the outline of the circle to measure your shortbread disk. I use this device >>Norpro 3077 Wooden Pastry and Pizza Roller on dough that needs to be rolled out like a pie crust. It is PHENOMENAL! Season it first with butter, rubbing it into the wood, allow to soak in, and then rinse off with hot water but NO SOAP! You want the wood to become impregnated with the oils from the butter so the roller does not stick.",
    "With one of the 4 ounces of soft, pliable dough, *patty-cake* it in your hands to get it as large and flat as you can. Place it in the centre of the waxed paper, over the circle outline. With the roller, lightly roll it OUTWARD, toward the edges with quick & light strokes. DO NOT ROLL IT BACK AND FORTH OR IT WILL PICK UP THE DOUGH!! Roll out the 1st of the dough disks; set aside. Repeat with the second disk, set aside.",
    "Flip the first circle of dough over onto your hand and gently peel off the waxed paper. Place it on the parchment in the circle outline. Take the still warm jam, and spoon it entirely in the centre of the disk. Then, with a spoon's back, spread the jam evenly throughout the circle, leaving a 1/2\" edge around the rim WITHOUT jam, so you can seal it tightly shut.",
    "After the jam has been applied, take the 2nd disk, flip it over onto your hand and gently place it over the 1st disk and jam; once in place, use your fingers to press down the edges. I make a *crimped edge* like a pie crust because it's pretty. Take a fork and prick ALL THREE LAYERS, down to the bottom, all over. This allows the heat to bake the bottom layer and for the moisture from the jam to escape.",
    "Place the cookie sheet in the preheated 325 degree oven and set your timer for 40 minutes. When the timer goes off, look at your shortbread: it should be the palest of fawn browns. Mine was done in 40 minutes exactly but other ovens may need more time.",
    "Take the cookie sheet out of the oven and carefully slide the parchment sheet WITH the shortbread attached, off of the cookie sheet and onto a wire rack to cool for 10 minutes. After the 10 minutes, cut into 8 wedges.",
    "*The jam filling will be HOT!!!!, so don't sample this right away!!! Place your hand over the shortbread and when it is only warm to the touch, it's safe to eat!",
    "*I hope that you benefit from my making sure that this recipe turned out stellar and enjoyable. It was very fun to make both jam-filled versions and the end result was enjoyed by my family inside of 30 minutes!",
    "ORIGINAL INSTRUCTIONS FROM BOOK:",
    "Using the reserved wrapper that your butter comes in, take a pastry brush and brush the remaining butter onto your shortbread pan. Set aside.",
    "Preheat oven to 325 F. degrees (162.8 C).",
    "In a medium-sized bowl, use a wooden spoon to cream butter in the bowl. Cream the powdered sugar with the butter until thoroughly combined.",
    "Add the cardamom to the flour, stirring to combine. Add the flour mixture to the butter mixture, 1/3 at a time, using the wooden spoon to cut the ingredients together until it forms a ball of dough on it's own.",
    "With very lightly floured hands, take out dough ball and knead in your hands until smooth and plastic-feeling. It should NOT be sticky, at all!!! When ready, divide the dough in half.",
    "With your hands, patty-cake the dough into a round disk, making it easier to spread inside the pan. I manage to get it about 6\" across this way. Place the dough disk in the pan, and then with your fingers and palm, press half of the dough to the edges, making sure that it's of even thickness.",
    "Heat the apricot jam in a small pan over low heat ONLY until it has melted for easy spreading but NOT HOT, otherwise, it will melt the butter in the shortbread! Spread the warm jam over the bottom layer of shortbread, leaving a 1/2\" border WITHOUT jam so it can be joined to the top layer.",
    "Lightly flour a piece of waxed paper (or parchment paper). Place the other half of the shortbread dough on it and carefully roll it out to roughly the size and shape of your shortbread pan. Now, place the rolled dough on top of the jam layer, and seal the edges as best you can so the jam does NOT leak out. Prick the shortbread all over the top with a fork, being sure to go through all three layers. It can be a pattern or not; it doesn't matter.",
    "Bake your shortbread directly in the pan on the oven rack for 40-45 minutes or until the edges are light fawn brown and the centre is the palest of fawn brown.",
    "Immediately remove from oven and with a wooden utensil, slightly lift the edges of the shortbread, to make it easier in the long run. Set the timer for 10 minutes, make a pot of tea while the shortbread is cooling.",
    "Once the shortbread has set and cooled, use the same wooden tool to go back over the edges. Many times, my shortbread will lift completely up without having to give it a *whack*. If your shortbread is still in the pan, using a pot holder, grab the pan, tap it firmly on a wooden cutting board and it will fall out into your other hand. Place on cutting board and IMMEDIATELY cut into wedges!!!! The longer you wait, the harder it is to cut because it fractures into bits & pieces.",
    "Enjoy!",
    "Reply to this post",
    "Permalink | Report abuse | Ignore this customer",
    "1 of 1 people think this post adds to the discussion. Do you? Yes No",
    "Posted on Nov 17, 2014 4:09:55 PM PST",
    "Pie Grrrl says:",
    "Here is the requested recipe for \"Chocolate Dipped Shortbread.\"",
    "I have never done this so I am copying the instructions straight from the cookbook with no annotations on my part. Good Luck!",
    "----------------------------------------------------------------------------------------------------------------------------------------------------------",
    "CHOCOLATE DIPPED SHORTBREAD:",
    "You can dress up shortbread by dipping pieces in melted chocolate. I dip half way up the point of wedge-shaped pieces so that much of the pretty relief still shows, and I usually dip only the backs of square pieces.",
    "The procedure is very simple. Just melt some good quality chocolate in a small pan over the lowest possible heat, stirring constantly. Place a large sheet of waxed paper on a cookie sheet. Brush any crumbs off the shortbread pieces and carefully dip them into the warm chocolate. Place each piece, chocolate side down, on the waxed paper to cool.",
    "When all of the pieces have been dipped, place the cookie sheet in the refrigerator to chill until the chocolate is nice and hard. Peel each coated cookie off the waxed paper and place in a air-tight container. Store the dipped shortbread's in the refrigerator. (This will keep the chocolate from developing an unattractive \"bloom.\")",
    "Remove the shortbread from the refrigerator half an hour before you plan to serve it so it can reach room temperature.",
    "Semi-sweet chocolate seems to complement shortbread better than does milk chocolate. All of the Classic Shortbread's and the Almond Shortbread are delicious dipped. You might try dipping Chocolate Shortbread in white chocolate for a truly elegant treat. Don't dip shortbread's with complex tastes.",
    "Reply to this post",
    "Permalink | Report abuse | Ignore this customer",
    "1 of 1 people think this post adds to the discussion. Do you? Yes No",
    "Posted on Nov 17, 2014 4:20:48 PM PST",
    "Pie Grrrl says:",
    "Yet another requested recipe: \"Almond Shortbread.\" I have not made this one; if I want almond-flavoured shortbread, I have just added almond extract to the Classic Shortbread recipe that I first posted.",
    "---------------------------------------------------------------------------------------------------------------------------------------------------------",
    "ALMOND SHORTBREAD",
    "INGREDIENTS:",
    "1/2 cup (4 ounces or 113 g.) very soft butter (1 stick of butter, save the wrapper to use the bits of butter to grease your mold)",
    "1/3 cup (1 3/4 ounces or 50 g.) Powdered Sugar, UNSIFTED! (I sift mine after measuring, to remove any clumps)",
    "1/2 tsp. Almond Extract",
    "1/4 Cup (1 1/2 oz. or 42 g.) Blanched Almonds",
    "1 cup, less 2 Tbs. (4 1/2 ounces or 106 g) All Purpose Flour, UNSIFTED! (I use King Arthur Flour, exclusively)",
    "DIRECTIONS:",
    "With your reserved butter wrapper, use a pastry brush to wipe the wrapper clean and butter the mold. Be sure to go up the sides of the pan and to get into every detail! Set aside.",
    "Preheat oven to 325 F. degrees (162.8 C).",
    "Put the almonds and 1/2 Cup of the flour into a food processor fitted with the steel blade. Grind the nuts to a fine meal, using off and on pulses. Add the rest of the flour to the processor, and pulse to mix thoroughly.",
    "In a medium-sized bowl, use a wooden spoon to cream butter in the bowl. Mix in the powdered sugar and almond extract and stir until well combined.",
    "Add the flour/nut mixture to the butter mixture, 1/3 at a time, using the wooden spoon to cut the ingredients together until it forms a ball of dough on it's own.",
    "With very lightly floured hands, take out dough ball and knead in your hands until smooth and plastic-feeling. It should NOT be sticky, at all!!!",
    "With your hands, patty-cake the dough into a round disk, making it easier to spread inside the pan. I manage to get it about 6\" across this way. Place the dough disk in the pan, and then with your fingers and palm, press the dough to the edges, making sure that it's of even thickness.",
    "Prick disk all over the top with fork tines. It can be a pattern or not; it doesn't matter.",
    "Bake your shortbread directly in the pan on the oven rack for 30-35 minutes or until the edges are light fawn brown and the centre is the palest of fawn brown.",
    "Immediately remove from oven and with a wooden utensil, slightly lift the edges of the shortbread, to make it easier in the long run. Set the timer for 10 minutes, make a pot of tea",
    "while the shortbread is cooling!",
    "Once the shortbread has set and cooled, use the same wooden tool to go back over the edges. Many times, my shortbread will lift completely up without having to give it a *whack*. If your shortbread is still in the pan, using a pot holder, grab the pan, tap it firmly on a wooden cutting board and it will fall out into your other hand. Place on cutting board and IMMEDIATELY cut into wedges!!!! The longer you wait, the harder it is to cut because it fractures into bits & pieces.",
    "Now, pour your beverage of choice, be it a tall glass of cold milk, a cuppa tea or coffee and feast on your shortbread! :)",
    "Reply to this post",
    "Permalink | Report abuse | Ignore this customer",
    "1 of 1 people think this post adds to the discussion. Do you? Yes No",
    "Posted on Nov 18, 2014 9:47:02 AM PST",
    "Pie Grrrl says:",
    "Hello, Fellow Shortbread Lovers! Here is the last recipe that was requested, the \"Millionaire's Shortbread\". I have NOT made this recipe, so I'm copying it verbatim from the book without any knowledge of how it turns out. Hope that you enjoy it!",
    "-----------------------------------------------------------------------------------------------------------------------------------------------------------------",
    "MILLIONAIRE'S SHORTBREAD RECIPE",
    "Introduction to the recipe: \"Traditionally this sublime confection consists of shortbread with a solid layer of toffee coated with chocolate. Truly, \"gilding the gilded lily\"...\"",
    "INGREDIENTS:",
    "1 Recipe for Classic Shortbread",
    "1 Cup, less 2 Tbs. (7 oz. or 198 g.) Granulated Sugar",
    "2 \"dashes\" of Cream of Tartar (NOTE: I looked it up, online, and a \"dash\" is equivelent to 1/8 tsp, so 2 dashes would equal 1/4 tsp.)",
    "1/2 Cup (4 fluid oz. or 120 ml.) Heavy Cream (Half & Half)",
    "4 Tbs. (2 oz. or 56 g.) Butter (I ONLY use Salted Butter, exclusively, so that I don't have to put \"salt\" back into the recipe. Also, a bit of salt enhances the 'sweet' in any recipe.)",
    "1/2 tsp. Vanilla Extract",
    "4 oz. Semi-Sweet Chocolate",
    "DIRECTIONS:",
    "Make the Classic Shortbread as directed. When it comes out of the oven, remove the shortbread from the pan as usual, but don't cut it into serving pieces. Allow it to cool completely. Cut strips of waxed paper and lay them over the edges of the shortbread pan, being sure to cover the rim completely. Return the baked shortbread to the paper-lined pan.",
    "Now make the toffee. Mix the sugar, cream of tartar, and cream in a small heavy sauce pan. Bring to a boil over medium heat, stirring constantly, and cook for 2-3 minutes. Add the butter; stirring well to combine.",
    "Continue to cook and stir the candy until it turns a pale brown and reaches the \"soft crack\" stage. This is 285 to 290 degrees on a candy thermometer. Another way to test for done-ness is to drop a small amount of the molten candy into a cup of ice water. If it hardens into a crunch blob, the candy is ready. Take the pan from the heat and allow it to cool for 2 minutes. Stir in 1/2 tsp. Vanilla extract.",
    "Now, pour the toffee onto the shortbread. You can use all of it if you like, or you can use a thinner layer and pour the balance of the toffee onto a buttered cookie sheet to be cut into individual candies later.",
    "Allow the toffee to cool until it is just warm to the touch. Turn the shortbread onto a cutting board and peel off the waxed paper strips.",
    "Using a serrated knife, slowly and carefully cut the shortbread into serving pieces. Turn the with the toffee side UP to cool completely.",
    "Melt the 4 ounces of good semi-sweet chocolate, NOT UNSWEETENED, in a small heavy pan over a tiny flame. Cool it slightly, then spread a layer of chocolate on the top of the toffee layer on the shortbread. Place the finished cookies, chocolate side UP, on a plate in the refrigerator to harden the chocolate.",
    "Remove the Millionaire's Shortbread from the refrigerator half an hour before you plan to enjoy them.",
    "When you serve these delicacies, turn the cookies over so that the choclate side is down and the pretty side is up. :D"
  ],
  "ingredients": [
    "0",
    "1/2 cup (4 ounces or 113 g.) very soft butter",
    "1/3 cup (1 3/4 ounces or 50 g.) Powdered Sugar, UNSIFTED!!!",
    "1/4 tsp. Vanilla extract (optional) ***Note: I always use this but bump it up to 1/2 teaspoon.",
    "1 cup (4 3/4 ounces or 135 g) All Purpose Flour, UNSIFTED!!!!"
  ],
  "__v": 2
}