{
  "__v": 1,
  "directions": [
    "0",
    "Tagliate la cipolla a fette e fatela stufare dolcemente in una casseruola. Aggiungete i fagioli e un mestolo di brodo vegetale: regolate di sale e pepe e fate sfaldare i fagioli (se occorre aggiungete altro brodo vegetale).",
    "Tagliate la pancetta a piccoli cubi e rosolatela dolcemente in una padella antiaderente: non appena sarà pronta, mettetela su un foglio di carta assorbente, lasciando il grasso nella padella.",
    "Mettete il peperoncino tagliato a pezzi grandi e la polpa di pomodoro nella padella, fate cuocere per 20 minuti e regolate di sale.",
    "Cuocete la pasta in abbondante acqua salata e, quando sarà ancora molto al dente, scolatela e tuffatela nella padella della salsa: amalgamate bene il tutto e aggiungete la pancetta. Mantecate a fiamma spenta e fate intiepidire in una ciotola.",
    "Nel frattempo frullate i fagioli aggiungendo se necessario del brodo vegetale. Regolate di sale e pepe.",
    "Ora siete pronti per servire: mettete la crema tiepida di fagioli sulla base del piatto, adagiate sopra la pasta e terminate con un’abbondante grattugiata di pecorino fresco."
  ],
  "firstAdded": "2014-10-07T21:47:03.733000",
  "hash": "9822d410911e77dd4842a039bc965aa8c42e39dd",
  "href": "http://www.foodloft.it/articolo/ricetta/pasta-e-fagioli-fredda/",
  "image": "http://www.foodloft.it/wp-content/uploads/2014/08/pasta-e-fagioli-fredda1-650x400.jpg",
  "ingredients": [
    "0",
    "300 g di mezze maniche",
    "250 g di fagioli cannellini cotti",
    "150 g di pancetta",
    "200 g di polpa di pomodoro",
    "150 g di pecorino fresco",
    "1 cipolla",
    "1 peperoncino",
    "brodo vegetale",
    "olio extravergine",
    "sale"
  ],
  "keywords": [
    "mezze",
    "maniche",
    "fagioli",
    "cannellini",
    "cotti",
    "pancetta",
    "polpa",
    "pomodoro",
    "pecorino",
    "fresco",
    "cipolla",
    "peperoncino",
    "brodo",
    "vegetale",
    "olio",
    "extravergine",
    "sale"
  ],
  "title": "Pasta e fagioli fredda",
  "users": [
    null
  ]
}