{
  "hash": "263c6791c5253a860100626b64ce1ac159133b58",
  "title": "Shaved Fennel Salad with Croutons and Walnuts",
  "image": "",
  "href": "https://www.bonappetit.com/recipe/shaved-fennel-salad-with-croutons-and-walnuts",
  "extension": "Firefox",
  "firstAdded": "2019-12-07T00:10:11.229000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400°. Place bread on one side of a rimmed baking sheet and walnuts on the other side (they cook at different rates). Drizzle bread with 3 Tbsp. oil; season with salt. Toss, squeezing bread with your hands to help it absorb as much oil as possible, until evenly coated. Bake until walnuts are golden brown and croutons are deeply browned and very crisp, 8–10 minutes for walnuts, 12–15 minutes for croutons. Let cool, then coarsely chop walnuts.",
    "Meanwhile, combine vinegar, garlic, and red pepper flakes in a medium bowl. Let sit 10 minutes to let garlic mellow and flavor the vinegar.",
    "Whisk 3 Tbsp. oil into vinegar mixture, then add croutons and chopped walnuts. Season crouton mixture with some salt and toss to coat and let croutons soften slightly; set aside.",
    "Photo by Stephen Kent Johnson, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiA kitchen towel is a great way to protect your hand from the sharp blade of the mandoline. Remove stalks and fronds from fennel bulbs. Remove fronds from stalks and coarsely chop; thinly slice stalks. Place in a large bowl. Cut fennel bulbs in half and thinly slice on a mandoline (if you have one; if not, practice your knife skills). Add to same bowl along with mint. Zest lemon half over salad, then squeeze in juice. Season with salt and toss to combine.",
    "Divide reserved crouton mixture among plates and top with half of the Parmesan. Arrange fennel salad over; top with remaining Parmesan and drizzle with oil.Read More: The 29 New Essential Recipes from the Bon Appétit Test Kitchen"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 cups coarsely torn sourdough bread",
    "½ cup walnuts",
    "6 Tbsp. extra-virgin olive oil, divided, plus more for drizzling",
    "Kosher salt",
    "3 Tbsp. sherry vinegar or red wine vinegar",
    "1 garlic clove, finely grated",
    "¼ tsp. crushed red pepper flakes",
    "2 fennel bulbs with fronds",
    "¾ cup torn mint leaves",
    "½ lemon",
    "2 oz. Parmesan, shaved"
  ],
  "__v": 1
}