{
  "hash": "e2f6639e299203dd30c9d991c896720eef883224",
  "title": "Steak, Tomato, and Okra Kebabs",
  "image": "http://www.epicurious.com/images/recipesmenus/2008/2008_june/242630.jpg",
  "href": "http://www.epicurious.com/recipes/food/views/steak-tomato-and-okra-kebabs-242630",
  "extension": "Chrome",
  "firstAdded": "2015-09-04T20:53:08.859000",
  "users": [
    null
  ],
  "keywords": [
    "shallot",
    "redwine",
    "vinegar",
    "dijon",
    "mustard",
    "sugar",
    "extravirgin",
    "olive",
    "oil",
    "divided",
    "inchthick",
    "boneless",
    "chuck",
    "blade",
    "called",
    "chicken",
    "steaks",
    "steak",
    "tips",
    "gristle",
    "trimmed",
    "necessary",
    "meat",
    "pieces",
    "tomatoes",
    "campari",
    "baby",
    "roma",
    "wide",
    "okra",
    "leaving",
    "tops",
    "intact"
  ],
  "directions": [
    "0",
    "Marinate steak: Whisk together shallot, vinegar, mustard, sugar, 1 tsp salt, and 3/4 tsp pepper. Add 1/2 cup oil in a slow stream, whisking until emulsified.",
    "Toss steak with 1/2 tsp salt, then marinate in a sealed bag with 6 Tbsp vinaigrette, chilled, turning bag occasionally, at least 2 hours. Chill remaining vinaigrette.",
    "Make kebabs: Prepare grill for direct-heat cooking over medium-hot charcoal (medium-high heat for gas).",
    "Meanwhile, toss tomatoes and okra with remaining 3 Tbsp oil and 1/4 tsp salt. Thread tomatoes onto 3 or 4 skewers. Thread okra crosswise onto pairs of parallel skewers, leaving small spaces between pieces. Put on a tray.",
    "Thread steak onto remaining skewers, leaving small spaces between pieces (discard marinade). Put on another tray.",
    "Oil grill rack, then grill steak skewers, covered only if using a gas grill, turning once, about 5 minutes total for medium-rare (about 8 minutes if using steak tips). Transfer to a platter. Drizzle with some of remaining vinaigrette while hot and let stand 5 minutes.",
    "Grill tomato and okra skewers, covered only if using a gas grill, turning occasionally, until tomatoes just begin to wilt and okra is tender, 8 to 10 minutes total. Transfer to platter with steak and serve with any remaining reserved vinaigrette.",
    "Cooks' notes: ·Steak can be marinated up to 24 hours.\n·Steak and vegetable skewers can be grilled in a hot oiled large (2-burner) ridged grill pan."
  ],
  "ingredients": [
    "0",
    "3 tablespoons finely chopped shallot",
    "3 tablespoons red-wine vinegar",
    "2 teaspoons Dijon mustard",
    "1/2 teaspoon sugar",
    "1/2 cup plus 3 tablespoons extra-virgin olive oil, divided",
    "2 pounds (1/2-inch-thick) boneless chuck blade steaks (sometimes called chicken steaks) or steak tips, gristle trimmed if necessary and meat cut into 2-inch pieces",
    "1 pound small tomatoes such as Campari or Baby Roma (about 2 inches wide)",
    "3/4 pound okra, trimmed, leaving tops intact"
  ],
  "__v": 1
}