{
  "hash": "ba88606c0121120774710fff712acb54ba5443f1",
  "title": "French Onion Soup",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2015/02/french-onion-soup-horiz-a-1600.jpg",
  "href": "https://www.simplyrecipes.com/recipes/french_onion_soup/",
  "extension": "Chrome",
  "firstAdded": "2018-02-08T13:31:53.426000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Caramelize the onions: In a 5 to 6 quart thick-bottomed pot, heat 3 tablespoons of olive oil on medium heat. Add the onions and toss to coat with the olive oil.",
    "Cook the onions, stirring often, until they have softened, about 15 to 20 minutes.",
    "Increase the heat to medium high. Add the remaining tablespoon of olive oil and the butter and cook, stirring often, until the onions start to brown, about 15 more minutes.",
    "Then sprinkle with sugar (to help with the caramelization) and 1 teaspoon of salt and continue to cook until the onions are well browned, about 10 to 15 more minutes.",
    "Add the minced garlic and cook for a minute more.",
    "2 Deglaze the pot with vermouth: Add the vermouth to the pot and scrape up the browned bits on the bottom and sides of the pot, deglazing the pot as you go.",
    "3 Add stock and seasonings: Add the stock, bay leaves, and thyme. Bring to a simmer, cover the pot and lower the heat to maintain a low simmer. Cook for about 30 minutes.",
    "Season to taste with more salt and add freshly ground black pepper. Discard the bay leaves. Add brandy if using.",
    "4 Toast French bread slices: While the soup is simmering, line a sheet pan with parchment paper or foil and preheat the oven to 450°F with a rack in the upper third of the oven.",
    "Brush both sides of the French bread or baguette slices lightly with olive oil (you'll end up using about a tablespoon and a half of olive oil for this).",
    "Put in the oven and toast until lightly browned, about 5 to 7 minutes. Remove from oven.",
    "Turn the toasts over and sprinkle with the grated Gruyere cheese and Parmesan. Return to oven when it's close to serving time and bake until the cheese is bubbly and lightly browned.",
    "5 Serve: To serve, ladle soup into a bowl and transfer one cheesy toast onto the top of each bowl of soup.",
    "Alternatively, you can use individual oven-proof bowls or one large casserole dish. Ladle the soup into the bowls or casserole dish. Cover with the toast and sprinkle with cheese. Put into the broiler for 10 minutes at 350° F, or until the cheese bubbles and is slightly browned."
  ],
  "ingredients": [
    "0",
    "6 large red or yellow onions (about 3 pounds), peeled and thinly sliced root to stem (see How to Slice an Onion), about 10 cups of sliced onions total",
    "4 Tbsp Olive oil",
    "2 Tbsp butter",
    "1 teaspoon of sugar",
    "Salt",
    "2 cloves garlic, minced",
    "8 cups of beef stock, chicken stock, or a combination of the two (traditionally the soup is made with beef stock)",
    "1/2 cup of dry vermouth or dry white wine",
    "2 bay leaves",
    "4 teaspoons of fresh thyme (can also use a few sprigs of fresh thyme) OR 1 teaspoon dried thyme",
    "1/2 teaspoon freshly ground black pepper",
    "2 Tbsp brandy (optional)",
    "8 inch-thick slices of French bread or baguette",
    "1 1/2 cups of grated Swiss Gruyere and a sprinkling of Parmesan"
  ],
  "__v": 1
}