{
  "hash": "d952aa4416b503f4a66bdaed35e667c940a4b113",
  "title": "Crispy Parmesan Potato Stacks",
  "image": "http://assets.simplyrecipes.com/wp-content/uploads/2016/12/06112725/2016-12-08-Potato-Stacks-12-2.jpg",
  "href": "http://www.simplyrecipes.com/recipes/crispy_parmesan_potato_stacks/",
  "extension": "Chrome",
  "firstAdded": "2016-12-08T23:08:58.998000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Preheat oven to 375F. Set an oven rack in the center position. Coat a standard 12-cup muffin pan with cooking spray or brush on a thin layer of oil.",
    "2 In a small bowl, mix olive oil, garlic powder and salt together. Set aside.",
    "3 Slice the potatoes: Rinse and scrub your potatoes. Slice each potato thinly, between 1/8 and 1/16-inch thick. I use a mandoline to get 1/16-inch thick slices.",
    "4 Assemble the potato stacks: Place 4 slices of potatoes at the bottom of each cup of the muffin tin. Using a silicone brush, lightly brush the potatoes with some of the oil mixture. Sprinkle some thyme leaves on top. Continue stacking several layers of potatoes, brushing the oil and sprinkling thyme leaves until you have stacked all the potato slices. Each muffin cup should be filled to the top with potato slices.",
    "Sprinkle half of the Parmesan evenly over the potato stacks.",
    "5 Bake the potato stacks: Bake the stacks for 30 minutes, then pull out the potatoes and sprinkle the remaining cheese on top. Bake another 5 to 15 minutes, depending on how brown and crispy you want them to be (35 to 45 minutes total).",
    "6 Transfer the stacks to plates or serving dish: Use a spoon to help release the potato stacks from the muffin pan. Season potato stacks with more salt and pepper, if you like. Serve immediately while hot and crispy."
  ],
  "ingredients": [
    "0",
    "2 1/2 tablespoons olive oil",
    "1/8 teaspoon garlic powder",
    "3/4 teaspoon salt",
    "1 3/4 pounds Yukon potatoes",
    "1/2 tablespoons fresh thyme leaves",
    "1/4 cup shredded Parmesan cheese",
    "12-cup muffin pan",
    "Silicone pastry brush"
  ],
  "__v": 1
}