{
  "hash": "68b5b72e38e9a35ed0de42d4e40255ff4a25a696",
  "title": "Middle Eastern roasted sprouts",
  "image": "//cdn.jamieoliver.com/recipe-database/335_448/0dcWEXzNK9OAGP-Xk-8fT5.jpg",
  "href": "http://www.jamieoliver.com/recipes/brussels-sprouts-recipes/middle-eastern-roasted-sprouts/",
  "extension": "Chrome",
  "firstAdded": "2016-12-30T07:38:59.157000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Method",
    "Preheat the oven to 200ºC/400ºF/gas 6.",
    "Bring a large pan of salted water to the boil over a medium-high heat. Wash and trim the sprouts, then add to the pan and parboil for 3 minutes. Drain in a colander and set aside to dry.",
    "Toast the cumin and coriander seeds in a small frying pan over a medium heat for 3 minutes, or until fragrant. Using a pestle and mortar, finely grind the toasted seeds with a pinch of sea salt.",
    "Tip most of the spice mix into a large roasting tray and toss in the sprouts.",
    "Peel and slice the onions, then trim and slice the fennel. Tip into the tray along with a glug of oil.",
    "Spread everything in an even layer – you may need two trays – and cook for 20 minutes, until tender and starting to caramelise.",
    "Meanwhile, return your frying pan to the heat and toast the sesame seeds and hazelnuts for 3 minutes, then grind up with the remaining spices, using a pestle and mortar.",
    "Combine the yoghurt with the tahini. Peel and crush the garlic and stir through, then finely grate in half the lemon zest and squeeze in half the juice (save the rest for another day).",
    "Taste the yoghurt and season well, then spread it evenly over the base of a large serving platter and sprinkle some sumac over the top.",
    "Spoon the sprout mix on top of the yoghurt mixture, scraping up the lovely crispy bits in the pan. Sprinkle the ground nuts and seeds over the top.",
    "Pick and finely chop the herb leaves, discarding the stalks. Scatter the leaves across the plate, then serve."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "500 g Brussels sprouts",
    "1 teaspoon cumin seeds",
    "2 teaspoons coriander seeds",
    "2 small red onions",
    "1 bulb of fennel",
    "olive oil",
    "1 teaspoon sesame seeds",
    "25 g hazelnuts",
    "200 g Greek yoghurt",
    "1 heaped teaspoon tahini",
    "1 small clove of garlic",
    "1 lemon",
    "1 pinch of sumac",
    "½ a bunch of fresh coriander, dill and mint (20g)"
  ],
  "__v": 1
}