{
  "hash": "1883cd7d6797b541a47ad1c6e72ecd99ab3317ec",
  "title": "BEST OVEN BAKED FRIES AND POTATO WEDGES",
  "image": "https://i2.wp.com/recipeslite.com/wp-content/uploads/2016/11/2-5-7-3-2_normal.1606051733.jpg",
  "href": "http://recipeslite.com/2016/11/best-oven-baked-fries-and-potato-wedges/",
  "extension": "Chrome",
  "firstAdded": "2016-12-23T14:27:17.385000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions :",
    "1",
    "OVEN: Heat oven to 450 degrees. Baking time is 35 minutes. No need to turn the fries!",
    "MAKING OVEN FRIES:",
    "Spray a foil lined baking sheet with cooking spray if you are using a regular cookie sheet. I use an Aire Gourmet baking sheet, and if you like these fries, it is worth the investment of buying one. Because olive oil does not smoke at high temperatures when using this baking sheet, and the fries are a gorgeous golden brown. (I prefer to use parchment paper, which I don’t grease, and it makes the removal of the fries a snap to prepare from oven to serving bowl.)",
    "2",
    "Soak the cut potatoes in ice water for at least 30 minutes. Don’t skip this step as it makes them crisp.",
    "3",
    "Blot cut potatoes on a clean tea towel to remove moisture.",
    "4",
    "Combine all dry ingredients in a plastic bag and combine with potatoes, tossing and kneading lightly to coat. Drizzle with one tablespoon of olive oil. Tossing and kneading again to coat.",
    "5",
    "Arrange potatoes in a single layer on the baking sheet and bake for 35 minutes or until golden brown. No need to turn potatoes during cooking. Be sure to check them often to see how they are doing. Remove any potatoes into a paper towel lined bowl that get done early so they don’t get over done. I also like to use parchment paper for easy cleanup! Enjoy!",
    "6",
    "MAKING POTATO WEDGES: Prepare your potatoes as you would for oven fries, except cut your potatoes into wedges and, follow the rest of the steps in the recipe. When it comes time to bake the wedges, put them on parchment paper to bake and allow a few minutes extra to make sure they are done. No need to turn during baking. Enjoy!",
    "7",
    "Here is how they look!",
    "8",
    "Cook’s Tip: Don’t throw out the leftover fries, or wedges! Wrap them in tinfoil and refrigerate. Leftover fries and wedges make great tasting eggs! Here is how I make mine. Chop up the leftover fries or wedges and lightly brown them in a little olive oil, turn them over and grate a little cheese over the hot potatoes. I use about 1 tablespoon sharp cheddar. Push the potatoes to the side of the skillet and add two eggs, scramble them and gently fold into the potatoes, cook a minute and flip them over, cook one minute more and turn out onto a plate. Add salt and pepper if desired. Good eating! Enjoy!",
    "9",
    "Update!",
    "Newest Version:",
    "When I am in a hurry, and we need potatoes really fast for a meal, I zap a large potato with peeling on in the microwave until almost done, then I cut it into chunks. I use a cast iron skillet and put olive oil in it, not much, put in the taters and season them with the same seasonings as the fries (except the parmesan cheese because it scorches) As soon as they are nicely browned, I remove them to a stainless steel bowl (it keeps them hot) and toss them with the parmesan cheese. Voila! You have delicious “roasted” potatoes with your meal. Great with bacon and eggs, too!"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 largebaking potatoes cut into strips about like the size of regular fries.",
    "after the potatoes are peeled and sliced, place them in a bowl of water with about two cups of ice cubes. soak for 30 minutes then pat dry with paper towels.",
    "it is important not to skip this step!",
    "place only dry ingredients in a plastic bag:",
    "1 Tbspgrated parmesan cheese from shaker",
    "use this same recipe for potato wedges below! great with fish!"
  ],
  "__v": 1
}