{
  "hash": "72a1a0194d968d12b1e593916d3d5e8bf8a9f29e",
  "title": "TSR Version of Applebees Tomato Basil Soup by Todd WIlbur",
  "image": "",
  "href": "http://www.food.com/recipe/tsr-version-of-applebees-tomato-basil-soup-by-todd-wilbur-450563",
  "extension": "Chrome",
  "firstAdded": "2017-02-24T02:25:26.043000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat 1 teaspoon of olive oil in a large saucepan over medium heat and then add onion and garlic.",
    "Saute for about 1 minute.",
    "Add crushed tomatoes and chicken broth and bring mixture to a boil, then reduce heat and simmer for 20 minutes.",
    "Turn off the heat and let mixture cool, uncovered, for 30 minutes or so.",
    "You can let it sit for as long as an hour, if you like.",
    "Pour approximately half of the tomato mixture into a blender.",
    "Put the lid on the blender and hold it down with a dish towel.",
    "Mixture may still be hot and you don't want the lid of the blender to pop off.",
    "Blend on high speed for about a minute, pour the mixture into a large bowl or pitcher, then add the rest of the mixture to the blender and blend on high speed for a minute.",
    "Pour all of the pureed tomato mixture back into the saucepan and then add the remaining ingredients.",
    "Bring the soup back up to a bubble then reduce heat and simmer for 20 minutes.",
    "Serve approximately one cup of soup with a garnish of 3 or 4 croutons on top and a sprinkling of shredded Parmesan cheese.",
    "Note- Be careful of what brand of canned tomatoes you use. Use one you know is good. I have made this twice now and when I used the Kroger brand tomatoes, it was excellent. When I used a name brand, it actually had a rather metallic taste to it from the canned tomatoes so be aware of the flavor of what you use in this since the tomatoes are the prominent flavor.",
    "Submit a Correction"
  ],
  "ingredients": [
    "0",
    "1 teaspoon extra virgin olive oil",
    "1⁄2 cup minced white onion",
    "1 teaspoon minced garlic",
    "2 (28 ounce) cans crushed tomatoes",
    "3 cups chicken broth",
    "3⁄4 cup heavy cream",
    "1⁄3 cup minced fresh basil (I used the squeeze basil found in the produce section)",
    "1⁄3 cup granulated sugar",
    "2 teaspoons minced fresh parsley",
    "1⁄4 teaspoon dried oregano",
    "1⁄4 teaspoon salt",
    "1⁄4 teaspoon ground black pepper",
    "Garnish",
    "seasoned croutons",
    "parmesan cheese"
  ],
  "__v": 1
}