{
  "hash": "f11d9fc5ad96764bbfafdd4c9144fd4024c957f3",
  "title": "Rustic Balsamic Garlic Chicken",
  "image": "http://i2.wp.com/honestandtasty.com/wp-content/uploads/2015/04/Balsamic-garlic-chicken-4.jpg?resize=650%2C433",
  "href": "http://honestandtasty.com/rustic-balsamic-garlic-chicken/",
  "extension": "Chrome",
  "firstAdded": "2016-06-22T20:08:21.885000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place pan on medium-high heat and add 2 tablespoons of olive oil (or 1 tablespoon of olive oil and 1 tablespoon of butter). Swirl it around.",
    "Add chicken breasts and then reduce heat to medium.",
    "Add ½ teaspoon salt and ¼ teaspoon pepper. Close lid for 4 minutes (depending on thickness of chicken breast).",
    "Flip chicken breasts and season opposite side with ½ teaspoon salt, ¼ teaspoon pepper, and the optional cayenne powder.",
    "Add 1 tablespoon of olive oil and close lid for another 4 minutes.",
    "Then turn heat to med-low, remove lid, and add the garlic.",
    "Sauté garlic for 30 seconds, just to get a touch of color and a bit of flavor.",
    "Add tomatoes.",
    "Add balsamic vinegar and ⅓ cup water. Cover and allow to simmer on medium heat until tomatoes are softened (about 5 minutes).",
    "Add lemon juice.",
    "Optional: Add in 1 tablespoon of butter right before serving to get a slight richness to the sauce.",
    "Serve over a bed of spinach and top with the balsamic-lemon sauce."
  ],
  "ingredients": [
    "0",
    "3 tablespoons Extra Virgin Olive Oil, divided (you can also substitute butter for olive oil, but do make sure to keep some olive oil in the pan to keep butter from burning during the cooking process)",
    "2 Boneless, Skinless Chicken Breasts",
    "1 teaspoon Sea Salt",
    "½ teaspoon Black Pepper",
    "¼ teaspoon Cayenne Powder (optional)",
    "5-6 cloves of Garlic, sliced",
    "3 firm and ripe medium Tomatoes of your choice, quartered",
    "⅓ cup Balsamic Vinegar",
    "Juice of 1 Lemon",
    "Optional: 1 tablespoon Butter to finish sauce",
    "2 large handfuls of Fresh Spinach, rinsed (you can also steam the spinach if you prefer)"
  ],
  "__v": 1
}