{
  "hash": "02fd4f10bd2e076256a873f849946c5dc22b497d",
  "title": "Spinach and Goat Stuffed Chicken Breast with Roasted Asparagus",
  "image": "http://www.theorganickitchen.org/blog-tutorials/wp-content/uploads/2014/02/IMG_8265.jpg",
  "href": "http://www.theorganickitchen.org/blog-tutorials/a-romantic-valentine-menu-for-two/",
  "extension": "Chrome",
  "firstAdded": "2017-02-14T12:06:04.561000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400 degrees and place rack in upper third of oven. Cover rimmed baking sheet with parchment paper",
    "Chicken Preparation",
    "Make cutlets by cutting breast in half width wise, placing between plastic or parchment paper and pounding with a rolling pin till chicken is about a ¼ inch thick (see photos).",
    "Season one side lightly with sea salt and pepper.",
    "Turn seasoned side down and use a spatula to spread soft goat cheese on unseasoned side.",
    "If goat cheese does not spread easily, it's ok. The cheese will spread out as it cooks.",
    "Top with chopped spinach. Roll up chicken breast and stuffing and place seam side down on parchment covered rimmed cookie sheet.",
    "If you can, place all chicken to one side of cookie sheet leaving room to add asparagus the last ten minutes of cooking. Place in oven and cook for 35 minutes. If chicken breast are really large you may need to cook 5 minutes longer. While chicken cooks prepare cream sauce and asparagus.",
    "Cream Sauce Preparation",
    "Place sauce pan on medium/high heat. Add butter, when melted, add flour and whisk until smooth.",
    "Slowly add cream while whisking. When cream thickens a bit, turn off heat. Add a few turns of freshly ground pepper, a few pinches of sea salt, lemon zest and chopped dill. (To zest a lemon use a microplane and scrape the skin until the white underneath shows, then move to a new area)",
    "Add capers and reheat right before serving. If sauce thickens too much just add a little more cream to thin it out.",
    "Asparagus Preparation",
    "Brush asparagus with olive oil, sprinkle with sea salt and pepper. Add to cookie sheet with chicken the last 10 minutes of cooking or use separate parchment covered cookie sheet.",
    "Place asparagus on plate, top with chicken. You can either leave the breast whole or slice into pinwheels so the stuffing can be seen. Drizzle with cream sauce, garnish with remaining chopped dill and serve!"
  ],
  "ingredients": [
    "0",
    "For Chicken:",
    "2 chicken breasts, cut in half and pounded into 4 cutlets",
    "sea salt",
    "freshly ground pepper",
    "8oz soft goat cheese, room temp (so it's soft and spreadable)",
    "1½ cups chopped spinach",
    "Cream Sauce:",
    "1 cup heavy cream",
    "1 Tablespoon butter",
    "2 teaspoon flour (corn starch, arrow root powder, whatever thickener you choose)",
    "1 Tablespoon fresh dill, chopped (pluse more for garnish if desired)",
    "Sea Salt",
    "Freshly ground pepper",
    "1 Tablespoon Capers",
    "1 teaspoon fresh lemon zest",
    "Asparagus:",
    "1 large bunch asparagus",
    "sea salt",
    "freshly ground pepper"
  ],
  "__v": 1
}