{
  "hash": "91c57592eadd32656f234aabbe001994cd2f0714",
  "title": "BAILEYS AND SALTED CARAMEL CHOCOLATE TRIFLE",
  "image": "http://www.essbeevee.com/images/blogspot/recipes/baileys_salted_caramel_custard_chocolate_trifle_brownies_3.JPG",
  "href": "http://www.essbeevee.co.uk/2015/12/recipe-baileys-and-salted-caramel.html",
  "extension": "Chrome",
  "firstAdded": "2018-11-22T09:31:28.933000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Put the custard in a saucepan and break the dark chocolate into it. Heat on a low heat and stir carefully until the chocolate has completely melted into the custard. Cover the surface to stop the custard forming a skin, then set aside to cool.",
    "Pop the brownies into the bottom of your trifle bowl, then drizzle about 6 tablespoons of Baileys over them to just about cover the base of the bowl.",
    "Use a rolling pin to bash the Maltesers and chocolate buttons in their bags or in a bowl, then sprinkle over the brownies.",
    "Once the custard is cool, spoon it over the top of the brownies and pop into the fridge to chill and set.",
    "Make your caramel using this method - in a saucepan, melt the butter and brown sugar together until combined, then add the condensed milk. Stir well until combined, add a healthy pinch of salt. Let the caramel come to the boil, then remove immediately from the heat and set aside to cool.",
    "Once the caramel is cool, pour over the top of the custard and pop the lot in the fridge until you're ready to serve.",
    "Add the cream just before you're ready to serve, but you can prep it the day before (like I did). Add the cream to a mixing bowl, sift over the icing sugar and pour in your 100ml of Baileys. Whip with an electric mixer until the cream stiffens into soft peaks - this will take a while to thicken because of the Baileys, but it'll get there.",
    "Spoon the cream over the caramel, and top with a few Maltesers and leftover chunks of brownies, if you have them.",
    "Serve immediately, but this will keep in the fridge for at least another day. Hello, leftovers."
  ],
  "ingredients": [
    "0",
    "500ml pot ready-made vanilla custard",
    "100g dark chocolate",
    "400g chocolate brownies (I bought a couple of tubs of the ready-made ones, but you could make them)",
    "100ml Baileys, plus about 6 tbsp extra for soaking the brownies",
    "121g bag Maltesers",
    "Handful of white chocolate buttons",
    "500ml double cream",
    "25g icing sugar",
    "1 tin condensed milk",
    "150g dark brown sugar",
    "150g butter"
  ],
  "__v": 1
}