{
  "hash": "5871f3561d80fb9d5e85f556fbd954568d8de90d",
  "title": "SALSA VERDE BAKED EGGS",
  "image": "https://reciperunner.com/wp-content/uploads/2018/03/Salsa-Verde-Baked-Eggs-Photograph-320x321.jpg",
  "href": "https://reciperunner.com/salsa-verde-baked-eggs/",
  "extension": "",
  "firstAdded": "2018-04-30T17:43:38.630000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Salsa Verde:",
    "Preheat oven to 425° F. Put the onion, jalapeño, and tomatillos on a rimmed baking sheet lined with foil. Drizzle with olive oil, season with salt and pepper and toss together until coated. Roast for approximately 10-15 minutes or until the vegetables are soft. Remove from the oven and let them cool for a few minutes.",
    "Add the roasted vegetables and the remaining ingredients to a food processor or blender. Pulse or blend until the salsa is mostly smooth. Taste for seasoning and set aside until ready to use.",
    "Baked Eggs:",
    "Adjust oven to 400° F. Spray a medium sized, oven safe skillet with cooking spray and pour in one cup of the salsa verde.",
    "Gently crack 4 eggs on top of the salsa and season with salt and pepper. Place the skillet into the oven and bake for 12-15 minutes or until the egg whites are cooked, but the yolks are still runny. Remove from the oven and top with the Cotija cheese then bake for another minute. Garnish with cilantro and serve immediately with warm corn tortillas.",
    "by Danae",
    "RECIPE NOTES",
    "If you can't find cotija cheese, queso fresco or Monterey Jack cheese would be a good replacement."
  ],
  "ingredients": [
    "0",
    "1 pound tomatillos, halved",
    "1/2 of a red onion, quartered",
    "1 jalapeño, deseeded and halved lengthwise",
    "2 teaspoons olive oil",
    "Kosher salt and fresh ground black pepper to taste",
    "1/2 teaspoon ground cumin",
    "1/2 of a lime, juiced",
    "1/4 cup cilantro, plus more for garnish",
    "4 eggs",
    "1/4 cup crumbled Cotija cheese"
  ],
  "__v": 1
}