{
  "hash": "ab78e844c582a281d9e652d1745f23faea928e3a",
  "title": "Grilled Japanese Eggplant with Tahini Sauce",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2014/07/grilled-japanese-eggplant-tahini-vert.jpg",
  "href": "https://www.simplyrecipes.com/recipes/grilled_japanese_eggplant_with_tahini_sauce/",
  "extension": "",
  "firstAdded": "2018-01-28T20:42:37.317000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Slice the Japanese eggplants in half, lengthwise. Using a sharp paring knife, score the inside surface of the eggplants in a cross hatch pattern, 1/2 inch deep. Lay in a tray and sprinkle the exposed, scored side with salt. Let sit at least 20 minutes (or up to an hour or more) while the grill is coming to temperature and while you make the tahini sauce. The salt will help draw out excess moisture from the eggplants.",
    "2 Prepare your grill for high, direct heat. While the grill is heating, prepare the tahini sauce.",
    "3 If you have a mini chopper, place all of the tahini sauce ingredients in it and pulse until smooth. If you don't have a mini chopper, mince the garlic and parsley very very fine, and then use a fork or a small whisk to whisk all of the ingredients together. (You can also use a mortar and pestle to grind the garlic with the salt and sugar until it is a smooth paste, then whisk together all of the ingredients.)",
    "4 When your grill is ready and hot, pat the eggplants dry with a paper towel, and brush the insides with olive oil. Place the eggplant halves cut-side down on the hot grill. Press them down a little so they make good contact with the grill. Grill on the cut side until well browned, about 3 to 5 minutes. When they are well seared on one side, flip them over and cook on the other side until the eggplants are cooked all the way through, another couple minutes or so. Brush again with a little olive oil.",
    "5 Remove from grill, place on a plate and serve with tahini sauce. Garnish with Thai basil."
  ],
  "ingredients": [
    "0",
    "4 Japanese eggplants (about 1 1/4 pound total)",
    "1 teaspoon Kosher salt",
    "3 Tbsp of olive oil",
    "1/4 cup roasted sesame tahini",
    "1/4 cup water",
    "1 teaspoon minced garlic",
    "2 Tbsp lemon juice",
    "1 Tbsp chopped parsley",
    "1/2 teaspoon sugar",
    "1/2 teaspoon Kosher salt",
    "Thai basil for garnish"
  ],
  "__v": 1
}