{
  "hash": "83c8ea9d48a1c9b21139cefb2b56a14fc3bcb590",
  "title": "Methi Dal",
  "image": "http://cdn.holycowvegan.net/wp-content/uploads/2015/03/methi-dal-2-680x768.jpg",
  "href": "http://holycowvegan.net/2015/03/methi-dal.html",
  "extension": "Firefox",
  "firstAdded": "2015-05-15T09:30:32",
  "users": [
    null
  ],
  "keywords": [
    "tuvar",
    "dal",
    "split",
    "pigeon",
    "peas",
    "masoor",
    "pink",
    "lentils",
    "bunches",
    "frozen",
    "using",
    "trim",
    "tough",
    "stems",
    "roots",
    "wash",
    "really",
    "surefire",
    "way",
    "make",
    "methi",
    "unappetizing",
    "leave",
    "grit",
    "leaves",
    "turmeric",
    "ginger",
    "green",
    "chilies",
    "slit",
    "middle",
    "garlic",
    "tamarind",
    "medium",
    "tomatoes",
    "oil",
    "mustard",
    "seeds",
    "salt"
  ],
  "directions": [
    "0",
    "In a pressure cooker, combine the dals, methi leaves, turmeric, ginger and green chillies. Bring the cooker to pressure and cook for 10 minutes (not all pressure cookers are the same so check your manufacturer's directions). If you don't have a pressure cooker, you can cook this in a sturdy pan on the stovetop. Cover the ingredients with water, bring to a boil, turn the heat down, and simmer about 30-40 minutes or until the dal is well-cooked and mushy and the leaves are tender.",
    "In a small saucepan, heat the oil.",
    "Add the mustard seeds and, when they sputter, add the garlic. Saute over medium-low heat until the garlic turns light blonde.",
    "Add the chopped tomatoes. Saute a couple of minutes or until the tomato breaks down just a little.",
    "Add the garlic and tomato mixture to the dal, along with the tamarind paste and salt to taste. Bring the dal to a boil and let it cook, for about 5 minutes. If the dal is too thick, add water.",
    "Turn off and serve hot over some rice or with rotis."
  ],
  "ingredients": [
    "0",
    "¾ cup tuvar dal (split pigeon peas)",
    "¾ cup masoor dal (pink lentils)",
    "2 bunches of methi leaves of about 3 cups frozen methi leaves. If using fresh, trim out the tough stems and roots and wash really well. If there is one surefire way to make methi unappetizing, it is to leave the grit in. Chop the leaves fine.",
    "½ tsp turmeric",
    "1 tsp grated ginger",
    "2 green chilies, slit down the middle",
    "8 large cloves of garlic, minced",
    "2 tsp tamarind paste",
    "2 medium tomatoes, finely diced",
    "1 tsp vegetable oil",
    "1 tsp mustard seeds",
    "Salt to taste"
  ],
  "__v": 1
}