{
  "hash": "3ca1424191b8ffd75aa5059895dbdce580bede4e",
  "title": "Spring Quinoa with Asparagus and Parmesan",
  "image": "http://thescrumptiouspumpkin.com/wp-content/uploads/2014/04/Spring-Quinoa-with-Asparagus-and-Parmesan.jpg",
  "href": "http://thescrumptiouspumpkin.com/2014/04/30/spring-quinoa-with-asparagus-and-parmesan/",
  "extension": "Chrome",
  "firstAdded": "2015-07-12T15:18:54.090000",
  "users": [
    null
  ],
  "keywords": [
    "organic",
    "broth",
    "extra",
    "virgin",
    "olive",
    "oil",
    "onion",
    "quinoa",
    "white",
    "wine",
    "asparagus",
    "trimmed",
    "quarterinch",
    "pieces",
    "crimini",
    "baby",
    "bella",
    "mushrooms",
    "stemmed",
    "parmesan",
    "salt",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "Place vegetable broth in a heat-safe bowl and microwave until hot but not boiling, about 2 minutes. Cover and set aside.",
    "Heat 1 tablespoon olive oil in a large saucepan over medium heat. Add the onion and sauté until lightly softened, about 5 minutes.",
    "Add another tablespoon olive oil along with the quinoa. Cook, stirring often, until quinoa is lightly toasted, about 2-3 minutes.",
    "Add the white wine and adjust the heat to a light simmer. Allow wine to cook and reduce, about 3-5 minutes.",
    "Pour about 2 ladles of the vegetable broth into the saucepan and allow it to simmer lightly, stirring often.",
    "When the broth has cooked down and reduced so that there is only about ⅓ of the broth left in the pot, add another 1-2 ladles of broth.",
    "Repeat this process, stirring often, until quinoa is cooked through, about 18-20 minutes. (A spiral germ will be visible around each individual grain when the quinoa is ready.)",
    "While the quinoa is cooking, heat one tablespoon olive oil in a sauté pan over medium heat. Add the asparagus and cook until lightly softened but still crisp, about 3- 4 minutes. Add the mushrooms and cook about 2 minutes longer, Season with salt and pepper and remove from heat.",
    "Add the asparagus and mushrooms to the quinoa, along with 1 cup grated parmesan. Also add 3 tablespoons olive oil. Stir until cheese is completely melted. Season to taste with salt and pepper. Serve immediately, topping each plate with additional parmesan."
  ],
  "ingredients": [
    "0",
    "2 cups organic vegetable broth",
    "3 tablespoons plus 3 tablespoons extra virgin olive oil",
    "1 small onion, diced",
    "1½ cups quinoa",
    "1 cup white wine",
    "8 ounces asparagus, trimmed and cut into quarter-inch pieces",
    "4 ounces crimini (\"baby bella\") mushrooms, stemmed and sliced",
    "1⅓ cups parmesan, freshly grated",
    "Salt and freshly ground black pepper"
  ],
  "__v": 1
}