{
  "hash": "a379fdfc0a14669355ed217766c698ba9fceabfc",
  "title": "Tarhonya z wołowiną (Węgry",
  "image": "//static.smaker.pl/photos//a/a/e/aae1e7948f87b97f2ee7f321b38eb4c4_351022_5249afc57157f_wm.jpg",
  "href": "http://smaker.pl/przepis-tarhonya-z-wolowina-wegry,102259,wiech-k.html",
  "extension": "",
  "firstAdded": "2016-09-17T20:34:42.927000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Na stolnicę (blat) wysyp mąkę, posyp solą, zrób zagłębienie i wbij w nie jajka. Dodaj tłuszcz i wyrób twarde, gładkie ciasto.",
    "Odstaw na minimum godzinę, aby wyschło.",
    "Ponieważ ciasto nie chciało schnąć, podzieliłem je na mniejsze kawałki, aby szybciej wyschło.",
    "Wyschnięte ciasto zetrzyj za pomocą tarki o grubych oczkach na posypaną mąką stolnicę. Ja użyłem ręcznej maszynki do tarcia serów (posypując w trakcie przecierania mąką).",
    "Odstaw do wyschnięcia - najlepiej na całą noc.",
    "Ponieważ nie miałem tyle czasu, wysuszyłem torhanya w piekarniku (30 stopni, termoobieg, uchylone drzwiczki). Po dwóch godzinach był gotowy.",
    "Wyszło go trochę więcej niż potrzebowałem, więc reszta w pojemniczku powędrowała do szafki - będzie jak znalazł do bograczu.",
    "W czasie, kiedy makaron schnie, przygotuj wołowinkę. Pokrój umyte i osuszone mięso w cienkie plasterki, lekko rozbij (jak na bitki), posyp delikatnie pieprzem i obsmaż na dość dużym ogniu.",
    "Zdejmij z ognia i dodaj łyżeczkę słodkiej papryki. Dokładnie wymieszaj.",
    "Zmniejsz ogień, podlej niewielką ilością wody i duś pod przykryciem do miękkości - ok. 1 - 1,5 godziny.",
    "Dodałem własnej produkcji \"bulionetki\", ale nie jest to konieczne.",
    "W trakcie duszenia podlewaj (jeżeli trzeba) wodą.",
    "Kiedy mięso będzie miękkie dodaj posiekaną drobno cebulę i czosnek. Podsmaż, aż cebula się zeszkli.",
    "Wsyp tarhonya - ok. 1,5 szklanki na 4 osoby - dodaj dwa razy tyle wody. Lekko osól i gotuj na małym ogniu pod przykryciem ok. 7 - 10 minut, aż makaron będzie \"al dente\".",
    "Podawaj posypane siekaną natką."
  ],
  "ingredients": [
    "0",
    "Tarhonya - węgierski makaron w typie naszych zacierek. Twardy, suszony, z dużą ilością jajek. Powszechnie stosowany do bograczu czy zupy gulaszowej. Podawany również jako oddzielne danie. W tym wypadku z duszoną wołowiną.",
    "Składniki",
    "Tarhonya:",
    "pół kg mąki pszennej",
    "pół łyżeczki soli",
    "4 duże jajka",
    "5 dag tłuszczu - w oryginale smalcu, ja dałem oliwę.",
    "Duszona wołowina:",
    "ok. 30 - 40 dag wołowiny",
    "2 cebule",
    "4 ząbki czosnku",
    "łyżeczka słodkiej, mielonej papryki",
    "dodałem \"bulionetkę*\" do sosów - 2 kostki",
    "łyżka smalcu lub oleju",
    "pół pęczka natki",
    "* - zobacz inne moje przepisy"
  ],
  "__v": 1
}