{
  "hash": "6036d77b09d01d9a090a44eed5910cbb4b157c9f",
  "title": "суп Фо",
  "image": "https://cs11.pikabu.ru/post_img/2018/12/07/7/1544180930192497026.jpg",
  "href": "https://pikabu.ru/story/moy_lyubimyiy_sup_fo_6335938",
  "extension": "Chrome",
  "firstAdded": "2019-08-21T12:32:06.429000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Как готовить:",
    "- Самым главным здесь есть бульон. Это база и основа. Сделаете бульон- 95% дела сделано. Имея замороженный бульон для Фо сам суп можно собрать за 5 минут. Я так собственно и делаю обычно.",
    "- Чтобы специи отдали все, что в них сокрыто их нужно прогреть. Для этого на сухой сковороде на небольшом огне прогрейте специи минут 5. Не уходите никуда и контрольте этот момент",
    "- Чеснок разрезать поперек пополам, луковицы вдоль, не очищая. Также поступить с имбирем.",
    "Обжечь все это счастье с помощью горелки до черноты. Если нет горелки, припечь можно на гриле, сковороде, в духовке или просто на открытом огне газовой плиты, наколов все это на вилку или шампур.. Просто в духовке на противне или под грилем. Я в этот раз половину обжег, а половину припек на сковороде-гриль. Именно вот такое обжигание усиливает сам вкус и цвет бульона.",
    "- Курицу разделать (или что там у вас), поместить в казан или кастрюлю и залить водой, чтобы покрыло на пару пальцев. Довести до кипения и дождаться пены. Пошевелить мясо, чтобы шум поднялся со дна. Проварить минуту-другую и слить всю воду. Тщательно промыть все мясо и кастрюлю. Вновь залить холодной водой (3,5- 4 литра) и на среднем огне довести до кипения.",
    "Если вдруг выступили остатки шума- снимите.",
    "- Добавить в бульон пряности и овощи\\корешки.",
    "- По-хорошему, такой бульон надо варить 6-8 часов. Но некоторые варят и как стандартный бульон- 1,5-2 часа. Я отношусь к такому делу ответственно и делаю так: довожу до кипения, ставлю минимальный огонь так, чтобы едва кипело под приоткрытой крышкой и варю 3-4 часа) смотря, какая попалась курица). Потом достаю мясо, обдираю с костей и возвращаю кости\\каркасы, крылья, шею и т.д. еще 2-3 часа. (Это мясо при подаче я не использую, а на утро готовлю с ним жареный рис в воке). В следующий раз хочу попробовать увеличить время и мясо ( у меня накопились лапы, шеи и каркасы) и попробовать часов 12. Интересно, насколько изменится результат.",
    "- За 10 минут до готовности подготовить все к сборке: лапшу сварить согласно упаковке. Я фунчозу просто замачиваю в кипятке на пару минут и кидаю в холодную воду. Потом кидаю на дуршлаг.",
    "- Зелени сделать рефреш для освежения и поместить ее на минут 10 в ледяную или сильно холодную воду. Зеленый лук я предварительно режу на куски, которые шинкую вдоль.",
    "- За два часа до готовности бульона кинуть мясо в морозилку, чтобы оно легче резалось тонко. Нарезать поперек волокон как можно тоньше. Мясо, напоминаю свежее.",
    "- Бульон снять с огня и профильтровать. Сделать это можно через сито, на которое с запасом выложена марля.",
    "- В готовый бульон добавить тростниковый или пальмовый сахар и рыбный соус. Попробовать. Если не хватает соли-посолить или добавить еще рыбного соуса. - Момент ИКС. Собираем. Тарелки обдать кипятком из чайника и быстро вытереть. По мискам или большим пиалам разложить лапшу, сверху -3-5 ломтиков мяса, крупно порванные листья мяты, базилика, кинзы. Зеленый лук, ростки сои, чили.",
    "- Залить все кипящим бульоном. Посыпать сверху дополнительно зеленым луком, чили, немного лепестков красного сладкого лука. Прибавить по вкусу Сирачи(шрирачи) и Кочудян (если используете). Выдавить ломтик лимона.",
    "- Для друзей или когда у меня есть настроение я использую вот такой вот девайс. В нем зимой делаю китайский ХоГо (китайский самовар). Вниз ставлю чайную свечку или сухое горючее, а наверх наливаю бульон. Сверху накрывается крышкой. Поэтому, когда надо- бульон чрезвычайно горячий. А стоит добавить еще один источник тепла и бульон уже кипит.",
    "- И да, дамы и господа, я понимаю, что с некоторыми продуктами могут возникнуть трудности и подчас они не продаются в обычных магазинах рядом с домом. Сейчас во время глобализации я что-то покупаю в азиатских точках на рынке или просто в магазинах, работающих национальными продуктами, часть заказываю в сети- и вот в сети есть все. У меня еще ни разу не было случая, чтобы я не нашел какой-то редкач в сети. Так что было бы желание."
  ],
  "ingredients": [
    "0",
    "3 звезды бадьяна",
    "- 2 палочки корня кассии или 1 корицы",
    "- 1 ч.л. зерен кориандра",
    "- 3-4 гвоздя гвоздики",
    "- половину чайной ложки фенхеля (у меня в этот раз кончился)",
    "- 12-15 сантиметровый кусок свежего имбиря",
    "- 50г тростникового или пальмового сахара",
    "-100 мл рыбного соуса",
    "- головка чеснока",
    "- 2 средних луковицы",
    "- 1 ст.л. черного перца горошком",
    "Для подачи:",
    "- По пучку свежего базилика, кинзы, мяты, зеленого лука",
    "- 1 свежий чили",
    "- половина лимона или лайма или того и другого. (может понадобиться меньше)",
    "- Плоская рисовая лапша Бан Фо. Мне не нравится здесь широкая лапша и я беру фунчозу. Она упругая, красивая и оверпросто готовится. На вкус все это не влияет, так что смотрите сами.",
    "- Свежая говядина: вырезка, лопатка или спинная часть. Без пленок, жил и прочей красоты.",
    "- ростки сои",
    "- совсем немного красного сладкого лука",
    "- Соус Сирача (Шрирача)."
  ],
  "__v": 1
}