{
  "hash": "b3e8da6f4117df0c6e1291b62664b6e142b40e83",
  "title": "VEGAN PUMPKIN MAC ‘N’ CHEESE",
  "image": "https://minimalistbaker.com/wp-content/uploads/2017/10/AMAZING-Pumpkin-Mac-n-Cheese-10-ingredients-cheesy-hearty-SO-delicious-vegan-plantbased-pumpkin-pasta-recipe-glutenfree-10.jpg",
  "href": "https://minimalistbaker.com/vegan-pumpkin-mac-n-cheese/",
  "extension": "",
  "firstAdded": "2018-04-30T16:53:00.462000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "If baking your pumpkin, preheat oven to 350 degrees F (176 C) and line a baking sheet with parchment paper. Otherwise, if using canned pumpkin puree, skip to step 4.",
    "Using a sharp knife, cut the tops of your pumpkin off and then cut pumpkin in half. Use a sharp spoon or ice cream scoop to scrape out all the seeds and strings. (Save the seeds for roasting!)",
    "Optional: Brush the flesh with a neutral, high heat oil, such as avocado. And place flesh down on the baking sheet.",
    "Bake for 45-50 minutes or until a fork easily pierces the skin. In the last 20 minutes of roasting, add the two cloves of garlic still in skin to the baking sheet to slightly brown and soften. Then remove pan from the oven and let the pumpkin cool. Also peel garlic cloves and set aside.",
    "If serving with pasta, start boiling water and cooking pasta at this time. Once pasta is cooked, drain and set aside. Optional: I like to drizzle mine with a little olive or avocado oil and a sprinkle of sea salt and vegan parmesan cheese for extra flavor.",
    "To make the sauce, add 2 cups baked pumpkin (or pumpkin puree) to a high-speed blender along with peeled roasted garlic, arrowroot starch, dairy-free milk (start with 1 cup or 240 ml), sea salt, sage or thyme (I used both), nutritional yeast, vegan parmesan cheese, pumpkin pie spice, and red pepper flake (optional).",
    "Blend on high until creamy and smooth. Then taste and adjust flavor as needed. Add more salt for saltiness, nutritional yeast for cheesiness, sage or thyme for herbiness, vegan parmesan cheese for depth of flavor, pumpkin pie spice for pumpkin flavor and warmth, or red pepper flake for spice (optional).",
    "To heat/thicken the sauce, pour into a rimmed skillet and heat over medium-low heat, whisking frequently until sauce is hot and slightly thickened - 3-5 minutes. If it gets too thick, thin with a bit more dairy-free milk.",
    "To serve, add cooked pasta to the sauce and toss to combine. Serve as is or (optional) sprinkle with 2 Tbsp (10 g) vegan parmesan cheese and broil on medium for 1-3 minutes, watching very carefully until barely browned.",
    "Enjoy hot and garnish with pine nuts or sautéed sage if desired. Cool leftovers and store in the refrigerator up to 3-4 days."
  ],
  "ingredients": [
    "0",
    "SAUCE",
    "1 (2-3-lb) sugar or pie pumpkin (or sub 2 cups (450 g) canned pumpkin puree*)",
    "optional: 1 Tbsp (15 ml) avocado or coconut oil",
    "2 cloves garlic (6 g or 1 Tbsp)",
    "2 Tbsp (14 g) arrowroot starch",
    "1-1 1/4 cup (240-300 ml) unsweetened plain almond or rice milk (start with 1 cup)",
    "1/2 tsp sea salt",
    "2-3 Tbsp (4-6 g) chopped sage or thyme (I used half thyme, half sage)",
    "4-5 Tbsp (12-15 g) nutritional yeast",
    "3-4 Tbsp (15-20 g) vegan parmesan cheese",
    "1/4 tsp pumpkin pie spice",
    "optional: 1/4 tsp red pepper flake or cayenne pepper",
    "PASTA",
    "10 ounces (283 g) gluten-free pasta (I love Bionaturae pastas and Trader Joe’s gluten-free fusilli)",
    "TOPPINGS optional",
    "Vegan parmesan cheese",
    "Fresh sage sautéed in oil over medium heat for 1 minute or until just slightly browned",
    "Pine nuts"
  ],
  "__v": 1
}