{
  "hash": "c2c8d734bec5d2ad1254267223d37a7e71770992",
  "title": "Stuffed Winter Squash",
  "image": "http://www.vancouversun.com/life/Recipe+Stuffed+Winter+Squash/11685596/cms/binary/11685597.jpg",
  "href": "http://www.vancouversun.com/life/Recipe+Stuffed+Winter+Squash/11685596/story.html",
  "extension": "Chrome",
  "firstAdded": "2016-01-31T19:11:40.672000",
  "users": [
    null
  ],
  "keywords": [
    "acorn",
    "delicata",
    "squash",
    "stem",
    "seeded",
    "olive",
    "oil",
    "rubbing",
    "oiling",
    "dish",
    "kosher",
    "salt",
    "chorizo",
    "sausage",
    "crumbled",
    "pieces",
    "leeks",
    "apple",
    "pepper",
    "tender",
    "greens",
    "spinach",
    "kale",
    "swiss",
    "chard",
    "ribbons",
    "sage",
    "leaves",
    "coarsely",
    "millet",
    "rice",
    "quinoa",
    "cheddar",
    "cheese"
  ],
  "directions": [
    "0",
    "Preheat the oven to 375 F. Rub the flesh of each squash half with olive oil, and oil an ovenproof dish or baking sheet. Sprinkle the whole baking dish with 1/2 tsp (2 mL) of the salt. Lay the squash flesh-side down in the dish and bake until it is very tender when pricked with a fork, 30 to 40 minutes. Remove the squash from the oven and raise the oven temperature to 425 F.",
    "Meanwhile, heat the remaining olive oil in a large skillet over medium heat. Add the chorizo and fry until browned. Remove from the pan and set aside. Add the leeks to the hot oil and cook until soft, about 3 minutes. Add the apple, remaining 1/4 tsp (1 mL) salt and pepper and cook for another minute. Add the greens, sage, cooked grains and reserved chorizo. Cook for another minute, stirring to combine and remove from heat. Taste and adjust the salt and pepper if needed.",
    "Turn the cooked squash over in the baking dish so it is flesh-side up. Be careful as the steam will escape when you turn it. Scoop the filling into the cavity of each squash half, piling it into a mountain so that it holds as much as possible. Sprinkle with cheese and bake until the cheese melts, about 10 minutes."
  ],
  "ingredients": [
    "0",
    "2 acorn or delicata squash, cut in half through the stem, seeded",
    "2 tsp. (10 mL) olive oil plus more for rubbing the squash and oiling the dish",
    "3/4 tsp (4 mL) kosher salt",
    "6 oz. (170 g) chorizo or sweet sausage, crumbled or cut into small pieces",
    "1 cup (250 mL) chopped leeks",
    "1 cup (250 mL) chopped apple",
    "Freshly ground pepper",
    "2 cups (500 mL) sliced tender greens (spinach, kale, Swiss chard), cut into ribbons",
    "4 fresh sage leaves, coarsely chopped",
    "2 cups (500 mL) cooked millet, rice or quinoa",
    "1/2 cup (125 mL) grated Cheddar cheese"
  ],
  "__v": 1
}