{
  "hash": "82ffeeb4a1f6dcddd062c58e6e4d8b78094ce049",
  "title": "Caramlized Onion, Bacon and Spinach Pizza",
  "image": "http://www.cookingclassy.com/wp-content/uploads/2015/03/carmelized-onion-bacon-and-spinach-pizza-srgb..jpg",
  "href": "http://www.cookingclassy.com/2015/04/caramlized-onion-bacon-and-spinach-pizza/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed:+blogspot/BfaXW+(Cooking+Classy)",
  "extension": "Chrome",
  "firstAdded": "2016-09-29T21:29:07.194000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 475 degrees.",
    "Heat 1 Tbsp olive oil in a large skillet over medium-high heat. Add spinach and saute just until wilted. Transfer to several layers of paper towels and squeeze some of the excess liquid from spinach, set aside.",
    "Add another 1 Tbsp olive oil to skillet and set over medium heat. Add onions, season lightly with salt and saute 10 minutes. Add sugar and cook until they begin to caramelize, about 5 - 10 minutes longer, adding a few tbsp water as needed to prevent them from drying and burning. Stir in balsamic vinegar and cook 1 minute longer, set aside.",
    "Shape pizza dough into a 12-inch round over a lightly floured sheet of parchment paper, leaving a larger rim around edge of dough for crust. Brush top with remaining 1 Tbsp olive oil and let rest 10 minutes.",
    "In a small saucepan, melt butter over medium heat. Add flour and garlic and cook, stirring constantly, 1 minute. While whisking, slowly pour milk into flour mixture. Season with salt and pepper to taste and bring mixture just to a boil stirring constantly then remove from heat.",
    "Spread white sauce evenly over pizza, leaving crust uncoated. Top with half of the mozzarella and half of the parmesan, then add spinach, bacon and onions. Top with remaining half of the mozzarella and parmesan. Transfer pizza on parchment paper to a pizza pan (or preheated pizza stone if you like a crisp crust) and bake in preheated oven 11 - 13 minutes until cheese is melted and crust is golden.",
    "Recipe source: Inspired by Cooking Light"
  ],
  "ingredients": [
    "0",
    "1 lb pizza dough homemade or store bought",
    "7 slices bacon (7 oz), cooked and chopped",
    "3 Tbsp olive oil, divided",
    "8 oz baby spinach",
    "1 large red onion, sliced 1/4-inch thick slices",
    "Salt and freshly ground black pepper",
    "1 tsp granulated sugar",
    "1 Tbsp balsamic vinegar",
    "2 Tbsp butter",
    "1 large clove garlic",
    "2 Tbsp flour",
    "3/4 cup milk",
    "6 oz low-moisture mozzarella cheese, shredded",
    "2 oz parmesan cheese, finely shredded"
  ],
  "__v": 1
}