{
  "hash": "d20221058a1e98e4f78faec92122bbf54ce00bd6",
  "title": "Coconut Almond Truffle",
  "image": "http://cdn2.veganbaking.net/2012/content/raw-vegan-coconut-almond-truffles.jpg",
  "href": "http://www.veganbaking.net/recipes/confections/truffles/raw-coconut-almond-truffles",
  "extension": "Chrome",
  "firstAdded": "2015-11-29T18:28:19.688000",
  "users": [
    null
  ],
  "keywords": [
    "dates",
    "walnuts",
    "almonds",
    "raw",
    "cocoa",
    "coconut",
    "maple",
    "syrup",
    "vanilla",
    "almond",
    "salt",
    "extra",
    "nuts",
    "finishing"
  ],
  "directions": [
    "0",
    "Process the dates, walnuts and almonds",
    "In a food processor blend together the dates, walnuts and almonds until they form a crumbly paste. If it's too thick, add a little water, but only enough for it to just come together. Depending on personal taste, the truffle mixture doesn't need to be totally smooth; some nutty pieces and tate chunks can be a cood thing. Add the cocoa powder and blend until mostly incorporated.",
    "2) Build the truffle mixture",
    "Remove the nut mixture from your food processor and place it in a large bowl. Stir in the shredded coconut, maple syrup, vanilla extract, almond extract and mix until smooth.",
    "3) Roll the vegan truffle mixture into balls",
    "If the truffle mixture is too sticky at this point, place it in the freezer for about 30 minutes so it firms up slightly. Measure the truffle mixture out as about 1 heaping tablespoon each. Roll it into balls by rolling the mixture between your palms.",
    "4) Coat the truffles",
    "Roll the truffles in your desired topping such as coconut, cocoa powder or nuts.",
    "While these could be eaten right away, the truffles are best when cold. For best results place the truffles in the freezer and allow to them harden at least 1 hour. Store the remaining truffles in the freezer and allow them to soften at room temperature about 10 minutes before serving.",
    "This recipe makes about 15 Vegan Coconut Almond Truffles."
  ],
  "ingredients": [
    "0",
    "1 cup dates",
    "½ cup walnuts",
    "½ cup almonds",
    "½ cup + 2 Tablespoons raw cocoa powder",
    "½ cup shredded unsweetened coconut",
    "¼ cup maple syrup",
    "1 teaspoon vanilla extract",
    "1 teaspoon almond extract",
    "½ teaspoon salt",
    "Extra coconut, cocoa powder or nuts for finishing."
  ],
  "__v": 1
}