{
  "hash": "8bd5891f452722fe095af1dfbceefe2aaa23f10d",
  "title": "CREAMY PARMESAN CARBONARA CHICKEN",
  "image": "https://i0.wp.com/cafedelites.com/wp-content/uploads/2017/05/Creamy-Parmesan-Chicken-Carbonara-Sauce-IMAGE-155.jpg?zoom=1.5&w=205&ssl=1",
  "href": "https://cafedelites.com/2017/05/08/creamy-parmesan-chicken-carbonara/",
  "extension": "Chrome",
  "firstAdded": "2017-05-29T23:06:14.879000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Season the chicken with salt and pepper. In a shallow bowl, combine the flour and parmesan cheese. Dredge seasoned chicken in the flour mixture; shake off excess and set aside.",
    "Heat the oil and butter in a large non stick pan or well-seasoned cast iron skillet over medium-high heat until butter has melted and pan is hot. Fry the chicken until golden on each side, cooked through and no longer pink (about 4-5 minutes per side, depending on the thickness of your chicken). Transfer onto a warm plate.",
    "Add the bacon strips to the pan and fry until crispy. Drain off some excess fat, keeping about 1 teaspoons worth in the pan. Add the onion and garlic and fry until onion is transparent (about 1 minute). Reduce heat to low heat, and add the half and half (or cream). Bring the sauce to a gentle simmer; season with a little salt and pepper to your taste. Add in the parmesan cheese, and allow the sauce to simmer until the parmesan cheese has melted slightly. (If the sauce is too runny for your liking, add the cornstarch/water mixture into the centre of the pan and mix through fast to combine into the sauce. It will begin to thicken immediately).",
    "Add the chicken back into the pan to serve.",
    "Serve with steamed vegetables (broccoli and/or cauliflower work best), over zucchini noodles, your favourite pasta, or rice."
  ],
  "ingredients": [
    "0",
    "For The Chicken:",
    "2 large boneless and skinless chicken breasts, halved horizontally to make 4 filets",
    "2 heaping tablespoons flour (all purpose or plain)",
    "3 tablespoons finely grated fresh Parmesan cheese",
    "1 teaspoon salt",
    "Cracked pepper",
    "For The Sauce:",
    "1 tablespoon olive oil",
    "2 teaspoons butter (or sub with oil)",
    "8-ounces | 250 grams bacon, trimmed of fat and cut into strips (I use shortcut bacon in Australia)",
    "1 small onion, chopped",
    "6 large cloves garlic, minced or finely chopped",
    "1-1/2 cups half and half (or use reduced fat cream or evaporated milk)*",
    "½ cup finely grated fresh Parmesan cheese",
    "½ teaspoon cornstarch (cornflour) mixed with 2 teaspoons of water"
  ],
  "__v": 1
}