{
  "hash": "fc2cfb972cf35dea6e0b4de24d1b3bc9756d1dd0",
  "title": "HOW TO MAKE LENTIL 'MEAT' BALLS",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2013/11/lentil-meatballs-batch-2-3-1066x800.jpg",
  "href": "http://www.onegreenplanet.org/vegan-food/how-to-make-lentil-meat-balls/",
  "firstAdded": "2015-01-19T14:18:54.333000",
  "users": [
    null
  ],
  "keywords": [
    "lentils",
    "rinsed",
    "water",
    "salt",
    "pepper",
    "cooking",
    "spray",
    "oil",
    "red",
    "onion",
    "garlic",
    "zucchini",
    "carrot",
    "stalks",
    "celery",
    "tbs",
    "parsley",
    "gluten",
    "free",
    "bread",
    "corn",
    "flake",
    "crumbs",
    "flax",
    "seed",
    "vegan",
    "worcestershire",
    "soy",
    "balsamic",
    "vinegar",
    "paprika",
    "italian",
    "seasoning",
    "chickpea",
    "flour"
  ],
  "directions": [
    "0",
    "Prepare the marinara sauce. Combine the flax seed and the warm water in a mug or small bowl. Mix and let stand for 10 minutes until it becomes a gel. This is your binder.",
    "Prepare the lentils. Bring 4 cups of water to a boil in a large saucepan. Add the lentils and a pinch of salt and return to a boil. Lower the heat, cover and cook for about 20 minutes until the water is absorbed. Let cool and move the lentils to a food processor. Process them until they are smooth.",
    "Heat the oil in a large skillet over medium-high heat. Add the onions and sauté them for about 4 minutes until translucent. Add the carrots, celery, garlic, salt and pepper. Sauté about 5 minutes until the veggies are tender. Allow to cool.",
    "Add the veggies to the lentils in the food processor. Add the Worcestershire sauce, parsley and spices. Add the flax gel to the lentil mixture and process until smooth. Transfer the lentil mixture to a large bowl.",
    "Add the bread crumbs, ¼ cup at a time, to the lentil mixture and mix with your hand. The best way to mix it is wet your hands and use one hand (keep the other hand clean) to gently mix the crumbs into the lentils. You will probably need more crumbs so add another ¼ cup and mix it again. You want the consistency to feel firm, like it will hold up as a meatball. If it feels too moist, add the last ¼ cup of bread crumbs. Usually, I end up using the whole cup of crumbs.",
    "Put the lentil mixture into the fridge for about 30 minutes. Take the bowl out of the fridge and using a spoon, scoop up some of the lentil mixture and roll it into a ball with your hands. It should be the size of a golf ball. Roll it until it feels sturdy. Place it on a plate and continue making meatballs until you use up all the lentil mix.",
    "Heat the remaining Tbs. of oil in a large skillet over medium-high heat. Add the lentil meatballs to the skillet and fry them. Depending on the size of your skillet, you may need to fry them in batches. Make sure the meatballs brown on all sides. The way I do this is to pull the skillet back and forth by the handle which makes the meatballs roll around. I find this covers all the sides better than trying to turn them with a utensil. When they are browned, transfer the meatballs to a paper towel-lined plate.",
    "Gently add the lentil meatballs to the simmering marinara sauce. Let them cook, on a low heat, about 10 minutes until they are heated through. Serve with pasta or in a sandwich."
  ],
  "ingredients": [
    "0",
    "2 cups dried lentils, rinsed and drained",
    "4 cups water",
    "Salt and pepper",
    "Cooking spray or oil",
    "½ red onion, finely chopped",
    "3 cloves garlic, minced",
    "1 zucchini, finely chopped",
    "1 large carrot, grated",
    "2 stalks celery, finely chopped",
    "2 Tbs. fresh parsley, chopped",
    "1 cup gluten free bread crumbs or corn flake crumbs",
    "2 tbs. ground flax seed",
    "3 Tbs. gf Vegan Worcestershire sauce OR2 Tbs. soy sauce plus 1 Tbs. balsamic vinegar",
    "1 tsp. each paprika, garlic powder, Italian seasoning",
    "2 Tbs. chickpea flour plus 2 Tbs. water"
  ],
  "__v": 1
}