{
  "hash": "ea497176b381616f989595417782620ed474d800",
  "title": "Ekstremalnie Krucha Papierówkowa Szarlotka",
  "image": "http://recipe-folder.com/img/recipe-images/020/265/806732320.jpg",
  "href": "http://szczypta-slodyczy.blog.pl/2016/08/25/ekstremalnie-krucha-papierowkowa-szarlotka/",
  "extension": "",
  "firstAdded": "2016-09-16T12:01:03.140000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "CIASTO",
    "==========================================================",
    "Masło siekamy, dodajemy do niego cukier, śmietanę oaz jajko. Do drugiej miski przesiewamy mąki oraz sodę – dodajemy w czasie wyrabiania. Gotowe ciasto wkładamy do lodówki na godzinę. Piekarnik nagrzewamy do 200 stopni. Blaszkę 25 na 35 cm wykładamy papierem i wylepiamy 2/3 ciasta (boki też, nie za wysoko). Ciasto nie jest zbyt zwarte, dlatego dobrze jest oprószyć ręce mąką. Wylewamy przygotowane wcześniej nadzienie i wkładamy na 10 – 15 minut. To dzięki dodatkowi maki ziemniaczanej ciasto będzie jeszcze bardziej kruche.",
    "NADZIENIE",
    "======================================",
    "Obrane papierówki kroimy w kosteczkę. Połowę wkładamy do dużego rondla i wlewamy odrobinę wody (1/3 szklanki) na dno – zasypujemy cukrem. Jabłka prażymy pod przykryciem, stopniowo dosypujemy nowe do wyczerpania się ich. Gdy jabłka prawie całkowicie się rozpadną możemy włożyć je do wypasteryzowanego słoika, aby mieć do wykorzystania gotowy mus na naszą szarlotkę zimą. Szybko go zakręcając i przewracając wieczkiem do dołu – powinien się zassać. Przygotowując szarlotkę na teraz go gorącego musu dodajemy rodzynek, przypraw i proszku budyniowego a następnie wylewamy na kruchy spód. Ciasto wkładamy do piekarnika. W międzyczasie orzechy siekamy lub mielimy i dokładnie mieszamy z ciastem zagniatając je ponownie. Orzechową kruszonkę wykładamy na podpieczona szarlotkę rwąc kawałki palcami. Wkładając uprzednio ciasto do zamrażarki można je też zetrzeć na tarce o dużych oczkach. Ciasto wkładamy raz jeszcze do pieca i obniżamy nieco temperaturę do 185 stopni. Pieczemy około 40 minut do zrumienienia się kruszonki. Szarlotka smakuje najlepiej podana na ciepło z lodami, choć nie ukrywam, że trudniej się kroi. Przed podaniem posypujemy cukrem pudrem."
  ],
  "ingredients": [
    "0",
    "Ciasto",
    "====================",
    "250 g masła",
    "150 g cukru",
    "2 łyżki śmietany",
    "1 jajko",
    "100 g mąki ziemniaczanej",
    "300 g mąki pszennej",
    "1/2 łyżeczki sody",
    "+ 50 g orzechów włoskich (lub obranych migdałów)",
    "Nadzienie",
    "===============================",
    "1 kg papierówek (waga po obraniu) – lub musu ze słoika",
    "3 łyżki cukru",
    "3 – 4 łyżki rodzynków",
    "po 1/2 łyżeczki: cynamonu, imbiru, ziela angielskiego, goździków",
    "1 opakowanie budyniu cytrynowego (ewentualnie kisielu lub budyniu śmietankowego/waniliowego i skórka otarta z cytryny)"
  ],
  "__v": 6
}