{
  "hash": "34a0f863b68702ac42543a567f84a35bbdc36cea",
  "title": "Slutty Brownies",
  "image": "http://whatsgabycooking.com/wp-includes/images/smilies/simple-smile.png",
  "href": "http://whatsgabycooking.com/slutty-brownies/",
  "extension": "Chrome",
  "firstAdded": "2016-01-13T05:11:22.608000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "butter",
    "white",
    "sugar",
    "cocoa",
    "salt",
    "vanilla",
    "eggs",
    "flour",
    "oreo",
    "regular",
    "double",
    "stuffed",
    "room",
    "temp",
    "brown",
    "egg",
    "baking",
    "soda",
    "semisweet",
    "chocolate",
    "chips"
  ],
  "directions": [
    "0",
    "For the Brownie layer:",
    "In a medium sauce pan, melt the butter over medium high heat. Add the sugar and cocoa powder once the butter is melted. Whisk to combine and remove from heat. Add the salt, vanilla and eggs and continuously whisk until the eggs are combined. Add the flour and continue to mix. Set batter aside.",
    "For the Cookie Dough layer:",
    "Cream together the butter and sugars in a mixer. Add the eggs and vanilla, making sure to scrape down the sides of the mixing bowl. Add the flour, salt, baking soda and baking powder and mix on low until everything is incorporated. Fold in the chocolate chips. Set dough aside.",
    "Assembly:",
    "Pre-heat the oven to 350 degrees F.",
    "Line the bottom of a 9x9 baking pan with tin foil and then spray the tin foil with a layer of baking spray.",
    "Layer the cookie dough on the bottom of a 9x9 baking pan, pressing down to form the bottom of the slutty brownies.",
    "Layer as many oreos that will fit on top of the cookie dough. No need to overlap. One single layer will do.",
    "Pour the brownie batter on top of the oreo layer and make sure it's evenly layers on top.",
    "Bake for 30-35 minutes. Test with a knife to see if the center is done. If the knife comes out clean, let the brownies rest for at least 2 hours before serving. If the knife comes out with batter still on it, allow the brownies to bake about 5 minutes more.",
    "Serve with ice cream :)"
  ],
  "ingredients": [
    "0",
    "10 tbsp unsalted butter",
    "1 1/4 cups white sugar",
    "3/4 cup cocoa powder",
    "1/2 tsp salt",
    "2 tsp vanilla extract",
    "2 large eggs",
    "1/2 cup AP flour",
    "1 package of Oreo (regular stuffed or double stuffed)",
    "1/2 cup unsalted butter (at room temp)",
    "1/4 cup brown sugar",
    "3/4 cup white sugar",
    "1 egg",
    "1 1/4 tsp vanilla extract",
    "1 1/4 cups AP flour",
    "1/2 tsp salt",
    "1/2 tsp baking soda",
    "1/2 tsp baking powder",
    "1 cup semi-sweet chocolate chips"
  ],
  "__v": 1
}