{
  "hash": "255b856a4bb18814c04b55ca806b2f94b49fc8db",
  "title": "Тикка-масала",
  "image": "http://img04.rl0.ru/eda/c300x300/s1.afisha-eda.ru/Photos/120131082425-130725170057-p-O-tikka-masala.jpg",
  "href": "http://eda.ru/recepty/osnovnye-blyuda/tikka-masala-30969/?photo-29152",
  "extension": "Chrome",
  "firstAdded": "2015-12-17T15:36:33.998000",
  "users": [
    null
  ],
  "keywords": [],
  "directions": [
    "0",
    "Куриное филе нарезать небольшими кусочками (из 500 грамм должно получиться примерно десять одинаковых кусочков). Выложить на слегка смазанную подсолнечным маслом форму, слегка перемешать и поставить в духовку, разогретую до 180 градусов, на пятнадцать-двадцать минут.",
    "В глубокой сковороде разогреть немного масла, добавить тмин, лавровый лист, черный и зеленый кардамон, гвоздику и корицу. Поджарить в течение пары минут до появления пряного аромата. Добавить четыре измельченные головки лука, перемешать и тоже немного обжарить.",
    "Нарезать мелкими кубиками четыре помидора, чеснок измельчить. Добавить помидоры и чеснок в сковороду и обжаривать, помешивая, несколько минут до тех пор, пока помидоры не отдадут сок и не станут мягкими. Посыпать кориандром, перцем чили и куркумой.",
    "Готовые кусочки куриного филе вынуть из духовки и тоже добавить в сковороду. Перемешать и готовить все вместе еще пару минут. Огонь на этом этапе можно слегка убавить, чтобы овощи и мясо не жарились, а тушились.",
    "Зеленый перец очистить от семян и перепонок и нарезать мелкими кубиками, добавить в сковороду к овощам и курице, все тщательно перемешать и потушить в течение пяти минут, постоянно помешивая и не давая приставать мясу и овощам ко дну.",
    "Аккуратно влить в сковороду сливки (они должны быть достаточно жирными, как минимум 30%-ными, обычные под действием высокой температуры немедленно свернутся).",
    "Добавить гарам-масалу — индийскую смесь специй, в которую обычно входят острый перец, чеснок, имбирь, лук и другие пряности. Все аккуратно пере- мешать и оставить на огне еще на пару минут.",
    "Получившийся густой и ароматный соус тикка-масала снять с огня и дать постоять одну-две минуты. Затем удалить из сковороды палочку корицы и лавро- вый лист и подавать сразу, пока горячий."
  ],
  "ingredients": [
    "0",
    "Масло подсолнечное 3 столовые ложки",
    "Тмин 1 чайная ложка",
    "Лавровый лист 1 штука",
    "Семена кардамона черные 2 штуки",
    "Семена кардамона зеленые 3 штуки",
    "Корица 1 кусок",
    "Гвоздика 3 штуки",
    "Лук репчатый 4 головки",
    "Помидоры 4 штуки",
    "Кориандр молотый 2 чайные ложки",
    "Мелко рубленный чеснок 4 зубчика",
    "Перец чили молотый 1 столовая ложка",
    "Куркума на кончике ножа",
    "Куриное филе 1 штука",
    "Перец зеленый 1 штука",
    "Сливки 33%-ные ¼ стакана",
    "Гарам-масала 1 чайная ложка",
    "Сок лимонный 1 чайная ложка"
  ],
  "__v": 1
}