{
  "hash": "947a430a958dabb11a4f2cc6b793ef2024329c5f",
  "title": "Cheesy Leftover Mashed Potato Pancakes",
  "image": "http://www.justataste.com/wp-content/uploads/2013/11/cheesy-leftover-mashed-potato-pancakes-recipe-175x265.jpg",
  "href": "http://www.justataste.com/2013/11/cheesy-leftover-mashed-potato-pancakes-recipe/",
  "firstAdded": "2014-12-21T16:47:24.248000",
  "users": [
    null
  ],
  "keywords": [
    "chilled",
    "leftover",
    "mashed",
    "potatoes",
    "cheddar",
    "cheese",
    "scallions",
    "green",
    "white",
    "parts",
    "egg",
    "lightly",
    "allpurpose",
    "flour",
    "oil",
    "panfrying",
    "sour",
    "cream"
  ],
  "directions": [
    "0",
    "In a large bowl, stir together the mashed potatoes, cheese, scallions, egg and 3 tablespoons flour until combined. (See Kelly's Notes.) Using your hands, divide the mixture into 12 portions. Roll each portion into a compact ball then flatten it into a pancake about a 1/2-inch-thick.",
    "Place the remaining 1/2 cup of flour in a shallow dish and carefully dredge each pancake in the flour.",
    "Heat 3 to 4 tablespoons of vegetable oil in a large sauté pan over medium heat. (Add enough oil to thoroughly coat the bottom of the pan.)",
    "Fry the pancakes, in batches, until they're golden brown and crispy on both sides, 3 to 4 minutes. Add more oil to the pan as needed between batches. (Do not overcrowd the pan and do not flip the pancakes too soon or they won't develop a crisp crust.) Transfer the pancakes to a paper towel-lined plate and immediately sprinkle them with salt.",
    "Serve the potato pancakes topped with sour cream and garnished with additional chopped scallions.",
    "Kelly's Notes:",
    "All leftover mashed potatoes will vary in consistency depending on how much cream, milk or melted butter you added to the original batch. If the mashed potato pancake mixture looks too dry and isn't holding together, add one more egg. If it looks too wet, add more flour, 1 tablespoon at a time, until the mixture is cohesive."
  ],
  "ingredients": [
    "0",
    "3 cups chilled leftover mashed potatoes",
    "2/3 cup shredded cheddar cheese",
    "2 Tablespoons chopped scallions, green and white parts",
    "1 egg, lightly beaten",
    "3 Tablespoons plus 1/2 cup all-purpose flour",
    "Vegetable oil, for pan-frying",
    "Sour cream, for serving"
  ],
  "__v": 1
}