{
  "__v": 1,
  "directions": [
    "0",
    "Put the clementines in a pan with some cold water, bring to the boil and cook for 2 hours. Drain and, when cool, cut each clementine in half and remove the pips. Dump the clementines - skins, pith, fruit and all - and give a quick blitz in a food processor (or by hand, of course). Preheat the oven to gas mark 5/190ºC/375ºF. Butter and line a 21cm / 8 inch Springform tin.",
    "You can then add all the other ingredients to the food processor and mix. Or, you can beat the eggs by hand adding the sugar, almonds and baking powder, mixing well, then finally adding the pulped oranges.",
    "Pour the cake mixture into the prepared tin and bake for an hour, when a skewer will come out clean; you'll probably have to cover with foil or greaseproof after about 40 minutes to stop the top burning. Remove from the oven and leave to cool, on a rack, but in the tin. When the cake's cold, you can take it out of the tin. I think this is better a day after it's made, but I don't complain about eating it at any time.",
    "I've also made this with an equal weight of oranges, and with lemons, in which case I increase the sugar to 250g / 2¼ cups and slightly anglicise it, too, by adding a glaze made of icing sugar mixed to a paste with lemon juice and a little water."
  ],
  "firstAdded": "2014-07-05T16:07:12.617000",
  "hash": "be6e80ef4dab08d5453225b3350943628f724603",
  "href": "http://www.nigella.com/recipes/view/clementine-cake-2559",
  "image": "http://assets.nigella.com/uploads/10fc8bc0c5f51371b8aabfe274200a19/main.jpg",
  "ingredients": [
    "0",
    "375 grams clementines (approx. 3 medium-sized ones)",
    "6 large eggs",
    "225 grams white sugar",
    "250 grams ground almonds",
    "1 teaspoon baking powder (see NOTE below)"
  ],
  "keywords": [
    "clementines",
    "approx",
    "mediumsized",
    "ones",
    "eggs",
    "white",
    "sugar",
    "almonds",
    "baking"
  ],
  "title": "CLEMENTINE CAKE",
  "users": [
    null
  ]
}