{
  "hash": "52d60b00f04e94674d2ef3fa886bed0cba7c5709",
  "title": "Shrimp Boil Foil Packs",
  "image": "http://www.lecremedelacrumb.com/wp-content/uploads/2017/05/shrimp-boil-foil-packs-106.jpg",
  "href": "http://www.lecremedelacrumb.com/shrimp-boil-foil-packs/",
  "extension": "Chrome",
  "firstAdded": "2017-06-12T23:59:09.069000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Chop corn into thirds, then chop each third in half lengthwise. Chop potatoes into 2 inch pieces. Boil corn and potatoes for 10 minutes. Drain and set aside.",
    "In a large bowl combine shrimp, sausage, corn, and potatoes. Stir together melted 3 tablespoons butter, Old Bay seasoning, garlic, juice from half a lemon, and salt and pepper to taste and pour over shrimp, sausage, and veggies. Stir to coat.",
    "Divide between four 12x12 inch sheets of aluminum foil. Fold edges of foil up around the food to create a closed packet.",
    "Cook on preheated grill over medium-high heat for 8-10 minutes on one side, then flip and cook another 5-6 minutes on the second side. Alternately, you can bake the packets at 400 degrees for 15-20 minutes until corn is tender and shrimp are pink and fully cooked.",
    "While packets are cooking, melt remaining butter in a medium sauce pan over medium-high heat. Once melted, continue to stir gently over medium heat for 3-4 minutes longer until color changes from pale yellow to a golden amber (but be careful not to burn it).",
    "Serve shrimp boil packs topped with chopped parsley, lemon wedges for squeezing, and browned butter for drizzling over the top or dipping."
  ],
  "ingredients": [
    "0",
    "1 pound shrimp, peeled and de-veined",
    "2 ears of corn on the cob, husked",
    "½ pound andouille sausage",
    "1 pound baby red potatoes OR baby yellow potatoes",
    "3 tablespoons old bay seasoning OR homemade seasoning (see note)",
    "salt and pepper, to taste",
    "3 teaspoons minced garlic",
    "juice of ½ lemon, plus lemon wedges for serving",
    "3 tablespoons, melted + ½ cup butter, divided",
    "chopped fresh parsley, for topping"
  ],
  "__v": 1
}