{
  "hash": "b6bfec2b4faf3aa1563703a4de7ce127683a52af",
  "title": "Za'atar Grilled Chicken Wings with Fava Bean Feta Dip",
  "image": "https://images.food52.com/GTwsU2u4CJcFwuoqJmHAaoNbDGU=/753x502/4d09cafa-150b-4275-82d7-a53df9152910--2016-0614_zaatar-grilled-chicken-wings-with-fava-bean-feta-dip_bobbi-lin_24997.jpg",
  "href": "https://food52.com/recipes/56173-za-atar-grilled-chicken-wings-with-fava-bean-feta-dip",
  "extension": "Chrome",
  "firstAdded": "2018-01-05T13:05:32.967000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large bowl, make the marinade by mixing the spices (with the exception of the za'atar), water, red onions, garlic, olive oil, and lemon juice together.",
    "Add the chicken wings, coat in the marinade, and let sit in the marinade in the refrigerator for at least overnight. We left it marinating for 24 hours and are convinced that was even better.",
    "Heat the grill to 400° F.",
    "Drain the marinade. Add 3 tablespoons of za'atar and mix together until wings are coated (add more as needed to coast the wings).",
    "Grill the wings for about 25 minutes, flipping over once or twice halfway. Once cooked, remove from the heat, sprinkle with another tablespoon of za'atar.",
    "Enjoy with dip outlined below!",
    "1",
    "If they still have the shell, boil the fava beans for 8 to 10 minutes until soft. Then shell and throw out the shells. If already shelled, then can boil for only 4 minutes. Drain.",
    "Blend the boiled fava beans, labneh, feta, and juice of half of a lemon using a blender or food processor until smooth. Store any extras in an airtight container in the refrigerator for up to 3 days."
  ],
  "ingredients": [
    "0",
    "1 tablespoon sumac",
    "1/2 teaspoon allspice",
    "1/4 teaspoon cinnamon",
    "1 1/2 teaspoons salt",
    "1 cup water",
    "2 red onions, thinly sliced",
    "3 garlic cloves, crushed",
    "1/4 teaspoon ground black pepper",
    "3 tablespoons olive oil",
    "Juice of 1 large lemon",
    "24 pieces chicken wings, both drumsticks and wings",
    "4 tablespoons za'atar",
    "1",
    "1 1/2 cups frozen fava beans (with shell, or 1/2 cup shelled)",
    "1 cup labneh (can sub for full-fat Greek yogurt or sour cream)",
    "3 ounces feta (I used goat feta, can use normal feta also)",
    "Juice of half of a lemon"
  ],
  "__v": 1
}