{
  "hash": "feef967699613fe9254573ba9be39d20fbbd3c6e",
  "title": "Italian-style roast pork with crispy crackling",
  "image": "http://www.bbcgoodfood.com/sites/default/files/styles/bbcgf_recipe/public/recipe_images/pork_3.jpg?itok=qYuEKlFb",
  "href": "http://www.bbcgoodfood.com/recipes/italian-style-roast-pork-crispy-crackling",
  "extension": "Chrome",
  "firstAdded": "2015-12-23T17:32:48.770000",
  "users": [
    null
  ],
  "keywords": [
    "garlic",
    "clove",
    "bay",
    "leaf",
    "roughly",
    "black",
    "peppercorn",
    "salt",
    "fennel",
    "seed",
    "olive",
    "oil",
    "rolled",
    "pork",
    "loin",
    "untied",
    "skin",
    "scored",
    "onion",
    "wedges",
    "lemon",
    "gravy",
    "plain",
    "flour",
    "marsala",
    "red",
    "wine",
    "chicken",
    "stock"
  ],
  "directions": [
    "0",
    "Pound the garlic, bay, pepper, 1 tsp sea salt and 1 tbsp of the fennel seeds using a pestle and mortar, then stir in 1 tbsp oil. Place the pork, skin-side up, in a clean sink and pour over a kettleful of boiling water (this tightens the skin – the first step towards great crackling). Drain, pat dry and place, skin-side down, on a chopping board. Rub the garlicky paste all over it, then roll up the loin and tie it at intervals with kitchen string. Arrange the onion and lemon in the centre of a roasting tin and sit the pork on top, skin-side up. Rub the rind with the remaining salt and leave at room temperature, uncovered, for 1 hr.",
    "Heat oven to 230C/210C fan/gas 8. Rub the skin of the pork with the remaining oil. Lightly crush the remaining fennel seeds and scatter over the meat. Roast for 30 mins, then turn the heat down to 180C/160C fan/gas 4 and continue to roast for 1 hr 20 mins. Remove the pork, cover loosely and leave to rest for 30 mins. If your crackling isn’t crisp, pop the joint under a hot grill for a few mins, but watch it as it will burn very easily.",
    "Meanwhile, make the gravy. Tip away all but 1 tbsp of fat from the tin and put on the hob. Add the flour and mix with the onion and lemon, scraping any bits from the bottom. Pour in the Marsala and let it bubble, then gradually add the stock and any of the resting juices, and simmer gently for 8-10 mins. Season, if needed, and strain through a sieve before serving."
  ],
  "ingredients": [
    "0",
    "3 garlic clove, finely chopped",
    "3 bay leaf, roughly chopped",
    "1 tsp black peppercorn",
    "2 tsp sea salt",
    "1½ tbsp fennel seed",
    "2½ tbsp olive oil",
    "1.8kg rolled pork loin, untied with the skin scored",
    "1 onion",
    ", cut into wedges",
    "1 lemon",
    ", cut into wedges",
    "For the gravy",
    "2 tbsp plain flour",
    "125ml Marsala or red wine",
    "500ml vegetable or chicken stock"
  ],
  "__v": 3
}