{
  "hash": "76ba9f191091259aa4c06bbd38174dc688c662e7",
  "title": "Jamaican Oxtails",
  "image": "https://www.myforkinglife.com/wp-content/uploads/2019/07/jamaican-oxtail-15.jpg",
  "href": "https://www.myforkinglife.com/jamaican-oxtails/",
  "extension": "Chrome",
  "firstAdded": "2020-02-24T13:34:45.589000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Rinse oxtails with water and vinegar and pat dry. Cover oxtails with brown sugar, soy sauce, Worchestire sauce, salt, garlic powder, black pepper, all-spice, and browning and rub into oxtails.",
    "Set Pressure Cooker on High Sauté and once hot, add vegetable oil. Next, add your larger oxtail pieces to the pot, flat side down about ¼ inch apart, and brown on each side.",
    "Remove oxtail after browning and place in bowl.",
    "Deglaze your pressure cooker by adding about 2 Tbsp of beef broth to the insert. Take a wooden spoon and deglaze your pot by removing the brown bits at the bottom. Then add your yellow onions, green onions, carrots, garlic, and scotch bonnet pepper. Stir and sauté for about 5 minutes or until the onions have softened.",
    "Add dried thyme, oxtails, remaining beef broth, and ketchup to the pressure cooker insert.",
    "Press “Cancel” on your Instant Pot. Cover and cook on high pressure for 45 minutes. Once timer is done, allow pressure cooker to naturally release.",
    "Once all pressure has released, open lid and remove oxtails and vegetables, leaving liquid behind. Turn Pressure Cooker on sauté. Once liquid begins to simmer, create a corn starch slurry by combining corn starch and water to a separate bowl. Stir into simmering liquid. Add drained butter beans into pressure cooker and allow to simmer for about 5 minutes, until liquid is slightly thickened and butterbeans are warmed.",
    "Add oxtails and vegetables back to the pressure cooker. Serve and enjoy 🙂",
    "Slow Cooker Instructions",
    "Prepare recipe as instructed up until the oxtails need to be browned. Brown oxtail over medium-high heat on the stovetop in a skillet. Once oxtail are browned, deglaze skillet by adding 2 Tbsp of beef broth. Add onions and carrots to skillet and stir until onions have softened. Add these ingredients to the slow cooker as well as all remaining ingredients, except the butter beans. Cook on low heat for 8-10 hours or until oxtail is tender. 30 minutes before serving, add drained butter beans to slow cooker.",
    "Stove Top Instructions",
    "Follow the instructions above and then rather than placing in a slow cooker or pressure cooker, cook it on the stove on medium low heat for about 3 hours, stirring occasionaly or until oxtails are tender. Add the butter beans when there is about 30 minutes left on the cook time.",
    "Suggested Tools",
    "6 Qt Pressure Cooker",
    "Wooden Spatula",
    "Video",
    "Notes",
    "Notes on Pressure Cooker Oxtails",
    "It’s best if all your oxtails are medium sized oxtails that are similar in size. If you can’t get them the same size, no worries. It’ll still work.",
    "Oxtail that is too fatty will lead to fatty gravy. You want some fat, just not too much fat. If you’re oxtail is extremely fatty, use a paring knife to remove some of the excess fat.",
    "Scotch Bonnet is typically used for this recipe. If you can’t find a scotch bonnet, a habanero can be substituted. You could also use about 1-2 tsp of this scotch bonnet pepper sauce.",
    "Nutrition",
    "Calories: 876kcal | Carbohydrates: 27g | Protein: 90g | Fat: 45g | Saturated Fat: 21g | Cholesterol: 312mg | Sodium: 2882mg | Potassium: 297mg | Fiber: 2g | Sugar: 18g | Vitamin A: 5261IU | Vitamin C: 11mg | Calcium: 113mg | Iron: 13mg",
    "Subscribe to my YouTube",
    "Subscribe to my YouTube Channel for full length recipe videos. Click the bell icon to be notified when I upload a new video.",
    "Tried this recipe? Share on Instagram",
    "Mention @Myforkinglife or tag #myforkinglife!",
    "Instant Pot Course for Beginners?",
    "Check out Be the Boss of Your Instant Pot Video Course !",
    "Although myforkinglife.com attempts to provide accurate nutritional information, these figures should be considered estimates. Varying factors such as product types or brands purchased, natural fluctuations in fresh produce, and the way ingredients are processed change the effective nutritional information in any given recipe. Under no circumstances will myforkinglife.com be responsible for any loss or damage resulting for your reliance on nutritional information.",
    "Sharing is caring!",
    "Filed Under: Caribbean, Pressure Cooker Recipes",
    "Previous Post: « Million Dollar BaconNext Post: Homemade Poultry Seasoning »",
    "READER INTERACTIONS",
    "COMMENTS",
    "Angie says",
    "February 15, 2020 at 12:29 pm",
    "Well, I am sure this is the most delicious of Jamaican Recipes. The ingredients look amazing as do the pictures. I wish I could lie and say that I was a beginner cook, but alas I have been cooking for some years! I suppose I am an inconsistent cook, some days amazing, some days totally burnt, some days only a little burnt and other days just on the verge of. This recipe looked amazing! I gather all the ingredients and start my preps. Your recipe calls for 1 TABLESPOON of Salt!? Is this correct? I don’t have or cannot find a scotch bonnet chili, so I decide I will just use the powdered chilli…not sure how much but just keeping sprinkling till I think that looks about right! I even make my own browning and as I have no idea what browning is…I looked on YouTube and came across an easy browning recipe…really easy….1/2 cup brown sugar over low heat…now this lovely Jamaican lady keeps emphasizing to keep stirring the sugar so that it does not burn…it will eventually melt turning a gorgeous dark brown color…you then you add water a little bit at a time until you have a lovely brown sauce…I had this on such a low heat, it took me 35 minutes to get it to turn into a sticky liquid..stirring all the time…I am really into this recipe and want to do EVERYTHING correctly (it is my husbands birthday dinner and he has been looking forward to this for 2 days) As this lovely lady pours water into her melted sugar, up comes the steam from her pan…still stirring…more water…still stirring..looks gorgeous…but she does not say to use boiling water…so I add tap water and my sugar mixture…which is looking amazing at this point…turns into a solid block of crystallized sugar….oh well…no browning used then! I put everything into my slow cooker and leave it for 4 hours before tasting it….well, I am not sure which was worse the 1 TBS of Salt or the chili that I had added…I tasted a 1/4 tsp of the sauce and it is not so much as taking my head off, as not sure which part of my body it will take off…..at the moment it is sort of working itself…painfully around my stomach, throat, nose….intestines…very slowly, painfully and gaining momentum….mhhh…I am not sure which is going to be more painful the chili and salt or telling my husband he is having scrambled eggs for his birthday dinner! I will try this again as it really does sound and look great! Sometimes, this is my Forking Life!",
    "REPLY",
    "Tanya says",
    "February 15, 2020 at 12:37 pm",
    "Hi Angie, so sorry to hear it didn’t work out for you the first time. Here’s some tips for next time….don’t use chili powder, it will give it a whole different flavor profile. If you can find a fresh scotch bonnet pepper, a fresh habanero pepper or even a jalapeño pepper would work. But not chili powder which can have it’s own added salt and other spices. The 1 Tablespoon of salt is correct but feel free to cut that in half in the rub and then salt to taste afterwards. If you can’t find the browning in the store, you can leave it out. Your oxtails will just be lighter but still taste amazing. Thank you for sharing your experience, it happens, please let me know how it turns out next time,",
    "REPLY",
    "Royce Brown says",
    "February 15, 2020 at 4:23 am",
    "! Good Morning Tanya !",
    "In your receipe the ingredients are for 2.5 pounds of oxtails, if i am cooking more than what is listed, should i increase the ingredients to match the right amount of pounds ?",
    "REPLY",
    "Tanya says",
    "February 15, 2020 at 9:51 am",
    "Yes, increase the ingredients but keep the cooking time the same.",
    "REPLY",
    "Royce Brown says",
    "February 15, 2020 at 12:35 pm",
    "What should the cooking time be for a slow cooker.?",
    "REPLY",
    "Tanya says",
    "February 15, 2020 at 12:38 pm",
    "8-10 hours on low",
    "REPLY",
    "Royce Brown says",
    "February 17, 2020 at 8:49 pm",
    "Good Evening Tanya..I just wanted to drop you a line and let you know how great & tender my oxtails came out. I fixed 8 1/2 pounds of oxtails and my family & friends went crazy over the flavor & tenderness, Thank You so much for the receipe.",
    "Sophie says",
    "February 11, 2020 at 1:15 pm",
    "Love this recipe!!!! I bought a family pack of oxtails so it took me a bit longer to cook in my instapot(90 mins). I also put 1 pack or McCormick brown gravy in with the cornstarch. Will make again. Thanks!",
    "REPLY",
    "Tanya says",
    "February 12, 2020 at 8:31 am",
    "That sounds like a delicious addition with that brown gravy. Thanks so much for sharing 🙂",
    "REPLY",
    "K says",
    "February 8, 2020 at 11:21 am",
    "Hello,",
    "Question,",
    "For butter beans, do you cook them before adding? Because it says drained. Or do you mean out of a can?",
    "If I buy dry beans, is it the same process??",
    "Ty!!",
    "REPLY",
    "Tanya says",
    "February 8, 2020 at 4:16 pm",
    "Hi K, I’ve never made this recipe with dried butter beans as I use canned for this recipe. I’m guessing if you put dried beans in with the ingredients before pressure cooking that it should be ok since it’s a 45 minute cook time. My only fear is actually overcooking them a little with this method.",
    "REPLY",
    "Lynne Dean-Colfack says",
    "February 1, 2020 at 5:59 pm",
    "I think the name of your website is priceless.",
    "REPLY",
    "Tanya says",
    "February 2, 2020 at 9:15 pm",
    "Thank you 😊",
    "REPLY",
    "Patricia says",
    "January 25, 2020 at 4:17 pm",
    "I remember my Grandmother soaking the meat in vinegar too! I will try this Jamaican version. Thank you for the memory!!",
    "REPLY",
    "Nuray Lika says",
    "January 22, 2020 at 10:52 am",
    "How do I make on stove top?",
    "REPLY",
    "Tanya says",
    "January 22, 2020 at 2:53 pm",
    "Hi Nuray, You would follow the instructions above and then rather than placing in a slow cooker or pressure cooker, cook it on the stove on medium low heat for about 3 hours, stirring occasionaly or until the oxtails tender. I’ll update the recipe card to reflect these directions as well, thanks 🙂",
    "REPLY",
    "Nuray Lika says",
    "January 22, 2020 at 9:09 pm",
    "Thanks so much ❤️",
    "REPLY",
    "Tonia Lovejoy says",
    "January 12, 2020 at 5:42 pm",
    "These are some of the best oxtails I have ever tasted. Forget paying a fortune at the restaurant, I paid a little over $16 for 2.7 pounds of oxtails and most of the ingredients I already had in my pantry, so comparatively, a $12 large oxtails with rice/peas & cabbage doesn’t compare. I am about to make your rice/peas (already made by cabbage with carrots & red onions) and if they come out as well as the oxtail, I will be raving about you to everyone I know.",
    "REPLY",
    "Tanya says",
    "January 12, 2020 at 6:17 pm",
    "Thanks so much Tonia! Also, I love your name 🙂",
    "REPLY",
    "Chad L Bailey says",
    "January 10, 2020 at 2:38 pm",
    "Just a note that Scotch Bonnet and Habanero are the same pepper, with the latter being the name in Spanish.",
    "REPLY",
    "Javanni DeCordova says",
    "January 25, 2020 at 4:04 pm",
    "Scotch bonnets and Habaneros are not the same pepper. They’re cousins but not the same, scotch bonnets look like little hats and habaneros have a more traditional pepper shape. They’re both great peppers but different levels of heat and flavor profiles.",
    "REPLY",
    "Tarnecha says",
    "January 1, 2020 at 10:44 am",
    "Hi Tanya",
    "I have 5 lbs of oxtails – what ingredients do I need to increase and how long on the pressure cooker do I need to cook?",
    "REPLY",
    "Tanya says",
    "January 1, 2020 at 12:24 pm",
    "Hi Tarnecha, You can double all the ingredients but leave the pressure cook time the same. It’ll just take a little longer to come to pressure.",
    "REPLY",
    "« Older Comments",
    "LEAVE A REPLY",
    "Your email address will not be published. Required fields are marked *",
    "Recipe Rating",
    "Comment",
    "Name *",
    "Email *",
    "Website",
    "PRIMARY SIDEBAR",
    "ABOUT TANYA",
    "Welcome to My Forking Life! Hi, I'm Tanya, attorney, busy wife and mom, and lover of quick, easy, and delicious meals. Read More…",
    "Search this website",
    "All the Legals",
    "Privacy Policy",
    "FOOTER",
    "Privacy Policy",
    "As an Amazon Associate I earn from qualifying purchases.",
    "COPYRIGHT © 2020 · FOODIE PRO THEME BY SHAY BOCKS · BUILT ON THE GENESIS FRAMEWORK · POWERED BY WORDPRESS",
    "Select Directions",
    "(note: you can drag this box around t"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2.5 lbs oxtails",
    "¼ cup brown sugar",
    "1 Tbsp soy sauce",
    "1 Tbsp Worchestire Sauce",
    "1 Tbsp salt",
    "2 tsp garlic powder",
    "1 tsp black pepper",
    "1 tsp all-spice",
    "1 tsp browning",
    "2 Tbsp vegetable oil",
    "1 yellow onion chopped",
    "4 green onions chopped",
    "1 Tbsp garlic chopped",
    "2 whole carrots chopped",
    "1 scotch bonnet or habanero pepper seeds and membrane removed and chopped",
    "1 cup beef broth",
    "1 Tbsp ketchup",
    "1 tsp dried thyme",
    "2 Tbsp water",
    "1 Tbsp cornstarch",
    "1 16 oz can Butter Beans drained"
  ],
  "__v": 1
}