{
  "hash": "1474a65f1d13f53288f00ba60c7cb765bc801b47",
  "title": "Cinnamon Quinoa Breakfast",
  "image": "http://www.alkalinesisters.com/wp-content/uploads/2010/08/DSC_0238-570x851.jpg",
  "href": "http://www.alkalinesisters.com/cinnamon-quinoa-breakfast-how-i-start-my-alkaline-day/1215/",
  "extension": "Chrome",
  "firstAdded": "2016-04-27T04:01:12.254000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine quinoa, almond milk, cinnamon, allspice, raisins in medium sauce pan. Bring to a boil and then place lid on pan and reduce to low heat. After 5 mins stir in chopped apple and simmer for approx 5-7 mins longer. Stir and check for remaining liquid and if most is absorbed then remove from heat, leaving lid on pan and let rest for 5 mins to absorb rest of the milk. If when you peek, there is still lots of liquid, simmer for 3-5 mins longer but keeping a close eye over the pot as this mixture can easily burn if left to boil dry, then let it rest for 5 mins. Taste for sweetness and adjust to your liking with 3-5 stevia drops or a dribble of agave syrup. You may not need any additional sweetener as the raisins and apple do add a nice sweetness that may be just perfect for you. Be cautious as even these natural sugars will spike your blood sugar levels and you want to minimize this.",
    "Top each serving with walnuts, sunflower seeds, blueberries and remaining chopped apple. If I have raspberries or strawberries on hand I like to toss them on top instead or as well!"
  ],
  "ingredients": [
    "0",
    "Cinnamon Quinoa Breakfast",
    "Yield: approx 4 cups",
    "1 cup quinoa, rinsed",
    "3 cups unsweetened almond milk",
    "1/2 tsp vanilla",
    "1 tsp cinnamon",
    "1/4 tsp allspice",
    "1/2 cup raisins",
    "1 med apple chopped small (save some for garnish)",
    "stevia or agave to taste",
    "1/2 cup raw walnuts, chopped",
    "4 tbsp raw sunflower seeds",
    "1 cup fresh organic blueberries",
    "optional – fresh raspberries, fresh strawberries, chopped pecans or almonds, hemp seeds"
  ],
  "__v": 1
}