{
  "__v": 1,
  "directions": [
    "0",
    "Versa le due farine su una spianatoia e disponile a fontana, poi impastale con un cucchiaio di olio extravergine di oliva, un pizzico di sale e l'acqua tiepida. Aggiungi l'acqua a poco a poco: la quantità può infatti variare in base alla farina usata.",
    "Impasta per una decina di minuti, finché non ottieni una palla di pasta liscia e non più appiccicosa. La pasta dovrà risultare vellutata ed elastica al tatto.",
    "Lasciala riposare per una decina di minuti.",
    "A questo punto ci sono due modi per ottenere i pici.",
    "Puoi formare lunghi spaghetti con le mani, rotolando pezzi di pasta e assottigliandoli sempre di più su una superficie in legno.",
    "Oppure puoi utilizzare il mattarello con le righe per fare i pici che, passato sulla pasta precedentemente stesa non troppo sottile, incide lunghi solchi. Una volta fatta questa operazione, procedi a staccare picio per picio dalla striscia di pasta, tirandolo con le mani, poi stendilo sulla spianatoia rotolandolo per assottigliarlo un po'.",
    "Lasciali asciugare su una tovaglia infarinata e poi cuocili in abbondante acqua bollente salata finché non saranno cotti all'assaggio: il tempo di cottura dipenderà da quanto li hai fatti spessi.",
    "Per preparare il condimento sbriciola la mollica del pane, e taglia a cubetti piccolini la corteccia.",
    "Scalda qualche cucchiaio di olio extravergine di oliva in una padella antiaderente con due spicchi di aglio in camicia, appena l'olio è ben caldo aggiungi le briciole e falle dorare in padella, girandole spesso. Condiscili con abbondante pepe nero macinato e sale.",
    "Aggiungi i pici cotti e ben scolati, poi saltali in padella insieme alle briciole tostate.",
    "Servili subito ben caldi con abbondante pecorino grattato."
  ],
  "firstAdded": "2014-10-10T11:52:10.242000",
  "hash": "fd80e4d9536fa55d75f2e5634aefd3f0d6ae24e8",
  "href": "http://it.julskitchen.com/toscana/i-pici-con-le-briciole-per-benvenuto-brunello",
  "image": "http://farm8.staticflickr.com/7198/6902651975_cbe96c6ba9_b.jpg",
  "ingredients": [
    "0",
    "300 g farina 00",
    "80 g farina integrale di grano duro macinata a pietra",
    "ca. 200 ml di acqua tiepida",
    "1 pizzico di sale",
    "1 cucchiaio di olio extravergine di oliva",
    "1",
    "8 fette di pane toscano raffermo",
    "olio extravergine di oliva",
    "2 spicchi di aglio in camicia",
    "sale",
    "pepe nero macinato fresco",
    "Pecorino toscano grattato"
  ],
  "keywords": [
    "farina",
    "integrale",
    "grano",
    "duro",
    "macinata",
    "pietra",
    "acqua",
    "tiepida",
    "pizzico",
    "sale",
    "cucchiaio",
    "olio",
    "extravergine",
    "oliva",
    "fette",
    "pane",
    "toscano",
    "raffermo",
    "spicchi",
    "aglio",
    "camicia",
    "pepe",
    "nero",
    "macinato",
    "fresco",
    "pecorino",
    "grattato"
  ],
  "title": "I pici con le briciole",
  "users": [
    null
  ]
}