{
  "hash": "4a14e71a61ca554e4f7ca084787074bd8f0b8fb0",
  "title": "Miso and Soba Noodle Soup with Roasted Sriracha Tofu and Shiitake Mushrooms",
  "image": "https://pocket-image-cache.com/direct?url=https%3A%2F%2Fbojongourmet.com%2Fwp-content%2Fuploads%2F2014%2F01%2Fmiso-soup-lede-11.jpg&resize=w704",
  "href": "https://getpocket.com/a/read/2466190547",
  "extension": "Chrome",
  "firstAdded": "2019-01-25T15:06:10.919000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the miso broth:",
    "In a large, heat-proof bowl or pot, combine the ginger, kombu, dried mushrooms, and boiling water. Let steep while you prepare the rest of the ingredients, 20-30 minutes. Carefully strain the stock, leaving behind any sand that may be hanging out on the bottom of the pan (or pour through a coffee filter if you prefer). Add half a cup of stock to the miso paste and stir it to loosen. Add the miso to the stock, and taste for salt, adding tamari and lime juice until you like the flavor.",
    "Make the fixings:",
    "While the stock is doing its thing, position a rack in the center of the oven and preheat to 400ºF. Place the tofu on a smallish, rimmed baking sheet and drizzle with 1 tablespoon each of the sesame oil and tamari. Add the Sriracha and toss to coat. Roast in the oven until hot and slightly crisp on the outside, tossing once or twice, about 10 minutes.",
    "Meanwhile, place the shiitakes on a smallish, rimmed baking sheet and toss with the remaining 2 tablespoons each sesame oil and tamari. Roast until tender and shrunken, tossing once or twice, about 10 minutes.",
    "Bring a large saucepan of lightly salted water to a boil. Add the noodles and cook, stirring frequently to prevent sticking, until the noodles are tender but not falling apart (see the package for cooking time). Drain the noodles and rinse them in cool running water. If not using immediately, toss with a bit of oil to prevent sticking. Otherwise, divide the noodles between 4 large bowls and keep warm.",
    "Serve the soup:",
    "Re-warm the stock until steamy-hot but not simmering. Add the kale and cook just below a simmer until wilted and bright green.",
    "Divide the noodles among 4 large bowls. Add the shiitakes, tofu, and scallions. Pour the hot broth and kale over the fixings. Top with sesame seeds, gomashio, and/or togarashi, if you like."
  ],
  "ingredients": [
    "0",
    "Broth:",
    "2 inches ginger root, sliced into coins",
    "4-6 (4″ square) sheets kombu",
    "6 dried shiitake mushrooms",
    "8 cups water",
    "1/2 cup sweet white or yellow miso",
    "2 tablespoons tamari (optional, depending on saltiness of miso)",
    "juice of 1 lime or lemon, to taste",
    "Fixings:",
    "8 ounces firm or extra-firm tofu, in 1/2″ cubes",
    "8-12 ounces shiitake mushrooms, ends trimmed, sliced (about 6 cups)",
    "3 tablespoons toasted sesame oil (divided use)",
    "3 tablespoons tamari (divided use)",
    "1 – 2 teaspoons Sriracha (depending on how spicy you like it)",
    "12-16 ounces soba noodles (depending how noodley you like it)",
    "1 bunch kale, stemmed and slivered",
    "2 large or 3 small scallions, washed, trimmed, slivered",
    "toasted sesame seeds or gomashio (optional)",
    "togarashi (optional)"
  ],
  "__v": 1
}