{
  "hash": "0194d08f8cc3638ee43ee44b279b449f468be383",
  "title": "curried lentils with coconut milk",
  "image": "https://alexandracooks.com/wp-content/uploads/2016/09/lentils_vert-2.jpg",
  "href": "https://alexandracooks.com/2016/09/29/curried-lentils-coconut-milk/",
  "extension": "Chrome",
  "firstAdded": "2019-02-07T22:16:10.091000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large saucepan over medium heat, warm the olive oil. Add the ginger, garlic, shallot (or onion), coriander, cumin, and turmeric and cook, stirring now and then, until the vegetables are softened and the spices are very fragrant, about 10 minutes.",
    "Add the lentils, coconut milk, and 1 to 2 teaspoons kosher salt (Note: if you are sensitive to salt or using table salt or even Morton’s kosher salt, which is saltier than Diamond Crystal kosher salt, start with 1 teaspoon, then add more to taste—I use Diamond Crystal and so typically use 2, but use your judgement), then fill the empty coconut-milk can with water and add it to the saucepan. It will look like a lot of liquid, but the lentils will absorb it as they cook. Stir everything together, turn the heat to high, and bring the mixture to a boil. Turn the heat to low and let the lentils simmer, stirring now and then, until they’re completely soft, about 20 minutes. Season to taste with salt. (Note: If you’re using French green lentils, you will need to cook this longer, 30 to 45 minutes. Just keep tasting to see when the lentils are cooked through. You may or may not need to add more water.)",
    "Serve the lentils hot over rice. Top each serving with a spoonful of yogurt and a sprinkle of cilantro. A side of naan is nice, too."
  ],
  "ingredients": [
    "0",
    "3 tablespoons extra-virgin olive oil",
    "1 tablespoon minced peeled fresh ginger",
    "2 garlic cloves, minced",
    "1 shallot or small onion, minced",
    "1/2 teaspoon ground coriander",
    "1 teaspoon cumin seeds or ground cumin",
    "1 teaspoon ground turmeric",
    "1 cup (180 g) split red lentils or a mix of red and French green lentils",
    "13.5-ounce (398-ml) can full-fat unsweetened coconut milk",
    "Kosher salt",
    "Cooked basmati rice, plain yogurt, chopped fresh cilantro, and naan for serving"
  ],
  "__v": 1
}