{
  "hash": "f1b03b961cfeedfefa5aa77f2137170bcf8055e9",
  "title": "Zucchini Noodle Veggie Lo Mein",
  "image": "http://gi365.co/food/wp-content/uploads/sites/5/2015/09/Zucchini-Noodle-Lo-Mein-GI-365-4.jpg",
  "href": "http://gi365.co/food/zucchini-noodle-veggie-lo-mein/",
  "extension": "Firefox",
  "firstAdded": "2016-03-30T01:50:45.199000",
  "users": [
    null
  ],
  "keywords": [
    "avocado",
    "olive",
    "oil",
    "crimini",
    "mushrooms",
    "washed",
    "baby",
    "bok",
    "choy",
    "thoroughly",
    "red",
    "bell",
    "pepper",
    "carrot",
    "ends",
    "garlic",
    "ginger",
    "bunch",
    "green",
    "onions",
    "zucchini",
    "depending",
    "size",
    "weighing",
    "spiralized",
    "noodles",
    "tapioca",
    "starch",
    "gluten",
    "free",
    "soy",
    "coconut",
    "aminos",
    "sesame",
    "mirin",
    "nice",
    "authentic",
    "flavor"
  ],
  "directions": [
    "0",
    "Make sure all your veggies are prepped before starting the stir fry.",
    "For the bell pepper, cut out the core and remove as many seeds as you can. Thinly slice it or spiralize it by place the core side on the blade side of the spiralizer and pushing the pronged side into the bottom end of the pepper. Then turn the handle and spiralize it. Spiralize the carrots, or if they're too small, thinly slice them. For the green onions, thinly slice the whole bunch, both the green and the white part. Reserve the green part for the end of the stir fry and keep the white part with the garlic and ginger.",
    "Preheat a very large skillet (at least 15\") over medium high heat. While the skillet heats, make the sauce by mixing together the tapioca starch and soy sauce until the tapioca has completely dissolved, and there are no lumps. Mix in the sesame oil and mirin if you're using it, and set the sauce aside.",
    "When the pan is hot but not smoking, add 1 Tablespoon of the oil into the pan along with the mushrooms, bok choy, bell pepper, and carrots. If you're comfortable cooking over high heat, increase the heat from medium high to high for a more authentic seared flavor. Stir fry for 2-3 minutes, or until the veggies are starting to soften.",
    "Add the garlic, ginger, and the white part of the green onions and stir fry for an additional 1-2 minutes, or until it's fragrant and the green onions have wilted. Transfer the stir fried veggies to a large serving bowl and place the bowl in the oven at a low temperature to keep warm (150ºF) while you finish cooking.",
    "Place the pan back over high heat, and add the remaining 1 Tablespoon of oil to the pan. Add the zucchini noodles to the pan and stir fry just until the noodles are barely beginning to soften, 1-2 minutes. Add the sauce mixture and the reserved green part of the green onions, and immediately remove the pan from the heat.",
    "Add the noodles to the veggie mixture in your serving bowl and toss to completely combine. Taste and adjust the seasonings by adding a bit of sea salt if necessary.",
    "Serve immediately.",
    "The leftovers keep well for this dish, and I like to eat them cold for lunch the next day. The zucchini noodles will shed water, but you can just pour off the extra liquid, the taste is still great."
  ],
  "ingredients": [
    "0",
    "2 Tablespoons avocado oil, or olive oil",
    "12 crimini mushrooms, 6 ounces, washed and sliced",
    "2 baby bok choy, 6 ounces, thinly sliced and thoroughly washed",
    "1 large red bell pepper, 8 ounces",
    "1 large carrot, 6 ounces, peeled and ends cut off",
    "2 cloves garlic, minced",
    "2 Tablespoons ginger, minced",
    "1 bunch of green onions",
    "4-8 zucchini, depending on their size, weighing 2 pounds, spiralized into noodles",
    "1",
    "2 Tablespoons tapioca starch",
    "3 Tablespoons gluten free soy sauce or coconut aminos",
    "1 Teaspoon toasted sesame oil",
    "1 Tablespoon mirin, optional but nice for more authentic flavor"
  ],
  "__v": 1
}