{
  "hash": "988818cd43c8c4a49c29fc82415b9dbed1567eef",
  "title": "Low Fat Yogurt Panna Cotta",
  "image": "//www.thehungrybites.com/wp-content/uploads/2017/01/low-fat-yogurt-panna-cotta-dessert-sweet-healthy-recipe-strawbberies-vanilla-cream-1-150x150.jpg",
  "href": "https://www.thehungrybites.com/low-fat-yogurt-panna-cotta/",
  "extension": "Chrome",
  "firstAdded": "2018-10-27T16:10:03.679000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Lightly oil 6 ramekins 6oz (180ml) capacity or 7 ramekins 5oz (150ml) capacity. You can also use silicon molds or glasses, whatever you prefer!",
    "In a small glass pour 2 tablespoons of the cold milk, add the gelatin, stir it to combine and let it bloom.",
    "Mix the sugar and cinnamon well (this will help the cinnamon not to form lumps).Heat the rest of the milk with the sugar until hot and the sugar has dissolved. Remove from heat, add the gelatin and stir until dissolved.",
    "In a bowl, mix the yogurt, honey, lemon juice, vanilla and salt. Add the milk in small batches, stirring well after each addition.Divide mixture into ramekins and refrigerate for 4-6 hours or until firm to the touch.",
    "In a saucepan add the berries and sugar and heat until sugar is melted and berries have released their juices. Mush them with a fork or a spatula and leave them to boil.In a small glass, mix corn flour and water.When the berries start to boil, add 1 tablespoon of the corn flour mixture and stir until mixture is glossy. If you want the sauce more thick add the rest of the corn flour and stir again for 1-2 minutes. Remove from heat and let cool.",
    "If you choose to unmold the desserts, run a knife through the edge of the molds and heat them briefly by dipping them half way for 10-20 second into hot water. Invert onto plates and help them unmold with the knife.",
    "Serve with some sauce on the top.Eat!"
  ],
  "ingredients": [
    "0",
    "2 cups (500 grams) skimmed milk (2.5% fat)",
    "2 teaspoons (10 grams) unflavored gelatin",
    "1/2 cup (60 grams) sugar",
    "1/4 teaspoon cinnamon",
    "2 tablespoons (50 grams) honey",
    "2 cups (500 grams) unflavored, low fat Greek yogurt (2.5% fat)",
    "2 teaspoons vanilla",
    "1 tablespoon lemon juice",
    "A pinch of salt",
    "1 cup berries (such as strawberries, raspberries, blueberries or a mix)",
    "1/3 - 1/2 cup sugar",
    "2 teaspoons cornstarch",
    "2 tablespoons cold water"
  ],
  "__v": 1
}