{
  "hash": "34faef0f565153c53d8812b101f9327997f8f1c6",
  "title": "French Toast with Peanut Butter Maple Syrup",
  "image": "http://cdn.averiecooks.com/wp-content/uploads/2014/03/frenchtoasttext.jpg",
  "href": "http://www.averiecooks.com/2014/03/french-toast-with-peanut-butter-maple-syrup.html",
  "firstAdded": "2015-01-24T00:19:57.534000",
  "users": [
    null
  ],
  "keywords": [
    "eggs",
    "cream",
    "used",
    "skim",
    "milk",
    "granulated",
    "sugar",
    "light",
    "brown",
    "vanilla",
    "cinnamon",
    "french",
    "baguette",
    "slices",
    "honey",
    "roasted",
    "creamy",
    "peanut",
    "butter",
    "plain",
    "substituted",
    "maple",
    "syrup",
    "lite",
    "fruit",
    "garnishing"
  ],
  "directions": [
    "0",
    "In a large mixing bowl, whisk together first 6 ingredients, through cinnamon.",
    "Add the bread to the bowl a few slices at a time, using your hands to dip and coat all slices. Flip slices over so they're equally coated on both sides, dunking new slices down into the liquid. If it's easier for you to use a 9x13 pan or large baking dish and pour the coating over the bread that's arranged in a single flat layer, do so.",
    "Wait for about 10 to 15 minutes so bread absorbs coating.",
    "Spray a large non-stick skillet with cooking spray (or use butter, if preferred) and heat over medium-high heat. When the skillet is hot, add bread to it.",
    "Cook each side about 2 to 3 minutes, or until lightly golden. Repeat with all slices until done; set aside.",
    "In a medium microwave-safe bowl, soften/melt the peanut butter, about 20 seconds on high power; don't overheat it or it will scorch.",
    "Add the maple syrup and whisk until smooth and creamy.",
    "Drizzle syrup over the French toast slices you plan to consume immediately. Extra syrup will keep airtight in the refrigerator for many weeks. French toast is best warm and fresh, but extra toast will keep airtight in the fridge for up to 5 days or frozen for up to 4 months. When ready to serve, toast lightly in a toaster oven like you would with frozen toaster waffles. Optionally, garnish with fruit before serving."
  ],
  "ingredients": [
    "0",
    "3 large eggs",
    "1/2 cup milk or cream (I used skim milk)",
    "2 tablespoons granulated sugar",
    "1 tablespoon light brown sugar, packed",
    "1 tablespoon vanilla extract",
    "2 teaspoons cinnamon",
    "half of 1 French baguette, about 18 small slices sliced 1/2-inch to 3/4-inch thick",
    "1/2 cup honey roasted creamy peanut butter (plain may be substituted)",
    "1/2 cup maple syrup (I used lite)",
    "fruit for garnishing, optional"
  ],
  "__v": 1
}