{
  "hash": "b186996f9507f5fa11443c941096f17891f178cf",
  "title": "ITALIAN BEEF SANDWICH",
  "image": "",
  "href": "http://lidiasitaly.com/recipes/italian-beef-sandwich/",
  "extension": "Chrome",
  "firstAdded": "2018-02-28T16:54:00.792000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "Mix together 2 tablespoons salt, 2 teaspoons dried oregano, and the dried thyme in a small bowl. Rub the spice mixture all over the beef, and put the meat in a large resealable bag. Combine wine, 1 sliced onion, and the garlic, and pour this marinade over the meat. Seal tightly, and let marinate in the refrigerator from 4 hours to overnight. Preheat oven to 350 degrees F. Remove the meat from the bag, and rub with 2 tablespoons of the olive oil. Place the meat and the marinade in a large pan, and roast, uncovered, until tender and the meat is pink in the middle, about 1 1⁄₂ hours, flipping the meat once during cooking. Remove, and let the meat rest 15 minutes before slicing, reserving the cooking juices in the pan. Slide the sliced rolls into the oven to toast slightly as the oven cools down.",
    "Meanwhile, heat the remaining 4 tablespoons olive oil in a large skillet, and toss in the remaining onions and the celery. Sauté until the onions begin to soften, about 4 minutes. Season with the remaining salt and remaining dried oregano. Stir the bell peppers and the hot cherry peppers into the onions, and cover the skillet to cook, stirring occasionally, until the bell peppers are tender, about 8 to 10 minutes. Slice the meat, against the grain, as thinly as possible. (Use a meat slicer if you have one.) When the peppers are tender, add the sliced meat to the skillet, along with any juices left in the roasting pan. Cook until the meat is just heated through, about 3 or 4 minutes. Serve meat with peppers and onions, on the toasted rolls."
  ],
  "ingredients": [
    "0",
    "2 tablespoons plus 1 teaspoon",
    "kosher salt",
    "1 tablespoon dried oregano",
    "2 teaspoons dried thyme",
    "4 ½ - pound boneless beef rump roast",
    "2 cups dry red wine",
    "4 medium onions, sliced ¼ inch thick",
    "6 garlic cloves, crushed and peeled",
    "6 tablespoons extra- virgin olive oil",
    "Sixteen 6- inch sub rolls or lengths of Italian bread",
    "4 stalks celery, sliced ½ inch thick on the bias",
    "4 bell peppers (red and green), sliced ¾ inch thick",
    "6 to 8 pickled hot cherry peppers, stemmed"
  ],
  "__v": 1
}