{
  "hash": "703fde8dc86e2f3c652f3e96dda99d82ccecfa7e",
  "title": "Slow-Cooker Shredded Beef Tacos",
  "image": "http://www.gimmesomeoven.com/wp-content/uploads/2010/02/shredded-beef-tacos.jpg",
  "href": "http://www.gimmesomeoven.com/slow-cooker-shredded-beef-tacos/",
  "extension": "Chrome",
  "firstAdded": "2016-08-29T01:06:56.166000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Whisk together the chili powder, cumin, and smoked paprika in a small bowl. Rub the spice mix into the beef, covering each side evenly.",
    "Heat 1 tablespoon olive oil in a large skillet over medium-high heat. Carefully place the beef in the skillet and sear on each side until browned, about 2 minutes per side. Remove the beef from the skillet and place in the bottom of a slow cooker.",
    "Add the remaining 1 tablespoon olive oil and diced onion to the saute pan. Saute for an additional 3 minutes, stirring occasionally. Add the garlic and saute for 1 minute. Add the beef stock and stir the pan to deglaze it, scraping up any browned bits from the bottom of the pan. Add tomato paste and minced chipotle, and whisk into the pan sauce until combined. Bring the sauce to a boil, reduce the heat, and simmer for a 3-5 minutes until the sauce has reduced and thickened slightly. Pour the pan sauce down over the beef in the slow cooker. Cover and cook on low for 6-8 hours, or on high for 3-4 hours, until the beef shreds easily.",
    "Shred the beef with two forks, and toss to coat with any of the remaining juices. Serve the beef in the flour tortillas, topped with your favorite taco toppings."
  ],
  "ingredients": [
    "0",
    "2 Tbsp. olive oil, divided",
    "2 pounds beef (I used a boneless chuck roast)",
    "2 tsp. chili powder",
    "1 tsp. cumin",
    "1/2 tsp. smoked paprika",
    "1 cup beef stock",
    "2 Tbsp. tomato paste",
    "1 chipotle pepper in adobo sauce, minced (if you want extra flavor/heat, add an extra pepper)",
    "1 small white onion, diced",
    "5 cloves garlic, minced",
    "Flour tortillas",
    "1",
    "guacamole http://www.gimmesomeoven.com/perfect-guacamole/ or sliced avocado",
    "salsa http://www.gimmesomeoven.com/restaurant-style-salsa-recipe/",
    "Mexican rice",
    "grated cheese",
    "fresh lettuce",
    "tomato",
    "onion",
    "cilantro",
    "lime wedges"
  ],
  "__v": 1
}