{
  "hash": "b1e9d05f3feee8676ec7610acd2d6a5bb3478e95",
  "title": "COOKIE DOUGH BROWNIE CAKE",
  "image": "http://lemon-sugar.com/wp-content/uploads/2014/06/Cookie-Dough-Brownie-Cake-0006.jpg",
  "href": "http://lemon-sugar.com/2014/06/cookie-dough-brownie-cake.html/",
  "firstAdded": "2015-02-28T02:38:47.228000",
  "users": [
    null
  ],
  "keywords": [
    "brownie",
    "cake",
    "oil",
    "sugar",
    "vanilla",
    "eggs",
    "flour",
    "cocoa",
    "baking",
    "salt",
    "cookie",
    "dough",
    "filling",
    "unsalted",
    "butter",
    "room",
    "light",
    "brown",
    "confectioners",
    "allpurpose",
    "milk",
    "ganache",
    "frosting",
    "semisweet",
    "use",
    "chocolate",
    "chips",
    "whipping",
    "cream",
    "corn",
    "syrup",
    "extra"
  ],
  "directions": [
    "0",
    "Brownies:",
    "Pre-heat oven to 350 degrees (F).",
    "Prepare three 8-inch round baking pans with cooking spray and parchment.",
    "In a large bowl, combine sugar and oil. Stir with a large wooden spoon until completely combined.",
    "Add eggs one at a time, stirring and incorporating each completely before adding another.",
    "Add vanilla, stir to combine.",
    "In a medium bowl, combine dry ingredients (flour, cocoa powder, salt and baking powder.) Whisk to combine.",
    "Add dry ingredients a little bit at a time, stirring until just absorbed each time. I added mine in 3 batches. Do not over-mix, just stir until dry ingredients are fully incorporated.",
    "Pour batter evenly into three prepared pans.",
    "Bake for 20-25 minutes, or until a toothpick comes out with wet crumbs.",
    "Cool completely, then remove from pans and set aside.",
    "Prepare filling.",
    "Cookie Dough Filling:",
    "In a large bowl (I used my stand mixer) beat butter and brown sugar until light and fluffy.",
    "Add confectioners' sugar, and beat to combine.",
    "Add flour and sugar, beat until combined.",
    "Add milk and vanilla, beat until light and fully.",
    "Ganache Frosting:",
    "In a medium glass bowl, heat heavy cream in the microwave until steaming hot but not boiling, about 45 seconds. (Microwaves vary, so just watch yours carefully.)",
    "Remove hot cream from microwave, and pour chocolate chips into the cream.",
    "Allow to sit for 30 seconds, then slowly stir with a rubber spatula until cream and chocolate fully combine, and chocolate melts completely.",
    "Stir in corn syrup and vanilla, and again stir until completely combined. Set aside while you assemble the cake.",
    "Assembly:",
    "Place one layer of brownie cake on your serving platter. Spoon about 1 cup of frosting over the top of the cooled cake, and spread just to the edge of the cake.",
    "Place another layer on top of the first. Press down slightly to secure.",
    "Spoon another 1 cup of frosting over the top of the layer, and spread just to the edges of the cake.",
    "Spoon remaining frosting into a piping bag with a star tip for decorating.",
    "Place top layer of cake over the frosting. Press down slightly to secure.",
    "Place cake in refrigerator for 10 minutes.",
    "Remove chilled cake from refrigerator. Slowly pour about ½ cup of ganache over the top of the cake, and using an offset spatula, slowly spread it to the sides of the cake, just barely pushing it over the edge. Add more ganache until you reach your desired coverage.",
    "Place cake back in refrigerator for 20 minutes to allow ganache to firm up.",
    "Pipe decorations around cake, sprinkle with chocolate chips and drizzle with leftover ganache.",
    "Enjoy!"
  ],
  "ingredients": [
    "0",
    "Brownie Cake:",
    "1 and ½ cups vegetable oil",
    "3 cups sugar",
    "3 teaspoons vanilla extract",
    "6 eggs",
    "1 and ½ cups flour",
    "1 cup cocoa powder",
    "¾ teaspoon baking powder",
    "¼ teaspoon salt",
    "Cookie Dough Filling:",
    "3 sticks unsalted butter, at room temperature",
    "¾ cup light brown sugar, packed",
    "3 and ½ cups confectioners’ sugar",
    "1 cup all-purpose flour",
    "¾ teaspoon salt",
    "3 Tablespoons milk",
    "2 and ½ teaspoons vanilla extract",
    "Ganache Frosting:",
    "4 ounces semi-sweet chocolate, finely chopped (or use chocolate chips)",
    "½ cup heavy whipping cream",
    "¼ cup light corn syrup",
    "2 teaspoons vanilla extract",
    "Extra chocolate chips, for garnish"
  ],
  "__v": 1
}