{
  "hash": "b24e82b241197beb7d93f91307151e50b5b74e23",
  "title": "Chicken biryani",
  "image": "//www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--328452_12.jpg?itok=U8ngdhdS",
  "href": "https://www.bbcgoodfood.com/recipes/4686/chicken-biryani",
  "extension": "Chrome",
  "firstAdded": "2019-04-28T19:01:41.404000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Method",
    "Soak 300g basmati rice in warm water, then wash in cold until the water runs clear.",
    "Heat 25g butter in a saucepan and cook 1 finely sliced large onion with 1 bay leaf, 3 cardamom pods and 1 small cinnamon stick for 10 mins.",
    "Sprinkle in 1 tsp turmeric, then add 4 chicken breasts, cut into large chunks, and 4 tbsp curry paste. Cook until aromatic.",
    "Stir the rice into the pan with 85g raisins, then pour over 850ml chicken stock.",
    "Place a tight-fitting lid on the pan and bring to a hard boil, then lower the heat to a minimum and cook the rice for another 5 mins.",
    "Turn off the heat and leave for 10 mins. Stir well, mixing through 15g chopped coriander. To serve, scatter over the leaves of the remaining 15g coriander and 2 tbsp toasted almonds."
  ],
  "ingredients": [
    "0",
    "300g basmati rice",
    "25g butter Butter butt-errButter is made when lactic-acid producing bacteria are added to cream and churned to make an…",
    "1 large onion Onion un-yunOnions are endlessly versatile and an essential ingredient in countless recipes. Native to Asia… , finely sliced",
    "1 bay leaf",
    "3 cardamom pods",
    "small cinnamon stick",
    "1 tsp turmeric Turmeric term-er-ikTurmeric is a fragrant, bright golden-yellow root that is most commonly seen and used dried and…",
    "4 skinless chicken breasts, cut into large chunks",
    "4 tbsp curry paste (we used Patak's balti paste)",
    "85g raisins",
    "850ml chicken stock",
    "30g coriander, ½ chopped, ½ leaves picked and 2 tbsp toasted flaked almonds, to serve"
  ],
  "__v": 1
}