{
  "hash": "193db9056a296d3dd136f93ca4b6cb3651639415",
  "title": "Aloo Gobi",
  "image": "http://img.sndimg.com/food/image/upload/w_555,h_416,c_fit,fl_progressive,q_95/v1/img/recipes/84/32/4/picxkNz42.jpg",
  "href": "http://www.food.com/recipe/aloo-gobi-84324",
  "extension": "Chrome",
  "firstAdded": "2016-03-02T16:28:44.864000",
  "users": [
    null
  ],
  "keywords": [
    "oil",
    "onion",
    "pieces",
    "bunch",
    "coriander",
    "separated",
    "stalks",
    "leaves",
    "roughly",
    "green",
    "chili",
    "cauliflower",
    "evenly",
    "eighths",
    "potatoes",
    "tomatoes",
    "ginger",
    "garlic",
    "cumin",
    "seed",
    "turmeric",
    "salt",
    "garam",
    "masala"
  ],
  "directions": [
    "0",
    "Heat vegetable oil in a large saucepan.",
    "Add the chopped onion and one teaspoon of cumin seeds to the oil.",
    "Stir together and cook until onions become creamy, golden, and translucent.",
    "Add chopped coriander stalks, two teaspoons of turmeric, and one teaspoon of salt.",
    "Add chopped chillis (according to taste) Stir tomatoes into onion mixture.",
    "Add ginger and garlic; mix thoroughly.",
    "Add potatoes and cauliflower to the sauce plus a few tablespoons of water (ensuring that the mixture doesn't stick to the saucepan).",
    "Ensure that the potatoes and cauliflower are coated with the curry sauce.",
    "Cover and allow to simmer for twenty minutes (or until potatoes are cooked).",
    "Add two teaspoons of Garam Masala and stir.",
    "Sprinkle chopped coriander leaves on top of the curry.",
    "Turn off the heat, cover, and leave for as long as possible before serving."
  ],
  "ingredients": [
    "0",
    "1⁄4 cup vegetable oil",
    "1 large onion, peeled and cut into small pieces",
    "1 bunch fresh coriander, separated into stalks and leaves and roughly chopped",
    "1 small green chili, chopped into small pieces (or one teaspoon chili powder)",
    "1 large cauliflower, leaves removed and cut evenly into eighths",
    "3 large potatoes, peeled and cut into even pieces",
    "2 (8 ounce) cans diced tomatoes",
    "fresh ginger, peeled and grated",
    "fresh garlic, chopped",
    "1 teaspoon cumin seed",
    "2 teaspoons turmeric",
    "1 teaspoon salt",
    "2 teaspoons garam masala"
  ],
  "__v": 1
}