{
  "__v": 1,
  "directions": [
    "0",
    "Dough - Add milk to a 2-cup microwave-safe measuring cup, or microwave-safe bowl.",
    "Add butter and heat on high power to melt butter, about 45 seconds. Stir until butter has melted smoothly into the milk.",
    "Add the egg, pumpkin puree, and whisk to combine.",
    "Return measuring cup to microwave and heat for about 15 seconds to warm mixture up. This will help to activate the yeast; set aside briefly.",
    "To the bowl of a stand mixer fitted with the dough hook or large mixing bowl for hand kneading, add the remaining dough ingredients, thorough optional salt.",
    "Pour wet pumpkin-milk mixture over the dry ingredients.",
    "Turn mixer to low speed, and knead for 5 to 8 minutes, or until dough is smooth and has come together. This is not a sticky dough and if your dough is sticky, tacky, or gloppy, add additional flour, 1 tablespoon at a time, until dough is no longer sticky. I doubt you will need to add any, because I could have made this recipe with 2 cups flour, but went up to 2 1/4. Don't over-flour your dough because it creates rolls that are dense and heavy.",
    "Turn dough out into a mixing bowl that's been lightly sprayed with cooking spray. Flip dough over once so both sides are lightly greased, and cover bowl with plasticwrap.",
    "Place bowl in a warm, draft-free environment until dough has nearly doubled in bulk, about 45 to 60 minutes. Do not go by time elapsed on the clock. Wait until dough has nearly doubled in size, and if it takes longer than an hour, that's fine.",
    "Punch dough down and turn it out onto a nonstick surface. I spray my counter with cooking spray and don't even need to add flour.",
    "Divide dough into 8 to 12 equally-sized portions, rolling each portion into a ball. I made 8 rolls and they were very generously sized. I would aim for 9 to 10 rolls. They may look skimp now but don't worry, they rise and swell very nicely.",
    "Place dough balls into a foil-lined and cooking sprayed 9-inch square pan. If you would like to use an overnight or make-ahead option, after you get the rolls into the pan and covered with foil, place pan in fridge. When ready to bake, pick up with the next step below, making sure to allow the dough to come to room temp and rise nicely; it could take longer than the 45 minutes indicated below since dough is coming right out of a cold fridge.",
    "Cover pan with a sheet of foil, place pan in a warm, draft-free environment until dough has nearly doubled in bulk, about 45 minutes. In the last minutes of rising, preheat oven to 375F.",
    "Honey Butter - Melt butter in small microwave-safe bowl, about 45 seconds on high power.",
    "Add the honey and stir to combine.",
    "Before baking, generously brush dough with honey butter; reserve any extra and brush it on after baking.",
    "Bake for 15 to 17 minutes, or until puffed, golden, domed, cooked through, and when tapped, the rolls should sound hollow. Allow rolls to cool in pan until they're cool enough to handle before serving. Rolls will keep airtight at room temperature for up to 4 days. Heat in microwave for 5 to 10 seconds as necessary to recreate the just-baked taste and to soften. Finished (baked) rolls will keep airtight in the freezer for up to 6 months. I have not tried freezing this dough in the unbaked state but you could likely freeze it after step 12 and upon thawing, pick up with step 13; however I haven't tried. Nor have I tried doubling the recipe, but I imagine that would be fine. Bake in a 9x13 pan or similar."
  ],
  "firstAdded": "2014-08-18T23:44:25.193000",
  "hash": "ac3ad535fae37a0d757a27f4b17fd24bda090fc7",
  "href": "http://www.averiecooks.com/2013/09/honey-butter-pumpkin-dinner-rolls.html",
  "image": "http://www.averiecooks.com/wp-content/uploads/2013/09/pumpkindinnerrolls-33.jpg",
  "ingredients": [
    "0",
    "Dough 1/3 cup milk 2 tablespoons unsalted butter 1 large egg 1/2 cup pumpkin puree 2 1/4 cups all-purpose flour (bread flour may be substituted; rolls will be firmer and chewier rather than softer and fluffier; you may only need 2 cups bread flour) 2 1/4 teaspoons instant dry yeast (one 1/4-ounce packet, I use Red Star Platinum) 1 tablespoon granulated sugar 1 tablespoon pumpkin pie spice 1 teaspoon ground nutmeg 1/2 teaspoon salt, optional and to taste",
    "Honey Butter 2 tablespoons unsalted butter, melted 2 tablespoons honey Tip: Combine equal parts softened butter (not melted) and honey, and whisk together until fluffy and combined for serving with the rolls"
  ],
  "keywords": [
    "dough",
    "milk",
    "unsalted",
    "butter",
    "egg",
    "puree",
    "allpurpose",
    "substituted",
    "rolls",
    "firmer",
    "chewier",
    "softer",
    "fluffier",
    "need",
    "bread",
    "flour",
    "instant",
    "dry",
    "yeast",
    "use",
    "red",
    "star",
    "platinum",
    "granulated",
    "sugar",
    "pumpkin",
    "pie",
    "spice",
    "nutmeg",
    "salt",
    "tip",
    "combine",
    "equal",
    "parts",
    "softened",
    "honey",
    "whisk",
    "fluffy",
    "combined"
  ],
  "title": "Honey Butter Pumpkin Dinner Rolls",
  "users": [
    null
  ]
}