{
  "hash": "30c52e4af0d5afdc4649b790144388c657ea046a",
  "title": "Philly Cheesesteak Stew",
  "image": "http://thecozyapron.com/wp-content/uploads/2014/01/philly-cheesesteak-stew_01-19-14_1_ca.jpg",
  "href": "http://thecozyapron.com/philly-cheesesteak-stew-and-a-truly-inspired-start-to-the-new-year/",
  "extension": "Chrome",
  "firstAdded": "2017-02-18T20:35:24.182000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "-Add the thinly sliced beef sirloin to a large bowl, and season with a couple of pinches of salt and cracked black pepper, plus the onion powder, and toss to coat; sprinkle over 2 tablespoons of the flour, and again, toss to coat.",
    "-Place a non-stick pot over medium-high heat, and drizzle in about 3-4 tablespoons of oil; once hot, add about half of the sirloin in, and allow it to sear for about a minute or two, then toss/stir, and allow it to sear/brown on the other sides for another 1-2 minutes, and remove onto a plate to hold (the meat may still be a little pink inside); repeat with the remaining half of the sirloin, and set aside.",
    "-Next, add a little more oil to the pot if needed, and add in the sliced onions, along with a pinch of salt and cracked black pepper; allow the onions to caramelize for roughly 6 minutes, stirring frequently to avoid burning them, until golden-brown and softened; then, add in the mushrooms, and allow them to continue sauteing with the onions for another 6 minutes or so, stirring frequently.",
    "-Add in the dried thyme and the garlic, and stir to incorporate.",
    "-Once the garlic becomes aromatic, sprinkle in the remaining 2 tablespoons of flour (the tablespoons can be a bit “heaping”) over the onion/mushroom mixture, and stir well to combine and blend; next, slowly add in the hot beef stock, stirring all the while to avoid any little flour “lumps” from forming.",
    "-Reduce the heat to medium-low, and allow the stew to simmer gently for about 10 minutes, uncovered, just to “tighten” it up a bit, and to allow the flavors to marry; after 10 minutes, turn off the heat, and add the seared sirloin back in, along with any accumulated juices, and stir to combine; check to see if you need any additional salt/pepper.",
    "-To serve, ladle some stew into your hollowed out sourdough bowls, top with a slice of provolone, and place the bread bowls onto a foil-lined baking sheet and under the broiler for just a couple of moments to melt the cheese and make it gooey.",
    "-Serve with some of the hollowed out, left-over sourdough bread on the side, for dipping."
  ],
  "ingredients": [
    "0",
    "ngredients:",
    "• 1 ½ pounds very thinly sliced beef sirloin (I get mine from Trader Joe’s), or ribeye",
    "• Salt",
    "• Cracked black pepper",
    "• ¼ teaspoon onion powder",
    "• 4 tablespoons all-purpose flour, divided use",
    "• Olive oil",
    "• 2 onions, quartered and thinly sliced",
    "• 10 ounces white mushrooms, sliced",
    "• ½ teaspoon dried thyme",
    "• 2 cloves garlic, pressed through garlic press",
    "• 4 cups beef stock, hot",
    "• 4 sourdough bread bowls, centers hollowed out and reserved for dipping",
    "• 4 slices provolone cheese",
    "*Philly Cheese Steaks often have sauteed bell peppers in ’em too—feel free to slice one up and add it in with the onions and mushrooms, if you so choose.",
    "Preparation:",
    "-Add the thinly sliced beef sirloin to a large bowl, and season with a couple of pinches of salt and cracked black pepper, plus the onion powder, and toss to coat; sprinkle over 2 tablespoons of the flour, and again, toss to coat.",
    "-Place a non-stick pot over medium-high heat, and drizzle in about 3-4 tablespoons of oil; once hot, add about half of the sirloin in, and allow it to sear for about a minute or two, then toss/stir, and allow it to sear/brown on the other sides for another 1-2 minutes, and remove onto a plate to hold (the meat may still be a little pink inside); repeat with the remaining half of the sirloin, and set aside.",
    "-Next, add a little more oil to the pot if needed, and add in the sliced onions, along with a pinch of salt and cracked black pepper; allow the onions to caramelize for roughly 6 minutes, stirring frequently to avoid burning them, until golden-brown and softened; then, add in the mushrooms, and allow them to continue sauteing with the onions for another 6 minutes or so, stirring frequently.",
    "-Add in the dried thyme and the garlic, and stir to incorporate.",
    "-Once the garlic becomes aromatic, sprinkle in the remaining 2 tablespoons of flour (the tablespoons can be a bit “heaping”) over the onion/mushroom mixture, and stir well to combine and blend; next, slowly add in the hot beef stock, stirring all the while to avoid any little flour “lumps” from forming.",
    "-Reduce the heat to medium-low, and allow the stew to simmer gently for about 10 minutes, uncovered, just to “tighten” it up a bit, and to allow the flavors to marry; after 10 minutes, turn off the heat, and add the seared sirloin back in, along with any accumulated juices, and stir to combine; check to see if you need any additional salt/pepper.",
    "-To serve, ladle some stew into your hollowed out sourdough bowls, top with a slice of provolone, and place the bread bowls onto a foil-lined baking sheet and under the broiler for just a couple of moments to melt the cheese and make it gooey.",
    "-Serve with some of the hollowed out, left-over sourdough bread on the side, for dipping.",
    "Pinterest572.8k",
    "Facebook0",
    "Twitter6",
    "Tumblr3",
    "Reader Interactions",
    "COMMENTS",
    "Becky says",
    "January 20, 2014 at 9:13 am",
    "this looks a-MAY-zing! PINNED IT! thanks for sharing.",
    "REPLY",
    "The Cozy Apron says",
    "January 20, 2014 at 3:35 pm",
    "Thanks, Becky!",
    "REPLY",
    "Anna @ Bashful Bao says",
    "January 20, 2014 at 3:57 pm",
    "What a delicious concept!! Looks super yummy!!",
    "REPLY",
    "Lori says",
    "January 23, 2014 at 2:05 pm",
    "Looking forward to trying these , they look great",
    "REPLY",
    "Cyn says",
    "January 24, 2014 at 5:40 am",
    "WOW, I had to wipe a little drool there. You’re pictures are literally mouthwatering…I’m so trying this out this weekend.",
    "REPLY",
    "Terri Valenti says",
    "January 28, 2014 at 7:33 pm",
    "Thanks for sharing!",
    "REPLY",
    "Christine says",
    "January 29, 2014 at 3:38 pm",
    "Made this for dinner tonite OMG this was great!!! Will be making this again soon.",
    "REPLY",
    "The Cozy Apron says",
    "February 9, 2014 at 8:57 pm",
    "Hey Christine, that’s great! So glad you enjoyed…",
    "REPLY",
    "Jen and Emily @ Layers of Happiness says",
    "January 30, 2014 at 10:52 am",
    "I have just discovered your blog and I LOVE it!! I’m definitely your newest follower",
    "REPLY",
    "The Cozy Apron says",
    "February 9, 2014 at 8:58 pm",
    "Aw…I appreciate that very much. Thank you!",
    "REPLY",
    "Lee Tindale says",
    "February 8, 2014 at 8:30 am",
    "I am an avid recipe hoarder. I love recipes. I don’t know why, but we have a passion in life and mine is cooking and collecting recipes. The sad thing now though is I live alone with my dog as the kids have all grown up and moved on so there’s only me to cook for and I don’t make recipe inspired meals, just seems a waste of time to cook a special meal for myself. Never fear, I will continue to collect recipes and maybe I will get to use some of them for a party one day. The biggest problem I have with American recipes is some ingredients here in Perth, Western Australia, don’t exist so I have to rack my brain to think what I could buy that with the closest to what’s required. Could you please tell me all purpose flour plain or self raising?",
    "REPLY",
    "The Cozy Apron says",
    "February 9, 2014 at 9:05 pm",
    "Hi Lee! Thanks so much for stopping by all the way from “Down Under”! And thank you for sharing with me a little bit about yourself— I certainly hope that you will end up preparing something at least a little “special” for yourself at some point, and not just “save” your recipes; I know it’s not quite as fun to cook only when it is for yourself, but it’s important that we treat ourselves to something with extra intention, even if only occasionally, because it helps us to remember we are worthy of TLC. I hope you make this! All purpose flour is just “plain”, I would say. No added baking powder,etc.",
    "REPLY",
    "plain jane says",
    "August 15, 2014 at 9:56 am",
    "I’m by myself also and love to collect recipes. I will try this with modifications of canned mushrooms and ground beef instead of sirloin.",
    "REPLY",
    "The Cozy Apron says",
    "August 17, 2014 at 7:58 pm",
    "Hope your enjoy!",
    "REPLY",
    "April says",
    "February 17, 2014 at 7:04 am",
    "This looks divine! I’m starting my new blog on Pinterest and was delighted for this to be the first meal onto my ‘main dish’ board. It has so many things I love combined together. I hope to make it soon- I’m trying to look at less scrumptious food online and actually cook some. That doesn’t always work out! I’m gonna go cruise around your site a few minutes and see what else I can find!",
    "REPLY",
    "Liz says",
    "February 18, 2014 at 1:32 pm",
    "Kudos to the Cook. It was love at first site or do I mean bite?!!!",
    "I made this dish this weekend and it was beyond delicious.",
    "Very satisfying comfort food. Thank you for your phenomenal recipe.",
    "My family loved it!!!",
    "REPLY",
    "The Cozy Apron says",
    "February 18, 2014 at 5:59 pm",
    "Hi Liz! So glad you and your family enjoyed this one! And depending on where in in the country you live, chances are, it was a little bit of shield from the freezing cold outside! Thanks for the comment.",
    "REPLY",
    "olivia lolley says",
    "February 18, 2014 at 7:08 pm",
    "Could you make this in a crock pot?",
    "REPLY",
    "The Cozy Apron says",
    "February 20, 2014 at 7:12 am",
    "Sure, Olivia; just know that this type of steak is quick cooking, so I wouldn’t cook it too long. And as long as you can get some caramelization on the onions and mushrooms, that will help create that deeper flavor, too.",
    "REPLY",
    "Coty and Mariah@quirksandtwists says",
    "March 7, 2014 at 5:30 pm",
    "I cannot even begin to describe how delicious this looks!",
    "REPLY",
    "Elissa (@style_wire) says",
    "March 8, 2014 at 4:57 am",
    "Ohh, would love to make this in the crock pot!",
    "REPLY",
    "Lisa @ The Meaning of Me says",
    "March 16, 2014 at 8:11 pm",
    "This was completely wonderful! My Husband is a Philly boy and loves a good cheesesteak – he loved this, too! I’d love to feature this recipe in my weekly soup post on my blog. Your FAQ says to contact for permission, so I guess I’m asking!",
    "REPLY",
    "The Cozy Apron says",
    "March 17, 2014 at 4:38 pm",
    "Thanks so much, Lisa! Glad you both enjoyed this!",
    "REPLY",
    "maria says",
    "March 27, 2014 at 8:14 pm",
    "I made this tonight with homemade bread bowls, it was great. I used 4 five oz steak fillets, and added one green pepper . This is a keeper! Thank you!",
    "REPLY",
    "The Cozy Apron says",
    "March 28, 2014 at 5:40 pm",
    "Mmmm….homemade bread bowls, Maria? Sounds delish! So glad you you enjoyed this recipe!",
    "REPLY",
    "Chris Carter says",
    "April 22, 2014 at 9:23 pm",
    "I want this NOW!! Thank you for sharing this and being so detailed in your recipe!! I love that!!",
    "REPLY",
    "The Cozy Apron says",
    "April 23, 2014 at 6:28 pm",
    "Hi Chris, you’ve got to give this a try! Hope you enjoy.",
    "REPLY",
    "Ann Marie from Philly says",
    "May 4, 2014 at 3:09 pm",
    "Hello, just came across your blog today & love it! Thanks for sharing all your wonderful recipes and you lovely thoughts along the way. I can’t wait to try your “Philly cheesesteak stew”——we certainly love our cheesesteaks in Philly! Thank you again for bringing us into your kitchen.",
    "Ann Marie",
    "REPLY",
    "The Cozy Apron says",
    "May 5, 2014 at 4:22 pm",
    "Hi Ann Marie, what a precious, precious comment you’ve left; thank you! And I’m so thrilled to have you along with me on my adventures in my kitchen, too! Please enjoy my little tip-of-the-hat to your beloved Philly Cheesesteak!",
    "REPLY",
    "Jennifer says",
    "May 27, 2014 at 7:49 pm",
    "I made this recipe tonight and I must say how delicious this was. Everyone in our home (5 of us) including our 5 yr old loved it! At the first taste to me it reminded me of french onion soup. I just want to thank you for a wonderful meal and I look forward to making this again!",
    "REPLY",
    "The Cozy Apron says",
    "May 28, 2014 at 6:33 am",
    "Hi Jennifer, I’m so excited to read that! Glad this will be a meal that you and your family enjoy again!",
    "REPLY",
    "Martha K says",
    "June 15, 2014 at 11:25 am",
    "I usually don’t comment until I have made the recipe but I had to on this one. This recipe was shared on FB, and I just have to tell you …Thank you. This looks so amazing. I have everything, including the meat, to make this. Also that I can make with out the bread bowl and it will low carb it will fill my husband and son’s craving for a Cheesesteak Sub! Great blog. Again thank you!",
    "REPLY",
    "The Cozy Apron says",
    "June 15, 2014 at 5:59 pm",
    "Hi Martha, I’m so glad you did comment! (And don’t you just love it when you have the ingredients you need for a recipe on hand?) I truly hope you have fun preparing this hearty stew for your hubby and son’s cravings (with or without bread), and that it’ll be everything you hope for it to be! Thanks so much for stopping by, and happy cooking to you!",
    "REPLY",
    "Amanda - A Cookie Named Desire says",
    "August 4, 2014 at 8:32 am",
    "Oh. My. God. This is so good it makes me want to cry. (Is that weird? Okay, yeah, it’s weird, but I really love my food). I am drooling all over the place. I need this in my life. I WILL have this in my life. Definitely making this.",
    "REPLY",
    "Ami says",
    "August 23, 2014 at 9:12 pm",
    "Just wanted to mention that Panera sells the bread bowls already hollowed out which can save a step!",
    "REPLY",
    "The Cozy Apron says",
    "August 24, 2014 at 6:32 pm",
    "Hi Ami, yes— great tip! As a matter of fact, I purchased mine there.",
    "REPLY",
    "Jillia says",
    "September 5, 2014 at 10:51 am",
    "Philly native here. I don’t know why everyone else thinks we normally put green peppers in our cheesesteak. Where and how did this misconception ever start? The only times I ever see a “Philly Style” menu item with green peppers, it’s always somewhere outside of Philly/PA. Sure, it’s an option here, and I suppose whatever floats your boat… But a true, original Philly cheesesteak is bread, meat, and cheese (whiz or American, provolone’s debatable), “wit” or “witout” onions.",
    "That said, this looks delicious and a great idea for my homemade beef stock, so thank you!",
    "REPLY",
    "The Cozy Apron says",
    "September 6, 2014 at 3:05 pm",
    "Jillia, I love your comment; and I’m glad that your homemade beef stock can now be put to good use! Enjoy…",
    "REPLY",
    "Mike says",
    "October 29, 2014 at 5:50 am",
    "I live in Philly myself and always wonder why people think this too.",
    "REPLY",
    "Julie says",
    "October 1, 2014 at 8:25 pm",
    "I made this stew tonight for dinner. It was so good! Instead of steak I used ground pork. I’m definitely making this stew again. I shared this post on my blog’s facebook and twitter pages.",
    "REPLY",
    "The Cozy Apron says",
    "October 2, 2014 at 1:42 pm",
    "Hi Julie, that’s great! And thank you for sharing the recipe with others for them to enjoy!",
    "REPLY",
    "Audrey says",
    "October 7, 2014 at 8:09 pm",
    "This sounds awesome, can’t wait to make it. Thanks for the recipe. Please send me more recipes, I love to cook. Again thanks.",
    "REPLY",
    "The Cozy Apron says",
    "October 8, 2014 at 4:32 pm",
    "Hi Audrey, so glad you love to cook! I’ve got lots of tasty recipes here on the blog—if you want to make sure you never miss any, just sign up (at the very top right hand corner of our page) for our email! Hope you enjoy…",
    "REPLY",
    "Helen says",
    "October 12, 2014 at 5:12 am",
    "Hi there……really want to try this. But as I live in New Zealand I am not entirely sure what you mean by thinly sliced beef. Sorry…..but have not seen it sold like that here. Is it super thin like shaved ham slices…..or could regular cuts of steak be pounded down to flatten. Really hope this doesn’t sound lame",
    "REPLY",
    "The Cozy Apron says",
    "October 12, 2014 at 10:56 am",
    "Hi Helen, not a lame question at all! You can just slice a good quality steak (a quick-cooking variety) very thinly, almost like “shaving” it, for the same result. Pretty much it’s just shaved steak. Hope that helps!",
    "REPLY",
    "Jessica says",
    "October 17, 2014 at 5:52 pm",
    "This looks amazing! I have recently perfected the bread bowl and think this would be perfect in them!",
    "REPLY",
    "The Cozy Apron says",
    "October 17, 2014 at 7:03 pm",
    "Jessica, that would be amazing! Hope you try this!",
    "REPLY",
    "Jennifer Gorman says",
    "October 26, 2014 at 10:56 pm",
    "As a 48 year old woman who has lived in Southeastern PA all her life, yes sauteed green peppers are often an option you get on your cheesesteak at any corner Italian place, banana peppers too, and provolone is a perfectly accepted cheese, although they are served on an Italian bread type hoagie roll, not sourdough bread, but that is your California spin on it and it sounds even more flavorful. My husband will be so excited to try this recipe!!!! And my father, who makes his own cheesesteaks at home, will be excited as well.",
    "REPLY",
    "The Cozy Apron says",
    "October 27, 2014 at 2:47 pm",
    "Hi Jennifer, thanks so much for sharing that with me! I truly do hope all of you enjoy my little spin on one of your classics!",
    "REPLY",
    "Kristen says",
    "November 8, 2014 at 4:25 pm",
    "I pinned this a while ago but finally made it tonight. I don’t eat beef, so I subbed ground turkey and low-sodium veggie broth and it was great! I’m sure it’s fabulous in a bread bowl but I went without to save carbs and instead shredded some cheddar right into the pot just before serving. Perfect for a chilly fall night. Thanks!",
    "REPLY",
    "The Cozy Apron says",
    "November 9, 2014 at 4:46 pm",
    "Kristen, what a perfect way to “custom” make this recipe for your needs! So happy to read you enjoyed this!",
    "REPLY",
    "Allysa says",
    "November 9, 2014 at 11:21 am",
    "Made this for dinner A few weeks ago and it was a hit!!! soo good!",
    "REPLY",
    "The Cozy Apron says",
    "November 9, 2014 at 4:47 pm",
    "Thanks so much for sharing that, Allysa! Happy this was enjoyed…",
    "REPLY",
    "Meghan says",
    "November 17, 2014 at 2:53 pm",
    "Made this tonight! It was to die for but I suggest adding a couple of splashes of Worcestershire Sauce! It really added the “missing” flavour!",
    "REPLY",
    "Jan says",
    "January 25, 2015 at 9:25 am",
    "This looks delicious! Any idea of the number of calories in a serving?",
    "REPLY",
    "The Cozy Apron says",
    "January 25, 2015 at 2:33 pm",
    "Hi Jan! Thanks so much. You know, I don’t do calorie counts on my recipes, but I often refer people to this site to plug items in for some info: http://caloriecount.about.com . Hope that helps!",
    "REPLY",
    "Neesie says",
    "February 4, 2015 at 1:00 pm",
    "After you saute and onion and/or peppers puree them in a blender with some of the liquid you are using. All the flavor, none of the gastric distress. This has worked as a solution for me for many years. I do it with soups, tomato/meat sauce, and chili.",
    "REPLY",
    "Judy says",
    "February 8, 2015 at 1:37 pm",
    "I get where your coming from with the green peppers. I burp on them all day. I like them but they talk back to me. lol",
    "REPLY",
    "PJ says",
    "March 9, 2015 at 9:47 pm",
    "My broiler isn’t working so I bought a fine shred cheese and covered the bottom of the bowls with it and then ladled on the hot soup. Instant melt and wonderful soup. Mine without bread (low carb) and he had his homemade Swedish brown bread on the side. Great way for us to both have what we both want and what my health needs require (low carb/high protein)",
    "REPLY",
    "The Cozy Apron says",
    "March 10, 2015 at 2:16 pm",
    "PJ, that is a perfect and delicious way to compromise! That’s great; and I’m thrilled that you both enjoyed! Thank you for sharing.",
    "REPLY",
    "Robyn says",
    "March 30, 2015 at 10:50 pm",
    "do you think this would freeze well (without the bread bowl)?",
    "REPLY",
    "The Cozy Apron says",
    "March 31, 2015 at 1:39 pm",
    "Hi Robyn, I don’t see why not! As long as it has been completely cooled, you should be good to go in a heavy-duty, ziplock-type of bag. Hope you enjoy!",
    "REPLY",
    "Hollie says",
    "April 29, 2015 at 6:16 am",
    "Do you think one could make this in a crockpot without issue?",
    "REPLY",
    "Hollie says",
    "April 30, 2015 at 10:02 am",
    "Well, I didn’t get an answer but thought I would try it anyway in a crockpot, and it turned out great. I had to change the directions a bit to make it work, but that was minor. Delicious and easy to make. thank you for sharing this recipe.",
    "REPLY",
    "The Cozy Apron says",
    "April 30, 2015 at 1:28 pm",
    "Hi Hollie, I apologize for not being able to get back to you before you prepared this, but I’m thrilled to read that you went ahead and gave it go, and that it turned out so well! (This is one of those recipes that just works well wether you do it in the traditional way or in a crockpot.) Thanks so much for coming back to share your experience with me!",
    "REPLY",
    "Stephani says",
    "July 25, 2015 at 8:05 am",
    "Is this a soup I could make ahead a few days? Does it freeze well, do you know?",
    "REPLY",
    "The Cozy Apron says",
    "July 25, 2015 at 9:22 am",
    "Hi Stephani, you could certainly make this a few days ahead! (It will taste even richer with 2-3 days under its belt.) And if it’s only a few days, no need to freeze—but if you feel you need to, I think it would be fine. Just allow it to thaw in the fridge for a day or two. Hope you enjoy!",
    "REPLY",
    "Molly Moore says",
    "November 3, 2015 at 5:55 pm",
    "I made this for dinner tonight, it was delicious! My kids and husband loved it!",
    "REPLY",
    "The Cozy Apron says",
    "November 4, 2015 at 6:49 pm",
    "Molly, isn’t it great when the whole family likes a recipe? So thrilled to read that! Thank you for your comments.",
    "REPLY",
    "Kathlee says",
    "November 24, 2015 at 1:52 am",
    "How many cups of onions do you think your 2 onions yield, I have trouble figuring that out when a recipe calls for 2 onions, I don’t want to add too much",
    "REPLY",
    "The Cozy Apron says",
    "November 24, 2015 at 11:32 am",
    "Hi Kathlee, I’m sure as to the cups, but this recipe is a little heavier on the onions, so to speak, since it’s meant to emulate a Philly cheesesteak-style sandwich. You can use 2 small onions, or even use 1, if you prefer. It’s up to you, as you know how much “too much” would be for you. (They do sort of “melt” really nicely into the stew, however, and, in my opinion, are needed.)",
    "REPLY",
    "The Cozy Apron says",
    "November 24, 2015 at 11:33 am",
    "Sorry about the typo: I’m *not* sure as to the cups…",
    "REPLY",
    "Donald Shebondy says",
    "December 18, 2015 at 8:56 am",
    "I applaud your efforts … I will try this recipe, however, seems like there should be green bell peppers also.",
    "REPLY",
    "The Cozy Apron says",
    "December 18, 2015 at 12:18 pm",
    "Hi Donald! By all means—absolutely add in bell peppers. We leave ’em out for heartburn reasons, lol.",
    "REPLY",
    "Tiffany says",
    "January 11, 2016 at 5:58 pm",
    "This is my second time making this! A nice warm dinner for the -40 windchill up here in Canada !!! Thanks so much for sharing it’s definitely a favourite!",
    "-Tiffany",
    "REPLY",
    "The Cozy Apron says",
    "January 12, 2016 at 2:45 pm",
    "Hi Tiffany, thanks so much for sharing that with me, and I’m thrilled that you’re enjoying this recipe! So glad it’s keeping you cozy and warm in chilly Canada!",
    "REPLY",
    "Barbara Marucci Sumoski says",
    "January 12, 2016 at 9:08 pm",
    "I am from Philly also. While green peppers are an option, it is not a standard on the Philly Cheese Steaks. They certainly are good though.",
    "Aside from Panera, where is everyone getting the crusty, personal size bread bowls from??",
    "REPLY",
    "The Cozy Apron says",
    "January 13, 2016 at 6:44 am",
    "Barabara, thank you for your comments! As far as where to purchase those bread bowls, if you don’t have a Panera nearby, try a local bakery—usually the slightly more artisan bread/bake shops would have these. Hope you get to try the recipe!",
    "REPLY",
    "Peter says",
    "September 11, 2016 at 8:18 pm",
    "This turned out sooooo delicious. Thank you for sharing the recipe. I turned it up a notch while working it by adding 8 oz of cream cheese. Made for a richer flavor.",
    "REPLY",
    "The Cozy Apron says",
    "September 12, 2016 at 1:37 pm",
    "Hi Peter, glad you enjoyed! And way to make this your own with the cream cheese!",
    "REPLY",
    "D.J. says",
    "October 1, 2016 at 6:57 pm",
    "This was delicious! I added a chopped red pepper and a few dashes of worstishire sauce. My husband doesn’t eat bread so I just put his in a bowl, added the cheese on top and put it in the oven a few minutes for the cheese to bubbly. Thanks for the recipe.",
    "REPLY",
    "Kathy G says",
    "October 2, 2016 at 11:59 am",
    "I am new to Pinterest and after lots of happy browsing, this was the first recipe I tried. The whole idea felt very comforting on a rainy fall day. It turned out as delicious as it looks. The only thing I would change next time is that I would use 3 cups of beef stock instead of 4 so it would be more like stew instead of soup. Also, although it looks pretty in a bread bowl it’s just too much bread for me. Instead I bought one bigger loaf of sourdough and cut it into think crusty slices which were great for dipping. Looking forward to trying more of your recipes!",
    "REPLY",
    "The Cozy Apron says",
    "October 3, 2016 at 11:54 pm",
    "Kathy, so glad you made this! (And welcome to the world of Pinterest, lol!) Good that you made this according to your preferences—makes for the best experience. Thank you for sharing with me, and I do hope you give other recipes a try!",
    "REPLY",
    "Anne says",
    "October 31, 2016 at 9:10 pm",
    "So when you buy the meat at Trader Joe’s is it already sliced for you?",
    "REPLY",
    "The Cozy Apron says",
    "October 31, 2016 at 9:28 pm",
    "Hi Anne, yes! All of their meats are already pre-packaged and ready to go, as they don’t have a butcher department in the traditional way, just good quality meats; so you’d just look for the “thinly sliced sirloin”, in a sort of vacuum pack-type packaging. Hope that helps!",
    "REPLY",
    "Kevin Norris says",
    "November 17, 2016 at 12:41 am",
    "I made it and it is very filling and warms the soul",
    "REPLY",
    "The Cozy Apron says",
    "November 18, 2016 at 12:29 am",
    "Hi Kevin, I’m so glad to read that. I always appreciate when a person preparing a recipe of mine receives my intention, and you did—you said your soul was warmed, and I couldn’t be happier. Thank you for your comments!",
    "REPLY",
    "LEAVE A REPLY",
    "Your email address will not be published. Required fields are marked *",
    "Comment",
    "Name *",
    "Email *",
    "Website",
    "Primary Sidebar",
    "Search this website",
    "HELLO! AHOJ!",
    "Welcome to The Cozy Apron—so glad to have you as a guest at my table! Here's where I share my passion for food, people and life through my culinary creations and my writing; and where my husband shares his love for food photography and all things visual. MORE...",
    "Search this website",
    "NEWSLETTER",
    "MORE TO LOVE",
    "Falafel Wrap with Spicy Hummus, and Seeking out Those Flavors That Elevate and Warm Instead",
    "Steak and Ale Soup with Mushrooms, and the Process of Transformation",
    "Lemon Chicken Pesto Bowls, and an Aspiration to Build Bridges in This New Year",
    "Italian Vegetable Soup with Spicy Sausage and Gnocchi, and Finding Excitement in a Fresh, New Year",
    "Spicy Orange Chicken Wings, and the Deliciousness of Those Sweet and Spicy Moments of Life",
    "IN THE PRESS:",
    "TAGS",
    "apples asian autumn avocado bacon beef cake caramelized onions cheese chicken chocolate Christmas curry dip fried garlic Italian lemon marinara mashed potatoes meatballs mushrooms parmesan pasta potatoes quinoa rice roasted garlic salad salmon sandwich sausage soup spinach steak stew stuffing Thanksgiving tomatoes turkey vegetables vegetarian vinaigrette whipped cream white beans",
    "NEWSLETTER",
    "COPYRIGHT © 2012-2016 · THE COZY APRON | INGRID BEER | PRIVACY POLICY"
  ],
  "__v": 1
}