{
  "hash": "23d4e299d647631c0fae5d197aadd14601b0cd34",
  "title": "Circus Animal Cookie Fudge Yields: 64 Pieces",
  "image": "",
  "href": "http://katu.com/afternoon-live/cooking-recipes/circus-animal-cookie-fudge",
  "extension": "Chrome",
  "firstAdded": "2018-06-22T03:02:55.978000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Line an 8-inch square dish with parchment or wax paper.",
    "In a stand mixer fitted with a paddle attachment (or in a large bowl with a hand mixer), beat the cream cheese until smooth. Gradually add the powdered sugar 1/2 cup at a time, beating until fully combined.",
    "Microwave the white chocolate for 1 minute, remove and stir. Then return it to the microwave for 20-30 seconds more until smooth and lumpless. Add white chocolate to the cream cheese mixture and beat until smooth and fluffy.**",
    "Pour 1/4 of the mixture into a bowl and stir in the pink food coloring; set aside.",
    "By hand, stir the chopped cookies into the remaining (non-colored) cream cheese mixture. Pour 1/2 of the mixture into the lined dish, smoothing it into an even layer. Evenly drop spoonfuls of the pink cream cheese mixture over the white layer. Pour the remaining white cream cheese mixture over the pink layer, spreading a smooth even layer.",
    "Using a skewer or knife, swirl figure-eights throughout the fudge, reaching all the way to the bottom of the dish. Smooth out the top, and add sprinkles.",
    "Refrigerate fudge until firm (about 1 hour). Remove the fudge from the pan and cut into small squares. Store in an airtight container in the refrigerator for up to 1 month.",
    "NOTES:",
    "*Since white chocolate doesn't melt as smoothly as regular semi-sweet or milk chocolate, I went with a higher quality white chocolate, such as Lindt.",
    "**If mixture becomes too thick after adding the white chocolate, microwave mixture (in a microwave-safe bowl) for about 30-45 seconds, or until it’s easier to pour and spread in the dish."
  ],
  "ingredients": [
    "0",
    "4.5 ounces Circus Animal Cookies, coarsely chopped",
    "1 (8 oz) package cream cheese",
    "4 cups powdered sugar",
    "12 ounces white chocolate, chopped*",
    "Pink food coloring",
    "Sprinkles"
  ],
  "__v": 1
}