{
  "hash": "41d486798ab2d2a76cc7a885d3db285119868976",
  "title": "Gorgonzola Blue Cheese Burgers",
  "image": "http://www.foodiecrush.com/wp-content/uploads/2011/07/FoodieCrush-BlueCheeseBurger.jpg",
  "href": "http://www.foodiecrush.com/2011/07/craving-4th-of-july-gorgonzola-blue-cheese-burgers/",
  "extension": "Firefox",
  "firstAdded": "2015-04-21T02:52:56.766000",
  "users": [
    null
  ],
  "keywords": [
    "sirloin",
    "butchers",
    "grind",
    "meatloaf",
    "salt",
    "cracked",
    "pepper",
    "garlic",
    "good",
    "quality",
    "gorgonzola",
    "cheese",
    "yellow",
    "onion",
    "butter",
    "ketchup",
    "adobo",
    "hamburger",
    "buns"
  ],
  "directions": [
    "0",
    "Prepare gas grill or coals for grilling.",
    "In a saucepan, melt butter over medium heat. Add onions, 1 tsp salt and ½ tsp pepper to taste and sauté for 15 minutes, stirring occasionally so onions soften but don't brown.",
    "In a medium sized bowl, gently combine sirloin with garlic powder, 1 tsp salt and 2 tsp pepper. Don't overmix or the meat will become tough when grilled. Divide into four sections and gently form patties. Set aside.",
    "In a small food processor, chop adobo pepper and sauce until finely combined. Add ketchup and combine. Taste for heat, add more ketchup if it's too spicy.",
    "When coals or grill is hot, put patties on grill, turning only once. Once turned, top with gorgonzola to melt. Cook patties to your preferred doneness. I like them medium so they're still tasty juicy. Add buns ot the grill to toast. Pull both from grill when done.",
    "Assemble buns with burgs and sauteéd onions, and top with adobo ketchup and fixins. My favorites are sliced tomato, arugula or lettuce and spicy bread and butter pickles."
  ],
  "ingredients": [
    "0",
    "1 lb. ground sirloin or butcher's grind meatloaf mix",
    "2 tsp salt",
    "2½ tsp cracked fresh pepper",
    "1 tsp garlic powder",
    "¼ lb. good quality gorgonzola cheese",
    "1 yellow onion, sliced",
    "1 T butter",
    "½ C ketchup",
    "1 adobo pepper with 1 tsp sauce",
    "4 hamburger buns"
  ],
  "__v": 1
}