{
  "hash": "8ee3ba46a08bb14dc30ea288b7ab2fc1205437fa",
  "title": "COURGETTE FRITTERSRelated Nigella RecipesRelated Community Recipes",
  "image": "http://assets.nigella.com/uploads/5f665378_f92b_4396_8c41_75f162660b71/main.jpg",
  "href": "http://www.nigella.com/recipes/view/courgette-fritters-211",
  "extension": "Chrome",
  "firstAdded": "2016-01-02T01:19:30.364000",
  "users": [
    null
  ],
  "keywords": [
    "courgettes",
    "approx",
    "spring",
    "onions",
    "feta",
    "cheese",
    "bunch",
    "parsley",
    "mint",
    "extra",
    "sprinkle",
    "end",
    "paprika",
    "plain",
    "flour",
    "salt",
    "pepper",
    "eggs",
    "olive",
    "oil",
    "frying",
    "limes"
  ],
  "directions": [
    "0",
    "Coarsely grate the courgettes with either the grating blade in the processor or by hand.",
    "Spread the little shards out on a tea towel and leave for about 20 minutes to get rid of any excess wetness.",
    "Put the chopped spring onions in a bowl and crumble in the feta. Stir in the chopped parsley and mint, along with the dried mint and paprika. Add the flour and season well with salt and pepper. Gradually add the beaten egg and mix thoroughly before stirring in the drained, grated courgettes. Don't be alarmed by the unflowing straggly lumpiness of this batter; it's meant to be this way.",
    "Heat a few tablespoons of oil in a large frying pan and drop heaped dessertspoons of the mixture into the hot oil, flattening the little cakes down with the back of the spoon as you go. Cook these little patties for about 2 minutes each side until golden, and then transfer to a couple of waiting plates.",
    "Chop up the limes and tumble them about the edges of the plates. Sprinkle over a little more chopped mint and eat them just as they are, spritzed with lime juice as you go."
  ],
  "ingredients": [
    "0",
    "4 courgettes (approx. 750g / 1¾lb)",
    "6 spring onions (finely chopped)",
    "250 grams feta cheese",
    "1 small bunch fresh parsley (chopped)",
    "1 small bunch fresh mint (chopped (plus extra to sprinkle over at the end))",
    "1 tablespoon dried mint",
    "1 teaspoon paprika",
    "140 grams plain flour",
    "salt",
    "pepper",
    "3 large eggs (beaten)",
    "olive oil (for frying)",
    "4 limes"
  ],
  "__v": 1
}