{
  "hash": "98954a25ded4bc9cd575749f734a1a4de5b6176e",
  "title": "Turkey, Kale and Oat Meatballs with Quick Tomato Sauce",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2014/9/1/0/FNK_Turkey-Kale-and-Oat-Meatballs_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/food-network-kitchens/turkey-kale-and-oat-meatballs-with-quick-tomato-sauce.html",
  "extension": "Chrome",
  "firstAdded": "2015-10-06T05:42:27.703000",
  "users": [
    null
  ],
  "keywords": [
    "quickcooking",
    "rolled",
    "oats",
    "kale",
    "stems",
    "leaves",
    "roughly",
    "garlic",
    "yellow",
    "onion",
    "egg",
    "parmesan",
    "skim",
    "milk",
    "kosher",
    "salt",
    "black",
    "pepper",
    "percent",
    "fatfree",
    "turkey",
    "extravirgin",
    "olive",
    "oil",
    "nosaltadded",
    "tomatoes",
    "sprigs",
    "oregano",
    "red",
    "wholewheat",
    "angel",
    "hair",
    "pasta"
  ],
  "directions": [
    "0",
    "Pulse the oats in a food processor until coarsely ground. Add the kale, 1 teaspoon of the minced garlic and 1/4 cup of the chopped onion, and pulse until finely chopped and the texture is crumbly. Add the egg, 2 tablespoons of the Parmesan, milk, 3/4 teaspoon salt and 1/4 teaspoon pepper, and pulse until just combined. Transfer the mixture to a large mixing bowl, add the turkey and mix with your hands until well combined. Cover with plastic wrap, and refrigerate for 30 minutes.",
    "Meanwhile, bring a large pot of water to a boil.",
    "Heat the oil in a large, straight-sided skillet or Dutch oven over medium-high heat. Add the remaining onions and 1/4 teaspoon salt, and cook, stirring occasionally, until softened and lightly browned in spots, 6 to 8 minutes. Add the remaining garlic, and cook until softened, stirring constantly, about 30 seconds. Add the tomatoes, 1 1/2 cups water, 2 tablespoons of the remaining Parmesan, oregano, 1 teaspoon salt and the red pepper flakes. Stir to combine, and bring to a simmer. Cover, reduce the heat and simmer for 10 minutes.",
    "Meanwhile, remove the turkey and kale mixture from the refrigerator. Shape level tablespoonfuls into round meatballs (about 36), and place on a rimmed baking sheet.",
    "Remove the lid from the sauce. Use a metal spatula or 2 spoons to add the meatballs, one at a time, to the simmering sauce in a single layer. Cook, covered, until the meatballs are cooked through, about 15 minutes. Turn off the heat, and let the mixture sit, covered, for 5 minutes. Discard the oregano.",
    "Meanwhile, cook the pasta in the boiling water according to package directions. Drain well.",
    "To serve, divide the pasta among 6 plates or bowls. Top each serving with 7 meatballs and 1/2 cup tomato sauce. Sprinkle with the remaining Parmesan.",
    "Copyright 2014 Television Food Network, G.P. All rights reserved.",
    "From Food Network Kitchen"
  ],
  "ingredients": [
    "0",
    "1/2 cup quick-cooking rolled oats",
    "6 ounces kale, stems removed and leaves roughly chopped (about 4 packed cups)",
    "4 cloves garlic, finely minced",
    "1 large yellow onion, roughly chopped",
    "1 large egg",
    "1/2 cup grated Parmesan",
    "1/4 cup skim milk",
    "Kosher salt and freshly ground black pepper",
    "1 pound 99 percent fat-free ground turkey",
    "2 tablespoons extra-virgin olive oil",
    "One 28-ounce can no-salt-added crushed tomatoes",
    "2 sprigs oregano",
    "Pinch of crushed red pepper flakes",
    "12 ounces whole-wheat angel hair pasta"
  ],
  "__v": 1
}