{
  "hash": "614de8fed1d3016c03521cf2bd275f14a97d7168",
  "title": "10-Minute Green Gazpacho and Smoky Quesadilla",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2014/5/12/0/FNK_10-Minute-Green-Gazpacho-and-Smoky-Quesadilla_s4x3.jpg.rend.sni18col.jpeg",
  "href": "http://www.foodnetwork.com/recipes/food-network-kitchens/10-minute-green-gazpacho-and-smoky-quesadilla.html",
  "extension": "Chrome",
  "firstAdded": "2016-04-03T21:10:47.026000",
  "users": [
    null
  ],
  "keywords": [
    "sour",
    "cream",
    "english",
    "cucumber",
    "roughly",
    "clove",
    "garlic",
    "scallion",
    "white",
    "green",
    "parts",
    "separated",
    "salt",
    "medium",
    "tomato",
    "extravirgin",
    "olive",
    "oil",
    "drizzling",
    "cannellini",
    "beans",
    "strained",
    "rinsed",
    "black",
    "pepper",
    "flour",
    "tortillas",
    "slices",
    "smoked",
    "gouda",
    "cheese",
    "pickled",
    "jalapenos"
  ],
  "directions": [
    "0",
    "Preheat the broiler with a rack set about 4 inches from the heat source.",
    "Put 1/4 cup of the sour cream, 1/4 cup iced water mixed with ice cubes, the sliced cucumbers, garlic, scallion whites and a large pinch salt in a blender. Blend until mostly smooth, then add the tomatoes. Blend until smooth, then remove the small cap on the lid of the blender and slowly drizzle in 1/4 cup of the oil while the blender is running. Season with additional salt if needed. Place the soup in the freezer while you prepare the quesadillas.",
    "Place the cannellini beans and a pinch black pepper in a bowl, and roughly mash with the back of a fork. Place 2 of the tortillas on a baking sheet without letting them overlap. Brush one side of the tortillas with some of the remaining olive oil. Flip, so the oiled side is directly on the baking sheet. Divide the mashed cannellini beans between the two tortillas and use a fork or your fingers to spread the mixture evenly on the tortillas, leaving a 1/2-inch border around the edge. Lay 3 pieces of the cheese on top of the beans on each tortilla (it is okay if the cheese overlaps slightly). Top with the remaining 2 tortillas and brush the tops of the tortillas with the remaining oil.",
    "Place the quesadillas under the broiler and cook until the top tortillas are crisp and lightly golden brown, about 1 minute. Use a spatula to flip the quesadillas and cook until the cheese is completely melted and the tortillas are crisp and lightly golden brown, about 1 additional minute. Cut each into 6 wedges.",
    "To serve, ladle (or pour directly from the blender carafe) the soup in to 4 chilled bowls and drizzle with additional olive oil and several grindings of freshly ground black pepper and some of the sliced green scallions. Serve 3 pieces of quesadilla on the side of each bowl of soup along with a dollop of the remaining sour cream and some pickled jalapenos.",
    "Copyright 2014 Television Food Network, G.P. All rights reserved.",
    "From Food Network Kitchen"
  ],
  "ingredients": [
    "0",
    "1/2 cup sour cream",
    "1 English cucumber roughly chopped (about 8 ounces)",
    "1 small clove garlic, grated",
    "1 scallion, thinly sliced, white and green parts separated",
    "Fine salt",
    "1 medium green tomato, roughly chopped (about 8 ounces)",
    "1/3 cup extra-virgin olive oil, plus more for drizzling",
    "One 15-ounce can cannellini beans, strained and rinsed",
    "Freshly ground black pepper",
    "Four 8-inch flour tortillas",
    "6 slices smoked gouda cheese (about 6 ounces)",
    "Sliced pickled jalapenos, for serving"
  ],
  "__v": 1
}