{
  "hash": "278645a52956c2dbb94e31d547be906499269af9",
  "title": "Lamb steaks with mashed potato and olives",
  "image": "",
  "href": "https://recipes.lidl.co.uk/Recipes/Lamb-steaks-with-mashed-potato-and-olives",
  "extension": "Chrome",
  "firstAdded": "2019-03-18T10:15:10.940000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cooking time: 30 mins",
    "This lamb steak recipe makes a fantastic alternative to a roast if you’re looking for something a little lighter, and could even be prepared on the barbecue in summer.",
    "Peel and dice the potatoes, then add to a pan of boiling salted water and cook for 20 - 25 minutes, until soft.",
    "Meanwhile, prepare the lamb. Pat the steaks dry with kitchen towel and set aside. Pluck the rosemary from the stalks and roughly chop, then add to a bowl with the chopped garlic. Rub the steaks with the garlic rosemary mix and season generously with salt and pepper.",
    "Place a large frying or griddle pan over a medium heat and add the oil. Once hot, fry the steaks for 3 - 5 minutes on each side until cooked through. Halfway through cooking, add the tomatoes to the pan with the lamb and allow them to blister a little in the heat.",
    "Once the potatoes are cooked, drain and transfer to a bowl with the sour cream and a drizzle of oil, if desired. Mash until smooth (adding a splash of milk for a smoother consistency if required) and fold in the olives, seasoning generously with salt and pepper to taste.",
    "Divide the mash, lamb and tomatoes between plates and serve immediately, drizzling over any juices from the pan and garnishing with an extra sprig of rosemary."
  ],
  "ingredients": [
    "0",
    "600 g",
    "lamb steaks",
    "lamb steak",
    "1 kg",
    "Maris Piper potatoes",
    "Maris Piper potato",
    "50 g",
    "black olives",
    "black olive",
    "destoned and sliced",
    "2 sprigs rosemary",
    "sprigs rosemary",
    "plus extra to garnish",
    "2 garlic cloves",
    "garlic clove",
    "roughly chopped",
    "12 cherry vine tomatoes",
    "cherry vine tomato",
    "2 tbsp",
    "oil",
    "oil",
    "100 g",
    "sour cream",
    "sour cream",
    "salt",
    "salt",
    "peppers",
    "pepper"
  ],
  "__v": 1
}