{
  "hash": "4841a9fe49c79b1b6841e2f265b271fe54aa6e2c",
  "title": "Creamy Parmesan Carbonara Chicken",
  "image": "",
  "href": "https://www.cinc.kitchen/recipes/UGVFTCvAY4/creamy-parmesan-carbonara-chicken",
  "extension": "Firefox",
  "firstAdded": "2017-11-21T00:55:44.994000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Season the chicken with salt and pepper. In a shallow bowl, combine the flour and parmesan cheese. Dredge seasoned chicken in the flour mixture; shake off excess and set aside.",
    "5 minsHeat the oil and butter in a large non stick pan or well-seasoned cast iron skillet over medium-high heat until butter has melted and pan is hot. Fry the chicken until golden on each side, cooked through and no longer pink (about 4-5 minutes per side, depending on the thickness of your chicken). Transfer onto a warm plate.",
    "Add the bacon strips to the pan and fry until crispy. Drain off some excess fat, keeping about 1 teaspoons worth in the pan.",
    "1 minAdd the onion and garlic and fry until onion is transparent (about 1 minute).",
    "10 minsReduce heat to low heat, and add the 1/2 and 1/2 (or cream). Bring the sauce to a gentle simmer; season with a little salt and pepper to your taste.",
    "Add in the parmesan cheese, and allow the sauce to simmer until the parmesan cheese has melted slightly.",
    "optionalIf the sauce is too runny for your liking, add the cornstarch/water mixture into the centre of the pan and mix through fast to combine into the sauce. It will begin to thicken immediately.",
    "Add the chicken back into the pan to serve.",
    "Serve with steamed vegetables (broccoli and/or cauliflower work best), over zucchini noodles, your favourite pasta, or rice."
  ],
  "ingredients": [
    "0",
    "2 chicken breasts, large boneless and skinless, halved horizontally to make 4 filets",
    "2 tablespoons Almound Flour, heaping tablespoons",
    "3 tablespoons Parmesan cheese, finely grated",
    "1 teaspoon Salt",
    "1 pinch Cracked pepper",
    "For the Sauce",
    "1 tablespoon olive oil",
    "2 teaspoons butter ((or sub with oil))",
    "8 ounces Bacon, trimmed of fat and cut into strips",
    "1 Onion, small, chopped",
    "6 garlic cloves, large, minced or finely chopped",
    "11/2 cups 1/2 and 1/2",
    "1/2 cup Parmesan cheese, finely grated",
    "Thickening Agent",
    "1/2 teaspoon Cornstarch",
    "2 teaspoons Water"
  ],
  "__v": 1
}