{
  "hash": "4e8c9f1d7cee62ef377d8bf2d385d75b68d2da5f",
  "title": "Soft, Puffy Snickerdoodles",
  "image": "https://images.food52.com/CRa-YR0BtUNn00GoIV1mLiy7w0c=/753x502/09ee111f-7494-4b29-8e65-1de46b99fe20--2016-1206_soft-puffy-snickerdoodles_mark-weinberg_145.jpg",
  "href": "https://food52.com/recipes/65919-soft-puffy-snickerdoodles",
  "extension": "Chrome",
  "firstAdded": "2016-12-15T19:22:07.909000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium bowl, whisk together the flour, baking soda, salt, and cream of tartar to combine. Set aside.",
    "In the bowl of an electric mixer fitted with the paddle attachment, cream the butter and the sugar together until light and fluffy, 2 to 3 minutes. Add the vanilla and mix to combine. Scrape down the sides of the bowl. Add the eggs one at a time, beating well after each addition, about 30 seconds total. Scrape down the sides of the bowl after each egg is added.",
    "Add the flour mixture in two additions, scraping down the sides of the bowl each time. Mix until just blended.",
    "Refrigerate the dough for at least 15 minutes (and up to 3 days if you are especially patient) to make it easier to handle.",
    "When ready to bake, heat the oven to 350° F and line two baking sheets with parchment. Mix the topping ingredients in a small, shallow bowl until combined.",
    "Shape a tablespoon of dough into a ball and roll in the cinnamon-sugar topping to cover. Place two inches apart on the cookie sheet.",
    "Bake for 8 to 11 minutes, until the cookies are lightly colored and just firm to the touch. Cool on baking sheet for one minute before transferring to cooling rack. Cookies should stay soft for a few days if kept in a tightly sealed container."
  ],
  "ingredients": [
    "0",
    "2 3/4 cups all-purpose flour",
    "1 teaspoon baking soda",
    "1/2 teaspoon salt",
    "2 teaspoons cream of tartar",
    "1 cup unsalted butter, at room temperature",
    "1 1/3 cups sugar",
    "1 1/2 teaspoons vanilla extract",
    "2 large eggs",
    "1",
    "1/4 cup sugar",
    "1 tablespoon plus 1 teaspoon ground cinnamon (or to taste)"
  ],
  "__v": 1
}