{
  "__v": 1,
  "directions": [
    "0",
    "Cuocere al dente la pasta tenendo da parte un mestolo abbondante mestolo di acqua di cottura.",
    "Versarla poi ancora gocciolante (non scolare ma \"alzare\" i tonnarelli grondanti e trasferirli) in una padella fuori dal fuoco in cui sono stati grattugiati pepe e formaggio e in cui è stato versato un mezzo bicchiere di acqua fredda.",
    "Distribuire bene i tonnarelli nella padella, aggiungere l'acqua di cottura, amalgamare bene e rimettere il tutto sul fuoco (basso).",
    "Mantecare con cura fino a quando l’amido della pasta avrà \"legato\" il formaggio e i tonnarelli risulteranno cremosi.",
    "Quando il condimento si è amalgamato agli spaghetti, impiattare velocemente (a voler essere proprio rigorosi utilizzando piatti da portata caldi, che si fredda in un attimo e allora lì è la traGGedia), spolverizzare ancora con pepe macinato e servire velocemente.",
    "Quando postai per la prima volta questa ricetta, ebbi un'intuizione, sempre poi rimasta sulla carta, o meglio nell'etere, di provare a cuocerli come la pastarisotto (vista la grande importanza dell'amido per la formazione della crema), ovvero usando tutta e solo l'acqua che serve per la cottura, senza scolarla, cercando di azzeccare la quantità necessaria per la cottura appunto, e la residua per la cremina..."
  ],
  "firstAdded": "2014-10-08T15:13:49.253000",
  "hash": "f2a6be6a582163b017fd419f4a3e33e2289abebb",
  "href": "http://vanigliacooking.blogspot.it/2014/03/tonnarelli-cacio-e-pepe-con-pecorino-e.html",
  "image": "http://3.bp.blogspot.com/-oG48WAEw8KI/UxzA9VX9ylI/AAAAAAAAKUU/0CZuSfRrsGo/s1600/tonnarelli+cacio+e+pepe-40_b.jpg",
  "ingredients": [
    "0",
    "ingredienti x 4",
    "400 gr di tonnarelli",
    "150 gr (almeno) di pecorino di Picinisco grattugiato",
    "un paio di cucchiai di ricotta di Picinisco",
    "pepe macinato al momento (ancora meglio pestato al mortaio)",
    "scorza di limone bio grattugiato"
  ],
  "keywords": [
    "ingredienti",
    "tonnarelli",
    "almeno",
    "pecorino",
    "picinisco",
    "grattugiato",
    "paio",
    "cucchiai",
    "ricotta",
    "pepe",
    "macinato",
    "momento",
    "ancora",
    "meglio",
    "pestato",
    "mortaio",
    "scorza",
    "limone",
    "bio"
  ],
  "title": "tonnarelli cacio e pepe con Pecorino e Ricotta di Picinisco, al profumo di limone",
  "users": [
    null
  ]
}