{
  "hash": "e6aa0fbef4422e01181f5663151aded77788fe92",
  "title": "Sweet Potato Gnocchi with Sautéed Onions and Thyme",
  "image": "http://www.designsponge.com/wp-content/uploads/2012/03/gnocchi-5.jpg",
  "href": "http://www.designsponge.com/2012/03/in-the-kitchen-with-simone-anne-langs-sweet-potato-gnocchi.html",
  "extension": "Chrome",
  "firstAdded": "2017-07-03T20:37:54.049000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350ºF. Bake the sweet potato for 30–45 minutes or until well cooked and soft all the way through. Peel and discard the sweet potato skin (or sprinkle it with a pinch of salt and much on it for a snack!). You can do this as much as a day ahead of time. Let the potato cool completely.",
    "Place the sweet potato in a medium bowl and crush it with a fork until well mashed. Add the flours and salt. Knead the dough well, adding flour as necessary to allow for easy handling. Avoid adding more flour than necessary to keep the gnocchi from getting tough.",
    "When you can easily handle the dough, separate it into four segments and roll each segment on a floured surface into long skinny ropes. Each roll should be approximately 3/4 of an inch in diameter. With a fork, cut each roll into 1/2 inch gnocchi segments. If you’d like to make the traditional grooves in your gnocchi, press each piece of pasta lightly with the fork. You can store these in an airtight container in the fridge for 2–3 days.",
    "When you’re ready to cook your gnocchi, boil water just as you would normally for pasta. When the water is boiling, add a pinch of salt and the gnocchi. Keep the gnocchi simmering and stir them periodically to avoid sticking. When they float to the surface of the water, let them cook for another 5–10 minutes to taste. Strain the gnocchi from the water.",
    "For the sauce:",
    "1 whole red onion",
    "3 tablespoons lemon juice",
    "2–3 tablespoons fresh thyme",
    "olive oil for sautéing",
    "Cut your onion into quarter-inch slices.",
    "Sauté in olive oil on low for 15 to 20 minutes until soft.",
    "Add lemon juice and thyme and continue cooking for approximately 10 minutes.",
    "Mix well with the gnocchi (I recommend turning off the stove and putting the cooked and drained gnocchi into the pan with the sauce to facilitate easy mixing).",
    "Serve with a nice glass of wine and enjoy!"
  ],
  "ingredients": [
    "0",
    "For the gnocchi:",
    "1 pound of sweet potato (approximately one large sweet potato)",
    "1 1/2 cups of whole wheat flour (or all purpose, whichever you prefer)",
    "1/4 cup chickpea flour",
    "1/2 teaspoon salt"
  ],
  "__v": 2
}