{
  "hash": "9ca78601ab2cd0244b0e4dc05e3f127ebd4d0c2c",
  "title": "Emeril Lagasse's Butternut Squash and Chickpea Tagine",
  "image": "http://a.abcnews.com/assets/images/font-sm_off2.gif",
  "href": "http://abcnews.go.com/GMA/recipe/butternut-squash-chickpea-tagine-recipe-emeril-lagasse-21480703?nwltr=GMAR_featureChef_pos3",
  "firstAdded": "2015-02-27T22:00:08.109000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "smalldiced",
    "onion",
    "carrot",
    "turmeric",
    "cinnamon",
    "coriander",
    "red",
    "pepper",
    "butternut",
    "squash",
    "potato",
    "garlic",
    "golden",
    "raisins",
    "apricots",
    "saffron",
    "threads",
    "crumbled",
    "fingers",
    "cilantro",
    "sprigs",
    "tied",
    "twine",
    "kosher",
    "salt",
    "stock",
    "canned",
    "lowsodium",
    "chicken",
    "broth",
    "needed",
    "chickpeas",
    "rinsed",
    "simple",
    "recipe",
    "follows",
    "storebought",
    "lemons",
    "parsley",
    "leaves",
    "bell",
    "black",
    "zest",
    "lemon",
    "couscous",
    "squeezed",
    "juice",
    "extra",
    "virgin"
  ],
  "directions": [
    "0",
    "Heat 2 tablespoons of the olive oil in a tagine or Dutch oven over medium- high heat. Add the onion, carrot, turmeric, cinnamon, coriander, and crushed red pepper and cook until the onion is translucent, about 3 minutes. Add the butternut squash and sweet potato and cook for 7 minutes longer, stirring occasionally. Add the garlic, raisins, dried apricots, saffron, cilantro sprigs, 2 teaspoons of the kosher salt, and 2 cups of the stock and bring the mixture to a boil. Reduce the heat to medium- low and cook, covered, for 15 minutes. Add the chickpeas and preserved lemon and cook for 30 minutes longer. Remove from the heat and sprinkle half of the parsley over the top. Set aside while you prepare the couscous.",
    "In a 2- quart or larger saucepan, heat the remaining 1 tablespoon olive oil over medium- high heat. Add the bell pepper, black pepper, and remaining 1 teaspoon kosher salt and cook until soft, about 2 minutes. Stir in the lemon zest and remaining 2 cups stock and bring to a boil. Add the couscous, cover, and remove from the heat. Allow the couscous to steam for 5 minutes, then add the lemon juice, extra- virgin olive oil, and remaining half of the parsley and stir to combine. Serve the couscous in shallow bowls, with some of the stew ladled over the top.",
    "*Note: Preserved Lemons are available in Middle Eastern Markets and upscale gourmet food shops. If you cannot find any in your area and do not want to make your own, you can substitute a small amount of finely chopped lemon peel and a bit of salt.",
    "Simple Preserved Lemons",
    "4 unwaxed lemons, preferably organic, well washed and dried",
    "1/4 cup sea or kosher salt",
    "1/2 cup freshly squeezed lemon juice, or as needed",
    "Using a sharp knife, cut each lemon lengthwise almost through to the stem end, and then rotate the lemon 45 degrees and cut so that the lemon is almost quartered; the lemon should still be connected at one end, but you should be able to open it up, much like a flower. Spoon 1 tablespoon of the salt into the center of each lemon and press to close. Squeeze the lemons into a sterilized jar with a tight- fitting lid (it???s okay if you need to squeeze firmly to compact the lemons; they will soften over time) and add any salt that has fallen from the lemons to the jar. Cover the jar and set aside in a cool, dark place for several days.",
    "Uncover the jar and press down on the lemons with your fingers or the back of a spoon. Add enough lemon juice to cover them completely??? the amount of lemon juice will vary depending on their ripeness (I have had batches where no additional lemon juice was necessary because the lemons themselves exuded so much juice). Close the jar and once again set aside in a cool, dark place for 1 month, shaking the jar occasionally to distribute the salt and brine.",
    "When the lemons are ready, the peel and flesh will be very soft and you will see that the flesh easily peels away. Discard the flesh, rinse the peel briefly under cool water, and use as needed.",
    "Recipes courtesy Emeril Lagasse, from Sizzling Skillets and Other One Pot Wonders, HarperCollins Publisher, New York, 2011, copyright MSLO, Inc., all rights reserved",
    "This recipe was styled by chef Karen Pickus for Good Morning America."
  ],
  "ingredients": [
    "0",
    "3 tablespoons olive oil",
    "1 1/2 cups small-diced onion",
    "1 cup small-diced carrot",
    "1 teaspoon ground turmeric",
    "1 teaspoon ground cinnamon",
    "1 teaspoon ground coriander",
    "1/2 teaspoon crushed red pepper",
    "3 cups peeled and diced butternut squash",
    "1 1/2 cups peeled and diced sweet potato",
    "1 tablespoon minced garlic",
    "1/2 cup golden raisins",
    "1/2 cup small-diced dried apricots (about 4 ounces)",
    "4 saffron threads, crumbled between your fingers",
    "4 cilantro sprigs, tied together with twine",
    "1 tablespoon kosher salt",
    "4 cups chicken stock or canned low-sodium chicken broth, plus more if needed",
    "Two 14.5-ounce cans chickpeas, drained and rinsed",
    "1 tablespoon chopped Simple Preserved Lemons (recipe follows) or store-bought preserved lemons*",
    "1/4 cup chopped fresh parsley leaves",
    "1/2 cup small- diced red bell pepper",
    "1/2 teaspoon freshly ground black pepper",
    "Grated zest of 1 lemon",
    "10 ounces couscous",
    "2 tablespoons freshly squeezed lemon juice",
    "1 tablespoon extra- virgin olive oil"
  ],
  "__v": 1
}