{
  "hash": "7b10f2006d6d343f05b65f64fc81a242bdd6c45a",
  "title": "Buttermilk Fried Chicken Tenders",
  "image": "http://www.onceuponachef.com/images/2012/01/chicken-tenders-9.jpg",
  "href": "http://www.onceuponachef.com/2012/01/buttermilk-fried-chicken-tenders-2.html",
  "firstAdded": "2015-01-02T18:10:19.136000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "tenderloins",
    "buttermilk",
    "salt",
    "cayenne",
    "pepper",
    "garlic",
    "paprika",
    "purpose",
    "flour",
    "heaping",
    "black",
    "baking",
    "oil",
    "cooking"
  ],
  "directions": [
    "0",
    "Combine the chicken tenders with all of the marinade ingredients in a large ziplock bag. Seal the bag tightly and smush it around to ensure chicken tenders are evenly coated with buttermilk and seasoning. Place in a bowl (in case of leakage) and refrigerate overnight, or at least 4 hours.",
    "Make the breading by combining the flour, salt, pepper, garlic powder, paprika and baking powder in a large bowl. Whisk until well combined, then add the buttermilk and stir with a fork until mixture is evenly clumpy.",
    "Line a baking sheet with aluminum foil. Remove the chicken tenders from the marinade a few at a time and toss into the flour mixture. Be sure to press the chicken firmly into the breading so clumps adhere to the meat. (It's best to use one hand to remove the tenders from the bag and the other to toss in the breading.) Set breaded tenders on prepared baking sheet.",
    "Line another baking sheet with a few layers of paper towels and set aside. Add oil to a large, high-sided pot until the level reaches about 3/4-inch. Heat over high heat until oil is shimmering. (If a cube of bread sizzles when you drop it in, it's ready.) Using tongs, place several chicken tenders in the hot oil without crowding the pan. Cook until golden brown on the bottom side, a few minutes, then flip and cook until second side is also golden, a few minutes more. Set cooked tenders on baking sheet lined with paper towels to drain. Fry remaining tenders in batches. Serve hot."
  ],
  "ingredients": [
    "0",
    "2 pounds chicken tenderloins",
    "1 cup buttermilk",
    "1-1/2 teaspoons salt",
    "1/4 teaspoon cayenne pepper",
    "1/4 teaspoon garlic powder",
    "1/4 teaspoon paprika",
    "1-1/2 cups all purpose flour",
    "1 heaping teaspoon salt",
    "3/4 teaspoon black pepper",
    "3/4 teaspoon garlic powder",
    "3/4 teaspoon paprika",
    "1-1/2 teaspoons baking powder",
    "3 tablespoons buttermilk",
    "3-4 cups vegetable oil, for cooking"
  ],
  "__v": 1
}