{
  "hash": "119c6d503613e62c9cf0c4dd8a2a6abaa905b934",
  "title": "Slow Cooker Lasagna",
  "image": "//food.fnr.sndimg.com/content/dam/images/food/fullset/2011/3/31/0/EA1417H_slow-cooker-lasagna_s4x3.jpg.rend.hgtvcom.616.462.suffix/1371597314831.jpeg",
  "href": "https://www.foodnetwork.com/recipes/alton-brown/slow-cooker-lasagna-recipe-2105581",
  "extension": "",
  "firstAdded": "2018-02-13T18:40:26.197000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place the lasagna noodles in a 13 by 9-inch metal pan and pour over enough hot water to cover the noodles. Set aside until pliable, about 30 minutes. Drain the water from the noodles, separate, and set aside.",
    "Place the eggplant and zucchini in the bowl of a salad spinner. Sprinkle with the salt and purge for 20 minutes, tossing after the first 10 minutes. Remove the sausage from its casing and chop or pinch into 1/2-inch pieces. Set aside.",
    "Rinse the eggplant and zucchini under running water and spin until mostly dry.",
    "Use 4 pliable lasagna noodles to line the sides of a 3-quart slow cooker. Overlap the noodles slightly and press against the sides so they stick. Crush 1 tomato with your hand onto the bottom of the slow cooker. Cover with half of the sausage. Sprinkle with 1/2 teaspoon of the Italian seasoning, one-fourth of the flour, and one-fourth of the goat's milk powder. Add one-fourth of the purged vegetables in a layer, slightly overlapping the pieces. Add one-fourth of the sliced mushrooms in a layer. Add one-fourth of the remaining noodles in a layer, cut to fit any gaps, slightly overlapping the pieces. Gently press down on the noodles before building next layer. Crush another tomato and place atop the noodles. Add half of the ground pork, sprinkle with 1/2 teaspoon of the Italian seasoning, one-fourth of the flour, one-fourth of the goat's milk powder, one-fourth of the vegetables, and one-fourth of the mushrooms. Repeat 2 more times with the remaining ingredients. You will have 4 layers.",
    "Spread 2 tablespoons of the tomato juice from the can on the top of the last layer of the noodles. Set the slow cooker to low, cover, and cook for 5 hours. Remove any excess fat that has accumulated by pressing down directly on the top of the lasagna with a dish or small lid. Turn off the slow cooker. Sprinkle with cheese. Cover and leave for 30 minutes. Brown the cheese, if desired, using a propane torch or heat gun."
  ],
  "ingredients": [
    "0",
    "1 pound lasagna noodles",
    "10 ounces eggplant, about 1 small, quartered lengthwise and sliced on mandoline",
    "10 ounces zucchini, about 1 small, sliced lengthwise on mandoline",
    "1 pound hot and mild grass-fed beef sausage links",
    "2 tablespoons kosher salt",
    "1 (14 1/2-ounce) can whole, peeled tomatoes",
    "2 teaspoons Italian seasoning , divided",
    "1/2 ounce all-purpose flour",
    "1/2 ounce goat's milk powder",
    "2 large portobello mushroom caps, sliced",
    "1/2 pound ground pork",
    "4 ounces part-skim mozzarella, grated"
  ],
  "__v": 1
}