{
  "hash": "1805241d55a199b012b4838492f97697f7bd6933",
  "title": "Lentils folded into Yogurt, Spinach, and Basil",
  "image": "http://www.101cookbooks.com/mt-static/images/food/lentil_crostini.jpg",
  "href": "http://www.101cookbooks.com/archives/lentils-folded-into-yogurt-spinach-and-basil-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-12-05T13:01:13.196000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the lentil mixture ahead of time, then assemble at work. It's great atop a slice of toasted bread, on its own, or in a lettuce leaf.",
    "Heat a small saute pan over medium heat. Add the pine nuts or walnuts and cook until lightly toasted, 5 to 7 minutes. Lay them out on a wood cutting board to cool, then chop them roughly to the size of the lentils.",
    "If your knife is sharp enough to slice the spinach and basil leaves without bruising them, gently cut them into bite-sized pieces. Otherwise, tear by hand.",
    "Place the lentils in a bowl and mix in the spinach, basil, parsley, and garlic. Squeeze the lemon into the lentils (mindful to omit the seeds), mix, and then fold in the yogurt. Mix again, and then pour in the olive oil, stirring, as you do, to combine. At this point, taste the mixture, and season with salt, and two good grindings of pepper. Finally, fold the roasted nuts into the dish, and finish with a drizzle of oil.",
    "The lentils and greens will keep in an airtight jar in the refrigerator for at least three days.",
    "When you're ready to assemble, bring the lentil mixture to room temperature. Give it a taste, and adjust with more salt or some lemon juice. It can go on toasted levain, or along with lettuce (as more of a salad), or in a large lettuce leaf (as a wrap). Finish with some Parmesan shavings. I also couldn't help add some herb flowers I had on hand, but those are, of course, optional.",
    "Adapted from Lunch at the Shop: The Art and Practice of the Midday Meal by Peter Miller",
    "Print Recipe"
  ],
  "ingredients": [
    "0",
    "1/2 cup pine nuts or chopped walnuts",
    "2 cups baby spinach or arugula",
    "1 cup fresh basil leaves",
    "1 cup cooked lentils",
    "2 tablespoons flat-leaf parsley, chopped",
    "1 garlic clove, minced",
    "1 lemon",
    "1 cup Greek yogurt",
    "1/4 cup extra virgin olive oil",
    "fine grain sea salt",
    "freshly ground pepper",
    "1",
    "1/2 cup pine nuts or chopped walnuts",
    "2 cups baby spinach or arugula",
    "1 cup fresh basil leaves",
    "1 cup cooked lentils",
    "2 tablespoons flat-leaf parsley, chopped",
    "1 garlic clove, minced",
    "1 lemon",
    "1 cup Greek yogurt",
    "1/4 cup extra virgin olive oil",
    "fine grain sea salt",
    "freshly ground pepper",
    "2",
    "1/2 cup pine nuts or chopped walnuts",
    "2 cups baby spinach or arugula",
    "1 cup fresh basil leaves",
    "1 cup cooked lentils",
    "2 tablespoons flat-leaf parsley, chopped",
    "1 garlic clove, minced",
    "1 lemon",
    "1 cup Greek yogurt",
    "1/4 cup extra virgin olive oil",
    "fine grain sea salt",
    "freshly ground pepper"
  ],
  "__v": 1
}