{
  "hash": "57c3dbef2bb0d69179a9adba9a77232e4405a3fa",
  "title": "Cannolis",
  "image": "",
  "href": "http://recipe-folder.com/recipe/5b77316e3d946d7ece1c64c7",
  "extension": "User Added",
  "firstAdded": "2018-08-17T20:34:54.439000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Start by putting your whole milk ricotta in a fine mesh sieve and placing it over a bowl to let the moisture drain from the ricotta. Place in fridge to drain and stay cool for one hour.",
    "1",
    "In a food processor combine 250g of all purpose flour, 30g of sifted powdered sugar, 2 tsp cocoa powder, 1 tsp ground cinnamon, and ½ tsp of instant espresso. Pulse to combine before adding 30ml each of Marsala wine and white wine vinegar.",
    "2",
    "Once mixture is nice and sandy, add 2 Tbsp of butter and one whole egg, and mix for about 45 seconds or until a rough ball of dough forms.",
    "3",
    "Place dough on a lightly floured surface and knead for 2-5 minutes until it becomes silky and elastic. Wrap in plastic wrap and place in the fridge for one hour.",
    "4",
    "Next, take your cannoli molds and grease them up by spraying them down with Pam, or coating in vegetable oil.",
    "5",
    "Remove dough from fridge and roll out on a lightly floured surface until it’s about 1/16 of an inch thick (or just really thin). Using a 4-inch wide biscuit cutter, cut rounds out of the rolled out dough and cover them with plastic wrap (just lay plastic wrap over them on the counter).",
    "6",
    "Take your dough round, place the cannoli mold into the center and lightly put some egg white on one side of the dough and place the egg white side over the other to seal it.",
    "7",
    "Get your lard into a pot and heat it to 390°F, and gently place your cannolis in. Let them fry for 2-4 minutes or until golden brown, and flipping once if possible. Drain on a wire rack.",
    "8",
    "Remove ricotta from the fridge and using a spoon or a spatula, press down on the ricotta to help drain as much moisture as you can. Then in your mixing bowl, press the ricotta through the sieve using a rubber spatula. Add 125 grams of sifted powdered sugar and ½ tsp of ground cinnamon. Attach your whisk attachment, and whisk together your cannoli cream. Place cannoli cream into a piping bag.",
    "9",
    "Now that the pastry shells have cooled off, remove them from their molds.",
    "10",
    "Melt some milk chocolate (or chocolate of your choice) and dip the ends of the cannoli into the chocolate and let them harden in the fridge for 15 minutes.",
    "11",
    "Remove from the fridge and fill shells with cannoli cream. Decorate them however you like. I used chocolate chips on some and finely chopped pistachios on others. Top all with some powdered sugar. Serve and enjoy!"
  ],
  "ingredients": [
    "0",
    "48 ounces whole milk ricotta, drained",
    "1",
    "250g of all purpose flour (plus more for rolling out dough)",
    "2",
    "155g powdered sugar, sifted, divided",
    "3",
    "2 tsp cocoa powder",
    "4",
    "1 ½ tsp ground cinnamon, divided",
    "5",
    "½ tsp instant espresso powder",
    "6",
    "30ml Marsala wine",
    "7",
    "30ml white wine vinegar",
    "8",
    "2 Tbsp butter",
    "9",
    "1 whole egg",
    "10",
    "Pam spray or vegetable oil",
    "11",
    "1 egg white",
    "12",
    "Lard",
    "13",
    "Pistachios, finely chopped",
    "14",
    "Melted chocolate",
    "15",
    "Chocolate chips"
  ],
  "__v": 1,
  "hidden": true
}