{
  "hash": "1669de91597244219e7fe87cf6b2ea787cfca3cd",
  "title": "Hot cross buns",
  "image": "http://theordinarycook.co.uk/wp-content/uploads/2010/03/hot-cross-buns.jpg?w=300",
  "href": "http://theordinarycook.co.uk/2010/03/10/hot-cross-buns/",
  "extension": "Chrome",
  "firstAdded": "2016-03-04T14:39:55.688000",
  "users": [
    null
  ],
  "keywords": [
    "havent",
    "hot",
    "cross",
    "buns",
    "urge",
    "make",
    "soon",
    "possible",
    "enjoy",
    "split",
    "open",
    "spread",
    "lots",
    "butter",
    "oven",
    "heaven",
    "strong",
    "white",
    "bread",
    "flour",
    "plain",
    "mixed",
    "spice",
    "milk",
    "using",
    "orange",
    "juice",
    "instead",
    "zest",
    "comment",
    "water",
    "sachet",
    "easyblend",
    "yeast",
    "salt",
    "caster",
    "sugar",
    "egg",
    "lightly",
    "softened",
    "cubed",
    "fruit",
    "used",
    "cherries",
    "raisins",
    "cranberries",
    "crosses",
    "glaze"
  ],
  "directions": [
    "0",
    "Method",
    "Warm the milk, water (and orange juice if you are using it) in a pan until hand hot. Mix the flours, yeast, salt, sugar and mixed spice in a large bowl. Add the milk mixture and mix to a stiff dough. Add the egg, the butter, the zest (if using) and the dried fruit and mix well. Knead for about 10 minutes until elastic and smooth. If you have a free-standing mixer, simply add the dry and the wet ingredients together and combine using the dough hook and then add the dried fruit (and zest) and mix until the dough is smooth and elastic. Place into a lightly greased bowl and cover with a bin liner or clingfilm and leave until doubled in size (1½-2 hours or longer depending on the warmth of your room).",
    "Deflate the dough gently using your fingertips and split the dough into eight pieces and shape into buns. Place onto a floured board and leave to prove for 20-30 minutes under the bin liner or cling film again.",
    "To make the crosses you can mix the flour with enough water to make a stiff dough and roll out and cut strips that you stick to the top of the proved buns with a little water. Alternatively, you can add water to the flour until it makes a paste that has the consistency of double cream and then fill a food bag with this, snip off one corner and pipe a cross on top. I find this latter method much easier and I find the doughy crosses are too obtrusive and too bland tasting.",
    "Place in an oven preheated to 200°c (gas mark 6) and bake for 15-20 minutes until golden and hollow sounding when tapped on the bottom. Whilst they are cooking, heat the sugar and water for the glaze over a gentle heat until the sugar has melted and then brush over the buns as soon as they come out of the oven – finger licking good!"
  ],
  "ingredients": [
    "0",
    "If you haven’t made hot cross buns before, I urge you to make them as soon as possible and enjoy them split open and spread with lots of butter, warm from the oven – heaven.",
    "250g strong white bread flour",
    "250g plain white flour",
    "1 tsp mixed spice",
    "125ml milk, (less 2 tablespoons if you are using orange juice instead of zest, see my comment above)",
    "125ml water",
    "7g sachet of easy-blend yeast",
    "10g fine salt",
    "50g caster sugar",
    "1 egg, lightly beaten",
    "50g butter, softened and cubed",
    "100g dried fruit (I used a mix of cherries, raisins and cranberries)",
    "grated zest of ½ orange or 2 tbsp of orange juice",
    "For the crosses:",
    "plain flour",
    "water",
    "For the glaze:",
    "2 tbsp caster sugar",
    "2 tbsp water"
  ],
  "__v": 1
}