{
  "hash": "d02eb7df1a00c682e7dd653c46432ef69766d511",
  "title": "Sourdough Bread",
  "image": "https://i0.wp.com/www.tastesoflizzyt.com/wp-content/uploads/2018/01/sourdough-bread-recipe-6.jpg?resize=640%2C959&ssl=1",
  "href": "https://www.tastesoflizzyt.com/sourdough-bread/",
  "extension": "Firefox",
  "firstAdded": "2019-07-15T00:22:36.884000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Pour the warmed milk into the bowl of a stand mixer*. Sprinkle the yeast over the milk.",
    "Add the sourdough starter, canola oil, salt, sugar, baking soda and flour.",
    "Using the dough hook, mix the ingredients on medium speed until they are combined. Then set the mixer to medium speed and knead for 4-5 minutes. The dough should be slightly tacky to the touch. If you think the dough is too wet, add additional flour 1 tablespoon at a time, being careful not to add too much flour.",
    "Transfer the dough to a large bowl sprayed with cooking spray. Cover the bowl and allow the dough to rise in a warm place for 30 minutes or until double.",
    "Divide the dough into to loaves and place them in greased 8x4 or 9x5 loaf pans.",
    "Cover the loaf pans and allow the dough to rise for another 20 minutes.",
    "Preheat the oven to 400 degrees Fahrenheit.",
    "Uncover the bread pans. Brush the top of the dough lightly with oil.",
    "Bake the bread loaves for 25-30 minutes. The top should be golden brown and the loaves should sound hollow when you tap it.",
    "Allow the loaves to cool 10 minutes in the pans, then move them to a wire rack to cool completely.",
    "Store in an airtight container."
  ],
  "ingredients": [
    "0",
    "1 1/2 cups warmed milk (110-115 degrees Fahrenheit)",
    "2 1/2 teaspoons instant yeast (I love Red Star Platinum)",
    "1 cup sourdough starter",
    "1/4 cup canola oil",
    "1 teaspoon salt",
    "1 tablespoon granulated sugar",
    "1/2 teaspoon baking soda",
    "4 1/2 cups bread flour (plus an additional 1/2 cup for handling the dough)",
    "2 tablespoons canola oil (for brushing the tops of the loaves)"
  ],
  "__v": 1
}