{
  "hash": "41675f21284fe9d6ae3f85e77c132fb3ab28f7e2",
  "title": "Dr. Pepper Baby Back Ribs",
  "image": "http://www.seriouseats.com/recipes/assets_c/2010/05/20100526-dr-pepper-ribs-large-thumb-625xauto-91589.jpg",
  "href": "http://www.seriouseats.com/recipes/2010/05/barbecue-dr-pepper-baby-back-ribs-recipe.html?ref=search",
  "extension": "Chrome",
  "firstAdded": "2016-05-12T16:42:54.479000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Melt the butter in a heavy saucepan over medium heat. Add the onions and garlic and cook until the onions are translucent, about 10 minutes. Add the remaining sauce ingredients and cook until flavors are blended and sauce begins to thicken, about 30 minutes. Taste and adjust seasoning with salt and pepper. Let cool for 10 minutes and then puree with an immersion blender, or in a regular blender. Pour into a glass jar for storage, it will keep for about 2 weeks in the refrigerator.",
    "Remove the membrane and trim the ribs. Rub each rack liberally with your favorite dry rub. Wrap ribs in foil or place in a large container and store in the refrigerator over night.",
    "Remove the ribs from the fridge while preparing the smoker. Fire up the smoker to 225°F, adding the apple wood chunks when at temperature. When the wood is producing smoke, place the ribs in the smoker, meat side up, and smoke for 3-5 hours, until the ribs have a slight bend when lifted from one end. Brush on the sauce and continue to cook until sauce has caramelized, about 15-20 minutes longer. Remove from the smoker, slice the ribs, and serve."
  ],
  "ingredients": [
    "0",
    "For the sauce:",
    "4 tablespoons unsalted butter",
    "1 large onion, chopped",
    "4 cloves garlic, chopped",
    "1 12-ounce can Dr. Pepper (about 1 3/4 cups)",
    "1 cup ketchup",
    "1/2 cup apple cider vinegar",
    "1/2 cup packed dark brown sugar",
    "1/3 cup Worcestershire sauce",
    "3 tablespoons tomato paste",
    "2 teaspoons ground ancho or New Mexican chile powder",
    "1 teaspoon white pepper",
    "1 teaspoon kosher salt",
    "Fresh ground black pepper",
    "About 1 cup of your favorite dry rub",
    "2 racks of baby back ribs",
    "4-5 chunks apple wood",
    "Smoker heat: low"
  ],
  "__v": 1
}