{
  "hash": "b89c0be8d6895491c0b36e7b376b42d9c947a1f2",
  "title": "Maślana chałka z kruszonką",
  "image": "http://kuchniaprzemka.blog.pl/files/2015/11/IMG_1418-300x225.jpg",
  "href": "http://kuchniaprzemka.blog.pl/2015/11/05/maslana-chalka-z-kruszonka/",
  "extension": "",
  "firstAdded": "2016-09-17T13:11:11.473000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Wykonanie:",
    "W dużej misce kruszymy drożdże i wsypujemy 1 łyżkę cukru. Wlewamy mleko oraz wodę i wsypujemy 200g mąki. Mieszamy i tak przygotowany rozczyn zostawiamy do wyrośnięcia w ciepłym miejscu na około 30 minut.",
    "Żółtka ucieramy z pozostałym cukrem na białą masę. Dodajemy do wyrośniętego rozczynu. Mieszamy i stopniowo wsypujemy przesianą, pozostałą mąkę. Wyrabiamy dosyć długo. Na koniec wlewamy roztopione masło i dalej wyrabiamy do czasu, aż ciasto będzie gładkie, wchłonie cały tłuszcz i zacznie odchodzić od ręki.",
    "Tak przygotowane ciasto przykrywamy ścierką i pozostawiamy do wyrośnięcia na około 30 minut w ciepłym miejscu.",
    "Kolejnym etapem przygotowania chałki jest jej formowanie.",
    "Ciasto dzielimy na 2 części, a następnie każdą z nich dzielimy na 3 równe części. Każdą część ciasta rolujemy w dosyć długi wałek długości około 40cm. Wszystkie 3 wałeczki łączymy na końcach i zaplatamy warkocz, przekładając wałeczki naprzemiennie.",
    "Na koniec łączymy razem na końcu, zakładając ciasto pod spód, tak aby w czasie pieczenia nie rozpadło się.",
    "W taki sposób postępujemy z drugą częścią ciasta."
  ],
  "ingredients": [
    "0",
    "Dzisiaj zapraszam na chałkę, ciasto dobrze znane chyba każdemu.",
    "Maślane ciasto drożdżowe, zaplecione w warkocz, zwieńczone słodką i chrupiącą kruszonką. Pychota!",
    "Chałka to idealna propozycja na śniadanie z dodatkiem masła i ulubionej konfitury. Do zestawu szklanka mleka lub kakao i nic więcej nie potrzeba.",
    "Zapraszam do przepisu :)",
    "Składniki (2 sztuki):",
    "Ciasto:",
    "50g drożdży",
    "100g + 1 łyżka cukru",
    "1 szklanka ciepłego mleka",
    "0.5 szklanki ciepłej wody",
    "850g mąki pszennej",
    "5 żółtek",
    "150g masła",
    "szczypta soli",
    "Kruszonka:",
    "200g mąki pszennej",
    "100g cukru pudru",
    "100g masła",
    "3 łyżki oleju roślinnego",
    "opakowanie cukru wanilinowego",
    "Dodatkowo:",
    "1 jajko do posmarowania ciasta"
  ],
  "__v": 1
}