{
  "hash": "62430c801f7927c501203c4944621cdb248f7781",
  "title": "Beef & Mushroom Country Casserole",
  "image": "http://www.budgetbytes.com/wp-content/uploads/2016/10/Beef-Mushroom-Country-Casserole-V.jpg",
  "href": "https://www.budgetbytes.com/2016/10/beef-mushroom-country-casserole/",
  "extension": "Firefox",
  "firstAdded": "2018-02-13T00:18:33.555000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cook the noodles according to the package directions, but until slightly less done. The noodles will further cook while the casserole bakes. Once cooked, drain the noodles and set it aside.",
    "While the noodles are cooking, finely dice the onion and slice the mushrooms.",
    "Add the cooking oil and ground beef to a large skillet. Cook over medium heat until the beef is fully browned. If using a higher fat content beef, drain off the excess fat before continuing.",
    "Add the diced onion, sliced mushrooms, garlic powder, salt, and some freshly cracked pepper to the skillet. Continue to sauté over medium heat until the mushrooms are soft and the onions are transparent. Add the tomato sauce and Worcestershire sauce to the beef and mushroom mixture. Stir to combine, then simmer for a few minutes, or until it thickens slightly.",
    "Preheat the oven to 350 degrees. Return the drained noodles to the pot they were boiled in (heat turned off) and add the beef and tomato mixture, diced tomatoes (drained), sour cream, half of the shredded cheddar, and half of the green onions. Stir to combine and then transfer the mixture to a 9x13 inch casserole dish.",
    "Top the casserole with the remaining shredded cheese, then bake in the preheated oven for 30 minutes, or until it is bubbling around the edges and the top is starting to brown just slightly. After removing from the oven, sprinkle the remaining green onions over top."
  ],
  "ingredients": [
    "0",
    "2 Tbsp cooking oil $0.04",
    "1 lb ground beef $1.99",
    "16 oz mushrooms $1.99",
    "2 onion $0.25",
    "0.5 tsp garlic powder $0.02",
    "0.5 tsp salt $0.02",
    "Freshly cracked pepper $0.03",
    "1 Tbsp Worcestershire sauce $0.03",
    "16 oz extra wide egg noodles $1.00",
    "30 oz can tomato sauce $0.65",
    "30 oz can fire roasted diced tomatoes, drained $1.50",
    "16 oz sour cream $1.49",
    "16 oz medium cheddar, shredded $2.79",
    "8 green onions, sliced"
  ],
  "__v": 2
}