{
  "hash": "289fbc16ab1d21b727c822b2af70071c552c37d7",
  "title": "Sweet Potato and Black Bean Enchiladas",
  "image": "https://ob8qxdtnu3-flywheel.netdna-ssl.com/wp-content/uploads/2012/10/4Y0A0752-2.jpg",
  "href": "https://www.acouplecooks.com/sweet-potato-and-black-bean-green-enchiladas/",
  "extension": "Chrome",
  "firstAdded": "2017-07-03T22:59:24.132000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350°F.",
    "Peel and dice the sweet potatoes. Place them a pot and cover with water; add a pinch of salt. Bring to a boil and cook until tender, around 12 to 15 minutes.",
    "Finely dice 1 red onion. Drain and rinse the black beans. Chop ¼ cup cilantro.",
    "In a large bowl, combine the cooked sweet potato, black beans, red onion, green chilies, ½ tablespoon cumin, 1 tablespoon chili powder, ½ teaspoon garlic powder, ½ teaspoon kosher salt, and fresh ground pepper. Mix to combine.",
    "Warm the tortillas for a minute in the microwave, or in a pan for a few seconds per side, so that they are flexible. In a large baking dish, spread 1 cup of the salsa verde. Fill each tortilla with a heaping ½ cup scoop of the filling, add ¼ cup cheese, and roll it up. Place each enchilada seam-side down in the baking dish. Repeat for the remaining tortillas. When all enchiladas are in the dish, top with the remaining salsa verde and the remaining cheese.",
    "Place in the oven and bake for 20 minutes, until the cheese is melted.",
    "Serve garnished with sour cream (mixed with a few drops of water to loosen it) and chopped cilantro."
  ],
  "ingredients": [
    "0",
    "2 medium to large sweet potatoes (3 cups diced)",
    "1 red onion",
    "15-ounce can black beans",
    "¼ cup cilantro, chopped",
    "8 ounces canned diced green chilies (about 1 cup)",
    "½ tablespoon cumin",
    "1 tablespoon chili powder",
    "½ teaspoon garlic powder",
    "½ teaspoon kosher salt",
    "Fresh ground black pepper",
    "2 cups salsa verde (or homemade tomatillo salsa)",
    "8 ounces Colby jack cheese, shredded",
    "8 8-inch whole wheat flour tortillas (or 10 6-inch)",
    "Sour cream"
  ],
  "__v": 1
}