{
  "__v": 1,
  "directions": [
    "0",
    "Preheat your oven to 375F degrees, and place a rack in the middle. Oil a 10-inch tart pan and set aside.",
    "Start by tossing the sliced zucchini with the salt in a medium bowl. Transfer the zucchini to a colander and let it drain while you make the tart shell and tomato sauce.",
    "To make the tart shell combine the flour, salt, and lemon zest in a large mixing bowl. Drizzle the olive oil over the flour and stir that in as well. Drizzle the cold water over the flour and mix with a fork just until it is absorbed. Knead one or twice - just until the dough comes together into a ball. On a lightly floured surface use a rolling pin to roll the dough into a circle roughly 13-inches across. Ease the pastry into your tart pan and press it into the corners and up the sides without stretching the dough. Trim away any excess dough, and place the pan in the refrigerator for at least thirty minutes. When the dough is done resting, prick the crust with a fork a few times. Now line the pastry with parchment paper and fill the tart with pie weights. Bake for 15 minutes. Carefully remove the paper and pie weights, then toast the tart crust in the oven for another five minutes or so before transferring it to a rack to cool. Leave the oven on, but dial it down to 350F.",
    "In the meantime, you can make the sauce. Stir the garlic, olive oil, red pepper flakes, and salt together in a small, cold saucepan. Turn the heat to medium-high and cook until the garlic starts to sizzle just a bit. Stir in the crushed tomatoes, bring to a simmer, cook the sauce down a bit, 10 minutes or so, then remove from heat.",
    "When you are ready to assemble the tart, use a spatula to spread half of the ricotta cheese across the base of the tart shell. Now spoon about half of the sauce over the ricotta and arrange half of the zucchini in a single layer on top of the sauce (see image). If your zucchini is still quite wet, press it into some paper towels. I use my fingers for this next part. After spooning the remaining ricotta over the zucchini, push it around a bit with your fingers so that it forms a layer. Arrange another layer of zucchini and finish with the remaining sauce. You want the filling to nearly, but not quite fill the pan.",
    "Place the tart on a rimmed baking sheet - in case you end up with an overflow - and bake for roughly 40 minutes or until the tart is cooked through. Remove and let cool for 10 minutes before serving. I would have dusted the top of this with a bit of Parmesan, but was out of it!",
    "Serves 8."
  ],
  "firstAdded": "2014-06-17T23:14:16.332000",
  "hash": "d33e66ec493cfe606efbeaef65477c4cad626233",
  "href": "http://www.101cookbooks.com/archives/lasagna-tart-recipe.html",
  "image": "http://www.101cookbooks.com/mt-static/images/food/lasagna_tart_recipe.jpg",
  "ingredients": [
    "0",
    "2 medium zucchini, sliced into very very thin coins",
    "scant 1 teaspoon fine grain sea salt",
    "Tart Crust",
    "2 cups whole wheat pastry flour (or spelt flour)",
    "1 teaspoon fine grain sea salt",
    "zest of one lemon",
    "1/4 cup olive oil",
    "scant 1/2 cup cold water",
    "Tomato Sauce",
    "3 cloves garlic, minced",
    "2 tablespoons extra-virgin olive oil",
    "scant 1 teaspoon red pepper flakes",
    "pinch of salt",
    "1 14-ounce can crushed tomatoes",
    "1 1/2 cups ricotta cheese"
  ],
  "keywords": [
    "medium",
    "zucchini",
    "coins",
    "scant",
    "salt",
    "tart",
    "crust",
    "wheat",
    "pastry",
    "spelt",
    "flour",
    "zest",
    "lemon",
    "olive",
    "oil",
    "cold",
    "water",
    "tomato",
    "garlic",
    "extravirgin",
    "red",
    "pepper",
    "tomatoes",
    "ricotta",
    "cheese"
  ],
  "title": "Lasagna Tart Recipe",
  "users": [
    null
  ]
}