{
  "hash": "b067c9d52de2b2feb9f2560aa08ea428f2cab438",
  "title": "Vegan Sweet Potato Mac n Cheese (Gluten Free)",
  "image": "http://i2.wp.com/willfrolicforfood.com/wp-content/uploads/2015/11/vegan-sweet-potato-mac-n-cheese-gluten-free-0894.jpg?resize=682%2C455",
  "href": "http://willfrolicforfood.com/2015/11/vegan-sweet-potato-mac-n-cheese-gluten-free.html",
  "extension": "",
  "firstAdded": "2015-11-11T16:27:50.721000",
  "users": [
    null
  ],
  "keywords": [
    "dry",
    "gluten",
    "free",
    "pasta",
    "medium",
    "yellow",
    "onion",
    "clove",
    "garlic",
    "roasted",
    "potato",
    "skin",
    "hemp",
    "hearts",
    "sunflower",
    "seeds",
    "mellow",
    "white",
    "miso",
    "nutritional",
    "yeast",
    "extra",
    "virgin",
    "olive",
    "oil",
    "water",
    "liking",
    "celtic",
    "salt",
    "black",
    "pepper",
    "slice",
    "panko",
    "bread",
    "crumbs"
  ],
  "directions": [
    "0",
    "Prepare the pasta according to package directions.",
    "While the noodles are boiling, make the sauce.",
    "Sauté the onion with a drizzle of olive oil in a cast iron skillet (or large sauté pan) set over high heat. Stir occasionally. Cook until the onions caramelize and brown, 5-8 minutes. Add the minced garlic and cook 1-2 minutes more, until the garlic browns and becomes aromatic. Remove from heat.",
    "To the bowl of a high powered blender, add the onion and garlic, roasted sweet potato, hemp hearts, sunflower seeds, miso, nutritional yeast, olive oil, water, salt and pepper. Blend on high until completely creamy. Add more salt or pepper, to taste.",
    "Once the pasta is cooked, drain the pasta of water. Then rinse the pasta in cold water, breaking up the noodles with your hands, and drain again (this removes the excess starch that makes gluten free pasta stick together).",
    "Add the pasta to your cast iron skillet (or serving dish). Drizzle with olive oil and toss.",
    "Add your slice of toast to the (clean and dry) bowl of your blender. Pulse until the toast breaks up into semi-fine breadcrumbs.",
    "Add the \"cheesy\" sauce to a pot and bring it to a simmer, stirring relatively constantly.",
    "Pour the \"cheesy\" sauce over top of the noodles and toss everything together. Top with the breadcrumbs and serve immediately. Enjoy!"
  ],
  "ingredients": [
    "0",
    "10 ounces dry gluten free pasta (or pasta of your choice)",
    "½ medium yellow onion, minced",
    "1 clove garlic, minced",
    "1½ cups roasted sweet potato, skin removed",
    "2 tablespoons hemp hearts",
    "5 tablespoons sunflower seeds",
    "2 tablespoons mellow white miso",
    "5 tablespoons nutritional yeast",
    "2 tablespoons extra virgin olive oil + 1 teaspoon more",
    "1 cup water + more to your liking",
    "½ teaspoon Celtic sea salt + more to taste",
    "1 teaspoon black pepper, ground",
    "1 slice gluten free bread, toasted OR 1 cup gluten free panko bread crumbs"
  ],
  "__v": 1
}