{
  "hash": "940f5149313f0a86de58fac294d50e047e2972d9",
  "title": "SOUTHERN SWEET POTATO PIE",
  "image": "https://divascancook.com/wp-content/uploads/2017/10/sweet-potato-pie-recipe-1024x768.jpg",
  "href": "https://divascancook.com/southern-sweet-potato-pie-recipe-soul-food/",
  "extension": "Chrome",
  "firstAdded": "2019-11-20T14:07:55.595000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 425 F.",
    "Pierce sweet potatoes with a fork several times.",
    "Place on foil-lined baking sheet.",
    "Bake for 45 minutes or until very tender.",
    "Let cool while preparing the brown butter.",
    "To make the brown butter, add butter to a heavy-bottom skillet over medium heat.",
    "Once butter has melted it will begin to foam a bit, whisk continuously while scraping the bottom of the pan.",
    "The butter will begin to turn golden and form golden brown bits on the bottom of the pan, keep whisking.",
    "Once the aromas become nutty (almost like the smell of caramel) and the solids in the bottom of the pan are golden brown remove from heat. (see note)",
    "Pour into a glass dish (including the brown solids) and set aside to let cool.",
    "In a large bowl, scoop out the flesh of the cooled sweet potatoes.",
    "Mix until creamy and smooth, adding a few splashes of water(or milk) until you have the texture of a very thick puree. (don't get it too watery, just use enough water to make mixing easier)",
    "Mix in the cooled brown butter until smooth.",
    "Mix in the brown sugar, white sugar, evaporated milk, eggs (see note before adding), vanilla extract, cinnamon, nutmeg, ginger, clove (if using), juice, and flour until well combined.",
    "Pour into pie crust shell and smooth the top.",
    "Bake on middle rack in preheated 350 F. oven for 55 minutes.",
    "Remove from oven and let cool completely until the middle is firmly set.",
    "Refrigerate until ready to serve. (You can absolutely serve it warm, but I like for it to sit in the fridge for a few hours for a denser, creamier texture.)",
    "Serve with sweetened whipped cream or vanilla ice cream."
  ],
  "ingredients": [
    "0",
    "1 Homemade Deluxe Buttery Pie Crust see my recipe",
    "1/2 cup unsalted butter cut into cubes or slices",
    "2 lb. sweet potatoes washed & dried equals about 2 cups pureed",
    "1/2 cup light brown sugar packed",
    "1/2 cup granulated sugar",
    "1/2 cup evaporated milk",
    "2 eggs room temperature",
    "1 teaspoon vanilla extract",
    "1/2 teaspoon cinnamon",
    "1/2 teaspoon nutmeg",
    "1/4 teaspoon ginger",
    "tiny pinch clove optional",
    "2 tablespoons orange or pineapple juice I use a mixture of both",
    "1 1/2 tablespoons all-purpose flour"
  ],
  "__v": 1
}