{
  "hash": "61c4486bd1f534b444700627c419189833ec37cc",
  "title": "Easy Vegan Buttercream Frosting Recipe",
  "image": "http://cdn2.veganbaking.net/2013/content/vegan-toasted-coconut-cake-frosted.jpg",
  "href": "http://www.veganbaking.net/recipes/cake-decorating/frostings/easy-buttercream-frosting",
  "extension": "Chrome",
  "firstAdded": "2017-08-27T17:41:19.642000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare your chilled Vegan Butter",
    "Prepare your Vegan Butter if using. Transfer the Vegan Butter or stick margarine to a medium mixing bowl and place it in the refrigerator for at least 20 minutes so everything chills. This will allow the Vegan Butter to melt slowly and whip properly.",
    "2) Whip the Vegan Butter",
    "Remove the bowl from the refrigerator and whip on low while working your way up to high until the Vegan Butter is smooth. This should take about 30 seconds.",
    "3) Beat in the confectioners sugar",
    "Add the confectioners sugar and beat on high until the sugar has been moistened by the Vegan Butter, about another 30 seconds. Scrape the sides of the bowl down towards the center with a spatula.",
    "4) Beat in the rest of the ingredients",
    "Add the non-dairy milk, apple cider vinegar, vanilla extract, salt, almond extract and beat on high until the frosting is smooth and slightly fluffy, about 4 minutes. Due to coconut oil having a melting temperature of 77F (25C), beating beyond 4 minutes can result in the frosting melting if you’re using a Vegan Butter that contains this oil. If this happens or if you’re working in an especially hot kitchen, don’t hesitate to place the mixing bowl in the refrigerator briefly to give the frosting a chance to firm back up slightly. Keep in mind that your cake will need to be kept below 77F (25C) in order for the frosting to maintain its shape on the cake. If you’d prefer a frosting that stays put in higher temperatures, look to Vegan Butter made with cocoa butter which has a melting temperature of 93-100F (34 to 38C) which is closer to the melting temperature of milkfat found in most traditional frosting recipes.",
    "Find out more about the melting temperatures of fats.",
    "5) Chill the vegan frosting briefly for optimal texture",
    "After whipping, place the frosting in the refrigerator for about 10 minutes to firm it up enough to apply to a cake. Store the frosting in a covered container in the refrigerator for up to 6 months. Remove it from the refrigerator about 2 hours before using so it can soften accordingly. This recipe makes about 1 ¾ cups of Easy Vegan Buttercream Frosting which is enough to frost one layer of an 8 inch round cake."
  ],
  "ingredients": [
    "0",
    "1 cup (215 grams) Regular Vegan Butter or margarine, refrigerator temperature",
    "2 cups (260 grams) confectioners sugar",
    "1 Tablespoon + 2 teaspoons (24 mL) non-dairy milk",
    "¾ teaspoon apple cider vinegar",
    "¾ teaspoon vanilla extract",
    "⅛ teaspoon salt",
    "⅛ teaspoon almond extract"
  ],
  "__v": 1
}