{
  "hash": "163115c5776e92f9848405eecbacd46e2d8db8d1",
  "title": "The Best Bakery Style Double Chocolate Chip Cookies",
  "image": "https://thefoodcharlatan.com/wp-content/uploads/2017/08/IMG_6439-2-e1502354007767.jpg",
  "href": "https://thefoodcharlatan.com/the-best-double-chocolate-cookies-recipe/",
  "extension": "Chrome",
  "firstAdded": "2019-11-10T18:50:35.563000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large bowl or stand mixer, beat the butter until light and fluffy, 2 minutes or so, scraping the edges.",
    "Add the white and brown sugar and beat 1 more minute, scraping bottom and sides.",
    "Add 2/3 cup (4 oz) dark chocolate (chop it with a knife if you aren't using chips) to a small bowl. Microwave in 20-30 second increments until it is getting smooth but there are still some lumps. Let it sit for 1 minute, then stir until it is completely smooth. (See photos) Beat the chocolate into the dough.",
    "Add eggs and vanilla and beat well, scraping the edges and bottom of the bowl.",
    "Add the flour, cocoa, baking soda and salt. Stir the dry ingredients together a bit with a small spoon so you don't end up with any lumps of salt or soda in your cookies. Then beat the dry ingredients into the dough.",
    "When the dough is just starting to come together and there are still streaks of flour, add the chocolate chips. You can use semisweet chocolate, dark chocolate, or any combination of the two. You can also use a bar of chocolate that you have chopped. (12 ounces)",
    "Beat in the chocolate chips and mix until the dry ingredients are completely incorporated. Don't over mix! Stop the mixer as soon as it all comes together.",
    "At this point you need to chill the dough. It's too sticky to handle right now, plus it has to be completely cold when it goes in the oven. Method 1: Cover the mixing bowl and stick it in the fridge. Wait 2-3 hours until completely chilled, then let it sit out on the counter until it is soft enough to shape into balls, then proceed with Step 10.",
    "Method 2: Cover the mixing bowl and put it in the freezer for 30 minutes. Take it out and shape the dough as described in Step 10. Place the shaped cookies onto a plate, cover with plastic wrap and refrigerate 30 minutes,",
    "To shape the dough into cookies, use a 1/4 cup measuring cup. I really like these flexible measuring cups. Pack the dough into a quarter cup, then turn out and use your hands to shape them into a \"tall\" cookies. They should be taller than they are wide. See photos.",
    "Preheat the oven to 350 degrees F.",
    "Once you have completely cold shaped cookies, place them on a baking sheet lined with parchment paper or a silicone baking mat. You can put 8 cookies on each pan. Make sure there are at least 2 inches in between each cookie.",
    "Bake for 10-11 minutes. DO NOT over bake. They should still look pretty soft in the middle when you take them out, but shouldn't be shiny anymore.",
    "Let cool on the pan for 5-10 minutes.",
    "Use a spatula to transfer to a cooling rack.",
    "Eat one now. With a tall glass of milk.",
    "When they are cool, store the rest in a large tupperware or ziplock bag. They will keep on the counter for 2-3 days."
  ],
  "ingredients": [
    "0",
    "1 cup salted butter, softened (2 sticks)",
    "1/2 cup white sugar",
    "1 cup brown sugar",
    "4 ounces (2/3 cup) dark chocolate (50-60%), melted",
    "2 large eggs",
    "4 teaspoons vanilla",
    "2 cups flour, spooned and leveled",
    "1 cup cocoa powder, spooned and leveled",
    "1 teaspoon baking soda",
    "3/4 teaspoon kosher salt",
    "2 cups chocolate chips (dark or semi-sweet, or half of both)"
  ],
  "__v": 1
}