{
  "__v": 1,
  "directions": [
    "0",
    "For the Mugcake - Prepare a large mug (at least 14 to 16 ounces) or two smaller mugs by spraying the inside with cooking spray; set aside.",
    "In a small microwave-safe bowl, melt the butter, about 1 minute on high power.",
    "Add the chocolate chips and stir with a fork or whisk until melted and mixture is smooth. If necessary, heat for about 10 seconds if your chips are resisting melting.",
    "Add the egg, yogurt and water (or buttermilk, and omit the water if using buttermilk), sugar, cocoa powder, brown sugar, vanilla, optional espresso granules, and whisk until smooth.",
    "Add the flour, baking powder, optional salt, and stir until just combined.",
    "Pour batter into prepared mug(s). Do not fill your mug over halfway full with batter because it will overflow in the microwave. Use two mugs rather than one if you're on the fence because mugcakes need ample room for expansion because they puff dramatically during cooking.",
    "For 1 large mug, cook on high power for about 2 1/2 to 3 minutes, or until firm yet springy to the touch. For 2 smaller mugs, cook separately for about 1 1/2 to 2 1/2 minutes, each. For my 1 large mugcake as shown, I cooked for 3 minutes. At the 1 1/2 minute mark, the cake puffed up over the top of the mug by about 1 inch, where it stayed and 'hoovered' above the mug for the duration of microwaving. Immediately upon powering off the microwave, the cake fell, by about 2 inches below the top edge of the mug. Your mugcake will deflate considerably while it cools. While it cools, make the glaze.",
    "For the Vanilla Glaze - In a small microwave-safe bowl, melt the butter, about 1 minute on high power.",
    "Slowly add the confectioners' sugar, vanilla, and stir with a fork or whisk until smooth and combined. If necessary to achieve desired glaze consistency, add a splash of cream or milk.",
    "Pour glaze over the cake(s). It's amazing how much glaze the cake will soak up so don't be alarmed if it looks like you have a lot. If you do have extra glaze, it will keep airtight for many weeks in the refrigerator. Mugcakes are best eaten fresh, but will keep airtight for up to 2 days at room temperature."
  ],
  "firstAdded": "2014-06-06T12:50:01.200000",
  "hash": "960f20514ed150fbdbafdd78f41645bf5d114458",
  "href": "http://www.averiecooks.com/2013/08/fudgy-chocolate-brownie-microwave-mugcake-with-vanilla-glaze.html",
  "image": "http://www.averiecooks.com/wp-content/uploads/2013/08/chocolatemugcake-26.jpg",
  "ingredients": [
    "0",
    "Mugcake2 tablespoons unsalted butter, melted 1/4 cup semi-sweet chocolate chips 1 large egg 3 tablespoons vanilla or plain Greek yogurt (1/4 cup buttermilk may be substituted and if using buttermilk, omit the 1 tablespoon of water) 1 tablespoon water 3 tablespoons granulated sugar 2 tablespoons unsweetened natural cocoa powder 1 tablespoon light brown sugar, packed 1/2 teaspoon vanilla extract 1/2 teaspoon instant espresso granules, optional (but recommended to boost chocolate intensity; make sure they're instant so they dissolve. Instant coffee granules may be substituted) 2 tablespoons all-purpose flour scant 1/4 teaspoon baking powder (a little less than 1/4 teaspoon) pinch salt, optional and to taste",
    "Vanilla Glaze 2 tablespoons unsalted butter, melted about 1/2 cup confectioners' sugar 1/2 teaspoon vanilla extract splash of cream or milk, only if necessary for consistency"
  ],
  "keywords": [
    "mugcake",
    "unsalted",
    "butter",
    "semisweet",
    "chips",
    "egg",
    "plain",
    "greek",
    "yogurt",
    "using",
    "buttermilk",
    "omit",
    "water",
    "granulated",
    "natural",
    "cocoa",
    "light",
    "brown",
    "sugar",
    "vanilla",
    "espresso",
    "recommended",
    "boost",
    "chocolate",
    "intensity",
    "make",
    "sure",
    "theyre",
    "dissolve",
    "instant",
    "coffee",
    "granules",
    "substituted",
    "allpurpose",
    "flour",
    "scant",
    "baking",
    "salt",
    "glaze",
    "confectioners",
    "splash",
    "cream",
    "milk",
    "necessary",
    "consistency"
  ],
  "title": "Fudgy Chocolate Brownie Microwave Mugcake with Vanilla Glaze",
  "users": [
    null
  ]
}