{
  "hash": "2947607c174702d2de6fe7076211b10e1c5efc93",
  "title": "Smoked aubergine & yogurt vol-au-vents",
  "image": "https://ottolenghi.co.uk/media/contentmanager/content/cache/646x458//Smoked-aubergine-&-yogurt-vol-au-vents.jpg",
  "href": "https://ottolenghi.co.uk/recipes/smoked-aubergine-yogurt-vol-au-vents",
  "extension": "Chrome",
  "firstAdded": "2019-11-02T13:29:15.765000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "These tangy treats are perfect when you need to hold out for the big meal. If you can, serve them as soon as you make them, to get the most out of the contrasting temperatures of the yogurt and the aubergine. If you want to avoid the effort involved in straining the yogurt overnight, skip this stage and just use the best thick yogurt with the highest fat content you can get (sheep or goat's for preference).",
    "Prepare the yogurt a day in advance. Line a large sieve with muslin and rest it over a bowl. Pour in the yogurt, sprinkle with half a teaspoon of salt, stir and tie into a parcel. Leave in the fridge overnight. The yogurt will lose lots of liquid and go thick and creamy.",
    "Next, make the pastry cases (this can also be done a day ahead). Roll out the pastry 5mm thick, then cut it into eight squares (8cm x 8cm), or use a 10cm round cutter to stamp out circles (this will give you only four to six pieces). Put the pastry shapes on a baking sheet lined with greaseproof paper. Score a shallow border all around about 1.5cm from the edge - take care not to cut all the way through (if making rounds, a smaller cutter will make life easier). Prick the inner part with a fork and brush the border with beaten egg. Chill for at least 20 minutes and up to 24 hours.",
    "You can prepare the smoked aubergine in one of two ways. Line the base of a gas ring with foil, turn the flame to high, then char the aubergines all over for 12-15 minutes, turning occasionally, until the flesh is soft and the skin burned and flaky. Or put them under a hot grill for 40-60 minutes, turning occasionally (they may burst slightly, but don't worry). Set aside the aubergines until just cool enough to handle.",
    "Preheat the oven to 200C/400F/gas mark 6. Bake the vol-au-vents for 10 minutes, until risen and golden brown (check underneath to make sure they are done). 'Peel' off a layer of pastry from the centre to create a cavity and set the cases aside somewhere warm.",
    "Make an incision along the centre of each still-hot aubergine and scoop out the flesh. Drain this in a colander, then chop and mix with garlic, parsley, lemon juice, salt and pepper to taste.",
    "To serve, spoon a generous amount of warm aubergine (reheated in a pan if necessary) into the vol-au-vents. Spoon yogurt on top and swirl the two together a little. Scatter with pomegranate and black sesame seeds, drizzle with olive oil and serve."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "500ml full-fat yogurt (not the set or Greek varieties)",
    "Salt and black pepper",
    "375g all-butter puff pastry",
    "1 egg, beaten",
    "6 small-medium aubergines",
    "1 clove garlic, crushed",
    "3 tbsp parsley leaves, roughly chopped",
    "3 tbsp lemon juice",
    "1 pomegranate",
    "1 tsp black sesame seeds",
    "1 tbsp olive oil"
  ],
  "__v": 1
}