{
  "hash": "50e83d252727a8ab136f7a2f54243237ce16b759",
  "title": "GRAIN FREE VANILLA COOKIES",
  "image": "http://1.bp.blogspot.com/-7CEibDxRBuo/UK9DfIPzBHI/AAAAAAAACbM/NBQ3gsjaQV0/s640/VanillaCookies5-s.jpg",
  "href": "http://www.anjasfood4thought.com/2012/11/grain-free-vanilla-cookies.html",
  "extension": "Chrome",
  "firstAdded": "2016-01-08T16:03:58.441000",
  "users": [
    null
  ],
  "keywords": [
    "almond",
    "meal",
    "coconut",
    "flour",
    "baking",
    "soda",
    "eggs",
    "sugar",
    "vanilla",
    "butter",
    "room"
  ],
  "directions": [
    "0",
    "In a bowl combine almond meal, coconut flour and baking soda. Mix well and set aside.",
    "With a handheld mixer, beat the eggs with the sugar and vanilla until light and fluffy. Add butter in small pieces and blend until fully incorporated.",
    "Add the flour mixture in small portions and blend until a dough forms. You may want to do this with your hands, once the mixture gets thick. If the dough doesn't stick together in a ball, add small amounts of coconut flour until you achieve the results.",
    "Dive the dough into two balls, flatten them to a disc and wrap in cling wrap. Keep in the refrigerator for about 1 hour.",
    "Preheat your oven to 160C/325F. Line baking sheet with parchment paper.",
    "Take one disc out of the refrigerator. Between two sheets of parchment paper, roll the dough to 1/8 to 1/4 inch thickness with a rolling pin. Remove the top parchment paper. Cut the dough into shapes with cookie cutters of your choice. Lift the cut-out dough with a spatula and place it onto the prepared baking sheet. Repeat with the other disc of dough.",
    "Bake for 9 minutes or until bottoms are golden brown. To get your cookies extra crispy, you may flip the cookies upside down and leave them in the switched-off oven for another few minutes."
  ],
  "ingredients": [
    "0",
    "1 cup almond meal",
    "1/2 cup coconut flour",
    "1 teaspoon baking soda",
    "2 eggs",
    "100g coconut sugar",
    "1 1/2 teaspoons vanilla extract",
    "3 tablespoons butter (room temperature)"
  ],
  "__v": 1
}