{
  "hash": "956aedbf0b6add01a860918e599f2e179ee27bea",
  "title": "Sweet Potato and Black Bean Tamales",
  "image": "https://patijinich.com/wp-content/uploads/2017/08/602-sweet-potato-black-bean-tamales-912x622.jpg",
  "href": "https://patijinich.com/recipe/sweet-potato-and-black-bean-tamales/",
  "extension": "Chrome",
  "firstAdded": "2018-01-14T06:40:09.558000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To Prepare",
    "Preheat oven to 450 degrees Fahrenheit.",
    "Wrap the sweet potatoes in aluminum foil. Bake for 45 to 50 minutes or until completely cooked and soft. Remove from the oven. When cool enough to handle, cut open and scoop out the cooked pulp into a bowl. Set aside to cool.",
    "To make the tamal masa: Place the lard or vegetable shortening and 1/2 teaspoon of salt into a mixer, and beat over medium speed until very light, about 1 minute. Reduce speed to low, add baking powder and sugar, and take turns adding the corn masa flour and the broth. Raise speed back to medium and continue beating another 6 to 7 minutes, until the dough is homogeneous. In batches, add the cooled sweet potato pulp and continue beating for another 5 to 6 minutes, until the masa looks fluffed up.",
    "To assemble the tamales: Soak the dried corn husks in hot water for a couple minutes, or until they are pliable, and drain. Lay out a corn husk with the tapering end towards you. Spread about 1/3 cup masa into about a 2” to 3” square, the layer should be about 1/4” thick, leaving a border of at least 1/2” on the sides. Place about 2 teaspoons of refried beans in the middle of the masa square.",
    "Pick up the two long sides of the corn husk and bring them together (you will see how the masa starts to swaddle the filling) and fold them to one side, rolling them in same direction around tamal. Fold up the empty section of the husk with the tapering end, from the bottom up. This will form a closed bottom and the top will be left open. Gently squeeze from the bottom to the top to even the filling out without pressing to hard. As you assemble all the tamales, place them as upright as you can in a container.",
    "To prepare the tamalera or steamer: Place water in the bottom pan of a steamer, so that water is under the steamer basket or rack, and bring it to a simmer. Line the steamer with one or two layers of soaked corn husks.",
    "To cook the tamales: When you have all tamales ready, place them as vertically as you can, into the prepared steamer with the open end on top. If there is space left in the steamer, tuck in some corn husks, so the tamales won’t dance around. Cover with more corn husks, and steam covered with a lid for 55 minutes to an hour. You know the tamales are ready when they come easily free from the husks. They will still be moist, and as they are released from the husks – you will see the moisture, like when you remove good moist muffins from their paper baking cups.",
    "Finished tamales will stay warm for about 2 hours in the steamer. They can be made ahead several days before and stored in refrigerator, well wrapped. They can also be frozen for months. In either case, reheat in a steamer. For refrigerated tamales, it will take about 20 minutes and about 45 minutes for frozen tamales.",
    "You can serve with a spoonful of Mexican crema and crumbled queso fresco on top."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 pounds sweet potatoes",
    "1 cup lard or vegetable shortening",
    "1/2 teaspoon kosher or coarse sea salt",
    "1 teaspoon baking powder",
    "1 tablespoon brown sugar",
    "1 2/3 cups corn masa flour or masa harina (such as Maseca)",
    "1/2 cup chicken or vegetable broth",
    "24 dried corn husks",
    "2 cups refried beans",
    "1 cup Mexican crema",
    "1 cup queso fresco crumbled"
  ],
  "__v": 1
}