{
  "hash": "0b7adb5a75eef5fb5a1d5990992fcb79ee666656",
  "title": "Курица с баклажанами и кабачками",
  "image": "http://cook-s.ru/images/stories/vtorie_bluda/bluda_iz_kuricy/kurica_s_baklazhanami_i_kabachkami/kurica_s_baklazhanami_i_kabachkami_14.jpg",
  "href": "http://cook-s.ru/kurica-s-baklazhanami-i-kabachkami.html",
  "extension": "Chrome",
  "firstAdded": "2015-04-27T16:46:08.332000",
  "users": [
    null
  ],
  "keywords": [],
  "directions": [
    "0",
    "Заранее приготовить томатный соус для заливки курицы. Для этого нарезать репчатый лук средними кусочками, обжарить на растительном масле до прозрачности.",
    "Перед тем как выключить огонь – добавить измельченные дольки чеснока и дать пропитаться их ароматом обжаренному луку и растительному маслу.",
    "Влить в сковороду измельченные до состояния сока помидоры, снова включить огонь, добавить немного сахара по вкусу и соли.",
    "Приправить томатный соус любимыми пряностями и зеленью, например, свежим базиликом. Тушить соус 15 минут на медленном огне до испарения большей половины жидкости.",
    "Пока выпаривается соус, обжарить куриное филе или куриные бедра на раскаленной сковороде с добавлением растительного масла, соли и черного молотого перца в течение 7-10 минут. Обжаренную курицу переложить в глубокую огнеупорную форму.",
    "На том же растительном масле обжарить кабачки, посолить.",
    "Переложить их к курице, распределяя равномерно по поверхности.",
    "Сладкий перец жарить не нужно, нарезать его крупными кусочками и разложить сверху на овощи.",
    "Курицу и овощи залить томатным соусом, форму прикрыть фольгой, отправить в духовку на 45 минут при 200 градусах.",
    "Твердый сыр натереть на терке, присыпать блюдо и снова отправить в духовку (уже без фольги) на 10-15 минут.",
    "Курица с баклажанами и кабачками готова!",
    "Останется только дождаться, пока она остынет, а сделать это при исходящих ароматах будет очень сложно… Запаситесь настоящим кардинальским хладнокровием!"
  ],
  "ingredients": [
    "0",
    "куриное филе или бедра куриные – 0,7-0,8 кг",
    "помидоры – 0,5 кг",
    "кабачки молодые – 2-3 шт.",
    "баклажаны – 2-3 шт.",
    "перец сладкий (болгарский) – 2 шт.",
    "лук репчатый или красный – 1 шт.",
    "чеснок – 3 дольки",
    "сыр твердый – 150 г",
    "соль, сахар, черный перец и свежая зелень (базилик, укроп или петрушка) – по вкусу"
  ],
  "__v": 1
}