{
  "hash": "6540a73624053a72ed37349d2509d8a7c5917bc9",
  "title": "Kung Pao chicken",
  "image": "https://jamieoliverprod.s3.amazonaws.com/recipe-database/oldImages/recipe_single/1429_1_1436804875.jpg",
  "href": "http://www.jamieoliver.com/recipes/chicken-recipes/kung-pao-chicken/",
  "extension": "Chrome",
  "firstAdded": "2015-12-09T16:19:45.647000",
  "users": [
    null
  ],
  "keywords": [
    "szechuan",
    "peppercorns",
    "cornflour",
    "skinless",
    "boneless",
    "higherwelfare",
    "chicken",
    "thighs",
    "groundnut",
    "oil",
    "garlic",
    "thumbsized",
    "ginger",
    "spring",
    "onions",
    "red",
    "chillies",
    "lowsalt",
    "soy",
    "rice",
    "wine",
    "vinegar",
    "heaped",
    "runny",
    "honey",
    "unsalted",
    "peanuts",
    "punnet",
    "salad",
    "cress",
    "ribbon",
    "cucumber",
    "carrot",
    "bunch",
    "coriander",
    "tabelspoon"
  ],
  "directions": [
    "0",
    "Method",
    "Using a speed peeler, peel the cucumber and carrot (including the skin), until you have a pile of long, thin ribbons. Pick and roughly chop most of the coriander leaves, discarding the stalks. Place it all into a bowl with the soy and rice wine vinegar. Toss well and set aside.",
    "Toast the Szechuan peppercorns in a dry frying pan until lightly golden. Transfer to a pestle and mortar, grind to a fine powder, then sieve into a large bowl, discarding any large, tough bits. Add 2 tablespoons of cornflour and stir to combine. Chop the chicken into bite-sized chunks, then toss in the cornflour mixture to coat.",
    "Pour 2cm of oil into a large non-stick frying pan over a medium heat. Add the chicken and fry for 7 to 8 minutes, or until golden and cooked through. Meanwhile, peel and finely slice the garlic and ginger, then trim and finely slice the spring onions.",
    "Using a slotted spoon, remove the chicken to a double layer of kitchen paper to drain. Carefully remove and discard most of the oil, leaving about 2 tablespoons in the pan, then return to a medium heat. Add the garlic and ginger and fry for 2 minutes, or until lightly golden, then stir in the spring onions and whole chillies and fry for a further minute.",
    "Meanwhile, combine ½ tablespoon of cornflour and 2 tablespoons of water. Mix in the soy, vinegar and honey, then pour the mixture into the pan. Bring to the boil and simmer for a few minutes, or until slightly thickened. Lightly bash and add the peanuts, stir in the chicken, then toss well until warmed through. Snip the cress over the ribbon salad, scatter the reserved coriander leaves over the chicken, then serve."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1\ttablespoon\tSzechuan peppercorns",
    "2½\ttablespoons\tcornflour",
    "4\tskinless, boneless higher-welfare chicken thighs\t, (350g)",
    "groundnut oil\t, or vegetable oil",
    "4\tcloves of\tgarlic",
    "1\tthumb-sized piece of\tginger",
    "2\tspring onions",
    "6\tdried red chillies",
    "2\ttablespoons\tlow-salt soy sauce",
    "½\ttablespoon\trice wine vinegar",
    "1\theaped tablespoon\trunny honey",
    "50\tg\tunsalted peanuts",
    "1\tpunnet\tsalad cress",
    "FOR THE RIBBON SALAD:",
    "½\tcucumber",
    "1\tlarge\tcarrot",
    "½\tbunch of\tfresh coriander",
    "1\ttablespoon\tlow-salt soy sauce",
    "1\ttabelspoon\trice wine vinegar"
  ],
  "__v": 1
}