{
  "hash": "e494e45fc4949c0466e35e029d4210909ad39d12",
  "title": "The Chewy",
  "image": "http://altonbrown.com/wp-content/uploads/2015/04/alton-brown-the-chewy-200.jpg",
  "href": "http://altonbrown.com/the-chewy-chocolate-chip-cookie-recipe/",
  "extension": "Chrome",
  "firstAdded": "2016-01-13T04:54:27.743000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "butter",
    "bread",
    "flour",
    "kosher",
    "salt",
    "baking",
    "soda",
    "granulated",
    "sugar",
    "light",
    "brown",
    "egg",
    "yolk",
    "milk",
    "vanilla",
    "semisweet",
    "chocolate",
    "chips"
  ],
  "directions": [
    "0",
    "Melt the butter in a 2-quart saucepan over low heat, then set aside to cool slightly.",
    "Sift together the flour, salt and baking soda onto a paper plate.",
    "Pour the butter into your stand mixer's work bowl. Add the sugars and beat with the paddle attachment on medium speed for 2 minutes.",
    "Meanwhile in a separate bowl, whisk together the whole egg, egg yolk, milk and vanilla extract.",
    "Slow the mixer to \"stir\" and slowly work the egg mixture into the butter and sugar. Mix until thoroughly combined, about 30 seconds",
    "Using the paper plate as a slide, gradually integrate the dry ingredients, stopping a couple of times to scrape down the side of the bowl with a rubber spatula",
    "Once the flour is worked in, drop the speed to \"stir\" and add the chocolate chips.",
    "Chill the dough for 1 hour.",
    "Heat the oven to 375 degrees F and place the racks in the top third and bottom third of the oven.",
    "Scoop the dough into 1 1/2-ounce portions onto parchment paper-line half sheet pans, 6 cookies per sheet.",
    "Bake two sheets at a time for 15 minutes, rotating the pans halfway through.",
    "Remove from the oven, slide the parchment with the cookies onto a cooling rack, and wait at least 5 minutes before devouring."
  ],
  "ingredients": [
    "0",
    "8 ounces unsalted butter",
    "12 ounces bread flour",
    "1 teaspoon kosher salt",
    "1 teaspoon baking soda",
    "2 ounces granulated sugar",
    "8 ounces light brown sugar",
    "1 large egg",
    "1 large egg yolk",
    "2 tablespoons whole milk",
    "1 1/2 teaspoons vanilla extract",
    "12 ounces semisweet chocolate chips"
  ],
  "__v": 1
}