{
  "hash": "e81d35cff6381fa2da03321e461d8c3e356b87a6",
  "title": "Thai Red Curry Chicken",
  "image": "https://www.onceuponachef.com/images/2018/08/Thai-Red-Curry-Chicken-2-760x664.jpg",
  "href": "https://www.onceuponachef.com/recipes/thai-red-curry-chicken.html?recipe_print=yes",
  "extension": "Chrome",
  "firstAdded": "2019-12-17T05:06:40.416000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the oil over medium-low heat in a large nonstick pan. Add the light scallions, garlic, and jalapeño and cook, stirring frequently, until softened, 3 to 4 minutes. Do not brown.",
    "Add the coconut milk, red curry paste, fish sauce, and brown sugar and whisk together. Bring to a gentle boil, then reduce heat and simmer until thickened, a few minutes. Add the chicken and simmer, uncovered, stirring occasionally to promote even cooking, until the chicken is cooked through, 5 to 6 minutes. (Do not let the sauce boil; the idea is to cook the chicken gently so that it's tender.) Stir in the lime juice, dark scallion greens, and cilantro. Taste and adjust seasoning with more lime, if necessary. Serve with jasmine rice.",
    "Note: As always, take care when working with jalapeño peppers. If you touch the seeds or ribs, be sure to wash your hands well and avoid touching your eyes.",
    "Note: It's important to wait until you're ready to eat to cook the chicken. If you want to get a head start, prepare the sauce up until the point when the chicken is added. Take it off the heat and then poach the chicken right before serving. If the chicken sits in the hot curry sauce for too long before serving, it will overcook."
  ],
  "ingredients": [
    "0",
    "1 tablespoon vegetable oil",
    "1 small bunch scallions, thinly sliced, light and dark green parts divided",
    "3 cloves garlic, chopped",
    "1 jalapeño pepper, seeded and diced (see note)",
    "1 (14-oz) can coconut milk (unsweetened)",
    "2 tablespoons Thai red curry paste",
    "2 tablespoons fish sauce",
    "2-1/2 tablespoons packed dark brown sugar",
    "1-1/2 pounds chicken tenderloins, cut into 1-inch cubes",
    "1 tablespoon lime juice, from 1 lime",
    "1/4 cup chopped fresh cilantro"
  ],
  "__v": 1
}