{
  "hash": "3e9c7b0736030bc40484d81ec09b27b39deb864c",
  "title": "Picadillo Empanadas of the Immaculate Conception",
  "image": "https://patijinich.com/wp-content/uploads/2016/03/41-PicadilloEmpanadas-0030web-912x622.jpg",
  "href": "https://patijinich.com/recipe/picadillo-empanadas-of-the-immaculate-conception/",
  "extension": "Chrome",
  "firstAdded": "2017-10-29T11:16:27.125000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To make the dough, beat the cream cheese with the butter in a mixer at medium speed, until it is creamy. Gently add the flour and salt and continue mixing for a minute more. Turn dough onto a lightly floured surface and knead for a minute. Form the dough into a ball, wrap in plastic wrap and refrigerate from 15 minutes up to 24 hours.",
    "After refrigerating, sprinkle flour over the countertop and roll out half the dough until its about 1/4 inch thick. For medium sized empanadas, cut out rounds of 4 to 5 inches in diameter. Continue until all of the dough is used.",
    "Grease a baking sheet with butter. Preheat the oven to 375 degrees.",
    "Spoon about 1 1/2 tablespoons of the picadillo filling into the center of each round. Brush the edges of the round with the beaten egg. Fold a side of the circle over the filling across the other side. Press with your fingers as you close. Without breaking the dough, press with a fork over the edges to seal and make a design.",
    "Place the empanadas on the baking sheet. When you fill the baking sheet, lightly brush their tops with the lightly beaten egg and sprinkle with sesame seeds.",
    "Bake the empanadas anywhere from 20 to 25 minutes, until the tops have a golden tan and dough is cooked through. Serve hot.",
    "For the picadillo: Heat olive oil in a large saute pan set over medium-high heat. Add onion and saute for a couple of minutes, until it becomes translucent and soft. Incorporate chopped garlic and saute for about a minute until it becomes fragrant. Incorporate the meat and the salt and let it cook for about 8 minutes, until cooked and lightly browned.",
    "Pour in tomato puree and let it season, stirring often, for 5 to 6 minutes, until it has deepened its color, thickened in consistency and lost the raw flavor. Pour in the chicken broth or water, cumin, cloves and cinnamon. Stir well and let it cook 15 minutes more.",
    "Add the raisins, almond and olives, mix well and taste for seasoning. Cook for 5 more minutes. If needed, add more salt. The filling should be nice and moist.",
    "Just remember, once it cools, it will dry a little more as it will absorb the juices. Turn off the heat. You can make the filling up to two days ahead of time, let it cool, cover and refrigerate."
  ],
  "ingredients": [
    "0",
    "1cupunsalted butterat room temperature",
    "8oz, about 185 g, cream cheese or fresh nataat room temperature",
    "2 1/3cupsall-purpose flour",
    "1/2tspsalt",
    "1egglightly beaten",
    "1/2cupsesame seeds",
    "Picadillo (makes about 4 cups):",
    "3tbspolive oil",
    "1/4cupwhite onionchopped",
    "1garlic clovefinely chopped",
    "1lbpork shoulder or butt,or combination of pork, beef and veal, ground",
    "3/4tspkosher or sea salt",
    "1lbripe tomatoespureed, or about 2 cups tomato puree",
    "2cupschicken broth or water,",
    "Pinch of cumin",
    "Pinch of ground cloves",
    "1/2tspcinnamonground",
    "1/4cupslivered almondslightly toasted",
    "1/4cupraisins",
    "1/4cupManzilla olives,chopped"
  ],
  "__v": 1
}