{
  "hash": "218038c58d8ca7295383d51d91b261f7908653b8",
  "title": "Chicken and Chorizo Paella",
  "image": "http://www.bascofinefoods.com/spanish-recipes/wp-content/uploads/2016/07/chicken_and_chorizo_paella_3-1024x734.jpg",
  "href": "https://www.bascofinefoods.com/spanish-recipes/chicken-and-chorizo-paella/",
  "extension": "Chrome",
  "firstAdded": "2017-07-20T23:45:35.246000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium size paella pan (34cm diameter) or a large shallow casserole dish, heat one tablespoon of the oil. Once hot, add the chicken pieces and fry for about 3 minutes until golden brown, remove from the pan and set aside. In the same pan, heat another tablespoon of the oil and fry the spicy chorizo pieces until brown and crispy, remove from the pan and set aside. Allow the paella pan to cool down for a couple minutes.",
    "While the pan is cooling down, in a small frying pan, gently toast for 30 seconds the saffron threads, be careful not to burn them. This will release the essential oils within the saffron threads. Pour the threads into a pestle and mortar and pound them until you obtain a fine powder. Pour 2 tablespoons of the hot chicken stock and mix well. The saffron powder will blend better into the hot liquid so when you pour it into the paella rice, the saffron liquid will spread evenly.",
    "Add the remaining olive oil to the paella pan and gently fry the chopped garlic until it starts to jump, add the paella rice and stir for a few minutes on a gentle heat until the rice is slightly translucent. Add the smoked paprika and stir the rice for 30 seconds, followed by the grated tomato. Once the tomato has cooked into the rice, pour in the hot chicken stock, followed by the saffron infused stock and the fried chicken and chorizo pieces. Season with salt and spread the rice out evenly to cover the bottom of the paella pan.",
    "Bring to the boil. If you have a timer, set it for 20 minutes. The first 5 minutes, cook the paella on a moderate heat until the rice grains begin to rise to the surface of the liquid. Check the stock for seasoning and add some more salt if necessary. Stir the rice again, lower the heat and cook on a simmer for 15 minutes. You can add the frozen peas on the last 5 minutes of cooking.",
    "Turn the heat off, cover the paella pan with a kitchen towel and allow it rest for 5 minutes before serving."
  ],
  "ingredients": [
    "0",
    "4 tbsp of extra virgin olive oil",
    "2 garlic cloves, finely chopped",
    "3 plums tomatoes, grated",
    "1 tsp of sweet smoked paprika",
    "A good pinch of saffron threads",
    "2 free-range chicken breasts, chopped into small pieces",
    "150g spicy cooking chorizo, chopped into small pieces",
    "200g frozen peas",
    "300g paella or bomba rice",
    "800ml of hot chicken stock, fresh or made from a stock cube",
    "Salt"
  ],
  "__v": 1
}