{
  "hash": "52c2d64b0bd01d8e5e9eb0fe6bbd1acf8c79ad55",
  "title": "ERK SEASONING FROM WELL FED 2",
  "image": "http://meljoulwan.com/wp-content/uploads/2014/10/jerkseasoning.png",
  "href": "http://meljoulwan.com/2014/11/01/jerk-seasoning/",
  "extension": "Chrome",
  "firstAdded": "2016-10-19T21:14:29.234000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS:",
    "1",
    "Measure all of the spices into a medium bowl and mix with a fork until combined.",
    "2",
    "Transfer the spice blend to an airtight container and sprinkle it on meat and veggies when (1) someone has been a jerk to you and you’d like to put a voodoo curse on them; or (2) you want to add a spicy-sweet-hot kick to whatever’s on your plate.",
    "TASTY IDEAS",
    "A",
    "Jerky Chicken Thighs: Place a wire rack on top of a foil-covered baking sheet, generously sprinkle Jerk Seasoning on chicken thighs, place them on the wire rack with a little breathing room around them, and roast in a 425F oven for 20-30 minutes until they’re crispy and brown. They are so so so good fresh out of the oven, and then leftovers…",
    "B",
    "Jerky Chicken Salad: Make a delicious chicken salad with leftover chicken tossed with homemade mayo and your favorite mix-ins: diced apple, celery, scallions, chopped nuts, even cubes of cooked winter squash are tasty in there!",
    "C",
    "Jerky Rice and/or Plantains: Leftover jerk chicken is great diced and stir-fried with veggies and cauliflower rice—or sautéed with slices of ripe plantain and ghee. Add a little extra Jerk Seasoning for additional zing.",
    "D",
    "Jerky Eggs: Jerk Seasoning is delicious sprinkled on fried or hard-boiled eggs.",
    "E",
    "Jerky Balls: Mix 1 tablespoon into a pound of ground beef or pork for jerky meatballs. Bake at 425F for 20 minutes or pan-fry until brown all over.",
    "F",
    "Jerky Potatoes: Follow the recipes for Crispy, Oven-Baked Sweet Potato Fries or Classic Home Fries and add 1-2 teaspoons Jerky Seasoning."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS:",
    "1 tablespoon salt",
    "1 tablespoon allspice",
    "1/2 tablespoon dried thyme leaves",
    "2 teaspoons ground black pepper",
    "1 teaspoon cayenne pepper",
    "1/2 teaspoon ground cinnamon",
    "1/2 teaspoon ground nutmeg"
  ],
  "__v": 1
}