{
  "hash": "c1c2f8db9f3703c599cecc559f7da8992427b5c9",
  "title": "Cauliflower 'Couscous'",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2013/10/cauliflower-couscous-horiz-a-1200.jpg",
  "href": "https://www.simplyrecipes.com/recipes/cauliflower_couscous/",
  "extension": "",
  "firstAdded": "2018-01-28T02:14:14.477000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Place cauliflower florets into a food processor. Pulse several times until the cauliflower looks like a coarse meal, resembling traditional couscous.",
    "2 Cover the bottom of a large sauté pan with a thin layer of water. Add salt, zest, and an aromatic herb such as rosemary, if using. Bring to a simmer, stir. Add the ground cauliflower to the pot, spreading it out in an even layer. Bring to a simmer, then reduce heat to the lowest possible simmer setting. Cover the pan and cook/steam for 5 minutes. Remove from heat. Remove cauliflower to a sheet pat to cool.",
    "3 Heat olive oil in a medium sized non-stick sauté pan on medium heat. Add the chopped nuts and cook until the nuts begin to brown slightly. If using celery, add the celery and continue to cook until the celery is lightly softened, about 2 to 3 minutes. Then Add the green onions, raisins or dried cranberries, and diced apple to the pan, and stir to warm through.",
    "4 Place cauliflower and nut apple mixture into a serving bowl and gently stir to combine. Serve warm or at room temperature."
  ],
  "ingredients": [
    "0",
    "1 head cauliflower, cored, broken into florets (see How to Cut and Core Cauliflower)",
    "1/2 cup water (more or less depending on the size of your pan)",
    "1 teaspoon Kosher salt",
    "1 sprig rosemary",
    "1 teaspoon lemon zest",
    "2 Tbsp olive oil",
    "1/4 cup whole almonds, coarsely chopped",
    "2 ribs celery",
    "2/3 cup of sliced green onion (green part only)",
    "1 large red apple, cored and diced (peel can stay on)",
    "1/2 cup golden raisins",
    "1 teaspoon orange zest",
    "1 Tbsp olive oil",
    "1/4 cup chopped walnuts",
    "1/2 cup chopped dried, sweetened cranberries (could also use fresh pomegranate arils)",
    "1/2 cup sliced green onions",
    "1 large apple, cored and diced (peel can stay on)"
  ],
  "__v": 1
}