{
  "hash": "5ccf7ab2106ab7c6987bdd2700956f24362f10a5",
  "title": "Roasted Brussels Sprouts and Crispy Baked Tofu with Honey-Sesame Glaze",
  "image": "https://cookieandkate.com/images/2014/04/crispy-baked-tofu-and-brussels-sprouts-with-honey-sesame-glaze-1.jpg",
  "href": "https://cookieandkate.com/2014/roasted-brussels-sprouts-and-crispy-baked-tofu-with-honey-sesame-glaze/",
  "extension": "Firefox",
  "firstAdded": "2018-10-02T05:19:21.071000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prep work: Position your oven racks in the lower third and upper third of the oven. Preheat oven to 400 degrees Fahrenheit. Bring a large pot of water to boil for the rice. Rinse the rice in a fine mesh colander under running water and set aside.",
    "Drain the tofu and use your palms to gently squeeze out some of the water. Slice the tofu in half lengthwise so you have two one-inch thick slabs. Transfer the tofu to a plate lined with a lint-free tea towel or paper towels. Fold the towel over one tofu slab, then place the other slab on top (see photo). Top with more towel and place something heavy on top to help the tofu drain.",
    "Trim the nubby ends and any discolored leaves off the Brussels sprouts, then cut the sprouts in halves lengthwise. Toss the sprouts with a light, even layer of olive oil. On a large baking sheet, arrange the sprouts in an even layer, flat sides down, and sprinkle with sea salt.",
    "Transfer the drained tofu to a cutting board. Slice three long columns and five rows on each slab. Whisk together 1 tablespoon olive oil and tamari, then drizzle it over the tofu and toss to coat. Sprinkle 1 tablespoon arrowroot starch over the tofu, and toss the tofu until the starch is evenly incorporated (no powdery spots remaining). Arrange the tofu in an even layer on a baking sheet (I lined mine with parchment paper for easier cleanup).",
    "To cook the rice: Once the water is boiling, add the rice. Let the rice boil for 30 minutes, then remove from heat and drain the rice. Transfer the drained rice back to the cooking pot and cover for 5 minutes. Remove lid, add a dash of sea salt and use a fork to fluff the rice. Set aside until you’re ready to serve.",
    "To bake the sprouts and tofu: Transfer the pan of Brussels sprouts to the lower oven rack, and the pan of tofu to the top rack. Bake for 25 to 30 minutes, tossing the contents of each pan halfway through cooking, until the sprouts and tofu are deeply golden on the edges.",
    "To make the glaze: In a small saucepan, whisk together the glaze ingredients (start with 1 teaspoon chili garlic sauce or sriracha and add more to taste). Bring the glaze to a gentle boil over medium heat, stirring often and reducing heat as necessary, until the glaze is reduced by about half (about 10 minutes). Remove from heat.",
    "To toast the sesame seeds: Pour the sesame seeds into a small pan. Toast for about 4 to 5 minutes over medium-low heat, shaking the pan frequently to prevent burning, until the seeds are turning golden and starting to make popping noises.",
    "To assemble: Divide rice onto four plates. Top each plate with sprouts and tofu and drizzle with glaze. Finish each plate with a very generous sprinkling of sesame seeds and a small handful of chopped cilantro."
  ],
  "ingredients": [
    "0",
    "Brown rice",
    "1 ¼ cup brown rice, preferably short grain",
    "Roasted brussels sprouts",
    "1 ½ pound Brussels sprouts",
    "1 ½ tablespoons olive oil",
    "Fine grain sea salt",
    "Extra crispy baked tofu",
    "1 (15 ounce) block of organic extra-firm tofu",
    "1 tablespoon olive oil",
    "1 tablespoon reduced-sodium tamari* or soy sauce",
    "1 tablespoon arrowroot starch or cornstarch",
    "Spicy honey-sesame glaze",
    "¼ cup reduced-sodium tamari or soy sauce",
    "3 tablespoons honey (maple syrup also works)",
    "2 tablespoons rice vinegar",
    "2 teaspoons toasted sesame oil",
    "1 to 3 teaspoons chili garlic sauce or sriracha (depending on how spicy you like it)",
    "Garnish",
    "2 tablespoons sesame seeds",
    "Big handful fresh cilantro leaves, chopped"
  ],
  "__v": 1
}