{
  "hash": "a814575c18a7f23cc8d6c3fc411ea59c51c31128",
  "title": "Chicken Fried Steak",
  "image": "",
  "href": "http://recipe-folder.com/recipe/5dc93a5d8af0070830188dc7",
  "extension": "User Added",
  "firstAdded": "2019-11-11T10:39:25.985000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "The wet mixture is 4 eggs, 1 tsp. of paprika, and 3/4 cup",
    "1",
    "of buttermilk, whisk well and pour in a shallow dish."
  ],
  "ingredients": [
    "0",
    "Chicken Fried Steak! (With Chuck Wagon Gravy!)",
    "1",
    "Start with 4 Cubed Steaks or Top Sirloin tenderized.",
    "2",
    "Make a wet and dry mix to dip and dredge your steaks in.",
    "3",
    "The wet mixture is 4 eggs, 1 tsp. of paprika, and 3/4 cup",
    "4",
    "of buttermilk, whisk well and pour in a shallow dish.",
    "5",
    "The dry mixture is 2 and 1/2 cups of all purpose flour",
    "6",
    "3 tbsp. of lemon pepper, 1 heaping tbsp. cornstarch.",
    "7",
    "1/8 cup of seasoning salt, mix everything together well.",
    "8",
    "Important!....",
    "9",
    "Sheila said it is OK with the salt I used in the video",
    "10",
    "recipe ... but I think it is a bit salty so to be safe...",
    "11",
    "(Only 1/8 cup of seasoning salt in the flour mixture)",
    "12",
    "You can always add salt to it later!",
    "13",
    "Dip the cubed steak in the egg mixture then in the flour,",
    "14",
    "then back in the egg mixture then back in the flour.",
    "15",
    "Then lay them on a rack for 15 minutes to soak up both!",
    "16",
    "Pour 1/2 inch deep lard, canola oil, or peanut oil, in a cast iron pan and bring to 350 degrees. Cook steaks golden brown",
    "17",
    "on both sides and place them on a rack or paper towels.",
    "18",
    "(They both work just fine)",
    "19",
    "To make the gravy... drain the pan but keep the drippings.",
    "20",
    "Pour in 1/4 of a cup of bacon grease or you can use the oil",
    "21",
    "left from frying the steaks. Add an equal amount of the flour",
    "22",
    "you used earlier.",
    "23",
    "Cook the flour and grease on medium heat whisking constantly, after 2 minutes add 2 cups of warm whole milk a little at a time.",
    "24",
    "Simmer for 2 to 3 more minutes.",
    "25",
    "Once it thickens add 1/4 tsp salt and 1/2 tsp. black pepper.",
    "26",
    "Put your steaks in a baking dish and put them in the oven at",
    "27",
    "400 degrees for 5 minutes... plate it up and cover with gravy!",
    "28",
    "Sprinkle just a bit of black pepper on top!",
    "29",
    "Enjoy!"
  ],
  "__v": 1,
  "hidden": true
}