{
  "hash": "cd55d9fc5d94049d41de5c2f8baf19df49867591",
  "title": "Spaghetti and Garlic Toast Grilled Cheese",
  "image": "http://www.thereciperebel.com/wp-content/uploads/2014/06/spaggrcheese1-610x915.jpg",
  "href": "http://www.thereciperebel.com/spaghetti-and-garlic-toast-grilled-cheese/",
  "extension": "Chrome",
  "firstAdded": "2015-07-28T17:54:09.957000",
  "users": [
    null
  ],
  "keywords": [
    "beef",
    "onion",
    "salt",
    "red",
    "pepper",
    "basil",
    "jar",
    "prepared",
    "pasta",
    "tomato",
    "tomatoes",
    "squeezed",
    "dry",
    "box",
    "spaghetti",
    "broken",
    "roughly",
    "meat",
    "butter",
    "garlic",
    "slices",
    "italian",
    "bread",
    "used",
    "wheat",
    "extra",
    "plain",
    "cheese",
    "cover",
    "sandwich",
    "square"
  ],
  "directions": [
    "0",
    "In a large pan, cook beef, onion, salt, pepper flakes, and basil until meat is browned. Add in pasta sauce and tomatoes.",
    "Simmer over medium heat for 20-30 minutes until some of the liquid has evaporated and sauce is slightly thicker, stirring occasionally.",
    "Cook spaghetti according to package directions. Stir and serve together. *Reserve about 1 cup spaghetti and meat sauce mixture for each grilled cheese you wish to make later in the week. Don't worry -- there's lots!",
    "1",
    "Combine butter and garlic powder. Butter both sides of all 6 slices of bread (I did the second side while they were on the griddle, but it's up to you what you think is easiest). Place bread on a large flat griddle preheated to about 300 degrees F (A large frying pan works, too, it's just not as easy to maneuver your sandwiches and won't hold as much).",
    "Cook the first side of the bread until golden brown. Flip.",
    "Divide half of the cheese between 3 slices of bread. Top each with 2-3 tbsp additional meat or pasta sauce. Top with about ½-1 cup spaghetti and meat sauce mixture and remaining cheese. Top with second piece of bread, making sure to put the already toasted side down.",
    "Flip sandwiches so that both sides get toasted. Cook 4-5 minutes until bread is toasted and cheese is melted, covering sandwiches with tin foil or griddle cover if necessary to melt the cheese.",
    "Devour!"
  ],
  "ingredients": [
    "0",
    "1 lb ground beef",
    "1 onion, chopped",
    "1 tsp salt",
    "¼ tsp red pepper flakes",
    "1 tsp dried basil",
    "1 jar prepared pasta sauce or tomato sauce",
    "1 28oz can diced tomatoes, drained but not squeezed dry",
    "1 454g box spaghetti, broken in half",
    "1",
    "Roughly 2-3 cups prepared spaghetti and meat sauce",
    "4 tbsp butter",
    "¾ tsp garlic powder",
    "6 slices thick Italian bread (I used whole wheat)",
    "about 6 tbsp extra meat sauce or plain tomato sauce",
    "cheese, sliced or shredded, to cover top and bottom of sandwich (I used about 10-12 2\" square slices)",
    "about 1½ cups prepared spaghetti and meat sauce"
  ],
  "__v": 1
}