{
  "hash": "91dd60f6e2a438dbde44927807352bd81adfc70c",
  "title": "High Protein Freezer Breakfast Burritos",
  "image": "https://i2.wp.com/thetoastykitchen.com/wp-content/uploads/2019/08/freezer-breakfast-burritos-toasty-kitchen-11.jpg?fit=200%2C300&ssl=1",
  "href": "https://thetoastykitchen.com/high-protein-freezer-breakfast-burritos/",
  "extension": "",
  "firstAdded": "2020-02-23T14:29:50.403000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a sauté pan over medium heat, add 1 tablespoon olive oil. Once hot, add sliced onion and bell pepper. Cook, stirring occasionally, until veggies are lightly browned and onions turn translucent - about 3 to 4 minutes. Remove from pan and set aside.",
    "Add ground chicken and sausage to skillet. Season with salt, pepper, paprika, and garlic powder. Cook for 3-4 minutes before stirring, to get a nice brown crust on the bottom side. Stir and continue cooking for 3-4 minutes, or until meat is cooked through.",
    "In a bowl, whisk eggs together until combined. In a fresh nonstick pan over medium heat, add 1 tablespoon of olive oil. Pour in eggs. As eggs begin to set on the bottom, pull the eggs across the pan with a spatula. This will form egg curds in the pan. Continue pulling and folding the eggs until no liquid remains. Remove from heat and set aside to cool.",
    "Lay out 12 tortillas on top of 12 squares of foil. Lay one slice of cheese in the middle of each tortilla. Then, evenly distribute vegetables, meat, and eggs between the tortillas. Tightly wrap each burrito, and wrap in foil.",
    "Store burritos in a gallon size freezer bag until ready to thaw and reheat."
  ],
  "ingredients": [
    "0",
    "2 tablespoons olive oil divided",
    "1 medium onion sliced",
    "1 bell pepper sliced",
    "16 ounces ground chicken",
    "16 ounces ground hot breakfast sausage",
    "1/2 teaspoon salt",
    "1/2 teaspoon pepper",
    "1/2 teaspoon paprika",
    "1/2 teaspoon garlic powder",
    "6 large eggs",
    "12 slices of cheddar cheese",
    "12 8\" tortillas"
  ],
  "__v": 1
}