{
  "hash": "86adbe9d9af6ff3c16ac86a376f49296cf94adea",
  "title": "Mini Chipotle Beef Burgers with Warm Fire Roasted Garlic Ketchup",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/rachael-ray/texas-hold-ums-mini-chipotle-beef-burgers-with-warm-fire-roasted-garlic-ketchup-recipe.html",
  "firstAdded": "2015-01-24T23:17:26.667000",
  "users": [
    null
  ],
  "keywords": [
    "sirloin",
    "medium",
    "onion",
    "worcestershire",
    "eyeball",
    "chipotles",
    "adobo",
    "grill",
    "couple",
    "palm",
    "fulls",
    "recommended",
    "montreal",
    "steak",
    "seasoning",
    "mccormick",
    "extravirgin",
    "olive",
    "oil",
    "drizzling",
    "garlic",
    "brown",
    "sugar",
    "vinegar",
    "roasted",
    "tomatoes",
    "salt",
    "pepper",
    "slices",
    "brickcut",
    "smoked",
    "sharp",
    "cheddar",
    "cabot",
    "round",
    "rolls",
    "split",
    "markets",
    "sell",
    "mini",
    "keiser",
    "use",
    "dinner",
    "flavor"
  ],
  "directions": [
    "0",
    "Preheat grill pan to high.",
    "Place the meat in a bowl. Cut the onion in half. Grate half the onion into the meat using the small grate on a box grater. Chop and reserve the other half onion. Add Worcestershire, chipotles and sauce and grill seasoning to burgers. Drizzle a little extra-virgin olive oil over the bowl and mix meat. Score the meat into 4 sections. Make 3 mini-burgers, each 3 inches wide, 1-inch thick, from each half-pound of meat.",
    "Heat a small sauce pot over medium heat. Add extra-virgin olive oil and garlic. Cook garlic 2 to 3 minutes then add sugar and vinegar, cook 2 minutes more and stir in tomatoes. Season sauce with salt and pepper and allow it to reduce 5 to 6 minutes more.",
    "Grill meat 2 to 3 minutes on each side and top with cheese, if you like.",
    "Place burgers on buns and top with raw chopped onions and warm fire roasted ketchup and serve.",
    "Recipe courtesy Rachael Ray"
  ],
  "ingredients": [
    "0",
    "2 pounds ground sirloin",
    "1 medium onion, peeled and cut in 1/2",
    "2 tablespoons Worcestershire sauce, eyeball it",
    "2 chipotles in adobo and 2 tablespoons of adobo sauce",
    "2 tablespoons grill seasoning, a couple of palm fulls, (recommended: Montreal Steak Seasoning by McCormick)",
    "1 tablespoon extra-virgin olive oil, plus some for drizzling",
    "3 cloves garlic, finely chopped",
    "3 tablespoons brown sugar",
    "1/4 cup vinegar",
    "1 (15-ounce) can crushed fire roasted tomatoes, about 2 cups",
    "Salt and pepper",
    "12 slices, 1/2-inch thick, brick-cut smoked Cheddar or sharp Cheddar, (recommended: Cabot), optional",
    "12 small round rolls, split",
    "(Many markets sell mini Keiser rolls or use dinner rolls in any flavor you like)"
  ],
  "__v": 1
}