{
  "hash": "cccce661d0295f8720ce25c82fc74615a2820a2d",
  "title": "Spicy Muffin Tin Tacos",
  "image": "//food.fnr.sndimg.com/content/dam/images/food/fullset/2016/6/24/0/FNK_taco-muffin-cups_s4x3.jpg.rend.hgtvcom.616.462.suffix/1468273454506.jpeg",
  "href": "https://www.foodnetwork.com/recipes/food-network-kitchen/spicy-muffin-tin-tacos-3413326",
  "extension": "",
  "firstAdded": "2018-02-13T17:25:26.669000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Special equipment: a 6-cup jumbo muffin tin",
    "Preheat the oven to 425 degrees F. Spray a 6-cup jumbo muffin tin with nonstick cooking spray. Gently fold the tortillas in half, then in quarters. Place 1 in each cup of the tin and unfold to make a cup. Spray the tortillas all over with nonstick cooking spray. Sprinkle with a pinch of salt. Bake until golden, 8 to10 minutes. Let cool.",
    "Meanwhile, heat the vegetable oil in a large nonstick skillet over medium-high heat. Add the onion and cook, stirring occasionally, until softened, about 2 minutes. Add the chili powder, cumin, coriander, Worcestershire, oregano, paprika and garlic powder; cook, stirring, until the onion is coated, about 1 minute.",
    "Add the beef, 1/2 teaspoon salt and a few grinds of pepper to the skillet. Cook, breaking up the meat with a spoon, until no longer pink, about 5 minutes. Add the salsa and bring to a simmer. Reduce the heat to medium and cook, stirring occasionally, until the juices are slightly thickened, about 4 minutes. Season with salt and pepper.",
    "Fill each taco cup with a thin layer of lettuce and then the beef mixture. Top with Cheddar, guacamole and sour cream as desired."
  ],
  "ingredients": [
    "0",
    "Nonstick cooking spray, for spraying the muffin tins and tortillas",
    "Six 6-inch flour tortillas",
    "Kosher salt and freshly ground black pepper",
    "1 tablespoon vegetable oil",
    "1/2 onion, finely chopped",
    "1 1/2 teaspoons chili powder",
    "1 1/2 teaspoons ground cumin",
    "1 teaspoon ground coriander",
    "1 teaspoon Worcestershire sauce",
    "1/2 teaspoon dried oregano",
    "1/2 teaspoon paprika",
    "1/4 teaspoon garlic powder",
    "12 ounces ground beef chuck",
    "1 cup black bean and corn salsa",
    "2 cups shredded iceberg lettuce",
    "Shredded Cheddar, guacamole and sour cream, for topping"
  ],
  "__v": 1
}