{
  "hash": "305d7d6e909ac5a5b2526d5d250f65dd79602b03",
  "title": "Seitanspjäll",
  "image": "http://www.vegania.net/recept/../img/julrecept/jul_007.jpg",
  "href": "http://www.vegania.net/recept/jul.html",
  "extension": "Chrome",
  "firstAdded": "2015-12-23T13:47:47.993000",
  "users": [
    null
  ],
  "keywords": [
    "cirka",
    "glutenmjl",
    "jordntter",
    "kokta",
    "bnor",
    "svarta",
    "eller",
    "soja",
    "vatten",
    "msk",
    "olja",
    "vitlksklyfta",
    "tomatpur",
    "tsk",
    "buljongpulver",
    "salt",
    "krm",
    "svartpeppar",
    "paprikapulver",
    "lkpulver",
    "kan",
    "uteslutas",
    "glasyr",
    "chipotlepasta",
    "ljus",
    "sojass",
    "sirap"
  ],
  "directions": [
    "0",
    "Rosta jordnötterna lätt. Hetta upp oljan och fräs vitlök och paprikapulver på låg värme någon minut, rör ner tomatpurén.",
    "Mixa ihop allt utom glutenmjölet till en slät sås. Rör ner glutenmjölet och knåda ihop en stund. Ta upp på bakbord och knåda ut till en platta som är knappt 1 cm tjock och 13 cm bred. Låt vila en kvart medan ugnen värms upp till 175 grader.",
    "Mixa ihop glasyren till en slät pasta.",
    "Om seitanet dragit ihop sig så platta ut det lite till. Skär sedan i längder med 1,5 cm:s bredd. Olja eller smöra ett bakpapper och lägg på en plåt. Lägg över seitanlängderna med lite mellanrum. Smält en stor klicka mjölkfritt margarin och pensla seitanet med (det går också bra att pensla på flytande margarin). Baka i 15 minuter, ta sedan ut och vänd bitarna. Pensla ovansidan med glasyren och grädda drygt 10 minuter till. Ta ut seitanen, höj ugnen till grillövervärme och pensla andra sidan av spjällen med resterande glasyr. Grilla på cirka 5 minuter. Klart!",
    "Om du gör längderna lite tunnare så får du schyssta tuggiga Jerkys! Sojafiléspjäll Koka sojafiléer mjuka i buljong med lite sojasås. Låt rinna av och pressa ur överflödig vätska. Rör ihop sojasås, sirap, lite paprikapulver och några droppar rökarom (inte för mycket! det ska bara vara en vag aning av rök) till en ganska tjock, söt glaze. Pensla eller vänd sojafiléerna i marinaden, lägg i en lättoljad ugnsform och baka i ugnen tills sojafiléerna får lite stekyta."
  ],
  "ingredients": [
    "0",
    "cirka 12 st",
    "2 ½ dl glutenmjöl",
    "3/4 dl jordnötter",
    "1 ½ dl kokta bönor (ej svarta eller soja)",
    "2 dl vatten",
    "2 msk olja",
    "1 msk soja",
    "1 vitlöksklyfta",
    "1 msk tomatpuré",
    "½ tsk buljongpulver",
    "½ tsk salt",
    "3/4 krm svartpeppar",
    "½ msk paprikapulver",
    "1 tsk lökpulver (kan uteslutas)",
    "Glasyr: 1 msk chipotlepasta i sås",
    "1 msk ljus sojasås",
    "2 tsk sirap",
    "3 msk olja",
    "½ msk tomatpuré"
  ],
  "__v": 1
}