{
  "hash": "8b7ecf5c8009bda9fed0d1644a16d3ce0bed2407",
  "title": "Crispy Bacon-Wrapped Shrimp Jalapeno Poppers",
  "image": "http://tastykitchen.com/recipes/wp-content/uploads/sites/2/2016/11/jalapeno-poppers-recipe-41-410x274.jpg",
  "href": "http://tastykitchen.com/recipes/appetizers-and-snacks/crispy-bacon-wrapped-shrimp-jalapeno-poppers/",
  "extension": "Chrome",
  "firstAdded": "2017-03-21T17:35:55.829000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 450ºF and line a rimmed baking sheet with parchment paper. Place a rack on top the tinfoil and set aside.",
    "Peel and devein the shrimp: twist the peel off the shell in segments, starting with the legs until all the shell is removed. Make sure to pinch off the tail as well. To remove the vein, take a paring knife and make a shallow slice along the back of the shrimp. Remove the dark vein that runs along the back using your fingers or the knife.",
    "Partially butterfly the shrimp by slicing a little deeper along the same line once the vein is removed.\nRepeat these steps with the remaining shrimp and then set aside.",
    "Slice jalapeño in half lengthwise and remove all the membrane and seeds using your fingers or a spoon. (You may want to use gloves to do this step to prevent your hands from burning later.) Once all the seeds are removed, slice the jalapeño into several long slices, about 6-8 per half, depending on how large the jalapeño is.",
    "To assemble the shrimp jalapeño poppers, place a slice of jalapeño against the slit in the shrimp and then wrap the whole thing with a slice of thick-cut, nitrate-free bacon. Secure with a toothpick and then place on the prepared baking sheet. Repeat with the remaining shrimp. (While you could just place the shrimp directly on the parchment paper, the rack allows for the extra oils to drip away from the poppers which helps keep them crispy and removes extra fat.)",
    "Place in the oven for 20–25 minutes, flipping once at the 10-minute mark. The poppers are done when the shrimp is cooked through and bacon is nice and crispy.",
    "While the shrimp is in the oven, make the creamy cilantro lime dipping sauce. Combine non-dairy yogurt with garlic, cilantro, lime juice, sea salt, ground cumin, and black pepper. (If you don’t like raw garlic, you could use powdered garlic instead.)",
    "Serve shrimp jalapeno poppers with sauce on the side."
  ],
  "ingredients": [
    "0",
    "½ pounds (16-20 Size) Large Shrimp",
    "2 Jalapeño Peppers",
    "½ pounds Thick, Uncooked Bacon (look For Nitrate-free)",
    "FOR THE DIPPING SAUCE:",
    "1 container (6 Oz. Size) Plain Almond Dream Non-dairy Yogurt",
    "1 clove Garlic, Minced",
    "¼ cups Cilantro Leaves, Finely Chopped",
    "1 Tablespoon Freshly Squeezed Lime Juice",
    "¼ teaspoons Sea Salt",
    "¼ teaspoons Ground Cumin",
    "¼ teaspoons Black Pepper"
  ],
  "__v": 1
}