{
  "hash": "53df88c8d1f7070d273e110526d97704d42ac21d",
  "title": "FETTUCCINE BOSCAIOLA",
  "image": "https://i1.wp.com/www.signorinaspaghetti.com/wp-content/uploads/2017/11/IMG-20171107-WA0009.jpg?resize=1024%2C1024",
  "href": "http://www.signorinaspaghetti.com/2017/11/09/fettuccine-boscaiola-with-sausage-and-porcini-mushrooms/",
  "extension": "Chrome",
  "firstAdded": "2017-11-11T12:16:38.149000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "STEP 1 Cut the sausage in small pieces and wash and cut the mushrooms.",
    "STEP 2 Peel and slice the onion/shallot.",
    "STEP 3 In a large non-stick frying pan, heat the olive oil and sautee the onion/shallot for a couple of minutes or until soft and translucent.",
    "STEP 4 At that moment add the sausage and cook until it changes color, then simmer with the white wine until it evaporates.",
    "STEP 5 Add the mushrooms and cook for around 10 minutes.",
    "STEP 6 At this point cover the with tomato puree and add a sprinkle of salt and pepper (to your taste, me I add not even 1/2 tablespoon at the time and then I taste to check and eventually add more).",
    "STEP 7 Cook over medium/low heat for around 20 minutes, stirring from time to time.",
    "STEP 8 In the meantime in a large pot, bring abundant salty water to a boil.",
    "STEP 9 When water is boiling, cook the fettuccine al dente ( usually it’s a couple of minutes before what indicated on the package, but it’s better to taste now and then).",
    "STEP 10 Add the fresh cream into the sauce and stir well, then take off heat.",
    "STEP 11 Drain the fettuccine – always saving some of the cooking water – and transfer them into the sauce as well.",
    "STEP 12 Toss well to coat and then if the sauce is too dry, add some of the cooking water.",
    "STEP 13 Toss again until well coated and add the fresh parsley.",
    "STEP 14 You can add Parmesan now as well or directly in your plate."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "7 oz (200 gr.) fettuccine or pasta of your choice",
    "1 white onion or shallot",
    "2 tbsp extra-virgin olive oil",
    "7 oz (200 gr) sausage",
    "1 glass white wine",
    "10 oz (300 gr) porcini mushrooms or champignons",
    "2 cups + 2 tbsp (500 ml) tomato puree",
    "1/2 cup fresh cream (optional)",
    "salt, pepper",
    "2 tbsp extra-virgin olive oil",
    "1 tsp fresh parsley,chopped",
    "1/2 cup Parmesan (optional)"
  ],
  "__v": 1
}