{
  "__v": 1,
  "directions": [
    "0",
    "Cook onion with a little olive oil in a saucepan over a medium heat until soft but not browned.",
    "Meanwhile sprinkle eggplant layers with salt and allow to stand while the onion cooks.",
    "Add tomatoes and a few basil leaves to the onion. Crush tomatoes to break up and simmer with the lid on for 30 minutes to an hour – you just want the flavours to come together – no need for the sauce to reduce. And don’t worry about seasoning it – there will be plenty of salt in the eggplant and cheese.",
    "Preheat oven to 220C (425F). Generously oil a large baking tray. Pat eggplant dry with paper towel, removing as much salt as possible. Place eggplant in a single layer on the tray (you may need 2 trays) and drizzle generously with more olive oil. Bake for 20 – 30 minutes, turning once or twice until eggplant is very soft and golden brown on both sides.",
    "Place a layer of tomato sauce in a medium baking dish. Layer with eggplant slices, top with more sauce, a few basil leaves and some cheese. Repeat the layers until everything is used up finishing with a generous sprinkle of cheese. Bake for 20 – 30 minutes or until cheese is melted and everything is hot and bubbling."
  ],
  "firstAdded": "2014-05-28T07:34:08.374000",
  "hash": "b7215cb0bbadebdd28d574de75060ac2e3c55fd9",
  "href": "http://thestonesoup.com/blog/2010/05/10-tips-for-optimum-vegetable-storage/",
  "image": "http://farm5.static.flickr.com/4028/4583012275_ce79e2b040.jpg",
  "ingredients": [
    "0",
    "1 large onion, peeled & diced",
    "2 large eggplant, sliced into rounds about 1.5cm (1/2in) thick",
    "2 x 400g (140z) can tomatoes",
    "1 bunch basil, leaves picked",
    "2 large handfuls freshly grated parmesan cheese + extra to serve"
  ],
  "keywords": [
    "onion",
    "eggplant",
    "rounds",
    "tomatoes",
    "bunch",
    "basil",
    "leaves",
    "picked",
    "parmesan",
    "cheese",
    "extra",
    "serve"
  ],
  "title": "[5 ingredients]\neggplant (aubergine) parmigiana\nserves 4",
  "users": [
    null
  ]
}