{
  "hash": "a061e2fd120d0fb3e5dd9a3f383f4b7ec1a82695",
  "title": "Creamy Bacon and Avocado Zucchini Noodles",
  "image": "//www.anyaseats.com/wp-content/uploads/2016/05/Creamy-Bacon-and-Avocado-Zucchini-Noodles-3.jpg",
  "href": "http://www.anyaseats.com/creamy-basil-zucchini-pasta-bacon/",
  "extension": "Chrome",
  "firstAdded": "2016-08-14T21:42:31.320000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 450.",
    "Spiralize the zucchinis using a spiralizer and place noodles into a colander.",
    "Gently sprinkle salt over the noodles and allow them to sit while you make the rest of the dish. This will drain the zucchini of a lot of it's liquid.",
    "While the zucchini noodles are draining, place 3 strips of bacon into the oven on a parchment lined baking sheet and cook for 15-20 minutes.",
    "In a bowl combine the avocado, smashed garlic cloves, coconut milk, lemon juice, 2 teaspoons of avocado oil and basil. Mix well and add salt and pepper, to taste.",
    "Use a fork to ensure the sauce is smooth. It doesn't have to be perfect, but all the ingredients should be fully combined.",
    "On medium high, heat 1-2 tablespoons of avocado oil in a pan in preparation for cooking the noodles.",
    "Remove the zucchini noodles from the colander and place into the heated pan.",
    "Cook for only 2-3 minutes until gently softened.",
    "Add the sauce into the pan and cook for another 1-2 minutes.",
    "The noodles should be slightly softer but should still have a bit of a crunch. Be careful not to overcook them!",
    "Remove zucchini noodles with sauce from the pan and divide into 2-3 bowls.",
    "Remove bacon from oven and allow to cool for 1-2 minutes.",
    "With your hands, gently crumble bacon on top of your noodles and enjoy!"
  ],
  "ingredients": [
    "0",
    "4 zucchinis",
    "3 strips of bacon",
    "1 avocado",
    "3 garlic cloves, crushed or smashed",
    "¼ cup coconut milk",
    "juice from ¼ lemon",
    "2 teaspoons avocado oil",
    "¼ cup fresh basil, minced",
    "salt and pepper, to taste",
    "1-2 tablespoons avocado oil, for cooking"
  ],
  "__v": 1
}