{
  "hash": "79ff5a5a0f40c2b7f2b41fd8dfef8f064182c916",
  "title": "Soft Gluten Free Tortilla Recipe",
  "image": "http://alittleinsanity.wpengine.netdna-cdn.com/wp-content/uploads/2013/09/gluten_free_soft_tortillas.jpg",
  "href": "http://alittleinsanity.com/soft-gluten-free-tortilla-recipe/",
  "extension": "",
  "firstAdded": "2015-11-02T15:08:09.172000",
  "users": [
    null
  ],
  "keywords": [
    "erikas",
    "purpose",
    "gluten",
    "free",
    "flour",
    "baking",
    "salt",
    "palm",
    "shortening",
    "water",
    "extra",
    "rolling",
    "pressing",
    "tapioca",
    "starch",
    "gritty"
  ],
  "directions": [
    "0",
    "In your KitchenAid Stand Mixer fitted with the whisk attachment, combine the Gluten Free Flour with Baking Powder, Salt & Palm Shortening.",
    "Mix on a Medium speed until everything is well blended - Your mixture will appear slightly moist, but much like how brown sugar grains look/feel.",
    "Slowly drizzle in the 1 Cup of warm water until the mixture forms a ball - the dough will be moist, but puffy & soft to touch... Better that the mixture be slightly moist, then too dry.",
    "Using a spatula, scrape the dough from the whisk back into the bowl and press all of the dough into a ball.",
    "Set the dough aside to rest while you pre-heat your skillet & prepare your work space.",
    "Pre-heat your cast iron skillet on a medium heat (5-for about 5-10 minutes, then turn down to a low setting (2-4) when cooking the tortillas.",
    "On a well floured work surface (I use a cutting board lined with parchment paper) take a small pinch (about 4 Tablespoons or ¼ Cup) rounded ball of tortilla dough and roll it in your floured hands until you make a small disk about 3 inches in diameter.",
    "Place the dough on the floured surface and use your rolling pin (or tortilla press if you're using one) to roll the dough out very thinly (maybe an ⅛\" thick). You may have to dust the surface or rolling pin again with flour if need be.",
    "Once the tortilla is rolled/pressed out, flip the parchment paper gently over on your hand or directly in the skillet to to release the raw tortilla and transfer it to the pre-heated skillet.",
    "Cook the tortilla approximately 30-45 seconds on each side. You may begin to see little bubbles forming as it cooks - that ok! Unlike regular tortillas, these shouldn't make large bubbles.",
    "It's important not to over cook the tortillas (this took me a few tries to figure out) - Otherwise, you'll end up with a very crisp/fried disk that looks nice, but isn't as tasty!",
    "If eating immediately after cooking, stack the tortillas on a plate covered with a kitchen towel to keep them moist & warm until serving. If you are saving some for later, keep the tortillas under the towel until you're all done cooking them - then transfer them to a ziplock bag and keep them on the counter for up to 3-4 days. You can also warm them up in the microwave for a few seconds if need be."
  ],
  "ingredients": [
    "0",
    "2¾ Cups of my Erika's All Purpose Gluten Free Flour Mix",
    "2½ teaspoons Baking Powder",
    "1 teaspoon Salt",
    "6 Tablespoons Palm Shortening",
    "1 Cup Warm Water",
    "Extra GF Flour for Rolling or Pressing - or Tapioca Starch (which is less gritty)"
  ],
  "__v": 1
}