{
  "hash": "ce9da320b72d2b2c48e55dc58a8f8f89bd4f42e9",
  "title": "Slow Cooker Rosemary Garlic Beef Stew",
  "image": "http://static.budgetbytes.com/wp-content/uploads/2014/10/Rosemary-Garlic-Beef-Stew-text.jpg",
  "href": "http://www.budgetbytes.com/2014/10/slow-cooker-rosemary-garlic-beef-stew-slow-cooker/",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T22:07:13.880000",
  "users": [
    null
  ],
  "keywords": [
    "medium",
    "carrots",
    "sleeve",
    "celery",
    "onion",
    "lbs",
    "red",
    "potatoes",
    "olive",
    "oil",
    "garlic",
    "beef",
    "stew",
    "meat",
    "salt",
    "pepper",
    "allpurpose",
    "flour",
    "broth",
    "dijon",
    "mustard",
    "worcestershire",
    "soy",
    "brown",
    "sugar",
    "rosemary",
    "thyme"
  ],
  "directions": [
    "0",
    "Dice the onion and slice the carrots and celery. Wash the potatoes well and cut them into one inch cubes. Place the onion, carrots, celery, and potatoes into a large slow cooker.",
    "Place the stew meat in a large bowl and season liberally with salt and pepper. Add the flour and toss the meat until it is coated. Set the floured meat aside.",
    "Heat the olive oil in a large heavy skillet over medium heat. Sauté the garlic in the hot oil for about one minute, or until soft and fragrant. Add the floured meat and all the flour from the bottom of the bowl to the skillet. Let the beef cook without stirring for a few minutes to allow it to brown on one side. Stir and repeat until most or all sides of the beef pieces are browned. Add the browned beef to the slow cooker and stir to combine with the vegetables.",
    "Return the skillet to the burner and turn the heat down to low. Add the beef broth, Dijon, Worcestershire sauce, soy sauce, brown sugar, rosemary, and thyme to the skillet. Stir to combine the ingredients and dissolve the browned bits from the bottom of the skillet. Once everything is dissolved off the bottom of the skillet, pour the sauce over the ingredients in the slow cooker. The sauce will not cover the contents of the slow cooker, but it's okay. More moisture will be released as it cooks.",
    "Place the lid on the slow cooker and cook on high for four hours. After four hours, remove the lid and stir the stew, breaking the beef into smaller pieces as you stir. Taste the stew and adjust the salt if needed. Serve hot as is, or over a bowl of rice or pasta."
  ],
  "ingredients": [
    "0",
    "½ lb. (4 medium) carrots $0.55",
    "½ sleeve celery $0.65",
    "1 medium onion $0.36",
    "2 lbs. red potatoes $1.00",
    "2 Tbsp olive oil $0.32",
    "4 cloves garlic, minced $0.32",
    "1½ lbs. beef stew meat $9.06",
    "Salt and pepper $0.05",
    "¼ cup all-purpose flour $0.04",
    "2 cups beef broth $0.30",
    "2 Tbsp Dijon mustard $0.24",
    "1 Tbsp Worcestershire sauce $0.06",
    "1 Tbsp soy sauce $0.10",
    "½ Tbsp brown sugar $0.02",
    "½ Tbsp dried rosemary $0.15",
    "½ tsp thyme $0.05"
  ],
  "__v": 1
}