{
  "hash": "849c1c5b452cf3f8636bec17eb980e9b1aec9885",
  "title": "Roasted Pears with Espresso Mascarpone Cream",
  "image": "http://chimeraobscura.com/mi/wp-content/uploads/20110911-_DSC1931.jpg",
  "href": "http://chimeraobscura.com/mi/thats-a-wrap/",
  "extension": "Chrome",
  "firstAdded": "2017-04-11T20:23:49.892000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the pears",
    "Preheat oven to 375 degrees. Peel pears if you like (not really necessary if you buy organic), halve them lengthwise and core. Place cut side up in a roasting pan and sprinkle with lemon juice. Sprinkle sugar evenly over pear halves and dot with butter. Pour water into the roasting pan and bake pears for 30 minutes, basting with pan juices a few times. Flip pears over and bake an additional 30 minutes, basting with pan juices a few times. Pears are ready when a knife slips easily into the thickest part. (Seckel pears may take less time. Start checking for done-ness around the 40-minute mark.) Allow pears to cool to room temperature.",
    "Make the mascarpone cream",
    "Pour whipping cream into a small bowl. Slice vanilla bean in half lengthwise and scrape seeds into the cream, stirring to evenly distribute. Add bean to cream. Cover bowl and refrigerate for at least an hour, along with the bowl and beater of an electric stand mixer.",
    "Just before serving, pour cream through a fine mesh strainer into the chilled mixing bowl. Add mascarpone and espresso, and beat on medium speed until ingredients are just combined. Increase speed to medium-high and with mixer running, sprinkle in sugar, beating until soft peaks form.",
    "Finishing",
    "Top a pear half with a dollop of mascarpone cream. Add one or both of the finishing ingredients to taste."
  ],
  "ingredients": [
    "0",
    "For the pears",
    "4 pears, any type (8 pears, if you use the seckel variety)",
    "2 tablespoons lemon juice",
    "1 tablespoon sugar",
    "2 tablespoons water",
    "2 tablespoons unsalted butter",
    "For the mascarpone cream",
    "1 cup whipping cream",
    "1 vanilla bean",
    "1 cup mascarpone",
    "1/4 – 1/3 cup sugar",
    "2-3 tablespoons espresso, chilled",
    "For finishing",
    "cocoa powder",
    "toasted ground almonds"
  ],
  "__v": 1
}