{
  "hash": "7cc0083d0143d33ad33788ef4d696603e7b636b1",
  "title": "Spinach and Orzo Salad",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2008/04/spinach-orzo-salad-horiz-a-1200.jpg",
  "href": "http://www.simplyrecipes.com/recipes/spinach_and_orzo_salad/",
  "extension": "",
  "firstAdded": "2017-07-13T22:23:21.190000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Cook the orzo pasta: Bring to a pot of salted water to a rolling boil (1 Tbsp of salt for every 2 quarts of water). Add the orzo to the pot. Leave uncovered, cook on high heat with a vigorous boil for 8-10 minutes until al dente (cooked, but still a little firm).",
    "Drain. Rinse with cold water to cool quickly.",
    "2 Toast the pine nuts: Toast the pine nuts by heating a small skillet on medium heat. Add the pine nuts and stir occasionally until the pine nuts are lightly browned. Pay attention or you'll burn the pine nuts.",
    "3 Purée half the spinach with 1 Tbsp olive oil, mix with orzo: Take half of the spinach and purée it in a food processor or blender, adding one tablespoon of the olive oil. In a large serving bowl mix the spinach purée olive oil mixture in with cooked orzo until the pasta is well coated with the purée.",
    "4 Mix onion, feta, pine nuts, olives, remaining spinach with the orzo: Roughly chop the other half of the spinach. Then gently mix the spinach, the red onion, feta cheese, pine nuts, and the Kalamata olives in with the orzo.",
    "5 Make dressing: In a small jar, combine the remaining olive oil (2 Tbsp), balsamic vinegar, red wine vinegar, mustard, dried basil, and dried tarragon. Put a lid on the jar and shake to combine. (You can also just whisk together these ingredients in a small bowl, but the jar method works great to get a good emulsion.)",
    "6 Pour dressing over orzo: Pour over orzo spinach mixture and gently mix in until well incorporated.",
    "Chill for at least an hour before serving."
  ],
  "ingredients": [
    "0",
    "8 ounces orzo pasta",
    "Salt",
    "1/4 cup pine nuts",
    "6 ounces feta cheese, roughly crumbled",
    "2 ounces Kalamata Greek olives pitted, roughly chopped, about 1/2 cup (about 20 olives)",
    "4 ounces baby spinach",
    "1/2 cup chopped red onion (about half a red onion)",
    "3 Tbsp olive oil",
    "1 Tbsp balsamic vinegar",
    "1 Tbsp red wine vinegar (can substitute white vinegar or lemon juice)",
    "1 teaspoon Dijon mustard",
    "Pinch dried basil",
    "Pinch dried tarragon",
    "Salt and freshly ground black pepper to taste"
  ],
  "__v": 1
}