{
  "hash": "7fc7ea48327f0be1e1aec03ce22c042d25f11956",
  "title": "Lemon Bar Cheesecake",
  "image": "http://cdn-image.myrecipes.com/sites/default/files/styles/300x300/public/image/recipes/sl/13/02/lemon-bar-cheesecake-sl-x.jpg?itok=O0V4SroN",
  "href": "http://www.myrecipes.com/recipe/lemon-bar-cheesecake?XID=mr_socialflow_facebook",
  "extension": "Chrome",
  "firstAdded": "2016-07-02T02:55:36.330000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Pulse first 3 ingredients in a food processor 3 or 4 times or just until blended. Add butter, and pulse 5 or 6 times or until crumbly. Whisk together egg yolks and 1 Tbsp. ice-cold water in a small bowl; add to butter mixture, and process until dough forms a ball and pulls away from sides of bowl, adding up to 1 Tbsp. remaining ice-cold water, 1 tsp. at a time, if necessary. Shape dough into a disk; wrap in plastic wrap. Chill 4 to 24 hours.",
    "Roll dough into a 14-inch circle on a lightly floured surface. Fit dough into a lightly greased 9-inch dark springform pan, gently pressing on bottom and up sides of pan; trim and discard excess dough. Chill 30 minutes.",
    "Meanwhile, preheat oven to 325°. Beat cream cheese at medium speed with an electric mixer 3 minutes or until smooth. Gradually add granulated sugar, beating until blended. Add eggs, 1 at a time, beating just until yellow disappears after each addition. Beat in vanilla.",
    "Pour two-thirds of cheesecake batter (about 4 cups) into prepared crust; dollop 1 cup lemon curd over batter in pan, and gently swirl with a knife. Spoon remaining batter into pan.",
    "Bake at 325° for 1 hour to 1 hour and 10 minutes or just until center is set. Turn oven off. Let cheesecake stand in oven, with door closed, 15 minutes. Remove cheesecake from oven, and gently run a knife around outer edge of cheesecake to loosen from sides of pan. (Do not remove sides of pan.) Cool completely in pan on a wire rack (about 1 hour). Cover and chill 8 to 24 hours.",
    "Remove sides of pan, and transfer cheesecake to a serving platter. Spoon remaining 1 cup lemon curd over cheesecake, and, if desired, top with Candied Lemon Slices."
  ],
  "ingredients": [
    "0",
    "2 cups all-purpose flour",
    "1/2 cup powdered sugar",
    "1/4 teaspoon salt",
    "1/2 cup cold butter, cubed",
    "2 egg yolks",
    "1 to 2 Tbsp. ice-cold water",
    "4 (8-oz.) packages cream cheese, softened",
    "1 cup granulated sugar",
    "4 large eggs",
    "2 teaspoons vanilla extract",
    "2 cups Quick and Easy Lemon Curd, divided",
    "Candied Lemon Slices (optional)"
  ],
  "__v": 1
}