{
  "hash": "01c239198455af18bf1af20b477bfd13be26a1eb",
  "title": "FAJITAS DE POLLO MEXICANAS",
  "image": "http://www.javirecetas.com/images/63/fajitas.jpg",
  "href": "http://javirecetas.hola.com/fajitas-fajitas-de-pollo-mexicanas/",
  "extension": "",
  "firstAdded": "2015-07-25T16:15:04.607000",
  "users": [
    null
  ],
  "keywords": [
    "tortillas",
    "trigo",
    "por",
    "persona",
    "gramos",
    "pollo",
    "verde",
    "pimiento",
    "rojo",
    "pimientos",
    "asar",
    "tomates",
    "grandes",
    "cebolla",
    "lechuga",
    "queso",
    "rallado",
    "para",
    "fundir",
    "diente",
    "ajo",
    "guindilla",
    "cucharadita",
    "pimentn",
    "picante",
    "aceite",
    "oliva",
    "sal",
    "pimienta"
  ],
  "directions": [
    "0",
    "Cortamos los pimientos en tiras un poquito gruesas (ver fotografía) y la cebolla en tiras finas.",
    "Ponemos dos cucharadas de aceite de oliva en una sartén y cuando esté caliente añadimos los pimientos y la cebolla. Añadimos una pizca de sal y rehogamos bien durante 15 minutos.",
    "Mientras se van haciendo las verduras aprovecharemos para limpiar el pollo de las fajitas. Debemos cortar el pollo en tiras finas, añadir sal y pimienta y reservar.",
    "Pasados los 15 minutos de las verduras añadimos el tomate pelado y picado muy fino (si le quitas las semillas mejor). Dejamos hacer 10 minutos más.",
    "Pon el horno a calentar a 180ºC. Lo usaremos más tarde para darle un golpe de calor a las tortillas de trigo.",
    "En otra sartén ponemos dos cucharadas de aceite de oliva, una guindilla (puedes usar pimienta de cayena) y un diente de ajo pelado y sin picar. Cuando el aceite esté caliente añade el pollo a tiras y saltea durante unos minutos hasta que el pollo esté dorado.",
    "Cuando el pollo esté listo, retira el ajo y la guindilla y desecha. Añade el pollo a las verduras. Es el momento de añadir el pimentón picante (1/2 cucharada de postre). Removemos bien y lo apartamos del fuego para no quemar el pimentón.",
    "Coge la lechuga (tiene que estar bien limpia y muy seca) y pícala finamente. Añádela a la mezcla de verduras y pollo y remueve bien.",
    "Ahora coge el queso rallado y échalo sobre la mezcla. Si hay alguien a quien no le guste el queso puedes saltarte este paso y añadir el queso a la hora de montar las fajitas.",
    "Ahora queda rellenar las tortillas de trigo con el pollo y las verduras. Yo prefiero una vez que están las fajitas montadas meterlas en el horno y calentarlas con el grill puesto para que se dore la tortilla de trigo. Pero tu puedes si prefieres calentar las tortillas en el microondas e ir montando después las fajitas. Lee las instrucciones del paquete de tortillas y haz lo que tu prefieras pero el golpe de calor en el horno es más cómodo pues puedes calentar todas las fajitas a la vez y servir calientes."
  ],
  "ingredients": [
    "0",
    "4 tortillas de Trigo (2 por persona)",
    "150 gramos de pollo",
    "1/2 pimiento verde y 1/2 pimiento rojo (pimientos de asar)",
    "2 tomates grandes",
    "50 gramos de cebolla",
    "50 gramos de lechuga",
    "80 gramos de queso rallado para fundir",
    "1 diente de ajo",
    "1 guindilla",
    "1/2 cucharadita de pimentón picante",
    "aceite de oliva",
    "sal y pimienta"
  ],
  "__v": 1
}