{
  "__v": 1,
  "directions": [
    "0",
    "Preparazione dei cavatelli con porcini e salsiccia",
    "1) Dai il via alla preparazione dei tuoi cavatelli con porcini e pomodori secchi scolando questi ultimi dall'olio di conservazione ed asciugandoli accuratamente con carta da cucina, per poi tagliarli a dadini di medie dimensioni.",
    "2) Successivamente, scalda 4 cucchiai di olio extravergine d'oliva all'interno di una padella antiaderente, unisci il trito di pomodori secchi appena preparato e lascialo soffriggere per qualche secondo. Aggiungi poi la salsiccia spellata e sbriciolata e lasciala rosolare per 4-5 minuti circa, controllandola e rigirandola con frequenza.",
    "3) Una volta pronta, bagnala con il vino e lascia che quest'ultimo sfumi a fiamma alta. Pulisci i funghi, elimina la parte terrosa dei gambi, strofinali con un panno bagnato in modo da eliminare eventuali ulteriori impurità e tagliali a fettine. Uniscili alla salsiccia, aggiusta di sale ed aggiungi le foglioline di timo, per poi lasciar proseguire la cottura a fiamma bassa e pentola coperta per 15 minuti circa.",
    "4) Nel frattempo, approfittane per cuocere la pasta in abbondante acqua bollente e salata, scolandola quando è ancora piuttosto al dente.",
    "5) Mettila in padella con il sugo e, mescolandola costantemente, falla saltare per qualche istante in modo che si insaporisca. Servi i cavatelli porcini e salsiccia cospargendoli di ricotta dura grattugiata a scaglie con l'ausilio di una grattugia a fori grossi."
  ],
  "firstAdded": "2014-10-08T14:19:40.438000",
  "hash": "ef47f2f39059b6aef843d64b78026fcfaaa50214",
  "href": "http://www.salepepe.it/ricette/primi/pasta-secca/formati-speciali/cavatelli-porcini-pomodori-secchi-salsiccia/?utm_source=facebook&utm_medium=social&utm_campaign=fb",
  "image": "http://www.salepepe.it/files/2014/04/cavatelli-con-porcini-pomodori-secchi-e-salsiccia-crop-986-400-986-400.jpg",
  "ingredients": [
    "0",
    "AGLIO",
    "1 SPICCHIO",
    "FUNGHI PORCINI",
    "500 GRAMMI",
    "OLIO DI OLIVA EXTRAVERGINE",
    "q.b.",
    "PASTA DI SEMOLA (DI GRANO DURO)",
    "320 GRAMMI",
    "POMODORO SECCO",
    "4",
    "SALE",
    "q.b.",
    "SALSICCIA DI MAIALE E MANZO FRESCA",
    "300 GRAMMI",
    "TIMO",
    "2 RAMETTO",
    "VINO BIANCO",
    "5 BICCHIERI",
    "RICOTTA DURA",
    "40 GRAMMI"
  ],
  "keywords": [
    "aglio",
    "spicchio",
    "funghi",
    "porcini",
    "grammi",
    "olio",
    "oliva",
    "extravergine",
    "pasta",
    "semola",
    "grano",
    "duro",
    "pomodoro",
    "secco",
    "sale",
    "salsiccia",
    "maiale",
    "manzo",
    "fresca",
    "timo",
    "rametto",
    "vino",
    "bianco",
    "bicchieri",
    "ricotta",
    "dura"
  ],
  "title": "I CAVATELLI CON PORCINI, POMODORI SECCHI E SALSICCIA",
  "users": [
    null
  ]
}