{
  "hash": "d2dc1d0486e99ad3fafa6af6b0013be4d91fa530",
  "title": "ACTUALLY CRISPY BAKED CHICKPEAS",
  "image": "https://minimalistbaker.com/wp-content/uploads/2017/12/EASY-Crispy-Baked-Chickpeas-The-ultimate-3-ingredient-snack-with-fiber-protein-and-BIG-flavor-snack-vegan-glutenfree-chickpeas-minimalistbaker-recipe-9.jpg",
  "href": "https://minimalistbaker.com/actually-crispy-baked-chickpeas/",
  "extension": "",
  "firstAdded": "2018-04-30T16:48:08.672000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 degrees F (176 C) and set out a bare baking sheet.",
    "Drain chickpeas well. If using oil, rinse well with water and thoroughly drain. If omitting oil, simply drain well and skip rinsing with water.",
    "Once drained well, spread the chickpeas out on a clean, absorbent towel and use your hands to gently roll and dry the chickpeas. Some of the skins should start coming off. You can opt to peel all of the chickpeas - which can help for extra crispiness! - or simply remove the skins that come off. Either way, the chickpeas will crisp up. I just found that peeling them does yield slightly crispier chickpeas.",
    "Transfer the chickpeas to a mixing bowl and top with oil (or omit) and salt. Mix well to combine. DO NOT add the other seasoning at this point - it can interrupt the crisping process, so wait to add until after baking.",
    "Bake for a total of 45-50 minutes or until golden brown and dry/crispy to the touch. I like turning my pan around and shaking the chickpeas around at the halfway point for even cooking.",
    "Remove from oven and toss with seasonings (if desired) while still warm. Then let cool 5-10 minutes - they will continue crisping as they cool.",
    "Serve as is or atop bowls or salads! To store, place in a Tupperware container or jar and DO NOT tightly cover. Instead, crack lid so they can \"breathe\" a bit. I found that this helped the, stay crispy longer. These are best in the first day, but they will last for 4-5 days at room temperature. Alternatively, seal well and freeze up to 1 month."
  ],
  "ingredients": [
    "0",
    "1 15-ounce (425 g) can chickpeas, drained and very well drained + thoroughly dried",
    "1 Tbsp (15 ml) avocado or other neutral oil (if avoiding oil, omit and don’t rinse chickpeas out of the can - just drain)",
    "1/2 tsp sea salt",
    "1 tsp seasonings of choice (such as DIY Curry Powder, Shawarma Spice Blend, or chili powder)"
  ],
  "__v": 1
}