{
  "hash": "c5b91adae3dbc92f4475539b6bb54aee7cf6d7a2",
  "title": "Vegan Burge",
  "image": "",
  "href": "https://www.wellandgood.com/good-food/my-healthy-dish-food-swap-summer-recipes/slide/5/",
  "extension": "Chrome",
  "firstAdded": "2018-05-13T05:02:55.401000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place lentils in colander and rinse under water.",
    "In small saucepan add the lentils and 1 1/4 cup water, bring to a boil, down to a simmer and cover with lid. Simmer for 15–20 minutes. Allow to cool for 10 minutes and blend in food processor to a chunky consistency.",
    "Pre-heat a large non-stick pan to medium, add 1/2 tablespoon olive oil and chopped crimini mushrooms. Cook for 5 minutes while occasionally stirring mushrooms around with large cooking spoon. Drain any excess liquid.",
    "In large bowl add lentils, mushrooms, sunflower seeds, garlic, onions, paprika, Dijon mustard, ketchup, Worcestershire sauce, salt, and pepper. Mix all ingredients by hand and mold into 4-ounce burger patties. Heat a small non-stick pan on medium and 1 teaspoon olive oil and 1 veggie burger patty.",
    "Cook 4–5 minutes on each side or until slightly crispy on the outside. Repeat cooking process with each veggie patty, but be sure to wipe pan with wet paper towel each time.",
    "To serve, Nguyen recommends a thick bread like a Brioche bun—slice in half, smear with a little Dijon mustard, ketchup, sliced boiled beets, and top with a big handful of microgreens. Note: If you want to keep this meal entirely vegan, make sure you choose a bread bun that has no dairy or eggs."
  ],
  "ingredients": [
    "0",
    "1/2 cup uncooked green lentils",
    "2 cups chopped crimini mushrooms",
    "1 1/2 Tbsp sunflower seeds",
    "1 tsp minced garlic",
    "1/4 onion minced",
    "1/2 tsp paprika",
    "1/2 Tbsp Dijon mustard",
    "1 Tbsp ketchup",
    "1 tsp Worcestershire sauce",
    "2 Tbsp olive oil",
    "1/2 tsp salt",
    "1/2 tsp black pepper"
  ],
  "__v": 1
}