{
  "hash": "53c7b9ea0b14e655b50f0d71843e2ab82133e1a0",
  "title": "Creamy Honey Mustard Chicken With Crispy Bacon",
  "image": "https://i2.wp.com/cafedelites.com/wp-content/uploads/2016/06/Creamy-Honey-Mustard-Chicken-RECIPE-3.jpg?resize=720%2C1080",
  "href": "https://cafedelites.com/2016/06/24/creamy-honey-mustard-chicken/",
  "extension": "Chrome",
  "firstAdded": "2017-03-28T23:07:44.258000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large, shallow dish, combine the honey, mustard, garlic, oil and salt to taste (not too much salt if serving with bacon as the bacon will add a salty flavour when served). Coat chicken evenly in the sauce. Set aside.",
    "Heat a nonstick pan (or skillet) over medium heat. Fry bacon until crispy; transfer to a plate. To the same pan, sear chicken fillets on each side in the oil left over from the bacon until just beginning to brown (about 3 minutes per side -- not completely cooked through as we will finish them in the sauce).",
    "Add any remaining honey mustard sauce into the pan along with the cream and milk. Bring to a simmer while stirring occasionally to mix the favours through the sauce (about 3 minutes), until the chicken is cooked through. Transfer the chicken to a warm plate.",
    "Pour the cornstarch mixture into the centre of the pan, mixing it through the sauce until it thickens. Place chicken back into the pan; coat with the sauce. Top with the bacon and garnish with parsley.",
    "Serve over steamed / roasted vegetables for lower cal options. Also great with pasta, rice or mashed potatoes!"
  ],
  "ingredients": [
    "0",
    "⅓ cup honey",
    "3 level tablespoons whole grain mustard",
    "1½ tablespoons minced garlic",
    "1 tablespoon olive oil",
    "Salt to season",
    "5 skinless and boneless chicken breasts (or chicken thighs)",
    "½ cup diced bacon, trimmed of rind and fat",
    "⅓ cup cream (light or reduced fat) *SEE NOTES FOR SUBSTITUTION OPTIONS",
    "1 cup milk (skim, 2% or full fat - almond milk may be used for a dairy free option)",
    "1 teaspoon cornstarch (corn flour) mixed with 1 tablespoon water",
    "2 tablespoon chopped fresh parsley"
  ],
  "__v": 1
}