{
  "__v": 1,
  "directions": [
    "0",
    "Soak the rice noodles in water for about 15 minutes. Drain and set aside.",
    "Cook the sauce by heating a saucepan. Pour-in the cooking oil.",
    "When the oil is hot enough, put-in the ground pork and cook for about 5 to 7 minutes",
    "Dilute the annato powder in pork broth then pour the mixture in the saucepan. Bring to a boil (If you are using anatto seeds, soak them first in 3 tbsp water to bring-out the color)",
    "Add the shrimp cube and stir and simmer for 3 minutes",
    "Add the flour gradually while stirring.",
    "Add the fish sauce and ground black pepper then simmer until sauce becomes thick. Set aside.",
    "Meanwhile, boil enough water in a pot.",
    "Place the soaked noodles in a strainer (use metal or bamboo strainer) then submerge the strainer in the boiling water for about a minute or until the noodles are cooked. (make sure that the noodles are still firm)",
    "Remove the strainer from the pot and drain the liquid from the noodles.",
    "Place the noodles in the serving plate.",
    "Pour the sauce on top of the noodles then arrange the toppings over the sauce.",
    "Serve with a slice of lemon or calamansi. Share and enjoy!"
  ],
  "firstAdded": "2014-04-09T12:19:52.313000",
  "hash": "b0f5b2ab77ab4c647341203f47bef0bf1f3d0d27",
  "href": "http://panlasangpinoy.com/2009/09/10/asian-filipino-food-noodles-pansit-pancit-palabok-recipe/",
  "image": "//www.panlasangpinoy.com/wp-content/uploads/2009/09/palabok3-1024x768.jpg",
  "ingredients": [
    "0",
    "2 tbsp cooking oil",
    "1/2 lb ground pork",
    "1 tbsp anatto powder",
    "3 cups pork broth",
    "1 piece shrimp cube",
    "6 tablespoons all-purpose flour",
    "2 tbsp fish sauce",
    "1/2 tsp ground black pepper"
  ],
  "keywords": [
    "cooking",
    "oil",
    "pork",
    "anatto",
    "broth",
    "shrimp",
    "cube",
    "allpurpose",
    "flour",
    "fish",
    "black",
    "pepper"
  ],
  "title": "Pancit Palabok Recipe",
  "users": [
    null
  ]
}