{
  "hash": "1411a08e511a9da83d62d9509da9cb41d94b5e3c",
  "title": "Pickled Carrots\nMAKES",
  "image": "http://recipe-folder.com/img/recipe-images/057/236/353923357.gif",
  "href": "https://www.thekitchn.com/how-to-make-pickled-carrots-247432",
  "extension": "",
  "firstAdded": "2020-03-17T14:54:35.877000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Wash and dry the jars. Wash 2 wide-mouth (8-ounce) jars, lids, and rings in warm, soapy water and rinse well. Set aside to dry, or dry completely by hand.",
    "Prepare the carrots, onions, and jalapeños: Peel and slice the carrots into 1/4-inch-thick rounds. Trim the stems from the jalapeños, then cut into 1/4-inch-thick rounds. Halve and thinly slice the onion. Place them all in a medium bowl and toss to combine.",
    "Pack the vegetables into the prepared jars. Pack the vegetables into the jars, making sure there is a 1/2 inch of space from the rim of the jars to the tops of the vegetables. Pack them in as tightly as you can without smashing. Add 1 garlic clove, 1 bay leaf, and 1 sprig of thyme to each jar.",
    "Make the pickling liquid. Place the vinegar, water, salt, oregano, and sugar if using in a small saucepan over high heat. Bring to a boil, stirring to dissolve the salt and sugar.",
    "Pour the brine over the vegetables. Pour the hot brine into the jars, filling each one to within 1/2 inch of the top. You might not use all the brine. Gently tap the jars against the counter a few times to remove all the air bubbles. Top off with more pickling brine if necessary.",
    "Tightly seal the jars. Place the lids over the jars and screw on the rings until tight.",
    "Cool the jars and then refrigerate for 24 hours. Let the jars cool at room temperature for 1 hour. Store the pickles in the refrigerator. The pickles will improve with flavor as they age — try to wait at least 24 hours before cracking them open."
  ],
  "ingredients": [
    "0",
    "3 large carrots",
    "2 medium jalapeños",
    "1 small sweet onion",
    "2 cloves garlic",
    "2 bay leaves",
    "2 sprigs fresh thyme",
    "1 cup apple cider vinegar",
    "1/2 cup water",
    "2 tablespoons kosher salt",
    "1 tablespoon dried oregano",
    "1 tablespoon granulated sugar (optional)"
  ],
  "__v": 1
}