{
  "hash": "396d1732aa91247b2a759302c1c8097a44e0ac7f",
  "title": "instant pot tuscan chicken pasta",
  "image": "https://www.365daysofcrockpot.com/wp-content/uploads/2018/01/instant-pot-tuscan-chicken-pasta-recipe.jpg",
  "href": "https://www.365daysofcrockpot.com/instant-pot-tuscan-chicken-pasta/",
  "extension": "",
  "firstAdded": "2019-01-03T15:38:12.310000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Add the chicken, noodles, broth and butter to the Instant Pot. Try to cover the noodles as much as possible with the liquid. Cover the pot and secure the lid. Make sure valve is set to “sealing.” Set the manual pressure cook button to 3 minutes.",
    "When the timer beeps let the pot sit for 5 more minutes (the display will start counting up). Move the valve to “venting.” If foam starts coming out move it back to sealing and wait a few minutes to try again. Once all the pressure is release, remove the lid.",
    "Turn the pot to the saute function. Stir in the garlic powder, cream cheese and milk. There will seem to be a lot of liquid in the pot but don’t worry. Once the cream cheese is melted add in the Parmesan and stir until melted. Add in the sun dried tomatoes, salt, pepper, basil and finally the spinach. Stir until the spinach is cooked down.",
    "Scoop the pasta onto plates and serve."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1 lb boneless, uncooked boneless, skinless chicken breasts, cut into bite size pieces",
    "8 oz cavatappi noodles (you can also use cellentani noodles or elbow macaroni)",
    "2 cups chicken broth",
    "2 Tbsp butter",
    "1/2 tsp garlic powder",
    "4 oz cream cheese",
    "3/4 cup milk",
    "1 cup grated Parmesan cheese",
    "1 (8 oz) jar sun-dried tomatoes, rinsed, drained and chopped",
    "1/4 tsp kosher salt",
    "1/4 tsp freshly ground pepper",
    "2 Tbsp fresh chopped basil (or 2 Tbsp of basil in the squeeze tube or 1 tsp dried basil)",
    "2-3 cup baby spinach"
  ],
  "__v": 1
}