{
  "hash": "37a49a72ddd6f69abef383745762af27fb517dfb",
  "title": "Marjolaine Cake",
  "image": "https://bakingwithsibella.files.wordpress.com/2012/01/054.jpg?w=656",
  "href": "https://bakingwithsibella.com/2012/01/12/marjolaine-cake/",
  "extension": "Chrome",
  "firstAdded": "2018-12-11T13:22:18.502000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare the praline powder:",
    "1.",
    "Preheat the oven to 300 degrees. Oil a baking sheet with a light vegetable oil. Spread the almonds on another baking sheet and bake until fragrant and light brown, about 10 minutes. Remove from oven and let cool.",
    "2.",
    "Combine the nuts and sugar in a heavy-bottomed saucepan. Cook, stirring constantly, over medium heat until the sugar begins to melt. The mixture will go through several stages,from a dry blend to one where the sugar forms little bubbles the size of peas. Continue cooking, stirring constantly so all of the sugar clinging to the almonds melts, until the mixture turns dark brown and syrupy and the nuts make a popping sound. The whole process will take about five minutes.",
    "3.",
    "Quickly pour the mixture onto the oiled baking sheet. The mixture will harden to give almond brittle. When the praline is cool, break it into pieces. Grind it to a fine powder in a food processor. (Praline can be made weeks in advance and refrigerated or frozen in an air-tight container.)",
    "4.",
    "Prepare the chocolate cream: Bring the cream to a boil in a medium saucepan. Remove from the heat and whisk in the chocolate, piece by piece, until it is completely melted and blended. Set aside until cool and thick. It should have the consistency of a thick, spreadable, frosting. (This can be made as much as three days in advance and refrigerated. If it hardens, reheat it gently, beating until it reaches the proper consistency.)",
    "Prepare the pastry cream:",
    "5.",
    "Using a whisk or electric mixer, beat the egg yolks and sugar in a mixing bowl until thick and lemon-colored. Gently whisk in the flour. Heat the milk to a boil in a large heavy-bottomed saucepan. Whisk one-third of the hot milk into the egg mixture, then pour the egg mixture into the remaining milk. Boil, stirring constantly, over medium-high heat until thickened, about two minutes. Transfer to a bowl and let cool.",
    "6.",
    "Beat the butter until soft and creamy. When the pastry cream is completely cool, whisk in the softened butter. (The pastry cream can be made three days in advance and kept refrigerated.)",
    "Prepare the cake:",
    "7.",
    "Preheat the oven to 300 degrees. Heavily butter two jelly-roll pans, measuring about 14x10x1 in. Line them with parchment paper and butter and flour the paper.",
    "8.",
    "Spread the hazelnuts on a baking sheet and roast until fragrant and lightly browned, about 10 minutes. Remove from the oven and rub the warm nuts in a cotton dish towel to remove as much skin as possible. Cool, then grind them with a quarter cup of the sugar in a food processor.",
    "9.",
    "Using a whisk or electric mixer, beat the egg whites until they begin to stiffen. Slowly add the remaining sugar, mixing until stiff but not dry. Fold in the flour and hazelnut mixture. Spread the batter evenly in the prepared pans. Bake until the cakes are thoroughly browned, 25 to 30 minutes.",
    "10.",
    "Remove the cakes from the oven and invert them onto racks to cool, paper side up. Cover the cakes with a damp towel for several minutes, then remove the parchment paper while the cakes are still warm. Let cool completely. Cut each cake lengthwise in half.",
    "11.",
    "At least 24 hours, but not more than three days, before serving, assemble the Marjolaine: Divide the pastry cream in half. Blend the vanilla extract and the rum into one portion of the pastry cream. Blend the praline powder into the remaining pastry cream. (Mix the praline cream just before assembling the cake, because the flavor will fade if mixed up in advance.) The chocolate and pastry creams should be chilled, but spreadable.",
    "12.",
    "Place one cake layer on a large, rectangular serving platter. Spread half the chocolate cream on the cake. Refrigerate until firm, about 10 minutes. Cover the chocolate cream with a second cake layer. Spread with all of the rum cream and refrigerate until firm, about 15 minutes. Top the rum cream with the third cake layer. Spread with all of the praline cream and refrigerate until firm, about 15 minutes. Top the praline cream with the fourth cake layer. Frost the top and sides of the cake with the remaining chocolate cream. Refrigerate uncovered for 15 minutes, then cover with plastic wrap. Refrigerate one to three days before serving.",
    "13.",
    "To serve, remove from the refrigerator 15 minutes before cutting, then cut into thin slices.",
    "**Original recipe found here (I slightly changed the quantity of some ingredients).",
    "Bon Appetite!"
  ],
  "ingredients": [
    "0",
    "The praline powder:",
    "1 cup (100 g) whole almonds",
    "1 cup (128 g) confectioners’ sugar",
    "The chocolate cream (chocolate ganache):",
    "2 cups (500 ml) creme fraiche (I have used heavy whipping cream)",
    "16 (450 g) ounces bittersweet chocolate, preferably Lindt or other European brand, broken into pieces",
    "The pastry cream:",
    "8 large egg yolks",
    "1 cup (200 g) granulated sugar",
    "1/2 cup (64 g) unbleached flour",
    "2 cups (500 ml) milk",
    "1 1/4 cups (283 g) unsalted butter",
    "The cake:",
    "1 cup (138 g) hazelnuts",
    "3/4 cup (150 g) granulated sugar",
    "10 large egg whites",
    "1/4 cup (32 g) unbleached flour",
    "The rum cream:",
    "2 cups pastry cream (1/2 of the whole quantity)",
    "1 tablespoon pure vanilla extract",
    "1 tablespoon rum",
    "The praline cream:",
    "2 cups pastry cream (1/2 of the whole quantity)",
    "2 cups praline powder (I didn’t weigh in grams, but use all of what you get after grinding the sugar coated almonds)",
    "*Optional: 1 cup (138 g) toasted, chopped hazelnuts for decorating the sides of the cake"
  ],
  "__v": 1
}