{
  "hash": "244b4856557cdb7ede0dd5481816ee8305e74ec3",
  "title": "CHICKEN TORTILLA SOUP II",
  "image": "https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_584,h_329/v1/img/recipes/46/27/UrThalDbThGzvrI0b590_CTS 4 - final_2.jpg",
  "href": "https://www.food.com/recipe/chicken-tortilla-soup-ii-4627?photo=cGhvdG8tMzkzMzg4",
  "extension": "Chrome",
  "firstAdded": "2020-01-02T02:45:27.897000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INGREDIENTS"
  ],
  "ingredients": [
    "0",
    "UNITS: US",
    "INGREDIENTS",
    "Nutrition",
    "8",
    "ounces carrots, diced",
    "8",
    "ounces celery",
    "8",
    "ounces onions, diced",
    "1⁄2",
    "teaspoon garlic powder or 1 garlic clove, diced",
    "1⁄8",
    "teaspoon salt",
    "1⁄4",
    "teaspoon pepper",
    "1",
    "tablespoon corn oil",
    "4",
    "(15 ounce) cans chicken broth",
    "1",
    "(15 ounce) can tomatoes, diced (optional)",
    "1",
    "(10 ounce) can Rotel tomatoes & chilies, diced",
    "1",
    "(1 1/4-1 1/2 ounce) packet taco seasoning (I use McCormicks)",
    "10",
    "(8 inch) corn, tortillas (NOT FLOUR, cut into small pieces, about 1-in x1-in)",
    "12",
    "ounces chicken meat, poached, diced",
    "1",
    "cup milk or 1 cup sour cream",
    "12",
    "ounces monterey jack cheese or 12 ounces Mexican blend cheese, shredded",
    "corn tortilla chips, broken into small pieces for garnish",
    "DIRECTIONS",
    "Saute carrots, onions, celery in corn oil, garlic, salt and pepper until tender.",
    "Add chicken broth and bring to boil.",
    "Add tomatoes, Rotel, taco seasoning, and chicken.",
    "Cut Tortillas into small pieces and add to broth mixture.",
    "Let boil for 45 minutes or until tortillas are thoroughly incorporated into soup stirring occasionally to keep from sticking.",
    "Reduce heat and add 8 oz. cheese. Simmer for additional 10 minutes.",
    "Add milk and simmer for additional 10 minutes.",
    "If thicker soup is desired, add more diced tortillas and let incorporate into soup.",
    "Garnish with shredded cheese and broken tortilla chips.",
    "Substitutions: 1 cup Masa Harina (Masa Flour) for 1 10 ct. package of corn tortillas.",
    "Mix masa with 1 cup cold water, then add masa flour mix into soup. If thicker soup is desired, add more masa/water mix.",
    "If you don't want to use the seasoning packet, substitute 1/2 teaspoons cumin + 1 tsp, chili powder.",
    "You can also use grilled chicken fajita meat for poached diced chicken.",
    "NOTE: If you use FLOUR tortillas, as some people have, you WILL end up with a \"TORTILLA MESS\", this recipe is for CORN tortillas. Don't go blaming me and giving me a bad review because you used the wrong stuff.",
    "PRINT RECIPE",
    "Submit a Recipe Correction"
  ],
  "__v": 1
}