{
  "hash": "752880f07a0352ea37209edb5ce16882161c5769",
  "title": "Texas Hill Country Market Style Brisket",
  "image": "https://3n4qbf4aqlgosc02y1h7vs61-wpengine.netdna-ssl.com/wp-content/uploads/2011/10/texas_hill_country_brisket-1-300x199.jpg",
  "href": "https://saramoulton.com/2016/05/texas-hill-country-market-style-brisket-2/",
  "extension": "Chrome",
  "firstAdded": "2018-01-14T06:30:41.456000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Grilling method: indirect/medium-low heat",
    "Directions",
    "Make the rub. In a medium bowl, combine salt, pepper, and cayenne pepper; mix well. Store the rub in an airtight container or shaker top jar.",
    "Build a charcoal fire or preheat a gas grill",
    "Pat the brisket dry with paper towels. Do not trim any excess fat off the meat: This fat will naturally baste the meat and keep it moist during the long cooking time.",
    "Using your hands or a shaker top jar, sprinkle the liberally with the rub.",
    "Let it sit for about 5 minutes and pat the spices into the meat but do not rub. This mixture will forma a dark savory crust on the meat often referred to as the sought after “burnt ends.” Set aside on a clean tray until ready to cook.",
    "If using a gas grill – place a drip pan with 12 oz. beer in the upper left corner of the gas grill directly on top of the flavorizer bars or ceramic rock.",
    "Place the soaked wood chips in a smoker box.",
    "Place the brisket in the center of the cooking grate, fat side up over indirect medium low heat. Cover and cook slowly for 4 – 5 hours at 325 F – 350 F. Or until an instant read thermometer inserted in the middle of the brisket registers 190 F – 200 F. The meat should be very tender and falling apart. It will feel like the consistency of butter when inserted with the probe of the thermometer.",
    "Remember not to turn the meat during the entire cooking time.",
    "Let the meat rest for 20 minutes or until cool enough to handle. The recipe can be made in advance up to this point and once it is cool, wrapped in 3 layers of heavy-duty aluminum foil. To reheat the brisket, leave it in foil and heat for about 1 hour at 250 F. For a crispier crust, remove the foil at the end and put it back into the oven for another 15 minutes.",
    "Slice against the grain of the meat and serve with Texas Vinegar-Chile Hot Sauce if desired.",
    "Serve with assorted accoutrements including pickled okra, avocado slices, jalapenos, white onion, longhorn cheddar cheese, and saltine crackers or sliced white bread."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Lockhart Dry Rub",
    "1/2 cup Morton kosher salt",
    "3 tablespoons coarse ground black pepper",
    "2 teaspoons cayenne pepper",
    "1 whole beef brisket, untrimmed (9 – 12 pounds)",
    "1/2 cup Lockhart dry rub (Recipe below)",
    "1 bottle beer (such as Lone Star or Heineken)",
    "oak or mesquite wood chips, soaked in water for 30 minutes",
    "Texas Vinegar Chile Hot Sauce (recipe below)"
  ],
  "__v": 1
}