{
  "hash": "1e97bd5380f8524bb2923938a4e8cfba182ebd1d",
  "title": "Recipe: Mongolian Beef",
  "image": "",
  "href": "http://www.skinnymom.com/recipe-mongolian-beef/",
  "extension": "Chrome",
  "firstAdded": "2016-09-07T15:43:12.386000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To prepare the flank steak, slice the meat on an angle in thin strips against the grain (the grain runs along the long side of the steak).",
    "In a large resealable bag, combine the steak slices and cornstarch and shake until evenly coated; set aside.",
    "In a medium sauce pan, whisk together the soy sauce, rice wine vinegar, brown sugar, and chili sauce until evenly combined. Heat the sauce pan over medium heat until slightly thickened, about 5-7 minutes; set aside.",
    "In a large skillet heat the sesame oil over medium-high heat. Add the garlic, ginger, red chili flakes, and green onions. Cook stirring constantly for about 30 seconds, or until fragrant. Shake off the excess cornstarch from the reserved steak, and add it all to the skillet. Cook for 2-3 minutes, browning all sides. Add the set-aside sauce and cook for an additional 1-2 minutes.",
    "If using frozen broccoli, cook according to package directions. If using fresh broccoli, bring a medium saucepan of water to a boil. Boil the broccoli for 1-2 minutes, or until tender, then drain.",
    "Microwave rice according to package directions. Serve with brown rice, broccoli, and garnish with additional green onions if desired."
  ],
  "ingredients": [
    "0",
    "1½ pounds flank steak",
    "¼ cup cornstarch",
    "¼ cup less-sodium soy sauce",
    "2 tablespoons rice wine vinegar",
    "2 tablespoons brown sugar",
    "2 tablespoons sweet chili sauce",
    "6 green onions, thinly sliced",
    "2 tablespoons sesame oil",
    "1 tablespoon minced garlic",
    "1 teaspoon fresh grated ginger",
    "⅛ teaspoon red pepper flakes",
    "2 cups broccoli florets, cooked (about 1 small head)",
    "2 (8.8-ounce) pouches Ready Rice Brown Rice"
  ],
  "__v": 1
}