{
  "hash": "9428b1f5f9874c6f98e7c41db8cda45d54bb342b",
  "title": "Wellington Sausage Rolls",
  "image": "https://flockler.com/thumbs/sites/192/sausage-rolls_s0x500_q80_noupscale.png",
  "href": "http://thehappyfoodie.co.uk/recipes/wellington-sausage-rolls",
  "extension": "Chrome",
  "firstAdded": "2016-09-05T14:13:02.843000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 200°C/fan 180°C.",
    "Put the butter and the mushrooms in a small frying pan over a medium heat, and cook the mushrooms until they are soft and any moisture has evaporated. Put them in a bowl and leave to cool completely.",
    "Once the mushrooms have cooled, add the Worcestershire sauce, Tabasco, sausagemeat, salt and pepper. Give everything a good mix by hand, and set aside.",
    "Dust your surface with flour and roll the puff pastry out into a long wide rectangle approximately 25 x 35cm. Then cut down the middle lengthways to give you three long rectangles.",
    "Brush the pastry rectangles with a generous layer of wholegrain mustard, making sure to leave a gap of 1cm along the long edges. Brush the exposed edges with the beaten egg.",
    "Down the centre of the pastry rectangles, lay out a generous line of sausagemeat. Encase the filling with the pastry, making a seam joined with egg wash, underneath the roll.",
    "Brush the three rolls in egg wash, and give them a light sprinkling of sea salt flakes. Cut each long roll into 8–10 pieces.",
    "Place the small rolls on a baking sheet and bake for 15–20 minutes, until golden on the outside, making sure the meat on the inside is cooked through."
  ],
  "ingredients": [
    "0",
    "30gunsalted butter",
    "100gmushrooms, finely chopped",
    "1 tbspWorcestershire sauce",
    "1 tbspTabasco or less if you prefer, depending on your tolerance for heat",
    "6large beef sausages, taken out of the skins",
    "freshly ground black pepper",
    "450gpuff pastry (shopbought, or you can make your own)",
    "4 tbspwholegrain mustard",
    "1medium egg, beaten",
    "sea salt flakes, to sprinkle"
  ],
  "__v": 1
}