{
  "__v": 1,
  "directions": [
    "0",
    "Into large microwavable bowl, measure cereal; set aside. Line cookie sheet with waxed paper or foil.",
    "In 2-cup microwavable measuring cup, microwave brown sugar, butter and corn syrup uncovered on High 1 to 2 minutes, stirring after 1 minute, until melted and smooth. Stir in baking soda until dissolved. Pour caramel mixture over cereal, stirring until evenly coated. Microwave on High 3 minutes, stirring every minute. Spread on cookie sheet. Cool 10 minutes. Break into bite-sized pieces.",
    "Make sure Chex mixture is cool to the touch (so candy doesn't melt.) Evenly sprinkle mini peanut butter cups candy and miniature marshmallows over Chex mixture.",
    "In small microwavable bowl, microwave caramel baking bits and cream uncovered on High about 1 minute or until chips can be stirred smooth. Use a spoon or fork to drizzle over snack. Microwave the milk chocolate baking chips next, starting with 20-seconds and stirring, then at 20 second intervals until the mixture is completely smooth (microwave temps vary, so watch the chocolate and stir frequently until it's of drizzling consistency). Drizzle over the snack mixture. Then microwave the vanilla (white) baking chips in 20-second intervals, stirring until smooth, and drizzle that over the snack mixture. (Note: The vanilla and milk chocolate chips should not need cream added.) Quickly sprinkle coarse salt over all while candy drizzles are still wet.",
    "Refrigerate until set. Break apart and store in tightly covered container. Perfect for gift giving!",
    "DESSERT IDEA: Create parfait desserts by layering Chex mix and lightly sweetened whipped cream!"
  ],
  "firstAdded": "2014-09-17T20:28:43.769000",
  "hash": "7bb3e333b52bf0dc40a9fdae6d5ccfa2d3838cb3",
  "href": "http://www.tablespoon.com/recipes/better-than-sex-chex-mix/52d6e6f1-fc52-4a15-8150-1cb7a3f2fe55",
  "image": "http://www.tablespoon.com/-/media/Images/Articles/qd/2012/01/2012-02-04-better-than-sex-chex-mix-586x322c.jpg",
  "ingredients": [
    "0",
    "8 cups Chocolate Chex® cereal",
    "3/4 cup cup packed brown sugar",
    "6 tablespoons butter or margarine",
    "3 tablespoons light corn syrup",
    "1/4 teaspoon baking soda",
    "1 cup Reese's Peanut Butter Cups, MINI size",
    "1 cup MINIATURE marshmallows",
    "1/2 cup caramel bits (found by the chocolate chips in the baking aisle -- or chop up regular caramels)",
    "1 tablespoon heavy cream",
    "1/2 cup MILK chocolate baking chips (or more if you're a huge chocolate fan)",
    "1/2 cup vanilla (white) chocolate baking chips",
    "1 teaspoon coarse sea salt"
  ],
  "keywords": [
    "chocolate",
    "chex",
    "cereal",
    "brown",
    "sugar",
    "butter",
    "margarine",
    "light",
    "corn",
    "syrup",
    "baking",
    "soda",
    "reeses",
    "peanut",
    "mini",
    "size",
    "miniature",
    "marshmallows",
    "caramel",
    "bits",
    "chips",
    "aisle",
    "regular",
    "caramels",
    "cream",
    "milk",
    "youre",
    "huge",
    "fan",
    "vanilla",
    "white",
    "coarse",
    "salt"
  ],
  "title": "Better than Sex Chex Mix",
  "users": [
    null
  ]
}