{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 350F. Line an 8-by-8-inch baking pan with aluminum foil, spray with cooking spray; set aside.",
    "In a large, microwave-safe bowl melt the butter, about 1 minute on high power.",
    "Wait momentarily before adding the egg so you don't scramble it. Add the egg, pumpkin, brown sugar, vanilla, pumpkin pie spice, cinnamon, and whisk until smooth.",
    "Add the flour and stir until just combined, don't overmix.",
    "Stir in 1 1/4 cups chocolate chips.",
    "Turn batter out into prepared pan, smoothing the top lightly with a spatula.",
    "Evenly sprinkle with 2 tablespoons chocolate chips, smoothly the top lightly with a spatula.",
    "Bake for about 32 to 33 minutes, or until done. A toothpick inserted in the center should come out clean, or with a few moist crumbs, but no batter. The moisture content in pumpkin varies, as do climates and ovens; bake until yours are done. Allow bars to cool in pan for at least 30 minutes before slicing and serving. I find the bars taste better on the second and third day after the flavors have married. Bars continue to get softer and moister for about 3 days after baking. Bars will keep airtight at room temperature for up to 1 week, or in the freezer for up to 6 months."
  ],
  "firstAdded": "2014-10-04T06:31:15.177000",
  "hash": "4dd7757fb234f3e6410ae60ea65aba68c785c965",
  "href": "http://www.averiecooks.com/2014/09/soft-pumpkin-chocolate-chip-bars.html",
  "image": "http://www.averiecooks.com/wp-content/uploads/2014/09/pumpkinchocchipbarstext.jpg",
  "ingredients": [
    "0",
    "1/2 cup unsalted butter (1 stick), melted",
    "1 large egg",
    "3/4 cup pumpkin puree (not pumpkin pie filling)",
    "1 cup light brown sugar, packed",
    "1 tablespoon vanilla extract",
    "2 teaspoons pumpkin pie spice",
    "1 teaspoon cinnamon",
    "1 1/4 cups all-purpose flour",
    "1 1/4 cups semi-sweet chocolate chips + 2 tablespoons, for sprinkling"
  ],
  "keywords": [
    "unsalted",
    "butter",
    "egg",
    "puree",
    "pumpkin",
    "pie",
    "filling",
    "light",
    "brown",
    "sugar",
    "vanilla",
    "spice",
    "cinnamon",
    "allpurpose",
    "flour",
    "semisweet",
    "chocolate",
    "chips",
    "sprinkling"
  ],
  "title": "Soft Pumpkin Chocolate Chip Bars",
  "users": [
    null
  ]
}