{
  "hash": "07e0454524e35f73fe3731cc4559b0fec485f4b4",
  "title": "Baked Sweet Potato Fries",
  "image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-03/18/17/enhanced/webdr05/enhanced-7518-1458337723-12.jpg",
  "href": "http://www.buzzfeed.com/jodyduits/this-is-the-real-way-you-should-be-eating-french-fries",
  "extension": "Chrome",
  "firstAdded": "2016-03-24T15:55:47.093000",
  "users": [
    null
  ],
  "keywords": [
    "potatoes",
    "water",
    "soaking",
    "corn",
    "starch",
    "olive",
    "oil",
    "pepper",
    "paprika",
    "garlic",
    "brown",
    "sugar",
    "salt",
    "parmesan",
    "parsley"
  ],
  "directions": [
    "0",
    "Rinse and peel sweet potatoes. To cut into fries, cut a small sliver off the edge of the potatoes lengthwise to create a flat side for them to rest on. Turn the potato over to lay on its flat side. Then cut lengthwise into four to five long slices (or 1/4-3/8 inch slices). Cut each slice lengthwise into three to four fries (1/4-3/8 inch).",
    "Place the fries in a bowl of water and soak for one hour. (This helps remove excess starch from the potatoes so your fries will be crispier.)",
    "Preheat the oven to 425°F / 220°C.",
    "Rinse and dry off. In a large bowl or gallon bag, toss the fries with cornstarch until they’re evenly coated. Then add the oil and toss to coat. Add the pepper, paprika, garlic powder, and brown sugar and toss to evenly distribute your spices. (Hold off on adding the salt until after baking. This will help make sure the fries are crispy.)",
    "Line a baking sheet with parchment paper or aluminum foil and spray with nonstick cooking spray. Lay out the french fries, being sure not to overcrowd the pan. (You may need two pans, depending on how large your pans are. Avoid overcrowding one pan or your fries may not crisp up.)",
    "Bake for 15 minutes. Flip fries with tongs, then bake for an additional 10–15 minutes.",
    "Sprinkle on salt (to taste) and serve! Add shredded Parmesan and chopped parsley for an optional garnish. Enjoy with your favorite dipping sauce!"
  ],
  "ingredients": [
    "0",
    "2 large sweet potatoes",
    "Water (for soaking)",
    "2 Tbsp. corn starch",
    "1 Tbsp. olive oil (or vegetable oil)",
    "1/2 tsp pepper",
    "1/2 tsp paprika",
    "1/2 tsp garlic powder",
    "1/2 tsp brown sugar",
    "Salt (to taste)",
    "Shredded Parmesan (optional)",
    "Chopped fresh parsley (optional)"
  ],
  "__v": 1
}