{
  "hash": "5f0ce35bb9dc37d38a267f20e03e6a87dffb7d5a",
  "title": "Crispy Gluten-Free Eggplant Parmesan",
  "image": "https://minimalistbaker.com/wp-content/uploads/2017/10/Eggplant-Parmesan-SQUARE.jpg",
  "href": "https://minimalistbaker.com/crispy-gluten-free-eggplant-parmesan/",
  "extension": "",
  "firstAdded": "2017-12-15T23:57:20.277000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400 degrees F (204 C) and line a baking sheet with parchment paper. Also, prepare your dipping stations by mixing together almond milk and cornstarch in one bowl; gluten-free flour, cornstarch, and sea salt in another bowl; and gluten-free panko bread crumbs, cornmeal, vegan parmesan cheese, oregano, and sea salt in another bowl (see photo).",
    "If serving with pasta and sauces, prepare at this time (optional). Once pasta is done cooking, drain and cover with a towel to keep warm. Set aside.",
    "Next, dip eggplant slices in flour mixture, then almond milk mixture, and then breadcrumb mixture and arrange dipped rounds on a clean plate.",
    "Heat a large skillet over medium heat. Once hot, add 2 Tbsp (30 ml) oil. Let the oil heat for 1 minute. Then add 4-5 eggplant rounds at a time and brown for ~2-3 minutes on each side or until light golden brown. Then add to the prepared baking sheet, and add baking sheet to the oven so the eggplant can start baking.",
    "Continue browning eggplant in batches until all rounds are browned and in the oven, adding more oil to the cooking pan as needed and turn down heat if eggplant rounds are browning too quickly.",
    "Bake eggplant for 10-15 minutes or until crispy and golden brown, flipping once around the halfway mark to ensure even baking. Then serve as is or with desired sides and sauces.",
    "I love serving my eggplant parmesan with marinara sauce for dipping and gluten-free pasta tossed in my Cashew Alfredo! (For more side and sauce options, check the options in the post above.)",
    "Best when fresh. But you can store completely cooled leftover eggplant covered in the refrigerator up to 2 days. Reheat on a baking sheet in a 350-degree F (176 C) oven until hot."
  ],
  "ingredients": [
    "0",
    "1/2 cup (120 ml) unsweetened plain almond milk (or other neutral dairy-free milk)",
    "1 tsp cornstarch (or arrowroot starch)",
    "1",
    "1/2 cup (80 g) gluten-free flour",
    "2 Tbsp (14 g) cornstarch (or arrowroot starch)",
    "Healthy pinch sea salt",
    "2",
    "1/3 cup (35 g) gluten-free panko bread crumbs* (I like this brand)",
    "1/4 cup (40 g) cornmeal",
    "1/4 cup (20 g) vegan parmesan cheese",
    "1 tsp dried oregano (or 2 tsp fresh)",
    "1/4 tsp sea salt",
    "3",
    "1 long, narrow eggplant (~550 g) sliced into 1/8th inch rounds (skin on)",
    "4 Tbsp (60 ml) neutral cooking oil (I like avocado or coconut), divided",
    "4",
    "1 cup Easy Marinara Sauce (or your favorite store bought sauce)",
    "8-10 ounces (283 g) cooked pasta (such as linguini, penne, or spiralized vegetables)",
    "1 batch 30-minute Cashew Alfredo Sauce"
  ],
  "__v": 1
}