{
  "__v": 1,
  "directions": [
    "0",
    "Instructions",
    "1",
    "Mix the first 5 ingredients in a large bowl, making a well in the centre. Stir 360ml (12fl oz) tepid water and the walnut oil into the well. Gradually add up to 100ml (31/2fl oz) more water until the flour is incorporated and the dough is soft.",
    "2",
    "Turn out the dough on to a lightly floured surface and knead for 5–8 minutes, or until smooth and elastic. Shape into a ball.",
    "3",
    "Rub the inside of a dry bowl with oil. Put the dough in the bowl, cover with cling film, and leave in a warm place until doubled in size. Meanwhile, lightly dust a large baking tray with flour.",
    "4",
    "Punch down the dough, turn it out onto a floured surface, and knead for 1 minute. Pat the dough into a rectangle and sprinkle with the walnuts. Knead for a few more minutes, or until the nuts are evenly distributed.",
    "5",
    "Cut the dough in half and form each into a ball. Transfer to the baking tray and flatten. Cover with a tea towel and leave to rise for 15 minutes. Preheat the oven to 220°C (425°F/Gas 7).",
    "6",
    "Lightly dust the dough with flour, then cut a 5mm (1/4in) deep square, in the top of each. Bake for 10 minutes, reduce the temperature to 190°C (375°F/Gas 5), and bake for a further 25–35 minutes, or until the bases sound hollow when tapped. Transfer to a wire rack and leave to cool."
  ],
  "firstAdded": "2014-08-19T11:24:36.466000",
  "hash": "4bbad7a5a3f94a03e6872d2fc154e08133b32951",
  "href": "http://www.ocado.com/webshop/recipe/walnut-bread/1764",
  "image": "http://www.ocado.com/cmscontent/recipe_image_med/43041.jpg?TsA",
  "ingredients": [
    "0",
    "Ingredients",
    "350g strong wholemeal flour ,",
    "200g strong white flour, plus extra for dusting",
    "7g easy-blend dried yeast,",
    "1½ tsp salt",
    "1 tsp sugar",
    "1 tbsp walnut oil, plus extra for brushing",
    "150g walnuts, coarsely chopped"
  ],
  "keywords": [
    "strong",
    "wholemeal",
    "flour",
    "white",
    "extra",
    "dusting",
    "easyblend",
    "yeast",
    "salt",
    "sugar",
    "walnut",
    "oil",
    "brushing",
    "walnuts",
    "coarsely"
  ],
  "title": "Walnut Bread",
  "users": [
    null
  ]
}