{
  "hash": "4524bfc528e5ebebe9b70e12e17684a58b4db588",
  "title": "chili cheese beef n mac",
  "image": "https://lh5.googleusercontent.com/-DWfItFyDXXg/T7LTM32UgbI/AAAAAAAAG5U/xHoNNnOGhn4/s640/Chili+Cheese+Beef+n+Mac+close.jpg",
  "href": "http://www.budgetbytes.com/2012/05/chili-cheese-beef-n-mac/",
  "extension": "Chrome",
  "firstAdded": "2015-08-10T22:03:41.729000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "beef",
    "garlic",
    "onion",
    "allpurpose",
    "flour",
    "chili",
    "smoked",
    "paprika",
    "oregano",
    "tomato",
    "broth",
    "dry",
    "macaroni",
    "sharp",
    "cheddar"
  ],
  "directions": [
    "0",
    "Brown the ground beef in a large pot over medium along with 1 Tbsp of olive oil. Once browned, drain off the excess fat. While the beef is browning, dice the onion and mince the garlic.",
    "Add the diced onion and minced garlic to the browned and drained beef. Continue to cook and stir over medium heat until the onions are soft and translucent. Once the onions have softened, add 2 Tbsp of flour and cook for one minute more while constantly stirring. It’s okay if it coats the bottom of the pot, just make sure the heat is not so high that the flour burns.",
    "Add the chili powder, smoked paprika, oregano, tomato sauce, and 2 cups of beef broth (or beef base/bouillon cubes and water). Stir to dissolve any bits that are stuck to the bottom of the pot.",
    "Add the dry pasta, place a lid on top, and allow it to come up to a simmer. Once it reaches a simmer, reduce the heat to low, and let simmer for about 15 minutes or until the pasta is soft and has absorbed all of the liquid. Stir every few minutes to make sure it’s not sticking on the bottom of the pot. If it gets dry before the pasta has fully softened, add a touch of water.",
    "Once the pasta has finished cooking, turn the heat off and stir in the shredded cheese. Serve hot."
  ],
  "ingredients": [
    "0",
    "1 Tbsp olive oil $0.19",
    "1 lb. ground beef $4.13",
    "2 cloves garlic $0.10",
    "1 small onion $0.55",
    "2 Tbsp all-purpose flour $0.02",
    "1 Tbsp chili powder $0.15",
    "½ tsp smoked paprika $0.05",
    "½ tsp dried oregano $0.02",
    "1 (8 oz.) can tomato sauce $0.48",
    "2 cups beef broth** $0.22",
    "2 cups (1/2 lb.) dry macaroni $0.65",
    "1 cup (4 oz.) shredded sharp cheddar $1.25"
  ],
  "__v": 1
}