{
  "hash": "3a547cf90b3fbcf32f89354e3e24704eb6a0804c",
  "title": "Vetkoek",
  "image": "https://africanbites.com/wp-content/uploads/2015/02/IMG_35051.jpg",
  "href": "https://www.africanbites.com/vetkoek/",
  "extension": "Chrome",
  "firstAdded": "2018-08-07T16:52:04.351000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Minced curry instructions",
    "In a medium-large skillet, add oil, onions, garlic, ginger, curry, paprika and sauté, for about 2-3 minutes, stirring constantly to prevent any burns. Followed by tomatoes continue cooking for about 3 minutes then add potatoes and minced meat, cayenne pepper, white pepper, mix until ingredients have been thoroughly combined. Cook for about 15 minutes or more until potatoes are tender.",
    "Finally throw in peas, cook for another minute or two, add parsley, and adjust the seasoning, to taste. Remove from the heat and let it cool. You may prepare this a day in advance.",
    "Vetkoek Instructions",
    "In a large bowl, mix salt, sugar, water, and yeast. Set aside for 5 minutes. Add flour then mix dough until everything has come together.",
    "Covers loosely with a clean clothe and let rise in a warm, draft-free place for 1 to 2 hours or until doubled.",
    "Turn dough on a floured surface, flatten to knock out air bubbles and knead to make firm, you may add flour as needed",
    "• Roll out dough in to 1 inch thick, cut into desired shapes or use 3 inch or larger cookie cutter to cut dough.",
    "• In a large, sauce pan pour vegetable oil, until it is at least 3 inches (or about 5 centimeters) high (too little will result in flatter vetkoeks and place on medium heat until oil is 350 degrees.",
    "Fry until golden brown about 3-5 minutes depending on size. Remove with a slotted spoon and drain on paper napkin. Let it cool",
    "Split in half and fill with mince meat. Serve warm"
  ],
  "ingredients": [
    "0",
    "Vetkoek Recipe",
    "5 ½ cups cake flour plus more",
    "2 teaspoons of Salt",
    "2-3 tablespoons sugar",
    "1 packet yeast 2 1/4 teaspoon or .25 ounce",
    "2 cups lukewarm water",
    "Minced curry recipe",
    "1 pound minced meat",
    "2 tablespoons canola oil",
    "1 whole onion sliced",
    "1- teaspoon ground ginger",
    "11/2 teaspoon minced garlic",
    "2- teaspoon curry powder",
    "2 -3 to matoes chopped",
    "½ teaspoon paprika",
    "2 cups diced potatoes",
    "1- cup peas and carrots",
    "½ teaspoon white pepper",
    "½ teaspoon hot sauce or cayenne pepper optional",
    "2-3 tablespoons parsley or cilantro",
    "Salt to taste"
  ],
  "__v": 1
}