{
  "hash": "089443da40bcbaa256b74e458ec6410340f26c09",
  "title": "white pizza grilled cheese",
  "image": "http://www.howsweeteats.com/wp-content/uploads/2014/04/white-pizza-grilled-cheese-I-howsweeteats.com-5-250x250.jpg",
  "href": "http://www.howsweeteats.com/2014/04/white-pizza-grilled-cheese/",
  "extension": "Chrome",
  "firstAdded": "2016-10-29T23:07:08.768000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350 degrees F. Slice off the top of the bulb of garlic and remove any of the outside paper from the bulb. Drizzle the exposed cloves with olive oil. Wrap the bulb in foil and roast for 1 hour, until the cloves are golden and caramely. Let the garlic cool slightly.",
    "Squeeze the cloves out in a bowl and add a pinch of salt. Mash the cloves with a fork until they form a paste. Add the mascarpone to the bowl and stir to combine. Add in the basil, rosemary, thyme, oregano and parsley, stirring to combine.",
    "Toss together the provolone, mozzarella and parmesan cheeses. Heat a large skillet or griddle over medium heat. Spread the outsides of the bread with softened butter. Spread the insides of the bread with the mascarpone cheese mixture. Place a slice of bread butter-side down in the skillet and add a few handfuls of cheese on top. Follow it with another slide of bread, butter-side up. Cook until the cheese is melty and each side is golden, about 4 to 5 minutes per side. Serve the sandwiches with a garnish of extra chopped herbs."
  ],
  "ingredients": [
    "0",
    "2 bulbs garlic",
    "1 teaspoon olive oil",
    "1 pinch of salt",
    "8 ounces mascarpone cheese, at room temperature",
    "¼ cup freshly chopped basil leaves",
    "2 tablespoons freshly chopped rosemary",
    "2 tablespoons freshly chopped thyme leaves",
    "2 tablespoons freshly chopped oregano leaves",
    "1 tablespoon freshly chopped parsley",
    "8 ounces sharp provolone cheese, freshly grated",
    "4 ounces mozzarella cheese, freshly grated",
    "2 ounces parmesan cheese, freshly grated",
    "8 thick slices Italian or sourdough bread"
  ],
  "__v": 1
}