{
  "hash": "244a51c7a2b7dcbd316d0ce60be67d69a6bf6ffe",
  "title": "Penne With Shrimp, Red Onion, And Goat Cheese",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/penne-with-shrimp-red-onion-and-goat-cheese",
  "extension": "Chrome",
  "firstAdded": "2017-08-06T01:25:10.022000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cook penne in a large pot of boiling salted water, stirring occasionally, until al dente.",
    "Meanwhile, heat 1 Tbsp. oil in a large heavy skillet over medium-high heat. Season shrimp with salt and pepper. Cook shrimp until just opaque in the center, 1–2 minutes per side. Using a slotted spoon, transfer shrimp to a medium bowl. Add remaining 2 Tbsp. oil and onion to same skillet. Season with salt and pepper and sauté until onion begins to brown and wilt, 5–7 minutes. Add tomatoes; cook, mashing some of tomatoes with the back of a spoon to release juices, until tomatoes are just beginning to soften, about 3 minutes. Stir in 4 Tbsp. parsley, 2 Tbsp. oregano, and shrimp with any accumulated juices.",
    "Drain pasta, reserving 1/2 cup pasta cooking liquid; transfer pasta back to pot. Add shrimp mixture to pasta and toss to evenly incorporate; cook, stirring and adding pasta cooking liquid by tablespoonfuls if pasta is too dry, until pasta is tender and mixture is heated through, 1–2 minutes. Season to taste with salt and pepper.",
    "Transfer pasta mixture to a large wide bowl. Add cheese; toss gently 2 or 3 times. Sprinkle remaining 3 Tbsp. parsley and 1 Tbsp. oregano over."
  ],
  "ingredients": [
    "0",
    "1 pound whole grain penne",
    "Kosher salt",
    "3 tablespoons extra-virgin olive oil, divided",
    "1 1/4 pounds medium uncooked shrimp, peeled, deveined",
    "Freshly ground black pepper",
    "1 large red onion (about 1 pound), halved, thinly sliced crosswise",
    "3 cups cherry tomatoes (about 1 1/2 pints)",
    "7 tablespoons chopped flat-leaf parsley, divided",
    "3 tablespoons chopped fresh oregano, divided",
    "1 5-ounce log fresh goat cheese, crumbled"
  ],
  "__v": 1
}