{
  "hash": "a1cb9e2cc8b6c7c0ad98533cef350dd67e85aaad",
  "title": "Asparagus Ricotta Tarts with Honey Lemon Sauce",
  "image": "http://i2.wp.com/somethewiser.danoah.com/wp-content/uploads/2015/03/Asparagus-Ricotta-Tart-with-Honey-Lemon-Sauce-2.jpg?w=205",
  "href": "http://somethewiser.danoah.com/2015/03/asparagus-ricotta-tarts-with-honey-lemon-sauce.html",
  "extension": "Chrome",
  "firstAdded": "2016-04-05T21:26:31.381000",
  "users": [
    null
  ],
  "keywords": [
    "sheet",
    "frozen",
    "puff",
    "pastry",
    "thawed",
    "according",
    "instructions",
    "washed",
    "trimmed",
    "tender",
    "asparagus",
    "works",
    "best",
    "ricotta",
    "cheese",
    "parmesan",
    "garlic",
    "clove",
    "olive",
    "oil",
    "black",
    "pepper",
    "water",
    "corn",
    "starch",
    "honey",
    "butter",
    "squeezed",
    "lemon",
    "juice",
    "salt"
  ],
  "directions": [
    "0",
    "Preheat oven to 425 degrees Fahrenheit. Line a baking sheet with parchment paper.",
    "In a small bowl, combine the ricotta and Parmesan and stir well.",
    "Cut pastry into six 4.25 inch squares and place on prepared baking sheet. Prick each square with a fork. Spoon the ricotta-Parmesan mixture onto each square and spread it, leaving a ½ inch border. Arrange the asparagus over the top of the cheese, trimming each stalk to fit and alternating top to bottom. Repeat for each tart. Drizzle the olive oil evenly over the top of the tarts and sprinkle with freshly ground pepper.",
    "Bake for 20 to 25 minutes, rotating the pan halfway through, or until the pastry is puffed and golden and the asparagus is tender. Serve warm, just out of the oven. Drizzle with honey lemon sauce just before serving.",
    "1",
    "In a small sauce pan, dissolve the corn starch in the water. Add in the remaining ingredients and heat over medium heat until mixture begins to simmer and thicken. Stir constantly for about 1 minute and then remove from heat."
  ],
  "ingredients": [
    "0",
    "1 sheet frozen puff pastry (14 oz) thawed according to package instructions",
    "1 pound of asparagus, washed and trimmed (thin, tender asparagus works best)",
    "¾ cup ricotta cheese",
    "¼ cup grated Parmesan cheese",
    "1 garlic clove, minced",
    "1 tablespoon olive oil",
    "freshly ground black pepper",
    "1",
    "¼ cup water",
    "½ tablespoon corn starch",
    "¼ cup honey",
    "2 tablespoons butter",
    "2 tablespoons freshly squeezed lemon juice",
    "dash of salt"
  ],
  "__v": 1
}