{
  "hash": "ac51dfec1539e9d0b340c9c3198be790a1e428d2",
  "title": "(not) butter chicken",
  "image": "http://lh5.ggpht.com/_OaYG005JPDs/TSz15aVv64I/AAAAAAAAChM/tdlwjjWpWBk/s640/Not%20Butter%20Chicken%20above.jpg",
  "href": "http://www.budgetbytes.com/2011/01/not-butter-chicken/",
  "extension": "Chrome",
  "firstAdded": "2016-02-12T15:08:19.176000",
  "users": [
    null
  ],
  "keywords": [
    "lbs",
    "chicken",
    "breasts",
    "butter",
    "garlic",
    "med",
    "onion",
    "ginger",
    "garam",
    "masala",
    "cayenne",
    "pepper",
    "tomato",
    "tomatoes",
    "plain",
    "yogurt",
    "jasmine",
    "basmati",
    "rice",
    "water"
  ],
  "directions": [
    "0",
    "Trim the fat from the chicken breasts and cut them into small chunks. Set chicken aside. Dice the onion and mince the garlic and ginger.",
    "In a large pot, melt the butter over medium/high heat. When the butter is nice and hot (careful not to burn it) add the chicken chunks and brown them on all sides. Remove the chicken from the pot and set aside. It’s okay if it isn’t cooked through because it will simmer in the sauce later.",
    "Reduce the heat to medium and add the onions, garlic and ginger. Saute the mix for 2-3 minutes or until they begin to soften. Add the garam masala and cayenne pepper. Continue to cook and stir for 2 minutes more.",
    "Add the tomato sauce and diced tomatoes. Stir until everything is evenly combined. Add the chicken back in, place a lid on top and reduce the heat to medium-low. Allow the mixture to simmer for one hour or until the chicken is tender and cooked through.",
    "While the pot is simmering, begin to cook the rice. Combine 1.5 cups of rice and 2.25 cups of water in a medium pot. Place a lid on top and heat over a high flame until boiling. Once it comes to a full boil, immediately reduce the heat to low and let simmer for 20 minutes. After 20 minutes, turn the heat off and keep the lid in place until ready to serve.",
    "After the chicken and tomato mixture has simmered, break the chicken into smaller pieces if desired (the chicken should be soft and easily broken apart). Stir in the plain yogurt. Serve the chicken mixture over a bed of rice. Garnish with cilantro if desired."
  ],
  "ingredients": [
    "0",
    "1.25 lbs. (2 lg) chicken breasts $2.48",
    "3 Tbsp butter $0.22",
    "3 cloves garlic $0.21",
    "1 med onion $0.38",
    "1 inch fresh ginger $0.14",
    "1 Tbsp garam masala $0.20",
    "¼ tsp cayenne pepper $0.05",
    "1 (15 oz) can tomato sauce $0.75",
    "1 (15 oz) can diced tomatoes $0.88",
    "½ cup plain yogurt $0.25",
    "1½ cups jasmine or basmati rice $0.66",
    "2¼ cups water $0.00"
  ],
  "__v": 1
}