{
  "hash": "d0781852fbc6fdefeaf43360c16a233f45895004",
  "title": "Gordon Ramsay’s Crispy Salmon",
  "image": "",
  "href": "http://gordonramsaysrecipes.com/09/gordon-ramsays-crispy-salmon/",
  "firstAdded": "2014-12-24T03:24:19.670000",
  "users": [
    null
  ],
  "keywords": [
    "salmon",
    "filet",
    "olive",
    "oil",
    "salt",
    "herbs",
    "want",
    "gordon",
    "recommends",
    "thyme",
    "rosemary",
    "basil",
    "directions"
  ],
  "directions": [
    "0",
    "ordon Ramsay’s Crispy Salmon",
    "Try this delicious looking salmon any time you are up for a quick and easy to prepare seafood meal. Gordon Ramsay serves this salmon over a New Potato Crab Salad mix. Gordon says you don’t need to be afraid of cooking fish, as it’s not rocket science. Score the fish, keep your hands off of it while cooking (NO TOUCHING!), and turn it once. Watch the fish while you’re cooking it, use a Fish Slide",
    ", and you should end up with a masterfully prepared salmon.",
    "This recipe is very simple, as you can see by watching the video at the end of this post. I’ll cover the steps it takes to prepare a perfect crispy salmon.",
    "Prep time: Less than 2 minutes. Cook time: 4 1/2 to 5 minutes",
    "Ingredients:",
    "Salmon Filet",
    "Olive Oil",
    "Salt",
    "Herbs if you want them (Gordon recommends Thyme, Rosemary, or Basil)",
    "Directions:",
    "Take your filet of salmon, and roll it up, skin side facing out. Place the rolled up salmon filet on a cutting board, and score the skin crosswise about one half inch deep. Keep your cuts close together to get extra crispy salmon skin, and score the entire length of the salmon filet. Scoring the salmon filet prevents it from curling while cooking, ensuring it’s cooked nice and evenly.",
    "Open each score and sprinkle salt into the cut (ouchie!). Gordon suggests you can also add Thyme, Rosemary, or Fresh Basil at this point of the preparation. Glaze the top of the salmon filet with olive oil.",
    "Heat a heavy skillet over med heat, and add olive oil when the pan is hot. Add the salmon, skin side down, as soon as the oil begins to lightly smoke. Keep your fingers on top of the salmon filet for a bit to keep it nice and flat. Season the top of it with salt, and DON’T touch it anymore! Watch the salmon, and turn it, when it has colored 2/3rds of the way up the filet. Once you have flipped the salmon, tilt the pan, allowing all of the remaining olive oil coat the bottom of the salmon for a nice evenly cooked salmon filet. Cook for another minute or so, watching the color. Remove the pan from heat, flip the salmon back to the skin side, and let it rest a minute.",
    "Now you have a wonderful, masterfully prepared filet of salmon. Serve it with Gordon Ramsay’s New Potato Crab Salad for a tasty meal.",
    "Gordon Ramsay starts preparing the fish at 2:06 of the video."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "Salmon Filet",
    "Olive Oil",
    "Salt",
    "Herbs if you want them (Gordon recommends Thyme, Rosemary, or Basil)",
    "Directions:"
  ],
  "__v": 1
}