{
  "hash": "b9f7930318f81f29a16ea5131cc835ae094d2470",
  "title": "Keto Tortillas",
  "image": "https://i1.wp.com/www.thedietchefs.com/wp-content/uploads/2019/08/Keto-Tortillas.png?resize=600%2C900&ssl=1",
  "href": "https://www.thedietchefs.com/keto-tortillas-recipe/",
  "extension": "Firefox",
  "firstAdded": "2019-10-31T12:29:55.498000",
  "users": [
    null
  ],
  "ratings": [
    {
      "user": "57949bcc8284677d2d0003d6",
      "rating": 5
    }
  ],
  "keywords": [],
  "directions": [
    "0",
    "Add all of your ingredients to your food processor, and process until a ball of dough forms.",
    "Now remove the dough from the processor and cover it with plastic wrap.",
    "Knead it for just a minute or two with your hands, and then let it rest for about 15 minutes.",
    "The kneading and resting process will just help activate the xanthan gum, and give the tortillas they’re fantastic bendability.",
    "Once the dough is done resting, you can unwrap it, and split it up into 4 equal-sized smaller balls of dough.",
    "Then, when you form the smaller balls of dough, you’ll want to start forming your tortilla shells.",
    "So, lay a sheet of parchment paper on your work surface area, add one of the balls, and then cover it with another sheet of paper.",
    "The tortilla dough can be quite sticky and using the paper is a big help in dealing with that, so don’t skip out on it.",
    "Now, flatten the ball of dough with your hands, and once it’s flat use a rolling pin to finish rolling the dough out.",
    "Ideally, the dough should be about as thick as a penny, and at least 6 inches wide by 6 inches long.",
    "I recommend using a small bowl that’s about 6 inches in diameter to test and see if you’ve rolled the dough out enough.",
    "When you’ve got more dough than the bowl, remove the top layer of parchment paper and place the bowl back on the dough.",
    "Now use a knife to trace around the edges of the bowl.",
    "Once you’ve done that, remove and save the extra dough.",
    "You’ll be able to make a 5th keto tortilla out of it later on.",
    "Now we’re all set to cook the tortillas!",
    "These tortillas cook INCREDIBLY quickly,"
  ],
  "ingredients": [
    "0",
    "1 Cup (112g) Blanched Almond Flour",
    "1 Tbsp (8g) Xanthan Gum",
    "1/2 Tsp (2g) Baking Powder",
    "Nice Pinch Of Salt",
    "1 Large Egg",
    "1 Tbsp (15g) Water"
  ],
  "__v": 2,
  "rating": 5
}