{
  "hash": "e18e8206da730435097224871cc9ca673a087c4a",
  "title": "Herb-and-Nut-Encrusted Cheese Log (Vegan and Gluten-Free)",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2013/12/Herb-and-Nut-Encrusted-Cheese-Log-Vegan-and-Gluten-Free.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/herb-and-nut-encrusted-cheese-log-vegan-and-gluten-free/",
  "extension": "",
  "firstAdded": "2015-04-01T06:43:52.893000",
  "users": [
    null
  ],
  "keywords": [
    "extrafirm",
    "silken",
    "tofu",
    "crumbled",
    "tbs",
    "agar",
    "tahini",
    "water",
    "nutritional",
    "yeast",
    "organic",
    "sugar",
    "salt",
    "light",
    "miso",
    "bottled",
    "lemon",
    "juice",
    "clove",
    "garlic",
    "plain",
    "boiling",
    "reconstitute",
    "oilpacked",
    "sundried",
    "tomatoes",
    "hot",
    "rinse",
    "oil",
    "pat",
    "dry",
    "green",
    "onion",
    "ends",
    "chives",
    "hazelnuts",
    "pecans",
    "walnuts",
    "pine",
    "nuts",
    "almonds",
    "herbs",
    "parsley"
  ],
  "directions": [
    "0",
    "Blend the crumbled tofu, agar, water, tahini, nutritional yeast, sugar and salt in a food processor until very smooth. Place the mixture in a small, heavy-bottomed saucepan and stir over medium heat until it bubbles for a few minutes and becomes thick.",
    "Microwave Option: Instead of the above, place the processed mixture in a microwave-safe bowl and microwave on 100 percent power for 2 minutes. Whisk briefly. Cook for 1 and 1/2 minutes more. Scrape the cooked mixture back into the food processor.",
    "Add the miso, lemon juice and crushed garlic to the cooked mixture. (Add these last because the lemon juice the acid may with the gelling of the agar if cooked with it.) Blend briefly, then add the sundried tomatoes and green onions. Pulse briefly.",
    "Have ready a 1 and 1/2-cup-capacity storage container, preferably one 2 or 3 times longer than it is wide, lined with plastic wrap which extends over all sides. You could also use a 5 x 2 1/2” small loaf pan (called a fruitcake pan), or even a sturdy little box that’s the right shape. If the container is too long or too wide, you can stuff some rolled-up aluminum foil into the appropriate space(s). The goal is to have it firm up in as close the the dimensions of a small “log” as possible.",
    "Scrape the hot mixture into the prepared container. Refrigerate for about 15 to 30 minutes, or until it starts to firm up. Meanwhile, mix your coating ingredients in a clean food processor or mini-chopper and spread them on a piece of plastic wrap on your work surface.",
    "Working quickly and using the plastic wrap to help, unmold the cheese onto another piece of plastic wrap, roll it up in the wrap and press and shape in a “log”. Unwrap the log and gently roll the log in the coating mixture, coating all over (press the coating on with your fingers if some spots are missed), then roll up again in the plastic wrap, twist-tie the ends and place back in your container. Your “log” can be a roll, or you can square up the sides as in my photo.",
    "Refrigerate several hours until firm. Unwrap carefully from the plastic wrap onto a serving plate. Slice and serve with whole grain crackers, crusty bread, pumpernickel slices, etc."
  ],
  "ingredients": [
    "0",
    "9 oz extra-firm SILKEN tofu, crumbled",
    "1/2 Tbs. agar powder",
    "2 tablespoons tahini",
    "2 tablespoons water",
    "3/4 tablespoon nutritional yeast flakes",
    "1/2 teaspoon organic sugar",
    "1/4 teaspoon salt",
    "2 tablespoons light miso",
    "4 teaspoons fresh (or organic bottled) lemon juice",
    "1 large clove garlic, crushed",
    "3 large sundried tomatoes, chopped (either soak plain sundried tomatoes in boiling water to reconstitute, or rinse oil-packed sundried tomatoes under hot water to rinse off the oil and pat dry)",
    "2 tablespoons chopped green onion ends or chives",
    "1",
    "4 tablespoons chopped toasted nuts of choice (hazelnuts, pecans, walnuts, pine nuts, almonds, etc.)",
    "3 tablespoons chopped fresh herbs",
    "2",
    "1/4 cup minced parsley"
  ],
  "__v": 1
}