{
  "hash": "e3679e2f21bb5089618c93440faa29282eb2ca74",
  "title": "Baked Eggs With Kale, Bacon and Cornbread Crumbs",
  "image": "https://static01.nyt.com/images/2019/05/06/dining/hueck-baked-eggs-with-greens-and-cornbread-crumbs/merlin_154348128_887f1604-e01b-4845-b9db-f259542d1c96-articleLarge.jpg",
  "href": "https://cooking.nytimes.com/recipes/1020221-baked-eggs-with-kale-bacon-and-cornbread-crumbs?em_pos=medium&ref=headline&nl_art=2&te=1&nl=cooking&emc=edit_ck_20200221&campaign_id=58&instance_id=16142&segment_id=21492&user_id=4264688f24592aeeb06433e5d96d7150&regi_id=79859114emc=edit_ck_20200221",
  "extension": "Firefox",
  "firstAdded": "2020-02-25T00:50:29.124000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the oven to 350 degrees. Place the cornbread crumbs on a sheet pan and toss gently with the olive oil. Season lightly with salt, and bake in the prepared oven for 10 to 15 minutes, until toasted. Set aside to cool.",
    "Strip the kale leaves from the stems and roughly chop the leaves, discarding the stems. Place the leaves in a colander and rinse thoroughly (no need to dry).",
    "Heat a large 12-inch cast-iron or ovenproof stainless-steel skillet over medium. Add the bacon, if using, and cook, tossing occasionally, for 5 to 8 minutes, until browned. Using a slotted spoon, transfer the bacon to a plate lined with a paper towel and set aside. Drain all but 2 tablespoons of fat from the pan, add the onions and cook for 4 to 6 minutes, tossing occasionally, until lightly browned and tender. Add the garlic and cook for 30 seconds, being careful not to let the garlic scorch.",
    "Add a large handful of kale to the pan, along with 1 1/2 teaspoons salt and 1/2 teaspoon pepper. As the kale wilts, begin tossing it with tongs and adding more handfuls until all the kale is added. Add the water and vinegar, and continue to cook for 3 to 4 minutes, tossing often, until the kale is tender. Return the bacon to the pan and toss.",
    "Use a spoon to create 6 small hollows in the cooked greens. Carefully crack an egg into each, sprinkle each one with salt and pepper and bake for 8 to 10 minutes, until the egg whites are just set. Sprinkle a handful of cornbread crumbs over the greens and eggs, and serve with additional cornbread crumbs on the side."
  ],
  "ingredients": [
    "0",
    "1",
    "cup large cornbread crumbs (about 4 ounces) from about 1 large corn muffin",
    "1",
    "teaspoon olive oil",
    "1",
    "teaspoon kosher salt, or to taste",
    "1",
    "pound Tuscan or lacinato kale (about 2 bunches)",
    "6",
    "bacon slices (about 6 ounces), cut crosswise into 1/2-inch-thick pieces (optional)",
    "1",
    "medium yellow onion, cut in half through the stem and thinly sliced",
    "2",
    "teaspoons minced garlic (about 2 cloves)",
    "½",
    "teaspoon black pepper, plus more to taste",
    "½",
    "cup water or chicken stock",
    "2",
    "teaspoons white-wine or apple cider vinegar",
    "6",
    "large eggs"
  ],
  "__v": 1
}