{
  "hash": "8753c0566655657b9624d3ca44edcbfd2208f527",
  "title": "Moist Soaked Teff & Millet Bread - Gluten Free & Vegan1",
  "image": "http://www.tessadomesticdiva.com/wp-content/uploads/2013/05/soakedteffmillet-2534-1024x682.jpg",
  "href": "http://www.tessadomesticdiva.com/2013/05/moist-soaked-teff-millet-bread-gluten-free-vegan.html",
  "extension": "",
  "firstAdded": "2015-11-08T15:45:56.507000",
  "users": [
    null
  ],
  "keywords": [
    "water",
    "raw",
    "apple",
    "cider",
    "vinegar",
    "kombucha",
    "teff",
    "millet",
    "brown",
    "rice",
    "used",
    "basmati",
    "short",
    "light",
    "olive",
    "oil",
    "fat",
    "tapioca",
    "flour",
    "starch",
    "honey",
    "need",
    "use",
    "yeast",
    "play",
    "bread",
    "chia",
    "flax",
    "meal",
    "salt",
    "guar",
    "gum",
    "xanthum",
    "gelatin",
    "psyllium",
    "husks",
    "instead"
  ],
  "directions": [
    "0",
    "Either before going to bed, or first thing in the morning, place the water and vinegar into a high powered blender jar (i.e BlendTec or Vita-Mix). If using the flours, start them soaking in a bowl.",
    "Stir in the teff, millet, and brown rice, set aside for at least 8 hours. The longer you let it sit, the more fermented it will taste, fyi.",
    "Pour in the oil, and whir, on high speed for one full cycle (about a minute) until all the grains are pulverized and the mixture looks like a batter. Teff is super tiny, so there will be some specs of it left.",
    "Meanwhile, proof your yeast by whisking your yeast into the warm water. Set aside for a few minutes to get a slightly poofy, creamy froth. If it doesn't do this, your yeast is old or the water was too hot and you likely killed it....start over.",
    "Add the remaining ingredients to the blender jar and whir briefly until mixed.",
    "Add in the proofed yeast, whir to blend (not too long..you do not want the batter to heat up too warm and kill the yeast).",
    "Decide whether you would like to use a loaf pan or English muffin rings (my preference) and grease them up. I can make about 11-12 English muffins with this batter.",
    "Pour the thick, sticky batter into the rings (you should need the help of a spatula to move it), about ⅔ of the way up. If doing a loaf pan, use a sturdy pan, I linked to the one I use above.",
    "Let the dough rise in a warm place. I like to use my oven that has been briefly heated and then turned off. My English muffins rarely take longer than 15 minutes to rise to just under the rims of the rings, and my loaf takes at least 30-45 minutes. We are not going for double in size here, about half that!",
    "Without removing the pan, turn the oven on the 375 degrees.",
    "Bake for 20 minutes until golden brown and the internal temperature is at least 205-210 degrees. If using a loaf, this takes me about 50-55 minutes to reach that temperature.",
    "Remove from the oven and let it fully cool for the best texture.",
    "Store in an airtight place, in the freezer if you like!"
  ],
  "ingredients": [
    "0",
    "2 cups water",
    "2 tablespoons raw apple cider vinegar, or kombucha",
    "1 cup +2 tablespoons whole grain teff",
    "½ cup + 1 tablespoon whole grain millet",
    "½ cup + 1 tablespoons brown rice (I have used basmati & short grain)",
    "¼ cup light olive oil or other melted fat",
    "¼ cup tapioca flour (or other starch)",
    "3 tablespoons honey (you need to use at least a tablespoon for the yeast, but you can play with the amount if you like 'sweet brown bread')",
    "3 tablespoons chia meal or ¼ cup flax meal",
    "¾ teaspoon sea salt",
    "½ teaspoon guar gum or xanthum (you can use 1 tablespoon gelatin or 2 tablespoons psyllium husks instead if you like)",
    "¼ cup warm water",
    "2¼ teaspoons yeast (or 1 packet)"
  ],
  "__v": 1
}