{
  "hash": "c4588db805615ab878e00ef184523608b1227141",
  "title": "Pumpkin Bread With Brown Butter and Bourbon",
  "image": "",
  "href": "https://cooking.nytimes.com/recipes/1017797-pumpkin-bread-with-brown-butter-and-bourbon",
  "extension": "Chrome",
  "firstAdded": "2017-10-16T16:23:25.586000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat oven to 350 degrees and arrange a rack in the center. Grease the insides of two 8-inch loaf pans with butter or line with parchment paper.",
    "In a large skillet, melt 1/2 cup (1 stick) butter over medium-high heat. Reduce heat to medium and cook until the frothy white milk solids sink to the bottom of the pan and turn a fragrant, nutty brown, 5 to 7 minutes. Brown butter can burn quickly, so watch it carefully. (A tip: You will know your brown butter is almost ready when the frantic sound of bubbling begins to die down, so use your ears as well as your eyes and nose.)",
    "In a glass liquid measuring cup, combine bourbon and vanilla. Add water until you reach the 2/3 cup mark. In a large bowl, whisk together bourbon mixture, pumpkin purée, eggs and oil. With a spatula, scrape all the brown butter from the skillet into the pumpkin mixture and stir to combine.",
    "In another large bowl, whisk together all-purpose flour, whole wheat flour, brown sugar, baking soda, salt, cinnamon, ginger and cardamom. Pour liquid ingredients into dry ingredients and stir to combine.",
    "Divide batter between the two greased loaf pans. Place them on a rimmed baking sheet and transfer to oven. Bake for 50 to 60 minutes or until a tester or toothpick inserted into the center of the loaf comes out clean. Allow bread to cool completely before removing from pan."
  ],
  "ingredients": [
    "0",
    "½ cup (1 stick) unsalted butter",
    "¼ cup bourbon (or use water or apple cider)",
    "1 tablespoon vanilla",
    "1 ¾ cups pumpkin purée, homemade or canned (1 15-ounce can)",
    "4 eggs",
    "½ cup olive or other oil (such as canola)",
    "2 cups all-purpose flour",
    "1 cup whole wheat flour",
    "1 ¾ cups light brown sugar",
    "1 ½ teaspoons baking soda",
    "1 teaspoon fine sea salt",
    "1 teaspoon ground cinnamon",
    "½ teaspoon ground ginger",
    "½ teaspoon ground cardamom"
  ],
  "__v": 1
}