{
  "hash": "15de65afc3c9d28c918d077366787c840908ccaf",
  "title": "Homemade Slider Buns",
  "image": "https://fthmb.tqn.com/eBE6ArBJ11fwkNLkm_gUL_ITlKU=/960x0/filters:no_upscale()/slider-buns-with-sesame-seeds-23-56a8c48f3df78cf772a0718a.jpg",
  "href": "https://www.thespruce.com/homemade-slider-buns-3062253",
  "extension": "Chrome",
  "firstAdded": "2017-09-22T19:17:19.179000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine the yeast and warm water in a large bowl or the bowl of a stand mixer. Let the mixture stand for about 10 minutes, until foamy.",
    "Whisk the milk, the large egg, and melted butter together to blend. Add the milk mixture to the yeast mixture along with the sugar, salt, and flour.",
    "Knead the dough by hand or machine for 8 to 10 minutes, adding a little more flour if necessary to keep the dough from sticking to hands, counter-top, or the sides of the bowl. The dough should be smooth and elastic at this point.",
    "Generously grease a large bowl with butter or oil. Gather the dough into a ball and place it into the greased bowl. Turn over a few times to coat the dough thoroughly. Cover the bowl with plastic wrap and let the dough rise for 1 to 1 1/2 hours, or until doubled in bulk.",
    "Line a large baking sheet with parchment paper or lightly grease the pan.",
    "Punch down and pat the dough into a rectangle. Cut into 18 pieces, about 1 1/2 to 1 3/4 ounces each. Shape the dough pieces into firm balls, flatten slightly with your hand, and place on the parchment paper-lined baking sheet.",
    "Cover the pan of buns with a lightweight kitchen towel and let rise in a draft-free place for about 30 minutes.",
    "Preheat the oven to 375 F.",
    "For the egg wash, combine the egg white with 1 tablespoon of water. Whisk to blend. Just before the buns are ready to go into the oven, brush with the egg wash mixture. Sprinkle with sesame seeds or poppy seeds.",
    "Bake for 15 to 18 minutes, or until golden brown."
  ],
  "ingredients": [
    "0",
    "2 1/4 teaspoons active dry yeast",
    "1/2 cup warm water (about 110 F)",
    "2/3 cup milk (room temperature)",
    "1 large egg",
    "3 tablespoons butter (melted and cooled slightly)",
    "2 tablespoons plus 1 1/2 teaspoons sugar",
    "1 1/4 teaspoons salt",
    "3 cups all-purpose flour (dip and sweep method, 15 ounces)",
    "For the Egg Wash:",
    "1 large egg white",
    "1 tablespoon water",
    "1/4 cup sesame seeds (or poppy seeds)"
  ],
  "__v": 3
}