{
  "hash": "b11afe341117f87fc0e0260becb5b1cd17d2bf10",
  "title": "Lamb Kleftiko Recipe (Greek Lamb Cooked In Parchment Paper)",
  "image": "http://www.mygreekdish.com/wp-content/uploads/2014/05/Greek-Lamb-Kleftiko-recipe-800x582.jpg",
  "href": "http://www.mygreekdish.com/recipe/lamb-kleftiko-recipe-greek-lamb-cooked-in-parchment-paper/",
  "extension": "Chrome",
  "firstAdded": "2015-12-15T14:06:33.466000",
  "users": [
    null
  ],
  "keywords": [
    "leg",
    "lamb",
    "boneless",
    "approx",
    "bone",
    "red",
    "onions",
    "bell",
    "peppers",
    "green",
    "orange",
    "garlic",
    "tbsps",
    "mustard",
    "juice",
    "lemon",
    "oregano",
    "olive",
    "oil",
    "dry",
    "white",
    "wine",
    "kefalotyri",
    "graviera",
    "yellow",
    "cheese",
    "cubes",
    "medium",
    "sized",
    "potatoes",
    "tomato",
    "salt",
    "pepper",
    "parchment",
    "paper",
    "kitchen",
    "string"
  ],
  "directions": [
    "0",
    "Directions",
    "To prepare this Greek lamb kleftiko recipe, start by washing thoroughly the lamb and cut into portions (approx. 5*6 cm). Place in a large bowl or basin and set aside.",
    "Prepare the vegetables for the lamb kleftiko. Cut the onions in half and then in four wedges. Cut the peppers in 2-3 cm chunks and slice 2 cloves of garlic. Add the vegetables in the bowl with the lamb and pour in the olive oil, white wine and lemon juice. Add the mustard, 2 whole cloves of garlic, sprinkle with oregano and season with salt and pepper. Use your hands to blend all the ingredients together. Cover the bowl with plastic wrap, chill and let marinade for at least 2 hours. It’s best to leave the meat for the lamb kleftiko marinade overnight, to soak up all the wonderful flavours.",
    "Once the meat for the lamb kleftiko is marinated, return the lamb at room temperature. In the same bowl add the cheese (cut into 2cm cubes) and blend. Preheat the oven to 180C.",
    "To prepare the potatoes for this lamb kleftiko recipe, peel the potatoes and cut in four pieces. (The lamb kleftiko will require about 2 1/2 hours baking, so it’s best to cut the potatoes in large pieces, to keep their shape.)",
    "Now it’s time to wrap the lamb kleftiko in parchment paper. Lay 4 long pieces of parchment paper to form a star. Pop the potatoes in the centre of the parchment paper and season with salt and a pinch of oregano. Pour the marinade from the lamb over the potatoes and set the lamb and vegetables on top of the potatoes. Layer with the sliced tomato and enclose the lamb kleftiko into a pouch. To enclose the lamb kleftiko hold the parchment paper from the edges, crosswise and grab with your hand in the middle, just above the stuffing and squeeze. Use the kitchen string to tie tightly the whole thing together, just above the stuffing and lift into a roasting tin.",
    "Roast the lamb kleftiko in the oven for about 1 hour 45 minutes until tender. Remove the tin from the oven and increase the temperature to 220C. Unwrap the lamb kleftiko and scrunch the parchment paper under the rim of the tin. Baste the lamb with the juices and return in the oven for a further 20 mins until browned. Remove the pieces of lamb from the pouch and wrap them in some foil to rest. Toss the potatoes and return in the oven for about 20 minutes, until nicely coloured.",
    "Return the lamb pieces in the roasting tin and serve the lamb kleftiko as it is. Enjoy!"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1-1.2 kg/ 35 oz. leg of lamb, boneless (approx. 2kg/ 70 oz. bone in)",
    "2 small red onions",
    "2 1/2 bell peppers (green, red, orange)",
    "4 cloves of garlic (2 sliced and 2 whole)",
    "2 tbsps mustard",
    "juice of half a lemon",
    "1 tbsp dried oregano",
    "1/2 a cup olive oil",
    "1/2 a cup dry white wine",
    "200g kefalotyri or Graviera or any had yellow cheese, cut into cubes (7 oz.)",
    "5 medium sized potatoes",
    "1/2 ripe tomato, sliced",
    "salt and freshly ground pepper",
    "parchment paper",
    "kitchen string"
  ],
  "__v": 1
}