{
  "hash": "62f4cb4f3bf46035ec92c4def2af371080530342",
  "title": "Creamy Butternut Squash Soup with Sherry",
  "image": "https://d2k9njawademcf.cloudfront.net/indeximages/22223/original/100411-food52-9874_2.jpg?1403261996",
  "href": "http://food52.com/recipes/14799-creamy-butternut-squash-soup-with-sherry",
  "firstAdded": "2015-01-18T21:23:33.444000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "butter",
    "leek",
    "white",
    "light",
    "green",
    "topound",
    "butternut",
    "squash",
    "cubed",
    "nutmeg",
    "black",
    "pepper",
    "salt",
    "dry",
    "sherry",
    "finish",
    "chicken",
    "stock",
    "milk",
    "cream"
  ],
  "directions": [
    "0",
    "Melt the butter in a large stockpot over medium-low heat. Add the leek and cook, stirring with a wooden spoon, until softened—this should take about 5 minutes (if leek starts to brown, add a tablespoon or so of water).",
    "Add the squash, nutmeg, pepper and 1/2 teaspoon salt and continue to cook for another 5 minutes, stirring frequently.",
    "Add the sherry and cook for a couple of minutes to reduce, then add enough chicken stock just to cover the squash (if you have added all of the stock and still need more liquid, add some water).",
    "Increase the heat to high and bring the soup to a boil. Reduce the heat and simmer, partially covered, for about 20 minutes, or until the squash is tender.",
    "Using a blender or a food processor, blend the soup with the milk in several batches, adding more liquid if necessary.",
    "Return to the pot and heat until just simmering. Taste and add more salt and pepper if necessary. Stir in another splash of sherry and the cream just before serving, adding a drizzle of cream to garnish each bowl if you like."
  ],
  "ingredients": [
    "0",
    "2 tablespoons unsalted butter",
    "1 large leek, white and light green part only, chopped (about 1 cup)",
    "1 3-to-4-pound butternut squash, peeled and cubed",
    "1/4 teaspoon freshly ground nutmeg",
    "1/2 teaspoon freshly ground black pepper",
    "Salt to taste",
    "3 tablespoons dry sherry, plus more to finish",
    "2 to 3 cups chicken stock",
    "1 cup milk",
    "2 tablespoons heavy cream, plus more for serving"
  ],
  "__v": 1
}