{
  "hash": "df4d9caa3dcc273914effe7e7b86b8be7fc34bd6",
  "title": "Baileys Tim Tam Cheesecake Balls - Conventional MethodBaileys Tim Tam Cheesecake Balls - Thermomix Method",
  "image": "http://www.bakeplaysmile.com/wp-content/uploads/2015/11/Baileys-Tim-Tam-Cheesecake-Balls-5.jpg",
  "href": "http://www.bakeplaysmile.com/baileys-tim-tam-cheesecake-balls/",
  "extension": "",
  "firstAdded": "2016-12-18T20:11:53.039000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Crush white chocolate Tim Tams until they resemble fine crumbs.",
    "Mix Tim Tam crumbs with the cream cheese and shot of Baileys Irish Cream liqueur.",
    "Place into the fridge for 20 minutes to harden.",
    "Roll into 1 inch sized balls and place on a tray lined with baking paper back into the fridge for a further 20 minutes.",
    "Place white chocolate in microwaveable bowl and microwave on 50% power for 2-3 minutes, stirring every 30 seconds, until chocolate is completely melted.",
    "Place the balls into the bowl of melted chocolate (in batches) and use two teaspoons to roll the balls around until they are completely coated.",
    "Remove balls with the teaspoons and allow any excess chocolate to drip off.",
    "Place back onto the baking paper lined tray.",
    "Place into the fridge to set for 1 hour.",
    "Drizzle with melted milk chocolate if desired.",
    "1",
    "Place white chocolate Tim Tams into the TM bowl and crush on Turbo until they resemble fine crumbs.",
    "Add the cream cheese and Baileys Irish Cream liqueur and mix on Reverse Speed 2 until well combined (scraping down the sides of the bowl occasionally).",
    "Place into the fridge for 20 minutes to harden.",
    "Roll into 1 inch sized balls and place on a tray lined with baking paper and place back into the fridge for a further 20 minutes.",
    "Place white chocolate into a clean TM bowl and melt on 50 degrees, Speed 3, 2-3 minutes, scraping the sides occasionally.",
    "Pour the melted chocolate into a bowl.",
    "Place the balls into the bowl of melted chocolate (in batches) and use two teaspoons to roll the balls around until they are completely coated.",
    "Remove balls and allow any excess chocolate to drip off.",
    "Place back onto the baking paper lined tray.",
    "Place into the fridge to set for 1 hour.",
    "Drizzle with extra melted milk chocolate if desired."
  ],
  "ingredients": [
    "0",
    "2 X 165g packets white chocolate Tim Tam biscuits (or any white chocolate coated cookie)",
    "225g cream cheese, softened",
    "60ml Baileys Irish Cream liqueur",
    "300g white chocolate, for dipping",
    "50g melted milk chocolate for drizzling (optional)",
    "1",
    "2 X 165g packets white chocolate Tim Tam biscuits (or any white chocolate coated cookies)",
    "225g cream cheese, softened",
    "60ml Baileys Irish Cream liqueur",
    "300g white chocolate, for dipping",
    "50g melted milk chocolate for drizzling (optional)"
  ],
  "__v": 1
}