{
  "hash": "82029918101c10541114ed04829ebcb116ef9405",
  "title": "Iranian Legume Soup from Ottolenghi’s Plenty More",
  "image": "http://i2.wp.com/healthishappiness.com/wp-content/uploads/2014/12/IMG_4453.jpg?resize=500%2C332",
  "href": "http://healthishappiness.com/2014/12/29/iranian-legume-soup-from-ottolenghis-plenty-more/",
  "firstAdded": "2015-02-08T09:08:07.415000",
  "users": [
    null
  ],
  "keywords": [
    "chickpeas",
    "soaked",
    "water",
    "overnight",
    "lima",
    "beans",
    "coconut",
    "oil",
    "onions",
    "turmeric",
    "yellow",
    "split",
    "peas",
    "stock",
    "red",
    "chili",
    "flat",
    "leaf",
    "parsley",
    "cilantro",
    "leaves",
    "dill",
    "white",
    "green",
    "parts",
    "baby",
    "spinach",
    "linguine",
    "wine",
    "vinegar",
    "limes",
    "salt",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "If using dried beans, drain and rinse the chickpeas and lima beans separately. Place in 2 separate pots and cover with plenty of water. Bring to a boil, reduce heat and simmer until just tender. Drain when cooked and set aside until needed. Cooking time can vary with beans so keep a close eye. In my experience lima beans take between 35-45 minutes and chickpeas 45 minutes to an hour.",
    "Place the coconut oil, onions, and garlic in a large pot over medium heat. Cook for 20 minutes, stirring occasionally, until soft and golden brown. Add the turmeric, ½ teaspoon salt, and some freshly ground black pepper. Remove ⅓ of this mixture from the pot and set aside. It will be used for serving.",
    "Add the chickpeas, lima beans, split peas and stock to the pot. Simmer for about 35 minutes until the peas are tender. Skim the froth off the top of the pot occasionally and discard.",
    "Once the peas are tender add the parsley, cilantro, dill, green onions, chili flakes, and spinach. Cook for another 15 minutes. If the soup is really thick add more stock. Add the linguine and cook for another 10 minutes until they are just cooked. Remove from heat and stir in the vinegar. Taste and add more salt and pepper if necessary.",
    "Serve in bowls garnished with a little bit of the reserved onion mixture and a generous squeeze of lime juice to taste."
  ],
  "ingredients": [
    "0",
    "⅔ cup dried chickpeas soaked in water overnight or 2 cups cooked from a can",
    "⅔ dried lima beans, soaked in water overnight or 2 cups from a can",
    "4 tablespoons coconut oil",
    "2 large onions, thinly sliced",
    "1½ teaspoons turmeric",
    "1 cup yellow split peas, soaked overnight and drained",
    "10 cups vegetable stock",
    "½ teaspoon red chili flakes",
    "1 cup chopped flat leaf parsley",
    "2 cups chopped cilantro leaves",
    "1 cup chopped dill leaves",
    "1 cup thinly sliced green onions, white and green parts",
    "5 cups baby spinach leaves",
    "100g linguine",
    "1½ tablespoon white wine vinegar",
    "limes for serving",
    "sea salt and black pepper"
  ],
  "__v": 1
}