{
  "hash": "238790406903393275c9cb81bc8482b925150492",
  "title": "chopped thai noodle salad with peanut dressing",
  "image": "https://pinchofyum.com/wp-content/uploads/Thai-Salad-2.jpg",
  "href": "https://pinchofyum.com/thai-noodle-salad",
  "extension": "Chrome",
  "firstAdded": "2019-08-10T10:07:23.990000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "PREP: Start soaking the rice noodles in a bowl of cold water. Preheat the oven to 400 degrees.",
    "DRESSING: Pulse all the dressing ingredients in a food processor EXCEPT peanut butter. Place the chicken in a plastic bag and use about 1/4 to 1/2 cup of the dressing (without peanut butter) to marinate the chicken in the fridge for about 15-30 minutes. Add the peanut butter to the dressing in the food processor; pulse, then taste and adjust. Set aside.",
    "VEGGIES: Prep all your veggies and toss together in a bowl.",
    "CHICKEN: Bake the marinated chicken for 15-20 minutes. Rest for 5-10 minutes, then cut and add to the veggies.",
    "NOODLES: Drain the noodles (they should be softened at this point). Finish cooking them in a skillet over medium high heat. Add a little oil and a little dressing and toss them around until they are soft and pliable (if you need to add a little water to soften them, that works, too).",
    "ASSEMBLY: Toss stir-fried noodles with the chicken and veggie mixture. Serve hot or cold. Top with extra peanuts and cilantro (and dressing, and lime juice, and sesame seeds, and…)"
  ],
  "ingredients": [
    "0",
    "for the dressing:",
    "1/2 cup canola oil",
    "2 large cloves garlic, peeled",
    "1/3 cup low sodium soy sauce",
    "1/4 cup white distilled vinegar",
    "2 tablespoons water",
    "2 tablespoons honey",
    "2 tablespoons sesame oil",
    "1 tablespoon lemongrass or ginger paste",
    "a couple BIG squeezes of lime juice (to taste)",
    "1/4 cup peanut butter",
    "for the salad:",
    "4 ounces brown rice noodles (affiliate link)",
    "1 lb. boneless skinless chicken breasts",
    "5–6 cups baby kale or spinach",
    "3 large carrots, cut into small, thin pieces*",
    "3 bell peppers, cut into small, thin pieces*",
    "1 cup packed cilantro leaves, chopped",
    "4 green onions, green parts only, chopped",
    "1/2 cup cashews or peanuts"
  ],
  "__v": 1
}