{
  "hash": "3fa006d420305ecc673c5c86c2a993d4915bd1e5",
  "title": "Chicken Soup with Tortellini",
  "image": "http://orsararecipes.net/wp-content/uploads/2019/11/chicken-soup-vertical.jpg",
  "href": "http://orsararecipes.net/chicken-soup-with-tortellini",
  "extension": "Chrome",
  "firstAdded": "2019-11-11T09:24:10.953000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Place the chicken in a stock pot and fill with cold water. I use a 20 quart pot. Fill to about two to three inches from the top of the pot. Add in the bay leaves and thyme. Place the pot over a medium flame and bring to a boil.",
    "In the meantime, place the onion on a small frying pan and allow to cook over a medium/high flame for about five minutes or until the surface has charred. Flip to the other side to char the tunic (outer layer) of the onion for about three minutes. Try to move it around as to char as much of the rounded outer layer as possible. Place the onion into the soup. Charring the onion adds more flavor to the broth.",
    "The pot of water should start boiling within 35 to 40 minutes. Once the water start to boil, add in the chicken bouillon, turmeric, cumin and mix together. Allow to cook for fifty minutes to an hour over a medium/low flame, stirring occasionally.",
    "After about an hour, taste the broth and add salt if needed. I add in about one tablespoon of sea salt. Add in the carrots, celery, parsley, turnip, and leek. Mix together and cook for about another twenty-five to thirty minutes to allow the broth to absorb all of the flavors of the vegetables.",
    "Enjoy with a bowl of tortellini, orzo, or whatever your favorite pasta is with soup. I remove the vegetables and chicken from the soup and set aside. Chop up the cooked vegetables and slice up some chicken pieces to add to each bowl. Strain any leftover broth and store in mason jars to use as chicken stock for other recipes. If storing in glass, let the broth cool down before storing in the fridge. If you want to freeze it for longer storage, do not store in glass! Salute and cin cin!"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 Whole chicken organic, seasoned with salt and black pepper",
    "2-3 Bay leaves",
    "3 Carrots peeled",
    "7 Celery ribs peeled",
    "1/2 Sweet onion with tunic (outer covering)",
    "1 Small turnip peeled and cut in half",
    "1 Leek cleaned",
    "1 Chicken Bouillon Cube",
    "Handful of Thyme sprigs",
    "1 Bunch of parsley",
    "1/2 tsp. Turmeric",
    "Pinch of Cumin",
    "Sea salt to taste"
  ],
  "__v": 1
}