{
  "hash": "7154a611fb2a9e134a336afb9f63fe74b6eabf4e",
  "title": "spicy cauliflower burgers",
  "image": "https://pinchofyum.com/wp-content/uploads/Cauliflower-Burgers-7.jpg",
  "href": "https://pinchofyum.com/spicy-cauliflower-burgers",
  "extension": "Chrome",
  "firstAdded": "2018-08-07T16:49:36.241000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 400 degrees. Cook the quinoa according to package directions but only using 1 cup broth of water to keep it from getting too heavy.",
    "Cut the cauliflower into florets, transfer to a baking sheet, drizzle with 1 tablespoon oil and sprinkle with spices to taste. Roast for 20-30 minutes. Let cool. Pulse through a food processor to form small pieces that stick together (see picture). We don’t want PUREE here, but we do want enough mushiness to help it all stick together.",
    "Combine the cooked, pulsed cauliflower with the quinoa, garlic salt, breadcrumbs, Pepperjack cheese, eggs, salt, and another teaspoon or two of spicy seasoning (cayenne will make it hot-spicy, so just add a few shakes of that one). Form 10 patties.",
    "In an oiled or nonstick pan over medium heat, cook the burgers until golden brown on each side, flipping very carefully to avoid breaking. Set aside on a paper towel lined plate.",
    "Toss the lime juice, cilantro, cabbage, and a quick stream of oil together. Season with salt.",
    "Arrange the burgers with: magic green sauce, the cauliflower burger, the slaw, and the chipotle mayo on top."
  ],
  "ingredients": [
    "0",
    "for the cauliflower burgers",
    "3/4 cup uncooked quinoa",
    "1 head cauliflower (about 6 cups florets)",
    "3-4 tablespoons oil, divided",
    "a few generous shakes of spicy seasoning – cumin, chili powder, cayenne, etc.",
    "1/2 teaspoon garlic salt OR just a minced garlic clove or two",
    "3/4 cup breadcrumbs or ground almonds",
    "3/4 cup shredded Pepperjack cheese",
    "3 eggs",
    "1 1/2 teaspoon salt"
  ],
  "__v": 1
}