{
  "hash": "f17f7eaf26b0037914de17229d765293c115f78a",
  "title": "Green Goddess Vegan Broccoli Soup",
  "image": "http://thegirlonbloor.com/wp-content/uploads/2016/10/Green-Goddess-Vegan-Broccoli-Soup-1-600x900.jpg",
  "href": "http://thegirlonbloor.com/green-goddess-vegan-broccoli-soup/",
  "extension": "Chrome",
  "firstAdded": "2017-09-18T20:40:51.679000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400 F. Wash and chop kale, then dry thoroughly before tossing 2 cups of it with 1-2 tsp olive oil, massaging oil into leaves and seasoning with salt before spreading onto a parchment-lined baking sheet. Set aside for now.",
    "Trim and wash broccoli, then cut into florets. Melt 2 tbsp coconut oil in a large pot on med-high heat. Saute onions, leek and garlic.",
    "Add broccoli and vegetable broth, bringing to a boil then simmering for 2 min until broccoli is tender.",
    "Remove from heat, and stir in 2 cups of chopped kale, letting cool for about 15 min before pureeing vegetables in a blender (I used my Vitamix for this one!)",
    "While waiting for the veggies to cool, you can make your kale chips! Bake them in the preheated oven for 7-8 min, checking and flipping them every couple minutes so they don't burn. When they're crispy, remove them from the oven and set aside to top your soup with.",
    "Heat remaining 2 tbsp coconut oil in the large pot on med-high heat. Whisk in flour, then gradually add your non-dairy milk, salt and pepper, stirring til thickened. Stir in vegetable puree and serve with pumpkin seeds and kale chips!"
  ],
  "ingredients": [
    "0",
    "1head broccoli",
    "4tbspcoconut oildivided",
    "1small yellow oniondiced",
    "1leekcleaned and sliced",
    "2clovesgarlicminced",
    "2cupsvegetable broth",
    "1head of kalechopped and divided",
    "3tbspflour",
    "2cupsnon dairy milkI used almond milk but coconut milk works too",
    "1/2tspsalt",
    "1/2tsppepper",
    "1/2tspred pepper flakes",
    "Pumpkin seeds for garnish"
  ],
  "__v": 1
}