{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 375 degrees F.",
    "Unroll sheet dough into one large rectangle. Spread pumpkin butter evenly over the dough. Evenly sprinkle brown sugar and cinnamon over the pumpkin butter.",
    "Starting with short side of the rectangle, roll up into a log. Using string, dental floss, or a serrated knife, cut the roll into 10 slices. Place slices, cut side down, in a greased 8 x 8 baking dish.",
    "Bake 18 to 20 minutes or until golden brown. Let cinnamon rolls cool in pan for 5 minutes.",
    "While the cinnamon rolls are cooling, make the cream cheese frosting. In a medium bowl, stir together cream cheese and butter until smooth. Whisk in the confectioner's sugar, vanilla, and milk. If the frosting is still too thick, add a little more milk and whisk until smooth.",
    "Spread frosting over cinnamon rolls and serve! I always have leftover frosting, but use as much as you like:)",
    "Note-if you can't find the Pillsbury Crescent Recipe Creations refrigerated seamless dough sheet you can use regular Pillsbury crescent rolls. Just press the dough together to form a large rectangular sheet. I use Trader Joe's pumpkin butter, but you can use any brand or make your own."
  ],
  "firstAdded": "2014-07-20T19:37:02.003000",
  "hash": "65e7455ac4f0bbf94cc021bb1b4b825669ed0465",
  "href": "http://www.twopeasandtheirpod.com/easy-mini-pumpkin-cinnamon-rolls/",
  "image": "http://www.twopeasandtheirpod.com/wp-content/uploads/2013/10/Easy-Mini-Pumpkin-Cinnamon-Rolls-15.jpg",
  "ingredients": [
    "0",
    "For the pumpkin cinnamon rolls:",
    "1 can Pillsbury Crescent Recipe Creations refrigerated seamless dough sheet",
    "1/4 cup pumpkin butter (I use Trader Joe's brand)",
    "3 tablespoons brown sugar",
    "1 teaspoon ground cinnamon",
    "For the cream cheese frosting:",
    "3 ounces cream cheese, softened",
    "1/4 cup butter, softened",
    "1 1/2 cups confectioner’s sugar",
    "1/2 teaspoon vanilla extract",
    "1 tablespoon milk (more if you like a thin frosting)"
  ],
  "keywords": [
    "pumpkin",
    "cinnamon",
    "rolls",
    "pillsbury",
    "crescent",
    "recipe",
    "creations",
    "refrigerated",
    "seamless",
    "dough",
    "sheet",
    "butter",
    "use",
    "trader",
    "joes",
    "brand",
    "brown",
    "sugar",
    "cream",
    "cheese",
    "frosting",
    "softened",
    "confectioners",
    "vanilla",
    "milk"
  ],
  "title": "Easy Mini Pumpkin Cinnamon Rolls",
  "users": [
    null
  ]
}