{
  "hash": "634741e8c38d77868fb07dd16d1b35f3bbbedd5b",
  "title": "Buffalo Chicken Cutlets with Cauliflower Rice",
  "image": "http://del.h-cdn.co/assets/15/52/980x490/landscape-1450907919-buffalo-chicken-delishl1.jpg",
  "href": "http://www.delish.com/cooking/recipe-ideas/recipes/a45386/buffalo-chicken-cutlets-with-cauliflower-rice-recipe/?zoomable",
  "extension": "Chrome",
  "firstAdded": "2016-06-22T20:24:59.710000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "Make buffalo sauce: In a small bowl, mix blue cheese, sour cream, mayonnaise, 2 tablespoons lemon juice, vinegar, and scallions. Keep in fridge until ready to serve.",
    "In a food processor, pulse cauliflower until texture resembles rice. (Do not over-process.) In a large pot over medium-high heat, heat 2 tablespoons olive oil. Add cauliflower rice and season with salt and pepper. Cook until tender, 3 to 5 minutes, then stir in 1/4 cup Parmesan.",
    "Prepare station to bread chicken cutlets with three medium bowls: one with bread crumbs and remaining 1/4 cup Parmesan, another with a mixture of hot sauce and melted butter, and the last bowl with flour. Season chicken generously with salt and pepper. Add each piece of chicken to flour to fully coat, shaking off excess, then dip into hot sauce mixture, and lastly coat in breadcrumbs. Repeat.",
    "In a large skillet, heat 1 tablespoon butter and 1 tablespoon olive oil over medium-high heat. Add two pieces chicken and fry until golden brown, 3 to 4 minutes per side. Transfer to a paper towel-lined plate and season with salt and pepper. Add remaining tablespoon butter and olive oil and add remaining chicken. Serve chicken over cauliflower rice and a squeeze of lemon topped with buffalo sauce and scallions."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1/2 c. crumbled blue cheese",
    "1/4 c. sour cream",
    "1/4 c. mayonnaise",
    "1 lemon, plus additional wedges for serving",
    "2 tbsp. white vinegar",
    "2 tbsp. chopped scallions, plus more for garnish",
    "1 head cauliflower, chopped into florets",
    "extra-virgin olive oil",
    "kosher salt",
    "Freshly ground black pepper",
    "1/2 c. grated parmesan",
    "2 c. panko bread crumbs",
    "1/4 c. Hot sauce",
    "1/4 c. butter, melted",
    "1 c. all-purpose flour",
    "4 boneless skinless chicken breasts, pounded 1/2\"-thick",
    "2 tbsp. butter"
  ],
  "__v": 1
}