{
  "hash": "9397e1d94b080562c959a068e9f9f71b7e27efb0",
  "title": "Maple Glazed Cinnamon Twists",
  "image": "https://images.food52.com/yKlXlfE1y8lQomQYcnCPdPZLoAo=/753x502/10c3890d-3db2-4c5c-91c6-54d78ba842f2--2016-0711_cinnamon-twists-baking-basics_bobbi-lin_2479.jpg",
  "href": "https://food52.com/recipes/62906-maple-glazed-cinnamon-twists",
  "extension": "Chrome",
  "firstAdded": "2018-01-02T17:08:18.888000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the filling: In a medium bowl, whisk the butter, brown sugar, sugar, flour, and cinnamon together to combine. Set aside.",
    "Make the doughnuts: Heat 3 to 4 inches of oil over medium high heat until it reads around 350°F on a thermometer (or throw a scrap piece of dough in as a tester—if the dough bubbles and rises to the surface, the oil is good to go).",
    "While the oil heats, roll out the doughnut dough on a lightly floured surface to 1/4 inch thick. Cut the dough into rectangles (I like about 2 x 4 inches).",
    "Place a heaping tablespoon of the cinnamon filling on each piece of dough, and use an offset spatula to spread into an even layer.",
    "Starting with one of the longer sides, roll the dough into a tight log. Use a bench knife or knife to cut the log in half, leaving one end attached. Then twist the two halves together, and pinch the ends to seal. If the strand gets too long when you twist it, cut it in half to make two twists!",
    "Let the doughnuts rise, covered, on a lightly floured surface for 30 minutes to 1 hour. When the oil is hot, gently add the doughnuts to the pot in batches, frying until they’re golden brown on both sides, 3 to 4 minutes. (Note: some of the filling may leech out—that’s okay! If you’re frying multiple kinds of doughnuts, fry these last, as escaped filling may color/flavor the oil.)",
    "Drain the doughnuts on several layers of absorbent paper towels. Let cool for 5 to 10 minutes while you make the glaze.",
    "In a medium bowl, whisk the powdered sugar, maple syrup, and cream to combine. You want a spoonable, thin glaze—add more cream as needed to achieve the right texture.",
    "Transfer the doughnuts to a cooling rack set on a baking sheet. Spoon the glaze over the twists, and let set for 5 to 10 minutes. Serve immediately."
  ],
  "ingredients": [
    "0",
    "1 1/2 sticks butter, melted",
    "1/2 cup dark brown sugar",
    "1/4 cup sugar",
    "2 tablespoons all-purpose flour",
    "1 1/2 tablespoons cinnamon",
    "1",
    "Oil, as needed for frying",
    "1 recipe Yeast Doughnuts (https://food52.com/recipes/28778-basic-yeast-doughnuts-with-many-variations)",
    "2 cups powdered sugar, as needed for finishing",
    "1/4 cup maple syrup (use the good stuff)",
    "2 tablespoons heavy cream, or more as needed"
  ],
  "__v": 1
}