{
  "hash": "10715786fc405a762ed08da6b8b9b523aa4a059a",
  "title": "Stuffed pancakes with spiced beef",
  "image": "http://prima.cdnds.net/assets/16/03/980x490/landscape-1453311516-stuffed-pancakes.jpg",
  "href": "http://www.prima.co.uk/all-recipes/quick-recipes/a34891/stuffed-pancakes-beef/?zoomable",
  "extension": "",
  "firstAdded": "2017-02-28T08:34:32.927000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat oil in a large frying pan, add onion and cook for 5 mins. add garlic and mince and cook through. Stir in oregano, cayenne, tomato purée and a little stock and bring to the boil. Add remaining stock, then simmer for 15-20 mins. Taste and season, and stir through parsley.",
    "For sauce, melt butter, then remove from heat and stir in flour. Add a little milk and mix to a paste. Return to heat and slowly add all milk, stirring as you go. Allow sauce to cook for a few mins, then remove from heat, stir in cheese and season. Put to one side.",
    "For pancakes, add flour to a bowl with a pinch of salt and make a well in centre. Add egg and a little milk and stir, incorporating a little flour. Slowly add remaining milk and flour and stir till batter is smooth. Heat oil in a small frying pan; when hot, pour most of it into a jug. Pour in enough batter to coat pan and cook for a few secs. When underside is golden, flip and cook the other side. Transfer to an upturned plate, layer with greaseproof paper and repeat, using the reserved oil.",
    "Spoon beef onto pancakes and roll. Sit them neatly in an ovenproof dish and spoon over cheese sauce. Bake at gas mark 5/180°C (160°C in a fan oven) for about 20 mins. Garnish with chopped fresh parsley."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 tbsp. olive oil",
    "1 onion, finely chopped",
    "2 cloves garlic, finely chopped",
    "900g/2Ib good minced beef",
    "pinch each oregano and cayenne pepper",
    "squirt of tomato purée",
    "500ml/1pt hot beef or vegetable stock",
    "handful flat-leaf parsley, finely chopped",
    "For the cheese sauce",
    "25g/2oz butter",
    "1 tbsp. flour",
    "300ml/½ pt milk",
    "125g/4oz strong cheddar cheese, grated",
    "For the pancakes",
    "125g/4oz plain flour",
    "1 egg",
    "300ml/½pt milk",
    "3-4 tbsp. sunflower oil"
  ],
  "__v": 1
}