{
  "hash": "feb079fff27977cad7a49c211f2805b319187513",
  "title": "Spiced Dal with Fluffy Rice and Salted Yogurt",
  "image": "",
  "href": "https://www.bonappetit.com/recipe/spiced-dal-with-fluffy-rice-and-salted-yogurt",
  "extension": "Chrome",
  "firstAdded": "2018-04-02T01:44:01.379000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat ghee in a medium pot over medium-high. Add onion and cook, stirring occasionally, until softened and lightly browned around the edges, 5–7 minutes. Add ginger and garlic and cook, stirring often, just to take the edge off garlic, about 30 seconds. Add ⅓ cup water and simmer, stirring occasionally, until water evaporates, about 1 minute. Add split peas, coriander, turmeric, cardamom, and red pepper flakes and cook, stirring, until fragrant, about 30 seconds. Add 4 cups water and bring to a boil. Reduce heat to medium-low and simmer, stirring occasionally, until split peas are very tender and most of the liquid is absorbed, 12–14 minutes; season with salt. Cover with a lid and keep dal warm over low heat while you make the toppings.",
    "Finely grate zest from lime into a small bowl. Cut lime in half and squeeze juice into bowl (you’ll have about 2 Tbsp.). Add red onion, sugar, and a large pinch of salt and toss, squeezing onion with your hands to help it soften quickly.",
    "Mix yogurt and 2 Tbsp. water in a small bowl; season with salt.",
    "Serve dal over rice drizzled with salty yogurt and topped with onion and pepper.",
    "Do Ahead: Dal (without yogurt and onion) can be made 1 day ahead. Let cool; cover and chill."
  ],
  "ingredients": [
    "0",
    "2 tablespoons ghee, virgin coconut oil, or vegetable oil",
    "1 medium yellow onion, finely chopped",
    "1 2-inch piece ginger, peeled, finely grated",
    "2 garlic cloves, finely grated",
    "1½ cups yellow split peas, rinsed",
    "2 teaspoons ground coriander",
    "1 teaspoon ground turmeric",
    "½ teaspoon ground cardamom",
    "Pinch of crushed red pepper flakes",
    "Kosher salt",
    "1 lime",
    "1 small red onion, very thinly sliced into rounds, rinsed",
    "Pinch of sugar",
    "½ cup plain whole-milk Greek yogurt",
    "Cooked Jasmine or basmati rice (for serving)",
    "Freshly ground black pepper"
  ],
  "__v": 1
}