{
  "hash": "d9ca712c8220eb16195dca68e222d6de49e1fb88",
  "title": "Ricotta Pancakes",
  "image": "http://www.joybauer.com/wp-content/uploads/2016/02/Ricotta-Pancakes-2-837x362.jpg",
  "href": "http://www.joybauer.com/healthy-recipes/fluffy-ricotta-pancakes/",
  "extension": "Chrome",
  "firstAdded": "2016-09-02T22:38:03.389000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "REPARATION:",
    "In a large bowl, combine the flour, baking powder, sugar and salt.",
    "In a medium bowl, whisk together the ricotta, eggs, milk and vanilla until evenly blended. Pour the wet ingredients over the dry ingredients, and stir until the batter is smooth and fluffy.",
    "Coat a large skillet (or griddle) generously with oil spray and preheat it over medium heat. Spoon 1/4-cup portions of the batter onto the skillet, and cook each side for 2 to 3 minutes, or until lightly golden brown. Be extra careful with flipping since these pancakes are less firm than standard pancakes.",
    "Optional: Top the pancakes with fresh or frozen, heated berries and/or a sprinkle of powdered sugar. For frozen berries, heat the berries in the microwave for a few minutes, and spoon the warm berries and sweet juices over the pancakes.",
    "Serving size: 2 pancakes (Toppings are not included in nutrition information. Add 30 calories for 1/2 cup berries and 10 calories for 1 teaspoon powdered sugar.)",
    "*May substitute egg substitute (6 tablespoons) for the eggs."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS:",
    "3/4 cup flour, white whole-wheat (may substitute a mix of half of each all-purpose flour and standard whole-wheat flour)",
    "1 tablespoon baking powder",
    "2 tablespoons granulated sugar",
    "1/4 teaspoon Kosher salt",
    "1 cup part-skim ricotta cheese",
    "1 large egg (*see note)",
    "1 large egg white (*see note)",
    "2/3 cup skim milk (or any preferred milk)",
    "3/4 teaspoon vanilla extract",
    "Berries, fresh or frozen (optional)",
    "Sugar, powdered (optional)"
  ],
  "__v": 1
}