{
  "hash": "16b027164a361140cb2c0c0554240a57d00f23cb",
  "title": "Instant Pot Carnitas",
  "image": "//food.fnr.sndimg.com/content/dam/images/food/fullset/2018/10/22/0/FNK_INSTANT-POT-CARNITAS-H-s4x3.jpg.rend.hgtvcom.826.620.suffix/1540214002523.jpeg",
  "href": "https://www.foodnetwork.com/recipes/food-network-kitchen/instant-pot-carnitas-5449432",
  "extension": "Chrome",
  "firstAdded": "2019-07-22T01:14:57.265000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Put the pork shoulder, pork belly, lager, chili powder, cumin, coriander, 1 heaping tablespoon salt and 1 teaspoon black pepper in a 6-quart Instant Pot® and follow the manufacturer's guide for locking the lid and preparing to cook. Set to pressure cook on high for 60 minutes (see Cook's Note). After the pressure cook cycle is complete, follow the manufacturer's guide for quick release and wait until the quick release cycle is complete. Be careful of any remaining steam and unlock and remove the lid. Using a slotted spoon, transfer the meat to a small bowl, cover and set aside. Set the pot to saute on high and reduce the liquid until almost completely evaporated, 10 to 15 minutes. Set the pot to off and transfer the reduced sauce to the meat, then toss to coat and serve.",
    "For crispy carnitas (optional): Transfer the reduced sauce and cooked carnitas to a large nonstick skillet over high heat and cook, undisturbed, for 5 minutes. Toss and continue to cook for about 5 minutes more to crisp other side. Transfer to a paper towel lined platter, making sure to scrape up any browned bits from the skillet, and serve.",
    "Serve the carnitas with the tortillas, pico de gallo, lime wedges, guacamole, onion, cilantro and cabbage."
  ],
  "ingredients": [
    "0",
    "3 pounds boneless pork shoulder (Boston butt), cut into 1 1/2-inch pieces",
    "1 pound pork belly, cut into 1-inch pieces",
    "1/2 cup lager, homemade chicken stock or low-sodium chicken broth",
    "Kosher salt and freshly ground black pepper",
    "1 tablespoon chili powder",
    "1 teaspoon ground cumin",
    "1/2 teaspoon ground coriander",
    "Serving suggestions: Warm corn tortillas, pico de gallo, lime wedges, guacamole, chopped onion, chopped cilantro and shredded cabba"
  ],
  "__v": 1
}