{
  "hash": "8c894accf70c1a550ad8099a19c490e13900938f",
  "title": "Israeli-Style Hummus",
  "image": "",
  "href": "https://www.bonappetit.com/recipe/israeli-style-hummus",
  "extension": "Chrome",
  "firstAdded": "2018-06-24T13:37:55.847000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "RECIPE PREPARATION",
    "Place chickpeas and 1 tsp. baking soda in a medium bowl and add cold water to cover by 2\". Cover and let sit at room temperature until chickpeas have doubled in size, 8–12 hours. Drain and rinse.",
    "Combine soaked chickpeas and remaining 1 tsp. baking soda in a large saucepan and add cold water to cover by at least 2\". Bring to a boil, skimming surface as needed. Reduce heat to medium-low, partially cover, and simmer until chickpeas are tender and completely falling apart, 45–60 minutes. Drain; set aside.",
    "Meanwhile, process garlic, lemon juice, and 1 tsp. salt in a food processor until coarsely puréed; let sit 10 minutes to allow garlic to mellow.",
    "Strain garlic mixture through a fine-mesh sieve into a small bowl, pressing on solids to release as much liquid as possible. Return liquid to food processor; discard solids. Add tahini and pulse to combine. With motor running, add ¼ cup ice water by the tablespoonful and process (it may seize up at first) until mixture is very smooth, pale, and thick. Add chickpeas and cumin and process, occasionally scraping down sides, until mixture is extremely smooth, about 4 minutes. Thin with more water if you prefer a looser consistency; taste and season with salt, more lemon juice, and more cumin as desired.",
    "Spoon hummus into a shallow bowl, making a well in the center, and drizzle liberally with oil. Top as desired.",
    "Toppings Suggestions",
    "Hot smoked Spanish paprika, fresh lemon juice, and chopped parsley",
    "Fried chickpeas, hot smoked Spanish paprika, and chopped parsley",
    "Breakfast radishes, fresh lemon juice, and chopped fennel fronds",
    "Beet-Pickled-Egg, Israeli mango pickle, fried garlic, and sliced garlic scapes",
    "Tahini, Lemony Chermoula, cooked chickpeas, and chopped parsle"
  ],
  "ingredients": [
    "0",
    "1 cup dried chickpeas",
    "2 teaspoons baking soda, divided",
    "4 garlic cloves, unpeeled",
    "⅓ cup (or more) fresh lemon juice",
    "1 teaspoon kosher salt, plus more",
    "⅔ cup tahini",
    "¼ teaspoon (or more) ground cumin",
    "Olive oil (for serving)"
  ],
  "__v": 1
}