{
  "hash": "6341a1bbf873e35b0dffd98cbdb1029bc65758f6",
  "title": "Chicken Cordon Bleu with Dijon Cream Sauce",
  "image": "",
  "href": "http://www.lecremedelacrumb.com/2015/10/chicken-cordon-bleu-dijon-cream-sauce.html",
  "extension": "Chrome",
  "firstAdded": "2016-10-30T19:04:13.151000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400 degrees and lightly grease a casserole dish. Stir together breadcrumbs and parmesan in a medium bowl, and whisk eggs and water in another bowl.",
    "Lay pounded chicken breasts out on a flat clean surface. Top each chicken breast with a slice of ham and then a slice of swiss cheese. Roll into a log starting with one of the longer sides and rolling toward the opposite side.",
    "Dip chicken bundles in the egg mixture, coating all sides, then carefully roll in breadcrumbs to coat. Place in prepared casserole dish and secure with toothpicks so the bundles don't come un-rolled.",
    "Cover dish with foil and bake for 25-35 minutes until chicken is cooked through. Uncover and cook another 5-10 minutes to brown the chicken coating.",
    "While chicken is cooking, prepare the sauce. In a medium sauce pan, melt butter over medium heat. Stir in flour until mixture clumps together. Gradually whisk in milk, working out the lumps as you stir. Add dijon mustard, garlic powder, parmesan cheese, and salt and pepper to taste.",
    "When chicken bundles are fully cooked, cut into 1-inch sections, drizzle with the sauce and serve hot."
  ],
  "ingredients": [
    "0",
    "4 boneless skinless chicken breasts pounded to ¼-1/2 inch thickness",
    "4 slices ham",
    "4 slices swiss cheese",
    "1 egg, whisked + 2 tablespoons water or milk",
    "⅓ cup Italian seasoned breadcrumbs (or regular breadcrumbs + 1½ teaspoons Italian seasoning)",
    "¼ cup shredded parmesan cheese",
    "1",
    "3 tablespoons butter",
    "3 tablespoons flour",
    "2 cups milk",
    "3 tablespoons dijon mustard",
    "1 teaspoon garlic powder",
    "⅓ cup shredded parmesan cheese",
    "salt and pepper to taste"
  ],
  "__v": 1
}