{
  "hash": "a98e3784f732e52130ad2dcf02a373cae3dc32e6",
  "title": "Vegan Breakfast Tacos",
  "image": "https://thestingyvegan.com/wp-content/uploads/2017/01/make-ahead-vegan-breakfast-tacos-photo-1.jpg",
  "href": "https://thestingyvegan.com/vegan-breakfast-tacos/?fbclid=IwAR3NQoa6Np-C6iAAIrN9819bpPpUjM1om76QFMxAZASAnuhPfB1Bzsiw19Q",
  "extension": "Chrome",
  "firstAdded": "2018-12-20T15:42:41.290000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a bowl combine the chickpea flour with 1 cup of water, 1 teaspoon of salt, pepper and the black salt. Mix well to get out all the lumps. A quick way of doing this is to blitz it in a food processor. Set aside while you slice the vegetables and prepare the lentils.",
    "Heat a medium pan over medium high heat and add a couple tablespoons of water (or oil). Fry half of the diced onion and garlic until soft. Reduce the heat to medium and add all of the spices. Fry, stirring constantly, for a minute or until the spices are fragrant. Add the lentils, remaining 3 tablespoons of water, ½ teaspoon of salt, a bit of pepper and the vinegar. Cook until the lentils are heated through and have a bit of a sauce.",
    "Meanwhile heat a small pan on medium heat. Add the 2 tablespoons of oil and chickpea flour batter. Fry until it begins to brown on the bottom, then break it up with your spoon into a scramble-like consistency. Allow to cook until it is no longer sticky and begins to brown on all sides, stirring occasionally and adding more oil to the pan if it starts to stick.",
    "Warm or toast your tortillas and fill each with some lentil chorizo, chickpea scramble, tomato slices, remaining half of the diced red onion, avocado, salsa and fresh cilantro. Eat right away or wrap in tin foil and freeze. Reheat still wrapped in the oven or unwrap and pop them in the microwave."
  ],
  "ingredients": [
    "0",
    "1 cup (120 grams) chickpea flour* - $0.36",
    "1 cup (240 ml) plus 3 tablespoons water, divided - $0.00",
    "1 ½ teaspoon sea salt, divided** - $0.05",
    "A few turns of the pepper mill - $0.05",
    "¼ teaspoon black salt / kala namak (optional but recommended) - $0.08",
    "1 red onion, diced - $0.23",
    "2 cloves of garlic, minced - $0.16",
    "1 tablespoon smoked paprika - $0.30",
    "1 teaspoon thyme - $0.10",
    "1 teaspoon cumin - $0.05",
    "½ teaspoon cinnamon - $0.03",
    "¼ teaspoon ground cloves - $0.05",
    "1 ½ teaspoons cayenne pepper (adjust to taste) - $0.24",
    "2 cups (350 grams) cooked lentils - $0.68",
    "1 tablespoon red wine vinegar - $0.10",
    "2 tablespoons olive oil - $0.10",
    "A package of small corn or flour tortillas (mine come in a package of 8) - $2.60",
    "10 cherry tomatoes, sliced - $0.80",
    "1 avocado, sliced or mashed*** - $0.99",
    "A handful of fresh cilantro - $0.15",
    "A small jar (300 grams / 10.5 oz) of salsa - $1.35"
  ],
  "__v": 1
}