{
  "hash": "9af79e4c48f586f607535655d44aef7b8db3d361",
  "title": "Chile Relleno Chicken Rolls",
  "image": "http://img.sndimg.com/food/image/upload/w_614,h_461,c_fit/v1/img/submissions/recipe/0/y3SgTkDTLWBoq7NKiidj_Chile%20Relleno%20Chicken%20Rolls.JPG",
  "href": "http://www.food.com/recipe/chile-relleno-chicken-rolls-523230",
  "extension": "Chrome",
  "firstAdded": "2015-10-06T04:11:03.178000",
  "users": [
    null
  ],
  "keywords": [
    "boneless",
    "chicken",
    "breasts",
    "slices",
    "ham",
    "swiss",
    "cheese",
    "poblano",
    "peppers",
    "seeded",
    "skinned",
    "butter",
    "cracker",
    "crumbs",
    "ritz",
    "hollandaise",
    "prepared",
    "parsley"
  ],
  "directions": [
    "0",
    "Preheat oven to 350 degrees F.",
    "Split both chicken breasts in half lengthwise to make 4 separate, thin breasts.",
    "On a solid, flat surface, lay a piece of plastic wrap flat on working area and fold another piece of wrap to create a couple of layers of plastic wrap. (For ponding top of chicken).",
    "Lay each piece of chicken, (one at a time) on top of the bottom piece of plastic, using a meat tenderizer, mallet or rolling pin, pond the chicken flat and even on all sides, repeat until all the chicken is ponded thin.",
    "Lay each thinned piece of chicken on the counter and place one slice of ham on top of laid out chicken, then add a slice of cheese on top of ham, finally, open up the Poblano pepper and lay it flat over the slice of cheese, creating three layers on top of chicken, (ham, cheese and Poblano pepper).",
    "Starting with the smallest end, gently roll the chicken up into a tight rolled log, (pictured) set it aside until all the chicken rolls are done. (Make sure you place each of them seam side down).",
    "In a pie pan or shallow dish, melt butter in the preheated oven, and pour your cracker crumbs into another shallow dish or pie plate for easy dipping and coating, (dredging).",
    "Carefully dip each roll (one at a time) into the melted butter and then immediately coat them in the cracker crumbs, place them in a greased baking sheet and bake (uncovered) for 40 to 45 minutes, or until golden brown.",
    "While chicken rolls are baking, prepare the hollandaise sauce according to package directions.",
    "Place baked chicken rolls on a platter or individual plates, served with a little hollandaise sauce on top of each roll and garnished with a little dried parsley for color.",
    "Makes 4 rolls."
  ],
  "ingredients": [
    "0",
    "2 large thick boneless chicken breasts",
    "4 slices ham (thin)",
    "4 slices swiss cheese",
    "4 poblano peppers, seeded and skinned",
    "1⁄2 cup butter, melted",
    "2 cups cracker crumbs (Ritz)",
    "1 (1 ounce) package hollandaise sauce, prepared",
    "1 tablespoon dried parsley, for garnish"
  ],
  "__v": 1
}