{
  "__v": 1,
  "directions": [
    "0",
    "Make the filling: Trim the broccoli off of tough stems and skins, cut them into small pieces and set in a pot with 1/2 cup of water. Put the lid on and bring to a boil. Let the broccoli steam until tender but still green and slightly crunchy, just a couple of minutes. Drain the broccoli VERY WELL, and add it into a food-processor bowl with bologna, cream cheese, feta cheese, blue cheese, garlic, parmigiano cheese, nutmeg and black pepper. Pulse until the mixture is evenly and finely minced together. Taste the mixture and add more salt to taste accordingly. Chill the mixture in the fridge for at least 1 hour.",
    "Make the pie dough: In a stand-mixer bowl with a pedal-attachment (or I suppose you can do it in food-processor as well), add 1 cup of flour, unsalted butter and crumbled feta cheese. Start mixing on low-speed until the mixture is completely incorporated, meaning no small chunks of butter left (the feta may not be completely broken down but it’s fine, just make sure the butter and flour is evenly mixed together). While it’s mixing, on the side, mix the rest of the flour (1 cup) with salt, sugar, allspice and grated nutmeg. Then add the flour/spice mixture into the mixer with Greek yogurt. Mix on low-speed and depending on the dough, add 1 ~ 2 tbsp of iced water, JUST ENOUGH to bring the mixture together into a stiff dough. I used about 1 1/2 tbsp.",
    "Move the dough onto a lightly floured surface. Knead just a couple of times (don’t over-work it!) to bring it into one mass, then pat into a thick round disk (the flatter it is the easier to roll out later). Wrap with plastic wrap and leave in the freezer for at least 30 min to flash-freeze if you are in a hurry, or in the fridge until needed. Both the filling and pie dough can be made the day before.",
    "Make the pie: Preheat the oven on 400ºF/200ºC.",
    "Unwrap the dough onto a lightly floured surface. To flatten it, I use my rolling pin to “press” it down in a “grid-order” to get it to a thickness that’s easier to roll out. Once flat, roll out the dough into a rectangular sheet about 1/8″ (4mm) thick. Make sure the bottom is well floured during this step to avoid sticking. With a knife, generously trim off whatever uneven edges and cut the sheet into 3 1/2″ (9 cm) squares. Don’t worry, you can gather the scrap and roll it out again later. Add 1 tbsp of filling in the center of each squares, then brush the sides with egg wash.",
    "To close the pie, it’s easier to spread/shape the filling into an “oval shape” that stretches parallel to the direction you are folding it. Bring two diagonal-corners together and pinch the dough together into a triangle pie. Repeat with the rest. Gather the scrap-doughs together and repeat the steps to get however many pies you can out of it. Set the pies on a lightly floured plate and chill in the fridge for 1 hour, or in the freezer for 30 min.",
    "Before baking, brush the pie-surface with egg wash, then sprinkle with freshly ground black pepper and some sea salt. Bake in the oven for 30 ~ 35 min until golden browned on all sides.",
    "Dust them generously with powder sugar and serve warm with yellow mustard."
  ],
  "firstAdded": "2014-06-19T14:23:09.103000",
  "hash": "6879973e41c9bad2b40bba3eac0262cfad9cc493",
  "href": "http://www.ladyandpups.com/2013/06/06/the-infinite-kitchen-sink-hand-pie-eng/",
  "image": "http://www.ladyandpups.com/wp-content/uploads/2013/06/kitchen-sink-hand-pie13.jpg",
  "ingredients": [
    "0",
    "Pie crust:",
    "250 g (2 cups) of all-purpose flour, divide into 1 cup each",
    "200 g (14 tbsp) of very very cold unsalted butter, cut into small cubes",
    "55 g of (roughly 1/4 cup) feta cheese, crumbled",
    "65 g of (roughly 1/3 cup) Greek yogurt, or sour cream",
    "1/2 tsp of salt",
    "1/2 tsp of sugar",
    "1/2 tsp of ground allspice",
    "1/8 tsp of freshly grated nutmeg",
    "1 ~ 2 tbsp of iced water",
    "250 g (2 cups) of all-purpose flour, divide into 1 cup each",
    "200 g (14 tbsp) of very very cold unsalted butter, cut into small cubes",
    "55 g of (roughly 1/4 cup) feta cheese, crumbled",
    "65 g of (roughly 1/3 cup) Greek yogurt, or sour cream",
    "1/2 tsp of salt",
    "1/2 tsp of sugar",
    "1/2 tsp of ground allspice",
    "1/8 tsp of freshly grated nutmeg",
    "1 ~ 2 tbsp of iced water",
    "Filling:",
    "1/2 small-size broccoli",
    "50 g of bologna sausage",
    "70 g (roughly 1/2 cup) of cream cheese",
    "45 g (roughly 1/4 cup) of feta cheese",
    "8 g (roughly 2 tbsp) of blue cheese",
    "1/4 cup of grated parmigiano cheese",
    "1/2 clove of garlic",
    "Pinch of freshly grated nutmeg",
    "1/4 tsp of freshly ground black pepper",
    "Salt to taste (the amount greatly depends on the ingredients you use)",
    "1/2 small-size broccoli",
    "50 g of bologna sausage",
    "70 g (roughly 1/2 cup) of cream cheese",
    "45 g (roughly 1/4 cup) of feta cheese",
    "8 g (roughly 2 tbsp) of blue cheese",
    "1/4 cup of grated parmigiano cheese",
    "1/2 clove of garlic",
    "Pinch of freshly grated nutmeg",
    "1/4 tsp of freshly ground black pepper",
    "Salt to taste (the amount greatly depends on the ingredients you use)",
    "Egg wash (1 egg beaten w/ 1 tbsp of water)",
    "Powder sugar for dusting",
    "Yellow mustard on the side"
  ],
  "keywords": [
    "pie",
    "crust",
    "allpurpose",
    "flour",
    "divide",
    "cold",
    "unsalted",
    "butter",
    "cubes",
    "roughly",
    "feta",
    "cheese",
    "crumbled",
    "greek",
    "yogurt",
    "sour",
    "cream",
    "salt",
    "sugar",
    "allspice",
    "nutmeg",
    "iced",
    "water",
    "filling",
    "smallsize",
    "broccoli",
    "bologna",
    "sausage",
    "blue",
    "parmigiano",
    "clove",
    "garlic",
    "black",
    "pepper",
    "greatly",
    "depends",
    "use",
    "wash",
    "egg",
    "dusting",
    "yellow",
    "mustard"
  ],
  "title": "THE INFINITE KITCHEN SINK HAND PIE",
  "users": [
    null
  ]
}