{
  "hash": "96a17a0c0057ab27c6706fc0a01c3288d70e5545",
  "title": "Grass-Fed Beef Meatloaf in a Bacon Blanket",
  "image": "http://www.epicurious.com/images/recipesmenus/2011/2011_october/368549.jpg",
  "href": "http://www.epicurious.com/recipes/food/views/grass-fed-beef-meatloaf-in-a-bacon-blanket-368549",
  "extension": "Firefox",
  "firstAdded": "2015-10-06T12:43:28.472000",
  "users": [
    null
  ],
  "keywords": [
    "crumbs",
    "food",
    "processor",
    "slices",
    "bread",
    "milk",
    "medium",
    "onion",
    "carrots",
    "celery",
    "rib",
    "garlic",
    "olive",
    "oil",
    "salt",
    "grassfed",
    "beef",
    "preferably",
    "cooks",
    "notes",
    "pork",
    "shoulder",
    "lean",
    "ketchup",
    "eggs",
    "lightly",
    "worcestershire",
    "smoked",
    "paprika",
    "black",
    "pepper",
    "bacon",
    "crosswise"
  ],
  "directions": [
    "0",
    "Heat oven to 375°F with rack in middle.",
    "Meanwhile, stir together bread crumbs and milk in a large bowl and set aside.",
    "Cook onion, carrot, celery, and garlic in oil with 1 teaspoon salt in a heavy 12-inch skillet over medium heat, covered, stirring occasionally, until tender, 8 to 10 minutes. Remove from heat and cool.",
    "Combine beef, pork, ketchup, eggs, Worcestershire sauce, smoked paprika, pepper, 1 teaspoon salt, and cooked vegetables with bread crumbs and mix with your hands until vegetables are well distributed and mixture is cohesive.",
    "Form mixture into a 12-inch loaf, about 4 1/2 inches wide, in pan, and lay bacon slices crosswise over it.",
    "Roast in oven until an instant-read thermometer inserted into the center registers 160°F, 40 to 45 minutes.",
    "If the bacon on top isn't crisp, reset oven to broil and broil the meatloaf, 4 to 5 inches from the heat, until bacon is crisp and browned, 2 to 3 minutes.",
    "Let meatloaf rest in pan 10 minutes before transferring to a platter.",
    "Cooks' Notes: •Smoked paprika from Spain is the latest smoky flavor, after chipotle chiles, but don't despair if you can't find it. Skip it and you'll still end up with a delicious meatloaf.\n•Meat that's been ground once will be coarser and will give your meatloaf a more appealing texture. This may be a special request at your supermarket or from your butcher.\n•This recipe also works with regular ground chuck or bison.\n•If you are making the meatloaf along with the scalloped potatoes, you can bake them side by side on the same rack in the oven. If your pans wont fit side by side, put the meatloaf in the upper third and the potatoes in the lower third. When it comes to broiling, though, broil each one separately, so that you have more control over how much each dish browns.\n•Leftover meatloaf keeps, well covered and chilled, 4 days. It makes a mean sandwich with caramelized onions and Dijon mustard, or simply lettuce, tomato, and mayonnaise."
  ],
  "ingredients": [
    "0",
    "1 cup fresh bread crumbs (ground in food processor from 2 slices of bread)",
    "1/2 cup milk",
    "1 medium onion, finely chopped",
    "2 medium carrots, finely chopped",
    "1 large celery rib, finely chopped",
    "4 large garlic cloves, finely chopped",
    "2 tablespoons olive oil",
    "Salt",
    "1 1/2 pounds ground grass-fed beef (preferably ground once; see Cooks' Notes)",
    "1/2 pound ground pork (preferably shoulder, not lean; and ground once; see Cooks' Notes)",
    "1/2 cup ketchup",
    "2 large eggs, lightly beaten",
    "1 tablespoon Worcestershire sauce",
    "2 teaspoons smoked paprika (optional; see Cooks' Notes)",
    "1/2 teaspoon freshly ground black pepper",
    "6 bacon slices, halved crosswise"
  ],
  "__v": 1
}