{
  "hash": "af360484b9434b3a7ea1b044870d0f9340bb2c71",
  "title": "Chicken Shawarma",
  "image": "http://toriavey.com/images/2012/08/Chicken-Shawarma-640x480.jpg",
  "href": "http://toriavey.com/toris-kitchen/2012/08/chicken-shawarma/",
  "extension": "Chrome",
  "firstAdded": "2015-05-24T21:47:20.674000",
  "users": [
    null
  ],
  "keywords": [
    "boneless",
    "skinless",
    "tofu",
    "chicken",
    "breasts",
    "thighs",
    "extra",
    "virgin",
    "olive",
    "oil",
    "divided",
    "cumin",
    "paprika",
    "allspice",
    "turmeric",
    "garlic",
    "cinnamon",
    "cayenne",
    "salt",
    "black",
    "pepper",
    "cooking",
    "spray",
    "grill",
    "baking",
    "sheet",
    "tongs",
    "skillet",
    "spatula",
    "foil",
    "plastic",
    "wrap"
  ],
  "directions": [
    "0",
    "Slice the chicken breasts into 5-6 pieces each and the thighs into 3-4 pieces each. Place them in a marinating dish or large plastic zipper bag.",
    "In a small bowl, whisk together 1/4 cup olive oil, the spices, 3/4 tsp salt and 1/4 tsp black pepper (if you're salt sensitive, use 1/2 tsp of salt). Pour the spice marinade over the chicken pieces. Stir with a spoon till all the chicken pieces are evenly coated in the marinade.",
    "Cover the marinating dish with plastic wrap, or close the zipper bag. Place chicken in the refrigerator and let it marinate at least 1 hour, up to overnight.",
    "Preheat oven to 400 degrees F. Line a baking sheet with foil. Spray the foil with nonstick cooking oil. Place the chicken pieces on the sheet, evenly spaced.",
    "Place the chicken in the oven. Let it roast for about 15 minutes till cooked through, turning the chicken pieces once with tongs halfway through cooking.",
    "Take chicken out of the oven and let it cool slightly. Use a sharp knife to slice the meat into small, thin shawarma-like pieces.",
    "Heat 1 tbsp of oil in a skillet on the stovetop over medium. Pour half of the chicken into the skillet and saute for 3-4 minutes till the smallest pieces of chicken turn brown and crisp. Season with additional salt and pepper to taste, if desired.",
    "Remove the cooked chicken from the skillet. Heat another 1 tbsp of oil and saute the remaining chicken in the same way. Serve warm.",
    "Spray the grill with nonstick cooking oil and preheat to medium heat. Thread the marinated chicken pieces onto wooden skewers.",
    "Cook the chicken for about 20 minutes, giving a quarter turn every 5 minutes, till cooked through (slice into the thickest piece of meat to check for doneness).",
    "Let the chicken cool slightly, then remove it from the skewers. Use a sharp knife to slice the meat into small, thin shawarma-like pieces.",
    "Heat 1 tbsp of oil in a skillet on the stovetop over medium. Pour half of the chicken into the skillet and saute for 3-4 minutes till the smallest pieces of chicken turn brown and crisp. Season with additional salt and pepper to taste, if desired.",
    "Remove the cooked chicken from the skillet. Heat another 1 tbsp of oil and saute the remaining chicken in the same way. Serve warm.",
    "Note: If you are making this recipe for Passover and you are avoiding kitniyot, don't serve it with the tahini sauce-- it's great without sauce, too."
  ],
  "ingredients": [
    "0",
    "1 lb boneless skinless chicken breasts (2 large breasts) Or Tofu Chicken breasts sliced",
    "1 lb boneless skinless chicken thighs (4 large thighs) Or more Tofu Chicken",
    "6 tbsp extra virgin olive oil, divided",
    "2 tsp cumin",
    "2 tsp paprika",
    "1 tsp allspice",
    "3/4 tsp turmeric",
    "1/4 tsp garlic powder",
    "1/4 tsp cinnamon",
    "Pinch of cayenne",
    "Salt and black pepper",
    "Nonstick cooking oil spray",
    "Grill or baking sheet, tongs, skillet, spatula, foil, plastic wrap."
  ],
  "__v": 2
}