{
  "hash": "b93cf871dba3874cb1d6bde45fefd2b8ab8033d9",
  "title": "Easy Blueberry Pie Recipe",
  "image": "http://recipe-folder.com/img/recipe-images/008/186/3625991508.jpg",
  "href": "http://shewearsmanyhats.com/easy-blueberry-pie-recipe/",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T21:21:02.622000",
  "users": [
    null
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "dusting",
    "work",
    "surface",
    "dough",
    "double",
    "pie",
    "crust",
    "chilled",
    "pints",
    "blueberries",
    "squeezed",
    "lemon",
    "juice",
    "milk",
    "cream",
    "brown",
    "sugar",
    "extra",
    "sprinkling",
    "cinnamon",
    "water",
    "egg",
    "wash"
  ],
  "directions": [
    "0",
    "Butter a 9-inch pie pan. For crust: On a lightly floured surface, roll out half of dough to ⅛-inch-thick circle. Fit into a 9-inch buttered pie pan, trim, leaving about ½-3/4 inch overhang. Cover crust with plastic wrap and chill in refrigerator for about 30 minutes. If making a full top crust, roll out remaining half of dough into a circle approximately 1 inch larger in diameter than pie pan, cover with plastic wrap and chill in refrigerator for about 30 minutes. If creating a lattice top, on a lightly floured surface, roll remaining half of dough ⅛ inch thick into rectangle approximately 11x14 inches. Cut into 10 separate ¾ inch strips. Cover strips with plastic wrap and chill for about 30 minutes.",
    "Adjust oven racks, place one rack on bottom level and one in the middle. Place baking sheet or baking stone on bottom rack. Preheat oven to 400-degrees F.",
    "In a large bowl whisk together lemon juice and milk, gradually sprinkle in 4 tablespoons of flour, whisk until smooth. Stir in brown sugar and cinnamon. Add blueberries, and stir to coat. Let sit for about 5 minutes. Pour into prepared bottom crust.",
    "Brush the rim of the crust with the egg wash, place the top crust on, trim to ½ inch larger than size of pan, and crimp together edges with fingers to seal bottom and top crusts, or weave strips of dough to create lattice top, crimping edges to seal. If dough seems soft and warm, cover top with plastic wrap and chill pie in refrigerator for about 20-30 minutes. (Pie can also be tightly wrapped (airtight) with plastic wrap and placed in a large plastic zip-top freezer bag and frozen for up to 2 months.)",
    "Brush crust with the egg wash, sprinkle lightly with sugar and place pie on baking sheet or baking stone on bottom rack and bake for 20 minutes. Reduce heat to 375-degrees F and transfer pie (on baking sheet) to center rack. Cover the rim of pie crust with foil. Continue to bake at 375-degrees F until crust is golden and the filling is bubbling, about 30 to 40 minutes. Check crust every 10 minutes or so, and if crust/lattice starts to brown too much, tent pie loosely with a piece of foil. Let cool to set and thicken before serving (if you can wait that long)."
  ],
  "ingredients": [
    "0",
    "all-purpose flour for dusting work surface",
    "pie dough for double 9-inch pie crust, chilled",
    "2½ pints (5 cups) fresh blueberries",
    "1 tablespoon freshly squeezed lemon juice",
    "2 tablespoons milk or cream",
    "4 tablespoons all-purpose flour",
    "½ cup brown sugar + extra for sprinkling on top",
    "¼ teaspoon ground cinnamon",
    "1 large egg, beaten with 1 tablespoon water (for egg wash)"
  ],
  "__v": 1
}