{
  "hash": "5e83cf3bf709477f6c3a8e369881374f7778b6ad",
  "title": "Todd Coleman's Potato Gratin",
  "image": "//images.food52.com/3x5AgVqEno9LBnlPWGjexyXLR6Q=/753x502/27dd6e29-7a5e-4b7c-acfa-83334d03cbaf--2014-1209_genius-potato-gratin-048.jpg",
  "href": "https://food52.com/recipes/32682-todd-coleman-s-potato-gratin",
  "extension": "Firefox",
  "firstAdded": "2015-10-31T13:06:19.761000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "butter",
    "garlic",
    "salt",
    "waxy",
    "potatoes",
    "red",
    "bliss",
    "halfandhalf",
    "black",
    "pepper",
    "nutmeg",
    "gruyre"
  ],
  "directions": [
    "0",
    "Preheat oven to 400° F. Rub the inside of an 8- × 8-inch baking dish with 1 tablespoon of the butter. Smash the garlic with the side of a knife and sprinkle generously with salt. Chop and scrape the garlic into a mushy paste.",
    "Combine garlic paste, potatoes, half-and-half, and remaining 4 tablespoons butter (cut into 1/2-inch pieces) in a pot; stir. Season with salt and pepper and grate in a hint of nutmeg. Bring to a boil over medium-high heat while stirring the mixture with a wooden spoon. After 8 to 10 minutes the potatoes will be a little tender, and their starch will have thickened the liquid considerably. Taste and adjust the seasoning as you like.",
    "Transfer the mixture to the prepared dish; smooth the top as much as possible. At this point you can hold the dish until you're ready to bake, even overnight in the refrigerator. Cover the gratin with Gruyère and bake until deeply golden brown, about 20 to 30 minutes (longer if chilled overnight). Let the gratin cool and set a little before serving."
  ],
  "ingredients": [
    "0",
    "5 tablespoons unsalted butter",
    "1 to 2 garlic cloves",
    "Salt",
    "6 large waxy potatoes (about 2 1/2 pounds), such as red bliss, peeled and sliced about 1/8-inch thick",
    "2 cups half-and-half",
    "Freshly ground black pepper",
    "Fresh nutmeg",
    "1 cup grated Gruyère"
  ],
  "__v": 1
}