{
  "hash": "ded549eb7d5be546cc384aa09b71ebcc8b2687ea",
  "title": "Eggnog Pie",
  "image": "http://ak-hdl.buzzfed.com/static/2015-12/21/16/enhanced/webdr07/grid-cell-4413-1450732550-21.jpg",
  "href": "http://www.buzzfeed.com/alisonroman/eggnog-pie?bffbfoodvideo&utm_term=.ervY22pQKm",
  "extension": "Chrome",
  "firstAdded": "2015-12-23T04:16:21.508000",
  "users": [
    null
  ],
  "keywords": [
    "pie",
    "crust",
    "gingersnap",
    "crumbs",
    "cookies",
    "sugar",
    "nutmeg",
    "kosher",
    "salt",
    "unsalted",
    "butter",
    "filling",
    "milk",
    "cream",
    "divided",
    "egg",
    "yolks",
    "cornstarch",
    "bourbon",
    "rum",
    "pieces",
    "whipped",
    "gingersnaps",
    "decoration"
  ],
  "directions": [
    "0",
    "Preheat oven to 350°.",
    "Combine gingersnap crumbs, sugar, nutmeg and salt in a medium bowl. Add melted butter and using your hands, mix until all the crumbs are evenly coated (it will look like wet sand).",
    "Transfer mixture to 9” pie dish. Using the palms of your hand, press crust into the bottom and up the sides of the pie dish.",
    "Bake until it’s set and starts to toast along the edges, 15–20 minutes.",
    "Bring milk, cream and 1/4 cup sugar to a boil in a medium pot over medium heat.",
    "Whisk egg yolks, cornstarch, salt and remaining 1/4 cup sugar together in a medium bowl until it’s super well-blended and no lumps remain.",
    "Slowly whisk the milk mixture into the eggs until it’s totally blended (this is called tempering: It prevents the eggs from scrambling).",
    "Return this mixture to the same pot you heated the milk in and cook it over low heat, whisking constantly until it’s thickened (it’ll look like pudding).",
    "Remove this from the heat and whisk in the bourbon followed by the butter. Whisk until the butter is totally melted and incorporated into the custard.",
    "Pour it into the pie crust and spread it evenly (don’t worry about it being too smooth, you’re covering the top up anyway).",
    "Chill for at least 2 hours and up to 1 day.",
    "Whip the cream and sugar together until it reaches stiff peaks, which is to say it doesn’t drip off the whisk and will hold a peak when you stand it up on a whisk. Spread this over the pie, giving it some dramatic peaks and valleys. Sprinkle the top with grated nutmeg and stick in some gingersnaps."
  ],
  "ingredients": [
    "0",
    "For the pie crust:",
    "2 cups gingersnap crumbs (from about 3/4 bag of cookies)",
    "1 tablespoon sugar",
    "1 tsp. grated nutmeg",
    "1 tsp. kosher salt",
    "1 stick unsalted butter, melted",
    "For the pie filling:",
    "2 cups milk",
    "1 cup heavy cream",
    "1/2 cup sugar, divided",
    "6 egg yolks",
    "1/4 cup cornstarch",
    "1/2 teaspoon kosher salt",
    "2 tablespoons bourbon or rum",
    "4 tablespoons unsalted butter, cut into pieces",
    "For the whipped cream topping:",
    "2 cups heavy cream",
    "1/4 cup sugar",
    "Nutmeg, for topping",
    "Gingersnaps, for decoration"
  ],
  "__v": 2
}