{
  "hash": "f41ce943c1b4b27167064b3e0b7751be8ee6ab8d",
  "title": "Classic lamingtons",
  "image": "http://www.taste.com.au/images/recipes/sfi/2012/03/28999_l.jpg",
  "href": "http://www.taste.com.au/recipes/28999/classic+lamingtons",
  "firstAdded": "2015-01-25T14:53:32.523000",
  "users": [
    null
  ],
  "keywords": [
    "eggs",
    "caster",
    "sugar",
    "vanilla",
    "cornflour",
    "selfraising",
    "flour",
    "plain",
    "butter",
    "desiccated",
    "coconut",
    "icing",
    "mixture",
    "cocoa",
    "sifted",
    "milk"
  ],
  "directions": [
    "0",
    "Step 1 Preheat oven to 180°C/160°C fan-forced. Grease a 4.5cm deep, 23cm x 33cm (base) roasting pan. Line base and sides with baking paper, extending paper 3cm above edges of pan.",
    "Step 2 Using an electric mixer, beat eggs, sugar and vanilla together for 8 minutes or until mixture becomes thick and creamy.",
    "Step 3 Meanwhile, triple-sift cornflour, self-raising flour and plain flour together. Sift over egg mixture. Using a spatula or whisk, fold in flours until just combined. Fold in butter. Pour mixture into prepared pan. Bake for 25 to 30 minutes or until sponge is golden and just firm to touch. Turn onto a wire rack lined with baking paper. Cool completely. Trim edges of sponge. Cut sponge into 24 squares.",
    "Step 4 Make Chocolate: icing Place icing sugar, cocoa, milk and butter in a heatproof bowl over a pan of simmering water. Stir over heat until combined and smooth. Place coconut in a bowl.",
    "Step 5 Using a fork, toss one piece of sponge in icing to coat (see note 1). Drain off excess icing. Toss in coconut to coat all over. Transfer to a baking paper-lined tray. Repeat with remaining sponge, icing and coconut. Set aside for 1 hour to set. Serve."
  ],
  "ingredients": [
    "0",
    "6 eggs",
    "3/4 cup caster sugar",
    "1 teaspoon vanilla extract",
    "1/2 cup cornflour",
    "1/2 cup self-raising flour",
    "1/2 cup plain flour",
    "20g butter, melted",
    "3 cups desiccated coconut",
    "1",
    "5 cups icing sugar mixture",
    "3/4 cup cocoa powder, sifted",
    "3/4 cup milk",
    "20g butter, chopped"
  ],
  "__v": 1
}