{
  "hash": "887dde196bb503c7f9a820f854beb3ecb9dd8835",
  "title": "Pasta Al Pomodoro",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/pasta-al-pomodoro",
  "extension": "Chrome",
  "firstAdded": "2016-10-27T17:19:16.011000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparation",
    "Heat extra-virgin olive oil in a 12\" skillet over medium-low heat. Add minced onion and cook, stirring, until soft, about 12 minutes. Add garlic and cook, stirring, for 2-4 minutes. Add crushed red pepper flakes; cook for 1 minute more. Increase heat to medium, add puréed tomatoes and season lightly with kosher salt; cook, stirring occasionally, until sauce thickens slightly and the flavors meld, about 20 minutes. Remove pan from heat, stir in basil sprigs, and set aside.",
    "Meanwhile, bring water to a boil in a 5-qt. pot. Season with salt; add spaghetti or bucatini and cook, stirring occasionally, until about 2 minutes before tender. Drain pasta, reserving 1/2 cup pasta cooking water.",
    "Discard basil and heat skillet over high heat. Stir in reserved pasta water to loosen sauce; bring to a boil. Add pasta and cook, stirring, until sauce coats pasta and pasta is al dente, about 2 minutes. Remove pan from heat; add butter and cheese; toss until cheese melts. Transfer to warm bowls; serve with more cheese, if desired."
  ],
  "ingredients": [
    "0",
    "Pasta Al Pomodoro",
    "The secret to this simple tomato-based pasta recipe? Pasta water and butter. This is part of BA's Best, a collection of our essential recipes. Learn how to make this recipe and more in our online cooking class with Sur la Table.",
    "Ingredients",
    "SERVINGS",
    "1/4 cup extra-virgin olive oil",
    "1 medium onion, minced",
    "4 garlic cloves, minced",
    "1 pinch crushed red pepper flakes",
    "1 28 oz. can peeled tomatoes, puréed in a food processor",
    "Kosher salt",
    "3 large fresh basil sprigs",
    "12 oz. bucatini or spaghetti",
    "2 Tbsp. cubed unsalted butter",
    "1/4 cup finely grated Parmesan or Pecorino"
  ],
  "__v": 1
}