{
  "hash": "b58a1d9022ec5d8b30bdf166b5302e391d0cc617",
  "title": "No Bake Snickers Crunch Bars",
  "image": "",
  "href": "http://www.momontimeout.com/2016/10/no-bake-snickers-crunch-bars/",
  "extension": "Firefox",
  "firstAdded": "2017-06-01T04:57:24.992000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Spray a 9x13 baking dish with cooking spray and line with parchment paper. Set aside.",
    "Combine half of the chocolate chips, butterscotch chips, and peanut butter in a large microwave safe container.",
    "Microwave on high heat in 30 second intervals, stirring in between, until the chips are fully melted and the mixture in smooth.",
    "Stir in Cocoa Pebbles until fully coated. Pour mixture into prepared baking dish.",
    "Refrigerate until firm, about 15 minutes.",
    "1",
    "In a small saucepan, combine butter, sugar, and evaporated milk over medium heat, stirring until butter is completely melted and the sugar is dissolved. Coupons",
    "Bring mixture to a boil and cook for an additional 5 minutes, stirring frequently.",
    "Remove from heat.",
    "Stir in marshmallow creme until completely combined. Stir in peanut butter and vanilla extract until combined. Fold in peanuts.",
    "Pour the nougat layer over the chilled chocolate bottom layer. Refrigerate until firm, about 15 minutes.",
    "2",
    "Combine unwrapped caramels and evaporated milk in a microwave-safe container and heat on high for 1 minute. Stir and heat on high in 30 second intervals until caramel is completely melted.",
    "Spread caramel over the top of the chilled nougat layer.",
    "3",
    "Repeat the bottom layer. Combine remaining half of the chocolate chips, butterscotch chips, and peanut butter in a large microwave safe container.",
    "Microwave on high heat in 30 second intervals, stirring in between, until the chips are fully melted and the mixture in smooth.",
    "Stir in Cocoa Pebbles until fully coated. Pour mixture on top of the chilled caramel layer.",
    "Refrigerate until firm, about 30 minutes.",
    "Bars should be refrigerated until ready to eat. Cut and serve."
  ],
  "ingredients": [
    "0",
    "1 12 oz package semi-sweet chocolate chips, divided",
    "1 11 oz package butterscotch chips, divided",
    "1 cup creamy peanut butter, divided",
    "3 cups Cocoa Pebbles, divided",
    "1",
    "¼ cup unsalted butter",
    "1 cup granulated sugar",
    "¼ cup evaporated milk",
    "7 oz container marshmallow creme",
    "¼ cup creamy peanut butter",
    "1½ cups roasted, lightly salted peanuts, coarsely chopped",
    "1 tsp vanilla extract",
    "2",
    "1 11 oz bag KRAFT caramels or caramel bits",
    "¼ cup evaporated milk"
  ],
  "__v": 1
}