{
  "hash": "0a6ee4834ef49f4ef3e724edf46a171ba7ecc7f1",
  "title": "Soyrizo Fire OG chili",
  "image": "https://i.imgur.com/gVXWWDu.jpg",
  "href": "https://www.reddit.com/r/VegRecipes/comments/5dd70d/soyrizo_fire_og_chili/",
  "extension": "Chrome",
  "firstAdded": "2016-12-01T06:01:13.231000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "My Choice of beans but you can use whatever beans you like best just be sure you drain and rinse your beans before you cook them",
    "On Medium-high heat cook your soyrizo until it starts to brown then put chorizo in a bowl and set it aside. (if you want to use Ground Beef instead of chorizo it is the same process, simply cook until meat is browned",
    "On Medium Heat Caramelize your onions and garlic starting with the onions until they start to become translucent, then add garlic and cook for an additional 5 minutes making sure to stir so the garlic doesn't burn",
    "Next add them peppas! You can add as much as you like but heres a picture of the size ratios we used.",
    "After about 5 minutes lower the heat down to Medium Low and add the soYrizo back in to the mix cooking and stirring for about 5 minutes",
    "Add your Diced tomatoes and Beef Bouillon then stir it up!",
    "Add your Green Chiles (and Activated Love if you have it Add All the Beans!",
    "Add your Corn, Worcestershire Sauce, Dried Oregano, Chili Powder, Ground Cumin, Hot Sauce, Paprika, White pepper and secret herbs",
    "By this time your house will undoubtedly be smelling dank AF. Turn the heat down to low, cover and let the ingredients party together for about an hour(if you can wait two you should but I understand if you can't wait!) Top your now Fire chili with some shredded cheese a drizzle of that delicious Special Chili Oil some green onions and you are good to go!"
  ],
  "ingredients": [
    "0",
    "3 Cans (15oz) Chili Beans or your favorite kind 1 Can Diced Tomatoes 1 Can (4.5oz) Green Chiles 1 Large Onion diced 3 cloves minced garlic 1 Habanero Minced 2 Medium sized Jalapenos chopped 1 Cup Frozen Corn 1 lb Soyrizo 2 Beef Bouillon cubes (you can buy Veg friendly versions here) 1 TBS Worcestershire Sauce 1 TBS Dried Oregano 1 TBS Chili Powder 2 tsp Ground Cumin 1 TBS favorite Hot Sauce 1 tsp Paprika 1 tsp White Granulated Sugar 2 TBS Special Chili Oil Diced Green Onion (for garnish) OPTIONAL: Shredded cheese on top"
  ],
  "__v": 1
}