{
  "hash": "f4906162188d1c9cf24c0dd09aa0fd26e0a49885",
  "title": "Kváskový chleba pšenično-žitný",
  "image": "http://www.pavlavtroube.cz/recepty/upec-treba-chleba/../uploads_editor/images/chleba/Uda-kvsakovy-chleba-2.jpg",
  "href": "http://www.pavlavtroube.cz/recepty/upec-treba-chleba/kvaskovy-chleba-psenicno-zitny.html",
  "extension": "Chrome",
  "firstAdded": "2016-01-31T12:30:44.272000",
  "users": [
    null
  ],
  "keywords": [
    "gkvsek",
    "itn",
    "gmouka",
    "chlebov",
    "penam",
    "gvoda"
  ],
  "directions": [
    "0",
    "Večer si nachystáme kvásek na rozkvašení. Vytáhneme kvásek z lednice a odebereme potřebné množství. Většinou máme ve skleničce odebrané 3 lžíce či lžičky. Dávám ho všechen. Mouku i vodu si navážíme.",
    "Do velké mísy (jestli máte s víkem) dáme kvásek, mouku a vodu a lžičkou, kterou máme neustále ve sklence pořádně promícháme na hustější těstíčko. Takto připravený kvásek zakryjeme víkem od mísy nebo dáme do mikrotenového sáčku a necháme odpočívat do rána v pokojové teplotě. Pokud máme aktivní a čilý kvásek a doma máme příliš teplo vypočítáme si dobu rozkvašení kvásku a kvásek dáme rozkvasit co nejpozději.",
    "Doba rozkvašení je orientační cca od 8 - do12h zhruba. Pokud máme kvásek nově založen necháme ho 12h pokud je kvásek dosti aktivní čas upravíme podle něj. Proto přípravu kvásku si musíme spočítat, abychom pak správně určili dobu klesání kvásku.",
    "Po rozkvašení odebíráme asi přibližně 2-3 lžíce kvásku na další chleby. Skleničku, kterou používáme na kvásek nevymýváme. Někdy nám může tato ušmudlaná sklenička zachránit kvásek, pokud si zapomeneme odebrat na příště. Jednou za čas tu skleničku samozřejmě vymývám teplou vodou, ale je to až tak po měsíci.",
    "Kvásek jsme si odebrali a teď můžeme přejít k dalšímu kroku a to, že si zvážíme ostatní suroviny, které budeme přidávat. Přidáme pšeničnou mouku chlebovou, sůl, celý kmín a vodu. Pokud máme u těsta ještě suché části můžeme přidat nepatrně vody. Promícháme a uvidíme zda ještě budeme vodu přilévat. Je dobré, když to těsto není řídké ani příliš husté.",
    "Těsto máme zamísené a necháme ho odpočívat na teplém místě alespoň 1-3 hod. Při chladnějším počasí dávám těsto na nejteplejší místo.",
    "Těsto odpočinuté asi tak po 1,5 hod.",
    "Těsto na vále podsypávám pšeničnou moukou. Těsto po překládám a nechám kynout v ošatce, kterou si musíme pokaždé vysypat moukou. (ošatku volíme podle velikosti daného těsta).Já vysypávám moukou co mám po ruce. Můžete i jemně celozrnnou moukou. Následné video vám ukáže jak těsto překládám a hnětu.",
    "Těsto si přikryjeme a dáme kynout na teplé místo. V létě těsto kyne jinak než v zimě. Proto časy kynutí jsou rozdílné. Já dávám těsto doma na nejteplejší místo, které najdu. Pokud těsto kyne pomalu, tak ho můžeme nechat kynout i déle. Uvidíte samy jak pracuje. Pokud vám těsto překynulo, tak ho znovu prohnětu na vále a stočím, nechám zas kynout asi tak 2 hodinky.",
    "Těsto v ošatce asi tak po 1,5 hodiny krásně zdvojnásobilo objem a už se může rozpalovat trouba. Těsto by mělo kynout zhruba 1,5 - 2 hodiny. Testíkem píchnutí do těsta nám také ukáže, jestli těsto pracuje či nikoliv. Pokud se nám vrátí zpět tak kyne, pokud zůstane díra v těstě je čas do trouby. Sami si musíte podle těsta určit, kdy je čas dát do trouby.",
    "Rozpálila jsem si asi půl hodiny před do kynutím troubu na 250°C, na spodku mám starý plech na zapaření trouby a plech či mísu na zahřátí. Pokud dáte chleba na studený plech či do studené mísy mohl by vám v té troubě hodně popraskat ze spodku. Po půl hodině jsem opatrně těsto z ošatky vyklopila a nařízla žiletkou. Vyklopila jsem ho na pečící papír, který i s těstem přendám na ten ohřátý plech. Papír i těsto mám na větším prkýnku místo sázecí lopaty. Lépe se vám to bude přendávat do trouby. Jakmile těsto šoupnu do trouby musí to být rychle, ale opatrně vezmu hrnek s vařící vodou a chrstnu ho na ten starý pekáč co mám na dně trouby. Hned přivřu dvířka, aby mi nevyšla pára ven.",
    "Těsto v troubě. Peču ho na 250°C cca 20-25 minut. Pekáč po 10 minutách můžeme vytáhnout z trouby ven. Během pečení můžeme sem tam rozprašovačem pokropit samotný chleba. Pak po těch cca 20 min. snížím na 230°C a peču dalších 15-20 minut.",
    "Každá trouba peče jinak, proto si upravte čas toho pečení podle vaší trouby. Také může trouba péct jinak nahoře a dole. Časem to vychytáte. Hlídám si chlebík a podle zabarvení kůrky a poklepu na dno (musí znít dutě, zvonivě) pak zjistím zda už mám upečeno. Troubu vypnu buď nechám ještě 5 min. dojít nebo chleba vytáhnu a pokropím lehce kůrku vodou. Nechám vychladnout na mřížce.",
    "Chleba hotový. První rozkrojení chleba bych učinila až po více jak 2h. Mohl by se vám srazit uvnitř tím, že by jste ho za tepla rozkrájeli."
  ],
  "ingredients": [
    "0",
    "50gkvásek žitný",
    "150gmouka žitná chlebová Penam",
    "150gvoda"
  ],
  "__v": 1
}