{
  "hash": "27c2ffb97d76298dca47b9c49550918e9274a133",
  "title": "Chocolate Chip Skillet Cookie for Two",
  "image": "https://eviltwin.kitchen/wp-content/uploads/2016/07/Skillet-Cookie-For-Two-Pin.jpg",
  "href": "https://eviltwin.kitchen/chocolate-chip-skillet-cookie-for-two/",
  "extension": "Chrome",
  "firstAdded": "2018-04-28T12:11:03.660000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat your oven to 350°F and generously butter a 6-1/4” mini cast iron skillet. If you didn’t have such a skillet, you could use a 6” cake pan instead, but you may have to adjust baking time slightly.",
    "Combine the flour, baking soda and salt in a bowl and mix well with a whisk until well combined; set aside.",
    "In a separate mixing bowl, combine the granulated sugar, brown sugar and vanilla extract. Add the melted butter and stir with a fork until well combined.",
    "Add the egg yolk, stir well, and then carefully stir in the flour mixture. Mix until completely combined, then stir about 2/3 of the chocolate chips.",
    "Transfer the cookie dough to the cast iron skillet and arrange it delicately with your fork, just so it's evenly distributed across the skillet.",
    "Bake for about 18-20 minutes, or until the edges are puffed and browned and the center appears set.",
    "Remove from the oven and press a few additional chocolate chips across the surface of the cookie, if desired; allow to cool for about 5 minutes.",
    "Meanwhile, melt the remaining chocolate chips in the microwave, adding a few drops of oil to make it more drizzleable, if necessary.",
    "Garnish the cookie with a great big scoop of vanilla ice cream, drizzle with the melted chocolate and serve with 2 spoons!"
  ],
  "ingredients": [
    "0",
    "1/2 cup (75g | 2.6oz) unbleached all-purpose flour",
    "1/4 tsp baking soda",
    "1/4 tsp salt (I use Himalayan salt)",
    "1/4 cup (50g | 1.8oz) granulated sugar",
    "1/4 cup (50g | 1.8oz) light brown sugar, packed",
    "1 tsp pure vanilla extract, (store-bought or homemade)",
    "1/4 cup (60g | 2.1oz) butter, melted",
    "1 large egg yolk",
    "1/2 cup (90g | 3.2oz) semi-sweet chocolate chips, divided (save a few tablespoons to melt and drizzle over cooked cookie)",
    "Your favorite vanilla ice cream, for serving"
  ],
  "__v": 1
}