{
  "__v": 1,
  "directions": [
    "0",
    "To Make The Cheesecake:",
    "Preheat oven to 325°F, and grease a 9-inch springform pan. Carefully wrap the outside of the pan in 2 layers of heavy-duty aluminum foil, being sure that there are NO gaps where water could seep through.",
    "Add Oreo cookies to the bowl of a food processor, and process until completely crumbled. (Or you can do this step by hand by crushing Oreos with a meat mallet inside a ziplock freezer bag.) Add in the melted butter, and stir or process until evenly mixed with the Oreos. Press the Oreo mixture evenly into the bottom of the springform pan. Then place the pan in a large roasting dish (or any pan larger than the springform), and bring a tea kettle or pot of water to boil in preparation for the water bath. Set aside.",
    "Using an electric mixer, beat cream cheese on medium speed for 3 minutes until smooth. Add sugar and beat for an additional minute until well blended. Add Greek yogurt and vanilla, and beat for an additional minute, stopping partway to scrape the bottom of the bowl with a spatula. Add eggs, one at a time, beating on low speed after each addition just until blended. Do not overbeat! Pour into crust.",
    "Place the double pans in the oven on a shelf on the bottom third of the oven. Very carefully use a tea kettle (or large measuring cup) to pour the boiling water in the larger pan to form a water bath around the springform, so that it comes up about 1-inch around the springform.",
    "Close the oven door, and bake about 1 hour 30 min, or until center is almost set. (The cake should still jiggle ever so slightly.) Turn oven off, and open oven door slightly. Let cheesecake set in oven 1 hour. Then remove cheesecake from oven, carefully run a knife around the edges of the cake, and then let cool to room temperature. Refrigerate at least 4 hours or overnight. Remove springform rim, and top cheesecake with Samoa topping. Return the cheesecake to the refrigerator for at least 15 minutes for the topping to set. Then serve, or cover and refrigerate for up to 5 days.",
    "Preheat oven to 350 degrees F. Spread shredded coconut out in an even layer on a parchment-covered (or aluminum foil-covered) baking sheet. Bake for about 6 minutes, or until the top layer of coconut is toasted and lightly golden, then remove the tray and stir the coconut. Bake for an additional 3-4 minutes or until the new layer of coconut is lightly golden. (Keep a close eye on it so that the coconut does not burn.) Remove the pan, and pour coconut into a mixing bowl.",
    "Add 1 cup caramel sauce to the bowl with the coconut, and stir to combine. (If your caramel is not very pour-able, heat it in the microwave or in a small saucepan until it is just slightly warmed.)",
    "Using a spoon, spread a separate 1/2 cup of caramel sauce onto the chilled cheesecake. Then top with the caramel/coconut mixture, and press it down until the top of the cheesecake is covered.",
    "Pour the melted chocolate into a piping bag or a Ziplock bag with the corner snipped off, then pipe it onto the top of the coconut/caramel mixture in even lines. Repeat in a separate bag with the remaining caramel sauce."
  ],
  "firstAdded": "2014-07-20T19:36:02.016000",
  "hash": "cd83bffe1de3ebe140f1c381ee6c7425250603e5",
  "href": "http://www.gimmesomeoven.com/samoa-cheesecake-recipe/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed:%2Bgimmesomeoven%2B(Gimme%2BSome%2BOven)",
  "image": "http://www.gimmesomeoven.com/wp-content/uploads/2014/06/Samoa-Cheesecake-4.jpg",
  "ingredients": [
    "0",
    "Cheesecake Ingredients:",
    "24 Oreo cookies",
    "4 Tablespoons melted butter",
    "pinch of salt",
    "1 cup granulated sugar",
    "3 (8-ounce) bricks neufchatel (low-fat) cream cheese, softened",
    "1 cup plain or vanilla Greek yogurt",
    "2 tsp. vanilla extract",
    "3 eggs",
    "2 cups shredded sweetened coconut",
    "1 3/4 cups caramel dip or sauce (you can either buy the 16-ounce store-bought tubs of caramel dip, or use 1 3/4 cups homemade caramel sauce)",
    "4 ounces dark chocolate"
  ],
  "keywords": [
    "cheesecake",
    "oreo",
    "cookies",
    "butter",
    "salt",
    "granulated",
    "sugar",
    "bricks",
    "neufchatel",
    "lowfat",
    "cream",
    "cheese",
    "softened",
    "plain",
    "vanilla",
    "greek",
    "yogurt",
    "eggs",
    "sweetened",
    "coconut",
    "buy",
    "storebought",
    "tubs",
    "dip",
    "use",
    "caramel",
    "dark",
    "chocolate"
  ],
  "title": "Samosa Cookie Cheesecake",
  "users": [
    null
  ]
}