{
  "hash": "db00900dba244844731484818dbc08a593f91290",
  "title": "Creamy Garlic Mushrooms!",
  "image": "http://i1.wp.com/lovefoodies.com/wp-content/uploads/2015/05/Creamy-Garlic-Mushrooms-PTL.jpg?resize=800%2C1522",
  "href": "http://lovefoodies.com/creamy-garlic-mushrooms.html",
  "extension": "Chrome",
  "firstAdded": "2015-11-14T12:53:06.388000",
  "users": [
    null
  ],
  "keywords": [
    "white",
    "mushrooms",
    "garlic",
    "cream",
    "cheese",
    "use",
    "low",
    "fat",
    "variety",
    "dry",
    "herbs",
    "tarragon",
    "basil",
    "parsley",
    "salt",
    "pepper",
    "olive",
    "oil"
  ],
  "directions": [
    "0",
    "Heat a pan with a teaspoon of oil and add the mushrooms and garlic on medium heat. Stir and toss until soft and a little liquid is released from the mushrooms. If the mushrooms do not release any liquid, add a couple of tablespoons of milk or broth. (Sometimes, depending on the season, mushrooms can vary in juiciness!)",
    "Then add the cream cheese and combine. Add the herbs and taste, season to your taste with salt and pepper.",
    "TIP: To avoid the cream cheese from splitting, you should make sure the heat is not too hot, if you are not sure, remove the pan from the heat whilst you add the cream cheese, combine well, then return to a gentle heat until the sauce is bubbling gently and heated through completely. As you will know, any cream products have a tendency to split or curdle if you add them to any high temperatures, so do not turn the heat up!!",
    "Serve straight from the pan, or you can transfer to an oven dish and place in the oven (covered) to keep warm until you are ready to serve."
  ],
  "ingredients": [
    "0",
    "8 oz or 225 g whole white mushrooms",
    "2 cloves of garlic, minced",
    "2 tablespoons of Cream Cheese. (you can also use low fat variety)",
    "1 teaspoon of fresh or dry herbs, such as tarragon, basil, parsley",
    "salt & pepper",
    "1 teaspoon of Olive Oil"
  ],
  "__v": 2
}