{
  "hash": "08c7c67e0f2a108f4f39482f69626c6c3e28c3bd",
  "title": "Spiced Pumpkin Apple Quick Bread\nGluten-Free & Vegan",
  "image": "",
  "href": "http://www.thecanaryfiles.com/2014/03/gluten-free-vegan-pumpkin-apple-quick.html",
  "extension": "",
  "firstAdded": "2015-11-08T15:59:44.142000",
  "users": [
    null
  ],
  "keywords": [
    "psyllium",
    "husk",
    "chia",
    "water",
    "buckwheat",
    "flour",
    "gluten",
    "free",
    "oat",
    "teff",
    "cinnamon",
    "nutmeg",
    "baking",
    "soda",
    "salt",
    "scant",
    "pumpkin",
    "puree",
    "coconut",
    "sugar",
    "oil",
    "molasses",
    "applesauce",
    "recommend",
    "firm",
    "crisp",
    "apple",
    "pink",
    "lady",
    "honeycrisp",
    "granny",
    "smith",
    "seeds",
    "cranberries",
    "greasing",
    "pan"
  ],
  "directions": [
    "0",
    "hat you'll need: one small bowl, two medium mixing bowls, whisk, spatula, one 9x5 inch loaf pan",
    "1. Make psyllium or chia \"egg\" by combining psyllium and warm water in small bowl and allowing to hydrate for about 3 minutes. It will turn gelatinous and thick.",
    "2. In the meantime, combine dry ingredients in one mixing bowl and whisk thoroughly until incorporated and uniform in appearance.",
    "3. Do the same for the wet ingredients and diced apple in the other bowl, folding them together with the spatula until combined. Add \"egg\" to wet ingredients.",
    "4. Gradually add dry mixture to wet mixture until you form a thick batter.",
    "5. Lightly grease your loaf pan with coconut oil and add batter, tapping loaf pan on the counter a few times when finished to minimize large air bubbles.",
    "6. Sprinkle cranberries and pumpkin seeds over the top and lightly tap into the surface.",
    "7. Place in center of oven and bake for 40-55 minutes, rotating pan midway through baking. You are looking for a dark blonde to deep golden brown color and a matte appearance on top. In different trials, I varied between applesauce and pureed pineapple and psyllium and chia powder and while I found great variation in color of the finished loaf, flavor did not seem to vary much at all. [rubs chin and says, \"Hmmmmm.\"]",
    "8. Remove from oven when finished and allow to cool for 5-10 minutes in pan before turning out onto a cooling rack. Allow to cool completely before serving for best flavor. Can be frozen, if desired, to enjoy on a rainy day in the near future or when you're pressed for time and need a dessert on the fly."
  ],
  "ingredients": [
    "0",
    "1 tablespoon whole psyllium husk or ground chia powder",
    "3 tablespoons warm water",
    "1/2 c (2 1/2 oz) buckwheat flour",
    "1/2 c (2 oz) gluten free oat flour",
    "1/2 c (2 oz) teff flour",
    "1 tablespoon cinnamon",
    "1/4 teaspoon nutmeg",
    "1 tablespoon baking powder",
    "1 1/2 teaspoons baking soda",
    "1/2 teaspoon salt",
    "scant 1 c (9 oz) unsweetened pumpkin puree",
    "1/2 c (2 oz) coconut sugar",
    "1/4 c (2 oz) melted coconut oil",
    "2 tablespoons (1 1/2 oz) molasses",
    "1/2 c (4 oz) unsweetened applesauce",
    "1/2 c (2 oz) diced apple (I recommend a firm, crisp apple, like a Pink Lady, Honeycrisp, or Granny Smith)",
    "pumpkin seeds and dried cranberries, to garnish",
    "coconut oil, for greasing pan"
  ],
  "__v": 1
}