{
  "hash": "a21926d6113281087c1d43812fd54cd5fcc315b8",
  "title": "Creamy Crab Zucchini Casserole",
  "image": "https://cdn.ruled.me/wp-content/uploads/2016/11/crab-zucchini-casserole-2nd.jpg",
  "href": "https://www.ruled.me/creamy-crab-zucchini-casserole/",
  "extension": "Chrome",
  "firstAdded": "2018-04-15T17:05:45.125000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 375º Fahrenheit. Spray a 9x9 baking dish with the butter or coconut oil. Heat water in the lower part of a steamer to a simmer.",
    "Spiralize zucchini squash on the widest ribbon setting, or slice very thinly, then sprinkle lightly with salt.Place squash in steamer basket, stretching the spirals so steam can reach all of the parts. Cover and steam until zucchini is barely tender, about 5-7 minutes. Remove the steamer basket and uncover. Place the steamer basket over a bowl to allow excess moisture to drain.",
    "Heat a large skillet over medium heat. Then add butter. When the butter stops foaming, add onions and cook until edges are beginning to brown and onions are tender. Stir in garlic and cook for 1 minute.",
    "Add vinegar and cook while stirring and scraping up any browned bits until vinegar evaporates almost completely. Pour in cream and add cream cheese in chunks. Cook, stirring frequently, until cheese has melted and mixture has thickened.",
    "Stir in crab meat and green onions.",
    "Stir in Old Bay Seasoning, salt and pepper. Taste and adjust seasoning if necessary.",
    "Add zucchini into the pan and mix everything together.",
    "Transfer casserole mixture over to your prepared baking dish and top with grated cheese.",
    "Bake for 20 to 25 minutes, or until bubbly and cheese on top is melted and starting to brown.",
    "Allow to cool 5-10 minutes before serving."
  ],
  "ingredients": [
    "0",
    "Butter or coconut oil spray to grease pan",
    "3 zucchini squash (12-16 ounces total)",
    "1 Tbsp. butter",
    "1 medium onion, cut in half, then sliced",
    "1 clove garlic, crushed",
    "1 Tbsp. red wine vinegar",
    "½ cup heavy cream",
    "4 oz. cream cheese",
    "2 tsp. Old Bay Seasoning",
    "½ tsp. salt",
    "¼ tsp. pepper",
    "8 oz. crab meat",
    "3 green onions, sliced thinly",
    "½ cup Mexican blend cheese, finely grated"
  ],
  "__v": 1
}