{
  "hash": "c6301b5bde00d8cdaffdfbeb2b1ecc098536ee23",
  "title": "Cream of Asparagus Soup",
  "image": "",
  "href": "http://www.food.com/recipe/cream-of-asparagus-soup-17648",
  "extension": "Chrome",
  "firstAdded": "2017-03-30T13:51:18.100000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Soak and rinse asparagus.",
    "Remove top 1 inch of each spear, discard tough lower part, and reserve middle portion of stalks.",
    "In a 3-quart saucepan, over medium heat, sauté onion in butter for 3 to 5 minutes or until translucent.",
    "Add chicken stock, asparagus tips and stems, potato, celery, thyme, and pepper.",
    "Cover and bring to a boil.",
    "Reduce heat to low and simmer for 12 to 15 minutes or until vegetables are soft.",
    "Remove from heat and let cool.",
    "Remove asparagus tips and set aside.",
    "Place half of the soup at a time in a blender container.",
    "Cover and blend at high speed for 20 to 30 seconds or until very smooth.",
    "Pass through a fine sieve and return blended soup to saucepan.",
    "Add reserved asparagus tips and cream (or half and half, or milk) and heat thoroughly, or refrigerate to be served cold.",
    "Be sure to adjust the seasoning after you add the cream (or half& half, or milk), especially if you plan to serve it cold.",
    "Submit a Correction"
  ],
  "ingredients": [
    "0",
    "Servings 4",
    "Units US",
    "1",
    "1 lb fresh asparagus spear",
    "1 medium onion, diced",
    "1 tablespoon unsalted butter",
    "24 ounces low sodium chicken broth (quantity to taste) or 24 ounces reduced-sodium chicken broth (quantity to taste) or 24 ounces chicken broth (quantity to taste)",
    "1 medium potato, peeled and diced",
    "1 celery rib, chopped",
    "1 teaspoon dried thyme (or fresh thyme)",
    "8 ounces cream (You may want to use evaporated skim milk to cut more fat)",
    "salt or salt substitute",
    "fresh ground white pepper"
  ],
  "__v": 1
}