{
  "hash": "5e7a790b3612b129b296d8fee413adf8d147006e",
  "title": "Sear-Roasted Haddock or Cod with Horseradish Aïoli & Lemon-Zest Breadcrumbs",
  "image": "http://www.finecooking.com/cms/uploadedimages/images/cooking/articles/issues_91-100/051092048-01-cod-recipe_xlg.jpg",
  "href": "http://www.finecooking.com/recipes/sear-roasted-fish-aioli-breadcrumbs.aspx",
  "extension": "Chrome",
  "firstAdded": "2017-01-03T03:27:54.270000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the oven to 425°F.",
    "Make the lemon-zest breadcrumbs: In a large skillet, heat the oil over medium-high heat. Add the breadcrumbs and cook, stirring, until golden and crunchy, about 2 minutes. Transfer to a small bowl and let cool. Stir in the lemon zest and season to taste with salt and pepper. Set aside at room temperature.",
    "Make the horseradish aïoli: In a small bowl, mix the aïoli ingredients, adding salt and pepper to taste. Cover and refrigerate.",
    "Sear-roast the fish: Heat the oil in a heavy 12-inch nonstick ovenproof skillet over medium-high heat. Pat the fish dry with a paper towel and season on both sides with 1/2 tsp. salt and 1/4 tsp. pepper. When the oil is shimmering hot, arrange the fillets evenly in the pan, skinned side up. Sear for about 2 minutes, without moving; then use a slotted metal spatula to lift a piece of fish and check the color. When the fillets are nicely browned, flip them and remove the pan from the heat.",
    "Spread the seared side of each fillet with some of the aïoli and then a layer of breadcrumbs. (You may or may not need all of the aïoli and crumbs.) Put the pan in the oven and roast until the fish is cooked through, 5 to 6 minutes.",
    "While the fish is roasting, put the parsley leaves in a small bowl; cut the lemon in half and squeeze some juice from one half over the parsley, to taste. Drizzle the parsley with enough extra-virgin olive oil to lightly coat the leaves, season with salt and pepper, and toss. The parsley should taste bright and lemony. Cut the remaining lemon half into four wedges.",
    "When the fish is cooked, remove the pan from the oven and transfer the fillets to plates. Top each with some of the parsley salad and garnish with a lemon wedge.",
    "Serve with a salad of Arugula with Hearts of Palm, Grapefruit, and Oil-Cured Olives.",
    "Try a dry, fruity rosé like the 2006 Château La Rouvière Bandol Rosé ($22)."
  ],
  "ingredients": [
    "0",
    "3 Tbs. olive oil",
    "1 cup coarse fresh breadcrumbs (from a rustic loaf)",
    "1 Tbs. finely grated lemon zest",
    "Kosher salt and freshly ground black pepper",
    "1",
    "5 Tbs. mayonnaise",
    "2 tsp. prepared horseradish",
    "3/4 tsp. fresh lemon juice",
    "1/2 tsp. minced garlic",
    "1/2 tsp. tomato paste",
    "Kosher salt and freshly ground black pepper",
    "2",
    "3 Tbs. olive oil",
    "4 thick skinless haddock or cod fillets, about 6 oz. each",
    "Kosher salt and freshly ground black pepper",
    "2 cups fresh flat-leaf parsley leaves, washed and dried",
    "1 lemon",
    "About 1 tsp. extra-virgin olive oil"
  ],
  "__v": 1
}