{
  "hash": "c04f1b0085a01bc7500f24f3a5f2adbf5546d912",
  "title": "Southwestern Quinoa and Black Bean Casserole",
  "image": "http://dagzhsfg97k4.cloudfront.net/wp-content/uploads/2013/05/quinoa-black-bean-6.jpg",
  "href": "http://pinchofyum.com/southwestern-quinoa-and-black-bean-casserole",
  "firstAdded": "2014-12-21T18:11:19.386000",
  "users": [
    null
  ],
  "keywords": [
    "garlic",
    "onion",
    "jalapenos",
    "seeds",
    "ribs",
    "oil",
    "black",
    "beans",
    "rinsed",
    "broth",
    "quinoa",
    "cayenne",
    "pepper",
    "chili",
    "cumin",
    "bell",
    "peppers",
    "red",
    "yellow",
    "mexican",
    "cheese",
    "green",
    "onions"
  ],
  "directions": [
    "0",
    "Black beans: Heat oil in a large skillet over medium-high heat. Add the garlic, onion, and jalapeno, sauteing for 4 minutes and stirring occasionally. Stir in broth and black beans. Bring mixture to a boil and cook for 5 minutes. Mash beans to desired consistency. I like to make them a little more like refried beans while still leaving some of the beans whole. The mixture should be thick, not watery. If you still have a lot of moisture, let it cook out by keeping it on the heat for another few minutes. Taste and season with salt.",
    "Quinoa: In a dry nonstick skillet over medium high heat, toss and toast the cooked quinoa with the cayenne, chili powder, cumin, and salt for 1-2 minutes. Taste and season with salt. Set aside.",
    "Peppers: In the same dry nonstick skillet over medium high heat, place the diced peppers and do NOT stir. This allows the peppers to get a brown roasted look on the outside. Wait for 2-3 minutes before stirring, then let them \"roast\" for another few minutes before removing from the heat.",
    "Assemble: Preheat oven to 375 degrees. Spoon black bean mixture into a glass baking dish coated with cooking spray. Top with quinoa, bell peppers, and cheese. Cover with foil and bake for 20 minutes. Remove foil and bake for another 10 minutes, or until the top layer of cheese was golden and bubbly. Sprinkle with green onions and let cool for at least 10 minutes (otherwise it will be too runny). Serve with sour cream, tortilla chips, on tacos, on a salad, or just eat it plain!"
  ],
  "ingredients": [
    "0",
    "3 large cloves garlic, minced",
    "1 onion, minced",
    "2 jalapenos, seeds and ribs removed, minced",
    "1 tablespoon oil",
    "4½ cups cooked black beans, rinsed",
    "1¼ cup vegetable broth",
    "2 cups cooked quinoa",
    "½ teaspoon cayenne pepper",
    "1 teaspoon chili powder",
    "1 teaspoon cumin",
    "4 bell peppers, diced (mine were red and yellow)",
    "1¼ cup shredded Mexican cheese",
    "sliced green onions"
  ],
  "__v": 1
}