{
  "hash": "7cd1e4a91d456ab0001cf0de3189c9be8f8ccfc5",
  "title": "PREV RECIPENEXT RECIPE\nLemon-Blueberry Bread",
  "image": "http://food.fnr.sndimg.com/content/dam/images/food/fullset/2015/4/21/0/YW0605H_Lemon-Blueberry-Bread_s4x3.jpg.rend.hgtvcom.616.462.suffix/1429668777957.jpeg",
  "href": "http://www.foodnetwork.com/recipes/trisha-yearwood/lemon-blueberry-bread-2774080",
  "extension": "Chrome",
  "firstAdded": "2017-08-02T19:17:40.707000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "reheat the oven to 350 degrees F. Grease a 4-by-8-by-2-inch loaf pan.",
    "Toss the blueberries in 2 tablespoons of the flour in a medium bowl and set aside.",
    "Beat together the butter, granulated sugar, eggs, lemon zest and lemon juice in the bowl of an electric mixer. Sift together the baking powder, 1 teaspoon salt and remaining 1 1/2 cups flour in a medium bowl. Add the flour mixture and milk to the butter mixture in alternating batches, beginning and ending with the flour. Fold in the pecans and blueberries. Pour the batter into the prepared pan and bake until a toothpick inserted in the center of the loaf comes out clean, about 1 hour 10 minutes. Cool for 10 minutes in the pan, then turn out onto a wire rack.",
    "For the glaze: Stir together 2 tablespoons lemon juice with the confectioners' sugar in a small bowl until completely smooth. Reserve the remaining lemon juice for another use. Drizzle the glaze over the top of the loaf while it is still warm, allowing it to drip down the sides. Serve the loaf warm or at room temperature."
  ],
  "ingredients": [
    "0",
    "5 tablespoons unsalted butter, melted, plus more for greasing the pan",
    "1 cup fresh blueberries",
    "1 1/2 cups plus 2 tablespoons all-purpose flour",
    "1 cup granulated sugar",
    "2 large eggs",
    "1 lemon, zested and juiced (about 3 tablespoons of each)",
    "1 teaspoon baking powder",
    "Kosher salt",
    "1/2 cup milk",
    "1/2 cup chopped pecans"
  ],
  "__v": 1
}