{
  "hash": "cc5615ec29ce841a38b1551ffc76444955b08b14",
  "title": "CREAMY AVOCADO BANANA GREEN SMOOTHIE",
  "image": "https://minimalistbaker.com/wp-content/uploads/2017/10/CREAMY-Avocado-Green-Smoothie-5-ingredients-GREEN-SO-healthy-satisfying-vegan-banana-plantbased-smoothie-greensmoothie-avocado-glutenfree-180.jpg",
  "href": "https://minimalistbaker.com/creamy-avocado-banana-green-smoothie/",
  "extension": "",
  "firstAdded": "2018-04-30T16:51:49.904000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To a high-speed blender, add frozen banana, avocado, protein powder of choice, greens, and dairy-free milk. At this time, add any desired add-ins, such as adaptogens, seeds, or additional fruits and vegetables (such as berries or cucumbers).",
    "Blend on high until creamy and smooth, scraping down sides as needed. If smoothie is too thick, add more dairy-free milk to thin. If too thin, add more frozen banana or avocado.",
    "Taste and adjust flavor as needed, adding more banana for sweetness, avocado for creaminess, or greens for vibrant green color. Protein powder can also be used to add more sweetness (depending on brand / flavor).",
    "Divide between serving glasses and enjoy! Best when fresh, though leftovers will keep covered in the refrigerator up to 24 hours or in the freezer up to 2 weeks."
  ],
  "ingredients": [
    "0",
    "SMOOTHIE",
    "1 large ripe, peeled, sliced, + frozen banana (120 g)",
    "1/4 - 1/2 ripe avocado (40-80 g) (more avocado = creamier, thicker smoothie)",
    "1 scoop (~15 g) plain or vanilla protein powder (see my Protein Powder Guide here)",
    "1 large handful (~70 g) greens of choice (spinach, kale, rainbow chard // I like mine frozen)",
    "3/4 - 1 cup (180-240 ml) unsweetened plain almond milk (or any dairy-free milk)",
    "ADD-INS optional",
    "1 Tbsp (5 g) seed of choice (hemp, flax, sesame, sunflower, chia, etc.)",
    "1/2 tsp adaptogen of choice (maca, ashwagandha, etc.)",
    "1/2 cup (50 g) sliced frozen (or fresh) cucumber or berries (organic when possible)"
  ],
  "__v": 1
}