{
  "hash": "be7f7b1f43ad8aaa3e182a69b4fb68a1551ee023",
  "title": "Garlic Butter Shrimp and Quinoa",
  "image": "http://cdn.pinchofyum.com/wp-content/uploads/2014/01/shrimp-and-quinoa-11.jpg",
  "href": "http://pinchofyum.com/garlic-butter-shrimp-quinoa",
  "extension": "Firefox",
  "firstAdded": "2016-04-06T01:00:26.865000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "onion",
    "garlic",
    "divided",
    "uncooked",
    "quinoa",
    "chili",
    "chicken",
    "broth",
    "salted",
    "butter",
    "raw",
    "tailon",
    "shrimp",
    "salt",
    "pepper",
    "parsley",
    "lemon",
    "juice"
  ],
  "directions": [
    "0",
    "Heat the oil in a large nonstick pot over medium high heat. Add the onion and saute until softened, about 5 minutes. Add 2 teaspoons of the garlic and saute for 1 minute, stirring constantly to prevent burning. Add the uncooked quinoa and ½ teaspoon chili powder. Sprinkle with salt and pepper. Saute for another 1 minute to add flavor to the quinoa. Add the broth, bring to a boil, cover and cook for 15-20 minutes. When the quinoa is done, it will be soft throughout. Fluff with a fork and toss with fresh minced parsley.",
    "While the quinoa is cooking, heat 1 tablespoon butter in a large skillet over medium high heat. When the pan is hot and the butter is melted, add the shrimp and sprinkle with the remaining ½ teaspoon chili powder directly in the pan. Season with salt and pepper and saute until no longer translucent and golden brown on the outside. Just at the end of the saute, add 1 teaspoon garlic and swirl around in the pan until the garlic is very fragrant.",
    "Melt the remaining 5 tablespoons butter with the 2 teaspoons garlic to make a sauce for drizzling (for this, crushed garlic or garlic paste would work really well but minced is also fine).",
    "Serve the quinoa and shrimp together in one dish, topping with fresh chopped parsley and lemon juice if desired. When the butter is melted and cooled slightly, drizzle over the shrimp and quinoa. Serve immediately, while still hot."
  ],
  "ingredients": [
    "0",
    "1 tablespoon olive oil",
    "½ cup finely chopped onion",
    "5 teaspoons minced garlic, divided",
    "2 cups uncooked quinoa",
    "1 teaspoon chili powder, divided",
    "4 cups vegetable or chicken broth",
    "6 tablespoons salted butter, divided",
    "1 pound raw tail-on shrimp",
    "salt and pepper to taste",
    "fresh parsley for serving",
    "fresh lemon juice for serving"
  ],
  "__v": 1
}