{
  "hash": "5d4376b1b87f9abebf40234367cf3b1bfc3e7073",
  "title": "IMMUNE-BOOSTING VEGETABLE SOUP AND BROTH",
  "image": "http://cdn.averiecooks.com/wp-content/uploads/2014/01/immuneboostingsoup-11.jpg",
  "href": "http://www.averiecooks.com/2014/01/immune-boosting-vegetable-soup-and-broth.html",
  "extension": "Chrome",
  "firstAdded": "2016-06-22T19:23:15.027000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS:",
    "In a large stockpot (I used a large Le Creuset Cast-Iron Dutch Oven), combine all ingredients through black pepper.",
    "Soup may be salted before, during, or after simmering; your choice when you want to salt it. I don't salt the whole pot and let each family member salt their own bowl, to taste.",
    "Fill pot with water, about 6 quarts, leaving about 1 inch headspace.",
    "Simmer covered over medium heat for about 1 hour. Taste soup and based on your preference for ginger intensity, remove the piece of ginger and discard.",
    "Simmer soup for about 90 to 120 minutes total or until all vegetables are very soft and flavors have married. During simmering, if broth level looks low or is reducing too much, add a few additional cups of water, as needed.",
    "Serve immediately. I drain about 2 quarts worth of broth, and the rest is vegetable soup. Soup will keep airtight in the refrigerator for up to 1 week, or in the freezer for up to 6 months. Optionally, add other vegetables, noodles, proteins, etc. based on taste preference."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS:",
    "3 carrots, peeled and chopped into 1-inch chunks",
    "1 medium/large sweet white onion, peeled and chopped into 1-inch chunks",
    "1 medium/large leek, peeled and chopped into 1-inch chunks; use white and pale green parts, discard dark green or leafy parts",
    "1 baby bok choy, chopped into 1-inch chunks; discard top portion of jagged leaves (may substitute by using about half of full-size bok choy)",
    "2 medium or 1 large sweet potatoes or yams, unpeeled and chopped into 1-inch chunks",
    "8 ounces white mushrooms, stems removed and quartered",
    "juice of 1 medium/large lemon",
    "2 to 3-inch piece peeled fresh ginger, added whole and removed midway through simmering (1 tablespoon ground ginger may be substituted)",
    "2 to 3 tablespoons coconut oil",
    "1 tablespoon ground turmeric",
    "1 tablespoon ground black pepper",
    "salt, to taste; add before, during, or after simmering",
    "about 6 quarts water, or to nearly the top of your pot, leaving about 1-inch headspace"
  ],
  "__v": 1
}