{
  "hash": "404137f477721bc24e2add7cf3d01481a21e3aa2",
  "title": "Chicken Bacon Lettuce Sandwich",
  "image": "http://munchies-images.vice.com/wp_upload/IMG_6188.jpg?crop=1xw:0.6xh;*,*&resize=1200:*",
  "href": "https://munchies.vice.com/en/recipes/chicken-bacon-lettuce-sandwich",
  "extension": "Chrome",
  "firstAdded": "2016-09-27T19:44:07.168000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a small bowl, mix the cream cheese, chives, horseradish, 1 teaspoon olive oil, the lemon zest and juice, salt, and pepper. Refrigerate the horseradish sauce until ready to use.",
    "In a small saucepan, bring the vinegar, sugar, and 1/2 cup|100 ml water to a boil. Stir to dissolve the sugar, then pour over the cucumber in a container. Let sit for about 10 to 15 minutes to cool.",
    "Heat a large skillet over medium. Add the bacon and cook, flipping once, until crisp, 10 to 12 minutes. Transfer bacon to a paper towel-lined plate and wipe the skillet clean. Alternatively, heat the oven to 375°F|190°C and place bacon in an even layer on a parchment paper-lined baking sheet. Cook bacon until crisp, about 10 minutes.",
    "Meanwhile, combine the parmesan cheese, paprika, bread, salt, pepper, and nutmeg in a food processor and pulse until fine.",
    "Place flour, eggs, and breadcrumbs in separate shallow dishes. Season chicken with salt and pepper. Working with 1 piece at a time, dredge chicken in flour, then dip in eggs; coat in breadcrumbs and transfer to a plate.",
    "Heat remaining 1 tablespoon|4 ml oil and the butter in the skillet over medium-high. Add the chicken and cook, flipping once, until golden and cooked through, about 8 minutes. Transfer to a cutting board and let rest for 10 minutes before slicing.",
    "To assemble your sandwich, cut the ends off the baguette and slice it in half crosswise, then slice each in half lengthwise. Spread the horseradish sauce between each baguette, then top with chicken slices, bacon, beet greens, and pickled cucumber. Place the other half of the baguette on top, slice crosswise into thirds, and enjoy."
  ],
  "ingredients": [
    "0",
    "6 tablespoons cream cheese",
    "2 tablespoon chives, thinly sliced",
    "2 tablespoon prepared horseradish",
    "1 teaspoon plus 1 tablespoon olive oil",
    "zest and juice of 1 lemon",
    "kosher salt and freshly ground black pepper, to taste",
    "3/4 cup white vinegar",
    "1/2 cup granulated sugar",
    "1 cucumber, thinly sliced",
    "6 slices bacon",
    "1 cup freshly grated parmesan cheese",
    "1 tablespoon smoked paprika",
    "1 loaf stale rustic bread 1 pound, torn into pieces",
    "freshly grated nutmeg, to taste",
    "1 cup all-purpose flour",
    "3 large eggs, lightly beaten",
    "2 chicken breasts, butterflied and pounded out slightly",
    "3 tablespoons unsalted butter",
    "1 baguette",
    "beet greens, for serving"
  ],
  "__v": 1
}