{
  "hash": "072db1f66cf4f43997d90de959243552cf14fa0e",
  "title": "izcocho de piña colada",
  "image": "http://4.bp.blogspot.com/-HCqiDbgrwpE/VYj6EQbM3eI/AAAAAAAAC9c/UK7v9GZOq_E/s600/DSC_1808.JPG",
  "href": "http://cocina.facilisimo.com/blogs/recetas-postres/bizcocho-de-pina-colada_1679434.html",
  "extension": "Chrome",
  "firstAdded": "2015-06-25T16:39:58.636000",
  "users": [
    null
  ],
  "keywords": [
    "ingredientes",
    "grs",
    "leche",
    "condensada",
    "coco",
    "rallado",
    "rodajas",
    "pia",
    "jugo",
    "chorren",
    "pequeo",
    "ron",
    "unos",
    "esto",
    "opcional",
    "aceite",
    "girasol",
    "harina",
    "repostera",
    "sobre",
    "levadura",
    "royal"
  ],
  "directions": [
    "0",
    "Elaboración:",
    "Lo primero que haremos sera moler un poco mas el coco rallado para que quede un poco mas fino, lo podemos hacer en un robot. Una vez molido el coco echamos las rodajas de piña y la trituramos también. Reservamos.",
    "En un bol ponemos la leche condensada y vamos echando los huevos uno a uno, batimos bien con el batidor eléctrico, (yo lo hice en la KA) A continuación, añadimos el aceite de girasol y el ron y seguimos batiendo unos minutos. Decir que lo he probado a hacer sin ron y queda igual de rico.",
    "Echamos la mezcla de coco y piña y lo integramos muy bien. Por último añadimos la harina cernida con la levadura.",
    "Echamos la mezcla en un molde untado de mantequilla y espolvoreado de harina, y metemos en el horno precalentado con calor arriba y abajo durante unos 35 minutos, sacamos y dejamos enfriar unos minutos hasta volcarlo en una fuente.",
    "Preparamos el glaseado poniendo el azúcar molido en un bol con las cuatro cucharadas de jugo de piña, batimos enérgicamente con el batidor de mano y se lo echamos por encima al bizcocho.",
    "Ya lo tenemos listo para degustarlo, espero que os guste."
  ],
  "ingredients": [
    "0",
    "Ingredientes:",
    "300 grs. de leche condensada.",
    "100 grs. de coco rallado:",
    "6 rodajas de piña en su jugo.",
    "1 chorreón pequeño de ron, unos 30 ml. (esto es opcional)",
    "100 ml. de aceite de girasol.",
    "160 grs. de harina de repostería.",
    "1 sobre de levadura royal."
  ],
  "__v": 1
}