{
  "hash": "45f715e442ecc6bdc0cbbb3cc7005478a619ce0a",
  "title": "Potato & cauliflower curry",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/1191_1_1403175936_lrg.jpg",
  "href": "http://www.jamieoliver.com/recipes/vegetables-recipes/potato-cauliflower-curry/",
  "extension": "Chrome",
  "firstAdded": "2015-07-09T08:19:14.572000",
  "users": [
    null
  ],
  "keywords": [
    "oil",
    "onions",
    "garlic",
    "ginger",
    "chipped",
    "mustard",
    "seeds",
    "cumin",
    "tomatoes",
    "curry",
    "leaves",
    "coriander",
    "tumeric",
    "cayenne",
    "pepper",
    "maris",
    "piper",
    "floury",
    "potatoes",
    "thickly",
    "green",
    "chillies",
    "deseeded",
    "cauliflower",
    "florets",
    "larger",
    "potato",
    "greekstyle",
    "yogurt",
    "serve",
    "parathas",
    "chapati",
    "flour",
    "extra",
    "dusting",
    "butter"
  ],
  "directions": [
    "0",
    "For the paratha dough, combine the chapati flour in a large bowl with ¾ teaspoon salt and about 200ml cold water, then knead for 10–12 minutes. Shape into a ball, cover with a damp tea towel and leave to rest.",
    "Heat most of the vegetable oil in a pan over a medium heat and sauté the onion, garlic and ginger, stirring, for 6–8 minutes, until softening. With a slotted spoon, remove the onion mixture to a bowl and set aside.",
    "Toast the mustard and cumin seeds in a dry pan over a medium heat for 30 seconds, stirring constantly with a wooden spoon, until fragrant. Transfer to a large saucepan with the rest of the vegetable oil, tomatoes, curry leaves and remaining spices. Cook for a further 5 minutes over a medium heat.",
    "Add the reserved onion mixture, potatoes and chillies and season generously with salt and pepper. Pour in about 600ml water, or enough to just cover the mixture. Bring to a simmer over a low heat, cover with a lid and continue to simmer for 8–10 minutes. Add the cauliflower and cook for another 8–10 minutes, or until the sauce has thickened and the potatoes and cauliflower are tender.",
    "Meanwhile, cook the parathas. Place a flat, cast-iron, Indian-style tava over a medium-high heat. If you don't have one of these, use a frying pan or flat griddle. Divide the dough into 6–8 balls. Lightly flour a flat surface and roll the first ball into a 12cm circle. Lightly brush with the melted butter and place on the hot tava or pan. Cook for a few minutes on each side, or until the bread begins to blacken and blister. Repeat with the remaining dough.",
    "Serve immediately with the curry and a bowl of yoghurt on the side."
  ],
  "ingredients": [
    "0",
    "3 tbsp vegetable oil",
    "2 onions, sliced",
    "4 cloves of garlic, chopped",
    "6cm piece of ginger, peeled and chipped",
    "1 tsp mustard seeds",
    "1 tsp cumin seeds",
    "3 tomatoes, grated",
    "6 curry leaves",
    "1 tsp ground coriander",
    "1 tsp ground cumin",
    "1 tsp ground tumeric",
    "1/2 tsp cayenne pepper",
    "1 kg maris piper potatoes, or any other floury potatoes thickly diced",
    "1-2 green chillies, deseeded and sliced",
    "1 large cauliflower, cut into florets just larger than the potato",
    "Greek-style yogurt, to serve",
    "For the Parathas",
    "300 g chapati flour, plus extra for dusting",
    "2 tbsp butter, melted"
  ],
  "__v": 1
}