{
  "hash": "308bbb97646ad0b00c5bddfc006c716900e174b3",
  "title": "BAKED SALMON CAKES",
  "image": "https://www.skinnytaste.com/wp-content/uploads/2013/12/Baked-Salmon-Cakes-with-Avocado-Dip-550x825.jpg",
  "href": "https://www.skinnytaste.com/baked-salmon-cakes/",
  "extension": "Chrome",
  "firstAdded": "2017-12-01T13:30:51.691000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "Season salmon with salt. Heat a large sauté pan over medium-high heat; when hot lightly spray with oil and add the salmon. Cook until browned on one side, about 4 to 5 minutes then turn and cook an additional 4 to 5 minutes or until salmon easily flakes. Set aside on a dish to cool.",
    "Add the olive oil to the pan, then add the the onion, celery, red and yellow bell peppers, parsley, capers, hot sauce, Old Bay seasoning, 1/2 teaspoon kosher salt, and 1/2 teaspoon pepper in a large saute pan over medium-low heat and cook until the vegetables are soft, approximately 18 to 20 minutes. Set aside to cool to room temperature.",
    "Flake the salmon into a large bowl. Add the bread crumbs, mayonnaise, yogurt, mustard, and eggs. Add the vegetable mixture and mix well. Cover and chill in the refrigerator for 30 minutes, this will make them easier to shape and become less sticky."
  ],
  "ingredients": [
    "0",
    "gredients:",
    "1/2 pound wild Alaskan salmon filet, fresh or frozen (if frozen thaw overnight in the refrigerator)",
    "kosher salt, to taste",
    "olive oil cooking spray",
    "1 tbsp olive oil",
    "Kosher salt and freshly ground black pepper",
    "3/4 cup small-diced red onion (1 small onion)",
    "1 1/2 cups small-diced celery (4 stalks)",
    "1/2 cup small-diced red bell pepper (1 small pepper)",
    "1/2 cup small-diced yellow bell pepper (1 small pepper)",
    "1/4 cup minced fresh flat-leaf parsley",
    "1 tablespoon capers, drained",
    "1/4 teaspoon hot sauce",
    "1 1/2 tsp Old Bay seasoning",
    "1 cup seasoned breadcrumbs",
    "3 tbsp light mayonnaise",
    "3 tbsp fat free Greek yogurt",
    "1 tsp Dijon mustard",
    "1 large egg, lightly beaten",
    "3 large egg whites, lightly beaten"
  ],
  "__v": 1
}