{
  "hash": "e7f1c3708faf73c8baf022fe66e2f17663bcdee3",
  "title": "Butterscotch",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2008/03/how-to-make-butterscotch-vertical-a-600.jpg",
  "href": "http://www.simplyrecipes.com/recipes/how_to_make_butterscotch/",
  "firstAdded": "2015-10-05T22:39:04.942000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "butter",
    "tightly",
    "dark",
    "brown",
    "sugar",
    "whipping",
    "cream",
    "ultrapasteurized",
    "vanilla",
    "kosher",
    "salt"
  ],
  "directions": [
    "0",
    "Before you begin, make sure you have everything ready to go - the cream and the brown sugar next to the pan, measured and waiting. Making butterscotch is a fast process that cannot wait for hunting around for ingredients.",
    "In a large and wide pot, melt butter over low to medium heat. Just before butter is melted, add all dark brown sugar at once and stir with wooden spoon until sugar is uniformly wet.",
    "Stir infrequently until mixture goes from looking grainy to molten lava. Make sure to get into the corners of your pot, and watch closely to notice how the mixture changes. It will take about 3 to 5 minutes.",
    "Right before you add the cream, the caramelizing brown sugar will begin to look and feel more like liquid and less like thick wet sand.",
    "At this point add all the cream at once and replace your spoon with a whisk. Lower heat a little and whisk cream into mixture. When liquid is uniform, turn heat back to medium and whisk every few minutes for a total of 10 minutes.",
    "After liquid has been boiling on the stove for its 10 minutes, turn heat off and let rest for a minute or two before transferring into a heatproof storage vessel. Cool to room temperature.",
    "When butterscotch liquid is room temperature, take a small taste. It's important to know what cooked brown sugar and butter tastes like, and what happens when transforming that flat sweetness into real butterscotch flavor. Whisk in half the salt and vanilla extract. Taste again. Add more salt and vanilla extract until the marvelous taste of real butterscotch is achieved.",
    "Chill butterscotch sauce"
  ],
  "ingredients": [
    "0",
    "1# unsalted butter",
    "8 cups tightly packed dark brown sugar",
    "6 cups heavy whipping cream (not ultra-pasteurized)",
    "4 oz vanilla extract",
    "8 teaspoons kosher salt"
  ],
  "__v": 3
}