{
  "hash": "863319c82473958f6b14d091cb51b8776259dfd2",
  "title": "Turmeric Rice With Tomatoes",
  "image": "https://static01.nyt.com/images/2018/03/21/dining/21ottorex2/merlin_135414816_bec2b321-e454-4804-9d0b-d2090b70ed47-articleLarge.jpg",
  "href": "https://cooking.nytimes.com/recipes/1019229-turmeric-rice-with-tomatoes?emc=edit_NN_p_20190329&nl=morning-briefing&nlid=62318526ction%3DaBreak&section=aBreak&te=1",
  "extension": "Chrome",
  "firstAdded": "2019-03-29T18:48:36.259000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium-size deep skillet with a tight-fitting lid, combine garlic, cardamom, thyme, 3 tablespoons oil and the lemon peel strips. Turn heat to medium-low and gently cook for 5 to 6 minutes, stirring often, until garlic just begins to soften and turn golden.",
    "Add turmeric, tomatoes and 1 1/4 teaspoons salt and cook 3 to 4 minutes more, stirring occasionally, until the tomatoes begin to blister, taking care not to break them apart. Add rice, stock (or water) and a generous grind of pepper and gently stir to combine. Bring to a gentle simmer, then cover the pan with a clean tea towel and seal with the lid, securing the towel edges well over the lid so they don’t catch fire.",
    "Reduce heat to very low and let cook undisturbed 15 minutes. Remove from the heat, leaving the lid on, and let rest 5 minutes. Remove lid and towel and use a large fork to gently fluff rice and evenly disperse the tomatoes. Gently stir in lemon juice, remaining 2 tablespoons oil and parsley. Let rest 5 minutes more before serving."
  ],
  "ingredients": [
    "0",
    "5",
    "garlic cloves, thinly sliced",
    "10",
    "cardamom pods, crushed (keep a few of the pods and all the seeds)",
    "1 ½",
    "tablespoons fresh thyme leaves",
    "5",
    "tablespoons/75 milliliters olive oil, divided",
    "1",
    "lemon, yellow peel shaved into 5 wide strips, and fruit squeezed to get 2 tablespoons juice",
    "1",
    "teaspoon ground turmeric",
    "1",
    "pint/400 grams cherry tomatoes",
    "Salt and black pepper",
    "1 ⅔",
    "cups/300 grams basmati rice",
    "2",
    "cups/500 milliliters vegetable stock or water",
    "¼",
    "cup/5 grams loosely packed parsley leaves, roughly chopped"
  ],
  "__v": 1
}