{
  "hash": "4a5acb54c64c42b8344c3f1955987e401f009f7e",
  "title": "CHEESECAKE FACTORY BROWN BREAD",
  "image": "https://i2.wp.com/www.kitchentrials.com/wp-content/uploads/2017/12/Cheesecake-Factory-honey-wheat-brown-bread-recipe.jpg?resize=320%2C320&ssl=1&is-pending-load=1",
  "href": "https://www.kitchentrials.com/2017/12/18/cheesecake-factory-brown-bread/",
  "extension": "Chrome",
  "firstAdded": "2020-03-01T15:55:42.813000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium bowl, mix together the warm water, sugar, and yeast. Set aside for 5 minutes to proof (it will become foamy on top).",
    "Using the paddle attachment in your stand mixer, whisk together the bread flour, whole wheat flour, cocoa powder, espresso powder, and salt. Add the yeast mixture, butter, honey, and molasses. Mix on medium-low speed until combined. The dough will be fairly thick and a little tacky.",
    "Swap out to the dough hook, and knead on medium speed for 8 to 10 minutes. This dough is thicker than your standard white bread, so it will be a little tacky, but will not pull or stick to the bottom of the bowl while kneading. If it feels too sticky, like it would stick to your fingers when trying to shape, add a bit more flour (see notes for more info).",
    "Place the dough in a large, lightly oiled bowl and cover tightly with plastic wrap. Let rise is a warm spot for two hours, until doubled in size.",
    "Divide the dough into 6 equal sized pieces, and shape into mini-baguette style logs, roughly 6\" long and 2\" wide. See below notes for directions on this.",
    "Place the cornmeal on a plate (if using), and set the loafs in it to lightly coat the bottom. Place the loafs on a lined baking sheet, with lots of space between them. Lightly wet the top of the loafs with your hand and some water, then sprinkle on a light dusting of oats. Spray the tops of the loafs with Pam (to keep the wrap from sticking), then cover VERY loosely with plastic wrap. Set in a warm place and let rise for another 60 to 90 minutes, until nearly doubled in size again.",
    "Bake in a 350ºF oven for 25 to 35 minutes. The crust will be soft and squishy to the tough. Bread is cooked when the internal temperature is 190ºF, so feel free to use an instant read thermometer to check if you're not sure.",
    "Let cool for at least 15 minutes before slicing. If baking ahead of time, store tightly wrapped in plastic wrap once completely cooled, for up to 2 days, though it's best eaten the day baked. Gently warm in the oven before serving."
  ],
  "ingredients": [
    "0",
    "1½ cups warm water (105ºF)",
    "1 tbsp sugar",
    "2¼ tsp instant dry yeast (1 package)",
    "2 cups bread flour",
    "1¾ cups whole wheat flour",
    "1 tbsp cocoa powder",
    "2 tsp espresso powder (or coffee)",
    "1 tsp salt",
    "2 tbsp butter, softened",
    "¼ cup honey",
    "2 tbsp molasses",
    "¼ cup cornmeal, for dusting the bottom of the shaped (not baked) loafs (optional)",
    "oats, for dusting the top of the shaped (not baked) loafs (optional)"
  ],
  "__v": 1
}