{
  "hash": "398aecbc5204ba8a01c9de81279262dfdd79729c",
  "title": "Smoky Paprika Rubbed Beef Tenderloin with Roasted Root Vegetables",
  "image": "https://embed.widencdn.net/img/beef/hecldoskff/960x720px/smoky-paprika-rubbed-beef-tenderloin-with-roasted-root-vegetables-square.tif?keep=c&u=7fueml",
  "href": "https://www.beefitswhatsfordinner.com/recipes/recipe/2535/smoky-paprika-rubbed-beef-tenderloin-with-roasted-root-vegetables",
  "extension": "Firefox",
  "firstAdded": "2019-09-07T04:33:13.287000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cooking:",
    "Heat oven to 425°F. Place seasoning ingredients except olive oil in food processor; cover and process until parsley is chopped, stopping and scraping side of container as needed. With the motor running, slowly add oil through the opening in cover, processing just until combined.",
    "Press 3 tablespoons seasoning mixture evenly onto all surfaces of beef roast. Reserve remaining seasoning mixture.",
    "Place roast on rack in shallow roasting pan. Insert ovenproof meat thermometer so tip is centered in thickest part of beef, not resting in fat. Do not add water or cover. Roast in 425°F oven 35 to 40 minutes for medium rare; 45 to 50 minutes for medium doneness.",
    "Meanwhile combine remaining seasoning mixture, red potatoes, sweet potatoes and cipollini in large bowl; toss to coat. Transfer vegetables to metal baking pan. Place in oven with beef roast. Roast 35 to 45 minutes or until vegetables are tender and lightly browned. Sprinkle with 1 tablespoon parsley and salt, as desired.",
    "Remove roast when meat thermometer registers 135°F for medium rare; 145°F for medium. Transfer roast to carving board and immediately sprinkle with remaining 1 tablespoon parsley. Tent loosely with aluminum foil. Let stand 15 to 20 minutes. (Temperature will continue to rise about 10°-15°F to reach 145°F for medium rare; 160°F for medium.)",
    "Carve roast into slices; season with salt, as desired. Serve with vegetables."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "1 beef Tenderloin Roast Center-Cut (2 to 3 pounds)",
    "1-1/2 pounds baby red potatoes, cut in half",
    "1-1/2 pounds sweet potatoes, peeled, cut into 1-1/2 x 1-inch pieces",
    "1 pound cipollini onions, trimmed, blanched, peeled",
    "2 tablespoons chopped parsley",
    "Salt",
    "Seasoning:",
    "1 cup tightly packed parsley leaves",
    "4 teaspoons smoked paprika",
    "2 large garlic cloves, minced",
    "1/2 teaspoon ground red pepper",
    "1/2 teaspoon salt",
    "1/4 cup olive oil"
  ],
  "__v": 1
}