{
  "hash": "74e600cfd0391a7fe26fcf6a95d601d82dbee23e",
  "title": "Salted Caramel Chocolate Cheesecake Slices [Vegan, Gluten-Free]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/05/caramel.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/salted-caramel-chocolate-cheesecake-slices/",
  "extension": "Chrome",
  "firstAdded": "2015-06-03T20:34:52.295000",
  "users": [
    null
  ],
  "keywords": [
    "dates",
    "roughly",
    "mixed",
    "used",
    "milled",
    "seeds",
    "tahini",
    "cocoa",
    "extra",
    "dust",
    "cashew",
    "nuts",
    "soaked",
    "hour",
    "almond",
    "milk",
    "vanilla",
    "salt",
    "dairyfree",
    "chocolate",
    "coconut",
    "oil"
  ],
  "directions": [
    "0",
    "Add all of the ingredients together into a high-powered food processor and blend until combined. Press into the bottom of whatever pan you’re using (see note).",
    "1",
    "In a food processor, blend all of the filling ingredients together into a thick and creamy mixture. Scoop out over the base, smooth out the top, and place in the freezer.",
    "2",
    "Whilst the filling is in the freezer, melt the chocolate and coconut oil over a bain-marie, stirring well. Once smooth and fully melted, remove from the heat and pour over the cheesecake filling and return to the freezer. Freeze for at least ten minutes to allow the topping to set fully.",
    "When you are ready to serve, remove from the freezer and container. Allow to defrost for around ten minutes, then using a very sharp knife, cut into two slices (tip: a sawing action works best to avoid cracking the topping), and serve!"
  ],
  "ingredients": [
    "0",
    "3 ounces dates, roughly chopped",
    "1 tbsp mixed seeds (I used milled seeds)",
    "1 tbsp tahini",
    "1 tbsp cocoa powder, plus extra to dust",
    "1",
    "2 1/2 ounces cashew nuts, soaked for at least an hour",
    "7 dates, pitted and soaked for at least an hour",
    "2 tbsp almond milk",
    "1 tbsp tahini",
    "1/4 tsp vanilla extract",
    "Pinch of ground sea salt",
    "2",
    "1 1/2 ounces dairy-free milk chocolate",
    "1 tbsp coconut oil"
  ],
  "__v": 1
}