{
  "hash": "644dea1dac3ee8ff1f90306ad7133133ae17e5f7",
  "title": "Creamy Tuscan Chicken (Paleo & Keto",
  "image": "https://cmt.azureedge.net/media/creamy_tuscan_chicken_paleo_keto_20181217124541113382gu2t1.jpg",
  "href": "https://www.copymethat.com/r/Q2RJ2k2/creamy-tuscan-chicken-paleo-keto/",
  "extension": "",
  "firstAdded": "2018-12-27T18:19:23.665000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Steps",
    "In a large saute pan over medium heat cook bacon until crisp, remove, drain oil except for 1 tablespoon.",
    "Add chicken, in batches if necessary, and cook on each side until lightly browned and cooked through, about 3 minutes per side minutes. Remove from pan.",
    "Add 2 teaspoons oil if the pan is dry. Add onion and garlic, and lower heat to medium low and cook until beginning to soften, about 5 minutes.",
    "Add in chicken stock and sundried tomato and scrape up any browned bits from the bottom of the pan and bring up to a boil.",
    "Stir in cashew cream until smooth.",
    "Add spinach, bacon and return chicken to pan and continue to cook until the sauce spinach has wilted and everything is combined. If your sauce is too thick, add a bit more chicken stock to thin it out.",
    "Serve immediately with cauli rice, pasta or zoodles.",
    "Notes",
    "If you don’t have tenders, simply slice chicken breasts in half horizontally and then slice in half to get the correct size. If using thighs leave as is.",
    "To make the cashew cream: Place 1 cup of cashews in a bowl and cover with cold water for at least an hour, or up to 8. Drain the soaked cashews and place them in a small food processor or high-speed blender. Puree with 1/4 cup water of and ½ teaspoon of salt. Blend until smooth. Keep it in the refrigerator for 3-4 days! See post for more information about cashew cream!"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 slices bacon, chopped",
    "1-½ pounds chicken thighs or chicken tenders (see note)",
    "2 teaspoons avocado oil (if needed)",
    "1 onion, sliced thin",
    "3 cloves garlic",
    "1-½ cup chicken stock",
    "½ cup Sundried tomato (packed in oil), drained and chopped roughly",
    "1/2 cup cashew cream (see note)",
    "2 cup spinach"
  ],
  "__v": 1
}