{
  "hash": "7415cb176f5b13122682f398ae9ac3d346783e1c",
  "title": "Lindsey Crozier's meat pasties",
  "image": "http://goodtoknow.media.ipcdigital.co.uk/111/000002f45/439b_orh220w334/lindsay-croziers-meat-and-potato-pasties.jpg",
  "href": "http://www.goodtoknow.co.uk/recipes/342979/Lindsey-Crozier-s-meat-pasties",
  "extension": "Chrome",
  "firstAdded": "2015-03-17T19:29:24.709000",
  "users": [
    null
  ],
  "keywords": [
    "ozg",
    "lean",
    "mince",
    "beef",
    "onion",
    "salt",
    "pepper",
    "level",
    "mixed",
    "herbs",
    "olive",
    "oil",
    "worcestershire",
    "stock",
    "cube",
    "mashed",
    "potato",
    "pastry",
    "selfraising",
    "flour",
    "block",
    "margarine",
    "water",
    "egg",
    "glaze"
  ],
  "directions": [
    "0",
    "Method",
    "Chop the onion finely and fry in a medium-sized sauce pan with the oil, when the onion is soft, add the mince.",
    "Fry the mince over a moderate heat until it turns brown. Add the herbs, pepper and salt, and a dash of Worcestershire sauce. Let this cook for 2 mins, then sprinkle in the beef stock cube. Cook for another couple of minutes so it reduces any liquid from the meat. Take off the heat and put to one side to cool slightly.",
    "To make the pastry, rub the margarine and flour together in a mixing bowl until it looks like breadcrumbs. Add the water bit by bit and start to mix with your hand - the mixture will start to stick together to form pastry.",
    "Sprinkle some flour on your rolling surface to stop the pastry from sticking, and divide into 3 equally sized balls. Roll each ball out on your floured surface to just slightly larger than the size of a small tea plate. Using a tea plate as a stencil, cut the pastry and you will be left with 3 circular pieces of pastry.",
    "Add the mash potato to the mince and mix together, divide into 3 and place in the middle of each pastry circle.",
    "Brush around the edge of your pastry with water then turn one edge across the top of the other. Crimp the edge with your fingertips to seal it.",
    "In a cup, beat the egg with a fork then brush the egg over the top of the pasties. Place on a greased tray and put in the oven (pre-heated to 160°C) on the middle shelf and bake for 15-20 mins. When golden brown remove from the oven and serve."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "8oz(250g) lean mince beef",
    "Half a large onion",
    "Salt and pepper",
    "1 level tsp of mixed herbs",
    "2tsp olive oil",
    "1tsp Worcestershire sauce",
    "1 beef stock cube",
    "11oz (300g) mashed potato",
    "For the pastry",
    "6oz (150g) self-raising flour",
    "Pinch of salt",
    "3oz (75g) block margarine",
    "2-3tbsp water",
    "1 egg to glaze"
  ],
  "__v": 1
}