{
  "hash": "90198a2e10574903c417df05d8cf7db679bdeddc",
  "title": "Peanut-Sesame Slaw with Soba Noodles",
  "image": "https://cookieandkate.com/images/2014/01/peanut-soba-noodles-slaw-recipe.jpg",
  "href": "https://cookieandkate.com/2018/peanut-soba-noodle-slaw-recipe/",
  "extension": "Firefox",
  "firstAdded": "2019-02-27T02:15:17.310000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cook the soba noodles: Bring a large pot of water to boil and cook the noodles according to package directions. Drain and rinse with cold water before returning to pot.",
    "Prepare the vegetables: This is easier in a food processor than by hand. If using a food processor, shred the cabbage and sprouts with the slicing disk, then grate the carrots using the grating disk. Or use a chef’s knife to chop the cabbage and sprouts into thin strips, then coarsely grate the carrots.",
    "Prepare the dressing: In a 2-cup liquid measuring cup or medium bowl, whisk together the dressing ingredients until smooth. If the mixture should be thick but drizzly; if it’s too thick, whisk in water in 1 tablespoon increments until it is (at which point you might need to add a little salt, to taste, since the flavors have been diluted.)",
    "In a large serving bowl, combine the cooked soba noodles, shredded cabbage and sprouts, grated carrots, and chopped green onions. Pour dressing over the vegetables and toss to coat (you may or may not need all of the dressing). For best flavor, let the slaw marinate for 20 minutes before serving.",
    "Serve slaw with a sprinkling of chopped peanuts, torn cilantro and a lime wedge. Serve with sriracha on the side, if you’d like a spicy kick. This slaw keeps very well for a few days (covered and refrigerated). Before serving, wake up the flavors with a dash of lime juice or vinegar and more fresh cilantro."
  ],
  "ingredients": [
    "0",
    "4 ounces soba noodles or whole wheat spaghetti",
    "1 very small purple or green cabbage, sliced into quarters and core removed (about 16 ounces/6 cups shredded)",
    "½ pound (about 12) Brussels sprouts, nubby ends removed, or additional cabbage (about 2 cups shredded)",
    "4 carrots, peeled",
    "1 bunch of green onions, trimmed and sliced into thin rounds"
  ],
  "__v": 1
}