{
  "hash": "6cb90f0d505895a59de4bde0913ba3a64099437c",
  "title": "Italian Butter Cookies",
  "image": "http://i0.wp.com/thetoastedsprinkle.files.wordpress.com/2012/12/cookie-swap3.jpg?resize=768%2C1024",
  "href": "http://thetoastedsprinkle.com/2012/12/12/italian-butter-cookies/",
  "extension": "Chrome",
  "firstAdded": "2016-01-23T00:35:31.928000",
  "users": [
    null
  ],
  "keywords": [
    "butter",
    "softened",
    "sugar",
    "vanilla",
    "almond",
    "flavoring",
    "approx",
    "eggs",
    "cake",
    "ran",
    "regular",
    "flour",
    "cornstarch",
    "salt",
    "water",
    "meringue",
    "cocoa"
  ],
  "directions": [
    "0",
    "Heat oven to 350F, line a baking sheet with parchment.",
    "In the bowl of a stand mixer cream butter and sugars together until light and fluffy.",
    "Beat in vanilla and eggs until incorporated (do not overmix, it will curdle).",
    "In a separate bowl whisk together the cake flour (or flour and cornstarch) and salt.",
    "With the mixer running on low, slowly add the flour mixture beating just until combined and no streaks remain.",
    "At this point the dough will be fairly soft and sticky. You can either pipe it using a 1M Wilton tip or you can roll the dough into balls, about 1 tbsp, and roll in sugar or sprinkles, or leave plain and flatten slightly with the bottom of a floured cup.",
    "Bake for 12-18 minutes, depending on the size of the cookies and how dark your pan is (my darker pan took less time). cookies will not brown significantly, if at all, but the tops should be firm to the touch. Cool on wire rack.",
    "These are traditionally filled with seedless jam, but I think that’s no fun for the holidays.",
    "1",
    "In a small saucepan bring the water to a boil. Add the sugar and stir until dissolved. Remove from heat and let cool.",
    "When the mixture cools add to a stand mixer with the meringue powder and beat on high with the whisk attachment until stiff, glossy peaks form.",
    "Meanwhile, in a separate bowl whisk together the cocoa powder and 2 cups of powdered sugar. When meringue is stiffened, gradually whisk in powdered sugar/cocoa mixture. Scrape the sides of the bowl.",
    "Switch to a paddle attachment and with mixer running on medium, gradually add the butter 1 tbsp at a time. Beating until fully incorporated and glossy.",
    "Beat in the vanilla.",
    "Add the remaining powdered sugar until the desired consistency is reached - it should resemble Oreo cookie filling. If a deeper chocolate flavor is desired, add more cocoa or beat in some melted chocolate.",
    "2",
    "When cookies have cooled pipe a small circle of filling onto the cookie and then smoosh with another cookie. Don’t pipe too much in or it’ll smoosh out the sides and the cookie won’t stay together.",
    "Dip in desired candy melts (or melted chocolate) and sprinkles. Let dry on wax paper."
  ],
  "ingredients": [
    "0",
    "12 oz butter, softened (3 sticks)",
    "6 oz sugar",
    "3 oz powdered sugar",
    "1 ½ tsp vanilla (or 1 tsp almond flavoring)",
    "4.5 oz eggs (approx 2 large eggs)",
    "1lb 2 oz cake flour (when I ran out I did approx 14 oz regular flour and 4 oz cornstarch)",
    "pinch of salt",
    "1",
    "¾ cup sugar",
    "½ cup water",
    "⅓ cup meringue powder",
    "½ cup cocoa powder",
    "1 lb powdered sugar",
    "1 tsp vanilla",
    "½ cup (1 stick) butter"
  ],
  "__v": 1
}