{
  "hash": "1ec78cc35902bfd79b0c2035a848589260bf2e8d",
  "title": "Sweet Potato and Cilantro Quesadilla with Fried Egg and Cumin Oil",
  "image": "https://d2k9njawademcf.cloudfront.net/indeximages/31644/full/sweet_potato_quesadilla_1.jpg?1403274835",
  "href": "https://food52.com/recipes/21297-sweet-potato-and-cilantro-quesadilla-with-fried-egg-and-cumin-oil",
  "extension": "Chrome",
  "firstAdded": "2015-04-22T21:37:55.278000",
  "users": [
    null
  ],
  "keywords": [
    "potatoes",
    "smoked",
    "paprika",
    "lime",
    "juice",
    "cilantro",
    "leaves",
    "eggs",
    "olive",
    "oil",
    "cumin",
    "seeds",
    "corn",
    "tortillas",
    "wedges"
  ],
  "directions": [
    "0",
    "In a medium saucepan fitted with a steamer basket, place sweet potatoes. Cover and steam sweet potatoes until tender, 6 minutes. While potatoes cook, heat 2 tablespoons oil in a large, heavy skillet over medium. Add cumin seeds and cook until toasted, 1 minute. Pour off cumin oil into a small bowl and reserve. (Do not wipe out skillet.) Crack eggs into skillet and cook, without turning, until whites are set and yolks are still runny, 2 to 3 minutes. Transfer eggs to a plate and cover with foil to keep warm. (Reserve skillet.)",
    "When potatoes are tender, transfer to a bowl with paprika and lime juice; season with salt and pepper and gently toss to coat. Divide sweet potatoes among 4 tortillas; top with cilantro and remaining tortillas. Return reserved skillet to medium-high heat. Cook quesadillas until charred in spots on both sides, about 2 minutes per side, in two batches. Serve each quesadilla topped with a fried egg, drizzled with reserved cumin oil."
  ],
  "ingredients": [
    "0",
    "2 small sweet potatoes, peeled and thinly sliced",
    "1/2 teaspoon smoked paprika",
    "1 tablespoon lime juice",
    "1/2 cup cilantro leaves",
    "4 large eggs",
    "2 tablespoons olive oil",
    "1 teaspoon cumin seeds",
    "8 small (about 6-inch) corn tortillas",
    "Lime wedges, for serving"
  ],
  "__v": 1
}