{
  "hash": "c83bb5d97a1b0e026c0d700b89ba34305b9763ae",
  "title": "30-Minute Mozzarella Stuffed Turkey Meatballs with Homemade Marinara Sauce",
  "image": "http://bakerbynature.com/wp-content/uploads/2014/10/IMG_4578-682x1024.jpg",
  "href": "http://bakerbynature.com/30-minute-mozzarella-stuffed-turkey-meatballs-with-homemade-marinara/",
  "extension": "Chrome",
  "firstAdded": "2016-06-22T20:06:06.246000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400 degrees (F). Line a large baking sheet with parchment paper; set aside.",
    "Heat 4 tablespoons of olive oil in a large skillet over medium heat. Allow the oil to simmer (you want it very hot) while you prepare the meatballs.",
    "In a large bowl combine ground turkey meat, half of the minced garlic, egg, cheese, parsley, Italian seasoning, salt and pepper, and panko. Slowly add the water, a few tablespoons at a time. The mixture should be very moist but still hold its shape when rolled into meatballs.",
    "Scoop one tablespoon of meat into a small ball. Press a piece of cheese in the center, then cover it with another piece of meat, roll to seal in the cheese. Repeat with all meat/cheese.",
    "Fry meatballs in batches in the hot oil, 2 minutes on each side.",
    "Place semi-cooked meatballs on prepared baking sheet. Once all meatballs have been panfried, place the baking sheet in the oven to bake for 10-12 minutes, or until they're cooked though.",
    "While the meatballs bake, make your marinara!",
    "Add remaining oil to the same pan the meatballs were in, then add the remaining garlic and sauté for one minute, or until the garlic is golden and fragrant. Add the crushed tomatoes, salt, pepper, sugar, seasoning and crushed red pepper flakes, mix well to combine. Simmer the sauce for 9 minutes, stirring occasionally. Season with additional salt and pepper to taste.",
    "When meatballs are done cooking, add them to the sauce, stir to coat, and serve!"
  ],
  "ingredients": [
    "0",
    "1 pound ground turkey meat",
    "5 garlic cloves, minced, divided",
    "1 egg",
    "1/2 cup freshly grated Romano cheese",
    "2 teaspoons Italian seasoning",
    "2 teaspoons fresh parsley, chopped",
    "Salt and ground black pepper, to taste",
    "1 cup whole wheat panko bread",
    "1/2 cup lukewarm water",
    "4 ounces mozzarella cheese, cut into bite sized cubes (you can use 4 (1 ounce) string cheese pieces, too)",
    "6 tablespoons olive oil, divided",
    "1 (28-ounce) can crushed tomatoes",
    "1 teaspoon salt",
    "1/2 teaspoon black pepper",
    "1/2 teaspoon sugar",
    "2 teaspoons Italian seasoning",
    "1/2 teaspoon crushed red pepper flakes"
  ],
  "__v": 1
}