{
  "hash": "4f0cecce89269e22d2ef44d36f871cd6bea8255b",
  "title": "Grilled Potato Salad with Grilled Scallion Vinaigrette",
  "image": "https://cdn.loveandlemons.com/wp-content/uploads/2018/05/IMG_12257.jpg",
  "href": "https://www.loveandlemons.com/grilled-potato-salad-scallion-vinaigrette/",
  "extension": "Chrome",
  "firstAdded": "2019-07-04T22:15:58.596000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Boil the potatoes: Fill a medium pot with room temperature water. Add a handful of salt to the water and then the potatoes. Bring the water to a rolling boil and then reduce the heat so that the water simmers. Cook until the potatoes are just fork-tender, about 15 minutes (they’ll finish cooking on the grill). Drain the potatoes, and when cool enough to handle, cut in half lengthwise.",
    "Preheat a grill or grill pan to medium heat.",
    "Make the dressing: Toss the scallions with ½ tablespoon of the oil and season with a pinch of salt. Grill until just charred, turning once, about 2 minutes. Chop and transfer to a food processor and add the vinegar, miso, mustard, sriracha, and 3 tablespoons water. Pulse until combined. Add the cilantro and the remaining 2 tablespoons oil and pulse again.",
    "Toss the potatoes generously with olive oil, salt and pepper. Grill cut side down for 5 to 6 minutes or until char marks form. Flip, and cook 5 minutes more, until the potatoes are tender and well charred. The time will depend on the size of your potatoes.",
    "Place the blueberries in a piece of foil that's large enough to contain them on the grill. Toss with a drizzle of olive oil and grill for 2 minutes or until they turn a darker blue color.",
    "Assemble the salad with the potatoes, generous dollops of the dressing, blueberries, mint, the chopped scallions, and more dollops of the dressing. Top with pickled onions, if using. Serve warm or at room temperature."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 pounds tiny potatoes or fingerling potatoes",
    "Extra-virgin olive oil, for drizzling",
    "½ pint fresh blueberries",
    "¼ cup fresh mint leaves",
    "⅓ cup pickled onions, optional",
    "2 scallions, finely chopped",
    "Sea salt",
    "Dressing:",
    "1 bunch scallions (minus the 2 scallions chopped above)",
    "2½ tablespoons extra-virgin olive oil, divided",
    "1 tablespoon champagne (or white wine) vinegar",
    "1 tablespoon white miso",
    "½ tablespoon Dijon mustard",
    "1 teaspoon sriracha or hot sauce of your choice",
    "small handful (about ¼ cup) cilantro",
    "Sea salt"
  ],
  "__v": 1
}