{
  "hash": "15df3dd027face671de0394741815c40aeb711a0",
  "title": "Garlic Lemon and Parmesan Oven Roasted Zucchini",
  "image": "http://www.cookingclassy.com/wp-content/uploads/2014/05/garlic-lemon-and-parmesan-oven-roasted-zucchini-edit+srgb..jpg",
  "href": "http://www.cookingclassy.com/2014/05/garlic-lemon-parmesan-oven-roasted-zucchini/?utm_source=feedburner&utm_medium=email&utm_campaign=Feed:+CookingClassy+(Cooking+Classy)",
  "extension": "Chrome",
  "firstAdded": "2016-05-29T11:50:17.804000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 degrees. Line a rimmed cookie sheet with aluminum foil.",
    "Cut zucchini into thick wedges or halves (cut each zucchini in half then that half in half, so you have 4 wedges from each zucchini. Next time I might try to do just halves so the parmesan bakes more evenly, plus it would be easier to add the parmesan). In a small bowl, stir together olive oil, lemon zest and garlic. Align zucchini on prepared baking sheet spacing them evenly apart. Brush olive oil mixture over tops of zucchini (working to get some of the garlic/lemon zest on each piece and not just in one spot. It clumps together a little so just spread it out). Sprinkle tops with parmesan cheese (try to get as much of it on the tops as possible, you can pick up what was sprinkled off to the sides of the zucchini and add it to the tops) and season lightly with salt and pepper. Bake in preheated oven 11 - 13 minutes then, adjust oven rack near top of oven and broil for several minutes until parmesan is golden brown. Serve warm.",
    "Recipe Source: adapted slightly from Liluna"
  ],
  "ingredients": [
    "0",
    "1 1/2 lbs zucchini (about 4 - 5 small/medium zucchini)",
    "2 Tbsp olive oil",
    "Zest of 1 small lemon (1 tsp)",
    "2 cloves garlic, crushed through a garlic crusher or finely minced",
    "3/4 cup finely shredded parmesan cheese",
    "Salt and freshly ground black pepper"
  ],
  "__v": 1
}