{
  "hash": "12a37a095f669e708899f32dd44db6453f145507",
  "title": "Vegan chocolate pancakes with cherries",
  "image": "http://cdn77-s3.lazycatkitchen.com/wp-content/uploads/2016/07/vegan-chocolate-pancakes-with-stewed-cherries-and-syrup-1000x1500.jpg",
  "href": "http://www.lazycatkitchen.com/vegan-chocolate-pancakes-with-cherries/",
  "extension": "",
  "firstAdded": "2016-08-26T22:33:02.849000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a mixing bowl, combine buckwheat flour, baking soda, baking powder and cacao powder.",
    "In another bowl, combine all wet ingredients: ¾ cup plant milk, maple syrup and lemon juice. Whisk everything together until combined.",
    "Pour wet ingredients into dry ingredients, stirring until you get a homogeneous mixture.",
    "In another bowl whisk aquafaba with a hand whisk until it’s all frothy and has lots of small air bubbles – no need to use an electric whisk here, just give your arm a bit of a workout .",
    "Fold whipped aquafaba into the pancake mixture. Check the consistency of the batter, if it’s too thick, add another splash of plant milk.",
    "Heat up a frying pan on medium heat (that’s important! I used setting 3 out of. Brush the pan with a bit of oil using a brush or an oil spray.",
    "Ladle 2 tablespoons of the pancake mix per pancake. Keep cooking each pancake until lots of little bubbles form on its surface. Let the bubbles burst before flipping the pancake to the other side (if you flip them before the bubbles burst the pancakes will be raw in the middle).",
    "Once the bubbles burst, flip each pancake gently. Fry them for a minute or two on the other side. Arrange cooked pancakes in a stack to keep warm. You can cover the stack with a piece of aluminium foil or keep it in a warm oven while making the rest.",
    "Serve with stewed cherries and cherry syrup on top."
  ],
  "ingredients": [
    "0",
    "BUCKWHEAT PANCAKES",
    "1 cup / 125 g buckwheat flour*",
    "2 tbsp raw cacao powder",
    "½ tsp gluten-free baking powder",
    "½ tsp gluten-free baking soda",
    "3 tbsp aquafaba**",
    "2-3 tbsp maple syrup",
    "2 tsp lemon or lime juice",
    "¾-1 cup of any plant milk (if using full fat coconut milk, dilute with 50% water)",
    "neutral tasting oil, for frying"
  ],
  "__v": 1
}