{
  "hash": "cad74b4ca3c776e7c74fc23daaeaf2b26a8bb519",
  "title": "Zingy Lemon Fish",
  "image": "https://cdn.ruled.me/wp-content/uploads/2017/11/zingy-lemon-fish-second.jpg",
  "href": "https://www.ruled.me/zingy-lemon-fish/",
  "extension": "Chrome",
  "firstAdded": "2018-04-15T16:59:53.192000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "On a large dinner plate mix together the almond flour, dill, chives, onion powder, garlic powder, salt, and pepper then spread evenly.",
    "Take the fresh fish fillets, one at a time, and press into the flour mix. Turn and repeat. You want to really cover them well and place on a separate plate once done. You can do this in advance and hold in the fridge until cooking.",
    "In a large pan, heat half the butter and half the lemon juice over a medium-high heat. You want it hot enough to crust the flour mix but we don’t want to burn the butter or turn the juice bitter.",
    "Let the fish cook for approximately 3 minutes. Give the pan a wriggle so the fish soaks up all the lemony butter. Don’t let your pan dry out. Add more butter or lemon juice if necessary.",
    "Place the other half of the butter and remaining lemon juice into the pan and flip the fish to cook for another 3 minutes. Again, give the pan and fish a bit of a swirl around. The coating should be nice and golden brown and you should be able to see the fish cooking through.",
    "Check if the fish is done with a fork and remove from the pan when almost done. The fish will continue to cook so we want to avoid over cooking. If you have steamed vegetables waiting pour the butter with all the crunchy bits from the coating onto your veges. It makes a lovely dressing."
  ],
  "ingredients": [
    "0",
    "7 ounces (200-grams) fresh Gurnard fish fillets",
    "3 tablespoons butter",
    "1 tablespoon lemon juice",
    "¼ cup (25 g) fine almond flour",
    "1 teaspoon dried dill",
    "1 teaspoon dried chives",
    "1 teaspoon onion powder",
    "½ teaspoon garlic powder",
    "Salt and pepper to taste"
  ],
  "__v": 1
}