{
  "hash": "d766fd3ac41b4639344ce0d05759607c8348f85f",
  "title": "Buffalo Wings",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/best-buffalo-wings",
  "firstAdded": "2015-01-23T21:21:27.122000",
  "users": [
    null
  ],
  "keywords": [
    "mild",
    "blue",
    "cheese",
    "roquefort",
    "saint",
    "agur",
    "crumbled",
    "buttermilk",
    "mayonnaise",
    "sour",
    "cream",
    "lemon",
    "juice",
    "kosher",
    "salt",
    "pepper",
    "unsalted",
    "butter",
    "hot",
    "franks",
    "cayenne",
    "oil",
    "frying",
    "cornstarch",
    "chicken",
    "wings",
    "tips",
    "drumettes",
    "flats",
    "separated",
    "celery",
    "stalks",
    "deepfry",
    "thermometer"
  ],
  "directions": [
    "0",
    "Whisk together blue cheese, buttermilk, mayonnaise, sour cream, and lemon juice in a medium bowl. Season with salt and pepper.",
    "Do Ahead: Dressing can be made up to 2 days ahead. Cover and chill.",
    "1",
    "Preheat oven to 250°. Let wings sit at room temperature 30 minutes; this will take off the chill and help them cook evenly. Meanwhile, melt butter in a small saucepan over medium heat. Whisk in hot sauce, cayenne, ½ tsp. pepper, and ¼ tsp. salt until combined. Remove pan from heat and set aside; rewarm just before tossing with wings",
    "Pour oil into a large heavy pot to a depth of 2” and fit with a deep-fry thermometer. Heat over medium-high heat until thermometer registers 375°.",
    "Meanwhile, place cornstarch in a large bowl. Season wings with salt and pepper. Working in 3 batches, dredge wings in cornstarch, shaking off excess, then carefully lower wings into oil. Fry, turning occasionally, until chicken is cooked through and crust is golden brown and very crisp, 10–12 minutes. Transfer to a wire rack set inside a rimmed baking sheet and transfer to oven to keep warm while you fry remaining wings.",
    "Transfer wings to a large bowl, add warmed sauce, and toss to coat. Serve immediately with celery sticks and blue cheese dressing for dipping.",
    "Do Ahead: Sauce can be made 1 week ahead. Let cool completely; cover and chill. Rewarm before using."
  ],
  "ingredients": [
    "0",
    "2 ounces mild blue cheese (such as Roquefort or Saint Agur), crumbled",
    "¼ cup buttermilk",
    "¼ cup mayonnaise",
    "¼ cup sour cream",
    "1 tablespoon fresh lemon juice",
    "Kosher salt, freshly ground pepper",
    "1",
    "2 tablespoons unsalted butter, melted",
    "½ cup hot pepper sauce (such as Frank’s)",
    "½ teaspoon cayenne pepper",
    "Kosher salt, freshly ground pepper",
    "Vegetable oil for frying (about 10 cups)",
    "¾ cup cornstarch",
    "3 pounds chicken wings, tips removed, drumettes and flats separated",
    "4 celery stalks, cut into thin sticks",
    "2",
    "Deep-fry thermometer"
  ],
  "__v": 1
}