{
  "hash": "e45a2241318432b76144c2f91934f9a0da624255",
  "title": "Smashed Potato Salad",
  "image": "https://res.cloudinary.com/hksqkdlah/image/upload/s--V8xfSlmO--/c_scale,f_auto,h_344,q_jpegmini:1,w_344/29676_sfs-smashed-potato-salad-36",
  "href": "https://www.cookscountry.com/recipes/8818-smashed-potato-salad",
  "extension": "",
  "firstAdded": "2017-12-30T18:28:08.636000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Use the tip of a paring knife to judge the doneness of the potatoes. If the tip inserts easily into the potato pieces, they are done. Hellmann’s Real Mayonnaise is our favorite nationally available mayonnaise. Note that the salad needs to be refrigerated for about 2 hours before serving.",
    "Watch the Cook's Country cast make this recipe",
    "PLAY VIDEO",
    "1. Combine potatoes, 8 cups water, and 1 tablespoon salt in Dutch oven and bring to boil over high heat. Reduce heat to medium and cook at vigorous simmer until potatoes are tender, 14 to 17 minutes.",
    "2. Drain potatoes in colander. Transfer 3 cups potatoes to large bowl, add 1 tablespoon vinegar, and coarsely mash with potato masher. Transfer remaining potatoes to rimmed baking sheet, drizzle with remaining 1 tablespoon vinegar, and toss gently to combine. Let cool completely, about 15 minutes.",
    "3. Whisk mayonnaise, ½ cup water, mustard, cayenne, 1 teaspoon salt, and 1 teaspoon pepper together in bowl. Stir mayonnaise mixture into mashed potatoes. Fold in eggs, scallions, pickles, celery, onion, and remaining potatoes until combined. (Mixture will be lumpy.)",
    "4. Cover and refrigerate until fully chilled, about 2 hours. Season with salt and pepper to taste. Serve."
  ],
  "ingredients": [
    "0",
    "3\tpounds Yukon Gold potatoes, unpeeled, cut into 1-inch chunks",
    "Salt and pepper",
    "2\ttablespoons distilled white vinegar",
    "1\tcup mayonnaise",
    "3\ttablespoons yellow mustard",
    "¼\tteaspoon cayenne pepper",
    "3\thard-cooked large eggs, chopped",
    "3\tscallions, sliced thin",
    "½\tcup chopped sweet pickles",
    "½\tcup finely chopped celery",
    "¼\tcup finely chopped onion"
  ],
  "__v": 1
}