{
  "hash": "ecc662402da1b6198691fde96ce27c6118306892",
  "title": "Chocolate Cake w/ Peanut Butter Frosting",
  "image": "http://bunnyswarmoven.net/wp-content/uploads/2014/01/IMG_0055-3.jpg",
  "href": "http://bunnyswarmoven.net/2014/01/homemade-chocolate-cake-with-peanut-butter-frosting",
  "extension": "Chrome",
  "firstAdded": "2016-10-29T16:55:40.511000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 300 degrees. Grease the bottom and sides of a 13x9 inch baking pan.",
    "Mix the flour sugar, cocoa, salt, baking powder and baking soda together in a large bowl.",
    "Beat the eggs with an electric mixer until they are bright yellow and slightly thick. Add the oil, coffee and vanilla to the eggs, mix until well incorporated. Add the flour to the mix, alternating with the buttermilk, mixing after each addition until just incorporated. Start with the flour first, then buttermilk, flour, buttermilk and end with flour.",
    "Pour the batter into the prepared baking pan. I always hold the pan up a few inches from the counter and let it fall to get rid of air bubbles in the batter. Bake at 300 degrees for 1 hour. Test for doneness with a toothpick.",
    "1",
    "Place the butter and peanut butter into a medium bowl, and beat with an electric mixer. Gradually mix in the sugar, and when it starts to get thick, incorporate milk one tablespoon at a time until all of the sugar is mixed in and the frosting is thick and spreadable. Beat for at least 3 minutes for it to get good and fluffy. Frost cake after it has cooled completely."
  ],
  "ingredients": [
    "0",
    "2 cups flour",
    "2 cups sugar",
    "3/4 cup Hershey's cocoa",
    "1 1/2 tsp baking soda",
    "1/2 tsp baking powder",
    "2 large eggs",
    "1 tsp salt",
    "1 cup buttermilk",
    "1 cup vegetable oil",
    "1 1/2 tsps vanilla",
    "1 cup brewed coffee ( instant coffee will do in a pinch)",
    "Peanut Butter Frosting",
    "1/2 cup butter, softened",
    "1 cup creamy peanut butter",
    "3 TBLS milk, or as needed",
    "2 cups confectioners sugar"
  ],
  "__v": 1
}