{
  "hash": "da393df516509502a912c638051c8389b2388974",
  "title": "Farmhouse Seed Bread",
  "image": "",
  "href": "http://www.nourishingmeals.com/2011/04/gluten-free-bread-xanthan-free-vegan.html",
  "extension": "",
  "firstAdded": "2015-09-25T20:46:29.443000",
  "users": [
    null
  ],
  "keywords": [
    "wet",
    "water",
    "degrees",
    "active",
    "dry",
    "yeast",
    "maple",
    "syrup",
    "organic",
    "cane",
    "sugar",
    "extra",
    "virgin",
    "olive",
    "oil",
    "chia",
    "seeds",
    "psyllium",
    "husks",
    "teff",
    "flour",
    "sorghum",
    "rice",
    "cornmeal",
    "salt",
    "poppy",
    "sesame"
  ],
  "directions": [
    "0",
    "Place the warm water in a bowl or 4-cup liquid glass measure. Add the yeast and teaspoon of maple syrup, whisk together. Let rest for 5 to 10 minutes to activate the yeast. The mixture should get foamy or bubbly. If not, dump it out and start over.",
    "While the yeast is activating, mix together the dry ingredients in a large bowl.",
    "After the yeast is activated whisk in the olive oil, maple syrup, ground chia seeds, and psyllium husks into the water-yeast mixture. Let stand for 2 to 3 minutes (not any longer) to let the chia and psyllium release their gelatinous substances. Whisk again.",
    "Dough after kneading, before rising.",
    "Pour the wet ingredients into the dry and mix together with a large wooden spoon until thick. Then knead the dough on a floured wooden board to incorporate the flour. Add more teff and sorghum flours, a little at a time, until the dough holds together and isn’t too sticky (about ¼ to ½ cup total). Don’t add too much flour, otherwise the dough will become very dense; it should still be slightly sticky. Form dough into a ball, place back into the large bowl, and cover with a damp towel. Place in a warm spot to rise. I like to place the bowl over a pot of warm water. Let dough rise for an hour or until doubled in size. Rising time will depend on the temperature of the environment around the dough.",
    "Dough after rising for one hour.",
    "After the dough has risen, place a pizza stone in your oven. Preheat the oven to 400 degrees F. Place a pan of water on the bottom rack of the oven (the one beneath the pizza stone). I usually use an 8 x 8-inch glass pan filled ¾ of the way full."
  ],
  "ingredients": [
    "0",
    "Wet Ingredients:",
    "2 ½ cups warm water (105 to 110 degrees F)",
    "2 ¼ teaspoons active dry yeast (1 package)",
    "1 teaspoon maple syrup or organic cane sugar",
    "2 tablespoons extra virgin olive oil",
    "2 tablespoons maple syrup",
    "1/3 cup ground chia seeds",
    "1/3 cup whole psyllium husks",
    "Dry Ingredients:",
    "1 cup teff flour",
    "1 cup sorghum flour",
    "½ cup sweet rice flour",
    "½ cup cornmeal",
    "1 ½ teaspoons sea salt",
    "Topping:",
    "extra virgin olive oil",
    "poppy seeds",
    "sesame seeds"
  ],
  "__v": 1
}