{
  "hash": "dd41f1df83bafc65f8d6e28509afffb93ee83aa0",
  "title": "s'more cookies please",
  "image": "http://www.recipe.com/images/smore-cookies-please-RU174560-ss.jpg",
  "href": "http://www.recipe.com/smore-cookies-please/",
  "extension": "Chrome",
  "firstAdded": "2015-10-29T00:14:19.433000",
  "users": [
    null
  ],
  "keywords": [
    "regular",
    "rolled",
    "oats",
    "allpurpose",
    "flour",
    "graham",
    "crackers",
    "baking",
    "soda",
    "cinnamon",
    "apple",
    "pie",
    "spice",
    "salt",
    "butter",
    "softened",
    "brown",
    "sugar",
    "granulated",
    "eggs",
    "milk",
    "vanilla",
    "jar",
    "marshmallow",
    "creme",
    "caramel",
    "peanut",
    "almonds",
    "andor",
    "kisses",
    "chocolates"
  ],
  "directions": [
    "0",
    "In a medium bowl, combine oats, flour, crushed graham crackers, baking soda, baking powder, cinnamon and salt. Set aside.",
    "2.",
    "In a large bowl, beat butter with an electric mixer on medium to high speed for 30 seconds. Add brown sugar and granulated sugar. Beat on medium speed until mixture is combined, scraping sides of bowl occasionally. Beat in eggs, milk and vanilla until combined. Beat in as much of the flour mixture as you can with the mixer. Stir in any remaining flour mixture with a wooden spoon until combined.",
    "3.",
    "Cover the bowl with plastic wrap and chill in the refrigerator for 1 hour but no longer than 4 hours.",
    "4.",
    "Line cookie sheets with parchment paper or lightly grease cookie sheets. Drop dough from rounded tablespoons about 2 inches apart onto prepared cookie sheets.",
    "5.",
    "Bake in a 375 degrees F oven for 8 minutes. Remove from oven.",
    "6.",
    "Using the back of a measuring teaspoon, make a slight impression in the center of each cookie. Transfer the marshmallow creme to a resealable plastic bag. Seal bag and snip off a tiny corner of the bag. Use the bag to pipe about 1 teaspoon of the marshmallow creme into the center of each cookie. Push a Kiss chocolate into the center of the marshmallow creme, pointed side down. Return cookies to the oven. Bake for 2 or 3 minutes more or until edges are light brown. Cool on cookie sheets for 1 minute. Transfer to wire racks and let cool."
  ],
  "ingredients": [
    "0",
    "4 cups regular rolled oats",
    "1 1/2 cups cups all-purpose flour",
    "1 cup finely crushed graham crackers (about 15)",
    "1 teaspoon baking soda",
    "1 teaspoon baking powder",
    "1 teaspoon ground cinnamon or apple pie spice",
    "1/2 teaspoon salt",
    "1 cup butter, softened",
    "1 cup packed brown sugar",
    "1/2 cup granulated sugar",
    "2 eggs",
    "1/4 cup milk",
    "1 tablespoon vanilla",
    "1 7 ounce jar marshmallow creme",
    "42 Kisses milk chocolates with caramel, Kisses milk chocolates with peanut butter, Kisses milk chocolates with almonds and/or Kisses milk chocolates"
  ],
  "__v": 1
}