{
  "hash": "2d6875d6afe78006c5344fce2643c9267d8d8897",
  "title": "Vegetarian French Dip Sandwiches",
  "image": "",
  "href": "https://www.budgetbytes.com/2016/12/vegetarian-french-dip-sandwiches/",
  "extension": "Firefox",
  "firstAdded": "2016-12-27T09:36:35.219000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Slice the onion into thin strips. Rinse the portobello caps to remove any dirt or debris. Slice each cap in half, then crosswise into ¼-inch thick strips.",
    "Add the butter to a deep skillet along with the sliced onions. Sauté the onions over medium heat for a few minutes, or just until they begin to soften. Add the sliced mushrooms, a pinch of salt and pepper, the thyme, and oregano. Sauté the mushrooms until they release all their moisture and the liquid in the bottom of the skillet has dried up (about 10 minutes). You want to see some of the liquid browning and coating the bottom of the skillet (but not burning).",
    "Once the evaporated juices begin to coat the bottom of the skillet, pour in the vegetable broth. Stir to dissolve the browned bits from the bottom of the skillet. Also add the soy sauce, brown sugar, and garlic powder. Allow the liquid to come up to a simmer, then turn down to low and simmer for about 5 minutes while you toast the bread.",
    "Open the rolls and place them on a baking sheet, open sides up. Turn the oven on to broil and place the rolls in the oven. Watch the rolls closely and broil just until you see a slightly browning on the edges (about 5 minutes).",
    "Use a slotted spoon or tongs to take the mushrooms and onions out of the au jus. Divide the mushrooms and onions among the four rolls. Top each sandwich with a slice of provolone. Return the sandwiches to the oven and broil for a few minutes more, or just until the cheese is melted. Close the sandwiches up and serve with the au jus from the skillet for dipping."
  ],
  "ingredients": [
    "0",
    "1 yellow onion $0.25",
    "3 portobello mushroom caps (about 1 lb.) $5.39",
    "2 Tbsp butter $0.22",
    "Pinch of salt and pepper $0.05",
    "¼ tsp dried thyme $0.03",
    "¼ tsp dried oregano $0.03",
    "2 cups vegetable broth* $0.28",
    "1 Tbsp soy sauce $0.09",
    "½ Tbsp brown sugar $0.02",
    "⅛ tsp garlic powder $0.02",
    "4 6-inch French or Ciabatta rolls $2.66",
    "4 slices provolone $1.40"
  ],
  "__v": 1
}