{
  "hash": "b249c13178197247f1fec41892b22cf25ca65cd7",
  "title": "Churros",
  "image": "https://patijinich.com/wp-content/uploads/2015/04/012716_PattiJ_S4_Churros_747_Cropped-912x622.jpg",
  "href": "https://patijinich.com/recipe/churros/",
  "extension": "Chrome",
  "firstAdded": "2017-10-29T12:07:15.929000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large, heavy and extended casserole, or cast iron, high-sided skillet, heat about 1 1/2-inches of canola oil over medium heat until the oil temperature reaches 350 degrees (or test with a piece of tortilla or bread; it’s ready when the oil bubbles actively all around it). It will take awhile to heat, so get this started before making the dough.",
    "On a large plate, combine 1 cup sugar and 1 tablespoon ground cinnamon. Set aside.",
    "In a medium saucepan, combine the water, 1/4 cup oil, vanilla extract, 1/4 cup sugar, 1/2 teaspoon cinnamon and salt. Bring to a boil over medium-high heat. Add the flour all at once, turn off the heat and use a wooden spoon to stir vigorously until the mixture forms a dough as smooth as possible with no flour lumps. It will take about 2 minutes. Set aside to cool slightly.",
    "Transfer to a pastry bag fitted with a large star tip or a churro press. Pipe the dough into about 6 to 8-inch pieces (or if you want to replicate a churro store, pipe a rope-like dough of about 24-inches) and carefully place in oil. Fry for about 3 to 4 minutes, until golden and crisp, flipping in between. Use tongs to remove them and place on a paper towel lined baking sheet or drying rack.",
    "While the churros are still very hot, toss them in the sugar and cinnamon mixture to coat. If desired, serve with cajeta or dulce de leche as a dipping sauce and Mexican hot chocolate on the side."
  ],
  "ingredients": [
    "0",
    "Canola oil for frying,plus 1/4 cup",
    "1cupsugarplus 1/4 cup",
    "1tablespoonground cinnamonplus 1/2 teaspoon",
    "2cupswater",
    "2teaspoonsvanilla extract",
    "1teaspoonkosher or coarse sea salt",
    "2cupsall-purpose flour",
    "Cajeta or dulce de lecheoptional dipping sauce"
  ],
  "__v": 1
}