{
  "hash": "36577aaedde9c8b87a97509da5e373eb07452129",
  "title": "Spinach & sweet potato tortilla",
  "image": "http://www.bbcgoodfood.com/sites/bbcgoodfood.com/files/recipe_images/tortilla_0.jpg",
  "href": "http://www.bbcgoodfood.com/recipes/spinach-sweet-potato-tortilla",
  "extension": "Chrome",
  "firstAdded": "2015-07-04T05:21:43.838000",
  "users": [
    null
  ],
  "keywords": [
    "baby",
    "spinach",
    "leaves",
    "light",
    "olive",
    "oil",
    "onions",
    "medium",
    "potatoes",
    "slices",
    "garlic",
    "eggs"
  ],
  "directions": [
    "0",
    "Put the spinach in a large colander and pour over a kettleful of boiling water. Drain well and, when cooled a little, squeeze dry, trying not to mush up the spinach too much.",
    "Heat 3 tbsp oil in a 25cm non-stick pan with a lid, then sweat the onions for 15 mins until really soft but not coloured. Add another 3 tbsp oil and add the potatoes and garlic. Mix in with the onions, season well, cover and cook over a gentle heat for another 15 mins or so until the potatoes are very tender. Stir occasionally to stop them catching.",
    "Whisk the eggs in a large bowl, tip in the cooked potato and onion, and mix together. Separate the spinach clumps, add to the mix and fold through, trying not to break up the potato too much.",
    "Add 2 tbsp more oil to the pan and pour in the sweet potato and egg mix. Cover and cook over a low-medium heat for 20 mins until the base and sides are golden brown and the centre has mostly set. Run a palette knife around the sides to stop it from sticking.\n5 To turn the tortilla over, put a plate face down onto the pan, then flip it over. Slide the tortilla back into the pan and cook for a further 5-10 mins until just set and golden all over. (Don’t worry if it breaks up a little on the edges as you’re turning it – it will look perfect when it’s cooked through and set.) Continue cooking on the other side until just set and golden all over. Again use a palette knife to release the tortilla from the sides. Allow to rest for 5 mins, then tip onto a board before cutting into wedges."
  ],
  "ingredients": [
    "0",
    "300g bag baby spinach leaves",
    "8 tbsp light olive oil",
    "2 large onions, thinly sliced",
    "4 medium sweet potatoes (800g/ 1lb 12oz), peeled, cut into thin slices",
    "2 garlic cloves, finely chopped",
    "8 large eggs"
  ],
  "__v": 1
}