{
  "hash": "afc9fafbead4d472c11b301f523db7429e67932a",
  "title": "Composed salad with salmon and beets",
  "image": "http://fiveandspice.com/wp-content/uploads/2013/05/salmon-and-beet-salad-3.jpg",
  "href": "http://fiveandspice.com/2013/05/26/composed-salad-with-salmon-and-beets/",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T21:48:09.422000",
  "users": [
    null
  ],
  "keywords": [
    "dressing",
    "tbs",
    "mustard",
    "dijon",
    "grainy",
    "lemon",
    "juice",
    "red",
    "wine",
    "vinegar",
    "yogurt",
    "creme",
    "fraiche",
    "olive",
    "oil",
    "salt",
    "pepper",
    "rest",
    "salad",
    "potatoes",
    "preferably",
    "larger",
    "ones",
    "work",
    "thats",
    "beets",
    "color",
    "smaller",
    "opposed",
    "couple",
    "sprigs",
    "thyme",
    "flat",
    "leaf",
    "parsley",
    "dill",
    "tarragon",
    "shallot",
    "lbs",
    "salmon",
    "fillet",
    "wild",
    "caught",
    "plenty",
    "bitter",
    "dandelion",
    "greens",
    "chickory",
    "torn",
    "bite",
    "size",
    "pieces",
    "leaves",
    "eggs",
    "hardboiled"
  ],
  "directions": [
    "0",
    "First roast the beets and the potatoes (this can be done in advance to save time on prep later). Heat your oven to 400F. Scrub the beets well and remove their leaves if they have them, place them whole in a little roasting pan and add about an inch of water to the pan. Cover the pan tightly with foil and place it in the oven. Next, toss the potatoes with about 1 Tbs. olive oil, the thyme sprigs, and a sprinkling of salt and pepper. Place them in another roasting pan, cover this one with aluminum foil too, and put it into the oven. Roast the beets and potatoes until they are tender enough to be easily pierced to the center with a knife. The amount of time depends on the size of the vegetables but the potatoes can take anywhere from 30 minutes for little ones to an hour for bigger ones, and beets tend to take 45 min. to an hour.",
    "Remove each - the beets and the potatoes - from the oven once they are tender and allow to cool completely. Use your fingers to rub the skins off of the beets, then cut them into ½ inch thick wedges and toss them in a medium bowl with the juice of half the lemon, a drizzle of olive oil and salt and pepper.",
    "Make the vinaigrette by whisking the dressing ingredients together (taste and adjust the seasonings to taste). Halve the potatoes (if small) or cut into ½ inch chunks and toss in a separate bowl with 2 Tbs. of the dressing and about ½ tsp. salt. Set the remaining vinaigrette aside.",
    "To prepare the salmon, reduce the oven temperature to 325F and place a shallow baking pan full of water on the lowest rack. Mix the parlsey, dill, tarragon, and chopped shallot with 1 tsp. lemon zest from the lemon and 2 Tbs. of olive oil. Season the salmon well with salt and pepper and rub the herb mix all over it. Put the salmon on a baking sheet and place in the oven on a rack above the pan of water. Back until the salmon will just flake in the center. Mine took about 30 minutes (time depends on the thickness of the fillet).",
    "Remove the salmon from the oven and break it into 2 inch chunks. Scatter the greens onto a large platter and drizzle with ¼ cup of the mustard dressing. Arrange the beets and potatoes around the greens, then add the salmon chunks. Drizzle with as much of the remaining dressing as you wish. Slice the boiled eggs into wedges, if using, and nestle them in amongst the rest of the ingredients. Season with a pinch of salt and another squeeze of lemon juice and serve."
  ],
  "ingredients": [
    "0",
    "For the dressing:",
    "1 Tbs. mustard (Dijon or grainy)",
    "1 Tbs. lemon juice",
    "1½ Tbs. red wine vinegar",
    "1 Tbs. yogurt or creme fraiche",
    "¾ cup olive oil",
    "salt and pepper to taste",
    "For the rest of the salad:",
    "1 lb. of potatoes, preferably little tiny ones, but larger ones will work if that's what you can get",
    "1 lb. whole beets in any color, again preferably a handful of smaller ones as opposed to just a couple large ones",
    "a few sprigs of fresh thyme",
    "¼ cup flat leaf parsley, finely chopped",
    "2 Tbs. fresh dill, finely chopped",
    "2 tsp. fresh tarragon, finely chopped",
    "¼ cup shallot, very finely chopped",
    "one lemon",
    "2 lbs. salmon fillet (preferably wild caught)",
    "Plenty of olive oil, salt and pepper",
    "several handfuls of bitter greens like dandelion greens or chickory (chopped or torn into bite size pieces if they are large leaves)",
    "3 eggs, hardboiled (optional)"
  ],
  "__v": 1
}