{
  "hash": "add847e6148726224deb0949cbf27a6077bea42a",
  "title": "White Chocolate & Cardamom Cookies",
  "image": "http://cdn.shelinapermalloo.com/images/made/images/page_photos/002_700_300_80_s_c1.jpg",
  "href": "http://shelinacooks.com/recipes/details/white-chocolate-cardamom-cookies",
  "extension": "Chrome",
  "firstAdded": "2016-01-30T09:00:15.906000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "butter",
    "softened",
    "golden",
    "caster",
    "sugar",
    "dark",
    "muscovado",
    "free",
    "range",
    "eggs",
    "medium",
    "plain",
    "white",
    "flour",
    "chocolate",
    "pieces",
    "cardamom",
    "pods",
    "seeds",
    "salt",
    "baking",
    "powde"
  ],
  "directions": [
    "0",
    "Method",
    "Preheat the oven to 180°C/160°C fan/Gas 4.",
    "Using an electric mixer cream together the butter and sugars until light and fluffy.",
    "Pre whisk the egg and then slowly add to the mixture slowly making sure it is completely incorporated.",
    "Remove the husks from the cardamom pods and use the black seeds inside. Ground the seeds in a pestle and mortar to release the aromas before adding to the rest of the mixture.",
    "Add the sifted flour, salt and baking powder and mix until well combined. Fold in the cardamom pods and white chocolate until evenly mixed.",
    "Line a baking sheet with parchment paper or a silicone baking mat and using dessert spoon, spoon balls of the mixture onto the baking sheet leaving some space between them so the cookies don’t turn into twins!",
    "Place in the oven and cook for 12 - 15 minutes, they may seem quite soft when they first come out but this is fine, as they will harden as they cool down.",
    "Make sure the cookies are completely cool before placing into the cookie jar (if they last that long!)",
    "NB make bigger cookies rather than smller, they don't spread much. Don't overcook-go quite hard when cold"
  ],
  "ingredients": [
    "0",
    "125 grams\tUnsalted Butter softened",
    "100 grams\tGolden Caster Sugar",
    "70 grams\tDark Muscovado",
    "1\tFree Range Eggs medium",
    "250 grams\tPlain White Flour",
    "80 grams\tWhite Chocolate chopped into small pieces",
    "8\tCardamom Pods seeds of",
    "1 pinch of salt",
    "1/2 tsp baking powde"
  ],
  "__v": 2
}