{
  "hash": "47d41972d52d3f4ca0f2cd741a5d07e6b76648e0",
  "title": "hoisin pork with rice noodles",
  "image": "https://cdn.pinchofyum.com/wp-content/uploads/2013/01/hoison-pork-2-183x183.jpg",
  "href": "https://pinchofyum.com/hoisin-pork-with-rice-noodles",
  "extension": "Chrome",
  "firstAdded": "2018-06-17T03:27:33.588000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Whisk all the sauce ingredients together (soy sauce, water, oil, honey, sugar, fish sauce, vinegar, garlic, ginger, peppers, hoisin, and peanut butter). You could also puree the sauce in a food processor to get the garlic, peppers, and ginger smooth.",
    "Marinate the pork in the sauce overnight or for at least a few hours. I did mine overnight and then some, about 15 hours.",
    "Heat a nonstick skillet over medium high heat and stir-fry the pork until browned on the outside. I found that there wasn’t a whole lot of extra sauce after marinating, but I discarded the little bit that was left.",
    "Cook your rice noodles according to package directions. Keep a little bit of liquid with the noodles to make sure it doesn’t dry out. Top with pork, carrots, scallions, peanuts, cilantro, and extra sauce of choice (more hoisin sauce, soy sauce, sweet chili garlic sauce, sesame oil, etc). This is definitely a build-your-own kind of thing – just throw whatever you like in there with the noodles."
  ],
  "ingredients": [
    "0",
    "1/3 cup soy sauce",
    "1/4 cup water",
    "3.5 tablespoons sesame oil or canola oil",
    "2 tablespoons honey + 1 tablespoon sugar",
    "1 dash fish sauce",
    "3 tablespoons vinegar + a squeeze of lime if you have it",
    "5 cloves finely minced garlic",
    "1 piece fresh grated ginger (1-2 tablespoons)",
    "1 minced hot pepper (i.e. jalapeno, chili pepper, etc)",
    "3 tablespoons hoisin sauce",
    "3 tablespoons peanut butter (optional)",
    "1 1/2 lbs. pork cut into thin strips (mine was called “pork stroganoff”)",
    "9 oz. rice noodles",
    "grated carrots, chopped scallions, chopped peanuts, cilantro"
  ],
  "__v": 1
}