{
  "hash": "221594e3184c1c8dcf7d6290aa5d7629054f1658",
  "title": "Easy Whole Grain Seeded Bread",
  "image": "https://mbkr-minimalistbaker.netdna-ssl.com/wp-content/uploads/2015/03/Easy-Whole-Grain-Vegan-Bread-SQUARE.jpg",
  "href": "https://minimalistbaker.com/the-easiest-whole-grain-seeded-bread/",
  "extension": "Chrome",
  "firstAdded": "2017-08-14T19:03:33.097000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine warm water (like bath water, or 110 degrees F / 43 C), yeast, maple syrup or sugar, salt, flax seed and flours in a large mixing bowl and stir. The result will be a sticky, rough dough. If using a stand mixer, beat at medium speed for about a minute. Otherwise just use a spoon to stir until well combined and when it can no longer do the job, knead and turn it in the bowl with your hands. Add flour until the dough is no longer sticking to the sides - about 3 3/4 cups total.",
    "Lift the dough out and lightly grease the bowl with nonstick spray or olive oil. Cover and let rise for 2 hours at room temperature and 2 hours in the fridge. Alternatively, go straight for the fridge for two hours to save time, though a longer rise is best.",
    "Use fingers to create a small hole in the dough and pour in sunflower seeds and oats. Transfer dough to a lightly floured work surface and knead about 20 turns or until elastic. Form into a loaf-like shape.",
    "Place seam-side down in a lightly greased loaf pan or baking sheet and sift a light coating of flour over the top to help keep the dough moist. Loosely cover with plastic wrap and let rest for 45-60 minutes.",
    "Preheat oven to 425 degrees F (218 C)* toward the end of the dough resting time and place a metal or cast iron pan (not glass, Pyrex, or ceramic) on the lowest oven rack. Also have 1 cup of hot water ready.",
    "When the oven is preheated, slash the bread 2 or 3 times with a knife, making a cut about ½-inch deep.",
    "Place in oven on middle rack. Then carefully pour hot water into the shallow pan on the rack beneath. Expect it to bubble and steam; then close oven door quickly.",
    "Bake the bread for 26 to 35 minutes, or until deep golden brown and risen.",
    "Remove the bread from the oven and let rest in the pan for 5 minutes. Then carefully remove from pan and transfer to a cooling rack to cool. Let it cool completely before slicing for best results (otherwise it can be doughy in the middle).",
    "Store leftovers in a plastic bag at room temperature for up to a few days. Transfer to freezer for longer term storage."
  ],
  "ingredients": [
    "0",
    "1 1/2 cups (360 ml) warm water",
    "3/4 Tbsp fast-acting yeast (~1 packet or 2 1/4 tsp)",
    "2 Tbsp (30 ml) maple syrup, agave, or honey if not vegan",
    "1/2 tbsp salt",
    "1 Tbsp (7 g) flaxseed",
    "2 cups (304 g) Bob’s Red Mill Whole-Wheat Pastry Flour",
    "1 3/4 cups (238 g) Bob’s Red Mill Unbleached All-Purpose Flour + more for rolling / dusting",
    "2 Tbsp (14 g) raw or roasted sunflower seeds",
    "2 Tbsp (11 g) rolled oats"
  ],
  "__v": 1
}