{
  "hash": "ebedd56ff9a7d0c6c6d42c36ae61bfa820becbcd",
  "title": "Homestyle Vegan Grits with Tempeh Sausage & Brussels Sprouts",
  "image": "https://www.thefullhelping.com/wp-content/uploads/2016/11/Homestyle-grits-tempeh-sausage-7.jpg",
  "href": "https://www.thefullhelping.com/homestyle-vegan-grits-tempeh-sausage-brussels-sprouts/",
  "extension": "Firefox",
  "firstAdded": "2018-09-05T15:01:39.422000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To prepare the sausage, heat 2 teaspoons oil in a skillet or roomy sauté pan over medium high heat. When the oil is shimmering, add the tempeh. Brown the tempeh, stirring frequently, for 3-4 minutes. When it's a light golden color, add the garlic and cook for one more minute, stirring constantly. Add the chili, fennel, paprika, broth, tamari, vinegar, and maple syrup to the pan. When the broth is simmering, reduce heat to low. Allow the sausage crumbles to simmer, uncovered, until the broth has been absorbed. Transfer the crumbles to a plate and set them aside.",
    "Heat the remaining 2 teaspoons oil in the same skillet and return the heat to medium. Add the onion and Brussels sprouts, along with a pinch of salt and pepper. Cook, stirring now and then, for 6-8 minutes, or until the onions are tender and sweet. Fold the sausage crumbles back into the onion and sprouts, mix everything well, and then adjust salt and pepper to taste. Remove the skillet from heat.",
    "To prepare the grits, bring the water and salt to boil. Whisk in the grits or cornmeal. Reduce heat to medium low. Cook, stirring constantly, for 5-10 minutes, or until the grits are thick and creamy (cooking time will depend on the type of grits you use, so it's a good idea to check the package for instructions). Stir in vegan buttery spread and nutritional yeast, along with a generous crack of black pepper. If you like, add a splash of non-dairy milk for extra creaminess.",
    "Divide the grits into four plates or bowls and top each with a quarter of the tempeh and veggie mixture. Feel free to add a handful of fresh, peppery greens (like arugula) to each plate for a little color and crunch! Serve."
  ],
  "ingredients": [
    "0",
    "4 teaspoons vegetable oil",
    "8 ounces tempeh, crumbled",
    "1 clove garlic, finely minced or grated on a microplane",
    "1 teaspoon chili powder",
    "1 teaspoon fennel seeds",
    "¾ teaspoon smoked paprika",
    "¾ cup low sodium vegetable broth, plus more as needed (substitute water)",
    "1 tablespoon tamari",
    "2 teaspoons apple cider vinegar",
    "1-2 teaspoons maple syrup (to taste)",
    "1 small white or yellow onion, thinly sliced",
    "8 ounces shredded Brussels sprouts (about 3 heaping cups)*"
  ],
  "__v": 1
}