{
  "hash": "d7eac1296c2ea9d86892ba991d4082d520a9d937",
  "title": "CarlaKelly @ Kelly BakesCarla CardelloJanet TCarla CardelloAnna (Hidden Ponies)Carla CardelloLizCarla CardellodinaCarla CardelloNancy @ gottagetbakedCarla CardelloMemoriaCarla CardelloStacyJanet TCarla CardelloMichele @ alwayzbakinSavanaSavanaTeenietinyCarla CardelloTeenietinyAndreaCarla CardellojulieCarlakarinaCarlaCorinnaCarlaMichell SanglezCarlaKeshiaCarlaPamCarlabarbarabaljeetCarlaJCarlaCherylCarlaCherylCarlaCharwandaCarlajCarlaAmyCarlaEveCarlaCarlaKayCarlaBetsyCarlaEsmeralda SanchezCarlaChristinaCarlaAmandaCarlaBarbLaurenCarlaAmyCarlaMelindaCarlaCatCarlaSheilaCarlaAllenCarlaAllenCarlaNicoleCarlaNicoleNicoleCarlaReticulaCarlaDarnell MoserCarlaHollyCarlaJennyCarlaMelissa SpiegleLaurenCarlaMellissaCarlaCarlaCarlaChelseaCarlaChelseaCarlaChelseaCarlaAllisonCarlaPennyCarlaMichele ScalaCarlajennijenniCarlaMaryCarlaJulie PeronaCarlaJulie PeronaCarla",
  "image": "http://www.chocolatemoosey.com/wp-content/uploads/2014/06/Strawberry-Layer-Cake-With-Cream-Cheese-Frosting-4870.jpg",
  "href": "http://www.chocolatemoosey.com/2014/06/26/strawberry-layer-cake-with-cream-cheese-frosting/",
  "extension": "Chrome",
  "firstAdded": "2016-06-22T21:21:28.118000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350F. Grease two 8-inch wide x 1 1/2 inch deep round cake pans and line the bottoms with parchment paper.",
    "In a large saucepan, stir together 1 1/2 cups strawberries, water, and 2 tablespoons sugar. Bring to a boil, stirring occasionally. Boil for 5 minutes or until the strawberries cook down and start to thicken. Remove from the heat and cool 15 minutes.",
    "In a large bowl, sift together the flour and cornstarch. Stir in the baking powder and salt.",
    "In another large bowl with a mixer on medium speed, beat together the butter and remaining 1 1/2 cups sugar until creamy, 2-3 minutes. Beat in the egg whites, one at a time for 1 minute each, then add the vanilla.",
    "On low speed add the flour mixture alternating with the milk, adding the flour in 3 additions and the milk in 2 additions (begin and end with dry ingredients). Do not overmix the flour. Stir in the cooked strawberry mixture and remaining 1/2 cup strawberries. At this point, if the batter isn't pink enough, add 3-5 drops red food coloring if desired.",
    "Divide the batter between the two cake pans (batter will be thin) and bake 25-30 minutes or until the tops are brown and a toothpick inserted in the center comes out clean. Cool for 15 minutes then invert cakes onto cooling racks. Cool completely.",
    "For the frosting: In a large mixing bowl, beat together the cream cheese and butter until smooth. Beat in the powdered sugar, salt, and vanilla until light and creamy, about 2-3 minutes.",
    "To assemble: If the cake layers are not flat, trim some of the cake off of the top until flat.",
    "Place one cake layer on a cake stand or plate. Slide pieces of parchment or wax paper underneath the cake for easy clean up later. Spread some of the frosting on top of the cake. Top with the remaining cake layer. Spread a thin layer of frosting all over the cake, sealing in the crumbs (don't use more than half of the frosting). Refrigerate 15 minutes.",
    "Finish covering the cake with the remaining frosting. Carefully remove the paper pieces. Refrigerate until the frosting is firm. Store the cake covered in the refrigerator. For best results, let the cake sit at room temperature for 30 minutes before serving."
  ],
  "ingredients": [
    "0",
    "2 cups sliced fresh strawberries* (see Note about quality)",
    "2 tablespoons water",
    "1 3/4 cup all-purpose flour (when measuring, spoon the flour into the measuring cup and level it off)",
    "1/4 cup cornstarch",
    "2 teaspoons baking powder",
    "1 teaspoon salt",
    "1/2 cup (1 stick or 4 ounces) unsalted butter, softened",
    "1 1/2 cups + 2 tablespoons granulated sugar",
    "4 egg whites, room temperature",
    "1 teaspoon vanilla extract",
    "1 cup whole milk, room temperature",
    "Red food coloring (optional)",
    "8 ounces cream cheese, softened",
    "1/2 cup (1 stick or 4 ounces) unsalted butter, softened",
    "2 cups powdered sugar",
    "Pinch of salt",
    "1 teaspoon vanilla extract"
  ],
  "__v": 1
}