{
  "hash": "28785ed19275d03ac621552e6853c82298f848a2",
  "title": "Sweet Tart Dough (enough for a 9” or 10” tart pan)",
  "image": "https://68.media.tumblr.com/eae5ce537bd4d4a5e1497452690d56fc/tumblr_inline_nxnwrmMD2h1trnyzt_540.jpg",
  "href": "https://lvl1-chef.tumblr.com/post/128089607453/peach-tart-hp-15",
  "extension": "",
  "firstAdded": "2017-07-14T01:17:10.402000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine the first three ingredients in a large bowl",
    "With a sharp knife, cut the cold butter into small cubes and add them to the flour mixture (don’t throw away the butter wrapper!)",
    "Using a pastry cutter, a fork, or your fingers, work the butter into the dough until there are no more cubes and the consistency is like that of coarse sand",
    "Add the egg yolk to the bowl and use a wooden spoon to mix it together making sure to avoid having any large clumps of unmixed yolk",
    "Add the almond extract and then about 1 TBSP of cold water to the bowl. Continue to mix until a smooth dough is formed (no more crumbly bits.) More water may be required, but not much.",
    "Form the dough into a flat cylinder (think tuna can) and wrap tightly in plastic wrap. Place in the refrigerator for at least 30 minutes.",
    "At this point we can use the butter wrapper you saved to lightly grease the inside of the tart pan.",
    "Turn out the firm dough on to a lightly floured surface and use a rolling pin to roll out the dough to a circle about 2” larger in diameter than the size of your pan.",
    "Starting from the side nearest you, use the rolling pin to roll upwards, wrapping the dough around it as it goes. Hold it above your tart pan and unroll it back towards yourself draping it over the edges as you go.",
    "Gently press the dough down into the tart pan. You can trim any excess dough that might be sticking up above the sides by rolling the rolling pin along the edges. Use a fork and prick (dock) the bottom of the dough several times. Place the dough back in the fridge to firm up.",
    "Set your oven for 400F and once the dough is firm (about 20 minutes) lay a large piece of parchment paper on the tart shell and pour about a cup of dried beans or pie weights to fill the inside (this and the docking prevents the dough from baking all lumpy.) Bake the crust for 10 minutes.",
    "Remove the parchment and pie weights and bake for an additional 10 minutes or until the crust is just starting to brown",
    "Remove the tart crust from the oven and let it cool for about 5 minutes. In the mean time, crack an egg into a small bowl or measuring cup and lightly beat it with a little water or milk. Brush this over the inside of the tart crust and put it back in the oven for a final 5 minute bake time. Remove from oven and let the crust cool completely. (This egg wash creates a barrier so the bottom won’t get soggy later; it also improves color and taste!)"
  ],
  "ingredients": [
    "0",
    "AP Flour 1 and 1/3 cup",
    "Salt ¼ tsp",
    "10x Sugar 1/3 cup"
  ],
  "__v": 1
}