{
  "hash": "5d4ad4c94ca04bc0daa290e9b87d9b7672821f52",
  "title": "Instant Pot Ribs with White Barbecue Sauce",
  "image": "https://cdn.ruled.me/wp-content/uploads/2017/09/instant-pot-ribs-second.jpg",
  "href": "https://www.ruled.me/instant-pot-ribs-white-barbecue-sauce/",
  "extension": "Chrome",
  "firstAdded": "2018-04-15T17:01:10.635000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Mix all the ingredients for the spice rub in a small bowl. Set aside. Rinse the ribs with cold water and pat dry.",
    "Remove the silver skin from the back side of the ribs. Insert the tip of a sharp knife under the skin to get it started. The rest should pull off in one large piece.",
    "Season the ribs, front and back, with the spice rub. Sprinkle about 1-1 ½ tablespoons of spice rub on each side and rub into the meat until well coated.",
    "Add the water, apple cider vinegar, and liquid smoke to the bottom of the Instant Pot bowl. Insert the trivet into the bowl as well. Add the ribs to pot, curling them around to fit below the max fill line.",
    "Seal the Instant Pot vent and cook on the Manual High setting for 35 minutes. Allow the steam to natural release.",
    "Add all the sauce ingredients to a medium size container. Whisk or blend everything together (a wide-mouth mason jar and immersion blender works well). Store the sauce in the fridge for at least 2 hours to allow the flavors to combine.",
    "Preheat the grill to 450°F degrees. Grill the ribs on each side until a bit crispy and heated through, about 6 minutes per side.",
    "Serve the ribs with the sauce."
  ],
  "ingredients": [
    "0",
    "1 rack (3-lbs) baby back ribs",
    "1 cup water",
    "¼ cup apple cider vinegar",
    "2 teaspoons liquid smoke",
    "1 tablespoon paprika",
    "½ tablespoon garlic powder",
    "½ tablespoon onion powder",
    "½ teaspoon black pepper",
    "½ tablespoon chili powder",
    "½ tablespoon cumin",
    "½ teaspoon cayenne pepper",
    "1 teaspoon salt",
    "½ teaspoon dry mustard",
    "1 ½ cup mayonnaise",
    "¼ cup apple cider vinegar",
    "1 tablespoon dijon mustard",
    "1 teaspoon black pepper",
    "1 teaspoon salt",
    "1 teaspoon garlic, minced",
    "2 tablespoons Swerve (or preferred sweetener)",
    "2 teaspoons prepared horseradish"
  ],
  "__v": 1
}