{
  "hash": "1d243bede5f8cd214bcdb2a61856ec036f0da886",
  "title": "Salted Date Caramel, Chocolate Pie with Almond Coconut Crust. Vegan Glutenfree No Bake",
  "image": "http://www.veganricha.com/wp-content/uploads/2014/06/Artichoke-Bean-Burger-buns-1502-301x453.jpg?5bf3b9",
  "href": "http://www.veganricha.com/2014/06/salted-date-caramel-chocolate-pie-with.html",
  "extension": "Chrome",
  "firstAdded": "2015-06-20T11:00:30.646000",
  "users": [
    null
  ],
  "keywords": [
    "crust",
    "almonds",
    "hemp",
    "seeds",
    "use",
    "coconut",
    "flax",
    "seed",
    "meal",
    "cocoa",
    "omit",
    "chocolatey",
    "pie",
    "salt",
    "soft",
    "medjool",
    "dates",
    "vanilla",
    "maple",
    "syrup",
    "almond",
    "milk",
    "salted",
    "caramel",
    "layer",
    "soaked",
    "hot",
    "water",
    "minutes",
    "nut",
    "butter",
    "oil",
    "non",
    "salty",
    "chocolate",
    "mousse",
    "fat",
    "bar",
    "dark",
    "theo",
    "vegan",
    "semi",
    "chips"
  ],
  "directions": [
    "0",
    "Soak the dates, for the salted caramel layer in hot water, so they soak for the 15 minutes while you make the crust and topping.",
    "Crust: Process the almonds until coarse meal in a food processor or blender. Add seeds, cocoa, dates, ¼ cup coconut flakes, salt and pulse until the dates are incorporated well. Add the rest of the coconut flakes, vanilla, maple, almond milk and process until doughy. Add more almond milk or maple if needed and mix a bit your hands. Press the dough onto the pan. You can also make this into bars. Press the dough into a parchment lined 9 by 5 inch or smaller rectangle pan. For variations: Use more almonds or coconut to replace the seeds.",
    "Salted Caramel:",
    "Drain the soaked dates. Puree all the ingredients+soaked dates listed under salted caramel to combine into a smooth puree. blend for a couple of cycles so the dates blend well. Taste and adjust sweet and salt(add maple or stevia if you like it sweeter). Spread on the crust.",
    "Chocolate mousse:",
    "Heat coconut milk until it just about starts to bubble and add to a bowl. Add the chocolate and whisk to melt. Briskly whisk in the rest of the ingredients to aerate the mixture. Pour onto the caramel. Tap the pan to spread evenly.",
    "Freeze until set (a few hours), then slice and serve! The pie stays soft and well for weeks kept frozen. Cover the pie pan and freeze so that the top layer doesn't dry out."
  ],
  "ingredients": [
    "0",
    "Crust:",
    "½ cup + 2 Tbsp almonds",
    "2 Tbsp hemp seeds (or use coconut flakes)",
    "2 Tbsp flax seed meal or hemp seeds or coconut flakes",
    "1.5 Tbsp cocoa powder (omit for less chocolatey pie:))",
    "¾ cup coconut flakes, small flakes",
    "⅛ tsp salt",
    "8 soft medjool dates",
    "1.5 tsp vanilla extract",
    "2 Tbsp maple syrup",
    "1 Tbsp or more almond milk",
    "Salted Caramel Layer:",
    "1 cup soft medjool dates, 11 dates (soaked in hot water for 15 minutes)",
    "2 Tbsp almond butter or other nut butter",
    "2 Tbsp coconut oil",
    "½ cup almond milk or other non dairy milk",
    "¼ tsp fine sea salt (less for less salty caramel)",
    "Chocolate Mousse layer:",
    "½ cup full fat coconut milk",
    "1 3 oz bar 70% dark Theo chocolate or about ⅔ cup vegan semi sweet chocolate chips",
    "2 Tbsp almond butter",
    "2 Tbsp coconut oil",
    "2 tsp vanilla extract",
    "¼ cup maple syrup"
  ],
  "__v": 1
}