{
  "__v": 1,
  "directions": [
    "0",
    "Day 1: Make the starter. Combine 4 ounces (3/4 cup plus 2 tablespoons) flour and 4 ounces (1/2 cup) water in the 2-quart container. Stir vigorously with a wooden spoon until smooth. Scrape down the sides of the bowl. Cover loosely with plastic wrap or container lid, left ajar. Let sit in a consistently warm place (70 to 75 degrees F) for 24 hours.",
    "Day 2: Feed the starter. The starter should have a few bubbles on the surface (if not, no worries! It’ll get there). Add 4 ounces (3/4 cup plus 2 tablespoons) flour and 4 ounces (1/2 cup) water to the batter in the container. Stir vigorously with a wooden spoon until smooth. Scrape down the sides of the bowl. Cover loosely with plastic wrap or container lid, left ajar. Let sit in a consistently warm place (70 to 75 degrees F) for 24 hours.",
    "Day 3: Feed the starter. The starter should have some bubbles on the top, have grown a bit in size and have a bit of a sour smell (again, if not yet, no worries!). It should also be slightly thicker in consistency. Add 4 ounces (3/4 cup plus 2 tablespoons) flour and 4 ounces (1/2 cup) water to the batter in the container. Stir vigorously with a wooden spoon until smooth. Scrape down the sides of the bowl. Cover loosely with plastic wrap or container lid, left ajar. Let sit in a consistently warm place (70 to 75 degrees F) for 24 hours.",
    "Day 4: Feed the starter. At this point, you should be seeing quite a few bubbles on the top and smell a pungent, sour, vinegar-y smell. It should also have grown in size (nearly double) and feel a bit looser when you stir it. It may not look that different from Day 3, but the consistency should be looser and it should have a stronger smell – those are your biggest indicators that it’s working. Add 4 ounces (3/4 cup plus 2 tablespoons) flour and 4 ounces (1/2 cup) water to the batter in the container. Stir vigorously with a wooden spoon until smooth. Scrape down the sides of the bowl. Cover loosely with plastic wrap or container lid, left ajar. Let sit in a consistently warm place (70 to 75 degrees F) for 24 hours.",
    "Day 5: Starter is ready to use. At this point, the sourdough starter should have grown in size significantly (nearly doubled in bulk since Day 4), and it should be very loose and bubbly, almost frothy. It should also smell like sourdough – a little sour and vinegar-y. You can either use it for your recipe at this point, or maintain it.",
    "To Maintain Your Starter (Day 5 and Beyond): If you’re not planning to use the starter right away, discard half of the starter, then add 4 ounces (3/4 cup plus 2 tablespoons) flour and 4 ounces (1/2 cup) water to the batter in the container. Stir vigorously with a wooden spoon until smooth. Scrape down the sides of the bowl. Cover loosely with plastic wrap or container lid, left ajar.",
    "If you plan to use the starter within the next few days, you can leave it out in a consistently warm place (70 to 75 degrees F) and, every 24 hours, discard half and feed it. If it will be longer than a few days, cover the container tightly and refrigerate it. Once a week, take the starter out of the fridge, discard half (or use it), and feed it. Leave it out on the counter for a few hours (or overnight) so the yeast can recuperate before re-covering it and putting it back in the fridge.",
    "1",
    "In a large bowl or bowl of a stand mixer fitted with the paddle attachment, combine warm water and yeast. Stir to dissolve yeast, then let sit 5 minutes so yeast can fully dissolve.",
    "Add sourdough starter; stir until well combined and starter is mostly dissolved (there may be a few stringy bits left, and that’s OK).",
    "Add 4 cups flour and salt to the bowl. Stir until combined and a shaggy dough forms. Use dough hook attachment to knead dough on low speed 8 to 10 minutes, adding more flour as needed until a soft, smooth, elastic and only slightly sticky dough forms; OR, turn out shaggy dough on a lightly floured surface and knead by hand 10 to 15 minutes, adding more flour as needed until a soft, smooth, elastic and only slightly sticky dough forms.",
    "Shape dough into a ball and place in a large, lightly oiled bowl; turn to coat dough in oil. Cover loosely with plastic wrap or a tea towel and let rise in a warm place 1 ½ to 2 hours until doubled.",
    "Punch down risen dough. Divide in two, then shape each piece into a ball. Place dough on a lightly floured surface. Cover with a tea towel and let rest 20 minutes.",
    "Lightly grease two 9-by-5-inch loaf pans. Shape each ball of dough into a sandwich loaf (see an excellent how-to here). Place each loaf in prepared loaf pans. Cover with a tea towel and let rise 1 ½ to 2 ½ hours until dough just begins to peek out over the top of the loaf pans (mine never made it quite this far after 2 ½ hours, but all was well).",
    "Heat oven to 450 degrees F. Just before placing loaves in the oven, slash the tops a few times with a very sharp serrated knife. Immediately place loaves on center rack of oven and close the door. Bake 10 minutes at 450 degrees F, then reduce oven temperature to 400 degrees F. Bake another 25 to 30 minutes until loaves are deep golden brown on top and sound hollow when tapped on the bottom.",
    "Remove loaves from pans and transfer to a cooling rack to cool completely.",
    "NOTE: Prep time does not include the 5 days it takes to make the starter. Just FYI."
  ],
  "firstAdded": "2014-09-09T19:30:49.632000",
  "hash": "5bbc9a001b11c52e0dbc9753db4e6a6b769ad4c8",
  "href": "http://www.girlversusdough.com/2014/07/07/homemade-sourdough-bread/",
  "image": "https://farm3.staticflickr.com/2905/14557859326_5aafe1f9cf_z.jpg",
  "ingredients": [
    "0",
    "All-purpose flour",
    "Water (preferably filtered)",
    "2-quart glass or plastic container (not metal)",
    "Scale (optional, but preferred)",
    "Wooden mixing spoon",
    "Plastic wrap or container lid",
    "1",
    "1¼ cups warm water (about 115 degrees F)",
    "1½ teaspoons active dry yeast",
    "2 cups sourdough starter",
    "4 to 4½ cups all-purpose flour",
    "1 scant tablespoon salt"
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "water",
    "preferably",
    "filtered",
    "glass",
    "plastic",
    "container",
    "metal",
    "scale",
    "preferred",
    "wooden",
    "mixing",
    "wrap",
    "lid",
    "degrees",
    "active",
    "dry",
    "yeast",
    "sourdough",
    "starter",
    "scant",
    "salt"
  ],
  "title": "Sourdough Bread",
  "users": [
    null
  ]
}