{
  "hash": "e2193b309e8ad337f03dd7c93eb8dd1b0144de89",
  "title": "Ultimate roast potatoes",
  "image": "//www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe/recipe-image/2009/03/roast-potatoes-main.jpg?itok=tgvqPKlD",
  "href": "https://www.bbcgoodfood.com/recipes/ultimate-roast-potatoes",
  "extension": "Chrome",
  "firstAdded": "2020-01-14T12:24:00.760000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Put a roasting tin in the oven (one big enough to take the potatoes in a single layer) and heat oven to 200C/fan 180C/gas 6.",
    "Peel the 1kg potatoes and cut each into 4 even-sized pieces if they are medium size, 2-3 if smaller (5cm pieces).",
    "Drop the potatoes into a large pan and pour in enough water to barely cover them.",
    "Add salt, then wait for the water to boil. As soon as the water reaches a full rolling boil, lower the heat, put your timer on and simmer the potatoes uncovered, reasonably vigorously, for 2 mins.",
    "Meanwhile, put 100g duck or goose fat or 100ml olive oil into the hot roasting tin and heat it in the oven for a few mins, so it’s really hot.",
    "Drain the potatoes in a colander then shake the colander back and forth a few times to fluff up the outsides.",
    "Sprinkle with 2 tsp flour and give another shake or two so they are evenly and thinly coated.",
    "Carefully put the potatoes into the hot fat – they will sizzle as they go in – then turn and roll them around so they are coated all over.",
    "Spread them in a single layer making sure they have plenty of room.",
    "Roast the potatoes for 15 mins, then take them out of the oven and turn them over.",
    "Roast for another 15 mins and turn them over again. Put them back in the oven for another 10-20 mins, or however long it takes to get them really golden and crisp. The colouring will be uneven, which is what you want.",
    "Scatter with Maldon salt and serve straight away."
  ],
  "ingredients": [
    "0",
    "1kg Maris Piper potato Potato po-tate-ohThe world's favourite root vegetable, the potato comes in innumerable varieties. A member of…",
    "100g duck or goose fat fat (for a luxurious taste), or 100ml/3½fl oz olive oil",
    "2 tsp flour Flour fl-ow-erFlour is a powdery ingredient usually made from grinding wheat, maize, rye, barley or rice. As…",
    "Maldon salt, to serve"
  ],
  "__v": 1
}