{
  "hash": "02454d154c2f78630e89ada95b419138a55dbc16",
  "title": "Bistro Flank Steak Sandwich",
  "image": "http://77easyrecipes.com/wp-content/uploads/2016/07/Bistro-Flank-Steak-Sandwich.jpg",
  "href": "http://77easyrecipes.com/bistro-flank-steak-sandwich/",
  "extension": "Chrome",
  "firstAdded": "2017-02-12T22:50:58.461000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat grill to medium-high.",
    "Place garlic in the center of a piece of foil and drizzle with oil. Gather the foil together at the top to form a sealed packet. Sprinkle both sides of steak with 1/4 teaspoon salt and pepper.",
    "Place the garlic packet over indirect heat or the coolest part of the grill. Place the steak and bell peppers over direct heat or the hottest part of the grill. Cook the garlic until soft and golden brown, 8 to 10 minutes. Cook the peppers, turning occasionally, until the skin is blistered on all sides, about 10 minutes total. Cook the steak, turning once, until desired doneness, about 6 minutes per side for medium. Transfer the garlic packet, peppers and steak to a clean platter. Tent the steak with foil to keep warm.",
    "Grill bread, turning once, until toasted, about 1 minute per side.",
    "When the peppers are cool enough to handle, peel and discard the stems, seeds and ribs. Slice into wide strips and toss with the remaining 1/4 teaspoon salt in a small bowl. Peel the garlic and place it and the oil from the packet in another small bowl. Add mayonnaise and mash with a fork until combined. Slice the steak very thinly.",
    "To assemble sandwiches, spread 1 scant teaspoon of the roasted garlic a&iuml;oli on each piece of bread. Divide greens, the sliced steak and grilled peppers among 4 slices of bread; top with the remaining bread."
  ],
  "ingredients": [
    "0",
    "6 cloves garlic, unpeeled",
    "1 tablespoon extra-virgin olive oil",
    "3/4 pound flank steak, trimmed",
    "1/2 teaspoon salt, divided",
    "1/4 teaspoon freshly ground pepper",
    "1 medium red bell pepper",
    "1 medium yellow bell pepper",
    "4 large slices whole-wheat country bread, cut in half, or 8 small slices",
    "2 tablespoons reduced-fat mayonnaise",
    "1 cup mixed salad greens"
  ],
  "__v": 1
}