{
  "hash": "26bc720f67f99fa10f4eff3691d85bf90fca9e5a",
  "title": "Warm kale salad with almonds & Serrano ham",
  "image": "http://www.bbcgoodfood.com/sites/bbcgoodfood.com/files/recipe_images/warm-kale-salad-with-almonds-serrano-ham.jpg",
  "href": "http://www.bbcgoodfood.com/recipes/warm-kale-salad-almonds-serrano-ham",
  "extension": "Chrome",
  "firstAdded": "2015-07-04T05:24:46.530000",
  "users": [
    null
  ],
  "keywords": [
    "banana",
    "shallot",
    "rounds",
    "oil",
    "kale",
    "stalks",
    "leaves",
    "roughly",
    "torn",
    "slices",
    "serrano",
    "cured",
    "ham",
    "celery",
    "angle",
    "shavings",
    "manchego",
    "cheese",
    "serve",
    "sherry",
    "vinegar",
    "extra",
    "virgin",
    "olive",
    "dijon",
    "mustard",
    "sugar",
    "raisins",
    "almonds",
    "good",
    "smoked",
    "paprika"
  ],
  "directions": [
    "0",
    "Heat oven to 200C/180C fan/gas 6. Toss the shallots with 1 tsp oil on a large non-stick baking tray. Separate the rings a little as you turn them in the oil. Roast for 10 mins, stirring halfway, until starting to soften and turn golden here and there.",
    "In a large bowl, whisk the vinegar, oil, mustard, sugar and some seasoning together to make the dressing, then tip in the raisins and leave to soak. In a smaller roasting tin, toss the almonds, oil, paprika and a pinch of sea salt. Rub the kale all over with 1 tsp vegetable oil and some seasoning.",
    "Remove the shallot tray from the oven, mix in the kale (it’s fine if it mounds a bit), then return the tray to the oven and put the almonds on the shelf below. Roast for 7 mins, giving the kale a turn halfway through, until crisp in some places, wilted in others.",
    "Ruffle the ham onto serving plates. Tip the kale, shallots and celery into the dressing bowl, make sure it coats the kale well, then mound on top of the ham and scatter with the almonds and the cheese, if using."
  ],
  "ingredients": [
    "0",
    "2 banana shallot, sliced into rounds",
    "2 tsp vegetable oil",
    "200g kale, large stalks removed, leaves roughly torn",
    "4-6 slices serrano ham or your choice of cured ham",
    "3 celery sticks, thinly sliced on an angle",
    "shavings of Manchego cheese, to serve (optional)",
    "1",
    "2 tbsp sherry vinegar",
    "2 tbsp extra virgin olive oil",
    "2 tsp Dijon mustard",
    "pinch of sugar",
    "2 tbsp raisins",
    "2",
    "2 tbsp whole blanched almonds",
    "½ tsp vegetable oil",
    "good pinch of sweet smoked paprika"
  ],
  "__v": 1
}