{
  "hash": "602ff89631571a98143e1b8732ca9c3ff44bedb6",
  "title": "Loaded Hasselback Potatoes with Chipotle Sour Cream",
  "image": "http://cdn0.thewickednoodle.com/wp-content/uploads/2014/10/Easy-Hasselback-Potatoes.jpg",
  "href": "http://www.thewickednoodle.com/hasselback-potatoes/",
  "firstAdded": "2015-02-08T22:25:34.117000",
  "users": [
    null
  ],
  "keywords": [
    "russet",
    "potatoes",
    "cleaned",
    "butter",
    "canola",
    "oil",
    "pinches",
    "kosher",
    "salt",
    "sharp",
    "cheddar",
    "cheese",
    "sour",
    "cream",
    "adobo",
    "chipotle",
    "peppers",
    "crumbled",
    "bacon",
    "chives"
  ],
  "directions": [
    "0",
    "Preheat the oven to 400F.",
    "Place a wooden spoon a cutting board. Place one potato right next to the spoon and, using the spoon as a guide, make slices across the width of the potato, stopping at the wooden spoon so you don't cut all the way through. Repeat with remaining potatoes and place in a baking dish.",
    "Mix together butter and oil (the oil will increase the smoke point of the butter, preventing it from burning in the oven, for this reason don't use olive oil). Slowly pour 1/2 of butter mixture over potatoes, taking care to get some between the slices. Season well with kosher salt.",
    "Roast potatoes until cooked through and soft all the way through, about an hour to an hour and 20 minutes, depending on the size of your potatoes. When cooked completely, remove from oven and sprinkle cheese over the top, pushing some down between the slices. Place back in oven for another five minutes or until cheese is melted.",
    "Stir together sour cream and adobo sauce. Top potatoes with chipotle sour cream, crumbled bacon and chives."
  ],
  "ingredients": [
    "0",
    "4 russet potatoes, cleaned",
    "1/3 cup butter, melted",
    "2 tablespoons vegetable or canola oil",
    "a few large pinches of kosher salt",
    "1/2 cup shredded sharp cheddar cheese",
    "1/2 cup sour cream",
    "2 tablespoons adobo sauce (from a can of chipotle peppers)",
    "1/2 cup crumbled bacon",
    "a few tablespoons chopped chives"
  ],
  "__v": 1
}