{
  "hash": "ef161832c8c3978bd737fe86ef5a773601d6965d",
  "title": "Amish \"Fancy\" Butter and Egg Dinner Rolls",
  "image": "http://gc.pinchstatic.com/recipe/658/6-5-8-1-2-0_normal.1604071643.jpg",
  "href": "http://www.justapinch.com/recipes/bread/sweet-bread/amish-fancy-butter-and-egg-dinner-rolls.html",
  "extension": "Chrome",
  "firstAdded": "2016-08-29T03:30:57.279000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1Please Note: The original family recipe does not contain any additional salt because you are using salted butter both in the dough and on top. Feel free to add a small amount, if you wish. However, it's not really necessary. Place warm water and sugar in mixer bowl. Stir until sugar is dissolved. Add yeast and mix well. Let stand for 10 minutes until it gets foamy.",
    "2Add very soft butter and beaten egg. Mix well. With dough hook, gradually start to mix in flour. Add flour until a ball of dough forms and cleans bottom and sides of mixer bowl. Dough should not be sticky to the touch. When you reach this point, set on setting 2 and knead for 5 minutes.",
    "3Remove from mixer bowl and place in a large buttered bowl. Cover with saran wrap sprayed with cooking spray. Heat oven to 200 degrees. Place bowl on top of a hot pad and place on back burner. Allow to rise until doubled, about an hour.",
    "4Punch dough down. Divide into 12 equal pieces and form into rolls. I just learned this method of forming rolls on my trip to an Amish community. They could form a dozen of these rolls in minutes. Here is a great link showing how it's done.\nmelskitchencafe.com/tutorial-shaping...",
    "5Place rolls in a greased 13x9 baking pan, sides gently touching. (Rolls may not fill pan at this point, but that's ok. As long as you keep them together, as a group, with sides lightly touching.) Cover with sprayed saran wrap and return to top of stove to rise, 35-45 minutes. When they are large, light and fluffy, bake at 350 degrees for approximately 20 minutes. (Watch closely as all ovens are different.)",
    "6Remove from oven and gently brush with melted butter. Enjoy!",
    "7For Crescent Rolls: After first rise, place dough on lightly floured counter (1-2 TB.) Form into a 13-14\" circle. Using a pizza cutter, cut into 8 triangles. (For smaller crescents, you could cut into 10 triangles. Cutting into 8 makes a very large roll.)",
    "8Starting at wide end, roll to pointed end. Use a few drops of water to seal tip. Bend slightly forming crescent, then place on greased baking sheet, tip tucked underneath.",
    "9Let rise until doubled and then continue on as for round dinner rolls, brushing with melted butter when done. Baking time in my oven was approximately 15-18 minutes.",
    "10This is how big they are if you make 8. They are big boys. Cutting into 10 equal pieces would make a smaller dinner roll."
  ],
  "ingredients": [
    "0",
    "1 cup warm water (think warm bath water)",
    "1 pkg. red star quick-rise yeast",
    "1/4 cup sugar",
    "3 tb. very soft butter",
    "1 egg, beaten",
    "3¼-3½ cups flour"
  ],
  "__v": 1
}