{
  "__v": 3,
  "directions": [
    "0",
    "To the bowl of a stand mixer fitted with the paddle attachment (or large mixing bowl and electric mixer) combine the butter, Nutella, sugars, egg, vanilla, and beat on medium-high speed until creamed and well combined, about 4 minutes.",
    "Stop, scrape down the sides of the bowl, and add the flour, cornstarch, baking soda, optional salt, and beat on low speed until just combined, about 1 minute.",
    "Stop, scrape down the sides of the bowl, and add the white and chocolate chips, and beat on low speed until just combined, about 30 seconds.",
    "Using a large cookie scoop, 1/4-cup measure, or your hands, form approximately 11 equal-sized mounds of dough, roll into balls, and flatten slightly. Tip - Strategically place a few chocolate chips right on top of each mound of dough by taking chips from the underside and adding them on top.",
    "Place mounds on a large plate or tray, cover with plasticwrap, and refrigerate for at least 2 hours, up to 5 days. Do not bake with unchilled dough because cookies will bake thinner, flatter, and be more prone to spreading.",
    "Preheat oven to 350F, line a baking sheet with a Silpat or spray with cooking spray. Place dough mounds on baking sheet, spaced at least 2 inches apart (I bake 8 cookies per sheet) and bake for about 9 minutes, or until edges have set and tops are just set, even if slightly undercooked and glossy in the center; don't overbake. Cookies firm up as they cool. Allow cookies to cool on baking sheet for about 10 minutes before serving. I let them cool on the baking sheet and don't use a rack.",
    "Cookies will keep airtight at room temperature for up to 1 week or in the freezer for up to 6 months. Alternatively, unbaked cookie dough can be stored in an airtight container in the refrigerator for up to 5 days, or in the freezer for up to 4 months, so consider baking only as many cookies as desired and save the remaining dough to be baked in the future when desired."
  ],
  "firstAdded": "2014-06-12T09:12:47.321000",
  "hash": "e1fbf4b571de0705444d243051b77f7637c8e35d",
  "href": "http://www.averiecooks.com/2014/05/soft-and-chewy-nutella-white-chocolate-chip-cookies.html",
  "image": "http://www.averiecooks.com/wp-content/uploads/2014/05/nutellawhitechoccookies-10.jpg",
  "ingredients": [
    "0",
    "1/2 cup unsalted butter, softened (1 stick)",
    "heaping 1/3 cup Nutella (stir well before adding)",
    "1/2 cup light brown sugar packed",
    "1/4 cup granulated sugar",
    "1 large egg",
    "2 teaspoons vanilla extract",
    "1 3/4 cups all-purpose flour",
    "2 teaspoons cornstarch",
    "1 teaspoon baking soda",
    "pinch salt, optional and to taste",
    "1 cup white chocolate chips",
    "1 cup semi-sweet chocolate chips"
  ],
  "keywords": [
    "unsalted",
    "butter",
    "softened",
    "heaping",
    "nutella",
    "stir",
    "adding",
    "light",
    "brown",
    "sugar",
    "granulated",
    "egg",
    "vanilla",
    "allpurpose",
    "flour",
    "cornstarch",
    "baking",
    "soda",
    "salt",
    "white",
    "chocolate",
    "chips",
    "semisweet"
  ],
  "title": "Soft and Chewy Nutella White Chocolate Chip Cookies",
  "users": [
    null
  ]
}