{
  "hash": "5ec15da5d5ce259a766e2bc2bdd5279fef08558a",
  "title": "INSTANT POT (OR STOVETOP) LOW-CARB LOADED CAULIFLOWER SOUP",
  "image": "",
  "href": "https://kalynskitchen.com/instant-pot-low-carb-loaded-cauliflower-soup/",
  "extension": "",
  "firstAdded": "2017-10-09T18:24:49.953000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Peel onion and chop into small pieces. Cut away the leaves of the cauliflower and some of the stem, keeping the core part. Coarsely chop cauliflower into pieces.",
    "Turn Instant Pot or pressure cooker to SAUTE and melt the butter; then add the onion and cook 2-3 minutes. Then add the chopped cauliflower, chicken stock, garlic powder, and salt. Lock the lid, use the MANUAL setting and cook on HIGH PRESSURE for 5 minutes. Quick release the pressure.",
    "While the soup cooks, prepare the cream cheese cubes, grated sharp cheddar, and half and half. Also cook and crumble the bacon, dish up sour some sour cream and extra grated cheese, and slice the green onions for toppings. (I used pre-cooked bacon that I crisped in the microwave and blotted off the extra fat.)",
    "Check to make sure the cauliflower is very tender; then turn the Instant Pot to KEEP WARM (use simmer or low for other pressure cookers.) Use an immersion blender, blender, or food processor to puree the soup. (I highly recommend using an immersion blender to puree the soup in the pressure cooker if you have one. Be very careful with the hot liquid if you remove it to a blender or food processor to puree.) Check the thickness of the soup and add more stock if you want it thinner or simmer a little to reduce if it seems too thin.",
    "Add the grated cheese and cream cheese cubes and let them melt, then stir to combine. Add the half and half, heat through, and season with salt and fresh-ground black pepper. (Taste before you add more salt.) Serve hot, with grated cheese, sour cream, crumbled bacon, and green onion to add at the table"
  ],
  "ingredients": [
    "0",
    "1/2 onion, chopped small",
    "2 T butter or olive oil",
    "1 large head of cauliflower, leaves and stem removed and the rest coarsely chopped. (About 7-8 cups chopped cauliflower. You can use the core.)",
    "3 cups (24 oz.) chicken stock (I would use flavorful homemade chicken stock, or chicken stock from a carton) plus a little more to thin soup if needed",
    "1 tsp. garlic powder",
    "1 tsp. kosher salt",
    "4 oz. cream cheese, cut into cubes",
    "1 cup grated sharp or extra sharp cheddar cheese (We used a mix of cheeses, but next time Kara and I agreed we would use mostly extra sharp cheddar.)",
    "1/2 cup half and half (or milk)"
  ],
  "__v": 1
}