{
  "hash": "7130d161c8d6e090df0d7a05c57853a86916220b",
  "title": "St. Patrick’s Favorite Guinness Beef Stew with Potatoes, Rich Caramelized Onions & Cabbage, topped with Melty Garlic-Cheese Toast",
  "image": "http://thecozyapron.com/wp-content/uploads/2014/03/stpatricks-guinness-stew_03-09-14_4_ca.jpg",
  "href": "http://thecozyapron.com/st-patricks-favorite-guinness-beef-stew-the-perfect-excuse-to-add-a-bit-of-merriment-lightness/",
  "extension": "Chrome",
  "firstAdded": "2017-02-18T21:08:14.401000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large bowl, toss the beef stew cubes with a couple of pinches of salt and black pepper, plus the flour, to coat.",
    "-Place a large soup/stew pot over medium high/high heat, and drizzle in about 2-3 tablespoons of the oil; once the oil is hot, add the beef in (work in a couple of batches, if necessary) and leave it undisturbed for a couple of minutes, to allow it to form a crust on the bottom, and brown; stir the meat, and allow it to continue to brown for a few minutes more until nicely caramelized with a crust on all sides.",
    "-Remove the beef with a slotted spoon, and set aside for a few moments.",
    "-Add another drizzle or two of oil into the pot, and add in the onions; allow them to cook for about 10 minutes, or until they begin to become golden-brown, and slightly caramelized.",
    "-Next, add in the Guinness Stout, and allow it to reduce for about 5-6 minutes, still on fairly high heat, or until slightly syrupy and thickened.",
    "-Next, add in the herbs de Provence, the granulated onion and garlic, plus the pressed cloves of garlic, and stir to incorporate; add the beef back in with all of it’s juices, then the potatoes and the cabbage, and carefully stir to combine.",
    "-Add in the beef stock, cover with a lid slightly askew to allow just a little steam to escape, and reduce the heat to low to gently simmer the stew for about 1 ½ hours, or until the beef is very tender.",
    "-To finish, add in the chopped parsley and the vinegar, and check your seasoning to see if you need any additional salt or black pepper; to serve, ladle into bowl, top with a garlic toast, and sprinkle on a liberal amount of the cheese; then place on a sheet tray under the broiler just until the cheese is melted and gooey.",
    "Garlic Toasts Ingredients:",
    "• 2 tablespoons melted butter",
    "• French baguette, sliced on the bias into 6 slices",
    "• Pinch salt",
    "• 1 whole garlic clove, paper removed",
    "Preparation:",
    "-Preheat oven/toaster oven to 400°, and line a small baking sheet with foil.",
    "-Brush some of the melted butter onto the slices of baguette, and sprinkle with a pinch of salt; place into the oven to toast until golden-brown, roughly 8-10 minutes.",
    "-Rub the garlic clove lightly over the toasted bread, and set aside until ready to add to soup and top with shredded cheese to melt.",
    "Pinterest3.5k",
    "Facebook0",
    "Twitter0",
    "Tumblr0",
    "Reader Interactions",
    "COMMENTS",
    "dalton says",
    "October 4, 2015 at 12:00 pm",
    "I love guinness and soup. I love this combo. In the past I made guinness ice cream floats which proved to be delicious!",
    "REPLY",
    "LEAVE A REPLY",
    "Your email address will not be published. Required fields are marked *",
    "Comment",
    "Name *",
    "Email *",
    "Website",
    "Primary Sidebar",
    "Search this website",
    "HELLO! AHOJ!",
    "Welcome to The Cozy Apron—so glad to have you as a guest at my table! Here's where I share my passion for food, people and life through my culinary creations and my writing; and where my husband shares his love for food photography and all things visual. MORE...",
    "Search this website",
    "NEWSLETTER",
    "MORE TO LOVE",
    "Falafel Wrap with Spicy Hummus, and Seeking out Those Flavors That Elevate and Warm Instead",
    "Steak and Ale Soup with Mushrooms, and the Process of Transformation",
    "Lemon Chicken Pesto Bowls, and an Aspiration to Build Bridges in This New Year",
    "Italian Vegetable Soup with Spicy Sausage and Gnocchi, and Finding Excitement in a Fresh, New Year",
    "Spicy Orange Chicken Wings, and the Deliciousness of Those Sweet and Spicy Moments of Life",
    "IN THE PRESS:",
    "TAGS",
    "apples asian autumn avocado bacon beef cake caramelized onions cheese chicken chocolate Christmas curry dip fried garlic Italian lemon marinara mashed potatoes meatballs mushrooms parmesan pasta potatoes quinoa rice roasted garlic salad salmon sandwich sausage soup spinach steak stew stuffing Thanksgiving tomatoes turkey vegetables vegetarian vinaigrette whipped cream white beans",
    "NEWSLETTER",
    "COPYRIGHT © 2012-2016 · THE COZY APRON | INGRID BEER | PRIVACY POLICY",
    "Select Directions",
    "(note: you can drag this box around to make it easier to highlight the recipe)",
    "Please highlight the directions for this recipe and click \"Next\"",
    "Back"
  ],
  "ingredients": [
    "0",
    "1 ½ pounds lean beef stew meat, cut into bite-size chunks",
    "• Salt",
    "• Black pepper",
    "• 2 tablespoons flour",
    "• Canola oil",
    "• 2 onions, quartered and sliced",
    "• 1 bottle (11.2 fl ounces) Guinness draught",
    "• ¾ teaspoon herbs de Provence",
    "• ¼ teaspoon granulated onion",
    "• ¼ teaspoon granulated garlic",
    "• 3 cloves garlic, pressed through garlic press",
    "• 2 large russet potatoes, peeled and diced",
    "• ½ head cabbage, halved again & cored, then shredded",
    "• 4 cups beef stock, hot",
    "• 1 tablespoon chopped flat-leaf parsley",
    "• 2 teaspoons rice vinegar (you can also use white, but I prefer the milder flavor of the rice)",
    "• Garlic Toasts, for garnish (recipe below)",
    "• ½ cup shredded Irish gouda (or Irish cheddar) cheese"
  ],
  "__v": 1
}