{
  "hash": "a2c8082a40de57cc54a728a1160a57b73b3d7fa3",
  "title": "BA’s Best Baked Ziti",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/bas-best-baked-ziti",
  "extension": "Chrome",
  "firstAdded": "2017-05-22T15:15:39.321000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparation",
    "Heat butter in a medium saucepan over medium until foamy. Sprinkle flour over and cook, whisking constantly, 1 minute. Gradually whisk in warm milk. Bring mixture to a boil, reduce heat, and simmer, whisking often, until béchamel is thickened to about the consistency of heavy cream and no longer feels grainy when rubbed between your fingers, 8–10 minutes (thoroughly cooking the mixture ensures a creamy sauce and eliminates any raw flour flavor). Remove from heat and add 2 cups Parmesan, whisking until cheese is melted and sauce is smooth. Set aside.",
    "Heat oil in a large saucepan over medium-high. Cook pancetta, stirring often, until golden brown, about 2 minutes. Add onion, garlic, and red pepper flakes; season with salt and pepper. Cook, stirring often, until onion is golden and soft, 8–10 minutes. Add tomato paste and cook, stirring, until slightly darkened, about 2 minutes.",
    "Add whole peeled tomatoes, crushing with your hands as you go, and season with salt and pepper. Bring sauce to a simmer and cook, stirring often, until slightly reduced and flavors have melded, 20–25 minutes. Let cool slightly, then transfer to a blender; pulse until mostly smooth (or use an immersion blender and purée directly in pot). Stir in basil and season with salt and pepper.",
    "Meanwhile, preheat oven to 350°. Cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente, about 5 minutes (the pasta will continue to cook in the oven); drain.",
    "Transfer reserved béchamel to a large bowl; add pasta and mozzarella and toss to combine. Add all but 1 cup tomato sauce and gently fold mixture a few times, leaving streaks of béchamel.",
    "Transfer pasta mixture to a 13x9\" or other 3-quart baking dish, dollop with remaining tomato sauce, and scatter remaining Parmesan over pasta. Bake until mozzarella is melted and sauce is bubbling around the edges, 15–20 minutes.",
    "Heat broiler. Broil until pasta and cheese are dark brown in spots, about 4 minutes. Let pasta sit 5 minutes before serving."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "6 SERVINGS",
    "2 tablespoons unsalted butter",
    "2 tablespoons all-purpose flour",
    "2¼ cups whole milk, slightly warmed",
    "2½ cups grated Parmesan, divided",
    "Kosher salt, freshly ground pepper",
    "¼ cup olive oil",
    "1 ounce pancetta (Italian bacon), finely chopped",
    "1 large onion, chopped",
    "4 garlic cloves, chopped",
    "½ teaspoon crushed red pepper flakes",
    "2 tablespoons tomato paste",
    "1 28-oz. can plus 1 14-oz. can whole peeled tomatoes",
    "¼ cup chopped fresh basil",
    "1 pound ziti, penne, or rigatoni",
    "1 pound fresh mozzarella, cut into ½\" pieces"
  ],
  "__v": 1
}