{
  "hash": "184446d8152f48d6cdf0d76847e848fc391dd593",
  "title": "WHITE CHOCOLATE CRANBERRY OATMEAL COOKIES",
  "image": "https://www.kitchentreaty.com/wp-content/uploads/2009/11/white-chocolate-chip-cranberry-oatmeal-cookies-2-220x290.jpg",
  "href": "https://www.kitchentreaty.com/oatmeal-cranberry-white-chocolate-chip-cookies/",
  "extension": "Chrome",
  "firstAdded": "2018-02-26T19:35:44.567000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 375 degrees Fahrenheit.",
    "Place butter in a large mixing bowl or the bowl of a stand mixer. Beat butter with hand mixer or stand mixer until pale and fluffy, about 2 minutes. Add the brown sugar and mix again until fluffy, about 2 more minutes. Add eggs one at a time, mixing to incorporate completely each time. Add the vanilla and mix to combine.",
    "To a large bowl, add the oats, flour, baking soda, and salt. Stir with a whisk or wooden spoon until combined.",
    "Add the dry ingredients to the wet and mix JUST until the flour is combined. (Don’t overmix or the gluten will develop in the flour and give your cookies an unpleasant texture!)",
    "Add the white chocolate chips and cranberries. Stir them in with a sturdy wooden spoon, just until incorporated.",
    "Drop spoonfuls or scoopfuls onto an ungreased cookie sheet (I like to line mine with these parchment paper sheets for easy clean-up). Lately I’ve been making these cookies a bit bigger, with a cookie scoop that’s the equivalent of about 1/4 cup. Make yours as small or large as you like!",
    "Bake until they spread, start to set, and are beginning to brown, 8-10 minutes.",
    "Remove from oven and let cool on the cookie sheet for about 5 minutes. Transfer to a wire rack and let cool the rest of the way.",
    "Cookies keep in an airtight container at room temperature for about 4 days."
  ],
  "ingredients": [
    "0",
    "1 cup unsalted butter, room temperature",
    "1 cup dark brown sugar",
    "2 large eggs",
    "2 teaspoons pure vanilla extract",
    "2 cups old-fashioned rolled oats",
    "2 cups all-purpose flour",
    "1 1/2 teaspoons baking soda",
    "1/2 teaspoon fine-grain sea salt or table salt",
    "1 cup dried cranberries",
    "1 (11-ounce) bag white chocolate chips (about 2 cups)"
  ],
  "__v": 1
}