{
  "hash": "156e57d7a8b9617d927b5d88341253bb6fbafc26",
  "title": "Lemon Tart",
  "image": "http://recipe-folder.com/img/recipe-images/035/471/1297360835.jpg",
  "href": "http://www.foodnetwork.com/recipes/jamie-deen/lemon-tart-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-06-24T04:28:34.297000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the crust: Toast the almonds in a dry skillet over medium heat, while stirring, until just slightly blonde, about 3 minutes. Remove to a plate to cool completely. You can stick in the freezer to hurry up this process.",
    "Add the flour, confectioners' sugar and salt to the bowl of a food processor and pulse a few times to mix everything together. This will help break up potential lumps in the confectioners' sugar. Add the cooled almonds and pulse again for 30 seconds. Add the butter and pulse until the dough looks like small clumps. Add the beaten egg and pulse in long increments, again until the dough comes together. It should be bunched up in a few balls.",
    "Lightly dust your workspace with flour. Spray a 9-inch tart pan with a removable bottom with nonstick spray. Remove the dough from the food processor. Knead lightly a few times to incorporate all the dry ingredients, and then form into a flat disc. Press the dough into the prepared tart pan. Chill for 30 minutes in the freezer.",
    "Preheat the oven to 350 degrees F.",
    "Remove the tart from the freezer and place on a baking sheet. Prick the bottom of the tart all over with a fork to prevent the dough from puffing while it bakes. Line the tart with parchment paper and pie weights on top (dried beans will work in a pinch). Bake the crust for 25 minutes. Remove the tart from the oven, remove the parchment and pie weights and bake for 2 more minutes. If the tart has puffed at all during baking, you can press the dough back down with a spoon.",
    "While crust bakes, make the curd: Whisk together the granulated sugar, lemon juice, salt and eggs in a heavy-bottomed medium saucepan off the heat. Once the mixture is well blended, place over medium heat and cook while stirring, until the curd is thick, about 8 minutes. The curd is cooked when it reaches 170 degrees F. Whisk in the butter piece by piece; it will loosen up slightly. Pour into a large measuring cup.",
    "Remove the crust from the oven and carefully add the lemon curd. Do not overfill the tart dough; fill just below the top of the tart. Bake the tart until set, about 10 more minutes. Remove from the oven and let cool completely before serving. Remove the tart ring and slice into pieces. Garnish with confectioners' sugar if desired.",
    "Recipe courtesy of Jamie Deen"
  ],
  "ingredients": [
    "0",
    "1/4 cup blanched slivered almonds",
    "1 1/4 cups all-purpose flour, plus more for dusting",
    "1/2 cup confectioners' sugar",
    "1/4 teaspoon kosher salt",
    "10 tablespoons unsalted butter, very cold, sliced",
    "1 large egg, lightly beaten",
    "Nonstick spray",
    "1 1/4 cups granulated sugar",
    "3/4 cup freshly squeezed lemon juice (4 to 5 lemons)",
    "1/4 teaspoon kosher salt",
    "4 large eggs plus 1 large yolk",
    "6 tablespoons unsalted butter, cut into tablespoon size slices",
    "Confectioners' sugar, for garnish, optional"
  ],
  "__v": 1
}