{
  "hash": "e5d562b8aebfe2cc3302e3a4fe340e802910564b",
  "title": "Lorraine Pascale's big fat carrot cake",
  "image": "http://goodtoknow.media.ipcdigital.co.uk/111/000006644/6b50_orh412w625/LP--610.jpg",
  "href": "http://www.goodtoknow.co.uk/recipes/512793/lorraine-pascale-s-big-fat-carrot-cake",
  "extension": "Chrome",
  "firstAdded": "2016-02-01T07:18:32.704000",
  "users": [
    null
  ],
  "keywords": [
    "oil",
    "eggs",
    "lightly",
    "soft",
    "dark",
    "brown",
    "sugar",
    "carrots",
    "zest",
    "oranges",
    "selfraising",
    "flour",
    "salt",
    "bicarbonate",
    "soda",
    "mixed",
    "spice",
    "seeds",
    "pod",
    "drops",
    "vanilla",
    "cream",
    "cheese",
    "frosting",
    "icing",
    "butter",
    "cubed",
    "lemon",
    "drop",
    "lowfat",
    "chilled",
    "pecans",
    "walnuts",
    "decorate",
    "needthree",
    "round",
    "tins"
  ],
  "directions": [
    "0",
    "Method",
    "Preheat the oven to 180ºC (325ºF, gas mark 4). Prepare the tins by oiling the insides and lining the bases with baking paper.",
    "Put the oil, eggs, sugar, carrots and orange zest in a large bowl and mix with a wooden spoon. If you’re making all three tiers, you may have to do this in batches. Mix the flour, salt, bicarbonate of soda and mixed spice together, then sift into the bowl. Add the vanilla and lightly mix everything together until the mixture is uniform but still soft and runny.",
    "Ladle into the prepared tins and bake in the oven for 40–45 minutes. Ovens vary so have a peek after 30 mins to see how the cakes are getting on. The cakes are ready when the sponge springs back up if pushed lightly. A skewer inserted into the middle should come out clean.",
    "Leave to cool for 5 mins or so, then turn out onto a wire rack and peel off the paper.",
    "For the cream cheese frosting, mix the icing sugar, butter, lemon zest and vanilla together in a bowl, then whisk well to combine. Stir in the cream cheese. If the mixture looks too runny, put it in the fridge for 10–12 mins to harden up. When the cakes are cool, take two of them and use a large, sharp knife to slice off the domed tops, leaving them completely flat. Don’t slice the top off the third cake.",
    "Put a dollop of frosting in the middle of a serving plate or stand to stop the cake from sliding. Take one of the flattened cakes and place it on top. Then pop a big spoonful of frosting onto it and spread all over, leaving a 2.5cm (1in) gap around the edge so that the frosting does not squelch over too much when you add the next layer. Put the next flattened cake on top and repeat with more frosting. Put the unsliced tier on the top, cover generously with frosting and decorate with toasted nuts, if desired."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "525ml (18½ fl oz) vegetable oil",
    "9 eggs, lightly beaten",
    "525g (1lb 3oz) soft dark brown sugar",
    "420g (15oz) carrots, peeled and grated",
    "Grated zest of 3 large oranges",
    "525g (1lb 3oz) self-raising flour",
    "Pinch of salt",
    "1 tbsp bicarbonate of soda",
    "1½ tbsp mixed spice",
    "Seeds of 1 vanilla pod or 2 drops vanilla extract",
    "For the cream cheese frosting:",
    "200g (7oz) icing sugar",
    "40g (1½ oz) butter, cubed",
    "Finely grated zest of 1 lemon",
    "Seeds of ½ vanilla pod or 1 drop vanilla extract",
    "115g (4¼ oz) low-fat cream cheese, chilled",
    "Handful of pecans or walnuts, toasted to decorate",
    "You will also need:Three x 23cm (9in) round tins"
  ],
  "__v": 1
}