{
  "__v": 1,
  "directions": [
    "0",
    "Preheat your oven to 425°F. Line a baking sheet with parchment paper.",
    "In a large bowl, mix the cream cheese, salsa, lime juice, ground cumin, chili powder, onion powder and garlic. Once combined, stir in the cilantro and green onions. Add the chicken and cheese; mix thoroughly.",
    "(If you decided to prep this in advance, refrigerate the mixture at this point until ready to continue.)",
    "3. Working with a few tortillas at a time, heat them in the microwave between two paper towels until they are soft enough to roll (about 20 – 30 seconds).",
    "4. Spoon 2-3 Tablespoons of the chicken mixture onto the lower third of a tortilla. Roll the tortilla as tightly as you can.",
    "Place the rolled tortilla seam side down on the baking sheet. Repeat with remaining tortillas until the mixture is gone. Make sure the taquitos are not touching each other. Spray the tops lightly with cooking spray and sprinkle with kosher salt.",
    "5. Bake for 15 – 20 minutes or until crisp and golden.",
    "Serve with salsa, sour cream or guacamole.",
    "**To freeze: Before baking, flash freeze the taquitos in a single layer on a baking sheet then place in a labeled freezer bag and store up to 3 months. To bake a frozen taquito (no need to thaw first): Preheat oven to 425°F and bake for 20 minutes. (Flash Freeze means freezing the taquitos in a single layer for 15-20 minutes (until hardened) so that when you add them to the freezer bag, they will not all stick together)."
  ],
  "firstAdded": "2014-11-17T23:54:51.199000",
  "hash": "8d092df70fea7b0541d94aec209c9582fb69ae3b",
  "href": "http://www.bigoven.com/recipe/baked-creamy-chicken-taquitos/263751",
  "image": "",
  "ingredients": [
    "0",
    "3 ounces cream cheese; softened",
    "1/4 cup green salsa",
    "1 Tbsp fresh lime juice (juice from half a lime)",
    "1/2 tsp ground cumin",
    "1 tsp chili powder",
    "1/2 tsp onion powder",
    "2 cloves garlic minced",
    "3 Tbsp chopped cilantro",
    "2 Tbsp sliced green onions",
    "2 cups shredded cooked chicken",
    "1 cup shredded Mexican flavored cheese",
    "small flour or corn tortillas",
    "kosher salt",
    "cooking spray"
  ],
  "keywords": [
    "cream",
    "cheese",
    "softened",
    "green",
    "salsa",
    "juice",
    "lime",
    "cumin",
    "chili",
    "onion",
    "garlic",
    "cilantro",
    "onions",
    "chicken",
    "mexican",
    "flavored",
    "flour",
    "corn",
    "tortillas",
    "kosher",
    "salt",
    "cooking",
    "spray"
  ],
  "title": "BAKED CREAMY CHICKEN TAQUITOS",
  "users": [
    null
  ]
}