{
  "hash": "a01fe46ee227d3ed8af22fa16639b0b99468e9b4",
  "title": "Creme Brulee",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/alton-brown/creme-brulee-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-08-03T19:19:10.833000",
  "users": [
    null
  ],
  "keywords": [
    "cream",
    "vanilla",
    "bean",
    "split",
    "scraped",
    "sugar",
    "divided",
    "egg",
    "yolks",
    "quarts",
    "hot",
    "water"
  ],
  "directions": [
    "0",
    "Preheat the oven to 325 degrees F.",
    "Place the cream, vanilla bean and its pulp into a medium saucepan set over medium-high heat and bring to a boil. Remove from the heat, cover and allow to sit for 15 minutes. Remove the vanilla bean and reserve for another use.",
    "In a medium bowl, whisk together 1/2 cup sugar and the egg yolks until well blended and it just starts to lighten in color. Add the cream a little at a time, stirring continually. Pour the liquid into 6 (7 to 8-ounce) ramekins. Place the ramekins into a large cake pan or roasting pan. Pour enough hot water into the pan to come halfway up the sides of the ramekins. Bake just until the creme brulee is set, but still trembling in the center, approximately 40 to 45 minutes. Remove the ramekins from the roasting pan and refrigerate for at least 2 hours and up to 3 days.",
    "Remove the creme brulee from the refrigerator for at least 30 minutes prior to browning the sugar on top. Divide the remaining 1/2 cup vanilla sugar equally among the 6 dishes and spread evenly on top. Using a torch, melt the sugar and form a crispy top. Allow the creme brulee to sit for at least 5 minutes before serving.",
    "Propane Gas Torch Safety: Propane gas torches are highly flammable and should be kept away from heat, open flame, and prolonged exposure to sunlight. They should only be used in well-ventilated areas. When lighting a propane gas torch, place the torch on a flat, steady surface, facing away from you. Light the match or lighter and then open the gas valve. Light the gas jet, and blow out the match. Always turn off the burner valve to \"finger tight\" when finished using the torch. Children should never use a propane gas torch without adult supervision.",
    "Recipe courtesy of Alton Brown, 2005"
  ],
  "ingredients": [
    "0",
    "1 quart heavy cream",
    "1 vanilla bean, split and scraped",
    "1 cup vanilla sugar, divided",
    "6 large egg yolks",
    "2 quarts hot water"
  ],
  "__v": 1
}