{
  "hash": "c7cc1cb43152023f08d9d070163648c2de7c86e2",
  "title": "Matar Soy Paneer Recipe (Peas and Tofu in Spicy Sweet Sauce)",
  "image": "http://www.vietworldkitchen.com/.a/6a00d8341ef22f53ef017ee7942d0f970d-500wi",
  "href": "http://www.vietworldkitchen.com/blog/2013/01/matar-soy-paneer-recipe-peas-and-tofu-in-spicy-sweet-sauce.html",
  "extension": "Chrome",
  "firstAdded": "2015-06-20T10:27:04.120000",
  "users": [
    null
  ],
  "keywords": [
    "firm",
    "extrafirm",
    "tofu",
    "salt",
    "canola",
    "oil",
    "cumin",
    "seeds",
    "medium",
    "yellow",
    "onion",
    "coriander",
    "turmeric",
    "moderately",
    "hot",
    "green",
    "chiles",
    "serrano",
    "ginger",
    "tomato",
    "puree",
    "water",
    "frozen",
    "peas",
    "fully",
    "partially",
    "thawed",
    "garam",
    "masala",
    "cilantro"
  ],
  "directions": [
    "0",
    "Instructions",
    "Cut the tofu into cubes about 3/4 inch (2 cm) big. Put into a bowl. Put into a shallow bowl. Dissolve 1 teaspoon salt in 2 cups (480 ml) of very hot water, then pour over the tofu. Set aside to soak for 15 minutes, then drain. Transfer the tofu to a non-terry dishtowel or double layer of paper towels placed atop a plate. Drain for 10 to 15 minutes.",
    "Heat a medium skillet over medium-high heat and add about half of the oil. Blot the tofu cubes dry, then panfry them in two batches for about 5 minutes, until light golden on 3 or 4 of the sides. Turn the tofu with chopsticks or a spatula during the frying and aim is to add a bit of character and depth to the tofu, not crisp it all over. Transfer to a plate, leaving the oil behind, and set aside. (You can do this a couple days in advance!)",
    "Lower the heat to medium-high and add the remaining oil. When hot, add the cumin seeds and stir for about 15 seconds until they’ve darkened. Dump in the onion and cook for about 8 minutes, stirring, until deep brown. Add the coriander, turmeric, chile, and ginger. Cook until aromatic and no longer raw smelling. Add the tomato, water and 1/2 teaspoon salt. Bring to a vigorous simmer and cook for 5 minutes to concentrate.",
    "Add the tofu cubes and cook for 5 minutes to allow the flavor to get absorbed. Add the peas and garam masala (if using), then heat until hot. Taste, season with extra salt, if needed. Stir in the cilantro, then transfer to a serving bowl."
  ],
  "ingredients": [
    "0",
    "14 to 16 ounces (390 to 450 g) firm or extra-firm tofu",
    "Salt",
    "3 tablespoons canola oil",
    "1 1/2 teaspoons cumin seeds",
    "1 medium yellow onion, finely chopped",
    "1 1/2 tablespoons ground coriander",
    "3/4 teaspoon turmeric",
    "2 moderately hot green chiles, such as Serrano, finely chopped",
    "1 tablespoon finely chopped fresh ginger",
    "1 1/2 cups (360 ml) crushed tomato or tomato puree",
    "About 1 1/2 cups (360 ml) water",
    "1 1/2 cups (7 oz / 210 g) frozen peas, fully or partially thawed",
    "3/4 teaspoon garam masala (optional)",
    "2 to 3 tablespoons chopped cilantro"
  ],
  "__v": 1
}