{
  "hash": "62dd281518feb52fb98a69ec37d2d584256015eb",
  "title": "Tiramisù",
  "image": "http://www.giallozafferano.it/images/ricette/0/17/foto_hd/hd450x300.jpg",
  "href": "http://ricette.giallozafferano.it/Tiramisu.html",
  "extension": "Chrome",
  "firstAdded": "2016-04-11T10:30:15.248000",
  "users": [
    null
  ],
  "keywords": [
    "uova",
    "medie",
    "zucchero",
    "cucchiai",
    "caff",
    "mascarpone",
    "savoiardi",
    "caffe",
    "bagnare",
    "cacao",
    "polvere",
    "spolverizzare",
    "tiramis"
  ],
  "directions": [
    "0",
    "Per preparare il tiramisù, dividete gli albumi dai tuorli, aggiungete ai tuorli metà dello zucchero (e montate con uno sbattitore elettrico dotato di fruste fino ad ottenere un bel composto chiaro, spumoso e cremoso.",
    "Aggiungete il mascarpone al composto di tuorli, quindi occupatevi degli albumi: montateli, aiutandovi con una planetaria o sempre con uno sbattitore elettrico, e quando saranno semimontati aggiungete l'altra metà dello zucchero a pioggia e continuate a montare finchè non saranno a neve ben ferma.",
    "Una volta che gli albumi saranno montati alla perfezione aggiungeteli al composto di tuorli, zucchero e mascarpone. Fate questa operazione delicatamente, mescolando dal basso verso l'alto, con un cucchiaio in modo da non smontare gli albumi.",
    "Ora che la crema è pronta, disponetene un cucchiaio sul fondo di ogni coppetta, oppure in un'unica teglia, passate i savoiardi nel caffè facendo attenzione a non inzupparli troppo, quindi sistemateli nella coppetta tagliandoli secondo la forma del contenitore.",
    "Disponete un cucchiaio di crema sopra i savoiardi, livellate la crema e ricoprite con un altro strato di savoiardi imbevuti nel caffè se i primi li avete disposti verticalmente, questi ultimi poneteli orizzontalmente (e viceversa), livellate bene e spolverizzate con il cacao amaro in polvere.",
    "Se volete potete cospargere la superficie della coppetta con qualche ricciolo di cioccolato. Riponete in frigo per qualche ora per far compattare il dolce e buon appetito!"
  ],
  "ingredients": [
    "0",
    "6 uova medie",
    "120g zucchero + 2 cucchiai per il caffè",
    "500g mascarpone",
    "400g savoiardi",
    "caffe q.b per bagnare i savoiardi",
    "cacao in polvere q.b per spolverizzare il tiramisù"
  ],
  "__v": 4
}