{
  "hash": "f4e28f233dd277e93937f8cb7ef8a472923eb3ae",
  "title": "HOMEMADE CHEESY POTATOES",
  "image": "https://www.simplyscratch.com/wp-content/uploads/2018/03/DSC7356-720x720.jpg",
  "href": "https://www.simplyscratch.com/2014/04/homemade-cheesy-potatoes.html",
  "extension": "Chrome",
  "firstAdded": "2020-01-24T15:09:54.206000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Grease a 8x11 casserole dish with a little butter or olive oil spray.",
    "Add the cubed potatoes into a large pot of cold water, bring to a boil and cook until just tender yet still firm when pierced by a fork. Remove and drain the potatoes into a colander set into a sink. Let the potatoes cool slightly.",
    "In a 10-inch skillet add the remaining 4 tablespoons of butter. Over medium-low melt the butter and then add in the diced onions. Cook until just softened and add in the minced garlic. Cook for one minute.",
    "Sprinkle in the flour and stir, cooking for 1-2 minutes. Continue stirring, while pouring in the 1/2 cup of broth and 1/2 cup of whole milk. Continue to stir until thick, about 5 minutes.",
    "Remove the pan from the heat and stir in the sour cream.",
    "In a large bowl add in the cooled potatoes, sour cream mixture, green onions, 1 teaspoon salt, 1/2 teaspoon pepper and all of the grated cheese. Stir to combine and pour in the prepared pan.",
    "Bake in a 350 degree oven for 40 to 50 minutes or until bubbly and golden. Let cool for 10 minutes before serving."
  ],
  "ingredients": [
    "0",
    "YIELD: 6-8 SERVINGS",
    "HOMEMADE CHEESY POTATOES",
    "No frozen bags of hash browns, zero cans of condensed soup... just homemade cheesy potato goodness from scratch!",
    "prep time",
    "35 MINUTES",
    "cook time",
    "40 MINUTES",
    "total time",
    "1 HOUR 15 MINUTES",
    "INGREDIENTS",
    "3 pounds russet potatoes, roughly peeled and diced into large bite-size pieces",
    "4 tablespoons unsalted butter, divided plus 1 tablespoon for the baking dish",
    "1/2 cup diced yellow onion",
    "1 clove garlic, minced",
    "1/4 cup unbleached all-purpose flour",
    "1/2 cup low sodium chicken broth",
    "1/2 cup whole milk",
    "1 cup sour cream",
    "3 green onions, sliced",
    "1 teaspoon kosher salt",
    "1/2 teaspoon freshly ground black pepper",
    "1 (8 ounce) brick grated sharp or extra sharp cheddar or colby cheese*"
  ],
  "__v": 1
}