{
  "__v": 1,
  "directions": [
    "0",
    "Preparazione:",
    "Mentre l'acqua bolle e poi la pasta cuoce avremo tutto il tempo di fare il sugo.",
    "Pulite e private i peperoni dei semi. Tagliate il più grosso a julienne. Lavate i pomodori e tagliateli a pezzetti, come il peperone rimasto; mettete il tutto nel bicchiere del mixer con l'olio e il basilico e frullate il tutto. Aggiustate di sale e pepe e se volete aggiungete un pizzico di rosmarino e del peperoncino tritato. In una padella con un goccio d'olio fate imbiondire l'aglio. Aggiungete alla padella le julienne di peperoni e cuocete a fuoco medio per 5 minuti girando di tanto in tanto. Passato il tempo coprite con un coperchio e cuocete per altri 5minuti continuando a girare. Quando i peperoni saranno cotti (assaggiate un pezzetto per accertarvene) aggiungete la crema di pomodori e fate sobbollire. Quando la pasta sarà cotta, scolatela e versatela nel sugo facendola saltare un minuto. Servite con sopra una bella spolverata di formaggio e un filo d'olio a crudo.",
    "Consiglio",
    "Se in dispensa avete un goccino di panna aggiungetelo nel sugo che dovrebbe dare un po' di gusto in più.",
    "Io ho messo il basilico fresco perché ho una piantina in casa; in frigo ho sempre il basilico surgelato, va benissimo anche un cucchiaino di questo."
  ],
  "firstAdded": "2014-10-12T14:20:53.939000",
  "hash": "860a79893c56e866aac27c1f687861d76c4bbf89",
  "href": "http://divertirsimangiando.blogspot.it/2011/03/pasta-con-crema-di-pomodori.html",
  "image": "http://3.bp.blogspot.com/-pGfNljGDELo/TZOm7gG_HvI/AAAAAAAAAgQ/xEQrxVw2lgo/s640/Pasta+con+crema+di+pomodori.jpg",
  "ingredients": [
    "0",
    "Ingredienti per 2 studenti affamati:",
    "- 3etti di pasta Garofalo n°64",
    "- 8 pomodorini ciliegini",
    "- 2 peperoni",
    "- 2 cucchiai d'olio",
    "- 3-4 foglie di basilico",
    "- uno spicchio d'aglio",
    "- sale e pepe",
    "- formaggio grattugiato"
  ],
  "keywords": [
    "ingredienti",
    "studenti",
    "affamati",
    "etti",
    "pasta",
    "garofalo",
    "pomodorini",
    "ciliegini",
    "peperoni",
    "cucchiai",
    "dolio",
    "foglie",
    "basilico",
    "uno",
    "spicchio",
    "daglio",
    "sale",
    "pepe",
    "formaggio",
    "grattugiato"
  ],
  "title": "pesto Di Pomodori",
  "users": [
    null
  ]
}