{
  "__v": 1,
  "directions": [
    "0",
    "Pat short ribs dry with a paper towel. Season each piece of meat with salt and pepper. Heat the oil in a skillet over high heat. When hot, add the short ribs and brown, cooking about 3-4 minutes per side. Don't overcrowd the pan, work in batches, if necessary.",
    "After the ribs have browned, remove from carefully and set them at the bottom of your slow cooker. Take the pan off the heat briefly to cool down, then return to medium heat and add the shallots and celery. Saute for about five minutes until tender, then add the tomato paste. Mash the tomato paste into the veggies using a rubber spatula and continue to sauté on medium heat for another four minutes.",
    "Pour the wine and the beef broth into the skillet and stir. Whisk in the flour, making sure to break up any clumps. Add bay leaves, thyme and season with salt & pepper.",
    "Bring sauce to a boil, then to a simmer. Pour sauce right over ribs in the slow cooker. Place lid on slow cooker and cook on HIGH for seven to eight hours or on LOW for 11-12 hours. When done, the meat should literally be falling off the bone. Taste and season with additional salt & pepper, if necessary.",
    "I recommend serving these slow cooker short ribs over a bowl of creamy polenta, parmesan risotto or fresh egg noodles."
  ],
  "firstAdded": "2014-05-09T15:45:28.664000",
  "hash": "f4df60283b6cd403ede08013638495c1f8cbf2c0",
  "href": "http://thecornerkitchenblog.com/slow-cooker-beef-short-ribs/",
  "image": "",
  "ingredients": [
    "0",
    "3 ½ lbs beef chuck short ribs",
    "2 whole shallots, minced",
    "3 stalks celery, diced",
    "2 tablespoon vegetable oil",
    "3 cups dry red wine",
    "1 cup beef broth",
    "2 tablespoons tomato paste",
    "2 tablespoons all purpose flour",
    "2 bay leaves",
    "1 tablespoon thyme",
    "salt",
    "fresh ground pepper"
  ],
  "keywords": [
    "lbs",
    "beef",
    "chuck",
    "short",
    "ribs",
    "shallots",
    "stalks",
    "celery",
    "oil",
    "dry",
    "red",
    "wine",
    "broth",
    "tomato",
    "purpose",
    "flour",
    "bay",
    "leaves",
    "thyme",
    "salt",
    "pepper"
  ],
  "title": "Slow Cooker Beef Short Ribs",
  "users": [
    null
  ]
}