{
  "__v": 1,
  "directions": [
    "0",
    "In a large skillet, heat 1/4 cup oil over medium heat. Add garlic and ginger and cook, stirring occasionally, until crisp and brown. With a slotted spoon, transfer to paper towels and salt lightly.",
    "[It hadn't been clear to me whether I was supposed to remove the old oil and bits of garlic I didn't get out and wipe out the pan before proceeding. I didn't. Everything worked out fine.] Reduce heat under skillet to medium-low and add 2 tablespoons oil and leeks. Cook about 10 minutes, stirring occasionally, until very tender but not browned. Season lightly with salt.",
    "Raise heat to medium and add rice. Cook, stirring well, until heated through. [I cooked this slightly longer because I wanted my rice to pick up a little more color and crunch.] Season to taste with salt.",
    "In a nonstick skillet (it just makes it easier) fry eggs in remaining oil, sunny-side-up, until edges are set but yolk is still runny.",
    "Divide rice among four dishes. Top each with an egg and drizzle with 1/2 teaspoon sesame oil and 1 teaspoon soy sauce. Sprinkle crisped garlic and ginger over everything and serve."
  ],
  "firstAdded": "2014-06-19T07:58:35.099000",
  "hash": "86fd971bd065ebb0ff02172ccb62657ba56a16ad",
  "href": "http://smittenkitchen.com/blog/2010/02/ginger-fried-rice/",
  "image": "http://farm5.static.flickr.com/4041/4330410574_4ea1960a8f.jpg",
  "ingredients": [
    "0",
    "1/2 cup peanut oil",
    "2 tablespoons minced garlic",
    "2 tablespoons minced ginger",
    "Salt",
    "2 cups thinly sliced leeks, white and light green parts only, rinsed and dried",
    "4 cups day-old cooked rice; Vongerichten recommends jasmine (I used brown jasmine) but this is the perfect way to use up any leftover rice you have, especially from Chinese delivery",
    "4 large eggs",
    "2 teaspoons sesame oil (for some heat but the same awesome flavor, use hot sesame oil)",
    "4 teaspoons soy sauce"
  ],
  "keywords": [
    "peanut",
    "oil",
    "garlic",
    "ginger",
    "salt",
    "leeks",
    "white",
    "light",
    "green",
    "parts",
    "rinsed",
    "dayold",
    "vongerichten",
    "recommends",
    "used",
    "brown",
    "jasmine",
    "perfect",
    "way",
    "use",
    "leftover",
    "rice",
    "especially",
    "chinese",
    "delivery",
    "eggs",
    "heat",
    "awesome",
    "flavor",
    "hot",
    "sesame",
    "soy"
  ],
  "title": "Ginger Fried Rice",
  "users": [
    null
  ]
}