{
  "hash": "af164aa5f8e4db664b34abc22465dbf3ba29d1a1",
  "title": "BEEF JERKY",
  "image": "http://www.cooks.com/rec/view/",
  "href": "http://www.cooks.com/rec/view/0,1733,128180-240192,00.html",
  "keywords": [
    "lean",
    "beef",
    "strips",
    "hickory",
    "mesquite",
    "smoke",
    "flavoring",
    "soy",
    "teriyaki",
    "salt",
    "worcestershire",
    "garlic",
    "onion",
    "cracked",
    "black",
    "pepper",
    "cayenne",
    "molasses",
    "brown",
    "sugar",
    "barbecue",
    "ketchup"
  ],
  "directions": [
    "0",
    "Choose lean beef only, as fat goes rancid when making jerky. Remove all fat from meat.",
    "Beef top round, flank steak and rump work well. To make jerky that isn't hard to chew, slice across the grain no more than 1/4\" thick and don't overdry it. If you freeze meat for a short time, not until it is frozen solid, but just until ice crystals form and meat can still be pierced easily with the point of a knife, then it will be easier to slice thinly. You can also use an electric slicer (Rival or Chef's Choice make home type slicers if you'll be making a lot of jerky).",
    "Combine ingredients and marinate meat in a ziploc bag in the refrigerator for 12-24 hours, stirring occasionally. Be sure marinade gets between the slices and covers the meat.",
    "Drain liquid and place in smoker, oven, or food dehydrator at 160-180°F. Turn when dripping stops. They are ready when jerky is dry enough to easily break off a portion, but still has enough resilience to crack when bent, but not break (4-8 hours). It should not be tough and leathery.",
    "It's important to store jerky away from humidity. Let cool completely before packaging. Seal up in Food Saver bags, canning jars or use Press-N-Seal or aluminum foil to keep away air and humidity. If you won't be using right away, store in the refrigerator to preserve freshness longer, but jerky can be kept without refrigeration.",
    "Note: Sodium Nitrate (curing salt) can be used to enhance preservative qualities, but is not required. If used, add 3/4 teaspoon to the above recipe or follow directions on package."
  ],
  "ingredients": [
    "0",
    "4 pounds lean beef, sliced into 1/4\" strips",
    "1/2 tsp hickory or mesquite smoke flavoring",
    "1/4 cup soy or teriyaki sauce",
    "1/4 teaspoon salt",
    "1/4 cup Worcestershire sauce",
    "1 tsp garlic powder",
    "1 tsp onion powder",
    "1 tsp cracked black pepper",
    "pinch of cayenne pepper",
    "2 tablespoons molasses or brown sugar (optional)",
    "1/2 cup barbecue sauce or ketchup"
  ],
  "__v": 0
}