{
  "hash": "390255e32181db54201e7271b677137996b925b6",
  "title": "M&M Cookies {Christmas Style}",
  "image": "http://www.cookingclassy.com/wp-content/uploads/2012/12/mm+cookies31.jpg",
  "href": "http://www.cookingclassy.com/2012/11/mm-cookies-christmas-style/",
  "firstAdded": "2014-12-22T18:29:47.986000",
  "users": [
    null
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "thicker",
    "cookie",
    "use",
    "cornstarch",
    "baking",
    "soda",
    "salt",
    "salted",
    "butter",
    "chilled",
    "cubes",
    "lightbrown",
    "sugar",
    "granulated",
    "egg",
    "yolk",
    "vanilla",
    "mms",
    "used",
    "mini"
  ],
  "directions": [
    "0",
    "Preheat oven to 375 degrees. In a mixing bowl whisk together flour, cornstarch, baking powder, baking soda and salt, set aside.",
    "In the bowl of an electric stand mixer fitted with paddle attachment, blend together butter and sugar on low speed until it starts to come together then increase mixer to medium speed and whip until creamy, about 3 - 4 minutes. Mix in egg and egg yolk. Stir in vanilla. With mixer set on low speed, slowly add in dry ingredients and mix just until combine (batter will be thick due to the chilled butter). Mix in M&M's (I set aside about 1/4 cup of the M&M's to lightly press into the tops of cookies before baking so they show through more, totally optional).",
    "Scoop dough out 2 Tbsp at a time and shape into a ball, transfer to a Silpat lined or buttered cookie sheet - fitting 8 per sheet. Bake in preheated oven 10 - 12 minutes until edges are lightly golden. Allow to cool on baking sheet several minutes before transferring to a wire rack to cool. Store in an airtight container.",
    "Recipe Source: Cooking Classy"
  ],
  "ingredients": [
    "0",
    "2 1/4 - 2 1/2 cups all-purpose flour (for a thicker cookie use 2 1/2)",
    "2 tsp cornstarch",
    "3/4 tsp baking powder",
    "1/2 tsp baking soda",
    "1/2 tsp salt",
    "1 cup salted butter, chilled and diced into cubes (about 1/2-inch)",
    "1 cup packed light-brown sugar",
    "1/2 cup granulated sugar",
    "1 large egg",
    "1 large egg yolk",
    "2 tsp vanilla extract",
    "1 (11 oz) bag M&M's (I used mini)"
  ],
  "__v": 1
}