{
  "hash": "75449fffc0f129a4e13cffb725817a9f65e004bf",
  "title": "Chicken Fried Rice",
  "image": "https://thewoksoflife.com/wp-content/uploads/2015/10/chicken-fried-rice-13.jpg",
  "href": "https://thewoksoflife.com/2015/10/classic-chicken-fried-rice/",
  "extension": "Chrome",
  "firstAdded": "2018-12-06T15:18:11.752000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine the chicken and marinade ingredients and set aside while you prepare the rest of the ingredients.",
    "Next, combine the hot water, sugar, soy sauces and white pepper in a small bowl. This is the sauce that you’ll be adding to the rice, and it’s much easier to have it combined and ready to go before you start cooking. If you have questions about light and dark soy sauce, be sure to check out our Chinese sauces, vinegar, and oils ingredient page.",
    "Take your cooked rice and fluff it with a fork or with your hands (you can rinse your hands in cold water if the rice starts sticking to them). If you are using cold leftover rice, try to break up the clumps as best as possible.",
    "Heat the wok over medium high heat and add 1 tablespoon of oil. Add the eggs and scramble them until just done. You can even start scooping them up when they look like they are almost done and set aside. They will continue to cook in the bowl and you will cook them again in the rice. I'm only harping on this because you don’t want dried egg bits in your chicken fried rice!",
    "Heat the wok until just smoking and spread another tablespoon oil around your wok. Sear the marinated chicken in one layer for 20 seconds. Stir-fry the chicken until about 80% done. Remove the chicken to your marinade bowl and set aside.",
    "With the wok over medium high heat, add another tablespoon of oil and sauté the onions until translucent. Add the rice, and use your metal spatula to flatten out and break up any large clumps. If the rice is cold from the refrigerator, continue stir-frying until the rice is warmed up, which will take about 5 minutes. Sprinkling just a little water on large clumps of rice will help break them up more easily. If the rice was made fresh, cooking time will be faster. Just make sure that the rice isn't too wet––which will make frying it difficult.",
    "Once the rice is warmed (very important or the sauce will not mix as well and the color of the rice will not be as uniform), add the sauce mixture and mix with a scooping motion until the rice is evenly coated with sauce. You will have to break up any remaining clumps of rice with the spatula as best as possible, but no need to be obsessive. The rice should be hot by this time. Now add the chicken and any juices from the bowl you set aside earlier and stir fry for another minute.",
    "Add the eggs, bean sprouts, and scallions, and continue stir-frying the rice for another 30 seconds. Then gather all of the rice into the middle of the wok to let the sides of the wok heat up. After about 20 seconds, spread the Shaoxing wine around the perimeter of the wok and stir-fry for another 20 seconds. This step gives you a little of that extra \"wok hay\" that you taste when you get fried rice from a good Chinese restaurant."
  ],
  "ingredients": [
    "0",
    "For the chicken and marinade:",
    "One large chicken breast, diced into ½-inch cubes",
    "1 teaspoon soy sauce",
    "1 teaspoon cornstarch",
    "1/2 teaspoon sesame oil",
    "1 teaspoon oil",
    "You’ll also need:",
    "1 tablespoon hot water",
    "¼ teaspoon sugar",
    "1 tablespoon regular or light soy sauce or to taste",
    "1 teaspoon dark soy sauce",
    "1 teaspoon salt or to taste",
    "white pepper, to taste",
    "3 tablespoons canola oil, divided",
    "2 eggs, beaten",
    "1 medium onion, diced",
    "5 cups cooked rice",
    "1 cup fresh mung bean sprouts",
    "1 scallion, chopped",
    "1 tablespoon shaoxing wine"
  ],
  "__v": 1
}