{
  "hash": "5a43d4102756c076f30f89a2af047218b42a1221",
  "title": "MEDITERRANEAN CHICKPEA SALAD",
  "image": "",
  "href": "http://www.recipegirl.com/2014/05/19/mediterranean-chickpea-salad/",
  "extension": "Chrome",
  "firstAdded": "2017-01-24T15:33:57.368000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS:",
    "In a large bowl, toss together the salad ingredients. In a separate bowl, whisk together the dressing ingredients. Drizzle the dressing over the salad and toss. Transfer to a serving bowl and drizzle juices on top. Refrigerate until ready to serve.",
    "TIPS:",
    "Use good quality canned chickpeas for this recipe (not generic). I really think it makes a difference in the flavor of the salad.",
    "If you are preparing this recipe as gluten-free, be sure to use a brand of chickpeas that is known to be GF."
  ],
  "ingredients": [
    "0",
    "SALAD:",
    "Two 15-ounce cans chickpeas, drained and rinsed",
    "1/4 cup chopped Italian parsley",
    "2/3 cup chopped bell pepper (mix red/yellow/orange)",
    "3/4 cup halved grape tomatoes",
    "3 green onions, sliced",
    "12 kalamata olives, sliced in half",
    "1/3 cup crumbled feta cheese",
    "DRESSING:",
    "4 tablespoons extra-virgin olive oil",
    "2 tablespoons plain yogurt",
    "1 tablespoon freshly squeezed lemon juice",
    "1 tablespoon red wine vinegar",
    "1 small garlic clove, minced",
    "1/4 teaspoon cumin",
    "salt and pepper, to taste",
    "Report this ad",
    "DIRECTIONS:",
    "In a large bowl, toss together the salad ingredients. In a separate bowl, whisk together the dressing ingredients. Drizzle the dressing over the salad and toss. Transfer to a serving bowl and drizzle juices on top. Refrigerate until ready to serve.",
    "TIPS:",
    "Use good quality canned chickpeas for this recipe (not generic). I really think it makes a difference in the flavor of the salad.",
    "If you are preparing this recipe as gluten-free, be sure to use a brand of chickpeas that is known to be GF.",
    "SOURCE: RecipeGirl.com (adapted from The New York Times)",
    "89.3k1355",
    "posted on MAY 19, 2014 BY LORI LANGE33 comments »",
    "« PREVIOUS POST",
    "Egg- Free Chocolate Chip CookiesNEXT POST »",
    "Raspberry- Mango Dessert Bruschetta",
    "you may",
    "ALSO LIKE",
    "TOASTED COCONUT FROZEN YOGURT",
    "JULY 14, 2015",
    "GREEN SMOOTHIE WAFFLES",
    "MARCH 10, 2016",
    "NO BAKE PATRIOTIC HOT FUDGE CHEESECAKE TRIFLES",
    "MAY 26, 2016",
    "33 RESPONSES TO “MEDITERRANEAN CHICKPEA SALAD”",
    "posted",
    "MAY 19, 2014",
    "3:36 am",
    "NORMA | ALLSPICE AND NUTMEG",
    "This is my kind of salad. Sounds like a fun trip. I went camping once but if I ever go again I’m taking an air mattress and a portable shower. Thankfully it was only for 1 night.",
    "posted",
    "MAY 19, 2014",
    "4:09 am",
    "AVERIE @ AVERIE COOKS",
    "Have fun on your camping trip! Yesterday I was in REI to pick up a random item and was reminded that I should maybe camp one of these decades Great salad & pinned!",
    "posted",
    "MAY 19, 2014",
    "4:19 am",
    "KATIE",
    "Oh this salad sounds divine. I think there is nothing wrong with how you want to camp! I camp with an air mattress. Although it’s been years, camping is so much fun! I can’t wait until my son is older so we can take him camping!",
    "posted",
    "MAY 19, 2014",
    "4:33 am",
    "JANET",
    "Happy camping to you! I do not camp but if I did the mattress on cot sounds like a good thing-LOL.",
    "This recipe sounds delicious and might be on our menu for our BBQ!",
    "Happy Monday!",
    "posted",
    "MAY 19, 2014",
    "5:37 am",
    "DESSERTFORTWO",
    "Can I recommend ‘glamping’ instead of camping? I think you’ll like it more, hehe",
    "This salad is awesome!",
    "posted",
    "MAY 19, 2014",
    "7:13 am",
    "CHELSEA @CHELSEASMESSYAPRON",
    "Love this salad! All the flavors you have and ingredients look fantastic. Definitely the perfect way to end a good hike! Good luck with camping – I hope you enjoy it! We love to go camping, but haven’t been forever!",
    "posted",
    "MAY 19, 2014",
    "7:16 am",
    "BERNADETTE COUTURE",
    "Hi Lori Your Mediterranean Chickpea Salad looks awesome. I can’t wait to make it. I love salads such as this. Thank You for sharing.",
    "posted",
    "MAY 19, 2014",
    "7:17 am",
    "KATRINA @ WARM VANILLA SUGAR",
    "This salad looks sooooo good!! So many yummy ingredients!",
    "posted",
    "MAY 19, 2014",
    "7:31 am",
    "KATHERINES CORNER",
    "Lori this is perfect and yummy too I am sure Hugs!",
    "posted",
    "MAY 19, 2014",
    "9:32 am",
    "SALLY",
    "I’ve been making a salad like this for years – at least 20. It’s a summer favorite. I’ll switch up the tomatoes and onions according to what’s in season and what I have on hand. I often add cucumber, too.",
    "posted",
    "MAY 19, 2014",
    "1:46 pm",
    "MARISA FRANCA @ ALL OUR WAY",
    "Bless your heart but you are one brave soul!! To me a vacation is doing what I want, having bathroom facilities within the confines of where I’m staying, and a shower next to the bathroom facilities. In fact I like being spoiled. I do love to cook so that is not a problem but sleeping and bathing is right up there on the list of importance. Your salad looks delish — I will definitely make it.",
    "posted",
    "MAY 19, 2014",
    "2:37 pm",
    "LA TORONTOISE",
    "This is a really quick meal to prepare and enjoy:-). I love this salad, so typical for the South of France:-)",
    "Have a great weekend and much fun under the sun!",
    "PS. I took a few days of vacation and plan to go to Morocco, to Marrakesh, so a lot of Mediterranean food ahead; a lot of tagine, like this one:",
    "http://www.simplyrecipes.com/recipes/moroccan_chicken_with_lemon_and_olives/",
    "posted",
    "MAY 19, 2014",
    "2:44 pm",
    "KALYNSKITCHEN",
    "Love the salad, definitely something I would gobble this up if I was camping. But I think I might have done enough camping in my life, lol! Probably been at least 100 times through the years.",
    "posted",
    "MAY 19, 2014",
    "3:56 pm",
    "MARCIE",
    "I love chickpeas, and this is a great way to use up the veggies in the crisper, isn’t it? Hope you have a wonderful time camping!",
    "posted",
    "MAY 19, 2014",
    "7:49 pm",
    "SHINEE",
    "You’re wise buying that cot! It’s uncomfortable to sleep on the ground. We had airmat thing one summer and it got deflated during the night. Otherwise, I love camping! That salad looks so fresh and delicious! It’d perfect for summer picnics!",
    "posted",
    "MAY 20, 2014",
    "12:21 am",
    "JAMIE @ LOVE BAKES GOOD CAKES",
    "Have fun camping! The bear thing would kinda freak me out (a lot!) Your salad sounds perfect for the weekend!",
    "posted",
    "MAY 20, 2014",
    "8:57 am",
    "SANDY @ RE",
    "Love this, Lori. Great idea for Memorial Day weekend, too! Yummy summer salad.",
    "posted",
    "MAY 22, 2014",
    "3:02 pm",
    "JOANNE",
    "I only do camping if it involves hot showers and a big comfy blanket. And good food! I love this salad! I would totally bring it with me everywhere.",
    "posted",
    "MAY 25, 2014",
    "9:35 am",
    "JIM",
    "This sounds delicious. I make a very similar dish with black-eyed peas. I can’t believe I have never thought of replacing them with chickpeas.",
    "posted",
    "MAY 27, 2014",
    "2:13 pm",
    "LISA LAROCCO",
    "I like anything Mediterranean! I saw a research study that said the one diet that consistently proves to work is the Mediterranean diet. I love the picture than shows all the different ingredients separated and labeled. Makes it seem so easy to assemble. And the dressing sounds perfect (and healthy).",
    "Thanks for sharing this gorgeous salad.",
    "Lisa",
    "posted",
    "MAY 27, 2014",
    "5:30 pm",
    "SHANNON @ LIVING LIFE CAJUN STYLE",
    "I am with you on no shower and wearing the same cloths. I don’t think there is anything fun in being outside all day and skipping the bath! Now the salad looks great. You had me at kalamata olives and Feta! Then you sealed the deal when you said it could be made ahead.. Nice! I hope the trip went great!",
    "posted",
    "JAN 22, 2015",
    "6:13 pm",
    "ARELIA",
    "This Salad is sooo good. I blended the ingredients and it came out creamier. Tweek with the seasonings abit. Ate with grilled chicken. My boys enjoyed this recipe. Thanks.",
    "LORI LANGE",
    "nice idea to blend the ingredients!",
    "posted",
    "MAY 9, 2015",
    "8:12 am",
    "BRIDGET",
    "How long does this recipe hold? I would imagine a couple of days but wanted to check. Thinking of making it Sunday night for a few days of lunches at work.",
    "LORI LANGE",
    "Leftovers are great for days!",
    "posted",
    "JUN 25, 2015",
    "5:47 am",
    "PEGGY",
    "This looks yummy. I was reading through the recipe and had a question. It said to drizzle dressing on top and then drizzle juices on top. Do you hold out the lemon from the ingredients of the dressing to put on at the end or just save a drizzle of dressing out to drizzle over at the end.",
    "LORI LANGE",
    "no, that just means to drizzle all of the juices from the bowl you tossed it in when you transfer it to the serving bowl",
    "posted",
    "AUG 27, 2015",
    "1:47 am",
    "RUTH",
    "Love this will make it soon.",
    "posted",
    "MAR 31, 2016",
    "9:32 pm",
    "ERNIE TULLIS",
    "Adding this to the menu at my restaurant, it’s delicious!",
    "posted",
    "APR 1, 2016",
    "12:52 pm",
    "AMINA",
    "Sounds amazing! Can’t wait to try this! Can I use regular white vinegar instead of red wine vinegar?",
    "LORI LANGE",
    "you can try!",
    "posted",
    "JUL 11, 2016",
    "12:14 pm",
    "ROSEMARY NUGENT",
    "Do you have to use Cumin Spice in the dressing????",
    "LORI LANGE",
    "It’s actually a pretty big part of the flavor of this salad…",
    "LEAVE A COMMENT",
    "Name (required)",
    "Mail (required - will not be published)",
    "Website URL",
    "Comment",
    "Report this ad",
    "DISHING OUT THE BEST RECIPES FOR ENTERTAINING AND EVERYDAY.",
    "Welcome! I'm Lori Lange, recipe developer, cookbook author & Mom. Here you will find over 2,500 recipes, themed entertaining menus, cookbook and product reviews, travel adventures and more!",
    "STAY CONNECTED",
    "Subscribe to receive new posts directly to your email box:",
    "BUY THE RECIPEGIRL COOKBOOK",
    "AMAZON / BARNES & NOBLE / INDIE BOUND",
    "CATEGORIES",
    "Categories",
    "ARCHIVES",
    "Archives",
    "Report this ad",
    "TOP",
    "DON’T MISS A RECIPE!Subscribe to new posts via email:",
    "HOME COOKBOOK REVIEWS PRODUCT REVIEWS GIVEAWAYS BEYOND FOOD STUFF BLOGGING ADVICE ©2006-2017 RECIPEGIRL ALL RIGHTS RESERVED. DESIGN BY PURR.",
    "Proud Member of:",
    "Mediavine Publisher Network",
    "Food Innovation Group: Bon Appetit and Epicurious",
    "Select Ingredients",
    "(note: you can drag this box around to make it easier to highlight the recipe)",
    "Please highlight the ingredients for this recipe and click \"Next\""
  ],
  "__v": 1
}