{
  "__v": 2,
  "directions": [
    "0",
    "To soften yeast, in a large bowl combine warm water, yeast and sugar. Let stand 5 minutes. Then stir in olive oil, salt, egg and 2 cups of flour. Beat well. To make a soft dough, gradually add 1 to 1 1/4 cups flour. Turn out on a floured surface and knead until smooth. Place in a well-buttered bowl, turning once to butter the top. Cover and let rise until doubled in bulk, 45 to 60 minutes.",
    "Meanwhile, mix together 1/2 cup softened butter and crushed garlic.",
    "Punch dough down. Toss on a lightly floured surface until no longer sticky. Roll dough out to a 9x12-inch rectangle. With a short side facing you, spread bottom 2/3 of rectangle with half of butter mixture. Fold top third of dough down over the center third. Fold bottom third of dough up over this. Press to seal. Wrap dough in plastic and refrigerate 15 minutes. Roll again to a 9x12-inch rectangle. As before, spread with half of butter mixture. Fold as before. Wrap and refrigerate 15 minutes. Roll and fold again, using no butter. Wrap and refrigerate 1 hour. divide dough in half. Seal cut edges by pinching together. Working with one-half of the dough at a time, roll into a 12-inch circle. Using a sharp knife, cut circle into 12 equal wedge-shaped pieces. Near the wide end of each piece place t teaspoon Ricotta Filling. Starting with the wide end, roll each wedge to the point. Place, point side down, on lightly greased or nonstick baking sheets. Cover and let rise until doubled, about 1 hour.",
    "Before baking, brush tops of rolls with a mixture of egg white and water. Bake in preheated 375 degree F. oven for 20 to 25 minutes, or until golden brown. Serve warm. Makes 24 rolls."
  ],
  "firstAdded": "2014-11-16T04:07:41.203000",
  "hash": "e8cc18a229ccc5a74ac75cd1a5e1e1edd0824fb2",
  "href": "http://www.pepperplate.com/recipes/view.aspx?id=4612794",
  "image": "",
  "ingredients": [
    "0",
    "1 cup warm water",
    "1 Tbsp. active dry yeast",
    "1 Tbsp. sugar",
    "1 Tbsp. olive oil",
    "1 tsp. salt",
    "1 egg",
    "2 cups unbleached all-purpose flour",
    "1 to 1 1/4 cups unbleached all-purpose flour",
    "1/2 cup softened butter",
    "1 clove garlic, put through garlic press",
    "1 tsp. Ricotta Filling (see recipe)",
    "1 egg white",
    "1 tsp. water"
  ],
  "keywords": [
    "water",
    "active",
    "dry",
    "yeast",
    "sugar",
    "olive",
    "oil",
    "salt",
    "egg",
    "unbleached",
    "allpurpose",
    "flour",
    "softened",
    "butter",
    "clove",
    "garlic",
    "press",
    "ricotta",
    "filling",
    "recipe",
    "white"
  ],
  "title": "Gilroy Garlic Rolls",
  "users": [
    null
  ]
}