{
  "hash": "1d896911d6395777777a0240161f1dea8233f76c",
  "title": "Homemade Green Chorizo Tacos with Kale & Potatoes",
  "image": "http://cdn-image.foodandwine.com/sites/default/files/styles/recipe_carousel_551_551/public/2014-r-xl-chicken-jumbalaya.jpg?itok=n-d4uOpS",
  "href": "http://www.foodandwine.com/recipes/homemade-green-chorizo-tacos-with-kale-and-potatoes",
  "extension": "Chrome",
  "firstAdded": "2015-12-18T20:29:40.593000",
  "users": [
    null
  ],
  "keywords": [
    "black",
    "peppercorns",
    "coriander",
    "seeds",
    "oregano",
    "bay",
    "leaf",
    "clove",
    "unpeeled",
    "garlic",
    "poblano",
    "chile",
    "lightly",
    "parsley",
    "leaves",
    "sherry",
    "vinegar",
    "kosher",
    "salt",
    "pork",
    "shoulder",
    "fingerling",
    "potatoes",
    "crosswise",
    "rounds",
    "extravirgin",
    "olive",
    "oil",
    "pepper",
    "kale",
    "stems",
    "discarded",
    "corn",
    "tortillas",
    "crumbled",
    "queso",
    "fresco",
    "mexican",
    "crema",
    "sour",
    "cream"
  ],
  "directions": [
    "0",
    "make the green chorizo In a small skillet, toast the peppercorns, coriander seeds, oregano, bay leaf and clove over moderate heat until fragrant, about 2 minutes. Transfer the spices to a spice grinder and let cool completely, then finely grind them.",
    "make the green chorizo In the same skillet, roast the garlic cloves over high heat, turning, until tender and charred in spots, about 10 minutes. Let the garlic cool, then peel and transfer the cloves to a blender.",
    "make the green chorizo Roast the poblano directly over a gas flame or under a preheated broiler, turning, until charred all over. Let cool, then peel, stem and seed the chile. Add the chile, parsley, sherry vinegar and 1 1/2 teaspoons of salt to the blender and puree until smooth.",
    "make the green chorizo In a medium bowl, mix the ground pork with the puree and the spices. Press a piece of plastic wrap directly onto the green chorizo and refrigerate overnight.",
    "make the filling Preheat the oven to 350°. On a rimmed baking sheet, toss the potatoes with 1 tablespoon of the olive oil and season with salt and pepper. Roast for about 30 minutes, tossing once, until golden and tender.",
    "make the filling In a large skillet, heat the remaining 3 tablespoons of olive oil. Add the garlic and the green chorizo and cook over moderately high heat, breaking up the chorizo with a spoon, until it is just starting to brown, about 10 minutes. Add the kale and toss until just wilted, then add cup of water. Cook over moderately low heat, stirring occasionally, until the kale is tender and the chorizo is cooked, about 10 minutes. Fold in the potatoes and season with salt and pepper.",
    "make the filling Spoon the filling onto the tortillas and serve with queso fresco and crema."
  ],
  "ingredients": [
    "0",
    "1/8 teaspoon black peppercorns",
    "1/8 teaspoon coriander seeds",
    "1/8 teaspoon dried oregano",
    "1 bay leaf, crushed",
    "1 clove",
    "2 unpeeled garlic cloves",
    "1 small poblano chile",
    "1 cup lightly packed parsley leaves",
    "2 tablespoons sherry vinegar",
    "Kosher salt",
    "3/4 pound ground pork shoulder",
    "1",
    "1 pound fingerling potatoes, sliced crosswise into 1/2-inch rounds",
    "1/4 cup extra-virgin olive oil",
    "Kosher salt",
    "Freshly ground pepper",
    "2 garlic cloves, minced",
    "3/4 pound kale, stems discarded and leaves chopped",
    "12 warm corn tortillas",
    "Crumbled queso fresco and Mexican crema (or sour cream), for serving"
  ],
  "__v": 1
}