{
  "hash": "c627f7e8e232439407de30bc5078e83b58c9d53b",
  "title": "Macaroni and cheese with bacon and caramelized onions",
  "image": "http://farm8.staticflickr.com/7459/8721760008_afe7f211c6_c.jpg",
  "href": "http://juliasalbum.com/2013/05/macaroni-and-cheese-with-bacon-and-caramelized-onions-recipe/",
  "extension": "Firefox",
  "firstAdded": "2015-05-20T15:17:34.786000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "onions",
    "medium",
    "salt",
    "balsamic",
    "vinegar"
  ],
  "directions": [
    "0",
    "Makes 4 servings.",
    "1) To caramelize onions: heat 1 tablespoon olive oil on high heat in a large skillet, when oil is heated, add sliced onions and cook on high heat for about 10 minutes, constantly stirring with spatula. The onions should start to brown, but without burning (a couple of onions may be burnt here and there, but overall they should not be charred). Reduce heat to medium and continue cooking onions for 10 more minutes, continuing to stir, as onions brown even more without burning. At this point add just a pinch of salt over onions. Continue cooking for 10 more minutes on medium or low heat, stirring occasionally to make sure onions don’t stick to the bottom of the pan or burn. Total you should have cooked onions for 30 minutes. Remove from heat and sprinkle onions with a small amount of balsamic vinegar to deglaze the pan. Using spatula, mix the onions, scraping the bottom of the pan and coating onions with a pinch of balsamic vinegar you just added.",
    "2) While you’re caramelizing the onions, cook bacon: I usually bake it in the oven at 350 until it just turns crispy. Drain the bacon on paper towels and chop into small pieces.",
    "3) Cook elbow macaroni according to package instructions. Rinse the macaroni under cold running water, drain. Set aside.",
    "4) In a large saucepan, add heavy cream, milk, sharp white cheddar cheese, Gruyere cheese and 1/4 teaspoon salt on medium heat, stir and mix, until cheeses start to blend. Add black pepper, Cayenne pepper and paprika to your taste, or omit them if you don’t want them. Add elbow macaroni to the creamy sauce, stir to coat on low heat for about 5-10 minutes until cheeses melt completely and coat the macaroni.",
    "Add caramelized onions and chopped bacon to the creamy macaroni.",
    "Serve on warm plates (warmed in the oven) as is, or with more cheese (finely grated) sprinkled on top."
  ],
  "ingredients": [
    "0",
    "1 tablespoon olive oil",
    "3 onions, medium or large, sliced",
    "pinch of salt",
    "1 tablespoon balsamic vinegar"
  ],
  "__v": 1
}