{
  "hash": "844f9afe97a3d9604f50e764f359d8552eb1464d",
  "title": "Sweet Yeast Roll",
  "image": "https://lh3.googleusercontent.com/MqQAyvxD2uvOC8ZCEcn_7E3PyvYG42RPyoLd-DUMYo05dELiVl-6bRS8tiVpjc9UAL3HHXHwvCdmfYbZaeicqDHsT0Jut5d3oAjI0Q=w120-l68",
  "href": "https://www.justapinch.com/print/bread/sweet-bread/the-best-sweet-yeast-roll-dough-i.html",
  "extension": "Firefox",
  "firstAdded": "2018-10-28T18:05:51.198000",
  "users": [
    null
  ],
  "ratings": [
    {
      "user": "5bd5f9849d3ecd063979209e",
      "rating": 5
    }
  ],
  "keywords": [],
  "directions": [
    "0",
    "Scald milk (bring just to a boil and remove from heat immediately. Stir in sugar, salt, and butter. Set aside and allow to cool to lukewarm. In a large bowl mix warm water and yeast. Stir until dissolved. Stir in lukewarm milk mixture, beaten eggs, and half the flour. Beat until smooth. Add remaining flour gradually, mixing as you go. You may need a bit more or less than the total 4 1/2 cups called for in the recipe, depending on the humidity and other factors. Your dough should be elastic and slightly stiff but not dry.",
    "Turn dough out onto a floured board and knead until smooth and very elastic. This usually takes 8-10 minutes. Butter the inside of a large mixing bowl. Put dough in bowl and turn dough over a couple of times to coat it all with the butter. Cover bowl and place in a warm place so it can rise. It will take about 1 hour to double in bulk. At that time punch dough down and turn out onto a lightly floured board to shape.",
    "At this point you can shape and fill as desired. TO MAKE DINNER ROLLS: Pinch off about 2-3 tablespoons of dough and shape into a ball. Place each one in a buttered muffin tin or baking pan, barely touching each other, do not crowd rolls. Cover prepared rolls and allow to rise in a warm place until doubled in bulk, again about 1 hour. Rolls should now touch each other. (A little more rising will occur during baking.)",
    "Preheat oven to 375 degrees when rolls are about 10 minutes from being ready for baking. When ready to bake place rolls in oven and bake for 20-25 minutes. They should be browned nicely and smell so good and yeasty! Brush tops of rolls with melted butter immediately when removed from oven. Allow rolls to set for at least 10-15 minutes before eating."
  ],
  "ingredients": [
    "0",
    "1/2 c milk",
    "1/2 c sugar",
    "1 1/2 tsp salt (can use less)",
    "1/4 c butter, melted",
    "1/2 c warm water (105-115 degrees)",
    "2 pkg fleischmann's active dry yeast",
    "2 large eggs, beaten",
    "4 1/2 c all purpose flour, may need a bit more or less, see directions",
    "additional butter for coating bowls used and brushing on tops of baked rolls"
  ],
  "__v": 2,
  "rating": 5
}