{
  "hash": "4927d7fe955baa8a009888aabb9f52a07ae7441a",
  "title": "Braised Leg of Ontario Lamb",
  "image": "http://www.foodnetwork.ca/static/Content/food-network/images/recipeDefaultImage_460x230.jpg",
  "href": "http://www.foodnetwork.ca/recipe/braised-leg-of-ontario-lamb/9345/",
  "extension": "Chrome",
  "firstAdded": "2018-01-13T21:45:35.217000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 300 degrees F. Season the lamb with the salt and pepper and rub in well. In a heavy casserole pan large enough to hold the lamb leg, heat the olive oil until hot but not smoking. Brown the lamb all over in the hot oil, remove from the pan and set aside.",
    "Add the vegetables to the pan and sauté over medium heat to colour lightly. Add the tomato paste and continue to cook, stirring often until the paste has taken on a deep mahogany hue. Mix in the flour, and, stirring well, cook for a few more minutes. Pour in half of the wine and stir until thick and smooth. Pour in the remaining wine and the chicken stock and stir until boiling gently.",
    "Place the lamb back into the casserole pan. The lamb should be about one-third covered by the liquid.",
    "Add the herb sprigs and fresh tomatoes, cover with the lid, and place in the center of the oven. Baste the lamb every half hour with some of the braising liquid. Cook until the lamb is very tender, about 2 – 2 1/2 hours.",
    "Remove the lamb, cover lightly and keep warm in a serving dish.",
    "Strain the braising liquid through a fine mesh sieve into a clean sauce pan. Place over high heat and bring to a boil, reduce to a sauce-like consistency, and adjust the seasoning. Slice the lamb and arrange on a platter, pour the sauce over the lamb, and serve."
  ],
  "ingredients": [
    "0",
    "1 leg of fresh Ontario lamb, about 7 lbs",
    "3 Tbsp olive oil",
    "1 large onion, cut into quarters",
    "1 carrot, peeled and coarsely cut",
    "1 stick of celery, coarsely cut",
    "1 whole head of garlic, cut in half",
    "2 Tbsp tomato paste",
    "3 Tbsp flour",
    "1 cup dry red wine",
    "3 cup chicken stock",
    "2 fresh ripe tomatoes, coarsely chopped",
    "A few fresh thyme, parsley and rosemary sprigs",
    "Salt and pepper"
  ],
  "__v": 1
}