{
  "hash": "980ab5e5c9fe5a869f1d6735a189132d8ea086b9",
  "title": "5 INGREDIENT FREEZER BISCUITS",
  "image": "https://www.budgetbytes.com/wp-content/uploads/2016/10/Freezer-Biscuits-brush-butter-1-380x380.jpg",
  "href": "https://www.budgetbytes.com/5-ingredient-freezer-biscuits/",
  "extension": "Chrome",
  "firstAdded": "2019-01-08T01:46:58.789000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large bowl, stir together the flour, salt, sugar, and baking powder until well combined.",
    "Pour in the heavy cream and stir until a sticky ball of dough forms. Sprinkle the dough generously with flour and then turn the dough out onto a floured surface. Gently knead the dough 2-3 times, or just until the dough feels mixed and has enough flour that it is no longer sticky. Avoid over working the dough.",
    "Gently pat the dough down into a 6x8 rectangle, then fold it in half. Repeat this two more times. Folding the dough in this manner helps create layers within the biscuits.",
    "After folding, pat the dough down into a 6x8 rectangle one final time. The dough should be about one inch thick. Cut the dough into 12 squares.",
    "Line a baking sheet with parchment, then place the cut biscuits on the parchment, separated just slightly. Cover with plastic wrap and freeze the biscuits for a couple of hours, or just until solid. Label and date a gallon-sized freezer bag. Place the frozen biscuits in the bag for long term storage (3-4 months).",
    "To bake the biscuits, place any number of biscuits you want on a baking sheet lined with parchment. Let the biscuits thaw only as long as it takes to preheat the oven to 400ºF. Once the oven is preheated, bake the biscuits until puffed up tall and deep golden brown on top. Depending on your oven and size of the biscuits, it should take about 18-22 minutes (frozen), or 16-20 minutes (fresh)."
  ],
  "ingredients": [
    "0",
    "2.5 cups all-purpose flour (plus some for dusting) ($0.26)",
    "1 tsp salt ($0.05)",
    "1 Tbsp sugar ($0.02)",
    "4 tsp baking powder ($0.16)",
    "1 pint heavy whipping cream ($3.65)"
  ],
  "__v": 1
}