{
  "hash": "6f7ad1850b521f734976bf81031333bae751b64a",
  "title": "Fufu from Scratch - Cassava Fufu",
  "image": "http://www.preciouscore.com/wp-content/uploads/2017/07/water-fufu-from-scratch.jpg",
  "href": "http://www.preciouscore.com/water-fufu-cassava-fufu/",
  "extension": "Chrome",
  "firstAdded": "2018-12-18T20:30:18.437000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Peel the cassava. Cut each tuber into 5 or 6 pieces then split each piece in the middle part where you can see the fibre. Use a knife to lift up the skin from the divided cassava then use your knife or hand to take off the whole skin.",
    "Wash the cassava thoroughly and place in a large container. Pour in water to completely cover the cassava then add in two teaspoons of baking soda. Cover the container and keep it to ferment in a warm corner for 3 - 5 days. To check if the cassava is well fermented, press with your fingers, if it is soft then it is okay. Note that all might not be very soft but if most are soft then you are good to go.",
    "Strain the fermented cassava to remove excess water. Then place in a blender or food processor and process into a puree. You may have to do this in two batches.",
    "Now remove any fibre you see in the puree. You can do this by either running your hand through the puree and picking out any fibre, or by adding water to the puree then passing it through a strainer. It is recommended that you use you hand if you intend on cooking the fufu right away.",
    "Pour the puree into a clean kitchen towel or cheese cloth the squeeze to remove excess water. If you added more water to enable you pass the fufu through a strainer, you may need to squeeze longer. Or tightly tie the kitchen cloth containing the puree and place in the kitchen sink with a heavy object on top to help push out the water. When the excess water is out, your fufu is ready to be cooked!",
    "To cook the cassava fufu:",
    "Place the raw fufu in a pot then run through it with your hands to dissolve any excess lumps. Add a quarter cup of water and mix to form a paste.",
    "Place on medium high heat then cover and let it rest for two minutes. Begin stirring with a wooden spoon, mixing hard enough to dissolve the lumps that form as it cooks.",
    "Add water as needed (about 1 cup in total) while stirring to ensure that the fufu is not too strong. Please see video to see how the texture should be. Keep mixing on heat until the fufu moves from being bright white to an off-white colour. It is ready when it is an off-white colour.",
    "Turn off the heat then mold the fufu into lumps (shaped like small logs of wood or like balls) if you wish.",
    "Enjoy with any soup of choice! I love enjoying it with eru or ogbono soup.",
    "Recipe Notes",
    "1. The baking soda in this recipe helps initiate the fermentation process. This is important if you purchase your cassava outside Africa."
  ],
  "ingredients": [
    "0",
    "6 large tubers of cassava (yuca root)",
    "2 teaspoons baking soda optional"
  ],
  "__v": 1
}