{
  "hash": "1324425a9713e298119a964548489bfd5a5816dc",
  "title": "vegetarian matzo ball soup",
  "image": "https://toriavey.com/images/2014/04/MG_54492.jpg",
  "href": "https://toriavey.com/toris-kitchen/vegetarian-matzo-ball-soup/",
  "extension": "Chrome",
  "firstAdded": "2019-04-07T23:08:43.921000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine all soup ingredients in a large pot with 1 tbsp kosher salt (reserve the 2 tbsp chopped fresh dill for later). If you're salt sensitive, you can start with 2 tsp salt, however please note that for the saffron flavor to shine here, you do need salt in the mix. I really recommend 1 tbsp if you're not watching your salt intake.",
    "Cover ingredients with 4 quarts (16 cups) water. Bring to a boil.",
    "Reduce heat to a simmer (around medium heat). Let the stock cook uncovered for 60-90 minutes until the liquid reduces by a third and the stock is flavorful. Note: the olive oil may taste strange in the beginning, but don't fret. As the stock slowly cooks the flavors will meld, and that olive oil will give the broth some much-needed richness and depth.",
    "While the stock is cooking, make the matzo balls. Whisk eggs in a small mixing bowl with vegetable oil and seltzer water. Use a fork to stir in the matzo meal, baking powder, salt, garlic powder, onion powder and chopped fresh dill to make a thick batter. Place the batter in the refrigerator for 30 minutes.",
    "While the batter is chilling, in a second pot combine 3 quarts (12 cups) of water with a pinch of saffron and 1 tbsp salt. Bring to a simmer, stir to dissolve the salt. Keep the salted saffron water hot until the matzo ball mixture is fully chilled.",
    "Place a small dish of cold water beside the pot of saffron water. Take the chilled matzo ball batter out of the refrigerator. Bring the saffron water to a simmer. Wet your hands and roll the matzo ball batter into walnut-sized balls, then gently drop them into the simmering saffron water. Wet your hands between each ball; this makes forming them easier. Don't make them larger than walnuts, they'll expand a lot as they cook!",
    "When all of the matzo balls are in the water, bring back to a low bubbling simmer (not a heavy boil) and cover the pot. Let the matzo balls simmer for 30-35 minutes, keeping the pot covered for at least the first 30 minutes. No peeking! Keeping the pot covered will help the matzo balls become fluffy. Let the matzo balls simmer until they're cooked through. When they are fully cooked, turn off the heat and keep the matzo balls in the hot saffron water until ready to serve. If you won't be serving within an hour, remove the matzo balls from the pot with a slotted spoon and reserve (so they don't get mushy and fall apart).",
    "When the vegetable stock liquid has reduced by a third, strain the stock through a fine mesh strainer or cheese cloth into a large bowl.",
    "Separate out the carrots and celery from the cooked vegetables and herbs.",
    "Rinse the pot and pour the stock back into the pot. Add the carrots and celery back to the stock along with 1 tbsp chopped dill. Adjust seasoning to taste, adding more salt if desired. Keep the stock warm till ready to serve.",
    "Serve 1-2 matzo balls per bowl; ladle the hot soup and vegetables over the warm matzo balls.",
    "A note about the matzo balls: this recipe contains baking powder. Baking powder is mineral based, not grain based, and therefore it does not fall under the banner of “chametz,” the group of foods that are banned for Passover. There are, in fact, several brands of kosher for Passover baking powder (Gefen makes a popular one sold in kosher markets). Some will choose not to use baking powder because they feel it doesn’t jibe with the “spirit” of the Passover holiday. Others have no problem using baking powder, as long as it has a kosher hechsher. Suffice it to say, the choice to use baking powder is a matter of tradition and preference. One thing is for sure, it definitely makes for lighter, fluffier matzo balls. If you're not concerned about fluffiness feel free to omit; your matzo balls will turn out more dense, like \"sinkers.\" Or, you can use whatever matzo ball recipe you prefer with this soup stock!",
    "A note about saffron: Invest in good quality saffron. I say invest, because saffron can be very pricey. If a bottle of saffron threads costs less than $10, it’s probably not worth buying. Imitation saffrons, often sold in a bag under the name \"American Saffron\" or \"Mexican saffron,\" do not impart the flavor of true saffron-- in fact, they have no flavor at all and are used mostly to color foods. I don’t recommend the bag full of saffron that costs $5… it’s not the stuff you want, and it won’t give you the flavor you need."
  ],
  "ingredients": [
    "0",
    "1/2 lb carrots (about 3 medium carrots) sliced into 1/2 inch chunks",
    "1/2 lb celery (about 5 stalks) sliced into 1/2 inch chunks, including leaves",
    "1 onion (rinsed and halved, skin on)",
    "1 leek, sliced and cleaned (white and light green parts only)",
    "1 bunch fresh dill + 2 tbsp chopped fresh dill, divided",
    "1 bunch fresh parsley",
    "2 bay leaves",
    "10 whole peppercorns",
    "6 whole cloves (spice cloves, not garlic)",
    "Pinch saffron threads not American or Mexican saffron, which have no flavor - buy the good stuff! It's expensive but necessary in this soup. Do not sub turmeric! The flavor is completely different.)",
    "2 tbsp good quality extra virgin olive oil",
    "Kosher salt"
  ],
  "__v": 1
}