{
  "__v": 1,
  "directions": [
    "0",
    "Bring chicken stock to boil in heavy medium saucepan. Remove from heat, cover and set aside.",
    "Melt 2 teaspoons butter in large nonstick skillet over low heat. Add onion and sauté until translucent, about 5 minutes. Add barley, thyme, bay leaf and 2 cups warm chicken stock; bring mixture to boil. Reduce heat and simmer until most of stock is absorbed, stirring frequently, about 5 minutes. Add remaining stock 1/2 cup at a time, allowing stock to be absorbed before adding more and stirring frequently until barley is tender, about 50 minutes.",
    "Meanwhile, heat oil in another large nonstick skillet over high heat. Add mushrooms; sauté until beginning to brown, about 3 minutes. Stir in garlic. Reduce heat to medium; cover and cook until mushrooms are tender, stirring occasionally, about 3 minutes. Mix in parsley and barley mixture. Season with salt and pepper. Spoon risotto into bowls and serve immediately."
  ],
  "firstAdded": "2014-10-18T23:43:02.393000",
  "hash": "2829c50b6170193050d9fd3183828a85b4037fa2",
  "href": "http://www.epicurious.com/recipes/food/views/Mushroom-Barley-Risotto-4401",
  "image": "",
  "ingredients": [
    "0",
    "4 1/2 cups chicken stock or canned low-salt chicken broth",
    "1",
    "2 teaspoons butter",
    "1 cup finely chopped onion",
    "1 cup pearl barley",
    "2 teaspoons chopped fresh thyme or 3/4 teaspoon dried",
    "1 bay leaf",
    "2",
    "2 teaspoons olive oil",
    "1 pound assorted fresh mushrooms (such as oyster, stemmed portobello and stemmed shiitake), sliced",
    "1 garlic clove, minced",
    "2 tablespoons chopped fresh Italian parsley"
  ],
  "keywords": [
    "stock",
    "canned",
    "lowsalt",
    "chicken",
    "broth",
    "butter",
    "onion",
    "pearl",
    "barley",
    "thyme",
    "bay",
    "leaf",
    "olive",
    "oil",
    "mushrooms",
    "oyster",
    "portobello",
    "stemmed",
    "shiitake",
    "garlic",
    "clove",
    "italian",
    "parsley"
  ],
  "title": "Mushroom Barley Risotto",
  "users": [
    null
  ]
}