{
  "hash": "226e7c2e6b2d9d770ccccc55cd96c713b50d2d71",
  "title": "Southern fried chicken\nWITH RED CABBAGE PICKLE",
  "image": "https://jamieoliverprod.s3.amazonaws.com/recipe-database/oldImages/recipe_single/1356_1_1440772046.jpg",
  "href": "http://www.jamieoliver.com/recipes/chicken-recipes/southern-fried-chicken/",
  "extension": "Chrome",
  "firstAdded": "2015-12-09T16:22:17.909000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "thighs",
    "skin",
    "bone",
    "drumsticks",
    "buttermilk",
    "potatoes",
    "plain",
    "flour",
    "level",
    "baking",
    "cayenne",
    "pepper",
    "hot",
    "smoked",
    "paprika",
    "onion",
    "garlic",
    "litres",
    "groundnut",
    "oil",
    "brine",
    "black",
    "peppercorns",
    "salt",
    "brown",
    "sugar",
    "sprigs",
    "thyme",
    "bay",
    "leaves",
    "pickle",
    "fennel",
    "seeds",
    "red",
    "wine",
    "vinegar",
    "heaped",
    "golden",
    "caster",
    "cabbage"
  ],
  "directions": [
    "0",
    "Method",
    "This is an incredible fried chicken recipe, one that I’ve subtly evolved from that of my dear friend Art Smith, one of the kings of southern American comfort food. I’ve finished the chicken in the oven, purely because you really do need a big fryer to do it properly, as well as for good temperature control, and this method is much friendlier for home cooking.",
    "To make the brine, toast the peppercorns in a large pan on a high heat for 1 minute, then add the rest of the brine ingredients and 400ml of cold water. Bring to the boil, then leave to cool, topping up with another 400ml of cold water. Meanwhile, slash the chicken thighs a few times as deep as the bone, keeping the skin on for maximum flavour. Once the brine is cool, add all the chicken pieces, cover with clingfilm and leave in the fridge for at least 12 hours – I do this overnight. After brining, remove the chicken to a bowl, discarding the brine, then pour over the buttermilk, cover with clingfilm and place in the fridge for a further 8 hours, so the chicken is super-tender.",
    "When you’re ready to cook, preheat the oven to 190°C/375°F/gas 5. Wash the sweet potatoes well, roll them in a little sea salt, place on a tray and bake for 30 minutes. Meanwhile, make the pickle – toast the fennel seeds in a large pan for 1 minute, then remove from the heat. Pour in the vinegar, add the sugar and a good pinch of sea salt, then finely slice and add the cabbage. Place in the fridge, remembering to stir every now and then while you cook your chicken.",
    "In a large bowl, mix the flour with the baking powder, cayenne, paprika and the onion and garlic powders. Just under half fill a large sturdy pan with oil – the oil should be 8cm deep, but never fill your pan more than half full – and place on a medium to high heat. Use a thermometer to tell when it’s ready (180°C), or add a piece of potato and wait until it turns golden – that’s a sign it’s ready to go. Take the chicken out of the fridge, then, one or two pieces at a time, remove from the buttermilk and dunk into the bowl of flour until well coated. Give them a shake, then place on a large board and repeat with the remaining chicken pieces.",
    "Turn the oven down to 170°C/325°F/gas 3 and move the sweet potatoes to the bottom shelf. Once the oil is hot enough, start with 2 thighs – quickly dunk them back into the flour, then carefully lower into the hot oil using a slotted spoon. Fry for 5 minutes, turning halfway, then remove to a wire rack over a baking tray. Bring the temperature of the oil back up, repeat the process with the remaining 2 thighs, then pop the tray into the oven. Fry the 4 drumsticks in one batch, then add them to the rack of thighs in the oven for 30 minutes, or until all the chicken is cooked through. Serve with your baked sweet potatoes, cabbage pickle and some salad leaves.",
    "Comments"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "4\tchicken thighs\t, skin on, bone in",
    "4\tchicken drumsticks",
    "200\tml\tbuttermilk",
    "4\tsweet potatoes",
    "200\tml\tplain flour",
    "1\tlevel teaspoon\tbaking powder",
    "1\tlevel teaspoon\tcayenne pepper",
    "1\tlevel teaspoon\thot smoked paprika",
    "1\tlevel teaspoon\tonion powder",
    "1\tlevel teaspoon\tgarlic powder",
    "2\tlitres\tgroundnut oil",
    "FOR THE BRINE:",
    "1\ttablespoon\tblack peppercorns",
    "100\tg\tsea salt",
    "100\tg\tbrown sugar",
    "4\tsprigs of\tfresh thyme",
    "4\tfresh bay leaves",
    "4\tcloves of\tgarlic",
    "FOR THE PICKLE:",
    "1\tteaspoon\tfennel seeds",
    "100\tml\tred wine vinegar",
    "1\theaped tablespoon\tgolden caster sugar",
    "½\tred cabbage\t, (500g)"
  ],
  "__v": 1
}