{
  "hash": "fa5892ca74bcbaf84d20d54bee26384d5b6279d7",
  "title": "Roasted Butternut Squash Soup",
  "image": "http://cookieandkate.com/images/2015/11/roasted-butternut-squash-soup-1.jpg",
  "href": "http://cookieandkate.com/2015/roasted-butternut-squash-soup/",
  "extension": "Chrome",
  "firstAdded": "2016-10-27T19:15:46.966000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 425 degrees Fahrenheit and line a rimmed baking sheet with parchment paper. Place the butternut squash on the pan and drizzle each half with just enough olive oil to lightly coat the squash on the inside (about 1 teaspoon each). Rub the oil over the inside of the squash and sprinkle it with salt and pepper.",
    "Turn the squash face down and roast until it is tender and completely cooked through, about 45 to 50 minutes. Set the squash aside until it’s cool enough to handle, about 10 minutes. Then use a large spoon to scoop the butternut squash flesh into a bowl and discard the tough skin.",
    "Meanwhile, in a medium skillet (or large soup pot, if you’ll be serving soup from that pot), warm 1 tablespoon olive oil over medium heat until shimmering. Add the chopped shallot and 1 teaspoon salt. Cook, stirring often, until the shallot has softened and is starting to turn golden on the edges, about 3 to 4 minutes. Add the garlic and cook until fragrant, about 30 seconds, stirring frequently.",
    "If you have a high performance blender like a Vitamix (see notes if you're using an immersion blender instead), transfer the cooked shallot and garlic to your blender. Add the reserved butternut, maple syrup, nutmeg and a few twists of freshly ground black pepper. Pour in 3 cups vegetable broth, being careful not to fill the container past the maximum fill line (you can stir in any remaining broth later). Secure the lid and select the soup preset. The blender will stop running once the soup is super creamy and hot.",
    "If you would like to thin out your soup a bit more, add the remaining cup of broth (I used the full 4 cups, but if you used a small squash, you might want to leave it as is). Add 1 to 2 tablespoons butter or olive oil, to taste, and blend well. Taste and blend in more salt and pepper, if necessary.",
    "Serve immediately (I like to top each bowl with a little more black pepper). Let leftover soup cool completely before transferring it to a proper storage container and refrigerating it for up to 4 days (leftovers taste even better the next day!). Or, freeze this soup for up to 3 months."
  ],
  "ingredients": [
    "0",
    "1 large butternut squash (about 3 pounds), halved vertically and seeded",
    "1 tablespoon olive oil, plus more for drizzling",
    "½ cup chopped shallot (about 1 large shallot bulb)",
    "1 teaspoon salt",
    "4 garlic cloves, pressed or minced",
    "1 teaspoon maple syrup",
    "⅛ teaspoon ground nutmeg",
    "Freshly ground black pepper, to taste",
    "Up to 4 cups (32 ounces) vegetable broth",
    "1 to 2 tablespoons butter, to taste (substitute olive oil for dairy free/vegan soup)"
  ],
  "__v": 1
}