{
  "hash": "d2b4fdf28ed8011fae3d9b6716f05b9283b3959a",
  "title": "Pork Rillettes",
  "image": "",
  "href": "https://cooking.nytimes.com/recipes/1013517-pork-rillettes?mcubz=1&regi=1&join_cooking_newsletter=false&login=google",
  "extension": "Chrome",
  "firstAdded": "2017-09-18T17:32:47.401000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "PREPARATION",
    "Heat the oven to 275º. Put the peppercorns, allspice, cloves and coriander in a spice grinder or clean coffee grinder and process until finely ground. Put the pork in a large, deep skillet or Dutch oven and sprinkle with salt and the spice mixture. Add the garlic, bay leaf, rosemary and stock and put the pot over medium heat. Bring to a simmer, cover and put the pot in the oven. Cook, checking every now and then, until the pork is falling apart and beginning to caramelize and the stock has almost entirely evaporated (remove the cover if necessary to get the liquid to evaporate; the bottom of the pot should be just about all melted fat when you’re done), 2 1/2 to 3 hours.",
    "Strain the mixture; reserve the fat and discard the garlic, bay leaf, rosemary and any gristle. Transfer the pork to a bowl and mash it into small shreds with the back of a fork. Add 1/4 cup of the reserved fat and stir to combine. Taste and season with salt and pepper if you like (keep in mind that the colder you serve the rillettes, the less salty they will taste). Pack the rillettes into a mason jar or another container and refrigerate (covered tightly, they will keep for at least a week). Serve cold or at room temperature."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "20 to 25 black peppercorns",
    "4 allspice berries",
    "2 cloves",
    "8 coriander seeds",
    "2 pounds fatty, boneless pork shoulder or leg, cut into chunks",
    "Salt",
    "1 garlic clove, lightly crushed",
    "1 bay leaf",
    "1 sprig fresh rosemary",
    "2 cups unsalted chicken stock",
    "Crackers, toasted baguette slices or bread for serving"
  ],
  "__v": 1
}