{
  "hash": "7f81efc4ea45d8456f79418b10b9221e0f4dcac2",
  "title": "Sweet Potato Soup",
  "image": "http://recipe-folder.com/img/recipe-images/026/648/1211954026.jpg",
  "href": "https://www.americastestkitchen.com/recipes/8567-sweet-potato-soup?incode=MASAD00L0&ref=new_search_experience_1",
  "extension": "Chrome",
  "firstAdded": "2017-08-28T15:42:54.762000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prep Time: Minutes ━ Difficulty: Easy ━ Servings: Servings",
    "To highlight the earthiness of the sweet potatoes, we incorporate a quarter of the skins into the soup. In addition to the chives, serve the soup with one of our suggested garnishes (recipes follow). The garnish can be prepared during step 1 while the sweet potatoes stand in the water.",
    "Melt butter in large saucepan over medium-low heat. Add shallot and thyme and cook until shallot is softened but not browned, about 5 minutes. Add water, increase heat to high, and bring to simmer. Remove pot from heat, add sweet potatoes and reserved peels, and let stand uncovered for 20 minutes.",
    "Add sugar, vinegar, 1 1/2 teaspoons salt, and 1/4 teaspoon pepper. Bring to simmer over high heat. Reduce heat to medium-low, cover, and cook until potatoes are very soft, about 10 minutes.",
    "Discard thyme sprigs. Working in batches, process soup in blender until smooth, 45 to 60 seconds. Return soup to clean pot. Bring to simmer over medium heat, adjusting consistency if desired. Season with salt and pepper to taste. Serve, topping each portion with sprinkle of chives."
  ],
  "ingredients": [
    "0",
    "4\ttablespoons unsalted butter",
    "1\tshallot, sliced thin",
    "4\tsprigs fresh thyme",
    "4 ¼\tcups water",
    "2\tpounds sweet potatoes, peeled, halved lengthwise, and sliced 1/4 inch thick, 1/4 of peels reserved",
    "1\ttablespoon packed brown sugar",
    "½\tteaspoon cider vinegar",
    "Salt and pepper",
    "Minced fresh chives"
  ],
  "__v": 3
}