{
  "hash": "2bb148c33e518aa60e08d5cc886f76ee5f0eeb96",
  "title": "Dovi (Chicken and Peanut Butter Stew) With Rice",
  "image": "https://cookingtheglobe.files.wordpress.com/2013/01/img_1920.jpg?w=300&h=224",
  "href": "https://cookingtheglobe.wordpress.com/2013/01/31/zimbabwe-dovi-chicken-and-peanut-butter-stew-with-rice/",
  "extension": "",
  "firstAdded": "2016-11-30T19:33:21.743000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "The first step is to chop all of the vegetables. Chop the onion and green pepper to place in one bowl. In a 2nd bowl the garlic, chillies and salt, and in a third bowl, the carrots, tomatoes and thyme. At this time also chop the chicken. Wash and shred the spinach as well, although if you want to be as fresh as possible, this can wait until later once the Dovi is simmering.",
    "Next, wash the rice in cold water and then start the rice cooker or pot of rice so that it times perfectly with your dovi.",
    "Boil 1 cup of water in a kettle (or just use really hot water from the faucet) and dissolve 1 chicken stock cube into it.",
    "Now its time to get cooking….Heat up the oil in a large saucepan. Fry the onion and green pepper for about 5 minutes or until the onion is clear but not brown. Next, add the garlic, chillies and salt and fry for a couple of minutes more.",
    "Add the chicken stock mixture to the pot and then add the chicken, carrots, tomatoes and thyme. If your frypan is not big enough like mine, you can transfer the veggies over to a large pot before/after you add the remaining vegetables, stock and chicken.",
    "Once everything has been added, place a lid on the pot/pan, and simmer on medium heat for about 10 minutes.",
    "After about 8 minutes, it is time to prepare the peanut butter. Measure 8 tablespoons into a bowl. (A trick that my wife told me was to heat up a spoon under hot water which helps the peanut butter come off the spoon better) Scoop about 10 tablespoons of the broth out of the pot into the bowl with the peanut butter and mix until dissolved through.",
    "Now add the shredded spinach and the peanut butter mixture to your pot and stir through. Allow this to cook for about 5 minutes or until the spinach is nice and soft.",
    "By this time your rice should be finished. Plate out a bed of rice and then top with the Dovi and enjoy!."
  ],
  "ingredients": [
    "0",
    "600-800g Chicken (Boneless)",
    "2 Tbsp Olive Oil",
    "2 Green Chillies",
    "2 Peri Peri (African Birdseye Chillies/Red Chillies)",
    "2 Green Bell Peppers",
    "1 Medium Onion",
    "3 Tomatoes",
    "2 Carrots",
    "4 sprigs of thyme",
    "300g spinach",
    "1 cup boiling water (250ml)",
    "1 chicken stock cube",
    "3 Garlic Gloves",
    "1/2 teaspoon salt",
    "8 tablespoons smooth peanut butter"
  ],
  "__v": 3
}