{
  "hash": "254c837de1e919c134a1998c58da1377b22238dc",
  "title": "Hawaiian Shrimp Truck Special (Garlic Lemon Butter Shrimp)",
  "image": "http://www.halfbakedharvest.com/wp-content/uploads/2014/04/Hawaiian-Shrimp-Truck-Special-Garlic-Lemon-Butter-Shrimp.-1.jpg",
  "href": "http://www.halfbakedharvest.com/hawaiian-shrimp-truck-special-garlic-lemon-butter-shrimp/",
  "extension": "Chrome",
  "firstAdded": "2015-07-15T18:23:39.223000",
  "users": [
    null
  ],
  "keywords": [
    "raw",
    "tail",
    "shrimp",
    "olive",
    "oil",
    "lemons",
    "juiced",
    "divided",
    "garlic",
    "parsley",
    "flour",
    "cayenne",
    "pepper",
    "salted",
    "butter",
    "lemon",
    "zest",
    "coconut",
    "steamed",
    "white",
    "rice",
    "pineapple",
    "slice",
    "wedges",
    "lettuce"
  ],
  "directions": [
    "0",
    "Add the shrimp to a gallon size ziplock bag or medium size bowl. Add the olive oil, juice of 1 lemon, chopped garlic, 1 tablespoon fresh parsley, flour, cayenne pepper and pepper. Toss well to combine, seal the bag or cover the bowl and place in the fridge for 30 minutes or up 24 hours.",
    "Heat a large skillet over medium heat. Once hot use a slotted spoon to scoop the shrimp out of the marinade and into the hot skillet, season with salt and pepper. Make sure to scoop up all the garlic as well. Saute the shrimp until pink, about 2-3 minutes per side. Remove the shrimp from the pan leaving the garlic in the skillet. Add the salted butter and 1 teaspoon pepper (or more or less to your taste) to the skillet. Cook the garlic in the butter until it begins to caramelize and turn golden brown. Remove from the heat and stir in 1 tablespoon chopped parsley, the juice of 1/2 a lemon and zest if using. Drizzle with the warm garlic butter over the shrimp and serve alongside rice, fresh pineapple slices and lemon wedges. Garnish with fresh chopped parsley."
  ],
  "ingredients": [
    "0",
    "1 pound raw tail on shrimp",
    "1/4 olive oil",
    "2 lemons, juiced, divided",
    "5-6 cloves garlic, minced",
    "2 tablespoons fresh parsley, chopped plus more for garnish",
    "1 tablespoon flour",
    "1/2 teaspoon cayenne pepper",
    "1/2 teaspoon pepper",
    "6 tablespoons salted butter",
    "1 teaspoon pepper",
    "1/2 teaspoon lemon zest (optional)",
    "coconut or steamed white rice",
    "fresh pineapple slice",
    "fresh lemon wedges",
    "lettuce"
  ],
  "__v": 1
}