{
  "hash": "c44fd2d9baafae7706eba6b5ce820a0fe1f7d048",
  "title": "Hot Curry Chicken Soup with Rice",
  "image": "http://www.willcookforfriends.com/wp-content/uploads/2012/11/8221347233_59c8245b09.jpg",
  "href": "http://www.willcookforfriends.com/2012/11/curry-chicken-soup-with-rice-happy-once-happy-twice.html",
  "extension": "Chrome",
  "firstAdded": "2017-03-28T23:13:19.307000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "*The heat level will vary considerably depending on your curry powder – if you’d like a little more heat, add cayenne to taste at the end of cooking. If there’s too much kick, you can mitigate the heat with 1-2 TBSP sugar, or more honey, to taste. Or, stir in a little coconut milk or cream to make the soup milder.",
    "Method",
    "Heat oil in a large, heavy-bottomed pot or dutch oven over medium-high heat. Stir together the cumin, cinnamon, allspice, and salt, and rub the chicken thoroughly. Seer chicken on one side for 3-4 minutes, then flip and seer the other side. Remove chicken and set aside.",
    "Add the onion to the pot and saute for 2-3 minutes. Add the garlic, ginger, and curry powder. Stir for 1 minute, then add the honey and chicken stock. Return the chicken to the pot and bring to a boil. Cover, reduce heat to low, and let simmer for 30-40 minutes, or until the chicken is cooked through.",
    "Pull the chicken out of the pot and scrape the meat away from the bones with a fork. Shred the meat and return it to the pot. Stir in the cilantro and lime juice, and season to taste with salt, and cayenne pepper if needed.",
    "Serve hot over rice, and garnish with roasted cashews."
  ],
  "ingredients": [
    "0",
    "1 TBSP olive oil",
    "1 1/2 – 2 lbs. bone-in, skinless chicken breast",
    "1 tsp. cumin",
    "1 tsp. cinnamon",
    "1/4 tsp. allspice",
    "1/2 tsp. kosher salt",
    "1 large yellow onion",
    "5-6 cloves garlic, minced",
    "2 TBSP curry powder",
    "1/2 tsp. freshly grated ginger",
    "1/4 cup honey",
    "4 cups low-sodium chicken broth",
    "1/2 cup fresh cilantro, chopped",
    "Juice of 1 – 2 limes, to taste",
    "Salt and cayenne pepper to taste*",
    "Roasted and salted cashews, for serving",
    "White or brown rice, for serving"
  ],
  "__v": 2
}