{
  "hash": "d7d2fb47cf491f8e6e3f23d80e101146f9b00a73",
  "title": "Bataty Faszerowane Aromatycznym Gulaszem",
  "image": "https://www.hellozdrowie.pl/wp-content/uploads/2018/09/przepisy-na-faszerowane-bataty.jpg",
  "href": "https://www.hellozdrowie.pl/blog-faszerowane-bataty/",
  "extension": "Chrome",
  "firstAdded": "2019-06-02T12:53:17.180000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Bataty umyj i ponakłuwaj widelcem w kilku miejscach, robiąc małe dziurki. Piecz je w piekarniku nagrzanym do 200°C, aż będą miękkie. W zależności od wielkości ziemniaka czas wynosi zwykle od 30 do 55 minut.",
    "W międzyczasie przygotuj pomidorowy gulasz: w średnim garnku o grubym dnie podsmaż na oleju posiekaną cebulkę, czosnek i pokrojony w kostkę seler naciowy. Kolejno dodaj pokrojone pieczarki i ulubione warzywa wraz z drobno pokrojoną marchewką.",
    "Czerwoną fasolę odcedź i porządnie przepłucz z zalewy i przełóż do garnka. Całość duś przez kilkanaście minut, aż warzywa będą miękkie.",
    "Następnie dodaj krojone pomidory oraz koncentrat pomidorowy i porządnie wymieszaj. Dodaj masło orzechowe i przyprawy. W razie potrzeby podlej całość odrobiną wody i duś przez kilka minut, aż smaki się połączą. Dopraw na koniec solą i pieprzem.",
    "Upieczone bataty przekrój na pół, jednak nie do końca, uważając, aby nie rozpadły się na dwie części. Do środka każdego batata przełóż kilka łyżek gorącego gulaszu, dodaj pokrojone w kostkę awokado oraz posiekane zioła. Na sam koniec dodaj kilka kleksów owsianej śmietanki."
  ],
  "ingredients": [
    "0",
    "3-4 średniej wielkości bataty",
    "1 puszka czerwonej fasoli lub 1½ szklanki ugotowanej",
    "1 puszka krojonych pomidorów dobrej jakości (w sezonie kilka sztuk świeżych)",
    "2 łyżki koncentratu pomidorowego",
    "1 średnia marchew",
    "1 łodyga selera naciowego",
    "1 mała cebula",
    "kilka pieczarek lub ulubionych warzyw, np. cukinia, bakłażan",
    "1 łyżka oleju",
    "1 łyżeczka startego imbiru",
    "2 łyżki gładkiego masła orzechowego",
    "1 łyżeczka cynamonu",
    "2 łyżki śmietanki owsianej",
    "awokado do podania",
    "świeże zioła: pietruszka, kolendra, rozmaryn"
  ],
  "__v": 2
}