{
  "hash": "10cfbbeb679afdbeaf3577b264df0f33d51ac74d",
  "title": "No-Bake Vegan Strawberry Pie",
  "image": "http://www.makingthymeforhealth.com/wp-content/uploads/2015/05/no-bake-vegan-strawberry-pie-13_thumb.jpg",
  "href": "http://www.makingthymeforhealth.com/2015/05/08/no-bake-vegan-strawberry-pie/",
  "extension": "Chrome",
  "firstAdded": "2015-11-27T14:44:03.359000",
  "users": [
    null
  ],
  "keywords": [
    "strawberry",
    "filling",
    "strawberries",
    "hulled",
    "roughly",
    "apple",
    "juice",
    "beet",
    "optionalfor",
    "red",
    "color",
    "organic",
    "cane",
    "sugar",
    "agar",
    "glutenfree",
    "almond",
    "oat",
    "crust",
    "adapted",
    "glows",
    "raw",
    "almonds",
    "flour",
    "unrefined",
    "coconut",
    "oil",
    "maple",
    "syrup",
    "salt",
    "rolled",
    "oats",
    "whipped",
    "cream"
  ],
  "directions": [
    "0",
    "Preheat the oven to 350°F and then grease a 9-inch pie dish with coconut oil. Place the almonds in a food processor and blend until a fine crumb forms then add the coconut oil, maple syrup, salt and oat flour and pulse until the mixture resembles a dough. Add the rolled oats last and blend until finely chopped. At this point the dough should stick together between your fingers.",
    "Next transfer the mixture to the prepared pie dish. Starting from the middle, use your fingers to firmly and evenly press it down into the dish as you work your way towards the outer edge and up the sides. Try to press it down as firmly as you can as this will help it hold together better.",
    "Prick the bottom of the crust with a fork 4-5 times and then bake in the oven for 10-12 minutes, until it’s a light golden color. Set aside to cool while you prepare the filling.",
    "To make the filling, combine the apple and beet juice in a small sauce pan and place over medium to high heat. Add the sugar and agar agar flakes then bring to a boil. Stir together and cook at a low boil for about 20 minutes, until the flakes and the sugar have completely dissolved. Set aside to cool for about 5-10 minutes.",
    "Arrange the strawberries inside of the crust so that the majority of them are facing down then pour the filling on top. Allow to cool at room temperature for at least 30 minutes then refrigerate for a few hours until it’s set. Serve chilled with coconut whipped cream and store leftovers for up to 2 days in an airtight container."
  ],
  "ingredients": [
    "0",
    "Strawberry Filling",
    "1 pint strawberries, hulled and roughly chopped",
    "1 cup unsweetened apple juice",
    "2 tablespoons beet juice (optional/for red color)",
    "1/4 cup organic cane sugar",
    "2 tablespoons agar agar flakes",
    "Gluten-free Almond Oat Crust",
    "adapted from Oh She Glows",
    "3/4 cup raw almonds",
    "1 cup oat flour",
    "1/4 cup unrefined coconut oil",
    "3 tablespoons pure maple syrup",
    "1/4 teaspoon salt",
    "1/2 cup rolled oats",
    "whipped coconut cream for topping"
  ],
  "__v": 1
}