{
  "hash": "553d2573b313a1dbfda60af2b81393572c148c6c",
  "title": "NUT-STUFFED WINTER SQUASH",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/01/kalemisobowl-1.jpg",
  "href": "http://www.onegreenplanet.org/natural-health/how-a-vegan-macrobiotic-lifestyle-changed-my-life/",
  "firstAdded": "2015-01-22T06:40:01.925000",
  "users": [
    null
  ],
  "keywords": [
    "quinoa",
    "spring",
    "filtered",
    "water",
    "salt",
    "acorn",
    "squash",
    "seeded",
    "pecans",
    "onion",
    "light",
    "sesame",
    "oil",
    "flatleaf",
    "parsley",
    "cinnamon",
    "nutmeg",
    "wheat",
    "bread",
    "crumbs"
  ],
  "directions": [
    "0",
    "Rinse quinoa several times to help remove an oil called saponin, that if not rinsed off, can make the grain taste bitter. Bring quinoa, 1 cup water and a pinch of salt to a boil in a saucepan over medium heat. Reduce heat and cook, covered, over low heat until quinoa is tender and fluffy and water is completely absorbed, about 25 minutes.",
    "Preheat oven to 350F (175C). Lightly oil a baking dish large enough to hold squash. Cut the bottoms off the acorn squash just enough so that each half sits squarely, cut side up. Arrange the squash halves in prepared baking dish.",
    "Combine cooked quinoa, pecans, onion, a light drizzle of oil, parsley, spices, a little salt and enough bread crumbs to make a stuffing that holds together. Divide stuffing among squash halves, filling them abundantly. (You may have more quinoa filling than you need; serve it as a side dish.)",
    "Add a little water to the baking dish. Cover tightly with foil and bake 1 hour, until the squash pierces easily with a fork. Remove cover and bake about 5 minutes to firm the filling. Serve warm."
  ],
  "ingredients": [
    "0",
    "½ cup quinoa",
    "Spring or filtered water",
    "Sea salt",
    "1 acorn squash, halved and seeded",
    "½ cup minced pecans",
    "1 onion, finely diced",
    "About 2 teaspoons light sesame oil",
    "¼ cup minced fresh flat-leaf parsley",
    "Pinch each cinnamon and nutmeg",
    "About ¼ cup fresh whole wheat bread crumbs"
  ],
  "__v": 1
}