{
  "hash": "441a02c9c5da39df5a1e2051a9232e3b1092d5b5",
  "title": "Frozen Piña Colada Cocktail",
  "image": "https://www.thespruceeats.com/thmb/i8gFvu8Zc7nbL5fWjuc1JlSVj1Y=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/frozen-pina-colada-recipe-759297-4_preview1-5b02fa8ca18d9e003cddc746.jpeg",
  "href": "https://www.thespruceeats.com/frozen-pina-colada-recipe-759297",
  "extension": "Chrome",
  "firstAdded": "2018-07-08T22:36:32.193000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "How to Make It",
    "Blend all the ingredients with ice until nice and smooth.",
    "Pour into a chilled hurricane glass.",
    "Garnish with a cherry and pineapple wedge. Pin the cherry to the pineapple with a cocktail skewer to create a garnish known as a \"flag.\"",
    "If you would like the drink to be thicker, add more ice. For a thinner drink use less ice or add more juice.",
    "Choose Your Rum",
    "The blended piña colada is thick, luscious, and filled with flavor.",
    "Because of that, your choice of rum is not as critical here as it may be in other cocktails. Yet, as with any cocktail, the liquor you begin with is going to make a difference in the finished drink.",
    "For the best piña colada, choose a decent white rum. Consider stepping away from the best-known brands and pick up one that's a little more obscure. There are many great options beyond Bacardi and the like. Give ones like Shellback or Flor de Caña a try and see what you think.",
    "The great thing about exploring rum is that there are many reasonably priced options available. In most cases, you don't have to spend a fortune on rum to discover a new favorite.",
    "If you want to add a hint of flavor, opt for a flavored rum. You can either make your own fruit infusions or buy one that's ready to go. Brands like Brinley and Cruzan make some fun flavors that can add a nice background to this cocktail.",
    "Better Than a Piña Colada Mix?",
    "It's incredibly easy to pick up one of the many bottled piña colada mixes available. Why would you want to hassle with this recipe when it's all right there in a single bottle? First of all, we hardly think that four ingredients are asking too much. Secondly, we have to go back to the old adage that fresh is best.",
    "Many of the piña colada mixes you find at the liquor store leave a lot to be desired when it comes to flavor. They are often filled with artificial ingredients and preservatives to ensure they can sit on the shelf for months at a time (if not longer). Why subject yourself to that when it's just as easy to pick up a few inexpensive ingredients so you know what you're drinking?",
    "By creating the drink from scratch you can choose your proportions and have more control over the taste. Maybe you want to throw some fresh chunks of pineapple into the blender or use a coconut rum and a little less cream.",
    "With a recipe like this, you can make those choices and produce a better tasting, less expensive drink tailored to your personal taste. Besides, with a piña colada mix you're stuck with that one drink. If you buy cream of coconut and pineapple juice separately, a whole new list of cocktails is at your disposal."
  ],
  "ingredients": [
    "0",
    "2 ounces​ white rum",
    "3 ounces ​​pineapple juice",
    "1 1/2 ounces ​​cream of coconut",
    "1/4 ounce ​​fresh lime juice",
    "1 cup ice",
    "Garnish: maraschino cherry",
    "Garnish: pineapple wedge"
  ],
  "__v": 1
}