{
  "hash": "0a12cc99d9316988d6cbcae581878e05fb1320da",
  "title": "Spring Mushroom and Asparagus Risotto with Scallops",
  "image": "https://www.naturalgrocers.com/sites/default/files/styles/recipe_slider_full/public/media_images/Spring%20Mushroom%20Rosotto%20with%20Scallops_Recipe%20Feature_1024x587.jpg?itok=uFpebnEt",
  "href": "https://www.naturalgrocers.com/recipe/natural-grocers-spring-mushroom-and-asparagus-risotto-scallops",
  "extension": "Chrome",
  "firstAdded": "2020-05-17T15:15:50.289000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Pat the scallops dry with paper towels and lightly season with salt and pepper. Set aside while you prepare the risotto.",
    "Warm the broth in a saucepan over medium heat while you prep the onion, garlic, mushrooms, and parsley. If the broth starts to boil, reduce the heat to simmer.",
    "Heat a large, deep skillet or a wide saucepan over medium heat. Once hot, add the olive oil, swirl to coat, then add the onion. Sauté, stirring occasionally, until translucent and beginning to soften, 3-4 minutes. Add the mushrooms and cook until they begin to release their liquid. Add the garlic and cook for one minute, stirring frequently.",
    "Add the rice and cook, stirring occasionally, until the rice begins to look opaque around the edges, 2-3 minutes. Add the wine and cook, stirring occasionally, until the liquid has evaporated.",
    "Add hot broth to just cover the rice, about ¾-1 cup. Cook, stirring frequently and vigorously, until the broth is mostly absorbed, 3-6 minutes, before adding another ¾-1 cup of broth, and cook, stirring frequently and vigorously, until it is absorbed. Once you have added about half of the broth, add the entire bag of cauliflower rice and the salt, stir well, and continue cooking as before. Add the asparagus with the last addition of broth. Cook, stirring frequently until the last of the broth is mostly absorbed and the asparagus is just tender but still bright (it will continue to cook after you remove the risotto from the heat). Taste the risotto for doneness, it should be a little al dente and the consistency of hot lava. If it is not cooked enough, add another ½ cup of water and cook as before until it is done to your liking. Remove the pan from the heat.",
    "Heat a large skillet over medium-high heat. Once hot add the ghee and swirl the pan to melt. Add scallops to the pan in a single layer, being careful not to crowd them. You may need to cook them in two batches, adding additional ghee between batches, to avoid overcrowding. Cook for 2-3 minutes before stirring and cooking for another 1-2 minutes, or until scallops are lightly browned and just cooked through. Do not overcook them. Transfer the cooked scallops to a plate.",
    "Once the scallops are cooked, add the butter, Parmesan, and lemon juice to the risotto. Stir gently until the butter and cheese are melted and fully incorporated. You can add a little more water at this point too if your risotto has thickened too much.",
    "To serve, ladle risotto into bowls, top with scallops, and garnish with parsley and additional Parmesan."
  ],
  "ingredients": [
    "0",
    "1 (16-ounce) package wild caught bay scallops, thawed and drained",
    "1 (32-ounce) container of organic broth, (chicken or vegetable)",
    "2 tablespoons Natural Grocers Organic Extra Virgin Olive Oil",
    "1 medium organic onion, diced",
    "1 (8-ounce) package of your favorite organic mushrooms, wiped clean, stems trimmed, and sliced into ¼-inch slices",
    "4 organic garlic cloves, minced",
    "1 cup Natural Grocers Brand Organic White Arborio Rice",
    "1 cup organic dry white wine, (or sub 1 tablespoon Natural Grocers Organic Apple Cider Vinegar plus 1 cup of water)",
    "1 (10-ounce) bag Natural Grocers Brand Organic Frozen Riced Cauliflower",
    "1 teaspoon Natural Grocers Brand Bulk Real Salt",
    "1 bunch organic asparagus, tough ends trimmed and cut into 1-inch pieces (or sub 1 (10-ounce) package of frozen organic asparagus)",
    "1 tablespoon organic ghee",
    "1 tablespoon organic butter, (or sub with an additional tablespoon ghee)",
    "1⁄2 cup Natural Grocers Organic Parmesan Cheese Shreds, plus more for garnish (optional)",
    "Juice from one organic lemon",
    "1⁄2 cup organic parsley leaves, chopped"
  ],
  "__v": 1
}