{
  "hash": "89723d3691b0179939e023836fb0c0667e888a16",
  "title": "Skinny Greek Turkey Meatballs",
  "image": "http://thebusybaker.ca/wp-content/uploads/2015/12/IMG_4448ew.jpg",
  "href": "http://thebusybaker.ca/skinny-greek-turkey-meatballs/",
  "extension": "Chrome",
  "firstAdded": "2017-07-12T02:17:18.108000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Add the ground turkey, shredded zucchini, breadcrumbs, egg, red onion, spices, garlic and salt and pepper to a large bowl.",
    "Using your hands, combine all the ingredients together until everything is mixed together evenly. This will take several minutes, but you'll never achieve the same result using a spoon or spatula so be sure to use your hands for this job!",
    "Roll the mixture into about 18 meatballs (you'll need just under 1/4 cup of the mixture for each meatball), rolling each one between your hands until it forms a tight sphere shape.",
    "Place the meatballs on a plate as you roll them, and once you're finished rolling all 18 set them aside while you clean your hands.",
    "Heat a large skillet over medium-low heat and add 1 tbsp of oil once it's heated. Place 9 of the meatballs in the pan and let them fry on one side for about 6 minutes or until the underside is a nice golden brown colour. Flip the meatballs over and let them fry on the other side for about 8-10 minutes, making sure you cover the pan right after you've flipped them. When they've reached an internal temperature of 165 degrees Fahrenheit you'll know they're done.",
    "It's best to fry the meatballs in at least 2 batches. You don't want to overcrowd your skillet as this can prevent the browning and caramelization process that gives the outside of the meatballs that beautiful golden colour. Once you've finished frying up both batches (all 18 meatballs), serve them alongside some homemade fat-free Tzatziki Sauce for dipping (recipe linked above!!)"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 1/2 lbs lean ground turkey meat",
    "1 cup shredded zucchini skin on",
    "2/3 cup whole grain breadcrumbs or 2/3 cup gluten-free oat flour",
    "1 egg",
    "1/4 cup finely grated red onion",
    "2 tsp dried Greek oregano",
    "1 1/2 tsp dried parsley",
    "3 cloves garlic grated (I use my microplane zester for this job!)",
    "a pinch or two each of sea salt and black pepper",
    "1-2 tbsp oil for frying or oil spray if you're using a non-stick skillet"
  ],
  "__v": 1
}