{
  "hash": "0a69087670eb72c0595fddaebdd2d37afc8e861d",
  "title": "Chicken & mushroom puff pie",
  "image": "http://www.bbcgoodfood.com/sites/bbcgoodfood.com/files/styles/bbcgf_recipe/public/recipe_images/recipe-image-legacy-id--563494_12.jpg?itok=-M2B-6QV",
  "href": "http://www.bbcgoodfood.com/recipes/1765/chicken-and-mushroom-puff-pie",
  "extension": "Chrome",
  "firstAdded": "2015-10-13T15:06:58.664000",
  "users": [
    null
  ],
  "keywords": [
    "oil",
    "skinless",
    "boneless",
    "chicken",
    "thighs",
    "rashers",
    "smoked",
    "streaky",
    "bacon",
    "pieces",
    "onion",
    "pack",
    "baby",
    "button",
    "mushrooms",
    "thyme",
    "sprigs",
    "plain",
    "flour",
    "stock",
    "milk",
    "puff",
    "pastry",
    "frozen",
    "defrosted",
    "egg"
  ],
  "directions": [
    "0",
    "Heat the oil in a large, non-stick frying pan. Season the chicken to taste and fry for 5-8 mins until golden brown, turning occasionally. You may need to do this in two batches, depending on the size of your pan. Lift the chicken onto a plate and tip the bacon into the pan. Fry for 5 mins until crisp. Add the onion, mushrooms and thyme, then fry on a high heat for another 3 mins until the onions start to colour.",
    "Tip the flour into the pan and cook, stirring, for 1 min. With the pan off the heat, gradually stir or whisk in the stock, followed by the milk, then add the chicken back to the pan. Bring to the boil, then simmer for 30 mins. Spoon the filling into a large pie or baking dish (approx 20 x 30cm) with a lip and leave to cool.",
    "Heat oven to 220C/fan 200C/gas 7. On a floured surface, roll the pastry to the thickness of two £1 coins. Cut a long strip as wide as the rim of the pie dish and, using a little of the egg, fix to the edge of the pie dish. Brush with egg, then lift the rest of the pastry over the pie, using the rolling pin to help. Gently press the edges with your fingers and trim with a sharp knife. Brush lightly with egg to glaze, then bake for 30 mins or until the pastry is risen and dark golden brown."
  ],
  "ingredients": [
    "0",
    "1 tbsp vegetable oil",
    "8 skinless boneless chicken thighs",
    "8 rashers smoked streaky bacon, cut into large pieces",
    "1 onion, halved and sliced",
    "250g pack baby button mushrooms",
    "handful thyme sprigs",
    "2 tbsp plain flour",
    "400ml chicken stock",
    "200ml milk",
    "500g pack fresh puff pastry, or frozen and defrosted",
    "1 egg, beaten"
  ],
  "__v": 1
}