{
  "hash": "fd93ae3c2c6a1b9e32b8ab738ca1800db01d0048",
  "title": "Crispy sweet potatoes with chickpeas & tahini yogurt",
  "image": "//www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe/recipe-image/2016/06/crispy-sweet-potatoes-stuffed-with-chickpeas-tahini-yogurt.jpg?itok=yY3u6C4g",
  "href": "https://www.bbcgoodfood.com/recipes/crispy-sweet-potatoes-chickpeas-tahini-yogurt",
  "extension": "Firefox",
  "firstAdded": "2017-05-01T12:02:15.272000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Wrap each potato in foil and put directly on the hot coals of a barbecue for 35-45 mins, depending on the size of the potatoes. Insert a skewer into each one to check that they’re cooked. (Alternatively, heat oven to 200C/180C fan/gas 6 and put the foil-wrapped potatoes on a large baking sheet. Bake in the oven for 45 mins-1 hr or until the centre is soft. Once cooked, put under a hot grill for 3 mins until the skin is blackened and crispy.)",
    "Meanwhile, heat 1 tbsp olive oil in a large frying pan over a medium heat. Add the garlic and shallot and fry for 2-3 mins or until softened, then stir the chickpeas into the mixture. Gently warm through for 1 min or so, then add the spinach and leave to wilt. Add the dill.",
    "Whisk together the lemon juice, zest and remaining olive oil in a small bowl. Season to taste and stir into the chickpea mixture. Gently mash with a potato masher until the chickpeas are slightly crushed. Mix together the yogurt and tahini in another small bowl, and season to taste with salt.",
    "Split the potatoes open lengthways. Fill with the bean mixture, drizzle over the tahini yogurt and top with the pine nuts and pomegranate seeds."
  ],
  "ingredients": [
    "0",
    "sweet potatoes Sweet potato sweet po-tate-toeSweet potatoes have a creamy texture and a sweet-spicy flavour that makes them ideal for savoury…",
    "olive oil Olive oil ol-iv oylProbably the most widely-used oil in cooking, olive oil is pressed from fresh olives. It's…",
    "lemon Lemon le-monOval in shape, with a pronouced bulge on one end, lemons are one of the most versatile fruits…"
  ],
  "__v": 1
}