{
  "hash": "b829cfd249f639dc20b0b277f68c3f548a4a7251",
  "title": "Roasted Veggie and Black Bean Tacos",
  "image": "",
  "href": "http://www.cookingclassy.com/roasted-veggie-black-bean-tacos/",
  "extension": "Chrome",
  "firstAdded": "2016-12-28T18:40:23.313000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400 degrees. Place first 6 ingredients in a mound on a large baking sheet. In a small bowl, stir together olive oil, canola oil, cumin, 1/2 tsp chili powder and salt and pepper (I used 3/4 tsp salt and 1/4 tsp pepper, but you can adjust to your taste). Drizzle oil mixture over veggies on baking dish, then toss to evenly coat and spread veggies into an even layer. Bake in preheated oven 10 minutes, then remove from oven and toss (then spread into an even layer again) and return to oven to roast 10 minutes longer (or until they've reached desired doneness).",
    "Near the end of veggies roasting, toss warmed black beans with salt and remaining 1/2 tsp chili powder. Once veggies are done roasting, add black beans along with chopped cilantro and drizzle lime juice over top and toss. Serve warm over tortillas (I preferred corn vs. flour, I tried both. I recommend heating about 1/2 - 3/4 tsp veggie oil slightly over medium heat in a non-stick skillet, add corn tortilla and swirl. Cook until golden brown in spots, then lift, add another 1/2 tsp and repeat). Top with Queso Fresco, sour cream and hot sauce if desired.",
    "*Dice all the veggies about the same size so they all cook evenly, except for the tomatoes (and corn obviously). I diced the tomatoes bigger because they shrink the most since they have a higher water content than the others.",
    "Recipe Source: Cooking Classy"
  ],
  "ingredients": [
    "0",
    "3 medium tomatoes, cored and seeded, diced* (1 1/2 cups)",
    "2 ears corn, kernals cut from cob (1 1/2 cups)",
    "1 medium zucchini, diced (1 1/2 heaping cups)",
    "1 medium yellow squash, diced (1 1/2 heaping cups)",
    "3/4 small yellow onion, chopped (scant 1 cup)",
    "1 red bell pepper, diced (1 cup)",
    "1 1/2 Tbsp olive oil",
    "1 1/2 Tbsp canola oil",
    "1 tsp cumin",
    "1 tsp chili powder, divided",
    "Salt and freshly ground black pepper",
    "1 cup canned black beans, drained, rinsed and warmed",
    "1/3 cup cilantro, chopped",
    "1 1/2 Tbsp fresh lime juice",
    "Corn or flour tortillas for serving",
    "Queso fresco, for serving",
    "Sour cream and Mexican hot sauce for serving (optional)"
  ],
  "__v": 1
}