{
  "hash": "1390ca19b2be08086669319e06daea4d283f6d5d",
  "title": "Cinnamon Brown Sugar Pull Apart Bread with Raisins",
  "image": "http://www.jocooks.com/wp-content/uploads/2013/08/cinnamon-brown-sugar-pull-apart-bread-with-raisins-1-6.jpg",
  "href": "http://www.jocooks.com/bakery/sweet-breads/cinnamon-brown-sugar-pull-apart-bread-with-raisins/",
  "firstAdded": "2014-12-26T10:19:11.195000",
  "users": [
    null
  ],
  "keywords": [
    "purpose",
    "flour",
    "granulated",
    "sugar",
    "active",
    "dry",
    "yeast",
    "salt",
    "unsalted",
    "butter",
    "milk",
    "water",
    "eggs",
    "room",
    "vanilla",
    "brown",
    "cinnamon",
    "nutmeg",
    "browned"
  ],
  "directions": [
    "0",
    "In a small bowl mix the yeast with the warm water. Let it sit until it bubbles. In the meantime, melt the butter in the microwave for about 45 seconds then add the milk to it and stir. Add eggs and vanilla and whisk.",
    "In the bowl of your mixer add all the dry ingredients, flour, sugar and salt. Pour the wet ingredients, including the yeast mixture and mix for about 3 to 5 minutes, the dough will be a bit sticky. Place in an oiled bowl. Heat the oven at 200 F degrees for a couple minutes just until it warms up a bit, then place the bowl in the oven and let it double in size for about an hour.",
    "Roll the dough out into a rectangle that’s about 12 inches by 20 inches. Brush the dough with butter, then sprinkle with the brown sugar cinnamon mix and just because, I added raisins. Cut the dough into 6 long strips vertically. Stack 3 strips on top of each other, so you end up with 2 stack of 3 strips each. Cut each stack into 4 little stacks. I ended up with 8 total little stacks. Layer the dough squares in the loaf pan like a flip-book. Cover the loaf pan with a damp kitchen towel and let rest for another 30 minutes until almost doubled in size.",
    "Preheat oven to 350 F degrees and bake the bread for about 35 to 40 minutes or until golden brown. Let the bread cool for about 20 minutes then carefully remove it from the pan."
  ],
  "ingredients": [
    "0",
    "3 cups all purpose flour",
    "¼ cup granulated sugar",
    "1 tbsp active dry yeast",
    "½ tsp salt",
    "2 oz unsalted butter",
    "⅓ cup whole milk",
    "¼ cup warm water",
    "2 large eggs, at room temperature",
    "1 tsp pure vanilla extract",
    "1",
    "1 cup brown sugar",
    "2 tsp ground cinnamon",
    "½ tsp fresh ground nutmeg",
    "2 oz unsalted butter, melted until browned"
  ],
  "__v": 1
}