{
  "hash": "176c234d7c18e9e7988bae15b611479d45989814",
  "title": "Sweet Potato Burgers With Green Tahini [Vegan, Gluten-Free]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/04/burger3.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/sweet-potato-burgers-with-green-tahini/",
  "extension": "",
  "firstAdded": "2015-05-08T06:01:30.490000",
  "users": [
    null
  ],
  "keywords": [
    "red",
    "bell",
    "pepper",
    "onion",
    "chickpeas",
    "cilantro",
    "parsley",
    "garlic",
    "almonds",
    "cumin",
    "coriander",
    "smoked",
    "paprika",
    "salt",
    "black",
    "potatoes",
    "steamed",
    "baked",
    "mashed",
    "quickcooking",
    "oats",
    "tahini",
    "water",
    "juice",
    "lemon",
    "mint",
    "favorite",
    "herbs",
    "olive",
    "oil"
  ],
  "directions": [
    "0",
    "In a food processor pulse and chop the red bell pepper and red onion. Pour the chopped veggies into a large mixing bowl. Place the chickpeas and cilantro/parsley into the food processor and blend until the chickpeas are a thick mealy texture. Pour into the mixing bowl with peppers and onions. Place the garlic, almonds, and spices into the food processor and blend until the almonds are a crumbly texture. Pour into the mixing bowl.",
    "Mash the sweet potato with a fork, or place it in the food processor and blend until smooth. Pour it over the contents of the mixing bowl followed by the oats, and stir well to combine the ingredients. Season to taste with more sea salt and spice.",
    "Place the burger batter in the refrigerator to firm up for an hour or longer.",
    "Preheat oven to 375°, and line one or two baking sheets with parchment paper. Scoop about ¾ cup of the batter into your hands and form into a tight patty. Place the patty onto the baking sheet, and repeat with the remaining batter. Make sure that the patties are not too close to each other on the baking sheet (2 inches separating is good). Bake for 40 minutes, or until cooked through. After removing them from the oven, allow the patties to cool for at least 15 minutes before trying to remove them with a spatula or your hands.",
    "Serve with green tahini on bread, lettuce, or solo. Bon appetit!",
    "1",
    "Place the tahini, water, lemon, herbs, and sea salt into a blender. Blend until smooth, slowly add in the olive oil."
  ],
  "ingredients": [
    "0",
    "1 red bell pepper",
    "½ red onion",
    "2 cans chickpeas",
    "1 cup packed cilantro or parsley (or half and half)",
    "3 cloves garlic",
    "1 cup almonds",
    "2 tbsp cumin",
    "3 tsp coriander",
    "2 tsp smoked paprika",
    "2½ tsp sea salt",
    "1 tsp black pepper",
    "1 large or 2 small sweet potatoes (1½ cup), steamed or baked, peeled and mashed",
    "¾ cup quick-cooking oats",
    "1",
    "1/2 cup tahini",
    "½ cup water",
    "juice of 1 lemon",
    "1 cup packed fresh mint, cilantro, and parsley (or your favorite fresh herbs)",
    "1 tsp sea salt",
    "2 tbsp olive oil"
  ],
  "__v": 1
}