{
  "hash": "6bc2bd2d6bac8ad92c7f6f6c22619750bac2abac",
  "title": "Protein Power Goddess Bowl",
  "image": "",
  "href": "http://ohsheglows.com/2010/12/11/protein-power-goddess-bowl/",
  "firstAdded": "2015-02-27T15:05:05.789000",
  "users": [
    null
  ],
  "keywords": [
    "uncooked",
    "brown",
    "rice",
    "want",
    "make",
    "need",
    "lentils",
    "red",
    "onion",
    "garlic",
    "redyelloworange",
    "pepper",
    "tomato",
    "tahini",
    "lemon",
    "dressing",
    "sundried",
    "tomatoes",
    "mixed",
    "greens",
    "spinach",
    "parsley",
    "wedges",
    "olives",
    "think",
    "used",
    "kosher",
    "salt",
    "saut",
    "olive",
    "oil",
    "sauting"
  ],
  "directions": [
    "0",
    "Directions: Cook lentils and rice according to package directions, rinse with cold water, strain, and set aside. In a large skillet, add in the oil and heat to low-medium temperature. Now add in the onion, garlic, red pepper, salt, pepper, and optional sundried tomatoes. Sauté for about 5 minutes over low-medium heat. Now add in the cooked, drained, and rinsed 4 cups of lentils and stir well. Cook for another few minutes. Add in 1 cup of tahini lemon garlic dressing and stir well. Cook until it starts to bubble and then remove from heat. Add in 2 large handfuls of greens and parsley and stir well again. Portion cooked brown rice into the bowl(s) and then scoop the sauté lentil mixture overtop of the rice. Garnish with olives and a lemon wedge if preferred. Makes about 6 large portions."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "2 cups uncooked brown rice (or however much you want to make)",
    "1.5-2 cups uncooked lentils (you need 4 cups cooked lentils)",
    "1/2 red onion",
    "4 garlic cloves, peeled and diced",
    "1 red/yellow/orange pepper, thinly sliced",
    "1 tomato, chopped",
    "1 cup Tahini lemon garlic dressing",
    "8-10 sundried tomatoes, sliced (optional)",
    "2 large handfuls of mixed greens (or spinach)",
    "1/2 cup parsley, chopped",
    "Lemon wedges and olives, for garnish (optional)",
    "Kosher salt and pepper, to taste (I think I used about 1/4-1/2 tsp kosher salt in the sauté)",
    "1/2 tbsp olive oil for sautéing"
  ],
  "__v": 1
}