{
  "hash": "2fb6d10fce904a21da6d9ac77a42612abb8992de",
  "title": "HOW TO MAKE SICILIAN AUBERGINE AND BEAN STEW",
  "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/03/20/10/aubergine-stew.jpg?w968h681",
  "href": "https://www.independent.co.uk/life-style/food-and-drink/recipes/aubergine-bean-stew-recipe-how-to-make-sicilian-casserole-slow-cooking-times-ingredients-a7552886.html",
  "extension": "Chrome",
  "firstAdded": "2019-03-24T05:38:16.873000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Peel and thinly slice the onion and trim and thinly slice the celery. Place a large non-stick frying pan over a medium-high heat and spray with oil. Add the onions and celery and cook for 5 minutes, stirring occasionally.",
    "Peel and very thinly slice the garlic and lightly crush the coriander seeds in a pestle and mortar or with the end of a rolling pin. Add the garlic and coriander to the onion and celery and cook for a further 30 seconds, stirring frequently. Add to the slow cooker.",
    "TOP ARTICLES",
    "2/5",
    "READ MORE",
    "New Zealand mosque shooting: Christchurch",
    "victims officially named as first funerals take place",
    "Tip the chopped tomatoes into the slow cooker. Rinse the cannellini beans in a sieve under cold running water, and drain. Add the cannellini beans, tomato puree, water, sugar, wine or extra water, capers and vinegar to the slow cooker and season with a pinch of salt and plenty of pepper. Stir well then cover with the lid and cook on high for 3-4 hours or low for 5-7 hours, or until the sauce is rich and thick.",
    "Read more",
    "How to prepare a butternut squash",
    "Kale with lemony vinaigrette recipe",
    "Purple sprouting broccoli with orange and cashews",
    "Cut the aubergines into roughly 3cm chunks. Spray a large non-stick frying pan or wok with oil and place over a medium-high heat. Add half the aubergine, season with salt and pepper and spray with more oil. Fry for 3-4 minutes or until lightly browned all over, stirring frequently. Tip on to a plate.",
    "Repeat with the remaining aubergine. Add all the aubergine to the slow cooker and stir well. Cover and cook on high for a further 30-45 minutes or until the aubergine is very tender. Remove the lid, stir in the pine nuts and adjust the seasoning to taste.",
    "Serve warm, or leave to cool, then cover and keep in the fridge and eat within three days. Drizzle with the extra virgin olive oil and garnish with basil leaves to serve.",
    "This slow-cooked aubergine stew really benefits from the gentle cooking of the tangy tomato sauce. Serve warm, or at room temperature, with a salad and some crusty bread."
  ],
  "ingredients": [
    "0",
    "Sicilian aubergine and bean stew",
    "Serves 4",
    "1 large red onion",
    "3 slender celery sticks",
    "Oil, for spraying",
    "3 garlic cloves",
    "1 tsp coriander seeds",
    "400g can chopped tomatoes",
    "400g can cannellini beans",
    "2 tbsp tomato puree",
    "200ml cold water",
    "40g soft light brown sugar",
    "75ml red wine or extra cold water",
    "2 tbsp baby capers (from a jar), drained (optional)",
    "1 tbsp red wine vinegar",
    "2 medium aubergines (about 225g each)",
    "1 tbsp pine nuts (10g)",
    "Flaked sea salt",
    "Ground black pepper",
    "1 tbsp extra virgin olive oil",
    "Fresh basil leaves, to serve"
  ],
  "__v": 1
}