{
  "hash": "cd19a375ab9866f742941c4ce6377c53d61e3b7d",
  "title": "Slow Cooker Chicken Curry",
  "image": "http://cdn1.wellplated.com/wp-content/uploads/2016/06/Slow-Cooker-Coconut-Curry-Chicken.jpg",
  "href": "http://www.wellplated.com/slow-cooker-chicken-curry/",
  "extension": "Chrome",
  "firstAdded": "2017-02-28T18:56:07.512000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "Place the potatoes and bell peppers in the bottom of a 5-quart or larger slow cooker. Pour the chicken broth and lime juice over the top.",
    "In a small bowl, combine the curry, paprika, cumin, garlic powder, and salt. Place the chicken thighs on a large plate or cutting board, and rub the spice mix on both sides to coat.",
    "Heat the olive oil in a large skillet over medium high. Once the oil is hot and shiny, add the chicken thighs and briefly pan sear on each side, just until brown— about 2 minutes for the first side and 1 minute for the second side. Place the seared chicken in the slow cooker, on top of the vegetables. Cover and cook on low for 4-5 hours or high for 2-3 hours, until the chicken is cooked through.",
    "About 15 minutes before serving, use a slotted spoon to remove the chicken thighs and vegetables from the slow cooker and transfer them to a plate. Pour the coconut milk and cornstarch slurry into the slow cooker, and whisk to combine. Turn the slow cooker heat to high, return the chicken and vegetables to the slow cooker, then recover and cook until the sauce thickens, about 15 minutes. Serve warm over rice or quinoa, top with fresh cilantro and lime wedges as desired.",
    "I do not recommend chicken breasts for this recipe, as they have a tendency to dry out in the slow cooker. If you decide to use chicken breasts, watch the cooking time very carefully, as the chicken will cook more quickly and can easily become too dry.",
    "Store leftovers in the refrigerator for up to 5 days. DO NOT FREEZE. Coconut milk will separate and become “grainy” in the freezer."
  ],
  "ingredients": [
    "0",
    "curry powder",
    "paprika",
    "ground cumin",
    "light coconut milk",
    "brown ricequinoa"
  ],
  "__v": 1
}