{
  "hash": "e55cadeee03fb8c0d21ce2c47b4bd655955332fd",
  "title": "No-Bake Vegan Cheesecake",
  "image": "https://greatist.com/sites/default/files/styles/article_main/public/Vegan%20Cheesecake%20Banner.jpg?itok=frgMmrCu",
  "href": "https://greatist.com/eat/no-bake-cheesecake-for-vegans",
  "extension": "Firefox",
  "firstAdded": "2018-01-25T15:01:08.636000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "Crust",
    "1. Add the dates, hazelnuts, and salt in a food processor or high-powered blender and grind until you get a sticky dough-like consistency. Don't over-process though; make sure you retain some texture.",
    "2. Line a springform pan or pie pan with parchment paper. Lay the crust mix on the bottom of the mold and press with your hand to make it firm.",
    "Filling",
    "3. Add all filling ingredients, except the matcha powder, in a food processor or high-speed blender and blend until smooth.",
    "4. Transfer half of the filling to a separate container and combine the matcha green tea powder thoroughly with the remaining mixture.",
    "5. Now you have two cream fillings: vanilla and matcha.",
    "6. Alternate the vanilla and matcha layers and repeat the process until both fillings are in the pan. This will give it a zebra-like effect.",
    "7. Tap the mold on the counter a few times to release any trapped air bubbles.",
    "8. Loosely wrap with stretch film and place in the freezer for 4 hours. You can also store it in the freezer for up to a month.",
    "Thaw at room temperature for 15 minutes before serving."
  ],
  "ingredients": [
    "0",
    "Crust",
    "10 Medjool dates, pitted",
    "1 cup hazelnuts",
    "Pinch of salt",
    "Filling",
    "2 cups raw cashews (soaked in water for 3 hours or if you're only human and don't have time for this, soak in hot water for 30 minutes to 1 hour)",
    "1/2 cup coconut cream",
    "1 lemon, juice only",
    "1 teaspoon vanilla extract",
    "1/2 cup maple syrup",
    "2 teaspoons matcha green tea powder (Carrington Farms is a good one)"
  ],
  "__v": 1
}