{
  "hash": "14db840b20d7f40add81979ddeb5e4facd9e58fb",
  "title": "DOLMAS (STUFFED GRAPE LEAVES)",
  "image": "https://www.budgetbytes.com/wp-content/uploads/2010/05/Dolmas20close-380x380.jpg",
  "href": "https://www.budgetbytes.com/2010/05/dolmas-stuffed-grape-leaves/",
  "extension": "",
  "firstAdded": "2018-05-02T12:44:34.292000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Finely dice the yellow onion and mince the garlic. Cook them in a skillet with 2 Tbsp of olive oil over medium/high heat until they are soft and translucent. Transfer them to a mixing bowl to cool.",
    "Add the rice, mint, salt and 1/4 cup (4 Tbsp) of lemon juice to the mixing bowl with the cooked onions and garlic. Stir to combine well.",
    "Gently unroll/unfold the grape leaves from the jar and lay flat on a clean surface (3 or 4 at a time). Place 1 tsp to 1 Tbsp (depending on the size of the leaf) of rice mix at the bottom near where the stem would attach. Roll the grape leaves by first folding the bottom up, then the right and left sides in then rolling all the way toward the top (see photos below). Do not roll tightly as the rice will expand when the Dolmas cook in the next step. Continue to fill and roll each grape leaf this way.",
    "As you roll the grape leaves place them in the bottom of a wide pot, seam side down, very close together (see photos below). If you fill the bottom of the pot in a single layer and still have more, you can start a second layer.",
    "Drizzle the reamaining 2 Tbsp of olive oil and 2 Tbsp of lemon juice over top of the Dolmas in the pot. Fill with water just until the Dolmas are covered. Place a large plate or dish on top of the Dolmas to hold them down and keep them from unraveling as they boil. Place the pot over high heat, bring to a boil then reduce the temperature and simmer until the rice is soft (about 30-40 minutes). Add more water as needed. Gently remove the Dolmas from the pot after cooking. Reserve any left over liquid to be poured over any left over Dolmas while they are stored in the refrigerator."
  ],
  "ingredients": [
    "0",
    "1 jar 40 each grape leaves $5.99",
    "1 medium yellow onion $0.25",
    "4 cloves garlic $0.24",
    "4 Tbsp olive oil, divided $0.20",
    "1 1/2 cups long grain rice, uncooked $0.45",
    "6 Tbsp lemon juice, divided $0.32",
    "1 tsp salt $0.05",
    "2 Tbsp 1-2 sprigs fresh mint, minced $0.49"
  ],
  "__v": 1
}