{
  "hash": "538083f110766d428e4a303e5d7edbead6ab3113",
  "title": "Guy-talian Nachos",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/guy-fieri/guy-talian-nachos-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2017-01-02T21:09:25.895000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Salsa: Combine all the ingredients in a nonreactive bowl. Set aside and allow the flavors to marry.",
    "Filling: In a medium-sized saute pan over medium-high heat, add half of the olive oil. Cook both the ground beef and turkey sausage until cooked through, then remove them from the pan to a plate. Add the remaining olive oil to the pan and saute the onion until it turns opaque, about 4 to 5 minutes. Stir in the garlic and cook for 2 minutes longer while preventing it from burning. Return the meat mixture to the pan. Combine the ingredients well and set the filling aside.",
    "Toppings: Combine the ricotta cheese and sour cream in a small food processor or blender. Mix well and pour it into a resealable bag.",
    "Prepare the remaining toppings and hold until you are ready to assemble the nachos.",
    "Chips: In a heavy skillet, over medium heat, heat the oil to 350 degrees F. Carefully lower the wonton wrappers into the oil, in batches, since they cook extremely fast. As soon as they puff up, make sure you flip them over. Once they start to brown, remove them to a plate lined with a paper towel. Sprinkle them with salt as soon as they are out of the oil.",
    "Nachos:",
    "Preheat the oven to a low broil and position a rack approximately 9 inches below the burner.",
    "In a large oven-safe dish, arrange a layer of chips, a layer of meat mixture, (reheat if necessary), and sprinkle everything with some mozzarella. Repeat this action with the second half of the ingredients, and again finish with the cheese. Put the dish under the broiler until the cheese has melted, (keep a close eye on this). Remove the nachos from the oven and top with the salami, fresh herbs and salsa. Take the bag holding the ricotta/sour cream mixture, and create an instant pastry tip by cutting a hole in the corner of the bag. Drizzle the sauce over your nachos, sprinkle with the green onions and pepperoncini, if using, and serve immediately.",
    "Recipe courtesy of Guy Fieri"
  ],
  "ingredients": [
    "0",
    "8 piquante peppers, seeded and diced (recommended: Peppadew)",
    "4 Roma tomatoes, seeded and small diced",
    "1/3 cup minced red onion",
    "1/4 cup chopped Italian parsley leaves",
    "2 tablespoons capers, 1 tablespoon roughly chopped, 1 tablespoon whole",
    "2 tablespoons piquante pepper juice",
    "1 tablespoon minced garlic, about 2 cloves",
    "1 tablespoon extra-virgin olive oil",
    "1 teaspoon freshly cracked black pepper",
    "Pinch kosher salt",
    "1 tablespoon extra-virgin olive oil, divided",
    "1/2 pound ground beef (80/20 lean muscle to fat ratio)",
    "1/2 pound Italian turkey sausage, casings removed",
    "1/4 yellow onion, small diced, about 1/4 cup",
    "1 tablespoon minced garlic",
    "1/4 cup ricotta cheese",
    "1/4 cup sour cream",
    "8 ounces mozzarella, grated",
    "2 ounces hard salami, julienned",
    "1 tablespoon julienned basil leaves",
    "1 tablespoon chopped Italian parsley leaves",
    "4 green onions, thinly sliced",
    "2 tablespoons sliced pepperoncini, optional",
    "3 cups canola oil",
    "1 package wonton wrappers, halved",
    "Kosher salt"
  ],
  "__v": 1
}