{
  "hash": "63bc638b67c16b6949d419dd0af3e26193356ac9",
  "title": "Copycat Reese's Creamy Peanut Butter Eggs",
  "image": "http://www.lecremedelacrumb.com/wp-content/uploads/2017/02/reeses-peanut-butter-eggs-101.jpg",
  "href": "http://www.lecremedelacrumb.com/copycat-reeses-creamy-peanut-butter-eggs/",
  "extension": "Chrome",
  "firstAdded": "2017-05-06T22:49:58.875000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine peanut butter and butter in a medium-large microwave safe bowl. Microwave for 1 minute. Stir until smooth.",
    "Add vanilla and powdered sugar and mix until sugar is completely incorporated and there are no streaks of white. Mixture should be very thick. Use a spoon or spatula to spread mixture out to an even layer (doesn't have to be perfectly smooth, you just want the mixture to be spread out so that it chills faster and evenly).",
    "Transfer bowl to the fridge or freezer (faster!) and chill for 10-15 minutes. Meanwhile, line a small baking sheet (if you don't have a pan small enough to fit in your fridge or freezer, you can use plate) with wax or parchment paper.",
    "When peanut butter mixture is chilled (just needs to be cooled and fairly firm, not totally cold), remove from fridge or freezer. Scoop out about 3 tablespoons of the mixture, roll into a ball, then place on baking sheet. Use the palm of your hand to flatten the ball to less than ½ inch thickness, then shape with your fingers to make it egg-shaped. Repeat with remaining mixture.",
    "Transfer to fridge or freezer for 3-5 minutes. While eggs are chilling, place chocolate in a microwave safe bowl (if using both white and dark chocolate, place them each in a separate bowl and melt separately) and microwave on half power for 1½ minutes. Stir until smooth (return to microwave on half power for 20 seconds if not completely melted yet).",
    "Remove peanut butter eggs from fridge or freezer and use a fork to dip them one at a time into the melted chocolate - tap the fork on the side of the bowl after each dip to drain excess chocolate - then transfer back to baking sheet. Drizzle with a bit of extra chocolate and top with sprinkles if desired. Repeat with remaining peanut butter eggs. Allow to cool for a few minutes (you can transfer back to fridge or freezer for a minute or so and they will harden very quickly) and serve or store at room temperature."
  ],
  "ingredients": [
    "0",
    "1 cup creamy peanut butter",
    "4 tablespoons butter",
    "2 teaspoons vanilla extract",
    "1¼ cups powdered sugar",
    "2 cups dark chocolate melting chips OR white chocolate melting chips (OR 1 cup of each)",
    "optional: sprinkles and additional chocolate for drizzling"
  ],
  "__v": 1
}