{
  "hash": "90431a115eed3b6d2c5eb24ac3d22ade9d13e721",
  "title": "Crockpot Braised Beef Ragu with Polenta",
  "image": "http://cdn.pinchofyum.com/wp-content/uploads/Braised-Beef-Ragu-on-table.jpg",
  "href": "http://pinchofyum.com/crockpot-braised-beef-ragu-polenta",
  "extension": "Chrome",
  "firstAdded": "2016-08-12T02:33:19.995000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Optional, but for best tasting results: Heat the olive oil in a large, deep frying pan. Add the beef in one whole piece and fry on each side for about 5 minutes, turning until the whole exterior is golden brown. I had some splattering issues so I covered the pan with a lid.",
    "Place all remaining ingredients with the beef in a crockpot or slow cooker (5 quart size worked for me). Cover and cook on low for 7-8 hours. When the beef falls apart easily when pulled at with two forks, it is ready. Shred the beef into pieces and give it a good stir.",
    "For the polenta, boil the water and add the salt. Slowly add the cornmeal, whisking constantly to avoid lumps. The polenta will start to thicken quickly. Continue whisking or stirring for 2-3 minutes before removing from heat. Stir in the butter until melted (you can also add cheese I'M JUST SAYING). For solid and chewy polenta, pour into a rectangular dish, let cool for 15-20 minutes, and cut into pieces. For softer polenta (my preference), serve scoops of polenta immediately before it has hardened."
  ],
  "ingredients": [
    "0",
    "2 tablespoons olive oil",
    "3 lbs. beef rump roast or round roast",
    "half a yellow or white onion, minced",
    "3 cloves garlic, minced",
    "2 28-ounce cans San Marzano whole tomatoes (see notes)",
    "½ cup red wine",
    "3 tablespoons tomato paste",
    "1 teaspoon basil",
    "1 teaspoon oregano",
    "2 bay leaves",
    "2 teaspoons salt",
    "black pepper to taste",
    "1",
    "6 cups water",
    "1-2 teaspoons salt",
    "1¾ cup yellow cornmeal",
    "3 tablespoons butter"
  ],
  "__v": 1
}