{
  "hash": "8d8e6b72b4a453d367bc85aff8c272421c01233e",
  "title": "Best Ever German Chocolate Cake",
  "image": "http://www.adashofsanity.com/wp-content/uploads/2014/03/vitaminfresh.net-9-1024x512.png",
  "href": "http://www.adashofsanity.com/2014/03/best-ever-german-chocolate-cake/",
  "extension": "Chrome",
  "firstAdded": "2017-01-04T18:12:37.155000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cake:",
    "Pre-heat oven to 350º F. Grease three 8-inch or two 9-inch round cake pans with cooking spray and lightly dust with flour. I like to do 3 8x8 pans, and just make a 2 layer, cake but set aside the 3rd cake for the kids that don’t like the German chocolate frosting or for my sisters who have nut allergies. This is also great in a 9x13.",
    "In mixing bowl (I use my Kitchen Aid), add flour, sugar, cocoa, baking powder, baking soda, and salt. Stir until well combined.",
    "Add milk, vegetable oil, eggs, and vanilla to flour mixture and mix together on medium speed until well mixed. Reduce the speed to low and add boiling water to the cake batter a little bit at a time. Once the water is all mixed in, beat on high for about 1 minute.",
    "Evenly distribute cake batter between the three 8x8 pans (or two 9x9) prepared cake pans.",
    "Bake for 30-35 minutes, or until a toothpick or cake tester inserted in the center comes out clean.",
    "Remove from the oven and allow to cool for about 10 minutes. Remove from the pan and cool completely.",
    "Frost cake with frosting.",
    "German Chocolate Frosting:",
    "*Note if you are layering the cake, I always double the recipe above and have a little extra frosting for later. If you are doing a 9x13 a single recipe should be sufficient.",
    "In a large saucepan combine evaporated milk and cornstarch and mix; add in sugar, egg yolks, margarine and vanilla. Cook over low-medium heat until it reaches a slow boil. Stirring constantly until thick, about 12 minutes from when it starts to slowly boil. Remove from heat and stir in pecans and coconut, this frosting will thicken up as it cools. Let cool 1 hour then spread on cooled cake. To make this cake easy to slice, layer cake with frosting, then set in the refrigerator for 30 minutes or more, then slice and serve."
  ],
  "ingredients": [
    "0",
    "Chocolate Cake",
    "2 cups all-purpose flour",
    "2 cups sugar",
    "¾ cup cocoa",
    "2 teaspoons baking powder",
    "1½ teaspoons baking soda",
    "1 teaspoon salt",
    "1 cup milk",
    "½ cup vegetable oil",
    "2 eggs",
    "2 teaspoons vanilla extract",
    "1 cup boiling water",
    "German Chocolate Frosting",
    "1 cup evaporated milk",
    "1 cup white granulated sugar",
    "3 egg yolk, beaten with 1 teaspoon water",
    "1/2 cup butter or margarine",
    "1 teaspoon vanilla extract",
    "1 cup chopped pecans",
    "1 cup flaked coconut",
    "1 tablespoon of cornstarch"
  ],
  "__v": 1
}