{
  "hash": "9c37c29972d0db2b1f8c392479d4913e0ca917bd",
  "title": "One-Pot Smoky Fish With Tomato, Olives and Couscous",
  "image": "https://static01.nyt.com/images/2020/06/09/dining/lh-one-pot-fish-with-couscous/merlin_172953240_aafca728-6ab4-49b3-b846-b7a7228ec913-articleLarge.jpg",
  "href": "https://cooking.nytimes.com/recipes/1021160-one-pot-smoky-fish-with-tomato-olives-and-couscous?campaign_id=90&emc=edit_fwd_20200612&instance_id=19350&nl=cooking&regi_id=79859114&segment_id=30787&te=1&user_id=4264688f24592aeeb06433e5d96d7150",
  "extension": "Firefox",
  "firstAdded": "2020-06-12T20:23:59.274000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large (12-inch) skillet (use one with a tight-fitting lid), heat the olive oil over medium. If using fresh red bell pepper, add it with the onion, and cook, tossing occasionally, until tender and lightly browned, 8 to 10 minutes. Meanwhile, pat the fish fillets dry with a paper towel and season with salt and pepper.",
    "If using roasted red peppers, add them with the garlic, anchovies, paprika and cayenne, and cook for 1 more minute, until the garlic is fragrant. Add the wine and stir to scrape up any brown bits from the pan. When the wine has almost entirely evaporated, add the chicken stock, tomatoes, olives, parsley, 1 teaspoon salt and 1/2 teaspoon black pepper. Bring to a boil over medium-high heat.",
    "Add the couscous, stir, then add the fish fillets, wiggling them lightly to submerge them in the sauce. Turn the heat to low, cover and simmer for 6 to 8 minutes, until fish is opaque and flakes easily with a fork. Carefully transfer the fish to a plate. Simmer the couscous, uncovered, stirring occasionally, until it’s tender and the liquid in the pan has reduced slightly, about 5 minutes.",
    "Off the heat, stir in the vinegar and gently return the fish to the skillet to warm, being careful to keep it intact. Serve hot in shallow bowls garnished with additional parsley and a drizzle of olive oil."
  ],
  "ingredients": [
    "0",
    "¼",
    "cup olive oil, plus more for serving",
    "¾",
    "cup jarred roasted red peppers, roughly chopped, or 1 fresh red bell pepper, cored, seeded and diced",
    "1",
    "medium yellow onion, thinly sliced",
    "4",
    "(6-ounce) skinless mild, white fish fillets, such as cod, fluke or halibut",
    "Kosher salt and black pepper",
    "1 ½",
    "tablespoons minced garlic (about 3 large cloves)",
    "1",
    "tablespoon chopped anchovies (about 4 fillets)",
    "1",
    "teaspoon smoked paprika",
    "Pinch of ground cayenne",
    "⅓",
    "cup dry white wine",
    "1 ½",
    "cups chicken stock, preferably low-sodium",
    "1",
    "(14-ounce) can crushed tomatoes",
    "½",
    "cup olives, preferably black or Kalamata, pitted or not",
    "2",
    "tablespoons chopped fresh parsley, plus more for serving",
    "¾",
    "cup pearl couscous",
    "2",
    "teaspoons sherry vinegar or red wine vinegar"
  ],
  "__v": 1
}