{
  "hash": "a0883a1f9ba1bc780a2ef92b90070ac8f6587823",
  "title": "Veggie-Stuffed Portobellos\nACTIVE TIME\n20m\nTOTAL TIME\n45m\n6 servings",
  "image": "http://target.scene7.com/is/image/Target/c_350962499?hei=340",
  "href": "http://www.cooking.com/recipes-and-more/recipes/veggie-stuffed-portobellos-recipe",
  "firstAdded": "2015-02-04T21:28:56.414000",
  "users": [
    null
  ],
  "keywords": [
    "portobello",
    "mushrooms",
    "cleaned",
    "stemmed",
    "stems",
    "reserved",
    "carrot",
    "yellow",
    "onion",
    "bunch",
    "kale",
    "washed",
    "log",
    "goat",
    "cheese",
    "extra",
    "virgin",
    "olive",
    "oil",
    "kosher",
    "salt",
    "cracked",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "directions",
    "Preheat oven to 350 degrees F.",
    "Cover two baking sheets or cookie sheets with parchment paper. Evenly space the mushrooms gill side up. Set aside.",
    "Heat 2 tablespoons of olive oil in a large skillet over medium-high heat. Add carrots to the pan. Cook for 2 minutes, stirring frequently. Add the onions and cook for 4 to 5 minutes more, or until onion and carrots are softened and slightly browned.",
    "Add in chopped mushroom stems. Stir in a heavy pinch of salt and a few turns from a pepper mill. Cook until the mushrooms are soft and have released their moisture, 5 to 6 minutes. Stir in the kale and cook until it’s wilted.",
    "Transfer vegetable mixture to a bowl. Crumble goat cheese into the mixture and gently stir until combined. Add salt and pepper as necessary.",
    "Drizzle the mushroom caps with olive and sprinkle with salt and pepper. Evenly divide the vegetable mixture between the mushrooms. Spread the mixture so that it covers the entire top side of the mushroom.",
    "Bake at 350 degrees F for 25 to 30 minutes, or until the mushrooms are soft and the top is golden brown. Serve warm or at room temperature."
  ],
  "ingredients": [
    "0",
    "ingredients",
    "6 large portobello mushrooms, cleaned and stemmed, stems reserved and chopped",
    "1 carrot, finely diced",
    "1 yellow onion, finely diced",
    "1 bunch kale, washed, stemmed and finely chopped",
    "One 4-ounce log goat cheese",
    "Extra virgin olive oil",
    "Kosher salt and freshly cracked black pepper"
  ],
  "__v": 1
}