{
  "hash": "09e53945af6b301e25a4b089ee69015e0d0b7c94",
  "title": "Vanilla Cream Puff Pastry",
  "image": "http://wewalka.us/sites/default/files/styles/recipe_banner/public/ww-blaetterteigpasteten_2905.jpg?itok=PQiAAVa3",
  "href": "http://wewalka.us/recipes/vanilla-cream-puff-pastry",
  "extension": "",
  "firstAdded": "2017-02-05T13:14:14.433000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400°F.",
    "Unroll refrigerated Puff Pastry Dough on enclosed parchment paper and place on a baking sheet. Cut into 12 even squares (4x3). Then using a small, round pastry cutter, cut out circles on 4 of the pastry squares. Place the ones with the hole on top of the other squares, 3 pastry sheets high, to form little \"dough towers.\"",
    "Coat each tower with egg wash.",
    "Bake in the oven for 10-15 minutes or until golden brown and nicely puffed. Let them cool completely.",
    "Meanwhile, using a whisk, combine milk, sugar, and cornstarch in a medium saucepan over medium heat. Allow milk to heat so that tiny bubbles form around the edges. Whisk occasionally to keep cornstarch from clumping. Remove from heat.",
    "Mix 2 Tbsp. of the hot milk into the beaten eggs and then slowly add the egg mixture into the hot milk, whisking constantly. Return the pan to the heat until the custard thickens slightly. Do not allow to boil. Remove from heat and mix in vanilla extract and rum.",
    "On cooled pastry towers, spread or pipe jam on the base of the puff pastry towers, filling with vanilla cream and garnish with berries and mint leaves."
  ],
  "ingredients": [
    "0",
    "1 pkg. Wewalka Puff Pastry Dough",
    "Egg wash (1 egg and 2 Tbsp. water, beaten)",
    "2 cups milk",
    "1/3 cup sugar",
    "2 Tbsp. cornstarch",
    "2 eggs, lightly beaten",
    "1 tsp. vanilla extract",
    "2 Tbsp. rum",
    "6 Tbsp. berry jam",
    "12 oz. fresh berries (strawberries, raspberries, blackberries, etc.)",
    "Fresh mint leaves"
  ],
  "__v": 1
}