{
  "hash": "926950be94014cff7ddf62da1da651340e838a08",
  "title": "Cheeseburger Egg Rolls",
  "image": "http://www.willcookforsmiles.com/wp-content/uploads/2015/11/Cheeseburger-Eggrolls-4-from-willcookforsmiles.com_.jpg",
  "href": "http://www.willcookforsmiles.com/2015/12/cheeseburger-egg-rolls.html",
  "extension": "Chrome",
  "firstAdded": "2016-03-23T19:33:23.890000",
  "users": [
    null
  ],
  "keywords": [
    "egg",
    "rolls",
    "beef",
    "medium",
    "yellow",
    "onion",
    "oil",
    "cooking",
    "salt",
    "cracked",
    "black",
    "pepper",
    "slices",
    "american",
    "cheese",
    "pickles",
    "roll",
    "wrappers",
    "white",
    "frying",
    "mayo",
    "tomato",
    "garlic",
    "clove",
    "pressed",
    "paprika"
  ],
  "directions": [
    "0",
    "Preheat a medium cooking pan over medium heat. Add a tablespoon of oil and minced onion. Saute until onion is translucent.",
    "Add ground beef to the pan and break it up as much as possible. Season with some salt and pepper, cover and cook until meat starts to brown. Stir well and make sure to keep breaking up all the meat clumps as it cooks. Drain off all the juices and place cooked meat into a mixing bowl.",
    "Break up cheese and add it to the bowl. Mix until all the cheese is melted and evenly incorporated. Stir in pickles.",
    "Heat up oil to about 350 degrees as you roll the egg rolls.",
    "Gently whisk egg while and set it close to you.",
    "To roll the egg rolls: place egg roll wrapper on a diamond. Spread about 2 tablespoons of cheeseburger filling in a line, leaving about an inch on each side. Gently and carefully, fold the corner that's closest to you over the cheeseburger mixture, and tuck under the filling. Fold both side corners toward center of wrapper, it will start to look like an open envelope. Dip your fingers in egg white and run it along the edges of the wrapper to seal better. Carefully roll up the egg roll.",
    "Fry egg rolls in batches until golden brown, turning once the bottom side turns golden.",
    "Whisk all ingredients for the sauce until completely incorporated. Serve with egg rolls."
  ],
  "ingredients": [
    "0",
    "Egg Rolls:",
    "1 lb ground beef",
    "½ medium yellow onion, minced",
    "1 Tbsp vegetable oil for cooking",
    "Salt and fresh cracked black pepper",
    "5 slices American cheese",
    "½ cup diced pickles",
    "13-14 egg roll wrappers",
    "1 egg white",
    "Oil for frying",
    "Sauce:",
    "¼ cup mayo",
    "1 Tbsp tomato paste",
    "1 garlic clove, pressed",
    "1 tsp paprika",
    "Salt and fresh cracked black pepper"
  ],
  "__v": 1
}