{
  "hash": "91bb74fad9cbc18b4bdb13ad0012b51b7de94415",
  "title": "Pumpkin Ravioli With Sage Walnut Pumpkin Butter",
  "image": "https://static01.nyt.com/images/2015/11/18/dining/18WELLNESS/18WELLNESS-master675.jpg",
  "href": "http://cooking.nytimes.com/recipes/1017824-pumpkin-ravioli-with-sage-walnut-pumpkin-butter",
  "extension": "Chrome",
  "firstAdded": "2016-08-10T15:31:59.074000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "PREPARATION",
    "Heat oven to 400 degrees and line a rimmed baking sheet with parchment paper. Place pumpkin on pan, cut sides up, drizzle with olive oil and generously season with brown sugar, salt and pepper. Roast for 35 to 45 minutes, or until soft. Allow to cool slightly.",
    "Scoop out the flesh of the pumpkin into the bowl of a food processor. Add egg and nutmeg, and purée until smooth. Set aside 1/4 cup pumpkin purée for the sauce.",
    "Dust a work surface with semolina flour. Lay out a sheet of pasta, then place 2 teaspoons of filling every few inches. Brush around the filling with water, then place a second pasta sheet over the top. Cut with a ravioli stamp or sharp knife, and crimp to seal individual raviolis.",
    "Bring a large pot of water to boil and season with 2 tablespoons salt. Drop in ravioli a few at a time and cook for 5 to 7 minutes.",
    "Make the sauce to serve by heating 1 tablespoon butter in a medium skillet over medium-high heat. Add the reserved 1/4 cup pumpkin filling, the sage leaves, walnuts, balsamic vinegar and a few grinds of nutmeg and cook until combined and sizzling. Spoon sauce onto plates and top with ravioli."
  ],
  "ingredients": [
    "0",
    "1 small cinderella or sugar pumpkin, halved and seeded",
    "2 tablespoons olive oil",
    "1 tablespoon light brown sugar",
    "Sea salt and black pepper",
    "1 egg",
    "½ teaspoon freshly grated nutmeg, more as needed",
    "Semolina flour",
    "About 3 pounds fresh pasta sheets",
    "2 tablespoons unsalted butter",
    "10 fresh sage leaves, finely chopped",
    "2 tablespoons crushed walnuts",
    "2 tablespoons balsamic vinegar"
  ],
  "__v": 1
}