{
  "hash": "9b1cb892bb3b721cd669a319b7952de38208bcfb",
  "title": "Doughnut Ice Cream",
  "image": "http://acozykitchen.com/wp-content/uploads/2013/11/DoughnutIceCream_1.jpg",
  "href": "http://acozykitchen.com/doughnut-ice-cream/",
  "extension": "Chrome",
  "firstAdded": "2015-10-04T21:46:08.225000",
  "users": [
    null
  ],
  "keywords": [
    "milk",
    "yeasted",
    "glazed",
    "doughnuts",
    "white",
    "granulated",
    "sugar",
    "salt",
    "egg",
    "yolks",
    "cream"
  ],
  "directions": [
    "0",
    "To infuse the milk, start by pouring the milk into a large bowl. Tear 4 of the glazed doughnuts into bite-sized pieces and mix them into the milk. Cover the bowl with plastic wrap and transfer to the fridge for at least 4 hours, ideally overnight. When the milk is done infusing, pour the milk through a sieve, being sure to press the doughnut pieces so they expel any milk. Also, the glaze at the bottom of the bowl; make sure to get all of that too. The milk should measure out to 2 1/2 cups milk.",
    "Create an Ice Bath to pour the custard into once it is done.",
    "To a medium saucepan, add the infused doughnut-milk, sugar and salt; heat over medium until the milk reaches a slight simmer and the sugar dissolves. Once it reaches the simmer, remove the pan from the heat.",
    "While doing this, beat the egg yolks together, thoroughly. Next you’re going to temper the milk mixture. Whisking the entire time, add about 1/4 cup of warm milk to the egg yolks. Add the remainder of the milk to the egg yolk mixture and whisk. Return the entire mixture back to the medium saucepan and place over low heat. Cook the milk and yolk mixture, stirring constantly, until a thermometer reads 170 to 175 degrees F and the mixture appears thick and coats the back of the spoon.",
    "Pour the mixture through a chinois into the bowl. Stir in the heavy cream. Wrap the bowl in plastic and transfer it to the fridge for 4-5 hours, or overnight, until very cold.",
    "Churn the mixture into the bowl of your ice cream maker, until it reaches a 'soft-serve' consistency. Once it is there, dice the last 2 doughnuts and add to the ice cream in the maker.Transfer to a freezer-safe container and freeze overnight."
  ],
  "ingredients": [
    "0",
    "4 cups whole milk",
    "6 yeasted glazed doughnuts",
    "2/3 cup white granulated sugar",
    "1 teaspoon sea salt",
    "8 large egg yolks",
    "2 cup heavy cream"
  ],
  "__v": 5
}