{
  "hash": "c0dfd20bec52f1afb2bd03ca1d5a6635940233b6",
  "title": "Provencal Vegetable Soup (Soupe au Pistou)",
  "image": "https://res.cloudinary.com/hksqkdlah/image/upload/c_fill,dpr_1.0,f_auto,q_auto,w_400/24035_sfs-soup-au-pistou-23-1",
  "href": "https://www.cooksillustrated.com/recipes/8360-provencal-vegetable-soup-soupe-au-pistou?incode=MCSCD00L0&ref=new_search_experience_2",
  "extension": "Chrome",
  "firstAdded": "2017-09-18T17:05:53.832000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "We prefer broth prepared from our Vegetable Broth Base (see related content), but store-bought vegetable broth can be used.",
    "1. FOR THE PISTOU: Process all ingredients in food processor until smooth, scraping down sides of bowl as needed, about 15 seconds. (Pistou can be refrigerated for up to 4 hours.)",
    "2. FOR THE SOUP: Heat oil in large Dutch oven over medium heat until shimmering. Add leek, celery, carrot, and 1/2 teaspoon salt and cook until vegetables are softened, 8 to 10 minutes. Stir in garlic and cook until fragrant, about 30 seconds. Stir in broth and water and bring to simmer.",
    "3. Stir in pasta and simmer until slightly softened, about 5 minutes. Stir in haricots verts and simmer until bright green but still crunchy, 3 to 5 minutes. Stir in cannellini beans and their liquid, zucchini, and tomato and simmer until pasta and vegetables are tender, about 3 minutes. Season with salt and pepper to taste. Serve, topping individual portions with generous tablespoon pistou."
  ],
  "ingredients": [
    "0",
    "Pistou",
    "¾\tcup fresh basil leaves",
    "1\tounce Parmesan cheese, grated (1/2 cup)",
    "⅓\tcup extra-virgin olive oil",
    "1\tgarlic clove, minced",
    "Soup",
    "1\ttablespoon extra-virgin olive oil",
    "1\tleek, white and light green parts only, halved lengthwise, sliced 1/2 inch thick, and washed thoroughly",
    "1\tcelery rib, cut into 1/2-inch pieces",
    "1\tcarrot, peeled and sliced 1/4 inch thick",
    "Salt and pepper",
    "2\tgarlic cloves, minced",
    "3\tcups vegetable broth",
    "3\tcups water",
    "½\tcup orecchiette or other short pasta",
    "8\tounces haricots verts or green beans, trimmed and cut into 1/2-inch lengths",
    "1\t(15-ounce) can cannellini or navy beans",
    "1\tsmall zucchini, halved lengthwise, seeded, and cut into 1/4-inch pieces",
    "1\tlarge tomato, cored, seeded, and cut into 1/4-inch pieces"
  ],
  "__v": 1
}