{
  "hash": "c39ea1b915c8b5041863f6aec6c091a347a717a2",
  "title": "Cold-Weather Soupe au Pistou",
  "image": "//images.food52.com/X4dXVxA1LABblxHnxnj7ojUTGJM=/753x502/719ba4e2-6a9b-440d-9996-f11ceba30c05--2015_1006_soupe-au-pistou_bobbi-lin_12661.jpg",
  "href": "https://food52.com/recipes/38640-cold-weather-soupe-au-pistou",
  "extension": "Firefox",
  "firstAdded": "2015-10-31T13:10:25.752000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "basil",
    "spinach",
    "firmly",
    "bunch",
    "juice",
    "lemons",
    "walnuts",
    "parmesan",
    "garlic",
    "parsley",
    "yellow",
    "onion",
    "carrots",
    "fennel",
    "celery",
    "waxy",
    "potato",
    "cubes",
    "tomatoes",
    "salt",
    "black",
    "pepper",
    "stock",
    "water",
    "bay",
    "leaf",
    "cannellini",
    "beans",
    "pasta",
    "ditalini",
    "orzo",
    "winter",
    "pesto"
  ],
  "directions": [
    "0",
    "Combine olive oil and dried basil; let sit for at least half an hour while you prepare the other ingredients.",
    "Wash and dry the spinach. In a food processor, combine half the spinach with all of the lemon juice and blend until smooth. Add all other ingredients and blend until smooth.",
    "Keep pesto in the refrigerator for up to 2 weeks, or freeze until fresh basil is in season again (about 4 months).",
    "1",
    "In a large pot, heat olive oil over medium heat and, when shimmering, add onion, carrots, and fennel; season with salt and pepper and sauté until the onion is translucent and the carrots are softening. Add the garlic and stir until fragrant, then add the potato.",
    "Drain the can of tomatoes halfway and crush the tomatoes with your hands as you add them to the pot. Add the stock, water, and bay leaf, stir to combine, and turn the heat up to medium high. Let the soup come to a boil, then reduce heat to a simmer.",
    "Add the cannellini beans and allow the soup to simmer for about 20 minutes, stirring from time to time and adding water to adjust the soup's consistency.",
    "After 20 minutes, remove a cube of potato and taste it. If it's soft, add the pasta. (If it's not, continue simmering until it is.) When the pasta is cooked, about 10 minutes, remove the soup from the heat and stir in the spinach. Remove the bay leaf.",
    "To serve, ladle the soup into bowls, stir in about two tablespoons of pesto into each bowl and eat with crusty bread."
  ],
  "ingredients": [
    "0",
    "3/4 cup olive oil",
    "1/3 cup dried basil",
    "4 cups fresh spinach, firmly packed (about 1 large bunch)",
    "Juice of 2 lemons",
    "1/3 cup chopped walnuts",
    "3/4 cup freshly grated Parmesan",
    "2 to 3 garlic cloves",
    "Handful fresh parsley",
    "1",
    "3 tablespoons olive oil",
    "1 yellow onion, chopped",
    "3 carrots, chopped",
    "1/4 cup fresh fennel (or celery), chopped",
    "2 cloves garlic, minced",
    "1 small waxy potato, chopped into 1-inch cubes",
    "1 14-ounce can whole tomatoes",
    "Salt and freshly ground black pepper, to taste",
    "4 cups vegetable stock",
    "3 cups water",
    "1 bay leaf",
    "1 15.5-ounce can cannellini beans, drained",
    "1/2 pound small pasta (like ditalini or orzo)",
    "1 handful fresh spinach",
    "Winter pesto, for serving"
  ],
  "__v": 1
}