{
  "hash": "7d80f70edd1e597b7fa61d6a13f5e13234fd5afc",
  "title": "Creamy Vegan Pumpkin Soup",
  "image": "http://cookieandkate.com/images/2014/11/how-to-make-vegan-pumpkin-soup.jpg",
  "href": "http://cookieandkate.com/2014/creamy-vegan-pumpkin-soup/",
  "firstAdded": "2015-01-07T11:26:48.336000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "divided",
    "sugar",
    "pie",
    "pumpkin",
    "kabocha",
    "squash",
    "yellow",
    "onion",
    "medium",
    "garlic",
    "pressed",
    "salt",
    "cinnamon",
    "nutmeg",
    "dashup",
    "cayenne",
    "pepper",
    "spice",
    "black",
    "broth",
    "fat",
    "coconut",
    "milk",
    "cream",
    "vegan",
    "maple",
    "syrup",
    "honey",
    "pepitas",
    "green",
    "seeds"
  ],
  "directions": [
    "0",
    "Preheat oven to 425 degrees Fahrenheit and line a baking sheet with parchment paper for easy cleanup. Carefully halve the squash and scoop out the seeds, reserving them for roasting if you’d like (see note—you won’t need the roasted pumpkin seeds for this recipe). Slice each pumpkin halve in half to make quarters. Brush or rub olive oil over the flesh of the pumpkin and place the quarters, cut sides down, onto the baking sheet. Roast for 35 minutes or longer, until the orange flesh is easily pierced through with a fork. Set squash aside to cool slightly.",
    "Heat 3 tablespoons olive oil in a large Dutch oven or heavy-bottomed pot over medium heat. Once the oil is shimmering, add onion, garlic and salt to the skillet. Stir to combine.",
    "Cook, stirring occasionally, until onion is translucent, about 8 to 10 minutes. In the meantime, peel the pumpkin skin off the pumpkins and discard. Add the cinnamon, nutmeg, cloves, cayenne pepper and a few twists of freshly ground black pepper to the pot, followed by the pumpkin flesh. Use your stirring spoon to break up the pumpkin a bit. Pour in the broth. Bring the mixture to a boil, then reduce heat and simmer for about 15, to give the flavors time to meld.",
    "While the soup is cooking, toast the pepitas in a medium skillet over medium-low heat, stirring frequently, until fragrant, golden and making little popping noises. You want them to be nice and toasty, but not burnt. Transfer pepitas to a bowl to cool.",
    "Once the squash mixture is done cooking, stir in the coconut milk and maple syrup. Remove the soup from heat and let it cool slightly. Working in batches, transfer the contents pan to a blender (do not fill your blender past the maximum fill line!). Securely fasten the blender's lid and use a kitchen towel to protect your hand from steam escaping from the top of the blender as you purée the mixture until smooth. Transfer puréed soup to a serving bowl and repeat with remaining batches. Taste and adjust if necessary (I thought the soup was just right as is, but you might want to add more coconut milk, for extra creaminess/more mild flavor, or maple syrup, to make it a little sweeter.",
    "Ladle soup into individual bowls. Sprinkle pepitas over the soup and serve."
  ],
  "ingredients": [
    "0",
    "¼ cup olive oil, divided",
    "1 4-pound sugar pie pumpkin or kabocha squash",
    "1 large yellow onion, chopped",
    "4 large or 6 medium garlic cloves, pressed or minced",
    "½ teaspoon sea salt",
    "½ teaspoon ground cinnamon",
    "½ teaspoon ground nutmeg",
    "⅛ teaspoon cloves",
    "A tiny dash/up to ⅛ teaspoon cayenne pepper (optional, if you like spice)",
    "Freshly ground black pepper",
    "4 cups (32 ounces) vegetable broth",
    "½ cup full fat coconut milk or heavy cream, which is not vegan",
    "2 tablespoons maple syrup or honey, which is not vegan",
    "¼ cup pepitas (green pumpkin seeds)"
  ],
  "__v": 1
}