{
  "hash": "71b86e472e16cfed757de84f381e6dc93dd665be",
  "title": "Ravioli al’Amatriciana",
  "image": "http://munchies-images.vice.com/wp_upload/moltissimo-ravioli.jpg?crop=1xw:0.6xh;*,*&resize=1200:*",
  "href": "https://munchies.vice.com/en/recipes/ravioli-alamatriciana",
  "extension": "Chrome",
  "firstAdded": "2016-12-08T15:02:41.551000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the pasta dough: Mound the flour in the center of a large wooden cutting board. Make a well in the middle of the flour and add the eggs and olive oil. Using a fork, beat together the eggs and oil and begin to incorporate the flour, starting with the inner rim of the well. As you expand the well, keep pushing the flour up from the base of the mound to retain the well shape. Once the dough starts to come together, knead it gently with both hands for about 5 minutes. You made need to add water, 1 tablespoon at a time, to achieve an elastic and slightly sticky dough. Wrap the dough in plastic wrap and allow it to rest at room temperature for 30 minutes.",
    "Make the ravioli: Place the guanciale slices in a 12- to 14-inch sauté pan in a single layer and cook over medium-low heat until most of the fat has been rendered from the meat, turning occasionally and then add the garlic, onion and red pepper flakes and cook over medium-high heat for 5 minutes, or until the onions, garlic and guanciale are light golden brown. Add the tomato paste, cook until a deep rust red, reduce the heat, and simmer for 5 minutes. Remove from heat, place into a food processor with pecorino and pulse until smooth, then remove to a bowl and allow to cool.",
    "To make the ravioli, divide the pasta into 4 pieces. Roll out each one through the thinnest setting on a pasta machine and lay on a lightly floured work surface. Cut each sheet lengthwise in half to form strips. Place a row of 1 teaspoon tomato filling, 2 inches apart along the bottom of each strip. Fold the top half of the pasta over the bottom and press out any air pockets. Cut out the ravioli. Transfer to a baking sheet dusted with flour.",
    "Bring 6 quarts of water to a boil in a large pot, and add 2 tablespoons salt. Drop the ravioli carefully into the boiling water, lower the heat, and cook at a brisk simmer until tender, 2-3 minutes.",
    "Meanwhile, in a 10- to 12-inch skillet, melt the butter over medium heat. Add the scallions and sauté until tender, 30 seconds. Drain ravioli well and drop into pan with scallions and butter and toss over medium heat until coated, then remove from heat and grate the pecorino over, tossing well to mix. Pour into a heated platter and serve with more cheese to grate over each portion."
  ],
  "ingredients": [
    "0",
    "for the pasta dough:",
    "3 1/2 cups all-purpose flour",
    "4 extra-large eggs",
    "1/2 teaspoon extra-virgin olive oil",
    "¾ pound guanciale, or pancetta, thinly sliced",
    "for the ravioli:",
    "3 garlic cloves",
    "1 red onion, halved and chopped into ¼ -inch dice",
    "1 ½ teaspoons hot red pepper flakes",
    "kosher salt and freshly ground black pepper, to taste",
    "½ cup tomato paste doppio estratto",
    "¼ cup freshly grated Pecorino Romano, plus 1 piece for grating",
    "½ pound sweet butter",
    "1 bunch scallions, thinly sliced"
  ],
  "__v": 1
}