{
  "hash": "643b5871990d881af16276383314f7b7a3c16b3a",
  "title": "Pot-roast Bombay chicken",
  "image": "//www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe/recipe-image/2017/03/bombay-chicken.jpg?itok=kHxx5o7b",
  "href": "https://www.bbcgoodfood.com/recipes/pot-roast-bombay-chicken",
  "extension": "Chrome",
  "firstAdded": "2019-03-10T21:06:52.669000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat oven to 220C/200C fan/gas 6. Put the chicken on a chopping board and, using your hands, rub the skin generously with half the spice paste. Season well, tie the legs together and set aside.",
    "Heat the oil in a large flameproof casserole dish over a medium heat. Add the onion and a good pinch of salt and cook for 5 mins or until beginning to soften. Add the tomatoes, fenugreek seeds, ginger and remaining spice paste, and cook for 3 mins more. Stir through the coconut milk and bring to a simmer. Add the chicken and the potatoes to the dish, and cook in the oven for 20 mins, uncovered.",
    "Lower the heat to 180C/160C fan/ gas 4 and cook for 55 mins more. Check that the meat is cooked by cutting through one of its legs – the flesh shouldn’t be pink.",
    "Remove the chicken and place on a chopping board. Stir the spinach through the sauce and leave to rest for 5 mins. Put the chicken back in the dish, top with the coriander and carve at the table. Serve with poppadums and chutney, if you like."
  ],
  "ingredients": [
    "0",
    "1 small whole chicken Chicken chik-enChicken's many plus points - its versatility, as well as the ease and speed with which it…",
    "5 tbsp tikka masala paste",
    "1 tbsp sunflower oil Sunflower oilA variety of oils can be used for baking. Sunflower is the one we use most often at Good Food as…",
    "1 large red onion, halved and sliced",
    "2 large tomatoes, halved and chopped",
    "1 tbsp fenugreek seeds Fenugreek seed fenn-you-greek seedA popular seed in Indian cookery, in which it's termed methi, this small, hard, mustard…",
    "1 thumb-sized piece ginger Ginger jin-jerMainly grown in Jamaica, Africa, India, China and Australia, ginger is the root of the plant. It… , grated",
    "2 x 400g cans full-fat coconut milk Coconut milk ko-ko-nut mill-kCoconut milk is not the slightly opaque liquid that flows from a freshly opened coconut –…",
    "500g new potatoes New potatoes n-ew po-tate-oesNew potatoes have thin, wispy skins and a crisp, waxy texture. They are young potatoes and… , halved",
    "100g baby spinach",
    "25g pack coriander, torn, to serve",
    "poppadums and chutney, to serve (optional)"
  ],
  "__v": 1
}