{
  "hash": "5ad4383d7401bf90140dd5a9804cb2800587f514",
  "title": "Yankee Pot Roast",
  "image": "http://static.oprah.com/2016/11/PotRoast_030-949x534.jpg",
  "href": "http://www.oprah.com/food/Yankee-Pot-Roast-Recipe",
  "extension": "Chrome",
  "firstAdded": "2016-12-07T19:34:42.613000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350°.",
    "Generously season the roast with salt and pepper. In a large, heavy pot or Dutch oven, heat the oil over medium heat. Add the salt pork and cook until rendered, about 5 minutes. Remove the salt pork, but leave all the fat in the pot. Turn the heat to medium-high and brown each side of the roast, 8 to 10 minutes per side.",
    "Return the rendered salt pork pieces to the pot, along with the carrots, onions, wine, 2 cups of the stock, the rosemary and thyme. Bring to a boil, cover and roast in the oven for 2 hours. Check occasionally to make sure there is plenty of liquid in the pot. If it gets low, add more stock or water. After 2 hours, add the potatoes and bake, uncovered, for another 30 minutes.",
    "Transfer the meat and vegetables to a platter. Put the pot over medium-high heat and bring the liquid to a boil. In a small bowl, whisk the flour into the remaining 1/2 cup of room-temperature stock. Pull the pot off the heat, whisk in the slurry then return to the heat and continue whisking until the gravy thickens.",
    "Serve the meat and vegetables with the gravy on the side."
  ],
  "ingredients": [
    "0",
    "1 chuck roast, 2 to 3 pounds",
    "Kosher salt and freshly ground black pepper",
    "1 Tbsp. extra-virgin olive oil",
    "4 ounces salt pork, cut into 1/4-inch dice",
    "2 large carrots, peeled and cut into 2-inch chunks",
    "2 medium onions, quartered",
    "2 cups red wine",
    "2 1/2 cups beef stock or broth",
    "1 Tbsp. chopped fresh rosemary",
    "1 Tbsp. chopped fresh thyme",
    "1 pound small red-skin potatoes, halved",
    "2 Tbsp. all-purpose flour"
  ],
  "__v": 1
}