{
  "hash": "1503977482f92c3aaf25d7194117ac23821eea51",
  "title": "Airline Chicken Breast",
  "image": "https://images.media-allrecipes.com/userphotos/560x315/5673301.jpg",
  "href": "https://www.allrecipes.com/recipe/267578/airline-chicken-breast/?internalSource=streams&referringId=17515&referringContentType=Recipe%20Hub&clickId=st_recipes_mades",
  "extension": "Chrome",
  "firstAdded": "2019-03-14T06:01:30.319000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Slice off 1/2 of each chicken wing by cutting through the joint where the wing meets the drumette. Slice through the skin between the thighs and breasts. Make a shallow cut along the breast bone and 2 deep cuts on either side, separating the breasts.",
    "Slice each breast off the carcass using the tip of the knife, keeping the blade pressed against the bone. Cut through the cartilage to remove breast with the wing attached.",
    "Remove the tenders and trim as needed. Season with a drizzle of olive oil, salt, pepper, herbes de Provence, and cayenne pepper.",
    "Push your finger gently under the skin of each breast, right next to the wing bone, to separate it from the meat. Slide 1 tender under the skin, center it, and smooth over the skin. Sprinkle salt over breasts.",
    "Heat 1 tablespoon olive oil in a skillet over medium-high heat. Add chicken breasts, skin-side down. Cook until bottom is browned, 6 to 7 minutes. Flip, reduce heat to medium, and cook until no longer pink on the inside, 7 to 10 minutes more. Add 1 tablespoon butter, rosemary, and thyme. Baste chicken with the butter. Remove chicken from the skillet.",
    "Pour stock into the pan; increase heat to high. Boil until reduced to desired thickness, about 2 minutes. Turn off heat and whisk in remaining butter. Slice each chicken breast into thirds and spoon the pan sauce on top."
  ],
  "ingredients": [
    "0",
    "1 whole chicken",
    "1 drizzle olive oil",
    "kosher salt to taste",
    "ground black pepper to taste",
    "2 pinches herbes de Provence, or to taste",
    "1/4 teaspoon cayenne pepper, or to taste",
    "1",
    "1 tablespoon olive oil",
    "3 tablespoons butter, divided",
    "1 sprig fresh rosemary",
    "2 sprigs fresh thyme",
    "1/2 cup chicken stock, or to taste"
  ],
  "__v": 1
}