{
  "__v": 1,
  "directions": [
    "0",
    "In a small bowl, combine porcinis and water. Let stand until soft, about 30 minutes. Strain, reserving 1/4 cup of the soaking liquid. Coarsely chop mushrooms; set aside.",
    "In a large skillet, heat oil over medium-high heat. Add shallots, and cook until translucent, about 2 minutes. Stir in parsley, and cook 1 minute more. Add fresh and dried mushrooms and cook, stirring frequently, until mushrooms first release their liquid and then liquid evaporates, about 10 minutes. Add the 1/4 cup reserved soaking liquid. Cook, stirring, until liquid evaporates, about 5 minutes more. Transfer to a bowl, and cool briefly before stirring in Parmesan and ricotta. Season with salt and pepper.",
    "Spread semolina on a baking sheet; set aside. Cut fresh pasta dough into 8 pieces. Work with one piece at a time, keeping remaining pieces covered with a glass bowl. Using a pasta machine, roll through the widest opening, brushing very lightly with flour. Fold dough in half crosswise; pass through machine again. Roll dough through remaining settings until it is about 1/16 inch thick (on the Kitchen Aid attachment, this is through setting number 6; this may vary depending on the type of machine used), using as little additional flour as possible.",
    "Place sheet on a lightly floured surface with the long side parallel to the edge of work surface. Place 8 heaping measuring teaspoons of mushroom filling along the top third of the sheet about 2 inches apart. Moisten pasta around each mound of filling, using a pastry brush dipped in water. Fold the dough up and over the filling to enclose; press around filling to seal. Cut between mounds with a plain pastry wheel. Use a 2 1/2-inch fluted round cutter to cut out ravioli, centering filling. Alternately, use a fluted pastry wheel to cut into rectangular ravioli. Transfer to prepared baking sheet. Cover with a clean kitchen towel. Repeat with remaining dough and filling. Chill until ready to cook. The ravioli can be prepared ahead of time up to this point and frozen. Place baking sheet in freezer until ravioli are frozen. Transfer ravioli to a freezer bag, and keep frozen for up to 2 months.",
    "Bring a large pot of salted water to a boil. Add about 6 ravioli per serving, and cook until tender but al dente, about 2 minutes (slightly longer if frozen). In a skillet, melt 1 tablespoon of butter and 1 teaspoon of oil with 1 sprig of thyme for each serving. When ravioli are done, use a slotted spoon to remove from boiling water. Drain well, and transfer to skillet. Toss in butter, and divide among warm bowls. Top with shaved Parmesan and freshly ground pepper."
  ],
  "firstAdded": "2014-05-09T18:01:53.662000",
  "hash": "080bf4aa762bcf88e252227ac00c1383e2f1c8e2",
  "href": "http://www.marthastewart.com/317919/mushroom-ravioli",
  "image": "http://www.marthastewart.com/sites/files/marthastewart.com/imagecache/wmax-520/images/content/tv/ms_living_tv/2007Q1/tvs6775_xl.jpg",
  "ingredients": [
    "0",
    "1 ounce dried porcini mushrooms",
    "1 cup hot water",
    "1/4 cup olive oil, plus more for serving",
    "2 medium shallots, finely chopped (1/4 cup)",
    "1/4 cup coarsely chopped fresh flat-leaf parsley",
    "2 pounds assorted fresh mushrooms, such as button, cremini, and shiitake, brushed clean, trimmed, and coarsely chopped",
    "1/2 cup freshly grated Parmesan cheese, plus more for serving",
    "1/2 cup ricotta cheese",
    "1 teaspoon coarse salt",
    "1/2 teaspoon freshly ground pepper, plus more for serving",
    "1 cup coarse semolina or cornmeal, for sprinkling",
    "Fresh Pasta",
    "All-purpose flour, for dusting",
    "Unsalted butter, for serving",
    "Sprigs of fresh thyme, for serving"
  ],
  "keywords": [
    "porcini",
    "mushrooms",
    "hot",
    "water",
    "olive",
    "oil",
    "medium",
    "shallots",
    "coarsely",
    "flatleaf",
    "parsley",
    "button",
    "cremini",
    "shiitake",
    "brushed",
    "clean",
    "trimmed",
    "parmesan",
    "cheese",
    "ricotta",
    "coarse",
    "salt",
    "pepper",
    "semolina",
    "cornmeal",
    "sprinkling",
    "pasta",
    "allpurpose",
    "flour",
    "dusting",
    "unsalted",
    "butter",
    "sprigs",
    "thyme"
  ],
  "title": "Mushroom Ravioli",
  "users": [
    null
  ]
}