{
  "hash": "ba2caea9209f3ff2f48ce03cbb43c96cc9709ed7",
  "title": "TORTA DI PANE AL CACAO",
  "image": "https://www.soniaperonaci.it/wp-content/uploads/2016/06/torta-pane-cacao.jpg",
  "href": "https://www.soniaperonaci.it/torta-pane-al-cacao-2/",
  "extension": "Chrome",
  "firstAdded": "2020-02-18T21:18:09.567000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "PREPARAZIONE 30 minuti - COTTURA 50 minuti",
    "Scalda il latte in un pentolino. Taglia a cubetti il pane dopo avergli tolto la crosta e mettilo in una ciotola. Versa il latte sul pane e lascialo ammollare per bene.",
    "Intanto, nella tazza di una planetaria, monta le uova con lo zucchero per 10-15 minuti, per ottenere un composto chiaro e spumoso. Incorpora a mano il cacao e l’amido di riso setacciati assieme. Mescola bene.",
    "Versa il composto nella ciotola contenente il pane e mescola delicatamente.",
    "Aggiungi ora le nocciole e infine i fiocchi di mais (In alternativa li puoi tritare).",
    "Riduci a cubetti le arance candite e aggiungile al composto. Amalgama tutto per bene e versa il composto in una tortiera da 24 cm imburrata e rivestita di carta forno.",
    "Inforna la torta in forno statico preriscaldato a 180° per 50 minuti. Una volta pronta, lasciala raffreddare e sformala su una gratella.",
    "Nel frattempo, prepara la ganache al cioccolato. Trita il cioccolato.",
    "Scalda la panna in un pentolino e aggiungi poi cioccolato e burro. Mescola fino a far sciogliere tutto.",
    "A questo punto, puoi versare la ganache sulla torta per rivestirla: metti sotto la gratella un piatto in modo da raccogliere la ganache che cadrà, per riutilizzarla e fare una seconda passata sulla torta.",
    "Lascia rapprendere la ganache un po’ prima di servire la torta e decora ogni fetta con delle scorzette di arancia candita."
  ],
  "ingredients": [
    "0",
    "stampo da 24 cm",
    "latte fresco 700 g",
    "pane di Altamura 300 g",
    "uova medie 3",
    "fiocchi di mais 120 g",
    "cacao amaro in polvere 50 g",
    "zucchero semolato 140 g",
    "arance candite 50 g",
    "nocciole 50 g",
    "amido di riso 30 g",
    "PER LA GANACHE AL CIOCCOLATO",
    "cioccolato fondente 300 g",
    "panna fresca liquida 250 g",
    "burro 10 g",
    "PER DECORARE",
    "arance candite 20 g"
  ],
  "__v": 5
}