{
  "hash": "cb408067b27a35cf927ead1163c4d6b23b5dd9b8",
  "title": "Breast of chicken and spinach with tarragon mushroom sauce Makes 4 servings This recipe is ideal for a dinner party because most of the preparation can be done in advance. Serve with brown rice or pasta.",
  "image": "http://www.heartandstroke.com/atf/cf/{99452D8B-E7F1-4BD6-A57D-B136CE6C95BF}/chicken-and-mushroom.jpg",
  "href": "http://www.heartandstroke.com/site/c.ikIQLcMWJtE/b.6440951/k.8570/Recipes__Breast_of_chicken_and_spinach_with_tarragon_mushroom_sauce.htm",
  "extension": "",
  "firstAdded": "2016-09-08T19:04:34.444000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Tarragon and mushroom sauce",
    "In saucepan, heat oil over medium heat.",
    "Add mushrooms and onion; cook, stirring occasionally, until tender and most of the liquid is evaporated.",
    "Sprinkle with flour and tarragon; cook, stirring, for 2 minutes.",
    "Bring broth to boil; gradually pour into mushroom mixture, whisking constantly. Cook, whisking constantly, until boiling and thickened slightly.",
    "Simmer, uncovered, for 10 minutes or until reduced to about 375 mL (1 1⁄2 cups)",
    "Chicken",
    "On plate, combine flour, thyme, salt, and pepper to taste.",
    "In shallow bowl, combine egg and water.",
    "On another plate, combine bread crumbs and cheese. Coat chicken pieces with seasoned flour; shake off excess.",
    "Dip into egg mixture, then roll in crumb mixture. Set aside.",
    "Trim stems from spinach. Wash and shake off water; place in saucepan with just the water clinging to leaves.",
    "Cover and cook over medium-high heat until wilted. Drain thoroughly; squeeze out excess liquid and chop coarsely.",
    "Toss spinach with lemon juice, oil, and salt and pepper.",
    "On lightly greased baking sheet or in microwaveable dish, bake chicken in 200°C (400°F) oven for 15 minutes, or microwave, loosely covered with waxed paper, on High for 5 to 6 minutes, or until chicken is no longer pink inside.",
    "If microwaving, let stand for 1 to 2 minutes (cooking time will vary, depending on thickness of chicken).",
    "Place chicken on top of spinach. Garnish with a few spoonfuls of tarragon and mushroom sauce.",
    "Make ahead: Cook spinach a few hours in advance; reheat in microwave or on stove, then add lemon juice, oil, and salt and pepper. Refrigerate prepared unbaked chicken for 20 minutes or for up to 2 hours. Tarragon mushroom sauce can be covered and refrigerated for up to 2 days."
  ],
  "ingredients": [
    "0",
    "500 g (1 lb) fresh spinach",
    "5 mL (1 tsp) fresh lemon juice",
    "5 mL (1 tsp) canola or olive oil",
    "1 mL (1⁄4 tsp) or less salt and freshly ground pepper"
  ],
  "__v": 1
}