{
  "hash": "4a5edde352ac8980748cab166f69998282fa8b9d",
  "title": "Magic Mineral Broth Recipe",
  "image": "https://www.motherearthliving.com/-/media/Images/MEL/Editorial/Articles/Online-Articles/2017/12-01/Clean-Soups/magic-mineral-broth-jpg.jpg",
  "href": "https://www.motherearthliving.com/food-and-recipes/recipes/magic-mineral-broth-zerz1712zhee?newsletter=1&spot=headline&_wcsid=8BB331DD0D7F31EF10E80CCD346C2D09CCC6BFE4256BF74F",
  "extension": "Chrome",
  "firstAdded": "2018-01-29T02:44:53.215000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Rinse all of the vegetables well, including the kombu.",
    "In a 12-quart or larger stockpot, combine the carrots, onions, leek, celery, red potatoes, sweet potatoes, yam, garlic, parsley, kombu, peppercorns, allspice berries, and bay leaves. Add the water, cover, and bring to a boil over high heat. Decrease the heat to low and simmer, partially covered, for at least 2 hours, or until the full richness of the vegetables can be tasted. As the broth simmers, some of the water will evaporate; add more if the vegetables begin to peek out.",
    "Strain the broth through a large, coarse-mesh sieve (use a heat-resistant container under­neath), and discard the solids. Stir in the salt, adding more if desired. Let cool to room tem­perature before refrigerating or freezing. Store in the refrigerator for up to 5 days or in the freezer for up to 6 months."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "6 unpeeled carrots, cut into thirds",
    "2 unpeeled yellow onions, quartered",
    "1 leek, white and green parts, cut into thirds",
    "1 bunch celery, including the heart, cut into thirds",
    "4 unpeeled red potatoes, quartered",
    "2 unpeeled Japanese or regular sweet potatoes, quartered",
    "1 unpeeled garnet yam (sweet potato), quartered",
    "5 unpeeled cloves garlic, halved",
    "1/2 bunch fresh flat-leaf parsley",
    "1 (8-inch) strip kombu",
    "12 black peppercorns",
    "4 whole allspice or juniper berries",
    "2 bay leaves",
    "8 quarts cold, filtered water, plus more if needed",
    "1 teaspoon sea salt, plus more if needed"
  ],
  "__v": 1
}