{
  "hash": "82ebe9160e4c11dca74206693589eec79590689a",
  "title": "Chilled red pepper soup with soured cream",
  "image": "",
  "href": "http://www.ottolenghi.co.uk/recipes/soups/chilled-red-pepper-soup-shop",
  "extension": "Chrome",
  "firstAdded": "2016-01-02T00:15:54.612000",
  "users": [
    null
  ],
  "keywords": [
    "onion",
    "olive",
    "oil",
    "extra",
    "finish",
    "sage",
    "leaves",
    "red",
    "peppers",
    "bay",
    "cumin",
    "caster",
    "sugar",
    "chilli",
    "chicken",
    "stock",
    "celery",
    "dice",
    "zest",
    "lemon",
    "garlic",
    "clove",
    "basil",
    "roughly",
    "flatleaf",
    "parsley",
    "soured",
    "cream",
    "salt"
  ],
  "directions": [
    "0",
    "Peel the onion and chop it roughly. Heat up the oil in a large saucepan. Add the onion and sage and sauté on medium heat for 5 minutes or until the onion is translucent.",
    "While the onion is cooking, halve the peppers lengthways. Take a half of one pepper, remove the seeds and white flesh and cut it into 1.5cm dice. Keep it for later.",
    "Remove the seeds from the rest of the peppers, roughly chop them and stir into the saucepan with the onions. Add ¾ a teaspoon of salt, bay leaves, ground cumin, sugar and chilli.",
    "Sauté for another 5 minutes. Add the stock and bring to a light simmer. Cover the pot and cook on a very low heat for 15 minutes.",
    "Once the peppers are soft, remove the bay leaves from the soup. While still hot, use a liquidiser or a hand stick blender to pulverise the soup until it is totally smooth. This may take a few minutes. Leave to cool down a little.",
    "Once the soup is just warm, stir in the celery, diced red pepper, lemon zest and garlic. Leave until it comes to room temperature and then refrigerate for a few hours or overnight.",
    "Remove the soup from the fridge half an hour before serving. Stir well, taste and adjust the seasoning. Divide into serving bowls, sprinkle over a generous amount of chopped basil and parsley, add a spoonful of sour cream per portion and finish with a drizzle of olive oil."
  ],
  "ingredients": [
    "0",
    "1 large onion",
    "3 tbsp olive oil, plus extra",
    "to finish",
    "8 sage leaves, finely chopped",
    "4 large red peppers",
    "2 bay leaves",
    "2 tsp ground cumin",
    "1 tsp caster sugar",
    "pinch of dried chilli flakes",
    "500ml chicken or vegetable stock",
    "1 celery stick, cut into 1.5cm dice",
    "grated zest of ½ lemon",
    "1 garlic clove, crushed",
    "25g basil leaves, roughly chopped",
    "10g flat-leaf parsley, roughly chopped",
    "100g soured cream",
    "salt"
  ],
  "__v": 1
}