{
  "hash": "92c73bd2e4fadc57f44bb0cc0e795a64c110c602",
  "title": "No-Fail Soufflés",
  "image": "http://andrewzimmern.com/wp-content/uploads/2014/12/Spinach-Souffle.jpg",
  "href": "http://andrewzimmern.com/2014/12/22/easy-spinach-souffles/",
  "extension": "Chrome",
  "firstAdded": "2015-07-20T17:40:56.121000",
  "users": [
    null
  ],
  "keywords": [
    "ingredient",
    "list",
    "print",
    "recipe",
    "unsalted",
    "softened",
    "butter",
    "greasing",
    "plain",
    "dry",
    "bread",
    "crumbs",
    "coating",
    "shallot",
    "dill",
    "oregano",
    "allpurpose",
    "flour",
    "milk",
    "nutmeg",
    "kosher",
    "salt",
    "pepper",
    "egg",
    "yolks",
    "frozen",
    "spinachthawed",
    "squeezed",
    "parmigianoreggiano",
    "cheese",
    "gruyre",
    "whites",
    "cream",
    "tartar"
  ],
  "directions": [
    "0",
    "Preheat the oven to 400°. Butter six 10-ounce ramekins and coat with bread crumbs, shaking out the excess. Arrange the ramekins on a large rimmed baking sheet.",
    "In a medium saucepan, melt the 6 tablespoons of butter. Add the shallot and cook over moderate heat, stirring, until softened, about 2 minutes. Add the dill and oregano and cook, stirring, until fragrant, about 1 minute. Add the flour and cook, whisking constantly, until bubbling and lightly golden, 2 to 3 minutes. Gradually whisk in the milk until smooth and bring to a boil. Simmer over moderately low heat, stirring, until the mixture has thickened and no floury taste remains, 7 to 10 minutes. Stir in the nutmeg and season the béchamel with salt and pepper.",
    "In a large bowl, beat the egg yolks with 1/2 cup of the béchamel, then beat in the remaining béchamel. Fold in the spinach, 1 teaspoon of salt, 1/4 teaspoon of pepper and both cheeses. Let cool slightly.",
    "Meanwhile, in a large stainless steel bowl, using an electric mixer, beat the egg whites with the cream of tartar at high speed until medium-firm peaks form; do not overbeat. Fold one-third of the whites into the soufflé base to lighten it, then gently fold in the remaining whites until no streaks remain.",
    "Carefully spoon the soufflé base into the prepared ramekins. Bake the spinach soufflés for about 30 minutes, until puffed, just set and golden on top. Serve immediately."
  ],
  "ingredients": [
    "0",
    "Ingredient List Print Recipe",
    "6 tablespoons unsalted butter, plus softened butter for greasing",
    "Plain dry bread crumbs, for coating",
    "1/4 cup minced shallot",
    "3 tablespoons finely chopped dill",
    "2 teaspoons dried oregano",
    "6 tablespoons all-purpose flour",
    "2 1/2 cups whole milk",
    "Pinch of freshly grated nutmeg",
    "Kosher salt",
    "Freshly ground pepper",
    "6 large egg yolks",
    "20 ounces frozen spinach—thawed, squeezed dry and finely chopped",
    "1/2 cup finely grated Parmigiano-Reggiano cheese",
    "1/2 cup shredded Gruyère cheese",
    "8 large egg whites",
    "1/2 teaspoon cream of tartar"
  ],
  "__v": 1
}