{
  "hash": "3e1c6680b44518c894c107cff0c6c6ad13c3f338",
  "title": "Swiss Chard & Ricotta Pie (LC & GF)",
  "image": "http://4.bp.blogspot.com/-LjT_OuQudFA/UM9N-kcPS1I/AAAAAAAADA8/rujT45rJl2o/s400/swisschardpiefg.jpg",
  "href": "http://www.ibreatheimhungry.com/2012/12/swiss-chard-ricotta-pie-w-sausage-crust.html",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T22:12:12.142000",
  "users": [
    null
  ],
  "keywords": [
    "tbl",
    "olive",
    "oil",
    "onion",
    "clove",
    "garlic",
    "swiss",
    "chard",
    "milk",
    "ricotta",
    "cheese",
    "eggs",
    "mozzarella",
    "parmesan",
    "nutmeg",
    "salt",
    "pepper",
    "mild",
    "sausage"
  ],
  "directions": [
    "0",
    "Heat the olive oil in a large saute pan and add the onions and garlic. Cook for several minutes or until soft. Add the swiss chard (or other greens of your choice) and cook for about 5 minutes until the leaves are wilted and the stems have softened. Add the nutmeg and season with salt and pepper. Remove from heat and set aside to cool. Meanwhile, beat the eggs in a large bowl. Add the ricotta, parmesan and mozzarella cheeses. Stir in the sauteed greens. If making the large pie, you will have to roll out your sausage or press it into the pie tin uniformly. Then pour in the filling, place on a cookie sheet (to catch any dripping oil from the sausage) and bake at 350 degrees (F) for about 30 - 35 minutes or until firm.",
    "If making the muffins, use your fingers to press the sausage into place, lining the cups about 1/4 inch thick. Then spoon in your filling - don't overfill because they will puff up slightly when baking. Make sure you bake these on a cookie sheet, as the grease from the cooking sausage will overflow the cups and you will have a mess on your hands if you don't put something underneath it to catch it! Also, by all means add more cheese on top if you so desire."
  ],
  "ingredients": [
    "0",
    "1 Tbl olive oil",
    "1/2 cup onion, chopped",
    "1 clove garlic, minced",
    "8 cups swiss chard, chopped",
    "2 cups whole milk ricotta cheese",
    "3 eggs",
    "1 cup shredded mozzarella",
    "1/4 cup shredded parmesan",
    "1/8 tsp ground nutmeg",
    "salt and pepper to taste",
    "1 lb mild sausage"
  ],
  "__v": 1
}