{
  "hash": "ecacb4fe962e39a0ba5d3becf4e60a715cffaf0a",
  "title": "Blackberry and Pecan Tamales (Tamales De Z)",
  "image": "https://patijinich.com/wp-content/uploads/2016/03/151120_PatiJinich_BlackBerryPecanTamales_875-912x622.jpg",
  "href": "https://patijinich.com/recipe/blackberry-and-pecan-tamales/",
  "extension": "Chrome",
  "firstAdded": "2017-10-29T10:56:37.971000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To make masa for tamales:",
    "Place the vegetable shortening or lard with 1 tablespoon of cold water in a mixer and beat, until very light and spongy, about 1 minute. Add the baking powder and salt, and then take turns adding the instant corn masa mix and the water. Continue beating until the dough is homogeneous and fluffy.",
    "Mix in the sugar and cinnamon and continue beating until everything is well mixed. You may also do it by hand.",
    "You know the tamale masa is ready if:",
    "When you lift a big spoon with masa, drop it into the dough it falls “de golpe” or heavy.",
    "It has the consistency of a medium thick cake batter.",
    "If you place 1/2 teaspoon of masa in a cup of cold water and it floats.",
    "To prepare the steamer:",
    "Place water in the pan of a steamer and bring it to a simmer. Line the steamer with one or two layers of corn husks. Use the dough to form about 20 corn husk wrapped tamales.",
    "To make tamales:",
    "Soak the dried corn husks in hot water for a couple of minutes, until they are pliable and drain. Lay out a corn husk with the tapered ends facing towards you. Spread 3 to 4 tablespoons of the masa into a 2 to 3 inch square, the layer should be about 1/4 inch, leaving a boarder of at least 1/2 inch on the sides. Place 1 to 2 blackberries in the middle of the masa filling and sprinkle about a teaspoon of the pecans on top.",
    "Pick up the two long sides of the corn husk and bring them together, causing the masa to surround the berries and pecans and fold them to one side, rolling them in the same direction around the tamal. Fold up the empty section of the husk with the tapering end, from the bottom up. This will form a closed bottom and the top will be left open.",
    "Prepare the tamales and then place them vertically in a container. When you have them all ready, place them as vertically as you can in the prepared steamer, with the open end on top. If there is space left in the steamer, tuck in more corn husks so the tamales will not dance around. Cover with more corn husks and steam, covered for 50 minutes to an hour over medium heat. You know the tamales are ready when the tamales come easily free from the husks.",
    "Finished tamales will stay warm for about 1 to 2 hours in the steamer. They can be made ahead several days before and stored in the refrigerator, well wrapped. They can also be frozen for months. In either case, reheat in the steamer. For refrigerated tamales it will take about 15 minutes, and for frozen tamales about 45 minutes."
  ],
  "ingredients": [
    "0",
    "25 dried corn husks",
    "1 cup vegetable shortening or good quality lard",
    "Pinch of salt",
    "1 tbsp cold water",
    "1 tsp baking powder",
    "1 lb instant corn masa mix for tamales or about 3 1/4 cups, such as Maseca",
    "3 cups warm water",
    "1 1/2 cup sugar",
    "1/2 tsp cinnamon",
    "1/2 cup pecans roughly chopped",
    "12 oz black berries rinsed"
  ],
  "__v": 3
}