{
  "hash": "6b6d794014ffee2cf1f14ff6d45cd4a92e7beaad",
  "title": "Chorizo and Cornbread Stuffing",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2012/11/19/1/FN_Thanksgiving-Live-Aaron-Chorizo-Cornbread-Stuffing_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/aaron-sanchez/chorizo-and-cornbread-stuffing-recipe2.html",
  "extension": "Chrome",
  "firstAdded": "2016-10-20T08:45:02.231000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350 degrees F.",
    "Heat a large skillet over medium heat and cook the chorizo, breaking it up with a spoon and stirring occasionally as it cooks, until it begins to brown, about 5 minutes. Add the garlic, carrots, celery and onions to the chorizo and cook, stirring occasionally, until the vegetables have browned, about 10 minutes. Add the crumbled cornbread and cilantro. Gradually stir in enough of the stock so the stuffing is not too dry but at the same time not too wet. Stir gently and well.",
    "Butter a small casserole dish. Spread the stuffing in an even layer. Bake until it's heated through and lightly browned on top, about 20 minutes. Serve right away, garnished with cilantro and cotija if desired.",
    "Bring 1 cup water to a boil in a small saucepan. Put the chile powder in a small bowl, pour in the boiling water and stir well to make a paste. Let it cool to room temperature.",
    "Put the ground beef and pork in a large bowl. Add the vinegar, salt and garlic and mix well (your hands are the best tools for this job). Sprinkle with the oregano, canela, black pepper, star anise and cloves and mix well. Add the wine and sugar and mix well. Work the ancho chilie paste into the meat with your fingers until it's well incorporated. Cover and refrigerate overnight before you use it.",
    "Store in 2-ounce portions in ziptop bags in the refrigerator for up to a week, or freeze for up to 3 months. Yield: 2 pounds.",
    "Recipe courtesy of Aaron Sanchez"
  ],
  "ingredients": [
    "0",
    "1 pound Aaron's Chorizo, recipe follows",
    "3 cloves garlic, finely chopped",
    "1 medium carrot, finely chopped",
    "1 celery stalk, finely chopped",
    "1 medium white onion, finely chopped",
    "2 cups coarsely crumbled cornbread",
    "1/4 cup chopped fresh cilantro, plus more for garnish, optional",
    "1/4 cup low-sodium chicken stock, plus more if needed",
    "1 tablespoon unsalted butter",
    "Grated cotija cheese, for garnish, optional",
    "1/2 cup ancho chile powder",
    "1 pound ground beef chuck",
    "1 pound ground pork",
    "1/4 cup white wine vinegar",
    "1 tablespoon salt",
    "3 cloves garlic, very finely chopped",
    "2 tablespoons crushed dried oregano (preferably Mexican)",
    "1 teaspoon ground canela (Mexican cinnamon), or 1/2 teaspoon ground cinnamon",
    "1 teaspoon freshly ground black pepper",
    "1 teaspoon ground star anise",
    "1/2 teaspoon ground cloves",
    "1/4 cup dry white wine",
    "1 teaspoon sugar"
  ],
  "__v": 1
}