{
  "hash": "017cdd021cec23a4fa2a675b71b6d951b5af2976",
  "title": "Stuffing-Topped Chicken",
  "image": "http://images.media-allrecipes.com/userphotos/960x960/3756937.jpg",
  "href": "http://www.eatingwell.com/recipe/252937/stuffing-topped-chicken/",
  "extension": "Chrome",
  "firstAdded": "2017-08-06T23:44:07.439000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Position rack in upper third of oven; preheat broiler.",
    "Heat 1 tablespoon oil in a large ovenproof skillet over medium heat. Add celery and shallot; cook, stirring, until the shallot begins to brown, about 2 minutes. Add bread and poultry seasoning; cook, stirring, until the celery has softened and the bread begins to crisp, 2 to 3 minutes. Transfer the stuffing to a medium bowl and toss with ¼ cup broth; set aside. Wipe out the pan.",
    "Toss chicken with 2 tablespoons flour, pepper and salt in a large bowl. Whisk the remaining 1¼ cups broth with the remaining 2 tablespoons flour in a small bowl and set aside.",
    "Add the remaining 1 tablespoon oil to the pan and heat over medium heat. Add the chicken (shaking off any excess flour) and mushrooms; cook, stirring, until the chicken is cooked through, about 8 minutes.",
    "Increase heat to medium-high; add wine (or sherry) and cook, scraping up any browned bits with a wooden spoon, until almost evaporated, about 2 minutes. Stir in the reserved broth-flour mixture and cook, stirring, until thickened, about 2 minutes more. Spoon the reserved stuffing over the chicken mixture. Transfer the pan to the oven and broil until the stuffing begins to crisp, about 4 minutes."
  ],
  "ingredients": [
    "0",
    "2 tablespoons extra-virgin olive oil, divided",
    "¾ cup chopped celery",
    "1 tablespoon chopped shallot",
    "5 slices whole-wheat country bread, cut into ¼-inch cubes",
    "½ teaspoon salt-free poultry seasoning",
    "1½ cups reduced-sodium chicken broth, divided",
    "1½ pounds boneless, skinless chicken thighs, trimmed and cut into 1-inch pieces",
    "4 tablespoons all-purpose flour, divided",
    "½ teaspoon freshly ground pepper",
    "¼ teaspoon salt",
    "2½ cups quartered mushrooms, (6 ounces)",
    "⅓ cup dry white wine, or dry sherry"
  ],
  "__v": 2
}