{
  "hash": "d955171fc23d9f1039b4bb131cea50041da512c5",
  "title": "Roast chicken with lemon & rosemary roast potatoes",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/448_1_1350905673_lrg.jpg",
  "href": "http://www.jamieoliver.com/recipes/chicken-recipes/roast-chicken-with-lemon-and-rosemary-roast-potatoes/",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T21:46:50.492000",
  "users": [
    null
  ],
  "keywords": [
    "higherwelfare",
    "chicken",
    "salt",
    "black",
    "pepper",
    "potatoes",
    "lemon",
    "preferably",
    "unwaxed",
    "bulb",
    "garlic",
    "broken",
    "thyme",
    "olive",
    "oil",
    "rosemary",
    "sprigs",
    "leaves",
    "picked",
    "rashers",
    "smoked",
    "streaky",
    "bacon"
  ],
  "directions": [
    "0",
    "Rub the chicken inside and out with a generous amount of salt and freshly ground black pepper. Do this in the morning if possible, then cover the chicken and leave in the fridge until you're ready to start cooking it for lunch or dinner. By doing this, you'll make the meat really tasty when cooked. Preheat your oven to 190ºC/375ºF/gas 5. Bring a large pan of salted water to the boil. Cut the potatoes into golf-ball-sized pieces, put them into the water with the whole lemon and the garlic cloves, and cook for 12 minutes. Drain and allow to steam dry for 1 minute (this will give you crispier potatoes), then remove the lemon and garlic. Toss the potatoes in the pan while still hot so their outsides get chuffed up and fluffy – this will make them lovely and crispy when they roast.",
    "While the lemon is still hot, carefully stab it about 10 times. Take the chicken out of the fridge, pat it with kitchen paper and rub it all over with olive oil. Push the garlic cloves, the whole lemon and the thyme into the cavity, then put the chicken into a roasting tray and cook in the preheated oven for around 45 minutes. Remove the chicken to a plate. Some lovely fat should have cooked out of it into the roasting tray, so toss the potatoes into this with the rosemary leaves. Shake the tray around, then make a gap in the centre of the potatoes and put the chicken back in. If using the bacon, lay the rashers over the chicken breast and cook for a further 45 minutes, or until the chicken is cooked and the potatoes are nice and golden. (You can tell the chicken is cooked when the thigh meat pulls easily away from the bone and the juices run clear.)",
    "I like to remove the bacon from the chicken and crumble it up over the potatoes. Then I remove the lemon and garlic from inside the chicken, squeeze all the garlic flesh out of the skin, mush it up and smear it all over the chicken, discard the lemon and rosemary and carve the chicken at the table. Heaven!"
  ],
  "ingredients": [
    "0",
    "2 kg higher-welfare chicken",
    "sea salt",
    "freshly ground black pepper",
    "1.5 kg potatoes, peeled",
    "1 large lemon, preferably unwaxed",
    "1 whole bulb garlic, broken into cloves",
    "1 handful fresh thyme",
    "olive oil",
    "1 handful fresh rosemary sprigs, leaves picked",
    "8 rashers higher-welfare smoked streaky bacon, optional"
  ],
  "__v": 1
}