{
  "hash": "9330db91173e8820c1c6314d6e7917fdaebca751",
  "title": "Rocky Mountain Benedict",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/rachael-ray/rocky-mountain-benedict-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-10-06T06:14:40.566000",
  "users": [
    null
  ],
  "keywords": [
    "english",
    "muffins",
    "eggs",
    "smoked",
    "idaho",
    "trout",
    "salmon",
    "hollandaise",
    "recipe",
    "follows",
    "parsley",
    "leaves",
    "dill",
    "paprika",
    "butter",
    "dry",
    "white",
    "wine",
    "lemon",
    "juice",
    "hot",
    "egg",
    "yolks"
  ],
  "directions": [
    "0",
    "Split the English muffins in half and then toast or grill them; set them aside. Fill a large shallow pan with 2 to 3 inches of water and bring to a boil. Reduce the heat to a simmer and gently break the eggs into the boiling water. Cook the eggs until the yolks are set to the desired doneness, about 3 minutes. Remove the eggs from the heat. Heat the smoked trout in a nonstick skillet over medium-high heat for 30 seconds or until heated through. Arrange the toasted English muffins on plates and top with the trout. Using a slotted spoon, place 1 poached egg on top of each English muffin. Spoon warm Hollandaise Sauce over the eggs and sprinkle with parsley and a dash of paprika to garnish. Serve immediately.",
    "Melt the butter over medium heat in a heavy saucepan. While butter is melting, whisk together white wine, lemon juice, and hot sauce in a large metal bowl. Whisk in the egg yolks. Place the bowl over a skillet of simmering water and continue whisking over medium heat until a custard consistency develops. Slowly whisk in the melted butter. Continue whisking until the sauce is rich and smooth.",
    "Professional Recipe: This recipe was provided by a chef, restaurant or culinary professional and makes a large quantity. The Food Network Kitchens chefs have not tested this recipe in the proportions indicated and therefore cannot make any representation as to the results.",
    "Recipe courtesy of The Kneadery"
  ],
  "ingredients": [
    "0",
    "4 English muffins",
    "8 eggs",
    "16 ounces smoked Idaho trout or salmon",
    "Hollandaise Sauce, recipe follows",
    "2 tablespoons chopped fresh parsley leaves or dill, for garnish",
    "Paprika, for garnish",
    "1 pound butter",
    "1 cup dry white wine",
    "1 tablespoon lemon juice",
    "1 tablespoon hot sauce",
    "6 egg yolks"
  ],
  "__v": 1
}