{
  "hash": "3d35970d986dc87856e4df979473b754db84476a",
  "title": "Cheesy Fried Polenta Fries",
  "image": "http://www.recipe30.com/wp-content/uploads/2016/09/polenta-chips2-848x477.jpg",
  "href": "http://www.recipe30.com/polenta-chips.html/",
  "extension": "Chrome",
  "firstAdded": "2017-04-07T20:36:34.994000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a heavy bottomed pot, add the chicken stock and bring to the boil.",
    "Season to taste with salt and pepper.",
    "Using a whisk, slowly add the polenta and whisk vigorously as you rain it in.",
    "Once polenta is thick, turn down the heat on your smallest jet and leave for 30 minutes, mixing with a wooden spoon every 5 minutes. If using 5 minute polenta, keep stirring for 5 minutes only. (Check directions on packet for more accurate times)",
    "Grate the Parmesan cheese. Keep aside.",
    "Cut up the butter in pieces and add to hot polenta, mix until melted. Turn off heat.",
    "Add the grated Parmesan cheese and mix well.",
    "Lightly oil the baking dish, spread oil to coat evenly and drizzle enough polenta to line the dish. Tip out any excess.",
    "Add all the polenta to the baking dish in a few scoops.",
    "Cover with cling film and using your hands, flatten the polenta evenly ensuring it’s firmly packed from corner to corner and level.",
    "Refrigerate for 60 minutes.",
    "Remove cling film an flip over onto chopping board to unmould.",
    "Trim off edges with a knife.",
    "Slice into your preferred chip sizes but not too thin. Thicker rectangles are easier.",
    "Place the oil in a deep frying pan or a pot (or use deep fryer) and heat to 370°F-190°C.",
    "Fry until brown and crisp. (note: keep them separated and moving using a heatproof utensil as they tend to stick together.",
    "Once cooked, drain on paper towel.",
    "Place on serving dish and grate some Parmesan cheese over the top. Place dipping sauce (aoli) and serve hot."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 cup polenta (note: you can buy 5 minute polenta to speed up recipe)",
    "5 cups chicken stock (or use water)",
    "100g - 1 cup Parmesan cheese (plus a little for grating on top)",
    "60g or half stick of butter",
    "2 tbs olive oil",
    "Vegetable oil (enough for frying)",
    "Salt & pepper",
    "Basil aoli - see recipe here or use bought mayonnaise with fresh basil"
  ],
  "__v": 1
}