{
  "hash": "5c27789d1f80fd0ffad194c15bc6d91cc717e2a4",
  "title": "White Chocolate Peppermint Biscotti",
  "image": "http://www.cinnamonspiceandeverythingnice.com/wp-content/uploads/2011/12/White-Chocolate-Peppermint-Biscotti-1.jpg",
  "href": "http://www.cinnamonspiceandeverythingnice.com/white-chocolate-peppermint-biscotti/",
  "extension": "Chrome",
  "firstAdded": "2016-12-24T06:42:47.339000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 degrees F. Line 2 large baking sheets with parchment paper and lightly flour them.",
    "In a large mixing bowl or in a stand mixer cream butter and sugar on low speed until light and fluffy. Beat in eggs and vanilla. Slowly add the flour, baking powder and salt on low speed just until blended. Stir in peppermint chips.",
    "Turn dough out onto a lightly floured surface and divide into 4 equal pieces. The dough will be sticky, flour your hands or wet them lightly with water. Place each piece, one at a time onto baking sheet and form into a loaf about a foot long, spacing them 3 inches apart. Sprinkle tops with sugar if desired.",
    "Bake for 20-25 minutes until golden brown. Remove and allow to cool 10 minutes, use 2 spatulas to remove to wire racks and cool completely.",
    "Preheat oven to 350 degrees F. Place the completely cooled biscotti loaves on cutting board and cut on the diagonal into 1/2 inch wide slices. Place in a single layer on baking sheets and cook 12 to 15 minutes for traditional biscotti or 5 minutes for a softer biscotti. Cool again on wire racks.",
    "Add the white chocolate and shortening to a medium bowl and microwave in 30 second increments until completely melted. Drizzle over tops of biscotti or dunk the ends or sides. Place on parchment paper to set. Store tightly covered in a cool, dry place."
  ],
  "ingredients": [
    "0",
    "16 tablespoons butter, softened",
    "1 + 3/4 cups sugar",
    "2 teaspoons vanilla extract",
    "6 eggs",
    "5 +1/2 cups flour",
    "2 tablespoons baking powder",
    "1/2 teaspoon salt",
    "3 cups Andes Peppermint Crunch Baking Chips (or 1 cup finely crushed peppermint candies/canes + 2 cups white chocolate chips)",
    "for garnish:",
    "8 ounces white chocolate",
    "1 tablespoon shortening"
  ],
  "__v": 1
}