{
  "hash": "3477fa565a058a670c1db1bd1fbe931b6a1a1b87",
  "title": "Peppermint Mocha Cookies",
  "image": "https://sallysbakingaddiction.com/wp-content/uploads/2015/12/peppermint-mocha-cookies-recipe-220x220.jpg",
  "href": "https://sallysbakingaddiction.com/2015/12/07/peppermint-mocha-cookies/",
  "extension": "Firefox",
  "firstAdded": "2018-01-23T21:27:33.061000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large bowl using a hand-held mixer or stand mixer fitted with a paddle attachment, beat the butter for 1 minute on medium speed until completely smooth and creamy. Add the granulated sugar and brown sugar and beat on medium high speed until fluffy and light in color. Beat in egg, vanilla and peppermint extracts on high speed. Scrape down the sides and bottom of the bowl as needed.",
    "In a separate bowl, whisk the flour, cocoa powder, baking soda, espresso powder, and salt together until combined. On low speed, slowly mix into the wet ingredients until combined. The cookie dough will be quite thick. Switch to high speed and beat in the chocolate chips. The cookie dough will be sticky. Cover dough tightly with aluminum foil or plastic wrap and chill for at least 3 hours and up to 3 days. Chilling is mandatory for this cookie dough. I always chill mine overnight.",
    "Remove cookie dough from the refrigerator and allow to sit at room temperature for 20 minutes-- if the cookie dough chilled longer than 3 hours, let it sit at room temperature for about 30 minutes. This makes the cookie dough easier to scoop and roll.",
    "Preheat oven to 350°F (177°C). Line two large baking sheets with parchment paper or silicone baking mats. (Always recommended for cookies.) Set aside.",
    "Scoop and roll balls of dough, about 1.5 Tablespoons of dough each, into balls and place on the baking sheets.",
    "Bake the cookies for 8-9 minutes. My oven has hot spots and yours may too- so be sure to rotate the pan once during bake time. The baked cookies will look extremely soft in the centers when you remove them from the oven. Allow to cool for 5 minutes on the cookie sheet. They will slightly deflate as you let them cool. Transfer to cooling rack to cool completely.",
    "Melt the chopped white chocolate in a double boiler or (carefully!) use the microwave. For the microwave, place the white chocolate in a medium heat-proof bowl. Melt in 15 second increments, stirring after each increment until completely melted and smooth. Dip each completely cooled cookie halfway into the white chocolate and place onto a parchment or silicone baking mat-lined baking sheet. Sprinkle crushed candy canes on top of the chocolate. Repeat with the rest of the cooled cookies. Place the baking sheet into the refrigerator to help the chocolate set. Once set, enjoy!"
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "1/2 cup (115g) unsalted butter, softened to room temperature",
    "1/2 cup (100g) granulated sugar",
    "1/2 cup (100g) packed light or dark brown sugar",
    "1 large egg, at room temperature",
    "1 teaspoon pure vanilla extract",
    "1 teaspoon peppermint extract",
    "1 cup (125g) all-purpose flour (spoon & leveled)",
    "1/2 cup + 2 Tablespoons (53g) unsweetened natural cocoa powder",
    "1 teaspoon baking soda",
    "2 teaspoons espresso powder or 1 Tablespoon instant coffee granules",
    "1/8 teaspoon salt",
    "1 cup (180g) mini or regular size semi-sweet chocolate chips",
    "8 ounces white chocolate, coarsely chopped",
    "3 large candy canes, crushed"
  ],
  "__v": 1
}