{
  "hash": "4e107ace75836347c8a236de2f688c25b260ecfc",
  "title": "Nathalie Dupree’s Cream Biscuits\nMaks 6-8 two-inch biscuits, or 12-14 one-inch biscuits.",
  "image": "",
  "href": "https://www.msn.com/en-us/foodanddrink/tipsandtricks/the-best-biscuits-and-how-to-make-them-according-to-3-southern-cooks/ar-AACjONf?li=BBnb7Kw",
  "extension": "Chrome",
  "firstAdded": "2019-06-04T03:17:45.158000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 450 degrees Fahrenheit. Select a baking pan by determining if a soft or crisp exterior is desired. For a soft exterior, use an 8- or 9-inch cake pan, individual pizza pan or an ovenproof skillet where the biscuits will nestle together snugly, creating the soft exterior while baking. For a crisp exterior, select a quarter-sheet pan or other baking pan in which the biscuits can be placed farther apart, allowing air to circulate and create a crisper exterior. Butter the pan.",
    "Fork-sift or whisk 2 cups of the flour in a large bowl, preferably wider than it is deep, and set aside the remaining 1/4 cup of flour. Make a deep hollow in the center of the flour by pressing with the back of your hand. Slowly but steadily stir 1 cup of cream, reserving 1/4 cup cream, into the hollow with a rubber spatula or large metal spoon, using broad circular strokes to quickly pull the flour into the cream. Mix just until the dry ingredients are moistened and the sticky dough begins to pull away from the sides of the bowl. If there is some flour remaining on the bottom and sides of the bowl, stir in just enough of the reserved cream to incorporate the remaining flour into the shaggy, wettish dough. If the dough is too wet, use more flour when shaping.",
    "Lightly sprinkle a flexible plastic cutting mat, wooden board or other clean surface with some of the reserved flour. Turn the lumpy, wettish dough out onto the board and sprinkle the top of the dough lightly with flour if sticky. With floured hands, fold the dough in half and pat it into a 1/3-to-1/2-inch-thick round, using a little additional flour only if needed. (If using the flexible plastic mat, fold the mat over itself to fold the dough.) Flour again if sticky and fold the dough in half a second time.",
    "If the dough is still clumpy, pat and fold a third time. Pat dough into a 1/2-inch-thick round for normal biscuits, a 3/4-inch-thick round for tall biscuits, or a 1-inch-thick round for giant biscuits. Brush off any visible flour from the top. For each biscuit, dip the biscuit cutter into the reserved flour and cut out the biscuits, starting at the outside edge and cutting very close together, being careful not to twist the cutter. The scraps may be combined to make additional biscuits, although they will be tougher.",
    "Using a metal spatula if necessary, move the biscuits to the pan or baking sheet. Bake the biscuits on the top rack of the oven until light golden brown, about 10 to 14 minutes. After 6 minutes of baking, rotate the pan in the oven so that the front of the pan is now turned to the back, and check to see if bottoms of the biscuits are browning too quickly. If so, slide another baking pan underneath to add insulation and retard the browning. Continue baking another 4 to 8 minutes, until the biscuits are light golden brown. When they are done, remove from the oven and lightly brush the tops with softened or melted butter. Turn the biscuits out upside down on a plate to cool slightly. Serve hot, right side up.",
    "Reprinted with permission from “Southern Biscuits” by Nathalie Dupree and Cynthia Graubart. For more information, please visitwww"
  ],
  "ingredients": [
    "0",
    "2 1/4 cups self-rising flour, divided",
    "1 1/4 cups heavy cream, divided",
    "Salted butter, softened or melted, for pan and finishing"
  ],
  "__v": 1
}