{
  "hash": "c0f27b4ebde9d7554fc8475fd9b0aee9092034f0",
  "title": "Apple Fritter Blondies {Apple Fritter Week!!}",
  "image": "http://cf.thedomesticrebel.com/wp-content/uploads/2014/10/DSC_0907A.jpg",
  "href": "http://thedomesticrebel.com/2014/10/24/apple-fritter-blondies-apple-fritter-week/",
  "extension": "Chrome",
  "firstAdded": "2016-11-18T15:43:32.166000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 degrees F. Liberally grease a 13x9\" baking dish with cooking spray and set aside. Meanwhile, heat a medium skillet over medium heat. Toss in the 2 Tbsp butter, ¼ cup brown sugar, 1 tsp cinnamon and the apples and saute for about 2-3 minutes or until tender, but not quite soft. Set aside.",
    "In a large bowl, whisk together the melted butter and brown sugar. Gently stream in the eggs, whisking constantly so as not to scramble them, and the vanilla. Stir in the baking soda, flour, salt, cinnamon and nutmeg until a soft batter has formed. Fold in the apples and their juices.",
    "Spread the mixture evenly into the prepared pan and bake for approx. 20-25 minutes or until the top is golden and appears set. Do not over-bake past the 25-minute mark as the bars will continue to cook as they cool. Cool the bars completely before glazing.",
    "To make the glaze, in a small bowl combine the powdered sugar, hot water and apple cider until glaze is pourable. Pour over the top of the blondies and allow it to set before cutting into squares."
  ],
  "ingredients": [
    "0",
    "1 cup (2 sticks) unsalted butter, melted, plus 2 Tbsp",
    "2 cups dark brown sugar, plus ¼ cup",
    "2 eggs",
    "2 tsp vanilla extract",
    "1 tsp baking soda",
    "2 cups all-purpose flour",
    "2 tsp cinnamon",
    "Pinch nutmeg",
    "Pinch salt",
    "2-3 smaller Granny Smith apples, peeled, cored, and chopped into bite-sized pieces",
    "2 cups powdered sugar",
    "2-3 Tbsp apple cider",
    "Splash hot water"
  ],
  "__v": 1
}