{
  "hash": "35e5b64c1a104289ebef444bafd2649d7f583ed0",
  "title": "Chocolate Layer Cake",
  "image": "",
  "href": "http://www.tastingtable.com/cook/recipes/how-to-make-chocolate-layer-cake-emily-luchetti-recipe",
  "firstAdded": "2015-02-27T22:48:22.664000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "butter",
    "greasing",
    "cocoa",
    "dusting",
    "water",
    "chocolate",
    "broken",
    "pieces",
    "allpurpose",
    "flour",
    "divided",
    "baking",
    "soda",
    "kosher",
    "salt",
    "softened",
    "granulated",
    "sugar",
    "eggs",
    "milk",
    "bittersweet",
    "roughly",
    "cream"
  ],
  "directions": [
    "0",
    "Make the chocolate cake: Preheat the oven to 350°. Grease the bottoms and sides of two 9-inch cake pans with butter and dust evenly with cocoa powder, tapping out the excess.",
    "In a small bowl, stir the cocoa powder with the water to make a paste; set aside.",
    "In a small heatproof bowl set over a saucepan of simmering water, making sure the bowl does not touch the water, melt the chocolate. Using a rubber spatula, stir the chocolate until smooth and evenly melted, 2 to 3 minutes. Set aside and allow to cool to room temperature.",
    "Through a fine-mesh strainer over a large bowl, sift the flour and baking soda; add the salt.",
    "In a stand mixer, beat the butter and sugar on medium speed until smooth. Scrape down the sides of the bowl using a spatula and stir in the eggs, 1 at a time, until combined. On low speed, add the reserved cocoa paste and melted chocolate and mix until well combined.",
    "Still on low speed, add half of the sifted flour, then half the milk. Repeat with the remaining flour and then the milk, until combined.",
    "Divide the batter between the greased and coated pans. Using an offset spatula or rubber spatula, spread out the batter. Bake the cakes on the middle rack of the oven until a toothpick inserted into the middle comes out clean, 30 to 35 minutes. Run a paring knife around the inside edges to loosen the cake. Place a plate or sheet pan on top of each cake and invert the cake. Remove the pans and allow the cakes to cool completely.",
    "Make the chocolate frosting: Place the chopped chocolate in a medium bowl.",
    "In a small saucepan over medium heat, warm the cream and sugar, stirring often until the sugar dissolves, 2 to 3 minutes.",
    "Pour the warm cream over the chopped chocolate and let sit for 2 to 3 minutes or until the chocolate begins to soften. Whisk until smooth and allow to sit for another 5 to 7 minutes to cool slightly.",
    "Whisk the butter into the chocolate, adding only 1 or 2 pieces at a time and whisking until they're blended in before adding the next.",
    "Let the frosting sit at room temperature until it seems spreadable, 20 to 30 minutes.",
    "To assemble the cake, place one of the cake layers bottom-side up on a cake plate or platter. Using an offset metal spatula, ice with about 1 cup of the frosting. Place the second layer, also bottom-side up, on top of the frosting. Spread the remaining frosting over the side and top of the cake. Slice and serve."
  ],
  "ingredients": [
    "0",
    "Unsalted butter, for greasing",
    "¾ cup cocoa powder, plus more for dusting",
    "¾ cup water",
    "4 ounces unsweetened chocolate, chopped or broken into 1-inch pieces",
    "2 cups all-purpose flour, divided",
    "1½ teaspoons baking soda",
    "¼ teaspoon kosher salt",
    "12 tablespoons (1½ sticks) unsalted butter, softened",
    "2 cups granulated sugar",
    "5 large eggs",
    "1 cup whole milk, divided",
    "10 ounces bittersweet chocolate, roughly chopped",
    "1 cup heavy cream",
    "⅔ cup granulated sugar",
    "12 tablespoons (1½ sticks) unsalted butter, softened and cut into 1-inch pieces"
  ],
  "__v": 1
}