{
  "__v": 1,
  "directions": [
    "0",
    "- Prepare quinoa according to package instructions (I cook 1 heaping cup with a scant 2 cups of water in my rice cooker).",
    "- Preheat oven to 400 degrees, pierce sweet potatoes with fork and bake for 45 minutes or until soft. Remove skins, mash with a fork to remove all chunks and place in large mixing bowl.",
    "- In a sauté pan combine onions, olive oil, a hearty pinch of sea salt and cook over medium-low heat until onions are translucent. Add garlic and cook an additional minute, stirring continually to prevent the garlic from burning. Add thyme at the very end and mix well.",
    "- Add onions, quinoa, 1/4 teaspoon sea salt (more to taste), a bit of fresh cracked pepper to large mixing bowl with sweet potatoes and stir until well combined.",
    "- Form mixture into golf ball size ball, flatten into a patty, and cook in earth balance vegan butter on a non stick pan for approximately 2 minutes on each side (you want them to brown up and crisp!). Repeat to make as many as you’d like. Enjoy with a generous sprinkling of fresh thyme leaves and some finishing salt! Save any leftovers in the refridgerator to make later."
  ],
  "firstAdded": "2014-06-26T15:51:34.669000",
  "hash": "8ddc94f4142fabf53aaafeda51cbafec613ae904",
  "href": "http://ahouseinthehills.com/2014/01/13/sweet-potato-quinoa-patties/",
  "image": "http://ahouseinthehills.com/wp-content/uploads/2014/01/sweet_potato_quinoa_patties_a_house_in_the_hills_5.jpg",
  "ingredients": [
    "0",
    "- 2 cups baked sweet potato, skins removed & mashed (approximately 2 medium sweet potatoes)",
    "- 2 cups cooked quinoa",
    "- medium yellow onion, diced",
    "- 3 cloves of crushed garlic",
    "- 1 tablespoon finely chopped fresh thyme (more to garnish)",
    "- 1 tablespoon extra virgin olive oil",
    "- sea salt",
    "- fresh cracked pepper",
    "- earth balance vegan butter or coconut oil for cooking"
  ],
  "keywords": [
    "baked",
    "potato",
    "skins",
    "mashed",
    "medium",
    "potatoes",
    "quinoa",
    "yellow",
    "onion",
    "garlic",
    "thyme",
    "extra",
    "virgin",
    "olive",
    "oil",
    "salt",
    "cracked",
    "pepper",
    "earth",
    "balance",
    "vegan",
    "butter",
    "coconut",
    "cooking"
  ],
  "title": "SWEET POTATO QUINOA PATTIES\n{makes roughly 12 patties)",
  "users": [
    null
  ]
}