{
  "hash": "8ad65c30d3c9bc4a5505c7d7953f2026b2160ca4",
  "title": "Cranberry-Ginger Jam Donuts",
  "image": "https://images.food52.com/XnlJQmlpjmigdPjz_gXBn5fr9FA=/753x502/9bc11920-d816-4a20-8694-2c8f495fc9d9--1X2B6175.jpg",
  "href": "https://food52.com/recipes/25161-cranberry-ginger-jam-donuts",
  "extension": "Chrome",
  "firstAdded": "2018-01-02T16:58:47.233000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In the bowl of a stand mixer, whisk the yeast into the water along with 1 tablespoon sugar. Let sit until foamy, about 5 minutes.",
    "In a large bowl, whisk the remaining sugar, baking powder, nutmeg, salt, and 4 cups of flour together.",
    "Add the butter or shortening, egg yolks, and vanilla to the yeast mixture. Mix for about one minute to break up the butter or shortening.",
    "Slowly add in the dry ingredients, then switch to the dough hook and knead the dough for 2 minutes. The dough should be tacky and soft and may barely stick to the bottom of the bowl. If the dough seems very sticky, slowly add in more flour until just tacky. Once kneaded, transfer the dough to a lightly oiled bowl, cover, and let rise until doubled in size, about an hour.",
    "While the dough is rising prepare the cranberry jam by adding all of the ingredients to a medium saucepan. Bring to a simmer and cook over medium heat until the cranberries have softened and burst. Remove from heat and let the jam cool for 15 minutes, then use an immersion blender to blend until smooth. Fill a pastry bag fitted with a bismark tip (pictured) or a large round tip.",
    "Transfer the risen dough to a lightly floured work surface and roll into a circle about 12 inch thick. Use a floured 2-inch round cutter to cut as many donuts as possible. Transfer the cut circles to a lightly floured baking sheet and let rise, uncovered until almost doubled in size, 30 to 45 minutes.",
    "About 15 minutes before you are ready to fry the donuts, heat a large pot or dutch oven with at least 2 inches of oil over medium heat until the oil reaches 350º F on a candy thermometer. Brush off any excess flour and fry the donuts for about 1 minute per side, being careful not to crowd the pan. When the donuts are deep golden brown on each side, remove them from the oil.",
    "Let the donuts cool slightly, then use the pastry bag to fill each donut with about 2 teaspoons of jam. Dust with confectioner’s sugar and serve immediately. These donuts are best the day they are made."
  ],
  "ingredients": [
    "0",
    "4 1/2 teaspoons active dry yeast (2 packets)",
    "1 cup warm water, 110° F",
    "1/2 cup sugar",
    "1/2 teaspoon baking powder",
    "1/2 teaspoon freshly grated nutmeg",
    "2 teaspoons salt",
    "4 to 4 1/2 cups all purpose flour",
    "1/4 cup soft butter or shortening",
    "3 egg yolks",
    "1 teaspoon vanilla extract",
    "Canola oil, for frying",
    "Confectioner's sugar to dust finished donuts",
    "Pastry bag and tip to fill the donuts",
    "1",
    "12 ounces cranberries",
    "2/3 cup water",
    "3/4 cup sugar",
    "1 tablespoon freshly grated ginger",
    "Juice and zest of one small orange",
    "Juice and zest of one lemon",
    "Seeds from one vanilla bean"
  ],
  "__v": 1
}