{
  "hash": "f3ac391e181fa1967646416f8cb762f1632ee4c7",
  "title": "Honey Teriyaki Salmon and Veggies in Foil",
  "image": "https://www.cookingclassy.com/wp-content/uploads/2015/08/honey-teriyaki-salmon-in-foil-srgb..jpg",
  "href": "https://www.cookingclassy.com/honey-teriyaki-salmon-and-veggies-in-foil/",
  "extension": "Firefox",
  "firstAdded": "2019-03-03T08:29:44.023000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400 degrees.",
    "For the sauce:",
    "In a small saucepan whisk together soy sauce, 3 Tbsp water, honey, rice vinegar, garlic, ginger and sesame oil. Season lightly with salt as needed. Bring to a boil over medium-high heat. In a small bowl whisk together cornstarch with remaining 2 Tbsp water until well combined. Pour into sauce mixture, reduce to medium and allow to boil 1 minute while stirring constantly. Remove from heat and let cool slightly, about 5 - 10 minutes.",
    "For the salmon and veggies:",
    "Toss broccoli and carrots with olive oil and season with salt and pepper. Cut 4 sheets of 14-inch length aluminum foil. Divide broccoli and carrot mixture among sheets layering in center in an even layer. Set aside 1/4 cup of the sauce mixture then brush bottom sides of salmon fillets with a scant tablespoon of the sauce then rotate and place salmon over veggies. Brush tops of salmon with another scant tablespoon of the sauce mixture. Pull sides of foil inward (the short length) and seal then roll edges up (try to leave a little room for heat to circulate, don't wrap tightly). Place packets on a baking sheet. Bake in preheated oven until salmon has cooked through, about 25 minutes. Serve with brown or white rice if desired and remaining sauce. Sprinkle with green onions.",
    "Recipe source: Cooking Classy, inspired by my Teriyaki Salmon"
  ],
  "ingredients": [
    "0",
    "Honey Teriyaki Sauce",
    "1/3 cup low-sodium soy sauce",
    "5 Tbsp water , divided",
    "1/4 cup honey",
    "1 1/2 Tbsp rice vinegar",
    "3 cloves garlic , minced",
    "1 Tbsp minced ginger",
    "1 tsp sesame oil",
    "2 1/2 tsp cornstarch",
    "Salmon and Veggies",
    "4 (6 oz) skinless, salmon fillets",
    "4 cups broccoli florets (chop small so they cook through)",
    "1 1/2 cups thinly sliced carrots",
    "2 1/2 Tbsp olive oil",
    "Salt and freshly ground black pepper",
    "2 green onions , chopped",
    "Sesame seeds , for garnish",
    "Cooked brown or white rice , for serving"
  ],
  "__v": 1
}