{
  "hash": "2906ee6571a2c09103153a3d4b8dce33869999c0",
  "title": "Slow Cooker Whole Chicken with Herbs & Caramelized Onions\nAmazingly moist and flavorful with easy crock pot convenience.",
  "image": "http://s3.amazonaws.com/yummy_uploads2/blog/5717.jpg",
  "href": "http://www.theyummylife.com/Slow_Cooker_Whole_Chicken",
  "extension": "Chrome",
  "firstAdded": "2015-05-07T17:26:41.811000",
  "users": [
    null
  ],
  "keywords": [
    "step",
    "assemble",
    "chicken",
    "giblets",
    "black",
    "pepper",
    "lowsodium",
    "soy",
    "onions",
    "garlic",
    "sage",
    "rosemary",
    "thyme"
  ],
  "directions": [
    "0",
    "Step 2. Chop each peeled onion in half; then quarter each half.",
    "Step 3. Peel the garlic. To make this fast and easy, roll the garlic cloves in a garlic peeler. After a few turns, the peels slide right off.",
    "view on Amazon: garlic peeler tube",
    "StepSpray or brush the inside of the slow cooker with oil.",
    "StepScatter one or two chopped onions in the bottom, separating the onion layers as you scatter them. Add 2 garlic cloves and sprigs of rosemary, thyme and sage.",
    "view on Amazon: my slow cooker (rated #1 by Cooks Illustrated)",
    "Step 6. Prop the chicken up inside the slow cooker with the legs and open cavity facing up. This makes it easier to stuff. Also, when the soy sauce is added, some will run through the cavity into the slow cooker and some will stay in the cavity; this way it flavors the inside and bottom of the bird as it cooks.",
    "Step 7. Add ingredients to the inside of the cavity: sprinkle in the black pepper, stuff in sprigs of each herb, add 2 garlic cloves, stuff in chopped onions until the cavity is full, then pour soy sauce over the onions.",
    "Step 8. Place the chicken breast side down in the slow cooker. The dark meat is naturally more moist, and it's juices will run down into the breast meat to make it moist, too. (I got this tip from Cooks Illustrated's Slow Cooker Revolution cookbook.) Add sprigs of each herb on top, put the lid on, and cook on low for 5-6 hours.",
    "Note: Slow cookers can vary considerably in the heat level and amount of cooking time required. In my slow cooker, a 4.5 lb. chicken took 6 hours to cook. The best way to determine if the chicken is cooked is to insert an instant read thermometer into the thickest part of the breast meat; it should be 165 degrees when it's done. Another test to is to jiggle the legs, if they easily separate from the carcass, the chicken is done."
  ],
  "ingredients": [
    "0",
    "Step 1. Assemble the ingredients",
    "4-5 pound whole chicken, giblets removed",
    "ground black pepper",
    "low-sodium soy sauce",
    "onions",
    "garlic",
    "fresh sage, rosemary, and thyme"
  ],
  "__v": 1
}