{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 315 degrees. Grease a 8.25x4.25-inch loaf pan with coconut oil and line bottom only with parchment paper, slightly greasing the parchment as well. Please note: A standard 9x5-inch loaf pan will result in a longer shorter loaf. But it will still taste great! (If making dinner rolls, see *recipe note below.)",
    "In a small bowl, combine the almond flour, coconut flour, caraway seeds, baking soda and salt; set aside.",
    "In a large bowl, add the cashew butter, eggs, egg whites, molasses and honey. Using an electric mixer, blend together until smooth and creamy.",
    "Add the water and vinegar to the nut butter mixture and mix on high until well blended.",
    "Add the dry ingredients to the wet and mix until batter is smooth and creamy, making sure to scrape down the bowl as needed.",
    "Pour batter into the prepared loaf pan using a rubber spatula to to scrape all the batter from the bowl. Sprinkle top with extra caraway seeds, if desired.",
    "Bake for approximately 40 minutes until golden brown and toothpick inserted into center comes out clean.",
    "Allow bread to rest on stovetop about 10-15 minutes. Then run a knife along the edges and invert onto a cutting board to finish cooling.",
    "Once bread is completely cooled, use a serrated bread knife to slice and serve. Bread can be wrapped and stored in an airtight container in fridge for about 5-7 days, or frozen for up to one month."
  ],
  "hash": "a46ec33bd8644055ac887c5b69e612a2a3dc405f",
  "href": "http://thenourishinghome.com/2013/11/grain-free-brown-bread-rolls-gf-df/#52f51cb5bf94c9b106000072",
  "image": "http://thenourishinghome.com/wp-content/uploads/2013/11/Grain-Free-Squaw-Rolls-The-Nourishing-Home.jpg",
  "ingredients": [
    "0",
    "1/2 cup blanched almond flour",
    "1 tbsp coconut flour",
    "2 tsp caraway seeds, plus extra for sprinkling",
    "1 tsp baking soda",
    "1/2 tsp sea salt",
    "1 cup creamy raw cashew butter",
    "2 eggs, plus 2 egg whites",
    "1 tbsp organic unsulfured molasses",
    "2 tsp pure honey",
    "1 tbsp water",
    "2 tsp apple cider vinegar"
  ],
  "keywords": [
    "almond",
    "flour",
    "coconut",
    "caraway",
    "seeds",
    "extra",
    "sprinkling",
    "baking",
    "soda",
    "salt",
    "creamy",
    "raw",
    "cashew",
    "butter",
    "eggs",
    "egg",
    "whites",
    "organic",
    "unsulfured",
    "molasses",
    "honey",
    "water",
    "apple",
    "cider",
    "vinegar"
  ],
  "title": "Classic Sweet Brown Bread & Rolls (GF, DF)",
  "users": [
    null
  ]
}