{
  "hash": "78c777a1aad4ed9c134575f4313d90a80b451391",
  "title": "Basic Polenta (Soft or Set)",
  "image": "http://www.marthastewart.com/sites/files/marthastewart.com/imagecache/wmax-520-highdpi/ecl/images/content/pub/ms_living/2007Q4/la103103_1007_polenta_vert.jpg",
  "href": "http://www.marthastewart.com/316164/basic-polenta-soft-or-set?czone=food%2Fcomfort-foods-center%2Fcomfort-foods-dishes&gallery=1034160&slide=316164&center=854190",
  "extension": "Chrome",
  "firstAdded": "2015-03-08T12:37:48.563000",
  "users": [
    null
  ],
  "keywords": [
    "cold",
    "water",
    "heaping",
    "coarse",
    "salt",
    "bay",
    "leaf",
    "coarseground",
    "polenta",
    "meal",
    "pepper",
    "unsalted",
    "butter",
    "shaved",
    "parmigianoreggiano"
  ],
  "directions": [
    "0",
    "Put 6 cups cold water, the salt, and bay leaf into a Dutch oven or a heavy stockpot, and bring to a boil. Bring remaining 4 cups cold water to a simmer in a small saucepan over medium heat.",
    "Add polenta to large pot in handfuls, separating your fingers to let the grains slip through and whisking constantly until combined. Reduce heat until only a couple of large bubbles appear at a time.",
    "Whisk 2 ladlefuls of simmering water into polenta, and cook, stirring frequently with a wooden spoon, until water has been absorbed, about 5 minutes. Continue to add 2 ladlefuls of water every 5 minutes, stirring often and waiting for it to be absorbed before adding more, until polenta is creamy and just pulls away from sides of pot, about 45 minutes. (It may be necessary to adjust heat.)",
    "If not serving immediately, reduce heat to lowest setting, cover pot, and keep warm until ready to serve (up to 1 hour). Remove bay leaf. Season with pepper.",
    "For soft polenta only: Stir in butter. Use a damp spoon to serve. Top each serving with Parmigiano-Reggiano.",
    "For set polenta only: Pour into a slightly damp medium bowl (or a 13-by-9-inch baking dish). Let stand until no longer steaming, about 10 minutes. Refrigerate, uncovered, until cold and set, about 1 1/2 hours. Cover with plastic wrap. Refrigerate until ready to serve (up to 2 days).",
    "Turn out polenta. Using plain dental floss, cut horizontally in half, pulling string toward you. Cut in half crosswise, pressing string downward. Cut each half lengthwise into 1 1/2-inch-wide strips, cut strips crosswise into thirds, and then into triangles or squares if desired. (Alternatively, cut polenta with a knife.)"
  ],
  "ingredients": [
    "0",
    "10 cups cold water",
    "1 heaping tablespoon coarse salt",
    "1 dried bay leaf",
    "2 cups coarse-ground polenta meal",
    "Freshly ground pepper",
    "2 tablespoons unsalted butter",
    "Freshly shaved Parmigiano-Reggiano"
  ],
  "__v": 1
}