{
  "hash": "3e42be1f756dd4573321db1c0fd01d98733c8f1b",
  "title": "Caramelized-Onion and Gruyère Tarts",
  "image": "http://clv.h-cdn.co/assets/cm/15/08/54ea7454b3897_-_caramelized-onion-tart-clv-xl.jpg",
  "href": "http://www.countryliving.com/food-drinks/recipes/a1067/caramelized-onion-gruyere-tarts-3172/?zoomable",
  "extension": "Chrome",
  "firstAdded": "2016-02-01T00:18:01.015000",
  "users": [
    null
  ],
  "keywords": [
    "gruyre",
    "cheese",
    "cream",
    "dijon",
    "mustard",
    "oregano",
    "pepper",
    "unsalted",
    "butter",
    "yellow",
    "onions",
    "thyme",
    "recipe",
    "country",
    "livings",
    "quick",
    "puff",
    "pastry",
    "kalamata",
    "olives"
  ],
  "directions": [
    "0",
    "Directions",
    "Make the tarts: Heat oven to 400 degrees F. Mix Gruyère, cream cheese, mustard, oregano, and pepper in a small bowl and set aside. Melt butter in a large skillet, add onions, and cook, stirring occasionally, over medium-low heat until dark brown and caramelized -- about 1 hour. Stir in the thyme and set aside. With a sharp knife, cut the puff pastry dough into 8 equal-sized pieces. Roll each piece out to 8- by 6-inch rectangle. Spread about 1/4 cup of the cheese mixture on the dough, leaving a 1/2-inch border all the way around. Top with 1/4 cup of the caramelized onions and 1 tablespoon of the olives. If freezing, skip to Step 2 or bake tarts on parchment-lined baking pans for 10 minutes, reduce oven temperature to 375°F, and bake until puffed and golden -- about 12 more minutes.",
    "Freeze the tarts: Place uncooked tarts on parchment-lined baking pans, cover with plastic wrap, and freeze until solid -- about 2 hours. Wrap each frozen tart securely in freezer paper or aluminum foil and stack them in an airtight container. Store frozen for up to 2 months. To serve, bake frozen tarts at 400°F for 12 minutes, reduce oven temperature to 375°F, and bake until puffed and golden -- about 15 more minutes."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "3 c. grated Gruyère cheese",
    "8 oz. cream cheese",
    "1 tbsp. Dijon mustard",
    "1 tbsp. Chopped fresh oregano",
    "¾ tsp. fresh ground pepper",
    "2 tbsp. unsalted butter",
    "2 large sweet yellow onions",
    "2 tbsp. fresh thyme",
    "1 recipe Country Living's Quick Puff Pastry",
    "½ c. Kalamata olives"
  ],
  "__v": 1
}