{
  "__v": 1,
  "directions": [
    "0",
    "INSTRUCTIONS",
    "1. CUT IN BUTTER: Combine flours, salt, and sugar in food processor with three 1-second pulses. Scatter butter pieces over flour, pulse to cut butter into flour until butter pieces are size of large pebbles, about 1/2 inch, about six 1-second pulses.",
    "2. ADD WATER: Sprinkle 1 tablespoon water over mixture and pulse once quickly to combine; repeat, adding water 1 tablespoon at a time and pulsing, until dough begins to form small curds that hold together when pinched with fingers (dough should look crumbly and should not form cohesive ball).",
    "3. FORM MOUND: Empty dough onto work surface and gather into rough rectangular mound about 12 inches long and 5 inches wide.",
    "4. FRAISAGE AND CHILL: Starting at farthest end, use heel of hand to smear small amount of dough against counter, pushing firmly down and away from you, to create separate pile of dough (flattened pieces of dough should look shaggy). Continue process until all dough has been worked. Gather dough into rough 12 by 5-inch mound and repeat smearing process. Dough will not have to be smeared as much as first time and should form cohesive ball once entire portion is worked. Form dough into 4-inch square, wrap in plastic, and refrigerate until cold and firm but still malleable, 30 minutes to 1 hour.",
    "5. CUT APPLES: About 15 minutes before baking, adjust oven rack to middle position and heat oven to 400 degrees. Peel, core, and halve apples. Cut apple halves lengthwise into 1/8-inch-thick slices.",
    "6. ROLL AND TRIM DOUGH: Place dough on floured 16 by 12-inch piece of parchment paper and dust with more flour. Roll dough until it just overhangs all four sides of parchment and is about 1/8 inch thick, dusting top and bottom of dough and rolling pin with flour as needed to keep dough from sticking. Trim dough so edges are even with parchment paper.",
    "7. FORM BORDER: Roll up 1 inch of each edge and pinch firmly to create 1/2-inch-thick border. Transfer dough and parchment to rimmed baking sheet.",
    "8. LAYER APPLES AND BAKE: Starting in one corner, shingle sliced apples to form even row across bottom of dough, overlapping each slice by about one-half. Continue to layer apples in rows, overlapping each row by half. Dot apples with butter and sprinkle evenly with sugar. Bake until bottom of tart is deep golden brown and apples have caramelized, 45 to 60 minutes.",
    "9. GLAZE: While galette is cooking, combine apricot preserves and water in medium microwave-safe bowl. Microwave on medium power until mixture begins to bubble, about 1 minute. Pass through fine-mesh strainer to remove any large apricot pieces. Brush baked galette with glaze and cool on wire rack for 15 minutes. Transfer to cutting board. Cut in half lengthwise and then crosswise into individual portions; serve."
  ],
  "firstAdded": "2014-10-04T00:06:15.247000",
  "hash": "02ae70461791024068a290b174d6ba2bef825c4b",
  "href": "http://www.americastestkitchen.com/recipes/3833-apple-galette?extcode=LN14K1ABA",
  "image": "",
  "ingredients": [
    "0",
    "INGREDIENTS",
    "Dough",
    "1 1/2 cups unbleached all-purpose flour (7 1/2 ounces)",
    "1/2 cup (2 1/2 ounces) Wondra flour",
    "1/2 teaspoon salt",
    "1/2 teaspoon sugar",
    "12 tablespoons cold unsalted butter, cut into 5/8-inch cubes (1 1/2 sticks)",
    "7-9 tablespoons ice water",
    "Apple Filling",
    "1 1/2 pounds apples (3-4 medium or 4-5 small), see note above",
    "2 tablespoons unsalted butter, cut into 1/4-inch pieces",
    "1/4 cup sugar",
    "2 tablespoons apricot preserves",
    "1 tablespoon water"
  ],
  "keywords": [
    "dough",
    "unbleached",
    "allpurpose",
    "flour",
    "wondra",
    "salt",
    "sugar",
    "cold",
    "unsalted",
    "butter",
    "cubes",
    "ice",
    "water",
    "apple",
    "filling",
    "apples",
    "medium",
    "pieces",
    "apricot",
    "preserves"
  ],
  "title": "Apple Galette",
  "users": [
    null
  ]
}