{
  "hash": "890f8cd7936ecf77034fc2877b4401d7a6c947a3",
  "title": "Best Ever Paleo Thanksgiving Stuffing Recipe",
  "image": "http://paleomovement.com/wp-content/uploads/2014/11/best-ever-paleo-thanksgiving-stuffing1-1200x800_c.jpg",
  "href": "http://paleomovement.com/best-ever-paleo-thanksgiving-stuffing/",
  "extension": "Chrome",
  "firstAdded": "2016-01-08T21:10:38.246000",
  "users": [
    null
  ],
  "keywords": [
    "pork",
    "onions",
    "bell",
    "peppers",
    "mushrooms",
    "apples",
    "cranberries",
    "pecans",
    "bacon",
    "butter",
    "coconut",
    "oil",
    "used",
    "duck",
    "fat",
    "rosemary",
    "thyme",
    "leaves",
    "sage",
    "salt",
    "eggs",
    "chicken",
    "turkey",
    "stock",
    "flour"
  ],
  "directions": [
    "0",
    "Prepare all of your ingredients and preheat your oven to 350°.",
    "Melt about 2 teaspoons of your fat of choice in a large cast iron or stainless skillet over medium-high heat.",
    "Add the pork and cook until it just browns, 3-4 minutes. Add a pinch of salt and remove with a slotted spoon and place in a large bowl. Pour off excess liquid from your skillet and add another teaspoon of fat.",
    "Turn the heat down to medium and add the onions. Saute until golden brown and soft, 6-8 minutes. Add to the bowl with the pork.",
    "Add another teaspoon of fat, and saute bell peppers for 4 minutes, stirring often. Add to the bowl with the other ingredients.",
    "Throw in yet another teaspoon of fat, turn the heat up to medium-high, and add the mushrooms. Saute for about 3 minutes, stirring often. Add to the bowl with the other ingredients.",
    "To the large bowl, add the apples, pecans, cranberries, herbs, and a good pinch of salt.",
    "In a medium bowl, beat together the eggs, chicken or turkey stock, and coconut flour. Add a pinch of salt if you’re stock isn’t salted.",
    "Pour the liquid into the large bowl and mix.",
    "Pour the whole thing into an oven safe casserole and bake for one hour.",
    "Allow to cool for 10 minutes before eating. It will firm up a bit."
  ],
  "ingredients": [
    "0",
    "1 pound ground pork",
    "• 2 cups diced onions",
    "• 2 cups diced bell peppers",
    "• 4 cups (about 1 pound) diced mushrooms",
    "• 2 cups diced apples",
    "• 8 oz fresh cranberries",
    "• 1 cup toasted chopped pecans (optional)",
    "• ~ 2 T duck fat, bacon fat, butter, or coconut oil. (I used duck fat)",
    "• 1 T fresh rosemary, minced",
    "• 1 T fresh thyme, minced",
    "• 2-3 leaves fresh sage (or 1/2 t dried)",
    "• sea salt",
    "• 4 eggs",
    "• 1/4 cup chicken or turkey stock",
    "• 2 T coconut flour"
  ],
  "__v": 1
}