{
  "hash": "f5cf0b03f4b65523252beb35ca7e8f453c369194",
  "title": "Flaky Mushroom and Gruyère Tarts",
  "image": "http://cdn-image.realsimple.com/sites/default/files/styles/rs_main_image/public/image/images/1012/mushroom-gruyere-tart_300.jpg?itok=xThkZLbB",
  "href": "http://www.realsimple.com/food-recipes/browse-all-recipes/flaky-mushroom-and-gruyere-tarts",
  "extension": "Chrome",
  "firstAdded": "2015-07-09T08:25:48.689000",
  "users": [
    null
  ],
  "keywords": [
    "sheet",
    "puff",
    "pastry",
    "thawed",
    "olive",
    "oil",
    "mushrooms",
    "button",
    "cremini",
    "shiitake",
    "oyster",
    "shallot",
    "kosher",
    "salt",
    "black",
    "pepper",
    "dry",
    "gruyre",
    "sharp",
    "cheddar",
    "dijon",
    "mustard",
    "white",
    "wine",
    "vinegar",
    "mixed",
    "greens",
    "radishes",
    "chives"
  ],
  "directions": [
    "0",
    "Directions",
    "Heat oven to 400° F. Unfold the pastry and cut it into 4 squares. Place the squares on a parchment-lined baking sheet and, using a fork, prick the dough all over.",
    "Meanwhile, heat 2 tablespoons of the oil in a large skillet over medium-high heat. Add the mushrooms and shallot and season with ½ teaspoon salt and ¼ teaspoon pepper. Cook, tossing occasionally, until the mushrooms are browned and tender, 4 to 5 minutes. Add the wine and cook until nearly evaporated, about 1 minute more.",
    "Dividing evenly, sprinkle the pastry squares with half the cheese, leaving a ½-inch border on each. Top with the mushroom mixture and remaining cheese. Bake until the pastry is golden brown, 20 to 25 minutes.",
    "In a large bowl, whisk together the mustard, vinegar, the remaining 2 tablespoons of oil, and ¼ teaspoon each salt and pepper. Add the greens and radishes and toss to coat. Serve the tarts with the salad and sprinkle with the chives."
  ],
  "ingredients": [
    "0",
    "1 sheet puff pastry (half a 17.3-ounce package), thawed 4 tablespoons olive oil 10 ounces assorted mushrooms (such as button, cremini, shiitake, and oyster), sliced 1 shallot, sliced kosher salt and black pepper 1/4 cup dry white wine 4 ounces Gruyère or sharp white Cheddar, grated (1 cup) 1 teaspoon Dijon mustard 1 teaspoon white wine vinegar 4 ounces mixed greens (6 cups) 2 radishes, thinly sliced 1 tablespoon chopped fresh chives"
  ],
  "__v": 1
}