{
  "hash": "482d0f39cd5c0dacc0c352c747210abc49e155c2",
  "title": "VANILLA CUPCAKES",
  "image": "https://prettysimplesweet.com/wp-content/uploads/2014/10/Vanilla-Cupcakes.jpg",
  "href": "https://prettysimplesweet.com/vanilla-cupcakes/",
  "extension": "Chrome",
  "firstAdded": "2018-10-13T17:39:08.750000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350F/180C. Line muffin tin with cupcake liners. Set aside.",
    "In a medium bowl, sift together flour, baking powder, and salt. Set aside.",
    "In a standing mixer fitted with the paddle attachment, beat together butter and sugar on medium speed until light and fluffy, about 3 minutes. Scrape down the sides and bottom of the bowl as necessary. On medium speed, beat in eggs, one at a time, beating well after each addition. Add vanilla extract and beat until combined. With the mixer on low speed, add half of the dry ingredients and beat just until combined. Add milk and beat until combined. Add the other half of the dry ingredients and beat slowly or fold by hand only until combined. Do not over mix – the less you mix, the lighter the cake will be.",
    "Divide batter evenly between the cups, filling them about ¾ full. Bake for 15-20 minutes (or 8-10 minutes if making mini cupcakes) until a toothpick inserted into the center comes out clean or with just a few moist crumbs. Allow cupcakes to sit for 10 minutes, then remove from pan and allow to cool completely on a wire rack.",
    "Unfrosted cupcakes can be kept tightly covered at room temperature for up to 3 days, or in the freezer for up to 2 months. Thaw, still covered, on the counter or overnight in the fridge."
  ],
  "ingredients": [
    "0",
    "1⅓ cups (185 grams/6.5 ounces) all-purpose flour",
    "1 teaspoon baking powder",
    "¼ teaspoon salt",
    "½ cup (1 stick/115 grams) butter, softened",
    "1 cup (200 grams/7 ounces) granulated sugar",
    "2 large eggs, room temperature",
    "1 teaspoon pure vanilla extract",
    "½ cup (120 ml) whole milk",
    "Buttercream frosting, cream cheese frosting, or Swiss meringue buttercream*"
  ],
  "__v": 1
}