{
  "__v": 1,
  "directions": [
    "0",
    "After washing the strawberries, set aside 4 particularly pretty ones for garnish. Slice the rest, sprinkle with the liqueur and sugar, and allow to macerate, covered, for about 30 minutes.",
    "Using a potato masher, gently mash the berries. Aim for a pulpy puree; we don’t recommend using a blender or food processor because it will liquefy the berries.",
    "2. Whip the cream in a separate bowl until it holds soft peaks. Gently fold the strawberry puree into the whipped cream until combined. Spoon the fool into pretty parfait glasses and chill for 1 hour. Serve garnished with the reserved whole berries and a sprig of mint, if desired.",
    "Serves"
  ],
  "firstAdded": "2014-03-09T23:27:16.801000",
  "hash": "754cae9fceb688e26b00f69bcdabafbe4bdee853",
  "href": "http://www.care2.com/greenliving/classic-strawberry-fool.html",
  "image": "",
  "ingredients": [
    "0",
    "2 cups fresh strawberries",
    "2 tablespoons Grand Marnier, Triple Sec, or bourbon",
    "Organic sugar, to taste (how much you use will depend on the sweetness of your berries)",
    "1 cup whipping cream",
    "Fresh mint sprigs for garnish (optional)"
  ],
  "keywords": [
    "strawberries",
    "marnier",
    "triple",
    "sec",
    "bourbon",
    "organic",
    "sugar",
    "use",
    "depend",
    "sweetness",
    "berries",
    "whipping",
    "cream",
    "mint",
    "sprigs"
  ],
  "title": "1. After washing the strawberries, set aside 4 particularly pretty ones for garnish. Slice the rest, sprinkle with the liqueur and sugar, and allow to macerate, covered, for about 30 minutes. 2. Using a potato masher, gently mash the berries. Aim for a pulpy puree; we don’t recommend using a blender or food processor because it will liquefy the berries. 2. Whip the cream in a separate bowl until it holds soft peaks. Gently fold the strawberry puree into the whipped cream until combined. Spoon the fool into pretty parfait glasses and chill for 1 hour. Serve garnished with the reserved whole berries and a sprig of mint, if desired. Serves 4.",
  "users": [
    null
  ]
}