{
  "hash": "0654e70a5347dabce42c586c844ecc9e007bdb67",
  "title": "Japanese Chicken Curry",
  "image": "https://www.justonecookbook.com/wp-content/uploads/2013/03/Simple-Chicken-Curry-III.jpg",
  "href": "https://www.justonecookbook.com/simple-chicken-curry/",
  "extension": "Chrome",
  "firstAdded": "2019-02-07T22:03:09.056000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Gather all the ingredients.",
    "Discard the extra fat from the chicken and cut it into bite size pieces. Season with a little bit of salt and pepper.",
    "Peel and cut the carrot in rolling wedges (Rangiri) and cut the onions in wedges.",
    "Cut the potatoes into 1.5 inch pieces and soak in water for 15 minutes to remove excess starch.",
    "Grate the ginger and crush the garlic.",
    "Heat 1 1/2 Tbsp vegetable oil in a large pot over medium heat and sauté the onions until they become translucent.",
    "Add the ginger and garlic.",
    "Add the chicken and cook until the chicken changes color.",
    "Add the carrot and mix.",
    "Add the chicken broth (or water).",
    "Bring the stock to boil and skim the scrum and fat from the surface of the stock.",
    "Peel the apple and coarsely grate it.",
    "Add the honey and salt and simmer uncovered for 20 minutes, stirring occasionally.",
    "Add the potatoes and cook for 15 minutes, or until the potatoes are tender, and turn off the heat. Meanwhile you can make homemade curry roux.",
    "When the potatoes are ready, add the curry. If you use the store-bought curry roux, put 1-2 blocks of roux in a ladle and slowly let it dissolve with spoon or chopsticks. Continue with the rest of blocks. Then go to Step #17.",
    "If you are using homemade curry roux, add a ladleful or two of cooking liquid from the stock and mix into the curry paste. Add more cooking liquid if necessary and mix well until it’s smooth.",
    "Add the roux paste back into the stock in the large pot and stir to combine.",
    "Add soy sauce and ketchup. Simmer uncovered on low heat, stirring occasionally, until the curry becomes thick.",
    "Serve the curry with Japanese rice on the side and garnish with soft boiled egg and Fukujinzuke. You can store the curry in the refrigerator up to 2-3 days and in the freezer for 1 month. Potatoes will change the texture so you can take them out before freezing."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1.2 lb boneless skinless chicken thighs (or beef, pork, seafood, tofu, or vegetables)",
    "salt (kosher or sea salt; use half if using table salt)",
    "Freshly ground black pepper",
    "2 carrots",
    "2 onions",
    "1-2 potatoes",
    "½ Tbsp ginger",
    "2 cloves garlic",
    "1½ Tbsp neutral flavor oil (vegetable, canola, etc)",
    "1 QT water (1 QT = 4 cups or 1000 ml) (or chicken stock)",
    "1 apple (I used Fuji apple)",
    "1 Tbsp honey",
    "2 tsp salt (kosher or sea salt; use half if using table salt)",
    "1 box Japanese curry roux (1 box = 7 oz or 200 g) (See Notes for homemade recipe)",
    "1½ Tbsp soy sauce",
    "1 Tbsp ketchup",
    "Toppings:",
    "soft/hard-boiled egg",
    "Fukujinzuke (red pickled daikon)"
  ],
  "__v": 1
}