{
  "hash": "ea43a658f8472456fbf11b5bead155aafb5d1b9f",
  "title": "MAJIK MERMAID BITES\nAugust 11, 2017\nI’ve been trying to really cut back on my sugar intake lately, so I wanted to create a high fat treat that has almost no sweetener, but is still super decadent and keeps me satisfied. Enter: majik mermaid bites. These little nuggets of joy remind me of the ocean, they’ve got blue and green hues that come from blue majik and spirulina (hence the name!). They’re loaded with healthy fats from coconut, walnut, and MCT oil; plus lots of fiber from hemp and chia seeds. This recipe is super adaptable and easy to make, find it below:",
  "image": "https://vibrantandpure.files.wordpress.com/2017/08/fullsizerender-317.jpg?w=750&h=312&crop=1",
  "href": "https://vibrantandpure.com/2017/08/11/majik-mermaid-bites/",
  "extension": "Chrome",
  "firstAdded": "2019-04-23T05:28:58.527000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the sea green layer:",
    "I melted the coconut butter and oil together, then added maple syrup, spirulina and chia seeds. The coconut butter sometimes doesn’t actually melt, it just softens, this is okay.",
    "For the blue layer:",
    "For this layer, I didn’t melt the coconut butter because I didn’t want the the color to become completely blue, for aesthetic reasons, I kept the 1/2 cup of coconut butter in its original state, and mixed it with the 1/2 tablespoon of maple syrup and 1/4 teaspoon of blue majik by hand. This way, I was able to create sort of a marbled look with the blue and the white, as it didn’t dissolve completely and create a uniform blue color.",
    "For the cinnamon hemp walnut butter:",
    "In a food processor or chopper, process 2 cups of raw walnuts. You might need to stop, scrape down, and keep processing for a few minutes until you have the texture of a nut butter. Next, add cinnamon, hemp seeds, and maple syrup if you choose. Scrape out of the processor and store in a glass jar in the fridge.",
    "Assembly:",
    "The easiest thing would be to use silicone molds if you have them. I used a square ice tray and placed parchment sheets underneath each one so that I could easily remove them after they were frozen.",
    "First, add a scoop of walnut butter and press down in the mold. Next, add a scoop of sea green, followed by a scoop of blue and distribute evenly to make a few squares. Place in the freezer for an hour or two, remove and enjoy! I ended up cutting the squares into bite sized pieces like this:",
    "*one more option",
    "I topped the squares with a mixture of ground up chia seeds and coconut flakes!"
  ],
  "ingredients": [
    "0",
    "BLUE LAYER",
    "1/2 cup coconut butter",
    "1/2 tablespoon maple syrup",
    "1/4 teaspoon E3 live blue majik powder",
    "SEA GREEN LAYER",
    "1/2 cup coconut butter",
    "1/2 tablespoon maple syrup",
    "1/4 teaspoon spirulina",
    "1 tablespoon chia seeds",
    "1/2 teaspoon coconut oil",
    "CINNAMON HEMP WALNUT BUTTER LAYER (OPTIONAL)",
    "2 cups raw walnuts",
    "1/2 teaspoon cinnamon",
    "1/2 teaspoon MCT or Brain Octane Oil",
    "2 tablespoons hemp seeds",
    "1 teaspoon maple syrup **OPTIONAL (I didn’t use any sweetener and it’s quite bitter but I’m okay with that, especially when it’s eaten in a bite with something sweeter. If you’re not, definitely add the maple syrup!)",
    "** OPTIONS**",
    "You can also make this much more simple (especially if you don’t have blue majik), using 1 cup coconut butter + 1 tbsp maple syrup + 1/4 teaspoon spirulina + 1 tablespoon chia seeds // you also don’t need a nut butter base, I often make them like this and it’s simply a coconut butter fudge-like bite!"
  ],
  "__v": 1
}