{
  "hash": "526fdc3ee0e9f0690576a4610cae484c2fec2ef1",
  "title": "Brown Butter Oatmeal Cookies Filled With Caramel and Peanut Butter",
  "image": "http://1.bp.blogspot.com/-xruBaBrjwWo/UZGXmiIKPyI/AAAAAAAAHcg/5SYVe8jmbE0/s640/caramel+PB+cookies.jpg",
  "href": "http://www.bakeaholicmama.com/2013/05/brown-butter-oatmeal-cookies-filled.html",
  "extension": "Firefox",
  "firstAdded": "2015-09-27T17:43:39.931000",
  "users": [
    null,
    null
  ],
  "keywords": [
    "butter",
    "sugar",
    "dark",
    "brown",
    "egg",
    "vanilla",
    "allpurpose",
    "flour",
    "old",
    "fashioned",
    "oats",
    "salt",
    "baking",
    "caramels",
    "use",
    "kraft",
    "peanut"
  ],
  "directions": [
    "0",
    "Directions:",
    "Preheat oven to 350.",
    "In a small sauce pan melt butter on medium/low heat until it has become a golded brown color and spells kind of nutty or toffee like. Remove from heat.",
    "In a medium bowl mix both sugars, egg and vanilla together. After that is combinded mix in your browned butter.",
    "Mix in your, oats, flour, salt and baking powder. Once your dough has come together refriderate for 20 minutes.",
    "Once the dough has chilled a bit, remove from refrigerator and roll into 12 equal sized balls. Place each cookie dough ball on a parchment paper lined cookie sheet about 2 inches a part.",
    "Push a carmel sqaure into the center of each cookie dough ball. You can form the sides of the cookies a bit if you want to cover the caramel more.",
    "Dollop a tsp of peanut butter on the top of each caramel.",
    "Bake for 12-14 minutes or until the cookies are golden.",
    "Allow to cool for about 15 minutes then enjoy. Store in an air tight container and heat up in the microwave for about 10 seconds to enjoy them again!"
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "1/2 cup butter",
    "1/2 cup sugar",
    "1/2 cup packed dark brown sugar",
    "1 large egg",
    "1 tsp vanilla extract",
    "1 1/4 cup all-purpose flour",
    "3/4 cups old fashioned oats",
    "1/4 teaspoon salt",
    "1/2 teaspoon baking powder",
    "12 caramels ( I use kraft)",
    "12 tsp peanut butter"
  ],
  "__v": 2
}