{
  "hash": "440a7b65ecc42cf52f8884f500e89ee913b3ead0",
  "title": "Chicken in Red Wine Vinegar Sauce",
  "image": "https://images.food52.com/n8yHPYaBzQ7v7WPFKDXVcsf-qwY=/753x502/bb065767-525c-46e0-b204-0c55f629b51e--V_Chicken.jpeg",
  "href": "https://food52.com/recipes/11458-chicken-in-red-wine-vinegar-sauce?utm_source=cj&affil=cj&utm_medium=affiliate&utm_campaign=Food52+Shop&company=Skimlinks&website=7682639&cjevent=8f5e8e4abf9311e8831d01120a1c0e12",
  "extension": "Chrome",
  "firstAdded": "2018-10-09T17:27:24.065000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Mix salt and pepper together in a small bowl. Rub each piece of chicken with the mixture.",
    "Heat the oil and melt the butter in a deep-sided 12-inch sauté pan over medium-high heat. (If your pan isn't large enough to hold all the chicken in a single layer, use 2 smaller pans, and put half the chicken, oil, and butter in each one.) When the oil is hot but not smoking, use tongs to add the chicken, skin side down. Brown on both sides until the skin becomes beautifully golden brown and the chicken is thoroughly cooked, about 12 to 15 minutes on each side. If not fully cooked through, turn the heat down to finish cooking to keep the skin from burning.",
    "Remove the chicken to a serving platter and cover loosely with aluminum foil to keep warm. Pour off about half of the fat in the pan. Add the shallots to the remaining oil and brown over medium high heat. Slowly add the vinegar to the skillet and boil until reduced to almost a syrup. (The fumes will definitely clear your sinuses -- great for a cold!) Add the crème fraîche and cook until the mixture is well blended and has turned a nutty brown color, about 5 minutes. Return the chicken to the pan to coat thoroughly and heat briefly in the sauce.",
    "Return to the platter, garnish with parsley, and serve immediately. Season with salt to taste. If there is extra sauce, pass it in a small bowl.",
    "Teacher’s Tip: Be sure the vinegar has boiled down enough before you add the crème fraîche or you'll end up with a beige, watery sauce."
  ],
  "ingredients": [
    "0",
    "3 tablespoons extra-virgin olive oil",
    "1 tablespoon unsalted butter",
    "1 whole chicken (about 4 pounds) cut into 10 pieces -- you could use all breasts or all leg portions if you prefer. I use free-range chicken.",
    "Sea salt and freshly ground black pepper, to taste",
    "4 shallots, finely chopped",
    "1 cup top quality red wine vinegar (I use Heinz)",
    "1 cup crème fraîche or heavy cream, preferably not ultrapasteurized",
    "Finely chopped fresh (flat leaf) parsley, for garnish"
  ],
  "__v": 1
}