{
  "hash": "37d7d6712df33342fa8231ffacac326b1d9da170",
  "title": "VEGAN BLACK-EYED PEA BURGERS WITH MISSISSIPPI COMEBACK SAUCE",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2013/11/Black-Eyed-Pea-Burgers-with-Mississippi-Comeback-Sauce.png",
  "href": "http://www.onegreenplanet.org/plant-based-recipes/vegan-black-eyed-pea-burgers-with-mississippi-comeback-sauce/",
  "firstAdded": "2015-01-20T08:01:34.188000",
  "users": [
    null
  ],
  "keywords": [
    "blackeyed",
    "peas",
    "rinsed",
    "flax",
    "mixed",
    "tbs",
    "water",
    "brown",
    "rice",
    "bell",
    "pepper",
    "scallions",
    "clove",
    "garlic",
    "parsley",
    "thyme",
    "mustard",
    "salt",
    "dashes",
    "hot",
    "glutenfree",
    "vegan",
    "worcestershire",
    "chickpea",
    "flour",
    "safflower",
    "oil"
  ],
  "directions": [
    "0",
    "In a small bowl or cup, mix the ground flax with water and let sit for 5 minutes until it is a gloopy gel. Mash 1 cup of the black-eyed peas with the flax gel in a large bowl. Try to mash them so there are none left intact.",
    "Add the brown rice, bell pepper, scallions, garlic, parsley, spices, hot sauce and Worcestershire sauce to the bowl and mix until all the ingredients are well-combined. Add in the flour little by little, mixing well with your hands, until you have a good consistency. You want it dry enough so that the burgers will hold together but not so dry, there is no moisture left at all. Throw in the remaining whole black-eyed peas and gently mix them in so they stay somewhat intact. Do NOT form the patties. Place the entire blob of black-eyed pea burger mix into the refrigerator and chill for at least 30 minutes.",
    "When you are ready to cook, remove the mixture from the fridge and make the patties. Divide the mixture into 4 patties. Using a 3 ½” cookie cutter ensures a perfectly formed, dense, thick burger patty.",
    "Heat the oil in a large skillet over medium-high heat. Cook the patties until browned, about 6 minutes per side. You may want to flip them carefully several times to ensure that the inside cooks while the outside doesn’t burn. Serve on a bun with your favorite toppings and Comeback Sauce or atop a bed of greens. Enjoy!"
  ],
  "ingredients": [
    "0",
    "1-15 oz. can black-eyed peas, drained and rinsed (or 1 ½ cups fresh cooked)",
    "1 Tbs. ground flax mixed with 3 Tbs. water",
    "1 cup cooked brown rice",
    "1 small bell pepper, diced",
    "3 scallions, finely sliced",
    "1 clove garlic, minced",
    "2 Tbs. fresh parsley, finely chopped",
    "1 tsp. dried thyme",
    "1 tsp. dried mustard powder",
    "Salt and pepper to taste",
    "3 dashes hot sauce or to taste",
    "1 tsp. gluten-free, vegan Worcestershire sauce",
    "1/3 – ½ cup chickpea flour",
    "1 Tbs. safflower oil"
  ],
  "__v": 1
}