{
  "hash": "c36dee32fc39f6c1ab12897ef7ccb3bc0c777eb4",
  "title": "Sweet Potato & Lentil Cakes",
  "image": "https://www.blissfulbasil.com/wp-content/uploads/2014/08/38-DSC_6301.jpg",
  "href": "https://www.blissfulbasil.com/sweet-potato-lentil-cakes-with-lemony-avocado-sauce/",
  "extension": "Chrome",
  "firstAdded": "2018-08-07T23:53:09.815000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Steam the sweet potatoes in a steamer or over the stove for 25-35 minutes or until fork-tender. Set aside to cool.",
    "While the potatoes are steaming, add the rinsed lentils and 2 cups water to a medium pan. Bring to a boil, reduce heat, and simmer uncovered for 20-25 minutes or until tender. Add in water as needed to keep the lentils submerged. Drain off excess water and set aside.",
    "Preheat oven to 400 degrees Fahrenheit.",
    "Add the steamed sweet potatoes, cooked lentils, 1/2 cup of the rolled oats, garlic, lemon juice, olive oil, paprika, cumin, sea salt, cayenne pepper, and black pepper to a food processor. Pulse 10-15 times or until the mixture is chunky but ingredients are incorporated.",
    "Transfer the mixture to a large mixing bowl. Add in the reserved 1/2 cup rolled oats, kale, pepitas, hemp seeds, cilantro, and chives. Gently stir to incorporate.",
    "Line a large baking sheet with parchment paper or a silpat.",
    "Form the mixture into 12 3-inch patties. Place each on the baking sheet. Note: the uncooked mixture is very wet and a bit challenging to form into patties, but just be patient and they will come together. You can also try spraying your hands with cooking spray to keep the mixture from sticking.",
    "Bake the patties for 25-30 minutes, being sure to flip them at the 15-minute mark. Your patties will be a light golden color when they're done.",
    "Let them cool completely and serve alongside the Lemony Avocado Sauce."
  ],
  "ingredients": [
    "0",
    "3 cups peeled and cubed sweet potatoes (about 2 medium sweet potatoes)",
    "1 cup split red lentils, thoroughly rinsed",
    "2 cups water",
    "1 cup rolled oats, divided",
    "2 cloves garlic, minced",
    "1 tablespoon fresh lemon juice",
    "1 tablespoon olive oil",
    "1 teaspoon smoked paprika",
    "1 teaspoon cumin powder",
    "3/4 to 1 teaspoon sea salt or to taste",
    "1/8 teaspoon cayenne pepper",
    "Freshly ground black pepper, to taste",
    "1 cup chopped dino or lacinto kale",
    "1/2 cup shelled pumpkin seeds (pepitas)",
    "1/4 cup shelled hemp seeds",
    "1/4 cup chopped fresh cilantro leaves",
    "2 tablespoons chopped fresh chives",
    "1 batch Lemony Avocado Sauce (see recipe below)"
  ],
  "__v": 1
}