{
  "hash": "359b51e6a7d40e6887fa584b0723ab84de9e9a33",
  "title": "Steak",
  "image": "https://atmedia.imgix.net/e507cda450c88605f695b0b85f662dee2461ed87?auto=format&q=45&w=640.0&h=430.0&fit=max&cs=strip",
  "href": "https://www.thekitchn.com/how-to-cook-steak-on-the-stovetop-240330",
  "extension": "Chrome",
  "firstAdded": "2018-02-06T19:16:48.423000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Prep the steaks: Remove the steaks from the refrigerator about 30 minutes to 1 hour before cooking. Place them on a paper towel-lined plate and pat dry with more paper towels. This will help dry the surface of the meat, making a better crust.",
    "Prepare the rest of the ingredients: Because cooking the steaks will go quickly with almost no hands-off cooking time, make sure you have the rest of the ingredients handy, as well as a probe thermometer and a clean plate for resting the steaks.",
    "Season the steaks: Just before cooking, liberally coat the steaks with the salt, making sure to coat the sides of the steaks as well.",
    "Heat the pan: Heat a 12-inch cast iron skillet over high heat for about 10 minutes; the pan should smoke just a bit when it is properly heated.",
    "Cook the steaks: Carefully place the steaks in the hot pan and cook on the first side until enough of a crust has developed that the steaks no longer stick to the pan, about 1 minute. Flip and cook on the other side for 1 minute. Continue cooking and flipping for a total of 4 minutes.",
    "Flavor and baste the steaks: Carefully add the butter, garlic, and herbs to the pan. Flip the steaks once more. Tilt the pan so the butter pools on one side and use a large spoon to baste the butter over the steaks. Flip again and repeat. Begin checking the internal temperature of the steaks at 6 minutes total cook time for your preferred doneness. Medium rare is between 125°F and 130°F.",
    "Rest the steaks (optional): Transfer the steaks to the plate to rest for 5 minutes. While the steaks rest, prepare a pan sauce if desired.",
    "Carve the steaks: Transfer the steaks to a cutting board and thinly slice across the grain. Serve immediately with the pan juices or pan sauce."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 (at least 1-inch-thick) rib-eye or New York steaks (about 12 ounces each)",
    "1 teaspoon kosher salt",
    "3 tablespoons unsalted butter",
    "3 cloves garlic, smashed",
    "2 to 3 sprigs fresh thyme or rosemary",
    "Equipment",
    "Paper towels",
    "Plates",
    "Cutting board",
    "Knife",
    "12-inch cast iron skillet",
    "Tongs",
    "Instant-read meat thermometer"
  ],
  "__v": 1
}