{
  "__v": 1,
  "directions": [
    "0",
    "Put oven rack in middle position and preheat oven to 450°F.",
    "Cut each leek into an 8-inch length, measuring from root end, and halve lengthwise, then cut crosswise into roughly 1 1/2-inch pieces. (You should have about 8 cups.) Wash leek pieces in a large bowl of cold water, agitating them, then lift out and transfer to another bowl. Repeat with clean water, then drain leeks well.",
    "Cook bread crumbs with 1/4 teaspoon salt and 3/4 teaspoon pepper in 3 tablespoons butter in a 10-inch heavy skillet over moderate heat, stirring, until crisp and pale golden, 3 to 4 minutes. Remove from heat.",
    "Cut out a round from parchment or wax paper to fit just inside a 12-inch heavy skillet.",
    "Cook leeks with remaining 1/2 teaspoon salt and 1/4 teaspoon pepper in remaining 3 tablespoons butter in a 12-inch heavy skillet over moderately low heat, leeks covered directly with parchment, stirring occasionally, until tender, about 12 minutes.",
    "Discard parchment and transfer leeks with a slotted spoon to gratin dish. Pour cream slowly over leeks, then scatter bread crumbs on top. Bake until cream is bubbling and slightly thickened and crumbs are golden brown, about 15 minutes.",
    "Cooks' notes: •Bread crumbs can be cooked 1 day ahead and cooled completely, uncovered, then kept in an airtight container at room temperature. Scatter bread crumbs over leeks just before baking.\n•Leeks can be cooked and assembled in dish with cream (but not sprinkled with crumbs and baked) 1 day ahead and cooled completely, uncovered, then chilled, covered."
  ],
  "firstAdded": "2014-10-18T23:41:01.947000",
  "hash": "13610932ed839376ca95eadbdc61a0f6cec2addc",
  "href": "http://www.epicurious.com/recipes/food/views/Creamed-Leeks-236415",
  "image": "",
  "ingredients": [
    "0",
    "3 1/2 lb leeks, root ends trimmed",
    "2 cups coarse fresh bread crumbs (from a country loaf, crusts discarded)",
    "3/4 teaspoon salt",
    "3/8 teaspoon black pepper",
    "3/4 stick (6 tablespoons) unsalted butter",
    "1 cup heavy cream"
  ],
  "keywords": [
    "leeks",
    "root",
    "ends",
    "trimmed",
    "coarse",
    "bread",
    "crumbs",
    "country",
    "loaf",
    "crusts",
    "discarded",
    "salt",
    "black",
    "pepper",
    "unsalted",
    "butter",
    "cream"
  ],
  "title": "Creamed Leeks",
  "users": [
    null
  ]
}