{
  "hash": "5fa7c657034785b75b6d3586fb55b5081691b1dc",
  "title": "Chocolate Chip Cookie Dough Cupcakes",
  "image": "http://www.cupcakediariesblog.com/wp-content/plugins/simple-share-buttons-adder/buttons/somacro/pinterest.png",
  "href": "http://www.cupcakediariesblog.com/2015/05/chocolate-chip-cookie-dough-cupcakes.html",
  "extension": "",
  "firstAdded": "2017-07-14T01:42:58.158000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare cake mix according to package directions, adding buttermilk instead of the water called for.",
    "Place cupcake liners in muffin tins and fill with batter 2/3 full. Bake according to directions on the box; remove from pans and cool on a wire rack.",
    "Prepare the cookie dough by creaming butter and sugar together; add vanilla, milk, and salt. Then add flour. Stir in mini chocolate chips.",
    "Using the large side of a frosting tip or something similar, make a hole in each cupcake by pressing it right into the center.",
    "Use a spoon to get enough cookie dough that it can be rolled into a little cylinder to fit into the hole in the cupcake. Press the dough right into the cupcake.",
    "Use a toothpick to push the cake out of the frosting tip. Tear the top off and press it right on top of the cookie dough to cover it.",
    "Prepare the frosting by creaming together butter, brown sugar, vanilla, and 2 Tbsp milk. Slowly add powdered sugar 1/2 c. at a time to avoid making a huge mess. Then add salt and flour.",
    "Pipe frosting on to each cupcake using a 1M star tip. Sprinkle with mini chocolate chips and top with a mini cookie."
  ],
  "ingredients": [
    "0",
    "1 vanilla cake mix, plus ingredients to make it",
    "1 c. buttermilk",
    "24 cupcake liners",
    "1 c. unsalted butter, at room temperature",
    "2 1/2 c. powdered sugar",
    "1/2 c. brown sugar",
    "1/2 c. flour",
    "1/2 tsp. salt",
    "2-3 Tbsp milk",
    "1 tsp. vanilla extract",
    "1/2 c. butter, softened",
    "1/4 c. sugar",
    "1/2 tsp. vanilla extract",
    "2 Tbsp milk",
    "1/8 tsp. salt",
    "1 1/2 c. flour",
    "1/2 c. mini semi-sweet chocolate chips",
    "24 mini chocolate chip cookies"
  ],
  "__v": 1
}