{
  "__v": 1,
  "directions": [
    "0",
    "Lava le carote e tritale finemente. Sbuccia la cipolla e tritala finemente. Lava le coste di sedano, togli i fili più duri e trita finemente anche il sedano. Copri con olio extravergine di oliva il fondo di una pentola in ghisa ed aggiungi a freddo il burro e le verdure tritate. Fai cuocere a fuoco basso per circa 10 minuti, mescolando spesso con un mestolo in legno. Fai attenzione, deve sfrigolare allegramente, senza bruciarsi o scurirsi troppo.",
    "Nel frattempo metti in ammollo i funghi essiccati in acqua calda finché non ritornano morbidi.",
    "Sposta la pentola a fuoco medio e aggiungi la carne macinata. Mescola con un cucchiaio di legno per spezzare bene la carne ed amalgamarla al battuto di cipolla, carota e sedano. Gira continuamente per far cuocere la carne. Quella di maiale nel frattempo si scioglierà, e pian piano il liquido dovrà essere assorbito. Raschia bene il fondo con il mestolo di legno per raccogliere tutta la carne. Ci vorranno almeno 20 minuti per arrivare al giusto punto di cottura della carne. Solo adesso regola di sale e pepe.",
    "Questo è il momento di aggiungere il vino rosso, un bicchiere, ma non tutto insieme. Nonna si raccomanda di aggiungerlo in diverse volte, almeno 3, mescolando sempre con il mestolo in legno tra una volta e l’altra per far sì che venga assorbito del tutto in maniera uniforme dalla carne. Anche in questo caso serviranno almeno 10 minuti.",
    "Versa la salsa di pomodoro nella pentola, mescolando a fondo per distribuirla nella carne. Lascia sobbollire lentamente per 5 minuti, poi aggiungi i funghi tritati finemente al coltello, aggiungendo anche l’acqua nella quale sono stati in ammollo.",
    "Abbassa il fuoco e copri la pentola con un coperchio, lasciando uno spiraglio laterale per far sfogare il vapore. Mescola di tanto in tanto, lasciando cuocere per almeno un’ora e mezzo.",
    "Nel frattempo mamma si è affacciata dietro le mie spalle, mentre mescolavo il ragù, e mi ha sussurrato: sarà pronto quando si formerrano chiazze di unto sulla superficie del sugo. Aveva ragione!",
    "Alcune note. Sì, le quantità sono tante, volutamente! Meglio prepararne una bella scorta visto che richiede un po’ di dedizione, no? Noi un po’ lo consumiamo subito – pasta, tagliatelle o pasta al forno – un po’ lo conserviamo in frigo, chiuso in un barattolo in vetro, e un po’ lo congeliamo, o nei cubetti da ghiaccio monoporzione o negli stampini in alluminio (dimensione da muffin, per intendersi) per due porzioni abbondanti."
  ],
  "firstAdded": "2014-10-07T13:19:19.580000",
  "hash": "405bf372925bf8677ba192843eade3e31bfd028f",
  "href": "http://it.julskitchen.com/secondi-piatti/carne/ragu-staub-carne",
  "image": "http://farm6.static.flickr.com/5083/5346701061_7a8dc3d1b6_b.jpg",
  "ingredients": [
    "0",
    "cipolla rossa, 1 oppure 2 cipolline fresche",
    "carote, 2 grandi",
    "sedano, 3 coste",
    "olio extravergine di oliva",
    "burro, 20 g",
    "funghi misti essiccati, 100 g",
    "macinato di maiale scelto, 300 g",
    "macinato di polpa scelta di bovino adulto, 700 g",
    "sale, circa 1 cucchiaio e 1/2",
    "pepe, 1 cucchiaino",
    "vino rosso, 1 bicchiere",
    "salsa di pomodoro, 1.5 l"
  ],
  "keywords": [
    "cipolla",
    "rossa",
    "oppure",
    "cipolline",
    "fresche",
    "carote",
    "grandi",
    "sedano",
    "coste",
    "olio",
    "extravergine",
    "oliva",
    "burro",
    "funghi",
    "misti",
    "essiccati",
    "macinato",
    "maiale",
    "scelto",
    "polpa",
    "scelta",
    "bovino",
    "adulto",
    "sale",
    "circa",
    "cucchiaio",
    "pepe",
    "cucchiaino",
    "vino",
    "rosso",
    "bicchiere",
    "salsa",
    "pomodoro"
  ],
  "title": "Il ragù di casa",
  "users": [
    null
  ]
}