{
  "hash": "cddef730f661f31e6b3860f430fb013f084c6bf0",
  "title": "Σπιτικά σουβλάκια με πίτα",
  "image": "http://eyzin.minedu.gov.gr/PublishingImages/Lists/Articles_Parents/AllItems/E588345E-4979-42DE-B23F-EB607A7A244C.jpg",
  "href": "http://eyzin.minedu.gov.gr/Pages/Parents/Cooking/StinKouzina_SyntagesSV.aspx?ArticleID=75",
  "extension": "Chrome",
  "firstAdded": "2016-01-09T12:21:02.759000",
  "users": [
    null
  ],
  "keywords": [],
  "directions": [
    "0",
    "Αρχικά, προετοιμάζετε τη σάλτσα που θα περιέχουν τα σουβλάκια (τζατζίκι, σάλτσα μουστάρδας) και την τοποθετείτε στο ψυγείο. Στη συνέχεια, ψήνετε το κρέας και τις πατάτες. Συγχρόνως καθαρίζετε τα λαχανικά που θα βάλετε στα σουβλάκια, τα κόβετε σε φέτες ή τα τρίβετε. Στο τέλος, ουσιαστικά δηλαδή λίγο πριν την κατανάλωση, προετοιμάζετε και τις πίτες.",
    "Όταν θα είναι όλα έτοιμα, και την ώρα που είναι να φάνε τα παιδιά, κάνετε την τελική προετοιμασία. Σε κάθε πίτα προσθέτετε αρχικά τη σάλτσα που έχετε παρασκευάσει, στη συνέχεια το ψημένο κρέας, τις φέτες ντομάτας-κρεμμυδιού και άλλων λαχανικών που έχετε επιλέξει και 3-4 τηγανητές πατάτες. Τυλίγετε την πίτα στο μέσο περίπου με λίγο χαρτί ή αλουμινόχαρτο, ώστε να είναι εύκολο για τα παιδιά να την κρατήσουν. Σε κάθε πιάτο μπορείτε να συνοδεύσετε με επιπλέον λαχανικά περιχυμένα με λίγο ελαιόλαδο και λίγες ακόμα πατάτες.",
    "Για τη σάλτσα:",
    "Μια απλή λύση είναι να χρησιμοποιήσετε ως σάλτσα σκέτο στραγγιστό γιαούρτι (μπορείτε και χαμηλό σε λιπαρά). Σε περίπτωση που θέλετε να φτιάξετε τζατζίκι ή, για τα μικρότερα παιδιά, τζατζίκι χωρίς σκόρδο, μπορείτε να χρησιμοποιήσετε την συνταγή που αναφέρεται στον ακόλουθο σύνδεσμο (Συνταγή για: Τζατζίκι). Επιπλέον, για τα σουβλάκια με κοτόπουλο, τα οποία όταν τα αγοράζουμε απ' έξω περιέχουν συνήθως κάποια σάλτσα μουστάρδας-μαγιονέζας μπορείτε να παρασκευάσετε μια απλή σάλτσα μουστάρδας- γιαουρτιού, όπως αυτή που αναφέρεται στον ακόλουθο σύνδεσμο (Συνταγή για: Σάλτσα μουστάρδας).",
    "Για το κρέας:",
    "Μπορείτε να αγοράσετε το κρέας (χοιρινό ή κοτόπουλο) έτοιμο, κομμένο και περασμένο σε καλαμάκια. Περίπου ½ κιλό αρκεί για 5-6 σουβλάκια. Εναλλακτικά ,μπορείτε να το περάσετε εσείς σε καλαμάκια, προσθέτοντας ανάμεσα και λαχανικά όπως πιπεριά, ντομάτα και κρεμμύδι. Λαδώνετε το κρέας με λίγο ελαιόλαδο και προσθέτετε μπαχαρικά, όπως ρίγανη, λίγο πιπέρι και λίγο αλάτι. Μπορείτε επίσης να το μαρινάρετε επιπλέον και με λίγη μουστάρδα. Ψήνετε τα καλαμάκια σε προθερμασμένο φούρνο, στη σχάρα του φούρνου με θέρμανση πάνω-κάτω για περίπου 15-20 λεπτά στους 180 °C.",
    "Για τις πίτες:",
    "Τις πίτες μπορείτε να τις θερμάνετε, ψήνοντάς τες για περίπου 1 λεπτό από την κάθε μεριά, στη σχάρα του φούρνου στο grill ή σε αντικολλητικό τηγάνι ή σε τοστιέρα. Οι περισσότερες συσκευασίες με πίτες αναγράφουν μεθόδους για τη θέρμανση τους.",
    "Για τις πατάτες:",
    "Συνήθως τα σουβλάκια είτε περιέχουν είτε συνοδεύονται με τηγανητές πατάτες. Μπορείτε να τηγανίσετε πατάτες σε ελαιόλαδο, καθώς η ποιότητα τους θα είναι σαφώς ανώτερη από αυτές που αγοράζετε απ' έξω. Εναλλακτικά, μπορείτε να φτιάξετε νόστιμες πατάτες στον φούρνο, που μοιάζουν σαν «τηγανητές» και θα περιέχουν λιγότερες θερμίδες και λιπαρά, ακολουθώντας τον ακόλουθο σύνδεσμο (Συνταγή για: Πατάτες σαν «τηγανητές»)."
  ],
  "ingredients": [
    "0",
    "Κρέας κομμένο σε μικρά κομμάτια για σουβλάκια (κομμάτια κοτόπουλου ή χοιρινού χωρίς πολύ λίπος)",
    "Πίτες (μπορούν να επιλεγούν και άλλα είδη εκτός από την κλασσική, όπως πίτα σίκαλης, ολικής άλεσης ή αραβική πίτα)",
    "Σάλτσα: γιαούρτι στραγγιστό ή σπιτικό τζατζίκι ή σπιτική σάλτσα μουστάρδας",
    "Ντομάτα-Κρεμμύδι και προαιρετικά άλλα λαχανικά: καρότο τριμμένο, μαρούλι, λάχανο",
    "Πατάτες"
  ],
  "__v": 1
}