{
  "hash": "f7d16b7552854991f6cee5389c4fe7dd06625357",
  "title": "Pine Nut and Broccoli Cream Reginette with Chargrilled Peppers",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2012/09/Reginette.jpeg",
  "href": "http://www.onegreenplanet.org/vegan-food/recipe-pine-nut-and-broccoli-cream-reginette-with-chargrilled-peppers/",
  "extension": "Chrome",
  "firstAdded": "2015-04-20T11:08:11.917000",
  "users": [
    null
  ],
  "keywords": [
    "reginette",
    "pasta",
    "onion",
    "yellow",
    "peppers",
    "deseeded",
    "strips",
    "broccoli",
    "pine",
    "nuts",
    "garlic",
    "basil",
    "oregano",
    "bouillon",
    "salt",
    "lemon",
    "juice",
    "soya",
    "yogurt",
    "milk",
    "black",
    "pepper",
    "olive",
    "oil",
    "frying"
  ],
  "directions": [
    "0",
    "In a large frying pan, heat some olive oil and fry the chopped onion on a low-medium heat for about 4-5 minutes, until softened (don’t allow to turn brown). Then add the broccoli, making sure it has been chopped into very tiny pieces before adding.",
    "Continue to fry the broccoli and onion for about 5 minutes, ensuring the contents of the pan don’t burn. Add the garlic, and gently fry for about 1 more minute before removing from the heat (at this point, you should also preheat your grill/broiler as it will soon be required for grilling the pepper and tomato).",
    "Add the dried basil and oregano, soya yogurt, into the pan with the onions and broccoli, and then stir in the bouillon powder and salt. Mix well and transfer to a blender.",
    "Blend the sauce well and add the lemon juice and soya milk (or more yogurt if you prefer the cream to be tangier). Pulse a couple of more times. Transfer the sauce to a saucepan for reheating once the pasta, pepper and tomato are cooked.",
    "Bring a large pot of salted water to the boil and immerse the reginette (or similar pasta shape) to cook for about 10 minutes, depending on how well cooked you prefer your pasta. Drain in a colander when cooked.",
    "While the pasta is cooking, arrange your peppers and tomato slices on a foil-covered grill pan and place under the grill (broiler) on the highest setting, and grill for about 5 minutes each side – until they are browned.",
    "The pine nut sauce should only need a couple of minutes to reheat. Turn the grill / broiler off and leave the cooked peppers and tomatoes under there to stay warm.",
    "Pile the pasta into large plates, spoon over the sauce, and arrange the pasta and tomatoes. Enjoy!"
  ],
  "ingredients": [
    "0",
    "9 ounces / 250g reginette pasta",
    "1 onion, chopped",
    "2 yellow peppers, deseeded and cut into strips",
    "1 cup / 175g broccoli, finely chopped",
    "4 tablespoons pine nuts",
    "2 large cloves garlic, finely chopped",
    "2 teaspoons dried basil",
    "1 teaspoons dried oregano",
    "1 teaspoon vegetable bouillon powder",
    "¼ teaspoon salt",
    "2½ tablespoons lemon juice",
    "1 cup / 250ml soya yogurt",
    "2 tablespoons soya milk",
    "Black pepper to taste",
    "Olive oil for frying"
  ],
  "__v": 1
}