{
  "hash": "544b7b73c6334bb59ee04b6a773ee0004343a09e",
  "title": "Gingerbread Scones With Cranberries (Gluten-free + Vegan)",
  "image": "",
  "href": "http://saltedplains.com/gingerbread-scones-cranberries-gf-v/",
  "extension": "",
  "firstAdded": "2015-09-21T01:03:02.899000",
  "users": [
    null
  ],
  "keywords": [
    "scones",
    "flax",
    "egg",
    "flaxseed",
    "meal",
    "hot",
    "water",
    "white",
    "rice",
    "flour",
    "use",
    "bobs",
    "red",
    "flours",
    "almond",
    "mealflour",
    "sorghum",
    "arrowroot",
    "starch",
    "salt",
    "baking",
    "ginger",
    "cinnamon",
    "coconut",
    "sugar",
    "oil",
    "solid",
    "milk",
    "apple",
    "cider",
    "vinegar",
    "vanilla",
    "molasses",
    "cranberries",
    "orange",
    "icing",
    "organic",
    "juice"
  ],
  "directions": [
    "0",
    "Heat oven to 400 degrees Fahrenheit. Line a baking sheet with parchment paper.",
    "In a small bowl combine and stir together your flaxseed meal and water, set aside.",
    "In a large bowl, combine white rice flour, almond meal, sorghum, arrowroot starch, salt, baking powder, ginger, cinnamon, cloves, and coconut sugar. Whisk to fully combine.",
    "With a pastry cutter or two knives, cut in coconut oil to dry ingredients until coconut oil is small and pea-sized. If you need, use your hands to cut in coconut oil.",
    "In a medium bowl, add almond milk, apple cider vinegar, and vanilla extract and whisk to combine. Add molasses and whisk. Whisk in flax egg mixture.",
    "Add liquid mixture to dry ingredients, stirring with a spatula until all ingredients are thoroughly incorporated. (If mixture seems too dry, add a tablespoon or two more of almond milk, or if it seems too wet and sticky, add additional almond flour). Fold in cranberries. With your hands, form dough into a ball and place in center of baking sheet. Flatten ball until it is about an inch thick. Cut into 8 triangles.",
    "Bake for 15 to 18 minutes until bottom edges start to brown. Cool baking sheet with scones on wire rack for 5 minutes.",
    "While scones are baking, whisk together ingredients for the orange icing. When scones come out of the oven, drizzle with icing using a fork.",
    "After scones have cooled for 5 minutes, serve immediately. Scones are best the day they are made but can be kept in an airtight container for a day or two."
  ],
  "ingredients": [
    "0",
    "For scones:",
    "1 flax egg (1 tablespoon flaxseed meal plus 3 tablespoons hot water)",
    "¾ cup sweet white rice flour (I use Bob's Red Mill for flours)",
    "1 cup almond meal/flour",
    "½ cup whole grain ground sorghum",
    "½ cup arrowroot starch",
    "½ teaspoon salt",
    "1 tablespoon baking powder",
    "1 teaspoon ground ginger",
    "¾ teaspoon ground cinnamon",
    "⅛ teaspoon ground cloves",
    "½ cup coconut sugar",
    "5 tablespoons coconut oil, solid",
    "¼ cup unsweetened almond milk plus 2 teaspoons apple cider vinegar",
    "1 tablespoon pure vanilla extract",
    "¼ cup molasses",
    "½ cup fresh cranberries, halved.",
    "For orange icing:",
    "½ cup organic powdered sugar",
    "2 tablespoons orange juice"
  ],
  "__v": 1
}