{
  "hash": "93f788ab84bba21ad843b6069a6927c13a8d9196",
  "title": "Killer Kale Pasta",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/guy-fieri/killer-kale-pasta-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-10-06T06:06:07.596000",
  "users": [
    null
  ],
  "keywords": [
    "red",
    "bell",
    "peppers",
    "olive",
    "oil",
    "garlic",
    "medium",
    "shallots",
    "kosher",
    "salt",
    "black",
    "pepper",
    "extra",
    "finishing",
    "white",
    "wine",
    "roasted",
    "tomatoes",
    "glen",
    "muir",
    "bunches",
    "kale",
    "coarsely",
    "chicken",
    "meat",
    "stock",
    "rigatoni",
    "extravirgin",
    "parmesan"
  ],
  "directions": [
    "0",
    "Rub the red bell peppers all over with olive oil and place directly over a direct flame to char on all sides, 3 to 4 minutes per side. Remove from the flame and place into a bowl. Cover with plastic wrap and allow to steam for about 10 minutes. Once cool to the touch, remove the steamed peppers from the bowl and pull off the charred skin, stem and seeds. Cut into slices and set aside until ready to use.",
    "Set a large Dutch oven over medium-high heat. Add a drizzle of olive oil and saute the garlic with the shallots. Season with salt and pepper. Cook until the garlic is fragrant and the shallots are translucent, 3 to 4 minutes. Add the red pepper flakes, and then add the white wine. Cook until most of the wine has evaporated. Add the cans of tomatoes and the roasted red peppers. Mix well and bring to a steady boil. Reduce the heat so it is simmering.",
    "Meanwhile, prepare the kale by removing stems and discarding. Tear the leaves up into bite-size pieces. Fold into the tomato sauce along with the chicken. Toss to combine and cover with a lid. Cook for about 5 minutes, and if you notice that the vegetables are \"dry,\" add 1 cup chicken stock. Simmer until the kale is tender, all the flavors have come together and the sauce is thick, 15 to 20 minutes. Taste and season with salt and pepper.",
    "Cook the rigatoni pasta al dente in a large pot of salted boiling water according to the package directions, 8 to10 minutes. Drain the pasta and add directly to the Dutch oven with the finished sauce. Toss to coat everything and cook over low heat (this allows the last cooking of the pasta to be done in the sauce), 2 to 3 minutes. Add a little of the starchy pasta water if needed.",
    "Serve the pasta in large bowls and top with spoonfuls of grated Parmesan and extra red chili flakes. Goes great with a chianti or merlot!",
    "Recipe courtesy of Guy Fieri"
  ],
  "ingredients": [
    "0",
    "2 red bell peppers",
    "Olive oil",
    "2 cloves garlic, minced",
    "2 medium shallots, diced",
    "Kosher salt and freshly ground black pepper",
    "2 teaspoons red pepper flakes, plus extra for finishing",
    "1/2 cup white wine",
    "One 28-ounce can plus one 14-ounce can diced fire roasted tomatoes, such as Glen Muir",
    "2 large bunches kale (about 3 pounds)",
    "4 cups coarsely shredded roasted chicken meat",
    "1 cup chicken stock",
    "1 pound rigatoni",
    "Extra-virgin olive oil",
    "1 cup grated Parmesan"
  ],
  "__v": 1
}