{
  "hash": "df836e72ff44b198cf30b5e509a4ea3c2524377f",
  "title": "Healthy Mexican Sweet Potato Skins",
  "image": "https://pinchofyum.com/wp-content/uploads/mexican-sweet-poato-1.jpg",
  "href": "https://pinchofyum.com/healthy-mexican-sweet-potato-skins",
  "extension": "Firefox",
  "firstAdded": "2018-11-11T19:14:32.364000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 degrees. Bake the sweet potatoes for 45-60 minutes.",
    "While sweet potatoes are baking, place corn in a heavy cast-iron skillet over medium-high heat with no butter or oil. Sprinkle with salt and other Mexican seasoning (as much as you want – thinking taco seasoning or a mix of chili powder and cumin). Do not stir! Let corn roast for several minutes before stirring. Let it roast for a few more minutes before stirring again. Continue this for about 10 minutes, until corn is browned and roasted on the outside. Set aside in a small bowl with the black beans.",
    "Saute the onion in the butter over medium heat until soft and translucent. Set aside.",
    "Remove sweet potatoes from the oven when fork-tender. Let cool for 5-10 minutes. Cut the sweet potatoes in half. Scrape the flesh of the sweet potatoes out, leaving the skins intact. Sometimes leaving a thin layer of potato inside of the skins helps them hold together better.",
    "Mix the flesh of the sweet potatoes with the cream cheese, sour cream, chipotle peppers, and salt. You can use a mixer or just a spoon, depending on how soft the potatoes are. When well-mixed, gently stir in the black beans, roasted corn, sauteed onions, and cilantro.",
    "Scoop the filling into the skins and top each with 1 tablespoon shredded cheese. Broil for about 5 minutes or until cheese is melted."
  ],
  "ingredients": [
    "0",
    "3 medium sweet potatoes",
    "1 can corn, rinsed and patted dry",
    "1 can black beans, rinsed and drained",
    "1 tablespoon butter",
    "1/2 yellow onion, chopped",
    "2-4 INDIVIDUAL chipotle peppers in adobo sauce, minced or pureed (not the whole can!)",
    "1 ounce light cream cheese",
    "1/4 cup light sour cream or Greek yogurt",
    "1 teaspoon salt (+ more to taste)",
    "1/2 cup cilantro, roughly chopped",
    "6 tablespoons shredded cheese (Pepperjack, Cheddar, Colby Jack… anything will work)"
  ],
  "__v": 1
}