{
  "hash": "15a6755e6dfb78ef4209fa3c10568cdf94c709de",
  "title": "Cassava Flour Tortillas",
  "image": "http://downshiftology.com/wp-content/uploads/2015/05/cassava-flour-tortillas-6-683x1024.jpg",
  "href": "https://downshiftology.com/recipes/cassava-flour-tortillas/",
  "extension": "",
  "firstAdded": "2016-01-03T18:45:55.823000",
  "users": [
    null
  ],
  "keywords": [
    "cassava",
    "flour",
    "salt",
    "baking",
    "soda",
    "cream",
    "tartar",
    "palm",
    "shortening",
    "ghee",
    "lard",
    "oil",
    "water"
  ],
  "directions": [
    "0",
    "Add the first four dry ingredients in a large bowl and mix together.",
    "Add the palm shortening and knead into the dry ingredients for a minute. Your ingredients will still be dry and crumbly.",
    "Add the warm water and knead together for 2-3 minutes. At first the dough will be sticky, but as the flour absorbs the water it will become dryer and more pliable.",
    "When you have a mound of dough, roll it into a log shape in the bowl (like a tube of cookie dough). Then, slice it into 6 pieces. Take each piece and roll into a ball.",
    "If you have a tortilla press, take each ball of dough, place between two pieces of parchment paper and press into a flat tortilla. Without a tortilla press, take each ball of dough between two pieces of parchment paper and roll out into an approximate 6-inch circle. (Note: I use a tortilla press, but find it doesn't get the dough quite thin enough. So I then roll it out a bit more).",
    "Heat up a non-stick or cast iron pan on medium-high heat. As the dry pan heats up, place one tortilla in the pan and cook for approximately one minute. Flip and cook the other side for an additional minute. Continue cooking all tortillas and transfer to a plate with a paper towel.",
    "Enjoy eating your cassava tortillas warm or freeze in batches for future use."
  ],
  "ingredients": [
    "0",
    "1 cup cassava flour",
    "¼ tsp salt",
    "¼ tsp baking soda",
    "½ tsp cream of tartar",
    "2 tbsp palm shortening (or ghee, lard or oil)",
    "⅔ cup warm water"
  ],
  "__v": 1
}