{
  "__v": 1,
  "directions": [
    "0",
    "Place the beef, 1 heaped teaspoon of pepper, a good pinch of salt and 2 tablespoons of olive oil into a large bowl. Grate in half a nutmeg, then toss to coat and set aside. Roughly chop the carrots, onions and rosemary leaves.",
    "Heat a drizzle of olive oil in a wide, medium pan over a medium heat, then add the beef and cook for 15 to 20 minutes, or until the meat is browned all over and any liquid has evaporated, stirring frequently. Meanwhile, heat another medium pan over a medium heat. Add the chopped veg and a drizzle of olive oil and cook for 15 to 20 minutes, or until softened and caramelised, stirring frequently, then remove from the heat.",
    "Add the ale to the beef, turn the heat up to high and allow the liquid to boil and bubble away, stirring and scraping all those lovely sticky bits from the bottom of the pan. Stir in the flour and tomato purée and cook for 2 to 3 minutes, or until it forms a thick paste. Stir the softened veg into the pan, then pour in 1 litre of cold water. Roughly slice and add the mushrooms, then bring to the boil.",
    "Reduce the heat to medium, cover and simmer for 1 hour 30 minutes, then take off the lid and simmer for another 30 minutes, or until thickened and reduced and the beef is tender, stirring occasionally. Season to taste, transfer to a bowl and allow to cool completely for a few hours or preferably overnight in the fridge.",
    "Meanwhile, make the pastry. Combine the flour and a good pinch of salt in a bowl, then grate in the Cheddar and rub into the flour along with the butter, until it resembles fine breadcrumbs. Gradually add 250ml of cold water, stirring continuously to combine, then use your hands to bring it together into a rough dough – be careful not to work it too much. Wrap the dough in cling film and place in the fridge until needed.",
    "Preheat the oven to 180ºC/350ºF/gas 4. Grease 8 individual pie dishes (roughly 15cm x 10cm) with a little butter and dust with flour. Divide the pastry into 4 equal-sized pieces, then roll out a portion on a flour-dusted surface to the thickness of a pound coin. Place 2 of the pie dishes side-by-side, roll the pastry around the rolling pin, hold it over the dishes and carefully unroll the pastry to cover. Gently press the pastry into the sides of the dishes, then roughly cut away the excess so you end up with 2 lined pie dishes. Repeat with the remaining pastry, reserving the excess for later.",
    "Equally divide the steak and ale filling between the dishes and brush the edges with the milk or beaten egg. Divide the excess pastry into 8 equal-sized pieces, roll out to the thickness of a pound coin and place over the filling. Trim away any excess, crimp the edges with a fork and pierce a little cross into the top. Brush over a little more milk or beaten egg, then place in the hot oven for 25 to 30 minutes, or until golden and piping hot through. Serve with a dollop of ketchup, your favourite seasonal greens and some ice-cold beers."
  ],
  "hash": "9788b02b6788d64aca5cd5fab438e2594730e3d0",
  "href": "http://www.jamieoliver.com/recipes/beef-recipes/aussie-humble-pie#52e4b3cfe4e114042d000003",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/1045_15_1390579538_lrg.jpg",
  "ingredients": [
    "0",
    "1 kg beef skirt, chopped into 1cm chunks",
    "sea salt",
    "freshly ground black pepper",
    "olive oil",
    "1 whole nutmeg, for grating",
    "2 large carrots, peeled",
    "2 red onions, peeled",
    "4 sprigs of fresh rosemary, leaves picked",
    "250 ml pale ale",
    "1 heaped tablespoon plain flour",
    "1 tablespoon tomato purée",
    "250 g button mushrooms",
    "1 large egg yolk, beaten , or semi-skimmed milk",
    "For the pastry:",
    "600 g plain flour, plus extra for dusting",
    "150 g cold unsalted butter, cubed, plus extra for greasing",
    "150 g Cheddar cheese"
  ],
  "keywords": [
    "beef",
    "skirt",
    "chunks",
    "salt",
    "black",
    "pepper",
    "olive",
    "oil",
    "nutmeg",
    "grating",
    "carrots",
    "red",
    "onions",
    "sprigs",
    "rosemary",
    "leaves",
    "picked",
    "pale",
    "ale",
    "heaped",
    "plain",
    "flour",
    "tomato",
    "button",
    "mushrooms",
    "egg",
    "yolk",
    "semiskimmed",
    "milk",
    "pastry",
    "extra",
    "dusting",
    "cold",
    "unsalted",
    "butter",
    "cubed",
    "greasing",
    "cheddar",
    "cheese"
  ],
  "title": "Aussie humble pie",
  "users": [
    null
  ]
}