{
  "hash": "7932951566a49e01c734aca94021e146d52041a9",
  "title": "Spinach Mushroom and Feta Crustless Quiche",
  "image": "http://www.budgetbytes.com/wp-content/uploads/2011/11/Spin-Mush-Crustless-Quiche-close1.jpg",
  "href": "http://www.budgetbytes.com/2011/11/spinach-mushroom-feta-crustless-quiche/",
  "extension": "Chrome",
  "firstAdded": "2016-02-12T14:55:33.317000",
  "users": [
    null
  ],
  "keywords": [
    "mushrooms",
    "garlic",
    "needed",
    "spray",
    "box",
    "frozen",
    "spinach",
    "eggs",
    "milk",
    "feta",
    "cheese",
    "parmesan",
    "mozzarella",
    "salt",
    "pepper"
  ],
  "directions": [
    "0",
    "Preheat your oven to 350 degrees. If your frozen spinach is not already thawed, thaw it in the microwave. Empty the box into a colander and let it drain while you begin to prepare the rest.",
    "Quickly rinse the mushrooms and slice them thinly. Place the sliced mushrooms in a skillet coated with non-stick spray, add the minced garlic, and sprinkle a little salt and pepper. Turn the heat on to medium-high and saute the mushrooms until they release all of their moisture and no more water remains on the bottom of the skillet (5-7 minutes).",
    "Spray a pie dish with non-stick spray. Squeeze the rest of the water out of the spinach and spread it out on the bottom of the pie dish. Next add the cooked mushrooms and crumbled feta.",
    "In a medium bowl whisk together the eggs until fairly smooth. Add the milk, parmesan, and another small sprinkle of pepper. Whisk to combine. (This step can be completed while the mushrooms are cooking) Pour this mixture into the pie dish over the spinach, mushrooms, and feta.",
    "Sprinkle the shredded mozzarella cheese over top. Place the pie dish on a baking sheet for easy transfer into the oven. Place the quiche into the preheated oven and bake until it is golden brown on top and the center is solid. Every oven is different but this should take between 45 minutes and an hour. Slice and serve!"
  ],
  "ingredients": [
    "0",
    "8 oz. fresh mushrooms $1.99",
    "½ tsp minced garlic $0.06",
    "as needed non-stick spray $0.02",
    "1 (10 oz.) box frozen spinach $1.09",
    "4 large eggs $0.83",
    "1 cup milk $0.39",
    "2 oz. feta cheese $0.87",
    "¼ cup grated parmesan $0.39",
    "½ cup shredded mozzarella $0.50",
    "to taste salt & pepper $0.05"
  ],
  "__v": 1
}