{
  "hash": "f5060647c5c325aae66f8aeb3c223062b37e397a",
  "title": "Blue Cheese Swirl Bread",
  "image": "https://static01.nyt.com/images/2018/12/13/dining/em-blue-cheese-bread/em-blue-cheese-bread-articleLarge.jpg",
  "href": "https://cooking.nytimes.com/recipes/1019851-blue-cheese-swirl-bread?em_pos=medium&emc=edit_ck_20190216&nl=cooking&nl_art=4&nlid=79859114emc%3Dedit_ck_20190216&ref=headline&te=1",
  "extension": "Firefox",
  "firstAdded": "2019-07-15T00:23:16.060000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium saucepan, heat the milk and butter over medium until the butter is melted. Add the cool water and stir to combine. The mixture should feel just warm to the touch (about 95 degrees). If needed, let cool before using.",
    "In the bowl of an electric mixer fitted with the dough hook attachment, combine the flour, yeast, salt and milk mixture on low speed, 3 minutes. Increase the speed to medium and continue to mix until smooth, another 3 minutes.",
    "Transfer the dough to a lightly greased medium bowl and cover the bowl with plastic wrap. Let rise for 1 hour in a warm place. Generously grease a 10-inch cast-iron or oven-safe skillet with about 1 1/2 tablespoons unsalted butter.",
    "On a lightly floured surface, roll the dough into a log about 22 inches long and 1 1/4 inches in diameter. Press the crumbled blue cheese into the log in a long stripe down the middle.",
    "Starting at one end, roll the log into a spiral (the blue cheese should mostly be folded inside the spiral). Place the dough into the prepared skillet. Cover with plastic wrap and let rise in a warm place until noticeably puffy, 35 to 45 minutes.",
    "Position a rack in the middle of the oven and one below. Heat the oven to 375 degrees. Uncover the dough, and brush the surface with heavy cream.",
    "Place a baking sheet on the lower rack of the oven to catch any cheese that may bubble over. Bake the bread on the middle rack until the bread is golden-brown, 30 to 35 minutes. (It should have an internal temperature of 195 degrees in the thickest part of the loaf.)",
    "Let cool for at least 15 minutes before serving. Serve warm or at room temperature."
  ],
  "ingredients": [
    "0",
    "1 cup/235 milliliters whole milk",
    "4 tablespoons/55 grams unsalted butter (1/2 stick), plus more for greasing",
    "½ cup/120 milliliters cool water",
    "4 cups/510 grams all-purpose flour",
    "2 ¼ teaspoons instant yeast",
    "1 teaspoon kosher salt",
    "7 ounces/200 grams creamy or firm blue cheese, crumbled",
    "Heavy cream, for brushing"
  ],
  "__v": 2
}