{
  "hash": "017051d8748dbe8fa4650a19a81b17ffb4ec1bd3",
  "title": "Beautiful veggie moussaka",
  "image": "//cdn.jamieoliver.com/recipe-database/oldImages/335_448/1041_36_1429006756.jpg",
  "href": "http://www.jamieoliver.com/recipes/vegetables-recipes/beautiful-veggie-moussaka/",
  "extension": "Chrome",
  "firstAdded": "2016-08-18T00:54:27.176000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Method",
    "I’ve taken this classic Greek recipe, usually made with lamb, and transformed it into a veggie delight for the lovely Amanda Holden – this dish is one of her favourite foodie memories from her childhood and it’s pretty damn good!",
    "Preheat the oven to 180ºC/350ºF/gas 4. Place the porcini in a small bowl, cover with boiling water, then set aside to soak. Finely slice the onions and garlic, then add to a large pan over a medium heat with a good lug of olive oil, the herbs and 1 teaspoon of oregano. Remove the porcini to a board, reserving the water for later, then roughly chop and add to the pan. Reduce the heat to medium-low and fry for around 10 minutes, or until softened but not coloured.",
    "Turn the heat up to high, then add the wine and allow to bubble and boil away. Stir in the chickpeas (juice and all), lentils, 2 bay leaves and the plum tomatoes, then strain in the porcini water. Season and gently bring to the boil, then reduce the heat to low and simmer for around 1 hour, or until thickened and reduced, stirring occasionally and breaking up the tomatoes with the back of a spoon.",
    "Meanwhile, peel the aubergines with a speed-peeler, leaving a little of the skin to create a stripy effect, then slice into rounds, roughly 1cm thick. Place into a colander, sprinkle with a good pinch of salt and leave aside in the sink to soak. Meanwhile, slice the potatoes into rough 1cm rounds, then parboil in a pan of boiling salted water for around 5 minutes. Drain and allow to steam dry, then place into a large roasting tray (roughly 30cm x 40cm). Season, drizzle with oil and scatter over 1 heaped tablespoon dried oregano, then toss well to coat and spread out into an even layer. Place in the hot oven for 30 to 40 minutes, or until golden and tender. Meanwhile, rinse the aubergines in cold water and pat dry with kitchen paper, then spread out into another large roasting tray. Drizzle with oil, then season with pepper and oregano and place alongside the potatoes in the oven for 30 to 40 minutes, or until golden and cooked through.",
    "Warm the milk with the remaining bay leaves and the peppercorns in a medium pan over a medium-low heat – you don’t want it to boil, so keep an eye it. Once hot, strain into a jug, then wipe the pan and return it to a medium heat. Add the butter and allow to melt, then stir in the flour to form a paste. Start adding the hot milk, a splash at a time, stirring in each before adding the next. Once all the milk has been added and you have a smooth and creamy sauce, crumble in one-third of the feta and grate in one-third of the kefalotyri or pecorino, then simmer over a low heat for a further 5 minutes, or until thick and smooth. Leave the béchamel aside to cool slightly.",
    "To assemble your moussaka, spoon half the ragù over the tray of roast potatoes and layer half the aubergines on top, then repeat with the remaining ragù and aubergines. Whisk the egg yolks into the béchamel sauce, then gently pour onto the aubergines in an even layer. Crumble and grate the remaining cheese on top, followed by a drizzle of oil, then place in the oven for 35 to 40 minutes, or until golden and bubbling. Leave to cool for around 30 minutes, then serve alongside a Greek salad."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "15\tg\tdried porcini",
    "2\tmedium\tonions\t, peeled",
    "2\tcloves of\tgarlic\t, peeled",
    "olive oil",
    "a few\tsprigs of\tfresh rosemary and sage\t, leaves picked",
    "dried oregano",
    "250\tml\tred wine",
    "2 x 400\tg tins of chickpeas",
    "100\tg\tdried brown lentils",
    "4\tfresh bay leaves",
    "2 x 400\tg tins of plum tomatoes",
    "sea salt",
    "freshly ground black pepper",
    "4\tlarge\tfirm aubergines\t, trimmed",
    "800\tg\tpotatoes\t, peeled",
    "750\tml\tsemi-skimmed milk",
    "5\tblack peppercorns",
    "75\tg\tunsalted butter",
    "75\tg\tplain flour",
    "50\tg\tfeta cheese",
    "50\tg\tkefalotyri or pecorino cheese",
    "2\tlarge\tfree-range egg yolks"
  ],
  "__v": 1
}