{
  "hash": "1f4cdd120ea222143f60ee504834517e2dc8380c",
  "title": "Healthy Baked French Fries with Garlic, Parmesan & Truffle Oil",
  "image": "https://www.ambitiouskitchen.com/wp-content/uploads/2016/02/Carrot-Cake-10.jpg",
  "href": "https://www.ambitiouskitchen.com/healthy-baked-french-fries-garlic-parmesan-truffle-oil/",
  "extension": "Firefox",
  "firstAdded": "2020-04-02T23:53:53.025000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 425 degrees F. Line two large baking sheets with parchment paper and generously spray with nonstick cooking spray.",
    "Cut potatoes into ¼” inch thick matchsticks.",
    "Place the cut potatoes into a large bowl and pat down with a paper towel to absorb any excess moisture. Next add olive oil, truffle oil, garlic, garlic powder and salt to the bowl, toss to combine. Sprinkle parmesan cheese on top and gently toss again.",
    "Arrange fries on the two prepared baking sheets so that none of the fries are touching. This will allow them to crisp up while they bake. Spray the top of the french fries with a little olive oil cooking spray.",
    "Place in oven, baking sheets side by side, and bake for 20 minutes, then flip fries over with a metal spatula and rotate the pans. Bake for 15-20 more minutes and flip again if necessary to brown all sides of the fries.",
    "Once fries are nice and golden brown, remove from the oven and allow to cool on baking sheets for 5 minutes. Then drizzle a little extra truffle oil on top and garnish with extra parmesan, cilantro or parsley.",
    "Season with additional salt and pepper, if you’d like! Serves with lots of ketchup or your favorite dipping sauce. Serves 4 people."
  ],
  "ingredients": [
    "0",
    "Olive oil cooking spray",
    "4 medium russet potatoes, washed and patted dry",
    "1 1/2 tablespoons olive oil or avocado oil",
    "½ tablespoon truffle oil (or olive oil/avocado oil)",
    "3 cloves garlic, finely minced",
    "½ teaspoon garlic powder",
    "½ teaspoon sea salt",
    "¼ cup grated parmesan cheese",
    "For topping:",
    "¼ cup chopped cilantro or parsley",
    "Extra truffle oil, for drizzling on top",
    "Freshly ground salt and pepper, to taste"
  ],
  "__v": 1
}