{
  "__v": 2,
  "directions": [
    "0",
    "Heat a large (12-inch or wider) wok, cast iron skillet or non-stick frying pan over medium-high heat. Once the pan is hot enough that a drop of water sizzles on contact, add 1 teaspoon of oil. Pour in the eggs and cook, stirring occasionally, until the eggs are scrambled and lightly set. Transfer the eggs to your empty bowl. Wipe out the pan if necessary with a paper towel (be careful, it's hot!).",
    "Add one tablespoon of oil to the pan and add the garlic, onions and optional additional vegetables. Cook, while stirring, for 30 seconds or longer, until fragrant or until the vegetables are tender. Add the kale and ¼ teaspoon salt. Continue to cook, stirring frequently, until the kale is wilted and tender, which will just take a couple of minutes. Transfer the contents of the pan to your bowl of eggs.",
    "Add the remaining two teaspoons of oil to the pan. Pour in the coconut flakes and cook, stirring frequently, until the flakes are lightly golden. Add the rice to the pan and cook, stirring occasionally, until the rice is hot, about 3 minutes.",
    "Pour the contents of the bowl back into the pan. Add your 2 teaspoons of tamari (or soy sauce) and hot sauce (chili garlic sauce or sriracha). Stir to combine, then transfer the contents to serving plates or back to your bowl. Squeeze the juice of ½ of a lime over the dish. Garnish with a sprinkling of torn cilantro leaves and wedges of lime, with jars of chili garlic sauce, sriracha and/or red pepper flakes on the side."
  ],
  "firstAdded": "2014-10-20T07:44:34.346000",
  "hash": "ef7798e6ba0172bc5dd6607a25f59935ceafee1b",
  "href": "http://cookieandkate.com/2014/spicy-kale-and-coconut-stir-fry/",
  "image": "http://cookieandkate.com/images/2014/06/spicy-thai-stir-fried-kale-with-coconut-and-rice.jpg",
  "ingredients": [
    "0",
    "2 tablespoons coconut oil or quality vegetable oil",
    "2 eggs, beaten with a dash of salt",
    "2 big cloves garlic, pressed or minced",
    "½ bunch green onions, green and white parts, thinly sliced (about ¾ cup)",
    "Optional: 1 cup thinly sliced vegetables, like bell pepper, carrot or Brussels sprouts",
    "1 medium bunch kale (preferably Lacinato but curly green is good, too), ribs removed and leaves finely shredded",
    "¼ teaspoon fine grain sea salt",
    "¾ cup unsweetened coconut flakes (not shredded coconut)",
    "2 cups cooked and chilled brown rice",
    "2 teaspoons reduced-sodium tamari or soy sauce",
    "2 teaspoons chili garlic sauce or sriracha",
    "1 lime, halved",
    "Fresh cilantro, for garnish"
  ],
  "keywords": [
    "coconut",
    "quality",
    "oil",
    "eggs",
    "salt",
    "garlic",
    "pressed",
    "bunch",
    "onions",
    "green",
    "white",
    "parts",
    "bell",
    "pepper",
    "carrot",
    "brussels",
    "sprouts",
    "medium",
    "kale",
    "preferably",
    "lacinato",
    "curly",
    "good",
    "ribs",
    "leaves",
    "chilled",
    "brown",
    "rice",
    "reducedsodium",
    "tamari",
    "soy",
    "chili",
    "sriracha",
    "lime",
    "cilantro"
  ],
  "title": "Spicy Kale and Coconut Stir Fry",
  "users": [
    null,
    null
  ]
}