{
  "hash": "3d966786927a73d37dd06356348890ed1161ea7a",
  "title": "Spargel-Shakshouka im Strudelteig",
  "image": "https://files.billa.at/fg/thema7/20160501_26_l.jpg",
  "href": "https://frischgekocht.billa.at/rezept/spargel-shakshouka-im-strudelteig-BI-25470",
  "extension": "Firefox",
  "firstAdded": "2018-01-03T13:06:23.175000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Holzige Enden vom Spargel entfernen, den grünen Spargel im unteren Drittel und den weißen Spargel von der Spitze nach unten schälen. Alle Spargelstangen der Breite nach halbieren. Grünen Spargel in kochendem Salzwasser 5 Minuten blanchieren, aus dem Wasser heben, kalt abschrecken und abtropfen lassen. Weißen Spargel und Zitronensaft in das Spargelwasser geben und die Stangen knapp unter dem Siedepunkt ca. 10 Minuten gar ziehen lassen.",
    "Währenddessen die Paprika halbieren, putzen und in Streifen schneiden. Cherrytomaten halbieren. 2 EL Olivenöl in einer Pfanne erhitzen und die Paprikastreifen darin farblos anschwitzen. Petersilie hacken. Chili putzen und in feine Ringe schneiden.",
    "Paprika, Spargel und Cherrytomaten in einer Schüssel mischen und mit Salz und Pfeffer würzen.",
    "Backrohr auf 180 °C (Umluft) vorheizen. Ein Strudelteigblatt auf einer Arbeitsfläche ausbreiten, mit Öl bepinseln, ein weiteres Blatt darauflegen, mit Öl bepinseln und mit einem dritten Blatt belegen. Vorgang mit den restlichen Strudelteigblättern (9 Stück) wiederholen, sodass 4 dreilagige Blätter entstehen. 4 ofenfeste Schüsseln (ca. 20 cm ø) mit dem restlichen Öl einfetten, jeweils mit einem dreilagigen Teigblatt auslegen und einen Rand formen. Die Gemüsemischung auf die Teigschüsseln verteilen. Jeweils eine Mulde ins Gemüse drücken und 1 Ei hineinschlagen. Schüsseln auf zwei Backbleche stellen und ca. 12 Minuten backen, bis der Teig knusprig und die Eier gestockt sind, eventuell nach der Hälfte der Backzeit die Bleche tauschen.",
    "Shakshouka mit Petersilie, Pfeffer und Chili bestreuen und servieren."
  ],
  "ingredients": [
    "0",
    "12",
    "Stangen",
    "grüner Spargel",
    "12",
    "Stangen",
    "weißer Spargel",
    "1",
    "EL",
    "Zitronensaft",
    "2",
    "rote Paprika",
    "250",
    "g",
    "Cherrytomaten",
    "10",
    "EL",
    "Olivenöl",
    "1",
    "Handvoll",
    "Petersilienblätter",
    "0,5",
    "rote Chili",
    "12",
    "Strudelteigblätter",
    "4",
    "Eier",
    "Salz",
    "schwarzer Pfeffer aus der Mühle"
  ],
  "__v": 1
}