{
  "hash": "709b9ae7b250c268e5874e980872ffb160a13f3e",
  "title": "2-Way Perfect Pineapple Upside-Down Cake",
  "image": "http://target.scene7.com/is/image/Target/c_2-Way-Perfect-Pineapple-Upside-Down-Cake_RT_newcrop?hei=340",
  "href": "http://www.cooking.com/recipes-and-more/recipes/2-way-perfect-pineapple-upside-down-cake-recipe?CCAID=cknwfhne06185av&s=s0085567335s&mid=2101020&rid=85567335",
  "extension": "Chrome",
  "firstAdded": "2015-03-26T19:55:49.714000",
  "users": [
    null
  ],
  "keywords": [
    "butter",
    "dark",
    "brown",
    "sugar",
    "patted",
    "dry",
    "pineapple",
    "pecan",
    "halves",
    "decoration",
    "nutty",
    "pecans",
    "center",
    "desired",
    "golden",
    "raisins",
    "cake",
    "flour",
    "salt",
    "baking",
    "soda",
    "egg",
    "oil",
    "sour",
    "cream",
    "vanilla"
  ],
  "directions": [
    "0",
    "Preheat oven to 350 degrees F. Combine melted butter and brown sugar in 9-inch round cake pan, stir until smooth, spread evenly around bottom and set pan aside.",
    "For Traditional Pineapple Ring Cake:",
    "Reserving one pineapple ring for center, cut remaining 9 rings to fit together around edge of pan. If you think of each ring as a clock, cut at approximately 12 and 4 o'clock. Place cut rings around edge of pan over brown sugar mixture, facing the same direction and fitting tightly against each other. Place whole ring in center and place pecan half in center, ridges down. Place remaining 9 pecan halves in remaining holes in a consistent pattern, ridges down.",
    "For Nutty Version:",
    "Place one whole pineapple ring in center of cake pan over brown sugar mixture and place pecan half in center, ridges down. Scatter chopped pecans evenly around pineapple ring to edges. Cut 6 pineapple rings into small pieces (you will have 3 leftover rings) and scatter pieces over nuts, fitting them so they are in one layer. Scatter raisins over pineapple and press down slightly. Set pan aside.",
    "For Cake:",
    "In a small bowl, combine flour, salt, baking soda and baking powder and whisk together until well mixed. Set aside. In large bowl, beat together egg and sugar at medium speed until lightened and smooth, about 1 minute. Add oil, sour cream and vanilla and beat until combined. Add half of the reserved dry ingredients and mix at lowest speed for 5 to 10 seconds until most of flour is incorporated. Add remaining dry ingredients and mix until just incorporated. Pour batter over prepared cake pan and carefully spread to edges. Tap pan firmly on counter to bring any air bubbles to surface. Place on baking sheet to catch any juices that may overflow and bake for 35 to 40 minutes or until cake is evenly browned and top springs back to touch. Toothpick inserted at center should come out clean. Allow cake to rest for 5 to 7 minutes. Run knife around edges of pan and turn out onto serving plate."
  ],
  "ingredients": [
    "0",
    "For Topping:",
    "5 tablespoons butter, melted",
    "1/3 cup dark brown sugar",
    "1 can (20 ounces) sliced pineapple, drained and patted dry, or sliced fresh pineapple",
    "Additional Topping for Traditional Version:",
    "10 pecan halves, for decoration",
    "Additional Topping for Nutty Version:",
    "1/3 cup chopped pecans, plus a pecan half for center, if desired",
    "1/3 cup golden raisins",
    "For Cake:",
    "1 cup flour",
    "1/4 teaspoon salt",
    "1/4 teaspoon baking soda",
    "1/2 teaspoon baking powder",
    "1 egg",
    "2/3 cup sugar",
    "1/3 cup vegetable oil",
    "1/3 cup sour cream",
    "1 teaspoon vanilla extract"
  ],
  "__v": 1
}