{
  "hash": "8667c0591762d63857562bde70f93ff9782a4175",
  "title": "Соус Терияки",
  "image": "http://povar.me/wp-content/uploads/2013/10/sous-teriyaki-3.png",
  "href": "http://povar.me/other-food/sousy/sous-teriyaki/",
  "extension": "Chrome",
  "firstAdded": "2017-03-22T11:33:32.603000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Как приготовить соус Терияки",
    "Весь процесс приготовления соуса Терияки можно разделить на 2 очень простых этапа — подготовка ингредиентов и варка соуса. Для приготовления Терияки больше ничего не потребуется, а сам процесс займет у вас не больше 5 минут, зато в конечном итоге вы получите настоящий соус Терияки, приготовленный собственноручно.",
    "На первом этапе необходимо смешать все ингредиенты в небольшой кастрюле. Для этого следует порубить чеснок и имбирь на мелкие дольки, либо натереть их на терке. Воду можно заранее смешать с 3 чайными ложками крахмала, либо добавлять одновременно со всеми ингредиентами.",
    "Как только все компоненты будущего соуса Терияки окажутся в одной емкости, необходимо поставить ее на медленный огонь, дождаться закипания и варить соус около 4-5 минут. Не стоит переживать о том, что соус не очень густой, как только он остынет, вы заметите, что его консистенция стала заметно гуще и дошла именно до того вида, каким и должен быть настоящий соус Терияки.",
    "Чтобы соус Терияки дольше оставался на вашем столе, мы рекомендуем перелить его в небольшую стеклянную емкость, с плотно закрывающейся крышкой. Благодаря этому вы еще долгое время сможете использовать соус Терияки, приготовленный в домашних условиях, для своих блюд!",
    "Кухня: ЯпонскаяТип блюда: Разное",
    "Автор рецепта: admin",
    "Баллы: 2373 | Рецепты: 222",
    "В ИЗБРАННОЕ",
    "ПОДЕЛИТЬСЯ РЕЦЕПТОМ",
    "РЕКОМЕНДУЕМ ПРИГОТОВИТЬ",
    "Томатный соус",
    "Домашний кетчуп",
    "Соус для пиццы",
    "Чимичури",
    "НОВОСТИ ОТ НАШИХ ПАРТНЕРОВ",
    "MrsFIFT говорит:",
    "СПАСИБО ОГРОМНОЕ!!! Я чуть язык не проглотила. Соус получился густой, потратила примерно 10 — 15 минут (ингредиенты у меня всегда дома такие есть). Нажарила рыбки с рисом. У меня даже дочь, ей 3 годика, с удовольствием облизала ложку, которой я размешивала соус.Да, я после закипания держала соус на огне меньше заявленного времени. т.к. испугалась что сгорит.",
    "Ответить на комментарийОценить комментарий: + 0 -",
    "Silvia Lewis говорит:",
    "Большое спасибо за рецепт!) Отдельное спасибо за таблицу мер и весов)",
    "Ответить на комментарийОценить комментарий: + 0 -",
    "Андрей Шевченко говорит:",
    "Скажите, а процеживать надо или просто так и оставить?",
    "Ответить на комментарийОценить комментарий: + 0 -",
    "Ольга Беляева говорит:",
    "сегодня приготовила. потратила минут 15 на все. чеснок и имбирь потерла на тёрочке для мускатного ореха, использовала красный винный уксус. соус загустел сразу после подогрева. и тоже варила меньше 5-ти минут. очень вкусно! мой придирчивый муж ложками его ел, с куриными крыльями. спасибо за рецепт!:-) 🙂 🙂",
    "Ответить на комментарийОценить комментарий: + 0 -",
    "Евгений Березов (автор) говорит:",
    "Безумно рады, что у вас все получилось и вы остались довольны результатом!)",
    "Оценить комментарий: + 0 -",
    "Ольга Нетес говорит:",
    "У меня почему-то получился мутный,не прозрачный((",
    "Ответить на комментарийОценить комментарий: + 0 -",
    "Katerina Plastinina говорит:",
    "Соус прикольный,только очень соленый. Я использовала соевый соус кикоман классический. Может быть его сильнее водой разбавить нужно?",
    "Ответить на комментарийОценить комментарий: + 0 -",
    "Roman Ilyin говорит:",
    "Возможно что тот соус что вы использовали был концентрированный.Надо смотреть на бутылке,если написано что концентрированный-то обычно для суши его разбавляют водой.",
    "Оценить комментарий: + 0 -",
    "Anna Vlasenkova говорит:",
    "Отличный соус! часто делаю, долго хранится, особенно хорош к свинине!",
    "Ответить на комментарийОценить комментарий: + 0 -",
    "Татьяна Разумкова говорит:",
    "сегодня приготовила. потратила минут 15 на все. чеснок и имбирь потерла на тёрочке для мускатного ореха, использовала красный винный уксус. соус загустел сразу после подогрева. и тоже варила меньше 5-ти минут. очень вкусно! мой придирчивый муж ложками его ел, с куриными крыльями.",
    "Ответить на комментарийОценить комментарий: + 0 -",
    "Ирина Яровая говорит:",
    "это не соус терияки а какаято упрощенная его имитация, в настоящий соус терияки входит: куриные кости, лук, морковь, шампиньоны, соевый соус, сахар, мирин, лимонный сок.",
    "Ответить на комментарийОценить комментарий: + 0 -",
    "Ирина Яровая говорит:",
    "ну и имбирь",
    "Ответить на комментарийОценить комментарий: + 0 -",
    "Александра Архипова говорит:",
    "Отличный соус получился) Спасибо! Вместо соевого соуса использую маринад Терияки.",
    "Ответить на комментарийОценить комментарий: + 0 -",
    "Валентина (автор) говорит:",
    "Безумно рады, что у вас все получилось и вы остались довольны результатом!)",
    "Оценить комментарий: + 1 -",
    "Ксения Шумило говорит:",
    "Такие нытики, как Вы вечно возникают по всякой ерунде, где Ваш рецепт? Сделаем, посмотрим, оценим. А то кудахтать все умеют.",
    "автору СПАСИБО!! Соус чудесный, очень вкусно, к рису, к мясу, к птице просто супер!! Делаю почти каждую неделю его, так как с мужем большие фанаты азиатской кухни",
    "Ответить на комментарийОценить комментарий: + 0 -",
    "Введите ваш комментарий...",
    "ЛУЧШЕЕ ПО ВРЕМЕНИ СУТОК",
    "Завтрак|Обед|Ужин",
    "Гречка с грибами",
    "Воздушная яичница",
    "Блины на молоке",
    "Морковные булочки с глазурью",
    "КУЛИНАРНЫЕ СТАТЬИ",
    "специи",
    "Как нарезать ананас",
    "Фисташково-миндальный рулет",
    "Тесто для пельменей",
    "10 фактов о клубнике",
    "10 полезнейших сочетаний продуктов, приносящих максимальную пользу",
    "НАЦИОНАЛЬНАЯ КУХНЯ"
  ],
  "ingredients": [
    "0",
    "1/2 стаканСоевый соус",
    "1/4 стаканТростниковый сахар",
    "1 шт.Чеснок(2 зубчика)",
    "1 ч.л.Имбирь",
    "1 ст.л.Мед",
    "1 ч.л.Оливковое масло",
    "1 ст.л.Мирин(или винный уксус)",
    "1/4 стаканВода",
    "3 ч.л.Крахмал"
  ],
  "__v": 1
}