{
  "hash": "4e40c299364c11322c26d89b6286c98ca16d5358",
  "title": "Arancini Al Ragu",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/arancini-al-ragu-recipe.print.html",
  "firstAdded": "2014-12-20T22:28:19.586000",
  "users": [
    null
  ],
  "keywords": [
    "beef",
    "stock",
    "unsalted",
    "butter",
    "salt",
    "saffron",
    "strands",
    "arborio",
    "rice",
    "parmesan",
    "pecorino",
    "pork",
    "pepper",
    "pancetta",
    "olive",
    "oil",
    "yellow",
    "onion",
    "carrot",
    "celery",
    "bay",
    "leaf",
    "white",
    "wine",
    "tomato",
    "puree",
    "dissolved",
    "water",
    "peas",
    "mozzarella",
    "cubes",
    "flour",
    "plain",
    "breadcrumbs",
    "canola",
    "frying"
  ],
  "directions": [
    "0",
    "For the rice: In a medium saucepot over high heat, add the beef stock, butter, salt and saffron. When the stock reaches a boil, add the rice and stir it a bit to prevent sticking. Let it come to a rolling boil and lower the heat a bit to medium. Stir the rice once in a while, you want the rice to absorb all of the liquid; it should take 15 to 20 minutes. Taste the rice; it should be slightly al dente but creamy. Remove the pot from the heat, add the cheeses and stir well. Pour the rice onto a baking sheet and spread into a thin layer. Cover with plastic wrap and let cool, preferably overnight in the fridge.",
    "For the ragu: Mix the ground beef and pork together with your hands and add salt and pepper generously. Set aside.",
    "In a medium saucepot over medium low heat, saute the pancetta with the olive oil until the fat is melted. Add the onions and let cook until soft, about 5 minutes. Add the carrot and celery along with the bay leaf and cook until soft, 7 to 10 minutes.",
    "Add the ground meat and turn the heat to high. Keep mixing with a wooden spoon until the meat is well done and browned. Add the white wine and stir until it is evaporated. Add the tomato puree and tomato paste in water. Bring to a boil, and then lower the heat to medium, stirring occasionally. There will be some fat that comes to the top. Skim it off with a ladle but you want to leave some for the flavor. Let cook for about 1 1/2 hours.",
    "About 5 minutes before the ragu is done, saute the peas in a touch of butter with a pinch of salt and add to the ragu. Put the ragu in a bowl and set aside to cool. You can leave it overnight covered in the fridge.",
    "For the filling and assembly: Portion out cooled rice into identical portions. We weigh ours to 1.6 ounces. Take one portion and form it into a semi-circle in the palm of your hand, making a cup-like shape to place the ragu and mozzarella into. Scoop a generous amount of ragu, about 2 teaspoons, into the half ball and then a few cubes of mozzarella. Take another portion of rice and flatten it into a disk shape. Place that disk over the half ball to enclose the ragu and cheese in the center. Have a bowl of warm water nearby to dip your hands into' it'll make the process easier and less sticky. Roll the ball around to enclose all ingredients in the center and shape into a perfectly round ball. Repeat with the remaining ingredients.",
    "For the batter and breading: Place the flour and 1 1/2 cups cold water into a bowl and add a pinch of salt. Mix with a whisk until smooth and about the consistency of eggnog. Add the breadcrumbs to a large bowl or baking dish. Roll each rice ball in the batter and shake off excess batter. Then roll each ball in the breadcrumbs. Repeat with all the balls.",
    "Use a heavy duty pot with enough canola oil to submerge the balls in. Make sure the oil isn't near the top of the pot because it will overflow when you drop your balls in. Bring the oil to 350 degrees F, using a high temp thermometer if you have one. If not you can throw a small piece of white bread in to test; it should brown quickly and float when the oil is hot enough.",
    "Use a slotted spoon or wire basket to lower your balls into the hot oil. Don't overcrowd the balls - maybe 2 or 3 at a time. Fry in batches until they are golden like arancini (\"little oranges\"), about 5 minutes. Remove and place on paper towels to drain. Eat hot.",
    "This recipe was provided by a chef, restaurant or culinary professional and may have been scaled down from a bulk recipe. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results.",
    "Recipe courtesy Arancini Brothers"
  ],
  "ingredients": [
    "0",
    "6 cups beef stock",
    "2 tablespoons unsalted butter",
    "1 teaspoon sea salt",
    "1/2 teaspoon saffron strands",
    "2 1/2 cups Arborio rice",
    "1/2 cup grated Parmesan",
    "1/2 cup grated Pecorino",
    "1 pound ground beef",
    "8 ounces ground pork",
    "Sea salt and freshly ground pepper",
    "4 ounces pancetta, finely chopped",
    "1 teaspoon olive oil",
    "1 small yellow onion, finely chopped",
    "1 small carrot, finely chopped",
    "1 celery stick, finely chopped",
    "1 bay leaf",
    "1/2 cup white wine",
    "1 cup tomato puree",
    "2 tablespoons tomato paste dissolved in 1 cup warm water",
    "3/4 cup peas",
    "1 tablespoon unsalted butter",
    "8 ounces mozzarella, cut into 1/4-inch cubes",
    "1 1/2 cups flour",
    "Salt",
    "2 cups plain breadcrumbs",
    "Canola oil, for frying"
  ],
  "__v": 1
}