{
  "hash": "52a8eb14cf08a96b1d7075889d8db5399ab38bcc",
  "title": "Peppermint Bark",
  "image": "http://sallysbakingaddiction.com/wp-content/uploads/2014/11/homemade-peppermint-bark-4.jpg",
  "href": "http://sallysbakingaddiction.com/2014/11/22/peppermint-bark/",
  "extension": "Chrome",
  "firstAdded": "2016-01-02T04:09:56.629000",
  "users": [
    null
  ],
  "keywords": [
    "high",
    "quality",
    "white",
    "chocolate",
    "broken",
    "pieces",
    "divided",
    "semisweet",
    "coconut",
    "canola",
    "oil",
    "peppermint",
    "regular",
    "size",
    "candy",
    "canes"
  ],
  "directions": [
    "0",
    "Directions:",
    "Line the bottom and sides of a 9-inch or 8-inch square baking pan with parchment paper or aluminum foil, smoothing out any wrinkles. Set aside.",
    "You can temper the chocolate or melt the chocolate without tempering. That is up to you. I melt the chocolate for this bark recipe. If tempering the chocolate, make sure the layers are never refrigerated. Allow them to set at room temperature. There are two ways you can melt the chocolate. You can use a double boiler over just barely simmering water or you can use the microwave. The double boiler is easier, but the microwave is a little more convenient for most people, so my directions are for a microwave. If you have a double boiler, you probably know how to use it! So, the KEY to melting chocolate in the microwave is to do it in small bursts and stir frequently. Chocolate overheats so fast, so easily. Melt 1/2 teaspoon of oil with 6 ounces of the white chocolate in a small heatproof bowl. Melt in 15 second increments, stirring vigorously with a rubber spatula or spoon after each increment, until completely melted and smooth. Make sure you scrape down the sides of the bowl to avoid scorching. Once melted, stir in 1/4 teaspoon peppermint extract. Pour melted white chocolate into the prepared baking pan, spreading with an offset spatula into a thin smooth layer. Place the baking pan in the refrigerator for 10-15 minutes or the freezer for about 8 minutes; or until almost completely set. If it sets completely, the bark layers could separate.",
    "Place the semi-sweet chocolate and 1/2 teaspoon of oil into a small heatproof bowl (or the double boiler) and microwave/stir in the same manner you did in step 2. Once melted, stir in remaining 1/4 teaspoon peppermint extract. Pour all of the semi-sweet chocolate over the white chocolate layer. Spread into a smooth layer. Place the baking pan back in the refrigerator for 10-15 minutes or the freezer for about 8 minutes; or until almost completely set.",
    "Place the remaining white chocolate and 1/2 teaspoon oil in a small heatproof bowl and microwave/stir in the same manner you did in step 2. Pour over the bark layers and spread into a smooth layer. (This layer will not have peppermint extract.) Sprinkle with crushed candy canes-- to crush, I usually do it in a food processor or stick the candy canes in a sealed ziplock bag and roll with a rolling pin until crushed.",
    "Refrigerate the bark until completely hardened. Once hardened, remove from the pan and peel off the foil or parchment. Break into pieces as large or as small as you want. Alternatively, you can cut squares. To do so, remove from the refrigerator and allow to sit at room temperature to slightly soften for 10-15 minutes. Use a very sharp knife and cut.",
    "Make ahead tip: Store bark in the refrigerator. Leftovers keep well in the refrigerator for up to 3 weeks. The bark can be left at room temperature for a few days in colder months, but it gets a little soft."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "12 ounces (339g) high quality white chocolate, broken into pieces and divided1",
    "6 ounces (170g) high quality semi-sweet chocolate, broken into pieces1",
    "1 and 1/2 teaspoons vegetable, coconut, or canola oil",
    "1/2 teaspoon peppermint extract, divided",
    "3 regular size candy canes, crushed"
  ],
  "__v": 1
}