{
  "hash": "7ca3a6f1f350aea58c1e34758e52985677a3e28e",
  "title": "baked macaroni and cheese cupcakes",
  "image": "http://www.giadadelaurentiis.com/img/Recipes/Large/GH0145_Baked_Macaroni_and_Cheese_Cupcakes_CU.jpg",
  "href": "http://www.giadadelaurentiis.com/recipes/631/baked-macaroni-and-cheese-cupcakes",
  "extension": "Chrome",
  "firstAdded": "2015-04-17T10:16:50.202000",
  "users": [
    null
  ],
  "keywords": [
    "baked",
    "macaroni",
    "cheese",
    "cupcakes",
    "cooking",
    "spray",
    "breadcrumbs",
    "pasta",
    "pennette",
    "shells",
    "elbows",
    "turkey",
    "chicken",
    "preferably",
    "dark",
    "meat",
    "olive",
    "oil",
    "extra",
    "drizzling",
    "kosher",
    "salt",
    "seasoning",
    "black",
    "pepper",
    "parmesan",
    "white",
    "cheddar",
    "cherry",
    "tomatoes",
    "broccoli",
    "cooks",
    "asparagus",
    "pieces",
    "blanche"
  ],
  "directions": [
    "0",
    "nstructions",
    "Baked Macaroni and Cheese Cupcakes",
    "Preheat the oven to 375 degrees F. Spray 2 12-cup muffin or cupcake pans with vegetable cooking spray. Using 1 cup of breadcrumbs, coat the inside of each muffin cup with breadcrumbs, shaking off any excess.",
    "In a medium skillet, heat 1 tablespoon of olive oil over medium-high heat. Add the ground turkey, or chicken, if using, 1/2 teaspoon salt, and 1/4 teaspoon pepper, Cook for 5 to 8 minutes, stirring frequently, until cooked through. Set aside and cover to keep warm.",
    "Bring a large pot of salted water to a boil over high heat. Add the pasta and cook until tender but still firm to the bite, stirring occasionally, about 8 to 10 minutes. Drain and place in a large bowl. Add the cooked turkey and the cheeses. Season with salt and pepper to taste. Spoon the prepared pasta mixture into the cupcake molds, filling evenly to about 2/3 full. Place a few pieces of tomato, broccoli and asparagus in each cup. Top with a thin layer of the remaining breadcrumbs and drizzle with olive oil.",
    "Bake for 15-20 minutes or until golden brown on top. Let cool for a few minutes and carefully unmold with a spoon.",
    "cook's notes",
    "To blanch vegetables, bring a large saucepan of salted water to a boil. Add the vegetables and cook for 1 to 2 minutes until very crisp. Using a small strainer, remove the vegetables and place immediately into a bowl of iced water. Drain and use."
  ],
  "ingredients": [
    "0",
    "Baked Macaroni and Cheese Cupcakes",
    "Vegetable cooking spray",
    "2 cups dried breadcrumbs",
    "8 ounces small pasta such as pennette, shells, or elbows",
    "8 ounces ground turkey or chicken, preferably dark meat",
    "1 tablespoon olive oil, plus extra for drizzling",
    "½ teaspoon kosher salt, plus extra for seasoning",
    "¼ teaspoon freshly ground black pepper, plus extra for seasoning",
    "2 cups grated Parmesan cheese",
    "1 ½ cups grated white cheddar cheese",
    "1 cup cherry tomatoes, quartered",
    "2 cups chopped broccoli, blanched, see Cook's Note",
    "1 pound asparagus, cut into ¾-inch pieces, blanche"
  ],
  "__v": 1
}