{
  "hash": "0eaf71938641e892027d4678af2d1c444db9647c",
  "title": "Chilled Spring Pea Soup",
  "image": "http://cdn-image.foodandwine.com/sites/default/files/styles/200x250/public/200807-r-chilled-pea-soup.jpg?itok=rfeLfk3s",
  "href": "http://www.foodandwine.com/recipes/chilled-spring-pea-soup",
  "extension": "Chrome",
  "firstAdded": "2015-05-08T19:03:25.008000",
  "users": [
    null
  ],
  "keywords": [
    "slices",
    "bacon",
    "extravirgin",
    "olive",
    "oil",
    "celery",
    "ribs",
    "onion",
    "leek",
    "white",
    "tender",
    "green",
    "parts",
    "chicken",
    "stock",
    "lowsodium",
    "broth",
    "rosemary",
    "sprigs",
    "salt",
    "pepper",
    "sugar",
    "snap",
    "peas",
    "boxes",
    "frozen",
    "baby",
    "flatleaf",
    "parsley",
    "leaves",
    "cream",
    "garlic",
    "clove"
  ],
  "directions": [
    "0",
    "In a medium soup pot, cook the bacon over moderate heat until browned and crisp, about 6 minutes. Transfer the bacon to a plate. Pour off the fat in the pot.",
    "In the same pot, heat the olive oil. Add the celery, onion and leek and cook over moderately low heat, stirring occasionally, until softened but not browned, about 7 minutes. Add the chicken stock, 4 slices of the cooked bacon, 1 rosemary sprig and a pinch each of salt and white pepper. Simmer until the vegetables are very tender, about 15 minutes. Discard the bacon and rosemary. Using a slotted spoon, transfer the vegetables to a blender.",
    "Meanwhile, bring a medium saucepan of salted water to a boil. Add the sugar snaps and cook for 3 minutes. Add the frozen baby peas and the parsley and cook just until heated through, about 1 minute; drain. Add the sugar snaps, baby peas and parsley to the blender and puree until smooth, adding a few tablespoons of the broth to loosen the mixture. Transfer the soup and the remaining broth to a large bowl set in a larger bowl of ice water to cool.",
    "In a small saucepan, bring the heavy cream, garlic and remaining rosemary sprig to a boil. Simmer over low heat until slightly reduced, about 5 minutes. Strain the garlic cream into a bowl and let cool.",
    "Ladle the chilled pea soup into bowls and drizzle with the garlic cream. Crumble the remaining 4 slices of bacon into each bowl and serve."
  ],
  "ingredients": [
    "0",
    "8 slices of bacon",
    "1 tablespoon extra-virgin olive oil",
    "2 celery ribs, thinly sliced",
    "1 onion, thinly sliced",
    "1 leek, white and tender green parts only, thinly sliced",
    "5 cups chicken stock or low-sodium broth",
    "Two 4-inch rosemary sprigs",
    "Salt and freshly ground white pepper",
    "1/2 pound sugar snap peas, thinly sliced",
    "Two 10-ounce boxes frozen baby peas",
    "1/4 cup flat-leaf parsley leaves",
    "1 cup heavy cream",
    "1 garlic clove, minced"
  ],
  "__v": 1
}