{
  "hash": "b2e42dd818092a1947b7c37fa00956ece379f53f",
  "title": "Cranberry Pear Pie",
  "image": "http://assets.tillamook.com/image/7127/980/530",
  "href": "http://www.tillamook.com/recipes/cranberry-pear-pie.html?utm_source=2014-thanksgiving&utm_medium=email&utm_campaign=2014-consumer-emails",
  "firstAdded": "2014-11-20T21:01:17.754000",
  "users": [
    null
  ],
  "keywords": [
    "crust",
    "allpurpose",
    "flour",
    "salt",
    "tillamook",
    "unsalted",
    "butter",
    "cold",
    "chunks",
    "natural",
    "sour",
    "cream",
    "egg",
    "filling",
    "pears",
    "cranberries",
    "sugar",
    "cinnamon",
    "orange",
    "zest"
  ],
  "directions": [
    "0",
    "Directions",
    "STEP 1",
    "In a large bowl, combine the flour and salt for the crust. Add the butter and quickly work it into the flour with your fingers until the largest chunks of butter are about the size of a hazelnut. Add the sour cream, using fingers to combine.",
    "STEP 2",
    "Once the dough comes together, transfer it to a floured surface, divide and flatten into two round disks, about 1 inch thick. Cover in plastic wrap and refrigerate for at least 1 hour.",
    "STEP 3",
    "While the dough is chilling, peel and core each pear, then slice into ¼ inch thick slices. Place the pears in a bowl, add the cranberries, sugar, flour, cinnamon, and orange zest and toss well to combine.",
    "STEP 4",
    "Preheat the oven to 400°F. On a floured surface, roll one dough disk out into a round sheet, about ¼ inch thick.",
    "STEP 5",
    "Transfer the dough to a lightly greased 9-inch pie dish. Press the dough into the bottom of the dish and trim off the excess dough (there should still be about ½ inch hanging off the side all the way around). Tuck the overhang under the dough to create a thick edge, and use your fingers to crimp.",
    "STEP 6",
    "Pour the filling into the pie shell, and dot the top with butter.",
    "STEP 7",
    "Roll out the remaining dough to ¼ inch thick. Cut into 12 1-inch wide 9-inch long strips. Arrange 6 strips across the pie. Weave the remaining strips across the pie in the opposite direction, making sure the second layer of strips are woven under then over (to create a basket weave).",
    "STEP 8",
    "Whisk the egg and gently brush it over the pie dough. Bake for 15 minutes, then lower the temperature to 350°F and finish baking, for 25 to 30 minutes until crust is golden brown and the juices being to bubble.",
    "STEP 9",
    "Cool completely before serving with a big scoop of Tillamook Oregon Hazelnut and Salted Caramel Ice Cream!"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Crust",
    "2 cups all-purpose flour",
    "½ teaspoon salt",
    "½ cup (1 stick) Tillamook Unsalted Butter, cold & cut into chunks",
    "½ cup Tillamook Natural Sour Cream",
    "1 egg",
    "Filling",
    "5 pears",
    "½ cup cranberries",
    "½ cup sugar",
    "2 tablespoons all-purpose flour",
    "1 teaspoon cinnamon",
    "1 teaspoon orange zest",
    "2 tablespoons Tillamook Unsalted Butter, cold"
  ],
  "__v": 1
}