{
  "hash": "55b404ccc35d1218f10d99afdc9a57dc26f5e23a",
  "title": "fried cinnamon apple rings",
  "image": "http://fortunegoodies.com/wp-content/uploads/2013/12/Fried-Cinnamon-Apple-Rings-fortune-goodies1.jpg",
  "href": "http://fortunegoodies.com/cinnamon-apple-rings/",
  "extension": "Firefox",
  "firstAdded": "2015-05-13T23:53:50.442000",
  "users": [
    null
  ],
  "keywords": [
    "apples",
    "used",
    "gala",
    "flour",
    "baking",
    "sugar",
    "salt",
    "cinnamon",
    "egg",
    "buttermilk",
    "oil",
    "frying"
  ],
  "directions": [
    "0",
    "In a large bowl, combine the flour, baking powder, sugar, salt and ⅛ teaspoon cinnamon. Set aside.",
    "In a small bowl combine the egg and buttermilk. In a third dish, make your cinnamon-sugar topping by combining the ⅓ cup sugar and 2 teaspoons cinnamon. Set that aside too.",
    "Next, slice the apples into ¼-inch thick slices, and use circle biscuit cutters in graduated sizes to make rings out of each slice. Discard the center circles containing the apple core.",
    "Pat the apple rings down with a paper towel to remove excess moisture.",
    "Heat the oil in a frying pan over medium heat to 350°F.",
    "Combine the contents of the first and second dishes as the oil warms up. This will be your batter.",
    "Dip the apple rings in and out of the batter one at a time, removing any dripping excess by tapping the rings against the side of the bowl.",
    "Fry the rings in small batches, turning them to ensure browning on both sides.",
    "Once the rings are golden and crispy, transfer them to a plate lined with paper towel for a few seconds.",
    "Quickly transfer the apple rings, one by one, into the cinnamon-sugar mixture and coat evenly.",
    "Transfer to a wire rack and serve warm."
  ],
  "ingredients": [
    "0",
    "4 large apples (I used gala)",
    "1 cup flour",
    "¼ teaspoon baking powder",
    "2 tablespoons sugar",
    "¼ teaspoon salt",
    "⅛ teaspoon cinnamon",
    "1 large egg, beaten",
    "1 cup buttermilk",
    "vegetable oil for frying",
    "1",
    "⅓ cup sugar",
    "2 teaspoons cinnamon"
  ],
  "__v": 1
}