{
  "hash": "0734bfb664c0d557333c6cea6f7b784d0f3ecdf3",
  "title": "Crispy, Cheesy, Tahini-Roasted Cauliflower",
  "image": "https://images.food52.com/oT3LdirP9aAp1xJobl6hMyNt9kg=/753x502/514ceeff-683b-43f9-a1c3-a5069c656033--2017-1018_crispy-cheesy-tahini-roasted-cauliflower_julia-gartland-022.jpg",
  "href": "https://food52.com/recipes/71312-crispy-cheesy-tahini-roasted-cauliflower",
  "extension": "Chrome",
  "firstAdded": "2018-01-26T22:39:43.949000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat oven to 475 degrees F. Place a parchment-lined sheet pan or casserole dish (one that’s large enough to hold the cauliflower in a single, even layer) in the oven while it heats. The hot pan will help the cauliflower to get nicely browned and crispy.",
    "Cut the cauliflower into quarters. Slice each quarter into 1/4-inch flat pieces. You’re looking for large pieces – but smaller ones are fine, too, as long as they’re the same thickness. Season the cauliflower with kosher salt, to taste.",
    "Set up a dredging station. In one pie plate or shallow dish, mix together tahini and olive oil. In a second dish, mix together panko, pecorino, thyme, and a generous amount of black pepper, to taste.",
    "Working with a few slices of cauliflower at a time, coat both sides in the tahini-olive oil mixture (letting any excess drip back into the pan), then coat both sides generously with the panko mixture. Dredge the remaining cauliflower in the same way. If needed, mix together just enough additional tahini or panko mixtures to coat all of the cauliflower slices.",
    "Working quickly, carefully transfer the cauliflower pieces to the preheated sheet pan. (Careful, the pan will be hot!) Roast until golden and crispy (about 20 minutes or so) on both sides, flipping the cauliflower about halfway through the roasting time.",
    "Lightly sprinkle sumac (if using) over the cauliflower. Serve warm."
  ],
  "ingredients": [
    "0",
    "1 large head of cauliflower, trimmed",
    "kosher salt, to taste",
    "1/2 cup tahini, well-stirred",
    "2 tablespoons olive oil",
    "1 cup panko",
    "1/2 cup finely grated pecorino romano",
    "1 tablespoon finely chopped fresh thyme",
    "1/2 teaspoon freshly ground black pepper (or to taste)",
    "sumac, optional for serving (if you have it, great, but no need to buy it if you don't)"
  ],
  "__v": 1
}