{
  "hash": "01662d13c3fb5fdd92ebbffde516b2cfb2b80d71",
  "title": "white bean + chicken enchilada stuffed peppers",
  "image": "http://www.howsweeteats.com/wp-content/uploads/2013/08/epeps-1.jpg",
  "href": "http://www.howsweeteats.com/2013/09/white-bean-chicken-enchilada-stuffed-peppers/",
  "extension": "Chrome",
  "firstAdded": "2017-08-06T05:33:55.935000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 degrees F.",
    "Slice the tops off of the peppers. Cut around the stems and chop the surrounding pieces. Remove the seeds and any stem inside of the peppers. Place the peppers cut-side up in a baking dish.",
    "Heat a large skillet over medium-low heat and add olive oil. Add in what was left from chopping over the tops of the peppers, the onions, jalapeño and garlic. Stir and cook until softened, about 5 minutes. Add in the chicken and the beans and stir to coat. Stir in the cilantro. Pour in 1/2-1 cup of the enchilada sauce and 2 ounces of the cheese. Stir until the cheese is melted and the mixture has come together. Evenly spoon the mixture into the peppers. [Don't worry if you have extra - save it for lunch!] Pour the rest of the enchilada sauce into the dish to surround the peppers and over top of the peppers. Add the remaining cheese on top of each pepper. Bake for 30 to 35 minutes, until the cheese is golden and bubbly.",
    "avocado cream",
    "To make the avocado cream, combine all ingredients in a food processor or blender until creamy and smooth. Taste and season additionally if desired."
  ],
  "ingredients": [
    "0",
    "4 medium sized bell peppers",
    "2 tablespoons olive oil",
    "1 jalapeno pepper, seeded and diced",
    "1/4 red onion, diced",
    "2 garlic cloves, minced",
    "2 boneless, skinless chicken breasts, cooked and shredded",
    "2/3 cup cannellini beans",
    "1/4 cup fresh cilantro",
    "4 cups enchilada sauce",
    "6 ounces monterey jack cheese, freshly grated",
    "avocado cream",
    "1 ripe avocado, sliced",
    "3 tablespoons plain greek yogurt or sour cream",
    "1 lime, juiced",
    "1/4 teaspoon salt",
    "1/4 teaspoon pepper"
  ],
  "__v": 1
}