{
  "hash": "be0da516ee520c0936b1ae63a14fca7b7e942bfa",
  "title": "Chocolate Frosted Peanut Butter Bars",
  "image": "http://www.cookingclassy.com/wp-content/uploads/2015/02/peanut-butter-bars4-srgb..jpg",
  "href": "http://www.cookingclassy.com/2015/02/chocolate-frosted-peanut-butter-bars/",
  "extension": "Chrome",
  "firstAdded": "2015-08-30T00:29:21.096000",
  "users": [
    null
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "quick",
    "oats",
    "baking",
    "soda",
    "salt",
    "unsalted",
    "butter",
    "softened",
    "lightbrown",
    "sugar",
    "granulated",
    "eggs",
    "creamy",
    "peanut",
    "vanilla",
    "pieces",
    "cocoa",
    "milk",
    "pinches"
  ],
  "directions": [
    "0",
    "Preheat oven to 350 degrees. Butter a rimmed 18 by 13-inch cookie sheet. In a mixing bowl whisk together flour, oats, baking soda and salt for 20 seconds. Set aside.",
    "In the bowl of an electric stand mixer fitted with the paddle attachment, blend together butter, brown sugar and granulated sugar until creamy. Mix in eggs one at a time. Blend in 1 cup peanut butter and the vanilla. With mixer set on low speed, slowly add in flour mixture and mix just until combined.",
    "Drop cookie dough onto prepared baking sheet. Spray hands with non-stick cooking spray and spread dough into an even layer. Bake in preheated oven 12 - 15 minutes until golden (careful not to over-bake or edges will be dry, don't wait for it to be golden brown. They should be puffed and beginning to set but still soft).",
    "Remove from oven and cool 5 minutes, then dollop remaining 1 cup peanut butter by spoonfuls over top. Let sit 1 minute then spread peanut butter into an even layer to cover top.",
    "Melt butter in a medium saucepan. Stir in cocoa, milk and salt and bring mixture just to a boil over medium heat. Remove from heat and whisk in vanilla, then stir in powdered sugar and mix until well combined (if needed you can add 1 Tbsp hot water to thin). Immediately pour over bars and spread into an even layer. Allow frosting to set then cut into squares. Store in an airtight container.",
    "Recipe source: adapted from Taste of Home and others"
  ],
  "ingredients": [
    "0",
    "2 cups (10 oz) all-purpose flour",
    "2 cups (6.4 oz) quick oats",
    "1 tsp baking soda",
    "1/2 tsp salt",
    "1 cup (8 oz) unsalted butter, softened",
    "1 1/4 cups (9.5 oz) packed light-brown sugar",
    "3/4 cup (5.7 oz) granulated sugar",
    "2 large eggs",
    "1 cup (8.6 oz) creamy peanut butter",
    "1 tsp vanilla extract",
    "1 cup (8.6 oz) creamy peanut butter",
    "1/2 cup (4 oz) unsalted butter, diced into 1 Tbsp pieces",
    "1/4 cup (26g) unsweetened cocoa powder",
    "1/4 cup (2 oz) milk",
    "2 pinches salt",
    "1 tsp vanilla extract",
    "3 cups (12.8 oz) powdered sugar"
  ],
  "__v": 1
}