{
  "hash": "2c1ddf08dffa2a9b009a42c8c2199ba07aef170b",
  "title": "Black Bean-Salmon Stir-Fry",
  "image": "http://www.drweilonhealthyaging.com/hya/file/ew_black+bean+salmon.jpg?id=4604",
  "href": "http://www.drweilonhealthyaging.com/hya/ecs/subpage/recipedetail.html?docid=RCP02053",
  "extension": "Chrome",
  "firstAdded": "2016-01-26T03:35:16.728000",
  "users": [
    null
  ],
  "keywords": [
    "water",
    "rice",
    "vinegar",
    "black",
    "beangarlic",
    "shao",
    "hsing",
    "wine",
    "dry",
    "sherry",
    "cornstarch",
    "red",
    "pepper",
    "canola",
    "oil",
    "salmon",
    "skinned",
    "tip",
    "cubes",
    "mung",
    "bean",
    "sprouts",
    "bunch",
    "scallions"
  ],
  "directions": [
    "0",
    "Whisk water, vinegar, black bean-garlic sauce, rice wine (or sherry), cornstarch and crushed red pepper in a small bowl until combined.",
    "Heat oil in a large nonstick skillet over medium-high heat. Add salmon and cook, stirring gently, for 2 minutes. Add bean sprouts, scallions and the sauce mixture (the pan will be full). Cook, stirring, until the sprouts are cooked down and very tender, 2 to 3 minutes.",
    "TIP: How to skin a salmon fillet: Place salmon fillet on a clean cutting board, skin-side down. Starting at the tail end, slip the blade of a long knife between the fish flesh and the skin, holding down firmly with your other hand. Gently push the blade along at a 30° angle, separating the fillet from the skin without cutting through either. Notes: Black bean-garlic sauce, a savory, salty sauce used in Chinese cooking, is made from fermented black beans, garlic and rice wine. Find it in the Asian-foods section of some supermarkets or at Asian markets. The \"cooking sherry\" sold in many supermarkets can be surprisingly high in sodium. We prefer dry sherry, sold with other fortified wines in your wine or liquor store."
  ],
  "ingredients": [
    "0",
    "1/4 cup water",
    "2 tablespoons rice vinegar",
    "2 tablespoons black bean-garlic sauce (see Note)",
    "1 tablespoon Shao Hsing rice wine or dry sherry (see Note)",
    "2 teaspoons cornstarch",
    "Pinch of crushed red pepper",
    "1 tablespoon canola oil",
    "1 pound salmon, skinned (see Tip) and cut into 1-inch cubes",
    "12 ounces mung bean sprouts (6 cups)",
    "1 bunch scallions, sliced"
  ],
  "__v": 1
}