{
  "hash": "991b45eb9360f0fbcccc813372bd62afbb1e0f6c",
  "title": "Easy Cheesy Chili Dip",
  "image": "http://cdn.averiecooks.com/wp-content/uploads/2014/10/cheesychilidiptext.jpg",
  "href": "http://www.averiecooks.com/2014/10/easy-cheesy-chili-dip.html",
  "firstAdded": "2015-01-23T23:48:55.243000",
  "users": [
    null
  ],
  "keywords": [
    "brickstyle",
    "cream",
    "cheese",
    "lite",
    "okay",
    "chili",
    "use",
    "similar",
    "size",
    "favorite",
    "brand",
    "mccormick",
    "cumin",
    "red",
    "pepper",
    "used",
    "monterrey",
    "try",
    "mozzarella",
    "jack",
    "fontina",
    "chips",
    "crackers",
    "bread"
  ],
  "directions": [
    "0",
    "Place an oven rack on the second-highest rung and preheat oven to broil setting.",
    "To a medium microwave-safe bowl, add the cream cheese and heat for 30 seconds to soften.",
    "Add the chill, cumin, optional crushed red pepper, and stir to combine.",
    "Cover bowl with plasticwrap and heat for about 90 seconds on high power, or until chili is warmed through and nearly bubbling.",
    "Transfer mixture to a broiler-safe baking dish and evenly sprinkle with cheese.",
    "Broil for 2 to 5 minutes, or until cheese has melted and is lightly golden and bubbly; broiling times will vary. Watch dip very closely so it doesn't burn. I kept oven door closed for the first two minutes and then keep door cracked for the remaining minutes so I can watch dip like a hawk.",
    "Serve immediately with chips, crackers, or bread. Dip is best warm and fresh but will keep airtight in the fridge for up to 3 days; reheat gently in micro as desired. For parties you can make dip in a slow cooker and keep it warm for hours. You won't get the broiled cheese effect, but you can sprinkle with cheese as desired."
  ],
  "ingredients": [
    "0",
    "4 ounces brick-style cream cheese (lite is okay)",
    "14.7-ounce can chili (use similar size of your favorite brand, or about 2 cups homemade)",
    "1/2 teaspoon McCormick Ground Cumin",
    "pinch McCormick Crushed Red Pepper, optional and to taste",
    "about 1/2 cup shredded cheese (I used Monterrey Jack; or try mozzarella, Pepper Jack, Fontina)",
    "chips, crackers, or bread for serving"
  ],
  "__v": 1
}