{
  "hash": "b9e2989e556c6bc7ccffe13d58feaa501f5b449a",
  "title": "Vegan shepherd’s pie",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/1250_15_1421150944_lrg.jpg",
  "href": "http://www.jamieoliver.com/recipes/vegetables-recipes/vegan-shepherd-s-pie/",
  "firstAdded": "2015-01-23T19:53:06.100000",
  "users": [
    null
  ],
  "keywords": [
    "maris",
    "piper",
    "potatoes",
    "salt",
    "black",
    "pepper",
    "dairyfree",
    "margarine",
    "onion",
    "carrots",
    "garlic",
    "celery",
    "coriander",
    "seeds",
    "olive",
    "oil",
    "bunch",
    "thyme",
    "chestnut",
    "mushrooms",
    "sundried",
    "tomatoes",
    "balsamic",
    "vinegar",
    "vegan",
    "red",
    "wine",
    "organic",
    "stock",
    "tin",
    "lentils",
    "chickpeas",
    "sprigs",
    "flatleaf",
    "parsley",
    "rosemary",
    "zest",
    "lemon",
    "breadcrumbs"
  ],
  "directions": [
    "0",
    "Preheat the oven to 200°C/400°F/gas 6.",
    "Peel and chop all the potatoes into rough 2cm chunks. Place the Maris Pipers into a large pan of cold salted water over a medium heat. Bring to the boil, then simmer for 10 to 15 minutes, or until tender, adding the sweet potatoes after 5 minutes. Drain and leave to steam dry, then return to the pan with the margarine and a pinch of salt and pepper. Mash until smooth, then set aside.",
    "Peel and finely slice the onion, carrots and 2 garlic cloves, then trim and finely slice the celery. Bash the coriander seeds in a pestle and mortar until fine, then add it all to a medium pan over a medium heat with a good splash of olive oil. Pick in the thyme leaves, then cook for around 10 minutes, or until softened.",
    "Meanwhile, roughly chop the mushrooms and sun-dried tomatoes. Add to the pan along with the vinegar and 2 tablespoons of the sun-dried tomato oil from the jar. Cook for a further 10 minutes then add a splash of wine, turn up the heat, and allow it to boil and bubble away. Stir in the stock, lentils and chickpeas (juice and all), then leave it to tick away for 5 to 10 minutes, or until slightly thickened and reduced. Pick and roughly chop the parsley leaves, then stir into the pan. Season to taste, then transfer to a large baking dish (roughly 25cm x 30cm).",
    "Spread the mash over the top, scuffing it up with the back of a spoon. Finely slice the remaining garlic clove, then place into a bowl with the rosemary leaves, lemon zest, breadcrumbs and 1 tablespoon of olive oil. Mix well, sprinkle over the mash, then place in the hot oven for around 10 minutes, or until piping hot through. Place under the grill for a further 2 to 3 minutes, or until golden, then serve with your favourite greens.",
    "Find more vegan recipes",
    "For another great take on vegan shepherd's pie, check out this Food Tube video"
  ],
  "ingredients": [
    "0",
    "600 g Maris Piper potatoes",
    "600 g sweet potatoes",
    "sea salt",
    "freshly ground black pepper",
    "40 g dairy-free margarine",
    "1 onion",
    "2 carrots",
    "3 cloves of garlic",
    "2 sticks of celery",
    "1 tablespoon coriander seeds",
    "olive oil",
    "½ a small bunch of thyme",
    "350 g chestnut mushrooms",
    "12 sun-dried tomatoes",
    "2 tablespoons balsamic vinegar",
    "vegan red wine",
    "100 ml organic vegetable stock",
    "1 x 400 g tin of lentils",
    "1 x 400 g tin of chickpeas",
    "5 sprigs of fresh flat-leaf parsley",
    "2 sprigs of fresh rosemary",
    "zest of 1 lemon",
    "30 g fresh breadcrumbs"
  ],
  "__v": 1
}