{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 400 degrees.",
    "In a large skillet, cook and crumble the sausage until brown. Remove from skillet and drain on a paper towel. Pour off any excess fat. Add onions and bell peppers to the skillet and cook over medium-high heat until the veggies are soft and golden brown, about 7-8 minutes. Remove from heat and set aside.",
    "To build the skillet, place 1/3 of the cheese in a medium-sized ovenproof skillet. Add half the sausage. Add another third of the cheese, then as much of the veggie mixture as you'd like (you may have a little left over.) Add almost all of the remaining cheese, the rest of the sausage, then whatever cheese you have left. Sprinkle the top very lightly with chili powder.",
    "NOTE: Depending on the size of your skillet or baking dish, you may have some ingredients left over. Just build so that the ingredients roughly reach the top of the skillet; they'll shrink quite a bit once the cheese melts!",
    "Place into the oven and start watching it about 4 to 5 minutes in. You want to bake it until the cheese is totally melted, hot, and slightly bubbling...but before the cheese starts to firm up/harden. (In other words, you still want the cheese to be extra gooey.)",
    "Remove from the oven, top with the diced tomatoes, sprinkle on the tomatoes, and serve immediately with tortilla chips!",
    "NOTE: Be sure to have everything ready so you can serve the queso fundido pretty much right out of the oven. It's best when piping hot!",
    "IMPORTANT: Wrap a cloth around the skillet handle so guests won't burn themselves."
  ],
  "firstAdded": "2014-07-22T21:22:51.990000",
  "hash": "7c26fe16a2cb6b6042449d394ea04606e8e3c593",
  "href": "http://thepioneerwoman.com/cooking/2014/01/queso-fundido/",
  "image": "http://tastykitchen.com/recipes/wp-content/uploads/sites/2/2014/01/DSC_5482-420x279.jpg",
  "ingredients": [
    "0",
    "1/2 pound Hot Breakfast Sausage (such As Jimmy Dean Or J.C. Potter) Or Chorizo",
    "1 whole Medium Onion, Finely Diced",
    "2 whole SMALL Bell Peppers (any Color Combination), Seeded And Finely Diced",
    "1 pound Monterey Jack, Grated (OR Mozzarella, Or Other Stringy Melting Cheese), Grated",
    "Sprinkle Of Chili Powder",
    "3 whole Roma Tomatoes, Diced",
    "1/4 cup Cilantro, Chopped",
    "Tortilla Chips For Serving"
  ],
  "keywords": [
    "hot",
    "breakfast",
    "sausage",
    "jimmy",
    "dean",
    "potter",
    "chorizo",
    "medium",
    "onion",
    "bell",
    "peppers",
    "color",
    "combination",
    "seeded",
    "monterey",
    "jack",
    "mozzarella",
    "stringy",
    "melting",
    "cheese",
    "sprinkle",
    "chili",
    "roma",
    "tomatoes",
    "cilantro",
    "tortilla",
    "chips"
  ],
  "title": "Queso Fundido",
  "users": [
    null
  ]
}