{
  "hash": "7dfadbf0401b790af95b9031290ae007ac727e46",
  "title": "Ligurian Pesto with Spaghetti",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/ligurian-pesto-with-spaghetti",
  "extension": "Chrome",
  "firstAdded": "2016-11-02T19:56:42.657000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparation",
    "Bring a large pot of lightly salted water to a boil. Set a colander in a large bowl of ice water (this will make it easier to strain the basil later). Working in batches, blanch basil for 10 seconds. Using a large slotted spoon, transfer basil to colander in ice water; let cool completely. Set aside 1/2 cup blanching water. Reserve pot with blanching water.",
    "Drain basil by lifting colander from ice water. Using your hands, squeeze excess water from basil; transfer basil to paper towels. (You should have about 1/2 cup.)",
    "Place blanched basil, 1/2 cup Parmesan, pine nuts, and garlic in a food processor. Pulse until well combined, adding blanching water by tablespoonfuls to thin if needed, and stopping occasionally to scrape down sides. Process until a smooth, thick purée forms, about 1 minute.",
    "Transfer basil mixture to a medium bowl. Stir in 1/2 cup oil. Season to taste with salt.",
    "Return water in pot to a boil; add more salt. Cook spaghetti, stirring occasionally, until al dente. Spoon 1/2 cup pesto and 1/4 cup pasta cooking liquid into a large bowl. Using tongs, transfer spaghetti to bowl and toss vigorously, drizzling with oil and adding more pesto and cheese as you continue to toss, until spaghetti is glossy and well coated with sauce. Season with salt. Divide among bowls; sprinkle with cheese."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "4 TO 6 SERVINGS",
    "Kosher salt",
    "10 cups (loosely packed) fresh basil leaves (about 2 bunches)",
    "1/2 cup finely grated Parmesan plus more",
    "1 1/2 tablespoons pine nuts",
    "1 garlic clove, coarsely chopped",
    "1/2 cup mild extra-virgin olive oil plus more for drizzling",
    "1 pound spaghetti"
  ],
  "__v": 1
}