{
  "hash": "f59e52fc644fab681094f8246e47760209534529",
  "title": "Bosnian Bean Soup (Grah)",
  "image": "https://bakingwithsibella.files.wordpress.com/2013/02/017.jpg?w=656",
  "href": "https://bakingwithsibella.com/2013/02/20/bosnian-bean-soup-grah/",
  "extension": "Chrome",
  "firstAdded": "2018-12-11T13:24:45.516000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparation:",
    "*** Soaking the beans in cold water over night will reduce the cooking time.",
    "If you have pre-soaked the beans, rinse them, place in a large cooking pot and go to number 1.",
    "If you didn’t soak the beans, place them in a cooking pot, add water and let it boil for a few minutes, rinse and add fresh water.",
    "Finely chop onion, carrot and the bell pepper. Add it to the beans and let it boil. Reduce the temperature to medium, cover the pot slightly and let it cook for about 1 hour. Occasionally check if water level has decreased, add additional water to always keep the same level of liquid in the pot.",
    "After 1 hour add all spices and cubed smoked meat (polish sausage or similar can be used too, but then you will add them at the last half hour of cooking time). Cook for another 1 to 1.5 hours. To check if beans are ready take a few out of the pot and squeeze them between your thumb and index finger. If they are soft and creamy, and the peel comes off they are ready. The soup will look thick and it will smell wonderfully.",
    "Now add tomato paste and let it incorporate well into the soup.",
    "It is time now to make the roux to thicken the soup.",
    "Peel and finely chop 3-4 garlic cloves. Using medium setting, heat 2 TBSP oil in a small frying pan. Toss the chopped garlic in oil just until fragrant.",
    "Add flour and mix it with a wooden spoon until all crumbs disappear and flour starts changing its color to a very light brown. Now add paprika and again mix well. Pour the roux into the soup. This might produce a lively reaction. Give it a nice stir, reduce the heat and cook for another 5 minutes. Taste and add more salt if needed.",
    "Serve warm with a slice of a nice, crusty bread.",
    "This soup freezes well and keeps well in the fridge for at least 3-4 days."
  ],
  "ingredients": [
    "0",
    "500 g (17 oz) dry peruano beans",
    "1-2 l water",
    "1 medium onion",
    "1 medium carrot",
    "1/4 of a green bell pepper",
    "250 g (9 oz) smoked beef (cubed)",
    "1 TSP salt",
    "1 TSP vegeta",
    "1/4 TSP fresh ground black pepper",
    "Bay leaf (optional)",
    "1 TBSP tomato paste",
    "2 TBSP cooking oil",
    "3-4 garlic cloves (finely chopped)",
    "2 TBSP flour",
    "1 TSP ground paprika"
  ],
  "__v": 1
}