{
  "hash": "50e4f70da32b6d5d892dea383fc0c6b5dcd7505e",
  "title": "Lemon Chia Seed Scones",
  "image": "http://plain-drink.flywheelsites.com/wp-content/uploads/2015/07/lemon-chia-seed-scones-1.jpg",
  "href": "http://www.fooduzzi.com/2015/07/lemon-chia-seed-scones/",
  "extension": "Chrome",
  "firstAdded": "2016-02-28T14:02:37.740000",
  "users": [
    null
  ],
  "keywords": [
    "chia",
    "seeds",
    "water",
    "almond",
    "flour",
    "extra",
    "needed",
    "baking",
    "soda",
    "salt",
    "maple",
    "syrup",
    "coconut",
    "oil",
    "zest",
    "lemon"
  ],
  "directions": [
    "0",
    "Add chia seeds and water to a small bowl. Mix to combine and set aside to \"gel\" for about 10 minutes.",
    "Meanwhile, preheat oven to 350 degrees F. Line a baking sheet with parchment paper.",
    "In a large bowl, combine almond flour, baking soda, and salt. Whisk to combine, being sure to get all of the clumps out of the almond flour, then set aside.",
    "In a medium bowl, add maple syrup, coconut oil, and lemon zest, and stir to combine. Pour into dry ingredients and mix. Add extra almond flour if your mixture is too wet until the mixture just comes together and is only slightly sticky (I needed about 2 Tbsp).",
    "Dump mixture onto parchment paper. Top with another sheet of parchment paper, and flatten until circular and about 1-inch thick. If necessary, shape mixture into a circle.",
    "Bake for 15 minutes. Remove and slightly let cool. Cut into scones (see pictures) and bake for another 10 minutes, or until the bottoms are slightly brown.* Remember that scones will continue cooking on the baking sheet. Remove, and allow scones to cool completely."
  ],
  "ingredients": [
    "0",
    "1 Tbsp. chia seeds",
    "3 Tbsp. warm water",
    "1 cup + ¼ cup almond flour (plus extra, if needed)",
    "¼ tsp. baking soda",
    "¼ tsp. salt",
    "2 Tbsp. maple syrup",
    "2 Tbsp. + 2 tsp. melted coconut oil",
    "zest of 1 small lemon"
  ],
  "__v": 1
}