{
  "hash": "70ca0529c4e2d309544181043762e601d173a1f0",
  "title": "Shrimp Scampi",
  "image": "http://recipe-folder.com/img/recipe-images/016/116/801470116.gif",
  "href": "https://www.simplyrecipes.com/recipes/shrimp_scampi/print/",
  "extension": "Chrome",
  "firstAdded": "2018-12-23T18:38:26.918000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Sauté garlic, red pepper flakes, in butter and olive oil: Heat a sauté pan on high heat then reduce to medium high heat. Swirl the butter and olive oil into the pan. After the butter melts it will foam up a bit then subside. If using unsalted butter, sprinkle a little salt in the pan. Stir in the slivered garlic and red pepper flakes.",
    "Add shrimp and wine: Sauté the garlic for just a minute, until it begins to brown at the edges, then add the shrimp.",
    "Add the wine and stir to coat the shrimp with the sauce of butter, oil, and wine.",
    "Move the shrimp so they are in an even layer in the pan. Increase the heat to high and boil the wine for two to three minutes.",
    "3 Turn shrimp over to cook on the other side: Stir the shrimp and arrange them so that you turn them over to cook on the other side. Continue to cook on high heat for another minute.",
    "4 Toss with parsley, lemon juice, pepper: Remove the pan from the heat. Sprinkle the shrimp with parsley, lemon juice, and black pepper, and toss to combine.",
    "Serve as is, or with crusty bread, over pasta, or over rice (for gluten-free version)."
  ],
  "ingredients": [
    "0",
    "1 pound large (16-20 count) raw shrimp, shelled* and de-veined, (if you want, keep the tail on for an attractive presentation)",
    "2 Tbsp olive oil",
    "2-3 Tbsp butter",
    "Salt",
    "3-4 garlic cloves, slivered, or 1 Tbsp minced garlic",
    "1/4 to 1/2 teaspoon red pepper flakes (less or more to taste)",
    "1/2 cup white wine (I recommend a dry white wine such as a Sauvignon Blanc)",
    "2 tablespoons finely chopped parsley",
    "Freshly ground black pepper to taste",
    "1 Tbsp lemon juice"
  ],
  "__v": 1
}