{
  "hash": "dff8a02e2ed827b8838b08ae053924b09e69a093",
  "title": "BIBIMBAP",
  "image": "",
  "href": "https://www.markbittman.com/recipes-1/bibimbap",
  "extension": "Chrome",
  "firstAdded": "2020-03-01T13:02:35.992000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Put 6 tablespoons soy sauce, the Asian pear, garlic, ginger, and 2 tablespoons sugar into a food processor or blender and process until pureed. Mix with the sliced beef and white parts of the scallions and marinate at room temperature while you prepare the rest of the dish, or up to 8 hours in the refrigerator.",
    "Make the sauce: Put the remaining 2 tablespoons soy sauce, remaining tablespoon sugar, 3 tablespoons gochujang, and 4 tablespoons sesame oil in a small bowl and whisk until combined.",
    "Put 3 tablespoons vegetable oil in a skillet over high heat. When it’s hot, add the rice, and press into an even layer. Cook, undisturbed, until the rice smells toasted—you will know—but not burned, 10 to 15 minutes. Remove from the heat.",
    "Heat 2 tablespoons vegetable oil in another large skillet over medium-high heat. When it’s hot, add the bean sprouts and toss a few times to coat. Cook, undisturbed, until they begin to sputter, just a couple minutes; then stir them around a bit. Sprinkle with the chile flakes and salt and pepper and stir again, adding a few drops of water if they’re starting to stick to the pan. Stir once or twice more. The bean sprouts are ready when barely tender and the chile is fragrant, a couple minutes total. Transfer to a bowl and mix with the vinegar and scallion greens. The mixture will pickle slightly while it sits.",
    "Add the spinach to the skillet a handful at a time, stirring as you go, and cook until tender, less than a minute. Add the remaining 2 tablespoons sesame oil and cook until the spinach is soft and the pan is dry, another minute or 2. Transfer to a bowl, taste, and adjust the seasoning.",
    "Lift about half the beef from the marinade, letting any excess liquid drip off, and add it to the skillet. Turn the heat to high, and cook, stirring a few times, until it’s lightly browned but still pink inside, 1 to 2 minutes. Transfer to a bowl and repeat with the remaining beef, adding more oil as necessary. Taste and add a little salt if you’d like and lots of pepper.",
    "Add the remaining tablespoon vegetable oil to the skillet. When it’s hot, crack in the eggs. As soon as the whites turn opaque—in about a minute—turn the heat to low and sprinkle with salt and pepper. Cook the fried eggs until the whites are completely firm with the yolks as runny as you prefer, 3 to 5 minutes. Carefully transfer them to a plate.",
    "To serve, break the rice into chunks and divide among 4 bowls. Add the components in individual mounds of beef, spinach, pickled bean sprouts, and fresh carrots; finally, top each serving with a fried egg. Serve immediately, passing the gochujang sauce at the table."
  ],
  "ingredients": [
    "0",
    "8 tablespoons soy sauce",
    "1 small Asian pear, cored, peeled, and cut into chunks",
    "2 garlic cloves, peeled",
    "One 1-inch piece fresh ginger, peeled and cut into chunks",
    "3 tablespoons turbinado sugar",
    "1 pound boneless rib-eye steak, thinly sliced",
    "2 scallions, white and green parts separated and sliced",
    "3 tablespoons gochujang, or more to taste",
    "6 tablespoons dark sesame oil",
    "6 tablespoons good-quality vegetable oil, or as needed",
    "4 cups cooked short-grain white rice",
    "2 cups bean sprouts",
    "1 teaspoon Korean red chile flakes, or pinch cayenne",
    "Salt and pepper",
    "3 tablespoons rice vinegar",
    "10 ounces spinach leaves",
    "4 eggs",
    "2 carrots, peeled and cut into matchsticks"
  ],
  "__v": 1
}