{
  "hash": "60b24a45eab2e1efbbf043afcf950f82e88ac1ef",
  "title": "Honey-Mustard Glazed Ham",
  "image": "",
  "href": "http://www.chowhound.com/recipes/honey-mustard-glazed-ham-13715",
  "extension": "Firefox",
  "firstAdded": "2015-12-08T19:05:20.501000",
  "users": [
    null
  ],
  "keywords": [
    "smoked",
    "bonein",
    "ham",
    "honey",
    "wholegrain",
    "mustard",
    "dark",
    "brown",
    "sugar",
    "unsalted",
    "butter"
  ],
  "directions": [
    "0",
    "Instructions",
    "1Heat the oven to 350°F and arrange a rack in the lower third. Remove any plastic packaging or netting from the ham. Trim away any excess fat, leaving about a 1/4-inch layer all over. Set the ham aside to rest at room temperature for 30 minutes.",
    "2Line a baking sheet with several sheets of aluminum foil (it will make cleanup a lot easier). Place the ham, cut side down, on the baking sheet and cover it with a piece of parchment paper. Tightly cover the ham and parchment paper with aluminum foil and bake for 45 minutes.",
    "3Meanwhile, combine the remaining ingredients in a small saucepan over medium-low heat, stirring occasionally, until the butter melts and the brown sugar has completely dissolved, about 3 minutes. Set aside and let cool to lukewarm (the glaze should be the consistency of room-temperature honey).",
    "4When the ham is ready, remove it from the oven and increase the oven temperature to 425°F. Discard the foil and parchment paper and, using a sharp knife, score a 1-inch-wide diamond pattern (don’t cut more than 1/4 inch deep) over the entire ham.",
    "5Brush the ham with a quarter of the glaze (about a generous 1/3 cup), return it to the oven, and bake uncovered for 15 minutes. Remove from the oven, brush with another quarter of the glaze, and repeat every 15 minutes until all of the glaze has been used and a dark golden-brown crust has formed, about 55 to 60 minutes total. Let the ham rest 20 to 30 minutes before slicing."
  ],
  "ingredients": [
    "0",
    "Ingredients (5)",
    "1 (10-pound) smoked, bone-in ham",
    "1 cup honey",
    "1/4 cup whole-grain mustard",
    "1/4 cup packed dark brown sugar",
    "4 tablespoons unsalted butter (1/2 stick)"
  ],
  "__v": 1
}