{
  "hash": "62288d30a7d7cfba91892719dae29fd74d5e5dcf",
  "title": "Schab w cebuli",
  "image": "//static.smaker.pl/photos//e/6/4/e646953a168240b895f28a5b49f42ab5_268246_560d5bd39ef15_wm.jpg",
  "href": "http://smaker.pl/przepis-schab-w-cebuli,105070,anetas197601.html",
  "extension": "",
  "firstAdded": "2016-09-16T18:45:24.893000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "W 1/2 l wody zagotować liście laurowe, ziele angielskie, czosnek, przyprawę do kiełbasy myśliwskiej oraz sól. Pogotować ok. 15 minut. Przelać wodę z przyprawami do naczynia, w którym będzie się mięso peklować. Dolać ok. 1,5l wody, tyle żeby mięso było całe przykryte.",
    "Mięso umyć osuszyć i pozbawić błonek.",
    "Mięso włożyć do zimnej solanki, obciążyć np. talerzem żeby nie wypływało i odstawić w chłodne miejsce na ok. 5 dni (u mnie było to 7 dni bo jeszcze kończyliśmy poprzednią produkcję :)) Codziennie mięso odwracać w solance, żeby się dobrze i równo zapeklowało.",
    "Mięso wyciągnąć z solanki, umyć i osuszyć.",
    "Na patelni rozpuścić masło, cebule pokroić w kostkę i przyrumienić na maśle.",
    "Na dno szynkowaru wyłożyć połowę cebuli. Schab położyć na cebuli i przykryć pozostałą cebulą. Zamknąć szynkowar. W garnku na dnie położyć ściereczkę, wstawić szynkowar i uzupełnić wodą po rant szynkowaru. Gotować. Od momentu gdy woda osiągnie temperaturę 80 stopni gotować 2 godziny. Następnie szynkowar wyjąć z wody i odstawić do wystygnięcia, gdy wystygnie wstawić do lodówki. Gdy dobrze stężeje wyjąć schab.",
    "Jeżeli chcemy schab jeść na gorąco np do obiadu to po wyjęciu szynkowara z wody należy go otworzyć, odlać płyn, wyjąć mięso i kroić na porcje.",
    "Smacznego"
  ],
  "ingredients": [
    "0",
    "1,2 kg schabu",
    "3 cebule",
    "1łyżka masła klarowanego",
    "1 łyżka soli peklowej + 1 łyżka zwykłej soli",
    "2 liście laurowe",
    "4 ziela angielskie",
    "2 łyżki przyprawy do kiełbasy myśliwskiej",
    "3 ząbki czosnku"
  ],
  "__v": 1
}