{
  "hash": "17937cfaaf770b7c9af71994579cf58036eb000e",
  "title": "Dick's Amazing Stuffed Clams",
  "image": "http://ds.serving-sys.com/BurstingCachedScripts/Res/blank_1X1.gif",
  "href": "http://www.foodandwine.com/recipes/dicks-amazing-stuffed-clams",
  "extension": "Chrome",
  "firstAdded": "2015-12-18T16:07:22.314000",
  "users": [
    null
  ],
  "keywords": [
    "pepperoni",
    "chorizo",
    "sausage",
    "quahogs",
    "chowder",
    "clams",
    "scrubbed",
    "italian",
    "casings",
    "unsalted",
    "butter",
    "onion",
    "celery",
    "green",
    "bell",
    "pepper",
    "dry",
    "bread"
  ],
  "directions": [
    "0",
    "Preheat the oven to 350°. Put the pepperoni and chorizo in a food processor and pulse until crumbly. Transfer to a bowl. .",
    "In a large pot, bring 2 inches of water to a boil. Add the clams, cover and steam over high heat until they open, about 5 minutes. Transfer the clams to a bowl. Pour the broth into a glass measuring cup, stopping when you reach the grit at the bottom. Remove the clams from their shells. Separate the shells and reserve. Discard the round muscles on both sides of each clam; quarter the clams. In a food processor, coarsely chop the clams.",
    "In a large nonstick skillet, cook the Italian sausage over moderate heat, breaking up the clumps; stir until no pink remains, about 5 minutes. Scrape the sausage into a large bowl.",
    "Melt the butter in the skillet. Add the onion, celery and bell pepper and cook over moderately high heat, stirring occasionally, until the vegetables are softened and browned, about 5 minutes. Add the reserved pepperoni and chorizo and cook, stirring, until heated through, about 2 minutes. Scrape the mixture into the large bowl. Add the diced bread and the clams and stir in 2 cups of the reserved clam broth. Lightly pack the stuffing into the shells.",
    "Arrange the stuffed clams on 2 large baking sheets and cover with foil. Bake for 30 minutes. Uncover and bake for 5 minutes longer, or until lightly browned and crisp on top. Serve."
  ],
  "ingredients": [
    "0",
    "One 6-inch pepperoni (5 ounces), chopped",
    "One 2-ounce chorizo sausage, chopped",
    "15 quahogs or chowder clams, scrubbed",
    "1 pound sweet Italian sausage, casings removed",
    "1 stick (4 ounces) unsalted butter",
    "1/2 cup minced onion",
    "1/2 cup minced celery",
    "1/2 cup minced green bell pepper",
    "6 cups dry finely diced bread"
  ],
  "__v": 1
}