{
  "hash": "be3b52986c0593fe5423846845c370d0440f3b1a",
  "title": "Tasting Table's Matzagna",
  "image": "http://a.abcnews.com/assets/images/font-sm_off2.gif",
  "href": "http://abcnews.go.com/GMA/recipe/matzagna-recipe-tasting-table-23244979?nwltr=GMAR_featurePic",
  "extension": "Chrome",
  "firstAdded": "2015-03-27T21:07:52.410000",
  "users": [
    null
  ],
  "keywords": [
    "eggplants",
    "extravirgin",
    "olive",
    "oil",
    "kosher",
    "salt",
    "black",
    "pepper",
    "anchovy",
    "dark",
    "meat",
    "chicken",
    "cornstarch",
    "red",
    "onion",
    "ginger",
    "jalapeno",
    "chile",
    "chiles",
    "roughly",
    "cilantro",
    "juice",
    "limes",
    "sheets",
    "egg",
    "matzahs",
    "hot",
    "stock",
    "water",
    "cooking",
    "spray",
    "radishes"
  ],
  "directions": [
    "0",
    "Preheat oven to 400 degrees F and heat a grill pan over high heat. Cut eggplants in half lengthwise, drizzle liberally with olive oil on the cut side, and season with salt and pepper. Place the eggplant cut-side down on the grill pan and cook until well charred, about 2 minutes. Place charred eggplant cut-side up on a parchment-lined tray and bake in the oven until completely tender, about 25 minutes. When the eggplants are cool enough to handle, scoop out the flesh with a large spoon, discarding the eggplant skins, and transfer to the bowl of the food processor. Add the anchovy paste and pulse until smooth.",
    "In a medium mixing bowl, combine the ground chicken, cornstarch, 2 teaspoons of salt and 2 teaspoons of pepper and mix thoroughly. Heat 3 tablespoons of olive oil in a large skillet over high heat until shimmering but not smoking. Cook the chicken mixture in two batches until just cooked through, about 2 to 3 minutes per batch. With a slotted spoon, transfer the cooked chicken to a bowl. Add 2 tablespoons of olive oil to the now-empty skillet. Add the red onion, ginger and jalapeno chiles and cook on high heat for 1 minute. Remove the onion mixture from the pan and combine with the cooked chicken. Let the mixture cool at room temperature for about 10 minutes. Stir in 2 cups of roughly chopped cilantro and the juice of 2 limes and season to taste with additional salt and pepper.",
    "Pour the hot chicken stock into a 9-inch by 9-inch baking dish. Soak each matzah in the stock for 1 minute, then transfer to a plate. (The chicken stock can be strained and used for another purpose.)",
    "To assemble: Spray a 9-inch by 13-inch glass or metal baking dish with non-stick cooking spray. Cover the bottom of the baking dish with a layer of soaked matzahs. The matzahs can be cut or broken into smaller pieces to fit. Spread a layer of the eggplant mixture over the matzahs, followed by a thin layer of the cooked chicken mixture. Repeat the layering process 2 more times. Bake in the oven until heated through, about 8 to 10 minutes.",
    "In a small mixing bowl, combine radish and the remaining 1 cup cilantro. Season with salt and the juice of the remaining lime. Cut the matzagna into squares and serve with a spoonful of radish salad alongside.",
    "Recipe courtesy TastingTable.com."
  ],
  "ingredients": [
    "0",
    "2 large eggplants",
    "Extra-virgin olive oil",
    "Kosher salt",
    "Freshly ground black pepper",
    "4 teaspoons anchovy paste",
    "2 pounds ground dark meat chicken",
    "2 teaspoons cornstarch",
    "2 cups finely chopped red onion",
    "2 tablespoons grated ginger",
    "6 tablespoons minced jalapeno chile (from about 3 chiles)",
    "3 cups roughly chopped cilantro",
    "Juice of 3 limes",
    "7 sheets egg matzahs",
    "3 cups hot chicken stock or water",
    "Non-stick cooking spray",
    "1 cup thinly sliced radishes"
  ],
  "__v": 1
}