{
  "hash": "5a96da1f507baa1ce79d540115379ad710129d45",
  "title": "Instant Pot Old-Fashioned Pot Roast",
  "image": "https://breadboozebacon.com/wp-content/uploads/2017/11/Instant-Pot-Old-Fashioned-Pot-Roast-4.jpg",
  "href": "https://breadboozebacon.com/instant-pot-old-fashioned-pot-roast/",
  "extension": "Chrome",
  "firstAdded": "2019-02-25T01:35:42.278000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Remove roast from package and pat dry with a paper towel. Season liberally with salt and pepper on all sides.",
    "Turn your Instant Pot on to saute. Once hot, add the vegetable oil to the vessel. Place the roast in the hot pan and sear on each side for 5 minutes until browned. Remove the roast to a plate and set aside.",
    "Add onions to the vessel. Cook for 3 minutes until softened. Stir occasionally, scraping the brown bits off the bottom of the pan.",
    "Add the beef broth, tomato paste, and bay leaves to the onions. Stir until the tomato paste is incorporated. Add the roast back to the pan. Cover and lock the lid in place. With the valve on sealing, use the manual option to set the Instant Pot to high pressure for 75 minutes.",
    "Once the cooking is done. Let the pressure release naturally for 15 minutes. Then do a quick release of the remaining pressure. (I use a kitchen towel when moving the valve to prevent steam burns.) Take the roast out of the pan and place it on a plate or cutting board. Cover with foil and set aside.",
    "Remove the bay leaves and add the carrots and potatoes to the vessel. Cover and lock the lid in place. With the valve on sealing, use the manual option to set the Instant Pot to high pressure for 3 minutes. After the cooking has finished, do a quick release of the pressure. Use a slotted spoon to transfer the vegetables to a bowl. Sprinkle with parsley and gently toss.",
    "In a medium bowl, mix together the flour and water until smooth. Then, pour the liquid from the Instant Pot vessel through a strainer. Discard any solids. Pour the cooking liquid into a fat separator. Pour 1/2 cup of the cooking liquid into the flour mixture and the rest into the vessel. DO NOT pour the fat back in. Stir the flour mixture until it form a slurry and is well combined. Pour the slurry into the vessel.",
    "Turn the Instant Pot to saute and bring the gravy to a boil, whisking often. Cook until boiling and thickened. Turn off the pressure cooker. Transfer the gravy to a gravy boat.",
    "Uncover the pot roast and cut into large serving pieces. (I discarded any big pieces of fat that were on their own.) Plate the pot roast on a serving platter. If desired, plate the carrots and potatoes around the edge of the serving platter around the pot roast, or serving the vegetables in their own serving bowl. Pour some of the gravy over the pot roast and reserve the rest for diners. Serve immediately."
  ],
  "ingredients": [
    "0",
    "3 pound chuck roast",
    "1 tablespoon vegetable oil",
    "1 cup brown or yellow onion, diced",
    "14.5 ounces low-sodium beef broth",
    "1 tablespoon tomato paste",
    "2 bay leaves",
    "3 medium carrots, peeled and cut into 2-inch pieces",
    "6 red potatoes, cut into quarters",
    "1 tablespoon fresh parsley, finely chopped",
    "1/4 cup all-purpose flour",
    "1/4 cup water",
    "Salt and pepper"
  ],
  "__v": 1
}