{
  "hash": "3705320851838465287ac3e20bb3b33900481b43",
  "title": "Black Bean Mushroom Burgers",
  "image": "https://cdn.plantbasedcooking.com/wp-content/uploads/2016/04/black-bean-mushroom-burger.jpg",
  "href": "https://www.plantbasedcooking.com/recipe/black-bean-mushroom-burger/",
  "extension": "Chrome",
  "firstAdded": "2018-02-20T20:52:43.387000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat over to 375 degrees.",
    "Soak sun-dried tomatoes in about 1/2 cup hot water for 10 minutes. Drain. In the meantime, heat water over medium-high heat in a large skillet. Add onion and cook until golden, about 3 to 4 minutes. Stir in mushrooms, garlic, cumin and cook until mushrooms have released their juices, about 4 to 6 minutes. Add red wine and soy sauce and cook to reduce in half. Remove from heat and set aside to cool slightly.",
    "Tear toasted bread into pieces and place in food processor. Process until broken down into crumbs. Pour the crumbs into a medium bowl. Add the mushroom mixture and beans to the food processor along with the sun dried tomatoes; pulse until combined, but not smooth. Leave some chunky bits. Scoop mixture into the bowl with the bread crumbs; season with salt and pepper.",
    "Mix ingredients together and divide into 4 equal portions. With dampened hands, shape each portion into four thick patties. Place burgers on a cookies sheet lightly coated with cooking spray and brown burgers on one side, about 5 minutes. Flip to brown on the other side and heat through.",
    "Enjoy with all of the burger fixins’."
  ],
  "ingredients": [
    "0",
    "1/4 cup water",
    "1 cup copped onions",
    "8 oz mushrooms, roughly chopped roughly chopped",
    "1/2 cup red wine",
    "1/3 cup soy sauce",
    "7-8 non oil-packed sun dried tomatoes or enough for about about 1/4 cup",
    "1 clove garlic minced",
    "1/2 tsp cumin",
    "3 slices whole wheat sandwich bread lightly toasted",
    "15 ounce can black beans rinsed and drained",
    "salt and pepper to taste"
  ],
  "__v": 1
}