{
  "hash": "b389ce14ddddbda3c75028b6911f26876d5e6b33",
  "title": "Gluten & Grain Free Irish Soda Bread.",
  "image": "http://brittanyangell.com/wp-content/uploads/2013/03/lunapic_136347264490402_7.jpg",
  "href": "http://brittanyangell.com/gluten-and-grain-free-irish-soda-bread/",
  "extension": "Chrome",
  "firstAdded": "2016-03-12T14:14:24.372000",
  "users": [
    null
  ],
  "keywords": [
    "almond",
    "flour",
    "tapioca",
    "potato",
    "starch",
    "baking",
    "soda",
    "directions",
    "used",
    "double",
    "acting",
    "salt",
    "caraway",
    "seeds",
    "granulated",
    "variety",
    "truvia",
    "make",
    "sugar",
    "free",
    "raisins",
    "husband",
    "bread",
    "eggs",
    "apple",
    "cider",
    "vinegar"
  ],
  "directions": [
    "0",
    "Preheat Oven to 350 Degrees. Place a sheet of parchment in a pie pan or on a small cookie sheet.",
    "In a large bowl combine all of the dry ingredients and mix together. (Almond Flour, Starch, Baking Soda, Powder, Salt, Caraway Seeds, Sugar and Raisins) NOTE: I noticed that some brands of baking soda are more bitter tasting that others. I always use Bob's red mill Baking soda as it does not have the bitter aftertaste. IF you do not have bobs red mill baking soda- I suggest using only 1 1/2 Tsp. Baking Soda instead of the full 2 tsp to avoid a strong aftertaste.",
    "In a small bowl whisk together the 3 eggs and vinegar. Once mixed- pour into the large bowl of flour and stir until the dough comes together.",
    "Plop the dough into the prepared pie pan. Dust the top and sides of the dough with some starch (tapioca or potato starch) and form it into a a round mound that is roughy 1 1/2 - 2 inches tall and about 6 inches wide. Using a knife score the top of the bread to make the classic cross shape. (I made my scored about 1/2 inch thick) .",
    "Quickly place the dish into the oven and bake 40 minutes. The bread should be nice and hard to touch and lightly golden."
  ],
  "ingredients": [
    "0",
    "2 1/2 cups packed BLANCHED Almond flour.",
    "1/2 Cup of Tapioca Starch or Potato Starch.",
    "2 Tsp. Baking Soda *see note in directions.",
    "1/2 Tsp. Baking Powder (I used double acting)",
    "1/4 Tsp. Salt",
    "1/4 Tsp. Caraway Seeds",
    "1 Tablespoon of granulated sugar (any variety: I used Truvia to make it sugar free)",
    "1/4- 1/2 cup raisins. (I only used 1/4 cup as my husband does not like his bread sweet.)",
    "3 large Eggs",
    "2 Teaspoons of Vinegar (I used apple cider vinegar)"
  ],
  "__v": 1
}