{
  "hash": "f7af1bd9662e3de7730384f07a26a79c000ce82a",
  "title": "Chinese Beef & Broccoli Stir-Fry Recipe {Skinnytaste Giveaway}",
  "image": "https://farm4.staticflickr.com/3849/15287684396_ffb7f37d8a_b.jpg",
  "href": "http://www.cookincanuck.com/2014/09/chinese-beef-broccoli-stir-fry-recipe/",
  "extension": "Chrome",
  "firstAdded": "2016-06-22T20:13:49.646000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a shallow glass container, whisk together the cornstarch 2 teaspoons of the soy sauce, rice wine and 1 teaspoon of the sesame oil.",
    "Sprinkle the salt over the steak. Add the steak to the marinade, turn to coat, and let rest at room temperature for 30 minutes.",
    "Bring a large saucepan of water to a boil. Add the broccoli and cook until bright green and tender-crisp, 45 seconds to 1 minute. Drain and immediately rinse with cold water to stop the broccoli from cooking further.",
    "Heat a large nonstick skillet over high heat. Add 1 teaspoon of the sesame oil and half of the steak. Cook 30 seconds on each side, without stirring as it’s cooking. Transfer to a plate and repeat with another 1 teaspoon of the sesame oil and the rest of the steak.",
    "Heat the remaining 1 teaspoon of the sesame oil and add the white parts of the scallions, garlic and ginger. Cook for 30 seconds.",
    "Add the broccoli, brown sugar, remaining 3 tablespoons of the soy sauce and oyster sauce. Cook, stirring constantly, for 30 seconds.",
    "Add the beef and cook for 30 seconds. Remove from the heat and stir in the scallion greens.",
    "Serve over brown rice."
  ],
  "ingredients": [
    "0",
    "2 tsp cornstarch",
    "3 tbsp + 2 tsp reduced-sodium soy sauce",
    "2 tsp rice wine",
    "4 tsp sesame oil",
    "1 lb. sirloin steak, trimmed of fat, thinly sliced against the grain",
    "¼ tsp kosher salt",
    "4 cups broccoli florets",
    "4 medium scallions, cut into 1-inch pieces; white & greens separated",
    "1 tbsp minced garlic",
    "½ tsp minced fresh ginger",
    "2 tbsp packed dark brown sugar",
    "1 tbsp oyster sauce"
  ],
  "__v": 1
}