{
  "hash": "9ec1de1a38ed3400673f5939327a7a7f5e1c94d6",
  "title": "Mixed Berry Chocolate Slab Pie",
  "image": "http://whiteonricecouple.com/recipe/images/berry-slab-pie-thumb-200-thumb.jpg",
  "href": "http://whiteonricecouple.com/recipes/berry-slab-pie/",
  "extension": "Chrome",
  "firstAdded": "2017-04-11T20:30:31.775000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 400°F (205°C). Butter one 13 x 18-inch sheet pan. Set aside another to use as a template.",
    "Start the filling: Put the berries in a large bowl. In a small bowl, whisk together the sugar and cornstarch until well combined. Add the sugar mixture to the berries and gently toss. Set aside.",
    "Make the crust: In a large bowl, whisk together the flour, sugar, and salt. Pinching with your fingers or using a pastry blender, incorporate the butter into the mixture until no large pieces of butter remain and the mixture has a crumbly texture.",
    "In a separate bowl, whisk the eggs with the cold water. Make a well in the middle of the flour mixture, then pour the egg mixture into the well. Working from the center out, combine the egg and flour mixtures until the dough holds together. If necessary, adjust by adding a little additional flour or cold water if the dough is too sticky or not holding together.",
    "Divide the dough into two portions, one twice the size of the other.",
    "On a large floured surface, roll out the larger portion of dough to an 18 x 22-inch rectangle (we usually roll it out slightly larger, then trim the edges straight to the correct dimensions). Dust the underside and the top of the dough with flour a few times while rolling out to keep the dough from sticking.",
    "Gently wrap the dough around the rolling pin, then unroll it over the first sheet pan. Adjust the dough so it sits evenly in the sheet pan. Dock the pastry by pressing down with your fingertips several times, making indentations across the bottom of the pastry. Spread the chocolate chips in an even layer over the pastry. Spread the berry mixture in an even layer on top of the chips. Set aside.",
    "Roll out the smaller dough portion to a rectangle just larger than 13 x 18 inches (32.5 by 45 cm). Flip the second sheet pan upside down and gently press it into the dough, then lift the pan off. Use the impression to cut the dough to size. Gently wrap it around the rolling pin, then unroll it over the slab pie to form a top crust.",
    "Fold excess dough from the crust bottom up and around to meet the pie top and gently pinch the crust to form the top edge. Brush the top and the edges of the pastry with cream (or egg wash). Using kitchen scissors or a knife, cut slits into the top of the slab pie.",
    "Bake for 30 to 40 minutes, or until the top is golden. Remove the pie from the oven and allow to cool. Dust with confectioners’ sugar (if desired), slice, and serve."
  ],
  "ingredients": [
    "0",
    "3 pounds (1.4kg) mixed fresh berries, larger berries halved or quartered",
    "1 cup (200g) sugar",
    "3 tablespoons cornstarch",
    "1.5 cups (250g) chocolate chips",
    "1",
    "8 cups (1kg) flour",
    "1 cup (200g) sugar",
    "2 teaspoons (10ml) kosher or sea salt",
    "1 pound (455g) cold unsalted butter, cut into 1/2-inch pieces",
    "3 eggs",
    "1/2 cup (120ml) cold water",
    "Heavy cream or egg wash, for brushing the crust",
    "Confectioners’ sugar, for dusting (optional)"
  ],
  "__v": 1
}