{
  "hash": "12516dc889dd0cc5fe4c5d060e8278a0ab922ba7",
  "title": "Cider-Braised Pork Shoulder",
  "image": "http://cdn-image.myrecipes.com/sites/default/files/styles/300x300/public/cider-braised-pork-shoulder-sl.jpg?itok=Op-Y72Gq",
  "href": "http://www.myrecipes.com/recipe/cider-braised-pork-shoulder-0",
  "firstAdded": "2015-01-23T22:23:13.078000",
  "users": [
    null
  ],
  "keywords": [
    "kosher",
    "salt",
    "dark",
    "brown",
    "sugar",
    "dry",
    "mustard",
    "paprika",
    "red",
    "pepper",
    "butterflied",
    "boneless",
    "pork",
    "shoulder",
    "roast",
    "boston",
    "butt",
    "olive",
    "oil",
    "reducedsodium",
    "chicken",
    "broth",
    "apple",
    "cider",
    "honey",
    "dijon",
    "bay",
    "leaves",
    "granny",
    "smith",
    "apples",
    "mediumsize",
    "yellow",
    "onion",
    "garlic",
    "bulb",
    "crosswise",
    "butter",
    "vinegar",
    "garnishes",
    "celery"
  ],
  "directions": [
    "0",
    "Stir together first 5 ingredients; rub over pork. Roll pork up, and tie with kitchen string. Chill pork, uncovered, 8 to 12 hours.",
    "Preheat oven to 325°. Let pork stand at room temperature about 20 minutes.",
    "Cook pork in hot oil in a large Dutch oven over medium-high heat 12 minutes, browning on all sides. Remove from Dutch oven; wipe Dutch oven clean. Boil broth and next 2 ingredients in Dutch oven over medium-high heat. Reduce heat to medium, and whisk in mustard; simmer, stirring occasionally, 5 minutes.",
    "Return pork to Dutch oven, and add bay leaves. Cut 1 apple into thick slices. Place onions, garlic, and apple slices around pork. Return to a simmer over medium heat. Place a piece of parchment paper directly on pork mixture, and cover Dutch oven with a tight-fitting lid.",
    "Bake at 325° for 3 1/2 to 4 hours or until meat is very tender and pulls away from bone. Let pork stand in Dutch oven, covered with parchment paper and lid, at room temperature 30 minutes.",
    "Discard parchment paper. Carefully transfer pork to a serving platter; cover with aluminum foil. Skim fat from cooking liquid, and pour cooking liquid through a fine wire-mesh strainer into a large saucepan, discarding remaining solids. Bring to a simmer over medium-high heat. Cut remaining apple into thin slices, and add to mixture. Simmer, stirring occasionally, 5 minutes or until sauce reduces slightly. Remove from heat. Add butter and vinegar, and stir until butter melts and sauce is smooth. Serve sauce with pork."
  ],
  "ingredients": [
    "0",
    "2 tablespoons kosher salt",
    "2 teaspoons dark brown sugar",
    "1 teaspoon dry mustard",
    "2 teaspoons paprika",
    "1 teaspoon ground red pepper",
    "1 (4- to 5-lb.) butterflied boneless pork shoulder roast (Boston butt)",
    "2 tablespoons olive oil",
    "3 cups reduced-sodium chicken broth",
    "1 cup apple cider",
    "1 tablespoon honey",
    "2 tablespoons Dijon mustard",
    "6 bay leaves",
    "2 Granny Smith apples",
    "1 medium-size yellow onion, chopped",
    "1 garlic bulb, cut in half crosswise",
    "1 tablespoon butter",
    "1 teaspoon apple cider vinegar",
    "Garnishes: fresh celery leaves, bay leaves"
  ],
  "__v": 1
}