{
  "hash": "d64760e2541fdf3528b8408a740fdfb38540f3ff",
  "title": "Chocolate Covered Cherry Mason Jar Cakes",
  "image": "",
  "href": "https://therubykitchen.com/2014/09/04/chocolate-covered-cherry-cakes/",
  "extension": "Chrome",
  "firstAdded": "2016-08-07T19:20:31.780000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions for Mason Jar Cherry Cake:",
    "-Preheat oven to 350 degrees",
    "-Grease 6 pint size glass mason jars, lids removed, and place on a sheet tray",
    "-Cream butter and sugar together until light and fluffy (2-5 minutes)",
    "-Sift flour, baking powder and salt into a bowl",
    "-Whisk milk, egg whites, cherry juice and vanilla extract into a separate bowl",
    "-Once butter and sugar are fluffy, alternate adding dry and wet ingredients; beginning and finishing with the dry ingredients (dry, wet, dry, wet, dry).",
    "-Evenly distribute batter into each jar",
    "-Bake 25-30 minutes, or until a knife inserted all the way down comes out clean",
    "-Let cool 20 minutes and then remove from jars carefully, using a knife to loosen from the sides",
    "-Place on cooling rack until they are completely cooled.",
    "-To assemble, trim the tops off each cake and then cut cake in half.",
    "-Pipe chocolate ganache between layers",
    "-Cover and store at room temperature up to 4 days",
    "Instructions for Chocolate Ganache:",
    "-Finely chop chocolate and place in a bowl that has a lid or a plate can sit tightly against",
    "-Scald milk by bringing just to a boil and removing from heat",
    "-Immediately pour into bowl with chocolate. Stir once and quickly put a lid or plate on top to trap steam",
    "-After 5 complete minutes whisk and the ganache will come together like magic",
    "-Transfer to fridge for 5-10 minutes or until no longer warm",
    "-With electric mixer and whisk attachment, whisk until light and fluffy, 2-5 minutes"
  ],
  "ingredients": [
    "0",
    "Ingredients for Cherry Cake:",
    "-225g sugar (approx 1 cup)",
    "-6 Tbsp butter, at room temperature",
    "-185g flour (approx 1.5 cups)",
    "-10g baking powder (approx 1 Tbsp)",
    "-Pinch of salt",
    "-¾ cup milk, at room temperature",
    "-3 egg whites, at room temperature",
    "-¼ cup maraschino cherry juice, at room temperature",
    "-½ tsp vanilla extract",
    "-2/3 cups maraschino cherries, chopped",
    "Ingredients for Chocolate Ganache:",
    "-8 ounces dark chocolate (I used 72%)",
    "-8 ounces of heavy cream (or heavy whipping cream)"
  ],
  "__v": 1
}