{
  "hash": "404c63750c8fa08b0f2a3fd96edfdbc5b4564118",
  "title": "Bbq Pork Ribs",
  "image": "https://amazingribs.com/files/styles/content_body_600px/public/heroimage/ribs-with-flame_0.jpg?itok=02iXmTgt",
  "href": "https://amazingribs.com/tested-recipes/pork-ribs-recipes/last-meal-ribs",
  "extension": "Chrome",
  "firstAdded": "2018-12-23T18:39:40.104000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Rinse. Rinse the ribs in cool water to remove any bone bits from the butchering.",
    "Skin 'n' trim. If the butcher has not removed the membrane from the under side, do it yourself. It gets leathery and hard to chew, it keeps fat in, and it keeps sauce out. Insert a butter knife under the membrane, then your fingers, work a section loose, grip it with a paper towel, and peel it off. Finally, trim the excess fat from both sides. If you can't get the skin off, with a sharp knife, cut slashes through it every inch so some of the fat will render out during the cooking. Click here to see more photos and a video of how to skin 'n' trim.",
    "Salt. Salt is important. Use about 1/4 teaspoon per pound. You can simply eyeball it by sprinkling on the same amount of salt you would sprinkle on the ribs if they were served to you unsalted.",
    "Rub. About 2 tablespoons per side depending on the size of the slab.",
    "Preheat. Preheat cooker to about 225°F and try to keep it there throughout the cook.",
    "Smoke. Add about 4 ounces of dry wood at this time",
    "More smoke. When the smoke dwindles after 20 to 30 minutes, add another 4 ounces of wood.",
    "Cook. Let cook for a couple of hours.",
    "Texas Crutch. Wrap the slab in foil with about an ounce of water, beer or apple juice for up to an hour to speed cooking and tenderize a bit.",
    "Bend Test. Pick up the slab with tongs and bounce it gently. If the surface cracks as in the picture above, it is ready. Here are some other tricks to tell when ribs are ready. Allow 5 to 6 hours for Barbecue St. Louis Cut Ribs and Barbecue Spare Ribs, or 3 to 4 hours for Barbecue Baby Back Ribs. The exact time will depend on how thick the slabs are and how steady you have kept the temp. If you use rib holders so they are crammed close to each other, add another hour.",
    "Sauce. When the meat is done, paint both sides with your favorite home made barbecue sauce or store-bought barbecue sauce and cook for another 15 minutes or so."
  ],
  "ingredients": [
    "0",
    "1 slab Baby Back Ribs (optional St. Louis Cut Ribs or Spare Ribs)",
    "4 tablespoons of Meathead's Memphis Dust",
    "1 teaspoon Morton’s kosher salt (1/4 teaspoon per pound of meat)",
    "1 cup of barbecue sauce (optional)"
  ],
  "__v": 2
}