{
  "hash": "41504ce67f652e40d9e9dff801ffaf4e5c768902",
  "title": "Paleo Ranch Dressing (& Mayo!)",
  "image": "http://recipe-folder.com/img/recipe-images/056/895/3087525656.jpg",
  "href": "http://www.onelovelylife.com/paleo-ranch-dressing/",
  "extension": "Firefox",
  "firstAdded": "2017-06-24T07:22:05.332000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "For the Mayonnaise:",
    "Place all ingredients in a narrow container or jar. I use the mixing cup my immersion blender came with, but a half-pint jar works well, too.",
    "Place the head of the immersion blender at the bottom of the jar and turn the blender on. The bottom of the jar should quickly emulsify (you'll see it turn white and thick). Slowly move the immersion blender upward toward the top of the jar as the mixture emulsifies.",
    "If any oil slips back down the jar, simply move the head of the blender down to mix it in, then continue lifting the blender upward toward the surface until all the oil is incorporated and the mixture is thick. This process takes only 1-2 minutes, at most.",
    "This mayonnaise will keep covered in the refrigerator up to 1 week. It's great for chicken or egg salad, on a sandwich, or in creamy salad dressings.",
    "For the ranch dressing:",
    "For every 1 cup of mayonnaise (the recipe above will yield the right amount), add 3 Tbsp coconut milk, cider vinegar, onion and garlic powders, and dill. Stir to mix well. Add additional coconut milk as needed to thin the mixture (it will naturally thicken somewhat in the refrigerator). Taste and add salt and pepper as desired.",
    "Ranch dressing will keep 1 week covered in the refrigerator."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "For the mayonnaise:",
    "1 cup avocado oil, olive oil, or a mixture",
    "1 egg yolk",
    "1 Tbsp dijon mustard",
    "Juice of ½ a lemon",
    "½ tsp salt",
    "For the ranch dressing:",
    "1 cup mayonnaise (see above or substitute your favorite recipe)",
    "¼ cup coconut milk",
    "1 tsp apple cider vinegar",
    "½ tsp onion powder",
    "½ tsp garlic powder",
    "1 Tbsp fresh dill or 1 tsp dried dill",
    "salt and pepper, to taste."
  ],
  "__v": 1
}