{
  "hash": "dcb0797fab3bec4e4f3673a3757398e756147603",
  "title": "Salsa Verde Lentil Tacos with Mango-Pomegranate Pico",
  "image": "http://www.ambitiouskitchen.com/wp-content/uploads/2015/06/IMG_9336.jpg",
  "href": "http://www.ambitiouskitchen.com/2015/06/salsa-verde-lentil-tacos-with-mango-pomegranate-pico/",
  "extension": "Chrome",
  "firstAdded": "2015-06-19T23:51:11.660000",
  "users": [
    null
  ],
  "keywords": [
    "pico",
    "mango",
    "seeds",
    "pomegranate",
    "cilantro",
    "red",
    "onion",
    "lime",
    "juice",
    "lentils",
    "water",
    "uncooked",
    "green",
    "tomatillos",
    "poblano",
    "pepper",
    "jalapeo",
    "seeded",
    "unpeeled",
    "garlic",
    "salt",
    "corn",
    "tortillas",
    "gluten",
    "free",
    "veggie",
    "monterey",
    "jack",
    "cheddar",
    "shreds"
  ],
  "directions": [
    "0",
    "First make the salsa: Add mango, pomegranate, red onion, cilantro, and lime juice to a medium bowl; stir until just combined. Cover and place in fridge until tacos are ready to serve.",
    "Next make the lentils: Add 1 ½ cups of water and lentils to a medium pot and place over high heat. Bring to a boil, then reduce heat to low, cover and simmer for 25-35 minutes or until lentils are fork tender and water has absorbed completely. Do NOT overcook the lentils or they will become mushy and we don’t want them to be mushy. Once lentils are cooked, drain out excess water from pot and remove from heat.",
    "While lentils are cooking, make the tomatillo sauce. Remove husks from tomatillos and rinse them under warm water; cut in half and place cut side down on a foil-lined pan along with garlic, jalapeno halves and poblano pepper. Place under the broiler for 5-8 minutes or until the skin of the tomatillos and peppers are dark golden brown and somewhat blackened. Remove from the oven and allow to cool for 5 minutes.",
    "Once cooled enough to handle, peel the blackened skin from poblano pepper and discard. Remove the roasted garlic cloves from their skin and add to a blender along with the rest of the poblano pepper (stem and skin removed), tomatillos and jalapeno halves. Add in cilantro and lime juice; blend for 1-2 minutes or until smooth.",
    "Stir in 1 cup of tomatillo sauce into cooked lentils. Add salt and pepper to taste. Reserve extra sauce for garnish (or you can use it as a salsa with chips).",
    "To assemble tacos: Add 1 tablespoon of GO Veggie cheese in a taco, then place about ¼ cup lentils and top with a tablespoon or two of mango-pomegranate pico. Serves 4, 2 tacos each."
  ],
  "ingredients": [
    "0",
    "For the Pico:",
    "1 mango, pitted and diced",
    "Seeds from 1/2 of a pomegranate (about 1/2 cup)",
    "2-3 tablespoons fresh chopped cilantro",
    "1/4 cup diced red onion",
    "1 teaspoon fresh lime juice",
    "For the lentils & sauce",
    "1 1/2 cups water",
    "3/4 cup uncooked green lentils",
    "1 pound tomatillos",
    "1 poblano pepper",
    "1 jalapeño, cut in half and seeded",
    "3 unpeeled cloves garlic",
    "1/4 cup fresh chopped cilantro",
    "1 tablespoon fresh lime juice",
    "Salt and pepper, to taste",
    "8 corn tortillas (gluten free)",
    "½ cup GO Veggie! Monterey Jack & Cheddar Shreds"
  ],
  "__v": 1
}