{
  "hash": "a2f93d84a5e36b27007d64f9c2cd4085d84099d9",
  "title": "Mongolian Beef",
  "image": "http://tiphero.com/wp-content/uploads/2017/01/Mongolian-Beef-Close-up-750x364.jpg",
  "href": "http://tiphero.com/mongolian-beef/?ref=wn",
  "extension": "Chrome",
  "firstAdded": "2018-03-01T20:46:22.466000",
  "users": [
    null,
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Line a sheet pan with paper towels.",
    "Marinate the sliced flank steak for 1 hour in the 2 teaspoons of oil, 1 tablespoon of soy sauce, and 2 tablespoons of the cornstarch.TipHero",
    "Dredge the meat in the remaining ½ cup of cornstarch until lightly coated.",
    "Heat the 2 cups of vegetable oil in a medium-sized, heavy-bottomed pot over high heat. Just before the oil starts to smoke (at 375-to-400 degrees Fahrenheit or 190-to-200 degrees Celsius), spread the flank steak pieces evenly in the pot, and let cook for 1 to 2 minutes, depending upon the heat of your oil. The cooked steak should be light golden-brown and crispy. Remove the cooked steak to the sheet pan lined with paper towels to drain.TipHerogoogletag.cmd.push(function() { googletag.display('Article_Repeat_2'); });",
    "Heat a large saute pan over medium heat. Add 1 tablespoon of the oil used to cook the flank steak to the pan. Add the garlic, dried chili flakes (if using), and ginger. Cook for 15 to 30 seconds, stirring constantly, until fragrant.",
    "Add the broth (or water), brown sugar, and soy sauce. Bring the sauce to a simmer, and stir until the brown sugar is dissolved.TipHerogoogletag.cmd.push(function() { googletag.display('Article_Repeat_3'); });",
    "Let the sauce simmer for about 2 minutes, and then add in the cornstarch slurry mixture. Cook, stirring constantly, for about 1 to 2 minutes, until the sauce coats the back of a spoon.",
    "Add the cooked flank steak and toss in the sauce until all the beef is well-coated. Cook for another 30 seconds, until the steak is heated through. All of the sauce should be clinging to the beef. If you find the sauce is a little thick, add more broth or water, 1 tablespoon at a time, to adjust the consistency of the sauce to your liking.",
    "Garnish with cut green onions and toasted sesame seeds, if desired. Serve over rice"
  ],
  "ingredients": [
    "0",
    "1 pound flank steak, sliced against the grain into ¼-­inch thick slices",
    "2 teaspoons oil",
    "1 tablespoon soy sauce",
    "½ cup + 2 tablespoons cornstarch, divided",
    "2 cups vegetable oil, for frying the beef",
    "3 cloves garlic, minced",
    "½ teaspoon dried red chili flakes (optional)",
    "1 teaspoon minced ginger",
    "⅔ cup beef broth, chicken broth or water",
    "2 tablespoons brown sugar",
    "⅓ cup low sodium soy sauce",
    "Cornstarch slurry (2 tablespoons cornstarch mixed with 2 tablespoons water)",
    "¼ cup green onions, cut, diagonally, into 1-inch-long slices",
    "2 tablespoons toasted sesame seeds (optional)"
  ],
  "__v": 2
}