{
  "hash": "a671b9fa75bb028b96fea1684ec79431ac14ef41",
  "title": "blueberry tart with lemon verbena ice cream",
  "image": "https://circusgardener.files.wordpress.com/2015/06/bluebery-tart-with-lemon-verbena-ice-cream3.jpg?w=676",
  "href": "http://circusgardener.com/2015/07/11/blueberry-tart-with-lemon-verbena-ice-cream/",
  "extension": "Chrome",
  "firstAdded": "2015-07-19T09:43:13.809000",
  "users": [
    null
  ],
  "keywords": [
    "ice",
    "cream",
    "organic",
    "coconut",
    "milk",
    "solid",
    "form",
    "maple",
    "syrup",
    "lemon",
    "verbena",
    "leaves",
    "tart",
    "almonds",
    "oil",
    "blueberries",
    "sugar",
    "cornflour"
  ],
  "directions": [
    "0",
    "ethod",
    "1. For the ice cream, pour the coconut milk into a saucepan. Add the coconut cream, maple syrup and lemon verbena. Stir and place over a low heat. Bring to simmering point and then immediately remove from the heat. Leave to cool and infuse.",
    "2. When the mixture has cooled, strain into a bowl to remove the lemon verbena. Put the strained liquid in the fridge to chill for at least one hour. Pour the chilled ice cream mixture into an ice cream maker, and churn? Once it is starting to set, tip the ice cream out into a freezer proof container. Cover the container with a lid and freeze for at least 4 hours. Remove the ice cream from the freezer and leave to stand at room temperature for 15 minutes before serving.",
    "3. For the tarts, put the coconut oil and maple syrup in a pan over a low heat. Once melted, remove from the heat and add the ground almonds, stirring to combine. Press this mixture into each of the tart tins to create the outer shell for the tart. Preheat the oven to 170°C (325°F, gas mark 3). Place the tart shells in the refrigerator for half an hour so that the coconut oil sets and the shell hardens a little. Remove from the refrigerator and cook in the preheated oven for 12-15 minutes, or until the shells are a light golden brown in colour. Leave to cool.",
    "4. Next, place 250 g of the blueberries in a separate sauce pan with the coconut sugar and one tablespoon of water. Place over a medium heat and stir to combine. As soon as the liquid begins to bubble, reduce the heat to its lowest setting. Simmer gently for a further 10 minutes, stirring every so often. Mix the cornflour with 1 teaspoonful of water and stir until you have a smooth paste. Add this to the blueberries and stir. Remove from the heat and using a wooden spoon gently crush the blueberries in the pan. Leave to cool completely.",
    "5. Divide the cooked blueberry between the tarts. Gently scatter the reserved blueberries over the top. If you have problems removing the tarts from their tins apply a little gentle heat to the tine, either using a blow torch for a few seconds on the side of the tin or by popping them into a warm oven for a minute, and they will then easily slip out. Serve with a generous scoop of the lemon verbena ice cream."
  ],
  "ingredients": [
    "0",
    "for the ice cream",
    "400 ml organic coconut milk",
    "160 ml organic coconut cream (not the solid form)",
    "100 ml maple syrup",
    "20 g lemon verbena leaves",
    "for the tart",
    "175 g organic ground almonds",
    "50 g organic coconut oil",
    "35 ml organic maple syrup",
    "350 g fresh organic blueberries",
    "30 g organic coconut sugar",
    "1½ tsp organic cornflour"
  ],
  "__v": 1
}