{
  "hash": "1f9bf8d8af6516eb5d134a1eb5c63b6efbca2d5a",
  "title": "1 vote PRINT\nHot and Sour Soup (Suan La Tang)",
  "image": "",
  "href": "https://www.vietworldkitchen.com/blog/2017/11/hot-sour-soup-recipe-suan-la-tang.html",
  "extension": "Chrome",
  "firstAdded": "2018-04-01T05:03:32.394000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a bowl, combine the 1/4 teaspoon salt, 1 teaspoon soy sauce, 1 teaspoon rice wine, 2 teaspoons cornstarch, and 1 teaspoon water. Add the beef or pork, stirring to coat well. Set aside.",
    "In a 3- or 4-quart pot, heat the oil over high heat. Add the ginger and cook, stirring frequently, for 1 minute, until the ginger is super fragrant. Add the bamboo shoot (or lily bulbs) and mushrooms, stir for about 15 seconds until you can smell their perfume, then add the stock.",
    "Bring to a boil, lower to a simmer, then add the remaining 1 1/2 tablespoons soy sauce and 1 tablespoon rice wine. Taste and season with salt and white pepper. Aim for a spicy kick and savory depth. (If not serving right away, turn off the heat and cover.)",
    "Before serving, return the soup to a simmer and add the pork and tofu, stirring to separate. Meanwhile, combine the remaining 1/4 cup cornstarch with the remaining 6 tablespoons water, stirring to dissolve.",
    "When the meat has just cooked through and the soup returns to a simmer, give the cornstarch a final stir, then gradually add to the soup. You may not need the entire amount. Aim to create a silky thick soup that’s not gloppy. The tofu should seem suspended in the soup but eventually fall to the bottom of the pot.",
    "When satisfied, give the egg a final stir, then pour it into the soup pot in a wide circle. Stir gently as the egg solidifies into suspended ribbons. Then add the vinegar, gently stirring. Taste and adjust the flavor with additional salt, white pepper, and/or vinegar. Ladle into a serving bowl or individual soup bowls. Scatter the green onion on top and serve immediately."
  ],
  "ingredients": [
    "0",
    "1/4 teaspoon fine sea salt, plus more as needed",
    "1 teaspoon plus 1 1/2 tablespoons regular or gluten-free soy sauce",
    "1 teaspoon plus 1 tablespoon Shaoxing rice wine or dry sherry",
    "2 teaspoons plus 1/4 cup cornstarch",
    "6 tablespoons plus 1 teaspoon water",
    "4 to 5 ounces cooked beef steak or pork chop, or 5 to 6 ounces raw beef steak, boneless pork shoulder or loin, cut into scant 1/4-inch-thick matchsticks",
    "1 tablespoon neutral oil, such as canola",
    "Chubby 1-inch section fresh ginger, peeled, halved lengthwise, and bruised",
    "1/2 cup matchstick-cut bamboo shoots, or 30 dried tiger lily bulbs, soaked and trimmed of knobby ends",
    "4 large dried shiitake mushrooms, or 4 small dried shiitake mushrooms plus 4 or 5 cloud/wood ear mushrooms, soaked, trimmed, and sliced",
    "6 cups homemade lightly salted chicken stock or canned chicken broth",
    "About 3/4 teaspoon white pepper",
    "8 ounces medium-firm or firm tofu, cut into 1/4-inch-thick matchsticks (see tofu buying guide for tips)",
    "1 large egg beaten with 1 teaspoon sesame oil",
    "About 2 tablespoons Chinkiang vinegar, or 1 tablespoon balsamic vinegar mixed with 1 tablespoon apple cider vinegar",
    "1 green onion, white and green parts, thinly sliced, for garnish"
  ],
  "__v": 1
}