{
  "hash": "0847422a3ec550fbbc0c2229327998d344dc1f2f",
  "title": "Wild Blueberry Muffins",
  "image": "http://www.lifewiththecrustcutoff.com/wp-content/uploads/2014/07/panera-2-pic-monkey-666x1024.jpg",
  "href": "http://www.lifewiththecrustcutoff.com/copycat-panera-wild-blueberry-muffinsjill/",
  "extension": "Chrome",
  "firstAdded": "2017-04-11T19:54:43.474000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400 degrees. Line one 6-cup jumbo muffin pan with paper liners.",
    "In a small bowl, combine the coarse sugar, ⅓ cup flour and cold butter. Using a pastry cutter, mix the",
    "topping well, until it is fine and crumbly. Store in refrigerator while making muffin batter.",
    "In a large bowl, whisk together the 1 and ½ cups of flour, sugar, baking powder and salt. In a 1-cup",
    "glass measuring cup, measure the oil and add the egg. Whisk together. Pour in enough buttermilk until",
    "liquid is 8 fluid ounces... a little more than ⅓ cup of buttermilk. Add the vanilla and whisk again.",
    "Pour the wet mixture into the dry mixture and stir gently with a wooden spoon or spatula until just a",
    "few streaks of flour remain. Add the blueberries and mix gently until evenly distributed in the muffin",
    "batter.",
    "Divide batter evenly between 6 muffin cups (about ½ cup batter each). Sprinkle the top of each muffin",
    "generously with the topping.",
    "Bake muffins on the center rack of oven for 28 - 30 minutes, or until toothpick inserted in center of",
    "muffin comes out clean. Allow to cool completely. Store in an air-tight container for up to 2 days."
  ],
  "ingredients": [
    "0",
    "for the topping:",
    "⅓ c. coarse (or raw) sugar",
    "⅓ c. all-purpose flour",
    "4 T. unsalted butter, cold and cut into four pieces",
    "for the muffins:",
    "1½ c. all-purpose flour",
    "¾ c. granulated white sugar",
    "2 t. baking powder",
    "½ t. salt",
    "⅓ c. vegetable oil",
    "1 large egg",
    "old-fashioned buttermilk (see directions for measurement)",
    "2 t. vanilla extract",
    "1 c. frozen wild blueberries"
  ],
  "__v": 1
}