{
  "hash": "7d6cf9553299ceac4e3e6e414538268262bf0975",
  "title": "ЦЫПЛЕНОК ТИККА МАСАЛА",
  "image": "http://orientstyle.ru/wp-content/uploads/2010/03/tikka1-300x225.jpg",
  "href": "http://orientstyle.ru/zhizn-i-byt/cook/indijskaya-kuxnya/tikka-masala/",
  "extension": "Chrome",
  "firstAdded": "2016-08-01T17:21:26.550000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Приготовление",
    "Смешать все компоненты для маринада и добавить куриные кусочки. Поставить мариновать по крайней мере на один час.",
    "Жарить в оливковом масле до золотистой корочки. Куриные кусочки ни в коем случае не пережаривать.",
    "В раскаленное масло положить чесночную и имбирную пасты. Жарить несколько минут, помешивая, затем прибавить нарезанный лук.",
    "Когда лук станет мягким, прибавить томаты и продолжать жарить при средней температуре до готовности.",
    "Увеличить температуру и медленно влить сливки, постоянно помешивая соус.",
    "Когда соус станет однородной массой, уменьшить огонь и готовить около пяти минут. Посолить.",
    "Добавить жареного цыпленка к соусу и довести до кипения. Прибавить зеленый перец, гарам масала* и зелень.",
    "Подавать горячим с приготовленным на паруприготовленным на пару рисом. Как видим, процесс приготовления довольно трудоемкий, но в руках умелого повара вовсе не сложный, особенно, когда волшебный уголок для кухни помогает.",
    "Гарам масала* можно приготовить в домашних условиях, но можно приобрести готовый продукт в супермаркете. Вариаций существует множество, но в состав, обычно входит двенадцать специй по числу индийских поваров. Например, черный перец, корица, гвоздика, кориандр, тмин, кардамон, сушеный перец чили, сладкий укроп, имбирь, масе (из сушёной шелухи мускатного ореха), мускатный орех."
  ],
  "ingredients": [
    "0",
    "Маринад:",
    "• 1 чашка (=230 мл) натурального йогурта",
    "• 2 столовые ложки лимонного сока",
    "• 2 чайные ложки тмина",
    "• 2 чайные ложки красного перца",
    "• 2 чайные ложки черного перца",
    "• 1 чайная ложка корицы",
    "• Кусочек имбиря, натереть",
    "• Соль по вкусу",
    "Для соуса",
    "• 2 зубчика чеснока, растереть",
    "• Небольшой кусочек имбиря, натереть",
    "• 1 зеленый перец чили, покрошить",
    "• 2 чайные ложки свежего кориандра, нарезать мелко",
    "• 1 чайная ложка свежей зелени тмина, нарезать",
    "• 1 чайная ложка гарам масала",
    "• Соль по вкусу",
    "• 1-2 помидора, очистить, покрошить",
    "• 1 луковица, очистить и мелко порезать",
    "• 1 чашка сливок"
  ],
  "__v": 1
}