{
  "hash": "e2aba519e16242328e9118279a3bf786e75ad7fc",
  "title": "Mango Coconut Icebox Cake",
  "image": "http://atmedia.imgix.net/a67f821cf2991b8d844870b976c6bbaa7ee0059c?w=640.0&fit=max",
  "href": "http://www.thekitchn.com/recipe-mango-coconut-icebox-cake-dessert-recipes-from-the-kitchn-206525?utm_source=facebook&utm_medium=social&utm_campaign=managed",
  "extension": "Chrome",
  "firstAdded": "2016-07-14T17:52:05.664000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "8 ounces cream cheese, softened at room temperature for 1 hour 15-ounce can sweetened cream of coconut, such as Coco Lopez 3 cups heavy cream 1 tablespoon rum, optional 24 to 28 whole graham crackers (4 sleeves, about 19 ounces) 5 large mangos, peeled and chopped (5 to 6 cups) 2 tablespoons turbinado sugar, optional",
    "Preheat the oven to 350°F. Spread the coconut flakes in a pie pan or baking dish and toast for 5 to 6 minutes, stirring every 2 minutes, until lightly browned. Remove and cool completely. (Cooled toasted coconut can be stored at room temperature in an airtight container for up to 1 week.)",
    "Whip the cream cheese until smooth and creamy in the bowl of a stand mixer or using a hand mixer. Add the coconut cream, and whip until well blended. Slowly add the heavy cream and whip until it forms soft peaks. Whip in the rum, if using.",
    "Spread a small spoonful of whipped cream on the bottom of a 9x13-inch baking pan, or a similarly-sized platter. Lay down six graham crackers. Lightly cover the top of the graham crackers with more whipped cream, and then a single layer of chopped or sliced mango. Repeat three times, until you have four layers of graham crackers. Spread the last of the whipped cream over the top and swirl it lightly with a spoon. Add the remaining mango.",
    "Refrigerate for at least 2 hours, or until the crackers have softened completely. Sprinkle with turbinado sugar just before serving. Best served within 3 days."
  ],
  "ingredients": [
    "0",
    "3/4 cup unsweetened coconut flakes",
    "8 ounces cream cheese, softened at room temperature for 1 hour",
    "15-ounce can sweetened cream of coconut, such as Coco Lopez",
    "3 cups heavy cream",
    "1 tablespoon rum, optional",
    "24 to 28 whole graham crackers (4 sleeves, about 19 ounces)",
    "5 large mangos, peeled and chopped (5 to 6 cups)",
    "2 tablespoons turbinado sugar, optional"
  ],
  "__v": 1
}