{
  "hash": "7f9bbc0d72d11a9f436923265d46fb1dac180335",
  "title": "Instant Pot Pressure Cooker French Dip Sandwiches",
  "image": "http://www.number-2-pencil.com/wp-content/uploads/2016/08/Instant-Pot-Pressure-Cooker-French-Dip-Sandwiches-Collage.jpg",
  "href": "http://www.number-2-pencil.com/2016/09/04/instant-pot-pressure-cooker-french-dip-sandwiches/",
  "extension": "Chrome",
  "firstAdded": "2017-12-18T05:32:39.132000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For best results, let chuck roast rest at room temperature for at least 15 minutes before searing.",
    "Add vegetable oil to the Instant Pot and hit the sauté button.",
    "Season chuck roast with 2 teaspoon of kosher salt, freshly ground pepper to taste and 1/2 teaspoon of garlic powder on all side.",
    "Using a pair on long heat-proof kitchen tongs, sear roast on all sides in Instant Pot.",
    "Remove seared roast from Instant Pot and set aside.",
    "Add onions to pot and sauté just until they start to soften.",
    "Add red wine to pot and let simmer until reduced by half.",
    "Use a wooden spoon to scrape up seared bits from the bottom of the pot as it simmers.",
    "Once wine has reduced, add low-sodium beef broth and bay leaf.",
    "Return roast to Instant Pot, close lid and make pressure release valve is set to sealing.",
    "Hit Meat/Stew function and increase time to 100 minutes.",
    "Let Instant Pot natural release for 25 minutes, then turn valve to venting to release any excess pressure.",
    "Remove lid and transfer roast to a serving plate and shred.",
    "Strain liquid through a fine mesh strainer and serve warm for dipping sandwiches.",
    "Set oven to broil and place sandwich rolls on a baking sheet.",
    "Combine melted butter, 1/4 teaspoon of garlic powder and pinch of kosher salt in a small bowl.",
    "Brush over rolls and toast 2-3 minutes, just until gold brown.",
    "Pile meat onto rolls and top with cheese. Return to broiler and heat just until cheese has started to melt.",
    "Top sandwiches with freshly chopped flat-leaf parsley and serve with warm au jus for dipping."
  ],
  "ingredients": [
    "0",
    "2.5 pound chuck roast",
    "1 tablespoon of vegetable oil",
    "2 teaspoons of kosher salt",
    "freshly ground pepper to taste",
    "1/2 teaspoon of garlic powder",
    "1 onion, sliced",
    "1/2 cup of red wine",
    "1 14 oz can of low-sodium beef broth",
    "1 dried bay leaf",
    "6 soft rolls",
    "3 tablespoons of butter, melted",
    "1/4 teaspoon of garlic powder",
    "pinch of kosher salt",
    "6 slices of provolone cheese"
  ],
  "__v": 1
}