{
  "hash": "fd91acfd9b74182ab065044349814c8f72be90a6",
  "title": "The Famous Chocolate Babka",
  "image": "https://images.food52.com/_qqgybS5CwwcYMq3vyFI2_4JRi0=/753x502/654e23d6-37b5-482f-9571-2411d71fcc09--75_The_Famous_Chocolate_Babka.jpg",
  "href": "https://food52.com/recipes/70729-the-famous-chocolate-babka",
  "extension": "Chrome",
  "firstAdded": "2018-03-01T01:31:07.003000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the dough: Whisk the vanilla into the milk in the bowl of a stand mixer fitted with the dough hook. Use a fork or your fingers to lightly mix the yeast into the milk. Then, in this order, add the flours, eggs, sugar, salt, and finally the butter in small pinches.",
    "Mix on the lowest speed, stopping the mixer to scrape down the sides and bottom of the bowl as needed, and to pull the dough off the hook as it accumulates there and break it apart so it mixes evenly, until the dough is well combined, about 2 minutes (it will not be smooth; see photo on page 29). If the dough is very dry, add more milk, 1 tablespoon at a time; if the dough looks wet, add more all-purpose flour, 1 tablespoon at a time, until the dough comes together. Increase the mixer speed to medium, and mix until the dough is smooth and has good elasticity, 4 minutes.",
    "Stretch and fold the dough: Lightly dust your work surface with flour and turn the dough out on top; lightly dust the top of the dough and the interior of a large bowl with flour. Grab the top portion of the dough and stretch it away from you, tearing the dough. Then fold it on top of the middle of the dough. Give the dough a quarter turn and repeat the stretch, tear, and fold. Continue to do this until you can stretch a small piece of dough very thin without it tearing, about 5 minutes. Then use your hands to push and pull the dough against the work surface and in a circular motion to create a nice round of dough. Set the ball in the floured bowl, cover the bowl with plastic wrap, and set it aside at room temperature for 30 minutes.",
    "Chill the dough: Set the dough on a piece of plastic wrap and press it into a 1-inch-thick rectangle. Wrap the dough in plastic wrap and refrigerate it for at least 1 hour or up to 24 hours before proceeding.",
    "Lightly coat 2 standard loaf pans with room-temperature unsalted butter.",
    "Roll the chilled dough: Lightly coat 2 standard loaf pans with room-temperature unsalted butter. Unwrap the cold babka dough and set it on a lightly floured work surface (or on a long dining table—you need at least 4 feet of work space). Roll the dough into a 9-by-24-inch rectangle (it should be just a little shy of 1/4-inch thick) with a long side facing you. Pull and shape the corners into a rectangle shape.",
    "Note: Only roll going along the length of the dough (left to right) and not up and down the dough. The height will naturally increase as you roll the dough, and by rolling the dough in just one direction, you’re not going to stress the gluten. If the dough starts to spring back, that means it’s tired. Let it rest for 5 minutes before trying again.",
    "Fill and roll the dough: Spread the Nutella in an even layer over the dough, all the way to the edges. Then sprinkle the chocolate chips in an even layer over the Nutella, across the entire surface of the dough. Working from the top edge, roll the dough into a tight cylinder. As you roll it, push and pull the cylinder a little to make it even tighter. Then, holding the cylinder at the ends, lift and stretch it slightly to make it even tighter and longer.",
    "Twist the strips into a babka: Use a bread knife to slice the cylinder in half lengthwise so you have 2 long pieces, and set them with the chocolate layers exposed. Divide the pieces crosswise in half, creating 4 equal-length strips. Overlap one strip on top of another to make an X, making sure the exposed chocolate part of the dough faces up; then twist the ends together like the threads on a screw so you have at least 2 twists on each side of the X. Repeat with the other two pieces. Place each shaped babka into a prepared loaf pan, exposed chocolate–side up. The dough should fill the pan by two-thirds and fit the length perfectly. Cover the pan with plastic wrap and repeat with the other pieces of dough.",
    "Note: Embrace the mess! Twisting the dough is a sticky process, but don’t worry—after baking, even the messiest babka will still look beautiful and, more important, taste great.",
    "Let the dough rise: Set the loaf pans aside in a warm, draft-free spot until the dough rises 1 to 2 inches above the rim of the pan and is very soft and jiggly to the touch, 2 to 3 hours, depending on how warm your room is.",
    "Note: If your room is very cold, you can speed up the rising process: Set a large bowl of hot water on the bottom of the oven, place the loaf pans on the middle oven rack, close the oven door, and let the dough rise in the oven. Just remember that your babka is in there before preheating the oven!",
    "Preheat the oven to 350° F. (If you are letting the dough rise in the oven, as described in the Note, be sure to remove the loaf pans and bowl of water before preheating.)",
    "Bake the babkas: Place the babkas in the oven and bake until they are dark brown and baked through, about 40 minutes; check them after 25 minutes, and if they are getting too dark, tent them loosely with a piece of parchment paper or aluminum foil.",
    "Meanwhile, make the simple syrup: Combine the sugar and water in a small saucepan and bring to a boil over high heat. Reduce the heat to medium-low and simmer, stirring occasionally to dissolve the sugar. Turn off the heat and set aside the syrup to cool.",
    "Brush with simple syrup: Remove the babkas from the oven, and while they are still hot, brush the surface generously with the cooled sugar syrup (the syrup makes the top of the babkas shiny and beautiful and also locks in the moisture so the cake doesn’t dry out; you may not need to use all the syrup—save any extra for sweetening iced coffee or tea). Use a paring knife to separate the babkas from the pan edges, and turn them out from the pan. Slice and serve warm, or cool completely in the pans before unmolding and slicing.",
    "Freezing and Defrosting Babka:\nBabka dough can be frozen so a fresh-from-the-oven babka can be had anytime. To freeze the shaped dough, double-wrap it in plastic wrap, then in aluminum foil (and then in a resealable freezer bag if it fits). To defrost the dough, unwrap it and let it sit out at room temperature, loosely covered with a kitchen towel or in a homemade proofing box, until it has proofed to about 1 inch above the lip of the loaf pan (the dough will take several hours to defrost, then extra time to proof depending on the warmth of your room). Then bake as instructed. Baked babkas also freeze beautifully, so don’t hesitate to wrap one or two from your batch in a double layer of plastic wrap and then aluminum foil and freeze them for up to 1 month. Leave the wrapped frozen babka at room temperature for a few hours to thaw, and then remove the plastic wrap and rewrap in foil and place it in a preheated 325°F oven for 8 to 10 minutes to warm through. For the last 5 minutes in the oven, open the foil to expose the surface of the cake so it dries out just a bit."
  ],
  "ingredients": [
    "0",
    "1/2 teaspoon vanilla extract",
    "120 grams (1/2 cup) whole milk (at room temperature)",
    "20 grams (2 1/2 tablespoons) fresh yeast OR 6 grams (2 teaspoons) active dry yeast",
    "280 grams (2 1/4 cups) all-purpose flour (sifted, 11.7%), plus extra for dusting and kneading",
    "220 grams (2 cups plus 2 tablespoons) pastry or cake flour (sifted, 8.5 to 9%)",
    "2 large eggs",
    "75 grams (1/2 cup) granulated sugar",
    "Large pinch fine salt",
    "80 grams (5 tablespoons plus 1 teaspoon) unsalted butter (at room temperature)",
    "1",
    "FILLING",
    "420 grams (1 1/2 cups) Nutella",
    "150 grams (1 cup) semisweet chocolate chips",
    "SIMPLE SYRUP",
    "160 grams (3/4 cup plus 1 tablespoon) granulated sugar",
    "120 grams (1/2 cup) water"
  ],
  "__v": 1
}