{
  "hash": "c59f5d3665baa8eee51232d981a7a75c31c6cdc5",
  "title": "Crispy Chicken Schnitzel with Garlic-Onion Gravy",
  "image": "",
  "href": "https://www.foodnetwork.com/recipes/guy-fieri/crispy-chicken-schnitzel-with-garlic-onion-gravy-recipe-2042442",
  "extension": "",
  "firstAdded": "2019-01-17T02:10:05.714000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 325 degrees F.",
    "For the cutlets: Begin by pounding out the chicken cutlets. Working with 2 cutlets at a time, place between 2 pieces of plastic wrap. Using the flat side of a meat tenderizer, gently pound out each piece of chicken to an even 1/4-inch thickness. Work gently from the center outwards so as to keep it even and not tear the chicken. Repeat with the remaining cutlets.",
    "Set up a breading station. Place the flour in a shallow bowl, season with salt and pepper and mix well. In a second shallow bowl, add the buttermilk, season with salt and pepper and mix well. In a third shallow bowl, add the breadcrumbs, Parmesan, season with salt and pepper and mix well.",
    "Take each cutlet and dredge lightly in the flour. Shake off any excess, and then dip in the buttermilk. Finally, dredge in the breadcrumb mixture. Cover evenly on both sides, gently patting the crumbs into the chicken to help it stick. Place the breaded cutlets in a single layer on a platter and place uncovered in the fridge for 15 minutes - this will help the coating stick to the cutlet and prevent tearing when it comes time to cook them.",
    "To cook the cutlets, set 2 large nonstick saute pans, cast-iron pans if available, over medium-high heat. Add 2 tablespoons of oil to each and cook 2 cutlets in each pan for 3 to 4 minutes per side. When done, they will be golden brown and crispy. Transfer to an ovenproof pan and keep warm in the oven. Try not to keep the chicken in the oven longer than 15 minutes, otherwise it will dry out.",
    "Now make the gravy: Set a medium saute pan with high sides over medium-high heat and add the olive oil. Add the garlic, onions and thyme. Season with salt and pepper. Saute until the onions are lightly caramelized and tender, 7 to 8 minutes. Deglaze with the white wine and reduce for 1 minute before adding the chicken broth. Simmer for 5 to 6 minutes, and then add the cold butter cubes to the sauce. Remove from the heat and swirl the pan to melt the butter evenly - this will thicken the sauce and give it a nice sheen. Serve the chicken schnitzel with the garlic-onion gravy.",
    "Wine paring: Riesling or sparkling wine."
  ],
  "ingredients": [
    "0",
    "Four 6-ounce chicken cutlets",
    "2 cups all-purpose flour",
    "2 cups buttermilk",
    "2 cups panko breadcrumbs",
    "1/2 cup grated Parmesan",
    "1/4 cup olive oil, for pan-frying",
    "Kosher salt and freshly ground black pepper",
    "Garlic-Onion Gravy:",
    "1 tablespoon olive oil",
    "3 cloves garlic, minced",
    "1 medium onion, finely diced",
    "1 teaspoon fresh thyme leaves",
    "Kosher salt and freshly ground black pepper",
    "1/4 cup dry white wine",
    "1/2 cup low-sodium chicken broth",
    "2 tablespoons unsalted butter, cold, cut into cubes"
  ],
  "__v": 1
}