{
  "hash": "35102a795014c72b517b353a67557616ca1bef24",
  "title": "Better Than Anything Bundt Cake",
  "image": "http://www.chef-in-training.com/blog/wp-content/uploads/2017/04/Better-Than-Anything-Bundt-Cake-2.jpg",
  "href": "http://www.chef-in-training.com/2017/04/better-than-anything-bundt-cake/",
  "extension": "Chrome",
  "firstAdded": "2017-04-21T22:01:06.086000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 degrees F.",
    "In a large mixing bowl combine all the ingredients and mix for three minutes.",
    "Spray bundt pan with Baking Joy or grease and flour it generously.",
    "Bake at 350 degrees F for 30 to 35 minutes, or until cake springs back to the touch. (Time may vary depending on your oven.)",
    "Let sit in the pan for 2 minutes. Carefully turn cake onto the cake stand you will be using, making sure its not sticking to any edges of the pan or it will break.",
    "Using a long wooden skewer poke a lot of holes in cake, going almost all the way through the cake but not quite.",
    "Slowly and carefully pour sweetened condensed milk over cake. Next pour caramel. NOTE: Pour the sweetened condensed milk and caramel this in increments so that not too much of the milk spills over. There will be some over flow. I put some paper towels under my cake stand for easy clean up.",
    "Allow cake to cool completely.",
    "1",
    "In a medium bowl, beat whipping cream on high until it begins to stiffen. Slowly add powdered sugar and continue to beat until medium peaks form.",
    "Frost cake with whipping cream and then sprinkle Heath toffee bits over the whip cream.",
    "Store in the refrigerator."
  ],
  "ingredients": [
    "0",
    "1 chocolate cake mix",
    "1 small box (3.9 oz) instant chocolate pudding mix, dry",
    "½ cup sugar",
    "½ cup sour cream",
    "4 eggs",
    "¾ cup vegetable oil",
    "¾ cup water",
    "1 teaspoon vanilla",
    "1",
    "1 small jar of caramel ice cream topping, you may not use the whole thing",
    "1 can sweetened condensed milk",
    "2",
    "2½ cups whipping cream",
    "¾ cup powdered sugar",
    "Heath bits to top with"
  ],
  "__v": 1
}