{
  "hash": "cf76abe4fbc39bf9c0bb50e8d3a0a32d683f5cdc",
  "title": "Classic Chicken and Dumplings",
  "image": "",
  "href": "https://www.realsimple.com/food-recipes/browse-all-recipes/classic-chicken-dumplings",
  "extension": "Chrome",
  "firstAdded": "2017-12-13T23:17:18.573000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Step 1",
    "Heat the oil in a large pot or Dutch oven over medium-high heat. Season the chicken with ½ teaspoon each salt and pepper. Brown in batches, 4 to 6 minutes per side. Transfer to a plate; reserve the pot.",
    "Step 2",
    "Add the celery, carrots, onions, thyme, and garlic to the drippings in the pot and cook, stirring, until the vegetables begin to soften, 5 to 7 minutes. Add the chicken, bay leaves, and 10 cups water. Bring to a simmer and cook until the chicken is cooked through, 25 to 30 minutes. Discard the bay leaves and transfer the chicken to a plate; let cool. Shred the chicken with 2 forks and return it to the pot (discarding the skin and bones).",
    "Step 3",
    "Whisk together ½ cup of the flour, 2 cups of the cooking liquid, and ¼ teaspoon each salt and pepper in a small bowl. Slowly whisk the flour mixture back into the pot and simmer until slightly thickened, 8 to 10 minutes.",
    "Step 4",
    "Make the dumplings: Whisk together the remaining 2 cups of flour, the baking powder, baking soda, and ¼ teaspoon each salt and pepper in a medium bowl. Whisk in the butter, buttermilk, and parsley. Reduce heat to low and drop the mixture into the broth in 8 large spoonfuls. Simmer, covered, until the dumplings are firm, 12 to 15 minutes. Serve sprinkled with parsley."
  ],
  "ingredients": [
    "0",
    "1 tablespoon olive oil",
    "6 bone-in, skin-on chicken thighs (about 2 pounds)",
    "kosher salt and black pepper",
    "4 stalks celery, chopped",
    "4 carrots, chopped",
    "2 onions, chopped",
    "2 tablespoons fresh thyme leaves or 2 teaspoons dried thyme",
    "2 cloves garlic, chopped",
    "2 bay leaves",
    "2 1/2 cups all-purpose flour",
    "1 tablespoon baking powder",
    "1/2 teaspoon baking soda",
    "6 tablespoons (3/4 stick) unsalted butter, melted",
    "3/4 cup buttermilk",
    "2 tablespoons chopped fresh flat-leaf parsley leaves, plus more for serving"
  ],
  "__v": 1
}