{
  "hash": "cc52976e24b108b2af0af272e523b7e624897105",
  "title": "Homemade Soft Pretzels",
  "image": "https://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/easy-homemade-soft-pretzels-265x265.jpg",
  "href": "https://sallysbakingaddiction.com/easy-homemade-soft-pretzels/",
  "extension": "Chrome",
  "firstAdded": "2019-01-08T01:38:57.712000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "Whisk the yeast into warm water. Allow to sit for 1 minute. Whisk in salt, brown sugar, and melted butter. Slowly add 3 cups of flour, 1 cup at a time. Mix with a wooden spoon (or dough hook attached to stand mixer) until dough is thick. Add 3/4 cup more flour until the dough is no longer sticky. If it is still sticky, add 1/4 - 1/2 cup more, as needed. Poke the dough with your finger - if it bounces back, it is ready to knead.",
    "Turn the dough out onto a floured surface. Knead the dough for 3 minutes and shape into a ball. Cover lightly with a towel and allow to rest for 10 minutes. (Meanwhile, I like to get the water + baking soda boiling as instructed in step 6.)",
    "Preheat oven to 400°F (204°C). Line 2 baking sheets with parchment paper or silicone baking mats. Set aside.",
    "With a sharp knife or pizza cutter, cut dough into 1/3 cup sections.",
    "Roll the dough into a 20-22 inch rope. Take the ends and draw them together so the dough forms a circle. Twist the ends, then bring them towards yourself and press them down into a pretzel shape.",
    "Bring baking soda and 9 cups of water to a boil in a large pot. Drop 1-2 pretzels into the boiling water for 20-30 seconds. Any more than that and your pretzels will have a metallic taste. Using a slotted spatula, lift the pretzel out of the water and allow as much of the excess water to drip off. Place pretzel onto prepared baking sheet. Sprinkle each with coarse sea salt. Repeat with remaining pretzels.",
    "Bake for 12-15 minutes or until golden brown.",
    "Remove from the oven and serve warm with spicy nacho cheese sauce. Pretzels may be stored in an airtight container or zipped top bag for up to 3 days (they lose a little softness).",
    "Make ahead tip: Pretzels freeze well, up to 2 months. To reheat, bake frozen pretzels at 350°F (177°C) for 20 minutes or until warmed through or microwave until warm. The prepared pretzel dough can be refrigerated for up to one day or frozen in an airtight container for 2-3 months. Thaw frozen dough in the refrigerator overnight. Refrigerated dough can be shaped into pretzels while still cold, but allow some extra time for the pretzels to puff up before the baking soda bath and baking."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "1 and 1/2 cups (360ml) warm water (lukewarm-- no need to take temperature)",
    "1 packet active dry or instant yeast (2 and 1/4 teaspoons)",
    "1 teaspoon salt",
    "1 Tablespoon brown sugar",
    "1 Tablespoon unsalted butter, melted and slightly cool",
    "3 and ¾ - 4 cups (460-500g) all-purpose flour, plus more for work surface",
    "coarse sea salt for sprinkling",
    "Baking Soda Bath",
    "½ cup (120g) baking soda",
    "9 cups (2,160ml) water"
  ],
  "__v": 1
}