{
  "hash": "d97ed61f2dbfe0a36771767b98734d72a111038f",
  "title": "Quinoa con Queso",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2011/10/quinoa-con-queso-vertical-600.jpg",
  "href": "http://www.simplyrecipes.com/recipes/quinoa_con_queso/",
  "extension": "",
  "firstAdded": "2017-07-13T22:17:26.765000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Put 1 cup quinoa and 2 cups of water into a medium sized pot and bring to a boil. Reduce to a low simmer, cover and cook for 10 minutes. Remove from heat and let sit for 10 minutes.",
    "2 While the quinoa is cooking, prepare the sauce. Heat olive oil and butter in a medium skillet on medium heat. Add the onions and cook for a couple minutes. Add the garlic, cook for a minute more. Add the chopped tomato, about 1/2 teaspoon Kosher salt, dried oregano, and tomato paste. Add chopped green chiles (cooked) if using. Sprinkle with freshly ground black pepper. Stir until well combined. Let cook until the tomatoes have cooked through and the sauce has cooked down a bit. Then stir in the cheese. Taste and add more salt or pepper if needed.",
    "3 Stir 1 cup of milk into the now cooked quinoa. Serve the quinoa in bowls and top with sauce. Garnish with chopped basil, parsley, cilantro, or chives."
  ],
  "ingredients": [
    "0",
    "1 cup quinoa, well rinsed",
    "2 cups water",
    "1 Tbsp olive oil",
    "1 Tbsp butter",
    "1 cup chopped onions",
    "1 teaspoon minced garlic",
    "1 large fresh tomato, cored, chopped (about 1 1/4 cups)",
    "1 roasted, peeled, seeded, and chopped large green chile, either Anaheim or Poblano (optional)*",
    "2 teaspoons tomato paste",
    "Kosher salt",
    "Freshly ground black pepper",
    "1/4 teaspoon of dried oregano (or 1/2 teaspoon fresh, finely chopped)",
    "1/4 pound (4 ounces) fresh farmer's cheese, or queso fresco, cut into small cubes",
    "1 cup milk",
    "Fresh basil, cilantro, or chives for garnish (optional)"
  ],
  "__v": 1
}