{
  "hash": "b0dd2205c5c277004994d29acc9976294dc0b32a",
  "title": "Salt & Vinegar Roasted Potatoes with Smoky Garlic Mayo",
  "image": "http://www.budgetbytes.com/wp-content/uploads/2016/12/Salt-Vinegar-Potatoes-V3.jpg",
  "href": "https://www.budgetbytes.com/2016/12/salt-vinegar-roasted-potatoes-with-smoky-garlic-mayo/",
  "extension": "Chrome",
  "firstAdded": "2016-12-28T19:19:19.693000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Wash the potatoes well, then add them to a large pot along with the vinegar. Add enough water to just cover the potatoes (about 2-3 cups), then add ½ Tbsp Morton® Kosher Salt. Place a lid on the pot and bring it to a boil over high heat.",
    "Continue to boil for 10-15 minutes, or until the potatoes can be pierced with a fork, but are not falling apart. Drain the potatoes in a colander and allow them to cool slightly.",
    "Preheat the oven to 400ºF. While the potatoes are cooling, prepare the smoky garlic mayo. Mince the garlic then combine it in a small bowl with the mayonnaise, smoked paprika, and ⅛ tsp kosher salt. Cover the bowl and refrigerate until ready to use.",
    "Once the potatoes are cool enough to handle, slice the potatoes into ¼ to ½-inch thick rounds. Place the sliced potatoes on a large baking sheet. Drizzle the olive oil over the potatoes, then toss the potatoes until they are evenly coated in oil on both sides. Season the potatoes with freshly cracked pepper and a pinch or two of Kosher salt.",
    "Roast the potatoes in the oven for 30 minutes, stirring half way through, or until they are golden brown on both sides. Season once more with a pinch of kosher salt and a sprinkle of fresh chopped chives.",
    "Serve the potatoes drizzled with the smoky garlic mayonnaise, or with the mayonnaise on the side for dipping."
  ],
  "ingredients": [
    "0",
    "2 lbs. small red potatoes $2.46",
    "1 cup white vinegar $0.55",
    "2 tsp Morton® Kosher Salt, divided $0.05",
    "1 Tbsp olive oil $0.11",
    "Freshly cracked pepper $0.05",
    "1 Tbsp chopped chives (optional) $0.32",
    "1",
    "⅓ cup mayonnaise $0.37",
    "1 small clove garlic $0.08",
    "¼ tsp smoked paprika $0.02",
    "⅛ tsp Morton® Kosher Salt"
  ],
  "__v": 1
}