{
  "hash": "76bc4a7071bebdfafa537a62160aed2d4b2d4cf2",
  "title": "Spaghetti di soia all'orientale",
  "image": "http://recipe-folder.com/img/recipe-images/046/407/938047346.jpg",
  "href": "https://ricette.giallozafferano.it/Spaghetti-di-soia-all-orientale.html",
  "extension": "Chrome",
  "firstAdded": "2020-02-18T21:11:56.418000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "PREAPARAZIONE 15 minuti - COTTURA 15 minuti",
    "Per realizzare gli spaghetti di soia all’orientale iniziate pelando la carota, eliminate le estremità e poi tagliatela a listarelle sottili, lavate il peperone dividetelo a metà, eliminate il picciolo e i semi interni e tagliatelo a listarelle come avete fatto per la carota.",
    "Affettate sottilmente il cipollotto e tagliate a rondelle sottili i peperoncini dolci avendo cura di eliminare picciolo e semi.",
    "Prendete il petto di pollo, tagliate via l'osso centrale con un coltello poi dividetelo a metà, spennellatelo con l’olio di oliva, grigliate il pollo su entrambi i lati su una piastra cosparsa di sale grosso per insaporirlo e fare in modo che non sia direttamente a contatto con il fondo. Tagliate a bastoncini il pollo grigliato e tenetelo da parte.",
    "Scaldate un filo di olio in una padella, fate rosolare il cipollotto e poi versate qualche cucchiaio di acqua tiepida per farlo stufare.",
    "Quando sarà appassito unite le carote e il peperone rosso e il peperoncino dolce. Cuocete per 5 minuti e poi sfumate con la salsa di soia 15 e proseguite per altri 5 minuti.",
    "Poi spegnete il fuoco e unite i bastoncini di pollo.",
    "In una pentola portate ad ebollizione l’acqua e lessate gli spaghetti di soia per due minuti massimo con il coperchio, o seguendo le istruzioni riportate sulle confezioni. Scolateli e passateli sotto l’acqua fredda sgranandoli con una forchetta per evitare che si rapprendano troppo.",
    "Unite gli spaghetti di soia nella padella con le verdure e il pollo e mantecateli a fuoco medio, aggiungete i germogli di soia e mescolate, per finire aromatizzate con la scorza di lime.",
    "Gli spaghetti di soia all’orientale sono pronti gustateli caldi."
  ],
  "ingredients": [
    "0",
    "4 persone",
    "Germogli di soia 150 g",
    "Spaghetti di soia 250 g",
    "Salsa di soia (leggermente salata) 10 g",
    "Peperoni rossi 1",
    "Carote 1",
    "Petto di pollo 600 g",
    "Cipollotto fresco 1",
    "Scorza di lime ½",
    "Peperoncino dolce 1",
    "Olio extravergine d'oliva q.b.",
    "Sale grosso q.b.",
    "Acqua (tiepida) 1 cucchiaio"
  ],
  "__v": 4
}