{
  "hash": "138352b49148611e2533726994262eb11fd37f13",
  "title": "Gingerbread Cookies",
  "image": "http://www.gimmesomeoven.com/wp-content/uploads/2010/12/Gingerbread-Cookies-4.jpg",
  "href": "http://www.gimmesomeoven.com/gingerbread-cookies/",
  "extension": "Chrome",
  "firstAdded": "2016-08-29T00:30:42.265000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large bowl, sift together flour, baking soda, and spices. Set aside.",
    "In an electric mixer fitted with the paddle attachment, beat the butter and sugar together on medium-high speed until light and fluffy, about 2 minutes. Add in eggs and molasses, and beat on medium speed until combined. Gradually add the flour mixture on low speed, and beat until combined. (You may need to work the dough with your hands to incorporate the last bit of flour, since it gets really thick!)",
    "Divide the dough in thirds, form each third into a round ball, and wrap each third in plastic. Chill in the refrigerator for at least 1 hour or overnight.",
    "When you're ready to bake the cookies, heat oven to 350°F.",
    "Remove the dough from the refrigerator and let it sit out at room temperature for 5-10 minutes. Then place a dough third on a large piece of lightly floured surface. Using a floured rolling pin, roll the dough evenly until it is 1/8-inch thick. Use a cookie cutter to cut the dough into your desired shapes. (If you're using red hots for \"buttons\", press the candy pieces in the center of each cookie at this point.) Transfer to parchment-covered baking sheets.",
    "Bake until crisp but not darkened, 8 to 10 minutes. Remove from oven. Let sit a few minutes and then use a metal spatula to transfer cookies to a wire rack to cool completely.",
    "Decorate as desired.",
    "Whisk all ingredients together in a bowl until smooth. If your icing is too thin, add in a little more powdered sugar. If your icing is too thick, add in a tiny bit of milk.",
    "Use a piping bag, or a ziplock bag (with the corner snipped off), or a plastic squeeze bottle to pipe the icing onto the cookies."
  ],
  "ingredients": [
    "0",
    "3 1/4 cups all-purpose flour",
    "3/4 teaspoon baking soda",
    "3/4 cup (1 1/2 sticks) unsalted butter, softened to room temperature",
    "1/2 cup packed dark-brown sugar",
    "1 Tablespoon ground ginger",
    "1 Tablespoon ground cinnamon",
    "1/2 teaspoon ground cloves",
    "1/2 teaspoon ground nutmeg",
    "1/4 teaspoon finely ground black pepper (optional)",
    "1/2 teaspoon salt",
    "1 large egg",
    "1/2 cup unsulfured molasses",
    "optional toppings: simple icing (see below), red hots, sprinkles, etc.",
    "1",
    "2 cups powdered sugar",
    "2-3 Tablespoons milk",
    "1/4 teaspoon vanilla extract"
  ],
  "__v": 1
}