{
  "hash": "cb3c62d4c931acb96ab73bcfccd946228c0136d3",
  "title": "Chocolate Covered Snow Peaks",
  "image": "//food.fnr.sndimg.com/content/dam/images/food/fullset/2008/10/7/0/12Days2008_SnowPeaks_s3x4.jpg.rend.hgtvcom.126.95.suffix/1400120482760.jpeg",
  "href": "https://www.foodnetwork.com/recipes/tyler-florence/chocolate-covered-snow-peaks-recipe2-1957176",
  "extension": "Chrome",
  "firstAdded": "2018-09-08T15:40:56.354000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 225 degrees F. Line two baking sheets with parchment paper.",
    "In the bowl of an electric mixer, beat the egg whites on medium speed with the whisk attachment until the whites become foamy. Add the cream of tartar and turn up the speed to medium, beating until just fluffy. Add the sugar gradually, while whisking, so it incorporates into the whites slowly without collapsing them. Once all the sugar has been added, add the vanilla and increase the speed to high, whisking until the meringue is firm and glossy, 5 to 7 minutes.",
    "Place the meringue into a piping bag with a medium-size round tip attached. Pipe 48 bite-size tear-drop-shaped meringues onto the sheets and place in the oven. Bake for 1 hour undisturbed, and then turn off the heat and leave in the oven overnight to really dry out.",
    "Melt the chocolate over a double-boiler or in the microwave on medium power for 30 seconds. Holding each meringue by the peak, dip the bases in chocolate so the bottom half of the meringue is coated. Let any excess chocolate drip off before placing on a baking sheet lined with wax paper. Allow to set at room temperature; do not put in the fridge. Once set, store in an airtight container."
  ],
  "ingredients": [
    "0",
    "4 large egg whites, at room temperature",
    "1 teaspoon cream of tartar",
    "1 cup plus 2 tablespoons superfine granulated sugar",
    "1 teaspoon pure vanilla extract",
    "2 cups dark chocolate chips"
  ],
  "__v": 1
}