{
  "hash": "3e34103ab7c87b23378efd1556463a551734c1f2",
  "title": "Aubergine & chickpea curry",
  "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/user-collections/my-colelction-image/2015/12/recipe-image-legacy-id--356525_12.jpg?itok=QndP_oqk",
  "href": "http://www.bbcgoodfood.com/recipes/681678/aubergine-and-chickpea-curry",
  "extension": "Chrome",
  "firstAdded": "2016-04-16T17:27:35.631000",
  "users": [
    null
  ],
  "keywords": [
    "aubergines",
    "aubergine",
    "ohbergeen",
    "technically",
    "fruit",
    "berry",
    "exact",
    "used",
    "sunflower",
    "oil",
    "variety",
    "oils",
    "baking",
    "use",
    "good",
    "food",
    "onions",
    "onion",
    "unyun",
    "endlessly",
    "versatile",
    "essential",
    "ingredient",
    "countless",
    "recipes",
    "native",
    "asia",
    "chillies",
    "chilli",
    "chillee",
    "capsicum",
    "family",
    "come",
    "scores",
    "varieties",
    "colours",
    "green",
    "garam",
    "masala",
    "mahsarlah",
    "meaning",
    "warming",
    "main",
    "spice",
    "blend",
    "north",
    "indian",
    "tomatoes",
    "tomato",
    "toemartoh",
    "member",
    "nightshade",
    "peppers"
  ],
  "directions": [
    "0",
    "Halve the aubergines, then cut each half into wedges. Heat ½ tbsp oil in a large pan, preferably non-stick, and brown half the aubergines for 2-3 mins on each side until golden brown and crisp all over. Scoop onto a plate, repeat with more oil and the remaining aubergines, then set everything aside.",
    "Add the remaining oil to the pan with the mustard seeds and curry leaves and fry for 30 secs until fragrant. Stir in the onions and continue cooking until they are softened and beginning to brown. Add the dried chillies and spices with a spoonful of the thick coconut milk from the top of the can, then fry for 1 min more. Add the remaining coconut milk, tomatoes and half a can of water. Simmer for 25-30 mins until thick and saucy.",
    "Stir in the chickpeas and aubergines. Continue simmering for 5 mins or so, until everything is hot and the aubergines are tender. Serve with rice or warm naan bread, scattered with a few extra curry leaves sizzled in a splash of oil, if you like."
  ],
  "ingredients": [
    "0",
    "aubergines",
    "Aubergine",
    "oh-ber-geen",
    "Although it's technically a fruit (a berry, to be exact), the aubergine is used as a…",
    "sunflower oil",
    "Sunflower oil",
    "A variety of oils can be used for baking. Sunflower is the one we use most often at Good Food as…",
    "onions",
    "Onion",
    "un-yun",
    "Onions are endlessly versatile and an essential ingredient in countless recipes. Native to Asia…",
    "chillies",
    "Chilli",
    "chill-ee",
    "Part of the capsicum family, chillies come in scores of varieties and colours (from green…",
    "garam masala",
    "Garam masala",
    "gar-am mah-sarl-ah",
    "Meaning 'warming spice mix', garam masala is the main spice blend used in North Indian…",
    "tomatoes",
    "Tomato",
    "toe-mart-oh",
    "A member of the nightshade family (along with aubergines, peppers and chillies), tomatoes are in…"
  ],
  "__v": 1
}