{
  "hash": "b5b74e5fd2181de47a0b75408539260a039add6e",
  "title": "SLOW COOKER STICKY ASIAN RIBS WITH STICKY SAUCE",
  "image": "https://therecipecritic.com/wp-content/uploads/2017/03/slowcookerribscrop-500x500.jpg",
  "href": "https://therecipecritic.com/slow-cooker-sticky-asian-ribs-sticky-sauce/",
  "extension": "Chrome",
  "firstAdded": "2019-11-09T17:12:41.720000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To make the sticky sauce: In a medium sized dish, whisk together the ginger, pepper, and onion powder. Add the garlic and mix again to incorporate. Add sweet chili sauce, soy sauce, vinegar, brown sugar and honey. Whisk until incorporated.",
    "Mix the dry rub ingredients together in a small bowl. Remove the membrane and place the ribs into the slow cooker. You can either curl the ribs along the slow cooker or cut them into sections and place on top of each other. Massage the dry rub into the ribs on both sides. Pour half of the sticky sauce mixture into the slow cooker and reserve the rest later for the sticky sauce. Cook the ribs for 6-8 hours on low heat until the meat is tender.",
    "Remove the ribs from the slow cooker and place them on a foil lines broil pan with the meaty side up. Brush some sauce from the slow cooker on top of the ribs and broil until the edges start to look crisp and broiled. Allow tented with foil to rest while you make the sticky sauce.",
    "To make the sticky sauce: In a medium saucepan over medium high heat, add the reserved sticky sauce to the pan. In a small bowl combine the cornstarch and water plus 1 Tablespoon of the hot liquid. Pour into the sauce pan with the sticky sauce whisk until the mixtures starts to thicken. Remove from heat and brush on top of the ribs. Serve immediately."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 racks pork baby back ribs",
    "Dry Rub:",
    "½ cup light brown sugar",
    "1 tablespoon smoked paprika",
    "2 teaspoons chili powder",
    "1 tablespoon garlic powder",
    "½ teaspoon pepper",
    "2 tablespoons kosher salt",
    "Sticky Sauce:",
    "2 teaspoons ground ginger",
    "2 teaspoons ground pepper",
    "1 teaspoon onion powder",
    "6 cloves garlic minced",
    "1 tablespoon sweet chili sauce found in the international section of the grocery store",
    "⅔ cup reduced sodium soy sauce",
    "⅔ cup balsamic vinegar",
    "⅔ cup brown sugar",
    "⅔ cup honey",
    "1 tablespoon cornstarch",
    "1 tablespoon water"
  ],
  "__v": 1
}