{
  "hash": "f52fb9ed668c638ccdd578fff5c9275a3881649e",
  "title": "Bite-Size Beef Wellingtons",
  "image": "//food.fnr.sndimg.com/content/dam/images/food/fullset/2017/12/19/0/FN_Snap_Baby-Beef-Wellington_s4x3.jpg.rend.hgtvcom.616.462.suffix/1513700085812.jpeg",
  "href": "https://www.foodnetwork.com/recipes/food-network-kitchen/bite-size-beef-wellingtons-4603216",
  "extension": "",
  "firstAdded": "2018-02-15T00:15:43.039000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the beef Wellingtons: Preheat the oven to 400 degrees F. Line a baking sheet with parchment paper.",
    "Heat the olive oil in a large skillet over medium-high heat. Pat the beef dry with a paper towel and season all sides with 1 teaspoon kosher salt and a generous grind of black pepper. Quickly sear the beef on all sides until well browned, about 4 minutes total. Transfer to a plate to cool.",
    "Add the shallot to the skillet and reduce the heat to low. Cook, stirring, until softened, about 3 minutes. Add the mushrooms and 1/4 teaspoon salt and cook until the mushrooms have softened, begun to brown and released their liquid, about 5 minutes. Raise the heat to medium and cook until the liquid has evaporated, 5 to 10 minutes more. Stir in the parsley, 1/4 teaspoon salt and a generous grind of black pepper. Remove the skillet from the heat and let cool.",
    "On a work surface, roll 1 sheet of puff pastry into a 14-by-10-inch rectangle. Put teaspoon-sized mounds of the mushroom mixture on the pastry, evenly spacing them in 4 rows of 3. Top each mushroom mound with a piece of beef. Brush the tops of the beef with the Dijon mustard. With a sharp knife, cut the pastry into even squares around the fillings.",
    "In a small bowl, whisk together the cream and egg and brush all four edges of the puff pastry squares with the egg mixture. Working one at a time, pull 2 opposite corners of pastry up over each beef piece, then fold the remaining 2 corners over the top to make a packet. Seal tightly. Invert and arrange the packets seam-side down on the prepared baking sheet and press them lightly to seal the pastry. Repeat with the remaining puff pastry, mushrooms, beef, and mustard.",
    "Bake the Wellingtons until golden brown, 25 to 30 minutes. Remove to a serving platter and let cool at least 10 minutes before serving.",
    "For the horseradish cream sauce: Meanwhile, stir together the sour cream, light cream, horseradish and pepper in a small bowl. Serve alongside the beef Wellingtons."
  ],
  "ingredients": [
    "0",
    "Beef Wellingtons:",
    "2 tablespoons olive oil",
    "2 pounds beef tenderloin, cut into twenty-four 1-inch cubes",
    "Kosher salt and freshly ground black pepper",
    "1 large shallot, finely chopped",
    "10 ounces cremini mushrooms, stemmed and finely chopped",
    "1 tablespoon finely chopped fresh parsley",
    "2 sheets frozen puff pastry (from a 17.3-ounce package), thawed",
    "1 tablespoon Dijon mustard",
    "2 tablespoons light cream",
    "1 large egg",
    "Horseradish Cream Sauce:",
    "1 cup sour cream",
    "1/4 cup light cream",
    "1/4 cup horseradish, prepared or fresh",
    "Freshly ground black pepper"
  ],
  "__v": 1
}