{
  "hash": "a595edfaafd13222c2d4660a75cc5fc6b3ee3293",
  "title": "Vegan Mongolian Beef",
  "image": "https://www.connoisseurusveg.com/wp-content/uploads/2016/07/vegan-mongolian-beef-2.jpg",
  "href": "https://www.connoisseurusveg.com/vegan-mongolian-beef/",
  "extension": "Firefox",
  "firstAdded": "2019-01-17T07:54:21.550000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the sauce by stirring soy sauce, sugar and 1/4 cup of water or broth together in a small bowl. Stir cornstarch and chilled water together in a small cup. Set aside.",
    "Drain the seitan and discard liquid. Place cornstarch into a medium bowl and add seitan strips. Toss to coat.",
    "Coat the bottom of a large skillet with oil and place over medium-high heat. Add seitan in as even a layer as possible. Cook until strips are browned and crisp on bottoms, about 4-5 minutes. Flip and cook 4-5 minutes more, until strips are crispy on opposite sides. Remove seitan from skillet and transfer to a paper-towel lined plate.",
    "Lower heat to medium. Add garlic, ginger and dried chilies, if using, to skillet. Sauté 2 minutes, until very fragrant and chilies begin to darken a bit. Return seitan to skillet with sauce, cornstarch mixture and scallions. Flip a few times to coat, and cook just until sauce becomes very thick, about 2 minutes.",
    "Divide noodles or rice onto plates and top with seitan. Serve immediately."
  ],
  "ingredients": [
    "0",
    "For the Sauce",
    "2 tbsp. soy sauce",
    "2 tbsp. granulated sugar, turbinado, coconut or organic brown sugar all work",
    "1/4 cup water",
    "2 tbsp. chilled water",
    "1 tsp. cornstarch",
    "For the Stir-Fry",
    "1-8 oz. package seitan strips, or make your own",
    "2 tbsp. cornstarch",
    "2 tbsp. vegetable oil",
    "2 garlic cloves, minced",
    "1 tsp. freshly grated ginger",
    "2-3 dried chili peppers, halved (optional)",
    "2 scallions, cut into 1 inch pieces"
  ],
  "__v": 1
}