{
  "hash": "a5f845bd37f209386cbd2d1afd93be33fb5683f1",
  "title": "\"ALL YOU CAN EAT\" CABBAGE SOUP",
  "image": "https://www.budgetbytes.com/wp-content/uploads/2017/01/Cabbage-Soup-Bowl-Front-380x380.jpg",
  "href": "https://www.budgetbytes.com/can-eat-cabbage-soup/?utm_campaign=yummly&utm_medium=yummly&utm_source=yummly",
  "extension": "",
  "firstAdded": "2018-12-28T14:18:04.876000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Mince the garlic and dice the onion. Add both to a large soup pot along with the olive oil and sauté over medium heat until the onions are soft and transparent.",
    "While the onions and garlic are cooking, peel and slice the carrots, slice the celery, and dice the bell pepper. Add the carrots, celery, bell pepper, and frozen green beans to the pot, followed by the diced tomatoes (and their juices) and tomato sauce. Stir to combine.",
    "Allow the vegetables in the pot to heat while you chop the cabbage. Chop the cabbage into one-inch strips or squares, then add them to the pot. Add the vegetable broth, chopped parsley, paprika, oregano, thyme, and some freshly cracked pepper. Stir to combine.",
    "Place a lid on the pot and bring it up to a boil. Once boiling, turn the heat down to medium-low and allow the pot to simmer until the cabbage is tender (about 20 minutes). Turn off the heat and add salt to taste. Start with about 1/2 tsp salt and add more as needed. The total amount will vary depending on your tastes and the type of broth used, but the salt is crucial for the vegetable flavors to pop. Finish the soup with lemon juice. Start by stirring in one tablespoon and adding more to your liking.",
    "RECIPE NOTES",
    "*I use Better Than Bouillon to make my"
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1 Tbsp olive oil $0.16",
    "4 cloves garlic $0.32",
    "1 large onion $0.34",
    "1/2 lb carrots $0.33",
    "1/2 bunch celery $0.55",
    "1 green bell pepper $0.75",
    "1/2 lb frozen green beans $0.78",
    "28 oz can diced tomatoes $1.69",
    "8 oz can tomato sauce $0.55",
    "1/2 head green cabbage $1.13",
    "6 cups vegetable broth* $0.78",
    "1/4 bunch fresh parsley, chopped $0.22",
    "1/2 Tbsp smoked paprika $0.07",
    "1 tsp dried oregano $0.10",
    "1/2 tsp dried thyme $0.05",
    "Salt and pepper to taste $0.05",
    "1-2 Tbsp lemon juice"
  ],
  "__v": 1
}