{
  "hash": "0566ecaa7af26620711c868e5f86501465c904a5",
  "title": "Sweet and Sour Noodles",
  "image": "https://www.williams-sonoma.com/wsimgs/rk/images/dp/recipe/201707/0050/img32l.jpg",
  "href": "https://www.williams-sonoma.com/m/recipe/sweet-and-sour-noodles.html",
  "extension": "",
  "firstAdded": "2017-07-13T23:04:06.099000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a wok or large, nonstick fry pan over high heat, warm the peanut oil. When the oil is hot, add the shallots, garlic, chilies and ginger and stir-fry until they begin to color, 1 to 2 minutes. Add the green onions and stir-fry for 1 minute. Add the shrimp and stir-fry until they turn pink and are nearly opaque, 1 to 2 minutes. Add the tomatoes and stir to combine. Add the diluted tamarind paste, fish sauce, lime zest, the juice of 1 lime and the 4 tsp. sugar and mix well. Pour in the broth, stir well and cook for 2 minutes to allow the flavors to blend. Remove from the heat and cover to keep warm.",
    "In a large pot over high heat, bring the water to a rapid boil. Add the salt and noodles, stir well and cook, stirring occasionally, until just tender, 2 to 3 minutes for fresh noodles or 5 to 7 minutes for dried noodles. Drain the noodles.",
    "Place the pan with the shrimp mixture over medium heat, add the noodles, and toss and stir until the noodles are nicely coated with the sauce and the mixture is piping hot. Taste and adjust the balance of sweet and sour with more sugar or lime juice if needed. Add the basil and mint, toss to mix and transfer to a warmed large, shallow platter. Drizzle with the sesame oil and serve immediately. Serves 4."
  ],
  "ingredients": [
    "0",
    "2 Tbs. peanut oil",
    "2 shallots, minced",
    "4 garlic cloves, minced",
    "3 or 4 Thai chilies, seeded and minced",
    "1 Tbs. peeled and grated fresh ginger",
    "6 green onions, including 3 inches of green tops, thinly sliced",
    "1 1/4 lb. shrimp, peeled and deveined",
    "2 firm tomatoes, peeled, seeded and chopped",
    "2 Tbs. tamarind paste, mixed with 2 Tbs. low-sodium chicken broth",
    "2 Tbs. fish sauce",
    "Grated zest and juice of 1 lime, plus more juice if needed",
    "4 tsp. sugar, plus more if needed",
    "1/2 cup low-sodium chicken broth",
    "4 quarts water",
    "1 Tbs. kosher salt",
    "1/2 lb. fresh or 1 lb. dried Chinese egg noodles",
    "1 cup fresh Thai or sweet basil leaves, chopped",
    "1/4 cup fresh mint leaves, chopped",
    "1 Tbs. Asian sesame oil"
  ],
  "__v": 1
}