{
  "hash": "8831746daeb7fc5fbadb1ed1de993cdbff5d663a",
  "title": "Easy Pan Pizza",
  "image": "http://www.jennycancook.com/recipe_images/pan_pizza_300x200.jpg",
  "href": "http://www.jennycancook.com/recipes/easy-pan-pizza/",
  "extension": "Chrome",
  "firstAdded": "2015-10-13T17:23:03.034000",
  "users": [
    null
  ],
  "keywords": [
    "bread",
    "allpurpose",
    "flour",
    "works",
    "yeast",
    "instant",
    "active",
    "dry",
    "salt",
    "water",
    "cold",
    "hot",
    "olive",
    "oil",
    "greasing",
    "pan",
    "pizza",
    "skim",
    "mozzarella",
    "cheese",
    "hand",
    "toppings",
    "use",
    "reduced",
    "fat",
    "turkey",
    "pepperoni",
    "peppers",
    "onions",
    "mushrooms"
  ],
  "directions": [
    "0",
    "ORIGINAL WAY(Overnight)/Cold water: Combine flour, yeast, and salt in a medium bowl. Add cold water and combine well. Cover tightly with plastic wrap and let stand on counter top 12 to 18 hours.",
    "NEW OPTION(Faster)/Hot water: Combine flour, yeast, and salt in a medium bowl. Add hot tap water and combine well. Cover tightly with plastic wrap and let stand on counter top for 3 hours.",
    "After the resting time, dough will be double in size, puffy & soft, and dotted with bubbles. Sprinkle the dough with a little flour and stir briefly until it forms a ball.",
    "Grease a 10-inch cast iron skillet.",
    "Place dough in skillet, spreading close to the edge with oiled fingers. Cover with a pot lid or plate and let rest at least an hour, preferably two. It will continue spreading as it rests.",
    "Preheat oven to highest temperature - 500/550° F.",
    "Add sauce, cheese, and toppings.",
    "Cook on a stove-top burner on medium-high heat for 3 minutes.",
    "Place in oven and bake about 15 minutes (start checking at 12)."
  ],
  "ingredients": [
    "0",
    "1 1/2 cups (7 ounces) bread flour (all-purpose flour works too)",
    "1/4 teaspoon yeast - instant or active dry",
    "3/4 teaspoon salt",
    "3/4 cup water (cold or hot - see below)",
    "1 Tablespoon olive oil for greasing pan",
    "1/3 cup pizza sauce",
    "4 ounces part skim mozzarella cheese, hand shredded",
    "toppings of your choice (I use reduced fat turkey pepperoni, peppers, onions, and mushrooms)"
  ],
  "__v": 1
}