{
  "hash": "80577500e5e8b414228d52fc332b09647a42d4e6",
  "title": "Mini Vanilla Bean Pavlovas With Coconut Whip and Raspberries [Vegan, Gluten-Free]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/04/merenguecookies.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/mini-vanilla-bean-pavlovas-with-coconut-whip-and-raspberries/",
  "extension": "Chrome",
  "firstAdded": "2015-04-21T13:49:23.118000",
  "users": [
    null
  ],
  "keywords": [
    "chickpeas",
    "came",
    "shy",
    "icing",
    "sugar",
    "vanilla",
    "beans",
    "scraped",
    "cream",
    "tartar",
    "carton",
    "coconut",
    "maple",
    "syrup"
  ],
  "directions": [
    "0",
    "Preheat your oven to 200f. Prepare your baking sheets by lining them with parchment paper. Set aside.",
    "In the bowl of an electric mixer or using a handheld mixer (beating by hand will NOT work here) (using the balloon whisk attachment) begin to beat the chickpea brine.",
    "Beat on medium until the mixture starts to resemble a white foam – my mixer took about 5 minutes but it all depends on the strength of your machine. Add in the cream of tartar.",
    "The meringue will start to form soft peaks. Next, add the sugar gradually.",
    "Once the sugar is incorporated add in the vanilla bean paste.",
    "Keep beating for an extra 5 minutes or until stiff peaks have formed in the meringue.",
    "Either spoon the meringue straight onto the parchment paper or pipe using a bag into a circle shape – making sure the edges are slightly higher. Form an indentation in the middle of each meringue using a spoon.",
    "Bake the meringues in the oven for 2 hours. DO NOT OPEN THE DOOR BEFORE THE FIRST HOUR IS UP.",
    "Once the 2 hours are up, turn off the oven and leave the meringues to cool for half an hour.",
    "Whilst the meringue is cooling, prepare the coconut whip. In a mixer using the beater attachment whip the coconut cream and maple syrup until it forms soft peaks. Set aside.",
    "Remove from the oven and then peel them carefully away from the parchment paper. They should be fully dry and make a hollow sound when tapped.",
    "To assemble the pavlovas, spoon a little of the coconut whip into each indentation and top with raspberries."
  ],
  "ingredients": [
    "0",
    "1 can of chickpeas, liquid drained off – my liquid came to just shy of 1 cup",
    "1 cup of icing sugar (powdered sugar)",
    "2 vanilla beans, scraped",
    "1/2 tsp cream of tartar",
    "1",
    "1 8 ounce carton coconut cream",
    "1 tbsp maple syrup"
  ],
  "__v": 1
}