{
  "hash": "30ba16f54c261afbcccd1e52b2d3ab720e71d000",
  "title": "Cabbage and Bacon Soup with Garlic Bread",
  "image": "http://a2.files.rachaelraymag.com/image/upload/c_fit,cs_srgb,dpr_1.0,q_80,w_620/MTQzMjU4OTI2NTA4NjgxMDY5.jpg",
  "href": "http://www.rachaelraymag.com/recipe/cabbage-and-bacon-soup-with-garlic-bread",
  "extension": "Chrome",
  "firstAdded": "2016-12-28T04:29:05.901000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparation",
    "Preheat the oven to 350 degrees . In a large pot, cook the bacon over medium-high heat, stirring often, until browned and crisp, about 10 minutes. Transfer with a slotted spoon to a paper-towel-lined plate.",
    "Pour off all but 1 tablespoon bacon fat, add the onion and cook until softened, about 3 minutes. Add the potatoes and cabbage and cook, stirring often, until the potatoes have softened slightly and the cabbage is wilted, 5 to 7 minutes. Pour in the vinegar and cook, stirring, until the flavor mellows, about 2 minutes. Add the broth and bring to a boil over high heat. Reduce the heat to medium and simmer until the potatoes and cabbage are soft, 20 to 25 minutes.",
    "Meanwhile, brush the bread with olive oil on both sides and place on a baking sheet. Toast in the oven, 10 to 15 minutes. Rub the cut sides of the garlic all over the bread.",
    "Season the soup with salt, pepper and the parsley. Divide among 4 bowls, top each with the bacon and serve with the garlic bread."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1/2 pound bacon, coarsely chopped",
    "1 large onion, finely chopped",
    "1 1/2 pounds red potatoes, cut into 1/2-inch cubes",
    "1/2 head small green cabbage, cored and thinly shredded",
    "1/4 cup red wine vinegar",
    "6 cups chicken broth",
    "4 1 inch thick slices ciabatta bread",
    "1/4 cup extra-virgin olive oil",
    "1 clove garlic, peeled and halved",
    "Salt and pepper",
    "1 tablespoon chopped parsley"
  ],
  "__v": 1
}