{
  "hash": "e328dcd0482274682169abce68f11d2edbfcd58a",
  "title": "Apple and Olive Oil Cake with Maple Icing",
  "image": "https://images.food52.com/kpsAQt5LvO3x7y3W3XcnwQkTjmY=/753x502/0d5dc8cd-d4f9-45cb-9d52-5afb628b8f7e--Apple_and_olive_oil_cake_with_maple_icing.jpg",
  "href": "https://food52.com/recipes/23850-apple-and-olive-oil-cake-with-maple-icing",
  "extension": "Chrome",
  "firstAdded": "2018-11-11T23:07:59.464000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Grease an 8-inch springform cake pan and line the bottom and sides with parchment paper. Place the raisins and water in a medium saucepan and simmer over low heat until all of the water has been absorbed. Leave to cool.",
    "Preheat the oven to 325*F. Sift together the flour, cinnamon, salt, baking powder, and baking soda and set aside.",
    "Put the oil and superfine sugar in the bowl of a stand mixer fitted with a paddle attachment (or use a whisk if you don't have a mixer). Slit the vanilla bean lengthwise in half and, using a sharp knife, scrape the seeds out into the bowl. Beat the oil, sugar, and vanilla together, then gradually add the eggs. The mix should be smooth and thick at this stage. Mix in the diced apples, raisins, and lemon zest, then lightly fold in the shifted dry ingredients.",
    "Whisk the eggs whites in a clean bowl, either by hand or with a mixer, until they have a soft meringue consistency. Fold them into the batter in 2 additions, trying to maintain as much air as possible.",
    "Pour the batter into the lined pan, level it with an icing spatula, and place in the oven. Bake for 1 1/2 hours, until a skewer inserted into the center comes out clean. Remove from the oven and leave to cool in the pan.",
    "Once the cake is completely cold, you can assemble it. Remove it from the pan and use a large serrated knife to cut it in half horizontally. You should end up with 2 similar disks. If the cake is very domed, you need to shave a bit off the top half to level it.",
    "To make the icing, beat together the butter, muscovado sugar, and maple syrup until light and airy. You can do this by hand, or, preferably, in a mixer, fitted with the paddle attachment. Add the cream cheese and beat until the icing is totally smooth.",
    "Using the icing spatula, spread a layer of icing 3/8 inch thick over the bottom half of the cake. Carefully place the top half on it. Spoon the rest of the icing on top and use the icing spatula to create a wavelike or any other pattern. Dust with confectioners' sugar, if you like."
  ],
  "ingredients": [
    "0",
    "1/2 cup golden raisins (heaping)",
    "4 tablespoons water",
    "2 1/4 cups all-purpose flour",
    "1/2 teaspoon ground cinnamon",
    "1/4 teaspoon salt",
    "1/2 teaspoon baking powder",
    "1 1/4 teaspoons baking soda",
    "1/2 cup olive oil",
    "3/4 cup superfine sugar",
    "1/2 vanilla bean",
    "2 free-range egg, lightly beaten",
    "3 large Granny Smith apples, peeled, cored, and cut into 3/8-inch dice",
    "Grated zest of 1 lemon",
    "2 free-range egg whites",
    "Confectioners' sugar, for dusting (optional)",
    "7 tablespoons unsalted butter, at room temperature",
    "1/2 cup muscovado sugar (scant)",
    "6 tablespoons maple syrup (scant)",
    "8 ounces cream cheese, at room temperature"
  ],
  "__v": 1
}