{
  "hash": "45e766c8c0a59ed58c810410c405b9d3e737558a",
  "title": "Easy 4-Ingredient Perfect Peanut Butter Cookies",
  "image": "https://www.averiecooks.com/wp-content/uploads/2014/11/4ingredientPBcookiestext.jpg",
  "href": "https://www.averiecooks.com/easy-4-ingredient-perfect-peanut-butter-cookies/",
  "extension": "Chrome",
  "firstAdded": "2018-12-13T00:41:02.373000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To a large mixing bowl add the peanut butter, sweetened condensed milk, vanilla, and stir to combine.",
    "Add the Bisquick and stir to incorporate. Mixture will be very thick.",
    "Using a large cookie scoop, 1/4-cup measure, or your hands, form approximately 11 equal-sized mounds of dough, roll into balls, and flatten about halfway by making crisscross marks using the tines of a fork. Dough may ‘crack’ a bit after you’ve pressed them down, it’s okay.",
    "Place mounds on a large plate or tray, cover with plasticwrap, and refrigerate for at least 2 hours, up to 5 days. Do not bake with unchilled dough because cookies will bake thinner, flatter, and be more prone to spreading.",
    "Preheat oven to 350F, line a baking sheet with a Silpat or spray with cooking spray. Place dough mounds on baking sheet, spaced at least 2 inches apart (I bake 8 cookies per sheet) and bake for about 13-14 minutes (for super soft cookies, or longer for more well-done cookies) or until edges have set and tops are just set, even if slightly undercooked, pale, and glossy in the center; don’t overbake. Cookies firm up as they cool. The cookies take a few minutes longer than most cookies to bake and I suspect that’s because it’s a very moist dough from the peanut butter and sweetened condensed milk. Allow cookies to cool on baking sheet for about 10 minutes before serving. I let them cool on the baking sheet and don’t use a rack.",
    "Cookies will keep airtight at room temperature for up to 1 week or in the freezer for up to 6 months. Alternatively, unbaked cookie dough can be stored in an airtight container in the refrigerator for up to 5 days, or in the freezer for up to 4 months, so consider baking only as many cookies as desired and save the remaining dough to be baked in the future when desired."
  ],
  "ingredients": [
    "0",
    "1 cup creamy peanut butter (Jif, Skippy, or similar; not natural – too runny, oily, and can separate)",
    "one 14-ounce can sweetened condensed milk",
    "1 tablespoon vanilla extract",
    "1 cup Original Bisquick™ mix"
  ],
  "__v": 1
}