{
  "hash": "1ee1033a878cf741ab70610ba5f963bc50287ad2",
  "title": "Georgian Khachapuri Filled with Ramps, Green Onions, Herbs, and Cheese",
  "image": "https://images.food52.com/UdPWTxJLvef1MYybXPfo9RsRJ_s=/753x502/7b35f539-d619-4383-b557-20849dbbf9b2--2015-0505_filled-georgian-khachapuri-cheese-bread_james-ransom-044.jpg",
  "href": "https://food52.com/recipes/17177-georgian-khachapuri-filled-with-ramps-green-onions-herbs-and-cheese",
  "extension": "Chrome",
  "firstAdded": "2018-03-01T01:30:30.054000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large bowl, combine 2 cups flour, sugar, and yeast. Add the water, stir, then add in the oil and salt. Stir your dough, then add remaining flour little by little until you've formed a soft dough (you may not need to use all of it). Knead the dough on a lightly floured surface for about 6 to 8 minutes, or until smooth and elastic. Cover and let rest at room temperature while you make the filling.",
    "1",
    "In a mixing bowl, combine the cheeses, salt and pepper, lemon zest, and herbs. Using a large fork, mix and mash well to get a smooth, homogeneous mixture. Set aside.",
    "Melt butter in a sauté pan over medium-low heat. Add coriander, green onions, ramps, and salt and black pepper to taste. Cook, stirring with a wooden spoon, until just softened, about 5 minutes. Add garlic and cayenne, then cook for 1 to 2 minutes longer.",
    "Pour the beaten eggs in and slowly scramble. Once soft curds form, immediately fold them and the vegetables into the cheese and herbs mixture. Cool to room temperature, taste for seasonings, and then chill in refrigerator for 15 to 20 minutes.",
    "Divide the rested dough into 4 equal pieces, and form each into a ball. On a lightly floured surface, roll them out into flat, round cakes about 10 inches in diameter, and spread about 1/2 cup of the filling in the center of each one. Gather one edge around the filling, then go around the opening and pinch the edges together. Gather the dough in the center and pinch to seal. It will look like an oversized dumpling.",
    "In a heavy-bottomed pan on medium-low heat, melt 1 tablespoon butter. When butter is melted, fry one pie. Lay it seam side-down and cook until browned, then turn over and cook the top until browned (about 4 to 5 minutes per side). Repeat with each pie.",
    "Transfer to a serving platter and brush the tops with some more melted butter. Serve hot or warm. These can be made ahead of time and warmed in a toaster oven.",
    "Note: khachapuri can be baked rather than fried in an oven at 350º F for about 30 minutes. The filling can also be baked in puff pastry (you will need 2 puff pastry sheets: Defrost them, roll each into a 12- by 12-inch square, then cut each into 4 equal squares, fill, and bake at 375° F until golden brown.) If you feel a little lazy, just make the filling and spread it on your favorite toasted bread for crostini."
  ],
  "ingredients": [
    "0",
    "3 to 3 1/2 cups unbleached all-purpose flour, divided, plus more as needed",
    "2 teaspoons sugar",
    "1/4 ounce active dry yeast",
    "1 cup hot water (about 120º F)",
    "2 tablespoons olive oil",
    "3/4 teaspoon coarse salt",
    "1",
    "1/2 cup fresh whole-milk ricotta, drained (a soft goat cheese also works)",
    "1/2 cup Havarti cheese, shredded",
    "1/2 cup good quality feta cheese",
    "Salt and freshly ground black pepper, to taste",
    "2 teaspoons lemon zest",
    "1 tablespoon chopped fresh cilantro",
    "1 tablespoon chopped fresh dill",
    "1 tablespoon chopped fresh flat-leaf parsley",
    "2 teaspoons chopped fresh mint",
    "2 tablespoons butter, plus more for frying and brushing the tops",
    "1/4 ground coriander seeds",
    "5 green onions, chopped",
    "5 whole ramps (bulb and leaves), washed, dried of excess water, thinly chopped (when not in season, use spinach)",
    "1 large garlic clove, minced",
    "1 pinch cayenne pepper",
    "4 large eggs, beaten with 2 tablespoons water or milk"
  ],
  "__v": 1
}