{
  "hash": "907fe280582aafcd5ad8e3b94b5fb93d706c9c24",
  "title": "Mole Truffles",
  "image": "http://therawchef.com/wp-content/uploads/2012/06/raw-food-recipe-mole-truffles.jpg",
  "href": "http://www.therawchef.com/trc_recipes/mole-truffle/",
  "extension": "",
  "firstAdded": "2015-10-06T00:58:02.914000",
  "users": [
    null
  ],
  "keywords": [
    "raw",
    "almond",
    "butter",
    "make",
    "vitamix",
    "pumpkin",
    "seeds",
    "soaked",
    "rinsed",
    "dehydrated",
    "raisins",
    "water",
    "maple",
    "syrup",
    "nama",
    "shoyu",
    "cumin",
    "mortar",
    "pestle",
    "ancho",
    "chilies",
    "deseeded",
    "chipotle",
    "pepper",
    "roughly",
    "cacao",
    "vanilla",
    "bean",
    "scraped",
    "reserve",
    "pod",
    "uses",
    "nutmeg",
    "cinnamon",
    "cayenne",
    "smoked",
    "hot",
    "paprika",
    "ooosha",
    "highquality",
    "dark",
    "chocolate"
  ],
  "directions": [
    "0",
    "Method",
    "Soak the chipotle, anchos and raisins in enough water to cover for 4 hours or until soft.",
    "I made my own almond butter by using my Vitamix. Put 250 g of soaked and dehydrated almonds in the Vitamix. Turn the blender on high speed and, using the tamper stick, push the nuts into the blades until you have reached a nice smooth consistency. Be aware that the blender conducts a fair bit of heat, so you want to really use the tamper stick to keep things moving and finish the butter within a minute of blending. It’s best to cool the butter in the fridge or freezer before proceeding with the rest of the recipe. This will keep the heat down.",
    "Add the remaining ingredients except the melted chocolate and blend like fury, using the tamper stick to help you. Don’t add more liquid as it was change the recipe completely. In the end, however, if you choose to add more liquid, then you will need to also add a bit more chocolate to keep the consistency right.",
    "Turn the mix out into a large mixing bowl, pour in the melted chocolate and whisk it all to combine. At this stage you could also add some textures, like cacao nibs or chopped pumpkin seeds, if you wanted textured truffles.",
    "Cover with cling film; press the film right on top of the mix so it doesn’t create a skin while it cools. Set in the fridge or freezer. The best thing to do is leave it in the fridge overnight. This allows it to set slowly, and the flavours will develop more. In fact, over the coming days the flavours will continue to develop.",
    "Finally, with cacao-dusted hands, roll the truffles into balls. Alternatively, you can set the mix into silicon moulds, pop them out and then roll in chocolate. If you choose to roll into balls, then don’t coat with powders as this will not allow the chocolate to adhere. You could, however, roll them in chopped nuts and then dip in chocolate for a nice underlying texture."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "250 g (9 oz) raw almond butter (or make your own in the Vitamix)",
    "50 g (1.5 oz) pumpkin seeds — soaked, rinsed and dehydrated",
    "75 g (2 1/2 oz) raisins + 100 g (3.5 oz) soak water",
    "50 g (1.5oz) maple syrup",
    "2 teaspoons nama shoyu",
    "1 1/2 teaspoons whole cumin seeds, ground in a mortar and pestle",
    "2 ancho chilies, de-seeded and soaked with the raisins",
    "2 teaspoons chipotle pepper, de-seeded and roughly chopped",
    "35 g (1.2 oz) cacao powder",
    "1 teaspoon vanilla extract or 1 vanilla bean, scraped (Reserve the empty pod for other uses.)",
    "1/8 teaspoon grated nutmeg",
    "1 tablespoon cinnamon powder",
    "Pinch of cayenne pepper or smoked hot paprika (optional)",
    "225 g (8 oz) 78% Ooosha dark chocolate or a high-quality raw dark chocolate of your choice"
  ],
  "__v": 1
}