{
  "hash": "5aca1699edc0198075c9998c45fc671f38499f28",
  "title": "Raw Fermented Almond Cheeze",
  "image": "",
  "href": "http://www.superkitchenmachine.com/2010/6606/thermomix-raw-almond-cheese-recipe.html",
  "extension": "",
  "firstAdded": "2015-03-28T08:54:01.596000",
  "users": [
    null
  ],
  "keywords": [
    "raw",
    "almonds",
    "organic",
    "best",
    "course",
    "soaked",
    "hours",
    "rinsed",
    "skinned",
    "tips",
    "removing",
    "skins",
    "water",
    "light",
    "miso",
    "probiotic",
    "use",
    "udos",
    "nutmeg",
    "garlic",
    "salt",
    "nutritional",
    "yeast",
    "glutenfree",
    "coldpressed",
    "flax",
    "oil",
    "black",
    "peppercorns",
    "andor",
    "cracked",
    "pepper",
    "coarse"
  ],
  "directions": [
    "0",
    "Put soaked, skinned almonds in Thermomix bowl with water, miso, and probiotic powder. Blend for one minute on speed 8.",
    "Line a colander or strainer with cheesecloth and set over a bowl to collect liquid as it drains. Put blended (almond meal) mixture into cheesecloth and overlap with extra cheesecloth. Place a small plate and weight on top. Allow this almond meal to ferment in a warm (not hot) place for 12-24 hours. (Less time is needed in warmer weather.) I put mine in the oven with just the light bulb turned on for 24 hours. (See tips below for more about fermenting.)",
    "Once fermented, do the following: put garlic powder, nutritional yeast, ½ tsp. salt and nutmeg into dry Thermomix and whiz 5 seconds on speed 8.",
    "Add the flax oil and the fermented almond ‘cheese’ and mix gently for 5 seconds on REVERSE speed 1.",
    "Press into molds (use a bowl, container, or mini cake pan) and refrigerate. After about four hours (or more), gently remove from molds and coat the rounds with a mixture of peppercorns and ground salt. (Depending on what type of pepper you are using, you may want to loosely grind peppercorns with coarse salt in Thermomix before doing this.) Keep wrapped in parchment paper or butchers paper in fridge for up to 5-6 days.",
    "Serve as you would cream cheese or goat cheese. Consider blending with more healthy flax oil and minced fresh garlic or herbs to make a healthy dairy-free veggie dip as shown in photos. (Corn chips anyone?)"
  ],
  "ingredients": [
    "0",
    "290 g. raw almonds (organic is best of course) soaked for 8-10 hours, drained, rinsed and skinned (see tips below about removing skins)",
    "250 ml water",
    "1 tsp. light miso",
    "½ tsp. probiotic powder (I use Udo’s Choice, see tips below)",
    "⅛ tsp. nutmeg powder",
    "½ tsp. dried garlic powder (see tips below)",
    "½ tsp. salt",
    "2 tbsp. nutritional yeast flakes (see tips below about gluten-free)",
    "10 g. organic cold-pressed flax oil",
    "black or other peppercorns and/or cracked pepper",
    "coarse salt"
  ],
  "__v": 1
}