{
  "hash": "94b8e034f74dc7f0aefd3726e52a966c8bf4a03f",
  "title": "Vegan Chickpea Meatballs in Creamy Curry Cashew Sauce",
  "image": "http://ripe-life.com/wp-content/uploads/2015/06/4.jpg",
  "href": "http://ripe-life.com/vegan-chickpea-meatballs-in-creamy-curry-cashew-sauce/",
  "extension": "Chrome",
  "firstAdded": "2017-08-14T21:06:43.635000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare the chickpea mixture",
    "In a medium bowl, mash the chickpeas until they are mushy but not quite pureed.",
    "Preheat a large, heavy pan over a medium heat. Toast the almonds for about 7 minutes, tossing frequently, until they are golden and browned in some spots. Transfer immediately to the bowl containing the chickpeas. Next, toast the cumin seeds for 3 minutes or so, until fragrant and a shade or two darker. Transfer those to the bowl as well.",
    "Add the zucchini cilantro ginger, garlic, salt, and black pepper, and mix well.",
    "Now add the breadcrumbs and use your hands to mix and mush until it holds together. Cover with plastic wrap (or a plate) and place in the fridge for at least 45 minutes.",
    "Prepare the sauce",
    "Drain the cashews and add to a blender along with the broth. Blend until very smooth. Scrape down the sides with a rubber spatula to make sure you get everything.",
    "Preheat a pan over a medium heat and add the coconut oil. Saute the onion in the oil for about 3 minutes, until translucent. Add the garlic ginger and cayenne pepper and cook just until fragrant, 15 seconds or so. Add the curry powder, garam masala, and cumin and toss for a minute or so, just to toast the spices a bit.",
    "Add the coconut milk, tomato paste, blended cashews and salt. Bring to a low simmer and let cook for 15 minutes or so. It should thicken up nicely. Add the peas and let them warm through. Taste for seasonings, then turn off the heat and cover until ready to serve.",
    "Cook the chickpea balls",
    "Preheat a large cast-iron pan (or any pan that is nonstick and good for frying)over a medium heat. Line the counter with some parchment paper to keep the formed chickpea dough from sticking. Scoop up a scant ¼ cup of the mixture. Roll between your hands to pack it well, and then roll into a ball shape. Set on the parchment and continue to form all 12.",
    "When the pan is hot enough, add some coconut oil and make sure it coats the bottom of the pan. Now add the kofta, rolling each one around in the pan when you add it, making sure to coat all sides. Use a little extra oil, if needed.",
    "Fry them for about 7 minutes, rolling them around in the pan to get them browned on all sides. They don't have to be uniformly browned; just do your best. Once browned, turn off the heat.",
    "To assemble",
    "Scoop some rice on to each plate, place 3 koftas on top of the rice, and cover with sauce. Garnish with coriander, if you like, and serve."
  ],
  "ingredients": [
    "0",
    "2 cups chickpeas, rinsed and drained",
    "½ cup slivered almonds",
    "1½ tsp cumin seeds",
    "1½ zucchinis shredded",
    "¼ cup finely chopped fresh cilantro",
    "1 tbsp minced fresh ginger",
    "2 cloves garlic, minced",
    "½ tsp salt",
    "Several pinches of freshly ground black pepper",
    "1 cup Panko breadcrumbs",
    "For the sauce:",
    "1 cup cashews, soaked for at least 2 hours",
    "2 cups vegetable broth",
    "1 tbsp refined coconut oil",
    "1 medium yellow onion, very finely diced",
    "3 cloves garlic, minced",
    "1 tablespoon minced fresh ginger",
    "1 tablespoon curry powder",
    "1 teaspoon garam masala",
    "1 teaspoon ground cumin",
    "½ teaspoon cayenne pepper",
    "1 tin lite coconut milk",
    "3 tbsp tomato paste",
    "1 tsp salt",
    "1 cup frozen peas",
    "For everything else",
    "Refined coconut oil, for frying (2 tbsp)",
    "Cooked basmati rice, for serving",
    "Fresh coriander, for garnish (optional)"
  ],
  "__v": 1
}