{
  "hash": "c9e19cbcc76cf91fc77f9c7c45a8aaa56e3bd9b6",
  "title": "Slow-Cooker Chicken Burrito Bowls",
  "image": "https://cdn.apartmenttherapy.info/image/fetch/f_auto,q_auto:eco,c_fill,g_auto/https://storage.googleapis.com/gen-atmedia/3/2014/08/f33558b0c4da039b6315aa4ada2aa09939f2cad7.jpeg",
  "href": "https://www.thekitchn.com/recipe-slow-cooker-chicken-burrito-bowls-207333",
  "extension": "Firefox",
  "firstAdded": "2019-01-31T23:33:33.427000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Combine the chicken, diced tomatoes and their juices, chicken broth, chili powder, salt, and cumin in a 2 1/2- to 3 1/2-quart slow cooker. Make sure the chicken is covered with liquid, adding additional broth as needed. Cover and cook on the LOW setting for 3 to 4 hours.",
    "Uncover and stir in the beans, rice, and corn. Cover and continue cooking on the LOW setting for 3 to 4 hours more. Check the rice periodically in the last hour of cooking, stirring once or twice to make sure the rice cooks evenly and adding more chicken broth if the mixture seems dry. Cooking is done when the rice is tender — if the rice is done but there is still liquid left in the slow cooker, uncover and cook on the HIGH setting to let the liquid evaporate.",
    "Use 2 forks to shred the chicken into bite-sized pieces. You can do this either in the slow cooker itself and then mix it into the rice, or you can transfer the chicken to a clean cutting board if you prefer to keep it separate. Taste and stir in more salt or other seasonings as needed. Serve burrito bowls with a selection of toppings.",
    "Recipe Notes",
    "Cooking the rice separately: If you won't be home to add the rice to the slow cooker, you can skip this step and cook it separately on the stovetop just before serving (use these directions). To modify the recipe, combine the chicken, diced tomatoes, 1/2 cup of stock, and spices in the slow cooker and cook for 6 to 8 hours on the LOW setting. Add the beans and corn and cook for 30 minutes more, or until warmed through, while you're cooking the rice (omit the remaining chicken broth).",
    "Vegetarian burrito bowls: Combine the diced tomatoes, 1 cup low-sodium vegetable broth, spices, rice, black beans, and corn in the slow cooker. Cook on the LOW setting for 3 to 4 hours, until the rice is tender and has absorbed all the liquid. Stir once or twice toward the end of cooking to make sure the rice is cooking evenly.",
    "Beyond burrito bowls: Besides burrito bowls, you can use this filling to make regular tortilla-wrapped burritos or freezer burritos.",
    "Storage: The burrito mixture will keep for 1 week refrigerated or for 3 months in the freezer."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 to 1 1/2 pounds",
    "boneless skinless chicken breasts, chicken thighs, or a mix",
    "1 (14.5-ounce) can",
    "diced tomatoes",
    "1 cup",
    "low-sodium chicken broth, plus more as needed",
    "2 teaspoons",
    "chili powder",
    "2 teaspoons",
    "salt",
    "1 teaspoon",
    "ground cumin",
    "1 (15-ounce) can",
    "black beans, drained and rinsed",
    "1 cup",
    "uncooked brown rice",
    "1 cup",
    "frozen corn kernels",
    "Optional toppings: shredded cheese, chopped cilantro, sour cream, diced avocado, salsa, hot sauce, diced green onions, shredded lettuce"
  ],
  "__v": 1
}