{
  "hash": "98762ba5034c3c46acd4dbd32a5bbe281f7d5cfe",
  "title": "greek orzo stuffed red peppers with lemony basil tomatoes\nBy halfbakedharvest\nCourse: main course\nCuisine: greek\nKeyword: feta cheese, roasted peppers, vegetarian dinner\nThese Greek Orzo Stuffed Red Peppers are quick, simple, vegetarian, healthy, and SO GOOD. Slow roasted red peppers stuffed with greek orzo, feta cheese, and topped with fresh lemony basil tomatoes. Summer dinner perfection! prep time 10 minutes cook time 20 minutes total time 30 minutes servings servings calories 454 kcal",
  "image": "https://www.halfbakedharvest.com/wp-content/uploads/2018/07/Greek-Orzo-Stuffed-Red-Peppers-with-Lemony-Basil-Tomatoes-1-300x300.jpg",
  "href": "https://www.halfbakedharvest.com/greek-orzo-stuffed-red-peppers/",
  "extension": "Chrome",
  "firstAdded": "2020-05-25T13:50:51.632000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 400 degrees F. 2. In a 9x13 inch baking dish, toss the peppers with the olive oil, garlic, and a pinch each of salt and pepper. Add the oregano. Transfer to the oven and roast for 20-25 minutes or until the peppers are beginning to char. 3. Meanwhile, bring a large pot of salted water to a boil. Cook the orzo according to package directions until al dente. Drain and toss with the balsamic vinegar, olives, pepperoncini, pine nuts, and feta. 4. Make the lemon basil tomatoes by combining all ingredients in a small bowl. 5. Stuff the warm orzo inside the peppers. Drizzle with the lemon basil tomato sauce. Enjoy!"
  ],
  "ingredients": [
    "0",
    "3 red bell peppers, halved",
    "3 cloves garlic, minced or grated",
    "1 tablespoon extra virgin olive oil",
    "3 sprigs fresh oregano",
    "kosher salt and pepper",
    "1 cup dry orzo or quinoa",
    "2 tablespoons balsamic vinegar",
    "1/2 cup pitted kalamata olive",
    "2 pepperoncini, chopped",
    "2 tablespoons toasted pine nuts, chopped",
    "1/2 cup crumbled feta cheese"
  ],
  "__v": 1
}