{
  "hash": "c0ee5c747a3ce00e92b0f8a2a2e4cbcfae791678",
  "title": "SKINNYMIXER’S VIETNAMESE PHO",
  "image": "http://skinnymixers.com.au/wp-content/uploads/2015/08/pho1.jpg",
  "href": "http://skinnymixers.com.au/skinnymixers-vietnamese-pho/",
  "extension": "",
  "firstAdded": "2015-12-30T02:52:19.778000",
  "users": [
    null
  ],
  "keywords": [
    "shin",
    "chunks",
    "meaty",
    "beef",
    "bones",
    "quick",
    "pho",
    "brown",
    "onion",
    "ginger",
    "washed",
    "unpeeled",
    "cinnamon",
    "black",
    "peppercorns",
    "coriander",
    "seeds",
    "star",
    "anise",
    "clove",
    "soy",
    "tamari",
    "fish",
    "salt",
    "coconut",
    "sugar",
    "garlic",
    "replace",
    "consomm",
    "readymade",
    "stock",
    "supermarket",
    "omit",
    "instructions",
    "serve",
    "rice",
    "noodles",
    "wombok",
    "free",
    "alternative",
    "sirloin",
    "steak",
    "garnishes",
    "mint",
    "leaves",
    "thai",
    "basil",
    "bean",
    "sprouts",
    "shallot",
    "redbrown",
    "red",
    "birds",
    "eye",
    "chilli",
    "hoisin",
    "lime",
    "wedges"
  ],
  "directions": [
    "0",
    "DIRECTIONS",
    "Preheat oven to 220 °C and place beef onto a roasting tray. When the oven is ready, roast beef for 30 mins.",
    "Add onion and ginger to the roasting tray with the beef, roast for a further 30 mins.",
    "Add dried spices to roasting tray with beef, onion and ginger for a further 5 mins. When this is finished, your beef should be dark and your onion charred.",
    "Put soy sauce, fish sauce, salt and sugar into mixer bowl. Insert your simmering basket into your mixer bowl, put your roasted spices into the simmering basket first, followed by the roasted beef then onion, ginger and garlic cloves.",
    "Put 1500 g water into mixer bowl and cook for 60 min/100 degrees/speed 3/MC on. With 10 mins remaining, prepare your noodles, sliced steak and garnishes to serve.",
    "When broth has finished cooking, carefully remove simmering basket and discard the cooked beef etc. Pour hot broth immediately over the prepared bowls to cook steak.",
    "Quick Pho Instructions",
    "Preheat oven and roast onion, ginger and spices as above.",
    "Put the consommé, 1000 g water, soy sauce, fish sauce and sugar into mixer bowl.",
    "Insert your simmering basket into your mixer bowl, put your roasted spices into the simmering basket first, followed by the onion, ginger and garlic cloves. Cook for 30 min/100 degrees/speed 3/MC on. When broth has finished cooking, carefully remove simmering basket and discard the onions etc. Pour hot broth immediately over the prepared bowls to cook steak.",
    "NOTES",
    "Quick pho isnt as good as the authentic broth, but its still very yum.",
    "For an even more authentic broth, cook it for an additional 1-2 hours, topping up water as necessary.",
    "You can stretch this out to serve 6 by increasing the quantities of your garnishes.",
    "You may need to adjust your oven temp, or cooking time - based on how hot/cold your oven is. Just use your common sense judgement with this one. Its not a big deal if your beef gets quite blackened, but you dont want to burnt to a crisp.",
    "Adjust recipe to suit your specific tastes. I have intentionally kept this light, if you prefer a sweeter, more savoury or stronger aniseed tasting pho - adapt, adapt adapt! ;)",
    "Bellini Users",
    "Use blunt blade for this recipe."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "500 g beef shin, cut into large chunks (or other meaty beef bones) See below for quick pho",
    "1 large brown onion, peeled, halved",
    "50 g fresh ginger, washed, unpeeled",
    "1 cinnamon stick",
    "1 tsp black peppercorns",
    "1 tsp coriander seeds",
    "3 star anise",
    "1 clove",
    "40 g soy sauce (or tamari)",
    "10 g fish sauce (optional)",
    "1 tsp salt",
    "10 g coconut sugar (or brown sugar)",
    "2 garlic cloves, peeled",
    "Quick Pho",
    "Replace beef bones with 500 ml ready made Beef Consommé, found with the ready-made stock at the supermarket. Omit the additional salt. See Instructions below.",
    "To Serve",
    "500 g ready made thin rice noodles or shredded wombok for grain free alternative",
    "300 g sirloin beef steak, very thinly sliced",
    "Optional Garnishes",
    "A handful of mint leaves, thai basil and fresh coriander",
    "200 g bean sprouts",
    "1 shallot (small red/brown one), thinly sliced",
    "Fresh red birds eye chilli",
    "Chilli sauce",
    "Hoisin sauce",
    "Fresh lime, cut into wedges"
  ],
  "__v": 1
}