{
  "hash": "c8400e5c4b33d2277d477a9a2c67da435d72aafd",
  "title": "Renee Erickson's Roast Chicken with Brown Butter and Lemons",
  "image": "https://images.food52.com/URvknNBadNWds2qbg5psjPWjZ_8=/753x502/bde85885-ca5e-4815-8571-7274fd8e4a70--unnamed-3.jpg",
  "href": "https://food52.com/recipes/51951-renee-erickson-s-roast-chicken-with-brown-butter-and-lemons",
  "extension": "Chrome",
  "firstAdded": "2018-01-05T12:50:11.837000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 500° F. Place a large, heavy ovenproof skillet on the bottom rack of the oven and let it preheat for 5 minutes.",
    "Put 1 tablespoon of the olive oil and the stick of butter into the hot pan. Return the pan to the oven for a minute or so, until the butter is melted and foamy. Carefully place the chicken pieces into the pan, skin side up. Holding the pan at an angle with an oven mitt, spoon the butter over the chicken, basting it for a full minute, until the butter has run down every possible surface of the pieces. Sprinkle the chicken evenly with the sea salt, crushing it between your fingers as you go.",
    "Roast the chicken in the hottest part of the oven (bottom right, for most ovens) for 35 to 40 minutes, rotating the pan about halfway through. (Do not turn the chicken over. If your chicken's skin begins to brown before the inside is fully cooked, move it to a cooler section of your oven, tent it with aluminum foil, or place a baking sheet on the rack above it.) The chicken is done when the skin is nicely browned and the thickest part of the biggest piece measures 165° F on an instant-read thermometer.",
    "Set the chicken aside on a cutting board to rest for 5 minutes.",
    "Meanwhile, strain the capers, if needed, and transfer them to a paper towel-lined plate to dry for a moment. Heat the remaining 1/2 cup olive oil in a small saucepan over high heat. When the oil begins to move in the pan (if you add a caper, it should sizzle ferociously), carefully add the capers, reduce the heat to medium, and fry them until they flower and crisp, 3 to 4 minutes, or more for larger capers. Using a slotted spoon, transfer the capers back to the paper towel.",
    "Using a sharp knife, separate the hindquarters from the breasts of each chicken. Transfer the chicken to a serving plate and top with the fried capers and lemon peel. Serve warm or at room temperature, drizzled with a great finishing oil."
  ],
  "ingredients": [
    "0",
    "1/2 cup plus 1 tablespoon extra-virgin olive oil, divided",
    "1/2 cup (1 stick) unsalted butter",
    "One (4-pound) chicken, back removed, halves dried 1 hour in the refrigerator, and brined if desired",
    "1 tablespoon crunchy gray salt",
    "1/2 cup capers (salt-packed preferred), rinsed well",
    "Julienned peel of 1 preserved lemon",
    "Finishing oil, for drizzling"
  ],
  "__v": 1
}