{
  "hash": "9a42b4aee2fa0ed83fe7fec21e72fc04be9506ee",
  "title": "מתכון לפחזניות במילוי קרם וניל\n25 פחזניות, חלבי, 30 דקות עבודה, שעה וחצי עד שאפשר לאכול\nעל פי מתכון של כריסטוף מישלאק",
  "image": "https://www.thekitchencoach.co.il/wp-content/uploads/2016/06/IMG_9028.jpg",
  "href": "https://www.thekitchencoach.co.il/%D7%9E%D7%AA%D7%9B%D7%95%D7%9F-%D7%A4%D7%97%D7%96%D7%A0%D7%99%D7%95%D7%AA-%D7%A7%D7%A8%D7%9D-%D7%95%D7%A0%D7%99%D7%9C/",
  "extension": "Chrome",
  "firstAdded": "2019-11-04T13:24:55.994000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "אופן הכנה:",
    "מחממים את התנור ל-190 מעלות (מצב טורבו) – מומלץ בחום (הבנתם? =] ) לחמם שעה לפחות מראש, ולא רק עד שהנורית הקטנה נכבית, היא לא שווה הרבה.",
    "מתחילים בהכנת הבצק הרבוך:",
    "בסיר קטן שמים את המים, החלב, החמאה, הסוכר והמלח.",
    "מביאים לרתיחה עדינה מעל להבה בינונית ומבשלים עד שהחמאה נמסה.",
    "מוסיפים את הקמח ומערבבים מיד בעזרת כף עץ או לקקן. מבשלים 2 דקות נוספות לקבלת רביכה, בערבוב מתמיד.",
    "מורידים מהאש ומעבירים את הבצק למיקסר עם וו גיטרה.",
    "מערבבים במהירות בינונית כ3-4 דקות, לקירור הבצק.",
    "מוסיפים ביצה אחת בכל פעם. לא מוסיפים את הביצה הבאה עד שהביצה שלפניה נטמעה לחלוטין בבצק. אם אחרי 3 ביצים מתקבל בצק יפה שמשאיר סימן V על ההקצפה כמו בתמונות, לא מוסיפים את הביצה הרביעית.",
    "ממשיכים ללוש כדקה נוספת לקבלת בצק מבריק, דביק והומוגני.",
    "יוצרים את הפחזניות ואופים:",
    "מעבירים את הפחזניות לשק זילוף.",
    "מרפדים מגש שטוח בנייר אפייה. שמים מעט מהבצק בפינות התבנית, מתחת לנייר, כדי שלא יתרומם במהלך הזילוף.",
    "מזלפים פחזניות בקוטר 4-5 ס״מ, יוצאות בין 20-30 פחזניות. מרטיבים את האצבע ופוחסים את השפיצים של הפחזניות, כדי שלא ישרפו באפייה.",
    "מכניסים למדף המרכזי של התנור ואופים כ14-20 דקות, עד שהפחזניות תפוחות אך עדיין לא זהובות לחלוטין מכל הכיוונים. נמנעים מלפתוח את דלת התנור בזמן הזה.",
    "מורידים את החום ל170 מעלות ומשלימים אפייה 15-20 דקות נוספות – עד שהפחזניות זהובות לחלוטין ונהיו פריכות.",
    "מוציאים ונותנים לפחזניות להתקרר בתבנית.",
    "למילוי:",
    "מכינים קרם פטיסייר לפי המתכון הזה. לאחר ההכנה שומרים אותו בקירור, חשוב שיהיה קר בעת הערבוב עם הקצפת.",
    "מכינים קצפת: שמים את השמנת המתוקה בקערה רחבה ומקציפים עם מטרפה ידנית או חשמלית 3-5 דקות או עד שהשמנת אוורירית ויציבה.",
    "מוציאים את קרם הפטיסייר מהקירור ומערבבים אותו היטב עם מטרפה.",
    "מוסיפים לפטיסייר 1/2 מהקצפת ומערבבים בעדינות. כשהנגלה הראשונה נטמעת מוסיפים את שאר הקצפת ושוב מקפלים.",
    "מעבירים את הקרם לשק זילוף ושומרים בקירור עד שמוכנים לשימוש. את הקרם אפשר להכין לפני או אחרי שמכינים את הפחזניות. העיקר ששיניהם יהיו קרים בעת המפגש.",
    "מילוי הפחזניות:",
    "חוצים את הפחזניות לרוחבן.",
    "חותכים את הפינה של שק הזילוף וממלאים את הפחזניות החצויות בקרם דיפלומט.",
    "לגנאש:",
    "שמים את השוקולד בקערה.",
    "מרתיחים את החלב או המים בסיר קטן ויוצקים את הנוזל החם על השוקולד.",
    "מניחים ל2 דקות, ואז מערבבים עם מטרפה למרקם חלק.",
    "להגשה:",
    "שמים מעט רוטב שוקולד חם בצלחת הגשה, מעל כל צלחת שמים 3-4 פחזניות מלאות. אם רוצים מפדרים באבקת סוכר.",
    "את הפחזניות הכי כדאי להגיש ביום ההכנה. בקירור נשמרות שלושה ימים, ניתן גם להקפיא לשלושה חודשים."
  ],
  "ingredients": [
    "0",
    "מצרכים:",
    "לפחזניות:",
    "100 מ״ל (1/3 כוס+1/2 1 כפות) מים",
    "100 מ״ל (1/3 כוס+1/2 1 כפות) חלב",
    "100 גרם חמאה",
    "100 גרם (1/2 כוס +2 כפות) קמח",
    "5 גרם (כפית) סוכר",
    "קורט מלח",
    "3-4 ביצים גודל M",
    "למילוי (קרם דיפלומט):",
    "מתכון אחד של קרם פטיסייר",
    "125 גרם (1/2 מיכל של 250 מ\"ל) שמנת מתוקה",
    "לגנאש (רוטב שוקולד):",
    "250 גרם (1/2 2 חפיסות) שוקולד מריר, שבור לקוביות (ועדיף קצוץ)",
    "240 מ\"ל 1 כוס) חלב או מים",
    "להגשה:",
    "אבקת סוכר"
  ],
  "__v": 1
}