{
  "hash": "d102644a6974c32772b6c4b8e1744598015da73e",
  "title": "Buffalo Chicken Enchiladas",
  "image": "//food.fnr.sndimg.com/content/dam/images/food/fullset/2018/5/1/0/FNK_Buffalo-Chicken-Enchiladas-H1_s4x3.jpg.rend.hgtvcom.826.620.suffix/1525187347682.jpeg",
  "href": "https://www.foodnetwork.com/recipes/food-network-kitchen/buffalo-chicken-enchiladas-4595591",
  "extension": "Chrome",
  "firstAdded": "2019-01-04T19:44:47.873000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "WATCH\tWatch how to make this recipe.",
    "Preheat the oven to 400 degrees F. Butter a 9-by-13-inch baking dish.",
    "Mix the chicken, cream cheese, 1 cup of the Cheddar, 1/3 cup of the hot sauce, white parts of the scallions and cumin in a large bowl until well combined. Stir together the butter, remaining 2/3 cup hot sauce and 3 tablespoons water in a medium bowl.",
    "Microwave the tortillas in batches until warm, softened and foldable, about 30 seconds. Keep warm between damp paper towels.",
    "Spoon a portion of the chicken mixture down the middle of each tortilla and roll up. Place them side by side, seam-side down, in the prepared pan. Pour the hot sauce mixture over the tortillas. Sprinkle with the remaining 1 cup Cheddar and the blue cheese and bake until the cheese is melted and bubbly, 15 to 17 minutes.",
    "Drizzle the blue cheese dressing over the enchiladas and sprinkle with the scallion greens. Serve with more hot sauce."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "3 tablespoons unsalted butter, melted, plus more for greasing the pan",
    "4 cups shredded rotisserie chicken",
    "8 ounces cream cheese, at room temperature",
    "2 cups shredded Cheddar",
    "1 cup hot sauce, plus more for serving, such as Frank's",
    "1 bunch scallions, thinly sliced, white and green parts separated",
    "1/4 teaspoon ground cumin",
    "16 corn tortillas",
    "2 tablespoons crumbled blue cheese",
    "2 tablespoons blue cheese dressing"
  ],
  "__v": 1
}