{
  "__v": 1,
  "directions": [
    "0",
    "Use a flat, wide-bottomed pan to do this.",
    "To prepare the ingredients: Finely finely mince the celery, onion carrots (smaller than dices), then set aside. I prefer doing this in a food-processor. Wash the dried porcini mushrooms to get rid of any sands and impurity, then set aside (no need to soak). Blend all the canned tomatoes with the juice inside until smoothly pureed, and set aside.",
    "STEP 1 – Browning the meat and vegetables (approx 30 min in total): Heat up the pan over medium-high heat and add 1/3 cup of extra virgin olive oil. Add the pancetta and cook until slightly browned, then add the ground pork and ground beef. Season with 1 tsp of sea salt/grey salt and 1 tsp of freshly ground black pepper. This is quite a large amount of meat and they WILL NOT brown immediately. Juice/liquid may ooze out but THAT’S OK, just keep cooking until all the liquid has evaporated, and that there’s a layer of browning at the bottom of the pan, approx 15 min.",
    "Now add the porcini mushrooms. minced garlic, fresh thyme, minced rosemary and chili flakes. Cook until fragrant. Add all the minced vegetables (celery, onion, carrot), bay leaves, tomato paste and Parmigiano rind, and season again with 1 tsp of sea salt/grey salt and 1/2 tsp of freshly ground black pepper. The vegetables will release juice/liquid which is going to “loosen” the browning on the bottom of the pan. Scrape the brownings with a wooden spatula, then just as what was done before, keep cooking until all the juice/liquid has evaporated and that there’s A BRAND NEW layer of browning forming at the bottom of the pan, approx 15 min.",
    "STEP 2 – Reducing milk and harvesting caramel (approx 1:40 ~ 2 hours in total): Once all the meats and vegetables have browned properly, add 1 1/2 cup of whole milk (if using red wine, add and reduce it down completely BEFORE adding the milk). Keep the heat on medium-high, and stir to evenly mix all the ingredients together. The milk will loosen the brownings and you will scrape it off with your wooden spatula to let it melt and become part of the sauce, then let it cook and the milk will completely evaporate and form ANOTHER NEW LAYER of brownings, approx 20 min. You see the repetition now, don’t you? Then you add the next 1 1/2 cup of whole milk and repeat this process. If your stove tends to heat unevenly, move around the pan to “maximize” the brownings. Don’t be afraid to let it get deeply rich and dark brown, as long as it DOESN’T BURN/BLACKEN (moving the pan also prevents partial burning due to centralized heat). You will harvest the caramel (the brownings!) in each of the 5 additions of milk, and by the end of it, you should have a pot of meat sauce that’s rich and brown with intense flavor.",
    "STEP 3 – Adding and reducing the tomatoes (approx 1: 30 hour): Once the last/5th addition of whole milk has been added, reduced and browned, you can now add all the pureed tomatoes. Season again with sea salt/grey salt and freshly ground black pepper. Stir to evenly mix the ingredients and scrape the brownings on the bottom of the pan. Reduce the heat down to medium-low and partially cover the pan with a lid (tomato sauce SPLATTERS like crazy!). Let the sauce reduce down by 1/3 to almost 1/2. Stir occasionally to prevent burning.",
    "To serve: Cook the pasta (I prefer fresh tagliatelle) according to instructions. In another pan, add a couple tbsp of freshly grated Parmigiano cheese (for each serving) and little nubs of butter (about 1 tsp for each serving). Add the cooked pasta to the pan with a generous amount of ragu. Cook and stir over medium-high heat until everything’s incorporated together.",
    "Serve with more freshly grated Parmigiano cheese and drizzles of extra virgin olive oil."
  ],
  "firstAdded": "2014-06-19T14:45:05.213000",
  "hash": "095f8079ba24225a5e2902d216c8dee04134357d",
  "href": "http://www.ladyandpups.com/2013/10/28/the-inconvenient-ragu-th-eng/",
  "image": "http://www.ladyandpups.com/wp-content/uploads/2013/10/ragu25.jpg",
  "ingredients": [
    "0",
    "1/3 cup (75 ml) (or slightly more if your ground beef is very lean) of extra virgin olive oil",
    "1/4 cup of finely diced pancetta",
    "21 oz (600 grams) of fatty ground pork",
    "23.6 oz (670 grams) of ground beef",
    "1/4 heaping cup (10 grams) of dried porcini mushrooms",
    "7 cloves of garlic, minced",
    "10 sprigs of fresh thyme",
    "1 tbsp of minced rosemary leaves",
    "1 tsp of chili flakes",
    "2 medium stalks of celery",
    "1 large onion",
    "1 small carrot",
    "4 dried bay leaves (or 2 fresh bay leaves)",
    "4 tbsp of tomato paste",
    "1 piece of (2″x2″) of Parmigiano rind",
    "7 1/2 cup (1875 ml) of whole milk, divided into 1 1/2 cup or 375 ml for each addition",
    "4 cans (400 grams for each can or 1600 grams in total) of good quality Italian peeled tomatoes",
    "Coarse sea salt/grey salt and freshly ground black pepper to season along the way",
    "To finish:",
    "Any type of fresh thick-cut pasta, such as tagliatelle",
    "Little nub of unsalted butter for each serving",
    "Aged Parmigiano cheese to grate",
    "Extra virgin olive oil to drizzle",
    "Any type of fresh thick-cut pasta, such as tagliatelle",
    "Little nub of unsalted butter for each serving",
    "Aged Parmigiano cheese to grate",
    "Extra virgin olive oil to drizzle"
  ],
  "keywords": [
    "slightly",
    "beef",
    "lean",
    "extra",
    "virgin",
    "olive",
    "oil",
    "pancetta",
    "fatty",
    "pork",
    "heaping",
    "porcini",
    "mushrooms",
    "garlic",
    "sprigs",
    "thyme",
    "rosemary",
    "leaves",
    "chili",
    "medium",
    "stalks",
    "celery",
    "onion",
    "carrot",
    "bay",
    "tomato",
    "parmigiano",
    "rind",
    "milk",
    "divided",
    "addition",
    "total",
    "good",
    "quality",
    "italian",
    "tomatoes",
    "coarse",
    "saltgrey",
    "salt",
    "black",
    "pepper",
    "season",
    "way",
    "finish",
    "type",
    "thickcut",
    "pasta",
    "tagliatelle",
    "nub",
    "unsalted",
    "butter",
    "aged",
    "cheese",
    "grate",
    "drizzle"
  ],
  "title": "ragu",
  "users": [
    null
  ]
}