{
  "hash": "718817411592889f6c5021b4bae11c6eabb40652",
  "title": "Fried Gnocchi with Garlic & Parmesan",
  "image": "http://www.ciaochowbambina.com/wp-content/uploads/2014/03/DSC_0088.jpg",
  "href": "http://www.ciaochowbambina.com/fried-gnocchi-with-garlic-parmesan-3/?utm_source=rss&utm_medium=rss&utm_campaign=fried-gnocchi-with-garlic-parmesan-3",
  "extension": "Chrome",
  "firstAdded": "2015-09-10T08:01:20.376000",
  "users": [
    null
  ],
  "keywords": [
    "lbs",
    "russet",
    "potatoes",
    "flour",
    "egg",
    "salt",
    "olive",
    "oil",
    "garlic",
    "red",
    "pepper",
    "parmesan"
  ],
  "directions": [
    "0",
    "Bring a large pot of salted water to a boil.",
    "Peel and quarter potatoes and add to pot.",
    "Cook until tender but still firm, about 20 minutes.",
    "Drain, cool, and rice potato with a ricer, mill, or fork.",
    "Put flour on a clean, dry surface and create a well in the center.",
    "Place cooled, riced potato in the center of the well.",
    "Create a well in the center of the potato and add the egg and salt.",
    "Combine the ingredients using a fork until they form a dough.",
    "Knead the dough until a ball forms.",
    "Shape the ball into a rectangle and cut eight, four inch, pieces.",
    "Roll each piece into a long 'snake'.",
    "Cut each snake into 1½ inch pieces.",
    "Roll each piece over the tines of a fork or make an indent in the center with your thumb.",
    "Bring a large pot of water to a boil.",
    "Drop in gnocchi and cook for 2 to 4 minutes or until the gnocchi float to the top.",
    "In the meantime, add two Tbsp. olive oil, garlic and red pepper flakes to a skillet and heat.",
    "Drain and add gnocchi to the skillet.",
    "Fry for about 2 minutes, making sure to flip until gnocchi are browned and crisp on both sides.",
    "Serve with an extra splash of olive oil and grated Parmesan."
  ],
  "ingredients": [
    "0",
    "2½ lbs. russet potatoes",
    "2 cups flour",
    "1 egg",
    "½ tsp. salt",
    "3 Tbsp. olive oil",
    "4 cloves garlic",
    "½ tsp. red pepper flakes",
    "⅓ cup Parmesan, freshly grated"
  ],
  "__v": 1
}