{
  "hash": "6dce72c65a2b5a41f449e63956b90a2ad9d1b8d2",
  "title": "CORNED BEEF: HOW TO CURE YOUR OWN",
  "image": "http://blog.ruhlman.com/wp-content/uploads/2010/03/Brine@540.jpg",
  "href": "http://ruhlman.com/2010/03/corned-beef-how-to-cure-your-own/",
  "extension": "Chrome",
  "firstAdded": "2016-09-19T16:59:43.432000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In pot large enough to hold brisket, combine 1 gallon of water with kosher salt, sugar, sodium nitrite (if using), garlic and 2 tablespoons pickling spice. Bring to a simmer, stirring until salt and sugar are dissolved. Remove from heat and let cool to room temperature, then refrigerate until chilled.",
    "Place brisket in brine, weighted with a plate to keep it submerged; cover. Refrigerate for 5 days.",
    "Remove brisket from brine and rinse thoroughly. Place in a pot just large enough to hold it. Cover with water and add remaining pickling spice, carrot, onion and celery. Bring to a boil over high heat, reduce heat to low and cover. Simmer gently until brisket is fork-tender, about 3 hours, adding water if needed to cover brisket.",
    "Keep warm until ready to serve. Meat can be refrigerated for several days in cooking liquid. Reheat in the liquid or serve chilled. Slice thinly and serve on a sandwich or with additional vegetables simmered until tender in the cooking liquid.",
    "*A note about the salt. Salt level not hugely critical here because it’s basically boiled and excess salt moves into cooking liquid. You can weigh out 12 ounces here if you feel better using a scale (approximately a 10% brine). Or you can simply make a 5% brine of however much water you need to cover (6.4 ounces per gallon). When you cook it, season the cooking liquid to the level you want your meat seasoned. Another option is wrapping the brisket in foil and cooking it in a 225 degree oven till tender, but only do this if you’ve used the 5% brine.",
    "Yield: 8 to 10 servings.",
    "Pickling Spice",
    "2 tablespoons black peppercorns",
    "2 tablespoons mustard seeds",
    "2 tablespoons coriander seeds",
    "2 tablespoons hot red pepper flakes",
    "2 tablespoons allspice berries",
    "1 tablespoon ground mace",
    "2 small cinnamon sticks, crushed or broken into pieces",
    "2 to 4 bay leaves, crumbled",
    "2 tablespoons whole cloves",
    "1 tablespoon ground ginger.",
    "Combine peppercorns, mustard seeds and coriander seeds in a small dry pan. Place over medium heat and stir until fragrant, being careful not to burn them; keep lid handy in case seeds pop. Crack peppercorns and seeds in mortar and pestle or with the side of a knife on cutting board.",
    "Combine with other spices, mix. Store in tightly sealed plastic or glass container."
  ],
  "ingredients": [
    "0",
    "With the approach of St. Paddy’s day I got a brisket into the brine Friday, in time to make my wife the corned beef she loves. And I realized I’ve never blogged about it. Everyone who cooks should corn their own beef. It’s easy as brining a chicken. And when you make your own pickling spice (brine photo above, recipe below), you can really pump up the flavor.",
    "Any cut of beef can be “corned” (corn was originally a generic term for grain, deriving from the same root as kernel and grain; corning beef referred to curing beef with grains of salt, McGee, page 477, thanks to Patrick for his corrective comment). But the best cuts are the tougher, less-expensive cuts such as brisket. The only uncommon ingredient is the sodium nitrite, pink salt, available by mail here. If you have any shops that make their own bacon, hams, or smoked sausage, they may have some on hand. This is what accounts for the deep red color of the beef and also gives it its distinctive flavor. I think it’s important but it’s not necessary from a safety standpoint.",
    "I know this is a little late for your St. Patrick’s day, but it’s so delicious it’s worth making any time of the year.",
    "The following recipe is from Charcuterie: The Craft of Salting, Smoking and Curing.",
    "Home-Cured Corned Beef",
    "1-1/2 cups kosher salt*",
    "½ cup sugar",
    "4 teaspoons pink salt (sodium nitrite), optional",
    "3 cloves garlic, minced",
    "4 tablespoons pickling spice",
    "1 5-pound beef brisket",
    "1 carrot, peeled and roughly chopped",
    "1 medium onion, peeled and cut in two",
    "1 celery stalk, roughly chopped."
  ],
  "__v": 1
}