{
  "hash": "2aaeccd1a88febfb91b5d5913ab81c5a9320ee33",
  "title": "EASY CINNAMON BAKED APPLES",
  "image": "https://minimalistbaker.com/wp-content/uploads/2017/10/AMAZING-Cinnamon-Baked-Apples-10-ingred-1-bowl-NATURALLY-SWEETENED-Tender-Delicious-bakedapples-vegan-plantbased-fall-applesglutenfree-refinedsugarfree-11.jpg",
  "href": "https://minimalistbaker.com/easy-cinnamon-baked-apples/",
  "extension": "",
  "firstAdded": "2018-04-30T16:54:44.362000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 degrees F (176 C) and set out a 9x13-inch (or similar size) baking dish.",
    "Peel and core apples, quarter, and use a paring knife to thinly slice lengthwise (see photo). The thinner the better! Just try to be consistent so they cook evenly.",
    "Add to baking dish and top with lemon juice, coconut oil (optional), coconut sugar, cinnamon, ginger, nutmeg, cornstarch (or arrowroot), apple juice (or water), and a healthy pinch of salt. Toss to combine. Then loosely cover with foil.",
    "Bake for 45 minutes (covered). Then carefully remove foil and bake for an additional 10-15 minutes or until the apples are very fork tender (especially in the center of the dish) and slightly caramelized (see photo).",
    "Enjoy as is or with Coconut Whipped Cream or Vanilla Bean Coconut Ice Cream! Best when fresh, though leftovers keep covered in the refrigerator up to 3-4 days or in the freezer up to 1 month. Reheat in the microwave or in a 350-degree F (176 C) oven (covered) until warmed through. Add a bit of water if the \"caramel\" sauce is too thick."
  ],
  "ingredients": [
    "0",
    "6-7 medium to large apples (~1100 g // 2 tart (like granny smith), 4 sweet (like honeycrisp) // organic when possible)",
    "2 Tbsp (30 ml) lemon juice",
    "optional: 1 Tbsp (15 ml) coconut oil",
    "2/3 cup (128 g) coconut sugar (or sub organic cane sugar // sub up to half with stevia to taste*)",
    "1 1/2 tsp ground cinnamon",
    "3/4 tsp fresh grated ginger or 1/2 tsp ground ginger",
    "Pinch nutmeg",
    "3 Tbsp (21 g) cornstarch or arrowroot starch (for thickening the sauce)",
    "3 Tbsp (45 ml) fresh apple juice or water",
    "Pinch sea salt"
  ],
  "__v": 1
}