{
  "hash": "683d42df2995e7c5f2aafbb45e3e26347e79d2eb",
  "title": "Жюльен из курицы с грибами",
  "image": "http://gotovim-doma.ru/img/img0054_9.jpg",
  "href": "http://gotovim-doma.ru/view.php?r=54-recept-ZHiulen-iz-kuritsy-s-gribami",
  "extension": "Chrome",
  "firstAdded": "2016-02-01T16:11:18.758000",
  "users": [
    null
  ],
  "keywords": [],
  "directions": [
    "0",
    "Приготовление",
    "Окорочка вымыть, положить в кастрюлю с кипящей водой и довести до кипения.",
    "Уменьшить огонь, шумовкой снять пену, положить очищенную целую луковицу, и варить при слабом кипении 40-50 минут.",
    "За 15 минут до готовности, положить лавровый лист, посолить и поперчить по вкусу.",
    "Окорочка вынуть из бульона и остудить.",
    "Мясо отделить от костей и нарезать соломкой.",
    "Лук очистить и нарезать четвертькольцами.",
    "Грибы перебрать, очистить, вымыть и отварить 10 минут (крупные грибы разрезать на несколько частей).",
    "Откинуть грибы на дуршлаг и нарезать небольшими кусочками.",
    "Совет 1. Лесные грибы отваривать необязательно. Их можно нарезать небольшими кусочками и обжарить до готовности.",
    "Вместо лесных грибов можно взять шампиньоны.",
    "По желанию, жюльен можно приготовить без добавления грибов.",
    "В сковороде разогреть немного растительного масла, выложить грибы, посолить и обжаривать до испарения жидкости.",
    "Когда жидкость испарится, добавить кусочек сливочного масла и обжарить 6-8 минут, периодически помешивая.",
    "Переложить грибы в миску.",
    "В сковороде разогреть сливочное масло вместе с растительным, выложить лук, посолить и поперчить.",
    "Обжарить лук до мягкости, периодически помешивая, и снять сковороду с огня.",
    "Совет 1. Лук в жульене играет важную роль. По весу лука берется примерно столько же, сколько и курицы.",
    "Совет 2. Жарить лук нужно долго, на медленном огне. Масла должно быть довольно много, чтобы лук не подгорал и не сушился, а медленно томился в масле. Он должен стать очень мягким, практически раствориться в масле.",
    "К обжаренному луку добавить грибы, курицу и перемешать.",
    "Посыпать мукой, перемешать.",
    "Добавить сметану, перемешать и вернуть сковороду на слабый огонь.",
    "Довести до кипения и готовить 1-2 минуты, помешивая.",
    "Жюльен посолить и поперчить, по вкусу.",
    "Разложить по кокотницам или порционным керамическим формочкам.",
    "Густо посыпать тертым сыром."
  ],
  "ingredients": [
    "0",
    "Порции: 4-6"
  ],
  "__v": 1
}