{
  "hash": "b8dcada3375936db47249514352da925c8ceacf4",
  "title": "Lentil Tacos with Roasted Cauliflower",
  "image": "",
  "href": "http://katu.com/amnw/am-northwest-cooking-recipes/lentil-tacos-with-roasted-cauliflower-or-potatoes",
  "extension": "Chrome",
  "firstAdded": "2018-04-18T01:11:05.481000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 425? F. In a large bowl, toss cauliflower pieces with olive oil, and add salt and pepper until evenly coated. Place cauliflower on a baking sheet, preferably not touching and in a single layer. Bake for 30-35 minutes, flipping half way, until the cauliflower has crispy golden edges.",
    "Heat the oil over medium heat in a medium sized pot. Sauté the onions, garlic and salt until the onions are cooked—about 5 minutes. Add the tomato paste, cumin, and chili powder and sauté for 1 – 2 minutes, stirring continuously. Add in the lentils and vegetable broth or water. Raise heat and bring mixture to a gentle simmer. Cook, uncovered, for 25-35 minutes, until the lentils are tender and cooked. You may need to reduce the heat to maintain a gentle simmer.",
    "While lentils are cooking, I make my avocado sauce (blend 2 avocados + 1 Tbsp lemon juice + 1 Tbsp apple cider vinegar + salt to taste + handful of fresh cilantro or parsley in a food processor) and prepare to make the tacos. Warm tortillas individually in a pan over low heat or on a sheet in the oven for 1-3 minutes. Once lentils are done cooking, drain off any excess liquid, cover and set aside until ready to assemble tacos.",
    "To assemble tacos, place a small portion of lentil mixture on each tortilla, add cauliflower, and drizzle aioli or salsa, and top with chopped cilantro or spring greens. Enjoy!"
  ],
  "ingredients": [
    "0",
    "Roasted Cauliflower",
    "1 large head of cauliflower, sliced into bite-sized florets",
    "3 Tbsp olive oil",
    "Salt & pepper",
    "Lentils filling",
    "¾ cup brown lentils (or favorite lentils), rinsed and free of debris",
    "2 cups vegetable broth or water",
    "2 large garlic cloves, minced",
    "¾ cup yellow or white onion, chopped",
    "3 Tbsp tomato paste",
    "1 Tbsp olive oil",
    "1 tsp ground cumin",
    "1 tsp chili powder",
    "Salt to taste"
  ],
  "__v": 1
}