{
  "hash": "1dc53f1565624b3ff9e47cee476dfe091ab9191a",
  "title": "Soft & Chewy Oatmeal Raisin Cookies",
  "image": "https://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2014/07/easy-oatmeal-raisin-cookies-3.jpg",
  "href": "https://sallysbakingaddiction.com/2014/07/24/soft-chewy-oatmeal-raisin-cookies/",
  "extension": "Chrome",
  "firstAdded": "2018-09-15T22:21:39.382000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Using a hand mixer or a stand mixer fitted with paddle attachment, cream the softened butter and both sugars together on medium speed until smooth, about 2 minutes. Add the eggs and mix on high until combined, about 1 minute. Scrape down the sides and bottom of the bowl as needed. Add the vanilla and molasses and mix on high until combined. Set aside.",
    "In a separate bowl, toss the flour, baking soda, cinnamon, and salt together. Add to the wet ingredients and mix on low until combined. Beat in the oats, raisins, and walnuts (if using) on low speed. Dough will be thick, yet very sticky. Chill the dough for 30-60 minutes in the refrigerator (do the full hour if you're afraid of the cookies spreading too much). If chilling for longer (up to 2 days), allow to sit at room temperature for at least 30 minutes before rolling and baking.",
    "Preheat oven to 350°F (177°C). Line two large baking sheets with parchment paper or silicone baking mats. (Always recommended for cookies.) Set aside.",
    "Roll balls of dough (about 2 tablespoons of dough per cookie) and place 2 inches apart on the baking sheets. Bake for 11-13 minutes until very lightly browned on the sides. The centers will look very soft and undone. Remove from the oven and let cool on baking sheet for 5 minutes before transferring to a wire rack to cool completely. The cookies will continue to \"set\" on the baking sheet during this time.",
    "Make ahead tip: Cookies stay fresh covered at room temperature for up to 1 week. Baked cookies freeze well - up to three months. Unbaked cookie dough balls freeze well - up to three months. Bake frozen cookie dough balls for an extra minute, no need to thaw."
  ],
  "ingredients": [
    "0",
    "1 cup (230g) unsalted butter, softened to room temperature",
    "1 cup (200g) packed light or dark brown sugar",
    "1/4 cup (50g) granulated sugar",
    "2 large eggs1",
    "1 Tablespoon vanilla extract (yes, Tablespoon!)",
    "1 Tablespoon molasses",
    "1 and 1/2 cups (190g) all-purpose flour (spoon & leveled)",
    "1 teaspoon baking soda",
    "1 and 1/2 teaspoons ground cinnamon",
    "1/2 teaspoon salt",
    "3 cups (240g) old-fashioned whole rolled oats",
    "1 cup (140g) raisins2",
    "optional: 1/2 cup (64g) chopped toasted walnuts"
  ],
  "__v": 1
}