{
  "hash": "852d5d67556c80701b04fc10bc72fc197f670cd1",
  "title": "Tortilje za roštilj",
  "image": "http://1.bp.blogspot.com/-GKGSD3nCTPE/TiMfyWniAnI/AAAAAAAALZ0/v56Es-IsAOM/s1600/tortilje20blog.jpg",
  "href": "http://mamajacooks.blogspot.com/2011/07/tortilje-za-ro.html",
  "firstAdded": "2015-01-14T17:58:42.425000",
  "users": [
    null
  ],
  "keywords": [
    "mekog",
    "belog",
    "brana",
    "ravne",
    "kaiice",
    "soli",
    "tople",
    "vode",
    "sveeg",
    "kvasca",
    "teine",
    "kocke",
    "malo",
    "ulja"
  ],
  "directions": [
    "0",
    "Odmeriti 500 g brašna i prosejati ga. Kvasac razmutiti sa malo vode. Ostatak vode ugrejati. U vanglu sipati toplu vodu, so, i razmućen kvasac. Odmah dodati 250 g prosejanog brašna i varjačom izmešati da se dobije retko testo bez grudvica. Ostaviti na sobnoj temperaturi sat-dva, ili dok se ne pojave mehurići po celoj porvrsini, što je znak da je kvasac proradio.",
    "Postepeno dodavati ostatak brašna, iz par puta, dok testo ne počne da se odvaja od ivica. Zatim testo prebaciti na radnu površinu, pa mesiti rukom par minuta, dodajući po malo brašna, ukoliko testo počne da se lepi za podlogu. Otprilike će se utrošiti još 200-250 g brašna. Umešeno testo mora biti glatko, elastično, ne sme da bude lepljivo, niti da ima tragove brašna po površini. Oblikovati kuglu.",
    "Vanglu oprati, osušiti i namastiti sa 1 kašičicom ulja, i spustiti testo u nju. Pokriti plastičnom folijom, i ostaviti 10-15 minuta da odmori.",
    "Pritisnuti testo na par mesta i isterati vazduh iz njega. Podeliti ga na 5-6 delova, i bez mnogo mešenja formirati kuglice, i svaku spolja nauljiti. Na blago namašćenoj podlozi kuglicu prvo spljoštiti rukama u format CD-a, pa oklagijom na veličinu tiganja.",
    "Odići od podloge i preneti do tiganja. Za lakše prenošenje, podmetnuti dlan jedne ruke ispod tortilje, a drugom pridržavati drugi kraj.",
    "Peći na suvom ugrejanom teflonskom tiganju, na temperaturi 4 ili 5 (od 6 podeoka). Nakon što se pojave mehurići sa gornje strane, okrenuti tortilju. Vreme pečenja je otprilike oko minut sa svake strane, dok se ne pojave tamne tačke. Tortilja će se tokom pečenja malo skupiti, što je očekivano. To skupljanje se može i izbeći, a kako, videćete u savetima posle recepta.",
    "Tortilje redjati u šerpu obloženu krpom. Na šerpu staviti pokloopac i ostaviti tortilje 10-15 minuta da odstoje.Tako uparene će još više omekšati i postati predivno elastične."
  ],
  "ingredients": [
    "0",
    "500 g mekog belog brašna",
    "2 ravne kašičice soli",
    "250 ml tople vode",
    "5 g svežeg kvasca (1% od težine brašna, tj. 1/8 kocke od 40 g)",
    "malo ulja"
  ],
  "__v": 1
}