{
  "hash": "284b04f28497483b4faa1c9778a9c9ab833de93c",
  "title": "Ideas in Food's Korean-Style Chicken Wings",
  "image": "https://images.food52.com/iooYTnUoKn9c-CqUHt0TnsVxrG0=/753x502/cab004b5-0736-468d-b75c-e5425dd09797--2014-0121_genius_wings-311.jpg",
  "href": "https://food52.com/recipes/26380-ideas-in-food-s-korean-style-chicken-wings",
  "extension": "Chrome",
  "firstAdded": "2018-01-05T13:06:19.728000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Oil 2 wire racks and set them each over rimmed baking sheets. Put the egg whites, baking soda, and salt in a bowl and stir to dissolve the salt and baking soda. Add the chicken wings and stir to coat evenly. Remove the wings from the bowl, draining off excess marinade, and lay them out on racks set over baking sheets. Refrigerate the wings uncovered overnight for them to dry out.",
    "Preheat the oven to 450° F (235° C).",
    "Put the wings, still on the racks on the baking sheets, into the oven and cook for 15 minutes. Flip the wings over and bake for 10 minutes. Flip the wings over again and bake until a deep golden brown with a crackling skin, about 10 more minutes. Take the pans out of the oven and let cool for 5 minutes.",
    "Meanwhile, in a small bowl, combine the soy sauce, apple juice, honey, rice vinegar, sesame oil, chile flakes, sesame seeds, garlic, ginger, and scallion.",
    "Pile the wings on a serving platter and serve the sauce alongside."
  ],
  "ingredients": [
    "0",
    "Neutral high smoke point oil (like vegetable, canola, or grapeseed) or spray for racks",
    "3 large egg whites",
    "2 teaspoons (10 grams) baking soda",
    "1 3/4 teaspoons (10.5 grams) fine sea salt",
    "4 pounds (1.8 kg) whole chicken wings (smaller wing sections like drumettes and flats or wingettes will also work)",
    "1/4 cup (65 grams) tamari soy sauce",
    "3 tablespoons (42 grams) apple juice",
    "1 tablespoon (16 grams) honey",
    "1 tablespoon (14 grams) rice vinegar",
    "1 tablespoon (14 grams) toasted sesame oil",
    "1 teaspoon (2 grams) Korean red chile flakes (available at Korean markets, or substitute crushed chile flakes if unavailable)",
    "1 tablespoon (3.75 grams) toasted sesame seeds, chopped",
    "1 garlic clove, grated",
    "1/2 teaspoon (2.5 grams) grated fresh ginger",
    "1 scallion, finely sliced"
  ],
  "__v": 1
}