{
  "hash": "ef31a2853a61ef4bba6046f190ba54b6fa195570",
  "title": "BURRITO SUPREME RECIPE",
  "image": "http://blogchef.net/wp-content/uploads/2013/06/burrito_supreme_1.jpg",
  "href": "http://blogchef.net/burrito-supreme-recipe/",
  "firstAdded": "2015-01-25T13:14:05.077000",
  "users": [
    null
  ],
  "keywords": [
    "lean",
    "beef",
    "allpurpose",
    "flour",
    "chili",
    "salt",
    "onion",
    "paprika",
    "garlic",
    "water",
    "refried",
    "beans",
    "tortillas",
    "enchilada",
    "sour",
    "cream",
    "lettuce",
    "cheddar",
    "cheese",
    "medium",
    "tomato",
    "yellow"
  ],
  "directions": [
    "0",
    "Step 1: In a medium bowl combine the ground beef with flour, chili powder, salt, minced onion, paprika, onion powder, and garlic powder. Use your hands to thoroughly mix the flour and seasonings into the ground beef. Add the seasoned beef mixture and the water to a large skillet over medium heat. Mix well and use a spatula to break up the beef as it cooks. Cook until the beef is fully cooked (the beef mixture should be thick and very smooth with no large chunks of beef remaining).",
    "Step 2: Heat up the refried beans in a microwave safe container for 1 ½ to 2 minutes. Place the flour tortillas on a microwave safe plate and heat for 30 to 45 seconds.",
    "Step 3: Prepare each burrito by first spreading about ¼ cup of the reified beans onto the center of each heated tortilla. Spread a portion of the meat mixture over the beans, pour on about a tablespoon of enchilada sauce over the meat. Spread about 1 ½ tablespoons of sour cream onto each burrito. Arrange some of the lettuce, cheese, tomato and onion onto the burritos. Roll up the burritos by folding the end of the tortilla closest to you over the filling. Then fold either the left or right end over next. Then fold the top edge over the filling.",
    "(Makes 8 Servings)"
  ],
  "ingredients": [
    "0",
    "1lb lean ground beef",
    "¼ cup all-purpose flour",
    "1 tablespoon chili powder",
    "1 teaspoon salt",
    "½ teaspoon dried minced onion",
    "½ teaspoon paprika",
    "½ teaspoon onion powder",
    "1 dash garlic powder",
    "½ cup water",
    "1 (16 ounce) can refried beans",
    "8 (10 inch) flour tortillas",
    "½ cup enchilada sauce",
    "¾ cup sour cream",
    "2 cups shredded lettuce",
    "2 cups shredded cheddar cheese",
    "1 medium tomato (diced)",
    "½ cup diced yellow onion"
  ],
  "__v": 1
}