{
  "hash": "8b62916aaf550428f57ca9b0ba2058770722c5bb",
  "title": "Spinach Gnocchi with Shaved Ricotta Salata",
  "image": "http://ds.serving-sys.com/BurstingCachedScripts/Res/blank_1X1.gif",
  "href": "http://www.foodandwine.com/recipes/spinach-gnocchi-with-shaved-ricotta-salata",
  "extension": "Chrome",
  "firstAdded": "2016-02-29T23:24:13.803000",
  "users": [
    null
  ],
  "keywords": [
    "spinach",
    "stemmed",
    "grana",
    "padano",
    "cheese",
    "eggs",
    "lightly",
    "plain",
    "dry",
    "bread",
    "crumbs",
    "nutmeg",
    "kosher",
    "salt",
    "pepper",
    "allpurpose",
    "flour",
    "dusting",
    "unsalted",
    "butter",
    "parmigianoreggiano",
    "shaved",
    "ricotta",
    "salata"
  ],
  "directions": [
    "0",
    "In a large pot of salted boiling water, blanch the spinach until tender, about 4 minutes. Drain, reserving 1/2 cup of the cooking liquid. Cool the spinach in a bowl of ice water, then drain and squeeze dry. Wipe out the pot, fill with water and bring to a gentle simmer.",
    "Meanwhile, transfer the spinach to a food processor. Add 3 tablespoons of the reserved cooking liquid and puree until very smooth; add a bit more cooking liquid if needed.",
    "Scrape 1 cup of the spinach puree into a large bowl. (Reserve any remaining puree for another use.) Mix in the grated Grana Padano cheese, eggs, bread crumbs, nutmeg, 3/4 teaspoon of salt and 1/4 teaspoon of pepper. Stir in 1/4 cup of the flour to form a soft dough.",
    "Spread the remaining 1 cup of flour in a pie plate and dust a large rimmed baking sheet with flour. Gently roll the gnocchi dough into 1-inch balls. Carefully roll the gnocchi in the flour, shake off the excess and transfer to the prepared baking sheet.",
    "Add salt to the simmering water. Add half of the gnocchi to the pot and cook until they rise to the surface, then simmer until cooked through, about 3 minutes (about 5 minutes total cooking time). Using a slotted spoon, transfer the gnocchi to a platter. Cover loosely with foil. Repeat with the remaining gnocchi.",
    "In a skillet, cook the butter over moderate heat until golden, about 2 minutes. Spoon the brown butter over the gnocchi. Top with Parmigiano and ricotta salata and serve."
  ],
  "ingredients": [
    "0",
    "2 1/2 pounds fresh spinach, stemmed",
    "1/2 cup freshly grated Grana Padano cheese (1 ounce)",
    "2 large eggs, lightly beaten",
    "1/2 cup plain, dry, fine bread crumbs",
    "1/4 teaspoon freshly grated nutmeg",
    "Kosher salt",
    "Freshly ground pepper",
    "1 1/4 cups all-purpose flour, plus more for dusting",
    "6 tablespoons unsalted butter",
    "Freshly grated Parmigiano-Reggiano and shaved ricotta salata, for serving"
  ],
  "__v": 1
}