{
  "hash": "4c6ded06bf823e6fd4ed0af4fed229dd946e1a38",
  "title": "Baked Chicken with Squash and Asparagus",
  "image": "http://recipe-folder.com/img/recipe-images/080/506/1490655380.jpg",
  "href": "http://recipe-folder.com/recipe/5cfd3037d8e26b095b61b6d5",
  "extension": "User Added",
  "firstAdded": "2019-06-09T16:13:43.598000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400 degrees F. Lightly oil a baking sheet or coat with nonstick spray.",
    "1",
    "In a large bowl, combine bread crumbs and lemon zest; set aside.",
    "2",
    "Season chicken with salt and pepper, to taste. Working one at a time, dredge chicken in flour, dip into eggs, then dredge in bread crumbs mixture, pressing to coat.",
    "3",
    "Place butternut squash in a single layer onto one side of the prepared baking sheet. Stir in 2 tablespoons olive oil and thyme; season with salt and pepper, to taste.",
    "4",
    "Place chicken in a single layer in the middle of the prepared baking sheet and coat with nonstick spray. Place into oven and bake until golden brown and crisp, about 18-20 minutes.",
    "5",
    "Add asparagus onto the opposite side of the prepared baking sheet in a single layer during the last 10-12 minutes of cooking time. Drizzle with remaining 2 tablespoons olive oil and sprinkle with Parmesan.",
    "6",
    "Serve immediately, garnished with parsley, if desired."
  ],
  "ingredients": [
    "0",
    "1 cup Italian bread crumbs",
    "1",
    "Zest of 2 lemons",
    "2",
    "4 boneless, skinless chicken breasts",
    "3",
    "Kosher salt and freshly ground black pepper, to taste",
    "4",
    "1/4 cup all-purpose flour",
    "5",
    "2 large eggs, beaten",
    "6",
    "1 large butternut squash (about 3 pounds), peeled, seeded and cut in 1-inch chunks",
    "7",
    "4 tablespoons olive oil, divided",
    "8",
    "1 teaspoon dried thyme",
    "9",
    "1 pound asparagus, trimmed",
    "10",
    "1/4 cup freshly grated Parmesan",
    "11",
    "2 tablespoons chopped fresh parsley leaves"
  ],
  "__v": 1,
  "hidden": true
}