{
  "hash": "7396fb88c615ed9d0c8a2ea74e9cc7cd93dfa911",
  "title": "Roasted Red Pepper and Basil Pesto Penne",
  "image": "http://2.bp.blogspot.com/-EsL1lHfKyqI/UQZsqF_rDqI/AAAAAAAAOeE/ab2SCDulktA/s640/1+-+Copy.jpg",
  "href": "http://menumusings.blogspot.ca/2011/12/roasted-red-pepper-and-basil-pesto.html",
  "extension": "Chrome",
  "firstAdded": "2017-03-28T23:31:27.695000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "I threw the garlic cloves in a small pan and added the cold olive oil. I slowly pan roasted the garlic a while to mellow it out. When you heat the garlic with the cold oil, the oil becomes flavored.",
    "Add the pine nuts to the warm oil and let them simmer just a minute or two.",
    "Add the garlic, pine nuts, and oil to the food processor and pulse until they are a fine paste.",
    "Add the Parmesan cheese and pulse.",
    "Add the red pepper, basil leaves and salt and pepper. Pulse to combine into a paste. Set aside.",
    "Cook pasta according to package directions. Drain and return to the pot.",
    "Add the pesto to the pasta and stir to combine.",
    "Stir in heavy cream if desired for a creamier sauce. Heat until warmed through.",
    "*If you trying to avoid cream (or dairy in general), feel free to add a little chicken broth in the place of the cream. I've also done this with canned evaporated milk and that works great as well!!",
    "Stir in roasted rotisserie chicken if you want, or serve plain.",
    "Garnish with extra pine nuts (dry toast them in a pan), chopped basil, grated Parmesan (and roasted grape tomatoes). Serve immediately."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "4 cloves garlic",
    "1/3 cup pine nuts",
    "1/3 cup freshly grated Parmesan",
    "1 cup of jarred roasted red bell peppers, drained",
    "1 cup fresh basil leaves",
    "salt and pepper",
    "1/3 cup extra virgin olive oil",
    "1 pound penne pasta",
    "1/2 cup heavy cream",
    "roasted rotisserie chicken, optional"
  ],
  "__v": 1
}