{
  "hash": "95b997ef57e5177648203478b7cfa4fc112d3ce7",
  "title": "Lentil Crusted Tofu with Awesome Dipping Sauce",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2011/09/DSC00512.jpg",
  "href": "http://www.onegreenplanet.org/vegan-food/recipe-lentil-crusted-tofu-with-awesome-dipping-sauce/",
  "extension": "Chrome",
  "firstAdded": "2015-06-17T09:51:10.950000",
  "users": [
    null
  ],
  "keywords": [
    "tofu",
    "extra",
    "firm",
    "pink",
    "lentils",
    "turmeric",
    "coriander",
    "finelyground",
    "salt",
    "olive",
    "oil",
    "rice",
    "wine",
    "vinegar",
    "sugar",
    "agave",
    "nectar",
    "medium",
    "orange",
    "juiced",
    "clove",
    "garlic",
    "chili",
    "corn",
    "starch",
    "water",
    "cilantro"
  ],
  "directions": [
    "0",
    "Begin by removing the tofu from the package and drain any excessive fluid. I wrap my block of tofu in a clean dishtowel and place it on the counter with a can of green beans or something with a little weight to it. Your goal is to press out any excess fluid from the tofu block.",
    "While the tofu is pressing, you can prepare your Awesome Dipping Sauce (see instructions below) or prepare the crust that you’ll be rolling your tofu in before cooking.",
    "Tofu crust: Place pink lentils in a spice or coffee grinder and pulse for several seconds until the lentils are pulverized and the consistency of a course flour. Combine the pulverized lentils and seasonings on a plate and stir until well combined.",
    "Cooking the Tofu: Once your tofu is adequately pressed, remove it from the dishtowel and slice into 1″ cubes. Take half of the cubes and thoroughly coat them in the lentil crust mix. Next, heat 2 tablespoons or so of olive oil in a large skillet over medium to medium-high heat. I use just enough to coat the bottom of the pan because I don’t like my tofu to be overly greasy. Once the oil is sufficiently heated carefully place the crusted tofu in the skillet. Allow the tofu to brown on one side before turning so that each side can become sufficiently browned. While the first batch of tofu is on the skillet, place the second batch of cubed tofu in the remainder of the lentil crust and stir until the tofu is covered on all sides.",
    "I warm up our toaster oven and place the first batch of cooked and browned tofu in the toaster oven tray to stay warm while the second batch is cooking.",
    "1",
    "When you’re ready to begin making your Awesome Dipping Sauce, begin by placing all the ingredients except the water, cornstarch and cilantro in a food processor. Pulse for just a second or two until the garlic is nicely minced.",
    "Next combine the cornstarch with cold water in a microwave-safe bowl and stir until well combined. Microwave for 10 – 15 seconds and stir. The mixture should begin to thicken. If it gets too thick, add a little bit more water. If it’s not thick yet, microwave for a few more seconds.",
    "Once the cornstarch mixture is adequately thickened, let it sit and cool for a minute or two. Once cooled, add the cornstarch mixture to the food processor and pulse until well incorporated with the rest of the ingredients.",
    "Next add the cilantro and pulse for a few more seconds until the cilantro is adequately chopped as well. You don’t want to pulse too long or the sauce will appear green.",
    "2",
    "Place the cooked and warmed tofu on a dish with the dipping sauce in a small serving bowl. This is a fun dish to eat with your favorite chop sticks, but forks work well too."
  ],
  "ingredients": [
    "0",
    "1 package Tofu, (extra firm)",
    "3 – 4 tablespoons Pink Lentils",
    "¼ teaspoon ground turmeric",
    "½ teaspoon ground coriander",
    "½ teaspoon finely-ground sea salt",
    "¼ – ½ cup olive oil",
    "1",
    "¼ cup rice wine vinegar",
    "2 tablespoons sugar, (Or agave nectar)",
    "½ medium orange, (juiced)",
    "1 clove garlic, chopped",
    "1 teaspoon chili garlic sauce",
    "1 tablespoon corn starch",
    "¼ cup water",
    "¼ cup cilantro"
  ],
  "__v": 1
}