{
  "hash": "593555f3c6455db22fb6e3012c0e6eb139cecbd4",
  "title": "Crispy Baked French Fries",
  "image": "https://cookieandkate.com/images/2012/05/oven-baked-fries-550x408.jpg",
  "href": "https://cookieandkate.com/2012/crispy-baked-french-fries/",
  "extension": "",
  "firstAdded": "2018-05-01T16:38:56.372000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Adjust an oven rack to the lowest position and preheat the oven to 475 degrees Fahrenheit. Scrub the potatoes and cut them, lengthwise, into 10 to 12 even wedges. The trick is to first quarter the potatoes lengthwise, and then cut each quarter lengthwise into 2 to 3 wedges (I sliced mine a little too thin).",
    "Place the sliced potatoes into a large bowl and cover them with hot water (I used hot water from the tap, but others have suggested that pipes can leach impurities into hot water, so it may be best to use cool tap water that has been heated on the stove). Let them soak for 10 minutes. This step releases some of the starch in the potatoes and lets them absorb moisture, which leads to crisp outsides and moist interiors.",
    "Cover a large, rimmed baking sheet with parchment paper. Drizzle ¼ cup oil onto the paper, then sprinkle it evenly with about ½ teaspoon salt and ¼ teaspoon pepper.",
    "Drain the potatoes and pat them dry thoroughly with a tea towel or paper towels. Toss the potatoes with the remaining 1 teaspoon oil and mix evenly.",
    "Arrange the fries in a single layer on a baking sheet and cover the sheet tightly with foil. Bake for 5 minutes, then remove the foil and continue to bake for 10 minutes. Rotate the pan and cook another 5 to 10 minutes, until the underside of the potatoes are spotty golden brown.",
    "Remove the baking sheet from the oven and scrape the fries loose with a spatula. Then use tongs or the spatula to flip over each wedge. Arrange them in an even layer and put them back in the oven to bake until the fries are golden and crisp, about 5 to 10 minutes longer. Rotate the pan as necessary to help them brown evenly.",
    "Season with salt and pepper (thinly sliced green onions and shaved Parmesan are optional) and serve hot."
  ],
  "ingredients": [
    "0",
    "2 to 4 organic russet potatoes (about 8 ounces each)",
    "¼ cup plus 1 teaspoon quality canola oil or vegetable oil",
    "Sea salt and ground black pepper"
  ],
  "__v": 1
}