{
  "hash": "9e9913da544140529ba3f79e7505d6c6f2ec8754",
  "title": "Sunflower Cupcakes",
  "image": "https://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2017/08/sunflower-cupcakes-2.jpg",
  "href": "https://sallysbakingaddiction.com/2017/09/01/sunflower-cupcakes/",
  "extension": "Chrome",
  "firstAdded": "2018-09-15T22:08:51.871000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "With a handheld or stand mixer fitted with a paddle attachment, beat the butter on medium speed until creamy - about 2 minutes. Add 5 cups confectioners' sugar, the heavy cream, and vanilla extract with the mixer running on low. Increase to high speed and beat for 3 full minutes. Add another Tablespoon of cream if frosting is too thick. Add a pinch of salt if frosting is too sweet. (I like 1/8 tsp salt.)",
    "Spoon 3/4 cup of frosting into a separate bowl. Stir in green food coloring. This will be for the leaves.",
    "Tint the remaining frosting with yellow and orange food coloring to obtain desired sunflower color. See my note below for what I used.",
    "Fill piping bag with leaf tip + yellow frosting. If you have a second leaf tip, fill a 2nd bag with leaf tip + green frosting.",
    "Pipe or spread a circle of frosting in the center of the cupcake. My cupcake centers are about 1.25 inches in diameter. Dip into chocolate sprinkles.",
    "See video above for a visual of this step. (It's hard to explain perfectly!) Start on the outer edge of the cupcake. Pipe yellow petals all the way around, lifting the piping tip in an upwards direction. Pipe a second layer closer to the center/on top of the first layer. Pipe a third layer of petals right against the center of the sunflower. Pipe any additional petals to fill any gaps, then pipe a couple green leafs on the edges.",
    "Refrigerate cupcakes until ready to serve. Cupcakes are fine at room temperature for a few hours, as long as they have been refrigerated for a couple hours after frosting/assembling. (The time in the refrigerator helps the petals hold their shape before serving.)",
    "Cover leftover cupcakes and store in the refrigerator for up to 5 days."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "1 cup (230g) unsalted butter, softened to room temperature",
    "5 cups (600g) confectioners' sugar",
    "1/4 cup (60ml) heavy cream",
    "2 teaspoons pure vanilla extract",
    "salt, to taste",
    "yellow, orange, & green food coloring (I use Americolor gel coloring)*",
    "chocolate sprinkles",
    "12-14 baked and cooled cupcakes"
  ],
  "__v": 1
}