{
  "hash": "c4a7f9bced1eee5fa9f9a9458777f0f5bfc18ce3",
  "title": "EASY MOIST CHOCOLATE CAKE",
  "image": "https://www.lifeloveandsugar.com/wp-content/uploads/2017/01/Easy-Moist-Chocolate-Cake3.jpg",
  "href": "https://www.lifeloveandsugar.com/easy-moist-chocolate-cake/",
  "extension": "Chrome",
  "firstAdded": "2019-09-07T19:21:34.066000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350°F (176°C) and prepare a 9×13 inch cake pan with non-stick baking spray.",
    "Add the flour, sugar, cocoa, baking soda, baking powder and salt to a large mixer bowl and combine. Set aside.",
    "Add the milk, vegetable oil, vanilla extract and eggs to a medium sized bowl and combine.",
    "Add the wet ingredients to the dry ingredients and beat until well combined.",
    "Slowly add the hot water to the batter and mix on low speed until well combined. Scrape down the sides of the bowl as needed to make sure everything is well combined.",
    "Pour the batter into the prepared cake pan and bake for 29-32 minutes, or until a toothpick comes out with a few moist crumbs.",
    "Remove cake from oven and allow to cool.",
    "To make the frosting, combine the butter and shortening in a large mixer bowl and mix until smooth.",
    "Add 2 cups of powdered sugar and mix until smooth.",
    "Add the vanilla extract and 3 tablespoons of water or milk and mix until smooth.",
    "Add remaining powdered sugar and cocoa and mix until smooth.",
    "Add remaining water or milk as needed and mix until smooth, keeping an eye on the consistency of the frosting so it doesn’t get too thin.",
    "Beat frosting on medium speed for 2-3 minutes until it has lightened in color and gotten fluffy.",
    "Spread frosting evenly onto the cake. Top with sprinkles, if desired"
  ],
  "ingredients": [
    "0",
    "1 3/4 cups (228g) all purpose flour",
    "2 cups (414g) sugar",
    "3/4 cup (85g) natural unsweetened cocoa powder",
    "2 1/4 tsp baking soda",
    "1/2 tsp baking powder",
    "1 tsp salt",
    "1 cup (240ml) milk",
    "1/2 cup (120ml) vegetable oil",
    "1 1/2 tsp vanilla extract",
    "2 large eggs",
    "1 cup (240ml) hot water"
  ],
  "__v": 1
}