{
  "hash": "a743c073e89c286568bf1b6e58f78e6488e8bcc2",
  "title": "Black Eyed Peas, Tofu Thyme Ricotta, Deep Dish Pizza Vegan Recipe",
  "image": "http://www.veganricha.com/wp-content/uploads/2013/12/HoppingJohn-Deep-Dish-Pizza-crackers-094.jpg",
  "href": "http://www.veganricha.com/2013/12/black-eyed-peas-tofu-thyme-ricotta-deep.html",
  "extension": "",
  "firstAdded": "2015-12-14T20:35:43.761000",
  "users": [
    null
  ],
  "keywords": [
    "black",
    "eyed",
    "peas",
    "soaked",
    "hours",
    "water",
    "cookedcanned",
    "tsps",
    "oil",
    "medium",
    "red",
    "onion",
    "serrano",
    "chili",
    "green",
    "bell",
    "pepper",
    "bay",
    "leaf",
    "tomato",
    "basil",
    "italian",
    "herb",
    "pasta",
    "blend",
    "garlic",
    "salt",
    "generous",
    "use",
    "using",
    "precooked",
    "beans",
    "tofu",
    "thyme",
    "ricotta",
    "firm",
    "crumbled",
    "evoo",
    "extra",
    "virgin",
    "olive",
    "apple",
    "cider",
    "vinegar",
    "wheat",
    "semolina",
    "added",
    "crust",
    "double",
    "recipe",
    "crusts",
    "marinara"
  ],
  "directions": [
    "0",
    "Black eyed Peas:",
    "Soak the black eyed peas for 2-4 hours. Wash and drain to use. In a pan, add 2 tsps oil and heat on medium heat. Add onions, bay leaf and chili pepper or green pepper. Cook until golden. Add ½ cup pasta sauce, herbs, salt, garlic, black pepper, mix well and cook for a minute. Add soaked black eyed peas and water and cover fully and cook on low-medium heat for 30-40 minutes or until tender. (the duration of soaking and old/new batch of peas will determine the cook time. add more water and cook longer if needed). If using cooked/canned peas, add ½ cup water and mix and cook for 15-20 minutes until almost dry. Taste and adjust salt and spice. Or you can use any Indian spiced black eyed pea stew from the blog.:) Use less water to make a dryer stew.",
    "Tofu Thyme Ricotta:",
    "Crumble the Tofu well. Add all the ingredients and let sit for 10 minutes. Taste and adjust salt and herbs if needed.",
    "Pizza:",
    "Make the dough. Add the yeast, sugar to warm water. Add flours, herbs, salt to the frothy yeast mixture. Knead to make a smooth dough. Let the dough sit covered till you prepare the rest of the ingredients. I left it on the counter for 15 minutes. Punch the dough and roll out to two 8 -9 inch round. Press the dough into a cake pan and push the edges up using your fingers or knuckles. Spray water on top. Bake the dough in pre-heated 400 degrees F for 6-7 minutes. Remove from oven and Add ⅓ cup pasta sauce. Top with half of the black eyed peas, even them with a spatula, top with half of the tofu ricotta. Add other layers of choice like greens or mushrooms. top that with ½ cup pasta sauce. Top with non dairy cheese(optional). Bake at 400 for 20-22 mins. Cool for 2 minutes then slice and serve."
  ],
  "ingredients": [
    "0",
    "Black Eyed Peas:",
    "¾ cup dried black eyed peas soaked for 2-4 hours in warm water. or 1.5 cups cooked/canned peas.",
    "2 tsps oil",
    "½ medium red onion or other onion chopped",
    "½ a Serrano chili pepper or ½ green bell pepper chopped",
    "1 bay leaf",
    "½ cup tomato basil or italian herb pasta sauce",
    "1 tsp italian herb blend",
    "1 tsp garlic powder",
    "½ tsp salt or to taste",
    "a very generous dash of black pepper or red pepper flakes",
    "1 cup water (Use ½ cup water if using precooked beans)",
    "Tofu thyme Ricotta:",
    "1 package firm tofu well crumbled. (16 oz)",
    "1 tsp garlic powder",
    "2-3 tsps dried thyme",
    "1 tsp italian herb blend",
    "1 Tbsp EVOO (extra virgin olive oil)",
    "2 tsps apple cider vinegar",
    "½ tsp salt or to taste",
    "Wheat Semolina Crust Recipe here - I added ½ tsp thyme to the crust. Double the recipe for 2 crusts.",
    "2 cups pasta sauce or marinara or other tomato sauce"
  ],
  "__v": 1
}