{
  "hash": "53ddeafa4f82ec5e6343f3ebd893d361b73837f9",
  "title": "Sausage, Cheese and Basil Lasagna\nBON APPÉTIT FEBRUARY 2000",
  "image": "",
  "href": "https://www.epicurious.com/recipes/food/views/sausage-cheese-and-basil-lasagna-103005",
  "extension": "Chrome",
  "firstAdded": "2019-12-29T22:35:04.118000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "PREPARATION",
    "Sauce:",
    "Heat oil in heavy large pot over medium-high heat. Add sausages, onion, garlic, oregano and crushed red pepper and sauté until sausage is cooked through, mashing sausage into small pieces with back of fork, about 10 minutes. Add crushed tomatoes and diced tomatoes with juices. Bring sauce to boil. Reduce heat to medium and simmer 5 minutes to blend flavors. Season with salt and pepper. (Can be made 1 day ahead. Chill until cold, then cover and keep chilled.)",
    "Filling:",
    "Using on/off turns, chop fresh basil leaves finely in processor. Add ricotta, mozzarella, Parmesan, egg, 1/2 teaspoon salt and 1/4 teaspoon pepper. Using on/off turns, process filling until just blended and texture is still chunky.",
    "Assembly:",
    "Preheat oven to 375°F. Spread 1 1/4 cups sauce in 13x9x2-inch glass baking dish. Arrange 3 noodles on sauce. Drop 1 1/2 cups filling over noodles, then spread evenly to cover. Sprinkle with 3/4 cup mozzarella cheese and 1/4 cup Parmesan cheese. Repeat layering of sauce, noodles, filling and cheeses 2 more times. Top with remaining 3 noodles. Spoon remaining sauce atop noodles. Sprinkle with remaining cheeses. Spray large piece of foil with nonstick olive oil spray. Cover lasagna with foil, sprayed side down.",
    "Bake lasagna 40 minutes. Carefully uncover. Increase oven temperature to 400°F. Bake until noodles are tender, sauce bubbles thickly and edges of lasagna are golden and puffed, about 20 minutes. Transfer to work surface; let stand 15 minutes before serving.",
    "ADD NOTES",
    "RELATED VIDEO"
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "Sauce:",
    "2 tablespoons olive oil",
    "1 pound spicy Italian sausages, casings removed",
    "1 cup chopped onion",
    "3 large garlic cloves, chopped",
    "2 teaspoons dried oregano",
    "1/4 teaspoon dried crushed red pepper",
    "1 28-ounce can crushed tomatoes with added puree",
    "1 14 1/2-ounce can diced tomatoes with green pepper and onion (do not drain)",
    "Filling:",
    "1 1/2 cups (packed) fresh basil leaves",
    "1 15-ounce container plus 1 cup part-skim ricotta cheese",
    "1 1/2 cups (packed) grated mozzarella cheese (about 6 ounces)",
    "3/4 cup grated Parmesan cheese (about 2 ounces)",
    "1 large egg",
    "1/2 teaspoon salt",
    "1/4 teaspoon ground black pepper",
    "Assembly:",
    "12 no-boil lasagna noodles from one 8-ounce package",
    "3 cups (packed) grated mozzarella cheese (about 12 ounces)",
    "1 cup grated Parmesan cheese (about 3 ounces)",
    "Nonstick olive oil spray",
    "PREPARATION",
    "Sauce:",
    "Heat oil in heavy large pot over medium-high heat. Add sausages, onion, garlic, oregano and crushed red pepper and sauté until sausage is cooked through, mashing sausage into small pieces with back of fork, about 10 minutes. Add crushed tomatoes and diced tomatoes with juices. Bring sauce to boil. Reduce heat to medium and simmer 5 minutes to blend flavors. Season with salt and pepper. (Can be made 1 day ahead. Chill until cold, then cover and keep chilled.)",
    "Filling:",
    "Using on/off turns, chop fresh basil leaves finely in processor. Add ricotta, mozzarella, Parmesan, egg, 1/2 teaspoon salt and 1/4 teaspoon pepper. Using on/off turns, process filling until just blended and texture is still chunky.",
    "Assembly:",
    "Preheat oven to 375°F. Spread 1 1/4 cups sauce in 13x9x2-inch glass baking dish. Arrange 3 noodles on sauce. Drop 1 1/2 cups filling over noodles, then spread evenly to cover. Sprinkle with 3/4 cup mozzarella cheese and 1/4 cup Parmesan cheese. Repeat layering of sauce, noodles, filling and cheeses 2 more times. Top with remaining 3 noodles. Spoon remaining sauce atop noodles. Sprinkle with remaining cheeses. Spray large piece of foil with nonstick olive oil spray. Cover lasagna with foil, sprayed side down.",
    "Bake lasagna 40 minutes. Carefully uncover. Increase oven temperature to 400°F. Bake until noodles are tender, sauce bubbles thickly and edges of lasagna are golden and puffed, about 20 minutes. Transfer to work surface; let stand 15 minutes before serving.",
    "ADD NOTES",
    "RELATED VIDEO",
    "EXCLUSIVE OFFERS",
    "NUTRITIONAL INFO",
    "Calories851Carbohydrates45 g(15%)Fat55 g(84%)Protein46 g(92%)Saturated Fat27 g(136%)Sodium1384 mg(58%)Polyunsaturated Fat4 gFiber5 g(19%)Monounsaturated Fat20 gCholesterol178 mg(59%)",
    "per serving (8 servings)Powered by Edamam",
    "MENUS & TAGS",
    "TAGS:",
    "ITALIAN",
    "CHEESE",
    "DAIRY",
    "PASTA",
    "PORK",
    "TOMATO",
    "BAKE",
    "SAUTÉ",
    "DINNER",
    "MOZZARELLA",
    "PARMESAN",
    "MEAT",
    "SAUSAGE",
    "FALL",
    "WINTER",
    "POTLUCK",
    "BON APPÉTIT",
    "PEANUT FREE",
    "TREE NUT FREE",
    "SOY FREE",
    "NO SUGAR ADDED",
    "LEAVE A REVIEW",
    "REVIEWS",
    "Loved this so much! I cut the time way down by using johnsonville Italian sausage and Rao’s tomato sauce instead of making the sauce from scratch. I also used gluten free lasagna sheets and no one could tell.",
    "LILYBERMAN FROM CHICAGO /",
    "FLAG IF INAPPROPRIATE",
    "Have made this over the years as written, but now that we are empty nesters original version is too big. But, a 2/3 version works for us in an 11 x 7 inch pan. Used a 28 oz crushed tomato and omitted the diced tomatoes, which couldn't find anyway. The 15 oz ricotta is perfect and all the other ingredients are easy to reduce by two-thirds.",
    "JJABNER FROM ANNAPOLIS, MD /",
    "FLAG IF INAPPROPRIATE",
    "Delicious! I loved the combination of Italian sausage and basil. The recipe called for a can of diced tomatoes with green pepper and onion which I found a bit frustrating. In my grocery store they sell only sell diced tomatoes without the green pepper and onion. I would have liked to know how much pepper and onions I was supposed to add.",
    "ROBERTAO FROM TORONTO, ONTARIO /",
    "FLAG IF INAPPROPRIATE",
    "This lasagna is amazing and our favorite! I usually double the sauce, use what I need and freeze the rest. I have also been making this since it was first published (I even have the original magazine!) and have served this numerous times, always with rave reviews and requests for the recipe. Thank you!",
    "DHOLTAN FROM NORTH EAST, MD /",
    "FLAG IF INAPPROPRIATE",
    "This is my all-time, favorite lasagne. Can't even order it in an Italian restaurant and have it taste this good. It's a little work, but making the sauce one day and doing the assembly the next takes the edge off some. I've substituted ground beef for the sausage and it works well, too, but the pork really does make a difference in the flavor. I've tried so many others, but frankly I'll never try a new recipe for lasagne again, because when I crave it, this is what I'm craving. (When I make it for friends with small children, they always want the recipe, as it's enough for 2-3 dinners when they are small. Barely one if they are teenage boys, however...)",
    "ZIPKINDUNN FROM BERKELEY, CA /",
    "FLAG IF INAPPROPRIATE",
    "Before you make this dish (and you should - it is outstanding) make sure you have enough mozzarella and parmesan! These cheeses are listed under both filling and assembly, and I had to return to the grocery store mid-prep. In total, you will need 18 oz. of mozzarella and 5 oz. of parmesan.",
    "JILLNELSON25 FROM TOMS RIVER, NJ /",
    "FLAG IF INAPPROPRIATE",
    "I've been using this recipe since it was first published in Bon Appetit. It is the best base lasagna recipe - all the elements are as good on their own as they are together. We use one recipe to make two smaller pans and freeze one for later. Sixteen years later and it's still my go-to!",
    "HOLLIHIGH FROM BOISE, ID /",
    "FLAG IF INAPPROPRIATE",
    "This is my new lasagna recipe. The basil in the ricotta filling really made the entire dish. Rave reviews from all of my guests. I was a little worried that it might be a little too rich with all the cheese - don't get me wrong, I love all the cheese but thought this might be overdone. How very wrong to worry. This is the best lasagna recipe ever!",
    "CUISINIERE FROM PORTLAND, OREGON /",
    "FLAG IF INAPPROPRIATE",
    "Delicious!! Got raves all round. I added shiitake mushrooms and made extra sauce. I probably will not make this often as it is a lot of work - but worth it for the occasional crowd pleaser!!!!",
    "TESUQUEBABS FROM SANTA FE, NEW MEXICO /",
    "FLAG IF INAPPROPRIATE",
    "We usually quadruple the recipe and it makes a TON of lasagna. We tend to make 5-6 pans (13x9) from it. We eat one for dinner and freeze the rest for another night. This is our favorite lasagna recipe. One of my gluten-free roommates will make an eggplant lasagna or two with any leftover sauce and cheese mix. And we usually serve it with what we call a \"dessert salad\" (named such because of the apple pie flavored dressing we make: 1/2 cup olive oil, 1/2 cup maple syrup, 3-4 tablespoons of cinnamon, mix well. Slice up granny smith apples, put sliced apples on top of raw baby spinach and add a tablespoon or two of the \"dressing\") Definitely not our healthiest meal, but totally worth the extra workouts late :)",
    "AUTUMN_IN_JEANS FROM SAN FRANCISCO, CA /",
    "FLAG IF INAPPROPRIATE",
    "Oh yes! Made this as instructed except we used regular noodles and pre-cooked them a bit. My favorite lasagna recipe so far. It came out fine without using extra sauce, but I could see why some people would want a little more.",
    "HEATHERNYC /",
    "FLAG IF INAPPROPRIATE",
    "I MADE THIS RECIPE. IT WAS TERRIBLE. THE SAUCE WAS TASTELESS. I AM EATING CARDBOARD. THIS IS THE 3rd RECIPE I HAVE USED FROM EPICURIOUS. I WILL NEVER USE THIS WEBSIGHT AGAIN!",
    "PAGEBOND08 FROM FUCK OFF /",
    "FLAG IF INAPPROPRIATE",
    "I've been making this lasagna recipe since it was first published in Bon Appetit. The cheese filling is now my go-to for manicotti, shells, etc. As a veggie fan, I also add layers of baby spinach between the cheese and sauce. Love this recipe as written without adjusting the sauce/filling ratio. So classic!",
    "HOLLIHIGH FROM BOISE, ID /",
    "FLAG IF INAPPROPRIATE",
    "I hate cooking and am pretty bad at it. But every now and then this dad has to cook for the family. This is the one dish I make better than my wife. Everyone , especially the kids, loves it when I make it. The only cooking thing I do better than my wife!",
    "VLADARINO FROM CHARLOTTE, NC /",
    "FLAG IF INAPPROPRIATE",
    "excellent recipe! I made this for thanksgiving, so i substituted the noodles for thinly sliced sweet potato (i used a mandolin vegetable slicer). this has the added benefit of making this gluten free. also i added more basil and a few garlic cloves to the filling, and caramelized the onions for the sauce. the entire lasagna was devoured, will definitely make this again",
    "CAREFREEMOVEMENT FROM ARIZONA /",
    "FLAG IF INAPPROPRIATE",
    "This is my go-to recipe for lasagna. Actually, it's the only lasagna that I like to make. I follow the recipe as written but I always double the amount of cheese filling only because I love cheesy lasagna. Well, I like cheesy everything. I've never trusted no-boil lasagna so I always use the regular ones. Also, I don't have a food processor so I just chop my basil really fine and it turns out just fine.",
    "TERESA_COLLANT FROM SAN DIEGO, CA /",
    "FLAG IF INAPPROPRIATE",
    "This one is a winner! Everyone went back for seconds and even thirds! I made the following modifications based on my family's needs: I used sweet turkey sausage, an extra small can (14.5 oz.) of pureed tomatoes and added a teaspoon of Penzeys Pasta Sprinkle. Good thing I used the extra tomatoes, since I had to hold dinner for almost an hour. In spite of being held in the oven on low for an extra 35-40 minutes, it came out great! I'll work this one into the rotation.",
    "LANEIL1 FROM CA /",
    "FLAG IF INAPPROPRIATE",
    "This doesn't exactly need more reviews, but yeah, it's all that and a bag of chips. as lasagna goes, it's not THAT labor intensive, though it does take a while. but worth every minute. i shorted the ricotta to just the 15 oz container and it was plenty of filling. otherwise made as directed and it was epic.",
    "EWALTRS FROM SAN FRANCISCO, CA /",
    "FLAG IF INAPPROPRIATE",
    "Love this recipe! I have lost count of how many times I have made it. I love to use the Muir Glen fire roasted tomatoes. I sub the fire roasted diced tomatoes for the diced tomato with peppers and onions. I add 2 cans of diced tomatoes instead of one and that makes the perfect amount of sauce.",
    "TRACYET FROM KELLER, TX /",
    "FLAG IF INAPPROPRIATE",
    "This is my go to lasagna recipe. I love it and have made it for years. I only make one substitution and that is I use chicken sausage versus pork. It always turns out great. I recently made this lasagna for a girls night in. It was a simple, delicious way to entertain my guests. Check out how I incorporated this great recipe into my girls night in recently at http://pasadenadaisy.wordpress.com",
    "JENNYJ1122 FROM PASADENA, CALIFORNIA /",
    "FLAG IF INAPPROPRIATE",
    "This really is the best lasagna recipe I've tried. The fresh basil is excellent. I did double the sauce--this seems very important. The only thing I want to do differently next time is to replace the diced tomatoes with peppers and onions. Tasted a bit artificial. Next time I'm going to try unsalted diced tomatoes and just saute some green peppers and extra onion with the sauce. Otherwise--nothing to change!!",
    "LKENNEDY3 FROM RHODE ISLAND /",
    "FLAG IF INAPPROPRIATE",
    "delicious! loved the basil and the spicy sausage. added a bit more tomato sauce that I had lying around to this sauce, but not sure if you really need to double the recipe - it's up to your preference! it's almost better the next day. make the sauce the day before, assemble everything, then slide it in the fridge until you are ready to bake. we refrigerated it, packed it on ice, then drove four hours to Lake Tahoe and baked it in the cabin. Added about 15 minutes to the baking time and it baked perfectly - yum!",
    "NORASOLEDAD FROM SAN FRANCISCO, CA /",
    "FLAG IF INAPPROPRIATE",
    "This was fantastic. Just really awesome. Tweak it if you like but it was great as-is.",
    "MBLACK69 FROM DALLAS /",
    "FLAG IF INAPPROPRIATE",
    "This recipe drew raves from my Italian husband whose grandmother made \"perfect\" lasagna. He was skeptical when he saw the filling in the food processor, but he's a convert now. I had some extra sauteed mushrooms and caramelized red onions so I tossed those in the sauce, but otherwise, I followed the recipe--although he did make me promise never to use no boil noodles.",
    "ERIN_DAKE FROM SAN JOSE, CA /",
    "FLAG IF INAPPROPRIATE",
    "Best lasagna EVER. Enough said. :)",
    "GIVINGTREE FROM TORONTO, ONTARIO CANADA /",
    "FLAG IF INAPPROPRIATE",
    "VIEW MORE REVIEWS",
    "RELATED CONTENT",
    "Baked Herbed Gefilte Fish",
    "Cranberry Relish with Grapefruit and Mint",
    "Pumpkin Chiffon Mousse with Gingersnap Crust",
    "Chestnut, Wild Rice, and Pistachio Dressing",
    "Sweet Corn Ice Cream With Butterscotch",
    "Strawberry-Rose Agua Fresca",
    "SPONSORED STORIES",
    "Meghan Markle's Affordable Cashmere Sweater Is Back in Stock",
    "EVERLANE ON T+L - STYLE",
    "How To Efficiently Empty Your Bowels Every Morning - Top Surgeon Explains How",
    "GUNDRY MD | SUPPLEMENT",
    "How To: Reduce Sagging Jowls (Do This)",
    "WWW.CITYBEAUTY.COM",
    "This Just Might Be the Easiest, Most Addictive Appetizer Ever",
    "Mini Frozen Key Lime Pies",
    "Our Food Editor's Absolute, All-Time Favorite Recipes",
    "RECOMMENDED BY",
    "Get our latest recipes and expert tips right in your inbox",
    "SIGN UP",
    "Connect with EpicuriousLike Epicurious on FacebookFollow Epicurious on TwitterFollow Epicurious on PinterestFollow Epicurious on TumblrWatch Epicurious on YouTubeFollow Epicurious on Google+Follow Epicurious on InstagramSubscribe to Epicurious RSS feeds",
    "SITE MAP",
    "Recipes & Menus",
    "Expert Advice",
    "Ingredients",
    "Holidays & Events",
    "Video",
    "HELPFUL LINKS",
    "Help",
    "Contact Us",
    "Masthead",
    "Accessibility Help",
    "Advertising",
    "Press Center",
    "Newsletters",
    "Epicurious Cookware",
    "Epicurious Wine",
    "FOOD INNOVATION GROUP",
    "Bon Appétit",
    "Epicurious",
    "Gourmet",
    "Condé NastCondé Nast Websites",
    "SUBSCRIPTION SERVICESCAREERSCONDÉ NAST STOREREPRINTS/PERMISSIONS",
    "© 2019 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated 1/1/20) and Privacy Policy and Cookie Statement (updated 1/1/20).Your California Privacy RightsSettingsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad Choices",
    "Select Ingredients",
    "(note: you can drag this box aro"
  ],
  "__v": 1
}