{
  "hash": "886f1cdd26b25d958c7164bd86852016b732aba2",
  "title": "BROWNIE COOKIES WITH SALTED CARAMEL CREME FILLING",
  "image": "http://www.bakersroyale.com/wp-content/uploads/2012/06/Brownie-Sandwich-Cookies-with-Salted-Creme-Filling-Bakers-Royale1.jpg",
  "href": "http://www.bakersroyale.com/brownie-sandwich-cookies-with-salted-caramel-creme-filling/",
  "extension": "Chrome",
  "firstAdded": "2017-04-11T20:38:32.542000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions:",
    "To make brownie cookies:",
    "Place 7oz. of the chocolate and the butter in a saucepan over low heat and gently stir until melted and smooth. Set aside.",
    "Place the eggs, sugar and vanilla in the bowl of a stand mixer fitted with a whisk attachment and beat for 15 minutes or until pale and creamy. Add in flour, baking powder, melted chocolate mixture, remaining 5 oz. of chocolate and mix to combine. Set aside to to stand for 10 minutes. Spoon a little under a 1 tablespoonful of the mixture, onto parchment lined bake sheet. Bake for about 8–10 minutes or until puffed and cracked. Allow to cool completely on trays.",
    "To make caramel creme filling:",
    "Place butter in a bowl and beat until creamed. Add in confectioner sugar and salt and beat until light combined. Add in caramel and beat until combined.",
    "Assembly:",
    "Spread a tablespoon and a half of caramel creme on underside of one brownie cookie and place a second brownie cookie bottom side down on top frosting."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "Brownie Cookie (adapted from Donna Hay)",
    "12 oz. chocolate, chopped",
    "3 tablespoons butter",
    "2 large eggs",
    "⅔ cup sugar",
    "1 teaspoon vanilla extract",
    "¼ cup all-purpose flour, sifted",
    "¼ teaspoon baking powder, sifted",
    "Salted Caramel Creme Filling (by Bakers Royale)",
    "1 cup butter",
    "2 cups confectioner sugar",
    "1/4 teaspoon salted",
    "1/4 cup caramel (Make sure caramel is cooled if making homemade. Click here for homemade caramel sauce recipe)"
  ],
  "__v": 1
}