{
  "__v": 1,
  "directions": [
    "0",
    "The purée: Melt the butter over medium heat in large saucepan or Dutch oven. Rinse the leeks well in a colander, spin them dry in a salad spinner and add them to the pot.",
    "Sauté leeks over medium-low heat, stirring occasionally, for 8 to 10 minutes, until tender but not browned. Add the potatoes, celery root, cream, salt and pepper to the pot; stir and bring to a boil. Lower the heat to very low, cover the pot and simmer gently for 25 to 30 minutes, stirring occasionally, until the vegetables are tender, being careful not to scorch them on the bottom.",
    "In batches, pour the mixture into the bowl of a food processor and pulse until coarsely puréed. Season, return to saucepan and keep warm over very low heat.",
    "Scallops: Pat the scallops dry with paper towels and season generously on both sides with salt and pepper. Heat two 12-inch (30-cm) sauté pans over medium-high heat. Add 2 tbsp (30 mL) of grapeseed oil to each pan, and when almost smoking hot, add half of the scallops to each pan. Cook undisturbed for about 3 minutes, until golden. Don’t crowd them in the pans. Turn the scallops and sear other side for 2 to 3 minutes until cooked through.",
    "Spoon purée onto 6 dinner plates. Place the scallops on the purée, drizzle with the basil-infused oil and sprinkle with chives. Serve warm.",
    "Makes 6 servings"
  ],
  "firstAdded": "2014-05-10T00:02:36.901000",
  "hash": "23ec2783277afc84b3d0d39621a2f68185bf4913",
  "href": "http://www.vancouversun.com/life/Wine+Match+Seared+scallops+potato+celery+root+pur%C3%A9e/7939889/story.html",
  "image": "http://www.vancouversun.com/life/Wine+Match+Seared+scallops+potato+celery+root+pur%C3%A9e/7939889/cms/binary/7939890.jpg",
  "ingredients": [
    "0",
    "5 tbsp (75 mL) unsalted butter",
    "6 cups (1.5 L) chopped leeks, white and green parts (about 4 leeks)",
    "4 cups (1 L) diced peeled Yukon Gold potatoes",
    "4 cups (1 L) diced, peeled celery root",
    "3 cups (750 mL) heavy cream",
    "Kosher salt and freshly ground black pepper",
    "24 to 26 large “dry” sea scallops",
    "4 tbsp (60 mL) grapeseed oil, divided",
    "Basil-infused oil, for serving",
    "Minced fresh chives, for serving"
  ],
  "keywords": [
    "unsalted",
    "butter",
    "white",
    "green",
    "parts",
    "leeks",
    "yukon",
    "gold",
    "potatoes",
    "celery",
    "root",
    "cream",
    "kosher",
    "salt",
    "black",
    "pepper",
    "dry",
    "scallops",
    "grapeseed",
    "oil",
    "divided",
    "basilinfused",
    "chives"
  ],
  "title": "Seared scallops and potato celery-root purée",
  "users": [
    null
  ]
}