{
  "hash": "e6101f9c07be6d558671e5ff2d9f56bb0c778aeb",
  "title": "MOROCCAN CHICKEN COUSCOUS",
  "image": "https://img.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2016/07/27/Food/Images/food_0041469622426.jpg?uuid=c5uoslP1Eea2UjFa5dTU3Q",
  "href": "https://www.washingtonpost.com/lifestyle/food/a-meal-i-can-cook-in-one-pot-gets-my-vote/2016/08/22/39108994-5dc1-11e6-9d2f-b1a3564181a1_story.html?hpid=hp_regional-hp-cards_rhp-card-food%3Ahomepage%2Fcard&utm_term=.06d1d202b0ef",
  "extension": "Chrome",
  "firstAdded": "2017-06-30T01:07:00.744000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cut the onion into small dice. Scrub the carrot well, then trim it. Cut the carrot into small dice. Mince the garlic. Cut the chicken into bite-size pieces, then season them lightly with salt and pepper.",
    "Heat the oil in a Dutch oven or saute pan with a tight-fitting lid over medium heat. Once the oil shimmers, add the onion, carrot, garlic, chicken, raisins, turmeric and cumin, stirring to combine. Cook for about 8 minutes, stirring a few times, until the chicken is no longer pink on the outside. (It will not be cooked through.)",
    "Add the couscous and broth, then a small pinch each of salt and pepper and the bay leaf. Increase the heat to medium-high; once the liquid starts bubbling at the edges, reduce the heat to medium-low, cover and cook for 5 to 10 minutes or until the couscous is tender and the chicken is cooked through. You may uncover during that time just long enough to stir once or twice.",
    "Meanwhile, finely chop the parsley.",
    "Uncover the Dutch oven or saute pan and discard the bay leaf. Use two forks to fluff the mixture a bit. Squeeze the lemon juice over the couscous.",
    "Divide among individual plates or wide, shallow bowls. Garnish with parsley. Serve warm."
  ],
  "ingredients": [
    "0",
    "1 small onion",
    "1 medium carrot",
    "4 cloves garlic",
    "2 boneless, skinless chicken breast halves (tenderloins removed)",
    "Kosher salt",
    "Freshly ground black pepper",
    "1 tablespoon olive oil",
    "1/4 cup golden raisins",
    "1 teaspoon ground turmeric",
    "1 teaspoon ground cumin",
    "1 cup pearled couscous, preferably whole-wheat",
    "2 cups no-salt-added chicken broth",
    "1 bay leaf",
    "Leaves from 4 stems flat-leaf parsley",
    "1 tablespoon fresh lemon juice"
  ],
  "__v": 1
}