{
  "hash": "4745b66db8e8912cf7f731d44c6f823ae867da2c",
  "title": "Homemade Southern Sausage Gravy",
  "image": "",
  "href": "http://www.deepsouthdish.com/2009/01/homemade-southern-sausage-gravy.html",
  "extension": "Chrome",
  "firstAdded": "2017-02-26T00:14:59.279000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Brown sausage in a large skillet, breaking up and crumbling the meat as it cooks, then start your biscuits. By the time the sausage in browned up, you'll be ready to pop the biscuits in the oven, and get the gravy going. Once the meat is fully browned, stir in the butter or bacon fat to the skillet until melted. Sprinkle the flour on top of the meat and bring the pan up to a medium high heat. Cook, stirring often, for 5 minutes.",
    "Slowly begin whisking in the first two cups of milk until fully incorporated and mixture begins to bubble. This will provide a fairly thick gravy. Continue whisking in additional milk a little bit at a time, until the gravy reaches the desired consistency. Grind plenty of pepper directly into the gravy, add salt to taste, mix well and serve over hot, split biscuits.",
    "Cook's Notes: For extra richness, substitute half and half for part of the milk. Tennessee Pride, Purnell's, Jimmy Dean, and Rudy's Farm are all good breakfast sausage products. I favor Jimmy Dean and love to use the hot version. Today's breakfast sausage is far leaner than it used to be and doesn't create a lot of pan drippings, so I do add in additional butter, bacon fat, or even a combination of the two. I really think that it adds a wonderful richness to the flavor of the gravy. Use a meat chopper, or follow this tip to make breaking up the sausage easier!",
    "Source: http://deepsouthdish.com"
  ],
  "ingredients": [
    "0",
    "1 pound roll of bulk pork breakfast sausage (like Jimmy Dean - I prefer hot)",
    "1/2 cup of butter, bacon fat or vegetable/canola oil",
    "1/4 cup of all purpose flour",
    "3 to 4 cups of milk, more or less, as needed",
    "1/4 teaspoon of freshly ground black pepper, or to taste",
    "1/2 teaspoon of kosher salt, or to taste"
  ],
  "__v": 2
}