{
  "hash": "6c16f33c520ce48ed68b6522e43e908bb63eb1a4",
  "title": "Veggie chilli",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/642_6_1398424646_lrg.jpg",
  "href": "http://www.jamieoliver.com/recipes/vegetables-recipes/veggie-chilli/",
  "extension": "Chrome",
  "firstAdded": "2015-04-23T09:38:15.251000",
  "users": [
    null
  ],
  "keywords": [
    "mediumsized",
    "potatoes",
    "level",
    "cayenne",
    "pepper",
    "extra",
    "sprinkling",
    "heaped",
    "cumin",
    "cinnamon",
    "salt",
    "black",
    "olive",
    "oil",
    "onion",
    "red",
    "yellow",
    "garlic",
    "bunch",
    "coriander",
    "chilli",
    "green",
    "tinned",
    "beans",
    "kidney",
    "chickpea",
    "pinto",
    "cannellini",
    "tomatoes"
  ],
  "directions": [
    "0",
    "This is a lovely alternative to traditional chilli con carne. It's packed with good stuff so is a great choice for veggies and meat eaters alike. I like to serve it with soured cream, guacamole and either rice or tortilla chips, but it's totally up to you.",
    "1. Preheat the oven to 200˚C/400˚F/gas 6.",
    "2. Peel the sweet potatoes and cut into bite-sized chunks. Sprinkle with a pinch each of cayenne, cumin, cinnamon, salt and pepper. Drizzle with olive oil and toss to coat, then spread out on a baking tray and set aside.",
    "3. Peel and roughly chop the onion. Halve, deseed and roughly chop the peppers. Peel and finely chop the garlic.",
    "4. Pick the coriander leaves and put aside, then finely chop the stalks. Deseed and finely chop the chillies.",
    "5. Place the sweet potatoes in the hot oven for 40 minutes, or until soft and golden.",
    "6. Meanwhile, put a large pan over a medium-high heat and add a couple lugs of olive oil. Add the onion, peppers and garlic and cook for 5 minutes.",
    "7. Add the coriander stalks, chilli and spices and cook for another 5 to 10 minutes, or until softened, stirring every couple of minutes.",
    "8. Drain the beans, then tip them into the pan with the tinned tomatoes. Stir well and bring to the boil, then reduce to a medium-low heat and leave to tick away for 25 to 30 minutes, or until thickened and reduced. Keep an eye on it, and add a splash of water if it gets a bit thick.",
    "9. Stir the roasted sweet potato through your chilli with most of the coriander leaves. Taste and season with salt and pepper, if you think it needs it.",
    "10. Scatter the remaining leaves over the top, and serve with some soured cream, guacamole and rice or tortilla chips."
  ],
  "ingredients": [
    "0",
    "2 medium-sized sweet potatoes, approximately 500g",
    "1 level teaspoon cayenne pepper, plus extra for sprinkling",
    "1 heaped teaspoon ground cumin, plus extra for sprinkling",
    "1 level teaspoon ground cinnamon, plus extra for sprinkling",
    "sea salt",
    "freshly ground black pepper",
    "olive oil",
    "1 onion",
    "1 red pepper",
    "1 yellow pepper",
    "2 cloves garlic",
    "a bunch of fresh coriander",
    "1 fresh red chilli",
    "1 fresh green chilli",
    "2 x 400 g tinned beans, such as kidney, chickpea, pinto and cannellini",
    "2 x 400 g tinned chopped tomatoes"
  ],
  "__v": 1
}