{
  "hash": "3a1a4db2fa7481eb25cbfa647fd497472b0288ad",
  "title": "Tex Mex Spaghetti Squash with Black Bean Guacamole",
  "image": "http://cdn.ohsheglows.com/wp-content/uploads/2013/09/spaghettisquashguac.jpg",
  "href": "http://ohsheglows.com/2013/09/18/tex-mex-spaghetti-squash-with-black-bean-guacamole/",
  "extension": "Chrome",
  "firstAdded": "2016-02-15T23:05:37.411000",
  "users": [
    null
  ],
  "keywords": [
    "spaghetti",
    "squash",
    "medium",
    "extra",
    "virgin",
    "olive",
    "oil",
    "cumin",
    "chili",
    "oregano",
    "salt",
    "pepper",
    "black",
    "bean",
    "guacamole",
    "avocados",
    "flesh",
    "scooped",
    "red",
    "onion",
    "tomato",
    "seeded",
    "rinsed",
    "beans",
    "cilantro",
    "leaves",
    "lime",
    "juice"
  ],
  "directions": [
    "0",
    "Directions:",
    "Preheat oven to 375F and line a large baking sheet with parchment paper. Slice off the stem of the squash and place the squash cut side down on a cutting board. With a chef's knife, carefully slice through the squash lengthwise to create two long halves. Scoop out the seeds and guts with an ice cream scoop. Brush some olive oil onto the squash and sprinkle with salt and pepper. Place squash halves cut side down on the baking sheet and roast for 30-50 minutes, depending on how large your squash is. When the squash is tender and you can easily scrape the strands with a fork, it's ready. I like to check the squash after 25-30 minutes to make sure I'm not over cooking it. Be sure not to cook for too long or it will turn mushy.",
    "While the squash is roasting, prepare the black bean guacamole. Mash the avocado flesh in a large bowl. Fold in the onion, tomato, drained and rinsed black beans, and cilantro. Season to taste with lime juice, salt, pepper, and red pepper flakes.",
    "Remove squash from the oven, flip over, and scrape the flesh with a fork in vertical motions. Do this until you've scraped all the strands off the skin. Now sprinkle on some chili powder, cumin, oregano, salt, and pepper (as much or as little as you want). Top the squash with guacamole and serve warm. You can also plate the spaghetti squash, if preferred.",
    "Tips:",
    "For a step by step photo tutorial for roasting spaghetti squash, see this post."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "For the spaghetti squash:",
    "1 medium spaghetti squash",
    "extra virgin olive oil",
    "ground cumin",
    "ground chili powder",
    "dried oregano",
    "salt & pepper",
    "For the black bean guacamole:",
    "2 avocados, pitted and flesh scooped out",
    "1/2 cup diced red onion",
    "1 small tomato, seeded and diced",
    "1 (15-ounce) can black beans, drained and rinsed (about 1.5 cups cooked beans)",
    "1/4 cup chopped cilantro leaves",
    "2 tablespoons fresh lime juice, or to taste",
    "fine grain sea salt, to taste",
    "freshly ground black pepper, to taste",
    "red pepper flakes, to taste"
  ],
  "__v": 1
}