{
  "hash": "15d91adc2b2aac966300e20983be2f5f33075c46",
  "title": "Brownies al cioccolato",
  "image": "https://cdn.shortpixel.ai/client/to_webp,q_lossy,ret_img,w_760/https://www.viaggi-usa.it/wp-content/uploads/2016/04/opt-copertina.jpg",
  "href": "https://www.viaggi-usa.it/ricetta-brownies/",
  "extension": "Chrome",
  "firstAdded": "2020-02-18T21:14:48.237000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Per preparare i brownies secondo la ricetta originale, per prima cosa bisogna sciogliere in un pentolino per il bagnomariail cioccolato e il burro, mescolando dolcemente con un mestolo di legno finché gli ingredienti non sono completamente sciolti e il composto non è diventato cremoso.",
    "Togliete il cioccolato dal bagnomaria e unite tutto lo zucchero, amalgamando bene con l’aiuto di una frusta, così da cominciare ad abbassare la temperatura del composto. Per accelerare il raffreddamento, passate il composto in una ciotola più grande, dove potrete aggiungere con più agio tutti gli altri ingredienti.",
    "Aggiungete dunque le uova una alla volta, mescolando bene con la frusta finché il composto non le ha assorbite completamente.",
    "Quando le uova saranno ben incorporate, prendete il cacao amaro e aggiungetelo all’impasto con l’aiuto di un setaccio. Mescolate con una spatola per dolci. L’aggiunta di questo ingrediente contribuisce a rendere il colore del composto di un marrone decisamente più brillante e procura un profumo ancora più intenso ai vostri brownies.",
    "Dopo aver incorporato il cacao, aggiungete anche la farina setacciata mescolando vigorosamente con la spatola per dolci, finché il composto non sarà diventato denso.",
    "Infine, aggiungete al tutto un pizzico di sale e due cucchiaini di estratto di vaniglia (10 ml circa). Se non riuscite a procurarvelo, potete anche usare una bustina di vanillina.",
    "Dopo aver aggiunto tutti gli ingredienti, passate l’impasto in una apposita teglia rettangolare non troppo grande, già foderata con carta da forno. Le dimensioni della teglia potete stabilirle voi, ma più grande sarà, più bassi saranno i brownies: questione di gusti!",
    "Infornate a 170° per 35-40 minuti.",
    "Quando il vostro brownie sarà pronto, toglietelo dal forno e lasciate che si raffreddi. Questo passaggio è molto importante: non fatevi prendere dalla furia di tagliarlo subito a fette, perché se lo farete quando è ancora caldo, al contatto con il coltello, il brownie si spaccherà tutto!",
    "Quando, dopo una decina di minuti, il dolce sarà freddo, prendete un coltello a lama liscia ben affilato e tagliate le fette secondo il vostro gusto, bagnando la lama con acqua calda prima di incidere il dolce."
  ],
  "ingredients": [
    "0",
    "110 gr di burro",
    "150 gr di cioccolato extra-fondente",
    "3 uova",
    "200 gr di zucchero bianco",
    "20 gr di cacao",
    "95 gr di farina 00",
    "10 ml di estratto di vaniglia",
    "un pizzico di sale"
  ],
  "__v": 2
}