{
  "hash": "7f8d261ea94688e03ad903248073ad3b20da95d9",
  "title": "Roasted Broccoli Rabe and Pesto Flatbread",
  "image": "http://cookieandkate.com/images/2015/08/broccoli-rabe-naan-recipe-1.jpg",
  "href": "http://cookieandkate.com/2015/broccoli-rabe-pesto-flatbread-recipe/",
  "extension": "Chrome",
  "firstAdded": "2016-02-01T19:30:27.720000",
  "users": [
    null
  ],
  "keywords": [
    "basil",
    "almonds",
    "parmesan",
    "cheese",
    "garlic",
    "roughly",
    "juice",
    "lemon",
    "salt",
    "black",
    "pepper",
    "extravirgin",
    "olive",
    "oil",
    "broccoli",
    "rabe",
    "naan",
    "flatbreads",
    "diameter",
    "crumbled",
    "feta",
    "red",
    "garnishing"
  ],
  "directions": [
    "0",
    "Preheat oven to 425 degrees Fahrenheit. Prepare the broccoli rabe by rinsing it and patting it dry. Slice off the tough lower ends and any stems that are greater than ¼-inch in diameter. Toss the rabe with a light drizzle of olive oil and a sprinkle of salt and pepper. Rub the olive oil onto the leaves to make sure the rabe is lightly and evenly coated with oil. Set aside.",
    "In a food processor or blender, combine the basil, almonds, Parmesan, garlic, lemon juice, salt and a few twists of freshly ground black pepper. Process the pesto while slowly drizzling in the olive oil, until the mixture is relatively smooth and uniform.",
    "Place the naan on an oven-safe metal cooling rack, if you have one, then place the rack on a baking sheet to catch any drips (the rack helps the naan get nice and crisp). If not, just place the naan directly onto a baking sheet. Spread pesto on the naan and top with crumbled feta cheese. Top with an even layer of broccoli rabe and a light sprinkle of sliced almonds.",
    "Bake until the broccoli rabe is tender and the leaves are deep green and crispy, about 8 to 9 minutes. Squeeze a small wedge of lemon over the naan and top with a light sprinkling of red pepper flakes. Let the naan cool slightly before slicing it with a sharp knife or pizza cutter and serving."
  ],
  "ingredients": [
    "0",
    "2 cups packed fresh basil",
    "½ cup sliced almonds, plus more for garnish",
    "½ cup grated Parmesan cheese",
    "2 cloves garlic, roughly chopped",
    "1 tablespoon lemon juice (about ½ lemon), plus more for garnish",
    "¼ teaspoon salt",
    "Freshly ground black pepper",
    "⅓ cup extra-virgin olive oil, plus more for the broccoli rabe",
    "1",
    "3 whole grain naan flatbreads, about 7 inches in diameter",
    "¾ cup (about 3¾ ounces) crumbled feta cheese",
    "Handful broccoli rabe (about ¼ pound)",
    "Red pepper flakes, for garnishing"
  ],
  "__v": 1
}