{
  "hash": "fc3711775947af621df9b7b124887836ddfb4feb",
  "title": "One-Pot Braised Chicken With Coconut Milk, Tomato and Ginger",
  "image": "https://static01.nyt.com/images/2020/02/10/dining/ch-tomato-and-coconut-braised-chicken/merlin_166828545_50e59496-f715-4d3a-a58e-4d03df861168-articleLarge.jpg",
  "href": "https://cooking.nytimes.com/recipes/1020864-one-pot-braised-chicken-with-coconut-milk-tomato-and-ginger?te=1&nl=cooking&emc=edit_fwd_20200221&campaign_id=90&instance_id=16179&segment_id=21497&user_id=4264688f24592aeeb06433e5d96d7150&regi_id=7985911420200221",
  "extension": "Firefox",
  "firstAdded": "2020-02-25T00:49:55.888000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Pat chicken thighs dry and season with salt and pepper. In a deep 12-inch skillet, heat the oil over medium-high. When the oil shimmers, add the chicken thighs, skin-side down, and cook, undisturbed, until nicely browned, 5 to 6 minutes. Flip and brown the other side, 4 to 5 minutes more. Transfer to a plate and set aside.",
    "Turn heat to medium-low, add the onion and cook until softened, 2 to 3 minutes. Add the garlic, ginger, cumin, cinnamon and red-pepper flakes, and cook until the garlic and the spices are fragrant, about 1 minute. Season with salt.",
    "Add the tomatoes with their juices and the coconut milk, and stir until combined, scraping up any brown bits that have formed at the bottom of the pan. Nestle the chicken back into the skillet along with any juices that have accumulated. Simmer, uncovered, until the chicken is cooked through and the sauce has thickened slightly, 15 to 20 minutes. Season to taste with salt and pepper.",
    "Divide the rice, if using, among bowls and plate the chicken on top, spooning additional sauce over it. Scatter with cilantro and a squeeze of lime, if you like."
  ],
  "ingredients": [
    "0",
    "1 ½ to 2",
    "pounds bone-in, skin-on chicken thighs, at room temperature",
    "Kosher salt and black pepper",
    "2",
    "tablespoons grapeseed or canola oil",
    "1",
    "medium red onion, thinly sliced",
    "3",
    "garlic cloves, finely chopped",
    "1",
    "(2-inch) piece fresh ginger, peeled and finely chopped",
    "1",
    "teaspoon ground cumin",
    "½",
    "teaspoon ground cinnamon",
    "½",
    "teaspoon red-pepper flakes",
    "1",
    "(14-ounce) can cherry or diced tomatoes with their juices",
    "1",
    "(13-ounce) can full-fat coconut milk",
    "Steamed white rice, for serving (optional)",
    "3",
    "tablespoons roughly chopped cilantro",
    "1",
    "lime, quartered, for serving (optional)"
  ],
  "__v": 1
}