{
  "hash": "ae6d27d6734e9c2e833fa252c03a37da096c7eda",
  "title": "Homemade Gluten Free Buckwheat Chapatis and Tortillas Recipe- Vegan, Easy",
  "image": "https://fbcdn-sphotos-h-a.akamaihd.net/hphotos-ak-ash3/1044458_10152951609295580_931167962_n.jpg",
  "href": "http://www.pennilessparenting.com/2013/06/homemade-gluten-free-buckwheat-chapatis.html",
  "extension": "",
  "firstAdded": "2015-12-30T13:10:12.567000",
  "users": [
    null
  ],
  "keywords": [
    "untoasted",
    "buckwheat",
    "flour",
    "extra",
    "rolling",
    "instant",
    "making",
    "use",
    "regular",
    "plain",
    "mashed",
    "potatoes",
    "long",
    "make",
    "sure",
    "lump",
    "free",
    "using",
    "boiled",
    "youll",
    "need",
    "water",
    "salt"
  ],
  "directions": [
    "0",
    "Instructions",
    "1. Mix the flour with the salt and mashed potatoes very well. Try incorporating as much flour as you can.",
    "2. Add the water and mix it well. It'll seem like there is way too much flour, but there isn't. Keep mixing it in until more and more flour gets absorbed and you have a good workable and not too sticky dough that has used up all the flour.",
    "3. Flour a working surface.",
    "4. Heat up a frying pan. I use my cast iron skillet.",
    "5. Take a golf ball sized clump of dough, roll it in the flour, and then roll it out with a rolling pin as thin as you can. You may need to add more flour as you're rolling it to prevent it from sticking to the work surface.",
    "6. Carefully pick up the dough, making sure not to rip it, and place it flat in the frying pan.",
    "7. Cook on a medium/high heat until it starts bubbling up, then flip it over and cook it on the next side. I usually roll another tortilla/chapati out while the first one is cooking, as they tend to take the same amount of time for me.",
    "8. Use as you would any tortilla or flatbread!"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 cups untoasted buckwheat flour, plus extra for rolling",
    "1 cup mashed potatoes (I made mine with instant mashed potatoes making sure not to use too much liquid, but you can also use regular plain mashed potatoes as long as you make sure that it is lump free)",
    "1-3 tablespoons water (if you are using mashed potatoes made from boiled potatoes, you'll need less water)",
    "1 teaspoon salt"
  ],
  "__v": 1
}