{
  "hash": "a7e96d58f2601930b8834e640761ce59142ab78f",
  "title": "Bouillabaisse",
  "image": "//images.food52.com/zfL5W4V34k5Aa3LwJT0ltM3RgRA=/753x502/0d6d76a8-241d-44d0-9b01-bea03402fe0f.mWfuE5kC3N97Z8ui_TofhvJRf4B0bple-AGetFZwG4o-NWUtdwsAkCC5UCkoZ8AI4gqrno0FH1WYel04CBrVL9g-IFNENpWhHP0NKZ4B2_ht2HzQ9vmHs3x4IzpWc20y1Bo-adMEaq2zOuA7w15VK0NeqnCk2zMdUZQh2AuV4T2GUvQ.jpeg",
  "href": "http://food52.com/recipes/36705-bouillabaisse",
  "extension": "Chrome",
  "firstAdded": "2015-07-15T17:02:02.541000",
  "users": [
    null
  ],
  "keywords": [
    "extravirgin",
    "olive",
    "oil",
    "onion",
    "tomatoes",
    "coarsely",
    "garlic",
    "bulb",
    "fennel",
    "fronds",
    "extra",
    "fingerling",
    "potatoes",
    "pieces",
    "bay",
    "leaves",
    "saffron",
    "threads",
    "soaked",
    "water",
    "minutes",
    "seafood",
    "stock",
    "possible",
    "bar",
    "harbor",
    "orange",
    "zest",
    "shrimp",
    "mussels",
    "scrubbed",
    "beards",
    "hardshelled",
    "clams",
    "white",
    "fish",
    "fillets",
    "red",
    "snapper",
    "striped",
    "bass",
    "grouper",
    "andor",
    "cod",
    "coarse",
    "salt",
    "pastis",
    "pernod",
    "parsley",
    "rouille",
    "spread",
    "baguette",
    "crisps",
    "recipe",
    "cubed",
    "crust",
    "divided",
    "bouillabaisse",
    "broth"
  ],
  "directions": [
    "0",
    "If making baguette crisps to serve alongside, heat the oven to 250º F.",
    "Place a 6-8 quart stock pot over medium heat. Add enough olive oil to coat the bottom and after about 30 seconds add the chopped onion. Stir frequently and let cook for about 5 minutes or until the onion begins to turn translucent. Add the tomatoes and garlic at the same time and stir. Let cook for another 5 minutes. Add the fennel, fennel fronds, potatoes, bay leaf, saffron and soaking water, seafood stock, and orange zest. Let cook until it begins to softly boil. Taste for salt and pepper—add as needed.",
    "If making rouille and baguette crisps to serve with your bouillabaisse, now is good time to start making them (see below)—just turn the burner to low while you do so. For the rouille, use 2 Tbsp of broth from your boiling pot.",
    "Bring the heat back to medium, and add the shrimp, mussels, and clams. Cook for 2 minutes, then add the fish. Continue to cook until all of the seafood is just cooked through.",
    "Remove the mollusks with tongs and set aside. Add the Pastis if you are using it. Give the soup a gentle stir and then ladle into individual serving bowls.",
    "To serve: Add a few of each kind of the mollusk to each bowl, and then top with a sprinkle of parsley, a few fronds of fennel, and a slice of baguette topped with a generous helping of Rouille.",
    "1",
    "Preheat the oven to 200 degrees.",
    "Add the baguette pieces to a blender along with the water, two garlic cloves, olive oil, and bouillabaisse broth. Blend for 1 minute if using a very powerful blender (like a Vitamix or Blendtec) or 2 minutes if using a standard kitchen blender. If it is too thick to blend, add more bouillabaisse broth, one tablespoon at a time. Set aside.",
    "Slice a baguette into 1/2-inch slices and spread evenly on baking tray. Toast for 5 to 10 minutes, removing when the slices just begin to brown.",
    "Slightly smash the two remaining garlic cloves and rub one over each toast, then brush each with olive oil. Serve with a side of Rouille for dipping.",
    "Note: Allow 3-4 crisps per person. One is usually served in the bouillabaisse, but it is also nice to serve a few on the side (even if that isn’t traditional)."
  ],
  "ingredients": [
    "0",
    "2 to 3 tablespoons extra-virgin olive oil",
    "1 large onion, chopped",
    "2 large tomatoes, coarsely chopped",
    "4 garlic cloves, peeled and chopped",
    "1 small bulb of fennel",
    "1/4 cup fennel fronds (plus a few extra for garnish)",
    "1 pound fingerling potatoes, cut into 1-inch pieces",
    "2 bay leaves",
    "1/4 teaspoon saffron threads, soaked in 1 tablespoon warm water for at least 5 minutes",
    "9 cups seafood stock (homemade if possible, Bar Harbor if not)",
    "1 tablespoon orange zest",
    "1/2 pound large shrimp, peeled",
    "1/2 pound mussels, scrubbed and beards removed",
    "1/2 pound small hard-shelled clams, scrubbed",
    "3 pounds white fish fillets (such as red snapper, striped bass, grouper, and/or cod), cut into 2-inch pieces",
    "1 1/2 tablespoons coarse sea salt",
    "1 tablespoon Pastis (such as Pernod), optional",
    "Parsley, chopped for garnish",
    "Rouille spread over baguette crisps, recipe below",
    "1",
    "1 cup cubed baguette, most of the crust removed",
    "3 tablespoons water",
    "4 large garlic cloves, divided",
    "3 tablespoons extra-virgin olive oil",
    "2 tablespoons bouillabaisse broth or seafood broth",
    "Baguette",
    "Extra-virgin olive oil"
  ],
  "__v": 1
}