{
  "hash": "40c5720f0acd6cf77bc6063f01ca80fdae4301d6",
  "title": "Sticky Toffee Banana Pudding",
  "image": "http://www.epicurious.com/images/recipesmenus/2011/2011_march/364093.jpg",
  "href": "http://www.epicurious.com/recipes/food/views/Sticky-Toffee-Banana-Pudding-364093",
  "firstAdded": "2015-01-14T12:07:25.083000",
  "users": [
    null
  ],
  "keywords": [
    "whipping",
    "cream",
    "golden",
    "brown",
    "sugar",
    "dark",
    "corn",
    "syrup",
    "unsalted",
    "butter",
    "unbleached",
    "purpose",
    "flour",
    "baking",
    "room",
    "eggs",
    "mashed",
    "bananas",
    "rum",
    "vanilla"
  ],
  "directions": [
    "0",
    "For toffee sauce: Bring 1 1/4 cups cream, brown sugar, corn syrup, butter, and 1/8 teaspoon salt to boil in heavy small saucepan over medium heat, whisking until sugar dissolves. Reduce heat to medium-low and cook at gentle boil until sauce coats spoon thickly and is reduced to 11/2 cups, whisking occasionally, about 15 minutes. Remove from heat and cool. Whisk in 3 tablespoons or more cream to thin sauce to desired consistency. DO AHEAD: can be made 2 days ahead. Cover and chill. Rewarm slightly before using.",
    "For banana cake: Preheat oven to 350°F. Butter 8 x 8 x 2-inch nonstick metal baking pan. Dust baking pan with flour, tapping out excess.",
    "Whisk flour, baking powder, and 1/2 teaspoon salt in medium bowl. Using electric mixer, beat butter and sugar in large bowl until well blended. Beat in eggs 1 at a time. Beat in mashed bananas, rum, and vanilla (batter may look curdled). Add dry ingredients in 4 additions, beating just to blend after each addition. Spread batter evenly in prepared baking pan.",
    "Bake cake until tester inserted into center comes out clean, 35 to 38 minutes. Spread 1/2 cup toffee sauce evenly over cake. Return cake to oven and bake until sauce is bubbling thickly, about 6 minutes. Cool cake in pan on rack 30 minutes. Cut around cake in pan. Cut cake into 9 squares or 12 rectangles. Serve cake slightly warm or at room temperature with toffee sauce and top with sliced bananas, if desired."
  ],
  "ingredients": [
    "0",
    "1 1/4 cups plus 3 tablespoons (or more) heavy whipping cream",
    "1/2 cup (packed) golden brown sugar",
    "1/2 cup dark corn syrup",
    "1/4 cup (1/2 stick) unsalted butter",
    "1",
    "2 cups unbleached all purpose flour",
    "1 1/2 teaspoons baking powder",
    "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
    "2/3 cup (packed) dark brown sugar",
    "2 large eggs",
    "1 cup mashed very ripe bananas (2 to 3)",
    "1 tablespoon dark rum",
    "1 1/2 teaspoons vanilla extract",
    "Sliced bananas (optional)"
  ],
  "__v": 1
}