{
  "hash": "ccefd9214de14926ec6f68b061bc443fc3e9e822",
  "title": "Grilled Pepper Chicken & Green Mango Salad",
  "image": "https://www.marionskitchen.com/wp-content/uploads/2019/07/Grilled-Pepper-Chicken-Green-Mango-Salad4.jpg",
  "href": "https://www.marionskitchen.com/grilled-pepper-chicken-green-mango-salad/?fbclid=IwAR2GvVHL6vILk52gQ9tmyn7U7_5jXJY5OI2fNlEzss2-qdnKd9xlZdIkoLw",
  "extension": "Firefox",
  "firstAdded": "2019-12-10T01:05:23.428000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "STEP 1",
    "Use a mortar and pestle to pound the garlic, coriander roots, peppercorns and salt to a rough paste. In a large bowl, combine the chicken, garlic paste mixture, turmeric and fish sauce. Then thread the chicken pieaces on the skewers.",
    "STEP 2",
    "Grill chicken skewers over high heat.",
    "STEP 3",
    "Place mango coconut, chilli, shallot, fish sauce, sugar and lime juice in a large bowl. Mix with hands, squeezing the mango slightly to bruise. Taste and adjust seasoning with fish sauce, sugar and lime. It should be sweet and sour and a little spicy. Toss through mint leaves and coriander leaves. Serve mango salad topped with grilled chicken skewers.",
    "STEP 4",
    "Preheat oven to 180°C/356°F.",
    "STEP 5",
    "Heat a large frying pan over high heat. Add a tablespoon of oil and place as many skewers as will fit into the hot pan. Cook for 3-4 minutes each side or until you get some nice golden colour. Then place onto a baking tray and repeat until the skewers are all browned. Cover with foil and place in the oven for 10-15 minutes or until cooked through.",
    "STEP 6",
    "For the green mango salad, mix the green mango, shallots, coconut, chilli, chilli flakes, fish sauce, sugar and lime juice until well combined. Taste and adjust the seasoning to your taste with extra fish sauce, sugar or lime juice. Then add in the mint leaves and coriander and toss until combined.",
    "STEP 7",
    "Serve the chicken skewers with the green mango salad.",
    "*NOTES:",
    "Green mango is an unripe mango. You can find these at an Asian or Thai grocery store. You can also use finely sliced Granny Smith apples instead."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "500g (1 lb) chicken thigh meat, cut into roughly 3cm cubes",
    "3 garlic cloves",
    "3 coriander roots, cleaned",
    "½ tsp white peppercorns",
    "¼ tsp sea salt",
    "½ tsp turmeric",
    "2 tsp fish sauce",
    "12 bamboo skewers",
    "vegetable oil for cooking",
    "Green mango salad:",
    "1 large green mango, shredded (about 2 cups when shredded)*",
    "2 Asian shallots, cut into small wedges",
    "1 tbsp dried shredded coconut",
    "1 long red chilli, finely sliced",
    "1 tsp chilli flakes",
    "2½ tbsp fish sauce",
    "1½ tbsp white sugar",
    "2 tbsp lime juice",
    "¼ cup mint leaves",
    "3 tbsp roughly chopped coriander leaves"
  ],
  "__v": 1
}