{
  "hash": "786c0a3aa3d38fb66fb4431ede666a79243681bd",
  "title": "Blue Cheese & Mushroom Pizza",
  "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7683537.jpg&w=550&h=550&c=sc&poi=face&q=85",
  "href": "http://www.eatingwell.com/recipe/278557/blue-cheese-mushroom-pizza/",
  "extension": "Chrome",
  "firstAdded": "2020-03-29T21:14:40.789000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Step 1",
    "Position racks in upper and lower thirds of oven. Place a large cast-iron skillet on the top rack; preheat to 450 degrees F.",
    "Step 2",
    "Lightly dust a large rimmed baking sheet with flour. Stretch dough to fit the entire pan and brush with 1 tablespoon oil. Bake the dough on the lower rack until the bottom is slightly browned, about 10 minutes.",
    "Step 3",
    "Meanwhile, carefully remove the skillet from the oven and add 1 tablespoon oil, mushrooms and onions (or scallions); stir to combine. Return to the top rack and roast until the mushrooms are slightly browned and tender, 15 to 20 minutes.",
    "Step 4",
    "When both pans are out of the oven, set the broiler to high. Stir the remaining 1 tablespoon oil, sage, garlic, Italian seasoning, salt and crushed red pepper in a small bowl. Spread the seasoned oil over the crust and top with the mushroom mixture and cheese. Place the pizza on the top rack and broil until the cheese starts to brown, 2 to 3 minutes. Sprinkle the pizza with pine nuts. Let stand at room temperature for 5 minutes. Cut into 10 pieces and serve warm."
  ],
  "ingredients": [
    "0",
    "IngredientsIngredient Checklist",
    "All-purpose flour for dusting",
    "1 pound whole-wheat pizza dough, at room temperature",
    "3 tablespoons extra-virgin oil, divided",
    "12 ounces mixed mushrooms, such as oyster, maitake and/or shiitake, sliced (about 8 cups)",
    "½ cup chopped spring onions or scallions",
    "3 tablespoons chopped fresh sage",
    "4 cloves garlic, sliced",
    "2 teaspoons Italian seasoning",
    "¼ teaspoon salt",
    "¼ teaspoon crushed red pepper",
    "½ cup crumbled blue cheese",
    "¼ cup pine nuts, toasted"
  ],
  "__v": 1
}