{
  "hash": "21d9c16f11dba50ab7c440b88c1c51fd194d6a14",
  "title": "Cauliflower Rice Stuffed Peppers",
  "image": "http://cdn.minimalistbaker.com/wp-content/uploads/2016/06/Easy-HEALTHY-Cauliflower-Rice-Stuffed-Peppers-Protein-and-fiber-rich-and-so-easy-vegan-glutenfree-plantbased-stuffedpeppers-recipe.jpg",
  "href": "http://minimalistbaker.com/cauliflower-rice-stuffed-peppers/",
  "extension": "Chrome",
  "firstAdded": "2016-08-26T20:51:08.513000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 375 degrees F (190 C) and set out a 9x13-inch baking dish or rimmed baking sheet. Also brush halved peppers with a neutral, high heat oil, such as grape seed, avocado or refined coconut. Set aside.",
    "Prepare cauliflower rice by following these instructions. Then heat a large rimmed skillet over medium heat.",
    "Once hot, add oil, garlic (optional), onion, salt and pepper. Sauté for 1 minute, stirring frequently. Then add cauliflower ‘rice’ and stir to coat. Place the lid on to steam the rice for about 1 minute, then remove from heat and transfer the mixture to a large mixing bowl.You aren't looking to completely cook the 'rice', as it will continue cooking in the oven.",
    "Add remaining ingredients - black beans through salt and pepper - to the cauliflower rice and mix to thoroughly combine. Taste and adjust seasonings accordingly, adding salt, pepper, or more spices as desired.",
    "Generously stuff halved peppers with ~ 1/2 cup of the mixture until all peppers are full (you may have a little leftover filling, which can be added to salads or served on the side), then cover the dish with foil.",
    "Bake for 30 minutes covered, then remove foil, increase heat to 400 degrees F (204 C), and bake for another 15-20 minutes, or until peppers are soft and slightly golden brown. For softer peppers, bake 5-10 minutes more. Serve with desired toppings (listed above) or as is. I recommend avocado, lime juice, hot sauce, and cilantro.",
    "Best when fresh, though leftovers keep covered in the refrigerator for 2-3 days. Reheat in a 350 degree F (176 C) oven until warmed through - about 20 minutes. See notes for instructions on making ahead of time."
  ],
  "ingredients": [
    "0",
    "1 head cauliflower, grated into ‘rice’ (see method here)",
    "1 Tbsp (15 ml) olive or grape seed oil",
    "optional: 3 cloves garlic, minced",
    "1 cup (160 g) diced red, white, yellow or green onion (I recommend red)",
    "Pinch each sea salt and black pepper",
    "1",
    "4 large red, yellow or orange bell peppers, halved, seeds removed",
    "1 15-ounce (425 g) can black or pinto beans, rinsed and drained (if unsalted, add additional salt to taste)",
    "2/3 cup (~170 g) salsa, plus more for serving (very flavorful salsa, like Trader Joe’s Chunky Salsa)",
    "2 tsp cumin powder, plus more to taste",
    "2 tsp chili powder, plus more to taste",
    "2-3 Tbsp (30-45 ml) lime juice",
    "1/4 tsp each sea salt and black pepper, plus more to taste",
    "2",
    "1 ripe avocado, sliced",
    "Fresh lime juice",
    "Hot sauce",
    "Cilantro, chopped",
    "Diced red onion",
    "Creamy Cilantro Dressing",
    "Chipotle Red Salsa (or your favorite salsa)"
  ],
  "__v": 1
}