{
  "hash": "6bee3332e0ce69f9e5800c876f155a61f6b0c78e",
  "title": "Danielle Oron’s Salted Tahini Chocolate Chip Cookies",
  "image": "https://images.food52.com/C7esqA5OYMmcl-UNozZGDrPg8bI=/753x502/56f28815-6b9f-4b5f-88d4-c27085e2ba20--2016-1019_genius-salted-tahini-chocolate-chip-cookies_mark-weinberg_467.jpg",
  "href": "https://food52.com/recipes/66070-danielle-oron-s-salted-tahini-chocolate-chip-cookies",
  "extension": "Chrome",
  "firstAdded": "2018-01-26T22:41:10.267000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In the bowl of an electric mixer fitted with the paddle attachment, cream the butter, tahini, and sugar together on medium speed until light in color and fluffy, about 5 minutes.",
    "Add the egg, egg yolk, and vanilla extract and continue mixing on medium speed for another 5 minutes.",
    "Sift the flour, baking soda, baking powder, and salt into a large bowl and combine. Add the flour mixture to the butter mixture and mix on low until just combined.",
    "Add the chocolate and mix it in by hand with a rubber spatula.",
    "Line a baking sheet with parchment paper. Using a 2 ounce (60ml)-capacity ice cream disher (scoop with release), scoop out 12 dough balls and place them on the baking sheet. Wrap the baking sheet with plastic wrap and place it in the freezer for 12 hours. This will allow the glutens in the flour to relax and will give you a tender soft cookie (Editor’s note: I liked them baked straightaway, too!)",
    "At this point you can bake 1 or bake all 12. Keep the cookie dough balls in zip-top bags in the freezer for up to 6 months.",
    "When ready to bake, heat the oven to 325° F and line a baking sheet with parchment or silicone mat. Space the cookie dough balls at least 3 inches apart to allow for them to spread. Bake for 13 to 16 minutes until just golden brown around the edges. They will still look fairly unbaked in the middle, which is perfect. Sprinkle each with Maldon salt when they come out of the oven.",
    "Allow to cool 20 minutes on baking sheet or cooling rack."
  ],
  "ingredients": [
    "0",
    "8 tablespoons /1 stick (113 grams) room temperature unsalted butter",
    "1/2 cup (120 milliliters) tahini, well stirred",
    "1 cup (200 grams) granulated sugar",
    "1 large egg",
    "1 egg yolk",
    "1 teaspoon vanilla extract",
    "1 cup plus 2 tablespoons (150 grams) all-purpose flour",
    "1/2 teaspoon baking soda",
    "1/2 teaspoon baking powder",
    "1 teaspoon salt",
    "1 3/4 cups (230 grams) Valrhona discs (64% cocoa) or other good quality chocolate chips or chunks",
    "Flaky salt, like Maldon or fleur de sel"
  ],
  "__v": 1
}