{
  "hash": "ed62d0b01203dba504c6ff41602c35c9d37b8190",
  "title": "Cardamom and Currant Snickerdoodle Skillet Cookie",
  "image": "https://www.washingtonpost.com/rf/image_982w/2010-2019/WashingtonPost/2017/11/28/Others/Images/2017-11-08/foodlab006.JPG",
  "href": "https://www.washingtonpost.com/recipes/cardamom-and-currant-snickerdoodle-skillet-cookie/16192/?utm_term=.15b5c0acc3cb",
  "extension": "Firefox",
  "firstAdded": "2017-12-23T18:47:44.465000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350 degrees.",
    "Whisk together 1/4 cup of the granulated sugar, all the cinnamon and 1/2 teaspoon of the cardamom in a medium bowl. Sprinkle half this mixture in an 8-inch cast-iron skillet.",
    "Combine the butter, the remaining 1/2 cup of granulated sugar and the brown sugar in the bowl of a stand mixer or use a handheld electric mixer. Beat on medium-low speed until well incorporated. Add the eggs one at a time, then the vanilla extract. Stop to scrape down the bowl.",
    "Add the flour, cream of tartar, the remaining 1/4 teaspoon of cardamom, the baking soda and salt; beat on medium speed to form a dough that gathers together. Reduce the speed to low; add the currants and beat until just evenly distributed.",
    "Gently press the dough into the skillet in an even layer, trying to keep that bottom coating of spiced sugar in place. Sprinkle the remaining spiced sugar mixture evenly over the top. Bake (middle rack) for about 40 minutes; if it seems like it's browning too quickly, lay a large piece of aluminum foil over the top.",
    "Let cool in the pan (where it will continue to bake a little) for at least 15 minutes before cutting into wedges."
  ],
  "ingredients": [
    "0",
    "3/4 cup granulated sugar",
    "1/4 teaspoon ground cinnamon",
    "3/4 teaspoon ground cardamom",
    "8 tablespoons (1 stick) unsalted butter, at room temperature",
    "1/4 cup packed light brown sugar",
    "2 large eggs",
    "1/2 teaspoon vanilla extract",
    "1 1/2 cups flour",
    "1 teaspoon cream of tartar",
    "1/2 teaspoon baking soda",
    "1/4 teaspoon kosher salt",
    "1/4 cup plus 2 tablespoons (a scant 1/2 cup) dried currants"
  ],
  "__v": 1
}