{
  "hash": "db446db2566c51afe152d03f9876d31e3db71b29",
  "title": "Mapo Tofu",
  "image": "",
  "href": "http://www.eatingwell.com/recipe/279704/mapo-tofu/",
  "extension": "Chrome",
  "firstAdded": "2020-05-25T18:11:44.187000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Step 1",
    "Combine 5 tablespoons oil, chili bean paste, fermented black beans and chile flakes (or crushed red pepper) in a small bowl. Whisk cornstarch and water in another small bowl. Set both next to the stove.",
    "Step 2",
    "Heat the remaining 1 tablespoon oil in a large flat-bottom wok or cast-iron skillet over medium-high heat until it shimmers. Add beef and cook, breaking up with a wooden spoon, until it is cooked through and browned, 2 to 3 minutes. Transfer to a small bowl.",
    "Step 3",
    "Add the reserved chili bean paste mixture to the pan and cook until fragrant, being careful not to burn it, about 1 minute. Add water (or broth), soy sauce and scallions. Return the beef to the pan, then add tofu; bring to a simmer, gently tossing the tofu with the sauce, until heated through, about 2 minutes. Gradually add the cornstarch slurry, stirring, and cook until the sauce thickens, about 1 minute. Transfer to a serving bowl and sprinkle with ground Sichuan peppercorns."
  ],
  "ingredients": [
    "0",
    "6 tablespoons peanut or canola oil, divided",
    "2 tablespoons Pixian chili bean paste (doubanjiang; see Tips)",
    "2 teaspoons fermented black beans (douchi; see Tips), rinsed and coarsely chopped",
    "1 tablespoon Sichuan chile flakes (see Tips) or crushed red pepper",
    "2 tablespoons cornstarch",
    "2 tablespoons water",
    "2 ounces lean ground beef",
    "1 cup water or low-sodium chicken broth",
    "1 teaspoon reduced-sodium soy sauce",
    "1 bunch scallions, cut into 1-inch pieces",
    "14- to 16-ounce package silken tofu, drained and cut in 3/4-inch pieces",
    "1/4-1/2 teaspoon freshly ground Sichuan peppercorns (see Tips)"
  ],
  "__v": 1
}