{
  "hash": "4def564593d6f08c2349e849f6d2169443367754",
  "title": "Portobello Wellington",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2013/11/Portobello-Wellington-1046x800.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/portobello-wellington/",
  "extension": "Chrome",
  "firstAdded": "2015-05-01T12:26:10.763000",
  "users": [
    null
  ],
  "keywords": [
    "portobello",
    "mushrooms",
    "sheet",
    "vegan",
    "aussie",
    "bakery",
    "natural",
    "puff",
    "pastry",
    "sheets",
    "shiitake",
    "white",
    "button",
    "baby",
    "spinach",
    "shallots",
    "roughly",
    "garlic",
    "sprigs",
    "tarragon",
    "stemmed",
    "red",
    "potatoes",
    "pieces",
    "parsley",
    "carrots",
    "wine",
    "salt",
    "added",
    "stock",
    "butter",
    "date",
    "syrup",
    "vanilla",
    "black",
    "pepper",
    "olive",
    "oil"
  ],
  "directions": [
    "0",
    "Preheat oven to 400 degrees F.",
    "For the Red Wine Sauce: Combine ½ cup red wine and 1 cup vegetable stock in small saucepan. Simmer uncovered for 20 minutes. Stir in 1 tbsp date syrup and set aside. Reheat on low right before serving and drizzle over Wellington’s.",
    "For the Roasted Red Potatoes: Combine potatoes, olive oil, ¼ cup vegetable stock, fresh parsley and black pepper in a small Pyrex or roasting pan and toss to coat potatoes. Roast 40 minutes or until tender and golden brown. Add extra vegetable stock if needed and stir occasionally to prevent sticking/burning.",
    "For the Duxelles: Add spinach, shiitake, button mushrooms, shallots, garlic, and tarragon to a food processor and pulse until finely chopped. Add 2 tsp. Earth Balance Butter to a large sauté pan and set over medium heat. Add the mushroom mixture, ¼ cup vegetable stock and sauté for 10 minutes until most of the liquid has evaporated. Season with a pinch of black pepper and set aside to cool.",
    "For the Glazed Baby Carrots: Combine 1 tbsp date syrup, vanilla and ⅓ cup vegetable stock in small bowl, stir to combine. Melt 1 tsp. Earth Balance butter to a large sauté pan over medium heat. Add carrots and sauce; simmer on medium heat until carrots are cooked through about 20 minutes. Deglaze the pan with more vegetable stock if needed.",
    "For the Portobello Mushrooms: Gently scrap gills from Portobello mushrooms with a spoon. Place mushrooms on baking tray lined with parchment paper or non-stick baking mat. Bake in preheated oven for 10 minutes, set aside. Cut pastry sheet into 4 equal parts.Using a spoon, cover each mushroom with a layer of duxelles (make sure to fill the back cavity of the mushroom with the duxelles).",
    "Place a mushroom in center of each pastry sheet, cavity side up. Fold pastry around the mushrooms and enclose entirely, press down lightly with fingers to make sure it is sealed completely.Place mushrooms, with folded side down, on baking tray lined with parchment paper or non-stick baking mat. Bake mushrooms in oven until pastry is golden brown for 20-25 minutes."
  ],
  "ingredients": [
    "0",
    "4 Portobello mushrooms",
    "1 sheet vegan puff pastry (Aussie Bakery All Natural Puff Pastry Sheets)",
    "3½ ounce(s) of shiitake mushrooms",
    "1 cup(s) of white button mushrooms",
    "2 cup(s) of baby spinach",
    "3 small shallots, peeled and roughly chopped",
    "3 cloves garlic, peeled and roughly chopped",
    "2 sprigs fresh tarragon, stemmed",
    "6 red potatoes, cut into ½ inch pieces",
    "1 tbsp. of minced fresh parsley",
    "8 ounce(s) of baby carrots",
    "½ cup(s) of red wine",
    "1¾ cup(s) of no salt added vegetable stock",
    "3 tsp. of vegan butter",
    "2 tbsp. of date syrup",
    "¼ tsp. of pure vanilla extract",
    "2 pinch of freshly ground black pepper",
    "1 tsp. of olive oil"
  ],
  "__v": 1
}