{
  "hash": "6766f9a135098f33bff9e1572a13ef573853dec8",
  "title": "Dark Chocolate Buttercream",
  "image": "http://recipe-folder.com/img/recipe-images/070/494/1906413570.jpg",
  "href": "http://recipe-folder.com/recipe/5bcfd26ed5ab100785939b6f",
  "extension": "User Added",
  "firstAdded": "2018-10-24T02:01:18.271000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a bowl of stand mixer fitted with paddle attachment, or with a handheld mixer, beat the butter on medium speed until pale and fluffy, about 6 minutes. Sift together the confectioners' sugar and cocoa powder. Reduce to speed to low, and add the confectioners' sugar, cocoa powder, water, sour cream, vanilla, and salt and beat until incorporated, about 1 minute. Increase the speed to medium and beat for 2 more minutes.",
    "1",
    "Add the melted chocolate and beat on medium speed until smooth, about 1 minute.",
    "2",
    "Decorate the cupcakes:",
    "3",
    "Fit a large (I use 18\") pastry bag with a a plain large round tip. Fill the bag with the frosting, push out any excess air, and twist and secure the top of the bag. Do a test dollop of the frosting back into the bowl to check for consistency--if the frosting is too loose, pop the bag into the fridge for a few minutes (not more than a few, or it will firm up too much). Once the frosting has firmed up just slightly, pipe a generous swirl of frosting atop each cupcake and top with your favourite sprinkles.",
    "4",
    "Keep at room temperature for up to 3 days."
  ],
  "ingredients": [
    "0",
    "1 cup plus 2 tablespoons 255 g unsalted butter, softened",
    "1",
    "1 cup 125 g confectioners' sugar",
    "2",
    "1/3 cup 40 g premium dark cocoa powder (I used Guittard Noir)",
    "3",
    "1/4 cup 60 ml hot water",
    "4",
    "1/4 cup 60 ml sour cream OR plain Greek Yogurt",
    "5",
    "1 teaspoon pure vanilla extract I used Nielsen-Massey",
    "6",
    "Generous pinch of salt",
    "7",
    "5 ounces 150 g premium dark (but not extra dark) chocolate, chopped or chips, melted (I used Callebaut Callets)",
    "8",
    "Your favourite sprinkles I used the Jersey Shore Sprinkle Medley from my shop",
    "9",
    "You will also need:",
    "10",
    "1 large pastry bag disposable or reusable",
    "11",
    "Large plain round pastry tip I use Ateco #809"
  ],
  "__v": 1,
  "hidden": true
}