{
  "hash": "e33a662434b8e8a27ee59e3bf9b87b1fee260b43",
  "title": "SUMMER ROASTED CORN AND BOUNTIFUL VEGGIE SALAD",
  "image": "https://static1.squarespace.com/static/55351d7ee4b097f55547d973/t/57bcf95ce3df28e77a387269/1472002412826/?format=1500w",
  "href": "http://www.spiceandsprout.com/recipe-blog/2016/8/23/summer-roasted-corn-and-bountiful-veggie-salad",
  "extension": "Chrome",
  "firstAdded": "2016-09-27T16:49:27.900000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the barbecue. I turned mine up to the second highest heat and kept it around 550 - 600.",
    "While the barbecue is heating, shuck the corn and whisk together the marinade in a small bowl. Liberally coat each ear of corn with marinade using a pastry brush or baster. Place both the corn and the red bell peppers on the barbecue and cook for 20 minutes, turning every 5 minutes. You will know they are done when the corn is a golden brown in some places and a deep bright yellow, and the peppers are blackened on the outside.",
    "While the corn and peppers are cooking, put the quinoa on and prepare the veggies. Combine 1/2 cup quinoa with 1 1/2 cups water in a small pot. Bring to a boil and then reduce to a simmer and cook covered for 20 minutes. Slice the nectarines, cherry tomatoes, and cucumber, and place in a large salad or mixing bowl.",
    "When the corn and red peppers are done, remove them from the barbecue (and turn it off). Place the red peppers in a brown paper bag or cover with a kitchen towel for 10 minutes (this is called sweating the pepper and it makes the skin easier to peel off). Let the corn cool until it can be safely handled.",
    "While the corn and peppers are cooling, make the dressing. Place all ingredients in a small jar and shake vigorously to combine.",
    "Remove the peppers from the bag and slice open so you can lay them flat on a cutting board. Remove the seeds and peel the charred skin from the backs of the peppers. Slice into thin strips and add into the salad bowl. Slice the kernels off the corn by holding in upright and and slicing from the top down. Add to the bowl.",
    "Add the cooked quinoa and basil to the bowl of veggies, toss with dressing, and serve! This will last in the fridge for about 3 - 4 days. Enjoy!"
  ],
  "ingredients": [
    "0",
    "Corn Marinade",
    "Juice of 1 lime",
    "2 tbsp olive oil",
    "1 tsp cumin",
    "1/2 tsp salt",
    "pepper to taste",
    "Salad",
    "1/2 cup black quinoa + 1 1/2 cups water",
    "3 ears of corn, husked",
    "2 red bell peppers",
    "2 nectarines, sliced into small cubes",
    "16 heirloom cherry tomatoes, sliced lengthwise",
    "1/2 cucumber, sliced into small cubes",
    "handful of fresh basil, roughly chopped or ripped",
    "Dressing",
    "Juice of 2 limes",
    "2 tbsp olive oil",
    "1/2 tsp dijon mustard",
    "1/2 tsp maple syrup",
    "1/2 tsp salt",
    "1/8 tsp cumin",
    "pepper to taste"
  ],
  "__v": 1
}