{
  "hash": "85f94f869da7a148ffed377c622150ced515205b",
  "title": "French Tomato Tart",
  "image": "http://davidlebovitz.com.s3.amazonaws.com/wp-content/uploads/2010/05/tomato-tart-recipe-640x426.jpg",
  "href": "http://www.davidlebovitz.com/2010/05/french-tomato-tart-recipe/",
  "extension": "Chrome",
  "firstAdded": "2016-04-05T21:24:21.229000",
  "users": [
    null
  ],
  "keywords": [
    "tart",
    "filling",
    "unbaked",
    "dough",
    "recipe",
    "dijon",
    "wholegrain",
    "mustard",
    "tomatoes",
    "olive",
    "oil",
    "salt",
    "pepper",
    "generous",
    "herbs",
    "thyme",
    "chives",
    "chervil",
    "tarragon",
    "slightly",
    "aged",
    "goat",
    "cheese",
    "rounds",
    "flavorful",
    "honey",
    "flour",
    "unsalted",
    "butter",
    "chilled",
    "cubes",
    "egg",
    "cold",
    "water"
  ],
  "directions": [
    "0",
    "Make the dough by mixing the flour and salt in a bowl. Add the butter and use your hands, or a pastry blender, to break in the butter until the mixture has a crumbly, cornmeal-like texture.",
    "Mix the egg with 2 tablespoons of the water. Make a well in the center of the dry ingredients and add the beaten egg mixture, stirring the mixture until the dough holds together. If it’s not coming together easily, add the additional tablespoon of ice water.",
    "Gather the dough into a ball and roll the dough on a lightly floured surface, adding additional flour only as necessary to keep the dough from sticking to the counter.",
    "Once the dough is large enough so that it will cover the bottom of the pan and go up the sides, roll the dough around the rolling pin then unroll it over the tart pan. “Dock” the bottom of the pastry firmly with your fingertips a few times, pressing in to make indentations.",
    "If making a freestyle tart, simply transfer the dough to a prepared baking sheet (see headnote); no need to make indentations with your fingers.",
    "5. Preheat the oven to 425ºF (218ºC). See note.",
    "6. Spread an even layer of mustard over the bottom of the tart dough and let it sit a few minutes to dry out.",
    "7. Slice the tomatoes and arrange them over the mustard in a single, even layer. Drizzle the olive oil over the top.",
    "8. Sprinkle with some chopped fresh herbs, then arrange the slices of goat cheese on top. Add some more fresh herbs, then drizzle with some honey, if using.",
    "(If baking a free-form tart, gather the edges when you’re done, to envelope the filling.)",
    "9. Bake the tart for 30 minutes or so, until the dough is cooked, the tomatoes are tender, and the cheese on top is nicely browned. Depending on the heat of your oven, if the cheese doesn’t brown as much as you’d like it, you might want to pass it under the broiler until it’s just right.",
    "Note: Kate indeed does cook her tart in a very hot oven. You might wish to check the tart midway through baking and turn it down a bit in case the top is getting too dark, before the crust and tomatoes appear to be cooked."
  ],
  "ingredients": [
    "0",
    "Tart Filling",
    "One unbaked tart dough (see recipe, below)",
    "Dijon or whole-grain mustard",
    "2-3 large ripe tomatoes",
    "2 tablespoons olive oil",
    "salt and freshly ground pepper",
    "two generous tablespoons chopped fresh herbs, such as thyme, chives, chervil, or tarragon",
    "8 ounces (250 g) fresh or slightly aged goat cheese, sliced into rounds",
    "Optional: 1 1/2 tablespoons flavorful honey",
    "Tart Dough",
    "1 1/2 cups (210 g) flour",
    "4 1/2 ounces (125 g) unsalted butter, chilled, cut into cubes",
    "1/2 teaspoon salt",
    "1 large egg",
    "2-3 tablespoons cold water"
  ],
  "__v": 1
}