{
  "__v": 2,
  "directions": [
    "0",
    "Heat the oven to 170°C. Line cookie sheets with parchment.",
    "In the bowl of a stand mixer fitted with the paddle attachment, or in a large bowl using a hand mixer, add the butter. With the mixer running, slowly beat in the sugars a little at a time until light and fluffy. Beat in the vanilla.",
    "With the mixer running, beat in the egg until fully incorporated, then beat in the egg yolk. Beat in the salt and baking soda, scraping down the sides of the bowl to make sure everything is evenly incorporated.",
    "Slowly beat in the flour, mixing just to incorporate. Be careful not to overmix, or the cookies will toughen. Gently mix or fold in the chocolate chips by hand.",
    "Scoop about half-cup portions of the dough onto the parchment-lined cookie sheets. This should make about 10 cookies; you can make smaller ones if you prefer. Space the cookies evenly on the sheets (only 3 cookies will fit on each sheet if making the larger, quarter-pound cookies). Press the cookies slightly to flatten once they are on the sheet.",
    "Bake the cookies, 1 sheet at a time, until set and lightly golden, 20 to 22 minutes for the quarter-pound cookies; smaller cookies will bake in less time. Rotate the cookies halfway through baking for even colouring."
  ],
  "firstAdded": "2014-10-14T17:09:25.331000",
  "hash": "332fb44a7fd22e5817c9553578262718bc5a4b35",
  "href": "http://www.thestar.com.my/Lifestyle/Food/Recipes/2014/02/26/Oven-Spoonfuls-Chocolate-Chip-Cookies/",
  "image": "http://www.thestar.com.my/~/media/Images/TSOL/Photos-Upload/From DCX/2014/02/25/doc6e61vvjrgevzg1fyfow.ashx?w=620&h=413&crop=1&",
  "ingredients": [
    "0",
    "¾ cup butter, softened",
    "½ cup caster sugar",
    "1 cup light brown sugar",
    "1 tbsp vanilla extract",
    "1 egg plus 1 egg yolk",
    "½ tsp salt",
    "½ tsp baking soda",
    "2 heaping cups (333g) unbleached flour",
    "2 cups chocolate chips"
  ],
  "keywords": [
    "butter",
    "softened",
    "caster",
    "sugar",
    "light",
    "brown",
    "vanilla",
    "egg",
    "yolk",
    "salt",
    "baking",
    "soda",
    "heaping",
    "unbleached",
    "flour",
    "chocolate",
    "chips"
  ],
  "title": "Oven Spoonful’s Chocolate Chip Cookies",
  "users": [
    null
  ]
}