{
  "hash": "e31eb523fe2275711980e79c76b751682fd77c58",
  "title": "Jamie's Award-Winning Chili",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/jamie-deen/jamies-award-winning-chili-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-06-28T16:41:09.502000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Add the olive oil to a large Dutch oven over medium-high heat. Once hot, add the onions and peppers and saute until soft, about 4 minutes. Add the garlic and saute until just fragrant. Stir in the beef and sausage, breaking it up with the back of a wooden spoon, and cook until browned, about 6 minutes.",
    "Drain the beef mixture through a colander. Add it back to the Dutch oven and stir in the chili powder, cumin and oregano. Cook for about 2 minutes. Stir the tomato paste into the beef mixture; this will \"toast\" it and give the chili more flavor. Add the beer and stir up any browned bits on the bottom of the pan. Bring to a simmer, and then add the diced tomatoes and beans. Simmer on medium-low for 2 hours, stirring on occasion to keep the bottom from sticking.",
    "Top with shredded cheese, sour cream and chopped green onions before serving.",
    "From Food Network Kitchens; after further testing and to ensure the best results this recipe has been altered from what was in the actual episode.",
    "Recipe courtesy of Jamie Deen"
  ],
  "ingredients": [
    "0",
    "2 tablespoons olive oil",
    "1 large red onion, diced",
    "1 medium red bell pepper, diced",
    "1 medium yellow bell pepper, diced",
    "4 cloves garlic, chopped",
    "1 pound lean ground beef",
    "8 ounces Italian sausage, casing removed",
    "1/4 cup chili powder",
    "1 tablespoon ground cumin",
    "1 tablespoon dried oregano",
    "One 4-ounce can tomato paste",
    "One 12-ounce bottle beer",
    "One 28-ounce can diced tomatoes",
    "One 14-ounce can diced tomatoes",
    "One 15-ounce can black beans, drained and rinsed",
    "One 15-ounce can kidney beans, drained and rinsed",
    "One 15-ounce can pinto beans, drained and rinsed",
    "Shredded Cheddar",
    "Sour cream",
    "Chopped green onions"
  ],
  "__v": 1
}