{
  "hash": "d4b160c3341b6460162d5f2219c1b344f12005f5",
  "title": "Aunt Rocky’s Mushroom Chicken Sausage Soup with Garlic (LCHF)",
  "image": "http://tastykitchen.com/recipes/wp-content/uploads/sites/2/2017/02/Mushroom-Chick-Sausg-Soup-410x463.jpg",
  "href": "http://tastykitchen.com/recipes/soups/aunt-rockye28099s-mushroom-chicken-sausage-soup-with-garlic-lchf/",
  "extension": "Chrome",
  "firstAdded": "2017-03-21T16:52:21.687000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a wide-bottomed Dutch oven, melt 2 tablespoons of the butter. Add onions and cook over medium-low heat. Stir every couple of minutes, making sure the butter doesn’t burn.",
    "While onions are cooking, melt 1 tablespoon butter in a large skillet. Add sliced sausages and cook over medium heat until sausage slices are browned. Turn and cook a little more.",
    "Back in the soup pot, once onions are starting to brown, add the last tablespoon of butter and sliced mushrooms. Continue cooking and stirring every once in awhile until mushrooms have released their moisture and are browning.",
    "Add garlic and cook one more minute.",
    "Deglaze the pan with marsala wine (or any white wine), and a little of the chicken stock. Add remaining stock and all of the spices. Add the browned sausage and any pan drippings to the soup pot.",
    "Simmer for 30 minutes. Stir in the cream. Taste to see if you want to adjust spices. Serve.",
    "Leftovers may be frozen.",
    "Note: The sausage has enough salt in it to season this soup. No additional salt is needed.",
    "Nutritional information (estimates are per serving based on exact ingredients I used, calculated with a free online recipe analyzer): Calories 317, Total Fat 23 g, Saturated Fat 13 g, Sodium 863 mg, Potassium 661 mg, Total Carbohydrate 8 g, Dietary Fiber 1 g, Net Carbs 7 g, Sugars 2 g, Protein 17 g. Macros: 65% fat, 26% protein, 9% carbs.",
    "© February 28, 2017 Roxana Lopez for Aunt Rocky’s",
    "For more low carb/keto recipes and cooking tips, look for Aunt Rocky’s Low Carb Recipes Group on Facebook."
  ],
  "ingredients": [
    "0",
    "4 Tablespoons Butter, Divided",
    "3 ounces, fluid Yellow Onion, Sliced Thin",
    "4 pieces Bilinski's Wild Mushroom Chicken Sausage (4 Links)",
    "8 ounces, fluid Baby Bella Mushrooms, Sliced",
    "2 teaspoons Christopher Ranch Chopped Garlic (or 2 Bulbs, Pressed)",
    "1 Tablespoon Marsala Wine, Or White Wine (optional, Adds Flavor)",
    "32 ounces, fluid Kitchen Basics Original Chicken Stock",
    "1 Tablespoon Fresh Rosemary Leaves (about 2-3 Sprigs, Stripped)",
    "¼ teaspoons Ground Sage",
    "½ teaspoons Coarse Ground Pepper",
    "¾ cups Heavy Whipping Cream"
  ],
  "__v": 1
}