{
  "hash": "7b353ce35422b114a2939b0bc1ee291930f1bfbe",
  "title": "Easy Garlic and Lemon Shrimp",
  "image": "http://3.bp.blogspot.com/-2wrvrsMzbUQ/Ty1mOMqixmI/AAAAAAAAUjo/jdLzrKQ7ZNw/s1600/easy-garlic-lemon-shrimp-recipe-kalynskitchen.jpg",
  "href": "http://www.kalynskitchen.com/2012/02/recipe-for-easy-garlic-and-lemon-shrimp.html",
  "firstAdded": "2015-02-20T01:13:29.698000",
  "users": [
    null
  ],
  "keywords": [
    "jumbo",
    "frozen",
    "used",
    "size",
    "good",
    "recipe",
    "buy",
    "prepeeled",
    "shrimp",
    "peel",
    "thawed",
    "olive",
    "oil",
    "butter",
    "garlic",
    "freshsqueezed",
    "lemon",
    "juice",
    "youre",
    "fond",
    "zest",
    "use",
    "salt"
  ],
  "directions": [
    "0",
    "If using frozen shrimp thaw them over night in the refrigerator. Drain shrimp and pat dry.",
    "Zest one large lemon and then squeeze the juice, to yield at least 2 T juice and close to 1 T lemon zest. Finely mince garlic cloves to make 2 T minced garlic.",
    "Heat the oil over medium high heat and then melt the butter, using a large heavy pan. (I used a pan that was nice enough to serve the shrimp from, which helps keep them hot.) Add the shrimp in a single layer and cook just until they start to turn pink at the edges, not more than 1-2 minutes.",
    "Turn shrimp over quickly and add the minced garlic. Continue to cook until shrimp are barely firm, probably not more than 3-4 minutes more. (Don't overcook; the shrimp will continue to cook a little in the hot pan.) Turn off heat and add the lemon juice, lemon zest, and salt as desired and stir to coat shrimp. Serve immediately."
  ],
  "ingredients": [
    "0",
    "1 lb. jumbo shrimp, thawed if frozen (I used 21-25 per pound size, which was good for this recipe. Buy pre-peeled shrimp or peel them when they have thawed.)",
    "2 T olive oil",
    "1 T butter",
    "2 T finely minced garlic",
    "2 T fresh-squeezed lemon juice",
    "1 T lemon zest (or a little less if you're not that fond of lemon zest)",
    "sea salt to taste (I did not use much salt)"
  ],
  "__v": 1
}