{
  "__v": 3,
  "directions": [
    "0",
    "Preheat the oven to 350°F. Grease an 8 1/2 by 4 1/4 by 2 1/2-inch loaf pan. Line the bottom with parchment paper. Grease and flour the pan.",
    "Sift together 1 1/2 cups flour, baking powder, and salt into 1 bowl. In another bowl, whisk together the yogurt, 1 cup sugar, the eggs, lemon zest, vanilla and oil. Slowly whisk the dry ingredients into the wet ingredients. Mix the blueberries with the remaining tablespoon of flour, and fold them very gently into the batter. Pour the batter into the prepared pan and bake for about 50 (+) minutes, or until a cake tester placed in the center of the loaf comes out clean.",
    "Meanwhile, cook the 1/3 cup lemon juice and remaining 1 tablespoon sugar in a small pan until the sugar dissolves and the mixture is clear. Set aside.",
    "When the cake is done, allow it to cool in the pan for 10 minutes before flipping out onto a cooling rack. Carefully place on a baking rack over a sheet pan. While the cake is still warm, pour the lemon-sugar mixture over the cake and allow it to soak in (a pastry brush works great for this, as does using a toothpick to make tiny holes that draw the syrup in better). Cool."
  ],
  "firstAdded": "2014-11-16T01:30:13.759000",
  "hash": "e0b0e2caeb5278e79d48759fdddf15ff65148659",
  "href": "http://www.pepperplate.com/recipes/view.aspx?id=7143696",
  "image": "",
  "ingredients": [
    "0",
    "1 1/2 cups + 1 tablespoon all-purpose flour (if you’re skipping the fruit, you can also skip the last tablespoon of flour)",
    "2 teaspoons baking powder",
    "1/2 teaspoon kosher salt",
    "1 cup plain whole-milk yogurt",
    "1 cup plus 1 tablespoon sugar",
    "3 extra-large eggs",
    "2 teaspoons grated lemon zest (approximately 2 lemons)",
    "1/2 teaspoon pure vanilla extract",
    "1/2 cup vegetable oil",
    "1 1/2 cups blueberries, fresh or frozen, thawed and rinsed (miniature wild blueberries are great for this, and pose the least risk of sinking)",
    "1/3 cup freshly squeezed lemon juice"
  ],
  "keywords": [
    "allpurpose",
    "youre",
    "skipping",
    "fruit",
    "skip",
    "flour",
    "baking",
    "kosher",
    "salt",
    "plain",
    "wholemilk",
    "yogurt",
    "sugar",
    "extralarge",
    "eggs",
    "lemon",
    "zest",
    "lemons",
    "vanilla",
    "oil",
    "frozen",
    "thawed",
    "rinsed",
    "miniature",
    "wild",
    "blueberries",
    "great",
    "pose",
    "risk",
    "sinking",
    "squeezed",
    "juice"
  ],
  "title": "Lemon-Blueberry Yogurt Loaf",
  "users": [
    null
  ]
}