{
  "hash": "27958048514b39517f06e5aeb6415ad02bf447b7",
  "title": "Spinach and Feta Tart",
  "image": "http://farm4.static.flickr.com/3114/2435581615_ea8c0018ec_o.jpg",
  "href": "http://cookalmostanything.blogspot.com/2008/04/spinach-and-feta-tart.html",
  "extension": "Chrome",
  "firstAdded": "2016-04-05T21:02:29.508000",
  "users": [
    null
  ],
  "keywords": [
    "filophyllo",
    "pastry",
    "butter",
    "tart",
    "shell",
    "bunch",
    "spinach",
    "leaves",
    "picked",
    "washed",
    "red",
    "onion",
    "garlic",
    "eggs",
    "cream",
    "milk",
    "used",
    "dodoni",
    "feta",
    "parmesan"
  ],
  "directions": [
    "0",
    "Make the filling:",
    "Heat a little oil and a knob of butter in pan over a low heat and when the butter has melted add the onion. When the onion has softened but not coloured add the garlic. Continue to cook until the garlic has become translucent and then add the spinach.",
    "Keep stirring until the spinach has wilted and then remove the pan from the heat. Let it cool before proceeding.",
    "Make the tart base:",
    "I used about 8 sheets of filo to form this base. Butter the sheet and lightly sprinkle it with a little finely grated parmesan. Place the next sheet over it and repeat the process until all 8 sheets are used.",
    "Place the assembled sheets into the tart tin and mould it into shape.",
    "Assemble the Tart:",
    "Place the eggs, cream and milk into a bowl and lightly whisk until just amalgamated. Set aside.",
    "Place the cooled filling into a bowl and break in half of the feta - stir vigorously to ensure it is mixed through. Taste and then add your seasoning. I found that there was enough salt in the feta so I didn't need to add any extra but I did add a little freshly ground white pepper.",
    "Spoon this filling into the tart base and then crumble over with the rest of the feta. Keep the pieces of feta fairly random in size.",
    "Pour in the egg mixture and then finish with a light sprinkle of parmesan.",
    "Bake in a preheated 180°C/350°F oven for about 30 minutes or until golden and cooked through."
  ],
  "ingredients": [
    "0",
    "Filo/Phyllo pastry",
    "melted butter, for the tart shell",
    "1 bunch spinach, leaves picked, washed and dried",
    "1 red onion, sliced",
    "2 garlic cloves, finely sliced",
    "3 eggs",
    "½ cup cream",
    "½ cup milk",
    "200 grams Feta (I used Dodoni Feta)",
    "grated Parmesan"
  ],
  "__v": 1
}