{
  "hash": "161d43f9be57fe1f377bdc6a74cd234cc84a7fb3",
  "title": "Mazurek kajmakowy z bakaliami",
  "image": "http://kuchniaprzemka.blog.pl/files/2016/03/IMG_6912-225x300.jpg",
  "href": "http://kuchniaprzemka.blog.pl/2016/03/21/mazurek-kajmakowy-z-bakaliami/",
  "extension": "",
  "firstAdded": "2016-09-17T11:45:02.686000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Mąkę przesiewamy, dodajemy cukier, sól, cukier waniliowy oraz masło. Całość siekamy na drobną kruszonkę. Robimy kopczyk i wbijamy żółtka. Teraz zagarniamy nożem, aby mąka wchłonęła żółtka. Szybko zagniatamy ciasto. Owijamy w folię spożywczą i chłodzimy 1-2 godzin w lodówce.",
    "Po tym czasie wyjmujemy, dzielimy ciasto na 2 części, z każdej odkrawamy ¼. Większe części wałkujemy na wielkość formy (ja użyłem tortownicy, można użyć innego kształtu), wylepiamy dno, a z pozostałej części ciasta formujemy cienki wałek i wyklejamy okrąg wzdłuż boków formy oraz nakłuwamy widelcem dosyć gęsto ciasto, aby nie podniosło się w czasie pieczenia. Tak przygotowujemy dwie formy i wkładamy do piekarnika nagrzanego do 200-210 stopni Celsjusza z termoobiegiem i pieczemy około 20-25 minut do zrumienienia. Studzimy.",
    "Na wystudzone ciasto rozsmarowujemy konfiturę, na warstwę konfitury wykładamy warstwę kajmaku. Na koniec mazurek dekorujemy bakaliami. Tutaj efekt końcowy zależy od Waszej inwencji. Konfiguracji mamy wiele. Myślę, że to idealna zabawa dla Waszych pociech."
  ],
  "ingredients": [
    "0",
    "Składniki: (porcja na 2 okrągłe mazurki o średnicy 24-28cm każdy)",
    "300g mąki pszennej",
    "100g cukru kryształu",
    "200g masła",
    "8-10 żółtek (ilość zależy od wielkości jaj)",
    "Szczypta soli",
    "Cukier waniliowy lub ekstrakt waniliowy",
    "Słoiczek (200g) kwaśnej konfitury żurawinowej lub z białej porzeczki",
    "Puszka mleka skondensowanego lub gotowej masy kajmakowej",
    "Dowolne bakalie (orzechy włoskie, orzechy laskowe, rodzynki, migdały, żurawina suszona, morele suszone, skórka pomarańczowa kandyzowana)"
  ],
  "__v": 1
}