{
  "hash": "6acbaa918f2f4d457f3ec14e109dbebe7abee2f8",
  "title": "CHICKEN ALFREDO BAKED ZITI",
  "image": "http://www.gimmesomeoven.com/wp-content/uploads/2014/08/Chicken-Alfredo-Baked-Ziti-2.jpg",
  "href": "http://www.gimmesomeoven.com/chicken-alfredo-baked-ziti-recipe/",
  "firstAdded": "2015-01-03T19:19:43.929000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "baked",
    "ziti",
    "pasta",
    "shape",
    "breasts",
    "batch",
    "alfredo",
    "mozzarella",
    "cheese",
    "used",
    "low",
    "fat",
    "toppings",
    "parmesan",
    "parsley",
    "olive",
    "oil",
    "garlic",
    "flour",
    "broth",
    "lowfat",
    "milk",
    "freshlygrated",
    "salt",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "TO MAKE THE CHICKEN BAKED ZITI:",
    "Preheat oven to 375 degrees F.",
    "Cook the pasta al dente in a large stockpot of well-salted boiling according to package instructions. Drain. Return pasta to the stockpot and add chicken and alfredo sauce. Gently toss to combine until the pasta is evenly coated.",
    "Pour half of the pasta into a greased 11x7-inch or 9x13-inch baking dish. Sprinkle evenly with 1 cup of cheese. Layer the remaining half of the pasta evenly on top. Sprinkle evenly with the remaining 1/2 cup of cheese.",
    "Bake for 20-25 minutes until the cheese is melted and just barely starts to turn golden. Remove and serve immediately, sprinkled with additional toppings if desired.",
    "TO MAKE THE ALFREDO SAUCE:",
    "Heat olive oil in a large saute pan over medium-high heat. Add garlic and saute one minute, stirring occasionally, until fragrant. Sprinkle with flour, and stir to combine. Saute for an additional minute to cook the flour, stirring occasionally.",
    "Slowly add chicken broth, whisking to combine until smooth. Whisk in milk, and bring the mixture to a simmer. Let cook for an additional minute until thickened, then stir in Parmesan cheese, salt and pepper until the cheese melted. Remove from heat and set aside."
  ],
  "ingredients": [
    "0",
    "CHICKEN BAKED ZITI INGREDIENTS:",
    "12 ounces ziti (or any pasta shape)",
    "2 cups shredded, cooked chicken (about 2 small chicken breasts)",
    "1 batch alfredo sauce (see below)",
    "1 1/2 cups shredded mozzarella cheese (I used 2% low fat)",
    "(optional toppings: additional shredded Parmesan cheese, chopped fresh parsley)",
    "ALFREDO SAUCE INGREDIENTS:",
    "1 Tbsp. olive oil",
    "4 cloves garlic, minced",
    "3 Tbsp. flour",
    "1 cup chicken broth",
    "1 cup low-fat milk (I used 1%)",
    "3/4 cup freshly-grated Parmesan cheese",
    "1/2 tsp. salt",
    "1/4 tsp. black pepper"
  ],
  "__v": 1
}