{
  "hash": "4b0642763420a9e8ebccc5924b07934df9f62c53",
  "title": "Mediterranean Chickpea Bowls with Tahini Sauce",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2017/04/2017-05-10-BuddhaBowls-1.jpg",
  "href": "https://www.simplyrecipes.com/recipes/mediterranean_chickpea_bowls_with_tahini_sauce/",
  "extension": "",
  "firstAdded": "2018-01-28T02:33:25.478000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Make the tahini dressing: In a small bowl, whisk tahini with 2 tablespoons of the warm water, 1 tablespoon of the lemon juice, honey, minced garlic, parsley, salt, and pepper.",
    "Give the dressing a taste. Add salt if needed. If it needs more acid or tastes slightly bitter, add more lemon juice one teaspoon at a time. If the dressing is too thick, add more water a tablespoon at a time.",
    "Dressing can be made several days ahead and kept refrigerated. You may need to allow it to warm slightly at room temperature (or very briefly in the microwave) to loosen it up before using.",
    "2 Warm the chickpeas: Drain chickpeas and rinse well in a colander. Rub the chickpeas gently with a clean, lint-free towel to dry, or let them air dry for about 10 minutes. When dry, toss the chickpeas in a mixing bowl with the paprika, cumin, coriander, salt, pepper. Add 1/2 tablespoon of the olive oil and mix until well-coated.",
    "Warm a large skillet over medium-high heat until hot enough that a drop of water sizzles on contact. Add the remaining 1/2 tablespoon of olive oil and tilt the pan to evenly coat.",
    "Immediately add the chickpeas. Stir constantly until they are warmed through, 3 to 5 minute). Turn off heat, then add garlic and chili (if using), and mix well.",
    "Toss with fresh herbs just before serving. (The chickpeas are best if served while still warm, but are also good if you make them ahead and serve cold.)",
    "3 Assemble the bowls: Divide the spinach evenly between four bowls. Top each bowl with 1/2 cup of the brown rice, 1/2 cup warm chickpeas, a quarter of the tomatoes, a quarter of the cucumber, and a quarter of the red onion. Drizzle with tahini dressing, and top with fresh mint leaves."
  ],
  "ingredients": [
    "0",
    "1/4 cup tahini (at room temperature)",
    "1/4 cup warm water",
    "Juice 1/2 to 1 lemon (1 to 2 tablespoons)",
    "1 teaspoon honey, agave, or maple syrup",
    "1 clove garlic, finely minced",
    "1/4 cup finely minced parsley",
    "1/4 teaspoon salt",
    "1/4 teaspoon pepper",
    "1 16-ounce can chickpeas (or 2 cups homemade chickpeas)",
    "1/2 tablespoon paprika (either sweet or hot)",
    "1/2 tablespoon ground cumin",
    "1 teaspoon ground coriander",
    "1/4 teaspoon salt",
    "1/4 teaspoon pepper",
    "1 tablespoon olive oil, divided",
    "1 clove garlic, minced",
    "1 teaspoon finely minced fresh chili (optional)",
    "1/2 cup finely chopped fresh herbs (I like the combination of parsley, mint, and cilantro)",
    "6 cups baby spinach",
    "2 cups cooked brown rice",
    "1 pint cherry or grape tomatoes, halved",
    "1 English cucumber, diced",
    "1/4 red onion, finely diced (about 2 tablespoons)",
    "Fresh mint leaves"
  ],
  "__v": 1
}