{
  "hash": "5b76ddccb4e0f2521f0479c9ffa57c16c81a47f7",
  "title": "Jamie Oliver's prawn curry",
  "image": "http://goodtoknow.media.ipcdigital.co.uk/111/00000b3ac/890a_orh412w625/Jamie-Oliver-curry-recipe.jpg",
  "href": "http://www.goodtoknow.co.uk/recipes/535660/jamie-oliver-s-prawn-curry",
  "extension": "Chrome",
  "firstAdded": "2016-01-23T12:17:06.413000",
  "users": [
    null
  ],
  "keywords": [
    "oil",
    "brown",
    "mustard",
    "seeds",
    "fenugreek",
    "heaped",
    "coriander",
    "curry",
    "leaves",
    "onion",
    "red",
    "chilli",
    "ginger",
    "garlic",
    "tomato",
    "chunks",
    "monkfish",
    "tail",
    "raw",
    "king",
    "prawns",
    "tin",
    "coconut",
    "milk",
    "salt",
    "bunch",
    "picked",
    "basmati",
    "rice",
    "flaked",
    "almonds",
    "serve",
    "lime",
    "wedges",
    "mango",
    "chutney",
    "naan",
    "breads"
  ],
  "directions": [
    "0",
    "Method",
    "Cook the rice in a large pan of boiling salted water according to packet instructions. Drain in a colander and leave to steam dry.",
    "Make sure the stirrer attachment of the Phillips HomeCooker is in place in the pan, then set the temperature to 250°C. Once the pan has heated up, add the oil, all the spices and the curry leaves. Sit the Cutting tower alongside the HomeCooker with the slicer in place and switch it on. Run through the onion, chilli, ginger and garlic (if you don’t have a Cutting tower simply finely chop by hand) and set the timer for 5 minutes, so the onion turns golden.",
    "When the time’s up, add the tomato, monkfish and prawns and set the timer for 3 minutes, so the monkfish is cooked through. Add the coconut milk and a good pinch of salt and set the timer for a final 2 minutes.",
    "Turn the HomeCooker off. Divide the rice and curry between your bowls, sprinkle over the coriander leaves and some toasted flaked almonds and serve with lime wedges, mango chutney and warm naan breads.",
    "If you don't have a Phillips HomeCooker:",
    "Cook the rice in a large pan of boiling salted water according to packet instructions. Drain in a colander and leave to steam dry.",
    "Get a large pan or wok and add the oil, all the spices and the curry leaves. Finely chop the onion, chilli, ginger and garlic and cook until golden.",
    "Add the tomato, monkfish and prawns and fry until the monkfish is cooked through. Add the coconut milk and a good pinch of salt and simmer for a couple of minutes.",
    "Divide the rice and curry between your bowls, sprinkle over the coriander leaves and some toasted flaked almonds and serve with lime wedges, mango chutney and warm naan breads."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2tbsp vegetable oil",
    "1tbsp brown mustard seeds",
    "1tbsp fenugreek seeds",
    "1 heaped tsp ground coriander",
    "10-15 fresh curry leaves",
    "1 onion, peeled and cut in half",
    "1 fresh red chilli",
    "2½cm piece of fresh ginger, peeled",
    "2 cloves of garlic, peeled",
    "1 ripe tomato, cut into chunks",
    "400g piece of monkfish tail, cut into chunks",
    "12 raw peeled king prawns",
    "1 x 400g tin coconut milk",
    "sea salt",
    "1 small bunch of fresh coriander, leaves picked",
    "300g basmati rice",
    "toasted flaked almonds, to serve",
    "1 lime, cut into wedges, to serve",
    "mango chutney, to serve",
    "naan breads, to serve"
  ],
  "__v": 1
}