{
  "hash": "4af6623a4dbd521ee7230b48c1e02782d6586558",
  "title": "big sexy steaks with tarragon mushrooms",
  "image": "http://www.healthyseasonalrecipes.com/wp-content/uploads/2014/01/big-sexy-steaks-024txt.jpg",
  "href": "http://www.healthyseasonalrecipes.com/big-sexy-steaks-tarragon-mushrooms/",
  "extension": "Chrome",
  "firstAdded": "2017-02-14T12:11:38.231000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 425 degrees F.",
    "Heat canola oil in a medium heavy oven-proof skillet. Meanwhile, sprinkle steaks with kosher salt and pepper. When oil shimmers, add steaks, and cook until the bottom is deeply browned, about 5 minutes. Turn steaks over, insert remote oven-proof inta-read thermometer into the center of one steak (if using) and transfer the skillet to the oven. Roast until the steaks are 130 degrees F for medium-rare 8 to 11 minutes. Transfer steaks to a plate and tent with foil to keep warm.",
    "Place skillet over medium- high heat. Use caution the handle will be hot!! Add shallot and thyme to the skillet, and cook, stirring until the shallot is browned, about 30 seconds. Add vermouth and let simmer until almost reduced by one half. Stir the cornstarch into the broth and add to the skillet. Bring to a simmer, stirring. Cook until slightly thickened and reduced to about ½ cup. Remove from the heat.",
    "Meanwhile while steaks roast, heat olive oil in a large skillet over medium-high heat. Add scallion whites, mushrooms and salt, and cook, stirring occasionally until the mushrooms are browning and the juices evaporate, 6 to 8 minutes. Stir in scallion greens and tarragon and remove from the heat.",
    "Serve steaks with the vermouth sauce and mushrooms."
  ],
  "ingredients": [
    "0",
    "1 teaspoon canola oil",
    "2 1 ½ inch-thick filet mignon steaks, aka big sexy steaks, 12 to 14 ounces total",
    "½ teaspoons each kosher salt and freshly ground pepper",
    "1 large shallot, minced",
    "½ teaspoon chopped fresh thyme",
    "1/4 cup sweet vermouth",
    "3/4 cup reduced-sodium chicken or beef broth",
    "½ teaspoon corn starch",
    "2 teaspoons extra-virgin olive oil",
    "2 sliced scallions, white and green parts separated",
    "4 cups sliced mixed mushrooms, wild, shiitake and/or white",
    "¼ teaspoon salt",
    "½ teaspoons chopped fresh tarragon"
  ],
  "__v": 1
}