{
  "hash": "6fe18f6fd84ec8ee155a5a143e4ea3c001ea714b",
  "title": "Kevin Gillespie's Barbecue Chicken with Alabama White Barbecue Sauce",
  "image": "//images.food52.com/6Atsk9NCvCJqPXTNXgXvwB1Cxko=/753x502/132abb9c-398d-4962-8397-dd5f62e046ee--hero.jpg",
  "href": "https://food52.com/recipes/29178-kevin-gillespie-s-barbecue-chicken-with-alabama-white-barbecue-sauce",
  "extension": "Chrome",
  "firstAdded": "2016-03-20T14:30:16.527000",
  "users": [
    null
  ],
  "keywords": [
    "egg",
    "yolks",
    "apple",
    "cider",
    "vinegar",
    "water",
    "poultry",
    "seasoning",
    "make",
    "used",
    "marjoram",
    "oregano",
    "thyme",
    "rosemary",
    "nutmeg",
    "diamond",
    "crystal",
    "kosher",
    "salt",
    "grapeseed",
    "oil",
    "chicken",
    "legthigh",
    "quarters",
    "alabama",
    "white",
    "barbecue",
    "recipe",
    "follows",
    "lemon",
    "juice",
    "garlic",
    "cayenne",
    "pepper",
    "black"
  ],
  "directions": [
    "0",
    "In a food processor fitted with a metal blade, blend the egg yolks, vinegar, water, poultry seasoning, and salt until the yolks fluff a little, about 30 seconds. With the processor running, slowly drizzle in the oil; the mixture will blend, emulsify, and resemble mayonnaise. You will hear the sound change to a whop, whop; it should take about 1 minute. Spoon the marinade into a large zip-top bag, add the chicken pieces, and massage until the chicken is completely covered with the marinade. Zip the top closed, pressing out any air as you seal the bag. Set the bag in a bowl in the refrigerator overnight or for up to 24 hours.",
    "Pour 3/4 cup of the Alabama White Barbecue Sauce into a bowl to use for basting. Heat a grill for indirect medium-high heat. On a gas grill, just leave one side of the grill unlit. On a wood or charcoal grill, rake the coals to one side. Remove the chicken from the marinade and pat completely dry. Scrape the grill clean and coat with oil. Place the chicken, skin side down, over the unheated part of the grill and cover with an aluminum pan or tent with foil. After 10 minutes, flip the chicken pieces, moving them to a hotter part of the grill, but still over indirect heat. Cover again with the pan or foil. After 10 more minutes, baste the chicken with the sauce, flip so the skin side is down, and baste again. Cover with the pan or foil, cook for another 10 minutes, and then baste, flip, and cover one last time, for a total cooking time of 40 minutes, or until the chicken -- including the last round of basting -- reaches 165° F. Discard the basting sauce. Remove the chicken from the grill and rest, tented with foil or a foil pan, for 10 minutes. Serve with the remaining sauce on the side.",
    "1",
    "In a food processor fitted with a metal blade, combine the egg yolks, lemon juice, vinegar, salt, garlic powder, cayenne, and black pepper and process until the yolks fluff a little, about 30 seconds. With the processor running, slowly drizzle in the oil; the mixture will bend and emulsify but won't be as thick as the marinade used for the barbecue chicken. You will again hear the sound change to a whop, whop; it should take about a minute."
  ],
  "ingredients": [
    "0",
    "4 egg yolks",
    "1/4 cup apple cider vinegar",
    "1/4 cup water",
    "2 tablespoons poultry seasoning (or make your own -- we used 1 1/2 teaspoons each of dried marjoram, oregano, thyme, and rosemary, plus 1/4 teaspoon nutmeg)",
    "2 tablespoons Diamond Crystal kosher salt (or 3 1/2 teaspoons fine salt)",
    "1 cup grapeseed oil",
    "6 chicken leg/thigh quarters",
    "1 1/2 cups Alabama White Barbecue Sauce (recipe follows)",
    "1",
    "2 egg yolks",
    "1/4 cup lemon juice",
    "3 tablespoons apple cider vinegar",
    "2 teaspoons Diamond Crystal kosher salt (or 1 1/8 teaspoons fine salt)",
    "1/2 teaspoon garlic powder",
    "1/2 teaspoon cayenne pepper",
    "2 teaspoons ground black pepper",
    "1 cup grapeseed oil"
  ],
  "__v": 1
}