{
  "hash": "2775744c9baca4a2b44face2b0e701d7eab2362f",
  "title": "Spicy Chicken Laksa",
  "image": "",
  "href": "http://www.spoonforkbacon.com/2019/01/spicy-chicken-laksa/",
  "extension": "Chrome",
  "firstAdded": "2019-02-07T22:01:54.516000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "1. Place dried chilies, cashews and dried shrimp into a mixing bowl and top with boiling hot water until completely submerged. Allow mixture to steep for 15 minutes. Drain and transfer to a food processor.",
    "2. Place coriander, paprika, cumin, and turmeric into a small saute pan and toast over medium-low heat for 3 to 4 minutes or until lightly fragrant. Pour spices into food processor.",
    "3. Add remaining paste ingredients to the food processor and process until paste is smooth. Transfer paste to an airtight jar and refrigerate (paste should stay fresh for about 2 to 3 weeks).",
    "4. Pour oil into a pot and place over medium heat. Add baby corn and saute for 2 to 3 minutes. Add 1/4 cup laksa paste and toast for 3 to 4 minutes.",
    "5. Stir in stock, coconut milk, lime leaves (lightly crushing them in your hand first to release the oils), and zest (or juice and zest) and simmer for 15 to 20 minutes. Stir in soaked noodles and shredded chicken and continue to simmer for 4 to 5 minutes. Adjust seasonings.",
    "6. Ladle soup into bowls and top with loads of garnishes of choice. Serve."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "laksa paste:",
    "10 dried red chilies, stemmed",
    "8 raw cashews",
    "6 dried shrimp",
    "1 1/2 teaspoons ground coriander",
    "1 1/2 teaspoon sweet paprika",
    "1 teaspoon cumin",
    "1/2 teaspoon turmeric",
    "8 shallots, peeled and chopped",
    "4 garlic cloves",
    "3 inch piece lemongrass (white part only), chopped",
    "2 inch piece of galangal, peeled and chopped",
    "1 1/2 tablespoons shrimp paste",
    "1 tablespoon vegetable oil",
    "1 tablespoon vegetable oil",
    "1 (15 ounce) can baby corn, drained and chopped into 1 inch pieces",
    "1 1/2 cups unsalted chicken stock",
    "1 (15 ounce) can coconut milk",
    "2 kaffir lime leaves plus zest (or juice and zest of 2 regular limes)",
    "6 ounces dried rice stick noodles, soaked in hot water for 10 minutes and drained",
    "1 heaping cup cooked, shredded chicken",
    "salt and pepper to taste",
    "Optional garnishes:",
    "green onion",
    "cilantro leaves",
    "fried shallots",
    "bean sprouts",
    "lime wedges",
    "sliced jalapeno or serrano peppers"
  ],
  "__v": 1
}