{
  "hash": "3eb4a2a2f1eab375bac663e35811a3b4f8533cb1",
  "title": "Sacher Tafelspitz aspic with lamb's lettuce",
  "image": "//images.ichkoche.at/data/image/variations/496x384/1/sacher-tafelspitz-aspic-with-lambs-lettuce-img-2139.jpg",
  "href": "http://www.ichkoche.at/sacher-tafelspitz-aspic-with-lambs-lettuce-rezept-6458",
  "extension": "Chrome",
  "firstAdded": "2015-04-30T08:52:37.958000",
  "users": [
    null
  ],
  "keywords": [
    "gboiled",
    "round",
    "beef",
    "clsherry",
    "piecescarrots",
    "piecestumips",
    "piececeleriac",
    "tbspschives",
    "mlbeef",
    "stock",
    "sheetsgelatine",
    "oil",
    "pepper",
    "salt",
    "gfield",
    "salad",
    "pumpkin",
    "seed",
    "pesto",
    "chives"
  ],
  "directions": [
    "0",
    "Boil the stock in 200 ml water. Add the carrots, turnip and celeriac and cook until soft.Remove fromthe soup and allowto cool, then cut into strips about 3mm thick. Soak the gelatin in cold water, drain and add to the soup. Season the soup with sherry, salt and pepper. Remove from heat.",
    "Grease the tray with oil. Line the base with plastic wrap, smoothing it out with kitchen paper. Cut the boiled beef into slices about 2 mm thick (bread-cutting machine recommended). Dip each slice into the warm soup and line the tray with the meat, letting it hang about 6 cm over the edge of the tray. Add a little soup, and sprinkle chives over themeat. Place the vegetable strips lengthways over themeat and place more meat on top. Repeat three times. Pour in the rest of the soup, and fold in the overlapping pieces of meat. Cover with plastic wrap, pressing it down over the mass, and refrigerate for 3 hours. Mix all the marinade ingredients with a whisk and use it to marinate the salad. Once the aspic is set, turn it upside down on a tray, and remove the plastic wrap. Cut the aspic into slices. Serve on cooled plates and decoratewith themarinated salad.Dribble a fewdrops of pesto over the aspic, and sprinkle with chives."
  ],
  "ingredients": [
    "0",
    "600 gBoiled round of beef",
    "6 clSherry",
    "2 piecesCarrots",
    "2 piecesTumips",
    "1/4 pieceCeleriac",
    "4 tbspsChives",
    "600 mlBeef stock",
    "10 sheetsGelatine",
    "Oil",
    "Ground pepper",
    "Salt",
    "200 gField salad",
    "Pumpkin seed pesto",
    "Chives"
  ],
  "__v": 1
}