{
  "hash": "1f566e3e1147b0f4247d4fb1d61c3f22d13fccf5",
  "title": "Tropical Fruit Breakfast Smoothie.",
  "image": "http://www.halfbakedharvest.com/wp-content/uploads/2014/06/Tropical-Fruit-Breakfast-Smoothie.-1.jpg",
  "href": "http://www.halfbakedharvest.com/tropical-fruit-breakfast-smoothie/",
  "extension": "Chrome",
  "firstAdded": "2016-02-16T00:35:52.852000",
  "users": [
    null
  ],
  "keywords": [
    "frozen",
    "raspberries",
    "strawberries",
    "used",
    "medium",
    "banana",
    "raw",
    "coconut",
    "meat",
    "milk",
    "mango",
    "chunks",
    "pineapple",
    "juice",
    "vanilla",
    "bean",
    "seeds",
    "scraped",
    "cubed",
    "kiwi",
    "flax",
    "simple",
    "granola",
    "rolled",
    "oats",
    "sweetened",
    "almonds",
    "oil",
    "maple",
    "syrup",
    "instant",
    "espresso",
    "cinnamon",
    "salt",
    "honey"
  ],
  "directions": [
    "0",
    "Instructions",
    "!SmoothieIn a blender add the raspberries (or a mix of raspberries and strawberries), banana, coconut meat and coconut milk. Blend the mixture until smooth. Pour the smoothie into two glasses.Wash the blender out and add the mango chunks, 1 cup pineapple juice and vanilla bean seeds. Blend the mixture until smooth. If desired add more pineapple juice to thin the smoothie out. Pour the mango smoothie over the the raspberry smoothie and use a long spoon to mix them together just a little.If desired thread some pineapple cubes on wooden skewers and place in each drink. Add a kiwi slice to the rim. Sprinkle with flax and granola if using. Use a spoon or straw to drink/eat this!!Simple Coconut Granola (optional)Preheat oven to 325 degrees F. In a large bowl combine the oats, shredded coconut and almonds. Toss well. Melt the coconut oil in the microwave for 30 seconds, stir in the maple syrup. Place the mixture back in the microwave for another 30 seconds. Sprinkle the espresso powder over top and stir to dissolve. Add the cinnamon and salt. Stir in the vanilla. Pour the warm mixture over the dry oat mixture and stir to fully combine. I normally stir for a good 3 to 5 minutes.Spread the granola out on a parchment lined baking sheet with sides and drizzle with 2 tablespoons honey. Bake for 30 to 40 minutes stirring every 15 minutes so the granola will get evenly toasted. The last time you stir the granola, drizzle it with the remaining 2 tablespoons honey. Remove from the oven and let cool five minutes.After 5 minutes spray the bottom of a flat 1 cup measuring cup or a flat bottomed glass with cooking spray. Press the granola into the pan using the bottom of the measuring cup so that you have a flat slab of granola that looks like they could be cut into bars. Let the granola sit for one hour to cool and harden. After an hour break the granola up into clusters."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 cup frozen raspberries or strawberries (I used a mix)",
    "1 medium banana, fresh or frozen",
    "1/3 cup raw coconut meat, chopped (optional)",
    "1 cup coconut milk",
    "1 cup frozen mango chunks",
    "1 - 1 1/2 cups fresh pineapple juice",
    "1 vanilla bean, seeds scraped",
    "1/2 a pineapple, cubed (optional)",
    "1 kiwi, sliced (optional)",
    "1-2 tablespoons ground flax (optional)",
    "Simple Coconut Granola (optional)",
    "3 cups rolled oats",
    "1 cup shredded coconut (sweetened or unsweetened)",
    "1 cup raw whole almonds",
    "1/4 cup coconut oil",
    "3/4 cup pure maple syrup",
    "1 teaspoon instant espresso",
    "1 teaspoon ground cinnamon",
    "1/4 teaspoon salt",
    "1 teaspoon vanilla extract",
    "4 tablespoons honey"
  ],
  "__v": 1
}