{
  "hash": "cadbfaefc7e8a5f431ae5fa1b74ff06c71e943d4",
  "title": "Shrimp Skewers with Aji Verde",
  "image": "http://recipe-folder.com/img/recipe-images/039/605/1799847639.jpg",
  "href": "http://recipe-folder.com/recipe/5ed59e17ce7e4d08309a3757",
  "extension": "User Added",
  "firstAdded": "2020-06-02T00:32:23.141000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Step 1",
    "1",
    "For marinade: In a small food processor combine garlic, parsley, cilantro, olive oil, lime zest and juice, salt, and the pepper. Pulse until finely chopped.",
    "2",
    "Step 2",
    "3",
    "In a medium bowl toss shrimp in marinade. Chill, covered, 1 hour. (Meanwhile, if using wooden skewers, soak them in enough water to cover for 30 minutes.)",
    "4",
    "Step 3",
    "5",
    "Thread shrimp onto skewers. Grill, covered, over medium-high 4 to 5 minutes or until opaque, turning once. Top with additional chopped parsley and/or cilantro. Serve with lime wedges and Aji Verde. Serves 8.",
    "6",
    "Aji Verde",
    "7",
    "In a food processor combine 1 1/2 cups fresh cilantro leaves, 1 cup fresh flat-leaf parsley leaves, 3 fresh jalapeno peppers, stemmed and seeded, and 1 to 2 serrano peppers, stemmed and seeded. Process to a fine texture. Add 6 Tbsp. sour cream, 1/4 cup olive oil, and 1/2 tsp. salt; process until smooth. Let stand 30 minutes before serving. Makes 1 1/2 cups.",
    "8",
    "Nutrition Facts",
    "9",
    "Per Serving:",
    "10",
    "77 calories; 4 g total fat; 1 g saturated fat; 1 g polyunsaturated fat; 3 g monounsaturated fat; 79 mg cholesterol; 352 mg sodium. 164 mg potassium; 1 g carbohydrates; 0 g fiber; 0 g sugar; 10 g protein; 0 g trans fatty acid; 279 IU vitamin a; 7 mg vitamin c; 0 mg thiamin; 0 mg riboflavin; 0 mg niacin equivalents; 0 mg vitamin b6; 6 mcg folate; 0 mcg vitamin b12; 40 mg calcium; 0 mg iron;"
  ],
  "ingredients": [
    "0",
    "3 cloves garlic",
    "1",
    "¼ cup packed flat-leaf parsley (leaves and stems)",
    "2",
    "¼ cup packed fresh cilantro (leaves and stems)",
    "3",
    "2 tablespoons extra-virgin olive oil",
    "4",
    "1 large lime (1 tsp. zest, 2 Tbsp. juice)",
    "5",
    "1 teaspoon salt",
    "6",
    "½ teaspoon freshly ground black pepper",
    "7",
    "1 pound fresh extra-large jumbo shrimp in shells (16-20 per pound), peeled and deveined",
    "8",
    "Chopped fresh parsley and/or cilantro",
    "9",
    "Lime wedges",
    "10",
    "Aji Verde (see recipe below)"
  ],
  "__v": 1,
  "hidden": true
}