{
  "hash": "05d78d01631eaa1bcc077f5fc656da6e21373741",
  "title": "Pork and Noodle Stir-Fry",
  "image": "//food.fnr.sndimg.com/content/dam/images/food/fullset/2012/12/20/0/FNM_010113-Pork-and-Noodle-Stir-Fry-Recipe_s4x3.jpg.rend.hgtvcom.826.620.suffix/1371612092749.jpeg",
  "href": "https://www.foodnetwork.com/recipes/food-network-kitchen/pork-and-noodle-stir-fry-recipe-2043665",
  "extension": "",
  "firstAdded": "2019-01-02T00:53:08.969000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cook the noodles as the label directs, then drain and rinse under cold water. Meanwhile, toss the pork with 1/4 teaspoon salt, pepper to taste and 2 tablespoons cornstarch in a bowl. Whisk the chicken broth and the remaining 1 tablespoon cornstarch in another bowl.",
    "Heat a large nonstick skillet over high heat. Add 1 teaspoon vegetable oil, then add the pork and stir-fry until lightly browned, about 5 minutes; transfer to a bowl. Add the remaining 3 teaspoons vegetable oil to the pan, then add the scallion whites, ginger and garlic; reduce the heat to medium and cook, stirring occasionally, 2 minutes. Stir in the vegetables and 3 tablespoons water and cook, stirring occasionally, until the vegetables are crisp-tender, about 4 minutes. Add the broth mixture to the pan and bring to a boil; cook, stirring occasionally, until slightly thickened, about 5 minutes.",
    "Return the pork to the skillet along with the noodles, lime zest and 1/4 teaspoon salt and stir to heat through. Stir in the scallion greens. Divide among bowls and serve with lime wedges."
  ],
  "ingredients": [
    "0",
    "8 ounces rice noodles",
    "1 pork tenderloin (about 3/4 pound), cut into 1/4-inch-thick strips",
    "Kosher salt and freshly ground pepper",
    "3 tablespoons cornstarch",
    "2 cups fat-free low-sodium chicken broth",
    "4 teaspoons vegetable oil",
    "4 scallions, sliced (white and green parts separated)",
    "1 2-inch piece ginger, peeled and minced",
    "2 cloves garlic, minced",
    "3 cups precut stir-fry vegetables (about 9 ounces)",
    "Grated zest of 1 lime, plus wedges for serving"
  ],
  "__v": 1
}