{
  "hash": "5025f663835b6897066c5b16089cb746ed69c079",
  "title": "Smothered Pork Chops",
  "image": "http://www.cookscountry.com/recipes/Smothered-Pork-Chops/",
  "href": "http://www.cookscountry.com/recipes/Smothered-Pork-Chops/27732?Extcode=L3EN2AA00#518988dca8b2b1000000000e",
  "keywords": [
    "onion",
    "paprika",
    "salt",
    "pepper",
    "cayenne",
    "bonein",
    "bladecut",
    "pork",
    "chops",
    "oil",
    "unsalted",
    "butter",
    "onions",
    "garlic",
    "thyme",
    "beef",
    "broth",
    "bay",
    "leaf",
    "cornstarch",
    "cider",
    "vinegar"
  ],
  "directions": [
    "0",
    "Adjust oven rack to middle position and heat oven to 300 degrees. Combine onion powder, paprika, ½ teaspoon salt, ½ teaspoon pepper, and cayenne in small bowl. Pat chops dry with paper towels and rub with spice mixture.",
    "Heat oil in large skillet over medium-high heat until just smoking. Brown chops, 3 to 4 minutes per side, and transfer to plate. Melt butter in now-empty skillet over medium heat. Cook onions until browned, 8 to 10 minutes. Add garlic and thyme and cook until fragrant, about 30 seconds. Stir in ¾ cup broth and bay leaf, scraping up any browned bits, and bring to boil. Return chops and any accumulated juices to pan, cover, and transfer to oven. Cook until chops are completely tender, about 1½ hours.",
    "Transfer chops to platter and tent with foil. Discard bay leaf. Strain contents of skillet through fine mesh strainer into large liquid measuring cup; reserve onions. Let liquid settle, then skim fat. Return 1½ cups defatted pan juices to now-empty skillet and bring to boil. Reduce heat to medium and simmer until sauce is reduced to 1 cup, about 5 minutes.",
    "Whisk remaining broth and cornstarch in bowl until no lumps remain. Whisk cornstarch mixture into sauce and simmer until thickened, 1 to 2 minutes. Stir in reserved onions and vinegar. Season with salt and pepper. Serve."
  ],
  "ingredients": [
    "0",
    "1 teaspoon onion powder",
    "1/2 teaspoon paprika",
    "Salt and pepper",
    "1/4 teaspoon cayenne pepper",
    "4 bone-in blade-cut pork chops, about 1/2 inch thick",
    "1 1/2 tablespoons vegetable oil",
    "1 tablespoon unsalted butter",
    "2 onions, halved and sliced 1/4 inch thick",
    "2 garlic cloves, minced",
    "1/4 teaspoon dried thyme",
    "3/4 cup plus 1 tablespoon beef broth",
    "1 bay leaf",
    "1 teaspoon cornstarch",
    "1 teaspoon cider vinegar"
  ],
  "__v": 0
}