{
  "hash": "9bb056e86f6b5d0b51bbf3d7f62baf15cb14ea3f",
  "title": "Creamy Scalloped Potatoes",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2007/04/scalloped-potatoes-vertical.jpg",
  "href": "http://www.simplyrecipes.com/recipes/scalloped_potatoes/",
  "extension": "Chrome",
  "firstAdded": "2016-07-02T00:32:22.874000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Preheat oven to 350°F. Butter a large casserole dish with 1 1/2 Tbsp of butter. If you use a casserole dish that is about 9x13 (bigger than the one shown) you'll have more surface area, more of the potatoes will brown, and the cooking time will be faster.",
    "2 Layer the bottom of the casserole dish with a third of the potato slices. Sprinkle with salt and pepper. Layer on half of the sliced onions and 1/2 cup of the Swiss cheese. Layer on half of the bacon, and half of the parsley and chives. Sprinkle with a little Parmesan.",
    "Repeat by layering on a third of the potato slices, sprinkle again with salt and pepper. Layer on the remaining sliced onions, 1/2 cup of the Swiss cheese, the remaining bacon, parsley and chives. Sprinkle with a little Parmesan.",
    "Top the casserole with the remaining potato slices. Add the half and half. Dot the potatoes with the remaining 1 1/2 Tbsp of butter.",
    "3 Cover the casserole with aluminum foil and bake in the oven for one hour. After an hour, remove from the oven, remove the foil, sprinkle on the remaining Swiss and Parmesan cheese. Return to the oven for an additional 30-40 minutes. When done, the potatoes should be tender, but not mushy, and the liquid should be mostly absorbed.",
    "For a faster cooking time, you can parboil the sliced potatoes for 8 minutes first, patting them dry, before layering them in the casserole pan. In this case the total oven cooking time is about 35-45 minutes."
  ],
  "ingredients": [
    "0",
    "3 Tbsp butter",
    "2 lbs (about 4 medium sized) Russet potatoes, peeled, sliced 1/8-inch thick",
    "1 large yellow or white onion, thinly sliced",
    "2 Tbsp chopped fresh parsley",
    "1 Tbsp chopped fresh chives (optional)",
    "2 thick slices of bacon, cooked and chopped",
    "2 1/2 cups grated Swiss or Gruyere cheese (about 8 ounces)",
    "1/2 cup grated Parmesan cheese (about 2 ounces)",
    "2 1/2 cups to 3 cups of half-and-half (half milk, half cream)",
    "Salt and pepper"
  ],
  "__v": 1
}