{
  "hash": "90ca51ec906f00e61b4fad63bdb4f4a340d0e5b9",
  "title": "mediterranean chickpea salad",
  "image": "https://www.themediterraneandish.com/wp-content/uploads/2016/02/Mediterranean-Chickpea-Salad-with-Fried-Eggplant-11-150x150.jpg",
  "href": "https://www.themediterraneandish.com/mediterranean-chickpea-salad-with-zaatar-fried-eggplant/?utm_source=The+Mediterranean+Dish+Recipe+Updates&utm_campaign=d920d6b367-Grilled+Lamb+Leg+with+Mint+Pesto_COPY_01&utm_medium=email&utm_term=0_a5845beec1-d920d6b367-511166561",
  "extension": "Chrome",
  "firstAdded": "2020-02-27T01:02:22.995000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Prepare Eggplant (optional) Place the sliced eggplant on a large tray and sprinkle generously with salt. Let it sit for 30 minutes (the eggplant will “sweat out” its bitterness as it sits.) Now line another large tray or baking sheet with a paper bag topped with paper towel and place it near the stove.",
    "Cook Eggplant (optional). Pat the eggplant dry. Heat 4 to 5 tbsp extra virgin olive oil over medium/medium-high heat until shimmering but not smoking. Fry the eggplant in the oil in batches (do this carefully and do not crowd the skillet). When the eggplant slices turn golden brown on one side, turn over and fry on the other side. Remove the eggplant slices with a slotted spatula and arrange them on the paper towel-lined tray to drain and cool.",
    "Once cooled, assemble the eggplant on a serving dish. Sprinkle with 1 tbsp of Za’atar.",
    "Prepare chickpea salad. In a medium mixing bowl, combine the tomatoes, cucumbers, chickpeas, red onions, parsley and dill. Add the remaining Za’atar, and mix gently.",
    "Prepare the dressing. In a small bowl, whisk together the dressing. Drizzle 2 tbsp of the salad dressing over the fried eggplant; pour the remaining dressing over the chickpea salad and mix.",
    "Add the chickpea salad to the serving dish with the eggplant."
  ],
  "ingredients": [
    "0",
    "1 large eggplant, thinly sliced (no more than 1/4 inch in thickness)",
    "Salt",
    "oil for frying, preferably extra virgin olive oil",
    "1 cup cooked or canned chickpeas, drained",
    "3 tbsp Za’atar spice, divided",
    "3 Roma tomatoes, diced",
    "1/2 English cucumber, diced",
    "1 small red onion, sliced in 1/2 moons",
    "1 cup chopped parsley",
    "1 cup chopped dill"
  ],
  "__v": 1
}