{
  "hash": "8ed1879925a16f9337dcdec3d24af23aa73a8dcf",
  "title": "ARUGULA CAPRESE SALAD WITH KALE PESTO // Serves 6",
  "image": "https://static1.squarespace.com/static/55470460e4b0b5d7d7c67dad/557dc078e4b01a4242175316/557dc07ae4b01a4242178b51/1434306503766/KALE_PESTO_04.jpg?format=750w",
  "href": "https://www.sproutedkitchen.com/home/2013/6/26/arugula-caprese-salad-with-kale-pesto.html",
  "extension": "",
  "firstAdded": "2018-05-07T13:38:12.149000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the kale pesto, bring a large pot of salted water to a boil. Cut the tough stems from the kale and roughly chop the leaves. Blanch the kale leaves for about 30 seconds, transfer to a strainer and run cold water over them to stop the cooking. Once the kale is cool, squeeze out the excess moisture. This should yield about 1 1/2 cups blanched kale.",
    "In a food processor, combine the garlic, walnuts and pulse to chop. Add the kale, basil, parmesan, red pepper flakes, water, lemon juice, 1/2 tsp. each salt and pepper and pulse to combine. Turn the processor on and drizzle in the olive oil until you get the consistency you like. Thin with a bit more lemon juice and a splash of water for a more dressing-like consistency. Taste and adjust as needed.",
    "Slice the baby tomatoes and mozzarella balls in half and collect them in a large mixing bowl. Add a few spoonfuls of the kale pesto and toss gently to coat, adding desired amount of dressing. Toss in your arugula, add a pinch of flaky sea salt and serve.",
    "Make ahead tip: The tomatoes and mozzarella can be dressed hours in advance and kept covered in the fridge, I actually recommend that they marinate in the pesto for better flavor. Just leave the mix at room temperature for awhile so the pesto dressing will distribute easily. Add arugula just before serving."
  ],
  "ingredients": [
    "0",
    "1 small bunch Tuscan/lacinato kale",
    "2 cloves garlic",
    "1/2 cup lightly toasted walnuts",
    "handful fresh basil leaves",
    "1/3 cup fresh grated parmesan cheese",
    "pinch of red pepper flakes",
    "juice of one lemon",
    "3 Tbsp. water",
    "sea salt and pepper",
    "1/3 cup extra virgin olive oil",
    "3/4 lb. baby tomatoes",
    "8 oz. small mozzarella balls (bocconcini or pearline)",
    "3 cups baby arugula",
    "flaked sea salt, optional"
  ],
  "__v": 1
}