{
  "hash": "c1dae60061c39e00a8ce2ea95e30e477baf77968",
  "title": "White Chocolate Strawberry Cake",
  "image": "https://bakedbree.com/wp-content/uploads/2011/07/white-chocolate-strawberry-cake_20.jpg",
  "href": "https://bakedbree.com/white-chocolate-strawberry-cake",
  "extension": "Firefox",
  "firstAdded": "2019-07-15T00:01:53.688000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Sift together the cake flour, baking powder, baking soda, and salt. Set aside.",
    "Cream the butter and sugar until light and fluffy. Add the vanilla. Add the eggs one at a time, scraping after each egg goes in.",
    "Add the buttermilk. Slowly add the flour mixture, and stop the mixer as soon as the ingredients are incorporated. Pour the batter into 2 (9-inch) cake pans that have been greased (I use Bakers Joy) and for insurance, line the bottom of the pans with parchment. Bake in a 350 degree oven for 35 to 40 minutes. When a toothpick comes out clean, they are finished. Place the pans on a cooling rack for 10 minutes. Turn the cakes out and let them cool completely.",
    "To make the frosting, heat the cream in a small saucepan over medium heat, let the cream come to a gentle bubble. In another bowl, add the white chocolate chips and butter.",
    "Pour the cream over the white chocolate. Let the mixture sit for 5 minutes. Whisk until the mixture comes together and is smooth. Chill in the fridge until it comes to room temperature.",
    "Pour the cooled white chocolate into the bowl of a mixer, and beat until it becomes fluffy.",
    "Place one cake layer on a cake plate. I put a little dab of frosting on the plate and then put the cake on top of that, it acts like glue, and the cake does not move. Add a layer of white chocolate frosting. Top with sliced strawberries. Add the second cake layer. Use the remaining frosting for the top layer.",
    "Garnish with whole strawberries.",
    "Keep the cake in the refrigerator."
  ],
  "ingredients": [
    "0",
    "Yellow Cake:",
    "4 cups plus 2 Tablespoons cake flour",
    "2 teaspoons baking powder",
    "1 1/2 teaspoons baking soda",
    "1 teaspoon salt",
    "2 (1 cup) sticks room temperature butter",
    "2 cups sugar",
    "2 teaspoons vanilla",
    "4 room temperature eggs",
    "2 cups buttermilk",
    "White Chocolate Frosting:",
    "8 ounces white chocolate (I used chips, but you can also chop bars or squares)",
    "2 Tablespoons butter",
    "2/3 cup heavy cream",
    "strawberries"
  ],
  "__v": 1
}