{
  "hash": "badb925bb2dc70751b2a0722433e6738c58bf330",
  "title": "Curry Ramen with Crispy Baked Tofu",
  "image": "https://images.food52.com/QB5UrDHcIW0iMsYlNxnBfnXFO4Y=/753x502/304fe565-43fa-4b2a-8468-5cd8fd783e2d--curry-ramen-04.jpg",
  "href": "https://food52.com/recipes/71347-curry-ramen-with-crispy-baked-tofu",
  "extension": "Chrome",
  "firstAdded": "2018-10-27T19:30:45.033000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Press the tofu with several layers of paper towel to remove as much water as possible. Cut the tofu into ½-inch slabs and press with paper towels again. Alternatively, you can dice the tofu into 1-inch cubes.",
    "To prepare the marinade, first combine the soy sauce and coconut sugar in a small mixing bowl. Microwave in 15-second intervals, stirring in between, until the coconut sugar dissolves. This should take less than a minute. Add the lime juice and fresh ginger. Whisk to combine.",
    "Transfer the tofu to a shallow baking dish and pour in the marinade. Move the pieces around so each is completely coated. Cover and place in the fridge for at least an hours, flipping the pieces over and recovering with the marinade half way through.",
    "Preheat oven to 400 and line a baking sheet with parchment paper.",
    "Remove the tofu from the marinade and press with paper towels to remove excess marinade.",
    "In a medium bowl add 2 tbsp. vegetable or peanut oil. Add tofu to the bowl and toss gently to coat.",
    "Add panko, cornstarch and sesame seeds to tofu. Toss gently until coated and pour out onto your prepared baking sheet.",
    "Bake tofu for 30-40 minutes, turning half way through.",
    "Bring water to a boil over medium heat. Cook your noodles according to package directions. Two minutes before ramen is done, add bok choy , broccoli and corn to the water. Cook until vegetables are just done and broccoli and bok choy are bright green.",
    "Remove noodles and vegetables from heat. Add curry paste, coconut cream and soy sauce to taste. Add baked tofu just before serving."
  ],
  "ingredients": [
    "0",
    "Crispy Tofu",
    "14\tounces extra firm tofu",
    "1/4\tcup soy sauce",
    "1/4\tcup coconut sugar",
    "1\tsmall lime, juiced",
    "1/2\ttablespoon fresh ginger, grated",
    "2\ttablespoons vegetable or peanut oil",
    "1\ttablespoon panko",
    "1\ttablespoon cornstarch",
    "1\ttablespoon sesame seeds",
    "Ramen",
    "2\tpackets dried ramen or equivalent fresh ramen noodles",
    "1\tbaby bok choy, quartered lengthwise",
    "1\tgenerous handful broccoli, cut in small flourettes",
    "1/2\tcup frozen corn",
    "2\tteaspoons curry paste (more or less to your liking)",
    "4\ttablespoons coconut cream (more or less to your liking of creaminess to heat ratio)",
    "Soy sauce, to taste"
  ],
  "__v": 1
}