{
  "hash": "77c057addb561db846d4b78782d07859a6cde502",
  "title": "Brown Butter Pumpkin Oatmeal Cookies",
  "image": "https://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2016/09/brown-butter-pumpkin-oatmeal-cookies.jpg",
  "href": "https://sallysbakingaddiction.com/2016/09/19/brown-butter-pumpkin-oatmeal-cookies/",
  "extension": "Chrome",
  "firstAdded": "2018-09-15T22:29:20.941000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Important before you begin! If topping the cookies with the brown butter icing, you can brown the butter for both the cookies AND the icing together. Once it is all browned, set 2 liquid ounces (1/4 volume cup) aside for the glaze. You can use it in step 8. The rest (about 8 liquid ounces) is for the cookies, used in step 5.",
    "Brown the butter: Slice the butter up into pieces and place in a light-colored skillet. (Light colored helps you determine when the butter begins browning.) Melt the butter over medium heat, stirring occasionally. Once melted, the butter will begin to foam. Keep stirring occasionally. After 5-8 minutes, the butter will begin browning-- you'll notice lightly browned specks begin to form at the bottom of the pan and it will have a nutty aroma. See photo above for a visual. Once browned, remove from heat immediately and allow to cool for 5 minutes.",
    "Meanwhile, whisk the oats, flour, baking soda, salt, cinnamon, and pumpkin pie spice together in a medium bowl.",
    "Preheat oven to 350°F (177°C). Line two large baking sheets with parchment paper or silicone baking mats. (Always recommended for cookies.) Set aside.",
    "Pour the slightly cooled brown butter into a large bowl. Whisk in the granulated sugar and brown sugar until combined. Whisk in the egg yolk and vanilla extract until combined, then whisk in the blotted pumpkin (see note about blotting). Slowly mix the dry ingredients into the wet ingredients until combined. The cookie dough will be thick and sticky.",
    "Using a medium cookie scoop, scoop cookie dough into balls (about 2 heaping Tbsp of dough each) and place 3 inches apart on the cookie sheet. Slightly flatten the balls out-- see picture above-- as the cookies won't spread much unless you help out first!",
    "Bake for 14-15 minutes or until lightly browned and set on the edges. Remove from the oven and allow to cool for 10 minutes on the cookie sheet before icing.",
    "Make the icing: Whisk together the 1/4 cup of brown butter you reserved for the icing, along with the remaining icing ingredients until smooth. Dip the top of each cookie into the icing."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "1 cup (2 sticks; 230g) unsalted butter",
    "2 cups (170g) old-fashioned whole rolled oats",
    "1 and 2/3 (208g) cup all-purpose flour (spoon & leveled)",
    "1 teaspoon baking soda",
    "1/2 teaspoon salt",
    "1 and 1/2 teaspoons ground cinnamon",
    "1 and 1/2 teaspoons pumpkin pie spice1",
    "1 cup (200g) granulated sugar",
    "3/4 cup (150g) packed light or dark brown sugar",
    "1 egg yolk, at room temperature",
    "2 teaspoons pure vanilla extract",
    "1 cup (228g) pumpkin puree (see note - not pumpkin pie filling and not the whole can)2",
    "BROWN BUTTER GLAZE",
    "1/4 cup (60g) unsalted butter",
    "1 and 1/2 cups (180g) confectioners' sugar",
    "3 Tablespoons (45ml) milk",
    "1/4 teaspoon pure vanilla extract",
    "Directions:"
  ],
  "__v": 1
}