{
  "hash": "9d3d9718118315b6a2aa840e621a1b888f509914",
  "title": "Bundt Cake de Chocolate & Nueces",
  "image": "http://estaticos.fimagenes.com/imagenesred/11563347.jpg",
  "href": "http://cocina.facilisimo.com/blogs/general/bundt-cake-de-chocolate-nueces_1742306.html",
  "extension": "Chrome",
  "firstAdded": "2015-07-22T14:16:48.375000",
  "users": [
    null
  ],
  "keywords": [
    "gramos",
    "mantequilla",
    "aceite",
    "girasol",
    "azcar",
    "huevos",
    "medianos",
    "yogures",
    "blancos",
    "naturales",
    "tipo",
    "griegos",
    "harina",
    "repostera",
    "cucharadita",
    "bicarbonato",
    "sdico",
    "sal",
    "fina",
    "colma",
    "levadura",
    "polvo",
    "royal",
    "chocolate",
    "valor",
    "nueces"
  ],
  "directions": [
    "0",
    "Se enciende lo primero el horno para que esté caliente cuando metamos el bundt cake y lo graduamos a 180 grados.",
    "Cuando lo metamos en el horno se colocará el molde en una rejilla, nunca en bandeja de horno.",
    "Empezamos ya a preparar nuestro estupendo bundt cake de chocolate & nueces.",
    "En un bol grande mezclamos la mantequilla (temperatura ambiente), con el aceite de girasol y el azúcar. Tiene que quedar blanquecino y bien batido.",
    "Añadimos a continuación el primer huevo, batimos; añadimos el segundo huevo y mezclamos bien.",
    "En otro recipiente mezclamos la harina con la levadura en polvo, la sal fina, el chocolate en polvo y la cucharadita de bicarbonato sódico, cuando esté bien mezclado lo tamizamos en la primera preparación que hemos hecho de los huevos con la mantequilla y el aceite de girasol.",
    "La harina la echaremos alternándola con los yogures, es decir unas cucharadas de la mezcla de harina y un poco de yogur y así sucesivamente hasta terminar de incorporarlo todo.",
    "Se mezcla bien todo con una espátula y se enmanteca el molde con mantequilla líquida con ayuda de un pincel de tamaño medio o mejor aún se le echa un poco de spray especial de repostería que nos viene de perlas para estos menesteres. No hace falta echarle harina ya que estos moldes son muy antiadherentes.",
    "Se hornea a 180 grados durante 45 minutos (a los 40 minutos tenéis que echar un vistazo, ya que todos los hornos no son iguales).",
    "Pasado este tiempo se apaga el horno, se saca para que se enfríe encima de una rejilla y a los 10 minutos se desmolda, no más tiempo, pues se nos podría romper.",
    "Ya en el plato o bandeja se deja enfriar completamente."
  ],
  "ingredients": [
    "0",
    "50 gramos de Mantequilla",
    "30 ml. de Aceite de Girasol",
    "250 gramos de Azúcar",
    "2 Huevos medianos",
    "2 Yogures (blancos naturales o tipo griegos)",
    "270 gramos de Harina de Repostería",
    "1 cucharadita de Bicarbonato sódico",
    "1/2 cucharadita de Sal fina",
    "1 cucharadita colma de levadura en Polvo Royal",
    "30 gramos de Chocolate en polvo (Valor)",
    "120 gramos de Nueces"
  ],
  "__v": 1
}