{
  "hash": "291d79f0ae99a1e855436461666778526c18658d",
  "title": "Vegetarian Shepherd’s Pie",
  "image": "https://pinchofyum.com/wp-content/uploads/hands-holding-vegetarian-shepherds-pie.jpg",
  "href": "https://pinchofyum.com/vegetarian-shepherds-pie",
  "extension": "Firefox",
  "firstAdded": "2018-10-20T22:21:08.137000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the mashed potatoes: Peel the potatoes. Boil them until fork tender (you want them to mash easily). Drain, mash, and mix in yogurt and butter. Season to taste. (You can also use the Instant Pot method which is quick and easy! That’s what I do.)",
    "Make the veggies: In a large oven-safe pot, heat the oil over medium heat. Add shallots and sauté until fragrant. Add mushrooms, carrots, and whole herbs (you will pull the herbs out later). Sauté until carrots are softened.",
    "Make the gravy: Add tomato paste and flour to the pot and stir. Pour in the red wine (sizzzzle) and scrape all the browned bits off the bottom of the pan. Let the wine cook out for a minute or two. Slowly add the broth, stirring it in until a gravy starts to form. Season with salt. Simmer over low heat to get it thickened even further.",
    "Bake: Remove the herbs. Stir in the peas, spread the mashed potatoes on top (brush with butter to be extra awesome), and bake for 15 minutes at 350. I finished mine on the broil setting for a few minutes to get it nice and brown on top."
  ],
  "ingredients": [
    "0",
    "Vegetarian Shepherd’s Pie Filling:",
    "2 tablespoons olive oil",
    "3 shallots, minced (or some onions and garlic)",
    "16 ounces fresh mushrooms, sliced",
    "6 carrots, peeled and chopped (about 2 cups)",
    "fresh herbs to taste (I used a whole sprig of rosemary, thyme, and a bay leaf)",
    "2 tablespoons tomato paste",
    "2 tablespoons flour",
    "1/2 cup red wine",
    "1-2 cups veggie broth",
    "1 teaspoon salt (more or less to taste)",
    "2 cups frozen peas",
    "Mashed Potatoes:",
    "6 Yukon gold potatoes (about 2 pounds)",
    "1/2 cup full fat Greek yogurt",
    "1/4 cup butter or olive oil",
    "salt to taste"
  ],
  "__v": 1
}