{
  "__v": 1,
  "directions": [
    "0",
    "Per il Pesto di pomodori secchi, sciacquare sotto l'acqua corrente i pomodori e i capperi, poi sbollentarli per qualche minuto per ammorbidirli. Scolarli bene e farli asciugare e raffreddare su carta da cucina. Nel caso usiate i pomodori secchi sott'olio, non è necessario sbollentarli. Tostare per 3-4 minuti le mandorle in un padellino antiaderente, facendo attenzione a non farle bruciare, poi lasciarle raffreddare. Mettere tutti gli ingredienti del pesto in un mixer e tritare fino ad ottenere un composto ben amalgamato ma non troppo finemente. Il pesto che vi avanzerà, potrete conservarlo in frigorifero coperto d'olio per 10-15 giorni, oppure congelarlo negli appositi vasetti. Questo pesto si presta a diverse varianti. C'è chi aggiunge anche del pomodoro fresco, chi usa i pinoli, chi le noci, insomma, lasciatevi guidare anche dal vostro gusto personale!",
    "Cuocere i Capunti in acqua bollente salata per 5-7 minuti, scolare, tenendo da parte un mestolino d'acqua per la mantecatura. Versare la pasta in un tegame ampio riscaldato, unire il pesto, l'acqua tenuta da parte (q.b.) e mantecare. Servire subito, cospargendo a piacere con altro Parmigiano grattugiato (o Pecorino). Piatto stupendo...",
    "Buon appetito!"
  ],
  "firstAdded": "2014-10-09T19:36:31.917000",
  "hash": "7a4d0f78e912dd28f8cc3b3b46f320df8eb1233c",
  "href": "http://aleonlykitchen.blogspot.it/2012/12/capunti-al-pesto-di-pomodori-secchi.html",
  "image": "http://1.bp.blogspot.com/-BmVrTwNz54s/UMslz7PTnGI/AAAAAAAABSY/sPlT1mNlOi4/s640/Capunti6.jpg",
  "ingredients": [
    "0",
    "100 g di pomodori secchi al naturale (oppure un pò di meno di quelli secchi sott'olio,ben sgocciolati)40 g di mandorle",
    "30 di Parmigiano grattugiato (o Pecorino)",
    "80-100 ml di olio extravergine d'oliva",
    "qualche cappero sotto sale",
    "le foglioline di 2-3 rametti di timo (o origano)",
    "qualche foglia di basilico fresco",
    "sale q.b."
  ],
  "keywords": [
    "pomodori",
    "naturale",
    "oppure",
    "meno",
    "quelli",
    "secchi",
    "sottolioben",
    "sgocciolati",
    "mandorle",
    "parmigiano",
    "grattugiato",
    "pecorino",
    "olio",
    "extravergine",
    "doliva",
    "qualche",
    "cappero",
    "sotto",
    "sale",
    "foglioline",
    "rametti",
    "timo",
    "origano",
    "foglia",
    "basilico",
    "fresco"
  ],
  "title": "pesto di pomodori secchi",
  "users": [
    null
  ]
}