{
  "__v": 1,
  "directions": [
    "0",
    "Place bacon, ginger, garlic & lemongrass in a pot. Add stock and bring to a simmer. Simmer for 30 to 45 minutes.",
    "In a separate pot, bring water to a boil and cook ramen noodles according to directions. Drain and set aside.",
    "Remove bacon, lemongrass, and ginger. Reserve the bacon for later. Add in greens (unless using baby spinach), soy sauce, and vinegar. Taste and check for salt, then add salt and pepper to taste.",
    "Slice the bacon. Add sliced garlic cloves to a pan with the bacon, and fry both until crisp.",
    "Drop eggs one at a time into the stock. (if you crack them in a bowl first, it is less likely that you will accidentally get a shell in your soup.)",
    "Place ramen noodles (and baby spinach if using) in a bowl. Carefully remove the eggs before they are completely cooked (a slotted spoon works best). Ladle the hot broth over the eggs and noodles.",
    "Cover with Bacon, fried garlic, and scallions. Garnish with a squirt or two of hot sauce."
  ],
  "firstAdded": "2014-06-06T12:36:20.492000",
  "hash": "fe53d342bf56a7a35f01b3f98f164e5e15dcaaa2",
  "href": "http://food52.com/recipes/20680-bacon-egg-ramen",
  "image": "https://d2k9njawademcf.cloudfront.net/indeximages/31014/full/NOOD_Ramen.jpeg?1380098331",
  "ingredients": [
    "0",
    "1 quart homemade or low sodium chicken broth",
    "1 inch fresh ginger",
    "2 cloves garlic",
    "3 ounces smoky slab Bacon",
    "1 piece about 2\" from a stalk of lemongrass",
    "1 package of ramen noodles (toss the soup packet)",
    "2 tablespoons dark soy sauce",
    "1 tablespoon black vinegar",
    "2 eggs",
    "1 handful chopped scallions",
    "1 drop Srirachia or your favorite hot sauce",
    "2 more cloves of garlic",
    "1 handful julienned mustard greens, baby spinach leaves, or kale"
  ],
  "keywords": [
    "low",
    "sodium",
    "chicken",
    "broth",
    "ginger",
    "garlic",
    "smoky",
    "slab",
    "bacon",
    "stalk",
    "lemongrass",
    "ramen",
    "noodles",
    "toss",
    "soup",
    "dark",
    "soy",
    "black",
    "vinegar",
    "eggs",
    "scallions",
    "drop",
    "srirachia",
    "favorite",
    "hot",
    "julienned",
    "mustard",
    "greens",
    "baby",
    "spinach",
    "leaves",
    "kale"
  ],
  "title": "Bacon & Egg Ramen",
  "users": [
    null
  ]
}