{
  "hash": "fae790473cb70b73d8e679dc24891bb770502f86",
  "title": "Chicken and sweet corn soup",
  "image": "https://img.taste.com.au/mFCAaPnT/w720-h480-cfill-q80/taste/2016/11/chicken-and-sweet-corn-soup-3787-1.jpeg",
  "href": "https://www.taste.com.au/recipes/chicken-sweet-corn-soup/042e515d-321c-48eb-973b-05a820035e74",
  "extension": "Chrome",
  "firstAdded": "2018-10-31T06:24:25.926000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Step 1",
    "Place the consomme and chicken in a large saucepan and bring to the boil over high heat. Reduce heat to low and simmer for 5 minutes or until chicken is cooked through. Transfer chicken to a heatproof bowl. Set aside for 5 minutes to cool slightly. Finely shred.",
    "Step 2",
    "Add the soy sauce and ginger to the consomme mixture. Place the cornflour in a small bowl and gradually stir in the water until smooth and combined. Gradually stir the cornflour mixture into the consomme mixture. Cook, stirring occasionally, for 2 minutes or until consomme thickens slightly. Add the chicken, creamed corn, corn and ham and cook, stirring occasionally, for 2 minutes or until hot.",
    "Step 3",
    "Use a fork to whisk the egg whites in a small bowl. Gradually pour the egg whites into the soup, stirring constantly with a wooden spoon.",
    "Step 4",
    "Cook for 2 minutes or until white ribbons swirl though the soup. Remove from heat.",
    "Step 5",
    "Add the sesame oil and half the green shallot and stir to combine. Taste and season with salt and pepper. Ladle the soup among serving bowls and sprinkle with the remaining green shallot. Serve immediately."
  ],
  "ingredients": [
    "0",
    "1L (4 cups) chicken consomme",
    "2 (about 200g each) single chicken breast fillets",
    "1 tablespoon light soy sauce",
    "2 teaspoons finely grated fresh ginger",
    "1 tablespoon cornflour",
    "60ml (1/4 cup) water",
    "1 x 420g can creamed corn",
    "1 x 300g can corn kernels, rinsed, drained",
    "100g shaved ham, thinly sliced",
    "2 egg whites",
    "1 teaspoon sesame oil",
    "6 green shallots, ends trimmed, thinly sliced diagonally",
    "Salt & freshly ground black pepper"
  ],
  "__v": 1
}