{
  "hash": "85aee5c8d5e424dd8749816eb00dc27e7ed51b36",
  "title": "Italian Meatballs",
  "image": "http://lh6.ggpht.com/_OaYG005JPDs/SyVsB6GtifI/AAAAAAAAAh0/H1rTorKDd6E/s640/meatballs.jpg",
  "href": "http://www.budgetbytes.com/2009/12/italian-meatballs/",
  "extension": "Chrome",
  "firstAdded": "2016-02-12T15:19:24.992000",
  "users": [
    null
  ],
  "keywords": [
    "beef",
    "pkg",
    "mild",
    "italian",
    "sausage",
    "casings",
    "medium",
    "yellow",
    "onion",
    "garlic",
    "divided",
    "olive",
    "oil",
    "bread",
    "crumbs",
    "parmesan",
    "cheese",
    "parsley",
    "bunch",
    "eggs",
    "purpose",
    "flour"
  ],
  "directions": [
    "0",
    "Finely dice the onion and garlic. Cook them in a small skillet using 2 Tbsp of olive oil until they are soft and translucent.",
    "In a large bowl combine the ground beef, Italian sausage (remove from the casing), bread crumbs, parmesan cheese, beaten eggs, parsley and onion/garlic mixture (let cool slightly so they can be handled with your bare hands). Using your hands, mix and squish it all together until it is thoroughly combined. Your hands really are the only tool that will accomplish this effectively so if you don’t like touching raw meat, you better get yourself some gloves!",
    "Prepare your meatball making station by getting a small bowl and putting a ½ cup of flour in it. You will be dredging the meatballs in the flour before pan frying them. Also grab a large plate or platter to hold the flour dredged meatballs prior to frying. Using your hands (again) grab small amounts of meatball mix and roll into small balls (I made mine slightly smaller than a golf ball) and then roll them around in the flour until coated lightly. Place the floured meatballs on the plate and continue until you have used all of the meatball mix. You will probably need to rinse your hands every 10 meatballs or so because they get coated and sticky, making the rolling quite difficult.",
    "Preheat your oven to 350 degrees and get a large glass dish ready for baking. Put the remaining ¼ cup of olive oil in a large skillet and heat it over medium/high heat until it is very hot but not smoking (if you drop a little flour in it, it will sizzle A LOT when it’s ready). Working in batches (about 10 at a time), brown the meatballs on all sides (about 30 seconds to 1 minute on each side). The meatballs do not need to be cooked through because you will bake them as well. Basically, you are just adding texture, flavor and strength to the meatball by searing the outside.",
    "As you remove each batch of meatballs from the skillet, place them in the glass dish until they are all done pan frying. Place the glass dish full of meatballs in the oven and cook at 350 for about 25 minutes or until cooked through. If you made larger meatballs they will take longer to cook. If you are unsure about whether or not your meatballs are done cooking, simply sacrifice the largest one you can find and see if it is still pink inside."
  ],
  "ingredients": [
    "0",
    "1 lb. ground beef $3.48",
    "one (1.25 lb.) pkg mild italian sausage, casings removed $3.17",
    "½ medium yellow onion $0.12",
    "2 cloves fresh garlic $0.12",
    "6 Tbsp, divided olive oil $0.64",
    "½ cup bread crumbs $0.18",
    "⅓ cup grated parmesan cheese $0.31",
    "¼ cup chopped fresh parsley $0.77 (whole bunch)",
    "2 large eggs, beaten $0.31",
    "½ cup all purpose flour $0.27"
  ],
  "__v": 1
}