{
  "hash": "9ff1f2b8a2331614dfe9db45ad99797edd1c2ee6",
  "title": "Yotam Ottolenghi & Sami Tamimi's Basic Hummus",
  "image": "//images.food52.com/gWxVOpDubBO_jEpMincnk9vxIIg=/753x502/97f238b6-cd1f-4d5a-b498-b53e9026042c.9248254237_0089ba87ed_z.jpg",
  "href": "http://food52.com/recipes/22888-yotam-ottolenghi-sami-tamimi-s-basic-hummus",
  "extension": "Chrome",
  "firstAdded": "2015-06-22T06:09:27.699000",
  "users": [
    null
  ],
  "keywords": [
    "chickpeas",
    "baking",
    "soda",
    "water",
    "tahini",
    "light",
    "roast",
    "squeezed",
    "lemon",
    "juice",
    "garlic",
    "ice",
    "cold",
    "salt",
    "good",
    "quality",
    "olive",
    "oil",
    "serve"
  ],
  "directions": [
    "0",
    "The night before, put the chickpeas in a large bowl and cover them with cold water at least twice their volume. Leave to soak overnight.",
    "The next day, drain the chickpeas. Place a medium saucepan over high heat and add the drained chickpeas and baking soda. Cook for about three minutes, stirring constantly. Add the water and bring to a boil. Cook, skimming off any foam and any skins that float to the surface. The chickpeas will need to cook for 20 to 40 minutes, depending on the type and freshness, sometimes even longer. Once done, they should be very tender, breaking up easily when pressed between your thumb and finger, almost but not quite mushy.",
    "Drain the chickpeas. You should have roughly 3 2/3 cups now. Place the chickpeas in a food processor and process until you get a stiff paste. Then, with the machine sill running, add the tahini paste, lemon juice, garlic, and 1 1/2 teaspoons salt. Finally, slowly drizzle in the ice water and allow it to mix for about five minutes, until you get a very smooth and creamy paste.",
    "Transfer the hummus to a bowl, cover the surface with plastic wrap, and let it rest for at least 30 minutes. If not using straightaway, refrigerate until needed. Make sure to take it out of the fridge at least 30 minutes before serving. Optionally, to serve, top with a layer of good quality olive oil. This hummus will keep in the refrigerator for up to three days."
  ],
  "ingredients": [
    "0",
    "1 1/4 cups dried chickpeas",
    "1 teaspoon baking soda",
    "6 1/2 cups water",
    "1 cup plus 2 tablespoons tahini (light roast)",
    "4 tablespoons freshly squeezed lemon juice",
    "4 cloves garlic, crushed",
    "6 1/2 tablespoons ice cold water",
    "Salt",
    "Good quality olive oil, to serve (optional)"
  ],
  "__v": 1
}