{
  "hash": "c247269348389f55c139090ccd2d1a4a8799fbbb",
  "title": "Cauliflower Breadsticks",
  "image": "http://ifoodreal.com/wp-content/uploads/2014/03/FG-cauliflower-breadsticks-recipe.jpg",
  "href": "http://ifoodreal.com/cauliflower-breadsticks-recipe/",
  "extension": "Chrome",
  "firstAdded": "2017-01-02T18:01:47.599000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 375 degrees F. Rinse cauliflower, remove outer leaves and separate into florets with a paring knife. Place cauliflower florets in a food processor and process until \"rice\" texture. Some coarse chunks are fine.",
    "Place in an oven proof baking dish (I used Pyrex pie dish) and bake for 20 mins. Remove cooked cauliflower from the oven and transfer to a bowl lined with a tea/linen towel (I used glass tea towel from a Dollar store, similar to this one). Let the cauliflower cool down a bit until it is safe to touch, about 15 minutes.",
    "Fold the towel holding by the ends and squeeze the liquid out of the cauliflower \"ball\" as hard as you can. Be patient and do this a few times until barely any liquid comes out. I squeezed out 1 cup of liquid. Second photo, from right to left: before squeezing, after squeezing, liquid squeezed out.",
    "Increase oven T to 450 degrees F. Transfer cauliflower to a mixing bowl along with egg whites, 1/2 cup cheese, herb seasoning, black pepper, pinch of salt and mix to combine.",
    "Transfer cauliflower mixture onto the baking sheet lined with parchment paper. Flatten with your hands into a rectangle, approximately 9\" x 7\" size and 1/4\" thick.",
    "Bake for 18 minutes, remove from the oven and top with remaining 3/4 cup cheese. Bake for another 5 minutes and then broil until cheese turns golden brown. Cut into 12 breadsticks and serve hot with warm marinara sauce, if desired. P.S. For a lighter version, do not top with cheese."
  ],
  "ingredients": [
    "0",
    "1 head cauliflower, large (7\" - 8\" wide)",
    "1/4 cup egg whites",
    "1/2 cup + 3/4 cup (for topping) Mozzarella/Tex Mex cheese, shredded",
    "1 tsp Italian herb seasoning or any dried herbs like rosemary, basil, parsley",
    "1/4 tsp freshly ground black pepper",
    "Pinch of salt",
    "Marinara sauce or my mom's Ukrainian salsa, for dipping"
  ],
  "__v": 1
}