{
  "hash": "bffb49300639464ca9b31120b03a650d32dd4807",
  "title": "Gluten Free Focaccia Bread",
  "image": "http://freerangecookies.com/wp-content/uploads/2013/09/2-slices-gluten-free-focaccia-stacked-yum.jpg",
  "href": "http://freerangecookies.com/2013/09/05/gluten-free-focaccia-recipe/",
  "extension": "Chrome",
  "firstAdded": "2015-04-19T10:03:01.261000",
  "users": [
    null
  ],
  "keywords": [
    "water",
    "room",
    "olive",
    "oil",
    "eggs",
    "dry",
    "gluten",
    "free",
    "flour",
    "sugar",
    "instant",
    "yeast",
    "guar",
    "gum",
    "salt",
    "day",
    "rosemary"
  ],
  "directions": [
    "0",
    "In the bowl of a stand mixer combine: water, oil, and eggs. Mix well.",
    "In a separate bowl (or ziploc bag) combine: gluten free flour, sugar, yeast, guar gum, and salt. It's important to blend dry ingredients thoroughly before adding to liquid ingredients.",
    "Add (blended) dry ingredients to liquids in bowl. Mix on low speed, scrape bowl down, and blend more on medium speed until smooth and cohesive. Dough will have the consistency of a thick brownie batter and will be stickier than its gluten counterpart.",
    "After mixing thoroughly, cover dough and refrigerate overnight. It will rise in the fridge, so allow room for that. The next day, remove dough from fridge and let sit at room temp for 20-30 minutes. Dissolve 1/4 teaspoon instant yeast into a tablespoon of water and stir into dough.",
    "Preheat oven to 350°. For thick focaccia, line a 13\"x9\" cake pan with parchment paper. For thinner focaccia, line a 10\"x15\" cookie sheet with parchment.",
    "Spread dough onto parchment, using a dampened spatula. Smooth the top of dough, too. Drizzle a tablespoon or so of olive oil on top of dough and spread. Dimple top of dough with fingers. Sprinkle with sea salt and rosemary as you like. The exact amount of salt or herbs really depends on individual taste and how you intend to use the bread.",
    "A few minutes (10-15) in a warm room is all the bread needs before baking. Bake thick focaccia for about 30 minutes. Thin focaccia bakes for about 28 minutes. After removing from oven, let bread cool for a few minutes on pan, then transfer to a cooling rack. Important, because condensation will form and you DO NOT want a soggy bottom. Ahem.",
    "It's best to let bread cool completely before slicing, but that's easier said than done."
  ],
  "ingredients": [
    "0",
    "Liquid",
    "1 2/3 cups water, room temperature",
    "1/3 cup olive oil",
    "2 eggs",
    "Dry",
    "3 1/4 cups gluten free flour (about 1 lb)",
    "2 tablespoons sugar",
    "2 teaspoons instant yeast",
    "3.5 teaspoons guar gum",
    "1 teaspoon salt",
    "Next day",
    "1/4 teaspoon instant yeast",
    "Olive oil, sea salt, and rosemary for topping"
  ],
  "__v": 1
}