{
  "hash": "100f7a3dada28900f871eb6c0092f9efab7e4090",
  "title": "white bean and kale casserole",
  "image": "http://bistrokatie.com/wp-content/uploads/2011/02/kalewhitebeancass3_540.jpg",
  "href": "http://bistrokatie.com/2011/02/hearty-white-bean-and-kale-casserole/",
  "extension": "Chrome",
  "firstAdded": "2015-08-04T09:45:14.077000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "onion",
    "carrot",
    "celery",
    "rib",
    "garlic",
    "tomato",
    "dissolved",
    "broth",
    "water",
    "bean",
    "cooking",
    "combination",
    "thyme",
    "sprigs",
    "bay",
    "leaf",
    "herbes",
    "provence",
    "bunch",
    "kale",
    "white",
    "navy",
    "cannellini",
    "using",
    "canned",
    "beans",
    "salt",
    "pepper",
    "generous",
    "wheat",
    "bread",
    "crumbs"
  ],
  "directions": [
    "0",
    "Preheat the oven to 350 degrees. Meanwhile, heat 2 tablespoons of olive oil over medium heat in an oven-and-stovetop-safe casserole or, if you don’t have one, a heavy-bottomed pot. Add the onions, carrots and celery, and cook for about 5 minutes until the onions are soft and translucent. Add the garlic and cook for a minute more.",
    "Add the tomato paste solution, thyme sprigs, bay leaf and herbes de Provence and bring to a simmer. (If you want, you can pre-warm the tomato paste solution in a little pot while the onion mixture is cooking so it comes to a simmer faster.)",
    "Add the kale, stir, and let the kale cook down for a few minutes. Then add the beans, salt, and pepper. Bring the mixture to a simmer again.",
    "Turn off the heat. If you’re not using an oven-safe dish, very carefully transfer the mixture to a casserole dish (I used a 2 1/2 quart dish). In a separate bowl, toss the bread crumbs with the remaining 1 tablespoon of olive oil. Sprinkle the bread crumbs on top of the casserole and bake, uncovered, for about 30 minutes."
  ],
  "ingredients": [
    "0",
    "3 T olive oil",
    "1 small onion, chopped",
    "1 carrot, chopped small",
    "1 celery rib, chopped",
    "2 T minced garlic (about 3-4 cloves)",
    "6 T tomato paste, dissolved in 1 3/4 cup vegetable broth, water, bean cooking liquid, or a combination",
    "2-3 thyme sprigs",
    "1 bay leaf",
    "1 t herbes de Provence",
    "1 bunch kale, chopped (about 3 cups)",
    "4 1/2 c white beans, such as navy or cannellini, cooked and drained (if using canned beans, about 3 cans)",
    "1 t salt",
    "Freshly ground pepper – a generous amount",
    "1 c whole wheat bread crumbs"
  ],
  "__v": 1
}