{
  "hash": "8962e2ab8c390f39272807919e946084488f76da",
  "title": "thai coconut green curry salmon",
  "image": "http://www.thedefineddish.com/wp-content/uploads/2015/08/IMG_6848-1.jpg",
  "href": "http://www.thedefineddish.com/thai-coconut-green-curry-salmon/",
  "extension": "Chrome",
  "firstAdded": "2019-08-09T18:44:25.084000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 425 degrees F and line a baking sheet with parchment paper.",
    "Place salmon, skin side down, on the prepared baking sheet. Drizzle salmon with about 2 tbsp. of oil, rub across the top of the salmon so that it is coated evenly. Season generously with kosher salt and pepper.",
    "Before placing your salmon in the oven, make sure all of your other ingredients are chopped and are on hand ready to go.",
    "Place salmon in the oven, bake until salmon is cooked through, about 12 to 15 minutes.",
    "Meanwhile, while the salmon is baking: in a large skillet heat 2 tbsp. of oil over medium-high heat. When hot, add zucchini, red bell pepper, mushrooms, the bok choy, and the bulb (white and light green parts) of the green onion. Saute for about 4 minutes, or until veggies just begin to get tender.",
    "Now add in the green curry paste, garlic, and ginger, stir in, and saute for 1-2 minutes more.",
    "Turn heat down to medium-low. Add in the coconut milk, the fish sauce, the lime juice, and the rest of the green onion (save a few for garnish if you want). Cook with at a light simmer, where it is just barely bubbling (you may need to turn down to low depending on your stovetop), stirring occasionally, until the salmon is done cooking in the oven.",
    "Remove Salmon from the oven, and using a sturdy spatula, gently remove the salmon from the skin (optional, I just prefer to remove the skin-leave it on if you would like). Serve over green curry vegetables and top with freshly chopped basil and green onions. Enjoy!"
  ],
  "ingredients": [
    "0",
    "2 6-8oz. Portions of Salmon",
    "4 tbsp. of avocado oil",
    "Kosher salt",
    "Black pepper",
    "1 medium sized zucchini, cut in half lengthwise then sliced",
    "5 Baby Bella Mushrooms, stem removed and sliced (about 2 cups)",
    "1/2 red bell pepper, core and seeds removed and cut into 1/2 inch cubes",
    "1 head of baby bok choy, cut into fourths",
    "1 inch piece of Ginger, peeled and grated",
    "2-3 thai chiles sliced thinly (you can sub 1 tsp finely diced serrano)",
    "2 cloves of garlic, thinly sliced",
    "2 tbsp. Green Curry Paste (I like Mae Ploy Brand)",
    "1 tbsp. Red Boat Fish Sauce",
    "13.5 oz. can of Chaokoh Coconut Milk or Thai Kitchen Coconut Milk",
    "2 Tbsp. Fresh Squeezed Lime Juice",
    "1/4 cup freshly chopped thai basil (or regular basil)",
    "3 green onions, sliced and separate the top dark green slices from the bulb (whiter part) of the onion"
  ],
  "__v": 1
}