{
  "hash": "9a44bd52555f1f85ef3af438cb8e96882c1a7db8",
  "title": "Sesame Chicken",
  "image": "http://img.sndimg.com/food/image/upload/w_266/v1/img/recipes/44/32/1/picV13VSM.jpg",
  "href": "http://www.food.com/recipe/sesame-chicken-44321",
  "firstAdded": "2014-12-09T15:08:28.308000",
  "users": [
    null
  ],
  "keywords": [
    "boneless",
    "skinless",
    "chicken",
    "breast",
    "halves",
    "pat",
    "dry",
    "paper",
    "towels",
    "honey",
    "soy",
    "water",
    "cornstarch",
    "ginger",
    "better",
    "red",
    "pepper",
    "sesame",
    "seeds"
  ],
  "directions": [
    "0",
    "Cut chicken breast into 1 inch strips or bite size pieces.",
    "Heat a large non-stick skillet that has been sprayed with Pam, over medium-high heat.",
    "Cook chicken for about 6 minutes or until no longer pink.",
    "Mix together honey, soy sauce, water, corn starch, ginger and red pepper flakes.",
    "Whisk until no corn starch lumps appear.",
    "Pour sauce mixture into skillet with chicken.",
    "Cook until sauce thickens slightly.",
    "You can add more water if sauce is too thick.",
    "Sprinkle with sesame seeds.",
    "Cover and simmer for 10 minutes or until chicken starts to soak up the sauce.",
    "Note: Since originally posting this recipe, I have tried some of the suggestions others have made. I do like it with a bit of sesame oil (be careful not to get too much, just a few drops at the end of cooking is good enough for me, but you might like more), fresh ginger is also good if you have it on hand. I have tried it with garlic and it is good that way also. I have also found that it is good with shrimp and pork. Basically what I am trying to say is, the original recipe is just a simple, quick and healthy meal I came up with when I was craving Chinese food. I thought it turned out really great and wanted to share it. I'm happy that so many of you have enjoyed it. For those of you that didn't care for it, I hope you can find one that suits your fancy some where else."
  ],
  "ingredients": [
    "0",
    "6 boneless skinless chicken breast halves, pat dry with paper towels",
    "1/2 cup honey",
    "1/2 cup soy sauce",
    "1 cup water",
    "2 tablespoons cornstarch",
    "1/2-1 teaspoon ground ginger (fresh is better)",
    "1/2-1 teaspoon red pepper flakes (optional)",
    "1 tablespoon toasted sesame seeds"
  ],
  "__v": 1
}