{
  "hash": "deca9b84e1c23f3de58b1722fa52482c002fedd3",
  "title": "Crunchwrap Supreme\nBY LAUREN MIYASHIRO",
  "image": "http://del.h-cdn.co/assets/17/12/640x958/gallery-1490377433-delish-creme-crunchwrap-supreme-pint-3.jpg",
  "href": "http://www.delish.com/cooking/recipe-ideas/recipes/a52078/crunchwrap-supreme-recipe/?zoomable",
  "extension": "Chrome",
  "firstAdded": "2017-06-30T10:00:56.415000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "In a skillet over medium heat, add ground beef, chili powder, paprika and cumin. Cook, breaking the meat up with a wooden spoon, until the beef is no longer pink, about 5 minutes. Drain fat, then season with salt and pepper.",
    "Cut small flour tortillas: Stack four large flour tortillas and place a tostada shell in the center. Using a paring knife, trace around the edges of the shell to cut four smaller flour tortilla rounds. Set aside.",
    "Build crunchwraps: With remaining large flour tortillas, add a scoop of ground beef to the center of each tortilla, leaving a generous amount of space around the edges for folding. Drizzle cheese sauce over each, then place tostada shells on top. Spread sour cream over each shell, then top with lettuce, tomato, and cheeses.",
    "Place the smaller flour tortilla cutouts in the center of each crunchwrap then tightly fold the edges of the large tortilla towards the center, creating pleats. After wrapping, quickly invert crunchwraps so the pleats are on the bottom and they stay together.",
    "Cook crunchwraps: In a medium nonstick pan over medium heat, heat a very thin layer of vegetable oil. Working one at a time, add crunchwrap seam-side down and cook until tortilla is golden on the bottom, 3 to 5 minutes. Flip crunchwrap and cook until the other side is golden, 3 to 5 minutes more.",
    "Repeat with remaining crunchwraps and serve warm with hot sauce."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1 lb. ground beef",
    "1 tsp. chili powder",
    "1/2 tsp. ground paprika",
    "1/2 tsp. ground cumin",
    "kosher salt",
    "Freshly ground black pepper",
    "8 large flour tortillas",
    "1/2 c. Nacho Cheese Sauce",
    "4 tostada shells",
    "1 c. sour cream",
    "2 c. Shredded lettuce",
    "1 c. chopped tomatoes",
    "1 c. shredded Cheddar",
    "1 c. Shredded Monterey Jack",
    "vegetable oil",
    "Hot sauce, for serving"
  ],
  "__v": 1
}