{
  "hash": "6709709cc0ad035bdbe5f61eeb3b2491b1fe9d8e",
  "title": "WORLD’S BEST SPAGHETTI SAUCE",
  "image": "https://www.thebewitchinkitchen.com/wp-content/uploads/2014/03/favorite-spaghetti-recipe-250x350.jpg",
  "href": "https://www.thebewitchinkitchen.com/worlds-best-spaghetti-sauce/",
  "extension": "",
  "firstAdded": "2019-07-02T22:31:14.737000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "In a large pot, over medium heat, cook up your beef and hot italian sausage. When the meat is cooked, drain the meat and set aside (I leave it sitting in a colander over the sink).",
    "Heat up the olive oil and add the onion and green pepper. Saute until the onion is soft (about 4-5 minutes) and then add the garlic. Give it a good stir for another minute or two (until fragrant).",
    "Add the wine (doesn't matter what kind I have used Chardonnay, Pinot Grigio and even Moscato) and reduce for about two minutes.",
    "Next up is the crushed tomatoes, paste, jar of marinara, oregano, thyme, sugar, bay leaves, crushed pepper flakes, and salt. I usually stir this together and let simmer a few minutes.",
    "Add the meat. Stir and put a lid on.",
    "Let this simmer on low - medium/low for at least an hour. If you can get away for longer, do it.",
    "After your hour is up, add the parmesan cheese and parsley. Stir and simmer for another thirty minutes.",
    "Serve with desired pasta (or spaghetti squash) and top with more parmesan cheese."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1.5 lbs extra lean ground beef 2 lbs if not using hot italian sausage",
    "1 lb Hot Italian Sausage casings removed",
    "1 tbsp Olive Oil",
    "1 large onion diced",
    "1 green bell pepper diced",
    "4 cloves garlic minced",
    "1 cup white wine beef broth works too",
    "1 28oz can crushed tomatoes",
    "1/2 can tomato paste 4 oz can",
    "1 jar marinara sauce I like Safeway O Organics",
    "1 tsp oregano",
    "1 tsp thyme",
    "2 bay leaves",
    "1 tbsp sugar",
    "1 tsp sea salt",
    "1/2 - 1 tsp tsp crushed red pepper start small and increase the heat by taste",
    "2 tbsp dried parsley",
    "1/2 cup parmesan cheese"
  ],
  "__v": 1
}