{
  "hash": "e5ba77e63eb1918c3360bb9c9ebeb624ee291fcb",
  "title": "Bacon, Potato, and Egg Casserole",
  "image": "https://www.twopeasandtheirpod.com/wp-content/uploads/2015/12/Bacon-Potato-and-Egg-Casserole-3-220x220.jpg",
  "href": "https://www.twopeasandtheirpod.com/bacon-potato-and-egg-casserole/",
  "extension": "Chrome",
  "firstAdded": "2020-05-03T02:44:09.622000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Heat the oven to 350°F. Grease a 9x13 baking dish with nonstick cooking spray and set aside.",
    "In a large skillet, cook bacon over medium heat, stirring occasionally. Cook until it is a nice crispy brown. Remove bacon with a slotted spoon and place on a paper towel lined plate. Roughly chop the bacon and set aside.",
    "Add the onion and red pepper to the skillet and cook over medium heat until tender. Add the garlic and cook for 2 minutes. Set aside.",
    "In a large bowl, beat the eggs and whisk in the milk. Stir in the cooked vegetables, potatoes, and 1 cup of the shredded cheese. Set 3/4 cup of bacon aside and stir in the rest. Season with salt and pepper.",
    "Pour the mixture into the prepared baking dish and top remaining cheese and green onions. Bake for 20 minutes so the eggs start to set up. Carefully add the remaining bacon to the top of the casserole. Bake for an additional 20 minutes or until the eggs are firm and the top is slightly golden brown. Let stand for 10 minutes. Cut into squares and serve warm.",
    "Note: This casserole can be made in advance. Pour the mixture in the pan and refrigerate for up to 24 hours. Bake when ready to eat. You can also reheat the casserole."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 lb bacon, cut into 1/2-inch strips",
    "1 yellow onion diced",
    "1 red bell pepper seeds removed and diced",
    "3 cloves garlic minced",
    "12 large eggs",
    "1 cup milk",
    "3 cups frozen diced potatoes you don't have to thaw or cook the potatoes",
    "2 cups shredded cheddar cheese divided",
    "1 1/2 teaspoons salt",
    "1/2 teaspoon black pepper",
    "2 green onions chopped"
  ],
  "__v": 1
}