{
  "hash": "458db468f83a914ec32c35864a5127f0ea7e3b57",
  "title": "Crispy White Beans with Garlic and Herbs",
  "image": "http://recipe-folder.com/img/recipe-images/025/.25/2276246125.jpg",
  "href": "http://recipe-folder.com/recipe/5ed59eb6ce7e4d08309a3759",
  "extension": "User Added",
  "firstAdded": "2020-06-02T00:35:02.170000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Step 1",
    "1",
    "Preheat oven to 425°F. Spread beans on a tray lined with paper towels; pat dry.",
    "2",
    "Step 2",
    "3",
    "For garlic oil: In a small saucepan warm olive oil and garlic over medium-low 10 to 12 minutes or until simmering and aromatic and garlic starts to brown. Remove garlic with a slotted spoon; discard.",
    "4",
    "Step 3",
    "5",
    "In a medium bowl combine beans, rosemary, salt and pepper. Toss with garlic oil. Arrange beans in a single layer in a 15x10-inch baking pan. Roast 35 minutes or until browned and crisp, stirring once.",
    "6",
    "Step 4",
    "7",
    "Spread beans on a piece of foil. Sprinkle with oregano. Let cool completely before serving. Serves 10.",
    "8",
    "Nutrition Facts",
    "9",
    "Per Serving:",
    "10",
    "155 calories; 8 g total fat; 1 g saturated fat; 1 g polyunsaturated fat; 5 g monounsaturated fat; 0 mg cholesterol; 236 mg sodium. 286 mg potassium; 17 g carbohydrates; 4 g fiber; 0 g sugar; 6 g protein; 0 g trans fatty acid; 16 IU vitamin a; 1 mg vitamin c; 0 mg thiamin; 0 mg riboflavin; 0 mg niacin equivalents; 0 mg vitamin b6; 65 mcg folate; 0 mcg vitamin b12; 52 mg calcium; 1 mg iron;"
  ],
  "ingredients": [
    "0",
    "2 15 ounces cans cannellini or Great Northern beans, rinsed and drained",
    "1",
    "⅓ cup extra-virgin olive oil",
    "2",
    "3 large cloves garlic, smashed",
    "3",
    "1 tablespoon chopped fresh rosemary",
    "4",
    "1 teaspoon salt",
    "5",
    "½ teaspoon freshly ground black pepper",
    "6",
    "2 tablespoons fresh oregano leaves"
  ],
  "__v": 1,
  "hidden": true
}