{
  "hash": "71d91ec5df916ffe5a8693b4a1ec520056e61a94",
  "title": "Empanadas z wołowiną wg Michela Roux",
  "image": "http://wkuchni.usagi.pl/images/przepisy/pierogi/empanadas_wolowina_02.jpg",
  "href": "http://wkuchni.usagi.pl/tag/pierogi/208/Empanadas_z_wolowina_wg_Michela_Roux.html",
  "extension": "",
  "firstAdded": "2016-09-17T12:14:58.729000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Usypać wzgórek z mąki, zrobić w nim wgłębienie. Włożyć w nie masło, wsypać sól i cukier, wbić jajka i rozcierać palcami do uzyskania konsystencji zacierek. Wtedy zagnieść na gładkie ciasto stopniowo dodając wodę. Z ciasta uformować kulę, zawinąć ją w folię spożywczą i odłożyć do lodówki na około godzinę.",
    "W tym czasie na patelni rozgrzać połowę oleju, wrzucić mięso mielone i podsmażyć na średnim ogniu, aż zbrązowieje. Przełożyć do cedzaka i odsączyć z nadmiaru tłuszczu.",
    "Pozostały olej rozgrzać w płytkim rondlu, wrzucić cebulę oraz drobno pokrojone chili i dusić około 5 minut, następnie dodać czosnek i pomidory, oraz drobno posiekany seler naciowy. Gotować na małym ogniu przez 20 minut. Dodać mięso, czarnuszkę, bazylię i oregano, paprykę, wlać wywar, doprawić solą i pieprzem. Gotować na małym ogniu przez 30 minut. Na koniec dorzucić cheddar i serek wiejski, gotować jeszcze 2-3 minuty. Przełożyć do ostygnięcia.",
    "Wyjąć ciasto z lodówki i rozwałkować na grubość 1,5 -2 mm. Szklanką lub wykrawaczką wycinać kręgi o średnicy 9 cm, na każdym ułożyć czubatą (ok. 20 g) łyżkę nadzienia i posmarować brzegi białkiem. Złożyć ciasto tak, by powstały pierożki, dobrze skleić, a następnie uformować ozdobny brzeżek. Gotowe pierożki wstawić do lodówki na co najmniej 20 minut.",
    "Piekarnik nagrzać do temperatury 180°C. Empanadas ułożyć na blasze do pieczenia i piec przez 12-15 minut na złoto. Gotowe posypać usmażoną natka pietruszki. Podawać gorące."
  ],
  "ingredients": [
    "0",
    "Doskonałe empanadas w kruchym cieście samego Michela Roux. Bardzo aromatyczne za sprawą pomidorów, chili, czosnku i ziół, podbiją serce każdego, kto lubi meksykańskie, hiszpańskie oraz włoskie smaki.",
    "Ciasto jest świetne - doskonale się wyrabia, klei i wychodzi bardzo smaczne i chrupiące. Farsz natomiast wymaga trochę czasu, jak wszystkie farsze oparte o mięso mielone. Jeżeli planujesz te pierożki, proponuję, żeby farsz zrobić na początku i odstawić do ostygnięcia. Będzie dzięki temu zwarty i lepienie pierogów pójdzie szybciutko.",
    "Składniki na ciasto (ok. 15 pierożków):",
    "500 g mąki pszennej",
    "250 g masła pokrojonego w kostkę, lekko zmiękczonego",
    "2 jajka",
    "2 łyżeczki drobnego cukru",
    "1 łyżeczka drobnoziarnistej soli",
    "80 ml zimnej wody",
    "Składniki na farsz:",
    "450 g chudej wołowiny, zmielonej",
    "300 g cebuli, drobno posiekanej",
    "6 ząbków czosnku, drobno posiekanych",
    "300 g pomidorów, obranych ze skórki, bez gniazd nasiennych, grubo pokrojonych",
    "1-2 gałązki selera naciowego",
    "1 papryczka chili",
    "600 ml wywaru wołowego lub cielęcego (może być z kostki)",
    "300 g tartego sera cheddar lub cantal",
    "150 g serka wiejskiego",
    "1 łyżka drobnej soli",
    "1 łyżeczka świeżo zmielonego pieprzu",
    "1/2 łyżeczki zmielonej czarnuszki",
    "1 łyżeczka suszonego oregano",
    "1 łyżeczka suszonej bazylii",
    "1 łyżeczka słodkiej papryki",
    "150 ml oleju arachidowego",
    "2 białka, lekko ubite",
    "50 g natki pietruszki usmażonej w oleju arachidowym (niekoniecznie)"
  ],
  "__v": 1
}