{
  "hash": "2e53ec0b7a5565ecd92630c4fced31a611e7f41e",
  "title": "FOCACCIA",
  "image": "",
  "href": "http://lidiasitaly.com/recipes/focaccia/",
  "extension": "Chrome",
  "firstAdded": "2018-02-28T16:54:42.260000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "In a medium-size bowl, mix the yeast, warm water, and sugar, and allow it to stand 10 minutes, until foamy. In a large bowl, mix 5 cups of the flour and 1 ½ teaspoons of the salt, forming a well in the center. Pour the yeast mixture into the well, along with 2 tablespoons of the oil. Stir with a wooden spoon, gradually incorporating the ingredients to form a soft dough. Use floured hands to mix the dough when it becomes too stiff to work with a spoon.",
    "Dust a work surface with about ¼ cup of the remaining flour, turn the dough out onto it, and knead 10 minutes, adding flour if the dough gets sticky. (Alternatively, this step can be accomplished with the dough hook of an electric mixer.) When the dough is smooth and elastic, shape into a small ball and place it in a greased bowl, turning it once to bring the greased side up. Cover with a damp dish towel or plastic wrap, and allow it to rise until doubled in volume, about 30 minutes. Punch down the dough, cover, and allow it to rise as before.",
    "With your hands, spread and press the dough into a greased 11” X 15” jelly-roll pan, forcing up the edges to form a 1”-high wall. With your knuckles, press the surface of the dough all over, making a pattern of indentations. Cover and let rise for 5 minutes, while the oven preheats to 450 degrees.",
    "In a bowl, blend the remaining olive oil and salt, the onion, rosemary, and pepper. Press down the dough with your knuckles, exactly as before. Spread the onion mixture over the dough, leaving the edges bare, and brush the edges with whatever oil remains in the mixing bowl.",
    "Bake for 30-35 minutes. When golden, after approximately 20 minutes, cover with foil and continue baking 15 minutes longer. To serve, cut the focaccia into rectangles."
  ],
  "ingredients": [
    "0",
    "2 envelopes (1/2 ounce) active dry yeast",
    "2 cups warm water (105-115 degrees.)",
    "1 tablespoon sugar",
    "5 ½ cups flour",
    "1 tablespoon coarse or kosher salt",
    "3 tablespoons olive oil",
    "1 small onion, thinly sliced",
    "¾ teaspoon crumbled dried rosemary",
    "Freshly ground pepper to taste"
  ],
  "__v": 1
}