{
  "hash": "cae073cf230e56c3e0f80aa985dcf2a2539ebbce",
  "title": "Green Posole Recipe (Quick)",
  "image": "",
  "href": "http://epressurecooker.com/soup-recipes/green-posole-recipe-quick/",
  "firstAdded": "2015-01-13T04:45:46.852000",
  "users": [
    null
  ],
  "keywords": [
    "country",
    "style",
    "ribs",
    "butt",
    "pork",
    "shoulder",
    "mexican",
    "total",
    "hominy",
    "jar",
    "salsa",
    "verde",
    "chicken",
    "broth",
    "baking",
    "soda",
    "head",
    "garlic",
    "ham",
    "base",
    "tequila",
    "white",
    "wine",
    "cumin",
    "seed",
    "coriander",
    "coarsely",
    "pepper"
  ],
  "directions": [
    "0",
    "Pour the canned hominy into the colander. Rinse thoroughly with cold water.",
    "Dice the pork into ¾\" – 1\" cubes, removing excess fat. If you're using precooked/leftover meat, skip to Step 4 below.",
    "Optional: Pat the meat chunks dry with a paper towel. Sprinkle a few pinches of baking soda on the meat chunks. Preheat your skillet over high heat, add a thin coat of oil in the pan, and then brown the meat chunks. (You may want to do half the meat per batch to avoid overcrowding.) Sprinkle a few pinches of baking soda on the meat chunks to help them brown.",
    "For a thicker stew-like posole, add 1 cup of broth to the pressure cooker pot, for a more soup like consistency, add the whole can of chicken broth. Add 1 tablespoon of Chicken Base or Pork / Ham Base, 2 tablespoons of tequila, a head of garlic cloves (peeled), the hominy, the meat and the salsa verde.",
    "Lock the pressure cooker lid. Pressure cook for 10 MINUTES at HIGH PRESSURE (10 PSI) using QUICK PRESSURE RELEASE. (If you are using pork loin or chops, chicken, turkey, leftover or frozen meat, see the alternate cooking times above). When the timer beeps, turn off the machine and allow it to depressurize naturally. When the lock is released, remove the lid and give the posole a quick stir.",
    "(If you have freshly ground your cumin, add half then taste before adding the rest.) Add 1 teaspoon of dried ground cumin and coriander and ½ teaspoon of coarsely ground pepper. Stir.",
    "Taste the posole and add salt as needed. Ladle into your bowls.",
    "Garnish with your choice of avocado, lime, finely shredded cabbage, sweet onions, green onions, pickled red onions or jalapeno slices, Mexican cheese, cilantro and radish slices."
  ],
  "ingredients": [
    "0",
    "1 ½ pounds of country style ribs / pork butt / pork shoulder",
    "2 – 28 oz. cans of Mexican style hominy (total of 6 cups cooked hominy)",
    "1 16 oz. jar Salsa Verde (or 2 – 7 oz. cans)",
    "1 – 15 oz. can of chicken broth",
    "½ teaspoon baking soda",
    "1 head of garlic",
    "1 tablespoon Chicken Base or Pork / Ham Base",
    "2 tablespoons tequila or white wine (optional)",
    "1 teaspoon dried ground cumin ( or ½ – 1 tsp. whole cumin seed, freshly ground)",
    "1 teaspoon dried ground coriander",
    "½ teaspoon coarsely ground pepper"
  ],
  "__v": 1
}