{
  "hash": "3ac115cc33acc8fdbad67187db055bb6a9ad0276",
  "title": "Chicken Milanese with Corn & Tomato Summer Salad",
  "image": "http://p-fst1.pixstatic.com/510c08cdd9127e789200085c._w.540_h.604_s.fit_.jpg",
  "href": "http://www.thekitchn.com/recipe-chicken-milanese-with-s-94775",
  "extension": "Chrome",
  "firstAdded": "2015-07-07T14:33:50.024000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "milanese",
    "corn",
    "tomato",
    "summer",
    "salad",
    "serves",
    "fingerling",
    "potatoes",
    "ear",
    "unshucked",
    "cherry",
    "tomatoes",
    "lengthwise",
    "hearts",
    "palm",
    "baby",
    "lettuce",
    "arugula",
    "washed",
    "basil",
    "leaves",
    "roughly",
    "vinaigrette",
    "lemon",
    "juiced",
    "red",
    "wine",
    "vinegar",
    "dijon",
    "mustard",
    "olive",
    "oil",
    "salt",
    "black",
    "pepper",
    "ricotta",
    "salata",
    "skinless",
    "boneless",
    "breast",
    "halves",
    "eggs",
    "bread",
    "crumbs"
  ],
  "directions": [
    "0",
    "Bring a small pot of salted water to boil. Ready a bowl of ice water to the side. Add the unpeeled fingerling potatoes to the pot and cook for 8 to 10 minutes, or until one can be sliced in half easily. Remove the potatoes from the pot with a slotted spoon and put in the ice bath for 5 minutes or until cool enough to handle. Remove, pat dry, and slice into 1/4-inch rounds.",
    "Cook the ear of corn, in its husk, in the microwave on HIGH for 3 minutes. Remove, allow to cool for 5 to 10 minutes, then shuck. Cut the kernels off the cob. Toss the kernels with the sliced potatoes, sliced tomatoes, hearts of palm, lettuce, and basil (if using).",
    "Make the vinaigrette. Combine the lemon juice, vinegar, and mustard in a bowl and whisk to combine. Season with salt and pepper. Slowly stream in the olive oil while whisking vigorously.",
    "Set aside the salad and vinaigrette until the chicken is cooked.",
    "If desired, cut each chicken breast in half, to form two 4-ounce portions. Pound each chicken breast until it is of a roughly even thickness, about 1/4-inch to 1/2-inch thick.",
    "Pour the beaten eggs into a shallow pie plate. Pile the breadcrumbs onto a plate or in another pie plate and season with salt and pepper, mixing in the seasoning with your fingers.",
    "Heat the oil in a very large (14-inch) skillet over high heat. Working with one chicken breast at a time, dip it into the eggs, then allow the excess to drip off. Place it in the breadcrumbs and coat on both sides, then gently lay the chicken breast into the pan. Repeat with remaining chicken breasts. Cook the chicken for about 4 minutes on each side, flipping carefully with tongs, until the breadcrumbs are a deep golden color and crispy. Remove the chicken from the pan, set on a plate, and squeeze the lemon juice over them.",
    "To serve, toss the salad with the vinaigrette. Place one chicken breast (or two smaller portions) on each plate and top with the salad. Crumble the ricotta salata on top of each salad and season with salt and pepper."
  ],
  "ingredients": [
    "0",
    "Chicken Milanese with Corn & Tomato Summer Salad",
    "Serves four",
    "For the salad:",
    "5 to 6 fingerling potatoes, about 1/3 pound",
    "1 ear fresh corn, unshucked",
    "1 pint cherry tomatoes, halved lengthwise",
    "3/4 cup hearts of palm, sliced",
    "2 large handfuls baby lettuce or arugula, washed and dried",
    "Handful fresh basil leaves, roughly chopped (optional)",
    "For the vinaigrette:",
    "1/2 lemon, juiced, about 1 1/2 tablespoons",
    "2 tablespoons red wine vinegar",
    "1 teaspoon dijon mustard",
    "1/2 cup olive oil",
    "Salt and freshly ground black pepper pepper",
    "2 ounces ricotta salata",
    "For the chicken:",
    "4 skinless, boneless chicken breast halves, about 1 3/4 pounds",
    "2 large eggs, beaten",
    "1 1/2 cups bread crumbs",
    "1/4 cup olive oil",
    "1/2 lemon"
  ],
  "__v": 1
}