{
  "hash": "0eb26e7fe4f1cf0ed2e87fafb81472f39d104ecc",
  "title": "Singapore Noodles",
  "image": "http://www.epicurious.com/images/recipesmenus/2009/2009_july/354709_116.jpg",
  "href": "http://www.epicurious.com/recipes/food/views/Singapore-Noodles-354709",
  "keywords": [
    "rice",
    "vermicelli",
    "soaked",
    "water",
    "pliable",
    "tiger",
    "shrimp",
    "heads",
    "oil",
    "onion",
    "wedges",
    "shelled",
    "green",
    "frozen",
    "peas",
    "thawed",
    "indian",
    "curry",
    "cantonese",
    "roast",
    "pork",
    "slice",
    "ham",
    "fish",
    "kosher",
    "salt",
    "black",
    "pepper",
    "sprigs",
    "cilantro",
    "trimmed"
  ],
  "directions": [
    "0",
    "Bring a pot of water to a boil over high heat and cook the noodles until tender yet firm, about 10 seconds. Use a strainer and tongs to pick up the noodles and transfer them to a bowl. In the same water cook the shrimp until opaque, about 1 minute, and drain.",
    "Heat 1 tablespoon of the oil in a large skillet or wok over high heat. Stir-fry the onion until golden, 3 to 5 minutes. Add the remaining 2 tablespoons of oil, the noodles, and peas, and sprinkle the curry powder over the top. Toss well, making sure all of the noodles become yellow. Add the pork, shrimp, and fish sauce, and continue to stir-fry until the noodles are heated through, about 5 minutes. Adjust the seasoning with salt and pepper, if necessary, and serve garnished with cilantro."
  ],
  "ingredients": [
    "0",
    "8 ounces dried rice vermicelli, soaked in water until pliable",
    "24 small tiger shrimp, heads removed, peeled and deveined",
    "3 tablespoons vegetable oil",
    "1 small onion, cut into thin wedges",
    "1/2 cup fresh shelled green peas, or frozen peas, thawed",
    "2 teaspoons Indian curry powder",
    "6 ounces Cantonese roast pork or thick slice of ham, diced",
    "1 1/2 tablespoons fish sauce",
    "Kosher salt and freshly ground black pepper",
    "6 sprigs cilantro, trimmed"
  ],
  "__v": 0
}