{
  "hash": "108062c23798d7d7384c5806dbbc4048184f4506",
  "title": "Ike’s Fish-Sauce Wings",
  "image": "http://res.cloudinary.com/sagacity/image/upload/c_crop,h_800,w_532,x_0,y_0/c_scale,w_640/v1396731933/1013-pok-pok-ikes-wings_ok3fds.jpg",
  "href": "https://www.pdxmonthly.com/articles/2013/10/1/make-pok-poks-famous-wings-at-home-october-2013",
  "extension": "Chrome",
  "firstAdded": "2017-02-03T01:45:19.172000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    ") CHOP garlic finely, sprinkle salt, and chop together for about 15 more seconds.",
    "(SCRAPE into a small bowl, add warm water, and let sit for a few minutes.",
    "(POUR through a fine sieve set over a bowl, and use the back of a spoon to stir and smoosh garlic against the sieve, reserving leftover garlic.",
    "(ADD fish sauce and sugar to bowl and stir until dissolved.",
    "(PLACE chicken wings in a separate large bowl, add 1/2 cup of fish sauce mixture (reserve the rest in the refrigerator), and toss well.",
    "(COVER and refrigerate wings for at least four hours, or overnight, tossing every hour or so.",
    "FRY",
    "(1) HEAT 3/4-inch of vegetable oil in a small pan over high heat and add reserved garlic.",
    "(2) REDUCE heat to medium-low, fry until garlic is lightly golden brown, about 5 minutes, and transfer to paper towels to drain (set aside until final cooking stage).",
    "(3) TRANSFER wings from refrigerator to a colander in the sink and let drain for 15 minutes.",
    "(4) STIR together rice flour and tempura mix in a large bowl and toss wings until coated well.",
    "(5) POUR enough oil into a wok or dutch oven to completely submerge the wings, about 2 inches, and bring oil to 325 degrees (measure with a candy thermometer).",
    "(6) FRY wings in two batches, gently knocking them against the bowl before adding to the oil.",
    "(7) COOK each batch until evenly golden brown, about 10–12 minutes, prodding every few minutes.",
    "(8) TRANSFER wings to paper towels to drain.",
    "FINISH",
    "(1) ADD 1/4 cup water to the reserved fish sauce mixture.",
    "(2) COMBINE 1/4 cup of the water–fish sauce mixture and half the chile paste (if you are using it), bring to a full boil in a nonstick wok, and reduce for about 45 seconds.",
    "(3) ADD half the wings and toss every 15 seconds, until a caramelized glaze coats the wings, about 1 minute.",
    "(4) ADD 1 tbsp of the fried garlic, toss well, and cook about 30 seconds longer.",
    "(5) RINSE and wipe out wok, and repeat with the next batch of wings.",
    "(6) SERVE wings with pickled vegetables, cucumber spears, and herb sprigs."
  ],
  "ingredients": [
    "0",
    "8",
    "1 tsp",
    "1/4 cup",
    "1/2 cup",
    "1/2 cup",
    "2 lbs",
    "1 cup",
    "1/4 cup",
    "1/4 cup",
    "1–2 tspnaam phrik khao soi"
  ],
  "__v": 1
}