{
  "hash": "3d20aad1e9c3fc41cd5595c385e49e4aa595ba32",
  "title": "PANEER",
  "image": "https://healthynibblesandbits.com/wp-content/uploads/2018/10/How-to-Make-Paneer-10.jpg",
  "href": "https://healthynibblesandbits.com/how-to-make-paneer/",
  "extension": "Chrome",
  "firstAdded": "2020-06-09T15:59:38.454000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Pour the milk into a large pot and bring it to boil over medium heat. I like to cover the pot to speed up the boiling process (which also lessens the likelihood of the milk burning on the bottom). However, you need to watch over that pot like a hawk. Once you start hearing bubbling in the pot, remove the lid and check to see if the milk has boiled. Don’t let the milk boil over the pot because it is a mess to clean up later. You can also check the milk periodically and give it a stir as you wait for it to boil.",
    "While the milk is boiling, prep the lemon juice. If you are using vinegar, I recommend mixing it with 1/4 cup water so that it is not so intense when you pour it into the milk.",
    "Once the milk has boiled, pour in the lemon juice (or vinegar) mixture. Give everything a stir, and you should see the milk curdle immediately. If you don’t, you can add 1 more tablespoon of lemon juice or vinegar. Let the contents of the pot cool for another 5 to 10 minutes.",
    "Line a colander with a cheesecloth and place the lined colander into the sink.",
    "Strain the milk curds through the cheesecloth. Rinse the curds under cold water to wash out the lemon juice or vinegar. This also helps cool the milk curds so that you can squeeze it immediately afterwards.",
    "Gather up the corners of the cloth, twist the cloth so that the soft cheese is in the shape of a ball. Squeeze out the excess water. Usually, the cheese is cool enough for me to handle at this point.",
    "Shape the cheese into a disc (see photos above for an illustration). Place wrapped the cheese over a plate and weigh it down with a small stack of plates on top. Press the cheese for 1 to 2 hours. I usually transfer everything to the fridge at this stage. If you don’t have enough space in your refrigerator, you can press the cheese on the counter and then transfer the cheese to the fridge when you are done. I like to refrigerate the cheese before cooking with it because it allows the cheese to firm up and decreases the likelihood of it disintegrating while I cook with it.",
    "Once chilled, the paneer is ready for cooking! You can refrigerate the cheese in an airtight container for up to a week. You can also freeze the cheese for up to several months."
  ],
  "ingredients": [
    "0",
    "8 cups whole milk",
    "6 tablespoons lemon juice or white vinegar"
  ],
  "__v": 1
}