{
  "hash": "5f5082ea7a8bb5417d2f606e49466da4359bc872",
  "title": "Japanese Mum's ChickenChicken Katsu (Fried Chicken Coated in Japanese Breadcrumbs)",
  "image": "http://img.sndimg.com/food/image/upload/w_555,h_416,c_fit,fl_progressive,q_95/v1/img/recipes/68/95/5/picGK1zZI.jpg",
  "href": "http://www.food.com/recipe/japanese-mums-chicken-68955",
  "extension": "Chrome",
  "firstAdded": "2015-09-19T02:56:34.403000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "drumsticks",
    "skin",
    "important",
    "flavour",
    "tasty",
    "eat",
    "water",
    "balsamic",
    "vinegar",
    "soy",
    "sugar",
    "garlic",
    "clove",
    "bruised",
    "hot",
    "chili",
    "pepper",
    "slit",
    "open",
    "seeds",
    "boneless",
    "skinless",
    "breast",
    "halves",
    "pounded",
    "thickness",
    "salt",
    "allpurpose",
    "flour",
    "egg",
    "panko",
    "breadcrumbs",
    "oil"
  ],
  "directions": [
    "0",
    "Place all the ingredients in a saucepan over a high heat.",
    "Bring to the boil, then reduce to a simmer for about 20 minutes.",
    "Remove any scum that rises to the surface.",
    "Increase the heat, turning the drumsticks frequently in the liquid, and cook until the liquid has reduced to a sticky glaze.",
    "Arrange the chicken on a serving platter, remove the garlic clove and chili from the liquid, and spoon the glaze over.",
    "NOTE It's a glaze rather than a sauce, so there's not a whole lot of it.",
    "1",
    "Season the chicken breasts on both sides with salt and pepper. Place the flour, egg and panko crumbs into separate shallow dishes. Coat the chicken breasts in flour, shaking off any excess. Dip them into the egg, and then press into the panko crumbs until well coated on both sides.",
    "Heat 1/4 inch of oil in a large skillet over medium-high heat. Place chicken in the hot oil, and cook 3 or 4 minutes per side, or until golden brown."
  ],
  "ingredients": [
    "0",
    "8 chicken drumsticks, skin on (the skin is important for flavour, and is so tasty to eat!)",
    "1 cup water",
    "1⁄2 cup balsamic vinegar",
    "1⁄3 cup soy sauce",
    "2 1⁄2 tablespoons sugar",
    "1 garlic clove, peeled and bruised",
    "1 small hot chili pepper, slit open, seeds removed",
    "1",
    "4 boneless skinless chicken breast halves, pounded to 1/2 inch thickness",
    "salt",
    "pepper",
    "2 tablespoons all-purpose flour",
    "1 egg, beaten",
    "1 cup panko breadcrumbs",
    "oil"
  ],
  "__v": 1
}