{
  "hash": "36a2be5d8336edb3a7341149847a95995bbf24df",
  "title": "Maple Cinnamon Star Cookies",
  "image": "https://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2016/12/maple-cinnamon-star-cookies.jpg",
  "href": "https://sallysbakingaddiction.com/2016/12/08/maple-cinnamon-star-cookies/",
  "extension": "Chrome",
  "firstAdded": "2018-10-09T17:42:32.163000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Whisk the flour, cinnamon, baking powder, and salt together in a medium bowl. Set aside.",
    "In a large bowl using a handheld or stand mixer fitted with the paddle attachment, beat the butter until creamy and smooth, about 1 minute. Add the sugar and beat on high speed until light and fluffy, about 2 minutes. Scrape down the sides and up the bottom of the bowl as needed. Add the egg, maple extract, and vanilla extract then beat on high until fully combined, about 2 minutes. Scrape down the sides and bottom of the bowl as needed.",
    "Turn the mixer down to low and add about half of the flour mixture, beating until just barely combined. Add the rest of the flour and continue mixing until just combined. If the dough still seems too soft, you can add 1 Tablespoon more flour until it is a better consistency for rolling.",
    "Divide the dough into 2 equal parts. Roll each portion out onto a piece of parchment (or a silicone baking mat, what I prefer!) to about 1/4″ thickness. Stack the pieces, with parchment paper between the two, onto a baking sheet and refrigerate for at least 1 hour and up to 1 day. Chilling is mandatory. If chilling for more than a couple hours, cover the top dough piece with a single piece of parchment paper.",
    "Once chilled, preheat oven to 350°F (177°C). Line 2-3 large baking sheets with parchment paper or silicone baking mats. Remove one of the dough pieces from the refrigerator and using a cookie cutter, cut into star shapes. Transfer the cut cookie dough to the prepared baking sheet. Re-roll the remaining dough and continue cutting until all is used.",
    "Before baking, top with sprinkles. Use a spoon to press the sprinkles into the cookies so they stay secure on top.",
    "Bake for 10-11 minutes, until lightly browned around the edges. Make sure you rotate the baking sheet halfway through bake time. Allow to cool on the baking sheet for 5 minutes, then transfer to a wire rack to cool completely before dipping into chocolate.",
    "If using, melt the chopped white chocolate in the microwave in 20 second increments, stirring after each until completely melted. Dip the cookies into the white chocolate and allow chocolate to set completely at room temperature or in the refrigerator."
  ],
  "ingredients": [
    "0",
    "2 and 1/4 cups (281g) all-purpose flour (spoon and leveled)",
    "1 teaspoon ground cinnamon",
    "1/2 teaspoon baking powder",
    "1/4 teaspoon salt",
    "3/4 cup (170g) unsalted butter, softened to room temperature",
    "3/4 cup (150g) granulated sugar",
    "1 large egg, at room temperature",
    "1 and 1/2 teaspoons maple extract1",
    "1 teaspoon pure vanilla extract",
    "gold sprinkles and/or edible glitter sprinkles",
    "optional: 8 ounces white chocolate, coarsely chopped"
  ],
  "__v": 1
}