{
  "hash": "421b999f5a779856e26b225c267ba618c1c15e30",
  "title": "Prime-Time Pizza Dough",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2013/7/19/0/FNM_090113-Prime-Time-Pizza-Dough-With-The-French-Pig-Toppings_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/prime-time-pizza-dough.html?soc=sharingpinterest",
  "extension": "Chrome",
  "firstAdded": "2017-01-03T03:13:39.745000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In the bowl of a stand mixer, dissolve the sugar in 1 cup warm water (110 degrees F to 115 degrees F). Sprinkle the yeast on top and let stand 10 minutes, or until foamy. Add the olive oil and salt, then use the dough hook to mix in the flour until the dough starts to come together. Allow the machine to knead the dough until smooth. (If you don't have a stand mixer, you can pulse the dough in a food processor until it is smooth and elastic. Or combine by hand in a large bowl.)",
    "Turn out the dough onto a floured board and knead 2 to 3 minutes. Place the dough in an oiled bowl and turn to coat the surface. Cover the bowl with plastic wrap and let stand in a warm place until the dough has doubled in size, about 1 hour.",
    "Turn out the dough onto a lightly floured surface and divide it in half for 2 large pizzas, or into 4 pieces for small individual pizzas. Form into smooth, tight balls, cover loosely with plastic wrap or a well-floured kitchen towel and set in a warm place to rise again, 30 to 45 minutes. (If you're not using the dough right away, wrap tightly in plastic wrap and refrigerate up to 2 days or freeze up to 1 month.)",
    "Set a pizza stone in the oven and sprinkle a pizza peel lightly with flour. (If you don't have a stone, you can bake your pizza on a pizza pan or baking sheet sprinkled with flour.) Preheat the oven to 500 degrees F.",
    "Press the dough with your fingers until it's as flat as possible, then drape it over both of your fists and gently pull the edges outward while rotating the crust. When the circle has reached the desired size and thickness, place it on the pizza peel (or on the prepared pan). Top the pizza as desired and slide it from the peel onto the hot stone (or transfer the pan to the oven).",
    "Bake 8 to 12 minutes, depending on the thickness, or until the crust is crisp and golden.",
    "Guy's Favorite Topping Combos",
    "The French Pig (pictured above)",
    "Cooked pancetta, sauteed leeks and apple, brie, balsamic vinegar",
    "The Motley Que",
    "Pulled chicken, barbecue sauce, red onions, cilantro, fontina",
    "Spicy Hawaiian",
    "Canadian bacon, pineapple, red jalapeno, marinara sauce, mozzarella",
    "Au Naturel",
    "Parmigiano-reggiano, fresh rosemary, olive oil, cracked black pepper, sea salt",
    "Photograph by Dave Lauridsen",
    "Recipe courtesy of Guy Fieri for Food Network Magazine"
  ],
  "ingredients": [
    "0",
    "1 teaspoon sugar",
    "1 tablespoon active dry yeast",
    "2 tablespoons extra-virgin olive oil, plus more for the bowl",
    "1 teaspoon fine sea salt",
    "2 1/2 cups all-purpose flour, plus more for dusting"
  ],
  "__v": 1
}