{
  "__v": 1,
  "directions": [
    "0",
    "Directions",
    "Drain and rinse the cashews. In a blender or food processor, combine all ingredients (including the dates and their soaking water) except for coconut oil. Blend until smooth. Slowly add coconut oil as it blends. Once mixture is smooth, pour onto crust.",
    "Refrigerate or freeze until set. (about 1-2 hours)",
    "To serve, run a paring knife around the outside of the cake to release it from the springform pan. This tart also freezes well. To serve, thaw in fridge for a few hours. Serve with raw berry coulis or raw date caramel sauce, fresh berries, pomegranate seeds or banana chips.",
    "Serves: 8-10"
  ],
  "firstAdded": "2014-05-10T00:06:07.998000",
  "hash": "664fd5d2b947982f5ae39951f306c2ca503cd3a5",
  "href": "http://www.vancouversun.com/life/Recipe+chocolate+ganache+tart+with+video/7992237/story.html",
  "image": "",
  "ingredients": [
    "0",
    "Makes one nine-inch springform pan or standard pie.",
    "Total Time: 20 min prep, 2 hours to set in fridge",
    "Difficulty Level: Easy",
    "A basic raw crust is as follows- you can match flavours to your filling, your preferences and to what you have in the pantry or freezer.",
    "Equipment:",
    "Nine-inch springform pan",
    "Crust Ingredients",
    "2 cups nuts, coconut or seeds. Pecans, almonds (whole, raw), walnuts, sunflower seeds, pumpkin seeds, dried coconut (unsweetened) work best.",
    "¾ cup dates or other dried fruit. I have used raisins, prunes and figs or a combination.",
    "To make crust",
    "Soak nuts or seeds for at least 30 minutes.Drain, rinse and place in food processor with fruit. Pulse until the mixture is crumbly texture (not pasty!) but holds together when pinched. Press crust into the bottom of the pan evenly.",
    "You can build up the sides if you like, I usually do a flat crust and then ‘side’ the cake with hemp seeds or coconut.",
    "Filling Ingredients",
    "1 cup raw cashews, soaked for at least an hour in plenty of water",
    "3/4 cup raw cacao nibs, ground finely (or use ½ cup raw cacao powder)",
    "1 cup dates, soaked in 1 cup of warm water",
    "1/2 cup agave*",
    "2 Tbsp vanilla",
    "3/4 cup coconut oil or cacao butter, melted gently over a bain marie (double boiler)",
    "Agave is a sweetener which is mainly fructose. It is known for its low glycemic index, but may have other negative health effects when eaten in excess. For an alternative, substitute the agave with one cup of dates, softened in some warm water and drained. This will, however make for a chewy texture. It’s up to you!"
  ],
  "keywords": [
    "makes",
    "nineinch",
    "springform",
    "pan",
    "standard",
    "pie",
    "total",
    "time",
    "min",
    "prep",
    "hours",
    "set",
    "fridge",
    "difficulty",
    "level",
    "easy",
    "basic",
    "raw",
    "crust",
    "follows",
    "match",
    "flavours",
    "filling",
    "preferences",
    "pantry",
    "freezer",
    "equipment",
    "nuts",
    "pecans",
    "almonds",
    "walnuts",
    "sunflower",
    "pumpkin",
    "seeds",
    "coconut",
    "work",
    "best",
    "dates",
    "fruit",
    "used",
    "raisins",
    "prunes",
    "figs",
    "combination",
    "make",
    "minutesdrain",
    "rinse",
    "food",
    "processor",
    "pulse",
    "mixture",
    "crumbly",
    "texture",
    "pasty",
    "holds",
    "pinched",
    "press",
    "evenly",
    "build",
    "sides",
    "usually",
    "flat",
    "cake",
    "hemp",
    "cashews",
    "soaked",
    "hour",
    "plenty",
    "water",
    "nibs",
    "use",
    "cacao",
    "agave",
    "vanilla",
    "oil",
    "butter",
    "gently",
    "bain",
    "marie",
    "double",
    "boiler",
    "sweetener",
    "mainly",
    "fructose",
    "known",
    "low",
    "glycemic",
    "index",
    "negative",
    "health",
    "effects",
    "eaten",
    "excess",
    "alternative",
    "softened",
    "chewy"
  ],
  "title": "Raw chocolate ganache tart",
  "users": [
    null
  ]
}