{
  "hash": "ce4a3512bde5bedab11e5dcff86c86fa872ef9a4",
  "title": "Ricotta Gnocchi With Asparagus and Prosciutto Recipe",
  "image": "http://www.seriouseats.com/recipes/assets_c/2015/04/20150422-asparagus-prosciutto-green-cream-ricotta-gnocchi-recipe-7-thumb-1500xauto-422247.jpg",
  "href": "http://www.seriouseats.com/recipes/2015/05/ricotta-gnocchi-asparagus-prosciutto.html",
  "extension": "Chrome",
  "firstAdded": "2016-08-10T15:32:31.687000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Set a large pot of salted water over high heat. Meanwhile, heat olive oil in a large skillet or slope-sided saucepan over medium-high heat until shimmering. Add prosciutto and cook, stirring, until mostly crisp, about 2 minutes. Add scallions and garlic and cook, stirring, until fragrant, about 1 minute. Add asparagus and cook, tossing and stirring frequently, until asparagus is just starting to turn tender, about 2 minutes.",
    "Add heavy cream and half of Parmesan. Cook, stirring, until cream thickens and coats the asparagus pieces, about 4 minutes. Season to taste with salt and pepper.",
    "Add gnocchi to now-boiling pot of water, stir gently, and cook until gnocchi float for 30 seconds, about 3 minutes total. Drain gnocchi, reserving 1/4 cup of pasta cooking water. Add gnocchi, lemon juice, half of lemon zest, chives, and 2 tablespoons of cooking water to saucepan with sauce and bring to a hard boil, stirring gently. Add more pasta water to thin sauce to desired consistency. Serve immediately, topped with lemon zest and additional Parmesan cheese."
  ],
  "ingredients": [
    "0",
    "1 tablespoon extra-virgin olive oil",
    "4 ounces thinly sliced prosciutto, cut into thin ribbons",
    "1/4 cup thinly sliced green garlic or scallions, white and pale green parts only (about 4)",
    "2 medium cloves garlic, minced",
    "1 pound asparagus, cut on a bias into 1 1/2-inch pieces",
    "1 cup heavy cream",
    "2 ounces grated Parmigiano-Reggiano cheese, divided",
    "Kosher salt and freshly ground black pepper",
    "1 teaspoon grated zest plus 1 tablespoon juice from 1 lemon, divided",
    "2 tablespoons minced fresh chives",
    "1 recipe ricotta gnocchi, prepared through the end of Step 4 (do not cook and do not make sauce)"
  ],
  "__v": 1
}