{
  "hash": "5f04a2baf6a0189a4ba87202ff565081f585c1e1",
  "title": "Granola Bars",
  "image": "http://www.teffyperk.com/wp-content/uploads/2014/12/Buckwheat-Sweet-Potato-Granola-Bars-11.jpg",
  "href": "http://www.teffyperk.com/sweet-potato-granola-bars/",
  "extension": "",
  "firstAdded": "2015-12-29T22:49:42.517000",
  "users": [
    null
  ],
  "keywords": [
    "activated",
    "buckwheat",
    "groats",
    "hazelnuts",
    "pistachios",
    "walnuts",
    "pecans",
    "chia",
    "seeds",
    "goji",
    "berries",
    "pumpkin",
    "pepitas",
    "potato",
    "hulled",
    "tahini",
    "cupml",
    "almond",
    "butter",
    "coconut",
    "oil",
    "honey",
    "maple",
    "syrup",
    "cinnamon",
    "cardamom",
    "pods",
    "salt"
  ],
  "directions": [
    "0",
    "Add your nuts into a food processor and break them down into pieces. Don't go too far or it'll become like a flour! We want to keep nice and crunchy pieces here. Set them aside in a large bowl with your buckwheat, chia seeds, pumpkin seeds, and goji berries.",
    "Add some boiling water to a pan and add a steamer basket.",
    "Chop you sweet potato into pieces (leave the skin on!) and add to the steamer basket and steam for about 10 minutes (the smaller your pieces, the quicker it'll cook)",
    "When the sweet potato is nice and tender add to a food processor and blitz it down into a creamy mash.",
    "In another bowl combine the rest of your wet ingredients and whisk until combined. Add your sweet potato mash and mix until it's all combined. It should be a gorgeous and fragrant colour now (beware not to eat the whole thing as is while taste testing!) If your wet ingredients are too hard you could lightly melt on a saucepan on low heat. You don't want to bring it to a boil here, it's just so everything combines!",
    "Line a baking tray with parchment. Add your caramel-like wet mixture to the large bowl with the dry ingredients, mix, and add to the baking tray. Use a spoon to smooth it out.",
    "Place in the fridge or freezer for about 20 minutes, cut into bars, and store in the fridge until you need a yummy snack!"
  ],
  "ingredients": [
    "0",
    "1 cup (250ml) activated buckwheat groats*",
    "½ cup (125ml) hazelnuts",
    "¼ cup (60ml) pistachios",
    "¼ cup (60ml) walnuts",
    "¼ cup (60ml) pecans",
    "¼ cup (60ml) chia seeds",
    "¼ cup (60ml) goji berries",
    "½ cup (125ml) pumpkin seeds (pepitas)",
    "1",
    "200g sweet potato",
    "¼ cup (60ml) hulled tahini",
    "½ cup(125ml) almond butter",
    "¼ cup (60ml) coconut oil, melted",
    "2 tablespoons honey or maple syrup",
    "¼ teaspoon cinnamon",
    "3 cardamom pods, seeds crushed",
    "Pinch of salt"
  ],
  "__v": 1
}