{
  "hash": "65beb8347c2f075bd4b0aee01aa42a2c5d902299",
  "title": "Elegancki tort orzechowo – kakaowy",
  "image": "http://kuchniaprzemka.blog.pl/files/2015/05/IMG_2340-300x223.jpg",
  "href": "http://kuchniaprzemka.blog.pl/2015/05/13/elegancki-tort-orzechowo-kakaowy/",
  "extension": "",
  "firstAdded": "2016-09-17T14:08:08.859000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Wykonanie:",
    "Jajka należy wyjąć z lodówki odpowiednio wcześniej, aby osiągnęły temperaturę pokojową.",
    "Oddzielamy białka od żółtek. Białka ubijamy ze szczyptą soli na sztywną pianę, następnie dodajemy po łyżce cukru. Kiedy beza będzie gotowa dodajmy po jednym żółtku, mieszając na wolnych obrotach. Następnie dodajemy zmielone orzechy i delikatnie mieszamy szpatułką. Możemy dodać proszek do pieczenia.",
    "Tak przygotowane ciasto biszkoptowe przekładamy do tortownicy wyłożonej papierem do pieczenia (średnica 24-25cm) i pieczemy 30-40 minut w piekarniku nagrzanym do 180 stopni Celsjusza.",
    "Po upieczeniu studzimy na kratce, następnie przecinamy na 2 lub 3 blaty.",
    "Jajka na krem należy sparzyć wrzątkiem. Następnie oddzielamy żółtka od białek, żółtka wkładamy do dużej miski, wsypujemy cukier i ustawiamy nad gorącą kąpielą wodną. Ubijamy żółtka z cukrem na puszystą, białą masę za pomocą rózgi lub miksera uważając aby nie zrobiła się nam słodka jajecznica. Zdejmujemy miskę znad kąpieli wodnej i dalej ubijamy do wystudzenia.",
    "Kolejnym krokiem jest utarcie masła na puch z wanilią. Do masła dodajemy ubite żółtka. Na koniec dodajemy kakao oraz alkohol.",
    "Składanie tortu.",
    "Na początek przygotowujemy nasącz. Mocną herbatę mieszamy z cukrem oraz alkoholem.",
    "Na paterze ustawiamy pierwszy placek, obficie nasączamy, następnie smarujemy konfiturą żurawinową. Wykładamy połowę masy jeśli mamy 2 placki lub 1/3 masy jeśli biszkopt przekroiliśmy na 3 części.",
    "Tak samo postępujemy z kolejnym blatem ciasta.",
    "Wierzch i boki równo smarujemy kremem.",
    "Dekoracja to już indywidualna sprawa i tutaj można puścić wodzę fantazji.",
    "Ja proponuję opruszenie boków posiekanymi orzechami, na wierzchu można ułożyć połówki orzechów.",
    "Możemy również ubić śmietanę i za pomocą rękawa cukierniczego zrobić rozetki lub inne fantazyjne wzorki.",
    "Fajnym pomysłem jest również przystrojenie świeżymi kwiatami."
  ],
  "ingredients": [
    "0",
    "Składniki:",
    "Biszkopt orzechowy:",
    "6 jaj",
    "60-200g cukru (ilość zależy od tego czy lubimy ciasta słodsze lub bardziej wytrawne)",
    "300g orzechów włoskich",
    "2 łyżeczki proszku do pieczenia (opcjonalnie)",
    "Krem kakaowy:",
    "400g masła",
    "10 żółtek",
    "60-200g cukru",
    "łyżeczka ekstraktu waniliowego lub 2 cukry wanilinowe",
    "1-3 kieliszków rumu (ilość zależy od upodobań smakowych, można alkohol pominąć lub zastąpić np. spirytusem)",
    "3-10 łyżek kakao (ilość zależy od upodobań, ja dodaję 9-10 łyżek, wtedy krem ma pyszny, intensywny smak)",
    "Dodatkowo:",
    "pół szklanki mocnej herbaty (ja daję owocową)",
    "50-70ml rumu",
    "1 łyżeczki cukru",
    "słoiczek konfitury żurawinowej lub innej o kwaskowym smaku"
  ],
  "__v": 1
}