{
  "hash": "a36a885af962109640e8ca20e7ca02582ebaa8f0",
  "title": "Coffee-Marinated Flank Fajitas with Pico De Gallo",
  "image": "https://images.food52.com/ykZ0S_k6q6G-hfvDEBD_Xjp8yw0=/753x502/e6f9a670-f444-4b04-867f-7c437293ef56--2015-0223_coffee-marinated-flank-fajitas-with-pico-de-gallo_bobbi-lin_17869.jpg",
  "href": "https://food52.com/recipes/11320-coffee-marinated-flank-fajitas-with-pico-de-gallo",
  "extension": "Chrome",
  "firstAdded": "2018-01-16T01:43:48.548000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Mix all ingredients together, add a pinch of salt, stir, and taste. Put it in the fridge for a while then stir and taste for salt again.",
    "1",
    "Whisk together the coffee, molasses, garlic, cumin, 2 teaspoons salt, and chilis. Score your flank steak on both sides with a shallow criss-cross pattern. Marinate the flank steak for 3 to 4 hours in the coffee mixture—I use one of those large rectangle throw-away plastic containers and it's a perfect fit.",
    "Heat your grill to high heat (or, if you don't have a grill, you could broil or sear in a big, hot, preferably iron skillet). Remove the flank steak from the marinade and gently pat it dry. Season with just a bit more salt and a good amount of freshly ground black pepper. Now rub it all over with olive oil.",
    "Grill the steak until desired doneness—we grilled is 2 to 3 minues on one side, flipped, then back and forth again to create a criss-cross pattern (see photo—my pictures came out crappy but you get the idea) and ours was a good medium.",
    "Rest your steak for several minutes. When you are ready to serve, slice the flank across the grain (the short way), and wrap 2 to 3 slices in a tortilla with a good dollop each of pico and sour cream. Dig in!"
  ],
  "ingredients": [
    "0",
    "2 cups diced tomato (I used red and yellow)",
    "1 cup diced red onion",
    "3 seeded and minced jalapeños (mine were mild—adjust according to heat to your taste)",
    "Juice from one lime",
    "1/4 cup fresh chopped cilantro",
    "Salt",
    "1",
    "1 1/2 to 2 pounds flank steak",
    "2 cups strong brewed coffee",
    "3 tablespoons molasses",
    "1 tablespoon unsweetened cocoa powder",
    "1 teaspoon cumin",
    "1 tablespoon chopped garlic",
    "2 teaspoons salt",
    "2 tablespoons ground chili (see headnote on chili powder)",
    "Olive oil, salt, and freshly ground black pepper",
    "Sour cream and tortillas to serve"
  ],
  "__v": 1
}