{
  "hash": "6ab232091ed21310ad180fe116dc3963165a64f5",
  "title": "Indian lamb with spiced lentils",
  "image": "http://ukcdn.ar-cdn.com/recipes/xlarge/a5bd408d-8c8b-4328-9073-63c622a22225.jpg",
  "href": "http://allrecipes.co.uk/recipe/2978/indian-lamb-with-spiced-lentils.aspx",
  "firstAdded": "2015-01-03T16:00:25.366000",
  "users": [
    null
  ],
  "keywords": [
    "black",
    "peppercorns",
    "cumin",
    "seeds",
    "cardamom",
    "pods",
    "sunflower",
    "oil",
    "onion",
    "garlic",
    "root",
    "ginger",
    "red",
    "chilli",
    "seeded",
    "cinnamon",
    "turmeric",
    "lean",
    "boneless",
    "leg",
    "lamb",
    "neck",
    "fillet",
    "trimmed",
    "fat",
    "cubes",
    "hot",
    "stock",
    "preferably",
    "green",
    "lentils",
    "plum",
    "tomatoes",
    "juice",
    "lemon",
    "coriander",
    "salt",
    "pepper"
  ],
  "directions": [
    "0",
    "Crush the peppercorns with the cumin and cardamom seeds in a pestle and mortar or an electric grinder. Set aside.",
    "Heat the oil in a large flameproof casserole, add the onion and fry gently for 5 minutes or until softened. Add the garlic, ginger and chilli and fry for a further 3 minutes, then add the crushed spices and the cinnamon stick and turmeric. Fry gently for 30 seconds, stirring constantly.",
    "Add the lamb and stir to coat with the spices. Fry gently for about 4 minutes or until the meat is browned all over. Gradually pour in the stock, stirring well, and bring to the boil. Reduce the heat, cover and cook gently for 1 hour or until the lamb is almost cooked and tender.",
    "Meanwhile, rinse and drain the lentils, then place them in a saucepan and cover with fresh cold water. Bring to the boil. Boil uncovered for 15 minutes. Drain.",
    "Add the lentils and tomatoes to the curry and cook for 15–20 minutes or until the lamb and lentils are tender. Stir in the lemon juice and fresh coriander and season with salt and pepper to taste. Serve hot."
  ],
  "ingredients": [
    "0",
    "6 black peppercorns",
    "1 tbsp cumin seeds",
    "seeds from 8 cardamom pods",
    "2 tbsp sunflower oil",
    "1 large onion, sliced",
    "2 garlic cloves, crushed",
    "5 cm (2 in) piece fresh root ginger, finely chopped",
    "1 fresh red chilli, seeded and finely chopped",
    "1 cinnamon stick",
    "1",
    "1 tsp turmeric",
    "450 g (1 lb) lean boneless leg of lamb or neck fillet, trimmed of fat and cut into cubes",
    "600 ml (1 pint) hot lamb stock, preferably home-made",
    "225 g (8 oz) green lentils",
    "4 plum tomatoes, quartered",
    "juice of 1/2 lemon",
    "2 tbsp chopped fresh coriander",
    "salt and pepper"
  ],
  "__v": 1
}