{
  "hash": "2da6c02c3f42741fa8d9fc30d52bc5b7115bee6f",
  "title": "Instant Pot Buffalo Chicken Meatballs",
  "image": "http://whatgreatgrandmaate.com/wp-content/uploads/2016/11/IMG_9822-624x624.jpg",
  "href": "http://whatgreatgrandmaate.com/instant-pot-buffalo-chicken-meatballs/",
  "extension": "Chrome",
  "firstAdded": "2017-02-22T18:58:32.053000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large bowl, combine chicken, almond meal, salt, minced garlic cloves, and green onions.",
    "Use your hands to combine everything together, but be careful not to overwork the meat.",
    "Grease your hands with ghee or coconut oil, then shape the meat into balls 1-2 inches wide.",
    "Set your Instant Pot to sauté setting and add ghee.",
    "Working in batches, gently place the chicken meatballs in the Instant Pot to brown them. Turn them every minute until all sides are brown.",
    "While the meatballs are browning, combine hot sauce and butter and heat them in the microwave or the stove top until the butter is completely melted. Use a spoon to stir. This is your buffalo sauce.",
    "Place all the browned meatballs in the Instant Pot, then pour the buffalo sauce evenly over the meatballs.",
    "Screw on the lid to the Instant Pot, make sure that the pressure valve is set to \"sealing,\" then set it to \"Poultry.\"",
    "Once the meatballs are finished cooking (about 15-20 minutes), the Instant Pot will beep. If you are eating right away, hit \"Cancel\" then release the pressure valve, making sure your hand is away from the opening where the steam escapes. If not, the Instant Pot will automatically switch to the \"Warm\" setting for the next 10 hours and the pressure will slowly lower on its own.",
    "Serve over rice, cauliflower rice, zoodles. or just eat on its own!"
  ],
  "ingredients": [
    "0",
    "1.5 lb ground chicken",
    "¾ cup almond meal",
    "1 tsp sea salt",
    "2 garlic cloves, minced",
    "2 green onions, thinly sliced",
    "2 tbsp ghee",
    "6 tbsp hot sauce",
    "4 tbsp butter",
    "chopped green onions, for garnish"
  ],
  "__v": 1
}