{
  "__v": 1,
  "directions": [
    "0",
    "Place the chicken pieces in a bowl and pour lemon juice over. Let sit at room temperature for at least 30 minutes.",
    "Heat the niter kibbeh or butter along with the olive oil in a Dutch oven. Add the onions and saute, covered, over low heat for 45 minutes, stirring occasionally.",
    "Add the garlic, ginger, and 1 tablespoon butter and continue to saute, covered, for another 20 minutes, stirring occasionally.",
    "Add the berbere and the 2 remaining tablespoons of butter and saute, covered, over low heat for another 30 minutes, stirring occasionally.",
    "Add the chicken, broth, and wine and bring to a boil. Reduce the heat to low, cover, and simmer for 45 minutes, stirring occasionally.",
    "Adjust the seasonings, adding more berbere according to heat preference. Add the boiled eggs and simmer on low heat, covered, for another 15 minutes.",
    "Serve hot with injera bread or rice."
  ],
  "firstAdded": "2014-08-17T02:04:45.266000",
  "hash": "0300c074c0e0c922b1bcca02540be669aba0720c",
  "href": "http://www.daringgourmet.com/2013/08/27/doro-wat-spicy-ethiopian-chicken-stew/",
  "image": "http://www.daringgourmet.com/wp-content/uploads/2013/08/Doro-Wat-2-sm.jpg",
  "ingredients": [
    "0",
    "2 ½ to 3 lbs chicken thighs, cut into 1 inch pieces, or 3 chicken breasts, cut into ½ inch pieces",
    "2 tablespoons fresh lemon juice",
    "2 tablespoons niter kibbeh, if you have it (ethiopian spiced butter), or regular butter",
    "2 tablespoons extra virgin olive oil",
    "3 cups yellow onions finely minced to a chunky puree in food processor",
    "3 tablespoons butter",
    "1 tablespoon finely minced garlic",
    "1 tablespoon finely minced ginger",
    "¼ cup berbere (see recipe here) (or you can buy it HERE)",
    "1½ teaspoons salt",
    "½ cup white wine mixed with 1 teaspoon honey",
    "1 cup chicken stock",
    "4 hard-boiled eggs, pierced all over with fork about ¼ inch deep"
  ],
  "keywords": [
    "lbs",
    "thighs",
    "chicken",
    "breasts",
    "pieces",
    "lemon",
    "juice",
    "niter",
    "kibbeh",
    "ethiopian",
    "spiced",
    "regular",
    "butter",
    "extra",
    "virgin",
    "olive",
    "oil",
    "yellow",
    "onions",
    "chunky",
    "puree",
    "food",
    "processor",
    "garlic",
    "ginger",
    "berbere",
    "recipe",
    "buy",
    "salt",
    "white",
    "wine",
    "mixed",
    "honey",
    "stock",
    "hardboiled",
    "eggs",
    "pierced",
    "fork",
    "deep"
  ],
  "title": "Doro Wat (Ethiopian Spiced Chicken)",
  "users": [
    null
  ]
}