{
  "hash": "b49a9c4484266f22ddf0bea3ce1a87aa0e89ef26",
  "title": "Vibrant Coconut Green Curry",
  "image": "https://mbkr-minimalistbaker.netdna-ssl.com/wp-content/uploads/2016/11/AMAZING-Green-Curry-with-tons-of-greens-Serve-with-tofu-and-curried-kale-for-a-plantbased-meal-vegan-glutenfree-curry-recipe.jpg",
  "href": "https://minimalistbaker.com/vibrant-coconut-green-curry/",
  "extension": "",
  "firstAdded": "2017-11-12T03:45:06.645000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat a large, rimmed skillet or pot over medium heat. Once hot, add oil, garlic, shallot, and ginger. Cook for 3-4 minutes, stirring frequently, or until softened and slightly browned.",
    "Add curry powder and frozen spinach and cook for 3-4 minutes, stirring occasionally. Then add coconut milk, coconut sugar, and sea salt (about 1/4 tsp to start).",
    "Heat over medium-high heat until simmering - about 4 minutes. Then remove from heat and carefully transfer the curry to a high-speed blender (or use an immersion blender). Blend on high, covering with a towel to prevent any leaks. At this time you can add some cornstarch or arrowroot starch to thicken and blend once more to fully combine. This is optional but does provide the sauce with more thickness/body.",
    "While still in the blender. taste and adjust flavors as needed, adding more curry powder for intense curry flavor, sea salt for overall flavor, or coconut sugar for sweetness.",
    "Transfer curry back to the skillet or pot and heat over medium heat until bubbling. Then reduce heat to low and cook until slightly thickened - about 5-10 minutes.",
    "While the curry cooks, you can throw in vegetables of choice (i.e. red pepper, cubed sweet potatoes or squash, additional greens such as kale, etc.). But because I was serving mine with my Coconut Curried Kale and Crispy Tofu, I kept it more as a sauce than a stew.",
    "Serve curry with brown rice and desired sides/add-ins. Best when fresh, though leftovers store well in the refrigerator up to 4 days. I have not tried freezing this recipe, but I presume the sauce would freeze well up to 1 month."
  ],
  "ingredients": [
    "0",
    "2 Tbsp (30 g) coconut, avocado, or grape seed oil",
    "4 cloves garlic, minced (2 Tbsp or 12 g)",
    "2 shallot, diced",
    "1 Tbsp (3 g) minced ginger",
    "1 Tbsp (3 g) curry powder, plus more to taste",
    "8 ounces (227 g) frozen spinach (~1 1/2 cups), slightly thawed (can try fresh, but I didn't test it that way)",
    "2 2/3 cups (620 ml) light coconut milk* (~1.5 14-ounce (414 ml) cans)",
    "1 Tbsp (12 g) coconut sugar, plus more to taste (or sub stevia or maple syrup to taste)",
    "Sea salt to taste (~1/2 tsp)",
    "optional: 2-3 Tbsp (14-21 g) cornstarch or arrowroot starch (to thicken)",
    "1",
    "2-3 cups cooked white or brown rice (see this method for brown rice)",
    "Coconut Curried Greens",
    "Quick + Easy Crispy Tofu",
    "Fresh Cilantro, toasted coconut, red onion"
  ],
  "__v": 1
}