{
  "hash": "af9f2a443094abec5a3f6f24270394e8cb924924",
  "title": "CANNELLONI",
  "image": "",
  "href": "http://lidiasitaly.com/recipes/cannelloni/",
  "extension": "Chrome",
  "firstAdded": "2018-02-28T17:01:40.528000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "tions",
    "Make the pasta: Put the flour in the bowl of a food processor and pulse to aerate. In a measuring cup, mix together the eggs, oil and 3 tablespoons water in a separate bowl, and pour through the feed tube into the food processor while running. Process until the dough forms a ball and sticks to the blade, about 30 seconds. Add more water or flour as necessary to achieve the right consistency – a smooth, homogenized, compact dough. Transfer the dough to a floured work surface and knead a few times, just to bring it together. Wrap the dough in plastic and let rest for an hour. In the meantime, make the filling and the besciamella sauce.",
    "Make the filling: In a large skillet, heat the olive oil over medium heat. Toss in the onion, and cook until it starts to soften, about 5 minutes. Add the ground pork, and cook, crumbling with a wooden spoon, until no longer pink, about 5 minutes. Pour in the white wine, and cook until the wine and meat juices have cooked away and the meat is sizzling, about 10 minutes.",
    "Add the carrots, celery, salt and rosemary. Push the vegetables and meat to the side to clear a “hot spot” in the pan to plop in the tomato paste. Let the tomato paste toast a minute or two, then stir it into the meat and vegetables. Pour in the hot chicken stock, and simmer until thickened and the flavors come together, about 10 minutes. Add the spinach, and cook until tender, about 5 minutes. Scrape filling into a bowl to cool. When cooled, stir in the mortadella, grated cheese, parsley, and lemon zest.",
    "Make the sauce: Warm the milk with the bay leaves in a small saucepan. Melt the butter in a medium saucepan over medium heat. When melted, stir in the flour to make a smooth paste. Cook, stirring with a wooden spoon until roux smells toasty but has not darkened in color, about 4 minutes. Pour in the hot milk, whisking to avoid lumps. Bring to a simmer, whisking until thickened, about 5 minutes. Season with the salt, nutmeg and pepper. Remove from heat, and whisk in the grated cheese.",
    "When an hour has passed, roll out the dough: Cut it into 4 equal pieces. Flatten a piece of dough into a rectangle, 2 by 2 inches, and roll through the widest setting on the pasta machine. Fold this rectangle of dough like a letter, and roll through again. Repeat the rolling and folding a few more times, to knead and smooth the dough. Repeat with the remaining pieces of dough.",
    "Switch to the next-narrowest setting on the machine. Roll a dough strip through, short end first. Repeat with remaining dough strips. Continue this process with narrower settings, now rolling only once through each setting, until you’ve gotten to the next-to-last setting and the dough strips are about as wide as the machine (6 inches).",
    "Cut dough strips into 4-by-6-inch rectangles. Bring a large pot of salted water to boil for pasta. Place a large bowl or pot of ice water next to the boiling pasta water. Boil the dough rectangles, just about a minute, then remove with a spider to the ice bath to cool. Drain, and spread out on baking sheets lined with damp kitchen towels.",
    "Preheat oven to 400 degrees F. To assemble the cannelloni: Spread 1 cup besciamella in the bottom of a 3 quart 9-by-13 Pyrex or ceramic baking dish. Top with ½ cup of the marinara sauce and spread. Fill the dough rectangles with about 1/2 cup of the filling, then roll up the long way like a cigar and fit them snugly together in the baking dish. Spread the remaining besciamella on top, then drizzle the remaining 1 cup marinara sauce over the besciamella. Sprinkle with the grated cheese. Tent the baking dish with foil, and bake until heated through, about 10 to 15 minutes, then uncover and bake until browned and bubbly, about 10 to 15 minutes more."
  ],
  "ingredients": [
    "0",
    "For the pasta:",
    "2 cups all-purpose flour, plus more for working the dough",
    "2 large whole eggs",
    "1/4 cup extra-virgin olive oil",
    "3 tablespoons water",
    "For the filling:",
    "1/4 cup extra-virgin olive oil",
    "1 large onion, finely chopped",
    "1 1/2 pounds ground pork",
    "1 cup dry white wine",
    "2 medium carrots, finely chopped",
    "2 celery stalks, finely chopped",
    "2 teaspoons kosher salt",
    "1 teaspoon chopped fresh rosemary",
    "2 tablespoons tomato paste",
    "1 cup hot chicken stock",
    "10-ounce bag fresh spinach, roughly chopped",
    "8 ounces mortadella, finely chopped",
    "2 cups Grana Padano",
    "1/4 cup chopped fresh Italian parsley",
    "Zest of 1 lemon",
    "For the besciamella:",
    "1 quart low-fat or whole milk",
    "2 fresh bay leaves, or 3 dried bay leaves",
    "4 tablespoons unsalted butter",
    "1/4 cup all-purpose flour",
    "3/4 teaspoon kosher salt",
    "Pinch freshly grated nutmeg",
    "Pinch white pepper",
    "3 tablespoons grated Grana Padano",
    "For assembly of the cannelloni:",
    "1 1/2 cups marinara sauce",
    "1/2 cup grated Grana Padano"
  ],
  "__v": 1
}