{
  "hash": "62723464e009741f132e0ccb2c03e2ccc52dde9a",
  "title": "Roast pork with cider gravy",
  "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/roastporkcropped.jpg?itok=TXd40WOA",
  "href": "http://www.bbcgoodfood.com/recipe/roast-pork-cider-gravy",
  "extension": "",
  "firstAdded": "2016-09-22T12:57:37.283000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the oven to 220C/ 200C fan/ gas 7. Score the skin of the pork and rub with olive oil and sea salt. Put the pork, leeks, carrots, turnip and herbs in large high-sided roasting pan and pour in the cider and stock. Roast for 30 minutes, then take the roasting tray out of the oven and cover tightly with foil. Return to the oven and turn the heat to 150C/ 130C fan/ gas 2.",
    "After 4 hours, remove the foil, turn the oven back up again to 220C/ 200C fan/ gas 7 and roast for another 30 minutes.",
    "Take the pork out of the oven, remove the meat, cover and set aside to rest. Drain the cooking liquid, pouring off any excess fat. Either serve or discard the cooking vegetables.",
    "To make the gravy, melt the butter in a small saucepan and stir in the flour, cook for 2 minutes then whisk in the cooking liquid. Simmer for a few minutes. Serve alongside the meat. Delicious with braised red cabbage and roast potatoes."
  ],
  "ingredients": [
    "0",
    "1 boned and rolled hand and spring of pork Pork paw-kOne of the most versatile types of meat, pork is economical, tender if cooked correctly, and… , skin scored (about 4kg)",
    "2 tbsp olive oil Olive oil ol-iv oylProbably the most widely-used oil in cooking, olive oil is pressed from fresh olives. It's…",
    "sea salt",
    "3 leek Leek lee-kLike garlic and onion, leeks are a member of the allium family, but have their own distinct… , roughly chopped",
    "2 carrot Carrot ka-rotThe carrot, with its distinctive bright orange colour, is one of the most versatile root… , roughly chopped",
    "1 turnip Turnip tern-ipTurnips are creamy-white with a lovely purple, red or greenish upper part where the taproot has… , peeled and roughly chopped",
    "2 bay leaf",
    "3 sprigs thyme ThymeThis popular herb grows in Europe, especially the Mediterranean, and is a member of the mint…",
    "1 sprig sage Sage sa-agePopular in both Italian and British cookery, sage has long, grey-green leaves with a slightly…",
    "500ml cider Cider si-derCider is an alcoholic beverage made from the fermented juice of apples. Apple orchards were…",
    "500ml hot chicken stock",
    "25g butter Butter butt-errButter is made when lactic-acid producing bacteria are added to cream and churned to make an…",
    "25g flour Flour fl-ow-erFlour is a powdery ingredient usually made from grinding wheat, maize, rye, barley or rice. As…"
  ],
  "__v": 1
}