{
  "hash": "b4aeeba8b332f06a4a42c043f3a23fc06862d088",
  "title": "Chocolate Berry Tart (GF, Vegan, Paleo)",
  "image": "http://www.bakerita.com/wp-content/uploads/2013/07/IMG_5491-730x1024.jpg?4e5ad6",
  "href": "http://www.bakerita.com/chocolate-berry-tart-gf-vegan-paleo/",
  "extension": "Chrome",
  "firstAdded": "2015-06-23T11:39:11.393000",
  "users": [
    null
  ],
  "keywords": [
    "coconut",
    "almond",
    "flour",
    "oil",
    "maple",
    "syrup",
    "salt",
    "canned",
    "fullfat",
    "milk",
    "bittersweet",
    "chocolate",
    "raspberry",
    "preserves",
    "fruit",
    "berries",
    "used",
    "raspberries",
    "blueberries",
    "blackberries"
  ],
  "directions": [
    "0",
    "Preheat oven to 350 degrees. In a food processor, pulse together almond flour, salt and shredded coconut until finely ground. Melt together coconut oil and maple syrup and add to almond flour and coconut mixture. Pulse until coarse crumbs form (dough should clump together when squeezed with fingers).",
    "Transfer dough to a greased 9-inch tart pan with a removable bottom. Using a measuring cup or your fingers, evenly press dough in bottom and up sides of pan.",
    "Bake in center of oven until golden and firm, about 12-16 minutes. Transfer to a wire rack to cool completely, at least 1 hour.",
    "1",
    "Place finely chopped chocolate in a large bowl. In a small saucepan, just bring coconut milk to a boil. Pour hot coconut milk over chocolate and let stand 1 minute, then stir until smooth and creamy. Stir in raspberry preserves.",
    "2",
    "Pour warm chocolate mixture into cooled tart shell. Allow to cool for about 20 minutes, and then arrange the berries (or whatever fruit you are using) on top as desired. Chill for at least one hour or until set and serve."
  ],
  "ingredients": [
    "0",
    "½ cup (40g) unsweetened shredded coconut",
    "1 ½ cups (190g) almond flour",
    "2 tablespoons (30g) coconut oil, melted",
    "2 tablespoons (30g) maple syrup",
    "¼ tsp salt",
    "1",
    "½ cup (120ml) canned full-fat coconut milk",
    "6 oz. (140g) bittersweet chocolate, finely chopped",
    "¼ cup raspberry preserves (100% fruit)",
    "2",
    "Assorted fresh berries or fruit of your choice (I used raspberries, blueberries and blackberries)"
  ],
  "__v": 1
}