{
  "hash": "82ffebfae43eed3ec3a5269910e11c92f802e2d8",
  "title": "The Best Almond Flour Sugar Cookies {Gluten-Free, Grain-Free}",
  "image": "http://blog.meaningfuleats.com/wp-content/uploads/2013/12/IMG_1284.jpg",
  "href": "http://blog.meaningfuleats.com/the-best-almond-flour-sugar-cookies-gluten-free-grain-free/",
  "extension": "Chrome",
  "firstAdded": "2016-01-08T16:01:58.504000",
  "users": [
    null
  ],
  "keywords": [
    "butter",
    "ghee",
    "palm",
    "shortening",
    "softened",
    "coconut",
    "oil",
    "sugar",
    "eggs",
    "vanilla",
    "almond",
    "baking",
    "soda",
    "salt",
    "flourscoop",
    "slightly",
    "pack",
    "measure",
    "flour"
  ],
  "directions": [
    "0",
    "In the bowl of a stand mixer, cream together the butter, coconut oil, and brown sugar. Add the eggs, vanilla and almond extract, mix until incorporated.",
    "In a separate bowl, combine the baking soda, salt, almond flour, and coconut flour. With the mixer running on low, add the flour mixture to the creamed ingredients 1 cup at a time, beating well after each addition.",
    "Form the dough into a ball with your hands and place on a piece of plastic wrap. Form the dough into a disc and cover with plastic wrap. Refrigerate for at least 30 minutes and up to overnight.",
    "Preheat the oven to 350F. Line a 2 baking sheets with parchment paper.",
    "Sprinkle a clean, flat surface with coconut flour and roll the dough out until it is 1/4 thick. I like laying it on a piece for parchment paper and placing another sheet on top to roll it out. Or you may have to rub the rolling pin with coconut flour to do this. Cut out the cookies using your choice of cutters. Work somewhat quickly so the dough stays cold. Using a spatula, transfer the cut cookies to the baking sheets.",
    "Gather the remaining scraps back up into a ball and roll out again. Repeat rolling and cutting out cookies until you use all the dough. If the dough gets too warm while you work with it you may need to chill it again.",
    "Bake the cookies for 13-15 minutes, until lightly golden. These cookies need to bake longer than typical sugar cookies. They will stay soft and just get a little crispy, which is just what you want! Cool on a baking sheet for 2 minutes then transfer to a wire rack. Cool completely before frosting. Enjoy!"
  ],
  "ingredients": [
    "0",
    "1/2 cup butter, ghee, or palm shortening, softened",
    "1/4 cup coconut oil, softened",
    "3/4 cup sugar*",
    "2 eggs",
    "2 teaspoons vanilla",
    "1/4 teaspoon almond extract",
    "1/2 teaspoon baking soda",
    "1/2 teaspoon fine salt",
    "2 1/4 cups blanched almond flour(scoop and slightly pack it down when you measure it)",
    "1/2 cup coconut flour"
  ],
  "__v": 1
}