{
  "hash": "1dec65044211ed7342e160e9f8ab546bdada3c63",
  "title": "Greek Chicken Pasta Salad‏",
  "image": "https://bay174.mail.live.com/Handlers/ImageProxy.mvc?bicild=&canary=uf%2bmQoqMvzIiaVnxh0H12R5piqgncduRySMurEiddlc%3d0&url=http%3a%2f%2fwww.budgetbytes.com%2fwp-content%2fuploads%2f2016%2f05%2fGreek-Chicken-Pasta-Salad-close2.jpg",
  "href": "https://bay174.mail.live.com/?tid=cmqdb4C1YY5hG5ZQAhWtgNHA2&fid=flinbox",
  "extension": "Chrome",
  "firstAdded": "2016-05-29T03:16:04.470000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "MARINADE/DRESSING",
    "1 lemon $0.59",
    "¼ cup olive oil $0.64",
    "3 cloves garlic, divided $0.24",
    "½ Tbsp dried oregano $0.07",
    "½ tsp salt $0.02",
    "Freshly cracked pepper $0.03",
    "SALAD",
    "2 boneless, skinless chicken thighs $2.10",
    "8oz. pasta (any shape) $0.50",
    "1 bell pepper (any color) $1.50",
    "4oz. grape tomatoes* $1.00",
    "½ cucumber (1.5 cups diced) $1.00",
    "¼ bunch parsley $0.20",
    "2oz. feta $1.12"
  ],
  "ingredients": [
    "0",
    "Instructions",
    "Use a zester, microplane, or small-holed cheese grater to remove the zest from the lemon. Set the zest aside. Squeeze the juice from the lemon into a separate bowl. You'll need at least ¼ cup juice.",
    "Prepare the dressing and marinade by mincing two of the three cloves of garlic and combining them with ¼ cup lemon juice, olive oil, oregano, salt, some freshly cracked pepper, and a pinch of the lemon zest. Whisk these ingredients until well combined.",
    "Place the chicken thighs in a small zip lock bag and add half of the dressing, saving the rest to add to the salad later. Mince one more clove of garlic and add it to the bag with the chicken and marinade. Squeeze the air out and massage the bag to make sure the thighs are well coated in the marinade. Refrigerate the thighs for at least 30 minutes.",
    "While the chicken is marinating, cook the pasta according to the package directions, drain in a colander, and let cool.",
    "Heat a skillet over a medium flame. Once hot, add the marinated chicken thighs and cook on each side until they are well browned and cooked through (about 5 minutes each side). There should be enough oil in the marinade to keep the meat from sticking. Remove the cooked chicken from the skillet and let it rest for about five minutes. Once slightly cooled, chop the chicken into smaller, bite-sized pieces.",
    "While the chicken is cooking, prepare the rest of the vegetables. Dice the cucumber and bell pepper. Slice the tomatoes in half (or dice if using Roma or regular tomatoes). Pull the parsley leaves from the stems and give them a rough chop.",
    "Finally, build the salad. Add the cooked and cooled pasta to a large bowl. Top the pasta with the cucumber, bell pepper, tomatoes, parsley, and chopped chicken. Crumble the feta over top and add a pinch or two of the lemon zest. Pour the remaining dressing over the salad and toss to coat. Serve immediately or refrigerate until ready to eat."
  ],
  "__v": 1
}