{
  "hash": "5a2b9f2761c240e36ddd546bc6a181101ab3e429",
  "title": "Shake Shack's ShackBurger",
  "image": "https://prods3.imgix.net/images/articles/2017_05/Non-Feature-shake-shack-cheese-burger-recipe.jpg?auto=format%2Ccompress&dpr=1.5&ixjsv=2.2.3&q=66&w=1000",
  "href": "https://www.tastingtable.com/cook/recipes/shake-shack-cheese-burger-recipe",
  "extension": "",
  "firstAdded": "2017-05-16T18:18:54.737000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the ShackSauce: In a small bowl, stir all of the sauce ingredients until smooth, then set aside.",
    "Make the ShackBurgers: Heat a large cast-iron skillet over medium-low heat. Meanwhile, open the hamburger buns and brush both sides liberally with the melted butter. Working in 2 batches, place the buns onto the heated skillet, buttered-sides down, and cook until golden brown, 2 to 3 minutes. Transfer to a plate and spoon 1 tablespoon of sauce on each top bun, along with a piece of lettuce and 2 slices of tomato.",
    "Increase the heat to medium and let the pan heat up for 2 to 3 minutes. On a plate, season both sides of each puck of ground beef with salt and pepper.",
    "Place the pucks into the cast-iron skillet, leaving plenty of room between them. Using a large, sturdy metal spatula, firmly smash each puck into a ⅓-inch-thick round patty. Cook the burgers without touching them until the edges are brown and crisp, 2½ minutes, then flip them. Place a slice of American cheese on each burger and continue to cook until medium, 1 minute more.",
    "Transfer a cheeseburger to each bottom bun, then sandwich with the top bun and lettuce and tomato, and serve."
  ],
  "ingredients": [
    "0",
    "For the ShackSauce:",
    "½ cup Hellman's mayonnaise",
    "1 tablespoon Dijon mustard",
    "1 teaspoon Heinz ketchup",
    "¼ teaspoon kosher dill pickle brine",
    "Pinch cayenne pepper",
    "For the ShackBurgers:",
    "4 hamburger potato buns",
    "4 tablespoons unsalted butter, melted",
    "ShackSauce",
    "4 pieces green-leaf lettuce",
    "Eight ¼-inch slices plum tomatoes",
    "1 pound cold ground beef, formed into four 1-inch-thick pucks",
    "Kosher salt and freshly ground pepper, to taste",
    "4 slices American cheese"
  ],
  "__v": 1
}