{
  "hash": "7d6caf377837614af2c4589ad8b7061d0cff539c",
  "title": "Blueberry lemon mousse cake with scented geranium flowers",
  "image": "https://144f2a3a2f948f23fc61-ca525f0a2beaec3e91ca498facd51f15.ssl.cf3.rackcdn.com/uploads/food_portal_data/recipes/recipe/hero_article_image/2969/compressed_BlueLem-CC_593.jpg",
  "href": "https://www.homemadebyyou.co.uk/recipes/desserts/blueberry-lemon-mousse-cake-with-scented-geranium-flowers",
  "extension": "Chrome",
  "firstAdded": "2017-01-03T11:46:09.608000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 The night before making this, place the can of coconut milk in the fridge. Line the base and sides of a 23cm springform or loose-bottomed cake tin with baking parchment.",
    "2 Soak the cashew nuts in 300ml of water and ½ tsp Himalayan pink salt for 3-4 hours.",
    "3 In a food processor, chop up the dates with the salt and vanilla seeds to form a ball-like paste. Add the coconut and hemp seeds and blitz to combine. Melt the coconut oil, then add to the mix and process until everything is combined. Turn out into the prepared tin and press down to form an even base. Refrigerate.",
    "4 In a blender, process 150g blueberries, lemon zest and juice, honey and remaining salt to form a purple juice. Drain and rinse the cashew nuts thoroughly, then add them to the blueberry juice and process until smooth.",
    "5 Open the can of coconut milk and remove the cream on the top, which will have set overnight. You need 240g, so use some of the thinner milk from the bottom of the can if necessary. Whip up the coconut cream in a freestanding mixer or using an electric whisk, until smooth and thick.",
    "6 Melt the coconut oil and blend it into the blueberry juice. Add everything in the blender to the whipped coconut cream and lightly whisk everything once more until just combined. If you overmix, the cake won’t be as light as it should be. Fold in the remaining blueberries, then pour the mix over the prepared base. Refrigerate for 2 hours until firm.",
    "7 When set, remove from the mould. Decorate with blueberries and scented geranium flowers and serve immediately. This cake keeps well in the fridge for up to five days."
  ],
  "ingredients": [
    "0",
    "400ml can coconut milk",
    "150g\ncashew nuts",
    "¾ tsp Himalayan pink salt",
    "325g\nblueberries",
    "Finely grated zest of 2 lemons",
    "100ml\nlemon juice",
    "110g\nraw clear honey",
    "75g\ncoconut oil",
    "1",
    "90g\npitted Medjool dates",
    "¼ tsp Himalayan pink salt",
    "1 vanilla bean pod, split lengthways and seeds scraped out",
    "70g\ndesiccated coconut",
    "35g\nhemp seeds",
    "30g\ncoconut oil",
    "2",
    "150g\nblueberries",
    "Scented geranium flowers or other edible flowers"
  ],
  "__v": 1
}