{
  "hash": "04540c7f26dd538e44cd59c194d4f8a87f05f07e",
  "title": "Heavenly Raw Vegan White Chocolate and Raspberry Cheesecake {Gluten-Free, Paleo}",
  "image": "http://www.unconventionalbaker.com/wp-content/uploads/2014/06/Raw-Vegan-White-Chocolate-and-Raspberry-Cake-_-Gluten-Free-Paleo.jpg",
  "href": "http://www.unconventionalbaker.com/recipes/raw-vegan-white-chocolate-and-raspberry-cheesecake-gluten-free-paleo/",
  "extension": "Chrome",
  "firstAdded": "2016-01-08T19:46:39.314000",
  "users": [
    null
  ],
  "keywords": [
    "almonds",
    "medjool",
    "dates",
    "cocoa",
    "butter",
    "liquified",
    "raw",
    "beans",
    "vanilla",
    "cashews",
    "presoaked",
    "hours",
    "best",
    "overnight",
    "strained",
    "squeezed",
    "lemon",
    "juice",
    "sweetener",
    "used",
    "maple",
    "syrup",
    "coconut",
    "oil",
    "bean",
    "salt",
    "raspberries",
    "frozen",
    "slightly",
    "thawed",
    "reserve"
  ],
  "directions": [
    "0",
    "Place all base ingredients into a food processor and process until a medium-fine crumbly mixture is formed. Transfer this mixture into the springform pan and press down well to create an even flat cake base. Place in the freezer while working on the next step (or for at least 10 minutes).",
    "Place all cheesecake layer ingredients in your blender (a stronger blender like a Vitamix works best), and blend until mixture is completely smooth. Pour it over the crust into the springform pan. Lightly tap the pan down on the counter to eliminate any air bubbles. Smooth it out as well to create an even surface. Place in the freezer while working on the next step (best if in the freezer for at least 15 – 20 minutes). {Placing cake in the freezer for a bit helps keep the cake layers better separated}",
    "Place all raspberry layer ingredients into your blender and blend until the mixture is smooth. Pour over the cheesecake layer into the springform pan and return back to the freezer for at least 3-4 hours. Cake can then be served out of the freezer as an icebox cake, or kept refrigerated for a softer and more mousse-like consistency. I kept mine frozen, but allowed it to thaw out for about an hour in the fridge before serving. Decorate with some fresh raspberries prior to serving and enjoy!"
  ],
  "ingredients": [
    "0",
    "1 cup almonds",
    "6 medjool dates, pitted",
    "2 tbsp cocoa butter, liquified",
    "¼ tsp raw ground vanilla beans (or ½ tsp pure vanilla extract)",
    "1",
    "1½ cups cashews, pre-soaked (at least a few hours, best overnight) and strained",
    "¼ cup fresh squeezed lemon juice",
    "6 tbsp liquid sweetener of your choice (I used maple syrup)",
    "¼ cup coconut oil, liquified",
    "⅓ cup cocoa butter, liquified",
    "1 tsp pure vanilla extract (or ½ tsp more ground raw vanilla bean)",
    "¼ tsp salt",
    "2",
    "1½ – 2 cups fresh or frozen raspberries (I used frozen and slightly thawed out)",
    "3 tbsp liquid sweetener or your choice (I used maple syrup)",
    "⅓ cup cocoa butter, liquified",
    "3",
    "Reserve a few raspberries for garnish"
  ],
  "__v": 1
}