{
  "hash": "7e180d4d2ac30a8b3b11bd96ea87db26df9890ee",
  "title": "Ser ala Koryciński",
  "image": "http://4.bp.blogspot.com/_z_7tgqnGi0g/TKBE_nofQyI/AAAAAAAAAmg/dPFsZPxApEo/s800/serkorycinski3+%281+of+1%29.jpg",
  "href": "http://klaudynahebda.pl/ser-korycinski/",
  "extension": "Chrome",
  "firstAdded": "2016-02-28T07:40:10.029000",
  "users": [
    null
  ],
  "keywords": [
    "litrw",
    "mleka",
    "penotustego",
    "nie",
    "uht",
    "podpuszczka",
    "kubka",
    "kwanego",
    "moe",
    "kefir",
    "podobno",
    "rwnie",
    "mietana",
    "ulubione",
    "zioa",
    "macierzanka",
    "oregano",
    "mita",
    "itp"
  ],
  "directions": [
    "0",
    "Mleko delikatnie podgrzewamy do temperatury 35-38 stopni (ważne!). Z ciepłego mleka odlewamy kilka łyżek do miseczki. W kilku łyżkach rozpuszczamy podpuszczkę wg. zaleceń producenta (ja daję troszkę więcej, 1/4 fiolki)",
    "Do mleka powoli wlewmy rozbełtaną podpuszczkę oraz pół kubka kwaśnego mleka. Mieszamy dokładnie i przykrywamy garnek pokrywką na około 20-30 minut *(nie podglądać!). W tym czasie mleko zamieni się w porcelanową masę. To tzw. skrzep.",
    "Skrzep kroimy ostrym nożem na małe kwadraciki (1cm kwadratowy) możemy też go lekko zamieszać trzepaczką – teraz jest dobry czas by dodać zioła. Ja dodałam macierzanki. zostawiamy na kolejne 20 minut aby serwatka oddzieliła się od skrzepu.",
    "Wykładamy durszlak gazą, kładziemy go na dużym garnku-talerzu (tam będzie odciekać serwatka). Przekładamy powoli skrzep cedzakową łyżką na durszlak/sito wyłożony gazą. Troszkę to potrwa ale czynność jest przyjemna.",
    "Pozwalamy masie tężeć przez godzinę, po czym bierzemy ser na rękę, wyciągamy gazę (gaza jest po to aby kawałeczki świeżego skrzepu nie wypadały z serwatką) i odwracamy drugą stroną. Ser powinien odciekać przez około 20-24h: w tym czasie należy go odwracać do 2 godziny. Ale kto by się tym przejmował, może być jak się Wam przypomni:) Warto przed nocą odwrócić i parę razy rano:)",
    "Odsączony ser wkładamy do solanki na około 3-4 godziny (ja 4łyżki soli rozpuszczam w pół garnka wody, tak żeby ser wypływam. Potem kładę u góry mały spodek aby cały ser był zanurzony).",
    "Wyciągamy, osuszamy i mamy piękny ser z dziurkami:)"
  ],
  "ingredients": [
    "0",
    "4-5 litrów mleka pełnotłustego (nie UHT)",
    "podpuszczka",
    "pół kubka kwaśnego mleka (może być też kefir, podobno również śmietana)",
    "ulubione zioła (macierzanka, oregano, mięta itp.)"
  ],
  "__v": 1
}