{
  "hash": "759ca0331cb88579047bf67c0884fd2cc7bba107",
  "title": "SOURDOUGH CARROT CAKE WITH CREAM CHEESE FROSTING",
  "image": "",
  "href": "http://www.kingarthurflour.com/recipes/sourdough-carrot-cake-with-cream-cheese-frosting-recipe",
  "extension": "Chrome",
  "firstAdded": "2016-05-10T15:01:26.210000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Preheat the oven to 350°F. Grease and flour a 9\" x 13\" pan.",
    "To make the cake: Combine the oil and sugar, and stir in the sourdough starter. Add the eggs one at a time, beating well after each.",
    "Fold in the pineapple, carrots, walnuts, coconut, and vanilla.",
    "In a separate bowl, combine the flour, cinnamon, salt, and baking soda.",
    "Add the dry ingredients to the wet ingredients, stirring just to combine. Pour the batter into the prepared pan.",
    "Bake the cake for 45 minutes, or until a toothpick inserted into the center comes out clean, and the sides are just beginning to pull away from the edge of the pan.",
    "Remove the cake from the oven and cool it completely on a rack before frosting.",
    "To make the frosting: Combine the butter, cream cheese, and vanilla; beat until light and fluffy.",
    "Add the sugar gradually, beating to combine.",
    "Stir in the nuts and/or ginger. Add the milk, a little at a time, until the frosting is a spreadable consistency.",
    "Serve the cake at room temperature. Store it in the refrigerator for up to 5 days. Unfrosted, the cake can be frozen, well wrapped, for up to 3 months. Frost just before serving."
  ],
  "ingredients": [
    "0",
    "CAKE",
    "1 1/2 cups vegetable oil",
    "2 cups granulated sugar",
    "1 cup sourdough starter, right from the fridge, unfed",
    "3 large eggs",
    "1 cup crushed pineapple, drained",
    "2 cups grated carrots",
    "1/2 cup chopped walnuts",
    "1/2 cup shredded unsweetened coconut",
    "2 teaspoons vanilla extract",
    "2 1/2 cups King Arthur Unbleached All-Purpose Flour",
    "2 teaspoons cinnamon",
    "1/2 teaspoon salt",
    "1 teaspoon baking soda",
    "FROSTING",
    "6 tablespoons butter, at room temperature",
    "1 cup cream cheese, softened",
    "1 teaspoon vanilla extract",
    "3 1/2 cups confectioners' sugar",
    "1 cup chopped pecans or walnuts, optional",
    "1/2 cup mini diced ginger (candied ginger) or 1 teaspoon ground ginger, optional",
    "2 to 4 tablespoons milk"
  ],
  "__v": 1
}