{
  "hash": "463e9340ddcfb5d35d589a870e1d9a7d5d246fa2",
  "title": "beer-cheese hush puppies",
  "image": "http://www.recipe.com/images/beer-cheese-hush-puppies-ss.jpg",
  "href": "http://www.recipe.com/beer-cheese-hush-puppies/",
  "extension": "Chrome",
  "firstAdded": "2015-10-06T12:41:09.402000",
  "users": [
    null
  ],
  "keywords": [
    "yellow",
    "cornmeal",
    "allpurpose",
    "flour",
    "baking",
    "sugar",
    "salt",
    "pepper",
    "jack",
    "cheddar",
    "cheese",
    "onion",
    "red",
    "egg",
    "lightly",
    "light",
    "lager",
    "oil",
    "shortening",
    "deepfat",
    "frying",
    "snipped",
    "flatleaf",
    "italian",
    "parsley",
    "green",
    "jalapeno",
    "jelly"
  ],
  "directions": [
    "0",
    "In a medium bowl mix cornmeal, flour, baking powder, sugar and salt. Add cheese, onion and red sweet pepper; toss to combine. Make a well in the center of the flour mixture. In another bowl mix egg and beer; add all at once to flour mixture. Stir just until moistened.",
    "2.",
    "In a 3-quart saucepan heat 2-inches of oil to 375 degrees F. For each hush puppy, drop 1 rounded tablespoon of batter into hot oil. Fry three or four at a time for 3 minutes or until golden brown, turning once. Drain on paper towels. Sprinkle with parsley, if desired.",
    "3.",
    "Meanwhile, in a small saucepan, heat pepper jelly just until melted. Serve hush puppies warm with pepper jelly. Makes 20 to 24 hush puppies.",
    "NUTRITION INFORMATION",
    "Per Serving: cal. (kcal) 128, Fat, total (g) 7, chol. (mg) 12, sat. fat (g) 1, carb. (g) 15, Monounsaturated fat (g) 1, Polyunsaturated fat (g) 4, Trans fatty acid (g) 0, fiber (g) 1, sugar (g) 5, pro. (g) 2, vit. A (IU) 145.77, vit. C (mg) 3.54, Thiamin (mg) 0.06, Riboflavin (mg) 0.07, Niacin (mg) 0.59, Pyridoxine (Vit. B6) (mg) 0.04, Folate (µg) 24.19, Cobalamin (Vit. B12) (µg) 0.06, sodium (mg) 124, Potassium (mg) 34, calcium (mg) 40.39, iron (mg) 0.54, Percent Daily Values are based on a 2,000 calorie diet"
  ],
  "ingredients": [
    "0",
    "1 cup yellow cornmeal",
    "1/2 cup all-purpose flour",
    "1 1/2 teaspoons baking powder",
    "1 teaspoon sugar",
    "1/2 teaspoon salt",
    "2 ounces pepper jack cheese or cheddar cheese, shredded (1/2 cup)",
    "1/3 cup finely chopped onion",
    "1/3 cup finely chopped red sweet pepper",
    "1 egg, lightly beaten",
    "2/3 cup light lager",
    "Vegetable oil or shortening for deep-fat frying",
    "Snipped fresh flat-leaf Italian parsley (optional)",
    "Green or red jalapeno jelly"
  ],
  "__v": 1
}