{
  "hash": "22d661f0593ffa521a86f2f06bcfdb56abcae232",
  "title": "Filet Mignon Beef Jerky",
  "image": "https://media1.popsugar-assets.com/files/thumbor/hezTX1LzqWwmcaApwPZht3xJINg/fit-in/1024x1024/filters:format_auto-!!-:strip_icc-!!-/2015/12/10/922/n/1922398/448b9c5935e02982_b65a74987aadcc43_thumb_temp_pinterest_post_image_file347478211400013697.jpg",
  "href": "https://www.popsugar.com/food/Filet-Mignon-Beef-Jerky-Recipe-34747821",
  "extension": "Chrome",
  "firstAdded": "2017-05-12T23:59:03.127000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "Wrap meat tightly with plastic wrap, and freeze for at least 2 hours, or until it's firm.",
    "Using a very sharp chef's knife, trim off any excess fat or tendons, and then carefully slice the meat into thin strips about 1/8 inch to 1/4 inch thick.",
    "Mix together soy sauce, worcestershire sauce, liquid smoke, garlic, onion powder, black pepper, cayenne, brown sugar, turmeric, and beer to create a marinade. Submerge the sliced beef in the marinade. Refrigerate for at least 3 hours and up to 24 hours, turning a few times to evenly distribute the marinade.",
    "Preheat oven to 175°F, remove the meat from the refrigerator, and let it come to room temperature for about an hour. Spray cooling racks with nonstick cooking spray, and place inside foil-wrapped baking sheets.",
    "Remove the meat from the marinade, drain off any excess liquid, and blot dry with paper towels. Arrange meat strips side by side across the racks, leaving at least 1/4 inch between the strips. Cook until completely dry. This can take anywhere from 2 to 5 hours depending on the thickness of the slices.",
    "Cool completely before storing. Jerky can be stored in an airtight container in a cool, dry place for up to 2 months."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1 pound filet mignon",
    "1/2 cup tamari or low-sodium soy sauce",
    "1/4 cup worcestershire sauce",
    "1 tablespoon liquid smoke",
    "1/2 tablespoon garlic, minced",
    "1/2 tablespoon onion powder",
    "1/4 tablespoon freshly cracked black pepper",
    "1 pinch cayenne pepper",
    "1/4 cup dark brown sugar",
    "1/4 tablespoon turmeric",
    "2 ounces beer"
  ],
  "__v": 1
}