{
  "hash": "1699a1683ab44d868766dc02f837a3b98342b312",
  "title": "EASY MUHAMMARA DIP",
  "image": "https://minimalistbaker.com/wp-content/uploads/2017/12/DELICIOUS-Gluten-Free-Muhamarra-Dip-Flavorful-healthy-10-ingredients-required-vegan-glutenfree-plantbased-muhamarra-dip-minimalistbaker-recipe-8.jpg",
  "href": "https://minimalistbaker.com/easy-muhammara-dip/",
  "extension": "",
  "firstAdded": "2018-04-30T16:45:37.325000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "If making your own pomegranate molasses, heat 3/4 cup (180 ml) pomegranate juice in a small saucepan over a medium heat until it reaches a low boil. Then reduce heat to a steady simmer (low/medium low) and cook for 20-30 minutes or until reduced by half. Set aside to cool. Otherwise, use store-bought.",
    "In the meantime, heat oven to 450 degrees F (232 C) and place whole bell peppers directly on a baking sheet. Roast for 20-25 minutes or until blackened on the outside. Cover with foil to let steam and cool for 10 minutes. Then peel away core, seeds, and skins and set aside.",
    "To a food processor, add pomegranate molasses, bread crumbs, cumin, salt, chili flakes, garlic, walnuts, olive oil, and lemon juice and pulse (instead of blend) to combine. Then add roasted peppers and pulse a few more times to combine. I think a little texture is nice in this dip instead of a purée.",
    "Taste and adjust flavor as needed, adding more lemon for acidity, garlic for \"zing,\" chili flakes for spice, pomegranate molasses for sweetness / depth of flavor, sea salt for saltiness, or cumin for smokiness.",
    "Serve with fresh pita, flatbread, crackers, or vegetables of choice! Best when fresh. Store leftovers covered in the refrigerator up to 3 days. Let come to room temperature before enjoying - I like it warm."
  ],
  "ingredients": [
    "0",
    "MUHAMMARA",
    "2-3 Tbsp (30-45 ml) pomegranate molasses (or 3/4 cup (180 ml) pomegranate juice)",
    "3 red bell peppers (360 g) skin on",
    "3 Tbsp (15 g) bread crumbs (vegan + gluten-free // I like Ian’s GF panko bread crumbs)",
    "1/2 tsp ground cumin",
    "1/2 tsp sea salt, plus more to taste",
    "2 tspAleppo chili flakes, plus more to taste (or sub red pepper flake and reduce to 1/4 tsp)",
    "1 clove garlic (3 g), minced (or sub garlic-infused oil)",
    "1/2 cup (60 g) raw walnuts*, loosely chopped",
    "1 Tbsp (15 ml) olive oil (if avoiding oil, omit)",
    "2 Tbsp (30 ml) lemon juice"
  ],
  "__v": 1
}