{
  "hash": "53186e6f38a49c787ba1a489ec19e383411512c8",
  "title": "SKILLET CHICKEN PARMESAN",
  "image": "http://www.wrytoasteats.com/wp-content/uploads/2017/01/Skillet-Chicken-Parm-Plated-33-350x350.jpg",
  "href": "http://www.wrytoasteats.com/skillet-chicken-parmesan/",
  "extension": "Chrome",
  "firstAdded": "2017-02-22T18:53:02.197000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS:",
    "Begin by preparing the sauce. In a large saucepan combine all sauce ingredients over a medium-low flame, adjusting the seasonings as needed and mashing the tomatoes with a potato masher if using peeled tomatoes. Cover and simmer, occasionally stirring and mashing as appropriate.",
    "Pre-heat oven to 425F. Place a cast iron skillet or oven-proof skillet in the oven while heating.",
    "In a mixing bowl combine the breadcrumbs, oregano, EVOO, and salt & pepper, tossing until well combined — Transfer to a large plate. Next, working one at a time dip the chicken breast in egg, allowing the excess to run off. Dredge in the breadcrumbs until evenly coated on both sides and around the edges, then transfer to a clean plate. Repeat with the remaining breast.",
    "Remove the heated skillet from the oven and grease the bottom with about 2 teaspoons of olive oil, swirling to coat. Transfer the breaded chicken breasts to the skillet, then immediately return to the oven and bake on the oven middle rack for 15 minutes. When ready, drizzle the top of each cutlet with a touch more olive oil, then flip and bake 15 minutes more. Once the chicken is nice and crisp, lastly spoon the sauce around and on top of the cutlets, then layer with mozzarella cheese. Bake for 5 – 10 minutes more until the cheese has completely melted, broiling for 1 – 2 minutes at the end if you prefer a browner finish. Cool slightly, then garnish with basil and serve!"
  ],
  "ingredients": [
    "0",
    "NGREDIENTS:",
    "SAUCE:",
    "28 oz can peeled or crushed tomatoes",
    "1 1/4 tsps basil",
    "1 1/4 tsps oregano",
    "1 tsp crushed or minced garlic",
    "several dashes salt",
    "a few pinches black pepper",
    "a few pinches granulated sugar",
    "CHICKEN:",
    "3/4 cup breadcrumbs",
    "1 1/2 tsps oregano",
    "1 1/2 tbsps extra virgin olive oil + more for greasing",
    "a pinch of salt & pepper",
    "1 large egg, beaten",
    "(two) 4 – 6 oz boneless/skinless chicken breasts, pounded thin",
    "4 oz mozzarella cheese, sliced",
    "fresh basil to garnish (optional)"
  ],
  "__v": 1
}