{
  "hash": "c5200026d4737f9d7eef9f8c91442de1f3ff6316",
  "title": "Yellow Cake {Scratch Recipe}",
  "image": "https://www.mycakeschool.com/images/2014/10/Homemade-Yellow-Cake-Image-780x780.jpg",
  "href": "https://www.mycakeschool.com/recipes/yellow-scratch-recipe/",
  "extension": "Chrome",
  "firstAdded": "2017-12-25T00:45:09.509000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 degrees. Grease and flour two 8 inch pans.",
    "*This recipe uses the Reverse Creaming Method",
    "In a bowl, combine eggs, milk, flavorings (if making a coconut cake, add an additional teaspoon of coconut), and vegetable oil.",
    "In the bowl of your mixer, combine flour, sugar, salt, and baking powder.",
    "Whisk the dry ingredients for 30 seconds to combine. With your mixer on low to medium speed, slowly add the pieces of butter, a few pieces at a time. Beat until the dry ingredients are moistened by the butter and look like crumbly coarse sand. Scrape the sides and bottom of the bowl to make sure there is no dry flour. SLOWLY with the mixer on low speed add approximately 1/2 of the egg mixture to the dry ingredients increasing to medium speed for 1 1/2 minutes, the batter will be thick and fluffy. Scrape the bowl and add the remaining egg mixture in 2 pourings, scraping the bowl and beating for 20 seconds after each addition.",
    "Bake at 350 degrees for 30 - 35 minutes or until a toothpick inserted in the center comes out clean. Let the cake cool in the pans 10 minutes then turn out.",
    "Makes 6 1/2 cups batter"
  ],
  "ingredients": [
    "0",
    "4 large eggs",
    "1 cup (242 g) milk",
    "2 teaspoons (8g) vanilla extract (If making a coconut cake, add an additional 1 teaspoon coconut extract)",
    "2 Tablespoons (18 g) vegetable oil",
    "2 1/2 cups (285 g) cake flour",
    "1 1/2 cups (300 g) granulated sugar",
    "1 teaspoon (6 g) salt",
    "2 1/2 teaspoons (12 g) baking powder",
    "1 1/2 sticks (12 T) (169 g) unsalted butter, softened (do not soften in the microwave) I cut into 1/2 inch slices onto waxed paper to soften slightly, it should remain cool for good results. If it becomes too soft, just refrigerate for 5 minutes"
  ],
  "__v": 1
}