{
  "__v": 1,
  "directions": [
    "0",
    "MethodPrick the chicken pieces all over with a fork. Place them in a large bowl and add the red chilli powder, lemon juice and salt and mix well. Cover the bowl with a cling film and set aside to marinate for thirty minutes in a refrigerator. 2.For the marinade, mix together drained yogurt, ginger paste, garlic paste, chilli powder, garam masala powder, salt and mustard oil. Add the chicken and mix well so that all the chicken pieces are well coated with the marinade. Cover the bowl with cling film and place it in the refrigerator to marinate for three to four hours. 3.Preheat the oven to 200°C / 400°F 4.String the chicken pieces onto skewers and cook them in the preheated oven for ten to twelve minutes or until almost done. Baste the chicken pieces with the butter and cook for two minutes more. Take the skewers out of the oven and slide the chicken pieces onto a place and set aside. 5.For the gravy, dry roast the dried fenugreek leaves till fragrant. Set aside to cool. When cooled crush with your hands to a powder. 6.Heat one tablespoon butter in a deep non stick pan on low heat. Add the green cardamoms and mace and cook till fragrant. 7.Mix the red chilli powder in one tablespoon water to make a smooth paste. Add it to the pan and stir. Add the garlic, ginger and tomatoes and mix well. Cook for twenty minutes or till the tomatoes become pulpy. 8.Strain the mixture into a bowl and grind the residue till smooth. Strain this too into the same bowl. 9.Heat the remaining butter in another deep non stick pan on low heat and add the strained mixture and cook, stirring occasionally, for fifteen minutes. 10.Add the crushed dried fenugreek leaves and cook for five minutes more. Add the salt, honey and cream and mix well. Cook for two minutes more. Add the chicken pieces and cook for three minutes. 11.Serve hot with naan."
  ],
  "firstAdded": "2014-08-17T21:31:34.400000",
  "hash": "5b46cdcdd5afdc921541acfada369dfcd22fe135",
  "href": "http://www.harpalssokhi.com/DetailRecipe.aspx?Rid=543",
  "image": "http://www.harpalssokhi.com/images/uploads/Banners/17052012124004img3a.jpg",
  "ingredients": [
    "0",
    "Boneless chicken, cut into 1½ inch pieces",
    "400 Grams",
    "Red chile powder1",
    "1 teaspoon",
    "Lemon juice",
    "1 tablespoon",
    "Table salt",
    "1/2 teaspoon",
    "Butter",
    "2 tablespoons",
    "Marinade",
    "Greek yogurt",
    "1/2 Cup",
    "Ginger paste",
    "2 teaspoons",
    "Garlic paste",
    "2 teaspoons",
    "Red chile powder",
    "1/2 teaspoon",
    "Garam masala powder",
    "1/2 teaspoon",
    "Table salt",
    "1 teaspoon",
    "Mustard oil",
    "2 teaspoons",
    "Makhni gravy",
    "Kasoori methi (dried fenugreek) powder",
    "1/4 teaspoon",
    "Butter",
    "2 tablespoons",
    "Green cardamoms",
    "4",
    "Gram javitri (mace)",
    "01",
    "Deghi mirch (red chile) powder",
    "1 teaspoon",
    "Garlic cloves, roughly chopped",
    "5",
    "Fresh ginger piece, chopped",
    "1/2 Inch",
    "Tomatoes, roughly chopped",
    "12 medium",
    "Table salt",
    "1 teaspoon",
    "Honey",
    "1 tablespoon",
    "Fresh cream",
    "3 tablespoons"
  ],
  "keywords": [
    "boneless",
    "chicken",
    "pieces",
    "red",
    "chile",
    "lemon",
    "juice",
    "salt",
    "butter",
    "marinade",
    "greek",
    "yogurt",
    "ginger",
    "garlic",
    "garam",
    "masala",
    "mustard",
    "oil",
    "makhni",
    "gravy",
    "kasoori",
    "methi",
    "fenugreek",
    "green",
    "cardamoms",
    "gram",
    "javitri",
    "mace",
    "deghi",
    "mirch",
    "roughly",
    "tomatoes",
    "medium",
    "honey",
    "cream"
  ],
  "title": "Butter Chicken",
  "users": [
    null
  ]
}