{
  "hash": "f6644a345a79e25948dbf7c35e4945855d3f83bc",
  "title": "Samgyetang (Ginseng Chicken Soup)",
  "image": "https://www.koreanbapsang.com/wp-content/uploads/2018/08/DSC_0809-1-150x150.jpg",
  "href": "https://www.koreanbapsang.com/samgyetang/",
  "extension": "Chrome",
  "firstAdded": "2018-12-11T13:40:25.377000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Clean the chicken. Do not cut off the neck and/or tail, if they are still attached. They help keep the rice inside the cavity. Place the cleaned chicken on a cutting board or a large plate. Clean the inside of the cavity with a paper towel to remove any blood. Fold the attached neck into the cavity to close the hole.",
    "Stuff the cavity with the sweet rice and a couple of garlic cloves, leaving room (about 1/4 of the cavity) for the rice to expand as it cooks.",
    "To keep the rice inside the cavity while being cooked, use of one of these two methods: (1) Make a small cut through the thick skin part between one thigh and the cavity opening, but not too close to the edge. Then, use your finger to expand the hole enough to fit the end part of a leg. Bring the other leg over, and insert the end part through the hole to keep the legs crossed together, tucking the tail in to close the opening (see the photos above); or (2) Simply cross the legs and tie together with kitchen twine. Tightly close the cavity with a toothpick if necessary.",
    "In a medium size pot, place the chicken and add 4 to 5 cups (or enough to cover most of the chicken) of water or chicken stock. Add the garlic, ginger, jujubes, and ginseng. If the chicken came with the neck that's been cut off, add to the pot. Also add the extra sweet rice to thicken the soup, if using. Blend the extra soaked rice with a little bit of water for a creamier texture, if desired.",
    "Bring it to a boil over medium high heat. Skim off the foam on top. Cover, and boil for 10 to 15 minutes. Reduce the heat to medium low and boil, covered, for about 20 to 25 minutes, depending on the size of the chicken. See the note.",
    "Serve piping hot with the chopped scallions and salt and pepper on the side so each person can season to taste.",
    "Recipe Notes",
    "This recipe is an update of the original recipe posted in August 2014.",
    "You can also use a samgyetang kit (commercially packaged dry ingredients for samgyetang). Follow the package instructions to prepare the dry ingredients to use in this recipe. Usually soaking is required.",
    "The minimum cooking time is for a chicken about 1.5 pounds."
  ],
  "ingredients": [
    "0",
    "1 cornish hen (about 1.5 to 2 pounds)",
    "1 fresh ginseng root (or dried ginseng, rehydrated)",
    "3 tablespoons sweet rice (2 to 3 tablespoons more to boil with liquid if desired) -- soaked for 1 hour (yields about 4 tablespoons soaked)",
    "5 - 6 plump garlic cloves",
    "1 thin ginger slice (about 1 inch)",
    "2 to 3 jujubes, daechu (대추) (dried red dates)",
    "1 scallion white part",
    "5 cups of water (or good quality chicken stock)",
    "2 scallions finely chopped, to garnish",
    "salt and pepper to taste"
  ],
  "__v": 1
}