{
  "hash": "72beddcf21c567d9d524c6da9d9c4af5f052f2cf",
  "title": "Najlepsza krucha szarlotka z kruszonką",
  "image": "http://kuchniaprzemka.blog.pl/files/2015/05/20150228_182336-300x225.jpg",
  "href": "http://kuchniaprzemka.blog.pl/2015/05/11/najlepsza-krucha-szarlotka-z-kruszonka/",
  "extension": "",
  "firstAdded": "2016-09-17T14:00:20.746000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Mąkę przesiewamy na stolnicę ( ja wyrabiałem ciasto w robocie na kruszonkę a później zagniotłem na stolnicy ) dodajemy cukier puder, proszek do pieczenia i mieszamy. Następnie dodajemy masło i siekamy. Na koniec dodajemy żółtka i zarabiamy ciasto. Dzielimy na dwie nierówne części. Obie zawijamy w folie i większą część wkładamy do lodówki a mniejszą do zamrażarki. Chłodzimy około godziny.",
    "W międzyczasie obieramy jabłka. Połowę kroimy w cienkie plasterki a drugą część ścieramy na tarce o grubych oczkach. Do jabłek dodajemy cukier, sok z cytryny oraz cynamon. Mieszamy.",
    "Ciasto wyjmujemy z lodówki i wałkujemy na wielkość formy. Wylepiamy ciastem dno formy wyłożonej papierem do pieczenia. Następnie ciasto podpiekamy w piekarniku nagrzanym do 180 stopni około 15 minut. Na tak podopieczne i lekko przestudzone ciasto wykładamy jabłka i na wierzch ścieramy zamrożoną część na tarce o grubych oczkach.",
    "W innej wersji obie części ciasta chłodzimy i mniejszą wałkujemy, następnie wykładamy na wierzch jabłek.",
    "Oba warianty finalnie wychodzą pyszne. Ja jednak preferuję i polecam wersję z kruszonką :)",
    "Pieczemy ciasto przez 45-55 minut w piekarniku nagrzanym do 180 stopni, góra dół.",
    "Po upieczeniu i wystudzeniu posypujemy cukrem pudrem. Jeśli lubimy czekoladę możemy przygotować polewę. Inną opcją jest przygotowanie lukru lub tak jak ja preferuje jedynie opruszenie cukrem pudrem.",
    "Ciasto pyszne. Najlepsze!"
  ],
  "ingredients": [
    "0",
    "Niesamowicie kruche ciasto, delikatne, maślane i rozpływające się w ustach. Następnie warstwa pysznych jabłek słodko – kwaśnych z mocno wyczuwalną nutą cynamonu. Na wierzchu najlepsze w tym cieście czyli kruszonka.",
    "Jest to najlepsza szarlotka ze wszystkich ciast jabłkowych jakie miałem okazje jeść oraz przyrządzać. Absolutny numer jeden. Polecam wszystkim gorąco. :)",
    "Składniki:",
    "500g mąki",
    "250g masła",
    "100g cukru pudru",
    "5 żółtek z dużych jaj",
    "1 łyżeczka proszku do pieczenia",
    "szczypta soli",
    "2kg jabłek już po obraniu tj. około 2.5-3kg całych owoców",
    "pół szklanki cukru, ilość zależy od słodkości jabłek oraz państwa upodobań smakowych",
    "2 spore łyżki cynamonu",
    "2 łyżki soku z cytryny"
  ],
  "__v": 1
}