{
  "__v": 2,
  "directions": [
    "0",
    "Directions:",
    "Set the oven to broil.",
    "Place the flank steak on a baking sheet and sprinkle liberally with garlic powder.",
    "Broil the steak 4 minutes each side then set aside and let cool. The steak will still be undercooked. You want it to still be quite pink so that it doesn’t overcook when you stir fry it with the other ingredients.",
    "Once the steak is cool, slice into thin strips.",
    "In a small bowl, mix together the oyster sauce, fish sauce, water and chili garlic sauce. Set aside.",
    "In a large saucepan, heat up the sesame oil and garlic. Once hot, saute the onion and bell pepper for about 3 minutes or until the onion begins to soften (but not completely cooked).",
    "Add in the cooked green beans, basil, steak and sauce and saute all together. Cook for about 5 minutes or until fragrant and the beef is cooked to your liking.",
    "Enjoy on it’s own or over Coconut “Rice”"
  ],
  "firstAdded": "2014-09-20T14:57:58.022000",
  "hash": "752331bff2f77647c5748cb1524db52da3728203",
  "href": "http://findingtheweigh.com/main-dishes/beef-lamb-pork/thai-beef-basil/",
  "image": "http://i0.wp.com/findingtheweigh.com/wp-content/uploads/2014/08/Thai-Beef-Basil.jpg?resize=300%2C300",
  "ingredients": [
    "0",
    "Ingredients:",
    "1.5 lbs flank steak (or any lean cut of beef)",
    "1 medium yellow onion, sliced into strips",
    "1 medium red bell pepper, sliced into strips",
    "3 handfuls green beans, cooked but still a bit crunchy",
    "2 cups packed basil leaves",
    "1 tbsp sesame oil",
    "4 tbsp oyster sauce",
    "1.5 tbsp fish sauce (or soy sauce)",
    "1 tbsp water",
    "1-2 tbsp chili sauce (depending on how spicy you’d like it)"
  ],
  "keywords": [
    "lbs",
    "flank",
    "steak",
    "lean",
    "beef",
    "medium",
    "yellow",
    "onion",
    "strips",
    "red",
    "bell",
    "pepper",
    "green",
    "beans",
    "bit",
    "crunchy",
    "basil",
    "leaves",
    "sesame",
    "oil",
    "oyster",
    "fish",
    "soy",
    "water",
    "chili",
    "depending",
    "spicy",
    "youd"
  ],
  "title": "Thai Beef Basil",
  "users": [
    null
  ]
}