{
  "__v": 1,
  "directions": [
    "0",
    "Instructions",
    "Wash, peel, and slice the potatoes into thin, ⅛” thick slices. Heat the olive oil in a large oven-safe skillet over medium heat. Once the skillet is hot, add the potatoes and season with salt and pepper.",
    "Cook the potatoes for about 10 minutes, stirring only occasionally so that the bottom layer has a chance to brown. Preheat the oven to 400 degrees.",
    "While the potatoes are cooking, slice both the green and white ends of the green onions. Add the white ends to the skillet with the potatoes as they cook. Also roughly chop the deli ham and add it to the skillet as the potatoes cook.",
    "In a large bowl, whisk together the eggs, milk, and parmesan cheese. Once the mixture is fairly smooth, stir in the remainder of the sliced green onions (the green ends).",
    "Once the potatoes are tender, but not falling apart (about 10 minutes of cooking), pour the egg mixture into the skillet, making sure to cover all areas. Continue to cook the mixture in the skillet without stirring for 1-2 minutes, or until the edges are set.",
    "Transfer the skillet to the oven and continue cooking for about 20 minutes, or until the egg has puffed up and eggs are set (firm, but still moist). The center of the skillet will firm up last, so test the center for doneness. Allow the frittata to sit for five minutes before slicing and serving."
  ],
  "firstAdded": "2014-03-31T00:10:01.377000",
  "hash": "52888be5e7d28a3bb4d21fedc6994c93673f8c35",
  "href": "http://www.budgetbytes.com/2013/07/ham-potato-frittata/",
  "image": "",
  "ingredients": [
    "0",
    "Ingredients",
    "2 Tbsp olive oil $0.32",
    "2 lbs. potatoes $1.12",
    "1 bunch green onions $0.75",
    "4.5 oz. (1/2 of a 9 oz. pkg) deli ham $1.64",
    "salt & pepper to taste $0.05",
    "8 large eggs $1.36",
    "½ cup milk $0.13",
    "¼ cup grated parmesan cheese $0.42"
  ],
  "keywords": [
    "olive",
    "oil",
    "lbs",
    "potatoes",
    "bunch",
    "green",
    "onions",
    "pkg",
    "deli",
    "ham",
    "salt",
    "pepper",
    "eggs",
    "milk",
    "parmesan",
    "cheese"
  ],
  "title": "Ham & Potato Frittata",
  "users": [
    null
  ]
}