{
  "hash": "fe866f2efe34ac69b25406e62e74ff59d083c941",
  "title": "Crescent Cheese Danishes!",
  "image": "http://myincrediblerecipes.com/wp-content/uploads/2015/11/1.jpg",
  "href": "http://myincrediblerecipes.com/crescent-cheese-danishes/",
  "extension": "Chrome",
  "firstAdded": "2015-11-13T17:36:57.451000",
  "users": [
    null
  ],
  "keywords": [
    "crescent",
    "roll",
    "tubes",
    "philly",
    "cream",
    "cheese",
    "softened",
    "butter",
    "fully",
    "light",
    "brown",
    "sugar",
    "regular",
    "white",
    "vanilla",
    "glaze",
    "milk"
  ],
  "directions": [
    "0",
    "Preheat over to 350F.",
    "In a medium bowl mix together the softened cream cheese, pure vanilla extract and the white sugar until well combined.set aside.",
    "Open your crescent roll tubes and on a flat surface, lay out each triangle peice",
    "Take two of the Triangle pieces and make a square using two of them ( so 8 squares total) They should look like little boxes, use your fingers to press the perforations together to seal.So they should look like little rectangles laid flat.",
    "Using a brush, take the melted butter and brush it over each rectangle and sprinkle each with one tsp of the light brown sugar.",
    "Take each one and roll from the long side and use your fingers to pinch each end closed.",
    "then take each and roll each into a circle (like a snake coil)",
    "Use your fingers to press the centers flat and stretch the sides a bit, so we can fit our filling into the centers of each.",
    "Top each center with 2 tablespoons of the cream cheese mixture.",
    "Bake in preheated over for about 16-19 minutes or until golden brown.",
    "In a small bowl combine all 3 ingredients and stir until smooth, then drizzle over each warm danish",
    "ENJOY!"
  ],
  "ingredients": [
    "0",
    "2 Crescent Roll Tubes",
    "1- 8 oz. package of Philly cream cheese (softened)",
    "2 TB butter (fully melted)",
    "1/2 Cup of light brown Sugar",
    "1/4 Cup of regular White Sugar",
    "1 Teaspoon Pure Vanilla Extract",
    "Glaze:",
    "1/2 Cup powdered sugar",
    "1 Teaspoon Pure Vanilla extract",
    "4 Teaspoons of milk"
  ],
  "__v": 1
}