{
  "hash": "9ec8874e757daaf9e482288a0dd90020ee0dd4f6",
  "title": "Twice-Baked Spaghetti Squash with Pesto and Parmesan",
  "image": "https://3.bp.blogspot.com/-sDhb6WdsSDw/VoZ4nCLBIKI/AAAAAAABCZ0/Vs7mRVNXjQQ/s1600/1-text2-twice-baked-spsquash-500top-kalynskitchen%2Bcopy.jpg",
  "href": "http://www.kalynskitchen.com/2009/02/recipe-for-twice-baked-spaghetti-squash.html",
  "extension": "Chrome",
  "firstAdded": "2017-02-20T20:10:29.241000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions:",
    "Preheat oven to 400F/200C. Wash outside of spaghetti squash if it's dirty, then cut squash in half lengthwise. Use a sharp pointed spoon to scrape out seeds and stringy gunk that's around the seeds.",
    "Cut ends off squash if desired, then rub inside surface with a small amount of olive oil and Italian Herb Blend. Put squash on baking sheet that you've sprayed with non-stick spray. Roast squash, starting to check after about 40 minutes and removing when squash is still firm but strings apart fairly easily into spaghetti-like strands. (It took about 50 minutes for the large pieces of squash I had.)",
    "Let squash cool a few minutes if needed, then scrape out strands into a plastic bowl or baking pan and discard skins. Gently mix in pesto and the cup of coarsely grated Parmesan cheese, season with salt and fresh ground black pepper, then pour squash/cheese mixture into a gratin dish and top with 1/4 cup more Parmesan cheese. Bake 20-30 minutes more, until mixture is slightly bubbling and cheese is melted and starting to brown. Serve hot."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "1 large spaghetti squash (6-8 lbs.)",
    "1-2 T olive oil (depending on how big your squash is)",
    "1-2 tsp. Italian Herb Blend (or use other seasoning of your choice)",
    "3 T basil pesto (more or less to taste)",
    "1 cup + 1/4 cup coarsely grated Parmesan cheese",
    "salt and fresh ground black pepper to taste"
  ],
  "__v": 1
}