{
  "hash": "c618ddc2fd85b6cc5f5333d3a2a3366be7054c16",
  "title": "Whole Chicken in a Slow Cooker Recipe\nYIELD: 6 servings PREP TIME: 10 min COOK TIME: 8 hours TOTAL TIME: 8 hours 10 min\nIt's incredibly simple and the chicken goes into the crockpot in minutes.",
  "image": "http://www.thelittlekitchen.net/wp-content/uploads/2011/02/whole-chicken-in-a-slow-cooker-the-little-kitchen-13345-180x180.jpg",
  "href": "http://www.thelittlekitchen.net/whole-chicken-in-a-slow-cooker/",
  "extension": "Chrome",
  "firstAdded": "2015-05-07T17:32:22.737000",
  "users": [
    null
  ],
  "keywords": [
    "rub",
    "chicken",
    "salt",
    "paprika",
    "cayenne",
    "pepper",
    "onion",
    "thyme",
    "white",
    "garlic",
    "black",
    "crockpot",
    "approx",
    "medium",
    "carrots",
    "scrubbed",
    "need",
    "peel",
    "halves",
    "thirds",
    "celery",
    "stalks",
    "smashed",
    "lemon",
    "lbs",
    "roasting",
    "fryer"
  ],
  "directions": [
    "0",
    "Directions:",
    "Combine rub ingredients in a small bowl and set aside. Prep the vegetables and place inside the slow cooker (I use a 7 quart oval one like this one.",
    "Remove chicken from packaging and remove neck and pouch with organs. Discard or reserve for later use in another recipe. Rinse chicken with water and pat dry with paper towels.",
    "Rub garlic all over outside of the chicken. Put garlic inside the chicken. Put the rub all over the outside and inside the chicken. Add quartered lemon to the inside of the chicken.",
    "Place chicken on top of the vegetables. Cover slow cooker and cook chicken on low for 4-8 hours. (When I used a 4 lb chicken, it took about 6 hours. The time will depend on the size of the chicken and your slow cooker.) Cook until the internal temperature of the leg is at 160 degrees F or use a pop-up thermometer as the original recipe calls for.",
    "Remove chicken and place in a 9x13 glass or ceramic baking dish. Place baking dish in the oven under the broiler for about 4-5 minutes. Allow chicken to rest after removing it from the broiler for 5-10 minutes.",
    "Frequently asked questions:",
    "Do I need to add water to the crockpot?",
    "Nope no water needed. This recipe actually makes broth while it's cooking the chicken. You can strain it and use it for a later recipe if you want!",
    "How do I get the skin crispy?",
    "After it's done in the crockpot, see the instructions in the recipe to crisp up the skin in your oven broiler.",
    "Can I cook this recipe skinless?",
    "I have never tried it but I have seen other bloggers post a recipe where they did it. If you want to, definitely try it! I can't guarantee it will turn out the same as with the skin (moist and tender) since I haven't tried it myself.",
    "Can I make this recipe with a frozen chicken?",
    "Can you believe I haven't tried this yet? I usually buy whole chickens fresh at the grocery store the day before I make this recipe. I would think you can use a frozen chicken but it will take longer in the slow cooker. I would say if you know you're going to make this recipe in advance then move the chicken from the freezer to the refrigerator so it can defrost for a couple of days but be sure to put it on a plate in case there's condensation or water accumulates."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "Rub Ingredients for the Chicken",
    "4 tsp salt",
    "2 tsp paprika",
    "1 tsp cayenne pepper",
    "1 tsp onion powder",
    "1 tsp thyme",
    "1 tsp white pepper",
    "1/2 tsp garlic powder",
    "1/2 tsp black pepper",
    "For the Crockpot",
    "1 cup chopped onion, approx 1 medium to large onion",
    "4 to 5 carrots, scrubbed, no need to peel, chopped in halves or thirds",
    "4 celery stalks, cut in thirds",
    "2 garlic cloves, peeled and smashed",
    "1 whole lemon quartered",
    "3 1/2 to 4 1/2 lbs roasting or fryer chicken"
  ],
  "__v": 1
}