{
  "hash": "c2d0580a53f0b90710b07a05d61d4a342e6a870c",
  "title": "Swedish Chicken Meat Balls\nIn a mustard cream sauce",
  "image": "https://www.recipe30.com/wp-content/uploads/2017/05/chicken-swedish-meat-balls-848x477.jpg",
  "href": "https://www.recipe30.com/swedish-chicken-meat-balls.html/",
  "extension": "Chrome",
  "firstAdded": "2017-05-29T23:23:41.897000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Peel and finely chop the shallots. To a large frying pan on low to medium heat, add 2 tbsp of butter until melted. Add the shallots and 1 clove of minced garlic.",
    "Gently sweat until translucent then add the all spice, grated nutmeg and the panko. Mix well with 1 tsp salt. Leave to cool a little.",
    "In a mixing bowl, add your chicken mince, and crack one whole egg. Add the breadcrumb mixture and using your hands, coat them in oil and form some balls, slightly smaller than a golf ball for a serve of 12. This can vary.",
    "To the same pan, add the olive oil on a gentle heat, add all the meat balls and keep turning them as they slowly brown. They may lose their shape a little but that’s fine. Once all golden brown, set aside.",
    "For the sauce, using the same unwashed pan on medium heat, add 3 tbsp of butter and 3 tbsp of flour. This will make a roux to thicken the sauce. Mix well and scrape any residue from the bottom of pan. Cook until it turns a light brown colour. Add the chicken stock, mustard, Worcestershire sauce, cream and salt to taste. Mix well, and bring to a gentle simmer on low heat. Return the meat balls to the pan and cook for approx 7 minutes. Ensure you turn them so they are evenly cooked and coated in the sauce.",
    "Chop some parsley and serve the meat balls with a sprinkle of chopped parsley on top."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2-3 shallots",
    "1 garlic clove",
    "6 tbsp butter",
    "1 pound - ½ kilo chicken mince",
    "½ cup panko bread crumbs",
    "¼ teaspoon ground allspice",
    "¼ teaspoon ground nutmeg",
    "½ teaspoon white Pepper",
    "1 teaspoon salt",
    "1 egg",
    "2 tbsp olive oil",
    "3 tbsp all purpose flour (plain)",
    "1 cup chicken stock",
    "1 cup heavy cream",
    "1½ tbsp Worcestershire sauce",
    "1 tsp Dijon mustard",
    "1 handful fresh parsley, chopped",
    "Salt to finish sauce"
  ],
  "__v": 1
}