{
  "hash": "fa37457822122979497e1e6aaff2358850d69cd6",
  "title": "Chocolate Caramel Tart",
  "image": "https://static01.nyt.com/images/2016/02/09/dining/09COOKING-CHOCTART3/09COOKING-CHOCTART3-articleLarge-v2.jpg",
  "href": "https://cooking.nytimes.com/recipes/9360-chocolate-caramel-tart?action=click&module=Collection%20Page%20Recipe%20Card&region=Our%20100%20Best%20Chocolate%20Recipes&pgType=collection&rank=1",
  "extension": "Firefox",
  "firstAdded": "2020-02-11T22:02:01.104000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare chocolate dough: In bowl of an electric mixer, combine the butter, confectioners' sugar and cocoa. Beat until smooth. Add egg yolk and vanilla, and beat until blended.",
    "Sift flour into dough mixture. Beat on low speed until combined. Press the dough into the bottom and up the sides of a 10-inch tart pan. (You can use a 9-inch pan, but the crust will be thicker and the caramel may take longer to set in step 4.)",
    "Preheat oven to 350 degrees. Line tart with foil, and fill with dried beans, rice or pie weights. Bake for 15 minutes. Remove foil and weights, and bake until pastry is dry and set, another 10 to 15 minutes. Transfer to a wire rack to cool.",
    "Prepare caramel filling: In a large saucepan, bring sugar, water and corn syrup to a boil. Stir or swirl the pan occasionally, until mixture is a medium amber color, about 12 minutes. Remove from the heat. Caramel will continue to cook and darken off of the heat. Carefully but quickly whisk in the butter, cream, creme fraiche and salt until smooth (mixture will bubble up). Pour hot caramel into tart, and allow to cool and set, at least 1 hour.",
    "Prepare chocolate glaze: Place chocolate in a bowl. In a small saucepan, bring cream to a boil. Pour hot cream over chocolate and whisk until chocolate has melted and mixture is smooth. Pour glaze over tart, tilting tart for even coverage. Refrigerate until tart is set, at least one hour, then sprinkle with a few granules of fleur de sel. Keep refrigerated until serving."
  ],
  "ingredients": [
    "0",
    "For the chocolate dough: ½ cup (1 stick) salted butter, at room temperature",
    "½ cup plus 1 tablespoon confectioners' sugar",
    "¼ cup unsweetened cocoa",
    "1 large egg yolk",
    "¾ teaspoon vanilla extract",
    "1 ¼ cups all-purpose flour",
    "For the caramel filling: 2 cups sugar",
    "½ cup water",
    "¼ cup corn syrup",
    "½ cup (1 stick) unsalted butter",
    "½ cup heavy cream",
    "2 tablespoons creme fraiche (available at specialty food markets)",
    "Pinch of salt",
    "For the chocolate glaze: 3 ½ ounces extra-bittersweet chocolate (70 to 85%), chopped",
    "½ cup heavy cream",
    "Fleur de sel"
  ],
  "__v": 2
}