{
  "hash": "a2d97455453308a9411578f9ae3cfb6a95470200",
  "title": "Carla Hall's Grilled Cheese With Arugula-Artichoke Pesto and Havarti",
  "image": "http://a.abcnews.com/assets/images/font-sm_off2.gif",
  "href": "http://abcnews.go.com/GMA/recipe/carla-halls-grilled-cheese-arugula-artichoke-pesto-havarti-18229352?nwltr=GMAR_tryPic_pos5",
  "extension": "Chrome",
  "firstAdded": "2015-04-10T19:17:19.087000",
  "users": [
    null
  ],
  "keywords": [
    "arugula",
    "artichoke",
    "pesto",
    "baby",
    "marinated",
    "artichokes",
    "garlic",
    "coarsely",
    "pine",
    "nuts",
    "parmigianoreggiano",
    "cheese",
    "zest",
    "jice",
    "lemon",
    "kosher",
    "salt",
    "extra",
    "virgin",
    "olive",
    "oil",
    "sandwiches",
    "basil",
    "bacon",
    "really",
    "good",
    "loaf",
    "bread",
    "inchthick",
    "slices",
    "sharp",
    "aged",
    "cheddar",
    "havarti",
    "mozzarella",
    "patted",
    "dry",
    "unsalted",
    "butter",
    "room"
  ],
  "directions": [
    "0",
    "In a food processor, combine the vegetable(s), garlic, pine nuts*, herbs, cheese, lemon, spice (if any), and a pinch of salt. Pulse until it forms a chunky paste, stopping to scrape the sides and bottom of the work bowl occasionally. With the machine running, add the oil in a steady stream. Keep processing to your taste, pulsing less for a coarse pesto, more for a smooth one. Season to taste with salt. You can keep the pesto in an airtight container in the fridge for 1 week or in the freezer for up to 3 months.",
    "To make the sandwich, spread pesto on one side of each of two slices of bread. Arrange a layer of cheese over the pesto on one slice of bread. Sandwich with the other slice of bread, pesto side down. Spread a generous layer of butter on both outsides of the sandwich.",
    "Place the sandwich in a nonstick skillet and turn the heat to medium-low. Cook, turning occasionally, until the bread is nice and toasty and golden brown and the cheese is really melty and the sandwich is hot all the way through. Go slow! Too often in a grilled cheese, the bread is brown and the cheese is cold. Um, no. Don't want that. Turn the heat down if you see that happening.",
    "Eat the sandwich as soon as it comes out of the pan, standing up if you have to. You've got to enjoy it hot. Otherwise, it's not so enjoyable. (But don't burn your tongue on the hot cheese. That's not so enjoyable, either.)",
    "If you're making this for other people, too, your kids or friends or whatnot, hand 'em their sandwiches and tell them to show down. This is casual fun food, meant for eating in a nice warm kitchen that smells all good and grilled-cheesy.",
    "TIP:",
    "*To toast spices or nuts, heat them in a small dry skillet over medium heat until they're just fragrant and golden. (You can use the oven if you have it on anyway or are doing a huge batch on a baking sheet. Watch the spices or nuts very carefully to make sure they don't burn. 1/2 cup packed fresh flat-leaf parsley leaves",
    "Original recipe courtesy \"Cooking with Love: Comfort Food that Hugs You,\" by Carla Hall.",
    "This recipe was styled by chef Karen Pickus for Good Morning America."
  ],
  "ingredients": [
    "0",
    "For the Arugula- Artichoke Pesto:",
    "2 cups packed baby arugula",
    "1 cup chopped drained marinated artichokes",
    "2 garlic cloves, coarsely chopped",
    "1/4 cup pine nuts, toasted*",
    "1/4 cup freshly grated Parmigiano-Reggiano cheese",
    "Freshly grated zest and jice of ?? lemon",
    "Kosher salt",
    "1/4 cup extra virgin olive oil",
    "For the Sandwiches:",
    "Basil Bacon Bread or other really good loaf of bread, cut into 1/3- inch-thick slices",
    "Sharp or extra sharp aged cheddar or Havarti cheese, thinly sliced; or fresh mozzarella, patted dry and cut into 1/4 ???inch thick slices",
    "Unsalted butter, at room temperature"
  ],
  "__v": 1
}