{
  "hash": "f5e372f16021406499ad6d39bafedd2d9db7994c",
  "title": "CANDIED JALAPENO OR COWBOY CANDY",
  "image": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,h_118,w_158/v1/img/recipes/45/31/41/u69kIrvRYqLKUezBKWpG_41717595854.jpg",
  "href": "http://www.geniuskitchen.com/recipeprint.do?rid=453141",
  "extension": "Chrome",
  "firstAdded": "2018-08-19T20:42:47.256000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Wearing gloves, remove the stems from all of the jalapeno peppers. The easiest way to do this is to slice a small disc off of the stem-end along with the stem. Discard the stems.",
    "Slice the peppers into uniform 1/8-1/4 inch rounds. Set aside.",
    "In a large pot, bring cider vinegar, white sugar, turmeric, celery seed, granulated garlic and cayenne pepper to a boil. Reduce heat and simmer for 5 minutes.",
    "Add the pepper slices and simmer for exactly 4 minutes.",
    "Use a slotted spoon to transfer the peppers, loading into clean, sterile canning jars to within 1/4 inch of the upper rim of the jar.",
    "Turn heat up under the pot with the syrup and bring to a full rolling boil. Boil hard for 6 minutes.",
    "Use a ladle to pour the boiling syrup into the jars over the jalapeno slices. Insert a cooking chopstick to the bottom of the jar two or three times to release any trapped pockets of air. Adjust the level of the syrup if necessary. Wipe the rims of the jars with a clean, damp paper towel and fix on new, two-piece lids to finger-tip tightness.",
    "*If you have leftover syrup, and it is likely that you will, you may can it in half-pint or pint jars, too. It’s wonderful brushed on meat on the grill or added to potato salad or, or, or… In short, don’t toss it out!",
    "Place jars in a canner, cover with water by 2-inches. Bring the water to a full rolling boil. When it reaches a full rolling boil, set the timer for 10 minutes for half-pints or 15 minutes for pints.",
    "When timer goes off, use canning tongs to transfer the jars to a cooling rack. Leave them to cool, undisturbed, for 24 hours. When fully cooled, wipe them with a clean, damp washcloth then label.",
    "Allow to mellow for at least two weeks, but preferably a month before eating. Or don’t."
  ],
  "ingredients": [
    "0",
    "3 lbs",
    "jalapenos",
    ", fresh and firm",
    "2 cups",
    "cider vinegar",
    "6 cups",
    "granulated sugar",
    "1/2 teaspoon",
    "turmeric",
    "1/2 teaspoon",
    "celery seed",
    "3 teaspoons",
    "granulated garlic",
    "1 teaspoon",
    "ground cayenne pepper"
  ],
  "__v": 1
}