{
  "hash": "3462f0a1176f2c6fcbd4d3b135040d86cf5e9720",
  "title": "Plum Popsicles",
  "image": "http://static.theglobeandmail.ca/8c2/life/food-and-wine/recipes/article30221662.ece/ALTERNATES/w220/our-kitchen31lf1.JPG",
  "href": "http://www.theglobeandmail.com/life/food-and-wine/recipes/recipe-turn-plums-into-a-cool-summer-treat/article30221663/",
  "extension": "Chrome",
  "firstAdded": "2016-06-01T22:23:36.511000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the oven to 350 F.",
    "Place the plums cut side down on a cookie sheet and roast until the skins and flesh are slumped and softened, 20 to 40 minutes. Remove from the oven and let cool.",
    "Meanwhile, make the simple syrup. Combine sugar and water in a small saucepan. Simmer over medium heat and stir until the sugar dissolves. Add basil and simmer gently for 5 to 10 minutes. Let the herbs steep in the simple syrup while the mixture cools.",
    "Transfer the fruit (and all its syrup released onto the baking sheet) in the bowl of a food processor. Pulse until combined and smooth. The whipped-up plums will become frothy.",
    "Strain the basil out of the infused simple syrup, squeezing the herbs over the pan to extract all the juice. Transfer the pureed plums to a two-cup measuring cup with a spout. Stir in the simple syrup and lemon juice to combine. Taste the mixture and adjust if necessary. It should taste pretty sweet, as any sweetness dulls after the pops are frozen. Gently swirl in almost all of the yogurt, being careful not to mix too much for a stronger contrast in colour. (A sweeter vanilla yogurt helps ensure the pops are sweet enough.)",
    "Pour the mixture into ice pop moulds, leaving a bit of room at the top for the mixture to expand as it freezes, and stopping to swirl in a bit more yogurt here and there for more colour contrast in the pops. Insert sticks now if your mould has a top to hold them in place (if not, do so after about an hour or two) and freeze until the pops are solid, at least 4 to 5 hours. Release the pops by submerging the plastic mould part in warm water. Serve immediately or place individual pops in plastic bags and store in the freezer."
  ],
  "ingredients": [
    "0",
    "1 pound fresh red plums (3 to 4 large plums or 8 to 9 small ones), halved and pitted",
    "2/3cup sugar",
    "2/3 cup water",
    "2 to 3 sprigs fresh basil",
    "2 tablespoons freshly squeezed lemon juice",
    "1/2 cup vanilla yogurt"
  ],
  "__v": 1
}