{
  "hash": "04ad1cbabf4570a4ab58573eff7da577b10ae3cf",
  "title": "Speculaas Cookies {Free from: gluten, dairy, eggs, nuts, and refined sugar}",
  "image": "http://www.unconventionalbaker.com/wp-content/uploads/2015/12/speculaas-cookies-free-from-gluten-dairy-eggs-refined-sugar-rice-flour.jpg",
  "href": "http://www.unconventionalbaker.com/recipes/speculaas-cookies-gluten-free-dairy-free-egg-free-refined-sugar-free/",
  "extension": "",
  "firstAdded": "2015-12-30T12:45:41.553000",
  "users": [
    null
  ],
  "keywords": [
    "coconut",
    "oil",
    "softened",
    "agave",
    "sugar",
    "vanilla",
    "anise",
    "cinnamon",
    "cardamom",
    "ginger",
    "nutmeg",
    "white",
    "pepper",
    "salt",
    "mace",
    "brown",
    "rice",
    "flour",
    "arrowroot",
    "starch"
  ],
  "directions": [
    "0",
    "Preheat oven to 350F. Line a cookie sheet with parchment paper and set aside. Get 2 sheets of parchment for rolling and a rolling pin ready, as well as your stamp and a knife (if using; otherwise whatever cookie cutters you like).",
    "Whip coconut oil in a mixing bowl with a hand mixer to fluff it up a little. Add everything except rice flour and arrowroot, and mix once more into a uniform mixture. Add in the flour and arrowroot and use your hands to start mixing the mixture until you can lump it into a ball. If after kneading it a little it's too crumbly, add another ½ tbsp agave and knead into a ball then flatten into a disk.",
    "Roll out the dough into somewhere between ⅛\" and ¼\" thickness in between the two sheets of parchment (thinner -- crunchier, thicker -- softer cookies). Imprint the dough with the stamp (leave room between each imprint so they don't affect one another when you press into the dough to make more -- I can usually get about 4 prints in at this stage). Use a sharp knife to cut out the edges of the imprint into a square cookie shape. Use a wide spatula to carefully transfer the cookie onto your cookie sheet. Collect all dough scraps, roll out again, and repeat to create 2 more cookies.",
    "Bake in a pre-heated oven for 15 - 19 minutes (15 -- crunchy around the edges, but very soft in center, 19 -- very crunchy. You can also pick something in between :) ). Remove from oven and cool on a rack for at least 10-20 minutes (note: they will be soft when you pull them out, but will harden once they cool. Enjoy!"
  ],
  "ingredients": [
    "0",
    "2 tbsp coconut oil, softened (not melted)",
    "2½ tbsp agave",
    "2½ tbsp coconut sugar",
    "1 tsp pure vanilla extract",
    "¼ tsp pure anise extract",
    "1 tsp cinnamon",
    "¼ tsp of each: ground cardamom, ground ginger, ground nutmeg",
    "⅛ tsp of each: ground white pepper, salt",
    "1/16 tsp of each: mace, cloves",
    "12 tbsp white or brown rice flour",
    "3 tbsp arrowroot starch"
  ],
  "__v": 1
}