{
  "hash": "86cfcf53979f24335b36f7fd81c28b699bc058a3",
  "title": "Tacos al Pastor",
  "image": "https://patijinich.com/wp-content/uploads/2015/04/012716_PattiJ_S4_TacosPastor_030_Cropped-912x622.jpg",
  "href": "https://patijinich.com/recipe/tacos-al-pastor/",
  "extension": "Chrome",
  "firstAdded": "2017-10-29T11:48:18.685000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Marinate the meat in the adobo marinade for at least 3 hours, or up to 48 hours, in the refrigerator. Reserve 3/4 cup of marinade to brush on the pineapple before grilling/cooking and to finish off meat.",
    "When ready to make tacos, remove the meat from the refrigerator. Brush some of the reserved marinade on the pineapple slices. Reserve the remaining marinade.",
    "Heat a large heavy skillet over medium-high heat. Once hot, add a tablespoon of oil. Place as many pineapple slices as will fit on the skillet and sear for about 3 minutes per side, until juicy and lightly charred on both sides. Remove from heat. When cool enough to handle, cut the pineapple into thin slices about 1 to 2-inches long and 1/4-inch wide, removing the core. Place in a bowl and cover.",
    "Drizzle another tablespoon of oil onto the skillet. Lightly sprinkle the meat with salt to taste. Sear as many slices of meat as will fit in the pan, without over crowding, for about 2 minutes per side until browned on both sides. Cook in batches if necessary. Place the meat on a chopping board. Cut it crosswise into thin slices about 1/4-inch thick and 1-inch wide.",
    "Once done with all the meat, reduce the heat to medium, place the meat back in the skillet and pour the rest of the unused marinade on top. Stir and cook for another minute. Cover and set on the table.",
    "On a pre-heated cast iron skillet or comal set over medium heat, heat the corn tortillas 1 to 2 minutes per side until thoroughly cooked, lightly browned and crisp on the outside. Place them in a tortilla warmer and bring to the table along with the meat, pineapple, chopped cilantro, chopped onion, lime wedges, and salsa of your choice. Let everyone assemble their own tacos.",
    "Note: If you want to offer some “gringas,” heat flour tortillas on the comal and, once hot, add the melty cheese, fold, and let it melt as if it were a quesadilla. Once melted, re-open the tortilla, add a generous tablespoon or two of the sliced meat, fold again and serve."
  ],
  "ingredients": [
    "0",
    "3poundspork shoulder or butt,sirloin cutlets or butterfly chops, cut into 1/2-inch slices",
    "3cupsachiote adobo marinade",
    "Halfof a pineapple,peeled, cut into 1/2-inch slices",
    "2tablespoonsvegetable oildivided",
    "To tastekosher or coarse sea salt",
    "12 to 14corn tortillas(or flour tortillas to make them “gringas” style)",
    "Shredded queso asadero, Mexican Oaxaca or Chihuahua,or mozzarella, Monterey Jack, or any melty cheese of your choice (optional, for making them “gringas” style)",
    "1cupcilantroroughly chopped, to garnish",
    "1cupwhite onionroughly chopped, to garnish",
    "2limescut into quarters, to garnish",
    "Serve witha salsaof your choice"
  ],
  "__v": 1
}