{
  "hash": "1f537fe858c15549d61070571ef206e4b16c24c8",
  "title": "Basmati Rice Salad with Peas, Mint, and Lemon",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2014/05/basmati-rice-salad-peas-mint-vertical-b-640.jpg",
  "href": "https://www.simplyrecipes.com/recipes/basmati_rice_salad_with_peas_mint_and_lemon/",
  "extension": "",
  "firstAdded": "2018-01-28T20:27:44.377000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Cook the rice according to package instructions; include salt in the cooking water along with 2 strips of lemon zest.",
    "2 If using fresh peas, blanch them in boiling salted water for 3 to 4 minutes, depending on the size and freshness of the peas (larger older peas will take longer than smaller fresher peas). Strain peas from blanching water and place in a bowl of ice water to shock them and stop the cooking, then strain. If using frozen peas, they are already blanched, so defrost them by placing them in a strainer and running lukewarm water over them for a minute.",
    "3 Once the rice is cooked, spread the rice out on a large baking sheet pan to cool quickly. Let cool for 10 minutes, or until room temperature. Place in a large serving bowl.",
    "4 To the rice add the peas, raisins, green onions, mint, lemon zest, lemon juice, olive oil, and salt. Toss to combine and serve."
  ],
  "ingredients": [
    "0",
    "2 cups uncooked basmati rice (which will yield 5 to 6 cups cooked rice)",
    "3 cups water (or more, depending on the package instructions)",
    "1/2 teaspoon salt",
    "2 2-inch strips of fresh lemon zest (use a vegetable peeler to take just the zest, not the whole peel, off of a fresh lemon)",
    "2 cups shelled English peas (from about 1 1/2 to 2 pounds of shell-on peas), or 2 cups of frozen peas",
    "Salted water for blanching (1 quart water, 1 1/2 teaspoons salt)",
    "1/4 cup golden raisins or currants, plumped in enough water to cover the raisins for 5 to 10 minutes, then drained",
    "1/2 cup minced green onions, including the greens (about 2 green onions)",
    "1 1/2 teaspoons finely grated lemon zest",
    "1 teaspoon finely minced fresh mint leaves (spearmint)",
    "2 Tbsp lemon juice",
    "1/4 cup olive oil",
    "1/2 teaspoon salt"
  ],
  "__v": 1
}