{
  "__v": 1,
  "directions": [
    "0",
    "Preheat the oven to 375 degrees F.",
    "Peel the pears and slice them lengthwise into halves. With a small sharp paring knife and a melon baller, remove the core and seeds from each pear, leaving a round well for the filling. Trim a small slice away from the rounded sides of each pear half so that they will sit in the baking dish without wobbling. Toss the pears with some lemon juice to prevent them from turning brown. Arrange them, core side up, in a baking dish large enough to hold the pears snugly.",
    "Gently toss the crumbled blue cheese, dried cranberries, and walnuts together in a small bowl. Divide the mixture among the pears, mounding it on top of the indentation.",
    "In the same small bowl, combine the apple cider, port, and brown sugar, stirring to dissolve the sugar. Pour the mixture over and around the pears. Bake the pears, basting occasionally with the cider mixture, for 30 minutes, or until tender. Set aside until warm or at room temperature.",
    "Just before serving, whisk together the olive oil, 1/4 cup of lemon juice, and 1/4 cup of the basting liquid in a large bowl. Divide the arugula among 6 plates and top each with a pear half. Drizzle each pear with some of the basting liquid, sprinkle with salt, and serve warm."
  ],
  "firstAdded": "2014-04-17T23:32:04.411000",
  "hash": "235f5c2a1988f77b83fde88a3bcf60726526f947",
  "href": "http://www.foodnetwork.com/recipes/ina-garten/roasted-pears-with-blue-cheese-recipe.html",
  "image": "",
  "ingredients": [
    "0",
    "3 ripe but firm Anjou pears",
    "Freshly squeezed lemon juice (3 lemons)",
    "3 ounces coarsely crumbled sharp blue cheese such as Stilton",
    "1/4 cup dried cranberries",
    "1/4 cup walnut halves, toasted and chopped",
    "1/2 cup apple cider",
    "3 tablespoons port",
    "1/3 cup light brown sugar, lightly packed",
    "1/4 cup good olive oil",
    "6 ounces baby arugula",
    "Kosher salt"
  ],
  "keywords": [
    "firm",
    "anjou",
    "pears",
    "squeezed",
    "lemon",
    "juice",
    "lemons",
    "coarsely",
    "crumbled",
    "sharp",
    "blue",
    "cheese",
    "stilton",
    "cranberries",
    "walnut",
    "halves",
    "apple",
    "cider",
    "port",
    "light",
    "brown",
    "sugar",
    "lightly",
    "good",
    "olive",
    "oil",
    "baby",
    "arugula",
    "kosher",
    "salt"
  ],
  "title": "Roasted Pears with Blue Cheese",
  "users": [
    null
  ]
}