{
  "__v": 1,
  "directions": [
    "0",
    "Adjust oven racks to low and middle positions; heat oven to 350 degrees. In bowl of electric mixer or by hand, beat butter until creamy. Add sugars; beat until fluffy, about 3 minutes. Beat in eggs one at a time. ed.note: don't skimp on the time mixing the sugar and butter together. longer is better for these cookies. and make sure each egg is incorporated completely before adding the next",
    "Mix flour, salt, baking powder, and nutmeg together, then stir them into butter-sugar mixture with wooden spoon or large rubber spatula. Stir in oats and optional raisins.",
    "Form dough into sixteen to twenty 2-inch balls, placing each dough round onto one of two parchment paper–covered, large cookie sheets. Bake until cookie edges turn golden brown, 22 to 25 minutes. (Halfway during baking, turn cookie sheets from front to back and also switch them from top to bottom.) Slide cookies on parchment onto cooling rack. Let cool at least 30 minutes before serving."
  ],
  "firstAdded": "2014-11-13T18:55:39.440000",
  "hash": "cacfd5a9a9b721199d59225193061a499385907f",
  "href": "http://adirondackbaker.blogspot.com/2010/03/big-chewy-oatmeal-raisin-cookies-from.html?showComment=1415904915039",
  "image": "",
  "ingredients": [
    "0",
    "2 sticks (1/2 pound) unsalted butter, softened but still firm",
    "1 cup light brown sugar",
    "1 cup granulated sugar",
    "2 eggs",
    "1 1/2 cups all-purpose flour",
    "1/2 teaspoon salt",
    "1/2 teaspoon baking powder",
    "1/4 teaspoon freshly grated nutmeg (or a pinch of dried)",
    "1/2 teaspoon cinnamon",
    "3 cups rolled oats",
    "1 1/2 cups raisins (optional)"
  ],
  "keywords": [
    "unsalted",
    "butter",
    "softened",
    "firm",
    "light",
    "brown",
    "sugar",
    "granulated",
    "eggs",
    "allpurpose",
    "flour",
    "salt",
    "baking",
    "nutmeg",
    "cinnamon",
    "rolled",
    "oats",
    "raisins"
  ],
  "title": "BIG CHEWY OATMEAL RAISIN COOKIES",
  "users": [
    null
  ]
}