{
  "hash": "5c42b92e5ce002a4ba87b398820549d2e8e141f8",
  "title": "Stacked Tofu Enchiladas With Red Chile Sauce",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/stacked-tofu-enchiladas-with-red-chile-sauce",
  "extension": "Chrome",
  "firstAdded": "2017-07-01T01:55:17.187000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparation",
    "Preheat oven to 500°. Line a rimmed baking sheet with foil and coat with 1 Tbsp. oil.",
    "Holding a knife parallel to work surface, thinly slice each block of tofu into eight 1/4\"-thick slices and transfer to paper towels. Pat tofu dry; set aside.",
    "Place chiles in a medium heatproof bowl; cover with 2 cups boiling water. Let chiles soak until softened, about 15 minutes. Drain, reserving soaking liquid. Discard stems and seeds; place chiles in a blender. Add tomatoes, chopped onion, garlic, and 1 cup reserved soaking liquid; purée until smooth.",
    "Heat remaining 2 Tbsp. oil in a medium saucepan over medium-high heat. Add purée and bring to a boil. Reduce heat to medium and simmer, partially covered and stirring occasionally, until slightly thickened, about 15 minutes. Add more reserved soaking liquid if too thick. Stir in honey. Season to taste with salt.",
    "Transfer 1 tofu slice to prepared baking sheet and spoon 2 Tbsp. red chile sauce over. Top with another piece of tofu and spoon 2 Tbsp. more sauce over top. Repeat with remaining tofu and sauce to make 7 more enchiladas. Sprinkle about 2 Tbsp. cheese over each bundle and bake until cheese is melted, 2–3 minutes. Serve garnished with cilantro and minced onion."
  ],
  "ingredients": [
    "0",
    "Stacked Tofu Enchiladas With Red Chile Sauce",
    "Ingredients",
    "4 TO 6 SERVINGS",
    "3 tablespoons vegetable oil, divided",
    "2 16-ounces packages firm tofu, drained",
    "7 dried guajillo or red New Mexico chiles",
    "1 28-ounce can whole tomatoes, drained",
    "1 medium red onion, chopped, plus more, minced, for garnishing",
    "5 garlic cloves, chopped",
    "2 teaspoons honey or agave syrup (nectar)",
    "Kosher salt",
    "1 cup (approximately) shredded skim-milk mozzarella",
    "Chopped fresh cilantro"
  ],
  "__v": 1
}