{
  "hash": "e2d606154f7613f3207602b0a977e612519978eb",
  "title": "Romanian Eggplant Spread (Potlagel)",
  "image": "https://images.food52.com/aXBqFC2Ec3_HSFw9AIJbnhaoIYI=/753x502/f8259d19-303a-4538-b0d2-71f792227769--2018-1026_potlagel_3x2_mark-weinberg_312.jpg",
  "href": "https://food52.com/recipes/78157-great-great-grandma-anna-s-romanian-eggplant-spread-potlagel",
  "extension": "Chrome",
  "firstAdded": "2018-12-28T19:45:01.910000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "Heat the oven to 400°F. Line a baking sheet with parchment or a silicone mat. Place the eggplant and bell pepper on the lined sheet pan and prick both with a fork. Roast for 45 minutes to 1 hour, until the skin chars and the vegetables are very soft (I use a fork to check this). When done, remove the vegetables from the oven and immediately transfer to a large, heatproof bowl; cover with plastic wrap. Let sit for about 10 minutes—this helps the skin loosen, making it easier to peel. When the skin is loose and the vegetables have cooled a bit, use your fingers to peel away the skin. You want most of it gone but it doesn’t need to be perfect. Finely chop both the eggplant and bell pepper (my mom likes her potlagel super smooth, but I like mine a little chunkier). Add to a large bowl (you can use the same one you steamed in), along with the onion, garlic, olive oil, vinegar, and salt. Mix and taste. It probably needs more salt. Maybe some oil or vinegar, too? Refrigerate for at least an hour, though this is even better the next day. Taste again and adjust the seasoning again. We like to serve this with pita chips."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1\tlarge eggplant",
    "1\tyellow bell pepper",
    "1/2\tsmall yellow onion, minced (plus more if you're into onion, like me)",
    "2\tgarlic cloves, minced into oblivion",
    "2\ttablespoons extra-virgin olive oil, plus more to taste",
    "1\ttablespoon red wine vinegar, plus more to taste",
    "1\tpinch salt, plus more to taste"
  ],
  "__v": 1
}