{
  "hash": "31c71acbe21c4c359b754622b49e61c4daa9dc94",
  "title": "Eggs Benedict",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/anne-burrell/eggs-benedict-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-10-06T06:11:22.493000",
  "users": [
    null
  ],
  "keywords": [
    "white",
    "wine",
    "vinegar",
    "eggs",
    "extravirgin",
    "olive",
    "oil",
    "slices",
    "canadian",
    "bacon",
    "english",
    "muffins",
    "fork",
    "split",
    "hollandaise",
    "recipe",
    "follows",
    "mesclun",
    "juice",
    "lemon",
    "kosher",
    "salt",
    "unsalted",
    "butter",
    "peppercorns",
    "ice",
    "cubes",
    "needed",
    "egg",
    "yolks",
    "juiced",
    "cayenne",
    "pepper"
  ],
  "directions": [
    "0",
    "Fill a large, wide pot halfway with water and bring to a boil. Add the vinegar and reduce the heat until the water in the pan has no more bubbles.",
    "Very close to the surface of the water, crack the eggs and gently drop each egg into the water. Cook the eggs for 3 to 4 minutes. Using a slotted spoon, remove the eggs from the pan and place in a bowl of cold water. Reserve the eggs in the cold water and reserve the poaching liquid to reheat the eggs. Obviously, if you are poaching the eggs a day ahead you can reheat the eggs in new water!",
    "Coat a large saute pan lightly with olive oil and bring to a medium heat. Add the slices of Canadian bacon and cook them on both sides until they are hot but not brown.",
    "Toast the English muffins. Place 1 slice Canadian bacon on each English muffin.",
    "Warm up the egg poaching liquid (or a pan of new water if you poached ahead) and place the eggs in the water for 1 minute or until the eggs are warm but not cooking any further. Using a slotted spoon, remove the eggs from the warm water, blot on a clean paper or tea towel and place 1 egg on each English muffin. Top with the Hollandaise Sauce.",
    "Toss the mesclun with lemon juice, big fat finishing oil and salt. Garnish each plate with the dressed greens.",
    "Wine Pairing Suggestion: Prosecco",
    "In a small saucepan, melt the butter over medium heat. While the butter is melting, skim off the froth that accumulates on the surface. Simmer the butter for 15 to 20 minutes and gently ladle off the clear butterfat into a measuring cup or small pitcher with a spout. Be sure to leave the milk solids in the bottom of the pan. This is called clarified butter.",
    "In a small saute pan, combine the vinegar and peppercorns and cook over a medium heat until almost all the vinegar has evaporated. Remove the pan from the heat and toss a couple ice cubes into the pan and let them sit until they have melted.",
    "In a medium metal bowl, whisk the egg yolks until they become frothy and fluffy. Strain the peppercorn liquid into the egg mixture.",
    "Put 1-inch water into a medium saucepan and bring it to a simmer. Place the metal bowl on top of the saucepan and gently cook the eggs, whisking frequently, for 2 to 3 minutes.",
    "Very slowly begin to add the clarified butter. Start with 2 to 3 drops and continue with a couple more drops after the butter has incorporated. Continue to add a few drops of butter at a time. If the eggs seem to be cooking too quickly, pull the bowl off the saucepan and lower the heat. If the eggs start to curdle, toss in an ice cube immediately to cool down the eggs.",
    "Continue to add the butter a little at a time until it is all incorporated. The sauce should be fluffy and foamy.",
    "Once the butter is all combined, add the lemon juice and season the sauce with cayenne and salt.",
    "Serve over the poached eggs.",
    "Recipe courtesy of Anne Burrell"
  ],
  "ingredients": [
    "0",
    "1/4 cup white wine vinegar",
    "8 eggs",
    "Extra-virgin olive oil",
    "8 thick slices Canadian bacon",
    "4 English muffins, fork split",
    "Hollandaise Sauce, recipe follows",
    "4 cups mesclun mix",
    "Juice of 1/2 to 1 lemon",
    "Kosher salt",
    "4 sticks unsalted butter",
    "6 tablespoons white wine vinegar",
    "1 teaspoon crushed peppercorns",
    "Ice cubes, as needed",
    "6 egg yolks",
    "1 lemon, juiced",
    "Pinch cayenne pepper",
    "Kosher salt"
  ],
  "__v": 1
}