{
  "hash": "534d381e671a0e992d6b135f232d2114f39605a1",
  "title": "Cinnamon Sugar Pull-Apart Bread",
  "image": "",
  "href": "http://www.lepetitogre.com/2012/01/cinnamon-sugar-pull-apart-bread.html",
  "extension": "Chrome",
  "firstAdded": "2016-08-07T19:25:49.888000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large mixing bowl whisk together 2 cups flour, sugar, yeast, and salt. Set aside.",
    "Whisk together eggs and set aside.",
    "In a small saucepan, melt together milk and butter until butter has just melted. Remove from the heat and add water and vanilla extract. Let mixture stand for a minute or two, or until the mixture registers 115 to 125 degrees F.",
    "Pour the milk mixture into the dry ingredients and mix with a spatula. Add the eggs and stir the mixture until the eggs are incorporated into the batter. The eggs will feel soupy and it’ll seem like the dough and the eggs are never going to come together. Keep stirring. Add the remaining 3/4 cup of flour and stir with the spatula for about 2 minutes. The mixture will be sticky.",
    "Place the dough is a large, greased bowl. Cover with plastic wrap and a clean kitchen towel. Place in a warm space and allow to rest until doubled in size, about 1 hour. *The dough can be risen until doubled in size, then refrigerated overnight for use in the morning. If you’re using this method, just let the dough rest on the counter for 30 minutes before following the roll-out directions below.",
    "While the dough rises, whisk together the sugar, cinnamon and nutmeg for the filling. Set aside. Melt 2 ounces of butter until browned. Set aside. Grease and flour a 9x5x3-inch loaf pan. Set that aside too.",
    "Deflate the risen dough and knead about 2 tablespoons of flour into the dough. Cover with a clean kitchen towel and let rest for 5 minutes. On a lightly floured work surface, use a rolling pin to roll the dough out. The dough should be 12-inches tall and about 20-inches long. If you can’t get the dough to 20-inches long… that’s okay. Just roll it as large as the dough will go. Use a pastry brush to spread melted butter across all of the dough. Sprinkle with all of the sugar and cinnamon mixture.",
    "Slice the dough vertically, into six equal-sized strips. Stack the strips on top of one another and slice the stack into six equal slices once again. You’ll have six stacks of six squares. Layer the dough squares in the loaf pan like a flip-book. Place a kitchen towel over the loaf pan and allow in a warm place for 30 to 45 minutes or until almost doubled in size.",
    "Place a rack in the center of the oven and preheat to 350 degrees F. Place loaf in the oven and bake for 30 to 35 minutes, until the top is very golden brown. The top may be lightly browned, but the center may still be raw. A nice, dark, golden brown will ensure that the center is cooked as well.",
    "Remove from the oven and allow to rest for 20 to 30 minutes. Run a butter knife around the edges of the pan to loosen the bread and invert onto a clean board. Place a cake stand or cake plate on top of the upside down loaf, and carefully invert so it’s right side up. Serve warm with coffee or tea.",
    "This bread is best served the day it’s made, but it can also we wrapped and kept at room temperature for up to 2 days."
  ],
  "ingredients": [
    "0",
    "For the Dough:",
    "2 3/4 cups plus 2 tbsp all-purpose flour",
    "1/3 cup granulated sugar",
    "2 1/4 tsp (1 envelope) active dry yeast",
    "1 tsp salt",
    "2 ounces unsalted butter",
    "1/3 cup whole milk",
    "1/4 cup water",
    "2 large eggs, at room temperature",
    "1 tsp pure vanilla extract",
    "For the Filling:",
    "3/4 cup granulated sugar",
    "2 tsp ground cinnamon",
    "1/2 tsp fresh ground nutmeg",
    "2 oz unsalted butter, melted until browned"
  ],
  "__v": 1
}