{
  "hash": "f7d0b19b2ca9e5b97752e10b02b3df29bea2d453",
  "title": "Traditional Tamales (Pork)",
  "image": "http://img.sndimg.com/food/image/upload/w_555,h_416,c_fit,fl_progressive,q_95/v1/img/recipes/15/28/6/piccGbRM0.jpg",
  "href": "http://www.food.com/recipe/traditional-tamales-pork-15286",
  "extension": "Chrome",
  "firstAdded": "2016-10-20T13:06:11.495000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a 5 qt Dutch oven, bring pork, water, onion, garlic and 1 1/2 salt to boil.",
    "Simmer covered, about 2 1/2 hours or until meat is very tender.",
    "Remove meat from broth and allow both meat and broth to cool. (Chilling the broth will allow you to easily remove the fat if you desire to do so).",
    "Shred the meat using 2 forks, discarding fat.",
    "Strain the broth and reserve 6 cups.",
    "In a large sauce pan, heat the red chili sauce and add meat; simmer, covered for 10 minutes.",
    "To make masa beat shortening on medium speed in a large bowl for 1 minute.",
    "In a separate bowl, stir together masa harina, baking powder and 2 teaspoons salt.",
    "Alternately add masa harina mixture and broth to shortening, beating well after each addition. (Add just enough broth to make a thick, creamy paste).",
    "In the mean time, soak corn husks in warm water for at least 20 minutes; rinse to remove any corn silk and drain well.",
    "To assemble each tamale, spread 2 tablespoons of the masa mixture on the center of the corn husk (each husk should be 8 inches long and 6 inches wide at the top. If husks are small, overlap 2 small ones to form one. If it is large, tear a strip from the side).",
    "Place about 1 tablespoon meat and sauce mixture in the middle of the masa.",
    "Fold in sides of husk and fold up the bottom.",
    "Place a mound of extra husks or a foil ball in the center of a steamer basket placed in a Dutch oven.",
    "Lean the tamales in the basket, open side up.",
    "Add water to Dutch oven just below the basket.",
    "Bring water to boil and reduce heat.",
    "Cover and steam 40 minutes, adding water when necessary.",
    "To freeze these for future meals, leave them in the husks and place them in freezer bags. To reheat, thaw and wrap in a wet paper towel and reheat in the microwave for 2 minutes for one or two or re-steam them just until hot."
  ],
  "ingredients": [
    "0",
    "3 1⁄2 lbs pork shoulder or 3 1⁄2 lbs pork butt, trimmed of fat and cut up",
    "10 cups water",
    "1 medium onion, quartered",
    "3 garlic cloves, minced",
    "3 1⁄2 teaspoons salt",
    "4 cups red chili sauce (see Red Chili Sauce (To Be Used With Traditional Tamales) for red chili sauce)",
    "3⁄4 cup shortening",
    "6 cups masa harina",
    "1 1⁄2 teaspoons baking powder",
    "50 dried corn husks (about 8 inches long)"
  ],
  "__v": 1
}