{
  "hash": "3e2f392d6eb42cf628547d275df9a203c920b00e",
  "title": "weeknight carbonara: no bacon, loaded with greens",
  "image": "https://alexandracooks.com/wp-content/uploads/2017/10/bowlofpastahoriz.jpg",
  "href": "https://alexandracooks.com/2017/10/06/favorite-weeknight-meal-no-bacon-pasta-carbonara-loaded-greens/?ck_subscriber_id=384174529",
  "extension": "Chrome",
  "firstAdded": "2019-07-04T22:32:32.102000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Set a large pot of salted water (I use 1 tablespoon kosher salt) to boil. In a large skillet, heat the 2 tablespoons of olive oil over medium-high heat. When it shimmers, add the onion, immediately turn the heat down to medium, season with a pinch of kosher salt, and sauté stirring occasionally, until soft and just turning to color, 7 to 10 minutes. Meanwhile, transfer greens to a colander to drain—it’s OK if some of the water clings to the greens.",
    "Add a pinch of red pepper flakes to the onions and stir for 30 seconds. Add all of the greens. (Note: If you are using 2 lbs. of greens, you may have to add them incrementally to the pan.) Cook over medium to medium-high heat until greens shrink way down—use tongs to flip the greens around and help them wilt. Season with a pinch of salt. Turn off the heat.",
    "Add pasta to boiling water and cook according to package instructions. Reserve ½ cup (or more) of the pasta cooking liquid. In a medium bowl or liquid measure, whisk together eggs, parmesan, and juice. Whisk ¼ cup pasta water into egg mixture.",
    "Drain pasta and immediately add to the pan with the onions and greens. Pour egg mixture into pan and toss with tongs to combine, turning heat to low or medium if greens have cooled way down. Season with salt and pepper to taste. Taste. Add more lemon or more of the reserved pasta cooking liquid to taste. Sprinkle pasta with more cheese if desired and serve immediately."
  ],
  "ingredients": [
    "0",
    "Coarse salt and ground pepper",
    "2 tablespoon olive oil",
    "1 onion, peeled and thinly sliced",
    "pinch red pepper flakes",
    "1 to 2 pounds greens, soaked in water to allow dirt to settle",
    "1/2 to ¾ pound bucatini, linguini, or pappardelle",
    "2 large eggs",
    "¼ cup grated Parmigiano Reggiano, plus more for serving",
    "1 tablespoon fresh lemon juice plus more to taste"
  ],
  "__v": 1
}