{
  "hash": "47deea653374f788758afc356ee8b39817f7f34a",
  "title": "Cauliflower-and-Mushroom Roast",
  "image": "http://assets.marthastewart.com/styles/wmax-520-highdpi/d52/roasted-cauliflower-and-mushrooms-065-master-d113081/roasted-cauliflower-and-mushrooms-065-master-d113081_vert.jpg?itok=9iJkGS6S",
  "href": "http://www.marthastewart.com/1163533/cauliflower-and-mushroom-roast",
  "extension": "Chrome",
  "firstAdded": "2017-03-13T20:36:18.957000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 450 degrees with racks in upper and lower thirds. Brush cauliflower on both sides with 4 tablespoons oil; spread in a single layer on a rimmed baking sheet. Toss mushrooms with 3 tablespoons oil; spread on a second sheet. Toss bread with remaining 1 tablespoon oil. Season all with salt and pepper.",
    "Place cauliflower on top rack; roast 10 minutes. Add mushrooms on bottom rack; roast 15 minutes more. Flip cauliflower and mushrooms. Sprinkle bread over mushrooms; roast 10 minutes more. Remove from oven; transfer mushrooms and bread to sheet with cauliflower. Top with cheese; roast until melted and bubbly, 5 to 7 minutes more. Serve immediately."
  ],
  "ingredients": [
    "0",
    "Cauliflower-and-Mushroom Roast",
    "1",
    "We like to think of this recipe as a deconstructed, healthier grilled cheese. Cauliflower stands in as the base while the bread serves as a crunchy garnish.",
    "PREP: 25 MINS TOTAL TIME: 1 HOUR YIELD: SERVES 4 TO 6",
    "1.9 k",
    "SHARES",
    "PHOTOGRAPHY: BRYAN GARDNER",
    "SOURCE: MARTHA STEWART LIVING, OCTOBER 2016",
    "ON SALE",
    "What's on sale near to you",
    "Hmm. Looks like these ingredients aren't on sale today",
    "INGREDIENTS",
    "1 head cauliflower (about 3 pounds), trimmed and cut into 1-inch slices",
    "1/2 cup extra-virgin olive oil",
    "8 ounces shiitake mushrooms, stemmed, halved if large",
    "8 ounces cremini mushrooms, trimmed and cut into 1/4-inch slices",
    "2 slices rustic bread (each 1 inch thick), crusts removed, torn into small pieces (1 1/2 cups)",
    "Kosher salt and freshly ground pepper",
    "5 ounces Gruyere or fontina (or a combination), thinly sliced"
  ],
  "__v": 1
}