{
  "hash": "1b3d11310c58532406d990001227101252363117",
  "title": "Surprise Biscuits",
  "image": "http://www.vodkaandbiscuits.com/wp-content/uploads/2014/03/9.jpg",
  "href": "http://www.vodkaandbiscuits.com/2014/03/18/surprise-cheddar-biscuits/",
  "extension": "Chrome",
  "firstAdded": "2015-03-08T14:54:10.055000",
  "users": [
    null
  ],
  "keywords": [
    "purpose",
    "flour",
    "sugar",
    "baking",
    "salt",
    "soda",
    "unsalted",
    "butter",
    "cold",
    "cheddar",
    "cheese",
    "block",
    "chives",
    "plain",
    "greek",
    "yogurt",
    "eggs"
  ],
  "directions": [
    "0",
    "Preheat oven to 475",
    "Bring a pot of water to a boil. Add eggs and boil 4-5 minutes. Remove from heat and set aside.",
    "Cube butter and toss in the freezer until needed. Cold better works best for biscuits!",
    "Combine the flour, sugar, salt, baking powder, and baking soda in the bowl of a food processor. Pulse 1-2 times until combined.",
    "Drop in the COLD butter and pulse a few times until mixture is crumbly. Stop at this point - don't want to overmix!",
    "Add the cheese and pulse until just combined. Transfer into a bowl and gently fold in the chives.",
    "Stir the yogurt up and add to the mix. Combine with a rubber spatula until just combined.",
    "Spray a baking sheet with baking spray. Remove eggs from shells.",
    "Using roughly 1/4 c. of dough, shape into a biscuit and place onto baking sheet. Press a well into the center. Place the egg in the well sideways.",
    "Form another biscuit and place on top of the egg, forming the biscuit around the egg. Easily use extra dough to cover up the sides of the eggs.",
    "Bake for 5 minutes, then reduce the heat to 400 and bake another 6-7 minutes until golden brown.",
    "Top with melted butter and extra chives."
  ],
  "ingredients": [
    "0",
    "1 c. all purpose flour",
    "1 T. sugar",
    "1 1/2 t. baking powder",
    "1/2 t. salt",
    "1/2 t. baking soda",
    "2 T. unsalted butter - diced, cold",
    "1/2 c. cheddar cheese (shredded or block)",
    "2 T. chives - chopped",
    "6 oz. plain Greek yogurt",
    "2 eggs"
  ],
  "__v": 1
}