{
  "hash": "9e3cc850ba510110f92b9ea0de51e3f8e570369d",
  "title": "Cinnamon Roll Dippers (No Yeast)",
  "image": "http://lecremedelacrumb.com/wp-content/uploads/2013/11/cinnamon-roll-dippers-no-yeast-5b.jpg",
  "href": "http://lecremedelacrumb.com/2013/11/cinnamon-roll-dippers-yeast.html",
  "firstAdded": "2015-02-20T01:50:08.364000",
  "users": [
    null
  ],
  "keywords": [
    "flour",
    "sugar",
    "divided",
    "salt",
    "butter",
    "softened",
    "ice",
    "cold",
    "water",
    "cinnamon",
    "cream",
    "cheese",
    "vanilla",
    "milk",
    "brown"
  ],
  "directions": [
    "0",
    "Combine flour, 3 tablespoons sugar, and salt in a medium bowl and whisk to combine. Cut in ½ cup butter with pastry cutter or two forks until crumbly. Add 3 tablespoons ice cold water and mix to combine. Add more water 1 tablespoon at a time as needed until mixture comes together. Flatten dough into a round disk, wrap with plastic wrap, and chill 15 minutes or overnight.",
    "Preheat oven to 375 and grease a baking sheet with cooking spray.",
    "When dough has chilled, unwrap it and use a pizza cutter to cut into 1-1/2 inch strips. Place wtrips on prepared baking sheet. Use a rubber spatula to spread 1 tablespoon butter over the tops of the strips. Combine cinnamon and 1 tablespoon sugar in a small bowl and sprinkle mixture on top of buttered strips. Bake uncovered 12-14 minutes, until lightly browned.",
    "Prepare the glaze dip by combining softened cream cheese, powdered sugar, and vanilla in a bowl. Use a hand mixer to mix well. Add milk 1 teaspoon at a time until a smooth consistency is reached. In a small sauce pan combine brown sugar, butter, and cinnamon and whisk until butter melts and mixture is smooth. Drizzle cinnamon mixture into prepared glaze dip. Serve dippers warm or at room temp. Enjoy!"
  ],
  "ingredients": [
    "0",
    "1½ cups flour",
    "4 tablespoons sugar (divided)",
    "½ teaspoon salt",
    "½ cup butter, softened +1 tablespoon (divided)",
    "3-6 tablespoons ice cold water",
    "1 teaspoon cinnamon",
    "1",
    "2 ounces cream cheese, softened",
    "1½ cups powdered sugar",
    "¼ teaspoon vanilla",
    "milk",
    "3 tablespoons brown sugar",
    "3 tablespoons butter",
    "½ teaspoon cinnamon"
  ],
  "__v": 1
}