{
  "hash": "118f570a39fc7946a9e94d83ba147c0dd896ea37",
  "title": "Chinese Black Pepper Beef",
  "image": "https://www.chinasichuanfood.com/wp-content/uploads/2018/05/black-pepper-beef-stir-fry-7.jpg",
  "href": "https://www.chinasichuanfood.com/chinese-black-pepper-beef/",
  "extension": "Chrome",
  "firstAdded": "2018-08-25T23:10:19.551000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Cut the beef steak into 1cm wide strips. Marinate with all the marinating seasonings for 15 minutes.",
    "Add cooking oil in a large pan until the oil can evenly cover the bottom of the pan. spread the beef strips in. Let them stay for around 10 seconds and gently stir them several times until the beef strips change color. Transfer the beef out and leave around 1 tablespoon of the oil in.",
    "Fry garlic until aromatic. Fry green peppers and red onion until slightly soft. Add a small pinch of salt. Return beef strips back. Mix well. Spread freshly ground black pepper.",
    "Serve hot with noodles or steamed rice."
  ],
  "ingredients": [
    "0",
    "You are here: Home / Recipes / beef and lamb / Chinese Black Pepper Beef",
    "Chinese Black Pepper Beef",
    "May 31, 2018 18 Comments",
    "20 minutes quick Chinese style beef stir fried with black pepper, a very “Chinese” style stir-frying recipe using beef, onion, green peppers and ground black pepper.",
    "Black pepper sauce and beef have been the best partner worldwide. I love that uniform and mild thick black pepper sauce very much when eating beef steaks. However, a new rule is applied in this recipe. Beef is marinated with a relatively thick sauce. And black pepper is used at the very end of the stir-frying. We get a drier, cleaner and bouncing flavored black pepper and beef stir fry. It is just so amazing that we can create so many layers of flavors in a simple stir fry dish.",
    "Marinating play an extremely important role for tender meat. On one hand, beef absorb the taste and flavors in the marinating process, so it forms a very foundational flavor (底味). Then cornstarch is applied in order to keep the juice inside by forming a protecting shell. Vegetable oil is used at last as a protecting agent of the cornstarch. Adding cold vegetable oil in the beef can help to prevent the beef from sticking to the work, and further more prevent the marinating sauce and cornstarch separating from the meat. We call this as “脱浆”in Chinese.",
    "Cook’s Note",
    "The vegetable oil should be mixed just before frying. The cold oil will protect our sauces and starch.",
    "After spreading the beef strips to the pan, let them stay for around 5-6 seconds until the starch finish gelatinization, otherwise the marinating tissues might be separated from the meat. In addition, be gentle and quick in the whole process.",
    "If you use a larger pan, you may need more oil to cover the bottom. After frying the beef strips, transfer the extra oil out and leave any around 1 tablespoon of oil in to fry the onion and peppers.",
    "Ingredients",
    "200g beef steak, cut into small strips",
    "1 and 1/2 tbsp. oyster sauce",
    "1/2 tbsp. light soy sauce",
    "1/4 tsp. ground pepper",
    "1/4 tsp. sugar",
    "1/2 tbsp. Chinese cooking wine (Shaoxing wine)",
    "2 tsp. corn starch",
    "1 tsp. sesame oil",
    "vegetable cooking oil, as needed",
    "2 garlic cloves",
    "2 fresh green peppers, remove the seeds and finely shredded",
    "1/4 red onion, shredded",
    "freshly ground black pepper"
  ],
  "__v": 1
}