{
  "hash": "2715c35066c9d7a2159864668c0ba84b28851f54",
  "title": "best moroccan fish recipe",
  "image": "https://www.themediterraneandish.com/wp-content/uploads/2019/09/Moroccan-Fish-Recipe-3.jpg",
  "href": "https://www.themediterraneandish.com/moroccan-fish-recipe/?utm_source=The+Mediterranean+Dish+Recipe+Updates&utm_campaign=7b25b1d720-Grilled+Lamb+Leg+with+Mint+Pesto_COPY_01&utm_medium=email&utm_term=0_a5845beec1-7b25b1d720-511166561",
  "extension": "Chrome",
  "firstAdded": "2020-04-01T00:39:02.004000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large pan with cover, heat 2 tbsp extra virgin olive oil (I used Private Reserve) over medium heat until shimmering but not smoking.",
    "Add minced garlic and cook very briefly, tossing regularly, until fragrant. Add tomato paste, diced tomato, and bell peppers. Cook for 3 to 4 minutes over medium heat, tossing frequently.",
    "Now, add chickpeas, water, cilantro, and sliced garlic. Season with kosher salt and pepper. Stir in 1/2 tsp Ras El Hanout spice mixture. Raise heat, if needed, and bring to a boil. Lower heat. Cover part-way and let simmer for about 20 minutes. (Check occasionally and add a little water if needed.)",
    "Meanwhile, in a small mixing bowl, combine remaining Ras El Hanout with cumin and paprika. Season the fish with kosher salt and pepper and the spice mixture on both sides. Add a generous drizzle of extra virgin olive oil. Work the fish to make sure it’s well coated with the spices and the olive oil.",
    "When ready, add the season fish to the pan, and make sure to nestle the fish pieces into the saucy chickpea and tomato mixture. Ladle a bit of the sauce on top of the fish. Add lemon juice and lemon slices. Cook another 10 to 15 minutes over medium-low until the fish is fully cooked and flaky. Garnish with more fresh cilantro.",
    "Serve immediately with your favorite crusty bread, grain, or rice."
  ],
  "ingredients": [
    "0",
    "Extra Virgin Olive Oil (I used Private Reserve EVOO)",
    "8 garlic cloves, divided (4 minced cloves and 4 sliced)",
    "2 tbsp tomato paste",
    "2 medium tomatoes, diced",
    "1 red pepper, cored, sliced",
    "1 15-oz can chickpeas, drained and rinsed",
    "1 1/2 cup water",
    "Large handful fresh cilantro (about 1 cup fresh cilantro)",
    "Kosher salt and black pepper",
    "1 1/2 tsp Ras El Hanout, divided",
    "1 1/2 lb cod fillet pieces (about 1/2 inch in thickness)",
    "3/4 tsp paprika",
    "1/2 tsp cumin",
    "Juice of 1/2 lemon",
    "1/2 lemon, sliced into thin rounds"
  ],
  "__v": 1
}