{
  "hash": "ba631047ac12e1dd8de580587f2dd1df6b4bfdb0",
  "title": "Gyoza",
  "image": "http://recipe-folder.com/img/recipe-images/014/605/2777583314.jpg",
  "href": "http://recipe-folder.com/recipe/5b50b79752855f3235561f81",
  "extension": "User Added",
  "firstAdded": "2018-07-19T16:08:55.278000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the Pork Dumplings",
    "1",
    "Blend together pork, cabbage, garlic, ginger, soy sauce and sugar. Fry a small patty in a pan to test for seasoning, then adjust to taste.",
    "2",
    "Brush the outside 1/2 of one side of a won ton skin with water and place a teaspoon full of the meat mixture in the centre.",
    "3",
    "Fold over the won ton skin to make a half circle shaped dumpling and press the edges to make a sealed seam.",
    "4",
    "Place the dumpling seam-up on a parchment paper-lined tray and lightly press down to make the bottom surface flat. Keep both the won ton skins and the finished dumplings covered to prevent them from drying while you work.",
    "5",
    "Once the tray is full, cover with plastic wrap and freeze for several hours. When the dumplings are frozen remove from the tray and store in freezer bags until ready to use.",
    "6",
    "These will last 3 months in the freezer.",
    "7",
    "Once you are comfortable with filling and folding, try to make several decorative “pleats” on the seam by pinching the won ton skin with your thumbs.",
    "8",
    "For the Basic Dipping Sauce for Gyoza",
    "9",
    "Pour ingredients into a shallow dish and present with the finished dumplings.",
    "10",
    "For the cooking",
    "11",
    "Heat oil in a non-stick sauté pan and place frozen gyoza flat side down to brown slightly.",
    "12",
    "Add hot water to almost cover the dumplings, cover and cook until water evaporates.",
    "13",
    "Remove the lid now and then and gently shake the pan. Cooking time will be around 7 minutes."
  ],
  "ingredients": [
    "0",
    "For the Pork Dumplings",
    "1",
    "1 pound regular ground pork",
    "2",
    "1 pound green cabbage, finely chopped",
    "3",
    "2 tablespoons garlic, minced",
    "4",
    "2 tablespoons ginger, minced",
    "5",
    "1/4 cup soy sauce",
    "6",
    "1 tablespoon sugar",
    "7",
    "2 packages round Won Ton skins, 60 pc",
    "8",
    "For the Basic Dipping Sauce for Gyoza",
    "9",
    "2 tablespoons soy sauce",
    "10",
    "1 tablespoon rice wine vinegar",
    "11",
    "1/4 teaspoon sesame oil",
    "12",
    "For the cooking",
    "13",
    "1 teaspoon vegetable oil",
    "14",
    "12 gyoza",
    "15",
    "Hot water",
    "16",
    "Basic dipping sauce for gyoza"
  ],
  "__v": 1,
  "hidden": true
}