{
  "hash": "d760680408f6bba60115224d58cd019fb6bbed0a",
  "title": "Cinnamon roll in a mug",
  "image": "",
  "href": "http://recipe-folder.com/recipe/5b07f40f2269a46331a757ac",
  "extension": "User Added",
  "firstAdded": "2018-05-25T11:31:27.225000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    ") Combine all the cake ingredients into a microwave-safe mug. This is a smaller cake, so using an 8 oz mug should be fine. Whisk with a small whisk until batter is smooth and no lumps remain.",
    "1",
    "In a separate small bowl, combine cinnamon swirl ingredients. Microwave briefly, about 20-30 seconds, or until butter melts. (I recommend covering top with paper towel before microwaving.) Stir and mix until it becomes a uniform, thick syrup. Pour into a small liquid container that has a narrow pouring spout.",
    "2",
    ")Working quickly (you don't want the butter to cool as your swirl will become hard to pour), scoop out half of the cake batter and set aside. Pour a swirl into the remaining batter in the mug. (If you are having issues pouring a swirl, you can also use a fork or whisk and draw in the swirl. Just lift the utensil from the syrup a few times until you have a single stream before drawing your swirl.) Pour the rest of the batter back in, making sure to cover the cinnamon swirl completely. Pour another cinnamon swirl on top. It's okay if you still have a little leftover of the cinnamon mix.",
    "3",
    ") Cook cake in microwave for about 1 minute until cake parts are completely cooked. The butter from the cinnamon swirl might separate slightly during cooking which will cause the cinnamon swirl to be a little gooey and wet but it'll solidify and sink in as the cake cools.",
    "4",
    ") While cake is cooking, make the frosting. In a medium bowl, add ingredients. Warm in microwave slightly, about 10 seconds. Make sure to cover bowl with paper towel before heating. Using a really good whisk (I used a bigger one than the one for the mug cake batter), whisk until uniform and frosting thickens. Scoop frosting into a piping bag and pipe frosting onto cake. You should have enough to frost two cakes. You can save the remaining for another time."
  ],
  "ingredients": [
    "0",
    "Cake:",
    "1",
    "4 tbsp all purpose flour",
    "2",
    "3 tsp granulated white sugar",
    "3",
    "1/4 tsp baking powder",
    "4",
    "1/8 tsp cinnamon",
    "5",
    "1/16 tsp nutmeg",
    "6",
    "3 tbsp fat free milk",
    "7",
    "1/2 tbsp vegetable oil",
    "8",
    "Cinnamon swirl",
    "9",
    "1 1/2 tbsp brown sugar",
    "10",
    "1/8 tsp cinnamon",
    "11",
    "1/2 tbsp butter",
    "12",
    "Frosting (makes enough for 2)",
    "13",
    "1/2 tbsp butter",
    "14",
    "1 tbsp cream cheese",
    "15",
    "2 - 2 1/2 tbsp powdered sugar",
    "16",
    "Note: For this recipe, I deliberately kept it small since there's so much sugar and calories in the cinnamon swirl and frosting. But if you wanted to, you could make a giant one by doing 1 1/2 times the recipe and cook it in a really wide mug or ramekin (that holds at least 12 oz), which will make it come out looking like a giant cinnamon roll (like the one in the close-up photos and background)."
  ],
  "__v": 1,
  "hidden": true
}