{
  "hash": "f6e8fe58584227d799601ae8573c0006fd7df68a",
  "title": "Lemony Pasta with Mushrooms and Fried Kale",
  "image": "http://noteatingoutinny.com/wp-content//uploads/16366513799_5a9d197bac_z.jpg",
  "href": "http://noteatingoutinny.com/2015/02/17/lemony-pasta-with-mushrooms-and-fried-kale/",
  "extension": "Firefox",
  "firstAdded": "2016-12-28T21:57:45.076000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make sure the kale is completely dry after rinsing. Strip the thick stems from the centers of the leaves by holding at the base and pulling outward. Tear the kale into roughly uniform pieces no longer than 3″ long.",
    "Bring a pot of generously salted water to a boil and drop in the pasta. Cook according to the package’s instructions and drain, reserving 1/2 cup of the cooking liquid.",
    "In a wide pan, heat the olive oil over medium-high heat. Set a plate aside for transferring the kale leaves and use tongs (or chopsticks!). Once the oil is hot enough to create loud pops and splatters once a kale piece is placed in, add about half the kale. Stir briskly and remove from the pan after about 20 seconds. Repeat with the remaining kale and set aside.",
    "Reduce heat to medium and add the sliced mushrooms and garlic to the same pan of oil. Stir briskly, seasoning with salt and pepper, until the mushrooms are lightly browned, about 1-2 minutes. Transfer from the pan and set aside.",
    "Combine the cooked pasta with the mushroom-garlic mixture and reserved pasta liquid over medium-low heat. Continue stirring, adding salt and pepper to taste, and squeeze in the lemon juice. Remove from heat. Crumble about half the fried kale leaves and stir into the pasta. (Stir in the optional butter if desired.) Transfer to serving plates. Top each plate with the remaining fried kale, crumbled, the lemon zest, and the optional grated cheese and serve immediately."
  ],
  "ingredients": [
    "0",
    "1/2 lb dry pasta (any shape)",
    "1 bunch kale (preferably lacinato or “dinosaur” kale)",
    "1/3 cup extra-virgin olive oil",
    "2 cloves garlic, sliced",
    "about 12 oz. fresh mushrooms, such as crimini, trimmed and sliced",
    "1-2 teaspoons fresh lemon juice",
    "about 1/4 teaspoon fresh lemon zest, shaved",
    "salt and pepper to taste",
    "1 tablespoon butter (optional)",
    "1/4 cup grated parmiggiano-reggiano or other hard-aged Italian cheese, grated (optional)"
  ],
  "__v": 1
}