{
  "hash": "d35a1da3d955aa7470a17fbd41092425a048c93d",
  "title": "Chiles Rellenos",
  "image": "https://patijinich.com/wp-content/uploads/2015/04/chile-rellenos-912x622.jpg",
  "href": "https://patijinich.com/recipe/chiles-rellenos/",
  "extension": "Chrome",
  "firstAdded": "2017-10-29T12:10:45.237000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To prepare the poblano chiles for stuffing: Place chiles on a tray under the broiler, directly on the grill, or directly over the open flame. I prefer to broil them. Whatever method you choose, turn them every 2 to 3 minutes for a total of 6 to 9 minutes. They must seem charred and blistered on the outside, while the flesh must be cooked but not burnt. Place them immediately in a plastic bag, close it tightly and let them sweat for 10 to 20 minutes. Lastly, under a thin stream of cold water, remove the charred skin, which should come right off. Make a slit down one side of the pepper and remove the cluster of seeds and veins. Once cleaned, pat them dry.",
    "Stuff each of the poblano chiles with about 1/2 cup grated cheese, or as much as will fit, allowing them to close. You may seal with a toothpick. Place 1/2 cup flour on a plate, roll the stuffed chiles in the flour and let them sit. The flour coating will help the batter coat and stay on the chiles.",
    "To prepare the batter: In a stand mixer, beat the egg whites until they hold stiff peaks. Gently, on low speed, fold in the egg yolks and only beat enough so that they are incorporated, a few seconds.",
    "To cook the chiles: In a large casserole, heat about 1/2-inch of oil over medium to medium-high heat. Once hot, test the oil, by dipping a teaspoon of batter into the oil; if there are active bubbles all around it, it’s ready. Dip each of the stuffed and floured chiles into the egg batter, making sure that they are entirely covered in batter.",
    "In batches, place them in the hot oil without overcrowding, trying to have the side that was open or sealed with the toothpick facing up. Spoon some of the hot oil on top, so that it will seal the chile. Fry for about 2 minutes per side, flipping genly with a slotted spoon, until golden brown. Transfer to a paper-towel covered drying rack or platter.",
    "Heat the salsa roja. Serve the chiles with a generous amount of salsa roja spooned on top. Alternatively, you can place the chiles in a casserole and top with the heated salsa roja. Eat while hot and melty!"
  ],
  "ingredients": [
    "0",
    "6 to 8poblano chiles(about 2 pounds)",
    "1batchred sauceor salsa roja",
    "3 to 4cupsgrated melty cheese such as Monterey Jack, mozzarella or Muenster",
    "4eggsseparated",
    "1/2cupall-purpose flour",
    "Vegetable oil for frying"
  ],
  "__v": 1
}