{
  "hash": "e087792057a964c73a98904fa752189c2eb4f705",
  "title": "ROSEMARY OLIVE OIL CROCK POT BREAD, TAKE 2! PLUS A RECIPE FOR OLIVE OIL HERB DIP",
  "image": "http://hostthetoast.com/wp-content/uploads/2014/10/Rosemary-Olive-Oil-Crock-Pot-Bread3.jpg",
  "href": "http://hostthetoast.com/rosemary-olive-oil-crock-pot-bread-take-2-plus-recipe-olive-oil-herb-dip/",
  "extension": "Chrome",
  "firstAdded": "2018-10-09T17:23:45.121000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large bowl, mix together the water, yeast, and sugar. Let sit 10 minutes. The mixture should become bubbly.",
    "Stir in half of the salt (1/2 teaspoon), half of the rosemary (2 tablespoons), the 3 tablespoons of extra virgin olive oil, and all of the flour. Mix until fully combined. Work it together with your hands, if necessary.",
    "Lightly grease a large bowl and place the dough in. Cover it with a kitchen towel and leave the dough in a warm, draft-free area. Let it sit and rise for 1 hour.",
    "Remove the dough from the bowl and gently roll it into a ball on a floured surface. Let it sit for another 20 minutes.",
    "Set the crock pot to high. Line the crock pot with two pieces of parchment paper, leaving at least 2 inches hanging out of each side of the crock pot. Place the dough in the crock pot and sprinkle it with the remaining salt and rosemary.",
    "Drape paper towels over the top of the crock pot and then place the lid on. This should capture any moisture that would sit on the lid and prevent it from dripping back onto your bread.",
    "Cook the bread for 2 hours, and remove from the crock pot. It will most likely still be a bit pale on the outside. It tastes great this way, but I like to put mine on a baking sheet lined with parchment paper and put it under the broiler for a quick few minutes to get a crunchier, darker crust. Watch the bread the whole time to ensure that it does not burn.",
    "Let cool before slicing. As the bread cools, combine all of the dip ingredients in a bowl or dish and mix well. Serve the bread warm with the Olive Oil Herb Dip!"
  ],
  "ingredients": [
    "0",
    "3½ cups all purpose flour",
    "1 packet dry active yeast (2¼ teaspoons)",
    "1¼ cups warm water",
    "¼ cup fresh rosemary, chopped, divided",
    "3 tablespoons extra virgin olive oil, plus more for drizzling",
    "1 teaspoon sugar",
    "1 teaspoon sea salt or kosher salt, divided"
  ],
  "__v": 1
}