{
  "__v": 1,
  "directions": [
    "0",
    "Heat the butter in a large skillet (I used non-stick) over medium-high heat. Add the shrimp and cook for 2 to 3 minutes, turning them over halfway through, until fully cooked. Remove to a plate and set aside.",
    "Add the onion and garlic to the skillet and stir to cook for 2 minutes. Sprinkle the curry powder over the onions and continue cooking the onions, stirring, for another couple of minutes. Reduce the heat to medium-low and pour in the coconut milk, stirring to combine. Add honey, salt, and lime juice, and allow the sauce to heat up until bubbling gently. Add shrimp into the sauce, tossing to coat, and allow it to simmer for 2 to 3 minutes or until slightly thickened. Taste the sauce and add more salt, lime juice, or honey depending on your taste. Stir in the basil. (Add hot sauce if you want a little kick.)",
    "Serve shrimp and sauce over a bed of cooked basmati rice, garnishing with more basil. Delicious!"
  ],
  "firstAdded": "2014-07-22T21:20:29.409000",
  "hash": "2215e29532f0d50a409becdadd3afd0063ab2cc9",
  "href": "http://thepioneerwoman.com/cooking/2014/07/coconut-curry-shrimp/",
  "image": "http://tastykitchen.com/recipes/wp-content/uploads/sites/2/2014/07/coconut-420x279.jpg",
  "ingredients": [
    "0",
    "2 Tablespoons Butter",
    "1-1/2 pound Peeled And Deveined Raw Shrimp (I Used U10, But Any Size Is Fine)",
    "1 whole Medium Onion, Finely Diced",
    "4 cloves Garlic, Minced",
    "1 Tablespoon Curry Powder",
    "1 can (13 1/2 Oz. Size) Coconut Milk (I Used \"A Taste Of Thai\" Brand)",
    "2 Tablespoons Honey, More To Taste",
    "1/4 teaspoon Kosher Salt (more To Taste)",
    "1 whole Lime, Juiced",
    "Hot Sauce, Optional",
    "12 whole Basil Leaves, Chopped, Plus More For Garnish",
    "2 cups Basmati Rice--cooked According To Package Directions"
  ],
  "keywords": [
    "butter",
    "raw",
    "shrimp",
    "used",
    "size",
    "medium",
    "onion",
    "garlic",
    "curry",
    "coconut",
    "milk",
    "thai",
    "brand",
    "honey",
    "kosher",
    "salt",
    "lime",
    "juiced",
    "hot",
    "basil",
    "leaves",
    "basmati",
    "ricecooked",
    "according",
    "directions"
  ],
  "title": "Coconut Curry Shrimp",
  "users": [
    null
  ]
}