{
  "hash": "8ae2ed8326af7077ac2c5389c8fae4611fd85502",
  "title": "Pie Maker Vegemite Beef Pies",
  "image": "http://recipe-folder.com/img/recipe-images/087/308/3135433487.jpg",
  "href": "https://www.taste.com.au/recipes/vegemite-beef-pies/CUvFUXZm?r=recipes/piemakerrecipes&c=ca2j8u1x/Pie%20maker%20recipes",
  "extension": "Chrome",
  "firstAdded": "2020-04-02T23:28:30.398000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat 30ml oil in a saucepan over medium-high heat. Add half the beef and cook for 4-5 minutes until browned all over. Transfer to a heatproof bowl. Heat 30ml oil in pan and repeat browning process with remaining beef. Transfer to the heatproof bowl.",
    "Add remaining 1 tbs oil and reduce heat to medium. Add onion, carrot and celery, and cook for 2-3 minutes. Add garlic and rosemary, and cook for a further 1 minute or until aromatic. Add the tomato paste, Vegemite and 2 cups (500ml) water. Cook, scraping the bottom of the pan with a wooden spoon, until combined. Return the meat and any resting juices to the pan. Bring to a simmer, then reduce heat to low, cover and simmer for 45 minutes or until beef is tender. Add flour and cook for 2-3 minutes or until thickened slightly. Set beef mixture aside to cool slightly, then chill until completely cool.",
    "Preheat oven to 180C (160C fan-forced). Grease a 12-hole muffin pan and line the bases with baking paper.",
    "Using an 11cm pastry cutter, cut 12 rounds from shortcrust pastry sheets. Using an 8cm pastry cutter, cut 12 rounds from puff pastry sheets. Line holes of prepared muffin pan with shortcrust pastry rounds. Divide meat mixture among pastry cases. Brush edges of shortcrust pastry with water and place puff pastry rounds over meat mixture. Using a fork, crimp pastry edges to seal and brush pies with egg. Bake for 35 minutes or until golden.",
    "Meanwhile, for the Vegemite tomato sauce, combine Vegemite with tomato sauce in a bowl and whisk to combine.",
    "Transfer pies to a serving platter. Serve with Vegemite tomato sauce."
  ],
  "ingredients": [
    "0",
    "80ml extra virgin olive oil",
    "750g beef chuck steak, cut into 2cm pieces",
    "1 small onion, finely chopped",
    "1 small carrot, finely chopped",
    "1 celery stalk, finely chopped",
    "2 garlic cloves, crushed",
    "1 tablespoon chopped rosemary leaves",
    "2 tablespoons tomato paste",
    "2 tablespoons Vegemite",
    "2 tablespoons plain flour",
    "2 sheets frozen shortcrust pastry, thawed",
    "2 sheets frozen puff pastry, thawed",
    "1 egg, lightly whisked"
  ],
  "__v": 2
}