{
  "hash": "2d921a7dca2c98a5e8533366b26f3f0cbd05fe85",
  "title": "Simple White Wine Sangria",
  "image": "https://www.thespruceeats.com/thmb/RecCL8tmAKyoC96Tfc3NphBfvP4=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/simple-white-wine-sangria-recipe-3511043-10_preview-5b04200643a1030037af2ed2.jpeg",
  "href": "https://www.thespruceeats.com/simple-white-wine-sangria-recipe-3511043",
  "extension": "Chrome",
  "firstAdded": "2018-07-08T17:43:59.975000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "How to Make It",
    "Pour the wine into a pitcher.",
    "Squeeze the juice from the citrus wedges into the wine. Toss in the wedges after removing the seeds, if possible.",
    "Add the brandy and orange juice if you're using them as well as the sugar.",
    "Stir very well to ensure that all of the sugar is dissolved.",
    "Chill overnight to marry all of the flavors.",
    "Add the ginger ale or club soda just before serving so the sangria retains its sparkle.",
    "If you'll be serving the sangria right away, use chilled white wine and serve it over lots of ice. Preparing any sangria the night before is preferred. You'll notice a significant difference in the flavor because all of the individual flavors develop into a single, multi-dimensional flavor. This complexity is the signature of a well-made sangria and why we love this punch so much.",
    "Choose Your Wine",
    "A white wine sangria gives you many options to choose from and it's hard to choose a wine that doesn't work. A few of the favorite styles for this recipe include Sauvignon Blanc, Chardonnay, Riesling, Albarino, Gewurztraminer, Viognier, and Pinot Gris.",
    "Choose Your Fruit",
    "The citrus fruits included in the recipe are essential to creating a basic sangria. You can add to the flavor with any of variety of fruits. Scan the produce market, choose the best fruits of the season, and have fun with different combinations.",
    "In total, you should need only 1 or 2 cups of additional fruit. Two mangoes, apples, or papaya or one pineapple should give you plenty of fruit to work with. A small crate of each berry is perfect and you'll probably have leftovers to serve as finger food.",
    "Choose Your Soda",
    "Even the soda can be customized to your taste. Club soda produces a clean tasting sparkle while ginger ale is a nice option when you want to add a little sweetness. You might even split the pour for one of those and add a cup of your favorite citrus-flavored soda.",
    "Add Some Booze",
    "Many Sangria recipes include a small amount of liquor along with the wine.",
    "This recipe recommends brandy as an option and this is an excellent way to add to the flavor."
  ],
  "ingredients": [
    "0",
    "What You'll Need",
    "25 ounces/750mL white wine (1 bottle)",
    "2/3 cup white sugar",
    "3 oranges, cut into wedges (or 1 cup orange juice)",
    "1 lemon (cut into wedges)",
    "1 lime (cut into wedges)",
    "Optional: 2 ounces brandy",
    "2 cups (1/2 liter) ginger ale or club soda"
  ],
  "__v": 1
}