{
  "hash": "84c49ab7faa76e4f552e1f89d4bb0aad48cad3b5",
  "title": "Portobello Mushroom Stack",
  "image": "https://www.traderjoes.com/TJ_CMS_Content/Images/Recipe/334MainImage.jpg",
  "href": "https://www.traderjoes.com/recipes/dinner/portobello-mushroom-stack",
  "extension": "",
  "firstAdded": "2018-04-30T12:35:53.979000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 425 degrees.",
    "Arrange mushrooms stem side down on a foil-lined baking sheet. Brush 1 tablespoon of olive oil all over each mushroom then season with salt and pepper.",
    "On a separate foil-lined baking sheet, arrange asparagus. Drizzle with 1 tablespoon of olive oil then season with salt and pepper. Toss veggies to coat evenly. Set aside.",
    "Place mushrooms on the center rack of the oven and roast for 25 minutes.",
    "After 15 minutes of roasting, flip the mushrooms. Place the tray of asparagus on the bottom rack and roast with the mushrooms for the last 10 minutes.",
    "Meanwhile, in a medium sauce pan over medium heat, add crumbled polenta and 1/4 cup of water. Break up polenta with a spoon and stir until the mixture is smooth. Heat until bubbly, about 5 minutes. Remove from heat and set aside.",
    "Heat 1 tablespoon of olive oil in medium pan on medium heat. Saute sliced red onions until caramelized, about 5 minutes. Remove from heat and set aside.",
    "Remove mushrooms and asparagus from oven, and slice asparagus spears into thirds.",
    "Assemble your stacks. In order, evenly divide the following ingredients among 4 small plates, a bed of polenta, ricotta, sliced asparagus, portobello mushroom, pesto, caramelized onions and top with sun-dried tomatoes.",
    "Serve immediately and enjoy!"
  ],
  "ingredients": [
    "0",
    "4 TJ's Portobello Mushrooms (2 packages), stemmed",
    "6 Tbsp TJ's 100% Kalamata Olive Oil, divided",
    "1/4 teaspoon TJ's Sea Salt, or to taste",
    "1/4 teaspoon TJ's Ground Black Pepper, or to taste",
    "1 package (about 15-20 spears) TJ's Asparagus, bottoms trimmed",
    "1 package TJ's Polenta, crumbled",
    "1/4 cup Water",
    "1/2 TJ's Red Onion, sliced thin",
    "1/2 cup TJ's Ricotta",
    "4 Tbsp TJ's Genova Pesto",
    "4 Tbsp TJ's Sun-dried Tomatoes"
  ],
  "__v": 1
}