{
  "hash": "c63c99fb28c49a00fe3bd013e4af77550b475331",
  "title": "Mozzarella Stuffed Zucchini Fritters (Gluten Free)",
  "image": "https://theloopywhisk.com/wp-content/uploads/2018/07/Mozzarella-Stuffed-Zucchini-Fritters_730px-featured-300x300.jpg",
  "href": "https://theloopywhisk.com/2018/07/24/mozzarella-stuffed-zucchini-fritters/",
  "extension": "Chrome",
  "firstAdded": "2018-10-06T11:42:34.892000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Coarsely grate the zucchini, then place it in a sieve above a bowl and allow some of the excess liquid to drain away. To speed up this process, press onto the grated zucchini with a spoon or spatula. You should get ~1 cup of drained water/liquid.",
    "Add the thyme, salt, pepper, nutmeg and eggs. Mix well.",
    "Add the gluten free flour, xanthan gum and baking powder. Mix well until no flour clumps remain. If the mixture is too liquidy, add more gluten free flour (1 tbsp at a time).",
    "Heat up a large non-stick skillet/pan until very hot, then add 1 - 2 tbsp of oil of choice. Scoop 1/4 cup of the zucchini fritter batter into the pan, add a slice of mozzarella on top and cover it with another 1/4 cup of the batter, making sure the cheese is completely covered.",
    "Cook the fritters until the underside is deep golden brown, about 2 minutes. Flip and cook on the other side for a further 2 minutes.",
    "Serve immediately, with a dollop of yoghurt (greek yoghurt, or a soy alternative with a squeeze of lemon juice work wonderfully!), a sprinkling of chopped parsley, or a side of salad.Enjoy the cheesy goodness!"
  ],
  "ingredients": [
    "0",
    "2 large or 3 medium zucchini (~750 g)",
    "5 - 10 sprigs thyme, leaves only and chopped (or ~ 1 - 2 tsp dried thyme)",
    "1/4 tsp salt",
    "pinch of pepper",
    "pinch of nutmeg",
    "2 eggs",
    "1 - 1 1/4 cup (120 - 150 g) gluten free flour",
    "1/4 tsp xanthan gum",
    "1 tsp baking powder",
    "1 ball (125 g) mozzarella cheese, cut into 8 slices (if you want the fritters to be even more cheesy, you can use 2 balls of mozzarella cheese, each cut into 4 slices - but you might get some cheese leaking out of the fitter during frying)",
    "olive, coconut or vegetable oil for frying"
  ],
  "__v": 1
}