{
  "hash": "787d37f0ee7b8b9bb8a55d283dea385990fc187b",
  "title": "Chocolate Turkish Coffee Cake",
  "image": "http://prodstatics3cdn1.tastingtable.com/images/articles/2013_04/CRE42_0413turkcake_549x305.jpg",
  "href": "http://www.tastingtable.com/entry_detail/chefs_recipes/13393/Chocolate_Turkish_Coffee_Cake_Recipe.htm?utm_medium=email&utm_source=national&utm_campaign=Sleeper_Hit_2015_03_30&utm_content=Dining_dedicated",
  "extension": "Chrome",
  "firstAdded": "2015-03-30T21:26:05.888000",
  "users": [
    null
  ],
  "keywords": [
    "bittersweet",
    "chocolate",
    "dark",
    "brown",
    "sugar",
    "espresso",
    "pomegranate",
    "molasses",
    "kosher",
    "salt",
    "allpurpose",
    "flour",
    "dutch",
    "processed",
    "cocoa",
    "cardamom",
    "baking",
    "soda",
    "eggs",
    "granulated",
    "cream",
    "warmed"
  ],
  "directions": [
    "0",
    "Make the cake: Preheat the oven to 350°. Lightly coat a 9-inch cake pan with nonstick pan spray. Set the pan on top of a sheet of parchment paper. Trace a circle around the pan, cut out the circle, and place it inside the cake pan. Turn the circle over so both sides are lightly greased. To a microwave-safe medium-size bowl, add the chocolate and microwave until the chocolate is melted, stirring every 20 seconds, for 1 to 1½ minutes total (take care not to overheat the chocolate or it will turn grainy). To the chocolate, whisk in the oil, dark brown sugar, espresso, pomegranate molasses and salt.",
    "Sift the flour, cocoa powder, cardamom, baking powder and baking soda together through a fine-mesh sieve set over a medium bowl.",
    "In the bowl of a stand mixer fitted with the whisk attachment, beat the eggs on medium speed until foamy, about 30 seconds. With the mixer running, slowly add the granulated sugar. Once it is added, increase the mixer speed to high and continue to whip until the mixture is very thick and creamy and drips from the whisk in thick ribbons, about 3 minutes. Add the chocolate-espresso mixture and beat until well combined. Remove the mixer bowl from the stand and fold in the flour mixture. Pour the cake batter into the prepared cake pan. Bake until the cake springs back when pressed lightly, about 30 to 35 minutes.",
    "While the cake bakes, make the ganache: To a microwave-safe bowl, add the chocolate and microwave until the chocolate is melted, stirring every 20 seconds, for about 1 to 1½ minutes total. To the melted chocolate, add the warm cream and the pomegranate molasses and gently stir until smooth. Set the ganache aside at room temperature to cool and thicken.",
    "Remove the cake from the oven and cool for 15 minutes, then invert it onto a wire rack and let it cool completely. Peel the parchment circle from the cake, then invert it onto a cake plate and spoon the ganache over the cake, using the back of a spoon to create soft peaks and to push the ganache over the edges (if the ganache is still too soft to hold peaks, refrigerate it for 10 minutes, then gently stir). Slice the cake into wedges and serve immediately, or refrigerate until completely chilled, then slice and serve cold (or let the cake stand at room temperature for 20 minutes before slicing and serving)."
  ],
  "ingredients": [
    "0",
    "5 ounces bittersweet chocolate, finely chopped",
    "¼ cup dark brown sugar",
    "2 tablespoons ground espresso",
    "2 tablespoons pomegranate molasses",
    "½ teaspoon kosher salt",
    "3 tablespoons all-purpose flour",
    "2 tablespoons Dutch processed cocoa powder",
    "2 teaspoons ground cardamom",
    "½ teaspoon baking powder",
    "¼ teaspoon baking soda",
    "6 large eggs",
    "½ cup granulated sugar",
    "6 ounces bittersweet chocolate, finely chopped",
    "⅓ cup heavy cream, warmed",
    "1 teaspoon pomegranate molasses"
  ],
  "__v": 1
}