{
  "hash": "a31393625b2162acfed8fd566d301f3793d89e24",
  "title": "4 proste sposoby na biały lukier",
  "image": "",
  "href": "http://to-tylko-blog.blog.pl/2016/03/24/4-proste-sposoby-na-bialy-lukier-doskonaly-do-ciast-ciastek-piernikow-paczkow-itd/",
  "extension": "",
  "firstAdded": "2016-09-22T15:27:57.879000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Z okazji zbliżających się świąt, zapewne wiele osób zacznie przygotowywać się do swoich wypieków. Jakaś część z was będzie poszukiwać przepisów, najlepiej łatwych, na np. lukier do wykończenia mazurka, sernika czy też babki. Ja dzisiaj przygotowałam na tę okoliczność specjalny post, w którym przedstawię wam 4 sposoby na wykonanie lukru. Tradycyjnie możecie użyć miksera do zmiksowania składników (na najniższych obrotach) ale jeśli jesteście już znudzeni ciągłym myciem części miksera wystarczy, że użyjecie zwykłej łyżki i gwarantuję, że lukier będzie tak samo udany. Pamiętać należy aby cukier puder był bez grudek co ułatwi wam wykonanie tego zadania. No to przejdźmy do lukrowania"
  ],
  "ingredients": [
    "0",
    "1.Lukier ze śmietaną",
    "Składniki:",
    "2 łyżki gęstej śmietany",
    "5 łyżek cukru pudru",
    "Śmietanę podgrzać dosypać lukier i dokładnie go rozmieszać. Polać ciasto – gotowe :)",
    "2. Lukier cytrynowy",
    "1-2 łyżki soku z cytryny",
    "1 szklanka cukru pudru",
    "Cukier puder wsypać do miski, dolać sok cytrynowy, dokładnie energicznie wymieszać. Polać ciasto – gotowe :)",
    "3. Lukier królewski",
    "2 łyżki białka od jajka",
    "1 szklanka cukru pudru",
    "Cukier wsypać do miski, dodać białko, dokładnie energicznie wymieszać , najlepiej drewnianą pałką do ucierania ciast. Polać ciasto – gotowe :)",
    "4. Lukier aromatyczny",
    "1-2 łyżki ciepłej wody",
    "1 szklanka cukru pudru",
    "kilka kropli dowolnego aromatu do ciast (olejku)",
    "Cukier wsypać do miski, dolać wodę i aromat, dokładnie energicznie wymieszać. Polać ciasto – gotowe :)",
    "W każdej opcji lukru podaję przybliżone ilości składników. Jeśli po wymieszaniu składników lukier jest zbyt gęsty dodajemy po kilka kropli płynu i odwrotnie jeśli lukier jest zbyt rzadki dodajemy po odrobinie cukru pudru.",
    "Uwaga ! do sklejania chatek, choinek z pierników lepszy jest lukier gęściejszy, do polania babek nieco rzadszy"
  ],
  "__v": 1
}