{
  "hash": "73917b416bb9d59256257d4f903dc912244a2ffa",
  "title": "Quick Cinnamon Rolls",
  "image": "https://images.media-allrecipes.com/userphotos/560x315/5698694.jpg",
  "href": "https://www.allrecipes.com/recipe/241917/quick-cinnamon-rolls/",
  "extension": "Chrome",
  "firstAdded": "2018-12-09T00:29:03.420000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400 degrees F (200 degrees C). Brush a 9-inch square baking dish with 2 tablespoons melted butter.",
    "Whisk flour, 2 tablespoons white sugar, baking powder, and salt together in a large bowl. Work 3 tablespoons softened butter into flour mixture using your hands. Beat milk and egg together in another bowl; pour into flour-butter mixture and stir with a rubber spatula until a soft dough forms.",
    "Turn dough out onto a floured work surface and roll dough into a 1/4-inch thick rectangle. Brush surface of dough with 2 tablespoons melted butter.",
    "Whisk 1/2 cup white sugar, brown sugar, and cinnamon together in a small bowl. Sprinkle 1/2 of the cinnamon sugar mixture in the bottom of the prepared baking dish. Sprinkle remaining cinnamon sugar over butter-brushed dough. Roll dough around filling to form a log; cut log into 18 rolls and place rolls in the prepared baking dish.",
    "Bake in the preheated oven until rolls are set, 20 to 25 minutes.",
    "Beat confectioners' sugar, cream cheese, 1/4 cup softened butter, and vanilla extract together in a bowl until frosting is smooth. Top hot cinnamon rolls with cream cheese frosting."
  ],
  "ingredients": [
    "0",
    "1/4 cup butter, divided",
    "Dough:",
    "2 cups all-purpose flour",
    "2 tablespoons white sugar",
    "2 teaspoons baking powder",
    "1 teaspoon salt",
    "3 tablespoons butter, softened",
    "3/4 cup milk",
    "1 egg",
    "1",
    "Filling:",
    "1/2 cup white sugar",
    "1/2 cup brown sugar",
    "1 tablespoon ground cinnamon",
    "Cream Cheese Frosting:",
    "1 cup confectioners' sugar (optional)",
    "4 ounces cream cheese, softened (optional)",
    "1/4 cup butter, softened (optional)",
    "1/2 teaspoon vanilla extract (optional)"
  ],
  "__v": 1
}