{
  "hash": "b8850782d5882f18796fba7692869afb6b5db920",
  "title": "Cake Batter Monster Cookie Sandwiches",
  "image": "https://farm4.staticflickr.com/3857/14789981937_14b2ca912e_m.jpg",
  "href": "http://beyondfrosting.com/2014/08/20/cake-batter-monster-cookie-sandwiches/",
  "extension": "Chrome",
  "firstAdded": "2016-09-22T21:51:02.149000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350° F.",
    "Soften butter in the microwave 10-15 seconds. Combine butter with both light brown sugar and granulated sugar. Mix until smooth and mixture becomes fluffy.",
    "Add egg and vanilla and butter extract and beat until egg is thoroughly incorporated.",
    "In a separate bowl, combine flour, dry cake mix, oats, salt and baking soda. Slowly add flour mixture to dough batter while mixing at a low speed.",
    "Once all the flour has been added, increase speed to medium until dough forms. Add sprinkles, MnMs and mini chocolate chips.",
    "Spoon 2 tablespoons of dough onto a cookie sheet lined with a baking mat.",
    "Bake for 12-14 minutes at 350°F. Remove from oven and allow to cool for several minutes before transferring to a wire rack to cool.",
    "1",
    "Allow butter to soften for about 30 minutes. Or soften in the microwave for 10-15 seconds.",
    "Whip butter with a paddle attachment on medium speed until light and fluffy.",
    "Slowly add powdered sugar 1 cup at a time. Frosting will become thick. After 2 cups of powdered sugar have been added, add 1 tablespoon of milk. Beat until smooth.",
    "Add remaining powdered sugar, followed by remaining milk and vanilla extract. Whip until smooth.",
    "To assemble the cookies, simply use a piping bag or Ziploc bag and cut of the tip of the bag. Swirl the frosting on one side of the cookie. Place a second cookie on top and gently press down. Then you can roll the edges in more sprinkles."
  ],
  "ingredients": [
    "0",
    "1 C (2 sticks) Unsalted butter",
    "1 C Sugar",
    "¾ C Brown sugar",
    "2 Large Eggs",
    "2 tsp Vanilla extract",
    "2 tsp Butter extract",
    "1 ½ C Flour",
    "1 C Dry yellow cake mix",
    "2 C Quick oats",
    "1 tsp Salt",
    "1 tsp Baking soda",
    "½ C Mini chocolate chips",
    "1 C Birthday Cake MnMs",
    "¾ C Sprinkles",
    "1",
    "1 C (2 sticks) Unsalted butter",
    "4 C Powdered sugar",
    "2 tsp Vanilla extract",
    "2 tbsp Milk or heavy cream",
    "Additional Sprinkles"
  ],
  "__v": 1
}