{
  "hash": "354d0f73ea80a2d4c3730f3f7294b7bb3a30b8ce",
  "title": "Roasted Peppers Stuffed with Goat Cheese",
  "image": "http://clv.h-cdn.co/assets/cm/15/09/54eb52cce6d2b_-_roasted-peppers-kitchen-garden-recipes-0412-xln.jpg",
  "href": "http://www.countryliving.com/food-drinks/recipes/a3811/roasted-peppers-stuffed-goat-cheese-recipe-clv0412/?zoomable",
  "extension": "Chrome",
  "firstAdded": "2016-02-01T00:19:46.440000",
  "users": [
    null
  ],
  "keywords": [
    "sheepnose",
    "pimento",
    "peppers",
    "tips",
    "techniques",
    "golden",
    "raisins",
    "boiling",
    "water",
    "maldon",
    "salt",
    "black",
    "pepper",
    "mild",
    "soft",
    "goat",
    "cheese",
    "coach",
    "farm",
    "basil",
    "leaves",
    "pine",
    "nuts",
    "breadcrumbs",
    "extravirgin",
    "olive",
    "oil",
    "cayenne"
  ],
  "directions": [
    "0",
    "Directions",
    "Roast peppers directly under broiler or over an open flame, turning frequently until blistered and blackened on all sides, 6 to 8 minutes. Place in a large bowl, cover tightly with plastic wrap, and let sit for 15 minutes to steam. When cool enough to handle, use a paring knife to peel off skin. Slit each pepper down one side. Remove stem and seeds.",
    "Meanwhile, preheat oven to 475 degrees F and position a rack in the upper third of oven. In a small bowl, combine raisins and boiling water. Let sit for 5 minutes, then drain and set aside.",
    "Place peppers, peeled sides down, on a cutting board and press lightly to flatten. Sprinkle with sea salt and black pepper. Divide goat cheese into eighths and shape each into a log about 2 1/2 inches long. Place each log on top of a pepper. Sprinkle cheese with three-quarters of basil, then pine nuts and reserved raisins. Fold each pepper over (like a canoe on its side) to sandwich the cheese, basil, nuts, and raisins. Press down gently to flatten.",
    "Place peppers on a baking pan. Sprinkle with breadcrumbs and drizzle with olive oil. Sprinkle with cayenne, if desired. Bake peppers until breadcrumbs are golden, about 10 minutes. Garnish with remaining basil. Drizzle with about 2 tablespoons olive oil, if desired."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "8 ‘Sheepnose Pimento’ sweet peppers (see Tips & Techniques)",
    "1 oz. golden raisins",
    "1 c. boiling water",
    "2 tsp. Maldon sea salt",
    "1 tsp. Freshly ground black pepper",
    "8 oz. mild soft goat cheese, such as Coach Farm",
    "12 tbsp. basil leaves",
    "2 oz. pine nuts",
    "2 tbsp. breadcrumbs",
    "¼ c. extra-virgin olive oil",
    ".13 tsp. cayenne pepper (optional)"
  ],
  "__v": 1
}