{
  "hash": "016ed1171665f006b360fc229338e1767a624d8d",
  "title": "Cheesy Potato Mash",
  "image": "http://www.recipe30.com/wp-content/uploads/2016/10/potato-mashed-848x477.jpg",
  "href": "http://www.recipe30.com/potato-mash.html/",
  "extension": "Chrome",
  "firstAdded": "2017-04-07T18:02:14.753000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Wash and peel potatoes, trim off any eyes or unsightly bits.",
    "Rinse under cold water.",
    "Place in steamer and cook for 30-40 min or until tender. (boil in water in you don’t have a steamer)",
    "Peel and grate the garlic into a saucepan.",
    "Add the cream to saucepan.",
    "Add a sprinkle of nutmeg (not much)",
    "Season with salt and pepper.",
    "Add the fresh thyme or dried.",
    "Bring to the boil gently, leave to simmer 2 minutes and turn off (be careful it doesn’t over boil).",
    "Preheat the oven to 200ºC – 400ºF",
    "Check to see if your potatoes are cooked, place a knife through one it should feel tender.",
    "If cooked, remove from steamer and place through a ricer or use a potato masher.",
    "Season potatoes with salt and pepper (taste later that it’s well seasoned).",
    "Melt the butter in microwave or on stove top.",
    "Add butter to potato mash and mix well so all the butter is blended into mash.",
    "Place potato mash into an oven proof dish, and flatten using a fork.",
    "Take an egg, separate the yolk from the white and place the yolk into the cream. Remove any fresh thyme and whisk until mixed.",
    "Grate the cheese.",
    "Pour all the cream mixture over potato mash.",
    "Top with all the grated cheese.",
    "Bake in oven at 200ºC – 400ºF for 20 minutes",
    "Optional, chop the parsley and sprinkle over potato mash.",
    "Best to wait 30 minutes before serving to allow it to cool down."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "4 or 5 large potatoes (30oz - 850g)",
    "1 sprig of fresh thyme (or one tsp dried)",
    "1 garlic clove",
    "Nutmeg",
    "1 cup heavy cream",
    "50g - 2oz butter",
    "70g - 2.5oz cheddar cheese",
    "Salt and pepper",
    "Optional Italian parsley (flat leaf)"
  ],
  "__v": 1
}