{
  "hash": "52e8a3c6c1929bf63a4cad037befce845a8f698a",
  "title": "MOIST VEGAN CARROT CAKE WITH LEMON BUTTERCREAM FROSTING",
  "image": "https://lovingitvegan.com/wp-content/uploads/2016/04/Vegan-Carrot-Cake-13.jpg",
  "href": "https://lovingitvegan.com/vegan-carrot-cake-lemon-buttercream-frosting/",
  "extension": "Chrome",
  "firstAdded": "2017-08-30T13:48:39.678000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "METHOD",
    "Preheat the oven to 350 degrees fahrenheit (180 degrees celsius).",
    "Grease two 7 inch cake tins and line the bottoms with parchment paper.",
    "Sift the flour, baking powder, baking soda, salt, cinnamon and nutmeg into a mixing bowl.",
    "Add the grated carrot and the brown sugar.",
    "Prepare the flax eggs, by mixing 2 Tbsp Flaxseed Meal with 6 Tbsp Water and allowing to sit for a minute.",
    "In the meantime, add the oil, vanilla and apple cider vinegar to the mixing bowl.",
    "Add the flax eggs.",
    "Mix everything together in the mixing bowl.",
    "*If your batter is too dry at this point (and only if it's too dry to mix) then add in a little non-dairy milk, only as much as you need to get the batter to a wet enough consistency so that it can mix properly.",
    "Lastly add the chopped walnuts if you want to add them.",
    "Divide the mixture between the two 7 inch cake tins.",
    "Place into the oven for 30 minutes or until a toothpick inserted into the center comes out clean.",
    "Allow the cakes to cool completely on a cooling rack.",
    "While the cakes are cooling, prepare your frosting.",
    "Add the powdered sugar, vegan butter, vanilla, apple cider vinegar and 3 Tbsp of lemon juice to an electric mixer bowl.",
    "Start mixing on low speed.",
    "If your frosting is too thick then add in more lemon juice a drop at a time as needed to get your frosting mix to the perfect consistency. If your frosting ends up too thin, add more powdered sugar.",
    "Add frosting to the top of one of the layers.",
    "Add the other layer on top and complete the frosting of the top and sides of the cake.",
    "Sprinkle crushed walnuts on top of the cake and serve."
  ],
  "ingredients": [
    "0",
    "For the Carrot Cake:",
    "2 cups (250g) All Purpose Flour",
    "1 tsp Baking Powder",
    "1 tsp Baking Soda",
    "½ tsp Salt",
    "2 tsp Cinnamon",
    "1 tsp Nutmeg",
    "9 oz (250g) Grated Carrot",
    "1.5 cups (300g) Brown Sugar",
    "2 Flax Eggs",
    "½ cup (120ml) Olive Oil",
    "1 tsp Vanilla",
    "1 Tbsp Apple Cider Vinegar",
    "1 cup Chopped Walnuts (Optional)",
    "For the Lemon Buttercream Frosting:",
    "3 and ¾ cups (450g) Powdered (Confectioners) Sugar",
    "3 Tbsp Vegan Butter",
    "1 tsp Vanilla",
    "2 tsp Apple Cider Vinegar",
    "3-4 Tbsp Fresh Lemon Juice"
  ],
  "__v": 2
}