{
  "hash": "7857a610ef4d113e1e24789c278bc192fc9f5a36",
  "title": "Eggplant, Prosciutto, & Pesto Pressed Picnic Sandwiches",
  "image": "http://i2.wp.com/hostthetoast.com/wp-content/uploads/2014/05/5-9-14-285.jpg?zoom=2&resize=670%2C1012",
  "href": "http://hostthetoast.com/eggplant-prosciutto-pesto-pressed-picnic-sandwiches/",
  "extension": "Chrome",
  "firstAdded": "2015-07-05T16:53:26.460000",
  "users": [
    null
  ],
  "keywords": [
    "basil",
    "leaves",
    "parmesan",
    "cheese",
    "allergic",
    "pine",
    "nuts",
    "try",
    "walnuts",
    "almonds",
    "sunflower",
    "seeds",
    "garlic",
    "kosher",
    "salt",
    "olive",
    "oil",
    "red",
    "bell",
    "pepper",
    "eggplant",
    "lengthwise",
    "slices",
    "brushing",
    "soft",
    "goat",
    "mozzarella",
    "prosciutto",
    "loaf",
    "ciabatta"
  ],
  "directions": [
    "0",
    "First, make the pesto. In a food processor, combine the basil, Parmesan, pine nuts, garlic, and kosher salt. Pulse until well-mixed. Slowly pour the olive oil into the food processor as it is running, and continue to run until the pesto comes together. Set aside.",
    "Preheat the grill to high. Grill the bell pepper, turning frequently, until blackened on all sides. Remove from the grill, place in a bowl, and cover tightly with plastic wrap for 15 minutes. After 15 minutes, peel the skin from the pepper, rinse, pull out the stem and seeds, and cut into strips.",
    "As you wait for the pepper to be ready, brush the sliced eggplant with oil, sprinkle with salt and pepper, and grill over medium-high until cooked through, about 4 minutes per side.",
    "Spread the pesto on one of the pieces of bread, and goat cheese on the other. Layer on the prosciutto, roasted red peppers, mozzarella, and eggplant, and then sandwich the two pieces together.",
    "Press down on the sandwich, and then wrap tightly with plastic wrap. Weigh down with a heavy object and let sit in the fridge for at least 2 hours, or overnight.",
    "When ready to serve or pack, unwrap the sandwich and cut off the very ends and sides to make them even. Then, cut the sandwich into mini sandwiches (I usually wind up with about 10 per loaf).",
    "Wrap the sandwiches to keep them together while traveling, if necessary, and serve at room temperature."
  ],
  "ingredients": [
    "0",
    "2 cups fresh basil leaves",
    "⅓ cup Parmesan cheese",
    "⅓ cup pine nuts (Allergic to pine nuts? Try walnuts, almonds, or sunflower seeds!)",
    "3 cloves garlic",
    "½ teaspoon kosher salt",
    "¼ cup olive oil",
    "1",
    "1 red bell pepper",
    "1 eggplant, cut lengthwise into ¼ inch thick slices",
    "Olive oil, for brushing",
    "Kosher salt and freshly ground pepper, to taste",
    "4 oz soft goat cheese",
    "½ lb fresh mozzarella cheese, cut into thick slices",
    "⅓ lb sliced prosciutto",
    "1 loaf ciabatta, sliced in half"
  ],
  "__v": 1
}