{
  "hash": "28fa6da4d673b7b27c0511b373ef95acba025f93",
  "title": "Buche de Noel\n(The French name for a delicious, festive and traditional Yule Log Cake served during the holidays in several European countries.)",
  "image": "",
  "href": "http://katu.com/amnw/am-northwest-cooking-recipes/simply-deliteful-yule-log-cake-buche-de-noel",
  "extension": "Chrome",
  "firstAdded": "2017-12-07T03:51:05.100000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium microwave safe bowl, combine sweetened condensed milk and chocolate chips. Microwave for 45 seconds. Stir and then return to microwave for 25 second increments till chocolate melts and blends smoothly with condensed milk. Cool slightly. Frost cake",
    "Preheat oven to 350°. Coat an 18x13\" rimmed baking sheet with nonstick spray. Line bottom with parchment paper. Place a large kitchen towel (it should be larger than baking sheet) on a flat surface. Dust towel with powdered sugar with a fine-mesh sieve.",
    "Prepare angel food cake mix according to package directions, adding almond extract. (Or make the cake from scratch, if you prefer.)",
    "Scrape batter into prepared baking sheet; smooth top (you want to have an even layer). Bake until top of cake is dry and springs back when gently pressed and edges are starting to pull away from sides of baking sheet, 10?12 minutes; let cool.",
    "Run a knife along the edge of baking sheet to loosen and invert cake onto prepared towel. Peel away parchment and roll cake from long side, into a log inside towel. Transfer, seam side down, to a wire rack and let sit until ready to assemble. Be sure it is completely cool",
    "Spread chocolate filling mixture over top of cake, leaving a 1\" border. Sprinkle chopped nuts (if using,) evenly over the filling. Roll up cake and using a serrated knife, carefully cut 3 inch piece from end of cake. From one end of that piece, cut off 1-2 inch piece on a diagonal and set aside (or give as a taste to the kids or others watching!). Place the cake roll, seam side down on an oblong platter. Position the large portion of that section that was cut, on the side of cake to create a branch, leaving the spiral exposed.",
    "Using an offset spatula or butter knife, spread the top and side of the cake and branch with the chocolate frosting, using the knife or spatula to create a bark texture. Sprinkle with chopped almonds (or other nuts) if using, and chocolate curls, over the whole surface. The frosting sets quickly, so you may want to do this in small sections.",
    "Chill at least 3 hours. Before serving, dust lightly with powdered sugar for a look of fallen snow. Decorate with marzipan mushrooms and silk holly leaves or evergreen, if using. Cut in 1” slices to serve."
  ],
  "ingredients": [
    "0",
    "Cake:",
    "One Angel Food Cake mix (or one from-scratch recipe if you prefer)",
    "1 teaspoon almond extract",
    "Powdered sugar for coating towel and to garnish finished cake",
    "1 1/2 cup chopped almonds (or other nuts you prefer) divided between sprinkling the filling and to sprinkle on the frosted completed cake: Optional",
    "Chocolate bar, made into curls using a vegetable peeler.",
    "Marzipan candy dough for mushrooms (optional)",
    "Cocoa powder to dust mushrooms if making",
    "Filling:",
    "2 packages instant chocolate pudding",
    "1 2/3 cups fat free 1/2 & 1/2",
    "1 teaspoon almond extract",
    "1-8 oz tub fat free whipped topping, thawed",
    "In a medium bowl, combine pudding mix and milk or 1/2 &1/2. Mix slowly to combine for 30 seconds, then mix on medium speed for 2 minutes. (Mixture will be quite thick.) Carefully, fold in whipped topping to combine completely. Set aside in refrigerator.",
    "Frosting:",
    "2 cups semi sweet chocolate chips",
    "1-14 oz can fat free sweetened condensed milk",
    "When cake is cooled and filled:"
  ],
  "__v": 1
}