{
  "hash": "3362042e97680cb21a3541a629b7973addf5bd42",
  "title": "Chicken Madeira (Cheesecake Factory Copycat)",
  "image": "",
  "href": "http://www.chewoutloud.com/2015/05/13/chicken-madeira-cheesecake-factory-copycat-2/",
  "extension": "Chrome",
  "firstAdded": "2017-06-18T22:11:35.821000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Flatten chicken breasts to an even ¼-inch thickness throughout. Lightly sprinkle both sides of each chicken breast with kosher salt and black pepper. In a large skillet, heat 3 TB olive oil over medium heat until hot. Place chicken breasts in skillet, without overcrowding (if needed, cook them in two separate batches.) Cook 3-4 minutes per side, until nicely browned on both sides and no longer pink in center. Transfer cooked chicken to a baking pan and cover to keep warm.",
    "In the same skillet (don't wash out the skillet) add 2 TB olive oil over medium heat until oil is hot. Add mushrooms and stir 1-2 min. Add the remaining sauce ingredients. Stir and bring sauce to a boil. Immediately reduce heat to a simmer. Simmer 20 minutes or until sauce is reduced by one-fourth of its original volume. Finished sauce will be dark brown and thickened. Transfer sauce to a container and keep warm.",
    "Sprinkle mozzarella cheese evenly on top of chicken breasts on baking pan. Broil 3-4 minutes or until cheese is golden and melted.",
    "Serve chicken immediately, generously drizzled with Madeira sauce. Extra sauce is delicious over mashed potatoes, angel hair pasta, or fluffy rice."
  ],
  "ingredients": [
    "0",
    "For the Chicken:",
    "4 skinless chicken breast fillets",
    "kosher salt and freshly ground black pepper",
    "5 TB olive oil, divided",
    "1 cup shredded mozzarella cheese",
    "For the Sauce:",
    "2 TB olive oil",
    "8 oz fresh white mushrooms, sliced",
    "3 cups madeira wine (almost a full bottle)",
    "4 cloves minced garlic",
    "2 cups beef broth",
    "2 TB cornstarch dissolved in 2 TB of the beef broth",
    "1 TB salted butter",
    "¼ tsp freshly ground black pepper"
  ],
  "__v": 1
}