{
  "__v": 1,
  "directions": [
    "0",
    "Thaw frozen salmon overnight in the refrigerator. At least 30 minutes before you want to eat, take the salmon out of the fridge and blot dry with paper towel if it seems wet. Rub salmon on both sides with olive oil and fish rub and let it come to room temperature. Spray the grill well with non-stick grill spray (or rub with a paper towel dipped into grapeseed oil.) Preheat grill to high (or slightly lower for charcoal grill or if you're not using sugar-free maple syrup)",
    "Whisk together the sugar-free maple syrup, lime juice, and Sriracha Sauce to make the glaze. When the salmon is room temperature, brush liberally on both sides with the glaze.",
    "Lay salmon pieces on the grill, top side down and at an angle to the grill grates and immediately turn heat to medium-high. After about 4 minutes, check grill marks by lifting a corner of the fish with your turner, and if the marks look good, rotate fish to the opposite angle across the grill grates. (The fish should lift up easily without sticking when it's ready to rotate.) You can brush on more glaze after you rotate if you'd like.",
    "Cook 3-4 minutes after you rotate (depending on the thickness of the salmon) and then carefully flip fish to the other side. Cook 1-2 minutes on the other side, or until fish feels firm (but not hard) to the touch when you press on it with your finger. (Total cooking time is 8-10 minutes.) Serve hot, with extra glaze to add at the table if desired."
  ],
  "firstAdded": "2014-06-06T07:34:27.801000",
  "hash": "f08131d3219335ce379eb8024edccc4c5f00abc8",
  "href": "http://www.kalynskitchen.com/2013/06/grilled-salmon-maple-sriracha-lime-glaze.html",
  "image": "http://3.bp.blogspot.com/-Vq3sRJI7uug/UaAbH2lh0cI/AAAAAAAAfxw/_JcFjYtD3WA/s1600/1-Maple-Sriracha-lime-grilled-salmon-500x500-kalynskitchen.jpg",
  "ingredients": [
    "0",
    "2 pieces skinless salmon, about 6 oz. each",
    "3-4 tsp. olive oil, for rubbing salmon",
    "2 tsp. fish rub seasoning (I used Szeged Fish Rub, which I order from Amazon.com)",
    "non-stick grill spray or high smoke point oil (such as grapeseed) for oiling the grill",
    "Glaze Ingredients:",
    "3 T sugar-free maple syrup",
    "1 1/2 T fresh-squeezed lime juice (I used my fresh-frozen lime juice.)",
    "2-3 tsp. Sriracha Rooster Sauce (to taste; I used 3 tsp.)"
  ],
  "keywords": [
    "pieces",
    "skinless",
    "salmon",
    "olive",
    "oil",
    "rubbing",
    "seasoning",
    "used",
    "szeged",
    "fish",
    "rub",
    "order",
    "amazoncom",
    "spray",
    "high",
    "smoke",
    "point",
    "grapeseed",
    "oiling",
    "grill",
    "glaze",
    "sugarfree",
    "maple",
    "syrup",
    "freshsqueezed",
    "freshfrozen",
    "lime",
    "juice",
    "sriracha",
    "rooster"
  ],
  "title": "Grilled Salmon with Maple-Sriracha-Lime Glaze",
  "users": [
    null
  ]
}