{
  "hash": "454d62e7e370691273b537573cb9bead2f44f44c",
  "title": "Honey & Lemon Floral Lollipops Recipe\nMakes 8 (2 inch / 5 cm) round lollipops",
  "image": "https://3.bp.blogspot.com/-9uL9ZX63kOs/Vv40f8kf4BI/AAAAAAAAlko/PMcK0hQp30UlJgC7YhmM0ztM8IgkVELfA/s1600/diy-candy-sugar-lollipops1.JPG",
  "href": "https://www.blog.birdsparty.com/2016/04/floral-flowers-lollipops-recipe-how-to-daisies-dandelions-edible-how-to.html",
  "extension": "",
  "firstAdded": "2020-01-22T21:36:02.102000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place sugar, water and honey into a small saucepan and stir. Bring to boil for about 5 minutes (without stirring, otherwise crystallization will occur and ruin the mix!) until the hard candy stage is reached. Then take off the heat and add the lemon oil. Swirl the pan to mix, but do not stir with a spoon.",
    "Without candy thermometer: Test it by placing a few drops of the boiling sugar into the cup of cold water. If it hardens, then it's ready. Mine took about 5 minutes boiling to reach this stage.",
    "With candy thermometer: If using a candy thermometer, before you bring the mixture to a boil, place the thermometer inside the pan. Then boil until the sugar reaches 302 degrees F or 150 deg C.",
    "2) Meanwhile, lightly grease the lollipop mold, and arrange the flower heads and petals, facing down into each mold.",
    "3) Place a teaspoon of the sugar mixture into each mold and swirl the lollipop sticks around to get coated. Add a little more sugar to cover the back of the flowers and fill the mold to the top.",
    "4) Leave the pops in the mold until set. I placed mine in the fridge for 5 minutes."
  ],
  "ingredients": [
    "0",
    "* 1 cup of white sugar",
    "* 1/3 cup of water",
    "* 1 tablespoon of honey",
    "* 3-4 drops of lemon flavoring oil (same as used in cakes)",
    "* washed and dried, organic flower heads of choice (I used daisies and dandelions)"
  ],
  "__v": 1
}