{
  "hash": "cea8d67201b03943e3d7b18483ea507b2439e77e",
  "title": "Roasted Garlic and Fresh Herb Cream Cheez (a.k.a. Vegan Boursin) [Gluten-Free]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/04/Roasted-Garlic-Herb-Cream-Cheese_Boursin.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/roasted-garlic-and-fresh-herb-cream-cheez/",
  "extension": "Chrome",
  "firstAdded": "2015-05-07T18:41:02.577000",
  "users": [
    null
  ],
  "keywords": [
    "head",
    "garlic",
    "herbs",
    "thyme",
    "rosemary",
    "chives",
    "andor",
    "oregano",
    "raw",
    "cashew",
    "pieces",
    "soaked",
    "water",
    "hours",
    "rinsed",
    "butter",
    "coconut",
    "minutes",
    "salt",
    "lemon",
    "juice"
  ],
  "directions": [
    "0",
    "Preheat toaster oven (or oven) to 450-degrees. Cut off the top 1/3 or so of the garlic and wrap the head in foil. Place the garlic in the oven and roast for 30-45 minutes, or until fragrant and very soft. Remove from the oven and allow to cool completely before unwrapping.",
    "Line two 3/4 cup ramekins with cheesecloth. Sprinkle the bottoms of the ramekins with one tablespoon each of the herbs, reserving the remaining herbs.",
    "Meanwhile, in a food processor, process the cashew pieces, coconut butter or coconut flakes, and salt until fairly smooth. (It will not get completely smooth.) Squeeze the cloves from the roasted garlic and drop into the bowl of the food processor. Add the garlic powder and the lemon juice and process until thoroughly combined.",
    "Divide the mixture between the prepared ramekins, pressing the cheese down into the herbs and cheesecloth. Tap the ramekins on the counter a few times and level the top. Divide the remaining herbs between the two ramekins, gently press them into the cheese and cover with the ends of the cheesecloth. Put one ramekin on top of the other and fill a third ramekin with water and place it on top of both ramekins (you’ll have a “tower” of 3 ramekins). Place them in the refrigerator and let set overnight.",
    "The next day, remove the water-filled ramekin. Gently tug the cheesecloth to remove the cream cheese from the other ramekins and serve with bread or crackers - or place them in an air-tight container for up to one week."
  ],
  "ingredients": [
    "0",
    "1 small head garlic",
    "4 Tbsp. fresh chopped herbs, such as thyme, rosemary, chives, and/or oregano",
    "1 cup raw cashew pieces, soaked in water 8-10 hours, rinsed and drained",
    "1/4 cup coconut butter or 1/4 cup unsweetened coconut flakes, soaked in water for about 15 minutes, drained",
    "1/4 tsp. sea salt",
    "1/2 – 1 tsp. garlic powder",
    "3 Tbsp. fresh lemon juice"
  ],
  "__v": 1
}