{
  "hash": "42b8cb4a600f0b7f4e0d8a8739f2a1762544fb9e",
  "title": "Chocolate Covered Brownie Ice Cream Sandwich",
  "image": "http://www.goodlifeeats.com/wp-content/uploads/2011/05/ice-cream-brownie-sandwiches-1.jpg",
  "href": "http://www.goodlifeeats.com/2011/06/chocolate-covered-brownie-ice-cream-sandwich-recipe.html?_szp=321465#51f953b611a1c78a71000043",
  "keywords": [
    "brownies",
    "unsalted",
    "butter",
    "room",
    "granulated",
    "sugar",
    "cocoa",
    "pan",
    "eggs",
    "vanilla",
    "flour",
    "kosher",
    "salt",
    "ice",
    "cream",
    "sandwiches",
    "slightly",
    "softened",
    "chocolate",
    "chips",
    "oil"
  ],
  "directions": [
    "0",
    "Preheat the oven to 350 degrees. Butter a quarter sheet pan (a small jelly roll pan), or a 13x9inch pan. Place a sheet of parchment paper in the bottom, spread with butter, and dust with cocoa powder. Set aside.",
    "In the bowl of an electric mixer fitted with the paddle attachment, cream together butter, sugar, and 2 tablespoons of cocoa powder. When the mixture is creamy, and all lumps are gone, add in eggs, one at a time, incorporating well after each addition. Add in vanilla.",
    "With the mixer on low, add in flour and salt. Mix until just combined. Spread into prepared pan and bake until shiny on the top, 10-15 minutes. Remove from oven, and allow to cool completely.",
    "Remove brownie from the pan, and cut in half. Spread ice cream on one half, and top with the other half. Freeze for 2-4 hours, until firm.",
    "Cut the large ice cream sandwich into smaller sandwiches. Insert wooden popsicle sticks, and freeze for another hour.",
    "Melt the chocolate chips with the oil in the microwave in 30 second intervals, until chocolate is smooth. Dip each ice cream sandwich in the chocolate, and let set on a sheet of parchment paper. Wrap in parchment paper and freeze until ready to serve."
  ],
  "ingredients": [
    "0",
    "For the Brownies:",
    "1 stick (8 tablespoons) unsalted butter, at room temperature",
    "1 cup granulated sugar",
    "2 tablespoons cocoa, plus more for pan",
    "2 eggs",
    "1 teaspoon pure vanilla extract",
    "3/4 cup flour",
    "pinch of kosher salt",
    "For the Ice Cream Sandwiches:",
    "1 quart vanilla ice cream, slightly softened",
    "2 pounds chocolate chips",
    "1 teaspoon oil"
  ],
  "__v": 0
}