{
  "hash": "0fb046b6c982e131b7f85b8f2933c70ddd5b90bb",
  "title": "Una Pizza Rustica e Autentica for Sophia Loren",
  "image": "https://d2k9njawademcf.cloudfront.net/slides/2386/original/051110F_438.JPG?1273765396",
  "href": "http://food52.com/recipes/4502-una-pizza-rustica-e-autentica-for-sophia-loren",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T22:39:08.336000",
  "users": [
    null
  ],
  "keywords": [
    "high",
    "gluten",
    "flour",
    "active",
    "dry",
    "yeast",
    "water",
    "cold",
    "olive",
    "oil",
    "salt",
    "san",
    "marzano",
    "tomatoes",
    "muir",
    "glen",
    "clove",
    "garlic",
    "onion",
    "good",
    "basil",
    "holding",
    "leaves",
    "finish",
    "really",
    "anchovy",
    "filets",
    "salted",
    "jar",
    "sure",
    "theyre",
    "quality",
    "buffala",
    "mozzarella"
  ],
  "directions": [
    "0",
    "Godfather Part 1: Make your pizza dough.\nIn the bowl of your heavyweight stand mixer proof the yeast with that little bit of warm water. You know it’s going to work, right? Of major importance (I don’t make this stuff up), use a pastry scale to properly tare the flour weight---it does matter.",
    "Gradually add the cold water and then the flour and salt and mix and dribble in that olive oil. It should be a bit sticky at the end.",
    "Bench it. Make sure your hands have access to bench flour. Massage (knead) the dough to the protypical baby bottom feel. Bowl it. Cover it with cling wrap. Let it rest for 45 minutes. Yank it out and massage it further on a well floured board. THIS IS ALL DONE BY FEEL AND THE LOVE OF YOUR HANDS. Get it into a big old, tender ball. Divide with a knife or pastry cutter into two parts. Cuddle them and then wrap them in cling wrap. Stick em’ in the fridge overnight. The dough, I’ve discovered, only improves if you let it hang out in cold air.",
    "Godfather Part 2, Dawn of the Corleones: Make the sauce. Chop your cool-io anchovies into bits. Likewise with your garlic clove.",
    "Simmer the above (and onions) in 2 tablespoons hot but good olive oil, shimmering but not smoking. Carefully add the tomatoes. You can squish them by hand if you want to help the process move forward.",
    "Season with salt and pepper to your ownself taste.",
    "Keep it loose. Push it through the medium plate of a food mill and hold/refrigerate until ready to use.",
    "Godfather Part 3.01 (Beta):\nWake up.\nNow the good part. Crank up your indoor/outdoor cooking platform to its maximum. Can you handle 600? I can. We mean smoking hot!",
    "Roll out your pizza dough into round discs (a pastry ring can help you here) that will actually fit on your peel. Give 'em a bit of hand toss to stretch the dough out. Make sure that your pizzas do in fact fit your peel and your cooking stone/lpan. Shape em. You don't have to fling them in the air but sending some centrifugal force toward the outer edges is not so bad. You will want a stretchy middle. I didn't say that this was simple. Brush the outer edges (the \"cornice\") with just a bit of olive oil.",
    "Now work fast, really fast; ladle sauce in a spiral pattern starting from the center outward in a circle over your soon to be pizza(s) and then apply thin slices of buffala. Slip that disc of dough upon the stone. Slam the oven door or grill shut. And then you shut up, because I don't want to hear your mouth right now.",
    "Tear up some basil leaves while you are watching and waiting. After about five minutes of intense heat your pizza is, or should be, finished. But it's okay to look in between.",
    "A flourish of basil (basilico) and you are done, and Sophia will invite you over for cocktails.",
    "Notes to cooks: the thing about real pizza and not sissy pizza is heat. I can't emphasize that enough. Get the dough right, get the heat right. Crank it!"
  ],
  "ingredients": [
    "0",
    "3 cups (450 grams) high gluten flour",
    "1 tsp active dry yeast",
    "¼ cup warm water",
    "¾ cup cold water",
    "1 tablespoon olive oil",
    "sea salt",
    "1",
    "1 28 oz can San Marzano tomatoes (or substitute Muir Glen)",
    "1 clove garlic",
    "¼ cup chopped onion",
    "A good handful of basil (holding some leaves back to finish).",
    "2 really good anchovy filets, salted or jar, just be sure they’re quality good",
    "1 1/2 teaspoons Sea salt",
    "3-4 ounces buffala mozzarella, sliced"
  ],
  "__v": 1
}