{
  "hash": "34b24eb962ad602e4f004266c20176a3b13c01d9",
  "title": "MAPLE BALSAMIC TEMPEH BOWLS",
  "image": "https://www.eatingbirdfood.com/wp-content/uploads/2016/11/pumpkin-rice-maple-tempeh-bowls-9-300x300.jpg",
  "href": "https://www.eatingbirdfood.com/maple-balsamic-tempeh-bowls/",
  "extension": "Chrome",
  "firstAdded": "2017-09-18T20:39:13.891000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Remove tempeh from package and chop into small triangles by cutting the tempeh in half width-wise. Cut each half in a star pattern to get 16 mini triangles per package of tempeh, 32 triangles total.",
    "In a small bowl combine maple syrup, balsamic vinegar, tamari, 2 teaspoons oil and minced garlic. Add tempeh triangles into a shallow dish with a large surface area, pour maple balsamic marinade over the tempeh, toss to coat and let tempeh marinate in the fridge for 1 - 24 hours. Stir the mixture a couple times while marinating, if possible.",
    "Once tempeh has marinated, start cooking the rice by combining the coconut milk, vegetable broth, pumpkin, rice and sea salt in a medium saucepan over medium-high heat. Bring to a boil, cover and reduce heat to medium-low. Allow rice to simmer until the liquid is completely absorbed and rice is tender, about 15 to 20 minutes. Once cooked, stir, cover and set aside until the tempeh and broccoli are ready as well.",
    "While the rice is cooking, pan-glaze the tempeh by heating 1 Tablespoon avocado oil in a large skillet over medium-high heat. Once oil is hot, add the tempeh (without pouring the marinade in) and cook until golden brown on each side, allowing 4-5 minutes per side. Pour the maple balsamic mixture into the pan with the tempeh and simmer another 5-7 minutes, or until the sauce has reduced creating a glaze on the tempeh. Toss the tempeh a couple times during this process.",
    "Steam broccoli and compile bowls by starting with a base of pumpkin rice. Top each bowl with pan-glazed tempeh and steamed broccoli. Season with salt and pepper to taste and top each bowl with hemp parmesan, if using."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "16 oz (2 packages) of Lightlife tempeh",
    "1/4 cup maple syrup",
    "1/4 cup balsamic vinegar",
    "2 teaspoons avocado or olive oil",
    "3 Tablespoons tamari",
    "3 cloves garlic, minced",
    "1 Tablespoon avocado or olive oil",
    "2 cups steamed broccoli",
    "hemp parmesan, for topping",
    "Pumpkin Rice",
    "1 cup light coconut milk",
    "1 cup vegetable broth",
    "1/2 cup canned pumpkin",
    "1 cup white rice",
    "pinch of sea salt"
  ],
  "__v": 1
}