{
  "hash": "f3e09d26ca511d1bcab48a6ac77d1f8599a5c261",
  "title": "Easy Buckeye Recipe",
  "image": "https://sugarspunrun.com/wp-content/uploads/2017/03/Buckeye-Balls-1-of-1-4.jpg",
  "href": "https://sugarspunrun.com/buckeye-recipe/",
  "extension": "Chrome",
  "firstAdded": "2019-05-24T21:28:31.312000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Combine peanut butter and butter in the bowl of a stand mixer and beat until well-combined.",
    "Add brown sugar and vanilla extract. Stir well.",
    "Gradually add powdered sugar until completely combined. Scoop into Tablespoon-sized balls and roll with the palms of your hand until smooth and round.**",
    "Place on wax-paper lined cookie sheet and freeze for 15-20 minutes.",
    "While peanut butter balls are chilling, prepare your chocolate according to package instructions. Pour into a deep dish (I use a wide cup).",
    "Remove peanut butter balls from freezer, spear the top of each peanut butter ball with a toothpick and, holding the toothpick, dip each buckeye ball into the melted chocolate.",
    "Return to cookie sheet and remove toothpick. Use the pads of your fingers to smooth over the toothpick mark.",
    "Allow chocolate to harden before eating and enjoying.",
    "Buckeye balls are best kept refrigerated.",
    "Notes",
    "*Some people have commented that the addition of brown sugar makes the cookies taste a bit gritty, I have not personally found this to be the case but if you are worried about this you can leave the brown sugar out without adjusting any of the other ingredients",
    "**If dough is too sticky to roll, add more powdered sugar, a Tablespoon at a time",
    "Nutrition",
    "Calories: 103kcal"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 cups creamy peanut butter (not \"natural\" peanut butter) (475g)",
    "1/2 cup salted butter softened (113g)",
    "2 Tablespoons brown sugar* packed",
    "1 1/4 teaspoon vanilla extract",
    "3 1/4 cups powdered sugar (405g)",
    "12 oz dark chocolate melting wafers (340g)"
  ],
  "__v": 1
}