{
  "hash": "dc388ee693f4e359ea0ccc293387280601a5ec00",
  "title": "BUTTERNUT SQUASH QUESO(ISH) DIP",
  "image": "",
  "href": "http://www.thugkitchen.com/butternut_squash_queso",
  "extension": "Chrome",
  "firstAdded": "2016-11-06T01:58:15.515000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Throw the butternut squash puree and onion in a blender and run until that fucker looks smooth. In a small bowl, mix together the flour, cumin, chili powder, and smoked paprika and set it aside.",
    "Grab a medium-sized soup pot and warm the olive oil over a medium heat. Throw in the flour and spice mixture and keep stirring until it starts to thicken up and smell kinda toasty. Yeah, that’s right, we’re making a roux bitches. Grab a small whisk and slowly add the vegetable broth while you whisk. It will start to look like little lumps of playdough. You aren’t fucking up. Trust the system. Add the diced tomatoes and all their juices and keep stirring, it should be a lot smoother looking now with the only chunks being those tasty as hell tomatoes.",
    "Now pour in the butternut squash mix, the nutritional yeast, garlic, jalapenos, lime juice, and salt. Stir well so there aren’t any chunks, and turn down the heat to low. Let everything simmer together for 3-5 minutes so that it the flavors get all mixed up and the sauce thickens. Serve that fucker up warm and right away.",
    "* Yeah you can use a can but it’s easy as fuck to make. Skin and chop up a butternut squash into chunks about the size of a dime until you get about 3 cups. Throw it in a pot with a steamer basket and some water, cover, and simmer for about 15 minutes until the squash is tender. Throw it in a blender or food processor and boom, fucking puree.",
    "** Canned is cool here."
  ],
  "ingredients": [
    "0",
    "Makes 2 ½ cups total, enough for 6 hungry motherfuckers",
    "1 ½ cups butternut squash puree*",
    "½ cup diced yellow onion",
    "3 tablespoons all-purpose flour",
    "1 ½ teaspoons ground cumin",
    "1 teaspoon chili powder",
    "1 teaspoon smoked paprika",
    "3 tablespoons olive oil",
    "½ cup vegetable broth or water",
    "1 cup diced tomatoes with their juices**",
    "¼ cup nutritional yeast",
    "2 cloves of garlic, minced",
    "1-2 jalapenos, minced",
    "1 tablespoon lime juice",
    "½ teaspoon salt"
  ],
  "__v": 1
}