{
  "hash": "0424ffac14a550dfc5e6e1fa829baec064cc851a",
  "title": "French \"Peasant\" Beets",
  "image": "https://d2k9njawademcf.cloudfront.net/slides/1593/original/SS030210F611.JPG?1267680896",
  "href": "http://food52.com/recipes/3302-french-peasant-beets",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T22:03:10.726000",
  "users": [
    null
  ],
  "keywords": [
    "greens",
    "mixture",
    "golden",
    "red",
    "beets",
    "bunch",
    "swiss",
    "chard",
    "butter",
    "shallot",
    "salt",
    "pepper",
    "white",
    "wine",
    "muscadet",
    "preference",
    "water",
    "bucheron",
    "cheese",
    "room",
    "crusty",
    "peasant",
    "style",
    "bread",
    "warmed",
    "oven"
  ],
  "directions": [
    "0",
    "Scrub and peel the beets. Remove the greens and chop coarsely. Set the greens aside in a large prep bowl. Slice beets into 1/4 inch rounds.",
    "Remove the ribs from the swiss chard and coarsely chop and toss into bowl with the beet greens,",
    "In a large sautee pan, melt butter. Sautee shallots.",
    "Add beet rounds to the shallot butter mixture. Crack some pepper over the beets and a toss on a pinch of salt. Reduce heat and sautee beets, turning over to ensure even cooking.",
    "About 15 minutes later when beets are begnning to glaze and become tender, add greens and chard. Sautee for about 5 minutes, then add wine and cover. Cook until greens are wilted, adding water if necessary. Allow liquid to be mostly absorbed into greens, adjust seasonings.",
    "Scoop greens and beets into a low shallow bowl. Garnish with a sizeable wedge of bucheron and some crusty bread. Crack a little bit of pepper over the entire dish."
  ],
  "ingredients": [
    "0",
    "4-6 Beets with greens (I like a mixture of golden and red beets)",
    "1 bunch Swiss chard",
    "3 tablespoons butter",
    "1 shallot",
    "Salt",
    "Freshly Ground Pepper",
    "2 tablespoons white wine (Muscadet is my preference)",
    "2 tablespoons water",
    ".5 pounds Bucheron Cheese (room temperature)",
    "Crusty peasant style bread (warmed in oven"
  ],
  "__v": 1
}