{
  "hash": "d0befba60dcdcc65e7b6c56cb02a6de92a15f6bd",
  "title": "Rustic Pizza Dough Recipe",
  "image": "http://ciaoflorentina.com/wp-content/uploads/2011/01/Rustic-Pizza-Dough-11.jpg",
  "href": "http://ciaoflorentina.com/rustic-pizza-dough-recipe/",
  "extension": "Chrome",
  "firstAdded": "2016-08-27T22:41:17.108000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat your oven as high as it will go for at least 45 minutes to one hour.",
    "In the bowl of your kitchen aid and using the paddle attachment mix the flour, sea salt and yeast on low speed until all is incorporated then add the water.",
    "Switch to the dough hook and mix together on low speed for 8 to 10 minutes. The dough should be smooth and sticky but should not stick to the sides of the bowl, only a little to the bottom.",
    "(If the dough sticks to the sides sprinkle in a little more flour, if it is too dry then add a bit more water).",
    "After the 8 minutes have passed remove the dough from the kitchen aid and cut it into 6 pieces and form them into rounds. Place them on a lightly oiled cookie sheet and drizzle with 1 tbs of extra virgin olive oil. Cover with plastic wrap and allow to sit at room temperature and rise for 2 hours in a draft free area. ( I prefer the oven )",
    "Sprinkle the counter with a little bit of flour, take one piece of dough and press down on it with your fingers until you have ½\" thick circle or oval. Using your fists and knuckles start stretching the dough until 10\" in diameter making sure not to tear it ( this should be easy since it is a small pie).",
    "Dust your pizza peel (or a piece of cardboard) very well with semolina flour or corn meal and set your pizza dough on it making sure it slides easily when moved. Pour 2-3 tablespoons of the pizza sauce in the center and spread it around with the back of a spoon leaving 1 inch of space at the edges and making sure not to get any on the peel. Sprinkle with the mozzarella and add your favorite toppings. ( Don't add too many toppings, keep in mind this is a thin crust and a couple of toppings will suffice ).",
    "Gently slide the pie on the preheated pizza stone in a hot 525 degree or more oven, and bake for 5 to 7 minutes or until golden brown on the edges. When making the breakfast pizza I find that the egg cooks perfectly in 6 minutes.",
    "Remove from the oven and sprinkle with the basil and freshly grated parmigiano reggianno. Allow to rest for a few minute for the cheese to set."
  ],
  "ingredients": [
    "0",
    "5 c flour + some for dusting",
    "1½ tsp yeast",
    "1½ tsp sea salt",
    "2¼ c cold water",
    "1 tbs extra virgin olive oil",
    "1",
    "Caramelized onions",
    "Arrabiata Sauce",
    "Grilled Bell Peppers",
    "Heirloom Tomatoes",
    "Fresh Basil",
    "Green Onions",
    "Smoked Mozzarella Cheese",
    "Sauteed Mushrooms",
    "Fontina Cheese Meatballs"
  ],
  "__v": 1
}