{
  "hash": "586bcf0e0777830ad35a68803481bcf4d7e7a4d3",
  "title": "Single-Skillet Chicken Thighs with Bacon, Brussels Sprouts and Easy Apple Jus",
  "image": "http://ak-hdl.buzzfed.com/static/2015-03/6/14/enhanced/webdr02/enhanced-25450-1425670623-13.jpg",
  "href": "http://www.buzzfeed.com/christinebyrne/single-skillet-chicken-thighs-bacon-brussels-sprouts-apples",
  "extension": "Chrome",
  "firstAdded": "2015-07-12T15:54:24.293000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "thighs",
    "bonein",
    "skinon",
    "kosher",
    "salt",
    "pepper",
    "slices",
    "bacon",
    "pieces",
    "brussels",
    "sprouts",
    "trimmed",
    "medium",
    "fuji",
    "apple",
    "cored",
    "red",
    "wine",
    "vinegar",
    "juice"
  ],
  "directions": [
    "0",
    "PREPARATION",
    "1. Preheat the oven to 425°F.",
    "2. Use paper towels to thoroughly dry the chicken thighs, then season them liberally with salt and pepper on both sides.",
    "3. Heat a large cast iron skillet over medium-high heat. When the skillet is hot, add the seasoned chicken thighs, skin-side down, and cook just until the edges of the skin start to brown, about 3 minutes. Turn the heat down to medium and add the bacon pieces, scattering them around the chicken thighs. Cook, moving the bacon around the skillet occasionally without touching the chicken thighs, just until the bacon starts to shrivel and brown slightly, about 2 minutes.",
    "4. Add the quartered Brussels sprouts and apple slices to the skillet and season them with a little bit of salt and pepper. Stir them around with the bacon, still trying not to move the chicken around too much. It’s fine if the chicken thighs move a little, you just want the skin to stay in contact with the hot skillet.",
    "5. Put the skillet in the oven and roast everything for 10 minutes. Take the skillet out, stir the bacon and Brussels sprouts, and flip the chicken thighs. Put the skillet back in the oven until the thighs are cooked through (a meat thermometer inserted into the thickest part of the thigh should read 165°F, and there should be no pink when you cut into the meat), about 10 more minutes.",
    "6. When the chicken is cooked, take the skillet out of the oven and use a large slotted spoon to take the chicken, bacon, Brussels sprouts and apple slices out of the skillet, dividing everything evenly among two plates. Don’t tilt the skillet and slide everything out, because you want any fat or juices to stay in the skillet. There won’t be much, since the apples and Brussels sprouts will absorb most of it, but there will be some.",
    "7. Put the skillet on the stove over medium-high heat (it’ll already be hot) and add the red wine vinegar while stirring and scraping the bottom of the skillet. This will deglaze your pan, so that all of the caramelized bits of bacon and chicken skin end up in your jus and not stuck to the bottom of your pan. After about 10 seconds, add the apple juice and let it simmer and reduce until it’s the consistency of a thick syrup, about a minute.",
    "8. To serve, pour the apple jus over the plated chicken thighs, dividing it evenly between the two plates."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "2 large chicken thighs, bone-in, skin-on",
    "kosher salt and freshly ground pepper",
    "2 slices bacon, cut in 1-inch pieces",
    "2 cups Brussels sprouts, trimmed and quartered",
    "1 medium Fuji* apple, cored and cut in 8-10 slices",
    "1 tablespoon red wine vinegar",
    "1/4 cup apple juice"
  ],
  "__v": 1
}