{
  "hash": "da467d8fd203cd2a6679741f5e0e4424d989910c",
  "title": "Malai Kofta",
  "image": "http://recipe-folder.com/img/recipe-images/073/035/3021351173.jpg",
  "href": "https://foodess.com/malai-kofta-recipe/",
  "extension": "Chrome",
  "firstAdded": "2020-04-30T21:07:06.137000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Boil the potato for kofta until tender, then drain in colander and allow to cool.",
    "Meanwhile, heat ghee over medium-low heat and cook onions until very soft and deep golden brown, about 25 minutes (don't rush this step, it's important for the flavour). Add ginger and garlic, and cook 1-2 minutes, until fragrant. Stir in salt, cumin, coriander, cayenne, cinnamon and cardamom pods and cook a minute more. Add tomato puree, nut butter and water; cook until oil starts to bubble up and shimmer on top. Stir in cream and sugar; simmer, covered, about 10 minutes then turn off the heat and let stand while you finish making the koftas.",
    "Prepare oil for frying by heating 2 inches of oil in a large saucepan over medium-high heat. Meanwhile, grate or crumble the paneer into a large bowl (or just measure in the ricotta). Add remaining ingredients and stir very well to make sure the spices are evenly distributed. Form mixture into golfball-sized balls.",
    "Check to see that the oil has reached about 375ºF. Carefully slide 5 or 6 koftas into the hot oil. Fry until deep golden brown, gently turning once using a slotted metal spoon (about 2 minutes total). Transfer koftas to paper towel-lined plate, and proceed with the next batch (for a total of about 4 batches).",
    "Over low heat, bring the sauce back up to a gentle simmer. Taste and add salt, if needed, then slide the fried koftas in and gently stir to coat. Top with cilantro."
  ],
  "ingredients": [
    "0",
    "[For Sauce]",
    "1/4 oil",
    "2 1/2 cups finely chopped onion from 2 medium-large",
    "1 tbsp minced ginger",
    "1 tbsp minced garlic",
    "2 tsp kosher salt or to taste",
    "1 tsp cumin",
    "1 tsp coriander",
    "1/2 tsp cayenne powder",
    "1/4 tsp cinnamon",
    "10 whole green cardamom pods smashed with flat side of knife",
    "1 1/2 cups tomato puree",
    "1/4 cup cashew or almond butter",
    "1 cup water",
    "3/4 cup whipping cream aka double cream, 33% or 35% milkfat",
    "1 tbsp granulated sugar",
    "1 tbsp finely minced cilantro",
    ".",
    "[For Kofta]",
    "225 grams 8 oz paneer OR full-fat ricotta cheese",
    "2 cups mashed potato from about 1 large russet",
    "1 tsp kosher salt *with no salt in paneer or potato cooking water; start with half the salt that if either paneer/potato was salted",
    "2 tbsp finely chopped raisins or currants",
    "2 tbsp finely chopped cashews or blanched almonds",
    "1 tbsp packed finely minced cilantro",
    "1/2 tsp ground cumin",
    "1/4 tsp cayenne"
  ],
  "__v": 7
}