{
  "__v": 2,
  "directions": [
    "0",
    "Heat 2 tablespoons oil in a large nonstick skillet over medium heat. Add the onions and garlic, seasoning them with a generous pinch of salt. Cook, stirring occasionally, until onions soften, about 6 minutes. Stir in the mushrooms, seasoning with a pinch of salt; turn the heat up to medium-high. Cook until mushrooms are browned and have given up their liquid, 5 minutes.",
    "Transfer the onions and mushrooms to a bowl. Add another tablespoon oil to the skillet if needed to cook the chicken. Season the chicken with salt and pepper; place in the skillet, skin side down. Cook, turning once, until browned on both sides, about 12 minutes total.",
    "Pour in the wine; turn the heat to low. Simmer until chicken is cooked through, about 15 minutes. Return the onions and mushrooms to the skillet; add the peas and oregano. Stir to coat the vegetables with the pan juices. Cook until heated through. Taste for seasonings. – Chicago Tribune/McClatchy-Tribune Information Services"
  ],
  "firstAdded": "2014-10-14T16:50:12.572000",
  "hash": "318526b53e7ce24efce0ff06f525a640b7c63c33",
  "href": "http://www.thestar.com.my/Lifestyle/Food/Recipes/2014/05/07/Skillet-Chicken-with-Onions-Peas-and-Mushrooms/",
  "image": "http://www.thestar.com.my/~/media/Images/TSOL/Photos-Upload/From DCX/2014/04/28/doc6f1vxehii5iss7xc6e.ashx?w=620&h=413&crop=1&",
  "ingredients": [
    "0",
    "2 tablespoons canola oil, plus more if needed",
    "1 onion, chopped",
    "2 cloves garlic, minced",
    "3/4 teaspoon salt, approximate",
    "250g sliced mushrooms",
    "4 skin-on, bone-in chicken thighs",
    "Freshly ground pepper",
    "1 cup dry white wine (or use stock or plain water)",
    "1 cup peas, frozen or fresh",
    "1 tablespoon chopped fresh oregano (or 1 teaspoon dried)"
  ],
  "keywords": [
    "canola",
    "oil",
    "needed",
    "onion",
    "garlic",
    "salt",
    "approximate",
    "mushrooms",
    "skinon",
    "bonein",
    "chicken",
    "thighs",
    "pepper",
    "dry",
    "white",
    "wine",
    "use",
    "stock",
    "plain",
    "water",
    "peas",
    "frozen",
    "oregano"
  ],
  "title": "Skillet Chicken With Onions, Peas, Mushrooms",
  "users": [
    null
  ]
}