{
  "hash": "628411570c248373defbab0b324fe75cac411e7b",
  "title": "SPINACH TOFU GNUDI BALLS",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2014/03/Gnudi-balls-1066x800.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/spinach-tofu-gnudi-balls/",
  "firstAdded": "2015-02-10T09:53:43.353000",
  "users": [
    null
  ],
  "keywords": [
    "ngredients",
    "frozen",
    "spinach",
    "thawed",
    "squeezed",
    "dry",
    "extrafirm",
    "tofu",
    "pressed",
    "vegan",
    "parmesan",
    "nutritional",
    "yeast",
    "chickpea",
    "flour",
    "tbs",
    "rolling",
    "mixed",
    "water",
    "egg",
    "replacer",
    "salt",
    "pepper",
    "garlic",
    "parsley",
    "nutmeg"
  ],
  "directions": [
    "0",
    "Bring a large pot of salted water to a boil.",
    "Put the spinach in a large bowl and separate it with your fingers. Crumble the tofu into the bowl. Add the Vegan parmesan (or nutritional yeast), the 4 Tbs. of flour, and the seasonings. Mix 4 Tbs. of flour with water to form a paste. This is your binder. (Or you can use whatever egg replacer you prefer). Add it to the bowl. Mix with a fork or your hands to form a dough. If it feels too loose, add more flour.",
    "Pour the 2 Tbs. of flour on a plate. Using a tablespoon, scoop out servings of the mixture and form them into compact, firm balls with floured hands. Gently roll the balls in the flour on the plate.",
    "Depending on the size you make, you should have between 16 and 20 balls. You can also make these in advance and refrigerate them until you are ready to use them. Bring them back to room temperature before boiling.",
    "Gently drop the balls into the boiling water. Do not overcrowd them; do them in batches, if necessary. They should cook for about 5 minutes. Remove them with a slotted spoon. Top the Gnudi Balls with your choice of sauce and serve alone or with pasta.",
    "As an alternative method, you could spoon some sauce into a baking dish, add the Gnudi Balls and top with more sauce. Top with Vegan grated parmesan or Vegan mozzarella and bake for about 10 minutes until they are golden brown and the cheese has melted. Then serve with extra sauce, if desired. This would make an extra decadent dish of cheezy, saucy Gnudi Balls.",
    "As I mentioned above, I cooked the Gnudi Balls in my Marinara sauce for about 5 -8 minutes. Then I served them atop brown rice pasta, covered with more sauce and Vegan grated parmesan."
  ],
  "ingredients": [
    "0",
    "NGREDIENTS",
    "One 10 oz. package frozen chopped spinach, thawed and squeezed dry",
    "One package of extra-firm tofu, pressed and drained",
    "½ cup Vegan grated parmesan or nutritional yeast",
    "4-6 Tbs. chickpea flour, plus 2 Tbs. more for rolling",
    "4 Tbs. chickpea flour mixed with 4 Tbs. water (or the egg replacer of your choice)",
    "Salt and pepper to taste",
    "1 tsp. garlic powder",
    "1 tsp. dried parsley",
    "Pinch of nutmeg"
  ],
  "__v": 1
}