{
  "hash": "d855b19d42901d3f3b36931f4f86e6fc1749daa0",
  "title": "Spinach & Artichoke Wonderpot",
  "image": "https://www.budgetbytes.com/wp-content/uploads/2013/10/Mushroom-Wonderpot-bowl.jpg",
  "href": "https://www.budgetbytes.com/spinach-artichoke-wonderpot/",
  "extension": "Firefox",
  "firstAdded": "2018-09-16T20:03:11.072000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Rinse the mushrooms to remove any dirt or debris. Slice the mushrooms thinly. Drain the can of artichoke hearts and roughly chop them into bite-sized pieces. Thinly slice the onion and garlic (you can mince the garlic if you don't want large slices).",
    "Place the vegetable broth, olive oil, mushrooms, artichoke hearts, onions, and garlic in a large pot. Break the fettuccine in half and add it to the pot along with the oregano, thyme, and some freshly cracked pepper. Push the ingredients down under the broth as much as possible. Place a lid on the pot and bring it up to a rolling boil over high heat.",
    "As soon as it reaches a boil, stir the pot to evenly distribute the ingredients and prevent the pasta from sticking. Turn the heat down to low so that the pot is just simmering. Allow the pot to simmer, with the lid on, for 10-15 minutes, or until the pasta is tender and most of the liquid has been absorbed. Give the pot a stir every few minutes to prevent the pasta from sticking.",
    "Once the pasta is cooked through, add the frozen spinach. Allow the heat from the pasta to thaw the spinach. Stir the pot to help break up the clumps of spinach as they melt. Serve hot."
  ],
  "ingredients": [
    "0",
    "8 oz mushrooms $1.99",
    "14 oz can artichoke hearts $2.50",
    "4 cloves garlic $0.32",
    "1 medium yellow onion $0.34",
    "5 cups vegetable broth $0.65",
    "2 Tbsp olive oil $0.32",
    "12 oz fettuccine $1.33",
    "1 tsp dried oregano $0.10",
    "1/2 tsp dried thyme $0.05",
    "freshly cracked pepper (15-20 cranks of a pepper mill) $0.05",
    "4 oz frozen cut spinach $0.40"
  ],
  "__v": 1
}