{
  "hash": "4ce90b77949b7401c2bee0c81566153a27bcb5bb",
  "title": "σαλάτα Ceasar με αυγά και τόνο",
  "image": "http://recipe-folder.com/img/recipe-images/021/697/1018970321.jpg",
  "href": "http://www.gastronomos.gr/sintages/3566/chortastiki-salata-ceasar-me-auga-kai-tono-apo-bazo",
  "extension": "Chrome",
  "firstAdded": "2016-01-09T00:20:10.565000",
  "users": [
    null
  ],
  "keywords": [],
  "directions": [
    "0",
    "Ντρέσινγκ: Χτυπάμε στο μούλτι τα φιλέτα αντζούγιας με το ελαιόλαδο, το χυμό λεμονιού, την παρμεζάνα, τη μουστάρδα και φρεσκοτριμμένο πιπέρι, μέχρι να γίνει μια λεία σάλτσα. Την κρατάμε στην άκρη.",
    "Χοντροκόβουμε τα φύλλα από το μαρούλι και το άισμπεργκ και τα βάζουμε σε ένα μπολ. Περιχύνουμε με τη σάλτσα και ανακατεύουμε.",
    "Κρουτόν: Αφαιρούμε την κόρα από 2 φέτες ψωμιού και τις κόβουμε σε κυβάκια. Ζεσταίνουμε σε ένα τηγάνι 40 ml ελαιόλαδο και τηγανίζουμε τους κύβους ψωμιού, γυρίζοντάς τους ώστε να πάρουν ένα χρυσαφί χρώμα.",
    "Τους στραγγίζουμε σε απορροφητικό χαρτί και τους προσθέτουμε στη σαλάτα μαζί με τον τόνο.",
    "Αυγά ποσέ: Σε μια μικρή κατσαρόλα με νερό μέχρι τη μέση ρίχνουμε 1 κουτ. γλυκού αλάτι και 2 κουτ. σούπας ξίδι και, όταν αρχίσει να βράζει, σπάμε μέσα στο νερό 2 αυγά. Τα αφήνουμε για 2 λεπτά και με τρυπητή κουτάλα τα βγάζουμε σε απορροφητικό χαρτί.",
    "Τα προσθέτουμε στη σαλάτα και πασπαλίζουμε με 2 κουτ. σούπας φύλλα μαϊντανού, ψιλοκομμένα. Σερβίρουμε αμέσως."
  ],
  "ingredients": [
    "0",
    "Για το ντρέσινγκ",
    "2 φιλέτα αντζούγιας",
    "40 ml ελαιόλαδο",
    "1 κουτ. σούπας χυμός λεμονιού",
    "30 γρ. παρμεζάνα, τριμμένη",
    "1 κουτ. γλυκού μουστάρδα",
    "φρεσκοτριμμένο πιπέρι",
    "Για τη σαλάτα",
    "1/2 μαρούλι",
    "1/2 άισμπεργκ",
    "150 γρ. τόνο (από βαζάκι, σε ελαιόλαδο)",
    "2 κουτ. σούπας φύλλα μαϊντανού, ψιλοκομμένα",
    "Για τα κρουτόν",
    "2 φέτες ψωμιού",
    "40 ml ελαιόλαδο (ή την ίδια ποσότητα σε βούτυρο)",
    "Για τα αυγά ποσέ",
    "1 κουτ. γλυκού αλάτι",
    "2 κουτ. σούπας ξίδι",
    "2 αυγά"
  ],
  "__v": 1
}