{
  "hash": "c6fc7e8bd65b90330f1274cdd00d439e416de4ea",
  "title": "Lemon Chicken",
  "image": "http://images.outbrain.com/imageserver/v2/s/Hjvh/n/ma3V0/abc/iGkkr/ma3V0-Wnn-126x95.jpg",
  "href": "http://www.foodnetwork.com/recipes/rachael-ray/lemon-chicken-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-01-01T10:44:07.676000",
  "users": [
    null
  ],
  "keywords": [
    "breast",
    "chicken",
    "tenders",
    "chunks",
    "allpurpose",
    "unbleached",
    "flour",
    "coarse",
    "salt",
    "wok",
    "oil",
    "turns",
    "pan",
    "preferred",
    "brand",
    "house",
    "tsang",
    "splash",
    "white",
    "rice",
    "wine",
    "vinegar",
    "broth",
    "stock",
    "prepared",
    "lemon",
    "curd",
    "hot",
    "water",
    "zested",
    "scallions",
    "blades",
    "chives"
  ],
  "directions": [
    "0",
    "Coat the chunked chicken lightly in flour, seasoned with a little salt. Heat a large skillet or a wok-shaped nonstick pan over high heat. Stir fry chicken until golden, 3 or 4 minutes. Remove chicken from the pan and return pan to heat. Reduce heat to medium.",
    "Add a splash of vinegar to the pan and let it evaporate. Add stock or broth to the pan and scrape up any drippings with a whisk. Thin curd by stirring in a little hot water. Add curd to broth and whisk to combine. Add chicken back to the pan and simmer for 1 to 2 minutes to thicken sauce and finish cooking chicken pieces through. Remove the pan from heat, add the scallions or chives and zest, and toss chicken pieces well to combine zest and scallions or chives evenly throughout the sauce. Serve with Special Rice, recipe follows.",
    "Cook's Notes: Wok oil infused with ginger and garlic is usually available on the International Foods aisle in many markets.",
    "Chicken broths and stocks are available in resealable paper containers, making storage of remaining product easy and on hand in the refrigerator; they are found in the soup aisle.",
    "Lemon curd is a sweet lemon spread available in most markets. It is on the jam/jelly aisle.",
    "Recipe courtesy of Rachael Ray"
  ],
  "ingredients": [
    "0",
    "1 1/2 pounds chicken breast or chicken tenders, cut into chunks",
    "1/4 cup all-purpose unbleached flour",
    "Coarse salt",
    "2 tablespoons wok or vegetable oil, 2 turns of the pan (preferred brand: House of Tsang)",
    "1 tablespoon (a splash) white or rice wine vinegar",
    "1/2 cup chicken broth or stock",
    "8 ounces (1 cup) prepared lemon curd",
    "1/4 cup hot water",
    "1 lemon, zested",
    "2 scallions, thinly sliced or 20 blades fresh chives, finely chopped"
  ],
  "__v": 1
}