{
  "hash": "05b3a8e7294b2b4d7b0cc1a14325b8856f2cbcae",
  "title": "Slow Cooker Salsa Verde Honey Lime Chicken",
  "image": "https://carlsbadcravings.com/wp-content/uploads/2016/06/Slow-Cooker-Salsa-Verde-Honey-Lime-Chicken-8.jpg",
  "href": "http://carlsbadcravings.com/slow-cooker-salsa-verde-honey-lime-chicken-recipe/",
  "extension": "Chrome",
  "firstAdded": "2018-09-07T17:00:01.547000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Rub chicken breasts with olive oil and place in the bottom of your slow cooker. Add all of the remaining Slow Cooker ingredients except for the hot sauce. Cook on high for 2-4 hours or on low for 6-7 hours or until chicken is tender enough to shred.",
    "Remove chicken to a cutting board, and let rest 5 minutes before shredding (there will be a lot of liquid remaining). Return shredded chicken and let cook on low for an additional 20-30 minutes to absorb some of the liquid/juices. Drain excess liquid before serving or use tongs to remove shredded chicken. Taste and add more honey for sweeter, lime for more tang, hot sauce for spicier.",
    "To make Seasoned Flatout FolidIt Flatbread Taco Shells, preheat oven to 375 degrees F. Cut each FoldIt in half and lightly brush with Salsa Verde Honey Lime juices from slow cooker on one side. Hang each cut FoldIt in half over individual oven rungs so they from a taco shell and bake at 375 degrees F for approximately 10-12 minutes or until edges are crisp. Remove and let cool for 1 minute. (See video on how to bake shells).",
    "Stuff taco shells with chicken and top with desired taco toppings."
  ],
  "ingredients": [
    "0",
    "Slow Cooker Salsa Verde Honey Lime Chicken",
    "2 pounds boneless skinless chicken breasts",
    "1 tablespoon olive oil",
    "1 cup mild salsa verde (I use Herdez in the jar)",
    "1/3-1/2 cup honey",
    "1/2 cup lime juice",
    "1 1/2 teaspoons chili powder",
    "1 1/2 teaspoons salt",
    "1 teaspoon onion powder",
    "1 teaspoon garlic powder",
    "1/2 teaspoon smoked paprika",
    "1/2 teaspoon cumin",
    "1/4 teaspoon black pepper",
    "Hot sauce to taste",
    "Tacos",
    "1-2 packages Flatout FolidIt Flatbread Ancient Grains***",
    "Monterrey Jack Cheese",
    "lettuce",
    "Tomatoes",
    "cilantro",
    "Avocadoes",
    "sour cream"
  ],
  "__v": 1
}