{
  "hash": "395aeec9ec2f4f67dee61d7731dc110d1dce7920",
  "title": "GRILLED BROCCOLI",
  "image": "",
  "href": "https://www.epicurious.com/recipes/member/views/SKEWER-FREE-GRILLED-BROCCOLI-THATS-RIGHT-GRILLED-50174615",
  "extension": "",
  "firstAdded": "2019-01-02T00:42:40.547000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "- Remove broccoli florets from the stalks. Rinse them in colander and drain thoroughly.",
    "- Once drained, put broccoli in large container/bowl and add olive oil (2-3 tbsp to taste). Seal the lid (it must be a tight seal) and shake to coat the broccoli with the oil. Don't shake too much, or you'll make your broccoli floppy.",
    "- Remove lid and add worcestershire sauce, Tabasco, salt, black pepper, red pepper flakes, and garlic powder. Re-seal lid and shake again to mix all the ingredients onto the broccoli. Again, take care not to shake too much, just enough to distribute the ingredients.",
    "- Set your grill temperature to high. Prepare a sheet of aluminum foil large enough for all the broccoli to fit on in a single layer. Lay the foil on the grill and quickly spread the broccoli out evenly upon it. Make sure to crimp up the side edges of the foil for easy retrieval after cooking.",
    "- Close the grill's lid and allow the broccoli to cook at high heat for 8-10 minutes. (8 minutes for crisper broccoli, 10 minutes for more \"well-done\" softer broccoli. I do not advise cooking for longer than 10 minutes because the broccoli may become mushy and unwieldy.)",
    "- When finished cooking, remove the broccoli from the grill by grabbing the foil at the crimped-up sides. The foil shouldn't retain much heat at these edges, but be careful not to burn yourself. Funnel the broccoli into your serving bowl. Some pieces may stick to the foil, but should be easily removed. It's now ready to serve."
  ],
  "ingredients": [
    "0",
    "3 - 4 crowns fresh broccoli",
    "2 - 3 tbsp olive oil (to taste)",
    "1/2 - 1 tbsp worcestershire sauce (to taste)",
    "1/2 tbsp Tabasco sauce (or other hot sauce of your choice)",
    "1/2 tbsp kosher salt",
    "1/2 tbsp freshly cracked black pepper",
    "1/2 tbsp garlic powder",
    "1 teaspoon red pepper flakes",
    "1 large container/bowl with sealing lid (tupperware or gladware work best)",
    "1 colander",
    "aluminum foil"
  ],
  "__v": 1
}