{
  "hash": "a5837fb34ad1d5bc6321b293b61fd440a30ee8a8",
  "title": "Meera Sodha's Mum's Chicken Curry",
  "image": "https://images.food52.com/GJzTCwRQOVl9FC8lsF2yKUjM3DM=/753x502/546bb29f-ecbc-42aa-9e0c-b90bf7ade360--2017-0412_moms-chicken-curry_bobbi-lin_22442.jpg",
  "href": "https://food52.com/recipes/69983-meera-sodha-s-mum-s-chicken-curry",
  "extension": "Chrome",
  "firstAdded": "2018-09-12T22:50:26.197000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Put the ghee and oil into a wide-bottomed, lidded frying pan on a medium heat. When it's hot, add the cumin seeds and cinnamon sticks. Let them infuse in the oil for a minute, and then add the onions. Cook for 10 to 12 minutes, stirring occasionally, until golden brown.",
    "Meanwhile, put the ginger, garlic, and green chiles into a mortar and pestle with a pinch of salt and bash to a coarse paste.",
    "Add the paste to the pan and cook gently for 2 minutes, then pour int the strained tomatoes and stir. Cook the strained tomatoes for a few minutes, until the mixture resembles a thick paste, then add the tomato paste, ground cumin, turmeric, and 1/2 teaspoon of salt (or to taste).",
    "Whisk the yogurt and add it slowly to the curry. Cook it through until it starts to bubble, then add the chicken. Pop the lid on the pan and continue to cook on a gentle heat for around 30 minutes. Add the ground almonds and the garam masala and cook for another 5 minutes.",
    "Serve it with a tower of chapatis, hot fluffy naan, or rice, and offer yogurt at the table."
  ],
  "ingredients": [
    "0",
    "Serves: 4",
    "2\ttablespoons ghee or unsalted butter",
    "1\ttablespoon canola oil",
    "1\tteaspoon cumin seeds",
    "Two\t1 3/4-inch cinnamon sticks",
    "2\tlarge onions, finely chopped",
    "One\t2 1/2-inch piece ginger, peeled and grated",
    "6\tcloves garlic, crushed",
    "2\tfresh green chiles (or 1 teaspoon chili powder)",
    "Salt",
    "3/4\tcup plus 2 tablespoons strained tomatoes (such as Pomì)",
    "2\ttablespoons tomato paste",
    "1 1/2\tteaspoons ground cumin",
    "1/2\tteaspoon ground turmeric",
    "3\ttablespoons whole-milk yogurt (plus extra for serving)",
    "2\tpounds 3 ounces skinless chicken legs, or 1 3/4 pounds skinless, boneless chicken thighs",
    "3\ttablespoons ground almonds",
    "1\tteaspoon garam masala"
  ],
  "__v": 1
}