{
  "hash": "2936f53f310804cb3ba2f4643bf8720b0fbf462b",
  "title": "MANGO STICKY RICE",
  "image": "http://www.meatlovessalt.com/wp-content/uploads/2010/06/IMG_8048-copy2.jpg",
  "href": "http://www.meatlovessalt.com/2010/06/mango-sticky-rice/",
  "extension": "Chrome",
  "firstAdded": "2018-04-09T01:23:44.279000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Soak the sticky rice in water overnight. If using a rice cooker, soak the rice in the amount of water you intend to cook it in (as indicated for sticky rice on the rice cooker), as you will not be able to tell how much water has been absorbed overnight.",
    "Cook the rice in the rice cooker. Meanwhile, heat 3 cups of coconut milk in a saucepan with the salt and sugar. Stir over low heat until dissolved. Set aside.",
    "To prepare the sauce, heat the 1 1/2 cups of coconut milk in another small saucepan with the salt and sugar. Stir over low heat until dissolved. Mix the cornstarch with a little bit of water and stir until dissolved. Add the cornstarch mixture to the coconut milk mixture in the saucepan, stirring until it begins to thicken. Set aside.",
    "When the rice is cooked, spread it in a shallow bowl or pan and slowly add the first coconut milk mixture about 1/4 cup at a time, each time stirring well to fully incorporate the liquid. I used a flat rice paddle and kept folding and spreading the rice out. I like my sticky rice moist, so I keep adding the coconut milk mixture until just before the rice stops absorbing any more liquid. Make sure there are no pools of coconut milk in the rice, though. The liquid should be fully absorbed. Cover and let the rice sit for about 10-15 minutes to keep absorbing the coconut milk.",
    "Peel the mangoes and then slice off two sides, leaving the pit in the middle. You should have two palm-sized sides now. Take each side and slice into thick strips. Arrange on a plate and spoon an equal amount of sticky rice next to it. Top the rice with the sauce and sprinkle with toasted sesame seeds, fried mung beans, or toasted shredded coconut."
  ],
  "ingredients": [
    "0",
    "3 cups of raw glutinous rice (also called sweet rice or sticky rice)",
    "3 cups of coconut milk",
    "1 tsp salt",
    "1/2 cup white sugar",
    "1 1/2 tsp toasted sesame seeds, salted fried mung beans, or toasted shredded coconut (optional)",
    "3 ripe mangoes, preferably yellow Champagne mangoes",
    "Sauce:",
    "1 1/2 cup of coconut milk",
    "1/2 tsp salt",
    "1/2 cup white sugar",
    "1 1/2 tsp corn starch"
  ],
  "__v": 1
}