{
  "hash": "e7eee45a2a7b03a4dc6f4ee8a30d24d790a3edf6",
  "title": "Sausage Phyllo Rolls",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2009/4/17/0/spinach-phyllo-wraps_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/food-network-kitchens/sausage-phyllo-rolls-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-05-18T12:24:12.336000",
  "users": [
    null
  ],
  "keywords": [
    "cooking",
    "spray",
    "olive",
    "oil",
    "cremini",
    "mushrooms",
    "onion",
    "salt",
    "hot",
    "italian",
    "turkey",
    "sausage",
    "casings",
    "crumbled",
    "reducedfat",
    "cream",
    "cheese",
    "neufchatel",
    "room",
    "cheddar",
    "sheets",
    "phyllo",
    "dough"
  ],
  "directions": [
    "0",
    "Preheat the oven to 375 degrees F. Spray a baking sheet with nonstick cooking spray and keep nearby.",
    "Heat the oil in a large nonstick skillet over medium-high heat. Add the mushrooms, onion, and salt. Cook, stirring occasionally, over medium heat, until the mushroom mixture is very tender, about 8 minutes. Remove from the heat. Stir in the turkey, cream cheese, and Cheddar until well blended.",
    "Place 1 sheet of phyllo with the short side facing you on a work surface. (Cover remaining phyllo with plastic wrap to keep from drying out.) Spray the phyllo sheet with nonstick cooking spray. Then fold it in half lengthwise and spray again. Place 1 heaping tablespoon filling in the center of the bottom end of the phyllo. Fold in the sides, then roll up from the bottom to completely enclose the filling (it should look like an egg roll). Place the roll, seam side down, on the baking sheet. Repeat with remaining phyllo sheets, nonstick cooking spray, and filling to make a total of 16 rolls.",
    "Spray the rolls generously with nonstick cooking spray and bake until the rolls until lightly golden, about 20 minutes.",
    "Per Serving: Calories 220; Total Fat 10 g; (Sat Fat 3.5 g, Mono Fat 3 g, Poly Fat 0.6 g) ; Protein 10 g; Carb 23 g; Fiber 1 g; Cholesterol 26 mg; Sodium 555 mg",
    "Food Network Kitchens created this lightened-up recipe from a user submission. Click here to see the original recipe.",
    "Click here to submit a recipe to be made over.",
    "From Food Network Kitchens"
  ],
  "ingredients": [
    "0",
    "Nonstick cooking spray",
    "1 tablespoon olive oil",
    "1 (6-ounce) package cremini mushrooms, finely chopped",
    "1 onion, finely chopped",
    "1/2 teaspoon salt",
    "1/2 pound hot Italian turkey sausage, casings removed and crumbled",
    "2 ounces reduced-fat cream cheese (Neufchatel), at room temperature",
    "1/2 cup reduced-fat shredded Cheddar",
    "16 (9 by 14-inch) sheets phyllo dough"
  ],
  "__v": 1
}