{
  "hash": "62744ba8b19682fd32cd1a0188839f726b7184e0",
  "title": "UBC CINNAMON BUNS",
  "image": "",
  "href": "https://ubccinnamonbun.blogspot.com/",
  "extension": "Chrome",
  "firstAdded": "2020-04-06T02:35:35.924000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Dissolve 3/4tsp sugar in the warm water and stir in yeast. Let sit until foamy app 10 min.",
    "Scald the milk ( I used a candy thermometer 175 degrees F) stir in butter, sugar and salt then let cool to luke warm",
    "In a large bowl beat eggs, add to milk mixture, stir in foamed yeast. Add 1 3/4 cup flour and beat well for 10 minutes. ( I did this by hand using a wooden spoon as it's such a small amount).",
    "Slowly add the rest of the flour continuously. Turn dough out onto a well floured surface then knead until smooth and elastic, about 3-4 minutes. Place in a well greased bowl, I used a little safflower oil, cover with some plastic wrap and a damp cloth then let rise in a warm place for app 1 hour or double in size.",
    "Prepare the glaze by melting the sugar slowly over low heat, making sure it doesn't burn. Once melted add the 6tbs butter and blend together. Finally add the 1tsp cinnamon, stir and pour into bottom of baking pan. I used a 9 inch square pan with 2 inch sides.",
    "Prepare filling, sugar and cinnamon only, melt the 2.5tbs butter separately.",
    "As before roll out the dough. Make sure to roll it out a lot, app 18 x 24\".",
    "Brush dough with butter, sprinkle with filling than roll up starting with the 18\" side. this ensures you get many thin layers. As I rolled I brushed the top of the roll with a bit of the remaining melted butter. Finally, cut the roll into 9 equal pieces and arrange cut side up in the pan with the glaze."
  ],
  "ingredients": [
    "0",
    "Dough:",
    "1 1/2 pkg active dry yeast (12 grams or 3 1/4 teaspoons) (mixed with 3/4 tsp sugar in a tich more than 1/8 cup warm water)",
    "3/4 cup whole milk scalded",
    "1/2 cup unsalted butter",
    "1/3 cup sugar - brown Demerara",
    "3/4 tsp salt",
    "3 large eggs mixed together",
    "3 1/3 cups all purpose flour (I'm using Anita's organic All Purpose flour)",
    "Filling:",
    "6 tbs sugar - brown Demerara",
    "6 tbs ground cinnamon",
    "2.5 tbs unsalted butter melted",
    "Glaze: (this goes in the bottom of the pan)",
    "5 tbs brown (demerrara) sugar",
    "1 tsp ground cinnamon",
    "6 tbs melted unsalted butter",
    "Glaze for top of buns once risen:",
    "1tsp sugar white sprinkled on top"
  ],
  "__v": 5
}