{
  "hash": "cd114578860a96692fb6f03e7bc3e1bbc14719bc",
  "title": "Salmon Benny Breakfast Bombs",
  "image": "https://cdn4.ruled.me/wp-content/uploads/2017/05/salmon-benny-breakfast-bombs-2nd.jpg",
  "href": "https://www.ruled.me/salmon-benny-breakfast-bombs/",
  "extension": "Chrome",
  "firstAdded": "2017-07-10T22:06:11.846000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Ensure you have all your ingredients for hollandaise ready and sitting at room temperature.",
    "Grab a small pot and fill with water then put on the stove to boil. Once the water is boiling add your 2 whole eggs and let them boil for 10-12 minutes. You want your eggs to be hard boiled as we will be adding hollandaise to these.",
    "While you are waiting for your eggs to boil, take your salmon slices and finely dice. Ensure they are separated once cut.",
    "Preheat a pan over high-heat and add the 2 teaspoons of butter. Once the butter has heated up, take approximately half of the cut up salmon and add into the pan then crisp into little crunchy pieces. Set aside.",
    "Once your eggs have boiled for 10-12 minutes run the eggs and pot under cold water and allow the eggs to cool before peeling.",
    "When your eggs have cooled, place them in a dish and use a fork to finely mash the egg.",
    "After you have your eggs and salmon prepared you can make a start on your hollandaise. Don’t try and do this at the same time as it will need your full attention to avoid clumps and splitting.",
    "Take a pot and fill with a cup or two of water and place on the stove to simmer.",
    "Melt the 2 tablespoons of butter in the microwave for 30-60 seconds. You want your butter to be melted but not hot. Set aside.",
    "In a large heat-safe bowl whisk the egg yolk, lemon juice, dijon mustard and a pinch of salt together until you see air bubbles.",
    "Place the bowl with egg mixture over the pot with the simmering water to create a double boiler. Make sure that the water does not touch the bottom of the bowl. Use medium heat and continuously whisk the mixture until it starts to thicken.",
    "Once the mixture starts thickening, slowly pour in the melted butter while stirring with a whisk. Ensure you keep stirring the entire time to avoid clumps. Once all of the butter is added, place the bowl back onto the pot to thicken further.",
    "When the sauce has fully thickened you can remove it and set to the side. If the sauce is too thick add a tiny bit of water to thin, but remember we want a thick consistency.",
    "Allow your hollandaise to cool to room temperature. We don’t want to cook the salmon when we add the hollandaise, so it is crucial this is cool (unless you like your salmon cooked).",
    "Take the raw salmon. hollandaise, half the chives, and mix well with the mashed egg. This should form a firm mixture. You don’t want this to be too wet so limit the hollandaise if you see this happening.",
    "Once combined, split mixture into four pieces and roll into balls.",
    "Mix your remaining chives and the crispy salmon together and roll your bombs in this to coat."
  ],
  "ingredients": [
    "0",
    "2 large eggs",
    "4 ounces smoked salmon slices",
    "½ tablespoon salted butter",
    "2 tablespoons fresh chives, chopped",
    "Salt and pepper to taste",
    "2 tablespoons salted butter",
    "1 large egg yolk, separated from the white",
    "¼ teaspoon Dijon mustard",
    "2 teaspoons lemon juice, freshly squeezed*",
    "½ tablespoon water, add more if too thick",
    "Salt to taste"
  ],
  "__v": 1
}