{
  "hash": "a586c8ae1f387197a120cd74821a3450d1ca50cb",
  "title": "Uchepos",
  "image": "https://patijinich.com/wp-content/uploads/2015/04/012716_PattiJ_S4_Uchepos_162_Cropped-912x622.jpg",
  "href": "https://patijinich.com/recipe/sweet-corn-tamales/",
  "extension": "Chrome",
  "firstAdded": "2017-10-29T11:59:00.072000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To make the corn dough or masa: Carefully peel the husks from the ears of corn. It helps if you slice 1/4-inch or so from the bottom part of the corn. Place the husks in a large bowl and cover with hot water. (If using dried corn husks, soak in hot water.)",
    "Rinse the peeled corn thoroughly. Shave the corn kernels off and place in a food processor or blender along with the sweetened condensed milk. Process until you get as smooth consistency as you can. Incorporate the corn meal or rice flour until you get a moist, but not wet, dough consistency. Season with the cinnamon and salt and mix well.",
    "To prepare the tamalera or steamer: Place water in the bottom pan of a steamer (so that water is under the steamer) and bring it to a simmer. Line the steamer with one or two layers of soaked corn husks.",
    "To assemble the tamales: Lay out a corn husk with the tapering end towards you. If the fresh corn husks are too thin, use 2 or 3 fanned together. Spread about 3 tablespoons of dough or masa into about a 2 to 3-inch square, the layer should be about 1/4-inch thick, leaving a border of at least 1/2-inch on the sides.",
    "Pick up the two long sides of the corn husk and bring them together and fold the folded sides to one side, rolling them in the same direction around tamal. Fold up the empty section of the husk, with the tapering end, from the bottom up. This will form a closed bottom and the top will be left open.",
    "Prepare all the tamales and place them as vertically as you can in a container.",
    "To cook tamales: When you have all tamales ready place them, again as vertically as you can, into the prepared steamer, with the open end on top. If there is space left in the steamer, tuck in some cornhusks, so the tamales won’t dance around. Cover with more cornhusks, and steam covered with a lid anywhere from 55 minutes to an hour. You know the tamales are ready when they come easily free from the husks.",
    "Serve hot, along with fresh Mexican cream and crumbled queso fresco on the side."
  ],
  "ingredients": [
    "0",
    "10large tender ears of cornwith fresh corn husks attached",
    "3/4cupsweetened condensed milk",
    "1/4cupcorn meal or rice flourmore as needed",
    "1teaspoonground canela or cinnamon",
    "1/4teaspoonkosher or coarse sea salt",
    "Fresh corn husks from the ears of cornto make the tamales or dried corn husks",
    "Mexican cremaoptional topping",
    "queso frescooptional topping"
  ],
  "__v": 1
}