{
  "hash": "cf6141f4525cf5270d30d8185450a2cdea7d2732",
  "title": "the ultimate winter bliss bowls",
  "image": "http://cdn.pinchofyum.com/wp-content/uploads/The-Ultimate-Bliss-Bowl-with-Tahini.jpg",
  "href": "http://pinchofyum.com/the-ultimate-winter-bliss-bowls",
  "extension": "Chrome",
  "firstAdded": "2016-12-10T19:25:54.941000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "NSTRUCTIONS",
    "Falafel: Make this falafel so you have it all ready to go! It takes about 30 minutes.",
    "Roasted Veggies: Preheat the oven to 400 degrees. Peel the carrots and cut into thin strips and place on a roasting pan (a jelly roll pan works well because then the veggies don't slide off). Chop the cauliflower into small florets and place on a separate roasting pan. Drizzle each pan with oil and sprinkle each pan with cumin, salt, and pepper. Toss around on the pan to combine. Bake for 20-30 minutes - stir occasionally, but not too often otherwise you'll disrupt the browning process. To get more browning, bake for an additional 10-15 minutes. When the veggies are done, remove from oven and set aside to cool.",
    "Bliss Bowl Assembly: Assemble spinach, red cabbage, falafel, carrots, and roasted cauliflower in the bowls. Top with jalapeño and pistachios. Drizzle with tahini, lemon juice, honey, olive oil, and salt and pepper as needed.",
    "NOTES",
    "Nutrition information is for THE BASE of the bowl (the fresh veggies, the roasted veggies, and the nuts), without falafel, and without dressing. The falafel post includes its own nutrition labelso you can tally up the total as needed.",
    "Generally speaking, the amounts will vary greatly with this recipe because a lot depends on how much and what you use for toppings.",
    "simple 5 ingredient baked falafeleasy turkey pho",
    "ABOUT LINDSAY",
    "A little thing about me: I ♡ FOOD. I also love food photography. I wrote an ebook that can help you learn your camera and I also teach food photography workshops in our Minneapolis studio.",
    "Did you make a recipe? Tag @pinchofyum on Instagram or send me a snap. I WANNA SEE!",
    "facebook instagram pinterest",
    "ADVERTISEMENT",
    "leave a COMMENT",
    "RATE THIS RECIPE:",
    "Notify me of follow-up comments by email.",
    "Notify me of new posts by email.",
    "98 comments",
    "katrina",
    "NOVEMBER 23, 2015 AT 10:39 AM",
    "Winter bliss indeed!! What a beauty!",
    "reply",
    "lindsay",
    "NOVEMBER 23, 2015 AT 8:04 PM",
    "Thanks Katrina!",
    "reply",
    "dayna @ tabs and tidbits",
    "NOVEMBER 23, 2015 AT 10:41 AM",
    "I made the baked falafel this past weekend. Between my husband and myself there are none left. They were so good! This winter bliss bowl looks divine. Now I have another excuse to make the baked falafel. 🙂",
    "reply",
    "lindsay",
    "NOVEMBER 23, 2015 AT 8:05 PM",
    "That’s so fun to hear Dayna!",
    "reply",
    "jill",
    "NOVEMBER 23, 2015 AT 10:54 AM",
    "Sign me up for team BB! Looks SO delicious and nutritious 🙂 Love that roasted cauliflower!",
    "reply",
    "lindsay",
    "NOVEMBER 23, 2015 AT 8:05 PM",
    "I just can’t get enough! Thanks for the kind words Jill!",
    "reply",
    "dani mendocha | styled variety",
    "NOVEMBER 23, 2015 AT 11:20 AM",
    "These bowls sound AMAZING! 🙂 Loving this healthy winter meal!",
    "Dani | http://www.styledvariety.com",
    "reply",
    "lindsay",
    "NOVEMBER 23, 2015 AT 8:09 PM",
    "Thanks Dani!",
    "reply",
    "heather (delicious not gorgeous)",
    "NOVEMBER 23, 2015 AT 11:43 AM",
    "yes! so down for healthy (but stll cozy!) fare. and now that you mention pita, i can’t help but imagine all this in a pita with tzaziki.",
    "reply",
    "lindsay",
    "NOVEMBER 23, 2015 AT 8:11 PM",
    "Yes! Tzatziki! Want.",
    "reply",
    "nicole",
    "NOVEMBER 23, 2015 AT 11:46 AM",
    "This looks incredibly healthy, filling, and comforting. There are so many flavors going on. I bet you don’t get bored eating this dish. Thanks for sharing.",
    "reply",
    "lindsay",
    "NOVEMBER 23, 2015 AT 8:12 PM",
    "Tru dat! No boredom here. Thanks Nicole!",
    "reply",
    "tonya",
    "NOVEMBER 23, 2015 AT 11:50 AM",
    "Blissful Bowls Be Banging!!! ????????",
    "reply",
    "lindsay",
    "NOVEMBER 23, 2015 AT 8:12 PM",
    "Thank you Tonya! 🙂 B to the 4th!",
    "reply",
    "brittany | words like honeycomb",
    "NOVEMBER 23, 2015 AT 12:16 PM",
    "I love WARM bowls and the fact that “bliss” is involved…I mean it doesn’t get any better. I also say it is totally professional to wear slipper booties in your totally professional studio.",
    "Just thought you may need to know that…",
    "reply",
    "lindsay",
    "NOVEMBER 23, 2015 AT 8:12 PM",
    "Yes. For sure. That’s my definition of professional.",
    "reply",
    "mary",
    "NOVEMBER 23, 2015 AT 12:23 PM",
    "I’m trying this tomorrow..everyone here loves falafel and veggies. Oh, and knee high woolen socks and a big fuzzy sweater should help, I hope.",
    "reply",
    "lindsay",
    "NOVEMBER 23, 2015 AT 8:13 PM",
    "Yes indeed! That will help immensely. 😉",
    "reply",
    "allysonr.",
    "NOVEMBER 23, 2015 AT 12:24 PM",
    "I love salads, but whoever thought it was a good idea to eat cold salads year round was NOT from Minnesota. Or anywhere else where it snows six months a year. This looks like exactly what I want to eat for lunches during the winter.",
    "reply",
    "lindsay",
    "NOVEMBER 23, 2015 AT 8:13 PM",
    "Right?? So glad we’re on the same page Allyson! 😉",
    "reply",
    "kari",
    "NOVEMBER 23, 2015 AT 12:26 PM",
    "Totally not wanting to have salads right now! This is a great healthy alternative!",
    "Kari",
    "http://www.sweetteasweetie.com",
    "reply",
    "lindsay",
    "NOVEMBER 23, 2015 AT 8:14 PM",
    "Thanks Kari! 🙂",
    "reply",
    "emily | robust recipes",
    "NOVEMBER 23, 2015 AT 12:26 PM",
    "This is exactly what is needed during winter! The struggle is real with wanting to eat cold salads in the winter, yet the need for all the veggies that salads provide. I love this bliss bowl idea, and the name is adorable! Hope you warm up soon, I feel ya!",
    "reply",
    "lindsay",
    "NOVEMBER 23, 2015 AT 8:14 PM",
    "Thanks Emily! 🙂 Appreciate that!",
    "reply",
    "michelle @ modern acupuncture",
    "NOVEMBER 23, 2015 AT 12:29 PM",
    "Amazing 🙂 Just what I need before and after Thanksgiving, to offset all the heavy food that’s on the way. Still have yet to make my own falafel, but I feel like you’re making it mandatory here… I mean, how could I not??",
    "reply",
    "lindsay",
    "NOVEMBER 23, 2015 AT 8:14 PM",
    "Mandatory! Get on that, Michelle!",
    "reply",
    "linda | the baker who kerns",
    "NOVEMBER 23, 2015 AT 12:43 PM",
    "Oh I love making bliss bowls! This is perfect because during the winter months I am a roasting vegetable addict! And I just started getting into tahini so I’m pumped to make some delicious dressings. Gotta try that falafel though!",
    "reply",
    "lindsay",
    "NOVEMBER 23, 2015 AT 8:14 PM",
    "Yay! Glad you are into this whole bliss bowl thing Linda 😉",
    "reply",
    "natasha @ salt and lavender",
    "NOVEMBER 23, 2015 AT 2:07 PM",
    "You’re so right… we need more plants in our lives. These bowls are a great idea. Might not be as good as the burgers I am constantly craving these days, but they are much healthier and I am sure they taste fantastic!",
    "reply",
    "lindsay",
    "NOVEMBER 23, 2015 AT 8:15 PM",
    "The struggle is all too real. 🙂 Thanks Natasha!",
    "reply",
    "emilie @ emilie eats",
    "NOVEMBER 23, 2015 AT 9:25 PM",
    "Could you even go wrong with falafel in a recipe?? Nooo, definitely. But you took falafel to the next level in a BOWL. What’s better than throwing all sorts of health into a bowl and stuffing your face with it? Nada.",
    "reply",
    "kristin @ pinch of yum",
    "NOVEMBER 25, 2015 AT 2:47 PM",
    "Agreed! 🙂",
    "reply",
    "dawn martin",
    "NOVEMBER 23, 2015 AT 9:26 PM",
    "Oh good gravy! Thank you for the timely post!! Our first snow this weekend put me in full-on comfort food mode….fried pork tenderloins, mashed potatoes, chicken pot pie. Need BBs stat!",
    "reply",
    "sondi",
    "NOVEMBER 23, 2015 AT 11:14 PM",
    "Interesting! I have never heard of ‘bliss bowls’. I’ve always referred to something like this as a ‘buddha bowl’ (well, just in my head, not out loud). And apparently they’re also called ‘glory bowls’ too – th0ugh between you, me and the internet, that last one sounds kinda dirty.",
    "On a related note, where did you get the ceramic/stone bowl in the photo? I’ve been seeing that bowl in a few of your other posts and think it’s so pretty.",
    "reply",
    "kristin @ pinch of yum",
    "NOVEMBER 25, 2015 AT 2:46 PM",
    "Hi, Sondi! The ceramic bowl was made for Lindsay by her father in law. 🙂",
    "reply",
    "katie",
    "NOVEMBER 24, 2015 AT 5:40 AM",
    "Very beautiful recipe! Looks so tasty want to have it right know! Love your food photography 🙂 really impressive! xoxo Katie from http://www.whatskatieupto.com",
    "reply",
    "kristina",
    "NOVEMBER 24, 2015 AT 6:26 AM",
    "I love this, I do a similar thing with different grains and I always called them just grain bowl (can I be even more boring). Anyway, this sounds delicious. Never made a baked falafel though, sounds great!",
    "reply",
    "kristin @ pinch of yum",
    "NOVEMBER 25, 2015 AT 2:45 PM",
    "Hope you like it, Kristina!",
    "reply",
    "alison scofield",
    "NOVEMBER 24, 2015 AT 9:15 AM",
    "Northern Minnesotan here – you are so right! I really struggle with eating healthy in the winter because I want warm food. And you can only have so many variations of soup, right? This looks delicious!",
    "reply",
    "alison scofield",
    "NOVEMBER 24, 2015 AT 9:16 AM",
    "Could I swap the spinach with kale or arugula? I’m allergic to spinach.",
    "reply",
    "kristin @ pinch of yum",
    "NOVEMBER 25, 2015 AT 2:45 PM",
    "Absolutely!",
    "reply",
    "hannah elizabeth",
    "NOVEMBER 24, 2015 AT 11:19 AM",
    "Oh. Yum. I want this in my life already!!! Falafel is one of my current food favs, so you are killing me right now! Plus, anything with pita, naan or anything soft and sandwich-y automatically owns my food heart. So you have me super-excited for that upcoming post. ????",
    "reply",
    "kristin @ pinch of yum",
    "NOVEMBER 25, 2015 AT 2:43 PM",
    "Great! Hope you like these, Hannah. 🙂",
    "reply",
    "isabel",
    "NOVEMBER 25, 2015 AT 9:35 AM",
    "We call these wonder bowls in my house!",
    "reply",
    "kristin @ pinch of yum",
    "NOVEMBER 25, 2015 AT 2:29 PM",
    "Love that! 🙂",
    "reply",
    "luvalissa",
    "NOVEMBER 25, 2015 AT 6:14 PM",
    "UHM I just made this (minus the falafel part) and it was DELISH! I substituted some items based on what what in my fridge. So I roasted broccoli, zucchini, red pepper, mushrooms, chick peas, and sweet potatoes. I have to say that I tried tahini once and was not a fan, but this recipe actually changed my mind. Also, the cumin flavour from the roasted veg, paired with the sauce, and the fresh jalapeños was awesome. A very hearty and satisfying vegan dinner. Thanks so much for sharing 🙂",
    "reply",
    "kristin @ pinch of yum",
    "NOVEMBER 27, 2015 AT 1:54 PM",
    "Love hearing that, Alissa!",
    "reply",
    "hannah hossack-lodge",
    "NOVEMBER 26, 2015 AT 7:37 AM",
    "This looks sooo good! I really struggle to eat healthily during the winter when all I want to eat is warm carbs… but if anything can tempt me to crave healthy food it would be this!",
    "reply",
    "kristin @ pinch of yum",
    "NOVEMBER 27, 2015 AT 1:35 PM",
    "Hope you like it, Hannah!",
    "reply",
    "evelyn",
    "NOVEMBER 27, 2015 AT 8:20 AM",
    "Thanks for the recipe, I made this yesterday and it was absolutely delicious. I combined it with your 5 minute green goddess sauce (or whatsitsname) and it was a glorious combination!",
    "reply",
    "kristin @ pinch of yum",
    "NOVEMBER 27, 2015 AT 1:23 PM",
    "Awesome, Evelyn!",
    "reply",
    "seenasfoodbasket",
    "NOVEMBER 28, 2015 AT 3:32 AM",
    "Lindsay, this one looks so healthy, tasty and filling one.. Love it..",
    "reply",
    "kristin @ pinch of yum",
    "NOVEMBER 30, 2015 AT 2:40 PM",
    "Thanks!",
    "reply",
    "laura",
    "NOVEMBER 29, 2015 AT 9:29 PM",
    "Just made for this weeks lunches! Looking forward to lunch tomorrow 🙂",
    "reply",
    "kristin @ pinch of yum",
    "NOVEMBER 30, 2015 AT 2:24 PM",
    "Yay! Enjoy, Laura!",
    "reply",
    "larissa",
    "NOVEMBER 30, 2015 AT 8:02 AM",
    "I came across this by accident when I was procrastinating on Buzzfeed today and I’m so glad I did! I’ve been feeling so unhealthy lately, eating junk and exercising less now that the sun no longer shines. I caught my first cold of the season and as I was eating my salad of winter vegetables today (which was still delicious, to be fair), I couldn’t help pining for something a bit more wintery, warm yet still crunchy. It’s a sign that I stumbled upon your recipe. Adding everything to my grocery list right away!",
    "reply",
    "kristin @ pinch of yum",
    "NOVEMBER 30, 2015 AT 2:18 PM",
    "Enjoy, Larissa!",
    "reply",
    "kate",
    "DECEMBER 2, 2015 AT 3:36 PM",
    "Holy Moly! I just came across your website and I am so sad that I’ve lived this long without some of this food. This bliss bowl is my new favorite lunch (minus the spinach—I just can’t do spinach). Regardless, it tastes SO good on a cold December afternoon. I made everything on Monday and I’ve looked forward to lunch every day since the last bite of lunch the day before. THANK YOU!",
    "reply",
    "kristin @ pinch of yum",
    "DECEMBER 3, 2015 AT 1:23 PM",
    "Great! So glad you enjoyed this, Kate. 🙂",
    "reply",
    "lauren",
    "DECEMBER 7, 2015 AT 5:40 PM",
    "Made this last week (at the request of my husband) and the flavors were so amazing! It just all works so well together. I think I’ll be lazy next time and just throw some plain chickpeas in instead of the falafel but the carrots, cauliflower (our favorite part), spinach, cabbage and drizzle of tahini and lemon juice was delicious. Oh and I quick pickled the jalapenos and they really took things to the next level!",
    "reply",
    "kristin @ pinch of yum",
    "DECEMBER 8, 2015 AT 7:03 AM",
    "Awesome! Glad you liked it, Lauren!",
    "reply",
    "katherine",
    "DECEMBER 18, 2015 AT 2:17 AM",
    "Made this for dinner tonight! So good!!! Can’t wait to eat my leftovers for lunch tomorrow ????",
    "reply",
    "kristin @ pinch of yum",
    "DECEMBER 21, 2015 AT 2:22 PM",
    "Love hearing that! Thanks, Katherine. 🙂",
    "reply",
    "naomi",
    "DECEMBER 20, 2015 AT 10:34 AM",
    "This looks amazing! How do you think it would be with some jasmine rice?",
    "reply",
    "kristin @ pinch of yum",
    "DECEMBER 21, 2015 AT 1:48 PM",
    "I think that would be great! 🙂",
    "reply",
    "sherri",
    "DECEMBER 22, 2015 AT 7:54 PM",
    "Opps I think you wrote that this recipe yields ‘4 servings’…I’m pretty sure it only yields ‘1’ – only ’cause I would want to eat it all!",
    "reply",
    "kristin @ pinch of yum",
    "DECEMBER 23, 2015 AT 9:14 PM",
    "Ha! So true, Sherri!",
    "reply",
    "raquel brandao",
    "DECEMBER 24, 2015 AT 12:13 PM",
    "Look really really good!!!",
    "love your blog by the wa, very inspiring recipes",
    "xx",
    "Raquel B. from http://www.avocadosandbananas.wordpress.com",
    "reply",
    "kristin @ pinch of yum",
    "DECEMBER 29, 2015 AT 3:15 PM",
    "Thanks, Raquel!",
    "reply",
    "chrissy",
    "JANUARY 9, 2016 AT 11:35 AM",
    "We absolutely loved this recipe! I was kinda dragging my heels to make the falafel but it ended up being way too easy (and quick!) once I got started. We used the Oh She Glows lemon tahini sauce on top and I ate all of it way too fast. Made for a great lunch at work the next day.",
    "reply",
    "kristin @ pinch of yum",
    "JANUARY 15, 2016 AT 2:24 PM",
    "Glad to hear that, Chrissy!",
    "reply",
    "lacey-angel",
    "JANUARY 18, 2016 AT 10:53 PM",
    "Hello! I follow you on Instagram, and the other day you posted a Mediterranean bowl. Did you share that recipe anywhere? It looked so delicious! I love Mediterranean food and I am striving to cook healthy! Thank you for sharing your talent! It has greatly improved my health and my life! ❤",
    "reply",
    "lacey-angel",
    "JANUARY 18, 2016 AT 10:58 PM",
    "Nevermind, I found it! Oh I can’t wait to make this! I’ll be sure to send you some love on Insta and let you know how it went! Thank you!",
    "reply",
    "lauren",
    "JANUARY 21, 2016 AT 12:08 AM",
    "Hi! When you assemble these for lunches, do you warm them up or go chilly? Thanks!",
    "reply",
    "kristin @ pinch of yum",
    "JANUARY 21, 2016 AT 6:38 AM",
    "Honestly, either way is fine! It’s totally your preference. 🙂",
    "reply",
    "jenn",
    "JANUARY 30, 2016 AT 12:51 PM",
    "this is amazing!!! thank you for posting it! i have been making lots of bowl foods lately but have been looking to buy bowls. the one in your photos is amazing! where did you get it?",
    "reply",
    "kristin @ pinch of yum",
    "FEBRUARY 1, 2016 AT 3:07 PM",
    "That bowl was actually made for Lindsay by her father in law!",
    "reply",
    "bonnie",
    "FEBRUARY 2, 2016 AT 6:28 PM",
    "Usually when you see a photo of food like this it is too good to be true! I just finished my bowl and my husband is in his second! Thank you so much for sharing this recipe! The combo of everything together is pure yum! This is the first falafel recipe that I will make again and again! Thank you !",
    "reply",
    "kristin @ pinch of yum",
    "FEBRUARY 3, 2016 AT 2:15 PM",
    "So glad you liked it, Bonnie!",
    "reply",
    "lauren",
    "FEBRUARY 3, 2016 AT 7:56 PM",
    "Just made this tonight and I’m in love! I used tzatziki on top instead of what is suggested above and it was awesome too! Definitely making this again soon 🙂 thank you for sharing!",
    "reply",
    "kristin @ pinch of yum",
    "FEBRUARY 4, 2016 AT 3:22 PM",
    "Yum! I bet tzatziki was a great alternative!",
    "reply",
    "ashley",
    "FEBRUARY 10, 2016 AT 1:35 PM",
    "This looks SO good! Beats a bowl at Chipotle anyday! 🙂",
    "reply",
    "adriene",
    "FEBRUARY 13, 2016 AT 5:14 PM",
    "For the dressing drizzles, do you drizzle each ingredient individually or mix them into more of a dressing? If a dressing what ratios would you recommend?",
    "reply",
    "kristin @ pinch of yum",
    "FEBRUARY 14, 2016 AT 2:53 PM",
    "Hi, Adriene! You could honestly use the ingredients either individually or as a dressing – whatever you prefer. I don’t remember specific ratios we used – we just mixed up a dressing to taste. If you experiment I bet you’ll get a tasty result!",
    "reply",
    "teri",
    "APRIL 7, 2016 AT 8:17 PM",
    "Hi there beautiful dish looking forward to making it. Where did you get the bowl?",
    "reply",
    "jenna @ pinch of yum",
    "APRIL 8, 2016 AT 10:55 AM",
    "Hey Teri! The bowl is actually made by Lindsay’s father-in-law.",
    "reply",
    "k",
    "JUNE 10, 2016 AT 10:23 PM",
    "I am eating this RIGHTNOW with tahini dressing AND magic green sauce. Everything is AMAZING. My tummy is so happy, and I am already excited to make the naan-wiches this weekend. 😀",
    "reply",
    "jenna @ pinch of yum",
    "JUNE 14, 2016 AT 1:16 PM",
    "Glad to hear it! 🙂",
    "reply",
    "scott",
    "NOVEMBER 9, 2016 AT 7:27 AM",
    "Looks so tasty! I should say that this is really perfect even if it’s not winter. Will be trying it this weekend. Thank you Lindsay for sharing this.",
    "reply",
    "jenna @ pinch of yum",
    "NOVEMBER 9, 2016 AT 3:22 PM",
    "Hope you enjoy it!",
    "reply",
    "alix @a hedgehog in the kitchen",
    "NOVEMBER 9, 2016 AT 11:40 AM",
    "I love the name “BLISS BOWL” – it has a gorgeous ring to it. I also agree that creating one is a formula – a formula that everyone should learn ASAP to stay healthy, happy and fulfilled this Winter! Thanks so much, Lindsay!",
    "reply",
    "marjorie",
    "NOVEMBER 19, 2016 AT 10:25 AM",
    "hi, i am going to make the bowl today. one quick question: do you combine all of the drizzle ingredients? i picked up some tahini paste for the first time, and i don’t see how that can drizzle on its own. thanks.",
    "reply",
    "marjorie",
    "NOVEMBER 19, 2016 AT 11:18 AM",
    "Hi, Just a quick question. Do you have any guidelines as to the amounts of the individual ingredients used in the drizzle? Thanks.",
    "reply",
    "kashish rice",
    "NOVEMBER 22, 2016 AT 2:32 AM",
    "Nice nutritious and delicious dish that contains 0% cholesterol. It is good for heart health.",
    "Kashish Food imports Basmati Rice in Auckland New Zealand for making healthy and tasty dishes.",
    "reply",
    "ana@cibo4food",
    "NOVEMBER 24, 2016 AT 9:42 AM",
    "There is nothing as nice as a tasty but healthy meal like this. Looking forward to trying this recipe!!",
    "reply",
    "betty dotson",
    "NOVEMBER 28, 2016 AT 7:40 AM",
    "What brand of food processor do you recommend? I have a mini one, but since falling in love with every recipe here, ( except the fish ones Eeewwwee!) I see a need for a larger one. Thanks",
    "reply",
    "billy",
    "DECEMBER 2, 2016 AT 2:37 PM",
    "That is 1 delicious looking bowl. Love the colors and love the tahini Honey Dressing.",
    "reply",
    "laureen hillier",
    "DECEMBER 9, 2016 AT 9:25 PM",
    "This was marvellous! We had a surplus of roasted cauliflower, but we ate them all the next day – can I just say how good these are cold from the fridge? Mmmm-miammm. The winter bowls themselves are a nice explosion of colour – they are just as beautiful as they are tasty. LOVE this recipe. Thanks so much!",
    "reply",
    "HEY! NICE TO MEET YOU!",
    "I'm Lindsay: former 4th grade teacher, now full time blogger. My husband Bjork and I live in Minnesota. Favorite things include my camera, lake days, and dark chocolate. Learn more.",
    "our LATEST VIDEOS",
    "popular POSTS",
    "HEALTHY",
    "baked mozzarella chicken rolls",
    "VEGETARIAN",
    "garlic butter spaghetti with herbs",
    "QUICK AND EASY",
    "creamy cauliflower garlic rice",
    "QUICK AND EASY",
    "garlic parmesan chicken lasagna bake",
    "blogging tips",
    "delivered straight",
    "to your inbox",
    "blogger RESOURCES",
    "TOP POSTS",
    "1 Avoiding Blog Burnout",
    "2 Blogging as a Couple",
    "3 Building a Blog while Traveling",
    "4 How to Start a Food Blog",
    "5 Creating an Income",
    "6 Tools Bloggers Shouldn't Live Without",
    "7 Photography Tips",
    "Start, grow, and monetize your food blog.",
    "Join today."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "For the Roasted Veggies",
    "5-7 carrots",
    "1 head cauliflower",
    "2 tablespoons olive oil",
    "4 teaspoons cumin",
    "salt and pepper to taste",
    "For the Bliss Bowls",
    "8-10 pieces of Simple 5 Ingredient Baked Falafel",
    "2-3 cups spinach",
    "1-2 cups chopped red cabbage",
    "1 jalapeño, cut into slices",
    "¼ cup crushed pistachios",
    "tahini, lemon juice, honey, and/or olive oil for drizzling"
  ],
  "__v": 1
}