{
  "hash": "c23be415c8bee4c830465e84c2435ceec54208d8",
  "title": "Pocho Taco",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/pocho-taco",
  "extension": "Chrome",
  "firstAdded": "2017-05-22T15:15:06.138000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparation",
    "Picadillo",
    "Heat oil in a large skillet over high. Cook beef, breaking up with a spoon, until browned all over but not totally cooked through, 6–8 minutes. Transfer to a medium bowl with a slotted spoon.",
    "Reduce heat to medium and cook potato, onion, shallot, and nuts in same skillet, stirring often, until tender and nuts take on a bit of color, 6–8 minutes; season with salt and pepper. Sprinkle in pequin chile, cumin, onion powder, and garlic powder and cook, stirring, until fragrant, about 1 minute. Add broth and beef along with any accumulated juices. Bring to a simmer and cook, stirring and scraping up brown bits, until liquid is evaporated and potato is tender, 12–15 minutes; season with salt and pepper. Transfer to a medium bowl, cover, and let sit until ready to serve.",
    "Salsa and Assembly",
    "Heat broiler. Broil whole tomatoes on a broilerproof baking sheet, turning occasionally, until charred all over, 15–20 minutes. Pulse with onion, garlic, serrano chile, jalapeño, and vinegar in a food processor until mostly smooth but still a little chunky. Transfer salsa to a bowl; season with salt.",
    "Whisk shallot, crème fraîche, chives, and lemon zest and juice in a small bowl; season lemon crème fraîche with salt.",
    "Spoon warm picadillo into shells. Top with cheddar, salsa, chopped tomatoes, cilantro, and a dollop of lemon crème fraîche."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "8 SERVINGS",
    "Picadillo",
    "1 tablespoon vegetable oil",
    "1 pound ground beef chuck (20% fat)",
    "1 large russet potato, peeled, cut into ½-inch pieces",
    "½ medium yellow onion, chopped",
    "1 shallot, finely chopped",
    "¼ cup pine nuts",
    "Kosher salt, freshly ground pepper",
    "1 dried pequin chile, chopped, or ½ teaspoon crushed red pepper flakes",
    "1 teaspoon ground cumin",
    "1 teaspoon onion powder",
    "½ teaspoon garlic powder",
    "1½ cups low-sodium chicken broth",
    "Salsa And Assembly",
    "4 plum tomatoes",
    "¼ medium red onion",
    "3 garlic cloves",
    "1 serrano chile",
    "1 jalapeño",
    "2 tablespoons white wine vinegar",
    "Kosher salt",
    "½ small shallot, finely chopped",
    "1 cup crème fraîche or sour cream",
    "2 tablespoons chopped chives",
    "2 teaspoons finely grated lemon zest",
    "1 tablespoon fresh lemon juice",
    "1 Hard taco shells, grated cheddar, chopped cherry tomatoes, and cilantro (for serving)"
  ],
  "__v": 1
}