{
  "hash": "4905480aad8a1440872ee5032deb984ece103482",
  "title": "Chicken Paprikash",
  "image": "http://cdn2.norecipes.com/wp-content/uploads/2015/01/Chicken-Paprikash-8.jpg?883503",
  "href": "http://norecipes.com/recipe/chicken-paprikash/",
  "firstAdded": "2015-01-16T06:07:11.810000",
  "users": [
    null
  ],
  "keywords": [
    "drumsticks",
    "thighs",
    "chicken",
    "legs",
    "apart",
    "salt",
    "black",
    "pepper",
    "butter",
    "cultured",
    "unsalted",
    "olive",
    "oil",
    "onion",
    "anaheim",
    "paprika",
    "stock",
    "sour",
    "cream",
    "flour",
    "allpurpose"
  ],
  "directions": [
    "0",
    "Use paper towels to thoroughly dry the chicken. Reducing the moisture content on the surface of the chicken is essential to get it to brown.",
    "Sprinkle the chicken evenly with 1/2 teaspoon of salt and 1/4 teaspoon of pepper.",
    "Heat a heavy bottomed pot over medium-high heat until hot. Add the butter, swirl to coat the pan, and then add the chicken in a single layer being careful not to overcrowd the pan. If they don't all fit in your pan, divide the chicken into two batches.",
    "Leave the chicken undisturbed until golden brown on one side (5-7 minutes), and then flip them over and brown the other side. Repeat with the rest of the chicken if necessary.",
    "Transfer the chicken to a bowl and then add the onions and peppers. Cover with a lid and let the vegetables steam for 10 minutes. This speeds up the caramelization process.",
    "Remove the lid and saute until the onions are golden brown.",
    "Add the paprika and fry, stirring constantly until the paprika is very fragrant (about 30 seconds). Be careful as paprika will scorch easily, which will make it bitter.",
    "Add the chicken stock and salt and then return the chicken pieces back to the pot along with any accumulated juices.",
    "Bring to a boil, and then cover with a lid and turn down the heat to maintain a gentle simmer. Cook the chicken until it is fall-off-the-bone tender (about 1 hour).",
    "While you're waiting for the chicken to cook, measure out the sour cream and flour and then whisk together until there are no lumps of flour.",
    "When the chicken is done, temper the sour cream by transferring some cooking liquid from the chicken a spoonful at a time to the cream mixture and stirring after each addition. You want to slowly raise the temperature of the sour cream until it is very warm. Once the sour cream is tempered, you can pour it all back into the pot and stir to combine. Do not let it boil once you've added the sour cream. The Paprikas is done when the sauce has thickened."
  ],
  "ingredients": [
    "0",
    "640 grams chicken - drumsticks and thighs ( 3 whole chicken legs cut apart)",
    "1/2 teaspoon salt",
    "1/4 teaspoon black pepper",
    "1 tablespoon butter – cultured unsalted (or olive oil)",
    "240 grams onion sliced thin (1 large onion)",
    "70 grams Anaheim pepper chopped (1 large pepper)",
    "25 grams paprika (about 1/4 cup)",
    "1 cup chicken stock",
    "1/2 teaspoon salt",
    "1/2 cup sour cream",
    "1 tablespoon flour – all-purpose"
  ],
  "__v": 1
}