{
  "hash": "15bf01f203ce18386eceb9c92a854138a90ec298",
  "title": "Sous Vide Teriyaki Salmon",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2017/09/jouleLogoOrange@2x.png",
  "href": "http://www.simplyrecipes.com/recipes/sous_vide_teriyaki_salmon/",
  "extension": "Chrome",
  "firstAdded": "2017-09-30T17:28:16.583000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Get ready: Pull out 4 freezer bag, and label each bag with the recipe and the basic cooking instructions (you'll thank me for this later when you're trying to remember which recipe to follow!). Flip the zip-top edge of the bag outward, forming a cuff around the bag. This helps the bag stay open and upright.",
    "Fill a large bowl or stock pot with 4 or 5 inches of water. Lay out a kitchen towel.",
    "2 Make the teriyaki marinade: Whisk together the soy sauce, water, brown sugar, and vinegar for the marinade.",
    "3 Cut the salmon into 4 portions (if not already done). Aim for equal portions, though it's fine if they are different shapes. If you're buying at fish counter, you can also ask the person at the counter to do this for you.",
    "4 Season the salmon: Divide the garlic and ginger between the fillets (about 1 teaspoon of each per fillet). Use your fingers to spread the garlic and ginger evenly over the surface of the salmon. This step helps them stick to the surface of the salmon after the teriyaki marinade is added.",
    "5 Transfer the salmon to freezer bags: Slide one fillet into each bag. Usually the fillets fit in the bottom of the bag (as pictures), but it's fine if they are sideways.",
    "6 Add the marinade and seal the bag: Holding the bag upright, add about 3 tablespoons of marinade to the bag. Flip the cuff back up and seal the bag almost closed, leaving about an inch un-zipped.",
    "Holding the bag by the unzipped portion, submerge the bag in the pot of water. Use your other hand to gently press out any air pockets from around the salmon. Lower the bag right up to the unzipped portion so that all the air bubbles are forced out, then pinch the bag closed.",
    "Lift the bag out of the water; the plastic should hug the sides of the salmon, pressing right up against the fish. If it doesn't, or if you see any big air bubbles around the salmon, repeat sealing the bag.",
    "Transfer the bag to the kitchen towel and pat dry. Repeat with adding the marinade and sealing the remaining freezer bags of salmon.",
    "7 Cook or freeze the salmon: If desired, skip to the next step and cook the salmon right away. Otherwise, freeze the salmon overnight or up to 3 months. The marinade will become opaque but may not completely solidify; this is normal. Even if you plan on eating the salmon within a few days, I'd recommend freezing it so that the fish doesn't over-marinate.",
    "8 When ready to cook, heat the sous vide bath: Fill a large pot with at least 6 inches of water. Add the Joule (or other sous vide device) and heat the water to 122F.",
    "9 Cook the fish: Once the sous vide bath is heated, add as many salmon fillets as you'd like to cook. (Do not thaw frozen salmon.) It's fine if the tops of the bags poke out from the surface of the water, but the salmon itself should be completely submerged. Add additional water if needed to cover.",
    "Cook fresh (unfrozen) salmon for about 40 minutes, or cook frozen salmon for 70 minutes. Salmon can be left in the sous vide bath for up to 30 minutes after the end of cooking without significant change in flavor or texture (after 30 minutes, it starts to get a little mushy).",
    "When done, pull all the bags from the water and lay them on a kitchen towel. Pat the bags dry.",
    "10 Make the teriyaki sauce: Holding the bag over a microwave-safe measuring cup, snip one of the corners of the bag and empty the teriyaki marinade into the cup. Add water as needed so that you have 1/4 cup of liquid for every salmon fillet you have prepared. Whisk in 1/2 teaspoon of cornstarch for every 1/4 cup of liquid.",
    "Microwave on high in 30 second bursts, whisking between each burst, until the sauce thickens and bubbles around the edges (about 30 seconds for each quarter cup). If it doesn't seem to be thickening, whisk in another 1/4 teaspoon of cornstarch for each 1/4 cup and continue heating.",
    "11 Serve the salmon: While the sauce is heating, slide each salmon fillet out of its bag and onto a plate. If you'd like crispy skin (optional), warm a tablespoon of oil in a large skillet over medium-high heat and sear the salmon, skin-side down, for a few minutes or until the skin is browned and crispy.",
    "Transfer each fillet to a plate, drizzle each one with sauce, and sprinkle with sliced green onions or chopped cilantro. Serve warm."
  ],
  "ingredients": [
    "0",
    "1 1/2 to 2 pounds salmon or salmon fillets, 1-inch thick",
    "3 cloves garlic, minced (about 4 teaspoons)",
    "1-inch piece ginger, peeled and minced (about 4 teaspoons)",
    "1/4 cup soy sauce or gluten-free tamari",
    "1/4 cup water",
    "2 tablespoons brown sugar",
    "2 tablespoons rice vinegar or white wine vinegar",
    "1/2 to 2 teaspoons cornstarch, for thickening the sauce",
    "Sliced green onions or chopped cilantro, to serve"
  ],
  "__v": 1
}