{
  "hash": "37744aad8b46d6c32f2297ce93e73ac6b1170316",
  "title": "Chicken With Caramelized Onion and Cardamom Rice",
  "image": "",
  "href": "http://cooking.nytimes.com/recipes/1014925-chicken-with-caramelized-onion-and-cardamom-rice?em_pos=large&emc=edit_ck_20151216&nl=cooking&nlid=67052010",
  "extension": "Firefox",
  "firstAdded": "2015-12-16T22:04:42.823000",
  "users": [
    null
  ],
  "keywords": [
    "sugar",
    "barberries",
    "use",
    "currants",
    "olive",
    "oil",
    "medium",
    "onions",
    "skinon",
    "bonein",
    "thighs",
    "chicken",
    "salt",
    "black",
    "pepper",
    "cardamom",
    "pods",
    "rounded",
    "long",
    "cinnamon",
    "broken",
    "basmati",
    "rice",
    "boiling",
    "water",
    "milliliters",
    "flatleaf",
    "parsley",
    "leaves",
    "dill",
    "cilantro",
    "greek",
    "yogurt",
    "mixed"
  ],
  "directions": [
    "0",
    "Preparation",
    "Put the sugar and scant 3 tablespoons water in a small saucepan and heat until the sugar dissolves. Remove from the heat, add the barberries, and set aside to soak. If using currants, you do not need to soak them in this way.",
    "Meanwhile, heat half the olive oil in a large sauté pan for which you have a lid over medium heat. Add the onion, and cook for 10 to 15 minutes, stirring occasionally, until the onion has turned a deep golden brown. Transfer the onion to a small bowl and wipe the pan clean.",
    "Place the chicken in a large mixing bowl and season with 1½ teaspoons each salt and black pepper. Add the remaining olive oil, cardamom, cloves and cinnamon and use your hands to mix everything together well. Heat the frying pan again and place the chicken and spices in it. Sear chicken for 5 minutes on each side and remove from the pan (this is important as it part-cooks the chicken). The spices can stay in the pan, but don’t worry if they stick to the chicken. Remove most of the remaining oil as well, leaving just a thin film at the bottom. Add the rice, caramelized onion, 1 teaspoon salt and plenty of black pepper. Drain the barberries and add them as well. Stir well and return the seared chicken to the pan, pushing it into the rice.",
    "Pour the boiling water over the rice and chicken, cover the pan, and cook over very low heat for 30 minutes. Take the pan off the heat, remove the lid, quickly place a clean tea towel over the pan, and seal again with the lid. Leave the dish undisturbed for another 10 minutes. Finally, add the herbs and use a fork to stir them in and fluff up the rice. Taste and add more salt and pepper if needed. Serve hot or warm with yogurt mixture if you like."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "3 tablespoons sugar (40 grams)",
    "2 ½ tablespoons barberries, or use currants (25 grams)",
    "4 tablespoons olive oil",
    "2 medium onions, thinly sliced (2 cups, or 250 grams)",
    "2 ¼ pounds skin-on, bone-in chicken thighs (1 kilogram), or 1 whole chicken, quartered",
    "Salt and freshly ground black pepper",
    "10 cardamom pods",
    "Rounded 1/4 teaspoon whole cloves",
    "2 long cinnamon sticks, broken in two",
    "1 ⅔ cups basmati rice (300 grams)",
    "2 ¼ cups boiling water (550 milliliters)",
    "1 ½ tablespoons flat-leaf parsley leaves (5 grams), chopped",
    "½ cup dill leaves (5 grams), chopped",
    "¼ cup cilantro leaves (5 grams), chopped",
    "⅓ cup Greek yogurt (100 grams), mixed with 2 tablespoons olive oil (optional)"
  ],
  "__v": 1
}