{
  "hash": "98e0fb1e6f23799d08c0d38e59664966acf03fc4",
  "title": "Ultimate Cheeseburger Loaf",
  "image": "https://cdn.ruled.me/wp-content/uploads/2017/03/ucs-2.jpg",
  "href": "https://www.ruled.me/ultimate-cheeseburger-loaf/",
  "extension": "Chrome",
  "firstAdded": "2018-04-15T16:53:11.983000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 375°F. Have two pieces of parchment paper that are about 18 inches long, a rolling pin, and a baking sheet set aside. An insulated baking sheet works best for this recipe, but other baking sheets will work as well. Heat a large skillet over medium heat, add ground beef and break up into small pieces using a spoon. Cook beef, stirring occasionally until browned throughout.",
    "Remove beef from pan and place onto a plate using a slotted spoon. Set beef aside for later. Discard all but about a tablespoon of the grease from the skillet.",
    "Place skillet over medium heat and add the onion. Cook onion, stirring occasionally until soft and edges are brown. Stir in the garlic and cook for 1 minute.",
    "Add the beef back into the skillet with the onions and the garlic. Stir in the Worcestershire sauce and cook until most of the sauce has evaporated. Stir in the salt and pepper. Remove from heat. Taste and adjust seasoning if necessary.",
    "Simmer about 2 inches of water in the lower part of a double boiler using high heat. Turn heat to low.",
    "In the top part of the double boiler (while not over the water), whisk together the almond flour, xanthan gum and baking powder. Stir in egg. Mixture will be very thick. Stir in the mozzarella cheese.",
    "Place the top part of the double boiler containing the almond flour and mozzarella mixture over the bottom part with the simmering water. Heat the mixture, stirring frequently, until the cheese melts and the mixture becomes a dough-like ball. Be careful not to burn yourself with the hot bowl or the steam escaping from the bottom part of the double boiler. I use a silicone mitt to hold the bowl while I stir.",
    "Transfer the mozzarella dough to a piece of parchment paper. Knead it several times to incorporate any stray almond flour into the dough and completely mix the cheese and the almond flour. Pat the dough into an oval shape. Cover the dough with a second piece of parchment and roll out into an oblong shape about 12 inches by 15 inches. While rolling the dough out, you may need to straighten the top parchment, then flip the dough over and straighten the bottom parchment. This prevents wrinkles in the dough.",
    "Spread the ground beef mixture along the middle third of the dough lengthwise, being careful to leave about one third of the dough on both sides. Squirt a few tablespoons of mustard over the ground beef. Layer the red onions and dill pickle slices over the mustard. Top the mixture with the cheddar cheese.",
    "Fold the sides of the dough over the filling and seal together with your fingers. If desired crimp the seal with your fingers as you would the edge of a pie. Pinch the ends of the pastry together. If desired, decorate the ends but pushing down with a fork. Using a sharp knife, pierce the dough in several places to create holes for the steam to release during baking.",
    "Using the parchment paper under the loaf to assist you, slide the loaf onto a baking sheet. Place the loaf in the oven. Bake in preheated oven for 25- 30 minutes or until it is golden brown. Let loaf cool 5 minutes on the baking sheet, then transfer it to a cutting board using the parchment. Gently remove parchment from underneath, if desired. Tearing the parchment will make this process easier. Slice crosswise into 8 pieces and serve hot."
  ],
  "ingredients": [
    "0",
    "1 pound ground beef",
    "1 medium onion, finely chopped",
    "1 clove garlic, crushed",
    "2 teaspoon Worcestershire Sauce",
    "½ teaspoon salt",
    "¼ teaspoon pepper",
    "1 ½ cups superfine almond flour",
    "½ teaspoons xanthan gum",
    "1 ½ teaspoons baking powder",
    "1 large egg",
    "1 ½ cups part-skim finely grated mozzarella cheese",
    "¼ red onion, sliced lengthwise",
    "14 slices of dill pickles",
    "2 tablespoons yellow mustard",
    "1 ½ cups grated cheddar cheese"
  ],
  "__v": 1
}