{
  "hash": "415c7d79dac37a4117b2ce9c358579423d6b4139",
  "title": "Queso Dip (Mexican Cheese Dip)",
  "image": "https://www.recipetineats.com/wp-content/uploads/2017/07/Chile-Con-Queso-12.jpg",
  "href": "https://www.recipetineats.com/queso-dip-mexican-cheese-dip/",
  "extension": "Chrome",
  "firstAdded": "2020-02-06T11:37:40.513000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place cheese and cornflour in a bowl, toss to coat.",
    "Melt butter over medium heat in a large saucepan or small pot.",
    "Add garlic and onion, cook slowly for 3 minutes or until onion is translucent but not browned.",
    "Add tomato (including juices) and cook for 2 minutes until tomato is slightly softened.",
    "Add evaporated milk and cheese. Stir, then add chiles and Spices.",
    "Stir until cheese melts and it becomes a silky sauce.",
    "Add salt to taste - amount required depends on saltiness of cheese used - and stir through coriander.",
    "Stir in milk or water to adjust consistency (I use 2 tbsp) - the dip thickens when it cools, and milk can be added later to adjust to taste.",
    "Remove from heat. Serve warm or at room temperature - it will be soft and scoopable even when it cools.",
    "Store in the refrigerator. When refrigerated, it becomes the consistency of the cheese spread sold in jars that are not in the refrigerator section. Reheat in microwave and adjust consistency as desired with a tiny bit of milk. If you add too much, just put on stove again until it thickens."
  ],
  "ingredients": [
    "0",
    "2.5 cups / 225 g Cheddar cheese, freshly shredded (Important - read Note 1)",
    "1 tbsp cornflour / cornstarch",
    "1/2 tbsp / 8 g butter",
    "1 large garlic clove, minced",
    "1/4 small white onion, very finely chopped (1/4 cup)",
    "375 g / 13 oz evaporated milk (1 can, not low fat)",
    "1 small tomato, finely diced (3/4 cup) (Note 2)",
    "1/4 tsp each onion powder, garlic powder, cumin",
    "4 oz / 113g can chopped green chile, fire roasted (Subs Note 3)",
    "1/4 cup coriander / cilantro, finely chopped",
    "2 - 3 tbsp milk, any",
    "Salt"
  ],
  "__v": 1
}