{
  "hash": "58c8a6b0d756c5268a927637c7b4fe9e0d39eafd",
  "title": "Turmeric-Miso Soup with Shiitakes, Turnips, and Soba Noodles",
  "image": "https://images.food52.com/r9RE2CiIqYnhsdDEmqDwgF6QGeo=/753x502/72321b29-6619-4955-82d1-f49323060717--2015-0126_miso-soup-with-shiitakes-turnips-and-soba-noodles-015.jpg",
  "href": "https://food52.com/recipes/32820-turmeric-miso-soup-with-shiitakes-turnips-and-soba-noodles",
  "extension": "Chrome",
  "firstAdded": "2018-03-01T01:44:40.492000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place the turnips, mushrooms, and turmeric into a large soup pot, cover with 4 cups of water, and bring to a boil. Reduce heat and bring to a simmer, then cook for roughly 15 to 18 minutes, until turnips are tender, but still have a bit of a bite. Add 4 tablespoons of miso paste to a bowl, ladle 1 cup of broth from the soup pot into the bowl, and whisk until dissolved. Return mixture to soup pot, taste, and adjust by adding more miso directly to the broth, if need be.",
    "In a separate pot, bring roughly 3 quarts of water to boil, add soba noodles, and cook according to instructions on the package. Drain and rinse with cold water, use your fingers to separate noodles if need be.",
    "To serve, divide the noodles among soup bowls and ladle the vegetables and broth over the top. Finish with a sprinkling of sliced onions and microgreens.",
    "To store, combine leftover soup and noodles in a container with a fitted lid. To reheat, gently bring the soup to desired temperature; if heated too fast, on too high of a flame, miso can lose some of its nutritional integrity."
  ],
  "ingredients": [
    "0",
    "2 medium-sized turnips, cut into 1/2-inch cubes (about 8 ounces)",
    "4 ounces fresh shiitake mushrooms, stems removed and tops slivered",
    "1-inch piece fresh turmeric, peeled and grated (or 1 1/2 teaspoons dried ground turmeric)",
    "Water",
    "4 to 5 tablespoons mellow yellow miso paste (preferably non-GMO), divided",
    "One 8- ounces soba noodles",
    "1/3 cup green onions, finely chopped, to serve",
    "Handful microgreens, to serve"
  ],
  "__v": 1
}