{
  "hash": "c8b7566221e0ee1a47957832c0aef2dd90c26242",
  "title": "Chicken Meatballs with a Lemongrass and Ginger Dip.",
  "image": "",
  "href": "https://www.healthylittlefoodies.com/ginger-lemongrass-chicken-meatballs/",
  "extension": "Chrome",
  "firstAdded": "2018-08-12T20:19:45.749000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Pre heat oven to 200C / 400F and line a baking tray with baking paper / baking mat.",
    "In a small bowl, pour the milk over the breadcrumbs and set aside while preparing the rest of the meatball mix.",
    "Heat the oil in a frying pan over a medium-high heat. Add the onion and carrot and cook until softened, about 4 mins. Add the garlic and lemon grass and cook for a further minute. Remove from the heat and allow the mixture to cool.",
    "In a small bowl, add the ginger, soy sauce and lime juice. Stir until combined.",
    "Add the chicken mince to a large mixing bowl and add the carrot / onion mixture, sauce mixture, coriander and the breadcrumb mixture. Gently mix until combined. Shape tablespoons of the mixture into balls and place on the lined baking tray. (I made 27 balls)",
    "Place in the oven and bake for approx. 20 mins, until golden and cooked through.",
    "DIP - Add the lemon grass to a food processor and pulse until finely minced. Add the ginger, lime zest and juice and continue to pulse until combined. Stir the mixture through the yoghurt until fully mixed."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "25g (1/2 cup) Breadcrumbs",
    "2 tbsp Milk",
    "1 tbsp Oil",
    "1 Onion (white, brown or red) (Finely Chopped)",
    "1 Carrot (Grated)",
    "2 Garlic Cloves (Finely Chopped)",
    "1 stalk Lemon Grass (white only) (Finely Chopped)",
    "1 tbsp Ginger (grated)",
    "2 tbsp Soy Sauce",
    "1 tbsp Fresh Lime Juice",
    "500g (1.1lb) Minced Chicken",
    "2 tbsp Fresh Coriander Leaves (cilantro) (Finely Chopped)",
    "Dip",
    "250g (1 cup) Greek Yoghurt",
    "1/2 Lemon Grass Stalk (white Only)",
    "2 tsps Ginger (grated)",
    "1/2 Lime (zest and juice)"
  ],
  "__v": 1
}