{
  "hash": "f3d3a96870e28779e17162a7daf89b9203329a8c",
  "title": "Involtini di Melanzane",
  "image": "http://www.greenkitchenstories.com/wp-content/uploads/2010/09/Eggplant_topping.jpg",
  "href": "http://www.greenkitchenstories.com/involtini-di-melanzane/",
  "extension": "Chrome",
  "firstAdded": "2015-04-24T20:34:10.961000",
  "users": [
    null
  ],
  "keywords": [
    "eggplants",
    "extra",
    "virgin",
    "olive",
    "oil",
    "salt",
    "red",
    "onion",
    "garlic",
    "chili",
    "tins",
    "canned",
    "tomatoes",
    "basil",
    "black",
    "pepper",
    "wholegrain",
    "bulgur",
    "replaced",
    "couscous",
    "quinoa",
    "oregano",
    "pistachio",
    "nuts",
    "save",
    "goat",
    "feta",
    "cheese",
    "crumbled",
    "clove",
    "spring",
    "capers",
    "vinegar",
    "egg"
  ],
  "directions": [
    "0",
    "Use a pastry brush to cover the eggplant slices in a thin layer of olive oil. Sprinkle with salt and grill in the oven on high temperature until soft and slightly burnt. While they are in the oven, prepare the tomato sauce (but don’t forget the eggplant slices in the oven, then they will be burnt and impossible to roll. Yes we have tried that a couple of times …).",
    "Heat the olive oil in a pan, add onion, garlic and chili. Let it stir for a couple of minutes, then add canned tomatoes, basil, salt and pepper. Let it simmer for at least 20 minutes. While simmering, prepare the stuffing.",
    "Cook the bulgur according to the recipe on the box. Add the rest of the ingredients – except the egg – and stir around with a fork. Add the egg, use your hands to kneed it together with the rest of the stuffing.",
    "Place the grilled eggplants, one by one, in front of you. Add a couple of spoonfuls of the stuffing at the bottom of it and roll up lengthwise away from you. Put them on a slightly oiled baking pan. Pour over the tomato sauce and the crumbled feta, drizzle with oil and sprinkle with fresh or dried basil and bake for 30 minutes at 350°F. Remove from the oven and let it rest for 15 min. Sprinkle some chopped pistachio nuts before serving."
  ],
  "ingredients": [
    "0",
    "2 eggplants, thinly sliced (1 inch/2 cm)",
    "2 tbsp extra virgin olive oil",
    "salt",
    "2 tbsp extra virgin olive oil",
    "1/2 red onion",
    "2 cloves garlic",
    "1 tsp dried chili",
    "2 tins canned tomatoes",
    "freshly chopped basil",
    "a pinch of sea salt and black pepper",
    "200 g wholegrain bulgur (can also be replaced by couscous or quinoa)",
    "1 tsp dried oregano",
    "50 g pistachio nuts, finely chopped (save a little for topping)",
    "200 g goat feta cheese, crumbled (save 75 g for topping)",
    "1 clove garlic, minced",
    "1 large spring onion, finely sliced",
    "2 tbsp capers, (drained of vinegar)",
    "1 egg",
    "75 g goat feta cheese, crumbled",
    "a dash of olive oil",
    "a pinch of fresh (or dried) basil",
    "some chopped pistachio nuts"
  ],
  "__v": 3
}