{
  "hash": "4dec2442303003026edac31f17c6dd7730641474",
  "title": "Crisp Rösti Potatoes",
  "image": "http://www.finecooking.com/CMS/uploadedImages/Images/Cooking/Articles/Issues_41-50/fc48ho050-02_xlg.jpg",
  "href": "http://www.finecooking.com/recipes/crisp-rosti-potatoes.aspx",
  "extension": "Chrome",
  "firstAdded": "2016-01-21T09:21:07.456000",
  "users": [
    null
  ],
  "keywords": [
    "potatoes",
    "yukon",
    "golds",
    "russets",
    "best",
    "salt",
    "generous",
    "black",
    "pepper",
    "tbs",
    "olive",
    "oil",
    "frying",
    "needed"
  ],
  "directions": [
    "0",
    "Peel the potatoes and grate them, using the large holes of a hand grater or a food processor. Put the potatoes in a large bowl, add the salt and pepper, and toss to coat thoroughly. Let the potatoes rest for at least 5 minutes, and then, working with a fistful at a time, squeeze as much liquid as possible out of them and transfer to a second bowl. (The potatoes will start to discolor, but that won’t really affect the final results.)",
    "To make one large rösti—Heat a heavy-based skillet that measures about 8 inches across the base over medium-high heat. Add the oil (it should come to a depth of about 1/8 inch; add more if-necessary.) When the oil begins to ripple and quiver slightly, test it by dropping in a potato shred—it should sizzle enthusiastically. If not, wait a few more seconds. When the temperature is right, take a fistful of potatoes, wring it out once more, and let it fall loosely from your fingers into the center of the pan. (Be careful because the oil will spatter; getting hit by a few tiny droplets is inevitable.)",
    "Working quickly, repeat until you’ve got enough potatoes in the pan to cover the bottom. With a fork, gently spread out the shreds of potato to make a layer about 1/2 inch thick, trying to distribute them evenly, avoiding dense or thin patches. If there are straggly potatoes around the edges, tuck them in with the fork also so they don’t burn.",
    "Adjust the heat so that you hear a lively sizzle but the bottom isn’t browning too rapidly. Cook until the underside is a deep golden brown and the potatoes on the top are starting to look translucent, 12 to 16 minutes. (Taste a few strands—they should be almost fully cooked and tender.)",
    "If you’re confident enough to just flip the rösti in the pan, go for it—it’s quick and efficient. If you’re not, carefully slide the rösti out of the pan onto a dinner plate and return the pan to the heat. Put another plate on top of the rösti and, holding tightly, flip the plates over. Slide the inverted rösti back into the pan and continue cooking until the new bottom is browned and the potatoes feel really tender in the middle when poked with a knife (try to snitch a few strands from the center and taste them for doneness), another 6 to 8 minutes. Slide the rösti onto a cutting board if you’re serving it immediately, or to a cooling rack to hold it for a few minutes. Blot the top with a paper towel to remove any excess oil. Cut into wedges and serve as soon as possible.",
    "Follow the directions above, but just drop handfuls of potatoes into the pan to create 4-inch rounds that are about 1/4 inch thick. Use a spatula to flip the rounds rather than sliding them onto a plate. Drain these small rösti on paper towels for a few seconds before serving.",
    "Start the meal off with a bright, textured winter salad like this Arugula & Radicchio Salad with Ruby Grapefruit & Toasted Almonds."
  ],
  "ingredients": [
    "0",
    "1 lb. potatoes (Yukon Golds or russets are best)",
    "1-1/2 tsp. salt",
    "Generous 1/4 tsp. freshly ground black pepper",
    "3 Tbs. vegetable or olive oil for frying; more as needed"
  ],
  "__v": 1
}