{
  "hash": "50d8fcf23664e5d886c783a84a9548666040f991",
  "title": "Chickpea Pan Bagnat Sandwiches",
  "image": "https://cdn.loveandlemons.com/wp-content/uploads/2018/05/IMG_12147-2.jpg",
  "href": "https://www.loveandlemons.com/chickpea-pan-bagnat-sandwiches/",
  "extension": "Chrome",
  "firstAdded": "2019-02-07T22:07:10.481000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Make the chickpea salad: In a food processor, combine the chickpeas, tahini, Dijon mustard, garlic, capers, scallion, cilantro, lemon juice, and pinches of salt and pepper. Pulse until combined, but do not puree. Season to taste.",
    "Blanch the green beans. Bring a small pot of salted water to a boil and place a bowl of ice water nearby. Drop the green beans into the boiling water for 1½ minutes, then scoop into the ice water to stop the cooking process. Once cool, drain, pat dry, and chop into 1-inch pieces.",
    "Assemble the sandwiches: Spread the chickpea salad on one side of the baguette. Press the chopped green beans into the chickpea salad and top with the olives and red onion slices. Spread of layer of mayo on the other half of the baguette and top with the sliced cucumbers, radishes, and basil. Season with salt and pepper, to taste. Press together, slice, and enjoy!"
  ],
  "ingredients": [
    "0",
    "Chickpea Salad",
    "1½ cups cooked chickpeas, drained and rinsed",
    "2 tablespoons tahini",
    "1 teaspoon Dijon mustard",
    "½ garlic clove",
    "1 teaspoon capers",
    "1 scallion, chopped",
    "2 tablespoons chopped cilantro",
    "2 tablespoons fresh lemon juice",
    "sea salt and freshly ground black pepper",
    "For the sandwiches",
    "handful of thin green beans, trimmed",
    "1 soft baguette, sliced in half",
    "8 to 10 Kalamata olives, pitted and sliced in half",
    "thinly sliced red onion, rinsed and dried",
    "vegan mayo (or regular mayo), for spreading",
    "¼ English cucumber, thinly sliced",
    "1 radish, thinly sliced",
    "6 to 8 fresh basil leaves",
    "sea salt and freshly ground black pepper"
  ],
  "__v": 1
}