{
  "hash": "a5ce0917d15d3911521c8a21d99e9a780fe84d4a",
  "title": "Lemon Garlic Baked Chicken Breast Recipe",
  "image": "http://www.inspiredtaste.net/wp-content/uploads/2016/04/Baked-Chicken-Breast-Recipe-1.jpg",
  "href": "http://www.inspiredtaste.net/28703/lemon-garlic-baked-chicken-breast-recipe/?utm_source=Inspired+Taste+Newsletter&utm_campaign=872451525c-Baked+Chicken&utm_medium=email&utm_term=0_48920376f7-872451525c-323981965",
  "extension": "Chrome",
  "firstAdded": "2016-05-25T00:48:11.456000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make Chicken Marinade: Whisk lemon juice, olive oil, mustard, salt, red pepper flakes, and black pepper together until the salt has dissolved. Stir in the garlic, lemon zest and parsley (if using). Refrigerate and use within 1 to 2 hours.",
    "Prepare Chicken Breasts: Add chicken breasts to the marinade and marinate for 1 hour and up to 2 hours in the refrigerator.",
    "Prepare the Oven and Baking Dish: Position oven rack in the middle of the oven and heat the oven to 400 degrees F. Oil a baking dish large enough to fit the chicken breasts arranged in one layer. Oil one side of a sheet of parchment paper that is large enough to cover the baking dish.",
    "Bake the Chicken Breasts: Transfer chicken breasts to the prepared baking dish and remove any large pieces of garlic that might be stuck to the chicken. Season the chicken with salt and pepper, scatter lemon wedges around the chicken then cover with parchment paper — oiled side down towards the chicken. Loosely tuck the parchment paper around the chicken.",
    "Bake until the chicken is opaque all the way through and an internal thermometer reads 165 degrees F when inserted into the thickest part of the breast. Check for doneness around 25 minutes then go from there. Most chicken breasts will take 35 to 40 minutes.",
    "Let chicken rest about 10 minutes then serve drizzled with some of the liquid left in the baking dish or slice the chicken and place back into the baking dish with all the leftover cooking liquid (our favorite)."
  ],
  "ingredients": [
    "0",
    "2 to 4 boneless, skinless chicken breasts",
    "Olive oil",
    "Salt and freshly ground black pepper",
    "Lemon wedges, optional",
    "1",
    "3 cloves garlic, crushed with the side of a large knife or minced",
    "Zest of 1 lemon, peeled or finely grated",
    "1/4 cup fresh lemon juice (1 to 2 lemons)",
    "2 tablespoons olive oil",
    "1 tablespoon Dijon mustard",
    "1/2 teaspoon coarse salt",
    "1/4 teaspoon to 1/2 teaspoon red pepper flakes, depending on how spicy you like things",
    "1/2 teaspoon freshly ground black pepper",
    "1/4 cup chopped fresh parsley"
  ],
  "__v": 1
}