{
  "hash": "d77a606879576bea4aa8d7541d5d0b547434cac9",
  "title": "Classic Beef Stroganoff",
  "image": "http://www.finecooking.com/cms/uploadedimages/Images/Cooking/Articles/Issues_111-120/051115062-01-classic-beef-stroganoff-recipe_xlg.jpg",
  "href": "http://www.finecooking.com/recipes/classic-beef-stroganoff.aspx",
  "extension": "Chrome",
  "firstAdded": "2016-06-29T04:05:55.598000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Bring a large pot of well-salted water to a boil over high heat.",
    "Season the beef with 1 tsp. salt and 3/4 tsp. pepper. Heat 2 tsp. of the oil in a 12-inch skillet over medium-high heat until very hot. Add half of the beef and cook, stirring often, until the meat is just browned, about 1 minute; do not overcook. Transfer to a plate and repeat with 2 tsp. of the oil and the remaining beef.",
    "Remove the skillet from the heat. Add 1 Tbs. of the butter and the remaining 2 tsp. oil to the skillet and stir until the butter melts. Put the skillet over medium heat and add the mushrooms. Cook, stirring occasionally, until the mushrooms release their liquid, about 5 minutes. Add the onions and cook, stirring occasionally, until the liquid has evaporated and the onions are beginning to soften, about 3 minutes more.",
    "Sprinkle the mushroom mixture with the flour and stir for 15 seconds. Stir in the broth and bring to a simmer, scraping up any browned bits in the skillet with a wooden spoon. Add the sour cream and whisk until the sauce is smooth. Add the beef and any juices from the plate to the skillet. Cook, stirring often, until the sauce is barely simmering. Season to taste with salt and pepper.",
    "Meanwhile, cook the noodles according to the package directions in the boiling water until barely tender. Drain and return to the pot. Off the heat, add the remaining 2 Tbs. butter and stir to melt. Season to taste with salt and pepper.",
    "Serve the beef Stroganoff over the noodles, sprinkled with the chives."
  ],
  "ingredients": [
    "0",
    "Kosher salt",
    "1-1/2 lb. beef top round or shell steak, sliced 1/4 inch thick, slices cut crosswise into 1-inch pieces",
    "Freshly ground black pepper",
    "2 Tbs. canola oil",
    "3 Tbs. unsalted butter",
    "10 oz. white button mushrooms, cut into 1/4-inch-thick slices (4 cups)",
    "1 cup finely chopped yellow onion (about half a medium onion)",
    "2 Tbs. all-purpose flour",
    "1 cup lower-salt beef broth",
    "1 cup full-fat sour cream, at room temperature",
    "1 12-oz. package wide egg noodles",
    "1 Tbs. thinly sliced fresh chives"
  ],
  "__v": 2
}