{
  "hash": "876f069a535704bb24faf1051797d29d28b4c6b7",
  "title": "Cream of cauliflower soup with sautéed wild mushrooms",
  "image": "http://www.bbcgoodfood.com/sites/bbcgoodfood.com/files/recipe_images/recipe-image-legacy-id--825_11.jpg",
  "href": "http://www.bbcgoodfood.com/recipes/1389/cream-of-cauliflower-soup-with-sauted-wild-mushroo",
  "firstAdded": "2015-01-06T14:01:46.784000",
  "users": [
    null
  ],
  "keywords": [
    "cauliflower",
    "kglb",
    "stalks",
    "discarded",
    "florets",
    "potato",
    "chunks",
    "medium",
    "onion",
    "butter",
    "olive",
    "oil",
    "light",
    "chicken",
    "stock",
    "fullfat",
    "milk",
    "carton",
    "double",
    "cream",
    "wild",
    "mushrooms",
    "choose",
    "ceps",
    "girolles",
    "chanterelles",
    "morels",
    "mixture",
    "type",
    "snipped",
    "chives"
  ],
  "directions": [
    "0",
    "Put the cauliflower, potato and onion in a large saucepan with the butter and half of the oil. Gently heat the contents until they start to sizzle, then cover with a lid and sweat over\na low heat for about 10 minutes, stirring occasionally. The vegetables should be softened but not coloured.",
    "Pour in the stock and bring to the boil, then pour in the milk and return gently to a boil. This way, there will be no scum forming from the milk. Season to taste then simmer, uncovered, for 10-15 minutes until the vegetables are soft. Pour in half the cream.",
    "Blend everything in a food processor or blender, in batches. For an extra creamy texture, push the purée through a sieve with the back of a ladle. Stir in the rest of the cream. (If preparing ahead cool, cover and chill for up to a day.)",
    "To serve, pick over the mushrooms. Wild mushrooms can be gritty so wash them quickly in a bowl of cold water then drain well and pat dry. Trim the stalks and chop or slice the mushrooms neatly. Heat the remaining oil in a frying pan and, when very hot, stir fry the mushrooms quickly until nicely browned, seasoning with salt and freshly ground black pepper as you cook them.",
    "Reheat the soup until piping hot. Check for seasoning and ladle into warmed bowls. Spoon the mushrooms into the centre and sprinkle lightly with the chives. Italy's elegant, mildly citrussy\nwhites, such as Vernaccia di San\nGimignano, or a Chardonnay\nwould suit this rich soup."
  ],
  "ingredients": [
    "0",
    "1 large cauliflower (about 1.3kg/3lb), stalks discarded and florets chopped",
    "1 large potato, peeled and chopped into large chunks",
    "1 medium onion, chopped",
    "25g butter",
    "4 tbsp olive oil",
    "1.2l light chicken or vegetable stock",
    "600ml full-fat milk",
    "142ml carton double cream",
    "250g wild mushrooms – choose from ceps, girolles (chanterelles), morels (either a mixture or just one type)",
    "1-2 tbsp finely snipped chives"
  ],
  "__v": 1
}