{
  "hash": "869945955964960afc9cb683dffd5db829f968b5",
  "title": "Savory Steel Cut Oatmeal",
  "image": "https://cookieandkate.com/images/2016/02/savory-steel-cut-oatmeal-recipe.jpg",
  "href": "https://cookieandkate.com/2016/savory-steel-cut-oatmeal-recipe/",
  "extension": "",
  "firstAdded": "2018-05-01T16:31:07.626000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large saucepan, combine the water and milk. Bring the mixture to a simmer over medium heat. In the meantime, melt the butter or warm the olive oil in a 12-inch skillet over medium heat. Once the butter is sizzling or the oil is shimmering, add the oats and cook, stirring occasionally, until golden and fragrant, around 2 minutes. This toasting step greatly enhances the flavor of the oats.",
    "Stir the oats into the simmering water/milk mixture. Reduce the heat to medium low and simmer gently for about 20 to 25 minutes, stirring occasionally, until the mixture is very thick.",
    "Stir in the salt. Continue to simmer the mixture, stirring occasionally and reducing heat as necessary to prevent scorching on the bottom, until almost all of the liquid is absorbed, about 10 minutes. (If you have doubled the recipe, your oatmeal might need an extra 5 minutes cooking time here.) The oatmeal will be very creamy when it’s done.",
    "Remove from heat and let the oatmeal rest for 5 minutes before serving so it has more time to thicken up and cool down a palatable temperature. Season to taste with additional salt (I added another ¼ teaspoon), pepper and optional spices. Stir in any mix-ins that you’d like now.",
    "Portion oatmeal into bowls and add any toppings you’d like. Let any extra oatmeal cool completely before covering and refrigerating."
  ],
  "ingredients": [
    "0",
    "3 cups water",
    "1 cup neutral-flavored milk of choice (like cow’s milk or plain, unsweetened almond milk) or an additional cup of water",
    "1 tablespoon unsalted butter or olive oil",
    "1 cup Bob’s Red Mill steel-cut oats (choose certified gluten-free oats if necessary)",
    "¼ teaspoon salt, more to taste",
    "Freshly ground black pepper, to taste",
    "Mix-in ideas: grated cheese or nutritional yeast, drizzle of additional olive oil or pat of butter, sautéed veggies or greens, sun-dried tomatoes, red pepper flakes and/or ground spices",
    "Topping ideas: toasted chopped nuts or seeds, fried/poached/scrambled eggs and/or lightly dressed fresh greens"
  ],
  "__v": 1
}