{
  "__v": 1,
  "directions": [
    "0",
    "Combine all ingredients except for the oil in mixing bowl and leave the lamb to marinate in it in the fridge for a couple of hours. When you're ready to start cooking, heat a whole jar of schmaltz, reserved bacon fat, or cooking oil on low in the slow cooker til it liquefies. A \"whole jar\" is however much you need to cover the meat. I used a combination of all three--that's what was in my grease jar in the fridge. Add your lamb with all of its pasty marinade and allow to cook on low for about 5 hours.",
    "Be aware, slow cookers of different makes and models could have different \"low\" temperatures. The ideal to aim for is about 200F for confit. It should be hot enough to cook the meat, but not so hot that it's bubbling much or it will render the fat out of the lamb leaving it tough and dry despite bathing in oils. For my machine, this meant setting it to \"low\" for a couple of hours and then turning it down to \"warm\" for the rest of the time because it started to bubble too much.",
    "Strain the tomato and lamb out of the fat, which can be reserved for reuse, and gently remove any pieces of bone from the meat. It should be tender and moist, tangy from the tomato and lemon, earthy from the bay and cinnamon. Very Mediterranean. I used a gnarly cut of lamb and the tendons and other hard bits turned soft and gelatinous and wonderful. If you serve it hot, plate it up with blanched or steamed vegetables. Green beans are a keto-friendly traditional accompaniment for confit. Or serve it cold with an aged gouda and pickles."
  ],
  "firstAdded": "2014-09-20T16:25:09.808000",
  "hash": "13d8921ef4c159e82e5ef2af66b57fa9f37a5910",
  "href": "http://realediblefood.blogspot.com/",
  "image": "http://1.bp.blogspot.com/-9-gtFQP5hJ8/U-l79NREquI/AAAAAAAAAKM/Jumneg-JZjM/s1600/cover.JPG",
  "ingredients": [
    "0",
    "AUG",
    "14",
    "Slow Cooker Lamb Confit",
    "Slow cookers: How many times have you filled yours with fresh meat, veggies, and seasonings only to return home to a vat of disappointment? This might be controversial, but I rarely think the convenience of the slow cooker outweighs the blunted flavors and samey texture of a slow cooked stew. Use it to make confit, though, and that's a different story!",
    "Duck confit is the more familiar dish, but you can \"confit\" lots of things from chicken wings or pork belly to garlic, tomatoes, and apples. Not that I'd recommend doing those in the same dish... Here I'm taking a cheaper cut of lamb and slow cooking it in fat to make it rich and tender. There's cinnamon in the rub, one of my favorite things with lamb, and bay leaves done right.",
    "Nutrition Facts",
    "(Recipe makes 3 servings)",
    "Amount Per Serving",
    "Calories\t368",
    "Total Fat\t26 g",
    "Total Carbohydrate\t1.6 g",
    "Dietary Fiber",
    "Sugars\t<1 g",
    "0 g",
    "Protein\t30 g",
    "Ingredients",
    "1 lb Cubed Lamb",
    "your jar of reserved drippings, schmaltz, or cooking oil",
    "1 t salt",
    "1/3 c chopped tomatoes",
    "1/2 T porcini mushroom powder",
    "1 T ground coriander",
    "1/2 t ground black pepper",
    "zest of one lemon",
    "1 t dried thyme",
    "1/2 T minced garlic",
    "1 T cinnamon",
    "2 dashes ground bay leaf"
  ],
  "keywords": [
    "aug",
    "slow",
    "cooker",
    "lamb",
    "confit",
    "cookers",
    "times",
    "filled",
    "meat",
    "veggies",
    "seasonings",
    "return",
    "home",
    "vat",
    "disappointment",
    "controversial",
    "rarely",
    "think",
    "convenience",
    "outweighs",
    "blunted",
    "flavors",
    "samey",
    "texture",
    "stew",
    "use",
    "make",
    "thats",
    "different",
    "story",
    "duck",
    "familiar",
    "lots",
    "chicken",
    "wings",
    "pork",
    "belly",
    "garlic",
    "tomatoes",
    "apples",
    "recommend",
    "doing",
    "dish",
    "taking",
    "cheaper",
    "cooking",
    "fat",
    "rich",
    "tender",
    "theres",
    "cinnamon",
    "rub",
    "favorite",
    "things",
    "bay",
    "leaves",
    "right",
    "nutrition",
    "facts",
    "recipe",
    "makes",
    "servings",
    "calories",
    "total",
    "carbohydrate",
    "dietary",
    "fiber",
    "sugars",
    "protein",
    "cubed",
    "jar",
    "reserved",
    "drippings",
    "schmaltz",
    "oil",
    "salt",
    "porcini",
    "mushroom",
    "coriander",
    "black",
    "pepper",
    "zest",
    "lemon",
    "thyme",
    "dashes",
    "leaf"
  ],
  "title": "Slow Cooker lamb Confit",
  "users": [
    null
  ]
}