{
  "hash": "34e76a4e1d7f8645891f769364c88bcbf6ef7f59",
  "title": "Chinese Vegetarian Noodle Soup",
  "image": "https://omnivorescookbook.com/wp-content/uploads/2017/03/1703_Chinese-Vegetarian-Noodle-Soup_003.jpg",
  "href": "https://omnivorescookbook.com/vegetarian-noodle-soup/",
  "extension": "Firefox",
  "firstAdded": "2018-10-05T17:52:34.137000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cut tofu into 1-inch pieces and transfer into a large Ziploc bag. Add soy sauce and maple syrup. Gently flip the bag a few times to coat tofu with the liquid. Marinate for 15 to 20 minutes. When the tofu is marinated, open the bag just a little bit without letting the tofu fall out. Drain all the liquid and discard. Dry tofu with paper towels (Footnote 2).",
    "Boil noodles according to instructions. Drain and set aside.",
    "Heat a 3-quart pot with 1 tablespoon oil until hot. Spread tofu. Let cook undisturbed for 1 minute, or until the bottom turns dark brown. Flip and cook until the other side turns crispy too. Transfer to a plate.",
    "Add vegetable broth into the same pot. Scrape off any brown bits stuck on the bottom with a spatula. Add mushrooms, frozen vegetables, green onion, ginger and soy sauce. Cook until brought to a boil. Add kale and cook until tender. Transfer the noodles into the pot and stir to mix well. Taste the soup and adjust seasoning by adding more salt, if needed. Turn off heat and drizzle with sesame oil.",
    "Transfer soup and noodles to servings bowls, top with pan fried tofu and eggs. Garnish with green onion and / or cilantro, if using.",
    "Serve hot as main with pickled vegetables or chili oil on the side."
  ],
  "ingredients": [
    "0",
    "Tofu",
    "1/2 block 16 ounces / 450 g extra firm tofu",
    "2 tablespoons soy sauce (or tamari for a gluten-free alternative)",
    "1 tablespoon maple syrup (or agave nectar)",
    "Cook",
    "3.5 oz (100 g) dried noodles (*Footnote 1)",
    "1 tablespoon peanut oil (or vegetable oil)",
    "6 cups vegetable broth (or homemade Detox Vegetable Broth)",
    "2 cups (1/2 lbs) mushrooms , sliced",
    "1 cup mixed frozen vegetables (e.g. green peas, carrots and corn)",
    "2 green onion , chopped",
    "1 large piece ginger",
    "4 cup kale , chopped",
    "1 tablespoon soy sauce (or tamari for a gluten-free alternative)",
    "Salt to taste",
    "2 teaspoons sesame oil",
    "Serving options",
    "Poached or boiled eggs",
    "Chopped cilantro and chopped green onion for garnish",
    "Pickled vegetables zha cai and fermented tofu",
    "Homemade Chili Oil or Sriracha"
  ],
  "__v": 1
}