{
  "hash": "01ecccc2b746df4f476c897bd9deb181ae2c8312",
  "title": "Buffalo Chicken Strips with Blue Cheese Dressing",
  "image": "https://data.beyonddiet.com/getimage.imhx?img=00_56_22_25_562225-142277.jpg&w=710&cust=2x1",
  "href": "https://www.beyonddiet.com/recipes/46106/buffalo-chicken-strips-with-blue-cheese-dressing",
  "extension": "Chrome",
  "firstAdded": "2017-01-02T17:56:09.200000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "Trim and cut the chicken into strips/medium sized strips. Place the chicken in a large ziplock bag, and add the vinegar, water, and cayenne pepper. Shake until the cayenne distributes evenly in the liquid and chicken, then seal the bag, and place in the fridge for at least on hour or overnight.",
    "Preheat oven to 350F. Line a baking sheet with parchment paper and place a cooling rack on top. (Cooling rack helps chicken get a little crispy but not necessary).",
    "Liberally sprinkle the oregano, garlic powder, cumin, and chili powder over the chicken pieces on both sides. Arrange the chicken pieces on the cooling rack over the baking sheet. Bake for 10-12 minutes. Flip the pieces over, and bake for an additional 10-12 minutes or until done.",
    "*Recipe calls for 3 tbsp cayenne. I used that the first time and marinated overnight and they were VERY HOT! I will try half of that the next time. They were still yummy but I had to smother them in the blue cheese to cool my mouth!",
    "*This is the blue cheese dressing used with the chicken strips: http://www.beyonddiet.com/Recipes/Blue-Cheese-Dressing-or-Dip_1",
    "*These calculations are based on the chicken strips alone. It does not take into consideration the blue cheese dip."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 lbs. chicken breast, skinless, organic, free-range",
    "1/2 c. vinegar, apple cider, organic, unfiltered, raw",
    "1/2 c. water, purified",
    "3 tbs. cayenne pepper, powder, organic",
    "oregano, dried, organic to taste",
    "garlic powder, organic to taste",
    "cumin powder, organic to taste",
    "ground allspice, organic to taste"
  ],
  "__v": 1
}