{
  "hash": "ab50c22cbae2f8fcea914b89a15317fc815469ca",
  "title": "Marcus Wareing's Cod and Sweet Potato with Pumpkin",
  "image": "http://www.menshealth.co.uk/cm/menshealthuk/images/h0/02cod.jpg",
  "href": "http://www.menshealth.co.uk/food-nutrition/healthy-recipes/marcus-wareing-cod-and-sweet-potato-with-pumpkin",
  "firstAdded": "2015-02-11T18:22:01.054000",
  "users": [
    null
  ],
  "keywords": [
    "cod",
    "fillet",
    "pumpkin",
    "potato",
    "linseed",
    "sunflower",
    "sesame",
    "seeds",
    "soy",
    "glug",
    "oil",
    "white",
    "wine",
    "vinegar",
    "ginger",
    "flat",
    "leaf",
    "parsley",
    "tarragon",
    "mild",
    "curry"
  ],
  "directions": [
    "0",
    "Lightweight in calories but super heavyweight in kitchen kudos, this fish salad makes either a great date-night supper or a light meal between training sessions. Heat the oven to 180C. Toss the pumpkin and sweet potato in oil, season and place in the oven for 20-30min. Cook the seeds in a pan over moderate heat until golden brown, then coat evenly with the soy sauce. Set aside and take heart: research from Japan’s Osaka University found that working sesame seeds into your diet for four weeks can reduce LDL cholesterol by up to 10%.",
    "Whisk sesame oil, vinegar and ginger together, fold in the roasted pumpkin and sweet potato with the herbs. Pour over the dressing. Heat some oil in a non-stick pan over a high heat, mix the curry powder and salt together and season the cod fillets. Fry until golden brown and just cooked through. Scientists in Iceland found eating cod regularly reduces belly fat in under two months. Serve with the veg and a side of smug satisfaction."
  ],
  "ingredients": [
    "0",
    "Cod fillet, 4",
    "Small pumpkin, diced",
    "Sweet potato, diced",
    "Linseed, pumpkin, sunflower, sesame seeds, 2tbsp each",
    "Soy sauce, glug",
    "Sesame oil, glug",
    "White wine vinegar",
    "Ginger, grated",
    "Flat leaf parsley",
    "Tarragon, handful",
    "Mild curry powder"
  ],
  "__v": 1
}