{
  "hash": "cd7fac1fe1dafa35ae445261ab08990e989a3d8f",
  "title": "CHOCOLATE-HAZELNUT MERINGUE PIE",
  "image": "http://cuisine-addict.com/wp-content/uploads/2016/07/Tarte-chocolat-noisette-meringuee-Sandra-Pascual-1734.jpg",
  "href": "http://cuisine-addict.com/en/chocolate-hazelnut-meringue-pie/",
  "extension": "Chrome",
  "firstAdded": "2016-08-01T20:59:04.244000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "The crust",
    "In a large bowl, combine flour, cocoa, sugar and hazelnuts. Add the butter and stir by sanding the dough between your fingers.",
    "Add egg and mix well with your fingertips to obtain a flexible and non-sticky texture. Wrap in cling film and put in the fridge for at least 1 hour.",
    "After this time, roll out the dough to about 8 mm (0,3 inch) and a garnish pie plate 23 cm (9 inch) diameter buttered and floured. Replace in the fridge at least 1 hour.",
    "Cover with baking paper and place weights for cooking (ceramic balls, dried vegetables, rice ...). Bakefor 20 minutes in your oven preheated at 180°C/350°C.",
    "The chocolate ganache",
    "Put the cream in a small saucepan and bring to a simmer. Pour on the chocolate chips. Cover and wait 2 minutes before mixing to smooth. Add the butter and mix well.",
    "Crush the meringue and sprinkle it over the pie shell and pour the ganache over. Smooth out and place in the fridge for 1 hour.",
    "The meringue",
    "Put the egg whites at room temperature in the bowl of your food. Heat the sugar and water to a temperature of 120°C/250°F, then pour over the white and run the robot to minimum speed. Let it run 2 minutes and then increase to full speed. Let it run until the meringue was cooled (about 30°C/85°F).",
    "Pipe with a star tip on the tart and brown torch."
  ],
  "ingredients": [
    "0",
    "150 gflour",
    "25 gcocoa powderunsweetened",
    "30 gpowdered sugar",
    "100 ghazelnut powder",
    "125 gbutterat room temperature, diced",
    "1 egg",
    "200 gchocolate chips",
    "15 clwhipping cream",
    "30 gbutter",
    "1 meringueoptionnal",
    "35 gegg whites",
    "55 ggranulated sugar",
    "15 mlwater"
  ],
  "__v": 1
}