{
  "hash": "3723c58f58b772b940cb16c5de517822e752c736",
  "title": "TERIYAKI SALMON BURGERS",
  "image": "",
  "href": "https://www.eatingbirdfood.com/teriyaki-salmon-burgers/",
  "extension": "Chrome",
  "firstAdded": "2017-09-18T20:51:03.646000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Add tamari, Sriracha, honey, sesame oil, garlic and ginger to a small bowl and whisk to combine. Set aside. In another small bowl combine mayo and 1 teaspoon of Sriracha to use a sauce for your burgers.",
    "Chop salmon into pieces that are about 1/4 inch thick using a chef’s knife.",
    "Transfer chopped salmon into to a large bowl. Add scallions, egg and tamari mixture to the salmon and toss to combine.",
    "Form the mixture into 4 patties using your hands. Don’t worry that the mixture is moist and loose, it will hold together once the first side is cooked.",
    "Coat a large nonstick skillet with cooking spray. Turn heat to medium and allow pan to heat up for about 1 minute. Add the patties and cook for 4 minutes. Turn and continue to cook until firm and fragrant, about 2-3 more minutes. If you decide you want to try grilling the salmon burgers, I highly recommend using a grill pan as I’m not sure how well they would hold up on a grated grill.",
    "Serve immediately with Sriracha mayo, avocado slices, red onion and a few pieces of chopped cilantro. Use a burger bun (gluten-free, if needed) or skip the bun all together and use a lettuce wrap instead.",
    "To make the sparkling grape spritzer: Add ice and sparkling water to four glasses, place a few frozen grapes in each glass and garnish with a lime wedge.",
    "by Brittany Mullins"
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "Salmon Burgers",
    "1 Tablespoon reduced-sodium tamari (or soy sauce)",
    "1 teaspoon Sriracha",
    "1 teaspoon honey",
    "1 teaspoon toasted sesame oil",
    "1 clove minced garlic",
    "1/2 teaspoon grated fresh ginger",
    "1 pound salmon fillet, skin and bones removed",
    "2 scallions, finely chopped",
    "1 egg, lightly beaten",
    "4 gluten-free burger buns (optional)",
    "3 Tablespoons avocado mayo",
    "1 teaspoon Sriracha",
    "1 avocado, sliced",
    "1/4 red onion, sliced",
    "fresh cilantro, chopped",
    "Sparkling Grape Spritzer",
    "Kroger or Simple Truth sparkling water (I like the sparkling lime mineral water)",
    "1/2 cup frozen grapes, halved",
    "fresh lime, for garnish"
  ],
  "__v": 1
}