{
  "hash": "a12be7bad97f391a470473df0e58c505735ec7a0",
  "title": "Cherry Tomato Tarte Tatin",
  "image": "http://www.thevegspace.co.uk/wp-content/uploads/2015/06/Cherry-Tomato-Tarte-Tatin-255x300.jpg",
  "href": "http://www.thevegspace.co.uk/recipe-cherry-tomato-tarte-tatin/",
  "extension": "Chrome",
  "firstAdded": "2015-07-04T13:26:18.850000",
  "users": [
    null
  ],
  "keywords": [
    "cherry",
    "tomatoes",
    "olive",
    "oil",
    "balsamic",
    "vinegar",
    "caster",
    "sugar",
    "pine",
    "nuts",
    "circle",
    "readyrolled",
    "puff",
    "pastry",
    "sundried",
    "tomato",
    "vegetarian",
    "parmesanstyle",
    "cheese"
  ],
  "directions": [
    "0",
    "Preheat the oven to 190°C / 375°F / Gas Mark 5.",
    "In a large frying pan, heat the olive oil and add the cherry tomatoes. Cook over a medium heat for 8-10 minutes turning occasionally until starting to brown and release their juices. Squash the tomatoes gently with a fork to release even more juice, and remove from the heat.",
    "Oil the base of a 24cm cake tin, springform tin or ovenproof frying pan, and scatter in the pine nuts. Remove the tomatoes with a slotted spoon and arrange in your tin/pan, then season with salt and black pepper. Heat up the remaining tomato juices left in the pan, and add the balsamic vinegar and sugar. Boil for a minute or two until the liquid has turned syrupy, then pour it over the tomatoes. Grate the parmesan-style cheese over the tomatoes.",
    "Unroll the circle of puff pastry and spread it evenly with the sun-dried tomato paste. Pick up the pastry so it is tomato-paste side down, and place over the tomatoes, tucking in the sides if necessary so that the tomatoes are completely covered. Prick the pastry in 5 or 6 places with a sharp knife to release steam as it is cooking.",
    "Bake in the oven for 25 minutes, by which time the pastry should be golden and crispy. Leave to rest in the tin for 5 minutes, then place your serving plate over the tin and flip it over to turn out, (top tip - I do this over the sink as some stray juices always escape!). Slice and serve!"
  ],
  "ingredients": [
    "0",
    "650g cherry tomatoes",
    "1 tbsp olive oil",
    "1 tbsp balsamic vinegar",
    "2 tsp caster sugar",
    "1 tbsp pine nuts",
    "230g circle of ready-rolled puff pastry",
    "2 tbsp sun-dried tomato paste",
    "50g vegetarian parmesan-style cheese"
  ],
  "__v": 1
}