{
  "hash": "ae6b5879d74df0a3e4d186bd29358d66e9459418",
  "title": "Baked Stuffed Shells (Conchiglie Ripiene al Forno)",
  "image": "",
  "href": "https://www.epicurious.com/recipes/food/views/baked-stuffed-shells-conchiglie-ripiene-al-forno",
  "extension": "Chrome",
  "firstAdded": "2017-09-22T13:59:32.800000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place the ricotta in a cheesecloth-lined sieve and set the sieve over a bowl. Cover the ricotta with plastic wrap and place in the refrigerator for at least 8 hours or up to one day. Discard the liquid in the bowl.",
    "Pass the tomatoes through a food mill fitted with the fine disc. (If you don’t have a food mill, seed the tomatoes and place them in a food processor. Process the tomatoes, using quick on/off pulses, until they are finely ground. Don’t overprocess, or you’ll incorporate air into the tomatoes and change their texture and color.) Meanwhile, bring 6 quarts of salted water to a boil in an 8-quart pot over high heat.",
    "Slice half the mozzarella thin and cut the remaining half into 1/4-inch cubes. Turn the drained ricotta into a mixing bowl. Mix in the mozzarella cubes, grated cheese, and parsley. Season to taste with salt and white pepper. Beat the egg well and stir it into the ricotta mixture.",
    "Heat the olive oil in a large skillet over medium heat. Scatter the garlic over the oil and cook, shaking the pan, until golden brown, about 2 minutes. Lower the tomatoes close to the skillet and carefully pour them into the skillet. Add the crushed red pepper and season lightly with salt. Bring the sauce to a quick boil, then adjust the heat to simmering. Cook until the sauce is lightly thickened, about 30 minutes. Stir the basil into the sauce a few minutes before it is done.",
    "Meanwhile, stir the shells into the boiling water. Return to a boil, stirring frequently. Cook the pasta, semi-covered, stirring occasionally, until softened but still quite firm, about 7 minutes. Fish the shells out of the water with a large skimmer and carefully lower them into a bowl of cold water. Drain them carefully.",
    "Preheat the oven to 425°F. Line the bottom of a 15–10-inch baking dish with about 3/4 cup of the tomato sauce. Spoon about 2 tablespoons of the ricotta mixture into each shell. The shell should be filled to capacity but not overstuffed. Nestle the shells next to each other in the baking dish as you fill them. Spoon the remaining sauce over the shells, coating each one. Arrange the slices of mozzarella in an even layer over the shells. Bake until the mozzarella is browned and bubbling, about 25 minutes. Remove, and let stand 5 minutes before serving."
  ],
  "ingredients": [
    "0",
    "1 1/2 pounds fresh ricotta or packaged whole-milk ricotta",
    "1 (35-ounce) can peeled Italian plum tomatoes (preferably San Marzano)",
    "Salt",
    "1 pound fresh mozzarella cheese",
    "1 cup freshly grated Parmigiano-Reggiano cheese",
    "1/3 cup chopped fresh Italian parsley",
    "Freshly ground white pepper",
    "1 large egg",
    "1/4 cup extra-virgin olive oil",
    "6 cloves garlic, crushed",
    "1/2 teaspoon crushed hot red pepper",
    "10 fresh basil leaves",
    "1 pound jumbo pasta shells"
  ],
  "__v": 1
}