{
  "hash": "aa8979120d0724a1d6b207b73ad87f68fd2a7927",
  "title": "CHICKEN FAJITA QUINOA BOWLS",
  "image": "https://www.eatingbirdfood.com/wp-content/uploads/2017/03/Chicken-Fajita-Quinoa-Bowls-3-300x300.jpg",
  "href": "https://www.eatingbirdfood.com/chicken-fajita-quinoa-bowls/",
  "extension": "Chrome",
  "firstAdded": "2017-09-18T20:51:35.339000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Rinse and drain quinoa. Place water, salt and quinoa into a saucepan and bring to a boil. Reduce to a simmer. Cover and cook for about 15 minutes, or until all liquid is absorbed. Remove from heat and let pot sit, covered for 2-3 minutes. Remove lid and fluff with a fork.",
    "While quinoa is cooking, get started cooking everything else. Heat a large skillet with 1 teaspoon oil over medium-high heat. Add in garlic, onions, red and yellow bell pepper, salt and chili powder. Sauté until veggies are tender, but still crisp, about 5 minutes. Transfer veggies to a plate.",
    "Using the same skillet, add chicken, lime juice, oil and seasonings (chili powder, garlic powder, cumin paprika, salt and pepper) and cook over medium-high heat for about 6 minutes or until chicken is no longer pink. Remove from heat and set aside.",
    "Prepare avocado goat cheese sauce. Add avocado, goat cheese, lime juice and sea salt to a blender and blend until smooth.",
    "Once everything is cooked and dressing is prepped, make bowls by adding a base of quinoa, ¼ of the chicken and ¼ of the bell peppers. Add chopped romaine, pico de gallo or salsa and freshly chopped cilantro for serving. Drizzle on the avocado goat cheese sauce. To make it look really pretty you can add the sauce to a zip-lock baggie, cut the tip and squeeze the sauce over each bowl in a zigzag pattern. Add a little hot sauce (if using) and dig in!"
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "Quinoa",
    "1 cup of red or white quinoa (I used a blend of the two)",
    "2 cups water",
    "1/2 teaspoon salt",
    "Fajita Veggies",
    "1 teaspoon oil",
    "1 clove garlic, minced",
    "1 red bell pepper, sliced",
    "1 yellow bell pepper, sliced",
    "1 yellow onion, sliced",
    "1/2 teaspoon salt",
    "1/2 teaspoon chili powder",
    "Chicken",
    "1 1/2 pounds boneless, skinless chicken breast, cut into thin strips",
    "2 teaspoons lime juice",
    "1 teaspoon olive oil",
    "1/2 Tablespoon chili powder",
    "1 teaspoon garlic powder",
    "1/2 teaspoon cumin",
    "1/2 teaspoon paprika",
    "1/2-1 teaspoon salt",
    "1/2 teaspoon ground pepper",
    "Avocado Sauce",
    "1 avocado",
    "2 Tablespoons goat cheese",
    "2 Tablespoons lime juice",
    "1/4 teaspoon sea salt",
    "Toppings",
    "romaine lettuce",
    "cilantro",
    "pico de gallo or salsa",
    "hot sauce"
  ],
  "__v": 1
}