{
  "hash": "d8495f657ea536a882291272c700b8b220d3a709",
  "title": "\"Opulent\" Chicken",
  "image": "",
  "href": "http://www.epicurious.com/recipes/food/views/-opulent-chicken-15810",
  "extension": "Firefox",
  "firstAdded": "2015-12-02T00:24:17.104000",
  "users": [
    null
  ],
  "keywords": [
    "breast",
    "halves",
    "skin",
    "bones",
    "total",
    "paprika",
    "unsalted",
    "buttera",
    "artichoke",
    "hearts",
    "mushrooms",
    "tarragon",
    "crumbled",
    "allpurpose",
    "flour",
    "cream",
    "sherry",
    "marsala",
    "chicken",
    "broth"
  ],
  "directions": [
    "0",
    "Preparation",
    "Preheat oven to 375°F.",
    "Pat chicken dry and season both sides with paprika and salt and pepper. In a 10- to 12-inch heavy skillet heat 2 tablespoons butter over moderate heat until foam subsides and cook chicken, until golden brown, about 3 minutes on each side. With tongs transfer chicken to a 2 1/2- to 3-quart shallow baking dish or casserole. In a colander rinse artichoke hearts and drain on paper towels. Scatter artichoke hearts around chicken.",
    "Slice mushrooms. Wipe out skillet and in it heat remaining 4 tablespoons butter over moderate heat until foam subsides. Add mushrooms, tarragon, and salt and pepper to taste and cook, stirring, until liquid given off by mushrooms is evaporated. Add flour and cook over moderately low heat, stirring, 3 minutes. Add Sherry or Marsala and broth and bring to a boil, stirring. Simmer sauce, stirring, 5 minutes and pour over chicken.",
    "Cover baking dish or casserole with foil or a lid and bake mixture in middle of oven 40 to 45 minutes, or until chicken is cooked through."
  ],
  "ingredients": [
    "0",
    "4 chicken breast halves with skin and bones (about 2 1/4 pounds total)2 teaspoons paprika3/4 stick (6 tablespoons) unsalted buttera 15-ounce can artichoke hearts1/2 pound mushrooms1/2 teaspoon dried tarragon, crumbled3 tablespoons all-purpose flour1/3 cup cream Sherry or sweet Marsala1 1/2 cups chicken broth"
  ],
  "__v": 1
}