{
  "__v": 1,
  "directions": [
    "0",
    "This is a highly adaptable recipe with a few key-ingredients as a failsafe “foundation” to build on which are: Thinly sliced shallots, fish sauce and lime juice. Everything else is changeable to your liking. Ground pork can be shredded chicken, where as lemongrass/lime leaves/scallion/cilantro/mint, can be basil/chives/parsley/etc. Just remember the ratio between protein and herbs should be 1:",
    "Mix ground pork-shoulder with 1 tsp of fish sauce and cornstarch until even. Heat up a non-stick skillet with 2 tsp of oil over medium-high heat, and sauté while breaking up the pork with a wooden spoon until it’s slightly browned. Let the pork cool completely over a fine sieve to eliminate excess oil. In a mortar, or spice-grinder or food-processor, grind the chopped lemongrass and kaffir lime leaves (use only the leaf-part without the mid-stem) until finely bashed up. Transfer to a large bowl, and add finely sliced shallots, chilis, scallion, cilantro, mint, grated ginger and lime zest (if you’re using small Asian limes with thin skin, 4~5 very thin slices added to the salad can bring refreshing zing). Add the cooled ground pork-shoulder, lime juice, fish sauce and ground white pepper. Toss the mixture until evenly combined. Re-season with more fish sauce if need be.",
    "Serve with white steamed rice, or rice paper."
  ],
  "firstAdded": "2014-06-19T14:58:24.847000",
  "hash": "caae5c866de85bbaac6c70b21a16d5fa2108dd14",
  "href": "http://www.ladyandpups.com/2014/05/02/thai-herbs-and-pork-salad-eng/",
  "image": "http://www.ladyandpups.com/wp-content/uploads/2014/05/pork-herb-salad161.jpg",
  "ingredients": [
    "0",
    "10.6 oz (300 grams) of ground pork-shoulder",
    "1 tsp of fish sauce",
    "1 1/2 tsp of cornstarch",
    "1 tbsp of chopped lemongrass",
    "6 kaffir lime leaves, with the mid-stems removed",
    "2 ~ 3 small shallots, finely sliced",
    "2 small red chilis, finely sliced",
    "1/4 cup of finely chopped scallion",
    "1/4 cup of finely chopped cilantro",
    "3 tbsp of finely chopped mint",
    "2 tsp of grated ginger",
    "Zest of 1/2 lime",
    "2 tbsp of lime juice",
    "1 tbsp of fish sauce",
    "1/2 tsp of ground white pepper"
  ],
  "keywords": [
    "porkshoulder",
    "fish",
    "cornstarch",
    "lemongrass",
    "kaffir",
    "lime",
    "leaves",
    "midstems",
    "shallots",
    "red",
    "chilis",
    "scallion",
    "cilantro",
    "mint",
    "ginger",
    "zest",
    "juice",
    "white",
    "pepper"
  ],
  "title": "THAI HERBS AND PORK SALAD",
  "users": [
    null
  ]
}