{
  "hash": "4bd0546d19ca82454c9b6004697793dc0d7ab814",
  "title": "spinach-chickpea saute + fried bread toasts",
  "image": "http://farm4.staticflickr.com/3739/9243362602_a1ab653a3c_z.jpg",
  "href": "http://www.girlversusdough.com/2013/07/15/spinach-chickpea-saute-fried-bread-toasts/",
  "extension": "",
  "firstAdded": "2016-08-26T20:43:25.374000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat a large skillet over medium heat. Add 2 tablespoons olive oil. Add spinach and salt to taste; stir until just wilted. Transfer to a colander to drain.",
    "Wipe out skillet and return to medium heat. Add 2 more tablespoons olive oil and bread cubes. Fry bread until golden brown and toasted all over, then add remaining tablespoon of olive oil, minced garlic, cumin and red pepper flakes. Stir and cook one more minute until garlic is fragrant.",
    "Transfer bread mixture to a small food processor or bowl; add red wine vinegar. Pulse until a coarse paste forms, or use a fork to mash the mixture to a coarse paste. Return mixture to skillet over medium heat, along with the chickpeas, tomato sauce and salt and pepper to taste. Stir, cooking until flavors are absorbed and chickpeas are hot.",
    "Add spinach and stir, cooking until heated through. Add more salt and pepper, as well as lemon juice, to taste.",
    "To make fried bread toasts, add a generous glug of olive oil to a skillet; place bread slices side-down in hot oil. Fry bread until golden brown and toasted on both sides, in batches if necessary. Serve immediately with spinach-chickpea saute, sprinkled with smoked paprika on top if desired."
  ],
  "ingredients": [
    "0",
    "5 tablespoons olive oil, divided",
    "1 bunch spinach, stems removed",
    "1 generous 1-inch slice from a rustic country bread loaf (French Boule and Ciabatta are good homemade options), crust removed and cut into 1/2-inch cubes, plus more thinner slices for fried bread toasts",
    "3 teaspoons minced garlic",
    "1/2 teaspoon cumin",
    "Pinch of red pepper flakes",
    "1 1/2 tablespoons red wine vinegar",
    "2 15-oz cans chickpeas, drained and rinsed",
    "1/2 cup tomato sauce",
    "Salt and pepper, to taste",
    "Lemon juice, to taste",
    "Olive oil, for fried bread toasts",
    "Smoked paprika, for topping (optional)"
  ],
  "__v": 1
}