{
  "hash": "f92288dfd7590c1cc57e87a70605937e403d8482",
  "title": "How to Make Chinese Dumplings (Jiaozi)",
  "image": "https://www.chinasichuanfood.com/wp-content/uploads/2015/03/Chinese-dumplings-from-flours-37.jpg",
  "href": "https://www.chinasichuanfood.com/how-to-make-dumplings/",
  "extension": "Chrome",
  "firstAdded": "2018-08-25T23:18:09.562000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Wrappers",
    "Mix a small pinch of salt with flour, dig a hole in center and then stir the water in. Mix the flour with water with chop-stickers during the process so you can adjust the water amount if necessary. Then knead the dough for 8-10 minutes with a stand mixer or by hand until the dough is almost smooth. Cover and rest for 15 minutes. Then re-knead the dough for 2-3 minutes so we can get a very smooth dough. Cover and continue resting for 1 hour.",
    "When the dough becomes soft and smooth, cut into halves and knead each half into a round ball. Take one half and dig a small hole in center. Then shape it to a large circle round. Cut so we will end up a long log. Shape the log around 3cm in diameter. Divide the long log into small dumpling dough pieces (each around 10g). Dust each of them so they will not stick together. Press one down and then roll it into a wrapper around 10cm in diameter. You can refer to the video for the technique.",
    "Get your assistants here and begin to wrap the dumpling at the fastest speed, because the wrappers will get dried out soon and become harder to seal together.",
    "Filling",
    "In a mixing bowl, add ground pork, a small pinch of salt, egg, light soy sauce, white pepper, oyster sauce grated ginger and salt. Then place the green onion on top and drizzle hot oil on green onions. This helps to improve the aroma of the green onion.",
    "Stir the filling in one direction for 2-3 minutes until getting a paste texture and the filling becomes quite sticky. Set aside for 1 hour or cover with plastic wrapper and overnight.",
    "Finely chop chives and mix with 2 tablespoons of sesame oil or other vegetable oil. Mix chive with pork before wrapping.",
    "Pan-fried version",
    "Brush 1 tablespoon of oil in a pan (nonstick pan recommended for beginners), place the dumplings in. Pleats side up.",
    "Heat over medium fire until one side becomes browned. Swirl around ½ cup of water and then cover the lid immediately. Continue heating until all of the water is evaporated.",
    "Slow down your heat and heat until the bottom becomes crispy and golden brown.",
    "Boiled dumplings (水饺)",
    "Heat a large pot of water to a boiling, add a small pinch of salt. Then cook the dumplings in batches. Slightly move the dumplings with a large ladle or scoop so they will not sticky to the bottom. Then the water begins to boil again, add around ¼ cup of cold water. Repeat once. When the dumplings become transparent and expand because of the air inside. Transfer out"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "300g all-purpose flour, plus more for dusting",
    "155ml water (room temperature or hot boiling, see tip3)",
    "2g salt",
    "Pork and chive filling",
    "400g Ground pork (at least 20% fat) (you can replace ⅓ pork with shrimp)",
    "200g Chive, hard ends removed",
    "1 tsp.salt",
    "1 tbsp. cooking wine",
    "½ tsp. white pepper",
    "1 tbsp. light soy sauce",
    "1 tbsp. oyster sauce",
    "1 tbsp. minced ginger",
    "2 large eggs",
    "3 tbsp. sesame oil, divided",
    "⅓ cup chopped scallion",
    "2 tbsp. hot oil",
    "Dipping sauce",
    "2 tbsp. vinegar",
    "3-4 ginger sheds"
  ],
  "__v": 1
}