{
  "hash": "a53db8b5a2e2f7da5ba2349887ca269539c63c14",
  "title": "Reuben Burger and a Brew",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2012/02/Reuben-Burger-Vegan.jpg",
  "href": "http://www.onegreenplanet.org/vegan-food/reuben-burger-and-a-brew/",
  "extension": "",
  "firstAdded": "2016-01-03T13:38:04.451000",
  "users": [
    null
  ],
  "keywords": [
    "coriander",
    "allspice",
    "garlic",
    "onion",
    "paprika",
    "caraway",
    "seeds",
    "fennel",
    "black",
    "pepper",
    "hot",
    "water",
    "texturized",
    "protein",
    "vital",
    "wheat",
    "gluten",
    "dill",
    "pickle",
    "juice",
    "tomato",
    "canola",
    "oil",
    "reuben",
    "buns",
    "vegan",
    "thousand",
    "island",
    "dressing",
    "sauerkraut",
    "heated"
  ],
  "directions": [
    "0",
    "To make the spice blend, combine all ingredients in a small bowl.",
    "In a large bowl, combine the water and texturized vegetable protein until rehydrated, about 10 minutes. With a fork, stir in the onion, vital wheat gluten, and reuben spice blend. When combined, add the pickle juice, tomato paste, and oil. Stir well, then knead together until you can see some gluten threads forming. It will be a slightly crumbly dough. Add an additional tablespoon of vital wheat gluten or pickle juice if needed so that the mixture will hold together.",
    "Tear 6 (12-inch) pieces of foil and prepare a steamer. Divide the mixture evenly among the pieces of foil. Using the foil, flatten and shape each into a burger about 4-inches across. Form the foil into a packet around the burger, but leave room for the burger to expand during steaming. When all the burgers are shaped, steam the burgers for 1 hour. Remove from the steamer and unwrap. Refrigerate for at least 1 hour before cooking to ensure the best texture. At this point, the burgers may also be packaged and frozen for 4 months.",
    "To prepare, heat a thin layer of oil in a large skillet over medium-high heat. Cook the burgers until dark brown and slightly crisp on the outside, about 5 minutes. Turn over to cook the other side. Spread the dressing on the buns and place a burger on each bun. Divide the sauerkraut evenly among the burgers and put the tops on the buns.",
    "If you prefer, omit the buns and use rye or pumpernickel bread to make these into patty melts."
  ],
  "ingredients": [
    "0",
    "1 tablespoon ground coriander",
    "2 teaspoons ground allspice",
    "2 teaspoons garlic powder",
    "2 teaspoons onion powder",
    "2 teaspoons paprika",
    "1/2 teaspoon caraway seeds, ground",
    "1/4 teaspoon fennel seeds, ground",
    "1/4 teaspoon ground black pepper",
    "1",
    "1 1/3 cups hot water",
    "1 cup texturized vegetable protein",
    "1/ 2 cup minced onion",
    "1 1/2 cups vital wheat gluten",
    "1/2 cup dill pickle juice",
    "2 tablespoons tomato paste",
    "1 tablespoon canola oil",
    "6 Reuben Buns, toasted",
    "1/3 cup vegan Thousand Island dressing, of choice",
    "1 1/2 cups sauerkraut, heated"
  ],
  "__v": 1
}