{
  "hash": "6c0d2be15227a4e2bd827536b82b77c50e4bd91f",
  "title": "One Pan Jambalaya",
  "image": "http://www.chelseasmessyapron.com/wp-content/uploads/2017/03/1-pan-jambalaya.jpg",
  "href": "http://www.chelseasmessyapron.com/one-pan-jambalaya/",
  "extension": "Chrome",
  "firstAdded": "2017-07-25T19:41:55.578000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Preheat the oven to 425 degrees. Line a VERY large sheet pan with foil, parchment paper, or spray with cooking oil. (As you can see in the video I fit this all on one sheet pan, but you'll need a very large one). Remove the stem and seeds and chop the bell peppers into 2-inch pieces. Halve and then thinly slice the onion. Slice the turkey sausage into coins.",
    "Place the cut peppers, onion, and sausage on a large sheet pan. Toss with 2 tablespoons olive oil, 1/2 teaspoon Creole seasoning, and Italian seasoning. Toss and bake for 8 minutes.",
    "Prepare the shrimp -- make sure it is deveined. If you want you can also peel it here OR *cook it with the peel on (the shrimp shells contribute a depth of flavor and are less likely to get overcooked). You can also remove the tail here if desired. Meanwhile, toss the shrimp with 1 tablespoon olive oil, 1/2 teaspoon Creole seasoning, and paprika.",
    "Take the sheet pan from the oven and add in the seasoned shrimp and tomatoes. Cook for another 6-8 minutes. Remove and add the packaged rice, salt (I use about 1 teaspoon - do it to personal preference), pepper (I add 1/2 teaspoon), and remaining 1 to 1 and 1/2 teaspoons Creole seasoning (to taste). Toss and then to the oven for 2 more minutes.",
    "Remove from the oven and remove the shell (unless you already did) and tails of the shrimp. (I left them on for aesthetics of the pictures)",
    "Sprinkle with fresh green onions and fresh chopped parsley. Enjoy immediately"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "3 sweet bell peppers I used a red, yellow, and green",
    "1 medium yellow onion",
    "13 ounces skinless smoked sausage (I use turkey sausage)",
    "4 tablespoons olive oil, separated",
    "2 and 1/2 teaspoons Creole seasoning, separated",
    "2 teaspoons Italian seasoning,",
    "8 ounces small or medium shrimp peeled and deveined OR just deveined*",
    "1/2 teaspoon paprika",
    "1 and 1/2 cups cherry tomatoes halved",
    "Salt and pepper",
    "2/3 cup sliced green onions",
    "Optional: fresh parsley, 1/2 teaspoon red pepper flakes",
    "2 packages (8.8 ounces EACH) precooked jasmine rice (such as Uncle Ben’s Ready Rice), or leftover cooked rice"
  ],
  "__v": 1
}