{
  "hash": "de5376c560135b303e67c9db51c93950ceac8727",
  "title": "Three-Pepper Mac and Cheese",
  "image": "",
  "href": "http://www.kitchenemporium.com/-Three-Pepper-Mac-and-Cheese_b_40.html",
  "extension": "Chrome",
  "firstAdded": "2017-08-06T04:42:07.930000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 degrees.",
    "Cook the pasta according to the directions on the package and drain thoroughly.",
    "Turn a saucepan on medium heat and add butter or margarine. Stir in the flour to create a roux and mix thoroughly with a stainless steel whip. Add the milk to the butter and flour mixture slowly. Turn the heat to low and stir in the cheeses, mixing thoroughly with the whip. Add seasonings and peppers and continue to stir the sauce for a minute or two.",
    "Oil a casserole dish and pour the noodles into the dish. Pour the sauce over the noodles. Put the dish in the oven and cook for about 10 minutes.",
    "While the casserole is in the oven, mix butter, breadcrumbs and Parmesan cheese on medium heat in a saucepan. Take the dish out of the oven, add the breadcrumb topping and sprinkle a little paprika on top.",
    "Put the dish back in the oven and allow the dish to cook for about 20 more minutes.",
    "Allow the macaroni and cheese to cool for about 10 minutes and use a Vollrath serving spoon to scoop out generous portions of the pasta dish for your family and friends."
  ],
  "ingredients": [
    "0",
    "8 oz of macaroni elbow noodles",
    "2 cups of shredded sharp white cheddar cheese",
    "1 cup of shredded Monterey Jack cheese",
    "1/4 cup of Parmesan cheese",
    "3 cups of whole or 2% milk",
    "1/4 cup butter or margarine (you'll need about 2 extra tablespoons for the topping)",
    "2 1/2 tablespoons of all-purpose flour",
    "1/3 cup of chopped green bell peppers",
    "2 tablespoons chopped chipotle peppers",
    "3 tablespoons chopped ancho chilis",
    "1/2 cup Italian-style bread crumbs",
    "paprika and cayenne pepper, to taste",
    "salt and pepper, to taste"
  ],
  "__v": 1
}