{
  "hash": "3f09e68c0efefe84ce69453146ba602eb7888a3e",
  "title": "Sarah",
  "image": "",
  "href": "http://www.asaucykitchen.com/coconut-lime-chicken/?utm_content=bufferbee9e&utm_medium=social&utm_source=pinterest.com&utm_campaign=WNMbuffer",
  "extension": "Chrome",
  "firstAdded": "2017-02-07T00:03:40.354000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place the skin breasts between two pieces of plastic cling wrap and pound them down to make them even in thickness. This will help the chicken cook evenly and make for more tender chicken. Sprinkle each side of the chicken with salt and pepper.",
    "Melt the coconut oil in a large skillet over a medium high heat on the stove. Add the chicken breasts and cook each side for 5-7 minutes or until browned on each side. Remove the chicken from a skillet and set aside on a plate. The chicken doesn't need to be fully cooked yet because you'll be returning it to the heat shortly.",
    "Add the chopped onion to the same skillet and sauté for a few minutes to soften. Add the chili pepper if you're using it. Sauté another couple of minutes. Add the chicken stock, lime juice, cilantro and chili flakes. Bring the mixture to a boil and then reduce down to a simmer. Let simmer for about 5 minutes to let reduce down. Add the coconut milk and bring to simmer again for another 5 minutes. Add the starch and water at this time if you're using it. You may need to raise the heat slightly higher to bring this to a boil to activate the starch. Once the sauce thickens reduce it back down to a simmer.",
    "Add the chicken back to the skillet, cover and let cook for another 5-10 minutes or until the chicken is cooked all the way through.",
    "Serve with rice or cauliflower rice with the sauce spooned over the top.",
    "Add an extra sprinkling of cilantro & chillies and enjoy!"
  ],
  "ingredients": [
    "0",
    "4 skinless, boneless chicken breasts, about 1 1/2 pounds",
    "1/4 teaspoon sea salt",
    "1/4 teaspoon black pepper",
    "1 tablespoon coconut oil",
    "1/2 cup red onion, chopped (it came out to 1/2 onion for me)",
    "1 red chili, chopped optional",
    "1 cup organic chicken stock*",
    "2 tablespoons lime juice (about 1 large lime)",
    "1 tablespoon chopped cilantro",
    "1/2 teaspoon red chili flakes",
    "1/2 cup full fat coconut milk from a can or coconut cream *",
    "1 tablespoon arrow root starch for paleo or corn starch mixed into 1 tablespoons water optional* see notes"
  ],
  "__v": 1
}