{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 375 degrees. Grease a 9x13-inch baking pan with cooking spray, and set aside.",
    "Heat butter in a large saute pan over medium-high heat. Add flour, and whisk to combine. Cook for 1 minute until lightly browned, stirring frequently. Add half of the chicken stock, and whisk until combined. Then add the remaining chicken stock, green chiles, and cumin, and whisk until combined.",
    "Let the mixture continue heating until it reaches a simmer and thickens slightly, about 2-3 minutes. Stir in Greek yogurt (or sour cream) and whisk until combined. Remove from heat and set aside.",
    "To assemble the enchiladas, place 8 tortilla halves in the prepared baking pan so that they cover the bottom of the pan. Spread about ? of the cream sauce evenly on top of the tortillas. Sprinkle half of the chicken on evenly on top of the sauce, followed by half of the beans, and 1 cup shredded cheese. Repeat with a second layer of tortillas, cream sauce, chicken, beans and cheese. Then add a final layer of just tortillas, cream sauce and cheese.",
    "Cover the casserole with aluminum foil. Bake for 20 minutes. Then remove the aluminum foil and bake for an additional 15 minutes, uncovered, until the cheese is melted and begins to brown around the edges and the casserole is cooked through.",
    "Remove pan, and sprinkle with avocado and fresh cilantro. Serve warm."
  ],
  "firstAdded": "2014-10-01T06:53:22.436000",
  "hash": "a3a5673e6f09b73701bab677c6eea4db9a73b220",
  "href": "http://www.gimmesomeoven.com/white-enchilada-casserole-recipe/",
  "image": "http://www.gimmesomeoven.com/wp-content/uploads/2014/07/White-Chicken-Enchiladas-1.jpg",
  "ingredients": [
    "0",
    "3 tablespoons butter",
    "3 tablespoons all-purpose flour",
    "2 cups chicken stock",
    "1 (4 ounce) can Old El Paso chopped green chiles",
    "½ teaspoon ground cumin",
    "1 cup plain Greek yogurt or sour cream",
    "24 Old El Paso soft flour tortillas, halved",
    "2 cups shredded cooked chicken",
    "2 (14-ounce) cans White Northern beans, rinsed and drained",
    "3 cups shredded Pepper Jack cheese",
    "1 avocado, peeled, pitted and diced",
    "¼ cup chopped fresh cilantro leaves"
  ],
  "keywords": [
    "butter",
    "allpurpose",
    "flour",
    "chicken",
    "stock",
    "old",
    "paso",
    "green",
    "chiles",
    "cumin",
    "plain",
    "greek",
    "yogurt",
    "sour",
    "cream",
    "soft",
    "tortillas",
    "white",
    "northern",
    "beans",
    "rinsed",
    "pepper",
    "jack",
    "cheese",
    "avocado",
    "cilantro",
    "leaves"
  ],
  "title": "White Chicken Enchilada Casserole",
  "users": [
    null
  ]
}