{
  "hash": "f3685e453ecd63d9756ff8e72fd00f8393030184",
  "title": "Blackberry Muffins",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2005/07/blackberry-muffins-horiz-a-1600.jpg",
  "href": "http://www.simplyrecipes.com/recipes/blackberry_muffins/",
  "extension": "",
  "firstAdded": "2017-07-14T02:48:03.511000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Preheat oven, prepare muffin pan: Position rack in center of oven. Preheat oven to 400°F (200°C). Grease a standard 12 muffin pan or line with paper muffin cups. (Actually, with the berries you'll have more batter than just for 12 muffins. This batch made 18 muffins.)",
    "2 Combine dry ingredients: Whisk together the flour, baking powder, baking soda, cinnamon and salt in a large bowl.",
    "3 Combine wet ingredients and sugar: In a separate bowl, whisk together eggs, sour cream, milk, sugar, butter and vanilla.",
    "4 Add wet ingredients to dry, then add berries: Add the wet mixture to the dry mixture, and mix together with a few light strokes, just until the dry ingredients are moistened.",
    "Add the berries. (If you are using frozen berries, defrost them first, then drain the excess liquid, then coat them lightly in flour.)",
    "Do not over-mix! Over-mixing will cause the muffins to be dense, not fluffy. The batter should not be smooth, but rather lumpy.",
    "5 Put into muffin cups and bake: Divide the batter evenly among the muffin cups. Bake at 400°F (200°C) until a toothpick inserted into the middle of 1 or 2 of the muffins comes out clean, 17-20 minutes (or longer).",
    "6: Let cool: Let cool for 2 to 3 minutes before removing from the pan. If not serving hot, let cool on a rack.",
    "Serve as soon as possible, preferably within a few hours of baking."
  ],
  "ingredients": [
    "0",
    "2 1/2 cups (320g) all purpose flour",
    "1 Tbsp baking powder",
    "1/2 teaspoon baking soda",
    "1/2 teaspoon salt",
    "1/2 teaspoon cinnamon",
    "2 large eggs",
    "1 cup (236ml) sour cream",
    "1 teaspoon milk",
    "1 cup (200 g) sugar",
    "8 Tbsp warm melted butter (1 stick, 112 g)",
    "1 teaspoon vanilla",
    "1 1/2 cups (about 5-6 oz, about 150g) of blackberries, fresh or frozen (if using fresh berries, cut them in half, if using frozen berries, defrost first, drain excess liquid, then coat them lightly in flour)"
  ],
  "__v": 1
}