{
  "hash": "4e99f3fad7c7edb41c8576211e0bbe64d510942a",
  "title": "Pork Tenderloin with Salsa Verde",
  "image": "http://content0.tastebook.com/content/photo/user_photo/C8Or71oq13c223233353035353htHSZfTw_1429258018.jpg",
  "href": "http://www.tastebook.com/recipes/4203574-Pork-Tenderloin-with-Salsa-Verde",
  "extension": "Chrome",
  "firstAdded": "2015-04-17T14:23:23.786000",
  "users": [
    null
  ],
  "keywords": [
    "cancel",
    "pork",
    "tenderloin",
    "garlic",
    "divided",
    "olive",
    "oil",
    "salt",
    "paprika",
    "cumin",
    "oregano",
    "coriander",
    "tomatillos",
    "husked",
    "anaheim",
    "chiles",
    "jalapeo",
    "chile",
    "green",
    "onions",
    "cilantro",
    "lime",
    "wedges"
  ],
  "directions": [
    "0",
    "1Cut the pork tenderloin lengthwise down the middle, without cutting all the way through. Open the tenderloin like a book. In a small bowl, combine 2 cloves of chopped garlic, 1 tablespoon olive oil, 1 teaspoon of salt, and the paprika, cumin, oregano, and coriander. Rub the spice mixture all over the pork, and set aside while you make the salsa (you can refrigerate this up to 1 day ahead).",
    "2Preheat the broiler. Place the tomatillos, Anaheims, and jalapeño on a broiler pan and broil, turning often, until lightly charred on all sides. Transfer the Anaheims and jalapeño to a bowl, and cover tightly with plastic wrap to steam. Let the tomatillos cool slightly.",
    "3Meanwhile, heat the remaining 2 tablespoons of olive oil in a small pan over medium heat. Add the green onions and sauté 2 minutes. Add the remaining 2 cloves of chopped garlic and sauté 1 minute more. Remove from the heat.",
    "4When the chiles are cool enough to handle, peel and seed them. Place them in a food processor with the tomatillos, the green onion/garlic mixture (with the oil), cilantro, and 1/2 teaspoon salt. Pulse until almost smooth.",
    "5Place the pork on a broiler pan and broil for 5 minutes on each side. Remove from the oven, tent with foil, and let the pork rest for 10 minutes before slicing diagonally across the grain. Serve with the salsa verde and lime wedges."
  ],
  "ingredients": [
    "0",
    "No, cancel",
    "Ingredients",
    "1 pound pork tenderloin",
    "4 cloves chopped garlic, divided",
    "3 tablespoons olive oil, divided",
    "1 1/2 teaspoons salt, divided",
    "2 teaspoons paprika",
    "1 1/2 teaspoons ground cumin",
    "1 1/2 teaspoons dried oregano",
    "1/2 teaspoon ground coriander",
    "1/2 pound fresh tomatillos, husked",
    "2 Anaheim chiles",
    "1 jalapeño chile",
    "2 green onions, chopped",
    "1/2 cup chopped fresh cilantro",
    "Lime wedges"
  ],
  "__v": 1
}