{
  "hash": "7e238656973e795f4461d57ae0a2804c8430cce9",
  "title": "Garlic Shrimp and White Beans",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/garlic-shrimp-and-white-beans?mbid=social_facebook",
  "extension": "Chrome",
  "firstAdded": "2016-10-12T21:55:40.602000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat broiler. Heat 2 Tbsp. oil in a large, heavy, ovenproof skillet over medium heat. Add 1 garlic clove, chiles, and bay leaf and cook, stirring constantly, just until fragrant, 1–2 minutes (do not allow garlic to burn). Add tomato; season with salt and pepper. Cook, stirring and smashing tomato with the back of a wooden spoon, until tomato is completely broken down, about 5 minutes.",
    "Add tomato paste and cook, stirring constantly, until paste is deep red and caramelized, 3–4 minutes. Stir in beans and broth. Bring to a brisk simmer and cook until juices are slightly reduced and thickened, 3–4 minutes. Season to taste with salt and pepper.",
    "Combine remaining 2 garlic cloves, 2 Tbsp. oil, shrimp, and paprika in a medium bowl; season with salt and pepper and toss to evenly coat shrimp. Scatter shrimp over beans in an even layer.",
    "Broil until shrimp are golden and cooked through, about 3 minutes. Drizzle remaining 2 Tbsp. oil over shrimp and beans; garnish with parsley. Serve with bread, if desired",
    "1",
    "Dried chiles de árbol are available at Latin markets, specialty foods stores, and some supermarkets."
  ],
  "ingredients": [
    "0",
    "6 tablespoons olive oil, divided",
    "3 garlic cloves, minced, divided",
    "2 dried chiles de árbol",
    "1 bay leaf, preferably fresh",
    "1 1/4 cups chopped tomato (about 8 ounces)",
    "Kosher salt, freshly ground pepper",
    "1 tablespoon tomato paste",
    "2 15-ounce cans white beans (such as cannellini), rinsed, drained",
    "1 cup low-sodium chicken broth",
    "1 pound medium shrimp, peeled, deveined",
    "1 teaspoon smoked paprika",
    "2 tablespoons chopped flat-leaf parsley",
    "Grilled bread (optional)"
  ],
  "__v": 1
}