{
  "hash": "cb74771e4d9d6743e1df30fc2f5c95f0177896e6",
  "title": "Fruited-Cheesecake Flag",
  "image": "https://assets.marthastewart.com/styles/wmax-750/d13/ld104016_0708/ld104016_0708_flagcover_horiz_0.jpg?itok=JZLIcEp4",
  "href": "https://www.marthastewart.com/318054/fruited-cheesecake-flag",
  "extension": "Chrome",
  "firstAdded": "2020-01-04T20:22:34.575000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 300 degrees. Coat a 13-by-18-inch rimmed baking sheet with cooking spray. Line with parchment, leaving a 2-inch overhang on the long sides. Coat parchment with spray.",
    "Sift flour and 1 3/4 teaspoons salt into a bowl. Cream butter with a mixer on medium-high speed, occasionally scraping bowl, until fluffy, 3 to 5 minutes. With the mixer running, slowly add light-brown sugar, beating until very pale and fluffy, about 2 minutes. Add flour mixture all at once, and beat on low speed until just incorporated.",
    "Transfer dough to sheet. Use a large piece of plastic wrap to press dough into an even layer that covers the bottom of the sheet. Cover and refrigerate until firm, about 20 minutes.",
    "Bake dough until entire surface is golden brown, about 40 minutes. Let cool completely in sheet on a wire rack. Raise oven temperature to 350.",
    "In a clean bowl, beat cream cheese with a mixer on medium speed, occasionally scraping bowl, until fluffy, about 3 minutes. Reduce speed to low, and add granulated sugar in a slow, steady stream. Scrape bowl, then mix in lemon zest, vanilla and almond extracts, and a pinch of salt until well combined. Scrape bowl, then beat in eggs, 1 at a time, until incorporated. The mixture should be very smooth; scrape bowl as necessary. Pour over crust, and spread into an even layer.",
    "Bake until filling is set, about 25 minutes. Let cool completely in sheet on rack. Refrigerate until firm and cold, about 4 hours (or overnight).",
    "Run a sharp knife along short sides of sheet, and use parchment to lift out cheesecake. Run knife under hot water and dry well. Use it to cut cheesecake into 48 squares, wiping knife clean between cuts.",
    "Transfer squares to a serving platter, reforming the rectangle. Decorate top left squares (3 down and 4 across), placing a blackberry in the center of each square and mounding blueberries around it. Using a long offset spatula, slide out 4 squares from bottom row. Top each square with 3 strawberry slices, dust with confectioners' sugar, and return to rectangle. Repeat with remaining 4 squares on bottom row and then squares on alternating rows. Alternatively, omit strawberries and dust alternating rows generously with confectioners' sugar. Place raspberries on every unadorned row, beginning with top row. Serve immediately (or refrigerate overnight)."
  ],
  "ingredients": [
    "0",
    "Vegetable-oil cooking spray",
    "3 cups all-purpose flour",
    "Coarse salt",
    "12 ounces (3 sticks) unsalted butter, softened",
    "1 cup plus 2 tablespoons light-brown sugar",
    "32 ounces cream cheese, room temperature",
    "1 1/2 cups granulated sugar",
    "1 teaspoon finely grated lemon zest",
    "1/2 teaspoon pure vanilla extract",
    "1/4 teaspoon pure almond extract",
    "4 large eggs, room temperature",
    "6 ounces (1 1/2 cups) blackberries",
    "8 3/4 ounces (2 cups) blueberries",
    "1 pound strawberries, hulled and sliced lengthwise into thirds (optional)",
    "Confectioners' sugar, for dusting",
    "12 ounces (3 cups) raspberries"
  ],
  "__v": 2
}