{
  "hash": "54f551922276e25abd870ec7483673fc6f630424",
  "title": "How to Replace Custard Powder",
  "image": "http://photos2.demandstudios.com/DM-Resize/photos.demandstudios.com%2Fgetty%2Farticle%2F76%2F25%2F200423079-001_XS.jpg?w=400&h=10000&keep_ratio=1",
  "href": "http://www.livestrong.com/article/486405-how-to-replace-custard-powder/",
  "extension": "Chrome",
  "firstAdded": "2015-03-03T17:18:03.918000",
  "users": [
    null
  ],
  "keywords": [
    "things",
    "youll",
    "need",
    "cornstarch",
    "vanilla",
    "flour",
    "medium",
    "saucepan",
    "sugar",
    "salt",
    "milk",
    "egg",
    "yolks"
  ],
  "directions": [
    "0",
    "Custard powder was created by a Birmingham chemist named Bird in 1837. His wife was allergic to eggs. The original custard powder contained cornstarch, salt, vanilla flavoring and annato coloring, and was cooked with milk to make pudding. It is still available, with the same ingredients. However, there are also instant custard powders that contain modified starch, hydrogenated vegetable oil and carboxymethyl cellulose and carrageenan thickeners instead of cornstarch. If you can't find custard powder, or you want to save money, you may prefer to make your own. It is easy to find substitutes for custard powder, for a variety of uses.",
    "Step 1 Substitute cornstarch equally for custard powder when it is called for as an ingredient in recipes for cakes, desserts or sauces. For instance, if the recipe calls for 2 tbsp. of custard powder, use 2 tbsp. of cornstarch. Add vanilla extract to match the flavor of custard powder. You can also substitute 2 tbsp. of flour for 1 tbsp. of custard powder as a thickening in sauces or puddings.",
    "You Might Also Like",
    "Nutritional Information for Custard Vs. Ice Cream How to Substitute Baking Powder With Vitamin C Powder Restaurant Nutrition Guide for Andy's Frozen Custard Do You Cook the Crust Before Filling a Quiche? Calories in Vanilla Powder Powdered Eggs Nutritional Facts How to Cook Leche Flan Using the Oven Can You Make Protein Powder at Home? How to Select a Protein Powder How to Use Cornstarch to Make Breaded Cutlets How to Make Vegan Sugar-Free Sweetened Condensed Milk Garlic Cloves Vs. Garlic Powder How to Make a Bavarian Cream Filling What Can I Use Instead of Cream of Tartar to Make Coconut Macaroons? How Many Calories Are in a Cup of Powdered Sugar? How to Bake an Unbaked Pie Shell",
    "Step 2 Substitute vanilla or chocolate pudding mix if you can't find custard powder and you want to make a pudding, filling or sauce. You can also make a pudding from scratch just as easily as using a mix. Combine 1/2 cup of sugar, 3 tbsp. of cornstarch and a pinch of salt in a saucepan. Stir in 2 cups of milk gradually, making a paste and then thinning it with the remaining milk. Cook over medium heat, stirring constantly, until the pudding thickens and coats your spoon. Add 1 tsp. vanilla, cool the pudding and serve. Avoid instant pudding mixes because of the hydrogenated fat.",
    "Step 3 Make creme Anglaise, if you aren't allergic to eggs. It takes about 10 minutes to make. Creme Anglaise was what Bird tried to copy when he developed his custard powder. He substituted cornstarch for egg yolks as a thickener. Heat 2 cups of milk in a medium saucepan. Stir 1/2 cup of sugar and a pinch of salt into 4 egg yolks. When the milk begins to bubble around the edges, stir a little of it into the egg yolks to temper them. Pour the tempered egg yolks into the saucepan of milk, and stir constantly until the pudding begins to thicken and coat your spoon. Remove it from the heat immediately and add the vanilla. Pour the pudding into a bowl. Let it cool thoroughly. Use as a pudding, filling or sauce.",
    "Warnings:Tempering the egg yolks helps to prevent curdling. Stirring constantly also helps, as does removing the pudding from the heat as soon as it starts to thicken.",
    "Tips:Use low-fat milk to make cornstarch pudding to reduce the calories.",
    "Cornstarch will also thicken almond or soy milk, if you want to make a pudding for someone who is allergic to dairy products."
  ],
  "ingredients": [
    "0",
    "Things You'll Need",
    "Cornstarch",
    "Vanilla",
    "Flour",
    "Medium saucepan",
    "1/2 cup sugar",
    "Pinch of salt",
    "2 cups milk",
    "4 egg yolks"
  ],
  "__v": 3
}