{
  "hash": "11208619697868015bec91d250840c213b95277e",
  "title": "Battered Squash Blossoms",
  "image": "",
  "href": "http://recipe-folder.com/recipe/5bd4cad29d3ecd0639792091",
  "extension": "User Added",
  "firstAdded": "2018-10-27T20:30:10.273000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare the batter first. Sift together dry ingredients, then whisk in milk, beer or cold water until smooth. Cover and set in the refrigerator for 30 minutes. Leftover batter can be stored for up to two days. If it is too thick after refrigeration, add a few drops of water to return to original consistency.",
    "1",
    "Meanwhile, prepare the stuffing. In a bowl combine the ricotta cheese, garlic, salt, pepper, mushrooms and basil. Open the blossoms and spoon about one 1/2 teaspoon of the mixture into the center of each. Avoid overfilling the blossoms. Twist the top of each blossom together to close. Place on a baking sheet and refrigerate for 15 minutes.",
    "2",
    "Pour the oil into a skillet to a depth of 1/2 inch. Heat over high heat until a small cube of bread dropped into the oil turns golden brown within seconds.",
    "3",
    "Briefly dip each stuffed blossom into the batter, then carefully slip into the hot oil. Cook until golden on all sides, about three minutes total cooking time. Add only as many blossoms at a time as will fit comfortably in the skillet. Transfer with a slotted utensil to paper towels to drain briefly.",
    "4",
    "Sprinkle with salt, if desired and serve immediately."
  ],
  "ingredients": [
    "0",
    "batter:",
    "1",
    "1 cup flour",
    "2",
    "1/2 cup cornstarch",
    "3",
    "1/2 teaspoon salt",
    "4",
    "1 cup fat-free chilled milk, beer or water",
    "5",
    "stuffing:",
    "6",
    "1/4 cup ricotta cheese",
    "7",
    "1 garlic clove, minced or pressed",
    "8",
    "1/4 teaspoon each salt and pepper",
    "9",
    "2 tablespoon mushrooms, finely chopped",
    "10",
    "1 tablespoons fresh basil or parsley, minced",
    "11",
    "16 large squash blossoms, washed",
    "12",
    "Canola oil for frying"
  ],
  "__v": 1,
  "hidden": true
}