{
  "hash": "34977afb83d8422ff12638b28a0991dfee9792bd",
  "title": "GNOCCHI WITH BASIL BUTTER SAUCE",
  "image": "http://skinnymixers.com.au/wp-content/uploads/2015/07/IMG_0629-825x510.jpg",
  "href": "http://skinnymixers.com.au/skinnymixers-lchf-gnocchi-with-basil-butter-sauce/",
  "extension": "Chrome",
  "firstAdded": "2018-11-28T05:31:45.504000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Gnocchi Instructions",
    "Add almonds and parmesan to mixer bowl, mill for 10 sec/speed 9/MC on. (Bellini users may need to do 15 sec)",
    "Add remaining gnocchi ingredients and combine for 15 sec/speed 4/MC on. Scrape mixture out into a bowl and set aside.",
    "Without washing the bowl, put the liquid chicken stock in and set for 10 min/steaming temperature/speed 3/MC OFF.",
    "In the mean time, with damp hands, roll the gnocchi mixture into small balls (about half a tbsp) and arrange on both steaming trays, ensure they aren't touching as they will swell. Press each one lightly with a fork.",
    "Put the steaming trays in place and steam for 7 min/steaming temperature/speed 2.",
    "When the gnocchi has finished steaming, set the varoma trays aside and allow the gnocchi to cool while preparing the sauce.",
    "Sauce Instructions",
    "Retain about 100 g of the liquid stock left over from cooking the gnocchi and add the cubed butter to the bowl. Cook for 4 min/steaming temperature/speed 2/MC OFF. You will want to make sure this doesnt bubble up outside of the machine.",
    "Add the lemon juice and fresh basil leaves to the mixer bowl and cook for 2 min/steaming temperature/speed 1/MC OFF.",
    "Serve immediately with sauce spooned over gnocchi and garnished with fresh basil and shaved parmesan."
  ],
  "ingredients": [
    "0",
    "Gnocchi Ingredients:",
    "100 g | 3.5 oz blanched almonds",
    "100 g | 3.5 oz Parmesan, small cubes",
    "250 g | 8.8 oz full fat ricotta (from the supermarket deli counter not from a tub)",
    "1 whole egg",
    "¼ - ½ tsp salt (to taste preference)",
    "⅛ tsp cracked black pepper",
    "Sauce Ingredients",
    "400 g | 14.1 oz liquid chicken stock (or 1 tbsp stock concentrate and 400 g water)",
    "100 g | 3.5 oz unsalted butter, cubed",
    "1 tsp fresh lemon juice",
    "20 fresh basil leaves, torn in half"
  ],
  "__v": 1
}