{
  "__v": 4,
  "directions": [
    "0",
    "Bolognese Sauce: In shallow Dutch oven, sautee lamb over medium-high heat, breaking up with spoon, until no longer pink, about 10 minutes. Drain fat from pan.",
    "Add onions, garlic, oregano, cinnamon, salt, pepper and allspice to pan; fry over medium heat until onion is softened, about 5 minutes.",
    "Add tomatoes, mashing to break into small pieces. Add tomato paste; bring to boil. Reduce heat and simmer until space does not fill in after spoon is drawn across bottom of pan, about 30 minutes.",
    "Meanwhile, peel potatoes and eggplant; cut into 1/2-inch (1 cm) thick slices. Arrange in single layer on parchment paper-lined rimmed baking sheets. Brush both sides with oil; sprinkle with salt and pepper. Roast in 450°F (230°C) oven, turning once, until tender and golden brown, about 30 minutes.",
    "Béchamel Sauce Meanwhile, in saucepan, melt butter over medium heat; whisk in flour and cook, whisking, for 1 minute. Gradually whisk in milk; cook, whisking often, until boiling and thickened enough to coat back of spoon, about 12 minutes. Add salt, pepper and nutmeg.",
    "Spread 1 cup (250 mL) of the Bolognese Sauce in 13- x 9-inch (3 L) glass baking dish. Layer with half of the potatoes, 2 cups (500 mL) of the Bolognese Sauce, all of the eggplant, 2 cups (500 mL) of the Bolognese Sauce, remaining potatoes and remaining Bolognese Sauce. Spread Béchamel Sauce over top. (Make-ahead: Let cool for 30 minutes. Refrigerate, uncovered, until cold; cover and refrigerate for up to 24 hours. Add 40 minutes to baking time.)"
  ],
  "firstAdded": "2014-02-23T01:38:12.472000",
  "hash": "790241fe8e1705c34ee95b92e9f166fabf3b9892",
  "href": "http://www.canadianliving.com/food/greek_moussaka.php",
  "image": "http://www.canadianliving.com/img/photos/biz/Greek-Moussaka-thumb-610xauto-281364231118.jpg",
  "ingredients": [
    "0",
    "6 large Yukon Gold potatoYukon Gold potatoes, (2-1/2 lb/1.25 kg)",
    "1 large eggplant, (1-1/4 lb/625 g)",
    "3 tbsp (45 mL) extra-virgin olive oil",
    "1/2 tsp (2 mL) salt",
    "1/2 tsp (2 mL) pepper",
    "1-1/2 cups (375 mL) shredded mozzarella cheese",
    "2 lb (907 g) lean ground lamb or lean ground beef",
    "2 onion, chopped",
    "4 cloves garlic, minced",
    "4 tsp (18 mL) dried oregano",
    "1-1/2 tsp (7 mL) ground cinnamon",
    "1/2 tsp (2 mL) salt",
    "1/2 tsp (2 mL) pepper",
    "1/4 tsp (1 mL) ground allspice",
    "1 can (28 oz/796 mL) tomatoes",
    "1 can (5-1/2 oz/156 mL) tomato paste",
    "2 tbsp (30 mL) butter",
    "1/3 cup (75 mL) all-purpose flour",
    "3 cups (750 mL) milk",
    "1/2 tsp (2 mL) salt",
    "1/4 tsp (1 mL) pepper",
    "1 Pinch grated nutmeg"
  ],
  "keywords": [
    "yukon",
    "potatoyukon",
    "gold",
    "potatoes",
    "eggplant",
    "extravirgin",
    "olive",
    "oil",
    "salt",
    "pepper",
    "kefalograviera",
    "gruyre",
    "cheese",
    "lamb",
    "lean",
    "beef",
    "oniononions",
    "garlic",
    "oregano",
    "cinnamon",
    "allspice",
    "tomatotomatoes",
    "red",
    "wine",
    "tomato",
    "butter",
    "allpurpose",
    "flour",
    "milk",
    "nutmeg"
  ],
  "title": "Greek Moussaka",
  "users": [
    null
  ],
  "ratings": []
}