{
  "hash": "d70e84d113bf1678b426a5523fd2692794538e38",
  "title": "Arroz Caldo (Filipino Chicken and Rice Soup)",
  "image": "http://www.seriouseats.com/recipes/assets_c/2015/02/20150227-arroz-caldo-josh-bousel-thumb-1500xauto-419931.jpg",
  "href": "http://www.seriouseats.com/recipes/2015/03/arroz-caldo-chicken-rice-soup-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-03-17T05:14:48.528000",
  "users": [
    null
  ],
  "keywords": [
    "canola",
    "oil",
    "divided",
    "garlic",
    "medium",
    "onion",
    "ginger",
    "boneless",
    "skinless",
    "chicken",
    "thighs",
    "pieces",
    "asian",
    "fish",
    "black",
    "pepper",
    "uncooked",
    "jasmine",
    "rice",
    "stock",
    "lowsodium",
    "broth",
    "calamansi",
    "key",
    "lime",
    "juice",
    "kosher",
    "salt",
    "scallions",
    "hardboiled",
    "eggs",
    "slices",
    "limes"
  ],
  "directions": [
    "0",
    "Place 1/2 cup of oil and two-thirds of the garlic in a small saucepan over medium heat. Cook, stirring occasionally, until garlic turns light golden brown. Transfer garlic to fine mesh strainer and drain. Spread garlic out on a paper towel-lined plate and set aside.",
    "Heat remaining oil in a large Dutch oven or soup pot over medium-high heat until shimmering. Add onion and cook, stirring occasionally, until softened, but not browned, about 5 minutes. Add ginger and remaining garlic and cook for 1 minute longer. Add chicken and cook until browned all over. Stir in fish sauce and pepper and cook for 1 minute. Add rice and stir until well coated.",
    "Stir in chicken stock, running spoon along bottom of Dutch oven to release any browned bits. Bring to a boil, then reduce to a simmer, cover, and cook until rice is completely tender and stock has thickened, about 20 minutes. Stir in lime or calamansi juice and season with salt and pepper to taste.",
    "Ladle arroz caldo into bowls. Top with scallions, fried garlic, and egg slices, if using. Serve immediately with additional lime or calamansi wedges on the side."
  ],
  "ingredients": [
    "0",
    "2/3 cup canola oil, divided",
    "1/4 cup freshly minced garlic (about 12 medium cloves), divided",
    "1 medium onion, thinly sliced",
    "1 tablespoon freshly minced ginger",
    "1 1/2 pounds boneless, skinless chicken thighs, cut into bite-sized pieces (see note above)",
    "1 tablespoon Asian fish sauce",
    "1 teaspoon freshly ground black pepper, plus more to taste",
    "1 cup uncooked jasmine rice",
    "6 cups homemade chicken stock or low-sodium broth",
    "1 tablespoon calamansi, key lime, or lime juice (see note above)",
    "Kosher salt",
    "4 scallions, thinly sliced",
    "2 hard-boiled eggs, cut into 1/4-inch slices (optional)",
    "2 fresh limes or calamansi, quartered"
  ],
  "__v": 1
}