{
  "hash": "b203d10626433dfcaf6aac396d4c81c826587cbb",
  "title": "CREAMY CHORIZO AND BRUSSELS SPROUTS SOUP",
  "image": "https://www.gimmesomeoven.com/wp-content/uploads/2013/10/Creamy-Brussels-Sprouts-and-Chorizo-Soup-1-160x160.jpg",
  "href": "https://www.gimmesomeoven.com/creamy-chorizo-and-brussels-sprouts-soup-recipe/",
  "extension": "Chrome",
  "firstAdded": "2019-01-02T23:56:59.408000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS:",
    "Saute chorizo in a large stockpot over medium high heat until cooked, about 3-5 minutes, stirring occasionally. Remove chorizo with a slotted spoon. Reserve 2 tablespoons of grease in the stockpot, and discard the rest.",
    "Add onion to the stockpot, and saute in the chorizo grease for 5 minutes or until soft and translucent, stirring occasionally. Add garlic and brussels sprouts, and saute for an additional 3 minutes or until the brussels sprouts begin to brown, stirring occasionally. Add chicken broth, potatoes, paprika, salt and pepper, and stir to combine. Bring to a boil, then reduce heat to medium-low, cover and simmer for 10-15 minutes, or until the potatoes are tender.",
    "If you would like a pureed soup, blend soup using an immersion blender or stand blender. If you would like a chunkier soup, leave it as is. Stir in evaporated milk and chorizo, reserving 1/4 cup chorizo for toppings if desired. Season with additional salt and pepper if needed.",
    "Serve warm with toppings."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS:",
    "8 ounces Spanish chorizo, finely diced",
    "1 medium white onion, diced",
    "2 cloves garlic, minced",
    "1 lb. brussels sprouts, finely chopped",
    "4 cups chicken broth",
    "2 cups (about 1/2 pound) diced Yukon gold potatoes",
    "1 tsp. paprika",
    "1/2 tsp. sea salt",
    "1/4 tsp. black pepper",
    "1 (6 oz.) can evaporated milk",
    "optional toppings: shredded Manchego or Parmesan cheese, chopped fresh parsley, reserved chorizo"
  ],
  "__v": 1
}