{
  "hash": "18bdeb3f914b5329631b1b159a6c3e1fc52e3711",
  "title": "Best Low Carb Tortillas",
  "image": "https://cdn4.ruled.me/wp-content/uploads/2013/11/Tortillas-23.jpg",
  "href": "https://www.ruled.me/low-carb-tortillas/",
  "extension": "Chrome",
  "firstAdded": "2017-04-08T18:30:55.612000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Add all dry ingredients to a bowl. Mix well.",
    "Add butter and/or coconut oil and mix thoroughly.",
    "Pour hot broth into the bowl and stir with a spoon until the butter is melted and everything is well incorporated.",
    "Roll dough into a log shape. Cut into 8 equal parts.",
    "Grease a griddle, cast iron skillet, or frying pan lightly with butter or coconut oil, then heat to medium heat.",
    "Shape each part into a ball. On a sheet of parchment paper, take each ball and roll out as well as you can. If necessary, use a piece of parchment paper on top of the dough, as well. If the dough tears, it is easily fixed. Just keep working with it. Your goal is to get it spread out evenly.",
    "Grab a medium size pan lid, place it on top of the dough, twist, and lift. You will get perfectly round tortillas.",
    "Lift the parchment paper and place the tortilla over your hand, peeling the paper off with your other hand.",
    "Continue doing this until all of your dough is used. Don’t forget to use the excess dough to roll together for more tortillas.",
    "Put into the hot griddle until the bottom begins to brown, then flip. Cook both sides until nice and browned, remove, and enjoy.",
    "Use these to make quesadillas, tacos, and many other recipes!"
  ],
  "ingredients": [
    "0",
    "1 cup coconut flour",
    "4 tablespoons psyllium husk powder",
    "1/2 cup softened butter, coconut oil, or grass-fed lard",
    "1/4 teaspoons garlic granules (or powder)",
    "1/4 teaspoons cumin",
    "1/2 teaspoons red chili powder",
    "2 cups hot broth or hot water (I use homemade chicken broth)"
  ],
  "__v": 1
}