{
  "__v": 1,
  "directions": [
    "0",
    "To make the salsa verde, put the herbs into a processor and whizz until smooth. Add the garlic, anchovies, mustard, egg yolk, and some freshly ground black pepper (but no salt) and whizz again until smooth.",
    "Arrange one fillet on a chopping board and spread the salsa verde over the top in an even layer. Sit the other fillet on top so it looks like a whole fish.",
    "Cut two-thirds of the pastry from the block (freeze the rest for later) and place on a piece of lightly floured baking parchment. Roll it out so it is long enough and wide enough to enclose the fillets completely. Sit the fillets in the centre and brush the pastry with the beaten egg (reserving some for later). Fold the ends of the pastry over the fillet and bring the sides up to meet at the top. Pinch the edges together with your fingers. Chill for a minimum of 30 minutes.",
    "Preheat the oven to 220 ̊C / gas mark 7 and put a baking sheet in to get hot. Brush the en croûte with beaten egg, then coarsely grate the frozen pastry and scatter on top.",
    "Transfer the en croûte (still on the baking parchment) to the hot baking sheet and bake for 25 to 30 minutes or until the pastry is golden and cooked at the top and bottom. Allow to rest at room temperature for about 15 minutes.",
    "Meanwhile, make the dressing. Plunge the tomatoes into boiling salted water for one minute, then remove with a slotted spoon, plunge into cold water, and drain. Remove the skins, then deseed, cut into dice and tip into a bowl. Add the remaining ingredients, season with salt and freshly ground black pepper, and stir to combine.",
    "Carve the en croûte into thick slices and serve the dressing alongside in a bowl."
  ],
  "firstAdded": "2014-05-22T09:59:23.669000",
  "hash": "dc35926f59fb6d655d371b32c7b2ea3c7f101121",
  "href": "http://www.redonline.co.uk/food/recipes/mary-berry-salmon-salsa-verde-en-crou-te",
  "image": "http://assets.redonline.co.uk/var/ezflow_site/storage/images/media/banners/article-banners/food/recipe-pics/mary-berry-s-salmon-en-croute-recipe-cook-up-a-feast-by-mary-berry-lucy-young/6818236-1-eng-GB/mary-berry-s-salmon-en-croute-recipe-cook-up-a-feast-by-mary-berry-lucy-young_article_banner_img.jpg",
  "ingredients": [
    "0",
    "You will need",
    "For the salsa verde:",
    "3 tbsp flat-leaf parsley",
    "2 tbsp fresh basil leaves",
    "2 tbsp fresh mint leaves",
    "1 garlic clove, halved",
    "3 anchovy fillets",
    "2 tbsp Dijon mustard",
    "1 egg yolk",
    "Freshly ground black pepper",
    "2 x 350g salmon fillets, skinned and bones removed",
    "375g packet all-butter puff pastry",
    "A little plain flour, to dust",
    "1 egg beaten with 1 tbsp milk",
    "For the dressing:",
    "2 large firm but ripe tomatoes",
    "Pinch of salt",
    "2 spring onions, finely chopped",
    "2 tsp caster sugar",
    "2 tbsp white wine vinegar",
    "4 tbsp olive oil",
    "1⁄2 tsp Dijon mustard",
    "1 tbsp freshly chopped parsley"
  ],
  "keywords": [
    "need",
    "salsa",
    "verde",
    "flatleaf",
    "parsley",
    "basil",
    "leaves",
    "mint",
    "garlic",
    "clove",
    "anchovy",
    "fillets",
    "dijon",
    "mustard",
    "egg",
    "yolk",
    "black",
    "pepper",
    "salmon",
    "skinned",
    "bones",
    "allbutter",
    "puff",
    "pastry",
    "plain",
    "flour",
    "dust",
    "milk",
    "dressing",
    "firm",
    "tomatoes",
    "salt",
    "spring",
    "onions",
    "caster",
    "sugar",
    "white",
    "wine",
    "vinegar",
    "olive",
    "oil"
  ],
  "title": "Mary Berry’s salmon salsa verde en croûte",
  "users": [
    null
  ]
}