{
  "__v": 1,
  "directions": [
    "0",
    "Pre-heat your oven to 200°C/400°F. Add you flour, salt & bicarb to a big mixing bowl.",
    "Throw in your nuts & berries.",
    "Pour in your buttermilk.",
    "Mix together until combined, but not too much you don't want to overwork it. Once you have a fairly unattractive dough, you're done. If it's a bit wet, add a little more flour. Flour a surface and pop your dough onto it.",
    "Half it.",
    "Roll lightly in the flour, shape into a ball, place onto a baking tray and flatten a little.",
    "Repeat with your second loaf. Cut a shallow cross into the tops. Supposedly this is to keep the devil out (apparently he must love soda bread) but it also helps with heat distribution so don't skip it.",
    "Pop them into your oven for about half an hour. Just before they finish, wet two tea towels & wring them out so they're just damp, not wet.",
    "Remove your loaves & wrap them in the tea towels.",
    "This will give you a lovely crust & stop it from getting too crunchy. In the old days you'd walk through the village & see all the cottages with wrapped loaves cooling on the windowsills. When in Rome...",
    "When they've cooled down, you're ready to slice into them.",
    "Spread with whatever your heart desires."
  ],
  "firstAdded": "2014-08-29T22:10:11.313000",
  "hash": "98c3ae17b79e4ee54f4aab8b5d31c4b4ca7712dd",
  "href": "http://www.thelondoner.me/2013/01/irish-soda-bread.html",
  "image": "https://s3-eu-west-1.amazonaws.com/the-londoner-media/images/irishsodabreadrecipe-15-fwdTuJnauAVGWQd4ZywLPh.jpg",
  "ingredients": [
    "0",
    "1.5lbs wholemeal flour",
    "1.5tsp bicarbonate of soda (USA -baking soda, not baking powder)",
    "1.5tsp salt",
    "1pints butter milk (if you can't get buttermilk, you can add the juice of 1 lemon to fullfat milk)",
    "4oz pine kernels 4oz dried cranberries"
  ],
  "keywords": [
    "lbs",
    "wholemeal",
    "flour",
    "bicarbonate",
    "usa",
    "soda",
    "baking",
    "salt",
    "pints",
    "butter",
    "buttermilk",
    "juice",
    "lemon",
    "fullfat",
    "milk",
    "pine",
    "kernels",
    "cranberries"
  ],
  "title": "Irish soda bread.",
  "users": [
    null
  ]
}