{
  "hash": "1fc09be683442b1eef7658760d461f36c00cdf13",
  "title": "Lemon Curd Sponge Cake",
  "image": "http://www.donalskehan.com/wp-content/uploads/Kylemore-Abbey_51-639x958.jpg",
  "href": "http://www.donalskehan.com/2014/07/lemon-sponge/",
  "firstAdded": "2015-01-23T19:42:09.961000",
  "users": [
    null
  ],
  "keywords": [
    "serves",
    "butter",
    "caster",
    "sugar",
    "free",
    "range",
    "eggs",
    "vanilla",
    "self",
    "raising",
    "flour",
    "zest",
    "juice",
    "lemon",
    "milk",
    "loosen",
    "batter",
    "buttercream",
    "softened",
    "icing",
    "sifted",
    "curd",
    "filling",
    "cornflour",
    "lemons",
    "egg",
    "yolks",
    "salt",
    "finish",
    "dusting"
  ],
  "directions": [
    "0",
    "For the lemon curd, place the sugar, cornflour and 450ml water in a large saucepan and stir until you have a smooth mixture. Stir in the lemon juice, egg yolks and salt. Place over a medium heat and keep stirring while the mixture boils, for about 10–12 minutes. Stir in the lemon zest and butter until the butter has melted, then remove the pan from the heat and allow to cool.",
    "Preheat the oven to 180°c the grease and line 2 21cm springform tins. In a standalone mixer, cream the butter, sugar and lemon zest together until pale and fluffy. Then beat in the eggs one by one before adding the vanilla extract and lemon juice. Using a spatula, fold in the flour until you have a smooth mixture. Use a little bit of the milk if you need to loosen the mixture. You want the mixture to be a bit loose.",
    "Divide the mixture into the two springform tins, flatten the top with a spatula if needed. Bake in the oven for about 20 minutes, until it’s nice and golden. When the bases are cooked, take them out and let cool for a few minutes before you take it out of the tin to cool completely. While the bases are cooling prepare the buttercream filling by beating the butter and vanilla extract together in a bowl until light and fluffy then add the icing sugar, a little at a time, until it is all incorporated and the mixture is smooth.",
    "To assemble the cake, spread some lemon curd on one of the bases before topping with buttercream, then add the second base and sprinkle with icing sugar."
  ],
  "ingredients": [
    "0",
    "Serves 8",
    "225g butter",
    "225g caster sugar",
    "4 large free range eggs",
    "3tsp vanilla extract",
    "225g self raising flour",
    "zest & juice of 1 lemon",
    "about 3 tablespoons of milk to loosen batter",
    "For the buttercream",
    "150g butter, softened",
    "1/2 teaspoon vanilla extract (optional)",
    "275g icing sugar, sifted",
    "For the lemon curd filling",
    "300g caster sugar",
    "50g cornflour",
    "120ml lemon juice (about 2–3 lemons)",
    "4 large egg yolks",
    "a pinch of salt",
    "finely grated zest of 2 lemon",
    "60g (21/2 oz) Butter",
    "To Finish",
    "Dusting of icing sugar"
  ],
  "__v": 1
}