{
  "hash": "5ad9bb007c06f0043afab68bccfcb37cdbce8e93",
  "title": "Chickpea Taco Bowls",
  "image": "https://images.food52.com/RSE5W9UB3DZMPKMmNExkGCQd68M=/753x502/93a8b5c0-c962-4c2f-aa8b-aa97a83a358a--chickpeatacobowls2.jpg",
  "href": "https://food52.com/recipes/67413-chickpea-taco-bowls",
  "extension": "Firefox",
  "firstAdded": "2017-03-26T14:48:46.839000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "If using dried chickpeas: Dissolve the 3 tablespoons of salt into a large bowl of water (your largest mixing bowl, or about 4 quarts water). Add the chickpeas and soak for 8 to 24 hours. Drain, and place in a pot with the remaining teaspoon of salt. Cover with water by three inches. Bring to a boil, then lower heat and cook at the gentlest simmer for about an hour or until the chickpeas are cooked through. Let chickpeas cool in their cooking liquid. Store chickpeas in their cooking liquid.",
    "Set a large, wide skillet over high heat. Add the oil. When it shimmers, add the onions, stir to distribute evenly, season with a pinch of salt, cover the pan, and turn heat to low. Cook, covered, for 15 minutes. Uncover, letting the water from the lid drip down into the pan. Add the garlic, chili powder, and cumin, and cook for 1 minute, stirring until the onions are coated in the spices.",
    "Add the crushed tomatoes, 1 cup water, vinegar, sugar, and 4 cups of the cooked chickpeas (not the liquid). Adjust heat so the mixture simmers. Season with a pinch of salt. Simmer for 15 to 20 minutes (the longer the better) stirring occasionally to ensure chickpeas are not sticking to bottom of pan. Taste. Squeeze half a lime over top if desired along with more salt to taste—chickpeas can handle/need salt, so don't be afraid here.",
    "To serve: Spoon chickpeas into bowls. Top with grated cheese, sour cream, quick-pickled onions, lettuce, and lime wedges."
  ],
  "ingredients": [
    "0",
    "1 pound dried chickpeas, see notes above for canned",
    "3 tablespoons plus 1 teaspoon kosher salt",
    "1",
    "2 tablespoons oil, grapeseed or olive",
    "2 cups diced onions",
    "Kosher salt, to taste",
    "2 cloves garlic, minced",
    "2 tablespoons chili powder",
    "2 teaspoons cumin",
    "1 cup crushed tomatoes, see notes above",
    "1 tablespoon cider (or other) vinegar",
    "1 teaspoon sugar",
    "juice of half a lime, plus more for serving",
    "For serving: grated cheese, sour cream, finely shredded romaine lettuce, quick-pickled onions (see notes above)"
  ],
  "__v": 1
}