{
  "hash": "47d5edb5c303bb2ed60d3960072914654a8e91ec",
  "title": "Creamy Roasted Red Pepper Zucchini Noodles",
  "image": "http://gi365.info/food/wp-content/uploads/sites/5/2014/12/Creamy-Roasted-Pepper-Zucchini-Noodles-GI-365-2.jpg",
  "href": "http://gi365.info/food/creamy-roasted-red-pepper-zucchini-noodles/",
  "firstAdded": "2015-01-02T04:28:12.315000",
  "users": [
    null
  ],
  "keywords": [
    "roasted",
    "red",
    "peppers",
    "weighing",
    "extra",
    "virgin",
    "olive",
    "oil",
    "soft",
    "goat",
    "cheese",
    "usually",
    "labeled",
    "chevre",
    "salt",
    "onion",
    "garlic",
    "zucchini",
    "ends",
    "spiralized",
    "noodles",
    "parsley",
    "parmesan",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "You can use jarred bell peppers or make your own for this recipe, the instructions for roasting your own peppers are in the post.",
    "Add the 2 roasted bell peppers to the blender with the rest of the sauce ingredients, and blend until smooth.",
    "For the zucchini noodles, heat a large 15\" deep sided skillet over medium high heat. When the skillet is hot, add the olive oil, onion, and garlic - sauté for a minute or two until the onion is softened but not browned. Add the sea salt and zucchini noodles to the skillet and sauté using a pair of non-stick tongs to toss the noodles. Just as the zucchini noodles begin to soften, but before they start shedding water, add the sauce and cook just until the sauce is heated.",
    "Adjust the salt to your taste, and serve immediately with the freshly chopped parsley, grated parmesan, extra goat cheese, and freshly ground black pepper."
  ],
  "ingredients": [
    "0",
    "2 roasted red peppers, weighing 8 ounces",
    "1 Tablespoon extra virgin olive oil",
    "2 ounces of soft goat cheese, (usually labeled chevre)",
    "1 Teaspoon sea salt",
    "1",
    "¼ cup extra virgin olive oil",
    "½ cup minced onion",
    "2 cloves garlic, minced",
    "1 Teaspoon sea salt",
    "2 pounds zucchini, ends cut off and spiralized or cut into 'noodles'",
    "2",
    "chopped fresh parsley, freshly grated parmesan, extra goat cheese, and freshly ground black pepper"
  ],
  "__v": 1
}