{
  "hash": "1437d41d0e191e51ffbf806e0e4d1b723eda4118",
  "title": "Salted Tahini Caramel Millionaire Bars (vegan and paleo)",
  "image": "https://www.ambitiouskitchen.com/wp-content/uploads/2018/10/YoC-MillionaireBars-9.jpg",
  "href": "https://www.ambitiouskitchen.com/salted-tahini-caramel-millionaire-bars-vegan-paleo/",
  "extension": "Chrome",
  "firstAdded": "2019-05-05T11:36:54.713000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 degrees F. Line an 8x8 inch square pan with parchment paper. It’s important to use an 8x8 inch as a 9x9 inch pan may be too big.",
    "In a medium bowl add the almond flour, coconut oil, maple syrup, vanilla extract and salt. Mix together with a fork until it forms a nice thick crumb texture. Add to pan and use your fingers to evenly press down into the pan. Bake for 10 minutes. Allow crust to cool for 10 minutes before adding caramel.",
    "Next make the salted tahini caramel: Add the tahini, maple syrup, coconut oil, vanilla extract and sea salt to a medium pot and place over medium-low heat for approximately 2 minutes, stirring frequently. Pour over the slightly cooled crust. Place in fridge for at least 30 minutes-1 hour to harden the caramel. It shouldn't take longer than this, but if you are impatient, just place in freezer for 15-20 minutes, this should speed up the process.",
    "After 30 minutes, make the chocolate layer: Add Enjoy Life chocolate chips and coconut oil to a microwave safe bowl and microwave on high in 30 second increments, stirring in between until chocolate is completely melted. If you prefer, you can also melt the chocolate and coconut oil in small saucepan over low heat. Pour over the caramel layer and tilt pan side-to-side to evenly distribute the melted chocolate. Place in fridge for an hour until chocolate is completely hardened and bars are cooled.",
    "Remove bars from pan, sprinkle with fancy sea salt and cut into 16 squares. Enjoy! Bars should be kept covered in the fridge until ready to serve."
  ],
  "ingredients": [
    "0",
    "For the shortbread base:",
    "1 ½ cups packed fine blanched almond flour (I use Bob’s Red Mill)",
    "3 tablespoons melted coconut oil",
    "2 tablespoons pure maple syrup",
    "½ teaspoon vanilla extract",
    "¼ teaspoon salt",
    "For the salted tahini caramel:",
    "1/2 cup tahini",
    "1/3 cup pure maple syrup",
    "1/3 cup coconut oil",
    "1 teaspoon vanilla extract",
    "½ teaspoon sea salt",
    "For the chocolate layer:",
    "3/4 cup Enjoy Life chocolate chips (can use mini or dark)",
    "1 tablespoon coconut oil",
    "Fancy sea salt, for sprinkling on top"
  ],
  "__v": 1
}