{
  "hash": "8addfe77ca6a6d66e45c8ead1d9425ecebefad27",
  "title": "Bread Pudding",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2014/03/bread-pudding-b-vertical.jpg",
  "href": "http://www.simplyrecipes.com/recipes/bread_pudding/",
  "extension": "",
  "firstAdded": "2015-06-20T08:55:20.083000",
  "users": [
    null
  ],
  "keywords": [
    "loaf",
    "french",
    "bread",
    "day",
    "old",
    "squares",
    "milk",
    "eggs",
    "sugar",
    "vanilla",
    "raisins",
    "soaked",
    "hour",
    "bourbon",
    "allspice",
    "cinnamon",
    "unsalted",
    "butter",
    "egg",
    "kentucky",
    "whiskey"
  ],
  "directions": [
    "0",
    "1 Preheat oven to 350°F. Place milk in a large mixing bowl and add the bread that has been cut into squares. Press the bread into the milk with your hands until all of the milk is absorbed.",
    "2 In a separate bowl, whisk the eggs, then whisk in the sugar, vanilla, allspice and cinnamon. Pour over the bread and milk mixture. Add the bourbon soaked raisins and gently stir to combine.",
    "3 Pour the melted butter into the bottom of a 9x13 inch baking pan. Coat the bottom and the sides of the pan well with the butter. Pour the bread milk and egg mixture into the baking pan. Bake at 350°F for 35-45 minutes, until the liquid has set. The pudding is done when the edges start getting a bit brown and pull away from the edge of the pan. Can also make in individual ramekins.",
    "4 While the bread pudding is cooking, make the bourbon sauce. Melt the butter in a medium saucepan on low heat. Add the sugar and egg and whisk to blend well. Slowly cook over low heat, stirring constantly, until the mixture thickens enough to coat the back of a spoon, then remove from heat. Do not allow the mixture to simmer! (Or the sauce will curdle. By the way, if your sauce curdles, just take it off the heat and blend it smooth in a blender.) Whisk in bourbon to taste. Whisk again before serving. The sauce should be soft, creamy, and smooth.",
    "Serve the bread pudding with bourbon whiskey sauce on the side; pour on to taste. Best fresh and eaten the day it is made."
  ],
  "ingredients": [
    "0",
    "1 loaf French bread, at least a day old, cut into 1-inch squares (about 6-7 cups)",
    "1 qt milk",
    "3 eggs",
    "2 cups sugar",
    "2 Tbsp vanilla extract",
    "1 cup raisins (soaked an hour or two in 1/4 cup bourbon)",
    "1/4 teaspoon allspice",
    "1/4 to 1/2 teaspoon cinnamon",
    "3 Tbsp unsalted butter, melted",
    "1/2 cup (1 stick) butter, melted",
    "1 cup sugar",
    "1 egg",
    "1 cup Kentucky bourbon whiskey"
  ],
  "__v": 1
}