{
  "hash": "edf166febcd3437a79d1100dc4f226aa2e62721d",
  "title": "Crawfish Bread",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/emeril-lagasse/crawfish-bread-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-12-18T21:03:40.605000",
  "users": [
    null
  ],
  "keywords": [
    "oil",
    "envelope",
    "dry",
    "yeast",
    "sugar",
    "water",
    "degrees",
    "unbleached",
    "allpurpose",
    "flour",
    "yellow",
    "cornmeal",
    "salt",
    "butter",
    "onions",
    "red",
    "bell",
    "peppers",
    "crawfish",
    "tails",
    "cheddar",
    "cheese",
    "white",
    "frying",
    "pepper",
    "creole",
    "seasoning"
  ],
  "directions": [
    "0",
    "Directions",
    "In the bowl of an electric mixer, place two tablespoons of the vegetable oil, yeast and sugar. The mixer should be fitted with a dough hook. Then add the water. With the mixer on low speed, beat the mixture for about 4 minutes to dissolve the yeast. *Note, if the yeast mixture doesn't begin to foam after a few minutes, it means it's not active and will have to be replaced.",
    "In a large mixing bowl, combine the flour, 1/2 cup plus the 2 tablespoons of the cornmeal, and the salt. Then add this mixture to the yeast mixture. On low speed begin to mix the dough. Increase the speed as the dough begins to pull away from the sides of the bowl and form a ball.",
    "Remove dough from bowl and lightly coat the entire surface with the remaining teaspoon of vegetable oil. Place dough in clean bowl (preferably glass). Cover the bowl with plastic wrap. Then set in a warm, dry place and let rise until doubled in size, about 2 hours.",
    "Meanwhile, in a saute pan melt the butter. Add onions and peppers. Season with salt, pepper and creole seasoning. saute for 2 minutes. Season crawfish with salt, pepper, and creole seasoning and then add crawfish to the saute pan. Saute for 2 minutes and then remove from pan, set aside to cool to room temperature.",
    "When the dough has doubled in size, remove from bowl and turn onto a lightly floured surface. Using your hands gently roll dough and form a narrow loaf about 24 inches long. Now cut dough into 18 equal pieces. With a rolling pin, roll each on a lightly floured surface to form thin round disks, about 1/8-inch thick.",
    "In a bowl combine the cooled crawfish mixture with both cheddar cheeses. Mix well.",
    "Spread about 2 tablespoons of the filling over half of the dough round. Fold the other half of the dough over the filling, forming a half-moon shape, and then pinch the edges tightly to seal completely.",
    "Now sprinkle two parchment lined baking sheets with remaining cornmeal. Place the completed breads on the baking sheet about 1-inch apart. Cover the breads with plastic wrap and let rise in a warm, dry place until doubled in size, about 30 minutes.",
    "In a one gallon sauce pot, heat enough vegetable oil to freely deep fry 2 or 3 half moons at a time (several inches deep). When the oil reaches 350 degrees F carefully add the stuffed breads. Fry for about 3 minutes, turning them with a metal spoon for even frying. Remove from the oil and drain on a paper-towel lined plate. Season while hot with creole seasoning.",
    "Recipe Courtesy of Emeril Lagasse"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 tablespoons, plus 1 teaspoon vegetable oil",
    "1 envelope (1/4-ounce) dry yeast",
    "2 tablespoons sugar",
    "2 cups warm water (about 110 degrees F)",
    "6 cups unbleached all-purpose flour",
    "3/4 cup yellow cornmeal",
    "2 teaspoons salt",
    "1 tablespoon butter",
    "1/2 cup minced onions",
    "1 tablespoon finely chopped red bell peppers",
    "1 tablespoon finely chopped yellow bell peppers",
    "1 pound crawfish tails",
    "1/4 pound grated cheddar cheese",
    "1/4 pound white grated cheddar cheese",
    "Vegetable Oil for frying",
    "Salt and pepper to taste",
    "Creole Seasoning"
  ],
  "__v": 1
}