{
  "hash": "c26b5ddfce587ea81f887473e39b5fd87d0231f8",
  "title": "One-Pan Salmon Asparagus",
  "image": "http://natashaskitchen.com/wp-content/uploads/2017/06/Salmon-and-Asparagus-6-600x900.jpg",
  "href": "http://natashaskitchen.com/2017/06/09/one-pan-salmon-asparagus-recipe-video/",
  "extension": "",
  "firstAdded": "2017-06-13T04:43:38.084000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prep:",
    "Preheat oven to 450˚F with oven rack in top third. Line large rimmed baking sheet with parchment paper, trimming the paper to just fit so it doesn't go over edges of pan (this prevents the paper from charring under broiler).",
    "How to Make One-Pan Salmon Asparagus:",
    "Place salmon filets in a row down the center of your lined baking pan. Arrange trimmed asparagus on the sides of the salmon. Drizzle asparagus lightly with olive oil and roll to coat. Sprinkle both asparagus and salmon with salt and pepper.",
    "In a medium bowl, use a fork to mash together all ingredients for flavored butter. It takes a couple of minutes to come together but keep mashing and it will happen. You can also use a food processor for the job if you prefer.",
    "Spoon ¾ of your flavored butter over the salmon and spread evenly (no need for perfection). Dab remaining butter mix over the asparagus. Top each salmon filet with a slice of lemon and bake uncovered at 450˚F for 10-12 minutes (a thinner fillet will take 10 minutes and larger fillet takes 12 minutes). Set the oven to BROIL and bake another 2-3 minutes to give the salmon a golden glow. Bake until salmon is flaky and cooked through.",
    "Notes",
    "**How to Speed-Soften Butter: Place wrapped stick of butter in airtight ziploc bag and submerge bag in warm (100˚F) water, placing a weight over the top so it doesn’t float. Let sit 10 -15 mins until softened."
  ],
  "ingredients": [
    "0",
    "Prep time: 5 mins",
    "Cook time: 15 mins",
    "Total time: 20 mins",
    "For the Salmon and Asparagus:",
    "2 lbs salmon filet, cut into six 6 oz portions",
    "2 lbs (2 bunches) asparagus, fibrous ends removed",
    "Salt and black pepper",
    "1 Tbsp olive oil",
    "1 small lemon, sliced into rings for garnish",
    "For the Lemon-Garlic-Herb Butter:",
    "½ cup (or 8 Tbsp) unsalted butter, softened (*see quick softening note)",
    "2 Tbsp fresh lemon juice (from 1 small lemon)",
    "2 garlic cloves, pressed or minced",
    "2 Tbsp fresh parsley, finely chopped",
    "1 tsp salt (we used sea salt)",
    "¼ tsp black pepper"
  ],
  "__v": 1
}