{
  "hash": "e90b22ae8959d64575f4f6b19f94c553841957c4",
  "title": "White Beans with Garlic and Sage",
  "image": "http://www.alexandracooks.com/wp-content/uploads/2016/01/beansonbread.jpg",
  "href": "http://www.alexandracooks.com/2016/01/15/brined-not-soaked-white-beans-with-garlic/",
  "extension": "Chrome",
  "firstAdded": "2017-08-06T04:15:57.828000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Soaking and cooking the beans:Dissolve the 3 tablespoons of salt into the water. Add the beans and soak for 8 to 24 hours. Drain, rinse and place in a pot with the onion, thyme, garlic, bay leaf and remaining teaspoon of salt. Cover with water by three inches. Bring to a boil, then lower heat and cook at the gentlest simmer for about 45 minutes or until the beans are cooked through. Let beans cool in their cooking liquid. Discard thyme sprigs, bay leaf, and onion. Store beans in their cooking liquid.",
    "Making the stewed beans: Place the oil and chopped garlic (and sage bundle if using) in a soup pot and turn the heat to medium. Cook the garlic, stirring it until it becomes colored a very pale gold.",
    "Add the beans, a pinch of salt (I added about ½ teaspoon kosher salt, but you may want less), and a few grindings of pepper. Turn the heat to low, cover and simmer gently for 5 to 6 minutes.",
    "Uncover, add the cup of water or stock and simmer for another 6 to 8 minutes or until some of the beans have broken down and turned the broth creamy. Taste, and correct for salt and pepper. Turn off the heat. Note: If the bean liquid thickens up too much, add water or stock as needed to thin it out. If you make this ahead and plan on reheating, you most likely will need to thin with water or stock. Taste again, and correct seasoning as needed.",
    "Place toasted bread into soup bowls. Ladle beans over top. Shave cheese over top."
  ],
  "ingredients": [
    "0",
    "soaking and cooking the beans:",
    "3 tablespoons + 1 teaspoon salt",
    "4 qts water",
    "1 lb. dried white beans, such as cannellini or great northern",
    "1 onion, peeled and halved through the core",
    "a few sprigs thyme",
    "1 clove garlic, smashed",
    "1 bay leaf",
    "for the stewy beans:",
    "¼ cup olive oil",
    "3 cloves garlic, minced",
    "1 small bundle sage, optional",
    "3 cups cooked white beans, drained",
    "salt and pepper to taste",
    "1 cup water, chicken stock or vegetable stock, plus more as needed",
    "bread for serving",
    "grated Parmigiano Reggiano for serving"
  ],
  "__v": 1
}