{
  "hash": "7b986d92b74477f60f4d1096f0eca6f8d0c9812b",
  "title": "BETTER-THAN-MOM'S CHICKEN, BROCCOLI, AND QUINOA CASSEROLE WITH CURRY SAUCE",
  "image": "https://k8643br9gv-flywheel.netdna-ssl.com/wp-content/uploads/2011/03/1-chicken-broccoli-quinoa-500x500-kalynskitchen-300x300.jpg",
  "href": "https://kalynskitchen.com/recipe-for-better-than-moms-chicken/",
  "extension": "Chrome",
  "firstAdded": "2019-09-09T15:55:44.628000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350F/180C.",
    "Rinse quinoa until no more foam appears.",
    "Combine quinoa with 1 cup water and bring to a boil. (Use the smallest pan you have that has a tight-fitting lid. I used a pan that was too big and I had to add a couple T more water to get the quinoa done.)",
    "Simmer until the water is absorbed, then cover the pan with the lid and let it sit for 5-6 minutes, fluffing with a fork when the quinoa is done.",
    "While quinoa cooks, start a medium sized pan of water boiling while you cut broccoli to make 3 cups same-sized flowerets.",
    "Add about 1/2 tsp. salt to the water, add broccoli, and cook 2-3 minutes, or until the broccoli turns bright green.",
    "Drain broccoli into a colander placed in the sink.",
    "Dice enough cooked chicken to make 2 cups diced, cooked chicken.",
    "Whisk together the low-fat sour cream, mayo, lemon juice, Dijon mustard, curry powder, Vege-Sal (or salt) and black pepper to make the sauce.",
    "Spray a 9″ x 9″ glass or crockery casserole with with non-stick spray or oil.",
    "Layer quinoa, broccoli, then chicken, spreading out each ingredient so it covers the surface or is distributed evenly.",
    "Use a rubber scraper to spread the sauce mixture over the top of the chicken. (I used the side of the rubber scraper to poke slits so the sauce could run down into the other ingredients a bit.)",
    "Sprinkle the Parmesan cheese over the top.",
    "Bake for 35-40 minutes, or until the casserole is bubbling and the top is starting to brown.",
    "Serve hot."
  ],
  "ingredients": [
    "0",
    "1/2 cup quinoa (rinsed unless the package says it does not need rinsing)",
    "1 cup water for cooking quinoa (or a little more, see recipe)",
    "3 cups broccoli flowerets, cut into same-sized pieces",
    "1/2 tsp. salt (for cooking broccoli)",
    "2 cups diced cooked chicken (I used leftover rotisserie chicken)",
    "1 1/4 cup sour cream",
    "1/3 cup mayo",
    "2 T fresh-squeezed lemon juice",
    "1 tsp. Dijon mustard",
    "1 tsp. curry powder",
    "salt and fresh ground pepper to taste to season the sauce",
    "1/3 cup coarsely grated Parmesan cheese."
  ],
  "__v": 1
}