{
  "hash": "a2a091b719b5b32d188bd45fd7fe843754f9532e",
  "title": "Swedish Meatballs",
  "image": "//www.artandthekitchen.com/wp-content/uploads/2014/11/swedish-2Bmeatballs-2BIMG_1865.jpg",
  "href": "https://www.artandthekitchen.com/swedish-meatballs/",
  "extension": "Chrome",
  "firstAdded": "2019-07-31T02:54:23.947000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In small bowl combine panko bread crumbs and milk. Let sit for 10 minutes until bread crumbs have soaked up milk.",
    "In large skillet heat 1 tbsp. olive oil with 1 tbsp. butter, medium heat.",
    "Add onions and sauté until translucent, about 5 minutes, add garlic and oregano and sauté for another 1-2 minutes.",
    "In large bowl, combine ground beef sautéed onion, garlic and oregano.",
    "Mix in salt, pepper and egg, combine until egg is mixed in.",
    "Add bread crumbs to meat mixture and combine well.",
    "Use a tablespoon or scoop to make equal sized meatballs. Recipe makes approximately 20.",
    "Reheat skillet used to sauté onions and garlic, adding a bit more olive oil and butter if needed.",
    "On medium heat, brown meat balls on all sides, carefully turning so they don't break apart.",
    "Don't overcrowd skillet with meatballs, work in batches.",
    "Transfer meatballs to baking sheet and keep warm in oven while making sauce.",
    "Add 4 tbsp. butter to skillet, when melted whisk in flour, cook until golden brown.",
    "Slowly stir in heated beef broth, cook at temperature that keeps sauce at slow bubble.",
    "Add in cream, Worcestershire sauce and Dijon mustard, simmer until sauce thickens at bit.",
    "Add meatballs into sauce, cover and simmer on low heat for about 10 minutes. Season to taste.",
    "Serve with egg or broad noodles or mashed potatoes."
  ],
  "ingredients": [
    "0",
    "1 lb ground beef",
    "1/4 cup panko bread crumbs",
    "1/4 cup milk",
    "1/2 cup chopped onion",
    "1 clove garlic minced",
    "1 tbsp fresh oregano chopped or 1 tsp. dry oregano",
    "1 egg",
    "1 tbsp olive oil",
    "5 tbsp butter",
    "3 tbsp flour",
    "2 cups beef broth warmed up",
    "1 cup heavy cream",
    "1/2 tbsp Worcestershire sauce",
    "1 tsp Dijon mustard",
    "1/2 tsp kosher salt",
    "1/2 tsp pepper"
  ],
  "__v": 1
}