{
  "hash": "47797443c5cea76d24cb763b6e525fe599960957",
  "title": "Gooey Brown Butter Blondies with Pecans",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/gooey-brown-butter-blondies-with-pecans",
  "firstAdded": "2015-01-23T21:23:32.312000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "butter",
    "egg",
    "light",
    "brown",
    "sugar",
    "vanilla",
    "kosher",
    "salt",
    "allpurpose",
    "flour",
    "room",
    "pecans",
    "coarsely",
    "baking",
    "eggs",
    "ice",
    "cream"
  ],
  "directions": [
    "0",
    "Cook butter in a medium saucepan over medium heat, stirring often, until butter foams, then browns, 5–8 minutes. Transfer brown butter to a medium bowl; let cool slightly. Add egg, brown sugar, vanilla, and salt and beat until mixture is light and falls back onto itself in a slowly dissolving ribbon, about 3 minutes. Fold in flour.",
    "1",
    "Preheat oven to 350°. Butter a 13x9” baking dish and dust with flour. Toast pecans on a rimmed baking sheet, tossing once, until slightly darkened and fragrant, 8–10 minutes. Let cool.",
    "Whisk baking powder, salt, and 2¼ cups flour in a medium bowl. Using an electric mixer on medium-high speed, beat brown sugar and 1 cup butter in a large bowl until light and fluffy, about 5 minutes. Add eggs one at a time, beating between additions; mix until pale and fluffy, about 2 minutes. Mix in vanilla.",
    "Reduce speed to low and mix in dry ingredients. Fold in half of pecans. Scrape two-thirds of batter into prepared baking dish; smooth top, pushing batter to edges. Alternating, dollop brown butter mixture and remaining batter on top. Smooth and sprinkle remaining pecans over.",
    "Bake until blondie is golden brown and firm (a tester will not come out clean), 30–35 minutes. Let cool before slicing. Serve with ice cream.",
    "Do Ahead: Blondies can be made 1 day ahead. Store tightly wrapped at room temperature."
  ],
  "ingredients": [
    "0",
    "½ cup (1 stick) unsalted butter",
    "1 large egg",
    "¾ cup (packed) light brown sugar",
    "1 teaspoon vanilla extract",
    "½ teaspoon kosher salt",
    "⅓ cup all-purpose flour",
    "1",
    "1 cup (2 sticks) unsalted butter, room temperature, plus more",
    "2¼ cups all-purpose flour, plus more",
    "1½ cups pecans, coarsely chopped",
    "1½ teaspoons baking powder",
    "1½ teaspoons kosher salt",
    "1¾ cups (packed) light brown sugar",
    "2 large eggs",
    "1 teaspoon vanilla extract",
    "Vanilla ice cream (for serving)"
  ],
  "__v": 1
}