{
  "__v": 1,
  "directions": [
    "0",
    "Mescola la farina 00 e la farina di semola su una superficie di lavoro, meglio in legno, e forma una fontana con un buco ampio e profondo nel mezzo. Lì rompi le uova, aggiungi l’olio, il sale e il pepe appena macinato.",
    "Comincia pian piano con una forchetta ad amalgamare uova e farina. Quando la consistenza è briciolosa, impasta con le mani aggiungendo se necessario qualche cucchiaio di acqua fredda.",
    "Continua ad impastare per almeno 10 minuti, più si impasta e più si formerà glutine, dando resistenza alle sfoglie di pasta.",
    "Quando la palla di pasta sarà liscia, vellutata e non più appiccicosa, avvolgila nella pellicola trasparente e lasciala riposare per 30 minuti a temperatura ambiente.",
    "Dopo i 30 minuti di riposo, tira la sfoglia. Qualunque sia il modo che preferisci usare – con la macchina a mano, elettrica o il mattarello -, tira una sfoglia il più possibile sottile, larga e regolare.",
    "Lasciala asciugare sulla spianatoia spolverata di farina di semola per circa 20 minuti, poi tagliala sottile sottile per fare i tagliolini e disponili ben distanziati sulla spianatoia in modo che si asciughino.",
    "In una padella sciogli il burro con il succo e la buccia grattata di un limone.",
    "Cuoci i tagliolini in acqua bollente salata per circa 1 minuto, scolali molto al dente e versali in padella con un cucchiaio di acqua di cottura della pasta.",
    "Aggiungi il parmigiano grattato, il pepe appena macinato e un po' di timo fresco. Manteca la pasta per un minuto, dando il tempo al parmigiano di sciogliersi con l'acqua di cottura della pasta e formare una crema che rivestirà la pasta.",
    "Togli dal fuoco e servi subito."
  ],
  "firstAdded": "2014-10-10T11:45:17.462000",
  "hash": "843a3aaed4c30e9a5090b7443562fab8417d9c9e",
  "href": "http://it.julskitchen.com/primi-piatti/pasta-fresca/tagliolini-al-limone",
  "image": "http://farm8.staticflickr.com/7085/7079852533_4375039f4f_b.jpg",
  "ingredients": [
    "0",
    "100 g di farina 00",
    "100 g di farina di semola",
    "1 cucchiaino di olio",
    "1 pizzico di sale",
    "½ cucchiaino di pepe nero macinato al momento",
    "2 uova",
    "1",
    "50 g di burro",
    "succo e buccia di 1 limone non trattato",
    "3 cucchiai di Parmigiano grattato",
    "pepe nero macinato sul momento",
    "timo"
  ],
  "keywords": [
    "farina",
    "semola",
    "cucchiaino",
    "olio",
    "pizzico",
    "sale",
    "pepe",
    "nero",
    "macinato",
    "momento",
    "uova",
    "burro",
    "succo",
    "buccia",
    "limone",
    "non",
    "trattato",
    "cucchiai",
    "parmigiano",
    "grattato",
    "sul",
    "timo"
  ],
  "title": "Tagliolini al limone",
  "users": [
    null
  ]
}