{
  "hash": "3cfd503fbc53f241542d90d15915bb23b866277a",
  "title": "Grilled Tri-Tip Steak Fajitas",
  "image": "http://www.chilipeppermadness.com/images/recipes/beef-steak-recipes/Grilled-Tri-Tip-Steak-Fajitas3.jpg",
  "href": "http://www.chilipeppermadness.com/chili-pepper-recipes/beef/grilled-tri-tip-steak-fajitas",
  "extension": "Chrome",
  "firstAdded": "2016-10-02T14:10:17.955000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cooking Directions",
    "Heat the grill to medium-high heat.",
    "Rub the tri-tip steak down with the fajita seasonings. Sear it on each side on the grill, about 5 minutes per side.",
    "Close the lid and adjust the heat to 350 degrees. Cook the tri-tip steak about 15 minutes, then flip and grill an additional 15-20 minutes, or until the internal temp reads 135 for medium-rare.",
    "Remove from heat and allow to rest 10 minutes.",
    "While steak is resting, set a cast iron pan onto the grill and heat. Add olive oil.",
    "Add peppers and onions and sear them up until softened yet still slightly crisp.",
    "Remove from heat.",
    "Slice the tri-tip steak against the grain and set into the hot pan. You can toss the steak with additional fajita seasonings if you’d like and give the slices some extra sear, as desired.",
    "Serve with warmed tortillas tomatoes and your fixings.",
    "ASSEMBLY: Stack a tortilla with a few strips of tri-tip steak, then with peppers and onions, then top with sauce, guacamole, and whatever else you’d like. Enjoy!",
    "Serves 8"
  ],
  "ingredients": [
    "0",
    "1 2-pound Tri-Tip steak",
    "½ cup Fajita Seasoning – Use our Homemade Fajita Seasoning Recipe Mix",
    "2-3 tablespoons olive oil",
    "4-6 red and green peppers, sliced – Bells are traditional, but I used an equivalent mixture of jalapenos and spicy red peppers",
    "1 large onion, sliced",
    "Fresh sliced tomatoes for serving",
    "16 flour tortillas, warmed",
    "Guacamole for serving",
    "Picante sauce for serving - Try this Picante Sauce Recipe",
    "Other toppings as desired, such as shredded cheese, sour cream, hot sa"
  ],
  "__v": 2
}