{
  "hash": "937c847e1a66c50120e0bf7d36ff74753c5c1a94",
  "title": "YOU ARE HERE:Home » Recipes » Chinese Recipes » General Tso’s Chicken\nGeneral Tso’s Chicken APRIL 16, 2016 101 Comments General Tso’s Chicken\nGeneral Tso’s chicken – BEST and easiest General Tso’s Chicken ever. SO delicious and much better and healthier than Chinese takeout! General Tso’s Chicken originated from Hunan, China, but from what I read, the connection of the dish to the brave Chinese general General Tso is largely a US or western reference. In any case, the authentic recipe of General Tso’s chicken always calls for some dried red chilies—an important ingredient in Hunan cooking. Chinese rice vinegar also plays a vital role in lending the bold vinegary note to the dish. Try my General Tso’s Chicken recipe and you will never need another takeout again! General Tso’s Chicken",
  "image": "http://rasamalaysia.com/wp-content/uploads/2014/08/general-tsos-chicken.jpg",
  "href": "http://rasamalaysia.com/general-tsos-chicken/2/",
  "extension": "Chrome",
  "firstAdded": "2017-10-03T01:01:13.246000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Marinate the chicken meat with the Shaoxing wine and salt for 15 minutes. Mix all the ingredients for the Sauce in a small bowl. Set aside.",
    "Coat the chicken generously with the 1/3 cup cornstarch. Heat up the oil for deep-frying. Deep fry the chicken until they turn light brown. Dish out with a strainer, draining the excess oil by laying the chicken on a dish lined with paper towels.",
    "Heat up a wok with 1 1/2 tablespoons oil. Add the minced ginger, garlic, and dried chilies into the wok, stir-fry until you smell the spicy aroma of the chilies. Pour the sauce into the wok. When the sauce boils and thickens, add the chicken, stir to combine well with the sauce. Add the scallion and stir a few times, dish out and serve immediately."
  ],
  "ingredients": [
    "0",
    "10 oz boneless skinless chicken meat (thigh or breast), cut into bite-sized pieces",
    "1/2 tablespoon Shaoxing wine",
    "Pinch of salt",
    "1/3 cup cornstarch",
    "Oil for deep frying",
    "1 1/2 tablespoons oil",
    "3 slices peeled ginger, finely minced",
    "1 clove garlic, finely minced",
    "4-5 dried red chiles, rinsed and seeded",
    "2 stalks scallion, white-part only, cut into 1-inch lengths",
    "Sauce:",
    "2 1/2 – 3 tablespoons Chinese rice vinegar",
    "2 1/2 tablespoons soy sauce",
    "1/2 tablespoon dark soy sauce",
    "1 teaspoon Hoisin sauce",
    "1/4 cup water",
    "2 1/2 tablespoons sugar",
    "1/2 tablespoon Shaoxing Wine",
    "1 scant tablespoon cornstarch"
  ],
  "__v": 1
}