{
  "hash": "3ffb913a996ec53efadf9f094c5a19584eba93b3",
  "title": "Southwestern Sweet Potato Noodles",
  "image": "//food.fnr.sndimg.com/content/dam/images/food/fullset/2017/2/28/1/FNM040117_Southwestern-Sweet-Potato-Noodles_s4x3.jpg.rend.hgtvcom.826.620.suffix/1488316434780.jpeg",
  "href": "https://www.foodnetwork.com/recipes/food-network-kitchen/southwestern-sweet-potato-noodles-3642097",
  "extension": "",
  "firstAdded": "2018-12-27T03:11:53.660000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the broiler. Cut the potatoes into long noodles using a spiralizer (or use 1 pound store-bought sweet potato noodles). 2. Spread on a rimmed baking sheet, drizzle with 2 tablespoons vegetable oil and sprinkle with 1/2 teaspoon salt and a few grinds of pepper.",
    "Broil until browned in spots and slightly softened, 3 to 5 minutes.",
    "Heat the remaining 2 tablespoons vegetable oil in a large nonstick skillet over medium-high heat.",
    "Add the red onion, bell pepper and serrano; cook, stirring, until just softened, about 3 minutes.",
    "Add the corn, garlic, cumin, chili powder, coriander, 1/2 teaspoon salt and a few grinds of pepper.",
    "Cook, stirring occasionally, until the vegetables are tender, 3 to 5 more minutes.",
    "Add the broiled sweet potato noodles and 1/4 cup water to the skillet with the vegetables.",
    "Cook, gently tossing, until the noodles are coated and tender, 1 to 2 minutes.",
    "Remove from the heat and stir in the cilantro and lime juice; season with salt and pepper. Serve with lime wedges."
  ],
  "ingredients": [
    "0",
    "3 small sweet potatoes (1 1/4 pounds), peeled",
    "1/4 cup vegetable oil",
    "Kosher salt and freshly ground pepper",
    "1 small red onion, halved and thinly sliced",
    "1 red bell pepper, cut into thin strips",
    "1/2 to 1 small serrano chile pepper, thinly sliced into rounds",
    "1/2 cup frozen fire-roasted corn",
    "3 cloves garlic, finely chopped",
    "3/4 teaspoon ground cumin",
    "3/4 teaspoon chili powder",
    "1/2 teaspoon ground coriander",
    "1/2 cup fresh cilantro, roughly chopped",
    "Juice of 1/2 lime, plus wedges for serving"
  ],
  "__v": 2
}