{
  "hash": "0b1c545086b5cae9736e490f00fff669e2461f8b",
  "title": "egetarian Bouillabaisse",
  "image": "http://i1.wp.com/www.greenkitchenstories.com/wp-content/uploads/2016/01/gks_bouillabaisse_05.jpg?resize=800%2C1200",
  "href": "http://www.greenkitchenstories.com/vegetarian-bouillabaisse/",
  "extension": "Chrome",
  "firstAdded": "2017-01-10T04:50:45.684000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place a large sauce pan on medium heat. Melt butter or coconut oil and then add fennel seeds and anise seeds, onions and garlic. Sauté for a couple of minutes or until the onions have softened. Add carrots, parsnips and the chopped fennel and after a couple of minutes the white wine. Let simmer for five minutes and then add potatoes, tomatoes, vegetable stock, saffron, nori and thyme. Give it a good stir and then leave to simmer for 45 minutes.",
    "Meanwhile, set the oven to 435°F/225°C. Slice the remaining fennel in thick pieces lengthwise, drizzle with oil and salt and place on a baking sheet. Bake for 20 minutes or until soft and slightly burnt at the edges.",
    "When the cooked vegetables are soft and the stew tastes flavourful, add beans and let simmer for a few more minutes before serving.",
    "Making Aioli:",
    "Making Aioli: Whisk egg yolks* and lemon juice (or vinegar) in metal bowl to blend well. Whisking constantly (by hand with a balloon whisk) while drizzling in the oil very slowly, 1 teaspoonful at a time, until sauce is thickened. Stir in finely chopped garlic and season the aioli with lemon juice, salt and pepper.",
    "Serve the soup in wide bowls, top with roasted fennel, dill, a dollop of aioli, orange zest and a piece of sourdough bread.",
    "*Raw egg is not recommended for infants, elderly, pregnant women or"
  ],
  "ingredients": [
    "0",
    "2 tbsp butter, coconut oil or olive oil",
    "2 tsp fennel seeds",
    "1 tsp anise seeds",
    "2 yellow onions, peeled, one finely chopped and the other coarsely",
    "4 cloves garlic, peeled and finely chopped",
    "3 large carrots, peeled and sliced in thick coins",
    "2 parsnips, peeled and sliced in thick coins",
    "1 fennel bulb, coarsely chopped",
    "250 ml / 1 cup dry white wine",
    "2 potatoes, peeled and cut in quarters",
    "2 x 400 g / 14 oz tins whole tomatoes (or crushed)",
    "2 cups vegetable stock",
    "1 g saffron powder",
    "1 sheet nori, crushed or finely chopped (optional)",
    "1 tbsp fresh thyme",
    "1 cup large white beans",
    "To serve",
    "1 fennel bulb",
    "fresh thyme and dill",
    "zest from 1/2 orange (optional)",
    "4 pieces of sourdough bread",
    "Aioli",
    "2 egg yolks*",
    "1 tbsp lemon juice or vinegar (+ more for seasoning)",
    "125 ml / 1/2 cup cold-pressed olive oil (choose a quality oil, stored in glass bottles)",
    "125 ml / 1/2 cup cold pressed rapeseed oil (choose a quality oil, stored in glass bottles)",
    "2 cloves garlic, finely chopped or grated",
    "sea salt and pepper, to taste"
  ],
  "__v": 1
}