{
  "hash": "a7f01a92728017ac2a8db865eca22e65ba959daa",
  "title": "Low Carb Cheese Crackers",
  "image": "",
  "href": "https://www.isavea2z.com/low-carb-cheese-crackers-recipe-keto-friendly/",
  "extension": "Chrome",
  "firstAdded": "2018-04-15T16:38:56.822000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Mix all the cheeses (including the cream cheese) along with the almond flour in a microwave safe bowl and cook it for exactly one minute. (UPDATE: There some people that prefer not to use a microwave and I certainly understand that. You can heat these ingredients up on the stove top too. You are going to heat them up just enough for the cheese to my melted enough for you to roll out the dough. I would continue stirring it while heating it up on the stove top.)",
    "Immediately stir the ingredients until the almond flour and cheeses have combined fully. You want the cheese to be partially melted (see photo)",
    "Allow this to cool for a few minutes because if you put the egg in these ingredients too soon it will cook the egg.",
    "Now add the egg, sea salt, and seasoning of your choice. I decided to cut up some fresh rosemary I had on hand. You want to add about a teaspoon of your favorite seasoning unless it’s a spicy mix. I would add only about a 1/2 teaspoon for spicy seasonings.",
    "Mix it together until all the ingredients are fully combined. If you cheese has gotten too hard or it’s too hard to mix, you can microwave your cheese for another 20 seconds to get it soft again.",
    "Now you will place the ball of dough on a large sheet of parchment paper. Then place another sheet of parchment paper of equal size on top of the ball of dough.",
    "You can use your hands or a rolling pin to spread the dough out into a thin layer. It spread so easily that I used my hands to have more control and keep the dough inside the square piece of parchment paper. Make sure the parchment paper is the same size as your baking sheet.",
    "Next, use a pizza cutter to cut the crackers into small squares as seen in the photos.",
    "Bake these crackers on each side at 450 degrees for about 5 or 6 minutes on each side. If the crackers are thin, you will cook them about 5 minutes on each side but if the dough is thick, it may take 7 to 9 minutes to get the crispy cracker texture you are looking for. When you keep the dough on the parchment paper it’s really easy to flip it over while it’s hot after cooking it on the first side. I ended up using the pizza cutter again to define the lines on the flip side too. Feel free to leave the crackers in the oven longer (but watch them closely) if you love a very crispy texture. The crispier the better for me!",
    "Allow the crackers to cool for about 5 minutes and they are ready to eat!"
  ],
  "ingredients": [
    "0",
    "2 Cups Cheese of your choice (I used a Parmesan-Romano mix along with some swiss and cheddar)",
    "1 cup Almond Flour",
    "2 oz Cream Cheese",
    "1 egg",
    "1/2 teaspoon sea salt",
    "1 teaspoon Rosemary (or a seasoning of your choice such as basil, chives, garlic, dill weed, spicy chili, thyme, oregano etc…)"
  ],
  "__v": 1
}