{
  "hash": "d2507e40825046c6a03067ebdc55962dc04cedd5",
  "title": "The Best Gluten Free Pizza Crust + Sauce",
  "image": "http://minimalistbaker.com/wp-content/uploads/2013/06/The-Best-Gluten-Free-Pizza-Dough-square.jpg",
  "href": "https://minimalistbaker.com/the-best-gluten-free-pizza-crust-sauce/",
  "extension": "Chrome",
  "firstAdded": "2015-11-27T10:48:36.419000",
  "users": [
    null
  ],
  "keywords": [
    "gluten",
    "free",
    "blend",
    "white",
    "brown",
    "rice",
    "tapioca",
    "flour",
    "xanthan",
    "gum",
    "salt",
    "baking",
    "sugar",
    "divided",
    "yeast",
    "water",
    "olive",
    "oil"
  ],
  "directions": [
    "0",
    "Preheat oven to 350 degrees.",
    "In a small bowl, combine yeast and 3/4 cup warm water - about 110 degrees. Too hot and it will kill the yeast! Let set for 5 minutes to activate. Sprinkle in 1 Tbsp of the sugar a few minutes in.",
    "In a separate bowl, combine gluten free flour blend, salt, baking powder and remaining 2 Tbsp sugar. Whisk until well combined.",
    "Make a well in the dry mixture and add the yeast mixture. Add the olive oil and additional 1/2 cup warm water before stirring. Then stir it all together until well combined, using a wooden spoon (see photo).",
    "Lightly coat a baking sheet or pizza stone with non-stick spray and plop your dough down. Using your hands and a little brown rice flour if it gets too sticky, work from the middle and push to spread/flatten the dough out to the edge (see pictures). You want it to be pretty thin - less than 1/4 inch.",
    "Put the pizza in the oven to pre-bake for roughly 25-30 minutes, or until it begins to look dry. Cracks may appear, but that's normal and totally OK.",
    "Remove from oven and spread generously with your favorite pizza sauce, cheese and desired toppings. We went with Daiya to keep ours dairy-free. Pop back in oven for another 20-25 minutes, or until the crust edge looks golden brown and the toppings are warm and bubbly.",
    "Cut immediately and serve. Reheats well the next day in the oven or microwave."
  ],
  "ingredients": [
    "0",
    "3 cups gluten free flour blend (1 cup white rice flour + 1 cup brown rice flour + 1 cup tapioca flour + 3/4 tsp xanthan gum)",
    "1 tsp salt",
    "1/2 tsp baking powder",
    "3 Tbsp sugar, divided",
    "1 Tbsp yeast",
    "1 1/4 cup warm water, divided",
    "1 Tbsp olive oil"
  ],
  "__v": 1
}