{
  "hash": "36616c6717eab91ee74c34438d91d0082337dc18",
  "title": "Snickerdoodle Cheesecake",
  "image": "http://del.h-cdn.co/assets/17/34/640x958/gallery-1503351757-delish-snickerdoodle-cheesecake-pinterest-still003.jpg",
  "href": "http://www.delish.com/cooking/recipe-ideas/recipes/a54880/snickerdoodle-cheesecake-recipe/?zoomable",
  "extension": "Chrome",
  "firstAdded": "2017-08-22T12:03:24.169000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "Preheat oven to 350°. Grease an 8” springform pan with cooking spray.",
    "In a large bowl, combine cookie dough and cinnamon sugar and stir until evenly incorporated. Press about half of the dough into the bottom of the springform pan. (Reserve extra dough to bake as cookies.)",
    "In another large bowl, beat the cream cheese until smooth. Add sugar and sour cream and beat until light and fluffy. Add eggs one at a time, beating well between each addition. Stir in vanilla, cinnamon and salt. Pour batter over the cookie dough crust.",
    "Bake until slightly jiggly in the center, about 1 hour. Turn off the oven and open the door slightly to let the cheesecake cool for about 1 hour. Then refrigerate until completely cool, at least 4 hours and up to overnight.",
    "Roll remaining dough into small balls (about a tablespoon) then flatten slightly. Place on baking sheet and bake until starting to turn golden around the edges, about 10 minutes. Transfer to a cooling rack to cool completely.",
    "Before serving, sprinkle the top of the cheesecake with more cinnamon sugar. Using a large star tip, pipe frosting around the edges of the cheesecake then garnish snickerdoodle cookies."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1 log refrigerated sugar cookie dough",
    "3 tbsp. cinnamon sugar, plus more for garnish",
    "3 8-oz. blocks cream cheese, softened",
    "1 c. granulated sugar",
    "1/4 c. sour cream",
    "3 eggs",
    "2 tsp. pure vanilla extract",
    "1/4 tsp. ground cinnamon",
    "Pinch kosher salt",
    "vanilla frosting"
  ],
  "__v": 1
}