{
  "hash": "14027d9a73b473bd5f9862c1eb286cd7ec3a7e25",
  "title": "PIŠČANČJI FILEJI V PARADIŽNIKOVI OMAKI",
  "image": "http://images.24ur.com/media/images/640x338/Sep2012/61035332.jpg?96e4",
  "href": "http://okusno.je/recept/piscancji-fileji-v-paradiznikovi-omaki",
  "firstAdded": "2014-11-21T10:44:38.537000",
  "users": [
    null
  ],
  "keywords": [
    "sestavine",
    "osebe",
    "pianjih",
    "prsi",
    "brez",
    "kosti",
    "koe",
    "ebula",
    "stroke",
    "esna",
    "rdea",
    "paprika",
    "koke",
    "zrezanega",
    "paradinika",
    "poloevinke",
    "rdeega",
    "vina",
    "vloenih",
    "rnih",
    "oliv",
    "romarina",
    "lice",
    "olivnega",
    "olja",
    "soli",
    "epca",
    "svee",
    "mletega",
    "rnega",
    "popra"
  ],
  "directions": [
    "0",
    "1",
    "Piščančje prsi operemo in temeljito osušimo s papirnatimi brisačkami. Prerežemo jih na dva dela. Nato vsak del prerežemo tako, da dobimo dva debelejša fileja. Vse fileje začinimo s poprom in soljo.",
    "2",
    "Česen in čebulo olupimo ter zrežemo na manjše koščke. Papriko operemo in prerežemo na pol. Odstranimo pecelj in semena, nato pa jo zrežemo na koščke.",
    "3",
    "V ponvi segrejemo olje in na njem na hitro prepražimo čebulo. Ko čebula postekleni, dodamo česen. Ko česen zadiši, dodamo koščke paprike. Vse skupaj med mešanjem pražimo še kakšno minuto. Nato vmešamo paradižnike (skupaj s sokom) in vse skupaj zalijemo z vinom. Omako na zmernem ognju kuhamo približno 10 minut, da se zgosti. Med kuhanjem omako občasno premešamo.",
    "4",
    "Na kuhalnik pristavimo novo ponev, v kateri segrejemo olje. Na segreto olje položimo piščančje fileje in jih na vsaki strani pečemo približno 5 minut.",
    "5",
    "V omako vmešamo olive in rožmarin. Po okusu jo začinimo s poprom in soljo. Ko so piščančji fileji pečeni, jih dodamo v ponev z omako. Počakamo, da jed še enkrat zavre.",
    "6",
    "Piščančje fileje skupaj s paradižnikovo omako serviramo na krožnike in postrežemo."
  ],
  "ingredients": [
    "0",
    "Sestavine za 4 osebe",
    "500 g piščančjih prsi brez kosti in kože",
    "1 čebula",
    "3 stroke česna",
    "1 rdeča paprika",
    "400 g na koščke zrezanega paradižnika (iz poločevinke)",
    "150 ml rdečega vina",
    "50 g vloženih črnih oliv",
    "0,5 žličke rožmarina",
    "3 žlice olivnega olja",
    "0,5 žličke soli",
    "2 ščepca sveže mletega črnega popra"
  ],
  "__v": 1
}