{
  "hash": "90d6418a95a21e1e37b3f4793d4f08f0f8dd9eca",
  "title": "Pimento Cheese",
  "image": "http://gardenandgun.com/files/Sean-Brock-Heritage-Pimento-Cheese-recipe.jpg",
  "href": "http://gardenandgun.com/article/how-sean-brock-makes-pimento-cheese",
  "extension": "Chrome",
  "firstAdded": "2015-12-05T23:47:52.733000",
  "users": [
    null
  ],
  "keywords": [
    "pimento",
    "peppers",
    "cream",
    "cheese",
    "room",
    "mayonnaise",
    "preferably",
    "dukes",
    "vinegarbased",
    "hot",
    "tabasco",
    "kosher",
    "salt",
    "sugar",
    "cayenne",
    "pepper",
    "white",
    "smoked",
    "paprika",
    "pickled",
    "ramps",
    "breadandbutter",
    "pickles",
    "brine",
    "sharp",
    "cheddar",
    "holes",
    "box",
    "grater"
  ],
  "directions": [
    "0",
    "Roast the peppers over an open flame on a gas stovetop, one pepper at a time, on the prongs of a carving fork. Or place on a baking sheet and roast under a hot broiler. In either case, turn the peppers to blister all sides. Then transfer the peppers to a bowl and cover the bowl with plastic wrap. Set aside to let the peppers steam until cool enough to handle.",
    "Carefully peel the blackened skin off each pepper. Cut the peppers lengthwise in half, open out flat on a cutting board, and carefully scrape away all the seeds and membrane. Dice the peppers.",
    "Put the cream cheese in a medium bowl and beat it with a wooden spoon until softened. Add the mayonnaise and mix well. Add the hot sauce, salt, sugar, cayenne pepper, white pepper, and smoked paprika and stir to blend. Add the pickles, brine, and cheddar cheese and stir again. Fold in the diced pimentos.",
    "Cover and refrigerate until ready to serve. Tightly covered, the pimento cheese will keep for up to 3 days in the refrigerator.",
    "Note",
    "For creamier pimento cheese, combine all of the ingredients in the bowl of a stand mixer fitted with the paddle attachment and beat on medium speed for 2 minutes."
  ],
  "ingredients": [
    "0",
    "3 large pimento peppers (about 12 oz.)",
    "4 oz. cream cheese, at room temperature",
    "½ cup mayonnaise, preferably Duke’s",
    "½ tsp. vinegar-based hot sauce, such as Tabasco",
    "½ tsp. kosher salt",
    "¼ tsp. sugar",
    "⅛ tsp. cayenne pepper",
    "⅛ tsp. freshly ground white pepper",
    "⅛ tsp. smoked paprika",
    "¼ cup pickled ramps, chopped, plus ½ cup of the brine (if you can't find ramps, you can substitute finely chopped bread-and-butter pickles and brine)",
    "1 lb. sharp cheddar cheese, grated on the large holes of a box grater"
  ],
  "__v": 1
}