{
  "hash": "124122d7c41a4d37a6c0f90246ddf87cb2ed0240",
  "title": "Easy Bagel",
  "image": "https://www.skinnytaste.com/wp-content/uploads/2018/01/Easy-Bagel-Recipe-1-170x255.jpg",
  "href": "https://www.skinnytaste.com/easy-bagel-recipe/",
  "extension": "",
  "firstAdded": "2018-01-17T07:06:26.837000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "Oven Method:",
    "Preheat oven to 350F. Place parchment paper or a silpat on a baking sheet. If using parchment paper, spray with oil to avoid sticking.",
    "In a medium bowl combine the flour, baking powder and salt and whisk well. Add the yogurt and mix with a fork or spatula until well combined, it will look like small crumbles.",
    "Lightly dust flour on a work surface and remove dough from the bowl, knead the dough a few times until dough is tacky, but not sticky, about 20 turns (it should not leave dough on your hand when you pull away).",
    "Divide into 4 equal balls. Roll each ball into 3/4-inch thick ropes and join the ends to form bagels.",
    "Top with egg wash and sprinkle both sides with seasoning of your choice. Bake for 22 minutes in 350F degree oven then increase to 550F degrees for 4 minutes (the oven will not reach 550F, and you don’t have to take the bagels out, I left them in). Let cool at least 10 minutes before cutting.",
    "Air Fryer Method:",
    "In a medium bowl combine the flour, baking powder and salt and whisk well. Add the yogurt and mix with a fork or spatula until well combined, it will look like small crumbles.",
    "Lightly dust flour on a work surface and remove dough from the bowl, knead the dough a few times until dough is tacky, but not sticky, about 20 turns (it should not leave dough on your hand when you pull away).",
    "Divide into 4 equal balls. Roll each ball into 3/4-inch thick ropes and join the ends to form bagels.",
    "Top with egg wash and sprinkle both sides with seasoning of your choice.",
    "Preheat the air fryer 325F degrees and set for 11 to 12 minutes. Transfer in batches without overcrowding and bake 11 to 12 minutes, or until golden. No need to turn. Let cool at least 10 minutes before cutting."
  ],
  "ingredients": [
    "0",
    "1 cup (5 oz) unbleached all purpose flour, whole wheat or gluten-free mix*",
    "1 1/2 teaspoons baking powder (make sure it’s not expired or it won’t rise)",
    "3/4 teaspoon kosher salt",
    "1 cup non-fat Greek yogurt (you can’t use regular yogurt, it will be too sticky)",
    "1 egg white, beaten (whole egg works fine too)",
    "(optional toppings: everything bagel seasoning, sesame seeds, poppy seeds, dried garlic flakes, dried onion flakes)**"
  ],
  "__v": 1
}