{
  "hash": "34e42b230637d1e0cb96cbc1f4441b59d5531768",
  "title": "Cauliflower pasta from across the pond",
  "image": "http://prodstatics3cdn1.purewow.com/images/articles/2012_03/ScilianPasta549x305.jpg",
  "href": "http://www.purewow.com/entry_detail/recipe/1735/Cauliflower-pasta-from-across-the-pond.htm",
  "extension": "Chrome",
  "firstAdded": "2015-03-30T18:48:18.778000",
  "users": [
    null
  ],
  "keywords": [
    "saffron",
    "threads",
    "medium",
    "head",
    "cauliflower",
    "trimmed",
    "florets",
    "extravirgin",
    "olive",
    "oil",
    "yellow",
    "onion",
    "garlic",
    "redpepper",
    "pine",
    "nuts",
    "golden",
    "raisins",
    "tomato",
    "bay",
    "leaf",
    "salt",
    "black",
    "pepper",
    "wholewheat",
    "mafalda",
    "corta",
    "similar",
    "short",
    "pasta",
    "fusilli",
    "gemelli",
    "lemon",
    "juice",
    "heaping",
    "flatleaf",
    "parsley",
    "parmesan",
    "cheese"
  ],
  "directions": [
    "0",
    "In a small bowl, soak the saffron threads in 2 tablespoons of boiling water and set aside.",
    "Bring a large pot of salted water to a boil. Add the cauliflower and cook until tender, about 5 minutes. Using a slotted spoon, transfer the cauliflower to a colander set over a large bowl to drain. Set aside and return the cooking water to a boil.",
    "In a large skillet, warm the olive oil over medium heat. Add the onion and cook, stirring occasionally, until softened but not brown, about 5 minutes. Add the garlic and red-pepper flakes and cook for 1 minute longer. Add the pine nuts and raisins and continue to cook until the pine nuts are lightly toasted, about 2 minutes.",
    "Add the cauliflower, steeped saffron, tomato paste and bay leaf to the skillet with 1/2 cup of the cauliflower cooking water. Season with salt and pepper and cook over medium-low heat for about 5 minutes, lightly mashing the cauliflower with the back of a wooden spoon to make a chunky sauce; add more water if the sauce starts to look dry. Discard the bay leaf.",
    "Meanwhile, cook the pasta in the cauliflower water according to the package instructions. Drain, reserving 1 cup of the water, and transfer the pasta to the skillet with the cauliflower sauce.",
    "Add the lemon juice and parsley and stir to combine. Thin the sauce with some of the reserved water if needed. Season to taste and serve with the Parmesan."
  ],
  "ingredients": [
    "0",
    "Pinch of saffron threads (about 1/8 teaspoon)",
    "1 medium head cauliflower, trimmed and cut into small florets (about 4 cups)",
    "3 tablespoons extra-virgin olive oil",
    "1 medium yellow onion, finely chopped (about 1 cup)",
    "2 garlic cloves, finely chopped",
    "1/8 teaspoon red-pepper flakes",
    "1/2 cup pine nuts",
    "1/3 cup golden raisins",
    "2 tablespoons tomato paste",
    "1 bay leaf",
    "Salt and freshly ground black pepper",
    "14 ounces whole-wheat mafalda corta pasta or similar short pasta (such as fusilli or gemelli)",
    "1 tablespoon fresh lemon juice",
    "2 heaping tablespoons chopped flat-leaf parsley",
    "Freshly grated Parmesan cheese, for garnish"
  ],
  "__v": 1
}