{
  "hash": "97d5b7fe838556bceb0e8d2356128a6e32eb534c",
  "title": "Vegan Pizza with Mushrooms, Roasted Red Peppers & Caramelized Onions",
  "image": "",
  "href": "http://www.coffeeandquinoa.com/2012/11/vegan-pizza-with-mushrooms/",
  "extension": "",
  "firstAdded": "2015-03-25T09:18:52.042000",
  "users": [
    null
  ],
  "keywords": [
    "recipe",
    "multigrain",
    "dough",
    "link",
    "storebought",
    "pizza",
    "doughs",
    "olive",
    "oil",
    "onion",
    "baby",
    "bella",
    "mushrooms",
    "used",
    "presliced",
    "red",
    "bell",
    "peppers",
    "balsamic",
    "vinegar",
    "cornmeal",
    "pesto",
    "store",
    "bought",
    "parmesan",
    "goat",
    "cheese"
  ],
  "directions": [
    "0",
    "First, roast your red peppers (or buy roasted red peppers in a jar and skip this step). Cut each pepper into 2-4 pieces and remove the stem, seeds and membrane. Place them, skin up, on a baking sheet and broil until skin is black and charred all over. This will take 6-10 minutes. Keep a close eye on them after the first few minutes, and rotate the baking sheet partway through if your broiler has hot spots. Once the skins are charred all over, remove them from the oven, place them in a plastic bag, seal it, and let them steam for at least 20 minutes. Then remove from plastic bag and peel the skin off each piece with your fingers. It's OK to leave some charred bits. Cut into bite-sized pieces.",
    "Preheat oven to 425.",
    "Next, caramelize onions. Add a little bit of olive oil to a pan over medium heat. Saute the onions for about 25 minutes. They should have some good color to them. At this point, add the sliced mushrooms. Continue sauteing another 5-7 minutes, until mushrooms are softening. Add balsamic vinegar and peppers and stir. Remove from heat.",
    "Sprinkle cornmeal on 2 pizza pans or an 11x17 baking sheet. Roll your pizza dough out to fit whichever pan you've chosen.",
    "If your pesto is not oily, brush a bit of olive oil over the crust. Then spread pesto out evenly. Top with mushroom mixture. Add cheese if you desire.",
    "Put pizzas in the oven for 12 minutes, until crust is done and cheese, if using, is melted.",
    "Slice and enjoy!"
  ],
  "ingredients": [
    "0",
    "1 recipe of my multi-grain pizza dough (link above) or 2 store-bought pizza doughs",
    "olive oil",
    "1 sweet onion, quartered and sliced",
    "20 oz. sliced baby bella mushrooms (I used 2 10-oz. pre-sliced bags)",
    "2 red bell peppers",
    "1 1/2 Tbsp balsamic vinegar",
    "cornmeal",
    "1/3 cup pesto (homemade or store bought)",
    "parmesan or goat cheese (optional)"
  ],
  "__v": 1
}