{
  "hash": "ba82cf1bd4cce46ed5fd97446b7dd6c00497859d",
  "title": "CARROT BANANA BREAD",
  "image": "https://farm8.staticflickr.com/7557/15645661916_610b78fdd1_b.jpg",
  "href": "http://www.simple-veganista.com/2014/10/carrot-banana-bread.html",
  "extension": "Chrome",
  "firstAdded": "2018-02-22T21:00:14.980000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 degrees F.",
    "In a large mixing bowl, add flour, sugar, cinnamon, baking powder & soda and salt, mix well with large slotted spoon or fork. Add milk, oil and mashed bananas, mix well, but don’t over mix, making sure there are no clumps of flour (especially on the bottom of the bowl). Fold in carrots. In a lightly greased 9 x 5 loaf pan, place mixture and bake for 50 – 55 minutes on the middle rack, rotate pan half way through.",
    "Let cool for 10 minutes, remove from pan and let cool completely. Store covered. Serve warmed or at room temperature. Slices would pair nicely with this Cashew Sweet Cream.",
    "Serves 8.",
    "Notes:",
    "The riper the bananas, the less sugar you’ll need. If your bananas are not very ripe, you may like to add a tablespoon or so more.",
    "If you don’t have baking soda on hand, use 1 tablespoon (3 teaspoons) baking powder instead of 2 teaspoons.",
    "If using coconut oil, be sure your milk is at room temperature or warmer. If adding straight from the refrigerator, the coldness will harden the coconut oil.",
    "Replace the oil with applesauce for oil-free bread. Bread may be a little denser.",
    "Make gluten-free by using a GF flour blend.",
    "Feel free to leave your carrots unpeeled. I felt mine needed it this time but usually skip this step whenever I can.",
    "Fold in 1/3 – 1/2 cup dried fruit of choice. Raisins, currants, cranberries or chopped apricots or dates would work nicely.",
    "Add in 1/2 teaspoon nutmeg for another layer of flavor and variation."
  ],
  "ingredients": [
    "0",
    "2 cups spelt flour",
    "1/3 cup organic pure cane or coconut sugar",
    "2 teaspoons cinnamon",
    "2 teaspoons baking powder",
    "1/2 teaspoon baking soda",
    "pinch of salt",
    "1/2 cup vanilla or unsweetened almond milk",
    "1/4 cup light flavored olive oil or warmed coconut oil (see notes)",
    "3 medium bananas, mashed (about 1 1/2 cup)",
    "3 carrots, grated (about 1 1/4 cup)",
    "3/4 cup chopped walnuts, optional"
  ],
  "__v": 1
}