{
  "hash": "b3cbb7e04739407da998e3cb334b0e4966f6df80",
  "title": "How to Make Homemade Tortilla Chips",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2013/05/homemade-tortilla-chips-vertical-a-800.jpg",
  "href": "http://www.simplyrecipes.com/recipes/how_to_make_homemade_tortilla_chips/",
  "extension": "",
  "firstAdded": "2017-07-14T02:14:04.176000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Fried Tortilla Chips",
    "1 The tortilla chips will fry better if they are a bit dried out first. Either leave the whole tortillas out overnight, exposed to air so they are stale the next day, or dry them out a bit in the oven or microwave.",
    "To dry them in the oven, lay them out in a single layer on a baking sheet and put them in a 350°F for 5 minutes or a 200°F oven for 10 minutes.",
    "Or lay them out in a single layer (working in batches) on a paper towel in a microwave oven and microwave them for 20 to 60 seconds, depending on how strong your microwave is and how many tortillas you are drying.",
    "You don't want them crisp at this point, just as dry as they would be if you left them out overnight.",
    "2 Cut each tortilla into 6 triangle shaped wedges.",
    "3 Pour oil into a medium skillet to a depth of 1/8 to 1/4 of an inch. (Make sure you are working with a completely dry pan or the oil will sputter as it heats.)",
    "Heat the oil on medium high heat until a small piece of tortilla placed in the oil sizzles, about 350°F. (This is where an infrared thermometer comes in handy!) Do not allow the oil to get so hot that it smokes. (If that happens, move the pan off the heat immediately.)",
    "3 Place a paper towel onto a large plate and have several other paper towels ready. Place a handful of tortilla triangles into the hot oil, in a single layer. Use metal tongs or a metal slotted spoon to distribute the tortilla triangles so that they aren't overlapping and so that all sides get coated with oil. Fry for approximately 2 minutes until the chips just begin to color and they are firm, no longer pliable.",
    "Use tongs or a slotted spoon remove the chips from the oil to the paper-towel-lined plate. Sprinkle with salt. Place another paper towel over the top of the chips to be ready for the next batch.",
    "Note that as soon as you put the tortilla triangles into the hot oil, because you are working with such a small volume of oil, the oil temperature will lower. Usually I compensate for this by increasing the heat to high. And as soon as the chips begin to color, I reduce the heat to low, so the oil doesn't overheat in between batches of chips.",
    "Continue to cook the chips, working in batches, placing the freshly fried chips over a new layer of paper towel each time, and sprinkling with salt.",
    "When the chips are all fried, pat any excess oil from them with a fresh paper towel, and eat! These chips are best freshly made.",
    "Baked Tortilla Chips",
    "1 Pre-heat oven to 350°F. Cut the tortillas into wedges.",
    "2 Spread the tortilla wedges out on a baking sheet in a single layer. Bake the tortilla wedges for about 6 minutes, then use tongs to turn the wedges over. Sprinkle with a little salt, and bake for another 6 to 9 minutes, until they are just beginning to color. Remove from the oven and let cool. Sprinkle with more salt to serve.",
    "Microwaved Tortilla Chips",
    "1 Cut the tortillas into wedges.",
    "2 Line your microwave oven with a paper towel. Working in batches if necessary, spread the tortilla wedges over the paper towel in a single layer, with an inch or so between the wedges. Microwave until the tortilla chips are crispy, but not burnt. The time will vary depending on the strength of your microwave and how many tortillas you are cooking. In our microwave, it's about a little less than 1 minute per tortilla. But I would start at half of that and add time as needed.",
    "Sprinkle with salt to serve. Great with guacamole."
  ],
  "ingredients": [
    "0",
    "About 3/4 to 1 cup canola, grapeseed, or corn oil (a high smoke point oil), more or less depending on how many chips you are making",
    "Corn tortillas (get the standard kind, not the super fancy kind), each tortilla will make 6 chips, 12 tortillas will yield 72 chips, a good snack for 2 to 3 people",
    "Kosher salt"
  ],
  "__v": 1
}