{
  "hash": "7fbdba7fe60d3f2af48c7972a6f663892e977c7b",
  "title": "Nigella Lawson's Vietnamese pork noodle soup",
  "image": "http://www.styleathome.com/img/photos/biz/Style at Home/Vietnamese-Soup-MED.jpg",
  "href": "http://www.styleathome.com/food-and-entertaining/recipes/recipe-nigella-lawson-s-vietnamese-pork-noodle-soup/a/32794",
  "extension": "Chrome",
  "firstAdded": "2015-04-19T08:23:24.714000",
  "users": [
    null
  ],
  "keywords": [
    "pork",
    "fillet",
    "discs",
    "strips",
    "lime",
    "juice",
    "soy",
    "paprika",
    "fish",
    "ramen",
    "noodles",
    "garlic",
    "oil",
    "fat",
    "spring",
    "onions",
    "frozen",
    "ginger",
    "litre",
    "chicken",
    "stock",
    "goodquality",
    "cube",
    "concentrate",
    "preferably",
    "organic",
    "beansprouts",
    "baby",
    "pak",
    "choi",
    "torn",
    "pieces",
    "red",
    "chilli"
  ],
  "directions": [
    "0",
    "Directions",
    "1 Put the strips of pork fillet into a bowl and add the lime juice, soy sauce, paprika and fish sauce, but don’t let this stand for more than 15 minutes.",
    "2 Cook the noodles according to packet instructions and then refresh in cold water.",
    "3 Heat a wok or a deep, heavy-based frying pan, then add the garlic oil and fry the spring onions and ginger for a minute or so. Add the pork and its liquid to the wok, stirring as you go.",
    "4 Cook the meat in the pan for another 2 minutes, then make up the chicken stock with boiling water, add the hot stock to the pan and bring to the boil.",
    "5 Check the pork is cooked through, then add the beansprouts and baby pak choi. Add water if the soupy base has evaporated too much – about 125ml of freshly boiled water should do the trick, but you may not need it.",
    "6 Arrange the drained noodles equally in two large or four small warmed bowls, ladle over them the pork and vegetables, and finally the soupy stock. Scatter the chopped chilli on top and serve.",
    "Serves 2-4."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "275g pork fillet, cut into thin discs and then fine strips",
    "2 x 15ml tablespoons lime juice",
    "2 x 15ml tablespoons soy sauce",
    "½ teaspoon paprika",
    "2 x 15ml tablespoons fish sauce",
    "250g ramen noodles",
    "1 x 15ml tablespoon garlic oil",
    "6 thin or 3 fat spring onions, finely sliced",
    "1 x 15ml tablespoon chopped fresh (or frozen) ginger",
    "1 litre chicken stock (good-quality cube or concentrate is fine), preferably organic",
    "300g beansprouts",
    "175g baby pak choi, torn into pieces",
    "2 teaspoons chopped red chilli"
  ],
  "__v": 1
}