{
  "hash": "6c9eab113dc267d9ff29516c07b4241793fa7351",
  "title": "Spinach and Artichoke Dip Stuffed Garlic Bread",
  "image": "http://i0.wp.com/hostthetoast.com/wp-content/uploads/2015/10/Spinach-and-Artichoke-Dip-Stuffed-Garlic-Bread23.jpg?resize=670%2C1012",
  "href": "http://hostthetoast.com/spinach-and-artichoke-dip-stuffed-garlic-bread/",
  "extension": "Chrome",
  "firstAdded": "2015-11-07T09:45:31.382000",
  "users": [
    null
  ],
  "keywords": [
    "baguette",
    "oil",
    "artichoke",
    "hearts",
    "baby",
    "spinach",
    "leaves",
    "cream",
    "cheese",
    "mozzarella",
    "green",
    "onions",
    "salt",
    "pepper",
    "butter",
    "garlic",
    "parmesan",
    "basil",
    "parsley",
    "torn"
  ],
  "directions": [
    "0",
    "Cut the baguette into 4 pieces. Use a long knife to cut out the insides, leaving some bread along the edges. Pull out the loose bread to leave hollow bread quarters. Set aside.",
    "Heat the oil in a large pot over medium-high heat. Add in the artichoke pieces and cook for one minute. Reduce heat to medium, add in the spinach, and cook until wilted, turning often.",
    "Mix in the cream cheese and mozzarella, and let it melt entirely. Fold in the green onions and season with salt and pepper to taste. Remove from heat.",
    "Preheat the oven to 350 degrees F.",
    "Stuff the baguette quarters with the spinach and artichoke dip, using a spoon to help pack the dip.",
    "Once the bread is stuffed, transfer it to a cutting board. Line up the quarters so that they fit together as they did before the baguette was cut. Slice the baguette into slices that are approximately 1\" thick.",
    "Tear a piece of heavy duty foil that is about 5-6 inches longer than the baguette. Slide the baguette slices off of the cutting board and onto the foil, keeping them together.",
    "In a small bowl, combine the butter and minced garlic. Loosely cover the top and microwave for a minute, or until the butter is fully melted. Brush the garlic butter over the baguette, allowing some to drip down between the slices. Make sure to get all of the minced garlic on top of the bread.",
    "Wrap the foil around the bread and bake for 15 minutes. Unwrap the bread and bake for 5 minutes, or until the top browns slightly.",
    "Remove from the oven, top with parmesan cheese and torn basil or parsley leaves, and serve warm."
  ],
  "ingredients": [
    "0",
    "1 baguette",
    "½ tablespoon oil",
    "1 (14 oz) can artichoke hearts, drained and chopped",
    "1 (10 oz) bag baby spinach leaves",
    "1 (8 oz) package cream cheese",
    "1½ cups shredded mozzarella cheese",
    "3 green onions, sliced",
    "Salt and pepper, to taste",
    "3 tablespoons butter",
    "3 cloves garlic, minced",
    "Parmesan cheese, grated, to top",
    "Fresh basil leaves or parsley, torn, to top"
  ],
  "__v": 1
}