{
  "hash": "7c414621bed6061c6abf9781449f73dc3ccc4386",
  "title": "One-Pot Turmeric Coconut Rice With Greens",
  "image": "https://static01.nyt.com/images/2019/01/31/dining/as-yellow-coconut-rice/merlin_149991612_12dbd842-8c7e-4719-b321-7105ba358eb5-articleLarge.jpg",
  "href": "https://cooking.nytimes.com/recipes/1019920-one-pot-turmeric-coconut-rice-with-greens?te=1&nl=morning-briefing&emc=edit_NN_p_20190611&section=aBreak?campaign_id=9&instance_id=10110&segment_id=14169&user_id=67c5933e12275aef81fea42415b1f0ef&regi_id=62318526ction=aBreak",
  "extension": "Chrome",
  "firstAdded": "2019-06-16T18:06:12.899000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "PREPARATION",
    "Rinse rice until water runs clear. Drain and set aside.",
    "In a medium pot or Dutch oven, toast the coconut and sesame seeds over medium-low heat, stirring occasionally, until fragrant, 3 to 5 minutes. (Adjust heat as needed to prevent burning.) Transfer to a small bowl. Wipe out the pot.",
    "In the same pot, melt the coconut oil over medium-low. Add the scallion whites, turmeric and 1/2 teaspoon black pepper and cook, stirring, until aromatic and lightly toasted, 3 to 5 minutes.",
    "Add the rice, coconut milk, saffron (if using), and 1 1/2 teaspoons salt. Fill the empty can of coconut milk with water and add it to the pot. Give the mixture a good stir to separate any lumps and bring to a boil over medium-high.",
    "Once boiling, cover, turn the heat to low, and simmer for 10 minutes.",
    "As rice cooks, remove and discard the tough stems of the leafy greens, if needed, and cut or tear the leaves into bite-size pieces. When the rice has cooked for 10 minutes, arrange the greens on top of the rice in an even layer and season well with salt and pepper. Cover, and cook until the rice is tender, 5 more minutes. Remove from heat and let sit, covered, 5 minutes.",
    "As rice rests, zest the lime and cut it into 4 wedges. Add 1/2 teaspoon zest to the coconut-sesame mixture, along with the scallion greens. Season with salt and pepper and stir to combine.",
    "Gently stir the greens into the rice using a spatula or fork, season to taste with salt and pepper. Divide among bowls. Sprinkle the coconut mixture on top and serve with a lime wedge for squeezing over."
  ],
  "ingredients": [
    "0",
    "2",
    "cups long-grain rice, such as jasmine or basmati",
    "½",
    "cup unsweetened coconut flakes",
    "1",
    "tablespoon white or black sesame seeds",
    "2",
    "tablespoons coconut oil",
    "1",
    "scallion, thinly sliced, white and green parts separated",
    "1",
    "teaspoon ground turmeric",
    "½",
    "teaspoon black pepper, plus more as needed",
    "1",
    "(14-ounce) can full-fat coconut milk",
    "Pinch of saffron (optional)",
    "Kosher salt",
    "1",
    "medium bunch kale, spinach or Swiss chard",
    "1",
    "lime"
  ],
  "__v": 1
}