{
  "hash": "335caeddc6b66998dc732829c8136e8435d9c65d",
  "title": "BAKED WHOLE WHEAT PENNE WITH CHICKPEAS",
  "image": "",
  "href": "http://www.lidiasitaly.com/recipes/detail/1287",
  "extension": "",
  "firstAdded": "2015-08-21T05:24:17.638000",
  "users": [
    null
  ],
  "keywords": [
    "dry",
    "chickpeas",
    "soaked",
    "overnight",
    "bay",
    "leaves",
    "kosher",
    "salt",
    "pot",
    "extravirgin",
    "olive",
    "oil",
    "garlic",
    "redpepper",
    "san",
    "marzano",
    "tomatoes",
    "hand",
    "sage",
    "wholewheat",
    "penne",
    "grana",
    "padano",
    "parmigianoreggiano",
    "unsalted",
    "butter",
    "baking",
    "dish",
    "lowmoisture",
    "mozzarella"
  ],
  "directions": [
    "0",
    "Combine the drained chickpeas, bay leaves, and 2 quarts water. Bring to a simmer, and cook until tender, about 1 hour. Drain, and discard the bay leaves.",
    "Preheat the oven to 350 degrees F. Bring a large pot of salted water to a boil for pasta. In a large skillet, heat the olive oil over -medium--high heat. Add the garlic. Once the garlic is sizzling, add the -red--pepper flakes and tomatoes, along with 1 cup of slosh water from the tomato can. Add the sage, salt, and cooked chickpeas. Bring to a simmer, and cook until thickened, about 10 minutes.",
    "While the sauce simmers, cook the pasta until it is al dente. Transfer the pasta with a spider to the sauce, and add 1 cup pasta water. Simmer until the sauce just comes together again, about 1 minute. Remove the skillet from the heat, and stir in 1 cup grated Grana Padano or -Parmigiano--Reggiano.",
    "Grease a -4--quart baking dish with butter, and pour in the -pasta--and--sauce mixture. In a small bowl, toss together the remaining Grana Padano or -Parmigiano--Reggiano and the shredded mozzarella, and sprinkle over the pasta. Bake until the cheese is bubbly and golden, about 30 minutes. Serve"
  ],
  "ingredients": [
    "0",
    "2 cups dry chickpeas, soaked overnight and drained",
    "4 fresh bay leaves",
    "½ teaspoon kosher salt, plus more for the pot",
    "3 tablespoons -extra--virgin olive oil",
    "4 garlic cloves, peeled and sliced",
    "¼ teaspoon crushed -red--pepper flakes",
    "One -15--ounce can whole San Marzano tomatoes, crushed by hand",
    "4 fresh sage leaves",
    "1 pound -whole--wheat penne",
    "2 cups grated Grana Padano or -Parmigiano--Reggiano",
    "Unsalted butter, for the baking dish",
    "2 cups shredded -low--moisture -mozzarella"
  ],
  "__v": 1
}