{
  "hash": "fefe6737a6d8bd84061c27582d328df987d7ae3f",
  "title": "Vegan Gluten free Pizza Crust Recipe",
  "image": "http://www.veganricha.com/wp-content/uploads/2015/07/thai-pizza-gf-crust-6278.jpg",
  "href": "http://www.veganricha.com/recipe-pages/vegan-gluten-free-pizza-crust-recipe",
  "extension": "",
  "firstAdded": "2015-09-23T10:47:33.568000",
  "users": [
    null
  ],
  "keywords": [
    "dry",
    "oat",
    "flour",
    "use",
    "certified",
    "glutenfree",
    "needed",
    "white",
    "rice",
    "tapioca",
    "starch",
    "corn",
    "potato",
    "salt",
    "baking",
    "parsley",
    "pepper",
    "wet",
    "water",
    "sugar",
    "maple",
    "active",
    "yeast",
    "flaxseed",
    "chia",
    "seed",
    "meal",
    "non",
    "yogurt",
    "brought",
    "room",
    "temperatureor",
    "apple",
    "puree",
    "oil"
  ],
  "directions": [
    "0",
    "In a bowl whisk all the dry ingredients for the crust and keep aside.",
    "In another bowl, combine water, yeast and sugar and let it sit until frothy. 5 minutes. Add the flax and mix in. Let it sit for a minute.",
    "Add the dry to the wet. Add in the yogurt and oil and mix well. Let the sticky dough sit for 10 minutes.",
    "Using flour or oil on your hands shape the dough into a flat ball. Place ball on parchment lined pie pan or 9 to 10 inch pan pizza or deep dish pizza pan.",
    "Spray water or oil on the dough, press with your hands and shape the dough to fit the pan with atleast ½ inch edge going up the sides. You can also use flour and roll the dough out between parchment sheets into a 9 to 10 inch round and then place in the pie pan.",
    "Even out the edges and let it sit for 15 minutes in a warm place. I usually put it near the oven when the over pre-heats.",
    "Preheat the oven to 400 degrees F. Place another parchment on top of the pizza pan. Bake for 10 minutes.",
    "Uncover and remove the pie pan from the oven. *The par-baked crust can be cooled and frozen at this point. I have not tried freezing this particular crust. Let me know if you do.",
    "Layer the sauce, toppings, cheese. Spray water on the crust edge.",
    "Bake for 14 minutes. Broil for 1 to 2 minutes to brown the edges. Cool for a minute or so, slice and serve"
  ],
  "ingredients": [
    "0",
    "Dry:",
    "¾ cup Oat flour (use certified gluten-free if needed)",
    "¼ cup white rice flour",
    "¼ cup tapioca starch",
    "¼ cup corn or potato starch",
    "½ tsp salt",
    "1 tsp baking powder",
    "½ tsp parsley (optional)",
    "a dash of pepper",
    "Wet:",
    "½ cup warm water",
    "2 tsp sugar or maple",
    "2 tsp active yeast or 1 packet",
    "1 tablespoon flaxseed meal or chia seed meal",
    "2 tablespoons non dairy yogurt brought to room temperature(or use apple sauce or sweet potato puree)",
    "1.5 tablespoons oil"
  ],
  "__v": 1
}