{
  "hash": "75f9a2db99d71862c6b054ac8d6703bd50de4a83",
  "title": "Cabbage Soup",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2014/01/cabbage-soup-horiz-a-1600.jpg",
  "href": "https://www.simplyrecipes.com/recipes/cabbage_soup/",
  "extension": "",
  "firstAdded": "2018-01-27T21:43:17.071000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Grind spices if using whole spices: If using whole spices (coriander, fennel, cumin), grind them in a mortar and pestle or in a spice grinder until well ground.",
    "2 Sauté onions and spices: Heat olive oil and butter in a 4-quart, thick bottomed pot on medium heat. Add the chopped onion and stir in the ground spices. Cook until the onions have softened, about 5 minutes.",
    "3 Add cabbage and tomatoes: Add the sliced cabbage to the pot and stir to mix the cabbage with the onions. If you are using unsalted stock, sprinkle the cabbage with 1/2 teaspoon of salt. Add the canned whole tomatoes, with their juices, to the pot. Stir to combine.",
    "4 Add stock, simmer till done: Add chicken stock to the pot. Bring to a simmer and taste for salt. Add more salt to taste. Lower the heat and cover the pot. Let simmer for 20 to 25 minutes or until the cabbage is thoroughly cooked.",
    "Sprinkle with freshly ground black pepper to serve."
  ],
  "ingredients": [
    "0",
    "2 teaspoons olive oil",
    "1 teaspoon butter",
    "1/2 teaspoon coriander seeds (or 1/4 teaspoon ground coriander)",
    "1/2 teaspoon fennel seeds (or 1/4 teaspoon ground fennel)",
    "1/4 teaspoon cumin seeds (or 1/8 teaspoon ground cumin)",
    "1 medium onion, chopped (about 1 1/4 cups)",
    "4 to 5 cups, packed, 1/4-inch wide sliced green cabbage (from about 1 small cabbage or 1/2 large cabbage)",
    "1/2 teaspoon to 1 teaspoon salt (more or less depending on the saltiness of your stock)",
    "1 15-ounce can whole peeled tomatoes",
    "4 cups chicken stock",
    "Freshly ground black pepper"
  ],
  "__v": 1
}