{
  "hash": "7a0e5c70545190955678deea2b0f37241b1b0597",
  "title": "Coq au Vin",
  "image": "http://www.recipe30.com/wp-content/uploads/2016/11/Coq-au-vin-848x477.jpg",
  "href": "http://www.recipe30.com/coq-au-vin.html/",
  "extension": "Chrome",
  "firstAdded": "2017-04-07T20:40:05.099000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Empty the bottle of red wine into a cooking pot and place on high heat. Once the wine starts to boil, using a match or lighter, ignite the alcohol (Flambe) very carefully. If unsure, leave out that step. Roughly cut one onion, two carrots and two celery sticks and add to the wine. Remove two cloves of garlic from the knob and slice the remainder in half width wise. Add garlic to the wine along with the rosemary, thyme and bay leaves. Simmer for 5 more minutes and empty contents directly into to a Dutch oven or any marinating container, leave to cool.",
    "Breakdown your chicken into 8 pieces (Click here to watch how to video) and add to cold wine marinade. Cover and refrigerate overnight. The following day, remove the chicken pieces and lightly pat them dry with a paper towel to avoid spitting. Lightly season with salt and pepper. Heat up a frying pan on high heat with grapeseed oil and brown the chicken four pieces at a time. Place aside once browned on each side.",
    "Strain the marinade and keep the wine aside.",
    "Peel and slice the onions quite finely, add to Dutch oven on high heat. Add the two cloves of crushed or grated garlic. Place all your chicken pieces in the Dutch oven on top of the onions. Pour the cognac over the chicken and ignite the alcohol (Flambe) very carefully. If unsure, leave out that step. Add the wine from the marinade and bring to a simmer. Add the chicken stock. Add the tomato paste. Add the lid and place in pre-heated oven and bake for 150 min at 250°F – 120°C.",
    "Slice bacon into lardons. Peel shallots, if too big slice in half. Cut large mushrooms into quarters, if mushrooms are smaller, cut in half, if real small leave whole. Melt the butter in frying pan and add the shallots, bacon and gently fry until slightly caramelised. Add the mushrooms and continue cooking for 2 minutes. Add the flour to the mushroom, bacon and shallots and mix well for 30 seconds. Turn off heat.",
    "After 120 minute of cooking, remove from oven and add the mushroom, shallot and bacon mix. Mix them gently and return to oven for the remaining 30 minutes.",
    "Once cooked, scoop out all the ingredients, place in a mixing bowl. Reduce the remaining sauce in Dutch oven on high heat, until it becomes a little thicker, check for seasoning. Return your chicken and ingredients to the sauce. Ready to serve. Garnish with chopped or freshly picked Italian parsley leaves."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 whole chickens or 8 pieces - click for video",
    "2 large brown onion",
    "2 carrots",
    "2 celery sticks",
    "2 bay leaves",
    "3-4 sprigs of thyme",
    "1 small handful of fresh Italian parsley",
    "1 bottle of red wine (ideally French Bourgogne or a Pinot Noir)",
    "1 quarter cup of Cognac (or Brandy)",
    "2 cups chicken stock (you can use cubes diluted in 2 cups of water)",
    "1 whole large garlic knob",
    "2 tbsp of tomato paste",
    "120g - 4oz smoky bacon",
    "150g - 5oz small shallots (approx 12 -16)",
    "150g - 5oz white button mushrooms",
    "100g - 3.5oz butter",
    "2 tbsp all purpose flour",
    "Cooking oil (recommend grapeseed)",
    "Salt and pepper"
  ],
  "__v": 1
}