{
  "hash": "7c4496a8461107854401f455fac0fe091e4bbc78",
  "title": "Zesty Chili-Lime Chicken Taquitos",
  "image": "//thecozyapron.com/wp-content/uploads/2014/06/chili-lime-chicken-taquitos_06-29-14_1_ca.jpg",
  "href": "http://thecozyapron.com/zesty-chili-lime-chicken-taquitos-and-a-little-edible-magic/",
  "extension": "Chrome",
  "firstAdded": "2016-01-21T09:40:49.881000",
  "users": [
    null
  ],
  "keywords": [
    "skinless",
    "boneless",
    "chicken",
    "tenderloins",
    "canola",
    "oil",
    "shallow",
    "frying",
    "chili",
    "salt",
    "black",
    "pepper",
    "zest",
    "lime",
    "juice",
    "juicy",
    "pressed",
    "garlic",
    "press",
    "corn",
    "tortillas",
    "use",
    "mission",
    "brand",
    "super",
    "soft",
    "variety",
    "frozen",
    "fireroasted",
    "thawed",
    "pepperjack",
    "cheese",
    "cilantro",
    "leaves",
    "cool",
    "avocado",
    "jalapeno",
    "ranch",
    "dipping",
    "recipe"
  ],
  "directions": [
    "0",
    "Add the chicken tenderloins to a bowl, and add to them a drizzle of the oil, the chili powder, salt, black pepper, lime zest and juice, plus the garlic, and toss to combine; marinate the chicken for about 15-20 minutes.",
    "-Once marinated, place a large non-stick pan over high heat; once hot, drizzle in just a touch of oil, then sear the chicken tenderloins for about 2-3 minutes on each side, or until golden brown and cooked through; remove and set aside for a moment to cool.",
    "-Once cooled, shred the chicken into small pieces, and place into a small bowl.",
    "-Heat the corn tortillas by wrapping about 12 of them in damp paper towels, and microwaving for about 45 seconds; keep the stack covered in the warm damp paper towels as you assemble the taquitos, to keep them soft and pliable; repeat with the remaining 12.",
    "-Place a corn tortilla in front of you, and take a small sprinkle (about a tablespoon) of the shredded chicken, and add it in a line on the bottom of the tortilla; top with a small sprinkle of corn, cheese and cilantro leaves, and roll as tightly as possible upward; place the taquito seam-side down on a baking sheet to hold as you continue to roll the rest of the taquitos.",
    "-Heat enough oil in a large non-stick pan to cover the bottom of the pan (about ¼”); once hot, add a small batch of taquitos (2-4 depending on size of your pan) into the oil, seam-side down, and allow them to crisp and fry for about 1-2 minutes on that first side; turn the taquitos and allow them to crisp and become golden-brown on all sides; drain on paper towels, and repeat until all are fried.",
    "-Serve with Cool Avocado-Jalapeno Ranch Dipping Sauce on the side.",
    "Cool Avocado & Jalapeno Ranch Dipping Sauce Ingredients:",
    "• 1 ripe avocado, roughly chopped",
    "• 1 jalapeno, seeds and membrane removed, roughly chopped",
    "• ¾ cup sour cream",
    "• Zest of 1 lime",
    "• Juice of ½ lime (or whole lime, if not that juicy)",
    "• 2 garlic cloves",
    "• 1 teaspoon granulated onion",
    "• ¾ teaspoon salt",
    "• ¼ teaspoon black pepper",
    "• ¼ cup cilantro leaves",
    "Preparation:",
    "-Place all ingredients into the bowl of a food processor, and process until completely smooth and well combined; serve immediately, or store in covered container in fridge until ready to serve."
  ],
  "ingredients": [
    "0",
    "• 1 pound skinless, boneless chicken tenderloins",
    "• Canola oil (plus enough for shallow frying)",
    "• 1 teaspoon chili powder",
    "• ½ teaspoon salt",
    "• Pinch or two black pepper",
    "• Zest of 1 lime",
    "• Juice of ½ lime (or whole lime, if not that juicy)",
    "• 2 cloves garlic, pressed through garlic press",
    "• 24 corn tortillas (I like to use Mission brand “super soft” variety)",
    "• ½ cup frozen fire-roasted corn, thawed",
    "• 1 cup shredded pepper-jack cheese",
    "• ¼ cup chopped cilantro leaves",
    "• Cool Avocado & Jalapeno Ranch Dipping Sauce (recipe below)"
  ],
  "__v": 1
}