{
  "__v": 1,
  "directions": [
    "0",
    "Set up a standard breading procedure in three wide deep plates. Fill one with flour, one with the beaten eggs, and one with the panko and grated cheese. Season the chicken breasts with salt and pepper. Using one hand for dry things and one hand for wet things, take each piece of chicken through the breading procedure: dredge lightly in the flour, then the egg wash and then through the bread crumbs. Lay the breaded chicken on a sheet tray and refrigerate for at least one hour. [Do ahead: You could even prep these the night before, to save time. Cover them loosely with plastic wrap in the fridge.]",
    "Pour olive oil into a large saute pan until it reaches a thickness of about a half an inch – better a little more rather than a little less. Bring to a medium-high heat. Test the oil by flicking flour or bread crumbs into the oil. If it doesn’t sizzle, wait! When the oil is hot, test it again by dipping the edge of a piece of chicken into the oil, the oil should gently sizzle. Cook the chicken in the oil in batches on both sides until it is a lovely golden brown color and is crispy, about four to five minutes on the first side and three to four minutes on the second. Do not crowd the pan or the chicken will become very greasy and soggy. When the chicken comes out of the oil lay it on paper towels to drain off the excess oil and sprinkle with salt."
  ],
  "firstAdded": "2014-06-19T07:52:04.562000",
  "hash": "da632fdc43c69d25b7d055ff333e0f90e8dc6d30",
  "href": "http://smittenkitchen.com/blog/2009/01/chicken-milanese-an-escarole-salad/",
  "image": "http://farm4.static.flickr.com/3532/3222788192_e419c192ec.jpg",
  "ingredients": [
    "0",
    "For the Chicken Milanese:",
    "1 cup all-purpose flour",
    "2 eggs, beaten with 1 tablespoon of water",
    "1 1/2 cups panko bread crumbs",
    "1/2 cup grated pamesan",
    "4 small organic chicken breasts, butterflied and lightly pounded/flattened (not tenderized; a good organic chicken breast will already be tender) to 1/4-inch thick*",
    "Kosher salt and pepper",
    "Extra-virgin olive oil, for frying"
  ],
  "keywords": [
    "chicken",
    "milanese",
    "allpurpose",
    "flour",
    "eggs",
    "water",
    "panko",
    "bread",
    "crumbs",
    "pamesan",
    "breasts",
    "butterflied",
    "lightly",
    "poundedflattened",
    "tenderized",
    "good",
    "organic",
    "breast",
    "tender",
    "kosher",
    "salt",
    "pepper",
    "extravirgin",
    "olive",
    "oil",
    "frying"
  ],
  "title": "Chicken Milanese",
  "users": [
    null
  ]
}