{
  "hash": "d348b4a70e3662bff4bf390dc93e8918c61ec731",
  "title": "Vegan chocolate, cherry & honeycomb parfait",
  "image": "//img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/1283_1_1436960438.jpg?tr=w-414,",
  "href": "https://www.jamieoliver.com/recipes/chocolate-recipes/vegan-chocolate-cherry-honeycomb-parfait/",
  "extension": "Chrome",
  "firstAdded": "2018-11-29T17:44:32.703000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Begin by making the honeycomb. Generously grease a baking tray with vegetable oil. Melt the granulated sugar and golden syrup in a high-sided saucepan over a low heat. Once melted, turn up the heat a little and bubble the syrup until it turns a rich, caramel-gold colour.",
    "Whisk in the bicarbonate of soda. The syrup will foam up – immediately pour it onto your greased baking tray. Set the tray aside and leave it to cool for 20 minutes. Slide the honeycomb off the tray and roughly chop it up.",
    "Line a 450g loaf tin with enough clingfilm to allow it to drape over the sides by about 7 to 8cm, smoothing the clingfilm into the tin to form a crease-free surface. Break up the dark chocolate and roughly chop the almonds.",
    "Place the chocolate and margarine in a heatproof bowl over a pan of simmering water, stir together until melted and combined to a smooth and glossy finish.",
    "Take the bowl off the heat and stir in the chopped honeycomb, almonds, cherries and cranberries.",
    "Spoon the mixture into the lined tin and level the top. Fold the overhanging clingfilm loosely over the parfait, then freeze for 1 hour.",
    "Remove from the freezer and transfer the parfait to the fridge until completely set. Once you’re ready to serve, carefully lift the parfait from the tin, unwrap the clingfilm and cut into 2cm slices."
  ],
  "ingredients": [
    "0",
    "200 g dark dairy-free chocolate",
    "85 g blanched almonds",
    "150 g dairy-free margarine",
    "85 g glacé cherries",
    "100 g dried cranberries",
    "Honeycomb",
    "vegetable oil , for greasing",
    "5 tbsp granulated sugar",
    "2 tbsp golden syrup",
    "1/2 tsp bicarbonate of soda"
  ],
  "__v": 1
}