{
  "hash": "0916b3fdf1d77de87ef539c666de4da244b90726",
  "title": "Green chile cheeseburgers",
  "image": "http://ninecooks.typepad.com/.a/6a00d83451fa5069e201b7c6e27f0d970b-800wi",
  "href": "http://www.theperfectpantry.com/2011/09/recipe-for-green-chile-cheeseburgers.html",
  "extension": "Chrome",
  "firstAdded": "2015-07-27T01:04:31.754000",
  "users": [
    null
  ],
  "keywords": [
    "beef",
    "use",
    "lean",
    "fireroasted",
    "green",
    "chile",
    "peppers",
    "cheddar",
    "cheese",
    "mayonnaise",
    "hellmanns",
    "new",
    "mexico",
    "pepper",
    "cumin",
    "black",
    "slices",
    "jack",
    "regular",
    "burger",
    "love",
    "potato",
    "glutenfree",
    "buns",
    "lettuce"
  ],
  "directions": [
    "0",
    "Directions",
    "Bring the beef to room temperature for 30 minutes.",
    "Preheat the broiler, griddle or grill. I've had the best results using the broiler, but I've also made these burgers on a grill pan. It's a bit messy on the grill, but it works. For the broiler, line a rimmed pan with aluminum foil, and set aside.",
    "In a large mixing bowl, combine beef, green chiles and grated cheddar cheese with your impeccably clean hands. Mix just until the ingredients are incorporated; do not overmix.",
    "Form the mixture into 8 small burgers, or 4 large ones.",
    "Broil (approximately 6 inches from the heat) or grill for 3-4 minutes per side, depending on how you like your burgers. In the final 30 seconds, top each burger with a slice of pepper jack cheese.",
    "While the burgers are cooking, in a small bowl stir together the mayonnaise, chile powder, cumin and black pepper. Set aside.",
    "When the burgers are cooked and the cheese on top has melted, remove them to a platter and let sit for 5 minutes.",
    "To assemble, slice each bun in half, and slather the bottom with a bit of the mayonnaise sauce. Add lettuce leaves, and top with a burger. Serve with lots of napkins to catch the dribbles."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 lb ground beef (I use 87% lean)",
    "1 4-oz can fire-roasted chopped green chile peppers",
    "1/2 cup grated cheddar cheese",
    "1/2 cup mayonnaise (I use Hellmanns)",
    "1/4 tsp ground New Mexico chile pepper",
    "1/4 tsp ground cumin",
    "Pinch of black pepper",
    "Slices of pepper jack cheese",
    "8 small or 4 regular burger buns (I love potato buns), or gluten-free buns",
    "Lettuce"
  ],
  "__v": 1
}