{
  "hash": "45af3b94a7c4840c12d7cab953e43188d2db09de",
  "title": "Shepherd's Pie",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/ellie-krieger/shepherds-pie-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-02-10T22:10:07.812000",
  "users": [
    null
  ],
  "keywords": [
    "beef",
    "percent",
    "lean",
    "higher",
    "olive",
    "oil",
    "medium",
    "onions",
    "carrots",
    "white",
    "mushrooms",
    "thyme",
    "leaves",
    "allpurpose",
    "flour",
    "lowsodium",
    "broth",
    "salt",
    "black",
    "pepper",
    "frozen",
    "peas",
    "yukon",
    "gold",
    "creamery",
    "potatoes",
    "head",
    "cauliflower",
    "florets",
    "lowfat",
    "milk",
    "butter"
  ],
  "directions": [
    "0",
    "In a large nonstick skillet cook the meat over medium heat, stirring occasionally, until brown, about 5 minutes. Transfer the meat to a plate. Drain any fat remaining in the skillet.",
    "Heat the oil in the skillet over a medium heat. Add the onions and carrots and cook, covered, until the vegetables begin to soften, about 8 minutes. Raise the heat to moderately-high. Add the mushrooms and thyme and cook, uncovered and stirring occasionally, until the mushrooms are soft and their liquid has evaporated, about 8 minutes longer. Return the meat to the pan. Add the flour and cook, stirring, for 2 minutes. Stir in the broth, 1/2 teaspoon of the salt and 1/8 teaspoon of pepper and bring to a simmer being sure to scrape up any brown bits from the bottom of the pan. Stir in the peas. Pour the mixture into a 12-cup shallow baking dish (about 11 by 9 inches).",
    "Preheat the oven to 350 degrees F. Scrub the potatoes and cut into 2-inch pieces. Arrange the potatoes in a steamer basket, and steam for 10 minutes. Add the cauliflower to the basket and cook until the potatoes and cauliflower are tender when pierced with the tip of a knife, about 15 minutes longer. Mash the vegetables with a potato masher until smooth. Heat the milk, butter, the remaining 1/2 teaspoon of salt and a pinch of pepper and stir into the potato mixture.",
    "Spread the potato mixture on top of the meat and bake until heated through, about 25 minutes.",
    "Excellent source of: Protein, Fiber, Vitamin A, Riboflavin, Niacin, Vitamin B6, Vitamin B12, Vitamin C, Folate, Vitamin K, Copper, Iron, Manganese, Potassium, Zinc",
    "Good source of: Thiamin, Pantothenic Acid, Magnesium, Phosphorus",
    "2008, Ellie Krieger, All Rights Reserved"
  ],
  "ingredients": [
    "0",
    "1 pound lean ground beef (90 percent lean or higher)",
    "2 teaspoons olive oil",
    "2 medium onions, chopped (about 3 cups)",
    "3 medium carrots, diced (about 1 1/2 cups)",
    "1/2 pound white mushrooms, sliced",
    "2 teaspoons chopped fresh thyme leaves or 1 teaspoon dried",
    "2 tablespoons all-purpose flour",
    "1 cup low-sodium beef broth",
    "1 teaspoon salt",
    "Freshly ground black pepper",
    "1 cup frozen peas",
    "1 1/2 pounds Yukon gold or creamery potatoes",
    "1 small head cauliflower (about 2 pounds), cut into florets",
    "2/3 cup 1 percent lowfat milk",
    "2 tablespoons butter"
  ],
  "__v": 1
}