{
  "hash": "6920d4cecaed98e9275065a2b43c485259346cc5",
  "title": "Mediterranean Chicken Skillet with Zucchini, Chickpeas, Olives and Tomatoes",
  "image": "http://target.scene7.com/is/image/Target/c_Mediterranean-Chicken--Skillet-SQ?hei=340",
  "href": "http://www.cooking.com/recipes-and-more/recipes/mediterranean-chicken-skillet-zucchini-garbanzo-beans-olives-tomatoes-recipe",
  "extension": "Chrome",
  "firstAdded": "2015-08-28T00:03:59.053000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "cutlets",
    "kosher",
    "salt",
    "black",
    "pepper",
    "olive",
    "oil",
    "medium",
    "zucchini",
    "garlic",
    "cherry",
    "tomatoes",
    "dry",
    "white",
    "wine",
    "chickpeas",
    "rinsed",
    "marinated",
    "artichoke",
    "hearts",
    "green",
    "olives",
    "roughly",
    "basil"
  ],
  "directions": [
    "0",
    "Season chicken with salt and pepper.",
    "Add the olive oil to a large non-stick pan over medium-high heat. Once hot, add the chicken and cook for 3 minutes per side, until golden and brown. Remove to a plate.",
    "Turn heat to medium and add zucchini and garlic and sauté for 3 minutes, until zucchini is just softened and the garlic is fragrant. Add tomatoes and stir while cooking until they just begin to break down, about 1 minute. Stir in wine and use the back of a wooden spoon to stir up any browned bits on the bottom of the pan. Bring the wine to a simmer and toss in the chickpeas, artichoke hearts and olives, and stir to combine. Add the chicken back to the pan and nestle into the veggies. Simmer on medium-low for 8 minutes, then remove the chicken, turn heat to high and continue to cook until the pan is almost dry, about 2 minutes more. Sprinkle with fresh basil before serving."
  ],
  "ingredients": [
    "0",
    "4 chicken cutlets",
    "Kosher salt and freshly ground black pepper",
    "2 tablespoons olive oil",
    "2 medium zucchini, diced",
    "5 cloves garlic, minced",
    "1 cup cherry tomatoes, cut in half",
    "3/4 cup dry white wine",
    "1 (15 ounce) can chickpeas, drained and rinsed",
    "1 (6 ounce) can marinated quartered artichoke hearts, drained",
    "1/3 cup green olives, pitted and roughly chopped",
    "1/4 cup basil, roughly chopped"
  ],
  "__v": 1
}