{
  "hash": "09cbfe7b479d653cc39d4d6e8c3d046c5ccd053a",
  "title": "GUATEMALAN CHICKEN STEW WITH TOMATILLO SAUCE",
  "image": "http://www.wholefoodsmarket.com/sites/default/files/styles/header_recipe/public/media/2388.jpg?itok=dK8VMQNF",
  "href": "http://www.wholefoodsmarket.com/recipe/guatemalan-chicken-stew-tomatillo-sauce",
  "extension": "Chrome",
  "firstAdded": "2017-07-03T22:53:56.657000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Put 6 cups water, tomatillos, chicken, jalapeños and salt into a large pot and bring to a boil. Reduce heat to medium low and simmer until tomatillos and jalapeños are tender and chicken is cooked through, about 25 minutes. Drain, reserving broth, and set aside chicken, tomatillos and jalapeños.",
    "Meanwhile, heat oil in a large skillet over medium heat. Add cilantro, green onions, garlic and bell pepper and cook until softened and golden brown, about 10 minutes; transfer to a blender. Add pumpkin seeds, sesame seeds, tortillas, 3 cups of the reserved broth, tomatillos and jalapeños (seeded first, if you like) and carefully purée until smooth; work in batches, if needed. (Reserve remaining broth for another use.)",
    "Transfer contents of blender to a large pot and bring to a boil. Reduce heat to medium low and simmer until thickened, about 10 minutes. Meanwhile, discard bones from chicken and shred meat. Transfer to pot with sauce and simmer for 10 minutes more. Ladle into bowls, garnish with cilantro and serve."
  ],
  "ingredients": [
    "0",
    "1 pound tomatillos, husked and rinsed",
    "4 bone-in, skinless chicken thighs (about 1 1/2 pounds)",
    "2 bone-in, skinless chicken breasts (about 1 1/2 pounds)",
    "1 jalapeño peppers, halved lengthwise",
    "1 tablespoon extra-virgin olive oil",
    "1/2 cup fresh cilantro, roughly chopped, plus more for garnish",
    "6 green onions, trimmed and roughly chopped",
    "3 cloves garlic, roughly chopped",
    "1 green bell pepper, seeded and roughly chopped",
    "1/2 cup pumpkin seeds (pepitas), toasted",
    "1/4 cup sesame seeds, toasted",
    "2 (8-inch) corn tortillas, torn into pieces",
    "1/2 teaspoon fine sea salt"
  ],
  "__v": 1
}