{
  "hash": "18a4f84987390530be14f4348dcdb056aac8756d",
  "title": "Kale, Black Bean and Avocado Burrito Bowl",
  "image": "https://cookieandkate.com/images/2013/06/kale-black-bean-burrito-bowl-recipe.jpg",
  "href": "https://cookieandkate.com/2013/kale-black-bean-and-avocado-burrito-bowl/",
  "extension": "Firefox",
  "firstAdded": "2018-10-02T05:16:57.372000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cook the rice: Bring a big pot of water to a boil, dump in rinsed brown rice and boil, uncovered, for 30 minutes. Turn off the heat, drain the rice and return it to the pot. Cover and let the rice steam in the pot for 10 minutes, then fluff the rice with a fork and season with ¼ teaspoon salt, or more to taste.",
    "Make the kale salad: Whisk together the lime juice, olive oil, chopped jalapeño, cumin and salt. Toss the chopped kale with the lime marinade in a mixing bowl.",
    "Make the avocado salsa verde: In a food processor or blender, combine the avocado chunks, salsa verde, cilantro and lime juice and blend well.",
    "Warm the beans: In a saucepan, warm 1 tablespoon olive oil over medium-low heat. Sauté the shallot and garlic until fragrant, then add the beans, chili powder and cayenne pepper. Cook until the beans are warmed through and softened, stirring often, about 5 to 7 minutes. If the beans seem dry at any point, mix in a little splash of water.",
    "To serve, spoon generous portions of rice, beans and kale salad into a bowl along with a couple spoonfuls of avocado salsa verde. Garnish with chopped cherry tomatoes."
  ],
  "ingredients": [
    "0",
    "Brown rice",
    "1 cup brown rice, rinsed (short grain/arborio or long grain/basmati recommended)",
    "¼ teaspoon salt",
    "Lime marinated kale",
    "1 bunch curly kale, ribs removed and chopped into small, bite-sized pieces",
    "¼ cup lime juice",
    "2 tablespoons olive oil",
    "½ jalapeño, seeded and finely chopped",
    "½ teaspoon cumin",
    "¼ teaspoon salt",
    "Avocado salsa verde",
    "1 avocado, pitted and sliced into big chunks",
    "½ cup mild salsa verde (any good green salsa will do)",
    "½ cup fresh cilantro leaves (a few stems are ok)",
    "2 tablespoons lime juice",
    "Seasoned black beans",
    "2 cans black beans, rinsed and drained (or 4 cups cooked black beans)",
    "1 shallot, finely chopped (or ⅓ cup chopped red onion)",
    "3 cloves garlic, pressed or minced",
    "¼ teaspoon chili powder",
    "¼ teaspoon cayenne pepper (optional)",
    "Garnish",
    "Cherry tomatoes, sliced into thin rounds",
    "Hot sauce (optional)"
  ],
  "__v": 1
}