{
  "hash": "23ca10dcbdb489ef0290681b2013588cff9ff02f",
  "title": "Skillet Hot Honey Chicken With Hearty Greens",
  "image": "https://static01.nyt.com/images/2018/11/27/dining/as-hot-honey-chicken-thighs/as-hot-honey-chicken-thighs-articleLarge-v2.jpg",
  "href": "https://cooking.nytimes.com/recipes/1019790-skillet-hot-honey-chicken-with-hearty-greens?te=1&nl=cooking&emc=edit_fwd_20190927?campaign_id=90&instance_id=12693&segment_id=17405&user_id=4264688f24592aeeb06433e5d96d7150&regi_id=7985911420190927",
  "extension": "Firefox",
  "firstAdded": "2019-09-27T20:39:31.045000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Pat the chicken thighs dry with a paper towel, then season both sides with salt and pepper. Drizzle the olive oil into a large skillet, then add the chicken thighs skin side down.",
    "Set over medium heat and cook, without moving them, until the skin is crisp and deep golden brown, about 15 minutes. If you can’t stand leaving the chicken untouched for this long, use your tongs to press the chicken down into the pan, which promotes even browning.",
    "Flip the thighs over and swirl the chile into the rendered chicken fat. Cook until the meat is cooked through, about 10 minutes.",
    "Meanwhile, stem and tear the hearty greens into big bite-size pieces. In a big bowl, toss them with salt and pepper.",
    "Transfer the chicken to serving plates, leaving the fat in the pan. Off the heat, stir the honey and vinegar into the fat until the honey’s melted and everything’s combined. Dress the greens with enough of the sauce to lightly coat, seasoning with salt and pepper as needed. (Feel free to eat the chile peppers or leave them behind.) Serve the chicken with the salad, spooning more sauce over the chicken and salad as desired."
  ],
  "ingredients": [
    "0",
    "2",
    "pounds bone-in, skin-on chicken thighs (4 to 6 thighs)",
    "Kosher salt and pepper",
    "1",
    "tablespoon extra-virgin olive oil",
    "1",
    "small hot chile, thinly sliced (such as jalapeño, Fresno or serrano), or to taste",
    "1",
    "large bunch or head of hearty greens, such as escarole, mustard greens or kale (about 6 ounces)",
    "2",
    "tablespoons honey",
    "1",
    "tablespoon apple cider vinegar"
  ],
  "__v": 1
}