{
  "hash": "f4d1a4d7197fdf029feb5a3a9082f4ff614e3918",
  "title": "Roasted Chicken with Clementines",
  "image": "http://www.alexandracooks.com/wp-content/uploads/2013/12/11658775675_4e70eaf2bd_b1.jpg",
  "href": "http://www.alexandracooks.com/2013/12/31/roasted-chicken-with-clementines/",
  "extension": "Chrome",
  "firstAdded": "2015-11-01T15:56:20.472000",
  "users": [
    null
  ],
  "keywords": [
    "arak",
    "ouzo",
    "pernod",
    "olive",
    "oil",
    "squeezed",
    "orange",
    "clementine",
    "juice",
    "lemon",
    "grainy",
    "mustard",
    "light",
    "brown",
    "sugar",
    "honey",
    "kosher",
    "salt",
    "pepper",
    "bonein",
    "skinon",
    "chicken",
    "pieces",
    "thighs",
    "drumsticks",
    "nice",
    "clementines",
    "unpeeled",
    "sprigs",
    "thyme",
    "medium",
    "onions",
    "fennel",
    "bulbs",
    "lengthwise",
    "quarters",
    "seeds",
    "lightly",
    "omitted",
    "unsure",
    "maybe",
    "use",
    "lot"
  ],
  "directions": [
    "0",
    "In a large mixing bowl, whisk together arak, oil, orange and lemon juices, mustard, brown sugar and salt. Season with pepper, to taste. • If roasting immediately: Place chicken skin side up in large roasting pan with clementine slices, thyme sprigs, onion pieces (or fennel wedges) and crushed fennel seeds (if using). Pour sauce over top and gently toss everything together with your hands.• If you are marinating: Place chicken with clementine slices, thyme sprigs, onion pieces (or fennel wedges), and crushed fennel seeds (if using) in a large mixing bowl or ziplock bag. Turn several times to coat. Marinate chicken for several hours or overnight.",
    "Preheat oven to 475 degrees. After 30 minutes, check on the chicken. If the skin is browning too quickly, turn the oven down to 400ºF and continue roasting until the skin is brown and crisp, 20 to 25 minutes longer. I roast the chicken at 475ºF for 45 minutes and at 400ºF for 10 minutes, but every oven is different, so just keep an eye on it. Remove pan from the oven.",
    "Transfer chicken and clementines and onion pieces with juices to a serving platter. Let rest 5 to 10 minutes before serving. Or, proceed to step 4, which I have never done.",
    "Optional: Pour cooking liquid into a small saucepan. Place over medium-high heat, bring to a boil, then simmer until sauce is reduced and you are left with about 1/3 cup. You can degrease by using a spoon to remove some of the fat from top of the sauce. Pour heated sauce over chicken."
  ],
  "ingredients": [
    "0",
    "6 1/2 tablespoons Arak (or Ouzo or Pernod)",
    "1/4 cup olive oil",
    "3 tablespoons freshly squeezed orange (or clementine) juice",
    "3 tablespoons freshly squeezed lemon juice",
    "2 tablespoons grainy mustard",
    "3 tablespoons light brown sugar or honey",
    "2 teaspoons kosher salt",
    "freshly ground pepper",
    "8 bone-in, skin-on chicken pieces (a mix of thighs and drumsticks is nice)",
    "4 clementines, unpeeled, sliced thin",
    "a few sprigs of thyme",
    "2 to 3 medium onions (or fennel bulbs) cut lengthwise and then into quarters",
    "2 1/2 teaspoons fennel seeds, lightly crushed (optional — I omitted; if you are unsure, maybe just use 1 teaspoon — 2.5 seems like a lot)"
  ],
  "__v": 1
}