{
  "hash": "197da18fa3a1a0aa29f9ad91768ce01efa943b0d",
  "title": "Falafel Pie with Cucumber-Tomato Salad",
  "image": "https://purewows3.imgix.net/images/articles/2015_06/purewow_falafel_pie_1.jpg?auto=format,compress&cs=strip",
  "href": "https://www.purewow.com/recipes/Falafel-Pie-with-Cucumber-Tomato-Salad",
  "extension": "Chrome",
  "firstAdded": "2017-08-06T05:47:52.695000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 375°F. Place a 9-inch pie plate on a parchment-lined baking sheet.",
    "MAKE THE CRUST: Unwrap the phyllo dough, but keep it covered with a lightly damp kitchen towel (this will prevent it from drying out and cracking).",
    "Place one sheet of phyllo dough on your work surface. Brush all over with melted butter. Place another sheet of phyllo dough on top of it, and repeat the process. Repeat with the remaining sheets of phyllo dough.",
    "Transfer the layered phyllo dough to the pie plate, allowing the excess to hang over the edge. Cover the crust with a damp paper towel while you prepare the filling.",
    "MAKE THE FILLING: Spread the chile-garlic paste evenly across the base of the crust. Pour the falafel mixture on top, and smooth to make an even layer.",
    "Bake until the crust is golden and the filling is set, 20 to 25 minutes.",
    "MAKE THE TOPPING: While the pie cools, toss the cucumbers with the tomatoes, red onion and olive oil in a medium bowl. Season with salt and pepper.",
    "To serve, slice the pie and serve garnished with the cucumber-tomato topping and 1 tablespoon Greek yogurt and 1 tablespoon feta cheese."
  ],
  "ingredients": [
    "0",
    "CRUST",
    "10 sheets frozen phyllo dough, thawed overnight",
    "8 tablespoons butter, melted",
    "PIE",
    "¼ cup chile-garlic paste (such as Sambal Oelek, available in the international section of most grocery stores)",
    "1 recipe Falafel Patties (prepared through step 2)",
    "TOPPING",
    "1 cup diced cucumber",
    "1 cup quartered cherry tomatoes",
    "½ cup diced red onion",
    "2 tablespoons olive oil",
    "Salt and freshly ground black pepper",
    "½ cup Greek yogurt",
    "½ cup crumbled feta cheese"
  ],
  "__v": 1
}