{
  "__v": 1,
  "directions": [
    "0",
    "On a foil lined baking dish (11x7)- or in a silicone brownie bite pan (with 24 bites)- arrange almonds in a single layer. Set aside.",
    "In a heavy pan, combine butter, margarine, sugar, and salt. Cook over medium-high heat with a wooden spoon until butter melts, stirring constantly. (REALLY STIRRING CONSTANTLY)! Bring mixture to a rolling boil. Continue boiling (AND STIRRING) an additional 5-7 minutes until candy turns the color of almonds (about 300 degrees). Add vanilla extract. Pour over almonds. If using the brownie bite pan, I use a small metal scoop to get toffee into each bite, working quickly!",
    "Cool completely.",
    "When candy is cooled and set (about 2 hours), spread chocolate over top of toffee. Sprinkle generously with ground walnuts. If doing both sides, use only half of the chocolate and walnuts. Allow top to set before flipping over and doing bottom. When set, pop out of silicone pan and store in a airtight containers. OR cut into pieces. ENJOY!",
    "**tip- when I say stirring, I'm talking taking that wooding spoon and whipping it! haha!! I have an electric stovetop and turn my heat on 7...and it remains on 7 through the entire boiling process.",
    "**If you choose to scoop into brownie bite pan vs.pouring into a baking pan, your butter might separate a little bit by the time you get to the 20th scoop! Don't worry about it. I use my scooper to slightly stir as I take a scoop of toffee.",
    "I HOPE this helps!! ENJOY!"
  ],
  "firstAdded": "2014-07-20T19:04:11.525000",
  "hash": "2458095c9650a0dd1004decdd41f0b2c75a8539a",
  "href": "http://www.shugarysweets.com/2012/12/almond-toffee-bites",
  "image": "http://www.shugarysweets.com/wp-content/uploads/2012/12/toffee-685x1024.jpg",
  "ingredients": [
    "0",
    "1/2 cup unsalted butter",
    "1/2 cup margarine",
    "1 cup granulated sugar",
    "1/4 tsp kosher salt",
    "1/2 tsp vanilla extract",
    "12oz milk chocolate, melted",
    "1 cup unblanched whole almonds",
    "1 cup finely ground walnuts"
  ],
  "keywords": [
    "unsalted",
    "butter",
    "margarine",
    "granulated",
    "sugar",
    "kosher",
    "salt",
    "vanilla",
    "milk",
    "chocolate",
    "unblanched",
    "almonds",
    "walnuts"
  ],
  "title": "English Toffee Bites",
  "users": [
    null
  ]
}