{
  "__v": 3,
  "directions": [
    "0",
    "Per la preparazione dello strudel, iniziate dall'impasto: in una ciotola versate la farina setacciata e il sale, poi l'uovo, l'acqua e l’olio.",
    "Cominciate ad impastare energicamente quanto basti per rendere la pasta consistente.",
    "Ungete leggermente il piano di lavoro e impastate brevemente fino ad otterene una consistenza liscia ed elastica.",
    "Quando avrete finito, formate una palla ungetela con dell’olio, copritela con della pellicola trasparente e lasciatela riposare per mezz’ora al fresco.",
    "Intanto mettete a bagno l’uvetta nel rum, o se preferite, in acqua tiepida; in una padella sciogliete 50 gr di burro e quando sfricola tostate il pangrattato.",
    "Mescolate con un cucchiaio di legno perchè non si bruci e lasciatelo dorare qualche minuto, poi spegnete il fuoco e lasciate intiepidire.",
    "Quindi sbucciate le mele, togliendo loro il torsolo, e tagliandole in quattro spicchi e poi a fettine sottili; versate le mele in una ciotola capiente e aggiungete lo zucchero, i pinoli, la scorza di limone grattugiata, un pizzico di cannella e l'uvetta ben scolata e strizzata (gli ingredienti devono rilasciare i loro profumi, ma non devono macerare a lungo perchè lo zucchero non rilasci troppa acqua).",
    "Mettete a fondere il burro in un pentolino a fuoco dolce.",
    "Poi riprendete il panetto di pasta e stendetelo su un canovaccio leggermente infarinato, formando un rettangolo di circa 35x45cm. Spennellate la superficie, tranne i bordi, con poco burro fuso e cospargete con il pangrattato tostato; questo strato servirà per assorbire i succhi che le mele rilasceranno in cottura.",
    "Adagiate sopra di esso il composto con le mele; arrotolate lo strudel dalla parte più lunga, facendo attenzione a non rompere la pasta (potete aiutarvi con il canovaccio sul quale è posizionato); sigillatelo bene anche sui lati, affinché il contenuto non esca durante la cottura.",
    "Poi ponete lo strudel su di una teglia rivestita con carta da forno, con la chiusura rivolta verso il basso e, prima di infornarlo, spennellatelo con il burro fuso. Cuocete lo strudel in forno statico preriscaldato a 200° per circa 40 minuti (se ventilato a 180° per 30 minuti).",
    "A cottura ultimata (24), potete cospargere lo strudel con zucchero al velo e servirlo tiepido e tagliato a fette."
  ],
  "firstAdded": "2014-08-07T12:59:43.685000",
  "hash": "4a049a41893f1a005da809863b91fe20421e9b97",
  "href": "http://ricette.giallozafferano.it/Strudel-di-mele.html",
  "image": "http://ricette.giallozafferano.it/images/ricette/2/240/slide-450.jpg",
  "ingredients": [
    "0",
    "Ingredienti per l'impasto:",
    "Sale - 1 pizzico",
    "Uova - 1 medio-grande",
    "Farina tipo 00 - 125 gr",
    "Acqua tiepida - 25-30 ml",
    "Olio di oliva extravergine - 1 cucchiaio",
    "Ingredienti per il ripieno:",
    "Mele - 750 gr",
    "Zucchero semolato - 60 gr",
    "Cannella in polvere - 1 cucchiaino",
    "Pinoli - 25 gr",
    "Uvetta - 50 gr",
    "Rum - 2 cucchiai",
    "Limoni - la scorza di 1",
    "Burro - 100 gr",
    "Pangrattato - 75 gr"
  ],
  "keywords": [
    "ingredienti",
    "limpasto",
    "sale",
    "pizzico",
    "uova",
    "mediogrande",
    "farina",
    "tipo",
    "acqua",
    "tiepida",
    "olio",
    "oliva",
    "extravergine",
    "cucchiaio",
    "ripieno",
    "mele",
    "zucchero",
    "semolato",
    "cannella",
    "polvere",
    "cucchiaino",
    "pinoli",
    "uvetta",
    "rum",
    "cucchiai",
    "limoni",
    "scorza",
    "burro",
    "pangrattato"
  ],
  "title": "Strudel di mele",
  "users": [
    null
  ]
}