{
  "hash": "7e5b600fee6a319e9be2f62d7a05ddf12150c943",
  "title": "Roasted Red Pepper Pasta Sauce",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2010/10/pasta-red-pepper-sauce.jpg",
  "href": "http://www.simplyrecipes.com/recipes/roasted_red_pepper_pasta_sauce/",
  "extension": "",
  "firstAdded": "2017-07-14T02:19:07.792000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 If you are using jarred peppers, drain away the marinade and soak them in a large bowl of cold water. If you skip this step, the sauce will become too acidic. Soak for 10-15 minutes before proceeding.",
    "2 Heat the olive oil in a pot over medium-high heat. Add the chopped onion and sauté, stirring from time to time, until it is wilted and translucent, about 3 minutes. Sprinkle some salt over the onions as they cook.",
    "3 Add the garlic and sage, mix well, and sauté another minute. Mix in the anchovies, smashing them up, and cook for 1 more minute. Stir in the tomato paste and cook for 2-3 minutes, stirring often, until the paste begins to turn a brick red.",
    "4 Add the red wine and stir well. Turn the heat up to high and let this boil down by half. Stir in the roasted red peppers and turn the heat back down to medium. Let this simmer for 10-20 minutes – it’s pretty forgiving at this point. You just want the peppers to be cooked through and soft.",
    "5 Purée the sauce in a blender. You might need to do this in batches, because you don’t want to fill your blender more than 2/3 up at one time. Purée the sauce, starting with the machine on low for 1-2 minutes to break up the big pieces. Turn off the blender and scrape the sides down. Turn it on again, and starting at the low setting, bring it up to its highest setting. Purée for at least a minute, until smooth.",
    "6 Return the sauce to the pan and heat to medium-low. Taste for salt and add some if needed. Add the cayenne or hot paprika, along with smoked paprika if you have some. If you want, a teaspoon of sugar helps, too, if your peppers are not already sweet enough. Keep the sauce warm while you make the pasta.",
    "7 Make the pasta according to the package instructions, depending on the type of pasta you are using.",
    "8 To serve, drain the cooked pasta and put it into a large bowl. Ladle some sauce over the pasta and mix with tongs to combine. You want to coat all the noodles evenly. Divide into servings. Garnish with some grated cheese and minced fresh sage. Serve with a medium-bodied red wine, or a dry rose."
  ],
  "ingredients": [
    "0",
    "3 Tbsp olive oil",
    "1 onion, chopped",
    "Salt",
    "4 garlic cloves, chopped",
    "1 Tbsp fresh sage, chopped",
    "3-5 anchovies, or 2 teaspoons anchovy paste",
    "2 Tbsp tomato paste",
    "1 1/2 cups red wine",
    "4 cups roasted red peppers (jarred or freshly roasted)",
    "1/4 teaspoon smoked paprika (optional)",
    "1/2 teaspoon cayenne or hot paprika",
    "Grated cheese (parmesan, pecorino, manchego, etc.)",
    "Some minced fresh sage for garnish"
  ],
  "__v": 1
}