{
  "hash": "e87e1b25d60471d4ee0bf34f5da6e0f0ed920a72",
  "title": "Chocolate Peppermint Silk Pie",
  "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/d9d5a5d2fe8646878fd1ba8028941ed7/BFV322685PiesForYourHolidaySeasonFBV4.jpg?output-quality=60&resize=600:*",
  "href": "https://tasty.co/recipe/chocolate-peppermint-silk-pie",
  "extension": "Chrome",
  "firstAdded": "2018-12-28T19:40:02.457000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Ingredients",
    "for 8 servings",
    "eggs",
    "½ cup sugar (100 g)",
    "1 ½ cups water (360 mL)",
    "1 pie crust, prepared",
    "1 teaspoon peppermint extract",
    "oz chocolate, melted (225 g)",
    "115 ½ cup butter, cubed",
    "2 cups whipped cream, plus more for garnish (480 mL)",
    "shaved chocolate, for garnish",
    "crushed peppermint candies, for garnish"
  ],
  "ingredients": [
    "0",
    "Preparation",
    "Preheat the oven to 425˚F (220˚C).",
    "In a medium heat-proof bowl, beat the eggs and sugar with an electric hand mixer until combined.",
    "Add the water to a small pot over low heat and rest the bowl on top. Constantly beat the egg mixture on low speed until it reaches 160˚F (71˚C). Remove the bowl from the heat and stir as it cools.",
    "Lay a prepared pie crust in a 9-inch (23 cm) pie dish. Lay a sheet of parchment paper over crust and place 4 spoons or dried beans in the center, weighing down the crust.",
    "Bake for 15 minutes, until golden brown. Let cool.",
    "Add the peppermint extract and melted chocolate to the egg mixture. Stir until combined.",
    "Gradually beat in the butter until well combined.",
    "Gradually fold in the whipped cream until just incorporated.",
    "Carefully spoon the filling into the prepared pie crust and chill for at least 2 hours.",
    "Garnish with whipped cream, shaved chocolate, and crushed peppermint candies.",
    "Enjoy!",
    "ADVERTISEMENT",
    "Tips",
    "1 of 2",
    "Hanna Sigales",
    "I loooved this recipe! Tastes amazing",
    "3 months ago",
    "Helpful (4)",
    "pinkwaffle",
    "I loved this recipe, but the recipe was kind of confusing. There was no step that said you needed to whip the cream, and if you need sugar. I did not use sugar, I just whipped the heavy cream. It also said that there was 4 tablespoons of butter in the recipe, but a half cup of butter in the video. Personally, the half cup of butter worked for me. Yummy!",
    "1 month ago",
    "Helpful (3)",
    "amburo",
    "I loved this pie, but I did not use any peppermint extract, and I made a homemade braided crust. My family loved it, too! I made it for Thanksgiving.",
    "1 month ago",
    "Helpful (3)",
    "gab.by",
    "Making this pie is so much fun! But a small tip is when heating the egg mixture, be ready because it takes a very long time to do. Otherwise, it is amazing!",
    "3 days ago",
    "Helpful (1)",
    "RELATED RECIPES",
    "Cherry Pie-Filled Cheesecake",
    "Kentucky Derby Pecan Pie Cheesecake",
    "Gooey Custard Cheesecake",
    "Leftover Halloween Candy-Bottom Cheesecake",
    "Baked Alaska",
    "4 Layers 4 Textures, 1 Chocolate Cake",
    "ADVERTISEMENT",
    "MORE LIKE THIS",
    "American",
    "Comfort Food",
    "Desserts",
    "Date Night",
    "Indulgent Sweets",
    "Special Occasion"
  ],
  "__v": 1
}