{
  "hash": "f262ee74f77a9905ef6f2445f07e764a78d5878a",
  "title": "Curry Roasted Vegetable & Lentil Kale Salad",
  "image": "http://cdn.minimalistbaker.com/wp-content/uploads/2017/02/Lentil-Curry-Kale-Salad-SQUARE.jpg",
  "href": "http://minimalistbaker.com/curry-roasted-vegetable-lentil-kale-salad/",
  "extension": "Chrome",
  "firstAdded": "2017-05-02T13:52:46.663000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 375 degrees F (190 C) and line a large baking sheet with parchment paper.",
    "Add carrots to a small mixing bowl with drizzle with 1 Tbsp (15 ml) oil, a pinch each salt and pepper, and 1/2 tsp curry powder. Toss to combine. Then arrange on the baking sheet.",
    "Roast for 12 minutes. In the meantime, add bell pepper and broccoli to the same mixing bowl and drizzle with remaining 1 Tbsp oil, salt, pepper, and 1/2 tsp curry powder. Toss to combine.",
    "Once the carrots reach the 12-minute mark, remove from the oven and increase heat to 400 degrees F (204 C). Add the peppers and broccoli to the pan. Then roast for 10-15 minutes more or until all vegetables are tender and slightly golden brown.",
    "In the meantime, add the kale to a large mixing bowl. In a separate small mixing bowl, add the tahini, lemon juice, maple syrup, and apple cider vinegar and whisk to combine. Thin with water 1 Tbsp (15 ml) at a time until thin and pourable.",
    "Pour dressing over the kale and massage with hands or tongs / serving spoons. Spread the kale over a serving platter or keep in mixing bowl for serving. Top with lentils and set aside.",
    "To make the curry dressing, use the same small mixing bowl from the tahini sauce and add the curry paste, lemon juice, maple syrup, salt, pepper, and oil (optional). Whisk to combine. Then add water until thin and pourable (see photo).",
    "Taste and adjust flavor as needed, adding more lemon juice for acidity, curry paste for intense curry flavor, salt for saltiness, or maple syrup for sweetness. Set aside.",
    "Remove roasted vegetables from the oven and add to the salad and lentils. Top with half of the curry dressing and serve with the remaining curry dressing. Garnish with fresh cilantro (optional).",
    "Enjoy immediately. Store leftovers in the refrigerator up to 3-4 days, though best when fresh."
  ],
  "ingredients": [
    "0",
    "4 carrots, cut into bite-size pieces (~ 2 cups or 156 g)",
    "2 Tbsp (30 ml) avocado or melted coconut oil, divided",
    "Pinch each salt and pepper",
    "1 tsp curry powder (DIY or store-bought), divided",
    "1 red bell pepper, sliced (~1 1/2 cups or 120 g)",
    "1 small head broccoli, chopped (~2 cups or 180 g)",
    "1",
    "1 large bundle kale, stems removed, roughly chopped (~4 cups or 268 g)",
    "3 Tbsp (45 g) tahini",
    "2 Tbsp (30 ml) lemon juice",
    "1 Tbsp (15 ml) maple syrup",
    "1/2 tsp apple cider vinegar",
    "3-5 Tbsp (45-75 ml) water to thin",
    "1 cup cooked (198 g) brown or green lentils*",
    "2",
    "2 Tbsp (30 g) green curry paste (DIY or store-bought)",
    "1 lemon, juiced (~30 ml or 2 Tbsp)",
    "1 Tbsp (15 ml) maple syrup, plus more to taste",
    "Pinch each salt and black pepper",
    "optional: 1 Tbsp (15 ml) olive oil",
    "Water to thin"
  ],
  "__v": 1
}