{
  "hash": "3068e91fafb2e77137c36a8ccf3992b4fe5c5b94",
  "title": "Liu Sha Bao / Chinese Molten Salted Egg Custard Steamed Buns 流沙包",
  "image": "",
  "href": "http://www.bakeforhappykids.com/2014/02/liu-sha-bao-chinese-molten-salted-egg.html",
  "firstAdded": "2015-02-22T06:43:17.150000",
  "users": [
    null
  ],
  "keywords": [
    "makes",
    "buns",
    "extra",
    "custard",
    "fillings",
    "salted",
    "egg",
    "filling",
    "portions",
    "duck",
    "eggs",
    "fully",
    "shelled",
    "use",
    "yolks",
    "unsalted",
    "butter",
    "soften",
    "icing",
    "sugar",
    "dry",
    "milk",
    "cornflour",
    "used",
    "ayam",
    "regular",
    "coconut",
    "adapted",
    "baking",
    "diary",
    "bao",
    "dough",
    "flour",
    "preferably",
    "protein",
    "content",
    "sadly",
    "wasnt",
    "hong",
    "kong",
    "lighthouse",
    "low",
    "selfraising",
    "bleached",
    "suitable",
    "make",
    "steamed",
    "using",
    "self",
    "raising",
    "omit",
    "salt",
    "active",
    "yeast",
    "canola",
    "oil",
    "water",
    "day"
  ],
  "directions": [
    "0",
    "Custard Filling:",
    "Make the filling one day ahead.",
    "Using a fork, mash the salted duck egg yolks into fine crumbs. Using a wooden spoon or an electric mixer, beat butter and icing sugar in medium speed until combined. Lower mixing speed to low and add the remaining ingredients and mix until well-combined.",
    "Refrigerate the custard filling until cold and firm. When firm, use a cookie scoop to scoop out and divide the custard into 12 portions. Place the custard balls on a plate or container (lined with cling wrap for easier removal, optional), freeze it overnight with a cover or cling wrap.",
    "Tip: You can keep any unused filling in the freezer and use them anytime when you make any bao dough.",
    "To make bao dough:",
    "Place the sugar, salt, oil, and water in the bottom of the breadmaker pan. Top with flour (with or without baking powder). Add yeast the last and switch on the machine with \"dough” setting.",
    "If breadmaker is not available, combine all bao ingredients and knead to form a smooth dough (at least 20 mins) and then let it rise for 1 hr.",
    "When the dough is ready, divide into 10 portions. Meanwhile, set water to boil in a steamer.",
    "Flatten the dough pieces with your hands, and place a frozen custard filling ball in the center. Pinch up the sides of the dough to completely enclose the filling.",
    "Place each bao on each paper cup liner or a small piece of baking paper with its seam sides down. Rest the bao in warm mist for 10-15 mins.",
    "Steam baos for about 8-15 mins until done. The steam timing varies if you have multiple layers of baos to steam. The layer that is closest to the direct steam will take 8 mins to cook.",
    "Beware! Please DO NOT over-steam!!! Otherwise, the custard filling will explode out of the bao.",
    "Serve immediately but beware that the molten filling is steaming hot!"
  ],
  "ingredients": [
    "0",
    "Makes 10 buns with 2 extra custard fillings",
    "Salted Egg Custard Filling with custard powder:",
    "Makes 12 portions of filling",
    "3 salted duck eggs, fully cooked, shelled and use egg yolks only",
    "60g unsalted butter, soften",
    "50g icing sugar",
    "30g custard powder",
    "45g dry milk powder",
    "5g cornflour",
    "30ml coconut milk (I used Ayam regular coconut milk)",
    "Salted Egg Custard Filling with NO custard powder (mostly adapted from Baking Diary):",
    "Makes 9 portions of filling",
    "3 salted duck eggs, fully cooked, shelled and use egg yolks only",
    "60g unsalted butter, soften",
    "30g icing sugar",
    "5g cornflour",
    "30g dry milk powder",
    "25ml coconut milk (I used Ayam regular coconut milk)",
    "Bao Dough:",
    "280g flour, preferably with 7-9% protein content",
    "(Sadly, I wasn't able to find any Hong Kong flour when I made these bao and so I used Lighthouse low protein, self-raising bleached flour which is also suitable to make steamed buns.)",
    "1/2 tsp baking powder",
    "(If you are using flour which is NOT self raising, please add this. Otherwise, please omit this.)",
    "1/2 tsp salt",
    "1 1/2 tsp active dry yeast",
    "15g sugar",
    "1 tbsp canola oil",
    "125-140ml water (It was a dry day when I made these and I used 140ml)"
  ],
  "__v": 1
}