{
  "hash": "0fe9f19e4db14e10c08797946ae05cad3850d44b",
  "title": "Jamaican Jerk Pit Chicken (Backyard Style)",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2011/4/29/0/DV0905H_jamaican-jerk-pit-chicken-backyard-style_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/jamaican-jerk-pit-chicken-backyard-style-recipe.html",
  "firstAdded": "2015-01-24T19:45:51.133000",
  "users": [
    null
  ],
  "keywords": [
    "habanero",
    "chile",
    "peppers",
    "pureed",
    "mustard",
    "seeds",
    "rosemary",
    "flatleaf",
    "parsley",
    "basil",
    "thyme",
    "scallions",
    "kosher",
    "salt",
    "coarsely",
    "black",
    "pepper",
    "yellow",
    "orange",
    "juice",
    "lime",
    "cider",
    "vinegar",
    "beer",
    "chickens",
    "martins",
    "barbque",
    "joint",
    "jamaican",
    "jerk"
  ],
  "directions": [
    "0",
    "Blend all the ingredients for the paste together in a blender. Pour into a bowl and cover with plastic wrap. Let sit for 24 hours.",
    "Using a backyard grill, start your charcoal with charcoal chimney (Never use lighter fluid). When all the coals are covered in a fine grey ash, dump them on 1 side of your grill. Using a stick or spatula push all the coals into a pile. Put your grate on the grill.",
    "Chicken:",
    "Open the beer and pour about a quarter of the beer out of each can. Literally rub the chicken cavities and exterior of the chickens with the jerk paste. Carefully put each can of beer into the cavity of the chickens, bring the legs around the can and truss together. Put the chickens on the opposite side of the fire. Sometimes you may need to put a brick or rock on the backside of the chicken to keep it stable and upright. Put the lid on the grill and make sure the vent holes are directly above the chicken to provide adequate drafting of heat and smoke over the bird. Keep the vent holes open all the way.",
    "Cook chickens for 4 to 5 hours at a temperature of 225 degrees F. You will want to rotate the birds a quarter turn every hour and add coals, when needed, to maintain the temperature. Be careful not to add too many coals at once when attempting to bring your temperature back up. You may get it too hot and will have a tough time bringing it back down. Open the lid only when you have to check the temperature.",
    "Remove the chickens from the grill and set aside for 10 minutes. Discard the beer cans and refrigerate the chicken until ready to serve.",
    "Recipe courtesy Patrick D. Martin, owner of Martin's Bar-B-Que Joint in Nolensville, TN."
  ],
  "ingredients": [
    "0",
    "10 habanero chile peppers, pureed",
    "6 tablespoons mustard seeds",
    "4 tablespoons dried rosemary",
    "4 tablespoons chopped fresh flat-leaf parsley",
    "4 tablespoons dried basil",
    "4 tablespoons dried thyme",
    "6 scallions, chopped",
    "2 teaspoons kosher salt",
    "2 teaspoons coarsely ground black pepper",
    "1/2 cup yellow mustard",
    "6 tablespoons orange juice",
    "2 tablespoons lime juice",
    "2 tablespoons cider vinegar",
    "2 cans beer",
    "2 whole chickens, 3 1/2 pounds each",
    "Martin's bar-b-que joint Jamaican jerk paste"
  ],
  "__v": 1
}