{
  "hash": "53c722478378a638fb1381ad0e787f29bb7403c2",
  "title": "Skinny Cheeseburger Salad",
  "image": "http://www.skinnykitchen.com/wp-content/uploads/2015/06/cheeseburger-salad-photo.jpg",
  "href": "http://www.skinnykitchen.com/recipes/skinny-cheeseburger-salad/",
  "extension": "Chrome",
  "firstAdded": "2016-05-02T18:36:03.010000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare the Skinny Thousand Island dressing and refrigerate. Can be made several days in advance. Or use a store bought light Thousand Island or Ranch dressing.",
    "To make burger crumble: In a large, nonstick pan add ground beef and onions. Brown over medium-high heat, about 5 minutes. Stir often, breaking up beef, into a crumble. Once browned, pour into a colander in the sink to drain any fat.",
    "Add browned beef back to pan. Stir in Worcestershire sauce, seasoning salt, and pepper. Reduce heat to low and simmer for 5 minutes. Stir often.",
    "To make one salad: Line a dinner plate with 4 cups lettuce. Top lettuce with ½ cup warm burger crumble. Sprinkle with ½ cup tomatoes (drained). Drizzle 2 tablespoons Thousand Island dressing over salad. Top with 2 tablespoons cheese.",
    "You don’t have to make all 6 salads at once. Pack the burger crumble in individual containers and freeze for more salads in the future.",
    "Makes 6 main course salads. Each serving 1 salad"
  ],
  "ingredients": [
    "0",
    "Ingredients for Thousand Island Dressing:",
    "¾ cup Skinny Kitchen’s Thousand Island Dressing or your favorite light Thousand Island or Ranch dressing",
    "Ingredients for Burger Crumble:",
    "1 pound extra lean ground beef, I used Trader Joe’s (96/4), see shopping tip",
    "1 cup yellow onions, diced",
    "3 tablespoons Worcestershire sauce",
    "½ teaspoon Lawry’s seasoning salt or salt",
    "fresh ground pepper, to taste",
    "Ingredients for Salads:",
    "24 cups romaine lettuce (each salad uses 4 cups)",
    "¾ cup reduced-fat cheddar cheese",
    "3 cups tomatoes, chopped"
  ],
  "__v": 1
}