{
  "hash": "6ee9dd5a0792443dab194cf99ead0be934c8256f",
  "title": "Crispy Smashed Potatoes with Avocado Garlic Aioli",
  "image": "http://cdn.ohsheglows.com/wp-content/uploads/2014/10/crispysmashedpotatoes-1628.jpg",
  "href": "http://ohsheglows.com/2014/10/15/crispy-smashed-potatoes-with-avocado-garlic-aioli/",
  "extension": "Chrome",
  "firstAdded": "2016-02-15T22:22:35.975000",
  "users": [
    null
  ],
  "keywords": [
    "potatoes",
    "yukon",
    "gold",
    "try",
    "red",
    "new",
    "extra",
    "virgin",
    "olive",
    "oil",
    "salt",
    "black",
    "pepper",
    "seasoning",
    "garlic",
    "granules",
    "sprinkling",
    "parsley",
    "avocado",
    "aioli",
    "lemon",
    "juice",
    "soyfree",
    "veganaise",
    "vegan",
    "mayo"
  ],
  "directions": [
    "0",
    "Directions:",
    "Add potatoes into a large pot and cover with water (I do not peel the potatoes). Place on stove top and turn heat to high. When the water starts to boil, reduce heat slightly, and simmer uncovered for 20-25 minutes, until tender.",
    "Preheat oven to 450F when there is about 5 to 10 minutes left of boiling the potatoes.",
    "When potatoes are fork tender, drain in a colander and cool for 10 minutes or so.",
    "Place potatoes on a large lightly greased baking sheet. With the base of a mug or measuring cup, smash or press down on each potato until it's mostly flattened (see photo in post). Some potatoes might break apart a little, but this is totally fine.",
    "Drizzle each potato with about 1 teaspoon of oil and sprinkle on a generous amount of salt and pepper. Finally, sprinkle on some garlic powder.",
    "Roast potatoes in the oven for 25 to 33 minutes until crispy, golden, and browned on the bottom. I roasted the potatoes for 30 minutes as I used fairly large potatoes. Keep an eye on them as cook time will vary. I love to roast these until the skins become golden brown and crispy - they are so delicious to eat!",
    "Meanwhile, prepare the avocado aioli. Add garlic into food processor and process until minced. Now add the rest of the aioli ingredients and process until smooth, scraping down the bowl as needed. Add salt and pepper, to taste.",
    "Remove from oven and sprinkle with chopped fresh parsley, more sea salt, and pepper. Serve immediately with avocado aioli (piped or dolloped on) and watch them go lightening fast!! If you do have any leftovers, they can be reheated in an oven on a baking sheet greased with oil at 400F for 6 to 12 minutes, until warmed throughout."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "For the potatoes:",
    "2 to 2 1/2 pounds Yukon Gold potatoes (or try red or new potatoes)",
    "2 to 3 tablespoons extra virgin olive oil (or oil of choice)",
    "Fine sea salt and freshly ground black pepper, for seasoning",
    "Garlic powder or granules, for sprinkling on top",
    "1/3 to 1/2 cup fresh parsley, minced",
    "Avocado Garlic Aioli:",
    "1 large avocado, halved and pitted",
    "1 large or 2 small garlic cloves",
    "1/2 tablespoon fresh lemon juice, or more to taste",
    "1/4 cup soy-free Veganaise (or vegan mayo of choice)",
    "Fine sea salt and freshly ground black pepper, to taste"
  ],
  "__v": 1
}