{
  "hash": "3200ef21bf7d6a329eac4475ce8dd5f73eeddff2",
  "title": "Lentil Almond Stir-Fry",
  "image": "http://www.101cookbooks.com/mt-static/images/food/lentil_almond_stirfry.jpg",
  "href": "http://www.101cookbooks.com/archives/lentil-almond-stirfry-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T21:41:19.590000",
  "users": [
    null
  ],
  "keywords": [
    "mint",
    "leaves",
    "serrano",
    "chile",
    "pepper",
    "seeded",
    "olive",
    "oil",
    "salt",
    "touch",
    "sugar",
    "honey",
    "agave",
    "nectar",
    "lemon",
    "juice",
    "extravirgin",
    "new",
    "potatoes",
    "pieces",
    "brown",
    "black",
    "lentils",
    "brussels",
    "sprouts",
    "trimmed",
    "almonds",
    "plain",
    "greek",
    "yogurt",
    "thinned",
    "bit",
    "water",
    "salted",
    "dates"
  ],
  "directions": [
    "0",
    "Start by making the mint sauce. Combine the mint leaves, serrano, olive oil, salt, sugar, and lemon juice in a food processor (or blender). Give it a few pulses, just enough for the mint to break down a bit. Taste, adjust for your tastes (more serrano? salt?) - set aside.",
    "Now cook the potatoes along with a generous splash of olive oil and pinch of salt in a large skillet over medium heat. Cover the skillet and let the potatoes cook through, this will take five minutes or so. The water in the potatoes will help steam and soften them. When the potatoes are just cooked through (not mushy or falling apart) remove the lid and give them a good toss. Turn up the heat to medium-high and stir every minute or so (a spatula helps) until the potatoes look a bit golden. Stir in the lentils, and cook until heated through. Turn the potatoes and lentils out onto a large plate and set aside.",
    "Now cook the brussels sprouts using the same pan. Heat another splash of olive oil in the skillet over medium heat. Don't overheat the skillet, or the outsides of the brussels sprouts will cook too quickly. Place the sprouts in the pan (single-layer), sprinkle with a pinch of salt, cover, and cook for a few minutes; the bottoms of the sprouts should only show a hint of browning. Cut into or taste one of the sprouts to gauge whether they're tender throughout. If not, cover and cook for another minute or two. Once just tender, uncover, turn up the heat, and cook until the flat sides are deep brown and caramelized.",
    "Add the lentils and potatoes back to the skillet and add most of the sliced almonds. Turn out onto a large platter and drizzle with some of the yogurt and mint sauce*. Top with the remaining almonds and the chopped dates.",
    "Serves 2-3."
  ],
  "ingredients": [
    "0",
    "Mint sauce (optional)",
    "1 cup fresh mint leaves",
    "1/2 serrano chile pepper, de-veined and seeded",
    "2 tablespoons olive oil",
    "pinch of salt",
    "a touch of sugar, or honey, or agave nectar",
    "1 tablespoon lemon juice",
    "extra-virgin olive oil",
    "6 to 8 very small new potatoes, cut into 1/2 pieces",
    "2 cups cooked brown or black lentils",
    "12 brussels sprouts, trimmed and quartered",
    "1/4 cup sliced almonds, toasted",
    "1/3 cup plain Greek yogurt, thinned out with a bit of water, and salted with a pinch of salt",
    "2 dates, pitted and chopped"
  ],
  "__v": 1
}