{
  "hash": "7ae2e9df28b276a04fd7e605e438286d5dcb2f19",
  "title": "Roasted Cauliflower Salad",
  "image": "http://toriavey.com/images/2012/06/Italian-Roasted-Cauliflower-Salad-1-640x480.jpg",
  "href": "http://toriavey.com/toris-kitchen/2012/06/italian-roasted-cauliflower-salad/",
  "extension": "Chrome",
  "firstAdded": "2017-06-21T11:28:00.465000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place a rack in the center of your oven and preheat to 220C. Line a baking sheet with aluminum foil for easier cleanup, if desired.",
    "Pull the leaves off of the cauliflower base. Cut off the lower part of the stem. Cut the head of cauliflower into four quarters. Slice each quarter into 6-8 pieces. You want as many flat surfaces as possible on each floret -- the flat surfaces caramelize best.",
    "Give all the florets a thorough rinse in a colander. Shake them dry. Place the florets in a large bowl and drizzle them with 1 tbsp olive oil.",
    "Spread the florets out in an even layer on the baking sheet. Reserve any small bits of cauliflower that have fallen away from the florets in a small bowl. Sprinkle the cauliflower florets lightly with pepper.",
    "Place the baking sheet into the preheated oven and let the cauliflower roast for 10 minutes. While cauliflower is roasting, prep your other ingredients-- chop the parsley, juice the lemon, etc.",
    "After 10 minutes, remove the baking sheet from the oven. Use tongs to turn over the florets, making sure that the florets with flat surfaces are pressed directly against the baking sheet. This will enhance caramelization. Sprinkle the reserved cauliflower bits onto the baking sheet. Toss in the chopped garlic.",
    "Return the baking sheet to the oven. Let the cauliflower roast for 10-20 minutes longer till tender. When it's ready you will be able to pierce it easily with a fork.",
    "Remove the cauliflower from the oven. Spread it out on a large plate or platter and allow to cool.",
    "Throw the room temperature cauliflower into a salad bowl along with the remaining 3 tbsp of olive oil, parsley, chopped olives, capers, lemon juice and red pepper flakes. The red pepper flakes are very spicy, add with care.",
    "Toss gently to combine all ingredients. Season with salt and pepper to taste (I didn't add any salt because the olives and capers are salty, but some might like a touch of salt added to this dish). You can also add more olive oil to taste, if desired.",
    "Serve salad at room temperature. Italians like to serve this salad with warm freshly baked bread and copious amounts of olive oil. Served on its own the way I've described here, it is gluten free, low carb, and heart healthy."
  ],
  "ingredients": [
    "0",
    "1 large head (3 lbs) cauliflower",
    "1/4 cup olive oil, divided",
    "2 cloves garlic, minced",
    "1/4 cup chopped flat leaf parsley",
    "16 pitted Gaeta or Kalamata olives, chopped",
    "3 tbsp capers",
    "1 1/2 tbsp fresh lemon juice",
    "1/4 tsp red pepper flakes, or more to taste",
    "Salt and pepper to taste"
  ],
  "__v": 2
}