{
  "hash": "ccdd362d6d7712ec887c3e3b99eb3bde45fe047a",
  "title": "Lemon Orzo Pasta Salad with Cucumbers and Olives",
  "image": "https://www.inspiredtaste.net/wp-content/uploads/2018/07/Easy-Orzo-Pasta-Salad-Recipe-3-1200.jpg",
  "href": "https://www.inspiredtaste.net/36725/lemon-orzo-pasta-salad/?fbclid=IwAR3yru97FkRRDtK8De3LntTdgGeW_NGsxrYRr0_KQG57enkQPZyGuxeBQVI",
  "extension": "Chrome",
  "firstAdded": "2019-06-05T17:54:11.307000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "Bring a large saucepan of salted water to a boil. Add orzo and cook until tender, 6 to 10 minutes (check box for actual cook time). Drain.",
    "While the orzo cooks, in a large bowl, whisk the oil, mustard, honey, lemon zest, lemon juice, 1/2 teaspoon of salt, and 1/4 teaspoon pepper. Add the drained orzo to the dressing and mix well.",
    "Stir in the cucumber, tomato, herbs, olives and artichokes. Taste for seasoning and adjust with salt and/or pepper as needed. Enjoy warm or cover then refrigerate until cool, about 1 hour.",
    "ADAM AND JOANNE'S TIPS",
    "If you cannot find orzo pasta, you may substitute with any small pasta shape, quinoa or couscous.",
    "Make-Ahead: This salad is delicious when eaten straight away, but you can also make the salad, cover it and refrigerate for up to 4 hours. This way all the flavors marry and mingle, making for an even more delicious salad. If you are planning to make a day or two ahead of time, keep the tomatoes separate until you’re ready to serve. This way they will remain crisp.",
    "If you use marinated artichokes sold in oil, you can substitute some of the olive oil called for in the recipe above with the oil in the jar."
  ],
  "ingredients": [
    "0",
    "1 1/2 cups (8 ounces) dried orzo pasta",
    "Salt and fresh ground black pepper",
    "1/4 cup extra-virgin olive oil",
    "1 teaspoon Dijon mustard",
    "1/2 teaspoon honey",
    "1 teaspoon finely grated lemon zest",
    "2 to 4 tablespoons fresh squeezed lemon juice, depending on taste",
    "1 medium English cucumber, diced",
    "1 large tomato, diced or 8 ounces halved cherry tomatoes",
    "1/2 cup coarsely chopped fresh herbs; use any combination of fresh parsley, cilantro, basil, dill or mint",
    "1/2 cup pitted olives, halved",
    "1 cup canned or jarred and drained artichoke hearts, chopped, see notes"
  ],
  "__v": 1
}