{
  "hash": "e98bc52647c512a14562e168ab145d6bad26ba6d",
  "title": "Easy Blueberry Cream Scones",
  "image": "",
  "href": "https://www.bonappetit.com/recipe/easy-blueberry-cream-scones",
  "extension": "Chrome",
  "firstAdded": "2020-04-03T15:02:24.828000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place a rack in upper third of oven; preheat to 400°. Finely grate zest of 1 lemon with a microplane into a large bowl. Add ⅓ cup sugar and massage with your fingertips until mixture looks like wet sand and is very fragrant. Set aside remaining lemon for another use.",
    "Add 2 cups flour, 1 cup oats, 2½ tsp. baking powder, and ½ tsp. salt to bowl with sugared zest. Whisk to combine.",
    "Whisk 1⅓ cups cream and 2 Tbsp. honey in a medium bowl until combined.",
    "Slowly drizzle cream mixture into flour mixture, tossing with a fork to disperse liquid and hydrate flour. Stop mixing when you still have a few dry spots.",
    "Add 1 cup blueberries and fold mixture with a rubber spatula, taking care only to mix until blueberries are distributed throughout and you have a sticky dough. It’s okay if some of the blueberries bleed or get broken up.",
    "Dust countertop liberally with more flour and turn out dough. Pat down into a 1\"-thick square, flouring hands lightly to prevent sticking as you work.",
    "Mix 1 egg yolk and remaining 1 Tbsp. cream with a pastry brush in a small bowl. Brush yolk mixture all across surface of dough.",
    "Sprinkle remaining 2 Tbsp. oats and 2 Tbsp. sugar over.",
    "Using a knife or metal bench scraper, cut dough into 4 quadrants, then cut each quadrant in half diagonally so you have 8 triangles.",
    "Transfer each triangle to a large parchment-lined rimmed baking sheet, spacing evenly.",
    "Bake scones on upper rack until tops are lightly golden all over and bottoms are golden brown, 15–20 minutes. Let cool on baking sheet. Serve warm.",
    "Do Ahead: Scones are best made the same day. Rewarm slightly in microwave or oven, if needed."
  ],
  "ingredients": [
    "0",
    "1 lemon",
    "⅓ cup plus 2 Tbsp. sugar",
    "2 cups all-purpose flour, plus more for dusting",
    "1 cup plus 2 Tbsp. old-fashioned oats",
    "2½ tsp. baking powder",
    "½ tsp. kosher salt",
    "1⅓ cups plus 1 Tbsp. chilled heavy cream",
    "2 Tbsp. honey",
    "1 cup frozen blueberries, preferably wild",
    "1 large egg yolk"
  ],
  "__v": 1
}