{
  "__v": 1,
  "directions": [
    "0",
    "Preheat your oven to 325 degrees F. Grease your springform pan with a little oil and line the base with parchment paper.",
    "Measure and sift the cocoa powder into a bowl or pitcher and whisk in the boiling water until you have a smooth, chocolatey, still runny (but only just) paste. Whisk in the vanilla extract, then set aside to cool a little.",
    "In another smallish bowl, combine the almond meal (or all-purpose flour) with the baking soda and pinch of salt.",
    "Put the sugar, olive oil, and eggs into the bowl of a freestanding mixer with the paddle attachment (or other bowl and whisk arrangement of your choice) and beat together vigorously for about 3 minutes, until you have a pale-primrose, aerated, and thickened cream.",
    "Turn the speed down a little and pour in the cocoa mixture, beating as you go, and when all is scraped in, you can slowly tip in the almond meal (or all-purpose flour) mixture.",
    "Scrape down, and stir a little with a spatula, then pour this dark, liquid batter into the prepared pan. Bake for 40-45 minutes or until the sides are set and the very center, on top, still looks slightly damp. A cake tester should come up mainly clean but with a few sticky chocolate crumbs clinging to it.",
    "Let it cool for 10 minutes on a wire rack, still in its pan, and then ease the sides of the cake with a small metal spatula and spring it out of the pan. Leave to cool completely or eat while still warm with some ice cream, as a dessert."
  ],
  "firstAdded": "2014-05-10T01:57:21.619000",
  "hash": "0cbe07f265d964632d6feb5b479d9bec9094bf6d",
  "href": "http://www.cookingchanneltv.com/recipes/nigella-lawson/chocolate-olive-oil-cake.html",
  "image": "http://cook.sndimg.com/content/dam/images/cook/fullset/2013/2/19/0/CC_Nigella-Chocolate-Cake_s3x4.jpg/jcr:content/renditions/cq5dam.web.266.354.jpeg",
  "ingredients": [
    "0",
    "2/3 cup regular olive oil, plus more for greasing",
    "6 tablespoons good-quality unsweetened cocoa powder, sifted",
    "1/2 cup boiling water",
    "2 teaspoons best vanilla extract",
    "1 1/2 cups almond meal (flour) or 3/4 cup plus 1 tablespoon all-purpose flour",
    "1/2 teaspoon baking soda"
  ],
  "keywords": [
    "regular",
    "olive",
    "oil",
    "greasing",
    "goodquality",
    "cocoa",
    "sifted",
    "boiling",
    "water",
    "best",
    "vanilla",
    "almond",
    "meal",
    "allpurpose",
    "flour",
    "baking",
    "soda"
  ],
  "title": "Chocolate Olive Oil Cake",
  "users": [
    null
  ]
}