{
  "hash": "3ac045c1885e8c0592c2edf8e40457a0edfeaab8",
  "title": "Texas Style Chili",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/texas-style-chili-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2017-01-05T20:31:24.480000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "*NOTE: When working with chile peppers, always wear rubber gloves and be careful not to touch your eyes or skin. Wash all utensils and cutting surfaces well with hot, soapy water before proceeding.",
    "In a large heavy pot (such as a cast iron Dutch oven), heat the fat or oil over high heat. Add the meat and sear, stirring, until no longer pink. Lower the heat to medium-high. Add the onions, jalapenos, garlic, chiles, and chili powder, and cook, stirring constantly, until the onions are wilted and start to color, 4 to 5 minutes. Add the cumin, oregano, salt, and pepper, and cook until fragrant, about 20 seconds. Add the tomatoes and cook, stirring, for 1 minute. Add the beer and tequila and cook, stirring, to deglaze the pan. Add the chipotles and adobo sauce and 4 cups of the stock, stir well, and bring to a boil. Reduce the heat and simmer partially covered, stirring occasionally, until the meat is very tender, 2 to 3 hours, adding the remaining cup of stock as needed if the chili becomes too dry or thick. When the meat is tender and the chili is ready, add the masa harina 1 teaspoon at a time to thicken to desired consistency, stirring well and cooking after the addition of each before adding more.",
    "Remove from the heat and correct the seasoning, to taste. Skim any fat from the surface.",
    "Ladle into bowls and garnish each with cilantro, chopped onions, and a dollop of sour cream. Serve with hot cornbread.",
    "Recipe courtesy of Emeril Lagasse, 2003"
  ],
  "ingredients": [
    "0",
    "1/4 cup rendered bacon grease or vegetable oil",
    "3 pound tri-tip or boneless sirloin or chuck roast, cubed",
    "1 large white onion, chopped",
    "3 large jalapeno or serrano peppers, stemmed, seeded and chopped",
    "5 cloves garlic, peeled and crushed",
    "5 New Mexican green or red chiles, roasted, stemmed, seeded and chopped",
    "6 tablespoons chili powder",
    "1 tablespoon ground cumin",
    "2 teaspoons Mexican oregano",
    "2 teaspoons salt",
    "1 teaspoon freshly ground black pepper",
    "2 large tomatoes, peeled, seeded, and chopped",
    "1 (12-ounce) bottle Lone Star or Shiner Bock beer",
    "2 ounces tequila",
    "3 chipotle chiles in adobo, chopped",
    "4 to 5 cups beef stock",
    "1/4 cup to 6 tablespooons masa harina",
    "Chopped fresh cilantro leaves, garnish",
    "Finely chopped white onions, garnish",
    "Sour cream, garnish",
    "Fresh hot cornbread, accompaniment"
  ],
  "__v": 1
}