{
  "hash": "7227feb459ea44c95e78e126fa7dab9b29b6b91f",
  "title": "Butterscotch Meringue Pie with Pecan Crust",
  "image": "http://cdn-image.myrecipes.com/sites/default/files/styles/300x300/public/image/recipes/sl/14/11/butterscotch-meringue-pie-pecan-crust-sl-x.jpg?itok=RxsJ_nce",
  "href": "http://www.myrecipes.com/recipe/butterscotch-meringue-pie-pecan",
  "firstAdded": "2015-01-23T22:35:40.005000",
  "users": [
    null
  ],
  "keywords": [
    "crust",
    "pecans",
    "allpurpose",
    "flour",
    "granulated",
    "sugar",
    "click",
    "savings",
    "cold",
    "butter",
    "pieces",
    "icecold",
    "water",
    "vanilla",
    "wax",
    "paper",
    "parchment",
    "filling",
    "firmly",
    "light",
    "brown",
    "salt",
    "milk",
    "egg",
    "yolks",
    "lightly",
    "meringue",
    "whites",
    "cream",
    "tartar"
  ],
  "directions": [
    "0",
    "Prepare Crust: Pulse pecans in a food processor 10 to 12 times or until finely chopped. Transfer pecans to a small bowl. Pulse 1 1/4 cups flour and 2 Tbsp. granulated sugar in processor 2 or 3 times to combine. Add 1/2-inch butter pieces, and pulse 10 to 12 times or until mixture resembles coarse meal. Add pecans, and pulse 2 or 3 times to combine. With processor running, pour 2 Tbsp. ice-cold water and 1 tsp. vanilla through food chute, and process just until dough comes together. Transfer dough to a lightly floured surface, and shape into a disk. Wrap disk in plastic wrap, and chill 30 minutes.",
    "Preheat oven to 350°. Place dough disk between 2 sheets of lightly floured wax paper, and roll to a 12-inch circle. Fit piecrust into a 9-inch deep-dish pie plate; fold edges under, and crimp. Prick bottom and sides of dough with a fork; line dough with parchment paper, and fill with pie weights or dried beans.",
    "Bake at 350° for 20 minutes. Remove weights and parchment paper, and bake 10 to 12 more minutes or until browned. Cool completely on a wire rack (about 1 hour).",
    "Prepare Filling: Whisk together brown sugar and next 2 ingredients in a medium saucepan. Gradually whisk in milk. Cook over medium heat, whisking constantly, 8 to 9 minutes or until mixture is smooth and begins to thicken.",
    "Gradually whisk about one-fourth of hot sugar mixture into egg yolks; gradually whisk egg yolk mixture into hot sugar mixture, and cook, whisking constantly, 2 to 3 more minutes or until mixture is thick and smooth and just begins to bubble. Remove from heat, and whisk in 1-inch butter pieces and 2 tsp. vanilla. Pour filling into prepared piecrust.",
    "Prepare Meringue: Beat egg whites and next 2 ingredients at high speed with an electric mixer until foamy. Gradually add 6 Tbsp. granulated sugar, 1 Tbsp. at a time, beating until stiff peaks form and sugar dissolves. Spread meringue over hot filling, sealing edges.",
    "Bake at 350° for 10 to 12 minutes or until golden brown. Remove from oven to a wire rack, and cool completely (about 2 hours). Chill 4 to 6 hours before serving."
  ],
  "ingredients": [
    "0",
    "CRUST",
    "1/2 cup chopped pecans",
    "1 1/4 cups all-purpose flour",
    "2 tablespoons granulated sugar $Click to see savings",
    "1/2 cup cold butter, cut into 1/2-inch pieces $Click to see savings",
    "2 tablespoons ice-cold water $Click to see savings",
    "1 teaspoon vanilla extract",
    "Wax paper",
    "Parchment paper",
    "FILLING",
    "2 cups firmly packed light brown sugar $Click to see savings",
    "2/3 cup all-purpose flour",
    "1/2 teaspoon table salt $Click to see savings",
    "2 1/2 cups milk $Click to see savings",
    "6 egg yolks, lightly beaten $Click to see savings",
    "1/2 cup butter, cut into 1-inch pieces",
    "2 teaspoons vanilla extract",
    "MERINGUE",
    "6 large egg whites $Click to see savings",
    "1 teaspoon vanilla extract",
    "1/4 teaspoon cream of tartar",
    "6 tablespoons granulated sugar $Click to see savings"
  ],
  "__v": 1
}