{
  "__v": 1,
  "directions": [
    "0",
    "Using a paring knife or other small knife, cut around the stem to remove it from the pepper and discard.",
    "Cut the pepper in half and cut out any leftover seeds or membrane.",
    "Preheat the oven to 350 degrees F.",
    "In a large, heavy bottomed skillet over medium-high heat, add a drizzle of canola oil. Once the oil is hot, add in the ground turkey, breaking it apart as it browns.",
    "Once the turkey browns, drain off any excess liquid. Add in the Sloppy Joe sauce, cook for 2 minutes, and then cover and reduce heat to low.",
    "Spray a large, oven-safe dish with nonstick cooking spray and place in the peppers, cut side up. Bake for 10-15 minutes, or until slightly softened.",
    "Divide the Sloppy Joe turkey meat evenly among the pepper halves. Bake again for 15 minutes.",
    "Top each pepper half with a slice of cheese and bake one last time, for 5 minutes or until the cheese has completely melted.",
    "Garnish with parsley or green onion, if you'd like, and serve with brown rice."
  ],
  "firstAdded": "2014-09-21T22:44:57.078000",
  "hash": "86c26a55263a6e7b2121abca5b983466e3f84a97",
  "href": "http://hostthetoast.com/moms-sloppy-joe-stuffed-peppers/",
  "image": "http://hostthetoast.com/wp-content/uploads/2014/07/Moms-Sloppy-Joe-Stuffed-Peppers-5.jpg",
  "ingredients": [
    "0",
    "3 bell peppers (I prefer red, orange, and yellow)",
    "1 lb lean ground turkey",
    "1 can Sloppy Joe sauce (we use Hunt's Manwich)",
    "1 tablespoon canola oil",
    "Salt and pepper, to taste",
    "6 slices colby jack or cheddar cheese",
    "Parsley or green onion, chopped, to garnish (optional)",
    "Brown rice, cooked, to serve (optional)"
  ],
  "keywords": [
    "bell",
    "peppers",
    "prefer",
    "red",
    "orange",
    "yellow",
    "lean",
    "turkey",
    "sloppy",
    "joe",
    "use",
    "hunts",
    "manwich",
    "canola",
    "oil",
    "salt",
    "pepper",
    "slices",
    "colby",
    "jack",
    "cheddar",
    "cheese",
    "parsley",
    "green",
    "onion",
    "brown",
    "rice",
    "serve"
  ],
  "title": "Mom's Sloppy Joe Stuffed Peppers",
  "users": [
    null
  ]
}