{
  "hash": "d669a3c290b4a4afa17c3047d9d450e01af1e452",
  "title": "Chicken Teriyaki Chow Mein",
  "image": "http://recipe-folder.com/img/recipe-images/083/745/1164888283.jpg",
  "href": "https://tasty.co/recipe/chicken-teriyaki-chow-mein",
  "extension": "Chrome",
  "firstAdded": "2019-03-21T00:14:07.296000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium bowl, season the cubed chicken with salt and pepper. Add ¼ cup (of 60 ml) teriyaki sauce and mix until the chicken is well-coated. Cover with plastic wrap and marinate in the refrigerator for 30 minutes to 1 hour.",
    "In a wok or deep skillet over medium-high heat, heat 2 tablespoons of cooking oil, then add the par-cooked noodles. Cook for 1-2 minutes, allowing the noodles to crisp, then flip and cook for another 1-2 minutes. Transfer to a plate and set aside.",
    "In the same wok, heat 1 tablespoon of cooking oil, then add the chicken. Cook for 3-4 minutes, until browned on one side, then stir and cook for another 3-4 minutes, until fully cooked through. Set the chicken aside.",
    "In the same wok, add 1 tablespoon of oil, the onion, and carrot. Cook for 2-3 minutes, or until the onions are translucent. Add the broccoli and cabbage. Stir and cook for 1-2 minutes, then season with salt and pepper and cook for 3 minutes more, until the vegetables are soft.",
    "Add the cooked chicken and crispy noodles back to the wok, along with the remaining ¼ cup (60 ml) teriyaki sauce. Toss well and cook for 2-3 minutes, until everything is well-combined. Garnish with sesame seeds.",
    "Enjoy!"
  ],
  "ingredients": [
    "0",
    "1 lb chicken breast, cubed (455 g)",
    "salt, to taste",
    "pepper, to taste",
    "½ cup teriyaki sauce, divided (120 mL)",
    "4 tablespoons cooking oil, divided",
    "6 oz chow mein noodle, hong kong style pan fried noodles, par cooked according to package instructions (180 g)",
    "¾ cup onion, sliced",
    "½ cup carrot, julienned (60 g)",
    "1 cup broccoli floret (150 g)",
    "1 cup cabbage (100 g)",
    "sesame seeds, for garnish"
  ],
  "__v": 2
}