{
  "hash": "9a1ab8360b0f48970027dab675fd029e906fb28b",
  "title": "Eggplant Rollups with Black Bean-Potato Stuffing",
  "image": "http://i0.wp.com/www.veganrunnereats.com/wp-content/uploads/2015/07/Vegan-Eggplant-Rollups-with-Black-Bean-Potato-Filling-recipe-approved-by-Dr.-Michael-Greger.png?resize=660%2C466",
  "href": "http://www.veganrunnereats.com/338/eggplant-rollups-with-black-bean-potato-stuffing/",
  "extension": "Chrome",
  "firstAdded": "2016-06-14T00:15:03.883000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Slice eggplant lengthwise into 1/3 to 1/4 inch-thick slices. Sprinkle salt on both sides of each slice, put all slices in a bowl, and let sit for 15-20 min, until eggplant slices release their bitter juices. Most of the salt will be wiped away later.",
    "Meanwhile, preheat the oven to 400°F. Pat each slice dry with paper towels to absorb the bitter juices and salt. Lightly spray both sides of each eggplant slice with cooking spray. Arrange slices on a cookie sheet.",
    "Bake in the oven for 15 min, then flip each slice and bake for another 5-10 min, until eggplant is soft. It doesn't need to be completely done at this point, just soft enough to roll up. Remove eggplant from the stove and set aside to cool. Reduce the heat of the oven to 375°F.",
    "Alternatively, you can grill eggplant for about 5 min per side.",
    "If you have a steamer or a pan equipped with a steamer insert (kind of like a colander), set it up on stovetop and steam cubed potatoes until they are soft, about 10-15 min. If you don't have a steamer, boil potatoes until done, drain and set aside.",
    "Meanwhile, heat 1-2 Tbsp of water or vegetable broth in a nonstick pan on medium heat. When the liquid is bubbling, add chopped onions and saute them for 5 min until soft, stirring occasionally. Add minced garlic and saute for 30 seconds. Add sliced bell pepper, saute for 3 min.",
    "Add drained and rinsed black beans along with oregano, thyme, sage, and paprika. Stir well and let the beans heat through, about 3 min. Add steamed or boiled potatoes, stir the mixture breaking up potatoes slightly.",
    "Put the potato-bean mixture into a large bowl, add nutritional yeast, mix well and taste. If you prefer a saltier taste, add low sodium soy sauce.",
    "Add 1-2 Tbsp of marinara sauce to the bottom of an ovenproof baking dish (I used an 8 by 8-inch Pyrex glass pan).",
    "Take a slice of baked eggplant, put a large spoonful (about 1/3 cup or more) of potato-bean stuffing on one end of the slice, and cover it with the remaining part of the slice. Ideally, the ends just need to touch. If they overlap, you may add more stuffing; if they don't touch, remove some. Put your rollup into the baking dish with the seam facing down.",
    "Proceed with the rest of the eggplant pieces. You may have some extra stuffing left if your eggplant wasn't big enough.",
    "Once all of the rollups are in the baking dish, pour the rest of marinara sauce over them, spreading to cover all rollups evenly.",
    "Bake uncovered for 20 min at 375°F. Once done, let cool for 5-10 min before serving."
  ],
  "ingredients": [
    "0",
    "1 LARGE eggplant",
    "1 cup prepared marinara sauce (or more, to taste), preferably with no oil added",
    "2-3 medium potatoes, cut into 1-inch dice (about 1 1/2 cups cubed)",
    "1 medium onion, sliced",
    "3 garlic cloves",
    "1/2 yellow or orange bell pepper, sliced into 1-inch-long strips",
    "1 can black beans, drained and rinsed",
    "Low sodium soy sauce, to taste if needed",
    "1 Tbsp oregano",
    "1/2 Tbsp thyme",
    "1/4 Tbsp sage",
    "1/2 Tbsp paprika",
    "2 Tbsp nutritional yeast"
  ],
  "__v": 1
}