{
  "hash": "99e901246a989e10405f78fefdb1fc6129155f1d",
  "title": "Classic Tiramisu",
  "image": "http://www.fnstatic.co.uk/images/content/recipe/classic-tiramisu.jpg ",
  "href": "http://www.foodnetwork.co.uk/recipes/extra-virgin-tiramisu.html",
  "extension": "Chrome",
  "firstAdded": "2015-12-10T13:26:26.387000",
  "users": [
    null
  ],
  "keywords": [
    "salt",
    "cocoa",
    "shaved",
    "dark",
    "chocolate",
    "shots",
    "rum",
    "italian",
    "marsala",
    "sugar",
    "coffee",
    "mascarpone",
    "cheese",
    "eggs",
    "separated",
    "savoiardi",
    "biscuits",
    "brewed",
    "cooled"
  ],
  "directions": [
    "0",
    "Method",
    "First prepare the coffee and pour it in a bowl and allow to cool off, add 2 tablespoons sugar or sweeten to taste.",
    "Mix the egg yolks with 45g sugar, and mix until you obtain a creamy light mixture. Work the mascarpone in a bowl using a wooden spoon, making sure you eliminate any lumps, then add the mascarpone to the sugar-egg mixture and continue to mix well.",
    "In a separate bowl, mix the egg whites, pinch of salt, and the remaining sugar, until they reach a somewhat firm, but fluffy consistency, then add them to the mascarpone mixture. Stir in the rum, if using.",
    "Dip the savoiardi biscuits in the coffee, and one by one lay them flat into a 7 by 11 pyrex tray, making sure you do not soak the biscuits, as you want to make sure they maintain their firmness. Once the first layer of biscuits has been laid out, spread a layer of the mascarpone cream on top, and dust with 1 tablespoon cocoa powder.",
    "Now, again, prepare another layer of coffee-dipped biscuits, cream and cocoa powder. Garnish the top of the cake with the shaved dark chocolate.",
    "Cover the tray with plastic wrap and refrigerate for about 3 hours so the flavors can marry and the tiramisu can settle.",
    "Notes:",
    "Cook's Note: Because you are working with raw eggs, it is mandatory that you use the freshest product you can find. Organic, free-range eggs are good enough, unless you have a neighbour with a chicken coup... in that case, get his!",
    "Test the eggs by putting them in a bowl of water: if they fall to the bottom they are fresh and safe, if they come afloat they are ready to be tossed!"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Pinch salt",
    "2 tablespoons unsweetened cocoa powder",
    "40g shaved dark chocolate, to garnish",
    "2 shots rum or Italian Marsala, optional",
    "113g sugar, plus 2 tbsp or more for the coffee",
    "225g mascarpone cheese",
    "5 eggs, separated",
    "400g savoiardi biscuits",
    "720ml brewed coffee, cooled"
  ],
  "__v": 1
}