{
  "hash": "79acdf39342e3a1ad7eea81771ab87179e51fac7",
  "title": "Julia Child's Easy Blender Hollandaise Sauce",
  "image": "http://toriavey.com/images/2012/03/Blender-Hollandaise-8-640x480.jpg",
  "href": "http://toriavey.com/toris-kitchen/2012/03/julia-childs-easy-blender-hollandaise-sauce/",
  "extension": "Firefox",
  "firstAdded": "2016-06-02T09:04:31.881000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "This sauce should be prepared immediately before serving-- it will only take you about 3 minutes to make. Place eggs yolks, salt, pepper, and 1 tbsp lemon juice in the blender jar. You can beat in more lemon juice to taste when your sauce is done, and then you will know which proportion you prefer for next time.",
    "Cut the butter into pieces and place it in a small saucepan. Heat it till it's melted, hot and foamy.",
    "Cover the jar of the blender and blend the egg yolk mixture at top speed for 2 seconds. Uncover, still blending at top speed, and immediately start pouring the hot melted butter in a thin stream of droplets. (You may need to protect yourself with a towel during this operation.)",
    "By the time two thirds of the butter has gone in, the sauce will be a thick cream. Omit the milky residue at the bottom of the pan. Taste the sauce, and blend in more seasonings and lemon juice to taste.",
    "If not used immediately, set the blender jar in tepid (lukewarm), but not warm, water. Use the sauce within a few minutes of blending; it will solidify if not used quickly.",
    "Use hollandaise to top any number of delicious dishes. I like using it to top my Nova Lox Benedict - click here for recipe.",
    "RAW EGG NOTE: This sauce uses uncooked egg yolks. This is not an unusual practice (most Caesar Salad recipes contain uncooked egg), but it does carry a small amount of risk. I've been told that the friction of the blender and the scalding hot butter \"cook\" the egg during emulsion, but to be on the safe side I need to offer this cautionary note - use caution in consuming raw and lightly cooked eggs due to the slight risk of salmonella or other food-borne illness. To reduce this risk, use only fresh, properly refrigerated, clean grade A or AA eggs with intact shells, and avoid contact between the yolks or whites and the shell."
  ],
  "ingredients": [
    "0",
    "3 egg yolks",
    "1/4 tsp salt",
    "Pinch of pepper (I use a small pinch of cayenne)",
    "1-2 tbsp fresh lemon juice (I use closer to 2 tbsp)",
    "1/2 cup unsalted butter"
  ],
  "__v": 1
}