{
  "hash": "82e65014c3960ec6a0e4cfb16e42337423055c72",
  "title": "Caulitatoes",
  "image": "https://gnowfglins-gnowfglins.netdna-ssl.com/blog/wp-content/uploads/2015/12/How-to-Make-No-Fail-Cauli-tatoes-Traditional-Cooking-School-GNOWFGLINS-square-1.jpg",
  "href": "https://traditionalcookingschool.com/food-preparation/recipes/how-to-make-no-fail-cauli-tatoes/?utm_content=buffer8433c&utm_medium=social&utm_source=facebook.com&utm_campaign=buffer",
  "extension": "",
  "firstAdded": "2018-06-25T18:15:28.076000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Makes approximately 3 cups.",
    "Begin by cutting up the head of cauliflower. Remove as much of the stems from the florets as possible. Too much stem in your cauli-tatoes can give them a funky taste.",
    "Then rough-chop the florets to be pea-size or smaller. You could also pulse them a few times in a food processor, but chopping them does the trick and gives you fewer dishes to wash later.",
    "Next, steam the cauliflower. I don’t have a steamer basket, so I use a stock pot with a lid and a stainless steel colander. I put an inch of water in the bottom of my stock pot, place the colander inside the pot, add the cauliflower to the colander, then cover with the lid.",
    "On medium-high heat, steam the cauliflower for 10 to 12 minutes, stirring twice during steaming. The cauliflower pieces should be just fork tender, but not mushy at all.",
    "Transfer the steamed cauliflower to a high-speed blender.",
    "Quickly add butter or ghee, salt, garlic powder, and pepper.",
    "Pulse a couple of times to get the blender going, then blend on low speed for 20 to 30 seconds, until smooth. Don’t over-blend or the cauli-tatoes will be too runny.",
    "If desired, sprinkle with your favorite chopped herbs.",
    "Serve immediately."
  ],
  "ingredients": [
    "0",
    "1 large head fresh cauliflower, stems trimmed and florets roughly chopped",
    "filtered water",
    "3 tablespoons pastured butter or ghee (or other fat of choice, such as tallow or lard)",
    "1 teaspoon sea salt",
    "1 teaspoon garlic powder",
    "1/2 teaspoon black pepper (omit for AIP)",
    "fresh herbs of your choice, such as parsley or chives"
  ],
  "__v": 1
}