{
  "hash": "d8653a2665ce3907e135a520ba289fec0d8401b8",
  "title": "Slow-Cooked Lamb with Puy Lentils",
  "image": "",
  "href": "http://www.waitrose.com/home/recipes/recipe_directory/s/slow_cooked_lamb_with_puy_lentils.html",
  "firstAdded": "2015-01-03T15:20:37.570000",
  "users": [
    null
  ],
  "keywords": [
    "waitrose",
    "farm",
    "assured",
    "shoulder",
    "lamb",
    "british",
    "welsh",
    "medium",
    "onion",
    "garlic",
    "oregano",
    "juice",
    "lemon",
    "olive",
    "oil",
    "red",
    "white",
    "wine",
    "merchant",
    "gourmet",
    "puy",
    "lentils",
    "organic",
    "sun",
    "ripened",
    "tomatoes",
    "deli",
    "counter",
    "pack",
    "mint"
  ],
  "directions": [
    "0",
    "Method",
    "Preheat the oven to 220°C, gas mark 7. Season the lamb all over with salt and freshly ground black pepper. Scatter the onion over the base of a flameproof casserole large enough to hold the lamb, then place the lamb on top. Sprinkle with the garlic, oregano, lemon juice, olive oil and wine. Season again and cover tightly with foil.",
    "Place the casserole in the oven and cook for 20 minutes, then reduce the heat to 170°C, gas markCook for a further 3 hours, until the lamb is well cooked and beginning to come away from the bone.",
    "After about 2 ½ hours of the cooking time, place the lentils in a pan and cover with 1 litre of cold water. Bring to the boil, then reduce the heat and simmer uncovered for 15 minutes, until just tender. Drain well.",
    "Remove the lamb from the oven, take off the foil and mix the lentils, tomatoes and mint into the juices around the meat. Cover with the foil again and return to the oven for a further 20 minutes. Transfer the lamb to a large plate and pull the meat apart with a fork and spoon. Serve with the lentil mixture spooned around the meat.",
    "Note: Wash hands, equipment and work surfaces thoroughly after handling raw meat."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1.5-1.8kg Waitrose Farm Assured Whole Shoulder of Lamb (British or Welsh)",
    "1 medium onion, sliced",
    "3 cloves garlic, chopped",
    "2 tsp dried oregano",
    "Juice of 1 lemon",
    "2 tbsp olive oil",
    "300ml red or white wine",
    "175g Merchant Gourmet Puy Lentils",
    "50g Organic Sun Ripened Tomatoes (from the Deli Counter)",
    "1 pack fresh mint"
  ],
  "__v": 1
}