{
  "hash": "81d3dbe5321dd1c0f7739f70e025ca7c4c1608ce",
  "title": "Homemade Pizza Crust Recipe.",
  "image": "https://sallysbakingaddiction.com/wp-content/uploads/2013/11/Homemade-Pizza-Crust-81.jpg",
  "href": "https://sallysbakingaddiction.com/homemade-pizza-crust-recipe/",
  "extension": "",
  "firstAdded": "2017-07-13T22:16:42.571000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large mixing bowl or the bowl of your stand mixer fitted with a hook attachment, combine the yeast and warm water. Stir it around and let sit for 5 minutes of until the yeast is foamy and dissolved. This is called \"proofing\" the yeast. If the yeast doesn't dissolve, your yeast is dead. Start again with active yeast. Add flour, olive oil, salt, and sugar. Mix by hand or with the dough hook on low speed for 1 minute.",
    "Once all of the ingredients are mixed, knead for 7 minutes by hand or with your dough hook on low-medium speed. If your dough is too wet, add up to 1/4 cup more flour. After kneading, your dough should be smooth and elastic. Poke it with your finger - if it slowly bounces back, your dough is ready to rise. If not, keep kneading.",
    "Shape the dough into a ball and place in a large mixing bowl that has been coated lightly with olive oil. Turn it over to coat all sides. Cover tightly with plastic wrap and allow to rise in a warm environment (about 75F-80F).",
    "For the warm environment, I heat up my oven to 200F. Then, I turn the oven off and keep the door slightly ajar (I opened it wide for this picture). This will be a warm environment for your dough to rise. After about 30 minutes, I close the oven door to trap warmish air inside with the rising dough.",
    "Depending on your type of yeast, your dough will have doubled in size in about 1 - 2 hours. I use Red Star Platinum and my dough took 1 hour, 20 minutes.",
    "Punch the dough down to release the air.",
    "Divide the dough into two. Roll each half into a ball and let rest in two separate bowls lightly covered for 15 minutes. You may freeze one of the dough balls at this point to use at a later time. Please read above in the post for freezing instructions.",
    "Preheat oven to 475F degrees. Allow to heat for at least 30 full minutes. Every inch of your oven needs to be very, very hot. Grease and dust 2 baking sheets with nonstick spray or with olive oil. Sprinkle with cornmeal (preferred for flavor and texture) or flour (not preferred). Please read above in the post for why cornmeal is preferred.",
    "Prepare your favorite toppings. May I suggest my recipe for a simple extra cheese pizza?",
    "After 15 minutes, flatten each ball of dough 1 at a time on a lightly floured surface or on a silicone baking mat. You could also do this directly on your cornmeal lined pizza pan. Flatten into a 12-inch round circle, flattening and stretching the dough. If using a pizza stone, place the dough directly on baker's peels dusted with cornmeal.",
    "Lift the edge of the dough up to create a lip around the edges. I simply pinched the edges up to create the rim like this. To prevent the filling from making your pizza crust soggy, brush the top lightly with olive oil. Using your fingers, push dents into the surface of the dough to prevent bubbling. Let rest for 15 minutes before topping.",
    "Top with your favorite toppings and bake for 12-15 minutes. For the last minute, I move the oven rack to the top rack to really brown the edges. That's optional.",
    "Slice hot pizza and serve immediately. Store leftover pizza covered tightly in the refrigerator and reheat as you prefer. Baked pizza slices may be frozen up to 1 month."
  ],
  "ingredients": [
    "0",
    "2 and 1/4 teaspoons Red Star Platinum yeast (1 standard packet)*",
    "1 and 1/3 cups (320ml) warm water (105-115F degrees)",
    "3 and 1/2 cups (440g) unbleached all-purpose flour, plus more as needed",
    "2 Tablespoons (30ml) olive oil",
    "3/4 teaspoon salt",
    "1 Tablespoon (13g) granulated sugar",
    "cornmeal, for dusting pan"
  ],
  "__v": 1
}