{
  "hash": "e7118bf3183d79a497e919cb7aaf9b22c9e976ef",
  "title": "Thai Shrimp Spring Rolls",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/alton-brown/thai-shrimp-spring-rolls-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-02-24T16:05:33.470000",
  "users": [
    null
  ],
  "keywords": [
    "rice",
    "noodles",
    "soy",
    "divided",
    "unpeeled",
    "shrimp",
    "squeezed",
    "lime",
    "juice",
    "sambal",
    "chili",
    "sugar",
    "cucumber",
    "seeded",
    "matchsticks",
    "carrot",
    "cilantro",
    "mint",
    "round",
    "paper",
    "wrappers",
    "leaves",
    "bibb",
    "boston",
    "soft",
    "lettuce",
    "ginger",
    "dipping",
    "recipe",
    "follows",
    "lowsodium",
    "wine",
    "vinegar",
    "green",
    "onion",
    "medium",
    "garlic",
    "sesame",
    "oil"
  ],
  "directions": [
    "0",
    "Soak the rice sticks in enough hot water to cover by 1 inch for 15 minutes.",
    "Bring 1/2 gallon of water to a boil in a large pot set over high heat. Add 1 tablespoon soy sauce. Add the shrimp and cook until just firm, 1 to 2 minutes. Remove the cooked shrimp to a cutting board and cool for 3 minutes. When cool enough to handle, peel, devein, and coarsely chop. Set aside.",
    "Return the water-soy sauce to a boil. Drain the rice stick noodles and add to the hot soy-water. Cook until tender, approximately 3 minutes.",
    "Meanwhile, whisk the lime juice, remaining 1 tablespoon soy sauce, chili paste, and sugar together in a medium mixing bowl.",
    "Drain the noodles in a colander. Add the noodles to the lime juice mixture, toss, and set aside while preparing the vegetables.",
    "Toss the cucumber, carrot, cilantro, and mint together in a small bowl. Transfer any unabsorbed liquid from the noodles to the cucumber mixture and toss to combine.",
    "Cut the noodles into small 1 to 2-inch pieces with kitchen shears.",
    "Fill a pie dish with warm water. Dip 1 rice paper wrapper into the water for 10 seconds, then transfer to a cutting board until the wrapper is pliable and slightly tacky, approximately 1 minute.",
    "Place 1/4 cup of the vegetable mixture on the bottom 1/3 of the wrapper nearest to you. Spoon 2 tablespoons chopped shrimp on top of the vegetables. Top with 1/4 cup noodles. Bring the bottom edge of the wrap tightly over the filling, and then fold in the 2 sides. Finish rolling from bottom to top until the entire wrapper is rolled. Be careful not to tear the rice paper. Place on a parchment-lined half sheet pan and cover with a damp tea towel. Repeat with the remaining wrappers until the filling is gone. Wrap each roll in a lettuce leaf and serve with Soy Ginger Dipping Sauce.",
    "Add all of the ingredients to a lidded jar and shake well to combine. Serve as a dipping sauce for spring rolls.",
    "Recipe courtesy of Alton Brown, 2011"
  ],
  "ingredients": [
    "0",
    "5 ounces thin rice stick noodles",
    "2 tablespoons soy sauce, divided",
    "1 pound unpeeled large shrimp",
    "3 tablespoons freshly squeezed lime juice",
    "1 tablespoon sambal chili paste",
    "2 teaspoons sugar",
    "1 large cucumber, unpeeled, seeded, and cut into matchsticks",
    "1 large carrot, peeled and grated",
    "3/4 cup fresh cilantro, chopped",
    "3/4 cup fresh mint, chopped",
    "12 (8 1/2-inch) round rice paper wrappers",
    "12 leaves Bibb, Boston, or other soft lettuce",
    "Soy Ginger Dipping Sauce, recipe follows",
    "1/2 cup low-sodium soy sauce",
    "1/4 cup rice wine vinegar",
    "2 tablespoons finely grated ginger",
    "2 tablespoons chopped green onion",
    "2 medium cloves garlic, minced",
    "2 teaspoons sugar",
    "1 teaspoon sesame oil"
  ],
  "__v": 1
}