{
  "hash": "9e007bdc020254460259526f5c2f7c497b0bccd8",
  "title": "DUTCH OVEN CHICKEN MARBELLA",
  "image": "http://www.freshoffthegrid.com/wp-content/uploads/2016/12/Dutch-Oven-Chicken-Marbella-4-150x150.jpg",
  "href": "http://www.freshoffthegrid.com/dutch-oven-chicken-marbella/",
  "extension": "Chrome",
  "firstAdded": "2017-04-08T07:23:36.639000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "MARINATE THE CHICKEN: Place all ingredients except for the oil and brown sugar in a freezer bag to marinate. Place in your ice chest for at least 6 hours and up to 48 hours.",
    "PREP YOUR CAMPFIRE: Prepare 27 coals. You can use wood embers if you must, but you’ll have to guestimate the proper heat ratio (you’re aiming for 425F). Once all the coals are ready, knock them into a flat pile and place dutch oven on top of all of them. This will produce the high heat required for browning.",
    "BROWN THE CHICKEN: Heat 1 tablespoon of oil in the Dutch oven. The oil is hot and ready when a drop of water instantly sizzles when it hits the pan. Remove the chicken from the marinade, and dust 1 teaspoon brown sugar over the skin side of each thigh. Brown the thighs skin side down over high heat until the skin is crispy and deep golden brown, about 6-8 minutes. Flip to brown the other side, 2 minutes.",
    "BAKE: Remove Dutch oven from heat. Add the marinade (liquid, prunes, olive, capers and all!) to the dutch oven and cover. Evenly distribute 18 coals on the lid and set the Dutch oven on a bed of 9 coals. Bake for 30 minutes, until the thighs are cooked through and their juices run clear when pierced with a knife.",
    "SERVE & ENJOY: Serve over couscous, rice, or pilaf with some of the sauce spooned over the top."
  ],
  "ingredients": [
    "0",
    "serves 2",
    "1/2 cup chopped prunes",
    "1/2 cup olives pitted & halved",
    "1/2 cup dry white wine",
    "1/8 cup capers",
    "1/8 cup red wine vinegar",
    "3 cloves garlic roughly chopped",
    "1 tablespoons dried oregano",
    "1 bay leave",
    "1/2 teaspoon salt",
    "2 chicken thighs skin on",
    "1/2 tablespoon olive oil",
    "2 teaspoons brown sugar"
  ],
  "__v": 3
}