{
  "hash": "a3ed88bf4596ff2ccfa0d829e9a67a463c6833a7",
  "title": "Root Mash with Wine Braised Shallots",
  "image": "",
  "href": "http://thehappyfoodie.co.uk/recipes/root-mash-with-wine-braised-shallots",
  "extension": "Chrome",
  "firstAdded": "2015-03-19T22:11:12.997000",
  "users": [
    null
  ],
  "keywords": [
    "puy",
    "lentils",
    "head",
    "celeriac",
    "chunks",
    "carrots",
    "kabocha",
    "squash",
    "type",
    "potatoes",
    "unsalted",
    "butter",
    "maple",
    "syrup",
    "cumin",
    "salt",
    "black",
    "pepper",
    "braised",
    "shallots",
    "olive",
    "oil",
    "red",
    "wine",
    "stock",
    "bay",
    "leaves",
    "peppercorns",
    "thyme",
    "sprigs",
    "caster",
    "sugar"
  ],
  "directions": [
    "0",
    "Instructions",
    "Start with the shallots. Pour the oil into a medium pan and place on a high heat. Add the shallots and fry for about 5 minutes, stirring occasionally, until coloured all over. Add the wine, stock, bay, peppercorns, thyme, sugar and ¾ teaspoon of salt. Cover, reduce the heat to low and simmer gently for 1 hour. Remove the lid, increase the heat and boil for about 8 minutes, until the remaining liquid is reduced by half. Use a slotted spoon to remove the shallots from the pan and keep them somewhere warm. Stir the butter into the sauce and set aside until ready to use.",
    "Bring a pan of water to the boil, add the lentils, reduce the heat to medium and simmer for about 25 minutes, until tender. Drain and set aside.",
    "For the mash, half fill a medium pan with water and bring to the boil. Add the celeriac and carrot and cook for about 10 minutes. Add the squash and sweet potato and cook for a further 10–15 minutes, until all the vegetables are cooked.",
    "Drain the vegetables, shaking off as much liquid as possible, and mash well with a potato masher. Add the butter, maple syrup, cumin, cooked lentils, 1 teaspoon of salt and plenty of black pepper. Mix well and then divide the warm mash between individual plates. Top with the shallots, spoon over the sauce and serve at once."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "80g\tPuy lentils",
    "½\tlarge head of celeriac, peeled and cut into chunks (300g)",
    "2\tlarge carrots, peeled and cut into chunks (300g)",
    "½\tkabocha squash, or another type, peeled and cut into chunks (300g)",
    "2\tsweet potatoes, peeled and cut into chunks (600g)",
    "70g\tunsalted butter, diced",
    "2 tbsp\tmaple syrup",
    "1½ tsp\tground cumin",
    "salt and black pepper",
    "BRAISED SHALLOTS:",
    "2 tbsp\tolive oil",
    "600g\tshallots, peeled",
    "400ml\tred wine",
    "200ml\tvegetable stock",
    "2\tbay leaves",
    "1 tsp\twhole black peppercorns",
    "4\tthyme sprigs",
    "1 tbsp\tcaster sugar",
    "30g\tunsalted butter"
  ],
  "__v": 1
}