{
  "hash": "04cf911d5e10dd83a42f35d9ece4567e4358b5c0",
  "title": "CARROT CAKE PANCAKES WITH LIME CASHEW CREAM",
  "image": "",
  "href": "http://thefirstmess.com/2012/01/11/carrot-cake-pancakes/",
  "extension": "Chrome",
  "firstAdded": "2019-06-18T16:50:00.180000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the cashew cream: Combine the cashews, water, lime juice, vanilla and lime juice in a blender or food processor and blend/process on high until smooth. Scrape cream into a container and refrigerate until ready to serve (it will firm up a bit).",
    "Stir the ground chia seeds and 1/4 cup + 2 tbsp water together until combined. Set aside for 5 minutes or until the mixture gels.",
    "Stir the apple cider vinegar into the non-dairy milk and allow it to curdle for a few minutes.",
    "Make the pancakes: Combine the whole spelt flour, white spelt flour, orange zest, baking powder, cinnamon, nutmeg and salt in a large bowl and whisk together. Form a well in the middle of the flour mixture. Add the maple syrup, coconut oil, chia gel and curdled milk mixture. Stir until just combined. Fold in grated carrots gently.",
    "Cook pancakes: Heat a large saute pan to medium-low. Pour in about a tablespoon of coconut oil to get started. Once it’s heated up, place 1/4 cup portions of batter into the pan (not too many at a time!). Cook until bubbles start appearing on the surface and bottom edge looks slightly browned. Flip it over and repeat cooking process. Repeat with remaining batter, keeping cooked pancakes warm in a foil covered plate or in a low oven on a parchment lined sheet.",
    "Serve hot with cashew cream, maple syrup and chopped walnuts."
  ],
  "ingredients": [
    "0",
    "cashew cream:",
    "1 cup raw cashews soaked for at least 4 hours",
    "scant 1/2 cup water",
    "juice from 1 lime",
    "1/2 tsp vanilla extract",
    "1 tbsp maple syrup",
    "pancakes:",
    "2 tbsp ground chia seeds",
    "1/4 cup + 2 tbsp water",
    "3/4 cup non-dairy milk",
    "1.5 tsp apple cider vinegar",
    "3/4 cup whole spelt flour",
    "1/2 cup white spelt flour",
    "zest of 1 orange (or clementine is delicious)",
    "1 tbsp baking powder",
    "2 tsp ground cinnamon",
    "1/4 tsp ground nutmeg",
    "pinch of salt",
    "2 tbsp maple syrup + more for serving",
    "1 tbsp melted coconut oil + more for cooking pancakes",
    "2 cups finely grated, loosely packed carrots",
    "handful of toasted walnuts, chopped"
  ],
  "__v": 1
}