{
  "hash": "4e930d95979ae77d4c1d481430764e3a2b55e493",
  "title": "Dry-Aged Standing Rib Roast with Sage Jus",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/alton-brown/dry-aged-standing-rib-roast-with-sage-jus-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-01-01T15:52:47.652000",
  "users": [
    null
  ],
  "keywords": [
    "bonein",
    "standing",
    "rib",
    "roast",
    "preferably",
    "loin",
    "end",
    "canola",
    "oil",
    "coat",
    "kosher",
    "salt",
    "pepper",
    "cover",
    "entire",
    "water",
    "red",
    "wine",
    "sage",
    "leaves"
  ],
  "directions": [
    "0",
    "Remove any plastic wrapping or butcher's paper from the roast. Place the standing rib roast upright onto a half sheet pan fitted with a rack. The rack is essential for drainage. Place dry towels loosely on top of the roast. This will help to draw moisture away from the meat. Place into a refrigerator at approximately 50 to 60 percent humidity and between 34 and 38 degrees F. You can measure both with a refrigerator thermometer. Change the towels daily for 3 days.",
    "Place a 16-inch round azalea terra cotta planter into a cold oven. Invert the planter to become a lid over a pizza stone or the bottom of the planter. The oven should be cold to start, to avoid any cracking in the terra cotta pieces. Turn the oven to 250 degrees F.",
    "Remove the roast from the refrigerator and rub with canola oil. Remember to rub the bones with oil, as well. Once the roast is completely coated with oil cover the roast with kosher salt, about half a teaspoon per bone. Next, rub with freshly ground pepper to coat the surface. Place the roast over a glass bake-ware dish slightly smaller than the length of the roast. This will catch the drippings needed for the sauce. Finally, place a probe thermometer into the center of the roast and set for 118 degrees. Put the roast and the bake-ware dish onto the pizza stone, cover with the terra cotta pot, and return to the oven. Turn the oven down to 200 degrees F and roast until internal temperature is achieved.",
    "Remove the roast and turn oven up to 500 degrees F. Remove the terra cotta lid and recover with heavy-duty foil. Allow the roast to rest until an internal temperature of 130 degrees F. is reached. Place the roast back into the preheated 500 degree F oven for about 10 minutes or until you've achieved your desired crust. Remove and transfer roast to a cutting board. Keep covered with foil until ready to serve.",
    "Degrease the juices in the glass pan. Place the pan over low heat and deglaze with 1 cup of water. Add the wine and reduce by half. Roll the sage leaves in between your fingers to release the flavors and aroma. Add to the sauce and cook for 1 minute. Strain and serve on the side.",
    "Recipe courtesy of Alton Brown"
  ],
  "ingredients": [
    "0",
    "1 (4-bone-in) standing rib roast, preferably from the loin end",
    "Canola oil, to coat roast",
    "Kosher salt and freshly ground pepper, to cover entire roast",
    "1 cup water",
    "1 cup red wine",
    "4 fresh sage leaves"
  ],
  "__v": 1
}