{
  "hash": "50f5cc249b5e9eabfe5dd6279b4411448e20b169",
  "title": "Gordon Ramsay's recipes: Meatballs in tomato sauce",
  "image": "http://i.dailymail.co.uk/i/pix/2009/11/05/article-1225526-07126522000005DC-968_468x342.jpg",
  "href": "http://www.dailymail.co.uk/femail/article-1225526/Gordon-Ramsays-recipes-Meatballs-tomato-sauce.html",
  "firstAdded": "2014-12-30T22:57:01.232000",
  "users": [
    null
  ],
  "keywords": [
    "meatballs",
    "good",
    "quality",
    "beef",
    "onion",
    "garlic",
    "clove",
    "white",
    "breadcrumbs",
    "manchego",
    "cheese",
    "cheddar",
    "flatleaf",
    "parsley",
    "extra",
    "finish",
    "salt",
    "black",
    "pepper",
    "egg",
    "lightly",
    "olive",
    "oil",
    "tomato",
    "dry",
    "wine",
    "tins",
    "tomatoes",
    "water",
    "caster",
    "suga"
  ],
  "directions": [
    "0",
    "METHOD",
    "To make the meatballs, mix the minced beef, onion, garlic, breadcrumbs, cheese and chopped parsley together in a bowl until combined. Season well and add the beaten egg to bind, mixing with your hands.",
    "Shape a small piece of the mixture into a ball and fry in an oiled pan until cooked, then taste for seasoning - if necessary, adjust the seasoning of the uncooked mixture. With damp hands, shape the mixture into about 16 meatballs, trying not to press them too tightly. Place on a large plate, cover with clingfilm and chill for at least 30 minutes.",
    "To make the tomato sauce, heat the olive oil in a frying pan, add the onion and garlic and fry gently until lightly golden.",
    "Increase the heat slightly and pour in the wine. Let it bubble until reduced by half, then stir in the tomatoes, water and sugar. Season with salt and pepper. Simmer for 10-15 minutes, until the tomatoes are soft, then remove the pan from the heat.",
    "To cook the meatballs, heat the olive oil in a large, wide pan. Add the chilled meatballs and fry for 5 minutes, turning frequently, until browned all over.",
    "Pour the tomato sauce over them and simmer for a further 10-15 minutes until the meatballs are cooked through.",
    "Divide the meatballs and tomato sauce between warm bowls and sprinkle with chopped parsley to serve."
  ],
  "ingredients": [
    "0",
    "FOR THE MEATBALLS",
    "500g (1lb 2oz) good quality minced beef",
    "1 onion, peeled and very finely chopped",
    "1 garlic clove, peeled and finely chopped",
    "50g (1\"oz) white breadcrumbs",
    "25g (1oz) Manchego cheese (or Cheddar), grated",
    "2tbsp chopped flat-leaf parsley, plus extra to finish",
    "Sea salt and black pepper",
    "1 large egg, lightly beaten",
    "2tbsp olive oil",
    "FOR THE TOMATO SAUCE",
    "2tbsp olive oil 1 onion, peeled and very finely chopped",
    "1 garlic clove, peeled and finely chopped",
    "120ml (4fl oz) dry white wine",
    "2 x 400g tins chopped tomatoes",
    "100ml (3½fl oz) water 1-2tsp caster suga"
  ],
  "__v": 1
}