{
  "hash": "5c1b0977c1c977e23eb457517fddd13c1f31694f",
  "title": "Hugh Fearnley-Whittingstall's lemon sponge pud",
  "image": "http://goodtoknow.media.ipcdigital.co.uk/111/0000038f2/a207_orh412w625/hugh-fearnley-whittingstalls-lemon-sponge-pudding.jpg",
  "href": "http://www.goodtoknow.co.uk/recipes/429574/Hugh-Fearnley-Whittingstall-s-lemon-sponge-pud",
  "extension": "Chrome",
  "firstAdded": "2016-01-16T13:06:03.069000",
  "users": [
    null
  ],
  "keywords": [
    "zest",
    "juice",
    "lemons",
    "light",
    "muscovado",
    "soft",
    "brown",
    "sugar",
    "unsalted",
    "butter",
    "softened",
    "caster",
    "medium",
    "eggs",
    "selfraising",
    "flour",
    "sifted"
  ],
  "directions": [
    "0",
    "Create a smart shopping list",
    "Turn this recipe into a shopping list you can print, email, view on your mobile or shop online. It's free!",
    "Method",
    "Generously butter an 850ml pudding basin. Stir together the juice of 1 lemon and the brown sugar until the sugar dissolves, then tip it into the basin.",
    "Cream together the butter, lemon zest and caster sugar until very light and fluffy. Beat in one egg at a time, adding a spoonful of flour with each, then fold in the remaining flour. Finally stir in the rest of the lemon juice.",
    "Spoon the mixture into the basin. The lemon juice and sugar mixture will rise up the side of the basin - don’t worry about this, and don’t attempt to stir it in with the batter. Tie a double layer of buttered foil or baking parchment, buttered side down, over the top of the basin. Put a hot plate, rack or upturned small heatproof plate in a large saucepan and stand the pudding on it. Pour in boiling water to come about halfway up the side of the basin, then cover the pan and bring to a very gentle simmer. Steam for 2 hours, topping up the boiling water a couple of times along the way.",
    "Remove the foil and loosen the edges of the pudding with a knife. Place a plate on top, then invert the plate and basin and unmould the pudding. Enjoy the moment as the sauce trickles down the sponge like hot lava, and let your guests admire it, too. Then slice up with a large spoon and serve piping hot, with chilled double cream."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Finely grated zest and juice of 2 lemons",
    "25g light muscovado or soft brown sugar",
    "100g unsalted butter, softened",
    "100g caster sugar",
    "2 medium eggs",
    "100g self-raising flour, sifted"
  ],
  "__v": 1
}