{
  "hash": "acfe23bad6db6a56ec48b84131ba810cebe36131",
  "title": "Instant Pot BBQ Pulled Pork",
  "image": "https://www.jocooks.com/wp-content/uploads/2017/08/instant-pot-bbq-pulled-pork-1.jpg",
  "href": "https://www.jocooks.com/recipes/instant-pot-bbq-pulled-pork/",
  "extension": "Chrome",
  "firstAdded": "2018-06-30T14:51:36.291000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "If your pork shoulder has a skin and too much fat on it, remove it and cut out some of the fat. Cut the pork shoulder into medium size pieces, about 2 inches each. Set aside.",
    "In a small bowl combine all the dry rub ingredients together and whisk well.",
    "In a medium size bowl combine all the sauce ingredients together and whisk well.",
    "Rub the dry rub spice mixture all over the pork pieces.",
    "Turn the Instant Pot to the high saute setting. (See your manufacturer's guide for detailed instructions on how to use your instant pot). Add the oil and once your instant pot reaches the desired temperature (the timer will start to count down) add the pork pieces. Do not over crowd them in the pot, you will need to do this in two batches. Cook the pork, turning on all sides to brown. Should take about 5 minutes per batch. Transfer the first batch to a plate and repeat with the second batch. Press the keep warm/cancel button on your Instant pot.",
    "Add all the meat to the instant pot then pour the prepared sauce over the meat and toss to make sure all the meat is coated in the sauce. There should be enough sauce to cover the meat. Close the lid (follow the manufacturer's guide for instructions on how to close the instant pot lid). Set the Instant Pot to the Meat/Stew setting and set the timer to 90 minutes.",
    "Once the Instant Pot cycle is complete, wait until the natural release cycle is complete, should take about 15 minutes. Follow the manufacturer's guide for quick release, in in a rush. Carefully unlock and remove the lid from the instant pot.",
    "Using a slotted spoon, transfer all the pork to a bowl.",
    "Switch the instant pot to the saute setting again (do not put the lid on) and simmer the leftover sauce until reduced by half, should take about 15 minutes. At the same time you can use a ladle to skim some of the fat that's rising to the top. At this time, taste the sauce and season with more salt if needed.",
    "Using 2 forks, shred the pork into small chunks. Add about 2 cups of the reduced sauce to the pork and toss well.",
    "Serve on hamburger buns by adding pulled pork, some more leftover sauce and coleslaw."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "4 lb pork shoulder boneless",
    "2 tbsp olive oil",
    "For Dry Rub",
    "2 tsp chili powder",
    "1 tsp smoked paprika",
    "1 tsp garlic powder",
    "1 tbsp mustard powder",
    "1/4 tsp cayenne pepper",
    "1 1/2 tsp cumin ground",
    "1 tsp black pepper ground",
    "2 tsp salt",
    "For Sauce",
    "1 cup BBQ sauce store bought",
    "1 cup ketchup",
    "1/4 cup honey",
    "1 tbsp apple cider vinegar",
    "3 cloves garlic sliced",
    "1/4 cup brown sugar packed",
    "1 tsp liquid smoke",
    "1 tbsp Worcestershire sauce",
    "1/2 cup chicken broth low sodium"
  ],
  "__v": 1
}