{
  "__v": 1,
  "directions": [
    "0",
    "Preparate il ripieno: tagliate la zucca a dadini e mettetela all’interno di una teglia da forno insieme alla cipolla, che avrete tagliato a spicchi sottili. Irrorate con l’olio extravergine di oliva, la salvia tritata, sale e pepe. Fate cuocere nel forno per 40 minuti (io ho usato il grill) o comunque fino a quando prenderà un colore dorato, avendo cura di mescolare di tanto in tanto. Fate raffreddare e trasferite il tutto in una ciotola capiente. Schiacciate con una forchetta in modo da ottenere un composto cremoso e tenete da parte.",
    "Per la salsa alla ricotta: in una casseruola fate scaldare il burro, unite la farina e fate cuocere per 3 minuti circa. Mescolando continuamente con una frusta aggiungete il latte, la salvia, e fate cuocere fino a quando otterrete una salsa omogenea e liscia. Fuori dal fuoco unite la ricotta e mescolate con una frusta per amalgamare. Regolate di sale, pepe e noce moscata.",
    "Imburrate una pirofila e distribuite sul fondo un terzo della salsa alla ricotta. Fate cuocere le sfoglie di pasta, una alla volta, per circa 1 minuto in acqua bollente salata, raccoglietele con un mestolo forato e tuffatele in una ciotola contenente acqua fredda. Scolate subito e tamponate con un canovaccio pulito. Disponete al centro di ogni ritaglio di pasta un po’ di ripieno, spargendolo leggermente e lasciando scoperta solo una piccola parte su due lati opposti (negli altri due raggiungete i bordi). Piegate uno dei lati scoperti su una parte del ripieno e arrotolate in modo da ottenere un cannellone. Procedete in questa maniera ottenendo in tutto 16-18 cannelloni. Adagiate i cannelloni sulla salsa in un unico strato (possibilmente con la falda verso il basso), coprite con la salsa rimasta e cospargete con abbondante parmigiano reggiano grattugiato.",
    "Fate cuocere nel forno già caldo a 180° per circa 35-40 minuti o comunque fino a quando risulteranno dorati e li vedrete bollire. In una padella antiaderente fate rosolare la pancetta affumicata tritata fine , tamponate con un foglio di carta assorbente e distribuite sui cannelloni insieme a salvia fresca tritata. Servite subito."
  ],
  "firstAdded": "2014-10-10T11:37:20.845000",
  "hash": "f727c164a01f9ec0477451de1215326c2e18e2d8",
  "href": "http://www.fiordifrolla.it/cannelloni-alla-zucca-con-salsa-alla-ricotta.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+FiorDiFrolla+%28Fior+di+Frolla%29&utm_content=Google+Reader",
  "image": "http://farm9.staticflickr.com/8329/8087273793_93b8c1da0e_o.jpg",
  "ingredients": [
    "0",
    "Ingredienti per 4-6 persone:",
    "16-18 sfoglie per lasagne fresche (delle dimensioni di circa 10 x 15 cm)",
    "30-40 g di pamigiano grattugiato",
    "120 g di pancetta affumicata",
    "per il ripieno:",
    "1,2 kg circa di zucca sbucciata e privata dei semi",
    "1 cipolla rossa grande",
    "2 cucchiai di olio extravergine di oliva",
    "2-3 foglie di salvia",
    "sale, pepe",
    "per la salsa alla ricotta:",
    "40 g di burro",
    "3 cucchiai di farina",
    "550 ml di latte",
    "3 foglia di salvia",
    "240 g di ricotta",
    "sale, pepe",
    "noce moscata"
  ],
  "keywords": [
    "ingredienti",
    "persone",
    "sfoglie",
    "lasagne",
    "fresche",
    "delle",
    "dimensioni",
    "circa",
    "pamigiano",
    "grattugiato",
    "pancetta",
    "affumicata",
    "ripieno",
    "zucca",
    "sbucciata",
    "privata",
    "dei",
    "semi",
    "cipolla",
    "rossa",
    "grande",
    "cucchiai",
    "olio",
    "extravergine",
    "oliva",
    "foglie",
    "salvia",
    "sale",
    "pepe",
    "salsa",
    "alla",
    "ricotta",
    "burro",
    "farina",
    "latte",
    "foglia",
    "noce",
    "moscata"
  ],
  "title": "Cannelloni alla zucca con salsa alla ricotta",
  "users": [
    null
  ]
}