{
  "hash": "2348ee582d933fe02af3ab0bdedd2a298fb8f903",
  "title": "EGGNOG LATTE CUPCAKES",
  "image": "https://www.lifeloveandsugar.com/wp-content/uploads/2017/12/Eggnog-Latte-Cupcakes4.jpg",
  "href": "https://www.lifeloveandsugar.com/eggnog-latte-cupcakes/",
  "extension": "Chrome",
  "firstAdded": "2019-02-10T23:13:53.548000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350°F (176°C) and prepare a cupcake pan with cupcake liners.",
    "In a large mixing bowl, cream butter and sugar together until light in color and fluffy, about 3-4 minutes. Do not skimp on the amount of creaming time.",
    "Add sour cream and vanilla extract and mix until well combined.",
    "Add egg whites in two batches, mixing until well combined after each. Scrape down the sides of the bowl as needed to be sure all ingredients are well incorporated.",
    "Combine dry ingredients in a separate bowl, then combine the eggnog and water in a small measuring cup.",
    "Add half of the dry ingredients to the batter and mix until well combined. Add the milk mixture and mix until well combined. Add remaining dry ingredients and mix until well combined. Scrape down the sides of the bowl as needed to be sure all ingredients are well incorporated.",
    "Fill the cupcake liners about halfway. Bake for 15-17 minutes, or until a toothpick inserted comes out with a few crumbs.",
    "Remove cupcakes from oven and allow to cool for 2-3 minutes, then remove to cooling rack to finish cooling.",
    "While the cupcakes cool, make the frosting. Combine the butter and shortening in a large mixer bowl and mix until smooth.",
    "9. Add 2 cups of powdered sugar and mix until smooth.",
    "10. Dissolve the powdered espresso in the hot water, then add about half of the espresso mixture to the frosting and mix until smooth.",
    "11. Add the remaining powdered sugar and mix until smooth.",
    "12. Add the remaining espresso mixture and eggnog as needed and mix until you have the right frosting consistency.",
    "13. Pipe the frosting onto the cupcakes. I used Ateco tip 844. Sprinkle with a little nutmeg, if desired."
  ],
  "ingredients": [
    "0",
    "EGGNOG CUPCAKES",
    "6 tbsp (84g), unsalted butter, room temperature",
    "3/4 cups (155g) sugar",
    "1/4 cup (57g) sour cream",
    "2 tsp vanilla extract",
    "3 large egg whites, room temperature",
    "1 1/4 cups (163g) all purpose flour",
    "2 tsp baking powder",
    "1/2 tsp nutmeg",
    "¼ tsp salt",
    "1/2 cup (90ml) eggnog",
    "2 tbsp (30ml) water",
    "ESPRESSO FROSTING",
    "1/2 cup (112g) salted butter",
    "1/2 cup (95g) shortening",
    "4 cups (460g) powdered sugar",
    "2 tbsp (30ml) hot water",
    "1 tbsp powdered instant espresso coffee",
    "2-3 tbsp eggnog"
  ],
  "__v": 1
}