{
  "hash": "1a14a7e1f29c66ef1c1d6205f9ae49c386523e1b",
  "title": "Green Goddess Hummus",
  "image": "https://cookieandkate.com/images/2015/03/green-goddess-hummus-recipe-2.jpg",
  "href": "https://cookieandkate.com/2015/green-goddess-hummus-recipe/",
  "extension": "Chrome",
  "firstAdded": "2018-12-28T19:40:53.785000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Combine the tahini and lemon juice in the bowl of your food processor (a smaller food processor will be better suited to the job) or high-powered blender (i.e. Vitamix or Blendtec). Process for about 1 ½ minutes, pausing to scrape down the bowl of your processor as necessary.",
    "Add the olive oil, parsley, tarragon, chives, chopped garlic and salt to the whipped tahini and lemon juice mixture. Process for about 1 minute, pausing to scrape down the bowl as necessary.",
    "Add half of the chickpeas to the food processor and process for 1 minute. Scrape down the bowl, then add the remaining chickpeas and process for until the hummus is thick and quite smooth, about 1 to 2 minutes more.",
    "If your hummus is too thick or hasn’t yet blended into creamy oblivion, run the food processor while drizzling in 1 to 2 tablespoons water, until it reaches your desired consistency.",
    "Scrape the hummus into a small serving bowl. Drizzle about a tablespoon of olive oil on top and sprinkle with additional chopped herbs.",
    "Store hummus in an airtight container and refrigerate for up to one week."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "¼ cup tahini",
    "¼ cup fresh lemon juice (about 1 large lemon’s worth)",
    "2 tablespoons olive oil, plus more for serving",
    "½ cup roughly chopped, loosely packed fresh parsley",
    "¼ cup roughly chopped, loosely packed fresh tarragon or basil",
    "2 to 3 tablespoons roughly chopped fresh chives or green onion",
    "1 large garlic clove, roughly chopped",
    "½ teaspoon salt, more to taste",
    "One (15-ounce) can of chickpeas, also called garbanzo beans, drained and rinsed",
    "1 to 2 tablespoons water, optional",
    "Garnish with extra olive oil and a sprinkling of chopped fresh herbs"
  ],
  "__v": 1
}