{
  "hash": "167dd8cfe37dcf753f0587cdee6548db3b8ff105",
  "title": "Gluten-Free Pumpkin Oat Pancakes",
  "image": "https://cookieandkate.com/images/2018/10/gluten-free-pumpkin-oat-pancakes-4.jpg",
  "href": "https://cookieandkate.com/2013/pumpkin-oat-pancakes/",
  "extension": "",
  "firstAdded": "2018-11-24T05:00:11.391000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a small mixing bowl, stir together the pumpkin puree, milk, coconut oil, lemon juice, maple syrup and vanilla. Beat in the eggs. (If your coconut oil goes back to its solid state like mine did at this point, just warm the mixture for short 20 second bursts in the microwave, stirring between each, until it is melted again.)",
    "In a medium bowl, whisk together the oat flour, baking soda, salt and spices.",
    "Form a well in the center of the dry ingredients and pour in the wet ingredients. With a big spoon, stir just until the dry ingredients are thoroughly moistened. Do not overmix! Let the batter sit for 10 minutes.",
    "Heat a heavy cast iron skillet/non-stick pan over medium-low heat, or heat an electric griddle to 350 degrees Fahrenheit. Lightly oil the surface of your pan with coconut oil, butter or cooking spray. If you’re using a non-stick electric griddle like mine, you might not need any oil at all.",
    "Once the surface of the pan is hot enough that a drop of water sizzles on it, pour ¼ cup of batter onto the pan. Let the pancake cook for about 3 minutes, until bubbles begin to form around the edges of the cake.",
    "Once the underside is lightly golden, flip it with a spatula and cook for another 90 seconds or so, until golden brown on both sides. You may need to adjust the heat up or down at this point.",
    "Serve the pancakes immediately or keep warm in a 200 degree Fahrenheit oven."
  ],
  "ingredients": [
    "0",
    "1 cup pumpkin puree",
    "¼ cup milk of choice",
    "2 tablespoons coconut oil (or butter), melted",
    "1 tablespoon lemon juice (about 1 small lemon, juiced)",
    "1 teaspoon maple syrup (or honey)",
    "1 teaspoon vanilla extract",
    "2 eggs",
    "1 cup oat flour (see notes for how to make your own oat flour out of old-fashioned oats)",
    "½ teaspoon baking soda",
    "½ teaspoon salt",
    "½ teaspoon ground cinnamon",
    "½ teaspoon ground ginger",
    "¼ teaspoon ground nutmeg",
    "¼ teaspoon ground cloves or allspice"
  ],
  "__v": 1
}