{
  "hash": "304a9f9d340771f9a7864d5e8ce628aa41fb55c1",
  "title": "Basic Pizza Dough",
  "image": "https://losangelesovenworks.com/wp-content/uploads/2016/02/charles-van-over-wood-fired-oven-pizza-recipe-280-157.jpg",
  "href": "https://losangelesovenworks.com/charles-van-pizza-recipe/",
  "extension": "Chrome",
  "firstAdded": "2018-02-04T18:12:08.954000",
  "users": [
    null,
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place the flour, salt, and yeast in a 14-cup food processor fitted with the metal blade. Using an instant-read thermometer, adjust the water temperature so that the combined temperatures of the flour and water is a base temperature of 130°F if using a Cuisinart or KitchenAid, 145° F for the Cuisinart Power Prep Plus or 150°F if using a Braun*. With the machine running, pour all but 2 tablespoons of the water through the feed tube. Process for 30 seconds. Add the remaining water during the last 15 seconds of processing if the dough seems too dry. Process the dough for a total of 45 seconds.",
    "Stop the machine and take the temperature of the dough with an instant-read thermometer, which should read between 75°F and 80 °F. If the temperature is lower than 75°F, process the dough for five seconds, repeating up to two times until the dough reaches the desired temperature. If the temperature is higher than 80°F, remove the thermometer, scrape the dough from the food processor into an ungreased bowl and refrigerate for 5 to 10 minutes. Check the temperature of the dough after 5 minutes; the dough should be 80°F or cooler by that time.",
    "Remove the dough from the processor and place it in a large, ungreased bowl. Cover the bowl with plastic wrap. Allow the dough to ferment for 2 1/2 to 3 hours at room temperature, 70°F to 72 °F. The dough will not double at this point but it will increase in volume somewhat.",
    "Place the bowl of dough into the refrigerator and retard the dough for at least 4 hours up to 36 hours. Proceed with any of the recipes for pizza, focaccia, or schiaciatta."
  ],
  "ingredients": [
    "0",
    "Enough dough for three 10-inch pizzas or focaccia",
    "Fermentation: 2 1/2 to 3 hours at room temperature, 70°F to 72°F",
    "Retardation: 4 to 36 hours in the refrigerator, 37°F to 45°F",
    "Unbleached, all-purpose flour",
    "500 grams",
    "16 ounces",
    "3 1/3 to 4 cups",
    "100%",
    "Fine sea salt",
    "10 grams",
    "1/3 ounce",
    "2 teaspoons",
    "2%",
    "Instant yeast",
    "3 grams",
    "1/2 teaspoon",
    "1/2 teaspoon",
    "0.5%",
    "Water",
    "3 grams",
    "11 ounces",
    "1 1/4 cups + 2 tablespoons",
    "70%",
    "Cornmeal for coating a peel or baking sheet"
  ],
  "__v": 2
}