{
  "__v": 1,
  "directions": [
    "0",
    "1 Heat the oven to 160C/140C fan/gas 3. Heat the oil in a casserole dish with a lid and spend a good 10 mins browning the pork on all sides. If your casserole dish isn’t wide enough to fit the pork in a single layer then brown it in batches. Scoop the pork out and set aside then add the chorizo and sizzle for a minute. Add the vegetables, fennel seeds, chilli flakes, garlic and herbs and cook for about 5 mins until the vegetables are soft and just starting to colour. Sprinkle over the sugar and stir in the tomato purée then splash in the vinegar and bubble for a moment. Tip in the tomatoes and a can of water. Stir the pork and juices into the sauce, season with salt and pepper and bring to a simmer.",
    "Cover the dish with a lid and place in the oven for 1 hr 45 mins, checking occasionally and if the sauce becomes too thick add a splash more water. Remove the pan from the oven and stir in the chickpeas and return to the oven for 15 mins. Remove again and leave to cool slightly so it’s not scorching hot then stir through the parsley. Taste for seasoning and serve with crusty bread or boiled potatoes."
  ],
  "firstAdded": "2014-08-04T17:51:41.086000",
  "hash": "47ca172493ac1e40dc0885cf0c12d48b8ae1c3f3",
  "href": "http://www.bbcgoodfood.com/recipes/1940707/chorizo-pork-belly-and-chickpea-casserole-",
  "image": "http://www.bbcgoodfood.com/sites/bbcgoodfood.com/files/recipe_images/recipe-image-legacy-id--890482_11.jpg",
  "ingredients": [
    "0",
    "1 tbsp olive oil",
    "700g skinless, boneless pork belly, cut into large bite-sized chunks",
    "100g cooking chorizo, sliced into thin rounds",
    "1 large onion, chopped",
    "1 large carrot, finely chopped",
    "1 tsp fennel seed",
    "small pinch dried chilli flakes",
    "2 garlic cloves",
    "4 bay leaves, fresh are best",
    "sprig of thyme",
    "large pinch golden caster sugar",
    "1 tbsp tomato purée",
    "50ml sherry vinegar or good quality red wine vinegar",
    "400g tin chopped tomatoes",
    "400g tin chickpeas, drained and rinsed",
    "fresh chopped parsley"
  ],
  "keywords": [
    "olive",
    "oil",
    "skinless",
    "boneless",
    "pork",
    "belly",
    "chunks",
    "cooking",
    "chorizo",
    "rounds",
    "onion",
    "carrot",
    "fennel",
    "seed",
    "chilli",
    "garlic",
    "bay",
    "leaves",
    "best",
    "sprig",
    "thyme",
    "golden",
    "caster",
    "sugar",
    "tomato",
    "sherry",
    "good",
    "quality",
    "red",
    "wine",
    "vinegar",
    "tin",
    "tomatoes",
    "chickpeas",
    "rinsed",
    "parsley"
  ],
  "title": "Chorizo, pork belly & chickpea casserole",
  "users": [
    null
  ]
}