{
  "hash": "7b4207d16f420f5e00cb9715ce9986df46d8a0bb",
  "title": "PIZZA WITH CREAMED SPINACH, SUN-DRIED TOMATOES, RED ONION, AND OLIVES",
  "image": "",
  "href": "https://www.forksoverknives.com/recipes/vegan-pizza-recipe-creamed-spinach/",
  "extension": "Chrome",
  "firstAdded": "2018-02-20T03:00:50.069000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place the sun-dried tomatoes in a small bowl, and add enough warm water to cover. Set aside to soak until tender, about 30 minutes. Drain well. Finely chop the tomatoes and set aside.",
    "Meanwhile, in a blender, puree the tofu until smooth. Set aside.",
    "Preheat the oven to 350°F.",
    "Lay a clean kitchen towel or several layers of paper towel on the counter and place the thawed spinach at the bottom of one short end. Roll the spinach in the towel and, holding it over the sink, twist either end of the roll to squeeze as much liquid out of the spinach as you can. Unroll and set aside.",
    "Heat a skillet over medium heat. Add the yellow onion and cook, stirring occasionally. Add water 1 to 2 tablespoons at a time, as needed to keep the onion from sticking, until softened, about 5 minutes. Add the garlic and dill and cook until fragrant, about 1 minute. Stir in the pureed tofu and the spinach, along with the nutritional yeast. Cook to warm through, about 2 minutes. Season to taste with salt and pepper, and remove from the heat.",
    "Place the pizza crusts on pizza stones or large baking sheets. Divide the spinach mixture evenly between the crusts, and spread it to cover the crusts evenly. Top with the chopped sun-dried tomatoes, red onion, and olives.",
    "Bake until the edges are browned slightly and the pizzas are warmed all the way through, about 15 minutes. Slice and serve."
  ],
  "ingredients": [
    "0",
    "½ cup sun-dried tomatoes (not packed in oil)",
    "1 (12-ounce) package firm or extra-firm silken tofu",
    "1 (10-ounce) package frozen spinach, thawed",
    "1 medium yellow onion, diced small",
    "2 cloves garlic, minced",
    "1 tablespoon dried dill",
    "2 tablespoons nutritional yeast",
    "Sea salt",
    "Freshly ground black pepper",
    "2 (12-inch) precooked whole-grain pizza crusts",
    "½ medium red onion, finely diced",
    "1 cup pitted kalamata olives, halved"
  ],
  "__v": 1
}