{
  "hash": "eb0d544e30f47501cf13c81b69e99569569f0ec1",
  "title": "Rice Cooker Bibimbap With Salmon and Spinach",
  "image": "",
  "href": "http://www.nytimes.com/2008/10/01/dining/012rrex.html?ref=dining&_r=0",
  "extension": "Chrome",
  "firstAdded": "2015-05-05T08:36:12.325000",
  "users": [
    null
  ],
  "keywords": [
    "leaf",
    "spinach",
    "frozen",
    "roasted",
    "sesame",
    "oil",
    "rice",
    "vinegar",
    "salt",
    "black",
    "pepper",
    "salmon",
    "fillet",
    "preferably",
    "medium",
    "shortgrain",
    "rinsed",
    "long",
    "hot",
    "green",
    "kimchi",
    "eggs",
    "kochuj",
    "ang",
    "asian",
    "sambal",
    "chili",
    "bean",
    "seeds",
    "scallions"
  ],
  "directions": [
    "0",
    "Using steamer function, steam spinach in rice cooker until tender, about 8 minutes. Remove to a kitchen towel, wring dry and thinly slice into a bowl. Season to taste with sesame oil, rice vinegar and salt. Sprinkle salmon with salt and pepper and steam until just cooked through, about 15 minutes. Break into large flakes. (See Note.)",
    "Clean out cooker and cook rice according to instructions. When done (or when cooker switches to “warm” function), quickly stir in sliced pepper and kimchi, making sure to scrape and scoop up bottom layer of rice. Smooth top.",
    "Drizzle 2 teaspoons sesame oil over rice and gently break eggs on top, placing one on each side of cooker. Cover and put cooker on “cook” function for 5 minutes.",
    "Switch cooker to “warm,” arrange salmon and spinach next to eggs, cover and let steam just until egg whites are opaque (yolks should be runny). Place a teaspoon of chili paste in center.",
    "At table, stir dish together. (A toasty crust may have formed on bottom of rice cooker: scrape this up and mix into dish.) Scoop into serving bowls, sprinkling each with sesame seeds and scallions. Pass sesame oil, rice vinegar and chili paste for seasoning."
  ],
  "ingredients": [
    "0",
    "0 ounces leaf spinach, fresh or frozen",
    "Roasted sesame oil",
    "Rice vinegar",
    "Salt and freshly ground black pepper",
    "8 ounces salmon fillet, sliced 1/4 inch thick across the grain",
    "1 cup rice, preferably medium- or short-grain, rinsed",
    "1 long hot green pepper, thinly sliced",
    "3 tablespoons kimchi, finely chopped",
    "2 eggs",
    "Kochuj ang or another Asian chili paste such as sambal or chili bean paste",
    "Sesame seeds and finely chopped scallions, for garnish."
  ],
  "__v": 1
}