{
  "hash": "312df0d5cfe988a521e12b870546e54cd450f8a2",
  "title": "Cookie Crown Cake",
  "image": "http://static.spoonful.com/sites/default/files/styles/square_420x420/public/recipes/cookie-crowncake-spring-recipe-photo-420-FF0408CAKEA01.jpg",
  "href": "http://spoonful.com/recipes/cookie-crown-cake#5158ce84cad7bbd173000003",
  "keywords": [
    "flour",
    "roll",
    "refrigerated",
    "sugar",
    "cookie",
    "dough",
    "template",
    "pattern",
    "yellow",
    "decorating",
    "white",
    "frosting",
    "candy",
    "decorations",
    "used",
    "regular",
    "mini",
    "mms",
    "stardrops",
    "hard",
    "candies",
    "round",
    "cakes"
  ],
  "directions": [
    "0",
    "How to make it",
    "Knead the flour into the cookie dough to firm it up. On a floured surface, roll the dough into a 1/4-inch-thick rectangle. Using the template, cut out as many cookies as you can. Keep rerolling the dough scraps and cutting until you have 12 cookies -- 11 for the cake plus a backup. Transfer the cookies to a foil- or parchment-lined baking sheet and sprinkle them generously with yellow sugar. Bake them according to the package directions until they're golden brown around the edges. Transfer them to a wire rack to cool completely.",
    "Spoon 1/2 cup of the frosting into a resealable plastic bag. Snip off a corner of the bag and pipe designs onto the cookies. Add candy decorations as shown above. Allow the frosting to set for at least 1 hour before handling the cookies.",
    "Use a long serrated knife to trim the top of one of the cakes flat, if needed. Place it on a serving platter, spread a thin layer of frosting on the top, then lay the other cake on it, rounded side up. Generously frost the stack and use a spoon to draw the frosting on top up to a point as shown. Carefully press the cookies around the side of the cake, piping lines of frosting between the cookies to secure them. Serves 11."
  ],
  "ingredients": [
    "0",
    "2/3 cup flour",
    "16 1/2-ounce roll refrigerated sugar cookie dough",
    "Template for cookie pattern",
    "4 tablespoons yellow decorating sugar",
    "2 (16-ounce) cans white frosting",
    "Candy decorations (we used regular and mini M&M's, and Stardrops hard candies)",
    "2 (8-inch) round cakes"
  ],
  "__v": 0
}