{
  "hash": "26418a2ed53feeb6b29eb4f5503c9c65716e9c10",
  "title": "Brownies mit Kidneybohnen (glutenfrei)",
  "image": "http://cakeinvasion.de/wp-content/uploads/2016/04/IMG_7357.jpg",
  "href": "https://cakeinvasion.de/brownies-mit-kidneybohnen-vegan-glutenfrei/",
  "extension": "Safari",
  "firstAdded": "2018-11-07T10:32:44.179000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Die Form einfetten.",
    "Haferflocken im Mixer zu Hafermehl mahlen. Das muss kein super feines Mehl sein.",
    "Chia Samen mit den 3 EL Wasser vermischen und kurz quellen lassen.",
    "Die gekochten Kidneybohnen abwaschen.",
    "Den Ofen auf 175ºC Ober-/Unterhitze vorheizen.",
    "Hafermehl, Kidneybohnen, Backpulver, Salz, Kakao, Pflanzenmilch, Öl, Apfelmark/-mus, Vollrohrzucker, Zucker und die gequollenen Chia-Samen in einen guten (!!!) Standmixer geben und so lange mixen, bis eine homogene Masse entstanden ist. Lieber dazwischen mal den Mixer ausstellen, damit er nicht zu heiß läuft. Oder nur Kidneybohnen, Apfelmark, Öl und Pflanzenmilch zusammen darin mixen und dann in einer Rührschüssel mit den anderen Zutaten vermischen. Wenn die Bohnenmasse sich nur sehr schwer mixen lässt, könnt ihr noch einen Schuss Pflanzenmilch dazu geben. Der Teig sollte aber nicht zu dünnflüssig werden.",
    "Den Teig auf die eingefettete Form geben und glattstreichen.",
    "Im Ofen ca. 20-25 Minuten auf mittlerer Schiene backen. Achtung, die Stäbchenprobe funktioniert bei Brownies generell nicht ;).",
    "Nun direkt die Schokolade auf dem noch warmen Kuchen verteilen. Etwas unten schmelzen lassen und dann verschmieren.",
    "Ebenfalls direkt im Anschluss mit Zuckerstreuseln bestreuen und danach erst abkühlen lassen."
  ],
  "ingredients": [
    "0",
    "100 g (glutenfreie) Haferflocken",
    "500 g gekochte Kidneybohnen",
    "1 TL Backpulver",
    "¼ TL Salz",
    "6 EL Kakao",
    "180 ml Pflanzenmilch euer Wahl (z.B. Soja-/Reis-/Hafer-/Mandelmilch, für eine sojafreie Version keine Sojamilch nehmen, für eine nussfreie Version auf Mandelmilch verzichten)",
    "50 ml Öl, geschmacksneutral (ich nehme immer Bio Back- & Bratöl aus dem Bioladen)",
    "100 g Apfelmark oder Apfelmus (Apfelmark ist ohne Zuckerzusatz)",
    "30 g Vollrohrzucker",
    "50 g Zucker",
    "10 g Vanillezucker (ich mache meinen immer selbst)",
    "1 TL Chia-Samen",
    "3 EL Wasser",
    "50 g Zartbitterschokolade (Zartbitterschoki ist in der Regel vegan, aber am besten noch mal auf die Zutatenliste gucken)",
    "Zuckerstreusel nach Belieben (vegane gibt es z.B. von Biovegan in Bioläden)"
  ],
  "__v": 1
}