{
  "hash": "c1b3cf5132a27a91304cf2cd661d375b5739b981",
  "title": "Redeeming Green Soup with Lemon and Cayenne",
  "image": "http://cookieandkate.com/images/2014/03/redeeming-green-soup-with-lemon-and-cayenne-recipe-1.jpg",
  "href": "http://cookieandkate.com/2014/redeeming-green-soup-with-lemon-and-cayenne/",
  "firstAdded": "2015-01-07T11:27:50.311000",
  "users": [
    null
  ],
  "keywords": [
    "extravirgin",
    "olive",
    "oil",
    "yellow",
    "onions",
    "salt",
    "divided",
    "water",
    "rinsed",
    "used",
    "brown",
    "arborio",
    "rice",
    "bunch",
    "kale",
    "green",
    "chard",
    "preferably",
    "organic",
    "gently",
    "spinach",
    "baby",
    "cooking",
    "greens",
    "broth",
    "cayenne",
    "pepper",
    "lemon",
    "juice",
    "serve",
    "basmati",
    "chickpeas"
  ],
  "directions": [
    "0",
    "First prepare the greens: Remove the ribs from the chard/kale and discard or save them for another recipe. Coarsely chop or tear the kale leaves. Trim any tough stems from the spinach/baby greens and roughly chop the leaves.",
    "Caramelize the onions: Heat 2 tablespoons oil in a large skillet over medium-high heat. Add onions and ¼ teaspoon salt. Cook, stirring frequently, until the onions begin to brown, about 5 minutes.",
    "Reduce the heat to low, add 2 tablespoons water and cover the skillet (I used a baking sheet to cover mine). Cook until the onions are greatly reduced and have a deep caramel color, 25 to 30 minutes. Stir frequently while the pan is still hot and occasionally once the pan has cooled down (always recover the pan after stirring).",
    "Cook the arborio rice: While the onions are cooking, combine the remaining 3 cups water and ¾ teaspoon salt in a soup pot or Dutch oven. Add rice and bring the water to a boil. Reduce heat to maintain a simmer, cover and cook for 15 minutes.",
    "When the rice has cooked for 15 minutes, stir in the chard greens or kale. Return to a simmer; cover and cook for 10 minutes.",
    "When the onions are caramelized, stir a little of the simmering liquid into them, then add the onion mixture to the rice along with the spinach/cooking greens, broth and cayenne. Return to a simmer, cover and cook, stirring once, until the spinach is tender but still bright green, about 5 minutes more.",
    "Puree the soup in the pot with an immersion blender until perfectly smooth or in a regular blender in batches. Stir in 1 tablespoon lemon juice. Taste and add more lemon juice, sea salt or cayenne pepper, if desired. Garnish each bowl of soup with a drizzle of olive oil.",
    "Divide the soup into bowls if you're serving it as a bisque, or serve in bowls over cooked rice and chickpeas for a more complete meal. Garnish soup with a swirl of olive oil if you'd like. Serve with lemon wedges and freshly ground black pepper on the side."
  ],
  "ingredients": [
    "0",
    "2 tablespoons extra-virgin olive oil, plus more for garnish",
    "2 large yellow onions, chopped",
    "1 teaspoon salt, divided",
    "2 tablespoons plus 3 cups water, divided",
    "¼ cup arborio rice, rinsed (I used brown arborio rice)",
    "1 large bunch kale or green chard, preferably organic (about 1 pound)",
    "14 cups gently packed spinach or baby cooking greens, like chard, preferably organic (about 12 ounces)*",
    "4 cups vegetable broth",
    "Big pinch of cayenne pepper, to taste (I used over ¼ teaspoon)",
    "1 tablespoon lemon juice, or more to taste",
    "Serve with (optional): cooked brown basmati rice and cooked chickpeas"
  ],
  "__v": 1
}