{
  "hash": "d53c91a4da1df357abacaa7ce3d858d2ed0adf8e",
  "title": "How To Make Pastry Cream",
  "image": "http://m5.paperblog.com/i/84/840649/lai-wong-bao-egg-custard-steamed-buns-with-fa-L-G9gRuU.jpeg",
  "href": "http://en.paperblog.com/lai-wong-bao-egg-custard-steamed-buns-with-fat-reduced-filling-840649/",
  "extension": "Chrome",
  "firstAdded": "2015-03-02T20:28:24.910000",
  "users": [
    null
  ],
  "keywords": [
    "reducedfat",
    "custard",
    "filling",
    "adapted",
    "viet",
    "world",
    "kitchen",
    "salt",
    "icing",
    "sugar",
    "cornflour",
    "condensed",
    "milk",
    "use",
    "fat",
    "free",
    "regular",
    "ones",
    "coconut",
    "reduced",
    "butter",
    "egg",
    "yolk"
  ],
  "directions": [
    "0",
    "Make the filling one day ahead.",
    "Sift salt, custard powder, sugar, and cornflour into a saucepan. Whisk in coconut milk and condensed milk. Heat over medium-low heat, stirring constantly, until smooth. Add butter and stir until the butter has melted.",
    "Keep stirring while mixture thickens substantially. Continue to stir and cook at medium-low heat until mixture thickens to form firm texture and leaves itself off the side of the pan. Remove the pan off the heat and whisk in egg yolk. This will thin the mixture out slightly. Return the pan to the heat and keep stirring to ensure that the yolk is well-incorporated and mixture thickens again.",
    "Transfer the filling to a bowl and allow it to cool down completely. Once it is cooled, cover the surface of the custard with cling wrap to avoid any condensation form on the cling wrap dripping on the custard. Chill mixture for 1hr or more in the fridge."
  ],
  "ingredients": [
    "0",
    "Reduced-fat custard filling, mostly adapted by Viet World Kitchen",
    "1/8 tsp salt",
    "30g custard powder",
    "20g icing sugar",
    "20g cornflour",
    "1 tbsp condensed milk",
    "(It is ok to use the 99% fat free ones or any regular ones)",
    "60ml coconut milk",
    "(It is ok to use the fat reduced ones or any regular ones)",
    "15g butter",
    "1 large egg yolk"
  ],
  "__v": 1
}