{
  "hash": "5dc2844623f64ec68791d3f04aaff8cbf21466b8",
  "title": "oven-fried southern chicken with sweet honey bourbon sauce.",
  "image": "https://www.halfbakedharvest.com/wp-content/uploads/2014/04/Oven-Fried-Southern-Chicken-With-Sweet-Honey-Bourbon-Sauce.-1.jpg",
  "href": "https://www.halfbakedharvest.com/oven-fried-southern-chicken-sweet-honey-bourbon-sauce/",
  "extension": "Chrome",
  "firstAdded": "2018-01-25T02:18:32.221000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "SWEET HONEY BOURBON SAUCE",
    "In a bowl, mix the cornstarch with 1/4 cup of water until smooth. Add the cayenne pepper, salt and black pepper. In a medium sauce pan over low heat, combine the bourbon, 3/4 cup water, soy sauce, honey, [BBQ Sauce | https://www.halfbakedharvest.com/homemade-barbecue-sauce-just-like-sweet-baby-rays/], Tabasco and dijon. Bring up the heat to a simmer and slowly add the corn starch mixture, whisking vigorously as you go. When the mixture is well combined, cook about 1 more minute. Turn off the heat and set aside until ready to use. The sauce can be made ahead and refrigerated until ready to serve.",
    "CHICKEN",
    "Add the chicken to a large bowl and pour the buttermilk over the chicken. Toss well, cover and refrigerate for 2 hours or overnight.",
    "After 2 hours or the next day preheat the oven to 475 degrees F. Line a baking sheet with a silpat, foil or parchment paper and spray or brush it with some olive oil.",
    "Add the corn flakes crumbs, Panko, flour, smoked paprika, chili powder, onion powder, garlic powder, cayenne, salt and pepper. Stir to combine.",
    "Remove each piece of chicken from the buttermilk, and dredge through the crumbs, pressing gently to adhere. Place on the prepared baking sheet. Repeat until all the chicken has been used. Make sure not to crowd your pan, if necessary use two baking sheets. Lightly spray the chicken with cooking spray or a mist of olive oil. Drizzle the melted butter over the chicken.",
    "Bake for 10-12 minutes, then reduce the heat to 400 degrees F. Bake for 10-12 minutes more, then flip the chicken over and gently spray with olive oil. Place back in oven for another 15-20 minutes or until the chicken is cooked through and the juices run clean. Serve with a lemon wedge if desired and the bourbon sauce."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "CHICKEN",
    "2 pounds skinless, boneless chicken",
    "2 1/2 cups buttermilk",
    "2 cups corn flake crumbs",
    "1/2 cup Panko bread crumbs",
    "2 tablespoons whole wheat flour",
    "1 tablespoon smoked paprika",
    "1 teaspoon chili powder",
    "2 teaspoons onion powder",
    "1/2 teaspoon garlic powder",
    "1/4 -1/2 teaspoon cayenne pepper",
    "a good pinch of salt & pepper",
    "SWEET HONEY BOURBON SAUCE",
    "3/4 cup bourbon",
    "1 cup cold water divided",
    "2 tablespoons cornstarch",
    "1/8 teaspoon cayenne",
    "1/8 teaspoon salt",
    "1/8 teaspoon pepper",
    "2 tablespoons soy sauce",
    "3/4 cup honey",
    "2 tablespoons of your favorite BBQ Sauce",
    "1 1/2 teaspoons tabasco",
    "1 teaspoon dijon mustard",
    "4-8 tablespoons melted salted butter"
  ],
  "__v": 1
}