{
  "hash": "4f359e3d3610b98830a69eb74ab9cead16f18e23",
  "title": "Blushing New England Fish Chowder",
  "image": "//images.food52.com/KE3ewy651B3WJbHqs0gVLXMxhbU=/753x502/574a4e67-ff76-4a62-ba2d-5106c711a203--all-about-fish-chowder_food52_mark_weinberg_14-08-12_0342.jpg",
  "href": "http://food52.com/recipes/30450-blushing-new-england-fish-chowder",
  "extension": "Chrome",
  "firstAdded": "2016-01-21T15:16:38.028000",
  "users": [
    null
  ],
  "keywords": [
    "butter",
    "olive",
    "oil",
    "spanish",
    "chorizo",
    "skin",
    "medium",
    "onion",
    "smoked",
    "paprika",
    "bay",
    "leaf",
    "sprigs",
    "thyme",
    "russet",
    "potato",
    "scrubbed",
    "dice",
    "seafood",
    "stock",
    "salt",
    "black",
    "pepper",
    "roasted",
    "red",
    "peppers",
    "white",
    "flaky",
    "fish",
    "fillets",
    "cod",
    "cusk",
    "haddock",
    "hake",
    "pollock",
    "cream",
    "halfandhalf",
    "chives"
  ],
  "directions": [
    "0",
    "Heat butter and oil in a large saucepan. Add chorizo and cook until it’s crisped up a bit. Use a slotted spoon to remove chorizo from the pan to drain on a paper towel.",
    "Add onion to pot and sauté in fat, until onion is softened. Add paprika, bay leaf, and potatoes. Use a piece of kitchen twine to tie the thyme sprigs together. Place the bundle of thyme in the pot and tie the loose end of the string to the handle of the pot. Add stock, making sure there is enough to cover the potatoes by an inch. Bring chowder to a boil, then reduce the heat so it simmers until potatoes are soft enough to crush against the side of pot, about 10 to 15 minutes. Add salt and pepper to taste. Stir in chopped red pepper.",
    "Gently slip whole fillets of fish into chowder. Cook on low heat until fish easily breaks apart in bite-sized pieces. For thinner fillets like haddock and Pollock this will take 4-5 minutes. For thicker fillets of cod, cusk and hake, this will take 6-7 minutes. If the fish isn't completely submerged, flip the fillets midway through. When fish is cooked through, remove bay leaf and add cream, adjusting amount to your liking.",
    "Ladle hot chowder into bowls, garnish with crispy chorizo and chopped chives."
  ],
  "ingredients": [
    "0",
    "1 teaspoon butter",
    "1 tablespoon olive oil",
    "2 ounces Spanish chorizo, skin removed and chopped",
    "1 medium sweet onion, chopped",
    "1 teaspoon smoked paprika",
    "1 bay leaf",
    "2 sprigs fresh thyme",
    "1 large Russet potato, scrubbed and cut into 1/2-inch dice",
    "3 to 3 1/2 cups seafood stock",
    "1 teaspoon salt",
    "1/2 teaspoon freshly ground black pepper",
    "1/2 cup roasted red peppers, chopped",
    "1 pound white flaky fish fillets (cod, cusk, haddock, hake, or pollock)",
    "1/2 to 1 cups cream (or half-and-half, if you must)",
    "2 tablespoons chopped chives (for garnish)"
  ],
  "__v": 1
}