{
  "hash": "05f73ea18376b2d5ede0491560ba5f16c6219da8",
  "title": "Homemade Plain Whole Milk Yogurt in the Instant Pot",
  "image": "https://www.epicurious.com/static/img/px/background.png",
  "href": "https://www.epicurious.com/recipes/food/views/homemade-plain-whole-milk-yogurt-in-the-instant-pot",
  "extension": "Chrome",
  "firstAdded": "2019-06-19T23:41:12.989000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place the milk in the inner pot. Close and lock the lid. Set the valve to Sealing.",
    "Press the Yogurt button and then press the Yogurt or Adjust button until the display reads “Boil.”",
    "[The unit will then begin heating the milk. It took exactly 26 minutes for the Instant Pot to heat 1/2 gallon of milk to 180°F, the target temperature for Phase One. \"Yogt\" appears on the display when complete.",
    "Remove the lid from the Instant Pot. Do not let condensation from the lid drip into the milk.",
    "In order to \"hold\" the milk at 180°F for 5 minutes, press Yogurt and Adjust again. This turns the heat back on. Even though the lid is now off and the milk won't reach a boil, this additional heating time will ultimately create thicker yogurt without the need for milk powders or other thickeners. Hit Keep Warm/Cancel when complete.]",
    "OR",
    "Allow about 30 minutes for the program to finish. When it has finished, press Cancel until the display reads “Off.”",
    "Use oven mitts to remove the inner pot (be careful—it’s hot!) and place it on a trivet or other heat-resistant surface. Allow the milk to cool, stirring occasionally, until the temperature drops to 110°F as measured on an instant-read thermometer, about 1 hour. (If you do not have a thermometer, use a small spoon to drip a few drops of the milk on the inside of your wrist. It should feel just above body temperature—very slightly warm but not hot. Err on the side of too cool, since too much heat will kill the necessary bacteria in the yogurt in the next step.)",
    "Place 2 tablespoons active yogurt into a medium bowl. This is your starter. Ladle 1/2 cup of the warm milk into the starter. Scrape the milky starter back into the inner pot.",
    "Return the inner pot to the Instant Pot. Press the Yogurt button and use the Yogurt or Adjust button to select the middle temperature (“Normal”). Use the − or + button to set the time to 8 hours. Close and lock the lid. Set the valve to Sealing.",
    "When the cycle ends, press Cancel and remove the lid. Stir the yogurt and then use a large spoon to scoop it into a container with a lid or single-serving containers with lids. Place the covered container(s) in the refrigerator to cool, about 3 hours, before serving."
  ],
  "ingredients": [
    "0",
    "2 quarts (1/2 gal) whole milk",
    "2 tablespoons whole-milk, 2%, or skim yogurt with active (live) cultures"
  ],
  "__v": 3
}