{
  "hash": "c98affa56eb28a71e8022b5e4b431056e7ca9d93",
  "title": "Gluten-Free, Flourless & Vegan Chocolate CakeMahaadarshMadhuramMayuri SodhaMadhuramRkMadhuram",
  "image": "http://cdn.egglesscooking.com/images/cakes/gluten-free-chocolate-cake2.jpg",
  "href": "http://www.egglesscooking.com/2012/02/22/gluten-free-flourless-vegan-chocolate-cake-recipe/",
  "firstAdded": "2015-01-28T12:06:22.405000",
  "users": [
    null
  ],
  "keywords": [
    "chickpeas",
    "canned",
    "beets",
    "pureed",
    "sugar",
    "coconut",
    "oil",
    "baking",
    "coffee",
    "used",
    "instant",
    "granules",
    "lemon",
    "juice",
    "vanilla",
    "chocolate",
    "chips",
    "vegan",
    "mini"
  ],
  "directions": [
    "0",
    "Cook the beets, cool it and blend it into a smooth paste using the beet cooked water itself. Set aside. Peel the skin off the chickpeas and puree it smooth using little water.",
    "Preheat the oven at 350F/180C for 15 minutes. Line the pan with parchment paper and very lightly brush it with the melted coconut oil. Melt the chocolate chips in a microwave oven in small time intervals until the chocolate is completely melted.",
    "Now in a food processor/blender, blend together the pureed chickpeas, beets and sugar. The mixture has to be lump free. Now also incorporate the coconut oil, baking powder, coffee powder, lemon juice and vanilla extract. Once all these ingredients come together, blend in the melted chocolate chips too and run the mixer for a couple of minutes until all the chocolate is mixed evenly throughout the batter.",
    "Pour the batter into the prepared pan and tap the pan to avoid any air bubbles and put it in the oven for 40-50 minutes. If you think the corners might get burnt, loosely cover the pan with aluminum foil. Note that the cake does not firm up in the middle. (See My Notes)",
    "Remove the pan from the oven and cool it on a wire rack. Let it cool completely. Mine was still wiggly in the middle after a couple of hours, so put the cake in the refrigetor overnight thinking that it would firm up by the next morning and it did. Gently slide off the cake from the pan and place it on a serving platter and sprinkle some confectioner’s sugar and serve it with strawberries and a dollop of whipped cream or devour it just like that."
  ],
  "ingredients": [
    "0",
    "2 cups Chickpeas (canned or freshly cooked)",
    "3/4 cup Beets (cooked and pureed)",
    "1/2 cup Sugar",
    "1/4 cup Coconut Oil, melted",
    "1 teaspoon Baking Powder",
    "1/2 teaspoon Coffee Powder (I used instant granules)",
    "2 tablespoons Lemon Juice (optional)",
    "1/2 teaspoon Vanilla Extract",
    "1 and 1/2 cups Chocolate Chips (I used vegan and mini)"
  ],
  "__v": 1
}