{
  "hash": "df7bacf5e2f8ed2d7935f0e21abdb73584ec395d",
  "title": "Easy Freezer Recipes: Paleo Coconut Pecan Breakfast Bars",
  "image": "http://mommayoungathome.com/wp-content/uploads/2014/10/paleo-bars06-pecans.png",
  "href": "http://mommayoungathome.com/homemaking/recipes-3/easy-freezer-recipes-paleo-coconut-pecan-breakfast-bars/",
  "extension": "Chrome",
  "firstAdded": "2016-01-12T15:16:28.520000",
  "users": [
    null
  ],
  "keywords": [
    "coconut",
    "oil",
    "eggs",
    "banana",
    "honey",
    "vanilla",
    "flour",
    "milk",
    "pecans"
  ],
  "directions": [
    "0",
    "Preheat oven to 350 degrees. Use the coconut oil to grease an 8x8 pan.",
    "Crack your eggs into a medium sized bowl and quickly whisk them up.",
    "Mash your banana - I like to just do this quickly on a plate - add to the bowl with the eggs along with the honey and vanilla.",
    "Measure and add your coconut flour, making sure to combine everything well and ensuring there are no clumps.",
    "Measure and add the unsweetened shredded coconut and coconut milk and mix to ensure the batter is well combined.",
    "Spoon the batter into your pan and smooth it out. Sprinkle the chopped pecans over top.",
    "Bake your bars in the pre-heated oven for 20-25 minutes. Keep an eye on them - when the edges are golden brown and the center is firm, they're done!",
    "Freezing these is a cinch too! Simply wait for them to cool, cut them to the desired size and store them in a freezer container or freezer bag. I tend to try to do this as soon as I can - if they stay on the kitchen counter, they tend to disappear quickly!",
    "You can defrost them quickly by popping them in the microwave for about 30 seconds. If you're like my hubby and are not a fan of the microwave, you can pull out a few the night before and just leave them in the fridge and they'll be defrosted by breakfast the next morning."
  ],
  "ingredients": [
    "0",
    "Coconut oil",
    "2 eggs",
    "1 banana",
    "¼ cup honey",
    "½ tsp vanilla",
    "⅓ cup coconut flour",
    "1 cup unsweetened shredded coconut",
    "4 Tbsp coconut milk",
    "½ cup chopped pecans"
  ],
  "__v": 1
}