{
  "hash": "7b8ed613d94a5cd284c0c7a7b7fc2efe53a3d6b0",
  "title": "How to Cook Ribs in the Oven and Then Grill Them",
  "image": "https://cmeimg-a.akamaihd.net/640/clsd/7/2/c265b0b3c7d4459b80b27fe791269b8a.jpg",
  "href": "https://www.livestrong.com/article/442323-how-to-cook-ribs-in-the-oven-and-then-grill-them/",
  "extension": "Chrome",
  "firstAdded": "2018-12-28T01:45:56.495000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Step 1",
    "Use a sharp knife to cut loose one edge of the silver skin, the thin membrane found on the bone side of the ribs. Grab the edge with a paper towel and pull off the entire silver skin. Discard the skin.",
    "Step 2",
    "Massage your favorite spice rub into the ribs, rubbing the mixture all over every part of the ribs. Place the ribs in a large zip-top plastic bag and set the bag in the refrigerator for two hours.",
    "Step 3",
    "Preheat the oven to 325 degrees Fahrenheit. Remove the bag of ribs from the refrigerator and let the ribs come to room temperature while the oven preheats.",
    "Step 4",
    "Line a large baking sheet with two layers of aluminum foil. Take the ribs out of the bag and set them on the foil. Bring up the edges of all of the sides of both sheets of foil and crimp them to form a package around the ribs.",
    "Step 5",
    "Slide the baking sheet into the oven and cook the ribs for two hours.",
    "Step 6",
    "Preheat the grill to medium high heat, between 200 and 250 degrees Fahrenheit. Move the charcoal briquettes to the outside perimeter of the grill or turn off one of the burners on a gas grill to prepare an indirect cooking surface.",
    "Step 7",
    "Remove the ribs from the oven and carefully open the foil package. Use tongs to place the ribs directly on the preheated grill over the portion of the grill that doesn't have briquettes directly under it, or non-lit portion of the grill. Cover and cook for 30 minutes.",
    "Step 8",
    "Open the grill and brush the ribs with barbecue sauce, then flip the ribs and cook with the grill closed for another 10 minutes. Repeat this process twice more until the ribs have cooked on the grill for an hour total.",
    "Step 9",
    "Remove the ribs from the grill with the tongs when the outsides have a nice, crusty sear. Place the ribs on a serving platter, slice them into individual ribs and serve warm with extra barbecue sauce."
  ],
  "ingredients": [
    "0",
    "Things You'll Need",
    "Sharp knife",
    "Paper towels",
    "Spice rub",
    "Large zip-top plastic bag",
    "Aluminum foil",
    "Baking sheet",
    "Tongs",
    "Basting brush",
    "Barbecue sauce",
    "Serving platter"
  ],
  "__v": 1
}