{
  "hash": "e5fe0f78e6cb962f2f8c333a68627a51ed8edaf2",
  "title": "Chicken Cutlets With Mushroom Dressing",
  "image": "",
  "href": "http://cooking.nytimes.com/recipes/1017226-chicken-cutlets-with-mushroom-dressing?action=click&module=Collection+Page+Recipe+Card&region=Our+Best+Chicken+Thigh+Recipes&pgType=collection&rank=2",
  "extension": "Firefox",
  "firstAdded": "2016-11-23T19:02:24.322000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine lemon juice, half the olive oil and half the garlic in a shallow dish that can hold chicken in a single layer. Add chicken, turn to coat, dust with salt and pepper and top with thyme sprigs. Cover and refrigerate about 6 hours.",
    "About 45 minutes before serving, heat remaining olive oil in a 10-inch skillet. Add shallots and remaining garlic and sauté on medium until soft. Add mushrooms and sauté, stirring, until they are moist and softened, starting to color and have exuded juices. Shut off heat. Dissolve mustard in wine and mix in vinegar. Reheat mushrooms, add mustard mixture and cook on medium-high until liquid has reduced to thickness of heavy cream. Season with salt and pepper; remove from heat.",
    "Place flour in a shallow bowl, eggs in another bowl and bread crumbs in a third. Discard thyme sprigs from chicken. Dip chicken thighs, 1 at a time, lightly in flour, then egg, then crumbs to coat both sides. Set on a plate. Heat grapeseed oil in a large skillet, preferably cast iron. Sauté chicken cutlets on medium until golden brown, about 3 minutes per side in 2 shifts. Remove to a serving platter as they are done. Tent with foil to keep warm.",
    "Reheat mushrooms and add thyme leaves. Place some mushroom mixture on each cutlet along with a lemon wedge and serve."
  ],
  "ingredients": [
    "0",
    "3tablespoons lemon juice",
    "4tablespoons extra-virgin olive oil",
    "4cloves garlic, minced",
    "6boneless, skinless chicken thighs, about 2 pounds, pounded flat",
    "Salt and ground black pepper",
    "6sprigs fresh thyme plus 1 tablespoon thyme leaves",
    "⅓cup chopped shallots",
    "12ounces small button mushrooms, quartered",
    "2tablespoons Dijon mustard",
    "¼cup dry white wine",
    "1tablespoon good quality balsamic vinegar",
    "⅓cup flour",
    "2eggs, beaten",
    "¾cup dry bread crumbs",
    "4tablespoons grapeseed oil",
    "6lemon wedges"
  ],
  "__v": 1
}