{
  "hash": "12aa0cfff67ef99120caa52285591d2a7f8d9b25",
  "title": "Savory Vegetable Loaf Cake Recipe (Gluten-Free, Grain-Free, Vegetarian, Paleo)",
  "image": "http://gourmandeinthekitchen.com/wp-content/uploads/2013/09/Savory-Summer-Squash-Zucchini-and-Carrot-Vegetable-Loaf-Cake-Recipe-on-gourmandeinthekitchen.com_.jpg?173eee",
  "href": "http://gourmandeinthekitchen.com/2013/vegetable-loaf-recipe/",
  "extension": "Chrome",
  "firstAdded": "2015-07-02T10:48:33.456000",
  "users": [
    null
  ],
  "keywords": [
    "medium",
    "carrots",
    "zucchini",
    "yellow",
    "summer",
    "squash",
    "butter",
    "coconut",
    "oil",
    "garlic",
    "salt",
    "divided",
    "pepper",
    "eggs",
    "cupml",
    "kefir",
    "milk",
    "cupg",
    "flour",
    "sifted",
    "baking",
    "basil",
    "leaves"
  ],
  "directions": [
    "0",
    "Preheat oven to 350 degrees F. Line an 8 cup, 9x5 inch loaf pan with parchment paper and set aside.",
    "Cut the carrots, zucchini and summer squash in half lengthwise and then into thin slices on a mandolin or with the slicing blade on a food processor.",
    "In a large skillet or sauté pan heat butter or coconut oil. Add the minced garlic and stir until fragrant then add the sliced vegetables and season with ¼ tsp of salt and all the pepper.",
    "Cook over medium-low heat, stirring occasionally, until softened, about 8 to 10 minutes.",
    "Meanwhile, in a small bowl , sift together coconut flour, remaining ¼ tsp of salt and baking powder, set aside. In a large bowl whisk together eggs, kefir (or coconut milk) and whisk in flour mixture until fully incorporated and slightly thickened.",
    "Fold in the cooked vegetables and basil. Scrape mixture into prepared pan.",
    "Bake until light golden brown on top and set in the center, about 40-45 minutes. Remove cake from oven and let cool in pan 10 minutes.",
    "Remove from pan, and serve warm or let cool on a wire rack and serve at room temperature. Store leftovers in an airtight container in the fridge for up to 3 days."
  ],
  "ingredients": [
    "0",
    "4 medium carrots, peeled",
    "2 medium zucchini",
    "2 medium yellow summer squash",
    "2 Tablespoons butter or coconut oil",
    "1 large or two small garlic cloves, finely minced",
    "½ teaspoon sea salt divided",
    "1/8th teaspoon ground pepper",
    "6 large eggs",
    "¼ cup/60ml kefir or coconut milk",
    "¼ cup/28g coconut flour , sifted",
    "½ teaspoon baking powder",
    "1 small handful of fresh basil leaves, chopped (about 2 to 3 Tablespoons)"
  ],
  "__v": 1
}