{
  "hash": "41041e154a46e5b8ed553406e596490c84395955",
  "title": "Sweet and Spicy Chicken Bites {paleo}",
  "image": "http://www.theendlessmeal.com/wp-content/uploads/2015/01/Sweet-and-Spicy-Paleo-Chicken-Bites-600-3.jpg",
  "href": "http://www.theendlessmeal.com/sweet-and-spicy-paleo-chicken-fingers/",
  "extension": "Chrome",
  "firstAdded": "2016-08-18T20:27:50.336000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 425 degrees. Line a rimmed baking sheet with parchment paper. Trim any overhanging edges of the parchment paper.",
    "Place the almond flour, sea salt and fresh cracked pepper into a bowl and stir it together. Place the eggs in another bowl with a splash of water and whisk them.",
    "*STEP CHANGE*: Dip the chicken tenders, one at a time, into the tapioca or potato starch, then into the egg then into the almond flour. (Keeping one hand for the egg and one for the starch and flour makes this a lot less messy.) Lay the chicken tenders on the prepared baking sheet. Bake the chicken for 25 minutes, or until it is crispy and beginning to golden brown.",
    "*OPTIONAL STEP*: Let the chicken rest for 30-60 minutes in your fridge before you bake it. This step will help the crust to stick to the chicken.",
    "While the chicken is baking, prepare the sauce. In a small frying pan over high heat bring the honey, hot sauce and garlic powder to a boil then set it aside.",
    "When the chicken has finished baking remove it from the oven and turn the oven to broil. Dip each of the chicken tenders in the sauce then lay them back on the baking sheet. Save the extra sauce.",
    "Put the chicken back in the oven for 2-5 minutes for the glaze to caramelize slightly. Keep an eye on it to make sure it doesn't burn.",
    "Baste the chicken with any extra sauce one they come out of the oven then serve immediately."
  ],
  "ingredients": [
    "0",
    "2 ¼ cups almond flour (almond meal)",
    "½ teaspoon sea salt",
    "¼ teaspoon fresh cracked pepper",
    "2 eggs",
    "¼ cup tapioca or potato starch *NEW INGREDIENT*",
    "1 lb chicken tenders",
    "¾ cup honey",
    "⅓ cup hot sauce (Franks or Tapatio work great)",
    "½ teaspoon garlic powder",
    "Optional: yogurt or sour cream for dipping"
  ],
  "__v": 1
}