{
  "__v": 1,
  "directions": [
    "0",
    "Cut the cauliflower into florets, discarding the tough inner core. Working in batches, pulse the cauliflower in a food processor until it breaks down into rice-sized pieces. You should have 5 to 6 cups of cauliflower \"rice.\"",
    "→ For step-by-step instructions, see How To Make Couscous Out of Cauliflower.",
    "Cook the bacon in a 12-inch skillet over medium heat until crispy. Transfer to a plate lined with a paper towel to drain. Once cooled, roughly chop into pieces. Drain off all but a teaspoon of bacon grease (or use 1 teaspoon vegetable oil), reserving the grease.",
    "Place the pan back over medium-high heat. Whisk the eggs and pour them into the skillet. Quickly scramble the eggs or make an omelet. Transfer the eggs to a cutting board and roughly chop into pieces.",
    "Wipe the skillet clean and warm 1 tablespoon of bacon grease or vegetable oil over medium-high heat. Add the ginger and garlic, and sauté until fragrant, about 30 seconds. Stir in the carrots and sauté until crisp-tender, 2 minutes. Stir in the corn, peas, and the cauliflower \"rice\" into the pan, mixing the ingredients thoroughly.",
    "Lower the heat to medium, cover the pan, and cook until the cauliflower is tender, 5 to 8 minutes. Uncover and stir in the bacon, eggs, green onions, cashes, and 2 tablespoons of soy sauce. Taste and add more soy sauce to taste. Serve immediately.",
    "Leftovers will keep refrigerated for about a week."
  ],
  "firstAdded": "2014-09-12T03:33:15.289000",
  "hash": "a90a52ea2f3cbe7c492a7cd35b723a3bb967ac5c",
  "href": "http://www.thekitchn.com/recipe-fried-cauliflower-rice-recipes-from-the-kitchn-207661",
  "image": "http://p-ec2.pixstatic.com/5400b21edbfa3f4db9000009/_w.540_s.fit_/2014-09-02-Cauliflower_Fried_Rice-3.jpg",
  "ingredients": [
    "0",
    "1 head cauliflower",
    "1/2 pound (8 slices) thick-sliced bacon, optional",
    "2 large eggs",
    "1 tablespoon minced ginger",
    "3 cloves garlic, minced",
    "2 carrots, diced (about 1 cup)",
    "1 cup corn, fresh or frozen",
    "1/2 cup peas, fresh or frozen",
    "4 green onions, thinly sliced",
    "1/4 cup cashews, almonds or other nut",
    "2 to 3 tablespoons soy sauce"
  ],
  "keywords": [
    "head",
    "cauliflower",
    "slices",
    "thicksliced",
    "bacon",
    "eggs",
    "ginger",
    "garlic",
    "carrots",
    "corn",
    "frozen",
    "peas",
    "green",
    "onions",
    "cashews",
    "almonds",
    "nut",
    "soy"
  ],
  "title": "Cauliflower Fried \"Rice\"",
  "users": [
    null
  ]
}