{
  "hash": "220b325bfc2dac8278d0c700f888c126afbc2f34",
  "title": "Home-style chicken curry",
  "image": "//www.bbcgoodfood.com/sites/default/files/styles/recipe/public/user-collections/my-colelction-image/2015/12/recipe-image-legacy-id--908515_10.jpg?itok=rhm4Vwap",
  "href": "https://www.bbcgoodfood.com/recipes/1993658/homestyle-chicken-curry",
  "extension": "Chrome",
  "firstAdded": "2018-02-08T13:17:20.852000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Roughly chop the onion, transfer to a small food processor, and add 3 tablespoons of water - process to a slack paste. You could use a stick blender for this or coarsely grate the onion into a bowl – there’s no need to add any water if you are grating the onion. Tip into a small bowl and leave on one side.",
    "Put the chopped garlic and ginger into the same food processor and add 4 tbsp water – process until smooth and spoon into another small bowl. Alternatively, crush the garlic to a paste with a knife or garlic press and finely grate the ginger.",
    "Heat the oil in a wok or sturdy pan set over a medium heat. Combine the cumin and fennel seeds with the cinnamon and chilli flakes and add to the pan in one go. Swirl everything around for about 30 secs until the spices release a fragrant aroma.",
    "Add the onion paste – it will splutter in the beginning. Fry until the water evaporates and the onions turn a lovely dark golden - this should take about 7-8 mins. Add the garlic and ginger paste and cook for another 2 mins – stirring all the time.",
    "Stir in the garam masala, turmeric, and sugar and continue cooking for 20 secs before tipping in the tomatoes. Continue cooking on a medium heat for about 10 mins without a lid until the tomatoes reduce and darken.",
    "Cut the chicken thighs into 3cm chunks and add to the pan once the tomatoes have thickened to a paste. Cook for 5 mins to coat the chicken in the masala and seal in the juices, and then pour over the hot chicken stock. Simmer for 8-10 mins without a lid until the chicken is tender and the masala lightly thickened – you might need to add an extra ladleful of stock or water if the curry needs it. Sprinkle with chopped coriander and serve with Indian flatbreads or fluffy basmati rice and a pot of yogurt on the side."
  ],
  "ingredients": [
    "0",
    "1 large onion Onion un-yunOnions are endlessly versatile and an essential ingredient in countless recipes. Native to Asia…",
    "6 garlic cloves, roughly chopped",
    "50g ginger Ginger jin-jerMainly grown in Jamaica, Africa, India, China and Australia, ginger is the root of the plant. It… , roughly chopped",
    "4 tbsp vegetable oil",
    "2 tsp cumin seed",
    "1 tsp fennel seed Fennel seeds feh-nell seedsA dried seed that comes from the fennel herb, fennel seeds look like cumin seeds, only greener,…",
    "5cm cinnamon stick",
    "1 tsp chilli flakes",
    "1 tsp garam masala Garam masala gar-am mah-sarl-ahMeaning 'warming spice mix', garam masala is the main spice blend used in North Indian…",
    "1 tsp turmeric Turmeric term-er-ikTurmeric is a fragrant, bright golden-yellow root that is most commonly seen and used dried and…",
    "1 tsp caster sugar",
    "400g can chopped tomatoes",
    "8 chicken thighs, skinned, boneless (about 800g)",
    "250ml hot chicken stock",
    "2 tbsp chopped coriander"
  ],
  "__v": 1
}