{
  "hash": "ac5923f5a80f6cfc88c1847ef79f1b743f1cdb5e",
  "title": "Raspberry Macarons",
  "image": "http://natashaskitchen.com/wp-content/uploads/2015/10/Raspberry-Macarons-2.jpg",
  "href": "http://natashaskitchen.com/2015/10/23/raspberry-macarons-recipe-video-tutorial/",
  "extension": "Chrome",
  "firstAdded": "2017-05-29T23:36:48.320000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "How to Make Raspberry Macarons: Prep: Line 1 XL or 2 regular baking sheets with parchment paper or silpat.",
    "In the bowl of a good food processor, combine almond meal and powdered sugar and pulse twice to combine then process for 1½ min. Sift through a sieve into a large bowl, pressing down on clumps with the back of a spoon. You should have about ½ to 1 Tbsp of solids left over in the sieve - discard those (If you have alot more, pulse them a few more times in the food processor).",
    "Place 2 egg whites in a large bowl and beat until foamy. Gradually add ¼ cup sugar then increase to high speed and beat 2½ min or until stiff glossy peaks form.",
    "Add sifted almond mixture and fold with spatula from the bottom of the bowl upward then press the flat side of your spatula firmly through the middle. Repeat until batter flows like lava and thick ribbons form as it flows off the spatula. (35-40 complete strokes).",
    "Fit a pastry bag with a large (3/8\" wide) round tip and transfer batter inside. Pipe ¾\" round cookies onto the lined baking sheet, keeping them 1\" apart. Drop the sheets 6\" over the counter to release air bubbles about 15-20 times.",
    "Place freeze dried raspberries in a ziploc bag and crush them with a rolling pin until they are a powder. Use a small sifter or tea ball to dust the tops of the cookies with raspberry powder. Let cookies sit at room temp at least 30 min or until they form a thin film over the top and don't stick to your finger when poked. Meanwhile, complete steps 1 & 2 of the frosting (see below).",
    "While cookies are resting, Preheat Oven to 300˚F with rack in the center. Bake 15 min. If they didn't all fit on one sheet, bake in two separate batches. Slide parchment paper and cookies onto the counter right away and cool to room temp (15 min). Now you can finish off step 3 of the frosting and pipe frosting generously onto half of your macaroons and sandwich gently with the second cookie shell.",
    "How to Make the Raspberry Buttercream Frosting:",
    "In a small sauce pan over medium heat, combine ¾ cup raspberries, 2 Tbsp granulated sugar and 1 Tbsp lemon juice. Heat until bubbling.",
    "Mash up the raspberries with a spoon then push the mixture through a sieve, pressing on the raspberry seeds to get the most juice out. I got ⅓ cup syrup. Keep the syrup/juice and discard seeds. Let cool to room temp.",
    "In a medium bowl, beat 6 Tbsp butter until whipped and white (2 min on high), Add in room temp raspberry syrup and beat until whipped and fluffy (2½ to 3 min on high)."
  ],
  "ingredients": [
    "0",
    "Ingredients for Macarons:",
    "70 grams (about ⅔ cup) almond meal/flour",
    "120 grams (about 1 cup) confectioners (powdered) sugar",
    "2 large egg whites (about 65 grams), room temp",
    "50 grams (exactly ¼ cup leveled) granulated sugar",
    "¼ cup freeze dried raspberries",
    "Ingredients for Raspberry Buttercream:",
    "¾ cup fresh or frozen raspberries",
    "2 tbsp granulated sugar",
    "1 Tbsp lemon juice",
    "6 Tbsp unsalted butter, room temp"
  ],
  "__v": 1
}