{
  "hash": "834af5ae44afacd9124de9377cf42488b76e845a",
  "title": "Easy Vegan Green Curry with Forbidden Rice",
  "image": "https://cmt.azureedge.net/media/easy_vegan_green_curry_with_forbidden_ri_201812281555249860321jhjsa.jpg",
  "href": "https://www.copymethat.com/r/yKRRdk4/easy-vegan-green-curry-with-forbidden-ri/",
  "extension": "",
  "firstAdded": "2018-12-28T23:20:34.184000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the rice: add rice and 2 cups of water to a small saucepan. Bring the mixture to a boil, cover and reduce to simmer for 25 minutes.",
    "Make the green curry paste: add the shallot, garlic, lime juice zest, 1 tablespoon oil, tamari, sugar, spices, basil and water into a blender. Blend on high until a thick paste forms, about 10 seconds.",
    "Make the curry: heat the remaining oil in a large saucepan or Dutch oven over medium heat. Once hot, add the peppers, green beans and peppers and saute until just starting to soften, about 5 minutes. Add in curry paste and stir together, cooking for another 2 minutes. Pour in coconut milk and tofu and bring the mixture to a boil. Reduce to simmer, partially cover and let cook for 15 minutes.",
    "To serve: just before serving, stir in brown rice vinegar and another splash of tamari. Divide the rice evenly among bowls and top with curry. Sprinkle with fresh herbs, red pepper flakes and a spritz of lime."
  ],
  "ingredients": [
    "0",
    "1 cup forbidden rice",
    "1 shallot",
    "4 garlic cloves",
    "2 hot peppers with or without seeds (I used 1 serrano 1 jalapeno)",
    "Zest juice of 1 lime",
    "2 tablespoons avocado oil divided (or coconut, olive, etc.)",
    "1 tablespoon gluten-free tamari",
    "1 tablespoon coconut sugar or maple syrup",
    "1 1/2 teaspoons Simply Organic Ginger",
    "1 tablespoon Simply Organic Curry Powder",
    "1 teaspoon Simply Organic Cumin",
    "1/2 cup thai basil or regular basil",
    "1/4 cup water",
    "1 cup sliced carrots",
    "1 1/2 cups sliced green beans",
    "1 cup sliced red bell pepper",
    "1 14.5 oz can full-fat coconut milk",
    "1 8 oz package extra firm tofu, cubed",
    "1 teaspoon brown rice vinegar",
    "to garnish: chopped cilantro Simply Organic Red Pepper Flakes, lime"
  ],
  "__v": 1
}