{
  "hash": "309ba754b32c7f218e9b7293332ce54a15b3df48",
  "title": "No Churn Vegan Mango Ice Cream",
  "image": "http://www.mariaushakova.com/wp-content/uploads/2015/04/no-churn-vegan-mango-ice-cream_.jpg",
  "href": "http://www.mariaushakova.com/2015/04/no-churn-vegan-mango-ice-cream/",
  "extension": "Chrome",
  "firstAdded": "2015-08-27T17:13:05.608000",
  "users": [
    null
  ],
  "keywords": [
    "fat",
    "coconut",
    "milk",
    "arrowroot",
    "maple",
    "syrup",
    "alcohol",
    "based",
    "vanilla",
    "puree",
    "frozen",
    "mango",
    "chunks",
    "muffin",
    "pan",
    "food",
    "processor"
  ],
  "directions": [
    "0",
    "Pour all contents from the coconut milk can into a medium pot. Place 3 to 4 tablespoons of the coconut milk liquid into a small bowl (sometimes there will be solid and liquid coconut milk in a can depending on the quality of the coconut milk and the room or storage temperature). Add 1 tablespoon of the arrowroot powder into the bowl and whisk until fully smooth.",
    "Place the pot with the coconut milk on the stove and start warming it up over medium heat. Once the solid parts of the coconut milk dissolved and the coconut milk became fully liquid, slowly pour the arrowroot mixture into the coconut milk making sure to constantly whisk.",
    "You will notice that as you warm it up, the coconut milk will become thicker. It is very important not to overheat it - do not bring it to a boil or simmer because if overheated the arrowroot powder will lose it's thickening ability. Once the coconut milk is hot take it off the heat and let it cool a bit.",
    "In the meantime prepare the mango puree. I prefer to thaw the mango chunks a bit before processing them. I find it's easier to process them to a very smooth puree when they are a bit softer and not fully frozen. But it also depends on your food processor as some are more powerful than others. Mangoes have very tough fibers so process the mango chunks until the fibers are fully broken for about 3 minutes.",
    "Once the coconut milk is room temperature, add the maple syrup and vanilla extract and stir to combine. Add the coconut milk mixture to the mango puree in the food processor and process some more until fully smooth.",
    "Divide the ice cream mixture equally among the 12 muffin cups. Place the muffin pan into the freezer and let the ice cream freeze for about 3 hours (depends on the temperature in your freezer). Once the ice cream is frozen, pop the ice cream cups out of the muffin pan and store them in a glass container with a tight lid or in a plastic bag.",
    "Once ready to serve, place the ice cream cups into a food processor (break them up with a knife if needed before placing them into a food processor) and process until soft ice cream consistency. Scoop into bowls and serve."
  ],
  "ingredients": [
    "0",
    "1 can (398 ml) full fat unsweetened coconut milk",
    "1 Tbsp arrowroot powder",
    "2 Tbsp maple syrup",
    "1 Tbsp alcohol based vanilla extract",
    "1 1/2 cup mango puree (about 2 to 2 1/2 cup frozen mango chunks)",
    "1",
    "12 cup muffin pan",
    "food processor"
  ],
  "__v": 1
}