{
  "hash": "83f825d04daf81efc23c9c0e1987b0cb23de77fc",
  "title": "Spinach and Artichoke Baked Whole Grain Pasta",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/rachael-ray/spinach-and-artichoke-baked-whole-grain-pasta-recipe.html?soc=fyesocial_20150728_49587216&adbid=z12mdfhpxq3bex4kn233vx1z0xbbunemv&adbpl=gp&adbpr=100091697767366769792",
  "extension": "Chrome",
  "firstAdded": "2015-07-28T10:59:19.335000",
  "users": [
    null
  ],
  "keywords": [
    "boxes",
    "frozen",
    "spinach",
    "salt",
    "wheat",
    "penne",
    "macaroni",
    "short",
    "pasta",
    "extravirgin",
    "olive",
    "oil",
    "shallot",
    "garlic",
    "box",
    "artichoke",
    "hearts",
    "defrosted",
    "pat",
    "dry",
    "white",
    "wine",
    "butter",
    "slightly",
    "rounded",
    "flour",
    "milk",
    "black",
    "pepper",
    "nutmeg",
    "gruyere",
    "cheese",
    "parmigianoreggiano"
  ],
  "directions": [
    "0",
    "Position the oven rack in center of the oven. Preheat the oven to 375 degrees F.",
    "Defrost the spinach in the microwave. Drain, then dry the spinach out as much as possible by wringing it out in a clean kitchen towel.",
    "Bring a saucepot of water to a boil. Add salt. Add the pasta and cook according to package directions for al dente.",
    "Meanwhile, heat 2 tablespoons extra-virgin olive oil in a small skillet over medium to medium-high heat and add the shallots and garlic and cook 2 to 3 minutes. Add the artichokes and cook until they are lightly brown. Add the wine to deglaze the pan.",
    "While the artichokes and pasta cook, in a saucepot over medium to medium-high heat, add the butter. When melted, whisk in the flour for 1 minute or so, then whisk in the milk and season with salt, pepper and a little nutmeg. Cook 5 to 6 minutes, or until thick enough to coat the back of a spoon, adjust the seasonings and stir in the Gruyere cheese. Combine the sauce with the spinach, pasta, and artichoke and stir until just combined. Transfer the mixture to a baking dish and cover with the remaining cheese. Cool and store for a make-ahead meal.",
    "Bake on a baking sheet 45 minutes or until brown and bubbly on top.",
    "Recipe courtesy of Rachael Ray"
  ],
  "ingredients": [
    "0",
    "2 (10-ounce) boxes frozen spinach",
    "Salt",
    "1 pound whole wheat or whole grain penne pasta or macaroni (any short cut pasta)",
    "2 tablespoons extra-virgin olive oil",
    "1 large shallot, chopped",
    "4 cloves garlic, finely chopped or grated",
    "1 (10-ounce) box frozen artichoke hearts, defrosted, halved, pat dry",
    "1/2 cup dry white wine",
    "4 tablespoons butter",
    "3 slightly rounded tablespoons flour",
    "2 cups milk",
    "Freshly ground black pepper",
    "Freshly grated nutmeg",
    "5 ounces Gruyere cheese, shredded (about 1 1/2 cups)",
    "1 cup shredded Parmigiano-Reggiano cheese"
  ],
  "__v": 1
}