{
  "hash": "b4547d12df448fd9c2f1696866cdcacbaa7b4dd4",
  "title": "Grapefruit Custard Pie with a Saltine Pie Crust",
  "image": "http://prodstatics3cdn1.tastingtable.com/images/articles/2014_03/Grapefruit_Pie_Saltine_Crust_Campari_Eggs_Grapefruit_Juice_Dessert_American_Vgetarian_Four_Twenty_Blackbirds_Emily_Melissa_Elsen_Brooklyn_New_York_ARticle.jpg",
  "href": "http://www.tastingtable.com/entry_detail/chefs_recipes/15633/Grapefruit_Custard_Pie_with_a_Saltine_Pie_Crust.htm",
  "firstAdded": "2015-01-20T19:37:18.120000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "tops",
    "saltine",
    "crackers",
    "crumbs",
    "granulated",
    "sugar",
    "butter",
    "allpurpose",
    "flour",
    "kosher",
    "salt",
    "eggs",
    "egg",
    "yolk",
    "squeezed",
    "grapefruit",
    "juice",
    "grapefruits",
    "campari",
    "liqueur",
    "cream",
    "orangeflavored",
    "cocktail",
    "bitters"
  ],
  "directions": [
    "0",
    "Make the crust: In the bowl of a food processor fitted with the blade attachment, grind the crackers to fine crumbs. Add the sugar and melted butter and pulse just to incorporate.",
    "Pour the crumbs into an ungreased 9-inch pie pan. Spread evenly over the bottom then create a circle about 1-inch in to separate the crumbs for the sides from the crumbs for the bottom. Start pressing the outer ring of crumbs evenly up the sides and into the corner (where the side meets the bottom) of the pan. Press the remaining crumbs evenly over the bottom to meet the sides; use a flat-bottomed cup to smooth out bumps. Put the pie pan into the freezer and freeze until solid, about 10 minutes.",
    "Prebake the crust: Preheat the oven to 350 degrees. Bake on the center oven rack until fragrant and darkened slightly, 14 to 16 minutes. (If the crust slumps or cracks while baking, gently push the crumbs back into place, while hot, with a clean, folded kitchen towel.) Cool completely on a wire rack, and refrigerate the crust for 10 minutes prior to filling to set the crumbs in place to make filling easier.",
    "Make the pie: Position a rack in the center of the oven and preheat the oven to 325°F. Place the prebaked pie shell on a rimmed baking sheet.",
    "In a large bowl, whisk together the sugar, flour, salt and melted butter. Whisk in the eggs and egg yolk one at a time, blending well after each addition. Whisk in the grapefruit juice, Campari, heavy cream, and bitters, if using. Strain the filling through a fine-mesh sieve directly into the pie shell, or strain it into a separate bowl and then pour it into the shell.",
    "Bake on the middle rack of the oven for 50 to 55 minutes, rotating the pan 180 degrees when the edges start to set, 30 to 35 minutes through baking. The pie is finished when the edges are set and puffed slightly and the center is no longer liquid but still quite wobbly. (Be careful not to overbake or the custard can separate; the filling will continue to cook and set after the pie is removed from the oven.)",
    "Allow the pie to cool completely on a wire rack, 2 to 3 hours. Serve at room temperature or cool. (The pie will keep refrigerated for 2 days or at room temperature for 1 day.)"
  ],
  "ingredients": [
    "0",
    "30 unsalted tops saltine crackers (enough for 1 cup crumbs)",
    "3 tablespoons granulated sugar",
    "5 tablespoons unsalted butter, melted",
    "1¼ cups granulated sugar",
    "2 tablespoons all-purpose flour",
    "½ teaspoon kosher salt",
    "2 tablespoons unsalted butter, melted",
    "3 large eggs",
    "1 large egg yolk",
    "1 cup freshly squeezed grapefruit juice (from about 2 grapefruits)",
    "3 tablespoons Campari liqueur",
    "1 cup heavy cream",
    "Dash orange-flavored cocktail bitters (optional)"
  ],
  "__v": 1
}