{
  "hash": "a12bb847043332cf034d351476275c958a6d6014",
  "title": "Pioneer Woman's Cinnamon Rolls",
  "image": "http://73f0e1518e903443913e6712.triedandtastycom.netdna-cdn.com/wp-content/uploads/2010/12/image_110-799x533.jpg?150b6e",
  "href": "http://triedandtasty.com/pioneer-woman%e2%80%99s-cinnamon-rolls/",
  "extension": "",
  "firstAdded": "2015-10-18T16:43:08.870000",
  "users": [
    null
  ],
  "keywords": [
    "milk",
    "oil",
    "sugar",
    "pkgs",
    "active",
    "dry",
    "yeast",
    "extra",
    "separated",
    "allpurpose",
    "flour",
    "heaping",
    "baking",
    "scant",
    "soda",
    "salt",
    "butter",
    "cinnamon",
    "maple",
    "flavoring"
  ],
  "directions": [
    "0",
    "Mix the milk, vegetable oil and sugar in a pan. Scald the mixture (heat until just before the boiling point). Turn off heat and leave to cool 45 minutes to 1 hour. When the mixture is lukewarm to warm, but not hot, sprinkle in both packages of yeast. Let sit for a minute. Then add 8 cups of flour. Stir mixture together. Cover and let rise for at least an hour. After rising for at least an hour, add 1 more cup of flour, the baking powder, baking soda and salt. Stir mixture together. (At this point, you could cover the dough and put it in the fridge until you need it – overnight or even a day or two, if necessary. Keep your eye on it and if it starts to overflow out of the pan, punch it down). When ready to prepare rolls: Sprinkle rolling surface generously with flour. Take half the dough and form a rough rectangle. Then roll the dough thin, maintaining a general rectangular shape. Drizzle 1/2 to 1 cup melted butter over the dough. Now sprinkle 1 cup of sugar over the butter followed by a generous sprinkling of cinnamon. Starting at the opposite end, begin rolling the dough in a neat line toward you. Keep the roll relatively tight as you go. Pinch the seam of the roll to seal it. Spread 1 tbsp. of melted butter in a seven inch round foil cake or pie pan. Then begin cutting the rolls approximately ¾ to 1 inch thick and laying them in the buttered pans. Repeat this process with the other half of the dough. Let the rolls rise for 20 to 30 minutes, then bake at 375 degrees until light golden brown, about 15 to 18 minutes.",
    "1",
    "Mix together all ingredients listed and stir well until smooth. It should be thick but pourable. Taste and adjust as needed. Generously drizzle over the warm rolls."
  ],
  "ingredients": [
    "0",
    "4 c. whole milk",
    "1 c. vegetable oil",
    "1 c. sugar",
    "2 pkgs. Active Dry Yeast",
    "8 c (plus 1 c extra, separated) all-purpose flour",
    "1 tsp (heaping) baking powder",
    "1 tsp (scant) baking soda",
    "1 tbsp (heaping) salt",
    "1 1/2 c. butter, melted",
    "2 c. sugar",
    "Cinnamon",
    "1",
    "1 (2 lb.) bag powdered sugar",
    "2 teaspoons maple flavoring",
    "1/2 c milk",
    "1/4 c butter, melted",
    "1/8 tsp salt"
  ],
  "__v": 1
}