{
  "__v": 1,
  "directions": [
    "0",
    "In a medium bowl, whisk together the flour, baking powder, baking soda, salt, cinnamon, nutmeg, ginger, and cloves. Set aside.",
    "In a small bowl or measuring cup, whisk to combine the buttermilk and pumpkin puree. Set aside.",
    "In the bowl of a stand mixer, fitted with the paddle attachment, beat the butter and both sugars together until well blended, about 1 minute. Add in the egg and vanilla and mix until combined.",
    "With the mixer on low speed, add in the flour mixture, in 3 additions, alternating with the buttermilk mixture. Start and end with the flour mixture.",
    "When the dough comes together (dough will be slightly wet), cover and refrigerate for about 3 hours.",
    "On a well floured work surface, pat out the dough to 1/2 inch thick round. Using a 3-inch circle cutter (or smaller), cut circles out of the dough. If you don't have a doughnut cutter, use something smaller to cut out the centre, I used a 1M piping tip for this. Re-roll any dough scraps. Place dough on a cookie sheet, or something large, covered with wax or parchment paper.",
    "Add oil to a large heavy bottomed pot or dutch oven, to a depth of 2 to 3 inches. Alternatively you can use a deep fryer if you have one. Heat the oil to 365 to 370 degrees F. Add the dough rings, about 3 to 4 at a time, so that they are not touching. Fry the doughnuts, turning once, until they are golden brown and cooked through, about 3 to 4 minutes. The doughnut holes will be cooked in a much shorter period of time, about 1 to 2 minutes. Transfer the cooked doughnuts to a paper towel lined tray or rack. Bring the oil back up to temperature, and repeat for the remaining doughnuts.",
    "In a bowl, large enough to dip the doughnuts, whisk together the powdered sugar, spices, and buttermilk.",
    "Dip the doughnuts into the glaze, and put them on a rack lined with parchment to catch any drips. Let the glaze set before serving."
  ],
  "firstAdded": "2014-07-20T18:50:13.025000",
  "hash": "efddb3163742d1d26bdf555589eb5cac3d4d3f81",
  "href": "http://www.portuguesegirlcooks.com/2012/09/pumpkin-doughnuts-with-buttermilk-spiced-glaze/",
  "image": "http://www.portuguesegirlcooks.com/wp-content/uploads/2012/09/pumpkin-spice-doughnuts-2.jpg",
  "ingredients": [
    "0",
    "1 3/4 cups all-purpose flour",
    "2 teaspoons baking powder",
    "1/4 teaspoon baking soda",
    "1/2 teaspoon salt",
    "1 teaspoon cinnamon",
    "1/2 teaspoon nutmeg",
    "1/4 teaspoon ginger",
    "1/8 teaspoon cloves",
    "1 1/2 tablespoons unsalted butter, room temperature",
    "1/4 cup packed light brown sugar",
    "1/4 cup sugar",
    "1 egg",
    "1 teaspoon vanilla",
    "1/4 cup buttermilk",
    "1/2 cup pure pumpkin puree, canned or homemade",
    "Oil for frying, such as canola, vegetable, or peanut",
    "1 cup powdered sugar",
    "1/2 teaspoon cinnamon",
    "1/8 teaspoon nutmeg",
    "1/8 teaspoon ginger",
    "pinch of cloves",
    "2 tablespoons buttermilk"
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "baking",
    "soda",
    "salt",
    "cinnamon",
    "nutmeg",
    "ginger",
    "unsalted",
    "butter",
    "room",
    "light",
    "brown",
    "sugar",
    "egg",
    "vanilla",
    "buttermilk",
    "pumpkin",
    "puree",
    "canned",
    "oil",
    "frying",
    "canola",
    "peanut"
  ],
  "title": "Pumpkin Doughnuts with Buttermilk Spiced Glaze",
  "users": [
    null
  ]
}