{
  "hash": "9947350a5334d02ec77faabc6acb1c3e6545444c",
  "title": "A simple roasted butternut squash salad",
  "image": "http://cdn.ohsheglows.com/wp-content/uploads/2015/10/butternutsquashsaladwarmvegan.jpg",
  "href": "http://ohsheglows.com/2015/10/20/a-simple-roasted-butternut-squash-salad/",
  "extension": "Chrome",
  "firstAdded": "2016-02-15T22:13:24.038000",
  "users": [
    null
  ],
  "keywords": [
    "roasted",
    "butternut",
    "squash",
    "seeded",
    "cubes",
    "coconut",
    "oil",
    "salt",
    "salad",
    "uncooked",
    "quinoa",
    "avocado",
    "lemon",
    "lime",
    "juice",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "Directions:",
    "For the squash: Preheat the oven to 400F and line two large baking sheets with parchment paper.",
    "Spread the chopped squash onto the baking sheets and drizzle on 1 tablespoon of oil over top each. Toss to coat. Spread the squash into an even layer, being careful not to overcrowd the squash, and garnish with a few pinches of sea salt.",
    "Roast the squash until the bottoms are just starting to brown. For my oven, this takes about 50 minutes, but your time may vary. I recommend checking on it after 30 minutes, and then every 5-10 minutes after that. I don’t bother flipping it halfway through, but I do rotate the pans once half way through roasting as I have a hot spot in my oven. I find the squash tastes best when the bottoms are slightly browned (more than the photo shows).",
    "For the salad: Prepare the quinoa once you have about 25 minutes left of roasting the squash. Rinse the quinoa in a fine mesh sieve and transfer to a medium pot. Add 1 3/4 cups water and bring to a simmer over medium-high heat. Reduce heat to medium, cover with a tight-fitting lid, and cook for 13-16 minutes, until the water is absorbed and the quinoa is tender and fluffy. Once cooked, fluff with a fork and remove from heat. Season the quinoa to taste with a generous amount of salt and pepper and stir to combine. Keep the lid on until ready to use so it stays warm.",
    "Pit and chop the avocado and have it ready to go just before assembly.",
    "When the squash is finished cooking, spread the warm quinoa onto a platter (or you can simply combine everything in a large bowl). Top the quinoa with all of the (hot out of the oven) roasted squash, and finally the chopped avocado. Garnish with a couple more pinches of salt, and a small amount of fresh lemon juice (or lime juice) drizzled over top (or you can try lemon or lime zest for a twist). I use a light touch with lemon juice as it can quickly overwhelm the other flavors. Serve immediately.",
    "Tips:",
    "Want to change this dish up? Here are some ideas on how you can create a new dish!",
    "- Add some minced garlic to the cooked quinoa for a subtle garlic flavour",
    "- Sprinkle on some garlic powder or nutritional yeast",
    "- Add black beans, chickpeas, or any bean of choice for a boost of protein",
    "- Try experimenting with spices like cumin + chili powder + cayenne; cinnamon + nutmeg; curry powder + coriander, etc.",
    "- Switch it up and use lemon juice instead of lime juice, and vice versa",
    "- Try sprinkling fresh minced herbs to finish, such as parsley or cilantro",
    "- Switch up the grains - I think a small amount of rice would pair really well here",
    "- Skip the avocado and sprinkle on my pecan parmesan for a nutty crunch",
    "- Add finely shredded kale, chard, or spinach for a boost of green power"
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "For the roasted butternut squash:",
    "1 large butternut squash (about 3-3.5lb) peeled, seeded, and diced (1/2-inch cubes, 8-9 cups chopped)",
    "2 tablespoons melted coconut oil, or oil of choice",
    "Fine sea salt, to taste",
    "For the salad:",
    "1 cup uncooked quinoa",
    "1 large avocado, pitted and chopped",
    "Fresh lemon or lime juice, to taste",
    "Fine sea salt and freshly ground black pepper, to taste"
  ],
  "__v": 1
}