{
  "hash": "31230647658158d5a1c907f397e1031c6a8f2595",
  "title": "Brown Butter Mashed Potatoes",
  "image": "http://thefoodcharlatan.com/wp-content/uploads/2014/11/pin-it1.jpg",
  "href": "http://thefoodcharlatan.com/2014/11/11/browned-butter-mashed-potatoes-recipe/",
  "extension": "Firefox",
  "firstAdded": "2015-11-01T21:31:48.570000",
  "users": [
    null
  ],
  "keywords": [
    "red",
    "potatoes",
    "equal",
    "size",
    "pieces",
    "milk",
    "needed",
    "sour",
    "cream",
    "salt",
    "pepper",
    "garlic",
    "onion",
    "parsley",
    "parmesan",
    "horseradish",
    "butter"
  ],
  "directions": [
    "0",
    "Bring a large pot of water to boil.",
    "Scrub the potatoes clean and chop them. The smaller they are, the faster they will boil. I do mine in about 1-2 inch pieces.",
    "Add the potatoes to the pot and bring to a boil. Lower the heat to medium and simmer for 20-35 minutes, depending on the size of your potatoes.",
    "When they are fork-tender, drain the water and return the potatoes to the pot, or to a large bowl.",
    "Add the milk, sour cream, salt, pepper, minced garlic, onion powder, parsley, and Parmesan.",
    "Mash the potatoes with a potato masher or with a hand mixer. Add some horseradish sauce and mix it in. Taste it to see if you want more.",
    "Add the butter to a pot or skillet. Turn the heat to medium. Cook, stirring every 1-2 minutes with a wooden spoon. After a couple minutes, the butter will start to foam. Keep watching it. Eventually the butter will turn brown and you will see tiny brown specks. The smell will turn nutty. You might not be able to see the color under the foam very well, which is part of the reason you need to stir. Once it is brown and it looks silty at the bottom, it is done. Pour it into a bowl to stop the cooking process.",
    "At this point you can either add all the butter to the potatoes and mix it in, or let people spoon it over each serving. I prefer the latter. Because how often do you get to DRIZZLE BUTTER."
  ],
  "ingredients": [
    "0",
    "5 pounds red potatoes, chopped into equal size pieces",
    "1/3 milk (more as needed)",
    "1/2 cup sour cream",
    "1 and 1/2 teaspoons salt",
    "3/4 teaspoon pepper",
    "2 cloves garlic, minced",
    "1 and 1/2 teaspoon onion powder",
    "2-3 tablespoons fresh parsley, chopped (or 2 teaspoons dried)",
    "1/3 cup Parmesan, grated",
    "1 to 5 teaspoons horseradish sauce (taste it!)",
    "3/4 cup (1 and 1/2 sticks) butter"
  ],
  "__v": 1
}