{
  "hash": "372224d9afae0f771889dfeb2f7e422ea247a43d",
  "title": "How to Make Perfect Hard Boiled Eggs\n213",
  "image": "",
  "href": "http://www.simplyrecipes.com/recipes/how_to_make_perfect_hard_boiled_eggs/",
  "extension": "Chrome",
  "firstAdded": "2015-05-08T01:49:53.505000",
  "users": [
    null
  ],
  "keywords": [
    "make",
    "perfect",
    "hard",
    "boiled",
    "eggs",
    "time",
    "minutes",
    "know",
    "older",
    "easier",
    "planning",
    "easter",
    "want",
    "sure",
    "easy",
    "peel",
    "buy",
    "week",
    "ahead",
    "weeks",
    "better",
    "theyll",
    "need",
    "easytopeel",
    "try",
    "steaming",
    "pour",
    "pot",
    "insert",
    "basketbring",
    "boil",
    "cover",
    "check",
    "dont",
    "steamer",
    "basket",
    "water",
    "steam",
    "penetrates",
    "shell",
    "bit",
    "making",
    "youve",
    "batch",
    "finding",
    "difficult",
    "cracking",
    "shells",
    "peeling",
    "soaking",
    "seep",
    "egg",
    "live",
    "high",
    "altitude",
    "sit",
    "hot",
    "longer",
    "lower",
    "heat",
    "maintain",
    "low",
    "simmer"
  ],
  "directions": [
    "0",
    "METHOD",
    "1. Place the eggs in a single layer at the bottom of a saucepan. Cover with at least an inch or two of cold water. The more eggs that are crowding the pan the more water you should have over the eggs. Heat the pot on high heat and bring the water to a full rolling boil.",
    "Adding a teaspoon of vinegar to the water may help keep egg whites from running out if an egg does crack while cooking. Also some people find adding 1/2 teaspoon of salt to the water helps prevent cracking as well as making the eggs easier to peel.",
    "2. Turn off the heat, keep the pan on the hot burner, cover, and let sit for 10-12 minutes.",
    "If you have the type of stove burner that doesn't retain any heat when turned off, you might want to lower the temp to low, simmer for a minute, and then turn it off.",
    "Depending on how cooked you like your hard boiled eggs, the eggs should be done perfectly in 10-12 minutes. That said, depending on your altitude, the shape of the pan, the size of the eggs, the ratio of water to eggs, it can take a few minutes more. Or if you like your eggs not fully hard cooked, it can take a few minutes less. When you find a time that works for you, given your preferences, the types of eggs you buy, your pots, stove, and cooking environment, stick with it.",
    "If I'm cooking a large batch of eggs, after 10 minutes I'll sacrifice one to check for doneness, by removing it with a spoon, running it under cold water, and cutting it open. If it's not done enough for my taste, I'll cook the other eggs a minute or two longer.",
    "I also find that it is very hard to overcook eggs using this method. I can let the eggs sit, covered, for up to 15-18 minutes without the eggs getting overcooked.",
    "3. Strain out the water from the pan and run cold water over the eggs to cool them quickly and stop them from cooking further. Or, if you are cooking a large batch of eggs, remove them with a slotted spoon to a large bowl of ice water.",
    "I find it easiest to peel the eggs under a bit of running water.",
    "The best way to store hard boiled eggs is in a covered container in the refrigerator. Eggs can release odors in the fridge which is why it helps to keep them covered.",
    "They should be eaten within 5 days.",
    "Print",
    "Hello! All photos and content are copyright protected. Please do not use our photos without prior written permission. If you wish to republish this recipe, please rewrite the recipe in your own unique words and link back to the source recipe here on Simply Recipes. Thank you!",
    "The good thing about this method is that even if you forget and the eggs sit in the water a few minutes longer than you had planned, they'll still be fine.",
    "Some people like their eggs less or more hard cooked than others. If you want your eggs still a little translucent in the center, let them seep in the hot water for only 6 minutes or so."
  ],
  "ingredients": [
    "0",
    "How to Make Perfect Hard Boiled Eggs",
    "Cook time: 12 minutes",
    "Did you know? Older eggs are easier to peel than fresh eggs. If you are planning to make hard boiled eggs for Easter and want to make sure that the eggs are easy to peel, buy your eggs at least a week ahead of time (two weeks even better, they'll keep).",
    "If you need easy-to-peel eggs and you have fresh eggs, you might want to try steaming the eggs for 15 minutes. Pour an inch of water into a pot and insert a steamer basket.Bring to a boil. Place the eggs in the steamer basket, cover and steam for 15 minutes (more or less, check!). (Or if you don't have a steamer basket, steam the eggs in a half inch of water.) The steam penetrates the shell a bit making the eggs easier to peel.",
    "If you've boiled a batch of eggs that you are now finding difficult to peel, try cracking the shells all around without peeling them and soaking the eggs in water for a while. The water often seems to seep in enough under the shell to make the egg easier to peel.",
    "If you live at high altitude, let the eggs sit in the hot water longer or lower the heat and maintain a low simmer for 10 to 12 minutes."
  ],
  "__v": 1
}