{
  "hash": "16661269b76798cdf7f3fc4f36eda4a201465c6f",
  "title": "Simple Pumpkin Soup",
  "image": "http://cdn3.minimalistbaker.com/wp-content/uploads/2014/10/SIMPLE-7-Ingredient-Pumpkin-Soup-vegan-glutenfree.jpg",
  "href": "http://minimalistbaker.com/simple-pumpkin-soup/",
  "extension": "Chrome",
  "firstAdded": "2015-09-29T00:52:50.486000",
  "users": [
    null
  ],
  "keywords": [
    "sugar",
    "pumpkins",
    "pumpkin",
    "puree",
    "shallots",
    "garlic",
    "veggie",
    "stock",
    "light",
    "coconut",
    "sub",
    "nondairy",
    "milk",
    "varied",
    "results",
    "maple",
    "syrup",
    "agave",
    "nectar",
    "honey",
    "vegan",
    "salt",
    "black",
    "pepper",
    "cinnamon",
    "nutmeg",
    "roughly",
    "kale",
    "clove",
    "raw",
    "sesame",
    "seeds",
    "olive",
    "oil"
  ],
  "directions": [
    "0",
    "Preheat oven to 350 degrees F and line a baking sheet with parchment paper.",
    "Using a sharp knife, cut off the tops of two sugar pumpkins and then halve them. Use a sharp spoon to scrape out all of the seeds and strings (see notes for a link to roasting seeds).",
    "Brush the flesh with oil and place face down on the baking sheet. Bake for 45-50 minutes or until a fork easily pierces the skin. Remove from the oven, let cool for 10 minutes, then peel away skin and set pumpkin aside.",
    "To a large saucepan over medium heat add 1 Tbsp olive oil, shallot and garlic. Cook for 2-3 minutes, or until slightly browned and translucent. Turn down heat if cooking too quickly.",
    "Add remaining ingredients, including the pumpkin, and bring to a simmer.",
    "Transfer soup mixture to a blender or use an emulsion blender to puree the soup. If using a blender, place a towel over the top of the lid before mixing to avoid any accidents. Pour mixture back into pot.",
    "Continue cooking over medium-low heat for 5-10 minutes and taste and adjust seasonings as needed. Serve as is or with Kale-Sesame topping.",
    "For the Kale-Sesame topping: In a small skillet over medium heat, dry toast sesame seeds for 2-3 minutes, stirring frequently until slightly golden brown. Be careful as they can burn quickly. Remove from pan and set aside.",
    "To the still hot pan, add olive oil and garlic and sauté until golden brown - about 2 minutes. Add kale and toss, then add a pinch of salt and cover to steam. Cook for another few minutes until kale is wilted and then add sesame seeds back in. Toss to coat and set aside for topping soup.",
    "Recipe serves 3-4. Leftovers keep in the fridge for up to a few days, and in the freezer for up to a month or more."
  ],
  "ingredients": [
    "0",
    "2 sugar pumpkins (~2 1/4 cups pumpkin puree)",
    "2 shallots, diced",
    "3 cloves garlic, minced",
    "2 cups veggie stock",
    "1 cup light coconut milk (or sub other non-dairy milk with varied results)",
    "2 Tbsp maple syrup or agave nectar (or honey if not vegan)",
    "1/4 tsp each sea salt, black pepper, cinnamon, nutmeg",
    "1",
    "1 cup roughly chopped kale",
    "1 large garlic clove, minced",
    "2 Tbsp raw sesame seeds",
    "1 Tbsp olive oil",
    "pinch salt"
  ],
  "__v": 1
}