{
  "hash": "5df5af87c923bda0104668805ff5a17faddb198c",
  "title": "Crêpes au Sucre à la Crème",
  "image": "http://miragemargarine.com/wp-content/uploads/2014/01/crepes-with-creme-a-la-sucre-hero-3-of-3.jpg",
  "href": "http://francais.miragemargarine.com/crepes-au-sucre-a-la-creme/",
  "extension": "",
  "firstAdded": "2019-04-10T20:41:26.423000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Préparer le sucre à la crème. Dans une casserole, mélanger la margarine Mirage, la cassonade et la crème. Mettre la casserole sur un feu moyen-vif, en remuant de temps en temps.",
    "Lorsque le sirop commence à bouillir, baisser la température et laisser mijoter de 10 à 15 minutes. Surveiller la cuisson de près pour éviter de que le fond ne brûle.",
    "Une fois la sauce est bien épaisse, éteindre le feu, ajouter l’extrait de vanille et passer la sauce à travers une passoire pour enlever les gros cristaux de sucre qui se sont formés.",
    "Vous pouvez conserver votre sauce de sucre à la crème au réfrigérateur pendant 2 semaines. Lors du service, réchauffer simplement au micro-ondes en tranches de 30 secondes, en remuant à chaque fois.",
    "Pour les crêpes, utiliser un mélangeur pour combiner la farine, le sel, le lait, les oeufs, la cassonade et l’extrait de vanille. Mélanger jusqu’à ce que la pâte soit lisse.",
    "Laisser reposer la pâte pendant au moins 1 heure.(La pâte se conserve jusqu’à 3 jours au réfrigérateur).",
    "Lorsque vous êtes prêt à faire les crêpes, utiliser votre pâte à crêpe lorsqu’elle est à la température de la pièce.",
    "Chauffer une poêle anti-adhésive, à feu moyen. Avec un pinceau à pâtisserie, enduire légèrement la poêle avec la margarine Mirage.",
    "À l’aide d’une louche ou une tasse à mesurer, verser environ 1/3 tasse de pâte dans la poêle, en remuant pour bien enrober le fond de la casserole.",
    "Lorsque de petits trous se forment sur la surface de la crêpe, retournez là sur elle-même et cuire environ 30 secondes. Si vous constatez que les crêpes cuisent trop vite, baissez le feu.",
    "Retirer la crêpe de la poêle et servir dans une grande assiette. Badigeonner le dessus avec un peu de margarine Mirage pour empêcher les crêpes coller ensemble.",
    "Poursuivre la cuisson des crêpes.",
    "Rouler les crêpes et placez-les dans une assiette, ajouter une boule de crème glacée, un filet de votre sucre à la crème et une poignée de pacanes grillées. Vous êtes prêt à servir vos crêpes délicieuses!"
  ],
  "ingredients": [
    "0",
    "120 g / 1/2 tasse de Margarine Mirage",
    "120 g / 1 tasse de cassonade foncé",
    "250 ml / 1 tasse de crème 35%",
    "5 ml / 1 c. à thé d’extrait de vanille"
  ],
  "__v": 1
}