{
  "hash": "ce727a78838dde10ca6afcdcf69ba16013d02127",
  "title": "Bloomin' Onion",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2009/11/4/3/FNM_120109-Copy-That-003_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/food-network-kitchens/almost-famous-bloomin-onion-recipe.html",
  "firstAdded": "2015-01-25T00:01:45.433000",
  "users": [
    null
  ],
  "keywords": [
    "mayonnaise",
    "sour",
    "cream",
    "ketchup",
    "worcestershire",
    "horseradish",
    "paprika",
    "cayenne",
    "pepper",
    "kosher",
    "salt",
    "black",
    "onion",
    "vidalia",
    "allpurpose",
    "flour",
    "thyme",
    "oregano",
    "cumin",
    "eggs",
    "milk",
    "soy",
    "corn",
    "oil"
  ],
  "directions": [
    "0",
    "See how to slice a Bloomin' Onion",
    "Combine all of the dip ingredients in a bowl, cover and refrigerate.",
    "Slice the onion (see below). Whisk the flour, cayenne, paprika, thyme, oregano, cumin and 1/2 teaspoon black pepper in a bowl. In a small deep bowl, whisk the eggs, milk and 1 cup water.",
    "Place the onion in a separate bowl, cut-side up, and pour all of the flour mixture on top. Cover the bowl with a plate, then shake back and forth to distribute the flour. Check to make sure the onion is fully coated, especially between the \"petals.\" Lift the onion by the core, turn over and pat off the excess flour; reserve the bowl of flour.",
    "Using a slotted spoon, fully submerge the onion in the egg mixture (spoon on top, if necessary). Remove and let the excess egg drip off, then repeat the flouring process. Refrigerate the onion while you heat the oil.",
    "Heat the oil in a large deep pot over medium-high heat until a deep-fry thermometer registers 400 degrees. Pat off excess flour from the onion. Using a wire skimmer, carefully lower the onion into the oil, cut-side down. Adjust the heat so the oil temperature stays close to 350 degrees. Fry about 3 minutes, then turn the onion over and cook until golden, about 3 more minutes; drain on paper towels. Season with salt and serve with the dip.",
    "How to Slice a Bloomin' Onion",
    "1. Cut off 1/2 inch from the pointy stem end of the onion, then peel.",
    "2. Place the onion cut-side down. Starting 1/2 inch from the root, make a downward cut all the way through to the board.",
    "3. Repeat to make four evenly spaced cuts around the onion.",
    "4. Continue slicing between each section until you have 16 evenly spaced cuts.",
    "5. Turn the onion over and use your fingers to gently separate the outer pieces.",
    "Photograph by Kate Mathis; Illustration by Brown Bird Design",
    "Recipe courtesy Food Network Magazine"
  ],
  "ingredients": [
    "0",
    "2 tablespoons mayonnaise",
    "2 tablespoons sour cream",
    "1 1/2 teaspoons ketchup",
    "1/2 teaspoon Worcestershire sauce",
    "1 tablespoon drained horseradish",
    "1/4 teaspoon paprika",
    "Pinch of cayenne pepper",
    "Kosher salt and freshly ground black pepper",
    "1 large sweet onion, such as Vidalia (about 1 pound)",
    "2 1/2 cups all-purpose flour",
    "1 teaspoon cayenne pepper",
    "2 tablespoons paprika",
    "1/2 teaspoon dried thyme",
    "1/2 teaspoon dried oregano",
    "1/2 teaspoon ground cumin",
    "Freshly ground black pepper",
    "2 large eggs",
    "1 cup whole milk",
    "1 gallon soy or corn oil",
    "Kosher salt"
  ],
  "__v": 1
}