{
  "hash": "c7aa7ae57288c7e20d98f8af1212b162a1ed8c07",
  "title": "BBQ Pizza",
  "image": "http://www.simplecomfortfood.com/wp-content/uploads/2013/05/bbq-pizza.jpg",
  "href": "http://www.simplecomfortfood.com/2013/05/30/bbq-pizza/",
  "extension": "Chrome",
  "firstAdded": "2015-10-13T17:15:42.959000",
  "users": [
    null
  ],
  "keywords": [
    "pizza",
    "dough",
    "makes",
    "skillet",
    "pizzas",
    "bread",
    "flour",
    "active",
    "dry",
    "yeast",
    "salt",
    "sugar",
    "room",
    "water",
    "bbq",
    "favorite",
    "mozzarella",
    "cheese",
    "jalapeo",
    "pepper",
    "onion",
    "leftover",
    "ribs",
    "meat",
    "unsalted",
    "butter",
    "cast",
    "iron"
  ],
  "directions": [
    "0",
    "Make the dough by adding the flour, yeast, salt, and sugar. Mix. Add the water, and with your wooden spoons, or hands, mix until blended. I use my KitchenAid for this process to keep everything in the bowl during the rising process. Mix for about 30 seconds. The dough should be a bit stiff. Cover the bowl with a towel, and let it sit at room temperature until the dough has doubled in volume, about 2 hours. You can do this ahead of time as well, and place in an oiled container, big enough to house the dough, and place in the refrigerator overnight.",
    "Once risen, divide into three portions. With one of the portions, add some flour to a large pastry board, and take a portion of the dough, and form into a large enough piece to place in your cast iron skillet, just enough to have the dough come up the sides a bit.",
    "Preheat your oven to 475 degrees, and place your cast iron skillet in the oven to preheat.",
    "Have your ingredients ready.",
    "Once the oven is preheated, use kitchen mits to remove the extremely hot cast iron skillet from the oven.",
    "Toss in the butter, and give that a swirl. Add the portion of rolled out dough and place on the bottom of the cast iron skillet, being careful not to burn yourself. Try to push and form the dough just so it creeps up the edge of the skillet.",
    "Add the pizza sauce and barbecue sauce on top of the dough, and mix that with a spoon, covering the majority of the dough.",
    "Top with most of the shredded cheese, leaving a bit for the topping.",
    "Add the chopped rib meat, then top with the thinly sliced onions and jalapeño peppers. Top with any remaining mozzarella cheese.",
    "Use your kitchen mits, and place the cast iron skillet back into the oven, and cook for about 25 minutes. Around that time, take the skillet out, and run a butter knife around the skillet. Gently lift to make sure the bottom of the crust is golden brown. Once browned and the cheese is nice and melted, remove the pizza from the oven.",
    "Drizzle with a bit more of the barbecue sauce. Let the pizza rest for about 10 minutes, then carefully lift it out onto a pizza board, or cutting board before serving. Slice into wedges and enjoy."
  ],
  "ingredients": [
    "0",
    "Ingredients for the pizza dough: (Makes 3 skillet pizzas):",
    "3¾ cup of bread flour",
    "2½ tsp active dry yeast",
    "¾ tsp table salt",
    "¾ plus a pinch of sugar",
    "1⅓ cups of room temperature water",
    "Ingredients for the BBQ Pizza:",
    "¼ cup of pizza sauce",
    "¼ cup of your favorite BBQ Sauce",
    "1½ cups of shredded Mozzarella cheese",
    "½ jalapeño pepper, chopped",
    "½ small onion, thinly sliced",
    "1 cup of leftover BBQ ribs, meat chopped",
    "1 tbsp unsalted butter",
    "small cast iron skillet"
  ],
  "__v": 1
}