{
  "hash": "183662dfbfc5de53f008a16f09016b97411cff19",
  "title": "OVERNIGHT CINNAMON ROLLS WITH CREAM CHEESE FROSTING",
  "image": "http://d2t88cihvgacbj.cloudfront.net/manage/wp-content/uploads/2014/09/Overnight-Cinnamon-Rolls-With-Cream-Cheese-Frosting-5.jpg",
  "href": "http://lovelylittlekitchen.com/overnight-cinnamon-rolls-cream-cheese-frosting/",
  "firstAdded": "2015-01-24T16:45:20.253000",
  "users": [
    null
  ],
  "keywords": [
    "lovely",
    "kitchen",
    "simple",
    "home",
    "meet",
    "julie",
    "faq",
    "contact",
    "recipes",
    "appetizers",
    "breakfast",
    "bread",
    "dessert",
    "healthy",
    "main",
    "dish",
    "pasta",
    "sides",
    "bits",
    "pieces",
    "press",
    "overnight",
    "cinnamon",
    "rolls",
    "cream",
    "cheese",
    "frosting",
    "september",
    "feel",
    "making",
    "machine",
    "lately",
    "using",
    "roll",
    "successfully",
    "changes",
    "simplify",
    "convenient",
    "old",
    "recipe",
    "makes",
    "lot",
    "really",
    "sure",
    "family",
    "problem",
    "taking",
    "care",
    "wanted",
    "make",
    "dough",
    "night",
    "bake",
    "pan",
    "morning",
    "nice",
    "pull",
    "fridge",
    "mess",
    "thing",
    "great",
    "special",
    "occasions",
    "holiday",
    "breakfasts",
    "different",
    "times",
    "week",
    "trying",
    "brought",
    "friends",
    "moms",
    "group",
    "yah",
    "ate",
    "bunch",
    "myself",
    "used",
    "hum",
    "general",
    "wanting",
    "dive",
    "right",
    "face",
    "messing",
    "fluffy",
    "yum",
    "easily",
    "cover",
    "love",
    "good",
    "layer",
    "mean",
    "guess",
    "absolute",
    "favorite",
    "man",
    "ohsosoft",
    "cinnamony",
    "core",
    "save",
    "best",
    "tips",
    "come",
    "want",
    "hot",
    "yeast",
    "years",
    "ago",
    "use",
    "calls",
    "rolling",
    "measurement",
    "sticky",
    "handle",
    "softerstickier",
    "tender",
    "properly",
    "work",
    "surface",
    "balance",
    "lift",
    "sticking",
    "flour",
    "counter",
    "need",
    "havent",
    "worked",
    "better",
    "practice",
    "dont",
    "afraid",
    "jump",
    "try",
    "sharp",
    "serrated",
    "cutting",
    "knife",
    "gently",
    "saw",
    "squish",
    "worry",
    "look",
    "perfect",
    "theyll",
    "rise",
    "hour",
    "quite",
    "bit",
    "space",
    "hope",
    "helpful",
    "chance",
    "fall",
    "subscribe",
    "ill",
    "send",
    "inbox",
    "date",
    "following",
    "pinterest",
    "instagram",
    "facebook",
    "twitter",
    "print",
    "author",
    "serves"
  ],
  "directions": [
    "0",
    "Pour the yeast into a large bowl. Pour warm water over the yeast and stir to dissolve.",
    "Pour the warm milk over the yeast. You want all your liquid ingredients to feel warm, but not hot.",
    "Stir in the sugar and beaten egg.",
    "Add 2 cups of flour and salt, and then mix well by hand.",
    "Pour melted (but not too hot) butter in, and mix.",
    "Add another 1 1/2 cups of flour, and mix by hand until the dough is sticky, but pulls away from the sides of the bowl into one large ball.",
    "Cover the bowl and allow the dough to rise for 1 1/2 hours.",
    "Turn the dough out of the bowl onto a well floured surface. I usually use another 1/4 cup of flour on my work surface, adding some to the top and bottom of the dough as I roll it out to prevent it from sticking to the counter.",
    "Roll the dough out to about 1/4 inch thick, into the shape of a rectangle measuring 12 by18 inches.",
    "Smear your softened butter all over the dough. Then sprinkle sugar and cinnamon, taking care to go to the edges.",
    "Starting with a long edge of the rectangle, roll the dough up.",
    "Using a sharp serrated knife, cut the rolled up dough in half. Cut each half in half again. Then cut each quarter into equal thirds so you have 12 pieces.",
    "Place each piece into a greased 9 by 13 inch baking dish with the spiral side up.",
    "Cover the baking dish and refrigerate overnight.",
    "In the morning, remove the baking dish from the fridge and let it sit in a warm spot in your kitchen for one hour. I usually turn my oven on for 10 seconds, then I turn it off and let the rolls rise covered in the just warm oven. Or you may have a \"bread proof\" setting on your oven.",
    "Preheat your oven to 350 degrees. Place the baking dish on the center rack of your oven, and bake for 24-27 minutes. The tops will be golden brown."
  ],
  "ingredients": [
    "0",
    "LOVELY LITTLE KITCHEN",
    "DELICIOUS MADE SIMPLE",
    "HOME",
    "ABOUT",
    "MEET JULIE",
    "FAQ",
    "CONTACT",
    "RECIPES",
    "APPETIZERS",
    "BREAKFAST",
    "BREAD",
    "DESSERT",
    "HEALTHY",
    "MAIN DISH",
    "PASTA",
    "SIDES",
    "BITS & PIECES",
    "PRESS",
    "OVERNIGHT CINNAMON ROLLS WITH CREAM CHEESE FROSTING",
    "SEPTEMBER 22, 2014",
    "45K+",
    "I feel like a cinnamon roll making machine lately! I have been using the same cinnamon roll recipe for a while now, but I really wanted to see if I could successfully make a few changes that would simplify the recipe and also make it more convenient. My old recipe makes A LOT of cinnamon rolls. I really just wanted one pan. Though I’m sure my family would have no problem taking care of more! Also, I wanted to see if I could make the dough the night before, and have the rolls ready to bake in the pan the next morning.",
    "It’s just so nice to be able to pull the cinnamon rolls out of the fridge, and not have to make too much of a mess in the kitchen first thing in the morning. Great for special occasions and holiday breakfasts.",
    "I made these rolls three different times last week trying to get them just right. I brought some to friends, and some to my mom’s group, and then well yah, I ate a bunch myself! I used to be a little ho hum about cinnamon rolls in general, but lately I’m just wanting to dive right into that pan face first!",
    "And this is some serious cream cheese frosting my friends. We are not messing around AT ALL! It’s not too sweet, and it really thick and fluffy too. Oh my, YUM! You could easily cover the whole pan with a thin layer if you half the frosting recipe, but if you love a good thick layer of frosting, make the full recipe and see what I mean!",
    "Can you all guess which part of the roll is my absolute favorite? Oh man, that oh-so-soft and cinnamon-y core! I always save the best for last.",
    "So let me give you a few tips so that your cinnamon rolls with come out just right.",
    "1. You want to make sure that all of the liquid ingredients are warm, but not too hot. Make sure you are using good yeast, like not from two years ago.",
    "2. Use the right amount of flour. This recipe calls for 3 1/2 cups of flour, and then more for rolling out the dough. You really want to go more by feel than by measurement. You want to add just enough flour to make your dough not too sticky to handle, but no more. The softer/stickier your dough is, the more tender your roll will be. But you can’t roll it out properly if it sticks to your work surface, so its a fine balance. Lift the dough up every now and then as your roll it out to make sure it’s not sticking, and add more flour to the counter as you need it.",
    "3. If you haven’t worked with yeast dough very much, you will get better with practice. Don’t be afraid, just jump in there and try it!",
    "Make sure you use a sharp serrated knife when you are cutting your dough, and let the knife do the work as you gently saw back and forth so that you don’t squish the dough. Don’t worry if they don’t look perfect. They’ll fill out as the rise and bake.",
    "This is what your dough will look like in the morning after you have let it rise for an hour. The rolls will rise even more when you bake them, so don’t worry if there is quite a bit of space in the pan.",
    "Hope these tips are helpful for you, and that you get a chance to make these and fall in love with them just as we did!",
    "Can't get enough? Subscribe and I'll send all my recipes right to your inbox! You can also keep up to date by following me on Pinterest, Instagram, Facebook, and Twitter.",
    "PRINT",
    "OVERNIGHT CINNAMON ROLLS WITH CREAM CHEESE FROSTING",
    "Author: Lovely Little Kitchen",
    "Serves: 12",
    "Ingredients:"
  ],
  "__v": 1
}