{
  "hash": "6b0e8c1ceb74eb88206f66810fc42b159b19c111",
  "title": "BLUEBERRY OATMEAL CRUMBLE BARS",
  "image": "http://averiecooks.com/wp-content/uploads/2015/02/blueberrycrumblebarstext-630x945.jpg",
  "href": "http://www.averiecooks.com/2015/02/blueberry-oatmeal-crumble-bars.html",
  "extension": "Chrome",
  "firstAdded": "2015-10-16T15:19:22.137000",
  "users": [
    null
  ],
  "keywords": [
    "ngredients",
    "crust",
    "crumble",
    "unsalted",
    "butter",
    "allpurpose",
    "flour",
    "oldfashioned",
    "wholerolled",
    "oats",
    "dont",
    "use",
    "quick",
    "instant",
    "theyre",
    "finer",
    "behave",
    "make",
    "mixture",
    "dry",
    "granulated",
    "sugar",
    "light",
    "brown",
    "salt",
    "blueberry",
    "layer",
    "blueberries",
    "used",
    "frozen",
    "didnt",
    "thaw",
    "lemon",
    "juice",
    "cornstarch"
  ],
  "directions": [
    "0",
    "DIRECTIONS:",
    "Preheat oven to 350F. Line an 8-inch square pan with aluminum foil and spray with cooking spray; set aside. Lining the pan helps with cleanup and is recommended.",
    "Crust and Crumble Topping - In a large, microwave-safe bowl melt the butter, about 1 minute on high power.",
    "Add the flour, oats, sugars, optional salt, and stir to combine. Mixture will be dry and sandy with some larger, well-formed crumble pieces.",
    "Set 1 heaping cup mixture aside to be sprinkled on later as crumble topping.",
    "Transfer remaining mixture to prepared pan, and using a spatula or your fingers, hard-pack the mixture to create an even, smooth, flat crust; set aside.",
    "Blueberry Layer - In a large mixing bowl (same one used for crust and crumble is okay), add all ingredients and toss to combine. If sugar hasn't dissolved fully that's okay because it liquifies while baking.",
    "Evenly distribute blueberry mixture over the crust.",
    "Evenly sprinkle with the reserved heaping 1 cup crumble topping mixture. Before sprinkling, I squeeze the mixture in my palm to encourage bigger crumble pieces to form.",
    "Bake for about 55 minutes, or until edges are set and center has just set. Crumble topping should appear set and very pale golden. I used frozen berries without thawing and the pan was very cold going into the oven. If using fresh berries, baking time will be reduced, but I'm not sure by how much, I'd guess at least 10-15 minutes, possibly less. Bars may take longer than 55 minutes if blueberries are very juicy. Watch your bars, not the clock, when evaluating doneness. Place pan on a wire rack and allow bars to cool for at least 30 minutes before slicing and serving. If you try to slice bars before they've cooled completely, they'll be extremely messy and could fall apart. Bars will keep airtight at room temperature for up to 1 week, in the fridge for up to 10 days, or in the freezer for up to 6 months."
  ],
  "ingredients": [
    "0",
    "NGREDIENTS:",
    "Crust and Crumble Topping",
    "1/2 cup (1 stick) unsalted butter, melted",
    "1 cup all-purpose flour",
    "3/4 cup old-fashioned whole-rolled oats (don't use quick cook or instant, they're finer and behave like flour and will make mixture too dry)",
    "1/2 cup granulated sugar",
    "1/4 cup light brown sugar, packed",
    "pinch salt, optional and to taste",
    "Blueberry Layer",
    "12 ounces (2 cups) blueberries (fresh or frozen; I used frozen and didn't thaw)",
    "1/3 cup granulated sugar",
    "2 tablespoons lemon juice",
    "2 teaspoons cornstarch"
  ],
  "__v": 1
}