{
  "hash": "a451c07c08ec6d44cc9038ef18be5a0982b5e452",
  "title": "No Bake Pumpkin Pecan Ice Cream Pie",
  "image": "http://1.bp.blogspot.com/-DTABx3HeEAQ/VFBnnUaOcwI/AAAAAAAAF7o/jQ2b7DoF4Uk/s1600/pumpkin%2Bpie%2B6.jpg",
  "href": "http://www.meatloafandmelodrama.com/2014/10/no-bake-pumpkin-pecan-ice-cream-pie.html",
  "extension": "Firefox",
  "firstAdded": "2015-09-27T17:11:44.170000",
  "users": [
    null
  ],
  "keywords": [
    "blue",
    "bell",
    "spiced",
    "pumpkin",
    "pecan",
    "ice",
    "cream",
    "graham",
    "cracker",
    "pie",
    "crust",
    "chocolate",
    "syrup",
    "caramel",
    "ive",
    "easy",
    "recipe",
    "favorite",
    "whipped",
    "pumpkinflavored",
    "chips"
  ],
  "directions": [
    "0",
    "I love the combination of chocolate and pumpkin, so I start by adding a layer of chocolate syrup to the bottom of the pie crust and then chilling the crust for a bit until the syrup firms up. Then, it's time to load the crust with the ice cream.",
    "fill graham cracker crust with blue bell pumpkin pecan ice cream",
    "Return the pie to the freezer for an hour or so, until the ice cream is firm. Then, slather on the whipped cream, Cool Whip or whatever kind of whipped topping you prefer. Adding some chocolate chips and pumpkin chips gives the pie a more festive look that's perfect for Thanksgiving!",
    "no bake pumpkin ice cream pie with cool whip and chocolate chips",
    "You could definitely stop there, but I love taking these pies to the next level. I topped this one with a mixture of chocolate syrup and salted caramel sauce, which goes really well with the pecan flavor of the ice cream.",
    "Now, here's an easy peasy way to make a quick salted caramel sauce: Just take a few mini Milky Way caramel bars and melt them with some heavy cream. Stir until smooth, and then add a pinch of sea salt -- yum!"
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "I/2 gallon of Blue Bell Spiced Pumpkin Pecan Ice Cream",
    "1 graham cracker pie crust",
    "Chocolate syrup",
    "Caramel sauce (I've got an easy recipe.)",
    "Your favorite whipped topping",
    "Chocolate and pumpkin-flavored chips"
  ],
  "__v": 1
}