{
  "__v": 1,
  "directions": [
    "0",
    "First, prepare the filling. In a heavy bottomed saucepan, stir the cornstarch, cinnamon, and sugar with a fork until there are no lumps and the cornstarch appears to be evenly incorporated. Pour the lemon juice over the sugar, turn the heat on medium and add half of the blueberries. Using a large wooden spoon, softly fold the blueberries into the sugar mixture. Heat until the blueberries begin to bubble, about 5 minutes. Add the other half of the blueberries, carefully stir them in and then extinguish the flame. Set the pan aside.",
    "Butter an 8” square baking pan and set atop a cookie sheet. Pour your prepared filling into your pan and keep on top of the stove. Preheat oven to 425°F and begin to make your crust.",
    "Shift all of your dry ingredients together in a bowl and then sprinkle the diced butter over the flours. Using a pastry cutter, cut the butter into the dry ingredients until the butter forms small clusters the size of small peas. Pour the buttermilk over the mix and stir with a wooden spoon until there are no more dry ingredients.",
    "Scoop the dough onto a piece of wax paper that has been lightly coated with a non-stick vegetable spray. Using another piece of wax paper that has been greased, place on top of the dough and press down until the dough looks flat. Using a rolling pin, gently roll out the dough until you have a square that is slightly larger than the size of the pan. Remove the top layer of the wax paper and then flip the dough on top of your prepared filling. Remove the wax paper and tuck in the edges of the dough that are hanging over the sides of the pan.",
    "Using a very sharp knife, cut a ventilation hole or “x” in the middle of the dough, sprinkle with the sanding sugar and bake for 30 minutes at 425°F.",
    "Allow your cobbler to cool for at least 30 minutes to 1 hour before serving.",
    "Serve with a generous scoop of your favorite vanilla ice cream.",
    "Serves 8-10.",
    "Will keep on the counter lightly covered for 24 hours or for 3 days in the refrigerator."
  ],
  "firstAdded": "2014-08-28T02:36:42.822000",
  "hash": "67ae139c92b36b1256c3bd56cf4715f23be4e799",
  "href": "http://www.theartofglutenfreecooking.com/search/label/Cobblers%20and%20Crisps",
  "image": "http://bp0.blogger.com/_BMBcNTkgjnM/RlM0T2p4FfI/AAAAAAAAAQA/OH3cJsKimys/s320/Blueberry+Cobbler.JPG",
  "ingredients": [
    "0",
    "For the filling:",
    "36 oz. Fresh Blueberries",
    "¼ Cup Cornstarch",
    "1 Cup Granulated Sugar",
    "½ Teaspoon Cinnamon",
    "Juice of 1 Lemon, strained",
    "For the crust:",
    "8 Tablespoons Unsalted Butter",
    "½ Cup Sweet Sorghum Flour",
    "½ Cup Cornstarch",
    "1/3 Cup Tapioca Flour",
    "2 Tablespoons Corn Flour",
    "2 Tablespoons Granulated Sugar",
    "1 Teaspoon Guar Gum",
    "2 Teaspoons Baking Powder",
    "¼ Teaspoon Baking Soda",
    "½ Teaspoon Kosher Salt",
    "2/3 Cup Buttermilk",
    "Sanding Sugar for sprinkling, about 2 Tablespoons"
  ],
  "keywords": [
    "filling",
    "blueberries",
    "cornstarch",
    "granulated",
    "sugar",
    "cinnamon",
    "juice",
    "lemon",
    "strained",
    "crust",
    "unsalted",
    "butter",
    "sorghum",
    "flour",
    "tapioca",
    "corn",
    "guar",
    "gum",
    "baking",
    "soda",
    "kosher",
    "salt",
    "buttermilk",
    "sanding",
    "sprinkling"
  ],
  "title": "BLUEBERRY COBBLER",
  "users": [
    null
  ]
}