{
  "hash": "df161ec80f110a48a5bb14baeee060ee9ef57ed5",
  "title": "The Best Lentil Potluck Salad",
  "image": "",
  "href": "http://detoxinista.com/2016/08/the-best-lentil-potluck-salad/",
  "extension": "",
  "firstAdded": "2016-09-05T15:40:03.089000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To prepare the dressing, combine all of the dressing ingredients in a blender and blend until completely smooth. The dressing will be very salty and acidic, so I don't recommend tasting it until after you've poured it over the huge amount of vegetables in this salad, which will dilute the flavor significantly. (You can adjust any seasonings to taste later.)",
    "If cooking the brown lentils from scratch, combine 2 cups of dry brown lentils with 5 cups of water and bring them to a boil over high heat. Once boiling, lower the heat to a simmer and cook uncovered until the lentils are tender, about 20 minutes. Be sure to watch the pot and add more water, if needed, to keep the lentils covered. Drain any excess water from the lentils and rinse them with cold water to stop the cooking process.",
    "In a large mixing bowl, stir together the cooked lentils, cucumber, onion, pepper, and celery. (I like to dice them into very small pieces so they are all about the same size.) Pour the dressing over the top, toss well, and adjust any seasoning to taste. You can serve this salad as-is, or add in the option raisins and almonds for a little added sweetness and crunch. Store the salad in the fridge for up to a week, and if you'd like to add some extra greens to the mix, serve it over a bed of arugula or any other green you like. (Just don't mix the leafy greens into your stored salad, as they are prone to wilting once they get moist.) This salad should keep well for up to one week when stored in the fridge, so I hope you'll enjoy it as an easy make-ahead packed meal!"
  ],
  "ingredients": [
    "0",
    "Dressing:",
    "¼ cup olive oil",
    "¼ cup raw apple cider vinegar",
    "1 tablespoon maple syrup",
    "1 tablespoon stone-ground mustard",
    "2 small cloves garlic",
    "2 teaspoons fine sea salt",
    "Salad:",
    "2 pounds cooked brown lentils (about 6 cups cooked)",
    "1½ cups diced cucumber (1 english cucumber)",
    "1½ cups diced red onion (1 large red onion)",
    "1½ cups diced red bell pepper (1 large bell pepper)",
    "3 celery stalks, diced",
    "1 cup golden raisins (optional)",
    "1 cup sliced almonds (optional)",
    "Arugula, for serving (optional)",
    "Black pepper, to taste"
  ],
  "__v": 1
}