{
  "hash": "a4aea9d7383af05d2ca1509795b1eab68b973264",
  "title": "Real Deal Southern Caramel Cake",
  "image": "http://www.grandbaby-cakes.com/wp-content/uploads/2012/12/caramel-cake-2-682x1024.jpg",
  "href": "http://www.grandbaby-cakes.com/2012/12/caramel-cake/",
  "extension": "Firefox",
  "firstAdded": "2015-10-28T11:44:16.465000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "butter",
    "room",
    "oil",
    "granulated",
    "sugar",
    "sifted",
    "cake",
    "flour",
    "eggs",
    "egg",
    "yolks",
    "baking",
    "salt",
    "sour",
    "cream",
    "vanilla",
    "evaporated",
    "milk"
  ],
  "directions": [
    "0",
    "Preheat oven to 350 degrees.",
    "In a large mixing bowl, cream butter, oil and sugar on high until fully incorporated and light and fluffy, about 5-6 minutes.",
    "Turn mixer to medium speed and mix in eggs and egg yolks one at a time until well incorporated.",
    "Add in vanilla extract and mix.",
    "Sift cake flour, baking powder and salt into a medium sized bowl.",
    "With mixer on slow speed, alternate adding in flour mixture and sour cream ending with flour mixture until mixed through.",
    "Do not over mix.",
    "Spray three 9 inch round cake pans with baking spray or grease and flour them.",
    "Pour batter into individual cake pans evenly.",
    "Bake in preheated oven for 23-30 minutes or until fully baked (but DON'T OVERBAKE THESE CAKES- CHECK THEM EARILER SO THEY DON'T DRY OUT).",
    "Remove cake pans from oven and cool on cooling racks for 10 minutes.",
    "Remove cakes from pans and wait until completely cooled to ice.",
    "1",
    "Add butter, evaporated milk, and sugar to saucepan over medium heat until everything has melted together.",
    "Leave over medium to low heat stirring periodically for about 1½- 2 hours (watch the entire time to make sure it does not burn until thickened and caramel has darkened to a beautiful golden brown.",
    "Make sure that the caramel turns the color of the photo below before stopping the heat.",
    "It should also coat the back of a spoon to ensure thickness.",
    "Be careful to watch, adjusting heat temperature to not let it burn.",
    "Remove from heat and add in vanilla extract.",
    "Cool for about 15-20 minutes before icing the cake."
  ],
  "ingredients": [
    "0",
    "1 cup (2 sticks) unsalted butter, room temperature",
    "⅓ cup vegetable oil",
    "2½ cups granulated sugar",
    "3 cups sifted cake flour",
    "6 large eggs plus 2 egg yolks, room temperature",
    "1 teaspoon baking powder",
    "½ teaspoon salt",
    "1 cup sour cream",
    "2 tablespoons pure vanilla extract",
    "1",
    "1½ sticks butter",
    "2 (12 ounce) cans evaporated milk",
    "2 cup granulated sugar",
    "2 teaspoons pure vanilla extract"
  ],
  "__v": 1
}