{
  "hash": "fa0463d22485250304ee826642c07b199b5e7561",
  "title": "SWEET POTATO BISCUITS",
  "image": "https://lh3.googleusercontent.com/-EtPn-bMm3fg/Trxrqt6yoiI/AAAAAAAAErY/G7qCnDuPm-w/s640/Sweet%2BPotato%2BBiscuits%2Bangle.jpg",
  "href": "https://www.budgetbytes.com/sweet-potato-biscuits/",
  "extension": "Chrome",
  "firstAdded": "2019-02-07T21:55:29.468000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Wash the outside of the sweet potato, dry with a towel, and prick the skin with a fork. Wrap the sweet potato in a paper towel and microwave on high for 5 minutes. If the potato is still hard in the center, turn the sweet potato over and microwave for an additional 3-5 minutes. Let the potato sit at room temperature until cool enough to handle.",
    "While the sweet potato is cooking, combine the dry ingredients in a bowl (flour, baking powder, baking soda, sugar, and salt). Grate the frozen butter into the bowl and stir until it is coated with the flour mixture. (Place the butter in the freezer about an hour ahead of time)",
    "Preheat the oven to 400 degrees. Scoop the soft inside of the sweet potato into a bowl and mash until smooth. You want about 1 cup of mashed sweet potato. Add the milk and whisk until relatively smooth.",
    "Add the sweet potato and milk mixture to the bowl with the flour and butter. Stir just until everything is mixed and no dry flour is left at the bottom of the bowl. Turn the dough out onto a floured surface and work in just enough flour so that it doesn’t stick to your hands. Try not to over work the dough.",
    "Roll the dough out to about 3/4 inches thick. Using a wide-mouthed cup or a biscuit cutter, cut the dough into eight rounds. When necessary, pile the scraps up and re-roll out the dough to cut more biscuits. You should have about 8 total.",
    "Place the biscuits on a parchment lined baking sheet and bake in the preheated 400 degree oven for 15-20 minutes or until lightly golden brown on top. Enjoy with a pat of melted butter on top!"
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1 medium sweet potato (1 lb) ($0.68)",
    "3/4 cup whole milk ($0.29)",
    "2-2 1/2 cups all-purpose flour ($0.36)",
    "1 Tbsp baking powder ($0.09)",
    "1/4 tsp baking soda ($0.02)",
    "1 Tbsp sugar ($0.03)",
    "1/2 tsp salt ($0.02)",
    "8 Tbsp butter, frozen ( 1 stick) ($0.95)"
  ],
  "__v": 1
}