{
  "hash": "66542e59f92d67bd2da6224fe57be995184b9e0c",
  "title": "GRILLED MARINATED FLANK STEAK WITH CHIMICHURRI SAUCE",
  "image": "http://lh5.ggpht.com/-PlKRMYnqkt8/T6cl43QmJfI/AAAAAAAACaw/woARwUoFl8w/Grilled%252520Marinated%252520Flank%252520Steak%25255B7%25255D.jpg?imgmax=800",
  "href": "http://www.thecomfortofcooking.com/2012/05/grilled-marinated-flank-steak-with-chimichurri-sauce.html",
  "extension": "",
  "firstAdded": "2019-01-02T01:03:42.924000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Score* both sides of the steak with a sharp knife, making 1/4 inch deep knife cuts an inch apart, across the grain of the meat.",
    "Combine the marinade ingredients. Add steak and marinade to a large freezer bag, seal bag, and turn to coat the steak well. Chill and marinate for at least 1 hour and up to overnight.",
    "Using an olive oil-soaked paper towel, coat your grill rack. Preheat the grill to high direct heat.*",
    "Remove steak from marinade and sprinkle each side generously with coarse salt and freshly ground pepper (this will give you a savory crust). Place steak on the hot grill. If you are using a gas grill, cover the grill. Grill for 2-4 minutes on each side.*",
    "When the steak has cooked to your preferred level of doneness, remove from the grill and place on a cutting board. Cover with aluminum foil and let rest for 10 minutes.*",
    "Make very thin slices, against the grain, and at a slight diagonal so that the slices are wide.",
    "Chimichurri Sauce",
    "Puree all ingredients in a food processor until everything is well blended. Transfer to a bowl and cover until ready to use. (I recommend making this at least an hour in advance of using to let the flavors marinade and intensify.)",
    "Store chimichurri, covered and refrigerated, for up to two days. Before serving, let stand at room temperature.",
    "Enjoy this sauce over chicken, fish, or beef. It’s also great tossed with roasted vegetables or salad greens."
  ],
  "ingredients": [
    "0",
    "Marinade Ingredients",
    "1/3 cup olive oil",
    "2 cloves garlic, minced",
    "2 Tbsp. red wine vinegar",
    "1/3 cup soy sauce",
    "1/4 cup honey",
    "1/2 teaspoon freshly ground black pepper",
    "Additional ingredients",
    "2 pound flank steak",
    "Kosher salt",
    "Freshly ground pepper",
    "Chimichurri Sauce",
    "1 cup fresh Italian parsley",
    "1/4 cup fresh cilantro",
    "1/2 cup olive oil",
    "1/4 cup red wine vinegar",
    "3 garlic cloves, peeled",
    "3/4 teaspoon dried crushed red pepper",
    "1/2 teaspoon ground cumin",
    "1/2 teaspoon salt"
  ],
  "__v": 1
}