{
  "hash": "74167fbd9a44490cd82a41ed14944a9c5b4799a8",
  "title": "Recept på världens bästa chili",
  "image": "http://media.romrom.se/varldens-basta-chili-photo10.jpg",
  "href": "http://www.romrom.se/akta-chili-recept-pa-varldens-basta-chili",
  "extension": "Chrome",
  "firstAdded": "2018-10-21T20:19:27.407000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Börja sedan med chilipepparn (chili-frukterna). Rensa bort stjälkar och frön. Koka den chilipepparn som är torkad i 15 minuter under lock i nån liter vatten, ställ sedan åt sidan och låt svalna.",
    "Rensa och hacka den övriga chilipepparn. Ställ åt sidan. Har du jobbat med händerna här så varnar vi verkligen för hanteringen av dem under resten av kvällen/helgen. Chilipeppar är STARKT! Tvätta händerna noga – klippa naglarna kan till och med vara bra! Vi har testat att klia oss i ögon och näsa flera timmar efter tillagning, vilket nästan gav upphov till ett sjukhusbesök.",
    "Fräs vitlöken mjuk. Lägg den i grytan.",
    "Tärna köttet i 2-3 cm stora bitar. (Är ni flera, så kan ni sätta igång med det här så snart som möjligt – det tar tid! Tips är att en eller två personer tärnar köttet, och en person steker.",
    "Stek köttet. Ta lite i taget och rör om ordentligt så att bitarna steks på alla sidor. Lägg ner de färdiga bitarna i grytan. Detta är ett varmt, osigt och tidsödande slitgöra. När allt kött är stekt går du vidare till nästa punkt.",
    "Blanda mjöl och chilipulver. Strö över köttet i grytan.",
    "Sila av den blötlagda chilipepparn, men spara vattnet. Finhacka den kokta chilipepparn – tillsätt sedan allt till köttet i grytan.",
    "Häll på pepparvattnet, oxbuljongen [Påminnelse hör att det är utspädd buljong, inte fond!] och öl tills vätskan täcker köttet.",
    "Koka upp. Nu är chilin på väg!",
    ". Rör ner spiskummin, oregano och koriander.",
    ". Rör ofta så att mästerverket inte bränns fast i botten. Tillsätt mer öl om vätskan skulle börja ta slut.",
    "Fortsätt koka tills köttet faller sönder. Med eller utan lock beroende på hur mycket du vill vakta den. Det brukar ta minst fem timmar tills köttet faller sönder helt.",
    "Om chilin är lite lös på slutet – och du inte har tid att låta den sista vätskan koka bort, så kan du reda den på lite majsmjöl.",
    "Servering:",
    "Servera chilin med (allt eller något av följande):",
    "Naturella majschips",
    "Gräddfil eller vispad cremé fraiche",
    "Riven ost (inte allt för kryddstark, men inte heller för mjuk och kladdig)",
    "Gul lök"
  ],
  "ingredients": [
    "0",
    "Ingredienser till äkta chili:",
    "Grundingredienser:",
    "Tre burkar öl (Valfri ljus öl, 1,2-1,5 liter kan behövas)",
    "5 stora vitlöksklyftor, grovt hackade",
    "2,5 kilo högrev, skuret i ca 2-3 centimeter stora tärningar",
    "Olja eller annan fett att steka i",
    "2,5 dl mörk oxbuljong. (Alltså inte koncentrerad fond! Använder du fond, läs instruktionerna på flaskan om hur man späder!)",
    "Chili-frukter:",
    "2-3 torkade ancho-chili (De är stora, mörkt brunröda och finns på välsorterade ICA, och specialistaffärer typ Chèz Albert). I nödfall kan de ersättas med en chilipulver",
    "1-2 chipotle-chili (Röd, rökt. Finns konserverade och torkade i specialistaffärer.)",
    "1-2 birdseye-chili (Små spetsiga klarröda. Kan ersättas av torkad, mald piri-piri)",
    "2 jalapeno-chili (Knubbiga, gröna. Finns på burk i de flesta välsorterade livsmedelsaffärer. Ta den starka varianten.)",
    "Valfritt: 1 Habanero-chili. Var försiktig när du rensar den bara – ha gärna plasthandskar på.",
    "Kryddor:",
    "1 matsked oregano",
    "1 matsked spiskummin",
    "1 matsked malda korianderfrön",
    "1,2 dl chilipulver (en hel vanlig kryddförpackning)",
    "Salt (behövs inte mycket)",
    "Övriga ingredienser:",
    "1/2 matsked socker",
    "1/2 dl mjöl",
    "Lite majsmjöl",
    "Ytterligare tillbehör – se slutet av receptet"
  ],
  "__v": 3
}