{
  "hash": "f7890ce0ded9a0413fcfbdb621f153330d8d4078",
  "title": "Creme Brulee Cookies",
  "image": "https://i0.wp.com/cookiesandcups.com/wp-content/uploads/2013/10/cremebruleecookies.jpg?zoom=1.25&fit=570%2C737",
  "href": "http://cookiesandcups.com/creme-brulee-cookies/",
  "extension": "",
  "firstAdded": "2017-07-14T01:24:16.842000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Pour milk and half & half into a medium sized bowl. Add dry pudding mix and whisk together until well blended and thickened. Pour into a shallow dish and refrigerate at least 30 minutes until thick.",
    "1",
    "Preheat oven to 350°",
    "Line a baking sheet with parchment or a silicone baking sheet. Set aside.",
    "In bowl of stand mixer cream butter sugar together for 2 minutes until well combined. Add in eggs and vanilla and mix until incorporated and smooth.",
    "Add in baking powder and salt, mix well.",
    "Turn mixer to low and add flour, mixing until combined.",
    "Roll dough into 2 inch balls and place on baking sheet about 2 inches apart.",
    "Bake for 10-12 minutes until edges are just golden.",
    "Remove from oven and immediately make an indentation with a spoon in the top of the cookie.",
    "Place approximately 1 teaspoon of creme brulee in the indentation. Sprinkle with reserved Sugar in the Raw or brown sugar.",
    "Turn oven to broil.",
    "Place cookies under the broiler for approximately 30 seconds until the sugar browns and crystallizes.",
    "You could also use a kitchen torch to do this."
  ],
  "ingredients": [
    "0",
    "1 cup cold whole milk",
    "½ cup cold half & half",
    "1 pkg. (4-serving size) Vanilla or French Vanilla Instant pudding",
    "½ cup Sugar in the Raw or light brown sugar, reserved",
    "1",
    "1½ cups granulated sugar",
    "1⅓ cups butter, room temperature",
    "2 eggs",
    "1 Tbsp vanilla",
    "2 tsp baking powder",
    "1 tsp salt",
    "3½ cups flour"
  ],
  "__v": 1
}