{
  "__v": 1,
  "directions": [
    "0",
    "Pulire i funghi, tagliarli a pezzetti piuttosto piccoli e rosolarli in poco olio evo con lo spicchio d'aglio finchè non sono cotti, regolare di sale e di pepe e spolverizzare con prezzemolo fresco tritato.",
    "Preparare la besciamella facendo sciogliere il burro in una casseruola e aggiungendo la farina in un unica soluzione, mescolare energicamente e aggiungere gradualmente il latte tiepido a filo sempre continuando a mescolare finchè la besciamella non si sarà addensata. Regolare di sale e di pepe ed aggiungere una generosa spolverata di noce moscata.",
    "Togliere la buccia esterna della scamorza affumicata e sminuzzarla nel mixer. Aggiungerla poi alla besciamella intiepidita e mescolare.",
    "Lessare la pasta per alcuni istanti in acqua bollente salata e poi cominciare ad assemblare le lasagne in una teglia imburrata: pasta, uno strato di besciamella con la scamorza, funghi trifolati, noci tritate e parmigiano grattugiato. Alternare gli strati per finire con uno strato di besciamella con scamorza, noci e parmigiano grattugiato e fiocchi di burro.",
    "Cuocere in forno a 200° per circa 20 minuti finchè non saranno belle dorate in superficie. Servire con una manciata di noci fresche tritate grossolanamente e prezzemolo tritato e...un bicchiere di vino bianco vivace!"
  ],
  "firstAdded": "2014-10-12T13:42:08.315000",
  "hash": "f6346adb2e652452b8eaff5ddea146707611a1d3",
  "href": "http://gattoghiotto.blogspot.it/2011/10/la-piccola-bottega-di-campagna-di.html",
  "image": "http://3.bp.blogspot.com/-hBtVu3rGXEw/ToYZ3b0D4EI/AAAAAAAADgw/rYfKVEZ39nY/s640/lasagnaporc2-ok.jpg",
  "ingredients": [
    "0",
    "La lista della spesa:",
    "Per la besciamella:",
    "- 1 litro di latte",
    "- 100g di burro",
    "- 100g di farina",
    "- noce moscata",
    "- sale e pepe",
    "- 2 confezioni di pasta fresca per lasagne da 6 sfoglie o 1 da 12 sfoglie",
    "- 6/7 funghi porcini piuttosto grandi",
    "- 1 spicchio d'aglio un po' grosso",
    "- 1 mazzetto di prezzemolo",
    "- 1 scamorza affumicata non troppo grossa",
    "- parmigiano grattugiato",
    "- noci tritate q,b (ce ne va un bel sacchettino)",
    "- olio evo",
    "- sale e pepe"
  ],
  "keywords": [
    "lista",
    "della",
    "spesa",
    "besciamella",
    "litro",
    "latte",
    "burro",
    "farina",
    "noce",
    "moscata",
    "sale",
    "pepe",
    "confezioni",
    "pasta",
    "fresca",
    "lasagne",
    "sfoglie",
    "funghi",
    "porcini",
    "piuttosto",
    "grandi",
    "spicchio",
    "daglio",
    "grosso",
    "mazzetto",
    "prezzemolo",
    "scamorza",
    "affumicata",
    "non",
    "troppo",
    "grossa",
    "parmigiano",
    "grattugiato",
    "noci",
    "tritate",
    "bel",
    "sacchettino",
    "olio",
    "evo"
  ],
  "title": "Lasagne saporite ai funghi porcini con scamorza affumicata e noci",
  "users": [
    null
  ]
}