{
  "hash": "95ffcf9bf686726970b78f7feba1f6f3f9eb39cd",
  "title": "Flan de Leche",
  "image": "",
  "href": "https://cooking.nytimes.com/recipes/1018487-flan-de-leche?action=click&module=Global%20Search%20Recipe%20Card&pgType=search&rank=3",
  "extension": "Firefox",
  "firstAdded": "2020-03-15T18:43:14.264000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make caramel: Pour 1 cup sugar and 2 tablespoons water into a saucepan, preferably one that is white or light-colored inside. Place over medium heat and bring to a boil, swirling the pan to combine the sugar and water. Do not stir. Let boil until deep amber in color, swirling the pan occasionally to caramelize evenly, about 10 minutes total. Watch the pan carefully after the mixture starts turning golden; it will quickly become light brown, then amber, then dark amber.",
    "Immediately pour caramel into a 9- by -5-inch loaf pan and swirl to coat the bottom evenly. Set aside to harden.",
    "Heat oven to 325 degrees.",
    "In a saucepan or microwaveable bowl or pitcher, combine milk, lemon zest, salt and remaining 1 1/2 cups sugar. Over low heat or in the microwave, heat through, stirring to melt the sugar. Set aside.",
    "In a blender (or using a hand blender in a pitcher), combine eggs, egg yolks and vanilla. Blend until smooth.",
    "Remove the lemon zest strips from the hot milk mixture. With the blender running, gradually pour the milk mixture into the eggs. Go very slowly at first so that the eggs don’t cook from the heat of the milk. Blend just until smooth. Pour egg-milk mixture into the caramel-lined pan.",
    "Place a 9- by- 13-inch baking dish in the lower third of oven. Carefully place the loaf pan in the baking dish. Pour hot tap water into the baking dish until it comes about halfway up the sides of the loaf pan. (Don’t worry if the oven seems to be losing heat; the flan will adjust.)",
    "Bake 55 to 65 minutes, until flan is set but still jiggly in the center. Remove flan from water bath and cool on a rack for 30 minutes. Refrigerate, uncovered, until cold and firm, at least 8 hours or up to 3 days. The caramel will soften as it sits.",
    "To unmold, run a thin sharp knife around the edges. Center a flat-bottomed platter or serving dish with a rim on top of the pan and, holding both, carefully flip the pan and plate together. The flan will fall onto the plate with a squelch; lift off the pan and let the caramel run all over the top. (If the flan doesn’t come out, flip it back over and rest the bottom of the pan on a hot wet kitchen towel for a few minutes, to melt the caramel.) Serve chilled, in slices."
  ],
  "ingredients": [
    "0",
    "2 ½",
    "cups sugar",
    "3",
    "cups whole milk, or 2 cups whole milk and 1 cup heavy cream",
    "2",
    "strips lemon zest",
    "⅛",
    "teaspoon salt",
    "6",
    "large eggs",
    "2",
    "egg yolks",
    "½",
    "teaspoon pure vanilla extract"
  ],
  "__v": 1
}