{
  "hash": "977837d56c2d59896b037b450b6b52f5128c1a85",
  "title": "Mango Puff",
  "image": "https://patijinich.com/wp-content/uploads/2015/04/mango-puff-912x622.jpg",
  "href": "https://patijinich.com/recipe/mango-puff/",
  "extension": "Chrome",
  "firstAdded": "2017-10-29T12:15:45.970000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Pour 1 cup lukewarm water into a medium heatproof bowl and add 2 envelopes of unflavored gelatin. Stir and let rest until mixture puffs up, it will increase slightly in volume, about 3 minutes. Meanwhile, fill a small saucepan (that can hold the heatproof bowl) with 2 to 3 inches of water and bring to a simmer over medium-low heat. Place bowl with the gelatin mixture on top the saucepan, creating a water bath or double boiler. Let the bowl rest there, stirring occasionally, until gelatin completely dissolves, approximately 2 to 3 minutes. Remove from heat.",
    "Pour the sweetened condensed milk into a blender along with the mango chunks and lime juice, puree until completely smooth. Add the diluted gelatin and blend on low speed for a few seconds to combine. Pour into a large mixing bowl. Let it begin to set as you whip up the cream.",
    "In a stand mixer fitted with the whisk attachment, beat the heavy whipping cream until it holds soft peaks. Fold the whipped cream with the mango gelatin until fully combined.",
    "Pour into individual gelatin molds or ramekins, cover tightly with plastic wrap, and refrigerate until completely chilled and set, at least an hour. Alternatively you can pour it onto a container, and let it chill and spoon onto bowls later.",
    "When ready to serve, remove from the refrigerator and decorate with diced fresh mango or berries of your choice, if desired. Or if chilled in a large bowl, spoon onto individual bowls."
  ],
  "ingredients": [
    "0",
    "1cuplukewarm water",
    "2envelopes unflavored gelatinabout 2 tablespoons",
    "1 14-ouncecan sweetened condensed milk",
    "4cupscubed mangofresh or thawed from frozen",
    "1tablespoonfresh squeezed lime juice",
    "2cupsheavy whipping cream",
    "1cupdiced fresh mango or berries(optional for garnish)"
  ],
  "__v": 1
}