{
  "hash": "b49313ca2c51537d22ae9025688f1b91e2e155fa",
  "title": "Apple, Almond & Buckwheat Muffins",
  "image": "",
  "href": "http://www.greenkitchenstories.com/apple-almond-buckwheat-muffins/",
  "extension": "",
  "firstAdded": "2015-09-30T10:48:09.162000",
  "users": [
    null
  ],
  "keywords": [
    "dry",
    "almond",
    "flour",
    "rolled",
    "oats",
    "use",
    "cert",
    "gluten",
    "free",
    "intolerant",
    "buckwheat",
    "arrowroot",
    "potato",
    "starch",
    "baking",
    "soda",
    "cinnamon",
    "cardamom",
    "ginger",
    "salt",
    "wet",
    "plain",
    "plant",
    "yogurt",
    "coconut",
    "butter",
    "olive",
    "oil",
    "soft",
    "dates",
    "mashed",
    "eggs",
    "chia",
    "seeds",
    "mixed",
    "water",
    "apple",
    "instructions",
    "hot",
    "make",
    "organic",
    "apples"
  ],
  "directions": [
    "0",
    "Preheat the oven to 400°F / 200°C. Grease a muffin pan with oil or butter or line it with muffin tins. Add all the dry ingredients to a food processor or blender and process on high speed so the oats turn into coarse flour and all ingredients are mixed. Transfer to a large mixing bowl. Add eggs, yogurt, coconut oil, dates and 1/3 cup / 80 ml of the apple sauce (save the rest for later) to the food processor or blender and mix until smooth, and then transfer to the mixing bowl with the dry ingredients. Grate two of the apples and add them to the batter. Divide the batter into the muffin tins, filling them only half way up. Drop a heaping teaspoon of apple sauce in the middle of each muffin and then cover with the remaining batter. Slice the last apple thinly, brush the slices with oil and place one or a few slices on top of each muffin, pressing them down slightly. Dust with cinnamon. Bake for about 18-20 minutes. Let cool for a bit before taking them out of their tins and they will release easier. Enjoy!"
  ],
  "ingredients": [
    "0",
    "Dry ingredients",
    "1 cup / 100 g almond flour",
    "1 cup / 100 g rolled oats (use cert. gluten free if intolerant)",
    "2/3 cup / 75 g buckwheat flour",
    "2 tbsp arrowroot (or potato starch)",
    "1 1/2 tsp baking powder",
    "1/2 tsp baking soda",
    "1 tsp ground cinnamon",
    "1 tsp ground cardamom",
    "½ tsp ground ginger",
    "½ tsp sea salt",
    "Wet ingredients",
    "160 ml / 2/3 cup plain unsweetened yogurt or plant yogurt",
    "80 ml / 1/3 cup coconut oil, butter or olive oil",
    "10 fresh soft dates, pitted and mashed",
    "3 large eggs (or 3 tbsp chia seeds mixed with 9 tbsp water)",
    "1/2 cup / 120 ml apple sauce, unsweetened (see below for instructions hot to make your own)",
    "3 organic apples"
  ],
  "__v": 1
}