{
  "hash": "24ae84973095ef0688665f8ff632a40f8b1bcb37",
  "title": "Pain au Chocolat Loaf",
  "image": "https://images.food52.com/ZV5tqnJtiYJPz1Ce7sESKtL3v-k=/753x502/e79ea4a0-97df-4017-b90a-c9db2b52825c--2017-0828_croissant-loaves_ren-fuller_272.jpg",
  "href": "https://food52.com/recipes/73023-pain-au-chocolat-loaf",
  "extension": "Chrome",
  "firstAdded": "2018-03-01T01:31:19.467000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the dough: In the bowl of an electric mixer fitted with the dough hook attachment, mix the bread flour, sugar, yeast, salt, butter, and milk on low speed for 3 minutes. Raise speed to medium and mix for 3 minutes more.",
    "Transfer the dough to a large, greased bowl—cover with plastic wrap and refrigerate overnight.",
    "The next day, make the butter block: In a medium bowl, mix the butter and bread flour to combine. Cut a piece of parchment about the size of a half baking sheet (13 x 18 inches), and place it with one of the shorter sides facing you. Scoop the butter mixture onto the lower third of the paper, and spread it into a rectangle about ½ inch thick (about 6 x 9 inches). Try to square off the edges as much as possible. Fold the upper part of the parchment down over the butter block. Transfer the butter block to the refrigerator to chill until firm but still pliable (it should physically bend, easily, not break or shatter—about 65-70° F).",
    "Perform the “lock in”: To perform the lock in, you want both the dough and the butter to be firm but pliable. Remove the dough from the fridge and roll it out on a lightly floured surface into a rectangle about 10 x 12 inches (and about 2/3 inch thick). Usually, the process of rolling it out will get it to just about the right temperature for the lock-in, but if it feels soft, refrigerate it for a few minutes before proceeding. With one of the shorter sides facing you, prepare to add the butter.",
    "Peel the parchment paper away from the top of the butter block, but leave it on the paper. This way you can use the paper to help you put the butter onto the dough and place it. Invert the butter block (still-papered side up) onto the lower half of the dough, positioning it so that there is a 1/2–3/4 inch margin of dough around the sides and bottom of the butter block. Peel the paper away and discard it. Fold the top portion of the dough down over the butter block. If it isn’t quite long enough in any place, gently stretch the dough with your hands until it reaches the dough on the base. Press the edges together all the way around to seal, then fold the excess dough at the bottom and edges under itself. You should now have a rectangular package of dough (about 6 by 10 inches). Usually, the dough is still chilled enough at this point to proceed with the first fold, but if it or the butter feel warm, wrap it tightly in plastic wrap and refrigerate for 15-25 minutes.",
    "Perform the first fold: roll out the dough on a lightly floured surface into a rectangle about the size of a half baking sheet (13 x 18 inches) and about 1/2 inch thick. I like to use my bench knife to keep the edges of the dough squared off while I roll. This makes for better layering! When you’re done rolling, brush any excess flour away from the surface.",
    "Fold the outside edges inward, having them meet slightly off center. The result will look a little like an open book with an off-center spine. In other words: fold the edge on the left toward the center, about ¾ across the dough. Fold the edge on the right ¼ across the dough and make sure the edges meet. (Even though it’s important for the edges to meet, don’t be tempted to squish them into place; the warmth of your hands combined with the pressure could muck up the formation of layers or warm up the butter. Now fold the larger half over the shorter half, and transfer the dough back to a parchment lined baking sheet. Refrigerate for 15-25 minutes (until firm but pliable).",
    "Perform the second fold: roll the dough out again into your ½ inch thick rectangle (about 13 x 18 inches). Fold the left edge of the dough 1/3 of the way over the dough. Fold the right edge 1/3 of the way over the dough as well, resting on the piece you just folded over. Think of it like folding a piece of paper to fit into a standard size envelope. Same rules apply as they did to the first fold: brush away excess flour, try very hard to keep the dough rectangular in shape, and try to make the ends meet up as closely as possible. Wrap the dough in plastic wrap, and refrigerate for 15-25 minutes (until firm but pliable) before starting the next fold.",
    "Perform the third fold: repeat steps 6 and 7 to perform another of this style of fold. Wrap and refrigerate the dough for 15-25 minutes before starting the next fold.",
    "Perform the fourth fold: repeat step 8 to perform another of this style of fold. Wrap and refrigerate the dough for 15-25 minutes or up to overnight.",
    "Shape the loaves: grease two 9 x 5 inch loaf pans with nonstick spray. Divide the dough in half (totally OK to just eyeball it!) and refrigerate one half while you work with the other. On a lightly floured surface, roll out the dough to a 9 x 12 inch rectangle, then rotate if necessary so one of the 9 inch sides is facing you. Square off the sides, if needed by trimming away a small piece of the edge of the dough to make straight lines.",
    "Cut the dough into 5 strips, 1 3/4 inches across each. Spoon about 1 tablespoon of chocolate onto each strip and spread into an even layer. Starting at one end, roll up each strip into a spiral and place it into the prepared loaf pan, seam side down. The spirals will be packed relatively tightly, but may not fully touch. Don’t worry, as the dough rises, it will fill in the pan and get taller. Repeat with the second half of the dough (or try croissant rolls, also on the site)!",
    "Cover the dough inside the loaf pans with a piece of greased plastic wrap and let rise in a warm place until it almost doubles in size, about 40 minutes – 1 hour. If you’re working in a very warm place, it may take less time to rise.",
    "Towards the end of rise time, preheat the oven to 375°F. Remove the plastic wrap from the surface of the dough, , and egg wash the surface of the dough. Transfer the pans to the oven. Bake until the loaves are very golden brown on the outside and the inside registers at a temperature of 190°F on a thermometer, about 35-40 minutes.",
    "Cool completely inside the pan, then invert—it should easily pop out. Slice the loaf and devour it—or use it to make toast for egg sandwiches, or French toast, or bread pudding, or for an epic grilled cheese!",
    "Note: Since this recipe is a bit of a doozy, but worthy of special occasions. I want to recommend freezing the final, baked loaves. Unmold the loaves and wrap them tightly in two layers of plastic wrap—they can be frozen for up to 2 months. To serve the loaf, unwrap it from the plastic wrap and wrap it in foil. Transfer the foil package to a baking sheet and warm the loaf in a 300 degree oven for 15-20 minutes, until fully thawed. Remove the foil and return to the oven for 3-5 minutes to lightly crisp the loaf."
  ],
  "ingredients": [
    "0",
    "4 3/4 cups (567 g) bread flour",
    "1/3 cup (66 g) granulated sugar",
    "1 tablespoon plus 1 teaspoon (14 g) instant yeast",
    "2 1/2 teaspoons (10 g) fine sea salt",
    "5 tablespoons plus 1 teaspoon (71 g) unsalted butter, at room temperature",
    "1 2/3 cups (360 g) cold whole milk",
    "1",
    "4 sticks (453 g) unsalted butter, at room temperature",
    "2/3 cup (71 g) bread flour",
    "1/2 cup (85 g) chopped dark chocolate (I used 60%)",
    "egg wash, as needed for finishing the loaves"
  ],
  "__v": 1
}