{
  "hash": "71c23dac7e0c01056cb3c82682c2cc4f7efbfaed",
  "title": "Rigatoni with Meat Sauce",
  "image": "https://recipes.instantpot.com/wp-content/uploads/2017/06/instant-pot-rigatoni-meat-sauce-1-2.jpg",
  "href": "https://recipes.instantpot.com/recipe/rigatoni-with-meat-sauce/",
  "extension": "Chrome",
  "firstAdded": "2018-08-01T02:22:31.748000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the oil in your Instant Pot on sauté mode. When display reads \"hot\" add in and saute the onions, mushrooms, garlic and a pinch of kosher salt and a few grinds of black pepper until softened, at least five minutes.",
    "Stir in the oregano, basil and tomato paste and cook another minute, stirring constantly with a wooden spoon.",
    "Add in the lean ground beef and brown, breaking it up with your spoon, until no pink remains.",
    "Pour in the beef stock, the tomato puree and the diced tomatoes and all of the liquid from the can.",
    "Give the pot a good stir to make sure you get up all of the food on the bottom of the pot and then add in the dry pasta.",
    "Give it one more good stir, lock on the lid and and program it for 6 minutes using the manual setting at high pressure.",
    "When the time is up, quick release the pressure and open the lid.",
    "Let it sit for another minute or two , giving it a couple of stirs, to thicken up a bit. If the sauce seems too thin, you can turn the saute feature back on and simmer it for a couple of minutes as well.",
    "Serve in big bowls with freshly grated parmesan."
  ],
  "ingredients": [
    "0",
    "2 tablespoons olive oil",
    "2-3 cloves garlic",
    "3.5 ounces white mushrooms finely chopped (pulse in food processor or chop by hand)",
    "1 onion finely chopped",
    "1 tablespoon tomato paste",
    "2 teaspoons basil dried",
    "2 teaspoon oregano dried",
    "kosher salt to taste",
    "black pepper to taste",
    "16 ounces of lean ground beef",
    "28 ounce can of diced tomatoes",
    "14.5 ounce can of tomato puree (tomato sauce)",
    "3 1/2 cups of low sodium beef stock",
    "1 pound rigatoni dried"
  ],
  "__v": 5
}