{
  "hash": "fb937afe30cf9875e0ed86601df6895e66b37559",
  "title": "De allerbeste friet bakken: tips van de Vlaamse expert!",
  "image": "http://www.culy.nl/wp-content/uploads/2013/05/Stock-8-735x490.jpg",
  "href": "http://www.culy.nl/recepten/de-allerbeste-friet-bakken-tips-van-de-vlaamse-expert/",
  "extension": "Chrome",
  "firstAdded": "2015-06-30T12:55:04.032000",
  "users": [
    null
  ],
  "keywords": [
    "stap",
    "kies",
    "goede",
    "verse",
    "aardappel",
    "grote",
    "bintje",
    "staat",
    "aan",
    "een",
    "vrij",
    "bloemige",
    "die",
    "niet",
    "donker",
    "verkleurt",
    "het",
    "bakken",
    "andere",
    "rassen",
    "waarmee",
    "lekkere",
    "frieten",
    "maakt",
    "zijn",
    "agria",
    "dsire",
    "premire",
    "sant",
    "schil",
    "aardappelen",
    "snij",
    "gelijkvormige",
    "staafjes",
    "van",
    "stevige",
    "dikke",
    "friet",
    "heeft",
    "vollere",
    "aardappelsmaak",
    "spoel",
    "rauwe",
    "koud",
    "water",
    "overtollig",
    "zetmeel",
    "verwijderen",
    "droog",
    "goed",
    "met",
    "keukenpapier"
  ],
  "directions": [
    "0",
    "Stap 2: Kies je vet",
    "Plantaardig vet versus dierlijk frituurvet? Het is een kwestie van smaak (net zoals voor- en tegenstanders van melkchocolade versus bittere chocolade). Lefèvre kiest voor rundvet, ook wel ossenwit genoemd. Dat geeft wat hem betreft de meeste smaak. “Bakken in olijfolie is niet verstandig. De smaak is te dominant en olijfolie kan schadelijk zijn bij te hoge verhitting. Een plantaardig alternatief is neutrale archide-olie of zonnebloemolie.”",
    "Stap 3: Laat de frieten zingen",
    "Leg de frieten rustig in het vet (vet à 150°) en laat ze 4 à 5 minuten zwemmen. ‘Voorbakken’ noemen Belgen dit. De bedoeling van het voorbakken is de rauwe aardappel te koken, en niet om bruin te bakken.",
    "“Tijdens het voorbakken verliest de rauwe aardappel een groot gedeelte van haar vocht. Als het vet te warm zou staan, dan zouden de geschroeide aardappelstaafjes dit vocht niet meer laten ontsnappen. Als de frietjes beginnen te zingen (ze borrelen aan het oppervlak) haal je ze uit het vet en schud je ze goed uit.”",
    "Stap 4: Afkoelen",
    "Spreid deze voorgebakken frieten uit en laat ze voldoende afkoelen (minstens een half uur, langer als het kan). De friet koelt dan terug naar kamertemperatuur (18 – 20 graden C). Hoe groter het temperatuurverschil ten opzichte van de temperatuur bij het afbakken, hoe beter.",
    "Stap 5: Afbakken op 180°",
    "Leg de voorgebakken frieten opnieuw in het vet, dat nu op 180 graden is. Laat ze enkele minuten zwemmen. De bedoeling van het afbakken is de voorgebakken frieten krokant te maken.",
    "Lefèvre: “Afhankelijk van de periode in het jaar zullen de frietjes minder of meer bruin afbakken. In het begin van het seizoen (+/- augustus) bevatten de nieuwe aardappelen veel zetmeel en weinig suiker. Hierdoor zullen ze dus lichter van kleur zijn. Naarmate het seizoen vordert, wordt het zetmeel in de aardappel omgezet in suiker en bakken de frieten donkerder af. In het najaar zijn de aardappelen op hun best, althans als je er frietjes van wil bakken.”",
    "Stap 6: Serveren",
    "Na het \"zingen\" ( +/- 2-3min) haal je de frietjes zachtjes uit het vet en schud je ze goed uit. Voordat je de frietjes uitschept, gooi je ze nog enkele keren om. Bestrooien met zout en serveren in een lekkere puntzak met zelfgemaakte mayonaise.",
    "Nog een laatste tip:",
    "Lefèvre: “Ik zou aanraden om geen diepvriesfrieten te kopen. Nooit. Omdat diepvriesfrieten altijd een afwijkende smaak hebben. Ze zijn minder... ja, gewoon minder in alle opzichten. Voor restaurants met diepvriesfrieten is dat een minpunt. Ik vind dat restaurants de moeite moeten nemen om zelf aardappelen te schillen.”"
  ],
  "ingredients": [
    "0",
    "Stap 1: Kies de goede verse aardappel",
    "“Kies een goede en grote aardappel. Het Bintje staat aan de top. Het is een vrij bloemige aardappel die niet donker verkleurt na het bakken. Andere rassen waarmee je lekkere frieten maakt zijn Agria, Désirée, Première en Santé.",
    "Schil de aardappelen en snij ze in gelijkvormige staafjes van +/- 10 x 10 mm. Een stevige, dikke friet heeft een vollere aardappelsmaak. Spoel de rauwe frieten in koud water (om overtollig zetmeel te verwijderen) en droog ze goed af met keukenpapier.”"
  ],
  "__v": 1
}