{
  "hash": "0f70a9b03f5d2c39e9aa3f3184f0c0df84e8c08b",
  "title": "Black Pepper Tofu",
  "image": "http://www.epicurious.com/images/recipesmenus/2011/2011_april/365129.jpg",
  "href": "http://www.epicurious.com/recipes/food/views/black-pepper-tofu-365129",
  "firstAdded": "2015-02-22T18:53:31.758000",
  "users": [
    null
  ],
  "keywords": [
    "lbs",
    "firm",
    "tofu",
    "oil",
    "frying",
    "cornstarch",
    "dust",
    "butter",
    "shallots",
    "total",
    "red",
    "chiles",
    "fairly",
    "mild",
    "ones",
    "garlic",
    "ginger",
    "soy",
    "kecap",
    "manis",
    "light",
    "dark",
    "sugar",
    "coarsely",
    "black",
    "peppercorns",
    "use",
    "mortar",
    "pestle",
    "spice",
    "grinder",
    "green",
    "onions",
    "segments"
  ],
  "directions": [
    "0",
    "Start with the tofu. Pour enough oil into a large frying pan or wok to come 1/4 inch up the sides and heat. Cut the tofu into large cubes, about 1 x 1 inch. Toss them in some cornstarch and shake off the excess, then add to the hot oil. (You'll need to fry the tofu pieces in a few batches so they don't stew in the pan.) Fry, turning them around as you go, until they are golden all over and have a thin crust. As they are cooked, transfer them onto paper towels.",
    "Remove the oil and any sediment from the pan, then put the butter inside and melt it. Add the shallots, chiles, garlic and ginger. Sauté on low to medium heat for about 15 minutes, stirring occasionally, until the ingredients have turned shiny and are totally soft. Next, add the soy sauces and sugar and stir, then add the crushed black pepper.",
    "Add the tofu to warm it up in the sauce for about a minute. Finally, stir in the green onions. Serve hot, with steamed rice.",
    "Reprinted with permission from Plenty by Yotam Ottolenghi, (C) 2011 Chronicle Books"
  ],
  "ingredients": [
    "0",
    "1 3/4 lbs firm tofu",
    "Vegetable oil for frying",
    "Cornstarch to dust the tofu",
    "11 tbsp butter",
    "12 small shallots (12 ounces in total), thinly sliced",
    "8 fresh red chiles (fairly mild ones), thinly sliced",
    "12 garlic cloves, crushed",
    "3 tbsp chopped fresh ginger",
    "3 tbsp sweet soy sauce (kecap manis)",
    "3 tbsp light soy sauce",
    "4 tsp dark soy sauce",
    "2 tbsp sugar",
    "5 tbsp coarsely crushed black peppercorns (use a mortar and pestle or a spice grinder)",
    "16 small and thin green onions, cut into 1 1/4-inch segments"
  ],
  "__v": 1
}