{
  "hash": "733002bed30ab9fe66bfeb0f6ba38c88b2d7c853",
  "title": "Kittencal's Chicken Crescent Roll Casserole",
  "image": "http://img.sndimg.com/food/image/upload/w_555,h_416,c_fit,fl_progressive,q_95/v1/img/recipes/78/81/4/piczgeMWB.jpg",
  "href": "http://www.food.com/recipe/kittencals-chicken-crescent-roll-casserole-78814",
  "extension": "Firefox",
  "firstAdded": "2015-05-03T00:50:20.361000",
  "users": [
    null
  ],
  "keywords": [
    "pillsbury",
    "refrigerated",
    "crescent",
    "dinner",
    "rolls",
    "cream",
    "chicken",
    "soup",
    "undiluted",
    "cheddar",
    "swiss",
    "cheese",
    "use",
    "whipping",
    "filling",
    "soft",
    "butter",
    "garlic",
    "onion",
    "green",
    "onions",
    "breasts",
    "turkey",
    "seasoning",
    "white",
    "salt",
    "black",
    "pepper",
    "mayonnaise"
  ],
  "directions": [
    "0",
    "Set oven to 350°F.",
    "Butter a casserole dish (any size to hold crescent rolls).",
    "In a saucepan, mix half and half cream, 3/4 cup grated cheese (can use more cheese if desired) and undiluted chicken soup (can season with black pepper if desired).",
    "Heat just until the cheese melts (do not boil).",
    "For the filling --- (make certain that the cream cheese and butter are very soft) in a bowl, mix the soft cream cheese with butter until very smooth, then add in garlic powder (if using).",
    "Add in the chopped chicken, onion and cheddar cheese; mix well until combined.",
    "Add in 2 tablespoons whipping cream or mayonnaise; mix to combine (add in a little more if the mixture seems too dry).",
    "Season with seasoned salt or white and black pepper to taste.",
    "Unroll the crescent rolls.",
    "Place 1 heaping tablespoon chicken mixture (or a little more) on top of each crescent triangle, then roll up starting at the thicker end.",
    "Drizzle a small amount of soup mixture on the bottom of the dish.",
    "Then place the crescent rolls seam-side down on top of the creamed mixture in the casserole.",
    "Drizzle the remaining sauce on top (you don't have to use the full amount of cream sauce, just use as much as desired) and sprinkle with 1 cup (or more) grated cheese, or amount desired.",
    "Bake for about 30 minutes."
  ],
  "ingredients": [
    "0",
    "2 (8 ounce) cans Pillsbury Refrigerated Crescent Dinner Rolls",
    "1 (10 3/4 ounce) can cream of chicken soup, undiluted",
    "3⁄4 cup grated cheddar cheese (or any cheese of choice) or 3⁄4 cup swiss cheese (or any cheese of choice)",
    "1⁄2 cup 18% table cream (or use whipping cream)",
    "FILLING",
    "4 ounces cream cheese (very soft)",
    "4 tablespoons butter (very soft but not melted)",
    "1⁄2-1 teaspoon garlic powder (optional)",
    "1⁄3 cup onion, finely chopped (can use green onions)",
    "2 large cooked chicken breasts, finely chopped (or use about 2 cups, can use cooked turkey)",
    "1⁄2-3⁄4 cup finely grated cheddar cheese",
    "1⁄2 teaspoon seasoning salt (or use 1/2 teaspoon white salt or to taste)",
    "1⁄2 teaspoon ground black pepper (or to taste)",
    "2 -4 tablespoons mayonnaise or 2 -4 tablespoons whipping cream",
    "1 -2 cup grated cheddar cheese (for topping)"
  ],
  "__v": 1
}