{
  "hash": "bb0ffeea0596540e29da422110e3c796b5f2d376",
  "title": "Korean Dolsot Bibimbap",
  "image": "https://cdn.apartmenttherapy.info/image/fetch/f_auto,q_auto,w_540,h_358,c_fit,fl_strip_profile/https://s3.amazonaws.com/pixtruder/original_images/e331eae0eca9dbec86fa6e4ae2eab276727e60c2",
  "href": "https://www.thekitchn.com/recipe-korean-dolsot-bibimbap-with-vegetables-and-tofu-164939",
  "extension": "Chrome",
  "firstAdded": "2018-10-27T19:46:46.629000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cucumbers: Sprinkle cucumbers with salt and leave to drain in a colander for 20 minutes. Squeeze out excess water.",
    "Tofu: Rinse and drain tofu. Cut into 1/2-inch thick slices and place between clean kitchen towels (or paper towels). Place a heavy object such as a skillet or cutting board on top to press out excess liquid. Let sit 15 minutes. Heat a tablespoon of sesame oil in a pan and fry tofu, turning once, until golden. Remove tofu from pan. When cool enough to handle, cut into strips.",
    "Carrots: Heat a tablespoon of sesame oil in a pan. Add carrots and a pinch of salt and stir fry until cooked through. Remove from pan.",
    "Soybean Sprouts: Blanch in a pot of salted boiling water, just until wilted. Plunge into ice water to stop cooking, then drain and squeeze out excess water. Mix in a small bowl with 1 teaspoon sesame oil, a pinch of salt, and a dash of sesame seeds.",
    "Spinach: Blanch in a pot of salted boiling water, just until wilted and bright green. Plunge into ice water to stop cooking, then drain and squeeze out excess water. Mix in a small bowl with 1 teaspoon sesame oil, a pinch of salt, and a dash of sesame seeds.",
    "To assemble: Place a dolsot or 10-inch cast iron skillet over medium heat. When it's good and hot, add a tablespoon of sesame oil and swirl to coat. Add the rice and pack it down evenly; it should sizzle at the bottom. Arrange the cucumber, tofu, carrot, soybean sprouts, and spinach on top. Cook for a few minutes until ingredients are heated through. Place the egg on top and garnish with sesame seeds and seaweed.",
    "To serve: Bring the pot or pan to the table. (It's hot, so make sure to protect your hands and the table with a trivet!). Add a tablespoon of gochujang and a drizzle of sesame oil and mix well with a spoon. Divide into individual bowls. If desired, each diner can add more sesame oil and gochujang to taste."
  ],
  "ingredients": [
    "0",
    "1/2 cucumber, julienned",
    "Salt",
    "8 ounces firm tofu",
    "Toasted sesame oil",
    "1 large carrot, julienned",
    "1 cup soybean sprouts",
    "5 cups spinach leaves",
    "Toasted sesame seeds",
    "4 cups cooked rice",
    "1 egg",
    "1/2 sheet roasted seaweed (preferably Korean-style kim, but Japanese nori also works), cut into small strips with scissors",
    "Gochujang (red pepper paste)"
  ],
  "__v": 1
}