{
  "hash": "65a71a7b0b850972f1947f442b039a4545968f2c",
  "title": "Baked Penne with Butternut-Sage Sauce",
  "image": "https://images.food52.com/38lcp8AatrKZ7niWoz7CXZ-v630=/753x502/40290075-6058-4a30-bcc7-4660d3bd3881--plated2.jpg",
  "href": "https://food52.com/recipes/65423-baked-penne-with-butternut-sage-sauce",
  "extension": "Chrome",
  "firstAdded": "2016-11-28T00:14:56.363000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Melt butter in a large heavy pot over moderately high heat until foam subsides, then add sage and cook until fragrant, about 15 seconds. Add cubed squash, diced onion, 1 1/2 cups water, 1 teaspoon kosher salt, and pepper to taste. Simmer, uncovered, stirring occasionally, until squash is very tender and water has reduced considerably, 15 to 20 minutes depending on the size of the squash pieces.",
    "If you have an immersion blender, purée mixture right in pot. If you don't, transfer mixture to a food processor or blender and purée until smooth. Taste sauce. Add more salt if necessary. The sauce should be thick enough to coat the back of a spoon. If it is too thin, simmer over low heat until it thickens. You should have about 3 cups of sauce.",
    "Preheat the oven to 500ºF. Bring a large pot of generously salted (I use 1 tablespoon kosher salt) water to a simmer. Boil penne for 5 minutes. Drain and rinse under cold water. Transfer penne to a large bowl. Pour the butternut sauce over top. Add the cream. Add the cubed mozzarella or fontina, grated parmesan, 1/2 teaspoon salt, and toss to coat.",
    "Butter a shallow 2-quart baking dish (such as a 9x13-inch pan). Transfer pasta mixture to prepared pan. Bake until bubbly and brown, 10 to 15 minutes. If pasta isn't browned to your liking on top, turn on the broiler, pop pan under it for 3 to 5 minutes, keeping a close watch. Cool slightly before serving."
  ],
  "ingredients": [
    "0",
    "4 tablespoons unsalted butter, plus more for greasing",
    "1 small bundle sage",
    "4 cups 1-inch cubes, butternut squash (about 1 lb. post peeling)",
    "1 small onion, finely chopped (about 1 cup)",
    "1.5 teaspoons kosher salt, plus more to taste",
    "freshly cracked pepper to taste",
    "1 pound penne",
    "4 ounces fresh mozzarella or fontina, cubed",
    "1/2 cup heaping (50 g) grated Parmigiano Reggiano",
    "1/2 cup heavy cream"
  ],
  "__v": 1
}