{
  "hash": "e2ff29ed8b382774cfb476e6505ec9fbe01fbf07",
  "title": "CHASHU (JAPANESE BRAISED PORK BELLY)",
  "image": "https://d3eh3svpl1busq.cloudfront.net/KQYMGOLIdXGmoAcyJsPOrQDKktgCbwtG/assets/static/source/rev-1d782c8/wp-content/uploads/2019/05/Chashu-I-2-500x500.jpg",
  "href": "https://www.justonecookbook.com/homemade-chashu/",
  "extension": "Chrome",
  "firstAdded": "2020-03-15T14:05:15.516000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "FOR ROLLED CHASHU (Scroll down for NON-ROLLED version)",
    "DAY 1",
    "Gather all the instructions.",
    "To Prepare the Pork Belly",
    "Roll up the pork belly, making sure one or both ends should have the “bacon” like appearance, showing the varying layers of meat and fat. If your slab comes with the skin (rind), it should be facing out. My block does not come with it. See Notes if you want to remove it.",
    "Run some butcher twine under the far end of the log. Tie a double knot to secure the pork tightly. Make sure you leave about 3 inches (7.5 cm) twine at the end.",
    "Wrap around the pork belly 2-3 times around the same area to secure the end. Then pull the twine to the other end of the pork belly. Wrap around 2-3 times at the end area to secure before working toward the middle. Each wrap should be a ⅓ inch (1 cm) in between.",
    "Continue wrapping around the pork belly toward the end (where you started). Make sure it’s tightly wrapped as much as possible.",
    "Once you reach the end, run the butcher twine under some wraps to hook and go back to the starting point. Find the 3-inch (7.5 cm) twine you leave behind.",
    "Tie a double knot with the long twine and the 3-inch (7.5 cm) twine.",
    "To Cut Aromatics",
    "Cut off the green part of long green onion and slice the ginger (I use organic ginger; rinse and use the skin).",
    "To Sear the Pork Belly",
    "Heat the oil in a cast iron skillet (or regular frying pan) over high heat. Add the rolled pork belly in the pan.",
    "Sear the pork belly one side at a time, rotating to make sure all sides are nicely seared.",
    "It’ll take about 10-15 minutes all together.",
    "To Prepare the Sauce",
    "While searing, put all the ingredients for seasonings in a heavy-bottom pot (or regular pot) that fits the Chashu.",
    "To Simmer Chashu",
    "Transfer the seared Chashu into the Dutch oven.",
    "Bring the liquid to a boil.",
    "Once boiling, skim off the foam and scum. Then turn the heat to low/simmer.",
    "Put an Otoshibuta (drop lid) on top to press the ingredient down and limit the evaporation. If you don’t have an Otoshibuta, you can make it with aluminum foil (here’s how to make Otoshibuta).",
    "Simmer on low heat, and covered with Otoshibuta at all times for the next 2 hours, rotating Chashu every 30 minutes.",
    "The sauce has been reduced. After 2 hours, turn off the heat to let cool a little bit.",
    "To Rest Chashu Overnight",
    "Once the meat is slightly cooled, transfer to a container or plastic Food Saver bag. Strain the leftover cooking liquid over a fine-mesh strainer. The liquid is roughly 2 ½ cup.",
    "Add ½ cup of the cooking liquid into the bag.",
    "Seal the bag with Food Saver. TIP: Fold a piece of paper towel to plug the entry of the Food Saver bag. This paper towel will absorb all the moisture when you seal.",
    "I also made a quick Ramen Egg (Ajitsuke Tamago) with the leftover liquid. You make soft boiled eggs and add ½ cup of cooking liquid in the bag. Cover the cooking liquid and store Chashu, Ramen Egg, and the cooking liquid in the refrigerator.",
    "DAY 2",
    "Open the bag of Chashu.",
    "Cut the twine with kitchen shears and remove them completely.",
    "Slice the Chashu into ¼ inch pieces (Keep the edge for Chashu Fried Rice!).",
    "Place the Chashu slices on a ceramic plate and use a propane torch or broiler to sear the Chashu slices to enhance the flavor. Then enjoy them immediately or serve on your ramen.",
    "Scoop up the solidified fat from the cooking sauce.",
    "Prepare a mason jar or container and strain the sauce over a fine-mesh sieve to make sure the solidified fat is left behind. The sauce will last for a month in the refrigerator. I use it for drizzling over the Chashu and making stir-fries, marinade, and ramen eggs.",
    "To Store",
    "You can store the Chashu in the refrigerator up to 7 days and 1 month in the freezer. I usually divide the Rolled Chashu into thirds and freeze 2 portions separately (for Ramen right away, and Chashu Fried Rice and Chashu Don for later). Ramen Eggs should be consumed in 3-4 days if they are soft-boiled eggs and 7 days if hard-boiled eggs. The eggs get salty as you keep in the marinade, so remove from the sauce when they have the right taste.",
    "FOR NON-ROLLED CHASHU"
  ],
  "ingredients": [
    "0",
    "NGREDIENTS",
    "For Rolled Chashu (Log) (Serves 8-10)",
    "2-2½ lb pork belly block (907-1134 g/roughly 8\" x 9\")",
    "1 Negi (long green onion) (Sub: 1 leek or 2-3 green onions)",
    "1 knob ginger",
    "1 Tbsp neutral-flavored oil (vegetable, canola, etc)",
    "1 cup sake (240 ml)",
    "1 cup soy sauce (240 ml)",
    "2 cup water (480 ml)",
    "⅔ cup sugar (150 g)"
  ],
  "__v": 1
}