{
  "__v": 2,
  "directions": [
    "0",
    "In a large bowl, combine warm water, yeast, whole-wheat flour and raisins. Beat well to develop gluten. Cover and let stand for 4 to 8 hours to make a sponge. Stir in the brown sugar, orange juice, oil, salt and egg yolk. To make a stiff dough, gradually add the 3 to 4 cups all-purpose flour.",
    "Turn out on a floured surface and knead until smooth and elastic. Place in a well-greased bowl. Turn dough once to grease the top. Cover and let rise until doubled in bulk, 1 to 1 1/2 hours. Knead dough down in bowl. When making this for everyday use, I shape two loaves that are twisted; when making it for a family reunion weekend, I prefer to shape the dough into one braid similar to that used for challah. The directions follow. After shaping, cover and let rise until almost doubled in bulk, 45 to 60 minutes. Before baking, brush tops of loaves with a mixture of the egg white and water.",
    "To Shape Twists: Divide dough into four parts. Roll each part into a 15-inch rope. Using two of the ropes, twist gently together and place on one long side of a well-greased large rectangular baking sheet. Make a second twist with the remaining two ropes and place on the other long side of the same baking sheet.",
    "To Shape Braid: Divide dough into four parts. Roll each part into a 20-inch rope. Using three of the ropes, braid gently and place diagonally across a well-greased large rectangular baking sheet. Pinch the ends together and tuck them under just slightly. Pinch the remaining rope in the center to form two ropes that are 10 inches long. Roll these to lengthen them into 18-inch ropes. Twist these two ropes gently together and place the twist on top of the braid, tucking the ends under."
  ],
  "firstAdded": "2014-11-16T04:04:23.953000",
  "hash": "08db2c3fe42494c94dbc572e9e18ec33792282c8",
  "href": "http://www.pepperplate.com/recipes/view.aspx?id=4626070",
  "image": "",
  "ingredients": [
    "0",
    "2 cups warm water",
    "1 Tbsp. active dry yeast",
    "2 cups stone-ground whole-wheat flour",
    "1 cup raisins",
    "1/4 cup brown sugar",
    "1/4 cup orange juice",
    "1/4 cup oil",
    "2 tsp. salt",
    "1 egg yolk",
    "3 to 4 cups unbleached all-purpose flour",
    "1 egg white",
    "1 teaspoon water"
  ],
  "keywords": [
    "water",
    "active",
    "dry",
    "yeast",
    "stoneground",
    "wholewheat",
    "flour",
    "raisins",
    "brown",
    "sugar",
    "orange",
    "juice",
    "oil",
    "salt",
    "egg",
    "yolk",
    "unbleached",
    "allpurpose",
    "white"
  ],
  "title": "Whole Wheat Raisin Bread",
  "users": [
    null
  ]
}