{
  "hash": "68f56942b9b23d1c9bf277b77134c35d0dd68fe2",
  "title": "Spicy, Peanutty Udon with Kale",
  "image": "https://d2k9njawademcf.cloudfront.net/indeximages/46621/full/2014-0819_5-minute-spicy-peanut-udon-with-kale--017.jpg?1410349615",
  "href": "http://food52.com/recipes/26169-spicy-peanutty-udon-with-kale",
  "firstAdded": "2014-12-29T21:02:15.433000",
  "users": [
    null
  ],
  "keywords": [
    "sesame",
    "oil",
    "soy",
    "tamari",
    "sriracha",
    "fish",
    "extra",
    "end",
    "peanut",
    "butter",
    "type",
    "udon",
    "soba",
    "noodles",
    "bunch",
    "kale",
    "deribbed",
    "pieces",
    "scallions",
    "chili",
    "peanuts"
  ],
  "directions": [
    "0",
    "Heat 1 quart of water in a saucepan to boil.",
    "In a sauté pan over low or medium-low heat, add sesame oil, soy sauce or tamari, Sriracha, and fish sauce. Stir ingredients or rotate pan to combine and let cook for about 30 seconds. Add peanut butter, stir to combine, then turn off heat.",
    "When water is boiling, blanch kale for about 15 seconds. Drain the kale and add it to the sauce in the sauté pan and stir to coat.",
    "Bring clean water to boil. When the water is boiling, add the noodles and cook until al dente. Fresh noodles will cook very quickly; dry noodles will cook in 3 to 4 minutes.",
    "Use tongs to add the noodles straight from the water to the sauté pan with the peanut sauce and the kale. The unstrained noodles will carry enough water to dilute the peanut sauce; if you decide to strain the noodles and then add them to the sauce, add 1 tablespoon water, as well. Add a dash of fish sauce to finish.",
    "Garnish with chopped scallions, chili flakes, and chopped peanuts."
  ],
  "ingredients": [
    "0",
    "1/2 teaspoon sesame oil",
    "2 teaspoons soy sauce or tamari",
    "1 teaspoon Sriracha",
    "1/8 teaspoon fish sauce, plus an extra dash at the end",
    "2 tablespoons peanut butter (any type)",
    "3 ounces udon or soba noodles",
    "1/2 bunch kale, deribbed and sliced into 1/2-inch pieces (1 packed cup)",
    "Chopped scallions, for serving",
    "Chili flakes, for serving",
    "Chopped peanuts, for serving"
  ],
  "__v": 1
}