{
  "hash": "efad78da8462dd4083959ab8e0e96d0b3b63a56a",
  "title": "Country-Style Pork and White Beans {Slow Cooker}",
  "image": "//www.melskitchencafe.com/wp-content/uploads/2013/04/pork-and-beans-Plate-jpg.jpg",
  "href": "http://www.melskitchencafe.com/country-style-pork-and-white-beans-slow-cooker/",
  "extension": "Chrome",
  "firstAdded": "2015-03-03T20:07:57.937000",
  "users": [
    null
  ],
  "keywords": [
    "great",
    "northern",
    "beans",
    "country",
    "style",
    "pork",
    "ribs",
    "trimmed",
    "excess",
    "fat",
    "salt",
    "black",
    "pepper",
    "canola",
    "oil",
    "medium",
    "onion",
    "garlic",
    "lowsodium",
    "chicken",
    "broth",
    "divided",
    "tomato",
    "celery",
    "seed",
    "thyme",
    "bay",
    "leaf",
    "turkey",
    "kielbasa",
    "sausage",
    "chunks",
    "tomatoes",
    "parsley"
  ],
  "directions": [
    "0",
    "Eight to 24 hours before assembling in the slow cooker, rinse the white beans and place them in a large bowl with cold water to cover by at least 2 inches. Let the beans soak anywhere from 8 to 24 hours.",
    "Eight to 9 hours before eating, drain the beans and transfer them to the slow cooker. Dry the pork ribs thoroughly with paper towels, then season generously with salt and pepper. Heat 2 teaspoons of the oil in a 12-inch skillet over medium heat until the oil is hot and rippling. Add half of the ribs and brown on all sides, 4-5 minutes. Transfer them to the slow cooker. Return the skillet to medium heat and heat 2 more teaspoons oil until hot and rippling. Brown the remaining ribs and transfer them to the slow cooker.",
    "Return the skillet to medium heat and heat the remaining 2 teaspoons oil until shimmering. Add the onion and ¼ teaspoon salt; cook, stirring occasionally, until beginning to brown, about 2 minutes. Add the garlic and cook until fragrant, about 30 seconds. Add 1 cup of the chicken broth, tomato paste, celery seed, thyme and bay leaf, scraping up the browned bits from the bottom of the skillet. Turn the heat to high and bring the mixture to a boil. Transfer the onion mixture to slow cooker.",
    "Add the kielbasa, tomatoes and chicken broth to the slow cooker. Cover and cook on either low or high, until the meat is tender, 7 to 8 hours on low or 5 to 6 on high. Before serving, discard the bay leaf, stir in the parsley, and season with salt and pepper to taste. Serve over hot, steamed rice, if desired."
  ],
  "ingredients": [
    "0",
    "1 pound dried great northern beans",
    "3 pounds country style pork ribs (about 12 ribs), trimmed of excess fat",
    "Salt and ground black pepper",
    "2 tablespoons canola oil",
    "1 medium onion, chopped",
    "6 medium garlic cloves, finely minced",
    "3 cups low-sodium chicken broth, divided",
    "2 tablespoons tomato paste",
    "½ teaspoon celery seed",
    "1 teaspoon dried thyme",
    "1 bay leaf",
    "1 pound chicken or turkey kielbasa sausage, cut into 1-inch chunks",
    "2 (14.5 ounce each) cans diced tomatoes",
    "1/4 cup chopped fresh parsley"
  ],
  "__v": 1
}