{
  "hash": "af21b02afabaac6701d06f0ac665bb1b6a20d9a1",
  "title": "Ina Garten's Pasta alla Vecchia Bettola",
  "image": "https://images.food52.com/IkXNM6djfNkBHen_L4glQmqpMPw=/753x502/7216e524-f6c1-4397-9efa-4435d8656262--2016-0112_barefoot-contessa-penne-alla-vodka_bobbi-lin_16127.jpg",
  "href": "https://food52.com/recipes/40639-ina-garten-s-pasta-alla-vecchia-bettola",
  "extension": "Chrome",
  "firstAdded": "2017-09-30T09:42:37.571000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat oven to 375° F.",
    "Heat the olive oil in a large (12-inch) ovenproof sauté pan—the pan should have a tight-fitting lid (if you don't have one, use a Dutch oven)—over medium heat, uncovered. Add the onions and garlic and cook for about 5 minutes until the onions are translucent. Add the red pepper flakes and dried oregano and cook for 1 more minute. Add the vodka and simmer for 5 to 7 minutes, until the mixture is reduced by half.",
    "Meanwhile, drain the tomatoes through a sieve and crush them into the pan with your hands. (Editor's note: Save the tomato juice for Bloody Marys or in the freezer for other sauces, or leave it in—it won't hurt this sauce, it will only take longer to cook down.) Add 2 teaspoons salt and 1/2 teaspoon of black pepper. Cover the pan with a tight fitting lid and place it in the oven for 1 1/2 hours. Remove the pan from the oven and let cool for 15 minutes.",
    "Bring a large pot of salted water to a boil and cook the pasta al dente. Drain and return to the pot.",
    "Place the tomato mixture in a blender and puree in batches until the sauce is a smooth consistency. Return to the pan.",
    "Reheat the sauce, add 1 tablespoon fresh oregano and enough heavy cream to make the sauce a creamy consistency. Add salt and pepper, to taste, and simmer for 10 minutes. Add the sauce to the pasta, reserving any excess, and cook for 2 minutes more. Stir in 1/2 cup Parmesan. Serve with an additional sprinkle of Parmesan and a sprinkle of fresh oregano on each plate. Save any extra sauce for more pasta or vodka pizza with fresh mozzarella."
  ],
  "ingredients": [
    "0",
    "1/4 cup good olive oil",
    "2 1/2 cups chopped Spanish onion (1 large)",
    "1 tablespoon minced garlic (3 cloves)",
    "1/2 teaspoon crushed red pepper flakes",
    "1 1/2 teaspoons dried oregano",
    "1 cup vodka",
    "2 28-ounce cans peeled plum tomatoes",
    "Kosher salt",
    "Freshly ground black pepper",
    "1 pound penne rigate or other short pasta shape (Note: Original recipe called for 12 ounces, but this pasta makes plenty of sauce, so go ahead and cook the whole box)",
    "2 tablespoons chopped fresh oregano, plus extra for serving",
    "1 cup heavy cream (or less, to taste)",
    "1/2 cup freshly grated Parmesan cheese, plus extra for serving"
  ],
  "__v": 1
}