{
  "hash": "938ba5f93da45c465edf8eba90410703dded773e",
  "title": "Tofu 'Shrimp' Scampi",
  "image": "http://l8m93qk9td2ucuq2-zippykid.netdna-ssl.com/wp-content/uploads/2013/11/tofu-scampi--1066x800.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/tofu-shrimp-scampi/",
  "extension": "",
  "firstAdded": "2017-07-13T23:11:36.129000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a bowl, combine the ingredients for the marinade. Let the “shrimp” or tofu sit in the marinade for at least 30 minutes.",
    "Meanwhile, bring a large pot of water to a boil. Add salt and cook the pasta according to the package directions. Reserve about 1/2 cup of pasta water. Drain and set aside.",
    "Heat a large skillet over medium-high heat. Remove the “shrimp” or tofu from the marinade, shake off any excess and place them in the skillet. Cook for about 4-6 minutes or until they have browned a bit on all sides, according to your taste. Remove the “shrimp” or tofu from the skillet and set aside.",
    "Add ½ cup white wine to the skillet and let cook until most of it evaporates. Add the remaining marinade to the skillet. Let it cook for 2 minutes. Add the reserved pasta water and the broth to the skillet. Lower the heat to medium-low. Add the zest and juice of the second lemon to the sauce. Melt in the butter, if using, and add the parsley. Add salt and pepper to taste.",
    "Add the pasta to the sauce and toss to coat. Add the “shrimp” or tofu back to the skillet to heat through. Top with vegan grated Parmesan. Serve with extra lemon wedges, if desired."
  ],
  "ingredients": [
    "0",
    "1/4 cup extra-virgin olive oil",
    "6 garlic cloves, minced",
    "Zest and juice of one lemon",
    "A pinch of red pepper flakes",
    "Salt and pepper, to taste",
    "1",
    "1 box vegan shrimp or prawns, defrosted or 1 14-ounce block extra-firm tofu, pressed, drained and cut into cubes",
    "1 pound gluten-free pasta",
    "Kosher salt",
    "1/2 cup white wine",
    "1/2 cup reserved pasta water",
    "1 cup low-sodium vegetable broth",
    "Zest and juice of one lemon",
    "2 tablespoons vegan butter (optional)",
    "1/2 cup fresh parsley, chopped",
    "Salt and pepper, to taste",
    "2",
    "Vegan grated Parmesan, if desired",
    "Lemon wedges for garnish, if desired."
  ],
  "__v": 1
}