{
  "hash": "fa923614598cdab5ff74f1c5816a4edb0dd75a02",
  "title": "Zucchini Lasagna Roll Ups with Spinach and Artichokes",
  "image": "",
  "href": "http://www.littlebroken.com/2016/09/08/zucchini-lasagna-roll-ups-with-spinach-and-artichokes/",
  "extension": "Chrome",
  "firstAdded": "2016-10-31T02:22:35.560000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Arrange all of the zucchini strips in a single layer on 2-3 cooling racks and place on baking sheets. Lightly sprinkle one side of zucchini with salt, then flip, and sprinkle with remaining salt.",
    "Let stand for 30 minutes to let some of the water out, then thoroughly pat dry both sides with paper towels. You want them as dry as possible.",
    "Preheat the oven to 425 degrees F.",
    "Brush both sides with the olive oil and roast for 15-18 minutes or until zucchini loses some of its thickness and is soft. Make sure not to over roast or zucchini will break during rolling. Remove from the oven and cool just enough to handle. Keep the oven on.",
    "Spread ½ cup of the tomato sauce on the bottom of a 10 X 10 baking dish and set aside.",
    "In a large bowl, combine ricotta, spinach, artichokes, parsley, mozzarella, garlic, and egg. Season with salt and pepper, to taste.",
    "Spread about 1 tablespoon of ricotta filling evenly over each zucchini strip. Gently roll up and place straight up in the prepared baking dish, keeping them close together. I was able to fit 5 rows of 5 rolls each into a 10 X 10 baking dish.",
    "Spoon dollops of remaining tomato sauce on top of the rolls and sprinkle with mozzarella cheese.",
    "Bake, uncovered, for 20-25 minutes or until filling is heated through and cheese is melted. Optional: broil for additional 2-3 minutes until cheese is golden brown.",
    "Remove from the oven and let rest 6-8 minutes. The rolls will absorb any excess moisture from the bottom of the pan. If desired, sprinkle with fresh chopped parsley before serving."
  ],
  "ingredients": [
    "0",
    "2-2½ pounds zucchini, trimmed and sliced ¼\" thick with mandoline slicer",
    "1 tsp. sea salt",
    "1-2 Tbsp. olive oil",
    "1 cup tomato sauce (I used marinara sauce)",
    "1½ cups ricotta cheese",
    "½ cup frozen chopped spinach, thawed, drained, and squeezed out with paper towels",
    "½ cup chopped artichokes",
    "2 Tbsp. fresh chopped parsley, plus extra for garnish, if desired",
    "½ cup shredded mozzarella, plus extra for top",
    "2 garlic cloves, pressed",
    "1 egg",
    "salt and fresh ground black pepper"
  ],
  "__v": 1
}