{
  "hash": "3afe7cbb6d989c3b4dd99eccd3a38403a1ba398b",
  "title": "Gluten Free Chicken and Dumplings!",
  "image": "https://www.noshtastic.com/wp-content/uploads/2015/09/gluten-free-chicken-and-dumplings-Noshtastic-Google-Thumb-1-150x150.jpg",
  "href": "https://www.noshtastic.com/gluten-free-chicken-and-dumplings/",
  "extension": "Chrome",
  "firstAdded": "2017-11-15T17:51:17.198000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Put the whole chicken in a large pan and cover with water, add the bay leaves and about six to eight cups of water.",
    "Bring to the boil and then simmer with the lid on for about an hour, you can skim of the foam and scum from the top of the water as you need to.",
    "While the soup is simmering prepare the onion, carrots and celery.",
    "After the chicken has been cooking for about 50 minutes heat the oil in a second pan (large enough to accommodate the soup) and gently saute the onion, carrots and celery for about five minutes.",
    "Add the broth from the chicken to the pan with the vegetables and set the pan to simmer.",
    "When the chicken has cooled enough to handle, peel the skin off and tear the meat off the bones and add it to the soup, then season with salt and pepper.",
    "DUMPLINGS",
    "To make the dumplings add the dry ingredients to a bowl, then add in the beaten eggs, parsley and chicken broth and mix well.",
    "The dumpling mixture will be thick and sticky, drop even sized spoonfuls of it into the pan with the soup.",
    "Cover the soup and simmer for 20 minutes.",
    "Taste the soup and season as necessary.",
    "Garnish with chopped parsley and serve."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 whole chicken",
    "1 onion finely chopped",
    "2 tbsp oil",
    "2 bay leaves",
    "5 carrots peeled and sliced",
    "3 ribs celery sliced",
    "salt",
    "pepper",
    "fresh parsley",
    "2 1/4 cups All Purpose Gluten Free Flour 300g",
    "1/4 tsp xanthan gum omit if your flour has gum added",
    "2 eggs beaten",
    "1 cup gluten free chicken broth 250mls",
    "2 tsp baking powder",
    "1 tbsp parsley finely chopped",
    "1/2 tsp salt"
  ],
  "__v": 1
}