{
  "hash": "bdd5d4a09c21850a9891e38bf5c7088766e3ea8d",
  "title": "Crusty Flat Bread",
  "image": "http://www.annabel-langbein.com/images/recipes/heros/crusty-flat-bread-hero.jpg?width=608&547",
  "href": "http://www.annabel-langbein.com/recipes/crusty-flat-bread/413/",
  "extension": "Chrome",
  "firstAdded": "2015-12-11T04:05:13.864000",
  "users": [
    null
  ],
  "keywords": [
    "crusty",
    "flat",
    "bread",
    "dough",
    "hot",
    "water",
    "dry",
    "yeast",
    "granules",
    "mashed",
    "potato",
    "extra",
    "virgin",
    "olive",
    "oil",
    "highgrade",
    "bakers",
    "flour",
    "kneading",
    "salt",
    "rosemary",
    "leaves"
  ],
  "directions": [
    "0",
    "Place warm water in a large mixing bowl (a bread maker or electric mixer with a dough blade is ideal if you have one). Sprinkle yeast over the water and allow to stand for 2 minutes. Mix in the mashed potato and the ¼ cup olive oil. Stir in the flour and salt and mix until the dough just starts to come away from the sides of the bowl.",
    "Turn the dough onto a lightly floured board and using lightly oiled hands knead about 30 times (or for 3-4 minutes on the dough cycle of a bread maker). Place the dough into a lightly oiled bowl. Cover with muslin or a teatowel and leave to rise in a warm place for 3-4 hours or until it has doubled in bulk. You can also leave it in the fridge, covered, to rise slowly overnight.",
    "When you’re ready to cook your bread, place a baking stone on the centre shelf of the oven and preheat oven to 220˚C. Turn the risen dough onto a lightly floured board, divide in half and shape each half into a ball. Roughly flatten one ball onto a tray lined with baking paper, pressing the dough out to an oval shape about 25 x 20cm. Use your fingertips to press dimples into the top of the loaf, then drizzle with olive oil and sprinkle with rosemary and sea salt.",
    "Slide the baking paper with the dough on it off the tray and onto the preheated baking stone. Bake for about 25 minutes until golden. When cooked the bread will sound hollow when you tap it. Remove from the oven and allow to cool on the baking stone for a few minutes, then transfer to a rack to cool.",
    "Repeat with the other ball of dough. If you want to save the second ball of dough to use later, place it in a lightly oiled bowl, cover with a clean cloth and place in the fridge for up to 48 hours. It also freezes well. Thaw before pressing out and baking."
  ],
  "ingredients": [
    "0",
    "Crusty flat bread dough",
    "1½ cups warm (not hot) water",
    "1½ tsp dry yeast granules",
    "1 packed cup cooked mashed potato",
    "¼ cup extra virgin olive oil",
    "4½ cups high-grade or baker’s flour, plus extra for kneading",
    "2 tsp salt",
    "Topping",
    "1-2 tbsp extra virgin olive oil",
    "2 tsp fresh rosemary leaves",
    "½ tsp sea salt"
  ],
  "__v": 1
}