{
  "hash": "3b2fcfa4448d860eed570f13c74a3349172cce58",
  "title": "INSTANT POT LEMON CHICKEN",
  "image": "https://www.pressurecookrecipes.com/wp-content/uploads/2017/11/instant-pot-lemon-chicken-recipe-1-125x125.jpg",
  "href": "https://www.pressurecookrecipes.com/instant-pot-lemon-chicken/",
  "extension": "Chrome",
  "firstAdded": "2018-01-15T04:19:29.789000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare Pressure Cooker: Heat up your pressure cooker (Instant Pot: press Sauté button and click Adjust button to Sauté More function). Make sure your pot is as hot as it can be (Instant Pot: wait until indicator says HOT).",
    "Prepare Chicken Thighs: Pat dry the chicken thighs’ skin with paper towels. Season with generous amount of kosher salt and ground black pepper.",
    "Brown Chicken Thighs: Pour 1 tbsp (15ml) peanut oil in pressure cooker. Ensure to coat oil over whole bottom of the pot. Place 4 chicken thighs (skin side down) in Instant Pot. Do not overcrowd. Season the meat side lightly with more kosher salt and ground black pepper. Brown the skin side (don’t touch it for 4 minutes). Flip and brown the meat side for 1 ½ minutes. Remove and set aside. *Note: If you are preparing 8 chicken thighs, repeat this step for the remaining 4 chicken thighs.",
    "Sauté Garlic: Add minced garlic and sauté for 30 seconds until fragrant.",
    "Deglaze: Add a dash of Shaoxing wine in Instant Pot and deglaze by scrubbing the flavorful brown bits off the bottom of the pot with a wooden spoon.",
    "Pressure Cook Lemon Chicken: Add ¾ cup (188ml) unsalted chicken stock, 1 tbsp (15ml) light soy sauce, 1 tbsp (15ml) freshly squeeze lemon juice, lemon slices, and a pinch of rosemary (rub the rosemary with your fingers to “activate” them). Give it a quick stir and place 4 - 8 browned chicken thighs on top of the lemon slices. Close lid and pressure cook at High Pressure for 5 minutes + 10 minutes Natural Release (after pressure cooker has finished cooking, wait until the floating valve drops. It should take roughly 10 minutes). Turn off the heat. Open the lid carefully.",
    "Thicken Gravy: Set aside the cooked chicken thighs on a chopping board. Press Cancel button, then Sauté button to heat up the sauce. Stir in 3 tbsp (42g) honey. In a small mixing bowl, mix 2.5 tbsp (22.5g) cornstarch with 3 tbsp (45ml) cold water. Mix it in one third at a time until desired thickness. Taste the gravy and season with more honey, salt & black pepper if necessary.",
    "Serve: Drizzle the lemon sauce onto the chicken thighs and garnish with optional fresh rosemary if desired."
  ],
  "ingredients": [
    "0",
    "4 - 8 (1 1/3 - 2 2/3 lbs, 600g - 1200g) skin on chicken thighs , bone-in or boneless",
    "1 (120g) lemon , slice half of the lemon & juice the other half (~1 tbsp or 15ml)",
    "3 (10g) garlic cloves , minced",
    "¾ cup (188ml) unsalted chicken stock",
    "3 tablespoons (42g) honey",
    "1 tablespoon (15ml) light soy sauce",
    "1 tablespoon (15ml) peanut oil",
    "A pinch of dried rosemary",
    "A dash of Shaoxing wine",
    "Salt & ground black pepper to taste"
  ],
  "__v": 1
}