{
  "hash": "1c8057e3f0ddc99c44384a9380c01f2b0b07a67a",
  "title": "Crab Imperial Eggs en Cocotte Recipe",
  "image": "http://www.seriouseats.com/recipes/assets_c/2015/12/20151201-egg-en-cocotte-vicky-wasik-021-thumb-1500xauto-428537.jpg",
  "href": "http://www.seriouseats.com/2016/01/how-to-make-eggs-en-cocotte.html",
  "extension": "Chrome",
  "firstAdded": "2016-10-30T13:46:27.233000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350°F (175°C). In a medium bowl, gently fold crabmeat with mayonnaise, mustard, parsley, and scallion until evenly mixed. Season with salt and pepper.",
    "Grease 4 (4-ounce) ramekins with butter. Lightly sprinkle salt on the bottom and side of each ramekin. Scoop enough crab mixture to form a thin, even layer on the bottom of each ramekin. Form a circular depression in the center of the crab in each ramekin. (This will help cradle the egg yolk and keep it centered.)",
    "Gently slide an egg into each ramekin. Drizzle heavy cream around each egg, then season with salt and pepper. Place ramekins in a baking dish and transfer to oven. Carefully pour enough boiling water into baking dish to submerge ramekins 3/4 of the way. Bake eggs en cocotte until whites are just set and yolks are still jiggly, about 15 minutes. Very carefully remove baking dish from oven.",
    "Using a very thin metal spatula and tongs, lift each ramekin out of the hot water. Set ramekins on a clean kitchen towel to dry bottoms, then transfer to plates. Garnish with scallions and a dash of Old Bay and serve right away with toasts."
  ],
  "ingredients": [
    "0",
    "8 ounces (230g) crabmeat, picked over for shells",
    "1/4 cup (60ml) mayonnaise",
    "1 tablespoon (15ml) Dijon mustard",
    "1 tablespoon (15ml) minced flat-leaf parsley leaves and tender stems",
    "1 scallion, white and light green parts only, thinly sliced on the bias, plus more for garnish",
    "Kosher salt and freshly ground black pepper",
    "Unsalted butter, for greasing the ramekins",
    "4 large eggs",
    "2 tablespoons (30ml) heavy cream",
    "Boiling water",
    "Old Bay seasoning, for garnish",
    "Toasted bread, for serving"
  ],
  "__v": 1
}