{
  "__v": 1,
  "directions": [
    "0",
    "Mettete l'acqua a bollire. Nel frattempo pulite i fiori di zucca eliminando il pistillo e la parte spinosa con un coltellino, quindi lavateli facendo scorrere l'acqua all'interno. Asciugateli con lo scottex e tagliateli a strisce non troppo sottili. Pulite e tagliate la zucchina a nastro con il pelapatate. Buttate i pomodorini per qualche secondo nell'acqua bollente quindi toglieteli ed eliminate la buccia. Tagliateli a metà, svuotateli dei semi e ricavate dei petali. Versate l'olio in una padella saltapasta con lo spicchio d'aglio ed il filetto ci acciuga. Scaldate l'olio e fate sciogliere il filetto, quindi buttate i fiori e la zucchina facendoli saltare ma mantenendoli croccanti. Togliete le verdure dalla padella lasciando il sughetto, quindi buttate il salmone tagliato a tocchetti. Fate cuocere per c.ca 5 minuti e salate. Spegnete quindi aggiungete le verdure ed i petali di pomodoro. Fate cuocere gli spaghetti al dente, quindi scolateli e buttateli nel saltapasta con le verdure. Aggiungete un mestolino di acqua di cottura, fate insaporire bene quindi servite irrorando il tutto con olio extra vergine di Imperia. Bon voyage!"
  ],
  "firstAdded": "2014-10-12T13:59:32.134000",
  "hash": "1bd32869c700d314b1c71b0107331a7030ff0b47",
  "href": "http://www.andantecongusto.it/2011/06/spaghetti-blues-ovvero-il-ritorno-casa.html",
  "image": "http://2.bp.blogspot.com/-wDNmL_xUql4/Tf9G9r3oNLI/AAAAAAAAAWQ/K2mKXPatvOc/s640/SOPRAFIORE.jpg",
  "ingredients": [
    "0",
    "Ingredienti per 2 persone:",
    "- 4 fiori di zucca",
    "- 4 pomodorini piccadilli",
    "- 1 bella zucchina fiore",
    "- 200 gr di filetto salmone fresco",
    "- 1 acciuga",
    "- 1 spicchio d'aglio",
    "- 190 gr di spaghetti Garofalo nr 9",
    "- Olio extravergine (io ho usato quello ligure di Imperia)",
    "- Qualche fogliolina di basilico",
    "- Sale q.b."
  ],
  "keywords": [
    "ingredienti",
    "persone",
    "fiori",
    "zucca",
    "pomodorini",
    "piccadilli",
    "bella",
    "zucchina",
    "fiore",
    "filetto",
    "salmone",
    "fresco",
    "acciuga",
    "spicchio",
    "daglio",
    "spaghetti",
    "garofalo",
    "olio",
    "extravergine",
    "usato",
    "quello",
    "ligure",
    "imperia",
    "qualche",
    "fogliolina",
    "basilico",
    "sale"
  ],
  "title": "Spaghetti con fiori di zucca, zucchine e salmone",
  "users": [
    null
  ]
}