{
  "hash": "0e84d15ee24cdefdd27d06cf209f47c87832148d",
  "title": "HOME-MADE CHICKEN AND PANCETTA SAUSAGES WITH ROSEMARY",
  "image": "http://farm4.static.flickr.com/3410/3266254112_c927283157.jpg",
  "href": "http://www.luculliandelights.com/2009/02/home-made-chicken-and-pancetta-sausages-with-rosemary.html",
  "extension": "Chrome",
  "firstAdded": "2015-09-25T05:54:10.038000",
  "users": [
    null
  ],
  "keywords": [
    "sausage",
    "skins",
    "chicken",
    "breast",
    "uncured",
    "pancetta",
    "think",
    "pork",
    "belly",
    "use",
    "want",
    "way",
    "experiment",
    "favourite",
    "meat",
    "fat",
    "salt",
    "pinches",
    "pepper",
    "choose",
    "type",
    "sprig",
    "rosemary"
  ],
  "directions": [
    "0",
    "If you use intestines for sausage skin, put them to soak for a couple of hours in cold water. Then put the skin onto the tap and let water run through it to make it it easier to stuff and to check that it isn’t broken somewhere.",
    "– Grind the chicken and the pancetta. I grind it twice and quite finely but this is up to you, you can do a coarser grind or just grind it once.",
    "– Chop the rosemary finely and mix it with salt and pepper before adding it to the meat.",
    "– Mix really well and then start to fill the skins. Slip on the skin onto the ‘stuffer’, this goes for both manual ones and the kitchen robot attachments. If you use a kitchen robot you better check out the manual to get it all right, here I describe the manual mode. Pull out a bit of sausage skin, if you want you can tie a knot to prevent the meat to escape, and start stuffing the meat into the funnel with your thumb or any other means that you find comfortable. Don’t pack the skin too full.",
    "– When you have finished the stuffing, make single sausages by twisting the skin a couple of times at even distances, you can tie a string around if you want but the sausages usually keep their shape anyway.",
    "– Now take out a skillet, cook and eat."
  ],
  "ingredients": [
    "0",
    "sausage skins",
    "450 g/1 lb chicken breast",
    "150 g/5,3 oz uncured pancetta (I think pork belly is the same). You can also use pure fat and more of either if you want, I like them this way but do experiment to find your own favourite mix between meat and fat.",
    "1-1,5 tsp salt",
    "3 pinches (or more) ground pepper, you choose the type you want",
    "1 sprig of rosemary"
  ],
  "__v": 1
}