{
  "hash": "bba299efa7c931dd1a0424088b6e927dc94038fb",
  "title": "Crockpot Green Chicken Chile Enchilada Soup (Video)",
  "image": "http://www.chelseasmessyapron.com/wp-content/uploads/2016/02/soup232-300x450.jpg",
  "href": "http://www.chelseasmessyapron.com/crockpot-green-chicken-chile-enchilada-soup-video/",
  "extension": "Chrome",
  "firstAdded": "2016-04-08T16:56:32.842000",
  "users": [
    null
  ],
  "keywords": [
    "green",
    "enchilada",
    "white",
    "beans",
    "black",
    "boneless",
    "skinless",
    "chicken",
    "thighs",
    "breasts",
    "fireroasted",
    "chiles",
    "tomatoes",
    "chili",
    "cumin",
    "paprika",
    "salt",
    "pepper",
    "cilantro",
    "broth",
    "stock",
    "cream",
    "cheese",
    "softened",
    "addins",
    "pepperjack",
    "sour",
    "lime"
  ],
  "directions": [
    "0",
    "In a large crockpot (I use a 6-quart crockpot) pour in the green enchilada sauce, drained and rinsed white beans, drained and rinsed black beans, and fat-trimmed boneless skinless chicken thighs or breasts.",
    "Add the undrained diced fire-roasted green chiles, diced tomatoes (if desired, it's great with or without them), chili powder, cumin, paprika, about 1 teaspoon salt (I prefer seasoned salt), about 1/4 teaspoon pepper, coarsely chopped fresh cilantro, and chicken broth or stock.",
    "Cover and cook on low for 5-7 hours or high for 3-5 hours or until the chicken easily shreds.",
    "Remove the chicken to another bowl and place in the softened cream cheese (cube into smaller pieces) into the crockpot.",
    "Cover and cook on high for another 30 minutes or until the cream cheese melts completely and is easily stirred into the soup.",
    "Whisk the cream cheese until completely smooth.",
    "Shred the chicken with 2 forks and then add back into the soup.",
    "Serve with desired toppings. We love a big handful of pepper-jack cheese, fat-free sour cream, a wedge of lime, and some cilantro!"
  ],
  "ingredients": [
    "0",
    "1 can (10 ounces) green enchilada sauce",
    "1 can white beans",
    "2 cans black beans",
    "1 pound boneless skinless chicken thighs, or breasts",
    "2 cans (4 ounces each) diced fire-roasted green chiles",
    "1 can (10.5 ounces) diced tomatoes, optional",
    "4 teaspoons ground chili powder",
    "1 tablespoon ground cumin",
    "3/4 teaspoon paprika",
    "Salt and pepper",
    "2-3 tablespoons fresh cilantro, optional",
    "2 cups chicken broth or stock",
    "1 package (8 ounces) cream cheese, softened",
    "Optional add-ins: pepper-jack cheese, sour cream, fresh lime, additional cilantro"
  ],
  "__v": 1
}