{
  "hash": "49c1edaa7b6df0c06fb74f5468defc03b38c747d",
  "title": "ROAST PORK SHOULDER WITH ROAST VEGETABLE SAUCE",
  "image": "",
  "href": "http://lidiasitaly.com/recipes/roast-pork-shoulder-roast-vegetable-sauce/",
  "extension": "Chrome",
  "firstAdded": "2018-02-28T16:32:35.864000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Shoulder roasts range from 4 to 8 pounds, bone-in, or larger. This procedure will work for any size roast, though the vegetable and seasoning amounts are for a 5 to 7 pound shoulder, the size you’ll usually find in the butcher’s case. To feed a big crowd, ask the butcher to cut a larger shoulder for you or cook 2 smaller roasts in one very big roasting pan. Be sure to increase the vegetables, seasonings and cooking liquids proportionally with your meat.",
    "Prepping the roast and vegetables:",
    "Arrange a rack in the middle of the oven and preheat to 400 degrees.",
    "Rinse and dry the roast; leave the entire layer of fat on the top. Place it in the roasting pan and sprinkle salt on all sides, patting the crystals so they stick to the meat and are evenly distributed. Pour on the olive oil and rub it all over the roast. Set the roast fat side up in the center of the pan.",
    "Scatter all the chopped vegetables and seasonings—except the remaining salt—around and toss everything together with the 3 tablespoons of olive oil. If you are using water as cooking liquid, toss 1 teaspoon salt with the vegetables; if using broth, less or no salt is needed, depending on the saltiness of the broth (taste to determine). Pour the white wine and 2 cups or more broth (or water) into the side of the pan so the cooking liquid is 1-inch deep, coming well up around all the vegetables.",
    "Slow roasting the pork and vegetables:",
    "Set the pan into the oven and roast for an hour, then open the oven and bring the roasting pan up front, turn the vegetables over, and rotate the pan back to front, for even cooking.",
    "Roast for another hour or hour and a quarter (depending on the size of the roast): the internal temperature should be 170 degrees or a little higher. The meat should be browned all over with dark edges; the top (especially the fat) should be crisp and caramelized. There will still be a considerable amount of juices in the pan and the vegetables should be cooked through and lightly browned. It is ready to serve now unless you want to glaze the roast or get it darker and crisper, in which case raise the oven temperature to 425 degrees and proceed as directed later.",
    "Making the sauce and finishing the roast:",
    "Lift the pork out of the roasting pan with a large spatula, or by holding it with towels, and rest it on a platter while you start the sauce. If it’s not going back in the oven, set the roast on a warm corner of the stove; covered loosely with foil.",
    "With a potato masher, crush the cooked vegetables in the juices, breaking them up into little bits. Set the sieve in the saucepan and pour everything from the pan into the sieve including any flavorful caramelized bits that can be scraped up. Press the vegetables and other solids against the sieve with a big spoon to release their liquid, and then discard them. Let the liquid settle and when the fat rises, skim it off. Set the saucepan over high heat, bring the juices (you should have 3 to 4 cups) to a boil and let them reduce, uncovered.",
    "For further browning, return the roast to the roasting pan, including its juices. When the oven is at 425 degrees, set the pan on a higher rack and roast until browned and crusty. This could take just a few minutes or 15 or more: check the meat frequently and turn pan if browning unevenly.",
    "When the roast is out of the oven, let it sit for 10 minutes or so before serving. I like to remove the blade bone which is visible on the side of the roast. Insert a long knife blade into the meat so it rests on the flat bone; draw the blade along the bone, following its contours and the meat will lift off. Arrange the boneless pork on a warm serving platter.",
    "To finish the sauce, cook until the strained roasting juices have reduced by half, or to a consistency you like. Thicken it, if you wish, with bread crumbs. Moisten the roast with some of the sauce and pass the rest."
  ],
  "ingredients": [
    "0",
    "5 to 7 pound pork shoulder (butt) roast, bone-in",
    "1-1/2 teaspoons coarse sea salt or crystal kosher salt",
    "2 tablespoons extra-virgin olive oil",
    "For the pan and sauce: vegetables, seasonings and broth:",
    "4 medium onions, peeled and chopped in 1/2-inch pieces",
    "2 medium carrots, peeled and cut into 1/2-inch chunks",
    "2 medium leeks (including green trimmings) rinsed, split and chopped, 1/2-inch pieces",
    "3 celery stalks and leaves, rinsed and cut in 1/2-inch pieces",
    "1/4 cup dried porcini slices, crumbled or chopped in small bits (about 1/2 ounce)",
    "1 teaspoon whole black peppercorns",
    "6 whole cloves",
    "1 tablespoon fresh rosemary sprigs, stripped from the branch, packed to measure",
    "2 large bay leaves",
    "3 tablespoons extra-virgin olive oil",
    "1 teaspoon kosher salt or less",
    "1-1/2 cups dry white wine",
    "3 cups or more Turkey Broth, Simple Vegetable Broth, or water"
  ],
  "__v": 1
}