{
  "hash": "81eae70e381f3305232076672ce6ce2067047657",
  "title": "Low-Carb Deconstructed Pizza Casserole",
  "image": "",
  "href": "http://www.kalynskitchen.com/2016/01/low-carb-deconstructed-pizza-casserole.html",
  "extension": "",
  "firstAdded": "2017-03-01T05:47:04.288000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400F/200C. Spray an 8 inch x 11 inch glass casserole dish with non-stick spray or olive oil.",
    "Pour the diced tomatoes into a colander placed in the sink and rinse with cold water. Let tomatoes drain a minute or two, then spread them out on paper towels to dry (or blot dry with another paper towel on top.) While tomatoes dry, heat 2 tsp. olive oil in a large non-stick frying pan, squeeze the sausage out of the casing, and cook sausage over medium-high heat until it's nicely browned, breaking it apart as it cooks. (I use an old-fashioned potato masher to break the sausage apart.)",
    "While sausage cooks, wash mushrooms, pat dry, and slice into thick slices. When the sausage is done make a layer of sausage in the bottom of the casserole dish and top with the drained tomatoes, spreading them out over the top of the sausage. Season with dried oregano, salt, and fresh-ground black pepper. (I didn't use much salt.)",
    "Rinse out the pan if needed, then heat the other 2 tsp. of olive oil over medium-high heat. When the pan is hot add the mushrooms and cook, stirring a few times, until all the liquid is released and the mushrooms are starting to brown. Layer the mushrooms over the sausage-tomato mixture.",
    "Cut pepperoni in half. Sprinkle the grated Mozzarella over the top of the casserole and lay the pepperoni pieces on top of the cheese, spacing them evenly so the whole top is covered with pepperoni. Bake about 25 minutes, or until the cheese is melted and starting to brown. Serve hot."
  ],
  "ingredients": [
    "0",
    "1 can (14.5 oz.) diced tomatoes (do not use petite dice)",
    "5 links (19.5 oz.) uncooked turkey Italian sausage (I used my favorite turkey Italian sausage; use hot or sweet, whichever you prefer.)",
    "2 tsp. + 2 tsp. olive oil",
    "1/2 tsp. dried oregano",
    "salt and fresh-ground pepper to taste (I didn't use much salt.)",
    "8-12 oz. fresh mushrooms, washed and cut into thick slices (I used brown Cremini mushrooms.)",
    "1 1/2 cups grated Mozzarella cheese (I used part-skim mozzarella)",
    "15 slices pepperoni, cut in half (I used regular pepperoni, but for less fat you can use turkey pepperoni if you prefer)"
  ],
  "__v": 1
}