{
  "hash": "1d390b67b6b05bf4c8393a314b6168c4d0a117df",
  "title": "Bourbon Beef Tenderloin",
  "image": "http://www.pauladeenmagazine.com/wp-content/uploads/2014/11/Bourbon-Beef-Tenderloin.jpg",
  "href": "http://www.pauladeenmagazine.com/bourbon-beef-tenderloin-recipe/",
  "extension": "Chrome",
  "firstAdded": "2017-01-02T20:59:13.162000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For beef: In a heavy-duty resealable plastic bag, combine all ingredients. Seal and turn bag several times to combine; place bag in a large bowl, and refrigerate for 2 hours, turning occasionally.",
    "Remove meat from bag, and discard marinade. Let beef stand at room temperature for 30 minutes. Preheat grill to medium-high heat (350° to 400°).",
    "Grill, covered with grill lid, turning occasionally, for 30 to 35 minutes or until a meat thermometer inserted in thickest portion registers 135° or desired degree of doneness. Remove from grill, cover loosely with foil, and let stand for 10 minutes. Cut beef into ¼-inch-thick slices.",
    "For sauce: In a medium saucepan, heat oil over medium heat. Add onion and garlic, and cook for 10 minutes or until onion is tender. Add bourbon, and increase heat to medium-high; cook for about 5 minutes or until liquid has nearly evaporated.",
    "In a small bowl, stir together Worcestershire sauce and cornstarch until smooth. Add Worcestershire mixture, chili sauce, and remaining 4 ingredients to onion mixture, stirring until combined. Bring to a boil; reduce heat to medium, and cook, stirring constantly to prevent scorching, for 6 to 8 minutes. Let cool slightly before serving with beef."
  ],
  "ingredients": [
    "0",
    "1\t(3 1/2-pound) beef tenderloin, trimmed",
    "1\tcup bourbon",
    "3/4\tcup firmly packed brown sugar",
    "1/4\tcup fresh lemon juice",
    "2\ttablespoons soy sauce",
    "3\tcloves garlic, minced",
    "1",
    "2\tteaspoons vegetable oil",
    "1/2\tcup finely chopped yellow onion",
    "3\tcloves garlic, minced",
    "1/4\tcup bourbon",
    "1/2\tcup Worcestershire sauce",
    "3/4\tteaspoon cornstarch",
    "1\t(12-ounce) bottle chili sauce",
    "1/4\tcup soy sauce",
    "2\tteaspoons stone-ground mustard",
    "1/2\tteaspoon ground black pepper",
    "1/2\tteaspoon ground cumin"
  ],
  "__v": 1
}