{
  "hash": "38766770a9ad03b5fc60cd08b1a4830a63da4053",
  "title": "Toasted Spiced Ham Drizzled in Honey",
  "image": "http://recipe-folder.com/img/recipe-images/049/352/1081766049.jpg",
  "href": "http://www.foodnetwork.com/recipes/michael-chiarello/toasted-spiced-ham-drizzled-in-honey-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-12-21T23:06:54.137000",
  "users": [
    null
  ],
  "keywords": [
    "boneless",
    "country",
    "ham",
    "honey",
    "glazing",
    "spice",
    "rub",
    "recipe",
    "follows",
    "thyme",
    "celery",
    "stalks",
    "fennel",
    "seeds",
    "coriander",
    "peppercorns",
    "red",
    "pepper",
    "california",
    "chili",
    "kosher",
    "salt",
    "cinnamon"
  ],
  "directions": [
    "0",
    "Preheat oven to 425 degrees F.",
    "Place ham on an open brown paper bag for easy clean up. With the tip of a paring knife carefully score a 1-inch grid pattern around the outside of the ham. Brush the entire surface of the meat on all sides with some of the honey.",
    "Season the entire surface of the meat on all sides with the toasted spice rub and thyme. Add about a half cup of water to the base of the roaster. Place ham on several celery sticks in the roasting pan.",
    "Cook for 1 hour. Every 15 minutes, baste ham with juices that collect in the base of the roaster and the honey. Let rest for 15 minutes before carving as desired.",
    "Toast the fennel seeds, coriander seeds, and peppercorns in a small, heavy pan over medium heat. (Toasting freshens spices, releases their oils, and makes them more fragrant, as well as adding a new dimension of flavor.) When the fennel turns light brown, work quickly. Turn on the exhaust fan; add the red pepper flakes, and toss, toss, toss, always under the fan. Immediately turn the spice mixture out onto a plate to cool. Put in a blender with the sweet chili powder, salt, and cinnamon and blend until the spices are evenly ground.",
    "If you have a small spice mill blender or a coffee grinder dedicated to grinding spices, grind only the fennel, coriander, pepper, and chili flakes. Pour into a bowl and toss with the remaining ingredients. Keep the spice mix in a glass jar in a cool, dry place, or freeze.",
    "*Chef's Tip: Taste your chili powder and, if spicy and hot, cut back the amount. California chiles are almost sweet, not hot.",
    "Yield: 1 cup",
    "Recipe courtesy of Michael Chiarello"
  ],
  "ingredients": [
    "0",
    "1 boneless country ham",
    "2 cups honey, for glazing ham",
    "2 tablespoons Toasted Spice Rub, recipe follows",
    "1 tablespoon thyme, chopped fine",
    "6 celery stalks",
    "1/4 cup fennel seeds",
    "1 tablespoon coriander seeds",
    "1 tablespoon peppercorns",
    "1 1/2 teaspoons red pepper flakes",
    "1/4 cup (1-ounce) pure California sweet chili powder*",
    "2 tablespoons kosher salt",
    "2 tablespoons ground cinnamon"
  ],
  "__v": 1
}