{
  "__v": 1,
  "directions": [
    "0",
    "In a medium bowl, toss the chicken with the scallion whites, about half the garlic and ginger, the soy sauce, sugar, 1 teaspoon of the cornstarch, 1 teaspoon of the salt, the sherry, and the sesame oil. Marinate at room temperature for 15 minutes or in the refrigerator for up to 6 hours. Mix the remaining cornstarch with 1/3 cup chicken broth.",
    "Heat a large nonstick skillet over high heat. Add 1 tablespoon of the oil and heat. Add the broccoli and the carrots, and stir-fry and the remaining garlic, ginger, 2 tablespoons of water, and season with 1/4 teaspoon salt, and pepper add the. Stir-fry until the broccoli is bright green but still crisp, about 1 minute. Transfer to a plate.",
    "Get the skillet good and hot again, and then heat 2 more tablespoons oil. Add the chicken and chili flakes if using. Stir-fry until the chicken loses its raw color and gets a little brown, about 3 minutes. Add the hoisin sauce, return the broccoli to the pan and toss to heat through. Stir in the reserved cornstarch mixture and bring to a boil to thicken. Add the cashews and remaining green onions. Add more water if need to thin the sauce, if necessary. Taste and season with salt and pepper, if you like. Mound the stir-fry on a serving platter or divide among 4 plates and garnish with sesame seeds if desired; serve with rice."
  ],
  "firstAdded": "2014-11-13T04:39:11.540000",
  "hash": "63419a030649d832dbbc6bc591adea54df4fcb2c",
  "href": "http://www.bigoven.com/recipe/chicken-and-broccoli-stir-fry-recipe/165665",
  "image": "http://mda.bigoven.com/pics/rs/256/chicken-and-broccoli-stir-fry-recip-2.jpg",
  "ingredients": [
    "0",
    "Marinate the chicken while you prepare the rest",
    "1 pound chicken breast; (about 2 breasts), cubed",
    "3 scallions, whites only; thinly sliced on an angle",
    "2 cloves garlic; cloves, minced",
    "1 (1-inch) peeled fresh ginger; minced",
    "1 tablespoon Soy sauce",
    "1 tablespoons Sugar",
    "1 tablespoon cornstarch; Plus 1 teaspoon",
    "1 1/4 teaspoons Salt",
    "1 tablespoon Dry sherry",
    "1 tablespoon dark sesame oil",
    "1/3 cup chicken broth",
    "3 tablespoons Vegetable oil",
    "4 cups Broccoli; medium florets",
    "1/4 cup Carrot; shredded",
    "3/4 tsp red chili flakes; optional (up to 1)",
    "1 tablespoon hoisin sauce",
    "1/4 cup Cashews",
    "3 Green onion; sliced (or tops reserved from maranade)"
  ],
  "keywords": [
    "marinate",
    "chicken",
    "prepare",
    "rest",
    "breast",
    "breasts",
    "cubed",
    "scallions",
    "whites",
    "angle",
    "garlic",
    "ginger",
    "soy",
    "sugar",
    "cornstarch",
    "salt",
    "dry",
    "sherry",
    "dark",
    "sesame",
    "oil",
    "broth",
    "broccoli",
    "medium",
    "florets",
    "carrot",
    "red",
    "chili",
    "hoisin",
    "cashews",
    "green",
    "onion",
    "tops",
    "reserved",
    "maranade"
  ],
  "title": "Chicken and Broccoli Stir-fry Recipe",
  "users": [
    null
  ]
}