{
  "hash": "13154c49decc90c0189ce0ef60b8e5f35fa4d55f",
  "title": "Slow-Cooker Chicken Tortilla Soup",
  "image": "http://www.gimmesomeoven.com/wp-content/uploads/2009/10/slow-cooker-chicken-tortilla-soup2.jpg",
  "href": "http://www.gimmesomeoven.com/slow-cooker-chicken-tortilla-soup/",
  "extension": "Chrome",
  "firstAdded": "2016-08-28T23:39:56.387000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place all soup ingredients (chicken through cilantro) in a large crock pot and stir briefly to combine. Cover, and cook on \"low\" setting for 6 to 8 hours or on \"high\" setting for 3 to 4 hours. Anywhere from 15-60 minutes beforehand, remove the chicken breasts. Let cool briefly, then shred and return to soup.",
    "To serve, ladle soup into individual bowls, and add desired garnishes.",
    "Use a knife or pizza cutter, cut a few corn tortillas into small strips (as pictured above).",
    "Heat oil in a skillet over medium heat. Test to see if the oil is ready by dripping a drop or two of water in the skillet. (No sound - too cool. Splatter - too hot. Sizzle - perfect!) Once it's ready, add in the tortilla strips. Give them a stir or a flip every 20-30 seconds, until they have begun to turn slightly golden. Remove and place on paper towels to drain and dry. Season with salt or other seasonings.",
    "Preheat oven to 400F degrees. Lay out tortilla strips on a greased cookie sheet, and brush with olive oil. (Optional: season with salt or other seasonings.) Bake the tortilla strips for 5 minutes, then give them a quick stir and/or flip. Bake for 5 minutes more, or until they are crispy and golden."
  ],
  "ingredients": [
    "0",
    "1 pound boneless, skinless chicken breasts or tenderloins (frozen or refrigerated)",
    "1 (15 ounce) can diced tomatoes",
    "1 (10 ounce) can good-quality mild enchilada sauce",
    "1 medium onion, chopped",
    "1 (4 ounce) can chopped green chile peppers",
    "1 (10 oz.) package frozen corn (or 1 can of whole-kernel corn, drained)",
    "1 (15 oz.) can black beans, drained (optional)",
    "2 cloves garlic, minced",
    "3 cups chicken broth",
    "1 cup water",
    "1 tsp. cumin",
    "1/2 tsp. chili powder",
    "1/2 tsp. chipotle powder (optional)",
    "1 Tbsp. lime juice (optional)",
    "1 bay leaf",
    "2 Tbsp. fresh cilantro, chopped",
    "1",
    "3 corn tortillas",
    "2-3 Tbsp. olive oil",
    "2",
    "avocado slices",
    "shredded Mexican or cheddar cheese",
    "limes",
    "chopped tomatoes",
    "soft tortillas (you can place these in the bottom of the bowls, and ladle the soup on top if you'd like!)"
  ],
  "__v": 1
}