{
  "hash": "2cbfabae3a60ff5f27733518e07d77776da61f3e",
  "title": "Bengali mustard fish",
  "image": "http://www.bbcgoodfood.com/sites/bbcgoodfood.com/files/styles/bbcgf_recipe/public/recipe_images/bengali-mustard-fish_0.jpg?itok=2EpK1VZV",
  "href": "http://www.bbcgoodfood.com/recipes/bengali-mustard-fish",
  "extension": "",
  "firstAdded": "2015-10-18T15:46:42.831000",
  "users": [
    null
  ],
  "keywords": [
    "halibut",
    "steaks",
    "slices",
    "turmeric",
    "yellow",
    "mustard",
    "seeds",
    "tip",
    "tomatoes",
    "fat",
    "garlic",
    "green",
    "chillies",
    "oil",
    "nigella",
    "coriander",
    "leaves",
    "rice",
    "serve"
  ],
  "directions": [
    "0",
    "In a bowl, marinate the fish in 1/4 tsp turmeric and a good pinch of salt, tossing to coat, then set aside. Using a spice grinder or a pestle and mortar, grind the mustard seeds to a fine powder. Put the tomato, garlic, 2 or 3 green chillies, the powdered mustard seeds, 1/2 tsp turmeric, a pinch of salt and 150ml water in the small bowl of a food processor and blitz to a smooth paste.",
    "Heat 3 tbsp of the mustard oil in a medium-sized non-stick pan until smoking, then take off the heat and wait for 30 secs. Add the nigella seeds to the pan and allow to sizzle for 10 secs, then add the paste. Cook over a medium heat, stirring occasionally, until all the excess liquid has evaporated and the paste releases its oil. Lower the heat and continue cooking for another 4 mins or so, until it darkens a little. Add 400ml water and the remaining chillies, bring to a boil and simmer for 7-8 mins until it has a medium consistency, not too watery. Check the seasoning and keep on a low heat while you fry the fish.",
    "Heat the remaining oil in a frying pan until smoking. Add the fish and fry on all sides for around 6 mins until golden brown. Add the fish to the mustard sauce, bring back to the boil and cook for 2 mins. Sprinkle on the coriander leaves and serve with rice, if you like."
  ],
  "ingredients": [
    "0",
    "450g halibut steaks, cut into large slices",
    "¾ tsp ground turmeric",
    "2 tbsp yellow mustard seeds (see tip)",
    "140g tomatoes",
    "3 fat garlic cloves",
    "4-5 whole green chillies",
    "4 tbsp mustard oil or vegetable oil",
    "1¼ tsp nigella seeds",
    "handful coriander leaves",
    "cooked rice, to serve (optional)"
  ],
  "__v": 1
}