{
  "hash": "313fb98ed60924fd0d3031b3eeb2389b7648f786",
  "title": "Roasted Garlic Parmesan Hummus",
  "image": "http://watchlearneat.com/wp-content/uploads/2016/07/Roasted-Garlic-and-Parm-Hummus-sq-300x300.jpg",
  "href": "http://watchlearneat.com/roasted-garlic-parmesan-hummus/",
  "extension": "Chrome",
  "firstAdded": "2016-07-18T17:04:59.359000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400° F.",
    "Cut approximately ½ inch of the top of a bulb of garlic to expose the cloves inside and peel away any loose papery layers. Place the garlic bulb on a piece of foil and drizzle olive oil onto the exposed cloves. Season with salt and pepper and then pull up sides of foil and seal up the garlic bulb package. Roast garlic for 35 minutes. Remove from oven and allow garlic to cool for about 15 minutes before handling.",
    "Add chickpeas, Parmesan cheese, lemon zest, lemon juice, rosemary, salt and pepper to the bowl of a food processor. Carefully squeeze out garlic cloves into the food processor, reserving 3-5 cloves for garnish.",
    "Blend until smooth and creamy on high speed, slowly adding the olive oil as you go and occasionally scraping the sides of the bowl of the food processor to ensure ingredients are evenly distributed (approximately 3 minutes).",
    "Transfer to serving dish and garnish with reserved garlic cloves, chopped if desired. Garnish with additional freshly ground pepper, if desired.",
    "Refrigerate for at least one hour to overnight."
  ],
  "ingredients": [
    "0",
    "1 bulb garlic",
    "1 (15.5 oz.) can no salt added chickpeas",
    "5 tablespoons grated vegetarian Parmesan cheese",
    "¼ teaspoon lemon zest",
    "2 tablespoons freshly squeezed lemon juice",
    "½ teaspoon finely chopped fresh rosemary",
    "1 teaspoon plus 1 pinch kosher salt",
    "¼ teaspoon plus 1 pinch freshly ground black pepper and additional for garnish, if desired",
    "6 tablespoons plus 2 teaspoons extra virgin olive oil"
  ],
  "__v": 1
}