{
  "hash": "5cca720f5f1cd0f078ad2d8bad6cb696f2887688",
  "title": "Char-Grilled Texas T-Bone with Caciotta Cheese Enchiladas",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/char-grilled-texas-t-bone-with-caciotta-cheese-enchiladas-recipe",
  "extension": "Chrome",
  "firstAdded": "2017-03-27T04:06:12.256000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "Red Chile Sauce:",
    "Prepare the enchiladas and heat the grill. Rub the steaks with the oil and seasonings and set aside at room temperature while grill heats. When the grill feels medium-hot when you hold your hand 5 inches over the fire, it is ready to use. Place the steaks on the grill and cook them for 5 minutes on each side for medium.",
    "For the chile sauce: Place the chile paste, tomato, cumin, and honey in a blender and puree until smooth. Adjust seasonings with salt. Heat the oil in a skillet over medium-high heat. Pour in the puree and cook for 3 minutes, until the flavors are well combined. Use the sauce immediately on enchiladas, or store in a glass container in the refrigerator until ready to use. Keeps for a week.",
    "At serving time, place the steaks on 4 plates and top each steak with 2 hot Caciotta Cheese Enchiladas. Serve immediately.",
    "Caciotta Cheese Enchiladas:",
    "Lightly grease an 11 3/4 by 7 1/2-inch glass baking pan. Set aside. Heat the oil in a small skillet over low heat, until it's hot enough to sizzle when a tiny piece of tortillas is dropped in. Using tongs, dip a tortilla into the hot oil, removing it quickly and letting excess oil drip off. Dip tortilla into chile sauce and lay it on a flat surface. Sprinkle 1/2 cup of the cheese down the center of the tortilla and roll the tortilla from 1 end to the other. Lay the enchilada in the prepared pan with the seam down. Repeat the steps with each tortilla, fitting them tightly into the pan. Pour the remaining chile sauce over the top of the enchiladas and sprinkle them with the remaining cheese. Prepare these as close to serving time as possible. To finish the enchiladas, preheat the oven to 400 degrees and bake them for 12 minutes. Serve at once.",
    "Reata Grill Blend:",
    "Combine all of the ingredients in a small bowl, blending well to evenly distribute the spices. Be sure to break up any chunks that appear. Store the blend in an airtight container. Shake or stir it again before each use.",
    "ecipe courtesy of Grady Spears, \"A Cowboy in the Kitchen\""
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "8 Caciotta Cheese Enchiladas, recipe follows",
    "4 T-bone steaks (about 16 ounces each)",
    "2 tablespoons olive oil",
    "2 tablespoons Reata Grill Blend, recipe follows",
    "Kosher salt and freshly ground pepper, to taste",
    "Red Chile Sauce:",
    "2 cups red chili paste",
    "1 cup diced tomato",
    "1 teaspoon ground cumin",
    "1 tablespoon honey",
    "Kosher salt, to taste",
    "2 tablespoons oil",
    "Caciotta Cheese Enchiladas:",
    "1/3 cup vegetable oil",
    "8 (8-inch) corn tortillas",
    "2 cups Red Chili sauce (recipe follows)",
    "4 1/2 cups grated caciotta or Monterey Jack cheese",
    "Reata Grill Blend:",
    "4 tablespoons kosher salt",
    "3 tablespoons pasilla powder",
    "2 tablespoons dried granulated garlic",
    "2 tablespoons sugar",
    "2 tablespoons ground cumin",
    "2 tablespoons coarsely ground black pepper",
    "1 tablespoon ground thyme"
  ],
  "__v": 1
}