{
  "hash": "89b9b0b0dbd0c5ced58410abfbfd91322367a905",
  "title": "Prosciutto and Goat Cheese Strata",
  "image": "https://images.food52.com/fs4eiGf9_OzaaEZ-xC6XEapW3Rk=/753x502/b197c262-d211-4744-83e3-732286bdfe64--2015-0120_prosciutto-and-goat-cheese-strata-007.jpg",
  "href": "https://food52.com/recipes/8137-prosciutto-and-goat-cheese-strata",
  "extension": "Chrome",
  "firstAdded": "2018-01-26T22:39:23.306000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Line bottom of 13 x 9 x 2-inch glass baking dish until completely covered with one layer of bread, cutting some slices to fit. Arrange half of the prosciutto evenly over bread. Sprinkle half of the goat cheese and half of the provolone on top of the prosciutto, then add half of the green onions and half of the basil. Cover with second layer of bread. Layer remaining prosciutto, goat cheese, provolone, green onions, and basil atop bread. Cut remaining bread into 1/4-inch cubes. Sprinkle over top.",
    "Whisk eggs, milk, mustard, and salt in bowl. Season with pepper. Pour egg mixture over layered bread mixture, then press down on the bread with a spatula. Drizzle melted butter over bread and egg mixture. Cover and refrigerate overnight.",
    "To bake the strata, preheat oven to 350° F. Uncover strata and let stand at room temperature, 30 minutes. Bake until center is set, about 1 hour. Remove from oven, and set aside. Preheat broiler, then place strata under broiler until top is golden, about 30 seconds. Cut into large squares and serve."
  ],
  "ingredients": [
    "0",
    "18 slices firm white bread, crusts removed",
    "6 ounces bacon or prosciutto, thinly sliced, divided",
    "8 ounces Boursin or goat cheese, crumbled, divided",
    "4 ounces provolone, grated (about 1 1/2 cups), divided",
    "1/4 cup chopped green onions or leeks, divided",
    "6 tablespoons fresh basil, chopped, divided",
    "5 large eggs",
    "2 cups whole milk",
    "1 tablespoon Dijon mustard",
    "1/2 teaspoon salt",
    "Pepper, to taste",
    "3 tablespoons butter, melted"
  ],
  "__v": 1
}