{
  "hash": "9cb96cee8f12bbb163ec7ef245282fda178f9fad",
  "title": "French Onion Soup",
  "image": "http://i0.wp.com/tiphero.com/wp-content/uploads/2016/02/Screen-Shot-2017-03-29-at-10.13.44-AM.png?zoom=1.25&resize=750%2C350",
  "href": "http://tiphero.com/crockpot-french-onion-soup/",
  "extension": "Chrome",
  "firstAdded": "2017-05-18T23:45:16.007000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "Put the onion slices in a 5-quart (or larger) slow cooker, along with the butter, olive oil, salt, and black pepper.",
    "Cover the crockpot and cook on low overnight, or for 10-12 hours. The onions should be dark golden brown and soft.",
    "Add the beef broth, balsamic vinegar, and fresh thyme.",
    "Cover and continue cooking on low for 6 to 8 hours.",
    "Season to taste with additional salt and pepper, if desired, and stir in the brandy, if using.",
    "Preheat the oven to 350 degrees Fahrenheit (180 degrees Celcius).",
    "In evenly-portioned amounts, ladle the soup into oven-safe bowls. Place the bowls on a baking sheet to catch any spills while in the oven.",
    "Top each bowl with a baguette slice and the shredded Gruyere.",
    "Bake for 20 to 30 minutes, until the cheese is completely melted.",
    "Turn the oven to broil and brown the tops for 2 to 3 minutes, or until the cheese is bubbling and browned. Remove from the oven and let cool for a few minutes before enjoying!"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "3 pounds yellow onions, peeled, cut in half and thinly sliced",
    "2 tablespoons unsalted butter, melted",
    "2 tablespoons olive oil",
    "2 ½ teaspoons kosher salt",
    "½ teaspoon freshly ground black pepper, or more to taste",
    "2 sprigs fresh thyme",
    "¼ cup balsamic vinegar",
    "8 cups (2 32-ounce cartons) beef broth",
    "⅓ cup brandy, optional but recommended",
    "4 to 6 baguette slices, toasted (1 slice per bowl)",
    "1 ⅓ to 2 cups grated Gruyere cheese (⅓ cup per bowl)"
  ],
  "__v": 1
}