{
  "hash": "ad5443ed0c0a1cfd4f98461832e49e77a59b4121",
  "title": "Steamed broccoli with beurre blanc",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/546_1_1349100939_lrg.jpg",
  "href": "http://www.jamieoliver.com/recipes/vegetables-recipes/steamed-broccoli-with-beurre-blanc/",
  "firstAdded": "2014-12-31T15:01:08.914000",
  "users": [
    null
  ],
  "keywords": [
    "white",
    "wine",
    "preferably",
    "chablis",
    "shallot",
    "red",
    "onion",
    "leaves",
    "flatleaf",
    "parsley",
    "tarragon",
    "bay",
    "leaf",
    "black",
    "peppercorns",
    "heads",
    "broccoli",
    "broken",
    "florets",
    "unsalted",
    "butter",
    "salt",
    "pepper"
  ],
  "directions": [
    "0",
    "Put your wine, shallot, herbs and peppercorns into a small pot and bring to the boil, then simmer slowly for 3 or 4 minutes or until reduced by half and remove from the heat. The first way to make your beurre blanc is to pour the flavoured wine through a sieve into a metal bowl. Place the bowl over a pan of water on a very low heat, whisk, and add the cubes of butter one at a time, whisking them in until all the butter has been used. The sauce will emulsify and look like a very loose custard. Use the beurre blanc immediately or keep whisking it over your pan of water. If you leave it too long, the sauce may split.",
    "The second way, and this is my favourite, is to pour some boiling water into a Thermos flask to preheat and clean it. Pour the water away and then sieve the flavoured wine into the thermos, adding all of the butter. Put the lid on tightly, place a tea towel over the lid and shake the thermos around for a few minutes. Open it very carefully (in case of any hot steam escaping) and you should have a nice beurre blanc sauce. The best thing about this method is that you can keep it in the flask and it will keep warm until you're ready to serve the food.",
    "Steam or boil your broccoli florets until they're soft but not overdone and mushy. Correct the seasoning of the beurre blanc and pour it over the steaming broccoli. For dinner parties it's quite nice to send out your plain steamed broccoli first, then if you've used a Thermos, take it out and pour it over – everyone will think you're mad. Happy days!"
  ],
  "ingredients": [
    "0",
    "200 ml white wine, preferably Chablis",
    "1 shallot, or ½ a red onion, peeled and finely chopped",
    "a few leaves fresh flat-leaf parsley",
    "a little fresh tarragon",
    "1 bay leaf",
    "4 black peppercorns",
    "2 heads broccoli, broken into florets",
    "170 g unsalted butter, diced",
    "sea salt",
    "freshly ground black pepper"
  ],
  "__v": 1
}