{
  "hash": "e4eb6ec3b75772fb03c458e7c47d42fd55ebd112",
  "title": "Stir-fried duck with sugar snap peas & asparagus",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/553_1_1350908593_lrg.jpg",
  "href": "http://www.jamieoliver.com/recipes/duck-recipes/stir-fried-duck-with-sugar-snap-peas-and-asparagus/",
  "firstAdded": "2014-12-31T14:50:20.636000",
  "users": [
    null
  ],
  "keywords": [
    "duck",
    "breasts",
    "fivespice",
    "salt",
    "black",
    "pepper",
    "sunflower",
    "groundnut",
    "oil",
    "asparagus",
    "trimmed",
    "sugar",
    "snap",
    "peas",
    "mangetouts",
    "garlic",
    "red",
    "chillies",
    "deseeded",
    "thumbsized",
    "pieces",
    "ginger",
    "zest",
    "segmented",
    "oranges",
    "honey",
    "mint",
    "leaves",
    "picked",
    "lowsalt",
    "soy"
  ],
  "directions": [
    "0",
    "First of all, score the skin of the duck with a sharp knife. Then dust the breasts all over with the five-spice and a small pinch of salt. Put the duck breasts skin side down in a cold wok, then bring it slowly up to a medium low temperature so the white fat turns into wonderful thin, crispy, golden crackling. Cook for around 12 minutes, then turn the breasts over and cook for a further 5 minutes.",
    "By which time they will be cooked medium, so remove them to a plate and pour away the duck fat. Get all your veggies and flavourings ready to go and wipe your wok. Now you want to get it really hot – if you want to open the window (and cover the fire alarm – joke!), then do. You may need to cook it all in smallish batches depending on the size of your wok.",
    "Add a couple of tablespoons of sunflower or groundnut oil to your hot wok. Carefully swill the oil around so that it covers the whole pan. Add your asparagus and sugar snap peas or mangetouts and toss around, then add the garlic, chilli and ginger. Continue stir-frying on the highest heat for a couple of minutes, until the asparagus has softened a little but still has a nice crunch. By all means have a taste. Remove the veg to a plate. Slice up your duck breasts into little slivers and put these back into the wok with any resting juices and maybe an extra pinch of five-spice. Cook until nice and crispy.",
    "Put all your vegetables back into the wok, and turn down the heat. Add the oranges, honey, half the mint and the soy sauce, and serve straight away on a large plate, sprinkled with the rest of the mint. Serve with rice or noodles, as a starter or main course."
  ],
  "ingredients": [
    "0",
    "4 x 200 g duck breasts",
    "2 teaspoons five-spice",
    "sea salt",
    "freshly ground black pepper",
    "2 tablespoons sunflower or groundnut oil",
    "2 large handfuls thin asparagus, trimmed",
    "2 large handfuls sugar snap peas or mangetouts",
    "4 cloves garlic, finely sliced",
    "1-3 fresh red chillies, deseeded and finely sliced",
    "2 thumb-sized pieces fresh ginger, peeled and grated",
    "zest of and segmented 4 oranges",
    "1 tablespoon honey",
    "1 handful fresh mint, leaves picked",
    "3 tablespoons low-salt soy sauce"
  ],
  "__v": 1
}