{
  "hash": "b38c9d0252f835ebc3badaad11d8c9381ddc62f7",
  "title": "Authentic Mole",
  "image": "",
  "href": "http://recipes.sparkpeople.com/recipe-detail.asp?recipe=290049",
  "extension": "Firefox",
  "firstAdded": "2015-05-15T09:35:31.358000",
  "users": [
    null
  ],
  "keywords": [
    "new",
    "mexican",
    "chilis",
    "destemmed",
    "deseeded",
    "discard",
    "seeds",
    "guajillo",
    "chipotle",
    "ancho",
    "retain",
    "saucepan",
    "sesame",
    "peanuts",
    "hulled",
    "salted",
    "almonds",
    "blanced",
    "peppercorns",
    "medium",
    "onion",
    "garlic",
    "smashed",
    "wheat",
    "bread",
    "tortilla",
    "roma",
    "tomatoes",
    "cinnamon",
    "raisins",
    "tablet",
    "chocolate",
    "grapeseed",
    "olive",
    "oil",
    "chicken",
    "stock",
    "low",
    "sodium",
    "salt",
    "sugar"
  ],
  "directions": [
    "0",
    "Makes 22-25 1/2 c servings (depending on how much you reduce this)",
    "Begin boiling 2 1/2 quarts of water in a large pot.",
    "Add ancho seeds, sesame, peanuts, almonds and peppercorns to a small saucepan and toast over medium heat.",
    "While these are toasting, add the chilis to a grill pan and toast over medium heat.",
    "While the chilis are toasting, peel and smash the garlic and large chop the onion. When the seeds are nicely toasted, remove from heat and let cool.",
    "When the chilis are toasted, add them to the boiling water. Add the onion and garlic to the grill pan and toast.",
    "While they are toasting, cut the tomatoes in half and measure the raisins. Once toasted, add the onion and garlic to boiling water.",
    "Toast onions and garlic, then add to boiling water.",
    "Toast tomatoes, cinnamon stick, and raisins in grill pan.",
    "While tomatoes, etc are toasting, add tortilla and bread to boiling water (watching the bread expand is my favorite part!).",
    "Once toasted, add the tomatoes, cinnamon stick and raisins to the boiling water. Also add the seed mixture, grapeseed oil, chocolate, stock and salt. Let simmer approximately 30 minutes.",
    "Use immersion blender to puree thoroughly. If you do not have an immersion blender, allow mixture to cool and blenderize in batches (add time to let it cool -- do NOT blend while hot!).",
    "Turn heat on low and add the sugar. Simmer uncovered until thick, about 15-20 minutes."
  ],
  "ingredients": [
    "0",
    "5 New Mexican chilis, destemmed and deseeded (discard seeds)",
    "2 Guajillo chilis, destemmed and deseeded (discard seeds)",
    "3 chipotle chilis, destemmed and deseeded (discard seeds)",
    "4 ancho chilis, destemmed and deseeded -- retain seeds in a small saucepan",
    "1 oz sesame seeds (~2T)",
    "1 oz peanuts (hulled, not salted)",
    "1 oz almonds, blanced or sliced",
    "1 t peppercorns (not ground)",
    "1 medium onion, large chopped",
    "6 cloves garlic, smashed",
    "1 piece wheat bread",
    "1 tortilla",
    "1 lb roma tomatoes (~4-6), cut in half",
    "1 stick cinnamon",
    "1 oz raisins",
    "1/2 tablet Mexican chocolate",
    "1 c grapeseed oil (or a little over 3/4 c olive oil)",
    "2 T chicken stock, low sodium",
    "2 t salt",
    "1 c sugar"
  ],
  "__v": 1
}