{
  "hash": "426cee6c8829058c3cbecd87325b3353e13bd837",
  "title": "Cider Vinaigrette Roasted Root Vegetables",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2014/11/cider-roasted-root-vegetables-vertical-a-1600.jpg",
  "href": "https://www.simplyrecipes.com/recipes/cider_vinaigrette_roasted_root_vegetables/",
  "extension": "",
  "firstAdded": "2018-01-27T23:36:07.939000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Preheat the oven to 450°F. In a large bowl (enough room for all the vegetables) mix together the cider vinegar, olive oil, brown sugar, salt and pepper. Add the vegetables—the beets, carrots, yams, parsnips, onion—to the bowl and toss to combine.",
    "2 Line two large roasting pans or sturdy rimmed baking sheets with aluminum foil. Spread the root vegetables out over the pans in a single layer, with some space in between so that the vegetables don't crowd each other too much and the hot oven air can circulate around the vegetables. (You'll get better browning that way.) Pour the remaining vinaigrette over the root vegetables in the pans.",
    "3 Place vegetables in the oven and roast for 35 to 40 minutes, turning the pans (and swapping bottom and top rack positions), half-way through the cooking. Cook until the vegetables are well browned and caramelized around the edges.",
    "4 Remove from oven and gently loosen the root vegetables from the foil with a wooden spoon. Sprinkle with thyme. Add more salt and pepper to taste."
  ],
  "ingredients": [
    "0",
    "1/2 cup cider vinegar",
    "1/2 cup olive oil",
    "3 Tbsp dark brown sugar",
    "1/4 teaspoon kosher salt",
    "Freshly grated black pepper to taste",
    "4 medium golden beets, peeled, thickly sliced",
    "4 medium carrots, peeled, sliced lengthwise into 1 to 2 inch long pieces",
    "3 medium garnet yams, sliced lengthwise into 1 to 2 inch long pieces",
    "4 medium parsnips, peeled, sliced lengthwise into 1 to 2 inch long pieces, any tough woody core removed",
    "1 large red onion, thickly sliced",
    "3/4 teaspoon thyme, dry or fresh"
  ],
  "__v": 1
}