{
  "hash": "5ca27a997743384fe60d6430f708e77e84fc4764",
  "title": "Low Carb Swedish Meatballs",
  "image": "http://i1.wp.com/www.lowcarbmaven.com/wp-content/uploads/2016/01/low-carb-swedish-meatballs-2.jpg?resize=600%2C800",
  "href": "http://www.lowcarbmaven.com/low-carb-swedish-meatballs/",
  "extension": "Chrome",
  "firstAdded": "2016-06-21T10:43:33.182000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Meatballs: In a large frying pan, heat two teaspoons of oil over medium-high heat until hot. Add the minced onions and saute until soft.",
    "Put all of the ingredients for the meatballs into a large bowl and mix with a hand mixer until completely combined and light and fluffy.",
    "Using a tablespoon measure, scoop the meatball mixture, roll into a ball and place onto a foil lined sheet pan. I like to keep my hands oiled so the meatballs don't stick to my hands. Two tablespoons of oil in a small bowl is plenty. By measuring carefully, you should get about 60 meatballs.",
    "In the same pan in which the onions were sauteed, heat about 2 teaspoons of oil over medium high heat. Add half of the meatballs turning each one three times, at about 2 minutes per side.",
    "Remove the meatballs to the sheet pan; lift up half of the foil and place them on the clean sheet pan. Add the rest of the oil to the saute pan and cook the remaining half of the meatballs. Remove the meatballs to the sheet pan. Turn off the heat under the saute pan.",
    "Cream Sauce: Heat the cream cheese in the microwave for 1 minute. Pour the 2 tablespoons of brandy and ¼ cup of the beef broth into the pan, turning the heat to medium high. Scrape up all of the brown bits on the bottom and sides of the pan. Add the cream cheese and break it up and try to melt it as best as you can. Add the cream and stir. Put the sauce from the pan into a blender and add the rest of the beef broth. Blend until smooth and add it back to the pan. Add the Worcestershire sauce and Dijon Mustard. Simmer the sauce until it reduces and thickens to your liking, 5 - 10 minutes. Adjust seasoning. Garnish with chopped parsley.",
    "Use a looser sauce for appetizers (like in a crock pot) and a thicker sauce for dinner."
  ],
  "ingredients": [
    "0",
    "Meatballs",
    "2 pounds lean ground beef",
    "2 large eggs",
    "4 ounces onion, minced and sauteed until soft",
    "¼ cup heavy cream",
    "1 tablespoon Worcestershire sauce",
    "1 tablespoon Montreal Steak Seasoning",
    "1 tablespoon Sukrin Gold (or your favorite sweetener)",
    "1 teaspoon pure ground chipotle pepper seasoning",
    "½ teaspoon pepper",
    "¼ teaspoon salt",
    "¼ teaspoon allspice",
    "¼ teaspoon nutmeg",
    "2 tablespoons olive oil, divided",
    "Gravy",
    "4 ounces cream cheese",
    "1½ cups unsalted beef broth",
    "1 cup heavy cream",
    "2 tablespoons Brandy",
    "2 teaspoons Dijon mustard",
    "2 teaspoons Worcestershire sauce",
    "¼ teaspoon salt",
    "⅛ teaspoon pepper",
    "garnish with chopped parsley"
  ],
  "__v": 1
}