{
  "hash": "0af99ac5498bfa8b09d7103f1e9f682805180db7",
  "title": "Pumpkincredible Hummus",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2013/12/Pumpkincredible-Hummus.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/pumpkincredible-hummus",
  "extension": "Chrome",
  "firstAdded": "2015-06-08T10:17:50.051000",
  "users": [
    null
  ],
  "keywords": [
    "chickpeas",
    "rinsed",
    "white",
    "beans",
    "cannellini",
    "pumpkin",
    "squeezed",
    "try",
    "lemon",
    "juice",
    "lime",
    "flavor",
    "really",
    "works",
    "mediumlarge",
    "garlic",
    "adjust",
    "use",
    "smaller",
    "clove",
    "kidfriendly",
    "salt",
    "tahini",
    "cumin",
    "rounded",
    "allspice",
    "dont",
    "smoked",
    "paprika",
    "maple",
    "syrup",
    "seeds",
    "toasting",
    "reserve"
  ],
  "directions": [
    "0",
    "In a food processor add all ingredients except pumpkin seeds (and starting with 1 tbsp tahini). Puree until very smooth. Taste, and if you’d like to add addditional garlic or spices, add a little (and if you’d like a richer tahini flavor, add the other tablespoon). Then, add most of the pumpkin seeds (reserving a couple of tbsps), and pulse through. Transfer mixture to a serving dish, and top with remaining pumpkin seeds. Serve with whole-grain pita breads, tortilla chips, warm whole-grain bread, etc.",
    "Beans Note: The combination of chickpeas and white beans makes this hummus a little creamier than using just chickpeas alone.",
    "Pumpkin Seeds Note: When I toast nuts and seeds, I do so in larger batches so that I have them ready to use another time. So, consider toasting about a cup or more. To toast pumpkin seeds, place on a baking sheet lined with parchment paper (I use my toaster oven and a small baking tray). Bake at 400 for several minutes until they turn a golden color and you can smell a nutty aroma. This won’t take long, maybe about 5-7 minutes, possibly longer depending on your oven. Just be sure to watch them after about 6-7 minutes, as they can burn quickly."
  ],
  "ingredients": [
    "0",
    "1 can (14 oz) chickpeas, drained and rinsed",
    "1 can (14 oz) white beans (cannellini or other), drained and rinsed",
    "1 cup pure pumpkin",
    "1/4 cup freshly squeezed lime juice (try not to substitute lemon juice, the lime flavor really works here)",
    "1 medium-large clove garlic (adjust to taste, use smaller clove for kid-friendly)",
    "1 – 1 1/4 tsp sea salt (adjust to taste)",
    "1 1/2 – 2 tbsp tahini (to taste)",
    "1 tsp ground cumin",
    "1/4 tsp (rounded) ground allspice",
    "1/2 tsp smoked paprika (if you don’t have smoked paprika, use another 1/4 tsp cumin – then go out and get yourself some smoked paprika!!)",
    "1/2 tsp pure maple syrup",
    "1/3 cup toasted pumpkin seeds (see note for toasting; reserve about 2-3 tbsp for garnish)"
  ],
  "__v": 1
}