{
  "hash": "ef020573ea571d5eaf1332316ee5ab2728575d90",
  "title": "Qurrito niczym z KFC",
  "image": "http://www.iv.pl/images/73709694558600093044.jpg",
  "href": "http://to-tylko-blog.blog.pl/2014/05/06/qurrito-niczym-z-kfc/comment-page-1/",
  "extension": "",
  "firstAdded": "2016-09-22T21:01:29.093000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Umyte mięso osuszyć ręcznikiem papierowym i pokroić w paski (na 1 qurrito potrzebujemy 4-5 pasków).",
    "Składniki marynaty wymieszać i dokładnie obtoczyć w niej mięso, odstawić najlepiej na 2 godziny do lodówki (można nawet dłużej wówczas mięso nabierze lepszego smaku).",
    "Wszystkie składniki panierki wymieszać. Pokrojone i zamarynowane cząstki mięsa panierować w mące z przyprawami, zamoczyć w wodzie i ponownie w mące mocno ściskając każdy kawałek ręką aby panierka dobrze przylegała. Smażyć na gorącym, najlepiej głębokim tłuszczu w rondelku na złocisty kolor. Po usmażeniu osączyć z tłuszczu na ręczniku papierowym.",
    "Na połowie placka tortilli (jak na zdjęciu poniżej) ułożyć cząstki kurczaka, polać sosem BBQ, posypać serem, złożyć na pół i zasmażyć na suchej patelni (zwykłej lub grillowej), aż ser się rozpuści (ja zapiekam w opiekaczu z wymiennymi płytkami: do zapiekania, gofrów, tostów, donutów)"
  ],
  "ingredients": [
    "0",
    "Smaczna przekąska, a dla niektórych nawet danie, o bardzo oryginalnym charakterze. Smak niczym z KFC z tą jednak różnicą, że bardziej naturalny. Polecam :)",
    "Składniki na 2 Qurrito:",
    "1 pojedyńcza pierś z kurczaka",
    "Sos BBQ – użyłam Party Dip firmy Prymat (do rozmieszania z 100 g ketchupu z 2 łyżkami wody)",
    "Ser cheddar starty na tarce (lub inny twardy ser żółty)",
    "2 tortille pszenne",
    "Marynata do mięsa:",
    "2 łyżki oliwy",
    "1 łyżeczka papryki ostrej",
    "1 łyżeczka papryki słodkiej",
    "chili i tabasco (wg uznania, jak ktoś lubi ostro)",
    "Panierka:",
    "100 g mąki",
    "1/3 łyżeczki pieprzu",
    "1/3 łyżeczki chili",
    "1/3 łyżeczki czosnku granulowanego",
    "1/2 łyżeczki papryki słodkiej",
    "1/3 łyżeczki oregano",
    "1/3 łyżeczki bazylii",
    "1/4 łyżeczki suszonego imbiru",
    "1/2 łyżeczki soli",
    "Dodatkowo: olej do smażenia i miseczka z wodą do panierowania."
  ],
  "__v": 1
}