{
  "hash": "e0eda7890210807993734f6e2787214d0a007efa",
  "title": "No-Bake Oreo Cheesecake",
  "image": "https://media3.popsugar-assets.com/files/2015/06/08/762/n/1922398/16b94e91_NoBakeCherryCheesecake.xxxlarge.jpg",
  "href": "http://www.popsugar.com/food/-Bake-Oreo-Cheesecake-37658852",
  "extension": "Chrome",
  "firstAdded": "2016-06-22T21:34:38.481000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "Line an 8-inch square baking pan with foil, leaving about 1 inch of the foil extending over the edges of the pan. The extra foil will create handles that you can use to lift the cheesecake from the pan.",
    "In a medium bowl, stir together the Oreo cookie crumbs and melted butter. Add crumb mixture into the bottom of prepared pan and press into an even layer.",
    "In a large bowl with an electric mixer, beat cream cheese for about 2 minutes. Gradually add in powdered sugar and continue beating until smooth. Beat in vanilla until combined. Use a rubber spatula to fold in the whipped topping until completely incorporated.",
    "Spoon filling onto crust and spread into an even layer. Cover and refrigerate for at least 3 hours.",
    "When you are ready to serve, remove cheesecake from pan using the foil overhang and cut into squares. Before serving, top with cherry pie filling.",
    "INFORMATION",
    "Category Desserts, Cheesecake Yield 9 servings Cook Time 3 hours 15 minutes"
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "For the Oreo crust:",
    "25 regular Oreo cookies, crushed into fine crumbs (I used a food processor)",
    "3 tablespoons melted butter",
    "For the cheesecake:",
    "8 ounces cream cheese, room temperature",
    "1/2 cup powdered sugar, sifted",
    "1 teaspoon vanilla extract",
    "8 ounces frozen whipped topping (Cool Whip or TruWhip), thawed according to package directions",
    "For the topping:",
    "1 21-ounce can of cherry pie filling"
  ],
  "__v": 1
}