{
  "hash": "1e3689c73d6bc3450b528415d18ae824f0695f50",
  "title": "Рис \"По-индийски\"",
  "image": "http://www.povarenok.ru/data/cache/2012dec/17/29/51405_63658-300x0.jpg",
  "href": "http://www.povarenok.ru/recipes/show/18778/",
  "extension": "Chrome",
  "firstAdded": "2015-12-17T16:05:29.687000",
  "users": [
    null
  ],
  "keywords": [],
  "directions": [
    "0",
    "Итак, всё начинается с промывки риса. Промывать его надо только холодной водой, перетирая между пальцами и ладонью. На фотографии я вынул руку из чашки, чтобы показать, как это делается, но на самом деле, рука должна быть в чашке или под струёй воды.",
    "Смените воду несколько раз и повторяйте процесс, пока она не станет чистой, как на фотографии.",
    "Промывка риса позволяет удалить с его поверхности частицы рисовой муки, остатки шелухи и крупицы мусора, если таковые имеются. Промывайте рис всегда, даже, если он самый дорогой и качественный.",
    "Далее рис необходимо немного просушить.",
    "Теперь вскипятите в отдельной кастрюле или чайнике воду. А пока она закипает, растопите сливочное масло в толстостенной кастрюле, всыпьте туда соль, специи, рис и немножко его поджарьте при постоянном помешивании. Секрет здесь в том, что при тщательном перемешивании, каждая рисинка покрывается маслом и при варке они остаются раздельными, что в итоге позволяет получить прекрасный рассыпчатый рис. При поджаривании процесс имеет две стадии - сначала рис станет прозрачным, а потом приобретёт молочный цвет. На этом этапе следует остановиться и перейти к следующему шагу.",
    "Как только рис побелеет, влейте в него кипящую воду, убавьте огонь до минимума и накройте крышкой.",
    "Теперь очень важно не открывать крышку и не трогать рис, пока он не сварится. На это уйдёт минут 10-15.",
    "Ну вот, наш рис готов! Остаётся добавить, что раскладывать рис в тарелки следует деревянной ложкой, чтобы не повредить рисинки и не испортить их внешний вид."
  ],
  "ingredients": [
    "0",
    "Рис (длиннозёрный рис сорта \"Басмати\") — 1 стак.",
    "Масло сливочное (как и в любых блюдах, желательно использовать свежее, качественное, с высокой жирностью, сливочное масло) — 1/2 ч. л.",
    "Соль (Обычная поваренная соль.) — 1/2 ч. л.",
    "Перец черный (молотый.) — 1/8 ч. л.",
    "Куркума (без этой чудесной специи никуда) — 1/4 ч. л.",
    "Вода (желательно, конечно, использовать только чистую воду, не из под крана) — 2 стак."
  ],
  "__v": 1
}