{
  "hash": "a85c0638c31efebf4f45f3c1fc7256afc841c88a",
  "title": "Pork belly roast",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/407_1_1350550087_lrg.jpg",
  "href": "http://www.jamieoliver.com/recipes/pork-recipes/pork-belly-roast/",
  "firstAdded": "2014-12-31T14:51:43.365000",
  "users": [
    null
  ],
  "keywords": [
    "higherwelfare",
    "pork",
    "belly",
    "fennel",
    "seeds",
    "salt",
    "olive",
    "oil",
    "carrots",
    "celery",
    "onions",
    "garlic",
    "skin",
    "thyme",
    "bottle",
    "white",
    "wine",
    "plain",
    "flour"
  ],
  "directions": [
    "0",
    "Turn oven to the highest temperature you can get it to. Using a Stanley knife score the skin down to the meat (try not to cut the meat), make the cuts very close together (go across the skin). Put the fennel seeds and the Maldon sea salt in a pestle and mortar and grind till the seeds are smashed and mixed well with the salt.",
    "Pour half the oil over the top of the skin of the pork belly, sprinkle over ½ of the fennel and salt mixture and rub in, pour over the remaining oil and then the seed and salt mixture, now really rub this into the skin so that everything gets inbetween the skin and down onto the meat. Wash the carrots and celery well, cut them into large 2 inch pieces and throw these into the base of your roasting dish. Throw in the whole garlic bulbs, peel and cut the onions into large wedges. Toss in the whole thyme leaves.",
    "Put the seasoned pork belly on top of the vegetables and then put into your very hot oven for 10-15 minutes or until the skin of the belly starts to bubble and is golden brown. Turn the oven temperature down to 170°C/325°F/gas 3 then roast for 1.5 hours. Carefully open the oven door and add into the tray ¾ of the white wine, continue cooking for 1 hour. Remove the meat carefully from the oven and test to see if it pulls apart easily. If not put back in the oven until the meat is ready then remove from the oven. Take the meat from the tray and place onto a wooden board and allow to rest while you make the gravy. Put the tray of roasted vegetables directly onto your stove top and on a medium heat add in the flour and stir till thick. Cook for 1 minute then add in the remaining wine. If you sauce is too thick add a little more white wine. Using a potato masher, mash up the vegetables until you have a delicious thick looking sauce. Cook for 2-3 minutes on a low heat. Taste, strain through a sieve keeping all the lovely sauce for pouring over the roasted belly.",
    "Remove the crackling from the top of the belly and break up into pieces, set aside then pull the pork belly apart and enjoy with more vegetables and your home made gravy."
  ],
  "ingredients": [
    "0",
    "1.3 kg higher-welfare pork belly",
    "15 g fennel seeds",
    "5 g sea salt",
    "100 ml olive oil",
    "carrots",
    "celery",
    "onions",
    "garlic cloves, skin on",
    "fresh thyme",
    "1 bottle white wine",
    "75 g plain flour"
  ],
  "__v": 1
}