{
  "hash": "a858e4d085a72570397fa2944e2cc42ebe218741",
  "title": "PREV RECIPENEXT RECIPE\nCrunchy Shrimp Roll with Ginger Sauce",
  "image": "",
  "href": "https://www.foodnetwork.com/recipes/crunchy-shrimp-roll-with-ginger-sauce-recipe-2102645",
  "extension": "Chrome",
  "firstAdded": "2018-02-15T17:15:52.740000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cook the rice ¿ 1 part rice to 2 parts water. This can be done in a rice cooker, steamer, or pot according to package directions. When rice is cooked, spread the rice on a large baking sheet and sprinkle with sushi vinegar. Mix well, but do not break the rice grains. Chill the rice to room temperature.",
    "Heat a deep fryer or a large pot halfway filled with oil to 360 degrees F.",
    "Season the shrimps with salt, dust them with flour, and roll them in eggs then in panko. Fry the breaded shrimps to golden brown. Remove to a paper towel lined plate.",
    "Place the nori on a cutting board, spread sushi rice on the back side (non glossy side), sprinkle black sesame seeds over rice. Place the rice side down on a bamboo mat that has been covered with plastic wrap. Place 2 shrimps, 2 strips of avocado, strip of cucumber and some wasabi on the center. Roll. (good luck!) Cut the roll in to 8 pieces (this you need better than just good luck!).",
    "Pour Sesame Ginger sauce on serving plate, then place sushi over the sauce. Sprinkle the sauce with some crushed red pepper flakes.",
    "Sesame Ginger sauce:",
    "Add all the ingredients in a blender. Blend on high until all solids turn liquid."
  ],
  "ingredients": [
    "0",
    "2 cups Japanese rice",
    "Sushi vinegar",
    "8 large shrimps, peeled, cleaned, tail-on and pressed by hand to make them straight.",
    "Salt",
    "Flour",
    "2 eggs, beaten",
    "Panko (Japanese bread crumbs)",
    "4 large sheets of nori cut 2/3 size",
    "Black sesame seeds",
    "1 avocado, cut in 8 strips",
    "1/2 hot house cucumber, peeled, seeded and cut into 4 long strips (the length of nori)",
    "Wasabi paste",
    "Ginger Sauce, recipe follows",
    "Red pepper flakes, for garnish"
  ],
  "__v": 1
}