{
  "hash": "bea01e7a44b9a838ed8acc73fde2f5a2c3c2c200",
  "title": "Andes Mint Cake",
  "image": "http://www.yourcupofcake.com/wp-content/uploads/2014/07/Andes-Mint-Cake-Recipe-813x1024.jpg",
  "href": "http://www.yourcupofcake.com/2014/07/andes-mint-cake.html",
  "extension": "",
  "firstAdded": "2015-11-23T20:04:34.208000",
  "users": [
    null
  ],
  "keywords": [
    "box",
    "devils",
    "food",
    "cake",
    "eggs",
    "oil",
    "buttermilk",
    "milk",
    "sour",
    "cream",
    "vanilla",
    "butter",
    "softened",
    "peppermint",
    "sugar",
    "green",
    "dye",
    "cocoa",
    "powered",
    "chocolate",
    "chips",
    "whipping"
  ],
  "directions": [
    "0",
    "Preheat oven to 350 degrees and grease 3 8-inch pans. I prefer to line the bottoms of my pans with foil or parchment paper for easy removal.",
    "Sift cake mix into a small bowl and set aside.",
    "In a large bowl, whisk your eggs, oil buttermilk, sour cream and vanilla extract together until smooth.",
    "Stir in cake mix.",
    "Pour equal amount of batter into each prepared pan and use a spatula to spread evenly. Bake for 17-22 minutes or until an inserted knife comes out clean. (If you are only making two layers, the cake will need 20-25 minutes in the oven.)",
    "Let cakes cool.",
    "Green Filling: Beat butter for 2 minutes. Add peppermint extract and milk and beat again. Slowly add in powdered sugar until you get your desired consistency.",
    "Chocolate Buttercream: Beat butter for 2 minutes. Add cocoa powder, peppermint extract and milk and beat again. Slowly add in powdered sugar until you reach your desired consistency.",
    "Chocolate ganache: Place chocolate chips and heavy whipping cream in a microwave proof bowl and microwave for 30 seconds. Stir and continue to microwave in 10 second increments until smooth.",
    "Assemble your cake by placing one layer of chocolate cake on your cake stand, frost with green filling, then another layer of cake, then the rest of your green filling, then your last layer of cake, and then frost the top and sides in chocolate buttercream.",
    "Use Andes Mint candies to decorate the bottom.",
    "Pour your ganache carefully over the top of the cake and let it drip down the sides. Finish with chopped Andes Mints on top."
  ],
  "ingredients": [
    "0",
    "1 box devil’s food cake mix",
    "3 eggs",
    "½ C. oil",
    "¾ C. buttermilk or milk",
    "¾ C. sour cream",
    "2 tsp. vanilla extract",
    "1 ¼ C. butter, softened",
    "1 ½ tsp. peppermint extract",
    "4-5 C. powdered sugar",
    "green food dye, optional",
    "1 ¼ C. butter, softened",
    "½ C. unsweetened cocoa powder",
    "1 ½ tsp. peppermint extract",
    "2 Tbsp. milk or sour cream",
    "3-4 C. powered sugar",
    "¾ C. chocolate chips",
    "½ C. heavy whipping cream"
  ],
  "__v": 1
}