{
  "hash": "ffe420f8a40ff27e9b7c1c5da47b4dd4a60e598a",
  "title": "Sausage with Rigatoni in Tomato Cream Sauce",
  "image": "http://1.bp.blogspot.com/-W2Qq9rR-1jM/UCkzdo0yWWI/AAAAAAAASls/rpMq06SXcUM/s400/Sausage+with+Rigatoni+in+Tomato+Cream+Sauce.JPG",
  "href": "http://www.deepsouthdish.com/2008/11/sausage-with-rigatoni-in-tomato-cream.html",
  "extension": "Firefox",
  "firstAdded": "2015-10-15T04:41:47.293000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "unsalted",
    "butter",
    "medium",
    "onion",
    "italian",
    "sausage",
    "casings",
    "garlic",
    "chicken",
    "broth",
    "tomatoes",
    "undrained",
    "cream",
    "parsley",
    "basil",
    "kosher",
    "salt",
    "cracked",
    "black",
    "pepper",
    "cajun",
    "seasoning",
    "slap",
    "mama",
    "rigatoni",
    "pasta",
    "parmesan",
    "sprinkling"
  ],
  "directions": [
    "0",
    "Cook the pasta to al dente according to package directions; drain and rinse well.",
    "Heat olive oil over medium high heat in a large skillet; add butter. Add the onion and saute just until it begins to caramelize. Remove sausage from the casings and add to onion mixture, breaking the sausage up with a spoon as it cooks. Continue cooking until sausage is lightly browned and cooked through. Add the garlic and continue cooking for another couple of minutes. Drain off fat.",
    "To the sausage mixture, add the chicken broth and bring to a boil. Cook down about 2 minutes until broth has significantly reduced. Add the undrained tomatoes, bring to a boil and reduce heat to a medium simmer. Continue cooking for another 2 to 3 minutes. Add the cream, bring to a boil, reduce heat to medium simmer and cook for about 5 more minutes. Add the parsley, salt, pepper and Cajun seasoning, stir well and taste to adjust the seasoning as needed.",
    "Add the drained and rinsed pasta to the sauce, stir and turn the heat down to low. Add in a large handful of Parmesan cheese and stir to incorporate. Just before servings, sprinkle a bit of additional Parmesan cheese on top of each plate of pasta.",
    "Variation: For extra kick, substitute a can of Rotel tomatoes for the diced. To substitute fresh garden tomatoes, you'll need about 2 pounds, or about 2 cups of chopped, undrained tomatoes. Lighten this up by eliminating the butter and substituting milk or Greek yogurt for the heavy cream.",
    "Source: http://deepsouthdish.com"
  ],
  "ingredients": [
    "0",
    "1 tablespoon of olive oil",
    "1 tablespoon of unsalted butter",
    "1 medium onion, sliced thin",
    "1 pound of Italian sausage, casings removed",
    "2 medium garlic cloves, chopped",
    "2/3 cup of chicken broth",
    "1 (14.5 ounce) can of diced tomatoes, undrained",
    "1 cup of heavy cream",
    "2 tablespoons of dried parsley or basil",
    "1/2 teaspoon of kosher salt",
    "1/2 teaspoon of freshly cracked black pepper, or to taste",
    "1/2 teaspoon of Cajun seasoning (like Slap Ya Mama), or to taste, optional",
    "8 ounces of rigatoni pasta, cooked",
    "1/4 cup shredded Parmesan, plus more for sprinkling"
  ],
  "__v": 1
}