{
  "hash": "57c11d496804e7b1e0d99746c1d26bc0bee80cb5",
  "title": "Brussels Sprouts Lasagna",
  "image": "http://www.howsweeteats.com/wp-content/uploads/2013/12/brussels-sprouts-lasagna-I-howsweeteats.com-3.jpg",
  "href": "http://www.howsweeteats.com/2013/12/cheesy-brussels-sprouts-lasagna/",
  "extension": "Chrome",
  "firstAdded": "2015-08-24T18:53:21.845000",
  "users": [
    null
  ],
  "keywords": [
    "noboil",
    "wheat",
    "lasagna",
    "sheets",
    "olive",
    "oil",
    "brussels",
    "sprouts",
    "stems",
    "shallot",
    "salt",
    "pepper",
    "balsamic",
    "vinegar",
    "cremini",
    "mushrooms",
    "shitake",
    "garlic",
    "unsalted",
    "butter",
    "flour",
    "milk",
    "work",
    "best",
    "nutmeg",
    "provolone",
    "cheese",
    "ricotta",
    "pecorino",
    "romano"
  ],
  "directions": [
    "0",
    "Preheat the oven to 400 degrees F. Spray a 9x13 baking dish with nonstick spray.",
    "Heat a large skillet over medium heat and add 1 1/2 tablespoons of the olive oil. Add the brussels, shallots and 1/4 teaspoon each of the salt and pepper, stirring to coat. Cook until the sprouts soften and become bright in color, stirring occasionally, for about 5 to 6 minutes. Stir in the balsamic vinegar and cook for another minute. Remove the sprouts from the skillet and set them aside in a bowl.",
    "Using the same skillet, add the remaining olive oil. Add the mushrooms and garlic, stirring well to coat. Cook until the mushrooms are soft and juicy, stirring occasionally, about 6 to 8 minutes. Turn off the heat and add 1/4 teaspoon each of salt and pepper.",
    "In a saucepan, heat the butter over medium heat. Once it's sizzling, whisk in the flour to create a roux. Cook the roux for 2 or 3 minutes, until it becomes golden and fragrant. Whisking with one hand, slowly stream in the milk, stirring constantly as the mixture comes together. Cook the milk, stirring constantly, until it starts to thicken, about 5 minutes. Season the mixture with the remaining salt, pepper and nutmeg.",
    "To assemble the lasagna, add about 1/4 cup of the sauce to the bottom of the 9x13 dish. Add a layer or lasagna sheets, then top with 1/3 of the brussels and 1/3 of the mushrooms. Sprinkle on 1/3 cup of cheese and using your fingers, sprinkle on 1/4 cup of the ricotta. Drizzle 1/3 of the sauce on top. Repeat that layer two more times. Finish off the lasagna will any of the remaining cheese, the pecorino and the remaining sauce, evenly drizzled on top.",
    "Bake for 30 to 35 minutes, or until the top is golden and bubbly. Let sit for about 20 minutes before slicing. I like to serve this as a side dish or as a main meal with a large salad."
  ],
  "ingredients": [
    "0",
    "1 package no-boil whole wheat lasagna sheets",
    "3 tablespoons olive oil",
    "1 pound brussels sprouts, stems removed and sliced",
    "1 shallot, diced",
    "3/4 teaspoon salt",
    "3/4 teaspoon pepper",
    "2 tablespoons balsamic vinegar",
    "12 ounces sliced cremini mushrooms",
    "12 ounces shitake mushrooms, stems removed",
    "2 garlic cloves, minced",
    "2 tablespoons unsalted butter",
    "2 tablespoons flour",
    "2 3/4 cups milk (2% or whole will work best)",
    "1/4 teaspoon freshly grated nutmeg",
    "8 ounces provolone cheese, freshly grated",
    "3/4 cup ricotta cheese",
    "1/4 cup grated pecorino romano cheese"
  ],
  "__v": 1
}