{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 350 degrees. Butter an 8 by 8-inch baking dish (I also lined mine with parchment and buttered the parchment paper, which is optional. It just makes the brownies easier to remove after baked). In a mixing bowl, whisk together flour, baking powder and salt, set aside.",
    "To a large microwave safe bowl, add chopped chocolate and butter and heat mixture in microwave on 50% power, in 30 second intervals, stirring after each interval until melted and smooth (alternately you can melt it in a double boiler over stove top. Once melted remove from heat and proceed to next step). Add sugar to melted chocolate mixture, and using a rubber spatula, stir to combined. Mix in red food coloring, vanilla and apple cider vinegar. Stir in eggs. Add flour mixture and mix just until combined. Pour into prepared baking dish, spread into and even layer and bake in preheated oven 35 - 40 minutes until toothpick comes out with a few moist crumbs. Place on wire rack to cool completely then frost with cream cheese frosting once cool and cut into squares (I frosted each brownie individually. You can do it which ever way you prefer).",
    "For the cream cheese frosting:",
    "In the bowl of an electric stand mixer fitted with the paddle attachment, whip together butter and cream cheese on medium-high speed until pale and fluffy, about 4 - 5 minutes. Add vanilla and powdered sugar and continue to whip until pale and fluffy.",
    "Recipe Source: Cooking Classy"
  ],
  "firstAdded": "2014-06-06T12:46:32.483000",
  "hash": "18c2f66e45d3bfd6dc212f9f77a224d9b284d3de",
  "href": "http://www.cookingclassy.com/2013/12/red-velvet-brownies-fluffy-cream-cheese-frosting",
  "image": "http://www.cookingclassy.com/wp-content/uploads/2013/12/red-velvet-brownies+srgb..jpg",
  "ingredients": [
    "0",
    "1 cup all-purpose flour",
    "1/2 tsp baking powder",
    "1/4 tsp salt",
    "2 oz bittersweet chocolate (60%), chopped",
    "1/2 cup unsalted butter, diced into 6 pieces",
    "1 1/4 cups granulated sugar",
    "1 1/2 Tbsp liquid red food coloring",
    "1 1/2 tsp vanilla extract",
    "1 tsp apple cider vinegar",
    "2 large eggs",
    "1/2 cup butter, softened (I like to use 1/4 cup salted and 1/4 cup unsalted)",
    "4 oz. cream cheese, softened",
    "1/2 tsp vanilla extract",
    "2 1/2 cups powdered sugar"
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "baking",
    "salt",
    "bittersweet",
    "chocolate",
    "unsalted",
    "butter",
    "pieces",
    "granulated",
    "sugar",
    "red",
    "food",
    "coloring",
    "vanilla",
    "apple",
    "cider",
    "vinegar",
    "eggs",
    "softened",
    "use",
    "salted",
    "cream",
    "cheese"
  ],
  "title": "Red Velvet Brownies with Fluffy Cream Cheese Frosting",
  "users": [
    null
  ]
}