{
  "hash": "6cf4b602f39ad9b561e964b0746b33243d9ff4da",
  "title": "Grilled Chicken Marinade",
  "image": "https://www.chelseasmessyapron.com/wp-content/uploads/2016/06/The-absolute-best-chicken-marinade-recipe-with-a-delicious-honey-lemon-sauce.-This-grilled-honey-lemon-chicken-is-quick-to-make-and-sure-to-be-a-huge-hit.jpg",
  "href": "https://www.chelseasmessyapron.com/grilled-chicken-marinade/",
  "extension": "Chrome",
  "firstAdded": "2018-08-21T11:48:14.755000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine the vegetable oil, soy sauce, Worcestershire sauce, red wine vinegar, about 3-4 tablespoons lemon juice, 1 teaspoon lemon zest, black pepper, chopped parsley, prepared yellow mustard, 1-2 teaspoons minced garlic (for a more intense flavor use 2), and 1 tablespoon honey in a large bowl.",
    "Set aside 1/3 cup of the marinade and reserve for later.",
    "Remove fat from the chicken and pound the chicken to an even width (about 1 inch wide everywhere.) This ensures even grilling.",
    "Place the chicken in the marinade and marinate for at least 30 minutes to 6 hours. The chicken is best at 5-6 hours. Too much longer and it tends to get salty/cooked by the vinegar.",
    "Make sure your grill grates are clean and greased. To grease, dredge a paper towel in vegetable oil and holding it with tongs rub it all over the grate.",
    "Preheat the grill to medium heat about 375-450 degrees F. Don't go hotter than 450 to avoid drying out the chicken.",
    "Grill the chicken until completely cooked through (about 4-6 minutes per side depending on heat of the grill) Chicken should be at 165 degrees F at its thickest part.",
    "Generously brush chicken with the reserved marinade mix as it grills.",
    "OPTIONAL: For a quick lemon butter sauce to serve over the chicken, combine: 3 tablespoons melted butter, 3 tablespoons lemon juice, 1-2 teaspoons lemon zest, 3 tablespoons olive oil, and 3 tablespoons honey in a small bowl. Add some pepper and parsley if desired. Serve with the chicken."
  ],
  "ingredients": [
    "0",
    "1 and 1/2 pounds boneless skinless chicken breasts"
  ],
  "__v": 1
}