{
  "hash": "15a61f1011feb9654b55e8676fcf013b53c85cbf",
  "title": "BALSAMIC CHICKEN AND SPINACH SALAD",
  "image": "https://cooksmarts.imgix.net/meal_photos/1101/20170515-Balsamic-Chicken-Spinach-Salad-NM-5.jpg?ixlib=rails-2.1.4&w=430&drp=1",
  "href": "https://mealplans.cooksmarts.com/days/1101?version=standard&servings=6",
  "extension": "",
  "firstAdded": "2018-05-29T16:41:35.616000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Balsamic vinaigrette - Dice shallots. Combine shallots with vinegar, mustard, honey, oil and lemon juice. (Can be done up to 5 days ahead)",
    "Marinate chicken - Combine chicken with half the vinaigrette (reserve the other half for dressing) and tenderize with a fork. Marinate for at least 20 minutes and up to a day. (Can be done up to 1 day ahead)",
    "Strawberries - Quarter strawberries.",
    "If using a grill: Preheat grill to to 400F / 204C degrees, keeping one section on higher heat and another section on lower heat. Clean and brush grates with some oil. Remove chicken from marinade (discard marinade) and place over high heat. Sear chicken for 2 to 3 minutes on each side and transfer to lower heat. Cook until internal temperature reaches 165F / 74C degrees, an additional 2 to 3 minutes.",
    "If using the stovetop: Place a grill pan or skillet over medium heat. Brush pan with some oil and sear chicken (discard marinade) on both sides for 2 to 3 minutes. Lower heat to low-medium, cover with foil, and cook for another 3 to 5 minutes, until internal temperature reaches 165F / 74C degrees.",
    "When chicken is finished cooking, cover and let it rest for 5 minutes.",
    "Slice chicken. Assemble salads by topping spinach with sliced chicken, strawberries, crumbled cheese, and almonds. Finish with reserved half of vinaigrette at the table. Enjoy!"
  ],
  "ingredients": [
    "0",
    "Balsamic Vinaigrette (for marinade and dressing):",
    "Shallots - 1 1/2 cloves, diced",
    "Vinegar, balsamic - 4 1/2 Tbsp",
    "Mustard, Dijon - 1 1/2 Tbsp",
    "Honey - 3 Tbsp",
    "Oil, cooking - 3/4 cup",
    "Lemon juice - 1 1/2 Tbsp",
    "Balsamic Chicken and Spinach Salad:",
    "Chicken breasts, boneless and skinless - 1 1/2 lbs",
    "Strawberries - 1 1/2 pints, quartered",
    "Spinach, baby - 12 oz",
    "Cheese, blue - 6 oz (sub feta or goat cheese)",
    "Almonds, sliced - 1/2 cup"
  ],
  "__v": 2
}