{
  "hash": "c9affc634f4b8c8b4a7f7674d38ab133eca9220f",
  "title": "Amish White Bread",
  "image": "http://www.restlesschipotle.com/wp-content/uploads/2014/03/amish-white-bread-steps.jpg",
  "href": "http://www.restlesschipotle.com/amish-white-bread/",
  "extension": "Chrome",
  "firstAdded": "2016-08-28T17:48:44.913000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Dissolve the sugar in the warm water and milk in a large bowl.",
    "Whisk in the yeast.",
    "Set aside for 5 to 10 minutes, or until the yeast mixture gets foamy.",
    "Whisk in the salt and oil.",
    "With the mixer running add the flour, one cup at a time, until the dough pulls away from the bowl.",
    "Knead by machine about 5 minutes.",
    "If you are hand kneading mix in the flour until you have a sticky dough, turn the dough out onto a lightly floured surface and knead for 10 minutes or until the dough is smooth and elastic - adding flour as needed.",
    "Oil a large bowl and place the ball of dough in it.",
    "Oil the top of the dough and then cover with a damp cloth.",
    "Allow it to rise until it has doubled in bulk. This will take about an hour.",
    "Punch the dough down.",
    "Knead for three minutes or so and divide in half.",
    "Let rest for five minutes.",
    "Shape into loaves and then place in greased 9x5-inch loaf pans.",
    "Brush the tops with the melted butter.",
    "Let rise for 30 minutes, or until the dough has risen an inch or so above the pans.",
    "Bake at 350 degrees F for 30 minutes, or until loaves sound hollow when tapped.",
    "For a soft crust butter the tops and place a clean tea towel over the baked loaves as soon as you take them out of the oven. Let them cool for about 5 minutes and then take them out of the pans to finish cooling, covering them back up with the tea towel.",
    "Add ingredients to your bread machine in the order the manufacturer recommends."
  ],
  "ingredients": [
    "0",
    "1 cup water 110F",
    "1 cup whole milk 110F",
    "2/3 cup white sugar",
    "1 1/2 tablespoons active dry yeast",
    "1 1/2 teaspoons of salt",
    "1/4 cup mild vegetable oil (coconut oil works really well here!)",
    "51/2 to 61/2 cups bread flour",
    "2 tablespoons melted butter"
  ],
  "__v": 1
}