{
  "hash": "c86de74976e215d0ce2f4f8f2525b53c767a9ed8",
  "title": "Grilled Summer Vegetable Salad",
  "image": "http://www.afamilyfeast.com/wp-content/uploads/2014/08/grilled-vegetable-salad2.jpg",
  "href": "http://www.afamilyfeast.com/grilled-summer-vegetable-salad/",
  "extension": "Chrome",
  "firstAdded": "2015-05-26T20:12:02.911000",
  "users": [
    null
  ],
  "keywords": [
    "medium",
    "eggplant",
    "ears",
    "corn",
    "zucchini",
    "summer",
    "squash",
    "red",
    "onion",
    "bunch",
    "asparagus",
    "pepper",
    "herb",
    "infused",
    "oil",
    "grilling",
    "mixed",
    "grape",
    "cherry",
    "mini",
    "sunglow",
    "tomatoes",
    "favorite",
    "varieties",
    "basil",
    "leaves",
    "chiffonade",
    "gorgonzola",
    "blue",
    "cheese",
    "crumbled",
    "zest",
    "lemon",
    "juice",
    "dijon",
    "mustard",
    "salt",
    "grinds",
    "black"
  ],
  "directions": [
    "0",
    "Heat grill to the hottest temperature.",
    "Cut ends from eggplant and cut lengthwise into three or four thick slices. Shave the skin off the two outside pieces so the flesh will get grill marks. Lay the slices on your board or plate and salt both sides liberally. This will draw out the bitterness.",
    "While the eggplant sits, prepare the other vegetables.",
    "Husk the corn and place on a tray.",
    "Cut the ends off the zucchini and summer squash then cut in half lengthwise. Place on tray with corn.",
    "Cut the top off the red onion but leave the root attached. Cut it in quarters, leaving root attached to each quarter. This will help keep it together while grilling. Place on tray with other vegetables.",
    "Cut the tough ends off the asparagus and place spears on tray with vegetables.",
    "Cut the red pepper in half. Remove core and seeds and place the two halves on tray with vegetables.",
    "Rinse and dry eggplant and add to tray with other vegetables.",
    "Brush all of the vegetables on all sides with your choice of infused oils. (We found that the Hot Hungarian Paprika infused oil went very well with the corn. The thyme infused oil or the mixed spice infused oil goes well with the other vegetables.)",
    "Once all of the vegetables are brushed with oil, lay them all out on your grill. As each side chars, turn and grill the other side. Depending on your grill, the time to cook will vary but different vegetables will take different amounts of time. The corn and onions took the longest and the asparagus took the least. Just remove back to the platter once each is grilled.",
    "Cut each vegetable into bite sized pieces and place in a large bowl. With a sharp knife or a corn stripper tool (like this one), remove kernels and place in bowl.",
    "Cut all of the tomatoes in half and add to the bowl.",
    "Make the dressing by combining all ingredients and add to bowl along with the fresh basil. Toss until combined.",
    "Top with the cheese and serve."
  ],
  "ingredients": [
    "0",
    "1 medium eggplant",
    "3 ears corn",
    "2 medium zucchini",
    "2 small or one medium summer squash",
    "1 whole red onion",
    "1 bunch asparagus",
    "1 red pepper",
    "¼ cup herb infused oil, for grilling",
    "2 pounds mixed grape, cherry and mini sunglow tomatoes (or any of your own favorite varieties)",
    "¼ cup fresh basil leaves, cut into a thin chiffonade",
    "4 ounces Gorgonzola or blue cheese, crumbled",
    "1",
    "¼ cup herb infused oil",
    "Zest of half a lemon",
    "Juice from one lemon (1/4 cup)",
    "1 teaspoon Dijon mustard",
    "½ teaspoon salt",
    "Few grinds black pepper"
  ],
  "__v": 1
}