{
  "hash": "c8159fdb7919275717f1bf697f43f2f18d010d62",
  "title": "Thai Stir Fried Noodles (Pad See Ew)",
  "image": "https://www.recipetineats.com/wp-content/uploads/2014/06/Pad-See-Ew-Thai-Noodles_3-1-680x1018.jpg",
  "href": "https://www.recipetineats.com/thai-stir-fried-noodles-pad-see-ew/",
  "extension": "Firefox",
  "firstAdded": "2018-12-02T05:11:58.284000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare the noodles according to packet instructions. Some just require soaking in boiling water for 5 minutes, others require cooking in a pot of boiling water for a few minutes. For fresh noodles, soak in boiled water in a bowl for a few minutes - do not boil in a pot. Drain when ready.",
    "Meanwhile, combine sauce ingredients.",
    "Mince the garlic straight into the wok with the oil. Place wok high heat. As the oil is heating, the garlic will gradually heat too and infuse the oil with flavour.",
    "When the oil is hot and the garlic is starting to turn golden, add the chicken and Chinese broccoli stems and stir fry for 1 minute.",
    "Move the chicken and Chinese broccoli to one side and crack in the egg, and scramble it. Don't worry if some of it sticks to the wok, it will char as you continue cooking - you want that chargrilled flavour!",
    "Add the noodles, Chinese broccoli leaves and the sauce. Fold gently to combine, for the sauce to coat the noodles evenly and to caramelise, and the leaves to just wilt. They only need to be just wilted because they will continue to cook while you are plating up.",
    "Serve immediately."
  ],
  "ingredients": [
    "0",
    "Noodles",
    "6 oz / 180g dried wide rice stick noodles , or 15 oz / 450g fresh wide flat rice noodles (Sen Yai) (Note 1)",
    "Sauce",
    "2 tbsp dark soy sauce (or sub with kecap manis) (see notes for substitutes)",
    "2 tbsp oyster sauce",
    "2 tsp soy sauce (normal all purpose soy sauce)",
    "2 tsp white vinegar (plain distilled white vinegar)",
    "2 tsp sugar (white or brown)",
    "2 tbsp water",
    "Stir Fry",
    "2 tbsp peanut or vegetable oil",
    "2 cloves garlic cloves",
    "1 cup / 150g / 5oz chicken thighs (boneless, skinless), cut into bite size pieces",
    "1 large egg",
    "4 cups (packed) Chinese broccoli, leaves separated from stems (cut stems vertically into thin sticks)"
  ],
  "__v": 1
}