{
  "hash": "6b5871556486a631bf267140bcb401a65b027fc2",
  "title": "20-Minute Spicy Sriracha Shrimp and Zucchini Lo Mein",
  "image": "http://bakerbynature.com/wp-content/uploads/2014/07/IMG_8658-682x10241-2-682x1024.jpg",
  "href": "http://bakerbynature.com/sunday-suppers-spicy-sriracha-shrimp-zucchini-lo-mein/",
  "extension": "Chrome",
  "firstAdded": "2016-09-14T14:25:26.612000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Begin a large pot of salted water to boil. Once the water reaches a full boil, add the noodles and cook according to the package directions (about 4-5 minutes).",
    "While waiting for the water to boil, prepare the spicy sriracha sauce. In a small bowl stir together the brown sugar, soy sauce, sriracha, ginger, and sesame oil.",
    "In a large skillet melt 1 tablespoon of butter over medium-low heat. Add the crushed red pepper to the butter, and once it's completely melted whisk in the eggs. Stir gently and cook for about 3 minutes. Once the egg is done cooking, keep the pan on the burner but transfer eggs to a small plate; set aside. Add 1 tablespoon of oil to the pan and increase the heat to medium-high. Add shrimp and cook for 2 minutes on each side, or just until firm and bright pink. Remove with a slotted spoon and transfer to a clean plate; set aside. Add zucchini to the pan, increase heat to high, and remaining oil; stir fry until just charred; about 3 minutes. Stir in garlic and cook for one minute.",
    "Add drained noodles to the skillet along with the cooked egg, shrimp, and prepared sauce. Turn the heat on to medium-low, and stir until everything is coated well with the sauce. Sprinkle the sliced green onions and cilantro and serve at once!"
  ],
  "ingredients": [
    "0",
    "(1) 8 oz. package lo mein noodles (I found them in the ethnic foods section of our grocery store)",
    "2 Tbsp olive oil",
    "1 tablespoon butter",
    "1/2 pound shrimp, peeled",
    "1 medium zucchini, cut in half vertically, then cut into half moon shapes",
    "3 cloves garlic, minced",
    "1/2 tsp crushed red pepper flakes",
    "2 large eggs, lightly beaten",
    "1 Tbsp brown sugar",
    "2 1/2 Tablespoons soy sauce",
    "2 Tablespoons Sriracha hot sauce",
    "1 teaspoon grated ginger (optional)",
    "1 teaspoon sesame oil (optional)",
    "1/2 cup fresh cilantro",
    "3 green onions, sliced thinly",
    "Salt to taste, if needed (the soy sauce has a lot of sodium, so taste before you add any to the finished product)"
  ],
  "__v": 1
}