{
  "hash": "0e8eb471b7359416373209467e983d0dbf2c5ee0",
  "title": "quinoa black bean burrito bowls",
  "image": "https://toriavey.com/images/2012/05/Quinoa-Bowls-IMAGE-3.jpg",
  "href": "https://toriavey.com/toris-kitchen/quinoa-black-bean-burrito-bowls/",
  "extension": "Chrome",
  "firstAdded": "2019-01-31T18:28:38.889000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Rinse the quinoa thoroughly in a mesh strainer or sieve, drain.",
    "Pour quinoa into a saucepan along with 2 cups of water. Bring the quinoa to a boil, then reduce heat to a low simmer. Cover the pot. Let the quinoa simmer for about 20 minutes till it becomes tender and all the liquid has been absorbed. Keep a close eye to make sure the quinoa doesn't burn.",
    "While quinoa is cooking, heat 1 tbsp of oil in another saucepan over medium heat. Pour minced onion into the saucepan and saute for a few minutes till it softens and begins to turn brown. Add the minced garlic to the pot and let it saute for 1-2 minutes longer till aromatic.",
    "Add the black beans to the pot of onions along with 1/2 cup water, 2 tbsp of chopped fresh cilantro, chili powder and cayenne pepper. Bring the beans to a boil, then reduce heat to medium low. Let the beans simmer for 15 minutes till the liquid is mostly evaporated. Stir in 2 tbsp of fresh lime juice. Season with salt to taste.",
    "When the quinoa is fully cooked, remove from heat and fluff with a fork. Use the fork to mix in 2 tbsp of chopped cilantro and 2 tbsp fresh lime juice. Season with salt to taste.",
    "Assemble your burrito bowls. Divide the cilantro lime quinoa between four bowls.",
    "Top each portion of quinoa with 1/4 cup of shredded lettuce.",
    "Top each portion of lettuce with simmered black beans.",
    "Top the black beans with your choice of Optional Topping Ingredients (ideas listed above). Serve warm."
  ],
  "ingredients": [
    "0",
    "1 cup quinoa",
    "1 tbsp olive oil",
    "1/4 cup onion minced",
    "1 clove garlic minced",
    "30 oz cooked black beans or 2 cans, drained and rinsed",
    "1/4 cup fresh cilantro chopped",
    "1/4 tsp chili powder mild",
    "Pinch cayenne pepper spicy",
    "1/4 cup fresh lime juice",
    "1 cup shredded lettuce",
    "Salt"
  ],
  "__v": 1
}