{
  "hash": "b85b1c2f71f245f0602b2f30cdc5053e822dc2ce",
  "title": "Homemade Vegan Mayonnaise",
  "image": "http://peanutbutterandvegan.com/wp-content/uploads/2015/04/IMG_7894-300x300.jpg",
  "href": "http://peanutbutterandvegan.com/april-all-natural-day-5/",
  "extension": "",
  "firstAdded": "2015-12-23T18:45:10.077000",
  "users": [
    null
  ],
  "keywords": [
    "apple",
    "cider",
    "vinegar",
    "mustard",
    "salt",
    "chickpeas",
    "room",
    "neutral",
    "tasting",
    "oil",
    "used",
    "grapeseed"
  ],
  "directions": [
    "0",
    "Directions:",
    "Using an immersion blender, in a small bowl (I actually did this in a small measuring cup like in the picture above, but a small bowl will allow you to mix it better once it starts to thicken up), combine the vinegar, ground mustard, salt, and chickpea liquid and mix for just a second so it’s all combined. With the immersion blender running, slowly drizzle in the oil 1/4 cup at a time. The mixture will start to become very thick and you will need to move the immersion blender around to get it all combined. Once the mixture is nice and thick (i.e. it doesn’t run/pour off the immersion blender when lifted out of the mixture), stop adding the oil. Try not to happy dance so much that you injure yourself. Not that I know from experience. Transfer the mayo to a jar and store in the fridge. The mayo will thicken up upon refrigeration. Use in place of mayonnaise in any recipe.",
    "Notes:",
    "This recipe is meant to taste just like traditional mayonnaise that is made with eggs, which it does. If you would like for it to taste more like the Follow Your Heart Veganaise, try adding only a teaspoon of vinegar and up to a teaspoon of maple syrup or other liquid sweetener in towards the end of blending."
  ],
  "ingredients": [
    "0",
    "1 Tablespoon apple cider vinegar",
    "1/2 teaspoon ground mustard",
    "1/2 teaspoon salt",
    "3 Tablespoons liquid from a can of chickpeas (at room temperature)",
    "3/4-1 Cup neutral tasting oil- I used grapeseed"
  ],
  "__v": 1
}