{
  "hash": "b17d93bfd8f454c3401cf7b575b69f6ad75fa9e1",
  "title": "TrueFood Kitchen Sweet Potato Hash Copycat Recipe",
  "image": "http://2.bp.blogspot.com/-qOVtEaS-LQ0/VA4LeJ8nYnI/AAAAAAAA8yE/gkFdR88E93M/s700/2014_09_04_CHOCOLATE-BARK_9999_50COPYCAT-TRUEFOOD-SWEET-POTATOES1111700.jpg",
  "href": "http://kblog.lunchboxbunch.com/2014/09/true-food-kitchen-sweet-potato-hash.html",
  "extension": "Chrome",
  "firstAdded": "2017-06-08T13:11:52.814000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Preheat the oven to 400 degrees.",
    "For the potato, wash and scrub skin very well to remove any grit. I scrape away about 1/4 of the skin, leaving a partially peeled potato. The skins should be mostly kept on because they make the hash nice and crispy, and they also add fiber and nutrients!",
    "In a large mixing bowl, toss the potatoes with the vegetable broth, oil and garlic.",
    "Pour the potato mixture in a glass baking dish and roast at 400 degrees until the potatoes are tender, but not mushy. Usually about 25-35 minutes.",
    "Warm a skillet over medium-high heat. Add 1/2 tsp of oil. Add the onions and saute for about five minutes to soften.",
    "Add the roasted potato mixture to the skillet, and toss the potatoes and garlic with the onions - add salt and pepper (to taste). Saute for at least ten minutes. You want the potatoes to brown and blacken and the onions to become crispy and very browned. The longer you saute the potatoes, the crispier they will become. Serve warm. (Note: YES, you could also just saute the ingredients if needed. About 20 minutes over medium-high heat. Then keep cooking on low until blackened to desired coloring.)"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 large sweet potato, diced (about 3 cups of cubes - leave skin on, or partially on)",
    "1 small sweet or white onion, diced",
    "2-3 garlic cloves, chopped",
    "1/2 cup vegetable broth",
    "2-3 tsp oil (I used virgin coconut oil, TrueFood uses grapeseed oil)",
    "salt and pepper to taste"
  ],
  "__v": 1
}