{
  "hash": "f5f6032347e748878697d0b4e56ae74215290e5f",
  "title": "Crispy Baked Sweet Potato Fries & Homemade BBQ Sauce {Paleo & Vegan}",
  "image": "http://i0.wp.com/www.paleorunningmomma.com/wp-content/uploads/2016/03/bbq-sauce-and-sweet-potato-fries.jpg?resize=700%2C1001",
  "href": "http://www.paleorunningmomma.com/homemade-bbq-sauce-paleo-vegan/",
  "extension": "Chrome",
  "firstAdded": "2016-03-13T17:42:48.614000",
  "users": [
    null
  ],
  "keywords": [
    "potato",
    "medium",
    "ones",
    "variety",
    "refined",
    "coconut",
    "oil",
    "salt",
    "black",
    "pepper",
    "organic",
    "tomato",
    "cuptart",
    "cherry",
    "juice",
    "blackstrap",
    "molasses",
    "raw",
    "apple",
    "cider",
    "vinegar",
    "smoke",
    "onion",
    "smoked",
    "paprika",
    "chipotle",
    "spice"
  ],
  "directions": [
    "0",
    "In a small saucepan, whisk together all ingredients and cook over medium heat on the stove until it begins to bubble. Allow to simmer for 10 minutes while stirring occasionally, then remove from heat and allow to cool.",
    "1",
    "Preheat your oven to 425 degrees and line two large baking sheets (preferably dark, not shiny) with parchment paper",
    "Peel your sweet potato (or potatoes) and cut them evenly into \"fry shape\" which for me is about ½ inch thickness.",
    "Put the cut sweet potatoes into a large bowl and toss with the 2 tbsp melted coconut oil to fully coat each fry on all sides** Then, sprinkle fine grain sea salt and pepper to tasted toss again to evenly coat the fries.",
    "Arrange the sweet potatoes on both baking sheets in a single layer giving each one as much space as possible. This will help them bake to their absolute crispiest! The further from one another they bake, the crispier the result.",
    "Bake in the preheated oven as close to the middle racks as possible (just not right at the top or bottom) for 25 minutes, turn over as many as you can, and continue to bake for about another 15 minutes, checking on them often to prevent burning.",
    "Once nicely browned on all sides, remove from oven and serve right away as a side dish, appetizer, or snack along with the BBQ sauce (or your favorite dip!)",
    "Enjoy!"
  ],
  "ingredients": [
    "0",
    "1 very large sweet potato or 2 medium ones {any variety}",
    "2 tbsp refined coconut oil, melted",
    "sea salt and black pepper to taste",
    "1",
    "6 oz organic tomato paste",
    "¾ cuptart cherry juice",
    "1 tbsp blackstrap molasses",
    "2 tbsp organic raw apple cider vinegar",
    "1 and ½ tsp* liquid smoke",
    "½ tsp onion powder",
    "½ tsp smoked paprika",
    "⅛-1/4 tsp chipotle pepper* (for optional spice)",
    "dash sea salt"
  ],
  "__v": 1
}