{
  "hash": "1900c6a7f42aa23521c2e9134460ac92e88d24b4",
  "title": "Almond Feta",
  "image": "http://www.diannesvegankitchen.com/wp-content/uploads/2015/06/almond-feta.jpg",
  "href": "https://www.diannesvegankitchen.com/2015/06/22/the-homemade-vegan-pantry-by-miyoko-schinner/",
  "extension": "Chrome",
  "firstAdded": "2017-08-14T19:09:51.734000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Drain and rinse the almonds. Place them in a high-speed blender with the rejuvelac and salt, and process on the highest setting for 1 to 2 minutes until smooth and no longer grainy to the tongue. Pour the mixture into a clean container and cover with a nonpermeable lid or plastic wrap. Leave on your kitchen counter for 1 to 2 days to culture, making sure you taste it each day, until it begins to get tangy. Keep in mind there is no hard and fast rule about how long it needs to culture—your taste buds will have to guide you in determining the right length of time. In warmer weather, it could be just a day, while in cooler weather, it could take 2 days or even longer.",
    "Once the cheese is slightly tangy, you can move onto solidifying it. First, prepare the mold for the cheese by lining an 8-inch square pan with cheesecloth. Combine the water and agar in a medium saucepan and whisk well. Cover the pan with a lid and bring to a simmer over low heat. Don’t peek for 3 to 4 minutes, then check to see if it is bubbling away. At first, if you peek too early, it may look as if it has solidified. However, if you let it simmer over low heat for a couple of minutes more, it will start to liquefy again and bubble away. When the agar is fully dissolved, pour in the cultured almond mixture and whisk immediately until fully combined. Pour the cheese mixture into the cheesecloth-lined pan. Refrigerate for several hours, until hard.",
    "Prepare the brine by whisking together the water and the salt in a large bowl until most of the salt is dissolved. Cut the cheese into four pieces and place in the brine. Cover and let sit for 8 hours at room temperature. Transfer the cheese to a storage container and pour the brine over the cheese until it is halfway submerged. Add more plain water to completely cover the cheese and dilute the brine. Store in the refrigerator for up to 3 or 4 months. The flavor vastly improves after the first 3 to 4 weeks."
  ],
  "ingredients": [
    "0",
    "2 cups blanched almonds, soaked in water for 12 to 24 hours",
    "1 cup rejuvelac or juice from sauerkraut",
    "½ teaspoon sea salt",
    "⅔ cup water",
    "2 tablespoons agar powder",
    "1",
    "6 cups water",
    "¾ cup sea salt or kosher salt"
  ],
  "__v": 1
}