{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 150C (302F).",
    "1)Use a large bowl, pour in yogurt,butter and cream cheese. Place the bowl over simmering water,stir occasionally, until completely dissolved and the mixture turns smooth. Remove from heat. Let cool down a bit, then add the egg yolks and combine well. (Note: Make sure the mixture is not too hot, as you don’t want to cook the egg yolks at this stage.)",
    "2)Combine cake flour and corn flour place over the simmering water. Sift in the flours into the cream cheese mixture, a small amount at a time. Mix well between every addition, and make sure there aren’t any flour lumps. Set aside.",
    "3)Place egg whites in a large clean bowl. (Note: Make sure there’s no oil or water in the bowl at all.) Use an electric mixer to beat the egg whites for 3 minutes, then add lemon juice or vinegar and blend again. Pour sugar in the egg whites and blend until very stiff peaks form.",
    "Fold-in the egg whites into the cream cheese mixture gently with a rubber spatula just until all ingredients are incorporated. Do not stir or beat.",
    "4)Pour the mixture into the 6inch baking pans. Place the pans into another larger baking tray. Add hot water in the tray up to half way. Bake for about 60 minutes. Test with a needle or skewer that comes out clean.",
    "Turn off the oven. Remove from the oven and remove from the pans. Let cool completely on a wire rack. Chill in a fridge for about 4 hours. Enjoy!"
  ],
  "firstAdded": "2014-09-12T08:50:23.644000",
  "hash": "c538c6da99ce7b93ae438671d11425025a00980f",
  "href": "https://m.facebook.com/212144668994619/photos/pb.212144668994619.-2207520000.1410262048./247056258836793/?type=1&source=42&ref=bookmark",
  "image": "",
  "ingredients": [
    "0",
    "80g honey yogurt(70g yogurt add 10g honey mixed well)",
    "100gm cream cheese, cubed",
    "48gm butter, softened at room temperature",
    "2 egg yolks",
    "24gm cake flour",
    "8 gm corn flour",
    "1/4 teaspoon lemon juice or vinegar",
    "2 egg whites",
    "35gm caster sugar"
  ],
  "keywords": [
    "yogurtg",
    "yogurt",
    "honey",
    "mixed",
    "cream",
    "cheese",
    "cubed",
    "butter",
    "softened",
    "room",
    "egg",
    "yolks",
    "cake",
    "flour",
    "corn",
    "lemon",
    "juice",
    "vinegar",
    "whites",
    "caster",
    "sugar"
  ],
  "title": "Honey yogurt light cheese cake",
  "users": [
    null
  ]
}