{
  "hash": "e2025af86d19fbbcd57b4f3cfff4cd3154fbf21f",
  "title": "Creamy Vegan Broccoli Soup",
  "image": "",
  "href": "http://www.ilovevegan.com/creamy-vegan-broccoli-soup/",
  "extension": "Chrome",
  "firstAdded": "2016-10-20T04:13:46.876000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium saucepan, heat olive oil over medium heat. Add the broccoli, carrot, celery, onion, and garlic. Sprinkle with ¼ tsp salt. Sauté until onion is translucent and just tender.",
    "Sprinkle vegetables with 3 tbsp flour. Stir and cook for at least 1 minute. Whisk in the vegetable broth. The soup should thicken as you stir. Whisk in the unsweetened macadamia milk, the coconut milk, and the nutritional yeast. Simmer over medium-low for at least 10 minutes, or until the vegetables are tender. Purée the soup to your liking. If you prefer a chunkier soup, lightly blend on a slow speed. I prefer to blend ½ to ⅔ of the soup until smooth and mix it with the remaining chunkier soup.",
    "1",
    "In a small, separate saucepan, heat olive oil over medium heat. Add the broccoli florets and sprinkle with salt. Sauté until just nearly tender. Turn the heat up to high and continue to cook, stirring sporadically, until the broccoli has a nice brown/black edge on at least 1 side. Remove from heat and set aside.",
    "2",
    "Ladle soup into bowls. Drizzle with a little bit of olive oil, top with browned broccoli florets, vegan cheese shreds (optional), and cracked black pepper. Serve with bread or buns, crackers, or sandwiches. Enjoy!"
  ],
  "ingredients": [
    "0",
    "2 tbsp extra-virgin olive oil (any neutral oil or vegan margarine will do)",
    "2½ cups broccoli, chopped",
    "⅓ cup carrots, finely chopped",
    "⅓ cup celery, finely chopped",
    "⅓ cup onion, finely chopped",
    "1 clove garlic, minced",
    "¼ tsp salt",
    "3 tbsp flour",
    "1¼-1½ cup vegetable broth",
    "1 cup Suncoast Gold Unsweetened Macadamia Delight (or other unsweetened plant milk)",
    "¼ cup coconut milk",
    "2 tbsp nutritional yeast",
    "1",
    "⅔ cup broccoli florets",
    "2 tsp olive oil",
    "salt, to taste"
  ],
  "__v": 1
}