{
  "hash": "9cff1eeef60f2d469f93aabed396f6728bac8b1b",
  "title": "Costillas con vermut rojo y arroz blanco",
  "image": "http://estaticos.fimagenes.com/imagenesred/10653093.jpg",
  "href": "http://cocina.facilisimo.com/blogs/general/costillas-con-vermut-rojo-y-arroz-blanco_1534804.html",
  "extension": "Chrome",
  "firstAdded": "2015-05-06T10:53:55.285000",
  "users": [
    null
  ],
  "keywords": [
    "ngredientes",
    "pers",
    "cerdo",
    "costillas",
    "cortadas",
    "por",
    "mitad",
    "vaso",
    "vermut",
    "rojo",
    "tazas",
    "pequeas",
    "arroz",
    "bomba",
    "dientes",
    "ajo",
    "aceite",
    "oliva",
    "virgen",
    "extra",
    "sal",
    "caldo",
    "carne",
    "podis",
    "aadir",
    "poco",
    "miel",
    "pero",
    "necesario",
    "esta",
    "receta",
    "puse"
  ],
  "directions": [
    "0",
    "Preparación",
    "Calentamos bien una cazuela de base ancha pero no muy alta, cuando ya esté caliente ponemos un poco de aceite y añadimos las costillas, sellándolas por los dos lados pero sin terminar de hacerlas por dentro.",
    "Una vez selladas las costillas les añadimos un poco de sal y aproximadamente una tercera parte del vermut, manteniendo el fuego vivo pero sin que se abrasen, solo para levantar todo el sabor del fondo de la cazuela y que se evapore el alcohol. No te asustes por el color tan oscuro, eso si, tienen que estar rosadas y jugosas por dentro.",
    "Una vez evaporado, le añadimos el resto del Martini y bajamos a fuego medio para que las costillas vayan tomando el sabor de las hierbas aromáticas con las que se hace este vino, tapar la cazuela unos 5 minutos para que se hagan por dentro y luego destapar y dejar que se vayan caramelizando las costillas con el vermut y así vaya tomado color y textura la salsa.",
    "Bueno, si somos capaces de hacer dos cosas a la vez... algo que en estos tiempos todos practicamos bastante a menudo, vamos a hacer el arroz blanco al mismo tiempo que las costillas y si no te quieres complicar empecemos a hacerlo ahora... dejamos las costillas cerca del calor y este arroz se hace muy rápido, unos 13 minutos.",
    "En una cazuela llana o una sartén, ponemos un poco de aceite, sofreímos los dientes de ajo y las dos tazas de arroz, añadimos el caldo de carne muy caliente. Si no tenemos caldo de carne se puedes usar concentrado de caldo diluido en cuatros tazas de agua, añadimos un poco de sal y lo agregamos bien caliente al arroz.",
    "Hervimos a fuego fuerte los primeros siete minutos y luego tapamos el recipiente y dejamos a fuego medio hasta que veamos que está seco.",
    "Calentamos un poco las costillas mientras dejamos reposar unos minutos el arroz y servimos...",
    "Si quieres puedes poner las costillas a macerar en el vermut la noche anterior en la nevera y si te gusta que piquen un poco añádele una cayena sin semillas en el liquido de maceración."
  ],
  "ingredients": [
    "0",
    "ngredientes (2 pers.)",
    "Costillas de cerdo (3 costillas cortadas por la mitad)",
    "1 vaso de vermut rojo",
    "2 tazas pequeñas de arroz bomba",
    "3 dientes de ajo",
    "Aceite de oliva virgen extra",
    "Sal",
    "4 tazas de caldo de carne",
    "Podéis añadir un poco de miel, pero no es necesario, en esta receta no le puse"
  ],
  "__v": 1
}