{
  "hash": "5e2a2016500dc49dc6d3b0d304b16ae87c987b5c",
  "title": "Steak & kidney pudding",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/1012_1_1436890130_lrg.jpg",
  "href": "http://www.jamieoliver.com/recipes/beef-recipes/steak-and-kidney-pudding/",
  "extension": "Firefox",
  "firstAdded": "2015-09-16T01:02:43.705000",
  "users": [
    null
  ],
  "keywords": [
    "filling",
    "rashers",
    "quality",
    "smoked",
    "streaky",
    "bacon",
    "roughly",
    "olive",
    "oil",
    "nutmeg",
    "grating",
    "heaped",
    "allspice",
    "bay",
    "leaves",
    "sprigs",
    "rosemary",
    "onions",
    "marmalade",
    "plain",
    "flour",
    "worcestershire",
    "organic",
    "beef",
    "stock",
    "tomato",
    "chuck",
    "steak",
    "dice",
    "butter",
    "greasing",
    "kidneys",
    "pork",
    "lamb",
    "trimmed",
    "carrots",
    "button",
    "mushrooms",
    "wiped",
    "clean",
    "salt",
    "pepper",
    "cheddar",
    "stilton",
    "cheese",
    "pastry",
    "selfraising",
    "unsalted",
    "atora",
    "suet"
  ],
  "directions": [
    "0",
    "Put a large casserole-type pan on a high heat and add the bacon and a lug of olive oil. When lightly golden, add the nutmeg, allspice, bay, rosemary sprigs and chopped onions, turn the heat to medium and cook for 10 minutes, stirring often. As the onions soften, add the marmalade, plain flour and Worcestershire sauce. Fry and stir until it is quite dark, then add your stock, tomato purée and diced steak. Simmer for 1 hour with the lid on.",
    "Put the self-raising flour, butter, suet and a couple of pinches of salt into a bowl and use your fingers to rub the fat into the flour. Once the mixture resembles breadcrumbs, add roughly 100ml of cold water to bring it together until you have a soft dough. Cover with clingfilm and place in the fridge. When the stew has had an hour, pour it into a large colander over another large pan, so the gravy drips into the pan below. Discard the herb sprigs. Tear off a large sheet of greaseproof paper and rub both sides with butter, then push and flatten it inside a 1.5 litre pudding bowl.",
    "Dust a clean surface with flour and roll out 80% of your dough so it's about 0.5cm thick. Loosely drape it over the rolling pin, then unroll it over the pudding basin. Push and pat it in, letting a couple of centimetres hang over the edge. Gently mix the diced kidneys, carrots and mushrooms into the stew that's in the colander, season with salt and pepper, crumble in the cheese, then pour that dense stew into your pudding basin – don't worry if it doesn't quite fill it. Put the pan of gravy aside. Roll out the last bit of dough, put it on top of the filling, fold over the overhanging pastry to seal and pack it down, then put a sheet of buttered greaseproof face down on top, followed by a piece of tin foil. Get 2 metres of string, wrap it round the rim of the bowl twice, tie it in a double knot twice, then attach the other end to the opposite side with a double knot to make a handle – this will make pulling the bowl out at the end much easier. Go to www.jamieoliver.com/how-to for a quick tutorial on this if you like. Put the pudding into a large pan that the pudding basin will fit inside with the lid on, then half fill it with water. Put the lid on, boil, then simmer with the lid on for 3 hours. Set a timer, and top up with water every now and then.",
    "When ready, carefully pull out the basin, cut away and discard the string, greaseproof paper and foil, and place a nice serving platter on top. Carefully and confidently turn over and leave upturned while you warm up the reserved gravy and get any veggies ready. When you're ready to serve, carefully ease the basin off, peel away the paper and pour over a little of the hot gravy. Take to the table with your seasonal veg."
  ],
  "ingredients": [
    "0",
    "For the filling:",
    "2 rashers of quality smoked streaky bacon, roughly chopped",
    "olive oil",
    "½ a whole nutmeg, for grating",
    "1 heaped teaspoon ground allspice",
    "4 fresh bay leaves",
    "4 sprigs of fresh rosemary",
    "2 onions, peeled and roughly chopped",
    "1 tablespoon marmalade",
    "2 tablespoons plain flour",
    "4 tablespoons Worcestershire sauce",
    "750 ml organic beef stock",
    "2 tablespoons tomato purée",
    "500 g chuck steak, cut into 2.5cm dice",
    "a little butter, for greasing",
    "250 g kidneys, pork or lamb, halved, trimmed and cut into 1cm dice",
    "2 carrots",
    "6 button mushrooms, wiped clean and quartered",
    "sea salt",
    "freshly ground pepper",
    "50 g Cheddar or Stilton cheese",
    "For the pastry:",
    "350 g self-raising flour",
    "75 g unsalted butter",
    "100 g Atora shredded suet",
    "sea salt"
  ],
  "__v": 1
}