{
  "hash": "9062b7965c464618ab44baf4c95d94b28e68d357",
  "title": "Smoked Salmon – How To Smoke Salmon",
  "image": "https://whatscookingamerica.net/wp-content/uploads/2015/06/SmokedSalmonFinish.jpg",
  "href": "https://whatscookingamerica.net/SmokeSalmon.htm",
  "extension": "Chrome",
  "firstAdded": "2018-11-30T20:28:37.649000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Brine Formula: 2 1/2 tablespoons plain salt (without iodine) to 1 quart (4 cups) water.",
    "I am using approximately 5 quarts of total water. Sometimes I use more. Just figure salt for the 5 quarts (even if you use more water). 5 quarts water x 2.5 tablespoons salt = 12.5 tablespoons of salt. So - I am using approximately 3/4 cup of salt total.",
    "Step 1 - Dissolving the Salt: Using approximately 1 quart of water; heat water to just lukewarm. Add 3/4 cup salt (according to formula above) to the lukewarm water; stir until dissolved.",
    "Step 2 - Making the Brine: Add the warm salt water to approximately 4 quarts of additional cold water (I use my sink as a bowl for this step).",
    "Rinse the salmon steaks in cold water. Place salmon, skin side down, in brine at for 20 minutes (make sure the fish is entirely covered by the brine).",
    "After 20 minutes, gently remove salmon from brine and lightly rinse both sides with cold water to remove all traces of salt. Gently pat dry with paper towels.",
    "Let salmon air dry on wire racks for at least 2 hours (this causes a \"pellicle\" - a tacky glaze on the fish to form. This indicates that it is ready for the smoking process).",
    "Prepare your smoker according to manufacturer's directions:",
    "I have an Electric Smoker (see photo on the right), and I like to use either alder or cherry wood (but any hard wood will work just fine). Smoking temperature of your smoker should be between 200 to 225 degrees F. (no higher).",
    "The easiest way to help keep the temperature low, is to almost close down the vents. Keep the top vents wide open, and use the bottom vents to adjust the temperature.",
    "If you have a smoker that does not have any vents, cock the lid of the smoker so there will be a small gap (keep the gap small enough to maintain the correct smoker temperature, while large enough to allow adequate airflow).",
    "Do not open or raise the lid of the smoker any more than you absolutely need to (it reduces the temperature inside every time you do). Monitor your temperature of your smoker during the smoke time.",
    "Smoking the Salmon:",
    "Place salmon fillets (skin side down) on sheets of aluminum foil and cut the foil around the fillets approximately 1/4-inch bigger (this keeps the fillets from sticking to the racks in the smoker). I also spray the racks with vegetable oil spray (makes for easier cleaning).",
    "Grate the zest from the limes then squeeze the juice. In a small bowl, combine lime zest, lime juice, thyme (or other herbs), pepper, salt and olive oil; stir to mix. Rub the seasoning mix on the salmon fillets; coating them well.",
    "Place salmon fillets (with the aluminum foil) on the oiled smoker rack. Smoke until a meat thermometer registers an internal temperature of 140 degrees F. in thickest part of salmon (salmon will be slightly opaque in thickest part).",
    "Avoid Over Cooking Smoked Salmon! Remember the salmon continues to cook after it is removed from the smoker (You don't want an overcooked and dried out salmon. I prefer a moist salmon and not dried out.)",
    "The biggest mistake most people make in cooking salmon is to over cook it. Resist the temptation to over cook your salmon until it \"flakes.\" Flaking indicates the salmon is becoming dry and overcooked. If you do not have a good cooking or meat thermometer, please purchase one and use it for cooking all your meats and fish! You will not be sorry!",
    "This is the type of cooking and meat thermometer that I prefer and use in my cooking. I get many readers asking what cooking/meat thermometer that I prefer and use in my cooking and baking. I, personally, use the Thermapen Thermometer shown in the photo on the right. To learn more about this excellent thermometer and to also purchase one (if you desire), just click on the underlined: Thermapen Thermometer.",
    "Remove salmon fillets from smoker.",
    "Cut extra limes in half and squeeze the juice over the cooked salmon fillets. Sprinkle lightly with more coarse salt. Serve salmon either warm, cool, or chilled (refrigerate until ready to serve). If making ahead, cover airtight and refrigerate up to 3 days. I also freeze the smoked salmon fillets. Just freeze in air-tight bags."
  ],
  "ingredients": [
    "0",
    "2 large salmon fillets",
    "Zest and juice of 2 to 3 fresh limes",
    "1 tablespoon chopped fresh thyme leaves*",
    "1 teaspoon coarsely-ground black pepper",
    "1 teaspoon coarse or sea salt",
    "1 to 2 tablespoons extra-virgin olive oil (depending on size of fillets)",
    "Juice of 1 lime for finish",
    "Coarse salt, sea salt, or Fleur de Sel Salt",
    "Brine Recipe (see recipe below)",
    "* I use whatever fresh herbs that I have at the moment. I have also used lavender and it was great!"
  ],
  "__v": 1
}