{
  "hash": "237c78b382b2f86f111bcd7161f8c4364afe782f",
  "title": "Spaghetti Squash Pasta with Chunky Tomato Sauce",
  "image": "https://nu.spoonuniversity.com/wp-content/uploads/sites/2/2012/10/SquashFinal.jpg",
  "href": "https://nu.spoonuniversity.com/recipe/spaghetti-squash-pasta-with-chunky-tomato-sauce/",
  "extension": "Chrome",
  "firstAdded": "2016-02-24T18:40:01.772000",
  "users": [
    null
  ],
  "keywords": [
    "spaghetti",
    "squash",
    "cherry",
    "tomatoes",
    "garlic",
    "parsley",
    "olive",
    "oil",
    "drizzling",
    "salt",
    "pepper",
    "shaved",
    "parmigiano",
    "pecorino",
    "romano",
    "cheese",
    "encouraged"
  ],
  "directions": [
    "0",
    "Preheat oven to 400°F.",
    "Poke spaghetti squash all over with a fork to allow steam to escape. Place whole spaghetti squash onto baking sheet and bake for 60 minutes, or until flesh is easily pierced with a knife.",
    "Photo by Julia Maguire",
    "3. Heat 1 tablespoon of olive oil in sauté pan and add tomatoes and 1/2 teaspoon of salt. Cook over medium-low heat until tomatoes begin to give off liquid, about 5 minutes.",
    "4. Add chopped garlic, parsley and a quarter cup of water. Cook covered for an additional 5 minutes.",
    "5. When cool enough to handle, cut spaghetti squash in half lengthwise and scoop out seeds and fibrous strings.",
    "6. Drizzle both halves with olive oil and sprinkle with salt. Place both halves flesh side down onto baking sheet and bake for 15 more minutes.",
    "7. Take squash out of oven and, with a fork, scrape the flesh into long “spaghetti” strands.",
    "Photo by Julia Maguire",
    "8. Place “spaghetti” into a bowl and toss with olive oil, salt, and pepper",
    "Photo by Julia Maguire",
    "9. Place spaghetti squash onto plate and top with tomato sauce and shaved cheese."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "1 spaghetti squash",
    "1 pint cherry tomatoes, halved",
    "3 cloves chopped garlic",
    "1/4 cup chopped parsley",
    "3 tablespoons olive oil, plus more for drizzling",
    "Salt",
    "Pepper",
    "Shaved Parmigiano or Pecorino Romano Cheese (optional, but encouraged"
  ],
  "__v": 1
}