{
  "hash": "68631c9e0ff52cd23ed3f745e44c714a316b4aaf",
  "title": "Pappardelle With Chicken Ragù, Fennel, And Peas",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/pappardelle-with-chicken-ragu-fennel-and-peas",
  "extension": "Chrome",
  "firstAdded": "2017-03-29T14:51:57.387000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparation",
    "Heat oil in a wide large saucepan or a Dutch oven over medium. Cook bacon, stirring often, until browned and crisp, about 5 minutes. Transfer to a small bowl with a slotted spoon.",
    "Increase heat to medium-high. Season chicken all over with salt, then set in pan, skin side down. Cook, turning halfway through, until golden brown on both sides, about 6 minutes total. Transfer to a plate.",
    "Pour off all but 2 Tbsp. fat from pan. Add onions and chopped fennel and cook, stirring occasionally, until soft and golden, 6–8 minutes. Add thyme and cook until fragrant, about 30 seconds. Pour in wine and simmer, stirring and scraping up brown bits, until reduced by half, about 5 minutes. Return bacon and chicken to pan (chicken should fit snugly in a single layer); pour in water to barely cover chicken. Bring to a simmer. Reduce heat to medium-low and set lid askew. Cook until chicken is tender, 45–60 minutes.",
    "Transfer chicken to a clean plate; let cool. Finely shred chicken meat; discard bones and skin.",
    "Add milk to pan and set over medium-high. Cook, stirring occasionally to prevent sticking, until sauce is nearly reduced by half and slightly thickened, 8–12 minutes.",
    "Mix peas and chicken into sauce and cook until peas are just tender, about 4 minutes for fresh peas and 2 minutes for frozen. Season ragù with salt and plenty of pepper. Keep warm while you cook the pasta.",
    "Cook pasta in a large pot of salted boiling water, stirring occasionally, until very al dente. Drain, reserving 1 cup pasta cooking liquid.",
    "Add pasta, butter, ½ cup grated Parmesan, and ½ cup pasta water to ragù and mix to coat pasta with sauce. Increase heat to medium (sauce should be bubbling just a little) and continue cooking, stirring and adding more cooking liquid as needed if sauce is too thick, until butter and cheese are melted and incorporated into ragù and pasta is well coated in sauce. Add parsley and toss to evenly distribute through pasta.",
    "Divide pasta among bowls. Top with fennel fronds and shaved Parmesan.",
    "Do Ahead: Ragù can be made 2 days ahead. Let cool; cover and chill. Reheat gently before using."
  ],
  "ingredients": [
    "0",
    "Pappardelle With Chicken Ragù, Fennel, And Peas",
    "You’ll still get that velvety consistency from this lighter ragù, but this recipe won’t take you all day to make.",
    "Ingredients",
    "4 SERVINGS",
    "2 tablespoons olive oil",
    "6 ounces bacon, thinly sliced",
    "1½ pounds skin-on, bone-in chicken thighs (about 6 total)",
    "Kosher salt",
    "2 medium onions, finely chopped",
    "1 fennel bulb, finely chopped, plus ¼ cup coarsely chopped fronds",
    "6 sprigs thyme",
    "½ cup dry white wine",
    "½ cup whole milk",
    "1 cup shelled fresh peas (from about 1 pound pods) or frozen peas, thawed",
    "Freshly ground black pepper",
    "12 ounces fresh (or dried) pappardelle",
    "2 tablespoons unsalted butter, cut into pieces",
    "½ cup finely grated Parmesan, plus shaved for serving",
    "2 tablespoons finely chopped parsley"
  ],
  "__v": 1
}