{
  "hash": "7610e3580d43c3cc93488cf41a06d768f4bd196a",
  "title": "Beet Tzatziki",
  "image": "http://fiveandspice.com/wp-content/uploads/2011/07/beet_tzatziki_close.jpg",
  "href": "http://fiveandspice.com/2011/08/06/beet-tzatziki/",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T22:24:51.204000",
  "users": [
    null
  ],
  "keywords": [
    "beet",
    "tzatziki",
    "makes",
    "couple",
    "color",
    "works",
    "red",
    "beets",
    "exciting",
    "colored",
    "stems",
    "clove",
    "garlic",
    "greekstyle",
    "definitely",
    "recommend",
    "using",
    "wholemilk",
    "yogurt",
    "nonfat",
    "tbs",
    "lemon",
    "juice",
    "dill",
    "salt",
    "pepper"
  ],
  "directions": [
    "0",
    "I’ve only made it three times in the past month? That’s definitely not enough yet!",
    "Beet Tzatziki (makes a couple of cups)",
    "About 1 lb. of beets (any color works, though red beets give you the most exciting colored tzatziki), stems removed",
    "1 clove of garlic, finely minced",
    "1 – 1 1/2 cup of thick Greek-style yogurt (I’d definitely recommend using whole-milk or 2% yogurt over a non-fat version)",
    "1 Tbs. fresh lemon juice",
    "3-4 Tbs. finely chopped dill",
    "salt and pepper to taste",
    "To prepare the beets by roasting: wrap the whole, unpeeled beets tightly in aluminum foil. Roast them in a 425F oven until they are tender when pierced by a knife (this takes 50-60 minutes, usually, though it all depends on the size of your beets). Remove from the oven and allow them to cool, still wrapped in the aluminum.",
    "To prepare the beets by boiling: put the whole, unpeeled beets in a pot and add enough water to just cover them. Cover the pot and bring it to a boil. Turn it down to a simmer, and cook the beets, covered, until tender, about 30 minutes. Drain, and allow to cool.",
    "Take your cooled beets and use your fingers to slip the peels off of them. If they’re fully cooked, the skin should come off quite easily. If you need to, you can use a butter knife to help you gently scrape the skin off.",
    "Chop off the tops and tips of the beets. Then, use the coarsest side of a box grater and grate the beets into a mixing bowl.",
    "Stir in the garlic, yogurt, lemon juice, and dill. Add salt and pepper to taste. Then, refrigerate until you are ready to use it. Use as a dip, spread, sauce, salad, or whatever else you come up with"
  ],
  "ingredients": [
    "0",
    "Beet Tzatziki (makes a couple of cups)",
    "About 1 lb. of beets (any color works, though red beets give you the most exciting colored tzatziki), stems removed",
    "1 clove of garlic, finely minced",
    "1 – 1 1/2 cup of thick Greek-style yogurt (I’d definitely recommend using whole-milk or 2% yogurt over a non-fat version)",
    "1 Tbs. fresh lemon juice",
    "3-4 Tbs. finely chopped dill",
    "salt and pepper to taste"
  ],
  "__v": 1
}