{
  "hash": "7e36110277bbc6ab5ebf749989eab1a005f15eaa",
  "title": "Oma's Chicken Paprikash",
  "image": "https://images.food52.com/FQid4Z6Yfs_wSbUvTBxdul9vQLg=/753x502/9f5f4c54-689d-4f1b-9b50-69575948caad--2014-0114_CP_paprikash-011.jpg",
  "href": "https://food52.com/recipes/25371-oma-s-chicken-paprikash",
  "extension": "Chrome",
  "firstAdded": "2018-01-05T13:04:41.775000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large pot or Dutch oven, heat oil, and add onion. Cook, stirring occasionally, until almost translucent. Add paprika -- it will seem like a lot, but trust me, the more the better -- and stir to combine. Heat through for several more minutes -- adding the paprika at the beginning of the cooking process intensifies the smoky-sweet, robust flavor -- and cook until the onions are cooked through, stirring almost continuously.",
    "Add chicken and stir to coat with paprika, let it brown slightly, and add 2 cups of water. Bring to a boil, then turn heat down and simmer for 45 minutes to an hour. Add more water if needed.",
    "Meanwhile, make the dumplings. Combine all dumpling ingredients in the bowl of your stand mixer. Mix with bread hook until combined -- the dough will be thick and sticky. In a pot of boiling, salted water, drop in 5 tablespoon-sized dollops at a time, and cook for 1 to 2 minutes, until cooked through. The dumplings should be slippery on the outside, and bready on the inside. Set aside a bowl-full for the next day's breakfast, and refrigerate it overnight.",
    "Before serving, add the remaining dumplings to paprikash.",
    "In a small bowl, whisk together sour cream, a spoonful of flour, and a splash of water, and stir into the paprikash. Add salt and pepper to taste. Give the chicken a rough shred with your fork, and serve in a bowl, as you would a stew.",
    "The next morning, slice the dumplings you set aside, and heat with a healthy-sized pat of butter. Top with a good shower of cinnamon and sugar."
  ],
  "ingredients": [
    "0",
    "2 tablespoons vegetable oil",
    "1 large onion, diced",
    "4 heaping tablespoons sweet Hungarian paprika",
    "2 chicken breasts, quartered (or 4 bone-in thighs)",
    "2 cups water",
    "1/2 cup sour cream",
    "1 spoonful flour",
    "Salt and pepper",
    "1",
    "3 eggs",
    "1 teaspoon vegetable oil",
    "3/4 cup water",
    "3 cups flour"
  ],
  "__v": 1
}