{
  "hash": "e0f58650cb53ecea8a86970db3ea3e2e0b22a3b4",
  "title": "Stuffed Winter Squash",
  "image": "http://www.splendidtable.org/sites/default/files/styles/lede_image/public/Winter-squash-image.jpg?itok=6G-yA39P",
  "href": "http://www.splendidtable.org/recipes/stuffed-winter-squash",
  "extension": "",
  "firstAdded": "2015-11-10T22:33:03.560000",
  "users": [
    null
  ],
  "keywords": [
    "acorn",
    "delicata",
    "dumpling",
    "carnival",
    "squash",
    "stem",
    "seeded",
    "olive",
    "oil",
    "rubbing",
    "oiling",
    "dish",
    "kosher",
    "salt",
    "chorizo",
    "sausage",
    "crumbled",
    "pieces",
    "leeks",
    "leek",
    "apple",
    "apples",
    "pepper",
    "tender",
    "greens",
    "spinach",
    "tatsoi",
    "kale",
    "swiss",
    "chard",
    "ribbons",
    "sage",
    "leaves",
    "coarsely",
    "millet",
    "rice",
    "quinoa",
    "cheddar",
    "cheese"
  ],
  "directions": [
    "0",
    ". Preheat the oven to 375° F. Rub the flesh of each squash half with olive oil, and oil an ovenproof dish or baking sheet. Sprinkle the whole baking dish with 1/2 teaspoon of the salt. Lay the squash flesh side down in the dish and bake until it is very tender when pricked with a fork, 30 to 40 minutes. Remove the squash from the oven and raise the oven temperature to 425°F.",
    "Meanwhile, heat the remaining olive oil in a large skillet over medium heat. Add the chorizo and fry until browned. Remove from the pan and set aside. Add the leeks to the hot oil and cook until soft, about 3 minutes. Add the apple, remaining 1/4 teaspoon salt, and pepper, and cook for another minute. Add the greens, sage, cooked grains, and reserved chorizo. Cook for another minute, stirring to combine, and remove from heat. Taste, and adjust the salt and pepper if needed.",
    "Turn the cooked squash over in the baking dish so it is flesh side up. (Be careful, as steam will escape when you turn it.) Scoop the filling into the cavity of each squash half, piling it into a mountain so that it holds as much as possible. Sprinkle with cheese and bake until the cheese melts, about 10 minutes.",
    "Variations",
    "Chopped fried bacon is a great substitute for the chorizo.",
    "Crumbled corn bread is a delicious substitute for the grain. When you make corn bread and have a few pieces left over, just crumble them into a container and freeze them for your next batch of stuffed winter squash.",
    "If you don’t have leeks, substitute a medium red onion.",
    "If you don’t have Cheddar, substitute Parmesan or other sharp cheese.",
    "From The Homemade Kitchen by Alana Chernila, Clarkson Potter 2015."
  ],
  "ingredients": [
    "0",
    "2 acorn, delicata, dumpling, or carnival squash, cut in half through the stem and seeded",
    "2 teaspoons olive oil, plus more for rubbing the squash and oiling the dish",
    "3/4 teaspoon kosher salt",
    "6 ounces chorizo or sweet sausage, crumbled or cut into small pieces",
    "1 cup chopped leeks (1 small leek)",
    "1 cup chopped apple (1 to 2 apples)",
    "Freshly ground pepper",
    "2 cups sliced tender greens (spinach, tatsoi, kale, Swiss chard), cut into ribbons",
    "4 fresh sage leaves, coarsely chopped",
    "2 cups cooked millet, rice, or quinoa",
    "1/2 cup grated Cheddar cheese"
  ],
  "__v": 1
}