{
  "hash": "44aa6b9be782d7b7e1cd4f4d1e4917d65698942b",
  "title": "souper creamy golden rice with spiced chickpeas",
  "image": "https://www.halfbakedharvest.com/wp-content/uploads/2020/02/Creamy-Golden-Rice-with-Spiced-Chickpeas-1-224x224.jpg",
  "href": "https://www.halfbakedharvest.com/golden-rice/",
  "extension": "Chrome",
  "firstAdded": "2020-02-18T18:46:49.046000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "1. To make the rice. Melt the butter, turmeric, and crushed red pepper flakes in a medium pot over high heat. Add the rice and toss to coat. Stir in 1 1/2 cups of broth, the coconut milk, and a pinch of salt and bring to a boil. Add the greens on top of the rice, but do not stir. Place the lid on the pot and turn the heat down to the lowest setting possible. Allow the rice to cook ten minutes on low and then turn the heat off completely. Let the rice sit, covered, for another 10 minutes.",
    "2. Meanwhile, make the chickpeas. Heat a large, high sided skillet over medium heat. Add the oil, chickpeas, garlic, shallots, ginger, and a pinch of red pepper flakes and salt. Cook, stirring occasionally until the chickpeas are crisped all over, about 8-10 minutes. Add the coconut flakes and sesame seeds, tossing to combine. Cook 2 minutes, until toasted, remove from the heat.",
    "3. When the rice is cooked, switch the heat onto low, add additional broth 1/2 cup at a time until the rice is creamy, but with just a touch of liquid. Taste, adding salt as needed.",
    "4. To serve, divide the rice among bowls and spoon the chickpeas overtop. Serve with naan, yogurt, and fresh mint or cilantro. Enjoy!"
  ],
  "ingredients": [
    "0",
    "4 tablespoons salted butter (using vegan butter or olive oil, if desired)",
    "1 teaspoon ground turmeric",
    "1 pinch crushed red pepper flakes",
    "1 1/2 cups long grain rice, such as jasmine or basmati",
    "1 (14 ounce) can full fat coconut milk",
    "2-2 1/2 cups low sodium vegetable or chicken broth",
    "1 teaspoon kosher salt, plus more as needed",
    "2 cups roughly torn greens such, as kale, chard, or spinach",
    "1/4 cup extra virgin olive oil",
    "1 (16 ounce) can chickpeas, drained and patted dry",
    "2-4 cloves garlic, thinly sliced or smashed",
    "2 shallots, thinly sliced",
    "1/2 teaspoon ground ginger",
    "1/2 cup unsweetened flaked coconut",
    "2 tablespoons raw sesame seeds",
    "1/2 cup fresh mint or cilantro",
    "toasted naan, Greek yogurt, and red harissa sauce, for serving"
  ],
  "__v": 1
}