{
  "hash": "35e58f66421633e3f61f4738cb0a29d9641374db",
  "title": "Sautéed Greens with Pine Nuts and Raisins",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2010/12/sauteed-greens-pine-nuts-vertical-a-1200.jpg",
  "href": "https://www.simplyrecipes.com/recipes/sauteed_greens_with_pine_nuts_and_raisins/",
  "extension": "",
  "firstAdded": "2018-01-28T19:06:11.937000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Toast the pine nuts: Heat a large sauté pan hot on medium-high heat and add the pine nuts. Toast them until they are fragrant and begin to brown. Pay attention as pine nuts burn easily. Stir or toss the nuts frequently. Once they are toasted, remove from pan and set aside.",
    "2 Sauté garlic in olive oil: Add the olive oil to the pan and swirl it around. Add the garlic and sauté for 30 seconds; the pan should already be hot, so it won't take long for the garlic to begin to brown.",
    "3 Wilt the greens: Add the greens and mix well. Sauté, stirring often, until the greens wilt and begin to give up some of their water, anywhere from 1-2 minutes for spinach to 4-5 minutes for collards or kale.",
    "4 Add the nuts, raisins, salt, and red pepper flakes: Stir in the nuts and raisins, and sprinkle with salt and red pepper flakes.",
    "5 Add the white wine: Use a little more wine if you are cooking collards, and less if you are cooking spinach. Toss to combine and let the liquid boil away. Once the liquid boils off, remove from heat. Add salt and pepper to taste."
  ],
  "ingredients": [
    "0",
    "1/4 cup pine nuts",
    "2 Tbsp olive oil",
    "2 garlic cloves, minced",
    "1/4 cup golden raisins",
    "1 bunch kale, chard, collards, or turnip greens, etc., about 1 pound, tough stem centers removed (if any) and discarded, greens chopped",
    "1/2 to 1 teaspoon red pepper flakes",
    "Roughly 1/4 cup dry white wine (can sub water with a splash of balsamic vinegar or lemon juice)",
    "Salt and pepper to taste"
  ],
  "__v": 1
}