{
  "hash": "b901cb78c10781cf69a6dae170990badf4ba4c40",
  "title": "Chicken Quinoa Burrito Bowls",
  "image": "http://www.gimmesomeoven.com/wp-content/uploads/2015/05/Chicken-Quinoa-Burrito-Bowl-2.jpg",
  "href": "http://www.gimmesomeoven.com/chicken-quinoa-burrito-bowls/",
  "extension": "Chrome",
  "firstAdded": "2017-03-05T15:37:25.746000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Portion quinoa evenly between two serving bowls, spreading it out so that it covers the bottom of the bowls. Divide the chicken, peppers and onions, corn salsa and guacamole evenly between the two bowls, and add them on top of the quinoa. Sprinkle each bowl with some crumbled cheese. Serve immediately, garnishing each bowl with a lime wedge if desired.",
    "Rub 2 tablespoons of taco seasoning evenly over each chicken breast (on both sides).",
    "Heat oil in a medium saute pan over medium-high heat. Add chicken breasts and cook for about 5 minutes per side, turning once, until the chicken is cooked through and no longer translucent. Remove from heat and transfer chicken to a cutting board and let rest for at least 5 minutes. Then cut into bite-sized cubes.",
    "Return the same saute pan to the heat and add the oil. Heat over medium-high heat, then add peppers and onions. Saute for 4-5 minutes until the veggies are cooked and softened. Remove from heat.",
    "Toss all ingredients together until combined."
  ],
  "ingredients": [
    "0",
    "2 cups cooked quinoa*",
    "1 batch taco-seasoned chicken (see below)",
    "1 batch sautéed veggies (see below)",
    "1 batch corn salsa (see below)",
    "⅔ cup guacamole",
    "¼ cup crumbled cotija cheese (or your preferred cheese)",
    "lime wedges (for serving)",
    "1",
    "2 small boneless, skinless chicken breasts, pounded to even thickness",
    "4 teaspoons Old El Paso Taco Seasoning",
    "1 Tablespoon olive oil",
    "2",
    "1 small red bell pepper, stem and core removed, then thinly sliced",
    "half of a small red onion, peeled, then thinly sliced",
    "3",
    "1 (15-ounce) can whole kernel corn, drained",
    "¼ cup finely-diced red onion",
    "2 Tablespoons finely-chopped cilantro",
    "1 Tablespoon lime juice"
  ],
  "__v": 1
}