{
  "hash": "870b5bc3f2844085e116f30f4f0a01faebc73ee9",
  "title": "Miss G’s Simple Jamaican Curry Goat",
  "image": "https://jamaicans.com/wp-content/uploads/2015/10/jamaican-curry-goat-recipe.jpg",
  "href": "https://jamaicans.com/simple-jamaican-curry-goat-recipe/",
  "extension": "Chrome",
  "firstAdded": "2020-05-31T11:04:51.185000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Meat marination –",
    "Take a large mixing bowl and combine the goat meat along with curry powder, sliced onions and minced garlic.",
    "Add the scotch bonnet peppers and sprinkle some salt and pepper in it.",
    "Mix well and place it in the refrigerator for a minimum of 5-6 hours, or preferably overnight.",
    "Curry Preparation –",
    "Once the meat has marinated sufficiently, take it out from the refrigerator and remove the onions and bonnet peppers from it and keep them aside.",
    "Place a large saucepan over high heat and pour some oil in it. Once the oil is sufficiently hot, put the marinated meat and let it cook till it turns brown, keep stirring occasionally.",
    "As the meat turns brown, add some thyme and pour in the hot water. Cook it covered over medium to low heat for around an hour or so.",
    "Meanwhile, chop a single medium sized onion and add it to the cooking meat along with the bonnet peppers and sliced onions (from the marinade).",
    "Pour in some more water and let it boil. Once the meat curry starts to boil, add the cut potatoes along with the ketchup and let it cook over reduced heat for 30-40 minutes till the meat is thoroughly cooked.",
    "Once done, remove the bonnet peppers and serve hot."
  ],
  "ingredients": [
    "0",
    "Marinade:",
    "1,3kg Goat meat, cut medium-sized",
    "5-6 tablespoons curry powder",
    "1 Onion, sliced",
    "5-6 garlic cloves, peeled and minced",
    "Curry:",
    "4-5 tablespoons Oil, for cooking",
    "4 cups water, boiling temperature",
    "1 spring Thyme",
    "1 onion, finely chopped",
    "2-3 Potatoes, peeled and largely cut",
    "1 tablespoon, Tomato sauce (Ketchup)",
    "Salt and Black pepper, as per taste",
    "1 Scotch bonnet pepper (Bonney pepper), sliced and de-seeded"
  ],
  "__v": 3
}