{
  "hash": "4dd98f290f3c3a49899cd68b54caae052e059dfb",
  "title": "Refried Pinto Beans",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2005/12/refried-beans-horiz-a-1600.jpg",
  "href": "https://www.simplyrecipes.com/recipes/refried_beans/",
  "extension": "",
  "firstAdded": "2018-01-27T23:22:25.189000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Rinse beans: Rinse the beans in water and remove any small stones, pieces of dirt, or bad beans.",
    "2 Cook the beans in water:",
    "Regular method Put beans into a pot and cover beans with at least 3 inches of water—about 3 quarts for 2 1/2 cups of dry beans. Bring to a boil and then lower heat to simmer, covered, for about 2 1/2 hours.",
    "The cooking time will vary depending on the batch of beans you have. The beans are done when they are soft and the skin is just beginning to break open.",
    "Pressure Cooker method Put beans into a 4 quart or larger pressure cooker with a 15 lb weight. Fill the pressure cooker with water up to the line that indicates the capacity for the pot (about two thirds of the way). Cook for 30-35 minutes, until the beans are soft and the skins are barely breaking open.",
    "Allow the pressure cooker to cool completely before opening. If there is resistance when attempting to open the cooker, do not open it, allow it to cool further. Follow the directions for your brand of pressure cooker. (See safety tips on using pressure cookers.)",
    "Strain the beans from the cooking water.",
    "3 Sauté onions in fat: Add the onions and lard/fat/oil to a wide, sturdy (not with a flimsy stick-free lining) frying pan on medium high heat. Cook onions until translucent. (Note the onions are optional, you can skip them if you want.)",
    "4 Add beans, mash them in pan: Add the strained beans and about a 1/4 cup of water to the pan. Using a potato masher, mash the beans in the pan, while you are cooking them, until they are a rough purée.",
    "5 Add water, salt, cheese: Add more water if necessary to keep the fried beans from getting too dried out. Add salt to taste. Add a few slices of cheddar cheese, or some (1/2 cup) grated cheddar cheese if you want.",
    "When beans are heated through (and optional cheese melted) the beans are ready to serve."
  ],
  "ingredients": [
    "0",
    "2 1/2 cups of dry pinto beans (about 1 lb or 450gm)",
    "3 quarts of water",
    "1/2 cup chopped onion (optional)",
    "2 Tbsp (or more to taste) pork lard, bacon fat, or olive oil (for vegetarian option)",
    "1/4 cup water",
    "Salt to taste",
    "Cheddar cheese (optional)"
  ],
  "__v": 1
}