{
  "hash": "ab6b1991557e2cb0424d1c11ca87299b6a061a0f",
  "title": "Kentucky Hot Brown",
  "image": "",
  "href": "https://www.foodandwine.com/recipes/kentucky-hot-brown?utm_source=pinterest.com&utm_medium=social&utm_campaign=foodandwine&utm_content=20190311&utm_term=1050898",
  "extension": "",
  "firstAdded": "2019-07-02T15:06:57.303000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "How to Make It",
    "Step 1 Make the sauce",
    "In a small saucepan, bring the milk to a simmer. In a medium saucepan, melt the butter. Add the flour and whisk over moderate heat for 1 minute. Gradually whisk in the hot milk and bring to a boil. Cook, whisking, until thickened, about 5 minutes. Remove the pan from the heat and whisk in both cheeses until melted. Stir in the nutmeg and hot sauce and season with salt and pepper.",
    "Step 2 Make the sandwiches",
    "Preheat the oven to 425°. Arrange the bacon on a rack set over a baking sheet. Cook until golden and crisp, about 30 minutes.",
    "Step 3",
    "Preheat the broiler. Arrange the tomato slices on a baking sheet, drizzle with the oil and season with salt and pepper. Broil 6 inches from the heat until lightly charred, 1 to 2 minutes per side; keep warm.",
    "Step 4",
    "Arrange the bread on a foil-lined baking sheet and spread each slice with 1/2 tablespoon of the butter; season with salt and pepper. Broil until lightly toasted, about 2 minutes. Flip the bread and toast for 1 minute. Top each toast with some turkey and a slice of tomato. Spoon the sauce on top and sprinkle on both cheeses. Broil until the cheese is melted and golden brown, 2 to 3 minutes. Transfer the sandwiches to plates and top with the bacon. Garnish with chopped chives and parsley and serve hot.",
    "Make Ahead",
    "The sauce can be refrigerated overnight and rewarmed before using."
  ],
  "ingredients": [
    "0",
    "Kentucky Hot Brown",
    "1 Rating",
    "1",
    "© BARNARD & MEYER",
    "Active Time",
    "30 MIN",
    "Total Time",
    "1 HR 10 MIN",
    "Yield",
    "Serves : Makes 8 sandwiches",
    "By BOBBY FLAY December 2015",
    "Star chef Bobby Flay smothers an open-face turkey sandwich with cheese sauce and bacon for his version of the over-the-top Louisville classic. Slideshow: More Hot Melted Sandwich Recipes",
    "Ingredients",
    "SAUCE",
    "2 1/4 cups whole milk 2 tablespoons unsalted butter 2 tablespoons all-purpose flour 2 cups shredded sharp white cheddar cheese (6 ounces) 1/4 cup freshly grated Parmigiano-Reggiano cheese Pinch of freshly grated nutmeg Few dashes of hot sauce Kosher salt Pepper",
    "SANDWICHES",
    "16 slices of thick-cut bacon 2 tomatoes, cut into eight 1/4-inch-thick slices 1 tablespoon canola oil Kosher salt Pepper Eight 1/2-inch-thick slices of day-old white sandwich bread 4 tablespoons unsalted butter, cut into pieces 2 pounds roast turkey breast, sliced 1/4 inch thick 1 1/2 cups shredded sharp white cheddar cheese (4 1/2 ounces) 1/2 cup freshly grated Parmigiano-Reggiano cheese Chopped chives and chopped parsley, for garnish"
  ],
  "__v": 1
}