{
  "hash": "21d69e458e722beffe46b638394170fdfb44dac8",
  "title": "Slow-Cooker Braised Beef, Pork and Black Beans",
  "image": "http://images-gmi-pmc.edge-generalmills.com/942be2c2-da1e-4d0b-bdb7-77a4c8daffaa.jpg",
  "href": "http://www.bettycrocker.com/recipes/slow-cooker-braised-beef-pork-and-black-beans/32b4a897-d56d-42dd-942f-2fee61896844",
  "extension": "Chrome",
  "firstAdded": "2016-10-15T16:40:11.925000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Soak beans in cold water 8 hours or overnight.",
    "Spray 6-quart slow cooker with cooking spray.",
    "Heat 12-inch skillet over medium heat. Add bacon; cook until crispy and brown. Using slotted spoon, transfer bacon to slow cooker. Season pork shoulder with 1/4 teaspoon of the salt and 1/4 teaspoon of the pepper. Increase heat to medium-high. Cook pork in bacon drippings 3 minutes on each side or until well browned. Transfer pork to slow cooker.",
    "Season chuck evenly with remaining 1/4 teaspoon salt and 1/4 teaspoon pepper. Add to skillet; cook about 3 minutes on each side or until well browned. Place in slow cooker. Reduce heat of skillet to medium; add onions to skillet. Cook about 4 minutes or until softened. Add 4 cloves garlic; cook 1 minute. Transfer to slow cooker. Stir to combine.",
    "Drain beans; add beans, broth and ham hock to slow cooker. Cover; cook on Low heat setting 8 hours or until beans and meat are tender.",
    "Remove ham hock; let cool enough to handle. Remove meat from hock; shred into small pieces, and return to slow cooker. Stir in vinegar.",
    "Meanwhile, cut away tough stalks and stems from collard greens. Wash collards thoroughly. Stack up several leaves, and roll up lengthwise in a bundle; cut them into 1-inch strips. Repeat until all leaves are shredded.",
    "In 12-inch skillet, heat oil over medium heat. Add 4 cloves garlic; cook about 2 minutes or until starting to brown. Add the greens; toss well with oil and garlic. Cook 2 to 4 minutes or until wilted. Season with 1/2 teaspoon salt and 1/2 teaspoon pepper.",
    "Serve beef, pork and beans over white rice with collard greens and orange segments."
  ],
  "ingredients": [
    "0",
    "1 lb dried black beans (2 cups), sorted, rinsed",
    "4 slices bacon, diced",
    "1 lb boneless pork shoulder or butt, cut into 1 1/2-inch cubes",
    "1/2 teaspoon salt",
    "1/2 teaspoon freshly ground black pepper",
    "2 lb boneless beef chuck, cut into 1 1/2-inch pieces",
    "1 large onion, chopped",
    "4 cloves garlic, finely chopped",
    "1 1/4 cups Progresso™ chicken broth (from 32-oz box)",
    "1 smoked ham hock (about 1 lb)",
    "1 tablespoon apple cider vinegar",
    "1",
    "2 bunches collard greens (about 2 lb)",
    "2 tablespoons extra-virgin olive oil",
    "4 cloves garlic, finely chopped",
    "1/2 teaspoon salt",
    "1/2 teaspoon pepper",
    "2",
    "5 cups cooked white rice",
    "3 oranges"
  ],
  "__v": 1
}