{
  "hash": "8e2d60305cbb5c286910b8b2642a06f69fd14462",
  "title": "Pesto Chicken Tart",
  "image": "http://p-fst2.pixstatic.com/506b10d2d9127e30f6001623._w.540_h.540_s.fit_.jpg",
  "href": "http://www.thekitchn.com/weeknight-recipe-pesto-chicken-tart-recipes-from-the-kitchn-174334",
  "extension": "Chrome",
  "firstAdded": "2016-04-05T21:24:44.464000",
  "users": [
    null
  ],
  "keywords": [
    "sheet",
    "frozen",
    "puff",
    "pastry",
    "head",
    "garlic",
    "heaping",
    "basil",
    "pesto",
    "scant",
    "chicken",
    "breast",
    "mozzarella",
    "parmesan"
  ],
  "directions": [
    "0",
    "Preheat oven to 400°F. Remove one sheet of puff pastry from the freezer and allow to thaw at room temperature for 30 minutes. If using garlic, place cloves on a baking sheet and cook in the oven until soft and light golden brown, 10-15 minutes. Allow the cloves to cool and then chop finely.",
    "Unfold the puff pastry onto a parchment-lined baking sheet, pressing and pinching to close any holes in the seams. Using a fork, prick the dough all over—including the edges—to prevent it from puffing during baking.",
    "Brush the pesto in a thin layer over the dough. Scatter the roasted garlic across the pesto. Toss the chicken with a tablespoon of olive oil and a generous sprinkling of salt and pepper. Layer the chicken on the tart, followed by the mozzarella and the Parmesan. Season with kosher salt and pepper.",
    "Bake until the the cheese is melted and light golden brown, approximately 15-25 minutes (start checking early). Remove the tart from the baking sheet and let cool on a wire rack for 5 minutes. Cut into squares and serve immediately.",
    "Note: You can easily sub pizza or flat bread dough in this recipe, or any other bread base you can think of. Also, I scattered some diced tomatoes on one of my slices for some extra color (see last photo); feel free to do the same if you have some ripe ones lying around."
  ],
  "ingredients": [
    "0",
    "1 sheet frozen puff pastry",
    "1 small head of peeled garlic cloves (optional)",
    "3 heaping tablespoons basil pesto,",
    "1 scant cup cooked, diced chicken breast",
    "1/2 cup shredded mozzarella",
    "2 tablespoons grated Parmesan"
  ],
  "__v": 1
}