{
  "__v": 1,
  "directions": [
    "0",
    "Soak the rice noodles in a large bowl of lukewarm water for 20 minutes ( time this )",
    "Soak the salted radish in a small bowl of lukewarm water for 10 minutes.",
    "Toast the dried shrimp in a skillet until crispy, medium heat, 4 minutes, chop.",
    "Mix tamarind concentrate, fish sauce, sugar and water in a small bowl, set aside.",
    "Pat dry tofu with paper towels, pressing down to release water, and cut into 1inch long strips, ⅓ inch thick. ( see photo).",
    "Chop scallions and peanuts, set aside. Slice limes.",
    "Place tofu, salted shrimp and drained radish, next to stove, and have metal spatula handy. Drain the noodles, keep in the same bowl, placing the sprouts in the bowl with them. ( After 20 minutes, the noodles will still be somewhat firm but flexible-- they will soften up in the wok- be sure to soak the entire 20 minutes.)",
    "7. In a wok, heat oil on high heat until smoky. Swirl it around to coat sides. Add egg, and let it bubble and sizzle.",
    "8. Still on high heat, add the tofu, radish and dried shrimp, around and next to the egg, stirring everything but the egg. When the edges of the egg crisp, flip the egg over and break up into a few pieces with the metal spatula, then stir and flip everything together, stirring until the tofu starts to brown- about 1-2 minutes.",
    "9. Add the drained noodles and bean sprouts, and stir constantly, flipping the noodles continuously for 1 minute.",
    "10. Add the shrimp, peas, asparagus and the tamarind sauce into the wok, and keep stirring and flipping, until the shrimp are cooked thru, the noodles softened, and the liquid evaporated, about 3-4 minutes. Toss in the scallions and ½ the peanuts. Serve immediately, garnishing with lime wedges, fresh bean sprouts and chili flakes."
  ],
  "firstAdded": "2014-06-06T12:17:31.376000",
  "hash": "d39fcdb3ca5adfa11928df920af3b26e68b84875",
  "href": "http://www.feastingathome.com/2014/05/spring-vegetable-pad-thai.html",
  "image": "http://1.bp.blogspot.com/-SRSIFe1nttU/U4KrWJYlQHI/AAAAAAAAOe4/S2asz0wud5A/s1600/spring+pad+thai+recipe-2000-3.jpg",
  "ingredients": [
    "0",
    "8 oz. thin flat rice noodles",
    "2 T shredded salted radish (soaked in water)",
    "2 T dried, toasted shrimp (medium or small)",
    "¼ C tamarind concentrate",
    "⅓ C palm sugar or brown sugar",
    "3 T fish sauce",
    "½ C water",
    "½ C extra firm tofu",
    "½ C scallions or garlic chives",
    "1 Egg",
    "1-2 C bean sprouts ( plus more for garnish)",
    "8-10 medium shrimp- peeled and de-veined ( raw or cooked)",
    "1 Cup fresh peas ( or snap peas, or snow peas,)",
    "1 Cup asparagus ( or green beans, or mushrooms)",
    "⅓ cup roasted chopped peanuts",
    "1 lime- sliced for garnish",
    "3 T peanut oil ( or vegetable oil)",
    "toasted chili powder or chili flakes"
  ],
  "keywords": [
    "flat",
    "rice",
    "noodles",
    "salted",
    "radish",
    "soaked",
    "water",
    "shrimp",
    "medium",
    "tamarind",
    "concentrate",
    "palm",
    "brown",
    "sugar",
    "fish",
    "extra",
    "firm",
    "tofu",
    "scallions",
    "garlic",
    "chives",
    "egg",
    "bean",
    "sprouts",
    "raw",
    "snap",
    "snow",
    "peas",
    "asparagus",
    "green",
    "beans",
    "mushrooms",
    "roasted",
    "peanuts",
    "lime",
    "peanut",
    "oil",
    "chili"
  ],
  "title": "Spring Vegetable Pad Thai",
  "users": [
    null
  ]
}