{
  "hash": "6f2aa8702d163ba02a203209195bd40d4651f4cf",
  "title": "Sicilian Cannoli",
  "image": "http://www.epicurious.com/images/recipesmenus/2005/2005_may/232015.jpg",
  "href": "http://www.epicurious.com/recipes/food/views/Sicilian-Cannoli-232015",
  "firstAdded": "2014-12-05T23:45:39.985000",
  "users": [
    null
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "dusting",
    "sugar",
    "cocoa",
    "dutchprocess",
    "cinnamon",
    "salt",
    "baking",
    "soda",
    "cold",
    "lard",
    "marsala",
    "wine",
    "egg",
    "separated",
    "oil",
    "ricotta",
    "soft",
    "mild",
    "goat",
    "cheese",
    "confectioners",
    "candied",
    "orange",
    "peel",
    "orangeflower",
    "called",
    "orangeblossom",
    "water",
    "shelled",
    "unsalted",
    "pistachios",
    "dyed",
    "red",
    "bittersweet",
    "chocolate"
  ],
  "directions": [
    "0",
    "Make dough for shells: Whisk together flour, sugar, cocoa, cinnamon, salt, and baking soda. Add 2 tablespoons lard and blend in with your fingertips until combined. Add wine and yolk and stir until a dough forms.",
    "Turn out dough onto a lightly floured surface and knead until smooth and elastic, 5 to 7 minutes. Form dough into a disk and wrap tightly in plastic wrap, then let stand at room temperature 1 hour.",
    "Make filling while dough stands: Beat together ricotta, goat cheese, confectioners sugar, orange peel, orange-flower water, and cinnamon in a bowl with an electric mixer at medium speed 1 minute (do not overbeat). Fold in nuts and chocolate until combined and chill.",
    "Make shells: Set smooth rollers of pasta maker at widest setting. Unwrap dough and cut in half, then lightly flour 1 piece (keep remaining half covered with plastic wrap). Flatten floured dough into an oval and feed through rollers. Turn dial down 2 notches and feed dough through rollers again. Continue to feed dough through rollers, making space between rollers narrower by 2 notches each time, until narrowest setting is used.",
    "Line a baking sheet with plastic wrap. Transfer rolled dough to a lightly floured surface and cut out 4 or 5 rounds with floured cutter. Transfer rounds to baking sheet and keep covered with more plastic wrap. Roll out remaining dough and cut rounds in same manner. Gather scraps and let stand 10 minutes. Roll out scraps and cut in same manner.",
    "Heat remaining lard with 1 1/4 inches oil in a 4-quart heavy pot over moderate heat until it registers 350°F on thermometer.",
    "Meanwhile, lightly oil cannoli tubes. Lightly beat egg white, then brush bottom edge of 1 dough round with egg white. Wrap dough around a tube, overlapping ends (egg-white edge should go on top), then press edges together to seal. Make 5 more shells in same manner (keep remaining rounds covered with plastic).",
    "Fry dough on tubes 1 at a time, turning with metal tongs, until 1 shade darker, about 45 seconds. Wearing oven mitts, clamp end of hot tubes, 1 at a time, with tongs and, holding tube vertically, allow shell to slide off tube onto paper towels, gently shaking tube and wiggling shell as needed to loosen. (If you allow shell to cool it will stick to tube and shatter when you try to remove it.) Transfer shells to paper towels to drain and cool tubes before reusing. Wrap remaining dough around tubes and fry in same manner.",
    "Spoon filling into pastry bag and pipe some into 1 end of a cannoli shell, filling shell halfway, then pipe into other end. Repeat with remaining shells.",
    "Cooks' notes: •Dough can be made 1 day before frying shells and chilled. Let dough stand at room temperature 1 hour before rolling.\n•Shells can be fried 2 days ahead and cooled completely, then kept, layered between paper towels, in an airtight container at room temperature."
  ],
  "ingredients": [
    "0",
    "1 cup all-purpose flour plus additional for dusting",
    "3 tablespoons sugar",
    "1 teaspoon unsweetened cocoa powder (not Dutch-process)",
    "1/4 teaspoon cinnamon",
    "1/4 teaspoon salt",
    "1/8 teaspoon baking soda",
    "1 lb cold lard",
    "2 tablespoons sweet Marsala wine",
    "1 large egg, separated",
    "About 3 cups vegetable oil",
    "1",
    "1 lb fresh ricotta (2 cups)",
    "2 oz soft mild goat cheese",
    "1/4 cup confectioners sugar",
    "1 tablespoon minced candied orange peel",
    "1/2 teaspoon orange-flower water (also called orange-blossom water)",
    "1/4 teaspoon cinnamon",
    "1/3 cup shelled unsalted pistachios (not dyed red), chopped",
    "2 oz bittersweet chocolate (not unsweetened), chopped (1/2 cup)",
    "2",
    "Garnish: confectioners sugar"
  ],
  "__v": 1
}