{
  "hash": "c08fcef48d58f08412107ab2af04bdaf20e12c58",
  "title": "Grain-Free Sugar Cookies (Paleo and SCD)",
  "image": "http://againstallgrain.com/wp-content/uploads/2013/02/Cut_Out_Cookies-083-2.jpg",
  "href": "http://againstallgrain.com/2013/02/07/grain-free-sugar-cookies-paleo-and-scd/",
  "extension": "Chrome",
  "firstAdded": "2016-02-14T17:26:43.060000",
  "users": [
    null
  ],
  "keywords": [
    "ngredients",
    "almond",
    "flour",
    "honey",
    "egg",
    "unsalted",
    "butter",
    "coconut",
    "oil",
    "vanilla",
    "baking",
    "soda",
    "salt",
    "dusting",
    "frosting",
    "called",
    "cream",
    "concentrate",
    "raw",
    "cacao",
    "cold",
    "milk",
    "food",
    "coloring",
    "brand",
    "natural",
    "use",
    "freeze",
    "strawberries",
    "raspberries",
    "need",
    "extra",
    "achieve",
    "desired",
    "consistency",
    "using",
    "fruit"
  ],
  "directions": [
    "0",
    "INSTRUCTIONS:",
    "Preheat oven to 350 degrees.",
    "Combine the dough ingredients in a food processor and process until a smooth ball of dough forms, about 30 seconds. Alternatively, mix all of the ingredients in a stand mixer or by hand. The food processed dough will be ultra smooth and the most like a conventional sugar cookie.",
    "Flatten the ball of dough into a ½” thick disk and wrap in plastic wrap. Chill for 20 minutes.",
    "Roll the dough out between two sheets of parchment paper, keeping it to a ¼” thickness. Remove the top sheet and sprinkle the top of the dough with 1 teaspoon coconut flour, rubbing it in slightly with your fingers. Dip a cookie cutter in a little flour then cut your shapes, peeling away excess dough as you work. Gather the excess dough into a ball and re-roll it. If it starts to dry out or crack as you work with it the second or third time, lightly wet your hands before kneading the scraps to add a little moisture back into the dough.",
    "Bake the cookies on a tray lined with parchment paper for 8-10 minutes. Cool completely on a wire rack.",
    "Frosting",
    "Warm the cacao butter and coconut butter over low heat until melted, but not boiling. Pour it into a bowl and whisk in the cold coconut milk and honey. Refrigerate for 20 minutes to set.",
    "Scrape the frosting into a blender or food processor and pulse a few times until the frosting is smooth and fluffy. Add any food coloring if desired or leave white.",
    "Pipe designs or spread frosting onto cooled cookies.",
    "*For the glossy look that I achieved with the dark pink heart, I first piped a thin border around the outside of the cookie and placed it in the fridge to harden for 10 minutes. Then I melted a little bit of the frosting until it was liquid and poured a little inside the border. I tilted the cookie around until the frosting “flooded” the space and stopped at the border. The others are just spread with an offset spatula then piped with designs."
  ],
  "ingredients": [
    "0",
    "NGREDIENTS:",
    "2½ cups blanched almond flour",
    "¼ cup honey",
    "1 egg",
    "2 teaspoons unsalted butter or coconut oil",
    "½ teaspoons vanilla extract",
    "½ teaspoon baking soda",
    "¼ teaspoon sea salt",
    "1 teaspoon coconut flour – for dusting",
    "Frosting",
    "6 tablespoons coconut butter (also called coconut cream concentrate)",
    "¼ cup raw cacao butter, chopped",
    "¼ cup honey",
    "¼ cup cold coconut milk",
    "optional: food coloring (this brand is all natural or use 1 tablespoon finely ground freeze dried strawberries or raspberries – you may need to add extra liquid to achieve desired consistency if using the dried fruit)"
  ],
  "__v": 1
}