{
  "hash": "30ce33d5b8f71c56ae2b5963a923c28cd3e61357",
  "title": "SWEET POTATO CHILI WITH TURKEY",
  "image": "https://www.asaucykitchen.com/wp-content/uploads/2015/10/Sweet-Potato-Chili-with-Turkey-www.asaucykitchen.com_-1-100x150.jpg",
  "href": "https://www.asaucykitchen.com/sweet-potato-chili-with-turkey/",
  "extension": "Chrome",
  "firstAdded": "2018-05-09T17:42:43.108000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a deep pot over the stove heat the oil and add the onion and ground turkey. Add 1 teaspoon chili powder and 1 teaspoon of the taco seasoning to the pot and stir. Add 1 cup of the chicken broth to the turkey mixture to keep everything moving. Once the onion is soft and the turkey is brown and crumbly transfer the contents of the pot to another dish temporarily so that you can use that same pot next with the sweet potatoes.",
    "Add the sweet potatoes to the same heavy pot along with the remaining chili powder and taco seasoning. Once the sweet potatoes have been browned, add the remaining broth and crushed garlic to the pot and allow you mixture to simmer for about 10 minutes until the sweet potatoes are soft enough that you can easily pierce them with a fork.",
    "With an immersion blender, puree the sweet potato mixture until you get your desired consistency. I left a few larger chunks of sweet potato in mine, but you can keep blending until it's completely smooth if you like. You can also do this step with a traditional blender.",
    "Add the ground turkey and onions to the sweet potato puree and mx until combined. Salt to your preference and enjoy. Add diced avocado and top with cilantro or enjoy as is."
  ],
  "ingredients": [
    "0",
    "1 tablespoon oil",
    "1 pound (about 500 grams) ground turkey",
    "1/2 large white onion chopped fine",
    "2 teaspoons chili powder",
    "2 teaspoons taco seasoning",
    "2 sweet potatoes chopped into small cubes",
    "3 cups (700 ml) chicken stock",
    "2 garlic cloves crushed",
    "salt to taste"
  ],
  "__v": 1
}