{
  "hash": "4034e3a1e9a029bc556922718eeebdffd5bf4964",
  "title": "Beet Salad with Pickled Mushrooms and Caramelized Shallots",
  "image": "https://www.epicurious.com/static/img/px/background.png",
  "href": "https://www.epicurious.com/recipes/food/views/beet-salad-with-pickled-mushrooms-and-caramelized-shallots",
  "extension": "Chrome",
  "firstAdded": "2020-01-29T19:41:30.370000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "PREPARATION",
    "Place beets in a large pot. Pour in cold water to cover; season with salt. Bring to a boil, then reduce heat to medium-low and simmer until tender, 40–60 minutes. Drain and let beets cool. Slip skins off with your hands (wear gloves to avoid staining if you have them) and slice into wedges. Place in a large bowl.",
    "Meanwhile, heat 2 Tbsp. oil in a large skillet over high. Add mushrooms and cook, stirring occasionally, until golden brown and crisp, about 6 minutes.",
    "Whisk vinegar, honey, garlic, 1/4 cup oil, and remaining 1 1/2 tsp. salt in a small bowl. Add mushrooms to dressing and let sit to pickle at least 30 minutes.",
    "Wipe out skillet. Heat remaining 2 Tbsp. oil in skillet over medium-high. Add shallots and cook, stirring occasionally, until lightly browned and tender, about 4 minutes. Let cool.",
    "Pour dressing off mushrooms over beets in bowl. Add tarragon and toss to coat. Top with shallots and pickled mushrooms; season with pepper.",
    "Do Ahead: Beets can be boiled 2 days ahead. Do not peel; cover and chill. Dressing can be made and mushrooms pickled 1 day ahead; cover and chill separately."
  ],
  "ingredients": [
    "0",
    "4 lb. beets (from about 3 large bunches)",
    "1 1/2 tsp. kosher salt, plus more",
    "1/2 cup extra-virgin olive oil, divided",
    "8 oz. wild mushrooms, sliced",
    "6 Tbsp. sherry vinegar or raspberry vinegar",
    "1 Tbsp. honey",
    "2 garlic cloves, finely grated",
    "6 shallots, halved, thinly sliced lengthwise",
    "2 Tbsp. coarsely chopped tarragon",
    "Freshly ground black pepper"
  ],
  "__v": 1
}