{
  "hash": "b59e1e817ed692428f0c2d0880e97c7c3f13e230",
  "title": "Chickpea, tomato and bread soup",
  "image": "",
  "href": "https://www.ottolenghi.co.uk/chickpea-tomato-and-bread-soup-shop",
  "extension": "Chrome",
  "firstAdded": "2017-12-14T18:52:53.176000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 180°C/Gas Mark 4. Place the onion and fennel in a large saucepan, add 3 tablespoons of the oil and sauté on a medium heat for about 4 minutes. Add the carrot and celery and continue cooking for 4 minutes, just to soften the vegetables, stirring occasionally. Stir in the tomato purée and stir as you cook for 1 minute. Add the wine and let it bubble away for a minute or two.",
    "Next, add the canned tomatoes with their juices, the herbs, sugar, vegetable stock and some salt and pepper. Bring to the boil, then cover and leave to simmer gently for about 30 minutes.",
    "While you wait, break the bread into rough chunks with your hands. Toss with 2 tablespoons oil and some salt and scatter in a roasting tin. Bake for about 10 minutes, or until thoroughly dry. Remove from the oven and set aside.",
    "About 10 minutes before you want to serve the soup, place the chickpeas in a bowl and crush them a little with a potato masher or the end of a rolling pin; you want some to be left whole. Add them to the soup and leave to simmer for a further 5 minutes. Next add the toasted bread, stir well and cook for another 5 minutes. Taste the soup and add salt and pepper liberally.",
    "Ladle the hot soup into bowls. Spoon some pesto in the centre, drizzle with plenty of olive oil and finish with a generous amount of freshly shredded basil, if you like."
  ],
  "ingredients": [
    "0",
    "1 large onion, sliced",
    "1 medium fennel bulb, sliced",
    "about 120ml olive oil",
    "1 large carrot, peeled, cut lengthways in half and sliced",
    "3 celery sticks, sliced",
    "1 tbsp tomato purée",
    "250ml white wine",
    "400g can Italian plum tomatoes",
    "1 tbsp chopped oregano",
    "2 tbsp chopped parsley",
    "1 tbsp thyme leaves",
    "2 bay leaves",
    "2 tsp caster sugar",
    "1 litre vegetable stock",
    "160g stale sourdough bread (crust removed)",
    "400g freshly cooked chickpeas (canned are fine too)",
    "4 tbsp basil pesto (bought or freshly made; see Royal potato salad, page 20)",
    "handful of shredded basil leaves to serve (optional)",
    "salt and black pepper"
  ],
  "__v": 1
}