{
  "hash": "66a7d12f08e1567f9afddbedc4536e5f508ac45a",
  "title": "The Best Shredded Kale Salad",
  "image": "http://cdn.ohsheglows.com/wp-content/uploads/2013/11/bestkalesalad-3668.jpg",
  "href": "http://ohsheglows.com/2013/11/25/the-best-shredded-kale-salad/",
  "extension": "Chrome",
  "firstAdded": "2016-02-15T22:51:18.354000",
  "users": [
    null
  ],
  "keywords": [
    "salad",
    "dressing",
    "medium",
    "bunches",
    "destemmed",
    "lacinatodinosaur",
    "kale",
    "garlic",
    "juice",
    "lemon",
    "extra",
    "virgin",
    "olive",
    "oil",
    "salt",
    "black",
    "pepper",
    "eyeball",
    "sweetened",
    "cranberries",
    "pecan",
    "parmesan",
    "halves",
    "nutritional",
    "yeast",
    "pinches"
  ],
  "directions": [
    "0",
    "Directions:",
    "Preheat the oven to 300F. Spread the pecans onto a baking sheet and toast in the oven for 8-10 minutes until fragrant and lightly golden.",
    "Remove the stems from the kale and discard (you can save for smoothies if you are hardcore!). Finely chop the kale leaves (the smaller, the better!).",
    "Wash the kale and spin dry. Place dried kale into a large bowl.",
    "For the dressing: In a mini food processor, process the garlic until minced. Now add the lemon, oil, salt, and pepper and process until combined. Adjust to taste, if desired. Pour the dressing onto the kale and mix it into the kale with your hands or toss with spoons. Keep mixing for about 1 minute to ensure everything is coated perfectly.",
    "For the pecan parm: Rinse out the mini processor and pat dry. Add the pecans into the processor and process until the pecans are the size of peas or a bit larger. Now add in the nutritional yeast, oil, and salt and process again until it's a coarse crumb. Be sure not to over-process - we still want a nice crunchy texture here, not powder.",
    "Sprinkle the pecan Parmesan all over the salad. Toss on a handful or two of dried cranberries. Wrap and place in the fridge for 30-60 minutes to soften. I tried letting this salad sit overnight in the fridge and I greatly preferred the flavour of the salad served the day of, so I don't recommend making this salad the day before and letting it sit in the fridge overnight.",
    "Tips:",
    "1) Instead of a mini processor, you can chop/whisk the dressing and pecan \"parmesan\" by hand. 2) For a nut-free version, try using breadcrumbs instead of pecans."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "For the salad & dressing:",
    "2 medium bunches destemmed Lacinato/dinosaur kale, finely chopped (8 cups chopped)",
    "2 large garlic cloves",
    "1/4 cup fresh lemon juice (from 1 lemon)",
    "3-4 tablespoons extra virgin olive oil, to taste",
    "1/4 teaspoon fine grain sea salt",
    "1/4 teaspoon freshly ground black pepper (just eyeball it)",
    "1-2 handfuls dried sweetened cranberries, for garnish",
    "For the pecan parmesan:",
    "1 cup pecan halves, toasted",
    "1.5 tablespoons nutritional yeast",
    "1 tablespoon extra virgin olive oil",
    "2 pinches fine grain sea salt"
  ],
  "__v": 1
}