{
  "hash": "b570b8c66789b7b177ef7921fe5ee1b25bb3fa12",
  "title": "vegan mini pumpkin pies",
  "image": "https://cdn.loveandlemons.com/wp-content/uploads/2013/10/IMG_0019-2-cropped.jpg",
  "href": "https://www.loveandlemons.com/vegan-mini-pumpkin-pies/",
  "extension": "",
  "firstAdded": "2018-02-06T01:10:02.245000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make your pie dough and set it in the fridge to chill while you make the filling. (note-leave in the fridge if you're not going to assemble pies right away. Dough will harden the longer it chills. If it gets too hard, let sit at room temp and it'll become more pliable).",
    "In a small (unheated) saucepan, combine almond milk, corn starch. Whisk until it's combined and all lumps are incorporated. Add maple syrup, then bring to a simmer over low to medium-low heat. Whisk continuously until the mixture thickens and looks like the above photo. (about 2 minutes).",
    "Turn the heat off, whisk in the pumpkin puree, coconut oil, vanilla, spices, salt, and a little bit more maple syrup. (Taste and adjust spices & sweetness if you want to).",
    "Set aside, and let cool to room temp. (chill in the fridge if you're not going to assemble pies right away).",
    "Roll/form pie dough into mini tart pans, regular muffin pans, or mini muffin pans. (note - mini muffin pans are the easiest - just use your fingers to press a small ball of dough into each muffin cup - you will have delicious 2-bite pies).",
    "In a 350 degree oven, pre-bake dough for 8-12 minutes or until it's just barely not raw. Remove from oven, let cool slightly, then spoon in the filling and sprinkle with a few crushed pecans. Bake for an additional 5-10 minutes until the top sets & turns darker orange. Remove, let cool, and refrigerate for 8-24 hours until fully chilled and set.",
    "Garnish with coconut whip cream and a dusting of cinnamon."
  ],
  "ingredients": [
    "0",
    "1 cup original Almond Breeze Almond Milk",
    "3 tablespoons corn starch",
    "¼ cup maple syrup",
    "1 cup canned pumpkin puree",
    "1 tablespoon coconut oil",
    "1 teaspoon vanilla",
    "1 teaspoon cinnamon",
    "¼ teaspoon alspice",
    "¼ teaspoon nutmeg",
    "¼ teaspoon salt",
    "optional - 2 more teaspoons maple syrup",
    "1",
    "this recipe for vegan pie dough",
    "crushed pecans for garnish",
    "optional-coconut whip, or whipped topping of choice"
  ],
  "__v": 1
}