{
  "hash": "8fb7a8476d4899657a01b8b5e0eb8347b56a85b8",
  "title": "Boiled Chocolate Icing",
  "image": "http://images.media-allrecipes.com/userphotos/250x250/00/79/74/797434.jpg",
  "href": "http://www.cheftalk.com/t/67398/looking-for-old-fashion-chocolate-frosting-that-hardens/30",
  "firstAdded": "2015-01-26T11:20:44.513000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "butter",
    "granulated",
    "sugar",
    "milk",
    "vanilla",
    "squares",
    "baking",
    "chocolate",
    "cream"
  ],
  "directions": [
    "0",
    "In a large heavy saucepan, melt the butter, sugar, milk, and vanilla over low heat until the sugar is dissolved, about 5 minutes. Bring to a boil and cook, without stirring, for 1 minute. Brush down the sides of the pan with a pastry brush dipped in warm water to remove sugar crystals, then turn off heat. Stir in the chocolate until melted and smooth.",
    "Return heat to medium. Brush down the sides of the pan again one more time with water. Cook the chocolate mixture, WITHOUT STIRRING, until it reaches 238°F, the soft-ball stage, approximately 20 minutes.",
    "Meanwhile, prepare an ice water bath in a large bowl. When icing reaches soft-ball temperature, place saucepan in water to stop the cooking. DO NOT STIR. Let the frosting cool to 120°F, approximately 20 minutes. Remove the pan from the water. Using an electric mixer, beat the icing on high speed for about 3-5 minutes. It should reach a pourable consistency. If it is too thick to pour, beat in heavy cream one tablespoon at a time until it is the right consistency.",
    "Working quickly, frost the cake. Pour 1/3 of icing over the center of first layer and push out with a spatula. Add second cake layer and pour remaining icing over the top. Push out frosting so it runs over the sides of the cake. Smooth as much as possible. Let cake stand until icing sets and loses its sheen."
  ],
  "ingredients": [
    "0",
    "1/2 cup (1 stick) unsalted butter",
    "3 cups granulated sugar",
    "1 1/2 cups whole or 2% milk",
    "1 teaspoon pure vanilla extract",
    "3 squares unsweetened baking chocolate",
    "1/4 cup heavy cream (optional)"
  ],
  "__v": 1
}