{
  "hash": "680d238508749fc41ddd18678e09cb3519174c65",
  "title": "Paleo Milky Way Bars",
  "image": "http://blog.paleohacks.com/wp-content/uploads/2015/09/milkyway9.jpg",
  "href": "http://blog.paleohacks.com/paleo-milky-way-bars/",
  "extension": "Chrome",
  "firstAdded": "2016-02-06T16:56:29.751000",
  "users": [
    null
  ],
  "keywords": [
    "water",
    "unflavored",
    "gelatin",
    "maple",
    "syrup",
    "cocoa",
    "creamy",
    "almond",
    "butter",
    "coconut",
    "cream",
    "salt",
    "dark",
    "chocolate"
  ],
  "directions": [
    "0",
    "How To Make It:",
    "1. Marshmallows: In a large metal mixing bowl, stir together the ½ cup water and gelatin and let sit 10 minutes.",
    "2. Meanwhile, combine the 6 tablespoons water, 2 tablespoons maple syrup, and cocoa powder in a small saucepan. Bring to a boil.",
    "3. Use a hand mixer to beat the hot liquid into the gelatin mixture. Keep beating on highest speed for about 10 minutes. The goal is to beat as much air as possible into the mixture before the gelatin starts to set. (If you don’t get enough air beaten in, the mixture will be chocolate jello!) Beat until peaks start to form. Don’t overbeat or it will set up too quickly.",
    "4. Working quickly, spread the mixture evenly in a standard-sized loaf pan and pop it in the freezer to set up (don’t let the marshmallows freeze).",
    "5. Now make the caramel: In a small saucepan, combine the 1/2 cup maple syrup, almond butter, coconut cream, and salt. Simmer for 10-15 minutes, stirring occasionally. Let cool most of the way.",
    "6. Cut the marshmallows into squares about the size of a fun-size candy bar. Place them about 1/2 inch apart on a cookie sheet or large plate. Spoon a dollop of caramel onto each square (you might have a little leftover caramel, never a bad thing). Place in the freezer for 10 minutes.",
    "7. Now drizzle chocolate over. You want the chocolate to run down the sides to encase the caramel. It might be a little messy, that’s ok. Freeze until set.",
    "8. Enjoy with a cold glass of Paleo Vanilla Bean Milkshake!"
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "1/2 cup + 6 T water",
    "3 T unflavored gelatin",
    "2 T + 1/2 cup pure maple syrup",
    "2 T cocoa powder",
    "1/4 cup creamy almond butter",
    "1/4 cup coconut cream",
    "1/4 t salt",
    "1/2 cup chopped dark chocolate, melted"
  ],
  "__v": 1
}