{
  "hash": "6dbceaeebb0763402261038ac7856cccbf10115f",
  "title": "ROASTED TOMATO AND BASIL PASTA",
  "image": "https://cdn77-s3.lazycatkitchen.com/wp-content/uploads/2018/07/roasted-tomato-basil-portion-800x1200.jpg",
  "href": "https://www.lazycatkitchen.com/roasted-tomato-basil-pasta/",
  "extension": "Chrome",
  "firstAdded": "2018-08-07T16:29:16.132000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 200° C / 390° F and get a medium size baking tray ready.",
    "Halve the tomatoes and arrange them on the prepared baking tray, cut side up. Brush the exposed flesh with a little olive oil, sprinkle with dried basil, salt and pepper. Bake for about 20 minutes, until soft and juicy.",
    "Cook the pasta al dente following the packet instructions.",
    "Heat up a small frying pan on low-medium heat. Once hot, add the pine nuts and dry-roast them until golden, stirring them regularly as they tend to burn easily. Remove them from the pan and set aside.",
    "While the pine nuts are toasting, heat up 2 tbsp of olive oil in a large pan on a very low heat.",
    "Throw in the diced garlic and fry it on a very low heat, stirring frequently, until the garlic releases its aroma, but do not allow it to brown as it will taste bitter.",
    "Add the diced tomatoes, a couple of sprigs of basil, capers and white wine (or water if not using wine).",
    "Simmer gently for about 15 minutes so that the tomatoes to cook a little and excess moisture cooks out. Add a splash of more liquid (water or pasta cooking water) if the pan starts to look too dry while the tomatoes are still raw.",
    "Season with a pinch of chilli and black pepper and salt, but be careful, as, depending on the brand, the capers may provide enough saltiness. Remove the wilted basil from the sauce at the end of simmering.",
    "Once the sauce is ready, add the cooked pasta and oven roasted tomatoes to the pan. Toss the pasta in the sauce. Taste and adjust the seasoning.",
    "Serve topped with toasted pine nuts and shredded basil leaves."
  ],
  "ingredients": [
    "0",
    "200 g / 7 oz grape, plum or cherry tomatoes (10 tomatoes)*",
    "2-3 tbsp / 30-45 ml extra virgin olive oil",
    "½ tsp dried basil",
    "salt and pepper to taste",
    "200 g / 14 oz spaghetti (GF if needed)",
    "2 tbsp pine nuts",
    "2 garlic cloves, diced very finely",
    "2 medium ripe tomatoes (or ½ can), peeled and diced finely",
    "a few sprigs of fresh basil",
    "2 tbsp capers in brine, chopped",
    "¼ cup / 60 ml white wine (optional)",
    "a pinch of chilli flakes (optional)"
  ],
  "__v": 1
}