{
  "hash": "7fa5b6e3e7c149b3cc693d8752c5e5a7bcbd6e80",
  "title": "Slow-Braised Short Ribs with Green Pumpkin Seed Mole",
  "image": "",
  "href": "http://www.tastingtable.com/chefs_recipes/chefs_recipes/how-to-make-slow-braised-short-ribs-with-pumpkin-seed-recipe",
  "firstAdded": "2015-02-06T03:07:56.129000",
  "users": [
    null
  ],
  "keywords": [
    "bonein",
    "short",
    "rib",
    "slab",
    "water",
    "chile",
    "salt",
    "garlic",
    "poblano",
    "peppers",
    "seeded",
    "jalapeo",
    "pepper",
    "stemmed",
    "tomatillos",
    "husked",
    "roughly",
    "yellow",
    "onion",
    "loosely",
    "cilantro",
    "sprigs",
    "oregano",
    "leaves",
    "pumpkin",
    "seeds",
    "chicken",
    "stock",
    "rice",
    "serve"
  ],
  "directions": [
    "0",
    "Preheat the oven to 300°.",
    "Make the short ribs: Place the short rib slab in a Dutch oven or deep baking dish, then add the water, chile powder, salt and garlic. Cover the dish with a lid or wrap it tightly with foil and place in oven. Roast until the short ribs are very tender and falling off the bones, about 4 hours. (Start checking them at 3 hours.)",
    "Let the short ribs cool overnight in their cooking liquid, then remove the meat from the cold liquid and discard the fat and liquid (or reserve for another use). Remove the meat from the bones, trim it of any remaining fat or cartilage, and set aside.",
    "Make the green mole: In a blender, puree the poblano and jalapeño peppers, tomatillos, onion, garlic, cilantro, oregano, pumpkin seeds and stock until smooth. Pour the mole into a large saucepan and bring to a boil. Reduce the heat to medium, season with salt, then add the pieces of short rib meat and cook over low heat until the meat is heated through, about 10 minutes, stirring occasionally.",
    "Serve the short ribs over rice, garnished with cilantro and toasted pumpkin seeds, if desired."
  ],
  "ingredients": [
    "0",
    "3 pounds bone-in short rib slab",
    "8 cups water",
    "1 tablespoon chile powder",
    "4 teaspoons salt",
    "8 cloves garlic, peeled",
    "2 poblano peppers, seeded",
    "1 jalapeño pepper, stemmed",
    "½ pound (3 large) tomatillos, husked and roughly chopped",
    "½ yellow onion, peeled and roughly chopped",
    "3 garlic cloves",
    "1 cup loosely packed cilantro sprigs, plus more for garnish",
    "2 tablespoons oregano leaves",
    "¾ cup pumpkin seeds, toasted, plus more for garnish",
    "1 cup chicken stock",
    "Salt, to taste",
    "Cooked rice, to serve"
  ],
  "__v": 1
}