{
  "hash": "c498a391ccab2e3029bb5c99f020abd5391ee55b",
  "title": "Gluten Free Vegan Cinnamon RollsHemp Cashew \"Cream Cheese\" Frosting",
  "image": "http://i2.wp.com/willfrolicforfood.com/wp-content/uploads/2015/09/gluten-free-vegan-cinnamon-rolls-cream-cheese-frosting-8482.jpg?resize=685%2C1028",
  "href": "http://willfrolicforfood.com/2015/09/gluten-free-vegan-cinnamon-rolls-with-hemp-cashew-cream-cheese-frosting.html",
  "extension": "",
  "firstAdded": "2015-11-12T01:35:00.988000",
  "users": [
    null
  ],
  "keywords": [
    "coconut",
    "sugar",
    "cinnamon",
    "nutmeg",
    "allspice",
    "salt",
    "oil",
    "almond",
    "meal",
    "arrowroot",
    "flour",
    "mochiko",
    "white",
    "rice",
    "sorghum",
    "baking",
    "soda",
    "psyllium",
    "husk",
    "work",
    "milk",
    "apple",
    "cider",
    "vinegar",
    "lemon",
    "juice",
    "vanilla",
    "hemp",
    "cashew",
    "cream",
    "cheese",
    "frosting",
    "cashews",
    "soaked",
    "overnight",
    "hours",
    "hearts",
    "maple",
    "syrup"
  ],
  "directions": [
    "0",
    "Preheat the oven to 425F.",
    "Grease a 9\" glass baking pan lightly with coconut oil (I used a pie pan). Set aside.",
    "In a medium mixing bowl, whisk together the coconut sugar, cinnamon, nutmeg, cloves, allspice, and sea salt. Stir in the melted coconut oil, working it in until the sugar becomes sandy and moist. Set aside.",
    "In a large mixing bowl, whisk together the almond meal, arrowroot, sweet white rice flour, 1½ cups sorghum flour, baking powder, baking soda, psyllium, ¼ cup coconut sugar, and sea salt. Mix evenly.",
    "In a separate mixing bowl (I like to do this all in my 2-cup glass measuring cup), combine the almond milk and the acid (vinegar or lemon juice). Set aside to curdle, about 5-8 minutes.",
    "Once curdled, add the vanilla extract and 2 tablespoons of melted coconut oil.",
    "Add the wet mix to the dry flour mix and fold everything together until just incorporated.",
    "Set aside for 10-12 minutes (this gives the psyllium time to moisten which activates its binding powers).",
    "Cover a surface with about 20 inches of parchment paper. Add ¾ cups sorghum flour to the parchment paper and spread it out.",
    "Scrape the sticky cinnamon roll pastry out onto the floured parchment paper.",
    "Using the edges of the parchment paper when you press into the dough, gently knead the flour into the pastry until all of the flour is incorporated.",
    "Using another rectangle of parchment paper on top of the mound of dough, flatten the pastry out into a 9\" by 13\" rectangle (approximately). You want it at about 1\" thickness. I like to use a rolling pin to make it really even, but you could also press it out with your hands.",
    "Remove the parchment paper from over top of the pastry.",
    "Evenly sprinkle the sandy spiced coconut sugar mixture over the pastry. At this point, I like to place that rectangle of parchment paper back over the pastry and press the sugar into the dough by rolling over it gently with the rolling pin. I think this makes rolling the pastry into a tight log easier.",
    "Remove the parchment paper from the top of the pastry and discard it.",
    "Roll the pastry into a log, starting at the short end. Keep the log as tight as possibly while you roll it.",
    "Working quickly, cut the log into 2\" wide rounds using a sharp, wide knife. I use the wide edge of the knife to transfer each round to the greased glass pan, cut side up (so the end pieces look pretty).",
    "The rolls will all fit snugly together in the pan.",
    "Bake for 18-20 minutes. At 10 minutes, remove the cinnamon rolls and brush with the 2 remaining tablespoons of coconut oil. Place back in the oven and continue to bake until the cinnamon rolls are golden brown and bubbly.",
    "If not frosting, let cool at least 15 minutes before digging in.",
    "If frosting, let cool until gently warm to the touch. Then frost and serve.",
    "Store covered in the refrigerator up to 2 days. Best served warm.",
    "1",
    "Drain the cashews of the soaking liquid.",
    "Combine all ingredients in the bowl of a high powered blender: cashews, hemp hearts, maple syrup, coconut oil, vanilla extract, and unsweetened almond milk.",
    "Blend on high until the frosting is smooth and creamy.",
    "Frost away!"
  ],
  "ingredients": [
    "0",
    "¾ cups coconut sugar",
    "2 teaspoons ground cinnamon",
    "⅛ teaspoon freshly ground nutmeg",
    "½ teaspoon ground cloves",
    "½ teaspoon allspice",
    "pinch fine sea salt",
    "2 tablespoons coconut oil, melted",
    "1",
    "½ cup almond meal",
    "½ cup arrowroot flour",
    "¾ cups mochiko sweet white rice flour",
    "1½ cups sorghum flour + ¾ cups",
    "1½ teaspoons baking powder",
    "¼ teaspoon baking soda",
    "2 teaspoons psyllium husk (whole or powdered both work)",
    "¼ cup coconut sugar",
    "pinch fine sea salt",
    "1½ cups unsweetened almond milk",
    "1 tablespoon apple cider vinegar or lemon juice",
    "1 teaspoon vanilla extract",
    "4 tablespoons coconut oil, melted",
    "Hemp Cashew \"Cream Cheese\" Frosting",
    "2",
    "½ cup cashews, soaked overnight or at least 8 hours",
    "¼ cup hemp hearts",
    "2 tablespoons maple syrup",
    "2 teaspoons coconut oil",
    "½ teaspoon vanilla extract",
    "¼ cup unsweetened almond milk"
  ],
  "__v": 1
}