{
  "hash": "c3a47ab236e0e3ecb52d5f6a86a19d760e11350f",
  "title": "Roasted Tomato Basil Soup",
  "image": "http://www.cookingclassy.com/wp-content/uploads/2015/07/roasted-tomato-soup10-srgb..jpg",
  "href": "http://www.cookingclassy.com/roasted-tomato-basil-soup/",
  "extension": "Chrome",
  "firstAdded": "2016-11-30T04:53:28.931000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 425 degrees. Place tomatoes on a rimmed baking sheet and toss with 3 Tbsp olive oil then season with salt and pepper (place Roma halves cut side upright). Place onion slices and garlic on a rimmed half sheet and toss brush with remaining 1 1/2 Tbsp olive oil on all sides, sprinkle with salt and pepper. Place baking sheet with tomatoes and half sheet with onions in oven side by side and roast onions 30 - 35 minutes until edges are golden, and tomatoes 40 - 45 minutes until golden. Peel away any burnt papery layers of onions if there are any. Pull peels from tomatoes (I didn't do this with mine but later wished I would have so I'd recommend it so the soup isn't loaded with peels. If you want some peel then I'd peel at least half). Pour onions and tomatoes into a large pot. Add 4 cups vegetable broth and the basil. Season with salt and pepper to taste. Bring to a boil then reduce heat and simmer 20 minutes, adding an additional 1 cup vegetable broth to thin as desired. Blend soup with an immersion blender or in small batches in a blender (only fill blender half full). Serve warm topped with grilled cheese croutons if desired.",
    "Recipe source: inspired by Tyler Florence"
  ],
  "ingredients": [
    "0",
    "2 1/4 lbs Roma tomatoes, halved lengthwise",
    "1 1/4 lbs Cherry tomatoes",
    "4 1/2 Tbsp olive oil",
    "Salt and freshly ground black pepper",
    "8 cloves garlic, peeled and left whole",
    "2 small yellow onions, sliced just under 1/2-inch thick",
    "2 cups (32g) lightly packed fresh basil leaves",
    "4 - 5 cups vegetable broth",
    "Grilled cheese croutons (optional), see notes"
  ],
  "__v": 1
}