{
  "__v": 2,
  "directions": [
    "0",
    "Place 1 cup of quinoa, 2 cups of water, and 1/2 teaspoon of salt in a medium saucepan. Bring to a boil, cover, reduce to a simmer and cook for 15 minutes. Remove from heat and let sit for 10 minutes, covered. Spread cooked quinoa out in a baking dish to cool quickly.",
    "Bring 3 quarts of water to a boil. Add 2 teaspoons of salt to the water. Cut the top 1/2 to 1 inch off of the bell peppers and remove the core and seeds inside. (If you want, you can finely chop the pieces of good bell pepper you've removed and include them in the stuffing, otherwise, save them for another use.) Place the bell peppers in the boiling water for 3 minutes to par-cook them. After 3 minutes, carefully remove them from the boiling water and place the bell peppers in a rimmed baking dish, cut side up.",
    "In a large bowl mix the cooked quinoa, drained black beans, 2 cups of the grated cheddar cheese, most of the green onion (save some for topping), cumin, and cilantro if using.",
    "Stuff the bell peppers with the stuffing you've prepared. You should have plenty of stuffing, you can pack it and mound the stuffing in the peppers. Place 1/4 cup of water at the base of the peppers.",
    "Cover with aluminum foil. Bake at 350°F for 35 minutes. Then remove from oven, uncover, top with the remaining 2 cups of cheese, and return to the oven to cook, uncovered, until the cheese has melted about 5 to 10 minutes.",
    "Sprinkle with remaining finely sliced green onions to serve."
  ],
  "firstAdded": "2014-10-12T03:56:17.305000",
  "hash": "91b400e5b6e0bbdde9f869941ad81647466419c0",
  "href": "http://www.simplyrecipes.com/recipes/cheesy_quinoa_black_bean_stuffed_bell_peppers/",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2014/09/quinoa-stuffed-bell-peppers-640-dm-600x400.jpg",
  "ingredients": [
    "0",
    "1 cup uncooked quinoa (white or red or both)",
    "Salt",
    "6 large bell peppers, any color",
    "1 15-ounce can black beans, drained",
    "4 cups grated sharp cheddar cheese, 2 cups for stuffing, 2 cups for topping",
    "3 to 4 green onions, finely sliced",
    "1 teaspoon ground cumin",
    "1/2 cup loosely packed chopped fresh cilantro (optional)"
  ],
  "keywords": [
    "uncooked",
    "quinoa",
    "white",
    "red",
    "salt",
    "bell",
    "peppers",
    "color",
    "black",
    "beans",
    "sharp",
    "cheddar",
    "cheese",
    "stuffing",
    "green",
    "onions",
    "cumin",
    "loosely",
    "cilantro"
  ],
  "title": "Cheesy Quinoa Black Bean Stuffed Bell Peppers (1h/s5)",
  "users": [
    null
  ]
}