{
  "hash": "93dae0de793752d8a5c6a48bed6c64517c0b21dc",
  "title": "Sarah",
  "image": "http://www.asaucykitchen.com/wp-content/uploads/2016/06/Tomato-Garlic-Chicken_.jpg",
  "href": "http://www.asaucykitchen.com/tomato-basil-garlic-chicken/",
  "extension": "Chrome",
  "firstAdded": "2017-02-07T00:05:28.361000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cover the chicken with plastic wrap and pound each piece to an even thickness all around, about one inch or so in the thickest parts. This will help the chicken cook faster and more evenly. I like to use the bottom of a sauce pan to pound the chicken. Once done, sprinkle each side with a little salt and pepper.",
    "Add 1 tablespoons of the olive oil to a large skillet, until warm. Add the chicken and pan fry each side for several minutes until browned.",
    "Once the chicken is cooked through and browned remove it from the skillet and set aside on a separate plate for the time.",
    "Using the same skillet add the rest of the olive oil and being sautéing the onion until it becomes soft, about 5 minutes. Then add the garlic and sautee for another minute or so. Add the tomatoes and basil to the skillet and season with the salt, pepper, and red pepper flakes.",
    "Simmer for about 10 minutes until the sauce thickens and reduces. Make sure to stir occasionally.",
    "Add the chicken back to the skillet along with the zoodles to soak in the sauce a few minutes before. serving."
  ],
  "ingredients": [
    "0",
    "1 lb. boneless skinless chicken breasts",
    "2 tablespoons olive oil",
    "1/2 yellow onion, diced",
    "3 garlic cloves, minced",
    "14.5 ounce can tomato sauce with whole tomatoes (or 5-6 large tomatoes)",
    "one handful fresh basil, loosely packed, cut into ribbons (about 1 cup loosely packed)",
    "1/4 teaspoon crushed red pepper flakes",
    "4 medium zucchini (courgette), spiralized into spaghetti-like noodles",
    "salt & pepper to taste"
  ],
  "__v": 1
}