{
  "hash": "d99f8182919aa4f0c7a899dbe17845e4e2d4208e",
  "title": "Creamy Chicken Piccata",
  "image": "http://www.cookingclassy.com/wp-content/uploads/2016/01/creamy_chicken_piccata5..jpg",
  "href": "http://www.cookingclassy.com/creamy-chicken-piccata/",
  "extension": "Chrome",
  "firstAdded": "2017-07-05T23:56:40.593000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "After cutting chicken let it rest at room temperature 10 minutes. In a shallow dish whisk together flour, 1/4 tsp salt and 1/4 tsp pepper. Heat olive oil in a 12-inch skillet over medium-high heat. Dredge both sides of chicken cutlets in flour mixture then add to skillet. Sear chicken, without moving, until browned on bottom, about 4 - 5 minutes then rotate chicken breasts halves and cook opposite side until golden brown on bottom and chicken has cooked through (reducing burner temperature slightly as needed and tilting pan slightly to redistribute oil) about 4 - 5 minutes longer (chicken should register 165 degrees in center). Transfer chicken to a plate and keep warm.",
    "Add garlic to remaining oil in pan (there should be about 1 tsp oil left if not just add a tsp), saute just until slightly golden. Pour in 1 1/4 cups chicken broth and bring to a boil, while scrapping up browned bits from bottom of pan. Allow broth to simmer until reduced by half, about 4 - 5 minutes. Whisk together remaining 1 Tbsp chicken broth with cornstarch, then pour mixture into broth in skillet along with lemon juice. Allow to simmer until thickened slightly then remove from heat, stir in butter and pour in cream. Season with pepper. Return chicken to skillet. Spoon sauce over chicken, sprinkle with capers and parsley. Serve warm."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 (10 - 11 oz each) chicken breasts, butterflied and halved",
    "1/3 cup all-purpose flour",
    "Salt and freshly ground black pepper",
    "2 1/2 Tbsp olive oil",
    "1 Tbsp minced garlic",
    "1 1/4 cups + 1 Tbsp low-sodium chicken broth",
    "1 1/2 tsp cornstarch",
    "2 Tbsp fresh lemon juice",
    "1 Tbsp butter",
    "1/4 cup heavy cream",
    "3 Tbsp chopped fresh parsley",
    "2 Tbsp capers , rinsed (optional"
  ],
  "__v": 1
}