{
  "hash": "891e62002660e35e57de2bd9c48027e74461188c",
  "title": "Applesauce",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2008/10/applesauce-vertical-dm.jpg",
  "href": "http://www.simplyrecipes.com/recipes/applesauce/",
  "extension": "Chrome",
  "firstAdded": "2015-10-10T21:42:30.847000",
  "users": [
    null
  ],
  "keywords": [
    "lbs",
    "depending",
    "size",
    "cored",
    "use",
    "apples",
    "varieties",
    "good",
    "cooking",
    "granny",
    "smith",
    "pippin",
    "gravenstein",
    "mcintosh",
    "fugi",
    "jonathan",
    "jonagold",
    "golden",
    "strips",
    "lemon",
    "peel",
    "peeler",
    "strip",
    "lengths",
    "zest",
    "pith",
    "juice",
    "cinnamon",
    "dark",
    "brown",
    "sugar",
    "white",
    "water",
    "salt"
  ],
  "directions": [
    "0",
    "1 Place the peeled, cored, and quartered apples into a large pot. Add the strips of lemon peel, the lemon juice, cinnamon stick, sugars, water and salt. (You might want to start with half the sugar at this point and add more to taste later.) Bring to a boil on high heat, then lower the temperature, cover the pot, and maintain a low simmer for 20-30 minutes, until the apples are completely tender and cooked through.",
    "2 Once the apples are cooked through, remove the pot from the heat. Remove the lemon peels and the cinnamon stick. Use a potato masher to mash the cooked apples in the pot to make a chunky applesauce. For a smoother applesauce you can either run the cooked apples through a food mill, or purée them in a blender. (If you use a blender, do small batches and do not fill the blender bowl more than halfway.)",
    "Add more sugar to taste. If too sweet, add more lemon juice.",
    "This applesauce is delicious either hot or chilled. It pairs well with pork chops for savory dishes, it's terrific with cottage cheese as a snack or light lunch, and it's great with vanilla ice cream or yogurt.",
    "Freezes well and will last at least a year in a cold freezer."
  ],
  "ingredients": [
    "0",
    "3 to 4 lbs of apples (about 7 to 10 apples, depending on the size), peeled, cored, and quartered* (use apples varieties that are good for cooking such as Granny Smith, Pippin, Gravenstein, Mcintosh, Fugi, Jonathan, Jonagold, or Golden Delicious)",
    "4 strips of lemon peel (use a vegetable peeler to strip 4 lengths, zest only, not the pith)",
    "3 to 4 Tbsp lemon juice (more or less to taste)",
    "3 inches of cinnamon stick",
    "1/4 cup of dark brown sugar",
    "Up to 1/4 cup of white sugar",
    "1 cup of water",
    "1/2 teaspoon of salt"
  ],
  "__v": 1
}