{
  "hash": "8aeb5cf56bdaa9b6c388095ad63c850c17a3a7f3",
  "title": "Empanadas",
  "image": "//static.smaker.pl/photos//1/d/7/1d7d6c2b749af9f4db03aa7af2e403d2_220739_5485c0422b01c_wm.jpg",
  "href": "http://smaker.pl/przepis-empanadas,48194,patusia5.html",
  "extension": "",
  "firstAdded": "2016-09-16T21:52:53.189000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Ciasto: wszystkie składniki zagniatamy w ciasto, powinno być gładkie i ładnie odchodzić od stolnicy. W razie potrzeby podsypywać mąką w czasie zagniatania. Ciasto owijamy w folię spożywczą i wkładamy na godzinę do lodówki (u mnie schładzało się całą noc).",
    "Farsz: cebulę i czosnek siekamy drobno, papryki czyścimy z nasion, myjemy i kroimy w drobną kostkę, pomidora sparzamy, obieramy ze skórki i kroimy w kostkę. Cebulę i czosnek podsmażamy na łyżce oliwy, dodajemy papryki i chwilę dusimy. Następnie dodajemy mięso i smażymy kilka minut. Mięso najlepiej ugniatać widelcem, aby pozbyć się dużych grudek. Następnie dodajemy pomidora, lekko posiekane rodzynki i przyprawy. Mieszamy i całość dusimy, aż woda z warzyw odparuje. Farsz nie może być mokry. Odstawiamy do przestudzenia.",
    "Ciasto rozwałkowujemy na grubość około 5mm, wykrawamy koła o średnicy około 14cm. Na każdy krążek nakładamy farsz i sklejamy pierogi. Boki ładnie dociskamy widelcem. Pierogi układamy na blaszce wyłożonej papierem do pieczenia, smarujemy roztrzepanym żółtkiem z wodą, obsypujemy ziarnami sezamu. Pierożki wstawiamy do nagrzanego do 180 stopni piekarnika. Pieczemy około 30 minut. Można podawać na ciepło lub zimno jako przekąskę lub jako danie główne z dowolną surówką."
  ],
  "ingredients": [
    "0",
    "Empanadas to pierożki bardzo popularne w Ameryce Południowej, zwłaszcza w Argentynie i Chile. Do ich zrobienia można wykorzystać ciasto podobne do francuskiego, pierogowego lub chlebowego. Nadziewane są mięsnym farszem z warzywami lub serem, mogą być smażone w oleju lub pieczone w piekarniku. U mnie dzisiaj empanadas z kruchego ciasta na bazie serka kremowego, nadziewane farszem mięsno-warzywnym. Polecam!!",
    "Składniki",
    "Na ciasto:",
    "250g mąki pszennej",
    "200g masła",
    "200g kremowego serka twarogowego (u mnie Philadelphia)",
    "3/4 łyżeczki soli",
    "pół łyżeczki słodkiej papryki",
    "Na farsz:",
    "30dkg mięsa mielonego (dowolnego)",
    "2 średnie papryki (najlepiej różnokolorowe)",
    "1 cebula",
    "2 ząbki czosnku",
    "1 duży pomidor",
    "garśc rodzynek",
    "sól, pieprz cayenne",
    "DODATKOWO:",
    "żółtko + łyżka wody",
    "ziarna sezamu"
  ],
  "__v": 1
}