{
  "hash": "cb5c0176b55c2f890611bfccbd4cdf87be60cb6d",
  "title": "acorn squash quesadillas + tomatillo salsa",
  "image": "http://farm4.static.flickr.com/3287/2918219047_e676f29ecf.jpg",
  "href": "http://smittenkitchen.com/blog/2008/10/acorn-squash-quesadillas-tomatillo-salsa/",
  "extension": "Chrome",
  "firstAdded": "2015-09-04T20:59:32.447000",
  "users": [
    null
  ],
  "keywords": [
    "smallmedium",
    "acorn",
    "squash",
    "oil",
    "white",
    "onion",
    "jalapeno",
    "clove",
    "garlic",
    "poblano",
    "chiles",
    "roasted",
    "strips",
    "salt",
    "pepper",
    "flour",
    "tortillas",
    "cheese",
    "blend",
    "used",
    "muenster",
    "mexican",
    "worked",
    "great",
    "butter",
    "frying",
    "quesadillas",
    "garnishes",
    "julienned",
    "radishes",
    "crema",
    "sour",
    "cream",
    "andor",
    "salsa",
    "verde",
    "cruda",
    "recipe"
  ],
  "directions": [
    "0",
    "First, roast the acorn squash. Preheat the oven to 400° and lightly oil a baking sheet. Halve the squash, scoop out the seeds (you can save them to toast later, if you wish) and cut each half into half-inch slices. Lay them on the baking sheet and roast for about 20 minutes, until soft but not cooked to mush. (You’ll finish it in the pan.)",
    "When cool enough to work with, use a paring knife or your hands to peel the skin off each slice. Lightly chop the squash and put it in a bowl.",
    "Saute the onions, garlic and jalapeno in the oil until translucent. Add the poblano strips and cook for a couple minutes more. Add the squash and cook for another 5 or 10 minutes, until the squash is tender and the flavors have melded. Season with salt and pepper and take off heat.",
    "Spread a few tablespoons of the cooked squash mixture onto one half of a 10-inch flour tortilla. Sprinkle with a couple tablespoons of the cheese. Fold over and place in a hot pan with melted butter, and fry until crispy. Cut the finished quesadilla into four triangles and top with your choice of garnishes. Eat while warm."
  ],
  "ingredients": [
    "0",
    "1 small/medium acorn squash",
    "4 tablespoons vegetable oil",
    "3 tablespoons diced white onion",
    "1 tablespoon minced jalapeno",
    "1 clove garlic, minced",
    "2 poblano chiles, roasted, peeled and cut into strips",
    "Salt and pepper to taste",
    "10-inch flour tortillas",
    "1 cup shredded Mexican cheese blend of your choice (I used Muenster, not Mexican but worked great!)",
    "Butter for frying quesadillas",
    "Garnishes: Julienned radishes, crema or sour cream and/or salsa verde cruda (recipe below)"
  ],
  "__v": 1
}