{
  "hash": "fec2aee716a240e7add283718a2b036ea04f6384",
  "title": "LEMON POLENTA CAKE",
  "image": "http://assets.nigella.com/uploads/b840fa5c530094a5e6ac882851c10ce7/main.jpg",
  "href": "http://www.nigella.com/recipes/view/LEMON-POLENTA-CAKE-5308",
  "firstAdded": "2015-01-30T11:21:38.563000",
  "users": [
    null
  ],
  "keywords": [
    "soft",
    "unsalted",
    "butter",
    "greasing",
    "caster",
    "sugar",
    "almonds",
    "polenta",
    "cornmeal",
    "baking",
    "eggs",
    "zest",
    "lemons",
    "save",
    "juice",
    "syrup",
    "icing"
  ],
  "directions": [
    "0",
    "Line the base of a 23cm / 9inch springform cake tin with baking parchment and grease its sides lightly with butter.",
    "Preheat the oven to 180°C/gas mark 4/ 350°F.",
    "Beat the butter and sugar till pale and whipped, either by hand in a bowl with a wooden spoon, or using a freestanding mixer.",
    "Mix together the almonds, polenta and baking powder, and beat some of this into the butter-sugar mixture, followed by 1 egg, then alternate dry ingredients and eggs, beating all the while.",
    "Finally, beat in the lemon zest and pour, spoon or scrape the mixture into your prepared tin and bake in the oven for about 40 minutes.",
    "It may seem wibbly but, if the cake is cooked, a cake tester should come out cleanish and, most significantly, the edges of the cake will have begun to shrink away from the sides of the tin. remove from the oven to a wire cooling rack, but leave in its tin.",
    "Make the syrup by boiling together the lemon juice and icing sugar in a smallish saucepan.",
    "Once the icing sugar’s dissolved into the juice, you’re done.",
    "Prick the top of the cake all over with a cake tester (a skewer would be too destructive), pour the warm syrup over the cake, and leave to cool before taking it out of its tin."
  ],
  "ingredients": [
    "0",
    "200 grams soft unsalted butter (plus some for greasing)",
    "200 grams caster sugar",
    "200 grams ground almonds",
    "100 grams fine polenta (or cornmeal)",
    "1 ½ teaspoons baking powder (see NOTE below)",
    "3 large eggs",
    "zest of 2 lemons (save juice for syrup)",
    "1",
    "juice of 2 lemons",
    "125 grams icing sugar"
  ],
  "__v": 1
}