{
  "hash": "6f6f5c76a61b8b5c78918dd67724876439378f12",
  "title": "Peach Mousse",
  "image": "http://natashaskitchen.com/wp-content/uploads/2016/08/Peach-Mousse-Cups-6-600x900.jpg",
  "href": "http://natashaskitchen.com/2016/08/12/peach-mousse-recipe/",
  "extension": "Chrome",
  "firstAdded": "2016-08-16T03:10:55.328000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "How To Make Peach Mousse Cups:",
    "Peel and dice peaches (you should have 3 cups diced), transfer to a blender or food processor, add 2 Tbsp lemon juice right away to keep from discoloring and blend until pureed. Keep puree in the blender jar until ready to use.",
    "In a small sauce pan (off the heat), add ¼ cup cold water and sprinkle top with 1 Tbsp gelatin. Let sit 5 minutes to soften then stir in ⅓ cup sugar and place over medium heat, stirring just until sugar has dissolved (1 to 2 min) then remove from heat - don't overcook.",
    "Add gelatin mixture to the fruit puree and blend until well combined. Cover with lid and chill in refrigerator until mixture begins to thicken (2 hours).",
    "Once puree starts to thicken, beat 1 cup heavy whipping cream until stiff peaks form. Fold whipped cream into fruit mixture, mixing until smooth. Divide evenly between 6 ramekins or serving glasses and refrigerate until set.",
    "How to Make Peach Topping:",
    "In a small saucepan, combine sliced peach, 2 tablespoons sugar and 1 Tbsp lemon juice. Place over med/high heat and stir to dissolve sugar. Bring to a boil over medium-high heat and simmer 2 minutes. Remove from heat and cool completely before spooning it over your peach mousse. Garnish with mint if desired."
  ],
  "ingredients": [
    "0",
    "For the Peach Mousse:",
    "1 lb ripe peaches, peeled, diced",
    "2 Tbsp fresh lemon juice",
    "¼ cup cold water",
    "1 Tbsp unflavored gelatin (I used Knox brand)",
    "⅓ cup granulated sugar",
    "1 cup heavy whipping cream",
    "Garnish/ Peach Topping:",
    "1 ripe peach, peeled and thinly sliced",
    "1 Tbsp fresh lemon juice",
    "2 Tbsp granulated sugar",
    "mint leaves, optional"
  ],
  "__v": 1
}