{
  "hash": "8600cbdd3b78a7ddce7d5faed011a46f41c16cd1",
  "title": "Copycat Disneyland Monte Cristo Sandwiches",
  "image": "http://thekitchenmagpie.kqxq60gkbj86iutfm5qv.netdna-cdn.com/wp-content/uploads/images/2013/09/disneylandmontecristo11.jpg",
  "href": "http://www.thekitchenmagpie.com/copycat-disneyland-monte-cristo-sandwiches",
  "extension": "Chrome",
  "firstAdded": "2016-06-27T22:27:32.065000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Sift together the flour, sugar, baking powder and salt.",
    "In a separate bowl, combine the milk and egg thoroughly.",
    "Add the egg mixture to the dry ingredients and combine until there are no lumps. The batter should be fairly runny, yet still thick enough to stick to the sandwich.If needed, add a teensy bit more milk.",
    "Make the sandwiches by layering a slice of swiss cheese, then the 4 meat slices, then swiss cheese, top with the remaining slice of bread. Putting cheese on either side of the meat ensures a beautiful melty goodness when you are done!",
    "Leave the sandwiches whole for frying, as you lose the cheesy goodness inside otherwise. Only slice them after they are cooked up!",
    "Place a toothpick on each corner of the sandwich.",
    "Dip the whole sandwich in the batter, covering the surface completely and fry in 340 degrees F oil until golden. The Texas toast will take longer to heat up the inside, thus the lower frying temperature. If you are using normal bread, you can go up to around 360 degrees F for frying.",
    "Remove and drain on paper towels.",
    "Remove the toothpicks and sprinkle with powdered sugar if desired.",
    "If you want the real Disney deal, dip your sandwich in raspberry jam!"
  ],
  "ingredients": [
    "0",
    "Sweet Batter Ingredients:",
    "1 cup flour",
    "2 tsp. baking powder",
    "1 large egg",
    "¾ cup of milk",
    "¼ tsp. salt",
    "2 tablespoons sugar",
    "Sandwich Ingredients:",
    "8 slices Swiss cheese",
    "8 slices Turkey",
    "8 slices Ham",
    "8 slices Texas Style White Bread or any square formed white bread",
    "Vegetable Oil - an inch deep in a large skillet",
    "Powdered Sugar",
    "Raspberry jam for dipping"
  ],
  "__v": 1
}