{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 450 degrees and grease two donut pans (if you have one, just bake them in 2 batches). Set aside.",
    "In a large bowl, whisk together cake flour, sugar, cocoa powder, baking powder, and salt.",
    "In another bowl, combine sour cream, eggs, vanilla extract, and milk. Whisk well to incorporate.",
    "Pour the wet ingredients in with the dry ingredients and whisk or mix together with a spoon until well incorporated.",
    "Evenly divide batter amongst the donut wells. Bake for 9 minutes then remove and let cool completely on wire cooling rack.",
    "While donuts are cooling, make your icing.",
    "In a saucepan over medium heat, melt butter and brown sugar together then add cream and vanilla extract. Let mixture gently bubble and caramelize for 5-7 minutes. Whisk in powdered sugar (you might want to sift it in). Stir until mixture is thick, you may need to add more than ⅓ cup. You'll want the mixture to be kind of thick so let it sit on the heat until the consistency thickens on the back of your spatula. Remove from heat and as it cools, it'll thicken up some more. Don't let it get too thick that when you dunk the donuts in, the donut top gets ripped off.",
    "Take a donut and dip the top of it in the icing. Immediately sprinkle kosher salt on top and set aside to cool. You might want to put parchment paper under your wire rack so the extra icing can drip on there.",
    "Store in an airtight container for up to 3 days."
  ],
  "firstAdded": "2014-07-20T19:14:57.423000",
  "hash": "7185d3e7afe00ba79c424c39e416db8910425573",
  "href": "http://www.tablefortwoblog.com/chocolate-donuts-with-salted-caramel-icing/",
  "image": "http://www.tablefortwoblog.com/wp-content/uploads/2012/10/chocolate-salted-caramel-donuts-tablefortwoblog-21.jpg",
  "ingredients": [
    "0",
    "For the donuts:",
    "2 cups cake flour",
    "⅔ cup sugar",
    "⅓ (heaping) cup cocoa powder",
    "2 tsp. baking powder",
    "¾ tsp. salt",
    "½ cup sour cream",
    "2 large eggs",
    "½ tsp. vanilla extract",
    "¾ cup + 2 tbsp. milk",
    "For the caramel icing:",
    "2 cups light brown sugar",
    "3 tbsp. unsalted butter",
    "¼ cup + 2 tbsp. cream",
    "2 tsp. vanilla extract",
    "⅓ cup powdered sugar",
    "Kosher salt, for topping"
  ],
  "keywords": [
    "donuts",
    "cake",
    "flour",
    "sugar",
    "heaping",
    "cocoa",
    "baking",
    "salt",
    "sour",
    "cream",
    "eggs",
    "vanilla",
    "milk",
    "caramel",
    "icing",
    "light",
    "brown",
    "unsalted",
    "butter",
    "kosher"
  ],
  "title": "Chocolate Donuts with Salted Caramel Icing",
  "users": [
    null
  ]
}