{
  "hash": "cb53f9f439b2b91220ab2b7e9be15d8fc3fc1eac",
  "title": "Mushroom bourguignon",
  "image": "//img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/58393574.jpg?tr=w-414,",
  "href": "https://www.jamieoliver.com/recipes/mushroom-recipes/mushroom-bourguignon/",
  "extension": "Firefox",
  "firstAdded": "2018-12-16T22:10:26.021000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Put the shallots in a bowl and cover with hot water (this makes them easy to peel). Place the dried porcini in another bowl and cover with 150ml of boiling water, then set aside.",
    "Roughly chop the portobello mushrooms and halve any larger shiitake and chestnut mushrooms, leaving the small ones whole. Heat half of the butter with 1 tablespoon oil in a casserole pan over a medium heat. Fry the mushrooms in batches, until coloured but still firm, adding another tablespoon of oil between each batch. Tip the mushrooms into a bowl and set aside.",
    "Heat the remaining butter in the pan, peel the shallots, halving any larger ones, peel and cut the carrots into 2cm slices and fry for 8 minutes, or until the veg gets some colour, stirring occasionally. Peel and chop the garlic and add for the final 2 minutes.",
    "Add the thyme, bay and wine. Strain in the porcini liquid into the pan, roughly chop the porcini and add to the pan along with the tomato purée, then simmer for 25 minutes, or until the wine has reduced slightly and the veg are cooked through. Season to taste and fish out the thyme stalks and bay leaves.",
    "Stir the cooked mushrooms into the sauce along with any juices, heating through for a couple of minutes. Season and serve. Nice with some creamy mash on the side."
  ],
  "ingredients": [
    "0",
    "12 shallots",
    "25 g dried porcini mushrooms",
    "4 portobello mushrooms",
    "120 g shiitake mushrooms",
    "200 g chestnut mushrooms",
    "25 g unsalted butter",
    "olive oil",
    "2 large carrots",
    "2 cloves of garlic",
    "6 sprigs of fresh thyme",
    "2 fresh bay leaves",
    "500 ml red wine",
    "1 tablespoon tomato purée"
  ],
  "__v": 1
}