{
  "hash": "6806bbaf52211a3c9a042af1825303f487d1c747",
  "title": "SLOW-COOKED BEEF STROGANOFF",
  "image": "",
  "href": "http://goodfood.uktv.co.uk/recipe/slow-cooked-beef-stroganoff/",
  "extension": "Chrome",
  "firstAdded": "2016-01-04T15:33:14.770000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "mushrooms",
    "stewing",
    "beef",
    "cubes",
    "stock",
    "onions",
    "garlic",
    "dry",
    "white",
    "wine",
    "brandy",
    "double",
    "cream"
  ],
  "directions": [
    "0",
    "METHOD",
    "1. Preheat the oven to 150C/130C fan/gas 3.",
    "2. Heat 2 tablespoons of olive oil in a large ovenproof casserole and lightly fry the mushrooms in batches in the olive oil until golden brown. Tip onto a plate and set aside. Brown the meat in the same pan in small batches, adding more oil as necessary and removing each batch from the pan. Now fry the onions until softened and lightly coloured, adding the garlic towards the end and using a little more oil, if necessary.",
    "3. Pour 150ml of the stock into the pan and bring to the boil, stirring to deglaze. Return the mushrooms and meat to the pan, then pour in the wine, brandy and remaining stock. Add seasoning to taste, stir well and bring to a simmer. Cover with the lid, transfer to the oven and cook for 2-2½ hours or until the meat is tender.",
    "4. Make the beurre manié by putting the butter and flour onto a plate and mixing to a paste. Set aside.",
    "5. When the meat is cooked, carefully strain the cooking liquid into a saucepan. Keep the meat and mushrooms warm in the covered casserole. Pour the cream into the cooking liquid and boil, uncovered, for a few minutes until the sauce has reduced slightly and has a good flavour. Adjust the seasoning to taste, if necessary.",
    "6. With the liquid still boiling, add the beurre manié 1 teaspoon at a time and whisk vigorously until the sauce thickens slightly. Now pour the sauce over the meat and mushrooms and stir gently to mix. Keep the stroganoff warm until you are ready to serve."
  ],
  "ingredients": [
    "0",
    "4 tbsp olive oil",
    "500 g mushrooms, sliced",
    "1.5 kg stewing beef, cut into 3cm cubes",
    "350 ml beef stock",
    "3 onions, sliced",
    "2 cloves garlic, crushed",
    "150 ml dry white wine",
    "100 ml brandy",
    "300 ml double cream"
  ],
  "__v": 1
}