{
  "hash": "808d305128393250aca01670556067e198099248",
  "title": "Nigella Lawson's Dense Chocolate Loaf Cake",
  "image": "https://images.food52.com/BYP_hTg0cvqsg2zOS8EjA8X8tCo=/753x502/c6853174-7cb9-459d-bdda-79aec6352f50--food52_12-7-12-5324.jpg",
  "href": "https://food52.com/recipes/20091-nigella-lawson-s-dense-chocolate-loaf-cake",
  "extension": "Chrome",
  "firstAdded": "2016-12-12T17:41:51.685000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the oven to 375°F, put in a baking sheet in case of sticky drips later, and grease and line a 9x5-inch loaf pan. The lining is important as this is a very damp cake: use parchment or one of those loaf-pan-shaped paper liners.",
    "Cream the butter and sugar, either with a wooden spoon or with an electric hand-held mixer, then add the eggs and vanilla, beating in well. Next, fold in the melted and now slightly cooled chocolate, taking care to blend well but being careful not to overbeat. You want the ingredients combined: You don't want a light, airy mass.",
    "Then gently add the flour, to which you've added the baking soda, alternately spoon by spoon, with the boiling water until you have a smooth and fairly liquid batter. Pour into the lined loaf pan, and bake for 30 minutes. (Note: Don't let this batter come closer than 1 inch from the rim of the cake pan or it risks overflowing. Pour any excess into a smaller cake or muffin pan.)",
    "Turn the oven down to 325 degrees and continue to cook for another 15 minutes. The cake will still be a bit squidgy inside, so an inserted cake tester or skewer won't come out completely clean.",
    "Place the loaf pan on a rack, and leave to get completely cold before turning it out. (I often leave it for a day or so: like gingerbread, it improves.) Don't worry if it sinks in the middle: indeed, it will do so because it's such a dense and damp cake."
  ],
  "ingredients": [
    "0",
    "1 cup soft unsalted butter",
    "1 2/3 cups dark brown sugar",
    "2 large eggs, beaten",
    "1 teaspoon vanilla extract",
    "4 ounces best bittersweet chocolate, melted",
    "1 1/3 cups all-purpose flour",
    "1 teaspoon baking soda",
    "1 cup plus 2 tablespoons boiling water"
  ],
  "__v": 1
}