{
  "hash": "6dc9b5e0a831b88b6c8cb2805ff703b115ae0a71",
  "title": "Cider-Braised Pork with Apples & Thyme",
  "image": "http://content0.tastebook.com/content/photo/user_photo/dhtHSZfT13c223233353035323WfgVZzKU_1429258018.jpg",
  "href": "http://www.tastebook.com/recipes/4203564-Cider-Braised-Pork-with-Apples-Thyme",
  "extension": "Chrome",
  "firstAdded": "2015-04-17T14:26:33.792000",
  "users": [
    null
  ],
  "keywords": [
    "pork",
    "shoulder",
    "boston",
    "butt",
    "salt",
    "black",
    "pepper",
    "canola",
    "grapeseed",
    "oil",
    "firm",
    "apples",
    "gala",
    "fuji",
    "cored",
    "wedges",
    "divided",
    "allpurpose",
    "flour",
    "cinnamon",
    "hard",
    "cider",
    "butter",
    "thyme",
    "leaves",
    "zest",
    "juice",
    "lemon",
    "brown",
    "sugar",
    "commonly",
    "sold",
    "store",
    "ones",
    "butcher"
  ],
  "directions": [
    "0",
    "Directions",
    "1",
    "Pat the roast dry, and season generously with salt and pepper. Heat the oil in a heavy Dutch oven over medium heat and brown the roast well on all sides (this will take about 20 to 30 minutes). Remove the roast and set it aside.",
    "2",
    "Add half of the apples and the flour to the pot. Cook, stirring, 3 minutes. Add the cinnamon and cider, scraping up any browned bits. Season with salt and pepper. Add the roast, fat side up. Bring to a boil, reduce the heat and simmer slowly, covered, 3 hours, or until the meat is very tender. Remove the roast and cover with foil to keep warm.",
    "3",
    "Turn the heat up to medium-high. Boil the liquid, uncovered, until it is reduced by half (about 15 minutes).",
    "4",
    "Meanwhile, heat the butter in a large skillet over medium heat. Add the remaining apples, 2 teaspoons thyme, and lemon zest. Season with salt and pepper. Cook, turning the apples often, until the apples are tender and caramelized, about 15 minutes. Remove from the heat and stir in the lemon juice, brown sugar, and salt to taste.",
    "5",
    "When the sauce is reduced, puree it in a blender. Stir in the remaining 1 teaspoon fresh thyme leaves, and season to taste with salt and pepper. Serve the sliced or shredded pork with the sauce and sautéed apples."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "3- to 4-pound pork shoulder (Boston butt)",
    "Salt and freshly ground black pepper",
    "2 tablespoons canola or grapeseed oil",
    "4 pounds firm apples (such as Gala or Fuji), cored and cut into wedges, divided",
    "1/4 cup all-purpose flour",
    "1/2 teaspoon cinnamon",
    "3 cups hard cider",
    "4 tablespoons butter",
    "3 teaspoons fresh thyme leaves, divided",
    "Zest and juice of half a lemon",
    "1 tablespoon brown sugar",
    "Note: Pork shoulder is commonly sold whole (7 to 8 pounds) or half (3 to 4 pounds). If your store has only the large ones, have the butcher cut one in half for you."
  ],
  "__v": 1
}