{
  "hash": "db720021aa511a84fc8373c55e698286ad7c239c",
  "title": "Thai Pumpkin and Coconut Soup",
  "image": "https://6dc9f5tvh5-flywheel.netdna-ssl.com/wp-content/uploads/2017/01/thai-pumpkin-and-coconut-soup-recipe.jpg",
  "href": "https://www.myorganizedchaos.net/2017/01/thai-pumpkin-and-coconut-soup",
  "extension": "Chrome",
  "firstAdded": "2019-09-15T20:16:15.049000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat oil in a saucepan at medium-high heat. Cook onion, for 5 minutes or until softened, make sure to stir occasionally.",
    "Add pumpkin and the potato to the pan and cook for about 5 minutes, stirring occasionally.",
    "Add the garlic. and still cook, stirring for 1 minute or until fragrant.",
    "Add the curry paste to pan and cook, stirring for about 2 minutes and the vegetables are coated all over.",
    "Add the stock, stirring to combine. Cover and then bring to the boil.",
    "Reduce heat to low and simmer for about 15 minutes.",
    "Remove the lid and allow the mixture to simmer for a 20-25 minutes longer, or until the vegetables are tender.",
    "Remove from heat. Stand for 5 minutes.",
    "Blend soup until smooth using a stick blender then return to medium heat and stir in 1 cup coconut milk. Season with pepper.",
    "Cook, stirring occasionally for 5 to 6 minutes or until heated through.",
    "While soup cooks, combine peanuts, coriander, green onion and lime juice in a small bowl. Ladle soup into bowls and serve drizzled with remaining coconut milk and with peanut mixture sprinkled on top.",
    "Enjoy!"
  ],
  "ingredients": [
    "0",
    "1 tablespoon vegetable oil",
    "1 medium onion chopped",
    "2.5 lb butternut squash, or butternut pumpkin as some call it peeled, chopped",
    ".25 lb white baby potatoes peeled, chopped",
    "2 garlic cloves crushed",
    "1/4 cup Thai red curry paste or curry powder",
    "2 1/2 cups chicken stock",
    "400 ml can coconut milk",
    "2 tablespoons unsalted roasted peanuts finely chopped",
    "2 tablespoons fresh coriander leaves chopped",
    "1 tbsp chives or green onion finely chopped",
    "2 teaspoons lime juice"
  ],
  "__v": 1
}