{
  "hash": "efa5275375b575b871a02920be4d282c39ad6901",
  "title": "Atkins Cloud Bread",
  "image": "https://s3.amazonaws.com/atk.sc.public.images.recipe/AtkinsCloudBread.png",
  "href": "https://www.atkins.com/recipes/atkins-cloud-bread/2287",
  "extension": "Chrome",
  "firstAdded": "2016-05-31T00:08:43.328000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS 1.8 grams Carbs",
    "Do not substitute other protein powders for the whey protein.",
    "Preheat oven to 325°F. Prepare a 5x9-inch loaf pan with aluminum foil and spray with oil. Alternatively a silicone pan or mold works great. Be sure all ingredients are at room temperature before starting.",
    "In the bowl of an electric mixer with a paddle attachment, beat the softened cream cheese with the softened butter until well mixed. Add the oil and coconut milk, blend until mixed then add the eggs one at a time until fully incorporated. Set aside.",
    "In a small bowl, whisk together the whey protein, baking powder, baking soda, cream of tartar, salt, and 1/2 tsp xanthan gum. Pour this mixture into the cream cheese and eggs and fold until fully incorporated. Do not over blend or the recipe may end up too dense.",
    "Bake for 45 minutes until it is golden brown on the top. Allow to sit in the pan for 10 minutes to cool then carefully remove from the pan to continue cooling on a wire rack. Cut into 10 thick slices, eat immediately or place in an airtight container for up to one week in the refrigerator. Toast in a toaster and enjoy with sugar-free jam. Each slice is one serving. This bread can easily be cut into 20 thin slices for making sandwiches.",
    "This recipe was adapted to fit the Atkins program from several different recipes including both the original Cloud Bread and the Soul Bread recipes."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "12 ozs Cream Cheese",
    "1/4 cup Unsalted Butter Stick",
    "1/4 cup Olive Oil",
    "1/4 cup Coconut Milk Unsweetened",
    "4 large Eggs (Whole)",
    "1 1/2 cups Vanilla Whey Protein",
    "1 1/2 tsps Baking Powder (Sodium Aluminum Sulfate, Double Acting)",
    "1/2 tsp Baking Soda",
    "1/4 tsp Cream Of Tartar",
    "1/2 tsp Salt",
    "1/2 tsp Xanthan Gum"
  ],
  "__v": 2
}