{
  "hash": "072b66952aefb886780c7d20ef4059312610ea75",
  "title": "Sweet and Sour Hawaiian Chicken Kabobs",
  "image": "",
  "href": "https://carlsbadcravings.com/hawaiian-chicken-kabobs-recipe/",
  "extension": "Chrome",
  "firstAdded": "2018-08-29T20:04:48.796000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Report this ad",
    "Note: If using wooden skewers, soak for at least 30 minutes in water before grilling or broiling.",
    "In a medium bowl, whisk Sweet and Tangy Marinade/Glaze ingredients together. Add 1/4 cup of this Marinade to a large freezer bag along with chicken and 3 tablespoons olive oil. Toss to evenly coat. Marinate in the refrigerator 1-4 hours.",
    "Add 2 tablespoons Marinade to a large bowl along with 2 tablespoons olive oil. Add pineapple and veggies and toss to coat. Refrigerate. Refrigerate remaining Glaze separately (\"Reserved Glaze\").",
    "When ready to cook, drain marinade from chicken and thread chicken, peppers and onions onto skewers.",
    "Add reserved Sweet and Tangy Glaze to a small saucepan and whisk in 1 teaspoon cornstarch. Bring to a boil (either on grill or stovetop) and simmer until slightly thickened, about 5 minutes (it will continue to thicken upon standing). Set aside.",
    "TO GRILL: Generously grease grill and heat to medium-high heat. Grill chicken kabobs for approximately 12-15 minutes, rotating every couple minutes until nicely browned and slightly charred on each side and chicken is cooked through. Brush kabobs with Sweet and Tangy Glaze.",
    "TO OVEN BROIL: Line a baking sheet with aluminum foil and lightly spray with nonstick cooking spray. Add the chicken kabobs in a single layer and broil, turning every 5 minutes until cooked through, about 10- 15 minutes"
  ],
  "ingredients": [
    "0",
    "Cuisine\tIndian",
    "Prep Time\t30 minutes",
    "Cook Time\t10 minutes",
    "Servings",
    "-12 kabobs",
    "INGREDIENTS",
    "2 pounds chicken breasts chopped into 1 1/2\" cubes (4-6 chicken breasts)",
    "1 fresh pineapple, chopped into 1 1/2” pieces",
    "1 red bell pepper, cut into 1 1/2 inch pieces",
    "1 green pepper, cut into 1 1/2 inch pieces",
    "1 onion, cut into chunks",
    "5 tablespoons olive oil divided",
    "1 teaspoon cornstarch",
    "Sweet and Tangy Marinade/Glaze",
    "1/4 cup canned pineapple juice*",
    "1/2 cup red wine vinegar",
    "3/4 cups sugar",
    "3 tablespoons ketchup",
    "1 tablespoon reduced sodium soy sauce",
    "1 teaspoon salt",
    "1/2 teaspoon garlic powder",
    "1/4 teaspoon ginger powder",
    "1/4 teaspoon red pepper flakes"
  ],
  "__v": 1
}