{
  "hash": "6b04a7a2532ad1fcbbc1479630f9567e0611deb8",
  "title": "Brown pasta with broad beans and rocket pesto",
  "image": "https://i.guim.co.uk/img/static/sys-images/Guardian/About/General/2015/5/19/1432031035606/Thomasina-Miers-brown-pas-009.jpg?w=300&q=55&auto=format&usm=12&fit=max&s=446bde3954893df6fb53c669a50c293f",
  "href": "https://www.theguardian.com/lifeandstyle/2015/may/23/rocket-pesto-avgolemono-vegetable-stew-recipes-thomasina-miers",
  "extension": "Chrome",
  "firstAdded": "2016-09-03T16:09:14.116000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Wash and dry the rocket. Toast the nuts in a dry frying pan on a medium heat until pale golden. Put them in a food processor, add the garlic, parmesan and rocket, and blitz to a paste. Squeeze in the lemon juice to loosen, add a few slugs of olive oil and blitz again to a smooth, vivid green puree. Add all but two tablespoons of the remaining oil, blitz briefly to combine and season to taste – it can take quite a bit, and add more lemon if you like.",
    "Bring a large pan of salted water to a boil, add the pasta and cook until al dente. Meanwhile, blanch the beans in simmering water for a few minutes, until tender. Drain the pasta, reserving a cup of the water, and toss the pasta and beans in a few generous tablespoons of pesto. Add two or three tablespoons of the pasta water, to bring the sauce together, season and add pesto to taste. At this stage, the pasta may be a touch dry, so add a splash more cooking water, if need be.",
    "Serve in bowls, drizzled with the remaining oil, a hunk of parmesan on the table for grating, and perhaps with a salad of baby gem, sprouting seeds, apple and shallots."
  ],
  "ingredients": [
    "0",
    "2 large handfuls rocket (about 100g)",
    "25g pine nuts",
    "60g hazelnuts",
    "1 fat clove garlic, peeled",
    "30g parmesan, plus extra to serve",
    "½ lemon",
    "200ml olive oil",
    "Salt and freshly ground black pepper",
    "400g wholewheat conchiglie (aka shell pasta)",
    "300g podded young broad beans (fresh or frozen)"
  ],
  "__v": 1
}