{
  "hash": "195306ba7e6aef8a7889c79786cf5086fa9db83a",
  "title": "GLUTEN FREE Pie Crust",
  "image": "https://www.makeit-loveit.com/wp-content/uploads/2015/07/perfect-no-fail-pie-crust-7.jpg",
  "href": "https://www.makeit-loveit.com/the-no-fail-gluten-free-pie-crust-thats-amazingly-delicious/",
  "extension": "Chrome",
  "firstAdded": "2017-10-11T16:10:43.402000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "First, you’ll want to sift all the dry ingredients — the tapioca flour, cornstarch, potato starch (make sure it is starch not flour), rice flour, xanthan gum, salt and sugar. Then cut in the butter and Crisco with a pastry cutter or fork.",
    "Cut the Crisco and butter until it becomes pea sized. Mix thoroughly together all the liquids (egg, vinegar, and ice water) in a separate bowl than add it to the butter mixture and mix well.",
    "It should look like this. Divide it into two balls if you are making large pies or divide into three balls for small pies. Cover with plastic wrap and chill in the refrigerator for at least an hour.",
    "After it has been chilled, roll our your ball between two sheets of plastic wrap.",
    "Roll it out until it is about 1 1/2 – 2 inches larger than your pie plate on all edges.",
    "Flip the dough onto your pie plate and roll the excess edges under until it meets the edge of the pie plate.",
    "Then you can make a pretty edge. Remember my mom’s request? Yep, take 2 minutes more and pretty up your crust!",
    "Just pinch the dough with your two fingers around your thumb and it gives a nice fluted edge. Repeat all the way around the edge. (Thanks for being my hand model, mom!)",
    "Now doesn’t that look pretty? Pay no attention to my patchwork on the far side. But that’s the beauty of this recipe….patchwork is totally allowed! (At this point you can go ahead and add your egg-based filling and skip the rest and put it in the oven. If it is a baked fruit filling, add before fluting the edges then roll out a top crust to cover and flute the top and bottom together and then send to the oven. Be sure to make vents on the top crust too!)",
    "Go ahead and prick the dough with a fork. This is to avoid bubbles and it helps it to keep its’ shape.",
    "Bake in the oven for 20 minutes in a 425 degree oven or until it has a touch of brown to it. (Our mom likes to bake it for 10 minutes and then covers the edges with tin foil for the remaining 10 minutes so the edges don’t brown faster than the rest of the shell. You can also buy Pie Crust Shields like THESE that will do the same thing.)",
    "There you have it. Now it is just waiting for something luscious to fill it to make it a perfect peach, strawberry, lemon meringue, coconut cream, chocolate cream, or whatever pie you want to make it. YUM!",
    "-Robin",
    "[print_this]",
    "No-Fail GLUTEN FREE Pie Crust – Recipe Card",
    "yield: 2 large crusts or 3 small",
    "1/2 cup tapioca flour",
    "1/2 cup cornstarch",
    "1/4 cup potato starch",
    "1 cup rice flour (sweet rice flour if you can find it)",
    "1 rounded tsp xanthan gum",
    "1/2 tsp salt",
    "1 dash sugar",
    "1/2 cup butter",
    "1/2 cup butter flavored Crisco",
    "1 cold egg",
    "1 TBS vinegar",
    "4 TBS ice water",
    "Sift dry ingredients together. Cut in the butter and shortening with a fork or pastry cutter until the crumbles become pea sized. In a separate bowl mix together the egg, vinegar, and ice water until thoroughly blended. Add this mixture to your butter mixture until well blended. Divide into two balls for large pies or into three balls for smaller pies. Refrigerate the dough balls for at least an hour, covered with plastic wrap. Roll out and set in your pie plate and prick the dough with a fork. Bake in the oven for 20 minutes at 425 degrees or until lightly brown. (Or bake for 10 minutes, cover the edges with tin foil or pie shields, and then bake for the remaining 10 minutes.)",
    "[/print_this]",
    "Share",
    "511",
    "Pin",
    "57K",
    "Tweet",
    "SHARES 57K",
    "Filed Under: Desserts, Gluten Free, Recipes",
    "« Shred Your Chicken…in SECONDS!DIY Car Seat Toys…for baby! »",
    "Comments",
    "Ann says",
    "July 29, 2015 at 1:03 pm",
    "Thank you for the lesson. It looks good",
    "Jeanne says",
    "July 29, 2015 at 5:46 pm",
    "Thank you for this. Three of us are GF–and one is lactose free. Do you have a recommendation for a butter replacement? Use all Crisco? Thank you!",
    "Robin says",
    "July 29, 2015 at 10:46 pm",
    "Oh yes, I would use first use margarine to replace the butter. Then if not, go ahead and use all Crisco/shortening.",
    "Anonymous says",
    "July 30, 2015 at 1:08 pm",
    "What if your one of the people who knows the horrible things crisco & margarine do to our health. What do you recommend then? Is all butter an option?",
    "Robin says",
    "August 10, 2015 at 3:52 pm",
    "I would recommend using lard to replace the Crisco/shortening first before using all butter. Butter has a higher percentage of water than shortening and lard is the more similar.",
    "Karen says",
    "November 5, 2015 at 3:38 pm",
    "Thanks Robin, I had forgotten about lard. It would be perfect.",
    "Anonymous says",
    "November 11, 2015 at 3:29 pm",
    "Make homemade ghee. I am gluten free, but just recommended to go dairy free by my holistic physician. She said I can alternate ghee for butter. And it’s easy to make in a crock pot!",
    "stephanie says",
    "July 29, 2015 at 6:02 pm",
    "Has anyone tried this recipe without the xanthan gum? It affects me very much like gluten itself.",
    "Kristen says",
    "August 2, 2015 at 5:38 pm",
    "Have you tried guar gum? Our family can’t have xanthum gum because it’s corn based. Guar gum works the same way and it’s often even cheaper!",
    "Can’t wait to try this pie crust! It looks beautiful.",
    "stephanie says",
    "August 2, 2015 at 6:11 pm",
    "Thanks, Kirsten. You are correct: “Guar gum works the same way,” and it is equally indigestible.",
    "Has anybody actually used anything else? Or simply omitted it?",
    "Ellen says",
    "July 29, 2015 at 6:07 pm",
    "Ca n this be used for baked fruit pies, without pricking the bottom crust and baking it? I’m thinking double crust blueberry and apple pies, and single crust pumpkin, squash and quiche. Thanks!",
    "Robin says",
    "July 29, 2015 at 11:00 pm",
    "YES! I forgot to mention that yes you can skip pricking the the bottom fill it with an egg base filling or baked fruit pie filling before baking the crust. I have added that in.",
    "Ellen says",
    "July 30, 2015 at 7:31 am",
    "Thanks Robin! I think I will try this with the blueberries and nectarines that are abundant now, and then fall and winter recipes. Could be a new classic recipe!",
    "Celi says",
    "July 30, 2015 at 3:27 pm",
    "Ellen, you only prick the crust when a recipe tells you that you need a baked pie crust. If you don’t want to prick it then place pie weights or dried beans to prevent the crust bubbling up.",
    "Sam says",
    "July 30, 2015 at 6:59 pm",
    "What is crisco? Haven’t seen it in the land of Australia.",
    "Rosalind says",
    "July 31, 2015 at 5:53 am",
    "It’s shortening… you can use vegetable fat shortening if you prefer.",
    "Jenny nielson says",
    "August 4, 2015 at 7:01 pm",
    "This looks amazing Ashley! Ps I have the same rolling pin. ?",
    "Catherine Pena says",
    "October 5, 2015 at 11:34 pm",
    "What can be used instead of Corn Starch – it has the same affect as gluten. Really need a great recipe – would love to hear your thoughts.",
    "Thank you.",
    "Anonymous says",
    "October 9, 2015 at 6:10 pm",
    "Arrowroot",
    "Terri Divine says",
    "October 29, 2015 at 7:59 pm",
    "Can you make the pie dough and then referigerate overnight and use the next day with good results?",
    "Robin says",
    "November 25, 2015 at 9:31 pm",
    "Oh definitely yes!",
    "Anonymous says",
    "November 7, 2015 at 7:54 am",
    "Could I sub coconut flour for the rice?",
    "Robin says",
    "November 25, 2015 at 9:31 pm",
    "It is worth a try.",
    "Anonymous says",
    "November 25, 2015 at 3:34 pm",
    "I can’t find potato starch ANYWHERE and got potato flour. Is that going to make the recipe not work? We don’t have a lot of options of place to get specialty flours here and that was all Whole Foods had.",
    "Robin says",
    "November 25, 2015 at 9:30 pm",
    "Potato Flour is pretty different than potato starch. Sometime they put on the package Potato Starch Flour which can be confusing but ut is potato starch. I would replace it with cornstarch or arrowroot and not use the potato flour.",
    "Donna says",
    "July 18, 2016 at 9:43 pm",
    "I get my potato starch, rice flour, tapioca flour at the Asian markets.",
    "C says",
    "December 6, 2015 at 2:49 pm",
    "Im a bit confused with the baking instructions; are you suppose to blind bake the crust prior to adding the filling (regardless of the type of filling?) or no need to blind bake only for fruit based fillings and blind bake for all others?? Thanks for sharing!",
    "Beverly says",
    "December 6, 2016 at 12:07 pm",
    "If you are using apples, peaches or cherries or other fruit … don’t bake your pie crust prior. Fill and bake. If you are making like a strawberry pie, bake crust first. Hope that helps.",
    "Missy says",
    "December 31, 2015 at 10:51 am",
    "I just wanted to thank you for this awesome recipe!!! I have been gluten free for over 6 years and this is the first pie crust that actually tasted like it should — flaky, buttery and delicious!",
    "Donna says",
    "April 10, 2016 at 8:14 pm",
    "Finally a pie crust that looks as good as it tastes. I didn’t have a couple of the items and substituted (flours ) but it still came out. My non GF family even liked it!! Thanks",
    "Michele says",
    "September 13, 2016 at 3:56 pm",
    "Can this be made with a gluten free flour mix instead of adding all the different ones myself? If so what would the cups or weight be?",
    "Betsy says",
    "September 13, 2016 at 9:20 pm",
    "Has anyone tried making with an egg replacer product or a “flax egg”. We are allergic to egg and wheat. Many thanks.",
    "Kandee says",
    "November 19, 2016 at 7:11 am",
    "I was wondering the same thing…. we are dairy & egg, soy & gluten free. 2/6 are at least….",
    "loretta says",
    "November 10, 2016 at 11:44 am",
    "most of the items used for this crust are not in my pantry I want to use this recipe for a GF Thanksgiving pie could I mix up the dry ingredients, bag it and pass it along to my GF guest. otherwise it would sit there to go bad or just go to waste",
    "Danelle says",
    "November 14, 2016 at 12:50 pm",
    "This recipe is truly a keeper! It was developed by Betty Hagman and first published in 1990 in her ground-breaking book, The Gluten-free Gourmet.",
    "Starla says",
    "November 26, 2016 at 9:22 am",
    "With the ability to purchase GF flours that are now one for one replacement. I just don’t see why you have to buy a bunch of unnecessary ingredients any more. So, our question again is Can this be made with a gluten free flour mix instead of adding all the different ones ourselves? If so what would the cups or weight be PLEASE?",
    "Ashley says",
    "November 27, 2016 at 10:24 am",
    "This recipe was originally shared several years ago when not a lot of flour mixtures were available and because pie is something I only make occasionally, the need for testing new ingredients hasn’t been something I’ve had a lot of time for. All I do know, is that this recipe works amazingly well, with the amounts listed in the recipe. However, you are more than welcome to try out different variations of this recipe on your own and let us know how it works for you. Good luck! -Ashley",
    "Anjie says",
    "December 20, 2016 at 8:52 pm",
    "I have made this recipe with pamela artisan blend flour. I substituted by adding up the cups of flour in recipe! It turned out great! So I used like 2 1/4 cup of the artisan",
    "Anjie says",
    "December 20, 2016 at 8:53 pm",
    "I have made this recipe with pamela artisan blend flour. I substituted by adding up the cups of flour in recipe! It turned out great! So I used like 2 1/4 cup of the artisan blend",
    "Gen says",
    "January 11, 2017 at 3:12 pm",
    "Tried this recipe out and it was absolutely perfect. I make a single crust to top a Turkey Pot Pie and my husband raved about it. First GF crust we have liked. Thanks so very much! Eager to use the remaining half of recipe for another pie or tarts.",
    "Make It & Love It TV",
    "Subscribe",
    "Sponsors",
    "COPYRIGHT © 2017 · PRIVACY & TERMS",
    "Share",
    "511",
    "Pin",
    "57K",
    "Tweet",
    "SHARES 57K",
    "AN ELITE CAFEMEDIA HOME/DIY PUBLISHER",
    "×",
    "Select Directions",
    "(note: you can drag this box around to make it easier to highlight the recipe)",
    "Please highlight the directions for this recipe and click \"Next\"",
    "BackNext"
  ],
  "ingredients": [
    "0",
    "Here is what you need:",
    "1/2 cup tapioca flour",
    "1/2 cup cornstarch",
    "1/4 cup potato starch",
    "1 cup rice flour (sweet rice flour if you can find it)",
    "1 rounded tsp xanthan gum",
    "1/2 tsp salt",
    "1 dash sugar",
    "1/2 cup butter",
    "1/2 cup butter flavored Crisco",
    "1 cold egg",
    "1 TBS vinegar",
    "4 TBS ice water"
  ],
  "__v": 1
}