{
  "hash": "20c86db31ffa9a7583f0672f29f435f0d4aaac6e",
  "title": "QUICK BOLOGNESE SAUCE",
  "image": "http://orsimages.unileversolutions.com/ORS_Images/Knorr_en-GB/Bolognese_sauce_16_1.1.15_326X580.Jpeg",
  "href": "http://www.knorr.co.uk/recipes/detail/8329/1/quick-bolognese-sauce",
  "extension": "Chrome",
  "firstAdded": "2015-12-19T06:50:00.837000",
  "users": [
    null
  ],
  "keywords": [
    "litres",
    "lean",
    "beef",
    "onion",
    "celery",
    "carrots",
    "garlic",
    "sprigs",
    "thyme",
    "tbsps",
    "tomato",
    "puree",
    "red",
    "wine",
    "olive",
    "oil",
    "knorr",
    "stock",
    "pots",
    "ladles",
    "preprepared",
    "bay",
    "leaves",
    "litre"
  ],
  "directions": [
    "0",
    "METHOD",
    "Chop the carrots, onion and celery as finely as possible. By chopping finely it allows all the flavours to be released into the bolognese. (My Mum used to mince all the garlic, celery, onions, carrots and meat together.), Take the garlic cloves (you can use as much or as little as you like), crush them with the back of your knife and then slice them finely. Once sliced, add a little salt to the slices. Using the back of your knife again, mash it into a paste. The salt helps to get the paste really smooth and fine, but you can just use a garlic crusher or a food processor.",
    "Add a generous amount of olive oil to a large saucepan or stove-top casserole., Over a low heat add the carrots, celery, garlic and onion. By cooking down slowly, without colour, it allows the natural sweetness in the carrot to come out.",
    "Add the beef and cook with the vegetables to render the fat out of it. If there is excess fat, you can simply pour it off and then proceed to make your bolognese. In Italy, they use half beef and half pork. My recipe is all beef.",
    "Seal off the mince – by doing this you evaporate off all the water, which intensifies the flavour of the beef. Work the beef by stirring it thoroughly, lifting the meat to break down all the lumps for a smooth sauce.",
    "Add the tomato puree and mix thoroughly to cook the paste. Add the red wine (this is optional) and evaporate off. Add the water and one Beef Knorr Stock Pot and evaporate off.",
    "Add the pre-prepared tomato sauce and mix thoroughly.",
    "Bring back to the boil and add a couple of bay leaves and a few sprigs of thyme. Taste to check the seasoning and add another Knorr Beef Stock Pot if it needs it.",
    "Let the sauce cook for 1½ –2 hours, slowly, with the lid on.",
    "Once cooked, discard the thyme and bay leaves. These have released all their flavour and are no longer needed. Your bolognese is now ready to serve."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "For 2 litres:",
    "1kg lean minced beef",
    "1 large onion",
    "1 stick of celery",
    "2 carrots",
    "5 cloves of garlic",
    "A few sprigs of thyme",
    "2tbsps tomato puree",
    "350ml red wine (optional)",
    "4tbsps olive oil",
    "2 Knorr Beef Stock Pots",
    "2 ladles of tomato sauce (pre-prepared)",
    "2 bay leaves",
    "For 1 litre:"
  ],
  "__v": 1
}