{
  "__v": 2,
  "directions": [
    "0",
    "Mark out a 33cm by 26cm rectangle on baking paper; place it on an upturned baking tray. Preheat oven to 120°C.",
    "Meringue: Combine the nuts, half the sugar (90g), cornstarch and salt in a bowl.",
    "Whip the egg whites and cream of tartar until foamy, 30 seconds, then slowly add the remaining 90g of sugar until glossy and stiff. Fold in the nut-sugar mixture in two batches.",
    "Spread the meringue evenly onto the paper and mist the surface with water. Bake for 90 minutes, then turn off the oven and leave the meringue inside for another 90 minutes. Cool on a wire rack.",
    "Buttercream: Whisk egg yolks, sugar, cornstarch and salt in a bowl. Heat milk to a simmer, then pour into the yolk mixture, whisking until smooth. Return mixture to the heat and continue whisking until thickened and stiff. Transfer custard to a bowl, cover and refrigerate until set, two hours. Before using, bring to room temperature.",
    "Dissolve instant coffee in water. Whip the butter until light. Beat in the custard in three batches until just combined. Add coffee mixture and beat until light and fluffy, five minutes.",
    "Ganache: Place chocolate in heatproof bowl. Heat cream and corn syrup to a simmer and pour over the chocolate to soften; stir until smooth. Cool for five minutes.",
    "Assembly: Make sure there is room in the fridge to chill the cake in stages.",
    "Peel off paper from meringue and place on a cutting board. Using a serrated knife, trim edges and cut into four equal rectangles, about 25cm by 8cm.",
    "Spread three rectangles each with about 1/4 cup ganache. Refrigerate until firm, 15 minutes.",
    "Spread remaining rectangle with about 1/2 cup buttercream; place on a wire rack. Place one ganache-coated meringue, chocolate side down, on top of the buttercream and press gently. Spread on ½ cup buttercream and put on the next layer. Repeat with the remaining meringue. Finally, frost the top and sides of the cake with the remaining buttercream. Refrigerate until firm, two hours.",
    "Warm remaining ganache in a heatproof bowl set over simmering water or in a microwave oven until it is runny, but not hot. Pour ganache over the top of the cake and spread with a spatula, letting excess flow down sides.",
    "Garnish top of cake with hazelnuts. Chill, uncovered, then transfer cake to a platter. To serve, cut each slice with a sharp knife dipped in hot water and wiped dry."
  ],
  "firstAdded": "2014-10-15T13:08:51.841000",
  "hash": "a4eb8fa6a51d6268ea75a40ff979f32c8125762a",
  "href": "http://www.thestar.com.my/Lifestyle/Food/Recipes/2013/08/07/Chocolate-Coffee-Dacquoise/",
  "image": "http://www.thestar.com.my/~/media/Images/TSOL/Photos-Gallery/features/2013/08/05/str2_ga_0508_p58c_dacquoise centre.ashx?w=620&h=413&crop=1&",
  "ingredients": [
    "0",
    ">>> Meringue",
    "---------------------",
    "80g ground almonds",
    "50g ground hazelnuts",
    "180g caster sugar, divided",
    "1 tbsp cornstarch",
    "1/4 tsp salt",
    "4 large egg whites (about 120g), room temperature",
    "Large pinch of cream of tartar",
    "-------------------",
    "Coffee Buttercream",
    "-------------------",
    "4 large egg yolks",
    "60g sugar",
    "1 tbsp cornstarch",
    "1/4 tsp salt",
    "-------------------------",
    "175ml full-cream milk",
    "1 1/2 tbsp instant coffee",
    "2 tbsp hot water",
    "225g unsalted butter, softened",
    "--------------------",
    "Chocolate Ganache",
    "--------------------",
    "170g chocolate (60% cocoa), finely chopped",
    "170ml whipping cream",
    "2 tsp corn syrup",
    "20 whole hazelnuts, to decorate"
  ],
  "keywords": [
    "meringue",
    "almonds",
    "hazelnuts",
    "caster",
    "sugar",
    "divided",
    "cornstarch",
    "salt",
    "egg",
    "whites",
    "room",
    "cream",
    "tartar",
    "coffee",
    "buttercream",
    "yolks",
    "fullcream",
    "milk",
    "instant",
    "hot",
    "water",
    "unsalted",
    "butter",
    "softened",
    "chocolate",
    "ganache",
    "cocoa",
    "whipping",
    "corn",
    "syrup",
    "decorate"
  ],
  "title": "Chocolate-Coffee Dacquoise",
  "users": [
    null
  ]
}