{
  "hash": "f8e19fa7311004ad79ec5e329fddb07a69015fd1",
  "title": "Tlayudas (Mexican Tortilla Flatbread)",
  "image": "https://prods3.imgix.net/images/articles/2017_08/Non-Feature-tlayudas-mexican-tortilla-flatbread-recipe.jpg?auto=format%2Ccompress&ixjsv=2.2.3&w=750",
  "href": "https://www.tastingtable.com/cook/recipes/tlayudas-mexican-tortilla-flatbread-recipe",
  "extension": "Chrome",
  "firstAdded": "2017-08-06T06:29:14.713000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the carrot salsa: In a small saucepan, heat the grapeseed oil over medium-high heat. Add the carrots, onion and chile, and cook, stirring often, until they begin to brown, 3 to 4 minutes. Reduce the heat to medium low and add the tomato paste, cumin, coriander, fenugreek, cinnamon, paprika and garlic.",
    "Cook, stirring often, until caramelized, 5 to 7 minutes. Deglaze the pan with the lime juice and water, and cook until thickened, 1 minute, then remove from the heat. Stir in the cilantro and season with salt and white pepper. Let cool.",
    "Make the toasted seed mix: In a small bowl, combine all the seed mix ingredients and toss to incorporate. Set aside.",
    "Make the herb salad: In a small bowl, combine all the herb salad ingredients and toss to incorporate. Set aside.",
    "Make the tlayudas: Preheat the oven to 450°. Heat a large cast-iron pan or grill pan over medium-high heat. Brush both sides of each tortilla with the grapeseed oil. Working with 1 tortilla at a time, grill, flipping once, until a little charred and firm, 1 to 2 minutes per side. Transfer to a sheet pan and repeat with the other tortilla.",
    "With both tortillas side by side on the sheet pan, divide the carrot salsa between the two, spreading to cover all but an outer ½-inch rim. Bake until the tortilla is firm and the edges are golden, 6 to 7 minutes.",
    "Remove the tortillas from the oven, tear up the burrata into small pieces and divide it between the 2 tortillas. Return to the oven and bake until melted, 2 to 3 minutes more.",
    "Transfer both tlayudas to a cutting board and top each with the seed mix and herb salad. Slice into wedges and serve."
  ],
  "ingredients": [
    "0",
    "For the Carrot Salsa:",
    "2 tablespoons grapeseed oil",
    "1 cup shredded carrots",
    "½ small yellow onion, finely diced",
    "½ serrano chile—stemmed, seeded and minced",
    "½ tablespoon tomato paste",
    "½ teaspoon ground cumin",
    "½ teaspoon ground coriander",
    "¼ teaspoon ground fenugreek",
    "⅛ teaspoon ground cinnamon",
    "⅛ teaspoon smoked paprika",
    "2 garlic cloves, finely grated",
    "¼ cup lime juice",
    "¼ cup water",
    "½ c finely chopped cilantro",
    "Kosher salt and freshly ground white pepper",
    "For the Toasted Seed Mix:",
    "2 teaspoons white sesame seeds, toasted",
    "2 teaspoons pepitas, toasted",
    "2 teaspoons sunflower seeds, toasted",
    "1 teaspoon hemp seeds",
    "½ teaspoon nigella seeds",
    "For the Herb Salad:",
    "1 tablespoon chopped cilantro",
    "1 tablespoon chopped parsley",
    "1 tablespoon chopped dill",
    "1 tablespoon chopped mint",
    "For the Tlayudas:",
    "Two 10-inch flour tortillas",
    "1 tablespoon grapeseed oil",
    "4 ounces burrata",
    "Carrot salsa",
    "Toasted seed mix",
    "Herb salad"
  ],
  "__v": 1
}