{
  "hash": "c35e19313bb74399d63bcce86abc681da6271b05",
  "title": "Broccoli & Brussels Sprout Orecchiette",
  "image": "https://cdn.loveandlemons.com/wp-content/uploads/2018/04/IMG_11915.jpg",
  "href": "https://www.loveandlemons.com/meal-plan-broccolini-brussels-sprout-orecchiette/",
  "extension": "",
  "firstAdded": "2018-05-03T20:13:46.259000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Bring a large pot of salted water to a boil and prepare the pasta according to the package directions, or until al dente. Drain the pasta and toss it with a drizzle of olive oil to keep it from sticking together. Return the empty pot to the stove and let it cool slightly.",
    "Coat the bottom of the pasta pot with a generous drizzle of olive oil and heat to medium heat. Add the Brussels sprouts, kale stems, broccolini stems, and a pinch of salt and cook until nearly tender, stirring occasionally, about 10 minutes.",
    "Add the broccolini florets and cook until the vegetables are all tender, 3 to 5 minutes more. Add a splash of wine and stir to loosen any bits that might be sticking to the bottom of the pot. Cook for 30 seconds, then reduce the heat to low. Stir in the pasta and the chickpeas and cook stirring gently, until just heated through. Season with more salt and pepper, to taste.",
    "Transfer to plates and serve with generous dollops of the pepita pesto and shavings of pecorino cheese, if desired."
  ],
  "ingredients": [
    "0",
    "6 ounces orecchiette pasta",
    "Extra-virgin olive oil, for drizzling",
    "1½ cups halved Brussels sprouts",
    "½ cup chopped kale stems",
    "Half bunch of broccolini, florets chopped, stems finely chopped",
    "Splash of white wine or vegetable broth",
    "½ cup cooked chickpeas, drained and rinsed",
    "½ cup Creamy Kale Pepita Pesto (from the grain bowl recipe)",
    "Shavings of pecorino cheese, optional",
    "Sea salt and freshly ground black pepper"
  ],
  "__v": 1
}