{
  "hash": "481a636ecc15539701fd5852a5414217b5ee7e3b",
  "title": "Heavenly Strawberry Roll",
  "image": "http://assets.kraftfoods.com/recipe_images/Heavenly-Strawberry-Roll-59569.jpg",
  "href": "http://www.kraftcanada.com/recipes/heavenly-strawberry-roll-124047?cm_mmc=social-_-facebook-_-kc-_-recipe",
  "extension": "Chrome",
  "firstAdded": "2015-07-12T18:03:07.577000",
  "users": [
    null
  ],
  "keywords": [
    "pkg",
    "angel",
    "food",
    "cake",
    "icing",
    "sugar",
    "strawberries",
    "divided",
    "size",
    "jello",
    "vanilla",
    "instant",
    "pudding",
    "cold",
    "milk",
    "thawed",
    "cool",
    "whip",
    "whipped"
  ],
  "directions": [
    "0",
    "Heat oven to 350ºF.",
    "Line 15x10x1-inch jelly roll pan with parchment paper; spray with cooking spray. Prepare cake batter as directed on package; pour into prepared pan. Spread batter to evenly cover bottom of pan. Bake 20 to 22 min. or until top is golden brown and cake springs back when touched lightly in centre. Cool in pan 30 min.",
    "Sift icing sugar over clean kitchen towel. Invert cake onto towel; remove pan. Carefully peel off parchment. Starting at one long side, roll up cake and towel together. Cool completely. Meanwhile, reserve 1 cup strawberries; coarsely chop remaining berries.",
    "Beat pudding mix and milk in medium bowl with whisk 2 min. Refrigerate 5 min. Stir in 1 cup Cool Whip and chopped berries. Unroll cake; remove towel. Spread strawberry mixture over cake, leaving 1-inch border around all sides. Reroll cake; wrap in plastic wrap. Refrigerate 1 hour. Unwrap just before serving; place, seam-side down, on platter. Frost with remaining Cool Whip. Top with remaining berries."
  ],
  "ingredients": [
    "0",
    "1 pkg. (450 g) angel food cake mix",
    "1/4 cup icing sugar",
    "3 cups fresh strawberries, divided",
    "1 pkg. (4-serving size) Jell-O Vanilla Instant Pudding",
    "1 cup cold milk",
    "3 cups thawed Cool Whip Whipped Topping, divided"
  ],
  "__v": 1
}