{
  "hash": "e3c3117b0586e0f99bbae454c4a07e89557a7df5",
  "title": "The perfect arancini",
  "image": "//i.guim.co.uk/img/static/sys-images/Lifeandhealth/Pix/pictures/2014/7/9/1404903379747/Felicity-Cloakes-perfect--009.jpg?w=300&q=85&auto=format&sharp=10&s=661fe2b0ed14e045bc772093290bb3d2",
  "href": "http://www.theguardian.com/lifeandstyle/wordofmouth/2014/jul/09/how-to-make-perfect-arancini-italian-fried-rice-balls",
  "extension": "Chrome",
  "firstAdded": "2015-07-31T11:40:30.162000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "stock",
    "arborio",
    "rice",
    "salt",
    "generous",
    "saffron",
    "parmesan",
    "vegetarian",
    "alternative",
    "mozzarella",
    "chunks",
    "fillings",
    "meat",
    "ragu",
    "pesto",
    "sauteed",
    "mushrooms",
    "egg",
    "plain",
    "flour",
    "breadcrumbs",
    "oil"
  ],
  "directions": [
    "0",
    "If you are using leftover risotto, skip this step. Otherwise, bring the stock to the boil in a medium pan, then tip in the rice, salt and saffron. Bring back up to the boil, then turn down the heat and simmer on a medium heat until the stock has been absorbed. Stir in the grated parmesan and season to taste, then leave to cool completely, preferably in the fridge – you can spread it out on a tray to hasten this if necessary.",
    "Stir the mozzarella into the cool rice and check the seasoning. Roll a tablespoonful between wet palms to form a ball of your chosen size. Poke a hole in the middle and spoon your filling in, then plug the hole with extra rice. Repeat until all the rice is used up.",
    "Beat together the egg, flour and enough water to make a thick batter (about 175ml), and season. Put the breadcrumbs on to a plate.",
    "Heat the oil in a deep pan, no more than a third full, to 170C, or until a breadcrumb sizzles on contact. As it is heating, dip each rice ball into the batter to coat, then into the breadcrumbs, heaping them on top until it is well covered.",
    "Cook in batches until golden brown, making sure the oil comes back up to temperature between batches, and drain on kitchen towel. Sprinkle with a little salt while still warm and serve hot or cold.",
    "Arancini: are they the only thing you can do with leftover risotto, or does anyone have any other ideas? And how do you like yours?"
  ],
  "ingredients": [
    "0",
    "800ml chicken or vegetable stock",
    "250g arborio rice",
    "½ tsp salt",
    "Very generous pinch of saffron",
    "50g parmesan or vegetarian alternative, grated",
    "150g mozzarella, chopped into chunks",
    "Fillings of your choice (meat ragu, pesto, sauteed mushrooms)",
    "1 egg",
    "170g plain flour",
    "500g dried breadcrumbs",
    "Vegetable oil, to cook"
  ],
  "__v": 1
}