{
  "hash": "b5309b1896946c3cd9a29e955c3f7633493a2e66",
  "title": "Lemon-Lime Cheesecake",
  "image": "",
  "href": "https://www.joanneweir.com/recipes/desserts/lemon-lime-cheesecake/",
  "extension": "Chrome",
  "firstAdded": "2017-02-19T02:03:17.117000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat an oven to 325ºF. Butter the bottom of a 9-inch springform cake pan and line the bottom with parchment paper cut to fit precisely. Wrap aluminum foil around the outside of the pan to prevent seepage during baking.",
    "To make the crust, in a food processor fitted with the metal blade, combine the sugar and butter and process until light and fluffy. Add the lemon zest and yolk and process until smooth. In a bowl, sift together the flour, baking powder and salt and add to the processor. Pulse a few times until mixed but still crumbly.",
    "Gather the dough together and press it evenly over the bottom of the prepared pan. Bake until golden, 25-30 minutes. Let cool on a rack.",
    "Meanwhile, make the filling: Using an electric mixer, beat the cream cheese on low speed until smooth. Slowly beat in the sugar. Add the sour cream and lemon and lime zest and juice and beat until blended. Add the eggs, one at a time, beating after each addition only until each has been absorbed. Scraped down the sides of the bowl and beat just until blended.",
    "Pour the filling over the crust and place the pan inside a larger baking pan. Pour hot water into the larger pan to a depth of 1/2 inch. Bake until golden brown and firm to the touch, 1 – 1 1/4 hours. Transfer the cheesecake pan to a rack and let cool. Cover with foil and chill overnight."
  ],
  "ingredients": [
    "0",
    "Crust",
    "3 tablespoons granulated sugar",
    "1/4 cup (2 oz) unsalted butter, at room temperature",
    "1 1/2 teaspoons grated lemon zest",
    "1 egg yolk",
    "1 cup (5 oz) all-purpose flour",
    "1/4 teaspoon baking powder",
    "pinch of salt",
    "Filling",
    "1 1/4 lb (625g) cream cheese, at room temperature",
    "3/4 cup (6 oz) granulated sugar",
    "3/4 cup (6 fl oz) sour cream",
    "1 tablespoon grated lemon zest",
    "1 tablespoon grated lime zest",
    "2 tablespoons fresh lemon juice",
    "2 tablespoons fresh lime juice",
    "4 eggs"
  ],
  "__v": 1
}