{
  "hash": "e74fd72d009fe45828ad6628f681d73aad39615e",
  "title": "Pulled Pork Tacos with Grilled Pineapple & Avocado Salsa",
  "image": "",
  "href": "http://www.hungryandfussy.com/pulled-pork-tacos-with-grilled-pineapple-avocado-salsa/",
  "extension": "Chrome",
  "firstAdded": "2016-10-30T18:43:31.226000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine dry ingredients in a bowl. Rub dry spice mix all over pork and refrigerate for at least 2 hrs or overnight.",
    "Remove pork from fridge and sit for about an hour until the meat reaches room temperature.",
    "Heat olive oil in a heavy based saucepan or pressure cooker on medium - high heat and sear the pork on all sides until brown. Do this in batches to prevent the pork from stewing. Remove pork from pan.",
    "Add onion and a little extra olive oil to pan and brown until caramelised. Add pork back in and pour over chicken stock and lime juice.",
    "If cooking in a pressure cooker lock the lid , stabilise the pressure and cook for 50 minutes on a low setting. Release the pressure using the natural release method and unlock the lid. Shred the pork with two forks.",
    "If cooking in a saucepan over the stovetop, add an extra ½ cup chicken stock and simmer on low heat for 2 hrs with lid on. After two hrs remove lid and simmer for another hour uncovered until the stock reduces to gravy. Remove from heat and shred the pork with two forks.",
    "1",
    "Combine all ingredients in a bowl and gently toss.",
    "2",
    "Heat grill pan on high.",
    "Combine oil and honey in a bowl and brush over pineapple slices. Grill for a few minutes on each side or until golden. Cool. Dice pineapple.",
    "Combine all ingredients in a bowl and gently toss.",
    "3",
    "Warm corn tortillas according to packet instructions. Place a portion of pork, red slaw and salsa in taco. Fold to eat."
  ],
  "ingredients": [
    "0",
    "Pulled Pork",
    "1.5 kg pork neck, cut into large chunks",
    "1 tbs sea salt flakes",
    "1 tbs brown sugar",
    "2 tsp cumin",
    "2 tsp dried oregano",
    "1 tsp onion powder",
    "1 tsp garlic powder",
    "¼ tsp cinnamon",
    "½ tsp cracked pepper",
    "2 tbs olive oil",
    "1 brown onion, chopped",
    "½ cup chicken stock",
    "Juice of 1 lime",
    "Red Slaw",
    "4 cups red cabbage, shredded",
    "1 cup coriander, roughly chopped",
    "½ cup shallots, sliced",
    "Grilled Pineapple & Avocado Salsa",
    "1 tbs olive oil",
    "1 tbs honey",
    "1 small pineapple, peeled, cut into 1 cm rings",
    "2 cups avocado, diced",
    "½ cup coriander, roughly chopped",
    "Juice of 1 lime",
    "Pinch of sea salt",
    "Pinch of cracked pepper",
    "Diced red chilli (optional)",
    "12 corn tortillas to serve"
  ],
  "__v": 1
}