{
  "hash": "8f1270311f870a97cba975c6a727e292aa8e2049",
  "title": "Summer Glow Buddha Bowl with House Vinaigrette",
  "image": "http://ohsheglows.com/wp-content/uploads/2016/07/veganbuddhabowl-4326.jpg",
  "href": "http://ohsheglows.com/2016/07/28/summer-glow-buddha-bowl-news/",
  "extension": "Chrome",
  "firstAdded": "2018-07-11T01:08:20.723000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the House Vinaigrette: In a small (1-cup/250 mL) mason jar, add the vinegar, lemon juice, Dijon, garlic, maple syrup, salt, and pepper. Secure lid and shake vigorously to combine. Remove the lid and add in the olive oil. Secure the lid once again and shake vigorously until the oil is emulsified. Taste, and add additional maple syrup or oil if desired.",
    "Cook the quinoa: In a medium saucepan, add the quinoa along with 2 1/4 cups (560 mL) water. Stir to combine. Increase heat to high and bring to a low boil. Immediately reduce the heat to medium-low, and cover with a tight-fitting lid. Cook for 13 to 16 minutes, until the water is absorbed and the quinoa is fluffy. Remove the lid and season the quinoa with salt and pepper.",
    "Sauté the vegetables: Meanwhile, in a large skillet or wok, add the olive oil, green beans, snap peas, and zucchini. Stir to combine and season with salt. Sauté the veggies over medium-high heat for about 10 minutes, until tender but not overcooked. You still want the veggies to have a light crispness to them. At the end of cooking, stir in the spinach and cook for a couple minutes until it wilts. Turn off the heat.",
    "Peel and spiralize the carrot and beet, and slice the avocado.",
    "To assemble: Stir all of the cooked quinoa into the skillet veggie mixture. Increase heat to medium, and cook until warmed throughout. Taste and add more salt and pepper if desired. Portion the quinoa-veggie mixture into large shallow bowls. Top the bowls with the carrot, beet, avocado, and a generous amount of toasted pepita seeds. Lastly, shake the House Vinaigrette and drizzle about 3 to 4 tablespoons all over the top of each bowl. Any leftover Buddha Bowl mixture will keep in the fridge for up to 3 days, and the leftover House Vinaigrette will keep for at least two weeks. The olive oil in the dressing tends to solidify when chilled, so be sure to allow it to sit on the counter for a bit (or warm the sealed jar in a bowl of hot water), and shake well before using. A great way to serve leftovers is to toss some baby mixed greens with House Vinaigrette and stir in some warmed quinoa-veggie mixture. Top it with sliced avocado and toasted pepitas for a quick meal."
  ],
  "ingredients": [
    "0",
    "For the House Vinaigrette (makes 3/4 to 1 cup):",
    "3 tablespoons (45 mL) red wine vinegar",
    "2 tablespoons (30 mL) fresh lemon juice",
    "2 tablespoons (30 mL) Dijon mustard",
    "1 medium clove garlic, minced",
    "2 teaspoons (10 mL) pure maple syrup, or to taste",
    "1/2 teaspoon pink Himalayan salt or fine sea salt, or to taste",
    "Freshly ground black pepper, to taste",
    "6 to 8 tablespoons (90 to 125 mL) extra-virgin olive oil, to taste",
    "For the Buddha Bowl:",
    "1 1/2 cups (300 g) uncooked quinoa (I use rainbow, but any kind works)",
    "2 tablespoons (30 mL) extra-virgin olive oil",
    "2 cups (180 g) fresh green beans, ends trimmed and chopped into bite-sized pieces",
    "2 cups (170 g) fresh snap peas, ends trimmed and chopped into bite-sized pieces",
    "2 cups (220 g) yellow zucchini, sliced into half-moons",
    "Pink Himalayan salt or fine sea salt, or to taste",
    "1 to 2 cups (30 to 60 g) fresh baby spinach",
    "1 medium carrot, peeled and spiralized/julienned*",
    "1 medium beet, peeled and spiralized/julienned**",
    "1 to 2 large ripe avocados, pitted and sliced",
    "3/4 cup (120 g) toasted pepita seeds***"
  ],
  "__v": 1
}