{
  "hash": "c42082a9bc326d1e3dafdb2742ad7d29db047345",
  "title": "Brown Butter Apple Tart",
  "image": "http://assets.epicurious.com/photos/54b05bbcfca98987608b0aa7/6:4/w_620%2Ch_413/51123090_apple-tart_1x1.jpg",
  "href": "http://www.epicurious.com/recipes/food/views/brown-butter-apple-tart-51123090?mbid=nl_10122015_Daily_CTN%20(1)&CNDID=27092335&spMailingID=8148009&spUserID=NDUyOTQ4ODM3NTgS1&spJobID=781698948&spReportId=NzgxNjk4OTQ4S0",
  "extension": "Firefox",
  "firstAdded": "2015-10-15T03:37:51.768000",
  "users": [
    null
  ],
  "keywords": [
    "crustnonstick",
    "oil",
    "spray",
    "unsalted",
    "butter",
    "room",
    "sugar",
    "kosher",
    "salt",
    "egg",
    "blend",
    "cream",
    "vanilla",
    "unbleached",
    "allpurpose",
    "flour",
    "filling",
    "assembly",
    "eggs",
    "bean",
    "split",
    "lengthwise",
    "firm",
    "tart",
    "apples",
    "pink",
    "lady",
    "braeburn",
    "cored",
    "crosswise",
    "ringswhipped",
    "special",
    "equipment",
    "diameter",
    "pan",
    "removable"
  ],
  "directions": [
    "0",
    "Preparation",
    "For crust:",
    "Coat tart pan with nonstick spray. Using an electric mixer or stand mixer fitted with a paddle, mix butter, sugar, and salt until pale and creamy, about 2 minutes.",
    "Add egg, cream, and vanilla. Mix until smooth. Add flour all at once and beat until dough almost comes together. Turn dough out onto a work surface. Knead until dough just comes together, 4-5 times. Divide dough in half; form each half into a smooth ball. Flatten into disks and wrap each disk tightly in plastic. Chill 1 disk overnight; freeze second disk for another use.",
    "Roll out chilled dough disk between two sheets of plastic wrap, lifting and adjusting plastic as needed, until 1/8\" thick and 2\" wider than tart pan. Transfer dough in plastic wrap to a baking sheet and refrigerate until firm enough to handle, about 30 minutes.",
    "Remove top piece of plastic from dough. Invert dough into tart pan; press onto bottom and up sides. If dough is soft, chill until firm enough for remaining sheet of plastic to be removed. Trim edges of dough (patch up any holes or tears with extra dough). Chill until firm, about 1 hour.",
    "Preheat oven to 350°F. Line dough with parchment paper or heavy-duty foil, leaving a 1\"-2\" overhang. Fill paper with dried beans or pie weights. Bake tart shell just until dough has dried and does not look wet in any spots, about 20 minutes. (If center still looks wet, bake crust without weights until dried and opaque, a few minutes longer.)",
    "For filling and assembly:",
    "Whisk eggs and sugar in a medium bowl just to blend. Place butter in a medium saucepan over medium heat. Scrape in seeds from vanilla bean; add bean. Cook, stirring often, until butter foams, then browns (do not burn), about 5 minutes. Let cool for 10 minutes; remove bean. Slowly whisk brown butter into egg mixture; whisk in flour and salt.",
    "Line tart shell with apples.4 Pour filling over (if using rectangular pan, you may have 1/2 cup excess filling). Bake until apples are deep golden brown and filling is puffed, cracked, and set in center, 70-80 minutes.",
    "Let tart cool in pan on a wire rack, about 2 hours. Remove pan sides. Serve warm or at room temperature with whipped cream."
  ],
  "ingredients": [
    "0",
    "Crust:Nonstick vegetable oil spray1 cup (2 sticks) plus 2 tablespoons unsalted butter, room temperature1 cup sugar1/4 teaspoon kosher salt1 large egg, beaten to blend2 tablespoons heavy cream2 teaspoons vanilla extract3 1/2 cups unbleached all-purpose flour",
    "Filling and assembly:4 large eggs1 cup sugar1 cup (2 sticks) unsalted butter1 vanilla bean, split lengthwise1/2 cup all-purpose flour1/2 teaspoon kosher salt3 firm, tart apples (such as Pink Lady or Braeburn), peeled, cored, cut crosswise into 1/4\"-thick ringsWhipped cream",
    "Special equipment: An 11\"-diameter or 11x8x1\" tart pan with removable bottom",
    "Special equipment:"
  ],
  "__v": 1
}