{
  "hash": "864d64b04ab8adc8cb05087c46c21567a1faa9e5",
  "title": "Maple Cream Tart",
  "image": "//images.food52.com/dryjCGW676r5_nuVE5qifvqPX04=/753x502/64a7f827-f81f-4305-bcc5-4426d19ffa7d--food52_11-13-12-1310.jpg",
  "href": "http://food52.com/recipes/19767-maple-cream-tart",
  "extension": "Chrome",
  "firstAdded": "2015-09-24T05:21:57.456000",
  "users": [
    null
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "salt",
    "cold",
    "unsalted",
    "butter",
    "cubes",
    "ice",
    "water",
    "light",
    "brown",
    "sugar",
    "maple",
    "syrup",
    "preferably",
    "grade",
    "cream",
    "creme",
    "fraiche",
    "greek",
    "yogurt"
  ],
  "directions": [
    "0",
    "In a medium bowl, blend the flour and salt. Using a pastry blender or your fingers, cut the butter into the flour until the mixture is the texture of coarse meal. Add the water, a tablespoon at a time, until the dough holds together when pressed between two fingers. Form the dough into a loose ball.",
    "Cut the ball into pieces, and press the pieces into a 9-inch tart pan, making sure the dough on the bottom and sides is even. Prick with a fork and chill in the fridge for at least 20 minutes. Heat the oven to 400 degrees.",
    "Line the tart dough with parchment paper, and fill with pie weights (or dried beans or rice). Bake for 20 minutes, then remove the pie weights and parchment, and place back in the oven to cook until the bottom is dry, about 5 minutes more. Remove from the oven and let cool completely.",
    "1",
    "Lower the oven to 350 degrees.",
    "In a medium bowl, whisk together the sugar, maple syrup, cream, and flour until smooth. Pour this mixutre into the cooled tart crust. Bake until the maple cream just sets -- it should still jiggle a little -- 20 to 25 minutes. Let cool. Serve sliced with dollops of crème fraiche or Greek yogurt."
  ],
  "ingredients": [
    "0",
    "1 1/4 cups all-purpose flour",
    "1/2 teaspoon salt",
    "8 tablespoons cold unsalted butter, cut into small cubes",
    "3 to 4 tablespoons ice water",
    "1",
    "1 cup packed light brown sugar",
    "1/4 cup maple syrup (preferably grade B)",
    "1 1/4 cups heavy cream",
    "1/4 cup all-purpose flour",
    "Creme fraiche or Greek yogurt, for serving"
  ],
  "__v": 1
}