{
  "hash": "20e8d4d53bbb9bae8013c10698720bb8457bc5a9",
  "title": "Homemade Thin-Crust Pizza",
  "image": "https://cdn.apartmenttherapy.info/image/fetch/f_auto,q_auto:eco,c_fill,g_auto/https://storage.googleapis.com/gen-atmedia/3/2012/10/8c958c77b3ad26a985cc75d58daa98e09ed09108.jpeg",
  "href": "https://www.thekitchn.com/recipe-homemade-thin-crust-pizza-recipes-from-the-kitchn-45499",
  "extension": "Chrome",
  "firstAdded": "2018-11-01T14:25:47.578000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Arrange a rack in the bottom third of the oven, place a rimmed baking sheet on the rack, and heat to 450°F. Meanwhile, make the dough.",
    "Pour the water into a medium bowl. Sprinkle the yeast over the water, and let stand until the yeast is dissolved and foamy, 3 to 5 minutes.",
    "Add the flour and salt. Mix with a stiff spatula or wooden spoon until floury, shaggy dough forms. Turn the dough out onto a work surface and knead until it forms a smooth, slightly tacky ball that springs back when you poke it, 5 to 8 minutes. If the dough sticks to your hands like bubblegum, add a tablespoon of flour at a time until it’s easier to work with; avoid adding too much flour if possible.",
    "Cover the dough with the upside-down bowl or a clean kitchen towel and let sit while you prepare the pizza toppings, about 10 minutes.",
    "Divide the dough into 2 equal pieces. Working with one piece of dough at a time, stretch or roll it into a thin, 10- to 12-inch round. Form from the middle of the dough outwards, using the heel of your hand to gently press and stretch the dough until it's about a 1/4-inch thick or less. For an extra-thin crust, roll it with a rolling pin. If the dough starts to shrink back, let it rest for 5 minutes and then try rolling again.",
    "Carefully remove the preheated baking sheet from the oven and place it upside down on a wire rack. Transfer the dough directly onto the upside-down baking sheet. Brush the dough with 1 teaspoon of the oil. Spread 1/4 cup sauce into a thin layer onto dough, leaving a 1/2-inch border. Sprinkle on the cheese and other toppings.",
    "Bake until the crust is golden-brown and the cheese is melted and browned in spots, 8 to 12 minutes. Remove the pizza from the oven and cool for about 5 minutes before slicing and serving. Repeat with the remaining dough and toppings."
  ],
  "ingredients": [
    "0",
    "For the dough:",
    "3/4 cup lukewarm water",
    "1 teaspoon active dry yeast",
    "2 cups all-purpose flour, plus more for kneading",
    "3/4 teaspoon salt",
    "2 teaspoons olive oil, divided",
    "For the toppings:",
    "1/2 cup pizza sauce, such as classic red sauce or a white sauce",
    "1 to 2 cups cheese: one or a combination of shredded mozzarella, provolone, Parmesan, fontina, romano, and asiago cheese",
    "Topping options: sautéed onions or mushrooms, sliced red peppers, pepperoni, cooked sausage, cooked bacon, etc."
  ],
  "__v": 1
}