{
  "hash": "4b2c1e08dabd876f55efec393abe2c11c2b5c0bf",
  "title": "Raspberry Swirl Rolls",
  "image": "http://3.bp.blogspot.com/-UR4EiNg0XNM/U9rgBFS3eoI/AAAAAAAAIRI/BFjgTSYZlWo/s1600/DSCN5840.JPG",
  "href": "http://ahomemadeliving.com/2012/09/raspberry-swirl-rolls/",
  "extension": "",
  "firstAdded": "2017-06-16T22:52:41.372000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "First, heat up the milk until it is lukewarm. Pour it into your electric mixer bowl, and add the sugar and yeast to it. Mix a little bit, then cover the bowl with a dish towel and let sit for about 5 minutes, until the mixture is frothy. Next, with the mixer running, add in the softened butter, eggs and salt. Slowly begin adding in the flower until a soft dough forms (if the dough is too sticky, add a little more flour). Using the dough hook attachment, beat the dough on medium-high speed for about 10 minutes. Next, form the dough into a ball, place in a greased bowl, cover and let sit in a warm place for about 1 to 2 hours, until it doubles in size.",
    "Prepare your baking pan by lining it with parchment paper and buttering/spraying it with cooking spray. Once the dough has risen, turn it out onto a floured surface and roll it into a 10×24 inch rectangle.",
    "In a small bowl, mix together the frozen raspberries, sugar and cornstarch. Spread that over the dough and tightly roll it up. Using a sharp knife, cut the log into 16 equal sized slices (you will need to do this pretty fast, because the raspberries will start melting very quickly). Place the rolls into your prepared baking pans, cover them and let them rise in a warm place for another hour to two hours.",
    "Preheat your oven to 425 deg F (if you think this is too hot for your oven, turn the temperature down to 400 deg F, or even lower if needed), and bake the rolls for about 25 minutes until they are beautifully golden brown and the juices are bubbling. Let cool. Next, prepare your glaze by whisking together the confectioners’ sugar, butter and heavy cream in a small bowl. Once the rolls have cooled a little, drizzle the glaze over the top. Serve warm!"
  ],
  "ingredients": [
    "0",
    "Dough:",
    "1 cup milk",
    "2/3 cup granulated sugar",
    "2 packets active dry yeast (1 1/2 tbs)",
    "1 stick (4oz) unsalted butter, softened",
    "2 large eggs",
    "1/4 tsp salt",
    "4 1/4 to 4 1/2 cups all-purpose flour",
    "Filling:",
    "10oz frozen raspberries (not thawed)",
    "1/4 cup plus 2 tbs sugar",
    "1 tsp cornstarch",
    "Glaze:",
    "3/4 cup confectioners’ sugar",
    "3 tbs unsalted butter, melted",
    "1 1/2 tbs heavy cream"
  ],
  "__v": 3
}