{
  "__v": 2,
  "directions": [
    "0",
    "Preheat the oven on 400ºF/200ºC.",
    "In a stone mortar or food processor, puree garlic, sea salt, lemon zest, chili flakes, cumin, coriander, paprika and olive oil to a pesto consistency. Cut the eggplants in half length-wise, score the flesh diagonally without breaking the skin, and place on a baking sheet. Evenly apply the spice oil on top of the eggplants and bake in the oven for 30~40 min until soft. A fork should insert without any effort. This depends on the eggplants and mine took 35 min.",
    "Meanwhile make the spiced rice. Soak the raisins in hot water until plumped up, approx 5 min. Remove from the water and coarsely chop them. Set aside.",
    "Heat 1 tbsp of olive oil in a skillet and add the onion with a little pinch of salt. Saute on medium high heat until the onion is browned all over on the edges. Add the cooked Jasmin or basmati rice, chicken stock, cinnamon, allspice and season with salt and ground black pepper. Saute until the rice is heated through and fragrant. Place the rice in a bowl and add the raisins, lemon juice, chopped cilantro, chopped mint and chili flakes. Stir to combine and set aside (There should be slightly more than enough for the final assembly because I found it irresistible to snack on while I wait for the eggplants).",
    "Make the yogurt dressing by whisking the yogurt, lemon juice, black pepper and salt together until smooth. Set aside.",
    "Once the eggplants come out of the oven, use 2 forks to gently make a well in the middle. Stuff it with the spiced rice and drizzle with yogurt dressing. Sprinkle the reserved chopped mint and cilantro on top.",
    "Bust out the best extra virgin olive oil you got and give it a splash."
  ],
  "firstAdded": "2014-06-19T15:24:44.074000",
  "hash": "db17b7432b76dd774c2863c44bc04144db176c74",
  "href": "http://www.ladyandpups.com/2012/12/10/doomsday-roasted-eggplants-eng/",
  "image": "http://www.ladyandpups.com/wp-content/uploads/2012/12/roast-eggplants-with-rice-12-1024x768.jpg",
  "ingredients": [
    "0",
    "Roasted Eggplants:",
    "4 medium, long eggplants",
    "2 garlic",
    "1/2 tsp of sea salt",
    "zest of 1 lemon",
    "1 tbsp of Turkish chili flakes",
    "1 1/2 tsp of ground cumin",
    "1 1/2 tsp of ground coriander",
    "1 tsp of paprika",
    "1/2 cup of olive oil",
    "Spiced Rice:",
    "1/4 cup of assorted, or golden raisin",
    "1 1/2 cup of cooked Jasmin rice, or basmati rice",
    "1 tbsp of olive oil",
    "1/2 medium onion, finely minced",
    "4 tbsp of chicken stock",
    "1/4 tsp of ground cinnamon",
    "1/3 tsp of ground allspice",
    "Salt and black pepper",
    "1 tsp of lemon juice",
    "1 1/2 tbsp of cilantro, chopped (leave 1/2 tbsp for final sprinkling)",
    "1 1/2 tbsp of mint, chopped (leave 1/2 tbsp for final sprinkling)",
    "1 tsp of chili flakes",
    "Yogurt Dressing:",
    "5 tbsp of plain yogurt",
    "2 tsp of lemon juice",
    "1/2 tsp of ground black pepper",
    "1/4 tsp of salt"
  ],
  "keywords": [
    "roasted",
    "eggplants",
    "medium",
    "long",
    "garlic",
    "salt",
    "zest",
    "lemon",
    "turkish",
    "chili",
    "cumin",
    "coriander",
    "paprika",
    "olive",
    "oil",
    "spiced",
    "rice",
    "golden",
    "raisin",
    "jasmin",
    "basmati",
    "onion",
    "chicken",
    "stock",
    "cinnamon",
    "allspice",
    "black",
    "pepper",
    "juice",
    "cilantro",
    "leave",
    "final",
    "sprinkling",
    "mint",
    "yogurt",
    "dressing",
    "plain"
  ],
  "title": "ROASTED EGGPLANTS",
  "users": [
    null
  ]
}