{
  "hash": "897b043d26271a0f0df478b36eb6e9cff2cd917e",
  "title": "Garden Lasagna",
  "image": "http://cdn-img.health.com/sites/default/files/styles/420x420/public/styles/main/public/garden-lasagna-hl-1097982-x.jpg",
  "href": "http://www.health.com/health/recipe/0,,10000001097982,00.html",
  "extension": "Chrome",
  "firstAdded": "2016-07-11T22:33:20.958000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400°.",
    "Heat oil in a large nonstick skillet over medium-high heat. Add zucchini, onion, and carrot; sauté 8 minutes or until lightly browned. Remove from heat; stir in corn, basil, 1/4 teaspoon salt, and 1/8 teaspoon pepper.",
    "Lightly spoon flour into a dry measuring cup; level with a knife. Place flour in a large saucepan; gradually add milk, stirring with a whisk. Cook and stir over medium heat until mixture comes to a boil; reduce heat and simmer 2 minutes, stirring constantly. Remove from heat; stir in cottage cheese, Parmesan, nutmeg, 1/4 teaspoon salt, and 1/8 teaspoon pepper.",
    "Spread 1/2 cup white sauce in bottom of an 11- x 7-inch baking dish coated with cooking spray. Arrange 3 noodles over sauce; top with half the vegetable mixture (about 2 cups) and one-third of the remaining white sauce (about 1 cup). Top with 3 noodles, remaining vegetable mixture, half the remaining sauce, and 3 more noodles. Spread the remaining white sauce over noodles. Cover with foil and bake at 400° for 25 minutes. Uncover, sprinkle with mozzarella, and bake an additional 25 minutes or until golden brown. Let stand 15 minutes."
  ],
  "ingredients": [
    "0",
    "1 1/2 teaspoons olive oil",
    "3 1/2 cups (1 pound) chopped zucchini",
    "1 cup chopped onion",
    "2/3 cup chopped carrot",
    "1 1/2 cups fresh corn kernels or frozen whole-kernel corn, thawed",
    "1 cup chopped fresh basil",
    "1/2 teaspoon kosher salt, divided",
    "1/4 teaspoon freshly ground black pepper, divided",
    "1/4 cup all-purpose flour",
    "3 cups 1% low-fat milk",
    "1 cup 1% low-fat cottage cheese",
    "1/2 cup (2 ounces) grated Parmesan cheese",
    "1/8 teaspoon ground nutmeg",
    "Cooking spray",
    "9 (about 5 ounces) no-boil lasagna noodles (such as Barilla)",
    "1 cup (4 ounces) preshredded part-skim mozzarella cheese"
  ],
  "__v": 1
}