{
  "hash": "da3d24b1b1a9fa7ecc22e2c4c9b361048fe2f739",
  "title": "Roasted Butternut Squash Waffles",
  "image": "https://flockler.com/thumbs/sites/192/rachel-khoo-s-butternut-squash-waffles-5406a274-cf45-4e7b-8cb7-3dc250201d66_s600x600_c1838x1072_l0x190.jpg",
  "href": "https://thehappyfoodie.co.uk/recipes/rachel-khoos-roasted-butternut-squash-waffles",
  "extension": "Firefox",
  "firstAdded": "2019-10-19T04:10:40.143000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Mash the roasted butternut squash or pumpkin and mix with the butter, buttermilk, whole milk",
    "and eggs. Sift together the remaining waffle ingredients into the bowl and fold to incorporate. Don’t overmix or you’ll get a heavy batter. Leave to rest at room temperature for 20 minutes.",
    "Heat up your waffle iron, brushing with melted butter if required (no need with non-stick ones). Pour a ladle of batter into the middle. Gently close the lid and cook for a couple of minutes or until the outside is crisp (this will vary, depending on the heat of your waffle iron).",
    "Leave to cool for a minute before topping with the garnish of your liking.",
    "Top tip: If you don’t have a waffle iron, you could make small drop pancakes instead. Heat up a non-stick frying pan on a medium heat, then pour in a small ladleful of batter. Fry for a couple of minutes on each side until golden.",
    "Get ahead: The batter can be made the day before and chilled. Take out of the fridge 30 minutes before using, so it returns to room temperature. This ensures a lighter, fluffier batter."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "For the waffles:",
    "300g roasted butternut squash or pumpkin",
    "100g cooled melted butter, plus extra for greasing the waffle iron",
    "200g buttermilk",
    "200ml whole milk",
    "2 medium eggs",
    "½ tsp ground cinnamon (optional)",
    "1 tsp fine sea salt",
    "200g plain flour",
    "2 tsp baking powder",
    "To serve as a sweet:",
    "strawberry jam",
    "whipped cream",
    "To serve as a savoury option:",
    "4–6 tbsp crème fraîche",
    "1 red onion, peeled and finely chopped",
    "2 tbsp finely chopped fresh chives",
    "2–4 tbsp Kalix or other caviar"
  ],
  "__v": 1
}