{
  "__v": 2,
  "directions": [
    "0",
    "Preheat oven to 450 degrees F. Prepare the chicken by halving and then halving again lengthwise. (Whole chicken breasts are a bit too big. Making smaller pieces ensures that the coating will not burn before the chicken is cooked through.) Pound to about 1/2 inch thick. Blend the egg whites, cornstarch, and lemon juice with a fork in a wide, shallow dish; set aside. Combine the bread crumbs, parmesan, parsley, salt, pepper, and zest in a second wide, shallow dish.",
    "To crust the chicken breasts, dip each in the egg white mixture and then roll in the bread crumbs. Then transfer the chicken to a rack set over a baking sheet. Air-dry the chicken for 20-30 minutes to help set the crumbs.",
    "To cook, first saute the chicken on the stove in an ovenproof skillet. As you put the chicken in the pan, lay it towards you. This way each piece will rest on top of any crumbs that fall off. Saute until the chicken is golden and crisp on one side, then carefully flip the pieces over. Cook until golden. Finally, transfer the whole pan to a 450 degree oven to finish. Cook for 8 to 10 minutes in the oven. If you are serving this with Sage-Butter Sauce and Roasted Potatoes with Garlic and Rosemary, begin roasting the potatoes while the chicken is air drying on the rack, then prepare the sauce and keep it warm in a warm water bath. It will hold just fine for at least an hour.",
    "For the Sauce - saute the shallots in butter in a small saucepan over medium heat until soft, 2 - 3 minutes. Add the wine, cream, broth and lemon juice. Simmer until reduced by half, 8 - 10 minutes. Whisk in butter, 1 Tbl at a time, stirring constantly. Do not add more butter until previous addition has melted completely. Finish sauce with sage and seasonings. Keep warm in a warm water bath until ready to serve."
  ],
  "firstAdded": "2014-11-13T04:43:12.646000",
  "hash": "f6913d9466b84877b9106822324b45924ee4bb62",
  "href": "http://www.bigoven.com/recipe/parmesan-crusted-chicken/158214",
  "image": "http://mda.bigoven.com/pics/rs/256/parmesan-crusted-chicken-4.jpg",
  "ingredients": [
    "0",
    "2 whole Chicken breasts, boneless and skinless",
    "2 Egg whites",
    "2 tablespoons Cornstarch",
    "Juice of 1/2 lemon",
    "1 cup Dry bread crumbs; coarse",
    "1 tablespoon Fresh parsley",
    "1 teaspoon Kosher salt",
    "1/4 teaspoon Black Pepper",
    "Zest of 1 lemon; minced",
    "1/2 cup Parmesan cheese",
    "3 tablespoons Olive oil",
    "Sage-Butter Sauce",
    "3 tablespoons Shallots; minced",
    "1/2 cup Dry white wine",
    "1/2 cup Heavy cream",
    "1/2 cup Chicken broth",
    "1 teaspoon Fresh lemon juice",
    "4 tablespoons Unsalted butter; cold, cubed",
    "1 teaspoon Salt, white pepper; to taste",
    "1 teaspoon Fresh sage; minced"
  ],
  "keywords": [
    "chicken",
    "breasts",
    "boneless",
    "skinless",
    "egg",
    "whites",
    "cornstarch",
    "juice",
    "lemon",
    "dry",
    "bread",
    "crumbs",
    "coarse",
    "parsley",
    "kosher",
    "salt",
    "black",
    "pepper",
    "zest",
    "parmesan",
    "cheese",
    "olive",
    "oil",
    "sagebutter",
    "shallots",
    "white",
    "wine",
    "cream",
    "broth",
    "unsalted",
    "butter",
    "cold",
    "cubed",
    "sage"
  ],
  "title": "Parmesan Crusted Chicken",
  "users": [
    null
  ]
}