{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 400 degrees. Spread panko out evenly on a rimmed baking sheet and bake until golden brown, about 5 to 7 minutes. Transfer to a small mixing bowl, then add Parmesan, and thyme. Toss until combined. Rinse off the baking sheet, then cover with parchment paper.",
    "Place flour and eggs in separate shallow dishes. Increase temperature to 450 degrees.",
    "Generously season the chicken with a few pinches of salt and pepper. One at a time, add a piece of chicken to the flour, and toss until coated, shaking off excess. Then dip it in egg until coated. Then transfer to the panko mixture, and toss until it is completely coated (pressing to adhere the Panko if needed). Transfer to the parchment-lined baking sheet. Repeat with remaining chicken.",
    "Bake until chicken is cooked through, about 10-12 minutes, flipping halfway through. Serve chicken nuggets warm with dipping sauce(s), if desired.",
    "*I do not recommend using the pre-grated Parmesan cheese you can buy in the refrigerated section at the store. Either buy a block and very finely grate it yourself, or use the powdered Parmesan you can buy in the shaker."
  ],
  "firstAdded": "2014-10-04T05:55:47.175000",
  "hash": "e2146569ea56d4cee337b54b0183e6c96f8f752c",
  "href": "http://www.gimmesomeoven.com/parmesan-baked-chicken-nuggets-recipe/",
  "image": "http://www.gimmesomeoven.com/wp-content/uploads/2014/08/Baked-Parmesan-Chicken-Nuggets-31.jpg",
  "ingredients": [
    "0",
    "2 boneless, skinless chicken breasts (about 1 pound total), cut into bite-sized pieces",
    "1 cup panko breadcrumbs",
    "1/2 cup *finely-grated or powdered Parmesan",
    "1/2 teaspoon dried thyme",
    "coarse sea salt and freshly-cracked black pepper",
    "1/2 cup all-purpose flour",
    "2 large eggs, lightly beaten",
    "cooking spray",
    "(optional) sauces for serving"
  ],
  "keywords": [
    "boneless",
    "skinless",
    "chicken",
    "breasts",
    "total",
    "pieces",
    "panko",
    "breadcrumbs",
    "finelygrated",
    "parmesan",
    "thyme",
    "coarse",
    "salt",
    "freshlycracked",
    "black",
    "pepper",
    "allpurpose",
    "flour",
    "eggs",
    "lightly",
    "cooking",
    "spray",
    "sauces"
  ],
  "title": "Parmesan Baked Chicken Nuggets",
  "users": [
    null
  ]
}