{
  "hash": "2e12319e09e39276ec29ba783c30e0cb45886293",
  "title": "Bacon Corn Chowder",
  "image": "//img-aws.ehowcdn.com/640/ehow-food-blog-us/files/2014/09/ehow-bacon-corn-chowder-014.jpg",
  "href": "http://www.ehow.com/ehow-food/blog/bacon-corn-chowder/",
  "extension": "Chrome",
  "firstAdded": "2015-12-07T17:42:49.907000",
  "users": [
    null
  ],
  "keywords": [
    "slices",
    "bacon",
    "yellow",
    "medium",
    "onion",
    "garlic",
    "allpurpose",
    "flour",
    "chicken",
    "stock",
    "preferably",
    "milk",
    "starchy",
    "potato",
    "russet",
    "kernels",
    "ears",
    "corn",
    "salt",
    "pepper",
    "unsalted",
    "butter",
    "finish",
    "parsley"
  ],
  "directions": [
    "0",
    "In a large Dutch oven or heavy bottom saucepan, cook the bacon over low heat to render out the fat. After several minutes, turn the heat up to medium and cook the bacon until crisp. Remove from the pan and allow to drain on paper towels. Set aside.",
    "Drain all but approximately 1 tablespoon of bacon fat from the pan. Turn the heat to medium-low and add the onion, garlic and a pinch of salt. Allow them to cook for a few minutes and then add the flour, tossing it with the vegetables to coat.",
    "A brownish (but not burned) coating should begin to form on the bottom of the pan. Once it’s a nice golden brown color, add the chicken stock and use a spatula to scrape the brown bits up from the bottom of the pan so they combine with the liquid. Bring the mixture to a boil.",
    "While the stock is heating up, peel and dice the potato. Once the stock is boiling, add the whole milk along with the diced potato. Turn the heat down to medium-low and allow the mixture to simmer for 15 minutes, stirring frequently to prevent the potatoes from sticking to the bottom of the pan.",
    "Add the corn and simmer for another 10 minutes. Dice the bacon and add to the saucepan along with salt and pepper to taste.",
    "If using, stir in the butter just after removing the pan from the heat. Top with fresh chopped parsley and serve."
  ],
  "ingredients": [
    "0",
    "3 slices thick cut bacon",
    "1 cup diced yellow onion (approximately ½ medium onion)",
    "1 large or 2 small garlic cloves, minced",
    "2 tablespoons all-purpose flour",
    "2½ cups chicken stock, preferably homemade",
    "1½ cups whole milk",
    "1 starchy potato, such as a russet",
    "Kernels from 4 ears of corn",
    "Salt and fresh ground pepper to taste",
    "1 tablespoon unsalted butter to finish (optional)",
    "Fresh parsley for garnish (optional)"
  ],
  "__v": 3
}