{
  "hash": "c4d70a7073f232f939da836d9f133a61702531ba",
  "title": "Old-Fashioned Chicken Noodle Soup",
  "image": "",
  "href": "http://www.americastestkitchen.com/recipes/6958-old-fashioned-chicken-noodle-soup?extcode=LN15A1AAA",
  "firstAdded": "2015-01-05T01:48:42.326000",
  "users": [
    null
  ],
  "keywords": [
    "bonein",
    "skinon",
    "chicken",
    "thighs",
    "trimmed",
    "salt",
    "pepper",
    "oil",
    "carrots",
    "medium",
    "celery",
    "ribs",
    "onion",
    "garlic",
    "tomato",
    "thyme",
    "red",
    "lowsodium",
    "broth",
    "bay",
    "leaves",
    "split",
    "breast",
    "wide",
    "egg",
    "noodles",
    "frozen",
    "peas",
    "parsley"
  ],
  "directions": [
    "0",
    "Dry chicken thighs with paper towels and season with salt and pepper. Heat oil in 12-inch skillet over medium-high heat until just smoking. Brown chicken thighs well on both sides, 6 to 8 minutes. Transfer to plate, let cool slightly, and discard skin. 2. Pour off all but 1 tablespoon fat left in pan. Add carrots, celery, and onion and cook over medium heat until vegetables are softened, 7 to 10 minutes. Stir in garlic, tomato paste, thyme, and red pepper flakes and cook until fragrant, about 30 seconds. Stir in 1 cup chicken broth, scraping up any browned bits; transfer to slow cooker. 3. Stir remaining 7 cups broth and bay leaves into slow cooker. Nestle browned chicken with any accumulated juice into slow cooker. Season chicken breast with salt and pepper, wrap in foil packet, and lay on top of soup. Cover and cook until chicken is tender, 4 to 6 hours on low. 4. Remove foil packet, open it carefully (watch for steam), and transfer chicken breast to cutting board. Transfer chicken thighs to cutting board. Let all chicken cool slightly, then shred into bite-sized pieces, discarding skin and bones. Let soup settle for 5 minutes, then remove fat from surface using large spoon. Discard bay leaves. 5. Cook egg noodles in boiling salted water until tender, then drain. Stir cooked noodles, shredded chicken, and peas into soup and let sit until heated through, about 5 minutes. Stir in parsley, season with salt and pepper to taste, and serve."
  ],
  "ingredients": [
    "0",
    "1 1/2 pounds bone-in, skin-on chicken thighs, trimmed",
    "Salt and pepper",
    "1 tablespoon vegetable oil",
    "3 carrots, peeled and chopped medium",
    "2 celery ribs, chopped medium",
    "1 onion, minced",
    "3 garlic cloves, minced",
    "1 tablespoon tomato paste",
    "2 teaspoons minced fresh thyme or 1/2 teaspoon dried",
    "1/8 teaspoon red pepper flakes",
    "8 cups low-sodium chicken broth",
    "2 bay leaves",
    "1 (12-ounce) bone-in, skin-on split chicken breast, trimmed",
    "1 1/2 ounces wide egg noodles (about 1 cup)",
    "1/2 cup frozen peas",
    "2 tablespoons minced fresh parsley"
  ],
  "__v": 1
}