{
  "hash": "c14683e8a8a20b5e65d422e27516633c17f36526",
  "title": "SAUTERNES CUSTARD WITH ARMAGNAC-SOAKED PRUNES",
  "image": "http://www.saveur.com/sites/saveur.com/files/styles/large_1x_/public/images/2015/11/sauternes-custard-armagnac-soaked-prunes_2000x1500_tom-parker.jpg?itok=-z_dZL9b",
  "href": "http://www.saveur.com/sauternes-creme-caramel-with-armagnac-soaked-prunes-recipe",
  "extension": "Chrome",
  "firstAdded": "2015-12-30T19:24:47.785000",
  "users": [
    null
  ],
  "keywords": [
    "english",
    "breakfast",
    "tea",
    "orange",
    "lemon",
    "granulated",
    "sugar",
    "agen",
    "prunes",
    "cinnamon",
    "armagnac",
    "vanilla",
    "egg",
    "yolks",
    "eggs",
    "sauternes",
    "cream"
  ],
  "directions": [
    "0",
    "In a small saucepan, bring 2 1⁄2 cups water to a boil. Remove from the heat and add the tea bags. Let the tea steep for 2 minutes, and then remove the bags and discard. Using a vegetable peeler, peel 3 strips of zest from the orange and 2 strips from the lemon; reserve the fruit for another use.",
    "Stir the citrus strips into the tea along with 1⁄2 cup granulated sugar, the prunes, and the cinnamon and bring to a boil. Reduce the heat to maintain a gentle simmer and cook the prunes until slightly softened, about 5 minutes. Remove the pan from the heat and let the prunes cool in their liquid. Stir in the armagnac and pour the prunes and liquid in a glass jar or plastic container. Seal the container and refrigerate the prunes at least 24 hours, or preferably up to 5 days, before using.",
    "Heat the oven to 300° and arrange six 8-oz. ramekins in a 9-by-13-inch baking dish. In a small skillet, stir the remaining 1⁄2 cup granulated sugar with 5 tablespoons water and bring to a boil. Cook, without stirring, until the sugar turns dark amber, about 7 minutes, and then remove the skillet from the heat. Quickly pour the caramel evenly into the ramekins and let cool.",
    "In a large bowl, whisk the vanilla sugar with the egg yolks and whole eggs until smooth. In a small saucepan, heat the sauternes until warm and pour into the eggs, whisking steadily. Heat the cream in the same manner and pour into the custard and stir until the sugar dissolves. Pour the custard evenly into the ramekins and place the baking dish in the oven. Pour enough boiling water into the baking dish to come halfway up the sides of the ramekins and bake until the custards are set but jiggle slightly in the center, about 30 minutes.",
    "Transfer the baking dish to a rack and carefully remove the ramekins from the water bath. Let the custards cool to room temperature and then refrigerate for at least 8 hours or overnight. To serve, run a paring knife around the edge of each ramekin, invert the custard onto a dessert plate, and spoon 3 to 5 prunes and their liquid alongside the custard."
  ],
  "ingredients": [
    "0",
    "2 bags English breakfast tea",
    "1 orange",
    "1 lemon",
    "1 cup (8 oz.) granulated sugar",
    "1 cup (7 1⁄2 oz.) Agen prunes",
    "1 stick cinnamon",
    "2⁄3 cup Armagnac",
    "3⁄4 cup vanilla sugar",
    "9 large egg yolks",
    "3 whole large eggs",
    "1 2⁄3 cups sauternes",
    "1 2⁄3 cups heavy cream"
  ],
  "__v": 1
}