{
  "hash": "35b8182894eaddd865af1ab20ab56d5c2733db6b",
  "title": "Pickled Vegetables",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/pickled-vegetables",
  "extension": "Chrome",
  "firstAdded": "2015-10-26T21:14:52.108000",
  "users": [
    null
  ],
  "keywords": [
    "frozen",
    "thawed",
    "pearl",
    "onions",
    "white",
    "wine",
    "vinegar",
    "sugar",
    "kosher",
    "salt",
    "black",
    "peppercorns",
    "garlic",
    "bay",
    "leaf",
    "sprig",
    "rosemary",
    "bunches",
    "radishes",
    "trimmed",
    "inchdiameter",
    "baby",
    "beets",
    "olive",
    "oil",
    "drizzling",
    "pepper",
    "coarsely",
    "flatleaf",
    "parsley"
  ],
  "directions": [
    "0",
    "PREP: 1 MIN TOTAL: 9 MIN",
    "If using fresh onions, place in a medium heatproof bowl. Pour hot water over to cover; let stand for 20 minutes. Peel onions, leaving some root end attached; set aside.",
    "Bring vinegar, sugar, 1 1/2 Tbsp. salt, next 4 ingredients, and 2 cups water to a boil in a large saucepan; reduce heat to medium; simmer for 3 minutes. Add onions; simmer until crisp-tender, 8–12 minutes. Using a slotted spoon, transfer onions to a small heatproof bowl. Return pickling liquid to a boil, adding more water if needed to cover vegetables; cook radishes until crisp-tender, 12–13 minutes. Transfer radishes to another small heatproof bowl.",
    "Pour hot pickling liquid over onions and radishes to cover. (It's important to pickle the onions and radishes first. The liquid will turn purple when the beets are cooked in it.) Bring remaining pickling liquid to a boil; add beets and cook until crisp-tender, about 15 minutes. Transfer beets to a third small heatproof bowl. Pour pickling liquid over to cover; discard remaining liquid.",
    "Let vegetables cool. Cover and chill overnight or up to 1 week ahead.",
    "Drain vegetables and cut into bite-size pieces, if desired; return to individual bowls. Drizzle vegetables with oil and season with salt and pepper. Garnish with parsley."
  ],
  "ingredients": [
    "0",
    "1",
    "pound",
    "fresh (or frozen, thawed) pearl onions",
    "3",
    "cups",
    "white wine vinegar",
    "1/4",
    "cup",
    "sugar",
    "1 1/2",
    "tablespoons",
    "kosher salt plus more",
    "10",
    "whole black peppercorns",
    "2",
    "garlic cloves",
    "1",
    "bay leaf",
    "1",
    "sprig rosemary",
    "2",
    "bunches radishes, trimmed",
    "2",
    "bunches 1-inch-diameter baby beets, trimmed",
    "Olive oil (for drizzling)",
    "Freshly ground black pepper",
    "1/2",
    "cup",
    "coarsely chopped flat-leaf parsley"
  ],
  "__v": 1
}