{
  "hash": "27e6c8479a0a256d1775356f435a3748116acd83",
  "title": "Gluten Free Pizza Crust Recipe - Vegan!",
  "image": "http://alittleinsanity.wpengine.netdna-cdn.com/wp-content/uploads/2015/04/gluten-free-pizza-crust-recipe-vegan-300x200.jpg",
  "href": "http://alittleinsanity.com/gluten-free-pizza-crust-recipe-vegan/",
  "extension": "",
  "firstAdded": "2015-10-31T20:17:54.038000",
  "users": [
    null
  ],
  "keywords": [
    "water",
    "honey",
    "sugar",
    "active",
    "dry",
    "yeast",
    "erikas",
    "purpose",
    "gluten",
    "free",
    "flour",
    "blend",
    "baking",
    "energ",
    "egg",
    "replacer",
    "salt",
    "garlic",
    "onion",
    "pepper",
    "season",
    "olive",
    "oil",
    "apple",
    "cider",
    "vinegar",
    "extra",
    "tapioca",
    "starch",
    "cornstarch",
    "dusting",
    "hands",
    "rolling",
    "dough",
    "cornmeal",
    "crust"
  ],
  "directions": [
    "0",
    "In bowl of Stand Mixer, add Yeast Mix Ingredients in the order listed. Start with the warm water and stir in the honey, then gently add your Dry Active Yeast. Set-Aside to proof for approximately 10 minutes while you prepare you other ingredients & work surface.",
    "Whisk all of the Dry Ingredients into a small bowl.",
    "On a cutting board, layout 2 large squares of Parchment Paper and dust bottom of paper with a little Tapioca Starch & Cornmeal - then set aside.",
    "When yeast is done proofing, add your dry ingredients to the stand mixer bowl.",
    "Using the paddle attachment, mix all ingredients on a Low-Medium speed until roughly blended... With the machine running, drizzle in your Wet Ingredients starting with the Olive Oil and then the Apple Cider Vinegar.",
    "Mix on Medium-High Speed for approximately 2 minutes until dough is completely blended. It will be very loose & sticky.",
    "Use a spatula to divide the dough into 2 separate mounds on the two parchment papers - Dough will be very sticky!",
    "Dust your hands and the dough surface generously as you shape the mounds into two disks. Using your dusted rolling pin, gently roll out the pizza dough evenly until the dough is approximately ¼\" - ½\" thick.",
    "Preheat oven and Baking Stone to 400 degrees.",
    "Allow the crusts to proof for approximately 20 minutes while your oven is pre-heating.",
    "While the crusts are proofing, prepare your sauce and topping ingredients - but do NOT top the pizza crust until AFTER the crust has been Pre-Baked.",
    "Pre-Bake the crusts on the parchment paper and on the baking stone for 10 minutes.*",
    "Remove crust from oven and top with your sauce and toppings.",
    "Return Pizza to baking stone and bake an additional 10-15 minutes until cheese is melted and crust is browned.",
    "Remove Pizza from oven and allow to cool for 5-10 minutes before slicing & eating."
  ],
  "ingredients": [
    "0",
    "1½ Cups Warm Water",
    "3 Tablespoons Honey or Sugar",
    "2¼ Teaspoons Active Dry Yeast",
    "1",
    "3 Cups Erika's All Purpose Gluten Free Flour Blend",
    "4 Teaspoons Baking Powder",
    "1 Tablespoon Ener-G Egg Replacer",
    "1 Teaspoon Salt",
    "½ Teaspoon Garlic Powder",
    "½ Teaspoon Onion Powder",
    "¼ Teaspoon Pepper (or season to taste)",
    "2",
    "¼ Cup Olive Oil",
    "2 Tablespoons Apple Cider Vinegar",
    "3",
    "Extra Tapioca Starch or Cornstarch for dusting hands & rolling out dough.",
    "Finely Ground Cornmeal for dusting the bottom of your crust."
  ],
  "__v": 1
}