{
  "hash": "8ed9590643216266e84880822baaa10889ebe36d",
  "title": "PRINT RECIPE\n5\n5 / 5 (140 Reviews)\nDid you make this recipe?\nLEAVE A REVIEW »\nYIELD: 8 SERVINGS\nCOZY AUTUMN WILD RICE SOUP",
  "image": "https://www.gimmesomeoven.com/wp-content/uploads/2018/10/Autumn-Wild-Rice-Soup-Recipe-4-360x360.jpg",
  "href": "https://www.gimmesomeoven.com/cozy-autumn-wild-rice-soup/",
  "extension": "Chrome",
  "firstAdded": "2018-12-06T19:06:26.558000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTANT POT (PRESSURE COOKER) METHOD:",
    "Combine vegetable stock, wild rice, mushrooms, garlic, carrots, celery, sweet potato, onion, bay leaf and Old Bay seasoning in the bowl of an Instant Pot pressure cooker. Stir briefly to combine.",
    "Cover and set vent to “sealing”. Cook on manual (high pressure) for 25 minutes. Let the Instant Pot rest there for an extra 10 minutes (natural release). Then carefully turn the vent to “venting” and release the remaining pressure (quick release). Remove lid and discard the bay leaf.",
    "Meanwhile, during those final 10 minutes of pressure cooking, prepare your cream sauce on the stove. In a medium saucepan, cook the butter over medium-high heat until melted. Whisk in the flour until combined, and cook for 1 minute. Gradually add in the milk, and whisk until combined. Continue cooking, stirring frequently, until the mixture nearly comes to a simmer and has thickened. (It should be very thick.)",
    "Add the cream sauce and kale to the soup, and stir gently until combined. Taste and season with salt and pepper (plus any extra Old Bay seasoning, if you would like) as needed.",
    "Serve warm. Or transfer to sealed container(s) and refrigerate for up to 4 days.",
    "CROCK-POT (SLOW COOKER) METHOD:",
    "Combine vegetable stock, wild rice, mushrooms, garlic, carrots, celery, sweet potato, onion, bay leaf and Old Bay seasoning in the bowl of a large slow cooker. Stir briefly to combine.",
    "Cook on high for 4 hours or on low for 8 hours, until the rice is cooked and tender.",
    "Meanwhile, during those final 10 minutes of slow cooking, prepare your cream sauce on the stove. In a medium saucepan, cook the butter over medium-high heat until melted. Whisk in the flour until combined, and cook for 1 minute. Gradually add in the milk, and whisk until combined. Continue cooking, stirring frequently, until the mixture nearly comes to a simmer and has thickened. (It should be very thick.)",
    "Add the cream sauce and kale to the soup, and stir gently until combined. Taste and season with salt and pepper (plus any extra Old Bay seasoning, if you would like) as needed.",
    "Serve warm. Or transfer to sealed container(s) and refrigerate for up to 4 days.",
    "STOVETOP METHOD:",
    "Heat (an extra) 1 tablespoon butter in a large stockpot over medium-high heat. Add onion and sauté for 5 minutes, stirring occasionally, until soft and translucent. Stir in the garlic and cook for an additional 1-2 minutes, stirring occasionally, until fragrant.",
    "Add in the vegetable stock, wild rice, mushrooms, carrots, celery, sweet potato, bay leaf and Old Bay seasoning. Stir to combine.",
    "Continue cooking until the soup reaches a simmer. Then reduce heat to medium-low, cover and simmer for 45 minutes, or until the rice is tender, stirring occasionally.",
    "Meanwhile, during those final 10 minutes, prepare your cream sauce in a separate saucepan on the stove. In it, cook the butter over medium-high heat until melted. Whisk in the flour until combined, and cook for 1 minute. Gradually add in the milk, and whisk until combined. Continue cooking, stirring frequently, until the mixture nearly comes to a simmer and has thickened. (It should be very thick.)",
    "Add the cream sauce and kale to the soup, and stir gently until combined. Taste and season with salt and pepper (plus any extra Old Bay seasoning, if you would like) as needed.",
    "Serve warm. Or transfer to sealed container(s) and refrigerate for up to 4 days."
  ],
  "ingredients": [
    "0",
    "6 cups vegetable stock (or chicken stock)",
    "1 cup uncooked wild rice*",
    "8 ounces baby bella mushrooms, sliced",
    "4 cloves garlic, minced",
    "2 medium carrots, diced",
    "2 ribs celery, diced",
    "1 large (about 1 pound) sweet potato, peeled and diced",
    "1 small white onion, peeled and diced",
    "1 bay leaf",
    "1 1/2 tablespoon Old Bay seasoning",
    "3 tablespoons butter",
    "1/4 cup all-purpose flour",
    "1 1/2 cups milk",
    "2 large handfuls of kale, roughly chopped with thick stems removed",
    "Kosher salt and freshly-cracked black pepper"
  ],
  "__v": 1
}