{
  "hash": "2273a3f2567ea60eeb4d3843abf0a8c12f01d99a",
  "title": "Buttermilk Mushroom Soup",
  "image": "http://www.onehundredeggs.com/wp-content/uploads/2010/10/mushroom-soup-12.jpg",
  "href": "http://www.onehundredeggs.com/buttermilk-mushroom-soup/",
  "extension": "Firefox",
  "firstAdded": "2017-12-11T01:34:21.686000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large pot, heat the butter and olive oil together over medium-high heat. Add the onions, and cook until just translucent, 5 to 10 minutes. Add the celery, potato, and garlic, and cook until softened, another 5 to 10 minutes.",
    "Meanwhile, chop the mushrooms into 1 inch pieces as needed. Reserve about 2 cups, to be added in later. Add the remaining mushrooms to the pot, and cook until softened, about 5 minutes.",
    "Add the white wine or vermouth, scraping the bottom of the pot to release any browned bits. Cook until nearly dry, then season lightly with salt and pepper. Add the bay leaf, thyme, and stock. Add enough water to cover all vegetables with liquid; you may not need much. Bring to a boil, then reduce heat to medium-low and simmer for at least 15 minutes, or until all vegetables are very soft.",
    "Purée soup in the pot with an immersion blender, or by transferring in batches to a blender, taking care to hold the lid securely on when puréeing the hot soup. The blended soup will be very thick. Return soup to the pot, and add the reserved mushrooms. Cover and cook over medium-low heat for about 10 minutes, or until mushrooms have softened. Add the chopped parsley and buttermilk. Taste, and correct seasoning with salt and pepper. Serve with a drizzle of olive oil on top and some crusty bread."
  ],
  "ingredients": [
    "0",
    "2 tablespoons butter",
    "1 tablespoon olive oil",
    "2 medium onions, chopped",
    "3 ribs of celery, chopped",
    "1 large potato (about 12 ounces), diced",
    "6 cloves garlic, minced",
    "5 ounces oyster mushrooms",
    "5 ounces shiitake mushrooms, stemmed",
    "1 pound crimini mushrooms",
    "1/2 cup white wine (or dry vermouth, or a splash of brandy)",
    "1 bay leaf",
    "2 tablespoons dried thyme (or several sprigs of fresh thyme)",
    "2 cups vegetable or chicken stock",
    "1/4 cup minced fresh parsley",
    "1 1/4 cups buttermilk, at room temperature",
    "Salt and pepper, as needed",
    "Olive oil, for garnish"
  ],
  "__v": 1
}