{
  "hash": "82cdd44474e53d8a1e15a85b287e4f63b0e108bf",
  "title": "Instant Pot Crack Chicken",
  "image": "http://recipe-folder.com/img/recipe-images/020/232/3646370820.jpg",
  "href": "http://recipe-folder.com/recipe/5e378b0a48b072082129535a",
  "extension": "User Added",
  "firstAdded": "2020-02-03T02:52:58.697000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Add the water to the inner liner pot of the pressure cooker.",
    "1",
    "Add the chicken breasts to the pot, overlapping as little as possible for even cooking.",
    "2",
    "Sprinkle the ranch dressing over the chicken.",
    "3",
    "Break the block of cream cheese up into chunks and put them in the pot.",
    "4",
    "Close the lid and set the steam release knob to the Sealing position.",
    "5",
    "Press the Pressure Cook/Manual button or dial, then the +/- button or dial to select 20 minutes. High Pressure. The pot will take several minutes to come to pressure. Smaller, thinner chicken breasts need less cook time.",
    "6",
    "When the cook cycle has finished, turn off the pot and let it sit undisturbed for 10 minutes (10 minute natural release). Then turn the steam release knob to the Venting position to release any remaining steam/pressure.",
    "7",
    "When the pin in the lid drops back down, open the lid and turn off the pot.",
    "8",
    "Remove the chicken breasts to a plate.",
    "9",
    "Whisk the cream cheese liquid left in the pot. Then gradually whisk in the cheddar cheese until it melts.",
    "10",
    "Using two forks, shred the chicken and add it back into the pot.",
    "11",
    "Add the bacon to the pot and stir well to combine.",
    "12",
    "The mixture may look just a little watery, but it will not stay that way. If it is too watery (this might be the case if you used frozen chicken) you can turn on the sauté setting for a short time and stir to cook off some of the water.",
    "13",
    "Serve on buns, or over rice, or with pasta."
  ],
  "ingredients": [
    "0",
    "1/2 cup Water",
    "1",
    "2 lbs Boneless Skinless Chicken Breasts* (about 4 8oz breasts)",
    "2",
    "1 (1 oz) packet Ranch Dressing Mix",
    "3",
    "1 (8 oz) block Cream Cheese (room temperature)",
    "4",
    "To Finish",
    "5",
    "1 cup Cheddar Cheese (shredded, not from a bag)",
    "6",
    "8 slices Cooked Thick Cut Bacon, chopped"
  ],
  "__v": 1,
  "hidden": true
}