{
  "hash": "b67771de27a4ac80d6741b650394a772e8b5f74f",
  "title": "Raw Vegan Creamy Cheese",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2013/12/Raw-Vegan-Creamy-Cheese-of-Mont-Saint-whole-finished-1066x800.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/raw-vegan-creamy-cheese/",
  "extension": "",
  "firstAdded": "2015-04-01T06:05:50.517000",
  "users": [
    null
  ],
  "keywords": [
    "blender",
    "colander",
    "cheese",
    "cloth",
    "nut",
    "milk",
    "strainer",
    "nylon",
    "mesh",
    "plate",
    "bowl",
    "weigh",
    "used",
    "dry",
    "peas",
    "dumbbells",
    "jugs",
    "water",
    "work",
    "macadamia",
    "nuts",
    "cashew",
    "cover",
    "herbs",
    "spices"
  ],
  "directions": [
    "0",
    "Blend everything together (If you are not using a high speed blender, you may need to occasionally stop and scrape the mixture off the sides back onto the blade. Pulse from time to time, making sure there is always some mixture touching the blades). Make sure the nuts are well ground and the mixture is creamy.",
    "Place the colander on a plate (this will stop the whey, which will be strained out in the process, from making a mess on the table). Place cheese cloth inside the colander.",
    "Pour the mixture onto the cloth (on the right, you can see the consistency is blobby, not liquidy).",
    "Place the bag inside another one, or if you only own one- try turn it over itself, just as long as no mixture can escape when placing a weight on top.",
    "Place whatever you decided to use as a weight on top and put the stack in a place away from draughts (mine is inside the dehydrator with trays out).",
    "Walk away for 24 hours. (I must admit I can never just walk away and readjusted the weight from time to time to squeeze more Whey out and also tasted the cheese in the process, but 24 hours seems to be the perfect time).",
    "Transfer to the fridge for half an hour to harden, shape into logs and then roll into any herbs or spices you like (I had one log in Cracked Black, Red Pepper and Paprika and the other log in a Mix of Dried Herbs including Thyme, Marjoram, Parsley, Oregano, Sage and Basil)."
  ],
  "ingredients": [
    "0",
    "Blender",
    "Colander",
    "Cheese Cloth/ Nut Milk Strainer/ Nylon Mesh",
    "Plate",
    "Bowl",
    "Something heavy to weigh down the bowl (I used dry peas, but dumbbells or jugs with water will also work well)",
    "1",
    "1/2 Cup Macadamia Nuts",
    "1/2 Cup Cashew Nuts",
    "1/2 Cup + 2 Tbsp Pure Water (or just enough to cover all the nuts when in blender)",
    "Optional: Herbs and Spices"
  ],
  "__v": 1
}