{
  "hash": "2016b07859958c18c16a29c04c4b38b8c94548bb",
  "title": "La cazuela,",
  "image": "http://www.eluniverso.com/sites/default/files/styles/nota_ampliada_normal_foto/public/fotos/2015/07/vg10cc230715photo01.jpg?itok=uBV0etFp",
  "href": "http://www.eluniverso.com/noticias/2015/07/23/nota/5032786/plato-tipico-costeno-casero",
  "extension": "Chrome",
  "firstAdded": "2015-07-27T18:11:33.806000",
  "users": [
    null
  ],
  "keywords": [
    "ingredientes",
    "mariscos",
    "calamar",
    "camarn",
    "pulpo",
    "mejillones",
    "pescado",
    "verde",
    "limpio",
    "man",
    "refrito",
    "litro",
    "agua",
    "sal",
    "pimienta",
    "gusto",
    "onza",
    "achiote"
  ],
  "directions": [
    "0",
    "Primero debes licuar el verde con un litro de agua para luego colocar la mezcla en una olla y hervirla durante 12 minutos.",
    "Aparte debes rociar un sartén con mantequilla y colocar cebolla, pimiento y tomate cortado en cuadritos. Adiciona sal y comino al gusto y deja cocinar durante 8 minutos. Luego mezcla el verde cocinado con esta preparación.",
    "Licua el maní con el achiote y agrégalo a la masa de verde. Déjalo cocinar por 10 minutos.",
    "Una vez que esté lista la masa de verde, calienta un sartén para que puedas saltear los mariscos con un poco de mantequilla, pimienta y sal al gusto para después mezclarlo con el verde.",
    "De una forma tradicional, este plato se acostumbra servir en una vasija de barro, que debe colocarse en el horno durante 10 minutos, a 150 grados, para que se gratine y se sirva muy caliente.",
    "La mayoría de las personas complementan el plato con una porción de arroz, aunque también se puede comer con una orden de patacones. (I)"
  ],
  "ingredients": [
    "0",
    "Ingredientes:",
    "225 g de mix de mariscos (calamar, camarón, pulpo, mejillones y pescado).",
    "250 g de verde limpio.",
    "150 g de maní.",
    "30 g de refrito.",
    "Un litro de agua.",
    "Sal y pimienta al gusto.",
    "1 onza de achiote."
  ],
  "__v": 1
}