{
  "hash": "b03b314bcdece667056d5a25bb888e858c65eb71",
  "title": "Pan-fried Crispy Ribs",
  "image": "https://www.chinasichuanfood.com/wp-content/uploads/2018/04/pan-fried-crispy-ribs-9.jpg",
  "href": "https://www.chinasichuanfood.com/pan-fried-crispy-ribs/",
  "extension": "Chrome",
  "firstAdded": "2018-08-25T23:16:14.917000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Soak the ribs with clean water for around 15 minutes. Remove the seed of the peppers and cut into small chunks.",
    "Add ribs in a pot with enough cold water, add 1 scallion and several slices of ginger and cooking wine. Bring to a boil, slow down the fire and simmer for 10 minutes or until soft as wanted (depending how soft you want the ribs to be). Cover the lid and soak the ribs with the water until completely cooled down.",
    "Add ½ tsp salt, sugar, light soy sauce and oyster sauce. Mix well and set aside for 10 minutes. Coat with starch just before pan-frying.",
    "Drizzle 1 tablespoon of cooking oil in a pan and heat until hot. Fry the ribs over slow to medium fire until golden brown and crispy on both sides. Move the ribs to one side of the pan and fry garlic, ginger and chili pepper if you are using until aromatic.",
    "Place the fresh peppers in and fry until soft. Sprinkle salt, cumin powder and sesame seeds. Add sections of 1 scallion at last. Transfer out and serve immediately."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "500g ribs",
    "2 long green peppers, cut into small chunks",
    "1 red fresh peppers, cut into small chunks",
    "3 scallions, divided",
    "2-3 slices of ginger",
    "1 tbsp. cooking wine",
    "1 tsp salt, divided",
    "1/4 tsp. sugar",
    "1/2 tbsp. oyster sauce",
    "1 tbsp. light soy sauce",
    "3 tbsp. cornstarch (I use sweet potato flour this time, but cornstarch works fine too)",
    "1 tbsp. cooking oil",
    "2 garlic cloves, chopped",
    "2-3 dried red chili pepper (optional) for a hotter version",
    "1 tsp. minced ginger",
    "1 tbsp. cumin powder",
    "1 tbsp. toasted white sesame seeds"
  ],
  "__v": 1
}