{
  "hash": "3a93edfa18cd76fe4fe89799177c6cecc713d478",
  "title": "Seeded Whole Grain Breakfast Bread.",
  "image": "https://www.halfbakedharvest.com/wp-content/uploads/2014/09/Seeded-Whole-Grain-Breakfast-Bread-171.jpg",
  "href": "https://www.halfbakedharvest.com/seeded-whole-grain-breakfast-bread/",
  "extension": "Chrome",
  "firstAdded": "2017-08-29T11:42:33.332000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "The night before baking the bread make the preferment. In the bowl of your stand mixer, mix together the flour, water and yeast until a smooth paste forms. Cover the bowl and allow the preferment to ripen at room temperature overnight. The preferment will double in size and become bubbly on top as it sits.",
    "The next day measure out 1/4 cup warm water in a glass measuring cup or bowl. Add the yeast and honey. Mix to combine and then allow the mixture to sit, undisturbed for 5 minutes or until the mixture is foamy on top and smells like bread. During the same time add the remaining 1 1/4 cups warm water to a bowl. Add the oats and ground flax. Allow this mixture to sit 5 minutes.",
    "After 5 minutes add both the yeast mixture and oats mixture to the bowl with the preferment from the night before. Add the whole wheat flour, bread flour and salt. Using the dough hook, mix the dough on medium speed for 4-6 minutes. If the dough seems extremely sticky, add 1-2 tablespoons flour. Now add in 3-4 tablespoons of the mixed seeds. mix until combined.",
    "Remove the dough from the bowl and knead with your hands on a floured surface for a minute or two.",
    "Grease the bowl you mixed the dough in and place the dough back in the bowl. Cover with plastic wrap and place in a warm area for 1 1/2 to 2 hours or until the dough has doubled in size.",
    "Once the dough has doubled in size, preheat to the oven 450 degrees F. Place a 5-quart, or larger, cast iron dutch oven with a tight fitting lid in the center of the rack. You may also use a baking stone, but I have found the the dutch oven with a lid works the best.",
    "Punch the dough down with your fist and then scoop it out onto a floured work surface. Knead the dough a few times with your hands and then form the dough into rough oval or circle shape (if needed, you can divided the dough in half and make two loafs). Place the dough on a parchment lined baking sheet and cover with a damp kitchen towel. Allow the dough to rise 20-30 minutes.",
    "After 20-30 minutes, brush the dough with the beaten egg and then sprinkle with the remaining mixed seeds. Using a sharp knife, gently make a small slit down the center of the loaf. Drizzle the the seeds with 1-2 teaspoons honey.",
    "When the dough is ready to bake, carefully remove the hot dutch oven from the oven using oven mitts and remove the lid. Very carefully, pick the dough up by the parchment paper and lift into the hot dutch oven. Using oven mitts, place the hot lid back on the pot and return to the oven. Bake for 20 minutes, then reduce the heat to 375 degrees F. Using oven mitts, remove the hot lid and continue baking until the bread is a deep, golden brown, about 15-20 minutes more. Remove from the oven. Using a thin handle of a spatula, carefully lift the bread out of the pot and place it on a rack to cool completely, about 2 hours. Don't slice into the bread right out of the oven, the bread continues to cook as it cools.",
    "*If you do not have stand mixer, you can knead the dough by hand on a flour surface. [Here is a great tutorial | http://allrecipes.com/video/36/how-to-knead-dough/detail.aspx] on how to knead dough. **If you do not have a dutch oven, the dough can just be baked on a cookie sheet. Just be aware that the cooking time may very slightly and you may not get the some crusty on the outside soft on the inside results. ***The dough can be divided in half for small loafs or to be frozen."
  ],
  "ingredients": [
    "0",
    "Preferment",
    "1 cup bread flour",
    "1/2 cup warm water",
    "1/4 teaspoon active dry or instant yeast",
    "Final Dough",
    "2 teaspoons active dry yeast",
    "3 tablespoons honey plus more for drizzling",
    "1 1/2 cups warm water divided",
    "1 cup old fashions oats",
    "3 tablespoons ground flax",
    "1 1/2 cups while wheat flour",
    "1 1/4 cups bread flour plus more for kneading",
    "1 teaspoon salt",
    "1 egg beaten",
    "1 cup mixed pumpkin seeds sunflower seeds, black and or white sesame seeds and flax seeds)"
  ],
  "__v": 1
}