{
  "hash": "4ecffb4ebcff994760974916434e7c7fe0810da2",
  "title": "Snickers Cheesecake Bars",
  "image": "http://cf.fivehearthome.com/wp-content/uploads/2015/07/Snickers-Cheesecake-Bars-Oreo-Crust-Chocolate-Caramel-Cream-Cheese-Peanut-Dessert-Recipe-by-Five-Heart-Home_700pxCollage.jpg",
  "href": "http://www.fivehearthome.com/2015/08/02/snickers-cheesecake-bars/",
  "extension": "Chrome",
  "firstAdded": "2016-04-13T18:29:00.343000",
  "users": [
    null
  ],
  "keywords": [
    "oreos",
    "butter",
    "slightly",
    "cooled",
    "cream",
    "cheese",
    "room",
    "eggs",
    "sugar",
    "vanilla",
    "fun",
    "sized",
    "snickers",
    "chips",
    "milk",
    "chocolate",
    "semisweet",
    "caramel",
    "storebought",
    "roasted",
    "salted",
    "peanuts"
  ],
  "directions": [
    "0",
    "Adjust rack to center position of oven and preheat to 325°F. Line a 9- by 13-inch baking pan with aluminum foil so that foil overhangs the sides.",
    "To make the crust, place Oreos in a large food processor (or blender, although you may have to divide Oreos into a couple of batches). Process until Oreos break up into fine crumbs. Transfer Oreo crumbs to a medium bowl, pour in melted butter, and stir until crumbs are evenly moistened. Dump crumb mixture into prepared pan and press into an even layer on the bottom and slightly up the sides. Bake for 10 minutes; cool on a wire rack while preparing the filling.",
    "To make the cheesecake filling, use an electric mixer to beat together the cream cheese, eggs, sugar, and vanilla until smooth and creamy, for 2 to 3 minutes. Stir in the chopped Snickers and pour the mixture into the cooled crust, spreading into an even layer. Bake for 35 to 45 minutes or until the cheesecake is set, puffed up, and has a few light golden spots and edges. Cool on a wire rack for an hour.",
    "Melt the chocolate chips by microwaving for 30 seconds, stirring, and repeating until chips are smooth and melted. While chocolate is cooling for a couple of minutes, pour caramel sauce into a plastic sandwich baggie. Squeeze the caramel into a corner of the bag and snip a tiny piece off of that corner. Use baggie as a piping bag to drizzle caramel all over the surface of the cheesecake, horizontally and vertically. In the same way, use another sandwich baggie to drizzle melted chocolate over cheesecake, diagonally in both directions. Sprinkle chopped peanuts over cheesecake and refrigerate for at least 3 hours until set. Use foil to lift cheesecake out of the pan and cut into 24 squares (or just cut cheesecake in the pan and lift out bars individually)."
  ],
  "ingredients": [
    "0",
    "35 Oreos",
    "6 tablespoons butter, melted & slightly cooled",
    "24 ounces (3 8-ounce packages) cream cheese, at room temperature",
    "3 large eggs",
    "3/4 cup sugar",
    "1 tablespoon pure vanilla extract",
    "12-ounce package Fun Sized Snickers, chopped (about 20 Snickers, or 2 1/4 cup chopped)",
    "1/2 cup chocolate chips (milk chocolate or semi-sweet)",
    "1/2 cup caramel sauce (store-bought or homemade)",
    "1/2 cup roasted salted peanuts, chopped"
  ],
  "__v": 1
}