{
  "hash": "bd7db49db52e884b98fb93002d7b804ca8a0d5c3",
  "title": "Chai Latte",
  "image": "http://recipe-folder.com/img/recipe-images/097/079/2222486597.gif",
  "href": "https://www.thekitchn.com/how-to-make-a-chai-tea-latte-242520",
  "extension": "Firefox",
  "firstAdded": "2019-07-14T23:51:47.309000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Toast the spices. Place the cinnamon, peppercorns, cloves, and cardamom in a small saucepan over medium heat and toast, shaking the pan occasionally, until fragrant, 3 to 4 minutes.",
    "Brew the tea. Add the water and ginger and bring to a simmer. Simmer for 5 minutes.",
    "Steep the tea. Remove from the heat and add the loose-leaf tea or tea bags. Cover and steep for 10 minutes.",
    "Sweeten the tea. While the tea is still warm, add the sweetener and stir until combined or dissolved.",
    "Strain the tea. Strain the tea through a fine-mesh strainer into a pitcher or teapot. Discard the spices and tea leaves. Store in the refrigerator for future use, or keep it warm while you froth the milk.",
    "Froth the milk. For whole milk, froth the milk by shaking it in a jar or by whisking it vigorously over medium-high heat. For non-dairy milks, use an immersion blender to froth before heating.",
    "Heat the milk. Heat the frothed milk in a small saucepan over low heat until warm.",
    "Serve. Pour 3/4 cup of the warm tea base into each mug. Add 1/2 cup of warmed milk and stir to combine. Top with a heaping spoonful of milk froth."
  ],
  "ingredients": [
    "0",
    "2 cinnamon sticks, broken into pieces",
    "2 teaspoons whole black peppercorns",
    "10 whole cloves",
    "6 green cardamom pods, cracked",
    "4 cups water",
    "1 (2-inch) piece fresh ginger, thinly sliced",
    "2 tablespoons loose-leaf black tea, or 6 black tea bags",
    "1/2 cup sweetener, such as brown sugar, honey, or maple syrup (optional)",
    "3 cups cold whole milk, coconut milk, or other non-dairy milk"
  ],
  "__v": 1
}