{
  "__v": 1,
  "directions": [
    "0",
    "Per prima cosa prepara il brodo per cuocere il risotto ai funghi: non è un semplice brodo vegetale, è fatto semplicemente di odori che tradizionalmente si abbinano ai funghi, prima tra tutti la nepitella.",
    "Fai bollire l'acqua con il sale e il mazzettino di erbe aromatiche per 5 minuti, poi filtralo e lascialo da parte.",
    "Pulisci i porcini freschi e tagliati a pezzetti irregolari.",
    "Scalda qualche cucchiaio di olio in una padella antiaderente con due spicchi d'aglio: quando l'aglio prende colore, aggiungi i funghi. Se utilizzi funghi congelati, è il momento di aggiungerli in padella, senza scongelarli prima.",
    "Fai cuocere i funghi per circa 10 minuti, in modo che ritirino l'acqua che produrranno, fino a che non sono morbidi ma non disfatti. Regolali di sale e mettili da parte.",
    "Inizia la cottura del risotto facendo cuocere una cipolla affettata sottile sottile in qualche cucchiaio di olio d'oliva, a fuoco basso, fino a che non si ammorbidisce.",
    "Versa il riso e fallo tostare, mescolandolo spesso, fino a che non diventa traslucido.",
    "Continua la cottura del risotto aggiungendo mano a mano il brodo fatto con gli odori, mescolando spesso con un cucchiaio di legno. Dopo circa 15 minuti aggiungi i funghi, mescola per amalgamare tutti i sapori, e continua la cottura per altri 5 minuti, aggiungendo altro brodo se necessario.",
    "Una volta che il riso è al dente, toglilo dal fuoco, aggiungi qualche cucchiaio di parmigiano grattato e manteca il risotto con un mestolo in legno.",
    "Servi con del prezzemolo fresco tritato."
  ],
  "firstAdded": "2014-10-10T11:36:15.067000",
  "hash": "573b5b986285063df040ee1a003c33ea123c03f2",
  "href": "http://it.julskitchen.com/toscana/risotto-ai-funghi-porcini",
  "image": "http://farm9.staticflickr.com/8046/8105222521_9f5301bba8_h.jpg",
  "ingredients": [
    "0",
    "1,5 l di acqua",
    "1 mazzetto di odori (salvia, rosmarino, nepitella)",
    "sale grosso",
    "500 g di porcini",
    "2 spicchi di aglio",
    "1 peperoncino secco",
    "1 cipolla bianca",
    "400 g di riso Carnaroli",
    "Parmigiano Reggiano grattato",
    "prezzemolo fresco"
  ],
  "keywords": [
    "acqua",
    "mazzetto",
    "odori",
    "salvia",
    "rosmarino",
    "nepitella",
    "sale",
    "grosso",
    "porcini",
    "spicchi",
    "aglio",
    "peperoncino",
    "secco",
    "cipolla",
    "bianca",
    "riso",
    "carnaroli",
    "parmigiano",
    "reggiano",
    "grattato",
    "prezzemolo",
    "fresco"
  ],
  "title": "Risotto ai funghi porcini",
  "users": [
    null
  ]
}