{
  "hash": "64576ad936f63aa4a1853d5bf7393862006ca70f",
  "title": "Indian Samosa Casserole",
  "image": "https://www.vegetariantimes.com/.image/t_share/MTQ2OTk0MTM2MDYxNjUwMDE1/indian-samosa-casserole-jan-2010-crop.jpg",
  "href": "https://www.vegetariantimes.com/recipes/indian-samosa-casserole",
  "extension": "Chrome",
  "firstAdded": "2017-07-03T23:01:59.813000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparation",
    "1. To make Crust: Preheat oven to 375°F. Whisk together flours and salt in bowl. Stir in oil until clumps form. Add 6 to 10 Tbs. cold water, 1 Tbs. at a time, until dough holds together. Shape into ball, cover with damp towel, and set aside.",
    "2. To make Filling: Stir together mustard seeds, curry, ginger, cumin, and red pepper flakes, if using, in bowl; set aside.",
    "3. Cook potatoes in boiling salted water 15 minutes, or until tender. Drain, return to pot, and mash, leaving small chunks.",
    "4. Heat oil in skillet over medium heat. Add onion, carrot, and garlic, and sauté 5 minutes, or until carrot is tender. Move onion mixture to side of pan, and add mustard seed mixture in center. Toast 30 seconds. Stir in peas and broth. Fold onion mixture into potato mixture; stir in agave nectar. Season with salt and pepper, if desired. Spread Filling in 9-inch pie pan. Set aside.",
    "5. Roll out Crust dough to 11-inch circle on floured work surface. Cover Filling with dough, pressing down to make sure no air pockets remain. Trim away excess dough, and crimp edges with fingers. Cut X in center to vent steam; brush with soymilk just before baking. Place pie on baking sheet, and bake 40 to 50 minutes, or until crust is golden. Let stand 5 minutes before serving.",
    "6. Frozen cooking instructions: Preheat oven to 375°F. Place casserole on baking sheet, and bake 75 to 90 minutes, or until Filling bubbles and Crust is golden. Let stand 5 minutes before serving."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Crust",
    "1/2 cup all-purpose flour",
    "1/2 cup whole-wheat pastry flour",
    "1/4 tsp. salt",
    "2 Tbs. vegetable oil",
    "Filling",
    "1 Tbs. black or yellow mustard seeds",
    "1 tsp. curry powder",
    "1 tsp. ground ginger",
    "1/2 tsp. ground cumin",
    "1/8 tsp. red pepper flakes, optional",
    "5 medium potatoes, peeled and quartered (1 1/4 lb.)",
    "1 medium onion, diced (1 cup)",
    "1 medium carrot, diced (1/2 cup)",
    "3 cloves garlic, minced (1 Tbs.)",
    "1 cup frozen peas",
    "1 cup low-sodium vegetable broth",
    "2 tsp. agave nectar or sugar",
    "2 Tbs. soymilk"
  ],
  "__v": 1
}