{
  "__v": 1,
  "directions": [
    "0",
    "Fate bollire i paccheri anzi più che bollire fateli sobbollire in modo da evitare per quanto possibile che si rompano, poi scolateli al dente diciamo un paio di minuti prima del tempo di cottura consigliato sulla confezione e poneteli a raffreddare su un canovaccio.",
    "Setacciate la ricotta e mescolatela al basilico tritato grossolanamente e con questo composto riempite la sacca.",
    "Mentre la pasta cuoce preparate la salsa di pomodoro, io faccio cuocere la passata con solo sale e aglio aggiungendo solo alla fine un paio di foglie di basilico e un giro d’olio a crudo.",
    "Preparate una placchetta rivestendola di carta forno. Stendete un paio di cucchiaiate di salsa e ponetevi sopra i paccheri già farciti, accostandoli bene l’uno all’altro.",
    "Nappate tutta la superficie dei paccheri con abbondante salsa di pomodoro e grattugiate in modo uniforme la ricotta salata cercando di non lasciare spazi vuoti.",
    "Infornate per una decina di minuti e servite caldi ma non bollenti considerando 5 – 6 paccheri a porzione.",
    "Accompagnate con un buon bicchiere di vino bianco un Vinae – IGT Bianco Collio Goriziano – Jermann dotato di una nota finale amarognola che dona un buon contrasto alla dolcezza del piatto."
  ],
  "firstAdded": "2014-10-08T15:14:48.582000",
  "hash": "322dcc556c1adc802d94fb572f9c034e877044cd",
  "href": "http://blog.cookaround.com/dentistaaifornelli/paccheri-farciti-di-ricotta-e-basilico/",
  "image": "http://blog.cookaround.com/dentistaaifornelli/wp-content/uploads/2014/02/h6.jpg",
  "ingredients": [
    "0",
    "Ingredienti per quattro porzioni di Paccheri farciti di ricotta e basilico: venti paccheri però fatene bollire 4-5 in più, 250 g di ricotta ovina abbastanza soda, uno spicchio d’aglio rosso, 7-8 foglie di basilico a foglia larga, 300 g di passata a crudo, olio d’oliva extravergine qb, ricotta salata qb, sale qb."
  ],
  "keywords": [
    "ingredienti",
    "quattro",
    "porzioni",
    "farciti",
    "venti",
    "paccheri",
    "fatene",
    "bollire",
    "ovina",
    "abbastanza",
    "soda",
    "uno",
    "spicchio",
    "daglio",
    "rosso",
    "foglie",
    "basilico",
    "foglia",
    "larga",
    "passata",
    "crudo",
    "olio",
    "doliva",
    "extravergine",
    "ricotta",
    "salata",
    "sale"
  ],
  "title": "Paccheri farciti di ricotta e basilico",
  "users": [
    null
  ]
}