{
  "__v": 1,
  "directions": [
    "0",
    "PROCEDIMENTO",
    "\"Per il palermitano la pasta non è un cibo qualsiasi, ma stabilisce un'importante linea di confine tra chi vive per mangiare e chi mangia per vivere. Cioè tra i palermitani e il resto del mondo.\"",
    "Da Cose nostre. Homo Panormitanus di Daniele Billitteri.",
    "Gli anelletti, tipico formato di pasta siciliana, sono i protagonisti principali del piatto che descriverò. Questo trionfo barocco di pasta al forno, o \"timballo di anelletti\", altrimenti conosciuto come \"pasta col forno\", è parte integrante della tradizione gastronomica palermitana ed è legato alla sua storia. I primi timballi palermitani furono elaborati nel IX secolo, durante la dominazione araba, per poi diffondersi in diverse forme in tutta l'isola.",
    "Importanza fondamentale per i siciliani è la facilità di trasporto, poiché spesso il timballo assume il ruolo da protagonista principale in un picnic fuori porta o, a seconda della stagione, nelle ricche tavole delle feste trascorse in famiglia. La ricetta tradizionale di questo trionfale piatto unico è multiforme e può contenere tra i più svariati ingredienti: dal ragù di carne ai piselli, dall'uovo sodo al salame, dal primosale al prosciutto, e via elencando.",
    "La ricetta che vi propongo è una versione \"vegetarianizzata\" per i non carnivori, di gran lunga più \"leggera\" e \"digeribile\" di tutte le altre versioni dell'intera galassia sicula.",
    "PROCEDIMENTO",
    "In una capiente pentola dai bordi alti verserete dell'olio, aggiungerete la cipolla tritata e farete soffriggere. Non appena si sarà dorata aggiungerete la salsa di pomodoro, il sale, il pepe e lascerete cuocere a fuoco basso per almeno mezz’ora. Il sugo dovrà risultare nè troppo denso, nè troppo liquido.",
    "Nel frattempo avrete tagliato la melanzana a cubetti. La friggerete in una padella con sufficiente olio extravergine d'oliva. In una pentola porterete a ebollizione l’acqua per la pasta, verserete gli anelletti e attenderete il tempo di cottura (13 minuti circa).",
    "Mentre la pasta sarà in cottura, avrete tagliato a cubetti i 2/3 del caciocavallo. Scolerete la pasta al dente e condirete con il sugo, le melanzane fritte e il caciocavallo a cubetti, quindi spolverizzerete con il restante caciocavallo grattugiato. Ungerete quindi con un po' d'olio un recipiente in ceramica da forno, lo spolverizzerete con del pangrattato, lo riempirete con gli anelletti conditi e con un'ulteriore spolverata di pangrattato, quindi finirete la cottura gratinando in forno preriscaldato a 180° per circa 20 minuti."
  ],
  "firstAdded": "2014-10-08T15:21:52.064000",
  "hash": "ede7bb0b98bbfd51cc03bc0065bb328f7c9b05aa",
  "href": "http://www.cucchiaio.it/ricette/ricetta-timballo-vegetariano-anelletti",
  "image": "http://www.cucchiaio.it/sites/www.cucchiaio.dev.softecspa.it/files/imagecache/ricetta_immagine_grande_620/ricetta/immagini/2012/12/img_3924x.jpg",
  "ingredients": [
    "0",
    "200 g di anelletti",
    "300 g di salsa di pomodoro",
    "150 g di caciocavallo ragusano"
  ],
  "keywords": [
    "anelletti",
    "salsa",
    "pomodoro",
    "caciocavallo",
    "ragusano"
  ],
  "title": "Timballo (vegetariano) di anelletti",
  "users": [
    null
  ]
}