{
  "hash": "e0df685147a25ab0c71ff06e892758ff82574846",
  "title": "Easy Baked Pesto Chicken",
  "image": "https://1.bp.blogspot.com/-eafWknYYxqc/WH0LUiTAfrI/AAAAAAABMII/PNttD1DmcOUXabfB2Ld8hSMg734PNNF6ACLcB/s1600/1-text-550-easy-baked-pesto-chicken.jpg",
  "href": "http://www.kalynskitchen.com/2010/09/easy-recipe-for-baked-pesto-chicken.html",
  "extension": "Chrome",
  "firstAdded": "2017-03-28T02:51:25.190000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions:",
    "Preheat oven to 375F/190C. Trim all visible fat and tendons from chicken pieces, then cut each chicken breast lengthwise into 2 or 3 pieces. (I cut the larger ones into 3 strips and the smaller ones into 2 strips.)",
    "Spray a 9\" x 12\" (or 8.5\" X 12.5\") baking dish with non-stick spray, then spread 1/4 cup basil pesto over the bottom of the dish. Lay chicken strips over the pesto, then spread 1/4 cup more basil pesto over the chicken. (I used a rubber scraper to spread the pesto in the dish and over the chicken.)",
    "Cover the baking dish with aluminum foil (or use a baking dish with a tight-fitting lid) and bake the chicken for 25-30 minutes, just until chicken is barely firm and cooked through. (Don't cook too much at this point, or the chicken will be overcooked by the time the cheese is melted and browned.)",
    "When chicken is barely cooked through, remove foil and sprinkle chicken with 1/2 cup grated mozzarella cheese. Put dish back into the oven without foil and cook 5 minutes more, just until cheese is melted. (If your broiler is separate from the oven, start preheating it when you take the chicken out.) After I melted the cheese for 5 minutes I switched my oven to broil and broiled for 5 minutes more, just long enough to get the cheese lightly browned."
  ],
  "ingredients": [
    "0",
    "MONDAY, JANUARY 16, 2017",
    "Easy Baked Pesto Chicken",
    "633k",
    "6.53k",
    "29.5k",
    "This Easy Baked Pesto Chicken is a tasty dinner that you can make with purchased pesto if you don't have any in the freezer. This recipe is low-carb, Keto, gluten-free, low-glycemic, and South Beach Diet friendly; use the Recipes-by-Diet-Type Index to find more recipes like this one.",
    "Click here to PIN this easy recipe so you can make it later!",
    "When I first made this Easy Baked Pesto Chicken back in 2010, I'm not sure I ever imagined it would become one of the most popular recipes on the blog. But now it's been pinned 625K+ times and the recipe has been viewed 2.5 Million times! So when I decided recently I wanted to update the photos I decided I would keep the original photo below close to the top of the post so people would recognize it.",
    "I for the inspiration for Easy Baked Pesto Chicken when I was looking in The South Beach Diet Quick and Easy Cookbook for a recipe my friend Bonnie had recommended. That happened to be in the summer, and when it's summertime at my house there's fresh basil on the counter, I'm freezing basil for winter, and I'm making Basil Pesto with Lemon, so it's not really surprising that a recipe using pesto would catch my eye.",
    "If you don't have any basil growing, you can certainly make this ultra-easy main dish with purchased basil pesto, which is what the recipe in the book called for. If you have more fresh basil, or more basil pesto left in your jar after you make this, look after the recipe for some other ideas using pesto.",
    "And here's a fun little story about this recipe. Late last year I started working out with a fantastic trainer named Wendy. Then one time when I showed up at the gym she told me she had gone to get the recipe for her kids' favorite chicken dish, and it turned out to be a recipe from my blog! So just in case you're wondering if this can be kid-friendly, Wendy says her kids love Pesto Chicken and gobble it up for dinner. (She serves it with pasta for the kids, but I'd serve with Cauliflower Rice for a tasty low-carb meal.)",
    "If you want to skip the photos below and watch a video instead, here is a video of how to make this recipe. See more recipe videos on My You Tube Channel.",
    "Trim the boneless-skinless chicken breasts and cut into lenghthwise strips. (I save all the chicken scraps in the freezer and use them to make homemade chicken stock.) Spray the casserole dish with non-stick spray, then spread 1/4 cup of basil pesto over the bottom of the dish. Lay the chicken strips over the pesto and season with salt and fresh ground black pepper. Spread another 1/4 cup of basil pesto over the chicken strips.",
    "Cover the dish with foil and then bake at 375F/190C for 25-30 minutes, or just until the chicken is barely cooked through. (Don't cook too long at this stage, or the chicken will be overcooked when the cheese is melted and browned.)",
    "When chicken is barely cooked through, sprinkle 1/2 cup grated mozzarella cheese (or a little more if you like it cheesy) over the top and bake about 5 minutes more, or until the cheese is melted. (If your broiler is separate from the oven, start preheating it at this point.)",
    "I wanted the cheese to be lightly browned, so after 5 minutes I switched to broil for about 5 minutes, just long enough to get some color on the cheese. Serve hot, maybe with rice or Cauliflower Rice to cover with some of the delicious juice in the bottom of the dish.",
    "Easy Baked Pesto Chicken",
    "(Makes 4 servings, recipe adapted slightly from The South Beach Diet Quick and Easy Cookbook.)",
    "Ingredients:",
    "4 boneless, skinless chicken breasts",
    "salt and fresh ground black pepper for seasoning chicken",
    "1/2 cup basil pesto (I used my homemade Basil Pesto with Lemon, but you can use purchased basil pesto.)",
    "2 oz. (1/2 cup) grated low-fat mozzarella cheese (or more if you like it cheesy!)"
  ],
  "__v": 1
}