{
  "hash": "02176ddd042737ea22ff36e8cc9618c861d341c4",
  "title": "Spicy Portuguese Shrimp",
  "image": "//135457-437256-raikfcquaxqncofqfm.stackpathdns.com/wp-content/uploads/2011/05/Portuguese_Spicy_Shrimp_Camarao_Mozambique-2-of-1.jpg",
  "href": "https://chezus.com/2011/05/31/spicy-portuguese-shrimp/",
  "extension": "Chrome",
  "firstAdded": "2018-06-24T13:45:31.668000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large frying pan, heat the olive oil over low heat.",
    "Add the shallot or the yellow onion, cook over medium-low heat (about a 4 on our gas stove) until soft, about 4 minutes. Add the garlic, stir, and cook for a minute.",
    "Sprinkle the Goya Sazon over the onion, and garlic; add the shrimp.",
    "Stir, and continue cooking over medium-low heat, for 5 minutes; stirring often.",
    "Add the white wine, lemon juice, and Piri Piri, stir, lower heat to a simmer and cook until shrimp are cooked; about 5 – 8 minutes, depending on how large they are.",
    "At this point, I remove the shrimp and continue cooking the broth until it is slightly reduced, and a bit thicker than when I started. It will take about 3 – 5 minutes.",
    "Then return the shrimp to the pan, stir, and turn off the heat.",
    "I like to let it sit for about 10 minutes, to really marry the flavors. Then I gently reheat, stir in the parsley, and remove from the heat.",
    "Serve.",
    "Eat."
  ],
  "ingredients": [
    "0",
    "1 large shallot or 1/2 yellow onion, minced finely",
    "4 cloves garlic, minced finely",
    "2 tablespoons olive oil",
    "1 lb shrimp, leave the shells on",
    "1 cup white wine, I used Vinho Verde, water or fish stock can be used instead",
    "1 lemon, juiced",
    "1 – 2 tablespoons Piri Piri, or your favorite hot sauce – add according to the heat you like",
    "handful parsley for garnish",
    "1 packet Goya Sazon Con Culantro y Achiote or 1 1/2 teaspoons annatto if you cannot find the Goya"
  ],
  "__v": 1
}