{
  "hash": "c50d19e36b8660becf7d6961b9d2e4c6c73ec2ce",
  "title": "Stove Top Southwest Tuna Mac and Cheese",
  "image": "https://www.ambitiouskitchen.com/wp-content/uploads/2017/10/macncheese-2-300x300.jpg",
  "href": "https://www.ambitiouskitchen.com/stove-top-southwest-tuna-mac-and-cheese/",
  "extension": "Chrome",
  "firstAdded": "2019-05-05T10:21:03.254000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "First boil the noodles until al dente, according to the directions on the package. Once done cooking, drain and set aside.",
    "While the noodles are boiling, make a slurry: In a large oven safe skillet or pot add butter and garlic. Once butter is melted, whisk in the flour and cook for 30 seconds until a paste forms. Slowly add in cashew milk, whisking away any lumps. Increase heat and bring mixture to a boil, then reduce heat and simmer for 5-10 minutes stirring every so often, until the sauce thickens up similar to a gravy.",
    "Next add in 6 oz cheese and 1 packet of taco seasoning and stir until completely melted. Finally fold in cooked noodles, black beans and drained Genova Yellowfin tuna and mix until well combined. Top with 2 ounces of shredded cheddar. At this point you can either serve the mac and cheese and just fold in the extra cheddar you just added, or remove from heat and place under the broiler for 1-2 minutes or until cheese is bubbly and slightly golden. Serves 6. Top with cilantro and hot sauce if desired!"
  ],
  "ingredients": [
    "0",
    "1 ½ cups elbow noodles (whole grain or gluten free)",
    "2 tablespoons butter",
    "1 clove garlic, minced",
    "3 tablespoons whole wheat pastry flour (or sub regular flour or GF all purpose flour)",
    "½ teaspoon onion powder",
    "2 cups unsweetened cashew milk (from the carton or homemade if you prefer)",
    "Salt and pepper, to taste",
    "6 oz sharp cheddar cheese (about 1 ½ cups shredded cheddar cheese)",
    "1 (1.1 ounce) packet taco seasoning (preferably organic)",
    "1 (15 ounce) can black beans, rinsed and drained",
    "1 (5 ounce) can Genova Yellowfin Tuna in Olive Oil, drained",
    "2 oz sharp cheddar cheese, shredded and reserved for the topping (or about ½ cup shredded cheddar cheese)",
    "To garnish:",
    "Chopped fresh cilantro",
    "Hot sauce, if desired"
  ],
  "__v": 1
}