{
  "hash": "7effcc5386baf9d6a1eecc61b2e21ea8be671f5e",
  "title": "Marinated Leeks with Crispy Parsley",
  "image": "",
  "href": "https://www.shape.com/recipe/marinated-leeks-with-crispy-parsley",
  "extension": "Chrome",
  "firstAdded": "2020-05-25T18:36:35.574000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Step 1",
    "Preheat oven to 300°. On a small baking sheet, toss whole parsley leaves with 1/2 teaspoon oil. Spread in an even layer. Bake until crisp, turning halfway through, 5 to 7 minutes. Let cool.",
    "Step 2",
    "Meanwhile, trim root ends of leeks, leaving as much intact as possible so leaves stay together. Halve leeks lengthwise, and rinse well. Pat dry with paper towels.",
    "Step 3",
    "In a large skillet with a tight-fitting lid, heat 2 tablespoons oil over medium-high. Add half the leeks, cut sides down. Cook until golden, about 3 minutes. Transfer to a plate. Add another tablespoon oil, and repeat with remaining leeks.",
    "Step 4",
    "Pour 1/4 cup vinegar and 1 cup water into skillet. Bring to a boil. Nestle leeks into liquid, cut sides up. Season with salt and pepper. Cover, reduce heat to medium-low, and simmer until leeks are very tender when pierced with a knife, about 15 minutes.",
    "Step 5",
    "Remove lid, raise heat to medium-high, and cook to reduce any remaining liquid, about 2 minutes more. Transfer leeks to a platter.",
    "Step 6",
    "In a medium bowl, whisk the remaining 1/4 cup oil and remaining 2 tablespoons vinegar. Season with salt and pepper. Tear the olives in half with your fingers, and add to the dressing. Add the roasted pepper, walnuts, celery, red onion, and minced parsley. Stir to combine.",
    "Step 7",
    "Spoon chunky vinaigrette over leeks, and garnish with crispy parsley leaves."
  ],
  "ingredients": [
    "0",
    "2 tablespoons minced fresh parsley leaves and thin stems, plus 1/2 cup packed whole leaves and thin stems",
    "7 tablespoons plus 1/2 teaspoon extra-virgin olive oil",
    "8 small leeks, white and pale-green parts only",
    "6 tablespoons red wine vinegar",
    "Kosher salt and freshly ground black pepper",
    "½ cup pitted Castelvetrano olives",
    "½ cup very thinly sliced roasted red pepper",
    "½ cup roughly chopped toasted walnuts",
    "1 small celery stalk, finely diced",
    "3 tablespoons finely chopped red onion"
  ],
  "__v": 1
}