{
  "hash": "82a2df464b58870921a9c0f2f7740932febe84d4",
  "title": "Creamy Chicken and Wild Rice Soup",
  "image": "https://www.cookingclassy.com/wp-content/uploads/2014/02/creamy-chicken-and-wild-rice-soup5+srgb..jpg",
  "href": "https://www.cookingclassy.com/creamy-chicken-wild-rice-soup/",
  "extension": "",
  "firstAdded": "2019-03-12T19:53:26.747000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare rice according to directions listed on package.",
    "Halfway through the rice cooking, in a separate large pot, melt 1 Tbsp butter over medium heat. Add onion, carrots and celery and saute until slightly tender, about 4 minutes, adding in garlic during last 30 seconds of sauteing.",
    "Add chicken broth, thyme, marjoram, sage, rosemary and season with salt and black pepper to taste. Increase heat to medium-high, add chicken and bring mixture to a boil.",
    "Cover pot with lid and allow mixture to boil 12 - 15 minutes, or until chicken is cooked through (rotating chicken to opposite side once during cooking for thicker chicken breasts - if they don't fully immerse in broth).",
    "Remove chicken and set aside on cutting board to cool 5 minutes then shred into small bite size pieces. Meanwhile reduce heat to low and add cooked rice. Add shredded chicken to soup.",
    "In a separate medium saucepan (I just rinsed and wiped out the rice pan), melt remaining 6 Tbsp butter over medium heat. Add flour and cook 1 1/2 minutes, whisking constantly.",
    "Then, while whisking vigorously, slowly pour milk into butter/flour mixture. Cook mixture, stirring constantly until it thickens.",
    "Add milk mixture to soup mixture in pot and cook about 5 minutes longer, or until soup is thickened (at this point, you can simmer the soup for a longer period of time if you want the rice to soften more, just cover with lid first and stir occasionally.",
    "You can also add what's left in the remaining can of chicken broth). Stir in heavy cream and lemon zest and serve warm.",
    "*I used Lundberg Wild Blend Rice which I recommend for this recipe if you can find it.",
    "Recipe Source: Cooking Classy"
  ],
  "ingredients": [
    "0",
    "3/4 cup uncooked wild rice blend*",
    "1 cup chopped yellow onion (from about 1 small onion)",
    "1 cup diced carrots (from 2 medium)",
    "1 cup diced celery (from 2 - 3 stalks)",
    "7 Tbsp butter , diced, divided",
    "1 clove garlic , minced",
    "4 1/2 cups low-sodium chicken broth (measured from 3 14.5 oz cans)",
    "1/4 tsp of each dried thyme , marjoram, sage and rosemary",
    "Salt and ground black pepper , to taste",
    "1 lb boneless skinless chicken breasts halves",
    "1/2 cup all-purpose flour",
    "1 1/2 cups milk",
    "1/2 cup heavy cream",
    "1 tsp lemon zest"
  ],
  "__v": 1
}