{
  "hash": "eba85361b012a3a678e7619a22680774454f41ea",
  "title": "Brown Stew Chicken",
  "image": "",
  "href": "https://www.stabroeknews.com/2014/features/03/02/trini-style-brown-stew-chicken/",
  "extension": "Chrome",
  "firstAdded": "2018-04-09T01:29:52.518000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "Add the chicken to a large bowl along with the green seasoning, soy and Worcestershire sauce and salt and pepper to taste. Toss to mix and coat the chicken. Chill for at least 3 hours.",
    "Bring the chicken to room temperature ½ an hour before you are ready to cook it.",
    "Add the oil to a large pot or large deep pan and place on medium heat until hot but not smoking.",
    "Sprinkle the sugar into the oil in an even layer and let melt until it starts to froth and the edges start to get a darker brown (not black). Immediately add the chicken and marinade to the pot and toss to mix with the burnt sugar. Let the chicken cook until the liquid has almost dried down.",
    "Pour hot water to reach close to the top of the chicken. Use the pot spoon to scrape the bottom of the pot/pan to remove any stuck bits and give the pot a good stir. Bring to a boil and let cook until the liquid has reduced to about a half. Add the potatoes, taste for salt and adjust if necessary. Cover the pot and bring to a boil. Cook until the potatoes are soft but not falling apart.",
    "Remove the lid and mash 1 or 2 pieces of the potatoes by pressing them with the back of the pot spoon against the side of the pot/pan. Continue to cook until the liquid has reduced to your desired consistency.",
    "Serve with rice or steamed dumplings."
  ],
  "ingredients": [
    "0",
    "1 (4-lb) whole chicken cut up or 4 pounds of chicken (thighs & drumsticks) cut up, washed and pat dry",
    "3 heaped tablespoons green seasoning",
    "2 tablespoons soy sauce",
    "2 tablespoons Worcestershire sauce",
    "Salt and pepper to taste",
    "3 tablespoons oil",
    "3 tablespoons brown sugar",
    "Hot water",
    "2 pounds potatoes peeled and cut into large chunks"
  ],
  "__v": 1
}