{
  "hash": "6cc827d1d9b855307410e85a84a3dd78d10d9182",
  "title": "roasted red pepper pasta with white beans and basil",
  "image": "https://www.halfbakedharvest.com/wp-content/uploads/2018/08/Roasted-Red-Pepper-Pasta-with-White-Beans-and-Basil-1-300x300.jpg",
  "href": "https://www.halfbakedharvest.com/roasted-red-pepper-pasta/",
  "extension": "Chrome",
  "firstAdded": "2020-05-25T13:49:19.688000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place the red pepper directly over an open flame on a gas burner. Cook, turning every minute until charred all over. Place the charred peppers in a bowl. Add the garlic cloves and cover with a plate. Let the peppers steam for 10 minutes. Remove the charred skin, stem, and seeds, and discard.2. Add the charred peppers, garlic, cashews, pecorino, 1/4 cup olive oil, red wine vinegar, and a pinch of salt to a blender and pulse until smooth.3. Bring a large pot of salted water to a boil. Boil the pasta until al dente, reserve 1 cup of the pasta cooking water and then drain. Add the pasta right back to the hot pot along with the roasted red pepper sauce and about 1/4 cup of the reserved pasta cooking water. Toss to combine. Add the white beans, basil, oregano, lemon juice, and a pinch of red pepper flakes, tossing to combine. Thin the sauce as desired with more pasta cooking water.4. Serve topped with fresh basil and additional cheese (if desired). Enjoy!"
  ],
  "ingredients": [
    "0",
    "3 red bell peppers, I use homegrown Burpee peppers",
    "2 cloves garlic, smashed",
    "1/4 cup roasted cashews",
    "1/2 cup grated pecorino cheese (omit if vegan)",
    "1/4 cup extra virgin olive oil",
    "2 tablespoons red wine vinegar",
    "kosher salt and pepper",
    "1 pound long or short cut pasta",
    "1 (14 ounce) can white beans or chickpeas, drained and rinsed",
    "1 cup fresh basil, roughly chopped, I like to use Burpee Pesto Party Basil",
    "2 tablespoons chopped fresh oregano",
    "juice of 1 lemon",
    "crushed red pepper flakes"
  ],
  "__v": 1
}