{
  "hash": "1cae2c0d9c41e3cddaaef23a0775709daf39eaba",
  "title": "Swedish Yellow Pea Soup Ärtsoppa Recipe",
  "image": "https://www.thespruceeats.com/thmb/Rb8237XbtGD5VM0hnoMHr7EV4Bs=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/GettyImages-171344024-56a833835f9b58b7d0f1800a.jpg",
  "href": "https://www.thespruceeats.com/dried-pea-soup-artsoppa-in-swedish-2952931",
  "extension": "Chrome",
  "firstAdded": "2018-12-11T13:05:03.392000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Steps to Make It",
    "Rinse and pick through 1 pound of dried yellow or green peas. If using whole peas, soak the peas overnight in water to cover by about 2 inches.",
    "Fill a large pot with 8 cups of water or 6 cups if you like a thicker soup.",
    "Add the drained peas, 2 finely chopped onions, 1 peeled whole onion studded with 2 whole cloves, 1 large chopped carrot, and a meaty ham bone (or 2 to 3 ham hocks).",
    "Bring to a boil, skimming off any foam, then cover pot and reduce to a simmer over low heat for 90 minutes.",
    "If using whole peas, skim off any pea skins that have risen to the surface. Remove 2 to 3 cups of the soup, puree in a blender or food processor, and return puree to the pot.",
    "Continue to simmer for at least 30 more minutes, even another hour or more won’t hurt it.",
    "Thirty minutes before serving, remove the studded onion and the meat. Chop the meat and return to pot.",
    "Season the soup with 1 teaspoon dried thyme, 1 teaspoon ground ginger, 1 teaspoon salt, and 1/8 teaspoon pepper. Simmer 15 more minutes.",
    "Serve, passing around grainy brown mustard to stir into the soup to taste."
  ],
  "ingredients": [
    "0",
    "1 pound dried yellow or green peas (whole if you can get them, but split ones work just as well)",
    "8 cups water",
    "2 finely chopped onions (2 cups)",
    "1 peeled whole onion studded with 2 cloves",
    "1 large chopped carrot (1/2 cup)",
    "1 meaty ham bone -or- 2 to 3 ham hocks",
    "1 teaspoon dried thyme",
    "1 teaspoon ground ginger",
    "1 teaspoon salt",
    "1/8 teaspoon pepper",
    "1 teaspoon grainy brown mustard"
  ],
  "__v": 1
}