{
  "hash": "9652ae661912ab6a6d07660903b902f7af6b609d",
  "title": "Knoephla Soup, aka Chicken & Dumpling Soup",
  "image": "https://www.sweetandsavorybyshinee.com/wp-content/uploads/2016/01/Knoephla-Soup-1-190x275.jpg",
  "href": "https://www.sweetandsavorybyshinee.com/knoephla-soup/",
  "extension": "Chrome",
  "firstAdded": "2018-12-11T13:52:02.641000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "To make the knoephla dumplings, in a large mixing bowl with dough hook attachment, mix together all the ingredients and kneed until elastic dough forms. Alternatively, you can mix everything by hand. Cover the dough and let it rest while you make the soup.",
    "To make the soup, chop chicken, celery, carrots and potatoes into cubes.",
    "In a large pot, melt the butter and 4 tablespoons of bacon fat over medium high heat. Stir in the flour and cook for about 2 minutes, or until nice and golden color, stirring frequently with a wooden spoon. That’s how you make the roux to thicken the soup. Transfer the roux into a small dish.",
    "Into the pot, add the remaining 2 tablespoons of bacon fat and pressed garlic. Cook until fragrant, stirring frequently. Add chicken cubes. Add ¼ teaspoons of salt and cook for about 5 minutes, or until fully cooked, stirring occasionally. Remove the chicken onto a plate.",
    "Add the cubed vegetables into the pot and cook for 2-3 minutes, and then add chicken stock, water and the remaining 2 teaspoons of salt. Bring it to a boil, reduce the heat to medium and simmer until the potatoes are fully cooked.",
    "Meanwhile, divide the dumpling dough into 2 equal parts. Then roll each dough into long log, about ½-inch thick, and cut into small pieces.",
    "Once the vegetables are fully cooked, add the roux, chicken, dumplings and milk. Cook for 10-15 minutes, or until the dumplings float up on top and fully cooked. Serve immediately."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "For knoephla:",
    "¾ cup (95gr) all-purpose flour",
    "1 large egg",
    "3 tablespoons milk (I use whole milk, but any milk will work)",
    "2 teaspoons parsley",
    "1 teaspoon dill weed",
    "½ teaspoon black pepper",
    "¼ teaspoon salt",
    "For soup:",
    "4 tablespoons unsalted butter",
    "4 tablespoons bacon fat, divided",
    "½ cup (60gr) all-purpose flour",
    "3 garlic cloves, pressed",
    "2-3 medium carrots (about 1 cup chopped)",
    "3-4 stalks celery (about 1 cup chopped)",
    "2 medium russet potatoes",
    "1 chicken breast",
    "4 cups (1L) unsalted chicken stock",
    "1 cup (240ml) water",
    "2 ¼ teaspoon salt",
    "2 cups (480ml) milk (I use whole milk, but any milk will work)"
  ],
  "__v": 1
}