{
  "hash": "5630cd83ae6e1dc46ba2be1f7b69b1bd2d09c072",
  "title": "Santa Fe Chicken and Lentil Casserole",
  "image": "http://ifoodreal.com/wp-content/uploads/2014/03/thumb-santa-fe-chicken-lentil-casserole-recipe.jpg",
  "href": "http://ifoodreal.com/santa-fe-chicken-and-lentil-casserole-recipe/",
  "extension": "Chrome",
  "firstAdded": "2017-01-03T03:15:01.595000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium pot, combine lentils, chicken broth and salt. Bring to a boil on high, reduce heat to low, cover and cook for 35 minutes. Do not drain excess liquid. Set aside.",
    "Meanwhile, preheat large skillet on high and spray with cooking spray. Add chicken and cook for 5 minutes, stirring occasionally and draining any liquid if necessary. Add cumin, salt, black pepper and cayenne pepper and cook for another 5 minutes or until golden brown, stirring occasionally. Transfer to a large bowl and set aside.",
    "Preheat oven to 350 degrees F. Return skillet to medium-high heat and spray with cooking spray. Add onion, garlic, bell peppers, cumin, salt and cayenne pepper and cook for 7 minutes or until golden brown, stirring occasionally.",
    "Transfer to the bowl with chicken along with cooked lentils, diced tomatoes, corn, 1 cup cheese, jalapeño peppers, garlic powder, cumin and 1/2 cup cilantro. Mix gently with spatula enough to combine. You may want to taste and adjust the spiciness/salt of the dish with extra cayenne/jalapeño peppers/salt.",
    "Transfer the mixture to a 9 x 13 oven proof baking dish and level/press gently with spatula. Sprinkle with remaining cheese and bake uncovered for 50 mins. Remove casserole from the oven, cover with foil and let stand for half an hour before serving. Garnish with remaining cilantro, cut into 8 slices and serve hot."
  ],
  "ingredients": [
    "0",
    "1 + 1/2 cup green lentils, rinsed & drained",
    "3 cups chicken broth, low sodium",
    "1/8 tsp salt",
    "2 lbs boneless & skinless chicken breasts, diced",
    "1 tsp cumin",
    "1/4 tsp salt",
    "1/2 tsp freshly ground black pepper",
    "1/8 tsp cayenne pepper",
    "Cooking spray (I use Misto)",
    "1 large onion, diced",
    "5 large garlic cloves, crushed",
    "2 large bell peppers, diced",
    "1 tsp cumin",
    "1/4 tsp salt",
    "1/8 tsp cayenne pepper",
    "Cooking spray (I use Misto)",
    "14 oz can diced tomatoes",
    "2 cups corn, frozen & unthawed",
    "2 cups (6.5 oz) Tex Mex or Colby Jacks cheese, shredded & divided",
    "2 tbsp jalapeño peppers, seeded & minced (or to taste)",
    "1 tbsp garlic powder",
    "1 tsp cumin",
    "1 cup cilantro, chopped & divided"
  ],
  "__v": 1
}