{
  "hash": "308ed640a944cb9dc22ccb218d0ac1747032ab1b",
  "title": "No-Knead Peasant Bread",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2010/3/31/1/FNM_050110-Weekend-053_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/food-network-kitchens/no-knead-peasant-bread-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-10-06T05:22:36.909000",
  "users": [
    null
  ],
  "keywords": [
    "unbleached",
    "bread",
    "flour",
    "wholewheat",
    "active",
    "dry",
    "yeast",
    "salt",
    "allpurpose",
    "dusting"
  ],
  "directions": [
    "0",
    "Combine the bread flour, whole-wheat flour, yeast and salt in a large bowl. Add 11/2 cups lukewarm water (about 100 degrees F) and mix with your hands or a spoon until the dough comes together (it will be wet and sticky). Cover the dough tightly with plastic wrap. If you have extra time, refrigerate 12 to 24 hours; this is not necessary but will improve the flavor of the bread.",
    "Let the dough rise, covered, at room temperature for about 18 hours; this rise is necessary whether you refrigerate the dough first or not. The surface will be bubbly after rising.",
    "Generously dust a work surface with all-purpose flour. Turn the dough out onto the flour, then sprinkle flour on top. Fold the top and bottom of the dough into the center, then fold in the sides to make a free-form square. Use a dough scraper or a spatula to turn the dough over, then tuck the corners under to form a ball.",
    "Line a baking sheet with parchment paper and generously dust with flour. Transfer the dough to the baking sheet, seam-side down, and sprinkle with more flour. Cover with a cotton kitchen towel (do not use terry cloth) and let rise at room temperature until doubled in size, 2 to 3 hours.",
    "Position a rack in the bottom of the oven and place a 2- or 4-quart cast-iron or enameled Dutch oven (without the lid) on the rack. Preheat the oven to 450 degrees F for at least 30 minutes. When the dough has doubled, carefully transfer the hot pot to a heatproof surface. Uncover the dough, lift up the parchment and quickly invert the dough into the pot (shake the pot to center the dough, if necessary). Cover with the lid and bake 30 minutes, then uncover and bake until brown and crusty, 15 to 30 more minutes. Turn out onto a rack to cool.",
    "Photograph by Con Poulos",
    "Courtesy of Food Network Magazine"
  ],
  "ingredients": [
    "0",
    "2 1/2 cups unbleached bread flour",
    "1/2 cup whole-wheat flour",
    "1/2 teaspoon active dry yeast",
    "1 1/2 teaspoons salt",
    "All-purpose flour, for dusting"
  ],
  "__v": 1
}