{
  "hash": "a0f3ddfc621f950b83974c558a74192f74ed2617",
  "title": "{Easy, 30 minute} Cinnamon Roll Skillet Cake",
  "image": "http://i1.wp.com/chelseasmessyapron.com/wp-content/uploads/2014/03/c10-656x1024.jpg?resize=525%2C819",
  "href": "http://www.chelseasmessyapron.com/easy-30-minute-cinnamon-roll-skillet-cake/",
  "extension": "Firefox",
  "firstAdded": "2015-07-23T14:20:36.669000",
  "users": [
    null
  ],
  "keywords": [
    "buttermilk",
    "biscuits",
    "depending",
    "size",
    "skillet",
    "leftover",
    "butter",
    "white",
    "sugar",
    "cinnamon",
    "softened",
    "vanilla",
    "preference",
    "milk",
    "cream"
  ],
  "directions": [
    "0",
    "Preheat the oven to 350 degrees F. If you don't have a pre-seasoned skillet, rub about 1 teaspoon of vegetable oil on the bottom of the skillet and set aside.",
    "(I used an 8-inch skillet. If you use a bigger one, you will need to adjust the ingredient amounts.)",
    "Remove the biscuits from the packages.",
    "Using a rolling pin, roll each of the biscuits very flat and thin.",
    "Dip each biscuit in the melted butter, shake off the excess and then dip the biscuit in the cinnamon sugar mixture making sure to cover both sides. Shake off the excess.",
    "Roll up each biscuit and place the rolled up biscuit on the outside of a skillet in a circle fashion spiraling towards the inside of the skillet.",
    "Bake for 18-20 minutes.",
    "Meanwhile, prepare the frosting by beating together the powdered sugar, butter, and vanilla extract. Slowly add in the milk or heavy cream until desired consistency is reached.",
    "Remove the cake and let cool for about 5-7 minutes before frosting.",
    "Pipe the frosting over the cake and cut into slices to serve."
  ],
  "ingredients": [
    "0",
    "2 packages Buttermilk Biscuits (Depending on your size skillet, you may have some leftover)",
    "1/4 cup butter, melted",
    "3/4 cup white sugar",
    "1 tsp. cinnamon",
    "1",
    "1 and 1/2 cups powdered sugar",
    "1/4 cup butter, softened",
    "1/2 - 1 tsp. vanilla extract, depending on taste preference",
    "2-3 tbsp. milk or heavy cream"
  ],
  "__v": 1
}