{
  "hash": "6b4b6c057708504aa3b250b4c5a5ffb17a651930",
  "title": "HOMEMADE THIN MINTS RECIPE (GRAIN-FREE, PALEO)",
  "image": "",
  "href": "http://deliciouslyorganic.net/homemade-thin-mints-recipe-grain-free-paleo/",
  "extension": "Chrome",
  "firstAdded": "2016-02-06T16:38:50.007000",
  "users": [
    null
  ],
  "keywords": [
    "almond",
    "flour",
    "coconut",
    "cocoa",
    "sprinkling",
    "celtic",
    "salt",
    "sugar",
    "unsalted",
    "butter",
    "palm",
    "shortening",
    "room",
    "egg",
    "yolk",
    "drops",
    "peppermint",
    "essential",
    "oil",
    "semisweet",
    "used",
    "enjoy",
    "life",
    "chocolate",
    "chips"
  ],
  "directions": [
    "0",
    "Instructions",
    "Place almond flour, coconut flour, cocoa powder and salt in a medium bowl and whisk until combined.",
    "Place the coconut sugar and butter in the bowl of a standing mixer with beater attached. Beat on medium-high for 4-5 minutes until lighter in color and fluffy. Beat in the egg and the yolk and then the peppermint oil. With mixer on low, slowly add the flour mixture and mix until incorporated.",
    "Place a piece of parchment paper on the counter and sprinkle with cocoa powder. Place the dough on top of the parchment, top with another piece of parchment and roll the dough using a rolling pin until it’s ¼-inch thick. Place the rolled out dough and parchment on a baking sheet and place in the fridge for 15 minutes (this will make the cookies easier to cut).",
    "Preheat the oven to 350ºF and adjust the rack to the middle position.",
    "Remove the dough from the fridge and remove the top piece of parchment. Using a 2-inch round cookie cutter, cut the dough into circles and carefully remove the dough (the dough will be a bit sticky) from the parchment and place on a clean baking sheet lined with parchment paper. Repeat with the remaining dough. Bake for 11 minutes and cool completely.",
    "Melt the chocolate over a double-boiler. Carefully place a cookie in the chocolate and using a fork, turn the cookie over so both sides are coated. Use the fork to lift the cookie out of the chocolate and place on a cooling rack or piece of parchment (I prefer the parchment because when the cookies are completely cooled they will lift off very easily). Repeat with remaining cookies. Cool and store at either room temperature or in the freezer.",
    "Note: I only test the recipes on my site with the listed ingredients and measurements. If you would like to try a substitution, you are welcome to share what you used and how it turned out in the comments below. Thanks!"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 cup almond flour",
    "2 tablespoons coconut flour",
    "1/2 cup cocoa powder, plus additional for sprinkling",
    "1/2 teaspoon Celtic sea salt",
    "1/2 cup coconut sugar",
    "6 tablespoons unsalted butter (or 5 tablespoons palm shortening), room temperature",
    "1 large egg plus 1 egg yolk",
    "10 drops peppermint essential oil",
    "16 ounces semi-sweet chocolate (I used Enjoy Life Chocolate Chips)"
  ],
  "__v": 1
}