{
  "hash": "dec2cdd8b55c91cc8dbff3dfb878cb73e00f0b5f",
  "title": "Sweet Potato Burrito Bowls with Summer Vegetables and Quinoa",
  "image": "http://www.domesticate-me.com/wp-content/uploads/2014/07/Vegan-Sweet-Potato-Burrito-Bowls-with-Summer-Vegetables-and-Quinoa27.jpg",
  "href": "http://domesticate-me.com/sweet-potato-burrito-bowls-summer-vegetables-quinoa/",
  "extension": "Chrome",
  "firstAdded": "2015-10-02T11:59:59.331000",
  "users": [
    null
  ],
  "keywords": [
    "uncooked",
    "quinoa",
    "lime",
    "cilantro",
    "kosher",
    "salt",
    "medium",
    "potato",
    "cubes",
    "grapeseed",
    "divided",
    "yes",
    "use",
    "olive",
    "oil",
    "prefer",
    "smoked",
    "paprika",
    "cumin",
    "red",
    "onion",
    "zucchini",
    "lengthwise",
    "pieces",
    "summer",
    "squash",
    "bell",
    "pepper",
    "ear",
    "corn",
    "kernels",
    "garlic",
    "canned",
    "black",
    "beans",
    "rinsed",
    "chipotle",
    "adobo",
    "crumbled",
    "cotija",
    "queso",
    "fresco",
    "feta",
    "cheese",
    "guacamole",
    "wedges",
    "hot",
    "really",
    "digging",
    "texas",
    "pete",
    "sriracha",
    "cha",
    "right"
  ],
  "directions": [
    "0",
    "Pre-heat your oven to 375 degrees. Line a baking sheet with parchment.",
    "Place quinoa in a small pot with ¾ cup water. Bring to a boil, then lower heat to a simmer. Cover and cook for 15 minutes until all the liquid has been absorbed. Let the quinoa rest, covered, for 5-10 minutes, then fluff with a fork. Add the juice from half the lime, chopped cilantro, and salt to taste. Set aside and keep warm until ready to use.",
    "Moving on to the sweet potatoes! Place your sweet potatoes on the prepared baking sheet. Drizzle with 1 tablespoon oil, and sprinkle with ½ teaspoon smoked paprika, ¼ teaspoon cumin, and ¼ teaspoon kosher salt. Toss to coat. Roast your sweet potatoes for 20-25 minutes, stirring once halfway through, until tender and lightly browned.",
    "Meanwhile, heat the remaining tablespoon in a large cast iron skillet or pan. When hot, add the red onion and cook for about 3 minutes until softened and translucent.",
    "Add the zucchini, summer squash, red bell pepper, corn and garlic. Cook for about 8 minutes, stirring regularly, until the vegetables are tender. Add the black beans, chipotle pepper, adobo, and the remaining ½ teaspoon paprika, ½ teaspoon cumin, and a pinch of salt. Cook for 2 minutes and then add the juice of the remaining lime half. Remove from the heat, taste, and season with extra salt if necessary.",
    "Now it’s time to assemble your badass burrito bowls! Divide the quinoa among two bowls. Add half of the roasted sweet potatoes and summer vegetable mixture to each bowl. Top with fancy garnishes of your choice and go to town."
  ],
  "ingredients": [
    "0",
    "½ cup uncooked quinoa",
    "1 lime, halved",
    "2 tablespoons finely chopped cilantro",
    "Kosher salt",
    "1 medium sweet potato, cut into ½-inch cubes",
    "2 tablespoons grapeseed oil, divided (Yes, you can use olive oil if you prefer.)",
    "1 teaspoon smoked paprika, divided",
    "¾ teaspoon cumin, divided",
    "½ small red onion, diced",
    "1 small zucchini, quartered lengthwise and sliced into ¼-inch pieces",
    "1 small summer squash, quartered lengthwise and sliced into ¼-inch pieces",
    "½ small red bell pepper, diced",
    "1 ear of corn, kernels removed",
    "2 cloves garlic, minced",
    "½ cup canned black beans, drained and rinsed",
    "1 chipotle canned in adobo, finely chopped",
    "1 tablespoon adobo sauce from the chipotle can",
    "Crumbled cotija, queso fresco or feta cheese",
    "Fresh cilantro",
    "Guacamole",
    "Lime wedges",
    "Hot sauce of your choice (I’m really digging Texas Pete Sriracha CHA right now.)"
  ],
  "__v": 1
}