{
  "hash": "4afa17969e75fe5f40c82416095909a6f4bc32ac",
  "title": "Tom Yum Goong",
  "image": "",
  "href": "http://www.menudomu.cz/tom-yum-goong/",
  "extension": "Chrome",
  "firstAdded": "2015-09-10T09:20:24.758000",
  "users": [
    null
  ],
  "keywords": [
    "ingredience",
    "porce",
    "vvaru",
    "kafrov",
    "listy",
    "stonky",
    "citronov",
    "trvy",
    "kousek",
    "galangalu",
    "nebo",
    "zzvoru",
    "velikosti",
    "palce",
    "ampion",
    "dkg",
    "hlvy",
    "krevety",
    "alespo",
    "porci",
    "thajsk",
    "chilli",
    "papriky",
    "podle",
    "chuti",
    "pasta",
    "lce",
    "ryb",
    "omky",
    "pop",
    "sticov",
    "jarn",
    "cibulky",
    "limetky",
    "zralch",
    "mench",
    "rajat",
    "dcl",
    "kokosovho",
    "mlka",
    "mono",
    "vynechat",
    "erstv",
    "koriandr"
  ],
  "directions": [
    "0",
    "Vypadá to, že ingrediencí je požehnaně, ale když je všechny (nebo většinu) dáte do kupy, pak to tam budete jenom postupně házet a sypat a polévka je hotová asi tak za 10 minut. S tím, že vývar už máte předpřipravený. Také by měl být tak nějak „normálně“ slaný jako na polévku. Díky tomu většině z nás bude stačit dosolení rybí omáčkou ke konci vařby. Začínáme vařícím vývarem. A šoupáme popořadě:",
    "citronová tráva + galangal nebo zázvor + kafírové listy /1 minutu vaříme/",
    "pak žampiony nebo hlíva + chilli papričky /další 3 minuty/",
    "krevety + chilli pasta + jarní cibulky /zas 3 minuty vařit/",
    "kokosové mléko + rajčata + šťáva z limetky + koriandr + rybí omáčka /1 minuta/ = ochutnat a přidat to, co tomu chybí – možná ještě lžička nebo dvě chilli pasty… možná víc papriček… limetky??? Kapka rybí omáčky. Hotovo.",
    "A nyní ještě k ingrediencím, které dělají z Tom Yum Tom Yum. Nepostradatelná je chilli pasta – tu svou přímo na Tom Yum jsem pořídila za 35 korun (!) v korejském obchodě kousek od pražského Palackého náměstí v Gorazdově ulici. Balení pasty vydrží asi tak na 20 porcí polévky, navíc pasta už obsahuje koriandr, citronovou trávu, galangal, můžete ji dát do litru polévky podle chuti cca 2–6 lžiček, moc nepálí. Ve stejné prodejně seženete i rybí omáčku, sušené chilli, kokosové mléko, někdy i mražené kafírové listy. Obecně vše zmíněné najdete i v Sapě v pražské Libuši – tam přikoupíte i balení asi 50 chilli papriček za 20 Kč, stejně tak obří pytel čerstvého koriandru, citronové trávy a galangal.",
    "Ohledně galangalu, bacha na to, ať se neseknete jako já. Zvenku vypadá podobně jako čerstvá kurkuma. Ale je mírně dorůžova, kurkuma dooranžova. Jasné je to pak při průřezu, galangal má světlou béžovou barvu jako zázvor, kurkuma jasně oranžovou jako mrkev. Kořen je nutno oloupat a pak nakrájet na tenké plátky. Citronovou trávu nechte ve větších špalíčcích, aby se vám nepletla s jarní cibulkou, trávu nejíst, ta je jen ochucovací – stejně jako galangal či zázvor a kafírové listy.",
    "Je mi jasné, že se ingredience budou hůř shánět mimo Prahu, ale snad je dáte dohromady, protože Tom Yum za ochutnání opravdu stojí."
  ],
  "ingredients": [
    "0",
    "Ingredience na 4 porce",
    "1 l vývaru",
    "2 kafírové listy",
    "2 stonky citronové trávy",
    "kousek galangalu nebo zázvoru (velikosti palce)",
    "8 žampionů nebo 15 dkg hlívy",
    "krevety (alespoň 3 větší na porci)",
    "thajské chilli papričky podle chuti",
    "chilli pasta téže",
    "2 lžíce rybí omáčky (popř. ústřicové)",
    "4 stonky jarní cibulky",
    "šťáva z 1 limetky",
    "4–6 zralých menších rajčat",
    "do 1 dcl kokosového mléka (možno vynechat)",
    "čerstvý koriandr"
  ],
  "__v": 1
}