{
  "hash": "64db6e181a22d8ebabdb36977b726a78e171d1e3",
  "title": "Singapore Hawker Rice Noodles",
  "image": "",
  "href": "http://www.epicurious.com/recipes/food/views/singapore-hawker-rice-noodles-238438",
  "firstAdded": "2015-02-22T19:11:45.483000",
  "users": [
    null
  ],
  "keywords": [
    "skinless",
    "boneless",
    "chicken",
    "breast",
    "asian",
    "sesame",
    "oil",
    "reducedsodium",
    "broth",
    "oyster",
    "ketjap",
    "manis",
    "indonesian",
    "soy",
    "sambal",
    "oelek",
    "sriracha",
    "southeast",
    "chile",
    "carrot",
    "sum",
    "called",
    "chinese",
    "flowering",
    "cabbage",
    "baby",
    "bok",
    "choy",
    "peanut",
    "links",
    "sausage",
    "lop",
    "cheong",
    "total",
    "lengthwise",
    "diagonally",
    "inchthick",
    "slices",
    "shallots",
    "crosswise",
    "garlic",
    "mild",
    "red",
    "holland",
    "seeds",
    "soybean",
    "mungbean",
    "sprouts",
    "bunch",
    "scallions",
    "pieces",
    "wide",
    "rice",
    "noodles",
    "hor",
    "fun",
    "kway",
    "teow",
    "loosely",
    "cilantro",
    "sprigs"
  ],
  "directions": [
    "0",
    "Halve chicken breasts lengthwise, then cut across the grain into 1/4-inch-thick slices and put in a bowl.",
    "Add sesame oil and a pinch of salt to chicken and stir to coat.",
    "Stir together broth, oyster sauce, ketjap manis, soy sauce, and sambal oelek in another small bowl.",
    "Holding carrot at a 45-degree angle to slicer, cut carrot into thin (-inch) matchsticks. Cut choy sum crosswise into 2 1/2- to 3-inch pieces, then halve any thick stem pieces lengthwise.",
    "Heat wok over high heat until a drop of water evaporates instantly. Swirl 1 tablespoon peanut oil to coat bottom and sides of wok. When oil begins to smoke, stir-fry sausage until browned, about 1 minute. Add chicken and stir-fry until just opaque, about 3 minutes. Transfer to a clean bowl (chicken will not be cooked through). Add remaining 2 tablespoons peanut oil to wok, swirling to coat, then stir-fry carrot, shallots, garlic, and chile 3 minutes. Add choy sum, bean sprouts, and scallions and stir-fry until choy sum is crisp-tender, about 3 minutes. Stir in broth mixture and bring to a boil. Add noodles and gently stir-fry until heated through and noodles are tender. Return sausage and chicken to wok and stir-fry until chicken is just cooked through, about 1 minute. Serve sprinkled with cilantro."
  ],
  "ingredients": [
    "0",
    "1 pound skinless boneless chicken breast",
    "1/2 teaspoon Asian sesame oil",
    "1/2 cup reduced-sodium chicken broth",
    "1/4 cup oyster sauce",
    "2 tablespoons ketjap manis (Indonesian sweet soy sauce)",
    "2 tablespoons soy sauce",
    "1 tablespoon sambal oelek or Sriracha (Southeast Asian chile sauce), or to taste",
    "1 large carrot",
    "1/2 pound choy sum (also called Chinese flowering cabbage) or baby bok choy",
    "3 tablespoons peanut or vegetable oil",
    "2 links Chinese sweet sausage (also called lop cheong; 3 1/2 ounces total), halved lengthwise, then cut diagonally into 1/4-inch-thick slices",
    "2 large shallots, halved lengthwise, then cut crosswise into 1/4-inch-thick slices (1 cup)",
    "2 tablespoons finely chopped garlic (about 4 cloves)",
    "1 teaspoon sliced fresh mild red chile such as Holland, including seeds",
    "1/2 pound fresh soybean or mung-bean sprouts (3 cups)",
    "1 bunch scallions, cut crosswise into 2-inch pieces (1 1/2 cups)",
    "1 pound fresh wide rice noodles (sometimes called ha fun, hor fun, or kway teow)",
    "3/4 cup loosely packed fresh cilantro sprigs"
  ],
  "__v": 1
}