{
  "hash": "0614c18a749015093cf8099419766dede33599d6",
  "title": "Easy mushroom soup",
  "image": "http://ukcdn.ar-cdn.com/recipes/xlarge/1b60d16d-868d-43ea-8d10-8f7c87fdeb63.jpg",
  "href": "http://allrecipes.co.uk/recipe/12686/easy-mushroom-soup.aspx",
  "extension": "Chrome",
  "firstAdded": "2016-01-04T15:34:11.556000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "divided",
    "onions",
    "garlic",
    "medium",
    "field",
    "mushrooms",
    "parsley",
    "salt",
    "coarsely",
    "black",
    "pepper",
    "potatoes",
    "cubes",
    "strong",
    "chicken",
    "use",
    "oxo",
    "stock"
  ],
  "directions": [
    "0",
    "Heat 1 tablespoon of the oil in a medium pot until hot, then add the onions. Saute the onions over medium heat until they begin to turn clear, then add the minced garlic, and continue to saute until aromatic.",
    "Add the mushrooms with the remaining oil to the pot and reduce temperature to low-medium. Toss the mushrooms briefly then put the lid on the pot and steam for 2 minutes.",
    "Remove the lid and turn the heat back up to medium, and toss the mushrooms until they have softened, then add the parsley.",
    "Stir through the parsley, salt and pepper, then add the chopped potatoes. Add the stock and turn the heat up to medium-high, bringing the soup to the boil.",
    "Allow soup to simmer, stirring occasionally, with the lid half on (not fully covered) until the potatoes are soft (approx 20 minutes). Remove from heat and allow to stand for 5 minutes.",
    "Using a blender, blend the soup until it is smooth. Depending on the size of your blender you may need to do this in batches.",
    "Once blended, return the soup to the hob over medium heat, stirring frequently, until heated through. Serve with light rye bread and ENJOY!"
  ],
  "ingredients": [
    "0",
    "3 tablespoons olive oil, divided",
    "2 small onions, diced",
    "1 tablespoon minced garlic",
    "12 medium field mushrooms, chopped",
    "4 tablespoons chopped fresh parsley",
    "1",
    "1 1/2 teaspoons salt",
    "1 1/2 tablespoons coarsely ground black pepper",
    "6 medium potatoes, peeled and diced to 2cm cubes",
    "750ml strong chicken or vegetable stock (I use OXO stock cubes)"
  ],
  "__v": 1
}