{
  "hash": "933a83a73d42e6a700e68c63533ca962f81e2a56",
  "title": "Moussaka",
  "image": "http://ukcdn.ar-cdn.com/recipes/xlarge/5f25cc27-7d48-4b33-9bd6-aa4fd09d36f1.jpg",
  "href": "http://allrecipes.co.uk/recipe/5405/moussaka.aspx",
  "extension": "Chrome",
  "firstAdded": "2016-04-29T06:43:09.544000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 180 C / Gas 4.",
    "Sprinkle the aubergine with salt and leave for 30 minutes (draws out bitter juices). Then rinse aubergine in a colander and squeeze out excess liquid. Dry well with a kitchen cloth. Add to roasting tin and add 1 teaspoon olive oil. Mix to give a good coating. Roast for 30 minutes.",
    "Heat 1 teaspoon olive oil in a pan over medium high heat. Add mince, break up with a fork till browned. Add garlic, cayenne, cumin, cinnamon and coriander, stir for 1-2 minutes. Add herbs, tomatoes and puree. Stir. Turn down the heat to very low and simmer, covered for 30 minutes.",
    "Meanwhile, melt butter in pan, then remove from heat and add flour and mix, return to heat and slowly mix in the milk. Stir over a medium heat until thickened. Season and add cheese and ricotta, stir. Leave to cool.",
    "In an ovenproof dish add a third of the lamb mixture, followed by half the aubergine, then lamb, then aubergine, finishing with the rest of the mince (you can layer less or more according to dish size but make sure top layer is lamb).",
    "Lightly whisk egg in a separate bowl and then stir into white sauce. Top with white sauce and bake in oven for 50 minutes."
  ],
  "ingredients": [
    "0",
    "1 large aubergine, sliced into 1cm slices",
    "2 teaspoons olive oil, divided",
    "600g minced lamb",
    "2 cloves of garlic, minced",
    "1 teaspoon cumin",
    "1 teaspoon ground corriander",
    "1 teaspoon cinnamon",
    "1 teaspoon cayenne pepper",
    "1 (400g) tin chopped tomatoes",
    "1 teaspoon tomato puree",
    "1 bay leaf",
    "1/2 teaspoon dried thyme",
    "1/2 teaspoon dried oregano",
    "1",
    "White sauce",
    "250ml milk",
    "25g butter",
    "25g flour",
    "a pinch of grated nutmeg",
    "30g crumbled feta cheese (grated Parmasan or Cheddar can be used)",
    "250g ricotta",
    "1 egg"
  ],
  "__v": 1
}