{
  "hash": "cbafe9d8485101d77299406a831c35ac879ee78c",
  "title": "Moroccan style broad bean salad with yoghurt & crunchy bits",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/346_1_1350901822_lrg.jpg",
  "href": "http://www.jamieoliver.com/recipes/vegetables-recipes/moroccan-style-broad-bean-salad-with-yoghurt-and-crunchy-bits/",
  "firstAdded": "2014-12-31T14:28:03.367000",
  "users": [
    null
  ],
  "keywords": [
    "podded",
    "broad",
    "beans",
    "lemons",
    "extra",
    "virgin",
    "olive",
    "oil",
    "salt",
    "black",
    "pepper",
    "mint",
    "leaves",
    "picked",
    "red",
    "onion",
    "cumin",
    "seeds",
    "bashed",
    "chilli",
    "stale",
    "breadcrumbs",
    "creamy",
    "live",
    "yoghurt",
    "soured",
    "cream"
  ],
  "directions": [
    "0",
    "First of all pod your beans. When I'm doing mine I round up friends and family to get the job done quicker. I also put the larger ones in one bowl and the smaller ones in another – they'll need different cooking times. Blanch the beans in unsalted boiling water for a couple of minutes, giving the large ones a bit longer (don't add salt, as this will toughen the skins). Drain them and lay them flat on a tray to cool down slightly. This salad always works best when the beans are eaten slightly warm. If you're making it in advance, though, you could always give them a quick flash in the microwave just before serving. Remove the skins from the larger beans if necessary. Place in a bowl and dress with the juice of 1 lemon and three times as much extra virgin olive oil. Season with salt and freshly ground black pepper to taste. Add a little more lemon juice if needed – feel free to adjust to your taste. At this stage I like to finely slice half the mint and add it to the beans while they sit and marinate for a little while.",
    "In a shallow pan, on a medium heat, fry the chopped onion, cumin seeds and chilli in a little olive oil. Stir and cook until softened. As the onions start to colour, add your breadcrumbs and mix these really well into the onions. Continue to cook until the crumbs are crispy and golden, then season them to taste and put to one side. To serve, divide the yoghurt or soured cream between four plates or bowls. Give the broad beans a final toss, add the rest of the mint leaves, and divide between the plates on top of the yoghurt. Finally, sprinkle over the warm spiced crunchy bits.",
    "Sometimes I like to zest a bit of lemon over the top to give a little edge. Fantastic served with grilled chicken or as a tapas or antipasti style thing. Also great with flatbreads like pitta."
  ],
  "ingredients": [
    "0",
    "4 large handfuls podded broad beans",
    "2 lemons",
    "extra virgin olive oil",
    "sea salt",
    "freshly ground black pepper",
    "1 handful fresh mint, leaves picked",
    "1 small red onion, peeled and finely chopped",
    "1 teaspoon cumin seeds, bashed",
    "1 pinch dried chilli",
    "1 handful stale breadcrumbs",
    "285 ml creamy live yoghurt or soured cream"
  ],
  "__v": 1
}