{
  "__v": 1,
  "directions": [
    "0",
    "Place flour in a large bowl and make a well in center; add 2 tbsp. oil, salt, and 1 1/4 cups water, and stir until a dough forms. Transfer dough to a floured work surface and knead until smooth and elastic, 6–8 minutes. Transfer dough to a lightly oiled bowl, cover with plastic wrap, and let rest for 30 minutes.",
    "Meanwhile, heat remaining oil in a 2-qt. saucepan over medium heat. Add garlic and cook, stirring often, until fragrant, about 1 minute. Add tomatoes and basil, season with salt and pepper, and cook, stirring occasionally, to meld flavors, about 10 minutes. Discard basil, remove pan from heat, and set aside to let cool.",
    "Heat oven to 500°. Transfer dough to a floured work surface, and using a rolling pin, roll dough into a 1/16″-thick rectangle. Dimensions aren’t important, just a huge rectangle of thin dough. Arrange the dough so that the long sides are parallel to you. Spread 1 cup tomato sauce over dough in a thin layer and sprinkle with 1 1/4 cups cheese; season with salt and pepper. Fold left third of dough toward center, spread top with 1/4 cup sauce, and sprinkle with 4 tbsp. cheese; season with salt and pepper. Fold right third over center to meet left edge, and repeat with sauce, cheese, and salt and pepper. Fold in top and bottom so they meet in center; spread top with remaining sauce and cheese; season with salt and pepper. Fold top half over bottom half, like closing a book, and transfer to a baking sheet lined with parchment paper; bake for 10 minutes. Reduce oven temperature to 400° and continue baking until dough is set and slightly charred, about 60–65 minutes. Let cool for 10 minutes before slicing into squares and serving."
  ],
  "firstAdded": "2014-06-18T13:25:31.083000",
  "hash": "219ac152975aff306adfa8cac02deed12b734795",
  "href": "http://www.lottieanddoof.com/2011/02/tomato-and-cheese-pie/",
  "image": "http://www.lottieanddoof.com/wp-content/uploads/2011/02/IMG_8094.jpg",
  "ingredients": [
    "0",
    "3 1/2 cups durum wheat flour (I used a mix of semolina flour and bread flour)",
    "1/4 cup extra-virgin olive oil, plus more for greasing",
    "1 tsp. kosher salt, plus more to taste",
    "3 cloves garlic, minced",
    "1 28-oz. can crushed tomatoes",
    "1 bunch fresh basil",
    "Freshly ground black pepper, to taste",
    "10 oz. Pecorino Romano cheese, grated"
  ],
  "keywords": [
    "durum",
    "wheat",
    "used",
    "semolina",
    "bread",
    "flour",
    "extravirgin",
    "olive",
    "oil",
    "greasing",
    "kosher",
    "salt",
    "garlic",
    "tomatoes",
    "bunch",
    "basil",
    "black",
    "pepper",
    "pecorino",
    "romano",
    "cheese"
  ],
  "title": "Tomato and Cheese Pie",
  "users": [
    null
  ]
}