{
  "__v": 1,
  "directions": [
    "0",
    "Combine 3 tablespoons butter and 1 ounce of chocolate in a small bowl, then melt in the microwave for 20-30 seconds. Set aside. In another bowl, combine remaining melted butter with 2-3 tablespoons of graham cracker crumbs and stir until moistened. Press graham crumbs into the bottom of your mug.",
    "In a bowl. whisk egg, sugar and vanilla until smooth. Add in flour, baking powder, salt and cocoa, stir until a thick batter forms. Stream in melted butter and chocolate, mixing to combine. Fold in remaining chocolate chips. Add half of the mixture on top of the graham crust, then throw on a scoop of marshmallow fluff/cream or a few marshmallows. Add remaining batter on top, then pop in the microwave for 1 minute and 20 seconds to almost 2 minutes. Remove and top with additional marshmallow if desired. You can pop it back in the microwave for 5-10 seconds to make them melty, or pop them directly under the broiler for about 10 seconds to toast if desired. You can also use a kitchen torch if you have one. Sprinkle with graham crumbs!",
    "Notes: If you don’t have whole wheat pastry flour, you can use all-purpose. I would not recommend using regular whole wheat. Additionally, I have made this by substituting coconut butter for the full amount of butter. It was just as delicious, albeit slightly drier. You cannot taste coconut at all. Finally, take into account the power of your microwave. Mine has a mind of it’s own and is insanely powerful, so I cooked this on 80% power. Judge accordingly and add/subtract a few minutes of cooking if you know your’s is wonky too. Unfortunately it may take 1-2 trial runs to get the right consistency because all microwaves are different, but I promise it’s worth it!"
  ],
  "firstAdded": "2014-07-07T12:22:24.335000",
  "hash": "23eaed9308b0ab68f9ec1f66e0910c80654c182c",
  "href": "http://www.howsweeteats.com/2012/02/5-minute-chocolate-fudge-smores-mug-cake/",
  "image": "http://www.howsweeteats.com/wp-content/uploads/2012/02/smoresmug-3.jpg",
  "ingredients": [
    "0",
    "2-3 tablespoons graham cracker crumbs",
    "3 1/2 tablespoons unsalted butter, melted",
    "2 tablespoons granulated sugar",
    "1 large egg",
    "1/2 teaspoon vanilla extract",
    "1/4 cup whole wheat pastry flour",
    "2 tablespoons unsweetened cocoa powder (mine was dark cocoa, hence the dark color)",
    "1/8 teaspoon baking powder",
    "pinch of salt",
    "1 1/2 ounces milk chocolate (chopped or morsels)",
    "marshmallow fluff, cream or actual marshmallows"
  ],
  "keywords": [
    "graham",
    "cracker",
    "crumbs",
    "unsalted",
    "butter",
    "granulated",
    "sugar",
    "egg",
    "vanilla",
    "wheat",
    "pastry",
    "flour",
    "cocoa",
    "dark",
    "color",
    "baking",
    "salt",
    "milk",
    "chocolate",
    "morsels",
    "marshmallow",
    "fluff",
    "cream",
    "actual",
    "marshmallows"
  ],
  "title": "5 minute chocolate fudge s’mores mug cake.",
  "users": [
    null
  ]
}