{
  "hash": "e9cca98dbacd1635f0794320a84108a17c97d35a",
  "title": "Salty Chocolate Nutella Thumbprints",
  "image": "https://www.washingtonpost.com/rf/image_982w/2010-2019/WashingtonPost/2011/10/30/Food/Images/food035_1320000300.jpg",
  "href": "https://www.washingtonpost.com/recipes/salty-chocolate-nutella-thumbprints/12462/?tid=a_inl&utm_term=.bb95c773013f",
  "extension": "Firefox",
  "firstAdded": "2017-12-10T00:41:55.965000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350 degrees. Line two baking sheets with parchment paper or a silicone liner.",
    "Whisk together the flour, cocoa powder and salt in a small bowl.",
    "Combine the butter and 1 1/3 cups of sugar in the bowl of a stand mixer or hand-held electric mixer. Beat for about 2 minutes on low speed, until fluffy, then add the egg yolks, cream and vanilla extract; beat on low speed until combined. Add the flour mixture and beat until just incorporated.",
    "Place the remaining cup of sugar in a shallow bowl.",
    "Scoop 30 to 35 heaping tablespoons of dough onto the baking sheets. Shape each mound of dough into a ball, then roll it in the remaining sugar to coat evenly. Space the balls 2 inches apart on the baking sheets, then use your thumb to make an indentation in the top of each cookie, gently flattening the cookies a bit as you work.",
    "Bake one sheet at a time for 10 minutes or until the edges are just set; the tops of the cookies will be soft. (If the indentations have lost definition, press the centers again immediately after you remove the cookies from the oven.) Transfer the baking sheet to a wire rack to cool. Pipe or spoon the Nutella into the center of each cookie while the cookies are still slightly warm.",
    "Serve or store once the Nutella centers have slightly set."
  ],
  "ingredients": [
    "0",
    "2 cups (10 ounces) flour",
    "1 cup plus 1 tablespoon (3.2 ounces) natural unsweetened cocoa powder, sifted",
    "2 teaspoons kosher salt",
    "16 tablespoons (2 sticks) unsalted butter, at a very soft room temperature (see headnote)",
    "1 1/3 cups (9 ounces) sugar, plus 1 cup for finishing the cookies",
    "2 large egg yolks, at room temperature",
    "2 tablespoons heavy cream",
    "2 teaspoons vanilla extract",
    "1 cup Nutella (chocolate hazelnut spread)"
  ],
  "__v": 1
}