{
  "hash": "585195b78c631055f7b95fc4d1ece07606fb77ef",
  "title": "Burnt Almond Torte Cake",
  "image": "https://farm6.staticflickr.com/5602/15614091071_35916fa2e0_b.jpg",
  "href": "https://littleferrarokitchen.com/burnt-almond-torte-cake/?fbclid=IwAR1Hvu8h6UYpNCIkyNEXX046D3QWWrmXnOHDeGfwBxm-oq9L-gEdpCSFwtc",
  "extension": "Chrome",
  "firstAdded": "2019-03-15T22:06:33.848000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Cake",
    "First make the cake. In a large bowl, sift together the flour, baking powder and baking soda and salt. Set aside.",
    "With your mixer, cream together the butter and sugar until well combined and creamy. On low speed, add the eggs, one at a time until mixed in evenly. Then alternate adding the flour mixture and the buttermilk in 3 batches. Then add the vanilla and almond extracts and beat just until mixed.",
    "Line 2-9 inch round cake pans with parchment paper and spray with cooking spray or grease with butter (I use the butter wrapper to grease the pans). Divide batter between both pans and lightly tap down to smooth batter.",
    "Bake cake at 350 degrees F for 25-30 minutes or until tested with a toothpick that comes out clean. When done, allow to cool for at least 20 minutes.",
    "Custard",
    "In a medium pot, add milk and heat until just simmering and hot to the touch.",
    "In another bowl, add egg yolks, sugar and cornstarch and whisk together until very smooth and light yellow. Then, slowly add in the hot milk to the egg mixture in a thin steady stream, while constantly whisking. You want to do this very slowly so the hot milk doesn't cook the eggs. When all mixed, add it back to the pot and cook on medium-low heat until the cream is thick enough to coat the back of a spoon.",
    "Once it has thickened, turn off the heat and add butter, vanilla and almond extract. Strain cream through a sieve over a bowl to get out any lumps. Chill in a bowl and wrap in plastic wrap, with the plastic touching the cream so a skin doesn't form Allow to chill from 3 hours to overnight until completely cold.",
    "Then whip heavy cream until soft peaks form. Add confectioners sugar and continue whipping until stiff peaks. Fold custard into whip cream and chill until ready to layer. (*Note: whipped cream is optional, you can make the custard and use that as your middle layer).",
    "Almond Brittle",
    "In a medium pot, combine the sugar, honey and water and bring to a boil over medium heat. Boil for about 10 minutes without stirring, and until mixture turns a deep amber color, about 10 minutes. You will see it bubble but make sure it is turning a deep amber/brown. When ready, turn off heat and add toasted almonds, butter and baking soda Mix together with a wooden spoon until bubbles subside. Next, pour mixture onto a parchment lined baking sheet and spread out to cool. It is VERY hot so be careful As it cools it will be very sticky. Allow to cool for at least 20 minutes.",
    "Once cool, break up pieces and place in food processor. Process almond brittle until it is fine crumbs. When done, set aside or store in Tupperware.",
    "Italian Meringue Buttercream",
    "In a small pot, add sugar and water. Use a candy thermometer to secure in pot and boil mixture until it is at the \"soft peak\" stage or at about 250 degrees.",
    "As sugar cooks, make the meringue in a stand mixer. Add egg whites and beat on low to break them up. Then add cream of tartar and continue beating, gradually increasing the speed to high. Continue to beat on high until soft peaks form.",
    "Next, add sugar and extracts while mixer is going on high and continue to beat for 1-2 minutes. When sugar syrup is ready, slowly add in the mixture while the egg whites are going at high speed. Slowly stream in the sugar syrup making sure no sugar hits the mixer or bowl. At this point, the bowl will be very warm so continue beating on high until it is cool to the touch, about 10 minutes.",
    "Once cool, continue beating the egg whites and slowly add in the softened butter, about 1 tablespoon at a time. The buttercream will begin to thicken. Once all the butter is in, beat for another 30 seconds and turn off.",
    "To Assemble",
    "Place 1 cake layer on bottom of cake stand. Then spread custard and top with other cake layer. Spread a thin layer of meringue all over cake, making a \"crumb coat\". Chill this in the fridge for at least 30 minutes. Then spread remaining frosting all over cake smoothing out the sides into desired look. Cover sides of cake (and top, if you'd like) with almond brittle and reserved toasted almonds. Chill before serving.",
    "Notes",
    "Almond Brittle makes more than needed, save the rest for ice cream topping."
  ],
  "ingredients": [
    "0",
    "Cake",
    "2 1/2 cups flour sifted",
    "1/2 Tb baking powder",
    "1/2 tsp baking soda",
    "1/2 tsp salt",
    "3/4 cup unsalted butter 1 1/2 sticks, room temperature",
    "1 1/4 cups sugar",
    "4 eggs at room temperature",
    "1 cup buttermilk at room temperature",
    "2 tsp vanilla extract",
    "1 tsp almond extract optional",
    "Custard",
    "1 cup whole milk",
    "3 egg yolks",
    "1/3 cup sugar",
    "2 Tb cornstarch",
    "1 Tb unsalted butter",
    "1/2 tsp vanilla extract",
    "1/2 tsp almond extract",
    "1/3 cup heavy whipping cream",
    "1 tablespoon confectioners' sugar",
    "Almond Brittle",
    "1 cup sugar",
    "1/4 cup honey",
    "3 Tb water",
    "1 cup sliced almonds toasted (save a few sliced almonds for garnish)",
    "2 Tb unsalted butter",
    "1/4 tsp baking soda",
    "Italian Meringue Buttercream",
    "6 egg whites",
    "1/2 tsp cream of tartar",
    "1 cup of sugar + 1/4 cup sugar separated",
    "1/4 cup of water",
    "1 1/2 cups (3 sticks butter unsalted and at room temperature",
    "1 tsp vanilla extract",
    "1/2 tsp almond extract"
  ],
  "__v": 1
}