{
  "hash": "4d8b9ea3dee08ec6485608b7b7f31d993cbc848e",
  "title": "Mushroom risotto",
  "image": "//www.bbcgoodfood.com/sites/default/files/styles/recipe/public/user-collections/my-colelction-image/2015/12/recipe-image-legacy-id--52074_11.jpg?itok=6UH5v5XC",
  "href": "https://www.bbcgoodfood.com/recipes/2364/mushroom-risotto",
  "extension": "Chrome",
  "firstAdded": "2017-06-26T00:21:27.258000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Put the dried mushrooms into a large bowl and pour over 1 litre boiling water. Soak for 20 mins, then drain into a bowl, discarding the last few tbsp of liquid left in the bowl. Crumble the stock cube into the mushroom liquid, then squeeze the mushrooms gently to remove any liquid. Chop the mushrooms.",
    "Heat the oil in a shallow saucepan or deep frying pan over a medium flame. Add the onions and garlic, then fry for about 5 mins until soft. Stir in the fresh and dried mushrooms, season with salt and pepper and continue to cook for 8 mins until the fresh mushrooms have softened.",
    "Tip the rice into the pan and cook for 1 min. Pour over the wine and let it bubble to nothing so the alcohol evaporates. Keep the pan over a medium heat and pour in a quarter of the mushroom stock. Simmer the rice, stirring often, until the rice has absorbed all the liquid. Add about the same amount of stock again and continue to simmer and stir - it should start to become creamy, plump and tender. By the time the final quarter of stock is added, the rice should be almost cooked.",
    "Continue stirring until the rice is cooked. If the rice is still undercooked, add a splash of water. Take the pan off the heat, add the butter and scatter over half the cheese and the parsley. Cover and leave for a few mins so that the rice can take up any excess liquid as it cools a bit. Give the risotto a final stir, spoon into bowls and scatter with the remaining cheese and parsley."
  ],
  "ingredients": [
    "0",
    "olive oil Olive oil ol-iv oylProbably the most widely-used oil in cooking, olive oil is pressed from fresh olives. It's…",
    "onion Onion un-yunOnions are endlessly versatile and an essential ingredient in countless recipes. Native to Asia…",
    "risotto rice Risotto riceTo create an authentic creamy Italian risotto, the use of specialist rice is imperative. It…",
    "butter Butter butt-errButter is made when lactic-acid producing bacteria are added to cream and churned to make an…",
    "parsley Parsley par-sleeOne of the most ubiquitous herbs in British cookery, parsley is also popular in European and…",
    "parmesan Parmesan parm-ee-zanParmesan is a straw-coloured hard cheese with a natural yellow rind and rich, fruity flavour. It…"
  ],
  "__v": 1
}