{
  "__v": 1,
  "directions": [
    "0",
    "In una ciotola versate la farina e il bicarbonato, unite lo strutto (1-2) e l'acqua tiepida ( o il latte, se preferite una piadina più morbida) nella quale avrete disciolto il sale. La quantità di acqua (o latte) necessaria deve essere tale da ottenere un impasto consistente e sodo ma lavorabile.",
    "Manipolate il tutto per una decina di minuti affinché tutti gli ingredienti si mescolino per bene (4-5), infarinate la ciotola , copritela con un panno umido e mettete a riposare l'impasto per mezz'ora (6).",
    "Dividete quindi l'impasto in 4 palle da circa 180 gr l'una, questa quantità di impasto vi servirà per ottenere 4 piadine del diametro di 25 cm circa. A questo punto stendete con il mattarello infarinato i dischi sottili (7) (dovranno essere spessi circa 4-5 millimetri). Per riuscire ad avere un bordo liscio, aiutatevi ritagliando la pasta con un coppapasta di forma circolare (8), oppure servitevi di una rotella tagliapasta dalla lama liscia, e seguite (per esempio) il contorno di un piatto per ottenere una forma circolare regolare (9).",
    "Fate scaldare una padella antiaderente (ideale sarebbe di ghisa o di terracotta) e fate cuocere le vostre piadine da entrambi i lati (10-11) piuttosto velocemente e a fuoco allegro. Durante la cottura (1-2 minuti per parte) bucherellate la piadina con una forchetta e, se si formeranno delle bolle in superficie, schiacciatele con i rebbi. Una volta che saranno cotte da entrambi i lati, potete farcire le piadine con tutti gli ingredienti che preferite, secondo i vostri gusti."
  ],
  "firstAdded": "2014-08-12T09:31:12.570000",
  "hash": "14448812e1c17619ab7f9cd07150f78808394d06",
  "href": "http://ricette.giallozafferano.it/Piadina-Romagnola.html",
  "image": "http://ricette.giallozafferano.it/images/ricette/1/105/slide-450.jpg",
  "ingredients": [
    "0",
    "Farina",
    "500 g",
    "Strutto",
    "75 gr",
    "Bicarbonato",
    "2 gr",
    "Sale",
    "6 gr",
    "Acqua",
    "(o latte) 200 gr"
  ],
  "keywords": [
    "farina",
    "strutto",
    "bicarbonato",
    "sale",
    "acqua",
    "latte"
  ],
  "title": "Piadina Romagnola",
  "users": [
    null
  ]
}