{
  "hash": "129ef126d48c796c6587b1f4bcbfd1f97db71de9",
  "title": "Homemade Amish Pretzels",
  "image": "http://thisweekfordinner.com/wp-content/uploads/2014/03/homemade-amish-pretzels-tray2-web.jpg?b04868",
  "href": "http://thisweekfordinner.com/2014/03/19/homemade-amish-pretzels/",
  "extension": "Chrome",
  "firstAdded": "2016-08-28T17:03:33.139000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large bowl or the bowl of a stand mixer, mix yeast and 1¼ cup warm water. Let sit for 2 minutes.",
    "Add brown sugar, bread flour, self-rising flour and vegetable oil to the yeast and mix to combine completely.",
    "Knead on a lightly-floured surface until you have a nice ball of dough. If you're using your stand mixer, knead with the dough hook for a few minutes until a ball forms. You do not want to over-knead the dough.",
    "If you're using your stand mixer, remove the dough hook and cover the bowl with a clean towel or cloth. If you knead the dough by hand, place in a greased bowl and cover with a cloth. Let rise for 45 minutes, until just about double in size.",
    "Preheat oven to 450º F.",
    "Clean your countertop well. Spray some non-stick oil spray onto a small part of your counter off to the side and dump your dough ball out onto that greased part of the counter. Form a uniform rectangle and then cut the dough into 12 equal pieces.",
    "To form the pretzels, pick up a piece of dough and roll/stretch it out into a long thin rope on the un-greased portion of your countertop. You want the rope to be quite long, about an arm's length, and quite skinny. Make a U shape with the dough, then lift the two ends and twist them around each other twice, then attach the two ends at the bottom of the U to form the pretzel shape. Click here to see a video demonstration.",
    "Whisk together baking soda and hot water in a large bowl. Get a clean dish towel, folded, and place it next to the bowl. Dip the formed pretzel into the solution then blot the bottom side of the pretzel on the towel before placing on a greased cookie sheet or cookie sheet lined with a Silpat. (You should whisk up the water before each dip as the baking soda settles quickly.)",
    "Bake for 5-10 minutes, until pretzels are a dark golden brown. Brush with melted butter and sprinkle with rock salt. If you want to make cinnamon-sugar pretzels, dip the cooked pretzels completely in butter then coat in cinnamon sugar.",
    "Best served fresh out of the oven. Leftovers can be reheated in a 325º oven for about 4 minutes."
  ],
  "ingredients": [
    "0",
    "1¼ cup warm water (warmer than lukewarm but not too warm!)",
    "1 tablespoon active dry yeast",
    "¼ cup brown sugar",
    "2 cup bread flour",
    "2 cup self-rising flour (make self-rising flour by whisking together 2 cups of pastry or cake flour with 3 teaspoons of baking powder and ½ teaspoon salt - be sure to re-measure the 2 cups for this recipe after you've made the self-rising flour)",
    "1 teaspoon vegetable or canola oil",
    "½ cup baking soda",
    "3 cups hot water (not too hot, you'll be sticking your hands in it!)",
    "4 tablespoons butter, melted",
    "rock salt"
  ],
  "__v": 1
}