{
  "hash": "8b72ed3d4e50cfc0310d8eeb8ff63fd05238520b",
  "title": "Mediterranean Okra and Tomato Stew",
  "image": "http://graphics8.nytimes.com/images/2011/09/13/science/12recipehealth/12recipehealth-articleLarge-v2.jpg",
  "href": "http://cooking.nytimes.com/recipes/1013832-mediterranean-okra-and-tomato-stew",
  "extension": "Chrome",
  "firstAdded": "2015-08-21T15:34:00.526000",
  "users": [
    null
  ],
  "keywords": [
    "mediterranean",
    "okra",
    "tomato",
    "stew",
    "salt",
    "red",
    "wine",
    "vinegar",
    "extra",
    "virgin",
    "olive",
    "oil",
    "medium",
    "onions",
    "lengthwise",
    "garlic",
    "preferably",
    "plum",
    "tomatoes",
    "seeded",
    "juice",
    "pepper",
    "diluted",
    "water",
    "allspice",
    "sugar",
    "lemon",
    "parsley"
  ],
  "directions": [
    "0",
    "FOR THE MEDITERRANEAN OKRA AND TOMATO STEW",
    "Trim the stems off the okra, and place in a large bowl. Salt generously, douse with the vinegar and let sit for 30 minutes to an hour. Drain the okra, and rinse thoroughly.",
    "Heat the olive oil over medium heat in a large, lidded skillet or casserole. Add the onions. Cook, stirring, until tender, about five minutes. Add the okra, and cook, stirring, for about three minutes until the edges begin to color. Add the garlic, stir together for about half a minute until fragrant. Stir in the tomatoes. Bring to a simmer, and cook, stirring often, until the tomatoes have cooked down a bit and smell fragrant, about 10 minutes. Add salt and pepper to taste.",
    "Stir in the dissolved tomato paste, allspice and sugar. Add water if necessary to just cover the okra. Bring to a simmer, cover and reduce the heat to low. Simmer 45 minutes until the okra is very tender. Add the parsley and lemon juice, and simmer another five minutes. Taste and adjust salt. Remove from the heat, and serve hot, warm or at room temperature.",
    "Advance preparation: You can make this up to a day ahead of serving. Reheat, or serve at room temperature."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "FOR THE MEDITERRANEAN OKRA AND TOMATO STEW",
    "2 pounds small okra",
    "Salt",
    "1 cup red wine vinegar",
    "¼ cup extra virgin olive oil",
    "2 medium onions, cut in half lengthwise then sliced thin across the grain",
    "3 to 4 garlic cloves to taste, minced",
    "1 pound tomatoes, preferably plum tomatoes, seeded and grated, or else peeled, seeded and chopped; or 1 14-ounce can, with juice",
    "Freshly ground pepper",
    "1 tablespoon tomato paste diluted in 1/2 cup water",
    "1 teaspoon ground allspice",
    "1 teaspoon sugar",
    "2 to 4 tablespoons fresh lemon juice, to taste",
    "¼ cup finely chopped parsley"
  ],
  "__v": 1
}