{
  "hash": "560b63de4031f7bd74b78ee739980997d4819637",
  "title": "SLOW COOKER ROAST CHICKEN AND GRAVY",
  "image": "http://31.media.tumblr.com/84c443ef301468f1044547bb9a936c17/tumblr_inline_n2snq11CLO1qdei8m.jpg",
  "href": "http://nomnompaleo.com/post/4807547385/slow-cooker-roast-chicken-and-gravy",
  "extension": "Chrome",
  "firstAdded": "2015-05-07T17:36:54.233000",
  "users": [
    null
  ],
  "keywords": [
    "organic",
    "kosher",
    "chicken",
    "prefer",
    "saltwashed",
    "bird",
    "ghee",
    "onions",
    "medium",
    "favorite",
    "alliums",
    "garlic",
    "tomato",
    "use",
    "umami",
    "stock",
    "white",
    "wine",
    "replace",
    "extra",
    "sunny",
    "paris",
    "seasoning",
    "salt",
    "pepper"
  ],
  "directions": [
    "0",
    "Here’s what you do:",
    "Gather and chop up your veggies…",
    "…and melt the ghee in a large cast iron skillet over medium heat. Sauté the onions and garlic (I threw in some scallions, too)…",
    "…and add the tomato paste.",
    "The aromatics should be softened and lightly browned after 8-10 minutes. Season the vegetables with salt and pepper to taste.",
    "Then, deglaze the pan with the wine and/or chicken stock, and transfer everything to your slow cooker. Dry off the bird and season it well – inside and out – with salt, pepper, and your favorite poultry seasoning. (I like Sunny Paris seasoning from Penzeys Spices.)",
    "Place the chicken breast side down in the slow cooker, put on the cover, and set it to cook on low for 4-6 hours.",
    "This bird was close to 4 pounds, so I aimed for about 4.5 hours of simmering.",
    "When the chicken’s finished cooking…",
    "…take it out of the slow cooker and let it rest for 20 minutes.",
    "De-fat the braising sauce…",
    "…check for seasoning, and blend it with an immersion blender…",
    "… to make a delicious gravy.",
    "This gravy is kickass!",
    "Rip up the chicken up with your hands like a true cavegirl or caveguy…",
    "…and serve it with the gravy.",
    "My favorite thing about this recipe is the breast stays moist! Love it! Don’t ever cook chicken longer than 6 hours on low!",
    "And DON’T FORGET TO SAVE THE GRAVY! It’s pretty much incredible on everything."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "4-5 pound organic kosher chicken (I prefer the taste of the salt-washed bird)",
    "2 tablespoons of ghee",
    "2 onions, chopped medium (or 2 cups of your favorite alliums)",
    "6 cloves of garlic, peeled",
    "1 teaspoon tomato paste (you can use up to a tablespoon to add more umami)",
    "¼ cup chicken stock",
    "¼ cup white wine (replace with ¼ cup extra chicken stock if on Whole30)",
    "Sunny Paris seasoning (or your favorite seasoning)",
    "Kosher salt",
    "Freshly ground pepper"
  ],
  "__v": 1
}