{
  "hash": "d79e0afbcc7de33a7d71e6926267dee35e2ba355",
  "title": "Vietnamese Iced Coffee Cookies",
  "image": "https://images.food52.com/TEVZCHi8SThZBrjCGBtt-HBjha8=/753x502/1e056bb4-374f-4a93-bc94-1b9f786200d1--2018-0403_vietnamese-iced-coffee-cookies_3x2_james-ransom-086.jpg",
  "href": "https://food52.com/recipes/76338-vietnamese-iced-coffee-cookies",
  "extension": "Chrome",
  "firstAdded": "2018-10-01T22:18:50.447000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cream together the butter and 3/4 cup of the confectioners' sugar until light and fluffy.",
    "Add the vanilla and brewed coffee and beat to mix well.",
    "Add the flour, salt, and ground coffee and beat until the dough is smooth and sticky and not sandy-looking. If it is still sandy looking after you've beaten it for more than five minutes, add more coffee in increments until the dough seems more cohesive.",
    "Roll the dough into a log (or two) about 2\" wide, wrap in parchment or plastic wrap, and refrigerate for at least 2 hours until very firm and chilled.",
    "When ready to bake, preheat the oven to 325° F. Slice the dough into thin circles, place them on a parchment-lined sheet (or in the wells of a muffin tin), and bake for 14-16 minutes or until just barely golden brown on the edges. Remove from the oven and let cool.",
    "While the cookies cool, make the frosting. Beat together the remaining 1/2 cup sugar with the sweetened condensed milk, vanilla bean paste (if using), milk, and espresso powder. It should be thin enough to drizzle easily: Add more milk if not. Once the cookies are cool, drizzle the icing over them or, if you like, spread the surface of each cookie with a thin layer of icing."
  ],
  "ingredients": [
    "0",
    "1 tablespoon very strong brewed coffee, with extra to use",
    "1 cup (8 ounces) unsalted butter, at room temperature",
    "1 1/4 cups (5 ounces) confectioners' sugar, divided",
    "1 teaspoon vanilla extract",
    "1/4 teaspoon salt",
    "2 cups (8 1/2 ounces) all-purpose flour",
    "2 tablespoons coarsely ground coffee (I use a dark roast)",
    "3 tablespoons sweetened condensed milk",
    "1/2 teaspoon vanilla bean paste",
    "1 tablespoon whole milk",
    "1 pinch espresso powder"
  ],
  "__v": 1
}