{
  "hash": "8108638654a86130c027fd50ef1507249fc0bb5a",
  "title": "Instant Pot Salmon with Garlic Potatoes and Greens",
  "image": "//food.fnr.sndimg.com/content/dam/images/food/fullset/2017/10/3/0/FNM_110117-Instant-Pot-Salmon-with-Garlic-Potatoes_s4x3.jpg.rend.hgtvcom.826.620.suffix/1507047931718.jpeg",
  "href": "https://www.foodnetwork.com/recipes/food-network-kitchen/instant-pot-salmon-with-garlic-potatoes-and-greens-3894814",
  "extension": "Chrome",
  "firstAdded": "2019-07-22T01:25:13.949000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Put the potatoes in the bottom of an Instant Pot. Add 1 cup water, 2 tablespoons butter, 1/2 teaspoon salt and a few grinds of pepper. Place the pot's steam rack over the potatoes.",
    "Rub the top and sides of the salmon fillets with the paprika and lemon zest and season generously with salt and pepper. Place skin-side down on the rack. Put on the lid, making sure the steam valve is in the sealing position, and set the cooker to high pressure for 3 minutes. When finished, carefully turn the steam valve to the venting position to release the pressure.",
    "Remove the salmon and rack and set the cooker to saute at normal heat. When the potatoes start sizzling, add the garlic and cook, stirring, until softened, 1 to 2 minutes; stir in the remaining 2 tablespoons butter and season generously with salt and pepper. Smash the potatoes with a fork or wooden spoon until chunky.",
    "Turn off the cooker. Add the mixed greens to the potatoes and stir until wilted, 1 to 2 minutes. Season with salt and pepper. Divide the salmon and potato mixture among plates. Serve with lemon wedges."
  ],
  "ingredients": [
    "0",
    "1 1/4 pounds small red-skinned potatoes, halved or quartered",
    "4 tablespoons unsalted butter",
    "Kosher salt and freshly ground pepper",
    "4 5- to 6-ounce skin-on center-cut salmon fillets (3/4 to 1 inch thick)",
    "1/4 teaspoon paprika",
    "1/2 teaspoon grated lemon zest, plus wedges for serving",
    "4 cloves garlic, minced",
    "4 cups packed mixed baby spinach and arugula (about 31/2 ounces)"
  ],
  "__v": 1
}