{
  "hash": "8f9d4d1402c554fb683762e929a7dcd54cec6688",
  "title": "Creamy Chicken and Asparagus Pasta",
  "image": "http://www.cookingclassy.com/wp-content/uploads/2014/08/creamy-chicken-and-asparagus-pasta7+srgb21.jpg",
  "href": "http://www.cookingclassy.com/2014/08/creamy-chicken-asparagus-pasta/",
  "extension": "Chrome",
  "firstAdded": "2015-08-23T03:13:11.899000",
  "users": [
    null
  ],
  "keywords": [
    "boneless",
    "skinless",
    "chicken",
    "breasts",
    "pounded",
    "mallet",
    "thickness",
    "olive",
    "oil",
    "basil",
    "oregano",
    "thyme",
    "salt",
    "black",
    "pepper",
    "penne",
    "pasta",
    "asparagus",
    "trimmed",
    "ends",
    "remaining",
    "pieces",
    "steamed",
    "butter",
    "allpurpose",
    "flour",
    "garlic",
    "milk",
    "used",
    "cream",
    "neufchatel",
    "light",
    "cheese",
    "parmesan",
    "slices",
    "bacon",
    "crumbled"
  ],
  "directions": [
    "0",
    "In a small bowl, stir together basil, oregano, thyme and 1/4 salt and pepper. Sprinkle half of the herb mixture evenly over tops of chicken. Heat olive oil in a non-stick skillet over medium-high heat. Once hot, add chicken to skillet, herbed side down, then add remaining herb mixture to tops of chicken. Cook chicken until fully cooked through, about 8 - 12 minutes, occasionally rotating chicken (time will vary based on thickness of chicken breasts. If chicken is browning too quickly reduce heat to medium low as needed). Transfer cooked chicken to a plate, let rest 5 minutes then dice into pieces.",
    "Meanwhile cook pasta according to directions listed on package, reserving 1/2 cup pasta water before draining.",
    "In a clean skillet (large and deep), melt butter over medium heat. Whisk in flour and cook 1 minute, stirring constantly, add garlic and cook 30 seconds longer, stirring constantly. While whisking, slowly pour in milk then cream (whisk vigorously to break up clumps). Season with salt and pepper to taste (a fair amount of each) and bring mixture to a boil, stirring constantly. Once it reaches a boil and thickens, reduce heat to medium-low, add Neufchatel and parmesan cheese and cook, stirring frequently, until cheeses have melted.",
    "Toss in cooked pasta, then add cooked chicken, steamed asparagus and bacon and toss to evenly coat. Add in reserved pasta water as desired (it will thicken as it rests and the pasta will absorb the liquids, so add up to 1/2 cup as needed). Serve immediately.",
    "Recipe Source: inspired by Scattered Thoughts of a Crafty Mom"
  ],
  "ingredients": [
    "0",
    "1 lb boneless skinless chicken breasts, pounded with mallet to even thickness",
    "1 Tbsp olive oil",
    "1 tsp dried basil",
    "1/2 tsp dried oregano",
    "1/4 tsp dried thyme",
    "1/4 tsp each salt and freshly ground black pepper, plus more for sauce",
    "12 oz penne pasta",
    "1 lb asparagus, trimmed of ends, remaining diced into 2-inch pieces and steamed",
    "1 1/2 Tbsp butter",
    "2 Tbsp all-purpose flour",
    "2 cloves garlic, minced",
    "1 3/4 cup milk (I used 1%)",
    "1/4 cup cream or half and half",
    "3 oz Neufchatel cheese (aka light cream cheese), diced into pieces",
    "1/3 cup finely shredded parmesan cheese",
    "4 - 5 slices bacon, cooked and crumbled into small pieces (optional)"
  ],
  "__v": 1
}