{
  "hash": "f3af1bc1aa2b764ac7dbec84937927d1a0a0666b",
  "title": "Basic Arepas: Venezuelan and Colombian Corncakes",
  "image": "http://recipe-folder.com/img/recipe-images/076/913/2815244476.jpg",
  "href": "http://recipe-folder.com/recipe/5ba933275bee9e422c638b63",
  "extension": "User Added",
  "firstAdded": "2018-09-24T18:55:35.594000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Stir the salt into the masarepa cornmeal.",
    "1",
    "Pour 2 3/4 cups of hot water over the flour and mix well with a wooden spoon.",
    "2",
    "Stir in the melted butter.",
    "3",
    "Cover dough with plastic wrap and let rest 15 minutes.",
    "4",
    "If you want thicker arepas, separate the dough into 12 pieces.",
    "5",
    "Shape each piece into a smooth ball. Add more water if needed -- the dough should be moist enough so that you can shape the arepas without the dough forming lots of cracks around the edges.",
    "6",
    "Place each ball in between 2 sheets of plastic wrap or 2 ziplock bags and flatten gently with the bottom of a pot. Arepas should be about 3 inches in diameter and almost an inch thick. (For thinner arepas, divide the dough into 18 pieces and form into balls. When flattened they should be about 3 1/2 inches in diameter and 1/4 inch thick.)",
    "7",
    "Use your fingers to smooth out any cracks along the edges.",
    "8",
    "Place the shaped arepas on a cookie sheet covered with plastic wrap.",
    "9",
    "Heat a cast iron skillet on low heat. Put 1/2 tablespoon butter or vegetable oil in the skillet.",
    "10",
    "Place several arepas in the pan, leaving room to turn them.",
    "11",
    "Cook the arepas about 5 minutes on each side. The surface should dry and form a crust. They will brown slightly but do not let them brown too much. They should look like an English muffin. If they are browning too fast, lower the heat. Add more butter or oil for subsequent batches as needed.",
    "12",
    "The thinner arepas are done when they have formed a nice crust but are still soft on the inside.",
    "13",
    "The thicker, Venezuelan-style arepas finish cooking in the oven. After they have formed a crust and are just a bit browned, place them on a cookie sheet and heat for 8 to 10 minutes at 350 F.",
    "14",
    "Serve both thin and thick arepas hot."
  ],
  "ingredients": [
    "0",
    "1 teaspoon salt",
    "1",
    "2 1/2 cups masarepa cornmeal",
    "2",
    "2 3/4 to 3 1/2 cups hot water",
    "3",
    "2 tablespoons melted butter",
    "4",
    "1/2 tablespoon butter or vegetable oil"
  ],
  "__v": 1,
  "hidden": true
}