{
  "hash": "452bb3af4bbbdf2522e22b9803d748f6bb48a0a6",
  "title": "Coconut-Cardamom Vegan Overnight Oat Parfait with Blueberry Chia Seed Jam",
  "image": "http://cdn.ohsheglows.com/wp-content/uploads/2015/07/veganovernightoats-0100.jpg",
  "href": "http://ohsheglows.com/2015/07/30/coconut-cardamom-vegan-overnight-oat-parfait-with-blueberry-chia-seed-jam/",
  "extension": "Chrome",
  "firstAdded": "2016-02-15T21:21:26.880000",
  "users": [
    null
  ],
  "keywords": [
    "blueberry",
    "chia",
    "seed",
    "jam",
    "frozen",
    "blueberries",
    "maple",
    "syrup",
    "salt",
    "seeds",
    "lemon",
    "juice",
    "vegan",
    "overnight",
    "oats",
    "coconut",
    "milk",
    "yes",
    "use",
    "light",
    "fullfat",
    "super",
    "creamy",
    "delish",
    "rolled",
    "glutenfree",
    "necessary",
    "cardamom",
    "cinnamon",
    "pears",
    "layering"
  ],
  "directions": [
    "0",
    "Directions:",
    "Prepare the chia seed jam: In a medium pot, stir together the blueberries and maple syrup until combined. Add a dash of salt. Simmer over medium-high heat, uncovered, for about 8-10 minutes until softened (the berries will release a lot of water during this time).",
    "Add the chia seeds and stir until combined. Continue simmering and stirring frequently (reducing heat if necessary to avoid sticking) about 8-15 minutes longer, until most of the water cooks off and the jam reduces in volume. it will look thickened.",
    "Remove from heat and stir in the lemon juice. Transfer the mixture to a bowl, uncovered, and into the fridge until cool, for at least a couple hours. For a quicker cooling method, pop the jam in the freezer, uncovered, for 45-60 minutes, stirring every 15 minutes, until cool.",
    "For the vegan overnight oats: In a medium container (with a lid) or in a medium bowl, stir together the entire can of coconut milk, oats, chia seeds, maple syrup, cardamom, and cinnamon until combined. Cover and chill for 1-2 hours, or overnight, until the oats soften and the mixture thickens. Stir to combine before using.",
    "Layer the chia jam, overnight oats, and diced pear into small jars. Secure lids (or cover with wrap) and store leftovers in the fridge for up to 3-4 days. The chia seed jam will keep in an air-tight container in the fridge for up to 2 weeks. Also, leftover jam can be frozen in plastic baggies and it thaws beautifully."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "For the blueberry chia seed jam:",
    "550g frozen blueberries (about 4 cups + 2 tablespoons)",
    "1/4 cup pure maple syrup, or to taste",
    "Dash fine sea salt",
    "3 tablespoons chia seeds",
    "1 teaspoon fresh lemon juice, or more to taste",
    "For the vegan overnight oats:",
    "1 (15-oz) can full-fat coconut milk (yes you can use light, but full-fat is super creamy and delish)",
    "1 cup rolled oats (use gluten-free if necessary)",
    "3 tablespoons chia seeds",
    "1 tablespoon pure maple syrup",
    "1/2 teaspoon ground cardamom , or more to taste",
    "1/4 teaspoon cinnamon, or more to taste",
    "1-2 small ripe pears, diced (for layering)"
  ],
  "__v": 1
}