{
  "hash": "1e1581c9b916afd0438214c163c51261c9e70a8e",
  "title": "Strawberries & Cream Torte",
  "image": "//cdn2.tmbi.com/TOH/Images/Photos/37/300x300/Strawberries---Cream-Torte_exps167223_TH2847295D02_21_4bC_RMS.jpg",
  "href": "http://www.tasteofhome.com/recipes/strawberries---cream-torte",
  "extension": "Chrome",
  "firstAdded": "2017-03-30T23:11:29.340000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place egg whites in a large bowl; let stand at room temperature 30 minutes. Preheat oven to 350°. Line bottoms of two greased 8-in. round baking pans with parchment paper; grease paper.",
    "In a large bowl, cream butter and 1/2 cup sugar until light and fluffy. Add egg yolks, beating well. Beat in vanilla.",
    "In another bowl, whisk flour, baking powder and salt; add to creamed mixture alternately with milk, beating well after each addition. Transfer to prepared pans.",
    "With clean beaters, beat egg whites on medium speed until foamy. Add remaining sugar, beating on high until sugar is dissolved. Continue beating until soft peaks form. Spread over batter in pans.",
    "Bake 12-15 minutes or until a toothpick inserted in center comes out clean. Cool completely in pans on wire racks. (Cake layers will be thin.)",
    "In a large bowl, beat cream until stiff peaks form. Loosen edges of cakes from pans with a knife. Carefully remove one cake to a serving plate, meringue side up.",
    "Arrange sliced strawberries over top; sprinkle with sugar. Gently spread with half of the whipped cream. Top with remaining cake layer, meringue side up; spread with remaining whipped cream. Top with whole strawberries. Refrigerate until serving. Yield: 12 servings."
  ],
  "ingredients": [
    "0",
    "2 large eggs, separated",
    "1/4 cup butter, softened",
    "1/2 cup plus 1/2 teaspoon sugar, divided",
    "1/2 teaspoon vanilla extract",
    "1 cup all-purpose flour",
    "1-1/2 teaspoons baking powder",
    "1/4 teaspoon salt",
    "1/2 cup 2% milk",
    "ASSEMBLY:",
    "2 cups heavy whipping cream",
    "1 pint fresh strawberries, hulled and sliced",
    "1/2 teaspoon sugar",
    "Additional fresh strawberries"
  ],
  "__v": 1
}