{
  "hash": "98c3195d6e275960986c46173f6247d628a47ac8",
  "title": "Eggplant Parmesan",
  "image": "http://d2k9njawademcf.cloudfront.net/indeximages/27523/original/eggplant_parm.jpg?1342994445",
  "href": "http://food52.com/recipes/431-eggplant-parmesan#5083304170da80301b000002",
  "keywords": [
    "eggplant",
    "variety",
    "make",
    "sure",
    "firm",
    "smooth",
    "choose",
    "male",
    "eggplants",
    "fewer",
    "seeds",
    "rounder",
    "smoother",
    "flour",
    "salt",
    "generous",
    "amounts",
    "olive",
    "oil",
    "parmigianoreggiano",
    "buffalomilk",
    "mozzarella",
    "balls"
  ],
  "directions": [
    "0",
    "Peel the eggplant and slice long ways into 1/4 inch slices.",
    "Sprinkle each layer with salt and place into a colander, overlapping and salting as you go. Each slice should be salted. After you fill the colander, place a plate on top and weight it with a heavy pan or a tea kettle filled with water. Let the eggplant sweat for 30 minutes or more.",
    "While the eggplant sweats, make the sauce.",
    "Cover the bottom of a sauce pan with olive oil and heat over medium high heat. Add the sliced garlic and let it cook until is sizzles (do not brown the garlic). Add the canned whole tomatoes and their juice and salt. Stir and chop coarsely using a potato masher or two knives chopping crossways. Lower the heat and simmer until reduced by almost half.",
    "Remove the eggplant fro the colander and thoroughly pat dry each slice.",
    "Heat the oven to 450 degrees. Cover the bottom of a baking sheet or two with olive oil.",
    "Dredge the eggplant slices in flour, shaking off any excess. Place on the baking sheets and drizzle the each slice with olive oil. Bake until brown on one side (about 15 minutes or so) and tun over and brown the other side. Repeat until you have cooked all the eggplant.",
    "Using a 7x11 baking dish (I like ceramic or earthenware, but you can use stainless steel as well), spread a thin layer of sauce on the bottom and layer the eggplant until it completely covers the bottom (it's like a puzzle!).",
    "Sprinkle generously with the grated parmigiano-reggiano. Add another layer of sauce and then the eggplant. Continue to build the layers until you are about two layers from the top, then add a single layer of sliced mozzarella. Finish with a couple more layers of eggplant, sauce, and parmesan. Finish the top with parmesan.",
    "Bake on the upper third of a 400 degree oven. Check it after it' been in the oven for 20 minutes. You may find that it throws off more liquid as it bakes. If so, press down on the eggplant and draw off any excess liquid. Cook for another 15 minutes or so. Let stand for a good 15 or 20 minutes before serving."
  ],
  "ingredients": [
    "0",
    "3",
    "pounds eggplant (Choose the large variety. Make sure they are firm and smooth. Also, choose male eggplants. They have fewer seeds and have a rounder, smoother bottom)",
    "1",
    "cup flour",
    "salt",
    "generous amounts of olive oil",
    "1",
    "cup grated parmigiano-reggiano",
    "1/2",
    "pound buffalo-milk mozzarella (if the balls are small, get two)"
  ],
  "__v": 0
}