{
  "hash": "091f93aa7b4919dcb9aa2254cbc1eaf0dacb4db9",
  "title": "Salsa Verde Enchiladas",
  "image": "http://recipe-folder.com/img/recipe-images/027/965/3040350927.jpg",
  "href": "https://www.goodhousekeeping.com/food-recipes/a7010/salsa-verde-enchiladas-ghk0308/",
  "extension": "Chrome",
  "firstAdded": "2018-09-22T14:47:07.426000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Remove meat from chickens and coarsely shred; place in medium bowl (you will need 5 1/2 cups; reserve any extra for use another day). Discard skin and bones. Stir 1/2 cup salsa verde into chicken to evenly coat.",
    "Preheat oven to 350 degrees F. Grease two 13\" by 9\" glass or ceramic baking dishes; set aside. In 12-inch skillet, heat remaining salsa verde, green onions, and lime juice to boiling on medium-high. Boil 2 minutes, stirring occasionally. Stir in 2 tablespoons cilantro; keep warm over very low heat.",
    "With tongs, place 1 tortilla in salsa verde mixture; heat 10 seconds. Place tortilla on waxed paper; top with about 1/3 cup shredded-chicken mixture. Roll up tortilla and place, seam side down, in prepared baking dish. Repeat with remaining tortillas and chicken mixture, arranging 8 tortillas in each dish.",
    "Stir sour cream and broth into remaining salsa verde mixture in skillet; spoon over filled tortillas. Cover one baking dish with foil and bake 15 minutes. Remove foil; sprinkle with 1 cup cheese and 1 tablespoon cilantro. Bake 5 minutes longer or until cheese melts. Meanwhile, sprinkle remaining cheese and cilantro over second casserole and prepare for freezing (see Thawing and Reheating Tips)."
  ],
  "ingredients": [
    "0",
    "2 rotisserie chickens",
    "2 jar mild salsa verde",
    "6 green onions",
    "1/4 c. fresh lime juice",
    "1/2 c. fresh cilantro leaves",
    "16 (6-inch) corn tortillas",
    "1 container reduced-fat sour cream",
    "1/2 c. reduced-sodium chicken broth",
    "1 package reduced-fat (2%) shredded Mexican cheese blend"
  ],
  "__v": 1,
  "hidden": true
}