{
  "__v": 1,
  "directions": [
    "0",
    "Remove the green husks and all the ‘silk’ from the corn. Holding each cob upright on a chopping board, cut the kernels from the cob. You should end up with 225–250 g (8–9 oz) loose corn kernels. Set aside.",
    "Heat the sunflower oil in a large saucepan, add the onion and fry over a moderate heat until softened, but not browned. Add the potatoes and sweetcorn kernels to the pan and cook for a further 5 minutes, stirring frequently. Pour in the chicken stock and bring to the boil. Reduce the heat and simmer gently for 5 minutes or until the potatoes are just tender.",
    "Stir in the milk, three-quarters of the chicken and the chopped tarragon. Season to taste. Cook, stirring, for a further 2–3 minutes.",
    "Pour half of the mixture into a food processor and process to a coarse texture, not to a purée. Return to the pan. Add the rest of the chicken and stir to mix. Set the chowder over a low heat to warm through.",
    "Meanwhile, grill the rashers of bacon until cooked and starting to brown. Drain the bacon on kitchen paper, then finely chop.",
    "Ladle the chowder into bowls, scatter on some bacon and a sprinkling of tarragon leaves, and serve."
  ],
  "firstAdded": "2014-10-24T15:53:17.148000",
  "hash": "6cf939017c9b7104ef45e4e6731922bc7febf149",
  "href": "http://allrecipes.co.uk/recipe/2623/chicken-and-sweetcorn-chowder.aspx?o_is=LV",
  "image": "http://ukcdn.ar-cdn.com/recipes/xlarge/2c15a667-33d9-4d50-bc99-83866c52e048.jpg",
  "ingredients": [
    "0",
    "3 fresh corn-on-the-cob",
    "1 tbsp sunflower oil",
    "1 onion, finely chopped",
    "2 potatoes, about 300 g (10½ oz) in total, peeled and diced",
    "500 ml (17 fl oz) chicken stock, preferably home-made",
    "500 ml (17 fl oz) skimmed milk",
    "1",
    "250 g (9 oz) cooked chicken meat, without skin, finely chopped",
    "2 tsp chopped fresh tarragon",
    "salt and pepper",
    "To garnish",
    "2 rashers lean smoked back bacon",
    "fresh tarragon leaves"
  ],
  "keywords": [
    "cornonthecob",
    "sunflower",
    "oil",
    "onion",
    "potatoes",
    "total",
    "chicken",
    "stock",
    "preferably",
    "skimmed",
    "milk",
    "meat",
    "skin",
    "tarragon",
    "salt",
    "pepper",
    "rashers",
    "lean",
    "smoked",
    "bacon",
    "leaves"
  ],
  "title": "Chicken and sweetcorn chowder",
  "users": [
    null
  ]
}