{
  "hash": "271ae1bed177d3d2db14a8c9fa0c35bdcd8a2f9e",
  "title": "Ellen's Honey-Applesauce Cake",
  "image": "http://www.dianasdesserts.com/assets/managed/recipes/montage.jpg",
  "href": "http://www.dianasdesserts.com/index.cfm/fuseaction/recipes.recipeListing/filter/dianas/recipeID/2328/Recipe.cfm",
  "extension": "Chrome",
  "firstAdded": "2016-10-01T22:13:17.586000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions:",
    "Preheat oven to 350 degrees F (180 C). Lightly grease or spray a 9 or 10-inch tube, angel food or bundt cake pan, or three (8 x 4-inch) loaf pans. If you are using an angel food, tube or loaf pans, line the pan (s) with parchment paper and lightly grease or spray parchment paper also. (Note: Because of the design of a bundt style pan, it cannot be lined with parchment, so this type of pan MUST be lightly greased with butter or shortening, or sprayed with a non-stick cooking spray).",
    "In a large mixing bowl, combine all of the dry ingredients. Mix well.",
    "In a small bowl, combine honey with oil. Add honey/oil mixture to dry ingredients and whisk in the remaining liquid ingredients in the order stated above. Add raisins and chopped nuts if using. Combine thoroughly.",
    "Pour batter into prepared cake pan (s) and bake in preheated 350 degree F (180 C) oven for 60 to 70 minutes if using a tube, angel food or bundt pan. If using three loaf pans, bake cakes for 45 to 55 minutes. Cake (s) should spring back when lightly pressed when done and when cake tester inserted in cake comes out clean.",
    "Remove cake (s) from oven and leave in pan (s) for 10 minutes before inverting onto wire rack (removing parchment paper) to cool completely. For best flavor, make the cake (s) the day before you are going to eat them. Wrap cake (s) in aluminum foil or plastic wrap and store at room temperature for up to 3 days.",
    "When ready to serve, transfer cake to serving plate and dust top with confectioners' sugar and sprinkle with sliced or slivered almonds or chopped walnuts, if desired.",
    "Makes one (9 or 10-inch) tube or bundt cake, or three (8 x 4-inch) loaf cakes.",
    "Note: Cake may also be made in a rectangular 9 x 13-inch baking pan. If making in this size pan, bake cake for 40 to 45 minutes.",
    "Freezing:",
    "Although this cake tastes best a day or two after baking, it also tastes very nice after being frozen and thawed. This is a cake that freezes well. To freeze, wrap cooled cake (s) in aluminum foil and then wrap in plastic wrap and place in a zip-loc bag; seal, label and date. Cake will keep 4 to 6 months in the freezer.",
    "To Thaw and Serve:",
    "Thaw cake at room temperature, covered, 3 to 4 hours.",
    "Honey Tips:",
    "When making either cakes or cookies with honey, first mix the honey with the fat or the liquid in the recipe. Then mix it thoroughly with the other ingredients. If this is not done, a soggy layer will form on the top of your cookies or cakes.",
    "Desserts or other goodies made with honey brown faster than foods made with other sweeteners. So when you bake desserts made with honey, set the oven temperature 25 degrees F lower than what is indicated in the recipe."
  ],
  "ingredients": [
    "0",
    "--------Dry Ingredients:",
    "3 1/2 cups all-purpose flour",
    "1 cup granulated sugar",
    "1/2 cup light or dark brown sugar",
    "2 tsp. baking soda",
    "2 tsp. baking powder",
    "2 tbsp. ground cinnamon",
    "2 tsp. ground nutmeg",
    "1/2 tsp. ground cloves",
    "1/2 tsp. ground allspice",
    "--------Liquid Ingredients:",
    "1 cup clear honey",
    "1 cup vegetable oil",
    "1 cup strongly brewed tea, cooled to room temperature",
    "3 large eggs",
    "1/4 cup orange liqueur or orange juice",
    "1 1/3 cups unsweetened applesauce",
    "1 tsp. vanilla extract",
    "--------Optional Ingredients:",
    "1/2 cup raisins, golden or dark",
    "1/2 to 3/4 cup chopped almonds or walnuts (or other nuts of your choice)",
    "Topping: (optional)",
    "Confectioners' sugar",
    "Sliced or slivered almonds or chopped walnuts"
  ],
  "__v": 3
}