{
  "hash": "ee297b36a38af4001c53f2fb1f2c49a5df30663a",
  "title": "Warm, Roasted Potato Salad",
  "image": "https://thecozyapron.com/wp-content/uploads/2012/06/potato-salad-warm_06-10-12_4_ca.jpg",
  "href": "https://thecozyapron.com/warm-roasted-potato-salad-and-an-ice-cold-beer/",
  "extension": "Chrome",
  "firstAdded": "2020-01-29T19:32:10.252000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparation:",
    "-Preheat the oven to 400 degrees and line a baking sheet with foil.",
    "-In a large bowl, add the halved (or quartered) baby potatoes along with 2 tablespoons of the olive oil, the 1 teaspoon of sea salt and the cracked pepper, and toss well to combine; drizzle a little bit of olive oil onto the foil lined baking sheet, and turn the baby potatoes out onto the baking sheet and roast for 35-40, or until golden-brown and tender; while potatoes roast, crisp the bacon and caramelize the red onion.",
    "-In a medium-large non-stick pan set over medium heat, add the remaining 2 tablespoons of olive oil; when hot, add the sliced red onion and the tablespoon of sugar, and toss to coat with a pair of tongs; cook/caramelize the red onions on medium for about 12-14 minutes, or until a golden, caramel color, and softened; once onions are caramelized, add the pinch of sea salt to them, stir to incorporate, and remove from heat; set aside and keep warm until ready to add to potato salad.",
    "-Next, in a medium, non-stick pan set over medium heat, cook the bacon pieces until brown and crispy, and then remove them with a slotted spoon and onto a paper towel to drain; reserve 3 tablespoons of the bacon drippings, and set aside to use in the vinaigrette; keep the drippings warm.",
    "-Once the baby potatoes are roasted, remove from oven, and allow them to cool for a few moments while you prepare the warm, bacon vinaigrette, below.",
    "Warm, Bacon Vinaigrette ingredients:",
    "3 tablespoons apple cider vinegar",
    "2 teaspoons sugar",
    "½ teaspoon Dijon mustard",
    "¼ teaspoon Italian seasoning",
    "¼ teaspoon black pepper",
    "¼ teaspoon salt",
    "3 tablespoons reserved, warm bacon drippings",
    "1 tablespoon olive oil",
    "Preparation:",
    "-In a small bowl, whisk together all of the ingredients beginning with the apple cider vinegar through the salt; slowly drizzle in the bacon drippings while whisking, and then the olive oil; whisk until the vinaigrette is well combined.",
    "To Assemble:",
    "-Add the warm, roasted baby potatoes to a large bowl, and then add the caramelized red onion, the crispy bacon, the chopped flat-leaf parsley and the vinaigrette; toss well to completely combine, making sure that all of the potatoes are well dressed; divide equally among plates, and serve while still warm.",
    "*This potato salad is also quite delicious served cold, perhaps with the addition of spinach or arugula greens.",
    "Pin232.9K"
  ],
  "ingredients": [
    "0",
    "Roasted Potato Salad Ingredients:",
    "2 (1 ½ pound) bags yellow baby potatoes, either halved or quartered depending on size",
    "4 tablespoons olive oil, divided use, plus a drizzle for the baking sheet",
    "1 teapsoon sea salt, plus a pinch, divided use",
    "¼ teaspoon cracked black pepper",
    "1 large red onion, quartered and sliced thinly",
    "1 tablespoon sugar",
    "6 strips apple smoked bacon, uncured, chopped into small pieces",
    "2 tablespoons flat-leaf parsley"
  ],
  "__v": 1
}