{
  "hash": "f34312a737f880caa4db63095fe812a97f71ffd0",
  "title": "Carrot cake",
  "image": "http://theordinarycook.co.uk/wp-content/uploads/2010/01/carrot-cake.jpg?w=300",
  "href": "http://theordinarycook.co.uk/2010/01/05/carrot-cake/",
  "extension": "Chrome",
  "firstAdded": "2016-03-04T14:47:35.419000",
  "users": [
    null
  ],
  "keywords": [
    "wonder",
    "used",
    "passion",
    "rarely",
    "called",
    "sounds",
    "far",
    "tempting",
    "fact",
    "young",
    "wouldnt",
    "entertain",
    "idea",
    "carrot",
    "cake",
    "sounded",
    "weird",
    "braved",
    "day",
    "remember",
    "trepidation",
    "followed",
    "surprise",
    "absolutely",
    "wasnt",
    "expecting",
    "butter",
    "softened",
    "soft",
    "light",
    "brown",
    "sugar",
    "eggs",
    "separated",
    "zest",
    "juice",
    "lemon",
    "wholemeal",
    "selfraising",
    "flour",
    "baking",
    "cinnamon",
    "almonds",
    "pecans",
    "chunkily",
    "carrots",
    "icing",
    "cream",
    "cheese",
    "pecan",
    "nuts",
    "decorate"
  ],
  "directions": [
    "0",
    "Method",
    "Grease and line a 20 cm (8 inch) round cake tin and preheat the oven to 180°c (gas mark 4).",
    "Whisk the softened butter and the sugar together until light and fluffy. Beat in the egg yolks and then add the lemon zest and juice. Sieve the flour, baking powder and cinnamon into the bowl, making sure you add all the bran left in the sieve when you have finished. Fold this gently into the mixture. Stir in the ground almonds and the pecan nuts.",
    "In a very clean bowl and using very clean whisks beat the egg whites until stiff. Add one-third of the egg white to the cake mix and mix in well. Add the carrots and mix in well. Fold in the remaining egg white very carefully to keep as much air as possible.",
    "Spoon into the prepared tin and level the top. Bake on the middle shelf for 1 to 1½ hours until golden and firm to the touch. I baked mine in the baking oven of my Aga and it took 1 hour and 10 minutes to cook, so do check at 1 hour and then keep checking.",
    "Leave the cake to cool in the tin for ten minutes and then remove to a cake rack and leave to cool completely.",
    "To make the icing, mix the butter and the cream cheese until really well combined. Add the icing sugar and the soft light brown sugar and beat well until smooth, stir in the grated lemon zest and the lemon juice.",
    "Spread on top of the cake and decorate with pecan nuts.",
    "Take a big slice, make a cup of tea and enjoy!"
  ],
  "ingredients": [
    "0",
    "I wonder why it used to be called Passion Cake? You very rarely see it called that now, it sounds far more tempting than carrot cake. In fact when I was young I wouldn’t entertain the idea of carrot cake – it sounded too weird. Then I braved it one day. I can still remember it, the trepidation, followed by the surprise that it was absolutely delicious and sweet. I wasn’t expecting that!",
    "For the cake:",
    "225g (8oz) butter, softened",
    "225g (8oz) soft light brown sugar",
    "4 eggs, separated",
    "finely grated zest and juice of 1 lemon",
    "175g (6oz) wholemeal self-raising flour",
    "1 tsp baking powder",
    "½ tsp ground cinnamon",
    "50g (2oz) ground almonds",
    "115g (4oz) pecans, chopped chunkily",
    "350g (12oz) carrots, peeled and grated",
    "For the icing:",
    "40g (1½oz) softened butter",
    "40g (1½oz) cream cheese",
    "25g (1oz) icing sugar",
    "50g (2oz) soft light brown sugar",
    "finely grated zest of 1 lemon",
    "1 tsp lemon juice",
    "pecan nuts to decorate"
  ],
  "__v": 1
}