{
  "hash": "bb67d49b4d59f568688b89e2a7f592f81de90377",
  "title": "Gluten-free biscotti",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/1333_13_1414501035_lrg.jpg",
  "href": "http://www.jamieoliver.com/recipes/chocolate-recipes/gluten-free-biscotti/",
  "extension": "Chrome",
  "firstAdded": "2015-05-11T10:19:10.737000",
  "users": [
    null
  ],
  "keywords": [
    "shelled",
    "pistachios",
    "glutenfree",
    "plain",
    "flour",
    "extra",
    "dusting",
    "used",
    "doves",
    "farm",
    "baking",
    "salt",
    "golden",
    "caster",
    "sugar",
    "dark",
    "chocolate",
    "cocoa",
    "solids",
    "freerange",
    "egg",
    "rose",
    "water",
    "semiskimmed",
    "milk"
  ],
  "directions": [
    "0",
    "Spread out the pistachios on a baking tray, then place in the hot oven for around 5 minutes, or until golden. Leave to cool, then roughly chop – you want nice chunks so don't chop them too finely.",
    "In a large bowl, combine the flour, baking powder, salt, sugar and the chopped pistachios. Finely chop and add the chocolate (if using). Beat the egg in a separate bowl, add the rose water, then whisk well until light and frothy. Gradually add the egg mixture to the dry ingredients, stirring continuously until you get a firm dough, adding a small splash of milk to bring it together, if needed.",
    "Line a large baking tray with greaseproof paper. With lightly floured hands, halve the dough, then shape each portion into a cylinder, roughly 30cm in length and 4cm thick. Place them onto the lined baking tray, making sure they have enough room to spread out as they cook.",
    "Bake for around 25 minutes, or until lightly golden, then allow to cool for 5 minutes. Reduce the oven temperature to 150ºC/300ºF/gas 2. Transfer the biscotti to a board, then use a serrated knife to slice it into rounds at an angle, roughly 2cm thick. Place on the tray, cut-side up, then bake for a further 15 to 20 minutes, or until crisp and golden.",
    "Transfer to a wire cooling rack to cool completely. Serve with a nice cup of coffee, or wrap in cellophane, secure with ribbon and give them away as a super-cute gift."
  ],
  "ingredients": [
    "0",
    "120 g shelled pistachios",
    "200 g gluten-free plain flour, plus extra for dusting (I used Doves Farm)",
    "1 teaspoon gluten-free baking powder",
    "½ teaspoon fine sea salt",
    "200 g golden caster sugar",
    "30 g dark chocolate (over 70% cocoa solids), optional",
    "1 large free-range egg",
    "1 teaspoon rose water",
    "semi-skimmed milk, optional"
  ],
  "__v": 1
}