{
  "hash": "d5d33f1e39651a684541197797551e378597657a",
  "title": "Curried Millet Cakes with Red Pepper Coriander Sauce",
  "image": "",
  "href": "https://www.forksoverknives.com/recipes/curried-millet-cakes-with-red-pepper-coriander-sauce/?utm_medium=email&utm_campaign=Fritters-Pancakes-10/28&utm_source=mailchimp&utm_term=Millet-cakes&mc_cid=ebd0720d26&mc_eid=f580cbbc08",
  "extension": "Chrome",
  "firstAdded": "2017-10-29T02:28:47.066000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350° F.",
    "Place the vegetable stock in a medium saucepan and bring to a boil over high heat. Add the millet and bring the mixture back to a boil. Reduce the heat to medium and cook, covered, for 20 minutes, or until the millet is tender.",
    "Place the onion in a large saucepan and sauté over medium heat for 7 to 8 minutes. Add water 1 to 2 tablespoons at a time to keep the onions from sticking to the pan. Add the garlic, curry powder, and crushed red pepper and cook for another minute. Add the miso, tomato puree, and nutritional yeast, if using, and mix well. Add the millet, season with salt, and mix well.",
    "Line a baking sheet with parchment paper. Using an ice cream scoop or a ¹/3-cup measure, shape the millet mixture into 12 round cakes. Place the cakes on the prepared baking sheet, and bake for 15 minutes.",
    "To serve, spoon some of the Red Pepper Coriander Sauce onto a plate and top with two of the millet cakes.",
    "Find this recipe and more in the Forks Over Knives Recipe App."
  ],
  "ingredients": [
    "0",
    "3 cups Vegetable Stock, or low-sodium vegetable broth",
    "1 cup millet",
    "1 large yellow onion, peeled and diced small",
    "4 cloves garlic, peeled and minced",
    "1 tablespoon curry powder",
    "½ teaspoon crushed red pepper",
    "2 tablespoons mellow white miso, dissolved in ¼ cup hot water",
    "2 tablespoons tomato puree",
    "¼ cup nutritional yeast, optional",
    "Salt to taste",
    "1 batch Red Pepper Coriander Sauce"
  ],
  "__v": 1
}