{
  "__v": 1,
  "directions": [
    "0",
    "Preparare la crema pasticcera alla mela sbattendo i tuorli con lo zucchero, aiutandosi con un po’ di latte. Aggiungere la farina setacciata, aiutandosi sempre con il latte ed infine aggiungere tutto il latte ed il succo di mela. Aggiungere un po’ di buccia di limone (solo la parte gialla) e cuocere la crema a fuoco lento, mescolando sempre, fino a quando si rassoda. Lasciare intiepidire la crema, versandola in un piatto e coprendola con la pellicola a contatto.",
    "Stendere la pasta frolla e ricoprire lo stampo a ciambella precedentemente imburrato. Versare la crema nella frolla e compattarla con un cucchiaio pressandola leggermente. Ricoprire la crema con la frolla in eccesso sui bordi. Coprire con molta attenzione, in modo che non ci siano buchi. Anche se “rattoppata” non ha importanza, la parte superiore andrà poi sul vassoio. Tagliare la frolla anche al centro, in modo da ottenere la ciambella e piegare la frolla per sigillare tutto.",
    "Cuocere in forno ventilato a 180° per circa 40 minuti. Lasciare raffreddare a temperatura ambiente e poi spostare in frigo. Decorare con zucchero a velo e cacao amaro se piace e servire fredda."
  ],
  "firstAdded": "2014-10-09T19:19:58.637000",
  "hash": "7f2dd504202aff6a67fddd4bef3c1c50a10f71eb",
  "href": "http://blog.cookaround.com/pastapatateefantasia/ciambella-frolla-crema-mela/",
  "image": "http://blog.cookaround.com/pastapatateefantasia/wp-content/uploads/2014/10/9-1024x884.jpg",
  "ingredients": [
    "0",
    "Ingredienti per stampo ciambella cm 22 (parte superiore)",
    "500 gr di pasta frolla",
    "350 ml di latte",
    "150 ml di succo di mela puro",
    "150 gr di zucchero",
    "3 tuorli",
    "un po’ di buccia di limone",
    "90 gr di farina"
  ],
  "keywords": [
    "ingredienti",
    "stampo",
    "ciambella",
    "parte",
    "superiore",
    "pasta",
    "frolla",
    "latte",
    "succo",
    "mela",
    "puro",
    "zucchero",
    "tuorli",
    "buccia",
    "limone",
    "farina"
  ],
  "title": "Ciambella di frolla con crema alla mela",
  "users": [
    null
  ]
}