{
  "hash": "2fa6bd9bd3c6ed347eedbdc1d430e6c539c37d47",
  "title": "Shiitake Asparagus Stir Fry With Toasted Cashews and Wasabi Avocado Cream [Vegan, Gluten-Free]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/04/stirfry-1194x800.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/shiitake-asparagus-stir-fry/",
  "extension": "Chrome",
  "firstAdded": "2015-05-08T09:25:10.038000",
  "users": [
    null
  ],
  "keywords": [
    "brown",
    "rice",
    "boiled",
    "according",
    "instructions",
    "spicy",
    "wasabi",
    "make",
    "sure",
    "glutenfree",
    "sensitivity",
    "ive",
    "come",
    "arent",
    "use",
    "skip",
    "water",
    "spicier",
    "flavor",
    "adjust",
    "accordingly",
    "fully",
    "avocado",
    "tamari",
    "gluten",
    "free",
    "soy",
    "garlic",
    "thumb",
    "sized",
    "pieces",
    "ginger",
    "agave",
    "coconut",
    "oil",
    "asparagus",
    "long",
    "shiitake",
    "cashew",
    "nuts",
    "pan",
    "bunch",
    "coriander"
  ],
  "directions": [
    "0",
    "Prepare the brown rice according to package instructions. When 15 minutes of the boiling time remains, start to wash and chop the vegetables: the asparagus, shiitake, garlic and ginger.",
    "For the wasabi avocado cream, whisk together the wasabi powder and the water and let it sit for a minute while mashing the avocado with the soy sauce, using a fork. Then add the wasabi/water mix and mash a little more until all is fully blended. Set aside.",
    "Start with the stir-fry by mixing in a cup the chopped garlic, ginger, tamari, agave and water. Heat up a frying pan to medium to high heat and melt the coconut oil. Add the shiitake and the asparagus quickly followed by the garlic/ginger/tamari/agave/water mix. Fry while frequently stirring for approximately two to three minutes. The mushrooms and the asparagus should be cooked throughout but still firm.",
    "Heat another frying pan, and add the cashew nuts. Toast them for about 30 seconds on each side, until they start to go a little brown.",
    "Serve in bowls with the rice, the stir-fry, the remains of the stir-fry sauce, and top with a little bit of the wasabi avocado cream. Garnish with the toasted cashew nuts and fresh coriander."
  ],
  "ingredients": [
    "0",
    "1 cup brown rice, boiled according to instructions",
    "1",
    "½ tsp wasabi powder, or more if you like it spicy (you can use wasabi paste too, but make sure it is gluten-free if you have a sensitivity, as many I’ve come across aren’t. If you use the paste, then skip the water).",
    "1.5 tsp water, or more if you go for more wasabi powder for spicier flavor – adjust accordingly",
    "1 fully ripe avocado",
    "½ tsp tamari, or other gluten free soy sauce",
    "2",
    "3 cloves garlic, finely chopped",
    "2 thumb sized pieces of ginger, finely chopped",
    "3 tbsp tamari, or other gluten free soy sauce",
    "2 tbsp agave",
    "⅔ cup water",
    "2 tbsp coconut oil",
    "Approximately 18 ounces asparagus, chopped into 1 inch long pieces",
    "8 ounces shiitake, halved if they are very large",
    "3",
    "1.5 cups whole cashew nuts, toasted in a pan",
    "1 small bunch fresh coriander, chopped"
  ],
  "__v": 1
}