{
  "hash": "1f445f13022e8d3475064fb0cb9e9e8f12231bc4",
  "title": "Shiitake Mushroom Tortellini w/ Soy Cream Sauce",
  "image": "http://thewoksoflife.com/wp-content/uploads/2015/02/mushroom-tortellini-11.jpg",
  "href": "http://thewoksoflife.com/2015/03/shiitake-mushroom-tortellini-w-soy-cream-sauce/",
  "extension": "Chrome",
  "firstAdded": "2016-08-01T19:47:23.859000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a skillet over medium high heat, add a few good lugs of olive oil. Add the mushrooms and season with salt. Sauté the mushrooms until tender and caramelized. This could take a while, so don’t rush the process! Once the mushrooms are caramelized, you might have some sticky bits at the bottom of the pan. Deglaze with a bit of water.",
    "Transfer the cooked mushrooms to a mixing bowl and add the scallion, crushed red pepper flake, Parmesan, ricotta cheese, egg, and salt and pepper to taste.",
    "To assemble, use a bit of water to dampen the edges of each wonton wrapper, and add a teaspoon of filling to the middle. Fold in half diagonally so you get a triangle. Make sure there aren’t any air bubbles in the middle, and that the edges are tightly sealed. Bring the two farthest corners of the triangle together to make a pseudo “tortellini” shape. Continue assembling until you’ve run out of filling.",
    "Bring a pot of water to a boil for the tortellini. In a skillet over medium heat, add a couple tablespoons of olive oil. Add the panko and stir constantly until golden. Remove from the pan and set aside.",
    "Add a couple tablespoons more oil to the skillet and add the garlic. Cook for 1 minute. Add the milk and cream, and bring to a simmer. Cook for 2 minutes and add the soy sauces. Season with pepper.",
    "By now, the water for the ravioli should be boiling. Cook the ravioli in the boiling water for 20 seconds. With a slotted spoon, transfer the ravioli to the sauce and simmer for another 60-90 seconds.",
    "Serve immediately, garnished with your panko pangrittata and more scallions."
  ],
  "ingredients": [
    "0",
    "Olive oil",
    "6 oz. fresh shiitake mushrooms, finely chopped",
    "⅓ cup minced scallion",
    "½ teaspoon crushed red pepper flake",
    "½ cup Parmesan cheese",
    "1 cup ricotta cheese",
    "1 egg",
    "salt and pepper to taste",
    "36-42 square wonton wrappers (1 pack should be enough)",
    "½ cup panko breadcrumbs",
    "3 cloves garlic, sliced",
    "⅔ cup milk",
    "½ cup heavy cream",
    "2 teaspoons soy sauce",
    "1 teaspoon dark soy sauce"
  ],
  "__v": 1
}