{
  "hash": "3969064cdd4af997f08848c1e090e1aea7304d46",
  "title": "The Best Veggie Burger IN THE ENTIRE WORLD",
  "image": "http://acozykitchen.com/wp-content/uploads/2013/08/Etsy_VeggieBurger_2.jpg",
  "href": "http://www.acozykitchen.com/the-best-veggie-burger/",
  "extension": "Chrome",
  "firstAdded": "2018-10-09T17:26:27.851000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Pulse beets in a food processor until roughly chopped. Add beets to a large bowl, along with the garbanzo beans, black beans, brown rice, oat flour, red onion, garlic, sumac, thyme leaves, ground cumin and ground coriander. Mash with two forks until all the beans are incorporated. Salt and pepper to taste. (I added about one teaspoon of kosher salt and half of a teaspoon of pepper.)",
    "Using a half cup measure, form six patties. Cover them with plastic wrap and transfer to the refrigerator to chill for 30 minutes. (Since we aren’t using egg to bind the mix, this step helps the patties hold together.)",
    "Melt butter or olive oil in a non-stick skillet. Toast the hamburger buns for 1-2 minutes. Remove and set aside. Add more butter or olive oil if needed. Add the patties and cook on both sides for 3-4 minutes and until the tops are lightly golden brown. Place the slices of cheese on top of each burger and cook for 1 minute longer, until cheese is melty.",
    "To assemble burgers, add a smear or two of Dijon mustard and mayonnaise, a sheet of butter lettuce and a slice of tomato to one half of the bun. Top with the veggie burger pattie and the other half of the bun. Repeat until all six burgers are assembled."
  ],
  "ingredients": [
    "0",
    "8 ounces beets, steamed or roasted and peeled*",
    "1 (15 ounce) can garbanzo beans, washed and drained",
    "1 (15 ounce) can black beans, washed and drained",
    "1/2 cup cooked brown rice",
    "1/4 cup rolled oat flour**",
    "1/2 red onion, diced",
    "2 garlic cloves, minced",
    "1 teaspoon sumac",
    "1 teaspoon dried thyme leaves",
    "3/4 teaspoon ground cumin",
    "1/4 teaspoon ground coriander",
    "Salt",
    "Pepper",
    "6 hamburger buns",
    "6 thin slices of Morbier cheese (or other strong cow’s milk cheese of choice)",
    "Dijon mustard (optional)",
    "Mayonnaise (optional)",
    "Butter lettuce",
    "Tomato"
  ],
  "__v": 1
}