{
  "hash": "33f71d7ef0d97591ee18a57547bc415d700bc060",
  "title": "Cheese straws - Nathan Outlaw",
  "image": "http://www.greatbritishchefs.com/recipes/../getmedia/e173bd72-04af-4924-bad3-6604ea377c87/NOL028-NEW-Website-Edited-Featured-Cheese-Straws/?width=420&height=270&ext=.jpg",
  "href": "http://www.greatbritishchefs.com/recipes/cheddar-cheese-straws-recipe",
  "extension": "Chrome",
  "firstAdded": "2015-05-22T15:50:03.947000",
  "users": [
    null
  ],
  "keywords": [
    "davidstow",
    "cheddar",
    "cheese",
    "smoked",
    "paprika",
    "freerange",
    "egg",
    "yolk"
  ],
  "directions": [
    "0",
    "To make the cheese straws, preheat the oven to 220ºC/gas mark 7. Lightly grease a large baking sheet and cover it with greaseproof paper",
    "2.",
    "Put the cheese into a mixing bowl. Sift in the flour and add a sprinkling of smoked paprika. Add some freshly ground black pepper and mix",
    "3.",
    "Cut the butter into little cubes and rub them into the flour mix with your fingertips. When the butter has almost disappeared into the flour and you have a crumbly mixture, stir in the egg yolk with a butter knife",
    "4.",
    "Gather the pastry into a ball of dough. Dust the work surface with plenty of flour. Carefully roll out the cheese dough into a rough square--it should be about 5mm thick. Neaten the edges with the side of your hand",
    "5.",
    "With a sharp knife, cut the square into strips, then each strip into fingers. Pour some poppy seeds in a shallow tray and dip one side of each strip in the seeds. Twist the straws so that the seeded side goes around the strip in a spiral pattern",
    "6.",
    "Gently lift the straws on to the lined baking sheet, leaving a little space between each one. Place the baking sheet in the oven and bake for about 8 minutes. The cheese straws should be a very pale golden brown",
    "7.",
    "They will be fragile once removed from the oven, so leave them to sit for 5 minutes before you try to move them. Carefully lift up the baking parchment and transfer everything to a wire rack to cool for a few more minutes"
  ],
  "ingredients": [
    "0",
    "Davidstow cheddar cheese",
    "smoked paprika",
    "free-range egg yolk"
  ],
  "__v": 1
}