{
  "hash": "b4f9114a6585f770c1d66e060467dd5623478963",
  "title": "Texas Chilli Con Carne",
  "image": "",
  "href": "http://www.chilli-con-carne.co.uk/chilli-con-carne/chilli-con-carne-recipes.html",
  "firstAdded": "2015-01-24T12:58:31.274000",
  "users": [
    null
  ],
  "keywords": [
    "serves",
    "gkg",
    "stewing",
    "braising",
    "steak",
    "bite",
    "size",
    "pieces",
    "chilli",
    "carne",
    "seasoning",
    "jalapeno",
    "chillies",
    "round",
    "slices",
    "pickled",
    "ancho",
    "red",
    "onion",
    "groundnut",
    "light",
    "olive",
    "oil",
    "beef",
    "stock",
    "parsley",
    "coriander",
    "leaf",
    "good",
    "quality",
    "butter"
  ],
  "directions": [
    "0",
    "Cooking method",
    "Brown the meat in small batches in a cast iron heavy pan or similar. Keep to one side",
    "Cover the base of a casserole style pan with the oil and add the onions and cook on a low heat until they go golden but not brown. This should take about 20 minutes",
    "Add the seasoning to the onions and stir in well.",
    "Add the meat, chillies, and stock.",
    "Cook on a low simmer for 2-3 hours, stirring occasionally until the meat is tender and almost melt in the mouth.",
    "If you feel the sauce needs more seasoning add a little more salt or seasoning to taste.",
    "Add the butter and melt in. This is optional but will enrich the sauce and give it a lovely sheen",
    "Finally add the fresh herbs if using and mix in well. If using parsley this can be chopped in advance as it keeps well but coriander should be chopped at the last minute as it does not keep so well. Reserve a little of the herb for garnishing on the plate",
    "Serve with simple plain rice."
  ],
  "ingredients": [
    "0",
    "Ingredients - Serves 4",
    "750g-1kg Stewing or Braising steak in bite size pieces",
    "6 Teaspoons Chilli Con Carne Seasoning",
    "2 Jalapeno Chillies cut into thin round slices. Pickled are fine",
    "2-4 Dried Ancho chillies or 8 small dried red chillies",
    "1 Large Onion finely chopped",
    "Groundnut Oil (or light olive oil)",
    "1 Pint Beef Stock",
    "8 Tbsp finely chopped parsley or coriander leaf (optional)",
    "2oz Good quality butter"
  ],
  "__v": 1
}