{
  "hash": "74a007305e075bc916a3249dc41a377d7c532765",
  "title": "Kombucha Scoby",
  "image": "",
  "href": "http://www.thekitchn.com/how-to-make-your-own-kombucha-scoby-cooking-lessons-from-the-kitchn-202596",
  "extension": "Chrome",
  "firstAdded": "2017-03-02T00:34:55.068000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the sweet tea. Bring the water to a boil. Remove the pan from heat and stir in the sugar until it is completely dissolved. Add the tea and allow to steep until the tea cools to room temperature. Remove and discard the tea. (Alternatively, boil half the amount of water, dissolve the sugar and steep the tea, then add the remaining water to cool the tea more rapidly.)",
    "Combine the sweet tea and kombucha in a jar. Pour the sweet tea into the jar. Pour the kombucha on top — if you see a blobby \"baby scoby\" in the bottom of your jar of commercial kombucha, make sure this gets transferred. (But if you don't see one, don't worry! Your scoby will still form.) Stir to combine.",
    "Cover and store for 1 to 4 weeks. Cover the mouth of the jar with a few layers of tightly-woven cloth, coffee filters, or paper towels secured with a rubber band. (If you develop problems with gnats or fruit flies, use a tightly woven cloth or paper towels, which will do a better job keeping the insects out of your brew.) Place the jar somewhere at average room temperature (70°F), out of direct sunlight, and where it won't get jostled. Sunlight can prevent the kombucha from fermenting and the scoby from forming, so wrap the jar in a cloth if you can't keep it away from sunlight.",
    "First, bubbles will gather on the surface. For the first few days, nothing will happen. Then you'll start to see groups of tiny bubbles starting to collect on the surface.",
    "Then, the bubbles will collect into a film. After a few more days, the groups of bubbles will start to connect and form a thin, transparent, jelly-like film across the surface of the tea. You'll also see bubbles forming around the edges of the film. This is carbon-dioxide from the fermenting tea and a sign that everything is healthy and happy!",
    "The film will thicken into a solid, opaque layer. Over the next few days, the layer will continue to thicken and gradually become opaque. When the scoby is about 1/4-inch thick, it's ready to be used to make kombucha tea — depending on the temperature and conditions in your kitchen, this might take anywhere from 1 to 4 weeks.",
    "The finished scoby: Your finished scoby might look a little nubbly, rough, patchy, or otherwise \"not quite like a grown-up scoby.\" It's ok! Your scoby will start to smooth out and take on a uniform color over the course of a few batches of kombucha — take a look a the before and after pictures of a baby and grown-up scoby in the gallery above.",
    "Using the liquid used to grow the scoby: The liquid used to grow the scoby will likely be too strong and vinegary to drink (and if you're not used to drinking kombucha or very vinegary beverages, it can give you a stomach ache). You can use it to start your first batch of kombucha, or you can use it as a cleaning solution on your counters.",
    "Trouble-Shooting",
    "Your scoby is forming normally and is healthy if... You see bubbles, clear jelly-like masses, opaque jelly-like masses, stringy or gritty brown bits. Also if the tea smells fresh, tart, and slightly vinegary (this aroma will become more pronounced the further into the process you go).",
    "Your finished scoby is normal and healthy if... It's about a quarter-inch thick and opaque. It's fine if the scoby is bubbled or nubbly or has a rough edge. It's also ok if it's thinner in some parts than others or if there's a hole. Your scoby will become smoother and more uniform as you brew more batches of kombucha.",
    "There is a problem if... You see fuzzy black or green mold growing on top of the forming scoby, or if your tea starts to smell cheesy, rancid, or otherwise unpleasant. In any of these cases, bad bacteria has taken hold of the tea; discard this batch and start again with a fresh batch.",
    "If you can't tell if there's a problem... Continue to let the tea ferment and the scoby form. If it's a problem, it will get worse; if it's a normal part of the process, it should normalize (or at least not get any worse!)",
    "Recipe Notes",
    "Covering for the jar: Cheesecloth is not ideal because it's easy for small insects, like fruit flies, to wiggle through the layers. Use a few layers of tightly woven cloth (like clean napkins or tea towels), coffee filters, or paper towels, to cover the jar, and secure it tightly with rubber bands or twine.",
    "Using Other Sugars: Scobys form best if you use plain, granulated table sugar. Organic sugar is fine, but avoid alternative sugars or honey.",
    "Substituting Other Teas: Plain black tea is the best and most nutritious tea for scoby growth. For this step of growing a new kombucha, use black tea if at all possible; you can play around with other teas once you start making kombucha regularly."
  ],
  "ingredients": [
    "0",
    "7 cups water",
    "1/2 cup white granulated sugar (see Recipe Notes)",
    "4 bags black tea, or 1 tablespoon looseleaf (see Recipe Note)",
    "1 cup unflavored, unpasteurized store-bought kombucha"
  ],
  "__v": 2
}