{
  "__v": 1,
  "directions": [
    "0",
    "To prepare crust, in a medium bowl, whisk together the flour, sugar, and salt. Add the butter and cut in with a pastry blender until the butter in the size of peas. Add the ice water 1 tablespoon at a time, mixing until the dough comes together. Shape the dough into a disk, wrap the disk in plastic wrap, and refrigerate for at least 30 minutes or overnight.",
    "Preheat the oven to 375°F.",
    "To prepare the preserves, combine the strawberries, sugar, and lemon juice in a small saucepan and bring to a simmer, cooking until the juices thicken to a jam-like consistency, 30 to 45 minutes. The mixture will thicken more when it cools. Transfer to a bowl and allow to cool completely.",
    "On a floured surface, roll the dough into a 1/8-inch thick circle. Cut it into a neat 9 to 10-inch circle and transfer the round of dough to a parchment-lined baking sheet. Prick the surface a few times with a fork. Cover the crust with a sheet of parchment, and top with something to weight it down and keep it flat. I used another baking sheet, you could use a tart pan filled with pie weights or whatever else you have on hand. Bake for 15 minutes, remove the top baking sheet, and return to the oven. Cook for another 5-10 minutes, or until golden. I suggest taking it pretty dark golden. Remove from the oven and allow the crust to cool completely.",
    "Mix the mascarpone and sugar together in a small bowl. Spread the mascarpone evenly over the cooled crust, going almost all of the way to the edge. Spread a thin layer of the cooled strawberry preserves (I used about 1/2-3/4 cup) over the mascarpone. You won’t use all of the jam.",
    "Arrange the sliced strawberries on top of the preserves, working in concentric circles from the outside in.",
    "Pass a generous 1/4-cup of the strawberry preserves through a fine strainer. Combine with 2 teaspoons water in a small saucepan and warm over low heat, stirring, just until smooth. Using a pastry brush, brush the glaze over the strawberries. Serve the tart at room temperature."
  ],
  "firstAdded": "2014-06-19T05:07:06.769000",
  "hash": "cf2c03910f9926b295ccaa08440a9e7808decbb3",
  "href": "http://www.lottieanddoof.com/2013/07/strawberry-mascarpone-tart/",
  "image": "http://www.lottieanddoof.com/wp-content/uploads/2013/06/IMG_97551.jpg",
  "ingredients": [
    "0",
    "Crust:",
    "1 cup all-purpose flour",
    "2 teaspoons sugar",
    "1/2 teaspoon kosher salt",
    "6 tablespoons unsalted butter, cut into 1-inch cubes",
    "2 to 4 tablespoons ice water",
    "Preserves:",
    "2 cups quartered ripe strawberries",
    "1/2 cup sugar",
    "1/4 teaspoon fresh lemon juice",
    "Finishing:",
    "1 cup mascarpone cheese",
    "1/2 cup sugar",
    "2 cups sliced strawberries"
  ],
  "keywords": [
    "crust",
    "allpurpose",
    "flour",
    "sugar",
    "kosher",
    "salt",
    "unsalted",
    "butter",
    "cubes",
    "ice",
    "water",
    "preserves",
    "strawberries",
    "lemon",
    "juice",
    "finishing",
    "mascarpone",
    "cheese"
  ],
  "title": "Strawberry Mascarpone Tart",
  "users": [
    null
  ]
}