{
  "hash": "5951a30b67bdf7ac042b6ee385eb0a35bee7324c",
  "title": "Quinoa Pizza",
  "image": "http://lh5.ggpht.com/_9-O5Qq4i6KM/Tdx0lEV8p3I/AAAAAAAAAkA/I072DGGI1PY/pizza%20lunchbox_thumb%5B8%5D.jpg?imgmax=800",
  "href": "http://www.citylifeeats.com/2011/05/25/today%e2%80%99s-lunchbox-pizza/",
  "extension": "",
  "firstAdded": "2015-11-21T02:47:02.833000",
  "users": [
    null
  ],
  "keywords": [
    "quinoa",
    "water",
    "salt",
    "divided",
    "oregano",
    "extravirgin",
    "olive",
    "oil",
    "tomato",
    "garlic",
    "tsps",
    "thyme",
    "drops",
    "plain",
    "stevia",
    "basil",
    "pureed",
    "extra",
    "virgin",
    "prepared",
    "pesto",
    "spinach",
    "toppings",
    "combination",
    "lightly",
    "steamed",
    "broccoli",
    "sauteed",
    "creminis",
    "use",
    "raw",
    "bell",
    "pepper",
    "slices",
    "daiya",
    "vegan",
    "cheese"
  ],
  "directions": [
    "0",
    "Soak quinoa in about 2 cups water, at least 8 hours. Drain and rinse.",
    "Preheat oven to 400F. Place 10-inch cast iron skillet in oven when it gets to 350F. Preheat pan for about 10 minutes as the oven temperature rises. Add extra-virgin olive oil to hot pan and preheat oil and pan (about 4 to 5 minutes).",
    "While preheating pan, place drained and rinsed quinoa in blender with 1/2 cup water, salt and oregano. Blend until the consistency of thick pancake butter. Remove cast-iron skillet from oven. Pour batter in. It should sizzle. Bake crust for 20 minutes, until dark golden. While pizza is baking, mix tomato paste, garlic, herbs, stevia and water. Flip pizza over (like a large pancake) and add toppings. I like to start with the tomato sauce, followed by the basil, then the spinach, and then the additional toppings. Return to oven for an additional 10 minutes.",
    "And there you have it, bloggy-inspired pizza without starch or eggs and delicious in general, particularly with this symphony of toppings."
  ],
  "ingredients": [
    "0",
    "1 cup quinoa",
    "2-3 cups water",
    "1/2 tsp and 1/4 tsp salt divided",
    "1 tsp oregano",
    "1 Tbsp extra-virgin olive oil",
    "7oz tomato paste",
    "1 Tbsp chopped garlic (about 2 cloves)",
    "2 tsps oregano",
    "1 tsp thyme",
    "1 Tbsp water",
    "8 drops plain stevia",
    "1-2 cups basil, pureed with 1 Tbsp extra virgin olive oil and 1/4 teaspoon salt (you can substitute prepared pesto for this)",
    "1 cup spinach",
    "1/2 cup to 1 cup vegetable toppings. I like a combination of lightly steamed broccoli, sauteed creminis (just use extra virgin olive oil and salt), and raw bell pepper slices.",
    "Daiya or other vegan cheese (optional)"
  ],
  "__v": 1
}