{
  "hash": "2132e8ebe779c745d9d8df259d54dbd382713452",
  "title": "Caramel Pecan Doberge Cake",
  "image": "",
  "href": "https://www.louisianacookin.com/caramel-pecan-doberge-cake/",
  "extension": "Chrome",
  "firstAdded": "2019-01-16T03:26:13.921000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350°. Spray 6 (8½-inch) disposable aluminum foil pans with baking spray with flour.",
    "In a large bowl, beat butter and granulated sugar with a mixer at medium speed until fluffy, 3 to 4 minutes, stopping to scrape sides of bowl. Add eggs, one at a time, beating well after each addition. In a medium bowl, whisk together flour, baking powder, and salt. Gradually add flour mixture to butter mixture alternately with milk, beginning and ending with flour mixture, beating just until combined after each addition. Beat in vanilla. Divide batter among prepared pans, (about 230 grams each).",
    "Bake, in 2 batches, until a wooden pick inserted in center comes out clean, about 10 minutes. Let cool completely in pans; remove from pans.",
    "Place 1 cake layer on a serving plate. Pipe Simple Buttercream around edge of cake. Spread Caramel Custard Filling to edge, and top with another cake layer. Repeat with remaining Simple Buttercream, Caramel Custard Filling, and cake layers. Wrap cake in plastic wrap, and refrigerate overnight.",
    "Remove plastic wrap from cake, and spread with Caramel Icing. Gently press chopped pecans halfway up sides of cake."
  ],
  "ingredients": [
    "0",
    "ngredients",
    "¾\tcup unsalted butter, softened",
    "2\tcups granulated sugar",
    "3\tlarge eggs",
    "3½\tcups cake flour*",
    "1\tteaspoon baking powder",
    "½\tteaspoon kosher salt",
    "1\tcup whole milk",
    "1\tteaspoon vanilla extract",
    "Simple Buttercream (recipe follows)",
    "Caramel Custard Filling (recipe follows)",
    "Caramel Icing (recipe follows)",
    "2\tcups chopped toasted pecans"
  ],
  "__v": 1
}