{
  "hash": "90da8a9b758e92dfcc9df892cd4be1d50b5b3162",
  "title": "Potato Leek Soup with Smoked Sausage\nby Ingrid Beer",
  "image": "http://thecozyapron.com/wp-content/uploads/2016/11/potato-leek-soup_thecozyapron_11-29-16_1.jpg",
  "href": "http://thecozyapron.com/potato-leek-soup-with-smoked-sausage/",
  "extension": "Chrome",
  "firstAdded": "2017-02-18T20:50:01.609000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place a large soup pot over medium-high to high heat, and drizzle in about 1-2 tablespoons of oil; once the oil is very hot, add in the sliced smoked sausage, and leave it undisturbed for a couple of minutes, to allow for it to caramelize and get some good color; then stir, and allow to caramelize some more for several minutes.",
    "-Once the sausage is browned, drizzle in a little more oil if the sausage is not too greasy, and add in the sliced leeks, and stir; it may seem like a lot of leeks, but they will cook way down as you allow them to also caramelize and get golden with the sausage, about 10 minutes, or so.",
    "-Once the leeks are golden-brown, add in the garlic, a pinch of salt and black pepper, and stir just until the garlic becomes aromatic; then, add in the potatoes, along with the hot chicken stock, and bring to the boil.",
    "-Reduce the heat, cover with lid just partly askew, and allow to simmer for about 20 minutes, or until your potatoes are tender.",
    "-Finish with the lemon juice and the parsley, and serve with some good bread.",
    "Pinterest4.8k",
    "Facebook0",
    "Twitter0",
    "Tumblr0",
    "Reader Interactions",
    "COMMENTS",
    "Deborah Behney says",
    "December 1, 2016 at 2:30 pm",
    "I’ve been waiting and anticipating your next email.",
    "Thank you for saying the words that I feel at times",
    "but cannot express. Can’t wait to try this wonderful",
    "soup! God Bless.",
    "REPLY",
    "The Cozy Apron says",
    "December 2, 2016 at 1:34 am",
    "Deborah, I am so touched that the post resonated with you, and I thank you so very much for such a kind compliment…I am humbled! God bless you, too, and may you be warmed and uplifted by the recipe, as well!",
    "REPLY",
    "Katherine says",
    "December 6, 2016 at 11:07 pm",
    "I made this soup last week, and it was so good! The addition of parsley and lemon juice is so creative and delicious! I accidentally doubled the broth amount and it was still good. Thank you!",
    "REPLY",
    "The Cozy Apron says",
    "December 7, 2016 at 2:21 am",
    "Hi Katherine, I’m so glad you tried and enjoyed! Thanks for sharing that with me. And hey, if you doubled the stock, at least you had more to enjoy!",
    "REPLY",
    "Ruth says",
    "December 28, 2016 at 3:56 pm",
    "You write so beautifully, Ingrid! I can’t wait to try the soup!",
    "REPLY",
    "The Cozy Apron says",
    "December 30, 2016 at 12:42 am",
    "Thank you so much for that, Ruth! Please enjoy the soup!",
    "REPLY",
    "Taryn says",
    "February 11, 2017 at 4:15 am",
    "I made this tonight. Added in some minced onion, and mixed vegetable broth and chicken stock, because that’s what I had, and it was amazing! First time I’ve ever cooked with leeks, and honestly, it was so flavorful and hearty. Cannot wait to make this again!",
    "REPLY",
    "The Cozy Apron says",
    "February 12, 2017 at 4:06 pm",
    "Hi Taryn, so glad you tried this! Happy you enjoyed it and that you found a little warmth & comfort in this simple soup.",
    "REPLY",
    "LEAVE A REPLY",
    "Your email address will not be published. Required fields are marked *",
    "Comment",
    "Name *",
    "Email *",
    "Website",
    "Primary Sidebar",
    "Search this website",
    "HELLO! AHOJ!",
    "Welcome to The Cozy Apron—so glad to have you as a guest at my table! Here's where I share my passion for food, people and life through my culinary creations and my writing; and where my husband shares his love for food photography and all things visual. MORE...",
    "Search this website",
    "NEWSLETTER",
    "MORE TO LOVE",
    "Falafel Wrap with Spicy Hummus, and Seeking out Those Flavors That Elevate and Warm Instead",
    "Steak and Ale Soup with Mushrooms, and the Process of Transformation",
    "Lemon Chicken Pesto Bowls, and an Aspiration to Build Bridges in This New Year",
    "Italian Vegetable Soup with Spicy Sausage and Gnocchi, and Finding Excitement in a Fresh, New Year",
    "Spicy Orange Chicken Wings, and the Deliciousness of Those Sweet and Spicy Moments of Life",
    "IN THE PRESS:",
    "TAGS",
    "apples asian autumn avocado bacon beef cake caramelized onions cheese chicken chocolate Christmas curry dip fried garlic Italian lemon marinara mashed potatoes meatballs mushrooms parmesan pasta potatoes quinoa rice roasted garlic salad salmon sandwich sausage soup spinach steak stew stuffing Thanksgiving tomatoes turkey vegetables vegetarian vinaigrette whipped cream white beans",
    "NEWSLETTER"
  ],
  "ingredients": [
    "0",
    "• Avocado (or olive, or canola) oil",
    "• 1 (14 ounce) package smoked Kielbasa (or smoked beef sausage), sliced into circles",
    "• 3 leeks (white and pale green part only), rinsed and sliced thinly into semi-circles",
    "• 4 cloves garlic, pressed through garlic press",
    "• Salt",
    "• Black pepper",
    "• 4 russet potatoes, peeled and diced into small, bite-size pieces",
    "• 6 cups chicken stock, hot",
    "• 1 teaspoon lemon juice",
    "• 1 tablespoon chopped parsley"
  ],
  "__v": 1
}