{
  "hash": "4f3c0b6d49d3f1779b6b6bc2eab39abc431e25c7",
  "title": "Yam Chickpea Spinach Curry",
  "image": "",
  "href": "https://www.forksoverknives.com/recipes/yam-chickpea-spinach-curry/?utm_medium=newsletter&utm_campaign=Baked-Potatoes-8/26&utm_source=mailchimp&utm_term=Yam-chickpea-curry",
  "extension": "Chrome",
  "firstAdded": "2017-08-26T23:27:41.543000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions:",
    "If using canned chickpeas, rinse before using. If you’re using dried chickpeas, soak in water the night before and pressure-cook with salt for about 10 minutes before using for the recipe.",
    "Sauté onion, garlic and ginger in vegetable broth until translucent, about 5 minutes over medium heat. Add more vegetable broth as necessary, to keep from burning.",
    "Add diced tomatoes and seasonings except for garam masala.",
    "Add chickpeas and stir to combine and cook over medium-low heat for about 15 minutes until tomatoes have broken down, the chickpeas have softened and the flavors meld, stirring occasionally. Add a little more vegetable broth or water as needed if your tomato juice is running low.",
    "In another pot, gently steam the yams just until tender so they retain their shape, about 10-15 minutes. Set aside.",
    "Add the spinach to the vegetable mixture and stir to combine. Cook for another minute or two until it’s wilted and heated through.",
    "Add yams and stir to combine. Be careful not to break the yams apart by over mixing. Add some garam masala to taste, as desired.",
    "Serve with fresh rice.",
    "Additional Tips:",
    "To make this recipe lower in sodium choose no salt added chickpeas like Eden Organics and no salt added canned tomatoes. Add salt as desired when serving."
  ],
  "ingredients": [
    "0",
    "1 15 ounce can chickpeas (unsalted), drained or 1½ cups of cooked chickpeas",
    "1 large onion, diced",
    "3 cloves of garlic, minced or pressed",
    "1 inch of ginger, minced or pressed",
    "1-2 cups low-sodium vegetable broth",
    "2 15 ounce cans of diced tomatoes (fire roasted or regular)",
    "1 teaspoon cumin, ground",
    "1 teaspoon coriander, ground",
    "1 teaspoon turmeric, ground",
    "salt to taste",
    "1 cup of yams/sweet potatoes, peeled and diced 2” thick",
    "2 cups of fresh spinach, packed or 1 cup frozen, drained",
    "¼ teaspoon garam masala (or to taste)"
  ],
  "__v": 1
}