{
  "hash": "7a2c0d92e916e4b38b8cec7d7a0f94bfda150948",
  "title": "Whole Wheat French Bread Recipe Read Reviews (12) Be the first to add a review 5 12",
  "image": "//hostedmedia.reimanpub.com/TOH/Images/Photos/37/300x300/exps3861_FB143426B05_07_3b.jpg",
  "href": "http://www.tasteofhome.com/recipes/whole-wheat-french-bread",
  "extension": "Chrome",
  "firstAdded": "2015-05-10T17:36:59.939000",
  "users": [
    null
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "stoneground",
    "wheat",
    "active",
    "dry",
    "yeast",
    "water",
    "sugar",
    "salt",
    "butter",
    "yellow",
    "cornmeal",
    "egg",
    "white"
  ],
  "directions": [
    "0",
    "Combine the flours. In a large bowl, combine 3 cups flour mixture and the yeast. Set aside. Heat water, sugar, salt and butter to 115°-120°. Add to flour and yeast. Beat with on low speed for 30 seconds; increase speed to medium and beat 3 additional minutes. Stir in enough remaining flour to make a soft dough.",
    "Turn onto a lightly floured surface; knead until smooth and elastic, about 6-8 minutes. Place dough in a greased bowl; cover and allow to rise in a warm place until doubled, about 1 hour.",
    "Punch dough down; divide in half and let rest 10 minutes. Roll each half into a 15-in. x 12-in. rectangle. Roll up jelly-roll style, starting with the long side. Pinch seal and turn ends under to form a smooth loaf. Sprinkle two baking sheets with cornmeal and place each loaf, seam side down, on a greased baking sheet. Make slashes every 2-1/2 in. in the top of each loaf. Cover and let rise until doubled, about 1 hour.",
    "Beat egg white and water; brush some over loaves. Refrigerate remaining mixture. Bake at 375° for 20 minutes. Brush again with egg white mixture and bake 15-20 minutes longer or until golden brown. Remove pans to wire racks to cool. Yield: 2 loaves."
  ],
  "ingredients": [
    "0",
    "5 to 5-1/4 cups all-purpose flour",
    "2 cups stone-ground whole wheat flour",
    "2 packages (1/4 ounce each) active dry yeast",
    "2-1/2 cups water",
    "1 tablespoon sugar",
    "1 tablespoon salt",
    "1 tablespoon butter",
    "Yellow cornmeal",
    "1 egg white, beaten",
    "1 tablespoon water"
  ],
  "__v": 1
}