{
  "hash": "6841e2f4b725665203aa3cde07fc2aa498b86de4",
  "title": "30 MINUTE LOADED QUINOA TACO SALAD",
  "image": "https://dishingouthealth.com/wp-content/uploads/2019/02/QuinoaTacoSalad4.jpg",
  "href": "https://dishingouthealth.com/30-minute-loaded-quinoa-taco-salad/?utm_source=feedburner&utm_medium=email&utm_campaign=Feed%3A+dishingouthealth%2FuCup+%28Dishing+Out+Health%29",
  "extension": "Chrome",
  "firstAdded": "2019-02-07T22:07:48.920000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Heat 1 Tbsp. of the oil in a medium saucepan over medium heat. Add onions and garlic; cook until onion is softened, about 5 minutes. Stir in adobe sauce, chili powder, and ½ tsp. of the cumin; cook 1 minute, stirring often. Add quinoa and vegetable broth; increase heat and bring mixture to a simmer. Cover, reduce heat to low, and cook until quinoa is tender and liquid has been absorbed, about 15 minutes. Transfer to a wide bowl or plate and refrigerate while you assemble remaining salad ingredients.",
    "Prepare dressing by combining remaining 2 Tbsp. olive oil, ¼ tsp. ground cumin, 1 Tbsp. of the lime juice, and salt; stir with a whisk. Place kale in a large bowl and add dressing. Use your hands to massage dressing into kale for 1 to 2 minutes until leaves starts to soften. Top kale with black beans, pico (or salsa), avocado slices, and cilantro leaves.",
    "Stir remaining 1 Tbsp. lime juice into yogurt (or sour cream). Whisk in up to 3 tsp. water to thin out to desired consistency. Top salad with cooled quinoa mixture and drizzle yogurt dressing overtop."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "3 Tbsp. extra-virgin olive oil, divided",
    "¾ cup chopped onion",
    "3 garlic cloves, minced",
    "1 Tbsp. adobo sauce (from a can of chipotle chiles)",
    "1 tsp. chili powder",
    "¾ tsp. ground cumin, divided",
    "½ cup dry quinoa, rinsed",
    "1 cup lower-sodium vegetable broth",
    "2 Tbsp. fresh lime juice, divided",
    "½ tsp. kosher salt",
    "1 bunch kale (red, green, or lacinato), stemmed and roughly chopped",
    "1 cup canned black beans, rinsed and drained",
    "½ cup store-bought pico de gallo or fresh salsa",
    "1 ripe avocado, sliced",
    "⅓ cup fresh cilantro leaves",
    "3 Tbsp. whole-milk Greek yogurt or sour cream (or non-dairy yogurt if making vegan)"
  ],
  "__v": 1
}