{
  "hash": "d2aa059d44960e216a6b194a91fdfa478f6c84ae",
  "title": "Szechuan Dry Fried Green Beans",
  "image": "https://chinasichuanfood.com/wp-content/uploads/2017/08/Dry-fried-Green-beans-with-minced-pork-10.jpg",
  "href": "https://www.chinasichuanfood.com/szechuan-green-beans/",
  "extension": "Chrome",
  "firstAdded": "2017-12-28T01:26:26.135000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Marinate minced pork with all the seasonings in a small bowl for around 15 minutes just before cooking. Prepare the green beans and drain with paper.",
    "Heat up oil in wok (or you can use a small deep pot) until you can see light smoke on the surface over high fire. Add drained green beans to fry for 3 to 5 minutes over low to medium fire. Stir the beans occasionally during the process. They will be well deep-fried when there are obviously withered. Transfer out and filter the extra oil out.",
    "Leave around 1 tablespoon of cooking oil in wok and pour out the extra. Be carefully during the process as the oil is extremely hot. Add minced pork and fry until for 1 minute until aroma and then put ginger, garlic, Szechuan pepper, ginger, Ya Cai (if you happen to have some in kitchen) and dried pepper. Fry for another 1 to 2 minute. Return green beans along with salt, sugar and light soy sauce. Fry until everything is well combined. Serve hot!"
  ],
  "ingredients": [
    "0",
    "400g fresh green beans, ends removed and cut into 8cm long sections",
    "2 cups of oil for frying",
    "2 teaspoons light soy sauce",
    "pinch of salt",
    "1 tablespoon Szechuan Ya Cai (skip it if this is unavailable)",
    "2 garlic cloves, minced",
    "½ tablespoon minced ginger",
    "6-7 Szechuan peppercorns",
    "3-5 dried chili peppers, cut into sections",
    "Minced pork and marinate",
    "⅓ cup minced pork (possibly with some fat)",
    "1 teaspoon cornstarch",
    "½ tablespoon light soy sauce",
    "pinch of salt",
    "½ tablespoon minced ginger"
  ],
  "__v": 1
}