{
  "hash": "2647c9b25eab3ff6ba8ca3dc74ceb95f86a39f8e",
  "title": "No Bake Loaded Oatmeal Cookie Energy Bites",
  "image": "https://www.cottercrunch.com/wp-content/uploads/2016/08/no-bake-oatmeal-cookie-energy-bites-blender-4-of-1-4.jpg",
  "href": "https://www.cottercrunch.com/no-bake-oatmeal-cookie-energy-bites/",
  "extension": "Chrome",
  "firstAdded": "2018-08-28T21:20:46.562000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Grind up your glazed nuts blender and transfer into a mixing bowl.",
    "Add your oats, chocolate chips, dried cranberries, cinnamon and mix together.",
    "Next add your peanut butter. Stir again.",
    "Finally, Add in your vanilla extract and honey a little bit a time. Mixing between pours. Adjust the amount of honey you use depending batter’s thickness. You might need more or less.",
    "Mix again",
    "Updated Before rolling, chill batter in fridge for 20 minutes. That way it’s easier to roll later.",
    "Roll into 1-1.5 inch balls and place on cookie tray or plastic ware with parchment paper underneath.",
    "Let them freeze for 20-30 minutes then transfer into a Ziploc bag.",
    "Dust with additional cinnamon if desired.",
    "keep in fridge or freezer for up to 6 weeks.",
    "See notes for other techniques and how to make vegan.",
    "NOTES",
    "We used enjoy life mini chocolate chips which stir well."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "2 to 2 1/3 cup oats (gluten free, we used Bob’s Red Mill)- If you use quick oats you will need more",
    "1/3 crushed honey roasted nuts or maple glazed pecans if vegan (1/2 c whole)",
    "1/3 to 1/2 cup honey or maple syrup (see notes)",
    "1/3 c dark chocolate chips (enjoy life mini chocolate chips work great for vegan/dairy free!)",
    "1/2 c dried cranberries",
    "1/2 -2/3 cup naturally no stir peanut butter (adjust depending on the brand of peanut butter you use)",
    "1 tsp vanilla extract",
    "1 tsp cinnamon",
    "optional 2 tsp coconut flour or GF flour if you want to adjust the batter’s thicknes"
  ],
  "__v": 1
}