{
  "hash": "a6db7ad0b937b3f7ce1196fcc2a4cd93df262466",
  "title": "Low Carb Portabella Sliders - Keto, Gluten-Free",
  "image": "https://static1.squarespace.com/static/54a37ccee4b09569a12e5e23/t/556b52d2e4b0518b1fa2b11f/1433096920242/low+carb+portabella+sliders?format=750w",
  "href": "http://www.modernlowcarb.com/recipes/2015/5/31/low-carb-portabella-sliders-keto-gluten-free",
  "extension": "Chrome",
  "firstAdded": "2018-04-15T14:57:32.614000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Remove stems from portabella mushroom caps and wipe with a damp paper towel to remove any dirt or debris. In a small saucepan, heat 1 tbsp olive oil over medium heat. Add mushroom caps and cook for 2 minutes on each side, allowing mushrooms to cook through but retain firmness.",
    "-Remove mushrooms from pan and place on paper towels to allow liquid to drain off.",
    "-Divide the ground beef into 12 portions, rolling each into a small disc shape. Add salt and pepper to taste. In a large grill pan, heat remaining tbsp olive oil over medium heat. Once the pan is hot, add the meat and allow to cook for 3 minutes on one side. Flip and allow to cook for 3 minutes on the other side. Cook to desired level of doneness (I like burgers cooked to medium).",
    "-Stack a mushroom, burger, cheese, onion, pickles and your choice of condiments. Top with second mushroom cap and add a basil leaf for garnish. Use a toothpick to hold. Serve and enjoy!",
    "Nutritional Information (per slider): 267 calories, 20.1 grams fat, 1.3 grams carbohydrate, .3 grams dietary fiber, 1 net carb, 10.4 grams protein.",
    "Click here for printable recipe."
  ],
  "ingredients": [
    "0",
    "1 pound grass fed beef (I like 80/20 for burgers)",
    "24 baby portabella mushrooms",
    "4 slices sharp cheddar, sliced into quarters",
    "4 tbsp chopped yellow onion",
    "2 dill pickles, sliced",
    "2 tbsp extra virgin olive oil",
    "12 basil leaves",
    "yellow mustard, mayo, sriracha or low carb ketchup (optional)",
    "salt and pepper to taste"
  ],
  "__v": 1
}