{
  "hash": "766dde88030be5bbba0728636cfeb2176f03eab1",
  "title": "SWEET POTATO GRAIN BOWLS WITH GREEN TAHINI SAUCE",
  "image": "https://www.budgetbytes.com/wp-content/uploads/2017/05/Sweet-Potato-Grain-Bowls-with-Green-Tahini-Sauce-V1.jpg",
  "href": "https://www.budgetbytes.com/2017/05/sweet-potato-grain-bowls-green-tahini-sauce/",
  "extension": "",
  "firstAdded": "2018-05-02T12:31:41.134000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Add the uncooked bulgur to a sauce pot and place it over medium heat. Cook and stir the dry bulgur over medium heat for 2-3 minutes, or until it smells toasty or nutty, then remove it from the heat. Add two cups of water, stir to combine, place a lid on top, then bring it to a boil over high heat. Once it reaches a boil, turn the heat down to low and let it simmer for about 12 minutes with the lid in place. Turn the heat off and let the bulgur rest for 5 minutes.",
    "Remove the lid from the pot and fluff the bulgur with a fork. Allow the bulgur to cool (I like to place it in the refrigerator without a lid to cool quickly and dry slightly).",
    "While the bulgur is simmering, preheat the oven to 400ºF. Peel and dice the sweet potatoes into 3/4-inch cubes. Place the cubed sweet potatoes on a large baking sheet and drizzle with olive oil. Add a pinch of salt and pepper, then toss the cubes until they are coated with oil. Roast the sweet potatoes in the preheated oven for 20 minutes, give them a stir, then roast for an additional 10 minutes or until they are soft and slightly browned on the edges.",
    "While the sweet potatoes are roasting, prepare the green tahini sauce. Place all the ingredients in a blender or food processor, and blend until the herbs are in very small pieces and the sauce becomes a light green color. Taste and adjust the salt if needed.",
    "Slice the avocado and jalapeño. Rinse and drain the black beans.",
    "To assemble the bowls, place 3/4-1 cup cooked and cooled bulgur in each bowl. Divide the sweet potatoes, black beans, avocado, and jalapeño even among the bowls. Sprinkle about 1 Tbsp pepitas over each bowl, then drizzle the green tahini sauce over everything. Be generous with the green tahini sauce as it is responsible for much of the flavor in this dish. If meal prepping, keep the green tahini sauce separate until just before serving."
  ],
  "ingredients": [
    "0",
    "1 cup uncooked bulgur* $0.93",
    "2 lbs sweet potatoes $1.97",
    "2 Tbsp olive oil $0.26",
    "Pinch of salt and pepper $0.05",
    "15oz can black beans $0.79",
    "1 avocado $1.50",
    "1 jalapeño $0.12",
    "1/4 cup pepitas $0.60"
  ],
  "__v": 1
}