{
  "hash": "dfdaf8679132f02cda9c482970ea07acdf9725dd",
  "title": "Molten Chocolate Soufflé",
  "image": "https://d3awvtnmmsvyot.cloudfront.net/api/file/mnosQud8QIIzX6k9jrEQ/convert?fit=max&w=600&quality=90&cache=true&rotate=exif",
  "href": "http://www.chefsteps.com/activities/molten-chocolate-souffle",
  "firstAdded": "2015-02-12T23:48:28.024000",
  "users": [
    null
  ],
  "keywords": [
    "milk",
    "bread",
    "flour",
    "butter",
    "sugar",
    "granulated",
    "egg",
    "yolk",
    "white",
    "eggs",
    "dark",
    "chocolate",
    "salt"
  ],
  "directions": [
    "0",
    "1",
    "Preheat oven",
    "Heat oven to 375 °F / 191 °C.",
    "MAKE IN ADVANCE: If preparing the soufflé base in advance to serve later, skip Steps 1 and 2, proceed through Step 8, and then reserve the base in the refrigerator. When you're ready to bake and serve immediately, start with Steps 1 and 2, and then proceed from Step 9 using the reserved base.",
    "2",
    "Prepare ramekins",
    "a/n",
    "Butter",
    "a/n",
    "Sugar, granulated",
    "Butter each ramekin thoroughly, being careful not to miss any spots. (Unbuttered spots will cause your soufflé to stick.)",
    "Add a small amount of sugar to one of the ramekins. On its side over another ramekin, rotate to allow the sugar to adhere to all the buttered surfaces. Catch excess sugar with the other ramekin. Repeat until all your molds are coated evenly with sugar. Reserve the excess sugar and use in Step 4.",
    "Baker's Tip",
    "If possible, use ramekins that have a smooth, straight interior. This facilitates a more stable rise for your soufflés.",
    "3",
    "Combine flour, butter, and salt",
    "34 g",
    "Bread flour",
    "34 g",
    "Butter",
    "7 g",
    "Salt",
    "Combine ingredients with your hands until they form together, leaving no dry flour.",
    "Tip: The salt levels in this soufflé were pushed to the limits, bringing out the richness as well as the flavors in the chocolate. If you are one who tends to shy away from salty caramels or other salty sweets we recommend reducing the salt level down to 3 g.",
    "2",
    "4",
    "Heat milk and sugar",
    "188 g",
    "Milk",
    "75 g",
    "Sugar",
    "In a small pot, combine ingredients and bring to a boil on medium heat.",
    "5",
    "Add flour mixture to pot",
    "Add the flour and butter mixture to the hot milk and whisk until dissolved.",
    "Cook for 4 minutes on low heat until the mixture has a thick, gummy texture.",
    "6",
    "Add chocolate",
    "135 g",
    "Dark chocolate 70%",
    "Add chocolate and stir until melted and well-incorporated.",
    "7",
    "Add egg yolk",
    "68 g",
    "Egg yolk",
    "Add egg yolk to chocolate base and whisk until well-incorporated.",
    "8",
    "Reserve if desired",
    "At this point, the base for the soufflé is done. It will hold in the refrigerator for up to a week. When you're ready to bake and serve them immediately, proceed to Step 9.",
    "9",
    "Whip egg whites",
    "112 g",
    "Egg white",
    "23 g",
    "Sugar, granulated",
    "Using a whisk, whip egg whites into a light foam.",
    "Add sugar and continue to whisk until stiff, glossy peaks form.",
    "10",
    "Fold meringue into soufflé base",
    "Gently fold meringue into soufflé base in three stages.",
    "11",
    "Fill ramekins",
    "Fill soufflé molds to the very top. Use the back of a knife to remove excess batter from the rim, creating a level surface. Use a dry paper towel to wipe any excess batter off the side.",
    "12",
    "Bake",
    "Place the ramekins on a baking sheet, and bake for 17 minutes.",
    "NOTE: Baking for 17 minutes will yield a soufflé with a custardy texture and a molten center. Increase time to 18–19 minutes for a fully-set soufflé with a springy texture.",
    "13",
    "Garnish",
    "a/n",
    "Powdered sugar",
    "Using a small sieve, dust powdered sugar over the top and serve immediately. (Finished soufflés will quickly crack and deflate if not served immediately.)",
    "Serve as is, or split open and fill with crème anglaise."
  ],
  "ingredients": [
    "0",
    "88 g",
    "Whole milk",
    "34 g",
    "Bread flour",
    "34 g",
    "Butter",
    "98 g",
    "Sugar, granulated",
    "68 g",
    "Egg yolk, about 3",
    "112 g",
    "Egg white, from about 5 eggs",
    "135 g",
    "Dark chocolate 70%",
    "7 g",
    "Salt"
  ],
  "__v": 1
}