{
  "hash": "101ca44278a034082d0b376f48c8964a0680c786",
  "title": "Vegan Green Chile and Cheddar Stuffed Burgers These burgers are out of this world good! No one will miss the meat, I promise. If you need to make them gluten-free, make sure to use gluten-free buns and check to check that your canned chipotles don’t contain wheat flour (some do).",
  "image": "",
  "href": "http://katu.com/amnw/am-northwest-cooking-recipes/chili-cheese-stuffed-meatless-burgers",
  "extension": "Chrome",
  "firstAdded": "2018-06-22T03:00:58.415000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Chipotle Sauce: In a blender jar, combine the mayo, chipotle peppers, nutritional yeast flakes, smoked paprika, garlic and a couple pinches of salt. Blend until smooth and creamy. Set aside.",
    "In a small bowl, mix together 1/4 cup of diced chilies, 1/4 cup shredded cheddar and a little sliced jalapeno if using.",
    "Burgers: Divide each burger in half and pat into a flat round. Place 1 tablespoon of chili cheese mixture in center and top with the other flattened burger half. Gently pinch edges together and shape back into a patty. Repeat with remaining burgers.",
    "Cook burgers on a hot barbecue or preheated, lightly greased cast iron skillet (over medium high heat. You’ll want to cook the burgers for 3 minutes per side. Place each burger on a bottom bun and top with a roasted chile, chipotle sauce, a slice of tomato, red onion, and the top half of the bun. Repeat with remaining burgers and serve right away."
  ],
  "ingredients": [
    "0",
    "Chipotle Sauce:",
    "8 ounces vegan mayo",
    "3 canned chipotle peppers in adobo sauce",
    "2 tablespoons nutritional yeast flakes",
    "1 1/2 tablespoons smoked paprika",
    "3-4 cloves garlic",
    "A couple pinches sea salt, or to taste",
    "Burgers:",
    "2 packages Beyond Meat Beyond Burgers",
    "1 7-ounce can roasted whole green chilies, drained*",
    "1 4-ounce can diced roasted whole green chilies*",
    "1 package shredded vegan cheddar",
    "1/2 jalapeno, seeds removed and thinly sliced, optional",
    "4 hamburger buns (gluten-free if necessary)"
  ],
  "__v": 1
}