{
  "hash": "d5b809adb033fe2d7f3a56f1235f9c6514c761ef",
  "title": "Butternut Squash with Walnuts and Vanilla",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2010/10/butternut-squash-walnuts-vanilla-horiz-a-1800.jpg",
  "href": "https://www.simplyrecipes.com/recipes/butternut_squash_with_walnuts_and_vanilla/",
  "extension": "",
  "firstAdded": "2018-01-28T01:15:26.589000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Roast or boil the cubed squash:",
    "If roasting: Preheat oven to 400°F. Coat the cubed squash with a little vegetable oil and spread out onto a baking tray. Sprinkle with salt and roast until the cubes begin to brown, about 20 minutes. Remove from oven.",
    "If boiling: Put 4 cups of water into a medium-sized pot and add the bay leaves. Bring to a simmer. Add the squash to the pot. Boil, covered for 10 minutes. Drain.",
    "2 Toast the walnuts: Heat a large sauté pan over medium-high heat and toast the walnuts. Stir frequently or they will burn. Once they they start to brown, and you can smell the aroma of toasted walnuts, remove from heat.",
    "3 Add butter, squash: Melt the butter in the pan with the walnuts over medium-high heat. Toss the walnuts to coat with butter, then add the squash. Toss them to coat with butter.",
    "4 Add the grated ginger, vanilla extract, black pepper, a little salt and dried thyme and toss once more. Turn off the heat and squeeze some lemon juice over everything. Taste for salt and lemon and add more to taste.",
    "If you want this to be a bit more luxurious, mix in another tablespoon of butter or two before serving."
  ],
  "ingredients": [
    "0",
    "1 butternut squash, about 2 pounds, peeled, seeds removed, flesh cut into 1-inch cubes (see how to cut and peel a butternut squash)",
    "3 bay leaves (if boiling the squash)",
    "1 Tbsp vegetable oil (if roasting the squash)",
    "Salt",
    "1 heaping cup of walnuts (can substitute pecans or pine nuts)",
    "2-3 Tbsp butter",
    "2 teaspoons grated ginger",
    "1-2 teaspoons vanilla extract",
    "Lemon juice",
    "1/2 teaspoon dried thyme",
    "Black pepper to taste"
  ],
  "__v": 1
}