{
  "hash": "ac6bc740e0245f2299eb285ebc0a03c96d36cb63",
  "title": "Paleo Almond Joy (Vegan, Gluten Free, Dairy Free)",
  "image": "https://beamingbaker.com/wp-content/uploads/2016/09/Paleo-Almond-Joy-Vegan-Gluten-Free-Dairy-Free-1.5.jpg",
  "href": "https://beamingbaker.com/paleo-almond-joy-vegan-gluten-free-dairy-free/?utm_campaign=shareaholic&utm_medium=twitter&utm_source=socialnetwork",
  "extension": "Chrome",
  "firstAdded": "2017-10-11T15:55:16.457000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Line an 8.5x4.5 inch or 9x5 inch loaf pan with parchment paper or wax paper. Set aside for later.",
    "Make the coconut bars: Add all Coconut Bars ingredients to a blender or food processor: coconut, coconut oil and maple syrup. Blend until you get a wet and sticky mixture, with smaller, but still noticeable coconut pieces.",
    "Pour coconut mixture into the prepared loaf pan. Using a rubber spatula, press down and smooth until you get a tightly packed, even layer. Freeze for 15-20 minutes.",
    "Remove from freezer. Lift the coconut bars out of the loaf pan. Cut into 16 rectangular bars. Line a baking sheet with wax paper or parchment. Lay these bars on the sheet, evenly spaced apart. Place back into the freezer while you prepare the chocolate layer.",
    "Make the Chocolate Dip Layer: Use the double boiler method, or the following. In a medium, microwave safe bowl, add the Chocolate Dip Layer ingredients: ½ cup vegan chocolate chips and 1 teaspoon coconut oil. Heat in 20-second increments until just slightly softened and melted. Stir until smooth.",
    "Remove coconut bars from the freezer. Dip the bottom of one coconut bar into the bowl of melted chocolate, creating a thin coating. Use the side of the bowl to scrape off excess chocolate. Place back onto the baking sheet. Repeat until all coconut bars have been coated.",
    "Dip one side of an almond in the melted chocolate and press into half the surface of one bar, leaving room for another almond. Dip another almond in chocolate and press into the remaining surface of the bar. Repeat for all bars. Place baking sheet back into the freezer while you make the chocolate drizzle.",
    "Make the chocolate drizzle: Add the Chocolate Drizzle ingredients to the bowl of leftover melted chocolate: 2 tablespoons chocolate chips and ¼ teaspoon coconut oil. Heat in the microwave in 20-second increments until just softened. Stir until smooth.",
    "Using a rubber spatula, scrape melted chocolate into a plastic zip bag with a very small tip cut off, or a small piping bag fitted with a very fine tip. Holding the bag over one candy bar, pipe the chocolate in a zigzag motion, starting from one end of the bar and finishing at the other. Repeat for all bars.",
    "Place baking sheet into the freezer for 10-15 minutes. Thaw for 10-15 minutes before serving. Enjoy! Storing instructions below."
  ],
  "ingredients": [
    "0",
    "1 ½ cups unsweetened coconut, shreds or flakes",
    "¼ cup coconut oil, solid or melted",
    "2 tablespoons pure maple syrup",
    "1",
    "½ cup vegan chocolate chips",
    "1 teaspoon coconut oil",
    "2",
    "32 unsalted almonds",
    "3",
    "2 tablespoons vegan chocolate chips",
    "¼ teaspoon coconut oil"
  ],
  "__v": 1
}