{
  "hash": "7dbb10467af602560ee942b0041edcdb4d4c1a54",
  "title": "Dollywood’s Cinnamon Bread",
  "image": "",
  "href": "https://www.travelandleisure.com/food-drink/official-dollywood-cinnamon-bread-recipe",
  "extension": "Chrome",
  "firstAdded": "2020-05-16T14:22:35.688000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the dough: Combine the warm water, yeast, and a pinch of granulated sugar in a small bowl and let sit until foamy, five to eight minutes. Meanwhile, whisk the bread flour, remaining one tablespoon of granulated sugar, and salt in a stand mixer.",
    "Add the yeast mixture and melted butter to the flour mixture. Knead with the dough hook on medium speed until it is smooth and elastic, about eight minutes. Transfer to a bowl coated with cooking spray. Cover tightly with plastic wrap and let rise in a warm place until doubled in size, about one and a half hours.",
    "Lightly spray a baking sheet with cooking spray. Punch down the dough and transfer to a work surface; knead a few times. Cut in half and gently shape into two three-by-six-inch loaves (do not overwork the dough). Place the loaves three inches apart on the prepared pan. Lightly spray the loaves with cooking spray and cover with plastic wrap. Let rise in a warm place until puffy, 30 minutes to one hour.",
    "Make the topping: Whisk the granulated sugar, brown sugar, and cinnamon in a small baking dish. Whisk the melted butter and corn syrup in another small baking dish.",
    "Preheat the oven to 350 degrees. Line two nine-by-five-inch loaf pans with parchment paper, leaving a two-inch overhang on all sides. Cut four deep slashes across the top of each loaf (the loaves will look deflated). Dip each loaf in the butter-corn syrup mixture, turning to cover, then coat with the cinnamon sugar, making sure to get the sugar in the crevices. Place the loaves in the prepared pans. Drizzle with any remaining butter mixture and sprinkle with any remaining cinnamon sugar. Bake until light brown, 25 to 30 minutes. Lift the bread out of the loaf pans using the parchment overhang and transfer to a rack. Let cool in the paper, about 15 minutes.",
    "Meanwhile, make the glaze: Whisk the confectioners' sugar, salt, melted butter, and three tablespoons of milk in a bowl until smooth. Whisk in up to two more tablespoons of milk as needed to loosen. Drizzle on the warm loaves or serve on the side for dipping."
  ],
  "ingredients": [
    "0",
    "For the Dough:",
    "1/2 cup warm water (100 to 110 degrees Fahrenheit)",
    "3/4 tsp. active dry yeast",
    "1 tbsp. plus a pinch of granulated sugar",
    "1 1/2 cups bread flour",
    "1/2 tsp. salt",
    "2 tbsps. unsalted butter, melted and cooled",
    "Cooking spray",
    "For the Topping:",
    "1/4 cup granulated sugar",
    "1/4 cup packed light brown sugar",
    "1 tbsp. ground cinnamon",
    "6 tbsps. unsalted butter, melted",
    "2 tbsps. light corn syrup",
    "For the Glaze:",
    "1 1/4 cups confectioners' sugar",
    "Pinch of salt",
    "2 tbsps. unsalted butter, melted",
    "3 to 5 tbsps. milk"
  ],
  "__v": 1
}