{
  "hash": "b14738be85a2c1fe5dfcf86051be8c38231049be",
  "title": "Flank Steak Stir Fry with Asparagus and Red Pepper",
  "image": "http://assets.simplyrecipes.com/wp-content/uploads/2009/05/06164036/flank-steak-stir-fry-asparagus-red-pepper-vertical-a-1800.jpg",
  "href": "http://www.simplyrecipes.com/recipes/flank_steak_stir_fry_with_asparagus_and_red_pepper/",
  "extension": "Chrome",
  "firstAdded": "2017-04-21T23:47:50.845000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Blanch the asparagus: Fill a medium sized saucepan halfway with water and bring to a boil. Blanch the cut asparagus for 2 minutes. Drain, rinse with cold water to stop the cooking, and set aside.",
    "2 Assemble stir fry sauce: In a small dish, stir together the stir fry sauce ingredients—soy sauce, chopped ginger, minced garlic, chopped green onion, chili oil—and set aside.",
    "3 Stir fry asparagus: Heat 1 tablespoon of oil in a wok (or a thick-bottomed pot that can handle high heat) on high heat until shimmery. Add the asparagus and fry, stirring constantly, for 2 minutes or until lightly browned. Remove the asparagus from the pan and set aside.",
    "4 Stir fry beef strips: Heat another tablespoon of oil in the pan on high heat until shimmery. Stir fry the beef strips in batches, for 2 to 3 minutes per batch, until they are browned but still a little pink inside.",
    "5 Stir fry bell pepper: Return the first batches of beef strips to the pan along with the bell pepper strips. Stir and toss over high heat until the bell pepper strips are just beginning to wilt, 1-2 minutes.",
    "6 Add cornstarch slurry and stir fry sauce: Quickly stir the cornstarch liquid and add it to the pan along with the stir fry sauce. Cook until sauce thickens, 1-2 minutes.",
    "Return the asparagus to the pan, toss to evenly coat and serve with steamed white rice (unless you are going low-carb, in which case, leave out the rice)."
  ],
  "ingredients": [
    "0",
    "3 Tbsp canola or other high smoke-point cooking oil",
    "1/2 lb asparagus, trimmed, cut on the diagonal into 1 1/2 inch lengths (about 1 1/2 cups)",
    "1 lb of flank steak, sliced in half lengthwise (along the grain) and then cut into thin strips (across the grain), 2 inches long and 1/4 inch wide (put the steak in the freezer for 15 minutes before slicing to make it easier to slice)",
    "1 red bell pepper, seeded, de-ribbed, and cut into thin strips 2 inches long and 1/4 inch wide",
    "2 teaspoons of cornstarch dissolved into 3 Tablespoons of water",
    "3 Tbsp soy sauce (use gluten-free soy sauce for gluten-free version)",
    "1 teaspoon finely chopped, peeled, fresh ginger",
    "1 small clove garlic, minced",
    "1 green onion, including green tops, chopped",
    "1/2 teaspoon chili oil"
  ],
  "__v": 1
}