{
  "hash": "91cf3b07e0ef2a840b527d156c80c20a5f155678",
  "title": "Domácí majonéza",
  "image": "",
  "href": "http://www.menudomu.cz/domaci-majoneza/",
  "extension": "Chrome",
  "firstAdded": "2015-12-08T09:21:03.163000",
  "users": [
    null
  ],
  "keywords": [
    "ingredience",
    "porce",
    "majonzy",
    "loutek",
    "asi",
    "dkg",
    "oleje",
    "citronu",
    "nebo",
    "polvkov",
    "lce",
    "octa"
  ],
  "directions": [
    "0",
    "Postup přípravy:",
    "Nejdůležitější složkou majonézy je olej, na němž zejména závisí jakost majonézy. K přípravě používáme pro jen kvalitního oleje.",
    "Další důležitou součástí jsou žloutky, kterých používáme nejlépe čerstvých. Upřednostňujete-li pikantní majonézu,",
    "skvělým kořením je worcesterová omáčka.",
    "Do čisté vytřené porcelánové mísy s kulatým dnem vložíme žloutky dokonale zbavené bílků. Žloutky trochu posolíme a rozetřeme drátěnou metlou. Ze začátku stále jen optarně přikapáváme olej. Když nám hmota začíná houstnout přiléváme olej v tenkrém praménku za stálého tření metlou tak dlouho, až směs zhoustne, to jest až se hustá hmota zachytí kolem metly a utvoží se jakýsi knedlík. Tuto hmotu rozředíme citronovou šťávou nebo octem a opět za stálého míchání přiléváme tenkým praménkem olej tak dlouho, až nám hmota podruhé tak zhoustne, že zůstane nabalená na metle.",
    "Tuto metodu jsem využila také ve VIDEOreceptu k dochucení vařeného humra.",
    "V daném případě jsem přidala do tohoto množství jeden prolisovaný stroužek česneku, který se ke korýšům hodí.",
    "Všechny recepty se shodují na tom, že přísady mají mít pokojovou teplotu, jinak hrozí, že se majonéza srazí. Olej se doporučuje podzemnicový nebo slunečnicový pro jemnější majonézu, kterou si každý dochutí čím hrdlo ráčí anebo panenský olivový pro majonézu více aromatickou, která například do bramborového salátu nebude tím pravým, případně na doporučení Apetitonline.cz kombinace těchto olejů. Kromě ručního šlehání metlou v oválné míse je třeba podle Cuketky možná i varianta mnohem rychlejší a příjemnější, a to našlehání pomocí tyčového mixéru v odměrném válci nebo jiné úzké nádobě pasující přesně k mixéru, do které je možné všechny ingredience vložit hned na začátku nebo podle Vařeni.cz postupně přilévat olej do houstnoucích žloutků jako při ručním šlehání. Dochutit můžete nejen česnekem ale i dijonskou hořčicí nebo bylinkami."
  ],
  "ingredients": [
    "0",
    "Ingredience na 2 porce majonézy:",
    "1 žloutek",
    "sůl",
    "asi 15 dkg oleje",
    "šťáva ze 1/4 citronu nebo1 polévková lžíce octa"
  ],
  "__v": 1
}