{
  "hash": "7fa2e6852966002fc32c69886b7dd36796cc4475",
  "title": "Decadent Cheesecake Pops or Balls",
  "image": "http://img.sndimg.com/food/image/upload/w_614,h_461,c_fit/v1/img/recipes/37/76/57/picj5fyq2.jpg",
  "href": "http://www.food.com/recipe/decadent-cheesecake-pops-or-balls-377657",
  "extension": "Chrome",
  "firstAdded": "2015-07-01T15:32:23.459000",
  "users": [
    null
  ],
  "keywords": [
    "cream",
    "cheese",
    "sugar",
    "sour",
    "vanilla",
    "eggs",
    "graham",
    "cracker",
    "crumbs",
    "chips",
    "white",
    "chocolate",
    "shortening",
    "candy",
    "sprinkles",
    "nuts",
    "coconut",
    "lollipop"
  ],
  "directions": [
    "0",
    "Line A 9 inch springform or metal pan with parchment paper and coat the paper and sides of the pan with spray.",
    "Beat cream cheese and sugar until smooth. Beat in sour crean and vanilla until blended.",
    "Add eggs and beat on low speed just until combined. Pour into prepared pan.",
    "Place pan on baking sheet and bake at 350 for 45-50 minutes until center is almost set. Cool on a wire rack for 10 minute then carefully run a knife around edge of pan to loosen. Cool for 1 more hour, cover and freeze overnight.",
    "Remove from freezer and let stand for 30 minute then place cracker crumbs in a shallow bowl. Working quickly, scoop out 1-in. balls of cheesecake, roll each ball in the crumbs and insert a stick, place on waxed paper in the freezer for 1 hour.",
    "In a microwave, melt vanilla chips and shortening at 70% power, stir until smooth( I do this first 30 seconds, stir, then if not done 10 seconds and stir again until melted, you don't want to over-melt!), place toppings in bowls. Dip balls in melted chips then roll in topping of choice. Let cool and store in the refridgerater.",
    "Enjoy!"
  ],
  "ingredients": [
    "0",
    "3 (8 ounce) packages cream cheese",
    "1 cup sugar",
    "1 cup sour cream",
    "1 teaspoon vanilla extract",
    "3 eggs, beaten",
    "1 cup graham cracker crumbs",
    "3 (12 ounce) packages vanilla chips (white chocolate, etc)",
    "3 tablespoons shortening",
    "assorted candy sprinkles, nuts, grated chocolate, coconut, etc",
    "45 lollipop sticks"
  ],
  "__v": 1
}