{
  "__v": 1,
  "directions": [
    "0",
    "In a large bowl, combine water, yeast, honey and olive oil. Mix with a spoon, then let sit until foamy, about 10 minutes. Add in 2 1/2 cups flour and salt, stirring with a spoon until the dough comes together but is still sticky. Using your hands, form the dough into a ball and work in the additional 1/2 cup flour, kneading it on a floured surface for a few minutes. Rub the same bowl with olive oil then place the dough inside, turning to coat. Cover with a towel and place in a warm place to rise for about 1-1 1/2 hours.",
    "After the dough has risen, punch it down and place it back on the floured surface. Using a rolling pin or your hands, form it into your desired shape (sometimes I use baking sheets and do rectangles or free form pizzas - this specific dough will yield one pizza large enough to feed about 3-4 people) and place on a baking sheet or pizza peel. Place the towel back over the dough and let sit in the warm place for 10 minutes.",
    "Preheat oven to 425 degrees. (If I use my pizza stone, I heat my oven to 475 degrees and bake for 15 minutes. If you're just using a baking sheet, follow the directions below for baking and set to 425 degrees.)",
    "pizza",
    "Slice the zucchini into 1/4-inch rounds. Heat a large skillet over medium-low heat and add olive oil. Add the zucchini and garlic to the skillet and toss well to coat. Season with the salt and pepper and stirring occasionally, cook for 5 to 6 minutes until the vegetables soften.",
    "Brush the pizza dough with the olive oil. Take the corn kernels and sliced zucchini and place it all over the dough, layering it up however you want. Place the sliced mozzarella on top. Add a few basil leaves if you want, but I like to save them for when the pizza comes out. Bake the pizza for 20 to 25 minutes - or however long it takes until the cheese is golden and bubbly. Remove from the oven and cover with a sprinkling of basil leaves. Drizzle with a generous glug of balsamic glaze. Eat!"
  ],
  "firstAdded": "2014-08-04T22:02:10.097000",
  "hash": "4e08a072b841c125772762d431309bfb2ee31cad",
  "href": "http://www.howsweeteats.com/2014/07/sweet-corn-zucchini-and-fresh-mozzarella-pizza/",
  "image": "http://www.howsweeteats.com/wp-content/uploads/2014/07/zucchini-corn-pizza-I-howsweeteats.com-2.jpg",
  "ingredients": [
    "0",
    "dough",
    "1 1/8 cups warm water",
    "3 teaspoons active dry yeast",
    "1 tablespoon honey",
    "1 tablespoon olive oil",
    "3 cups all-purpose flour",
    "1 teaspoon salt",
    "pizza",
    "1 large zucchini",
    "1 tablespoon olive oil",
    "3 garlic cloves, minced",
    "1/4 teaspoon salt",
    "1/4 teaspoon pepper",
    "2 ears sweet corn on the cob, kernels removed",
    "8 ounces fresh mozzarella, sliced",
    "a bunch of fresh basil leaves",
    "balsamic glaze for drizzling"
  ],
  "keywords": [
    "dough",
    "water",
    "active",
    "dry",
    "yeast",
    "honey",
    "olive",
    "oil",
    "allpurpose",
    "flour",
    "salt",
    "pizza",
    "zucchini",
    "garlic",
    "pepper",
    "ears",
    "corn",
    "cob",
    "kernels",
    "mozzarella",
    "bunch",
    "basil",
    "leaves",
    "balsamic",
    "glaze",
    "drizzling"
  ],
  "title": "Sweet Corn, Zucchini and Fresh Mozzarella Pizza",
  "users": [
    null
  ]
}