{
  "hash": "ba54c9fa0f128e760cb084fe18a369fe2688682f",
  "title": "Tiramisu",
  "image": "http://img.sndimg.com/food/image/upload/w_158,h_118/v1/img/recipes/23/18/55/picHbZfew.jpg",
  "href": "http://www.food.com/recipeprint.do?rid=231855",
  "extension": "",
  "firstAdded": "2016-09-15T21:55:50.958000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "Chill a medium mixing bowl and beaters.",
    "prepare Hot milk cake (recipe below) gease and flour the pan cool for 10 minutes in pan then on a wire rack.",
    "for syrup in small saucepan combine granulated sugar,instant coffee and 1/3 cup of water. cook over medium heat and bring to a boil, boil for about 1 miunte then stir in rum remove from heat and let cool.",
    "for filling in a medium bowl stir together the cream cheese powder sugar and vanilla. than stir in 2oz of the grated chocolate.",
    "Page 2 of 2Tiramisu (cont.)",
    "Directions",
    "next step is to assemble the cake. cut the cake into 3 horizontal layers return on layer to the cake pan brush layer with 1/3 of the syrup and then spread half the filling over the syrup. now add second cake layer, brush 1/3 syrup on the cake layer and the rest of the filling. Now add last cake layer.",
    "in the chilled mixing bowl combine whipping cream and coffee liquer. beat with chilled beaters until soft peaks form. spread on top of cake. sprinkle remaining grated chocolate on top. cover and chill for atleast 4 hours.",
    "Hot Milk Cake Recipe.",
    "grease a 9x9x2 square baking pan set aside. Stir together flour and baking powder.",
    "beat eggs with and electric beater until thick (about 4 mins.)Gradually add sugar beat until light and fluffy. add flour mixture and beat until just combined.",
    "in a small saucepan heat and stir milk and butter. heat until butter melts, add to batter and beat until combined pour in baking pan.",
    "bake at 350 for 20-25 minutes or until toothpick comes out clean. cool on baking rack."
  ],
  "ingredients": [
    "0",
    "About This Recipe",
    "\"This is a recipe put out by better homes and gardens. It is easy and very yummy.\"",
    "Ingredients",
    "1/2 cup granulated sugar",
    "2 tablespoons instant coffee crystals",
    "2 tablespoons rum",
    "2 (8 ounce) packages cream cheese, softened",
    "1/2 cup sifted powdered sugar",
    "1 teaspoon vanilla",
    "2 1/2 ounces semisweet chocolate, grated",
    "1 cup whipping cream",
    "2 tablespoons coffee liqueur",
    "hot milk cake recipe",
    "2 eggs ( room temperature)",
    "1 cup flour",
    "1 teaspoon baking powder",
    "1 cup sugar",
    "1/2 cup milk",
    "2 tablespoons butter"
  ],
  "__v": 1
}