{
  "hash": "29e362e8be2f94759ab130af71fea3bc78f4bc0e",
  "title": "Dry Pot Chicken (Gan Guo Ji)",
  "image": "",
  "href": "http://www.eatingwell.com/recipe/279703/dry-pot-chicken-gan-guo-ji/",
  "extension": "Chrome",
  "firstAdded": "2020-05-25T18:09:55.111000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Step 1",
    "Preheat oven to 375 degrees F. Line a baking sheet with parchment paper.",
    "Step 2",
    "Place tofu skin in a medium bowl and cover with boiling water. Let soak for 30 minutes. Drain.",
    "Step 3",
    "Meanwhile, toss chicken with 2 tablespoons oil, 1 tablespoon Shaoxing and ground pepper in a large bowl. Transfer to the prepared baking sheet. Bake until an instant-read thermometer inserted in the thickest part without touching bone registers 165 degrees F, 25 to 30 minutes. Transfer to a clean cutting board. When cool enough to handle, pull the meat from the bones (discard bones and skin). Cut the chicken into bite-size pieces and set aside.",
    "Step 4",
    "Heat a small skillet over medium heat for 1 minute. Add cumin seeds, fennel seeds and peppercorns; toast, stirring often, until fragrant, about 1 minute. Transfer to a plate to cool, then coarsely grind in a spice grinder or mortar and pestle. Transfer to a small bowl and add chili bean paste and chili flakes (or crushed red pepper); mix well and set aside.",
    "Step 5",
    "Put a large pot of water on to boil and set a large bowl of ice water beside the stove. Add the tofu skin and potato to the boiling water. Cook until the potato is just tender, about 5 minutes. Add broccolini and celery; cook for 30 seconds. Using a slotted spoon, transfer the vegetables and tofu skin to the ice water, then transfer to a clean kitchen towel to drain.",
    "Step 6",
    "Heat a large flat-bottom wok or cast-iron skillet over high heat. Add 4 tablespoons oil and onion. Cook, stirring, until the onion is softened, about 3 minutes. Add jalapeño (or serrano) and dried chiles to taste, garlic and ginger. Cook, stirring constantly, until fragrant, about 1 minute.",
    "Step 7",
    "Push the aromatics to the sides of the pan, making a well in the center. Add the remaining 3 tablespoons oil, followed by the reserved peppercorn mixture. Cook, stirring, until fragrant, about 30 seconds. Add the chicken and scallions; cook, stirring, until the chicken is hot, about 1 minute. Drizzle the remaining 1 tablespoon Shaoxing and soy sauce around the edges of the pan, then add the vegetables and tofu skin. Cook, stirring, until the vegetables are hot, about 1 minute more. Sprinkle with sesame seeds."
  ],
  "ingredients": [
    "0",
    "½ cup dried tofu skin (see Tips), broken into pieces",
    "2 pounds bone-in chicken thighs, patted dry",
    "9 tablespoons peanut oil, divided",
    "2 tablespoons Shaoxing rice wine (see Tips), divided",
    "½ teaspoon ground pepper",
    "1 teaspoon cumin seeds",
    "1 teaspoon fennel seeds",
    "1 teaspoon Sichuan peppercorns (see Tips)",
    "2 tablespoons Pixian chili bean paste (doubanjiang; see Tips)",
    "1 tablespoon Sichuan chili flakes (see Tips) or crushed red pepper",
    "1 medium russet potato, peeled and sliced 1/4 inch thick",
    "1 bunch broccolini, cut into 1-inch pieces",
    "4 stalks celery, thinly sliced on the diagonal",
    "1 cup thinly sliced onion",
    "1-2 jalapeño or serrano peppers, thinly sliced",
    "8-10 dried small red chiles",
    "5 cloves garlic, thinly sliced",
    "1 (2 inch) piece ginger, peeled and cut into thin slivers",
    "4 scallions, trimmed and cut into 1/2-inch pieces",
    "1 tablespoon reduced-sodium soy sauce",
    "1 tablespoon toasted sesame seeds"
  ],
  "__v": 1
}