{
  "hash": "f23abea59d4a6150d8ed3f9e1e8b1e31e404185e",
  "title": "Healthy Fruit Leather (a.k.a roll ups",
  "image": "http://3.bp.blogspot.com/-p4q5WKtZcsE/Uh5sZ989ehI/AAAAAAAAAvQ/gJy8i3lwFqk/s640/DSC_1208-2.jpg",
  "href": "http://www.brookes-kitchen.com/2013/08/healthy-fruit-leather-aka-rollups.html",
  "extension": "Chrome",
  "firstAdded": "2016-01-08T20:01:57.860000",
  "users": [
    null
  ],
  "keywords": [
    "apples",
    "strawberries",
    "ruby",
    "pink",
    "grapefruit",
    "steviarice",
    "malt",
    "syrup",
    "sweeten",
    "needed",
    "cinnamon",
    "salt"
  ],
  "directions": [
    "0",
    "Place the fruit in saucepan with the water and bring to a boil. Reduce the heat and simmer until the fruit is soft and the liquid has been reduced. Stir through the cinnamon and salt.",
    "Transfer the fruit to a blender and puree until smooth. Taste the mixture and if required add a sweetener. The grapefruit can be quite tart and while suitable for adults children may not appreciate this. If you would like a sweeter roll up than I suggest adding some sweetness to balance out the sourness. If a sweetener is added blend again until combined. You should end up with 2-3 cups worth of pureed fruit.",
    "Heat oven to 120-150°C (250-300F). Line a large baking tray with baking paper (if your baking tray is not very large you may need to use two smaller sized trays). Pour the mixture onto the tray and spread it out thinly by using the back of a spatula. You want it to just cover the baking paper's surface without leaving any gaps (the thinner the better!). Place the baking tray in the oven on the lowest shelf availiable and bake for 8-12 hours. I left mine overnight baking at about 130°C for 9 hours. Remove the tray from the oven and using a sharp knife cut the fruit leather into strips. Let it cool completely before peeling the fruit leather off the baking paper. Roll up if desired and store in an airtight container for up to a week! Enjoy :)"
  ],
  "ingredients": [
    "0",
    "2 apples, finely diced",
    "10 strawberries, diced",
    "1 ruby pink grapefruit, diced",
    "Stevia/rice malt syrup to sweeten if needed",
    "1 tsp cinnamon",
    "Pinch salt",
    "1/"
  ],
  "__v": 1
}