{
  "hash": "f0f119fbf2087947f29d697b15936c921eee7da8",
  "title": "Fiery Roasted Garlic & Tomato Soup",
  "image": "https://tastykitchen.com/wp-content/uploads/sites/2/2011/10/tomato-soup_1_alt-410x273.jpg",
  "href": "https://tastykitchen.com/blog/2011/12/fiery-roasted-garlic-and-tomato-soup/",
  "extension": "Firefox",
  "firstAdded": "2019-07-14T23:23:02.164000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400 degrees F and line 2 baking sheets with foil.",
    "Cut the ciabatta bread into six 1/2″ slices, drizzle with 1 Tablespoon of olive oil, and place on baking sheet; toast until golden. Remove bread from oven, top each with 1 Tablespoon of the gruyere cheese and place in oven once again, just until cheese is melted. Remove bread from oven, cut each slice on the bias (making 12 pieces), and keep warm.",
    "Cut the Roma tomatoes in half and place in a large bowl; add the 2 Tablespoons of olive oil as well as the balsamic vinegar and other ingredients down through the Italian seasoning to the tomatoes, and toss to coat. Add this to the second baking sheet and roast in the preheated oven for 45 minutes.",
    "Cut the tops off of the 3 heads of garlic and add 2 Tablespoons of the olive oil. Wrap the heads tightly in foil; place them next to the tomatoes to roast for 40 minutes.",
    "Once tomatoes and garlic are roasted, set aside to cool slightly, until they can be handled. Squeeze the roasted garlic cloves out of their papers, discard papers and set aside the roasted garlic aside.",
    "In the meantime, in a large pot over medium heat, add the remaining 2 Tablespoons of olive oil, the chopped onion and 2 fresh, chopped garlic cloves. Allow them to become aromatic and translucent. Then add the roasted tomatoes (and all of their juice from the baking sheet), and the roasted garlic. Add the lemon basil and parsley and stir to combine. Add the hot chicken stock and the croutons, and allow to simmer without lid, for about 20 minutes.",
    "Add the grated parmesan cheese, and stir. Using a hand immersion blender, puree the soup until smooth and all tomatoes are completely pureed (if using a blender, work in small batches to puree. Be careful to not overfill the blender, as hot soup can splatter). Check the salt/pepper, and adjust to taste, if necessary.",
    "Ladle into serving bowls, and garnish with 2 pieces of the ciabatta cheese toasts. Enjoy!"
  ],
  "ingredients": [
    "0",
    "1 loaf Ciabatta Bread",
    "7 Tablespoons Olive Oil, Divided",
    "6 Tablespoons Gruyere Cheese, Shredded, Divided Use",
    "15 whole Roma Tomatoes",
    "1-½ Tablespoon Balsamic Vinegar",
    "3 Tablespoons Brown Sugar",
    "1 Tablespoon Salt",
    "1 teaspoon Fresh Cracked Black Pepper",
    "1 Tablespoon Red Chili Pepper Flakes",
    "2 teaspoons Italian Seasoning",
    "3 whole Heads Of Garlic (Peels Left On) Plus 2 Cloves, Chopped, Divided Use",
    "1 whole Onion, Chopped",
    "1 bunch Lemon Basil (or Regular Basil), Stems Removed And Chopped",
    "¼ cups Flat-leaf Parsley, Chopped",
    "3 cups Chicken Stock",
    "1 cup Croutons (packaged)",
    "½ cups Grated Parmesan Cheese"
  ],
  "__v": 2
}