{
  "hash": "e86e7b462aff44d04179e310e87faf1b74039afd",
  "title": "Baked Macaroni & Cheese",
  "image": "https://divascancook.com/wp-content/uploads/2009/11/DSC_1900.jpg",
  "href": "https://divascancook.com/homemade-baked-macaroni-cheese-recipe-easy-creamy-crowd-pleasing/",
  "extension": "Chrome",
  "firstAdded": "2019-11-20T16:12:11.209000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350F.",
    "In a large pot, add equal parts water & chicken broth. (Just enough to cook your macaroni in) Bring to a boil.",
    "Add macaroni and cook until al dente. About 7-8 minutes (look on the back of the box for the cooking time and set your timer so that you don't overcook it) When macaroni is done, drain and set aside.",
    "In a large saucepan over medium heat, melt butter & whisk in the flour. Cook for about 2 minutes. Whisking the entire time.",
    "Slowly whisk in 1 cup chicken broth, half n half, & milk. Whisk until combined. You want the mixture to steam but NOT boil. Adjust your heat accordingly",
    "Add in the cream cheese & stir until completely dissolved and smooth. Whisk & stir like crazy to get it smooth. I used a spoon to mash the cream cheese up a bit.",
    "Remove from heat & add in 4 cups of cheese & stir until smooth.",
    "Pour cheese mixture over cooked macaroni and stir to combine. Add some black pepper if you'd like.",
    "Grease a 9 X 9-inch pan with butter & pour the mac n cheese into it.",
    "Top with sharp cheddar cheese and paprika.",
    "Bake for 25-30 minutes. Do not over-bake to prevent it from being dried out. You want the macaroni and cheese to be somewhat jiggly when you take it out. It will set as it cool and just be the creamiest, cheesiest thing ever.",
    "Let cool for about 15-20 minutes before digging in so that it can set completely. I never can wait that long but hopefully, you have stronger willpower than me when it comes to macaroni & cheese."
  ],
  "ingredients": [
    "0",
    "Equal parts water & chicken broth to boil macaroni in",
    "3 cups of macaroni (uncooked)",
    "2 Tablespoons of butter",
    "2 Tablespoons flour",
    "1 cup chicken broth",
    "½ cup half n half",
    "½ cup milk",
    "½ cup cream cheese, softened",
    "4 cups of finely grated cheese (I buy the bag of Kraft mixed cheese(It's the one with the picture of the macaroni on the front. I think it's called classic melts. It is about 3 cups worth per bag and then I add a cup of Gouda cheese)",
    "Additional cheese to go on top (I like to use all sharp cheddar on top)",
    "Black pepper",
    "Paprika"
  ],
  "__v": 1
}