{
  "hash": "8732b3c410ec99a26574382b363ea876e1193365",
  "title": "Cream of Chicken and Wild Rice Soup",
  "image": "",
  "href": "http://recipe-folder.com/recipe/5c26dea34bfb7d080873c7ba",
  "extension": "User Added",
  "firstAdded": "2018-12-29T02:40:35.217000",
  "users": [
    null
  ],
  "ratings": [
    {
      "user": "5c22ed1552ed03095db6478d",
      "rating": 5
    }
  ],
  "keywords": [],
  "directions": [
    "0",
    "Cook the wild rice according to package directions, but remove from heat about 15 minutes before it's done. Drain the excess liquid, and set aside.",
    "1",
    "In a stock pot over high heat, combine the chicken and the water. Bring to a boil, and then reduce heat to low. Simmer for 40 minutes, or until chicken is cooked and tender.",
    "2",
    "Remove chicken from the pot, and allow it to cool. Strain the broth from the pot, and reserve for later. When chicken is cool, remove the meat from the bones, cut into bite size pieces, and reserve. Discard the fat and the bones.",
    "3",
    "In the same stock pot over medium heat, saute the celery and onion in the oil for 5 minutes. Add the mushrooms, and cover. Cook for 5 to 10 minutes, stirring occasionally, until everything is tender.",
    "4",
    "Return the broth to the stock pot, and add the partially cooked wild rice. Stir in the bouillon, white pepper and salt; simmer, uncovered, for 15 minutes.",
    "5",
    "Meanwhile, melt margarine in a medium saucepan over medium heat. Stir in the flour until smooth. Whisk in the milk, and continue cooking until mixture is bubbly and thick.",
    "6",
    "Add some of the broth mixture to the milk mixture, continuing to stir, then stir all of the milk mixture into the broth mixture.",
    "7",
    "Mix in the reserved chicken meat and the white wine. Allow this to heat through for about 15 minutes."
  ],
  "ingredients": [
    "0",
    "•\t1 1/3 cups wild rice",
    "1",
    "•\t1 (3 pound) whole chicken, cut into pieces",
    "2",
    "•\t7 cups water",
    "3",
    "•\t1 cup chopped celery",
    "4",
    "•\t1 cup chopped onion",
    "5",
    "•\t2 tablespoons vegetable oil",
    "6",
    "•\t1 cup fresh mushrooms, sliced",
    "7",
    "•\t2 tablespoons chicken bouillon granules",
    "8",
    "•\t3/4 teaspoon ground white pepper",
    "9",
    "•\t1/2 teaspoon salt",
    "10",
    "•\t1/2 cup margarine",
    "11",
    "•\t3/4 cup all-purpose flour",
    "12",
    "•\t4 cups milk",
    "13",
    "•\t3/4 cup white wine"
  ],
  "__v": 2,
  "hidden": true,
  "rating": 5
}