{
  "hash": "678e5f31cf213dbd18b2733ebc122ebba4d2bfd8",
  "title": "Grilled Foil-Wrapped Potatoes With Shallots, Lemon, and Thyme",
  "image": "http://www.seriouseats.com/recipes/assets_c/2014/03/20140320-287335-campfire-potatoes-thumb-625xauto-390972.jpg",
  "href": "http://www.seriouseats.com/recipes/2014/03/grilled-foil-wrapped-potatoes-shallots-thyme-lemon-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-06-10T19:16:39.107000",
  "users": [
    null
  ],
  "keywords": [
    "yukon",
    "gold",
    "potatoes",
    "diameter",
    "red",
    "extravirgin",
    "olive",
    "oil",
    "squeezed",
    "juice",
    "lemons",
    "roughly",
    "shallots",
    "medium",
    "thyme",
    "leaves",
    "kosher",
    "salt",
    "black",
    "pepper",
    "type",
    "twozone",
    "indirect",
    "grill",
    "heat",
    "mediumhigh"
  ],
  "directions": [
    "0",
    "1 Tear off four 18-inch square pieces of heavy duty aluminum foil. In a large bowl, combine potatoes, oil, lemon juice, shallots, and thyme. Season with salt and pepper and toss to combine. Divide into four even batches, placing each batch in the center of one square of foil.",
    "2 Crimp foil closed, rolling sides to fully seal each packet.",
    "3 Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover gill and allow to preheat for 5 minutes. Clean and oil the grilling grate. Place packets on grill, aligning them close to, but not directly over the coals. Cover and cook for 10 minutes. Rotate packets front to back (so cooler side is now closer to coals), cover, and continue cooking for 10 minutes longer. Move packets directly over coals, cover, and cook for 5 minutes more. Remove from grill and let cool for 5 minutes. Carefully open packets, season with additional salt, pepper, and lemon juice to taste, and serve immediately."
  ],
  "ingredients": [
    "0",
    "1 1/2 pounds small yukon gold potatoes (about 1 1/2 to 2 inches in diameter), halved",
    "1 1/2 pounds small red potatoes (about 1 1/2 to 2 inches in diameter), halved",
    "1/4 cup extra-virgin olive oil",
    "1/4 cup freshly squeezed juice from 2 to 3 lemons, plus more to taste",
    "1/3 cup roughly chopped shallots (about 2 medium)",
    "4 teaspoons finely minced fresh thyme leaves",
    "Kosher salt and freshly ground black pepper",
    "Type of fire: two-zone indirect",
    "Grill heat: medium-high"
  ],
  "__v": 1
}