{
  "hash": "4884767e6760212dc9a0593c30ba4692300d2455",
  "title": "Mochi Ice Cream",
  "image": "https://www.justonecookbook.com/wp-content/uploads/2014/06/Mochi-Ice-Cream-205x135.jpg",
  "href": "https://www.justonecookbook.com/mochi-ice-cream/",
  "extension": "Chrome",
  "firstAdded": "2017-10-15T16:36:28.197000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Gather all the ingredients.",
    "Using the cookie scoop, scoop out ice cream into aluminum/silicone cupcake liners. The ice cream will melt quickly so I recommend freezing them immediately for a few hours or until ice cream balls are completely frozen solid.",
    "Once the ice cream balls are frozen solid and ready, you can start making mochi. Combine shiratamako and sugar in a medium bowl and whisk all together.",
    "Add water and mix well until combined.",
    "Microwave Method: If you’re using a microwave to cook mochi, cover the bowl with some plastic wrap (do not cover too tight). Put the bowl in the microwave and heat it on high heat (1200w) for 1 minute. Take it out and stir with wet rubber spatula. Cover again and cook for 1 minute. Stir again, cover, and cook for 30 seconds to finish cooking. The color of mochi should change from white to almost translucent.",
    "Steaming Method: If you’re using a steamer, cover the steamer lid with a towel so the condensation won’t drop into the mochi mixture. Put the bowl into a steamer basket and cover to cook for 15 minutes. Half way cooking, stir with wet rubber spatula and cover to finish cooking. The color of mochi should change from white to almost translucent.",
    "Cover the work surface with parchment paper and dust it generously with potato starch. Then transfer the cooked mochi on top.",
    "To prevent from sticking, sprinkle more potato starch on top of the mochi. Once it’s cool down a bit, you can spread the mochi into a thin layer with your hands or with a rolling pin. Make sure to apply potato starch on your hands and the rolling pin. I recommend using a rolling pin because it’s easier to evenly spread out.",
    "Transfer the mochi with parchment paper onto a large baking sheet. Refrigerate for 15 minutes until the mochi is set.",
    "Take out the mochi from the refrigerator and cut out 7-8 circles with the cookie cutter.",
    "Dust off the excess potato starch with a pastry brush. If you find some sticky part, cover the area with potato starch first then dust off. Place a plastic wrap on a plate and then mochi wrapper on top, then lay another layer of plastic wrapper down. Repeat for all wrappers. With leftover mochi dough, roll into a ball and then flatten into a thin layer again and cut out into more circle wrappers (I could make about 12 mochi wrappers).",
    "Now we’re ready to form mochi ice cream balls. On the work surface, place one sheet of plastic wrap with a mochi layer on top. Take out one ice cream ball from the freezer and put it on top of the mochi wrapper. Pinch the four corners of the mochi layer together to wrap the ice cream ball.",
    "When mochi gets sticky, put some potato starch on the sticky area and seal the opening. Quickly cover with the plastic wrap and twist to close. Place each mochi ice cream into a cupcake pan to keep the shape. You will need to work on one mochi ice cream at a time in order to keep the ice cream frozen all times. Put mochi ice cream back into the freezer for a few hours. When you’re ready to serve, keep them outside for a few minutes until mochi gets soften a little bit."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "¾ cup Shiratamako (glutinous rice flour/sweet rice flour) (¾ cup = 100 g) (See Notes)",
    "¾ cup water (¾ cup = 180 ml)",
    "¼ cup granulated sugar (¼ cup = 55 g) (See Notes)",
    "½ cup potato starch/corn starch (½ cup = 100 g)",
    "Ice cream of your choice",
    "Substitute for shiratamako:",
    "¾ cup Mochiko (glutinous rice flour/sweet rice flour) (¾ cup = 115g)"
  ],
  "__v": 1
}