{
  "hash": "1ccbf081757207553cde68bb4ad5936c65b16066",
  "title": "30 Minute Fresh Mozzarella Cheese Homemade",
  "image": "http://img.sndimg.com/food/image/upload/w_614,h_461,c_fit/v1/img/recipes/29/03/71/picnC39Be.jpg",
  "href": "http://cheese.food.com/recipe/30-minute-fresh-mozzarella-cheese-homemade-290371",
  "extension": "Chrome",
  "firstAdded": "2015-10-12T12:43:36.062000",
  "users": [
    null
  ],
  "keywords": [
    "rennet",
    "tablet",
    "cool",
    "water",
    "bottled",
    "waters",
    "chlorinefree",
    "lowfat",
    "milk",
    "skim",
    "citric",
    "acid",
    "salt"
  ],
  "directions": [
    "0",
    "Crush the rennet into the water and stir to dissolve.",
    "Pour milk into a non-reactive pot (no aluminum or cast iron).",
    "Place over medium heat. Sprinkle the citric acid over the milk and stir a few times. Heat milk to 88°F; milk will begin to curdle.",
    "At 88°F, add the rennet solution and continue stirring slowly every few minutes until the milk reaches 105°F Turn off the heat. Large curds will appear and begin to separate from the whey (the clear, greenish liquid).",
    "With a slotted spoon or mesh strainer, scoop the curd into a large glass bowl. (If it's still too liquid, let it set for a few more minutes). Press the curds gently with your hand and pour off as much whey as possible.",
    "Microwave curds on high for 1 minute, then drain off all the excess whey.",
    "With a spoon, press curds into a ball until cool.",
    "Microwave two more times for 35 seconds each, and continue to drain the whey and work cheese into a ball.",
    "In the meantime, place the whey over medium heat and let it heat to about 175°F.",
    "When cheese is cool enough to touch, knead it like bread dough until smooth. When you can stretch it like taffy, it is done. You can sprinkle 1 to 2 teaspoons salt into the cheese while kneading and stretching it. The cheese will become stretchy, smooth and shiny. If it is difficult to stretch and breaks easily, dip it into the hot whey for a few seconds to make it warm and pliable. Then pick it up again and stretch it into a long rope. Fold over and stretch again. Dip in hot whey as needed to make the cheese pliable.",
    "When the cheese is smooth and shiny (this takes just a few minutes), it is ready to eat. Shape it into a log or golf-size balls, then store in a solution of 2 teaspoons salt to 1 cup water."
  ],
  "ingredients": [
    "0",
    "1⁄2 rennet tablet",
    "1⁄4 cup cool chlorine-free water (most bottled waters are chlorine-free)",
    "1 gallon 2% low-fat milk (1%, or skim)",
    "2 teaspoons citric acid",
    "1 teaspoon salt (optional)"
  ],
  "__v": 1
}