{
  "hash": "75c6e9b9e543d9a682ebbdff365c1cdd81e8443b",
  "title": "Chocolate Bundt Cake",
  "image": "https://media.cheftap.com/wp-content/uploads/beckyrasmussen/fedfaf17-53ce-4db4-b820-7794951e5a37.png",
  "href": "https://cheftap.com/recipes/chocolate-bundt-cake-89/",
  "extension": "Chrome",
  "firstAdded": "2018-11-12T19:06:04.793000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 325 F. Lightly oil and flour a 12-cup bundt pan and set aside.",
    "In a medium-sized mixing bowl, sift together the flour, cocoa powder, baking soda, and salt until well combined. Set aside. In a small mixing bowl, whisk together the soy milk and dairy-free sour cream until well mixed. Set aside.",
    "In another large mixing bowl, whisk together the eggs and the sugar until pale yellow in color.",
    "Add the canola oil and vanilla extract and continue to whisk until the mixture is smooth and well mixed. In several additions, add the flour mixture alternating with the soy milk mixture, and beginning and ending with the flour mixture. Once the mixture is just combined, fold in the dairy-free chocolate chips.",
    "4. Pour the batter into the prepared bundt pan and bake until the top springs back when touched, 55 to 60 minutes. Let the pan cool for 30-45 minutes on a wire cooling rack, then gently loosen the cake from the sides of the pan with a knife and invert the cake onto the wire cooling rack to cool completely. Once the cake is completely cool, top the cake with Vegan Ganache or Chocolate Glaze (recipe below)."
  ],
  "ingredients": [
    "0",
    "2 1/2 cups all-purpose flour",
    "1/2 cup unsweetened cocoa powder",
    "1 teaspoon baking soda",
    "3/4 teaspoon salt",
    "1/2 cup soy milk (vanilla)",
    "1/2 cup dairy-free sour cream",
    "4 large eggs",
    "1 1/2 cups sugar",
    "1 cup canola oil",
    "1 teaspoon vanilla extract",
    "1 cup dairy-free chocolate chips",
    "1 recipe chocolate glaze (",
    "recipe below) (or 1 recipe vegan ganache)"
  ],
  "__v": 1
}