{
  "hash": "9d490eefe487374bcc7e5b5957fce200849bdc17",
  "title": "Steak and Kidney Pudding a Winter Favourite",
  "image": "http://recipe-folder.com/img/recipe-images/082/023/1683561482.jpg",
  "href": "http://www.dailytelegraph.com.au/entertainment/steak-and-kidney-pudding-a-winter-favourite/story-e6frewt9-1226042207074?nk=0768d866a23b66814e5bcc7d6fcb90c0-1446596051",
  "extension": "Firefox",
  "firstAdded": "2015-11-04T00:17:10.892000",
  "users": [
    null
  ],
  "keywords": [
    "beef",
    "brisket",
    "veal",
    "kidneys",
    "brown",
    "onion",
    "plain",
    "flour",
    "salt",
    "pepper",
    "stock",
    "worcestershire",
    "hot",
    "english",
    "mustard",
    "vegemite",
    "pastry",
    "self",
    "raising",
    "white",
    "peppercorns",
    "suet",
    "water"
  ],
  "directions": [
    "0",
    "1 Lightly grease 6 tea cups.",
    "To prepare the pastry, sieve the self raising flour, salt and pepper together. Add in the suet then mix to combine. Pour in the water, mix together to form a dough then knead for 3 to 4 minutes until smooth. Spread a little flour on the bench then roll out the pastry to a 5mm thickness. Cut out 6 rounds using a 14 cm diameter cutter and then a further 6 rounds using a 9cm diameter cutter. Cover and place the pastry rounds into the refrigerator to rest.",
    "To prepare the filling, dice the brisket and kidneys into 2.5 cm cubes. Place them into a bowl with the chopped onion and plain flour then season with salt and pepper. Gently toss to combine.",
    "Warm the veal stock and when hot whisk in the Worcestershire sauce, mustard and Vegemite. Pour the liquid over the meat and onions then mix until combined.",
    "Line each tea cup with the larger rounds of pastry ensuring you press down to release any air. Fill the lined tea cups with the meat mixture then place the smaller rounds of pastry on top to create a lid.",
    "Gently press around the edges of the pastry to form a seal. Cover with plastic wrap then place into a steamer for 3 hours.",
    "Once cooked, remove from the steamer and turn out onto a plate. Serve with steamed vegetables or mashed potato."
  ],
  "ingredients": [
    "0",
    "450 g beef brisket",
    "450 g veal kidneys",
    "1 brown onion, finely chopped",
    "35 g plain flour",
    "salt and pepper",
    "160 ml veal stock",
    "70 ml Worcestershire sauce",
    "50 g hot English mustard",
    "25 g Vegemite",
    "Pastry Ingredients",
    "500 g self raising flour",
    "2 teaspoons salt",
    "1/2 teaspoon white peppercorns, ground",
    "200 g suet, grated",
    "290 ml water"
  ],
  "__v": 3
}