{
  "__v": 1,
  "directions": [
    "0",
    "Come sbollentare le lasagneImmergi, man mano, i fogli di pasta in acqua bollente salata a cui avrai aggiunto 1 cucchiaio di olio per evitare che la pasta si attacchi. Sgocciola le sfoglie con un mestolo forato e raffreddale in una ciotola con acqua e cubetti di ghiaccio. Stendile su un vassoio foderato con carta da forno e, senza sovrapporle, separa gli strati di pasta con fogli di carta da forno, per evitare che i pezzi si attacchino. Se i rettangoli di pasta sono molto sottili, non è necessario lessarli, a patto che siano conditi con un sugo abbondante e leggermente fluido, che inumidisca un po' la pasta.Usa il mestolo a ragnoIl ragno, grazie alla sua larghezza, è molto utile per scolare una a una le lasagne dall'acqua bollente e tenderle poi sul piano di lavoro evitando di rompere la pasta. Fatte in anticipo sono più buoneTogli le lasagne dal forno e attendi qualche minuto, per far assestare i sapori. Se preferisci, puoi preparare le lasagne in anticipo e scaldarle in forno prima di portarle in tavola.Se vuoi, puoi preparare le lasagne anche il giorno prima: dopo aver sistemato gli ingredienti nella pirofila, copri con pellicola e conservale in frigorifero; cuocile in forno prima di servirle. A piacere, puoi surgelarle (anche in teglie più piccole). Quando le vorrai gustare, basterà cuocerle per circa 40-45 minuti, senza scongelarle, coprendole per metà cottura con 1 foglio di alluminio."
  ],
  "firstAdded": "2014-10-08T14:17:35.665000",
  "hash": "783b81593fa2c8d84586ae302934b5de5d2d8fdc",
  "href": "http://www.salepepe.it/ricette/primi/pasta-ripiena/lasagne/ricette-lasagne-forno/?utm_source=facebook&utm_medium=social&utm_campaign=fb",
  "image": "http://www.salepepe.it/files/2014/03/lasagne-ragu-bianco-crop-4-3-640-480.jpg",
  "ingredients": [
    "0",
    "Le lasagne sono uno dei piatti più conosciuti e amati della tradizione gastronomica italiana. Ne esistono infinite ricette, dalle lasagne classiche con ragù di carne, alle lasagne vegetariane o alle più raffinate con crostacei e pesce. Le lasagne possono anche essere light, ad esempio sostituendo la classica besciamella con formaggi più leggeri come la robiola o il primosale. Le lasagne possono essere anche presentate come lasagnette o stracci di pasta, che sono tipici delle regioni meridionali. Secondo le località si usano farine diverse, impastate con acqua tiepida e sale. In Calabria e in Basilicata si usa farina di grano duro, in Puglia la farina 0, anche di grano tenero. In alternativa, per piatti più ricchi, si preparano con la pasta all'uovo. Scopri le migliori ricette di lasagne di Sale&Pepe e segui i consigli che trovi nello speciale per cucinare perfettamente le tue lasagne."
  ],
  "keywords": [
    "uno",
    "dei",
    "conosciuti",
    "amati",
    "della",
    "tradizione",
    "gastronomica",
    "italiana",
    "esistono",
    "infinite",
    "dalle",
    "classiche",
    "rag",
    "carne",
    "vegetariane",
    "alle",
    "raffinate",
    "crostacei",
    "pesce",
    "light",
    "esempio",
    "sostituendo",
    "classica",
    "besciamella",
    "formaggi",
    "leggeri",
    "robiola",
    "primosale",
    "possono",
    "essere",
    "presentate",
    "come",
    "lasagnette",
    "stracci",
    "sono",
    "tipici",
    "delle",
    "regioni",
    "meridionali",
    "secondo",
    "localit",
    "usano",
    "farine",
    "diverse",
    "impastate",
    "acqua",
    "tiepida",
    "sale",
    "calabria",
    "basilicata",
    "usa",
    "duro",
    "puglia",
    "farina",
    "anche",
    "grano",
    "tenero",
    "alternativa",
    "piatti",
    "ricchi",
    "preparano",
    "pasta",
    "alluovo",
    "scopri",
    "migliori",
    "ricette",
    "salepepe",
    "segui",
    "consigli",
    "che",
    "trovi",
    "nello",
    "speciale",
    "cucinare",
    "perfettamente",
    "tue",
    "lasagne"
  ],
  "title": "SPECIALITÀ LASAGNE: TUTTE LE RICETTE DI SALE&PEPE",
  "users": [
    null
  ]
}