{
  "hash": "a549c9b6af308961076a0893167e9a0af0256aa6",
  "title": "Tempeh “Fish” N' Chips with Tartar Sauce",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2014/03/Tempeh-Fish-and-Chips-1066x800.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/tempeh-fish-nchips-with-tartar-sauce/",
  "extension": "Chrome",
  "firstAdded": "2015-05-27T08:34:20.608000",
  "users": [
    null
  ],
  "keywords": [
    "tempeh",
    "chickpea",
    "flour",
    "tbs",
    "baking",
    "garlic",
    "chile",
    "old",
    "bay",
    "seasoning",
    "cider",
    "vinegar",
    "seltzer",
    "corn",
    "starch",
    "kelp",
    "safflower",
    "oil",
    "frying",
    "russet",
    "potatoes",
    "wedges",
    "cooking",
    "spray",
    "salt",
    "pepper",
    "paprika",
    "vegan",
    "mayonnaise",
    "pickle",
    "relish",
    "lemon",
    "zest",
    "juice"
  ],
  "directions": [
    "0",
    "Split the tempeh in half so that you have two thin rectangles. The way I do this is to lay the tempeh on a cutting board, hold the top steady with the palm of your hand and with a knife, slice through it like you are splitting open a bagel.",
    "If you like your tempeh less chewy, steam it for a few minutes to soften it. Cut each piece of tempeh into 4 pieces so you will have 16 pieces in total.",
    "In a bowl, add the flour, baking powder, garlic powder, chile powder, and Old Bay seasoning. Mix well. Add in the vinegar and slowly mix in the seltzer until the batter is the desired consistency (like pancake batter). In another bowl, mix the corn starch and the kelp flakes.",
    "Heat 2 inches of oil in a large skillet. Dredge the tempeh pieces into the corn starch-kelp mixture, shake off the excess, and then coat with the batter. If you want an extra crunchy, thicker battered covering, re-dredge the tempeh a second time. Fry the tempeh in the skillet in batches, turning once, until golden brown. Place the pieces on paper towels to drain and sprinkle with salt.",
    "Serve while hot with chips and tartar sauce on the side. Add lemon wedges for garnish, if desired.",
    "1",
    "Preheat oven to 425ºF with a baking sheet in the oven.",
    "Pull the hot sheet pan out of the oven and put potato wedges on it in a single layer.",
    "Spray with cooking spray, sprinkle the spices onto the potatoes and put them back into the oven.",
    "Bake the potatoes, turning occasionally, until golden brown and tender, about 40 minutes.",
    "2",
    "In a bowl, mix the Vegan mayonnaise with the unsweetened pickle relish. Add some lemon zest and the juice of half a lemon. Mix well.",
    "Refrigerate until ready to serve."
  ],
  "ingredients": [
    "0",
    "2 packages of tempeh",
    "2 cups chickpea flour",
    "1 Tbs. baking powder",
    "1 Tbs. garlic powder",
    "1 Tbs. chile powder",
    "2 tsp. Old Bay seasoning",
    "¼ cup cider vinegar",
    "12 oz. seltzer",
    "1 cup corn starch",
    "1 Tbs. kelp flakes",
    "Safflower oil for frying",
    "1",
    "4 large russet potatoes cut into wedges",
    "Cooking oil spray",
    "Salt and pepper to taste",
    "½ tsp. garlic powder",
    "½ tsp. paprika",
    "2",
    "1 cup Vegan mayonnaise",
    "2 Tbs. unsweetened pickle relish",
    "1 tsp. lemon zest",
    "Juice of half a lemon"
  ],
  "__v": 1
}