{
  "hash": "86f7c58bfa9af8a2e862d15026b298f6a676a934",
  "title": "Roasted Eggplant and Tomato Orzo Pasta",
  "image": "https://cookieandkate.com/images/2018/08/Roasted-Eggplant-and-Tomato-Orzo-Pasta-1.jpg",
  "href": "https://cookieandkate.com/2015/roasted-eggplant-tomato-orzo-pasta-recipe/",
  "extension": "Firefox",
  "firstAdded": "2018-09-05T15:00:08.084000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400 degrees Fahrenheit with one rack in the middle of the oven and the other rack in the upper third of the oven. Line 1 large, rimmed baking sheet and 1 small, rimmed baking sheet with parchment paper for easy cleanup.",
    "On the large baking sheet, toss the cubed eggplant with 2 tablespoons olive oil and a sprinkle of salt and pepper. Arrange the eggplant in a single layer. Roast on the middle rack until the eggplant is tender and deeply golden on the edges, about 25 minutes, tossing halfway.",
    "Meanwhile, on the smaller baking sheet, toss the halved tomatoes with 1 teaspoon olive oil and a sprinkle of salt and pepper. Wait to place the pan of tomatoes on the top rack until you return the eggplant to the oven after tossing. Roast until the tomatoes are tender and a little wrinkled, about 12 minutes. (So in an ideal situation, the eggplant and tomatoes will be done roasting at the same time.)",
    "Bring a large pot of salted water to boil. Add the orzo, give it a stir and cook until al dente, about 9 minutes. Reserve about 1 cup cooking water, then drain the orzo and transfer it to a large serving bowl.",
    "To prepare the dressing, whisk together the olive oil, lemon juice, garlic, salt, red pepper flakes and freshly ground black pepper. Drizzle it over the warm orzo and toss to coat. Add the roasted eggplant, tomatoes, feta, basil, parsley and pine nuts. Toss to combine. If the pasta seems dry, add a couple of tablespoons of the reserved pasta cooking water and/or a little more olive oil. Season to taste with additional salt (mine needed ¼ teaspoon more) and pepper. Serve immediately."
  ],
  "ingredients": [
    "0",
    "Roasted eggplant",
    "1 medium purple eggplant (about 1 pound), sliced into ¾-inch cubes",
    "2 tablespoons olive oil",
    "Salt and pepper",
    "Roasted tomatoes",
    "1 cup cherry or grape tomatoes, halved",
    "1 teaspoon olive oil",
    "Salt and pepper",
    "Everything else",
    "½ pound DeLallo Organic Whole Wheat Orzo",
    "⅓ cup crumbled feta",
    "¼ cup chopped fresh basil",
    "¼ cup chopped fresh parsley",
    "2 tablespoons pine nuts, toasted",
    "Lemon-garlic dressing",
    "2 tablespoons olive oil, more to taste",
    "1 tablespoon lemon juice",
    "2 cloves garlic, pressed or minced",
    "¼ teaspoon salt, more to taste",
    "⅛ teaspoon red pepper flakes",
    "Freshly ground black pepper, to taste"
  ],
  "__v": 1
}