{
  "hash": "4313c47ef54802d7eaf45c1b86794963e843c99b",
  "title": "Lucia Muffins",
  "image": "http://www.101cookbooks.com/mt-static/images/food/lucia_muffin_recipe_2.jpg",
  "href": "http://www.101cookbooks.com/archives/lucia-muffins-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2017-01-09T03:49:52.652000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "I used a blend of all-purpose and whole wheat pastry flour here, but you can exclusively use all-purpose flour if that is what you have available.",
    "Preheat oven to 400F / 200C with a rack in the top third. Butter a standard 12-muffin pan, alternately you can use liners.",
    "Melt the butter over low heat and set aside to cool. You want the butter to be melted, but not hot.",
    "Very briefly toast the saffron in a small skillet over low heat, stirring and shaking the pan continuously to avoid burning. The saffron should be fragrant, but stop before the threads change color. You are definitely better off under cooking than overcooking the saffron.",
    "Use a mortar and pestle to grind the saffron threads with 1 teaspoon of the sugar. Pour the buttermilk into a cereal bowl. Add the saffron mixture, then the egg whites, water, and melted butter. Stir until well combined.",
    "In a large bowl, whisk the flours, baking powder, baking soda, salt, remaining sugar, and almonds. Pour the wet ingredients over the dry ingredients and sprinkle with the raisins. Use a spatula to stir until everything barely comes together, avoid over-mixing. Spoon the batter into the prepared muffin cups until about three-quarters full. The batter should fill 10-12 muffin cups.",
    "Bake for 18 - 22 minutes, or until the tops of the muffins are golden and a toothpick inserted into one of them comes out clean. Pop the muffins out of the tins as soon as it is reasonable (after a few minutes) and cool on a rack. If you leave them in the pan they steam and can be challenging to remove.",
    "Makes 10 - 12 muffins (12 in the Lodge cast iron muffin pans)...",
    "Print Recipe"
  ],
  "ingredients": [
    "0",
    "butter to grease muffin tins",
    "3 tablespoons unsalted butter",
    "1 loose teaspoon saffron threads",
    "3 tablespoons natural cane sugar",
    "1 cup / 240 ml buttermilk",
    "2 egg whites",
    "2 tablespoons water",
    "1 cup / 4.5 oz / 125 g whole wheat pastry flour",
    "3/4 cup / 3.5 oz / 100g unbleached all-purpose flour",
    "1 teaspoon baking powder",
    "1/2 teaspoon baking soda",
    "1/2 teaspoon fine grain sea salt",
    "2 tablespoons finely chopped almonds",
    "1/2 cup / 2 oz / 60 g golden raisins, chopped"
  ],
  "__v": 1
}