{
  "hash": "3552e908006ba6c92f5ffe81fdac5d35fb3cb5a9",
  "title": "Triple-chocolate cheesecake",
  "image": "http://www.chatelaine.com/wp-content/uploads/2010/02/Triple-chocolate-cheesecake-1-l.jpg",
  "href": "http://www.chatelaine.com/recipe/refridgerator-or-chilled-foods/triple-chocolate-cheesecake/",
  "extension": "Chrome",
  "firstAdded": "2015-12-26T14:51:32.044000",
  "users": [
    null
  ],
  "keywords": [
    "chocolate",
    "baking",
    "crumbs",
    "granulated",
    "sugar",
    "unsalted",
    "butter",
    "filling",
    "semisweet",
    "blocks",
    "cream",
    "cheese",
    "room",
    "regular",
    "sour",
    "allpurpose",
    "flour",
    "vanilla",
    "eggs",
    "honey",
    "corn",
    "syrup"
  ],
  "directions": [
    "0",
    "For crust, butter or oil sides of a 9-in. (23-cm) or 10-in. (25-cm) springform pan. Wrap pan with foil, over bottom and sides, making sure it comes to the top edge so water from the water bath in step 3 won’t leak in. Double wrap if necessary. In a large bowl, using a fork, stir chocolate baking crumbs with sugar, then stir in butter. Press mixture onto bottom of pan. Refrigerate while preparing cheesecake filling.",
    "Preheat oven to 325F (160C). Put a kettle of water on. Finely chop chocolate and place in microwave-safe bowl. Heat on medium power for 2 min or until almost melted, stirring halfway through. Remove from microwave and stir until completely melted. Set aside. Place cream cheese in a large bowl. Using an electric mixer, beat until smooth, scraping down sides occasionally. Beat in sour cream, sugar, flour and vanilla. Beat in eggs, one at a time, just until blended. Beat in cooled chocolate. Pour onto chilled crust.",
    "Place wrapped springform pan in a broiler pan or shallow-sided roasting pan. Place in centre of preheated oven. Pour enough boiling water into broiler pan to come about 1 in. (2.5 cm) up side of foil-wrapped springform pan.",
    "Bake until filling is almost set when springform pan is jiggled, about 40 to 60 min. Remove broiler pan to a rack. Run a knife around inside of cake pan to help prevent cracking. Let stand until water cools, about 30 min.",
    "Remove pan from water. Discard foil. Cool completely, then cover pan with plastic wrap. Refrigerate until chilled, 4 hours. Remove cake from pan. If making ahead, refrigerate up to 3 days. Or over-wrap with foil and freeze for up to 1 month.",
    "For glaze, finely chop chocolate and place in a medium bowl. Bring cream just to a boil, in a saucepan on the stovetop or in a bowl in the microwave. Pour hot cream over chocolate. Add honey. Stir just until chocolate is melted and evenly mixed. Just before serving, pour and spread glaze over cake. Top with assorted berries and chocolate curl"
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "2 1/2 cups chocolate baking crumbs",
    "1/4 cup granulated sugar",
    "1/2 cup unsalted butter, melted",
    "FILLING",
    "225 g semi-sweet chocolate",
    "4 250-g blocks cream cheese, at room temperature",
    "1/2 cup regular sour cream",
    "1 1/4 cups granulated sugar",
    "1 tbsp all-purpose flour",
    "2 tsp vanilla",
    "4 eggs",
    "112 g semi-sweet chocolate",
    "1/2 cup 35% cream",
    "2 tbsp honey, or corn syrup"
  ],
  "__v": 1
}