{
  "hash": "dc5a95b5be81eed82860d04b40d5159a3f11a644",
  "title": "Pasta e Fagioli (Pasta and Beans)",
  "image": "https://images.food52.com/6QM-lBdUQVCPk-Vc-bcTuv-eH8M=/753x502/f3c67414-db77-4028-ae5e-a3b42524e13b--pasta-e-fagioli-IMG_6358.jpg",
  "href": "https://food52.com/recipes/65020-pasta-e-fagioli-pasta-and-beans",
  "extension": "Chrome",
  "firstAdded": "2016-12-05T21:01:58.386000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a casserole pot, gently saute the chopped onion, celery and carrot in the olive oil with a good pinch of salt. Let the vegetables soften without colouring, about 5-10 minutes. Add the pancetta, if using, and continue cooking, stirring occasionally, letting the pancetta sizzle until it is transparent.",
    "Add the drained beans, along with the tomato puree and the water (or stock or bean liquid if you have cooked them yourself). Bring to a simmer and cook 15 minutes.",
    "Put a pot of water on to boil for the pasta.",
    "Remove about half of the bean mixture and blend until creamy (alternatively, if you have an immersion blender, stick it straight in the pot and blend about half of the sauce). If it has reduced too much and is looking too thick (like a dip rather than a soup), add some more water until it is like a creamy soup. Season with salt and pepper and keep warm while you boil the pasta.",
    "Cook the pasta in a pot of boiling water. Check the timing recommended on the package and take off roughly 2 minutes. Drain the pasta and add it to the beans and let it continue cooking another minute. Ladle into shallow bowls, pour over a drizzle of your very best extra-virgin olive oil, some extra freshly ground pepper, and then let it sit for a moment or two before serving (it needs to cool a little to be best enjoyed). Serve this pasta dish with a spoon."
  ],
  "ingredients": [
    "0",
    "3 tablespoons extra-virgin olive oil, plus more for drizzling",
    "1 small red onion, finely chopped",
    "1/2 celery stick, finely chopped",
    "1 small carrot, peeled and finely chopped",
    "2-3 slices of pancetta, cut into thin strips (optional)",
    "14 ounces (400 grams) cooked and drained borlotti beans (note that a regular size can normally holds 240 grams of beans)",
    "1/3 cup (80 ml) tomato puree (passata)",
    "1 cup (250 ml) water or vegetable or beef stock",
    "7 ounces (200 grams) short pasta such as ditalini"
  ],
  "__v": 1
}