{
  "hash": "57f4ecd2448c058ce3c307a5f117bda3f7daedd2",
  "title": "Spaghetti And Meatballs",
  "image": "",
  "href": "https://tasty.co/recipe/spaghetti-and-meatballs",
  "extension": "Chrome",
  "firstAdded": "2018-12-01T21:49:20.283000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 425°F (220°C). Set a wire rack over a baking sheet and grease with nonstick spray.",
    "Make the marinara sauce: Heat the olive oil in a large saucepan over medium heat. Add the onions and garlic and season with salt, pepper, and the red pepper flakes. Cook until soft and caramelized, about 15 minutes.",
    "Set aside ⅓ cup (50 G) of the cooked onions and garlic for the meatballs and let cool.",
    "Stir the tomato paste into the onions and cook until browned and aromatic, 3-5 minutes.",
    "Add the crushed tomatoes, dried basil, dried oregano, and dried parsley. Stir together and bring to a boil. Reduce the heat to low, cover, and simmer for at least 30 minutes.",
    "Make the meatballs: In a large bowl, combine the ground beef, ground pork, reserved onion and garlic mixture, bread crumbs, ricotta, parsley, eggs, Parmesan, milk, salt, and pepper. Mix with your hands until well combined.",
    "Shape about 2 (55 G) ounces of meat at a time into balls and set on the prepared wire rack.",
    "Bake the meatballs for 20 minutes, until the outsides are browned and the centers are tender and juicy and reach about 155˚F (68˚C).",
    "Bring a large pot of water to boil and add a generous pinch of salt. Cook the pasta according to the package instructions, 7-10 minutes, until al dente. Stir occasionally to keep the noodles from sticking together.",
    "Drain the pasta and add it directly to the simmering marinara sauce. Reserve some pasta water, in case you need it to loosen the sauce. Stir the pasta into the sauce until fully coated.",
    "Add the pasta to serving bowls, top with the meatballs, and garnish with Parmesan, fresh basil, and cracked pepper.",
    "Enjoy!"
  ],
  "ingredients": [
    "0",
    "MARINARA SAUCE",
    "¼ cup olive oil (60 mL)",
    "2 large yellow onions, chopped",
    "10 cloves garlic, minced",
    "kosher salt, to taste",
    "pepper, to taste",
    "½ teaspoon red pepper flakes",
    "12 oz tomato paste (340 g)",
    "56 oz crushed tomato, 2 cans (1.5 g)",
    "1 tablespoon dried basil",
    "1 tablespoon dried oregano",
    "1 tablespoon dried parsley",
    "MEATBALLS",
    "1 lb ground beef (455 g)",
    "1 lb ground pork (455 g)",
    "1 cup bread crumbs (115 g)",
    "½ cup ricotta cheese (125 g)",
    "¼ cup fresh parsley, chopped (10 g)",
    "2 large eggs, beaten",
    "½ cup grated parmesan cheese (55 g)",
    "¼ cup milk (60 mL)",
    "kosher salt, to taste",
    "black pepper, to taste",
    "FOR SERVING",
    "1 lb dried spathetti (455 g)",
    "fresh basil, chopped",
    "grated parmesan cheese, fresh"
  ],
  "__v": 1
}