{
  "hash": "11c2e3d64c213e5ecfe139324a63b586ab1bac02",
  "title": "Birkes – a Breakfast Roll (Pastry)",
  "image": "https://media.cheftap.com/wp-content/uploads/beckyrasmussen/540a310f-99c9-44df-bea3-3d4cf1ad43fa.png",
  "href": "https://cheftap.com/recipes/birkes-a-breakfast-roll-pastry/",
  "extension": "Chrome",
  "firstAdded": "2018-11-12T18:53:58.305000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large bowl mix the cold butter with the flour, sugar and salt until the butter is fully incorporated.",
    "Heat the milk until finger warm and dissolve the yeast in the milk. Add the warm milk to the flour and knead the dough for 5 minutes on the stand mixer, until the dough is smooth and elastic. Let the dough rise covered for about 30 minutes at room temperature.",
    "Gently ease the dough out onto a lightly floured surface. Roll the dough into a rectangle, the size is not important. Place thin slices of butter on ⅔ of the dough, leaving ⅓ bare. Fold the part without butter over half of the buttered dough, and fold the last ⅓ over like you are folding a letter. Like as in a puff pastry dough.",
    "Let the dough rest for about 10 minutes in the refrigerator, before rolling the dough to a thin rectangle again, and making another letter fold.",
    "Preheat the oven to 435℉ (225℃).",
    "Roll the now laminated dough a little longer, so you are able to get 12-15, 2-inch (5 cm) wide pieces. Gently place the birkes on a parchment lined baking sheet. Let the birkes rest 10 minutes covered.",
    "Brush the birkes with egg wash, and sprinkle with white poppy seeds, and bake them for 15-18 minutes. Cool the birkes for a little while, and serve them warm."
  ],
  "ingredients": [
    "0",
    "DOUGH:",
    "100 g butter, cold",
    "500 g all-purpose flour",
    "1 teaspoon salt",
    "2 tablespoons sugar",
    "50 g fresh compressed yeast (or 4 teaspoons dry yeast)",
    "300 ml milk",
    "FILLING:",
    "100-125 g butter",
    "Sprinkles:",
    "egg wash (1 egg +2 tablespoons milk)"
  ],
  "__v": 1
}