{
  "__v": 1,
  "directions": [
    "0",
    "Heat a pot large enough to hold the clams with your choice of oil. Sauté half the shallots (1/4 cup total), half the garlic (3 cloves), and half the amount of lemongrass over medium-low heat until fragrant, about 1 to 2 minutes.",
    "Turn heat to high then add water into the pot and bring to a boil.",
    "Once boiling, place the clams in the pot, lower heat to medium, cover, and simmer until their shells open, about 10 to 12 minutes.",
    "Discard any unopened ones. Spoon the cooked clams aside (do not remove meat from shell) in a large bowl. Set all of the broth aside in a separate bowl or measuring cup (so you know how much liquid you have left, ideally, at least 3 cups). Wipe the pot clean for the next use.",
    "Meanwhile, cook the potatoes separately. In another pot, bring salted water to a boil. Make sure the amount of water is just enough to cover the potatoes. Boil the potatoes until soft, about 30 minutes.",
    "While the potatoes are cooking, place the remaining shallots, garlic, lemongrass, and red Thai chilis either in a food processor or mortar and pestle. Grind until a thick paste forms. Add some clam water to thicken, if you wish.",
    "When the potatoes are done, drain, and set aside saving about 1 cup of potato water.",
    "In the clam pot that was wiped clean, heat your choice of oil over high heat. When hot, lower heat to medium and add the spice paste you just made and stir. Add the galanga (Thai ginger) and lime leaves, still stirring continuously to prevent the paste from burning.",
    "Lower heat to medium-low and add to the spice paste a splash or two of the coconut cream that floats on top of the can. Keep stirring.",
    "Add the potatoes, clam broth, and coconut milk, and simmer over medium heat for about 5 to 6 minutes.",
    "Using a hand blender or food processor, purée into a soup. To thicken soup, add more coconut milk. To thin it out, add the potato water.",
    "Garnish the soup with clams. Sprinkle with cilantro, chives, and chili."
  ],
  "firstAdded": "2014-07-20T18:57:26.784000",
  "hash": "7c82727d2789d2da2194358b06a8003f8b2cb817",
  "href": "http://www.tartineandapronstrings.com/2012/08/16/thai-clam-chowder-adventures-in-thailand/",
  "image": "http://www.tartineandapronstrings.com/wp-content/uploads/2012/08/IMG_9820-copy-wp1.jpg",
  "ingredients": [
    "0",
    "2.2 pounds (1 kg, about 20-25 pcs) littleneck clams or pasta clams, washed and scrubbed",
    "4 cups water",
    "1 pound (545 g) white potatoes, peeled and roughly diced",
    "1/2 cup (40 g) shallots, finely minced and divided",
    "6 cloves garlic, finely minced",
    "1 large stalk lemongrass, tough outer leaves remove, cut into thin rounds",
    "3 red Thai chilis, finely sliced (optional, but use at least one)",
    "1 2-inch piece of galanga (Thai ginger), unpeeled",
    "6 pieces fresh or frozen Kaffir lime leaves, scored, or strips of peel from one lime",
    "1/2 cup (125 ml) unsweetened coconut milk + more for thickening (do not stir the milk in the can)",
    "a handful of cilantro, finely chopped",
    "a few stalks of chives, snipped",
    "a few red Thai chilis, finely sliced"
  ],
  "keywords": [
    "pcs",
    "littleneck",
    "pasta",
    "clams",
    "washed",
    "scrubbed",
    "water",
    "white",
    "potatoes",
    "roughly",
    "shallots",
    "divided",
    "garlic",
    "stalk",
    "lemongrass",
    "tough",
    "outer",
    "leaves",
    "rounds",
    "red",
    "thai",
    "chilis",
    "use",
    "galanga",
    "ginger",
    "unpeeled",
    "pieces",
    "frozen",
    "kaffir",
    "scored",
    "strips",
    "peel",
    "lime",
    "coconut",
    "thickening",
    "stir",
    "milk",
    "cilantro",
    "stalks",
    "chives",
    "snipped"
  ],
  "title": "JenThai Clam Chowder",
  "users": [
    null
  ]
}