{
  "hash": "764466095771efcd042bf19e9ae0fab75e7194a1",
  "title": "JAMAICAN JERK SEASONING",
  "image": "http://i1.wp.com/69.195.124.98/~chefanst/wp-content/uploads/2011/03/jerk-seasoning-1.jpg?resize=500%2C330",
  "href": "http://www.chefandsteward.com/2011/03/24/chef-and-stewards-real-jamaican-jerk-seasoning-video-recipe/",
  "extension": "Chrome",
  "firstAdded": "2016-09-21T07:06:14.847000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Roast allspice and black peppercorns in a dry frying pan. Start from a cold frying pan and toss around until the pan starts to smoke then remove it from heat.",
    "Grind them in a spice grinder",
    "Combine with all other dry spices and set aside",
    "Pour oil in blender or food processor, as well as onions, thyme, garlic, ginger, scotch bonnet, and pulse until it purées. Add the dry spices and pulse until incorporated.",
    "Pour purée into a bowl and fold in scallion/green onions with a spatula or spoon.",
    "Will last in refrigerator for roughly 3-4 weeks in an air-tight container.",
    "Method for Jerking: Use seasoning to heavily coat chicken/meat and marinate for about 24 hours. Traditionally used with pork in Jamaica. You may also use less for fish and other seafood.",
    "When barbecuing on charcoal (best for the flavour), make certain coals are white before you begin. Put chicken on skin side down and remember to turn often and cook slowly because we do not want charred meat for dinner!",
    "Traditionally, after cooking, we chop into small pieces.",
    "CHEF’S NOTE: You do not want to blend the scallion/green onions because they will bitter the seasoning."
  ],
  "ingredients": [
    "0",
    "CHEF AND STEWARD’S REAL JAMAICAN JERK SEASONING (VIDEO & RECIPE)",
    "March 24, 2011 By chefandsteward 30 Comments",
    "100",
    "We have been asked so many times for a good recipe for Jerk seasoning that we had to give in. The video is shot in collaboration with dineoutemirates, a website that has lots of video reviews of restaurants in the UAE. Watch the video then see the recipe below. Here is how we do it fresh from our kitchen… may it bring the heat of the Caribbean to yours!",
    "5 medium-large onions",
    "4 cups chopped scallion/green onions",
    "8 stalks fresh thyme",
    "9 cloves of garlic",
    "¼ cup allspice berries/Jamaican peppercorns or 1 ½ tsp ground allspice",
    "2 scotch bonnet peppers /habaneros (without seeds to reduce heat)",
    "1 tbsp chopped ginger",
    "1 tbsp black peppercorns or 1 tsp ground black pepper",
    "½ tsp grated nutmeg",
    "½ tsp cinnamon",
    "1 tsp brown sugar",
    "1 ½ tsp salt",
    "½ cup cooking oil (a plain oil like sunflower or canola)"
  ],
  "__v": 1
}