{
  "hash": "bb7d767d6d2358cc829ad70abda4ad42f70b95d8",
  "title": "Sweet Potato Lefse",
  "image": "https://sheflewthecoopdotcom1.files.wordpress.com/2015/02/img_1450.jpg?w=1000&h=700&crop=1",
  "href": "http://sheflewthecoop.com/2015/01/18/aip-breads-sweet-potato-lefse/",
  "extension": "",
  "firstAdded": "2015-12-27T14:04:06.647000",
  "users": [
    null
  ],
  "keywords": [
    "cubed",
    "white",
    "potato",
    "arrowroot",
    "flour",
    "rolling",
    "coconut",
    "oil",
    "salt"
  ],
  "directions": [
    "0",
    "Boil sweet potato cubes until soft, drain in a sieve and let cool there so all moisture evaporates. Place sweet potatoes into a medium bowl and mash with a potato masher or fork until smooth. Add 3/4 cup arrowroot starch, 2 tbsp coconut flour, 3 tbsp oil, 1 tsp salt and stir until all ingredients are incorporated. Let this batter sit for 10 minutes, this allows the arrowroot and coconut to absorb moisture (but not longer because the batter will break down and be more difficult to work with).",
    "When you are ready to roll out breads add 1/4 more arrowroot flour to batter and flour your work surface. Scoop out a large tablespoon of batter roll it into a ball then pat it flat on your floured surface and roll it out to a 1/4 inch thick round with your rolling pin (sorry folks, I have no photos of process other the top one) making sure the lefse doesn’t stick to the rolling pin or work surface (I carefully use a bench scraper to lift it from my marble to the skillet). Heat a cast iron skillet or a non-stick pan over medium heat, add a little coconut oil, once hot add the lefse and cook a couple minutes per side, flipping when the bread seems to loosen around the edges (like a pancake, these really are a kind of crepe). While this is cooking you can quickly roll out another, remembering to flour your work surface and rolling pin. Take the cooked lefse off the skillet, set aside and start again. This is time consuming but pretty easy, and more fun if someone is helping you (*especially if you want to double this! wait until the whole first batch is finished cooking before mixing dry ingredients into second batch of sweet potato)."
  ],
  "ingredients": [
    "0",
    "2 cups cooked cubed WHITE sweet potato, from one large",
    "1 cup arrowroot flour * plus more for rolling",
    "2 tbsp coconut flour",
    "3 tbsp coconut oil",
    "1 tsp salt"
  ],
  "__v": 1
}