{
  "hash": "c0fe071d132bd11097a7887f59c1c8827852b2bb",
  "title": "Parmigiana di melanzane",
  "image": "http://www.giallozafferano.it/images/ricette/174/17464/foto_hd/hd450x300.jpg",
  "href": "http://ricette.giallozafferano.it/Parmigiana-di-melanzane.html",
  "extension": "Chrome",
  "firstAdded": "2017-08-16T11:20:26.759000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Per preparare la parmigiana di melanzane cominciate lavando e asciugando queste ultime (. Poi con un coltello eliminate il picciolo (2) e affettate per il senso della lunghezza con l’aiuto di una mandolina, in alternativa con il coltello, per ottenere delle fette spesse 4-5 mm (3).",
    "Man mano disponete le fette all’interno di uno scolapasta e cospargete con un pò di sale grosso; continuate così fino ad ultimare il tutto (4). Sulla sommità delle melanzane sistemate un piatto con un peso, così le melanzane potranno spurgare dell’acqua di vegetazione che è amarognola ed è nemica del fritto. Lasciate così per almeno 1 ora. Nel frattempo affettate e tagliate a listarelle il fior di latte, dopodiché ottenete dei cubetti piccolissimi. Mettete a scolare anche questi, se non avete un altro scolapasta potrete disporli su un canovaccio pulitissimo (5). Nel frattempo occupatevi del sugo. In una larga casseruola versate un filo d’olio extravergine d’oliva e unite la cipolla tritata, mescolate spesso per non farla bruciare e lasciatela rosolare per un paio di minuti (6).",
    "Poi unite la passata di pomodoro (7) e aggiungete anche un po’ d’acqua, regolate di sale (8) e lasciate cuocere a fuoco dolce per 45 minuti. A fine cottura non dimenticate di aggiungere le foglioline di basilico spezzettandole a mano (9).",
    "Mettete a scaldare abbondante olio di semi e intanto sciacquate la porzione di melanzane che friggerete (10) e asciugatela con carta assorbente: procedete sempre un po’ alla volta così non scuriranno (11). Nell'olio bollente a 170° immergete poche fette alla volta (12)",
    "e dopo 2-3 minuti di cottura scolate su carta assorbente (13); procedete così con tutte le altre. A questo punto dovreste avere tutto quello che vi occorre, quindi passate alla composizione. Sporcate con un po’ di sugo una pirofila da 20x30cm (14), poi formate il primo strato disponendo le fette di melanzane in orizzontale (1.",
    "Grattugiate un po’ di pepe nero, spolverizzate con del parmigiano (1e versate dei cubetti di fior di latte distribuendoli uniformemente (17). E infine versate ancora un po’ di sugo, giusto il necessario per colorire l’interno (18).",
    "Ripetete lo stesso procedimento stavolta sistemando le melanzane in senso verticale (19); continuate in questo modo a formare gli strati invertendo ogni volta il senso delle melenzane (20). Tra uno strato e l’altro, ricordate di pigiare delicatamente con i palmi delle mani così da compattarli. Sull’ultimo strato versate la restante passata di pomodoro (21),",
    "i cubetti di fior di latte ed il parmigiano (22). È arrivato il momento di cuocere la vostra parmigiana di melanzane in forno caldo a 200° per 40 minuti (23). Una volta pronta lasciatela assestare qualche minuto prima di servirla (24).",
    "Conservazione",
    "Conservate la parmigiana di melanzane in frigorifero coperta con pellicola trasparente per 1-2 giorni. Si può congelare cotta, magari già divisa in porzioni, e scongelare in frigorifero all'occorrenza prima di scaldarla.",
    "Consiglio",
    "La scelta delle melanzane è un vero e proprio rito. Ne esistono di ogni tipo, ma quelle perfette per questa ricetta sono grandi, ovali, di un bel viola scuro e lucido e, al tatto, devono risultare sode – né troppo dure né troppo molli. Ma anche quelle lunghe napoletane vanno bene. Per quanto riguarda le varianti: c’è chi le melanzane le infarina o le passa nelle uova, oppure fa entrambe le cose.",
    "Per la scelta dei formaggi invece potete optare per del caciocavallo, come si fa in Sicilia, o in Calabria. Qualcuno inoltre potrebbe voler fare una deliziosa aggiunta come le uova sode a fette.",
    "Per chi fosse a dieta a un primo sguardo sembrerebbe non esserci speranza, eppure un’alternativa c’è: la parmigiana di melanzane grigliate, gustosa e sicuramente più light."
  ],
  "ingredients": [
    "0",
    "Melanzane ovali nere 1,5 kg Passata di pomodoro 1,4 l Fiordilatte 500 g Parmigiano reggiano 150 g Cipolle dorate ½ Olio extravergine d'oliva q.b. Pepe nero q.b. Basilico qualche foglia Sale fino q.b. Olio di semi di arachide per friggere le melanzane q.b. Sale grosso per spurgare le melanzane 35 g"
  ],
  "__v": 1
}