{
  "hash": "4f36a29c1f32a9fc6faad55c6e3888aefe2bda8b",
  "title": "GIANT BBQ SANDWICH",
  "image": "https://img.buzzfeed.com/buzzfeed-static/static/2017-06/1/13/asset/buzzfeed-prod-fastlane-02/sub-buzz-27719-1496339467-2.jpg?downsize=715:*&output-format=auto&output-quality=auto",
  "href": "https://www.buzzfeed.com/alvinzhou/this-giant-bbq-sandwich-is-everything-youve-ever-wanted-in?utm_term=.da8Kkd19P",
  "extension": "",
  "firstAdded": "2017-06-05T03:44:04.784000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Servings: 8",
    "PREPARATION",
    "1. Preheat oven to 300°F/150°C.",
    "2. Lay the ribs on a long sheet of aluminum foil.",
    "3. Combine the dry rub ingredients in a small bowl, then cover the ribs evenly on both sides, making sure to press the rub into any cracks and smooth out any large lumps.",
    "4. Wrap the foil around the ribs, making sure they’re completely sealed. Use additional sheets if necessary. It’s important that the juices of the ribs stay inside the foil to keep the ribs moist during cooking.",
    "5. Bake the ribs for 3 to 3½ hours, until tender.",
    "6. Unwrap the ribs carefully, then wiggle the bones out slowly. If you’re having trouble removing the bones, use a knife to make small cuts to help their removal.",
    "7. Combine the glaze ingredients in a bowl and brush both sides of the deboned slab of ribs generously, being sure to carefully handle the ribs since they’re super tender.",
    "8. Broil the ribs for about 5 minutes until the glaze is bubbling and starting to brown. Set aside.",
    "9. Slice the bread in half into the thickness of your choice, then butter both sides of the bread. Sprinkle sesame seeds on top, then toast your bread by broiling it for a few minutes. Keep a careful eye on it as it will burn extremely quickly.",
    "10. With two long spatulas or knives, carefully transfer the glazed ribs to the bread, then top with onions, parsley, and the top bun.",
    "11. Slice into about 2-inch sandwiches, and serve!"
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1 rack baby back ribs, membrane removed (this is essential for de-boning)",
    "Dry Rub",
    "2 tablespoons paprika",
    "1 tablespoon pepper",
    "2 tablespoons brown sugar",
    "2 teaspoons salt",
    "1 teaspoons garlic powder",
    "1 teaspoons onion powder",
    "1 teaspoons cumin",
    "1 teaspoons chili powder",
    "Glaze",
    "1 cup barbecue sauce",
    "¼ cup honey",
    "1 large loaf bread",
    "¼ cup melted butter",
    "1 tablespoon sesame seeds",
    "2 large onions, sautéed or caramelized",
    "2 tablespoons parsley, chopped",
    "Pickles",
    "White onion slices"
  ],
  "__v": 1
}