{
  "hash": "c0d8aa5368165956ac8c5113f8be5c291f4d372f",
  "title": "CINNAMON BUN COOKIES",
  "image": "",
  "href": "https://www.recipegirl.com/cinnamon-bun-cookies/",
  "extension": "Chrome",
  "firstAdded": "2018-09-09T14:16:43.782000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS:",
    "1. Prepare dough: In a medium-sized mixing bowl, cream together the sugar, butter, salt and vanilla. Add the flour, stirring until the dough comes together. Flatten the dough into a disk, wrap it in plastic wrap, and refrigerate until you're ready to use it.",
    "2. Roll the dough: Transfer chilled dough to a lightly floured piece of parchment or waxed paper. Roll it into a 9x12-inch rectangle. In a small bowl, whisk together egg white and water until foamy. Brush onto rolled out dough. In another small bowl, whisk together sugar and cinnamon. Sprinkle it evenly over the dough. Starting with a long edge, carefully roll the dough into a log, sealing the edge (if dough sticks to parchment, gently use a metal spatula to guide it off of the paper). Wrap in plastic wrap or parchment, and freeze until firm.",
    "3. Bake the cookies: Preheat oven to 350°F. Lightly grease (or line with parchment) two cookie sheets. Remove the dough from the freezer and unwrap it. Using a sharp knife, gently cut it into 1/2-inch slices. Transfer them to the prepared baking sheets. Bake the cookies for 12 to 15 minutes, until they're a light golden brown. Remove them from the oven and transfer to a rack to cool.",
    "4. Ice the cookies: Sift or strain the powdered sugar into a medium-sized bowl to remove any lumps. Whisk the cream into the sugar to make a smooth icing. Drizzle or spread icing onto cookies (or serve alongside in a bowl for dipping)."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS:",
    "VANILLA COOKIE DOUGH",
    "1/2 cup powdered sugar",
    "3/4 cup unsalted butter",
    "1/2 teaspoon salt",
    "1 1/2 teaspoons vanilla extract",
    "1 1/2 cups all purpose flour",
    "MIDDLE:",
    "1 large egg white",
    "1 Tablespoon water",
    "1/4 cup granulated white sugar",
    "1 1/2 teaspoons ground cinnamon",
    "ICING:",
    "1/2 cup powdered sugar",
    "2 Tablespoons heavy whipping cream",
    "1/2 teaspoon vanilla extract",
    "1/2 teaspoon ground cinnamon"
  ],
  "__v": 1
}