{
  "hash": "ca8abed3be29430eb7419d59e570535e1df9c7bd",
  "title": "Spicy Quinoa, Cucumber and Tomato Salad",
  "image": "http://www.nytimes.com/2010/07/13/health/nutrition/",
  "href": "http://www.nytimes.com/2010/07/13/health/nutrition/13recipehealth.html?_r=0#518988dca8b2b1000000000e",
  "keywords": [
    "quinoa",
    "water",
    "salt",
    "cucumber",
    "red",
    "onion",
    "tomatoes",
    "jalapeo",
    "serrano",
    "peppers",
    "seeded",
    "desired",
    "cilantro",
    "sprigs",
    "lime",
    "juice",
    "wine",
    "sherry",
    "vinegar",
    "extra",
    "virgin",
    "olive",
    "oil"
  ],
  "directions": [
    "0",
    "1 avocado, sliced, for garnish",
    "1. Place the quinoa in a bowl, and cover with cold water. Let sit for five minutes. Drain through a strainer, and rinse until the water runs clear. Bring the 3 cups water to a boil in a medium saucepan. Add salt (1/2 to 3/4 teaspoon) and the quinoa. Bring back to a boil, and reduce the heat to low. Cover and simmer 15 minutes or until the quinoa is tender and translucent; each grain should have a little thread. Drain off the water in the pan through a strainer, and return the quinoa to the pan. Cover the pan with a clean dishtowel, replace the lid and allow to sit for 10 minutes. If making for the freezer, uncover and allow to cool, then place in plastic bags. Flatten the bags and seal.",
    "2. Meanwhile, place the finely diced cucumber in a colander, and sprinkle with salt. Toss and allow to sit for 15 minutes. Rinse the cucumber with cold water, and drain on paper towels. If using the onion, place in a bowl and cover with cold water. Let sit for five minutes, then drain, rinse with cold water and drain on paper towels.",
    "3. Combine the tomatoes, chiles, cilantro, vinegar, lime juice and olive oil in a bowl. Add the cucumber and onion, season to taste with salt, and add the quinoa and cilantro. Toss together, and taste and adjust seasonings. Serve garnished with sliced avocado and cilantro sprigs.",
    "Yield: Serves six."
  ],
  "ingredients": [
    "0",
    "1 cup quinoa",
    "3 cups water",
    "Salt to taste",
    "2 cups diced cucumber",
    "1 small red onion, finely minced (optional)",
    "2 cups finely diced tomatoes",
    "1 to 2 jalapeño or serrano peppers (to taste), seeded if desired and finely chopped",
    "1/2 cup chopped cilantro, plus several sprigs for garnish",
    "2 tablespoons fresh lime juice",
    "1 tablespoon red wine vinegar or sherry vinegar",
    "3 tablespoons extra virgin olive oil"
  ],
  "__v": 0
}