{
  "hash": "6445fcb2cf48448fcd2318320f7cca9ca45df15a",
  "title": "Loaded Baked Potato Soup",
  "image": "https://search.chow.com/thumbnail/1200/0/www.chowstatic.com/assets/2013/09/30857_RecipeImage_620x413_loaded_baked_potato_soup.jpg",
  "href": "https://www.chowhound.com/recipes/loaded-baked-potato-soup-30857",
  "extension": "",
  "firstAdded": "2019-01-02T00:49:15.761000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Melt the butter in a large, heavy-bottomed saucepan or Dutch oven over medium heat until foaming. Add the bacon and cook, stirring occasionally, until browned and crisp, about 8 to 10 minutes. Remove with a slotted spoon to a small paper-towel-lined plate and set aside.",
    "Add the onion to the bacon fat, stir to coat, and cook, stirring occasionally, until softened, about 5 minutes. Increase the heat to high, add the broth or stock, scrape up any browned bits from the bottom of the pot, and bring to a boil. Add the milk, measured salt, and measured pepper and stir to combine. Add the potatoes and bring to a simmer. Reduce the heat to medium low and continue to simmer, stirring occasionally, until the potatoes are just cooked through, about 10 minutes.",
    "Using a blender, purée the soup in batches until smooth, removing the small cap from the blender lid (the pour lid) and covering the space with a kitchen towel (this allows steam to escape and prevents the lid from popping off). Alternatively, use an immersion blender.",
    "Return the soup to the pot and place it over low heat. Add the measured cheese and stir until melted and evenly combined. Remove from the heat and whisk in the measured sour cream. Taste and season with salt and pepper as needed. Ladle into bowls and garnish with the reserved bacon, chives or scallions, and additional cheese and sour cream."
  ],
  "ingredients": [
    "0",
    "1 tablespoon unsalted butter",
    "4 thick-cut bacon slices (about 7 ounces), small dice",
    "1 medium yellow onion, small dice",
    "1 cup low-sodium chicken broth or stock",
    "4 cups (1 quart) whole milk",
    "1 tablespoon kosher salt, plus more as needed",
    "1/2 teaspoon freshly ground black pepper, plus more as needed",
    "2 pounds russet potatoes, peeled and cut into 1-inch chunks",
    "1 1/2 cups shredded sharp cheddar cheese (about 4 ounces), plus more for serving",
    "1/4 cup sour cream, plus more for serving",
    "Finely chopped fresh chives or thinly sliced scallions, for serving"
  ],
  "__v": 1
}