{
  "__v": 1,
  "directions": [
    "0",
    "Spread Parmesan cheese in a shallow dish. Beat eggs with 1 tablespoon vegetable oil in another shallow dish. Spread bread crumbs in a third shallow dish.",
    "Pat the pork chops dry with paper towels. Combine salt, pepper, sage, and thyme, and sprinkle generously over both sides of chops, pressing seasonings into meat with your fingers. Bread pork chops one at a time. Dredge seasoned chops in Parmesan cheese, coating both sides completely, patting to adhere. Then, using tongs, carefully dip both sides of chops in egg mixture, letting excess drip back into dish to ensure thin coating. Finally, dip both sides of chops in bread crumbs, pressing crumbs with fingers to form an even, cohesive coating. Place breaded chops on wire rack set over baking sheet, allow coating to dry for about 5 minutes. (The recipe can be done ahead to this point; cover chops loosely with wax paper and refrigerate for up to one hour.)",
    "Heat a large heavy-bottomed skillet over medium-low heat with enough olive oil to come halfway up the sides of the chops, about 1/4 cup. To flavor oil; stir in garlic, and cook until lightly browned. Remove garlic from skillet and discard or reserve for other uses. Increase heat to medium. When oil shimmers, add chops and fry 4 to 5 minutes on each side, until golden brown and crispy, or to an internal temperature between 150 and 160 degrees F. Drain on rack set over baking sheet, then transfer to a warm serving platter. Serve with lemon wedges and garnish with parsley sprigs."
  ],
  "firstAdded": "2014-11-18T04:57:21.473000",
  "hash": "bb1e8c29ac875267456953a2182f9b73c3081dbb",
  "href": "http://www.bigoven.com/recipe/garlic-parmesan-crusted-pork-chops/164785",
  "image": "http://mda.bigoven.com/pics/rs/256/garlic-parmesan-crusted-pork-chops-14.jpg",
  "ingredients": [
    "0",
    "4 1/2-inch thick Center-cut loin pork chops; (bone-in or boneless)",
    "3/4 teaspoon Salt",
    "1/2 teaspoon Black Pepper",
    "1/2 teaspoon Dried rubbed sage",
    "1/2 teaspoon Dried thyme",
    "3/4 cups Parmesan cheese; freshly grated",
    "2 large Eggs",
    "1 tablespoon Vegetable oil",
    "1 cup Dried seasoned bread crumbs; (I use Progresso garlic and herb)",
    "Olive oil; (for shallow frying)",
    "4 large cloves Garlic; peeled and chopped",
    "Lemon wedges; for serving",
    "Parsley sprigs; to garnish"
  ],
  "keywords": [
    "centercut",
    "loin",
    "pork",
    "chops",
    "bonein",
    "boneless",
    "salt",
    "black",
    "pepper",
    "rubbed",
    "sage",
    "thyme",
    "parmesan",
    "cheese",
    "eggs",
    "oil",
    "bread",
    "crumbs",
    "use",
    "progresso",
    "garlic",
    "herb",
    "olive",
    "shallow",
    "frying",
    "lemon",
    "wedges",
    "parsley",
    "sprigs"
  ],
  "title": "Garlic - Parmesan Crusted Pork Chops",
  "users": [
    null
  ]
}