{
  "hash": "47a3c94d20c41ef4780dd0eb4cc3a4b16cb90aef",
  "title": "Cinnabons Cinnamon Rolls",
  "image": "http://www.jocooks.com/wp-content/uploads/2012/09/cinnabon-cinnamon-rolls.jpg",
  "href": "http://www.jocooks.com/bakery/breads/cinnabons-cinnamon-rolls/",
  "extension": "Firefox",
  "firstAdded": "2015-08-05T13:47:16.860000",
  "users": [
    null
  ],
  "keywords": [
    "active",
    "dry",
    "yeast",
    "milk",
    "granulated",
    "sugar",
    "margarine",
    "used",
    "softened",
    "butter",
    "salt",
    "eggs",
    "flour",
    "brown",
    "cinnamon",
    "cream",
    "cheese",
    "vanilla"
  ],
  "directions": [
    "0",
    "For the rolls, dissolve the yeast in the warm milk in a large bowl.",
    "Add sugar, butter, salt, eggs, and flour to the bowl of a mixer and mix well.",
    "Pour the milk/yeast mixture in the bowl and using the dough hook, mix well until well incorporated.",
    "Place dough into an oiled bowl, cover and let rise in a warm place about 1 hour or until the dough has doubled in size.",
    "Roll the dough out on a lightly floured surface, until it is approx 16 inches long by 12 inches wide. It should be approx ¼ inch thick.",
    "Preheat oven to 350 F degrees. Grease a 9x13 inch baking pan.",
    "To make filling, combine the butter, brown sugar, margarine and cinnamon in a bowl.",
    "Spread the mixture evenly over the surface of the dough. Alternatively you can spread the butter first on the dough and then the brown sugar and cinnamon mixture.",
    "Working carefully, from the long edge, roll the dough down to the bottom edge. The roll should be about 18 inches in length. Cut the roll into 1½ inch slices. You might find it easier if you use a piece of floss vs a knife.",
    "Place the cut rolls in the prepared pan. Cover them with a damp towel. Let them rise again for another 30 minutes until they double in size.",
    "Bake for 20 minutes or until light golden brown. Cooking time can vary greatly!",
    "While the rolls are baking make the icing but mixing all ingredients and beat well with an electric mixer until fluffy.",
    "When the rolls are done, spread generously with icing."
  ],
  "ingredients": [
    "0",
    "1 (1/4 ounce) package active dry yeast",
    "1 cup warm milk",
    "½ cup granulated sugar",
    "⅓ cup margarine (I used softened butter)",
    "1 tsp salt",
    "2 eggs",
    "4 cups flour",
    "1",
    "1 cup packed brown sugar",
    "3 tbsp cinnamon",
    "⅓ cup margarine, softened",
    "2",
    "6 tbsp margarine (I used butter)",
    "1½ cups powdered sugar",
    "¼ cup cream cheese",
    "½ tsp vanilla",
    "⅛ tsp salt"
  ],
  "__v": 1
}