{
  "hash": "1672f6dfe48e1042d26aa9b14f0be0c94b5db47e",
  "title": "My Ginger Garlic Kitchenmegan",
  "image": "http://lifemadesweeter.com/wp-content/uploads/Fried-Rice-makes-the-perfect-easy-weeknight-dish-and-way-better-than-takeout-13-e1472596600443.jpg",
  "href": "http://lifemadesweeter.com/2016/09/perfect-fried-rice/",
  "extension": "Chrome",
  "firstAdded": "2016-09-14T01:16:32.216000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat 1 tablespoon of cooking oil on high heat in a non-stick wok or pan until smoky hot. Toss in the mixed vegetables and sauté for about 10 seconds.Add garlic and stir-fry for another minute.",
    "Push all the ingredients to one side of the pan and pour in the beaten eggs. Scramble into small pieces until cooked. (Add in cooked meat if using and saute for another minute).",
    "Stir in the rice and break up any large chunks with a spatula while tossing until heated through, around 2 minutes.",
    "Drizzle in soy sauce, fish sauce, mirin and sesame oil, tossing to combine everything evenly. Keep stirring the fried rice until slightly toasted, about 2 minutes. Add salt, black pepper, red chili flakes or even Sriracha to taste.",
    "Transfer to bowls and serve hot and garnish with green onions and sesame seeds, if desired."
  ],
  "ingredients": [
    "0",
    "3 garlic cloves, finely minced",
    "1 cup mixed vegetables (fresh or frozen (thawed first))",
    "2 large eggs, lightly beaten",
    "3 1/2 cups cooked, day-old rice, chilled and clumps separated",
    "2 tbsp low sodium soy sauce",
    "1 1/2 tsp fish sauce (or vegan fysh sauce)",
    "1 tsp Mirin (Shaoxing wine or dry sherry can also be used in a pinch)",
    "¼ tsp sesame oil",
    "Salt, black pepper, to taste",
    "Cooked beef, chicken or pork (leave out for meatless version)",
    "Optional",
    "1/4 teaspoon minced ginger",
    "1/4 cup finely diced onions",
    "Sriracha or crushed red pepper flakes",
    "1 green onion, thinly sliced",
    "Roasted cashews",
    "Sesame seeds, for garnish"
  ],
  "__v": 1
}