{
  "hash": "ec245ecc2a331f72139f662ce2f74a140a303194",
  "title": "Angela (Oh She Glows)",
  "image": "http://cdn.ohsheglows.com/wp-content/uploads/2013/09/soup.jpg",
  "href": "http://ohsheglows.com/2013/09/25/luxurious-7-vegetable-and-cheese-soup/",
  "extension": "Chrome",
  "firstAdded": "2016-02-06T15:41:24.967000",
  "users": [
    null
  ],
  "keywords": [
    "extra",
    "virgin",
    "olive",
    "oil",
    "onion",
    "garlic",
    "celery",
    "stalks",
    "heaping",
    "carrots",
    "florets",
    "bunch",
    "broccoli",
    "potato",
    "seeded",
    "delicata",
    "squash",
    "broth",
    "nutritional",
    "yeast",
    "cayenne",
    "pepper",
    "cinnamon",
    "used",
    "salt",
    "pepita",
    "seeds",
    "smoked",
    "paprika",
    "bread"
  ],
  "directions": [
    "0",
    "Grab a very large pot (about 6.5 qt) with a lid and set aside.",
    "Add the onion and garlic with the oil into the pot and saute over medium heat for a few minutes. Season with a couple pinches of salt and pepper.",
    "Add the celery, carrots, broccoli, sweet potato, and squash, one by one, as you chop them. Continue to saute over medium heat, stirring every once and a while so it doesn't stick to the bottom.",
    "Cover the pot with a lid and cook the vegetables for 4-5 minutes, reducing heat if necessary.",
    "Remove lid and stir in the broth. Bring the soup to a low boil. Reduce heat to low/medium and cover with lid. Simmer for 10-15 minutes, until the squash and potato are fork tender.",
    "Turn off heat and remove lid. Allow the soup to cool slightly for at least 10-20 minutes. After cooling, carefully scoop the soup into a blender (you'll have to do this in a few batches) and add in the nutritional yeast, optional cayenne, and cinnamon. Carefully blend the mixture with the lid ajar (to allow heat to escape) starting at a low speed and increasing the speed until smooth. Season with salt and pepper. Transfer pureed soup into another bowl or jar and repeat this step for the remaining soup.",
    "Pour all of the pureed soup back into the original pot and stir to combine the seasonings. Adjust salt and pepper to taste.",
    "Ladle into bowls. Garnish with toasted pumpkin or Pepita seeds and a sprinkle of cinnamon or smoked paprika. Serve with toasted bread or croutons.",
    "Transfer leftovers into jars and allow to cool before securing the lid and placing in the fridge. It should stay fresh for a week in the fridge and it can probably be frozen too."
  ],
  "ingredients": [
    "0",
    "1 tablespoon extra virgin olive oil",
    "2-3 cups chopped sweet onion (from 1 large onion)",
    "3 large garlic cloves, minced",
    "1 cup chopped celery (from 2-3 stalks)",
    "1 heaping cup peeled and chopped carrots (from 2 small carrots)",
    "6 packed cups broccoli florets (from 1 large bunch broccoli)",
    "2 cups peeled and chopped sweet potato (from 1 small sweet potato, about 320 g)",
    "1.5-2 cups seeded and chopped Delicata squash (from 1 very small squash about 275 g)",
    "6 cups vegetable broth",
    "5 tablespoons nutritional yeast",
    "1/4 teaspoon cayenne pepper (optional)",
    "1/4 teaspoon cinnamon (optional)",
    "Salt and pepper, to taste (I used about 1 teaspoon salt)",
    "For serving: toasted Pepita seeds, a pinch of cinnamon or smoked paprika, and toasted bread"
  ],
  "__v": 1
}