{
  "hash": "963f788b9cfe2dab31c3dc7e15c6821c26c0e044",
  "title": "Pressure Cooker Chicken Curry",
  "image": "http://cdn.mariasmenu.com/wp-content/uploads/Pressure-Cooker-Chicken-Curry.png",
  "href": "http://mariasmenu.com/spicy/pressure-cooker-chicken-curry/2",
  "extension": "Chrome",
  "firstAdded": "2016-09-26T07:07:23.112000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Grind together ingredients listed from chopped ginger & garlic - vinegar with 2 tbsp water, to a smooth paste.",
    "Marinate cleaned chicken pieces with this ground paste and keep aside.",
    "Heat oil in a pressure cooker. Add sliced onion and cook till it turns golden brown. Add marinated chicken pieces and mix well. Cook on med-high flame for 2-3 mins, till chicken starts changing colour. Add thin coconut milk / water and mix well. Bring to boil. Cover and put the weight on.",
    "Cook on full flame till the first whistle comes. Reduce the flame to lowest and cook for 8-10 mins. Switch off the flame. Keep the cooker closed till the pressure drops naturally, 10-15 mins.",
    "Open the cooker and mix well. Dont worry, if the gravy looks separated (if using coconut milk), it will be ok, after you mix it.",
    "If you want a thicker gravy, continue to cook on low-medium flame,without covering. Once the gravy reaches your desired consistency, switch off the gas and add tadka.",
    "For tadka, heat oil in a small pan and crackle the mustard seeds. Add sliced small onion and curry leaves. Fry till it becomes golden brown. Add it to the curry.",
    "Let the curry rest for half an hour for the flavour to settle in.",
    "Serve with Rice, Roti, Appam, Idiyappam, Puttu etc;"
  ],
  "ingredients": [
    "0",
    "Chicken - 850 gms (measured after cleaning)",
    "Chopped ginger & garlic - 1 -1.5 tbsp, each",
    "Turmeric powder - ½ tsp",
    "Chilli powder - 2 tsp",
    "Coriander powder - 3 tsp",
    "Whole black pepper - ½ - 1 tsp",
    "Fennel seeds - 1 tsp",
    "Cardamom seeds - 3",
    "Cinnamon - a small piece",
    "Cloves - 4",
    "Vinegar - 1 tbsp",
    "Onion - 3 medium, sliced",
    "Thin coconut milk / water - 1 - 1.25 cups",
    "Mustard seeds - ½ tsp",
    "Small onion / shallots - 5, sliced",
    "Oil - I used coconut oil",
    "Salt",
    "Curry leaves"
  ],
  "__v": 1
}