{
  "hash": "b5a8434687ede6b4c1262756ba4dbd05530270f2",
  "title": "Stove Top Stuffing",
  "image": "http://cdn2.savoryreviews.com/wp-content/uploads/2011/10/hss9-476x320.jpg?70ca00",
  "href": "http://www.savoryreviews.com/2011/10/12/homemade-stove-top-stuffing/",
  "extension": "Chrome",
  "firstAdded": "2015-12-25T01:43:04.648000",
  "users": [
    null
  ],
  "keywords": [
    "slices",
    "store",
    "bought",
    "plain",
    "bread",
    "cubes",
    "croutons",
    "tbs",
    "unsalted",
    "butter",
    "stalk",
    "celery",
    "onion",
    "garlic",
    "parsley",
    "sage",
    "marjoram",
    "pepper",
    "kosher",
    "salt",
    "chicken",
    "stock"
  ],
  "directions": [
    "0",
    "If using store bought breadcrumbs skip to the making the stuffing steps below, if you are making your own bread cubes follow all of the directions below.",
    "1",
    "Preheat the oven to 350 degrees. Place the bread evenly on a sheet pan and toast in the oven for 8-10 minutes or until golden brown.",
    "Then flip the bread slices and toast until the other side is golden brown, roughly 6 minutes more.",
    "Remove the toasted bread from the pan and dice into ¼ -1/2 inch cubes and set aside.",
    "2",
    "Dice the celery and onion and portion out the remaining ingredients so that you have them on hand. I portioned them out into individual cups for aesthetic reasons, but you can portion them into a single bowl to save on cleaning.",
    "In a large sauce pan, melt the butter and kosher salt over medium heat.",
    "Add the celery, onion and garlic and cook until the veggies are softened and the onion starts to become translucent. Roughly 5 minutes.",
    "Add the herbs, spices and chicken stock to the mix and stir. Bring to a boil.",
    "Once the mixture hits a rolling boil, add the bread cubes. Quickly mix in the cubes to the liquid and then cover.",
    "Remove from the heat and let the pan sit for 5 minutes. Using a fork fluff the mixture and serve.",
    "Although this took about 15 minutes longer to make than the box stuff it was delicious and had a more homemade feel. Heck, it was homemade."
  ],
  "ingredients": [
    "0",
    "8 slices of bread or (2½ cups store bought dried plain bread cubes or croutons)",
    "3 tbs unsalted butter",
    "1 stalk celery, chopped",
    "1 small onion, finely chopped",
    "2 cloves garlic, minced",
    "1 tbs dried parsley or 2 tbs fresh parsley",
    "½ tsp sage",
    "¼ tsp marjoram",
    "⅛ tsp pepper",
    "¼ tsp kosher salt",
    "1¼ cups chicken stock"
  ],
  "__v": 1
}