{
  "hash": "daf45912f6c4940dddf880d8ad1ba7b195f5122e",
  "title": "Receta de Croque Monsieur, cremoso sándwich extracrujiente",
  "image": "http://i.blogs.es/e5eb1f/650_1000_receta-croque-monsieur-1/650_1200.jpg",
  "href": "http://www.trendenciaslifestyle.com/recetas/receta-de-croque-monsieur-cremoso-sandwich-extracrujiente",
  "extension": "Chrome",
  "firstAdded": "2015-07-20T12:29:04.791000",
  "users": [
    null
  ],
  "keywords": [
    "para",
    "bocadillo",
    "gruyer",
    "rebanadas",
    "pan",
    "rstico",
    "lonchas",
    "jamn",
    "cocido",
    "huevo",
    "pequeo",
    "batido",
    "mantequilla",
    "sin",
    "sal",
    "cucharadas",
    "mostaza",
    "dijon",
    "gramos",
    "queso",
    "parmesano",
    "rallado",
    "salsa",
    "bechamel",
    "cucharadita",
    "aceite",
    "oliva",
    "virgen",
    "extra",
    "cucharada",
    "harina",
    "todo",
    "tipo",
    "uso",
    "leche",
    "pizca",
    "tomillo",
    "fresco",
    "pimienta",
    "recin",
    "molida"
  ],
  "directions": [
    "0",
    "Primero nos pondremos con la salsa bechamel, derretimos la mantequilla en una sartén pequeña a fuego medio, añadimos el aceite y doramos la harina un minuto sin dejar de remover. Vertimos la leche poco a poco sin parar de remover.",
    "Remueva la salsa hasta que empiece a espesarse, cuando empiece a hacer chup chup, déjala cinco minutos más sin parar de remover y le añadimos el tomillo, la pimienta y la sal. Resérvala para el final del plato.",
    "Continuamos con el sándwich, para empezar untamos por la parte inferior las cuatro rebanadas de pan con la mostaza, seguidamente esparcimos la mitad del queso rallado sobre dos de las rebanadas de pan, luego añadimos una loncha de jamón cocido y acabamos de añadir el resto del queso, y tapamos el sándwich con las otras dos rebanadas de pan, presionando.",
    "Precalentamos el gratinador al máximo y mientras batiremos el huevo en un plato hondo en el que mojaremos los dos sándwiches, hasta que queden bien empapados. Derretimos la mantequilla en una sartén y doraremos los sándwiches hasta que el queso se funda y el pan esté dorado por ambos lados.",
    "Pondremos los sándwiches en una fuente y vertiremos por encima la bechamel que habíamos reservado y el queso parmesano rallado, los dejaremos gratinar a 10 cm de la fuente de calor alrededor de unos 10 minutos, o hasta que se doren."
  ],
  "ingredients": [
    "0",
    "Para el bocadillo: 100 g de gruyer rallado o en lonchas, 4 rebanadas de pan rústico, 2 lonchas de jamón cocido, 1 huevo pequeño batido, 40 g de mantequilla sin sal, 3 cucharadas de mostaza de Dijon y 30 gramos de queso parmesano rallado.",
    "Para salsa bechamel: 30 g de mantequilla sin sal, 1 cucharadita de aceite de oliva virgen extra, ½ cucharada de harina para todo tipo de uso y 125 ml de leche, 1 pizca tomillo fresco, pimienta recién molida y sal."
  ],
  "__v": 1
}