{
  "hash": "588a1ded317dc846f7228ec2ab5a66cd1d59c437",
  "title": "Veggie Fritters",
  "image": "http://recipe-folder.com/img/recipe-images/083/186/4068031183.gif",
  "href": "https://www.thekitchn.com/vegetable-fritters-22903492",
  "extension": "Chrome",
  "firstAdded": "2019-06-19T22:08:14.471000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Toss the vegetables with chickpea flour, salt, and pepper.",
    "Use about 1/2 cup chickpea flour and a big pinch of salt and pepper for every 2 cups prepared vegetables. If you’re using spices or chopped herbs, add them here.",
    "(Image Credit: Joe Lingeman/Kitchn)",
    "2. Drizzle in the water and mix to combine.",
    "Use about 2 tablespoons water for every 2 cups prepared vegetables.",
    "(Image Credit: Joe Lingeman/Kitchn)",
    "3. Check to see if you can form a patty in your hands and it holds together.",
    "The batter should be sticky but not overly wet and runny. If it’s too dry, add a little more water to the mixture; if it’s too wet, add a little more flour.",
    "(Image Credit: Joe Lingeman/Kitchn)",
    "4. Heat a generous drizzle of olive or vegetable oil in a large skillet, preferably cast iron or nonstick, over medium-high heat until shimmering.",
    "Drop 1/4 cup of batter into the pan, flatten it slightly with a flat spatula, and continue dropping more batter, leaving a couple of inches between each fritter.",
    "(Image Credit: Joe Lingeman/Kitchn)",
    "5. Fry until golden-brown on the bottom, 2 to 3 minutes, then flip and fry until browned on the other side and cooked through, 2 to 3 minutes more.",
    "(Image Credit: Joe Lingeman/Kitchn)",
    "6. Drain on a paper towel-lined plate and repeat with remaining batter, if you have any.",
    "Enjoy warm, room temperature, or even cold. They’ll keep well in the fridge for up to a week and can even be frozen for a couple of months. To reheat, heat on a baking sheet in a 325°F oven until warmed through."
  ],
  "ingredients": [
    "0",
    "Carrots, parsnips, sweet potatoes, turnips, and regular potatoes: Grate on a box grater and use as is.",
    "Zucchini and summer squash: You’ll grate these, too, but they’ll need to be drained because of their high water content. Dump the grated vegetable into a colander set over a bowl, toss with a big pinch of salt, and let sit for 10 minutes. Then, press down on the squash with your hands or a wooden spoon to push out some of the liquid, wrap it in a clean kitchen towel, and squeeze out as much water as you can to get it as dry as possible.",
    "Corn: Slice the kernels right off the cob or use straight from the freezer.",
    "Broccoli and cauliflower: Finely chop the florets by hand, or use a food processor.",
    "Kale, Swiss chard, and spinach: Blanch the greens, let cool, squeeze out any liquid, and chop."
  ],
  "__v": 1
}