{
  "hash": "3f933fdcbea8333665dfb2d6206ece47cf65e33d",
  "title": "Billion Dollar Bar",
  "image": "http://foodpinsnow.com/wp-content/uploads/1640461.jpg",
  "href": "http://foodpinsnow.com/?p=2042",
  "extension": "Chrome",
  "firstAdded": "2015-11-17T01:33:19.635000",
  "users": [
    null
  ],
  "keywords": [
    "cooking",
    "spray",
    "plastic",
    "wrap",
    "chocolate",
    "layer",
    "milk",
    "butterscotch",
    "chips",
    "peanut",
    "butter",
    "nougat",
    "granulated",
    "light",
    "brown",
    "sugar",
    "evaporated",
    "marshmallow",
    "creme",
    "salted",
    "peanuts",
    "caramel",
    "candies",
    "wrapper",
    "cream",
    "creamy"
  ],
  "directions": [
    "0",
    "o Make The Bottom Chocolate Layer: Melt milk chocolate chips, butterscotch chips and peanut butter in a pan over low heat; stirring consistently. Pour mixture into a 9″ x 13″ baking pan lightly coated with nonstick spray or double-lined with plastic wrap which is long enough to drape over sides of the pan. Spread mixture and place in the refrigerator for 30 minutes. To Make The Nougat Layer: Melt butter over medium heat in pan; add white and brown sugars and evaporated milk; bring to a boil and cook additional 5 minutes while stirring. Remove from the heat and add marshmallow creme and peanut butter. Pour over the bottom layer and gently spread mixture. If using peanuts, scatter across the top. Place in the refrigerator for 15 – 30 minutes. To Make The Caramel Layer: Place the unwrapped caramel candy, butter and cream in a medium saucepan. Place over low heat and stir until the mixture has completely melted and is smooth. Pour in the pan and quickly spread over nougat layer. Place in the refrigerator for 15 – 30 minutes. To Make The Top Chocolate Layer: Melt milk chocolate chips, butterscotch chips, and peanut butter in a pan over low heat, stirring consistently. Pour over the caramel layer and spread. Place in the refrigerator for at least 1 hour before cutting into squares. Store in an air-tight container."
  ],
  "ingredients": [
    "0",
    "nonstick cooking spray or plastic wrap",
    "Bottom Chocolate Layer",
    "1 cup milk chocolate chips. 1⁄3 cup butterscotch chips. 1⁄3 cup peanut butter.",
    "Nougat Layer",
    "4 tablespoons butter. 3⁄4 cup granulated sugar. 1⁄4 cup light brown sugar, packed. 1⁄4 cup evaporated milk. 1 1⁄2 cups marshmallow creme. 1⁄3 cup peanut butter. 1 1⁄2 cups chopped salted peanuts (optional)",
    "Caramel Layer. 1 (14 ounce) package caramel candies, wrapper removed. 1⁄4 cup heavy cream. 1 tablespoon butter",
    "Top Chocolate Layer. 1 cup milk chocolate chips. 1⁄3 cup butterscotch chips. 1⁄3 cup creamy peanut butter"
  ],
  "__v": 1
}