{
  "hash": "be09f04cb3f8c10fa5cad26cc4876d458792c095",
  "title": "Baked Katsudon",
  "image": "https://d3eh3svpl1busq.cloudfront.net/KQYMGOLIdXGmoAcyJsPOrQDKktgCbwtG/assets/static/source/wp-content/uploads/2017/07/5cb006a809ba9cc7b3327fbe215fd2ba.Baked-Katsudon-II-600x900.jpg",
  "href": "https://www.justonecookbook.com/baked-katsudon/",
  "extension": "Chrome",
  "firstAdded": "2020-01-07T10:54:17.488000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Gather all the ingredients. Adjust oven rack to the middle position and preheat the oven to 400F (200C).",
    "Combine the panko and oil in a frying pan and toast over medium heat until golden brown. Transfer panko into a shallow dish and allow to cool.",
    "Cut the onions into thin slices and the mitsuba into small pieces.",
    "Remove the extra fat and make a couple of slits on the connective tissue between the meat and fat. The reason why you do this is that red meat and fat have different elasticity, and when they are cooked they will shrink and expand at different rates. This will allow Tonkatsu to stay nice and flat and prevent it from curling up.",
    "Pound the meat with a meat pounder, or if you don’t have one then just use the back of knife to pound. Mold the extended meat back into original shape with your hands.",
    "Sprinkle salt and freshly ground black pepper.",
    "Dredge each pork piece in the flour to coat completely and pat off the excess flour.",
    "Beat one egg in a bowl and coat the pork with the beaten egg. Finally coat with the toasted panko. Press on the panko flakes to make sure they adhere to the pork.",
    "Place the pork on the prepared baking sheet lined with parchment paper or even better if you have an oven-safe wire rack (as air goes through on the bottom so panko won't get crushed). Bake at 400F (200C) until the pork is no longer pink inside, about 20 minutes.",
    "Remove the tonkatsu from the oven and cut into 1 inch pieces (so you can eat with chopsticks)."
  ],
  "ingredients": [
    "0",
    "For Baked Katsu:",
    "1 cup panko (Japanese breadcrumbs)",
    "1 Tbsp neutral flavor oil (vegetable, canola, etc)",
    "2 pieces ½\"-thick lean boneless pork loin chops (2 pieces = ½ lb or 226 g, thickness: 1.2 cm or ½\" )",
    "1 tsp salt (kosher or sea salt; use half if using table salt)",
    "Freshly ground black pepper",
    "1-2 Tbsp all-purpose flour",
    "1 large egg",
    "For Katsudon:",
    "½ onion (divided - ¼ onion/serving)",
    "2 large eggs (divided - 1 egg/serving)",
    "2 servings cooked Japanese short grain rice",
    "For Katsudon Sauce (divided for each serving):",
    "1 cup dashi",
    "2 Tbsp sake",
    "2 Tbsp mirin",
    "2 Tbsp soy sauce",
    "2 tsp sugar"
  ],
  "__v": 1
}