{
  "hash": "ccca47cd8a3321e44fc81f40749af0488472deec",
  "title": "Cider-braised pork neck",
  "image": "",
  "href": "https://www.goodfood.com.au/recipes/ciderbraised-pork-neck-20131031-2wle1",
  "extension": "Chrome",
  "firstAdded": "2018-11-23T19:18:02.471000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 160°C (315°F/Gas 2–3).",
    "Tie the pork with string at 2 cm (¾ inch) intervals to make a neat round shape. Lightly brush with olive oil. Mix the cinnamon and cumin together, then rub all over the pork.",
    "Heat 1 tablespoon olive oil in a large flameproof casserole dish or roasting tin. Add the onion, celery and garlic and sauté for 5 minutes, or until softened. Sit the pork in the dish, add the thyme sprigs and pour in the cider. Bring to a simmer, then cover and transfer to the oven. Bake for 1½ hours, basting the pork occasionally.",
    "Add the sweet potato and apricots, then cover and cook for another 45 minutes. Add the beans, cover again and cook for 15–20 minutes, or until the sweet potato and beans are tender and the pork is cooked through.",
    "Remove the pork and vegetables to a large dish or bowl and cover with foil to keep warm.",
    "Place the casserole dish over high heat and bring the liquid to the boil. Mix the cornflour with 1 tablespoon water to form a smooth paste, then stir into the cooking liquid. Stirring constantly, bring the mixture back to a simmer and cook for 1–2 minutes, or until the sauce thickens. Season well with sea salt and freshly ground black pepper.",
    "To serve, arrange the vegetables and apricots on serving plates. Remove the string from the pork, then cut the pork into slices 1 cm (½ inch) thick and place two or three slices over the vegetables. Spoon the juices over and serve."
  ],
  "ingredients": [
    "0",
    "1.25 kg (2 lb 12 oz) pork neck, trimmed",
    "olive oil, for brushing and pan-frying",
    "1½ teaspoons ground cinnamon",
    "1½ teaspoons ground cumin",
    "1 onion, finely chopped",
    "1 celery stalk, finely chopped",
    "2 garlic cloves, crushed",
    "2 thyme sprigs",
    "500 ml (17 fl oz/2 cups) sweet alcoholic apple cider",
    "1 orange sweet potato (about 425 g/15 oz), peeled and cut into 3 cm (1¼ inch) chunk",
    "90 g (3¼ oz/½ cup) dried apricots",
    "200 g (7 oz) green or yellow beans, trimmed",
    "1½ teaspoons cornflour (cornstarch)"
  ],
  "__v": 2
}