{
  "hash": "95a9ab5c81a563e808a5e1d6f0191090b2f49733",
  "title": "cinnamon nut palmiers",
  "image": "http://lh6.ggpht.com/_OaYG005JPDs/SylnY_xFgBI/AAAAAAAAAjg/ZEqycF1uDNA/s640/Palmiers%203.jpg",
  "href": "http://www.budgetbytes.com/2009/12/cinnamon-nut-palmiers/",
  "extension": "Chrome",
  "firstAdded": "2016-02-12T14:51:35.178000",
  "users": [
    null
  ],
  "keywords": [
    "box",
    "sheets",
    "frozen",
    "puff",
    "pastry",
    "honey",
    "cinnamon",
    "brown",
    "sugar",
    "walnuts",
    "confectioners"
  ],
  "directions": [
    "0",
    "Thaw the box of puff pastry either on the counter at room temperature or in the refrigerator over night. I just put mine in the refrigerator instead of the freezer when I got home from the store and a couple days later it was ready to go. Preheat the oven to 400 degrees.",
    "Sprinkle a clean counter top with powdered sugar to keep the dough from sticking. Unfold the dough and lightly drizzle it all over with honey (about 1 Tbsp per sheet). Next, sprinkle lightly with cinnamon, brown sugar and chopped walnuts. You don’t need a lot of any of these because you will be rolling the dough up and the ingredients will be more concentrated than they seem when it is unrolled.",
    "Roll each side of the puff pastry inward until the two sides meet. You may need to get a little more powdered sugar from the counter and powder up the log again.",
    "Using a sharp knife, cut the log into ½ inch sections and place them on a cookie sheet (about 1.5-2 inches apart).",
    "Bake at 400 degrees for 10-15 minutes. Check the cookies at 10 minutes and keep an eye on them. You want them golden brown but not dark brown. If the cookies get too dark they will taste like burnt sugar!"
  ],
  "ingredients": [
    "0",
    "1 box (2 sheets) frozen puff pastry $3.68",
    "2 Tbsp honey $0.45",
    "2 tsp cinnamon $0.10",
    "4 Tbsp brown sugar $0.12",
    "4 Tbsp chopped walnuts $0.32",
    "½ cup confectioners (powdered) sugar $0.09"
  ],
  "__v": 1
}