{
  "hash": "b3906076a12dbb1922aa8768664db5b1574fc0ac",
  "title": "Southern Buttermilk Biscuits",
  "image": "http://img.sndimg.com/food/image/upload/w_555,h_416,c_fit,fl_progressive,q_95/v1/img/recipes/26/11/0/picHheiLM.jpg",
  "href": "http://www.food.com/recipe/southern-buttermilk-biscuits-26110",
  "extension": "Chrome",
  "firstAdded": "2015-09-19T02:45:49.765000",
  "users": [
    null
  ],
  "keywords": [
    "unbleached",
    "allpurpose",
    "dusting",
    "board",
    "white",
    "lily",
    "flour",
    "biscuits",
    "better",
    "baking",
    "soda",
    "use",
    "aluminum",
    "kosher",
    "salt",
    "unsalted",
    "butter",
    "cold",
    "buttermilk",
    "approx",
    "sugar",
    "chilled",
    "shortening"
  ],
  "directions": [
    "0",
    "Preheat your oven to 450°F.",
    "Combine the dry ingredients in a bowl, or in the bowl of a food processor.",
    "Cut the butter into chunks and cut into the flour until it resembles course meal.",
    "If using a food processor, just pulse a few times until this consistency is achieved.",
    "Add the buttermilk and mix JUST until combined.",
    "If it appears on the dry side, add a bit more buttermilk. It should be very wet.",
    "Turn the dough out onto a floured board.",
    "Gently, gently PAT (do NOT roll with a rolling pin) the dough out until it's about 1/2\" thick. Fold the dough about 5 times, gently press the dough down to a 1 inch thick.",
    "Use a round cutter to cut into rounds.",
    "You can gently knead the scraps together and make a few more, but they will not be anywhere near as good as the first ones.",
    "Place the biscuits on a cookie sheet- if you like soft sides, put them touching each other.",
    "If you like\"crusty\" sides, put them about 1 inch apart- these will not rise as high as the biscuits put close together.",
    "Bake for about 10-12 minutes- the biscuits will be a beautiful light golden brown on top and bottom.",
    "Do not overbake.",
    "Note: The key to real biscuits is not in the ingredients, but in the handling of the dough.",
    "The dough must be handled as little as possible or you will have tough biscuits.",
    "I have found that a food processor produces superior biscuits, because the ingredients stay colder and there's less chance of overmixing.",
    "You also must pat the dough out with your hands, lightly.",
    "Rolling with a rolling pin is a guaranteed way to overstimulate the gluten, resulting in a tougher biscuit.",
    "Note 2: You can make these biscuits, cut them, put them on cookie sheets and freeze them for up to a month.",
    "When you want fresh biscuits, simply place them frozen on the cookie sheet and bake at 450°F for about 20 minutes.",
    "1",
    "Preheat oven to 450.",
    "Combine the dry ingredients and mix to distribute everything.",
    "Add butter and shortening (all cubed) and quickly break up the fats with your fingers until there are no large pieces.",
    "Add in butter milk and stir just enough to combine.",
    "Turn out dough until floured surface and fold 5-6 times.",
    "Press out so dough is about 1\" thick.",
    "Use a 2-inch cutter to cut out the biscuits. Place them on a cookie sheet just touching each other.",
    "Reform dough and continue to cut out biscuits.",
    "Bake for 10-12 minutes until lightly golden."
  ],
  "ingredients": [
    "0",
    "2 cups unbleached all-purpose flour, plus more for dusting the board (if you can get White Lily flour, your biscuits will be even better)",
    "1⁄4 teaspoon baking soda",
    "1 tablespoon baking powder (use one without aluminum)",
    "1 teaspoon kosher salt or 1 teaspoon salt",
    "6 tablespoons unsalted butter, very cold",
    "1 cup buttermilk (approx)",
    "1⁄2 cup sugar (for topping)",
    "1",
    "2 cups all-purpose flour",
    "4 teaspoons baking powder",
    "1⁄4 teaspoon baking soda",
    "1⁄2 teaspoon salt",
    "2 tablespoons butter, chilled",
    "2 tablespoons shortening, chilled",
    "1 cup buttermilk, chilled"
  ],
  "__v": 1
}