{
  "hash": "070332438dca89a987ae3441c7da50046513b617",
  "title": "HOW TO MAKE\nVegan Butter Rolls",
  "image": "http://www.handletheheat.com/wp-content/uploads/2014/10/Butter-Rolls-02.jpg",
  "href": "http://www.handletheheat.com/vegan-butter-rolls/?ncid=txtlnkusaolp00000618",
  "extension": "Chrome",
  "firstAdded": "2017-06-02T04:49:15.334000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "Combine the water, milk, 2 tablespoons of the STAR Butter Flavored Olive Oil, sugar, salt and yeast in the bowl of a stand mixer. Add 2 cups of the flour and stir with a wooden spoon until combined. Attach the dough hook to the mixer, turn to medium-low speed, and gradually add the remaining flour, kneading until a mass of dough begins to forms. Continue kneading on medium-high speed for 4 to 5 minutes until a soft and smooth ball of dough is formed. The dough should feel elastic and tacky to the touch. Only add a tablespoon or two of additional flour if the dough is extremely sticky.",
    "Lightly spray a large clean bowl with cooking spray and place the dough in the bowl. Cover the bowl lightly with plastic wrap. Let rise for about 45 minutes to 1 hour at room temperature or until the dough is big, puffy, and about doubled in size.",
    "Spray a 13×9-inch baking pan with cooking spray. Gently deflate the dough. Use a bench scraper, knife, or pizza wheel to divide the dough into 15 equal pieces. Shape each piece into a ball and place in the prepared pan. Brush all over with the remaining 2 tablespoons of STAR Butter Flavored Olive Oil. Lightly cover the dough with plastic wrap and let the rolls rise for 30 minutes, or until about doubled in size.",
    "Meanwhile, preheat the oven to 375°F.",
    "Bake the rolls for 15 to 20 minutes, or until golden brown. Serve warm. Store leftovers in a plastic bag for up to 3 days."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1/2 cup lukewarm water",
    "1 1/4 cups warm almond, soy, or dairy milk (100 – 110°F)",
    "4 tablespoons STAR Butter Flavored Olive Oil, divided",
    "2 tablespoons granulated sugar",
    "1 1/2 teaspoons fine salt",
    "2 1/4 teaspoons (1 packet) instant yeast",
    "4 1/2 cups (20 ounces) bread flour"
  ],
  "__v": 1
}