{
  "hash": "34657a8436380a49d240b35a50dccce6779567a6",
  "title": "Hunter's-Style Chicken",
  "image": "https://images.food52.com/Ohh97c5h2Y8cXsxJDz4_BnbG20c=/753x502/43a34c23-1807-4a34-a037-bfbb38d69d26--011811F_323.JPG",
  "href": "https://food52.com/recipes/7821-hunter-s-style-chicken",
  "extension": "Chrome",
  "firstAdded": "2018-01-31T02:02:37.645000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 325 degrees. Arrange the chicken pieces on a platter and pat dry. Season well with salt and set aside.",
    "Cover the porcini with the boiling water and let steep until the mushrooms are soft. Remove the mushrooms, finely chop and set aside. Strain the mushroom soaking liquid through a coffee filter to remove any grit, and set aside.",
    "Warm a glug of grapeseed oil with a glug of olive oil in a heavy-bottomed pot (I used a large enameled Dutch oven), and brown the chicken parts in batches, skin-side down, until all chicken is browned and crisp-skinned. Remove the browned chicken pieces to a plate or platter and set aside. Pour off all but a thin layer of the rendered fat.",
    "Trim and quarter the crimini mushrooms and add to the pan. Cook until browned on all sides, then add the chopped porcini and the red vermouth, cooking until the liquid has evaporated. Remove to a bowl and set aside.",
    "Add the chopped onions to the pan with a sprinkle of salt, adding a little more oil if necessary, and cook until soft and opaque. Add the carrot and toss through, then add the chopped tomatoes, tomato paste, chile flakes, wine and reserved mushroom liquid, stirring well and bringing to a simmer.",
    "Toss the chopped herbs with the mushrooms and return to the pot, stirring through. Nestle the chicken pieces on top, being sure to add any of the juices that have accumulated. Cover the pot with a parchment lid, and transfer the pot to the oven. Cook for at least one hour, preferably more, until the chicken is falling-apart tender and the sauce thick and reduced. Serve over creamy polenta with a sprinkle of chopped flat leaf parsley on top."
  ],
  "ingredients": [
    "0",
    "1 3 to 3 1/2 lb. chicken, quartered, or an equivalent amount of skin-on parts of your choice",
    "Kosher or sea salt",
    "1 cup dried porcini mushrooms",
    "1 cup boiling water",
    "grapeseed oil",
    "extra-virgin olive oil",
    "1/2 pound crimini mushrooms",
    "2 ounces red (Italian/sweet) vermouth",
    "2 cups chopped white or yellow onion",
    "1 small carrot, peeled and grated (about 1/2 cup)",
    "3 cups chopped ripe San Marzano tomatoes (or an equivalent amount of canned peeled Italian plum tomatoes)",
    "1 tablespoon double-concentrated tomato paste",
    "1 cup dry red wine",
    "a pinch of red chile flakes",
    "3 tablespoons chopped fresh herbs (I used a mixture of fresh thyme, savory, and flat-leaf parsley)"
  ],
  "__v": 1
}