{
  "hash": "63a03cb636e88abea2ea0c35e6bca6100b6df569",
  "title": "Vydřené domácí tagliatelle",
  "image": "",
  "href": "http://www.menudomu.cz/vydrene-domaci-tagliatelle/",
  "extension": "Chrome",
  "firstAdded": "2015-12-08T09:39:44.537000",
  "users": [
    null
  ],
  "keywords": [
    "ingredience",
    "porce",
    "semoly",
    "mouka",
    "tvrd",
    "penice",
    "extrahladk",
    "mouky",
    "typu",
    "men",
    "vejce",
    "trocha",
    "vody",
    "zakpnout",
    "olivovm",
    "olejem",
    "petka",
    "soli",
    "plechovka",
    "krjench",
    "rajat",
    "strouky",
    "esneku",
    "pep",
    "cukr",
    "krupice",
    "nebo",
    "ttinov",
    "mal",
    "cibule",
    "apky",
    "celeru",
    "lce",
    "olivovho",
    "oleje",
    "salsiccii",
    "parmazn",
    "grana",
    "erstv",
    "bazalka"
  ],
  "directions": [
    "0",
    "Těsto propracujte jako ve videu, ruční hnětení potrvá cca 10 minut, aby bylo krásně vláčné a hladké. Pak ho nechte ve fólii a nebo přikryté miskou odpočinout asi půl hodiny. Máte-li velmi světlé žloutky a toužíte po žluťoučkých těstovinách, můžete švindlovat přidáním špetky kurkumy, ale nepřehánět to s ní, ať neovlivňuje chuť pasty.",
    "Co se týče lisování těstovinových fuseklí na strojku, chce to trochu praxe, sama se s ním ještě seznamuju. Každopádně platí pravidlo o zploštění a pomoučení těsta (v průběhu ztenčování jsem používala mouku „00“), poté projet na nejširší možnou mezeru, nadvakrát nebo natřikrát přeložit, zas projet a tenhle systém zopakovat tak 5x. Až pak ztenčíme mezeru na polovinu a projíždíme bez překládání, tím se těsto prodlužuje a prodlužuje, až začne prosvítat proti světlu, stále bude pružné a na omak tak trochu sametové, jemné. V tu chvíli opět pomoučíme (od teď už jsem používala semolinovou mouku), nožem nakrájíme na asi 25 cm dlouhé pláty – tahle délka určuje i budoucí délku vašich nudlí. Pláty jednotlivě přeložíme, s každým dalším přeložením pomoučíme a nakrájíme ostrým nožem na nudle. Přiznám se, že po navaření mi vznikly spíš širší pappardelle místo tagliatellí, ale chutnaly parádně :) Na tagliatelle tedy spíš tak 5–6 mm šířka max. Těstoviny můžete buď uvařit (stačí jim 2 minuty) v osolené vodě (1 lžička na 1 litr), a nebo usušit – jednotlivě rozvěsit kamkoli do tepla a čekat. Pak jen slít a přehodit do omáčky.",
    "Základ na omáčku tvoří tuk vypečený ze salsiccie s případně kapkou oliváče, na něm orestovaná cibulka nebo řapíkatý celer, s přidáním nadrceného česneku na půl minuty, následně s navrácenými kolečky klobásek, zalitých krájenými konzervovanými rajčaty, dosolené, dopepřené, doslazené, je-li třeba. Plus čerstvá bazalka. Do základu můžete ale přidat pro větší výraznost bylinkové chutě i sušenou, k ní nikoho neurazí ani tymián nebo rozmarýn. Nakonec můžeme dochutit vmícháním strouhaného sýra (v tom případě bacha na sůl před tím) a jsme ready."
  ],
  "ingredients": [
    "0",
    "Ingredience na 2 - 3 porce",
    "100 g semoly (mouka z tvrdé pšenice)",
    "100 g extrahladké mouky typu \"00\"",
    "2 menší vejce",
    "trocha vody",
    "zakápnout olivovým olejem",
    "špetka soli",
    "--------------------------------------------",
    "400 g plechovka krájených rajčat",
    "2 - 3 stroužky česneku",
    "sůl",
    "pepř",
    "cukr (krupice nebo třtinový)",
    "1 malá cibule nebo 2 řapíky celeru",
    "lžíce olivového oleje",
    "2 - 3 ks salsiccii",
    "parmazán nebo grana",
    "čerstvá bazalka"
  ],
  "__v": 1
}