{
  "hash": "3b34a43afb5ce333d43ed4179cf10fd66d0c11bd",
  "title": "Grilled Leeks with Hazelnut Romesco",
  "image": "http://recipe-folder.com/img/recipe-images/055/506/1017555155.jpg",
  "href": "http://www.finecooking.com/recipe/grilled-leeks-with-hazelnut-romesco",
  "extension": "",
  "firstAdded": "2018-01-28T22:57:24.782000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the Romesco Sauce:",
    "Position a rack in the center of the oven and heat the oven to 400°F.",
    "Put the tomatoes on a large rimmed baking sheet and toss with 2 Tbs. of the oil, 3/4 tsp. salt, and 1/2 tsp. pepper",
    "Slice and discard the top of the garlic bulb. Put the bulb on a piece of foil large enough to wrap it in. Drizzle with the 1 tsp. oil and season with a large pinch of salt and pepper. Close the foil packet tightly around the garlic and put the bulb on the baking sheet with the tomatoes.",
    "Roast the tomatoes and garlic until the tomatoes are softened and shriveled, and the garlic packet is soft when squeezed, about 40 minutes. Remove from the oven and let cool to room temperature. Squeeze the garlic cloves from the skins onto the baking sheet with the tomatoes and set aside.",
    "Remove the stems and seeds from the ancho chiles. Toast the chiles in a 10-inch skillet over medium heat, turning occasionally, until they begin to darken, about 3 minutes. Add enough water to cover the chiles by 1 inch and bring to a boil. Reduce to a simmer and cook until the chiles darken, about 20 minutes. Drain the chiles and discard the cooking liquid. When cool enough to handle, coarsely chop the chiles.",
    "Transfer the tomatoes, roasted garlic, drippings from the baking sheet, ancho chiles, and roasted red pepper to a blender. Pulse until a paste begins to form. Add the sherry vinegar, and the hazelnuts and continue to blend until smooth. If necessary, thin the mixture with up to 1/4 cup of the water for the blades to move smoothly. With the blender running, add 1 to 2 Tbs. of the remaining oil until incorporated. Season to taste with salt, pepper, and more vinegar if necessary. Set the sauce aside until ready to serve.",
    "Grill the Leeks:",
    "Heat a gas or charcoal grill to medium (350°F to 375°F). Lightly oil the grill with the canola oil.",
    "Put the leeks cut side up on a rimmed baking sheet. Drizzle them with the olive oil, 1/2 tsp. salt and 1/2 tsp. pepper and gently rub in to distribute the oil.",
    "Grill the leeks cut side down to start, and then turning occasionally, until softened and charred, about 8 minutes.",
    "Remove the leeks from the grill and wrap bundles of 4 to 6 halves in newspaper. Set aside to steam, about 10 minutes.",
    "Remove the leeks from the newspaper and serve with the romesco sauce on the side."
  ],
  "ingredients": [
    "0",
    "For the Romesco Sauce:",
    "7 Roma tomatoes (about 2 lb.), quartered lengthwise and seeded",
    "1/4 cup plus 1 tsp. extra-virgin olive oil",
    "Kosher salt and freshly ground black pepper",
    "1 head garlic",
    "4 dried ancho chiles",
    "1 roasted red pepper, skinned and seeded (5 oz.)",
    "1 Tbs. sherry vinegar",
    "1/4 cup hazelnuts, blanched and toasted",
    "For the Leeks:",
    "Canola oil for the grill",
    "2 lb. large leeks, about 5, tough outer leaves removed, roots and top 1-inch cut, halved lengthwise and cleaned thoroughly",
    "1/4 cup extra-virgin olive oil",
    "Kosher salt and freshly ground pepper"
  ],
  "__v": 3
}