{
  "hash": "a65fcbdf27687dffd24882294088052e2467d288",
  "title": "Crispy Spiced Cauliflower Steaks",
  "image": "https://static01.nyt.com/images/2019/04/14/magazine/14mag-eat-slideshow-slide-2DW5/14mag-eat-slideshow-slide-2DW5-articleLarge.png",
  "href": "https://cooking.nytimes.com/recipes/1020168-crispy-spiced-cauliflower-steaks?em_pos=medium&emc=edit_ck_20190414&nl=cooking&nl_art=0&nlid=79859114emc%3Dedit_ck_20190414&ref=headline&te=1",
  "extension": "Firefox",
  "firstAdded": "2019-07-08T00:22:21.640000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Line a baking sheet with a wire rack or paper towels, and set aside.",
    "Finely grind cinnamon, coriander, fennel, peppercorns, cumin and cloves in a spice grinder, spice mill or mortar and pestle.Transfer to a bowl, and stir in cayenne and 2 tablespoons plus 2 teaspoons salt. Set aside.",
    "In a large bowl, whisk both flours until combined. Whisk in lime and lemon juices, then gradually whisk in enough water until the mixture is the consistency of thin pancake batter (about 1 1/3 cups). There is no gluten in either flour, so don’t worry about overmixing.",
    "Stir in turmeric and the spice mixture. Taste, and adjust salt as needed.",
    "Working with 1 or 2 steaks at a time, push the cauliflower steaks into the batter, turn to coat and allow to marinate for at least 3 minutes.",
    "Heat a large cast-iron skillet over medium high. Add coconut oil to a depth of 1/3-inch, and heat until hot. Carefully drip a few drops of batter into the oil to test that it’s sufficiently hot. The batter should immediately sizzle and expand. Slip the steaks one at a time directly from the batter into the pan. Don’t overcrowd the pan — the steaks should never touch.",
    "Cook until golden brown on the bottom, 8 to 12 minutes, rotating the steaks around the pan after 6 to 8 minutes to ensure even browning. Use a thin metal spatula to carefully flip the steaks. Continue cooking until the second sides are golden-brown and the cores are tender when pierced with a knife, 4 to 6 minutes. Transfer steaks to the prepared baking sheet, and allow to drain. Season with salt. Repeat with the remaining steaks and any remaining smaller pieces of cauliflower, adjusting the heat as needed to prevent the steaks from browning too quickly.",
    "Serve hot or reheat in an oven at 400 degrees until hot and crispy, about 5 to 7 minutes. Top with a dollop of Greek yogurt and a shower of chopped cilantro, if desired. Serve with lemon wedges for squeezing on top."
  ],
  "ingredients": [
    "0",
    "½ of 1 cinnamon stick, broken up",
    "2 teaspoons coriander seeds",
    "2 teaspoons fennel seeds",
    "1 teaspoon black peppercorns",
    "1 teaspoon cumin seeds",
    "4 cloves",
    "Large pinch of ground cayenne",
    "2 tablespoons plus 2 teaspoons Diamond Crystal kosher salt, plus additional, as needed",
    "1 ⅓ cups brown- or white-rice flour (about 7 1/3 ounces)",
    "⅔ cup tapioca flour (about 3 2/3 ounces)",
    "¼ cup freshly squeezed lime juice (from 2 limes)",
    "¼ cup freshly squeezed lemon juice (from 1 large lemon), plus additional lemon wedges, for serving",
    "1 tablespoon grated fresh turmeric (or 1/2 teaspoon ground turmeric)",
    "2 small heads cauliflower (about 1 pound each), leaves removed, cut from top to core into 1/2-inch-thick slices",
    "1 ½ to 2 cups coconut oil",
    "1 cup Greek yogurt, for serving (optional)",
    "2 tablespoons roughly chopped cilantro leaves and tender stems, for serving (optional)"
  ],
  "__v": 2
}