{
  "__v": 1,
  "directions": [
    "0",
    "First, concentrate the stock. Put the chicken stock in a wide and shallow saucepan (to ensure fast evaporation), bring it to a boil, and reduce it over medium-high heat until the liquid measures half its original volume. [If you have access to very, very good chicken bouillon granules which are not all about salt and very little flavor, by all means, dilute double the amount you normally use in 1½ cups of plain water and use that in place of the concentrated chicken stock.].",
    "Halve (or quarter) the straw mushrooms into bite-sized pieces; set aside. [You can also use white button, cremini, and oyster mushrooms. Any meaty, mild-flavored mushrooms will do. Portobello mushrooms are fine flavor- and texture-wise, but even with the gills carefully scraped off they still turn the broth into an unappetizing shade of gray. Do not use shiitake; the flavor is way too strong for this. Also, I would never use any kind of dried mushrooms which will change the flavor profile of this dish quite drastically, and not in a good way.]",
    "Cut the lemongrass stalk into 1-inch pieces and smash them with the side of a large Chinese cleaver, a pestle, or any heavy object lying around in the house; set aside.",
    "Do to the chilies what you just did to the lemongrass; set aside.",
    "Remove the stems and the tough veins that run through the middle from the kaffir lime leaves, and tear them up into small pieces. You can also bruise them a little. Set aside.",
    "Juice 2 limes; set aside. (You may need more; you may not. It's better to have more than you need than not enough.)",
    "Put the coconut milk into a 4-quart pot, followed by concentrated chicken stock, kaffir lime leaves, lemongrass pieces, and galangal slices.",
    "Bring the mixture slowly to between 160° and 180°F (slightly below a simmer), allowing the herbs to infuse the liquid for about a minute.",
    "Keeping the temperature steady, add the mushrooms and the chicken to the liquid; adjust the heat to maintain the temperature. The liquid should never at any point come to a rapid boil. Don’t worry; at 160°-180°F, your chicken will be thoroughly cooked.",
    "Stir gently to ensure that the chicken is evenly cooked. (If you want more liquid, add more plain water or unconcentrated broth.)",
    "Once the chicken is cooked through, throw in the smashed chilies and remove the pot from heat immediately.",
    "Add the juice of 2 limes and the fish sauce to the pot, stir, and taste. Add more lime juice and fish sauce, if necessary. The soup should be predominantly sour, followed by salty. The sweetness comes from natural sugar in the coconut milk.",
    "Stir in the cilantro leaves and serve your tom kha gai with steamed jasmine rice as an entree."
  ],
  "firstAdded": "2014-08-16T22:54:37.021000",
  "hash": "e690b53b3708fe048f75258d0ecbc7a6be83fbb4",
  "href": "http://shesimmers.com/2010/11/tom-kha-gai-recipe-tutorial-for.html",
  "image": "http://1.bp.blogspot.com/_Liz-VpvKDvo/TNGl8XJwX0I/AAAAAAAAFL4/u4WIM8JgGng/s800/TKG+cover.jpg",
  "ingredients": [
    "0",
    "3 cups (24 fluid ounces) sodium-free chicken stock",
    "1 lb boneless, skinless chicken breasts, cut into bite size pieces across the grain",
    "½ lb (8ounces) fresh or canned straw mushrooms (drained)",
    "One stalk lemongrass",
    "5-6 fresh bird's eye chilies (more or less depending on your heat preference)",
    "2-inch piece of fresh galangal, sliced thinly crosswise",
    "4-5 fresh kaffir lime leaves",
    "4-5 limes",
    "¼ cup fish sauce (but have more ready)",
    "½ cup fresh cilantro leaves",
    "1½ cups (12 fluid ounces) full-fat coconut milk"
  ],
  "keywords": [
    "sodiumfree",
    "chicken",
    "stock",
    "boneless",
    "skinless",
    "breasts",
    "bite",
    "size",
    "pieces",
    "canned",
    "straw",
    "mushrooms",
    "stalk",
    "lemongrass",
    "birds",
    "eye",
    "chilies",
    "depending",
    "heat",
    "preference",
    "galangal",
    "crosswise",
    "kaffir",
    "lime",
    "leaves",
    "limes",
    "fish",
    "cilantro",
    "fullfat",
    "coconut",
    "milk"
  ],
  "title": "Tom Kha Gai",
  "users": [
    null
  ]
}