{
  "hash": "6aac5c7391ef18107e647e0d16abd842a4dbf0f7",
  "title": "Roasted Chickpea Curry (",
  "image": "",
  "href": "https://www.daringgourmet.com/roasted-chickpea-curry/",
  "extension": "Firefox",
  "firstAdded": "2019-12-12T16:43:32.865000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "To make the spice blend: Heat a small heavy skillet over medium heat and add all the whole spices. Toast for 3-4 minutes or until the spices become very fragrant. Remove from heat and let cool completely, then transfer to a spice grinder and grind to a fine powder. Set aside.",
    "Heat the ghee in a large Dutch oven or heavy stock pot and lightly brown the garbanzo beans in batches. Set aside.",
    "Add a little more ghee and cook the onions until lightly browned, 8-10 minutes. Add the ginger, garlic and green chili and cook for 2 minutes. Add the ground spice mixture along with the turmeric and asafoetida and cook for another minute. Add the tomatoes and ketchup and cook for another 5 minutes.",
    "Add the chickpeas, broth, salt and bay leaves. Bring to a boil, reduce the heat to medium, cover and simmer for 1 hour, stirring occasionally. Add more broth if the curry gets too dry. Add salt to taste. Stir in the cilantro and simmer for another minute.",
    "Serve immediately or the following day after the flavors have had more time to meld. Serve with some fresh naan bread or jasmine rice and a cool cucumber or leafy green salad."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 cups dried garbanzo beans, soaked in a pot of water overnight (covered by at least 3 inches of water), then rinsed and drained. Add the beans to a pot of lightly salted water, bring to a boil, reduce the heat and simmer for 1 to 1½ hours until tender. Set aside until ready to use. (Equivalent to about 3½ (15 oz) cans garbanzo beans)",
    "2 tablespoons ghee (vegan: use oil)",
    "1 large yellow onion, chopped",
    "1 green chili pepper, seeds and membrane discarded, chopped",
    "1 tablespoon fresh minced ginger",
    "3 cloves garlic, minced",
    "3 Roma tomatoes, diced",
    "2 tablespoons ketchup",
    "4 cups vegetable or chicken broth (vegetarian/vegan: use vegetable)",
    "1 teaspoons ground turmeric",
    "¼ teaspoon asafoetida",
    "1½ teaspoons salt",
    "2 bay leaves",
    "¼ cup chopped fresh cilantro",
    "Spice mixture:",
    "1 tablespoon whole coriander seeds",
    "1 tablespoon whole cumin seeds",
    "½ teaspoon seeds from green cardamom pods",
    "¼ teaspoon fenugreek seeds",
    "½ teaspoon whole fennel seeds",
    "1 teaspoon whole black peppercorns",
    "1 small whole cinnamon stick"
  ],
  "__v": 1
}