{
  "hash": "2b0d84a2a4a8191c607ac33ef2cb9716ea95b9fb",
  "title": "Cuban Sandwich",
  "image": "https://icuban.com/food/images/cuban-sandwich-cuban.jpg",
  "href": "https://icuban.com/food/cuban_sandwich.html",
  "extension": "",
  "firstAdded": "2019-01-02T00:44:48.135000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat a pancake griddle or large fry pan to medium hot.",
    "Cut the bread into sections about 8 inches long. Cut these in half and generously spread butter on both halves (inside.)",
    "Make each Cuban sandwich (Cubano) with the ingredients in this order: pickles, roasted pork, ham, and cheese. (Add any optional ingredients before toasting on the plancha.)",
    "NOTE: Most people use a sweet cured ham (jamón dulce) or bolo ham for Cuban sandwiches (Cubanos). If you can find these hams in your area, great. Otherwise, look for a slightly sweet, soft textured ham with a mild taste. You don't want the flavor of the ham to overpower the rest of the ingredients! Also, never use shaved ham or pork in a Cubano sandwich!",
    "Spread a little butter on the hot griddle or fry pan and place the Cubano sandwich on the pan. Use a heavy skillet, bacon press, or foil-wrapped brick to flatten the sandwich. (You really want to smash the Cubano sandwich, compressing the bread to about 1/3 its original size!)",
    "Grill the sandwiches for two to three minutes then flip them over to toast the other side. Once the cheese is melted and the bread is golden brown on both sides, the Cubano sandwiches are done.",
    "Make sure your griddle or fry pan is not TOO HOT! Otherwise, the crust will burn before the cheese melts.",
    "Slice the sandwich in half diagonally and serve."
  ],
  "ingredients": [
    "0",
    "1 loaf Cuban bread",
    "3 tablespoons butter",
    "1 pound ham",
    "1 pound Cuban pork (lechón asado)",
    "1/2 pound Swiss cheese",
    "15 slices dill pickles",
    "OPTIONAL INGREDIENTS:",
    "8 slices Serrano Ham (Jamon Serrano)",
    "OR",
    "1 tablespoon olive salad (giardiniera)"
  ],
  "__v": 1
}