{
  "hash": "da8b97523c0b9d97558758167a1f39b39897de96",
  "title": "Potato Samosas with Coconut-Mint Chutney",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2013/10/Vegan-Potato-Samosas-with-Coconut-Mint-Chutney.jpg",
  "href": "http://www.onegreenplanet.org/plant-based-recipes/potato-samosas-with-coconut-mint-chutney-vegan/",
  "extension": "Chrome",
  "firstAdded": "2015-05-13T12:28:26.305000",
  "users": [
    null
  ],
  "keywords": [
    "soy",
    "milk",
    "oil",
    "apple",
    "cider",
    "vinegar",
    "wheat",
    "flour",
    "turmeric",
    "baking",
    "salt",
    "mediumsized",
    "russet",
    "potatoes",
    "chunks",
    "cumin",
    "seeds",
    "mustard",
    "onion",
    "carrots",
    "garlic",
    "ginger",
    "coriander",
    "juice",
    "lemon",
    "shelled",
    "frozen",
    "edamame",
    "green",
    "peas"
  ],
  "directions": [
    "0",
    "In a saucepan, boil the potatoes until tender, about 20 minutes. Drain and set aside.",
    "Preheat oven to 400F.",
    "1",
    "Pour the wet ingredients into mixing bowl. Add 1/2 cup whole wheat flour and 1 1/2 cups of the AP flour, the turmeric, baking powder and salt. Knead the mixture, adding more flour gradually as necessary. Dough should be smooth, not sticky. Set the dough aside, covered with plastic wrap, while you prepare the filling.",
    "2",
    "In a large skillet over medium heat, heat the oil, cumin seeds and mustard seeds. The seeds will begin to pop – use a lid to keep the seeds from flying around. After a minute or so of popping, add the carrots and onions. Raise the heat to medium-high and saute for 5-10 minutes, or until the onions begin to brown. Add the garlic, ginger, coriander and turmeric, salt and lemon juice and saute for another minute.",
    "Add the potatoes, mashing them with a spoon or spatula. When the potatoes are mashed and heated through, add the edamame or peas.",
    "3",
    "Divide the dough in half and working with one half at a time, roll out the dough thinly. Cut out eight circles with a 4″ circumference cookie cutter. Have a small bowl of water nearby. Place about 1 1/2 tbsp. filling into the center of each circle and brush water along the edge of the circle. Fold the dough over the filling to create semi-circles and seal the edges. Do the same thing with the second half of the dough.",
    "4",
    "Place the samosas on baking sheets lined with parchment paper. Bake for about 15 minutes, flipping over after 10 minutes. Samosas should be lightly browned."
  ],
  "ingredients": [
    "0",
    "3/4 cup soy milk",
    "1/4 cup vegetable oil",
    "1 tbsp. apple cider vinegar",
    "1/2 cup whole wheat flour",
    "2 1/2 cups AP flour",
    "1/4 tsp. ground turmeric",
    "1/4 tsp. baking powder",
    "1 tsp. salt",
    "1",
    "3 medium-sized russet potatoes, peeled and cut into small chunks",
    "2 tbsp. vegetable oil",
    "1 tsp. cumin seeds",
    "2 tsp. mustard seeds",
    "1 medium-sized onion, finely chopped",
    "1 cup carrots, finely chopped",
    "2 cloves garlic, minced",
    "1 tbsp. fresh ginger, minced",
    "1 tsp. ground coriander",
    "1/2 tsp. ground turmeric",
    "1 tsp. salt",
    "juice of 1 lemon",
    "3/4 cup shelled frozen edamame or green peas"
  ],
  "__v": 1
}