{
  "hash": "360b172199da42876ce61c61e696e4e35505a902",
  "title": "Whole-Grain Garlic Knots",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2013/12/20/0/FNK_Multi-Grain-Garlic-Knots_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/food-network-kitchens/whole-grain-garlic-knots.html",
  "extension": "Chrome",
  "firstAdded": "2015-10-06T05:46:40.040000",
  "users": [
    null
  ],
  "keywords": [
    "white",
    "wholewheat",
    "flour",
    "dusting",
    "wholemultigrain",
    "pizza",
    "dough",
    "recipe",
    "follows",
    "unsalted",
    "butter",
    "garlic",
    "kosher",
    "salt",
    "parsley",
    "parmesan",
    "multigrain",
    "products",
    "equal",
    "fact",
    "refined",
    "used",
    "relative",
    "red",
    "variety",
    "nutritional",
    "value",
    "quinoa",
    "wholegrain",
    "bulgur",
    "wheat",
    "extra",
    "fiber",
    "added",
    "seeds",
    "sunflower",
    "flax",
    "flaxseeds",
    "make",
    "easier",
    "digest",
    "nutritionally",
    "available",
    "water",
    "degrees",
    "agave",
    "syrup",
    "honey",
    "active",
    "dry",
    "yeast",
    "kneading",
    "extravirgin",
    "olive",
    "oil"
  ],
  "directions": [
    "0",
    "Position oven racks in the upper and lower third of the oven and preheat to 400 degrees F.",
    "Line two baking sheets with parchment.",
    "Generously sprinkle flour on a work surface. Roll the pizza dough out into a 12-inch square, using more flour as needed to prevent sticking. Cut the dough into quarters, then cut each quarter into 4 strips.",
    "Carefully tie each strip into a knot and arrange on the prepared baking sheets about 2 inches apart. Wrap loosely with plastic wrap and let sit at room temperature until slightly puffed, about 30 minutes.",
    "Bake the knots until golden brown on the bottom and lightly golden on the top, 20 to 25 minutes, rotating the baking sheets as needed.",
    "Meanwhile, put the butter, garlic and 1/2 teaspoon of salt in a small saucepan over medium heat. Once the butter is melted and beginning to bubble, cook the garlic, swirling the pan, until it is soft and fragrant but not brown, about 3 minutes. Remove from the heat and stir in the parsley.",
    "Brush the garlic butter on the warm knots and sprinkle each with Parmesan. Eat warm or at room temperature. Garlic knots can be baked, cooled and frozen for up to 1 month.",
    "Per serving (2 knots): Calories: 180; Fat: 8 g (Saturated: 3 g); Cholesterol: 10 mg; Sodium: 270 mg; Carbohydrate: 24 g; Protein: 6 g; Fiber: 4 g; Sugar: 0 g",
    "Bring 2 cups of water to a boil in a small pot. Add the bulgur and quinoa and simmer for 10 minutes. Transfer the grains to a fine-mesh strainer and hold under cold running water to stop the cooking. Let the grains drain in the strainer for 15 minutes, then spread them out on a thick layer of paper towels to absorb any extra moisture. Meanwhile, coarsely grind the flaxseeds in a spice grinder, just to break them open.",
    "Stir together the warm water, agave and yeast in a measuring cup or small bowl. Let sit until a small layer of foam develops at the top, 3 to 5 minutes. (If this doesn't happen, discard and try again with new yeast.)",
    "Whisk the flour and 1/2 teaspoon salt together in a medium bowl; add the foamy yeast mixture and olive oil and mix together with a stiff rubber spatula. When the dough starts to come together, mix in the cooked grains, ground flaxseeds and sunflower seeds; form the dough into a uniform ball in the center of the bowl. Be sure to scrape and use any dough stuck to the sides. The dough will be very sticky at this stage. Cover the bowl tightly with plastic wrap and keep in a warm place until the dough has doubled in size, about 2 hours.",
    "Lightly dust a baking sheet with flour. Sprinkle a generous amount of flour on a clean, dry work surface. Scrape the dough onto the floured surface and knead for a couple of minutes, working in just enough flour to make the dough less sticky but still moist to the touch. Flour your hands periodically to prevent sticking. Form the dough into one single ball or divide it into smaller balls. Place the dough ball(s) on the prepared baking sheet. Cover loosely with plastic wrap or a dish towel and let the dough rest for 30 minutes. After the 30 minutes, the dough can be shaped and cooked as desired.",
    "Yield: 1 pound pizza dough",
    "Per serving (1/4 pound): Calories: 290; Fat: 7 g (Saturated: 1 g); Cholesterol: 0 mg; Sodium: 260 mg; Carbohydrate: 47 g; Fiber: 10 g; Protein: 11 g; Sugar: 2 g",
    "Copyright 2013 Television Food Network, G.P. All rights reserved",
    "When you are stretching the dough, the whole grains and seeds may poke holes in it. Just patch them over and continue.",
    "Keep parbaked pizza shells on hand for quick weeknight meals. Roll the dough out into rounds and bake on a preheated pizza stone or baking sheet at 500 degrees F for 5 minutes. Cool, wrap the pizza shells well and freeze for up to 1 month. When ready to serve, add your favorite toppings to the frozen pizza shell and bake on a preheated pizza stone or baking sheet at 500 degrees F until hot.",
    "From Food Network Kitchens"
  ],
  "ingredients": [
    "0",
    "White whole-wheat flour, for dusting",
    "Whole-Multigrain Pizza Dough, recipe follows",
    "3 tablespoons unsalted butter",
    "2 cloves garlic, finely chopped",
    "Kosher salt",
    "1 tablespoon finely chopped fresh parsley",
    "2 tablespoons grated Parmesan",
    "Not all multigrain products are equal; in fact, most are made with refined white flour. For this dough we used white whole-wheat flour, a relative of the red wheat variety but with the same nutritional value, and we added quinoa and whole-grain bulgur wheat for extra fiber. We also added seeds, like sunflower and flax; the flaxseeds are ground to make them easier to digest and more nutritionally available.",
    "2 tablespoons whole-grain bulgur",
    "2 tablespoons quinoa",
    "1 tablespoon flaxseeds",
    "3/4 cup warm water (100 to 110 degrees F)",
    "1 teaspoon agave syrup or honey",
    "1 teaspoon active dry yeast",
    "1 1/2 cups white whole-wheat flour (6 ounces), plus more for kneading",
    "Kosher salt",
    "1 tablespoon extra-virgin olive oil",
    "1 tablespoon toasted sunflower seeds"
  ],
  "__v": 1
}