{
  "hash": "92815c0c70a858d32903a555dc47a0de565d415d",
  "title": "The Very Best Salisbury Steak Recipe",
  "image": "http://thesuburbansoapbox.com/wp-content/uploads/2016/04/Salisbury-Steak.jpg",
  "href": "http://thesuburbansoapbox.com/2016/04/13/best-salisbury-steak-recipe/",
  "extension": "Chrome",
  "firstAdded": "2017-04-17T19:58:09.061000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Report this ad",
    "In a large bowl, use your hands to blend together the beef, bread crumbs, tomato paste, worcestershire sauce, ground mustard, onion powder, pepper and salt until well combined. Divide the beef mixture into four equal size portions and form into patties about 1/2 inch thick.",
    "Heat 1 teaspoon olive oil over medium heat in a large cast iron or heavy bottomed skillet. Add the patties to the pan and cook until browned, approximately 2-3 minutes. Turn the patties over and cook for 3-4 minutes longer or until browned. Transfer to a platter and keep warm.",
    "Pour off the fat in the pan and return to the heat. Add the onions to the pan and cook until translucent. Add the mushrooms and cook until softened. Stir in the thyme, garlic powder and flour. Cook for 1 minute. Slowly add the beef stock scraping the bottom of the pan to loosen the brown bits. Stir in the worcestershire sauce and bring the mixture to a boil. When the gravy begins to thicken, turn the heat down and stir in the butter. Season with salt and pepper to taste.",
    "Return the beef patties to the pan and cook for 5-7 minutes or until they are no longer pink in the middle.",
    "Sprinkle with parsley or chives, if desired. Serve immediately"
  ],
  "ingredients": [
    "0",
    "ngredients",
    "1 pound lean ground beef",
    "1/4 cup panko bread crumbs",
    "2 tablespoons tomato paste",
    "1 teaspoon worcestershire sauce",
    "1 teaspoon ground mustard",
    "1/2 teaspoon onion powder",
    "1/2 teaspoon fresh ground pepper",
    "pinch of salt",
    "For the gravy:",
    "1 large vidalia onion, diced",
    "4 ounces sliced white mushrooms",
    "1 teaspoon fresh chopped thyme leaves",
    "1/2 teaspoon garlic powder",
    "2 1/2 tablespoons flour or cornstarch",
    "3 cups beef stock",
    "1 teaspoon worcestershire sauce",
    "1 tablespoon butter"
  ],
  "__v": 1
}