{
  "hash": "ddaa339387e88fdf3192f49d67c425f555182858",
  "title": "Cinnamon Sugar Banana Coffee Cake",
  "image": "//assets.pinterest.com/images/pidgets/pinit_fg_en_rect_gray_20.png",
  "href": "http://www.runningwithspoons.com/2015/06/15/cinnamon-sugar-banana-coffee-cake/",
  "extension": "Chrome",
  "firstAdded": "2016-02-09T11:16:52.655000",
  "users": [
    null
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "coconut",
    "oil",
    "palm",
    "sugar",
    "cinnamon",
    "wheat",
    "baking",
    "salt",
    "egg",
    "lightly",
    "plain",
    "greek",
    "yogurt",
    "vanilla",
    "almond",
    "milk",
    "honey",
    "smallmedium",
    "bananas"
  ],
  "directions": [
    "0",
    "Preheat oven to 325F and prepare an 8x8 baking dish by lining it with a sheet of aluminum foil or parchment paper, leaving a few inches of overhang on the sides to allow for easy removal. Spray foil with cooking spray and set aside.",
    "Prepare topping by combining all the ingredients in a small bowl and mixing well. The texture will be crumbly and dry, so use your hands if you're having trouble getting it to mix. Set aside.",
    "In a small bowl, combine sugar and cinnamon. Mix well and set aside.",
    "In a large mixing bowl, combine flours, baking powder, and salt. Mix well and set aside.",
    "In a medium mixing bowl, combine egg, Greek yogurt, almond milk, honey, and vanilla. Stir until fully combined. Add wet ingredients to dry ingredients and gently stir to combine. Do not over mix.",
    "Pour half of the batter into your prepared pan, using a spatula to spread it out evenly. It might seem like there's not enough in there, but it will rise quite a bit when it bakes.",
    "Lay half of the sliced bananas (so, 1 banana) across the top of the batter. Sprinkle half of the cinnamon-sugar mixture (not the topping!) over the bananas, and repeat with the remaining batter, bananas, and cinnamon-sugar. Finally, sprinkle the topping on the very top, spreading it out evenly.",
    "Bake for 25 minutes, until topping begins to turn golden brown and a toothpick inserted into the centre comes out clean. Allow to cool in pan for about 20 minutes before removing and allowing to finish cooling on a cooling rack."
  ],
  "ingredients": [
    "0",
    "1/2 cup all-purpose flour",
    "2 Tbsp. coconut oil, melted",
    "3 Tbsp. coconut palm sugar*",
    "1/2 tsp. ground cinnamon",
    "1",
    "2 Tbsp. coconut palm sugar*",
    "1 tsp. ground cinnamon",
    "1/2 cup all-purpose flour",
    "1/2 cup whole wheat flour",
    "1 1/2 tsp. baking powder",
    "1/4 tsp. sea salt",
    "1 large egg, lightly beaten",
    "1/3 cup plain Greek yogurt",
    "1/3 cup unsweetened vanilla almond milk",
    "1/4 cup honey**",
    "1 tsp. vanilla extract",
    "2 small/medium bananas, thinly sliced"
  ],
  "__v": 1
}