{
  "hash": "e3429a0fab9e9782acbec397646e9fb8629eb701",
  "title": "Grilled Shrimp with Roasted Garlic-Cilantro Sauce",
  "image": "http://i1.wp.com/www.themediterraneandish.com/wp-content/uploads/2014/12/Grilled-Shrimp-with-Garlic-Cilantro-Sauce-17.jpg?resize=600%2C900",
  "href": "http://www.themediterraneandish.com/grilled-shrimp-recipe-garlic-cilantro-sauce/",
  "firstAdded": "2015-02-28T15:49:02.790000",
  "users": [
    null
  ],
  "keywords": [
    "uncooked",
    "prawns",
    "salt",
    "pepper",
    "olive",
    "oil",
    "head",
    "garlic",
    "trimmed",
    "cilantro",
    "leaves",
    "lime",
    "juice",
    "dry",
    "white",
    "wine",
    "chili"
  ],
  "directions": [
    "0",
    "Preheat your oven to 400 degrees F.",
    "Peel, devein and rinse the prawns or your choice of shrimp. Pat dry, and then season with salt and pepper. Place the prawns in fridge until ready to grill.",
    "Trim the top of the garlic head off; leave the garlic intact and do not peel. Drizzle with olive oil. Roast the garlic in the 400 degrees F-heated oven for about 10-15 minutes or until slightly tender and fragrant. When ready, remove from the oven. Let cool briefly. Peel and crush or chop the roasted garlic as finely as possible.",
    "Now prepare the roasted garlic-cilantro sauce. In a small bowl, combine the now crushed garlic with the remaining sauce ingredients. Whisk together and set aside.",
    "When ready, heat a cast-iron grill or griddle to medium-high. Dress the prawns with a little olive oil and grill for 3-4 minutes or so on each side. You want to achieve some char, but be careful not to overcook.",
    "Remove the prawns from heat and coat with the roasted garlic and cilantro sauce. Alternatively, serve the sauce on the side instead.",
    "Serve with a side of rice and your choice of salad for dinner; or as a party appetizer."
  ],
  "ingredients": [
    "0",
    "1.5 lb uncooked prawns",
    "Salt and pepper",
    "Olive oil",
    "1",
    "1 small head garlic, top trimmed off",
    "1 cup fresh cilantro leaves, chopped",
    "1 lime, juice of",
    "1 tbsp dry white wine",
    "3 tbsp olive oil",
    "2 tbsp chili sauce (or 1 tbsp dry chili flakes)"
  ],
  "__v": 1
}