{
  "hash": "3cd3540665fb34700e7da1e7dcb4197645fd6009",
  "title": "Oreo Cheesecake Bites",
  "image": "",
  "href": "http://www.melskitchencafe.com/oreo-cheesecake-bites/",
  "extension": "Chrome",
  "firstAdded": "2016-08-07T18:37:20.065000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 325°F.",
    "Line a 9×13-inch baking pan with foil, with ends extending over sides. Finely crush 24 Oreo cookies. Melt 1/4 cup butter; mix with crumbs. Press onto bottom of prepared pan.",
    "In a large bowl, beat the cream cheese and sugar with mixer until blended. Add sour cream and vanilla; mix well. Add eggs, one at a time, beating after each just until blended. Chop remaining cookies. Gently stir into batter; pour over crust.",
    "Bake the cheesecake for about 35-40 minutes or until the sides are set and the center is almost set. Cool completely on a wire rack in the pan.",
    "When the cheesecake is completely cooled, cover with plastic wrap and refrigerate for at least 2 hours. When chilled, remove the cheesecake using the foil overhang and cut the cheesecake into bite-sized pieces. Place the cheesecake bites on a wax or parchment paper-lined baking tray. Melt the semisweet chocolate and white chocolate in separate bowls (I use the microwave on 50% power, stirring frequently). Pour the melted chocolate into a ziploc bag, one for the semisweet chocolate, one for the white chocolate. Snip a small corner off the corner of the bag and drizzle the chocolate over the cheesecake bars. Chill the bars until ready to serve. Alternately, the drizzled bites can be frozen in an airtight container for up to a month. Let them defrost in the refrigerator and serve chilled."
  ],
  "ingredients": [
    "0",
    "36 Oreo Cookies, divided",
    "1/4 cup (4 tablespoons) butter",
    "4 packages (8-ounces each) cream cheese, softened",
    "1 cup granulated sugar",
    "1 cup sour cream",
    "1 teaspoon vanilla",
    "4 large eggs",
    "4 ounces semisweet chocolate",
    "4 ounces white chocolate"
  ],
  "__v": 1
}