{
  "hash": "2678cdc46e024692f62e468be862eea9c602f257",
  "title": "Vegan Black Bean Veggie Burgers",
  "image": "https://fthmb.tqn.com/2UOnR2iScZtt6i_vZvigB2osrMA=/960x0/filters:no_upscale()/1-black-bean-burger-56a9bee85f9b58b7d0fe9c91.jpg",
  "href": "https://www.thespruce.com/easy-vegan-black-bean-veggie-burgers-3377008",
  "extension": "",
  "firstAdded": "2017-11-12T03:54:17.844000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "How to Make It",
    "Sautee the onions till soft, about 3-5 minutes.",
    "In a large bowl, mash the beans until almost smooth.",
    "Add the sauteed onions to the beans, along with the crumbled bread, seasoned salt, garlic powder, and onion powder, mixing to combine well. Then, add the flour a few tablespoons at a time and mix to combine well. Your veggie burger mixture will be very thick (you may want to use your hands to work the flour in well).",
    "Form the black bean mixture into individual patties, approximately ½ inch thick. The best way to do this is to roll a handful into a ball, then gently flatten it.",
    "Finally, fry your black bean patties in a small amount of oil over medium-low heat until slightly firm and lightly browned on each side, about 3 minutes.",
    "If your pan is too hot, your bean burgers will brown too quickly and not be heated through and cooked in the middle, so adjust the heat as needed.",
    "Assemble your veggie burgers and enjoy with all the fixings, or, eat them on a plate with a fork and a knife and ketchup - they're perfect for doing just that."
  ],
  "ingredients": [
    "0",
    "What You'll Need",
    "1/2 onion (chopped small)",
    "1 14-oz. can black beans, well-drained (Note: if you're using fresh beans, you want about 1 2/3 cup and make sure they are very well cooked because you'll be mashing them)",
    "2 slices bread (crumbled)",
    "1/2 tsp. seasoned salt (regular salt is fine, too, but the seasoned salt provides a ton of extra flavor)",
    "1 tsp. garlic powder",
    "1 tsp. onion powder",
    "1/2 cup flour",
    "Dash salt (or to taste)",
    "Dash pepper (or to taste)",
    "Oil for frying"
  ],
  "__v": 1
}