{
  "hash": "55be3f2f6db2f189ff15f5ff6d5c6e6bffa60d35",
  "title": "Vinegar-Braised Chicken with Leeks and Peas",
  "image": "http://cdn-image.foodandwine.com/sites/default/files/styles/200x250/public/original-201204-r-vinegar-braised-chicken-with-leeks-and-peas.jpg?itok=GHI20spL",
  "href": "http://www.foodandwine.com/recipes/vinegar-braised-chicken-with-leeks-and-peas",
  "extension": "Chrome",
  "firstAdded": "2015-05-08T19:02:16.317000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "legs",
    "salt",
    "pepper",
    "unsalted",
    "butter",
    "extravirgin",
    "olive",
    "oil",
    "leeks",
    "lengthwise",
    "pieces",
    "lowsodium",
    "broth",
    "white",
    "balsamic",
    "vinegar",
    "frozen",
    "baby",
    "peas",
    "thawed",
    "tarragon",
    "parsley",
    "crme",
    "frache"
  ],
  "directions": [
    "0",
    "Preheat the oven to 425° and position a rack in the upper third. Turn the chicken legs skin side down on a work surface and cut halfway through the joint. Season the chicken generously with salt and pepper.",
    "In each of 2 large nonstick skillets, heat half of the butter and oil. Add the chicken, skin side up, and cook over high heat until browned, 5 minutes. Turn and cook the chicken for 1 minute. Pile all of the chicken into one skillet.",
    "In the other skillet, cook the leeks over high heat until just beginning to soften, about 2 minutes. Add the broth and vinegar and bring to a boil. Season with salt and pepper. Pour the mixture into a medium roasting pan.",
    "Set the chicken on the leeks, skin side up; roast for about 25 minutes, until it is cooked through. Turn on the broiler and broil for about 2 minutes, until the skin is golden and crisp. Transfer the chicken to a platter.",
    "Place the roasting pan over a burner and boil over high heat until the liquid is reduced by half, about 5 minutes. Add the peas, herbs and crème fraîche and simmer until the sauce is hot and slightly thickened, about 2 minutes. Season with salt and pepper. Pour the sauce over the chicken and serve."
  ],
  "ingredients": [
    "0",
    "8 whole chicken legs",
    "Salt",
    "Freshly ground pepper",
    "3 tablespoons unsalted butter",
    "3 tablespoons extra-virgin olive oil",
    "3 large leeks, halved lengthwise and cut into 1-inch pieces",
    "1 cup low-sodium chicken broth",
    "1/4 cup white balsamic vinegar",
    "One 10-ounce package frozen baby peas, thawed",
    "2 tablespoons chopped tarragon",
    "2 tablespoons chopped parsley",
    "1/2 cup crème fraîche"
  ],
  "__v": 1
}