{
  "hash": "15b722642fb103828222b337690a0b001b09cd7a",
  "title": "Erdbeer- und Zitronencreme",
  "image": "https://files.billa.at/fg/thema7/20160501_30_l.jpg",
  "href": "https://frischgekocht.billa.at/rezept/erdbeer--und-zitronencreme-BI-25473",
  "extension": "Firefox",
  "firstAdded": "2018-01-03T13:11:07.865000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Für die Zitronencreme die Butter in 2 cm große Würfel schneiden. Zitronen heiß waschen, trocken reiben und die Schalen über einem Topf fein abreiben. 150 ml Zitronensaft auspressen, mit 160 g Zucker in den Topf geben und zum Kochen bringen. Gleichzeitig Ei und Dotter in einer Schüssel verschlagen. Den kochenden Zitronensaft unterrühren und zurück in den Topf gießen. Unter ständigem Rühren bei mittlerer Temperatur erhitzen (nicht kochen!), bis eine dicke Creme entsteht. Vom Herd nehmen und die kalten Butterwürfel unter Rühren in der Creme auflösen. Die heiße Creme durch ein Sieb gießen und gleichmäßig auf 8 Gläser (à 200¿250 ml) verteilen. Ca. 30 Minuten kalt stellen, bis die Zitronencreme fest ist.",
    "Währenddessen für die Erdbeercreme die Gelatine in kaltem Wasser einweichen. Erdbeeren putzen. 250 g Erdbeeren pürieren, 100 g Erdbeeren vierteln. Joghurt mit Erdbeerpüree und Erdbeervierteln verrühren. Gelatine ausdrücken und in einem kleinen Topf bei schwacher Hitze auflösen. Mit 3 EL Joghurtmasse verrühren, dann die restliche Joghurtmasse unterrühren. Restlichen Zucker (80 g) unterrühren. Den Topf in Eiswasser stellen und die Creme gelegentlich rühren, bis sie zu gelieren beginnt. Obers steif schlagen und unter die Creme ziehen.",
    "Erdbeercreme in die Gläser auf die Zitronencreme gießen und 2 bis 3 Stunden kalt stellen, bis sie fest ist. Die restlichen Erdbeeren halbieren.",
    "Creme mit Erdbeerhälften garnieren und servieren."
  ],
  "ingredients": [
    "0",
    "150",
    "g",
    "kalte Butter",
    "3",
    "Biozitronen",
    "240",
    "g",
    "Feinkristallzucker",
    "1",
    "Ei (Größe M)",
    "3",
    "Eidotter (Größe M)",
    "4",
    "Blatt",
    "Gelatine",
    "500",
    "g",
    "Erdbeeren",
    "300",
    "g",
    "Joghurt",
    "250",
    "ml",
    "Obers"
  ],
  "__v": 1
}