{
  "hash": "0c77205d5adb2b545d2b7d9164e103b3a725a969",
  "title": "Braised Chicken Thighs with Garlic, Lemon and Greek Olives",
  "image": "https://prods3.imgix.net/images/articles/2016_01/Goliath-Chicken-Thighs-Braised-Marco-Canora-Mediterannean-Olives-Garlic-Lemon-Marco-Canora-Weeknight-Dinner-Recipe.jpeg?auto=format%2Ccompress&dpr=1.25&ixjsv=2.2.3&q=75&w=750",
  "href": "https://www.tastingtable.com/cook/recipes/braised-chicken-thighs-with-garlic-lemon-and-greek-olives-r",
  "extension": "Chrome",
  "firstAdded": "2019-10-07T23:43:04.534000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Remove the chicken from the fridge 20 minutes before cooking to remove the chill. Preheat the oven to 350°. Season the chicken on both sides with salt and pepper.",
    "In a large ovenproof pan or Dutch oven large enough to hold all the thighs in a single layer, heat the olive oil over medium-high heat. When the oil is hot, add the chicken, skin-side down, and sear until golden brown, 5 to 6 minutes. Add the garlic cloves to the pan and flip the thighs over. Cook until the garlic is fragrant and has gotten a little brown, 2 to 3 minutes. Remove the chicken and garlic from the pan and set aside.",
    "With the pan still hot, add the onions, lemon slices and oregano, and season with salt and pepper. Cook, stirring often, until the onions have wilted and the brown bits on the bottom of the pan have loosened, 6 to 8 minutes. Nestle the thighs skin-side up in the onion mixture and add the garlic and the olives. Pour the lemon juice over the chicken and transfer the pan to the oven. Bake for 40 to 50 minutes. Scatter fresh oregano leaves over the top and serve."
  ],
  "ingredients": [
    "0",
    "8 bone-in, skin-on chicken thighs",
    "Kosher salt and freshly ground black pepper, to taste",
    "3 tablespoons extra-virgin olive oil",
    "12 garlic cloves",
    "2 large yellow onions, thinly sliced (about 4 cups)",
    "1 lemon, thinly sliced, seeds discarded",
    "2 tablespoons fresh oregano leaves, plus more for garnish",
    "1 cup mixed Greek olives",
    "Juice of 1 lemon"
  ],
  "__v": 1
}