{
  "hash": "9ea47fe93f8489fd76b8331410164f974159745a",
  "title": "spanish chorizo and rabbit stew",
  "image": "https://i1.wp.com/naturalkitchenadventures.com/wp-content/uploads/2013/06/rabbit-chorizo-16.jpg?zoom=2&resize=625%2C517&ssl=1",
  "href": "https://naturalkitchenadventures.com/spanish-chorizo-and-rabbit-stew/",
  "extension": "Chrome",
  "firstAdded": "2018-06-24T18:29:24.879000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Use a large frying pan, big enough for all the rabbit pieces. Heat the oil on a low heat and gently fry the chorizo until the fat runs. Remove the chorizo from the pan, with a slotted spoon leaving the juices in the pan, and set aside.",
    "Season the rabbit pieces with salt and pepper and fry until golden brown on both sides, this should take about 5-10 minutes.",
    "Meanwhile make up the Spanish sauce. Put the cherry tomatoes, whole garlic cloves and paprika powder into a mini food processor. Pulse until smooth then push through a sieve with a small ladle - this is to get rid of the seeds which you can now discard.",
    "Once the rabbit is golden add the Spanish tomato sauce to the pan and bring up to a simmer. This is quite a dry stew so there won't be much sauce. Cook (no lid required) for about 15 minutes until the tomato mixture has thickened up.",
    "Next add the sliced peppers to the pan, along with the browned chorizo. Pour in the chicken stock and bring to a low simmer again.",
    "If you have a suitable lid now cover the pan (even partially - I use the lid from my slow cooker - resourceful hey?) to keep in the heat which will help cook the rabbit through. Leave for around 30 minutes.",
    "While the rabbit is cooking make up the dressing by mixing together the finely chopped parsley, olive oil and lemon in a bowl.",
    "Once the rabbit is cooked through, remove the rabbit meat from the stew, allow to cool for a minute of so so you don't burn your hands and pull all the meat from the bones. Put the flesh back in the stew and stir through the sauce.",
    "Transfer to a serving dish (or take the frying pan to the table to save on washing up) and",
    "drizzle over the parsley dressing."
  ],
  "ingredients": [
    "0",
    "olive oil",
    "Approx 150g raw picante chorizo sausages, diced into small pieces",
    "1 whole rabbit - jointed",
    "200g cherry tomatoes",
    "4 cloves garlic",
    "½ tsp paprika & ½ tsp smoked paprika",
    "2 roasted red pointed peppers thickly sliced (I roasted mine the night before when cooking something else. You could also use the jarred variety)",
    "200mls hot chicken stock",
    "2tbsp chopped parsley,",
    "3 tbsp extra-virgin olive oil (Garlic infused),",
    "¼ lemon"
  ],
  "__v": 2
}