{
  "__v": 1,
  "directions": [
    "0",
    "In a large bowl combine the flour and baking powder. Make a well in the center and add the milk, vanilla and egg yolks. Gently whisk together all the wet ingredients to combine in the well, then start to incorporate the flour mixture into the wet—this will help ensure a lump-free batter.",
    "In a separate bowl with an electric mixer, whip the egg whites to soft peaks. Continue whipping, and gradually add the sugar until the egg whites form stiff, glossy peaks.",
    "Place a 10-inch non-stick pan on medium heat and add 1.5 tablespoons of butter. Once the butter is almost melted, quickly fold the egg whites into the batter until well combined. The butter should now be fully melted and bubbling (possibly browning!)—swirl it around the pan to evenly coat the bottom, quickly pour the batter into the pan and place the lid on. The pancake should need 5-10 minutes on the first side, depending on your pan size.",
    "Once the pancake is browned on the bottom (use a spatula to peek), and setting on the top, slide the pancake out onto a large flat plate, using your spatula to assist. Melt the remaining butter in the pan and drizzle the melted butter over the partially cooked top of the pancake on the plate. Place the now empty skillet over the top of the pancake and carefully flip the whole plate/pancake/skillet upside down, so the pancake is back in the skillet. The second side should need another 5-10 minutes.",
    "Slice, drizzle with honey and chopped peaches and EAT! If you have leftovers, I liked them best reheated in a pan over medium heat until slightly toasty around the edges and light as air in the middle."
  ],
  "firstAdded": "2014-08-18T23:43:46.678000",
  "hash": "39e484048de3f7590cfc50c704720a9dd9b85372",
  "href": "http://www.thepancakeprincess.com/2013/09/13/pancake-fridays-the-thickest-puffiest-pancake-yet/",
  "image": "http://www.thepancakeprincess.com/wp-content/uploads/2013/09/IMG_2282.jpg",
  "ingredients": [
    "0",
    "1 cup white whole wheat flour",
    "1.5 teaspoons baking powder",
    "1 cup almond milk",
    "1 teaspoon vanilla",
    "4 eggs, separated",
    "2 tablespoons brown sugar",
    "2 tablespoons butter",
    "honey, peaches, or other fruit for topping"
  ],
  "keywords": [
    "white",
    "wheat",
    "flour",
    "baking",
    "almond",
    "milk",
    "vanilla",
    "eggs",
    "separated",
    "brown",
    "sugar",
    "butter",
    "honey",
    "peaches",
    "fruit"
  ],
  "title": "Pancake Friday: Kaiserschmarrn",
  "users": [
    null
  ]
}