{
  "hash": "e571eaae60a57ef33fe6aba229a350d8a8c10901",
  "title": "LACTO-FERMENTED RUSTIC SALSA",
  "image": "",
  "href": "http://www.foodrenegade.com/lactofermented-rustic-salsa/",
  "extension": "",
  "firstAdded": "2015-09-24T21:39:44.361000",
  "users": [
    null
  ],
  "keywords": [
    "medium",
    "organic",
    "tomatoes",
    "onion",
    "bell",
    "peppers",
    "stem",
    "pith",
    "seeds",
    "garlic",
    "jalapenos",
    "depending",
    "hot",
    "buy",
    "salt",
    "whey",
    "veggie",
    "starter",
    "culture",
    "starters",
    "filtered",
    "needed",
    "water",
    "purifiers",
    "recommend"
  ],
  "directions": [
    "0",
    "Get your food processor ready with the regular blade attachment. Process the tomatoes first, blending until the juices release and the tomato chunks are at your desired size (I love small bits, but you can always go bigger). Transfer to the glass bowl.",
    "Repeat the same process as with the tomatoes with the onion, bell peppers, garlic, and jalapenos. Transfer all ingredients to the glass bowl, add the sea salt and liquid whey. Mix well until everything is evenly distributed.",
    "Distribute the prepped salsa equally between two one-quart mason jars. Be sure that the salsa is covered with the salsa liquid by at least 1 inch, if it is not and there is not enough liquid, add filtered water as needed. Allow to ferment on the counter for 2 to 3 days and then transfer to your refrigerator. Now your lacto-fermented salsa is ready to eat. Enjoy!"
  ],
  "ingredients": [
    "0",
    "6 medium organic tomatoes, halved",
    "1 large organic onion, peeled and halved",
    "4 organic sweet bell peppers; stem, pith, and seeds removed",
    "4 organic cloves of organic garlic, peeled",
    "1 (to 2) small organic jalapenos (depending on how hot you like it), stem and seeds removed (optional)",
    "2 teaspoons sea salt (where to buy sea salt)",
    "4 tablespoons liquid whey or Veggie Starter Culture (where to buy starters)",
    "filtered water, if needed (see what water purifiers I recommend)"
  ],
  "__v": 1
}