{
  "hash": "18f3a757f0290e358cd767822faa71233ff9207b",
  "title": "Rainbow cake",
  "image": "http://www.bbcgoodfood.com/sites/default/files/styles/bbcgf_recipe/public/recipe_images/recipe-image-legacy-id--1267466_7.jpg?itok=GJotfALP",
  "href": "http://www.bbcgoodfood.com/recipes/3028705/rainbow-cake",
  "extension": "Chrome",
  "firstAdded": "2015-11-15T21:19:56.895000",
  "users": [
    null
  ],
  "keywords": [
    "butter",
    "softened",
    "extra",
    "greasing",
    "plain",
    "flour",
    "golden",
    "caster",
    "sugar",
    "medium",
    "eggs",
    "important",
    "use",
    "correct",
    "size",
    "baking",
    "salt",
    "vanilla",
    "edible",
    "food",
    "colouring",
    "red",
    "orange",
    "yellow",
    "green",
    "blue",
    "purple",
    "pink",
    "tubs",
    "cream",
    "cheese",
    "mascarpone",
    "icing"
  ],
  "directions": [
    "0",
    "Heat oven to 180C/160C fan/gas 4. Grease 2 x 20cm round sandwich tins and line the bases with baking parchment. Tip all the sponge ingredients, apart from the food colouring, into a mixing bowl, then beat with an electric whisk until smooth.",
    "Working quickly, weigh the mixture into another bowl to work out the total weight, then weigh exactly half the mixture back into the mixing bowl. Pick 2 of your colours and stir a little into each mix. Keep going until you are happy with the colour – the colour of the batter now will be very similar to the finished cake, so be brave! Scrape the different batters into the tins, trying to spread and smooth as much as possible – but try not to waste a drop of the batter – a rubber spatula will help you. Bake on the same oven shelf for 12 mins until a skewer poked into the middle comes out clean.",
    "Gently turn the cakes out onto a wire rack to cool. Wash the tins and bowls thoroughly, and start again from step 1 – this time using another 2 colours. Unless you’re making the optional pink layer, repeat one more time to get 6 sponges, all of different colours. Leave them all to cool.",
    "To make the icing, very briefly beat the vanilla and cream cheese or mascarpone with an electric whisk until smooth. Sift in the icing sugar and gently fold in with a spatula. Be careful – the more you work it, the runnier it will get, increasing the chance of splitting.",
    "Smear a little icing on your cake stand or plate – just a splodge to stick the first sponge. Start with the red, then spread with some icing right to the very edge. Repeat, sandwiching on top the orange, yellow, green, blue and finally purple sponges. Spread the remaining icing thickly all over the sides and top of the cake. For more tips and expert advice on how to create the perfect rainbow cake, check out our tips, below.",
    "1",
    "1",
    "2",
    "3",
    "4",
    "5"
  ],
  "ingredients": [
    "0",
    "125g butter, softened, plus a little extra for greasing",
    "225g plain flour",
    "150g golden caster sugar",
    "3 medium eggs (very important to use the correct size)",
    "1 tsp baking powder",
    "pinch of salt",
    "1 tsp vanilla extract",
    "edible food colouring - red, orange, yellow, green, blue and purple, plus optional pink (see below)",
    "1",
    "1 tsp vanilla extract",
    "3 x 250g tubs cream cheese or mascarpone",
    "350g icing sugar"
  ],
  "__v": 1
}