{
  "hash": "93d72392b8b243cf55d070ca591db848eaef3836",
  "title": "Caramel Apple Cinnamon Scones",
  "image": "https://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2015/08/Caramel-Apple-Cinnamon-Scones-4.jpg",
  "href": "https://sallysbakingaddiction.com/2015/09/10/caramel-apple-cinnamon-scones/",
  "extension": "Chrome",
  "firstAdded": "2018-10-09T17:22:24.911000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400°F (204°C). Adjust baking rack to the middle-low position. Line a large baking sheet with parchment paper or a silicone baking mat. Set aside.",
    "In a large bowl, whisk the flour, baking powder, cinnamon, and salt. Grate the frozen butter (I use a box grater; a food processor also works - here is the one I own and love). Toss the grated butter into the flour mixture and combine it with a pastry cutter, a fork, or your fingers until the mixture resembles coarse meal. Set aside.",
    "In a small bowl, whisk the cream, egg, brown sugar, and vanilla together. Drizzle it over the flour mixture and then toss the mixture together with a rubber spatula until everything appears moistened. Slowly and gently fold in the chopped apple. Try your best to not overwork the dough at any point. Dough will be a little wet. Work the dough into a ball with floured hands as best you can and transfer to a floured surface. Press into a neat 8″ disc and cut into 8 equal wedges with a very sharp knife. Place scones at least 2 inches apart on the prepared baking sheet. Brush scones with optional 1 Tbsp cream and sprinkle with coarse sugar. (Makes them shiny and gives a little extra crunch!)",
    "Bake for 20-25 minutes or until lightly golden and cooked through. Remove from the oven and allow to cool for a few minutes before drizzling with caramel sauce.",
    "Make ahead tip: Scones are best enjoyed right away, though leftover scones keep well at room temperature for 2 extra days. Scones freeze well, up to 3 months. Thaw overnight in the refrigerator and heat up to your liking before enjoying."
  ],
  "ingredients": [
    "0",
    "2 cups (240g) all-purpose flour (measured correctly), plus more for hands and work surface",
    "2 and 1/2 teaspoons baking powder",
    "1 and 1/4 teaspoons ground cinnamon",
    "½ teaspoon salt",
    "1/2 cup (115g) unsalted butter, frozen",
    "1/2 cup (120ml) heavy cream",
    "1 large egg",
    "1/2 cup (100g) packed light or dark brown sugar",
    "1 teaspoon vanilla extract",
    "1 heaping cup (125g) peeled and chopped apple (I use Granny Smith)1",
    "optional: 1 Tablespoon cream and coarse sugar",
    "1/2 cup (120ml) store-bought or homemade caramel sauce2"
  ],
  "__v": 1
}