{
  "hash": "cf04cbd3152266f062af208c6bd4b9c86fa1b323",
  "title": "Italian cheesecake: Ricotta Chevre Cake",
  "image": "//images.csmonitor.com/csm/2016/09/1005423_1_0928_Food_ItalianCheesecake_standard.jpg?alias=standard_600x400",
  "href": "http://www.csmonitor.com/The-Culture/Food/Stir-It-Up/2016/0928/Hold-the-cream-cheese-for-this-Italian-cheesecake-Ricotta-Chevre-Cake",
  "extension": "Chrome",
  "firstAdded": "2016-10-15T04:12:10.614000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Set out the eggs, butter and cheese an hour before you intend to start, to let everything come to room temperature.",
    "Preheat the oven to 350 degrees F. Put the cherries in a shallow bowl or soup plate and macerate them in warm water just to cover. (You can also use brandy, or a mix of brandy and water.) Butter the springform pan.",
    "Put the butter and the sugar in a large mixing bowl. With a hand mixer, beat them together until all is uniform. It will look grainy.",
    "Add the eggs, one at a time, scraping down the sides with a spatula so everything is mixed in. At the end, the batter will look sleek and smooth. Mix in the vanilla, lemon juice and lemon zest. Sift 6 tablespoons of the flour, the salt and baking powder over the batter, then mix together using the beater.",
    "Press the goat cheese and then the ricotta through a sieve straight onto the batter (the goat cheese will be thicker and more reluctant to be sieved). Then gently fold all together by hand until it is even.",
    "Drain the cherries and pat them dry with a lint-free cloth or paper towels. Toss them with the remaining tablespoon of flour, then fold them into the batter too, so all is uniform. Carefully pour the batter into the springform pan. Smooth out the top.",
    "Slide into the oven. Set a timer for 60 minutes. The cake will be ready when the edges are golden brown and start pulling away from the sides, and the top looks lightly browned, like the photo. It may take as much as 75 minutes depending on your oven.",
    "Let it cool in the pan, then remove the ring. If you intend to keep it overnight, wrap in plastic and store in the fridge.",
    "Kitchen Notes",
    "Make it your own. If you prefer, use the traditional raisins or golden raisins, or your favorite dried fruit. You may also omit the lemon juice. Also, you may omit the goat cheese and substitute the same amount of ricotta. For us, the lemon juice and goat cheese added a fresh, tart note. Leaving them out will make it creamier tasting. I’ve also seen versions of this that use chocolate chips, and that is next on my agenda.",
    "Brandy? No brandy? Adding some brandy when macerating the fruit does much the same thing any alcohol does in any recipe. It gives it one more complex note. We keep an inexpensive brandy on hand for things just like this – and for upping the game on various sauces. In sauces – again, like any alcohol – brandy has a knack of turning gravy into sauce. But if you don’t have brandy on hand, no need to buy some. The difference is subtle."
  ],
  "ingredients": [
    "0",
    "8 tablespoons unsalted butter, plus a bit extra for the pan",
    "4 large eggs",
    "8 ounces chevre (fresh goat cheese)",
    "1-1/2 pounds whole milk ricotta",
    "1-1/4 cup dried tart cherries (see Kitchen Notes)",
    "warm water (or brandy – see Kitchen Notes)",
    "1-1/4 cup sugar",
    "2 teaspoons vanilla extract",
    "zest of 1 lemon, plus 2 tablespoons lemon juice",
    "7 tablespoons flour, divided",
    "1/2 teaspoon salt",
    "1 tablespoon baking powder",
    "2 tablespoons lemon juice",
    "Special equipment: 9-inch springform pan"
  ],
  "__v": 1
}