{
  "hash": "13acc9023a881edbf949f7e057cd668f37d5ddcb",
  "title": "Spinach Artichoke DipHot Artichoke Spinach Dip",
  "image": "http://img.sndimg.com/food/image/upload/w_555,h_416,c_fit,fl_progressive,q_95/v1/img/recipes/12/09/pic5mK4xt.jpg",
  "href": "http://www.food.com/recipe/spinach-artichoke-dip-1209",
  "extension": "Chrome",
  "firstAdded": "2016-08-07T17:19:52.689000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 375°F.",
    "Mix together Parmesan cheese, spinach, and artichoke hearts.",
    "Combine remaining ingredients and mix with spinach mixture.",
    "Bake for 20-30 minutes.",
    "Serve with crackers or toasted bread.",
    "1",
    "Put the artichoke hearts and spinach in a microwave-safe bowl, and cover it with plastic wrap. Cut a small slit in the plastic to let the steam out, then microwave on high for 4 minutes. Stir, and zap it again for another 2 to 3 minutes or until the artichoke hearts are tender. If you don't want to use a microwave you can also boil the spinach and artichoke hearts in a cup of water in a small saucepan over medium heat until tender, around 10 minutes. Drain in a colander when done.",
    "Heat the cream cheese in a small bowl in the microwave set on high for 1 minutes. Or, use a saucepan to heat the cheese over medium heat just until hot.",
    "Add the spinach and artichoke hearts to the cream cheese and stir well.",
    "Add the remaining ingredients to the cream cheese and combine. Serve warm with crackers, chips, or toasted bread for dipping.",
    "To make a lighter version, use reduced fat cream cheese."
  ],
  "ingredients": [
    "0",
    "2 cups parmesan cheese",
    "1 (10 ounce) box frozen chopped spinach, thawed",
    "1 (14 ounce) can artichoke hearts, drained and chopped",
    "2⁄3 cup sour cream",
    "1 cup cream cheese",
    "1⁄3 cup mayonnaise",
    "2 teaspoons garlic, minced",
    "1",
    "1 cup diced artichoke heart (frozen or canned, but not marinated)",
    "1⁄2 cup frozen chopped spinach, thawed",
    "8 ounces cream cheese",
    "1⁄2 cup grated parmesan cheese",
    "1⁄2 teaspoon crushed red pepper flakes",
    "1⁄4 teaspoon salt",
    "1⁄8 teaspoon garlic powder",
    "1 dash ground pepper"
  ],
  "__v": 1
}