{
  "hash": "6443bac4490300da8f3f1d7c1a81c7b716ab1b77",
  "title": "Shredded Beef Enchiladas",
  "image": "http://4.bp.blogspot.com/-VEz0RSmjFPY/UbsjZU63I8I/AAAAAAAAJHs/Qt-YlnjaMlc/s640/editedShredded+Beef+Enchiladas+033.jpg",
  "href": "http://www.melissassouthernstylekitchen.com/shredded-beef-enchiladas",
  "extension": "Chrome",
  "firstAdded": "2015-05-31T00:34:20.242000",
  "users": [
    null
  ],
  "keywords": [
    "enchilada",
    "youll",
    "need",
    "onion",
    "olive",
    "oil",
    "tomato",
    "prepared",
    "taco",
    "seasoning",
    "cumin",
    "chipotle",
    "pepper",
    "enchiladas",
    "medium",
    "poblano",
    "garlic",
    "tomatoes",
    "green",
    "chilis",
    "rotel",
    "chili",
    "fixins",
    "cinnamon",
    "chuck",
    "roast",
    "flour",
    "corn",
    "tortillas",
    "colbyjack",
    "cheddar",
    "cheese",
    "divided",
    "cilantro",
    "pico",
    "gallo"
  ],
  "directions": [
    "0",
    "To make the enchilada sauce In a small saucepan, cook ¼ cup of chopped onion in a small amount of olive oil until translucent.",
    "Add 1 can of tomato sauce and all of the seasonings. Stir well and season with salt to your taste.",
    "Lower the heat and simmer for 8-10 minutes then remove from the heat to cool slightly.",
    "To make the filling for the enchiladas: Preheat the oven to 375°F and spray a 9 x 13 inch dish with cooking spray.",
    "In a stove top pot over medium high heat, saute the chopped onion and poblano pepper in a couple of drizzles of olive oil. Season with salt and black pepper to taste. Cook until the veggies turn translucent and are beginning to brown.",
    "Add the minced garlic and 1 can of Rotel Chili Fixin's. Cook for 5 minutes, on medium low heat. Add the taco seasoning, ground chipotle pepper and cinnamon.",
    "Taste and adjust to your taste. Continue to simmer for around 5 minutes.",
    "Add ½ cup of taco sauce and the shredded beef. Simmer the beef on low heat for 8-10 minutes to allow it to warm and soak in all of the flavors from the spices and tomato sauce. Remove from the heat.",
    "Divide the shredded beef equally between tortillas. Spoon down the middle of the tortilla. Sprinkle ½ of the shredded cheese over the beef..",
    "Roll the tortillas and place seam side down side by side, in the baking dish.",
    "Pour the homemade enchilada sauce on top from end to end. Sprinkle the remaining 1 cup of shredded Colby-Jack cheese over the top and place into the oven.",
    "Bake for 25 minutes until the cheese is golden and the enchiladas are bubbly around the edge. Allow to rest for 5 minutes before serving.",
    "Garnish with fresh cilantro or pico de gallo. Yield: 6 flour or 8 corn shredded beef enchiladas"
  ],
  "ingredients": [
    "0",
    "For the homemade enchilada sauce you'll need:",
    "¼ cup onion, finely diced",
    "olive oil",
    "1 [15 oz] can tomato sauce",
    "3 tsp prepared taco seasoning",
    "½ tsp cumin",
    "¼ tsp ground chipotle pepper",
    "For the enchiladas:",
    "1 small onion, diced",
    "1 medium poblano pepper, diced",
    "olive oil",
    "4 cloves garlic, minced",
    "1 [10 oz] can diced tomatoes & green chili's [i.e. Rotel Chili Fixin's]",
    "2 Tbsp prepared taco seasoning [more or less to your taste]",
    "¼ tsp ground chipotle pepper",
    "⅛ tsp cinnamon",
    "3 cups cooked chuck roast, shredded",
    "½ cup taco sauce",
    "6 [8] inch flour tortillas or 8 [6] inch corn tortillas",
    "2 cups shredded Colby-Jack cheddar cheese, divided",
    "3 Tbsp chopped fresh cilantro",
    "fresh pico de gallo"
  ],
  "__v": 1
}