{
  "hash": "f5da1ef971970f87d69f69049f6325e335dd98e6",
  "title": "Barbecued chicken",
  "image": "//img.jamieoliver.com/jamieoliver/recipe-database/oldImages/xtra_med/52_36_1433952202.jpg?tr=w-414,",
  "href": "https://www.jamieoliver.com/recipes/chicken-recipes/barbecued-chicken/",
  "extension": "Chrome",
  "firstAdded": "2018-08-21T11:45:21.753000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "If barbecuing, light the grill now so the flames have died down and it’s ready when you’re ready to cook.",
    "Finely grate the orange zest into a shallow bowl. Crumble in the dried chilli. Add the paprika, mustard, honey, ketchup and a splash of olive oil. Season with a small pinch each of the salt and pepper and mix well. Spoon out a few tablespoons of the marinade and set it aside.",
    "Add the chicken breasts to the bowl with the remaining marinade. Turn them over in the marinade so they’re well coated, cover with plastic wrap and leave to sit for 5 to 10 minutes or until the grill is ready.",
    "If using a grill pan, put it over high heat now to get it screaming hot. Use tongs to transfer your chicken breasts onto the grill or grill pan. For chicken breasts about 1 inch thick, cook for about 5 minutes on each side, turning every minute and basting as you go, or until golden and cooked through. Spoon a little of the reserved sauce over each breast.",
    "Serving suggestions: Lovely served with the evolution potato salad and a fresh green salad, or delicious sliced in sandwiches in some good-quality bread. Add some leafy lettuce and sliced tomato to give it a good crunch.",
    "Jamie’s top tips • This marinade can be used on other lean proteins such as shrimp, pork tenderloin or flank steak. If the outside of the meat or fish looks dry, brush a little of the marinade over it whilst cooking. • When zesting citrus fruit, use a Microplane or similar zester so you only remove the colored zest without digging into the bitter white pith underneath. • When grilling, you need to keep control of the heat really carefully so the food cooks through properly before it starts burning on the outside. If your meat starts to char soon after putting it on the grill or in the pan, move it to a cooler part of the grill or turn the heat right down. • If you’re doing this on the stovetop, it will work best in a well-seasoned cast-iron or non-stick grill pan. • It’s good to have one side of the barbecue with fewer coals so it’s cooler. The coals are ready when the flames have died down."
  ],
  "ingredients": [
    "0",
    "1 orange",
    "1 dried chilli",
    "1½ heaped teaspoons smoked paprika",
    "1½ teaspoons Dijon or English mustard",
    "3 tablespoons honey",
    "3 tablespoons ketchup",
    "1 teaspoon olive oil",
    "1/16 teaspoon sea salt , to taste",
    "1/16 teaspoon freshly ground pepper , to taste",
    "4 x 5 oz boneless skinless higher-welfare chicken breasts"
  ],
  "__v": 1
}