{
  "hash": "6fc67304da547873bc3a9eb3c13934ba2da4fed2",
  "title": "Amalfi lemon tart",
  "image": "//img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/77639012.jpg?tr=w-414,",
  "href": "https://www.jamieoliver.com/recipes/fruit-recipes/amalfi-lemon-tart/",
  "extension": "Chrome",
  "firstAdded": "2018-11-22T16:21:43.959000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To make the pastry, put the flour and icing sugar into a large bowl with a good pinch of sea salt. Make a well in the middle, then add the oil, wine and vanilla paste. Use a fork to whip up the wet mixture, gradually bringing the flour in from the outside until it comes together as a ball of dough. Tip on to a lightly floured surface and knead for just a couple of minutes, then wrap in clingfilm and place in the fridge for 30 minutes.",
    "On a flour-dusted surface, roll out the pastry to about 3mm thick. Loosely roll it up around the rolling pin and unroll it over a 25cm loose-bottomed tart tin, easing and pushing it carefully into the sides. Trim off any excess, patch up any holes, then prick the base with a fork, cover with clingfilm, and chill in the freezer for 1 hour 30 minutes.",
    "Preheat the oven to 180ºC/350ºF/gas 4. When the time’s up, bake the pastry case blind for 25 minutes, or until lightly golden. Meanwhile, finely grate the zest of 1 lemon and put aside. Squeeze all the lemons to give you 150ml of juice, then whisk with the rest of the filling ingredients until smooth, by hand or in a food processor. Pour into the tart case and bake for 30 minutes, dusting with icing sugar and sprinkling over the lemon zest for the last 5 minutes. Transfer to a wire rack to cool – it will have a slight wobble, but will set as it cools. Dust with extra icing sugar, then slice and serve.",
    "Comments"
  ],
  "ingredients": [
    "0",
    "PASTRY",
    "250 g plain flour , plus extra for dusting",
    "50 g icing sugar , plus extra for dusting",
    "75 ml olive oil",
    "75 ml Greco di Tufo white wine",
    "½ teaspoon vanilla bean paste",
    "FILLING",
    "5 large lemons",
    "500 g quality ricotta cheese",
    "150 g caster sugar",
    "2 large free-range eggs"
  ],
  "__v": 1
}