{
  "hash": "3911037c584c13a1f3a6bba80abf6ab01db4aa26",
  "title": "Sautéed Cabbage and Apples",
  "image": "http://cdn-image.myrecipes.com/sites/default/files/styles/300x300/public/image/recipes/ck/14/01/sauteed-cabbage-apples-ck-x.jpg?itok=_1XT3COm",
  "href": "http://www.myrecipes.com/recipe/sauteed-cabbage-apples",
  "extension": "Chrome",
  "firstAdded": "2015-12-18T20:05:04.798000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "butter",
    "canola",
    "oil",
    "green",
    "cabbage",
    "apple",
    "caraway",
    "seeds",
    "salt"
  ],
  "directions": [
    "0",
    "Heat a large skillet over medium-high heat. Add butter and oil to pan; swirl until butter melts. Add cabbage, apple, caraway seeds, and salt; cover and cook 5 minutes. Uncover and cook 5 minutes or until cabbage and apples are tender, stirring occasionally.",
    "Cider-Braised: Heat a large skillet over medium-high heat. Add 1 tablespoon canola oil; swirl to coat. Add 2 cups sliced onion; sauté 2 minutes. Add 8 cups sliced green cabbage, 1 cup hard cider or regular cider, 2 tablespoons whole-grain mustard, and 1/4 teaspoon salt, tossing to combine. Cook, covered, 5 minutes. Uncover and cook 8 minutes or until cabbage wilts, stirring occasionally. Stir in 1 tablespoon cider vinegar. Serves 6 (serving size: 1 cup) CALORIES 85; FAT5g (sat 0.2g); SODIUM 237mg",
    "Mango Vinaigrette: Combine 1/2 cup chopped mango, 1 tablespoon canola oil, 1 tablespoon fresh lime juice, and 1/4 teaspoon salt in a mini food processor; process until smooth. Place 5 cups thinly sliced green cabbage, 1/2 cup diced mango, and 1/4 cup thinly sliced green onions in a large bowl, tossing to combine. Drizzle cabbage mixture with pureed mango mixture; toss to coat. Sprinkle with 3 tablespoons chopped toasted cashews. Serves 6 (serving size: about 3/4 cup) CALORIES 78; FAT 4.5g (sat 0.6g); SODIUM 111mg",
    "Chile-Garlic: Combine 4 teaspoons fresh lime juice, 4 teaspoons brown sugar, 2 teaspoons fish sauce, and 1 teaspoon sambal oelek in a small bowl. Heat 1 tablespoon dark sesame oil in a large skillet over medium-high heat; swirl. Add 8 cups sliced green cabbage to pan; cook 7 minutes or until lightly browned. Stir in brown sugar mixture; cook 4 minutes, stirring occasionally. Stir in 1/4 cup chopped fresh cilantro leaves. Serves 6 (serving size: 2/3 cup) CALORIES 57; FAT 2.4g (sat 0.4g); SODIUM 193mg"
  ],
  "ingredients": [
    "0",
    "1 tablespoon unsalted butter",
    "2 teaspoons canola oil",
    "8 cups sliced green cabbage",
    "2 cups sliced apple",
    "1 teaspoon caraway seeds",
    "1/2 teaspoon salt"
  ],
  "__v": 1
}