{
  "hash": "b4ed4601a3f09e2bdc08e30d0af4b0eca8232ede",
  "title": "Smothered Pork Chops",
  "image": "http://emerils.com/sites/default/files/styles/wmax-600-sq/public/em-legacy-images//20131106-09J_SmotheredPorkChops.jpg?itok=nkpxa2-w",
  "href": "http://emerils.com/126629/smothered-pork-chops",
  "extension": "Chrome",
  "firstAdded": "2016-06-28T17:50:00.774000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Season both sides of the chops with the Essence.",
    "Heat the olive oil in a large heavy pot or Dutch oven over high heat. Add the pork chops, 3 or 4 at a time, and lightly brown, about 2 minutes per side. Remove the pork chops and transfer to a platter. Set aside.",
    "Reduce the heat to medium. Add the flour and stir constantly until the roux is the color of peanut butter, about 4 minutes. Add the onions, salt, and black pepper. Cook, stirring, until the onions are slightly soft, about 5 minutes. Add the garlic, bay leaves, chicken broth, and water and bring to a boil. Return the pork chops to the pot. Reduce the heat to medium-low, cover, and simmer for 45 minutes. Add the smoked sausage and the potatoes. Bring to a boil, then reduce the heat to medium-low, and cook, uncovered, stirring occasionally, for 30 minutes. Remove the bay leaves.",
    "Remove from the heat. Serve with either steamed white rice or rice pilaf."
  ],
  "ingredients": [
    "0",
    "8 thinly cut (about 1/2 inch thick) pork chops (about 3 pounds total)",
    "2 teaspoons Emeril's Original Essence",
    "1/2 cup olive oil",
    "1/4 cup plus 2 tablespoons all-purpose flour",
    "4 cups thinly sliced onions",
    "1/2 teaspoon salt",
    "1/2 teaspoon freshly ground black pepper",
    "1 tablespoon chopped garlic",
    "4 bay leaves",
    "Two 14 1/2-ounce cans low-sodium chicken broth, or",
    "3 1/2 cups Chicken Stock",
    "1 1/2 cans water (measured in the chicken broth cans)",
    "1 pound smoked sausage or andouille, cut crosswise into 1-inch slices",
    "1 pound russet potatoes, peeled and cut into 1-inch cubes",
    "Steamed white rice or",
    "rice pilaf, for serving"
  ],
  "__v": 3
}