{
  "__v": 1,
  "directions": [
    "0",
    "Heat olive oil in saute pan over medium heat, then add red onion and saute 2-3 minutes, until the onion is starting to get soft but not browned. (Use a broiler-proof saute pan if you'd like to cook this entirely in one dish.)",
    "Add minced garlic, cook about 1 minute, then add canned tomatoes and chopped thyme. Simmer the tomato mixture until it thickens slightly, stirring a few times. This will take about 6-8 minutes.",
    "While tomatoes cook, preheat toaster oven to 450F (if you're planning to cook individual servings) and pre-heat broiler (for individual casseroles or to cook in one pan.)",
    "When tomatoes are slightly thickened, remove about 1/3-1/2 of the tomatoes to a bowl. Spread the rest of tomatoes around the bottom of the saute pan or in two individual casserole dishes. Carefully break two eggs into each casserole dish (for individual servings) or four eggs into saute pan (to cook in one pan.) Spoon the rest of the tomato mixture carefully over and around the white part of the eggs, leaving the yolks showing. (It will not completely cover the whites.)",
    "If you're cooking in the pan, cover the saute pan and let eggs cook in the tomatoes for about 3 minutes. If you're cooking in individual casseroles, put casserole into toaster oven for about 5-7 minutes. (Whichever cooking method you're using, the egg white should be turning opaque but the yolk should still be runny when you add the parmesan cheese and broil.) When eggs are partly done, sprinkle on parmesan cheese and put pan or individual dishes under the broiler for 1-2 minutes, until cheese melts and the top of eggs look like they're barely starting to cook.",
    "Serve hot, either as is or with toast for dipping into egg."
  ],
  "firstAdded": "2014-08-17T21:49:14.548000",
  "hash": "d5e6a4114d64eaec4b3a0dd8758d9475894d4c19",
  "href": "http://www.kalynskitchen.com/2009/07/recipe-for-tuscan-baked-eggs-with.html",
  "image": "http://2.bp.blogspot.com/_s--n1TR94Vs/SkOVWyhZxHI/AAAAAAAAKxk/8tE5XTdYyaY/s400/Tuscan-eggs-recipe-kalynskitchen.jpg",
  "ingredients": [
    "0",
    "1 T extra-virgin olive oil",
    "1/4 cup chopped red onion",
    "1 tsp. finely minced garlic",
    "1 can (14.5 oz.) diced tomatoes (I recommend good-quality organic tomatoes for this recipe.",
    "1 T chopped fresh thyme leaves (other herbs such as oregano or basil could be used, but I would not use dried thyme)",
    "4 eggs",
    "2 T freshly grated parmesan cheese (or more)",
    "1 T chopped fresh chives (optional, but the chives were great in this)"
  ],
  "keywords": [
    "extravirgin",
    "olive",
    "oil",
    "red",
    "onion",
    "garlic",
    "recommend",
    "goodquality",
    "organic",
    "tomatoes",
    "recipe",
    "leaves",
    "herbs",
    "oregano",
    "basil",
    "used",
    "use",
    "thyme",
    "eggs",
    "parmesan",
    "cheese",
    "chives",
    "great"
  ],
  "title": "Tuscan Baked Eggs",
  "users": [
    null
  ]
}