{
  "hash": "8359f5181e5725a7322ea976ab718bd1fdbd9850",
  "title": "Asparagus and Chicken Stir-fry",
  "image": "//food.fnr.sndimg.com/content/dam/images/food/fullset/2013/12/12/0/FNK_asparagus-chicken-stir-fry_s4x3.jpg.rend.hgtvcom.616.462.suffix/1387416421125.jpeg",
  "href": "http://www.foodnetwork.com/recipes/food-network-kitchen/asparagus-and-chicken-stir-fry-recipe-1928150",
  "extension": "Firefox",
  "firstAdded": "2018-01-21T23:25:56.467000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Freeze the chicken breasts for 20 to 30 minutes and then thinly slice the chicken against the grain into strips. Toss the strips with about half the garlic and ginger, the soy sauce, sugar, 1 teaspoon of the cornstarch, 1 teaspoon of the salt, and the sherry in a bowl. Marinate at room temperature for 15 minutes. Mix the remaining cornstarch with the broth.",
    "Heat 1 tablespoon of the oil a large nonstick skillet over high heat. Add the asparagus, scallions, remaining garlic, ginger, 1/4 cup of water, and season with 1/4 teaspoon salt. Stir-fry until the asparagus is bright green but still crisp, about 3 minutes. Transfer to a bowl.",
    "Heat the same skillet until very hot, then add remaining 1 tablespoon oil. Add the chicken and stir-fry until it loses its raw color and gets a little brown, about 3 minutes. Return the asparagus to the pan and toss to heat through. Stir in the reserved cornstarch mixture and bring to a full boil to thicken. Mound the stir-fry on a serving platter or divide among 4 plates; serve with rice."
  ],
  "ingredients": [
    "0",
    "1 pound boneless skinless chicken breasts (about 2 breasts)",
    "2 cloves garlic, minced",
    "1 (2-inch) piece peeled fresh ginger, cut into thin matchsticks",
    "1 tablespoon soy sauce",
    "1 tablespoon sugar",
    "1 tablespoon cornstarch plus 1 teaspoon",
    "1 1/4 teaspoons kosher salt",
    "1 tablespoon dry sherry",
    "3/4 cup chicken broth, low-sodium canned, or homemade or water",
    "2 tablespoons vegetable oil",
    "2 bunches medium asparagus (about 2 pounds), woody stems trimmed, sliced into 1-inch pieces",
    "1 bunch scallions (white and green parts), thinly sliced",
    "Serving suggestion: Brown or white rice"
  ],
  "__v": 1
}