{
  "hash": "97d7832f090ea4a481eaa06c9804933a02f3cf72",
  "title": "Malted Chocolate & Stout Layer Cake",
  "image": "//cdn2.tmbi.com/TOH/Images/Photos/37/300x300/Malted-Chocolate---Stout-Layer-Cake_exps110952_HCA2081250C02_16_3bC_RMS.jpg",
  "href": "http://www.tasteofhome.com/recipes/malted-chocolate---stout-layer-cake",
  "extension": "Chrome",
  "firstAdded": "2017-03-30T23:06:55.917000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Grease and flour three 9-in. round baking pans; set aside.",
    "In a large saucepan, combine beer, butter and chocolate. Cook and stir over medium-low heat until butter and chocolate are melted. Remove from heat; whisk in milk powder and cocoa. Transfer to a large bowl. Let stand 15 minutes.",
    "Preheat oven to 350°. Add sour cream and eggs to chocolate mixture; beat until well blended. Combine sugar, flour, baking soda and salt; gradually beat into chocolate mixture until blended. Pour batter into prepared pans.",
    "Bake 32-36 minutes or until a toothpick inserted in the center comes out clean. Cool 10 minutes before removing from pans to wire racks to cool completely.",
    "In a large heavy saucepan, bring sugar and liqueur to a gentle boil over medium heat; cook until sugar is dissolved. Remove from heat. Add a small amount of hot mixture to egg yolks; return all to pan, stirring constantly. Cook 2 minutes longer or until mixture thickens, stirring constantly. Remove from heat; stir in vanilla. Cool to room temperature.",
    "In a large bowl with a whisk attachment, cream butter until fluffy, about 5 minutes. Gradually beat in sugar mixture. Add milk powder; beat until fluffy, about 5 minutes. If necessary, refrigerate until frosting reaches spreading consistency.",
    "Place bottom cake layer on a serving plate; spread with 1 cup frosting. Repeat layers. Top with remaining cake layer. Spread remaining frosting over top and sides of cake. Refrigerate at least 1 hour before serving. Yield: 16 servings."
  ],
  "ingredients": [
    "0",
    "2 cups stout beer",
    "1-3/4 cups butter, cubed",
    "3 ounces bittersweet chocolate, chopped",
    "1 cup malted milk powder",
    "1 cup baking cocoa",
    "1-1/2 cups (12 ounces) sour cream",
    "4 eggs",
    "3-1/2 cups sugar",
    "3 cups cake flour",
    "1 tablespoon baking soda",
    "1 teaspoon salt",
    "FROSTING:",
    "2 cups sugar",
    "1 cup Irish cream liqueur",
    "12 egg yolks, beaten",
    "3 teaspoons vanilla extract",
    "3 cups butter, softened",
    "1 cup malted milk powder"
  ],
  "__v": 1
}