{
  "__v": 1,
  "directions": [
    "0",
    "Start by making your dough. Combine the self-rising flour and the greek yogurt in the bowl of an electric mixer fitted with the hook attachment. This can also be done by hand. Mix the 2 ingredients until the dough starts to form. If the dough is dry, add 1 tablespoon of water. Continue to knead and bring the dough together. If the dough is still barely holding, add the second tablespoon of water.",
    "Dump the dough out onto a large, lightly floured surface. Work the dough out into a large disc. Divide the dough into 10 equal pieces. Roll each piece out until it is about ⅓ inch in thickness and has a 6 inch diameter.",
    "Place a griddle pan on high heat and let it get very hot. Cook the naan on each side for 2 minutes. Naan should puff up and have a light char. If desired, brush each side with olive oil and a small pinch of sea salt.",
    "1",
    "Once the first side of the naan is cooked, flip the naan over and brush the cooked side with olive oil, sprinkle with about ¼ teaspoon of cilantro and ¼ teaspoon of garlic. When the second side is cooked, flip the garlic side onto the griddle surface for just a few seconds. The hot surface will help seal the garlic to the naan."
  ],
  "firstAdded": "2014-10-04T06:17:11.326000",
  "hash": "f797f4d64f262ed8663772a3c0df9514ef0942c4",
  "href": "http://www.littlespicejar.com/2-ingredient-naan-flatbread-garlic-naans/",
  "image": "http://farm4.staticflickr.com/3904/14885661039_91baa17dc7_o.jpg",
  "ingredients": [
    "0",
    "3⅓ self-rising (self-raising) flour",
    "1½ cups greek yogurt",
    "2 tablespoons water",
    "olive oil, optional",
    "sea salt, optional",
    "1",
    "2 tablespoons olive oil",
    "3 cloves garlic, minced",
    "2 tablespoons cilantro, chopped",
    "sprinkle of sea salt"
  ],
  "keywords": [
    "selfrising",
    "selfraising",
    "flour",
    "greek",
    "yogurt",
    "water",
    "olive",
    "oil",
    "salt",
    "garlic",
    "cilantro",
    "sprinkle"
  ],
  "title": "2 INGREDIENT NAAN FLATBREAD {+GARLIC NAANS}",
  "users": [
    null
  ]
}