{
  "hash": "ee3a3311944c5201309707dd825a323ed35e9687",
  "title": "Power Potatoes",
  "image": "http://munchies-images.vice.com/wp_upload/power-potatoes-matty.jpg?crop=1xw:0.6xh;*,*&resize=1200:*",
  "href": "https://munchies.vice.com/en/recipes/power-potatoes",
  "extension": "Chrome",
  "firstAdded": "2016-10-27T17:31:50.912000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the oven to 450°F. Using a fork, poke holes randomly in the potatoes. Place the potatoes on a baking sheet and bake until tender, about 1 hour. Remove the potatoes and cool slightly, then cut in half lengthwise and scoop out all of the insides with a spoon into a medium bowl, leaving 1/4-inch of the outer layer of flesh and skin behind; transfer empty potato halves to a baking sheet. Add the mascarpone and 16 tablespoons of the butter, plus salt and pepper, and mix until malleable. Reduce the oven temperature to 350°F.",
    "Meanwhile, in a large skillet, cook the pancetta and bacon over medium-low heat, stirring occasionally, until golden, about 20 minutes. Strain through a fine-mesh sieve set over a bowl, reserving the bacon fat for another use (like frying eggs for breakfast!). Transfer the bacon to the bowl with the potato filling.",
    "Using your knife, shave off the florets from the broccoli heads into 1/2-inch pieces and set aside in a bowl. Cut the broccoli stems into 1/4-inch pieces. In a medium saucepan filled with boiling salted water, cook the stems until slightly soft but still crunchy, about 1 to 2 minutes. Drain and transfer to an ice bath until cold to stop the cooking. Drain the stems again and pat dry using paper towels. Transfer the stems to the bowl with the potato filling and the bacon, along with the bocconcini, cheddar cheese, and the scallion whites and mix until combined. Season with salt and pepper and divide mixture between potato skins. Bake until warmed through, about 20 minutes longer.",
    "Meanwhile in a small saucepan over medium-high heat, melt 8 tablespoons of butter with 2 tablespoons of water. Add the reserved broccoli tops and scallion greens and cook until bright green, about 2 to 3 minutes. Season with salt and pepper and divide among the tops of the potatoes."
  ],
  "ingredients": [
    "0",
    "6 large Idaho potatoes",
    "1/2 cup mascarpone",
    "24 tablespoons unsalted butter, cubed",
    "kosher salt and freshly ground black pepper, to taste",
    "1/2 lb. pancetta, sliced into 1/4-inch thick lardons",
    "1/2 lb. streaky bacon, sliced into 1/4-inch thick lardons",
    "2 heads broccoli",
    "1 lb. bocconcini",
    "1 cup grated cheddar cheese",
    "1 bunch scallions, thinly sliced, greens and whites separated"
  ],
  "__v": 1
}