{
  "hash": "eb363746d5f9eb4fc0d441a119a2619199e05d2c",
  "title": "Broccoli quinoa casserole",
  "image": "http://www.eatgood4life.com/wp-content/uploads/2014/03/broccoli-casserole-200x263.jpg",
  "href": "http://www.eatgood4life.com/broccoli-quinoa-casserole/",
  "extension": "",
  "firstAdded": "2018-09-23T12:05:03.353000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 400F.",
    "In a 9x13 baking rectangular dish place the quinoa and green onions. On the meantime, place the broccoli in a large bowl and microwave on high for 4-5 minutes. Set aside. My microwave is not very powerful so this is how long I did it for without the broccoli getting mushy. If you have a powerful microwave you may need just 3 minutes as it will continue to bake in the oven for about 5 minutes.",
    "In a large mixing bowl, with a wire whisk, mix the vegetable stock, pesto, arrowroot powder and salt. Heat mixture until boil. You can do this on your stove top or microwave. I used my microwave.",
    "Add the vegetable stock to the quinoa followed by the spinach, parmesan and 3/4 of the mozzarella cheese. Bake for 30-35 minutes. Take the quinoa casserole out of the oven and mix in the broccoli. Sprinkle the rest of the cheese over the quinoa and broccoli and place back in the oven for 5 minutes or until the cheese has melted. If you like you can add more parmesan cheese over the top as well.",
    "I place my casserole under the broiler for 2-3 minutes to brown the top but this is just optional. Serve while still warm."
  ],
  "ingredients": [
    "0",
    "2 1/2 cup uncooked quinoa",
    "4 1/2 cup low-sodium vegetable stock, or water",
    "2 tbsp pesto sauce",
    "1/2 tsp celtic salt",
    "2 tsp arrowroot powder, or cornstarch",
    "2 cups fresh organic spinach",
    "12 oz skim mozzarella cheese, I used 16oz",
    "1/3 cup parmesan cheese",
    "12 oz fresh broccoli florets",
    "3 green onions, chopped"
  ],
  "__v": 1
}