{
  "hash": "16c7295bd6c1b47abdbda92393ad5330d131e8fb",
  "title": "Chicken Chow Mein",
  "image": "http://cdn2.norecipes.com/wp-content/uploads/2015/05/chicken-chow-mein-4-620x413.jpg?fcc9a4",
  "href": "http://norecipes.com/recipe/chicken-chow-mein/",
  "extension": "Chrome",
  "firstAdded": "2015-06-03T06:34:45.423000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "thighs",
    "boneless",
    "skinless",
    "thigh",
    "bitesize",
    "pieces",
    "oyster",
    "shaoxing",
    "wine",
    "black",
    "pepper",
    "potato",
    "starch",
    "spice",
    "chow",
    "mein",
    "water",
    "soy",
    "oil",
    "garlic",
    "clove",
    "carrots",
    "carrot",
    "julienned",
    "bok",
    "choy",
    "head",
    "ramen",
    "noodles",
    "par",
    "boiled",
    "scallions"
  ],
  "directions": [
    "0",
    "Instructions",
    "Put the chicken thighs, 2 teaspoons oyster sauce, Shaoxing, black pepper, potato starch and five spice powder in a small bowl and mix well to combine. Let the chicken marinate while you prepare the other ingredients.",
    "To make the chow mein sauce, put the water, oyster sauce and soy sauce in a small bowl and stir to combine.",
    "Heat a wok or frying pan over medium-high heat until hot and then add the vegetable oil, marinated chicken and garlic. Spread the chicken into a single layer. Let the chicken brown and then flip.",
    "As soon as you flip the chicken, add the carrots. Stir-fry until the chicken is cooked through and the carrots are tender.",
    "Add the bok choy, noodles and sauce. If your noodles are stuck together, add a little extra water with the sauce, cover the pan with a lid and steam the noodles until they come apart. Otherwise stir-fry, until the bok choy is cooked through and the noodles are evenly coated with sauce.",
    "Add the scallions, toss to distribute evenly and then serve immediately.",
    "Notes",
    "For the noodles, there are so many fresh Asian noodles that would work for this, it's impossible to list all of them, but you want to look for Asian yellow noodles that are slightly kinky (get your mind out of the gutter). Here are some of the names they might go by: \"Chinese Egg Noodles\", \"Canton Noodles\", \"Hong Kong Style Noodles\", \"Pan Fry Noodles\", \"Lo Mein\", \"Chow Mein\", \"Ramen\", and \"Yakisoba\". They're all subtly different, but will work for this recipe. If they are not pre-cooked, you'll want to par-boil them by boiling them for 1 minute less than the time listed on the package."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "chicken",
    "185 grams chicken thighs - boneless skinless (~1 large thigh) cut into bite-size pieces",
    "2 teaspoons oyster sauce",
    "1 teaspoon Shaoxing wine",
    "1/4 teaspoon black pepper",
    "1/4 teaspoon potato starch",
    "1/8 teaspoon five spice powder",
    "chow mein sauce",
    "1 tablespoon water",
    "1 tablespoon oyster sauce",
    "2 teaspoons soy sauce",
    "chow mein",
    "1 tablespoon vegetable oil",
    "1 grams garlic (~ 1 small clove) minced",
    "40 grams carrots (~1/4 carrot) peeled and julienned",
    "100 grams bok choy (~1 head) chopped",
    "325 grams ramen noodles - fresh (see note below) par boiled",
    "20 grams scallions (~2 scallions) sliced"
  ],
  "__v": 1
}