{
  "hash": "b5fa87992491a50fe8247435e7c632aee7d8043a",
  "title": "Wheat Berry and Lentil Salad: (adapted from Fifth Crow Farm's packaging)",
  "image": "http://eatingdirt.typepad.com/.a/6a0120a7aea827970b013484ea6cec970c-300wi",
  "href": "http://eatingdirt.typepad.com/eating_dirt/2010/06/wheat-berry-and-lentil-salad.html",
  "extension": "Firefox",
  "firstAdded": "2017-03-18T17:16:48.524000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium saucepan, combine the wheat berries with three cups of water. Bring to a boil, reduce heat to low, cover and simmer for one hour, checking occasionally to make sure the heat is not too high and that the pan doesn't dry out. After the hour, stir in the lentils, cover, and continue to cook for about thirty minutes or until the lentils and wheat berries are tender. Drain into a colander in the sink and let cool to room temperature. You can prepare this step the day before you make the recipe.",
    "For the dressing, combine the lemon juice, shallots and garlic in a small jar with a lid and let stand for a five minutes. Add the mustard and oil, screw the lid on tightly and shake the dressing to mix it. Taste and add salt and pepper until it seems right to you. You can prepare this step the day before you make the recipe, also.",
    "In a large salad bowl, combine the wheat berries, lentils, chickpeas, tomato, cucumber, green onion and herbs. Add the dressing and stir to combine. Taste and add salt and pepper if needed."
  ],
  "ingredients": [
    "0",
    "1/2 cup wheat berries, rinsed and drained",
    "1/2 cup brown or french lentils, rinsed and drained",
    "1/2 cup lemon juice",
    "2 Tablespoons shallots, finely chopped",
    "1 large garlic clove, minced",
    "1 Tablespoon Dijon mustard",
    "1/3 cup extra virgin olive oil",
    "salt and pepper",
    "1 19 oz can chickpeas, drained and rinsed",
    "1 medium tomato, chopped, or 1 cup cherry tomatoes, halved",
    "1 small cucumber, diced",
    "1/2 cup italian parsley, chopped",
    "1/2 cup green onions, chopped",
    "2 Tablespoons basil leaves, chopped"
  ],
  "__v": 1
}