{
  "hash": "8872119b18a112201983f6c951ee9a26b54b836e",
  "title": "T.G.I. Friday's Malt Cake",
  "image": "",
  "href": "http://www.recipegoldmine.com/cct/tgi-fridays-malt-cake.html",
  "extension": "",
  "firstAdded": "2015-04-23T07:33:35.980000",
  "users": [
    null
  ],
  "keywords": [
    "cake",
    "oil",
    "milk",
    "plain",
    "yogurt",
    "eggs",
    "vanilla",
    "granulated",
    "sugar",
    "allpurpose",
    "flour",
    "cocoa",
    "baking",
    "soda",
    "salt",
    "boiling",
    "water",
    "malt",
    "frosting",
    "semisweet",
    "chocolate",
    "chips",
    "whipping",
    "cream",
    "malted",
    "softened",
    "cheese"
  ],
  "directions": [
    "0",
    "Method",
    "Make Malt Frosting before the cake so that it can chill for at least 2 hours.",
    "Malt Frosting: Melt chocolate chips in a saucepan over low heat, stirring constantly. Set aside to cool.",
    "Beat whipping cream and malted milk powder in electric mixer on high speed until stiff but not dry, about 2 minutes; refrigerate about 30 minutes.",
    "Whip sugar, cream cheese and vanilla extract in a separate bowl until creamy, about 2 minutes, scraping bowl often. Add melted chocolate chips and beat 1 more minute. Add half of malt-cream mixture and beat until uniform in color. Fold in remaining malt-cream mixture by hand until frosting is uniform in color.",
    "Refrigerate at least 2 hours before icing cake.",
    "Cake: Heat oven to 300 degrees F. Prepare 3 round 9-inch cake pans with butter and flour and line with parchment or wax paper. Set aside.",
    "Beat oil, milk, yogurt, eggs and vanilla extract with electric mixer until well blended, about 2 minutes.",
    "Sift together sugar, flour, cocoa powder, baking soda and salt in separate bowl. Slowly add 1/3 of dry ingredients to milk mixture and beat until well blended. Beat in 1/3 of boiling water. Add another 1/3 of dry ingredients and beat until well mixed; then beat in another 1/3 of water. Add remaining dry ingredients, beating well, then add remaining water and beat until well mixed. Scrape mixing bowl often.",
    "Pour equal amounts of batter into prepared pans. Bake until toothpick inserted in center comes out clean, 45 to 55 minutes. Do not open oven while cake is baking.",
    "Cool pans on rack for 15 minutes, the remove from pan, take off paper, and continue to cool completely.",
    "Frost top of one layer with Malt Frosting, then place second layer on top and frost; top with third layer and frost tops and sides.",
    "Refrigerate 2 hours before cutting."
  ],
  "ingredients": [
    "0",
    "Cake",
    "1 cup plus 3 tablespoons oil",
    "1/2 cup plus 2 tablespoons milk",
    "1/2 cup plus 2 tablespoons plain yogurt",
    "2 large eggs",
    "1 tablespoon vanilla extract",
    "3 cups granulated sugar",
    "3 cups all-purpose flour",
    "3/4 cup plus 1 tablespoon unsweetened cocoa powder",
    "1 1/2 tablespoons baking soda",
    "1/4 teaspoon salt",
    "1 1/4 cups boiling water",
    "Malt Frosting",
    "Malt Frosting",
    "1 (12 ounce) package semisweet chocolate chips",
    "1 pint whipping cream",
    "1 1/4 cups malted milk powder",
    "1/3 cup granulated sugar",
    "4 ounces softened cream cheese",
    "1 teaspoon vanilla extract"
  ],
  "__v": 1
}