{
  "hash": "68233ac4baf656402b8980207bbd87691a7c6994",
  "title": "SENAPSSILL PÅ AUBERGINE",
  "image": "",
  "href": "http://www.javligtgott.se/senapssill-pa-aubergine/",
  "extension": "Chrome",
  "firstAdded": "2015-12-23T13:20:45.303000",
  "users": [
    null
  ],
  "keywords": [
    "stor",
    "aubergine",
    "rdlk",
    "lagen",
    "vatten",
    "ttiksprit",
    "socker",
    "grovt",
    "krossade",
    "kryddpepparkorn",
    "lagerblad",
    "kryddnejlikor",
    "senapsssen",
    "rapsolja",
    "msk",
    "sknsk",
    "senap",
    "rdvinsvinger",
    "vitvinsvinger",
    "fungerar",
    "ocks",
    "hackad",
    "dill",
    "vitpeppar",
    "salt"
  ],
  "directions": [
    "0",
    "Dagen innan: Skär auberginen i ca 0,5 cm tjocka skivor. Salta och låt dra i några minuter så att bäskan drar ur. Skölj bort saltet och skär skivorna i ”sillstorlek”, ca 3,5 x 1,5 cm. Koka bitarna i vatten i någon minut så att de blir mjuka. Akta så de inte kokar för mycket och ramlar sönder. Du vill bara att de precis ska börja mjukna. Lägg åt sidan.",
    "För att göra lagen så blandar du ihop alla ingrediernserna och kokar upp på spisen. Så fort det kokat och sockret löst upp sig i lagen tar du av den från spisen och låter svalna. Hacka eller skiva löken fint och blanda löken och auberginen i en stor skål och häll över lagen. Låt stå i kylskåpet över natten.",
    "Dagen då det ska ätas: Fixa senapssåsen. Blanda alla ingredienser till såsen förutom dill och rapsolja i en skål. Häll sakta ner oljan under kraftig vispning tills såsen blir tjock och fin. Det är viktigt att alla ingredienser har samma temperatur, så ta ut dem ur kylskåpen någon timme innan. Blanda ner dillen och smaka av med salt och peppar. Ta ut auberginen ur kylskåpet och häll av lagen ifrån löken och auberginen. Blanda ner senapssåsen i grönsakerna och låt stå i kylskåp en timme innan servering. Ät med färskpotatis, gräslök och gräddfil!"
  ],
  "ingredients": [
    "0",
    "1 stor aubergine",
    "1 rödlök",
    "Lagen:",
    "2,5 dl vatten",
    "1 dl ättiksprit (12 %)",
    "1,5 dl socker",
    "5 grovt krossade kryddpepparkorn",
    "2 lagerblad",
    "5 kryddnejlikor",
    "Senapssåsen:",
    "1 dl rapsolja",
    "3 msk skånsk senap",
    "2 msk socker",
    "2 msk rödvinsvinäger (vitvinsvinäger fungerar också!)",
    "1 dl hackad dill",
    "vitpeppar",
    "salt"
  ],
  "__v": 1
}