{
  "hash": "fcff2190811f17b6e97f24181fc7eec5cc1c8874",
  "title": "Beef Bourguignon",
  "image": "http://recipe-folder.com/img/recipe-images/054/593/2228899854.jpg",
  "href": "http://recipe-folder.com/recipe/5b64e9aa3d946d7ece1c637c",
  "extension": "User Added",
  "firstAdded": "2018-08-03T23:47:54.981000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Dredge all the beef cubes in the flour mixture and set aside.",
    "1",
    "On the Instant Pot, hit \"Saute\" and \"Adjust\" so it's on the \"More\" setting and wait for it to read \"Hot\".",
    "2",
    "Add the butter so it's melted and then add the bacon and garlic. Stir and let cook for a few minutes until the bacon begins to get crispy, stirring occasionally. It's okay if the bottom of the pot begins to look like it's burning. All of this will be deglazed later and the flavour that's cooking up right now is amazing and key to the recipe.",
    "3",
    "Once crispy, add the beef to the pot and cook so it's just very lightly browned, about 2 minutes of mixing around.",
    "4",
    "Add half of the wine, 3/4 of a cup, the beef broth, tomato paste, pearl onions, mushrooms, thyme, tarragon, and the bay leaf. Stir, scraping up the bits from the bottom of the pan and secure the lid.",
    "5",
    "Hit \"Keep Warm/Cancel\" and then hit \"Manual\" or \"Pressure Cook\" High Pressure for 15 minutes (10 minutes if you want it a bit more tender). Quick release when done.",
    "6",
    "After removing the lid, hit \"Keep Warm/Cancel\" and then hit \"Saute\" so it's on the \"More\" setting and stir in the remaining 3/4 cup of red wine.",
    "7",
    "Once it begins to bubble, stir in the cornstarch slurry, mix well and let it bubble for about 2 - 3 minutes so the wine burns off and the sauce thickens a bit. Then hit \"Keep Warm/Cancel\" so it's on the warm setting. Once the bubbling dies down, transport to a serving dish and serve."
  ],
  "ingredients": [
    "0",
    "2 lbs. of beef round, cut into cubes (like the beef you'd use for beef stew - many markets already have it prepared this way)",
    "1",
    "1/2 cup of flour mixed with a few pinches of salt and pepper, for dredging the beef",
    "2",
    "4 strips of bacon, cut into tiny pieces",
    "3",
    "2 tbsp. of butter",
    "4",
    "1 tbsp. of crushed garlic",
    "5",
    "1 tbsp. of tomato paste",
    "6",
    "1 1/2 cups of dry red wine, divided in half",
    "7",
    "1 cup of beef broth",
    "8",
    "1 cup of water",
    "9",
    "1 bay leaf",
    "10",
    "2 cups of pearl onions, drained",
    "11",
    "8 oz. of sliced white mushrooms",
    "12",
    "1 tsp. of dried tarragon",
    "13",
    "1 tsp. of dried thyme",
    "14",
    "2 tbsp. of corn starch + 2 tbsp. of water to form a slurry"
  ],
  "__v": 1,
  "hidden": true
}