{
  "hash": "53e428769aec4d0d19f6050853abcc091c166ab8",
  "title": "CHORIZO & CHEESE TAMALES",
  "image": "http://www.caciqueinc.com/wp-content/uploads/2016/05/ChorizoCheeseTamale-1.jpg",
  "href": "http://www.caciqueinc.com/recipes/chorizo-cheese-tamales/",
  "extension": "Chrome",
  "firstAdded": "2017-04-15T20:51:17.807000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "HOW TO MAKE IT",
    "Place corn husks in a large bowl, cover with boiling water, and soak for at least 1 hour, remove excess water and pat each husk dry.",
    "In a large skillet cook chorizo according to package instructions; and add onions, sauté over medium heat until the onion is translucent (5 min.) Cool thoroughly.",
    "To make the tamales prepare one husk at a time by placing the husk on your open palm, smear 3 tablespoons of tamale dough on the husk, from side to side and all the way to the bottom, leaving 3 inches of the top of the husk untouched for folding. Place 1 tablespoon of chorizo mixture in the center, one strip of the Queso Quesadilla and a sprinkle of the grated Cacique® Cotija over the chorizo and cheese. Fold 1/3 of the husk to the left, fold 1/3 to the right, overlapping, pinch the bottom to seal and gently fold over the top to create a small rectangle.",
    "If using a double boiler begin to boil the water and remove the upper chamber. Place the formed tamale, vertically and upside down (folded side down) in upper chamber. As you make the tamales tightly pack them in the upper chamber. Once you complete the first layer of tightly packed tamales you may begin a second layer of tamales placed horizontally.",
    "If using a tamale steamer, add adequate room temperature water, set the steamer grate. Place the formed tamales, vertically and upside down, tightly packed. Once you complete the first layer of tightly packed tamales you may begin a second layer of tamales placed horizontally.",
    "Cover and steam over medium high heat for 45 minutes to 1 hour, check water level at 45 minutes (note: in a tamale steamer you will hear water boiling, if water is low gently add additional hot water on the side of the pot, trying to not add water over the tamales).",
    "Remove one of the tamale to check for doneness. Tamale is cooked when dough separates from the husk when unwrapping. Serve while hot with your favorite Cacique® Crema and salsa.",
    "After all this work, extra tamales can be frozen in freezer bags and re-heat in the microwave. They will keep in the refrigerator up to 5 days."
  ],
  "ingredients": [
    "0",
    "®",
    "®",
    "®"
  ],
  "__v": 1
}