{
  "hash": "d9e51b6f4bfb70c199453951fac114b01dd95f54",
  "title": "Toro Bravo's Warm Potato Salad with Vinegar and Chorizo",
  "image": "https://images.food52.com/gRyZ5A88WiY3dm2D27w53qmCA6k=/753x502/4eb6eeea-4795-4853-a1a7-4f31fe8a13d2--2017-1024_warm-roasted-potato-salad-with-chorizo-vinaigrette_genius_julia-gartland-495.jpg",
  "href": "https://food52.com/recipes/74147-toro-bravo-s-warm-potato-salad-with-vinegar-and-chorizo",
  "extension": "Chrome",
  "firstAdded": "2018-01-26T22:38:18.688000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the oven to 450° F with racks in the upper and lower thirds and place 2 sheet pans in the oven to warm. (Note: Later you will pour vinegar into this pan to release the potatoes, so be sure to use a pan with a lip.)",
    "Put your sliced potatoes in a medium bowl along with the 2 tablespoons of the olive oil and the salt and pepper, and toss to mix.",
    "Pull the warmed sheet pans out of the oven and spread the sliced and seasoned potatoes as evenly as possible over them in a single layer.",
    "Put the pans back into the oven and roast the potatoes for 15 minutes on one side. Flip the potatoes (if they’re still very pale underneath or sticking a lot, feel free to leave them a few minutes longer before flipping). Rotate the pans, and roast the potatoes for 8 minutes on the other side.",
    "Meanwhile, slice the onion in half, then thinly slice each half. Thinly slice the garlic cloves.",
    "Put the remaining 2 tablespoons of olive oil in a medium sauté pan over medium-high heat. Add the chorizo and sauté it for 30 seconds.",
    "Add the onion and garlic and lower the heat to medium and sauté everything for about 5 minutes, until the onion is just starting to turn translucent.",
    "Add 1 1/2 tablespoons of vinegar to the sauté pan and stir for 30 seconds before removing the pan from the heat.",
    "After the potatoes have roasted till golden on both sides and are tender, broil them for 3 or 4 minutes until they are nicely crisped on top.",
    "Drizzle the remaining 2 tablespoons vinegar over the potatoes on the sheet pan, then use the back side of a spatula to scrape the potatoes off the pans.",
    "Put the potatoes into a medium-sized bowl with the sautéed chorizo, onions, garlic, and parsley. Toss.",
    "Taste, adjust the seasoning and vinegar to your liking, and serve."
  ],
  "ingredients": [
    "0",
    "6 small-to-medium Yukon Gold potatoes (about 1 1/2 pounds), sliced 1/4-inch thin",
    "4 tablespoons olive oil, divided",
    "1 teaspoon kosher salt",
    "1 teaspoon freshly ground black pepper",
    "3/4 cup (3 ounces) finely diced Spanish chorizo",
    "1 small yellow onion",
    "5 cloves garlic",
    "3 1/2 tablespoons sauvignon blanc vinegar or other white wine vinegar, divided",
    "1/4 cup roughly chopped or torn parsley leaves"
  ],
  "__v": 1
}