{
  "hash": "4f2e2af16db7e107f1489a864a8c190308e9b6fb",
  "title": "Tofu Pad Thai",
  "image": "http://candicekumai.com/wp-content/uploads/2016/04/043780__CK_5146-731x878.jpg",
  "href": "http://candicekumai.com/tofu-pad-thai/",
  "extension": "Chrome",
  "firstAdded": "2017-11-16T16:10:48.307000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "Place the noodles in a large bowl and cover with boiling water. Soak for 5 minutes, drain, and rinse under cold water. Set aside.",
    "Whisk the tomato paste, soy sauce, lime juice, honey, and ginger in a small bowl. Place the following in separate bowls: the beaten egg; the onions and garlic; the tofu; the bean sprouts and snow peas; and 1/2 cup of water. Arrange them near your cooktop.",
    "Heat 1 tablespoon of oil in a large skillet or wok over medium-high heat. Pour in the beaten egg and cook while stirring until the egg is scrambled, about 1 1/2 minutes. Scrape the egg into a bowl. Turn off the heat and wipe the skillet out with a damp paper towel. Use a wooden spoon to break the eggs up into small pieces and set aside.",
    "Pour the remaining 1 tablespoon of oil into the wiped-clean skillet and heat over medium- high heat until the oil is just starting to smoke, 2 to 3 minutes. Add the onions and garlic and cook, stirring constantly, until they’re just starting to turn golden, about 1 minute. Add the tofu and cook and stir gently until it is warmed through, 1 to 2 minutes, then stir in the tomato-soy mixture. Add 1/2 cup of bean sprouts and the snap peas.",
    "Cook for 1 minute and then add the water and drained noodles. Toss with tongs to combine. Cook until most of the liquid is absorbed, stirring often, following the timing from the package instructions."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "1/2 pound dried flat rice stick noodles",
    "3 tablespoons tomato paste",
    "3 tablespoons reduced-sodium soy sauce",
    "2 tablespoons lime juice (from about 1 lime)",
    "1 tablespoon honey",
    "1 teaspoon ground ginger",
    "1 large egg, lightly beaten (optional)",
    "1/2 small yellow onion, very finely chopped",
    "4 garlic cloves, finely minced",
    "7 ounces (about 1/2 package) firm tofu, drained and sliced into 1-inch cubes",
    "1 cup bean sprouts",
    "1 cup snow peas or sugar snap peas, ends trimmed and thinly sliced on a diagonal",
    "3 tablespoons dark sesame oil",
    "1/4 cup toasted sliced almonds (optional)",
    "1/4 cup roughly chopped fresh cilantro (optional)",
    "1 lime, cut into wedges"
  ],
  "__v": 1
}