{
  "hash": "8340793ec6489b52ee21bc041d2f676201233e88",
  "title": "Grain Free Sugar Cookies",
  "image": "http://www.chocolatecoveredkatie.com/wp-content/uploads/cut-out-cookies_E174/healthy-sugar-cookies_thumb_3.jpg?b725db",
  "href": "http://chocolatecoveredkatie.com/2012/12/18/grain-free-sugar-cookies/",
  "extension": "Chrome",
  "firstAdded": "2016-02-14T17:16:06.857000",
  "users": [
    null
  ],
  "keywords": [
    "adapted",
    "recipe",
    "inspired",
    "laura",
    "finelyground",
    "meal",
    "known",
    "almond",
    "flour",
    "substitutions",
    "nutrition",
    "link",
    "end",
    "salt",
    "baking",
    "soda",
    "maple",
    "syrup",
    "stevia",
    "coconut",
    "oil",
    "level",
    "extra",
    "needed",
    "milk",
    "added",
    "vanilla"
  ],
  "directions": [
    "0",
    "Grain Free Sugar Cookies Recipe: Combine all liquid ingredients (except milk of choice if using maple syrup version). In a separate bowl, combine dry ingredients and stir very well. Now mix wet into dry and keep stirring, breaking up clumps as you mix—it may seem dry at first, and you can add the extra 2 tsp milk or oil (I did add this when I made the maple syrup version), but do not add any more liquid than the recipe calls for. It will eventually form something that can either be squished into a ball with your hands or put into a plastic bag and smushed from inside the bag (the less-messy option). Roll out dough to cut-out-cookie width, either between sheets of parchment paper or from inside the bag, then cut into shapes. Freeze dough at least 20 minutes before cooking 10-13 minutes (depending on desired crispiness) at 325 F on a greased cookie sheet. Let cool another 10 minutes before even attempting to remove cookies from the sheet. They should firm up nicely. For troubleshooting, see nutrition link below. I store these in a glass container, not fully covered, as I like them crispier."
  ],
  "ingredients": [
    "0",
    "Adapted from this recipe and inspired by Laura.",
    "1 cup finely-ground almond meal (also known as almond flour. For substitutions, see nutrition link at the end of this recipe.) (75g)",
    "a little over 1/8 tsp salt (1/8 plus 1/16 tsp)",
    "1/8 tsp baking soda",
    "2 tbsp pure maple syrup, or stevia to taste (For substitutions, see nutrition link below.) (30g)",
    "1 1/2 tbsp coconut or vegetable oil (15g)",
    "For maple syrup version: up to 2 level teaspoons milk of choice or extra oil, as needed (5-10g). For stevia version: 1 tbsp milk of choice, added with the liquid ingredients. (15g)",
    "1 tsp pure vanilla extract",
    "optional: pure almond extract"
  ],
  "__v": 1
}