{
  "hash": "e887be8d26fba573ad265223964f5ba813f440a4",
  "title": "Fried Cauliflower w/ Bacon & Mushrooms",
  "image": "https://1.bp.blogspot.com/-fnH5QoCj5As/WP_bz70-cgI/AAAAAAABOGo/Ul91tHDwfl42vMtIhKnj05P9_ypmITzhQCLcB/s1600/1-text-550-cauliflower-bacon-mushrooms.jpg",
  "href": "http://www.kalynskitchen.com/2006/02/weekend-herb-blogging-20.html",
  "extension": "Chrome",
  "firstAdded": "2017-05-11T14:16:08.279000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "nstructions:",
    "Prepare all the ingredients before you start to cook, because this cooks pretty quickly. Cut the bacon slices into crosswise strips. Cut cauliflower apart into smallish same-size florets. Wash mushrooms if needed and spin dry or dry with paper towels, then cut mushrooms into half and slice each half into thick slices. (You want mushroom slices that are all relatively the same size.) Chop the parsley.",
    "Cook the bacon over medium-high heat in a very large frying pan until it's very crisp. (Use the biggest frying pan you have; I used my 12 inch Green Pan.) Then remove bacon to drain on a paper towels and remove all but about 1 tablespoon of the bacon grease. (Or if you prefer to use olive oil or coconut oil, remove all the bacon grease.)",
    "Add the butter (or oil of your choice) to the pan and heat for 1 minute, then add the chopped cauliflower and sliced mushrooms and cook over very high heat, stirring constantly, for about 5-7 minutes or until all mushroom liquid has evaporated, cauliflower is starting to brown a bit and the cauliflower is getting tender. Add crisp pieces of bacon and parsley and cook 2-3 minutes more. Season with salt and fresh-ground black pepper and serve hot."
  ],
  "ingredients": [
    "0",
    "ngredients:",
    "4 - 6 slices bacon",
    "1 T bacon fat, saved after bacon is cooked",
    "1 T butter",
    "(If you prefer not to use bacon fat and/or butter, you can replace either with an equal amount of olive oil or coconut oil.)",
    "1 small head cauliflower, cut into small bite-size pieces",
    "8 oz. mushrooms, cut in half, then into thick slices",
    "1/2 cup chopped fresh parsley",
    "salt and pepper to taste"
  ],
  "__v": 1
}