{
  "__v": 1,
  "directions": [
    "0",
    "Prepara la pastella per cuocere le crespelle un po’ in anticipo, in modo che possa riposare almeno mezz’ora. Sbatti le uova con il sale e la farina, cercando di eliminare tutti i grumi, e poi incorpora il latte a filo.",
    "Per il ripieno delle crespelle preriscalda il forno a 180°.",
    "Lava la zucca - se hai scelto la noce di burro non occorrerà sbucciarla -, tagliala a una metà, togli tutti i semi e poi tagliala in fette di circa un centimetro di spessore. Sistemala su una teglia foderata di carta da forno, condiscila con un po' di sale, il pepe nero appena macinato e un filo d'olio extra vergine di oliva.",
    "Cuocila per circa circa 30 minuti, fino a che non sarà morbida e leggermente dorata e caramellata sui bordi.",
    "Quando è pronta frulla la zucca con un mixer, quindi mescolala in una ciotola con la ricotta, il pecorino grattato, un pizzico di pepe nero e il sale. Assaggia la crema di zucca e ricotta per controllare che sia abbastanza salata, poi aggiungi un uovo sbattuto.",
    "Prepara infine la besciamella, facendo sciogliere il burro in un tegamino. Quando è sciolto aggiungi la farina e mescola con una frusta per qualche minuto in modo che si tosti e perda il sentore di crudo.",
    "Aggiungi poi il latte freddo a filo, continuando a mescolare per evitare i grumi.",
    "Lascia cuocere qualche minuto finché non si assoda e regola di sale e noce moscata.",
    "Scalda una padellina antiaderente di circa 14 – 15 cm di diametro unta leggermente con una noce di burro e cuoci le crespelle a fuoco medio basso, pochi minuti per parte, finché non sono dorate (usa circa 3 cucchiai di impasto per avere alla fine 7 o 8 crespelle).",
    "Spalma ogni crespella con la crema di zucca e ricotta e avvolgile su se stesse, come per fare un cannellone.",
    "Adagiale in una pirofila precedentemente cosparsa con qualche cucchiaio di besciamella.",
    "Condisci le crespelle con il resto della besciamella, altro Parmigiano grattato, qualche foglia di salvia e un filo d'olio extravergine di oliva.",
    "Cuoci in forno caldo a 180°C per circa 20 minuti, finché non le crespelle non saranno dorate in superficie e la besciamella unita al pecorino non comincerà a sobbollire ai lati.",
    "Mangia le crespelle calde appena tolte dal forno, o riscaldale con un goccio di latte se avanzano."
  ],
  "firstAdded": "2014-10-09T19:45:57.074000",
  "hash": "949b2438c7a70be02a2291d3f1cc34e6a492c202",
  "href": "http://it.julskitchen.com/toscana/crespelle-alla-fiorentina-con-zucca-e-pecorino",
  "image": "http://farm9.staticflickr.com/8057/8201280000_323cb8d569_h.jpg",
  "ingredients": [
    "0",
    "2 uova",
    "2 cucchiai di farina colmi (ca. 60 g in tutto)",
    "1 pizzico di sale",
    "200 ml di latte",
    "1",
    "350 g di zucca noce di burro",
    "150 g di ricotta fresca",
    "50 g di pecorino toscano stagionato, grattato",
    "1 uovo",
    "1 pizzico di sale",
    "2",
    "50 g di burro",
    "60 g di farina",
    "500 ml di latte",
    "1 pizzico di sale",
    "Noce moscata grattata",
    "3",
    "pecorino toscano stagionato grattato",
    "Salvia",
    "Olio extravergine di oliva"
  ],
  "keywords": [
    "uova",
    "cucchiai",
    "farina",
    "colmi",
    "tutto",
    "pizzico",
    "sale",
    "latte",
    "zucca",
    "noce",
    "burro",
    "ricotta",
    "fresca",
    "pecorino",
    "toscano",
    "stagionato",
    "grattato",
    "uovo",
    "moscata",
    "grattata",
    "salvia",
    "olio",
    "extravergine",
    "oliva"
  ],
  "title": "Crespelle alla Fiorentina con zucca e pecorino",
  "users": [
    null
  ]
}