{
  "hash": "d304f6c1ef7bb7734a41bbd1debdc2e818368f72",
  "title": "Chocolate Shortbread with White Chocolate Sauce",
  "image": "//food.fnr.sndimg.com/content/dam/images/food/fullset/2008/10/7/0/12Days2008_Chocolate_s3x4.jpg.rend.hgtvcom.126.95.suffix/1400122381991.jpeg",
  "href": "https://www.foodnetwork.com/recipes/alexandra-guarnaschelli/chocolate-shortbread-with-white-chocolate-sauce-recipe2-2009492",
  "extension": "Chrome",
  "firstAdded": "2018-09-08T15:47:49.285000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350 degrees F.",
    "In a small metal bowl, combine the 2 types of chocolate and melt them gently over a pot of simmering water or a double boiler. Cool chocolate to room temperature.",
    "Make the shortbread dough: In the bowl of an electric mixer fitted with the whisk attachment, combine the butter and sugar. Blend until smooth and \"creamed,\" 3 to 5 minutes. Mix in the cooled melted chocolate.",
    "Sift the flour and add to the butter mixture and blend on low speed to incorporate the flour. Do not over mix . Remove the dough from the bowl and refrigerate for a few minutes to chill.",
    "Make the chocolate sauce: In a medium-sized pot, bring the cream to a gentle simmer. Remove the pot from the heat and whisk in the white chocolate pieces. Allow the mixture to sit and cool for a minute. All of the white chocolate should easily melt into the cream. Whisk in the sour cream and taste for seasoning. Cook's Note: Sour cream is temperamental when heated, so take care that your mixture never gets overly hot. If so, cool a little before incorporating. Set aside at room temperature.",
    "Press the shortbread dough evenly into a 9 by 13 by 1-inch greased non-stick baking pan. Place in the center of the oven and bake for 35 to 40 minutes until the dough is fairly firm to the touch. Remove from the oven and allow the shortbread to cool for about 10 minutes. Cut into 12 rectangles, 4 by 2 inches, and then cut diagonally across rectangles to form 24 long triangles for good dipping.",
    "Arrange shortbread wedges on a tray with the white chocolate sauce in a bowl for dipping."
  ],
  "ingredients": [
    "0",
    "Cookies:",
    "1 ounce bittersweet chocolate",
    "2 ounces semisweet chocolate",
    "1 cup unsalted butter, softened, plus a little extra for greasing the baking sheet",
    "1/2 cup granulated sugar",
    "2 cups all-purpose flour",
    "Sauce:",
    "3/4 cup heavy cream",
    "8 ounces white chocolate, chopped or shaved into small pieces",
    "1/2 cup sour cream, preferably at room temperature"
  ],
  "__v": 1
}