{
  "hash": "e1492ebc1cf6e7fa37e9c12e430cf5570f86a942",
  "title": "Classic finger buns",
  "image": "http://www.taste.com.au/images/recipes/sfi/2012/03/28998_l.jpg",
  "href": "http://www.taste.com.au/recipes/28998/classic+finger+buns",
  "firstAdded": "2014-12-26T10:22:10.385000",
  "users": [
    null
  ],
  "keywords": [
    "sachet",
    "dry",
    "yeast",
    "caster",
    "sugar",
    "milk",
    "warmed",
    "plain",
    "flour",
    "mixed",
    "spice",
    "cinnamon",
    "butter",
    "chilled",
    "egg",
    "lightly",
    "sultanas",
    "vanilla",
    "brushing",
    "hundreds",
    "thousands",
    "desiccated",
    "coconut",
    "decorate",
    "icing",
    "mixture",
    "softened",
    "drops",
    "rose",
    "pink",
    "food",
    "colouring"
  ],
  "directions": [
    "0",
    "Step 1 Grease 2 large baking trays. Place yeast, sugar and milk in a bowl. Stir until yeast is dissolved. Cover. Set aside in a warm place for 10 minutes or until foamy.",
    "Step 2 Sift flour, mixed spice and cinnamon in a bowl. Rub in butter until mixture resembles fine breadcrumbs. Make a well in centre. Add yeast mixture, 1/4 cup warm water, egg, sultanas and vanilla. Mix well to combine. Cover with lightly greased plastic wrap. Set aside in a warm place for 1 hour or until doubled in size.3 Preheat oven to 200°C/180°C fan-forced. Turn dough onto a floured surface. Knead for 8 minutes or until smooth. Divide dough into 12 portions. Shape each portion into a 13cm long log. Place logs on prepared trays, 5cm apart. Cover with a tea towel and set aside in a warm place for 15 minutes.",
    "Step 3 Brush buns with a little milk. Bake for 12 to 15 minutes or until golden and cooked through (buns will sound hollow when tapped). Transfer to a wire rack to cool.",
    "Step 4 Make icing: Sift icing sugar into a bowl. Add butter, 2 teaspoons hot water and pink food colouring. Stir until smooth and combined, adding extra water if necessary. Spread icing over tops of buns. Sprinkle half the buns with hundreds and thousands and remaining buns with coconut. Set aside until icing sets. Serve."
  ],
  "ingredients": [
    "0",
    "7g sachet dry yeast",
    "1/3 cup caster sugar",
    "1/2 cup milk, warmed",
    "2 1/2 cups plain flour",
    "1 teaspoon mixed spice",
    "1 teaspoon ground cinnamon",
    "50g butter, chilled, chopped",
    "1 egg, lightly beaten",
    "3/4 cup sultanas",
    "1 teaspoon vanilla extract",
    "Milk, for brushing",
    "Hundreds and thousands and desiccated coconut, to decorate",
    "1",
    "1 1/2 cups icing sugar mixture",
    "10g butter, softened",
    "2 drops rose pink food colouring"
  ],
  "__v": 1
}