{
  "hash": "d2b3cbc124d0d1e99bf21719328b829f5d0d4abf",
  "title": "Red Lentil Dal",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2011/09/red-lentil-dal-vertical-b-1600.jpg",
  "href": "https://www.simplyrecipes.com/recipes/red_lentil_dal/",
  "extension": "",
  "firstAdded": "2018-01-28T21:09:24.719000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Rinse lentils and cook with water until soft: Place 1 cup of red lentils in a metal sieve. Rinse well with cold water.",
    "Pour cleaned lentils into a medium sauce pan. Add 3 cups of water. Bring lentils and water to a boil.",
    "Reduce heat, cover and simmer for 10 minutes or until the lentils are soft.",
    "2 Blanch and chop the tomatoes: While the lentils are cooking in step 1, bring a separate small pot of water to a boil.",
    "Score the peel of the tomatoes with a sharp knife in the shape of an \"X\". Place the tomatoes in the boiling water and blanch for one minute.",
    "Remove the tomatoes to a bowl to cool. Once cool, peel the tomatoes and cut out and discard the tough stem end. Chop the tomatoes, or mash them, and set aside.",
    "3 Sauté onions, garlic paste, spices: After the lentils in step 1 have cooked at least 5 minutes, start preparing the onions and spices.",
    "In a medium saucepan, heat the oil over medium heat. Add the chopped onions. Cook until translucent, about 3 minutes.",
    "Add garlic paste and cook for 1 minute more, stirring continuously, making sure that the garlic does not burn.",
    "Add the Bengali five spice. Cook and stir for another 2-3 minutes. Add bay leaf and turmeric. Stir.",
    "4 Add cooked lentils, salt: To the onions and spices, add the cooked lentils along with the lentil cooking water. Add salt. Cook for 10 minutes.",
    "5 Add lime juice, tomatoes, cook, then add cilantro: Add lime juice and tomatoes. Cook for 3-5 more minutes. Adjust salt if necessary.",
    "Stir in chopped cilantro and remove from heat. Garnish with more chopped cilantro.",
    "Serve with basmati rice or naan bread."
  ],
  "ingredients": [
    "0",
    "1 cup red lentils (orange lentils will work as well)",
    "3 cups water",
    "3 plum tomatoes",
    "2 teaspoons grapeseed, vegetable, canola or other high-heat oil",
    "1/2 cup white or yellow onion, finely chopped",
    "2 medium cloves garlic, finely chopped and made into a paste*",
    "2 teaspoons of Bengali five spice mix (panch phoron) or 1/2 tsp black (or white) sesame seeds, 1/2 tsp cumin seeds, 1/2 tsp fennel seeds, 1/2 tsp mustard seeds, and (if available) 1/2 tsp fenugreek seeds",
    "1 bay leaf",
    "1 teaspoon turmeric",
    "1 teaspoon kosher salt plus more to taste",
    "1 lime, juiced (equal to about 2 tablespoons fresh lime juice)",
    "8 sprigs cilantro, de-stemmed and chopped",
    "Cooked basmati rice, optional"
  ],
  "__v": 1
}