{
  "hash": "47b06dd84d64eadf1b0b4777b006c97c0735b484",
  "title": "Black Bean Roasted Poblano Enchiladas",
  "image": "",
  "href": "http://www.annies-eats.com/2015/04/28/black-bean-roasted-poblano-enchiladas/",
  "extension": "",
  "firstAdded": "2017-07-13T22:45:29.530000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the broiler with an oven rack 6 inches from the heating element. Place the poblanos on a foil lined baking sheet. Place under the broiler and cook, turning as needed, until the skins are blackened and blistered on all sides. Remove from the oven, transfer to a medium bowl, and cover. Let stand for at least 15 minutes. Once cool enough to handle, peel away the skins and discard. Seed and chop the peppers. Reduce the oven temperature to 400˚ F.",
    "In the bowl of a food processor, combine the tomatillos, half of the onion, half of the cilantro, broth, cream, half of the olive oil, 3 whole garlic cloves (peeled), lime juice, sugar and the salt. Process until smooth, about 2 minutes. Adjust seasoning with pepper if needed.",
    "In a bowl, mash half of the beans with forks or a potato masher until mostly smooth. Heat the remaining tablespoon of the oil in a large skillet over medium heat. Add the remaining onion and cook until softened and lightly browned, about 5-7 minutes. Stir in the remaining 2 cloves of garlic (minced or pressed), chili powder, coriander, cumin and cook until fragrant, about 30 seconds. Stir in the chopped poblanos, mashed beans and remaining whole beans. Cook until warmed through, about 2 minutes. Season with salt and pepper to taste.",
    "Transfer the bean mixture to a large bowl. Mix in 1 cup of the cheese, ½ cup of the tomatillo sauce, and the remaining ½ cup of cilantro. Season with salt and pepper to taste. Spread ½ cup of the tomatillo sauce over the bottom of a 9 x 13-inch baking dish. Stack the tortillas on a plate, cover with a damp dish towel and microwave about 30-60 seconds, until warm and pliable.",
    "With one tortilla at a time, fill with about 1/3 cup filling down the center. Roll up the tortilla tightly around the filling and place in the baking dish, seam side down. Repeat with the remaining tortillas until the filling is used up. Pour the remaining sauce over the top of the enchiladas. Sprinkle the remaining 1 cup of cheese over the top. Cover the dish with lightly greased foil and bake until the enchiladas are heated through, about 25 minutes. Let cool 5 minutes before serving."
  ],
  "ingredients": [
    "0",
    "4 poblano chiles",
    "2 (13-oz.) cans tomatillos, drained",
    "2 onions, finely chopped, divided",
    "1 cup fresh cilantro leaves, divided",
    "1/3 cup vegetable broth",
    "¼ cup heavy cream",
    "2 tbsp. olive oil, divided",
    "5 cloves garlic, divided",
    "1 tbsp. freshly squeezed lime juice",
    "1 tsp. sugar",
    "1 tsp. kosher salt, plus more as needed",
    "Freshly ground black pepper",
    "1½ cups cooked black beans (1 15-oz. can), rinsed",
    "1 tsp. chili powder",
    "½ tsp. ground coriander",
    "½ tsp. ground cumin",
    "8 oz. Monterey jack cheese, shredded and divided",
    "8-10 (7 to 8-inch) flour tortillas"
  ],
  "__v": 1
}