{
  "hash": "6792b06d78793657ec6261f007f1e11bcc48a7dd",
  "title": "Bear Claws",
  "image": "https://images.food52.com/GRgjXVMDIG9WAR-dxS9nL2Welpg=/753x502/a339d74b-7e2b-406b-8666-7e0907e55bb5--2016-0711_bear-claws-baking-basics_bobbi-lin_2480.jpg",
  "href": "https://food52.com/recipes/62905-bear-claws",
  "extension": "Chrome",
  "firstAdded": "2018-01-02T16:52:35.150000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the filling: In the bowl of an electric mixer fitted with the paddle attachment, cream the almond paste, powdered sugar, and lemon zest to combine, 20 to 30 seconds.",
    "Add the egg and mix until well combined. Add the vanilla and almond extracts and mix to combine. Set the filling aside.",
    "Make the doughnuts: Heat 3 4 inches of oil over medium-high heat until it reads around 350°F on a thermometer (or throw a scrap piece of dough in as a tester—if the dough bubbles and rises to the surface, the oil is good to go).",
    "While the oil heats, roll out the doughnut dough on a lightly floured surface to 1/4 inch thick. Cut the dough into rectangles (I like about 2 x 4 inches).",
    "Place a heaping tablespoon of the almond filling on each piece of dough, and use an offset spatula to spread into an even layer.",
    "Starting with one of the longer sides, roll the dough into a tight log. Use a bench knife or knife to cut five incisions into the dough. Cut the dough into 5 segments, but don’t cut all the way through—leave them attached on one side. (You’re making the “toes” of the paw here.)",
    "Separate the cut pieces a little bit, then curl the doughnut into a half circle. Use your thumb to press each cut piece to make a “toe” look.",
    "Let the doughnuts rise, covered, on a lightly floured surface for 30 minutes to 1 hour. When the oil is hot, gently add the doughnuts to the pot in batches, frying until they’re golden brown on both sides, 3 to 4 minutes. (Note: some of the filling may leech out—that’s okay! If you’re frying multiple kinds of doughnuts, fry these last, as escaped filling may color/flavor the oil.)",
    "Drain the doughnuts on several layers of absorbent paper towels. Let cool for 5 minutes before dusting generously with powdered sugar. Serve immediately."
  ],
  "ingredients": [
    "0",
    "1 cup almond paste",
    "2 cups powdered sugar",
    "1 tablespoon lemon zest",
    "1 egg",
    "1 teaspoon vanilla extract",
    "1/4 teaspoon almond extract",
    "1",
    "Oil, as needed for frying",
    "1 1 recipe Yeast Doughnuts (https://food52.com/recipes/28778-basic-yeast-doughnuts-with-many-variations)",
    "Powdered sugar, as needed for finishing"
  ],
  "__v": 1
}