{
  "hash": "dc2934aef596a9b7d6edbb32e67d3d7062e9ca56",
  "title": "Royal Wedding Scones",
  "image": "https://images.food52.com/Ubh-ivIfKHrLolWC3MhWE3ClRgk=/753x502/f5b27a7e-94d8-4f07-b4e5-d0ceac3e62ee--2016-1104_royal-wedding-scones_james-ransom-219.jpg",
  "href": "https://food52.com/recipes/11455-royal-wedding-scones?utm_source=Facebook&utm_medium=SocialMarketing&utm_campaign=Social",
  "extension": "Chrome",
  "firstAdded": "2017-01-13T21:48:49.912000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In the bowl of a food processor fitted with the chopping blade, place the dry ingredients and pulse to combine.",
    "Add the butter, and pulse about 10 or so times. You want to retain some small pieces of butter. Don’t blitz the heck out of it. Transfer the flour mixture to a large mixing bowl. If you've got some really large butter lumps, just squish them with the back of a fork.",
    "Gently toss the blueberries into the flour mixture.",
    "In a large measuring cup, place the heavy cream, egg and vanilla. Mix well. Pour into flour mixture. With a dinner fork, fold the wet into the dry as you gradually turn the bowl. It’s a folding motion you’re shooting for, not a stirring motion. When dough begins to gather, use a plastic bowl scraper to gently knead the dough into a ball shape. If there is still a lot of loose flour in the bottom of the bowl, drizzle in a bit more cream, like a teaspoon at a time, until the dough comes together.",
    "Transfer the dough ball to a floured board. Gently pat into a 6” or 7\" circle. With a pastry scraper or large chef’s knife, cut into 8 triangles. I use a pie marker to score the top of the dough circle and use the lines as a guide.",
    "OPTIONAL BUT RECOMMENDED: Place the scones on a wax paper-lined sheet pan and freeze until solid. Once they are frozen, you can store them in a plastic freezer bag for several weeks.",
    "Preheat oven to 425 degrees F. Place frozen scones on a parchment-lined sheet pan, about 1 inch apart. Brush with cream. Sprinkle tops of scones with sugar.",
    "Bake for about 20 - 25 minutes, turning pan halfway through. They are done when a wooden skewer comes out clean.",
    "Serve with clotted cream, creme fraiche, and jam if you wish.These are great the next day, warmed in the microwave for 15 - 20 seconds. They freeze really well, too, and can be reheated in a 350 degree F oven until warm. Enjoy!",
    "For plain scones, just omit the blueberries.",
    "*COOK'S NOTE: Update on freezing scones. I usually use Red Star non-aluminum baking powder. I recently ran out, so I bought some Rumford's instead. After freezing solid, the Rumford scones did not rise at all when baking. So fyi, if you use Rumford's baking powder, bake the scones straightaway, and don't freeze."
  ],
  "ingredients": [
    "0",
    "2 1/2 cups (11.25 ounces) all-purpose unbleaced flour (I use King Arthur Flour)",
    "1/4 cup granulated sugar, plus more for sprinkling on tops of scones",
    "1 tablespoon baking powder* (see step 11)",
    "3/4 teaspoon kosher salt",
    "6 tablespoons chilled unsalted butter, cut into small cubes",
    "3/4 cup frozen wild Maine blueberries",
    "1 cup heavy cream, plus more for brushing on tops of scones",
    "1 large egg",
    "1 1/2 teaspoons pure vanilla extract"
  ],
  "__v": 1
}