{
  "hash": "35b9e332a9832f2f7e691c4002784144df59f2fa",
  "title": "Rainbow Sushi Rolls",
  "image": "https://static.wixstatic.com/media/26357d_c4dd22900837480e99c873b6a5e8d16a~mv2_d_4000_6000_s_4_2.jpg/v1/fill/w_1181,h_1772,al_c,q_90,usm_0.66_1.00_0.01/26357d_c4dd22900837480e99c873b6a5e8d16a~mv2_d_4000_6000_s_4_2.webp",
  "href": "https://www.pickuplimes.com/single-post/2019/04/12/Rainbow-Sushi-Rolls",
  "extension": "Chrome",
  "firstAdded": "2019-05-31T11:35:50.128000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 180C/350F.",
    "Cook your sushi rice as preferred.",
    "Lay the sweet potato strips on a parchment lined baking sheet and roast for 10-15 minutes, flipping half way, until they are fork tender. Remove from oven and let cool, before cutting into strips.",
    "While the sweet potato and rice cook, prep your other vegetables.",
    "Once the rice is cooled, you can begin to roll! Place a sheet of nori, rough side up, on your rolling mat and spoon on about 1/2 cup of rice. Gently spread out the rice with a spoon or your fingers.Tip: if you are finding the rice sticks to the spoon or your fingers, you can wet your fingers with some water, and it will make it easier to spread.Tip: the rice should cover the sheet, but you should still be able to see some of the seaweed below the rice. Leave about 1 inch of space at the top of your sheet.",
    "Place your vegetables in a line, about 1/2 inch above the bottom of your roll.",
    "Using your fingers to hold the fillings in place, pull up on the mat to gently roll the sushi into a firm cylinder. Cut into 1/2 inch pieces, or leave whole and cut just before eating."
  ],
  "ingredients": [
    "0",
    "3 cups of cooked sushi rice (seasoned or plain)*",
    "5-6 sheets of seaweed nori sheets",
    "1 sweet potato, peeled and cut into 1/4 inch planks",
    "1/2 avocado, sliced into strips",
    "1/4 mango, sliced into thin strips",
    "1/4 cucumber, de-seeded and sliced into thin strips",
    "1/4 red bell pepper, sliced into thin strips",
    "*made from approx. 1.5 cups of uncooked rice"
  ],
  "__v": 1
}