{
  "hash": "0cf6476972fe2a6e12e212af0994fe49bd9f8c81",
  "title": "Turkish Eggplant Casserole with Tomatoes (Imam Bayildi)",
  "image": "http://feedmephoebe.com/wp-content/uploads/2014/07/IMG_1939.jpg",
  "href": "http://feedmephoebe.com/2014/07/meatless-monday-turkish-eggplant-casserole-recipe-tomatoes-imam-bayildi/",
  "extension": "Chrome",
  "firstAdded": "2015-04-23T19:59:15.675000",
  "users": [
    null
  ],
  "keywords": [
    "medium",
    "eggplant",
    "salt",
    "olive",
    "oil",
    "yellow",
    "onion",
    "garlic",
    "red",
    "chili",
    "cinnamon",
    "tomatoes",
    "parsley",
    "divided"
  ],
  "directions": [
    "0",
    "Preheat the oven to 350 degrees F.",
    "Lightly salt the eggplant slices and allow to stand for 20 minutes. Pat the slices dry and set aside.",
    "Heat a thin layer of olive oil in a large oven proof (preferably cast iron) skillet. Pan fry the eggplant in batches over medium-high heat until golden brown on both sides, about 2 minutes per side. Add more oil as necessary between batches so the eggplant doesn't burn, but try not to have too heavy a hand - the pan just needs to be greased. Remove the eggplant to a plate.",
    "Add the onion to the skillet and saute over medium heat until soft, 5 minutes. Add the garlic, chili flakes, 1/2 teaspoon sea salt and cinnamon. Cook for one minute more, until fragrant. Carefully pour in the tomatoes and simmer until thickened slightly, 5 minutes. Remove from the heat and stir in half the parsley.",
    "If using the skillet, remove 3/4 of the sauce to a bowl. Arrange one layer of eggplant evenly in the bottom of the skillet or large casserole dish. Slather with a layer of sauce, and repeat with the remaining eggplant and sauce - like you would a lasagna.",
    "Cover with foil and bake in the oven for 45 minutes, until the eggplant is very soft and the sauce has reduced. Allow to sit for 10 minute before cutting into it. Garnish with the remaining parsley and serve warm or at room temperature."
  ],
  "ingredients": [
    "0",
    "2 medium eggplant, thinly sliced (1/4 inch thick)",
    "Sea salt",
    "Olive oil",
    "1 small yellow onion, diced",
    "2 large garlic cloves",
    "1/4 teaspoon red chili flakes",
    "Dash of cinnamon",
    "One 15 ounce can diced tomatoes",
    "2 tablespoons finely chopped fresh parsley, divided"
  ],
  "__v": 1
}