{
  "hash": "d041ff6ab345abe7e4e5fc93ed12a9e98563e04d",
  "title": "Gluten-Free Whole Grain Mediterranean Pie Crust",
  "image": "",
  "href": "http://cooking.nytimes.com/recipes/1014552-gluten-free-whole-grain-mediterranean-pie-crust",
  "extension": "",
  "firstAdded": "2015-10-27T13:06:45.202000",
  "users": [
    null
  ],
  "keywords": [
    "flour",
    "make",
    "grinding",
    "millet",
    "spice",
    "glutenfree",
    "buckwheat",
    "cornmeal",
    "teff",
    "potato",
    "starch",
    "cornstarch",
    "arrowroot",
    "combination",
    "salt",
    "extra",
    "virgin",
    "olive",
    "oil",
    "water",
    "red",
    "wine",
    "vinegar",
    "strained",
    "lemon",
    "juice",
    "reason",
    "acid",
    "relaxes",
    "dont",
    "worry",
    "gluten"
  ],
  "directions": [
    "0",
    "Sift together the grain flour and starch. In a large bowl or in the bowl of a standing mixer fitted with the paddle or a food processor fitted with the steel blade, add the salt and mix together. If using a bowl, make a well in the center, add the olive oil and mix in with a fork. If using a mixer or food processor, turn on and add the olive oil. When it is evenly distributed through the grain flour and starch, combine the water and vinegar or lemon juice and add it with the machine running. The dough should come together in a ball.",
    "In most cases you won’t need as much water as is required for wheat flour dough, because the grain flours don’t absorb as much, but each combination behaves a little differently. Divide into 2 equal pieces, shape into a flat circle and wrap tightly with plastic. The dough may be sticky, so flour your hands and work surface. Let rest for 1 hour.",
    "To line tart pans place the dough in the center of the pan and, pressing from the heel of your hand, press the dough out to the edges of the pan, then up the sides. It should be soft and easy to manipulate. Pinch an attractive lip around the edge of the pan and refrigerate uncovered until ready to use."
  ],
  "ingredients": [
    "0",
    "120",
    "grams (approximately 1 cup) millet flour (I make this by grinding millet in my spice mill)",
    "100",
    "grams (about 4/5 cup) another whole grain gluten-free flour, like buckwheat, cornmeal, or teff",
    "95",
    "grams (approximately 7 tablespoons) potato starch, cornstarch, arrowroot or a combination",
    "5",
    "grams (3/4 teaspoon) salt",
    "50",
    "grams (1/4 cup) extra virgin olive oil",
    "150 to 165",
    "grams (2/3 to 3/4 cup) water",
    "10",
    "grams (2 teaspoons) red wine vinegar or strained lemon juice (optional; the reason for the acid is that it relaxes the gluten in flour, but you don’t have to worry about gluten)"
  ],
  "__v": 1
}