{
  "hash": "33b40d2e4f152c8f7fe77970eae231bf05053d95",
  "title": "Roasted Sweet Potato Soup",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2015/02/roasted-sweet-potato-soup-vertical-735.jpg",
  "href": "http://www.simplyrecipes.com/recipes/roasted_sweet_potato_soup/",
  "extension": "Chrome",
  "firstAdded": "2015-10-02T21:16:31.234000",
  "users": [
    null
  ],
  "keywords": [
    "garnet",
    "potatoes",
    "cubes",
    "shallots",
    "lengthwise",
    "olive",
    "oil",
    "kosher",
    "salt",
    "thyme",
    "seeds",
    "cumin",
    "chicken",
    "stock",
    "black",
    "pepper",
    "sour",
    "cream",
    "plain",
    "yogurt",
    "greek",
    "regular",
    "omit",
    "paleo"
  ],
  "directions": [
    "0",
    "1 Preheat oven to 450°F. Place sweet potato cubes and shallots in a large bowl. Drizzle with oil. Sprinkle with salt, thyme, and cumin. Toss so all pieces are well coated with olive oil and seasonings.",
    "2 Spread the sweet potatoes and shallots out on a foil or silicone lined baking sheet. Roast for 25 minutes or until cooked through and nicely caramelized and browned around the edges. Remove from oven.",
    "3 While the sweet potatoes are roasting, heat chicken stock in a saucepan on the stovetop until steamy.",
    "4 Place the cooked sweet potatoes and shallots in a blender and add the hot chicken stock. Purée until smooth. NOTE, when blending hot liquids, fill the blender bowl no more than a third full, and start with short pulses. So, depending on the size of your blender you may need to work in batches. Or use an immersion blender.",
    "5 Taste for seasoning, add more salt and pepper to taste. Serve in bowls with a dollop of sour cream (if using)."
  ],
  "ingredients": [
    "0",
    "1 pound garnet sweet potatoes, peeled, cut into 1 1/2-inch cubes",
    "2 large shallots, peeled and cut in half lengthwise",
    "2 Tbsp olive oil",
    "1/2 teaspoon kosher salt",
    "1 teaspoon ground thyme",
    "1/4 teaspoon of cumin seeds (or ground cumin)",
    "3 cups chicken stock",
    "1/8 teaspoon black pepper",
    "2 Tbsp sour cream or plain yogurt (Greek or regular, omit for paleo version)"
  ],
  "__v": 1
}