{
  "hash": "b72569379766f847edf5c06485c601f801130395",
  "title": "Garlic Butter Smashed Sweet Potatoes with Parmesan",
  "image": "http://www.fortheloveofcooking.net/wp-content/uploads/2016/10/DSC_8282Garlic-Butter-Smashed-Sweet-Potatoes-with-Parmesan.jpg",
  "href": "http://www.fortheloveofcooking.net/2016/10/garlic-butter-smashed-sweet-potatoes-with-parmesan.html?utm_source=feedburner&utm_medium=email&utm_campaign=Feed%3A+blogspot%2FOlvyH+%28For+the+Love+of+Cooking%29",
  "extension": "Chrome",
  "firstAdded": "2016-10-20T19:13:14.900000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 375 degrees.",
    "Cut the sweet potatoes into 1 inch thick coins.",
    "Boil a pot of water over high heat.",
    "Add the sweet potato coins to the boiling water and cook until just fork tender, about 15-20 minutes.",
    "Remove from the water and drain well on a towel.",
    "Pat the sweet potato coins dry then place on a baking sheet that has been coated with cooking spray.",
    "Place into the oven and bake for 7-10 minutes, or until really tender.",
    "While the potatoes are baking, melt the butter with the minced garlic in the microwave for 20 seconds. Set aside.",
    "Remove the baking sheet from the oven and smash gently using a fork.",
    "Drizzle the melted garlic butter evenly over each smashed sweet potato coin then season with sea salt and freshly cracked pepper, to taste.",
    "Sprinkle the parmesan cheese evenly over each coin.",
    "Return the baking sheet to the oven and cook for 5-7 minutes or until the cheese is melted and the bottoms are a bit crisp.",
    "Remove from the oven and sprinkle with freshly chopped parsley. Serve immediately. Enjoy."
  ],
  "ingredients": [
    "0",
    "2 sweet potatoes, cut into 1 inch thick coins",
    "1½ tbsp butter",
    "2 cloves of garlic, minced",
    "Sea salt and freshly cracked pepper, to taste",
    "Parmesan cheese, shredded",
    "Fresh parsley, chopped"
  ],
  "__v": 1
}