{
  "hash": "04020e3d46209da47ae5cff16dbd988c657d443e",
  "title": "Soupe à l’oignon gratinée traditionnelle",
  "image": "http://frcdn.ar-cdn.com/recipes/originalxl/e40c7047-3c5f-468e-8041-7b486978efb4.jpg",
  "href": "http://allrecipes.fr/recette/13947/soupe---l-oignon-gratin-e-traditionnelle.aspx",
  "extension": "Chrome",
  "firstAdded": "2016-01-30T22:19:56.773000",
  "users": [
    null
  ],
  "keywords": [
    "beurre",
    "beaux",
    "oignons",
    "pluchs",
    "mincs",
    "trs",
    "finement",
    "cuillres",
    "soupe",
    "deau",
    "cuillre",
    "rase",
    "farine",
    "litre",
    "bouillon",
    "poulet",
    "vin",
    "blanc",
    "caf",
    "sel",
    "poivre",
    "noir",
    "tranches",
    "baguette",
    "autre",
    "pain",
    "gruyre"
  ],
  "directions": [
    "0",
    "Faire fondre le beurre dans une grande casserole sur feu doux et y faire revenir les oignons à découvert en remuant constamment pour qu’ils dorent à peine (entre 15 et 30 minutes, en fonction de l’épaisseur du fond de la casserole). Ajouter 2 cuillères à soupe d’eau froide, couvrir et laisser cuire 15 minutes à feu très doux.",
    "Ajouter alors la farine et remuer pour bien enrober les oignons. Laisser cuire encore pendant 5 minutes sans couvrir en remuant toujours. Verser alors le bouillon de poulet et le vin blanc. Saler et poivrer, porter à ébullition et laisser bouillir doucement pendant 20 minutes. Ajuster l'assaisonnement au besoin.",
    "Faire griller les tranches de pain. Elles doivent être bien grillées pour ne pas se décomposer une fois dans la soupe. On peut les faire au grille-pain ou au four, au choix. Les placer au fond d’une cocotte ou d’un plat creux allant au four puis verser la soupe par-dessus. Le pain va remonter à la surface. Le parsemer de fromage râpé puis faire gratiner sous le grill du four, environ 4 minutes, en fonction du four… Il est important de bien surveiller la cuisson sinon, au lieu d’être gratinée, votre soupe sera carbonisée !"
  ],
  "ingredients": [
    "0",
    "40 g de beurre",
    "3 beaux oignons épluchés et émincés très finement",
    "2 cuillères à soupe d'eau",
    "1 cuillère à soupe rase (20 g) de farine",
    "1,5 litre de bouillon de poulet",
    "1",
    "10 cl de vin blanc",
    "½ cuillère à café de sel",
    "¼ de cuillère à café de poivre noir",
    "6 tranches de baguette (ou autre pain blanc)",
    "60 g de gruyère râpé"
  ],
  "__v": 1
}