{
  "__v": 2,
  "directions": [
    "0",
    "In a large skillet or saucepan, melt butter. Add chopped onion. Season with salt and cook until soft and just beginning to turn brown. Add 2 cloves garlic and cook for about 1 minute more.",
    "Stir flour into onions and garlic and mix well until flour is incorporated into melted butter.",
    "Add milk and whisk to combine. Reduce heat, and let sauce simmer until it begins to thicken and look velvety, about 10 minutes, stirring frequently.",
    "Add cheese and stir to combine. Season with nutmeg, pepper, and additional salt, if desired.",
    "When sauce has thickened, add spinach a handful at a time, stirring to combine the spinach into sauce until it wilts before adding next handful.",
    "Once all spinach has been added, adjust seasonings if necessary. Remove from heat while chicken is cooking.",
    "Bring a pot of cold salted water to a boil for the pasta.",
    "While water is coming to a boil, heat a second skillet over medium heat. Add just enough olive oil to coat the bottom completely. Pat chicken dry with paper towels. Season liberally with salt and pepper on both sides. Put chicken into skillet and saute on one side, then flip and cook on second side until chicken is cooked through and golden brown on both sides. Add remaining 1 clove of minced garlic to skillet after flipping and watch to be sure it doesn’t burn.",
    "When chicken is nearly done, add pasta to water and boil to desired tenderness.",
    "Re-warm the sauce. Using a fine grater, grate about 2 teaspoons of lemon zest (or more to taste) into the sauce and stir to combine.",
    "To serve, divide pasta between two plates. Top with creamy spinach sauce, then chicken breast, then additional sauce. Garnish with more lemon zest, if desired. – Akron Beacon Journal/McClatchy-Tribune Information Services"
  ],
  "firstAdded": "2014-10-14T17:12:07.273000",
  "hash": "ffdfe52dfd4ebcd4e9ee8a155fe46fdbbaadee23",
  "href": "http://www.thestar.com.my/Lifestyle/Food/Recipes/2014/03/17/Sauteed-Chicken-Breast-With-Pappardelle-And-Creamy-Spinach-Sauce/",
  "image": "http://www.thestar.com.my/~/media/Images/TSOL/Photos-Upload/Food and Drink/2014/03/FOODSPRINGCHICKENAK.ashx?w=620&h=413&crop=1&",
  "ingredients": [
    "0",
    "¼ cup (60g) butter",
    "1 medium yellow cooking onion, chopped",
    "3 cloves garlic, minced, divided use",
    "4 tbsp flour",
    "3 cups milk (do not use skim), at room temperature",
    "½ cup grated Parmesan cheese",
    "Dash of nutmeg, or more to taste",
    "450g fresh spinach, washed, stemmed and roughly chopped",
    "2 boneless, skinless chicken breast halves, pounded thin",
    "Olive oil, for sauteing",
    "Salt and pepper, to taste",
    "125g fresh pappardelle pasta",
    "1 lemon for zesting"
  ],
  "keywords": [
    "butter",
    "medium",
    "yellow",
    "cooking",
    "onion",
    "garlic",
    "divided",
    "use",
    "flour",
    "milk",
    "skim",
    "room",
    "parmesan",
    "cheese",
    "nutmeg",
    "spinach",
    "washed",
    "stemmed",
    "roughly",
    "boneless",
    "skinless",
    "chicken",
    "breast",
    "halves",
    "pounded",
    "olive",
    "oil",
    "sauteing",
    "salt",
    "pepper",
    "pappardelle",
    "pasta",
    "lemon",
    "zesting"
  ],
  "title": "Sauteed Chicken Breast With Pappardelle And Creamy Spinach Sauce",
  "users": [
    null
  ]
}