{
  "hash": "24fe77c6908a4eaffc3d99a2809ca7eb1116c9a2",
  "title": "Toasted Barley and Asparagus \"risotto\"",
  "image": "http://www.epicurious.com/images/recipesmenus/2001/2001_march/104816.jpg",
  "href": "http://www.epicurious.com/recipes/food/views/toasted-barley-and-asparagus-risotto-104816",
  "firstAdded": "2015-02-22T18:40:45.536000",
  "users": [
    null
  ],
  "keywords": [
    "asparagus",
    "trimmed",
    "pieces",
    "pearl",
    "barley",
    "butter",
    "onion",
    "garlic",
    "canned",
    "broth",
    "tomatoes",
    "juice",
    "parmesan",
    "cheese",
    "arugula",
    "parsley",
    "lemon",
    "peel"
  ],
  "directions": [
    "0",
    "Cook asparagus in pot of boiling salted water until crisp-tender, about 3 minutes. Drain. Transfer to bowl of ice water and cool. Drain. (Can be made 1 day ahead. Cover and refrigerate.)",
    "Stir barley in heavy large saucepan over medium heat until lightly toasted, about 5 minutes. Transfer barley to bowl. Melt butter in same saucepan over medium heat. Add onion and garlic; sauté until tender, about 5 minutes. Add barley and stir to coat. Add 2 cups broth; reduce heat to medium-low and simmer until liquid is absorbed, stirring frequently, about 7 minutes. Mix in 2 1/2 cups broth and simmer until absorbed, stirring frequently. Add 3 cups broth and simmer until barley is tender and creamy but still slightly firm to bite, stirring frequently and adding more broth if mixture is dry, about 45 minutes. Add tomatoes and asparagus; stir until heated through, about 3 minutes. Mix in cheese, arugula and lemon peel. Season with salt and pepper."
  ],
  "ingredients": [
    "0",
    "12 ounces asparagus, trimmed, cut into 3/4-inch pieces",
    "1",
    "2 cups pearl barley",
    "3 tablespoons butter",
    "1 cup finely chopped onion",
    "3 large garlic cloves, finely chopped",
    "8 1/2 cups (about) canned vegetable broth",
    "2 cups drained canned diced tomatoes in juice",
    "1/2 cup freshly grated Parmesan cheese",
    "1/2 cup chopped arugula or 3 tablespoons chopped fresh parsley",
    "2 teaspoons grated lemon peel"
  ],
  "__v": 1
}