{
  "hash": "fe3e4d7a5f83bd416603b109821786e6c1501ca9",
  "title": "Pumpkin and Feta Muffins",
  "image": "http://www.101cookbooks.com/mt-static/images/food/pumpkin_feta_muffins.jpg",
  "href": "http://www.101cookbooks.com/archives/pumpkin-and-feta-muffins-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2017-01-09T03:52:25.618000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "The recipe calls for 2 cups of flour. There are a couple different flour combinations you might explore. The original: you can use unbleached all-purpose flour - 2 cups / 9 oz / 260g. Alternatively, I use equal parts APF and spelt flour which translates to 1 cup / 4.5 oz/ 130g APF + 1 cup / 4 oz / 115g spelt flour. I might try a whole wheat pastry flour version next time - using 2/3 wpp + 1/3 apf, the first time around - to see how that goes. You might need to add an extra splash of milk though.",
    "Preheat oven to 405F / 200C, with rack in the top third. Use the butter to grease a 12-hole muffin pan and set aside.",
    "Sprinkle the olive oil and some salt and pepper over the squash. Toss well and turn onto a baking sheet or roasting pan. Arrange in a single layer and bake for 15 - 25 minutes or until cooked through entirely. Set aside to cool.",
    "Transfer two-thirds of the squash to a large mixing bowl along with the spinach, parsley, sunflower seeds, Parmesan, two-thirds of the feta, and all of the mustard. Gently fold together. In a separate bowl beat the eggs and milk together and add to the squash mix. Sift the flour and baking powder onto the squash mix, top with the salt and a generous dose of freshly ground black pepper and fold together just until the batter comes together, be careful not to over mix.",
    "Spoon the mixture into the prepared pan, filling each hole 3/4 full, top each muffin with a bit of the remaining squash and feta (see photo up above). Bake for 15-20 minutes or until the tops and sides of the muffins are golden, and the muffins have set up completely. Let cool for a couple minutes then turn out onto a cooling rack. I like these muffins cooled a bit, served just warmer than room temperature.",
    "Makes 12 muffins.",
    "Adapted from a recipe in Martha Goes Green by Rosie Percival and Ruth Friedlander. Available for purchase here.",
    "Print Recipe"
  ],
  "ingredients": [
    "0",
    "1 tablespoon unsalted butter",
    "2 tablespoons olive oil",
    "2 cups / 9 oz / 255g cubed pumpkin or butternut squash, 1/2-inch cubes",
    "salt and pepper to taste",
    "1 large handful of baby spinach, chopped",
    "2 tablespoons chopped parsley or cilantro",
    "3 tablespoons sunflower seeds kernels",
    "3/4 cup / 1 oz / 30g freshly grated Parmesan",
    "100g / 3.5 oz / 1/2 cup cubed feta",
    "2 teaspoons whole-grain mustard",
    "2 large eggs, lightly beaten",
    "3/4 cup / 180 ml milk",
    "2 cups flour (see headnote!)",
    "4 teaspoons aluminum free baking powder",
    "1 teaspoon fine-grain sea salt"
  ],
  "__v": 2
}