{
  "hash": "fa7919ba154e6fd8022e8fc162c3620c6365a97f",
  "title": "Vegan Ground 'Meat' [Gluten-Free]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/06/Screen-Shot-2015-06-04-at-8.22.22-PM.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/veggie-ground-meat/",
  "extension": "Chrome",
  "firstAdded": "2015-06-11T13:22:18.638000",
  "users": [
    null
  ],
  "keywords": [
    "medium",
    "sized",
    "cauliflower",
    "chunks",
    "core",
    "walnuts",
    "tomato",
    "tamari",
    "soy",
    "braggs",
    "amino",
    "work",
    "smoked",
    "paprika",
    "celtic",
    "salt",
    "white",
    "pepper",
    "chilli"
  ],
  "directions": [
    "0",
    "To get started with this recipe you will need either a food processor or good chopping knife and board. You will also need a mixing spoon and a lined baking tray. (Click here to see video tutorial).",
    "Put all the ingredients into the food processor and pulse to a coarse blend (or chop finely by hand).",
    "Turn your oven on to 350 ° F to preheat, then get your lined baking tray and spread the mixture evenly over the tray.",
    "Pop the mixture in the oven for 30 minutes, then take it out and stir the mixture before baking again for 15 minutes. Take it out and check again. In my case it needed a further 10 minutes before the crumble was cooked through and the mixture was dry enough. You can cook this much quicker if you spread the mixture over a couple of trays rather than just one. Adjust according to your oven settings and quantity being made.",
    "Once cooked, you can now store this crumble in the fridge ready to make pasta sauces, lasagne, taco meat, pizza toppings, and much more! So easy and so yummy!"
  ],
  "ingredients": [
    "0",
    "1 medium sized cauliflower, chopped into large chunks including the core",
    "1 cup walnuts ( 1 cup )",
    "5 ounces tomato paste",
    "1 tbsp tamari (soy sauce or Braggs amino also work fine)",
    "1 tsp smoked paprika",
    "1 tsp celtic sea salt or to your taste",
    "1/8 tsp white pepper or to your taste",
    "1/4 tsp chilli flakes"
  ],
  "__v": 1
}