{
  "hash": "16e5587bba041e6eb6e4a8671d7dcd418e2c2e7a",
  "title": "Easy Restaurant-Style Blender Salsa",
  "image": "http://cdn.averiecooks.com/wp-content/uploads/2014/12/salsacollage1.jpg",
  "href": "http://www.averiecooks.com/2014/12/easy-restaurant-style-blender-salsa.html",
  "firstAdded": "2015-02-01T19:45:40.195000",
  "users": [
    null
  ],
  "keywords": [
    "juice",
    "used",
    "plum",
    "tomatoes",
    "yellow",
    "onion",
    "roughly",
    "jalepeno",
    "peppers",
    "destemmed",
    "prefer",
    "seeds",
    "greatly",
    "reduce",
    "heat",
    "level",
    "garlic",
    "cumin",
    "salt",
    "remember",
    "brands",
    "chips",
    "saltier",
    "granulated",
    "sugar",
    "balances",
    "tomato",
    "acidity",
    "start",
    "necessary",
    "careful",
    "oversweeten",
    "cilantro",
    "leaves",
    "discard",
    "stems",
    "lime",
    "corn",
    "canned",
    "black",
    "beans",
    "rinsed"
  ],
  "directions": [
    "0",
    "Add all ingredients (except optional corn and beans) to the canister of a blender or food processor in the order listed. Pulse or blend on high power until texture is as smooth as desired. If you have a very strong blender, you probably don't need to pre-chop the ingredients before adding them to the blender, but I do just to make sure I don't get large random, accidentally unblended chunks of any one ingredient.",
    "Taste the salsa and based on personal preference tweak as necessary.",
    "Optionally stir in the corn and black beans.",
    "Transfer to airtight container and serve immediately with chips. However, I prefer to refrigerate salsa for 1 day prior to serving because I prefer chilled salsa and because the flavors marry, mellow, and the flavor improves on the second and third day. Salsa will likely keep up to 1 week airtight in the fridge; however, we've always eaten a batch within 3 days."
  ],
  "ingredients": [
    "0",
    "one 28-ounce can tomatoes, including juice (I used these whole, peeled plum tomatoes)",
    "1 small yellow onion, peeled and roughly chopped",
    "1 or 2 jalepeno peppers, de-stemmed and roughly chopped (I prefer 2; remove seeds to greatly reduce heat level)",
    "3 cloves garlic, peeled and finely chopped",
    "1 1/2 teaspoons ground cumin, or to taste",
    "1 1/2 teaspoons salt, or to taste (remember some brands of tomatoes and chips are much saltier than others)",
    "1/4 to 1 teaspoon granulated sugar, optional and to taste (balances the heat and tomato acidity; start with less and add more if necessary; careful not to over-sweeten)",
    "1 or 2 handfuls cilantro leaves, discard stems (I prefer 2)",
    "about 3 tablespoons lime juice",
    "about 3/4 cup corn, optional",
    "about 3/4 cup canned black beans, drained and rinsed, optional",
    "corn chips, for serving"
  ],
  "__v": 1
}