{
  "hash": "60c2f01f3cbd1d7ffadec58d2b4a0042b23773fc",
  "title": "Oreo Cheesecake",
  "image": "http://recipe-folder.com/img/recipe-images/057/802/3321357257.jpg",
  "href": "https://sugarspunrun.com/oreo-cheesecake/",
  "extension": "",
  "firstAdded": "2019-06-08T15:01:57.678000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Oreo Cheesecake",
    "Using an electric mixer, beat together cream cheese and sugar until creamy and well-combined.",
    "Stir in sour cream and vanilla extract.",
    "Add eggs, one at a time, stirring until just combined after each addition (you don’t want to over-beat the eggs or the cheesecake will be more likely to crack)",
    "Use a spatula to fold in Oreos.",
    "Pour evenly into springform pan over Oreo crust.",
    "Bake on 350F for 35-45 minutes or until center is set but springs back to the touch.",
    "Once Oreo Cheesecake has finished baking, allow it to cool to room temperature for about an hour before placing in the refrigerator to cool and set completely (about 6 hours). Once cheesecake is cooled, you may prepare the chocolate ganache.",
    "Chocolate Ganache (optional)",
    "Combine chocolate chips and heavy cream in a small saucepan over low heat. Stir frequently until chocolate is melted and mixture is smooth.",
    "Allow ganache to cool for 10 minutes and then pour evenly over cheesecake. Allow ganache to set before topping with whipped cream (if using) and slicing and serving.",
    "If desired, top off with homemade whipped cream and sprinkle with broken cookie pieces."
  ],
  "ingredients": [
    "0",
    "Oreo Cheesecake",
    "1 Oreo Crust prepared in a 9-10\" springform pan, not baked",
    "32 oz cream cheese softened to room temperature (910g)",
    "1 cup sugar (200g)",
    "¾ cup sour cream (180g)",
    "1 teaspoon vanilla extract",
    "4 large eggs room temperature preferred",
    "15 broken Oreos*",
    "Chocolate Ganache (optional)",
    "1⅓ cup semisweet or dark chocolate chips (225g)",
    "½ cup heavy cream (120ml)",
    "1/2 batch homemade whipped cream (optional)"
  ],
  "__v": 1
}