{
  "hash": "09dabe239acec8b9763df03cd97a47d8d19953fc",
  "title": "Chocolate Chip Pumpkin Bread Recipe",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2017/09/2017-09-26-PumpmkinChocChipLoaf-8.jpg",
  "href": "https://www.simplyrecipes.com/recipes/chocolate_chip_pumpkin_bread/?utm_source=bloglovin.com&utm_medium=feed&utm_campaign=Feed%3A+SimplyRecipesRecipesOnly+%28Simply+Recipes+-+Recipes+Only%29",
  "extension": "Chrome",
  "firstAdded": "2018-10-11T15:40:05.287000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350°F. Butter or spray a 9-x-5-inch loaf pan.",
    "Mix the topping: Whisk 3 tablespoons of sugar and 1/2 teaspoon cinnamon together in a small bowl. Set aside",
    "Mix the dry ingredients: Combine the flour, baking powder, kosher salt, and cinnamon in a large mixing bowl.",
    "Make the batter: In a separate medium-sized mixing bowl, whisk together the pumpkin, sugar, eggs, milk, melted butter, and vanilla extract until well combined. Pour the pumpkin mixture into the flour mixture and fold to combine. Fold in the mini chocolate chips.",
    "Transfer the batter into the loaf pan. Tap the pan a few times on the counter to remove air bubbles, then smooth the top with a spatula. Sprinkle with cinnamon sugar and more mini chocolate chips.",
    "Bake the bread: Bake for 50 to 60 minutes, or until a toothpick inserted in the center of the bread comes out clean. Remove from the oven and cool in the pan on a cooling rack for 20 minutes before removing and cooling completely.",
    "Wrap up any leftovers with foil or plastic wrap and store on the counter. The bread will keep for several days."
  ],
  "ingredients": [
    "0",
    "For the topping:",
    "3 tablespoons sugar",
    "1/2 teaspoon ground cinnamon",
    "For the bread:",
    "2 cups (280 g) all-purpose flour",
    "2 1/4 teaspoons baking powder",
    "3/4 teaspoon kosher salt",
    "1/2 teaspoon ground cinnamon",
    "1 cup (244 g) pumpkin puree",
    "1 1/4 cups (250 grams) granulated sugar",
    "2 large eggs",
    "1/2 cup (125 ml) whole milk (2% is also fine)",
    "1/2 cup (113 g) butter, melted",
    "2 teaspoons vanilla extract",
    "1/2 cup mini chocolate chips, plus more for topping"
  ],
  "__v": 1
}