{
  "hash": "9bbfd29168f71789021aee4f99844dbba319dcc8",
  "title": "Vegan Gluten Free Black Bean Brownies",
  "image": "https://cdn3.minimalistbaker.com/wp-content/uploads/2013/04/Vegan-Gluten-Free-Black-Bean-Brownies-square.jpg",
  "href": "https://minimalistbaker.com/vegan-gluten-free-black-bean-brownies/",
  "extension": "Chrome",
  "firstAdded": "2015-07-22T09:37:51.513000",
  "users": [
    null
  ],
  "keywords": [
    "black",
    "beans",
    "rinsed",
    "flax",
    "eggs",
    "coconut",
    "sub",
    "oil",
    "cocoa",
    "higher",
    "quality",
    "better",
    "salt",
    "vanilla",
    "heaping",
    "raw",
    "sugar",
    "slightly",
    "pulsed",
    "food",
    "processor",
    "coffee",
    "grinder",
    "refined",
    "texture",
    "baking",
    "toppings",
    "crush",
    "walnuts",
    "pecans",
    "semisweet",
    "chocolate",
    "chips"
  ],
  "directions": [
    "0",
    "Preheat oven to 350 degrees.",
    "Lightly grease a 12-slot standard size muffin pan (not mini). Make sure you've rinsed and thoroughly drained your black beans at this point.",
    "Prepare flax egg by combining flax and water in the bowl of the food processor. Pulse a couple times and then let rest for a few minutes.",
    "Add remaining ingredients (besides walnuts or other toppings) and puree - about 3 minutes - scraping down sides as needed. You want it pretty smooth.",
    "If the batter appears too thick, add a Tbsp or two of water and pulse again. It should be slightly less thick than chocolate frosting but nowhere close to runny.",
    "Evenly distribute the batter into the muffin tin and smooth the tops with a spoon or your finger.",
    "Optional: Sprinkle with crushed walnuts, pecans or chocolate chips.",
    "Bake for 20-26 minutes or until the tops are dry and the edges start to pull away from the sides. I found mine took about 25.",
    "Remove from oven and let cool for 30 minutes before removing from pan. They will be tender, so remove gently with a fork. The insides are meant to be very fudgy, so don't be concerned if they seem too moist - that's the point. Plus, they're vegan so it doesn't really matter.",
    "Store in an airtight container for up to a few days. Refrigerate to keep longer."
  ],
  "ingredients": [
    "0",
    "1 15 oz. can (~ 1 3/4 cups) black beans, well rinsed and drained",
    "2 large flax eggs",
    "3 T coconut oil, melted (or sub other oil of choice)",
    "3/4 cup cocoa powder (the higher quality the better)",
    "1/4 tsp sea salt",
    "1 tsp pure vanilla extract",
    "heaping 1/2 cup raw sugar, slightly ground or pulsed in a food processor or coffee grinder for refined texture",
    "1 1/2 tsp baking powder",
    "Optional toppings: crush walnuts, pecans or semisweet chocolate chips"
  ],
  "__v": 1
}