{
  "hash": "bf3426c64fecd25d7e9d41256b01d73855bf1ea6",
  "title": "Smoky Sage and Giblet Gravy",
  "image": "",
  "href": "https://www.epicurious.com/recipes/food/views/smoky-sage-and-giblet-gravy-103233",
  "extension": "Chrome",
  "firstAdded": "2018-11-08T02:37:24.902000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Rinse turkey neck, gizzard, heart and wing tips. Place in heavy large saucepan. Add broth, vermouth, carrot, onion, mushrooms, sage and peppercorns. Bring to boil over medium-high heat. Reduce heat to low; cover pan. Simmer until neck meat is very tender, about 2 hours 30 minutes.",
    "Meanwhile, place liver in heavy small saucepan; cover with cold water. Simmer over medium heat until firm to touch and cooked through, about 5 minutes. Drain.",
    "Strain broth into small bowl. Transfer neck, gizzard and heart to work surface; discard remaining solids. Carefully remove all meat from neck. Chop meat finely. Cut away any tough membrane from gizzard. Chop gizzard, heart and liver finely. Combine meats in medium bowl. Spoon fat off top of broth and discard. (Giblets and broth can be made 1 day ahead. Cover separately and refrigerate.)"
  ],
  "ingredients": [
    "0",
    "Giblet broth and gibletsNeck, gizzard, heart, wing tips and liver reserved from 1 turkey2 1/2 cups canned low-salt chicken broth1/2 cup dry vermouth or white wine1 medium carrot, peeled, sliced1 small onion, sliced4 ounces crimini mushrooms, sliced12 large fresh sage leaves1/2 teaspoon black peppercorns",
    "Neck, gizzard, heart, wing tips and liver reserved from 1 turkey",
    "2 1/2 cups canned low-salt chicken broth",
    "1/2 cup dry vermouth or white wine",
    "1 medium carrot, peeled, sliced",
    "1 small onion, sliced",
    "4 ounces crimini mushrooms, sliced",
    "12 large fresh sage leaves",
    "1/2 teaspoon black peppercorns",
    "GravyRoasting pan and pan juices from 1 roasted turkey8 bacon slices (about 7 ounces)6 tablespoons all purpose flour3 tablespoons dry vermouth or white wine2 tablespoons chopped fresh sage",
    "Roasting pan and pan juices from 1 roasted turkey",
    "8 bacon slices (about 7 ounces)",
    "6 tablespoons all purpose flour",
    "3 tablespoons dry vermouth or white wine",
    "2 tablespoons chopped fresh sage"
  ],
  "__v": 1
}