{
  "hash": "6f5108db70c531edb7ce64772d6da266a4f052d2",
  "title": "Simple Tender Pot Roast with Holy Grail Gravy",
  "image": "http://www.phoenixhelix.com/wp-content/uploads/2013/03/pot-roast-small.jpg",
  "href": "http://www.phoenixhelix.com/2013/03/11/simple-tender-pot-roast-with-holy-grail-gravy/",
  "extension": "Firefox",
  "firstAdded": "2017-06-24T07:40:42.137000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "Put all the veggies and herbs in a crock pot. (If you don’t have a crockpot, preheat your oven to 250 degrees and use a lidded casserole dish or dutch oven instead.)",
    "Pour ¼ cup broth on top of the vegetables. (This small amount is intentional; the meat will release its own juices.)",
    "Season all sides of the roast liberally with salt (and pepper, if using), and place on top of the vegetables.",
    "Cover and cook on low 6-8 hours, until meat can be shredded with fork. (If you’re using an Instant Pot, choose the Slow Cook “Normal” setting and cook the same amount of time.)",
    "When done, lift meat out of crockpot onto a plate and make the gravy: Throw away the bay leaf and rosemary branches. Pour the liquid from the crockpot into a blender. Add half of the cooked vegetables and puree. To increase the thickness of the gravy or strengthen its flavor, add more of the vegetables. Add salt and pepper, to taste.",
    "I love serving this pot roast over garlic mashed cauliflower, with gravy on top.",
    "Leftovers: You can put the meat and gravy in one container, tossing to blend before refrigeration. This keeps it moist and flavorful, and makes reheating a breeze.",
    "Note: If you’re like me and cook with garlic often, this little kitchen tool makes peeling cloves easy, which makes me a happier cook."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "2-4 lb. chuck roast (either with or without a bone is fine)",
    "1 onion (chopped)",
    "4 carrots (chopped in large chunks)",
    "2 stalks celery (thickly sliced)",
    "2-4 garlic cloves (whole)",
    "1 bay leaf (whole)",
    "2 branches fresh rosemary (whole)",
    "1/4 cup of broth (or water)",
    "sea salt",
    "black pepper (optional – omit for AIP)"
  ],
  "__v": 1
}