{
  "hash": "f85edd0938d3b5ee8a74ea5843566e0e99da9ebf",
  "title": "Carrot and Hazelnut Roast",
  "image": "",
  "href": "http://www.pikowholefoods.co.nz/recipes/hot-dishes/73-carrot-and-hazelnut-roast",
  "extension": "Chrome",
  "firstAdded": "2017-01-10T07:25:51.534000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 180 C (350 F).",
    "Place the carrots in just enough water to cover them and simmer till very soft. Meanwhile sauté the onion, garlic and mushrooms in the oil for 5-7 minutes, using a large saucepan. Add the red pepper, rosemary, mace and paprika and continue cooking for a further 3-4 minutes. Remove from the heat.",
    "When the carrots are cooked, drain and reserve any stock, then mash them with the margarine. Add this to the sautéed vegetables together with nuts, breadcrumbs and lemon juice, and mix well. If the mixture seems a little stiff, add a little reserved stock from the carrots to achieve a moist but fairly firm consistency.",
    "Mix the Soya flour and arrowroot to a thin paste with a tablespoon of the cooled stock or water, and stir well into the rest of the ingredients until evenly blended.",
    "Grease a 1kg loaf tin with margarine and press in the mixture.",
    "Cover the top with foil and bake for 50-60 minutes in the center of the oven.",
    "Allow the roast to cool slightly in the tin for about 10 minutes before turning out. Garnish with red pepper rings (these can be carefully overlapped at the bottom of the tin and cooked with the roast for a ready decorative finish) and a few whole hazelnuts along the top of the roast."
  ],
  "ingredients": [
    "0",
    "450g carrots, scrubbed and sliced",
    "1 medium onion, finely chopped",
    "1 clove garlic, crushed",
    "100g mushrooms, chopped",
    "1 tbsp vegetable oil",
    "1 small or 1/2 large red pepper, diced",
    "1 tsp fresh, or 1/2 tsp dried rosemary, chopped",
    "1 tsp mace",
    "1/2 tsp paprika",
    "25g vegan margarine",
    "175g hazelnuts toasted and ground",
    "100g fresh, wholemeal breadcrumbs",
    "1 tbsp Soya flour",
    "1 tbsp arrowroot",
    "1 tbsp freshly squeezed lemon juice",
    "black pepper and salt"
  ],
  "__v": 1
}