{
  "hash": "3346d98ed166fc6dc50014677143d1655e767f4a",
  "title": "Canederli di semolino",
  "image": "",
  "href": "http://ricette.giallozafferano.it/Canederli-di-semolino.html",
  "extension": "Chrome",
  "firstAdded": "2016-09-17T11:30:11.945000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Per preparare i canederli di semolino iniziate preparando il brodo di carne.",
    "Poi dedicatevi all’impasto: in un tegame dal fondo antiaderente e dai bordi alti fate scaldare il latte (fino a fargli sfiorare il bollore). Quindi aggiungete il semolino a pioggia mescolando continuamente ed energicamente con le fruste a mano per evitare la formazione di grumi, per circa 7-8 minuti. Dopodiché spegnete il fuoco e regolate di sale.",
    "Aggiungete ora il burro ammorbidito,continuate a mescolare perchè si sciolga nel composto caldo, dopodichè versate un uovo sbattuto. Amalgamate anch’esso agli ingredienti.",
    "Aromatizzate con la noce moscata e continuate a mescolare: il composto dovrà avere una consistenza densa e compatta e staccarsi dai bordi del tegame. Lasciate ora intiepidire affinché si compatti.",
    "Quando sarà a temperatura ambiente prendetene circa 65 g e con le mani leggermente inumidite e create 1 piccola sfera. Ripetete l’operazione fino a finire tutto l’impasto: otterrete 8 canederli.",
    "Disponete i canederli ben distanziati tra loro su un vassoio foderato con carta forno affinché non si attacchino. Portate ora a bollore un tegame capiente con abbondante acqua salata e quando avrà raggiunto il bollore tuffate 4-5 canederli alal volta: li vedrete cadere sul fondo del tegame. Appena riaffioreranno in superficie saranno pronti: aiutandovi con una schiumarola scolateli.",
    "Cuocete anche i restanti, poi prendete i piatti da portata per i canederli di semolino e versate del brodo di carne. Quindi con la schiumarola trasferite in ciascun piatto circa 2-3 canederli per porzione. Spolverate con il formaggio e gustate i vostri canederli di semolino ancora caldi."
  ],
  "ingredients": [
    "0",
    "100g semolino",
    "500g latte intero fresco",
    "1 uova media",
    "20g burro",
    "sale fino q.b.",
    "noce moscata q.b.",
    "1l brodo di carne",
    "10g parmigiano reggiano"
  ],
  "__v": 3
}