{
  "hash": "cbecbfec2ebaa9a5be10c5c007ed346c5ac18763",
  "title": "egyszerű, de tökéletes diótorta",
  "image": "",
  "href": "http://divany.hu/alapkonyha/2016/10/16/sutiiskola_egyszeru_de_tokeletes_diotorta/",
  "extension": "Chrome",
  "firstAdded": "2016-11-01T11:55:48.750000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "A piskótához a tojásokat kettéválasztjuk.",
    "A cukor egyharmadával habosra keverjük a sárgákat, a fehérjéket pedig kemény habbá verjük a maradék cukorral.",
    "A fehérjehabot két részletben, óvatosan a kihabosított tojássárgákhoz forgatjuk.",
    "Beleszitáljuk a lisztet, beleöntjük a darált diót, és óvatosan beleforgatjuk.",
    "Egy 18 cm-es kapcsos tortaforma alját sütőpapírral béleljük, az oldalát pedig vajjal kikenjük. Beleöntjük a piskótatésztát, és 180°C-ra előmelegített sütőben aranybarnára sütjük.",
    "Még forrón kivágjuk a tortaformából, és egy sütőpapírra borítjuk ki fejjel lefelé, hogy ne legyen púpos a teteje. Hagyjuk kihűlni.",
    "A krémhez a cukrot és a pudingport a tejjel csomómentesre keverjük, majd megfőzzük a pudingot. A tetejére még forrón folpackot terítünk, hogy ne bőrösödjön be, majd hagyjuk szobahőmérsékletűre hűlni.",
    "A puha vajat kihabosítjuk, majd a szobahőmérsékletű pudinghoz keverjük. Hozzákeverjük a darált diót és a rumot is.",
    "A piskótát fűrészes késsel három lapba vágjuk. Betöltjük a diós krémmel, majd kívülről is bekenjük a krémmel. A díszítéshez félreteszünk két-három evőkanálnyit a krémből.",
    "A torta oldalát darált dióval panírozzuk. A félretett krémet habzsákba töltjük, és rózsákat nyomunk körben a tortára.",
    "A krémrózsákra egy-egy fél diószemet teszünk. Két-három órát hűtjük tálalás előtt a tortát."
  ],
  "ingredients": [
    "0",
    "Piskóta:",
    "3 tojás",
    "60 g cukor",
    "40 g liszt",
    "20 g darált dió",
    "Krém:",
    "2,8 dl tej",
    "40 g vaníliás pudingpor",
    "100 g cukor",
    "250 g puha vaj",
    "100 g darált dió",
    "1 ek. rum",
    "díszítéshez:",
    "fél diószemek és egy kevés darált dió"
  ],
  "__v": 2
}