{
  "hash": "cc68bab1f93ad29d648994e5d1637b9971c7694a",
  "title": "no bake s’mores cheesecakes",
  "image": "http://www.howsweeteats.com/wp-content/uploads/2013/07/smorescc-2-2.jpg",
  "href": "http://www.howsweeteats.com/2013/08/no-bake-smores-cheesecakes/",
  "extension": "Chrome",
  "firstAdded": "2016-06-22T21:45:44",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "directions:",
    "In a small bowl, mix together butter and graham crumbs until moistened. Press crumbs into the container of your choice (jar, ramekin, etc) with the back of a spoon. Place the chocolate in a bowl. Add the heavy cream to a small saucepan and heat over medium heat until warm, just until bubbles appear on the edges. Pour the cream over the chocolate and let it sit for 30 seconds, then stir constantly until the chocolate is all melted and a smooth ganache comes together. Add about a teaspoon of the ganache on top of each graham crust.",
    "In the bowl of your electric mixer, beat the cream cheese on medium speed until creamy. Add in the marshmallow fluff and beat until combined, then with the mixer on low speed, pour in the milk and vanilla extract. Beat on high speed until a smooth batter forms. Pour the batter on top of the chocolate ganache, leaving space on top for more chocolate and marshmallow.",
    "Add another teaspoon of ganache on top of the cheesecake and a sprinkle of graham crumbs if you wish, then refrigerate for 4 to 6 hours. When ready to serve, add a tablespoon or so of marshmallow fluff on top of the ganache, then top with a toasted marshmallow. Sprinkle extra graham crumbs on top and serve!"
  ],
  "ingredients": [
    "0",
    "ingredients:",
    "crust & topping",
    "4 tablespoons unsalted butter, melted",
    "2/3 cup graham cracker crumbs",
    "1/2 cup marshmallow fluff or cream",
    "4 marshmallows, toasted and cut in half",
    "chocolate ganache",
    "4 ounces milk chocolate, chopped",
    "3 tablespoons heavy cream",
    "marshmallow cheesecake",
    "1/2 cup whipped cream cheese, at room temperature",
    "1/2 cup marshmallow fluff or cream",
    "1/3 cup sweetened condensed milk",
    "2 teaspoons vanilla extract"
  ],
  "__v": 1
}