{
  "hash": "699800983517a52d3cde96b0351c21e324f191a5",
  "title": "Summer Celebration Fruit Tart",
  "image": "",
  "href": "http://www.mynewroots.org/site/2015/07/summer-celebration-tart/",
  "extension": "",
  "firstAdded": "2015-11-25T22:49:40.926000",
  "users": [
    null
  ],
  "keywords": [
    "summer",
    "celebration",
    "fruit",
    "tart",
    "serves",
    "sunflower",
    "buckwheat",
    "crust",
    "seeds",
    "flour",
    "salt",
    "zest",
    "lemon",
    "coconut",
    "oil",
    "cold",
    "maple",
    "syrup",
    "ice",
    "water",
    "needed",
    "greekstyle",
    "plain",
    "yogurt",
    "preferably",
    "goat",
    "sheeps",
    "milk",
    "vanilla",
    "bean",
    "honey",
    "seasonal",
    "chose",
    "cherries",
    "strawberries",
    "red",
    "currants",
    "gooseberries",
    "herbs",
    "used",
    "mint",
    "balm"
  ],
  "directions": [
    "0",
    "Directions:",
    "1. Preheat oven to 375°F / 190°C.",
    "2. In a dry skillet over medium heat toast sunflower seeds, tossing frequently, until fragrant and golden, 3-5 minutes. Remove from heat and let cool. Place seeds in a food processor and pulse until they resemble sand. Next add the remaining crust ingredients, except the ice water. Pulse to bring everything together and incorporate the oil. With the motor running, dribble in the water, one tablespoon at a time until the dough is no longer crumbly – do not add more than you need.",
    "3. Empty the dough onto a large piece of parchment paper. Gather it into a rough ball, then place a sheet of parchment paper on top and using a rolling pin roll out into a circle about 12” / 30cm in diameter. Slide crust onto a baking sheet and place in the oven to bake until golden, about 20-25 minutes. Remove from oven and let cool completely.",
    "4. While the crust is baking, combine the yogurt, vanilla seeds, and maple syrup. Set aside. Wash all fruit and slice if desired.",
    "5. Assemble tart right before serving (otherwise the crust will get soggy) Spread yogurt onto the crust, and top with fruit. Garni"
  ],
  "ingredients": [
    "0",
    "Summer Celebration Fruit Tart",
    "Serves 4-6",
    "Sunflower Buckwheat Crust",
    "Ingredients:",
    "1/3 cup / 45g sunflower seeds",
    "1 cup / 160g buckwheat flour",
    "pinch sea salt",
    "zest of 1 lemon",
    "3 Tbsp. coconut oil, very cold",
    "1 ½ Tbsp. pure maple syrup",
    "1-3 Tbsp. ice water, as needed",
    "Topping:",
    "1 cup Greek-style, plain yogurt (preferably from goat or sheep’s milk)",
    "seeds from ½ vanilla bean",
    "1 Tbsp. pure maple syrup or honey",
    "a few handfuls of seasonal fresh fruit (I chose cherries, strawberries, red currants and gooseberries)",
    "fresh herbs (I used mint and lemon balm)"
  ],
  "__v": 1
}