{
  "__v": 1,
  "directions": [
    "0",
    "In a large skillet over medium high heat sauté the onion, cabbage, carrot, and apple with a pinch of salt until softened and any liquid has evaporated. Add in the kale, in batches if necessary, and cook until wilted and any additional liquid evaporates. Stir in the green onions, garlic, and ginger (however much you’d like) and cook an additional minute. Taste the mixture for seasoning and add more salt if needed. Remove the vegetable mixture to a large bowl and set aside to cool completely.",
    "Once the vegetables are completely cooled stir in the ground pork and the egg white to combine. I like to use my (clean) hands to do this. I call it the “claw-method” and I stir the mixture rapidly with my scary-claw hand in one direction until all of the ingredients are evenly distributed. I find this method also helps with keeping the filling from getting crumbly.",
    "Pour some water into a small dish and set out your dumpling skins. You may want to cover the dumplings with a slightly damp tea towel to keep them from drying out while you form and pleat. Scoop small spoonfuls of the vegetable-pork mixture into the center of the dumpling wrapper, lightly wet the edges with water, fold into a half moon and pleat (or just press to seal, whatever works). Repeat with remaining dumpling skins and filling.",
    "To cook dumplings, add about 1 tablespoon of oil (or butter, melted) to a large nonstick skillet with a lid and arrange dumplings in an even layer. Add a scant 1/4 cup of water to the skillet and cook over medium-high heat with the lid on until the dumpling skins become a bit translucent, the water has evaporated, and the bottoms of the dumplings are golden. Remove from the heat and place a plate over the pan and flip out the dumplings in one fell swoop…or just remove them from the pan individually and set on a plate. I like to serve these simply with sriracha.",
    "To freeze, place the uncooked dumplings onto a parchment-lined sheet pan in an even layer and freeze until frozen solid—a few hours. Remove the frozen dumplings from the freezer and place in a gallon-size freezer bag and place back in the freezer. Cook the same way as you would fresh dumplings with just a bit more water few more minutes of cooking time."
  ],
  "firstAdded": "2014-06-19T12:25:27.474000",
  "hash": "229ea710d7e909b2e7fe6b62ddb918a97d67cd0a",
  "href": "http://www.hungrygirlporvida.com/blog/2013/11/05/kale-apple-pork-potstickers/",
  "image": "http://farm4.staticflickr.com/3785/10692830343_7f3f701d9e_o.jpg",
  "ingredients": [
    "0",
    "1 cup finely chopped onion",
    "2 cups finely chopped cabbage",
    "1/4 cup shredded carrot",
    "1 cup shredded apple (I used a honeycrisp)",
    "4 cups finely chopped kale",
    "1/2 cup sliced green onions",
    "2 cloves finely minced garlic",
    "2-4 teaspoons grated ginger root",
    "1/2 pound ground pork",
    "1 egg white",
    "salt",
    "40-60 round dumpling skins",
    "water for sealing"
  ],
  "keywords": [
    "onion",
    "cabbage",
    "carrot",
    "apple",
    "used",
    "honeycrisp",
    "kale",
    "green",
    "onions",
    "garlic",
    "ginger",
    "root",
    "pork",
    "egg",
    "white",
    "salt",
    "round",
    "dumpling",
    "skins",
    "water",
    "sealing"
  ],
  "title": "Pork, Kale, and Apple Potstickers",
  "users": [
    null
  ]
}