{
  "hash": "1e99b20ee206dc477110f09b0630d6c5a6af8c48",
  "title": "10-Spice Vegetable Soup (Freezer Friendly, Vegan, Gluten-Free)",
  "image": "http://cdn.ohsheglows.com/wp-content/uploads/2014/09/065A8717.jpg",
  "href": "http://ohsheglows.com/2014/10/02/10-spice-vegetable-soup-freezer-friendly-vegan-gluten-free/",
  "extension": "Chrome",
  "firstAdded": "2016-02-15T21:07:21.158000",
  "users": [
    null
  ],
  "keywords": [
    "soup",
    "raw",
    "cashews",
    "soaked",
    "broth",
    "divided",
    "extravirgin",
    "olive",
    "oil",
    "garlic",
    "yellow",
    "onion",
    "medium",
    "carrots",
    "heaping",
    "bell",
    "jarred",
    "roasted",
    "red",
    "pepper",
    "regular",
    "potato",
    "butternut",
    "squash",
    "stalks",
    "celery",
    "ounceml",
    "tomatoes",
    "juices",
    "spice",
    "blend",
    "finegrain",
    "salt",
    "black",
    "baby",
    "spinach",
    "destemmed",
    "torn",
    "kale",
    "leaves",
    "chickpeas",
    "beans",
    "rinsed",
    "makes",
    "smoked",
    "paprika",
    "oregano",
    "basil",
    "thyme",
    "white",
    "cayenne"
  ],
  "directions": [
    "0",
    "Directions:",
    "Place cashews in a bowl and add enough water to cover. Soak the cashews overnight, or for at least 2 hours. Drain and rinse the cashews.",
    "In a blender, combine the soaked and drained cashews with 1 cup of vegetable broth and blend on the highest speed until smooth. Set aside.",
    "In a large pot, heat the oil over medium heat. Add the garlic and onion and sauté for 3 to 5 minutes, or until the onion is translucent. Season generously with Herbamare or sea salt.",
    "Add the carrots, bell pepper, potato, celery, and diced tomatoes with their juices, the remaining 5 cups broth, and 10-spice blend. Stir well to combine . Bring the mixture to a boil and then reduce the heat to medium-low. Season with salt and black pepper and add the bay leaves.",
    "Simmer the soup, uncovered, for at least 20 minutes, stirring occasionally, until the vegetables are tender. Season with salt and black pepper. During the last 5 minutes of cooking, stir in the cashew cream, spinach (or kale), and drained beans. Add more 10-spice mix, to taste.",
    "To freeze, ladle the soup into containers (leaving 1-inch for expansion), cool completely, secure lid and place in the freezer for up to 6 weeks.",
    "Tips:",
    "1) If you don’t wish to make the 10-Spice Blend, feel free to use your favorite store-bought Cajun or Creole seasoning mix and add to taste. 2) You will have leftover spice blend. Store it in a container and keep it handy anytime you want to spice up a dish! It's great for pasta, soup, tofu seasoning, stir-fry, and more. 3) When thawed, this soup's broth looks a bit grainy, but rest assured when it's heated up again it will return to its former smoothness."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "For the soup:",
    "3/4 cup raw cashews, soaked",
    "6 cups vegetable broth, divided",
    "1 tablespoon extra-virgin olive oil",
    "3 large cloves garlic, minced",
    "1 sweet or yellow onion, diced (2 cups)",
    "3 medium carrots, peeled and chopped (1 heaping cup)",
    "1 red bell pepper or 1 cup jarred roasted red pepper, chopped",
    "1 1/2 cups peeled and chopped sweet potato, regular potato, or butternut squash",
    "2 stalks celery, chopped (1 heaping cup)",
    "1 (28-ounce/796-mL) can diced tomatoes, with their juices",
    "1 to 2 tablespoons Homemade 10-Spice Blend, to taste",
    "Fine-grain sea salt and freshly ground black pepper, to taste",
    "2 to 3 cups baby spinach or destemmed torn kale leaves",
    "1 (15-ounce) can chickpeas or other beans, drained and rinsed",
    "Homemade 10-Spice Blend (makes 1/2 cup):",
    "2 tablespoons smoked paprika",
    "1 tablespoon garlic powder",
    "1 tablespoon dried oregano",
    "1 tablespoon onion powder",
    "1 tablespoon dried basil",
    "2 teaspoons dried thyme",
    "1 1/2 teaspoons freshly ground black pepper",
    "1 1/2 teaspoons fine grain sea salt",
    "1 teaspoon white pepper (optional)",
    "1 teaspoon cayenne pepper"
  ],
  "__v": 1
}