{
  "hash": "6ffc1f3d38a8e3e6be4c5f94d38c41b42159b292",
  "title": "BANH XEO",
  "image": "http://www.sainsburysmagazine.co.uk/cache/com_zoo/images/CREPES%20WITH%20PORK%20AND%20PRAWNS_109258_560_730_9e4e144d7a16ddcd3817d8005a5eec2e.jpg",
  "href": "http://www.uyenluu.com/recipe/banh-xeo-sainsburys-magazine-adaptation/",
  "firstAdded": "2015-01-20T21:51:13.794000",
  "users": [
    null
  ],
  "keywords": [
    "dipping",
    "garlic",
    "clove",
    "bird",
    "eye",
    "chilli",
    "cider",
    "vinegar",
    "thai",
    "fish",
    "sugar",
    "crepes",
    "rice",
    "flour",
    "turmeric",
    "coconut",
    "milk",
    "spring",
    "onion",
    "salt",
    "oil",
    "shallots",
    "boneless",
    "pork",
    "loin",
    "steaks",
    "fat",
    "trimmed",
    "raw",
    "king",
    "prawns",
    "beansprouts",
    "serve",
    "youngleaf",
    "salad",
    "onions",
    "short",
    "lengths",
    "coriander",
    "basil",
    "mint",
    "leaves",
    "torn"
  ],
  "directions": [
    "0",
    "STEP BY STEP",
    "1For the crepes, whisk together the flour, turmeric, coconut milk, 300ml water, spring onions, salt and sugar in a bowl, making sure it’s smooth and free of lumps. Set aside to stand for 20 minutes, then whisk briefly before cooking.",
    "2Meanwhile, for the dipping sauce, mix together the garlic, chilli and vinegar in a bowl. Set aside for 2 minutes. This ‘cooks’ the garlic. Now add the fish sauce, sugar and 100ml water.",
    "This is a Vietnamese street food favourite – a light savoury crepe made with rice flour and coconut milk, served with plenty of salad leaves and herbs. This recipe makes about 8 crepes so you can serve 2 each as a starter",
    "3Heat 1 teaspoon oil in a small, nonstick, lidded, heavy-based frying pan (about 16cm base diameter) over a high heat until hot. Fry 1 heaped teaspoon of the chopped shallots for 10-20 seconds until browned. Using a shallow ladle, pour in a thin layer of the crepe batter (about 80ml), reduce the heat to medium-low and cover with a lid. Cook for 3 minutes, uncover and cook for a further 2-3 minutes until the crepe is crispy and golden. Set aside on a tray and keep warm. Repeat this whole process with the remaining shallots and batter to make 8 crepes in total.",
    "4Heat the remaining oil in a large frying pan or wok, season the pork and prawns with salt and pepper, and cook for 5 minutes until cooked through, adding the beansprouts for the final minute. Transfer to a plate.",
    "5To eat, add the pork and prawn mix and some salad, onions and herbs to the crepes, roll up and eat with the sauce.",
    "Recipe adapted from My Vietnamese Kitchen by Uyen Luu (Ryland Peters & Small, £16.99). Recipe photograph by Karen Thomas"
  ],
  "ingredients": [
    "0",
    "FOR THE DIPPING SAUCE:",
    "1 garlic clove, finely chopped",
    "1 bird eye chilli, finely chopped",
    "½ tbsp cider vinegar",
    "2 tbsp Thai fish sauce",
    "2 tsp sugar",
    "FOR THE CREPES:",
    "150g rice flour",
    "1½ tsp ground turmeric",
    "300ml coconut milk",
    "1 spring onion, thinly sliced",
    "a pinch of sea salt",
    "a pinch of sugar",
    "4 tbsp vegetable oil",
    "3 shallots, finely chopped",
    "200g boneless pork loin steaks, fat trimmed and thinly sliced",
    "300g raw king prawns",
    "150g beansprouts",
    "TO SERVE:",
    "75g young-leaf salad",
    "3 spring onions, cut into short lengths",
    "a handful each of coriander, basil and mint leaves, torn"
  ],
  "__v": 1
}