{
  "hash": "d5fc87f384075acf76f1c129c2a4339f536a312d",
  "title": "Grilled Lamb with Rosemary Potato Skewers",
  "image": "http://ab.wsimgs.com/wsimgs/ab/images/dp/recipe/201536/0045/img52l.jpg",
  "href": "http://www.williams-sonoma.com/recipe/grilled-lamb-with-rosemary-potato-skewers.html",
  "extension": "Chrome",
  "firstAdded": "2015-11-09T09:42:33.230000",
  "users": [
    null
  ],
  "keywords": [
    "tbs",
    "kosher",
    "salt",
    "red",
    "pepper",
    "black",
    "rosemary",
    "thyme",
    "garlic",
    "olive",
    "oil",
    "dijon",
    "mustard",
    "butterflied",
    "leg",
    "lamb",
    "fingerling",
    "potatoes",
    "sprigs",
    "long",
    "leaves",
    "tips"
  ],
  "directions": [
    "0",
    "In a large bowl, stir together 2 Tbs. of the salt, the red pepper flakes, 1/2 tsp. of the black pepper, the chopped rosemary, thyme, garlic, 1/4 cup of the olive oil and the mustard. Coat the lamb on both sides with the mixture. Cover and refrigerate for 5 to 6 hours.",
    "In a large pot of salted boiling water, cook the potatoes until tender, 5 to 7 minutes. Drain and let cool.",
    "Skewer the potatoes onto the rosemary sprigs. Rub the potatoes with the remaining 1/4 cup olive oil. Season with the remaining 1 Tbs. salt and 1 tsp. black pepper.",
    "Prepare a medium-hot fire in a grill.",
    "Place the lamb on the center of the grill rack, close the lid and grill for 10 minutes. Turn the lamb over and arrange the potato skewers on the grill. Close the lid and cook, turning the potatoes occasionally, until an instant-read thermometer inserted into the center of the lamb registers 130° to 135°F for medium-rare to medium, 10 to 15 minutes more.",
    "Transfer the lamb to a cutting board, cover loosely with aluminum foil and let rest for 5 to 10 minutes. Place the potato skewers on a warmed platter. Cut the lamb into thin slices and arrange on the platter alongside the potatoes. Serves"
  ],
  "ingredients": [
    "0",
    "3 Tbs. kosher salt",
    "1/4 tsp. red pepper flakes",
    "1 1/2 tsp. freshly ground black pepper",
    "1 tsp. finely chopped fresh rosemary",
    "1 1/2 tsp. finely chopped fresh thyme",
    "2 Tbs. minced garlic",
    "1/2 cup olive oil",
    "2 tsp. Dijon mustard",
    "1 butterflied leg of lamb, 2 1/2 to 3 lb.",
    "4 lb. fingerling potatoes",
    "10 rosemary sprigs, each about 8 inches long, leaves removed except at tips"
  ],
  "__v": 1
}