{
  "hash": "5eaf3dd209e4b099ecb1db944b080311b1956453",
  "title": "Probiotic pickled onion recipe - lacto-fermentation",
  "image": "",
  "href": "http://padaek.com/probiotic-pickled-onion-recipe-lacto-fermentation/",
  "extension": "",
  "firstAdded": "2015-09-20T15:53:46.910000",
  "users": [
    null
  ],
  "keywords": [
    "pickling",
    "onions",
    "salt",
    "solution",
    "litres",
    "water",
    "raw",
    "sugar",
    "star",
    "anise",
    "bay",
    "leaves",
    "allspice",
    "black",
    "peppercorn",
    "yellow",
    "mustard",
    "seeds",
    "bullet",
    "chilies",
    "garlic"
  ],
  "directions": [
    "0",
    "Top and tail the onions and then peel them.",
    "Place the onions in a large mixing bowl and sprinkle 2 Tbsp of sea salt over them. Mix through and let rest in the fridge for 3 hours.",
    "In a saucepan, add 2 Litres of water, 5.5 Tbsp of salt, raw sugar, star anise, bay leaves, allspice, black peppercorn, yellow mustard seeds, halved chilies and minced garlic.",
    "Bring the heat to medium and let the mixture simmer for a couple of minutes. Stir gently. When the salt and sugar are dissolved, turn off the heat and let the mixture cool down.",
    "After three hours, wash the onions in cold water, drain and let dry.",
    "In a sterilized glass jar, place half of the onions and half of the pickling spices from the mixture.",
    "Add the remaining onions.",
    "Carefully pour in the pickling solution and pickling spices from the saucepan.",
    "Make sure the onions are fully submerged under the brine by placing some scrunched up baking paper on top of the onions.",
    "Replace the lid on the jar and tightly seal.",
    "Keep safe in a kitchen cupboard and let culture at room temperature for 3 to 7 days. Let the jar burp daily as needed to release gas pressure.",
    "When the desired fermentation has been reached, move the jar to the fridge to slow and stall further fermentation while consumed. Bon appetit! :)"
  ],
  "ingredients": [
    "0",
    "1.5 kg of pickling onions",
    "2 Tbsp of sea salt",
    "Pickling Solution:",
    "2 Litres of water",
    "5.5 Tbsp of sea salt",
    "2 Tbsp of raw sugar",
    "3 star anise",
    "5 bay leaves",
    "1 Tbsp of allspice",
    "1 Tbsp of black peppercorn",
    "1 Tbsp of yellow mustard seeds",
    "2 fresh bullet chilies (halved)",
    "2 cloves of garlic (minced)"
  ],
  "__v": 1
}