{
  "hash": "97be2b419f102015a93fde74d79acc6b08b1c060",
  "title": "CHURROS",
  "image": "https://fbcdn-sphotos-d-a.akamaihd.net/hphotos-ak-xap1/v/t1.0-9/12508823_528081174037347_6793948614081639024_n.jpg?oh=fdb41067e905933c19e639cc07bd864b&oe=5726A4BE&__gda__=1462138722_8fec0ded7925c56811ce1ea648c3990a",
  "href": "https://www.facebook.com/EatTreatOnline/photos/a.443490132496452.1073741828.439906856188113/528080234037441/?type=3&theater",
  "extension": "Chrome",
  "firstAdded": "2016-01-28T16:04:17.455000",
  "users": [
    null
  ],
  "keywords": [
    "boiling",
    "water",
    "vanilla",
    "unsalted",
    "buttermelted",
    "plain",
    "flour",
    "baking",
    "salt",
    "litre",
    "oil",
    "caster",
    "sugar",
    "mixed",
    "cinnamon",
    "dipping",
    "milk",
    "cream",
    "nutella",
    "cocoa"
  ],
  "directions": [
    "0",
    "Pour the boiling water into a jug. Add in the vanilla extract along with the melted butter and mix well.",
    "Sieve the flour into a large bowl and add the baking powder and salt. Create a well in the centre and pour the water-butter mixture into this. Quickly beat this mixture into the flour until there are no lumps left. Set aside for 45-60 minutes, before filling the rested dough into a piping bag with a star nozzle.",
    "Fill a heavy-bottom pan with a litre of oil. Once the temperature is over 220 degrees Celsius (use a kitchen thermometer), pipe out one strip of batter (4-5 inches long) at a time, snipping off each strip with the help of kitchen scissors. Fry until golden brown and crisp on the outside; this should take about a minute. With a slotted spoon, transfer directly to a tray filled with the cinnamon sugar to coat.",
    "FOR THE DIPPING SAUCE",
    "In a saucepan, pour in the milk, add the cream, and boil on medium heat. Once bubbles appear on the side of the pan, whisk in the Nutella and cocoa powder. Turn off the heat immediately. Transfer to a bowl and serve with the churros."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "350 ml boiling water 1 teaspoon vanilla extract 50 grams unsalted butter,melted 250 grams plain flour 1½ teaspoons baking powder 1 teaspoon salt 1 litre vegetable oil 100 grams caster sugar mixed with 2 tablespoons cinnamon",
    "For the dipping sauce",
    "½ cup milk 1 tablespoon heavy cream 3 tablespoons Nutella 50 grams cocoa powder"
  ],
  "__v": 1
}