{
  "hash": "8b044bdcb271d12dd4671ce138955186e890222b",
  "title": "CRACKLIN’ CHICKEN",
  "image": "http://38.media.tumblr.com/2b1df4f79686e42f87dd70698431f1f0/tumblr_inline_mzsez7fVRq1qdei8m.jpg",
  "href": "http://nomnompaleo.com/post/74180911762/cracklin-chicken",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T22:37:04.581000",
  "users": [
    null
  ],
  "keywords": [
    "bonein",
    "skinon",
    "chicken",
    "thighs"
  ],
  "directions": [
    "0",
    "Grab some chicken thighs and a sharp pair of kitchen shears.",
    "Blot the chicken dry with a paper towel.",
    "Starting at one end, carefully cut out the bone, making sure you don’t cut through the meat. Stay as close to the bone as possible.",
    "When you get to the other end, trim around the joint and cartilage and remove the bone.",
    "Voilà!",
    "Keep a container handy to save the bones for bone broth. Your mom will high-five you for being frugal. (Or, if you have my mom, she’ll fist bump you. Okay, not really. She’ll just nod approvingly after you’ve turned away.)",
    "If extra skin or fat is flapping around and hanging off the thighs, you can trim it off as well. But don’t cut too much away, because the skin will shrink when you fry it.",
    "Believe me: You don’t want to skimp out on the cracklins’.",
    "Flatten the chicken with a meat pounder (or cut a gash in the thickest part of each thigh piece with your scissors) to ensure uniform cooking.",
    "Turn the chicken skin-side-up, and sprinkle salt on the skin from way up high, like it’s snowing. That way, the skin will be seasoned evenly. (Don’t believe me? Listen to Thomas Keller then. Did you know that he allegedly flirted with Paleo while on his Bouchon Bakery book tour? And did you know that I started that rumor?)",
    "Heat a large cast iron skillet over medium high heat.",
    "Melt the ghee in the pan and place four chicken thighs skin-side down in the hot pan.",
    "Season the meat side with your favorite seasoning blend (I’m a fan of using my own special Magic Mushroom Powder, a recipe available in our cookbook and iPad app.) If your seasoning blend of choice doesn’t include salt, you may want to add a bit more kosher salt to the chicken.",
    "Let the skin fry undisturbed until crispy and golden brown (around 7-10 minutes), rotating the pan 90 degrees at the halfway point to make sure the heat from the burner is uniformly distributed.",
    "Pro tip: Cover the pan with a splatter guard to keep your stove (relatively) clean. (This is the one I have, but cheaper ones are available, too—just make sure you get one that’s stainless steel.) Otherwise, line your floor in front of the stove with towels, or the deliciousness of Cracklin’ Chicken will come with a slick, oil-splattered price!",
    "Flip the chicken and cook for 3 more minutes or until cooked through.",
    "Transfer the chicken to a wire rack and rest ’em for 5 minutes.",
    "Repeat the steps above with the four remaining thighs.",
    "When you’re ready to eat, slice them up and dig in!"
  ],
  "ingredients": [
    "0",
    "8 bone-in, skin-on chicken thighs (approximately 4 pounds)"
  ],
  "__v": 1
}