{
  "hash": "81b6811d2ec4609bb154d507466f0bb0bf3f1cfc",
  "title": "Tenderloin Beef Roast",
  "image": "",
  "href": "http://www.tastingtable.com/entry_detail/national/18547/recipes_home/How_to_Make_Tenderloin_Beef_Roast.htm",
  "firstAdded": "2014-12-19T21:04:36.445000",
  "users": [
    null
  ],
  "keywords": [
    "centercut",
    "beef",
    "tenderloin",
    "trimmed",
    "tied",
    "intervals",
    "sprigs",
    "thyme",
    "rosemary",
    "leaves",
    "garlic",
    "kosher",
    "salt",
    "coarsely",
    "black",
    "pepper",
    "horseradish",
    "shavings",
    "peeler",
    "sour",
    "cream",
    "crme",
    "frache",
    "chives",
    "worcestershire",
    "lemon",
    "zest"
  ],
  "directions": [
    "0",
    "Preheat the oven to 275° and adjust the oven rack to the middle position. Remove the roast from the fridge and place on a clean work surface; pat dry. Rub the roast with the thyme sprigs, rosemary leaves and garlic and season generously with salt. Wrap the roast in plastic wrap and allow to rest at room temperature for 1 hour.",
    "Remove the thyme, rosemary and garlic from the meat; pat dry and sprinkle the roast evenly with black pepper. Transfer the roast to a wire rack set on a parchment-lined sheet tray. Roast the tenderloin until an instant-read thermometer inserted into the thickest part of the tenderloin registers 120°, 1 hour and 10 minutes to 1 hour and 20 minutes, flipping halfway through roasting.",
    "Turn on the broiler and place the roast on the upper rack of the oven and broil, flipping the meat until brown until the internal temperature reaches 125° for rare or 130° for medium-rare, 2 to 3 minutes. Remove from the the oven and let the roast rest for 20 minutes before carving.",
    "Meanwhile, make the cream sauce: In a small bowl, combine the sour cream, chives, worcestershire and lemon zest, and season with salt.",
    "Serve the tenderloin with the sauce and shaved fresh horseradish."
  ],
  "ingredients": [
    "0",
    "One 3-pound center-cut beef tenderloin, trimmed and tied at 1½-inch intervals",
    "6 sprigs thyme",
    "4 sprigs rosemary, leaves removed",
    "3 large garlic cloves, thinly sliced",
    "Kosher salt and coarsely ground black pepper, to taste",
    "Fresh horseradish, sliced into thin shavings with a vegetable peeler, to top",
    "1 cup sour cream or crème fraîche",
    "1 tablespoon finely chopped chives",
    "1 teaspoon worcestershire sauce",
    "1 teaspoon lemon zest",
    "Kosher salt, to taste"
  ],
  "__v": 1
}