{
  "hash": "0cf65cd40f91153d19230330af02e23e4a792b0f",
  "title": "Dark Chocolate Macaroon Thumbprint Cookies",
  "image": "http://gourmandeinthekitchen.com/wp-content/uploads/2014/12/Dark-Chocolate-Macaroon-Thumbprint-Cookie-Recipe.jpg?c3c4ca",
  "href": "http://gourmandeinthekitchen.com/2014/dark-chocolate-macaroon-thumbprint-cookies/",
  "firstAdded": "2015-01-06T14:37:26.275000",
  "users": [
    null
  ],
  "keywords": [
    "ouncesg",
    "bittersweet",
    "chocolate",
    "cupg",
    "coconut",
    "sugar",
    "cupml",
    "milk",
    "vanilla",
    "cupsg",
    "salt",
    "tablespoonml",
    "oil"
  ],
  "directions": [
    "0",
    "Pre-heat oven to 350° F. Line a baking sheet with parchment paper.",
    "In a medium heat-proof bowl set over a saucepan of simmering water (making sure that the bottom of the bowl doesn’t touch the water) combine the chopped chocolate, coconut sugar, coconut milk, vanilla and a pinch of salt.",
    "Melt gently over very low-heat stirring constantly until fully melted and combined. Remove bowl from heat and stir in shredded coconut. Let sit for a minute or so to allow the mixture to hold its shape when scooped.",
    "Scoop up packed tablespoonfuls or use a small ice cream scoop to form small balls of the mixture and place onto the parchment-lined baking sheets about 1 inch apart. Press an indentation into the center of each cookie. (I used the back of a small melon baller. )",
    "Bake, rotating the baking sheets halfway through for 12-14 minutes. Transfer the baking sheet to a wire rack. Press the indentations in the center again to create a pocket for the filling and let cool completely.",
    "In the meantime, gently melt the remaining chopped chocolate and coconut oil in a bowl set over simmering water as before until just melted and smooth.",
    "When the cookies are completely cool, use a teaspoon to fill the indentations with the melted chocolate mixture.",
    "Let sit until firm or place in the fridge for a few minutes to speed up the process. Store the macaroons in an airtight container at room temperature."
  ],
  "ingredients": [
    "0",
    "4 ounces/113g bittersweet chocolate (at least 70%), finely chopped",
    "¼ cup/48g coconut sugar",
    "¼ cup/60ml coconut milk",
    "1 teaspoon vanilla extract",
    "1 ½ cups/120g unsweetened shredded coconut",
    "A pinch of sea salt",
    "3 ounces/84g bittersweet chocolate (at least 70%), finely chopped",
    "1 Tablespoon/15ml coconut oil"
  ],
  "__v": 1
}