{
  "hash": "8b0582c146defcefd007077a8af7f92eeea6a646",
  "title": "Key Lime Pie",
  "image": "https://res.cloudinary.com/hksqkdlah/image/upload/s--ndwGbASw--/c_scale,f_auto,h_344,q_jpegmini:1,w_344/26376_sfs-iceboxkeylimepie-3",
  "href": "https://www.americastestkitchen.com/recipes/1195-key-lime-pie",
  "extension": "",
  "firstAdded": "2017-07-14T01:10:30.061000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the Filling: Whisk zest and yolks in medium bowl until tinted light green, about 2 minutes. Beat in milk, then juice; set aside at room temperature to thicken.",
    "For the Crust: Adjust oven rack to center position and heat oven to 325 degrees. Mix crumbs and sugar in medium bowl. Add butter; stir with fork until well blended. Pour mixture into 9-inch pie pan; press crumbs over bottom and up sides of pan to form even crust. Bake until lightly browned and fragrant, about 15 minutes. Transfer pan to wire rack; cool to room temperature, about 20 minutes.",
    "Pour lime filling into crust; bake until center is set, yet wiggly when jiggled, 15 to 17 minutes. Return pie to wire rack; cool to room temperature. Refrigerate until well chilled, at least 3 hours. (Can be covered with lightly oiled or oil-sprayed plastic wrap laid directly on filling and refrigerated up to 1 day.)",
    "For the Whipped Cream: Up to 2 hours before serving, whip cream in medium bowl to very soft peaks. Adding confectioners’ sugar 1 tablespoon at a time, continue whipping to just-stiff peaks. Decoratively pipe whipped cream over filling or spread evenly with rubber spatula. Garnish with optional sugared lime slices and serve."
  ],
  "ingredients": [
    "0",
    "4\tteaspoons grated lime zest",
    "½\tcup lime juice from 3 to 4 limes",
    "4\tlarge egg yolks",
    "1\t(14-ounce) can sweetened condensed milk",
    "GRAHAM CRACKER CRUST",
    "11\tgraham crackers, processed to fine crumbs (1 1/4 cups)",
    "3\ttablespoons granulated sugar",
    "5\ttablespoons unsalted butter, melted",
    "WHIPPED CREAM TOPPING",
    "¾\tcup heavy cream",
    "¼\tcup confectioners' sugar",
    "½\tlime, sliced paper thin and dipped in sugar (optional)"
  ],
  "__v": 1
}