{
  "hash": "5fbffe58be84730c2dca7d79835ad3c7ab9ffe55",
  "title": "Bogracz z kluseczkami",
  "image": "//static.smaker.pl/photos//0/e/c/0ec4f0c7a35deb4ca19f2b9b90ed95fb_149248_53f90dc6017d2_wm.jpg",
  "href": "http://smaker.pl/przepis-bogracz-z-kluseczkami,108620,kurka-domowa.html",
  "extension": "",
  "firstAdded": "2016-09-17T20:49:47.377000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Mięso kroimy w kostkę, cebule i słoninę siekamy w kosteczkę. Paprykę kroimy w paseczki, pomidory sparzamy, obieramy, usuwamy gniazda nasienne i kroimy w niewielkie kawałki. Marchewkę kroimy w plasterki a pietruszkę w kosteczkę, czosnek przeciskamy przez praskę.",
    "Na gorącej patelni wytapiamy słoninę, następnie wrzucamy cebulę i smażymy do przyrumienienia. Zdejmujemy patelnię z ognia, dosypujemy słodka i ostrą sproszkowana paprykę, dokładnie mieszamy. Stawiamy patelnię z powrotem na ogniu i dokładamy mięso. Smażymy aż się przyrumieni ( często mieszamy ). Całość przekładamy do sporego garnka i podlewamy bulionem.",
    "Dodajemy marchewkę, pietruszkę, papryki, pomidory, czosnek i kminek. Dusimy pod przykryciem przez około godzinę ( do miękkości mięsa ). W tym czasie obieramy ziemniaki i kroimy je w kostkę, przygotowujemy też ciasto na kluski.",
    "Kiedy mięso będzie już miękkie dorzucamy ziemniaki i dusimy przez 30 minut, doprawiamy do smaku solą, pieprzem i wędzoną papryką. Na 10 minut przed końcem duszenia z ciasta formujemy podłużne kluseczki i wrzucamy je do dania. Kiedy kluski będą ugotowane bogracz jest gotowy do podania. U nas podaję do niego świeże bułeczki, ale równie dobrze smakuje jako samodzielne danie."
  ],
  "ingredients": [
    "0",
    "Przepyszne danie jednogarnkowe. Polecam na wszelkiego rodzaju imprezki, zwłaszcza te zakrapiane. W oryginalnym przepisie jest wołowina, ale ja użyłam szynki wieprzowej.",
    "Składniki",
    "1,5 kg szynki wieprzowej",
    "3 cebule",
    "4 papryki ( dwie czerwone i po jednej żółtej i zielonej )",
    "3 marchewki",
    "3 pietruszki",
    "5 pomidorów",
    "4-5 szt. średnich ziemniaków",
    "3-4 ząbki czosnku",
    "15 deko wędzonej słoniny",
    "Na kluseczki: niecała szklanka mąki + jajko + kilka łyżek wody",
    "1 szklanka bulionu",
    "Przyprawy: 2 łyżeczki słodkiej papryki, 2 łyżeczki wędzonej papryki, łyżeczka ostrej papryki, sól, pieprz, mielony kminek"
  ],
  "__v": 1
}