{
  "__v": 2,
  "directions": [
    "0",
    "To make the cooling yogurt sauce: Evenly whisk plain yogurt, creme fraiche, tahini sauce, grated garlic, ground black pepper and salt together. Refrigerate for at least 1 hour (or until needed) for the flavors to come together.",
    "To make the spicy lamb filling: Heat up 2 tbsp of unsalted butter + 1 tbsp of olive oil in a skillet over medium-high heat, then add the finely diced onion and 1/2 tsp of salt and cook until the onions are soft and lightly browned on the edges. Add the minced garlic, grated ginger and cook until fragrant, then add the ground cumin, ground allspice, ground coriander, ground cinnamon, chili flakes and chopped cilantro. Cook for 1 min, turn off the heat and let the mixture cool slightly.",
    "Add the onion mixture into a large bowl with ground lamb, cornstarch, another 1/2 tsp of salt, ground white pepper and black pepper. Mix just until combined and set aside.",
    "To make the lamb cigars: Beat 1 egg with 1 tbsp of water to make egg wash. Lightly dust the working surface with flours. Take 1 wonton wrapper and roll it so it expands at least 1/3 more in size. The wrapper should be extremely thin that you could see your fingers when lifting it off the surface. Smear approx 1 1/2 tsp of the lamb filling across the center of the wrapper, leaving about 1/2″ (1.5 cm) of space along the edges. Roll 1 corner of the wrapper towards the center and stop at 1/3 of the way, lightly brush the remaining edges with egg wash, tuck the 2 side-corners in then finish rolling the wrapper into a cigar. Dust with a bit more flour and set side.",
    "Repeat until you have about 15 cigars. Arrange the cigars on a floured plate without them touching each other, and leave it in the freezer to harden. As the first batch is freezing, finish making the rest of the cigars and freeze with the same instructions. Once the cigars have harden, transfer into a zip-lock bag and keep frozen until needed.",
    "To pan-fry the cigars: Add enough vegetable oil into a large, FLAT skillet until it reaches about 1/4″ deep. Heat up the oil on medium-high heat, then arrange the cigars in the skillet to LOOSELY FIT as many as you can. Fry the cigars, turning them frequently as you go, until golden browned and crispy on all sides. Serve with the cooling yogurt sauce.",
    "If you want to cook the cigars slightly earlier than needed, they can be re-heated and crisped up again in a 400ºF/200ºC oven."
  ],
  "firstAdded": "2014-06-19T15:03:03.649000",
  "hash": "818c1bd6286c95bb095a61b0d146a3893ae35ea7",
  "href": "http://www.ladyandpups.com/2013/12/13/highly-addictive-party-cigar-eng/",
  "image": "http://www.ladyandpups.com/wp-content/uploads/2013/12/lamb-cigar26.jpg",
  "ingredients": [
    "0",
    "35 ~ 40 sheets of white wonton wrappers",
    "1 egg wash",
    "Flour for dusting",
    "4 ~ 5 tbsp of vegetable oil for pan-frying",
    "Spicy lamb filling:",
    "2 tbsp of unsalted butter + 1 tbsp of olive oil",
    "1/2 of an onion, finely diced",
    "5 cloves of garlic, minced",
    "2 tbsp of grated ginger",
    "1 1/2 tsp of ground cumin",
    "1 1/2 tsp of ground allspice",
    "1 tsp of ground coriander",
    "1/2 tsp of ground cinnamon",
    "1 tsp of chili flakes",
    "2 tbsp of chopped cilantro (or parsley if preferred)",
    "17.6 oz (500 grams) of ground lamb",
    "1 1/2 tbsp of cornstarch",
    "1 tsp of salt",
    "1/4 tsp of ground white pepper, and ground black pepper each",
    "Cooling yogurt sauce:",
    "1/3 cup (85 grams) of plain yogurt",
    "3 tbsp (45 grams) of creme fraiche (or sour cream)",
    "2 tbsp (33 grams) of tahini sauce",
    "2 cloves of garlic, grated",
    "1/2 tsp of freshly ground black pepper",
    "1/4 tsp of salt to taste"
  ],
  "keywords": [
    "sheets",
    "white",
    "wonton",
    "wrappers",
    "egg",
    "wash",
    "flour",
    "dusting",
    "oil",
    "panfrying",
    "spicy",
    "lamb",
    "filling",
    "unsalted",
    "butter",
    "olive",
    "onion",
    "garlic",
    "ginger",
    "cumin",
    "allspice",
    "coriander",
    "cinnamon",
    "chili",
    "cilantro",
    "parsley",
    "preferred",
    "cornstarch",
    "salt",
    "black",
    "pepper",
    "cooling",
    "yogurt",
    "plain",
    "creme",
    "fraiche",
    "sour",
    "cream",
    "tahini"
  ],
  "title": "HIGHLY ADDICTIVE PARTY CIGARS",
  "users": [
    null
  ]
}