{
  "hash": "2a1e25390b6b92bda247e5c28b82b926a7657161",
  "title": "Recipe Notes:",
  "image": "http://atmedia.imgix.net/a374c5a7082701cc2e2c66043d287a5d30a9ffbc?auto=compress&w=640.0&fit=max",
  "href": "http://www.thekitchn.com/slow-cooker-recipe-curried-vegetable-and-chickpea-stew-67520",
  "extension": "Chrome",
  "firstAdded": "2017-02-22T18:45:59.130000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 teaspoon olive oil 1 large onion, diced 2 medium red or yellow potatoes, diced 1 tablespoon kosher salt 1 tablespoon curry powder 1 tablespoon brown sugar 1-inch piece ginger, peeled and grated (about 1 tablespoon) 3 garlic cloves, minced 1/8 teaspoon cayenne pepper, optional 2 cups vegetable broth 2 (15.5-ounce) cans chickpeas, drained and rinsed 1 green bell pepper, diced 1 red bell pepper, diced 1 medium head of cauliflower, cut into bite-sized florets 1 (28-ounce) can diced tomatoes with their juices 1/4 teaspoon black pepper 1 (10-ounce) bag baby spinach 1 cup coconut milk",
    "Heat the oil in a skillet over medium heat. Sauté the onion with one teaspoon of salt until translucent, about 5 minutes. Add the potatoes and another teaspoon of salt, and sauté until just translucent around the edges.",
    "Stir in the curry, brown sugar, ginger, garlic, and cayenne and cook until fragrant, about 30 seconds. Pour in 1/4 cup of broth and scrape up any toasty bits from the bottom of the pan. Transfer this onion-potato mixture into the bowl of a 6-quart or larger slow cooker. (Halve this recipe for a smaller slow cooker.)",
    "To the slow cooker, add the rest of the broth, chickpeas, bell pepper, cauliflower, tomatoes with their juices, pepper, and final teaspoon of salt. Stir to combine. The liquid should come about halfway up the sides of the bowl; add more broth as necessary. Cover and cook for 4 hours on HIGH.",
    "Stir in the spinach and coconut milk. Cover with lid for a few more minutes to allow the spinach to wilt. Taste and correct the salt and other seasonings as needed.",
    "Serve on its own or over couscous, Israeli couscous, or orzo pasta.",
    "This recipe was originally published October 2008."
  ],
  "ingredients": [
    "0",
    "1 teaspoon olive oil",
    "1 large onion, diced",
    "2 medium red or yellow potatoes, diced",
    "1 tablespoon kosher salt",
    "1 tablespoon curry powder",
    "1 tablespoon brown sugar",
    "1/8 teaspoon cayenne pepper, optional",
    "2 cups vegetable broth",
    "2 (15.5-ounce) cans chickpeas, drained and rinsed",
    "1 green bell pepper, diced",
    "1 red bell pepper, diced",
    "1 medium head of cauliflower, cut into bite-sized florets",
    "1 (28-ounce) can diced tomatoes with their juices",
    "1/4 teaspoon black pepper",
    "1 (10-ounce) bag baby spinach",
    "1 cup coconut milk"
  ],
  "__v": 1
}