{
  "hash": "10c2ff10f1680f8c324e5078e0a5c3d13049bb3d",
  "title": "lentil soup with sausage, chard and garlic",
  "image": "https://smittenkitchendotcom.files.wordpress.com/2013/01/lentil-soup-with-sausage-chard-and-garlic.jpg?w=750",
  "href": "https://smittenkitchen.com/2013/01/lentil-soup-with-sausage-chard-and-garlic/",
  "extension": "Firefox",
  "firstAdded": "2019-07-14T23:22:28.424000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "On the stove: Heat 1/4 cup olive oil (enough to generously coat bottom of pot) in a large pot on medium to medium-high heat. When hot, add the sausage, breaking it up with a wooden spoon until it starts to brown, about five minutes. Add the onion, celery, carrots, first two garlic cloves, a pinch of salt, and if you like your soup spicy, a pinch of red pepper flakes. Cook with the sausage until the vegetables soften a bit, another 5 minutes. Add the lentils, bay leaves, tomatoes, water (6 cups is, conveniently, a little less than 2 empty 28-ounce cans, so you can get any tomato pulp you missed), more salt and black pepper to taste. Bring to a simmer and allow to cook until the lentils are tender, about 40 minutes. (It might be necessary to add more water if the soup gets too thick, though we preferred ours on the thick side.)",
    "When the lentils are cooked, add the chard and cook until the leaves are tender, just a few minutes more. Discard the bay leaves.",
    "In an InstantPot or electric multicooker: Proceed as written above, using the sauté function on high (I find this to be like medium-high on a stove) to cook the sausage and then vegetables. Once you’ve added the remaining ingredients, including dried lentils, lock the lid and set to high pressure for 15 minutes. Let it naturally release for at least 10 minutes (or longer, if you have time), to help keep the vegetables intact. You can manually release the rest. Use the sauté function on high again to bring it back to a simmer (this should be take no time at all) and add the greens; cook until wilted.",
    "Both methods: To finish, divide soup among bowls, then add the remaining 1/4 cup olive oil and 2 garlic cloves to a small skillet (on the stove) and heat over medium until the garlic softens and hisses. Drizzle this over soup bowls, and top with fresh Romano, passing more at the table. Leftovers will keep for several days in the fridge.",
    "(You could probably do this in an empty multicooker pot too but it feels faster and more efficient to do it on the stove.)"
  ],
  "ingredients": [
    "0",
    "1/2 cup olive oil, divided",
    "2 large links (about 8 ounces) of sweet Italian sausage [see Note]",
    "1 medium onion, diced",
    "2 celery stalks, sliced or diced",
    "2 medium carrots, peeled and sliced into half-moons or diced",
    "4 cloves garlic, sliced (reserve half for later in recipe)",
    "Kosher salt",
    "A pinch of crushed red pepper flakes (optional)",
    "1 cup brown lentils, sorted and rinsed",
    "2 bay leaves",
    "1 28-ounce can crushed tomatoes",
    "6 cups water",
    "Freshly ground black pepper",
    "3 to 4 cups shredded or thinly ribboned Swiss chard leaves or kale",
    "Grated Pecorino Romano cheese to finish"
  ],
  "__v": 1
}