{
  "hash": "2a3c1ce6b4aced5ef2d6cfa1948cf9d15650c99e",
  "title": "Emeril's Fried Chicken and Buttermilk Waffles",
  "image": "http://a.abcnews.com/assets/images/font-sm_off2.gif",
  "href": "http://abcnews.go.com/GMA/recipe/emerils-fried-chicken-buttermilk-waffles-black-pepper-maple-16203096?nwltr=GMAR_featureMore",
  "firstAdded": "2015-02-27T21:58:45.113000",
  "users": [
    null
  ],
  "keywords": [
    "wellshaken",
    "buttermilk",
    "crystal",
    "louisiana",
    "red",
    "hot",
    "sugar",
    "salt",
    "paprika",
    "garlic",
    "smashed",
    "chicken",
    "pieces",
    "allpurpose",
    "flour",
    "oil",
    "frying",
    "waffles",
    "cake",
    "yellow",
    "cornmeal",
    "baking",
    "soda",
    "eggs",
    "vanilla",
    "butter",
    "bean",
    "unsalted",
    "room",
    "black",
    "pepper",
    "maple",
    "syrup",
    "gradea",
    "dark",
    "amber",
    "scraped",
    "pod",
    "making",
    "whipped"
  ],
  "directions": [
    "0",
    "In a small bowl, whisk together the buttermilk, hot sauce, sugar, the 1 tablespoon salt, and the paprika. Add the garlic. Transfer this mixture to a gallon-size resealable plastic food storage bag. Add the chicken pieces to the bag, seal, and refrigerate. Allow the chicken to marinate overnight, turning the bag occasionally to ensure that the chicken is evenly marinated.",
    "Place a wire rack on a baking sheet, and set it aside. In a medium-size bowl, combine the flour with the remaining 1 teaspoon salt.",
    "Remove the chicken pieces from the marinade, allowing the excess to drain off, and then dredge them in the flour. Set the coated pieces on the wire rack.",
    "Pour oil to a depth of 1 inch in a 10-inch cast-iron skillet. Heat the oil over high heat to 350??F. (Use a deep-fry/candy thermometer for accuracy.)",
    "Fry the chicken, in batches, until golden brown and cooked through, 6 to 8 minutes per side; the chicken should register 165??F on an instant-read thermometer. As you are cooking, be mindful of the temperature of your oil and regulate the heat as necessary. You do not want the temperature of the oil to drop below 325?? or to go above 350??F. As the pieces are cooked, transfer them to a paper towel???lined platter.",
    "Serve the chicken hot, with the Buttermilk Waffles, Black Pepper Maple Syrup, and Whipped Vanilla Butter.",
    "For the buttermilk waffles:",
    "Combine the flour, sugar, cornmeal, baking soda, and salt in a medium mixing bowl. In a second medium bowl, whisk together the buttermilk, eggs, and vanilla. Add the wet ingredients to the dry, and mix until thoroughly combined. Whisk in the melted butter.",
    "(The batter can be prepared ahead and refrigerated overnight.)",
    "Heat an oiled waffle iron. Pour the appropriate amount of batter (according to the size of your waffle iron) onto the hot griddle, and cook until crisped and golden brown to your liking. Transfer the waffle to a serving plate and repeat with the remaining batter.",
    "For the vanilla butter:",
    "Cut the vanilla bean in half lengthwise and scrape the seeds into a small bowl. Reserve the scraped pod for the Black Pepper Maple Syrup. Add the butter and salt to the bowl, and whip with a handheld electric mixer until light and fluffy.",
    "Transfer the butter to a small container, cover, and refrigerate until ready to use.",
    "For the black pepper maple syrup:",
    "Combine all the ingredients in a small saucepan and bring to a boil. Remove from the heat and allow the flavors to steep until ready to serve. Remove the vanilla bean before serving if desired.",
    "Recipe courtesy Emeril Lagasse, from Farm to Fork: Cooking Local, Cooking Fresh, HarperCollins Publisher, New York, 2010, copyright MSLO, Inc., all rights reserved",
    "This recipe was styled by chef Karen Pickus for Good Morning America."
  ],
  "ingredients": [
    "0",
    "11/2 cups well-shaken buttermilk",
    "1/4 cup Crystal hot sauce or other Louisiana red hot sauce",
    "11/2 tablespoons sugar",
    "1 tablespoon plus 1 teaspoon salt",
    "1 tablespoon sweet paprika",
    "3 cloves garlic, smashed",
    "One 31/2-pound chicken, cut into 8 pieces",
    "2 cups all-purpose flour",
    "3 to 4 cups vegetable oil, for frying",
    "For the buttermilk waffles:",
    "13/4 cups cake flour",
    "3 tablespoons sugar",
    "2 tablespoons yellow cornmeal",
    "1/2 teaspoon baking soda",
    "1/2 teaspoon salt",
    "2 cups well-shaken buttermilk",
    "2 eggs",
    "1/2 teaspoon vanilla extract",
    "8 tablespoons (1 stick) butter, melted",
    "For the vanilla butter:",
    "One 1-inch piece of vanilla bean",
    "12 tablespoons (11/2 sticks) unsalted butter, at room temperature",
    "1/8 teaspoon salt",
    "For the black pepper maple syrup:",
    "11/2 cups grade-A dark amber maple syrup",
    "1/2 teaspoon freshly ground black pepper",
    "2 tablespoons Crystal hot sauce",
    "One 1-inch scraped vanilla bean pod (from making Whipped Vanilla Butter)"
  ],
  "__v": 1
}