{
  "hash": "5473b26af792971fc8d5973dcd498475e7f2fd53",
  "title": "Vegan Aged Camembert Cheese",
  "image": "http://fullofplants.com/wp-content/uploads/2015/09/vegan-aged-camembert-cheese-1.jpg",
  "href": "http://fullofplants.com/vegan-aged-camembert-cheese/",
  "extension": "Chrome",
  "firstAdded": "2016-07-06T23:52:20.530000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Soak the cashews in filtered water for at least 5 hours or overnight.",
    "1",
    "Drain the cashews, rinse them under cold water and place in the bowl of the blender, set aside.",
    "Add 8 tablespoons of sterilized water to the bowl of the blender.",
    "Open the probiotic capsules and add the powder to the bowl.",
    "Add the penicillium candidum, just 4 drops is enough.",
    "Blend on high speed, scraping down the sides from time to time, this step might take about 10 minutes depending on your blender. You can also use your food processor if you don't have a powerful blender.",
    "The mixture should be smooth but thick. If needed, add 1 tablespoon of water at a time until smooth. Do not add too much water, you want to use as least as possible.",
    "Transfer the mixture into a cheesecloth and pull it tight. Add a weight above it and let drain at room temperature for at least 10 hours. Transfer to a clean bowl, cover and let sit at room temperature for one day, this step is important to let the cheese ferment.",
    "The following day, place the bowl in the refrigerator for about 4 hours to make the mixture easier to work with.",
    "After that, line a clean baking sheet with parchment paper.",
    "Cut strips of parchment paper and lay them in 3 small springform pans (I used 4-inches pans). Fill each pan with the mixture and press it down using plastic film so it doesn't stick to your hands.",
    "Place each cheese on the baking sheet.",
    "2",
    "Cover the cheeses with a large plastic box to keep some humidity. Let sit in a room at a temperature of about 52-56 degrees.",
    "Every day for the next 3 days, carefully flip the cheeses using a small plate. The cheeses will still be very soft, like cream cheese. Don't worry they will be easier to work with after four days.",
    "On day 4, sprinkle the salt over the top of the cheeses, turn them over and sprinkle the bottom and sides with more salt.",
    "Continue to flip the cheeses everyday, always use clean hands or work with a plastic film to be sure you are not touching the cheese.",
    "After 7 days, they should be a little bit harder and you should be able to place them on a bamboo mat.",
    "Flip them everyday for the next week. The mold will appear after 5-7 days and continue to grow until they are fully covered with a white rind.",
    "After 2 weeks, wrap the cheeses in parchment paper or cheese paper and place them in the refrigerator for at least 2 days. The longer you let them age in the refrigerator, the stronger the taste.",
    "Enjoy with french bread, fresh figs or walnuts!",
    "The cheese will keep for at least 1 month in the refrigerator."
  ],
  "ingredients": [
    "0",
    "4 cups raw cashews",
    "8 capsules vegan probiotic (Acidophilus)",
    "8-10 tbsp sterilized water",
    "4 drops of penicillium candidum",
    "2 tsp sea salt"
  ],
  "__v": 1
}