{
  "hash": "6f31312ea808d9090e2da787db1b751a06fc22f3",
  "title": "stuffed mushrooms",
  "image": "http://www.recipe.com/images/stuffed-mushrooms-R090734-ss.jpg",
  "href": "http://www.recipe.com/stuffed-mushrooms/",
  "extension": "Chrome",
  "firstAdded": "2015-10-06T13:10:09.691000",
  "users": [
    null
  ],
  "keywords": [
    "mushrooms",
    "diameter",
    "cooking",
    "spray",
    "green",
    "onion",
    "clove",
    "garlic",
    "butter",
    "margarine",
    "dry",
    "bread",
    "crumbs",
    "cheddar",
    "smoked",
    "gouda",
    "crumbled",
    "blue",
    "cheese",
    "strips",
    "crisp",
    "bacon"
  ],
  "directions": [
    "0",
    "Clean mushrooms. Remove stems from mushrooms. Set stems aside. Place mushroom caps, stem sides down, in a 15x10x1-inch baking pan. Lightly coat the rounded side of each mushroom cap with cooking spray. Bake for 5 minutes. Carefully place mushroom caps, stem sides down, on a double thickness of paper towels to drain while preparing filling.",
    "2.",
    "Chop enough of the reserved stems to make 1 cup. In a medium saucepan cook the chopped stems, green onion, and garlic in butter until tender. Stir in bread crumbs, cheese, and bacon. Spoon crumb mixture into mushroom caps. Return stuffed mushrooms to the baking pan. Bake in a 425 degree F oven for 8 to 10 minutes or until heated through. Makes 24 mushrooms.",
    "Variation",
    "Greek-Style Stuffed Mushrooms:",
    "Prepare as above, except use 1/2 cup of the chopped mushroom stems. Omit butter, shredded cheese, and bacon. Cook mushroom stems, green onion, and garlic in 1/4 cup olive oil. Stir in bread crumbs, 1/2 cup chopped pitted kalamata olives, 1/2 cup crumbled feta cheese, and 1 teaspoon Greek seasoning, crushed. Bake as directed.",
    "Variation",
    "Prosciutto-Stuffed Mushrooms:",
    "Prepare as above, except omit butter, shredded cheese, and bacon. Cook mushroom stems, green onion, and garlic in 1/4 cup olive oil. Stir in bread crumbs, 1/3 cup chopped prosciutto, 1/4 cup shredded Parmesan or Asiago cheese, and 1 teaspoon dried Italian seasoning, crushed. Bake as directed.",
    "Variation",
    "Pesto-Stuffed Mushrooms:",
    "Prepare as above, except discard mushroom stems. Omit green onion, garlic, butter, bread crumbs, cheese, and bacon. In a small bowl combine 1/2 cup purchased pesto, 1/4 cup shredded Parmesan cheese, and 1/4 cup toasted pine nuts. Spoon mixture into mushroom caps. Bake as directed.",
    "NUTRITION INFORMATION",
    "Per Serving: cal. (kcal) 45, Fat, total (g) 4, chol. (mg) 8, sat. fat (g) 2, carb. (g) 2, Monounsaturated fat (g) 1, sugar (g) 1, pro. (g) 2, vit. A (IU) 97, Thiamin (mg) 0, Riboflavin (mg) 0, Niacin (mg) 1, Pyridoxine (Vit. B6) (mg) 0, Cobalamin (Vit. B12) (µg) 0, sodium (mg) 101, Potassium (mg) 74, calcium (mg) 20, iron (mg) 0, Fat () 1, Percent Daily Values are based on a 2,000 calorie diet"
  ],
  "ingredients": [
    "0",
    "24 large fresh mushrooms, 1-1/2 to 2 inches in diameter",
    "Nonstick cooking spray",
    "1/4 cup sliced green onion (2)",
    "1 clove garlic, minced",
    "1/4 cup butter or margarine",
    "1/2 cup fine dry bread crumbs",
    "1/2 cup shredded cheddar or smoked Gouda cheese or crumbled blue cheese (2 ounces)",
    "2 strips crisp cooked bacon, crumbled (1/4 cup)"
  ],
  "__v": 1
}