{
  "hash": "04165c699b4dad02ed7288ee2da79cc1386c4ee2",
  "title": "Lemon Almond Shortbread Cookies",
  "image": "https://kristineskitchenblog.com/wp-content/uploads/2016/03/205xNxlemon-almond-shortbread-cookies-square-5883-300x300.jpg.pagespeed.ic.-kIgXCt6OS.webp",
  "href": "https://kristineskitchenblog.com/lemon-almond-shortbread-cookies-gluten-free/",
  "extension": "Chrome",
  "firstAdded": "2017-08-25T21:33:14.425000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place sugar and lemon zest in a medium bowl and use your fingertips to blend the zest into the sugar until fragrant.",
    "In the bowl of a stand mixer fitted with the paddle attachment (you may also use a handheld mixer), combine the almond meal/flour and salt. Add the sugar and zest mixture and beat on medium-low speed until combined. Mix in the almond extract.",
    "Add the cold butter cubes and beat on medium-low speed for 4-5 minutes until a dough forms and biggest pieces of butter are no larger than half the size of a small pea.",
    "Divide the dough into two equal portions and roll each portion into an even 1 ½-inch diameter log. I rolled my dough into the logs on plastic wrap, using the plastic to help shape the logs as the dough is a bit sticky. Wrap dough logs in plastic wrap and refrigerate for at least 3 hours and up to 3 days.",
    "When you are ready to bake the cookies, preheat oven to 350 degrees F. Line baking sheets with parchment paper.",
    "Using a sharp knife, cut dough into ¼-inch thick slices. Place cookies on baking sheets, spacing 1 ½-2 inches apart. Bake for 10-11 minutes, until barely golden. Let cool on baking sheet for 10 minutes before transferring to a wire rack to cool completely."
  ],
  "ingredients": [
    "0",
    "½ cup granulated sugar",
    "2 tablespoons lemon zest (from 2 medium lemons)",
    "2 ½ cups (280 grams) Bob's Red Mill Finely Ground Almond Meal/Flour",
    "½ teaspoon salt",
    "½ teaspoon almond extract",
    "1 cup (2 sticks) cold unsalted butter, cut into cubes"
  ],
  "__v": 1
}