{
  "hash": "67aa610842b91e89ca97b9ff0b084c19442c0f57",
  "title": "Eggs Benedict Casserole",
  "image": "https://i1.wp.com/peaceloveandlowcarb.com/wp-content/uploads/2016/02/Eggs-Benedict-Casserole-Low-Carb-Gluten-Free-Paleo-Peace-Love-and-Low-Carb-1-1.jpg?resize=550%2C742",
  "href": "http://peaceloveandlowcarb.com/eggs-benedict-casserole-low-carb-gluten-free/",
  "extension": "",
  "firstAdded": "2017-05-21T01:46:42.836000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350°",
    "Set aside 6 slices of Canadian bacon and chop the rest.",
    "Heat the butter in a medium skillet over medium high heat. Once the butter is melted and the pan is hot, add the Canadian bacon. Cook until it just starts to brown.",
    "Crack the eggs into a large mixing bowl and whisk. Add the heavy cream, Dijon mustard, garlic powder, onion powder, paprika, sea salt and black pepper. Whisk until all ingredients are well combined. Mix in three quarters of the cooked Canadian bacon.",
    "Line the remaining 6 slices of Canadian bacon on the bottom of an 8x13 baking dish.",
    "Pour the egg mixture over top of the sliced Canadian Bacon.",
    "Bake for 20 minutes. Remove from oven and sprinkle the remaining Canadian bacon over top.",
    "Return to the oven and bake for an additional 10 minutes.",
    "In a stainless steel mixing bowl, whisk the egg yolks and lemon juice together. The mixture should get thicker and increase in volume.",
    "Heat a saucepan with 1 to 2 inches of water in it over medium heat until the water is simmering. Lower the heat to medium low. Place the bowl over top of the saucepan, making sure that the water is not touching the bottom of the bowl or else the eggs will begin to scramble. Continue whisking rapidly.",
    "Little by little, whisk in the melted butter until the sauce has thickened and is light and fluffy.",
    "Remove from the heat and gently whisk in the hot sauce, cayenne pepper and sea salt."
  ],
  "ingredients": [
    "0",
    "12 oz Canadian bacon or thinly sliced ham, sliced",
    "1 tbsp butter or olive oil",
    "10 large pastured eggs",
    "1/2 cup heavy cream",
    "2 tbsp dijon mustard",
    "1 tsp garlic powder",
    "1 tsp onion powder",
    "1/4 tsp paprika",
    "1/4 tsp sea salt",
    "1/4 tsp black pepper",
    "4 egg yolks",
    "2 tbsp lemon juice",
    "1/2 cup butter (1 stick), melted",
    "dash hot sauce",
    "pinch of cayenne pepper",
    "pinch of sea salt"
  ],
  "__v": 1
}