{
  "hash": "cf13aeab3ee1102d68303bf78eb8fbab4fef07b7",
  "title": "Classic Beef Stroganov",
  "image": "https://milkandbun.files.wordpress.com/2014/11/beef-stroganov-1.jpg?w=650&h=433",
  "href": "https://milkandbun.com/2014/11/12/classic-beef-stroganov/",
  "extension": "Chrome",
  "firstAdded": "2018-12-11T12:51:24.148000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Method",
    "To make the sour cream sauce, in a small bowl, combine the sour cream with mustard, add stock to make it more thin (it should be liquid like kefir).",
    "Mix the flour with a good pinch of salt. Lightly flour beef cubes from all sides, shake off any flour excess. Heat the heavy frying pan, when it’s hot, add butter or sunflower oil. Then sear beef cubes in 2 or 3 batches, so you don’t overcrowd the pan and steam the meat. Cook for 2-3 muntes or just until browned. Transfer to the plate.",
    "In the same frying pan (reduce the heat to medium), add a knob of butter, mushrooms and onions. Fry onion until it’s soft. Then add fried meat, season with salt and pepper. Reduce the heat to medium-low, you need to warm the meat mixture for 2-3 minutes. Now add the sauce, stirring continuously for 1-2 minutes. Remove the pan from the heat, cover with lid and let it rest for few minutes.",
    "Serve with mashed potatoes, sprinkle with dill or parsley. Enjoy!",
    "You can keep the dish in the fridge up to 1-2 days. Keep the fried meat and sour cream sauce separate in the different containers. Just mix it together and rewarm before serving (but don’t let the sauce bubble)."
  ],
  "ingredients": [
    "0",
    "You can also serve the beef with buckwheat instead of mashed potatoes.",
    "Ingredients",
    "500g beef fillet, cut into medium cubes",
    "2 medium brown onions, thinly sliced",
    "200-300g mushrooms, sliced (cep mushrooms or brown champignons)",
    "2-3 Tbsp plain flour",
    "150-200ml sour cream",
    "2 tsp dijon mustard",
    "2-3 Tbsp beef stock",
    "butter or sunflower oil",
    "sea salt, black pepper to taste",
    "mashed potatoes, chopped dill or parsley, rye bread, for serving"
  ],
  "__v": 1
}