{
  "hash": "5aa8c4ecc732557c19e2774989b0ec3deaffa576",
  "title": "Shanghai Home-style Noodle Soup",
  "image": "https://thewoksoflife.com/wp-content/uploads/2019/01/shanghai-homestyle-noodle-soup-10.jpg",
  "href": "https://thewoksoflife.com/2019/01/shanghai-home-style-noodle-soup/",
  "extension": "Chrome",
  "firstAdded": "2019-02-07T22:14:40.872000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Marinate the julienned pork (or chicken thighs) with 2 tablespoons water, 1 teaspoon Shaoxing wine, ¼ teaspoon salt, ½ teaspoon light soy sauce, ¼ teaspoon sesame oil, and ½ teaspoon cornstarch for 15 minutes.",
    "Cook the noodles in a pot of boiling water per the cooking instructions on the package. Drain and set aside. At this point, you can cut the noodles a few times by running a knife or scissors through them so they’re spoon-friendly, but this is optional. The reason for pre-cooking the noodles separately is to prevent the soup from becoming too starchy.",
    "Preheat your wok or thick-bottomed pot until it just starts to smoke. Add 3 tablespoons oil, and cook the marinated meat until it turns opaque. Add the sliced mushrooms and stir-fry for 2-3 minutes.",
    "Add the stock and cooked noodles. Bring to a boil, and lower the heat to a simmer for 5 minutes, until the noodles are softened and expand slightly. Next, add the leafy greens and bring to a boil again. Add salt and white pepper to taste, and sprinkle with the chopped scallion before serving."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "8 ounces (225g) pork shoulder or boneless chicken thighs, julienned",
    "2 tablespoons water",
    "1 teaspoon Shaoxing wine",
    "¼ teaspoon salt",
    "½ teaspoon light soy sauce",
    "¼ teaspoon sesame oil",
    "½ teaspoon cornstarch",
    "4 ounces dried wheat noodles",
    "3 tablespoons oil",
    "5 cups chicken and pork stock or just plain chicken stock",
    "6 ounces (170g) mushrooms (any kind works), sliced",
    "8 ounces (225g) leafy greens, coarsely chopped",
    "Salt, to taste",
    "Ground white pepper, to taste",
    "2 scallions, chopped"
  ],
  "__v": 1
}