{
  "hash": "e9d22e1f95e869a5a7c7c7b413dc13a3ac396040",
  "title": "Key Lime Marshmallow Meringue Pie",
  "image": "https://img.buzzfeed.com/buzzfeed-static/static/2017-02/22/14/asset/buzzfeed-prod-fastlane-02/sub-buzz-9443-1487790643-1.jpg?downsize=715:*&output-format=auto&output-quality=auto",
  "href": "https://www.buzzfeed.com/jordankenna/key-lime-marshmallow-meringue-pie?bffbtasty&ref=bffbtasty&utm_term=.lyX49ppbNR",
  "extension": "",
  "firstAdded": "2017-06-09T08:54:46.391000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350˚F/180˚C.",
    "Place graham crackers in plastic bag and crush them into a fine crumb using a rolling pin. Alternatively, a food processor can be used to crush the crackers.",
    "Pour the graham cracker crumbs into a medium bowl with the melted butter and brown sugar. Mix until the crumbs take on the character of a coarse, wet sand.",
    "Pour the crumbs into a 9-inch pie dish. Press the crumb firmly into the dish, making sure to coat the bottom and sides of the dish evenly. Once the crust has been formed, place the pie dish into the refrigerator to firm up.",
    "Separate 6 eggs. Working with the yolks (reserve the whites for later), add the zest of 1 lime and whisk, either by hand or with an electric mixer, for 2 minutes.",
    "Add the can of condensed milk and continue to whisk until mixture is smooth and has a pale yellow color. Add in the ice cream and key lime juice. Continue to whisk for an additional 3–5 minutes. The filling should be smooth and airy when finished.",
    "6. Pour the filling mixture into the refrigerated graham cracker crust and bake at 350˚F/180˚C for 18–20 minutes, or until the edges of the crust begin to brown and the filling no longer jiggles when disturbed.",
    "7. While the pie is baking, combine the reserved egg whites with corn syrup and about ¼ cup of the sugar and begin to whisk vigorously to form the meringue. Continue to add the sugar in small increments until all of it is incorporated. Continue to whisk until mixture thickens and stiff peaks form, about 7–10 minutes.",
    "8. Top the baked pie with the meringue. Using a rubber spatula, spread the meringue evenly over the top of the pie, making sure to cover all the visible areas of filling. Once covered, use the tip of the spatula to shape the meringue forming small peaks a valleys in the topping.",
    "9. Bake at 350˚/180˚C for an additional 7–10 minutes to toast the meringue topping. Allow to cool completely for at least 1 hour before cutting."
  ],
  "ingredients": [
    "0",
    "10 graham crackers",
    "7 tablespoons butter, melted",
    "¼ cup brown sugar",
    "6 eggs, separated",
    "Lime zest",
    "1 14-ounce can condensed milk",
    "½ pint vanilla ice cream",
    "½ cup key lime juice *(Regular lime juice works just fine if key lime juice is unavailable)*",
    "1 tablespoon light corn syrup",
    "1 cup sugar"
  ],
  "__v": 1
}