{
  "hash": "3b2ac44f0f3710998586353a463341a32ad1f8fe",
  "title": "Vegan Cookie Dough Brownies. Gluten-free No Bake",
  "image": "http://www.veganricha.com/wp-content/uploads/2014/09/cookiedough-Brownie-bars-2707.jpg",
  "href": "http://www.veganricha.com/2014/09/vegan-cookie-dough-brownies.html",
  "extension": "",
  "firstAdded": "2015-09-22T21:48:38.262000",
  "users": [
    null
  ],
  "keywords": [
    "red",
    "lentils",
    "masoor",
    "dal",
    "water",
    "vanilla",
    "salt",
    "hemp",
    "seeds",
    "coconut",
    "oil",
    "raw",
    "sugar",
    "sweetener",
    "oat",
    "divided",
    "use",
    "flour",
    "make",
    "free",
    "mini",
    "vegan",
    "chocolate",
    "chips",
    "cocoa"
  ],
  "directions": [
    "0",
    "In a pan, add washed lentils and water. Partially cover and cook for 13 to 14 minutes on medium heat or until very tender. Drain if needed. Cool to room temperature and add to blender.",
    "Add hemp seeds to the blender and blend. Blend 2 or more cycles to smoothly blend the hemp seeds and lentils.",
    "Add salt, vanilla extract, sugar, coconut oil and blend to combine. Divide the blended mixture into 2 bowls.",
    "In one bowl, add 2 Tbsp oat flour, 2.5 Tbsp coconut flour and mix well. Add ¼ cup chocolate chips and mix. Taste add more sweet if needed. This is the cookie dough.",
    "In other bowl, add 2 Tbsp oat flour, 2.5 Tbsp coconut flour, cocoa powder and mix well. Add 2 Tbsp chocolate chips and mix in. Taste and add sweet if needed. This is the brownie.",
    "*Coconut flour thickens up the dough, so add less or more depending on the moisture content. During mixing, you will know after a minute if the dough needs more or not.",
    "Press brownie layer into parchment lined pan. Press cookie dough on top. Chill for an hour or freeze for half an hour. Slice and serve. Keep refrigerated for upto 4 days, frozen for longer."
  ],
  "ingredients": [
    "0",
    "½ cup red lentils (masoor dal)",
    "1 cup water",
    "1 Tbsp vanilla extract",
    "⅛ tsp salt",
    "⅓ cup hemp seeds",
    "1 Tbsp coconut oil",
    "¾ cup ground raw sugar or other sweetener",
    "¼ cup oat flour divided (or use coconut flour to make grain free)",
    "¼ cup plus 1 Tbsp Coconut Flour",
    "¼ cup + 2 Tbsp mini vegan chocolate chips",
    "2 Tbsp cocoa powder"
  ],
  "__v": 1
}