{
  "hash": "b2c744d3f19ee6701cd54dd38c1723b0ce5853d0",
  "title": "Roasted Parsnip and Vanilla Soup",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2008/2/14/0/IE0305_Roasted_Parsnip_and_Vanilla_Chocolate_Soup.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/robert-irvine/roasted-parsnip-and-vanilla-chocolate-soup-recipe.html",
  "firstAdded": "2015-01-24T17:39:53.756000",
  "users": [
    null
  ],
  "keywords": [
    "parsnips",
    "oil",
    "butter",
    "white",
    "onion",
    "quarts",
    "chicken",
    "stock",
    "vanilla",
    "bean",
    "preferably",
    "tahitian",
    "salt",
    "pepper",
    "chocolate",
    "recommended",
    "hersheys",
    "premier",
    "chips",
    "cream"
  ],
  "directions": [
    "0",
    "Preheat oven to 400 degrees F.",
    "Peel parsnips, and cut into 1-inch chunks, brush lightly with oil and place on a baking sheet lined with heavy duty aluminum foil (for easy cleanup). Roast until the parsnips begin to soften (as tested with a knife blade) and until the tips begin to turn golden brown. This takes about 40 minutes. Remove from oven and let rest for a few minutes while you start the other ingredients in the stockpot.",
    "Melt the butter over medium-low heat in a large stockpot and gently saute the onion until translucent. (This takes about 10 minutes, but the more important thing is that they look translucent.)",
    "Add the chicken stock, slice open the vanilla bean lengthwise and scrape the seeds into the pot and add along with the vanilla pod itself. Increase heat to medium, add the roasted parsnips, and bring to a boil. Season with salt and pepper, cover and let cook until the parsnips are completely tender, about 20 minutes..",
    "Stir the white chocolate chips into the soup and cook for a further 5 minutes, to allow them to melt and to integrate flavors.",
    "Remove soup from heat, discard vanilla pod, and stir in heavy cream. Using an immersion blender, blend until smooth."
  ],
  "ingredients": [
    "0",
    "12 pounds parsnips",
    "3/4 c oil",
    "3/4 # butter",
    "6 large white onion, chopped",
    "12 quarts chicken stock",
    "6 whole vanilla bean, preferably Tahitian",
    "Salt and pepper",
    "6 cup vanilla white chocolate chips (recommended: Hershey's Premier White Chips)",
    "6 cup heavy cream"
  ],
  "__v": 3
}