{
  "hash": "a0f6c639d87298b756435570e1c6cab059ccfff7",
  "title": "Giant Chocolate and Peanut Butter Cookie",
  "image": "https://static01.nyt.com/images/2019/11/21/dining/ejm-chocolate-peanut-butter-shortbread/ejm-chocolate-peanut-butter-shortbread-articleLarge.jpg",
  "href": "https://cooking.nytimes.com/recipes/1020661-giant-chocolate-and-peanut-butter-cookie?action=click&module=Global%20Search%20Recipe%20Card&pgType=search&rank=94",
  "extension": "Firefox",
  "firstAdded": "2020-02-25T00:34:37.098000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the oven to 350 degrees. Spray a 9-inch springform pan with nonstick spray.",
    "Prepare the shortbread: In the bowl of an electric mixer fitted with the paddle attachment, cream the butter and brown sugar until light and fluffy, 4 to 5 minutes. Add the vanilla and mix to combine.",
    "Reduce the speed to low. Add the flour and salt and mix until evenly combined. Transfer the dough to the prepared pan and press into an even layer. Prick the shortbread all over with a fork.",
    "Bake until the shortbread is baked through, set and lightly golden, 22 to 26 minutes. Cool completely, and remove the outer ring from the springform pan. Place on a cooling rack set over a baking sheet.",
    "Wipe out the bowl of the mixer, and make the peanut butter filling: Using the paddle attachment, cream the butter, peanut butter and confectioners’ sugar until light and fluffy, 3 to 4 minutes. Add the vanilla and salt and mix to combine.",
    "Spread on top of the cooled shortbread, leaving it slightly more mounded in the center than at the edges. Transfer to the refrigerator while you make the glaze.",
    "Place a medium heat-safe bowl over a medium pot of simmering water. Add the chocolate, coconut oil and cream to the bowl and heat, stirring frequently, until the mixture is melted and fluid. (Alternatively, the mixture can be microwaved in a microwave-safe container in 15-second bursts, stirring after each burst until the mixture is fully melted.) Cool for 5 minutes.",
    "Pour the glaze over the cooled cookie, using a small offset spatula to help coat the edges evenly as needed. If necessary, you can collect the glaze that runs off the cookie onto the baking sheet and pour back over to glaze any missed spots.",
    "Once the cookie is fully glazed, use a large spatula to transfer it to a platter. Transfer to the refrigerator to chill completely for 45 minutes before slicing with a serrated knife and serving. Store, covered, at room temperature for up to 3 days."
  ],
  "ingredients": [
    "0",
    "Nonstick cooking spray",
    "1",
    "cup/225 grams unsalted butter (2 sticks), at room temperature",
    "½",
    "cup/110 grams light brown sugar",
    "1",
    "teaspoon vanilla extract",
    "2 ½",
    "cups/320 grams all-purpose flour",
    "½",
    "teaspoon fine sea salt"
  ],
  "__v": 1
}