{
  "hash": "0629116bd03ba65f805319a6c4790d7e3b4164cc",
  "title": "Pyszna domowa TORTILLA",
  "image": "http://to-tylko-blog.blog.pl/files/2014/01/Ciacho-156-300x225.jpg",
  "href": "http://to-tylko-blog.blog.pl/2014/01/30/pyszna-domowa-tortilla/",
  "extension": "",
  "firstAdded": "2016-09-22T21:03:54.793000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Z kilograma mąki odsypujemy 1/2 szklanki i zostawiamy do podsypywania przy wałkowaniu. Resztę mąki wsypujemy do miski, dodajemy sól, smalec. Siekamy nożem żeby maksymalnie rozdrobnić smalec. Teraz dolewając stopniowo wodę wyrabiamy ciasto ręką. Wyrabiamy dolewając w razie potrzeby wodę, aż wszystkie składniki połączą się w jedną całość. Najlepiej uformować ciasto w grupy wałek, z którego będziemy odkrajać nożem porcję na jeden placek. Każdą porcję oddzielnie rozwałkować na grubość półtora milimetra. Żeby nasze tortille miały ładny równy kształt pomocniczo przykładamy duży talerz i obkrawamy wokół niego placek. Najlepiej żeby nasz placek był o pół centymetra większy od wielkości dna dużej patelni, na której będziemy je smażyć gdyż podczas smażenie trochę się skurczy.",
    "Rozwałkowany i przykrojony w równe koło placek kładziemy na suchą rozgrzaną patelnię (bez tłuszczu) i smażymy z każdej strony 1-2 minuty.",
    "Na świeże ciepłe tortille układać farsz. U mnie jest to :",
    "sałata porwana na kawałki (może też być gotowa mieszanka sałat ze sklepu)",
    "cebula pokrojona w cieniutkie plasterki",
    "pomidor pokrojony w cząstki",
    "ogórek świeży lub konserwowy pokrojone w plasterki lub drobną kostkę",
    "300 g obsmażonych i przyprawionych piersi z kurczaka (przyprawić można np. przyprawą do kurczaka)",
    "sos : 2 łyżki ketchupu, 4 łyżki majonezu,łyżka soku z cytryny, ostra papryka mielona, 2 szczypty suszonej kolendry roztarte aby wydobyć ich aromat, ząbek czosnku przeciśnięty przez praskę / wszystkie składniki sosu wymieszać w małej miseczce i gotowe.",
    "Wszystkie składniki nakładamy na placek tortilli i zwijamy zaginając spód, aby podczas konsumpcji nic nam nie uciekało."
  ],
  "ingredients": [
    "0",
    "Składniki na ok. 10 placków tortilli o śr. 23 cm:",
    "1 kg mąki pszennej",
    "1 kostka smalcu",
    "ok. 1 szklanka gorącej wody",
    "1 łyżeczka soli"
  ],
  "__v": 1
}