{
  "__v": 1,
  "directions": [
    "0",
    "Instructions",
    "Put the beetroot in a large saucepan or stockpot with the vinegar, sugar and salt and toss to combine. Add the stock and all of the remaining ingredients, except the tinned beetroot and dill. Bring the soup very slowly up to 85°C (185°F) — as a guide, if you can see some steam rising off the top, but it’s not really bubbling, it will cook well and not discolour. Cook for 1½–2 hours, then remove from the heat and add the tinned beetroot immediately, if using.",
    "Season the soup with salt, sugar and vinegar or lemon juice, to taste.",
    "Leave the soup to sit at room temperature for about 2 hours before serving, and if possible, leave it in the refrigerator for 1 day more — this long sitting allows for maximum colour extraction from the beetroot and deepens the flavour. Strain the broth. You can now carefully reheat the soup, being careful not to get it too hot, garnish with the fresh dill and serve it with meat or mushroom uszka.",
    "Note",
    "• Variation: For a vegetarian version of barszcz, use a vegetarian soup stock.",
    "Recipe from Borsch, Vodka and Tears published by Hardie Grant."
  ],
  "firstAdded": "2014-10-11T13:09:53.712000",
  "hash": "1ce5f4eef11d12616abd6b47f8e65ea89910b308",
  "href": "http://www.sbs.com.au/food/recipes/polish-borsch-dumplings-barszcz-z-uszkami",
  "image": "http://www.sbs.com.au/food/sites/sbs.com.au.food/files/styles/full/public/Polish-Borsch.jpg?itok=XQ9VzWeA&mtime=1375907925",
  "ingredients": [
    "0",
    "1 kg beetroot (beets), peeled and cut into 2 mm slices",
    "1 tsp white wine vinegar or lemon juice",
    "½ tsp sugar",
    "½ tsp salt",
    "2 litres (8 cups) Polish soup stock",
    "1 dried porcini slice (remember not to put 1 mushroom too many in the barszcz!)",
    "1 thyme sprig",
    "1 garlic clove, halved",
    "1 leek, white part only, halved lengthwise",
    "1 allspice berry",
    "⅛ tsp dried marjoram",
    "225 g tin sliced beetroot, drained (optional)",
    "chopped fresh dill, to serve"
  ],
  "keywords": [
    "beetroot",
    "beets",
    "slices",
    "white",
    "wine",
    "vinegar",
    "lemon",
    "juice",
    "sugar",
    "salt",
    "litres",
    "polish",
    "soup",
    "stock",
    "porcini",
    "slice",
    "remember",
    "mushroom",
    "barszcz",
    "thyme",
    "sprig",
    "garlic",
    "clove",
    "leek",
    "lengthwise",
    "allspice",
    "berry",
    "marjoram",
    "tin",
    "dill",
    "serve"
  ],
  "title": "Polish borsch with dumplings (barszcz z uszkami)",
  "users": [
    null
  ]
}