{
  "hash": "41157f7166b26d0a55ef33fc04ba6e97fbd10741",
  "title": "Taco Grain Bowl With Crispy Chipotle Chickpeas",
  "image": "https://i1.wp.com/www.killingthyme.net/wp-content/uploads/2017/02/Taco-Grain-Bowl-6.jpg?resize=800%2C1200",
  "href": "http://www.killingthyme.net/2017/02/02/taco-grain-bowl-with-crispy-chipotle-chickpeas/",
  "extension": "Chrome",
  "firstAdded": "2017-03-25T19:20:38.896000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Chickpeas:",
    "Chickpeas can be cooked in an Actifry for approx. 15-20 minutes. If roasting in the oven, you will want to plan ahead.",
    "Roasting in oven:",
    "Preheat oven to 350 degrees F.",
    "Very lightly grease a baking sheet with cooking oil.",
    "Place the chickpeas on a clean kitchen towel or a few paper towels and gently pat them dry. The dryer, the better.",
    "In a medium bowl, toss the chickpeas with olive oil to coat.",
    "Add the chili hot sauce, chili powder, chipotle chili powder, cumin and garlic salt. Mix thoroughly and ensure chickpeas are evenly coated.",
    "Transfer them to the prepared baking sheet in an even layer.",
    "Bake, shaking the pan halfway through baking time, until the chickpeas are crunchy — approx. 50 minutes to 1 hour.",
    "Let them cool for at least one hour. The chickpeas will get crunchier as they cool. (Optional step.)",
    "Grains:",
    "Prepare the grains as per the packages instructions using vegetable broth in place of water.",
    "Once done, sprinkle the ground coriander into the grains and mix well. Taste, and season more if desired.",
    "Assembly:",
    "Once the grains are ready, transfer them to a bowl and top with some chickpeas (you might have some leftover for snacking!) and desired toppings."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "15 oz can of chickpeas drained and rinsed",
    "A serving for 2 of grains quinoa, rice, barley, etc., cooked as per instructions on packet",
    "in Vegetable broth used to cook the grains",
    "1/4 tsp ground coriander",
    "1/4 tsp chili hot sauce sauce more or less to your taste",
    "1 tsp of chili powder",
    "1/4 tsp chipotle chili powder",
    "1/3 tsp of cumin",
    "1/3 tsp garlic salt",
    "Toppings:",
    "Grated cheddar cheese",
    "Chopped/shredded lettuce",
    "slices Avocado",
    "Diced tomatoes",
    "Fresh chopped parsley or cilantro",
    "Lime wedges for fresh lime juice",
    "Plain Greek yogurt"
  ],
  "__v": 1
}