{
  "hash": "2c52d6cc71fd2502d4a5455d3ea810ec7f57419a",
  "title": "ALTON BROWN'S COLCANNON RECIPE",
  "image": "http://altonbrown.com/wp-content/uploads/2015/03/ab-colcannon-recipe_200.jpg",
  "href": "http://altonbrown.com/colcannon-recipe/",
  "extension": "Chrome",
  "firstAdded": "2015-03-16T21:49:01.538000",
  "users": [
    null,
    null
  ],
  "keywords": [
    "russet",
    "potatoes",
    "rinsed",
    "chunks",
    "red",
    "kosher",
    "salt",
    "divided",
    "unsalted",
    "butter",
    "green",
    "cabbage",
    "cored",
    "black",
    "pepper",
    "irish",
    "whiskey",
    "insist",
    "milk"
  ],
  "directions": [
    "0",
    "Combine all of the potato chunks and 1 teaspoon of the kosher salt in a 4-quart saucepan. Add just enough cold water to cover the potatoes, slap on the lid and bring to a boil over high heat, about 15 minutes. Then remove the lid, drop the heat to a simmer, and cook until the potatoes are easily crushed with tongs, 15 to 20 minutes.",
    "Meanwhile, melt the butter in a 12-inch high-sided saute pan over medium-high heat. Cook until the butter just starts to brown then carefully pour half of the butter into a heatproof bowl and set aside.",
    "Add the cabbage to the pan along with 1 teaspoon kosher salt and all the pepper. Sauté for 7 to 10 minutes, stirring occasionally, until the cabbage is tender and lightly browned. Kill the heat and deglaze the pan with the whiskey, scraping the brown bits from the bottom of the pan. Set aside.",
    "Drain the potatoes and return them to the hot pot. Shake for 30 seconds so the excess water can evaporate. The drier the taters, the better.",
    "Move the pot to a trivet, hot pad, or towel on the countertop and sprinkle with the remaining 1 teaspoon kosher salt. Add the cabbage and milk and mash the potatoes to desired consistency. Taste and season with additional salt and pepper, if desired.",
    "Transfer the potato mixture to the serving vessel of you choice and use the back of a spoon to create a crater in the top of the potatoes. Pour the reserved brown butter into said rater and serve immediately to a thankful planet populated entirely of Irishmen."
  ],
  "ingredients": [
    "0",
    "1 pound russet potatoes, rinsed, peeled and cut into 1/2-inch chunks",
    "1 pound red potatoes, rinsed peeled and cut into 1/2-inch chunks",
    "1 tablespoon kosher salt, divided",
    "6 tablespoons unsalted butter",
    "1 pound green cabbage, cored and shredded",
    "1/2 teaspoon freshly ground black pepper",
    "2 ounces Irish whiskey (or more if you insist)",
    "4 ounces warm whole milk"
  ],
  "__v": 2
}