{
  "hash": "4e787617e709ec28ecd1d573f0928ecfb59fbe35",
  "title": "Grilled Shrimp with Roasted Garlic-Cilantro Sauce",
  "image": "http://cdn2.themediterraneandish.com/wp-content/uploads/2014/12/Grilled-Shrimp-with-Garlic-Cilantro-Sauce-11.jpg",
  "href": "http://www.themediterraneandish.com/grilled-shrimp-recipe-garlic-cilantro-sauce/",
  "extension": "Chrome",
  "firstAdded": "2015-09-14T12:38:56.557000",
  "users": [
    null
  ],
  "keywords": [
    "uncooked",
    "prawns",
    "salt",
    "pepper",
    "olive",
    "oil",
    "head",
    "garlic",
    "trimmed",
    "cilantro",
    "leaves",
    "lime",
    "juice",
    "dry",
    "white",
    "wine",
    "chili"
  ],
  "directions": [
    "0",
    "Preheat your oven to 400 degrees F.",
    "Peel, devein and rinse the prawns or your choice of shrimp. Pat dry and season with salt and pepper. Place the prawns in the fridge until ready to grill.",
    "Trim the top of the garlic head off, but leave the garlic intact. Drizzle generously with olive oil. Roast the garlic in the 400 degree F-heated oven for about 10-15 minutes or until slightly tender and fragrant. When ready, remove from the oven. Let cool briefly. Peel and crush or chop the roasted garlic as finely as possible.",
    "Now prepare the roasted garlic-cilantro sauce. In a small bowl, combine the roasted garlic with the remaining sauce ingredients of cilantro, lime juice, white wine, olive oil and chili sauce. Whisk together and set aside.",
    "When ready, lightly oil and heat a cast-iron grill or griddle to medium-high. Dress the prawns with a little olive oil and grill for 3-4 minutes on each side. You want to achieve some char, but be careful not to overcook the prawns.",
    "Remove the prawns from the grill to a bowl and coat well with the roasted garlic and cilantro sauce. Transfer to a serving platter. Alternatively, transfer the grilled prawns to a serving platter and simply add the roasted garlic-cilantro sauce on the side.",
    "Serve with pasta or rice and a green salad for dinner; or simply as a party appetizer. Enjoy!"
  ],
  "ingredients": [
    "0",
    "1.5 lb uncooked prawns",
    "Salt and pepper",
    "Olive oil",
    "1",
    "1 small head garlic, top trimmed off",
    "1 cup chopped fresh cilantro leaves",
    "1 lime, juice of",
    "1 tbsp dry white wine",
    "3 tbsp olive oil",
    "2 tbsp chili sauce (or 1 tbsp dry chili flakes)"
  ],
  "__v": 1
}