{
  "__v": 4,
  "directions": [
    "0",
    "First, make the tang zhong. Combine the bread flour and water in a small sauce pan, and whisk over medium high heat until thick and swirl lines appear. Remove from heat and allow to cool.",
    "Then, make the dough. Combine all the ingredients in a bread machine (I LOVE my Zojirushi Bread Machine!) and set the “basic dough” function on. (If you don’t have a bread machine, you can knead all the dough ingredients by hand or with a dough hook on a stand mixer – about 15 minutes, then let rise for 45 minutes, punch down, and let rise another 30-45 minutes.)",
    "To make the filling, put all the filling ingredients into the workbowl of a food processor and pulse for about 30 seconds until uniform in texture (coarse crumbs).",
    "Divide the dough into 9 even pieces. Roll each piece out into an oval. Fill each oval with 1/9 of the coconut mixture, spread the coconut mixture out over the dough oval.",
    "Fold the long ends of the oval inward in thirds, to cover the coconut mixture.",
    "Turn the folded dough over, and roll into a rectangle with a rolling pin. Flip over, and roll the long end up to form a cylinder. Set aside and repeat for the remaining dough.",
    "Grease three mini loaf pans. Squash the dough rolls lengthwise (to make them shorter and fatter), and place three (seam side down) into the mini loaf pans.",
    "Cover loosely with plastic wrap, and let rise again for an hour in a warm place.",
    "Brush the tops of the dough with eggwash. Bake in a 335 degree oven for 22 minutes for three smaller loaves. (If you want to make one big loaf instead, in a regular loaf pan, divide the dough into 4 ovals (instead of 9) and bake for 30-35 minutes.)",
    "After removing from the oven, let cool for 5 minutes. Then remove the loaves from the pan, and allow to cool on a wire rack."
  ],
  "firstAdded": "2014-06-17T22:40:43.878000",
  "hash": "884a20c03114e3dba088effc689300d7af574e94",
  "href": "http://www.the350degreeoven.com/2012/05/chinese-taiwanese/chinese-coconut-milk-bread-chinese-coconut-milk-buns/",
  "image": "http://www.the350degreeoven.com/wp-content/uploads/2012/05/DSC_0016-1024x680.jpg",
  "ingredients": [
    "0",
    "Tang Zhong:",
    "1/3 c. bread flour",
    "1 c. water",
    "Coconut Milk Bread:",
    "Coconut Oil is actually a solid fat at room temperature",
    "2 1/2 c. bread flour",
    "1/2 c. coconut milk",
    "1 egg",
    "3 T. coconut oil",
    "1/2 tsp. salt",
    "4 T. sugar",
    "2 tsp. active dry yeast",
    "1/2 c. tang zhong",
    "Coconut Filling:",
    "1 c. sweetened flaked coconut",
    "3 T. coconut oil",
    "3 T. sugar",
    "1/4 tsp. salt",
    "Egg Wash:",
    "1 egg yolk + 1 T. water"
  ],
  "keywords": [
    "tang",
    "zhong",
    "bread",
    "flour",
    "water",
    "coconut",
    "milk",
    "oil",
    "actually",
    "solid",
    "fat",
    "room",
    "egg",
    "salt",
    "sugar",
    "active",
    "dry",
    "yeast",
    "filling",
    "sweetened",
    "flaked",
    "wash",
    "yolk"
  ],
  "title": "Chinese Coconut Milk Bread (Chinese Coconut Milk Buns)",
  "users": [
    null
  ]
}