{
  "hash": "7a0485ee008c49f47b157ff14d443989a14dc805",
  "title": "Millet Socca (gluten free, vegan)Smokey Roasted Eggplant & Squash",
  "image": "http://i0.wp.com/willfrolicforfood.com/wp-content/uploads/2015/07/millet-socca-flatbread-squash-eggplant-mediterranean-dinner-5409.jpg?resize=682%2C1024",
  "href": "http://willfrolicforfood.com/2015/07/smokey-roasted-eggplant-and-squash-with-millet-socca.html",
  "extension": "",
  "firstAdded": "2015-11-11T16:34:23.070000",
  "users": [
    null
  ],
  "keywords": [
    "millet",
    "flour",
    "chickpea",
    "water",
    "virgin",
    "olive",
    "oil",
    "pans",
    "garlic",
    "smoked",
    "paprika",
    "cumin",
    "black",
    "pepper",
    "salt",
    "medium",
    "globe",
    "eggplants",
    "cubes",
    "yellow",
    "summer",
    "squash",
    "rounds",
    "good",
    "quality",
    "cayenne",
    "celtic",
    "maple",
    "syrup",
    "basil",
    "roughly",
    "cherry",
    "tomatoes"
  ],
  "directions": [
    "0",
    "In a medium mixing bowl, combine the millet flour, chickpea flour, water, and olive oil. Stir until the mix is even. Add the minced garlic, smoked paprika, cumin, pepper, and salt.",
    "Cover and set aside for about half an hour (the longer the better) so that the flours can absorb the liquid.",
    "When you're ready to start cooking, preheat the oven to 450F and set a 12\" cast iron pan over high heat on your range. Add about 1 tablespoon olive oil to the pan. Once the pan is good and hot (and your oven is preheated) pour the socca batter into the pan and immediately transfer the pan to the oven. Bake for 10 minutes.",
    "Turn the heat up to BROIL and cook another 3-5 minutes, until the edges of the socca are crisp.",
    "Very carefully, remove the socca from the oven and place the pan on a heat-safe surface. Using a metal spatula, transfer the socca to a sheet of parchment paper to cool.",
    "To serve, cut the socca into triangular wedges. Serve warm.",
    "1",
    "Preheat the oven to 375F. Line a large baking sheet with parchment paper. Set aside.",
    "In a large mixing bowl, combine the chopped eggplant and squash and drizzle the olive oil over top. Toss to coat the veg evenly with oil.",
    "Bruise the cumin in a mortar to break it up a bit. Add the cumin to the bowl of veg.",
    "Grind the black pepper up loosely in your mortar. Add the pepper to the bowl of veg.",
    "Add the paprika, cayenne, and salt. Toss everything together to evenly coat the veg in the spices.",
    "Roast for 30 minutes. The vegetables will be fork tender and some will just be beginning to blacken.",
    "Remove from the oven. Let cool 5 minutes, then add the maple syrup and chopped basil and tomatoes and toss once again to combine. Serve warm with millet socca."
  ],
  "ingredients": [
    "0",
    "1 cup millet flour",
    "½ cup chickpea flour",
    "1 cup water",
    "4 tablespoons virgin olive oil + more for the pans",
    "2 garlic cloves, minced",
    "1 tablespoon smoked paprika",
    "½ teaspoon whole cumin, freshly ground",
    "½ teaspoon black pepper, freshly ground",
    "½ teaspoon salt",
    "1",
    "2 medium globe eggplants, peeled and chopped into 1\" cubes",
    "1-2 large yellow summer squash, sliced into rounds and then halved",
    "4 tablespoons good quality virgin olive oil",
    "½ teaspoon whole cumin",
    "1 teaspoon whole black pepper",
    "1.5 tablespoons smoked paprika",
    "pinch cayenne",
    "½ teaspoon celtic sea salt + more to taste",
    "1 teaspoon maple syrup",
    "handful fresh basil, chopped roughly",
    "1 cup yellow cherry tomatoes"
  ],
  "__v": 1
}