{
  "hash": "89bf775ef30d48d118a0df0c30acae79665721d0",
  "title": "Classic Pad Thai",
  "image": "http://recipe-folder.com/img/recipe-images/048/035/450243748.jpg",
  "href": "https://tasty.co/recipe/classic-pad-thai",
  "extension": "Chrome",
  "firstAdded": "2019-03-21T00:36:17.050000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Soak rice noodles in room temperature water 30 minutes prior to cooking.",
    "In a small saucepan over medium-high heat, whisk together palm sugar, tamarind paste, and fish sauce. Bring to a boil, reduce heat, and reduce for 5 minutes until the sauce thickens and coats the back of a wooden spoon. Remove sauce from heat and set aside.",
    "Heat a cast-iron pan or wok over high heat.",
    "Add oil and chicken and cook for about two minutes until nearly cooked through and nicely seared on all sides.",
    "Add minced garlic, shallots, and turnips to the chicken and stir to incorporate.",
    "Move the chicken to the side of the pan and add the egg. Break the egg up with a spatula or wooden spoon and stir to scramble.",
    "Add soaked rice noodles and stir to evenly incorporate all ingredients, stirring for 1 to 2 minutes.",
    "Add 2 or 3 tablespoons of the reduced sauce and stir.",
    "Add tofu, Chinese chives or green onions, and bean sprouts. Stir to incorporate and remove from heat.",
    "Serve immediately with lime, peanuts, more sprouts and chives, and red chiles, if desired.",
    "Enjoy!"
  ],
  "ingredients": [
    "0",
    "½ lb wide rice noodle (225 g)",
    "¼ cup palm sugar (50 g)",
    "¼ cup fish sauce (60 mL)",
    "¼ cup tamarind paste (55 g)",
    "1 tablespoon oil",
    "6 oz boneless, skinless chicken breast (170 g)",
    "2 cloves garlic, minced",
    "2 shallots, minced",
    "1 teaspoon pickled turnip,",
    "optional",
    "egg",
    "4 oz tofu, cubed, optional (110 g)",
    "½ bunch green onion, or chinese chives, sliced, plus more for serving",
    "½ cup bean sprout, plus more for serving (50 g)",
    "lime, for serving",
    "peanuts, for serving",
    "red thai chile, diced, for serving, optional"
  ],
  "__v": 2
}