{
  "hash": "b659e0c236aa0124b53f57de59cf7cdff46ce446",
  "title": "Buttered Sweet Potato Knot Rolls",
  "image": "http://img2.timeinc.net/health/img/recipes/recipes/ck/03/01/rolls-ck-408839-x.jpg",
  "href": "http://www.health.com/health/recipe/0,,10000000408839,00.html",
  "extension": "Chrome",
  "firstAdded": "2015-10-12T23:37:13.752000",
  "users": [
    null
  ],
  "keywords": [
    "dry",
    "yeast",
    "cupwarm",
    "reducedfat",
    "milk",
    "cupcanned",
    "mashed",
    "potatoes",
    "tablespoonsbutter",
    "divided",
    "teaspoonssalt",
    "egg",
    "yolks",
    "lightly",
    "cupsbread",
    "flour",
    "cooking",
    "spray"
  ],
  "directions": [
    "0",
    "Preparation",
    "Dissolve yeast in milk in a large bowl; let stand 5 minutes.",
    "Add sweet potatoes, 1 tablespoon butter, salt, and egg yolks, stirring mixture with a whisk.",
    "Lightly spoon flour into dry measuring cups; level with a knife. Add 4 1/2 cups flour; stir until a soft dough forms.",
    "Turn dough out onto a floured surface. Knead until smooth and elastic (about 8 minutes); add enough of remaining flour, 1 tablespoon at a time, to prevent dough from sticking to hands (dough will feel very soft and tacky).",
    "Place dough in a large bowl coated with cooking spray, turning to coat top. Cover and let rise in a warm place (85°), free from drafts, 45 minutes or until doubled in size. (Gently press 2 fingers into dough. If indentation remains, dough has risen enough.) Punch dough down. Cover and let rest 5 minutes.",
    "Line 2 baking sheets with parchment paper. Divide dough into 24 equal portions. Working with 1 portion at a time (cover remaining dough to prevent drying), shape each portion into a 9-inch rope. Carefully shape rope into a knot; tuck top end of knot under roll. Place roll on a prepared pan.",
    "Repeat procedure with remaining dough, placing 12 rolls on each pan. Lightly coat rolls with cooking spray; cover and let rise 30 minutes or until doubled in size.",
    "Preheat oven to 400°.",
    "Uncover rolls. Bake at 400° for 8 minutes with 1 pan on bottom rack and 1 pan on second rack from top. Rotate pans; bake an additional 7 minutes or until rolls are golden brown on top and sound hollow when tapped.",
    "Remove rolls from pans; place on wire racks. Brush rolls with 2 tablespoons butter. Serve warm or at room temperature."
  ],
  "ingredients": [
    "0",
    "1 package dry yeast (about 2 1/4 teaspoons)",
    "1 cupwarm 2% reduced-fat milk (100° to 110°)",
    "3/4 cupcanned mashed sweet potatoes",
    "3 tablespoonsbutter, melted and divided",
    "1 1/4 teaspoonssalt",
    "2 large egg yolks, lightly beaten",
    "5 cupsbread flour, divided",
    "Cooking spray"
  ],
  "__v": 1
}