{
  "hash": "8d0a9f6a2b14dcb117432cd2541c2a07c1582f11",
  "title": "Easy Vegetarian Ramen",
  "image": "http://ob8qxdtnu3-flywheel.netdna-ssl.com/wp-content/uploads/2016/03/Easy-Vegetarian-Ramen-020.jpg",
  "href": "http://www.acouplecooks.com/2016/03/easy-vegetarian-ramen/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+ACoupleCooks+%28A+Couple+Cooks%29",
  "extension": "Chrome",
  "firstAdded": "2016-03-02T16:02:12.509000",
  "users": [
    null
  ],
  "keywords": [
    "eggs",
    "garlic",
    "ginger",
    "sesame",
    "oil",
    "olive",
    "broth",
    "reduced",
    "sodium",
    "soy",
    "mirin",
    "shiitake",
    "mushrooms",
    "baby",
    "used",
    "young",
    "asian",
    "greens",
    "tatsoi",
    "peppers",
    "green",
    "onions",
    "ramen",
    "noodles",
    "possible",
    "radishes",
    "purchased",
    "chili"
  ],
  "directions": [
    "0",
    "Fill a medium pot of water and bring it to a boil, then reduce to a simmer. Gently lower the eggs into the water with a spoon and simmer for 7 minutes. Meanwhile, prepare a bowl of ice water. When the eggs are done, place them in the ice bath and let them cool completely, then gently peel. Keep the water in the pot and use it to cook the ramen (go to Step 4).",
    "Meanwhile, thinly slice 4 cloves garlic. Peel and mince 1 tablespoon ginger. In another pot, heat 1 tablespoon sesame oil and 1 tablespoon olive oil over medium high heat. Add the garlic and ginger and saute for 1 minute, stirring constantly. Add 1 quart broth and bring to a simmer. Add 3 tablespoons soy sauce and 1 tablespoon mirin.",
    "Remove the stems from the shiitake mushrooms and thinly slice them. If necessary, wash the greens. Thinly slice the sweet peppers and green onions (cut the onions on the bias). Thinly slice 4 radishes for a garnish, and set aside. Place the mushrooms in the broth and cook 5 minutes. Add peppers, green onion and greens and cook for 1 minute.",
    "Meanwhile, reheat the water used for the eggs and boil the ramen noodles until just tender, around 2 to 3 minutes.",
    "To serve, place noodles in a bowl and top with broth and vegetables. Garnish with radishes and garlic chili sauce."
  ],
  "ingredients": [
    "0",
    "4 eggs",
    "4 cloves garlic",
    "1 tablespoon ginger",
    "1 tablespoon sesame oil",
    "1 tablespoon olive oil",
    "1 quart vegetable broth",
    "3 tablespoons reduced sodium soy sauce",
    "1 tablespoon mirin",
    "8 ounces shiitake mushrooms",
    "4 cups young baby greens (we used a mix of young Asian greens and tatsoi)",
    "3 sweet peppers (optional)",
    "3 green onions",
    "16 ounces ramen noodles (fresh if possible)*",
    "4 radishes, for garnish",
    "Purchased garlic chili sauce, for garnish"
  ],
  "__v": 1
}