{
  "hash": "dd9ec480b58332c9ce8dcaba6c316b567057aa87",
  "title": "S’mores Pinwheels",
  "image": "",
  "href": "http://tiphero.com/smores-pinwheels/",
  "extension": "Chrome",
  "firstAdded": "2015-12-22T15:13:47.078000",
  "users": [
    null
  ],
  "keywords": [
    "smores",
    "pinwheels",
    "advertisement",
    "tiphero",
    "looking",
    "way",
    "wow",
    "friends",
    "family",
    "smile",
    "faces",
    "look",
    "cool",
    "amazing",
    "easy",
    "make",
    "check",
    "quick",
    "video",
    "follow",
    "pinterest",
    "tip",
    "hero",
    "offset",
    "spatula",
    "spray",
    "pressing",
    "parchment",
    "marshmallow",
    "creme",
    "easier",
    "spread",
    "rice",
    "krispies",
    "sticky",
    "mess",
    "instructions",
    "miniature",
    "marshmallows",
    "salted",
    "butter",
    "cereal",
    "graham",
    "cracker",
    "crumbs",
    "jar",
    "semisweet",
    "chocolate",
    "chips"
  ],
  "directions": [
    "0",
    "Melt the marshmallows and butter in the microwave in a medium bowl for 1½ minutes or until completely melted, stirring halfway through.",
    "While the marshmallows are melting, mix the Rice Krispies and the graham cracker crumbs together in a large bowl.",
    "Stir the melted marshmallow mixture into the Rice Krispies.",
    "Line a 10×15 jelly roll pan with parchment paper and spray with non-stick spray.",
    "Press the Rice Krispies in an even layer to fill the jelly roll pan (or as I did, a 13 x18 half-sheet pan that I filled ¾ full),",
    "Spread the marshmallow creme evenly over the cereal layer and top with the mini chocolate chips chips.",
    "Place the pan in a 200F oven for 2 minutes, just long enough to start melting the chocolate chips. Remove from the oven and spread the chocolate out in an even layer over the marshmallow creme.",
    "Using the parchment paper, carefully roll the Rice Krispies treat into a tight log.",
    "Refrigerate for one hour and slice into pinwheels once the chocolate and marshmallow are set.",
    "Share on Facebook"
  ],
  "ingredients": [
    "0",
    "S’mores Pinwheels",
    "ADVERTISEMENT",
    "TipHero",
    "Looking for a way to wow your friends and family and put a smile on their faces? These S’mores Pinwheels look so cool, taste amazing, and are almost too easy to make. Check out the quick video below:",
    "Advertisement",
    "Follow us on Pinterest >> Tip Hero",
    "Tip: Spray your offset spatula with non-stick spray before pressing the Rice Krispies onto the parchment and again when you spread the marshmallow creme on top of the Rice Krispies. This will make it easier to spread the Rice Krispies without becoming a sticky mess.",
    "Instructions:",
    "10 oz miniature marshmallows",
    "¼ cup salted butter",
    "5 cups Rice Krispies cereal",
    "¾ cup graham cracker crumbs",
    "7 oz jar marshmallow creme",
    "1 1/2 cups miniature semi-sweet chocolate chips"
  ],
  "__v": 1
}