{
  "__v": 1,
  "directions": [
    "0",
    "To make the brownies. Line an 8x8 or 9x9 inch baking dish with parchment paper or foil, letting the edges over hang from the pan so you can easily lift the brownies out of the pan. Preheat the oven to 325 degrees F.",
    "Add the butter and 2 ounces milk chocolate to a medium size mixing bowl that is microwave safe. Microwave the butter and chocolate on 30 second intervals, stirring after each interval until melted and smooth. This takes me about 1 minute and 30 seconds.",
    "To the melted chocolate mixture add the sugar and instant coffee, whisking until completely combined. Add the vanilla, kahula and egg and whisk until smooth. Stir in the cocoa powder, flour and salt until smooth and just combined, try not to over mix the batter. It will be thick. Stir in the remaining 4 ounces chopped milk chocolate. Pour the batter into the prepared pan and bake for 25-30 minutes, until the brownies are set on top. Do not over bake, if anything under bake.",
    "Meanwhile make the truffles. Add the 3 ounces semi-sweet chocolate and the cream to microwave safe bowl. Microwave the chocolate and cream on 30 second intervals, stirring after each interval until melted and smooth. This takes me about 1 minute. Stir in the peanut butter and kahlua until smooth.",
    "Remove the brownies from the oven and let the brownies cool 5 minutes and then lift them out of the pan. Pour the chocolate truffle/ganache right over the brownies and smooth it out until it reaches the edge. Melt the remain 4 ounces of milk chocolate and then drizzle it over the brownies. Allow the brownies to set at least one hour in the fridge or two hours at room temperature (out of the sun) before cutting. I personally like them best at room temp so everything is soft and fudgey."
  ],
  "firstAdded": "2014-10-23T14:29:10.424000",
  "hash": "5f5b55169793b86d8db9c6df5d096835092a69ed",
  "href": "http://www.halfbakedharvest.com/milk-chocolate-peanut-butter-truffle-brownies/",
  "image": "http://www.halfbakedharvest.com/wp-content/uploads/2013/12/Milk-Chocolate-Peanut-Butter-Truffle-Brownies-4.jpg",
  "ingredients": [
    "0",
    "10 tablespoons unsalted butter",
    "2 ounces milk chocolate, chopped",
    "1 cup granulated sugar",
    "1 tablespoon instant coffee",
    "2 teaspoons vanilla extract",
    "1 tablespoon kahlua (optional, but so good!)",
    "2 large eggs",
    "1/2 cup cocoa powder (sometimes I use Hersey's Dark Chocolate Cocoa, but for these brownies I recommend sticking with regular Cocoa)",
    "1/2 cup all-purpose flour",
    "1/4 teaspoon kosher salt",
    "4 ounces milk chocolate chopped",
    "3 ounces semi-sweet chocolate, chopped",
    "3 tablespoons heavy cream",
    "2 tablespoons creamy peanut butter",
    "1/2 tablespoon kahlua",
    "3 ounces milk chocolate, chopped"
  ],
  "keywords": [
    "unsalted",
    "butter",
    "milk",
    "chocolate",
    "granulated",
    "sugar",
    "instant",
    "coffee",
    "vanilla",
    "kahlua",
    "good",
    "eggs",
    "use",
    "herseys",
    "dark",
    "brownies",
    "recommend",
    "sticking",
    "regular",
    "cocoa",
    "allpurpose",
    "flour",
    "kosher",
    "salt",
    "semisweet",
    "cream",
    "creamy",
    "peanut"
  ],
  "title": "Milk Chocolate Peanut Butter Truffle Brownies",
  "users": [
    null
  ]
}