{
  "hash": "1c16373a1e3ce853d2d5a260f0d0ddbc155753ab",
  "title": "Da Paolino garlic lemon chicken",
  "image": "//gbc-cdn-public-media.azureedge.net/img58634.1426x713.jpg",
  "href": "http://www.greatitalianchefs.com/recipes/roast-lemon-chicken-recipe",
  "extension": "Chrome",
  "firstAdded": "2017-02-12T16:14:19.670000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "The day before serving, add the chicken, half of the garlic cloves, peppercorns, fennel seeds, lemon slices and some olive oil to a bowl big enough to comfortably hold all of the ingredients and season liberally with salt and pepper",
    "2",
    "Mix everything to combine with your hands, then use the halved lemons and remaining garlic to stuff the cavity of the chicken. Cover with cling film and place in the fridge overnight to marinate",
    "3",
    "When ready to cook, preheat the oven to 190°C/gas mark 5 and line a roasting tin with baking parchment",
    "4",
    "Transfer the contents of the bowl to the tray and add the fennel, making sure you coat it well in the marinade ingredients",
    "5",
    "Place the chicken on top, breast-side down, and season well. Roast in the oven for 30 minutes",
    "6",
    "After this time, remove the roasting tray from the oven and turn the chicken breast-side up, giving the vegetables a stir. Return to the oven for 35 minutes",
    "7",
    "Remove the tray from the oven once more and turn the bird over carefully. Squash some lemon pieces and garlic into the flesh and return to the oven for 15 more minutes, until golden",
    "8",
    "To see if the chicken is cooked, pull one of the legs away from the body – it should easily fall away once ready. Serve with the fennel, some salad and a sprinkling of chives"
  ],
  "ingredients": [
    "0",
    "Da paolino garlic lemon chicken",
    "1.5kg chicken, whole, free-range",
    "3 garlic bulbs, separated and peeled (about 30 cloves)",
    "2 tsp pink peppercorns",
    "1 tsp fennel seeds",
    "6 lemons, 1 sliced, 5 halved",
    "extra virgin olive oil, 2–3 tbsp",
    "3 fennel bulbs, quartered",
    "salad leaves, to serve",
    "1 handful of chopped chives, to serve",
    "sea salt",
    "freshly ground black pepper"
  ],
  "__v": 1
}