{
  "hash": "340856784bee92602f4c7ef5d0c030ce60d3772e",
  "title": "Chorizo Bolognese Pasta with Sourdough Pangrattato + Burrata.Heather | Delicious Not GorgeoushalfbakedharvestMirandahalfbakedharvestLynnehalfbakedharvestTom @ RYGhalfbakedharvestTaylor @ Food Faith FitnesshalfbakedharvestTorihalfbakedharvestMarisa Franca @ All Our WayhalfbakedharvestSerene @ House of YummhalfbakedharvestLiza vogeshalfbakedharvestnancyabchalfbakedharvestDeborah @ The Harvest KitchenhalfbakedharvestAmyhalfbakedharvestEmilyhalfbakedharvestMichelle @ Hummingbird HighhalfbakedharvestCharityhalfbakedharvestKara | Sorghum and StarchhalfbakedharvestPaytonhalfbakedharvestNicole @ Young, Broke and HungryhalfbakedharvestLaura (Tutti Dolci)halfbakedharvestMary Ann | The Beach House KitchenhalfbakedharvestAmandaAmandahalfbakedharvestClaire rhodeshalfbakedharvestAsha ShivakumarBrianna DannerBrenda @ a farmgirl's dabblesKathy H.SabrinaRenee @ Awesome on 20halfbakedharvestMaliahalfbakedharvestShannonhalfbakedharvestSarah NhalfbakedharvestAJ Craig-Salmon",
  "image": "http://www.halfbakedharvest.com/wp-content/uploads/2015/12/Chorizo-Bolognese-Pasta-with-Sourdough-Pangrattato-Burrata-11.jpg",
  "href": "http://www.halfbakedharvest.com/chorizo-bolognese-pasta-sourdough-pangrattato-burrata/",
  "extension": "Chrome",
  "firstAdded": "2016-10-30T18:45:59.618000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat a large dutch oven over medium heat. Add the olive oil and once hot, add the chorizo and brown all over, breaking up the meat as it cooks. Toss in the garlic and continue cookies for another minute. Stir in the tomatoes, whole milk, red wine, sun-dried tomato pesto, basil, oregano, crushed red pepper flakes and a pinch of salt + pepper to taste.",
    "Simmer the sauce over medium low heat for 20-30 minutes or until it has slightly reduced. If you have time, I recommend making the sauce in the morning and allowing it to simmer, covered, all day long. The longer the sauce cooks, the more flavor it will have.",
    "Meanwhile, make the pangrattato. Preheat the oven to 350 degrees F. Line a baking sheet with parchment paper. Place the prosciutto slices on baking sheet and bake for 10-15 minutes or until crisp. Remove and allow to cool, then add to a food processor along with pistachios and toasted sourdough bread, process until fine crumbs. Add the butter to a large skillet or brasier with high sides. Allow the butter to brown lightly until it smells toasted, about 2 minutes. Now add the bread crumb mixture. Toast the mixture for about 5 minutes or until the bread crumbs are golden. If the bread crumbs seem as though they need more butter, add another 2 tablespoons. Season with salt and pepper. Remove the pangrattato from the skillet and set aside until ready to serve.",
    "To make the pasta, add the sage, baby kale, olive oil and manchego cheese to a food processor and process until you have a pesto. Season with salt + pepper.",
    "Bring a large pot of salted water to a boil. Boil the pasta until al dente. Scoop out 1 cup of the pasta cooking water and then drain. Return the pasta to the hot pot and toss with the sage/kale pesto mixture and as much of of the pasta cooking water as needed to create a sauce.",
    "Divide the pasta among plates or bowls. Top each bowl with some chorizo bolognese and sprinkle with the pangrattato. Add a few pieces of torn burrata + a pinch of pepper. EAT."
  ],
  "ingredients": [
    "0",
    "2 tablespoons olive oil",
    "1 pound ground chorizo (or chorizo links with the casing removed, do not use dried chorizo)",
    "2 cloves garlic, minced or grated",
    "1 (28 ounce) can whole peeled san marzano tomatoes, crushed with your hands",
    "1/2 cup whole milk",
    "1/2 cup red wine",
    "1/2 cup sun-dried tomato pesto (I use DeLallo Brand)",
    "2 teaspoons dried basil",
    "1 teaspoon dried oregano",
    "1/2 teaspoon crushed red pepper flakes (or to taste)",
    "1 dried bay leaf",
    "salt + pepper, to taste",
    "8 ounces fresh burrata cheese, torn",
    "4-6 ounces thin sliced prosciutto",
    "2 thickish slices sourdough bread (use a gluten free bread if needed), toasted",
    "1/2 cup shelled, toasted pistachios",
    "2 tablespoons unsalted butter",
    "salt and pepper, to taste",
    "1/2 cup fresh sage leaves",
    "1 1/2 cups baby kale",
    "1/3 cup olive oil",
    "1/2 cup manchego cheese, grated",
    "1 pound dry fettuccine"
  ],
  "__v": 1
}