{
  "__v": 1,
  "directions": [
    "0",
    "Place the grated zucchini in a bowl and toss with 1/2 tsp salt. Let it sit for 10 minutes, then squeeze the zucchini with your hands to ring out any excess water.",
    "In a frying pan, fry the garlic and onions with 1 tbsp of butter on low-medium heat, until the onions are translucent. Add the corn kernels and cook for 5 minutes until soft.",
    "In a large bowl, combine the flour, cornmeal, and baking powder. Make a well in the middle of the flour and add the egg and milk. Combine with a wire whisk. Add the corn mixture (and then place the frying pan back on the stove to use for frying the fritters), and then stir in the zucchini, Parmesan cheese, and season with salt and pepper.",
    "Add a tbsp of butter to the frying pan. When the butter is sizzling, ladle in 3 heaping half cup scoops of the mixture. Fry on each side for a couple of minutes until golden brown. It is important to have the frying pan at a medium hotness, so that you can get that nice crisp brownness on the outside of the fritters. Before frying the second batch, add a tbsp of butter to the pan.",
    "Serve warm with a dollop of sour cream, fresh chives, and fresh squeezed lemon juice. Can be kept in the fridge for a couple of days and reheated in the oven or frying pan before eating."
  ],
  "firstAdded": "2014-08-09T18:54:33.515000",
  "hash": "a553ab6e51265f8a9b5fffcfe3dbd9913db52895",
  "href": "http://www.flourishingfoodie.com/2014/08/zucchini-and-corn-parmesan-fritters.html",
  "image": "http://1.bp.blogspot.com/-eg7Uh5Vm0JY/U-FGtmzpRKI/AAAAAAAAonE/MfDEWQwd3eY/s1600/IMG_1279-1.jpg",
  "ingredients": [
    "0",
    "2 medium zucchini, grated",
    "1/2 tsp salt, plus more for seasoning",
    "3 tbsp butter, unsalted or salted",
    "1/2 small onion, diced",
    "2 garlic cloves, minced",
    "2 cobs corn, kernels removed",
    "1/2 cup all purpose flour",
    "1/2 cup cornmeal",
    "1/2 tsp baking powder",
    "1 large egg",
    "1 cup milk, low fat or whole",
    "1/2 cup Parmesan cheese, grated",
    "garnishes:",
    "sour cream",
    "chives, chopped",
    "lemon juice"
  ],
  "keywords": [
    "medium",
    "zucchini",
    "salt",
    "seasoning",
    "butter",
    "unsalted",
    "salted",
    "onion",
    "garlic",
    "cobs",
    "corn",
    "kernels",
    "purpose",
    "flour",
    "cornmeal",
    "baking",
    "egg",
    "milk",
    "low",
    "fat",
    "parmesan",
    "cheese",
    "garnishes",
    "sour",
    "cream",
    "chives",
    "lemon",
    "juice"
  ],
  "title": "ZUCCHINI AND CORN PARMESAN FRITTERS\nmakes 6 large fritters",
  "users": [
    null
  ]
}