{
  "hash": "14a16c11a7bd22880a7568103a2550d7fda9b765",
  "title": "Asian Quinoa Bowls with Baked Tofu",
  "image": "https://www.simplyquinoa.com/wp-content/uploads/2017/05/asian-quinoa-bowls-baked-tofu-3-150x150.jpg",
  "href": "https://www.simplyquinoa.com/asian-quinoa-bowls-with-peanut-baked-tofu/",
  "extension": "Chrome",
  "firstAdded": "2020-03-01T12:54:45.017000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Add quinoa, ginger, 1 teaspoon tamari, water and 1 cup of almondmilk coconutmilk blend into a small saucepan. Bring mixture to a boil, cover and reduce to simmer for 15 minutes. Once liquid has been absorbed, set aside until ready to serve.",
    "While the quinoa is cooking, preheat the oven to 400ºF. Grease a baking sheet and set aside.",
    "In a small bowl, whisk together peanut butter, remaining 1/4 cup of almondmilk coconutmilk blend, remaining 2 teaspoons of tamari, lime juice and hot sauce. Continue to whisk until smooth and pourable (add a splash more almondmilk as needed).",
    "Add tofu to a mixing bowl and toss with half of the peanut dressing. Transfer the tofu to the greased baking sheet and bake for 30 minutes until crispy, flipping halfway through.",
    "Once tofu is done, assemble your bowls. Divide the quinoa, tofu, cabbage, carrots and scallions evenly among 4 bowls. Drizzle each with the remaining dressing and sprinkle with cilantro and sesame seeds. Enjoy immediately!"
  ],
  "ingredients": [
    "0",
    "1 cup uncooked quinoa",
    "1 teaspoon ground ginger",
    "3 teaspoons tamari divided",
    "1 cup water",
    "1 1/4 cups Almond Breeze Almondmilk Coconutmilk Blend divided",
    "1/4 cup peanut butter",
    "Juice of 1 lime",
    "1 teaspoon Asian hot sauce like sriracha",
    "1 block extra firm tofu cubed",
    "2 cups shredded cabbage",
    "2 cups shredded carrots",
    "1 bunch scallion sliced",
    "1/4 cup chopped cilantro",
    "Sesame seeds to garnish optional"
  ],
  "__v": 1
}