{
  "hash": "0573d151068e830f8437d1e2cab1d42d775e4ba7",
  "title": "Buttermilk Biscuit",
  "image": "https://imagesvc.timeincapp.com/v3/mm/image?url=https%3A%2F%2Fcdn-image.myrecipes.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2Fmedium_2x%2Fpublic%2Four-favorite-buttermilk-biscuit-sl.jpg%3Fitok%3DoITLSzpA&w=800&q=85",
  "href": "https://www.myrecipes.com/recipe/our-favorite-buttermilk-biscuit",
  "extension": "Firefox",
  "firstAdded": "2018-09-12T01:17:17.304000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "How to Make It",
    "Step 1",
    "Preheat oven to 475°. Grate frozen butter using large holes of a box grater. Toss together grated butter and flour in a medium bowl. Chill 10 minutes.",
    "Step 2",
    "Make a well in center of mixture. Add buttermilk, and stir 15 times. Dough will be sticky.",
    "Step 3",
    "Turn dough out onto a lightly floured surface. Lightly sprinkle flour over top of dough. Using a lightly floured rolling pin, roll dough into a 3/4-inch-thick rectangle (about 9 x 5 inches). Fold dough in half so short ends meet. Repeat rolling and folding process 4 more times.",
    "Step 4",
    "Roll dough to 1/2-inch thickness. Cut with a 2 1/2-inch floured round cutter, reshaping scraps and flouring as needed.",
    "Step 5",
    "Place dough rounds on a parchment paper-lined jelly-roll pan. Bake at 475° for 15 minutes or until lightly browned. Brush with melted butter.",
    "Step 6",
    "For Pillowy Dinner Rolls: Cut in 1/2 cup cold shortening instead of cold butter. You'll get a soft biscuit that stays tender, even when cool. Plus, shortening has a neutral flavor that will complement anything on your dinner plate.",
    "Step 7",
    "For Sweet Shortcakes: Add 2 Tbsp. sugar to the flour, and replace buttermilk with heavy cream. The sugar lends the biscuits a subtle sweetness, and the extra fat in heavy cream gives them a crumbly texture like shortbread. They're the perfect base for shortcake desserts.",
    "Step 8",
    "For Crunchy-Bottomed Biscuits: Warm a cast-iron skillet in the oven, and spread a bit of butter in the skillet before adding the biscuits. The bottoms will end up crunchy and golden brown and provide a sturdy base that holds up to a smothering of sausage gravy.",
    "Step 9",
    "For Pickle Biscuits: Why didn't we think of these sooner? Stir 4 Tbsp. drained dill pickle relish into buttermilk before adding to flour mixture. Split baked biscuits, and top with ham and mustard for the World's Best Ham Sandwich! We promise."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1/2 cup butter (1 stick), frozen 2 1/2 cups self-rising flour 1 cup chilled buttermilk Parchment paper 2 tablespoons butter, melted"
  ],
  "__v": 1
}