{
  "__v": 1,
  "directions": [
    "0",
    "Pre heat the oven to 160 degrees fan assisted or 180 degrees unassisted. Gas mark 4.",
    "- First whisk the eggs and sugar in a food processor until thick and pale.",
    "- Then add ground almonds, cooked orange (the whole orange! Peel included) and bicarbonate of soda to the processor and mix again until the ingredients have blended thoroughly until there are no large lumps of orange.",
    "- Pour mixture into greased cake tin and then place in the oven to cook. Check with a skewer, if it comes out clean its ready. Remove from the oven and leave to cool in the tin.",
    "- When the cake has cooled remove from the tin. It’s time to make the ganache. For this simply melt the chocolate in a bowl that is over a saucepan of boiling water, then add the cream, mix thoroughly before pouring over the cooled cake.",
    "- Cover the top and the sides nicely with the chocolate (start in the centre work outwards) and then place in the fridge for the ganache to set.",
    "Please note: Ovens do vary which can alter cooking times so please bare that in mind. Now get cooking that cake.",
    "Enjoy"
  ],
  "firstAdded": "2014-09-01T14:59:22.221000",
  "hash": "df23e07700e9e8229c7fe25a6a90354d08b6597f",
  "href": "http://fitterlondon.co.uk/food/paleo-chocolate-orange-cake/",
  "image": "http://fitterlondon.co.uk/wp-content/uploads/2013/05/987c7914b03711e2ad7a22000a9f3090_7-186x136.jpg",
  "ingredients": [
    "0",
    "1 medium orange boiled for 1 hour. Simply place the orange in a saucepan, cover with water and boil for 1 hour until soft and tender, once boiled discard the water and leave the orange to cool. You can do this the night before. Be sure to cut the orange in half and remove the pips before you use it.",
    "4 eggs",
    "170g coconut palm sugar or honey",
    "225g ground almonds",
    "1 tsp of bicarbonate of soda",
    "Grass fed butter (to grease your cake tin)",
    "For the chocolate ganache:",
    "150g of 70-85% chocolate",
    "100ml of double cream"
  ],
  "keywords": [
    "medium",
    "simply",
    "saucepan",
    "cover",
    "boil",
    "hour",
    "soft",
    "tender",
    "boiled",
    "discard",
    "water",
    "leave",
    "cool",
    "night",
    "sure",
    "orange",
    "pips",
    "use",
    "eggs",
    "coconut",
    "palm",
    "sugar",
    "honey",
    "almonds",
    "bicarbonate",
    "soda",
    "grass",
    "fed",
    "butter",
    "grease",
    "cake",
    "tin",
    "chocolate",
    "ganache",
    "double",
    "cream"
  ],
  "title": "Paleo Chocolate Orange Cake",
  "users": [
    null
  ]
}