{
  "hash": "24811c32c272f05227474e0f2aafa65e55d1fc26",
  "title": "Chicken-Tortilla Soup",
  "image": "https://assets.marthastewart.com/styles/wmax-300/d21/a99114_0102_salsasoup/a99114_0102_salsasoup_xl.jpg?itok=d3vfryLU",
  "href": "https://www.marthastewart.com/348964/chicken-tortilla-soup",
  "extension": "Chrome",
  "firstAdded": "2018-02-04T16:37:42.844000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large saucepan, combine chicken, 2 cups cilantro, broth, and water. Bring to a boil, reduce heat, and simmer gently until chicken is just cooked through, about 10 minutes. Transfer chicken to a plate; let cool. Cut into 1/2-inch dice. Strain broth through a fine strainer lined with several layers of cheesecloth; reserve. Wipe out pot.",
    "2.",
    "Heat 1/2 tablespoon oil in a cast-iron skillet on medium-high until hot. Add 3 tomatoes, onions, and garlic; cover and cook, turning vegetables occasionally, until skins are nicely charred, about 10 minutes. Remove from heat. When vegetables are cool enough to handle, remove skins, stems, and cores; discard. Place tomatoes, onions, and garlic in a blender with 1/2 cup reserved broth; blend until smooth. Scrape mixture into saucepan; cook, stirring, over medium heat until thickened and darker, about 6 minutes. Stir in remaining broth, 1/4 teaspoon salt, corn, chickpeas, and chicken. Remove from heat.",
    "3.",
    "Preheat oven to 375 degrees. Place tortilla strips on a rimmed baking sheet; toss with remaining tablespoon oil and 1/8 teaspoon salt. Bake until golden and crisp, about 12 minutes, turning once or twice. Cool.",
    "4.",
    "Finely dice avocado; gently rinse with cold water. Place in a bowl. Finely dice remaining tomato, and add to avocado with lime juice, jalapeno, chopped cilantro, and remaining 1/8 teaspoon salt. Re-warm soup; ladle into bowls. Garnish with avocado mixture, sour cream, and tortilla strips."
  ],
  "ingredients": [
    "0",
    "1 1/4 pounds boneless skinless chicken breast halves (3 to 4 pieces)",
    "2 cups cilantro stems and sprigs plus 2 tablespoons finely chopped cilantro",
    "Two 14 1/2-ounce cans low-sodium chicken broth, skimmed of fat",
    "3 cups water",
    "1 1/2 tablespoons corn oil",
    "4 plum tomatoes",
    "Tomatoes On the Vine$1.98 thru 02/14",
    "2 small onions, halved lengthwise (unpeeled)",
    "4 garlic cloves (unpeeled)",
    "1/2 teaspoon coarse salt",
    "Great Value Iodized Salt, 26 ozIn Stores OnlySee Everyday Low Price",
    "1 1/4 cups fresh or frozen corn kernels",
    "3/4 cup rinsed, drained canned chickpeas",
    "5 fresh corn tortillas (5 1/2-inch diameter), cut in 1/4-inch-wide strips",
    "1/2 small avocado",
    "2 tablespoons freshly squeezed lime juice",
    "1 tablespoon minced jalapeno",
    "3 tablespoons reduced-fat sour cream"
  ],
  "__v": 1
}