{
  "hash": "77ddf7708ce212067e95e82c380304fd2ab8f501",
  "title": "Parmesan-Rosemary Flatbread Crackers",
  "image": "",
  "href": "http://www.myrecipes.com/recipe/parmesan-rosemary-flatbread-crackers",
  "extension": "Chrome",
  "firstAdded": "2016-08-07T14:27:56.026000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place a baking sheet on the middle rack in oven. Preheat oven to 425° (keep pan in oven as it preheats).",
    "Weigh or lightly spoon flour into dry measuring cups; level with a knife. Combine flour and next 5 ingredients (through cheese) in a large bowl. Make a well in center of mixture; add 1/2 cup water and butter. Stir with a wooden spoon until dough pulls together in a shaggy mass. Turn dough out onto a lightly floured work surface; knead gently 6 to 8 times or until the dough is smooth and soft.",
    "Divide dough into 8 equal portions. Working with 1 portion at a time (keep remaining portions covered with a damp towel to prevent drying), divide into 3 equal pieces. Place the 3 dough pieces 3 inches apart in the center of a baking sheetsized piece of parchment paper. Top with another piece of parchment paper. Roll dough pieces into long oval shapes, about 6 x 3 inches (dough will be very thin). Carefully remove the top piece of parchment. Sprinkle dough lightly with salt, pressing to adhere. Place parchment with rolled dough on the preheated baking sheet. Bake at 425° for 5 minutes or until crackers are browned in spots. Remove parchment and crackers from oven, and place on a wire rack to cool. Repeat procedure with the remaining dough and salt."
  ],
  "ingredients": [
    "0",
    "6.75 ounces all-purpose flour (about 1 1/2 cups)",
    "3 tablespoons finely ground flaxseed meal",
    "1 1/2 tablespoons chopped fresh rosemary",
    "1 teaspoon baking powder",
    "1/4 teaspoon freshly ground black pepper",
    "1.5 ounces Parmigiano-Reggiano cheese, grated (about 1/3 cup)",
    "1/2 cup water",
    "1/3 cup butter, softened",
    "1 1/2 teaspoons kosher salt"
  ],
  "__v": 1
}