{
  "hash": "42e86932571b8cec4356394590cf273fb82c390e",
  "title": "Crushed Peas with Smoky Sesame Dressing",
  "image": "https://i1.wp.com/farm5.static.flickr.com/4041/4682926514_96dfb7889e_z.jpg",
  "href": "https://smittenkitchen.com/2010/06/crushed-peas-with-smoky-sesame-dressing/",
  "extension": "Chrome",
  "firstAdded": "2018-08-07T16:44:45.630000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cook peas: Have ready a colander and an ice bath, and bring a medium pot of lightly salted water to a boil. Blanche peas for 30 seconds (if you like them with a real residual snap) to 1 minute (for a slightly more yielding pea) and drain them, then immediately shocking them in the ice water. Drain the peas again and pat them dry on a large towel.",
    "Crush peas: Using a potato or egg-masher (and hopefully not an annoying one like mine, with holes the exact size of peas!), muddler or meat pounder (be gentle!), lightly crush the peas. Aim for mixed textures, some left whole, most in halves and a few a little more broken up. Put them in a large bowl.",
    "Make dressing: Whisk together tahini, yogurt, lemon juice, water, cumin, paprika and salt. You might be tempted, as I was, to swap the water with olive oil but don’t do it — it makes a horrible curdled mess you will be sad to have to toss.",
    "Assemble: Mix peas with about 3 tablespoons of the dressing, to start, then add more to taste. Sprinkle with scallions. Heap pea mixture on toasted pita wedges."
  ],
  "ingredients": [
    "0",
    "1 1/2 pounds fresh peas in pods or about 1 1/2 cups already shelled or frozen and defrosted",
    "1/4 cup plain yogurt",
    "2 tablespoons tahini (sesame seed paste)",
    "1 tablespoon lemon juice",
    "2 tablespoons water",
    "1/4 teaspoon ground cumin",
    "1/4 teaspoon paprika, smoked if you have it",
    "1/4 teaspoon salt",
    "1 scallions, thinly sliced",
    "Toasted pitas, cut into wedges, for serving"
  ],
  "__v": 1
}