{
  "hash": "d8b158d68935ce8eafccc9ff97424f390960caa4",
  "title": "How To Temper Chocolate Without a Thermometer",
  "image": "http://atmedia.imgix.net/4e673aa4f004db12de94380589f07ef68236b245?auto=compress&w=640.0&fit=max",
  "href": "http://www.thekitchn.com/how-to-temper-chocolate-without-a-thermometer-cooking-lessons-from-the-kitchn-196475",
  "extension": "Chrome",
  "firstAdded": "2017-01-16T11:50:00.604000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Conditions",
    "A cold room (room temp or below), low humidity – do not attempt before a thunderstorm!",
    "Instructions",
    "Heat the water: Fill the pot with water and bring it up to a simmer. Turn off the heat.",
    "Begin melting the chocolate: Make sure your bowl is very dry, as any drops of water will seize up the chocolate. Put about 2/3 of your chocolate in the bowl and place it over the water. The water should be touching a large area of the bottom of the bowl. Be very careful that the water does not splash into the bowl. Do not stir! Let the chocolate sit in bowl over the hot water, uncovered, until it is about 2/3 melted.",
    "Stir until completely melted: After the chocolate is about 2/3 melted, gently stir it and allow it to melt further. Letting the chocolate partially melt before stirring prevents creating large clumps of solid chocolate glued together by melted, now re-solidified chocolate. Be very careful not to allow any water into the bowl.",
    "Test the temperature of the chocolate: Lift the spatula up to your lower lip and dab a small dot onto the place just below your lower lip. It should sting slightly (but not too much!).",
    "Add remaining chocolate: Remove the bowl from the water and set it on a folded kitchen towel to absorb any water from the bottom of the bowl. Stir in the remaining chocolate (the 'seed'). Stir slowly and gently until the chocolate is completely melted. The chocolate will begin to thicken and become less shiny and more matte as it cools. This part of the process can take up to half an hour. If you want to speed things up, take the bowl to a cooler place (outside, for example – but not the rain!).",
    "Test again for temperature: Once all the seed chocolate has melted, touch the spatula to your lower lip area again. The chocolate should feel cooler than your body temperature. If it feels warmer than your skin, you can drop in a few more pieces of chocolate and keep stirring. If you don’t feel anything, this means the chocolate is at about your body temperature, and you need to keep stirring gently until it cools down. When it is ready it will feel refreshing on your skin. You are now ready to dip your ganache!",
    "Keeping the chocolate in temper. Continue to stir the chocolate as you dip. If the chocolate cools too much, turns matte, and begins to thicken, place the bottom of the bowl back into the hot water for 1 or 2 seconds. Remove quickly and stir the warmer chocolate up from the bottom and throughout the bowl. Test to be sure it has not gotten too hot and resume dipping."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Good quality chocolate, between 60-70%",
    "Equipment",
    "Medium pot for heating water",
    "Metal that will fit snuggly in the pot",
    "Kitchen towel",
    "Rubber or silicone spatula"
  ],
  "__v": 1
}