{
  "hash": "ee0202ffa2083065196a5f5f064faccb37aa19c2",
  "title": "Chicken Bellagio",
  "image": "http://recipe-folder.com/img/recipe-images/034/099/368426434.jpg",
  "href": "https://www.textise.net/showText.aspx?strURL=http%253A//www.chefdehome.com/Recipes/652/chicken-bellagio-cheesecake-factory-copycat",
  "extension": "Chrome",
  "firstAdded": "2017-04-11T20:08:32.606000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "Parmesan Cream Sauce - In pan, add heavy cream, and half of chicken and boil until thick and cream (2-3 minutes). Add white wine, whisk in well, heat to boil-off the alcohol. (1-2 minutes). Add parmesan cheese and cook for another 2 minutes on medium heat or until cheese has melted. Once sauce has thickened and cheese has melted, season sauce with salt, nutmeg, and black pepper. Remove from heat and set aside (leave sauce in pan for re-heating).",
    "Additional Notes Also, if serving arugula salad, toss arugula with oil, lemon, salt and pepper and set aside.",
    "Crispy Pan Fried Chicken - Heat a non-stick or cast-iron pan on medium heat with few tbsp of oil. While pan is heating, in three wide plates add all purpose flour, beaten egg and bread crumbs separately. Season each with generous pinch of salt and black pepper. In breadcrumbs, add mix cayenne Pepper (or pepper flakes if using) with little extra salt. Place the butter-flied chicken into a ziplock or two pieces of plastic and pound gently to flatten to a 1/2 inch thickness",
    "Additional Notes You can cut each butterfly into two halves. I used a bigger pan, so sauted whole butterfly.",
    "Dredge each chicken piece in flour and shake-off the excess. Coat in egg wash, then place in breadcrumb mix and pat to stick a good coat of seasoned breadcrumbs onto chicken. You can cut each butterfly into two halves. I used a bigger pan, so sauted whole butterfly.",
    "Place chicken in heated skillet and cook for 3 minutes each side.",
    "Until chicken coating is crispy brown and chicken is cooked through. Repeat steps 4-7 for remaining chicken.",
    "Veggie Spiral Pasta in Cream Sauce - Once chicken has cooked, from same pan (heat on) whip-off excess oil with paper towel. Add 1 tbsp butter, increase heat to high, and add spiralized squash and carrots. Saute 1-2 minutes until veggie pasta is crisp tender.",
    "While pasta is cooking, return the cream sauce to heat and add remaining chicken stock to loosen the sauce. Add half of sauce into pasta and coat gently.",
    "Remove pasta in two serving plates, top each with crispy fried pan-fried chicken and drizzle remaining sauce on top dividing equally in two plates. Add arugula on the side and serve!"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Parmesan Cream Sauce",
    "1/2 Cup Parmesan Cheese",
    "1/2 Cup Heavy Cream",
    "1/2 Cup Chicken Stock (low sodium)",
    "1/4 Cup White Wine (or 2 tbsp lemon juice)",
    "pinch Nutmeg",
    "1-2 tsp Salt and Black Pepper (divided, adjust per taste)",
    "Crispy Pan Fried Chicken",
    "1 lbs Chicken (2 boneless chicken breasts, butterflied)",
    "1/2 Cup Breadcrumbs (preferably panko)",
    "1/4 Cup All-Purpose Flour",
    "1 Egg(s) (well beaten with 1 tablespoon of water)",
    "1/2 Cayenne Pepper (or pepper flakes)",
    "Canola Oil (3-4 tbsp for shallow frying)",
    "Pasta",
    "2 Yellow Squash (spiralized using number 3-blade or use regular pasta)",
    "2 Carrots (spiralized using number 3-blade )",
    "Spiral pasta",
    "1/4 Cup Parsley (fresh chopped)",
    "1 tbsp Butter",
    "For Serving (optional)",
    "2 Cup Arugula",
    "1 tbsp Olive Oil",
    "1 tbsp Lemon (juice)"
  ],
  "__v": 3
}