{
  "hash": "8709f7a65c1adc3b1a56806fe7134a9a984f1f65",
  "title": "Curried Greens and Chickpeas",
  "image": "http://i1.wp.com/www.ourlittleapartment.com/wp-content/uploads/2014/02/Curried-Kale-Tofu-1-of-1.png?resize=740%2C493",
  "href": "http://www.ourlittleapartment.com/recipe-curried-greens-chickpeas/",
  "extension": "Chrome",
  "firstAdded": "2016-07-01T12:10:11.158000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat a 4 qt pot over medium heat. Pour 1 tsp of the oil into the pot and use a spatula to coat the bottom. Add the coriander seeds. Cover the pot and let the seeds pop for about a minute, or until the popping slows down, mixing once. If the seeds don’t pop, turn up the heat a bit until they do. Add the other tsp of oil and saute the onion 4 to 7 minutes, until translucent. Use a little nonstick cooking spray if needed. Add the garlic, ginger and red pepper flakes, and saute for another minute. Add the tomatoes and mix to deglaze the pot. Let cook for about 3 minutes, then add the curry, cumin, coriander, garam masala and salt and mix well.",
    "*Mincing the kale involved putting it all in a big bowl and grabbing a pair of kitchen scissors and chopping like crazy! You might have a better way, but this was fun.",
    "*If you’re using tofu – cube it and cook it for 10 minutes in a skillet that’s been sprayed with olive oil, adding a few splashes of soy sauce halfway through cooking. Be sure to turn it a lot so it gets nice and crispy.",
    "Add the chickpeas or tofu and spinach, mixing well. Cover the pot, let simmer for a few minutes, stirring occasionally, until the spinach has thawed and heated through. Simmer and cook covered for 10 or 15 minutes, to allow everything to heat through and meld together.",
    "Taste for salt and serve.",
    "Number of Servings: 6"
  ],
  "ingredients": [
    "0",
    "2 tsp olive oil",
    "2 tsp coriander seeds",
    "1 small onion, diced",
    "4 cloves garlic, minced",
    "2 tbsp minced fresh ginger (I didn’t have any, so I left it out)",
    "1/2 tsp red pepper flakes",
    "1 tbsp curry powder",
    "2 tsp ground cumin",
    "1 tsp garam masala",
    "1 tsp salt",
    "1 (12 oz) can crushed tomatoes (or 1 large tomato, diced)",
    "1 lb greens minced* (I used kale with a bit of spinach)",
    "Either:",
    "14 oz cooked chickpeas, drained and rinsed, or",
    "16 oz tofu, cubed and pan-fried*"
  ],
  "__v": 1
}