{
  "hash": "f0d37d69ed65beda1caa2a994f84dd9d43045e9f",
  "title": "Pollo Diablo (Garlicky, Spicy, Deep-fried Chicken)",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/pollo-diablo-garlicky-spicy-deep-fried-chicken-recipe.html",
  "firstAdded": "2015-01-24T15:41:39.728000",
  "users": [
    null
  ],
  "keywords": [
    "corn",
    "oil",
    "deep",
    "frying",
    "egg",
    "whites",
    "quarters",
    "skinless",
    "chicken",
    "boned",
    "pieces",
    "garlic",
    "salt",
    "black",
    "pepper",
    "cornstarch",
    "yellow",
    "onion",
    "green",
    "red",
    "serrano",
    "jalapeno",
    "hot",
    "chili",
    "divided",
    "sesame",
    "onions"
  ],
  "directions": [
    "0",
    "In a Dutch oven or deep-fryer heat oil to 375 degrees F.",
    "In a medium bowl, beat the egg whites with a handheld mixer until frothy. Place the chicken pieces into the egg whites, mixing until each piece is covered. Sprinkle with a pinch each of garlic salt and freshly ground black pepper and stir to distribute.",
    "Dredge the chicken pieces in cornstarch, draining most of the egg white from chicken by picking up a handful and allowing the egg white to drain while moving to the cornstarch. Cover the pieces completely by turning in corn starch.",
    "Pick up the chicken in handfuls and transfer from hand to hand to shake off most of the starch. If using a deep-fryer place the pieces into a fry basket. Lower into hot fry oil and shake basket after 10 to 15 seconds to make sure the pieces separate as they cook. Fry until the pieces float on top of the oil and are light brown, approximately 4 to 5 minutes. The chicken should appear somewhat dry, not oily, when the basket is lifted. If frying in a Dutch oven place pieces of chicken in hot oil and fry until light brown, about 5 to 7 minutes.",
    "In a small bowl, add all the garlic mixture ingredients and toss to thoroughly combine.",
    "Place 1 tablespoon of hot chili oil and 1 teaspoon of sesame oil into a hot wok or saute pan over medium to high heat. Immediately put 4 tablespoons of the garlic mixture and 1/3 cup chopped green onions into the oil, stirring with a spoon to lightly cook the garlic mixture, being careful not to brown. Add approximately 2 cups of the fried chicken and toss to cover with the sauce. Finish them with a pinch of garlic salt. Toss once more and serve. Repeat with the remaining chicken.",
    "Recipe courtesy Eve Collins at Chino Bandido"
  ],
  "ingredients": [
    "0",
    "12 cups corn oil, for deep frying",
    "3/4 cup egg whites",
    "4 quarters skinless chicken, boned and cut into 1/2-inch pieces",
    "Garlic salt",
    "Freshly ground black pepper",
    "3 cups cornstarch",
    "4 tablespoons minced garlic",
    "1 teaspoon minced yellow onion",
    "3/4 tablespoon minced green onion",
    "Pinch dried crushed red pepper",
    "Freshly ground black pepper",
    "1/2 minced serrano pepper",
    "1/2 minced jalapeno pepper",
    "Pinch garlic salt",
    "Pinch garlic powder",
    "1/2 cup hot chili oil, divided",
    "2 tablespoons sesame oil, divided",
    "2 cups freshly chopped green onions",
    "Pinch garlic salt"
  ],
  "__v": 1
}