{
  "hash": "7a41a689edea6402c964f7c75ab180c32b031764",
  "title": "Super Bowl Snacks: Cookie Pie Ice Cream Bites",
  "image": "http://media.paleomg.com/2015/11/IMG_8252.jpg",
  "href": "http://paleomg.com/super-bowl-cookie-pie-ice-cream-bites/",
  "extension": "Chrome",
  "firstAdded": "2016-02-06T16:22:21.849000",
  "users": [
    null
  ],
  "keywords": [
    "cream",
    "concentrate",
    "coconut",
    "butter",
    "softened",
    "sugar",
    "maple",
    "syrup",
    "vanilla",
    "eggs",
    "whisked",
    "almond",
    "flour",
    "baking",
    "salt",
    "enjoy",
    "life",
    "mini",
    "chocolate",
    "chips",
    "milk",
    "used",
    "bliss",
    "make",
    "ice",
    "totally"
  ],
  "directions": [
    "0",
    "Preheat oven to 350 degrees. Line an 8x8 glass baking dish with parchment paper.",
    "Place coconut butter in a large bowl along with coconut sugar and mix together until well combined.",
    "Then add maple syrup, vanilla extract and eggs and mix until combined.",
    "Lastly, add almond flour, baking powder, salt and chocolate chips. Fold everything together.",
    "Pour batter into baking dish and spread out evenly throughout the dish.",
    "Place in preheated oven and bake for 35-40 minutes. The middle should be slightly firm but not hard. Do not over bake because it will harden while cooling.",
    "Remove from oven, let pan cool, then place in the freezer. Freeze for an hour or longer. Once the cookie pie has hardened, remove from freezer, remove the parchment paper from the dish then use a large knife to cut the cookie into 1 inch cubes. This will create 20-30 cookie squares depending how big you make them.",
    "Use a tablespoon or small cookie scoop to scoop out a small amount of ice cream and place on top of each cookie square. Then place a toothpick in the middle of each square for easy serving!"
  ],
  "ingredients": [
    "0",
    "½ cup coconut cream concentrate or homemade coconut butter, softened",
    "1 cup coconut sugar",
    "¼ cup maple syrup",
    "1 teaspoon vanilla extract",
    "2 eggs, whisked",
    "1 cup almond flour",
    "1 teaspoon baking powder",
    "pinch of salt",
    "½ cup Enjoy Life Mini Chocolate Chips",
    "coconut milk ice cream of choice - I used Coconut Bliss or you could make your own (the ice cream is totally optional)"
  ],
  "__v": 1
}