{
  "hash": "c85c6d92a80d242e5a89af70793bf81a8eafb727",
  "title": "Paleo Blackberry Bars",
  "image": "http://www.whatrunslori.com/wp-content/uploads/2011/08/DSC_0066.jpg",
  "href": "http://www.whatrunslori.com/2011/08/the-story-of-paleo-blackberry-bars/",
  "extension": "Chrome",
  "firstAdded": "2016-03-26T13:46:51.577000",
  "users": [
    null
  ],
  "keywords": [
    "paleo",
    "blackberry",
    "bars",
    "gluten",
    "free",
    "low",
    "sugar",
    "flour",
    "coconut",
    "blended",
    "cinnamon",
    "baking",
    "soda",
    "salt",
    "nunaturals",
    "blend",
    "agave",
    "maple",
    "syrup",
    "honey",
    "youd",
    "bananas",
    "eggs",
    "use",
    "olive",
    "oil",
    "vanilla",
    "almond",
    "milk",
    "blackberries",
    "frozen",
    "berry"
  ],
  "directions": [
    "0",
    "Preheat oven to 350 degrees. Grease an 8×8 baking pan and set aside.",
    "In a large bowl, mix together the coconut flour, shredded coconut, cinnamon, baking powder and soda, and salt. Add in the NuNaturals Baking Blend or sugar sub, if using, mixing again.",
    "In the same bowl, add in the bananas, eggs, melted coconut oil, vanilla extract, and 1/4 cup almond milk. Mix until all ingredients are incorporated, adding in more almond milk, as needed for mixing. Amount of almond milk varies as coconut flour does soak up liquids quickly, and using more or less coconut flour or shredded coconut will change the absorption of liquids. Add in enough almond milk so the batter is the consistency of cookie batter (but will probably be slightly drier).",
    "Fold in the blackberries and spoon the batter into the greased pan. Bake for 40 minutes or until the sides are golden.",
    "Remove from oven and cool. Cut into about 16 squares."
  ],
  "ingredients": [
    "0",
    "Paleo Blackberry Bars",
    "[gluten free, dairy free, Paleo, and low in sugar]",
    "1 cup coconut flour (shredded coconut blended into powder)",
    "1/2 cup shredded coconut",
    "1 tsp cinnamon",
    "1 tsp baking powder",
    "1/2 tsp baking soda",
    "1/2 tsp salt",
    "1/4 cup NuNaturals Baking Blend (or sugar, agave, maple syrup, honey, whatever you’d like)",
    "2 bananas (about 1 cup)",
    "2 eggs",
    "2 tbsp coconut oil, melted (may use olive oil)",
    "1 tsp vanilla extract",
    "1/2-1 cup almond milk",
    "1 cup blackberries, fresh or frozen (or berry of choice)"
  ],
  "__v": 1
}