{
  "hash": "67cd358503e99b877698594ac0760980e6c3cf61",
  "title": "Buckwheat Crepes",
  "image": "",
  "href": "http://www.thenourishinggourmet.com/2014/02/buckwheat-crepes-as-gluten-free-sandwich-wraps.html",
  "extension": "",
  "firstAdded": "2015-03-30T20:10:34.139000",
  "users": [
    null
  ],
  "keywords": [
    "nondairy",
    "used",
    "canned",
    "fat",
    "coconut",
    "milk",
    "water",
    "kefir",
    "kombucha",
    "lemon",
    "juice",
    "ghee",
    "oil",
    "buckwheat",
    "flour",
    "grinding",
    "use",
    "hulled",
    "groats",
    "salt",
    "honey",
    "eggs",
    "prepare",
    "pan",
    "pancake"
  ],
  "directions": [
    "0",
    "Blend together the milk, 2 tablespoons ghee, flour, kefir, salt and honey in a blender (put in the wet ingredients first). Leave on the counter to soak for 12-24 hours (overnight).",
    "When they are done soaking, add the eggs to the batter and blend again to combine.",
    "Heat a 7-inch cast iron skillet over medium heat. I sometimes bump it up to high heat to speed up the process, then reduce it back to medium when I start cooking the crepes. You want the skillet nice and hot.",
    "Add a small amount (1 teaspoon or so) of ghee or coconut oil to the pan to prepare it for your first pancake. Ladle ⅓ cup of the batter (a scant ladle full) into the skillet and swirl it around confidently until it covers the bottom of the pan and starts to set. Allow it to cook for about a minute, maybe less. Keep an eye on it.",
    "Once it seems done (you'll quickly get the hang of it) use a spatula to loosen it off the pan a bit and (again, with confidence) flip it over. Let it cook for 15-30 seconds, until golden. Repeat until your batter is done. Swirl the batter in the blender from time to time to keep the flour from settling.",
    "You will likely not need any more ghee or coconut oil for the remaining pancakes since there is some in the batter. From time to time the heat might need to be adjusted as the pan will get increasingly hot throughout the cooking."
  ],
  "ingredients": [
    "0",
    "2 cups non-dairy milk (I used canned 9% fat coconut milk)",
    "2 tablespoons milk kefir (or water kefir, kombucha, lemon juice)",
    "2 tablespoons ghee or coconut oil",
    "1.25 cups buckwheat flour (if grinding your own, use hulled groats)",
    "pinch of salt",
    "1 teaspoon honey (optional)",
    "6 eggs",
    "a little ghee or coconut oil to prepare the pan for the first pancake"
  ],
  "__v": 1
}