{
  "hash": "db2ff1c3f477bd4bd5420797f430e0879a88823e",
  "title": "Pork belly roast",
  "image": "//cdn.jamieoliver.com/recipe-database/oldImages/335_448/407_1_1350550087.jpg",
  "href": "http://www.jamieoliver.com/recipes/pork-recipes/pork-belly-roast/",
  "extension": "Chrome",
  "firstAdded": "2017-05-14T10:48:40.260000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Method",
    "Preheat the oven to its highest temperature.",
    "Using a Stanley knife, score the skin down to the meat (try not to cut the meat), making the cuts very close together.",
    "Bash the fennel seeds and a good pinch of sea salt in a pestle and mortar to a powder.",
    "Tip the oil over the top of the scored skin, then sprinkle over the fennel mixture, and rub all over so that everything gets into the scores and down into the meat.",
    "Roughly chop the carrots and celery, then throw these into a roasting tray. Break the garlic bulb up into unpeeled cloves, peel and chop the onions into large wedges, then toss into the tray with the thyme sprigs.",
    "Put the seasoned pork belly on top of the vegetables in the tray, then roast for 10 to 15 minutes, or until the skin starts to bubble and turn golden brown.",
    "Reduce the oven temperature to 170°C/325°F/gas 3, and roast for 1 hour 30 minutes. When the time's up, carefully open the oven door and pour in three-quarters of the wine. Cook for 1 further hour.",
    "Remove the meat carefully from the oven and test to see if it pulls apart easily. If not, cook for a little longer. Allow the meat to rest while you make the gravy.",
    "Put the tray of roasted vegetables directly onto your hob over a medium heat add, add the flour, then stir together until thick. Cook for 1 minute then add in the remaining wine – if you sauce is too thick add a splash more wine or water.",
    "Using a potato masher, mash up the vegetables until you have a delicious thick-looking sauce. Cook for 2 to 3 minutes on a low heat, season to taste, then strain through a sieve into a jug.",
    "Remove the crackling from the top of the belly and break up into pieces, pull the pork belly apart, and serve with the jug of gravy on the side, and a selection of seasonal vegetables."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "0.6 kg piece of higher-welfare pork belly",
    "8 g fennel seeds",
    "50 ml olive oil",
    "1 carrots",
    "1 sticks of celery",
    "a half bulb of garlic",
    "1 onions",
    "quarter a bunch of fresh thyme",
    "half a bottle of white wine",
    "40g g plain flour"
  ],
  "__v": 2
}