{
  "hash": "be0b221d36adc48f3e38a9f9884e2c7aef29b083",
  "title": "vegan saffron hollandaise",
  "image": "https://toriavey.com/images/2013/07/Vegan-Saffron-Hollandaise-1-200x150.jpg",
  "href": "https://toriavey.com/toris-kitchen/vegan-saffron-hollandaise/",
  "extension": "Chrome",
  "firstAdded": "2017-12-24T14:59:10.745000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Have all your ingredients assembled before you begin, so you can work quickly to ensure a smooth, even sauce. Crush the saffron threads in a mortar and pestle.",
    "Pour 2 tbsp water over the saffron threads to let them soak for 5 minutes. This opens up the flavor of the saffron.",
    "In a small saucepan, melt the butter substitute over medium heat. Quickly sauté minced garlic till fragrant, then whisk in corn starch. Continue whisking till smooth. Don't let the cornstarch cook very long.",
    "Slowly whisk in the coconut milk, a quarter cupful at a time, followed by the almond or soy milk.",
    "Whisk in the lemon juice, salt, cayenne and saffron threads and water. Heat the sauce over medium, whisking frequently, until it bubbles around the edges and thickens. Reduce heat to low and keep warm. Stir in additional salt, lemon juice or cayenne to taste, if desired. Serve warm sauce over a variety of dishes. It goes well with steamed artichokes and asparagus, and would make a terrific tofu benedict. Keep in mind that like any thick sauce, if left to cool it will develop a skin on the surface. Be sure to warm it up and whisk it to break up any skin on the surface before serving."
  ],
  "ingredients": [
    "0",
    "Pinch saffron threads",
    "2 tbsp water (for soaking saffron)",
    "2 tbsp non-hydrogenated butter substitute (I recommend Earth Balance)",
    "3/4 tsp crushed garlic",
    "2 1/2 tsp cornstarch",
    "3/4 cup coconut milk (full fat, unsweetened, canned)",
    "1/4 cup unsweetened almond or soy milk (no vanilla added)",
    "1 tbsp fresh lemon juice, or more to taste",
    "1/2 tsp salt, or more to taste",
    "Pinch cayenne pepper, or more to taste (I use a generous pinch, about 1/8 tsp)"
  ],
  "__v": 1
}