{
  "hash": "7e03708b15446228f57c02877b7cfe01c06e7c8c",
  "title": "The Ultimate Homemade Green Bean Casserole Recipe",
  "image": "http://www.seriouseats.com/recipes/assets_c/2015/10/20150923-Thanksgiving-spread-vicky-wasik-019-thumb-1500xauto-427106.jpg",
  "href": "http://www.seriouseats.com/recipes/2010/11/homemade-green-bean-casserole-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-10-29T08:49:34.031000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine shallots and oil in a wok or medium non-stick saucepan. Shallots should barely stick out above level of oil. Place over high heat and cook, stirring frequently until shallots are completely soft, about 12 minutes. Meanwhile, line rimmed baking sheet with 6 layers of paper towels. Continue to cook, stirring constantly until shallots are light golden brown, about 8 minutes. Immediately strain through fine-mesh strainer set in heat-proof bowl or saucepan. Set shallot oil aside. You should have about 2 cups of fried shallots.",
    "Transfer fried shallots to paper towels. Lift up one end of top paper towel and roll shallots off onto second. Blot with first towel to absorb excess oil. Repeat 4 more times, transferring shallots from one paper towel to the next until only one paper towel remains. Season well with salt. Allow to cool completely, about 45 minutes. Once cooled, transfer shallots to sealed airtight container. Shallots can be made up to 1 month in advance.",
    "Smash mushrooms under bottom of large skillet until broken into 1/4 to 1/2-inch pieces. Roughly chop into pieces approximately 1/8th to 1/4-inches large. Set aside. Combine soy sauce, lemon juice, chicken stock, and heavy cream in 1 quart liquid measure or medium bowl.",
    "Add 2 tablespoons reserved shallot oil (save remainder in an airtight container for another use) and butter to 12-inch non-stick skillet. Heat over high heat until butter is melted and foaming subsides. Add mushrooms to skillet and cook, stirring occasionally, until liquid is evaporated and mushrooms begin to sizzle, 6 to 10 minutes. Reduce heat to medium high. Add garlic and cook, stirring constantly, until fragrant, about 30 seconds. Add flour and cook, stirring constantly until light golden blond, 1 to 2 minutes. Whisking constantly, add stock and cream mixture. Bring to a boil, reduce to a simmer, and cook until mixture achieves a texture between pancake batter and heavy cream, about 5 minutes. Season to taste with salt and pepper.",
    "Adjust oven rack to lower-middle position and preheat oven to 350°F. Bring 1 gallon of water and 1/4 cup kosher salt to boil over high heat. Fill large bowl with 1 quart ice cubes and 2 quarts water. Add green beans to water and boil until tender but still bright green, about 5 minutes. Drain through colander set over sink and immediately transfer to ice water until completely cooled. Drain green beans and set aside.",
    "Combine green beans, mushroom sauce, and 1 cup fried shallots. Transfer to 9 by 13-inch rectangular casserole or 10 by 14-inch oval casserole. Bake until hot and bubbly, 15 to 20 minutes. Top with remaining cup fried shallots and serve."
  ],
  "ingredients": [
    "0",
    "1 pound shallots, peeled and sliced 1/8th-inch-thick on a mandoline",
    "2 cups canola oil",
    "Kosher salt",
    "1 1/2 pounds white button mushrooms, rinsed and spun in a salad spinner",
    "2 teaspoons soy sauce",
    "2 teaspoons lemon juice from 1 lemon",
    "2 cups low sodium chicken stock",
    "1 1/2 cups heavy cream",
    "2 tablespoons butter",
    "2 cloves garlic, finely minced or grated on a microplane grater",
    "1/4 cup flour",
    "Freshly ground black pepper",
    "2 pounds green beens, ends trimmed and cut into 2 inch segments"
  ],
  "__v": 1
}