{
  "hash": "090fbfd6f36fbb863781f934004d4fef33f98c3a",
  "title": "Foil Pack Garlic Butter Sausage & Veggies",
  "image": "http://recipe-folder.com/img/recipe-images/096/747/223691996.jpg",
  "href": "http://recipe-folder.com/recipe/5b67ffa93d946d7ece1c63a7",
  "extension": "User Added",
  "firstAdded": "2018-08-06T07:58:33.743000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "If using the OVEN; preheat the oven to 425 degrees F. If GRILLING, prepare the grill by heating to medium-high heat. Prepare 4-6 large sheets of HEAVY DUTY foil; lightly spritz with cooking spray. ALTERNATIVELY if you'd like to avoid cooking in foil and won't be grilling: line a large sheet pan with parchment paper (clean up is just as easy!)",
    "1",
    "Prep the ingredients: wash and dry the veggies. Coin the sausage. Slice the baby red potatoes in half and then half again. Trim the green beans. Shuck the corn on the cobs and slice into thick coins.",
    "2",
    "Add the prepped sausage, corn, green beans, potatoes and garlic to a large bowl. Toss with all of the seasonings (paprika, dried parsley, Italian seasoning, garlic powder, onion powder, and a generous sprinkle of salt + pepper if desired). Toss until well combined.",
    "3",
    "Divide the mixture evenly among the prepared sheets of foil (4 sheets of foil for larger portions and 6 for slightly smaller portions) and place 1 tablespoon of butter in each packet or prepared baking pan (separate pats of butter evenly on top). Seal the foil packs tightly so no air escapes, but do not double up foil (only one sheet of foil per pack).",
    "4",
    "GRILL: Grill for 25-30 minutes or until veggies have reached desired tenderness (flip the foil packs at the halfway point and check for doneness to insure your grill is hot enough).",
    "5",
    "BAKE in foil packs: Bake for 30-40 minutes (at 30 minutes veggies are crisp; 35 is perfect for us; 40 is very tender veggies). You can set the foil packs right on the oven rack or on a sheet pan for easier removal from the oven.",
    "6",
    "BAKE ON SHEET PAN: Bake for about 30-35 minutes, flipping/stirring the ingredients once at the halfway point.",
    "7",
    "Carefully open the foil pack expecting steam to be released. Garnish if desired with fresh chopped parsley, any additional salt/pepper, and freshly grated Parmesan cheese on the beans, potatoes, and sausage."
  ],
  "ingredients": [
    "0",
    "Foil Packs",
    "1",
    "Heavy Duty Foil",
    "2",
    "16 ounces Smoked Turkey or Chicken Sausage,",
    "3",
    "2 cups (~3/4 pound) baby red potatoes,",
    "4",
    "2 cups (~3/4 pound) green beans,",
    "5",
    "3 corn on the cobs,",
    "6",
    "4 cloves minced garlic",
    "7",
    "4-6 tablespoons unsalted butter",
    "8",
    "Seasonings",
    "9",
    "1 teaspoon paprika",
    "10",
    "1 and 1/2 teaspoon dried parsley",
    "11",
    "2 teaspoons Italian Seasoning",
    "12",
    "1/2 teaspoon EACH: garlic powder and onion powder",
    "13",
    "Salt and pepper",
    "14",
    "Optional: fresh parsley, freshly grated Parmesan cheese"
  ],
  "__v": 1,
  "hidden": true
}