{
  "hash": "22cc0961a5b8d170ee044d4c0a9ce006c88e5714",
  "title": "Niçoise Salad",
  "image": "http://ak-hdl.buzzfed.com/static/2015-04/30/13/enhanced/webdr09/enhanced-22834-1430415479-23.jpg",
  "href": "http://www.buzzfeed.com/christinebyrne/2015-clean-eating-day-2?utm_term=.hhxVVQ8d9v&sub=3761122_5634010",
  "extension": "Chrome",
  "firstAdded": "2015-06-21T20:28:14.594000",
  "users": [
    null
  ],
  "keywords": [
    "juice",
    "lemon",
    "dijon",
    "mustard",
    "olive",
    "oil",
    "mixed",
    "greens",
    "leftover",
    "hardboiled",
    "egg",
    "cherry",
    "tomatoes",
    "kalamata",
    "olives",
    "steamed",
    "green",
    "beans",
    "sundays",
    "dinner",
    "tuna"
  ],
  "directions": [
    "0",
    "In a large mixing bowl, combine lemon juice and mustard and whisk to combine. Add the olive oil very slowly, one drop at a time, continuing to whisk vigorously. Spoon about 2 teaspoons dressing into a small mixing bowl and set aside. Add the mixed greens to the large mixing bowl with the dressing and toss to dress the greens. Transfer to a serving bowl and top with the hard-boiled egg, tomato wedges, sliced olives, and green beans. Add tuna to the small mixing bowl with the 2 teaspoons of dressing and toss everything together. Spoon the tuna on top of the arugula salad, and season with freshly ground pepper.",
    "If you’re packing lunch to go: Make the vinaigrette. Mix two teaspoons into the tuna and transfer to a small tupperware container (if you don’t have enough tupperware, you can use a ziploc bag). Store the rest of the dressing in a separate small airtight container. Combine mixed greens, hard-boiled egg, tomato wedges, olives, and green beans in a large tupperware, then put the other two containers (lids on) on top of the salad in the container. Refrigerate until you’re ready to eat then toss the salad with the vinaigrette and top with the tuna."
  ],
  "ingredients": [
    "0",
    "juice of 1 lemon",
    "1 teaspoon dijon mustard",
    "2 teaspoons olive oil",
    "2 cups mixed greens",
    "1 leftover hard-boiled egg, quartered",
    "1 cup halved cherry tomatoes",
    "5 kalamata olives, thinly sliced",
    "1 cup leftover steamed green beans (leftover from Sunday’s dinner)",
    "1 5-ounce can tuna"
  ],
  "__v": 1
}