{
  "hash": "173b0525734ffa682e7a18eaaa7a3dae18ba6a8c",
  "title": "Keto Low Carb Bagels",
  "image": "",
  "href": "https://www.wholesomeyum.com/recipes/low-carb-bagels-with-almond-flour-keto-gluten-free-5-ingredients/",
  "extension": "Chrome",
  "firstAdded": "2019-01-06T19:52:45.190000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 400 degrees F (204 degrees C). Line a baking sheet with parchment paper.",
    "Stir together the almond flour and baking powder. Set aside.",
    "Combine the shredded mozzarella and cubed cream cheese in a large bowl. Microwave for 2 minutes, stirring halfway through. Stir again at the end until well incorporated. (If you don't want to use the microwave, heat the cheeses in a double boiler on the stove over low heat, stirring frequently, until completely melted and easy to stir.)",
    "Stir the flour mixture and eggs into the melted cheese mixture. Working quickly while the cheese is still hot, knead with your hands until a dough forms. The dough will be very sticky, but keep kneading and squeezing through your fingers for a few minutes. If the dough becomes hard before fully mixed, is too difficult to mix, or is still sticky after a couple minutes, you can microwave/reheat for 15-20 seconds to soften it. In that case, wash your hands and knead again.",
    "NOTES:",
    "a) It's very important for the dough to be completely uniform before proceeding to the next step. You shouldn't have pieces of cheese separate from areas of almond flour.",
    "b) If you want to use a food processor or stand mixer, or if you have trouble with sticky dough, please check the tips in the post above!",
    "Divide the dough into 6 parts. Form/roll a long log with each part, then press the ends together to make a bagel shape on the lined baking sheet. Repeat with the remaining dough. If using sesame seeds, sprinkle them over the bagels and gently press into the dough. (You can also use everything seasoning for everything bagels.)",
    "Bake for 10-14 minutes, until the bagels are firm and golden."
  ],
  "ingredients": [
    "0",
    "1 1/2 cup Blanched almond flour",
    "1 tbsp Gluten-free baking powder",
    "2 1/2 cup Mozzarella cheese (shredded; must be either pre-shredded OR hard mozzarella, not soft \"fresh\")",
    "2 oz Cream cheese (cubed)",
    "2 large Egg (beaten)",
    "Sesame seeds (for topping - optional)"
  ],
  "__v": 1
}