{
  "hash": "db8aaed901503bf0329f44c8ece6879711506c0c",
  "title": "Sausages & green lentils with tomato salsa (Salsicce con lenticchie verdi e salsa di pomodoro)",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/483_1_1438705507_lrg.jpg",
  "href": "http://www.jamieoliver.com/recipes/pork-recipes/sausages-and-green-lentils-with-tomato-salsa-salsicce-con-lenticchie-verdi-e-salsa-di-pomodoro/",
  "extension": "Chrome",
  "firstAdded": "2015-09-16T17:55:45.318000",
  "users": [
    null
  ],
  "keywords": [
    "mediumsized",
    "quality",
    "italian",
    "sausages",
    "good",
    "fat",
    "cumberlands",
    "olive",
    "oil",
    "purplesprouting",
    "broccoli",
    "cima",
    "rapa",
    "juice",
    "lemon",
    "extra",
    "virgin",
    "salt",
    "black",
    "pepper",
    "salsa",
    "rossa",
    "red",
    "onion",
    "garlic",
    "cinnamon",
    "stalk",
    "chillies",
    "crumbled",
    "wine",
    "vinegar",
    "dressing",
    "goodquality",
    "tinned",
    "plum",
    "tomatoes",
    "lentils",
    "lenticchie",
    "castelluccio",
    "puy",
    "bay",
    "leaf",
    "flatleaf",
    "parsley",
    "leaves",
    "stalks",
    "reserved",
    "sherry",
    "thyme",
    "tips"
  ],
  "directions": [
    "0",
    "The equivalent of sausage and mash in Italy is definitely a good roasted sausage with a pile of lenticchie di Castelluccio and a spicy salsa rossa tomato sauce – a genius combo.",
    "First things first, get your salsa on the go. Put a little olive oil into a pan, add the onion and sliced garlic, throw in the cinnamon stick and a good crumbling of chilli, and fry on a gentle heat for 10 minutes until the onions are soft and sweet. Now turn the heat up and add your red wine vinegar – it will steam and might even make you cough but this is a normal reaction! Then turn the heat down to low and add your tinned tomatoes, chopped up. Simmer slowly for half an hour while you get on with your lentils.",
    "Put a pan of water on for your broccoli and preheat the oven to 200ºC/400ºF/gas 6. Put the lentils into a pot, cover them with water, and add the 2 whole cloves of garlic, the bay leaf and some tied-up stalks from the parsley. Simmer for around 20 minutes, making sure that you've got enough liquid covering the lentils. Toss your sausages in a little olive oil and put them in a roasting tray in the preheated oven for 25 minutes or until golden and crisp. Drop your broccoli into boiling water for a few minutes when the sausages come out of the oven. When done, drain in a colander and toss in a bowl with a squeeze of lemon juice and some extra virgin olive oil.",
    "Once the lentils are cooked, remove the parsley stalks and bay leaf and pour away most of the water from the pan. Mash the garlic cloves up with a spoon, mix in with the lentils and dress them using 4 tablespoons of good extra virgin olive oil and 1 or 2 tablespoons of good vinegar. Throw in all your finely chopped parsley leaves, mix and season.",
    "Remove the sausages from the roasting tray and pour away any fat. Tip the lentils into your serving bowls. Remove the cinnamon stick from the salsa rossa and discard it, then season well to taste and spoon it over your lentils. Place 2 sausages, either sliced or whole, on top. Sprinkle with the thyme and serve with a big bowl of steaming broccoli."
  ],
  "ingredients": [
    "0",
    "8 medium-sized quality Italian sausages, or good fat Cumberlands",
    "olive oil",
    "500 g purple-sprouting broccoli or cima di rapa",
    "juice of ½ lemon",
    "extra virgin olive oil",
    "sea salt",
    "freshly ground black pepper",
    "For the salsa rossa",
    "olive oil",
    "1 small red onion, peeled and finely chopped",
    "3 cloves garlic, peeled and finely chopped",
    "1 small cinnamon stalk",
    "1-2 small dried red chillies, crumbled",
    "2-3 tablespoons red wine vinegar, plus extra for dressing",
    "2 x 400 g good-quality tinned plum tomatoes",
    "For the lentils",
    "400 g lenticchie di Castelluccio or Puy lentils",
    "2 cloves garlic, peeled",
    "1 bay leaf",
    "1 handful fresh flat-leaf parsley, leaves chopped, stalks reserved",
    "red wine vinegar or sherry vinegar",
    "1 small handful fresh thyme tips"
  ],
  "__v": 1
}