{
  "hash": "4af27a4613f5ab0ab7227469a641db8472f0d264",
  "title": "Tomatillo Shakshuka",
  "image": "https://prods3.imgix.net/images/articles/2015_07/Web-Article-Tomatillo-Shakshuka-Middle-Eastern-Poached-Egg-Breakfast-Recipe.jpg?auto=format%2Ccompress&ixjsv=2.2.3&w=750",
  "href": "https://www.tastingtable.com/cook/recipes/how-to-cook-with-tomatillos-shakshuka-recipe",
  "extension": "Chrome",
  "firstAdded": "2017-08-06T04:49:54.583000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Adjust the oven rack to the upper position and turn on the broiler. In a medium heavy-bottomed skillet or, preferably, a cast-iron skillet, add the tomatillos skin-side up and broil until blistered, 5 to 7 minutes. Transfer the tomatillos to a bowl and let them cool. Remove the skins and discard, squeezing out any juice and reserve the flesh. Using your hands, crush the tomatillos and set aside. Increase the oven to 375°.",
    "Wipe out the skillet, add the olive oil and place over medium heat. When the oil is warm, add the onions, season with salt and sauté until soft and translucent, 6 minutes. Add the jalapeños and cook, stirring often until they are soft but not brown, 4 to 6 minutes. Stir in the garlic and cook for another 2 minutes. Add the bay leaf, mint and cumin, and cook for 1 more minute until fragrant. Stir in the reserved tomatillos and honey, season with salt and pepper, and let the mixture simmer until it slightly thickens, 5 minutes. Taste and adjust the seasoning if needed. Add the parsley and cilantro, and stir to incorporate. Cook until the mixture has thickened but is still loose, 6 to 8 minutes.",
    "Crack the eggs into the tomatillo mixture. Season the eggs with salt, then transfer the skillet to the oven and bake until the whites are set but the yolks are still runny, 8 to 10 minutes. Remove from the heat, top with the Cotija cheese and Aleppo pepper, and serve with warm pita bread for dipping."
  ],
  "ingredients": [
    "0",
    "2 pounds tomatillos, husked and halved",
    "1 tablespoon olive oil",
    "1 medium yellow onion, halved and thinly sliced",
    "Kosher salt and freshly ground black pepper, to taste",
    "3 jalapeños—stemmed, seeded and finely chopped",
    "5 garlic cloves, thinly sliced",
    "1 bay leaf",
    "2 teaspoons dried mint",
    "1 teaspoon ground cumin",
    "1 teaspoon honey",
    "½ cup finely chopped flat-leaf parsley",
    "½ cup finely chopped cilantro",
    "4 large eggs",
    "⅓ cup Cotija cheese",
    "1 teaspoon Aleppo pepper",
    "Warm pitas, for serving"
  ],
  "__v": 1
}