{
  "hash": "65eb91e5f6a602a1a61e928d2b0c9c8579630037",
  "title": "Butter Me Up: The Famous St. Louis Gooey Butter Cake",
  "image": "",
  "href": "https://cheftap.com/recipes/butter-me-up-the-famous-st-louis-gooey-butter-cake/",
  "extension": "Chrome",
  "firstAdded": "2018-11-12T18:26:53.353000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "BUTTER CAKE MIXTURE:",
    "Get 9 x13 pan and grease with Crisco on the bottom and all sides.",
    "Put yellow cake mix in mixing bowl. DO NOT FOLLOW THE DIRECTIONS ON THE CAKE BOX. Add 2 extra large eggs, 1 stick of melted butter in microwave about 35 seconds, and 1/2 tsp. pure vanilla extract. Mix together in mixer. Batter will have a very most feel to it. Take cake batter and spread evenly through 9 x 13 pan so it evenly covers the bottom of the pan.",
    "Clean off mixers and mixing bowl.",
    "GOOEY MIXTURE:",
    "Melt cream cheese in microwave about 45-50 seconds.",
    "Put 3/4 of the powdered sugar in mixing bowl setting aside about 1/4 of the box for topping to sprinkle on after the cake is baked and cooled. In mixer add 3/4 powdered sugar, melted cream cheese, and 2 extra large eggs. Mix together in mixer. This will have a very GOOEY consistency as this is the gooey part of the cake. Take the Gooey mixture and layer on top of the cake batter mixture in pan.",
    "COOKING INSTRUCTIONS:",
    "Here at sea level we bake it at 350 for 30-40 minutes or until the top of the cake is browned (Note: Kerry baked hers for 35 minutes and thought it was perhaps slightly over-baked). You want to make sure the gooey mixture on top of the cake is not too gooey otherwise it will be like a liquid. It is okay if the edges are brown and the top of the cake is lightly browned as well.",
    "Once cooked remove from oven and let cool about two hours before cutting and adding remaining powdered sugar. Add remaining powdered sugar to coat/cover top of cake, cut like brownies and serve."
  ],
  "ingredients": [
    "0",
    "4 extra large eggs",
    "1 stick melted butter",
    "Pure vanilla extract",
    "1 8 oz. package cream cheese",
    "1 box powdered sugar (3 1/2 cups)"
  ],
  "__v": 1
}