{
  "hash": "9802ad5ada5a6b3cbccd89c8573cf4fa5ddd04bc",
  "title": "Herbed Faux-tisserie Chicken and Potatoes",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/herbed-faux-tisserie-chicken-and-potatoes",
  "extension": "Chrome",
  "firstAdded": "2015-12-18T20:03:23.482000",
  "users": [
    null
  ],
  "keywords": [
    "fennel",
    "seeds",
    "red",
    "pepper",
    "marjoram",
    "sprigs",
    "divided",
    "thyme",
    "kosher",
    "salt",
    "black",
    "olive",
    "oil",
    "chicken",
    "lemon",
    "head",
    "garlic",
    "crosswise",
    "yukon",
    "gold",
    "potatoes",
    "scrubbed"
  ],
  "directions": [
    "0",
    "Preheat oven to 300°. Coarsely grind fennel seeds and red pepper flakes in a spice mill or with a mortar and pestle. Combine spice mixture, chopped marjoram, chopped thyme, 1 Tbsp. salt, ½ tsp. pepper, and 3 Tbsp. oil in a small bowl. Rub chicken inside and out with spice mixture. Stuff chicken with lemon, garlic, 2 marjoram sprigs, and 2 thyme sprigs. Tie legs together with kitchen twine.",
    "Toss potatoes with remaining 3 Tbsp. oil on a rimmed baking sheet; season with salt and pepper. Push potatoes to edges of baking sheet and scatter remaining 2 marjoram and 2 thyme sprigs in center; place chicken on herbs. Roast, turning potatoes and basting chicken every hour, until skin is browned, meat is extremely tender, and potatoes are golden brown and very soft, about 3 hours. Let chicken rest at least 10 minutes before carving."
  ],
  "ingredients": [
    "0",
    "2 teaspoons fennel seeds",
    "1 teaspoon crushed red pepper flakes",
    "2 tablespoons finely chopped fresh marjoram; plus 4 sprigs, divided",
    "2 tablespoons finely chopped fresh thyme; plus 4 sprigs, divided",
    "1 tablespoon kosher salt, plus more",
    "½ teaspoon freshly ground black pepper, plus more",
    "6 tablespoons olive oil, divided",
    "1 3½–4 pound chicken",
    "1 lemon, quartered",
    "1 head of garlic, halved crosswise",
    "2 pounds Yukon Gold potatoes, scrubbed, halved, or quartered if large"
  ],
  "__v": 1
}