{
  "hash": "bee043611b03cd02d59ac1bfeaf28a28f73b184c",
  "title": "Baked French Toast Muffins",
  "image": "http://cdn.averiecooks.com/wp-content/uploads/2014/12/frenchtoastmuffinstext1.jpg",
  "href": "http://www.averiecooks.com/2014/12/baked-french-toast-muffins.html",
  "firstAdded": "2015-01-24T00:23:54.988000",
  "users": [
    null
  ],
  "keywords": [
    "eggs",
    "scant",
    "used",
    "vanilla",
    "almond",
    "milk",
    "light",
    "brown",
    "sugar",
    "granulated",
    "cinnamon",
    "slices",
    "wholegrain",
    "wholewheat",
    "bread",
    "cubes",
    "sugarfree",
    "syrup"
  ],
  "directions": [
    "0",
    "Preheat oven to 350F. Spray 8 of the 12 cavities of a Non-Stick 12-Cup Regular Muffin Pan (note you will not use all 12) very, very well with cooking spray or grease and flour the pan; set aside. (I don't prefer the cosmetic look of muffin liners and in this recipe, I think the bread would stick.)",
    "To a large bowl, add the first 6 ingredients, through vanilla, and whisk to combine.",
    "Add the bread and gently toss with a spoon to coat evenly. Allow bread to rest in bowl for 3 to 5 minutes, or until most/all of the batter has soaked into the bread.",
    "Evenly distribute bread (and any un-absorbed batter can be drizzled evenly) among 8 cavities in prepared pan by loosely laying it in, without packing down. Each cavity should be about 3/4-full. The bread puffs quite a bit while baking, but deflates upon cooling. Pieces should all lay fairly flat in each cavity because any pieces that are jutting up will be prone to burning.",
    "Bake for about 25 minutes or until tops are lightly golden brown, the coating mixture is set, and bread looks fairly dry (no wet batter); use your judgment when evaluating doneness because type of bread used, muffin pans, ovens, and climates vary. Start watching closely at 20 minutes.",
    "Allow French toast to cool for about 10-15 minutes in muffin pan on top of a wire rack before gently rimming each cavity with a knife if necessary, dislodging, and serving with syrup."
  ],
  "ingredients": [
    "0",
    "3 large eggs",
    "scant 1/2 cup milk (I used unsweetened vanilla almond milk)",
    "1 tablespoon light brown sugar, packed",
    "1 tablespoon granulated sugar",
    "2 teaspoons cinnamon",
    "1 to 2 teaspoons vanilla extract",
    "6 slices whole-grain or whole-wheat bread, diced into 1-inch cubes",
    "sugar-free syrup, for serving"
  ],
  "__v": 1
}