{
  "hash": "56dcafa60b054eb0c422dd6da4d0fcdacf6c2d5c",
  "title": "Leg of Lamb with Garlic Sauce",
  "image": "https://d2k9njawademcf.cloudfront.net/slides/1904/original/033010F_521.JPG?1270081417",
  "href": "http://food52.com/recipes/3814-leg-of-lamb-with-garlic-sauce",
  "extension": "Chrome",
  "firstAdded": "2015-06-10T01:05:42.871000",
  "users": [
    null
  ],
  "keywords": [
    "leg",
    "lamb",
    "especially",
    "long",
    "shin",
    "bone",
    "presentation",
    "garlic",
    "slivered",
    "anchovy",
    "fillets",
    "coarsely",
    "extravirgin",
    "olive",
    "oil",
    "rosemary",
    "thyme",
    "salt",
    "black",
    "pepper",
    "left",
    "dry",
    "red",
    "wine",
    "cte",
    "rhne",
    "parsley",
    "preferably",
    "flatleaf"
  ],
  "directions": [
    "0",
    "Have your butcher prepare the meat by removing most of the fat and skin from the leg, and by removing most of the bare bone that protrudes from the leg. If you want a slightly smaller leg, have him (or her!) shorten it from the hip end. When you’re ready to roast it, trim lamb of any excess fat. Make many slits all over the lamb and insert a sliver of garlic and a piece of anchovy in each incision. Finely chop the rosemary and thyme and mix the herbs with sea salt and pepper in a small bowl. Rub the lamb with 2 tablespoons of olive oil, and the herb mixture. Let it stand for 1 to 2 hours.",
    "Preheat oven to 425 degrees F. Place the meat on a rack in a roasting pan, and cook, uncovered, for 20 minutes. Reduce the heat to 350 degrees F., and cook for 40 to 45 minutes for medium rare lamb. The temperature on an instant-read thermometer should register 130 degrees F. (That’s how it’s supposed to be!)",
    "Heat 1 tablespoon olive oil in a heavy skillet, and cook the 24 garlic cloves slowly for about 10 minutes, or until they are soft (don’t let the edges get crisp—or brown). Set aside in a small bowl.",
    "Remove lamb to a warmed platter, and turn off the oven. Cover with an aluminum foil tent and set it in the oven to keep warm while you prepare the sauce. On top the stove, put wine into the roasting pan, scraping the bottom well to loosen any brown bits or caramelized juices, and cook the wine over a high flame to reduce it by about one-third. Add the reduced liquid to the garlic cloves. Mash well with a fork, and add sea salt and pepper to taste.",
    "Slice the lamb and grind some fresh black pepper over it. Spoon on the sauce, and sprinkle it all with freshly chopped parsley.",
    "There are two wines that pair magnificently with this dish.\nNot surprisingly, they both come from Provence: Châteauneuf-du-Pape (my favorite is Clos des Pape), and Bandol Rouge (I love those from Domaine Tempier inordinately!) If you are on a budget, a Côte du Rhône will do admirably."
  ],
  "ingredients": [
    "0",
    "1 5-pound leg of lamb, bone in (I especially like a long shin bone for presentation)",
    "6 large garlic cloves, slivered",
    "12 anchovy fillets, coarsely chopped",
    "3 tablespoons extra-virgin olive oil",
    "1 tablespoon fresh rosemary, finely chopped",
    "1 tablespoon fresh thyme, finely chopped",
    "sea salt & freshly ground black pepper to taste",
    "1",
    "24 garlic cloves, peeled, left whole",
    "1 cup dry red wine (such as Côte du Rhône)",
    "2 tablespoons finely chopped parsley (preferably flat-leaf)"
  ],
  "__v": 1
}