{
  "__v": 1,
  "directions": [
    "0",
    "FOR THE CAKE:",
    "Grease and flour an 8\" or 9\" round springform pan. Using an 8\" pan will give you a taller cake.",
    "Preheat the oven to 375 degrees.",
    "Sift the flour, baking powder, salt, cloves and nutmeg into a large mixing bowl. Make sure the bowl is very large to allow room for the apples to be folded in.",
    "Cut the butter into the flour using your fingers or a pastry cutter until the mixture resembles fine crumbs.",
    "Add the 3/4 C. sugar to the flour mixture and mix in.",
    "Peel the apples and slice them into uniform pieces. This cake works best and gets that 'chunky apple look' if the slices are about 1/4\" wide and then cut into 3 pieces.",
    "Toss the apples into the flour mixture and combine them thoroughly.",
    "In a separate bowl, beat the eggs and milk together. Add to the apples and flour and mix in with a large spatula until just combined. Batter will be thick and dough-like.",
    "Transfer the dough into the prepared cake pan and flatten the top surface using the back of your spatula.",
    "Sprinkle the sugar over the top of the cake.",
    "Bake for 45-50 minutes. Test the center for doneness. The top of the cake should be golden brown. Serve slices with custard sauce.",
    "FOR THE CUSTARD SAUCE:",
    "Place the egg yolks and sugar in a bowl and whisk until pale yellow, 2-3 minutes. Place the milk in a medium saucepan and bring just to a boil. Slowly whisk the hot milk into the egg/sugar mixture. Transfer the mixture back to the saucepan and stir over medium heat until custard thickens, about 4 minutes. Custard should be thick enough to coat the back of a spoon. Mix in the vanilla. Transfer to bowl or serving saucer.",
    "Serve warm or cold over apple cake."
  ],
  "firstAdded": "2014-07-20T19:19:15.913000",
  "hash": "b62265147b0149a2056ce5973587043095d29aec",
  "href": "http://thekitchenmccabe.com/2014/03/07/irish-apple-cake-with-custard-sauce/",
  "image": "http://thekitchenmccabe.com/wp-content/uploads/2014/02/irish-apple-cake-2-607x894.jpg",
  "ingredients": [
    "0",
    "FOR THE CAKE:",
    "3 C. Flour",
    "2 t. Baking Powder",
    "1/8 t. Salt",
    "1/4 t. Cloves, ground",
    "1/4 t. Nutmeg, ground",
    "6 oz. Butter, (cold is fine)",
    "3/4 C. Sugar",
    "4 large Granny Smith apples(I used golden delicious to great effect)",
    "2 Eggs",
    "3/4 C. Milk",
    "2 T. Sugar(for sprinkling on top of cake)",
    "FOR THE CUSTARD:",
    "6 large Egg Yolks",
    "6 T. Sugar",
    "1 1/2 C. Whole Milk",
    "1 1/2 t. Vanilla"
  ],
  "keywords": [
    "cake",
    "flour",
    "baking",
    "salt",
    "nutmeg",
    "butter",
    "cold",
    "sugar",
    "granny",
    "smith",
    "applesi",
    "used",
    "golden",
    "great",
    "effect",
    "eggs",
    "milk",
    "sugarfor",
    "sprinkling",
    "custard",
    "egg",
    "yolks",
    "vanilla"
  ],
  "title": "Irish Apple Cake with Custard Sauce",
  "users": [
    null
  ]
}