{
  "hash": "86598381f6a03534ea2cc9cea9b7e6fc47b3deeb",
  "title": "HIDDEN FLAG CAKE - AS SEEN ON TV!",
  "image": "https://static1.squarespace.com/static/57608b5662cd94c2170055ab/t/59497e8f1e5b6cfa524ec559/1497988776496/Hidden+Flag+Cake+Table+to+Soul?format=1000w",
  "href": "https://www.tabletosoul.com/recipes/p8oyxr9a0svzmxx4mfzy2ypqvkllhs?rq=flag%20cake",
  "extension": "Chrome",
  "firstAdded": "2018-07-05T01:26:41.439000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    ". Preheat the oven to 350° F.",
    "Spray five 9-inch cake rounds with nonstick or coconut oil cooking spray and set aside.",
    "To make frosting: combine ingredients from Buttercream Frosting recipe. Start by combining butter or shortening, powdered sugar, and clear vanilla extract and beat with an electric mixer. Add in warm milk until you’ve reached a desirable consistency and powdered sugar is thoroughly mixed in. Mix and set aside. (You may need to add more milk when getting ready to use the frosting later.)",
    "Bake the white Layers: Double the ingredients for the GF White Cake Recipe and whisk all ingredients together in a large mixing bowl. Pour batter into two of your prepared cake rounds and bake 30-40 minutes or until a toothpick comes out clean when inserted into the center of the cake. When cake rounds are thoroughly baked, remove from oven and set aside to cool.",
    "Red Layers: Double the ingredients for the GF White Cake Recipe and whisk all ingredients together in a large mixing bowl. Add in 6-8 drops of non-toxic red food coloring—or add coloring until the batter reaches your preferred shade of red. (Cake will appear lighter in color when it is finished baking.) Pour batter into two of your prepared cake rounds and bake 30-40 minutes or until a toothpick comes out clean when inserted into the center of the cake. When the red cake rounds are thoroughly baked, remove from oven and set aside to cool.",
    "Blue Layer: There is only one blue layer to this cake. Whisk together the ingredients for one GF White Cake. Add in 6-8 drops of non-toxic blue food coloring. Bake for 30-40 minutes or until a toothpick comes out clean when inserted into the center of the cake. When the blue cake has been baked, remove from oven and set aside.",
    "Let cakes cool for at least a half hour. Then, use a spatula to remove cakes. For best results, cover cakes with saran wrap and freeze for 1 hour before proceeding to “trimming”.",
    "Trimming: Lay cakes flat on a clean surface. Use a large, sharp knife to cut evenly across each baked cake, removing the rounded top. The goal is to make each cake flat, so they can stack easily. Then, move to “Assembling the cake.”",
    "Assembling the cake: On your preferred cake stand or cake plate, add a small dollop of frosting into the center of the plate. (This will keep the cake from sliding around on the bottom of the plate.)",
    "9a. On top of the frosting, stack one red cake with the side you cut facing down (so the side that was on the bottom of the pan is facing up—this will help you spread frosting without spreading extra crumbs). Spread a layer of frosting onto the top of the red cake.",
    "9b. Carefully stack a white cake onto the red cake, with the side you cut (again) facing down and the smooth side facing up. Spread a layer of frosting onto the top of the white cake.",
    "9c. Carefully stack the remaining red cake onto the white cake, with the smooth side facing up (like you did with the previous layers). Add a layer of frosting on top of the red layer of cake.",
    "9d. Set your remaining white cake layer and blue cake layer side by side. Place a small bowl (3-4” in diameter) in the center of the blue cake and use a sharp knife to cut around the bowl until the center of the blue cake comes out in a circular form. Discard the blue center circle (or, if you’re like me, share it with your begging dog!) Use the same bowl to cut a circle out of the white layer. Discard the excess white.",
    "9e. Place the blue “donut”-shaped cake layer on top of the cake, with the smooth side facing up. Carefully place the white circular cake piece inside of the blue border.",
    "10. Now that your cake has been assembled, apply a thin crumb-coat to the outside and top of your cake. (A crumb-coat is simply a layer of frosting meant to hold everything together; don’t worry about any crumbs! Just work on getting a thin layer of frosting around the cake and keep it as even as possible.) When the crumb-coat has been applied, move your cake into the freezer for one hour.",
    "11. After the cake has chilled for an hour and the crumb-coat is firm, use a clean spatula to apply a clean layer of frosting to the outside of the cake. Decorate as you prefer! Enjoy within 3 days of baking. For best results, keep the cake covered and in the refrigerator before serving!"
  ],
  "ingredients": [
    "0",
    "1 cup white sugar",
    "1 ½ cups Bob’s Red Mill 1:1 GF flour (blue and clear package)",
    "½ cup grass-fed butter, melted",
    "1 ¾ teaspoons baking powder",
    "2 eggs + 1 egg white",
    "½ cup milk",
    "2 teaspoons clear vanilla extract"
  ],
  "__v": 1
}