{
  "hash": "747c231a88cb3f4cc2cf146820b0392f6c08d0a8",
  "title": "Mini Mac and Cheese Bites",
  "image": "http://i1.wp.com/tiphero.com/wp-content/uploads/2015/10/mini-mac-cheese-bites.jpg?resize=750%2C364",
  "href": "http://tiphero.com/mini-mac-and-cheese-bites/?ref=fv",
  "extension": "",
  "firstAdded": "2017-06-09T08:15:52.172000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat your oven to 400 F. Spray mini muffin pans (this recipe was enough for 36 mac & cheese bites, so you’ll need two pans) with non-stick spray.",
    "Put a large pot of salted water on to boil, then cook the macaroni according to the package directions. Drain it and set aside while you make the cheese sauce.",
    "In a medium saucepan, melt the butter over medium heat. Whisk in the flour and let it cook for a minute, then slowly start pouring in the milk while continuing to whisk. Start with a little bit at a time and gradually you’ll be able to add the milk faster. Once it is a smooth sauce, let it start to simmer.",
    "Add in 1 ½ cups of the shredded cheese (save the other ½ cup for topping the bites before baking) a handful at a time, whisking between each addition until all the cheese has melted into the sauce. Add in the cream cheese, salt and pepper and cook until the cream cheese has been incorporated into the sauce.",
    "In a large mixing bowl stir the pasta, cheese sauce and the egg until evenly mixed.",
    "Divide the macaroni and cheese evenly among the mini-muffin tins. Press down with the spoon to pack the macaroni in, then once all of the muffin tins are filled, sprinkle the remaining cheese on top of each macaroni and cheese bite.",
    "Bake in the preheated oven for 15 minutes, until golden brown on top. Allow to cool for five minutes before removing the bites- I turned the pans upside down and lightly tapped them and all of the bites came out of the tins (just don’t forget the non-stick spray!).",
    "Makes 36 bites"
  ],
  "ingredients": [
    "0",
    "½ lb (8 oz) elbow macaroni",
    "2 Tbsp salted butter",
    "2 Tbsp all-purpose flour",
    "1 ½ cups whole milk",
    "2 cups shredded sharp cheddar cheese, divided",
    "2 oz cream cheese",
    "½ tsp kosher salt",
    "¼ tsp ground black pepper",
    "1 egg, beaten"
  ],
  "__v": 1
}