{
  "hash": "56932293db7eb697e93d5a75a6e48a7654fd98fc",
  "title": "Slow Cooker Chicken Tikka Masala",
  "image": "http://www.budgetbytes.com/wp-content/uploads/2015/12/Slow-Cooker-Chicken-Tikka-Masala-text.jpg",
  "href": "http://www.budgetbytes.com/2015/12/slow-cooker-chicken-tikka-masala/",
  "extension": "Chrome",
  "firstAdded": "2016-02-12T15:03:32.057000",
  "users": [
    null
  ],
  "keywords": [
    "yellow",
    "onion",
    "lbs",
    "chicken",
    "thighs",
    "skin",
    "garlic",
    "ginger",
    "cracked",
    "pepper",
    "garam",
    "masala",
    "tomato",
    "cream",
    "bunch",
    "cilantro"
  ],
  "directions": [
    "0",
    "Dice the onion and place it in the bottom of your slow cooker. Remove the skins from the chicken (if not already skinless) and nestle the chicken thighs into the slow cooker on top of the onions. Top the chicken with the minced garlic, grated ginger, some freshly cracked pepper, and the garam masala.",
    "Pour two 15oz. cans of tomato sauce over top of the chicken and spices. Place the lid on the slow cooker and cook for 4 hours on high or 8 hours on low (or pressure cook for 45 minutes).",
    "When it's finished cooking, carefully remove the chicken thighs from the sauce and transfer them to a cutting board. Use two forks to shred the chicken and remove the bones.",
    "While the chicken is out of the pot, taste the sauce and add any salt or extra garam masala if desired. Once seasoned to your liking, stir in the half and half or cream.",
    "Finally, return the shredded chicken meat to the pot and stir to combine. Serve the meat and sauce over rice or with flat bread for scooping up the delicious sauce. Top with freshly chopped cilantro."
  ],
  "ingredients": [
    "0",
    "1 yellow onion $0.31",
    "2 lbs. chicken thighs, skin removed $5.66",
    "3 cloves garlic $0.24",
    "1 Tbsp grated fresh ginger $0.11",
    "Freshly cracked pepper $0.05",
    "1 Tbsp garam masala $0.50",
    "2 15oz. cans tomato sauce $1.58",
    "⅓ cup half and half or cream $0.30",
    "¼ bunch fresh cilantro, chopped $0.25"
  ],
  "__v": 1
}