{
  "hash": "36c1790c72ed311bc7ac4b5e1e9e13aa3ecf25e3",
  "title": "Cashew Cream Mini Cheesecakes",
  "image": "//static-37.sinclairstoryline.com/resources/media/45e42d1b-2a70-457f-aef2-8f3c8e3a2d88-large16x9_blueberryminicheesecakes.png.jpg",
  "href": "http://katu.com/amnw/am-northwest-cooking-recipes/cashew-cream-mini-cheesecakes",
  "extension": "Chrome",
  "firstAdded": "2017-09-25T04:51:03.880000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Make the crust first. Place cupcake papers in 12-slot muffin pan. Add pitted dates to a food processor and mix until it is ground and forms a ball. Remove the dates from food processor and set aside. Add nuts to the food processor and mix until fully ground. Add the dates back in and blend until a crumbly mixture forms. Place a heaping spoonful of crust mixture to each cupcake paper and press with fingers. I use a baby food jar to pack it down and create a firm crust. Place pan in freezer while you make the filling.",
    "In a blender or Vitamix, add the filling ingredients. Blend on high until silky smooth.",
    "If flavoring with blueberry, add the blueberries to the blender and mix until smooth. Or, add blueberries (or blueberry jam) to plain cheesecakes in the pan and swirl in.",
    "For chocolate cheesecakes, add the cocoa powder to the blended mixture and swirl in crushed chocolate chips once poured into cheesecakes.",
    "Pour cheesecake filling into cupcake tin, dividing evenly. Cover with plastic wrap or a lid and place into freezer until completely set—about 4-6 hours. Enjoy frozen or remove from freezer for 10-15 minutes to allow cheesecakes to thaw before eating."
  ],
  "ingredients": [
    "0",
    "Crust:",
    "1 cup pitted dates",
    "1 cup raw nuts, I use walnuts or almonds",
    "Filling:",
    "2 cups raw cashews, soaked 4 hours to overnight",
    "1/3 coconut oil, melted",
    "5.4 fl. Oz. can of coconut cream (about ½ cup + 2 Tbsp)",
    "½ cup agave nectar or maple syrup",
    "¼ cup lemon juice",
    "1 tsp pure vanilla extract",
    "Extra flavoring",
    "Chocolate = add 5 Tbsp cocoa powder to filling and ½ cup crushed dairy-free chocolate chips for the topping",
    "Blueberry = add 2 cups fresh or frozen blueberries (or use blueberry jam) to the filling + whole blueberries for the topping"
  ],
  "__v": 1
}