{
  "hash": "7c099382d645560b9b7bf20ffad378535707d388",
  "title": "Slow cooker ratatouille",
  "image": "http://ninecooks.typepad.com/.a/6a00d83451fa5069e201b7c6ce8109970b-800wi",
  "href": "http://www.theperfectpantry.com/2011/09/slow-cooker-ratatouille-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-05-05T08:48:23.100000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "red",
    "onions",
    "yukon",
    "gold",
    "potatoes",
    "garlic",
    "smashed",
    "eggplant",
    "ends",
    "trimmed",
    "chunks",
    "zucchini",
    "bell",
    "peppers",
    "colors",
    "seeded",
    "tomatoes",
    "medium",
    "portobello",
    "mushroom",
    "caps",
    "stems",
    "white",
    "wine",
    "thyme",
    "oregano",
    "leaves",
    "balsamic",
    "vinegar",
    "kosher",
    "salt",
    "black",
    "pepper",
    "arrowroot",
    "cornstarch"
  ],
  "directions": [
    "0",
    "In a large sauté pan or skillet, heat the oil over low heat, and add the onions, potatoes and garlic cloves. Cook, stirring occasionally, for 3-4 minutes, until the onions just begin to get translucent and the garlic hasn't begun to brown. Transfer the contents to a 6- or 7-quart slow cooker.",
    "Add the eggplant, zucchini, bell peppers, tomatoes, mushrooms, wine and thyme leaves. Cook on LOW for 3-1/2 hours, stirring once during that time.",
    "Turn the cooker to HIGH, and add the balsamic vinegar. Season with salt and pepper to taste.",
    "Mix the arrowroot or cornstarch with 6 tablespoons of water, to make a slurry. Pour that into the slow cooker and stir. Cover, and cook for 15-20 minutes on HIGH. The liquid in the cooker will be slightly thickened (and it will thicken more if you let the ratatouille chill in the refrigerator).",
    "Serve hot, at room temperature, or cold."
  ],
  "ingredients": [
    "0",
    "1/4 cup olive oil",
    "2 red onions, chopped",
    "3 Yukon Gold potatoes, chopped",
    "3 large garlic cloves, peeled and smashed",
    "2 small eggplant, ends trimmed, cut into large chunks",
    "3 small zucchini, ends trimmed, cut into large chunks",
    "4 bell peppers (assorted colors), seeded, cut into large chunks",
    "3 medium tomatoes, seeded, cut into medium chunks",
    "4 portobello mushroom caps, stems removed, cut into large chunks",
    "1/4 cup white wine",
    "2 Tbsp fresh thyme leaves (or 1 Tbsp fresh oregano leaves)",
    "3 Tbsp balsamic vinegar, or more to taste",
    "Kosher salt and fresh black pepper, to taste",
    "2 Tbsp arrowroot or cornstarch"
  ],
  "__v": 1
}