{
  "hash": "24ac9535e9bf40a2053249af31bca5852af2ff17",
  "title": "Toad in the hole",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/623_1_1350913456_lrg.jpg",
  "href": "http://www.jamieoliver.com/recipes/pork-recipes/toad-in-the-hole/",
  "firstAdded": "2015-02-23T20:48:47.566000",
  "users": [
    null
  ],
  "keywords": [
    "sunflower",
    "oil",
    "quality",
    "sausages",
    "sprigs",
    "rosemary",
    "red",
    "onions",
    "garlic",
    "knobs",
    "butter",
    "balsamic",
    "vinegar",
    "level",
    "organic",
    "stock",
    "cube",
    "batter",
    "milk",
    "plain",
    "flour",
    "salt",
    "freerange",
    "eggs"
  ],
  "directions": [
    "0",
    "Mix the batter ingredients together, and put to one side. I like the batter to go huge so the key thing is to have an appropriately-sized baking tin – the thinner the better – as we need to get the oil smoking hot.",
    "Put 1cm/just under ½ inch of sunflower oil into a baking tin, then place this on the middle shelf of your oven at its highest setting (240–250ºC/475ºF/gas 9). Place a larger tray underneath it to catch any oil that overflows from the tin while cooking. When the oil is very hot, add your sausages. Keep your eye on them and allow them to colour until lightly golden.",
    "At this point, take the tin out of the oven, being very careful, and pour your batter over the sausages. Throw a couple of sprigs of rosemary into the batter. It will bubble and possibly even spit a little, so carefully put the tin back in the oven, and close the door. Don't open it for at least 20 minutes, as Yorkshire puddings can be a bit temperamental when rising. Remove from the oven when golden and crisp.",
    "For the onion gravy, simply fry off your onions and garlic in the butter on a medium heat for about 5 minutes until they go sweet and translucent. You could add a little thyme or rosemary if you like. Add the balsamic vinegar and allow it to cook down by half. At this point, I do cheat a little and add a stock cube or powder. You can get some good ones in the supermarkets now that aren't full of rubbish. Sprinkle this in and add a little water. Allow to simmer and you'll have a really tasty onion gravy. Serve at the table with your Toad in the Hole, mashed potatoes, greens and baked beans or maybe a green salad if you're feeling a little guilty!"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "sunflower oil",
    "8 large quality sausages",
    "4 sprigs fresh rosemary",
    "2 large red onions, peeled and sliced",
    "2 cloves garlic, peeled and finely sliced",
    "2 knobs butter",
    "6 tablespoons balsamic vinegar",
    "1 level tablespoon organic vegetable stock powder, or 1 vegetable stock cube",
    "For the batter",
    "285 ml milk",
    "115 g plain flour",
    "1 pinch salt",
    "3 free-range eggs"
  ],
  "__v": 1
}