{
  "hash": "ecaff8af1925c5eb52e5f51adf4cff4d5f3c9672",
  "title": "Making bhaji with tender baby spinach and coconut cream.",
  "image": "http://caribbeanpot.com/wp-content/uploads/2010/01/spinach-recipe-300x199.jpg",
  "href": "http://caribbeanpot.com/tag/spinach-recipe/#5083304170da80301b000002",
  "keywords": [
    "baby",
    "spinach",
    "pre",
    "washed",
    "medium",
    "onion",
    "garlic",
    "hot",
    "pepper",
    "used",
    "habanero",
    "black",
    "salt",
    "olive",
    "oil",
    "using",
    "extra",
    "virgin",
    "love",
    "flavour",
    "coconut",
    "cream"
  ],
  "directions": [
    "0",
    "If you look closely at the edges of the garlic you’ll notice that it’s starting to go golden in color, this is a good indication that it’s time to add the spinach. Since we washed the spinach, make sure to drain it well before adding to the pan with the hot oil and garlic. At first you’ll doubt that the entire batch of spinach will fit in the pan, but as it wilts… everything will fit. Just keep adding as needed.",
    "The next step is to add the black pepper, sliced onion, hot pepper and salt. As mentioned I used a little less than 1/4 teaspoon of salt, so I suggest you add a similar amount and at the end add additional if needed. TIP BTW, if you have a heavy hand and add more salt than necessary, feel free to add a sliced tomato to the pot to try and diffuse some of that salty taste. I then pour in the coconut milk into the pan, cover, turn down the heat to low and allow to simmer for about 20 minutes. You’ll notice that the spinach released a lot of it’s own liquid. No worries.. we’ll burn all that off later.",
    "After 20 minutes cooking with the cover on the pan, you’ll notice that there’s still a bit of liquid left in the pot. After-all we added coconut milk as well to the natural juices of the spinach itself. Remove the cover and turn the heat up to medium/high to cook off all that liquid. Keep a close eye.. if you notice the spinach starts to stick to the bottom of the pan, turn down the heat. It must cook off the liquid evenly.",
    "Note: I like my spinach cooked as we do with dasheen bush bhaji.. melted to a sort of smooth paste. But if you prefer, you can cook this much faster with the lid off the pan for about 7-10 minutes (instead of 20) or until the liquid (coconut) milk dries off. On a higher heat setting. This way you’ll have a finished dish with more texture.",
    "As the liquid dries off, you’re done. It will look a bit mushy, but trust me.. this is packed with flavour and healthy goodness."
  ],
  "ingredients": [
    "0",
    "11 oz baby spinach (pre washed)",
    "1 medium onion sliced thin",
    "3 cloves garlic sliced",
    "1/4 hot pepper (optional) I used habanero",
    "dash of black pepper",
    "salt to taste (I used a little less than 1/4 teaspoon)",
    "3 tablespoon olive oil (I like using extra virgin – love the additional flavour)",
    "1 can coconut cream (5.6 fl oz)"
  ],
  "__v": 0
}