{
  "hash": "1b0dc2bb311954f45ce142965a8b2420149abb94",
  "title": "Banana Cream Pie with Caramel Drizzles and Chocolate Sauce",
  "image": "https://www.emerils.com/sites/default/files/styles/wmax-600-sq/public/bananacreamEms.jpg?itok=wv9CenDw",
  "href": "https://www.emerils.com/127759/banana-cream-pie-caramel-drizzles-and-chocolate-sauce",
  "extension": "Chrome",
  "firstAdded": "2020-01-11T19:28:55.846000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine 2 cups cream, the milk, 1/2 cup sugar, and vanilla bean and seeds in a large heavy-bottomed saucepan over medium heat. Bring to a gentle boil, whisking to dissolve sugar. Remove from heat.",
    "Combine egg yolks, eggs, cornstarch, and 1 cup sugar in a medium bowl; whisk until pale yellow in color. Set aside.",
    "Whisk 1 cup hot cream mixture into egg yolk mixture. Gradually add egg mixture to hot cream mixture, whisking constantly. Bring to a simmer, stirring constantly with a large wooden spoon to cook out cornstarch and thicken mixture, about 5 minutes. (The mixture may separate slightly; if so, remove from heat and beat with an electric mixer until thick and smooth.) Strain through a fine-mesh strainer into a clean bowl. Cover with plastic wrap, pressing down against the surface to prevent a skin from forming. Chill in refrigerator for about 4 hours.",
    "To assemble, spread 1/2 cup custard over the bottom of the prepared crust, smoothing with the back of a large spoon or rubber spatula. Arrange enough banana slices (not quite one-third) in a tight, tiled pattern over custard, pressing down with your hands to pack them firmly. Repeat to build a second layer, using 3/4 cup custard and enough bananas to cover, smoothing down the layer evenly. For the third layer, spread 3/4 cup of custard over bananas and top with remaining bananas, starting 1 inch from outer edge and working toward center. Spread 1 cup custard evenly over bananas to prevent discoloration. Cover with plastic wrap and chill for at least 4 hours or overnight.",
    "In a medium bowl, whip remaining 2 cups heavy cream until soft peaks form. Add remaining 2 teaspoons sugar and vanilla extract and continue to whip until stiff peaks form.",
    "Remove pie from refrigerator. With a sharp knife dipped in hot water, cut pie into 10 equal slices. Transfer slices to dessert plates. Fill a pastry bag with whipped cream and pipe onto each slice. (Alternately, spread the whipped cream evenly over the pie before cutting.)",
    "Drizzle each slice with caramel and chocolate sauces, sprinkle with chocolate shavings and confectioners' sugar, garnish with fresh mint, and serve."
  ],
  "ingredients": [
    "0",
    "4 cups heavy cream",
    "1 1/2 cups whole milk",
    "1 1/2 cups plus 2 teaspoons granulated sugar",
    "1 vanilla bean, split in half lengthwise and seeds scraped",
    "3 large egg yolks",
    "2 large eggs",
    "1/2 cup cornstarch",
    "Graham Cracker Crust",
    "3 pounds (about 9) firm but ripe bananas, peeled and cut crosswise into 1/2-inch-thick slices",
    "1/2 teaspoon pure vanilla extract",
    "Caramel Sauce",
    "Chocolate Sauce",
    "Shaved chocolate, for garnish",
    "Confectioners' sugar, for garnish",
    "Fresh mint, for garnish"
  ],
  "__v": 1
}