{
  "hash": "5f03d30b1a41fd3073c65e41076a4bae48423681",
  "title": "Spicy Killer Garlic Dill Pickles",
  "image": "http://www.foodiecrush.com/wp-content/uploads/2015/09/Spicy-Garlic-Dill-Pickles-foodiecrush.com-21.jpg",
  "href": "http://www.foodiecrush.com/killer-spicy-garlic-dill-pickles/",
  "extension": "Chrome",
  "firstAdded": "2016-09-06T13:12:07.077000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the Homemade Pickling Spice",
    "Add all of the ingredients to a small bowl and stir to mix.",
    "For the Spicy Killer Garlic Dill Pickles",
    "Prepare your jars and lids for canning. I run my jars through the dishwasher to sterilize and remove them while still warm.",
    "In a large stock pot bring the vinegars, water and salt to a simmer.",
    "To each jar add: 2-3 tablespoons of pickling spice, 2-3 fronds and stalks of dried dill week, 2-3 Thai red peppers depending on your preference and 4-5 whole garlic cloves to each jar. Pack the cucumbers whole or sliced into the jars so they are tight but aren't damaged in the process. The cucumbers should sit below the neck of the jar.",
    "Pour the brine into the jars leaving ½ inch headspace and just covering the cucumbers.",
    "Wipe the rims of the jars and use tongs to place the lids and rings (that have been sterilized in simmering water) on top of the jars. Avoid touching the lids where they sit on the jars with your fingers to avoid contamination.",
    "Process in a canner water bath for 10 minutes then remove the jars from the pot and allow them to cool on the counter. As the jars cool you will hear them pop as they seal. Sealed jars should feel solid when tapped and be concave in shape.",
    "Store in a dry cool place. Pickles will be ready to try in about 7-10 days but get even better over time. They can be stored for up to 1 year."
  ],
  "ingredients": [
    "0",
    "For the Homemade Pickling Spice",
    "2 tablespoons black peppercorns",
    "2 tablespoons mustard seeds",
    "2 tablespoons coriander seeds",
    "2 tablespoons dill seed",
    "1 tablespoon allspice berries",
    "1 teaspoon crushed red pepper flakes",
    "10-12 bay leaves, crumbled",
    "For the Spicy Garlic Dill Pickles",
    "½ bushel pickling cucumbers, scrubbed clean and kept whole or sliced",
    "2 cups apple cider vinegar",
    "2 cups white vinegar",
    "4 cups water",
    "5 tablespoons pickling salt",
    "Homemade pickling spice (2-3 tablespoons per jar)",
    "Dried dill weed from a 2 ounce package (2-3 fronds and stalks per jar)",
    "10-18 small Thai red peppers, split down the middle leaving seeds intact (2-3 per jar)",
    "20-30 whole garlic cloves, peeled and lightly smashed (4-5 per jar)"
  ],
  "__v": 1
}