{
  "hash": "4cd62255b38dd1f066c5dacb957fc64528f341c2",
  "title": "Choriqueso empanadas",
  "image": "//www.laylita.com/recipes/wp-content/uploads/2013/01/Chorizo-and-cheese-empanadas-with-avocado-sauce.jpg",
  "href": "http://laylita.com/recipes/2013/01/30/choriqueso-empanadas/",
  "extension": "Chrome",
  "firstAdded": "2016-02-24T09:45:07.100000",
  "users": [
    null
  ],
  "keywords": [
    "empanada",
    "discs",
    "frying",
    "baking",
    "storebought",
    "butter",
    "olive",
    "oil",
    "white",
    "onion",
    "mexican",
    "style",
    "chorizo",
    "pork",
    "beef",
    "based",
    "preference",
    "achiote",
    "mozzarella",
    "oaxaca",
    "monterrey",
    "jack",
    "cheese",
    "crumbled",
    "queso",
    "fresco",
    "jalapeno",
    "slices",
    "yolk",
    "water",
    "whisked",
    "use",
    "egg",
    "wash",
    "brush",
    "empanadas",
    "avocado"
  ],
  "directions": [
    "0",
    "Heat the butter or oil in a frying pan over medium low heat, add the diced onions and cook until they are soft and translucent, about 5 minutes.",
    "Remove the chorizo from the casings, break it up in chunks and add it to the onions. Cook the chorizo meat on medium heat until it is fully cooked; stir frequently to help break up the pieces of chorizo. Add additional achiote powder if desired. Let the chorizo cool down completely before using.",
    "Mix the grated mozzarella with the crumbled queso fresco.",
    "To assemble the empanadas add a spoonful of the cheese mix topped with a spoonful of the chorizo on to the center of each empanada disc. For extra heat you can add slices of fresh jalapeños.",
    "Fold the empanada discs and gently seal the edges with your fingers. Twist and fold the edges of the empanadas with your fingers. For extra sealing you can use a fork to press down on the edges.",
    "Chill the empanadas for at least an hour, this will help them seal better and prevent leaks. This is especially needed if you are baking the empanadas.",
    "If baking the empanadas pre-heat the oven to 400 F. Also, brush the empanadas with egg wash right before baking to give them a nice golden glow. Bake the empanadas for 20-25 minutes or until golden.",
    "Fry the empanadas in a deep fryer or in a frying pan, if using a frying pan, make sure to add enough oil to cover at least half of the empanada. Let the oil get very hot and fry each empanada until they are golden on each side, about a minute per side. Place the empanadas on paper towels to drain any excess grease and serve immediately.",
    "Serve the empanadas with avocado sauce."
  ],
  "ingredients": [
    "0",
    "24 empanada discs for frying or baking, store-bought or homemade",
    "1 tablespoon butter or olive oil",
    "½ white onion, finely diced – about 1 cup",
    "1 lb. Mexican style fresh chorizo, pork or beef based on your preference",
    "½ to 1 tablespoon of ground achiote - optional",
    "3 cups or 12 ounces of grated mozzarella, oaxaca or monterrey jack cheese",
    "1 cup or 4 ounces of crumbled queso fresco,",
    "Optional: jalapeno slices",
    "1 egg yolk + 1 tablespoon water whisked together to use as egg wash to brush on empanadas",
    "Avocado sauce"
  ],
  "__v": 1
}