{
  "hash": "8e5588d2a23405a7beeecd278b375ab494a91168",
  "title": "No Bake S'mores Cheesecake",
  "image": "",
  "href": "http://www.mybakingaddiction.com/no-bake-smores-cheesecake/",
  "extension": "Chrome",
  "firstAdded": "2016-08-07T19:27:23.177000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "In a medium bowl, stir together the graham cracker crumbs, sugar and melted butter. Evenly divide the crumbs between 6 individual serving dishes and press into the bottoms of the dishes to form a crust layer. Place serving dishes into the refrigerator while you prepare the cheesecake.",
    "Place 25 Campfire速 Regular Marshmallows in a large, deep microwave-safe bowl. Microwave on high power for 45-60 seconds. Marshmallows will puff up and begin to melt. Use a buttered spatula to stir the marshmallows until smooth. Set aside.",
    "In a large bowl with an electric mixer, whip the cream cheese for about 2 minutes. Add in confectioners' sugar and vanilla and beat for an additional minute. Use a buttered spatula to scoop the melted marshmallows into the cream cheese mixture and beat for an additional minute. Use a rubber spatula to fold in whipped topping.",
    "Spoon or pipe the cheesecake filling directly onto the graham cracker crusts and place them back into the refrigerator while you prepare the ganache.",
    "Add chocolate to a heat-safe bowl. Bring cream just to a boil over medium-high heat. Pour heated cream over the chocolate and Let stand for 5 minutes and then whisk to combine. Spoon chocolate ganache onto the cheesecake layer and place back into the refrigerator until you are ready to serve.",
    "Just before serving, top each cheesecake with a toasted Campfire速 Giant Roaster marshmallow. Enjoy!"
  ],
  "ingredients": [
    "0",
    "FOR THE CRUST:",
    "1 cup graham cracker crumbs",
    "1 tablespoon granulated sugar",
    "4 tablespoons butter, melted",
    "FOR THE CHEESECAKE FILLING:",
    "25 Campfire速 Regular Marshmallows",
    "8 ounces cream cheese, room temperature",
    "1/4 cup confectioners' sugar",
    "1/2 teaspoon vanilla extract",
    "8 ounce container of frozen whipped topping (Cool Whip or TruWhip), thawed",
    "FOR THE GANACHE:",
    "3 ounces semisweet chocolate, chopped",
    "3 ounces heavy cream",
    "For Topping:",
    "6 Campfire速 Giant Roasters, toasted"
  ],
  "__v": 1
}