{
  "hash": "31f632f486541d846de211c36ff383c67144bbcf",
  "title": "Mushroom Soup Recipe",
  "image": "http://natashaskitchen.com/wp-content/uploads/2015/02/Mushroom-Soup-Recipe-6.jpg",
  "href": "http://natashaskitchen.com/2015/02/24/mushroom-soup-recipe/",
  "extension": "Chrome",
  "firstAdded": "2016-12-23T14:24:35.687000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Add potatoes to a pot with 8 cups water and 2 cups stock. Bring potatoes to a light boil and continue to cook for about 10 min or until potatoes are almost cooked. Meanwhile saute sliced mushrooms over medium high heat until lightly browned and softened. Add mushrooms to the soup pot and continue cooking 5-8 min.",
    "Meanwhile, heat the same skillet over medium/high heat. Add 3 Tbsp butter along with diced onion and grated carrot, and saute until golden (8-10 min) then add to the soup pot. For picky eaters who don't like the onion texture, you can puree the sautéed carrots and onion in a blender or food processor.",
    "Whisk together 2 cups half and half and 4 Tbsp flour until smooth. Add cream mixture to the soup. Add seasonings to taste (If not using mushroom seasoning, we recommend the following seasoning combination: 1 Tbsp salt, ½ tsp pepper, and ½ Tbsp Mrs. Dash). Stir in ⅓ cup chopped Parsley or Dill or a mix of both. Bring to a boil for a few minutes, check potatoes for doneness and remove from heat.",
    "Notes",
    "*Note: Olga P., who shared this recipe with me, uses this mushroom seasoning",
    "that she purchased at the European market. We knew that not everyone may have access to it, so we tried using Mrs. Dash seasoning instead and it was still very tasty."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "8 cups water",
    "2 cups chicken or vegetable broth",
    "3-4 medium potatoes, peeled, diced and rinsed",
    "2 lbs mushrooms, sliced",
    "2 cups half & half (or 1 cup milk + 1 cup heavy cream)",
    "4 Tbsp flour (add 5 Tbsp if you like a creamier soup)",
    "1 medium onion, finely diced",
    "1 large carrot, grated",
    "3 Tbsp butter",
    "2 Tbsp mushroom seasoning (or ½ Tbsp Mrs. Dash, or vegetable seasoning *see note)",
    "Salt and black pepper to taste",
    "⅓ cup chopped parsley or dill or both"
  ],
  "__v": 1
}