{
  "hash": "0189c94017eaaf3de19e8a952186036148857df4",
  "title": "Pork-Whole Roasted Suckling Pig",
  "image": "https://webknox.com/recipeImages/693159-556x370.jpg",
  "href": "https://spoonacular.com/Whole-Roasted-Suckling-Pig-693159",
  "extension": "Chrome",
  "firstAdded": "2015-12-05T11:40:09.542000",
  "users": [
    null
  ],
  "keywords": [
    "water",
    "kosher",
    "salt",
    "granulated",
    "sugar",
    "oil"
  ],
  "directions": [
    "0",
    "Instructions",
    "1Rinse pig in cold water and set aside. Line a 32-gallon garbage bag with 2 more 32-gallon garbage bags.",
    "Place water, salt, and sugar in the tripled-up garbage bags and stir to dissolve, taking care not to puncture the bags.",
    "Place pig in the bags, remove excess air, and tie tightly.",
    "Place in a 15-quart container in the refrigerator and brine 12 to 24 hours, turning once. 2",
    "Heat the oven to 250F and arrange a rack on the lowest level.",
    "Remove the pig from the brine and pat dry with paper towels; discard brine. Lay the pig on its side and stuff the interior with 15 to 20 large (20-inch-long) pieces of lightly crumpled aluminum foil until its filled out. (This will prevent caving during roasting.) 3",
    "Transfer the pig to a baking sheet fitted with a roasting rack. Arrange it stomach down with the back legs tucked underneath and pointing forward, and the front legs tucked underneath and toward its sides. (You may need to add more foil if it is not sitting properly.) Prop up the head with foil or a large ramekin to keep the back aligned. Cover tightly with aluminum foil and place in the oven. 4Roast the pig, rotating once, until it reaches 130F, about 2 1/2 to 3 hours.",
    "Remove the foil, baste with oil, and increase the oven temp to 400F. 5Roast, basting every 15 minutes with oil and rotating once more, until the internal temperature reaches 160F, about 45 minutes to 1 hour more. (If the ears or snout become too brown, cover with foil.)",
    "Remove from the oven and let rest 20 minutes before carving."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "14.2 liters water",
    "1.9 kilograms kosher salt",
    "900 grams granulated sugar",
    "109 grams vegetable oil"
  ],
  "__v": 2
}