{
  "hash": "eb891c8febdb26bead7158bcef94784c5def3ee2",
  "title": "Chicken Pot Pie",
  "image": "https://scontent-atl3-1.xx.fbcdn.net/v/t1.0-9/44890967_10205119002331651_5817241282094825472_n.jpg?_nc_cat=109&_nc_ht=scontent-atl3-1.xx&oh=a65528bca0721f66c0ca1a5c3a83acee&oe=5D194E9C",
  "href": "https://www.facebook.com/groups/1109364292434897/permalink/1889047367799915/",
  "extension": "Chrome",
  "firstAdded": "2019-03-15T23:33:43.376000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Special equipment: 4 (2-cup) individual baking dishes",
    "Crust: Preheat oven to 350 degrees F. Cut each sheet of frozen puff pastry into 1-inch strips, 8 inches long. On a large cookie sheet, weave strips into a lattice large enough to cover each pot pie. Brush beaten egg onto each lattice square. Bake for 5 minutes, or until dough has risen and turned light golden brown. Set aside until ready to assemble pies. Leave oven on at 350 degrees F.",
    "Filling: Season chicken with seasoned salt and pepper. Heat oil in a large skillet over medium-high heat. Add chicken and sauté until cooked through. Remove from heat and cut into chunks. Alternatively, you may use precooked chicken. In a large saucepan, melt butter and then slowly add flour, stirring until consistency of peanut butter, but not brown like a roux. Slowly add cream and keep stirring. Add chicken base, garlic, and onion and stir until thickened. Add peas, carrots, nutmeg, if using, and cut up chicken. Remove from heat. Fill 4 individual oven-proof bowls with chicken mixture and then top each with a pre-cooked lattice square. Bake for 5 minutes or until bubbly. Any remaining pie filling may be frozen.",
    "*** can add 1 1/2 cups of diced potatoes or any vegetable to your liking."
  ],
  "ingredients": [
    "0",
    "4 sheets frozen puff pastry",
    "1 egg, beaten",
    "4 chicken breast halves, or 2 cups leftover cooked chicken",
    "Seasoned salt and pepper",
    "2 tablespoons cooking oil",
    "1/3 cup butter",
    "2/3 cup all-purpose flour",
    "1 quart heavy cream",
    "1/4 cup chicken base",
    "1 tablespoon minced garlic",
    "1/2 small yellow onion, minced",
    "1 cup frozen green peas, cooked",
    "1 cup chopped cooked carrots",
    "Pinch fresh grated nutmeg, optional"
  ],
  "__v": 1
}