{
  "hash": "2fe93e99c25226e995f623dbc3dc7954316ccb90",
  "title": "Super vegan bowl with parsley cashew pesto",
  "image": "https://www.scalingbackblog.com/wp-content/uploads/2014/05/DSC_0805.jpg",
  "href": "https://www.scalingbackblog.com/super-vegan-bowl-with-parsley-cashew-pesto/",
  "extension": "Chrome",
  "firstAdded": "2017-07-31T06:22:22.106000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cover the cashews with ½-inch of water and let sit for 1 hour or up to overnight.",
    "Drain and rinse the cashews and add to a food processor along with the parsley, garlic, lemon juice, salt, and pepper. Process until smooth, stopping to scrape down the sides once or twice. Taste and add more lemon juice or salt and pepper as desired.",
    "Bring ¾ cup of water in a small saucepan to a boil. Add the couscous, stir to combine and remove from the heat. Let it sit for 7 to 10 minutes. Fluff the couscous with a fork and set aside.",
    "Heat 1 tablespoon of olive oil in a large skillet over medium heat. Add the mushrooms, season with salt and pepper and cook for 7-10 minutes, stirring occasionally until all the water has evaporated and they begin to brown. Set the mushrooms aside and return the skillet to the heat. Cut the kale into 1-inch pieces, and add to the pan along with a few tablespoons of water. Season with salt and pepper, cover the skillet and let steam for 3-4 minutes until the kale is wilted and a bright green color.",
    "To serve plate ½ cup of couscous, a quarter of the mushrooms and kale and top with a tablespoon of the pesto."
  ],
  "ingredients": [
    "0",
    "For the parsley cashew pesto:",
    "½ cup raw cashews",
    "¼ cup water",
    "2 cups Italian parsley",
    "2 cloves garlic",
    "2 tablespoons lemon juice",
    "¼ teaspoon kosher salt",
    "pepper to taste",
    "To assemble:",
    "½ cup uncooked Israeli couscous",
    "1 pint cremini mushrooms, sliced",
    "1 tablespoon olive oil",
    "1 bunch of Lacinto kale, stems removed"
  ],
  "__v": 1
}