{
  "hash": "1c720d3b06c03e60d2e19ca3965e2458651c3c86",
  "title": "All-Star Roast Chicken",
  "image": "http://prodstatics3cdn1.tastingtable.com/images/articles/2014_03/Jonathan_Waxman_Ethan_Stowell_Hugh_Acheson_Michael_Tusk_Andrew_Carmellini_Justin_Smillie_All_Star_Roast_Chicken_American_Main_Course_Article.jpg",
  "href": "http://www.tastingtable.com/entry_detail/chefs_recipes/16016/All_Star_Roast_Chicken_Recipe.htm",
  "firstAdded": "2015-02-26T20:12:04.910000",
  "users": [
    null
  ],
  "keywords": [
    "diamond",
    "crystal",
    "mortons",
    "kosher",
    "salt",
    "cold",
    "water",
    "heads",
    "garlic",
    "horizontally",
    "bay",
    "leaves",
    "bunches",
    "thyme",
    "lemon",
    "chicken",
    "naturally",
    "raised",
    "antibiotic",
    "free",
    "oregano",
    "cumin",
    "coriander",
    "zest",
    "medium",
    "sized",
    "lemons",
    "black",
    "pepper",
    "fingerling",
    "potatoes",
    "size",
    "yellow",
    "onion",
    "wedges",
    "poblano",
    "chunks",
    "green",
    "olives",
    "sprigs",
    "rosemary",
    "olive",
    "oil",
    "champagne",
    "vinegar",
    "trussing",
    "twine"
  ],
  "directions": [
    "0",
    "The night before, combine the salt, water, 2 halves of one garlic head, 4 bay leaves, one bunch of thyme and the peel (minus the white pith) of 1 lemon in a large pot. Bring to a boil, stirring to dissolve the salt. Cool to refrigerator temperature (you can speed up this process by placing the pot in an ice bath). Submerge the chicken in the cooled brine overnight and refrigerate.",
    "Remove from the brine. Pat as dry as possible with paper towels. If you have time, place uncovered in the refrigerator to air dry a bit before cooking, ideally for 12 hours.",
    "Preheat the oven to 325°F.",
    "Make an herb rub by combining the oregano, cumin, coriander, zest and black pepper. Rub the spice mixture all over the bird. Let it dry on the bird for 5minutes.",
    "Stuff the cavity with the peeled lemon (cut in half) and the 2 remaining garlic head halves, 1 bunch of thyme and 1 bay leaf. (Stuffing the cavity seasons the chicken from the inside out.)",
    "Truss the bird: Cut a piece of trussing twine about 2½-feet long. With the breast-side up and the drumsticks pointing at you, wrap the center of the twine once around the neck. Pull both sides of the twine around the wings to secure them, bring the twine above the thighs and then loop each over the drumsticks, cinching them together. Pull the string back up to the neck and tighten the knot. Pat on any of the herb rub that has come off in the trussing process.",
    "In a medium sized bowl, toss the potatoes, onions, poblano peppers and green olives with the olive oil, salt and pepper and add to the roasting pan with the chicken. Place the 2 rosemary sprigs in the pan.",
    "Most people play the high temp to low temp game. Instead cook the bird at 325°F and then finish at 400°F for the last 20 minutes. (This allows the fat to render slowly first.) Cook until the internal temperature of the chicken reaches 160°F, 1 hour 35 minutes for a 4-pound bird. Baste the bird every 15 minutes, rotating the pan in the oven ever 10 minutes to ensure even cooking.",
    "When the chicken is finished cooking, let it rest on a carving board. Add the vinegar to the vegetables in the pan and stir to combine.",
    "Serve the chicken with the pan-roasted vegetables and the chicken jus."
  ],
  "ingredients": [
    "0",
    "1 cup Diamond Crystal kosher salt or ½ cup Morton's kosher salt",
    "1 gallon cold water",
    "2 heads garlic, cut horizontally in half",
    "5 bay leaves",
    "2 bunches thyme",
    "1 lemon",
    "1 (3½ - 4 pound) chicken (fresh, naturally raised, antibiotic free)",
    "1 tablespoon dried oregano",
    "2 teaspoons dried cumin",
    "1 tablespoon dried coriander",
    "1 tablespoon lemon zest (from 1½ medium sized lemons)",
    "2 teaspoons black pepper",
    "1 pound fingerling potatoes, cut in half",
    "1 medium size yellow onion, about ¾ pound, cut into large wedges",
    "1 medium size poblano pepper, about ¼ pound, cut into 1-inch chunks",
    "⅓ cup green olives, pitted and quartered",
    "2 sprigs fresh rosemary",
    "⅓ cup olive oil oil",
    "2 teaspoons Diamond Crystal salt",
    "1 teaspoon black pepper",
    "1½ tablespoons champagne vinegar",
    "Trussing twine"
  ],
  "__v": 1
}