{
  "hash": "fb43f7ee6ed7482f5e591fca1098d3cb79286ad4",
  "title": "Brussels Sprouts with Chestnuts and Bacon",
  "image": "https://imagesvc.timeincapp.com/v3/mm/image?url=http%3A%2F%2Fcdn-image.myrecipes.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2F4_3_horizontal_-_1200x900%2Fpublic%2Fbrussels-sprouts-with-chestnuts-and-bacon-su-1000.jpg%3Fitok%3DNhv-nt12&w=800&q=85",
  "href": "http://www.myrecipes.com/recipe/brussels-sprouts-chestnuts-bacon",
  "extension": "",
  "firstAdded": "2017-12-16T00:33:57.857000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "How to Make It",
    "Step 1",
    "Preheat oven to 350°. Toss chestnuts in oil and put on a rimmed baking sheet. Bake, turning often, until slightly toasted but not dry, 10 to 15 minutes.",
    "Step 2",
    "Bring a large pot of salted water to a boil. Add brussels sprouts and cook until bright green and just tender, about 6 minutes. Drain and rinse with cold water.",
    "Step 3",
    "Cook bacon in a large frying pan over medium heat, stirring often, until almost crisp. Drain bacon in a strainer, reserving fat in a bowl.",
    "Step 4",
    "Wipe out pan and add 3 tbsp. reserved bacon fat. Add shallot and cook, stirring often, until softened and starting to brown, about 3 minutes. Add drained brussels sprouts and cook, stirring often and adding more fat if needed, until browned and starting to crisp, about 6 minutes. Sprinkle with salt, pepper, nutmeg, and lemon juice, stirring to combine.",
    "Step 5",
    "Transfer to a serving bowl and top with reserved bacon and chestnuts."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "12 ounces canned or vacuum-packed shelled chestnuts, large pieces cut in half (or about 1 lb. fresh, if available) 3 tablespoons olive oil 1 1/2 pounds brussels sprouts, ends trimmed, halved 6 slices (8 oz.) thick-cut bacon, cut into 1/2-in. pieces 1 large shallot, sliced thinly 3/4 teaspoon sea salt 1/2 teaspoon pepper 1/2 teaspoon nutmeg 2 teaspoons lemon juice"
  ],
  "__v": 1
}