{
  "hash": "45a178d1c06bb4d34379a5f26b5cbaf93370a6b5",
  "title": "Grilled Beer Marinated Chicken",
  "image": "http://picturetherecipe.com/wp-content/uploads/2013/06/Grilled-Beer-Marinated-Chicken-Drumsticks-by-PictureTheRecipe.jpg",
  "href": "http://picturetherecipe.com/index.php/recipes/grilled-beer-marinated-chicken/",
  "firstAdded": "2015-02-20T00:20:07.481000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "drumsticks",
    "olive",
    "oil",
    "onion",
    "salt",
    "paprika",
    "cumin",
    "cayenne",
    "black",
    "pepper",
    "garlic",
    "juice",
    "lime",
    "beer",
    "parsley"
  ],
  "directions": [
    "0",
    "– Rinse and pat dry your chicken drumsticks and toss them into a zip lock bag.",
    "– Mix together all the remaining ingredients together to make a marinade. Starting with the olive oil, onion salt (or you can use finely diced fresh onion), paprika (I used sweet hungarian paprika), ground cumin, 1/4 of a teaspoon of cayenne powder (or more if you like a little more heat like I do, its fairly mild with just 1/4 tsp) and ground black pepper.",
    "– Then grate the fresh garlic cloves and squeeze in the juice of half a lime.",
    "– Pour in the beer.",
    "– Give the marinade mixture a good stir to mix it all together and taste it. Then add some salt according to your taste but don’t be skimpy. (You want the marinade to be a bit salty, cos you’re adding it to a lot of chicken and you’re taking the chicken out of the marinade before you grill it.)",
    "– Lastly toss in a handful of chopped fresh parsley and mix it in.",
    "– Pour the marinade into the zip lock bag with the chicken. Seal it and massage the marinade into all the pieces of chicken. Let the chicken marinate for atleast a couple of hours in the fridge, overnight would be best to let the chicken absorb all the flavors. (I tend to flip the bag over every couple hours to make sure the both sides of the chicken get to sit in the juices to marinate more evenly.)",
    "– Once the chicken has marinated simply throw them on the grill (make sure to oil the grill so the chicken doesn’t stick) for 25-30 minutes turning over the pieces & basting it with the marinade every 7-8 minutes until the internal temperature is above 170F. Another way to check if the legs are done if you don’t have a meat thermometer, is to pierce a leg with a sharp knife down to the bone and if the juices run clear, it’s done…if it’s pink/ red then you’ll need to cook the chicken more.",
    "– Serve them up hot and garnished with some presh parsely and a squeeze of lime. Don’t forget to serve some chilled beer with these finger licking good chicken drumsticks!"
  ],
  "ingredients": [
    "0",
    "8-10 chicken drumsticks",
    "1/4 cup olive oil",
    "1 tsp onion salt",
    "1 tsp paprika",
    "1/2 tsp ground cumin",
    "1/4 tsp cayenne",
    "1/2 tsp ground black pepper",
    "3-4 cloves of garlic",
    "Juice of half a lime",
    "1 cup beer",
    "handful of chopped fresh parsley",
    "Salt to taste"
  ],
  "__v": 1
}