{
  "hash": "9abcf7f414802b9ecd9eb86f2be91ffbd1f5bda0",
  "title": "Bacon and Potato Tart",
  "image": "http://target.scene7.com/is/image/Target/c_Bacon-Potato-Tart_RT?hei=340",
  "href": "http://www.cooking.com/recipes-and-more/recipes/bacon-potato-tart-recipe?CCAID=cknwfhne06265az&s=s0085567335s&mid=2106310&rid=85567335",
  "extension": "Chrome",
  "firstAdded": "2015-04-23T23:58:55.249000",
  "users": [
    null
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "dusting",
    "puff",
    "pastry",
    "sheet",
    "thawed",
    "eggs",
    "milk",
    "thyme",
    "leaves",
    "medium",
    "yukon",
    "gold",
    "potatoes",
    "slices",
    "bacon",
    "crumbled",
    "parmesan",
    "butter",
    "kosher",
    "salt",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "Dust your work surface lightly with flour and unfold the puff pastry. Use a rolling pin, roll out the pastry to a 13-inch square then use your fingers to press the dough onto the bottom and sides of a 10 inch tart pan with removable bottom. Fold over any overhanging pastry into the pan to make a thick crust. Prick the bottom of the pastry with a fork. Place in the freezer for 5 to 10 minutes until firm.",
    "Heat the oven to 400 degrees F.",
    "Place a piece of parchment on top of the puff pastry and weigh down with dried beans. Place on a sheet tray and bake for 15 minutes.",
    "Remove tart shell from oven and take off the parchment and beans. Use the back of a spoon to press down the pastry if it has puffed up on the bottom.",
    "Whisk together the eggs, milk, thyme and a big pinch of salt and pepper in a large bowl until smooth.",
    "Add the potatoes to the tart shell by beginning on the outer edge and arranging in a concentric circle. Make two layers of potatoes and sprinkle half the bacon and half the cheese in between the layers. Season each layer with salt and pepper.",
    "Slowly pour the egg mixture over the potatoes and top with remaining bacon and cheese. Dot with butter.",
    "Bake for 45 minutes, checking on the crust about halfway through baking, and cover with foil if it gets too dark. Bake until golden and potatoes are cooked through.",
    "Let cool for 15 minutes before slicing."
  ],
  "ingredients": [
    "0",
    "All-purpose flour, for dusting",
    "1/2 of a 17.3-ounce package puff pastry (1 sheet), thawed",
    "5 large eggs",
    "1/4 cup whole milk",
    "1 teaspoons chopped fresh thyme leaves",
    "2 medium Yukon gold potatoes, peeled and thinly sliced 1/8 inch thick",
    "5 slices bacon, cooked and crumbled",
    "1/2 cup finely shredded Parmesan",
    "2 tablespoons butter, for topping",
    "Kosher salt and freshly ground black pepper"
  ],
  "__v": 1
}