{
  "hash": "405d1246b9d75a86105f555dcf0caa05a2baf299",
  "title": "Heat oil over high heat in a large pot or Dutch oven. Mix together chicken, cabbage, carrots, celery and barbecue sauce in a large bowl. 2. Working one wonton at a time, brush wonton wrapper with egg. Place a heaping teaspoon of filling into the center of the wrapper then fold over all four corners to create a little square envelope sort of shape. Repeat until all wontons are done. 3. Gently drop 4-6 wontons in the oil at a time, being careful not to crowd the pot. Fry until golden, about 1-3 minutes. Remove with slotted spoon and drain on paper towels. 4. Serve with ranch dressing.",
  "image": "http://lh3.ggpht.com/_DFDZJinU_do/TKE8O0iq6BI/AAAAAAAATC4/1GgMPhZ_DU0/s800/IMG_2579.JPG",
  "href": "https://www.mangeratrois.net/index.php/recipes/appetizer/977-barbecue-chicken-wontons",
  "extension": "Chrome",
  "firstAdded": "2015-03-30T00:00:44.791000",
  "users": [
    null
  ],
  "keywords": [
    "canola",
    "peanut",
    "oil",
    "frying",
    "boneless",
    "skinless",
    "chicken",
    "breasts",
    "cabbage",
    "carrots",
    "celery",
    "stalks",
    "barbecue",
    "eggs",
    "wonton",
    "wrappers",
    "ranch",
    "dressing",
    "dipping"
  ],
  "directions": [
    "0",
    "Heat oil over high heat in a large pot or Dutch oven. Mix together chicken, cabbage, carrots, celery and barbecue sauce in a large bowl.",
    "Working one wonton at a time, brush wonton wrapper with egg. Place a heaping teaspoon of filling into the center of the wrapper then fold over all four corners to create a little square envelope sort of shape. Repeat until all wontons are done.",
    "Gently drop 4-6 wontons in the oil at a time, being careful not to crowd the pot. Fry until golden, about 1-3 minutes. Remove with slotted spoon and drain on paper towels.",
    "Serve with ranch dressing."
  ],
  "ingredients": [
    "0",
    "Canola, vegetable, or peanut oil, for frying",
    "3-4 boneless, skinless chicken breasts, cooked and shredded",
    "2/3 cup cabbage, shredded",
    "2 large carrots, shredded",
    "2 celery stalks, shredded",
    "1 cup barbecue sauce",
    "2 eggs, beaten",
    "1 package wonton wrappers",
    "Ranch dressing, for dipping"
  ],
  "__v": 1
}