{
  "hash": "6e8944b80b00009976c7f7fea86a057ac2652b6f",
  "title": "Traditional Ukrainian Pierogies",
  "image": "http://3k0j0647ji3n23p72y2u5n65.wpengine.netdna-cdn.com/wp-content/uploads/2013/09/Pierogies-25.jpg",
  "href": "http://www.theblackpeppercorn.com/2013/09/traditional-ukrainian-pierogies/",
  "extension": "Chrome",
  "firstAdded": "2017-03-02T02:01:25.774000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To make the filling, boil the potatoes until tender. Drain water into a bowl. Set aside for later. Place cubed cheese on top of the cooked potatoes and cover with a lid. Let rest for about 5 minutes so that the cheese will melt. Sprinkle with 1 tsp salt and mash the potatoes and cheese with a hand blender, potato masher. Let cool to room temperature.",
    "To make the dough, add the flour, egg and ½ tsp salt to a food processor bowl. Turn on the food processor. Slowly pour in the potato water until the dough forms a ball and then turn off the food processor.",
    "Place the dough on a floured surface. Knead with floured hands. The dough should have the feel of pizza dough, elastic but not wet. Work in a little extra flour if the dough is too moist.",
    "Divide the dough in 3. Roll out one ball of dough to ⅛ inch thickness. Use a pierogi press to make pierogies or use the instructions below to make them by hand.",
    "Use a biscuit cutter or glass. Dredge the rim of a 3 to 3½ inch glass in flour, then press the glass into the rolled out dough to cut a circle of dough. Place the dough round in your hand and spoon about a heaping tablespoon of potato and cheese filling into the middle of the dough. Pull the dough over the filling and pinch the edges. If the dough is dry, moisten a finger in water to help seal the edge.",
    "Place the pierogi on a towel sprinkled with flour. Cover with another towel so the pierogi does not dry out. Continue to make the remaining pierogies.",
    "To cook the pierogies, place them in boiling for about 8-10 minutes. The pierogies should rise to the surface of the water when they are finished cooking.",
    "While the pierogies are boiling, fry the bacon or pork fat, until browned and crisp.",
    "Toss the cooked pierogies in bacon, and bacon grease or the pork fat.",
    "Serve with sour cream."
  ],
  "ingredients": [
    "0",
    "2 pounds potatoes, peeled and quartered",
    "200g (1/2 pound) medium cheddar cheese, cut into 1 inch cubes",
    "1 tsp salt",
    "4 cups of flour, plus more if needed",
    "1 egg",
    "½ tsp salt",
    "1 cup potato water at room temperature",
    "diced bacon or pork fat"
  ],
  "__v": 1
}