{
  "hash": "b0761983024d1b0c963b888102f8951c1409f15b",
  "title": "Chickpea and Herb Fatteh",
  "image": "",
  "href": "http://recipe-folder.com/recipe/5e284628f2c88a29c1754052",
  "extension": "User Added",
  "firstAdded": "2020-01-22T12:55:04.196000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place the dried chickpeas and 1 1/2 teaspoons baking soda in a large bowl. Top with enough cold water to cover by about 1 inch/3 centimeters, and let soak at room temperature for at least 8 hours or up to overnight.",
    "1",
    "Heat the oven to 375 degrees Fahrenheit/190 degrees Celsius.",
    "2",
    "Drain the chickpeas well and add them to a large saucepan along with the remaining 1 teaspoon baking soda. Add 6 cups/1 1/2 liters water. Bring to a simmer over medium-high heat, then lower the heat to medium and let cook until chickpeas are soft but retain a slight bite, 30 to 35 minutes. (The cook time can vary greatly depending on your chickpeas, so check them at the 20-minute mark to determine how long you need.)",
    "3",
    "Add 1 1/4 teaspoons salt and continue cooking until the chickpeas are supertender, 5 to 10 minutes more. Use a slotted spoon to set aside 2/3 cup/100 grams strained cooked chickpeas. Keep the rest warm on a low heat until ready to serve.",
    "4",
    "While the chickpeas are cooking, prepare the toppings: Toss the pita with 2 tablespoons oil, the za’atar, 1/4 teaspoon salt and a good grind of pepper, and spread out on a parchment-lined baking sheet. Bake until golden and crisp, tossing halfway through, about 12 minutes. Set aside to cool.",
    "5",
    "Make the tahini sauce: In a medium bowl, whisk the tahini, lemon juice and garlic with 1/3 cup/70 milliliters water and 1/4 teaspoon salt until smooth and pourable. The tahini sauce will thicken as it sits.",
    "6",
    "Make the chile oil: Add the oil and red-pepper flakes to a small frying pan. Heat over medium until gently bubbling and fragrant, about 4 minutes, then add the paprika and remove from heat. Set aside.",
    "7",
    "When ready to serve, add the reserved 2/3 cup/100 grams chickpeas to a food processor along with the fresh herbs, 2 1/2 tablespoons lemon juice, the garlic, cumin, 1/4 teaspoon salt, a good grind of pepper and the remaining 3 tablespoons oil. Blitz until smooth, then transfer to a large mixing bowl.",
    "8",
    "Drain the warm chickpeas using a sieve set over a bowl. Add the chickpeas and 3/4 cup/170 milliliters of their liquid to the herb mixture, mixing well to combine. You want the chickpeas to be well coated and the whole mixture to be saucy (but not overly wet), so add a couple more tablespoons of chickpea liquid if you wish (discard the remaining).",
    "9",
    "Transfer to a large platter with a lip. Drizzle lightly with some of the tahini sauce, then all of the chile oil. Sprinkle with half of the pita and serve warm, with the extra tahini and toasted pita alongside."
  ],
  "ingredients": [
    "0",
    "12 ounces/350 grams dried chickpeas",
    "1",
    "2 ½ teaspoons baking soda (bicarbonate of soda)",
    "2",
    "Kosher salt and black pepper",
    "3",
    "1 round white or whole-wheat pita (about 3 1/2 ounces/100 grams), pocket opened up, roughly torn into small 1-inch/2-to-3-centimeter pieces",
    "4",
    "5 tablespoons/75 milliliters olive oil",
    "5",
    "1 tablespoon za’atar",
    "6",
    "¾ packed cup/30 grams roughly chopped fresh cilantro (coriander) leaves and tender stems",
    "7",
    "⅔ packed cup/30 grams roughly chopped fresh parsley leaves and tender stems",
    "8",
    "⅔ cup/30 grams roughly chopped fresh chives",
    "9",
    "2 ½ tablespoons fresh lemon juice",
    "10",
    "2 garlic cloves, crushed using a garlic press",
    "11",
    "1 teaspoon cumin seeds, toasted, then roughly crushed",
    "12",
    "FOR THE TAHINI SAUCE:",
    "13",
    "⅓ cups/80 grams tahini",
    "14",
    "1 ½ tablespoons fresh lemon juice",
    "15",
    "1 garlic clove, crushed using a garlic press",
    "16",
    "FOR THE CHILE OIL:",
    "17",
    "2 ½ tablespoons olive oil",
    "18",
    "½ teaspoon red-pepper flakes",
    "19",
    "¼ teaspoon sweet paprika",
    "20",
    "Kosher salt and black pepper"
  ],
  "__v": 1,
  "hidden": true
}