{
  "hash": "62d55ce138e6954b02024dfdab387dd7c9f26d31",
  "title": "Cherry-Almond Granola Bars",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/cherry-almond-granola-bars",
  "extension": "Chrome",
  "firstAdded": "2017-01-14T16:54:31.196000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Preheat oven to 400°. Mix oats and almonds on a large heavy rimmed baking sheet. Bake, stirring once, until just golden, about 10 minutes. Transfer to a wire rack; let cool on sheet. Reduce oven temperature to 325°.",
    "Meanwhile, brush a 13x9x2” metal or glass baking dish with coconut oil. Line with parchment paper, allowing it to extend over long sides. Brush paper with oil.",
    "Brush a large bowl generously with oil. Place oat mixture, cherries, coconut, sunflower seeds, and flaxseeds in bowl.",
    "Bring ¼ cup oil, honey, sugar, and salt to a boil in a medium heavy deep saucepan, stirring to dissolve sugar. Boil for 1 minute. Immediately pour over oat mixture in bowl. Using a heatproof spatula, stir until evenly coated. Transfer granola to prepared pan. Lightly press evenly into pan; smooth top.",
    "Bake for 10 minutes. Turn pan; continue baking until golden brown with slightly darker edges, about 15 minutes longer.",
    "Transfer pan to a wire rack and let granola cool completely in pan. Using paper overhang, lift granola from pan. Cut into 24 bars. DO AHEAD: Bars can be made 4 days ahead. Store airtight at room temperature."
  ],
  "ingredients": [
    "0",
    "Cherry-Almond Granola Bars",
    "Sweet, salty, and a little chewy, this almond granola bars recipe comes in handy for breakfast or a midday treat.",
    "Ingredients",
    "MAKES 24 SERVINGS",
    "2¼ cups old-fashioned oats",
    "¾ cup whole raw almonds",
    "¼ cup coconut oil plus more",
    "¾ cup coarsely chopped dried tart cherries (about 4 oz.)",
    "¾ cup unsweetened finely shredded coconut (about 3 oz.)",
    "½ cup roasted unsalted shelled sunflower seeds (about 3 oz.)",
    "2 tablespoons flaxseeds, toasted",
    "½ cup honey",
    "½ cup (packed) light brown sugar",
    "1 teaspoon kosher salt"
  ],
  "__v": 1
}