{
  "hash": "11d64b8cd7db428171de1547c005d7cc79048f44",
  "title": "Coconut Fried Rice",
  "image": "https://africanbites.com/wp-content/uploads/2014/08/IMG_6787-2.jpg",
  "href": "https://www.africanbites.com/coconut-fried-rice/",
  "extension": "Chrome",
  "firstAdded": "2018-04-09T01:09:08.500000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place rice in a saucepan with water, rinse and sieve out water. Add coconut milk, water and salt. Place the saucepan over high heat and, bring to a boil.",
    "Stir saucepan then bring to a simmer- heat level should be very low cover the saucepan tightly with the lid. Continue cooking for about 15-18 minutes.",
    "Remove sauce from the heat and let it cool, covered. Fluff with fork",
    "Break up the clumpy rice before starting.",
    "Heat a large wok or skillet on medium high heat with about a tablespoon of canola or vegetable oil.",
    "Add the rice stir vigorously for about 2-3 minutes adding soy sauce, oyster sauce and a tablespoon or more of water or chicken/beef stock as need to moistened rice. Set aside. Quickly wipe the wok or skillet with a clean paper towel or cloth.",
    "Next add a table spoon of oil , let it heat up , then add the eggs and quickly stir to break the eggs apart. Remove and add to the rice.",
    "Continue with the stir frying by adding a tablespoon of oil into the wok, followed by onions, peas, carrots, minced garlic, curry powder, and chicken bouillon powder. Stir until fragrant for about 2 minutes.",
    "Finally return the combination of rice, and eggs, to the wok. Stir until everything has been fully combined. Adjust seasoning salt, pepper if necessary.",
    "Garnish with chopped scallion and serve"
  ],
  "ingredients": [
    "0",
    "Coconut Rice",
    "1 cup rice",
    "1 cup water",
    "1 cup coconut milk",
    "Coconut Fried Rice",
    "½ cup of canola or vegetable oil",
    "1/2 -1 Tablespoon soy sauce",
    "1/2-1 Tablespoon oyster sauce",
    "2 eggs lightly beaten",
    "½ small onion sliced",
    "1 teaspoon minced garlic",
    "1 cup peas and carrots",
    "½ tablespoon chicken bouillon powder",
    "¼-½ teaspoon of curry powder",
    "2-3 tablespoon of water or chicken stock optional",
    "Salt and pepper to taste"
  ],
  "__v": 1
}