{
  "hash": "a3327036e55c35689c519deffbe056e7cdd87d28",
  "title": "Easy Double Chocolate Mousse Recipe (Raw, Dairy-Free, Paleo)",
  "image": "http://gourmandeinthekitchen.com/wp-content/uploads/2013/05/Easy-Double-Chocolate-Mousse-via-GourmandeintheKitchen.com-raw-paleo-vegan.jpg?c3c4ca",
  "href": "http://gourmandeinthekitchen.com/2013/raw-chocolate-mousse-recipe/",
  "firstAdded": "2015-01-30T23:23:12.391000",
  "users": [
    null
  ],
  "keywords": [
    "raw",
    "cashews",
    "soaked",
    "overnight",
    "water",
    "medjool",
    "dates",
    "filtered",
    "needed",
    "cupml",
    "coconut",
    "oil",
    "cacao",
    "natural",
    "cocoa",
    "himalayan",
    "salt",
    "bean",
    "split",
    "seeds",
    "scraped",
    "vanilla",
    "real",
    "maple",
    "syrup",
    "tablespoonsg",
    "extra",
    "virgin",
    "unrefined",
    "organic",
    "nibs",
    "berries"
  ],
  "directions": [
    "0",
    "Cover the cashews and pitted dates with water and soak for at least 4 hours or overnight in the fridge.",
    "Drain cashews and dates and place in a high-speed blender with filtered water, melted coconut oil, cacao powder, salt and the seeds from the vanilla bean. Blend until completely smooth, scraping down the sides with a spatula occasionally adding extra water a Tablespoon at a time as needed. The mixture should be creamy, smooth and the consistency of a loose batter when done, mousse will set and firm as it cools in the fridge.",
    "Spoon mousse into individual serving bowls and place in fridge while making ganache.",
    "In the food processor, blend together the maple syrup and melted coconut oil until well combined.",
    "Add in the cacao powder and process until smooth scraping down the sides as needed.",
    "Pour the chocolate ganache over mousse and top with cacao nibs if desired, cover and chill for at least 3 to 4 hours or overnight.",
    "Remove mousse from fridge at least 10 minutes before serving for a creamier consistency or serve chilled for a thicker consistency. Serve with berries on the side if desired."
  ],
  "ingredients": [
    "0",
    "1 cup/ 112g raw cashews, soaked overnight in water",
    "160g/ about 8 large Medjool dates, pitted and soaked overnight in water",
    "¾ cup of filtered water (plus more if needed)",
    "1/4 cup/60ml coconut oil, melted",
    "6 Tablespoons/ 28g raw cacao powder (or natural cocoa powder)",
    "1/4 tsp sea or Himalayan salt",
    "1 vanilla bean, split and seeds scraped (or 1 tsp vanilla extract)",
    "½ cup/120ml real maple syrup",
    "2 Tablespoons/30g extra virgin unrefined coconut oil, melted",
    "6 Tablespoons/ 28g raw organic cacao powder",
    "Raw cacao nibs or berries for garnish (optional)"
  ],
  "__v": 1
}