{
  "hash": "808417a1ed1c933fb631ec26cb95063360ca7f79",
  "title": "CRISPY CHICKEN SANDWICH WITH BLUE CHEESE SLAW",
  "image": "http://www.presidentschoice.ca/content/dam/lclonline/images/recipes/pc_crispychickensandwichwbluecheesecarrotslaw_r_500x500.jpg.thumb.405.430.margin.png",
  "href": "http://www.presidentschoice.ca/en_CA/recipes/recipeslisting/crispy-chicken-sandwich-with-blue-cheese-slaw.html",
  "extension": "",
  "firstAdded": "2016-05-15T13:26:20.079000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350째F (180째C). Line rimmed baking sheet with foil; spray with cooking spray.",
    "Toss together coleslaw, blue cheese, mayonnaise, Dijon, vinegar and pepper in large bowl; set aside.",
    "Add panko to large frying pan; spray lightly with cooking spray. Toast over medium heat for 7 to 10 minutes, stirring often, or until golden brown; transfer to wide shallow dish.",
    "Place flour in another shallow dish. Whisk eggs together with 1/4 cup (50 mL) water in third shallow dish.",
    "Unroll chicken thighs. Working one at a time, dip first into flour to coat all over, shaking off excess. Next, coat in egg, letting excess drip back into bowl. Transfer to panko bowl; press to coat all over, shaking off excess. Arrange on prepared baking sheet. Repeat with remaining thighs. Discard any leftover flour, egg and panko.",
    "Bake in centre of oven for 10 minutes. Turn chicken; continue to bake about 5 minutes longer or until chicken is crispy and golden and internal temperature reaches 165째F (75째C). Transfer to cutting board.",
    "Cut thighs in half; stack on bottoms of buns. Drizzle a heaping 1 tbsp (15 mL) hot sauce over top of each; mound coleslaw on top and sandwich with bun tops."
  ],
  "ingredients": [
    "0",
    "1 pkg (340 g) PC Fresh Cut Washed Coleslaw",
    "Half 125 g-pkg PC Blue Cheese,crumbled",
    "1/4 cup (50 mL) mayonnaise",
    "1 tbsp (15 mL) Dijon mustard",
    "1 tsp (5 mL) white wine vinegar",
    "Pinch freshly ground black pepper",
    "1 cup (250 mL) PC BLACK LABEL PANKO JAPANESE-STYLE BREAD CRUMBS",
    "1/4 cup (50 mL) all-purpose flour",
    "2 eggs",
    "1 pkg PC Free From Boneless Skinless Air-Chilled Chicken Thighs, about 1 lb (500 g)",
    "1 pkg (336 g) PC Ciabatta Burger Buns",
    "1/2 cup (125 mL) PC Smoky Bacon Hot Sauce"
  ],
  "__v": 3
}