{
  "__v": 1,
  "directions": [
    "0",
    "Cut the 2 ends off the eggplants. Cut the eggplants lengthwise, into 1/4-inch thick slices until you have a total of 10 slices about the same size. It's easiest to do this with a mandolin. My mandolin is from OXO,",
    "Sprinkle the eggplant with kosher salt to help remove excess moisture and bitterness from the eggplants. Set aside for about 10 to 15 minutes. Pat dry with a towel.",
    "Preheat oven to 400°F. Season the eggplant with a little more salt and pepper, then arrange on two parchment-lined baking sheets. Cover tightly with foil and bake until eggplant is tender and pliable but NOT fully cooked, about 8 to 10 minutes.",
    "Spread 1/4 cup marinara sauce on the bottom of a 13 x 9-inch baking dish.",
    "In a medium bowl, beat the egg then mix together with ricotta, Pecorino Romano, spinach, garlic, 1/4 tsp salt and 1/8 tsp pepper.",
    "Pat eggplant dry with paper towels. Dividing the ricotta-spinach mixture (about 2 generous tablespoons each) evenly and spoon onto one end of each eggplant slice, spreading to cover. Starting at the short end, roll up slices and arrange them each seam side down in the prepared dish. Top with remaining marinara sauce and mozzarella cheese and tightly cover with foil.",
    "Bake until the eggplant is very tender, about 60 minutes. Remove from oven and let cool 5 minutes before serving with additional Pecorino Romano if desired."
  ],
  "firstAdded": "2014-07-08T22:37:18.397000",
  "hash": "04a11864bfb4dd64cd6ce1ae7043a835c8fa78df",
  "href": "http://www.skinnytaste.com/2013/09/best-skinny-eggplant-rollatini-with.html",
  "image": "http://2.bp.blogspot.com/-WmzrLklPsm8/UjnJTKy08wI/AAAAAAAAMDk/z70b466NFrQ/s1600/skinny-eggplant-rollatini-with-spinach.jpg",
  "ingredients": [
    "0",
    "2 medium Italian eggplants, cut lengthwise into 10 (1/4-inch thick) slices (21 oz total when sliced)",
    "kosher salt and fresh black pepper, to taste",
    "1 1/2 cups quick marinara sauce",
    "1 large egg",
    "1/2 cup part skim ricotta cheese",
    "1/2 cup grated Pecorino Romano cheese, plus more for serving",
    "8 oz frozen spinach, heated through and squeezed well",
    "1 garlic clove, minced",
    "1 cup (4 oz) shredded part-skim mozzarella (Polly-O)"
  ],
  "keywords": [
    "medium",
    "italian",
    "eggplants",
    "lengthwise",
    "slices",
    "total",
    "kosher",
    "salt",
    "black",
    "pepper",
    "quick",
    "marinara",
    "egg",
    "skim",
    "ricotta",
    "cheese",
    "pecorino",
    "romano",
    "frozen",
    "spinach",
    "heated",
    "squeezed",
    "garlic",
    "clove",
    "partskim",
    "mozzarella",
    "pollyo"
  ],
  "title": "Eggplant Rollatini with Spinach",
  "users": [
    null
  ]
}