{
  "hash": "7d32d6b56dfb12594851bc6400b3ecc76756917c",
  "title": "Homemade Peanut Butter Cups",
  "image": "http://content1.tastebook.com/content/photo/user_photo/oqQcAQmK13c223331333130313g8RcEYCw_1446278809.jpg",
  "href": "http://www.tastebook.com/recipes/4316229-Homemade-Peanut-Butter-Cups",
  "extension": "Firefox",
  "firstAdded": "2015-10-31T13:15:05.819000",
  "users": [
    null
  ],
  "keywords": [
    "dark",
    "semisweet",
    "chocolate",
    "chip",
    "morsels",
    "smooth",
    "crunchy",
    "peanut",
    "butter",
    "unsalted",
    "softened",
    "confectioners",
    "sugar"
  ],
  "directions": [
    "0",
    "directions",
    "1",
    "Place 18 mini-cupcake liners into a mini muffin tin.",
    "2",
    "There are two ways to temper the chocolate: A) Add a few inches of water to a medium pot and bring to a boil over high heat. In a heatproof bowl, add half the bag of chocolate. Carefully set the bowl over the water. Gently stir until chocolate is melted. Or B) Place the chocolate chips into a Ziploc bag or heat-proof bowl and gently warm the chocolate chips in the microwave in increments of 10 to 15 seconds, depending on the heat of your microwave. Stir the chips if in bowl or gently smash them if in the Ziploc bag after each heating. Continue until chocolate is completely melted.",
    "3",
    "Use a spoon to put a dollop of chocolate into each of the 18 cupcake liners. If melting the chocolate in the Ziploc bag, use scissors to snip off an edge of the bag and pipe the chocolate directly into the liners. As you’re working, take breaks to tap the pan onto the counter so the chocolate flattens. Or, just use a spoon to flatten it. If the melted chocolate gets hard as you work, briefly place back onto water bath or in microwave.",
    "4",
    "Place muffin tin in the freezer for 20 minutes allowing the chocolate to harden.",
    "5",
    "Meanwhile, in a mixing bowl, add peanut butter, softened butter, and sugar. Using a hand-held mixer, combine until peanut butter mixture is smooth. Taste, adding more sugar if you like your peanut butter filling to be sweeter. Use a spoon to distribute the peanut butter mixture over the chocolate in each cupcake liner. Again, tap the pan onto the counter so the peanut butter flattens out. Place muffin tin in the freezer for another 20 minutes for the peanut butter to set.",
    "6",
    "Repeat step 2 for tempering the remaining chocolate and step 3 for pouring the chocolate over the peanut butter layer. Place muffin tin in the freezer for 20 minutes to allow the chocolate to harden.",
    "7",
    "Remove the peanut butter cups from the muffin tin and transfer into an airtight container or Ziploc bag. Eat and enjoy! I found these best when kept in the freezer."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 10-ounce bag dark or semi-sweet chocolate chip morsels",
    "1 cup smooth or crunchy peanut butter",
    "1/2 stick unsalted butter, softened",
    "1/2 cup confectioner’s sugar"
  ],
  "__v": 1
}