{
  "hash": "cc80ea8dffa7f635bd86c3e288d20ae233949413",
  "title": "Buffalo Chicken Mozzarella Logs",
  "image": "http://i1.wp.com/hostthetoast.com/wp-content/uploads/2015/01/Buffalo-Chicken-Mozzarella-Logs8.jpg?w=205",
  "href": "http://hostthetoast.com/buffalo-chicken-mozzarella-logs/",
  "extension": "Chrome",
  "firstAdded": "2015-07-31T01:00:12.516000",
  "users": [
    null
  ],
  "keywords": [
    "simple",
    "slow",
    "cooker",
    "buffalo",
    "chicken",
    "pack",
    "mozzarella",
    "string",
    "cheese",
    "egg",
    "roll",
    "wrappers",
    "white",
    "oil",
    "frying",
    "ranch",
    "andor",
    "blue",
    "dip",
    "green",
    "onion"
  ],
  "directions": [
    "0",
    "Prepare the buffalo chicken.",
    "Heat 1\" of oil in a high-walled, heavy-bottomed pan over medium-high heat.",
    "In a small bowl, whisk together the egg white and a tablespoon of water. Set out the egg roll wrappers, covering the stack with a lightly dampened rag or paper towel as you work so that they don't dry out.",
    "Take one egg roll wrapper from the stack and place it down in front of you so that it is positioned like a diamond (one corner pointing toward you, one away from you). In a line down the center of the egg roll, scoop 2 tablespoons of buffalo chicken. Make sure that you let excess buffalo sauce drip off before placing it into the egg roll wrapper so that the wrapper doesn't get soggy.",
    "On top of the buffalo chicken, place a mozzarella string cheese stick.",
    "Fold the top corner of the egg roll wrapper down. Fold the bottom corner up. Using a pastry brush, brush the egg mixture on the right side of the egg roll wrapper.",
    "Fold the left side of the egg roll wrapper over the buffalo chicken and cheese, and tuck the corner under slightly, like you would a burrito. Roll the egg roll over so that the egg white sticks the right side to the rest of the egg roll. You should now have the typical egg roll shape. Check to make sure there are no tears or gaps (if they are, push them together and seal with egg white). Set aside.",
    "Continue until all of the egg rolls have been formed.",
    "When the oil reaches 350 degrees F, place in 3 of the egg rolls, seam-side down. (You can tell the oil is ready when you stick the handle of a wooden spoon in the very center of the pan, and the oil begins to bubble around it.) Cook until golden and crisp, turning to brown evenly. Remove the egg rolls from the oil and let drain on a paper towel while you fry the next batch.",
    "Serve warm with buffalo sauce, ranch, and/or blue cheese, and green onion to garnish!"
  ],
  "ingredients": [
    "0",
    "1½ cups Simple Shredded Slow Cooker Buffalo Chicken",
    "1 pack of 12 mozzarella string cheese sticks",
    "1 pack of 12 egg roll wrappers",
    "1 large egg white",
    "Oil, for frying",
    "Buffalo sauce, ranch, and/or blue cheese, to dip",
    "Green onion, to garnish"
  ],
  "__v": 1
}