{
  "hash": "de97e51df41f32387e2c1f03cf7614e807f06707",
  "title": "Fig Ice Cream",
  "image": "http://alanroettinger.com/vegan/wp-content/uploads/2015/06/Figs-with-Fig-Ice-Cream-header-610x300.jpg",
  "href": "http://alanroettinger.com/2015/07/01/fig-ice-cream/",
  "extension": "Chrome",
  "firstAdded": "2015-07-01T12:59:23.051000",
  "users": [
    null
  ],
  "keywords": [
    "makes",
    "black",
    "mission",
    "turkey",
    "figs",
    "rich",
    "sweetened",
    "almond",
    "milk",
    "cashews",
    "soaked",
    "water",
    "hours",
    "organic",
    "unbleached",
    "cane",
    "sugar",
    "bean",
    "vanilla",
    "squeezed",
    "lemon",
    "juice",
    "fig"
  ],
  "directions": [
    "0",
    "Put the peeled, quartered figs, almond milk, cashews, cane sugar, vanilla bean and lemon juice in a blender and process until smooth. Taste and add more cane sugar, if desired. Pour into a bowl and refrigerate until cold, at least 2 hours.",
    "Pour the fig mixture into an ice cream machine and freeze according to the manufacturer’s instructions. When the ice cream is nearly firm, stir in the diced figs. Serve at once, or scrape into a container and freeze until firm. For best results, remove from the freezer and allow it to soften slightly 20 minutes before serving.",
    "The picture below shows the ice cream, served with that “Caramelized Figs with Almond Cream” I mentioned above. If you want to try it, the recipe is in The Almond Milk Cookbook. This presentation is gratuitous, I admit, but if you can manage it, you’ll understand. You won’t be sorry, I’ll say that. However, if you’d rather keep it simple, you don’t need to do the whole fig fandango to get your sweet fig fix. The ice cream is a fabulous treat all by itself, trust me."
  ],
  "ingredients": [
    "0",
    "Makes 1 quart",
    "3 cups ripe black mission or Turkey figs, peeled and quartered",
    "2 cups Rich Almond Milk*, or sweetened almond milk",
    "¾ cup cashews, soaked in water 8 hours, and drained",
    "6 tablespoons organic unbleached cane sugar, plus more, to taste",
    "½ vanilla bean, or ½ teaspoon vanilla extract",
    "1 tablespoon freshly squeezed lemon juice",
    "1 cup ripe black mission or Turkey fig"
  ],
  "__v": 1
}