{
  "hash": "11c69ba616d6b3b80b585c41930648cb0f3d2b56",
  "title": "zucchini fritters",
  "image": "http://farm7.static.flickr.com/6187/6075468562_8fd29a0c83.jpg",
  "href": "http://smittenkitchen.com/blog/2011/08/zucchini-fritters/",
  "extension": "Chrome",
  "firstAdded": "2016-01-21T09:05:46.024000",
  "users": [
    null
  ],
  "keywords": [
    "yield",
    "fritters",
    "medium",
    "zucchini",
    "coarse",
    "kosher",
    "salt",
    "extra",
    "scallions",
    "split",
    "lengthwise",
    "egg",
    "lightly",
    "black",
    "pepper",
    "allpurpose",
    "flour",
    "baking",
    "olive",
    "oil",
    "frying",
    "serve",
    "sour",
    "cream",
    "plain",
    "fullfat",
    "yogurt",
    "lemon",
    "juice",
    "zest",
    "pinches",
    "clove",
    "garlic"
  ],
  "directions": [
    "0",
    "Preheat oven to 200 degrees. Have a baking sheet ready.",
    "Trim ends off zucchini and grate them either on the large holes of a box grater or, if you have one, using the shredding blade of a food processor. The latter is my favorite as I’m convinced it creates the coarsest and most rope-like strands and frankly, I like my fritters to look like mops.",
    "In a large bowl, toss zucchini with 1 teaspoon coarse salt and set aside for 10 minutes. Wring out the zucchini in one of the following ways: pressing it against the holes of a colander with a wooden spoon to extract the water, squeezing out small handfuls at a time, or wrapping it up in a clean dishtowel or piece of cheese cloth and wringing away. You’ll be shocked (I was!) by the amount of liquid you’ll lose, but this is a good thing as it will save the fritters from sogginess.",
    "Return deflated mass of zucchini shreds to bowl. Taste and if you think it could benefit from more salt (most rinses down the drain), add a little bit more; we found 1/4 teaspoon more just right. Stir in scallions, egg and some freshly ground black pepper. In a tiny dish, stir together flour and baking powder, then stir the mixture into the zucchini batter.",
    "In a large heavy skillet — cast iron is dreamy here — heat 2 tablespoons of oil over medium-high heat until shimmering. Drop small bunches of the zucchini mixture onto the skillet only a few at a time so they don’t become crowded and lightly nudge them flatter with the back of your spatula. Cook the fritters over moderately high heat until the edges underneath are golden, about 3 to 4 minutes. If you find this happening too quickly, reduce the heat to medium. Flip the fritters and fry them on the other side until browned underneath again, about 2 to 3 minutes more. Drain briefly on paper towels then transfer to baking sheet and then into the warm oven until needed. Repeat process, keeping the pan well-oiled, with remaining batter. I like to make sure that the fritters have at least 10 minutes in the oven to finish setting and getting extra crisp.",
    "For the topping, if using, stir together the sour cream, lemon juice, zest, salt and garlic and adjust the flavors to your taste. Dollop on each fritter before serving. These fritters are also delicious with a poached or fried egg on top, trust me.",
    "Do ahead: These fritters keep well, either chilled in the fridge for the better part of a week and or frozen in a well-sealed package for months. When you’re ready to use them, simply spread them out on a tray in a 325 degree oven until they’re hot and crisp again."
  ],
  "ingredients": [
    "0",
    "Yield: About 10 2 1/2 inch fritters",
    "1 pound (about 2 medium) zucchini",
    "1 teaspoon coarse or Kosher salt, plus extra to taste",
    "2 scallions, split lengthwise and sliced thin",
    "1 large egg, lightly beaten",
    "Freshly ground black pepper",
    "1/2 cup all-purpose flour",
    "1/2 teaspoon baking powder",
    "Olive or another oil of your choice, for frying",
    "To serve (optional)",
    "1 cup sour cream or plain, full-fat yogurt",
    "1 to 2 tablespoon lemon juice",
    "1/4 teaspoon lemon zest",
    "Pinches of salt",
    "1 small minced or crushed clove of garlic"
  ],
  "__v": 1
}