{
  "hash": "e363c66b18320af0717a0b9eb7c5b10cef8d897c",
  "title": "Almost-Famous Rosemary Bread",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/food-network-kitchens/almost-famous-rosemary-bread-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-06-08T22:34:59.636000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Stir the yeast, sugar and 1/4 cup warm water in a large bowl (or in the bowl of a stand mixer). Let sit until foamy, about 5 minutes.",
    "Add 1 tablespoon olive oil, the flour, 1 1/2 tablespoons rosemary, the fine salt and 3/4 cup warm water; stir with a wooden spoon (or with the dough hook if using a mixer) until a dough forms.",
    "Turn the dough out onto a lightly floured surface and knead, dusting lightly with flour if necessary, until smooth and elastic, about 10 minutes. (Or knead with the dough hook on medium-high speed, adding a little flour if the dough sticks to the bowl, about 8 minutes.)",
    "Brush a large bowl with olive oil. Add the dough, cover with plastic wrap and let stand at room temperature until more than doubled, about 2 hours.",
    "Brush 2 baking sheets with olive oil. Generously flour a work surface; turn the dough out onto the flour and divide into 4 pieces. Working with one piece at a time, sprinkle some flour on the dough, then fold the top and bottom portions into the middle. Fold in the sides to make a free-form square. Use a spatula to turn the dough over, then tuck the corners under to form a ball. Place seam-side down on a prepared baking sheet. Repeat with the remaining dough, putting 2 balls on each baking sheet. Let stand, uncovered, until more than doubled, about 2 hours.",
    "Preheat the oven to 400 degrees F. Bake the loaves 10 minutes; brush with the remaining 1 tablespoon olive oil and sprinkle with the kosher salt and the remaining 1/2 tablespoon rosemary. Continue baking until golden brown, about 10 more minutes. Transfer to a rack to cool. Serve with olive oil seasoned with pepper.",
    "Photograph by Lisa Shin",
    "Recipe courtesy of Food Network Magazine"
  ],
  "ingredients": [
    "0",
    "1 1/4 -ounce packet active dry yeast",
    "2 teaspoons sugar",
    "2 tablespoons extra-virgin olive oil, plus more for brushing and serving",
    "2 1/2 cups all-purpose flour, plus more for dusting",
    "2 tablespoons dried rosemary",
    "1 teaspoon fine salt",
    "1/2 teaspoon kosher salt Freshly ground pepper"
  ],
  "__v": 1
}