{
  "hash": "34cb167011a4c4763dafa980a80b95d20cebf390",
  "title": "Tofu and Mushroom Stir-Fry",
  "image": "",
  "href": "https://www.bonappetit.com/recipe/tofu-and-mushroom-stir-fry",
  "extension": "Firefox",
  "firstAdded": "2018-10-21T17:12:15.340000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Stir-fries are all about cooking quickly and over high heat, so the key to success is prepping your ingredients beforehand so you’re ready to go.",
    "Cut 14-oz. block of tofu into 1x¼\" pieces. Place pieces on a paper-towel lined plate and press a paper towel over top of pieces to absorb excess water.",
    "Remove any dirt from 1 lb. mushrooms with a damp paper towel and tear into 1\" pieces.THE KEY TO CRISPY MUSHROOMS? NEVER WASH THEM.",
    "Trim root ends of 6 scallions, then slice them crosswise into 1\" pieces.",
    "Peel 2-inch piece ginger with a spoon and thinly slice crosswise.",
    "Toss tofu, 1½ tsp. cornstarch, ½ tsp. red pepper flakes, a pinch of salt, and 1 Tbsp. soy sauce in a medium bowl.Slide 1 of 2PreviousNext",
    "Stir 2 Tbsp. vinegar, 2 Tbsp. wine, and remaining 2 Tbsp. soy sauce in a small bowl.",
    "Heat 1 Tbsp. oil in a large skillet, preferably nonstick, over medium-high. When oil is shimmering and slides quickly across surface of pan, add mushrooms, scallions, and ginger and cook, tossing often, until mushrooms and scallions are browned in spots and mushrooms are tender, 5–7 minutes. Season lightly with salt and transfer to another medium bowl.",
    "Heat 1 Tbsp. oil in same skillet over high. When oil is shimmering again, add tofu mixture and arrange in a single layer in skillet. Cook, undisturbed, until tofu is browned on first side, about 2 minutes. Add a touch more oil if skillet is very dry or tofu is sticking, then turn pieces and continue to cook, undisturbed again, until second side is browned, about a minute or two longer. If your skillet isn’t nonstick, you might need to loosen the tofu by scraping skillet with a spatula.",
    "Add wine mixture and mushroom mixture back to skillet. Cook, tossing briskly, until sauce is thickened and all ingredients are coated, about 30 seconds. Remove from heat. Taste and season with salt, if needed.",
    "Serve stir-fry over rice. Top with sesame seeds."
  ],
  "ingredients": [
    "0",
    "1 14-ounce block extra-firm tofu, drained",
    "1 pound mixed mushrooms, such as maitake, shiitake, oyster, button, and/or crimini",
    "6 scallions",
    "1 2-inch piece ginger",
    "1½ teaspoons cornstarch",
    "½ teaspoon crushed red pepper flakes",
    "Kosher salt",
    "3 tablespoons soy sauce, divided",
    "2 tablespoons seasoned rice vinegar",
    "2 tablespoons Shaoxing wine (Chinese rice wine) or mirin",
    "2 tablespoons vegetable oil, divided, plus more",
    "Steamed white rice and sesame seeds (for serving)"
  ],
  "__v": 1
}