{
  "hash": "c876fb8a305ad12bc6eb455f581dc5556ae4f44d",
  "title": "Vegan Chocolate Chip Cookie",
  "image": "",
  "href": "http://www.vogue.com/2042461/ovenly-vegan-chocolate-chip-cookie-recipe/",
  "extension": "Chrome",
  "firstAdded": "2015-05-09T00:20:36.284000",
  "users": [
    null
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "baking",
    "soda",
    "salt",
    "dark",
    "chips",
    "prefer",
    "chocolate",
    "percent",
    "cocoa",
    "content",
    "higher",
    "sugar",
    "light",
    "brown",
    "canola",
    "oil",
    "water"
  ],
  "directions": [
    "0",
    "In a large bowl, whisk together flour, baking powder, baking soda, and salt. Add the chocolate chips to the flour mixture and toss to coat.",
    "In a separate large bowl, whisk the sugars briskly with the canola oil and water until smooth and incorporated, about 2 minutes. Note: use fresh, soft light brown sugar. If there are clumps, break them up with the back of a spoon or your hand before whisking.",
    "Add the flour mixture to the sugar mixture, and then stir with a wooden spoon or a rubber spatula until just combined and no flour is visible. Do not overmix.",
    "Cover with plastic wrap. Refrigerate the dough for at least 12 hours and up to 24 hours. Do not skip this step.",
    "Preheat the oven to 350°. Line a rimmed sheet pan with parchment paper.",
    "Remove dough from the refrigerator and use an ice cream scoop or a spoon to portion dough into 2-inch mounds. We recommend freezing the balls of dough for 10 minutes before baking as the cookies will retain their shape better while baking.",
    "Sprinkle the balls of dough with coarse-grained sea salt (if freezing, remove balls of dough from the freezer first), and bake for 12 to 13 minutes, or until the edges are just golden. Do not overbake.",
    "Let cool completely before serving.",
    "Excerpted from Ovenly by Agatha Kulaga and Erin Patinkin (Harlequin). Copyright © 2014. Photographs by Winona Barton-Ballentine.",
    "We love to experiment with our base recipes. This dough is incredibly versatile and easy to work with. Try adding in fresh herbs or spices, substituting flavored oils, or dress them up by sandwiching some buttercream in between two cookies and offer them as party favors. You can get creative and try these combinations or create your own! Here are some of our favorite variations:",
    "*Substitute the chocolate chips with flaked coconut and toasted almonds, and add in ¼ teaspoon almond extract to the oil/water mixture.",
    "*Instead of canola oil, use half hazelnut oil and half safflower oil and add dark chocolate pieces instead of chocolate chips.",
    "*Mix one tablespoon of ground cinnamon into the flour mixture, and add milk chocolate chips and currants.",
    "*Prepare your favorite buttercream recipe and add in ¼ cup bourbon (or even champagne). Mix until smooth and sandwich in between two cookies to make cookie sandwiches."
  ],
  "ingredients": [
    "0",
    "2 cups all-purpose flour",
    "1 tsp. baking powder",
    "3/4 tsp. baking soda",
    "1/2 tsp. salt",
    "1 ¼ cup dark chocolate chips (we prefer chocolate with 60 percent cocoa content or higher)",
    "1/2 cup sugar",
    "1/2 cup (packed) light brown sugar",
    "1/2 cup + 1 tablespoon canola oil",
    "1/4 cup + 1 tablespoon water"
  ],
  "__v": 1
}