{
  "hash": "0b064aeca28fe9d33653038e4d92d9de7bc29286",
  "title": "Classic Seafood Paella",
  "image": "http://www.finecooking.com/CMS/uploadedImages/Images/Cooking/Articles/Issues_101-110/051105073-01-seafood-paella_xlg.jpg",
  "href": "http://www.finecooking.com/recipes/classic-seafood-paella.aspx",
  "extension": "Chrome",
  "firstAdded": "2016-05-08T13:11:23.160000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a small saucepan set over medium-low heat, toast the saffron until fragrant, 30 to 60 seconds. Off the heat, use the back of a small spoon to crush the saffron as finely as possible. Add the clam juice and bring to a boil over high heat. Immediately remove from the heat and set aside to infuse.",
    "Halve and peel the onion. Grate the onion halves on the largest holes of a box grater to get about 1/3 cup of onion purée. Cut the tomato in half horizontally (not through the stem). Grate the tomato halves on the box grater all the way down to the skin to get about 1-1/4 cups juicy tomato pulp.\nSet a 16-inch paella pan over medium-low heat. Add 1/4 cup of the oil and when it’s hot, add the grated onion. Cook the onion in the center of the pan, stirring occasionally, until it softens and darkens slightly, about 4 minutes. Stir in the tomato pulp, chopped and whole garlic, pimentón, and 1/4 tsp. salt. Gently cook the mixture in the center of the pan, stirring frequently, until it’s deep, dark red and very thick, 30 to 40 minutes. Adjust the heat as needed, being careful not to let it burn. If it starts to stick, deglaze by adding a little water and scraping the pan.",
    "While the sofrito cooks, put the shrimp shells in a 4-quart saucepan. Stir over medium-high heat until they’re dry and pink, 2 to 3 minutes. Add 5 cups water and bring to a boil. Pick through the mussels to find the smallest twelve. Remove the beards if present, and reserve the mussels in the refrigerator. Add the remaining mussels to the boiling water. Cover, reduce the heat to low, and simmer for 10 minutes. Strain the broth into a 2-quart liquid measure, discarding the shells and mussels. Add the saffron-clam broth and 1-1/2 tsp. salt to the shrimp-mussel broth. Measure out 5-1/4 cups of the broth, reserving the remainder.",
    "When the sofrito is done, add the rice to the paella pan and cook briefly over medium heat, stirring constantly to combine it with the sofrito, 1 to 2 minutes. Spread the rice evenly in the pan. Increase the heat to high and slowly pour in the 5-1/4 cups broth—try not to disturb the rice so it stays in an even layer. From this point on, do not stir the rice. Bring to a boil and then adjust the heat to maintain a vigorous simmer, repositioning the pan as needed so it bubbles all the way to the edges (the bubbles at the edge will be much smaller than the bubbles at the center). Simmer vigorously until the rice appears at the level of the broth, about 8 minutes.\nArrange the reserved mussels in the pan, distributing them evenly. Lower the heat so the broth maintains a more moderate simmer, and after another 5 minutes, arrange the shrimp in the pan, pushing them into the rice. Continue simmering until the liquid is absorbed and the rice is tender but still firm(taste a few grains below the top layer), about 5 minutes more. The rice needs to simmer for roughly 18 minutes total. If at any point the broth seems to be evaporating too quickly, reduce the heat slightly, cover loosely with sheets of foil, or add a little more broth or water, 1/4 cup at a time as needed. Also, if the mussels or shrimp are still undercooked by the time the rice is done, cover loosely with foil for a few minutes to trap the heat and finish the cooking.\nWhile the paella cooks, lightly season the scallops with salt. Heat the remaining 2 tsp. oil in a 10-inch nonstick skillet over medium-high heat. Add the scallops and cook until nicely browned on both sides and just cooked through, 2 to 3 minutes per side.\nWhen the rice is done, arrange the scallops on top of the paella. Check for any caramelized rice sticking to the pan by using a spoon to feel for resistance on the bottom of the pan. Check in several areas, especially in the center of the pan. If there is none, increase the heat to medium high and carefully cook, moving the pan around, until you hear a good deal of crackling and feel resistance, 1 to 2 minutes; if you smell burning, immediately remove the pan from the heat.\nRemove the pan from the heat, cover with a clean dishtowel, and let rest for 5 to 10 minutes. Arrange the lemon wedges around the perimeter of the pan.",
    "Turn the paella into a paella party by adding Gazpacho Shots and Grilled Figs with Ice Cream."
  ],
  "ingredients": [
    "0",
    "1/4 tsp. crumbled saffron threads",
    "One 8-oz. bottle clam juice",
    "1 small yellow onion (4 oz.)",
    "1 very large or 2 small ripe tomatoes (12 oz. total)",
    "1/4 cup plus 2 tsp. extra-virgin olive oil",
    "8 medium cloves garlic, 4 finely chopped, 4 peeled but whole",
    "1/2 tsp. sweet or hot pimentón (smoked paprika)",
    "Kosher salt",
    "12 large (31 to 40 per lb.) shrimp, peeled with tail segment left intact and deveined (reserve the shells)",
    "1 lb. mussels, rinsed well",
    "1-3/4 cups Spanish bomba rice",
    "12 all-natural (dry-packed) sea scallops, side muscles removed",
    "1 medium lemon, sliced or cut in wedges"
  ],
  "__v": 1
}