{
  "hash": "ea28877bef3317d365e4c4b87a098fce0788b68d",
  "title": "Paneer Tikka Masala",
  "image": "https://www.cookwithmanali.com/wp-content/uploads/2014/04/Paneer-Tikka-Masala-notitle-cwm.jpg",
  "href": "https://www.cookwithmanali.com/paneer-tikka-masala/",
  "extension": "Chrome",
  "firstAdded": "2020-06-09T16:37:25.214000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Paneer Tikka",
    "Cut the paneer into small cubes, add in the chopped ginger, garlic, coriander powder, garam masala powder, paprika powder, salt and red chilli powder.",
    "Add in the yogurt and mix till all the paneer pieces are well coated with the spices and yogurt.",
    "Cover and keep this marinated paneer in the refrigerator for 30-40 minutes.",
    "Masala/Curry",
    "Heat 1 tbsp of butter and 1 tbsp of oil in a pan. Once hot add cinnamon stick and cumin seeds.",
    "Once the seeds crackle, add the chopped onions, crushed garlic pods and chopped ginger. Fry till onions turn golden brown in color.",
    "Once onions are done, add the tomatoes and the curry powder and mix. Also add the the salt and sugar.",
    "Cook the tomatoes on medium flame till they are soft, around 6-7 minutes.",
    "Once the mixture is cooked, switch off the flame and allow it to cool a bit. Pour the mixture into a blender and puree it. Set aside.",
    "Roast the marinated paneer till golden brown in color from both sides.",
    "Pour the pureed masala in a wok/kadhai and add water to it. Stir and add cream and chopped coriander leaves.",
    "Cover and cook for 4-5 minutes on medium-low flame.",
    "Add the roasted paneer pieces, let it simmer for 2-3 minutes.",
    "Switch off the flame and garnish with chopped coriander leaves and cream.",
    "Serve hot with butter naan or any bread of your choice."
  ],
  "ingredients": [
    "0",
    "Paneer Tikka",
    "250 gms paneer",
    "3 tablespoons yogurt preferably hung curd or thick curd",
    "1 teaspoon finely chopped ginger",
    "1 teaspoon finely chopped garlic",
    "1 teaspoon coriander powder",
    "½ teaspoon garam masala",
    "½ teaspoon paprika powder",
    "¼ teaspoon red chili powder or to taste",
    "salt to taste",
    "Masala/Curry",
    "1 large onion roughly chopped",
    "3-4 medium tomatoes roughly chopped",
    "1/2 teaspoon cumin seeds",
    "1 cinnamon stick",
    "3-4 garlic cloves crushed",
    "1/2 inch ginger cut into small pieces",
    "1.5 teaspoon curry powder",
    "1 tablespoon sugar",
    "2 tablespoons cream",
    "2 tablespoon chopped cilantro leaves and some more to garnish",
    "1 cup water or as required",
    "1 tablespoon oil",
    "1 tablespoon salted butter",
    "salt to taste"
  ],
  "__v": 2
}