{
  "hash": "702b7d014221055c218d9d4b5e0af95fe41c4921",
  "title": "Winter Chicken & Kale Salad",
  "image": "https://iwillnoteatoysters.com/wp-content/uploads/2014/12/chickenkale-6.jpg",
  "href": "https://iwillnoteatoysters.com/winter-chicken-kale-salad/",
  "extension": "Chrome",
  "firstAdded": "2017-08-06T04:41:18.569000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the chicken breast, pre-heat the oven to 375˚F and heat the olive oil in an oven proof pan over medium-high heat. Season the breast generously with salt, pepper, and coriander. When the oil is hot, sear the chicken for 4 minutes on each side until golden brown. Transfer the pan with the chicken into the oven. Roast for 12-15 minutes depending on the thickness of the chicken breast. Set aside to rest for 5 minutes. Slice into 1/3″ slices on the diagonal.",
    "For the brussels, pre-heat the oven to 425˚F. Toss the brussels with the oil, and a generous pinch of salt and fresh pepper. Place on a sheet pan and roast for 16-18 minutes until nicely browned and cooked through.",
    "For the soft boiled eggs, boil a small pot of water. Once the water is at a rolling boil, carefully lower the eggs down into the water. Boil the eggs for exactly 6 minutes. Transfer the eggs immediately to an ice bath (bowl with ice water). Once the eggs are cool enough to handle, peel them gently.",
    "For the shallot vinaigrette, combine all ingredients except for the olive oil in a small bowl. While whisking, slowly drizzle in the olive oil to emulsify the dressing. You can also put all the ingredients in a mason jar and shake them vigorously.",
    "To assemble, toss the chopped kale with a few tablespoons of dressing. Place the dressed kale into 2 bowls. Then arrange the rice, brussels, sliced blue cheese, chicken slices, and egg around the bowls. Cut the egg in half. Dress the salad with a little more of the vinaigrette. Enjoy!"
  ],
  "ingredients": [
    "0",
    "1 boneless skinless chicken breast",
    "1/2 Tb olive oil",
    "ground coriander",
    "salt & fresh pepper",
    "18-20 small brussel sprouts, outer leaves removed & cut in half",
    "1 Tb olive oil",
    "salt & fresh pepper",
    "2 large eggs",
    "1 small shallot, diced finely",
    "2 Tb dijon mustard",
    "1/4 cup white wine vinegar",
    "1/2 cup olive oil",
    "salt & fresh pepper",
    "1 bunch Lacinato kale, washed & chopped finely",
    "2/3 cup cooked wild rice, black venus rice, or dark barley",
    "good quality blue cheese, sliced thinly",
    "za’atar, garnish, optional"
  ],
  "__v": 1
}