{
  "hash": "5e02afaab2fbcf2c794127f3212cc0d8ff93489e",
  "title": "Healthy Slow Cooker Chicken Chile Verde",
  "image": "https://cmt.azureedge.net/media/healthy_slow_cooker_chicken_chile_verde_20180828120906967758by55kz.jpg",
  "href": "https://www.copymethat.com/r/Wo6Gv5R/healthy-slow-cooker-chicken-chile-verde/",
  "extension": "",
  "firstAdded": "2018-12-29T00:10:16.962000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place tomatillos cut side down, poblano peppers, jalapeños and unpeeled garlic cloves on a foil-lined large baking sheet. If necessary you can use two baking sheets. Place in the oven under the broiler setting for 8-10 minutes or until the tomatillos and peppers begin to roast and blacken. If you don't have broiler in your oven, you can put the oven at 425 degrees F (this option may take longer).",
    "Transfer the poblano and jalapeno peppers to a plastic Ziploc bag and zip it tight (leave the tomatillos and garlic on the baking sheet for now). This allows the peppers to steam in the bag and after 5-10 minutes you should be able to remove the skin, stem and seeds off the peppers. It's okay if you don't remove the skin completely -- the most important part is removing the seeds and stems.",
    "While the peppers are steaming in the bag, add tomatillos to a blender. You'll notice that they probably got juicy during the roasting. That's okay; you'll want to add all those juices to the blender too! Peel garlic cloves and add them to the blender along with the peppers, green chiles, cilantro, lime juice, cumin, oregano, salt, pepper and chicken broth. Blend the ingredients until they are well combined.",
    "Add chicken thighs and diced onions to slow cooker, pour tomatillo-chile sauce all over the top of the chicken and stir to combine. Cover and cook on high for 3 hours or low for 7 hours. Before serving, remove chicken with a slotted spoon and shred with a fork. Add back to slow cooker and mix in with a spoon. Taste and adjust seasoning as necessary. Serve with brown rice, corn tortilla, tortilla chips, and/or beans. Serves 6."
  ],
  "ingredients": [
    "0",
    "2 pounds tomatillos, husked (paper skins, removed) and cut in half",
    "4 Poblano or Anaheim peppers",
    "2-3 jalapeños, depending on your spice preference",
    "6 garlic cloves",
    "1 - 4oz can diced green chiles",
    "1 bunch of organic cilantro",
    "juice of 1 lime",
    "2 teaspoons ground cumin",
    "2 teaspoons dried oregano",
    "1/4 teaspoon salt, plus more to taste",
    "Freshly ground black pepper",
    "3/4 cup low-sodium chicken broth",
    "2 pounds Just BARE Boneless Skinless Chicken Thighs",
    "1 large yellow onion, diced"
  ],
  "__v": 1
}