{
  "hash": "a4a828195a1694c3b06293295447837ceb882383",
  "title": "Salted Caramel Glazed Doughnut Holes",
  "image": "http://i0.wp.com/bsugarmama.com/wp-content/uploads/2012/12/IMG_6870.jpg?resize=416%2C625",
  "href": "http://bsugarmama.com/donut-holes-salted-caramel-glaze/",
  "firstAdded": "2015-01-23T23:02:45.885000",
  "users": [
    null
  ],
  "keywords": [
    "doughnuts",
    "flour",
    "sugar",
    "baking",
    "nutmeg",
    "vanilla",
    "salt",
    "egg",
    "milk",
    "butter",
    "oil",
    "frying",
    "glaze",
    "salted",
    "caramel"
  ],
  "directions": [
    "0",
    "While you begin to put together the batter for the doughnut holes, pour the vegetable oil in the deep fryer and begin to heat it according to manufacturer’s instructions. It won’t take you long to prepare the batter.",
    "In a large mixing bowl, combine all the ingredients for the doughnut holes (flour, sugar, baking powder, nutmeg, vanilla extract, salt, egg, milk and melted butter). Blend with a handheld mixer or wooden spoon until all the ingredients until well mixed.",
    "Your oil should be ready now. When the oil is ready place teaspoon sized scoops of the doughnut hole batter into the hot oil and fry for about 2 minutes on both sides or until golden brown on both sides. Remove from oil when finished and place on paper towels to absorb all the excess oil. Repeat this process until all the batter is gone.",
    "Note about the salted caramel: You can buy salted caramel sauce already made, or you can make your own sauce, or you can buy regular caramel sauce and add 2 teaspoons of sea salt to the 3/4 cup of caramel that is required for this glaze. You can add more salt if that isn’t enough balance of salt and sweet for you.",
    "Preparing the glaze: In a small bowl, add the powdered sugar, salted caramel sauce, and milk and stir until smooth. As your doughnut holes cool off, place them in the glaze and then on a cooling rack. I dipped my doughnut holes in the glaze twice. If you have enough feel free to do the same thing. Repeat this process until the holes are completely covered."
  ],
  "ingredients": [
    "0",
    "•\tFOR THE DOUGHNUTS:",
    "•\t1-¼ cup Flour",
    "•\t⅓ cups Sugar",
    "•\t2 teaspoons Baking Powder",
    "•\t½ teaspoons Nutmeg",
    "•\t1 teaspoon Vanilla Extract",
    "•\t½ teaspoons Salt",
    "•\t1 whole Egg",
    "•\t½ cups Milk",
    "•\t2 Tablespoons Melted Butter",
    "•\tVegetable Oil, For Frying",
    "•\tFOR THE GLAZE:",
    "•\t2 cups Powdered Sugar",
    "•\t¾ cups Salted Caramel Sauce",
    "•\t3 Tablespoons Milk"
  ],
  "__v": 1
}