{
  "hash": "59abb2d94b3e8b871c97964d9f4bd8ffda3a94f0",
  "title": "Pan-Seared Scallops with Cauliflower Mash & Spinach",
  "image": "http://2.bp.blogspot.com/-mlMAdPY0biA/Unv8Aw0DvyI/AAAAAAAAZUk/DcU9FD1NN3M/s640/scallop+with+cauliflower+mash.jpg",
  "href": "http://scrumpdillyicious.blogspot.ca/2013/11/pan-seared-scallops-with-cauliflower.html",
  "extension": "Chrome",
  "firstAdded": "2017-01-03T03:25:03.179000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Steam the cauliflower until very soft then purée in a food processor. Transfer the mash into a medium saucepan and add the butter and milk to taste. Season with salt and pepper, then cover and keep warm over low heat until needed.",
    "Place the spinach and 1/4 cup of water in a large pot, and cook over medium-high until the leaves wilt, about 3-4 minutes. Drain the spinach in a colander then put back into the pot with some butter to taste. Cover and keep warm over low heat.",
    "Pat the scallops dry and sprinkle with a pinch of salt and pepper. Heat the butter in a 12-inch nonstick skillet over medium-high heat until the foam subsides, then sear the scallops, turning once, until they are nicely caramelized and cooked to your desired doneness, about 2 minutes per side. Transfer to a platter and keep warm until all of the scallops have been cooked.",
    "To serve, spoon some cauliflower mash into the middle of each plate, top with a nest of spinach then top with the seared scallops. Garnish with a crown of microgreens, some lemon zest and a light drizzle of good quality olive oil."
  ],
  "ingredients": [
    "0",
    "6 sea scallops",
    "1 tbsp olive oil",
    "1 tbsp unsalted butter",
    "Sea salt and freshly ground black pepper",
    "Microgreens and lemon zest, for garnish",
    "Cauliflower Mash:",
    "3 cups cauliflower florets",
    "1 oz butter or Olivina",
    "1 oz whole milk or light cream",
    "pinch of salt and freshly ground black or white pepper",
    "Cooked Spinach:",
    "1 tsp butter",
    "2 bunches fresh spinach, washed and trimmed"
  ],
  "__v": 1
}