{
  "hash": "a6c0ad0de767dc72fc86b3204f60141f2d423c9c",
  "title": "Gratin of carrots & root vegetables",
  "image": "//www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--4902_10.jpg?itok=JyxF0lpc",
  "href": "https://www.bbcgoodfood.com/recipes/3273/gratin-of-carrots-and-root-vegetables",
  "extension": "",
  "firstAdded": "2019-01-16T22:32:46.408000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 180C/gas 4/fan 160C and butter a shallow ovenproof dish. Layer the potatoes, then the parsnip in the bottom of the dish with two of the sliced garlic cloves and sprinkle over a little salt and half the rosemary. It’s best to keep the potatoes buried under the other vegetables because they go black if they are on top of the gratin.",
    "Pour the cream and milk into a large saucepan, add the rest of the rosemary and garlic, the carrots and a little seasoning. Bring to the boil, then turn the heat to the lowest it will go and simmer for 3 minutes.",
    "Pour the carrots and cream over the other vegetables, and spread the carrots out. Sprinkle over the parmesan, cover with foil and bake for 40 minutes. Remove the foil and bake a further 20 minutes until golden and bubbly."
  ],
  "ingredients": [
    "0",
    "500g waxy potatoes Potato po-tate-ohThe world's favourite root vegetable, the potato comes in innumerable varieties. A member of… (we used Desirée), sliced wafer thin",
    "1 small parsnip Parsnip par-snip The fact that the parsnip is a member of the carrot family comes as no surprise - it looks just… , sliced wafer thin",
    "3 plump garlic cloves, thinly sliced",
    "1 tbsp chopped fresh rosemary Rosemary rose-mar-eeRosemary's intense, fragrant aroma has traditionally been paired with lamb, chicken and game…",
    "284ml carton double cream",
    "150ml full-fat milk Milk mill-kOne of the most widely used ingredients, milk is often referred to as a complete food. While cow…",
    "350g carrots Carrot ka-rotThe carrot, with its distinctive bright orange colour, is one of the most versatile root… , sliced wafer thin",
    "50g parmesan Parmesan parm-ee-zanParmesan is a straw-coloured hard cheese with a natural yellow rind and rich, fruity flavour. It… , grated"
  ],
  "__v": 1
}