{
  "hash": "698fb1e60e53415ce782a3ddae584e69d44839cc",
  "title": "Hearty Italian Chicken and Autumn Veggie Soup",
  "image": "http://thecozyapron.com/wp-content/uploads/2014/10/italian-chicken-soup_09-28-14_1_ca.jpg",
  "href": "http://thecozyapron.com/hearty-italian-chicken-and-autumn-veggie-soup-and-gratitude-for-the-simple-pleasures/",
  "extension": "Chrome",
  "firstAdded": "2016-06-22T19:24:51.537000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparation:",
    "-Preheat oven to 400°, and line a baking sheet with foil.",
    "-Place the split chicken breasts on the baking sheet, and drizzle them with a little oil, and a couple of good pinches of salt and pepper.",
    "-Cut the tops off of the heads of garlic, drizzle each head with a little oil, plus a pinch of salt and pepper, and wrap each head in a small piece of foil; place on the baking sheet next to the chicken.",
    "-Roast the chicken, along with the garlic, for 45 minutes; then allow both to cool until they can be handled.",
    "-Once they are cooled, shred the chicken, and set it aside; then, squeeze the roasted garlic from the papers, and using your knife or a fork, make the cloves into a paste; set the paste aside for a moment.",
    "-Place a medium-large pot over medium to medium-high heat, and drizzle in about 2-3 tablespoons of the oil, plus add in the tablespoon of butter; once melted together, add in the onion and allow it sweat for about 3-4 minutes, until translucent and softened.",
    "-To the onion add the roasted garlic “paste”, and stir it in to combine.",
    "-Next, add in the diced carrots, parsnips, celery and butternut squash and stir to combine; add in the Italian seasoning, plus a pinch or two of salt and black pepper, and the red pepper flakes, and stir to incorporate.",
    "-Add in the tomato paste and stir, and allow it to cook with the vegetables for about 2-3 minutes, or until the “raw” flavor of it is cooked out of it.",
    "-Next, add in the chicken stock and stir, followed by the piece of parmesan rind, if using; cover with a lid and simmer very gently on low for about 20-22 minutes, stirring occasionally (especially if you add the parmesan rind so that it doesn’t stick to the bottom), or until the veggies are tender.",
    "-Turn off the heat, and remove the parmesan rind, if using; add in the kale and stir to incorporate it, and allow it wilt into the soup for a few minutes; then, finish the soup by adding in the shredded chicken, the basil and the parsley (also, check your seasoning at this point to see if any additional salt/pepper is needed).",
    "-To serve, add about ¼ cup or so of cooked gnocchi to your bowl, and ladle some of the stew over top; garnish with some grated parmesan, if desired, and serve with warm bread."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "• 2 skin-on and bone-in split chicken breasts",
    "• Canola oil",
    "• Salt",
    "• Black pepper",
    "• 3 heads garlic",
    "• 1 tablespoon unsalted butter",
    "• 1 onion, finely diced",
    "• 2 carrots, peeled and finely diced",
    "• 2 parsnips, peeled and finely diced",
    "• 2 ribs celery, finely diced",
    "• 2 cups butternut squash, peeled and diced into small, bite-size cubes",
    "• 2 teaspoons Italian seasoning",
    "• Pinch red pepper flakes",
    "• 1 (6 ounce) can tomato paste",
    "• 4 – 4 ½ cups hot chicken stock",
    "• Small piece of parmesan rind, optional (*see note below)",
    "• 2 cups Tuscan kale, chopped into small pieces",
    "• ¼ cup fresh basil leaves, julienned",
    "• 1 tablespoon chopped flat-leaf parsley",
    "• Gnocchi, cooked according to package instructions, and held warm with a bit of oil drizzled in",
    "• Grated fresh parmesan, for garnish",
    "• Warm rustic bread, on the side"
  ],
  "__v": 1
}