{
  "hash": "b9ecee5a32aac726bc87d9afbeb830ae760fa5c7",
  "title": "Spicy Tofu and Brussels Sprout Stir-Fry With Korean-Style Sauce [Vegan, Gluten-Free]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/02/stirfry.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/spicy-tofu-and-brussels-sprouts/",
  "extension": "Chrome",
  "firstAdded": "2015-05-12T06:56:20.875000",
  "users": [
    null
  ],
  "keywords": [
    "extrafirm",
    "tofu",
    "strips",
    "browned",
    "heres",
    "recipe",
    "bacon",
    "oil",
    "brussels",
    "sprouts",
    "trimmed",
    "slices",
    "marinade",
    "water",
    "soy",
    "low",
    "salt",
    "nutritional",
    "yeast",
    "brown",
    "sugar",
    "ketchup",
    "smoke",
    "dark",
    "sesame",
    "gochujang",
    "spicy",
    "korean",
    "bean",
    "pastekorean",
    "red",
    "pepper",
    "clove",
    "garlic",
    "sprinkles",
    "kosher",
    "flake",
    "freshlyground",
    "black",
    "seeds"
  ],
  "directions": [
    "0",
    "Pat the tofu with a clean cloth and shave it into long, thin slices with a cheese slicer",
    "Mix together the Marinade ingredients in a shallow container. Carefully add the tofu slices to the Marinade, making sure that they are covered by the Marinade. Cover the container and refrigerate it. Let the tofu marinate for at least 8 hours, or for a few days.",
    "When you are ready to cook the “Bacon”, heat a large, sturdy nonstick skillet over high heat. Add about 1/2 tablespoon of dark sesame oil to the skillet and swirl it around the pan to cover the bottom. When the pan is hot, add some of the slices.",
    "Fry the slices on both sides until golden-brown and a little crispy. Turn the slices several times as the cook. If you cool the slices in the pan, they crisp up more that way, but I just cool them on a plate and cook the next batch. (Add a bit more dark sesame oil for each batch.)",
    "1",
    "Pat the tofu to get rid of excess water and cut it into 1/2″ cubes. Heat the oil in a stir-fry pan or heavy 10 to 12″ skillet over high heat. Season with a bit of salt. Stir-fry until it is browned on at least two sides. Scoop out and set aside.",
    "Mix the Cooking Sauce ingredients together and set aside. Over high heat, add the sprout slices and garlic and stir-fry, add in squirts of water from a squeeze bottle as needed to keep the sprouts from sticking or drying out. Add about 2 tablespoon water and cover and cook for about 2 minutes, or until the sprouts are crisp-tender.",
    "Add the Cooking Sauce, browned tofu cubes and vegan “bacon” strips and stir-fry for about 4 minutes. If it looks too dry while you are cooking it, add a few squirts of water. Be careful not to overcook the sprouts. Season with a bit of salt and some freshly-ground black pepper and serve immediately over steamed brown rice.",
    "Sprinkle each serving with ground or crushed roasted sesame seeds, if you like."
  ],
  "ingredients": [
    "0",
    "14 oz. extra-firm tofu",
    "1 1/3 cups thin strips of browned tofu “bacon” (here’s the recipe for my homemade “Tofu Bacon”)",
    "1/2 to 1 tablespoon oil",
    "1 lb. Brussels sprouts, trimmed and sliced into 3 or 4 slices each (about 1/4″ thick)",
    "1",
    "12-16 ounces extra-firm tofu",
    "Marinade:",
    "1/2 cup water",
    "1/2 cup soy sauce (low salt)",
    "2 tablespoons nutritional yeast flakes",
    "2 tablespoons brown sugar",
    "2 tablespoons ketchup",
    "1 tablespoon liquid smoke",
    "Dark sesame oil",
    "2",
    "1/4 cup water",
    "1 1/2 tablespoons gochujang (spicy Korean bean paste/Korean red pepper paste)",
    "3/4 tablespoon soy sauce",
    "1 large clove garlic, crushed",
    "2 teaspoons dark sesame oil",
    "a few sprinkles kosher or flake salt",
    "freshly-ground black pepper",
    "3",
    "crushed or ground toasted sesame seeds"
  ],
  "__v": 1
}