{
  "hash": "9b9cc20ca96ef453f61d70674b583a4b9fcdb986",
  "title": "The Ultimate Cuban Sandwich",
  "image": "http://food.fnr.sndimg.com/content/dam/images/food/fullset/2009/2/4/0/TU0607-1_Cuban-Sandwich_s4x3.jpg.rend.hgtvcom.616.462.jpeg",
  "href": "http://www.foodnetwork.com/recipes/tyler-florence/the-ultimate-cuban-sandwich-recipe",
  "extension": "Chrome",
  "firstAdded": "2017-04-09T19:13:26.519000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Begin by braising the pork shoulder. Tie the shoulder in 4 places with kitchen twine so it will hold its shape while being cooked or ask your butcher to do this for you. Season the pork with salt, pepper, cumin and oregano. Set the base of a pressure cooker over low-medium heat and add a 2 count of olive oil.",
    "Add garlic and chili flakes and as the oil heats up it will become fragrant and infuse the oil. Add the pork. Add onions around the pork and brown slightly before adding orange juice, lime juice, stock and bay leaves.",
    "Secure the lid of the pressure cooker and cook for 20 to 25 minutes depending on the size of your pressure cooker. The pork should be tender when done. When done allow to cool in juices before removing twine and slicing.",
    "To prepare Cuban sandwiches, split bread in half then layer the sandwich with mustard, cheese, pickles, ham, pork then cheese again (the cheese glues everything together). Season with salt and pepper in between the ham and pork layers. (Optional: drizzle a little of the pork braising liquid over the meat as well).",
    "To cook, heat a large cast iron skillet or grill pan over medium heat and lightly coat with olive oil. Place the sandwiches on the skillet and top with another heavy skillet and a couple of heavy weights (bricks, or cans of tomatoes work well). Press down firmly and cook for 5 to 7 minutes per side until the sandwich has compressed to about a third of its original size and the bread is super-crispy. Serve with beans, rice and plantain chips."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 pound boneless pork shoulder",
    "Kosher salt and freshly ground black pepper",
    "1 tablespoon ground cumin",
    "1 tablespoon dried oregano",
    "2 tablespoons extra-virgin olive oil",
    "4 cloves garlic, peeled and gently smashed with the side of your knife",
    "1/4 teaspoon dried red chili flakes",
    "1 medium onion, sliced",
    "1 cup fresh orange juice",
    "1 lime, juiced",
    "1 cup low-sodium chicken broth",
    "2 bay leaves",
    "1 long Cuban bread roll",
    "3 tablespoons Dijon mustard",
    "8 thin slices Swiss cheese",
    "1 cup bread and butter pickles",
    "8 thin slices deli ham",
    "Olive oil"
  ],
  "__v": 1
}