{
  "hash": "d635c0642789b3cb87bb328e6154b8e358ce6e7b",
  "title": "Gluten-Free German Chocolate Cake {Dairy-Free Option}",
  "image": "http://blog.meaningfuleats.com/wp-content/uploads/2014/10/IMG_54341.jpg",
  "href": "http://meaningfuleats.com/gluten-free-german-chocolate-cake-dairy-free-option/",
  "extension": "Chrome",
  "firstAdded": "2017-01-04T05:04:34.087000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "While you bake the cakes, make the coconut pecan filling. Spread the coconut on a rimmed baking sheet. Bake at 350°F, stirring every 2 minutes, until golden-brown, about 10 minutes. Let cool completely.",
    "In a medium saucepan, whisk together the egg yolks, coconut milk, sugar, salt, and butter. Over medium heat, bring the mixture to a gentle boil, stirringly constantly. Adjust the heat so it only boils gently if needed. Stir constantly, until golden and thickened, 3 to 4 minutes. It should coat the back of a wooden spoon when it's done.",
    "Remove from the heat and stir in the vanilla, pecans, and coconut. Let cool completely, at least 1 hour. The filling needs to be completely cool before topping the cake. I place it in the refrigerator and stir occasionally to make it cool faster.",
    "To make the buttercream, place the butter, powdered sugar, cocoa powder, vanilla, almond extract, and 2 tablespoons almond milk in a bowl. Starting with an electric mixer (or stand mixer) on low, beat the frosting until combined. Increase the speed and whip until the frosting is light and fluffy,about 3-4 minutes. Add the additional tablespoons almond milk if needed to thin.",
    "To assemble the cake, place a small amount of frosting on the bottom of a cake stand. Place 1 of the cake on the stand and top it with half of the cooled coconut pecan filling. Top with the other cake and cover the top with the remaining coconut pecan filling. Frost the sides of the cake with the chocolate buttercream. If desired, refrigerate the cake for 30 minutes to set the frosting. Bring to room temperature before serving. Slice and enjoy!"
  ],
  "ingredients": [
    "0",
    "2 9-inch round baked gluten-free chocolate cakes (see note above)",
    "3 cups sweetened, shredded coconut",
    "4 large egg yolks",
    "1 1/2 cups canned coconut milk (or canned evaporated milk)",
    "1 1/2 cups granulated sugar",
    "3/4 teaspoon salt",
    "3/4 cup butter, cut into chunks",
    "2 teaspoons vanilla extract",
    "1 1/2 cups pecan halves, toasted and coarsely chopped",
    "6 tablespoons butter (or Earth Balance Buttery Sticks), softened",
    "3 cups powdered sugar",
    "6-8 tablespoons cocoa powder",
    "1 teaspoon vanilla",
    "½ teaspoon almond extract",
    "3-4 tablespoons almond milk (or milk of choice)"
  ],
  "__v": 1
}