{
  "hash": "c05c224fad4593f6679b6bb4223b70907073a828",
  "title": "Moist & Tender Chicken Breasts",
  "image": "http://recipe-folder.com/img/recipe-images/076/648/1510464776.gif",
  "href": "https://www.thekitchn.com/how-to-cook-moist-tender-chicken-breasts-every-time-cooking-lessons-from-the-kitchn-36891",
  "extension": "Chrome",
  "firstAdded": "2019-11-20T20:26:05.144000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Flatten the chicken breasts. Pound the chicken breasts to an even thickness with the bottom of a wide jar or glass. You can also use the bottom of a small frying pan.",
    "Season the chicken breasts. Lightly season the chicken with salt and pepper.",
    "Heat the pan. Heat a frying pan large enough to fit the chicken in a single layer over medium-high heat. When it is quite hot, add the olive oil (or butter, if using). Swirl the pan so it is lightly covered with the olive oil.",
    "Cook the chicken breasts over medium heat for 1 minute without moving. Reduce the heat to medium. Add the chicken breasts. Cook undisturbed for just about 1 minute to help them get a little golden on one side (you are not actually searing or browning them).",
    "Flip the chicken breasts. Flip each chicken breast over.",
    "Turn the heat down to low. Reduce the heat to low.",
    "Cover the pan and cook on low for 10 minutes. Cover the pan with a tight-fitting lid. Set a timer for 10 minutes, and walk away. Do not lift the lid; do not peek.",
    "Turn off the heat and let sit for an additional 10 minutes. After 10 minutes have elapsed, turn off the heat. (If you have an electric stove, remove the pan from the heat.) Reset the timer for 10 minutes and leave the chicken breasts in the pan. Again, do not lift the lid; do not peek.",
    "Remove lid and take temperature. After the 10 minutes are up, uncover and your chicken is done. Make sure there is no pink in the middle of the chicken breasts. If you want to be absolutely sure it is cooked, you can use an instant-read thermometer to check -- the chicken should be at least 165°F. Slice and eat."
  ],
  "ingredients": [
    "0",
    "1 to 4 boneless, skinless chicken breasts, of similar size",
    "Salt",
    "Freshly ground black pepper",
    "1 tablespoon olive oil, unsalted butter, or combination of both"
  ],
  "__v": 1
}