{
  "hash": "0c62a9810043ed7e2e4d407807785acba82460bc",
  "title": "Skillet Banana Pancake",
  "image": "",
  "href": "https://www.realsimple.com/food-recipes/browse-all-recipes/banana-pancake-recipe",
  "extension": "Chrome",
  "firstAdded": "2020-05-25T19:02:27.862000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Step 1",
    "Preheat broiler with rack 6 inches from heat. Slice 2 bananas in half lengthwise and place, cut sides up, on a rimmed baking sheet. Brush with 1 tablespoon oil and sprinkle with 1 tablespoon sugar. Broil until golden brown, 3 to 4 minutes. Set aside. Set oven temperature to 400°F.",
    "Step 2",
    "Mash remaining banana in a large bowl. Add eggs, buttermilk, vanilla, and 2 tablespoons oil; whisk until combined. Whisk flour, baking powder, salt, baking soda, nutmeg, and remaining ¼ cup sugar in a separate large bowl. Add mashed banana mixture to flour mixture and stir until just combined (do not overmix).",
    "Step 3",
    "Heat remaining 2 tablespoons oil in a 12-inch cast-iron skillet or oven-safe nonstick skillet over medium-high. Scrape batter into skillet, gently spreading to edges with a rubber spatula. Reduce heat to medium; cook, shaking skillet back and forth to distribute batter, until pancake bubbles around edges, 5 to 6 minutes. Arrange broiled bananas on top, cut sides up. Bake until pancake is puffed and set, 10 to 15 minutes, rotating halfway through.",
    "Step 4",
    "Spread coconut chips on a baking sheet and bake until just golden, about 3 minutes. Sprinkle pancake evenly with coconut and drizzle with maple syrup. Serve with whipped cream.",
    "Sponsored Stories"
  ],
  "ingredients": [
    "0",
    "3 medium bananas",
    "5 tablespoons melted coconut oil, divided",
    "¼ cup plus 1 tablespoon granulated sugar, divided",
    "2 large eggs",
    "1½ cups buttermilk",
    "1 teaspoon pure vanilla extract",
    "2 cups all-purpose flour",
    "1 tablespoon baking powder",
    "1 teaspoon kosher salt",
    "¾ teaspoon baking soda",
    "¼ teaspoon ground nutmeg",
    "1 cup coconut chips",
    "Pure maple syrup, for serving",
    "Whipped heavy cream, for serving"
  ],
  "__v": 1
}