{
  "hash": "deb574b8e2a960540133b42d045a7bcc8fec7be3",
  "title": "5-INGREDIENT ITALIAN SAUSAGE AND KALE BAKED ZITI",
  "image": "http://www.gimmesomeoven.com/wp-content/uploads/2014/12/5-Ingredient-Italian-Sausage-and-Kale-Baked-Ziti-51.jpg",
  "href": "http://www.gimmesomeoven.com/5-ingredient-italian-sausage-kale-baked-ziti-recipe/",
  "extension": "Chrome",
  "firstAdded": "2015-10-10T21:39:06.816000",
  "users": [
    null
  ],
  "keywords": [
    "ziti",
    "pasta",
    "shape",
    "strongly",
    "recommend",
    "using",
    "spicy",
    "italian",
    "sausage",
    "garlic",
    "roughlychopped",
    "kale",
    "leaves",
    "stems",
    "mozzarella",
    "cheese",
    "used",
    "low",
    "fat",
    "toppings",
    "parmesan",
    "red",
    "pepper"
  ],
  "directions": [
    "0",
    "DIRECTIONS:",
    "Preheat oven to 375 degrees F. Heat a large stockpot full of well-salted water for the pasta.",
    "In a (separate) large skillet, saute the Italian sausage over medium-high heat until browned (about 8-10 minutes), breaking the sausage up with a spoon into bite-sized pieces while cooking. When the sausage has browned, add in the minced garlic and saute for 1-2 additional minutes or until the garlic is fragrant. Remove pan from heat and set aside.",
    "While the sausage is browning, cook the pasta al dente in the stockpot of boiling water according to package instructions. Drain.",
    "Return pasta to the stockpot and add the sausage, garlic and kale. Gently toss to combine until the kale is dark green and slightly wilted.",
    "Pour half of the pasta into a greased 11x7-inch or 9x13-inch baking dish. Sprinkle evenly with 1 cup of cheese. Layer the remaining half of the pasta evenly on top. Sprinkle evenly with the remaining 1 cup of cheese.",
    "Bake for 20-25 minutes until the cheese is melted and just barely starts to turn golden. Remove and serve immediately, sprinkled with additional toppings if desired."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS:",
    "12 ounces ziti (or any pasta shape)",
    "1 lb. ground Italian sausage (I strongly recommend using \"spicy\" Italian sausage)",
    "4 cloves garlic, minced",
    "3 large handfuls roughly-chopped kale leaves, stems removed",
    "2 cups shredded mozzarella cheese (I used 2% low fat)",
    "optional additional toppings: shredded Parmesan cheese, crushed red pepper flakes"
  ],
  "__v": 1
}