{
  "hash": "e3098cf6ed12d7b569582c7a02ca759069b552ba",
  "title": "SPICY BACON, LETTUCE AND ROASTED TOMATO ZUCCHINI PASTA",
  "image": "http://ditchthewheat.com/wp-content/uploads/2013/11/IMG_2835-copy-682x1024.jpg",
  "href": "http://ditchthewheat.com/spicy-bacon-lettuce-and-roasted-tomato-zucchini-pasta/",
  "extension": "Chrome",
  "firstAdded": "2015-09-04T15:42:00.555000",
  "users": [
    null
  ],
  "keywords": [
    "cherry",
    "tomatoes",
    "olive",
    "oil",
    "drizzle",
    "salt",
    "pepper",
    "strips",
    "bacon",
    "garlic",
    "red",
    "kale",
    "stems",
    "zucchini",
    "click",
    "tutorial",
    "spiralize",
    "blade"
  ],
  "directions": [
    "0",
    "Preheat the oven to 400 degrees. Place the tomatoes in a baking tray and drizzle lightly with olive oil. Toss to combine thoroughly and season generously with salt and pepper. Bake in the oven for 20 minutes. Set aside once done (they’ll be used in the pasta).",
    "Ten minutes into baking the tomatoes, place a large skillet over medium heat and add in the bacon slices. Cook the bacon for 3 minutes and then flip over and cook for another 3-5 minutes or until bacon is to your preferred crispiness. Using a slotted spoon, set aside the bacon on a paper-towel lined plate when done.",
    "Pour out half of the bacon fat in the skillet and keep the rest in the skillet. Add in the garlic, cook for 1 minute and then add in the red pepper flakes and kale. Cook the kale until most wilted.",
    "Add in the zucchini pasta, roasted tomatoes, and bacon. Stir frequently for about 2-3 minutes or until noodles are coated with tomato juices and have softened.",
    "Pour the noodles into a bowl and enjoy!"
  ],
  "ingredients": [
    "0",
    "1 cup cherry tomatoes",
    "olive oil to drizzle",
    "salt and pepper to taste",
    "1-2 strips of bacon",
    "1 tsp minced garlic",
    "1 pinch red pepper flakes",
    "1 cup chopped kale, large stems removed",
    "1 large zucchini, Blade C (click here for a tutorial on how to spiralize and what Blade C is)"
  ],
  "__v": 1
}