{
  "hash": "f3fe11f048d2bcc27e1041d11bfc50a49169117d",
  "title": "Mashed Potatoes with apples fried in bacon fat!\nRotisserie Chicken Shepherd;s Pie (double the recipe if you want an extra dish to freeze or share) Inspired by eRecipeCards",
  "image": "http://1.bp.blogspot.com/-BbcSNLyb208/UQVSvNB08iI/AAAAAAAATos/MeHyh1Uld48/s640/0.6.jpg",
  "href": "http://erecipecards.blogspot.com/2012/10/rotisserie-chicken-shepherds-pie.html",
  "firstAdded": "2015-01-18T21:45:24.720000",
  "users": [
    null
  ],
  "keywords": [
    "red",
    "potatoes",
    "cubed",
    "leave",
    "skin",
    "texture",
    "color",
    "cheddar",
    "cheese",
    "onions",
    "granny",
    "smith",
    "apples",
    "cored",
    "pealed",
    "dice",
    "bacon",
    "fried",
    "size",
    "tbs",
    "salt",
    "pepper",
    "mashed",
    "butter",
    "flour",
    "medium",
    "onion",
    "chicken",
    "stock",
    "carrots",
    "frozen",
    "corn",
    "rinsed",
    "hot",
    "water",
    "thaw",
    "peas"
  ],
  "directions": [
    "0",
    "First, in salted water, boil the potatoes for about 20-25 minutes until cooked and mashable.",
    "Meanwhile, Cut the bacon into quarter sized pieces and fry normally.",
    "Remove the bacon, reserving the fat. Add the apples and onions and saute until soft. Most of the bacon fat will absorb into the apples!",
    "Drain the potato water, in a large bowl or pot, add the potatoes, Bacon, Onion, Apples, Half and Half and Cheese.",
    "Start mashing. I like a chunky mashed potato. Use an electric mixer to get smooth potatoes.",
    "Salt and Pepper to taste... DELICIOUS!",
    "Pre-heat oven to 350 degrees.",
    "First, make a roux, in a heated heavy bottom frying pan, melt the butter. Heat to just before it starts to brown Add the flour to the heated butter and stir constantly for 2 minutes.",
    "Add the onions and continue stirring for another couple of minutes until the onions are soft.",
    "Add the Chicken Stock and bring to a simmer... still stirring",
    "Add the carrots and simmer for 5 minutes to soften",
    "Add the chicken,",
    "Add the remaining vegetables, alt and pepper.",
    "Pour all of this into a casserole dish, top with the mashed potatoes",
    "Bake for 30 minutes, until the potatoes get a crusty top.",
    "Cover with foil and freeze if you want to save for a rainy day or Enjoy popping hot and fresh!",
    "When serving for presentation, I put the potatoes on the bottom of the plate and top with the soupy chicken/vegetable mix... Heartwarming!"
  ],
  "ingredients": [
    "0",
    "5 pounds Red Potatoes, cubed (leave the skin on for texture and color)",
    "1 Cup Half and Half",
    "1 Cup grated Cheddar Cheese",
    "1/2 Cup Onions, Diced",
    "1 Cup Granny Smith Apples, cored, pealed and cut into a large dice",
    "1/2 Pound Thick Cut Bacon, fried and chopped about the size of a quarter",
    "2 TBS Salt",
    "2 TBS Pepper",
    "4 Cups Mashed Potatoes",
    "2 TBS Butter",
    "2 TBS Flour",
    "1 Medium Onion, diced",
    "1 Cup Chicken Stock",
    "1 Cup Diced Carrots",
    "1 Cup Frozen Corn, rinsed in hot water to thaw",
    "1 Cup Frozen Peas, rinsed to thaw",
    "1 TBS Salt",
    "1 TBS Pepper"
  ],
  "__v": 1
}