{
  "hash": "70205a97288e593fc558de7ae9a9fabf23baa822",
  "title": "Alton Brown's Turkey",
  "image": "http://recipe-folder.com/img/recipe-images/070/419/1703780070.jpg",
  "href": "https://www.bonappetit.com/recipe/alton-brown-s-classic-brined-and-roasted-turkey",
  "extension": "Chrome",
  "firstAdded": "2018-09-23T23:30:29.791000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Brining the Turkey",
    "Clean cooler with soap and water, then pour in hot tap water, sugar, and salt. Stir thoroughly to dissolve sugar and salt. Then stir in ice and vegetable broth.",
    "Unwrap thawed turkey and remove any parts (such as neck, organs, etc.) that may be inside cavity. These may be saved for gravy.",
    "Place turkey in brine, breast side up. If your turkey floats, fill a 1-gallon resealable plastic bag with water and place it on top of turkey. Set cooler, lid closed, in a cool place, turning turkey over once if possible, 8–12 hours. Check brining liquid periodically with probe thermometer; if temperature is above 40°, add a few freezer packs that have been enclosed in resealable plastic bags.",
    "Remove turkey from brine, rinse under cold water, and pat dry with paper towels. Do not stuff turkey.",
    "Roasting the Turkey",
    "Remove all oven racks except for one. Set this rack in the next-to-the-lowest position. Preheat the oven to 500°.",
    "Loosely pack turkey with a combination of herbs, carrots, celery, and onion. Keep packing loose.",
    "Place turkey, breast side up, on a V-shaped rack set inside a large roasting pan. Cut a piece of foil big enough to cover the turkey's breast. Mold piece to breast. Remove foil, then grease with spray.",
    "Rub butter between your hands until liberally greased (you may use disposable gloves if desired). Rub butter into turkey. You may need to re-butter your hands a couple times in order to get a nice, even coating.",
    "Place turkey in oven, neck end first and breast up. Roast turkey until nicely browned, 30–40 minutes. Apply foil to breast of turkey. Insert thermometer probe directly through foil into deepest part of breast.",
    "Reduce oven temperature to 350° and return turkey to oven, foil securely in place. Do not open oven to baste turkey. Roast until probe registers 161° for breast and 181° for thigh, 2–2½ hours.",
    "Cover turkey with foil and let rest 30 minutes. Save pan drippings for gravy."
  ],
  "ingredients": [
    "0",
    "TURKEY",
    "1 18-pound frozen turkey",
    "Fresh herbs (such as thyme, rosemary, and sage)",
    "2 large carrots, coarsely chopped",
    "2 celery stalks, coarsely chopped",
    "1 onion, coarsely chopped",
    "Nonstick vegetable oil spray",
    "2 tablespoons (¼ stick) unsalted butter",
    "BRINE",
    "½ gallon hot tap water",
    "⅔ cup sugar",
    "1 pound kosher salt",
    "8 pounds ice (which is a gallon of water)",
    "16 cups (128 ounces) vegetable broth",
    "Gravy",
    "1 cup water",
    "1 cup low-sodium chicken broth",
    "Cornstarch"
  ],
  "__v": 2,
  "hidden": true
}