{
  "hash": "d71e085e09aed2b816945dff15ae21fa81bee25f",
  "title": "Lemon Chicken (Chinese Style)",
  "image": "http://picturetherecipe.com/wp-content/uploads/2013/03/PTR-Lemon-Chicken-Chinese-Style-.jpg",
  "href": "http://picturetherecipe.com/index.php/recipes/lemon-chicken-chinese-style/",
  "extension": "Chrome",
  "firstAdded": "2016-01-28T13:01:07.379000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "breasts",
    "egg",
    "soy",
    "sherry",
    "shaoxing",
    "wine",
    "sesame",
    "oil",
    "lemons",
    "zest",
    "juice",
    "corn",
    "starch",
    "dissolved",
    "water",
    "stock",
    "sugar",
    "salt",
    "frying"
  ],
  "directions": [
    "0",
    "– Crack one egg into a medium mixing bowl and add the soy sauce, sherry/shaoxing wine, sesame oil and the zest of one lemon to it. Mix it all well together. This is the marinade for the chicken.",
    "– Slice the chicken breast into strips and add it to the marinade and let it sit covered in the fridge for 20-30 minutes atleast or a couple hours.",
    "– Then, in a shallow bowl add the corn starch and season it generously with salt.",
    "– Dip each strip of the marinated chicken in the corn starch to coat it on all sides and lay them on a baking sheet lined with wax paper, ready to fry.",
    "– While you’re coating the chicken, get a pan on stove and heat up about 1/2 an inch of oil on medium-high.",
    "– When the oil is hot, fry the coated chicken strips in small batches for about 4-6 minutes, until it turns a light golden and the chicken is cooked through inside.",
    "– Remove the chicken with a slotted spoon and drain on paper towels. Break a big piece to check if the inside is cooked.Go ahead, give it a taste.",
    "– For the sauce, zest the other lemon into a sauce pan. Add to it, half a cup of lemon juice (roughly the juice of 2 lemons), 1/2 a cup of chicken stock and a 1/3 of a cup of sugar.",
    "– Put the pan on medium-high heat and bring the sauce to a boil while stirring to dissolve the sugar.",
    "– When the sauce starts bubbling, add the corn starch slurry (1/2 tbsp corn starch + 1 tbsp water) while stirring continuously.",
    "– The sauce will thicken fast and turn glossy. Turn off the heat and season it with salt.",
    "– Give it a taste-test by dipping a piece of the fried chicken in it. Good huh?",
    "– When you’re ready to eat…simply add the chicken to a frying pan and slowly spoon in some of the sauce. Toss the chicken to coat it in the sauce. Add as much sauce or all of it if you like.",
    "– Garnish the Lemon chicken with toasted sesame seeds and some sliced green onion. You can serve this dish up as an appetizer and keep it dry or sauce it up and serve over plain steamed rice."
  ],
  "ingredients": [
    "0",
    "2 large chicken breasts",
    "1 egg",
    "2 tbsp Soy Sauce",
    "2 tbsp Sherry (or Shaoxing Wine)",
    "1 tsp sesame oil",
    "2 lemons (zest + Juice)",
    "3/4 cup corn starch + 1/2 tbsp dissolved in a little water",
    "1/2 cup chicken stock",
    "1/3 cup sugar",
    "Salt as per taste",
    "vegetable oil for frying"
  ],
  "__v": 1
}