{
  "hash": "53268dda6eba54db92c3da311c9ac63b3ba10760",
  "title": "EXTRA THICK CHOCOLATE CHIP COOKIES",
  "image": "https://3.bp.blogspot.com/-Hh1CVkzscH8/UqZ2-Ny6HVI/AAAAAAAAb8o/dr5ac1AWm30/s640/DSC_0044-001.JPG",
  "href": "https://hugsandcookiesxoxo.com/2013/12/extra-thick-chocolate-chip-cookies.html",
  "extension": "Chrome",
  "firstAdded": "2019-11-29T19:21:50.235000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 425 degrees. Line cookie sheets with parchment.",
    "Beat butter and both sugars until well blended.",
    "Add in vanilla, egg and yolk until light and creamy.",
    "Add in flour, salt and baking soda just until incorporated.",
    "Stir in chocolate chips by hand.",
    "Chill 2 or more hours.",
    "Drop by 2 ounce mounds onto parchment. (If you like extra chocolate, place a few more chips in the top but beware that's a lot of chocolate!) Place in oven and IMMEDIATELY lower temp to 375. Bake 9 minutes or until tops golden. Let cool on cookie sheets.",
    "MAKES 21 COOKIES (2 OUNCES EACH)"
  ],
  "ingredients": [
    "0",
    "1. Preheat your oven to 425 degrees. (I use the convection setting but regular will work fine). Chill your cookie dough at least 4 hours!",
    "2. Measure your cookie dough to 2 ounces for each mound.",
    "3. As soon as you throw the cookies in the oven, immediately shut the door and lower the temp to 375 RIGHT AWAY. My theory is that the high heat of 425 immediately \"sets\" the base of the cookie to be thicker!!! Bake for 9 minutes or until the tops are getting nice and golden. Will continue to set up while cooling on cookie sheets. This recipe produces a crisp outside and a thick, soft, chewy center!!!",
    "2¼ cups flour",
    "½ tsp. kosher salt",
    "½ tsp. baking soda",
    "1½ sticks soft butter",
    "1 cup light brown sugar",
    "½ cup regular sugar",
    "1 T. vanilla extract",
    "1 egg",
    "1 egg yolk",
    "1 cup NESTLE semisweet chips plus ½ cup bittersweet Ghiradhelli chips and ½c Ghirardelli Milk chocolate chips."
  ],
  "__v": 1
}