{
  "hash": "de3ae6ff0bf1acf229a7137f651b6c6cb641d56b",
  "title": "Pasta alla Norma",
  "image": "http://www.giallozafferano.it/images/ricette/2/223/foto_hd/hd450x300.jpg",
  "href": "http://ricette.giallozafferano.it/Spaghetti-alla-Norma.html",
  "extension": "Chrome",
  "firstAdded": "2015-08-21T20:04:50.681000",
  "users": [
    null
  ],
  "keywords": [
    "spaghetti",
    "ricotta",
    "salata",
    "melanzane",
    "aglio",
    "basilico",
    "fresco",
    "sale",
    "grosso",
    "pomodori",
    "pelati",
    "olio",
    "oliva",
    "extravergine"
  ],
  "directions": [
    "0",
    "Per preparare la pasta alla Norma cominciate dal condimento. Prendete le melanzane, lavatele, spuntatele e tagliatele a fettine di 0,5 cm di spessore con un coltello o una mandolina (, che andrete a porre a strati in un colino appoggiato su di una ciotola; cospargete con sale ogni strato di melanzane che mettete nel colino (2). Coprite con un piatto o con un peso sistemato sopra per eliminare l'acqua in eccesso e per togliere il retrogusto amarognolo (3): lasciatele da parte per almeno 1-2 ore.",
    "Prendete una padella antiaderente dai bordi alti, versate l’olio e fate rosolare due spicchi di aglio fino a farli dorare (4). Unite i pomodori pelati (se preferite potete anche schiacciarli prima con una forchetta) (5) ed aggiustate di sale (6) e pepe. Lasciate cuocere così per 15-20 minuti finché non raggiungono il bollore.",
    "Passate i pelati al setaccio (7) per eliminare tutti i semini e fate nuovamente cuocere per ulteriori 10 minuti (8). A cottura ultimata, spegnete il fuoco ed aggiungete qualche fogliolina di basilico per insaporire (9). Tenete il sugo da parte.",
    "A questo punto, riprendete le melanzane, sciacquatele sotto abbondante acqua per togliere il sale (10) e successivamente tamponatele con un panno pulito ben asciutto (11). Prendete un tegame dai bordi alti, riempite con l’olio di semi e portate alla temperatura di 170° (potete misurare con un termometro da cucina): versate poche fettine di melanzana alla volta in modo che la temperatura dell'olio rimanga tra i 170-180° (12).",
    "Quando saranno dorate, scolatele con una schiumarola (13) e lasciate asciugare l’olio in eccesso adagiandole su un vassoio coperto con carta assorbente (14). Poi tagliatele a listarelle (1, tenendo da parte alcune fettine intere per la decorazione finale.",
    "Unite le melanzane al sugo di pomodoro preparato in precedenza (conservatene una parte che vi servirà per impiattare) (1. Prendete quindi un tegame dai bordi alti, riempitelo d’acqua e portate a bollore. Salate e cuocete gli spaghetti al dente (17). Una volta cotti, scolateli e trasferiteli direttamente nella padella con il sugo di pomodoro e melanzane (18).",
    "Fate saltare qualche minuto gli spaghetti per amalgamarli al sugo per insaporire (19). Grattugiate la ricotta salata a lamelle sottili (20); servite la pasta alla Norma, aggiungendo qualche cucchiaio di salsa che avete messo da parte, e terminate con una spolverizzata di ricotta (21), con qualche fettina di melanzana e qualche fogliolina di basilico."
  ],
  "ingredients": [
    "0",
    "Spaghetti 320 g Ricotta salata 200 g Melanzane 500 g Aglio 5 g Basilico fresco 10 g Sale grosso 50 g Pomodori pelati 800 g Olio di oliva extravergine 30 g"
  ],
  "__v": 1
}