{
  "hash": "f2981a3e911ae28c01e87f13b3507408b0af91af",
  "title": "Baked Spasagna",
  "image": "",
  "href": "https://www.mycookbook-online.net/recipes/2282730/",
  "extension": "Chrome",
  "firstAdded": "2018-11-01T23:32:29.889000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350.",
    "Cook spaghetti al dente according to package directions. Rinse under cold water and drain. Place in large mixing bowl.",
    "In another mixing bowl, stir together sour cream, ricotta, half-and-half, mozzarella, oregano, basil, white pepper, garlic, salt, and half the Parmesan cheese.",
    "Add above cheese mixture to the spaghetti. Using hands, mix gently until spaghetti is evenly coated with mixture.",
    "Rub a 9x13 glass baking dish with the olive oil.",
    "Gently place spaghetti mixture into prepared dish. Top with remaining Parmesan cheese.",
    "Cover dish with aluminum foil and bake at 350 degrees in pre-heated oven for 30 minutes.",
    "Remove from oven, remove foil and place dish on cooling rack for 10 minutes.",
    "Cut into six-eight squares and top with meat sauce below, or your favorite meat or marinara sauce.",
    "MEAT SAUCE",
    "1. Heat a heavy saucepan on medium heat for five minutes.",
    "2. Add ground beef and stir to break up clumps. Cook until meat is browned well. Drain meat, and set aside.",
    "3. Add onions and garlic to saucepan and cook over medium heat for about five minutes, or until softened.",
    "4. Return reserved meat to pan, along with spaghetti sauce, salt, oregano, basil, sugar, red wine, and romano cheese. Stir well to combine.",
    "5. Bring mixture to a summer and cook uncovered for 30 minutes.",
    "6. Adjust seasoning with additional salt and pepper to taste."
  ],
  "ingredients": [
    "0",
    "1 lb spaghetti noodles, uncooked",
    "1 1⁄3 lbs mozzarella cheese",
    "5 1⁄3 ounces ricotta cheese",
    "5 1⁄3 ounces sour cream",
    "7⁄8 cup half-and-half",
    "1⁄3 cup grated parmesan cheese, divided use",
    "2⁄3 teaspoon dried oregano leaves",
    "2⁄3 tablespoon chopped fresh basil",
    "1⁄3 teaspoon white pepper",
    "2⁄3 teaspoon chopped garlic",
    "1 1⁄3 teaspoons kosher salt",
    "1 teaspoon olive oil",
    "Meat Sauce",
    "1 (16 ounce) jar spaghetti sauce",
    "8 ounces ground beef",
    "2⁄3 tablespoon chopped garlic",
    "2⁄3 cup chopped onion",
    "2⁄3 teaspoon kosher salt",
    "2⁄3 teaspoon dried oregano leaves",
    "2⁄3 tablespoon chopped fresh basil",
    "2⁄3 teaspoon granulated sugar",
    "1⁄3 cup red wine",
    "1⁄4 cup romano cheese",
    "2⁄3 to taste salt, to taste",
    "2⁄3 to taste pepper"
  ],
  "__v": 1
}