{
  "__v": 2,
  "directions": [
    "0",
    "make the salsa (yield: 2 c.):",
    "Heat a comal or cast-iron skillet over medium-high heat. Add tomatillos, jalapeño, onion, and garlic. Toast them, turning occasionally, until they are soft and have splotchy black spots on them. Garlic and onion may get done first, simply remove them from the comal and continue cooking tomatillos and chile until done. Peel the garlic cloves and place them into the jar of a blender along with the other charred veggies. Blend until you have a smooth puree. You should about 2 cups; if you have less, add water to make 2 cups. Season with salt and stir in cilantro. Reserve salsa.",
    "making the soup:",
    "Heat olive oil in a large saucepan over medium heat. Add onion and poblano and cook, stirring occasionally, until they are tender, ~5 minutes. Scrape them into a blender jar. Add half of the corn and all of the reserved salsa. Blend to a smooth puree. Set a medium-mesh strainer over the soup pot and pour the mixture through.",
    "Add the chicken stock to the blender jar and pulse a couple of times to get all of the flavor and goodness left behind. Pour this through the strainer, as well. Press down to get all of the liquid out. Discard solids.",
    "Bring the mixture to a boil, then reduce heat, partially cover, and simmer gently for 30 minutes.",
    "Combine masa harina and cold water in a small bowl, stirring until the masa harina is dissolved. Stir into the simmering soup. Allow to cook for another 5 minutes to thicken up a bit (to the consistency of a cream soup). Taste and adjust seasoning. Stir in remaining corn and cook for another minute.",
    "Ladle soup into bowls and garnish with some chopped cilantro. I also think that thinly sliced and fried tortilla strips would make the perfect garnish.",
    "- See more at: http://www.girlichef.com/2012/07/emerald-corn-soup.html#sthash.VoMMZ5KJ.dpuf"
  ],
  "firstAdded": "2014-08-17T03:03:25.317000",
  "hash": "a5214389801f20fd99054b83f0732bab33775a89",
  "href": "http://www.girlichef.com/2012/07/emerald-corn-soup.html",
  "image": "http://www.recipage.com/images/user563/1342195040/recipe_image.jpg",
  "ingredients": [
    "0",
    "14 oz. tomatillos, husked & rinsed",
    "1 (~1 oz.) jalapeño or serrano, stemmed",
    "1 small onion, peel & sliced into thick strips",
    "3 fat garlic cloves, unpeeled",
    "water, as needed",
    "1 tsp. salt",
    "palmful of cilantro, chopped",
    "1 small onion, rough chop",
    "1 large poblano, stemmed, seeded, rough chop",
    "1 Tbs. olive oil",
    "2 c. (from 3 ears corn) fresh corn kernels",
    "2 c. roasted tomatillo salsa (see above)",
    "2½ c. chicken stock or broth",
    "2 Tbs. masa harina",
    "¼ c. cold water",
    "salt, as needed",
    "cilantro, chopped",
    "corn tortillas, very thinly sliced & fried until crispy"
  ],
  "keywords": [
    "tomatillos",
    "husked",
    "rinsed",
    "jalapeo",
    "serrano",
    "stemmed",
    "onion",
    "peel",
    "strips",
    "fat",
    "garlic",
    "unpeeled",
    "water",
    "needed",
    "salt",
    "palmful",
    "cilantro",
    "rough",
    "poblano",
    "seeded",
    "tbs",
    "olive",
    "oil",
    "ears",
    "corn",
    "kernels",
    "roasted",
    "tomatillo",
    "salsa",
    "chicken",
    "stock",
    "broth",
    "masa",
    "harina",
    "cold",
    "tortillas",
    "fried",
    "crispy"
  ],
  "title": "Emerald Corn Soup Heather Schmitt-Gonzalez",
  "users": [
    null
  ]
}