{
  "hash": "d9401226c69f459ec104046cc9359ff2d90bbe87",
  "title": "Farfalle with a Creamy White Bean and Roasted Garlic Sauce",
  "image": "",
  "href": "http://www.spoonforkbacon.com/2016/02/farfalle-with-a-creamy-white-bean-and-roasted-garlic-sauce/",
  "extension": "",
  "firstAdded": "2017-07-13T22:38:55.224000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Fill a large pot with water and bring to a boil. Add a handful of salt, followed by the pasta and boil until the pasta is al dente, 6 to 8 minutes.",
    "Drain pasta, transfer to a large mixing bowl and lightly toss with olive oil. Set aside.",
    "Pour oil into a large saucepan and place over medium-high heat. Add shallots and sauté for 2 to 3 minutes. Add cumin, coriander, thyme, and sage and continue to sauté for 3 to 4 minutes. Add white beans (with their juices) and roasted garlic and season with salt and pepper. Sauté mixture for 2 to 3 minutes before adding 2 cups of stock and reducing temperature to medium-low. Simmer mixture for 5 to 6 minutes. Season with salt and pepper. Pour mixture into a blender, removing the center top of the lid and replacing it with a clean towel. Once the steam has dissipated a little bit (5 to 10 minutes), blend mixture until smooth, adding a little more stock to thin the pasta sauce out, if needed.",
    "Pour sauce over the cooked farfalle and toss together. Adjust seasonings and serve topped with minced parsley.",
    "**For roasted garlic: cut the top 1/2 inch of a head of garlic off (and discard) and place the garlic over a small piece of foil. Drizzle with oil and season with salt and pepper. Wrap the garlic in the foil and roast in a 375˚F oven for about 35 to 40 minutes. Allow garlic to cool before squeezing the roasted cloves out."
  ],
  "ingredients": [
    "0",
    "1/2 pound dry farfalle",
    "3 tablespoons extra virgin olive oil",
    "1 small shallot, diced",
    "1 1/2 teaspoons cumin",
    "1 teaspoon coriander",
    "1 tablespoon minced thyme",
    "2 teaspoons minced sage",
    "1 (15oz) can Progresso White Beans",
    "2 1/2 to 3 cups Progresso Chicken Stock OR Progresso Vegetable Stock",
    "1 head roasted garlic**",
    "salt and pepper to taste",
    "garnish:",
    "minced parsley"
  ],
  "__v": 1
}