{
  "hash": "5e17c9f57a3583cc1f66fc234fe27f27f715d546",
  "title": "Clinton Kelly's Eggplant Parmesan",
  "image": "http://cdn.beta.abc.com/service/image/index/id/bb845c6e-e6db-4c1e-bf3b-66ac6e735f0b/dim/290x290.jpg",
  "href": "http://beta.abc.go.com/shows/the-chew/recipes/Clinton-Kelly-Eggplant-Parmesan#5083304170da80301b000002",
  "keywords": [
    "medium",
    "eggplants",
    "lengthwise",
    "jar",
    "good",
    "quality",
    "tomato",
    "allpurpose",
    "flour",
    "eggs",
    "italian",
    "breadcrumbs",
    "parmigianoreggiano",
    "cheese",
    "mozzarella",
    "salt",
    "pepper",
    "olive",
    "oil"
  ],
  "directions": [
    "0",
    "step 1",
    "ingredients 2 cups All-purpose FlourSalt and pepper5 large Eggs3 1/2 cups Italian Breadcrumbs1/3 cup grated Parmigiano-Reggiano",
    "instructions Stir together flour, salt and pepper in a large dish. Lightly beat eggs in a second, high sided dish. Stir together breadcrumbs and 1/3 cup Parmigiano-Reggiano in a third shallow bowl. (think of the dishes this way: F-E-B [flour, egg, breadcrumbs])",
    "step 2",
    "ingredients Olive oil [small amount, roughly 1/4 cup or 4 tablespoons]",
    "instructions Heat a small amount oil in a non-stick skillet to medium-high heat.",
    "step 3",
    "ingredients 2 medium Eggplants, cut lengthwise",
    "instructions Working with 1 slice at a time, dredge eggplant in flour, shaking off excess, then dip in egg, letting excess drip off, and dredge in breadcrumbs until evenly coated. Transfer eggplant directly to hot oil. Note: Some people salt their eggplant before dipping in the F-E-B line-up. This is your choice.",
    "step 4",
    "ingredients 1 Jar good quality Tomato Sauce1 lb Fresh Mozzarella, thinly sliced2/3 cup Parmigiano-Reggiano",
    "instructions Fry eggplant 4 slices at a time, turning over once, until golden brown, 5 to 6 minutes per batch. Transfer with tongs to paper towels to drain.",
    "step 5",
    "instructions Spread 1 cup tomato sauce in bottom of a baking dish. Arrange about one third of eggplant slices in 1 layer over sauce, overlapping slightly if necessary. Cover eggplant with about one third of remaining sauce and one third of mozzarella. Continue layering with remaining eggplant, sauce, and mozzarella. Sprinkle top with remaining 1/3 cup Parmigiano-Reggiano.",
    "step 6",
    "instructions Bake at 350 degrees, uncovered, until cheese is melted and golden and sauce is bubbling, 35 to 40 minutes. The most important thing is to have the cheese not burn.",
    "print recipe"
  ],
  "ingredients": [
    "0",
    "2 medium Eggplants (cut lengthwise)",
    "1 Jar good quality Tomato Sauce",
    "2 cups All-purpose Flour",
    "5 large Eggs",
    "3 1/2 cups Italian Breadcrumbs",
    "1 cup grated Parmigiano-Reggiano cheese",
    "1 lb Fresh Mozzarella (thinly sliced)",
    "Salt and pepper",
    "1/4 cup (about 4 tablespoons) Olive oil"
  ],
  "__v": 0
}