{
  "hash": "1c1f2267ffd865f209df69e22814d05c9db5c552",
  "title": "Roasted Butternut Squash, Radicchio, and Onion",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2012/12/roasted-butternut-squash-radicchio-onion-vertical-a-1588.jpg",
  "href": "https://www.simplyrecipes.com/recipes/roasted_butternut_squash_radicchio_and_onion/",
  "extension": "",
  "firstAdded": "2018-01-28T01:17:56.201000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Roast the vegetables: Preheat the oven to 400°F. Toss the squash chunks, onion and radicchio wedges in olive oil and salt them well.",
    "Arrange in one layer on baking sheets (you may need two) and put in the oven.",
    "Roast the vegetables until their edges are nicely caramelized, turning the radicchio and onion wedges over about halfway through the roasting.",
    "The radicchio, onion, and squash will roast at different speeds. So periodically you'll have to remove the finished vegetables and let the others remain in the oven to finish roasting. As a guideline, roast the radicchio for about 25 minutes, turning halfway.",
    "Roast the onions about 35 minutes, again, turning halfway. Roast the squash pieces for 45 minutes, but do not turn.",
    "In all cases do not remove from the oven until you see browning on the edges.",
    "2 Toast the pine nuts: While the vegetables are roasting, toast the pine nuts. Heat a small pan on medium high heat. Add the pine nuts in a single layer. Cook until lightly toasted. Remove from heat to a bowl to keep the nuts from burning.",
    "3 Chop roasted radicchio and onions: Once all the vegetables are cool enough to handle, roughly chop the radicchio and onion into manageable pieces.",
    "4 Toss with pine nuts, parsley, balsamic, black pepper: Place the radicchio, onion, and butternut squash in a large serving bowl. Add the pine nuts and parsley. Add black pepper to taste. Drizzle with balsamic vinegar. Stir gently to combine, taking care not to squish the soft roasted squash.",
    "To serve, sprinkle with some grated Parmesan or pecorino cheese."
  ],
  "ingredients": [
    "0",
    "1 medium butternut squash (about 2 pounds), peeled and cut into chunks",
    "1 large onion, peeled and cut into wedges through the root",
    "1 head radicchio, cut into wedges through the root",
    "Olive oil",
    "Salt and black pepper",
    "1/2 cup pine nuts",
    "1/4 cup chopped parsley",
    "Grated parmesan or pecorino cheese to taste, about 1/4 cup to 1/3 cup",
    "Balsamic vinegar to taste, about a tablespoon"
  ],
  "__v": 1
}