{
  "hash": "08ded7f274e8a6a363a6f16483e36ffd799027b9",
  "title": "Haddock with cannellini beans & artichokes",
  "image": "//www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe/recipe-image/2016/12/haddock.jpg?itok=gzAn9PLN",
  "href": "https://www.bbcgoodfood.com/recipes/haddock-cannelloni-beans-artichokes",
  "extension": "Chrome",
  "firstAdded": "2018-11-21T15:26:48.460000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat oven to 200C/180C fan/gas 6. In a bowl, mix the beans, zest and juice of half the lemon, the garlic and parsley. Stir through 1 tbsp olive oil and season to taste. Very lightly crush the beans with the back of a wooden spoon, keeping some of them whole.",
    "Cut a large square of baking parchment, spoon the beans onto the centre and top with the fish. Scatter the artichokes around the fish, drizzle over the remaining olive oil, squeeze a little lemon juice over and season well. Bring both sides of the parchment upwards and fold together to create a tight seal, then twist the ends tightly (like a giant sweet).",
    "Put the fish on a baking tray and bake in the oven for 13-15 mins or until the fish is just cooked."
  ],
  "ingredients": [
    "0",
    "400g can cannellini beans Cannellini bean can-a-leen-ee beenSlightly kidney-shaped with squarish ends, cannellini beans are from Italy and are creamy white… , drained and rinsed",
    "1 small lemon Lemon le-monOval in shape, with a pronouced bulge on one end, lemons are one of the most versatile fruits… , zested and juiced",
    "small garlic clove, grated",
    "1 tbsp roughly chopped parsley Parsley par-sleeOne of the most ubiquitous herbs in British cookery, parsley is also popular in European and…",
    "2 tbsp olive oil Olive oil ol-iv oylProbably the most widely-used oil in cooking, olive oil is pressed from fresh olives. It's…",
    "1 skinless haddock Haddock haad-dokA white-fleshed salt water fish often compared with cod in flavour and texture. Found on the… fillet",
    "2 artichokes from a can, drained and halved"
  ],
  "__v": 1
}