{
  "hash": "e733392ecb9601c28087c8f13f81cd30e1628d1f",
  "title": "GEORGIAN CHEESE AND EGG BREAD (ACHARULI KHACHAPURI)",
  "image": "http://www.saveur.com/sites/saveur.com/files/styles/large_1x_/public/import/2013/images/2013-03/103-cheese_egg_bread_500.jpg?itok=xbMnwQ1N",
  "href": "http://www.saveur.com/Article/Recipes/Acharuli-Khachapuri-Cheese-And-Egg-Bread",
  "extension": "Chrome",
  "firstAdded": "2016-03-07T23:33:21.275000",
  "users": [
    null
  ],
  "keywords": [
    "active",
    "dry",
    "yeast",
    "sugar",
    "olive",
    "oil",
    "greasing",
    "flour",
    "dusting",
    "kosher",
    "salt",
    "muenster",
    "cheese",
    "crumbled",
    "feta",
    "eggs",
    "unsalted",
    "butter",
    "cubed"
  ],
  "directions": [
    "0",
    "Instructions",
    "Combine yeast, sugar, and 2⁄3 cup water heated to 115° in a bowl; let stand until foamy, about 10 minutes. Add oil, flour, and salt; mix with a wooden spoon until a soft dough forms. Transfer to a lightly floured surface and knead until smooth and elastic, about 4 minutes. Transfer to a lightly greased bowl and cover loosely with plastic wrap; set in a warm place until doubled in size, about 45 minutes.",
    "Place a pizza stone on a rack in lower third of oven. Heat oven to 500° for 1 hour. Combine cheeses in a bowl; set aside. Punch down dough and divide in half. On a piece of lightly floured parchment paper, roll half of dough into a 10\" circle about 1⁄8\" thick. Spread a quarter of the cheese mixture over dough, leaving a 1⁄2\" border. On one side of the circle, tightly roll dough about a third of the way toward the center. Repeat on the opposite end. There should be a 2\"-3\" space between the two rolls. Pinch the open ends of the rolls together and twist to seal, making a boat shape; place another quarter of the cheese mixture in the middle; repeat with remaining dough and cheese. Transfer boats on paper to stone; bake until golden brown, 14–16 minutes. Crack 1 egg into the center of each boat. Return to oven until egg white is slightly set, 3–4 minutes. Place 2 tbsp. butter on each bread; serve hot."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 tsp. active dry yeast",
    "1⁄4 tsp. sugar",
    "1 tbsp. olive oil, plus more for greasing",
    "1 1⁄4 cups flour, plus more for dusting",
    "1 tsp. kosher salt",
    "2 1⁄4 cups shredded Muenster cheese (14 oz.)",
    "1 cup crumbled feta cheese (6 oz.)",
    "2 eggs",
    "4 tbsp. unsalted butter, cubed"
  ],
  "__v": 1
}