{
  "hash": "620f9bcd59fd833d77e7b7ee704e40b84cfbbac3",
  "title": "HOT AND SOUR SOUP",
  "image": "http://recipe-folder.com/img/recipe-images/085/116/3758860285.jpg",
  "href": "http://thewoksoflife.com/2013/10/hot-sour-soup/",
  "extension": "",
  "firstAdded": "2016-02-21T22:11:42.878000",
  "users": [
    null
  ],
  "keywords": [
    "cornstarch",
    "water",
    "red",
    "chili",
    "peppers",
    "pork",
    "shoulder",
    "loin",
    "oil",
    "soaked",
    "lily",
    "flower",
    "wood",
    "ears",
    "shiitake",
    "mushrooms",
    "block",
    "spiced",
    "tofu",
    "packaged",
    "firm",
    "winter",
    "bamboo",
    "shoots",
    "canned",
    "better",
    "eggs",
    "scallion",
    "chicken",
    "stock",
    "white",
    "pepper",
    "dark",
    "mushroom",
    "soy",
    "light",
    "salt",
    "sesame",
    "vinegar",
    "sugar"
  ],
  "directions": [
    "0",
    "Mix ¼ cup cornstarch with an equal amount of water and use a spoon to stir until completely dissolved.",
    "Cut the dried chile peppers in half discard the seeds. Mince them up and set aside.",
    "Slice the pork into small strips and place into a bowl with the last teaspoon of cornstarch and ½ teaspoon oil. Stir it all together.",
    "Soak the dried lily flower, wood ears, and mushrooms for an hour or two until hydrated. Once they’re ready, slice the mushrooms and give the wood ears a rough chop. Trim the tough ends off the lily flowers and cut them in half.",
    "Cut the spiced tofu and the firm tofu into 2-inch long and ¼-inch thick pieces. Slice the winter bamboo shoots into the same shape.",
    "Beat the two eggs in a bowl. Wash and chop the scallion and set aside.",
    "Bring the chicken stock to a boil in a wok or pot and add the pork. Stir to ensure the slices are not clumped together. Skim off any foam that floats to the top.",
    "Add the chili pepper, white pepper and both soy sauces, and check the soup for salt. Add the lily flowers, wood ears, mushrooms and bamboo shoots and bring the soup to a simmer. Add the two kinds of tofu, sesame oil, vinegar and a pinch of sugar and stir. It should start to look and smell like the real thing about now!",
    "Use a spoon to remix your cornstarch slurry in the bowl so it’s all combined. Bring the mixture to a simmer and use your soup ladle and stir the soup at the center of the wok in steady a circular motion to make a whirlpool while slowly pouring the corn starch slurry in a thin stream. This prevents the cornstarch from clumping. Stop when you are about ¾ of the way done with your slurry to check the consistency of the soup. It should be thick enough to coat your spoon or ladle. Add the rest if needed.",
    "Keep the soup simmering and use the same technique with the beaten eggs and again, make sure the motion is fast enough or you will end up with egg clumps instead of the beautiful swirls or egg “flowers” (which is what the Chinese call it).",
    "Garnish with the chopped scallions and serve."
  ],
  "ingredients": [
    "0",
    "¼ cup cornstarch, plus 1 teaspoon",
    "¼ cup water",
    "1 to 2 dried red chili peppers",
    "3 oz. pork shoulder or loin",
    "½ teaspoon oil",
    "¼ cup soaked dried lily flower",
    "¼ cup soaked wood ears",
    "¼ cup soaked dried shiitake mushrooms",
    "1 small block of spiced tofu (1/4 cup)",
    "¼ cup packaged firm tofu",
    "¼ cup winter bamboo shoots (canned is ok and fresh is better if you can find it)",
    "2 eggs",
    "1 scallion",
    "8 cups chicken stock",
    "½ teaspoon fresh ground white pepper",
    "2 teaspoon dark soy or mushroom soy sauce",
    "1 tablespoon light or seasoned soy sauce",
    "Salt to taste",
    "1 teaspoon sesame oil",
    "3 tablespoons white vinegar",
    "1 pinch of sugar"
  ],
  "__v": 1
}