{
  "hash": "bede6c93aa69f4d784463450e323d3676591cdaa",
  "title": "Crispy Baked Sweet Potato Fries",
  "image": "https://cookieandkate.com/images/2010/12/sweet-potato-fries-8-550x367.jpg",
  "href": "https://cookieandkate.com/2010/baked-sweet-potato-fries/",
  "extension": "",
  "firstAdded": "2018-05-01T16:39:57.925000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 425 degrees Fahrenheit. Peel the sweet potatoes and cut them into fry-shaped pieces (see photos). Try to cut them into similarly sized pieces so the fries will bake evenly.",
    "Toss the uncooked fries into a mixing bowl or a plastic bag, or just onto your baking sheet. Sprinkle with cornstarch (if using) and pour in a few tablespoons of olive oil, enough to lightly coat the fries. Season with salt, pepper, and spices. I’d try to use half a teaspoon per potato or so. Mix/shake to distribute evenly (corn starch should be evenly mixed in so there are no powdery spots).",
    "Pour the fries directly onto a dark, non-stick baking sheet for best results (lining with aluminum foil produces mixed results and parchment paper can burn in the hot oven). Arrange your fries in a single layer and don’t overcrowd, otherwise they will never crisp up.",
    "Bake for 15 minutes, then flip the fries so they can cook on all sides. I find the easiest way to flip them is with a metal spatula. Section by section, scoop up about ten fries and flip them with a quick turn of the wrist.",
    "Bake for 10 to 15 more minutes, or until the fries are crispy. You’ll know they’re done when the surface of the fries change from shiny orange to a more matte, puffed up texture. It’s essential to bake them long enough, otherwise they won’t be crispy. Don’t worry if the edges are a little bit brown; they will taste more caramelized than burnt."
  ],
  "ingredients": [
    "0",
    "Sweet potatoes. I’d plan on at least one per person. Medium-sized sweet potatoes with smooth, firm, evenly toned skin usually make the best sweet potato fries.",
    "Corn starch. A big sprinkle’s worth. (optional)",
    "Olive oil. A couple of tablespoons or so. Enough to lightly and evenly coat the fries.",
    "Salt, pepper and spices. Amy suggested cumin, but I much prefer cayenne pepper, paprika or curry powder. Garlic is great as well. It’s up to you!"
  ],
  "__v": 1
}