{
  "hash": "92fa10e19f88152c7359cfd4ceb18c3caad3eb6d",
  "title": "Курица под сливочно-грибным соусом",
  "image": "http://cs9.pikabu.ru/post_img/2016/12/11/6/1481449847168399333.jpg",
  "href": "http://pikabu.ru/story/kuritsa_pod_slivochnogribnyim_sousom_4677822",
  "extension": "Chrome",
  "firstAdded": "2017-01-18T17:33:44.900000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Берем куриное филе и расслаиваем его острым ножом (нет, не понты, просто тупым ножом это смертельно тупо делать) на 2 куска потоньше. Применяем соль, перец, предварительно чуть капнув подсолнечного масла, чтобы лучше прилипало.",
    "Делим каждый новоиспеченный кусок на куски поменьше для оптимизации использования пространства в сковороде)",
    "Разогреваем сковороду с растительным маслом, не скупимся на кусок сливочного для диетичности.",
    "На разогретое масло выкладываем куски курицы и обжариваем с каждой стороны до образования СЕКСУАЛЬНОЙ золотистости, не более. Если Вам кажется, что внутри она не готова - не переживайте, это еще не все)",
    "Откладываем курицу на тарелку до лучших времен..это уже хочется съесть..но нужно потерпеть.",
    "Масло, оставшееся на сковороде после обжаривания курицы, никуда не сливаем - оставляем как есть - пригодится.",
    "Приступаем к вкусовой основе соуса. Режем грибы сначала пополам, затем на ломтики. Рубим лук-лучок, желательно, наверное, помельче..чтобы он как бы \"растворился\" в соусе.",
    "Давим зубчики чеснока боковой стороной ножа, чтобы быстрее отдавали вкус блюду.",
    "На сковороде осталось масло после обжаривания курицы - добавим к нему еще немного сливочного и разогреем как следует.",
    "Зубчики чеснока кидаем в масло и обжариваем до золотистости, они отдадут немного вкуса и аромата в масло, потом их можно варварски убрать со сковороды и выбросить.",
    "Начинаем обжаривать лук, до прозрачности, затем к нему отправляются грибы.",
    "Если Вам кажется, что грибов слишком много, это не так - они сильно потеряют в объеме после обжарки.",
    "Если Вам кажется, что масла совсем дофига - ну да, так оно и есть почти)..грибы впитают всю жидкость, которую найдут на сковороде, пока не обжарятся более-менее)",
    "Получаем на сковороде ароматную золотистую смесь обжаренного лука и грибов, слегка солим, перчим. Уменьшаем огонь на плите.",
    "Вливаем разом сливки, кидаем сметану, горчицу, присыпаем сухими специями.",
    "Тщательно перемешиваем все содержимое сковороды до однородности.",
    "Вот скоро начнется самое интересное...СЛЕДИТЕ ЗА СОУСОМ И ПОМЕШИВАЙТЕ ПОЧАЩЕ!",
    "Выкладываем в соус куски курицы. Немного протушим их, накрыв крышкой, чтобы они напитались сливочным вкусом.",
    "НО НЕ ОСТАВЛЯЙТЕ БЕЗ ПРИСМОТРА, если не помешивать, то кое-где у самой поверхности сковороды влага может исчезнуть и соус начнет сворачиваться."
  ],
  "ingredients": [
    "0",
    "- куриное филе, 2 шт. (в этот раз я немного поленился и не стал искать где подешевле, поэтому влетел на Петелинку и 2 крупных филе обошлись мне в ~160 руб.)",
    "- шампиньоны, около 150 г. (брал в Пятерочке упаковку 250 г., в блюде примерно на 45 руб.)",
    "- сливки, 260 мл. (лучше жирные, лучше 20%, меньше не стоит..почему? - объясню чуть позже, ~60 руб.)",
    "- сметана, 2 ст.л. (наверное, можно и без нее, но я все же положил).. ну может на ~10 руб.)",
    "- горчица, 1.5-2 ст.л. (придется очень кстати, добавит пикантности..и вообще неплохо заходит со сливочной темой, ~15 руб. - у меня Heinz, можно и дешевле найти)",
    "- лук репчатый, 2 шт. (на глаз..ну кто как любит, ~3 руб.)",
    "- чеснок, 2-3 зубчика (не совсем в само блюдо, больше для аромата, ~4 руб.)",
    "- петрушка свежая (несколько веток..больше для подачи, ~3 руб.)",
    "- базилик сушеный, ~1 ч.л. (..не ну я даже не знаю, пусть 2 руб.)",
    "- розмарин сушеный, ~децл (сильный вкус - не злоупотребляем, 2 руб.)",
    "- масло сливочное, ~20 г. (ну около 8 руб.)",
    "- соль, перец, по вкусу",
    "да, про гарнир еще:",
    "- макарошки-спагетти, на 2 порции (ну тут на Ваше усмотрение..особо искушенные могут вермишель"
  ],
  "__v": 1
}