{
  "hash": "555ef69e697c7d834101c9b327260f9933974cbd",
  "title": "No-Churn Mint Chocolate Chip Ice Cream",
  "image": "http://www.budgetbytes.com/wp-content/uploads/2016/09/No-Churn-Mint-Chocolate-Chip-Ice-Cream-front.jpg",
  "href": "https://www.budgetbytes.com/2016/09/no-churn-mint-chocolate-chip-ice-cream/",
  "extension": "Chrome",
  "firstAdded": "2016-12-28T19:22:16.184000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Chill a 2 quart or larger glass or metal casserole dish or bread pan in the freezer while you prepare the ice cream mixture.",
    "In a medium bowl, stir together the sweetened condensed milk, mint extract, and vanilla extract.",
    "In a separate large bowl, whip the heavy whipping cream until stiff peaks form (use a hand mixer or a whisk and some elbow grease). Be sure not to over whip the cream to the point where it breaks down and separates.",
    "Take a scoop of the whipped cream and fold it into the bowl with the sweetened condensed milk. This will help lighten the thick condensed milk a bit.",
    "Now take about ⅓ of the sweetened condensed milk and fold it into the bowl of whipped cream. Fold gently until it is incorporated, then add ⅓ more and gently fold the mixture again. Repeat this process until all the sweetened condensed milk is incorporated into the whipped cream and the mixture is smooth.",
    "Spoon the ice cream mixture into the chilled dish and spread the top smooth. Cover and chill the mixture for two hours. After chilling, drizzle the chocolate syrup over top and add the chocolate chips. Gently fold the syrup and chips into the chilled mixture to create a marbled texture (don't over stir). Return the ice cream to the freezer and freeze until solid (6-8 hours). Scoop and enjoy!"
  ],
  "ingredients": [
    "0",
    "14oz. can sweetened condensed milk $1.78",
    "1½ tsp mint extract $0.43",
    "½ tsp vanilla extract $0.14",
    "1 pint heavy whipping cream $2.54",
    "¼ cup mini chocolate chips $0.23",
    "¼ cup chocolate syrup $0.26"
  ],
  "__v": 1
}