{
  "hash": "3d8d480838fc1ffe4504c572a8006ab47b2efdcb",
  "title": "Slow Cooker Pork Chops",
  "image": "http://tiphero.com/wp-content/uploads/2017/05/Slow-Cooker-Pork-Chops-1.jpg",
  "href": "http://tiphero.com/slow-cooker-pork-chops/",
  "extension": "Chrome",
  "firstAdded": "2017-09-17T11:48:27.072000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "rections",
    "Season the pork chops with salt, black pepper, and brown sugar (if using) to taste. Either cook immediately, or cover and refrigerate overnight. (Seasoning the night before will give your pork chops a deeper flavor, but isn’t necessary.)",
    "Heat 1½ tablespoons of butter in a large sauté pan over medium-high heat. Sear the pork chops on both sides until they’re golden brown, approximately 3 – 5 minutes per side. Add the seared chops to the slow cooker. (It’s OK to overlap the pork chops slightly, but don’t stack them on top of each other).",
    "Add the remaining ½ tablespoon of butter to the sauté pan, followed by the sliced onions. Cook the onions until they begin to brown, about 3-5 minutes. Add the herbs and cook for another 30 seconds or until fragrant. Add the chicken broth, apple cider, soy sauce, and Worcestershire sauce to deglaze the pan. Stir everything to combine, and make sure to scrape up the browned bits from the bottom of the pan. Pour the cooking liquid and onions over the pork chops.",
    "Cook for 4 – 5 hours on low or for 2 – 3 hours on high.",
    "Remove the cooked pork chops from the slow cooker and set them aside on a plate. Whisk the cornstarch and water mixture into the cooking liquid. Return the pork chops to the slow cooker and cook on high until the sauce is thickened and the pork chops are fork-tender, about 30 – 60 minutes. (If the sauce doesn’t thicken enough, use additional cornstarch slurry, but keep in mind that the sauce will thicken more as it cools.) Serve with mashed potatoes, rice, veggies, or your favorite sides."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "4 bone-in pork chops (¾ – 1-inch thick, around ½ pound each)",
    "Kosher salt, to taste",
    "Ground black pepper, to taste",
    "Brown sugar, to taste (optional)",
    "2 Tablespoons butter, divided",
    "1 large onion, sliced (about 2½ – 3 cups)",
    "1 teaspoon dried thyme or rosemary (or 1 Tablespoon chopped fresh thyme or rosemary)",
    "1 cup chicken broth or stock",
    "¼ cup apple cider (no added sugar)",
    "3 Tablespoons low sodium soy sauce",
    "1 Tablespoon Worcestershire sauce",
    "2 – 3 Tablespoons cornstarch mixed with 2 Tablespoons water"
  ],
  "__v": 1
}