{
  "hash": "a88e7e52e362706899deff27a52b61064d516ed2",
  "title": "LASAGNA WITH RICOTTA AND MOZZARELLA",
  "image": "",
  "href": "http://lidiasitaly.com/recipes/lasagna-ricotta-mozzarella/",
  "extension": "Chrome",
  "firstAdded": "2018-02-28T16:26:51.314000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the pasta dough, and let it rest 30 minutes at room temperature while you make the sauce. (Don’t try to make a double batch at once in a standard food processor— it’s too much. Make two single batches.)",
    "Preheat oven to 375 degrees. For the sauce, heat the olive oil in a large Dutch oven over medium heat. When the oil is hot, add the garlic, and cook until it’s just golden on the edges, about 1 to 2 minutes. Add the tomatoes, slosh out the can with 1½ cups of water, and add that to the pan. Season the sauce with the red pepper flakes and salt. Simmer until slightly thickened, about 20 minutes. Stir in the chopped basil. You should have about 6 to 6½ cups sauce.",
    "To roll the pasta, cut each dough ball into six pieces. Keep the pieces covered as you work, and line several baking sheets with floured kitchen towels.",
    "Flatten each piece, then roll it through the pasta machine on the widest setting several times, folding it like a letter (rectangle) each time to smooth the dough. Once you have a smooth rectangle, continue to roll the piece through setting, skipping one setting each time you roll, stopping at the next- to- last setting. A hand pasta machine usually has nine settings and in rolling the sheets of pasta, each new setting will make the pasta thinner. Layer the thin sheets of pasta without touching, on the floured towels. You should have twelve long sheets of dough.",
    "Set up a large roasting pan filled with ice water next to the boiling pasta water. Cook the sheets of pasta, a few at a time, until still quite al dente, about 2 to 3 minutes per batch once they return to a boil. As they’re cooked, cool the sheets in the ice water, then store them on baking sheets lined with damp kitchen towels.",
    "For the filling, stir together the ricotta, grated cheese, eggs, parsley, and salt in a large bowl. Mix well to combine.",
    "When you are ready to assemble the lasagna, butter a 4- quart lasagna pan. Spread 1 cup sauce in the bottom of the baking dish. Pick out the two longest sheets of pasta and lay them in the baking dish so they overlap in the center of the dish and the ends of the pasta sheets flop over the short sides of the baking dish. Spread another ½ cup sauce over the pasta. Fit two more pasta sheets in the dish, perpendicular to the first layer and flopping over the long sides of the dish. (After these two layers, the pasta should no longer go over the sides— cut the cooked pasta as you are layering the lasagna and fold to fit the pasta to the dimensions of the dish.)",
    "Spread another ½ cup of sauce over the pasta and spread with half of the filling. Layer with half of the sliced mozzarella, and sprinkle with ½ cup grated Grana Padano. Make another layer of pasta, cutting and folding to fit the dish. Spread with another ½ cup sauce, the remaining filling, the remaining sliced mozzarella, and ½ cup grated Grana Padano. Top with another pasta layer, and press lightly.",
    "Add another layer of pasta of pasta sheets to cover the lasagna, then 1 cup sauce. Then cut and fold a final layer of pasta on top of the sauce to seal the lasagna. Fold the flopping edges over the top, and spread with the remaining sauce. Sprinkle with the remaining grated Grana Padano. Tent the lasagna with foil (making sure it doesn’t touch the top), place on a sheet pan to catch drips, and bake until the edges of the lasagna are bubbly, about 45 minutes. Uncover, and bake until the top is golden and crusty, about 30 minutes more. Let the lasagna rest about 20 minutes before cutting into squares and serving. The lasagna cuts best when it has rested and cooled."
  ],
  "ingredients": [
    "0",
    "For the pasta:",
    "2 recipes poor man’s two-egg pasta dough (recipe here)",
    "For the sauce:",
    "¼ cup extra-virgin olive oil",
    "5 cloves garlic, thinly sliced",
    "Two 28-ounce cans whole San Marzano tomatoes, crushed by hand",
    "¼ teaspoon crushed red pepper flakes",
    "1½ teaspoons kosher salt",
    "½ cup loosely packed fresh basil leaves, chopped",
    "For the filling:",
    "3 pounds fresh ricotta, drained overnight",
    "1 cup grated Grana Padano",
    "2 large eggs, beaten",
    "½ cup chopped fresh Italian parsley",
    "½ teaspoon kosher salt",
    "For the assembly:",
    "Unsalted butter, softened, for the baking dish",
    "1½ pounds fresh mozzarella, thinly sliced",
    "1½ cups grated Grana Padano"
  ],
  "__v": 1
}