{
  "hash": "9fc3960e0d91a8f24013e9ecee0b7a28f1b4892b",
  "title": "Foolproof Mega Lentil Burger [Vegan, Gluten-Free]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/05/lentil1.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/foolproof-mega-lentil-burger/",
  "extension": "",
  "firstAdded": "2015-05-27T22:44:41.219000",
  "users": [
    null
  ],
  "keywords": [
    "brown",
    "rice",
    "lentils",
    "green",
    "black",
    "orangered",
    "medium",
    "onion",
    "coarsely",
    "clove",
    "garlic",
    "potato",
    "skins",
    "walnuts",
    "ketchup",
    "tomato",
    "dijon",
    "yellow",
    "mustard",
    "flax",
    "meal",
    "salt",
    "cayenne",
    "pepper",
    "coarse",
    "cornmeal",
    "polenta",
    "needed"
  ],
  "directions": [
    "0",
    "Ideally, pre-cook your rice and lentils and let cool. If you have some in fridge as leftovers, even better (the drier they are the better). If not, cook them up, remove from heat and set aside. Preheat oven to 450 degrees and lightly oil a baking sheet or line with parchment paper.",
    "In food processor combine onion, garlic, sweet potato and walnuts. Process until finely chopped and uniform consistency. Add cooked rice and lentils and process once more, scraping down the sides as needed. Transfer mixture to a large bowl and add ketchup or tomato paste, mustard, flax meal, salt, cayenne (or black pepper), and stir well.",
    "Add corn meal until mixture is thick and you’re able to easily form a patty in your hands. Make small palm sized patties, think slider size. You can make them larger, but the smaller ones bake up a little better and have less risk of breaking apart.",
    "Place formed patties on baking sheet, evenly spaces apart so they have room to cook, and be flipped. Bake for 15-20 minutes, then carefully flip over. Return to oven and bake for an additional 15-20 minutes until both sides are evenly browned and they have a nice crisp coating.",
    "Serve on bread, bun, lettuce wrap of choice, or simply crumble over a salad. Top with your favorite burger fixings and save any for later. Enjoy!"
  ],
  "ingredients": [
    "0",
    "1 cup brown rice, cooked",
    "1 3/4 cups cooked lentils (brown, green or black; not orange/red)",
    "1 medium onion, coarsely chopped",
    "1 clove garlic",
    "1 cup sweet potato, chopped (skins on)",
    "1/2 cup walnuts, chopped",
    "1/3 cup ketchup (or tomato paste)",
    "1 Tbsp Dijon or yellow mustard",
    "3 Tbsp flax meal",
    "1 tsp sea salt",
    "1/4 tsp cayenne pepper or black pepper",
    "3/4 -1 cup coarse cornmeal (polenta), as needed"
  ],
  "__v": 1
}