{
  "hash": "f741897c8316b2e4a3945aa26e47bde047d41ba7",
  "title": "CHINESE BBQ PORK (ROAST PORK CHA SIU)",
  "image": "https://thewoksoflife.com/wp-content/uploads/2014/02/DSC_00093.jpg",
  "href": "https://thewoksoflife.com/2014/02/chinese-bbq-pork-cha-siu/",
  "extension": "Chrome",
  "firstAdded": "2018-12-06T15:16:00.533000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cut the pork into long strips about 3 inches thick. Don’t trim any excess fat as it will render off and also give you more good flavor. Combine the rest of the ingredients in a bowl to make the BBQ sauce. Reserve about 2 tablespoons and pour the rest into a large zip top bag along with the pork. Make sure the pork is coated with the sauce, squeeze the air out of the bag, and seal it. Marinate in the refrigerator overnight. Store the reserved sauce for later as well.",
    "In my parent’s restaurant, we had a large standing roasting oven the size of a narrow refrigerator, where the pork could hang from these large S-shaped hooks and roast evenly at very high temperatures. To simulate this at home, preheat your oven to the highest setting (at least 475 degrees). Then line a sheet pan with foil and place a metal rack on top.",
    "If you want to try this CHinese BBQ pork out on the grill then check out our recipe for BBQ Char Siu on the Grill, especially for the summer months!",
    "Using the metal rack keeps the pork off of the pan and allows it to roast more evenly, like it does in commercial ovens described above. Place the pork on the racks, leaving as much space as possible between pieces, and put the pan in the upper portion of the oven. Pour the rest of the marinade from the bag into a bowl for basting.",
    "If you don’t own a sheet pan and roasting rack, then you definitely have to check out our Chinese Cooking tools sheet pan and roasting rack setup we recommend or you can make due with what you have like we did here in this post!",
    "After 25 minutes or so, flip the pork and baste with some of the marinating liquid. If needed, add a half cup of water to the bottom of the sheet pan to prevent burning or smoking from the drippings. If you have a leaner cut of meat, you may want to add some water at the beginning of the roasting process, baste more often and/or lower the oven temperature to 425 degrees (updated May 5, 2014 from reader feedback). After another 25-30 minutes, turn on the broiler to crisp the outside and add some color/flavor. Be sure not to walk away during this process, since the sweet BBQ sauce can burn if left unattended. Take out of the oven and use a clean basting brush to brush the roasted pork with those last couple tablespoons of reserved BBQ sauce. Let the meat rest for 10 minutes and enjoy! Use Chinese BBQ pork in place of ham in our super easy banquet fried rice recipe. Or try slicing it up and putting it in a sandwich:"
  ],
  "ingredients": [
    "0",
    "3 pounds pork shoulder/pork butt (Select a cut with some good fat on it)",
    "2 tablespoons sugar",
    "1 teaspoon salt",
    "½ teaspoon five spice powder",
    "1 teaspoon paprika",
    "¼ teaspoon white pepper",
    "1 tablespoon sherry or Chinese plum wine",
    "1 tablespoon soy sauce",
    "½ teaspoon sesame oil",
    "2 teaspoons hoisin sauce",
    "2 teaspoons tomato paste",
    "2 teaspoons molasses",
    "1 tablespoon oil",
    "3 cloves minced garlic",
    "1 tablespoon hot water"
  ],
  "__v": 1
}