{
  "hash": "cc2e17fb659118e2b4ec3fdecc358e8c84bbc90d",
  "title": "Chocolate Sheet Cake with Milk Chocolate Frosting",
  "image": "https://res.cloudinary.com/hksqkdlah/image/upload/ar_1:1,c_fill,dpr_1.0,f_auto,q_auto,w_400/33957_sfs-chocolate-sheet-cake-milk-chocolate-frosting-60",
  "href": "https://www.cooksillustrated.com/recipes/9480-chocolate-sheet-cake-with-milk-chocolate-frosting",
  "extension": "Chrome",
  "firstAdded": "2018-11-30T21:35:32.409000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "SERVES 12",
    "While any high-quality chocolate can be used here, our preferred bittersweet chocolates are Ghirardelli 60% Cacao Bittersweet Chocolate Premium Baking Bar and Callebaut Intense Dark Chocolate, L-60-40NV, and our favorite milk chocolate is Dove Silky Smooth Milk Chocolate. We recommend making this cake with a Dutch-processed cocoa powder; our favorite is from Droste. Using a natural cocoa powder will result in a drier cake.",
    "1. FOR THE CAKE: Adjust oven rack to middle position and heat oven to 325 degrees. Lightly spray 13 by 9-inch baking pan with vegetable oil spray. Whisk sugar, flour, baking soda, and salt together in medium bowl; set aside.",
    "2. Combine milk, chocolate, and cocoa in large saucepan. Place saucepan over low heat and cook, whisking frequently, until chocolate is melted and mixture is smooth. Remove from heat and let cool slightly, about 5 minutes. Whisk oil, eggs, and vanilla into chocolate mixture (mixture may initially look curdled) until smooth and homogeneous. Add sugar mixture and whisk until combined, making sure to scrape corners of saucepan.",
    "3. Transfer batter to prepared pan; bake until firm in center when lightly pressed and toothpick inserted in center comes out with few crumbs attached, 30 to 35 minutes, rotating pan halfway through baking. Let cake cool completely in pan on wire rack before frosting, 1 to 2 hours.",
    "4. FOR THE FROSTING: While cake is baking, combine chocolate and cream in large heatproof bowl set over saucepan filled with 1 inch barely simmering water, making sure that water does not touch bottom of bowl. Whisk mixture occasionally until chocolate is uniformly smooth and glossy, 10 to 15 minutes. Remove bowl from saucepan. Add butter, whisking once or twice to break up pieces. Let mixture stand for 5 minutes to finish melting butter, then whisk until completely smooth. Refrigerate frosting, without stirring, until cooled and thickened, 30 minutes to 1 hour.",
    "5. Once cool, whisk frosting until smooth. (Whisked frosting will lighten in color slightly and should hold its shape on whisk.) Spread frosting evenly over top of cake. Cut cake into squares and serve out of pan. (Leftover cake can be refrigerated in airtight container for up to 2 days.)"
  ],
  "ingredients": [
    "0",
    "Cake",
    "1 ½\tcups (10 1/2 ounces) granulated sugar",
    "1 ¼\tcups (6 1/4 ounces) all-purpose flour",
    "½\tteaspoon baking soda",
    "½\tteaspoon salt",
    "1\tcup whole milk",
    "8\tounces bittersweet chocolate, chopped fine",
    "¾\tcup (2 1/4 ounces) Dutch-processed cocoa powder",
    "⅔\tcup vegetable oil",
    "4\tlarge eggs",
    "1\tteaspoon vanilla extract",
    "Frosting",
    "1\tpound milk chocolate, chopped",
    "⅔\tcup heavy cream",
    "16\ttablespoons unsalted butter, cut into 16 pieces and softened"
  ],
  "__v": 1
}