{
  "hash": "67038d5bd39f0c7d233416e68866565a7fc0ce48",
  "title": "Geroosterde pompoen met kip, citroengras, pinda’s en rijst",
  "image": "http://www.francescakookt.nl/wp-content/uploads/geroosterde-pompoen-met-kip-jamies-super-food-review-91.jpg",
  "href": "http://www.francescakookt.nl/geroosterde-pompoen-met-kip-uit-jamies-super-food/",
  "extension": "Chrome",
  "firstAdded": "2016-10-21T18:30:11.700000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Bereidingstijd: 30 minuten / Oventijd: 90 minuten",
    "Verwarm de oven voor op 180 graden. Kneus de stengels citroengras en verwijder de buitenste bladeren. Hak de stengels samen met de knoflook, gember, rode peper en lente-uitjes grof en maal fijn in de blender samen met de koriander (houd een paar blaadjes achter voor garnering), kokosroom en flinke scheut azijn en vissaus. Schenk er af en toe een scheutje water bij totdat de laksapasta een schepbare consistentie heeft.",
    "Pak een grote ovenschaal of in mijn geval een braadpan die in de oven kan. Verkruimel de kipbouillonblokjes in de schaal en schenk er 1400ml kokend water bij. Roer totdat de blokjes zijn opgelost en schep de zilvervliesrijst erdoor. Snijd 2 plakken van de dikke kant van de flespompoen en verwijder de zaadjes. Snijd vervolgens de hele pompoen in plakken en smeer samen met de kippendijen in met de helft van de laksapasta (de rest kun je in de vriezer bewaren voor een volgende keer, heerlijk voor soep of om mee te roerbakken). Leg de pompoen en kip daarna in de rijst. Sprenkel er nog wat sesamolie over en zet de schaal of pan 90 minuten in de oven totdat de bovenkant een goudbruin korstje heeft.",
    "Rooster de pinda’s vlak voordat je aan tafel gaat, stamp grof en strooi over het gerecht samen met de blaadjes koriander die je hebt achtergehouden. Serveer met partjes limoen en eventueel nog een frisse salade erbij. Tip: de restjes zijn de volgende dag zalig als lunch"
  ],
  "ingredients": [
    "0",
    "Wat je nodig hebt voor 4 personen",
    "– 3 stengels citroengras",
    "– 3 teentjes knoflook",
    "– 10cm verse gember",
    "– 2 rode Spaanse pepers",
    "– 3 lente-uitjes",
    "– 1 bosje, 60gr, verse koriander",
    "– 80ml kokosroom",
    "– witte wijnazijn",
    "– vissaus",
    "– 2 kipbouillonblokjes",
    "– 300gr zilvervliesrijst",
    "– 1 flespompoen (gewoon met schil)",
    "– 4 kippendijen (met bot en zonder vel)",
    "– sesamolie",
    "– 1el ongezouten pinda’s",
    "– 1 limoen"
  ],
  "__v": 1
}