{
  "hash": "1b5431e9e63fbb07376f8f67a0836a48df50fd08",
  "title": "PASTA CARBONARA WITH BACON AND PEAS",
  "image": "http://www.fortheloveofcooking.net/wp-content/uploads/2014/07/DSC_76351.jpg",
  "href": "http://www.fortheloveofcooking.net/2014/07/pasta-carbonara-with-bacon-and-peas.html",
  "extension": "Chrome",
  "firstAdded": "2016-03-23T20:31:50.104000",
  "users": [
    null
  ],
  "keywords": [
    "spaghetti",
    "instructions",
    "slices",
    "bacon",
    "used",
    "precooked",
    "grease",
    "olive",
    "oil",
    "needed",
    "garlic",
    "egg",
    "parmesan",
    "cheese",
    "frozen",
    "peas",
    "thawed",
    "salt",
    "cracked",
    "pepper",
    "parsley"
  ],
  "directions": [
    "0",
    "Prepare the sauce while the pasta is cooking. It is very important that the pasta is hot when adding the egg and Parmesan mixture, so that the heat of the pasta cooks the raw egg in the sauce.",
    "Bring a large pot of salted water to a boil, add the pasta and cook, per instructions. Drain the pasta well, reserving 1/3 cup of the starchy cooking water to use in the sauce.",
    "While the pasta is cooking, cook the bacon slices until crispy, about 3-5 minutes. Remove the bacon and place on paper towels to drain. Chop into bits. Toss the garlic into the pan with bacon grease. Side Note: My pan only had a teaspoon of grease since my bacon was pre-cooked so I added another teaspoon of olive oil to the pan. Sauté garlic for 45 seconds , stirring constantly.",
    "Add the hot, drained spaghetti to the pan and toss for 2 minutes to coat the strands in the bacon grease/olive oil/garlic. Beat the eggs and Parmesan together in a mixing bowl, stirring well. Remove the pan from the heat and pour the egg/cheese mixture into the pasta, stirring quickly until the eggs thicken, but do not scramble (this is done off the heat to ensure this does not happen.) Thin out the sauce with a bit of the reserved pasta water, until it reaches desired consistency. Add the peas and bacon bits then season with lots of freshly cracked black pepper. Season with sea salt if needed then add fresh parsley, mix well. Place into serving bowl and serve immediately. Enjoy."
  ],
  "ingredients": [
    "0",
    "1/2 lb spaghetti, cooked per instructions",
    "5-6 slices of bacon (I used pre-cooked so there is less grease)",
    "1 tsp olive oil, if needed",
    "2 cloves of garlic, minced",
    "1 egg",
    "1/2 cup Parmesan cheese, finely grated",
    "1/2 cup of frozen peas, thawed",
    "Sea salt and freshly cracked pepper, to taste",
    "2 tbsp fresh parsley, chopped"
  ],
  "__v": 1
}