{
  "hash": "3ebf6109703a9f6577832c9a29ccd0da9cd1f54c",
  "title": "farro avocado breakfast bowl + sumac miso vinaigrette",
  "image": "https://farm1.staticflickr.com/733/20533752369_19f2b57d69_b.jpg",
  "href": "http://localmilkblog.com/2015/08/farro-avocado-breakfast-bowl-sumac-miso-vinaigrette.html",
  "extension": "",
  "firstAdded": "2015-11-11T15:35:42.800000",
  "users": [
    null
  ],
  "keywords": [
    "farro",
    "water",
    "salt",
    "sesame",
    "oil",
    "soft",
    "boiled",
    "eggs",
    "basil",
    "scallions",
    "microgreens",
    "radish",
    "arugula",
    "avocado",
    "extra",
    "firm",
    "tofu",
    "holes",
    "box",
    "grater",
    "white",
    "miso",
    "juice",
    "zest",
    "lemon",
    "tamari",
    "shoyu",
    "sumac"
  ],
  "directions": [
    "0",
    "Rinse the farro well. Cover it with the water, add the salt, and sesame oil, and bring it to a boil. Reduce to a simmer, cover, and cook for 20-30 minutes until tender. Drain and return to the pot.",
    "While the farro cooks make the vinaigrette & boil your eggs. For a perfectly soft boiled egg, bring a small pot of water to a full boil, lower the eggs into it, cook for 6 minutes, submerge in an ice bath until cool to the touch, and then remove and peel. To make the vinaigrette, whisk all the ingredients in a small bowl.",
    "Toss a third of the vinaigrette with the diced avocado, reserve the rest for the farro & tofu.",
    "When the farro is done stir in a third of the vinaigrette, and then heat a large skillet with a splash of oil (I prefer grapeseed), and stir fry the shredded tofu until just warm, about 5 minutes. Stir in the last third of the vinaigrette. Turn off the heat.",
    "To assemble the bowl put the farro in first and then top with the tofu & avocado. Add fresh basil, microgreens, the scallions, and the egg. A few cracks of fresh pepper. A sprinkling of salt if desired. Sriracha never hurt anything."
  ],
  "ingredients": [
    "0",
    "1 cup farro",
    "4 cups water",
    "1/2 tsp salt",
    "1 tsp sesame oil",
    "2 soft boiled eggs, sliced in half",
    "fresh basil",
    "2 scallions, thinly sliced",
    "1/2 cup microgreens (radish, arugula, whatever will do)",
    "1 ripe avocado, diced",
    "5.5 oz (160 g) extra firm tofu, shredded on the large holes of a box grater",
    "2 teaspoons white miso paste",
    "juice and zest of a whole lemon",
    "2 teaspoons tamari or shoyu",
    "1/2 teaspoon toasted sesame oil",
    "1/2 teaspoon sumac"
  ],
  "__v": 1
}