{
  "hash": "5615c9b697320399746400d7b1d7f1a32e303c9d",
  "title": "Pasta and Bean Picnic Salad",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2017/07/2017-07-26-PastaBeanSalad-7.jpg",
  "href": "https://www.simplyrecipes.com/recipes/pasta_and_bean_picnic_salad/",
  "extension": "",
  "firstAdded": "2018-01-27T23:10:33.267000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Cook the pasta: Bring a large pot of water with 2 teaspoons of the salt to a boil. Add the pasta and cook, stirring occasionally, for 8 minutes or until the pasta is tender.",
    "Drain but do not rinse; shake the colander to remove excess water.",
    "2 Combine the pasta and beans: Transfer the pasta to a large bowl and sprinkle with 3 tablespoons of the olive oil. Shake the bowl to distribute the oil.",
    "Add the rinsed beans and lemon zest to the hot pasta. Stir the salad gently. Leave to cool.",
    "3 Make the dressing: In a bowl, whisk the vinegar, mustard, remaining 1 teaspoon salt, and pepper. Slowly whisk in the remaining 4 tablespoons oil until it is all added.",
    "Taste for seasoning and add more salt and pepper, if you like.",
    "4 Finish mixing the salad: Pour the dressing over the pasta and beans and stir. Add the tomatoes, celery, onion, and parsley to the pasta mixture and stir gently but thoroughly.",
    "Taste for seasoning and add more salt and pepper, if you like. You can also squeeze some lemon juice over the top if it needs a touch more brightness."
  ],
  "ingredients": [
    "0",
    "3 teaspoons salt",
    "1 pound small-shaped pasta (curly, twisted, corkscrew, shells, or bow-ties)",
    "7 tablespoons olive oil, divided",
    "2 cans (15-to 16-ounces each) white beans, like Great Northern, navy, or cannellini, drained and rinsed",
    "Zest of 1 lemon",
    "2 tablespoons apple cider vinegar",
    "1 heaping teaspoon Dijon mustard",
    "1/4 teaspoon ground black pepper",
    "1 pint mixed cherry or grape tomatoes, sliced or cut into quarters",
    "2 stalks celery, halved lengthwise and very thinly sliced",
    "1/2 red onion, very thinly sliced",
    "1/4 cup chopped fresh parsley"
  ],
  "__v": 1
}