{
  "__v": 2,
  "directions": [
    "0",
    "In a small food processor or blender, add all of the ingredients for the pesto sauce except for the oil and blend/pulse quickly until ingredients are roughly chopped. Add the oil (you can do so in a steady stream if using a food processor or add oil all at once if using a blender), and blend until desired consistency is achieved. If desired, add more oil to get a thinner consistency. Set aside until ready to use.",
    "1",
    "Preheat oven to 415 degrees F.",
    "Prepare Stephanie’s No-Knead Pizza dough or pizza dough of choice.",
    "While the dough is rising, you can prepare the topping ingredients.",
    "Lay the pancetta slices on a large baking sheet and bake for 15 to 20 minutes, or until browned but not too crispy. Remove from the oven and allow pancetta to cool. Chop and set aside.",
    "In order to peel the asparagus into ribbons, hold firmly by the woody stalk. Using a vegetable peeler (a potato peeler works, too), peel long strands of the asparagus into a bowl. Once the stalk becomes difficult to peel, you can chop what is left and use it too. Repeat for the whole pound of asparagus. Set aside until ready to use.",
    "Dust a large baking sheet with cornmeal or flour. Lay the dough on the baking sheet and use your hands to press it into the sheet, forming any shape of pizza you wish (you can also roll out the dough if you have a rolling pin).",
    "Bake in the oven for 5 to 7 minutes without ingredients.",
    "Remove from the oven and spread ⅓ cup of pesto sauce (or desired amount) over the crust. Sprinkle the mozzarella cheese, then add all of the shaved asparagus, edamame, and chopped pancetta.",
    "Bake for 20 to 25 minutes until cheese has melted and crust has crisped up.",
    "Remove pizza from the oven and allow it to cool about 10 minutes. Serve large slices and enjoy!",
    "Note: you will end up with more pesto sauce than you need for the pizza. You can use it for your favorite pastas or use for dipping."
  ],
  "firstAdded": "2014-08-25T12:34:26.148000",
  "hash": "1adf54591afca5dcefe3a78676b635113ac9e99f",
  "href": "http://www.girlversusdough.com/2014/05/08/asparagus-and-pancetta-pesto-pizza/",
  "image": "https://farm3.staticflickr.com/2906/14122714594_cd1d4ae3d2_o.jpg",
  "ingredients": [
    "0",
    "1 pound pizza dough",
    "1 pound asparagus, shaved",
    "⅓ cup shelled edamame (thawed if using frozen)",
    "2 ounces thinly sliced pancetta",
    "⅓ cup pesto sauce (recipe below)",
    "1-1/2 cups mozzarella cheese, grated",
    "1",
    "1 bunch fresh basil, chopped (2.5 cups lightly packed)",
    "¼ cup pine nuts",
    "⅓ cup parmesan cheese",
    "⅔ cup olive oil",
    "2 tablespoons fresh lemon juice",
    "2 cloves garlic, minced",
    "½ teaspoon kosher salt, to taste"
  ],
  "keywords": [
    "pizza",
    "dough",
    "asparagus",
    "shaved",
    "shelled",
    "edamame",
    "thawed",
    "using",
    "frozen",
    "pancetta",
    "pesto",
    "recipe",
    "mozzarella",
    "cheese",
    "bunch",
    "basil",
    "lightly",
    "pine",
    "nuts",
    "parmesan",
    "olive",
    "oil",
    "lemon",
    "juice",
    "garlic",
    "kosher",
    "salt"
  ],
  "title": "Asparagus and Pancetta Pesto Pizza",
  "users": [
    null,
    null
  ]
}