{
  "hash": "1827c7cf913f2602d80de9b554d4c7863646773b",
  "title": "Paleo Pumpkin Raisin Cookies",
  "image": "http://empowered1.empoweredsustena.netdna-cdn.com/wp-content/uploads/2014/10/paleo-pumpkin-raisin-cookies-2.jpg",
  "href": "http://empoweredsustenance.com/paleo-pumpkin-raisin-cookies/",
  "extension": "Chrome",
  "firstAdded": "2016-01-12T15:18:59.908000",
  "users": [
    null
  ],
  "keywords": [
    "coconut",
    "flour",
    "available",
    "tbs",
    "oil",
    "eggs",
    "pumpkin",
    "puree",
    "raw",
    "honey",
    "maple",
    "syrup",
    "baking",
    "soda",
    "apple",
    "cider",
    "vinegar",
    "unrefined",
    "salt",
    "cinnamon",
    "nutmeg",
    "vanilla",
    "organic",
    "raisins",
    "butter",
    "recommend",
    "milk"
  ],
  "directions": [
    "0",
    "Preheat the oven to 350. To measure the coconut flour, fluff flour with a fork then scoop the measuring cup and level. Don't pack the flour, or the cookies will be too heavy.",
    "Have all ingredients at room temperature and then stir together until well combined. If ingredients are not at room temperature, the batter will not combine because the coconut oil will clump. You can melt the coconut oil to help it mix together well.",
    "Flatten balls of dough on a parchment paper lined baking sheet. I recommend making them smaller than the cookies in the picture - the bigger the cookies, the more fragile. I suggest using 1 Tbs. of dough per cookie and just flattening it slightly.",
    "Bake for 18-20 minutes, until golden around the edges. Cool cookies completely before frosting.",
    "To make the frosting, have the ingredients at room temperature. Stir together until creamy. You may need to add another teaspoon or more of coconut milk for a spreadable frosting. Frost cookies before serving. Cookies and frosting should be stored separately. These cookies freeze relatively well."
  ],
  "ingredients": [
    "0",
    "2/3 cup coconut flour, available here",
    "1/4 cup + 2 Tbs. coconut oil",
    "2 eggs",
    "1/2 cup pumpkin puree",
    "1/4 cup raw honey or pure maple syrup",
    "1/2 tsp. baking soda",
    "1/2 tsp. raw apple cider vinegar",
    "Pinch of unrefined salt",
    "1/2 tsp. ground cinnamon",
    "Pinch of freshly grated nutmeg",
    "1/2 tsp. vanilla extract",
    "1/2 cup organic raisins",
    "1/4 cup coconut butter (not coconut oil), I recommend this one",
    "1/4 cup raw honey or pure maple syrup",
    "2 tsp. coconut milk or milk of choice",
    "1/2 tsp. vanilla extract"
  ],
  "__v": 1
}