{
  "hash": "6ecec4e4400a629972e0181d47dec0301f78c875",
  "title": "SESAME BEEF AND CABBAGE STIR-FRY",
  "image": "https://www.gimmesomeoven.com/wp-content/uploads/2019/01/Easy-Beef-Cabbage-Stir-Fry-Recipe-6-1-360x360.jpg",
  "href": "https://www.gimmesomeoven.com/sesame-beef-cabbage-stir-fry/",
  "extension": "Chrome",
  "firstAdded": "2019-02-07T22:04:22.908000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS:",
    "Whisk all sauce ingredients together in a small bowl (or shake them together in a mason jar) until combined. Set aside.",
    "Season the steak with salt and pepper. Heat 1 tablespoon oil in a wok or large sauté pan over high heat. Add the steak and sauté for 4-5 minutes, tossing occasionally, until cooked through. Transfer steak to a clean plate and set aside.",
    "Add the remaining 1 tablespoon oil to the pan, along with the onion. Sauté for 4 minutes, stirring occasionally. Add green cabbage, garlic and carrots, and stir to combine. Continue cooking for 2-4 more minutes, or until the cabbage has wilted to your desired level of crispness.",
    "Add the cooked steak and sauce to the veggies, and toss to combine for about 30 seconds, or until the sauce thickens up. Taste and season with additional salt and pepper if needed.",
    "Remove from heat and serve immediately, garnished with your desired toppings. Or transfer to sealed containers and refrigerate for up to 4 days."
  ],
  "ingredients": [
    "0",
    "1 batch Sesame Ginger Sauce (see below)",
    "1 pound flank steak, thinly sliced and cut into bite-sized pieces",
    "sea salt and freshly-cracked black pepper",
    "2 tablespoons avocado oil, divided",
    "1 large white onion, peeled and thinly sliced",
    "1 small green cabbage, roughly chopped into bite-sized pieces",
    "4 cloves garlic, peeled and thinly sliced",
    "2/3 cup shredded carrots",
    "optional toppings: thinly-sliced green onions, toasted sesame seeds"
  ],
  "__v": 1
}