{
  "hash": "b8660644152f83b77d741eeb214da8e81ca0b70f",
  "title": "Chickpeas and Artichokes “Bliss in a Dish”",
  "image": "http://plantpoweredkitchen.com/wp-content/uploads/2013/02/chickpeaartichokeblisscloseup2.jpg",
  "href": "http://plantpoweredkitchen.com/chickpea-artichoke-bliss-dish-vegan/",
  "extension": "Chrome",
  "firstAdded": "2016-11-14T22:35:56.184000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 400°F. Use 1 teaspoon of the olive oil to oil a large casserole dish (about 8 by 12 inches). If you omit the oil, some of the ingredients may get a little sticky in the pan, but no biggie! Place the potatoes in a saucepan, cover with water, and bring to a boil. Lower the heat to medium-low and boil for 15 to 20 minutes, or until fork tender (see note). When potatoes are ready, drain well and add to the prepared dish along with the other ingredients, except the vinegar and the fresh basil. Toss the mixture well, cover the dish with foil, and bake for 40 minutes (stirring about halfway through the baking process), until the potatoes are fully tender and the other vegetables have heated through and somewhat softened. Add the vinegar, toss again, and bake for another 10 to 15 minutes uncovered. Remove from the oven, sprinkle with the fresh basil, and season to taste with salt and pepper as desired. Serve on its own, with bread, or over quinoa, brown rice, or pasta, topped with a quick avocado sauce or mash, or ‘Basil Lemon Pistou’ (from LTEV). Serves 4-5.",
    "If This Apron Could Talk: If you already have the ingredients prepped and are waiting on the potatoes, go ahead and starting baking the casserole. You can add the potatoes to it once they’re ready. This makes a fairly large casserole, enough for a meal one night for 3 to 4 people, and leftovers for another night (it’s also good for a potluck)!",
    "Savvy Subs and Adds: Another delicious variation on this dish is to omit the potatoes and use 1 to 2 fennel bulbs instead. No parboiling step involved; simply toss the fennel with all the other ingredients as directed and bake for the same amount of time. Also try subbing cannellini beans for chickpeas. They are soft and tender and make a nice variation – just try not to break up too much with mixing."
  ],
  "ingredients": [
    "0",
    "2 ½ – 3 cups (about ¾ – 1 lb) red or Yukon gold potatoes, cut in small cubes (about 1” thick) (see note)",
    "1 tsp olive oil (to wipe around baking dish, optional)",
    "3 – 3 ½ cups chickpeas (about 2 cans, rinsed and drained; I have subbed cannellini beans for these photos, see note)",
    "3 cups frozen artichokes (can thaw beforehand, or use from frozen)",
    "4 medium-large cloves garlic, minced or grated",
    "1 tbsp olive oil (optional, can omit for oil-free)",
    "3 tbsp water",
    "1/2 cup red bell pepper, chopped",
    "1/3 – ½ cup pitted kalamata olives, sliced in half",
    "1 cup chopped tomatoes",
    "3-4 tbsp sultana or other raisins",
    "1 tsp dried oregano",
    "1 tsp dried basil",
    "½ tsp dried rosemary",
    "½ tsp sea salt",
    "Freshly ground black pepper to taste",
    "1 – 1½ tbsp balsamic vinegar",
    "1/3 – 1/2 cup basil leaves, julienned (optional, can also use ¼ cup chopped fresh flat-leaf parsley)"
  ],
  "__v": 1
}