{
  "hash": "98dc9773037ca3fbc4fd46c166436d9ff8fef422",
  "title": "Пахлава",
  "image": "http://www.povarenok.ru/images/recipes/51/5146/514615.jpg",
  "href": "http://www.povarenok.ru/recipes/show/63967/",
  "extension": "Chrome",
  "firstAdded": "2016-09-01T10:37:05.184000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "В муке сделать лунку и ножом мелко порезать туда слив.масло или маргарин (комнатной температуры).",
    "Рубить тесто ножом до образования мучной крошки.",
    "В сметане погасить 1 ч.л. соды без горки. В мучной смеси еще раз сделать лунку и разбить туда 3 желтка (только желтки, белки дальше будут нужны) + сметана с содой.",
    "Все перемешать и вымесить тесто руками. Тесто должно быть крутое и мягкое одновременно. Разделить его на 3 части (1 чуть больше остальных) и убрать в холод на 0,5-1 час.",
    "Пока наше тесто отдыхает и крепнет, подготовим начинку. Из орехов выбрать 40 целых половинок, как на картинке. Если половинок нет, можно взять ровные четвертинки и сложить из них.",
    "Остальные орехи (около 300 гр без половинок) порубить ножом, можно измельчить в мясорубке или блендере, но я не советую, т.к. в этом случае орехи станут влажные, и вкус немного изменится. Мы пробовали по-разному, но единодушно пришли к варианту рубленых орехов.",
    "Орехи перемешать с сахаром. А белки слегка взбить венчиком, НЕ надо доводить их до состояния безе.",
    "Достаем по одному шарику, раскатываем толщиной 0,5 см, если у вас стандартный противень, то это как раз на него. Укладываем пласт теста с небольшим бортиком, смазываем его белком и равномерно распределяем половину начинки.",
    "Накрываем вторым пластом теста и все повторяем еще раз. Когда будете укладывать очередной слой, слегка прихлопывайте по нему, чтобы вышел воздух. Теперь раскатаем больший из наших кусочков - это верхний слой. Накрыть им всю пахлаву, хорошенько скрепить края и все защипы завернуть под пахлаву. Получается вот такой гладкиий пирог.",
    "Смажьте пахлаву желтком. Надрежьте всю пахлаву. (Не разрезайте ее до конца, максимум верхний слой, но лучше просто наметить контур) на будущие кусочки. В каждый кусочек положите по половинке ореха или 2 четвертинки.",
    "Ставим нашу пахлаву в ХОЛОДНУЮ ДУХОВКУ. Выпекаем около 30 минут при 200-220 градусах. До золотистой корочки. Если во время выпекания пахлава начала вздуваться, то прорежьте ее по намеченным линиям.",
    "Достать пахлаву и обильно смазать медом, особенно места разрезов и орешки. Убрать в духовку еще на 5 минут. Достать и остудить. Холодную порезать на кусочки и наслаждаться дивным вкусом.",
    "Приятного аппетита =)"
  ],
  "ingredients": [
    "0",
    "Ингредиенты для \"Пахлава\":",
    "Мука\t— 4 стак.",
    "Масло сливочное\t(или маргарин) — 300 г",
    "Яйцо куриное\t(3 желтка - тесто, 4 белка - начинка, 1 желток для смазки) — 4 шт",
    "Сметана\t— 300 г",
    "Сахар\t— 2 стак.",
    "Орехи грецкие\t— 300-400 г",
    "Сода\t— 1 ч. л.",
    "Мед\t(натуральный) — 3-4 ст. л."
  ],
  "__v": 1
}