{
  "hash": "593cf24f11540ce52d08a072a056a70ff6e5358a",
  "title": "Chef John's Barbecue Chicken",
  "image": "http://images.media-allrecipes.com/userphotos/720x405/3672266.jpg",
  "href": "http://allrecipes.com/recipe/236990/chef-johns-barbecue-chicken/?internalSource=staff%20pick&referringContentType=home%20page&clickId=cardslot%207",
  "extension": "Chrome",
  "firstAdded": "2016-08-20T21:57:34.122000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cut 1/2-inch deep slashes in the skin-side of each chicken half; 2 cuts in each breast, 2 in the thigh, and 1 on the leg; remove wing tips.",
    "Whisk rice vinegar, barbeque sauce, and garlic together in large bowl. Place chicken in bowl and turn to coat chicken in the marinade. Arrange chicken halves, cut-side down, in the bottom of the marinade bowl, cover the bowl with plastic wrap, and refrigerate for 1 hour.",
    "Preheat an outdoor grill for medium-high heat and lightly oil the grate.",
    "Remove chicken from bowl, pat chicken dry with paper towels, and discard marinade. Place chicken halves, skin-side up, on a plate and season with salt, pepper, paprika, onion powder, and cayenne pepper.",
    "Cook chicken, skin-side down, on the preheated grill for 3 to 4 minutes. Turn chicken over, close the lid of the grill, and cook, basting with remaining barbeque sauce ever 6 minutes, until no longer pink at the bone and the juices run clear, about 35 minutes. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 165 degrees F (74 degrees C)."
  ],
  "ingredients": [
    "0",
    "1 whole chicken, into halves",
    "1/4 cup rice vinegar",
    "2 tablespoons barbeque sauce",
    "2 cloves garlic, crushed",
    "1 tablespoon salt",
    "1",
    "1 teaspoon ground black pepper",
    "1 teaspoon paprika",
    "1 teaspoon onion powder",
    "1/2 teaspoon cayenne pepper",
    "1/2 cup barbeque sauce, or as needed"
  ],
  "__v": 1
}