{
  "hash": "572dae3a7178cc5764b41bd027ecf3186154f8c9",
  "title": "Easy Naan Bread",
  "image": "http://www.bbcgoodfood.com/sites/all/themes/bbcw_goodfood/images/dummy-content/memberRecipeNoImage.png",
  "href": "http://www.bbcgoodfood.com/recipes/418615/easy-naan-bread",
  "firstAdded": "2015-02-07T10:03:13.148000",
  "users": [
    null
  ],
  "keywords": [
    "plain",
    "alternatively",
    "use",
    "selfraising",
    "flour",
    "sugar",
    "omitted",
    "yeast",
    "water",
    "ghee",
    "oil",
    "butter",
    "prefer",
    "vegetarian",
    "salt",
    "unsalted",
    "poppy",
    "seeds"
  ],
  "directions": [
    "0",
    "If you use plain flour: Mix the sugar and yeast with the warm water and rest for about 10 minutes. (Can be omitted if you use self-raising flour).",
    "Place the flour in a large mixing bowl and add the yeast mixture (for plain flour) or the water (for self-raising flour). Add the ghee (or oil/butter) and salt and mix well. Add some extra water or flour as required. Tip: for a nice variation, add garlic, finely chopped coriander leaves, and sultanas to the dough.",
    "Knead for about 5 minutes on a smooth working surface until you have a smooth dough. Place the dough back in the bowl, cover, and leave to rise for 1-1.5 hours in a warm place.",
    "To finish off the bread, begin by preheating the oven grill for some 10 minutes until it is red hot. Knead the dough for another 2 minutes and either divide into 4-6 equal portions, or keep in one piece. In any case, roll out to a thickness of about 1 cm (0.5 in). lace the dough on a suitable greased oven plate and grill for 7-10 minutes, turning once or twice. Each time, brush the surface of the bread with some butter and sprinkle some poppy seeds over the bread. Tip: you can also sprinkle some sugar in addition to, or instead of, the poppy seeds. Serve warm"
  ],
  "ingredients": [
    "0",
    "200 g plain flour (alternatively: use self-raising flour)",
    "1 tsp sugar (can be omitted if you use self-raising flour)",
    "1 tsp fresh yeast (can be omitted if you use self-raising flour)",
    "150 ml warm water",
    "1 tbsp ghee (note: use vegetable oil or butter if you prefer vegetarian)",
    "1 tsp salt",
    "50 g unsalted butter",
    "(1 tsp poppy seeds)"
  ],
  "__v": 1
}