{
  "hash": "81158d7deb95d626de775d4bf6abcee5a808fc10",
  "title": "parsnip & pear soup",
  "image": "https://alexandracooks.com/wp-content/uploads/2014/10/14918439114_44e1a256e6_o.jpg",
  "href": "https://alexandracooks.com/2014/10/15/parsnip-pear-soup-also-how-to-be-a-bettermore-efficient-soup-maker-this-winter/",
  "extension": "Chrome",
  "firstAdded": "2019-01-02T23:59:53.874000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium stockpot, melt the butter over medium-low heat, add the shallots or onions, a pinch of salt, and sweat for 2 to 3 minutes. Add the parsnip, celery root (if using), minced thyme, and pinch of salt and continue to sweat for 5 to 6 minutes. Add the pear, and continue cooking for 4 to 5 minutes. Add the white wine, increase the heat to high, and reduce by half — to about 1 cup of liquid. Note: It is will be really hard to tell if the wine has reduced by half — just simmer for about 5 minutes.",
    "Add the stock and a pinch of salt, bring to a boil, reduce to a simmer and cook for 45 minutes. Remove the soup from the heat, and stir in the half and half or cream.",
    "Transfer the soup to a blender or use an immersion blender, and purée on high speed until smooth. Taste. Add more salt if necessary.",
    "To serve, season to taste with vinegar (just a few drops), drizzle with truffle oil (if using), and black pepper if you wish. Serve with lots of crusty bread."
  ],
  "ingredients": [
    "0",
    "2 tbs. unsalted butter",
    "¼ cup shallots or onions, small diced (I used more like 2 cups of diced onions)",
    "kosher salt",
    "2 cups parsnips, peeled and roughly chopped (2 to 3 parsnips depending on size)",
    "½ cup celery root, optional (didn’t have and didn’t feel like buying)",
    "fresh thyme leaves, minced, about a tablespoon or so (original recipe calls for rosemary)",
    "1 to 2 cups pear, peeled and roughly chopped (1 to 2 pears)",
    "1 cup dry white wine",
    "5 cups homemade chicken stock",
    "½ cup half-and-half or cream",
    "Pear vinegar (I used white balsamic vinegar)",
    "truffle oil (optional, for drizzling, so good)",
    "Pepper, optional",
    "bread, this one or this one is nice"
  ],
  "__v": 1
}