{
  "hash": "935a37b724fdd20f603c55a027acc3d3c0672db4",
  "title": "Salted Chocolate Caramel Tart",
  "image": "https://www.browneyedbaker.com/wp-content/uploads/2015/08/salted-chocolate-caramel-tart-46-600-600x848.jpg",
  "href": "https://www.browneyedbaker.com/salted-chocolate-caramel-tart/",
  "extension": "Firefox",
  "firstAdded": "2017-11-19T06:49:04.329000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the Crust: Place the butter and sugar in a food processor and process until pale in color, about 10 seconds. Add the cocoa powder, flour, egg and vanilla and pulse until a soft dough forms (about 10 1-second pulses). Turn out into a round 9-inch tart pan and press into the bottom and up sides. Refrigerate until firm, at least 30 minutes.",
    "Preheat oven to 350 degrees F. Prick the dough with a fork and bake for 15 minutes, or until the dough is baked through. Set aside.",
    "Make the Caramel Filling: Place the cream and butter in a small saucepan over low heat and warm until the butter has melted; set aside.",
    "In a medium saucepan, combine the sugar and water over low heat, stirring until the sugar has dissolved. Increase the heat to high and boil, without stirring, until dark golden and the mixture reaches 340 degrees F on a thermometer. Remove from the heat and slowly whisk in the cream mixture (be cautious, as it will bubble up). Return the saucepan to low heat and cook, stirring constantly, for 5 minutes or until thickened. Stir in the fleur de sel and pour into the pastry shell. Refrigerate until set, at least 30 minutes.",
    "Make the Chocolate Glaze: Place the chopped chocolate in a medium bowl. Heat the cream in a small saucepan over medium heat until simmering. Remove from the heat and pour over the chocolate. Let sit for 2 minutes, then stir until the chocolate is completely melted and smooth. Pour the chocolate over the caramel layer. Refrigerate until set, at least 15 minutes. Sprinkle with additional fleur de sel before serving. Leftovers should be stored, covered, in the refrigerator for up to 5 days."
  ],
  "ingredients": [
    "0",
    "For the Crust:",
    "10 tablespoons unsalted butter, softened",
    "⅔ cup powdered sugar",
    "⅓ cup Dutch-process cocoa powder",
    "1½ cups all-purpose flour",
    "2 egg yolks",
    "1 teaspoon vanilla extract",
    "For the Caramel Filling:",
    "¾ cup heavy cream",
    "6 tablespoons unsalted butter",
    "1½ cups superfine sugar",
    "½ cup water",
    "½ teaspoon fleur de sel (or other flaky sea salt)",
    "For the Chocolate Glaze:",
    "½ cup heavy cream",
    "5 ounces dark chocolate, finely chopped"
  ],
  "__v": 1
}