{
  "hash": "e7009c05c4d4055b5a21e6960acf7030d8c1bb16",
  "title": "Tarte Tatin",
  "image": "http://www.recipe30.com/wp-content/uploads/2016/10/tarte-tatin-848x477.jpg",
  "href": "http://www.recipe30.com/tarte-tatin-recipe.html/",
  "extension": "Chrome",
  "firstAdded": "2017-04-07T20:38:01.908000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Remove butter from fridge and bring to room temperature",
    "In a mixing bowl, add the flour.",
    "Add the butter and combine ingredients using clean hands until you reach a sandy texture.",
    "Add the sugar.",
    "Add the egg.",
    "Add the salt.",
    "Mix ingredients with a spatula, once dry finish with your hands. Once there’s nothing left on the side of the bowl, knead and fold the dough no more than 30 seconds.",
    "Stretch out some cling film on your bench",
    ".",
    "Shape the dough into a flat brick, wrap in plastic and refrigerate for two hours or more.",
    "After two hours, remove from fridge and let sit approx. 10 minutes.",
    "Peel and core the apples then cut into quarters.",
    "In a hot clean frying pan (not greasy at all) or an oven proof deep cake dish, add the caramel sugar with a little water.",
    "Add butter to caramel and stir until melted and combined.",
    "Arrange your apple quarters in a circle, vertically enough to cover the whole pan from the outside in.",
    "Place frying pan back on low heat and cook apples for 20 to 25 minutes.",
    "Flour your bench and roll out your sweet paste approx 1/4 of an inch.",
    "Place a circular bowl slightly larger than your pan and cut pastry with a knife to end up with a perfect circle. Remove the trimmings, freeze and use again for something else.",
    "Using your rolling pin, roll your pastry around the pin to make it easier to unroll.",
    "Unroll your pastry over the pan and push in the edges a little.",
    "Bake in oven at 160ºC – 425ºF for 30 minutes (or until pastry is nicely cooked).",
    "Once cooked, place a board or a plate on top of your pan, and using both hands, flip over so the tart is upside down.",
    "Let cool before serving or refrigerate. Remember to always serve warm."
  ],
  "ingredients": [
    "0",
    "For the sweet paste",
    "For the caramel"
  ],
  "__v": 1
}