{
  "hash": "189198eaff33cc8755d3d4b6543fd3d68fc9dc9b",
  "title": "Eggplant Caviar",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2015/09/eggplant-caviar-horiz-a-1500.jpg",
  "href": "https://www.simplyrecipes.com/recipes/eggplant_caviar/",
  "extension": "",
  "firstAdded": "2018-01-28T20:20:26.962000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Roast (or grill) the eggplants: Preheat oven to 400°F (205°C). (Alternatively you can grill the eggplant, in which case, prepare the grill for medium high direct heat.)",
    "Slice the eggplants in half lengthwise. Score the cut side of the eggplants in a crosshatch pattern with a sharp knife, in lines about an inch apart. Poke the skin sides of the eggplants with the tines of a fork all over.",
    "Line a sheet pan with foil. Spread olive oil over the bottom of the sheet pan, and sprinkle evenly with salt. Place the eggplants cut side down on the foil lined pan. Place in oven and cook for 35 minutes, or until completely cooked through and very soft.",
    "If grilling, cut the eggplants in half lengthwise, and poke the skin sides with the tines of a fork. Brush the cut side with olive oil and sprinkle with salt. Grill cut side down until lightly browned and cooked all the way through. If the eggplants brown too quickly, turn them over and finish the cooking on the skin side.",
    "Once the eggplants have cooled to the touch, peel off the tough outer skin and discard.",
    "2 Roast the red bell pepper: While the eggplant is roasting in step 1, roast the red bell pepper. There are three ways in which you can do this. Coat the bell pepper lightly with olive oil first.",
    "You can put the bell pepper under a broiler in a broiler pan and broil on all sides until the skin is completely blackened. OR you can place the bell pepper directly on the grates of a gas stove and roast over the open flame, until blackened on all sides. OR you can grill on high direct heat, turning, until blackened on all sides.",
    "Once blackened, place the bell pepper in a bowl and cover with a plate to steam for several minutes. Once the bell pepper has cooled to the touch, peel off the charred outer skin. Remove the stem and seeds.",
    "3 Purée garlic, roasted eggplant and bell pepper: Place garlic, peeled eggplant, peeled roasted bell pepper in a food processor and pulse until smooth.",
    "4 Mix with oil, vinegar, salt, basil, pepper: Transfer the eggplant mixture from the food processor into a large bowl. Whisk in the olive oil, balsamic vinegar, salt, minced basil, and pepper.",
    "Serve with crackers, pita chips, crostini toasts, or for gluten-free option celery or cucumber sticks."
  ],
  "ingredients": [
    "0",
    "2 medium globe eggplants (about 2 pounds or 900 g total)",
    "2 Tbsp olive oil",
    "1 teaspoon kosher salt",
    "1 medium red bell pepper",
    "3 cloves garlic",
    "3 Tbsp high quality olive oil",
    "1 teaspoon balsamic vinegar",
    "1/2 teaspoon kosher salt",
    "2 Tbsp minced fresh basil",
    "1/8 teaspoon freshly ground black pepper"
  ],
  "__v": 1
}