{
  "hash": "ecad0dd026f1f69a044a9a2c39ae8b94d162e983",
  "title": "Gingered Carrots with Mahi Mahi",
  "image": "",
  "href": "http://everydaypaleo.com/gingered-carrots-with-mahi-mahi/",
  "extension": "Chrome",
  "firstAdded": "2016-03-15T23:03:10.947000",
  "users": [
    null
  ],
  "keywords": [
    "carrots",
    "grass",
    "fed",
    "butter",
    "coconut",
    "oil",
    "green",
    "onions",
    "ginger",
    "garlic",
    "mahi",
    "pieces",
    "white",
    "fish",
    "lemon",
    "juice",
    "chicken",
    "broth",
    "aminos",
    "wheat",
    "free",
    "tamari",
    "black",
    "pepper",
    "salt"
  ],
  "directions": [
    "0",
    "Saute the carrots in 2 tablespoons of the butter or coconut oil over medium heat for 5-7 minutes or until the carrots start to brown. While the carrots are cooking, mix the chicken broth, coconut aminos or tamari and black pepper together in a bowl and set aside. Add the green onions to the carrots and cook for another minute. Add the lemon juice, ginger, and garlic to the pan and sauté just until the veggies are coated with the ginger and garlic. Sprinkle with a little sea salt, stir again, and remove the carrot mixture from the pan and set aside. Add the remaining tablespoon of butter or coconut oil to the same pan and melt over medium heat. Add the fish pieces and cook for 1 minute on each side, making sure that your pan is nice and hot so that the fish sear and turn golden brown on each side. Now, pour the chicken broth mixture that you made earlier over the fish, cover and cook for another 1 – 2 minutes or until the fish is tender and flakes apart easily. Do not overcook!! Serve the fish over the gingered carrots and be ready to fall in love…. Serves 2-3 adults. I recommend doubling this recipe!!",
    "Enjoy!!"
  ],
  "ingredients": [
    "0",
    "4 carrots, sliced",
    "3 tablespoons grass fed butter or coconut oil",
    "5 green onions, diced",
    "½ teaspoon fresh grated ginger",
    "1 teaspoon crushed garlic",
    "1 pound of mahi mahi pieces or other white fish of your choice",
    "1 tablespoon fresh lemon juice",
    "½ cup chicken broth",
    "1 tablespoon coconut aminos or 1/2 teaspoon of wheat free tamari",
    "Fresh ground black pepper and sea salt to taste"
  ],
  "__v": 1
}