{
  "hash": "1a683708825df1467a3c82debf05a87160c04fe6",
  "title": "CHICKEN PICCATA OVER ZUCCHINI NOODLES",
  "image": "https://www.kimscravings.com/wp-content/uploads/2016/05/024resized.jpg",
  "href": "https://www.kimscravings.com/chicken-piccata-over-zucchini-noodles/",
  "extension": "Chrome",
  "firstAdded": "2017-12-31T04:41:58.111000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Using a spiral vegetable slicer or a vegetable peeler, spiralize or cut zucchini lengthwise into long, thin strands or strips. If slicing, stop when you reach the seeds in the middle (seeds make the noodles fall apart). Place the zucchini “noodles” in a colander and toss with salt. Let drain for 15 to 30 minutes, then gently squeeze to remove any excess water.",
    "Meanwhile, add ½ cup flour to a shallow bowl and season the chicken on both sides with salt and pepper.",
    "Dredge the cutlets in flour shaking off any excess as you go. Transfer to a plate.",
    "In a large 12-inch skillet, heat 1 tablespoon of olive oil and 1 tablespoon of butter over medium-low heat. Add the chicken and brown on both sides, about 3 minutes per side. Transfer the chicken to a plate and cover with foil to keep warm.",
    "While the chicken is cooking, prep the rest of your ingredients. Dice shallots, mince or crush garlic, open white wine, rinse capers, chop parsley and slice lemons.",
    "To make the pan sauce, reduce the heat to low. Add 1 teaspoon of oil to the pan. Saute shallots until soft, about 1 minute and add garlic and cook until fragrant, about 30 seconds.",
    "Add the wine and bring to a boil, scraping up any brown bits stuck to the bottom of the pan. Reduce the liquid by half.",
    "Add the chicken broth and bring to a boil. To thicken the sauce, add cornstarch/water mixture, whisking constantly, until the sauce is slightly thickened.",
    "Reduce the heat to a simmer and add lemon slices and stir in butter.",
    "Add the juice of ¼ lemon and sprinkle with capers.",
    "Return the chicken and any accumulated juices to the pan.",
    "Taste the dish; season with extra lemon juice, salt and pepper if desired.",
    "To serve, transfer the chicken to a serving platter and spoon the sauce over the top.",
    "Garnish with lemon slices and fresh parsley.",
    "Use the same pan to heat zucchini (or alternatively heat zucchini in a separate skillet while you are making pan sauce), stir constantly for about 5 minutes and of desired softness. Serve chicken over zucchini noodles and with a glass of Chardonnay!"
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "5 medium zucchini, trimmed (about 2 pounds)",
    "½ cup flour (use gluten free flour, if needed)",
    "1 lb. thinly sliced chicken breast (about 4)",
    "salt and pepper",
    "1 tablespoon + 1 teaspoon extra virgin olive oil, divided",
    "1 tablespoon butter",
    "¼ cup shallots, diced",
    "2 garlic cloves, finely minced or crushed with a garlic press",
    "½ cup Sequoia Grove Chardonnay or other white wine",
    "1½ cups low-sodium chicken broth",
    "1 teaspoon cornstarch combined with 1 tablespoon water (optional to thicken sauce)",
    "1 large lemon, sliced (leave about ¼ of the lemon unsliced, for juice)",
    "¼ cup jarred capers, drained",
    "Optional garnish: lemon slices, 3 tbsp. roughly chopped parsley"
  ],
  "__v": 1
}