{
  "hash": "7418370720a28f0e69eec2f2a0448098952eae78",
  "title": "Red Lentil and Spinach Tikka Masala",
  "image": "https://4.bp.blogspot.com/-Y3Me8HU9Ll4/WErG5MBI-jI/AAAAAAAAESE/ffQXzUiE_0AtOToAhyZAunJnfJ6_PMiXQCLcB/s1600/%2528Vegan%2529-Red-Lentil-and-Spinach-Tikka-Masala-%25283%2529.jpg",
  "href": "http://www.theironyou.com/2016/12/vegan-red-lentil-and-spinach-tikka.html?m=1",
  "extension": "",
  "firstAdded": "2017-07-13T23:09:34.467000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat olive oil in a large saucepan (or skillet) over medium-high heat.",
    "Add onions, a pinch of salt, and sauté until translucent, about 6 minutes.",
    "Add garlic and sauté for 1 more minute. Add ginger and spices and sauté for 30 seconds.",
    "Add diced tomatoes and coconut milk and give a good stir.",
    "Bring to a simmer, cover, and cook for 5 minutes.",
    "Remove from the heat and puree with the help of an immersion blender (alternatively you can puree in batches in a blender — be careful not to splatter the hot liquid onto yourself though.)",
    "Add lentils, and salt, cover, and cook on low until tender, about 20 minutes, stirring every so often.",
    "At this point if the liquid has absorbed but the lentils are still not tender, add ½ of water and cook on low until lentils are tender (don’t overcook them though or they will become mushy.)",
    "Remove from the heat and fold in chopped spinach.",
    "Take a taste and adjust seasoning as needed.",
    "Sprinkle with chopped fresh cilantro and serve"
  ],
  "ingredients": [
    "0",
    "2 tablespoons vegetable oil (I used coconut oil)",
    "1 large onion, finely chopped",
    "2 garlic cloves, minced",
    "1 2-inch piece fresh ginger, peeled and grated",
    "1 tablespoon Garam Masala",
    "2 teaspoons ground cumin",
    "2 teaspoons ground coriander",
    "2 teaspoons sweet paprika",
    "1 teaspoon turmeric",
    "½ teaspoon cayenne pepper",
    "2 (14.5 oz) cans diced tomatoes",
    "1 can full-fat coconut milk (I used BPA-free Natural Value)",
    "1 cup red lentils, rinsed and picked over",
    "2 cups spinach, roughly chopped",
    "1 teaspoon fine grain salt",
    "Fresh chopped cilantro for garnish"
  ],
  "__v": 1
}