{
  "hash": "8c847fdbafc652e23a0c00ca7224c43d91e4e7d9",
  "title": "Matar Soy Paneer",
  "image": "http://farm4.staticflickr.com/3834/9285915414_b02d70abe1_z.jpg",
  "href": "http://cecinestpasunfoodblog.com/2013/07/matar-soy-paneer-vegan-indian-peas-tofu/",
  "extension": "Chrome",
  "firstAdded": "2015-06-20T10:30:43.038000",
  "users": [
    null
  ],
  "keywords": [
    "extra",
    "firm",
    "tofu",
    "cubes",
    "salt",
    "hot",
    "water",
    "canola",
    "oil",
    "divided",
    "seeds",
    "cumin",
    "medium",
    "yellow",
    "onion",
    "coriander",
    "turmeric",
    "green",
    "peppers",
    "serrano",
    "jalapeo",
    "seeded",
    "ginger",
    "tomato",
    "preferably",
    "nosaltadded",
    "frozen",
    "peas",
    "fully",
    "partially",
    "thawed",
    "garam",
    "masala",
    "cilantro"
  ],
  "directions": [
    "0",
    "Place cubed tofu in a shallow bowl. Dissolve salt in hot water and pour over top of tofu. Let soak for about 15 minutes, then drain. Transfer the tofu to a non-terry dishtowel or double layer of paper towels placed atop a plate. Drain for 10 to 15 minutes.",
    "Heat a medium skillet or wok over medium-high heat and add about half (1 tbsp) of the oil. Blot the tofu cubes dry, then panfry them in two batches for about 5 minutes, until light golden on 3 or 4 of the sides - don't worry about crisping it all over. I like to use this as an opportunity to practice my flipping skills, but if you like to be on the safer side of things, use a spatula or chopsticks. Transfer tofu to a plate, leaving the oil in the pan and set aside.",
    "Add the remaining 1 tbsp oil. When hot, add the cumin seeds and stir for about 15 seconds until they’ve darkened. Dump in the onion and cook for about 8 minutes, stirring, until deep brown. Add the coriander, turmeric, chile, and ginger. Cook until aromatic and no longer raw smelling. Add the tomato and water. Bring to a vigorous simmer, lower heat and cook for 5 minutes to concentrate.",
    "Add the tofu cubes and cook for another 5 minutes to allow the flavour to get absorbed. Add the peas and garam masala, then heat until hot. Taste, season with extra salt, if needed. Stir in the cilantro, then transfer to a serving bowl."
  ],
  "ingredients": [
    "0",
    "1 package (350-454 g) firm or extra firm tofu, cut into ¾\" (2 cm) cubes",
    "1 tsp (5 mL) salt",
    "2 cups (500 mL) hot water",
    "2 tbsp (30 mL) canola oil, divided",
    "1½ tsp (7 mL) cumin seeds, or 1 tsp ground cumin",
    "1 medium yellow onion, finely chopped",
    "1½ tbsp (22 mL) ground coriander",
    "¾ tsp (3 mL) turmeric",
    "2 hot green peppers, like serrano or jalapeño, seeded and finely chopped",
    "1 tbsp (15 mL) finely chopped fresh ginger",
    "1½ cups (375 mL) crushed tomato or tomato purée, preferably no-salt-added",
    "1½ cups (375 mL) water",
    "1½ cups (375 mL) frozen peas, fully or partially thawed, about 7 oz (200 g)",
    "¾ tsp (3 mL) garam masala",
    "2-3 tbsp (30-45 mL) chopped cilantro, for garnish"
  ],
  "__v": 1
}