{
  "hash": "946f8ec2f02925a17dc92079e9b7f2e8fc7a8d47",
  "title": "Steakhouse Honey Wheat Bread",
  "image": "http://www.lanascooking.com/wp-content/uploads/2013/07/steakhouse-honey-wheat-bread-final-600.jpg",
  "href": "http://www.lanascooking.com/2013/07/23/steakhouse-honey-wheat-bread/",
  "extension": "Firefox",
  "firstAdded": "2015-04-20T12:25:56.926000",
  "users": [
    null
  ],
  "keywords": [
    "water",
    "degrees",
    "sugar",
    "pkg",
    "active",
    "dry",
    "yeast",
    "bread",
    "flour",
    "wheat",
    "tblsp",
    "cocoa",
    "instant",
    "coffee",
    "granules",
    "salt",
    "butter",
    "softened",
    "honey",
    "molasses",
    "yellow",
    "cornmeal",
    "dusting"
  ],
  "directions": [
    "0",
    "Proof the yeast: measure the warm water into a two-cup or larger measure. Add the sugar and yeast. Stir to dissolve. Within 5 minutes the yeast should have begun to bubble and grow.",
    "While the yeast proofs, mix the flours, cocoa, coffee, and salt in a large bowl. Stir together with a whisk.",
    "Using your fingers, mix the softened butter into the flour mixture.",
    "Make a well in the center of the dry mixture and add the honey, molasses, and yeast-water mixture. Stir from the middle, bringing the dry ingredients gradually into the wet. You can start out with a wooden spoon but will need to use your hands to finally bring the dough together.",
    "Turn the rough dough out onto a lightly floured surface. Knead for 10 minutes adding small amounts of flour to the kneading surface only if needed.",
    "Let the dough rest for a few minutes while you wash and dry the bowl that you used to mix it in. Spray the inside of the bowl with cooking spray. Put the dough into the bowl top side down and then turn it over so that the top is coated with a bit of the cooking spray.",
    "Cover the bowl with plastic wrap and set it in a warm place to rise. The interior of an oven with the light on is usually warm enough. Let the dough rise for 1 to 1 1/2 hours or until doubled in size.",
    "When the dough has doubled, cut it into 6 portions. Form each portion into either a 6-inch log shape or a round mini-boule.",
    "Pour a small amount of cornmeal onto your work surface. Moisten each dough portion very lightly by wetting your hands, removing most of the water and rubbing over the dough. Roll the lightly moistened loaves in cornmeal to coat. Gently pat to remove any excess cornmeal.",
    "Place the loaves on a lightly oiled baking sheet. Cover with plastic wrap and set aside to rise for another hour or until doubled in size.",
    "Preheat the oven to 350 degrees. Uncover the dough and bake for 35-40 minutes. Remove from the oven and allow to cool for 10 to 15 minutes.",
    "Serve with plenty of butter."
  ],
  "ingredients": [
    "0",
    "1 1/4 cups warm water (105-110 degrees)",
    "2 tsp. sugar",
    "1 pkg. (2 1/4 tsp.) active dry yeast",
    "2 cups bread flour",
    "1 3/4 cups whole wheat flour",
    "1 tblsp. cocoa",
    "2 tsp. instant coffee granules",
    "1 tsp. salt",
    "2 tblsp. butter, softened",
    "1/4 cup honey",
    "2 tblsp. molasses",
    "Yellow cornmeal for dusting"
  ],
  "__v": 1
}