{
  "hash": "02ea8f628123cf26c4e48385072d647fe2bcfd35",
  "title": "Key Lime Coconut Cheesecake Cups [Vegan, Raw, Gluten-Free]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/06/lime.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/key-lime-coconut-cheesecake-cups/",
  "extension": "Chrome",
  "firstAdded": "2015-06-12T11:15:39.745000",
  "users": [
    null
  ],
  "keywords": [
    "raw",
    "almonds",
    "walnuts",
    "coconut",
    "sugar",
    "pink",
    "himalayan",
    "salt",
    "used",
    "maple",
    "syrup",
    "honey",
    "agave",
    "medjool",
    "dates",
    "milk",
    "refrigerated",
    "overnight",
    "fullfat",
    "cashews",
    "soaked",
    "water",
    "hours",
    "preferably",
    "unrefined",
    "oil",
    "lime",
    "zest",
    "squeezed",
    "juice",
    "limes"
  ],
  "directions": [
    "0",
    "Line a cupcake pan with 12 cupcake liners and set aside.",
    "In a food processor, combine almonds and walnuts. Process until finely grated.",
    "Add in coconut sugar, sea salt, and coconut flakes. Process until fully mixed.",
    "Add dates and maple syrup and process until well mixed and sticky. You may need to scape down the sides a few times with a spatula to make sure all ingredients are well mixed.",
    "Spoon out crust from food processor into cupcake liners. Place in freezer while preparing the filling.",
    "1",
    "Open can of coconut milk. The milk has separated into two parts. You want to spoon out the top white part that looks like Cool Whip and place in blender or food processor. The coconut water left over in the can is not needed for this recipe. Use in a juice or smoothie!",
    "Drain and rinse off cashews that have been soaking, place in blender.",
    "Add coconut flakes, coconut sugar, coconut oil, lime zest and lime juice.",
    "Blend until smooth and creamy.",
    "Remove cupcake pan from freezer and pour filling on top of crust. I added extra coconut flakes and lime zest on top but thats totally optional!",
    "Put back in freezer for 2-3 hours until firm.",
    "Remove for about about 5 minutes to slightly thaw, not too long or they will become too soft. Enjoy!!"
  ],
  "ingredients": [
    "0",
    "1 cup raw almonds",
    "1 cup raw walnuts",
    "2 tsp. coconut sugar",
    "1 tsp. pink Himalayan sea salt (or any sea salt is fine)",
    "2 tbsp. shredded coconut flakes (I used unsweetened)",
    "2 tbsp. maple syrup (or honey or agave)",
    "1 cup pitted Medjool dates, chopped (about 5 dates)",
    "1",
    "1 can coconut milk (refrigerated overnight, I used full-fat)",
    "1 cup cashews (soaked in water for at least 1-2 hours, preferably overnight)",
    "2 tbsp. shredded coconut flakes",
    "2 tbsp. coconut sugar",
    "2 tbsp. raw, unrefined coconut oil",
    "1 tbsp. lime zest",
    "freshly squeezed lime juice from 2 large limes"
  ],
  "__v": 1
}