{
  "__v": 1,
  "directions": [
    "0",
    "Preheat the oven to 300°F. Line a rimmed sheet tray with all of the vegetables. The vegetables should cover the tray in a single layer. (Note: the total weight of vegetables is about 4 pounds or812 kilograms.) Drizzle olive oil over top. Season with 1 teaspoon kosher salt and pepper to taste. Roast for about three hours, but start checking after 2 hours — sometimes they are done in 2 1/2 hours. The vegetables should be soft and slightly caramelized.",
    "Meanwhile, toast the bread. If you haven't already, slice the bread into 1/2-inch thick pieces. Place on the counter to dry or toast briefly in the toaster. You can also stick the bread in the oven for about 20 minutes or so while the tomatoes are roasting. You just want to dry out the bread; you’re not trying to brown it.",
    "When the vegetables are done, place them in a pot with 2 1/2 cups of water. Bring to a simmer. Note: It's best to bring this soup to a simmer slowly — it spits violently if you heat it too quickly. Also, reheat with the lid on over low heat for the same reason.",
    "Season with a pinch of salt and crushed red pepper flakes, if using. Add the bunch of basil. Break one slice of bread into medium-sized cubes and add to the pot. Using an immersion blender or food processor or traditional blender, puree the soup roughly. Add the other slice of bread if necessary. The soup should be slightly chunky. Taste and add more salt or bread if necessary. Thin with more water until soup reaches desired consistency.",
    "Serve with a drizzle of olive oil and a few shavings of Parmigiano Reggiano."
  ],
  "firstAdded": "2014-10-01T04:34:25.487000",
  "hash": "865d9df8c74a6d3fefb3f554afa3b9cf967d2a08",
  "href": "http://www.popsugar.com/food/Roasted-Tomato-Bread-Soup-35751566",
  "image": "http://media4.onsugar.com/files/2014/09/18/024/n/1922195/2d5bed59efa081c2_14912261065_1f6233799a_o.xxxlarge.jpg",
  "ingredients": [
    "0",
    "About 3 pounds (1.36 kilograms) tomatoes, halved if large, left whole if cherry or grape, enough to fill a sheet tray",
    "1 onion, peeled and chopped into big chunks (9 1/2 ounces/256 grams once trimmed)",
    "1 shallot, peeled and chopped into big chunks (3 1/8 oz/88 grams once trimmed)",
    "1 head garlic, cloves separated but left peeled, lightly smashed (1 1/2 ounces/42 grams)",
    "1 large carrot, unpeeled, roughly chopped (2 ounces/55 grams)",
    "About 3 tablespoons olive oil",
    "1 teaspoon kosher salt plus more to taste",
    "Fresh cracked pepper",
    "4 to 5 ounces/135 grams (a couple slices) bakery style bread or peasant bread",
    "2 to 3 cups water",
    "1 bunch (1 ounce/28 grams) fresh basil",
    "Crushed red pepper flakes, to taste",
    "Shaved Parmigiano Reggiano and more bread for serving, optional",
    "Olive oil for drizzling, optional"
  ],
  "keywords": [
    "tomatoes",
    "left",
    "cherry",
    "grape",
    "sheet",
    "tray",
    "onion",
    "chunks",
    "trimmed",
    "shallot",
    "head",
    "garlic",
    "separated",
    "lightly",
    "smashed",
    "carrot",
    "unpeeled",
    "roughly",
    "olive",
    "oil",
    "kosher",
    "salt",
    "cracked",
    "pepper",
    "couple",
    "slices",
    "bakery",
    "style",
    "peasant",
    "bread",
    "water",
    "bunch",
    "basil",
    "red",
    "shaved",
    "parmigiano",
    "reggiano",
    "drizzling"
  ],
  "title": "Roasted Tomato and Bread Soup",
  "users": [
    null
  ]
}