{
  "hash": "3a34ce07298dec6a2c6a98e5579e9a80b5a27001",
  "title": "Lemon Raspberry Muffins",
  "image": "http://cookieandkate.com/images/2016/05/raspberry-muffins-recipe.jpg",
  "href": "http://cookieandkate.com/2016/healthy-raspberry-muffins-recipe/",
  "extension": "Chrome",
  "firstAdded": "2017-02-19T02:00:27.021000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350 degrees Fahrenheit. If necessary, grease all 12 cups on your muffin tin with butter, coconut oil or cooking spray (my pan is non-stick and doesn’t require any grease).",
    "In a large mixing bowl, combine the flour, baking powder, baking soda and salt. Blend well with a whisk.",
    "In a medium mixing bowl, combine the oil and honey or maple syrup and beat together with a whisk. Add the eggs and beat well, then add the yogurt, vanilla and lemon zest. Mix well. (If the coconut oil solidifies in contact with cold ingredients, gently warm the mixture in the microwave in 30 second bursts.)",
    "Pour the wet ingredients into the dry and mix with a big spoon, just until combined (a few lumps are ok). Gently fold the raspberries into the batter. The mixture will be thick, but don’t worry.",
    "Divide the batter evenly between the 12 muffin cups (I used an ice cream scoop with a wire level, which worked perfectly). Sprinkle the tops of the muffins with turbinado sugar. Bake the muffins for 22 to 24 minutes, or until the muffins are golden on top and a toothpick inserted into a muffin comes out clean.",
    "Place the muffin tin on a cooling rack to cool. You might need to run a butter knife along the outer edge of the muffins to loosen them from the pan. If you have leftover muffins, store them, covered, at room temperature for 2 days, or in the refrigerator for up to 5 days. Freeze leftover muffins for up to 3 months."
  ],
  "ingredients": [
    "0",
    "1¾ cups white whole wheat flour or regular whole wheat flour",
    "1 teaspoon baking powder",
    "½ teaspoon baking soda",
    "½ teaspoon fine-grain sea salt",
    "⅓ cup melted coconut oil or extra-virgin olive oil",
    "½ cup honey or maple syrup",
    "2 eggs, preferably at room temperature",
    "1 cup plain Greek yogurt*",
    "2 teaspoons vanilla extract",
    "Zest of 1 medium lemon (about ½ teaspoon)",
    "1½ cups Cascadian Farm Organic Frozen Raspberries (from one 10-ounce bag)",
    "1 tablespoon turbinado sugar (also called raw sugar), for sprinkling on top"
  ],
  "__v": 1
}