{
  "hash": "422c1d4b5d23e8a1e93becbbdda26ae2defe732d",
  "title": "The Falafel BurgerCashew Tzatziki SauceSumac Fries",
  "image": "http://i1.wp.com/willfrolicforfood.com/wp-content/uploads/2015/04/falafel-sliders-cashew-tzatziki-sumac-fries-0731.jpg?resize=682%2C1024",
  "href": "http://willfrolicforfood.com/2015/04/falafel-burger-sliders-cashew-tzatziki-sumac-fries-recipe-vegan-gluten-free.html",
  "extension": "",
  "firstAdded": "2015-12-02T22:47:54.384000",
  "users": [
    null
  ],
  "keywords": [
    "garbanzo",
    "beans",
    "olive",
    "oil",
    "garlic",
    "roughly",
    "parsley",
    "thyme",
    "cumin",
    "mortar",
    "black",
    "pepper",
    "sumac",
    "juice",
    "lemons",
    "flour",
    "almond",
    "meal",
    "sesame",
    "seeds",
    "sunflower",
    "salt",
    "cashew",
    "tzatziki",
    "red",
    "leaf",
    "lettuce",
    "roasted",
    "mini",
    "gluten",
    "free",
    "hamburger",
    "buns",
    "favorite",
    "bun",
    "warmed",
    "cashews",
    "lemon",
    "tahini",
    "mint",
    "maple",
    "syrup",
    "celtic",
    "filtered",
    "water",
    "english",
    "cucumber",
    "lbs",
    "potatoes",
    "washed",
    "wedges"
  ],
  "directions": [
    "0",
    "Preheat the oven to 375F. Line three medium baking sheets with parchment paper and set aside.",
    "In a food processor fitted with an S blade, combine the garbanzo beans, olive oil, garlic, parsley, thyme, cumin, black pepper, sumac, and lemon juice until you have a creamy consistency (about 1 minute).",
    "Add the garbanzo flour and almond meal and pulse just until combined.",
    "Spoon the falafel mix into a medium bowl.",
    "Add the sesame and sunflower seeds, and stir just to incorporate.",
    "Add the salt, taste and add more salt according to your preferences (the falafel mix will be rather wet and sticky).",
    "To form the burgers: scoop about 2 tablespoons of falafel mix out at a time and form into rounds between the palms of your hands. Flatten gently (mine were about 1 inch thick) then place on the parchment lined baking sheets, spaced 1 inch apart. Repeat until you've used up all of the falafel mix. Optional: garnish the taps with extra sesame seeds. For larger burgers, use about 4 tablespoons of mix to form your burgers.",
    "Bake the falafel burgers on the middle rack for 20 minutes, or until golden brown on the bottom, dry, and springy to the touch. Larger burgers could take up to 10 minutes longer, so keep check in with your burgers as they cook.",
    "Remove and let cool a minimum of 5 minutes before add to your buns and serving.",
    "1",
    "Combine all of the ingredients in a the bowl of a high powered blender: cashews, sunflower seeds, lemon, tahini, parsley, mint, maple syrup, sea salt, and water. Whirr until smooth and creamy.",
    "Stir in the diced cucumber.",
    "Serve immediately!",
    "2",
    "Bring a wide pot of water to a boil.",
    "Remove from heat and add the potato wedges and let soak for 15 minutes in the hot water.",
    "Preheat the oven to 475F. Line three baking sheets with parchment paper and set aside.",
    "Drain the potatoes and pat dry. Place the potatoes in a large mixing bowl.",
    "Add olive oil and toss to coat.",
    "Add the thyme, sumac, and salt and toss again to coat everything evenly in the spice mix.",
    "Bake for 5 minutes on the middle rack. Turn the potatoes over and bake 5-10 minutes more, or until the potatoes are fork-tender and beginning to brown and crisp up.",
    "Remove from the oven and let cool at least 20 minutes before serving."
  ],
  "ingredients": [
    "0",
    "29 ounces cooked garbanzo beans (about 4 cups)",
    "3 tablespoons olive oil",
    "3 garlic cloves, chopped roughly",
    "Large handful fresh parsley",
    "1 tablespoon dried thyme",
    "1 tablespoon whole cumin, ground in a mortar",
    "¼ teaspoon black pepper",
    "1 teaspoon sumac",
    "Juice of 1 & ½ lemons",
    "1 cup garbanzo flour",
    "½ cup almond meal",
    "¼ cup sesame seeds + more to garnish",
    "¼ cup sunflower seeds",
    "2 tablespoons salt, + more to taste",
    "Cashew Tzatziki",
    "Red leaf lettuce",
    "Roasted red pepper",
    "Mini Gluten Free Hamburger Buns (or your favorite bun), toasted or warmed",
    "1",
    "¼ cup cashews",
    "¼ cup sunflower seeds",
    "juice of ½ lemon",
    "¼ cup tahini",
    "large handful fresh parsley",
    "handful of fresh mint",
    "⅛ teaspoon maple syrup",
    "Celtic sea salt, to taste",
    "½ cup filtered water",
    "¾ cup english cucumber, diced",
    "2",
    "2 lbs red potatoes, washed & sliced into wedges",
    "3 tablespoons olive oil",
    "2 tablespoons thyme",
    "2 tablespoons sumac",
    "1 teaspoon sea salt + plus more to taste"
  ],
  "__v": 1
}