{
  "hash": "fb3b0bb2b64574a8d2d0cbef2d513799dc4f2334",
  "title": "Steel-Cut Oat “Risotto” with Butternut Squash and Kale",
  "image": "https://cookieandkate.com/images/2017/11/butternut-kale-steel-cut-oat-risotto.jpg",
  "href": "https://cookieandkate.com/2017/steel-cut-oat-risotto-recipe/",
  "extension": "",
  "firstAdded": "2018-05-01T16:21:54.138000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium Dutch oven or soup pot, warm the olive oil until shimmering. Add the onion, butternut, ½ teaspoon of the salt, and the red pepper flakes. Cook, stirring often, until the onion is translucent and the butternut is mostly tender, about 8 to 10 minutes.",
    "Add the garlic and stir to combine. Add the oats and kale and cook, stirring often, until the kale has mostly wilted, about 2 minutes. Add the wine and use a wooden spoon or silicone spatula to scrape up any browned bits that have formed against the bottom of the pan. Cook, while stirring, for another 1 to 2 minutes.",
    "Add the water and remaining ½ teaspoon salt. Raise the heat to high and bring the mixture to a simmer, stirring occasionally. Once simmering, reduce the heat to medium-low and simmer, stirring occasionally, until the mixture is very creamy and thick (see photos), about 20 to 30 minutes. As time goes on, you might need to stir more frequently and reduce the heat to prevent scorching the bottom.",
    "Remove the pot from the heat and stir in the Parmesan, butter, lemon juice and several twists of black pepper. Let the risotto rest for 5 minutes before serving. Once you’re ready to serve, season generously with additional salt (I usually add at least ¼ teaspoon), and black pepper. Add an extra squeeze of lemon juice if it needs an extra boost of flavor. Divide into bowls and serve."
  ],
  "ingredients": [
    "0",
    "2 tablespoons extra-virgin olive oil",
    "1 medium red onion, chopped",
    "1 small (2 pounds) butternut squash or 2 sweet potatoes, peeled and diced into ½” cubes",
    "1 teaspoon salt, divided, more to taste",
    "Pinch of red pepper flakes",
    "4 cloves garlic, pressed or minced",
    "1 ½ cups Quaker Steel-Cut Oats",
    "2 packed cups chopped kale, ribs removed (about ½ bunch)",
    "½ cup dry white wine*",
    "6 cups water",
    "¾ cup (1 ¾ ounces) freshly grated Parmesan cheese",
    "2 tablespoons butter",
    "1 tablespoon lemon juice",
    "Freshly ground black pepper, to taste"
  ],
  "__v": 1
}