{
  "hash": "04f6845924f4dfc56e7ab3453b9d6a78dcac80d2",
  "title": "Double Crust Chicken Pot Pie",
  "image": "http://cf.melissassouthernstylekitchen.com/wp-content/uploads/2016/10/editedDoubleCrustChickenPotPie002-320x320.jpg",
  "href": "http://www.melissassouthernstylekitchen.com/double-crust-chicken-pot-pie/",
  "extension": "Chrome",
  "firstAdded": "2017-01-05T03:46:15.621000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350°F. Brush the bottom and sides of a 10-inch cast iron skillet or similar with vegetable oil. Set aside.",
    "In a large skillet over medium-high heat melt the butter. Cook the celery and green onion in the butter for 3 minutes or until the celery is beginning to soften.",
    "Lower the heat to medium, stirring constantly add the flour to the skillet. Stir until the butter has absorbed the flour.",
    "Continue whisking gradually adding the chicken broth. Increase the temperature and bring to a boil. Add the half & half and immediately lower the heat to simmer. Add the poultry seasoning, garlic salt, tarragon, lemon pepper and black pepper. Mix well. Simmer for 5 minutes.",
    "After 5 minutes, remove from the heat and mix in the chicken and vegetables. Mix well.",
    "Unroll one pie crust and fit firmly onto the bottom and sides of the skillet. Pour the filling into the crust.",
    "Fit the second crust on top. Fold under pressing the edges of the crusts together and pinching to seal.",
    "Cut slits in the middle of the crust to vent. Brush with the beaten egg wash.",
    "Bake for 40-45 minutes until the crust is golden. Rest for 10 minutes then serve."
  ],
  "ingredients": [
    "0",
    "5 Tbsp butter",
    "1 rib celery, diced",
    "3 green onion, chopped",
    "⅓ cup all-purpose flour",
    "2 cups low sodium chicken broth",
    "¼ cup half & half or cream",
    "1½ tsp poultry seasoning",
    "1½ tsp garlic salt",
    "1 tsp dry tarragon leaves",
    "¼ tsp lemon pepper",
    "¼ tsp black pepper",
    "3 cups chopped rotisserie chicken",
    "2 cups frozen mixed vegetables, thawed",
    "1 (14 oz) package refrigerated pie crust, bring to room temperature per instructions",
    "1 large egg, beaten with 1 tsp cold water (Egg wash)"
  ],
  "__v": 1
}