{
  "__v": 1,
  "directions": [
    "0",
    "In a large bowl, whisk together flour and salt. Make a well in the center and add 1 egg and water to the well.",
    "Using a fork, slowly incorporate dry ingredients into wet ingredients until just combined. Pour dough onto a clean surface and sprinkle with flour. Knead dough until tough, adding more flour as needed until dough can take a mild punch and is barely sticky (it should be quite a bit tougher than bread dough).",
    "Shape dough into a ball and place in a damp towel for 45 minutes.",
    "Remove dough from towel and place on a well-floured surface. Roll out to stretch super thin, about 1 mm thick. Sprinkle top with flour and fold dough over itself twice in the same direction. Flour the top.",
    "Using a very sharp, long knife, slice dough horizontally into very thin noodles. Use fingers to unfold noodles and place on a floured baking sheet.",
    "Meanwhile, bring a large pot of salted water to a bowl. Carefully shake excess flour off noodles and slowly lower into water, a few at a time. Cook about 4 minutes or until al dente.",
    "Drain pasta, reserving 2/3 cup of the pasta water. Set aside.",
    "Meanwhile, place a medium skillet on a stovetop over medium heat. Add 1 tablespoon oil to skillet, then add spinach. Cook spinach 1 minute until warm, then add remaining oil, scallions, red pepper flakes, soy sauce and sugar and stir to combine.",
    "Make two wells in the greens mixture and crack an egg in each well. Cover skillet and poach eggs for 4-5 minutes.",
    "Divide noodles and pasta water among two bowls. Divide greens among bowls and top each with a poached egg. Serve immediately."
  ],
  "firstAdded": "2014-06-06T03:15:23.401000",
  "hash": "ff397968949dce96c19042ea35b0841582e0ece3",
  "href": "http://www.tablespoon.com/recipes/homemade-ramen-noodles-with-poached-eggs-and-sauteed-greens/7b566657-defa-4c63-a072-dca15b78c795",
  "image": "http://www.tablespoon.com/-/media/Images/Articles/tfa/2012/05/2012-05-31-howtomakeramen-586x322.jpg",
  "ingredients": [
    "0",
    "3/4 cup bread flour or unbleached all-purpose flour, plus more for dusting",
    "3/4 teaspoon salt",
    "3 eggs",
    "1 tablespoon water",
    "2 tablespoons vegetable or olive oil",
    "1 11-ounce package frozen spinach or Asian greens, thawed",
    "1 bunch scallions, sliced diagonally",
    "1/2 teaspoon red pepper flakes",
    "3 tablespoons soy sauce",
    "1 pinch granulated sugar"
  ],
  "keywords": [
    "bread",
    "unbleached",
    "allpurpose",
    "flour",
    "dusting",
    "salt",
    "eggs",
    "water",
    "olive",
    "oil",
    "frozen",
    "spinach",
    "asian",
    "greens",
    "thawed",
    "bunch",
    "scallions",
    "diagonally",
    "red",
    "pepper",
    "soy",
    "granulated",
    "sugar"
  ],
  "title": "Homemade Ramen Noodles with Poached Eggs and Sauteed Greens",
  "users": [
    null
  ]
}