{
  "hash": "9c9ff582e3e016a606d4fe840bd7097223743bcf",
  "title": "Instant Pot Crustless Quiche Lorraine",
  "image": "https://cdn.ruled.me/wp-content/uploads/2018/03/crustless-quiche-lorraine-01.jpg",
  "href": "https://www.ruled.me/instant-pot-crustless-quiche-lorraine/",
  "extension": "Chrome",
  "firstAdded": "2018-04-15T16:44:51.186000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Set the Instant Pot to the medium saute setting. Chop up the bacon slices and fry until crisp. Set the bacon aside on a paper towel.",
    "In a mixing bowl whisk together the eggs, heavy whipping cream, nutmeg, salt, and pepper to taste.",
    "Grease the inside of a 6 inch cake pan. Add 1 cup of the shredded Swiss cheese.",
    "Crumble the cooked bacon then add it into the cake pan.",
    "Pour the egg batter into the cake pan.",
    "Place the steam rack inside of the Instant Pot and add 1 cup of water. Carefully lower the cake pan inside of the Instant Pot and place on top of the steam rack. You can cover the cake pan with tented foil if you'd like, but I typically just wipe any water off the top when it's done cooking.",
    "Lock the Instant Pot lid then select high pressure, and set the timer for 25 minutes. When it's done cooking let it sit for 10 minutes before performing a quick pressure release. (Sometimes the lock has already released on its own by then.)",
    "Carefully remove the cake pan from the pressure cooker. Pat any water off the top with a towel.",
    "Top with the remaining 1/3 cup of shredded Swiss cheese. Place under a broiler for 5-10 minutes or until the cheese has browned a bit. For simplicity I just used the broiler in my toaster oven.",
    "Run a silicone spatula around the edges of the quiche. Carefully flip out onto a plate, then flip again onto the serving plate."
  ],
  "ingredients": [
    "0",
    "8 slices bacon",
    "4 large eggs",
    "¼ teaspoon salt",
    "¼ teaspoon nutmeg",
    "1 ½ cups heavy whipping cream",
    "1 cup (85 g) shredded Swiss cheese",
    "1/3 cup (25 g) shredded Swiss cheese",
    "Pepper to taste"
  ],
  "__v": 1
}