{
  "__v": 1,
  "directions": [
    "0",
    "Sulla spianatoia formare con la farina una fontana, mettere al centro le uova leggermente sbattute, il cucchiaio d' olio, il sale e impastare bene il tutto. Formare una palla con l' impasto, coprire con un telo e lasciare riposare per 30 minuti. Nel frattempo preparare il condimento mettendo in una padella i 4 cucchiai di olio con lo spicchio d' aglio, scaldarlo leggermente quindi aggiungere i funghi puliti e tagliati o, come ho fatto io, utilizzare dei funghi misti surgelati. Cuocere per circa 15 minuti e togliere dal fuoco. Preparare quindi il pesto mettendo in un mortaio le noci con i due cucchiai di olio e il prezzemolo. Pestare grossolanamente il tutto e lasciare da parte. Trascorso il tempo di riposo riprendere l' impasto, dividerlo in due e stendere con il mattarello due sfoglie dello spessore di circa un paio di millimetri. Con un coltello tagliare delle strisce di circa due centimetri di larghezza che taglierete di nuovo a losanga della lunghezza di circa 5/6 cm o come preferite voi. Mano a mano che tagliate la sfoglia mettete i maltagliati su un vassoio con la farina per evitare che si attacchino tra loro. Lasciare asciugare per almeno un' oretta quindi mettere a bollire abbondante acqua e cuocervi i maltagliati per circa 6/7 minuti. Scolare la pasta condire con i funghi, mantecare bene ed infine distribuire sopra il pesto di noci."
  ],
  "firstAdded": "2014-10-10T12:08:06.774000",
  "hash": "4c8ddb424c245ea33ae4a6ba4d649942fead0b39",
  "href": "http://gattoghiotto.blogspot.it/2011/10/piccola-bottega-di-campagna-ottobre.html",
  "image": "http://3.bp.blogspot.com/-ZWAn0v3v-S4/Tqcrcu_H88I/AAAAAAAADnk/Akb5C8KrOug/s640/IMG_8485-4.jpg",
  "ingredients": [
    "0",
    "Ingredienti",
    "(per 4 porzioni)",
    "PER LA PASTA",
    "200 g di farina di farro",
    "200 g di farina 00",
    "un cucchiaio d' olio",
    "4 uova intere",
    "un pizzico di sale",
    "PER IL CONDIMENTO",
    "500 g di funghi misti",
    "uno spicchio d' aglio",
    "4 cucchiai d' olio",
    "sale e pepe q.b.",
    "PER IL PESTO",
    "70 g di noci sgusciate",
    "qualche foglia di prezzemolo",
    "due cucchiai d' olio"
  ],
  "keywords": [
    "ingredienti",
    "porzioni",
    "pasta",
    "farina",
    "farro",
    "cucchiaio",
    "olio",
    "uova",
    "intere",
    "pizzico",
    "sale",
    "condimento",
    "funghi",
    "misti",
    "uno",
    "spicchio",
    "aglio",
    "cucchiai",
    "pepe",
    "pesto",
    "noci",
    "sgusciate",
    "qualche",
    "foglia",
    "prezzemolo"
  ],
  "title": "Maltagliati di farro con funghi e pesto di noci",
  "users": [
    null
  ]
}