{
  "hash": "17aa4fe87c8073787e7e4b24be0fbfb4cc3ca807",
  "title": "BŒUF EN DAUBE À LA PROVENÇALE",
  "image": "http://foodanddrink.ca/images/food_drink/200501011.jpg",
  "href": "http://foodanddrink.ca/lcbo-ear/RecipeController?language=EN&recipeType=1&action=recipe&recipeID=1470",
  "extension": "Chrome",
  "firstAdded": "2020-01-18T16:30:11.574000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 300ºF (150ºC).",
    "Place wine in pot on high heat. Bring to boil and boil until wine is reduced by about two-thirds. It should be slightly syrupy.",
    "Dry the beef in paper towels; it will not brown if it is damp. Season well with salt and pepper. Heat 2 tbsp (25 mL) oil on high heat in ovenproof casserole or skillet. Sauté meat, a few pieces at a time, in the hot oil until nicely browned on all sides. Add more oil as needed. Remove to dish and reserve. Pour off all fat except for 2 tbsp (25 mL).",
    "Reduce heat to medium, add carrot and onion and sauté until slightly golden, about 5 minutes.",
    "Stir in the reduced wine, and stock or bouillon. Add tomato paste, bay leaf and thyme. Bring to simmer on top of the stove. Return meat. Cover the casserole and set in lower third of preheated oven. Regulate heat so liquid simmers very slowly for 2½ to 3 hours. The meat is done when a fork pierces it easily.",
    "Place garlic cloves in pot of cold water. Bring to boil and boil for 3 minutes or until garlic is softened slightly. Remove garlic and slip off skins.",
    "Heat butter in skillet on medium heat. Add garlic and sauté for 1 minute. Cover skillet, reduce heat and let garlic cook until golden, about 10 minutes.",
    "Pour the contents of the casserole through a sieve over a saucepan. Wash out the casserole. Skim fat off sauce, return to casserole and bring sauce to boil. Add garlic and caperberries and boil for 2 to 3 minutes, or until well flavoured and slightly thickened.",
    "Pour the sauce over the meat and reheat when needed. Garnish with parsley."
  ],
  "ingredients": [
    "0",
    "2 cups (500 mL) red wine",
    "2 lbs (1 kg) stewing beef, cut into 2-inch (5-cm) cubes",
    "Salt and freshly ground pepper",
    "3 tbsp (45 mL) olive oil or cooking oil",
    "1 cup (250 mL) sliced carrot",
    "1 cup (250 mL) sliced onion",
    "2 cups (500 mL) beef stock or canned beef bouillon",
    "1 tbsp (15 mL) tomato paste",
    "1 bay leaf",
    "1/2 tsp (2 mL) dried thyme",
    "2 heads garlic, broken into cloves",
    "2 tbsp (25 mL) butter",
    "1/4 cup (50 mL) caperberries",
    "2 tbsp (25 mL) chopped parsley"
  ],
  "__v": 1
}