{
  "hash": "684b8f452055992bc447e549e446983100e2fe7f",
  "title": "Cheesy Lasagna Calzones",
  "image": "http://cdn0.ohsweetbasil.com/wp-content/uploads/2014/02/Lasagna-Calzones-14.jpg",
  "href": "http://www.ohsweetbasil.com/cheesy-lasagna-calzones.html",
  "extension": "Chrome",
  "firstAdded": "2015-09-05T16:59:25.466000",
  "users": [
    null
  ],
  "keywords": [
    "sirloin",
    "italian",
    "sausage",
    "link",
    "casing",
    "olive",
    "oil",
    "tomato",
    "sugar",
    "salt",
    "seasoning",
    "ricotta",
    "mozzarella",
    "slices",
    "egg",
    "parmesan",
    "cheese",
    "storebought",
    "pizza",
    "dough"
  ],
  "directions": [
    "0",
    "Preheat oven to 450 degrees.",
    "Heat a skillet to a medium-high heat. Add olive oil, and brown sirloin and Italian sausage, breaking up the meat into small pieces as your go.",
    "Once the meat has browned add tomato sauce, sugar, salt and Italian seasoning. Bring to a boil, and reduce to a simmer, about 7-10 minutes, transfer to a bowl to cool.",
    "While the meat sauce is cooking/cooling prepare the dough.",
    "Cut the dough into six equal pieces. Roll each piece of dough out into a circle on a floured surface.",
    "On each circle of dough, spread two heaping tablespoons of ricotta on once half of circle. Cover with a heaping ¼ cup of the meat sauce and then top with two pieces of fresh mozzarella cheese.",
    "In a small bowl mix egg and 1 tablespoon water.",
    "Brush the edges of each piece of dough with egg wash, fold empty half over and seal edges. Make sure to seal edges tightly, you don’t want the cheese or sauce to come out of the sides during cooking, I like to actually roll the edges up a bit to ensure this doesn’t happen.",
    "Brush tops with more egg wash and sprinkle with a little bit of parmesan cheese.",
    "Cut one small slit in the middle to let the steam escape.",
    "Place on a parchment lined baking sheet and bake until golden brown, about 10-15 minutes."
  ],
  "ingredients": [
    "0",
    "½ pound ground sirloin",
    "1 Italian sausage link, removed from the casing",
    "2 teaspoons olive oil",
    "1 15 ounce can tomato sauce",
    "1 teaspoon sugar",
    "½ teaspoon salt",
    "½ teaspoon Italian seasoning",
    "1 cup ricotta",
    "8 ounces fresh mozzarella, cut into 6 slices and then halved",
    "1 egg",
    "½ cup parmesan cheese",
    "1 ½ pounds store-bought or homemade pizza dough"
  ],
  "__v": 1
}