{
  "hash": "ccabd840cbc692e9b30797e072163ac94a20d71c",
  "title": "Thai Tofu Coconut Noodle Soup(Khao Soi)",
  "image": "",
  "href": "http://thejamlab.co/2017/05/19/thai-tofu-coconut-noodle-soupkhao-soi/",
  "extension": "Chrome",
  "firstAdded": "2018-08-23T18:16:40.019000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cook the rice noodles per the instructions on the package. Drain and let it run under cold water for a few seconds. Let it sit in the drainer.",
    "In a large pot, on medium heat, add the oil, ginger, garlic and lemongrass and saute for a few seconds. Now add in the thai red curry paste and saute for a minute. Add in the coconut milk and vegetable broth and bring it a boil. Let it boil for about 2-3 minutes. Add in the vegetables like brocolli, red bell pepper, red onions, green and white scallions and thai basil. Add in the lime juice as well. Add in the cut tofu pieces as well. Let it simmer for 5 minutes. Taste the soup and add salt if desired.",
    "Divide the cooked rice noodles amongst 4 soup serving bowls. Pour the boiling soup with vegetables and tofu in all 4 bowls. Garnish with the lime slices, scallions cilantro and thai basil."
  ],
  "ingredients": [
    "0",
    "3 tbsp vegetable oil",
    "3 cloves garlic, grated",
    "1 tbsp grated ginger",
    "1 stalk of lemon grass cut into small pieces",
    "3 tbsp Thai Red Curry Paste (I used the Thai Kitchen brand)",
    "1 can coconut milk ( I used the 365 brand from Whole Foods)",
    "20 fl oz of vegetable broth (I used the 365 brand from Whole Foods)",
    "2 cups of small broccoli florets",
    "1 whole red bell pepper cut into medium sized squares",
    "½ red onion sliced thinly",
    "Rice Noodles of your choice – 8oz approx. I used about 1 cup of cooked noodles per person, so I used 4 cups of cooked noodles, for this recipe",
    "1 cup of chopped green and white scallions",
    "Juice of 1 lime",
    "1 cup of fresh thai basil",
    "2 cups of medium diced tofu",
    "Garnish:",
    "1 lime sliced thinly for garnish",
    "½ cup of cilantro",
    "1 cup of fresh thai basil",
    "chopped green scallions for garnish"
  ],
  "__v": 1
}