{
  "hash": "05e94791d4489377601301ef64ee94e4884458fb",
  "title": "Easy Coffee Granita",
  "image": "http://www.notenoughcinnamon.com/wp-content/uploads/2013/05/Easy-Coffee-Granita-53.jpg",
  "href": "https://www.notenoughcinnamon.com/coffee-granita/",
  "extension": "Chrome",
  "firstAdded": "2018-09-07T17:56:29.418000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Boil water in a kettle or on the stove.",
    "In a large bowl, add instant coffee and sugar. Pour water and mix well. Taste and add sweetener to taste if needed.",
    "Transfer coffee mixture to a large baking dish suitable for freezing, let it cool completely and place in the freezer. If possible, use a big (to make sure the liquid is as spread out as possible) + metal pan. This will speed up the freezing process.",
    "Freeze for about 1/2 hour or until icy at the edges. Using a fork, scrape ice crystals from the edges. Stir mixture well, breaking all icy chunks, and put back in the freezer.",
    "Repeat every half hour for about 3 hours (exact time will depend on your freezer). Granita is ready when granular but still slushy (see picture #6 above)",
    "Scrape granita into glasses or small bowls, top with whipped cream if using and serve immediately.",
    "Make ahead / Leftovers: If you have leftovers or want to make this ahead, keep in the freezer covered and when you're ready to eat, let it sit on the counter for a few minutes (exact time will vary depending on the quantity you have) until it softens and you can scrape it again and break the icy chunks. Place it back in the freezer for a final freezer for about 15-30 minutes before serving.",
    "Recipe Notes",
    "COFFEE:",
    "You can adjust the quantity of coffee used to modulate the strength of the granita: 1/4 cup makes for a light coffee, 1/3 cup medium strong and 1/2 cup very strong. It really is a personal taste!",
    "Instead of coffee powder, you can also use freshly brewed coffee. In that case, simply use 3 cups of coffee and no water. Dissolve sugar in the coffee (it will be easier if it's hot) and follow the rest of the recipe from step #3.",
    "You can also use decaf coffee"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1/3 cup instant coffee powder use 1/4 cup for a light coffee and up to 1/2 cup for a strong coffee - see notes to use brewed coffee",
    "3/4 cup coconut sugar or brown sugar, honey and maple syrup",
    "3 cups water",
    "To serve (optional)",
    "whipped cream coconut whipped cream to keep it vegan + paleo"
  ],
  "__v": 1
}