{
  "hash": "aa980c17c9f66dff74bde59587fa97ffae5eaa89",
  "title": "5 Minute Artisan Bread Tutorial",
  "image": "http://thecafesucrefarine.com/wp-content/uploads/2014/08/Artisan-Bread2.jpg",
  "href": "http://thecafesucrefarine.com/2014/08/5-minute-artisan-bread/",
  "extension": "Chrome",
  "firstAdded": "2017-01-15T16:55:18.301000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Add warm water* to a large bowl. Stir in yeast and sugar and let sit for 4-5 minutes till mixture begins to bubble a bit and get foamy.",
    "Add remaining ingredients and stir with a sturdy wooden spoon. (A Danish whisk works wonderful for mixing this dough and can be purchased online very inexpensively.) Stir vigorously until all flour is incorporated. This will only take a minute or two.",
    "Cover bowl loosely with plastic wrap or a kitchen towel and allow to rest at room temperature until dough rises and collapses (or flattens on top), anywhere from 45 minutes to an hour. (It could take a little longer if your kitchen is cooler.)",
    "While the dough is rising, take a 3-4-quart pot**** (with or without a handle******) and place on top of a piece of parchment paper. Trace a circle, slightly bigger than the bottom of the pot. Cut out circle and set aside.",
    "Sprinkle the bottom of the pan with 2 teaspoons of flour. Spread out with your fingers if needed. Fit the parchment circle into the bottom of the pan and sprinkle another teaspoon of flour over the paper. This will keep your bread from sticking to the pan and parchment paper. Set pot aside aside.",
    "Place ¼ cup flour on a dinner plate. Spread with your fingers to cover surface of plate with flour.",
    "After dough has risen and collapsed, dump it out onto the floured plate. Flip several times to thoroughly coat dough with flour.",
    "Shape into a smooth, flat ball by stretching the surface of the dough and tucking it underneath with the palms of your hands, rotating a quarter of a turn as you go. Dust with more flour from the plate as needed to prevent stickiness, but don't try to incorporate a lot of extra flour into the dough.",
    "Preheat oven to 400˚F.",
    "Transfer the ball of dough to the prepared pot and cover with lid. Let it rest for 30-40 minutes or until doubled in size.",
    "Remove cover and sprinkle top of dough lightly with flour.",
    "With a sharp knife make parallel cuts, 1½ inches apart across the top of the loaf. You can also cut an x (or just make little random cuts with a kitchen shears all over the top of the bread for a fun whimsical look.)",
    "Place pot in oven with cover on. Bake for 30 minutes, then remove cover and continue baking another 15-25 minutes, or until bread is golden brown.",
    "Allow to cool on a cooling rack, uncovered for 15 minutes. Remove bread by inverting onto a cooling rack. (If bread sticks to pan at edges, use a sharp knife to loosen any areas that are stuck.) Cool bread, right side up."
  ],
  "ingredients": [
    "0",
    "1 ⅓ cups warm water (320ml) at 100-110˚F",
    "2 ¼ teaspoons granulated yeast*",
    "1 ½ teaspoons sea salt or 1 teaspoon regular salt.",
    "1 tablespoon sugar",
    "2 tablespoons extra virgin olive oil",
    "1 tablespoon finely chopped fresh finely chopped herbs (optional)",
    "1 cup (130g) whole wheat flour**",
    "2⅔ (330g) cups all-purpose flour"
  ],
  "__v": 1
}