{
  "hash": "cb386cbb84ce16d50ff23751ace92a69637a5c9c",
  "title": "Ciasto migdałowo-pomarańczowe",
  "image": "http://kuchniaprzemka.blog.pl/files/2016/02/IMG_5623-300x300.jpg",
  "href": "http://kuchniaprzemka.blog.pl/2016/02/02/ciasto-migdalowo-pomaranczowe/",
  "extension": "",
  "firstAdded": "2016-09-17T14:22:06.679000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Ciasto: Białka ubić na sztywną pianę, dodając cukier puder. Do błyszczącej piany dodać wanilię i skórkę z 1 pomarańczy. Następnie dodać oliwę i mielone migdały z proszkiem do pieczenia. Wymieszać.",
    "Ciasto przelać do okrągłej formy (śr. 26 cm). Płatki migdałów wymieszać z cynamonem i posypać ciasto. Wstawić do piekarnika nagrzanego do 180 stopni Celsjusza i piec 35-40 minut. Po 30 minutach sprawdzić patyczkiem.",
    "Krem: Żółtka z cukrem utrzeć na parze (miskę z żółtkami i cukrem ustawić nad gotującą się w garnku wodą) do uzyskania białej masy, która zwiększy objętość. Do jeszcze ciepłej masy dodać skórkę z pomarańczy i cytryny. Wymieszać. Masę należy ucierać do czasu całkowitego wystudzenia.",
    "Kolejnym etapem jest utarcie masła na puch. Do utartego tłuszczu dodać stopniowo wystudzoną masę żółtkową i utrzeć na gładki krem.",
    "Wykończenie ciasta.",
    "Na wystudzony spód migdałowy ułożyć pokrojone w krążki banany. Na owoce wyłożyć krem cytrusowy. Ostatnim etapem jest ozdobienie ciasta cząstkami pomarańczy, oraz posypanie pokrojonymi migdałami.",
    "Ciasto należy dobrze schłodzić, takie smakuje najlepiej."
  ],
  "ingredients": [
    "0",
    "IMG_5623",
    "Kilka dni temu dostałem ciekawy przepis na ciasto migdałowe od blogera Krzysztofa, który prowadzi stronę, gotujzprzepisem.blogspot.pl.",
    "Zaintrygowany tą recepturą postanowiłem upiec ciasto, jednak jak to ja, musiałem zmodyfikować je, dodając owoce i krem. Efekt okazał się pyszny.",
    "Zapraszam do wspólnego pieczenia. Proste w przygotowaniu, smaczne i efektowne ciasto migdałowo-pomarańczowe.",
    "Składniki:",
    "8 jaj (osobno białka i żółtka)",
    "150g cukru pudru",
    "Pół szklanki cukru kryształu",
    "125ml jasnej oliwy lub neutralnego w smaku oleju",
    "150g zmielonych migdałów",
    "1 łyżeczka proszku do pieczenia",
    "100g płatków migdałowych",
    "1 łyżeczka cynamonu",
    "Ekstrakt waniliowy lub cukier wanilinowy",
    "Skórka otarta z 2 pomarańczy i 1 cytryny",
    "Kostka masła",
    "2 banany",
    "Fileciki z 2 pomarańczy"
  ],
  "__v": 1
}