{
  "hash": "373a6eb42ba3dd22b13996dfb33936956d65d4de",
  "title": "Skillet Potatoes",
  "image": "http://recipe-folder.com/img/recipe-images/055/374/258149255.jpg",
  "href": "http://www.foodnetwork.com/recipes/daphne-brogdon/skillet-potatoes.html",
  "extension": "Chrome",
  "firstAdded": "2016-09-28T18:53:40.462000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 400 degrees F.",
    "Heat a 10-inch cast-iron or nonstick skillet over low heat. Add the butter; when melted, add the garlic and cook until soft but not browned, 3 to 4 minutes.",
    "Slice the potatoes on a mandoline set to 3mm (about the thickness of 3 credit cards). Place the potatoes in a large bowl; add the melted garlic butter and sprinkle with salt. Toss well to ensure all the slices are coated.",
    "Place the skillet used for the butter over low heat. Carefully layer the potato slices in the skillet, overlapping them in a circular pattern starting from the edge of the skillet and working towards the center. Continue until you have about five layers of potatoes.",
    "Set a medium pot lid (6 to 8 inches wide) on directly on top of the potatoes. Then place a heavy pot on top of the lid to weight it down. Adjust the heat to medium-low and cook for about 15 minutes on the stovetop, then transfer to the oven and bake until the bottom is golden brown and crispy, another 15 minutes. (You can use a spatula to peek at the bottom to make sure it's golden brown.)",
    "Remove the skillet from the oven and let the potatoes rest for 15 minutes. Remove the pot and lid, and place a plate upside down on the skillet. Using oven mitts, carefully turn the skillet over to release the potatoes onto the plate. Garnish with thyme leaves and serve.",
    "Recipe courtesy of Daphne Brogdon"
  ],
  "ingredients": [
    "0",
    "8 tablespoons (1 stick) butter",
    "4 cloves garlic, chopped",
    "2 russet potatoes, skin left on",
    "Salt",
    "3 sprigs fresh thyme leaves"
  ],
  "__v": 1
}