{
  "hash": "186dfd88e4717e1f356c28cf6cb2a8013f9d103e",
  "title": "No Bake Vegan Pumpkin Pie with Gluten-free Gingerbread Crust",
  "image": "http://www.veganricha.com/wp-content/uploads/2014/11/vegan-pumpkin-pie-gingerbread-crust-5014.jpg",
  "href": "http://www.veganricha.com/2014/11/no-bake-vegan-pumpkin-pie-gluten-free-ginger-crust.html",
  "extension": "",
  "firstAdded": "2015-11-25T16:39:26.496000",
  "users": [
    null
  ],
  "keywords": [
    "coconut",
    "crystallized",
    "ginger",
    "oat",
    "flour",
    "almond",
    "meal",
    "sugar",
    "cinnamon",
    "salt",
    "neutral",
    "oil",
    "molasses",
    "maple",
    "syrup",
    "milk",
    "needed",
    "canned",
    "fullfat",
    "raw",
    "brown",
    "arrowroot",
    "cornstarch",
    "tapioca",
    "doesnt",
    "work",
    "reduce",
    "starch",
    "gelatinousness",
    "chickpea",
    "use",
    "unbleached",
    "white",
    "puree",
    "pumpkin",
    "pie",
    "spice",
    "nutmeg",
    "vegan",
    "butter",
    "vanilla",
    "gingerbread",
    "crust",
    "recipe"
  ],
  "directions": [
    "0",
    "For the Crust:",
    "Pulse the coconut with crystallized ginger in a blender, to break down the ginger and the coconut flakes to smaller flakes. Pulse a few times and transfer to a bowl.",
    "Add the rest of the flours, coconut sugar, spices. salt and mix well. Add oil, molasses and maple syrup and mix well. it will take half a minute for the mixture to start looking wet. Get your hands in there to warm up the molasses and mix well. Add a few tsp non dairy milk if needed to make a crumbly dough. Fill the pie pan with the dough and shape into a crust by pressing with your hands inside out.",
    "For the Filling:",
    "Mix coconut milk and sugar, starch , chickpea flour in a pan at medium heat. Keep whisking so the sugar and starch dissolves well. Once the sugar has dissolved, add in the pumpkin puree, spices, oil and mix well. Keep stirring with a spatula and bring to somewhat boil. The mixture will keep thickening and some large bubbles will try to escape. 5 to 6 minutes total.",
    "Continue to stir and cook for another minute or 2. the mixture will visibly thicken and start to leave the pan at some places. You should be able to feel the stiffness in the mixture. Taste carefully and add sugar if needed. Mix in the vanilla and take off heat.",
    "Let it cool for a minute then pour into the prepared crust. Even it out using a spatula. Let cool for 10 minutes, then refrigerate for a few hours to overnight.",
    "Top with whipped coconut cream and serve."
  ],
  "ingredients": [
    "0",
    "¾ cup shredded coconut",
    "2 Tbsp crystallized ginger",
    "1½ cup oat flour or other flour",
    "¾ cup almond meal",
    "⅓ cup coconut sugar",
    "½ tsp ground ginger",
    "1.5 tsp cinnamon",
    "¼ tsp ground cloves",
    "¼ tsp salt",
    "2 Tbsp oil, coconut or other neutral oil",
    "1.5 Tbsp molasses",
    "⅓ cup or more maple syrup",
    "1 to 2 tsp almond milk if needed",
    "1",
    "1½ cup canned full-fat coconut milk",
    "½ cup ground raw sugar or brown sugar or coconut sugar",
    "3 Tbsp starch like arrowroot or cornstarch, tapioca doesnt work as well. reduce starch by ½ tbsp for less gelatinousness.",
    "2 Tbsp chickpea flour (or use unbleached white flour)",
    "1¼ cup Pumpkin puree (not pumpkin pie mix)",
    "1.5 to 2 tsp pumpkin spice (or use 1 tsp cinnamon, ½ tsp ginger, ¼ tsp cloves, ¼ tsp nutmeg)",
    "1 tsp oil or vegan butter",
    "1.5 tsp vanilla extract",
    "1 Gingerbread Crust (Recipe above)"
  ],
  "__v": 1
}