{
  "hash": "8717d5f5963d14a50d5d174c6420f7b260177871",
  "title": "Turmeric & Lentil Anti-Inflammatory Soup",
  "image": "http://www.energiseforlife.com/wordpress/wp-content/uploads/2014/11/turmeric-pumpkin-antiinflammation-soup.jpg",
  "href": "http://www.energiseforlife.com/wordpress/2014/11/05/alkaline-recipe-170-turmeric-inflammation-soup/?utm_content=buffer49478&utm_medium=social&utm_source=facebook.com&utm_campaign=buffer",
  "firstAdded": "2015-02-07T13:18:23.390000",
  "users": [
    null
  ],
  "keywords": [
    "soup",
    "pumpkin",
    "roughly",
    "carrots",
    "red",
    "potato",
    "tomatoes",
    "garlic",
    "mustard",
    "seeds",
    "onion",
    "stock",
    "coconut",
    "cream",
    "coriander",
    "cilantro",
    "turmeric",
    "root",
    "ginger",
    "capsicumbell",
    "pepper",
    "lentils",
    "oil",
    "cashews",
    "clove",
    "chilli"
  ],
  "directions": [
    "0",
    "Start by chopping the red onion, garlic, ginger (peeled) and turmeric (peeled) roughly.",
    "Gently heat a little coconut oil in a pan and very gently get the onion started, and once it’s cooking a little, add the turmeric, ginger, mustard seeds and garlic – being careful not to burn the garlic.",
    "Now add the root veggies (carrot, pumpkin, sweet potato), the red pepper and the tomatoes and stir it all around to coat the veggies in the oil and flavours (you should be able to smell that delicious turmeric now)",
    "Add the stock and then add the lentils. If you’re using dried lentils, you will need to add an extra 50ml of stock to allow for an additional 10 mins cooking time, but if you’re using tinned lentils (please buy organic), add them now and move onto the next step.",
    "Turn the heat down to simmer and let all of the veggies soften and the lentils cook.",
    "Once everything has softened, add the coconut cream and chopped cilantro (coriander) and then transfer to a blender and blend until smooth",
    "This will stay nice and warm for about an hour in the blender jug, but if you want, you can return to the pan to keep warm",
    "To make the optional topping (which I’ve found really nice and a delicious extra texture to the soup), simply roughly smash up the cashews on a chopping board under a knife, and cook with the pumpkin seeds in a little coconut oil with the minced garlic until it’s warmed through and a little browned.",
    "Serve the soup in bowls with a sprig of cilantro, a drizzle of coconut cream and the cashew topping (with optional chilli) and LOVE it"
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "Soup:",
    "200g Pumpkin, roughly chopped",
    "4 Carrots, roughly chopped",
    "1 Sweet Red Potato, roughly chopped",
    "4 Tomatoes, roughly chopped",
    "3 Cloves Garlic",
    "1tsp Mustard Seeds",
    "1 Red Onion",
    "300ml Vegetable Stock",
    "200ml Coconut Cream",
    "1 Handful of Fresh Coriander (Cilantro), roughly chopped",
    "1 Inch Fresh Turmeric Root",
    "1 Inch Fresh Ginger Root",
    "1/2 Red Pepper (Capsicum/Bell Pepper)",
    "1 Cup of Lentils",
    "Coconut Oil",
    "Optional Topping:",
    "1/2 Cup Cashews",
    "2 Tbsp Pumpkin Seeds",
    "1 Clove Garlic, minced",
    "Optional: thinly sliced red chilli"
  ],
  "__v": 1
}