{
  "hash": "8d1c6a37410195bb8039e385d838e82b7b9d454b",
  "title": "Pheasant Pasties",
  "image": "https://tasteofgame.org.uk/wp-content/uploads/2016/10/Pheasant-pasty-final-Copy-150x150.jpg",
  "href": "https://tasteofgame.org.uk/pheasant-pasties/",
  "extension": "Chrome",
  "firstAdded": "2016-11-24T14:37:56.420000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 375F/190c or Gas mark 5. Roast the pheasant for about 20 minutes. This will make it much easier to cut/pull the meat off it.",
    "Once the bird has cooled enough to touch, peel of all the skin and discard. Using a sharp knife or pull it apart with a fork pull off the meat both breasts, and legs. Carefully cut as much meat as possible off the legs, taking care not to include any small bones.",
    "Cut the meat into a rough dice.\nToss the meat with the juniper berries and thyme. Season with a little salt and pepper. Roll out the dough if not already rolled out, with the pastry being about 1/4” thick. Take a 6” dish, and place on the dough. Cut around the dish to form a pastry disc. Do this as many times as the pastry allows",
    "Put a layer or two of potato and turnip down – leaving a 1/2” border around the edge (room for crimping). Top with some of the pheasant meat. Add a couple of small cubes of butter (or if you are feeling very extravagant a knob of clotted cream) and sprinkle the top of the meat with a little flour. Brush the pastry edges with a little water. Bring both edges up to the top of the pasty and press the edges together tightly.\nNow for the crimping: Starting at one end of the edge. For a classic crimp, use one finger to push one side the pastry Pinch around that finger with the finger and thumb of your other hand to create a scalloped effect.",
    "Brush the outsides with a little of the beaten egg. On both sides of the pasty cut a short (1”) hole to let steam out.\nRepeat until all the meat is used up.\nThis dough recipe will make about 4 to 5 pasties. Put the pasties on a baking lined with the greaseproof paper which comes with the pastry if you buy ready rolled.\nCrank the oven up to 425F/ 220c or Gas mark 7 and bake for 20 minutes. Turn the oven down to 320F/160c or Gas mark 3 and bake for a further 40 minutes. Allow to cool slightly before eating; the insides will be really hot."
  ],
  "ingredients": [
    "0",
    "500 grams ready made short crust pastry",
    "1 pheasant",
    "2 waxy potatoes peeled and grated on the large side of a cheese grater",
    "1/2 small swede peeled and grated on the large side of a cheese grater",
    "6 juniper berries crushed",
    "8 sprigs fresh thyme leaves picked and finely chopped",
    "salt and pepper and a little flour",
    "70 grams salted butter",
    "1 egg beaten",
    "1 tbsp Cornish clotted cream optional"
  ],
  "__v": 1
}