{
  "hash": "20ae573c0a21ebffbe9a8cb40951424b744dc480",
  "title": "Thai Galangal Chicken Soup ( Tom Ka Gai)",
  "image": "http://img.sndimg.com/food/image/upload/w_555,h_416,c_fit,fl_progressive,q_95/v1/img/recipes/40/76/40/pic3fLVhc.jpg",
  "href": "http://www.food.com/recipe/thai-galangal-chicken-soup-tom-ka-gai-407640",
  "firstAdded": "2015-02-25T13:13:25.046000",
  "users": [
    null
  ],
  "keywords": [
    "soup",
    "stock",
    "base",
    "chicken",
    "glutenfree",
    "required",
    "diet",
    "galangal",
    "thickly",
    "lemongrass",
    "pieces",
    "kaffir",
    "lime",
    "leaves",
    "coriander",
    "roots",
    "stems",
    "cilantro",
    "thigh",
    "breast",
    "fillets",
    "straw",
    "mushrooms",
    "rinsed",
    "clean",
    "water",
    "coconut",
    "milk",
    "juice",
    "fish",
    "palm",
    "brown",
    "sugar",
    "loosely",
    "thai",
    "red",
    "chilies",
    "seeded"
  ],
  "directions": [
    "0",
    "Cut the lemongrass into 5 cm pieces and pound the pieces with the side of your kitchen knife to bruise them. This helps to release the flavour into the soup.",
    "Using a large saucepan- combine the stock, lemongrass pieces, galangal, whole lime leaves and coriander (cilantro) roots and stems mixture. Bring to the boil. Reduce the heat. Simmer covered for 5 minutes.",
    "Remove from the heat and allow to stand for 10 minutes.",
    "Strain the stock through muslin or a fine strainer into a large heatproof bowl. Discard the solids.",
    "Rinse your saucepan.",
    "Return your stock/soup base to the same saucepan.",
    "Add chicken and straw mushrooms. Bring to the boil. Reduce heat and simmer uncovered for 5 minutes, or until the chicken is cooked through.",
    "Stir in the coconut milk, lime juice, fish sauce and the sugar. Cook, stirring, until only just heated through. Do not boil. Remove from heat.",
    "Add the remaining ingredients- coriander (cilantro) leaves, red chillies, kaffir lime leaves and the lemon grass slices.",
    "Serve hot."
  ],
  "ingredients": [
    "0",
    "Soup or Stock Base",
    "3 cups chicken stock, gluten-free if required for diet (750ml)",
    "20 g fresh galangal, peeled and sliced thickly",
    "2 sticks fresh lemongrass, cut into 5 cm pieces",
    "4 kaffir lime leaves",
    "2 teaspoons coriander roots, and stems (cilantro)",
    "500 g chicken thigh fillets or 500 g chicken breast fillets, sliced thinly",
    "200 g straw mushrooms, drained and rinsed under clean water",
    "1 cup coconut milk",
    "4 teaspoons lime juice",
    "4 teaspoons fish sauce, gluten-free if required for diet",
    "1 teaspoon grated palm sugar or 1 teaspoon brown sugar",
    "Ingredients to add just before serving",
    "1⁄4 cup loosely packed fresh coriander leaves (Cilantro)",
    "2 fresh small thai red chilies, seeded and sliced thinly",
    "2 fresh kaffir lime leaves, shredded",
    "1 stick fresh lemongrass, sliced thinly"
  ],
  "__v": 1
}