{
  "__v": 1,
  "directions": [
    "0",
    "Куриную печенку я нарезала средними кусочками.",
    "Выложила в сковородку с разогретым маслом, сделала небольшой огонь и обжаривала до готовности (минут 7-8). Периодически помешивала, чтобы печенка равномерно прожарилась. Немного посолила и поперчила.",
    "Шампиньоны я нарезала ломтиками.",
    "Репчатый лук нашинковала полукольцами (крупную луковицу разрезала на 4 части, потом нарезала тонкими полосками).",
    "Дольки чеснока мелко порубила.",
    "Готовую куриную печенку переложила на тарелку. Готовность я проверяю так: кусочек печенки разрезаю ножом, если сок выделился прозрачный и на срезе нет красноты, печенка готова.",
    "В том же масле, которое осталось от печенки, обжарила лук и чеснок.",
    "Когда лук стал прозрачным, добавила шампиньоны, огонь сделала сильнее. Обжаривала грибы пока из них не выпарилась вся жидкость.",
    "Потом вернула печенку в сковородку, смешала с луком и грибами. Прогрела.",
    "Добавила специи. В сметане развела ложку муки, перемешала, чтобы не было комочков. Вылила в сковородку с печенкой.",
    "Все перемешала, прогрела соус и на тихом огне томила печенку еще несколько минут. В самом конце, когда уже сняла сковороду с огня, положила мелко нарезанную черемшу – она отлично дополняет вкус грибов, печенки и сметанного соуса. Я кстати уже писала, как я делала салат из черемши и рагу с черемшой.",
    "Вместо черемши можно любую зелень положить, если посчитаете нужным.",
    "На гарнир я сделала картофельное пюре. Но, я уверена, что печенка с грибами и сметаной с любым гарниром будет вкусной, хоть то гречка, хоть рис или макароны.",
    "Салат из свежих овощей тоже будет кстати, можно самый простой сделать – из капусты например, или огурцов с помидорами."
  ],
  "firstAdded": "2014-06-03T22:16:03.368000",
  "hash": "a981a82020892446f03f109a511b5a0e1eee80fe",
  "href": "http://www.vseblyuda.ru/item/274/kurinaja-pechen-s-gribami-recept-foto/",
  "image": "http://www.vseblyuda.ru/files/thumb_3236_step.jpg",
  "ingredients": [
    "0",
    "500 грамм куриной печенки",
    "300 грамм свежих шампиньонов",
    "2 крупные луковицы",
    "Сметана",
    "По щепотке базилика и орегано",
    "Две дольки чеснока",
    "Чайная ложка муки",
    "Растительное масло",
    "Соль, молотый перец по вкусу",
    "Небольшой пучок черемши (вместо нее можно любую зелень взять)"
  ],
  "keywords": [],
  "title": "куриная печень с грибами в сметанном соусе",
  "users": [
    null
  ]
}