{
  "hash": "29bd0b1300558a5d15182c6cba02129e1a77bbcc",
  "title": "Spiced Bread Pudding",
  "image": "//food.fnr.sndimg.com/content/dam/images/food/fullset/2011/4/22/0/EA1419H_spiced-bread-pudding_s4x3.jpg.rend.hgtvcom.826.620.suffix/1371597589554.jpeg",
  "href": "https://www.foodnetwork.com/recipes/alton-brown/spiced-bread-pudding-recipe-1924215",
  "extension": "Chrome",
  "firstAdded": "2019-02-06T07:17:53.731000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place the cinnamon, nutmeg, dried orange peel, cloves, peppercorns, and ginger into 3 cups of half-and-half in a microwavable container and microwave on high for 3 minutes. Check the temperature of the mixture and microwave in 30 second increments until it reaches 180 degrees F. Cover and steep 15 minutes.",
    "Place the eggs and yolks in a blender with an 8-cup carafe. Blend on the lowest speed for 30 seconds. Raise the speed to quarter power and slowly add the sugars and blend until thickened slightly, about 1 minute. Add the remaining 2 cups half-and-half. With the machine still running, pour in the spiced half-and-half through a small hand strainer and add the rum. Use immediately, or store covered in the refrigerator for up to 72 hours.",
    "Preheat the oven on the lowest (or warm) setting.",
    "Cut a 7-inch round disk off the top of the boule using a long bread knife or serrated slicer. Tear the disk into pieces and scatter in a large roasting pan. Cut all the way around the inside of the boule just inside the outer wall. Cut downward and across the interior of the bread, first in one direction, then 90 degrees to it to create a grid, the way you would cube mango flesh to remove it from the skin. Remove the plugs of bread and tear into hunks about the size of an egg. Add to the roasting pan and bake until bread is dry, 1/2 to 2 hours.",
    "Sprinkle the fruit over the bread, pour in the custard, and press the bread to submerge all the pieces. Cover and soak for 2 hours at room temperature or for up to 8 hours in the refrigerator.",
    "Preheat the oven to 325 degrees F.",
    "Pour the melted butter into a spray bottle and spritz the inside of the bread shell. Be sure to cover the bottom with a thin layer to prevent the custard from soaking through. Place the bread shell in a 10-inch cast-iron skillet and place in the oven to toast the interior for 30 minutes.",
    "Remove the bread shell from the oven and transfer the soaked bread mixture into the shell. Bake until the bread pudding souffles and reaches an internal temperature of 165 to 170 degrees F, 1 1/2 to 2 hours. Remove and cool 30 minutes before slicing or scooping and serving."
  ],
  "ingredients": [
    "0",
    "1 cinnamon stick",
    "1 teaspoon freshly grated nutmeg",
    "1 teaspoon dried orange peel",
    "15 whole cloves",
    "15 whole peppercorns",
    "1/2 ounce crystallized ginger, chopped",
    "5 cups half-and-half, divided",
    "3 large whole eggs",
    "3 large egg yolks",
    "1/2 cup granulated sugar",
    "1/2 cup dark brown sugar",
    "2 ounces spiced rum",
    "1 (10-inch) stale French boule",
    "1/2 cup golden raisins",
    "1/2 cup dried cherries",
    "1 to 2 tablespoons unsalted butter, melted and cooled slightly"
  ],
  "__v": 1
}