{
  "hash": "511533db81fc81e15ac7ce0a4111119f0fa61f4f",
  "title": "Bakery-Style Chocolate Chip Muffins",
  "image": "https://cdn.sallysbakingaddiction.com/wp-content/uploads/2013/01/bakery-style-chocolate-chip-muffins.jpg",
  "href": "https://sallysbakingaddiction.com/bakery-style-chocolate-chip-muffins/",
  "extension": "Chrome",
  "firstAdded": "2020-02-01T20:21:15.482000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 425°F (218°C). Generously grease a jumbo 6-count muffin pan with butter or nonstick spray or line with muffin liners. Set aside.",
    "Whisk the flour, baking powder, salt, cinnamon, and nutmeg together in a large bowl. Set aside.",
    "Whisk the eggs, sour cream, and sugar together until combined. Then whisk in the milk, oil, melted butter, and vanilla extract. Mixture will be pale yellow. Fold wet ingredients into dry ingredients and mix together gently. Avoid overmixing. The batter will be thick and somewhat lumpy. Fold in the chocolate chips.",
    "Divide batter among prepared muffin pan, filling all the way to the top. Sprinkle with coarse sugar (for added crunch, recommended!), if desired. Bake at 425°F for 5 minutes, then, keeping the muffins in the oven, reduce the oven temperature to 350°F (177°C) and continue to bake for 25-26 minutes until the tops are lightly golden brown and centers are set. Use a toothpick to test.",
    "Allow to cool for 10 minutes in pan before removing and serving.",
    "Cover leftover muffins and store at room temperature for 5 days or in the refrigerator for 1 week. Muffins freeze well for up to 3 months. Thaw in the refrigerator or on the counter."
  ],
  "ingredients": [
    "0",
    "3 cups (375g) all-purpose flour (spoon & leveled)",
    "4 teaspoons baking powder",
    "1/2 teaspoon salt",
    "1 teaspoon ground cinnamon",
    "1/4 teaspoon ground nutmeg",
    "2 large eggs, at room temperature",
    "1/4 cup (60g) sour cream or yogurt, at room temperature*",
    "1 cup (200g) granulated sugar",
    "1 cup (240ml) milk*",
    "1/3 cup (80ml) vegetable oil",
    "1/4 cup (60g) unsalted butter, melted and slightly cooled*",
    "1 teaspoon pure vanilla extract",
    "1 and 1/2 cups (270g) semi-sweet chocolate chips",
    "coarse sugar for sprinkling"
  ],
  "__v": 1
}