{
  "hash": "e1fadcdd334f3c54329a755540f077250f8aec1e",
  "title": "Polish Golabki (Stuffed Cabbage) [Vegan, Gluten-Free]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/01/polish.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/polish-golabki-stuffed-cabbage/",
  "extension": "",
  "firstAdded": "2015-03-25T12:54:18.597000",
  "users": [
    null
  ],
  "keywords": [
    "head",
    "cabbage",
    "onion",
    "vegan",
    "beef",
    "crumbles",
    "brown",
    "rice",
    "clove",
    "garlic",
    "salt",
    "black",
    "pepper",
    "stock",
    "raw",
    "cashews",
    "soaked",
    "hours",
    "tomatoes"
  ],
  "directions": [
    "0",
    "Heat oven to 350 degrees.",
    "Remove core from cabbage. Place whole head in a large pot filled with boiling, salted water. Cover and cook 15-20 minutes, or until softened enough to pull off individual leaves. You will need about 12 leaves.",
    "While cabbage is cooking, prepare tomato sauce. Combine cashews, whole peeled tomatoes, salt and pepper in a blender and puree until smooth. Transfer sauce to medium-sized sauce pot and heat on medium until it simmers.",
    "When leaves are cool enough to handle, use a paring knife to cut away the thick center stem from each leaf, without cutting all the way through.",
    "Chop the remaining cabbage and place it in the bottom of a casserole dish.",
    "Add the chopped onion to a non-stick skillet. When onions start to stick, add 1 tbsp of vegetable stock or water and stir. Saute onions until translucent, adding small amounts of vegetable stock or water if onions start to stick. While onions are cooking, prepare Neat according to package directions. Add Neat Original Mix to a non-stick skillet and brown on medium, breaking it up as you would meat, for seven minutes or until browned.",
    "Mix onions with Neat, cooked brown rice, garlic, salt and black pepper until well combined.",
    "Place about ½ cup of filling on each cabbage leaf. Roll away from you to encase the filling. Flip the right side of the leaf to the middle, then flip the left side. You will have something that looks like an envelope. Once again, roll away from you to create a neat little roll.",
    "Place the cabbage rolls on top of the chopped cabbage in the casserole dish. Pour vegetable stock over rolls, ladle tomato sauce on top and cover. Place in oven and bake for 45 minutes.",
    "Serve cabbage rolls with pan juices and tomato sauce."
  ],
  "ingredients": [
    "0",
    "1 whole head cabbage",
    "1 large onion, chopped",
    "1 package vegan beef crumbles",
    "1½ cups cooked brown rice",
    "1 clove garlic, chopped",
    "1 teaspoon salt",
    "¼ teaspoon black pepper",
    "1 cup vegetable stock",
    "1",
    "¼ cup raw cashews, soaked for 2-4 hours",
    "1 (28) oz. can whole peeled tomatoes",
    "¼ tsp salt",
    "⅛ tsp black pepper"
  ],
  "__v": 1
}