{
  "hash": "93ee7f38ec26b1dd8206385c2603af737fb7716e",
  "title": "PARSLEY PESTO PASTA WITH PEAS",
  "image": "https://www.budgetbytes.com/wp-content/uploads/2019/03/Parsley-Pesto-Pasta-with-Peas-plate-close-200x200.jpg",
  "href": "https://www.budgetbytes.com/parsley-pesto-pasta-with-peas/",
  "extension": "Chrome",
  "firstAdded": "2019-04-17T14:05:42.557000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Rinse the parsley well to remove any dirt or debris, then pat it dry with a clean, lint-free towel. Cut off the ends of the parsley stems and place the rest, leaves and stems, in the bowl of a food processor.",
    "Zest and juice the lemon. Add half of the zest and about 2 Tbsp of the juice to the food processor, along with the Parmesan, garlic cloves (peeled), and some freshly cracked pepper (about 15 cranks of a pepper mill).",
    "Pulse the mixture until everything is finely minced and combined. Begin to add the olive oil in a thin stream through the chute of the processor as it blend the mixture together. Once the oil has been incorporated, add salt to taste. I added about 1/4 tsp salt.",
    "Bring a pot of water to a boil for the pasta. Once boiling, add the pasta and continue to boil until the pasta is al dente. At the very end of the cook time, add the frozen peas and stir to combine. Let the peas sit in the hot water with the pasta for about a minute, then drain the pasta and peas in a colander.",
    "Allow the pasta to cool just to the point where it is no longer steaming heavily. Transfer the drained pasta to a bowl and add the parsley pesto. Stir to combine, then serve warm. Add a pinch of the remaining lemon zest over top of each serving."
  ],
  "ingredients": [
    "0",
    "1 bunch flat leaf Italian Parsley (about 2-3 cups, loosely packed)",
    "1 fresh lemon",
    "1/2 cup grated or shredded Parmesan",
    "2 cloves garlic",
    "salt and pepper",
    "1/4 cup olive oil",
    "1 lb. pasta",
    "1 cup frozen peas"
  ],
  "__v": 2
}