{
  "hash": "61a743443931fed38035e5593b7518ec58356d57",
  "title": "ROASTED VEGETABLE STUFFED SHELLS",
  "image": "http://www.twopeasandtheirpod.com/wp-content/uploads/2014/08/Roasted-Vegetable-Stuffed-Shells-6.jpg",
  "href": "http://www.twopeasandtheirpod.com/roasted-vegetable-stuffed-shells/",
  "extension": "Chrome",
  "firstAdded": "2016-02-25T23:26:10.225000",
  "users": [
    null
  ],
  "keywords": [
    "red",
    "bell",
    "pepper",
    "eggplant",
    "zucchini",
    "olive",
    "oil",
    "salt",
    "black",
    "jumbo",
    "pasta",
    "shells",
    "use",
    "delallo",
    "extra",
    "case",
    "break",
    "ricotta",
    "cheese",
    "egg",
    "mozzarella",
    "divided",
    "parmesan",
    "frozen",
    "spinach",
    "thawed",
    "basil",
    "oregano",
    "nutmeg",
    "marinara",
    "desired"
  ],
  "directions": [
    "0",
    "DIRECTIONS:",
    "1. Preheat oven to 400 degrees F. Place the diced red pepper, eggplant, and zucchini on a large baking dish. Drizzle with olive oil and toss. Season with salt and pepper. Roast for 20 minutes, or until veggies are tender, stirring once. Remove from oven and set aside. Turn the oven down to 350 degrees F.",
    "2. Cook the pasta al dente, according to package directions. Drain and place the shells on large plate or cutting board so they are not touching. This will prevent them from sticking together.",
    "3. Meanwhile, in a large bowl, stir together ricotta, egg, 1/2 cup of the mozzarella cheese, Parmesan cheese, spinach, roasted veggies, basil, and oregano. Season with salt and black pepper, to taste.",
    "4. Pour 1 cup of the marinara sauce into the bottom of 9 x 13 baking dish. Stuff each pasta shell with a generous amount of the roasted veggie ricotta mixture, and place in the baking dish.",
    "5. Cover shells with the remaining sauce and sprinkle remaining mozzarella cheese over the top. Bake covered with aluminum foil for 25 minutes. Remove the foil and continue baking until the top begins to brown and the sauce begins the bubble, another 10-15 minutes. Garnish with fresh basil, if desired, and serve warm.",
    "Note-For easier filling, fill a gallon ziplock bag with the roasted veggie ricotta filling and cut a hole off the corner of the bag. Pipe the filling into the shells. The stuffed shells freeze well. I like to bake the pan, let them cool, and then put them in a freezer container. Reheat when ready to eat!"
  ],
  "ingredients": [
    "0",
    "INGREDIENTS:",
    "1 red bell pepper, diced",
    "1 small eggplant, diced",
    "1 small zucchini, diced",
    "1 tablespoon olive oil",
    "Salt and black pepper, to taste",
    "21 jumbo pasta shells (we use DeLallo and I always cook a few extra in case they break)",
    "15 oz ricotta cheese",
    "1 large egg",
    "1 1/2 cups shredded mozzarella cheese, divided",
    "1/4 cup grated Parmesan cheese",
    "1/2 cup frozen chopped spinach, thawed and drained",
    "1/4 teaspoon dried basil",
    "1/4 teaspoon dried oregano",
    "Pinch of nutmeg",
    "Salt and black pepper, to taste",
    "2 1/2 cups marinara sauce",
    "Chopped fresh basil, for garnish, if desired"
  ],
  "__v": 1
}