{
  "__v": 1,
  "directions": [
    "0",
    "Method",
    "1. Wrap the salmon in clingfilm and place in the freezer for 30 minutes (this will firm it up and make it easier to slice).",
    "2. Carefully remove the peel from each orange by first slicing off the top and bottom and then running the knife around the curve of the fruit. Now slice out the segments into a bowl (they will come away without the pith), and squeeze the juice from the membranes into another bowl.",
    "3. Pod the peas and discard the pods. Halve the pomegranate and tap the halves on a board to remove the seeds.",
    "4. Pick over, wash and dry the pea shoots.",
    "5. Cook the peas in boiling salted water for three minutes. Drain and chill under cold running water. Put half of the cooked peas into a blender, add the crème fraîche and season well with salt and pepper, then blend to a smooth purée for two minutes.",
    "6. Remove the salmon from the freezer. Using a sharp knife, slice the fish thinly through the flesh against the grain – allow five slices per person. Lay the slices flat on a tray.",
    "7. Add the olive oil to the orange juice with some salt and pepper and mix thoroughly to make a vinaigrette.",
    "8. Just five minutes before serving, brush some of the vinaigrette all over the salmon and toss the pea shoots quickly in the remainder."
  ],
  "firstAdded": "2014-06-26T10:47:43.631000",
  "hash": "4b00fc0ea8606d94ef57bdc4137a8b488de59d08",
  "href": "http://www.redonline.co.uk/food/recipes/citrus-cured-salmon-with-english-peas",
  "image": "http://assets.redonline.co.uk/var/ezflow_site/storage/images/media/banners/article-banners/food/recipe-pics/salad-of-citrus-cured-salmon-with-english-peas/2418385-1-eng-GB/salad-of-citrus-cured-salmon-with-english-peas_article_banner_img.jpg",
  "ingredients": [
    "0",
    "Serves: 4",
    "Preparation time: 1 hour",
    "Cooking time: 3 minutes",
    "You will need350g fillet skinless salmon",
    "2 blood oranges or 1 small pink grapefruit 300g fresh English peas in the pod 1 pomegranate 80g pea shoots Sea salt and freshly ground black pepper 100ml crème fraîche 100ml good-quality olive oil"
  ],
  "keywords": [
    "serves",
    "preparation",
    "time",
    "hour",
    "cooking",
    "minutes",
    "needg",
    "fillet",
    "skinless",
    "salmon",
    "blood",
    "oranges",
    "pink",
    "grapefruit",
    "english",
    "peas",
    "pod",
    "pomegranate",
    "pea",
    "shoots",
    "salt",
    "black",
    "pepper",
    "crme",
    "frache",
    "goodquality",
    "olive",
    "oil"
  ],
  "title": "Citrus-Cured Salmon with English Peas",
  "users": [
    null
  ]
}