{
  "hash": "0dce75884fc39a9bebf57de658d0aabc1946295f",
  "title": "Moroccan-Spiced Roasted Eggplant & Tomatoes (ZAALOUK-inspired)",
  "image": "https://minimalistbaker.com/wp-content/uploads/2018/09/DELICIOUS-Moroccan-Spiced-Roasted-Eggplant-Tomato-Stew-10-ingredients-simple-preparation-BIG-flavor-glutenfree-dinner-vegan-eggplant-minimalistbaker-recipe-6.jpg",
  "href": "https://minimalistbaker.com/moroccan-spiced-eggplant-and-tomato-stew/",
  "extension": "Firefox",
  "firstAdded": "2018-12-03T08:37:50.958000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 425 degrees F (218 C) and line a large baking sheet with parchment paper.",
    "Add diced eggplant, drizzle with avocado or olive oil, and sprinkle with salt. Toss to coat and roast for 30-35 minutes, flipping / tossing near the 20-minute mark.",
    "In the meantime, heat a large rimmed pan or pot over medium heat. Once hot, add oil (or water) and onions. Sauté for 4-5 minutes, stirring frequently, or until soft and slightly caramelized.",
    "Add garlic, cumin, and paprika and stir to coat. Cook for 1 minute more.",
    "Add tomatoes and their juices as well as water (or vegetable broth). Cover and bring to a simmer over medium heat. Cook for 4 minutes to allow the flavors to develop.",
    "Remove cover and add (rinsed, drained) chickpeas (optional), maple syrup, and harissa paste and stir to coat. Cover and simmer over medium-low heat.",
    "Remove roasted eggplant from oven, turn oven off, and add eggplant to the tomatoes and chickpeas. Stir to combine and cover. Simmer over medium-low / low heat for another 10 minutes to allow flavors to deepen.",
    "Taste and adjust flavors as needed, adding more maple syrup to balance the heat, cumin, or paprika for smokiness, salt to taste, or harissa paste for spice.",
    "Serve as is or over rice or grain of choice (or pasta or roasted vegetables) with wedges of fresh lemon and fresh chopped parsley or cilantro. Additional harissa paste can be added as garnish for additional heat.",
    "Store completely cooled leftovers in the refrigerator up to 5 days or in the freezer up to 1 month. Reheat on the stovetop, adding more water or vegetable broth as needed to rehydrate."
  ],
  "ingredients": [
    "0",
    "EGGPLANT",
    "1 large (~550 g) eggplant (unpeeled and cut into bite-size pieces // ~7 cups cubed eggplant as the recipe is written)",
    "2 Tbsp olive or melted coconut oil (if avoiding oil, omit)",
    "½ tsp sea salt",
    "THE REST",
    "2 Tbsp olive or coconut oil (if avoiding oil, sub water)",
    "1 large white or yellow onion (thinly sliced)",
    "3 cloves garlic (minced)",
    "1 Tbsp ground cumin",
    "1 Tbsp smoked paprika",
    "¼ tsp sea salt (plus more to taste)",
    "2 14.5-oz cans diced fire-roasted tomatoes",
    "1/2 cup water (or vegetable broth)",
    "1 cup cooked chickpeas (optional // well rinsed and drained // or sub cooked lentils)",
    "1 Tbsp maple syrup or coconut sugar",
    "2 Tbsp harissa paste (or sub another favorite hot sauce or chili garlic sauce)",
    "FOR SERVING optional",
    "Cilantro or parsley",
    "White rice, brown rice, or quinoa (or sub cauliflower rice* for grain-free)",
    "Fresh lemon"
  ],
  "__v": 1
}