{
  "hash": "c67218018c82ee36f6f18fe776ba8bc55391d6e4",
  "title": "Murgh Channay/ Murgh Chholay",
  "image": "https://ayeshahaq.files.wordpress.com/2013/05/20130513_183655.jpg?w=535&h=401",
  "href": "https://ayeshahaq.com/2013/05/19/murgh-channay-murgh-chholay/",
  "extension": "Chrome",
  "firstAdded": "2018-08-26T14:50:28.934000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "-In a large saucepan with a lid, put soaked chickpeas with water, baking soda, cumin powder, garam masala and salt and boil covered until the chickpeas are very tender.",
    "-Meanwhile they are boiling, in a separate large, deep pan, melt butter; add oil, ginger, garlic, red chilli flakes and chaat masala and fry. Add onion and fry until onion are golden brown.",
    "-Add chicken and cook until the chicken is golden. Now add 1 cup of water and all the spices except garam masala.",
    "-When the chicken is tender and very little water remains, add chickpeas with the water we used for boiling and stir.",
    "-Cook on low heat to simmer.",
    "-Top with some garam masala, coriander and chillies and serve hot with chapattis, naan, dahi, and red onion salad."
  ],
  "ingredients": [
    "0",
    "serves lots try 3rd",
    "3 ½ cups chickpeas/ 3 tins boiled chickpeas (I prefer uncooked dry chickpeas, soak them overnight in a deep mixing bowl with lots of water and they will be fine, ready to boil in the morning)",
    "2 medium sized onions (sliced)",
    "100g butter (optional, when I am making fancy fancy I top my dish with a small scoop of butter otherwise I prefer olive oil)",
    "¼ cup oil",
    "1 tbspn ginger (freshly crushed)",
    "1 tbspn garlic (minced)",
    "2 green chillies",
    "2 tbspns coriander leaves (chopped)",
    "Salt",
    "1 tspn red chilli flakes",
    "1 tbspn chaat masala",
    "1 tspn garam masala",
    "1 tspn cracked black pepper",
    "1 tspn coriander powder",
    "1 tspn cumin seeds",
    "1 tspn chicken salt (reduce the amount of salt if you are adding this or chicken cube)",
    "1 kg chicken pieces"
  ],
  "__v": 2
}