{
  "hash": "ea3237868ca6cd87c9d14dff76a9fafb6d13c2c9",
  "title": "Amazing Stuffed Cabbage Rolls",
  "image": "http://i2.wp.com/parsleysagesweet.com/wp-content/uploads/2010/10/cab1.jpg?resize=358%2C320",
  "href": "http://www.parsleysagesweet.com/2010/10/13/stuffed-cabbage-like-grandma-used-to-make/",
  "extension": "Chrome",
  "firstAdded": "2015-11-08T15:21:04.698000",
  "users": [
    null
  ],
  "keywords": [
    "head",
    "green",
    "cabbage",
    "beef",
    "eggs",
    "necessary",
    "leave",
    "make",
    "meat",
    "fluffier",
    "medium",
    "onion",
    "garlic",
    "salt",
    "black",
    "pepper",
    "raw",
    "longgrain",
    "white",
    "rice",
    "butter",
    "oil",
    "clove",
    "dice",
    "tomato",
    "tomatoes",
    "pulsed",
    "food",
    "processor",
    "juice",
    "pureed",
    "lemon",
    "apple",
    "cider",
    "vinegar",
    "light",
    "depending",
    "sweetness",
    "start",
    "adding",
    "sweeter",
    "prefer",
    "completely",
    "savory",
    "brown",
    "sugar",
    "golden",
    "raisins",
    "parsley"
  ],
  "directions": [
    "0",
    "Fill a large pot with water and bring it to a rolling boil. When the water comes to a boil, fill a large bowl with ice water. Cut out as much of the core as you can from the bottom of the cabbage, then drop the whole, cored head into the boiling water for 3 to 4 minutes. Once the leaves separate and are pliable, immediately remove and drop the blanched leaves that separated (keep the pot of water boiling) in the ice water. Once cooled down, remove and pat the leaves dry. Repeat with any leaves still attached to the head and not pliable, until you've gotten all the leaves off the head, and they are all soft and pliable.Alternatively, If you've got time on your hands, you can freeze the wrapped head of cabbage for two days then defrost. The leaves will peel off easily and be soft enough to roll.Here's some other ideas from readers, although I have yet to try them so I cannot confirm that they work.Place the cabbage in the microwave for 6 minutes. The core will slip right out and the leaves will be perfect for rolling. 2. Throw the whole, uncored head of cabbage into the boiling water. The leaves won't separate on their owm, but should be easy to peel off.",
    "Set aside about 16 of the largest leaves (these will be your cabbage rolls) and slice off any thick parts of the vein on each of them, being careful not to cut a hole in the leaves, so slice from the top. Chop some of the remaining cabbage leaves to make 1 cup of chopped cabbage, and reserve.",
    "Mix the ground beef with the eggs, grated onion, garlic, salt, pepper, and rice. (If you use cooked rice, you can test the seasoning of the meat mixture to your liking by frying up or microwaving a piece of it and tasting, if desired). Divide this mixture into sixteen 2-ounce balls. Using moistened hands, form the balls into cylinders. Place a cylinder of filling near the bottom of a cabbage leaf (if the vein in the leaf is really thick, shave it down with a knife before placing the beef on it, being careful not to cut through the leaf itself.). Begin to roll it up, folding both sides over the filling, and finish rolling to enclose the filling, like an eggroll. Continue, filling and rolling all the cabbage leaves. Place them, seam side down, on a tray or baking sheet. Cover and refrigerate until ready to use.",
    "Over medium heat, melt the butter in a heavy, nonreactive saucepan. Sauté the second onion until soft and golden. Add the garlic and saute for 2 more minutes, then add the reserved 1 cup chopped cabbage and sauté for about 30 seconds to 1 minute more.",
    "Add the tomato sauce, lemon juice, brown sugar, salt and pepper to taste, and stir to combine. Increase the heat until it comes to a boil, then lower it and simmer for 5 minutes. Add raisins now, if using.",
    "Line of the bottom of a 13 x 9 roasting pan or glass dish with a layer of sauce. Place cabbage rolls, seam side down, on top of sauce. Top cabbage rolls with remaining sauce then cover the whole pan with tin foil. Bake for 2 hours in a preheated 350F oven."
  ],
  "ingredients": [
    "0",
    "1 large head green cabbage, about 2 to 2¼ pounds",
    "2 pounds ground beef",
    "2 eggs (not necessary, you can leave them out, but they do make the meat fluffier)",
    "1 medium onion, grated or minced",
    "2 garlic cloves, minced",
    "2 teaspoons salt",
    "1 teaspoon black pepper",
    "½ cup raw long-grain white rice *",
    "1",
    "2 tablespoons butter or vegetable oil",
    "1 clove garlic, finely chopped",
    "1 medium onion, chopped (medium dice)",
    "2 15-ounce cans tomato sauce or one 32-ounce can whole tomatoes, pulsed in a food processor with juice until pureed.",
    "juice of one lemon or 2 tablespoons (or more to taste) apple cider vinegar",
    "¼ to ¾ cup light brown sugar (Depending on amount of sweetness you prefer. Start with ¼ cup and taste sauce, adding if you like it sweeter. If you prefer it completely savory, add only 1 tablespoon brown sugar and the juice from half a lemon)",
    "Salt and pepper to taste",
    "½ cup golden raisins (optional)",
    "Chopped parsley, for garnish"
  ],
  "__v": 1
}