{
  "hash": "dc73a7081f39d72ee877eaa2fa47a4c94a15a2b7",
  "title": "NO-BAKE PEANUT BUTTER PIE",
  "image": "https://realhousemoms.com/wp-content/uploads/No-Bake-Peanut-Butter-Pie-Easy-Dessert-Recipe-HERO.jpg",
  "href": "https://realhousemoms.com/no-bake-peanut-butter-pie/",
  "extension": "Chrome",
  "firstAdded": "2019-05-24T21:36:28.980000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Crust:",
    "Preheat oven to 325°F (see notes for no-bake option). Combine graham cracker crumbs, brown sugar and salt. Add melted butter and stir until well combined. Dump the crumbs into a 9 or 9 ½ inch pie plate. Firmly press the crumbs into the bottom and up the sides of the pie plate. Use the bottom of a glass or measuring cup to pack it in.",
    "Bake the crust for 8-10 minutes, until golden brown and fragrant. Cool to room temperature.",
    "Filling:",
    "Using a hand mixer, or stand mixer, whip the heavy cream, ⅔ cup powdered sugar and vanilla until stiff peaks form. Transfer bowl to the refrigerator.",
    "In a separate bowl, beat cream cheese, peanut butter and remaining ⅔ cup powdered sugar until smooth and combined. Add a little more than half (eyeball it) of the chilled whipped cream to the peanut butter mixture. Beat briefly, until just combined. Place the remaining whipped cream back in the fridge, as this will be for topping the pie. Pour the peanut butter mixture into the crust and smooth the top. Cover and refrigerate for at least 4 hours, until firm.",
    "To serve: Top the pie with the remaining whipped cream. Sprinkle with peanuts and graham cracker crumbs. Serve with hot fudge sauce and melted peanut butter, for drizzling."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Crust",
    "1 ½ cups graham cracker crumbs",
    "3 tablespoons brown sugar",
    "Pinch salt",
    "6 tablespoons unsalted butter melted",
    "Filling",
    "2 ¼ cups heavy whipping cream chilled",
    "1 ⅓ cups powdered sugar divided",
    "½ teaspoon pure vanilla extract",
    "8 ounces cream cheese at room temperature",
    "1 cup creamy peanut butter at room temperature"
  ],
  "__v": 1
}