{
  "hash": "14ca3d14a08ad5d86a2ef4cb64930d8f00a7d65a",
  "title": "Pizza Burgers",
  "image": "",
  "href": "http://www.delish.com/cooking/recipe-ideas/recipes/a47675/pizza-burgers-recipe/",
  "extension": "Chrome",
  "firstAdded": "2017-02-06T14:20:31.607000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "Preheat oven to 350 degrees F.",
    "In a medium bowl, combine ground beef, garlic and parsley. Mix with spatula until just combined. Using your hands, form 4 equally-sized patties. Season both sides with salt and pepper to taste",
    "Heat oil in a large skillet over medium-high heat. Add the burgers and cook for 4 to 5 minutes (for medium). Flip the patties, then immediately pour marinara around them in the pan. Simmer for another minute, then top each with cheese and 2 slices of pepperoni. Cover pan and cook until the cheese melts and the burger is cooked to your liking, about 3 minutes more.",
    "Meanwhile, make garlic buns. Brush melted butter on each half of the rolls. Sprinkle both sides with garlic powder, Italian seasoning, and parmesan. Bake until golden, about 10 minutes.",
    "Spread a dollop of marinara on each bottom bun followed by cooked burgers and the top bun halves.",
    "MORE RECIPES LIKE THIS",
    "Home-Ground Burgers With Bacon, Cheese, And Fresh Thyme",
    "Smoky Tuna And Bacon Burgers With Lemongrass Aioli",
    "Cheddar BLT Burgers With Tarragon Russian Dressing",
    "Double-Decker Burgers With Goat Cheese",
    "Turkey Burgers",
    "SPONSORED ADS FROM THE WEB",
    "Macomb: This Meal Service is Cheaper Than Your Local Store",
    "Home Chef",
    "The Most Addicting Shopping Site For Women",
    "Tophatter",
    "4 Things I Discovered After Wearing MeUndies For A Month",
    "AskMen | MeUndies",
    "We Tried Blue Apron: Here's What Happened",
    "Blue Apron",
    "Macomb, Illinois Residents Wish They Knew This Earlier",
    "EverQuote Insurance Quotes",
    "by Taboola Sponsored Links",
    "MORE FROM",
    "RECIPES",
    "Garlic Butter Shrimp Pasta",
    "Insanely Easy Weeknight Dinners To Try This Week",
    "Skillet Slutty Brownie",
    "Nutella Stuffed Pancakes",
    "slow-cooker-pulled-pork-recipe",
    "Ramen Carbonara",
    "The 68 Most Delish Foods On A Stick",
    "43 Stupid-Easy Desserts That Only Look Impossible",
    "76 Awesome No Bake Desserts",
    "37 Amazing Things To Do With Crescent Rolls",
    "MEALS & COOKING RECIPES BURGER RECIPES SMOKY TUNA AND BACON BURGERS WITH LEMONGRASS AIOLICHEDDAR BLT BURGERS WITH TARRAGON RUSSIAN DRESSINGDOUBLE-DECKER BURGERS WITH GOAT CHEESETURKEY BURGERSTABBOULEH-STYLE COUSCOUS WITH VEGGIE BURGERSHOME-GROUND BURGERS WITH BACON, CHEESE, AND FRESH THYME",
    "MORE FROM RECIPES",
    "NewsletterAbout UsPress RoomContact UsBestProductsCommunity GuidelinesAdvertise OnlineAbout Our AdsBeing GreenWhy Did I Get This Ad?",
    "A PART OF HEARST DIGITAL MEDIA",
    "©2017 Hearst Communications, Inc. All Rights Reserved.Privacy PolicyYour California Privacy RightsTerms of UseSite Map",
    "Select Directions",
    "(note: you can drag this box around to make it easier to highlight the recipe)",
    "Please highlight the directions for this"
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1 lb. ground beef",
    "2 garlic cloves, chopped",
    "1/4 c. chopped parsley",
    "kosher salt",
    "Freshly ground black pepper",
    "2 tbsp. vegetable oil",
    "4 slices mozzarella",
    "8 pepperoni slices",
    "2 c. jarred marinara",
    "4 Italian rolls (or hamburger buns)",
    "2 tbsp. melted butter",
    "2 tsp. garlic powder",
    "1 tsp. Italian seasoning",
    "1/4 c. grated Parmesan"
  ],
  "__v": 1
}