{
  "hash": "e7dbc95d99690c3d1cba14fcfdd9dc70c3c39e99",
  "title": "millionaire bars",
  "image": "https://chelsweets.com/wp-content/uploads/2019/10/bite-with-stack-2-735x1103.jpg",
  "href": "https://chelsweets.com/2019/11/11/millionaire-bars/",
  "extension": "Chrome",
  "firstAdded": "2020-02-19T10:05:33.761000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "- Shortbread Butter Cookie Base:",
    "Preheat oven to 325 degrees. Line a 9 x 13 inch baking pan with parchment paper, and spray with non-stick cooking spray.",
    "Stir together the melted butter, sugar, brown sugar, and salt in a large bowl.",
    "Stir in the flour in two additions.",
    "Gently mix ingredients until the dough just starts to hold together. Be careful not to over mix, and stir until the ingredients are just combined.",
    "Spread the dough evenly into the prepared pan, and prick thoroughly with a fork.",
    "Bake for 25 minutes (until the edges are golden brown). Set aside to cool.",
    "- Caramel Filling",
    "While the shortbread base bakes, make the millionaire bar filling.",
    "Heat the butter, brown sugar and sweetened condensed milk over medium heat in a heavy saucepan.",
    "Stir frequently, and allow the mixture come to a gentle boil.",
    "Once this happens, turn the heat down to allow the caramel to simmer.",
    "Continue to stir frequently until the mixture thickens and becomes a medium caramel color (about 10 minutes).",
    "Remove from the heat, and stir in the vanilla extract.",
    "Pour the filling over the cooled cookie base, and spread evenly.",
    "Let this cool completely before adding the chocolate topping (or place in the freezer for 20 minutes to accelerate the cooling process).",
    "- Chocolate Ganache Topping",
    "As the caramel filling cools, make the chocolate ganache topping topping.",
    "Place the milk chocolate chips in a heatproof bowl, and the white chocolate chips in a separate heatproof bowl.",
    "Add 1 Tbsp of butter to the bowl with milk chocolate chips, and add 1/2 Tbsp of butter to the bowl with white chocolate chips.",
    "Heat 1 cup of heavy cream in a heatproof bowl in the microwave for 45 seconds to 1 minute, until gently bubbling.",
    "If you don’t have a microwave or prefer to use the stove top, you can heat the cream over a medium heat in a pan until it begins to simmer. Remove from heat.",
    "Carefully pour 3/4 cup of the hot heavy cream over the milk chocolate chips, and the remaining 1/4 cup of heavy cream over the white chocolate chips.",
    "Make sure the chocolate is fully covered with cream. Allow mixture to sit for 1-2 minutes.",
    "Stir slowly until the cream and chocolate are fully combined, and the ganache is silky smooth.",
    "Pour the milk chocolate ganache over the cooled caramel filling. Spoon drops of the white chocolate ganache on top of the milk chocolate ganache, and swirl using a butter knife.",
    "Set aside to fully cool, then cut and enjoy!"
  ],
  "ingredients": [
    "0",
    "- Butter Cookie Base",
    "1/2 cup white sugar (100 grams)",
    "2 Tbsp packed light brown sugar (25 grams)",
    "1/4 tsp table salt (2 grams)",
    "2 1/4 cups flour (293 grams)",
    "1 cup unsalted butter, melted (226 grams)",
    "- Caramel Filling",
    "1/2 cup unsalted butter, cut into chunks (113 grams)",
    "1/2 cup light brown sugar (100 grams)",
    "1 (14 oz.) can sweetened condensed milk (396 grams)",
    "1 tsp vanilla extract (4 grams)",
    "- Chocolate Ganache Topping",
    "1 cup heavy cream (230 grams)",
    "1 1/2 cups milk chocolate (263 grams)",
    "1/2 cup white chocolate (88 grams)",
    "1 1/2 Tbsp unsalted butter (22 grams)"
  ],
  "__v": 3
}