{
  "hash": "56cb5578887f7acc4558a3868843685b3c57ae0a",
  "title": "Sweet Potato and Black Bean Tacos",
  "image": "http://assets.simplyrecipes.com/wp-content/uploads/2016/10/sweet-potato-black-bean-tacos-vertical-a-1600.jpg",
  "href": "http://www.simplyrecipes.com/recipes/sweet_potato_and_black_bean_tacos/",
  "extension": "Chrome",
  "firstAdded": "2016-11-20T20:28:52.182000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Preheat oven to 425F.",
    "2 Roast the sweet potatoes: In a medium-sized bowl, toss the sweet potatoes, 2 tablespoons oil, salt, cumin, and chili powder. Spread on a baking sheet in an even layer. Bake 15 minutes, then use a spatula to flip and stir the sweet potatoes. Roast another 15 minutes or until sweet potatoes have puffed up and have crisp, roasted edges.",
    "3 Make the black beans: While the sweet potatoes roast, heat 2 tablespoons oil in a medium saucepan over medium heat. Add the onions and salt, and sauté until soft and translucent, 5 to 7 minutes. Add the garlic and jalapeño, and sauté 2 minutes more. Fold in beans. Cook, stirring occasionally, until the beans are soft and seasoned, about 10 to 15 minutes. If beans seem dry or bottom of pan starts to sizzle, add a splash of apple cider vinegar or water as needed. Taste and add salt as needed.",
    "4 Warm the tortillas: Briefly heat the tortillas one or two at a time in a dry skillet until warm. Transfer to a plate and cover with a towel to keep warm. Alternatively, warm a stack of 5 or fewer tortillas a time in the microwave, covered with a damp paper towel, in 30 second bursts until warmed through.",
    "5 Serve the tacos: Layer tacos with sweet potatoes and black beans. Serve with avocado slices, salsa, minced cilantro, and cotija cheese, letting everyone top their own tacos."
  ],
  "ingredients": [
    "0",
    "1 to 2 medium sweet potatoes, cut into 1/2-inch cubes (about 2 cups cubed)",
    "2 tablespoons neutral cooking oil (such as grapeseed or canola)",
    "1/2 teaspoon kosher salt",
    "1 teaspoon chili powder",
    "1/2 teaspoon ground cumin",
    "2 tablespoons neutral cooking oil (such as grapeseed or canola)",
    "1/2 medium yellow onion, diced (about 1/2 cup diced)",
    "1 teaspoon kosher salt",
    "1 clove garlic, minced",
    "1 jalapeño, stemmed, seeded, and minced",
    "1 15-ounce can black beans, drained and rinsed",
    "Apple cider vinegar or water, as needed",
    "10 to 12 corn tortillas",
    "1/2 cup tomatillo salsa verde, homemade or store-bought",
    "1 ripe avocado, sliced thin",
    "Fresh cilantro, roughly chopped",
    "Lime wedges",
    "1/4 cup crumbled cotija cheese"
  ],
  "__v": 1
}