{
  "hash": "c127ab3645a0cdb1cf59190d24f9fc32fe9cf588",
  "title": "Butternut Squash with Browned Butter and Thyme Recipe",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2008/11/butternut-squash-thyme.jpg",
  "href": "http://www.simplyrecipes.com/recipes/butternut_squash_with_browned_butter_and_thyme/#5083304170da80301b000002",
  "keywords": [
    "butternut",
    "squash",
    "seeds",
    "flesh",
    "pieces",
    "butter",
    "thyme",
    "salt",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "Heat a large skillet on medium heat. Add the butter, whisking frequently. Continue to cook the butter. Once melted it will foam up a bit, then subside. Honey-colored browned milk solids will begin to form. The butter should have a wonderful nutty aroma. Remove from heat. Add the thyme, whisking continuously. If using fresh thyme, the mixture will foam up a bit.",
    "(Note that it doesn't take much time to go from browned butter to burnt butter. You will want to remove the pan from the heat element and place it on a cool surface to help stop the cooking of the butter. If the butter burns, I recommend dumping it and starting over, something I've had to do on occasion when not paying close attention.)",
    "Add the cubed butternut squash pieces to the pan and return the pan to the burner, heating to medium high. Use a wooden or metal spoon to stir the squash pieces so they are all well coated with the butter thyme mixture. Sprinkle generously with salt and pepper. Spread the squash pieces out in an even layer and let cook, without stirring, so that they brown a bit on one side (several minutes). Stir and spread the pieces out again and let cook without stirring so more sides get browned.",
    "Reduce the heat to low, cover the pan, and let cook until the squash is tender, 10 to 20 minutes, depending on how big you cut the pieces.",
    "Add more salt and pepper to taste, sprinkle with a bit more chopped fresh thyme before serving."
  ],
  "ingredients": [
    "0",
    "1 1/2 pounds butternut squash, peeled, seeds removed, flesh diced into 1/2-inch pieces (about 4 cups)",
    "3 Tbsp butter",
    "1 Tbsp chopped fresh thyme (or 1 teaspoon of dried)",
    "Salt and freshly ground black pepper"
  ],
  "__v": 0
}