{
  "hash": "4f8a3e4706e63c61a21868dca9d124812b87ae0f",
  "title": "SWISS CHARD AND TOMATO LINGUINE WITH BALSAMIC GLAZED CHICKPEAS",
  "image": "",
  "href": "http://www.thugkitchen.com/swiss_chard_tomato_linguine_balsamic_glazed_chickpeas",
  "extension": "Chrome",
  "firstAdded": "2016-11-06T02:00:14.901000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "First, put on a big pot of water and cook the pasta according to the package direction. Simple shit.",
    "Next, in a large stockpot warm up the olive oil over a medium heat for the chickpeas. Yeah, it seems kinda big but we’re gonna use that shit for the sauce in a bit and we’re too fucking lazy to have multiple dirty pots. Add the chickpeas and sauté that shit for 2-3 minutes or until the chickpeas are all warmed up and starting to sizzle. Pour over the balsamic and continue gently stirring until most of the liquid has evaporated, another 2-3 minutes. Sprinkle over the garlic powder, turn off the heat, and pour the chickpeas into a bowl while you make the sauce.",
    "Now rinse out that same pot and then warm up the olive oil for the sauce. Add the swiss chard and stir it around so some oil gets on all that shit. It might look like too much chard but that shit is gonna cook down so just keep stirring it all up for about 3 minutes until it’s all wilted. Add the garlic, white wine, and salt, and cook for another 2 minutes. Add the can of diced tomatoes, juice and all, and the red pepper flakes and cook for another 3-5 minutes or until the chard is cooked all the way down and tastes tender. Fold in the cooked pasta and cook it for another minute so it’ll absorb some of the sauce. Turn off the heat and then fold in the olives and balsamic vinegar. Taste and add more garlic, red pepper flakes, whatever the fuck you feel like. See how easy that is, even if you’re drinking straight from the wine bottle the whole time.",
    "Serve right away with chickpeas on top of each serving and with a glass of the rest of that white wine.",
    "* This is roughly 8 cups.",
    "** If you aren’t a wine person, just replace it with veggie broth. But you’ll probably wanna pass on drinking a glass of veggie broth with your meal. Blegh.",
    "*** Get the ones without pits. These use to be hard to find about 15 years ago but they should be near all that pickled shit in an average grocery store these days."
  ],
  "ingredients": [
    "0",
    "Serves 4",
    "Balsamic Glazed Chickpeas",
    "1 tablespoon olive oil",
    "1 ½ cups cooked chickpeas (1 15 oz can, rinsed)",
    "2 tablespoons balsamic vinegar",
    "¼ teaspoon garlic powder",
    "Swiss Chard And Tomato Linguine",
    "1 pound linguine or other long as fuck noodle",
    "1 tablespoon olive oil",
    "1 bunch of swiss chard, chopped into 1/2 inch thick ribbons, rib and all*",
    "2-3 cloves of garlic, you do you",
    "2/3 cup white wine**",
    "¼ teaspoon salt",
    "1 15 ounce can diced tomatoes",
    "¼ teaspoon red pepper flakes",
    "¼ cup sliced kalamata olives***",
    "1 tablespoon balsamic vinegar"
  ],
  "__v": 1
}