{
  "hash": "d1e89cad12854f00092168d80c27c82b847e0185",
  "title": "Gnocchi with Mushrooms and Gorgonzola Sauce",
  "image": "http://www.marthastewart.com/sites/files/marthastewart.com/styles/wmax-520-highdpi/public/d22/ml020_sip_fd08_gnocchi/ml020_sip_fd08_gnocchi_hd.jpg?itok=SSkzt8hg",
  "href": "http://www.marthastewart.com/343525/gnocchi-with-mushrooms-and-gorgonzola-sa?search_key=gnocchi",
  "extension": "Chrome",
  "firstAdded": "2015-09-14T11:04:57.084000",
  "users": [
    null
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "dusting",
    "yukon",
    "gold",
    "russet",
    "potatoes",
    "coarse",
    "salt",
    "eggs",
    "black",
    "pepper",
    "olive",
    "oil",
    "brushing",
    "cream",
    "storebought",
    "lowsodium",
    "stock",
    "gorgonzola",
    "cheese",
    "nutmeg",
    "cayenne",
    "extravirgin",
    "mushrooms",
    "chanterelle",
    "cremini",
    "portobello",
    "stemmed",
    "coarsely"
  ],
  "directions": [
    "0",
    "Make the gnocchi: Lightly flour a baking sheet. Put potatoes in a large saucepan; cover with cold water by 2 inches. Bring to a boil; add 1 tablespoon salt. Reduce to a simmer; cook until potatoes are very tender when pierced with a sharp knife, about 25 minutes.",
    "Drain potatoes. When they are just cool enough to handle, peel, and then pass through a ricer or food mill into a medium bowl. Sprinkle with flour, and add eggs. Season with black pepper and 1 tablespoon salt. Stir mixture with a fork to combine.",
    "Turn out dough onto a lightly floured surface; gently knead until it is soft and smooth, about 3 minutes. Divide dough into 4 to 6 equal pieces. Roll each piece into a long rope about 3/4 inch thick. Cut ropes crosswise into 1-inch gnocchi.",
    "Roll a cut side of each dumpling against the tines of a fork with your thumb so each piece has ridges on 1 side and an indentation on the other. Place on the floured baking sheet until ready to cook (up to 12 hours in the refrigerator, uncovered).",
    "Lightly brush a rimmed baking sheet with oil. Bring a large pot of water to a boil; add 1 tablespoon salt. Add half the gnocchi; when they rise to the top (after about 2 minutes), continue to cook until tender, about 15 seconds more. Transfer gnocchi with a slotted spoon to the oiled baking sheet. Repeat process with remaining gnocchi. (The cooked gnocchi can be tossed in oil and stored, in an airtight container, in the refrigerator up to 24 hours.)",
    "Make the sauce: Bring cream and stock to a boil in a large saucepan over medium-high. Reduce heat, and let mixture simmer until slightly thickened and reduced by 1/3, about 10 minutes. Add Gorgonzola; stir until melted. Stir in nutmeg and cayenne. Season with salt and black pepper. Remove from heat; cover to keep warm.",
    "Heat oil in a large skillet over medium until hot but not smoking. Add mushrooms, and cook, stirring occasionally, until they are tender and their released liquid has evaporated, about 4 minutes. Add gnocchi; cook, stirring gently, until just heated through. Pour cheese sauce over gnocchi and toss gently to coat evenly. Serve immediately."
  ],
  "ingredients": [
    "0",
    "2 cups all-purpose flour, plus more for dusting",
    "2 pounds Yukon Gold or russet potatoes",
    "3 tablespoons coarse salt",
    "2 large eggs",
    "1/4 teaspoon freshly ground black pepper",
    "Olive oil, for brushing",
    "1",
    "1 cup heavy cream",
    "1 cup homemade or store-bought low-sodium vegetable stock",
    "4 ounces Gorgonzola cheese",
    "Pinch of freshly grated nutmeg",
    "Pinch of cayenne pepper",
    "Coarse salt and freshly ground black pepper",
    "3 tablespoons extra-virgin olive oil",
    "12 ounces assorted fresh mushrooms, such as chanterelle, cremini, and portobello, stemmed and coarsely chopped"
  ],
  "__v": 1
}