{
  "hash": "774936d02fb0cc4835d349e2c61d45ed80cca0c2",
  "title": "Roasted Garlic Cashew Cream Pasta",
  "image": "https://cdn.shortpixel.ai/spai/w_684+q_lossy+ret_img+to_webp/https://ourbalancedbowl.com/wp-content/uploads/2019/01/IMG_2948-1400x2100.jpg",
  "href": "https://ourbalancedbowl.com/roasted-garlic-cashew-cream-pasta/",
  "extension": "Chrome",
  "firstAdded": "2020-04-28T10:43:08.667000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Soak the cashews in a large bowl covering them with water for 2-3 hours prior to cooking time. Once they are done soaking, rinse them thoroughly and drain the water they are soaking in. Set aside.",
    "While the cashews are soaking, preheat your oven to 400 degrees. Cut the top off the garlic head - exposing each clove inside and ripping off as much white \"garlic skin\" as possible. Place on aluminum foil. Drizzle with olive oil and salt and pepper. Wrap the garlic in the aluminum foil and roast for 40-45 minutes.",
    "Once the garlic is done, unwrap and let it cool. Once cooled, squeeze from the bottom of the garlic bulb, and each little clove should pop out! Place the roasted garlic cloves, cashews and 1.5 cups of water in a high powered blender.",
    "Place the roasted garlic cloves, cashews and 1.5 cups of water in a high powered blender. Blend until extra smooth and extra creamy! Set aside for now.",
    "Cook your pasta shells according to your box directions - or until al dente. Drain your noodles once they are done. To the pot that your noodles were cooking, add in your cashew sauce. Let it warm on simmer/low heat. Add your noodles back into the pot and mix together when you're ready to consume! Season with salt and pepper to taste!",
    "Optional: Add fresh spinach to the pasta when warm - it will wilt quickly!"
  ],
  "ingredients": [
    "0",
    "1 and 1/2 cups salted cashews",
    "1 and 1/2 cups water",
    "1 extra large garlic bulb",
    "drizzle of olive oil",
    "salt and pepper to taste"
  ],
  "__v": 1
}