{
  "hash": "97c504a1e45cbfa576971fd5f842544e269dc31e",
  "title": "Savory Slow Cooker Brisket",
  "image": "http://toriavey.com/images/2010/01/MG_3387-Edit-Edit-624x468.jpg",
  "href": "http://toriavey.com/toris-kitchen/2015/04/savory-slow-cooker-brisket/",
  "extension": "Chrome",
  "firstAdded": "2017-03-29T00:09:03.581000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place half of the chopped onions, 5 of the garlic cloves and the bay leaves in the bottom of the slow cooker.",
    "SaveRinse the brisket and pat dry. Rub both sides of the meat with black pepper and salt.",
    "SaveNote about this next step-- if you're in a hurry you don't need to brown the brisket before placing it in the slow cooker, just mix the spices with the water and pour over the brisket in the slow cooker. However, if you do have time to brown it first the flavor will be much better! Drizzle 2 tbsp of olive oil into the pan and heat a large skillet over high heat until it just begins to smoke.",
    "Brown the brisket on both sides—it will take a few minutes per side. A large brisket may overlap the edges of the skillet; you can brown it in stages, letting half the brisket overlap the edge, then adjusting it to brown the other half. Make sure you get some nice dark brown bits on there, it really adds to the flavor.",
    "SaveOnce the brisket is browned, place it in the slow cooker on top of the onions and garlic.",
    "SaveDrain the fat from the skillet, leaving behind any brown bits in the skillet. Return the skillet to the stove. In a small bowl, mix together the water, salt, black pepper, paprika, turmeric and cayenne. Pour the water and spice mixture into the skillet and heat over medium until hot and bubbly, using the liquid to deglaze the pan and loosening brown bits gently from the bottom of the skillet with a spatula.",
    "SavePour the contents of the skillet over the brisket.",
    "SaveTop brisket with the remaining sliced onions and garlic cloves. Cover and cook on low for 8- 10 hours, or until fork tender. Tenderness will increase as it cooks, so take it out when it's tender to your liking. Most people like it very tender but not so soft that it is falling apart. You want it firm enough to slice but tender enough that the edges shred with a fork.",
    "SaveI recommend making this brisket ahead; allowing it to sit in the refrigerator for 1-2 nights will improve the flavor. If you would like to do this, skip ahead to where it says “Make Ahead Directions.” If you are not making ahead, continue reading.",
    "Remove brisket from the pan and let it rest on the cutting board fat-side up for 20-30 minutes.",
    "SaveMeanwhile, skim fat from the surface of the cooking sauce.",
    "SaveYou may strain the sauce to separate the solids out and discard— if you do this, return the sauce to the slow cooker, mix together 1 tbsp potato starch or cornstarch (use potato starch for Passover) with 1 tbsp of cold water, and stir it into the strained liquid in the slow cooker. Alternatively, you may thicken the cooking sauce by first removing the bay leaves, then using an immersion blender to blend the sauce with the garlic and onions directly in the slow cooker (careful, the liquid is hot-- protect yourself with a towel and take care with more delicate ceramic slow cooker inserts).",
    "Once your sauce is ready, cut fat cap off the brisket.",
    "SaveThen cut the brisket in thin slices against the grain.",
    "SaveReturn slices to the slow cooker and cover with sauce. Heat the meat slices on high setting in the sauce for 30-60 minutes more until sauce is hot, bubbly and thickened around the meat. Serve sliced brisket hot with sauce.",
    "Make Ahead Directions: Switch the brisket and sauce to a ceramic or glass dish. Skim fat from the surface of the cooking sauce. You may strain the sauce to separate the solids out and discard. Alternatively, you may thicken the cooking sauce by first removing the bay leaves, then using an immersion blender to blend the sauce with the garlic and onions directly in the slow cooker (careful, the liquid is hot-- protect yourself with a towel and take care with more delicate ceramic slow cooker inserts). Pour sauce over the meat in the dish. Cover with plastic wrap and place in the refrigerator. Let the brisket chill overnight, or up to two days. You can also freeze the brisket up to a week ahead if you prefer. 2 hours before serving, remove the brisket from the refrigerator. The fat in the sauce will have risen to the top, turned white, and solidified. Use a spoon to scoop the fat bits out of the sauce and discard. Take the brisket out of the dish and brush any excess sauce back into the dish. Place brisket on a cutting board, fat-side up. Slice the meat cold—first cut the fat cap off the brisket, then cut the brisket in thin slices against the grain. Pour sauce into the slow cooker and set to high heat. If you strained the sauce and didn’t blend it, mix together 1 tbsp cornstarch (use potato starch for Passover) with 1 tbsp of cold water, and stir it into the strained liquid in the slow cooker. Place brisket slices into the slow cooker, cover with sauce, and reheat for 45-75 minutes or until hot and bubbly. Serve warm.",
    "Save"
  ],
  "ingredients": [
    "0",
    "4-6 lb brisket",
    "10 garlic cloves, peeled",
    "3 onions, sliced",
    "3 bay leaves",
    "1/2 cup water",
    "2 tbsp olive oil",
    "1 1/2 tsp kosher salt",
    "1 tsp black pepper",
    "1 tsp paprika",
    "3/4 tsp turmeric",
    "1/4 tsp cayenne",
    "1 tbsp cornstarch or potato starch - optional (use potato starch for Ashkenazi Passover)",
    "Slow cooker, large skillet, immersion blender"
  ],
  "__v": 1
}