{
  "hash": "fdf851bcee7de11de580052c90ee23c35527fc80",
  "title": "Cinnamon Roll Bubble BitesKaren TKevin @ Closet CookingNaomiMaria LichtyTaylor @ Food Faith FitnessMyndaJennifer @ Show Me the YummyRachel - A Southern FairytaleMelissaJulie | Table for TwoGaby DalkinRebecca {foodie with family}Heather@WillSingForDessertshelly (cookies and cups)Gina @Running to the Kitchen",
  "image": "http://picky-palate.com/wp-content/uploads/2017/03/Cinnamon-Roll-Bubble-Bites-25-700x521.jpg",
  "href": "http://picky-palate.com/2017/04/03/cinnamon-roll-bubble-bites/",
  "extension": "Chrome",
  "firstAdded": "2017-04-21T23:57:31.306000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine 2 cups flour, sugar, dry yeast and salt in a large mixer bowl and stir until blended. Combine milk, water and butter in a microwave-safe bowl. Microwave on HIGH in 15 second increments until very warm but not hot to the touch (120° to 130°F. Butter won’t melt completely). Add to flour mixture with egg.",
    "Mix 2 minutes at medium speed of stand mixer, scraping bowl occasionally. Add 1 cup flour; beat 2 minutes at high speed, scraping bowl occasionally. Stir in just enough remaining flour so that the dough will form into a ball. Mix on low for 5-6 minutes.",
    "Transfer dough to a lightly floured countertop. Roll out dough to about 1/4-inch in thickness. Cut into 20-24 pieces, close to the same size. Roll into balls.",
    "Place melted butter into a medium bowl. Place sugar and cinnamon into a medium bowl, stirring to combine. Place dough balls into melted butter, coating all sides, then into cinnamon sugar mixture, coating all sides. Place all coated balls of dough, close together into a buttered 9 x 13-inch baking dish. Place dish into a warm oven for 15-20 minutes, until dough has nearly doubled in size. Remove and preheat oven to 350 degrees F. Bake for 20-22 minutes, until baked through.",
    "Place powdered sugar and heavy cream into a medium mixing bowl whisking until smooth. If too thick, add teaspoons of heavy cream to thin out. Drizzle love warm rolls and serve warm."
  ],
  "ingredients": [
    "0",
    "3 1/2 cups all-purpose flour",
    "1/4 cup sugar",
    "1 packet Fleischmann’s® RapidRise Yeast",
    "1 teaspoon kosher salt",
    "3/4 cup milk",
    "1/4 cup water",
    "1/4 cup butter",
    "1 large egg",
    "1 stick melted butter",
    "1/2 cup granulated sugar",
    "3 tablespoons ground cinnamon",
    "2 cups powdered sugar",
    "4-5 tablespoons heavy cream"
  ],
  "__v": 1
}