{
  "hash": "77a06015b84f24fe9c53fd5f8787e68a6bb52e14",
  "title": "Homemade Chick-Fil-A Sandwiches",
  "image": "http://www.seriouseats.com/recipes/assets_c/2012/07/20120730-chick-fil-a-food-lab-primary-thumb-625xauto-260432.jpg",
  "href": "http://www.seriouseats.com/recipes/2012/07/homemade-chick-fil-a-sandwiches-recipe.html",
  "extension": "",
  "firstAdded": "2015-04-23T08:05:33.327000",
  "users": [
    null
  ],
  "keywords": [
    "kosher",
    "salt",
    "sugar",
    "boneless",
    "skinless",
    "chicken",
    "breasts",
    "split",
    "horizontally",
    "cutlets",
    "paprika",
    "black",
    "pepper",
    "cayenne",
    "msg",
    "milk",
    "eggs",
    "allpurpose",
    "flour",
    "nonfat",
    "baking",
    "quarts",
    "peanut",
    "oil",
    "soft",
    "hamburger",
    "buns",
    "butter",
    "dill",
    "pickle",
    "chips"
  ],
  "directions": [
    "0",
    "1 Dissolve 1/2 cup kosher salt (see note above) and 1/4 cup sugar in 1 quart of cold water. Place chicken breasts in a zipper-lock bag and add brine. Transfer to refrigerator and let sit for at least 6 hours and up to overnight.",
    "2 Meanwhile, combine paprika, black pepper, cayenne pepper, and MSG (if using), in a small bowl. Set aside",
    "3 Whisk together milk and eggs in a medium bowl. Set aside.",
    "4 Combine flour, non-fat milk powder, baking powder, 1/2 teaspoon kosher salt, 2 teaspoons sugar, and 2 tablespoons of spice mixture in a large bowl and whisk until homogenous. Drizzle 3 tablespoons milk/egg mixture into flour mixture and rub with fingertips until the flour mixture is coarse like wet sand.",
    "5 In a large wok, deep fryer, or Dutch oven, preheat oil to 350°F.",
    "6 Remove chicken breasts from brine and pat dry with paper towels. Season on all sides with remaining spice mixture. Transfer to milk mixture and turn to coat. Working one cutlet at a time, allow excess milk mixture to drip off then transfer to flour mixture. Turn to coat, pile extra mixture on top of cutlet, and press down firmly to adhere as much mixture as possible to the meat. Lift cutlet, shake off excess flour, then slowly lower into hot oil. Repeat with remaining breasts.",
    "7 Cook, turning breasts occasionally until golden brown and crisp on all sides, and chicken is cooked through, about 4 minutes total. Transfer to a paper towel-lined plate.",
    "8 Place 2 pickles on each bottom bun and a fried chicken cutlet on top. Close sandwiches, then cover with an overturned bowl or aluminum foil and allow to rest for 2 minutes to steam buns. Serve immediately."
  ],
  "ingredients": [
    "0",
    "Kosher salt (see note above)",
    "Sugar",
    "2 large boneless skinless chicken breasts, split horizontally into 4 cutlets",
    "2 teaspoons paprika",
    "2 tablespoons black pepper",
    "1/2 teaspoon cayenne pepper",
    "1 teaspoon powdered MSG (optional)",
    "1 cup milk",
    "2 large eggs",
    "1 1/2 cups all-purpose flour",
    "2 tablespoons powdered non-fat milk",
    "1 teaspoon baking powder",
    "2 quarts peanut oil",
    "4 soft hamburger buns, toasted in butter",
    "8 dill pickle chips"
  ],
  "__v": 1
}