{
  "hash": "996ce8d742fa19c8434717d86897e947f6287cf7",
  "title": "Butternut Squash & Kale Quesadillas",
  "image": "http://tastykitchen.com/recipes/wp-content/uploads/sites/2/2013/01/squashkale-420x279.jpg",
  "href": "http://thepioneerwoman.com/cooking/2013/01/butternut-squash-kale-quesadillas/",
  "extension": "Chrome",
  "firstAdded": "2015-05-07T17:52:32.024000",
  "users": [
    null
  ],
  "keywords": [
    "butternut",
    "squash",
    "seeded",
    "butter",
    "olive",
    "oil",
    "kosher",
    "salt",
    "black",
    "pepper",
    "chili",
    "bunch",
    "kale",
    "leaves",
    "torn",
    "stalks",
    "discarded",
    "fajita",
    "sized",
    "flour",
    "tortillas",
    "extra",
    "frying",
    "monterey",
    "jack",
    "cheese",
    "needed",
    "sour",
    "cream",
    "cilantro",
    "pico",
    "gallo",
    "salsa",
    "avocado",
    "slices"
  ],
  "directions": [
    "0",
    "Heat 1 tablespoon butter and olive oil in a large skillet over high heat. Add squash and sprinkle with salt, pepper, and chili powder. Cook for several minutes, turning gently with a spatula, until squash is deep golden brown and tender (but not falling apart.) Remove to a plate and set aside.",
    "In the same skillet, melt 1 tablespoon of butter over medium-high heat and add in the kale. Toss it around with tongs and cook it for 3 to 4 minutes. Add in the cooked squash and gently toss together. Set aside.",
    "In a separate skillet, melt additional butter and lightly brown both sides of the 8 tortillas. Build the quesadillas one by one by adding a layer of cheese topped with a layer of the squash/kale mixture, topped with a second tortilla. You'll have four quesadillas when you're done.",
    "Brown each quesadilla on both sides, adding more butter to the pan to make sure tortillas are nice and golden and yummy.",
    "When the cheese is melted, remove each quesadilla from the skillet and cut it into four wedges. Serve with sour cream, cilantro, pico de gallo, salsa, avocado...or any sides you'd like!",
    "(Note: The butternut squash/kale mixture is also great tossed with a little pasta and olive oil, and topped with Parmesan shavings!)"
  ],
  "ingredients": [
    "0",
    "1/2 whole Butternut Squash, Peeled, Seeded, And Diced.",
    "2 Tablespoons Butter",
    "1 Tablespoon Olive Oil",
    "1/2 teaspoon Kosher Salt",
    "Black Pepper To Taste",
    "1/4 teaspoon Chili Powder (more To Taste)",
    "1 bunch Kale, Leaves Torn, Stalks Discarded",
    "8 whole Small (fajita Sized) Flour Tortillas",
    "Extra Butter For Frying",
    "2-1/2 cups Monterey Jack Cheese, Grated (more If Needed)",
    "Sour Cream, For Serving",
    "Cilantro, For Serving",
    "Pico De Gallo, Salsa, Avocado Slices (optional) For Serving"
  ],
  "__v": 1
}