{
  "hash": "db3619e9dfc6de4c51a9bc40b1a7d288cea7c6fe",
  "title": "Pancakes USA stylie",
  "image": "",
  "href": "http://www.jamieoliver.com/recipes/eggs-recipes/pancakes-usa-stylie/",
  "extension": "Chrome",
  "firstAdded": "2016-01-01T23:49:13.176000",
  "users": [
    null
  ],
  "keywords": [
    "freerange",
    "eggs",
    "plain",
    "flour",
    "heaped",
    "baking",
    "milk",
    "salt"
  ],
  "directions": [
    "0",
    "Method",
    "These American pancakes are great! Instead of being thin and silky like French crêpes, they are wonderfully fluffy and thick and can be made to perfection straight away. Simple, simple, simple – my Jools goes mad for them.",
    "First separate the eggs, putting the whites into one bowl and the yolks into another. Add the flour, baking powder and milk to the yolks and mix to a smooth thick batter. Whisk the whites with the salt until they form stiff peaks. Fold into the batter – it is now ready to use.",
    "Heat a good non-stick pan on a medium heat. Pour some of your batter into the pan and fry for a couple of minutes until it starts to look golden and firm. At this point sprinkle your chosen flavouring (see below) on to the uncooked side before loosening with a spatula and flipping the pancake over. Continue frying until both sides are golden.",
    "You can make these pancakes large or small, to your liking. You can serve them simply doused in maple syrup and even with some butter or crème fraîche. Or if you choose to sprinkle with a flavouring, try one of these...",
    "fresh corn from the cob",
    "crispy bacon or pancetta",
    "blueberries",
    "banana",
    "stewed apple",
    "grated chocolate",
    "anything else you can imagine...",
    "PS Blueberry pancakes (above) are great but you must try the corn pancakes. On one condition – you must use fresh corn. To do this, remove the outer leaves and carefully run a knife down the cob – this will loosen all the lovely pieces of corn – and sprinkle these raw over your pancake, before flipping it in the pan. I like to have some grilled bacon over my corn pancakes, drizzled with a little maple syrup. This sounds bloody horrid but it honestly tastes great!"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "3\tlarge\tfree-range eggs",
    "115\tg\tplain flour",
    "1\theaped teaspoon\tbaking powder",
    "140\tml\tmilk",
    "1\tpinch\tsalt"
  ],
  "__v": 1
}