{
  "hash": "7ebfad70c7377ace1645670760fa4eb124764a1a",
  "title": "Over-the-Top Savoury Bread Pudding",
  "image": "http://static.theglobeandmail.ca/fd3/life/parenting/mothers-day/article29832257.ece/ALTERNATES/w220/waverman03lf188.JPG",
  "href": "http://www.theglobeandmail.com/life/food-and-wine/recipes/over-the-top-savoury-bread-pudding/article29832422/",
  "extension": "Chrome",
  "firstAdded": "2016-08-27T23:18:26.809000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat oil over medium heat. Add onions, sprinkle with salt and sauté for 5 minutes or until softened. Let cool slightly.",
    "Grease a 9-by-13-inch pan or any large baking dish. Combine the cheeses in a bowl. Whisk together the eggs, milk, mustard, sriracha, parsley and sautéed onions in a separate bowl. Season well with salt and pepper.",
    "Line the base of the pan with a single layer of bread. Sprinkle half the cheese over the bread. Pour half the egg mixture over the cheese-bread layer. Repeat layers, finishing with the egg mixture.",
    "Refrigerate overnight or for at least 4 hours. Remove the dish from the refrigerator one hour before baking to come to room temperature.",
    "Preheat your oven to 350 F. Bake for 45 minutes to one hour or until the pudding is puffed and golden.",
    "General rules",
    "Use 1/2 cup of milk or cream (or both) for each egg.",
    "Thinly sliced white or whole wheat bread will allow the bread to disappear into the pudding. Use chunkier, more coarse bread such as cubed sourdough or grain breads if you want it to have more texture. Emma likes it with good ol’ white bread. Lucy prefers the chunkier version. We have agreed to disagree.",
    "Bread absorbs flavour, so season generously.",
    "For maximum impact, serve immediately, as it does deflate. It is also tasty cold.",
    "This can easily be made with gluten-free bread, which soaks up the custard just as well as regular bread.",
    "You can add precooked bacon or sausages to the pudding.",
    "A couple of handfuls of raw, slivered baby spinach add colour to the layers.",
    "Use the blue cheese, even if you hate blue cheese; it boosts and deepens the flavour and becomes unnoticeable."
  ],
  "ingredients": [
    "0",
    "1 tbsp olive oil",
    "2 cups chopped Spanish onion",
    "Salt",
    "8 oz (250 g) brie, cubed",
    "8 oz (250 g) cheddar, grated",
    "4 oz (125 g) gorgonzola or Roquefort, crumbled",
    "6 eggs",
    "3 cups milk or cream",
    "2 tbsp Dijon mustard",
    "2 tsp sriracha",
    "1/4 cup chopped fresh parsley",
    "Freshly ground pepper",
    "1 loaf thinly sliced challah or egg bread, crusts removed"
  ],
  "__v": 1
}