{
  "hash": "93f18da92a5027faebd05b24edd499fbb33badf9",
  "title": "Philly Cheese Steak Sliders",
  "image": "http://www.sweetandsavorybyshinee.com/wp-content/uploads/2014/09/Philly-Cheese-Steak-Sliders-2.jpg",
  "href": "http://www.sweetandsavorybyshinee.com/philly-cheese-steak-sliders/",
  "firstAdded": "2014-11-23T18:15:04.323000",
  "users": [
    null
  ],
  "keywords": [
    "ribeye",
    "steak",
    "semifrozen",
    "white",
    "cremini",
    "mushrooms",
    "medium",
    "green",
    "bell",
    "pepper",
    "red",
    "onion",
    "unsalted",
    "butter",
    "olive",
    "oil",
    "salt",
    "worcestershire",
    "black",
    "pretzel",
    "slider",
    "buns",
    "slices",
    "provolone",
    "cheese"
  ],
  "directions": [
    "0",
    "Using a very sharp knife, slice the steak into very thin slices. (I’m using rib eye steak, because it’s the most flavorful steak, but you can use any tender cut.) It’s easier to shave off thin slices, if the meat is semi-frozen. Simply place the fresh meat in the freezer for 30-45 minutes to firm up. Slice the mushrooms, bell pepper and onion into thin slices/strips as well.",
    "In a skillet, heat 1 tablespoon of olive oil and melt 1 tablespoon of butter over medium high heat. Stir in the onion and cook until fragrant, about a minute. Add mushrooms and bell pepper and cook until tender, 4-5 minutes, stirring occasionally. Sprinkle ¼ teaspoon of salt. Transfer the vegetables onto a clean plate. Set aside.",
    "Add the remaining 1 tablespoon of olive oil and thinly sliced steak into the skillet. Season the meat with remaining ½ teaspoon of salt, black pepper and Worcestershire sauce. Cook the steak for about 3 minutes, until nicely browned. Transfer to a clean plate and set aside.",
    "Slice the pretzel rolls in half crosswise and spread the remaining 2 tablespoons of butter on each cut side of the buns. Place the buns buttered side down on the hot skillet and toast for about a minute.",
    "To assemble the sliders, divide the meat among 7 slider buns, place half of the cheese, then veggie mixture and the remaining cheese. Right before serving, broil until the cheese melts, 1-2 minutes."
  ],
  "ingredients": [
    "0",
    "•\t1lb ribeye steak, semi-frozen",
    "•\t4-5 white or cremini mushrooms (about 2 cups chopped)",
    "•\t1 medium green bell pepper (about 1 cup chopped)",
    "•\t¼ red onion (about ¼ cup chopped)",
    "•\t3 tablespoon unsalted butter",
    "•\t2 tablespoon olive oil",
    "•\t¾ teaspoon salt",
    "•\t1 tablespoon Worcestershire sauce",
    "•\t1 teaspoon ground black pepper",
    "•\t7 Pretzel slider buns",
    "•\t7 slices Provolone cheese"
  ],
  "__v": 1
}