{
  "hash": "10ac54cb9ce18aba8f638f8def2eacfab718eacc",
  "title": "Nigel Slater's Really Good Spaghetti Bolognese",
  "image": "https://d2k9njawademcf.cloudfront.net/indeximages/40359/full/nigel_bolognese.jpg?1403288251",
  "href": "http://food52.com/recipes/26984-nigel-slater-s-really-good-spaghetti-bolognese",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T21:30:17.652000",
  "users": [
    null
  ],
  "keywords": [
    "butter",
    "cubed",
    "pancetta",
    "medium",
    "onion",
    "fat",
    "garlic",
    "carrot",
    "stalks",
    "celery",
    "flat",
    "mushrooms",
    "portobello",
    "bay",
    "leaves",
    "beef",
    "lamb",
    "tomatoes",
    "passata",
    "red",
    "wine",
    "stock",
    "nutmeg",
    "halfandhalf",
    "cream",
    "spaghetti",
    "tagliatelle",
    "parmesan"
  ],
  "directions": [
    "0",
    "Melt the butter in a large, heavy-based pot -- then stir in the pancetta and let it cook for five minutes or so, without coloring much. Meanwhile peel and finely chop the onion and garlic and stir them into the pancetta. Peel and finely chop the carrot and celery and stir them in, too. Lastly, finely chop the mushrooms and add to the pan, then tuck in the bay leaves and leave to cook for ten minutes over a moderate heat, stirring frequently.",
    "Turn up the heat and tip in the meat, breaking it up well with a fork.",
    "Now leave to cook without stirring for a good three or four minutes, then, as the meat on the bottom is starting to brown, stir again, breaking up the meat where necessary, and leave to color.",
    "Mix in the tomatoes, red wine, stock, a grating of nutmeg and some salt and black pepper, letting it come to the boil. Turn the heat down so that everything barely bubbles. There should be movement, but one that is gentle, not quite a simmer. Partially cover the pan with a lid and leave to putter away for an hour to an hour and a half, stirring from time to time and checking the liquid levels. You don't want it to be dry.",
    "Pour in the half-and-half or cream a bit at a time, stir and continue cooking for twenty minutes. Check the seasoning, then serve with the pasta and grated Parmesan."
  ],
  "ingredients": [
    "0",
    "4 tablespoons butter",
    "3 ounces cubed pancetta",
    "1 medium onion",
    "2 fat cloves garlic",
    "1 carrot",
    "2 stalks celery",
    "2 large, flat mushrooms such as portobello, about 4 ounces",
    "2 bay leaves",
    "1 pound ground beef or lamb",
    "1 cup crushed tomatoes or passata",
    "1/4 cup red wine",
    "3/4 cup stock",
    "1 nutmeg",
    "3/4 cup half-and-half or cream",
    "1",
    "Spaghetti or tagliatelle for 4",
    "Grated Parmesan"
  ],
  "__v": 1
}