{
  "hash": "fd4a62f271f60cf1add1b8c5f464db2b1c9409bb",
  "title": "Sauerkraut Sausage Casserole",
  "image": "//d30b2uadky41tr.cloudfront.net/Blog/image.axd?picture=/2017/03/SauerkrautSausageCasserole8.jpg",
  "href": "https://ketodietapp.com/Blog/post/2017/03/01/low-carb-sauerkraut-sausage-casserole",
  "extension": "Chrome",
  "firstAdded": "2017-03-14T15:37:35.506000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cut the cabbage in quarters, remove and discard the core. Slice the cabbage, onion, green pepper and mince the garlic. Grease a large saucepan or a Dutch oven with ghee. Add the sliced onion, sausages and cook for 5-8 minutes, until lightly browned. Remove sausages and set aside.",
    "Then add the sliced peppers and cook for a minute. Add the shredded cabbage, ...",
    "Sauerkraut, lemon juice, water, oregano and mix until combined. Cover with a lid and cook over a medium-low heat for 10 minutes.",
    "Preheat the oven to 400 F. Transfer the sausages, cover with a lid or a baking foil and place in the oven. Bake for about 60 minutes, and then, remove the foil and bake for another 5 minutes.",
    "Remove from the oven and let it cool down for 5 minutes. Garnish with fresh parsley and serve with homemade keto Dijon mustard or ketchup. To store, refrigerate for up to 4 days or freeze for up to 3 months."
  ],
  "ingredients": [
    "0",
    "¼ cup ghee or lard (55 g/ 1.9 oz)",
    "1 medium white or yellow onion, sliced (110 g/ 3.9 oz)",
    "2 red peppers, sliced (120 g/ 4.2 oz)",
    "1/2 head cabbage, shredded (600 g/ 1.3 lb)",
    "2 cups sauerkraut, drained (284 g/ 10 oz) - you can make your own",
    "2 tablespoons lemon juice",
    "½ cup water (more if needed)",
    "1 tbsp freshly chopped oregano or 1 tsp dried oregano",
    "¼ tsp salt (",
    "8-12 gluten-free Italian-style sausages (800 g/ 1.76 lb)",
    "Optional: serve with homemade condiments such as Dijon mustard or ketchup."
  ],
  "__v": 10
}