{
  "hash": "97d144504a4b37e45668847e06bafc4a58278b57",
  "title": "Zuppa d’aglio",
  "image": "",
  "href": "http://www.veganblog.it/2014/11/15/zuppa-daglio/",
  "extension": "Chrome",
  "firstAdded": "2016-03-24T13:06:02.671000",
  "users": [
    null
  ],
  "keywords": [
    "ingredienti",
    "persone",
    "spicchi",
    "aglio",
    "secondo",
    "grandezza",
    "cipolla",
    "rossa",
    "carote",
    "patate",
    "misura",
    "media",
    "cucchiaio",
    "olio",
    "evo",
    "latte",
    "riso",
    "brodo",
    "vegetale",
    "alloro",
    "salvia",
    "sale",
    "pepe",
    "tocco",
    "zenzero"
  ],
  "directions": [
    "0",
    "Procedimento:",
    "Mondare l’aglio (levare anche l’anima verde) e la 1/2 cipolla, sbucciare la patata e la carota e tagliarle a tocchetti. Mettere aglio e cipolla con il cucchiaio d’olio in una pentola antiaderente e fare andare molto molto piano, mescolando spesso. Dopo circa 1 ora, o anche più (in pratica finchè tutta la casa non sarà invasa da un gradevolissimo profumo d’aglio, ma facendo molta attenzione a non bruciarlo e nemmeno a dorarlo, quindi raccomando ancora fuoco ultradolce!) aggiungere carota, patata, salvia, alloro e fare andare almeno 30 minuti a fuoco bassissimo, mescolando molto spesso. A questo punto aggiungere il brodo e fare andare sempre pianissimo, e mescolando, per un’altra 1/2 oretta, infine versare anche il latte di riso, mescolare per qualche minuto e quindi spegnere il fuoco. Lasciar perdere un po’ di temperatura e quindi prelevare con una schiumarola tutte la componenti solide, levare alloro e salvia e l’eventuale pepe se a grani interi, frullare il resto col minipimer e quindi riunirlo alla parte liquida. Tornare a scaldare mescolando ed amalgamando bene il tutto, in modo da ottenere un composto omogeneo, fino a temperatura desiderata. Servire con crostini o pane a fette."
  ],
  "ingredients": [
    "0",
    "Ingredienti (per 4 persone):",
    "10-15 spicchi di aglio (secondo la grandezza)",
    "1/2 cipolla rossa",
    "1-2 carote",
    "4 patate di misura media",
    "1 cucchiaio di olio evo",
    "300 ml di latte di riso",
    "700 ml di brodo vegetale",
    "alloro",
    "salvia",
    "sale, pepe qb",
    "un tocco di zenzero?"
  ],
  "__v": 2
}