{
  "hash": "ef6ad94c1606a7f8c52a74b043318c4d5a220ed0",
  "title": "Chicken Thighs in Tomato-Ginger Sauce",
  "image": "",
  "href": "http://www.finecooking.com/recipe/chicken-thighs-in-tomato-ginger-sauce",
  "extension": "Chrome",
  "firstAdded": "2018-05-02T18:42:43.806000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Pat the chicken thighs dry and season with 1-1/2 tsp. salt and 1/4 tsp. pepper.",
    "Heat the oil in a heavy-duty 12-inch skillet over medium-high heat until shimmering hot. Brown half of the chicken, flipping once, 5 to 6 minutes total. Transfer the chicken to a plate. Repeat with the remaining chicken, adding more oil if the pan looks dry.",
    "Reduce the heat to medium. Add the onion and a pinch of salt, and cook, stirring frequently with a wooden spoon, until golden-brown on the edges, 3 to 5 minutes. Add the garlic, ginger, garam masala, cinnamon, and cayenne and stir constantly for about 30 seconds.",
    "Stir in the tomatoes, increase the heat to medium high, and simmer vigorously until slightly reduced, about 3 minutes. Add the chicken and any accumulated juice. Spoon the sauce over the chicken, reduce the heat, and simmer until just cooked through, 5 to 7 minutes.",
    "Transfer the chicken to plates or a platter. Stir the butter into the sauce until incorporated and season to taste with salt. Spoon the sauce over the chicken, garnish with the cilantro, and serve."
  ],
  "ingredients": [
    "0",
    "8 small, boneless, skinless chicken thighs (about 1-1/2 lb.)",
    "Kosher salt and freshly ground black pepper",
    "1-1/2 Tbs. canola or vegetable oil; more as needed",
    "1 medium yellow onion, finely diced",
    "2 large cloves garlic, minced",
    "2 Tbs. minced fresh ginger (from a 1-inch piece)",
    "1 tsp. garam masala",
    "1/4 tsp. ground cinnamon",
    "1/4 tsp. cayenne",
    "2 15-oz. cans fire-roasted crushed tomatoes",
    "1 oz. (2 Tbs.) cold unsalted butter, cut into 4 pieces",
    "1/4 cup coarsely chopped fresh cilantro"
  ],
  "__v": 1
}