{
  "hash": "1e4953783e624a2a3f6d89283c9da029e1c32113",
  "title": "HOMEMADE POTATO CHIPS WITH GORGONZOLA CHEESE SAUCE",
  "image": "",
  "href": "http://www.spoonforkbacon.com/2017/07/homemade-potato-chips-with-gorgonzola-cheese-sauce/",
  "extension": "",
  "firstAdded": "2017-07-14T02:24:58.484000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat deep fryer or a tall sided pot filled with 2 inches oil, to 350˚F.",
    "Using a mandolin, slice potatoes paper thin and submerge into cold water for 30 minutes.",
    "Line a baking sheet with paper towels and lay the sliced potatoes onto the surface. Top with more paper towels and press down to remove as much liquid from the potatoes.",
    "In small batches, carefully drop a handful of sliced potatoes into the fryer or pot with hot oil and using heat-safe tongs, stir the potatoes around for 2 to 3 minutes, to ensure they don’t stick together and end up having some texture/body to them.",
    "Continue to fry the chips for an additional 3 minutes or until they begin to brown, but haven’t overcooked or burned.",
    "Remove them from the oil, onto a baking sheet lined with fresh paper towels and immediately season with sea salt. Repeat until all of the potato slices have been fried.",
    "Once chips have cooled, remove the paper towels and toss together with a little more sea salt. Set aside.",
    "For gorgonzola sauce: Place a saucepan over medium heat and melt butter. Add flour and whisk together until no lumps remain. Continue to cook the mixture for 1 to 2 minutes before whisking in the milk. Continue to whisk together until the mixture is smooth and has thickened slightly. Remove from heat and whisk in the cheeses, 1 ounce at a time, until all of the cheese has been added and the sauce is smooth. Season with salt and pepper.",
    "To serve: Drizzle cheese sauce over chips and top with more crumbled gorgonzola and thinly sliced chives. Serve immediately."
  ],
  "ingredients": [
    "0",
    "2 russet potatoes, scrubbed and dried",
    "sea salt flakes to taste",
    "oil for frying",
    "gorgonzola cheese sauce:",
    "2 tablespoons unsalted butter",
    "2 tablespoons all purpose flour",
    "1 cup whole milk",
    "2 ounces shredded mozzarella",
    "2 ounces crumbled gorgonzola, plus more for sprinkling",
    "salt and pepper to taste",
    "thinly sliced chives"
  ],
  "__v": 1
}