{
  "hash": "8eaea6a430e1badcc3cc9e8ecd2328409ff89e07",
  "title": "Crunchy Granola in the Slow Cooker",
  "image": "",
  "href": "http://www.thekitchn.com/how-to-make-crunchy-granola-in-the-slow-cooker-231438",
  "extension": "Chrome",
  "firstAdded": "2017-07-10T16:07:45.795000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prep the slow cooker: Spray the bottom and sides of the slow-cooker bowl with cooking spray, or coat with olive or coconut oil.",
    "Combine the dry ingredients in the slow cooker: Place the oats, nuts/seeds, brown sugar, cinnamon, and salt in the bowl of the slow cooker and stir until well-combined.",
    "Stir in the wet ingredients: Add the oil, liquid sweetener, and vanilla extract, and stir until the dry ingredients are fully coated.",
    "Partially cover the slow cooker: Fit the lid onto the slow cooker, keeping it slightly askew to allow for air flow and moisture to escape. (Keeping the slow cooker only partially covered is essential for crunchier granola.)",
    "Cook the granola: Set the slow cooker to high and cook, stirring every 30 minutes, until toasted and golden-brown, about 2 to 2 1/2 hours total. Make sure the lid is placed back on askew after each stirring.",
    "Stir in the dried fruit (optional): If you're using dried fruit, turn the slow cooker off, add the dried fruit, and stir to combine.",
    "Cool and store: Cool the granola completely, then store in an airtight container at room temperature.",
    "Spread on baking sheet to cool (optional): For faster cooling, spread the granola into an even layer on a large baking sheet and let it cool completely."
  ],
  "ingredients": [
    "0",
    "4 cups old-fashioned rolled oats",
    "1 cup raw nuts and/or seeds such as almonds, walnuts, or pecans",
    "1/4 cup packed brown sugar",
    "1/2 teaspoon ground cinnamon",
    "1/4 teaspoon kosher salt",
    "1/2 cup olive oil or coconut oil",
    "1/2 cup liquid sweetener, such as maple syrup, honey, or agave syrup",
    "1 tablespoon vanilla extract",
    "1/2 cup dried fruit, chopped if large (optional)"
  ],
  "__v": 2
}