{
  "hash": "5425b5a089cc74ddad4f28e9cc2d6716b8469422",
  "title": "Undertale - Butterscotch Cinnamon Pie",
  "image": "https://68.media.tumblr.com/95eca899f0b01f98c53b4854445ea84e/tumblr_inline_nvg3alCRGL1trnyzt_1280.jpg",
  "href": "https://lvl1-chef.tumblr.com/post/130137142073/undertale-butterscotch-cinnamon-pie",
  "extension": "",
  "firstAdded": "2017-07-14T01:15:23.246000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350F",
    "Place the 2 oz of butter in the small sauce pot over medium heat. We will be browning the butter here (burre noisette) so you want to keep it on the heat until it stops bubbling but be careful to take it off before it burns. After the bubbles stop you’ll be able to see the specks at the bottom of the pan (milk solids) begin to brown and give off one of the best smells in the world. Remove from the heat and set aside to cool.",
    "In another pot combine the milk and heavy cream over medium high heat and cook until the top begins to steam and you can see small bubbles forming along the outside. Remove from the heat and transfer some if not all of the hot liquid to a measuring cup from which you can easily pour it.",
    "In a medium sauce pot place the ½ cup of brown sugar (I like dark brown sugar for this recipe, but light brown is fine as well) and the water over medium heat. We’ll be cooking the sugar to ~240F so you can use a candy thermometer if you have one. If you don’t have a thermometer you can tell when the sugar is cooked enough when you see the bubbles slow down in speed and get much larger before they pop. Reduce heat to low.",
    "Add in the brown butter and whisk to combine. Then, being very careful, slowly pour in the hot milk mixture into the sugar while continually whisking. The solution will bubble up violently at first but should subside after a few seconds.",
    "Continue to whisk until all of the milk mixture has been added. If there are any lumps of caramel in the pot, increase the heat to medium high and whisk until they are dissolved. Remove from heat.",
    "In a large bowl add the ¼ cup brown sugar, egg yolks, corn starch and cinnamon and whisk until they are completely combined.",
    "While whisking continuously, slowly pour in about half of the hot sugar/milk mixture into the large bowl to combine. Then, pour the contents of the bowl back into the pot and return the heat to medium.",
    "10) Switch to using a rubber spatula and gently stir the mixture while making sure to scrape along the bottom of the pan. We are cooking the eggs now so we need to make sure nothing gets stuck to the bottom and scrambles.",
    "11) After a while the mixture will become noticeably thicker and will be able to coat the back of your spatula. You can test the doneness by swiping your finger across it like so.",
    "(this is called Nape, pronounced nah-pay)",
    "Remove from the heat and use a whisk to make sure the mixture is homogeneous. Then pour the contents of the pot into the baked pie shell. Bake the pie for 25 minutes, then turn the oven off and leave it inside while it cools for another 20 minutes. Remove from oven.",
    "True to the game, the pie will need an hour or two to cool down to room temperature at which point it’ll be sliceable, but until then, enjoy the smells!"
  ],
  "ingredients": [
    "0",
    "Butter 2 oz (½ stick)",
    "Brown Sugar ½ cup",
    "Water 2 TBSP",
    "Whole Milk 2 cup",
    "Heavy Cream 1 cup"
  ],
  "__v": 1
}