{
  "hash": "b0d36666c87c447a20929860e6e9d3aa3e6ce83f",
  "title": "Butternut Squash Soup with Sage",
  "image": "http://del.h-cdn.co/assets/cm/15/10/54f8c6684c83f_-_butternut-squash-soup-recipe-1109-xl.jpg",
  "href": "http://www.delish.com/cooking/recipe-ideas/recipes/a30652/butternut-squash-soup-sage-recipe/?zoomable",
  "extension": "Chrome",
  "firstAdded": "2016-06-22T19:55:44.271000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "Preheat oven to 450 degreesF. Line 15 1/2\" by 10 1/2\" jelly-roll pan with foil. Place squash halves, cut sides down, in prepared pan and roast 45 minutes or until very tender when pierced with knife. Cool until easy to handle; with spoon, scoop squash from shells and place in large bowl. Discard shells.",
    "Meanwhile, in 5- to 6- quart saucepot, heat 2 tablespoons oil on medium until hot. Add celery, shallots, and carrot; cook 20 minutes, stirring frequently. Stir in thyme, bay leaf, 1 tablespoon sage, 1/2 teaspoon salt, and 1/4 teaspoon freshly ground black pepper; cook vegetable mixture 2 minutes longer.",
    "Add broth, water, and squash to pot; cover and heat to boiling on high. Reduce heat to low; simmer 10 minutes.",
    "Meanwhile, in 10-inch skillet, heat remaining oil on medium-high until hot. Add sage leaves; cook 1 minute or until sage is crisp. Transfer to paper-towel-lined plate to drain. Add bread to skillet; cook 3 minutes or until golden brown, stirring. Transfer to plate with sage.",
    "Discard thyme and bay leaf. Working in batches, ladle squash mixture into blender. With center part of blender cover removed to allow steam to escape, blend mixture until pureed; return to pot. Reheat on low, stirring in additional water for desired thickness. To serve, ladle soup into shallow bowls; garnish with croutons and sage leaves."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "2 medium butternut squash",
    "4 tbsp. olive oil",
    "2 medium stalks celery",
    "2 large shallots",
    "1 medium carrot",
    "3 sprig fresh thyme",
    "1 bay leaf",
    "1 tbsp. chopped fresh sage leaves",
    "24 sage leaves",
    "salt and pepper",
    "1 carton chicken broth",
    "2 c. water",
    "2 oz. French bread"
  ],
  "__v": 1
}