{
  "hash": "4b0cbddfb2938e9228b810f2a6f0f286dd887681",
  "title": "Mexican Chorizo—Recipe and Ideas for Use",
  "image": "http://f.tqn.com/y/mexicanfood/1/W/S/C/Flickr-Chorizo.jpg",
  "href": "http://mexicanfood.about.com/od/gotpork/r/chorizo.htm",
  "extension": "Chrome",
  "firstAdded": "2017-02-05T04:37:45.342000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Food to Make with Sausage",
    "Cook Sausage Meat",
    "Pork Sausage Recipe Ideas",
    "Chicken and Pork Sausage",
    "Raw Italian Sausage",
    "1",
    "Stirred into scrambled eggs: fry chorizo in a skillet, drain off excess fat, then add lightly beaten eggs and cook and stir until eggs are set. Eat as-is (with tortillas and sliced avocado) or use to fill burritos or tacos.",
    "Combined with diced, cooked or sauteed potatoes as a filling for tacos, enchiladas, empanadas, or pambazos.",
    "Mixed with melted cheese to make queso fundido (also called choriqueso); use as a dip or spread on tortillas, tostadas, or bread.",
    "As a topping for sopes, tostadas, nachos, or other similar antojitos.",
    "Stirred into refried beans to eat as a side dish or as a spread for molletes or tortas.",
    "Combined with other ground meats and used to stuff a roasted turkey or other fowl.",
    "Added to shredded beef to make Tinga.",
    "Combined with cooked beans, tomatoes, onions, and seasonings to produce frijoles charros.",
    "As a topping for a very Mexican pizza.",
    "2",
    "Used sparingly as a flavorful ingredient in certain hearty cream soups such as bean soup or Chorizo Pumpkin Soup."
  ],
  "ingredients": [
    "0",
    "2 pounds (900 grams) finely ground pork",
    "4 tablespoons chile powder (ground dried chile pepper)",
    "2 tablespoons ground paprika",
    "2 tablespoons dried oregano",
    "1 pinch ground cinnamon",
    "1 pinch ground cloves",
    "1 teaspoon ground cumin",
    "1 teaspoon salt",
    "2 cloves fresh garlic, crushed",
    "1/2 cup vinegar"
  ],
  "__v": 1
}