{
  "hash": "981beb8728f58b4f70725f36b6559573a928013a",
  "title": "French Onion Soup in the Slow Cooker",
  "image": "http://p-fst2.pixstatic.com/54cee32adbfa3f733b008914/_w.540_s.fit_/Lead-French-Onion-2494.jpg",
  "href": "http://www.thekitchn.com/how-to-make-french-onion-soup-in-the-slow-cooker-start-to-finish-cooking-lessons-from-the-kitchn-215696",
  "extension": "",
  "firstAdded": "2015-06-20T08:57:52.243000",
  "users": [
    null
  ],
  "keywords": [
    "yellow",
    "onions",
    "quartermoons",
    "unsalted",
    "butter",
    "olive",
    "oil",
    "salt",
    "black",
    "pepper",
    "balsamic",
    "vinegar",
    "beef",
    "broth",
    "brandy"
  ],
  "directions": [
    "0",
    "Season the onions: Place the onion slices in a 5-quart (or larger) slow cooker. Stir in the butter and olive oil, salt, and a generous quantity of black pepper.",
    "Cook on LOW for 12 hours: Cover and cook on LOW overnight or for 12 hours. The onions should be dark golden brown and soft.",
    "Add broth: Stir in the balsamic vinegar and the broth.",
    "Cook for 6 to 8 hours on LOW: Cover and continue cooking on LOW for 6 to 8 hours. This is flexible; as long as your slow cooker holds moisture well (wrap a towel over the lid if quite a lot of steam escapes), you can cook the soup for hours. Longer cooking will only intensify the flavors. Taste and season with more salt and pepper if desired, and stir in the brandy if using.",
    "Portion the soup into oven-safe bowls: Heat the oven to 350°F. Ladle the soup and onions into oven-safe bowls and place the bowls in a baking pan.",
    "Top with toast and shredded cheese: Top each bowl with a slice of toast and a generous quantity of shredded Gruyere cheese.",
    "Bake for 20 to 30 minutes: Bake on a rack in the upper third of the oven until the cheese is completely melted.",
    "Broil for 2 to 3 minutes: Turn the oven to broil and broil the soup for 2 to 3 minutes or until the cheese is bubbling and browned. Remove from the oven and let cool for a few minutes, then serve with chopped fresh onion on the side."
  ],
  "ingredients": [
    "0",
    "3 pounds yellow onions, peeled, sliced, and cut into quarter-moons",
    "2 tablespoons unsalted butter, melted",
    "2 tablespoons olive oil",
    "1 teaspoon salt, plus more to taste",
    "Freshly ground black pepper",
    "2 tablespoons balsamic vinegar",
    "10 cups beef broth",
    "3 tablespoons brandy, optional"
  ],
  "__v": 1
}