{
  "hash": "9d0d4e91160d5fd2b818f8c2ab4361c29fd36c93",
  "title": "Dark Chocolate Key Lime Pie Truffles",
  "image": "https://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2015/03/Dark-Chocolate-Key-Lime-Pie-Truffles-2.jpg",
  "href": "https://sallysbakingaddiction.com/2015/03/03/dark-chocolate-key-lime-pie-truffles/",
  "extension": "Chrome",
  "firstAdded": "2018-10-09T17:10:37.812000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "Be sure to read through the recipe and my tips/explanations/photos below the recipe so you know exactly what you are doing and why you are doing it. There is art (and science!) to truffle making.",
    "Heat the cream and lime zest in a small saucepan over medium heat. Stir it until the mixture barely comes to a boil. Remove from heat and allow the lime flavor infuse into the cream for 30 minutes.",
    "Meanwhile, place the chopped white chocolate into a medium heatproof bowl. Add the lime juice and butter to the bowl. Do not stir yet. Set aside.",
    "After 30 minutes, place the lime infused cream back over heat until it barely begins simmering again. Remove from heat and strain it through a mesh sieve overtop the white chocolate to remove the zest. Gently begin stirring the white chocolate mixture with a rubber spatula in one direction. Do not forcefully stir it. Use gentle, circular motions. Once all of the white chocolate is completely smooth, cover with a piece of plastic wrap pressed on the top of the ganache filling. Let it sit at room temperature for 1 hour, then transfer to the refrigerator for 5-6 more hours. Overnight is OK.",
    "After chilling, the ganache filling will be smooth and a little soft, but still manageable by hand. You want a soft filling-- this makes the truffles creamy.",
    "Line two large baking sheets with parchment paper or silicone baking mats. Set aside. Make sure you have enough room in your refrigerator for the baking sheets because the truffles must chill after being rolled in the next step.",
    "Measure 1 teaspoon of ganache filling and roll between your hands into a ball. Place on the prepared baking sheet. I like to wipe my hands clean with a paper towel between each truffle rolling. Clean hands make rolling the sticky truffles easier. Repeat rolling remaining truffles. Refrigerate the truffles as you melt the chocolate coating.",
    "Place the bittersweet chocolate in a medium heat-proof bowl. I like to use a liquid measuring cup. Its depth makes it easier for dipping the truffles. Melt in 30 second increments in the microwave, stirring after each increment until completely melted and smooth. Let the warm chocolate sit for 5 minutes to slightly cool before dipping. Alternatively, you can temper the chocolate. If tempering, do not store finished truffles in the refrigerator.",
    "Remove truffles from the refrigerator and begin dipping into the chocolate using the dipping tool suggested below this recipe. Alternatively, you can use a spoon, fork, toothpick, etc. The dipping tools make the process 100x easier, quicker, and your truffles will look better! Place the dipped truffles back onto the baking sheets. Melt the white chocolate and candy melts (if using) together in the same manner you melted the chocolate in step 8. Using a fork or a squeeze bottle, drizzle over the truffles. Allow truffles to set at room temperature for at least 1 hour.",
    "Make ahead tip: Store leftover truffles in the refrigerator for up to 1 week. Storing at room temperature is OK during cooler months, but the chocolate may get a little soft.",
    "Recipe Notes:",
    "Heavy cream, whipping cream, and double cream are all OK. As long as the milk fat of the cream is somewhere between 32 - 48%.",
    "See visual of chopped white chocolate below this recipe. The smaller, the better and more easily it will combine with the warm cream.",
    "Candy melts are used purely for green color. I mixed a few with the white chocolate to get a light lime green color. You can also tint the white chocolate with liquid green food coloring or leave it white. Or leave off the white chocolate drizzle altogether."
  ],
  "ingredients": [
    "0",
    "Truffles",
    "3/4 cup (180ml) heavy cream1",
    "zest of 2 limes",
    "14 ounces (395g) white chocolate, coarsely chopped2",
    "1 Tablespoon (15ml) fresh lime juice",
    "2 Tablespoons (30g) unsalted butter, softened to room temperature and cut into 4 pieces",
    "Topping",
    "18 ounces (509g) bittersweet chocolate, coarsely chopped",
    "optional: 4 ounces (113g) white chocolate, coarsely chopped",
    "optional: a few green candy melts3"
  ],
  "__v": 1
}