{
  "hash": "ed3dec1851d7b26ddcbe2b72305242cc94fa249b",
  "title": "QUINCE, CRANBERRY, AND APPLE SAUCE",
  "image": "",
  "href": "http://lidiasitaly.com/recipes/quince-cranberry-and-apple-sauce/",
  "extension": "Chrome",
  "firstAdded": "2018-02-28T16:35:46.491000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Put the spices, orange zest and orange juice in a sturdy 3- or 4-quart saucepan. Pour in the honey; slosh the sticky utensils with the warm water and pour that into the pan too.",
    "Rinse the quince, cut them in quarters and peel off the skin. Pare out the core and the seeds then slice each wedge crosswise in pieces about 1/3-inch thick. Drop the quince chunks into the saucepan and set it over moderate heat. Stir as the honey dissolves and the liquid comes to a bubbling simmer. Cover the pan, lower the heat a bit and cook slowly for about 5 minutes, until the quince chunks have started to soften, but don’t let them get mushy. Remove the pan from the heat.",
    "While the quince are cooking, peel, quarter and core the apples and cut into pieces the same size as the quince. Rinse and drain the cranberries. Stir the apple pieces and the berries into the pan. The syrupy liquid should just reach the top of the fruit; add water (or more orange juice) if there’s not enough.",
    "Put a cover on the pan and set it over moderate-high heat. Bring the syrup back to the boil and cook about 4 minutes until the cranberries are starting to pop (a bit longer if the berries were frozen).",
    "Uncover and simmer until the cranberries have broken up and turned to sauce, about 10 minutes. Stir frequently but gently so the quince and apple chunks stay intact. Remove from the heat while the sauce is still pourable—it will thicken as it cools. Taste and stir in honey, if you want a sweeter sauce.",
    "Cool briefly than lay a piece of plastic wrap on top of the sauce, to keep a skin from forming. Serve slightly warm or at room temperature. Store in the refrigerator, for up to 2 weeks. (You can freeze the sauce: the consistency will change but the flavor will be fresh.)"
  ],
  "ingredients": [
    "0",
    "6 whole cloves and/or a small piece of cinnamon stick",
    "Grated zest of a large orange",
    "Fresh juice of a large orange",
    "1/2 cup honey plus more to taste",
    "1/2 cup warm water plus more as needed",
    "2 or 3 ripe quince (about 12 ounces)",
    "1 large or 2 small tart, firm apple",
    "12 ounces (1 bag) whole cranberries, fresh or frozen"
  ],
  "__v": 1
}