{
  "hash": "2d598c4e402528a96c6e5e5464f946069574bf1e",
  "title": "GLAZED SALMON WITH CHILI-BASIL SAUCE",
  "image": "https://www.177milkstreet.com/assets/site/_medium/Glazed-Salmon-with-Chili-Basil-Sauce.jpg",
  "href": "https://www.177milkstreet.com/recipes/glazed-salmon-with-chili-basil-sauce",
  "extension": "Chrome",
  "firstAdded": "2018-06-24T14:04:07.401000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the oven to 400°F with a rack in middle position. In a small bowl, stir together ⅔ cup water, the chili-garlic sauce, sugar, fish sauce and soy sauce until the sugar dissolves. In another small bowl, stir together the cornstarch and 1 tablespoon water.",
    "In a medium saucepan over medium-high, heat 2 tablespoons of the oil until shimmering. Stir in the ginger and lemon grass and cook until fragrant, about 10 seconds.",
    "Pour in the chili-garlic sauce mixture and bring to a boil. Stir the cornstarch mixture to recombine, then stir into the sauce. Reduce to medium-low and simmer, stirring constantly, until thickened, about 3 minutes. Remove from the heat, stir in lemon juice and ½ cup basil. Cover to keep warm.",
    "Season the fillets on both sides with salt and pepper. In a 12-inch oven-safe skillet over medium-high, heat the remaining 1 tablespoon oil until just beginning to smoke.",
    "Add the fillets flesh side down, reduce to medium and cook until golden brown, about 4 minutes. Transfer the skillet to the oven and cook until the thickest part of the fillets register 115°F to 120°F or are nearly opaque when cut into, 4 to 6 minutes. Remove from the oven.",
    "Using tongs, carefully peel off and discard the skin from each fillet. With a wide metal spatula, transfer the fillets to a platter, turning them browned side up. Pour half of the sauce over the fish and sprinkle with the remaining 1 tablespoon basil. Serve the remaining sauce on the side."
  ],
  "ingredients": [
    "0",
    "2 tablespoons chili-garlic sauce",
    "2 tablespoons packed dark brown sugar",
    "1 tablespoon fish sauce",
    "2 teaspoons soy sauce",
    "2 teaspoons cornstarch",
    "3 tablespoons grapeseed or other neutral oil, divided",
    "1 tablespoon finely grated fresh ginger",
    "1 lemon grass stalk, trimmed to the lower 5 or 6 inches, dry outer layers discarded, minced",
    "2 tablespoons lemon juice",
    "½ cup plus 1 tablespoon chopped fresh basil leaves, divided",
    "4 6-ounce center-cut salmon fillets (each 1 to 1¼ inches thick), patted dry",
    "Kosher salt and ground black pepper"
  ],
  "__v": 1
}