{
  "hash": "5545b4f5e3b87f7e412e660ffe14ab205048fb7b",
  "title": "CAULIFLOWER RICE CAKE + POOR MAN’S X.O. SAUCE",
  "image": "http://ladyandpups.com/wp-content/uploads/2014/11/cauliflower-rice-cake15.jpg",
  "href": "http://ladyandpups.com/2014/11/20/cauliflower-rice-cake-poor-mans-x-o-sauce/",
  "firstAdded": "2014-12-09T19:26:42.239000",
  "users": [
    null
  ],
  "keywords": [
    "chinese",
    "shrimps",
    "mediumsize",
    "shitake",
    "mushrooms",
    "shaoxing",
    "wine",
    "sherry",
    "water",
    "approx",
    "square",
    "prosciutto",
    "ham",
    "garlic",
    "shallots",
    "red",
    "chilis",
    "paprika",
    "oil",
    "oyster",
    "brown",
    "sugar",
    "white",
    "pepper",
    "rice",
    "flour",
    "sticky",
    "riceglutinous",
    "links",
    "cantonese",
    "sausauge",
    "chang",
    "chunks",
    "cauliflower",
    "florets",
    "salt",
    "browning",
    "dusting"
  ],
  "directions": [
    "0",
    "TO MAKE THE POOR MAN'S X.O. SAUCE: Mix dried shrimps, dried mushrooms, shaoxing wine and 1/4 cup of water in a bowl, and microwave on high for 1 min (stopping/mixing once in between). Let sit for 10 min until the mushrooms are plumped. Strain the dried shrimps and mushroom, and keep the liquid. In a food-processor, grind the dried shrimps, mushrooms, Chinese ham (or prosciutoo), garlic and shallots until finely ground. The texture should be like extra fine breadcrumbs.",
    "Add the ground mixture into a pot, along with diced chilis, dried chilis, ground paprika and vegetable oil, and the reserved shrimp/mushroom liquid. Bring to a simmer over medium-low heat, and continue to cook while stirring for about 20 min, until all the moisture has completely evaporated. If there are any foams or bubble on the surface, skim them off.",
    "Now add the oyster sauce, brown sugar and ground white pepper, and continue to cook for another 5 min low medium-low heat. Turn off the heat and let sit for at least 2 hour before serving. Can be stored in an air-tight jar inside the fridge for up to 3 weeks.",
    "TO MAKE THE CAULIFLOWER RICE CAKE: Combine white rice flour and sticky rice flour in a large bowl, set aside. In a skillet, cook chopped dried shrimps and diced Cantonese dried sausage, along with 1 tbsp of oil and 1 1/2 tbsp of water (the water helps plump up/soften the dried shrimps and sausage) over medium-high heat, until the water has evaporated and the ingredients are slightly browned. Set aside.",
    "Bring 2 cups of water and 1 tsp of salt to boil, then cook the diced cauliflower florets (make sure they are small) for about 5 min until soft. WE NEED the cooking water, so remove the cauliflower with a slotted spoon and set aside. Let the cooking-water cool down to just warm to the touch (if it's too hot, it'll completely cook the flour). Then first add 3/4 cup (170 grams) of the cooking-water into the rice flour-mixture, and whisk until it becomes a loose batter (consistency like melted ice cream). Add 2 tbsp more cooking-water to adjust if needed. Then mix in the cooked cauliflower, dried shrimps and sausages (with all the rendered oil) until evenly incorporated.",
    "Heat up 3 tbsp of vegetable oil in a 8\"~10\" non-stick skillet over medium-high heat (to avoid extra dish-washing, cook the dried shrimps/sausage in the same skillet). Add the batter and distribute it evenly across, put a lid on so the center can be cooked through, then cook until the first side is golden-browned. Flip the rice cake *(or if you find it easier, flip it into another heated skillet with another tbsp of oil), and brown the other side as well (also with a lid on). Dust with a bit of ground white pepper and serve immediately with poor man's X.O. sauce.",
    "Instead of one big rice cake, you can also make several mini ones."
  ],
  "ingredients": [
    "0",
    "3 tbsp (30 grams) Chinese dried shrimps",
    "8 medium-size (12 grams) dried shitake mushrooms",
    "2 tbsp shaoxing wine, or sherry",
    "1/4 cup water",
    "Approx 3/4\" square (30 grams) Chinese ham, or prosciutto ham",
    "4 cloves garlic",
    "2 small shallots",
    "3 small red chilis, diced",
    "6 small dried chilis, whole",
    "1 tsp ground paprika",
    "3/4 cup (165 grams) vegetable oil",
    "1 tbsp oyster sauce",
    "1/4 tsp brown sugar",
    "1/8 tsp ground white pepper",
    "3/4 cup (100 grams) white rice flour",
    "1/2 cup (70 grams) sticky rice/glutinous rice flour",
    "2 tbsp (20 grams) Chinese dried shrimps, finely chopped",
    "2 links Cantonese dried sausauge (la chang), diced in small chunks",
    "About 3 cups (270 grams) cauliflower florets",
    "2 cups water + 1 tsp salt",
    "2 ~ 3 tbsp vegetable oil for browning",
    "Ground white pepper for dusting"
  ],
  "__v": 1
}