{
  "hash": "ebd161621752433676d1102da9833fcf5cb7db73",
  "title": "Firecracker Red White and Blue Cake",
  "image": "http://www.bettycrocker.com/~/media/Images/Betty-Crocker/Tips/TipsLibrary/Baking-Tips/how-to-make-the-most-patriotic-cake-ever/how-to-make-the-most-patriotic-cake-ever_hero.jpg",
  "href": "http://www.bettycrocker.com/how-to/tipslibrary/baking-tips/how-to-make-a-firecracker-cake-for-the-fourth?utm_medium=social&amp;utm_source=pinterest.com&amp;utm_campaign=standard&amp;crlt.pid=camp.5aoNIXa6yT6s",
  "extension": "Firefox",
  "firstAdded": "2015-07-05T00:08:05.838000",
  "users": [
    null
  ],
  "keywords": [
    "box",
    "betty",
    "crocker",
    "supermoist",
    "white",
    "cake",
    "water",
    "oil",
    "egg",
    "whites",
    "called",
    "red",
    "food",
    "color",
    "blue",
    "container",
    "whipped",
    "fluffy",
    "frosting"
  ],
  "directions": [
    "0",
    "1 Heat oven to 325°F. Generously grease 12-cup fluted tube cake pan. Make cake batter as directed on box, using water, oil and egg whites. Pour 1 cup of the batter into small bowl; stir in red food color until well mixed. Pour another cup of the batter into separate bowl; stir in blue food color until well mixed.",
    "2 Pour red cake batter into bottom of pan. Carefully pour remaining white batter over red batter in pan. Carefully pour blue batter over white batter. (Blue batter does not need to cover white batter completely; it looks better if it just forms a ring in the center of the white batter.)",
    "3 Bake as directed on box or until toothpick inserted near center comes out clean. Cool cake 5 minutes. Meanwhile, place cooling rack over cookie sheet. Turn pan upside down onto cooling rack. Cool cake completely, about 30 minutes.",
    "4 When cake is cool, divide frosting evenly into 3 microwavable bowls. Microwave 1 bowl of frosting uncovered on High a few seconds until smooth enough to drizzle over cake. With spoon, drizzle all of white frosting back and forth around cake in a striping pattern. Repeat microwaving second bowl of frosting until smooth. Stir in a few drops blue food color until well blended. Drizzle over cake, scattering frosting back and forth. Repeat with remaining bowl of frosting and red food color, making sure red, white and blue frostings can be seen on cake. Let cake stand at room temperature until frosting is set before serving."
  ],
  "ingredients": [
    "0",
    "1 box Betty Crocker™ SuperMoist™ white cake mix",
    "Water, vegetable oil and egg whites called for on cake mix box",
    "Red food color",
    "Blue food color",
    "1 container (12 oz) Betty Crocker™ Whipped fluffy white frosting"
  ],
  "__v": 1
}