{
  "hash": "c0df000ee434cb02712cd7f4e162475915b0a5a6",
  "title": "luten-free, egg-free, dairy-free sachertorte",
  "image": "//i.guim.co.uk/static/w-300/h--/q-95/sys-images/Guardian/Pix/pictures/2013/10/16/1381942794548/Cook---sachertorte-for-Ju-008.jpg",
  "href": "http://www.theguardian.com/lifeandstyle/2013/oct/18/sachertorte-gluten-egg-dairy-free-recipe",
  "extension": "Chrome",
  "firstAdded": "2015-05-19T03:06:28.941000",
  "users": [
    null
  ],
  "keywords": [
    "cake",
    "dairyfree",
    "margarine",
    "extra",
    "grease",
    "dark",
    "chocolate",
    "sugar",
    "almonds",
    "gram",
    "chickpea",
    "flour",
    "glutenfree",
    "baking",
    "vanilla",
    "soya",
    "milk",
    "lemon",
    "juice",
    "icing",
    "apricot",
    "jam",
    "water"
  ],
  "directions": [
    "0",
    "1 Heat the oven to 160C/325F/gas mark 3. Grease three cake tins with a little dairy-free margarine and line the bases with a circle of baking parchment. Break the chocolate into chunks and melt in a heatproof bowl over a saucepan of simmering water.",
    "2 Cream together the margarine and sugar until pale and fluffy. Stir in the chocolate, ground almonds, gram flour, baking powder and vanilla extract. Gradually pour in the soya milk and lemon juice and mix.",
    "3 Immediately divide the mixture between the cake tins and spread it out evenly. Put the tins in the oven. Cook for 25-30 minutes until a skewer inserted in the centre comes out clean. Allow the cakes to cool in their tins.",
    "4 Run a knife round the edge of the first cake and remove it from its tin by turning it upside down on to a large plate. Warm the apricot jam in the microwave or over a low heat and extract any whole bits of fruit. Spread half of it over the cake layer using a palette knife. Repeat with the second layer. Place the third layer on top.",
    "5 To make the icing, melt the chocolate as before. Mix the icing sugar and water. Place the bowl of chocolate over a bath of iced water and whisk in the sugar water until the consistency becomes spreadable. Apply to the cake with a damp palette knife and smooth off as necessary. Allow to set for at least an hour before serving. Eat the cake within a couple of days."
  ],
  "ingredients": [
    "0",
    "For the cake",
    "150g dairy-free margarine",
    ", extra to grease",
    "200g dairy-free dark chocolate",
    "150g sugar",
    "125g ground almonds",
    "150g gram (chickpea) flour",
    "2 tsp gluten-free baking powder",
    "1 tsp vanilla extract",
    "150ml soya milk",
    "2 tsp lemon juice",
    "For the icing",
    "75g apricot jam",
    "125g dairy-free dark chocolate",
    "100ml water",
    "25g icing sugar"
  ],
  "__v": 1
}