{
  "hash": "3c63cac0efa42856216901394e039a9962fa38f2",
  "title": "90-Minute Buttercrust Bread",
  "image": "http://redstaryeast.com/wp-content/uploads/2015/10/90-Minute-Buttercrust-Bread-resized.jpg",
  "href": "http://redstaryeast.com/90-minute-buttercrust-bread/",
  "extension": "Chrome",
  "firstAdded": "2015-12-31T19:27:38.906000",
  "users": [
    null,
    null
  ],
  "keywords": [
    "bread",
    "flour",
    "red",
    "star",
    "platinum",
    "yeast",
    "sugar",
    "salt",
    "milk",
    "water",
    "butter",
    "margarine"
  ],
  "directions": [
    "0",
    "In a large mixer bowl, combine 2½ cups flour, yeast, sugar and salt; mix well. In saucepan or microwave-safe bowl, heat milk, water and 3 Tbsp butter until warm (120-130°F; butter does not need to melt). Add to flour mixture. Beat at low speed until moistened; beat 3 minutes at medium speed. By hand, gradually stir in enough remaining flour to make a firm dough. Knead on floured surface until smooth and elastic, 5 to 8 minutes. Place in greased bowl, turning to grease top. Cover; let rise in warm oven (Turn oven to lowest setting for 1 minute, turn off.) for 20 minutes.",
    "Punch down dough. Divide into 2 parts. On lightly floured surface, roll or pat each half to a 14x7-inch rectangle. Starting with shorter side, roll up tightly, pressing dough into roll with each turn. Pinch edges and ends to seal. Place in greased 8x4-inch bread pans. Cover; let rise in warm oven until almost doubled, about 30 minutes. With a very sharp knife, make a slash across the top of each loaf and pour melted butter into each slash. Bake at 400°F for 20 to 25 minutes until golden brown. Remove from pans; cool.",
    "Recipe featured at Stephie Cooks."
  ],
  "ingredients": [
    "0",
    "5½ to 6 cups bread flour",
    "2 packages (4½ tsp) RED STAR Platinum Yeast",
    "2 Tbsp sugar",
    "1 Tbsp salt",
    "1 cup milk",
    "1¼ cups water",
    "3 Tbsp butter or margarine",
    "1 Tbsp butter or margarine, melted"
  ],
  "__v": 2
}