{
  "hash": "6fa534c8d93a3893c663f4d420b476d341d9981c",
  "title": "Rice and Zucchini Crostata",
  "image": "http://lidiasitaly.com/images/recipes/rice_and_zucchini_crostata_1024_t.jpg",
  "href": "http://lidiasitaly.com/recipes/detail/1024",
  "extension": "Chrome",
  "firstAdded": "2015-06-16T09:39:32.472000",
  "users": [
    null
  ],
  "keywords": [
    "dough",
    "allpurpose",
    "flour",
    "working",
    "kosher",
    "salt",
    "extravirgin",
    "olive",
    "oil",
    "cold",
    "water",
    "needed",
    "filling",
    "zucchini",
    "italian",
    "shortgrain",
    "rice",
    "arborio",
    "carnaroli",
    "ricotta",
    "preferably",
    "overnight",
    "grana",
    "padano",
    "parmigianoreggiano",
    "bunches",
    "scallions",
    "eggs",
    "lightly",
    "milk",
    "butter",
    "baking",
    "pan"
  ],
  "directions": [
    "0",
    "You will need a baking stone, if you have one; a 12-by- 18- inch rimmed baking sheet (a half-sheet pan).",
    "To make the dough: Put the 2 cups flour and the salt in the food processor fitted with the metal blade. Pulse a few seconds to aerate. Mix the oil and water together in a spouted measuring cup. With the processor running, pour the liquid through the feed tube and process about 30 seconds, until a soft dough forms and gathers on the blade. If it doesn't, it is probably too dry. Add more water, in small amounts, until you have a smooth, very soft dough. a Turn the dough out onto a lightly floured surface and knead by hand for a minute, until it's smooth and soft. Pat into a rectangle and wrap in plastic wrap. Let rest at room temperature for 1/2 hour. (The dough can be refrigerated for up to a day, or frozen for a month or more. Defrost in the refrigerator, and return to room temperature before rolling.) To make the filling: Shred the zucchini on the coarse holes of a box grater into a large bowl. Toss the rice and shredded zucchini together, and let sit for 30 minutes to an hour, so the grains absorb the vegetable liquid. Fold in the ricotta (breaking up any lumps), then the grated cheese, scallions, beaten eggs, milk, and salt, stirring until thoroughly mixed. When you're ready to bake the torta, set a rack in the bottom half of the oven-with a baking stone on it, if you have one-and heat the oven to 375º. Spread the butter on the bottom and sides of the pan. On a lightly floured surface, roll the dough to a rectangle that's at least 4 inches longer and wider than the baking sheet. Transfer the dough to the pan, either by folding it in quarters and lifting it onto the sheet, or by rolling it up around the floured rolling pin and then unfurling it over the baking sheet. When the dough is centered over the pan, then gently press it flat against the bottom and rim of the pan, leaving even flaps of overhanging dough on all sides. (If the dough tears as you are moving it, patch it with a bit of dough from the edges.) Pour and scrape the rice-zucchini filling into the dough-lined pan, and spread it to fill the crust in an even layer. Fold the dough flaps over the top of the filling, pleating the corners, to form a top crust border that looks like a picture frame, with the filling exposed in the middle. Set the pan in the oven (on the heated stone), and bake until the crust is deep golden brown and the filling is set, 45 minutes to an hour. About halfway through the baking time, turn the pan in the oven, back to front, for even color and cooking. Cool the torta on a wire rack for at least 30 minutes to set the filling before slicing. The torta can be served warm or at room temperature, cut into appetizer or bite-sized pieces in any shape you like- squares, rectangles, triangles, or diamond"
  ],
  "ingredients": [
    "0",
    "For the Dough",
    "2 cups all-purpose flour, plus more for working",
    "1 teaspoon kosher salt",
    "½ cup extra-virgin olive oil",
    "⅓ cup cold water, plus more as needed",
    "For the Filling",
    "1 pound small zucchini",
    "½ cup Italian short-grain rice, such as Arborio or Carnaroli",
    "2 cups ricotta, preferably fresh, drained overnight",
    "1 cup Grana Padano, or Parmigiano-Reggiano, grated",
    "2 bunches scallions, finely chopped (about 2 cups)",
    "3 large eggs, lightly beaten",
    "2 cups milk",
    "2 teaspoons kosher salt",
    "Butter for the baking pan"
  ],
  "__v": 1
}