{
  "hash": "be52cbb6537e2a773499db3cf7573e88e8188fa5",
  "title": "Russian pirogki with potato filling /sour milk&yeast dough/",
  "image": "https://milkandbun.files.wordpress.com/2016/03/pirozhki-2.jpg?w=650",
  "href": "https://milkandbun.com/2016/03/23/russian-pirogki/",
  "extension": "Chrome",
  "firstAdded": "2018-12-11T12:56:30.734000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Method",
    "Dough",
    "Sift the flour into a large mixing bowl, combine with yeast.",
    "In a cup/bowl stir kefir with oil, salt and sugar.",
    "Pour kefir mixture into flour. Mix to combine a dough. Cover with kitchen towel or plastic wrap and leave to prove for 45-60 minutes.",
    "While the dough is proving, prepare the potato filling (recipe below).",
    "When it’s risen, divide the dough into several equal balls. The size depends on your taste: if you wish to make small pirogki – you need small dough balls. Roll each ball slightly into round shape. The dough is soft and tender, that sometimes I don’t use rolling-pin and carefully stretch the dough with hands.",
    "Put a tablespoon or two of potato filing into each round, close and arrange onto lined with baking paper baking tray.",
    "Leave to rise for 10-15 minutes. Brush with egg wash.",
    "Bake in a preheated 180C oven for 20 minutes.",
    "Optionally, you can brush pirogki with butter. Cover with kitchen towel: it helps the dough to stay softer.",
    "Serve warm with milk or tea.",
    "Potato filling",
    "In a large pan, bring water to boil. Add potatoes and bay leave, bring to boil again, reduce the heat and simmer on a medium heat for 15-20 minutes or until potatoes are soft and ready.",
    "Meanwhile, in a small frying pan, heat oil and butter, fry onions on a medium heat until soft and lightly brown. Stir in thyme and saute for a minute more.",
    "Drain potatoes (leave 2 tbsp of water in a pan). Add butter, nutmeg and season to taste. Mash it. Stir in fried onion and fresh parsley."
  ],
  "ingredients": [
    "0",
    "Instead of kefir you can use laban, buttermilk or any soured milk.",
    "Ingredients",
    "Dough",
    "180g plain flour",
    "6g instant yeast",
    "250ml kefir, warm/at room temperature",
    "50ml sunflower oil",
    "a good pinch of fine salt (about 1/2 tsp)",
    "1 tsp white sugar",
    "1 egg yolk mixed with 1 tbsp milk, for glazing",
    "Potato filling",
    "400g potatoes, peeled and cut into chunks",
    "1 bay leave",
    "1 tbsp oil (olive or sunflower)",
    "a small knob of butter",
    "1 medium onion, chopped",
    "1/2 tsp dried thyme (or 1 tsp fresh thyme leaves)",
    "15g butter",
    "a pinch of freshly grated nutmeg, optional",
    "salt, black paper to taste",
    "some finely chopped parsley (2-3 tbsp)"
  ],
  "__v": 1
}