{
  "hash": "a7e4bbe4b4fe80fc4fe69de828e940cd9859bd07",
  "title": "VEGAN GENERAL TSO’S TOFU",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2013/11/general-tso-tofu-1066x800.jpg",
  "href": "http://www.onegreenplanet.org/plant-based-recipes/vegan-general-tsos-tofu-with-steamed-broccoli-and-5-spice-brown-rice/",
  "firstAdded": "2015-01-19T15:47:55.084000",
  "users": [
    null
  ],
  "keywords": [
    "extrafirm",
    "tofu",
    "pressed",
    "arrowroot",
    "glutenfree",
    "lowsodium",
    "tamari",
    "ginger",
    "canola",
    "peanut",
    "oil"
  ],
  "directions": [
    "0",
    "Cut the tofu into cubes. In a shallow bowl, combine the arrowroot, tamari and ginger. Whisk until smooth. Add the tofu and toss to coat. Let the tofu marinate for at least half an hour, the longer the better.",
    "While the tofu is marinating, prepare the rice. Rinse the rice with cool water. Add it to a saucepan with 4 cups of water and 1 tsp. 5-spice powder. Stir, cover and cook over medium-high heat. When the water comes to a boil, lower the heat to low and allow the rice to simmer until the liquid is absorbed, about 30-40 minutes. When all the liquid has been absorbed, turn off the heat and let sit for 10 minutes. Then uncover and fluff with a fork.",
    "When the rice has finished cooking, heat 1 Tbs. of canola or peanut oil in a large skillet over medium-high heat. Add the tofu to the skillet and cook until golden brown on all sides, about 4 minutes per side. Remove the tofu from the skillet and set aside. Remember there is an even number of tofu cubes. If you eat one, someone is going to end up short. Wipe out the skillet because you’re going to use it again.",
    "Bring a large pot of water to a boil. Add the broccoli florets and a pinch of salt to the steamer basket. Cover and steam until the broccoli is tender and bright green, about 4-5 minutes.",
    "In a large measuring cup or bowl, combine the sesame oil, tamari, arrowroot, ginger, vegan honey or agave and hot sauce, if using. Whisk until smooth. Set aside. Heat the canola oil or peanut oil in a large skillet over medium heat. Add the scallions and garlic and cook until fragrant, about 2-3 minutes. Add the sauce to the skillet and let it cook until it thickens a bit. If it gets too thick, add some water. Add the tofu to the skillet and toss to coat in the sauce and reheat the tofu.",
    "Garnish the tofu with sesame seeds and serve with the steamed broccoli and the 5-spice brown rice."
  ],
  "ingredients": [
    "0",
    "1 package extra-firm tofu, drained and pressed",
    "1 tbsp. arrowroot",
    "3 tbsp. gluten-free, low-sodium tamari",
    "1 tbsp. fresh ginger, grated or 1 tsp. ground",
    "1-2 tbsp. canola or peanut oil"
  ],
  "__v": 1
}