{
  "hash": "ccd614e0fbea33fb038f48f7bb6b6ba42eddff86",
  "title": "chicken, spinach & feta meatballs",
  "image": "http://thefreshaussie.com/wp-content/uploads/2016/04/blackberries-680x907-1-150x150.jpg",
  "href": "http://thefreshaussie.com/",
  "extension": "Chrome",
  "firstAdded": "2016-05-29T11:49:48.385000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat 1 tablespoon of olive oil, onion & garlic in a large frying pan over medium-high heat. Cook, stirring occasionally, for 5 minutes until onion is softened. Add spinach & stir for 1 minutes or until spinach is just wilted. Remove from heat & let cool slightly.",
    "Grab a medium sized bowl & throw in the chicken, feta, ground almonds, egg, rosemary, nutmeg, salt & pepper. Mix until well combined. Then add the spinach mixture. Stir (or use your hands to mix) until thoroughly combined.",
    "Line a baking sheet with parchment or waxed paper. Using a round 1 tablespoon measure (mine was 15ml, 20ml will work too you’ll just end up with a couple less balls), drop tablespoons of the mixture onto baking sheet. Chill for 30 minutes (in fridge or freezer if you have the space). Roll into balls. I find if your hands are a little damp it prevents the mixture from sticking. Makes about 32 meatballs.",
    "Wipe out the same frying pan. Heat 1 tablespoon of olive oil in pan over medium-high heat. Cook meatballs in two batches, turning occasionally, for about 7 to 8 minutes or until browned & cooked thoroughly – you might have to break one open to test if they’re cooked. Remove to a paper towel-lined plate or baking sheet. Repeat with remaining oil & meatballs.",
    "Heat stock in a medium saucepan over medium-high heat until it’s hot. Add beans & heat 1 to 2 minutes or until hot.",
    "Divide meatballs between four bowls. Place 7 to 8 meatballs in each bowl. Ladle beans & stock over meatballs into bowls. Add a small dollop of sambal if desired."
  ],
  "ingredients": [
    "0",
    "1 tablespoon olive oil, plus 2 tablespoons extra",
    "1/2 cup diced onion",
    "4 garlic cloves, crushed",
    "2 cups chopped fresh spinach",
    "1 lb (453g) ground chicken (chicken mince)",
    "1/2 cup crumbled feta cheese",
    "3 tablespoons ground almonds (almond flour/almond meal)",
    "1 egg, lightly beaten",
    "1 1/2 teaspoons finely chopped fresh rosemary",
    "1/2 teaspoon ground nutmeg",
    "1/2 teaspoon salt & freshly ground pepper",
    "2 cups chicken stock",
    "2 cups cooked white beans (navy, Great Northern, white kidney beans)",
    "sambal oelek (chili paste), to serve"
  ],
  "__v": 1
}