{
  "hash": "0a4e9c40da66fcfbf2bfd70ed45c8cc2da020a69",
  "title": "Pecan Sandies",
  "image": "https://www.washingtonpost.com/rf/image_982w/2010-2019/WashingtonPost/2017/11/30/Food/Images/PecanSandlesBacon-1562.jpg",
  "href": "https://www.washingtonpost.com/recipes/pecan-sandies-bacon/16103/?utm_term=.2cf77d167eec",
  "extension": "Firefox",
  "firstAdded": "2017-12-23T18:46:18.208000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven 325 degrees. Line a few baking sheets with parchment paper or silicone liners.",
    "Spread the pecans on one of the sheets; toast in the oven (middle rack) for 10 to 12 minutes, checking on them after 8 minutes. They should be fragrant and lightly browned. Cool completely, then coarsely chop to pea-size.",
    "Combine the butter and granulated sugar in the bowl of a stand mixer or use a handheld electric mixer; beat on medium speed for about 3 minutes, until creamy and lightened. Stop to scrape down the bowl.",
    "Add the water and vanilla extract, beating (low speed) to incorporate, then add the flour and chopped pecans. Beat until evenly incorporated.",
    "Scoop the dough into 1-ounce portions (or use 2 tablespoons’ worth) to roll into 24 equal balls. Arrange them on the baking sheets, pressing each ball slightly with the palm of your hand. Space the balls at least 1 1/2 inches apart.",
    "Sprinkle each portion with a little of the salt and a liberal amount of Demerara sugar. Bake one sheet at a time (middle rack) for 16 to 18 minutes, until light brown on top and golden brown on the bottom. Transfer to wire racks to cool completely.",
    "VARIATION: Cook 3 slices of bacon, starting in a cold skillet over medium heat. Drain on paper towels, then chop into 1/4-inch pieces. Add to the dough along with the chopped pecans."
  ],
  "ingredients": [
    "0",
    "1 1/4 cups raw pecan halves",
    "18 tablespoons (2 sticks plus 2 tablespoons) unsalted butter, at room temperature",
    "1/2 cup plus 2 tablespoons granulated sugar",
    "2 teaspoons water",
    "2 teaspoons vanilla extract",
    "2 cups plus 2 tablespoons flour",
    "Sea salt, for sprinkling",
    "Demerara sugar, for sprinkling (see headnote)"
  ],
  "__v": 1
}