{
  "hash": "14a0f18335cea60177076e95c6f1378ee3df1814",
  "title": "Egg Plant Lasagna Roll Ups",
  "image": "http://spicycarrot.com/wp-content/uploads/2014/04/eggplant1a.jpg",
  "href": "http://spicycarrot.com/egg-plant-recipes/",
  "extension": "Chrome",
  "firstAdded": "2016-04-16T17:49:21.078000",
  "users": [
    null
  ],
  "keywords": [
    "tomatoes",
    "tomato",
    "medium",
    "onion",
    "red",
    "pepper",
    "garlic",
    "lemon",
    "juice",
    "basil",
    "coconut",
    "oil",
    "oregano",
    "container",
    "cottage",
    "cheese",
    "pkg",
    "frozen",
    "spinach",
    "parmesan",
    "cheddar",
    "egg",
    "slightly",
    "whipped",
    "eggplant",
    "salt"
  ],
  "directions": [
    "0",
    "Saute the onion and red pepper in a large sauce pan with coconut oil until soft and onions are clear. Add remaining ingredients. Let simmer until the excess moisture boils off.",
    "Drain cottage cheese of excess moisture. In a large microwave bowl defrost spinach for 2 minutes in the microwave. Drain spinach. I put the thawed spinach in a strainer and gentle press it to get the moisture out. Save the spinach liquid to add to the sauce.",
    "Add the spinach to the cottage cheese and add remaining ingredients.",
    "Wash Eggplant and cut off the top and bottom. You can peel it if you want but I left the peel on. Place eggplant on their bottom and carefully slice into 1/8\" slices. Place eggplant slices on a paper towel and sprinkle with sea salt. Leave the slices for about a half hour to allow the eggplant to drain off excess moisture and bitter flavors.",
    "Add coconut oil to pan and allow to heat up before adding the eggplant. Place eggplant in pan a couple at a time with no overlap. Cook on medium heat until the eggplant softens and turns slightly brown. Turn eggplant over and brown on the other side. Remove and put on paper towel to remove excess oil.",
    "Place cooked eggplant slices on a flat counter, scoop about 1-2 Tbsp of cheese filling onto the eggplant and spread evenly being careful not to go to close to the edges. Gently roll up the eggplant and place seam side down in a oven safe casserole dish. Once all the eggplant is used and rolled up pour sauce over top and bake in oven for 30 - 40 minutes until the sauce is bubbly and hot through out."
  ],
  "ingredients": [
    "0",
    "1 Can (796 ml / 28 fl oz) Chopped Tomatoes",
    "1 Can (156 ml / 5.5 fl oz) Tomato Paste",
    "1 medium onion",
    "1 Red Pepper Chopped",
    "1 Tbsp minced Garlic",
    "1 Tbsp Lemon Juice",
    "1 Tbsp Dried Basil",
    "1 Tbsp Coconut Oil",
    "1 Tsp dried oregano",
    "1 container (16 oz / 457 gr) of Cottage Cheese",
    "1 pkg (10 oz / 283 gr) frozen Spinach",
    "1/2 cup Parmesan cheese Shredded",
    "1 Cup Cheddar Shredded",
    "1 egg slightly whipped",
    "1 large Eggplant",
    "2 Tbsp Coconut Oil",
    "Sea Salt"
  ],
  "__v": 1
}