{
  "hash": "8bcb7eda35287bb6bea1d42d03095d6a3b3f3c16",
  "title": "How to Make Vegan Butter - Regular Vegan Butter - Coconut Oil Base",
  "image": "http://1-ps.googleusercontent.com/xk/RDeQ982pcM5TbWNbohGk0e9zvL/www.veganbaking.net/farm6.staticflickr.com/5068/640xNx5627427715_780c832fac_z.jpg.pagespeed.ic.1nLOniA8iwBE1crbQGB1.webp",
  "href": "http://www.veganbaking.net/recipes/fats/vegan-butters/vegan-butter",
  "firstAdded": "2015-01-19T15:40:28.776000",
  "users": [
    null
  ],
  "keywords": [
    "soy",
    "milk",
    "apple",
    "cider",
    "vinegar",
    "coconut",
    "total",
    "salt",
    "refined",
    "oil",
    "canola",
    "light",
    "olive",
    "rice",
    "bran",
    "sunflower",
    "lecithin",
    "granules",
    "xanthan",
    "gum",
    "psyllium",
    "husk"
  ],
  "directions": [
    "0",
    "Curdle your soy milk",
    "Place the soy milk, apple cider vinegar, coconut vinegar and salt in a small cup and whisk together with a fork. Let it sit for about 10 minutes so the mixture curdles.",
    "2) Mix your Vegan Butter ingredients",
    "Melt the coconut oil in a microwave so it's barely melted and as close to room temperature as possible. Measure it and add it and the canola oil to a food processor. Making smooth Vegan Butter is dependent on the mixture solidifying as quickly as possible after it's mixed. This is why it's important to make sure your coconut oil is as close to room temperature as possible before you mix it with the rest of the ingredients.",
    "3) Transfer the Vegan Butter to a mold so it solidifies",
    "Add the soy milk mixture, soy lecithin and xanthan gum to the food processor. Process for 2 minutes, scraping down the sides halfway through the duration. Pour the mixture into a mold and place it in the freezer to solidify. An ice cube mold works well. The Vegan Butter should be ready to use in about an hour. Store it in an airtight container in the refrigerator for up to 1 month or wrapped in plastic wrap in the freezer for up to 1 year. Makes 1 cup (215 grams), or the equivalent of 2 sticks Regular Vegan Butter."
  ],
  "ingredients": [
    "0",
    "¼ cup + 2 teaspoons soy milk",
    "½ teaspoon apple cider vinegar",
    "½ teaspoon coconut vinegar (if you can’t find coconut vinegar, substitute with ½ teaspoon apple cider vinegar so the total is 1 teaspoon apple cider vinegar)",
    "¼ + ⅛ teaspoon salt",
    "½ cup + 2 Tablespoons + 1 teaspoon (130 grams) refined coconut oil, melted",
    "1 Tablespoon canola oil, light olive oil or rice bran oil",
    "1 teaspoon liquid soy lecithin or liquid sunflower lecithin or 2 ¼ teaspoons soy lecithin granules",
    "¼ teaspoon xanthan gum or ½ + ⅛ teaspoon psyllium husk powder"
  ],
  "__v": 1
}