{
  "hash": "2ba0ca1d560b514b9f38aa5cfba5dfbbbede386a",
  "title": "Chili",
  "image": "",
  "href": "https://www.casichili.net/2017-brent-allen.html",
  "extension": "Chrome",
  "firstAdded": "2019-11-11T09:30:41.094000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cooking Instructions:",
    "Start time 3 hrs. before turn-in.",
    "Brown meat in skillet with 1 T bacon grease. Break up meat as it cooks, but only to about golf-ball size chunks. When nearly done cooking, season with onion powder and seasoned salt. Add 10 shakes Louisiana Hot Sauce.",
    "While meat is cooking, in stock pot combine 1 can beef broth, ½ can chicken broth, 2 oz. water and 1 beef cube. Bring to a boil and put in Dump #1. Let simmer a few minutes to allow spices to dissolve well and add in tomato sauce. Gently boil for about 15 minutes. Add in cooked meat that has been well drained. Cook, covered, at very low boil for 30 minutes.",
    "Turn off heat and let sit for 1 hr – or until 1 hr. before turn-in.",
    "Bring back to a boil. Add in Dump #2 at approximately 40 minutes before turn –in. Let boil gently, very low boil to high simmer. Break up meat gently using meat “masher” or potato masher. Taste for spice and salt 15 minutes before turn-in. Adjust as needed."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "2# HEB 80/20 Ground Chuck",
    "1 can ea. Swanson Beef Broth and Chicken Broth",
    "8 oz can Hunts Tomato Sauce",
    "10 shakes Louisiana Hot Sauce",
    "1 Wylers Beef Cube",
    "​Chili Spice Mixture",
    "1 T San Antonio Original",
    "1 T Mexene Chili Powder",
    "2T San Antonio Red",
    "2T Cowtown Light",
    "1T RT",
    "Dump #1 Dump #2",
    "4 T Chili Spice Mixure 3 T Chili Spice Mixture",
    "¾ t Wylers Chicken Granules 1 t Granulated Garlic",
    "½ t Garlic Granules 1 pkg Goya Sazon",
    "1 t Cumin 1 T Cumin",
    "1 T Granulated Onion ½ t Brown Sugar",
    "Pinch Red Jalapeno Powder Pinch Salt",
    "Pinch Black Pepper",
    "Pinch Salt",
    "Pinch Cayenne Pepper",
    "1 pkg Goya Sazon"
  ],
  "__v": 1
}