{
  "hash": "10670e00c44790b08f9e1797d449d683fb443648",
  "title": "Sweet Potato Lefse",
  "image": "http://4.bp.blogspot.com/-pRaxhgYuhg4/VIeHXNzknEI/AAAAAAAAGb4/J-Z5MunrTsQ/s1600/LefseAIP-2836.jpg",
  "href": "http://sweet-treats-baking.blogspot.com/2014/12/sweet-potato-lefse-aip.html",
  "extension": "",
  "firstAdded": "2015-12-26T16:44:57.540000",
  "users": [
    null
  ],
  "keywords": [
    "white",
    "potatoes",
    "used",
    "hannah",
    "variety",
    "water",
    "cover",
    "riced",
    "tbl",
    "coconut",
    "milk",
    "oil",
    "salt",
    "maple",
    "sugar",
    "tapioca",
    "starch",
    "divided",
    "flour"
  ],
  "directions": [
    "0",
    "Wash & peel the sweet potatoes. Cut them into rough cubes & place into a stock pot. Add enough water to cover the potato pieces.",
    "Bring to a boil over high heat & cook until fork tender, approximately 20 minutes.",
    "Drain the potatoes into a colander.",
    "Rice the potatoes back into the stock pot, using a potato ricer Return to the burner over low heat & cook, stirring constantly, for 1.5 minutes, to help evaporate some of the residual water.",
    "Remove from the heat & add the coconut milk, coconut oil, salt & maple sugar. Stir to combine.",
    "Add half the tapioca starch & the coconut flour. Mix well. Add the remaining tapioca starch.",
    "Divide the dough into 2 Tbl pieces. Roll into small balls.",
    "Heat a nonstick skillet over medium heat.",
    "Liberally sprinkle the work surface with additional tapioca starch. Flatten a ball of dough & sprinkle with more tapioca. Roll out, trying to keep the shape as round as possible, until very thin--almost see-through, but making sure the bottom isn’t stuck. Use a small offset spatula to run underneath the rolled out dough. If the dough tears, don’t panic--gather the dough together into a ball again & re-roll it.",
    "Very gently lift the dough & slide your hand underneath the dough. Transfer it to the preheated skillet. Cook until lightly browned on one side, flip, and continue cooking until that side is also lightly browned. Once flipped, the lefse may bubble--use a heat tempered spatula to gently press down on the big bubbles. On our electric stove set at roughly 4.5, mine took about 1 min 15 sec on the first side & an additional 1 min on the second side.",
    "Transfer cooked pieces to a plate & repeat with the remaining dough.",
    "Once the lefse cools completely, store in an airtight container. Keep at room temperature for one day maximum, then refrigerate or freeze for longevity. I find the lefse tastes more like traditional lefse the day following when it was made."
  ],
  "ingredients": [
    "0",
    "4 oz White Sweet Potatoes (I used the “Hannah” variety)",
    "Water, to cover",
    "12 oz Riced White Sweet Potatoes",
    "2 Tbl (22 g) coconut milk",
    "28 g (2 Tbl) coconut oil",
    "3/4 tsp salt",
    "1 1/2 tsp Maple Sugar",
    "90 g Tapioca Starch, divided approximately in half",
    "1 1/2 tsp Coconut Flour"
  ],
  "__v": 1
}