{
  "hash": "55d5902fbde722aff5921efb20052cb36c31171a",
  "title": "Udon Soup with Shrimp",
  "image": "https://imagesvc.timeincapp.com/v3/mm/image?url=http%3A%2F%2Fcdn-image.myrecipes.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2Fmedium_2x%2Fpublic%2Fimage%2Frecipes%2Fck%2F09%2F10%2Fudon-soup-ck-1924711-x.jpg%3Fitok%3Dh6HJxzv8&w=1600&q=70",
  "href": "http://www.myrecipes.com/recipe/udon-soup-with-shrimp",
  "extension": "Chrome",
  "firstAdded": "2018-04-21T16:30:55.342000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Step 1",
    "Wipe kombu clean with a cloth; cut sheeting lengthwise into 3-inch pieces. Place kombu in a large saucepan over medium-high heat; cover with 2 quarts cold water. Heat mixture to 180° or until tiny bubbles form around edge (do not boil). Reduce the heat to medium-low, and simmer 20 minutes. Remove from heat; discard kombu. Stir in bonito and ginger; let stand 10 minutes or until bonito sinks. Strain through a cheesecloth-lined colander over a bowl; discard solids.",
    "Step 2",
    "Wipe pan clean. Return broth to pan; bring to a boil. Remove from heat. Stir in mushrooms; let stand 20 minutes. Strain mixture through a cheesecloth-lined colander over a bowl, reserving mushrooms and broth. Wipe pan clean. Return broth to pan; bring to a simmer. Coarsely chop mushrooms.",
    "Step 3",
    "Cook noodles according to package directions; drain. Cut onions into 1-inch pieces; cut each piece in half lengthwise. Cut onion pieces lengthwise into thin strips. Combine sugar, soy sauce, and vinegar in a small bowl, stirring well. Add shrimp to broth; cook 1 minute. Stir in mushrooms; cook 30 seconds. Remove from heat; stir in vinegar mixture. Place about 1 cup noodles in each of 4 bowls; top with 2 cups broth mixture. Divide onion strips evenly among bowls."
  ],
  "ingredients": [
    "0",
    "2 large sheets kombu (kelp)",
    "2 quarts cold water",
    "1 cup bonito flakes (about 1/4 ounce)",
    "1 (1-inch) piece fresh ginger, peeled and thinly sliced",
    "1 ounce dried mushroom blend",
    "1 (14-ounce) package fresh jumbo udon noodles",
    "2 green onions, trimmed",
    "1 tablespoon sugar",
    "2 1/2 tablespoons low-sodium soy sauce",
    "2 tablespoons rice vinegar",
    "1 pound medium shrimp, peeled and deveined"
  ],
  "__v": 1
}