{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 350 degrees F. Line two baking sheets with parchment paper; set aside.",
    "Using an electric mixer, beat the eggs and sugar on medium speed until the mixture is pale yellow, about 3 minutes. Add the oil, milk, and butternut flavoring, and mix for an additional 1 to 2 minutes until completely combined. Reduce the mixer speed to low and gradually add the flour and baking powder, mixing only until just combined. Give the mixture a final stir with a rubber spatula, and fold in the walnuts (if using).",
    "Divide the dough into four equal pieces and shape each into a log about 9 inches long by 3 inches wide. Place two on each sheet and bake for 20 to 25 minutes, or until firm to the touch. Remove from the oven and place the pans on cooling racks for 10 to 15 minutes, or until you can handle the biscotti easily.",
    "Increase the oven temperature to 375 degrees F.",
    "Using a sharp knife, slice each log on the diagonal into ½-inch slices. Arrange the slices cut side-up on the baking sheets and return to the oven for an additional 10 to 15 minutes, or until golden brown, flipping them halfway through. Allow the biscotti to cool on the baking sheets, then store in an airtight container at room temperature for up to 1 month."
  ],
  "firstAdded": "2014-08-18T23:16:10.123000",
  "hash": "5ed4e63dfb0afb01082aea01f1adbbc862ced967",
  "href": "http://www.browneyedbaker.com/2014/01/07/my-grandmas-biscotti-recipe/",
  "image": "http://www.browneyedbaker.com/wp-content/uploads/2014/01/grandmas-biscotti-95-250-135x135.jpg",
  "ingredients": [
    "0",
    "6 eggs",
    "1½ cups granulated sugar",
    "1 cup vegetable oil",
    "¼ cup milk",
    "1 tablespoon butternut flavoring",
    "8 cups all-purpose flour",
    "4 teaspoons baking powder",
    "2 cups chopped walnuts (optional)"
  ],
  "keywords": [
    "eggs",
    "granulated",
    "sugar",
    "oil",
    "milk",
    "butternut",
    "flavoring",
    "allpurpose",
    "flour",
    "baking",
    "walnuts"
  ],
  "title": "GRANDMA'S BISCOTTI RECIPE",
  "users": [
    null
  ]
}