{
  "hash": "5e6172aec96e52d7380c5303199809c9bbd47f5a",
  "title": "Chili Cornbread Skillet",
  "image": "http://static.budgetbytes.com/wp-content/uploads/2013/10/Chili-Cornbread-Casserole-scoop.jpg",
  "href": "http://www.budgetbytes.com/2013/10/chili-cornbread-skillet/",
  "extension": "Chrome",
  "firstAdded": "2015-03-05T21:42:01.640000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "garlic",
    "onion",
    "jalapeo",
    "tomato",
    "roasted",
    "tomatoes",
    "beans",
    "kidney",
    "pinto",
    "black",
    "chili",
    "cumin",
    "oregano",
    "salt",
    "cheddar",
    "yellow",
    "cornmeal",
    "allpurpose",
    "flour",
    "sugar",
    "baking",
    "milk",
    "egg"
  ],
  "directions": [
    "0",
    "Dice the onion and mince the garlic. Slice the jalapeño lengthwise, scrape out the seeds, and then dice the pepper. Add the olive oil, onion, garlic, and jalapeño to a large, oven safe skillet. Sauté over medium heat for five minutes, or until the onions are soft and translucent.",
    "Drain the beans in a colander and rinse them briefly with cool water. Add the tomato paste, diced tomatoes, and rinsed beans to the skillet. Stir to combine. If the mixture too thick to stir, add ¼ to ½ cup of water.",
    "Add the chili powder, cumin, oregano, and salt to the skillet. Stir to combine and then allow the mixture to heat through. Taste the chili and adjust the seasonings if needed (for extra heat, add a pinch of cayenne pepper).",
    "Preheat the oven to 425 degrees. In a large bowl, stir together the cornmeal, flour, sugar, baking powder, and salt until very well combined. In a separate bowl or large measuring cup, whisk together the milk, egg, and oil. Pour the milk mixture into the bowl of dry ingredients and stir just until everything is moistened.",
    "Make sure the chili is spread evenly in the skillet and then sprinkle the cheddar cheese over top. Carefully pour the cornbread batter over the chili and cheese, and spread it around until everything is evenly covered.",
    "Transfer the skillet to the fully preheated oven and bake for 25 minutes, or until the cornbread is golden brown on the surface. Divide the skillet into 8 portions (cut into wedges) and then serve.",
    "I DID 1.5 OF THE CORNBREAD TO HAVE MOOOORE CORNBREAD."
  ],
  "ingredients": [
    "0",
    "1 Tbsp olive oil $0.16",
    "2 cloves garlic $0.16",
    "1 small onion $0.46",
    "1 jalapeño (optional) $0.17",
    "¼ cup tomato paste $0.27",
    "1 (15 oz.) can fire roasted tomatoes $1.39",
    "3 (15 oz.) cans beans (kidney, pinto, black) $2.67",
    "1 Tbsp chili powder*** $0.30",
    "½ tsp cumin $0.05",
    "½ tsp oregano $0.05",
    "1 tsp salt $0.05",
    "1 cup shredded cheddar $0.90",
    "1",
    "1 cup yellow cornmeal $0.24",
    "1 cup all-purpose flour $0.14",
    "¼ cup sugar $0.04",
    "4 tsp baking powder $0.12",
    "½ tsp salt $0.02",
    "1 cup milk $0.62",
    "1 large egg $0.17",
    "¼ cup vegetable oil $0.21"
  ],
  "__v": 2
}