{
  "hash": "5686084f0c269da025ff8ce69c8c23b1ac7471a8",
  "title": "Bacon Spinach Quiche Recipe",
  "image": "http://everydaydishes.com/wp-content/uploads/2015/09/bacon-spinach-quiche-everydaydishes_com-H-740x486.jpg",
  "href": "http://everydaydishes.com/simple-food-recipes/bacon-spinach-quiche/",
  "extension": "Chrome",
  "firstAdded": "2016-03-29T05:53:14.446000",
  "users": [
    null
  ],
  "keywords": [
    "premade",
    "pie",
    "crust",
    "bacon",
    "baby",
    "spinach",
    "eggs",
    "allpurpose",
    "flour",
    "sour",
    "cream",
    "milk",
    "kosher",
    "salt",
    "black",
    "pepper",
    "swiss",
    "cheddar",
    "cheese"
  ],
  "directions": [
    "0",
    "Place a rack in the center of the oven then preheat to 350 degrees.",
    "Roll out pie crust and place it in a 9\" round deep-dish pie pan. Flute or decorate the edges of the crust as desired. Use a fork to poke a few holes in the bottom and sides of the piecrust.",
    "‘Blind bake’ the crust by lining the inside of the pie crust with aluminum foil and placing pie weights (or uncooked beans or rice) inside the foil. Bake the pie shell for 15 minutes then remove from oven. Remove the weights and foil and set aside until ready to fill.",
    "While the crust is baking, cook the diced bacon in a medium-sized skillet over medium heat until crispy but still tender—approximately 7–8 minutes. Drain the bacon pieces on a paper towel-lined plate and set aside.",
    "Remove bacon grease from the pan, return the skillet to the heat then add baby spinach to the skillet. Toss occasionally until the spinach becomes dark green and all the leaves have wilted.",
    "Transfer the spinach to a colander or wire sieve and press as much liquid from the leaves as possible—you should have ½ cup of cooked spinach with very little moisture remaining. Chop the spinach and set aside.",
    "In a medium-sized mixing bowl, crack 1 egg and whisk it together with flour until completely smooth. Add the remaining 5 eggs, whisk until completely combined then whisk in the sour cream, milk, kosher salt and pepper until completely smooth.",
    "Stir the bacon, spinach and grated cheese into the egg mixture then pour the filling into the pie crust. Return the dish to the oven and bake 45-55 minutes—the filling will brown slightly in some areas and the center will feel firm when pressed.",
    "Remove the quiche from the oven and allow it to cool at least 15 minutes. Serve warm or at room temperature. Enjoy!"
  ],
  "ingredients": [
    "0",
    "1 pre-made pie crust",
    "8 oz bacon, diced",
    "6 oz bag of fresh baby spinach",
    "6 large eggs",
    "1 Tbsp all-purpose flour",
    "¾ cup sour cream",
    "¾ cup whole milk",
    "1 tsp kosher salt",
    "¼ tsp freshly ground black pepper",
    "1 cup grated Swiss or cheddar cheese"
  ],
  "__v": 1
}