{
  "hash": "cd805866286e24d6ac283b36cce7572178af1143",
  "title": "HOT POCKETS\nCrispy prosciutto-wrapped cauliflower",
  "image": "http://prodstatics3cdn1.purewow.com/images/articles/2013_11/Cauliflower549x3051.jpg",
  "href": "http://www.purewow.com/entry_detail/recipe/8030/Crispy-prosciutto-wrapped-cauliflower.htm",
  "extension": "Chrome",
  "firstAdded": "2015-03-30T18:46:41.698000",
  "users": [
    null
  ],
  "keywords": [
    "head",
    "cauliflower",
    "tomato",
    "white",
    "wine",
    "black",
    "pepper",
    "parmesan",
    "cheese",
    "slices",
    "prosciutto",
    "extravirgin",
    "olive",
    "oil"
  ],
  "directions": [
    "0",
    "DIRECTIONS",
    "1. Prepare the cauliflower: Trim away the base of the cauliflower, including any green leaves. Cut the cauliflower in half, then cut the halves into 1-inch-thick slices. Cut the slices into 2 or 3 bite-size pieces, depending on the size of the slice.",
    "2. Bring a large pot of salted water to a boil. Blanch the cauliflower in the water until nearly tender, 3 to 5 minutes. Drain the cauliflower well and pat dry with paper towels.",
    "3. In a small bowl, mix the tomato paste with the white wine and black pepper to combine. Spread 1 teaspoon onto the sides of each piece of cauliflower, then sprinkle with 1 teaspoon of Parmesan. Gently wrap a prosciutto slice around each piece of cauliflower, pressing lightly at the end to secure (it should stick well to the tomato-paste mixture).",
    "4. Working in batches, heat 2 tablespoons olive oil in a large skillet over medium heat. When the oil is hot, add the cauliflower and cook until the prosciutto is crisp and golden, 3 to 4 minutes per side. Repeat with additional oil and cauliflower until all the pieces are cooked. Let cool slightly, then serve immediately."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1 small head cauliflower",
    "½ cup tomato paste",
    "2 tablespoons white wine",
    "½ teaspoon black pepper",
    "½ cup grated Parmesan cheese",
    "20 slices prosciutto",
    "6 tablespoons extra-virgin olive oil"
  ],
  "__v": 1
}