{
  "hash": "62620fd3498fcb6f5419804ca6c0de2ec11a7aff",
  "title": "Maple Pecan Sticky Buns",
  "image": "https://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2017/04/maple-pecan-sticky-buns-3.jpg",
  "href": "https://sallysbakingaddiction.com/2017/04/12/maple-pecan-sticky-buns/",
  "extension": "Chrome",
  "firstAdded": "2018-09-15T22:18:06.620000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "Make the dough: Heat milk to about 95°F (35°C)-- use microwave or stovetop. Pour the warm milk into the bowl of a stand electric mixer fitted with the dough hook attachment (OR you can use a handheld mixer OR no mixer, but a stand mixer is ideal). With a whisk, manually whisk in the sugar and yeast. Cover with a towel and let sit until the yeast is foamy, about 5-10 minutes. If the yeast does not dissolve and foam, start over with fresh active yeast. On low speed, beat in the softened butter until it is slightly broken up. Next add the eggs, one at a time, and then the salt. The butter won't really be mixing into the mixture, so don't be alarmed if it stays in pieces. On low speed, gradually add the flour. Once it is all added, beat on medium speed until a soft dough forms. Increase speed to medium-high and beat until the dough is soft and supple, about 6 minutes longer. *If you do not have a stand-mixer with a hook attachment, knead the dough by hand in this step.",
    "Transfer the dough to a lightly floured surface and knead it with your hands for 1 minute. Form the dough into a ball and transfer it to a lightly greased bowl. Cover the dough loosely with plastic wrap, a paper towel, or aluminum foil and let sit in a warm place until doubled in size, about 1 to 2 hours. Here's what I do: turn the oven on to 200°F (93°C). Once heated to that temperature, turn the oven off. Stick the covered dough inside the oven and allow it to rise in this warm environment.",
    "Meanwhile, make the topping: Grease the bottom and sides of a 9x13 inch baking dish. Spread pecans in an even layer in the pan. Set aside. Combine the rest of the topping ingredients in a small saucepan over medium heat. Stir until the butter has melted, then bring to a boil. Allow to boil for 3 minutes. Remove from heat and pour on top of pecans. Set aside.",
    "Turn the risen dough out onto a lightly floured work surface and, using a rolling pin, roll into a 12x18 inch rectangle. I used a ruler for accuracy. Make sure the dough is smooth and evenly thick.",
    "Add the filling: Spread softened butter all over dough. Top evenly with the brown sugar and cinnamon. Tightly roll up the dough to form an 18-inch-long log. Cut into 12 even rolls. Arrange them in the prepared baking pan.",
    "Cover the rolls very tightly with aluminum foil and allow to rise in a warm environment again for about 30-40 minutes.",
    "Preheat the oven to 375°F (191°C). Bake rolls for about 25 minutes until they are golden brown. About halfway through the bake time, I like to cover the rolls loosely with aluminum foil so the tops don't brown too much. Remove pan from the oven and allow to cool on a wire rack for 5 minutes.",
    "Using oven mitts, carefully invert the pan onto a large serving platter. The warm topping will deliciously melt down the sides! Serve warm.",
    "Overnight instructions: To prepare the night before serving, prepare the rolls through step 5. Cover the rolls tightly and refrigerate for 8-12 hours. The next morning, remove from the refrigerator and allow to rise on the counter for 1-2 hours before continuing with step 7.",
    "Freezing instructions: Baked rolls can be frozen up to 2-3 months. Thaw overnight in the refrigerator and warm up before enjoying. You can also freeze the unbaked rolls and here's how: bake the rolls in step 7 for only about 10 minutes at 375°F (191°C). Cool completely, then cover tightly and freeze. To serve, take the rolls out of the freezer and put into the refrigerator a few hours before serving. Then, finish baking them.",
    "Recipe Notes:",
    "Whole milk (or 2%) is definitely a must for this rich dough and absolutely needed for the topping. Instead, you can use half-and-half for the dough and heavy cream or half-and-half for the topping. Do not use lower fat milk for the topping; it won't set up properly.",
    "If using active dry yeast, the rise times will be slightly longer. I always use an instant yeast.",
    "Dark brown sugar is strongly recommended for best flavor, but light brown can work in a pinch."
  ],
  "ingredients": [
    "0",
    "Dough",
    "1 cup (240ml) whole milk1",
    "2/3 cup (135g) granulated sugar",
    "1 and 1/2 Tablespoons active dry or instant yeast (2 standard packets)2",
    "1/2 cup (115g) unsalted butter, softened to room temperature and cut into 4 pieces",
    "2 large eggs, at room temperature",
    "1/2 teaspoon salt",
    "4 and 1/2 cups (558g) all-purpose flour, plus more for work surface",
    "Topping",
    "2 cups (250g) Diamond of California chopped pecans",
    "1/2 cup (115g) unsalted butter",
    "2/3 cup (135g) packed dark brown sugar3",
    "2/3 cup (160ml) whole milk1",
    "1/3 cup (80ml) pure maple syrup",
    "1/4 teaspoon salt",
    "Filling",
    "1/4 cup (60g) unsalted butter, softened to room temperature",
    "1/2 cup (100g) packed dark brown sugar3",
    "2 teaspoons ground cinnamon"
  ],
  "__v": 1
}