{
  "hash": "aa8d2e8333781372bbb6208dccdbc5cdbf6833f0",
  "title": "Kindred's Milk Bread",
  "image": "//images.food52.com/wOBuq3MpjxxGKx_Tj2LTM1MTYWg=/753x502/840fb939-0f98-4028-bddd-ba5d463ac62c--MilkBread1.jpg",
  "href": "http://food52.com/recipes/39343-kindred-s-milk-bread",
  "extension": "Chrome",
  "firstAdded": "2016-01-01T23:54:44.080000",
  "users": [
    null
  ],
  "keywords": [
    "bread",
    "flour",
    "divided",
    "surface",
    "kindred",
    "uses",
    "king",
    "arthur",
    "cream",
    "mild",
    "honey",
    "wildflower",
    "alfalfa",
    "nonfat",
    "dry",
    "milk",
    "alba",
    "active",
    "yeast",
    "envelopes",
    "kosher",
    "salt",
    "eggs",
    "unsalted",
    "butter",
    "pieces",
    "room",
    "oil",
    "spray",
    "flaky",
    "shouldnt"
  ],
  "directions": [
    "0",
    "Cook 1/3 cup flour and 1 cup water in a small saucepan over medium heat, whisking constantly, until a thick paste forms (almost like a roux but looser), about 5 minutes. Add cream and honey and cook, whisking to blend, until honey dissolves.",
    "Transfer mixture to the bowl of a stand mixer fitted with a dough hook and add milk powder, yeast, kosher salt, 2 eggs, and 5 remaining cups flour. Knead on medium speed until dough is smooth, about 5 minutes. Add butter, a piece at a time, fully incorporating into dough before adding the next piece, until dough is smooth, shiny, and elastic, about 4 minutes.",
    "Coat a large bowl with nonstick spray and transfer dough to bowl, turning to coat. Cover with plastic wrap and let rise in a warm, draft-free place until doubled in size, about 1 hour.",
    "If making rolls, lightly coat a 6-cup jumbo muffin pan with nonstick spray. Turn out dough onto a floured surface and divide into 6 pieces. Divide each piece into 4 smaller pieces (you should have 24 total). They don’t need to be exact; just eyeball it. Place 4 pieces of dough side-by-side in each muffin cup. If making loaves, lightly coat two 9- by 5-inch loaf pans with nonstick spray. Turn out dough onto a floured surface and divide into 12 pieces. Nestle pieces side-by-side to create 2 rows down length of each pan. If making split-top buns, lightly coat two 9- by 13-inch baking dishes with nonstick spray. Divide dough into 12 pieces and shape each into a 4-inch long log. Place 6 logs in a row down length of each dish.",
    "Let shaped dough rise in a warm, draft-free place until doubled in size (dough should be just puffing over top of pan), about 1 hour.",
    "Preheat oven to 375° F. Beat remaining egg with 1 teaspoon. water in a small bowl to blend. Brush top of dough with egg wash and sprinkle with sea salt, if desired. Bake, rotating pan halfway through, until bread is deep golden brown, starting to pull away from the sides of the pan, and is baked through, 25 to 35 minutes for rolls, 50 to 60 minutes for loaf, or 30 to 40 minutes for buns. If making buns, slice each bun down the middle deep enough to create a split-top. Let milk bread cool slightly in pan on a wire rack before turning out; let cool completely."
  ],
  "ingredients": [
    "0",
    "5 1/3 cups bread flour, divided, plus more for surface (Kindred uses King Arthur)",
    "1 cup heavy cream",
    "1/3 cup mild honey (such as wildflower or alfalfa)",
    "3 tablespoons nonfat dry milk powder (such as Alba)",
    "2 tablespoons active dry yeast (from about 3 envelopes)",
    "2 tablespoons kosher salt",
    "3 large eggs, divided",
    "4 tablespoons (1/2 stick) unsalted butter, cut into pieces, at room temperature",
    "Nonstick vegetable oil spray",
    "Flaky sea salt (optional, but shouldn't be)"
  ],
  "__v": 1
}