{
  "hash": "3b1fc56823da15da48442ff71eeb1953f0132735",
  "title": "Rich and Creamy Saffron Arancini With Mozzarella Recipe",
  "image": "http://www.seriouseats.com/recipes/assets_c/2014/10/20141020-arancini-daniel-gritzer-15-thumb-1500xauto-413440.jpg",
  "href": "http://www.seriouseats.com/recipes/2014/10/arancini-rice-balls-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-12-03T12:44:04.387000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 300°F. Place bread cubes on a rack set in a rimmed baking sheet and bake in oven until completely dried out, about 30 minutes.",
    "If using store-bought chicken broth or homemade broth that remains watery when chilled, place stock in a large liquid measuring cup and sprinkle gelatin over the top. Set aside.",
    "If Making Rice in a Pressure Cooker: Heat oil in Pressure cooker over medium-high heat until shimmering. Add onion and cook, stirring occasionally, until onion is softened and translucent, about 4 minutes. Add rice and cook, stirring, until rice is evenly coated in oil and toasted but not browned, 3-4 minutes (rice grains should start to look like tiny ice cubes: translucent around the edges and cloudy in the center). Add wine and cook, stirring, until raw alcohol smell has cooked off and wine is almost fully evaporated, about 2 minutes. Stir in 3 cups broth and 1 pinch saffron, scrape any grains of rice or pieces of onion from side of pressure cooker so that they are fully submerged; season with salt. Close pressure cooker and bring up to low pressure (10 psi on most units). Cook at low pressure for 6 minutes, then depressurize cooker either by running it under cold water if it is not electric, or using the steam-release valve if it is electric. Return to heat and stir rice until it forms the texture of a thick porridge. Season with salt and pepper.",
    "If Making Rice on Stovetop: Heat oil in large saucier pan or Dutch oven over medium-high heat until shimmering. Add onion and cook, stirring occasionally, until onion is softened and translucent, about 4 minutes. Add rice and cook, stirring, until rice is evenly coated in oil and toasted but not browned, 3-4 minutes (rice grains should start to look like tiny ice cubes: translucent around the edges and cloudy in the center). Add wine and cook, stirring, until raw alcohol smell has cooked off and wine is almost fully evaporated, about 2 minutes. Stir in 2 cups stock and 1 pinch saffron, scrape any grains of rice or pieces of onion from side of pressure cooker so that they are fully submerged; season with salt. When liquid has mostly evaporated, stir in 1 more cup stock and cook, stirring frequently, until liquid has mostly evaporated. Stir in water 1/4 cup at a time until rice is just tender and has formed the texture of a thick porridge. Season with salt and pepper.",
    "Meanwhile, in a small saucier or saucepan, melt butter over medium-high heat until foaming. Stir in 2 tablespoons flour to form a paste, lower heat to medium, and cook, stirring constantly, until raw-flour smell is gone but flour has not browned, 2 to 3 minutes. Whisk in milk and remaining 3/4 cup stock until smooth, and add remaining 1 pinch saffron. Bring to a simmer, and continue to cook, stirring, until bechamel sauce is thick enough to coat the back of a spoon, about 4 minutes. Season with salt and pepper. Let cool slightly, then whisk in eggs.",
    "Scrape rice into large mixing bowl along with bechamel sauce and stir until thoroughly incorporated. Line 2 rimmed baking sheets with parchment and scrape rice filling onto each one, spreading it in a thin, even layer. Refrigerate rice filling until thoroughly chilled and thickened, at least 1 hour.",
    "Meanwhile, if making homemade bread crumbs, transfer dried bread cubes to a food processor and process until finely ground. Transfer homemade breadcrumbs or ground panko to a plate.",
    "In a shallow bowl, whisk remaining 1/4 cup flour with 1/4 cup water to form a smooth paste, then whisk in an additional 1/4 cup water to form a slurry.",
    "Transfer chilled rice filling to a large mixing bowl and re-line rimmed sheets with fresh parchment paper. Scoop a small handful (about 1/4 cup) of rice filling in one hand (avoid wetting hands with water even though filling is sticky) and form it into a flat disk. Place a few small pieces of mozzarella in center of disk and fold rice filled around it to form a sphere with the cheese in the center. It may be difficult to form a perfect sphere at this point, but that's okay.",
    "Roll rice ball in flour slurry, then transfer to breadcrumbs and roll to coat. The rice ball may feel a little soft at this point, but you should be able to coat it in the crumbs and just manage to maintain a roughly spherical shape. Transfer to parchment and repeat with remaining rice filling, cheese, and coatings.",
    "Fill a saucepan at least 4 inches deep with vegetable oil and heat to 375°F. Pick up one breaded rice ball and re-form it into a sphere (it should now more easily take that shape). Gently set it on a slotted spoon and lower it into the oil. Repeat with remaining rice balls, working in batches and topping up oil as needed. Fry rice balls until golden brown, then, using a slotted spoon or spider, lift them one by one from the oil, allowing excess oil to drip off, then transfer to paper towel-lined baking sheets or plates. Let cool slightly, then serve. Rice balls can be allowed to cool, then stored in the refrigerator. Reheat in a 350°F oven."
  ],
  "ingredients": [
    "0",
    "1 (1-pound) loaf crusty Italian bread, crusts removed and bread cut into 1-inch cubes, or 2 cups panko bread crumbs, finely ground in a food processor",
    "3 3/4 cups homemade chicken stock or store-bought low-sodium chicken broth, divided (see note above)",
    "2 packets (1/2 ounce) unflavored gelatin (only if using store-bought chicken broth or homemade broth that remains watery when chilled; see note above)",
    "2 tablespoons extra-virgin olive oil",
    "1 medium yellow onion, finely diced (about 1 cup)",
    "2 cups short-grain Asian rice (see note above)",
    "1 cup dry white wine",
    "2 pinches saffron, divided",
    "Kosher salt and freshly ground black pepper",
    "2 tablespoons unsalted butter",
    "1/4 cup plus 2 tablespoons all-purpose flour, divided",
    "1/4 cup milk",
    "2 large eggs, beaten",
    "1 pound low-moisture mozzarella, diced",
    "Vegetable, canola, or other neutral oil, for frying"
  ],
  "__v": 1
}