{
  "hash": "7444373457b0495a31d8f1ebdb5ba9ebe13c7227",
  "title": "Ribs with Red Wine Barbecue Sauce",
  "image": "https://253qv1sx4ey389p9wtpp9sj0-wpengine.netdna-ssl.com/wp-content/uploads/2018/07/Ribs_Instant_Pot-Recipe-700x461.jpg",
  "href": "https://www.winemag.com/recipe/instant-pot-ribs-red-wine-barbecue-sauce/",
  "extension": "Firefox",
  "firstAdded": "2020-02-09T14:33:44.334000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Whisk wine, brown sugar, tomato paste and liquid smoke in bowl of Instant Pot. In separate bowl, combine chili powder, salt, pepper, garlic powder, onion powder and cumin.",
    "Place ribs on sheet pan. Brush liquid mixture onto both sides of ribs. Sprinkle spice blend generously over both sides. Reserve leftover spice mix.",
    "Place apple in sauce at bottom of pot. Insert metal rack into Instant Pot. Roll ribs into spiral and place on rack. If ribs don’t fit, slice into sections and line up so they stand vertically.",
    "Secure lid and close pressure valve. Cook for 20 minutes on high pressure.",
    "Heat broiler on high.",
    "After cooking time, allow pressure to release naturally for 10–15 minutes. Release remaining pressure, according to the manufacturer’s instructions.",
    "On foiled-lined sheet pan, lay ribs in single layer, meaty-side-up. Remove metal rack from Instant Pot. Set to sauté and whisk sauce for 8–10 minutes, or until it thickens. Crush apple and mix into sauce. If desired, mix sauce with immersion blender or in a food processor until smooth.",
    "Brush sauce onto ribs, and sprinkle spice atop. Broil ribs for 5–7 minutes, or until edges char and bubble. Slice ribs, and serve alongside bowl of extra sauce. Serves 4–6"
  ],
  "ingredients": [
    "0",
    "1 cup leftover red wine",
    "3 tablespoons brown sugar",
    "2 tablespoons tomato paste",
    "1 teaspoon liquid smoke",
    "2 teaspoons chili powder",
    "2 teaspoons salt",
    "1 tablespoon fresh-ground pepper",
    "1 teaspoon garlic powder",
    "1 teaspoon onion powder",
    "1 teaspoon cumin",
    "4–5 pounds baby back ribs",
    "1 apple or peach, peeled, pitted and cubed"
  ],
  "__v": 1
}