{
  "hash": "a70b4e0957d513f7e6837f51f198859582177292",
  "title": "roasted baby artichokes with black pepper-lemon vinaigrette for dunking",
  "image": "http://www.theclevercarrot.com/wp-content/uploads/2014/12/artichokes-2.jpg",
  "href": "http://www.theclevercarrot.com/2014/12/roasted-baby-artichokes-with-black-pepper-lemon-vinaigrette-for-dunking/",
  "extension": "Chrome",
  "firstAdded": "2015-07-23T17:01:06.009000",
  "users": [
    null
  ],
  "keywords": [
    "baby",
    "artichokes",
    "olive",
    "oil",
    "garlic",
    "clove",
    "salt",
    "pepper",
    "zest",
    "lemon",
    "juice",
    "lemons",
    "honey",
    "heaped",
    "greek",
    "yogurt",
    "lowfat",
    "sour",
    "cream"
  ],
  "directions": [
    "0",
    "Preheat your oven to 425 F.",
    "To prep the artichokes, trim the bottom stem about ¼-inch. Using a vegetable peeler, peel the stem (like a carrot) to remove any thick, fibrous strands.",
    "Next, remove most of the outer green leaves. Keep peeling until you have reached the light green center (you will remove about ¾'s of the artichoke). The texture of the leaves will be papery thin.",
    "Using a sharp knife, cut off ⅓ of the pointy top.",
    "Slice the artichokes in half lengthwise.",
    "In a large bowl add the artichoke halves, olive oil, garlic, and season with salt and pepper. Toss well.",
    "Transfer to an iron skillet placing the artichokes cut-side down.",
    "Bake in the center of the oven for about 25 minutes, checking after 15 minutes to ensure even browning.",
    "Meanwhile, make the vinaigrette. Add the first 5 ingredients to a blender. With the machine running, slowly stream in the olive oil to emulsify. Add salt and pepper to taste. Transfer to a small bowl.",
    "Remove the the artichokes from the oven.",
    "Arrange onto a serving platter or serve directly in the skillet. Enjoy warm, with vinaigrette on the side for dunking."
  ],
  "ingredients": [
    "0",
    "4-5 baby artichokes",
    "¼ c. olive oil",
    "1 garlic clove, minced",
    "salt + pepper",
    "1",
    "zest of 1 lemon",
    "6 tbsp. fresh lemon juice, about 2 lemons",
    "2 tsp. honey",
    "¼ garlic clove",
    "1 heaped tablespoon of Greek yogurt or low-fat sour cream",
    "¾ c. olive oil",
    "salt + pepper"
  ],
  "__v": 1
}