{
  "hash": "f9de901261644ad9bbb6d71ddcd83c7bf32df6cd",
  "title": "Susan VoisinCollard Greens and White Bean Soup",
  "image": "http://blog.fatfreevegan.com/wp-content/uploads/2007/03/collard-greens-white-beans-soup1.jpg",
  "href": "http://blog.fatfreevegan.com/2007/03/collard-greens-and-white-bean-soup.html",
  "extension": "Chrome",
  "firstAdded": "2016-06-22T19:54:31.181000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat a pressure cooker and add onion. Cook, stirring, until onion is tender, adding water by the tablespoon to prevent sticking. Add the garlic and cook for another minute. Put the next 5 ingredients into pressure cooker and seal. Bring to high pressure and cook for 5 minutes. Remove from heat and release pressure manually. (Set manual setting on electric pressure cooker for 5 minutes then quick release pressure. If cooking without a pressure cooker, cook covered in a large pot until collards are tender, about 30 minutes.)",
    "Add the beans, 2 cups of water or broth, and the remaining seasonings. Simmer for at least 20 minutes to allow flavors to combine. (Use saute or brown setting on electric pressure cooker on lowest temperature available.) While cooking, add additional water or broth if the soup seems too dry. Serve topped with vegan parmesan, if desired."
  ],
  "ingredients": [
    "0",
    "1 large onion, chopped",
    "3-4 cloves garlic, minced",
    "1 to 1 1/2 pounds collards, tough ribs discarded and leaves chopped (can substitute kale, chard, or other greens)",
    "2 ribs celery, chopped",
    "2 carrots, sliced about 1/4-inch thick",
    "4 cups fat-free vegetable broth",
    "1 teaspoon thyme",
    "2 15-ounce cans white beans, drained (I used Great Northern beans)",
    "2-4 cups water or vegetable broth",
    "1 1/2 teaspoons oregano",
    "1 teaspoon thyme (additional)",
    "1/4 – 1 teaspoon hot smoked paprika or chipotle chili powder (adjust to your personal heat level)",
    "1/4 teaspoon red pepper flakes",
    "salt and freshly ground pepper, to taste",
    "vegan Parmesan (optional)"
  ],
  "__v": 1
}