{
  "hash": "7b2118221b263f64f57ccdd25b586f8c5f435225",
  "title": "Fried broccoli florets and pickled stems",
  "image": "https://i.guim.co.uk/img/media/c6e41d05cd600cc24cfebbff98a24e7ea304264d/0_301_3674_3672/master/3674.jpg?width=300&quality=85&auto=format&fit=max&s=1522de4e3635bcbc4807f2befaf15698",
  "href": "https://www.theguardian.com/food/2019/may/04/yotam-ottolenghi-broccoli-recipes-fried-pickled-rocket-pasta-mushroom-ketchup",
  "extension": "Chrome",
  "firstAdded": "2019-05-28T13:28:04.100000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Trim the two broccoli stems so they are roughly rectangular – they don’t need to be perfect. Shave the stems lengthways into thin strips, using a mandoline, ideally. Stacking a few strips on top of each other at a time, cut into fine julienne sticks, then put in a bowl, add half a teaspoon of salt, toss to combine and leave to sit for an hour. Squeeze out some of the salty liquid with your hands, then transfer the salted broccoli to a clean bowl, toss with two tablespoons of the vinegar and the chilli, and leave to pickle while you get on with the rest of the dish.",
    "Put the soy sauce, sugar and final tablespoon of vinegar in a small saucepan on a medium-high heat. Bring to a boil, turn down to a simmer for two minutes, then take off the heat – the sauce will thicken as it cools.",
    "Put the sunflower oil in medium saucepan on a medium-high heat. Once it’s very hot, fry the broccoli florets a handful at a time until softened and golden in places, about 45 seconds a batch (and six batches in all). Make sure the oil comes back up to temperature before adding each new batch. Using a slotted spoon, transfer the fried broccoli to a tray lined with absorbent paper, then move to a large bowl and toss in the soy sauce mixture.",
    "Advertisement",
    "To serve, spread half the pickled broccoli on a large, round plate and arrange the fried broccoli on top. Top with the remaining pickle, basil and cumin, and serve."
  ],
  "ingredients": [
    "0",
    "700g broccoli (ie, 2 heads), cut into bite-sized florets and 2 stems",
    "Salt",
    "3 tbsp apple cider vinegar",
    "½ red chilli, thinly sliced",
    "35ml light soy sauce",
    "2 tsp caster sugar",
    "500ml sunflower oil",
    "5g basil leaves, roughly torn",
    "⅓ tsp cumin seeds, toasted and roughly crushed in a mortar"
  ],
  "__v": 1
}