{
  "hash": "e55b350ea8b463d941c53a5906dabc6571ab5bc8",
  "title": "Wild Grape Leaves Brined Wild Grape Leaves",
  "image": "",
  "href": "http://rosesprodigalgarden.org/recipes/wildgrapeleaves.html",
  "extension": "",
  "firstAdded": "2015-09-22T11:08:05.194000",
  "users": [
    null
  ],
  "keywords": [
    "wild",
    "grape",
    "leaves",
    "brined",
    "sure",
    "harvest",
    "tender",
    "mintygreen",
    "colored",
    "dark",
    "older",
    "tend",
    "stringy",
    "fibrous",
    "called",
    "recipe",
    "taking",
    "plain",
    "live",
    "cultures",
    "putting",
    "clean",
    "cloth",
    "inside",
    "mesh",
    "use",
    "bandanna",
    "strainer",
    "allow",
    "drip",
    "hours",
    "bowl",
    "whey",
    "leftover",
    "yogurt",
    "used",
    "cream",
    "cheese",
    "link",
    "detailed",
    "instructions",
    "photos",
    "dozen",
    "fills",
    "mason",
    "jar",
    "multiply",
    "jars",
    "filling",
    "salt",
    "available",
    "water"
  ],
  "directions": [
    "0",
    "Mix the brine together in a bowl and set aside.",
    "Stack the Grape leaves one on top of the other until you have a stack of 12 (1 dozen).",
    "Then roll up this stack into a tight roll and put it in the jar.",
    "Make 2 more rolls like this to fill the jar. (3 dozen in all)",
    "Pour the brine over the rolls of leaves until the jar is full and cap it.",
    "When you have all the jars filled and capped, leave them to sit out on a counter for 48 hours on a towel, as there will be a little leakage. This causes a healthy lacto-fermentation process to begin.",
    "After 48 hours put all the jars in the fridge and forget about them for at least a month.",
    "After four weeks they are ready to use. They will keep all year like this, so you can use them anytime you desire to make Dolmas."
  ],
  "ingredients": [
    "0",
    "Wild Grape Leaves",
    "Brined Wild Grape Leaves",
    "Be sure to harvest the large, tender, minty-green colored leaves; the dark, older leaves tend to be stringy and fibrous.",
    "The whey (optional) that is called for in the recipe is made by taking plain yogurt that has live cultures in it and putting it in a clean cloth inside a large mesh strainer (I use a bandanna). Put the strainer over a bowl and allow it to drip for several hours. The liquid in the bowl is the whey, the leftover yogurt can be used something like a cream cheese. See this link for detailed instructions with photos.",
    "3 dozen (36) Grape Leaves fills one quart mason jar. This recipe is for one quart, multiply it by how many jars you will be filling.",
    "3 dozen Wild Grape Leaves",
    "1 Tablespoon sea salt",
    "4 Tbsp whey (if not available use an additional tablespoon salt)",
    "2 cups water"
  ],
  "__v": 1
}