{
  "__v": 1,
  "directions": [
    "0",
    "Приготовление",
    "Три из четырёх зубчиков чеснока нарезаем тонкими дольками. Крошим базилик.",
    "В каждом куске тунца делаем надрезы с обеих сторон, протыкая мякоть ножом.",
    "Нашпиговываем сделанные отверстия чесноком и базиликом. Рыбу натираем морской солью и чёрным перцем.",
    "Заливаем кусочки рыбы лимонным соком и оставляем мариноваться минут на 10.",
    "В кастрюле разогреваем оливковое масло, кладём тунец и равномерно обжариваем кусочки. Когда на рыбе образуется золотистая корочка (минут через 5-7), выливаем в кастрюлю белое вином и тушим на среднем огне. Как только вино почти полностью испарится, вынимаем рыбу из кастрюли и временно откладываем в мисочку, накрыв крышкой, чтоб не остыла.",
    "Тем временем режем лук \"квадратиками\" и давим оставшуюся дольку чеснока. Перекладываем лук с чесноком в кастрюлю с оставшимся от рыбы маслом и слегка обжариваем.",
    "Разрезаем пополам помидор и натираем его на тёрке (кожицу выкидываем). Помидорное пюре добавляем в кастрюлю к луку и чесноку.",
    "Через минуту туда же выкладываем рыбу, накрываем кастрюлю крышкой и тушим тунца до готовности на среднем огне. Это займёт еще минут 15.",
    "Готовую рыбу выкладываем на блюдо и поливаем соусом, в котором она тушилась. Посыпаем зеленью и добавляем гарнир по вкусу. В данном случае - кускус и оливки. Приятного аппетита!"
  ],
  "firstAdded": "2014-06-03T21:33:59.666000",
  "hash": "ff529d2938b6ade7132077b51435f31892ec9146",
  "href": "http://www.povarenok.ru/recipes/print/30669/",
  "image": "http://www.povarenok.ru/images/recipes/19/1963/196328.jpg",
  "ingredients": [
    "0",
    "Тунец свежий (красный, филе) — 500 г",
    "Чеснок — 4 зуб.",
    "Вино белое сухое — 150 мл",
    "Лук репчатый — 1 шт",
    "Помидор — 1 шт",
    "Масло оливковое — 6 ст. л.",
    "Базилик свежий (1 веточка)",
    "Соль (морская крупная)",
    "Перец черный (свежемолотый)",
    "Зелень (укроп, петрушка и т.д.)"
  ],
  "keywords": [],
  "title": "Тунец \"Полный штиль\"",
  "users": [
    null
  ]
}