{
  "hash": "4bd20b0df9b2946c1119b6ddd9b5937618388a0d",
  "title": "Insanely good oxtail stew",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/1001_6_1438004333_lrg.jpg",
  "href": "http://www.jamieoliver.com/recipes/beef-recipes/insanely-good-oxtail-stew/",
  "extension": "Chrome",
  "firstAdded": "2015-07-30T17:50:51.601000",
  "users": [
    null
  ],
  "keywords": [
    "oxtail",
    "chunks",
    "ask",
    "butcher",
    "salt",
    "black",
    "pepper",
    "olive",
    "oil",
    "medium",
    "leeks",
    "stalks",
    "celery",
    "carrots",
    "sprigs",
    "thyme",
    "rosemary",
    "bay",
    "leaves",
    "heaped",
    "plain",
    "flour",
    "tins",
    "plum",
    "tomatoes",
    "porter",
    "red",
    "wine",
    "litre",
    "organic",
    "beef",
    "stock",
    "worcestershire"
  ],
  "directions": [
    "0",
    "Preheat the oven to 220ºC/425ºF/gas 7. Place a large roasting tray in the oven to preheat.",
    "Carefully remove the hot tray from the oven, then add the oxtail. Season and drizzle over a lug of olive oil, then toss to coat and place in the hot oven for around 20 minutes, or until golden and caramelized.",
    "Meanwhile, trim and halve the leeks and celery lengthways, then chop into rough 2cm chunks. Peel and chop the carrots into 2cm pieces, then place into a large ovenproof casserole pan over a medium-low heat with 1 tablespoon of olive oil. Pick, roughly chop and add the thyme and rosemary leaves, then add the bay and cook for around 20 minutes, or until soft and sweet, stirring frequently.",
    "Meanwhile, remove the oxtail from the oven and set aside. Reduce the oven temperature to 170ºC/325ºF/gas 3.",
    "Add the cloves and flour to the veg, stirring well to combine, then pour in the tomatoes and porter (or wine, if using). Add the oxtail and any roasting juices, cover with the beef stock or 1 litre of cold water and stir well. Turn the heat up to high and bring to the boil, then pop the lid on and place in the hot oven for around 5 hours, or until the meat falls away from the bone, stirring every hour or so and adding a splash of water to loosen, if needed.",
    "Remove the pan from the oven and leave to cool for about 10 minutes. Using rubber gloves, strip the meat from the bones and return to the pan, discarding the bones. Add a good splash of Worcestershire sauce, season to taste and enjoy with creamy mash and seasonal steamed greens.",
    "Tip: Turn this stew into soup by adding a good splash of boiling water and simmering to your desired consistency. I also love this stirred through pappardelle and served with a grating of Parmesan on top – incredible!"
  ],
  "ingredients": [
    "0",
    "2.5 kg oxtail, chopped into 4cm chunks (ask your butcher to do this)",
    "sea salt",
    "freshly ground black pepper",
    "olive oil",
    "2 medium leeks",
    "2 stalks of celery",
    "4 medium carrots",
    "a few sprigs of fresh thyme",
    "a few sprigs of fresh rosemary",
    "4 fresh bay leaves",
    "4 cloves",
    "2 heaped tablespoons plain flour",
    "2 x 400 g tins of plum tomatoes",
    "275 ml porter or red wine",
    "Optional:",
    "1 litre organic beef stock",
    "Worcestershire sauce"
  ],
  "__v": 1
}