{
  "hash": "8f476ec447983d6c1492029359f08a8b4606b1c4",
  "title": "EASY CHICKEN PAD THAI",
  "image": "http://farm9.staticflickr.com/8861/18624234315_bac5406c58_o.jpg",
  "href": "http://littlespicejar.com/easy-chicken-pad-thai",
  "extension": "Chrome",
  "firstAdded": "2019-03-18T08:18:21.743000",
  "users": [
    null
  ],
  "ratings": [
    {
      "user": "5c8f517703e4741f30e5e076",
      "rating": 5
    }
  ],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "In a medium bowl, combine the sliced chicken, cornstarch and tamari, stir to coat; set aside.",
    "In a 2 cup measuring cup or larger, combine the fish sauce, tamarind paste, water, tamari, lime juice, chicken broth, sambal oelek, brown sugar, and tablespoon of oil, whisk until the brown sugar dissolves completely; set aside.",
    "Cook the noodles according to package directions. Rinse with cold water to stop the cooking process.",
    "Heat a large wok over medium high heat. Add in 1 tablespoon of oil, along with the garlic let cook for 30 seconds, then add the chicken and allow for the chicken to cook through, about 3-4 minutes per side. Remove the chicken to a plate. Add the light green portion of the scallions along with the carrots and let sauté for 30 seconds before adding in the remaining 1 tablespoon of oil and the beaten eggs. Scramble the eggs in the pan until they cook, about 1 minute, then add the chicken, noodles, bean sprouts, and the sauce. Pour the slurry into the pan toss the pad thai using wooden spoons so that everything mixes together, let sauce thicken 1-2 minutes.",
    "Serve immediately topped with dark greens of scallions, cilantro, chopped peanuts, and lots of lime wedges.",
    "Notes",
    "[i]If you absolutely cannot find tamarind paste, you can replace it with equal amounts of rice vinegar.[br][br]1 teaspoon of sambal oelek makes this pad thai mild, feel free to increase the amount of sambal oelek to make it spicier.[br][br]I just threw the peanuts into a food processor and gave it a few pulses instead of chopping.[br][br]Chicken can be replaced with shrimp or tofu too if you’d like.[/i][br][br]© Copyright. All images & content are the sole property of Little Spice Jar. Please obtain permission prior to using my images. If you would like to republish a recipe, please link back to this post and re-write the instructions in your own words."
  ],
  "ingredients": [
    "0",
    "CHICKEN:",
    "1 lb. chicken, thinly sliced",
    "1 tablespoon cornstarch",
    "2 tablespoons low-sodium tamari (or soy sauce)",
    "SAUCE:",
    "1/4 cup fish sauce",
    "1 tablespoon [url href=”http://amzn.to/1S97ieM” target=”_blank”]tamarind paste[/url] (see note)",
    "1 tablespoon water",
    "2 tablespoons low sodium tamari (or soy sauce)",
    "3 tablespoons lime juice",
    "1/3 cup low-sodium chicken broth",
    "1 teaspoon [url href=”http://amzn.to/1Fc9x87″ target=”_blank”]sambal oelek[/url] (or more if you’d like it spicier)",
    "1/3 cup brown sugar",
    "1 tablespoon oil",
    "STIR-FRY:",
    "12 ounces flat [url href=”http://amzn.to/1S94Zsn” target=”_blank”]rice noodles[/url]",
    "2 tablespoons oil",
    "5 cloves garlic, minced",
    "1 bunch scallions, sliced (light greens and darks separated)",
    "1 cup carrots",
    "3 eggs, lightly beaten",
    "1 cup bean sprouts",
    "1 tablespoon cornstarch + 1 tablespoon water (made into a slurry)",
    "1/2 cup cilantro, chopped",
    "1/3 cup roasted peanuts, chopped (see note)"
  ],
  "__v": 2,
  "rating": 5
}