{
  "hash": "0d7bcc4d3030aefef2137a7a5c56fd62dc79e217",
  "title": "Tandoori Tofu",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2013/11/Tandoori-1071x800.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/tandoori-tofu/",
  "extension": "",
  "firstAdded": "2015-03-27T05:22:13.084000",
  "users": [
    null
  ],
  "keywords": [
    "block",
    "extrafirm",
    "tofu",
    "pressed",
    "juice",
    "lemon",
    "kosher",
    "salt",
    "tbs",
    "nondairy",
    "yogurt",
    "plain",
    "canola",
    "oil",
    "red",
    "onion",
    "garlic",
    "smashed",
    "tomato",
    "coriander",
    "cumin",
    "smoked",
    "paprika",
    "ginger",
    "turmeric",
    "cardamom",
    "cayenne",
    "pepper",
    "vegan",
    "butter",
    "chickpea",
    "flour",
    "reserved",
    "marinade",
    "lowsodium",
    "broth"
  ],
  "directions": [
    "0",
    "After the tofu has been pressed and drained, cut it into your desired shapes. I cut the block in half, then cut each half into slices and then into triangles. Place the slices into a shallow bowl. Cover the tofu with the juice of one lemon and sprinkle with salt. Set aside while you prepare the marinade.",
    "Combine all the marinade ingredients into a food processor and process until you have a smooth, thick paste. Pour the marinade over the tofu and with a pastry brush, make sure the slices are covered with marinade on both sides. Let it sit for at least 15 minutes.",
    "Preheat the oven to 500 degrees. Place a cooling rack or a slotted broiler rack over a baking sheet that is covered with foil or parchment paper. Shake the excess marinade off and place the pieces of tofu onto the rack. Reserve the marinade in the bowl. Bake for 15 minutes, turning the baking sheet around half-way through. You want the tofu to develop a crust with a charred look. Turn the broiler on and let the tofu char for a minute or two. While the tofu is baking, prepare the sauce.",
    "1",
    "In a saucepan, heat the oil (or melt the butter) over medium-high heat.",
    "Add the flour and whisk until all the flour is combined. Let cook for a minute so you don’t get a raw flour taste.",
    "Add the reserved marinade to the saucepan along with the tomato paste. Mix it well.",
    "Add 2-3 cups of broth, whisking continuously, until everything is combined and you have a smooth sauce.",
    "Lower the heat, cover the pan and let it cook for a few minutes until the sauce thickens. If you want the sauce to be extra silky, you can whisk in another Tbs. of butter at the end.",
    "2",
    "Serve the tandoori-style tofu topped with the spiced tomato-yogurt sauce."
  ],
  "ingredients": [
    "0",
    "I block extra-firm tofu, pressed and drained",
    "Juice of one lemon",
    "Kosher salt",
    "2 Tbs. non-dairy yogurt, plain",
    "1 Tbs. canola oil",
    "½ red onion, chopped",
    "3 cloves garlic, smashed",
    "4 tsp. tomato paste",
    "2 tsp. ground coriander",
    "2 tsp. ground cumin",
    "2 tsp. smoked paprika",
    "1 tsp. ground ginger or 1 Tbs. fresh ginger, grated",
    "1 tsp. turmeric",
    "½ tsp. dried cardamom",
    "½ tsp. Kosher salt",
    "A dash of cayenne pepper (optional)",
    "1",
    "2 Tbs. canola oil or vegan butter",
    "2 Tbs. chickpea flour",
    "Reserved marinade",
    "2 Tbs. tomato paste",
    "2-3 cups low-sodium vegetable broth"
  ],
  "__v": 1
}