{
  "hash": "1c848772355f72b59b84ad5b1ddbaa38b70b8af2",
  "title": "No-Bake Mint Chip Lush",
  "image": "http://www.crazyforcrust.com/wp-content/uploads/2015/02/No-Bake-Mint-Chip-Lush-Dessert-16-of-16w.jpg",
  "href": "http://www.crazyforcrust.com/2015/03/no-bake-mint-chip-lush/",
  "extension": "Firefox",
  "firstAdded": "2015-09-27T17:23:53.663000",
  "users": [
    null
  ],
  "keywords": [
    "oreo",
    "cookies",
    "unsalted",
    "butter",
    "cream",
    "cheese",
    "regular",
    "lowfat",
    "granulated",
    "sugar",
    "vanilla",
    "peppermint",
    "container",
    "light",
    "fatfree",
    "whipped",
    "mini",
    "chocolate",
    "chips",
    "approx",
    "box",
    "instant",
    "pudding",
    "nonfat",
    "milk",
    "drops",
    "green",
    "food",
    "coloring"
  ],
  "directions": [
    "0",
    "Directions:",
    "Place cookies in a large resealable bag. Seal all but one inch of the bag and gently crush the cookies using a rolling pin. Pour melted butter into the bag and mix gently with your hands. Pour the crushed cookies into a 9x9” baking dish. Spread evenly over the bottom. (The crust will not completely join together as a pie crust will.)",
    "Beat cream cheese in a large bowl with a hand mixer until smooth. Mix in sugar, vanilla and 1/4 teaspoon peppermint extract. Add more peppermint extract, up to 1/2 teaspoon total, as desired for your personal taste. Fold in 1/2 the container (about 1 1/2 cups) whipped topping. Fold in chocolate chips. Add green food coloring and gently stir to fold in the color. Spread the mint layer over the cookie layer.",
    "Mix the pudding mix with the milk. Whisk for 30 seconds. Let sit for a few minutes until the pudding thickens, then spread over mint layer.",
    "Top with the remaining whipped topping and sprinkle with additional chocolate chips or crushed cookies. Cover and chill at least 2 hours before serving. Eat within 3 days.",
    "Notes:",
    "You can use whipped cream in place of the whipped topping but then the dish needs to be prepared and served in the same day. The whipped cream will weep a little as the dish sits, so it's best eaten the same day it's made."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "20 Oreo cookies",
    "2 tablespoons unsalted butter, melted",
    "8 ounces cream cheese (regular or low-fat)",
    "1/4 cup granulated sugar",
    "1 teaspoon vanilla extract",
    "1/4-1/2 teaspoon peppermint extract",
    "1 (8 ounce) container whipped topping (regular, light, or fat-free) *you can substitute about 3 cups freshly whipped cream, see note*",
    "1/2 cup mini chocolate chips",
    "1 (approx. 3.4 ounce) box instant chocolate pudding mix",
    "1 1/4 cups nonfat milk",
    "5-7 drops green food coloring",
    "Additional mini chocolate chips or crushed cookies topping"
  ],
  "__v": 1
}