{
  "hash": "f86bf8b5559c70dc0a803b35badab95cc1e006ba",
  "title": "smarttereachday.com\nI made this ADD IMAGE bread\nThe Add tag button has moved! Click the tag (label) icon above the recipe to open the Tag menu. OK",
  "image": "https://cmt.azureedge.net/media/gluten_free_egg_free_dairy_free_cornbrea_201809130151291680073auoo.jpg",
  "href": "https://www.copymethat.com/r/PkVMmGe/gluten-free-egg-free-dairy-free-cornbrea/",
  "extension": "",
  "firstAdded": "2018-12-29T00:06:43.762000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Pour the buttermilk and shortening into the dry ingredients and mix just until blended. Do not overmix.",
    "Pour into greased muffin tins, or a greased 9 x 9 glass baking dish. For muffins, bake at 375 degrees for 22 minutes. For the 9 x 9 pan, bake at the same temperature, testing at 20 minutes for done-ness.",
    "I love to top with butter and a drizzle of honey, and crumble over whatever chili or beans I’m serving up. Just home-fried, down-home, southern-baked amazingness. The end."
  ],
  "ingredients": [
    "0",
    "Mix together dry ingredients:",
    "1 cup yellow cornmeal",
    "1/2 cup gluten-free flour blend (I get mine at Trader Joe’s. It’s a blend of brown rice flour, potato starch, rice flour, and tapioca flour.)",
    "2 Tablespoons sugar",
    "1 teaspoon salt",
    "1 Tablespoon aluminum-free baking powder",
    "1/2 teaspoon baking soda",
    "{You can store this mix in your pantry for a few months, if you wish.}",
    "When ready to bake, you need to essentially make a dairy-free buttermilk. The buttermilk will substitute for egg as a leavening ingredient in your cornmeal. To make this buttermilk, mix together:",
    "slightly less than 1 cup unsweetened coconut milk",
    "1T distilled white vinegar",
    "Let it sit for five minutes. Satisfy your inner scientist as you watch it bubble up like an experiment.",
    "Then, add:",
    "1/4 c palm shortening or coconut oil",
    "additional 1/4 c of coconut milk"
  ],
  "__v": 1
}