{
  "hash": "5ade4c6203911283fa08a53123f398e5ba803de3",
  "title": "Spinach and Rice",
  "image": "http://www.african-recipes-secrets.com/images/xspinach.jpg.pagespeed.ic.z9dr3l9xKh.jpg",
  "href": "http://www.african-recipes-secrets.com/spinach.html",
  "extension": "Chrome",
  "firstAdded": "2018-01-17T16:52:30.510000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "First, we have to cook the chicken, beef, and shrimp.",
    "Cut your chicken into 1 1/2 inch pieces. Cut stewing beef into 1 inch pieces. Peel and de-vein shrimp.",
    "Combine and add 1 tsp salt and 1 tsp seasoned salt. Stir to spread seasoning evenly. Separate shrimp from beef and chicken.",
    "Add two cookspoon of cooking oil to a large skillet. Heat oil on medium high.",
    "When oil is hot, fry chicken until both sides are golden brown. Remove from oil.",
    "Next, fry shrimp until golden brown.",
    "Reduce heat to medium and sautee beef until cooked.",
    "Set aside.",
    "Now, we are ready to make our greens.",
    "Heat 1 cup of oil in a deep pot on medium high heat. Add chopped greens to hot oil. Add pinch of baking soda and fry for 15 minutes, stirring frequently.",
    "Cut smoked fish or turkey in small 1/2 inch pieces. Add to pot and continue stirring and frying for 20 more minutes. Add chopped onions.",
    "Reduce heat to medium low and cook for 20 more minutes. Add cooked chicken, beef, and shrimp and water. Simmer on low about 15 minutes.",
    "Your greens are ready. Eat on a bed of rice. Spice it up with some fried pepper.",
    "Serve with fried plantains as a side dish."
  ],
  "ingredients": [
    "0",
    "2 pounds frozen chopped spinach",
    "1 lb peeled shrimp",
    "3 lbs chicken and beef",
    "1 smoked fish or 1 C smoked turkey",
    "1 medium onion (chopped)",
    "1 1/2 tsp salt",
    "2 tsp seasoned salt (Lawrys is great)",
    "1/4 tsp ground black pepper",
    "Pinch baking soda (to keep things nice and green)",
    "1 C cooking oil",
    "2 cookspoons cooking oil",
    "1/4 C water 1 or 2 pods hot pepper (optional)"
  ],
  "__v": 1
}