{
  "hash": "1cf243b1edb7b0772af792ea8b49571e6ec6fd27",
  "title": "SMOKY QUINOA AND BLACK BEAN SALAD",
  "image": "https://www.budgetbytes.com/wp-content/uploads/2017/08/Smoky-Quinoa-and-Black-Bean-Salad-V1.jpg",
  "href": "https://www.budgetbytes.com/smoky-quinoa-black-bean-salad/",
  "extension": "Chrome",
  "firstAdded": "2019-01-27T20:45:06.231000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Rinse the quinoa well using a wire mesh sieve to prevent the small granules from washing away. Allow the excess water to drain away and then place the rinsed quinoa in a sauce pot.",
    "Add 1.75 cups water to the sauce pot with the quinoa, place a lid on top, and bring it up to a boil over high heat. Once it reaches a boil, turn the heat down to low and let it simmer for 15 minutes. After 15 minutes, turn the heat off and let it rest for 5 minutes, without removing the lid. Finally, fluff with a fork and allow the quinoa to cool (I placed mine in the refrigerator for faster cooling).",
    "While the quinoa is cooking, prepare the dressing. In a small bowl whisk together the olive oil, vinegar, smoked paprika, cumin, garlic powder, salt, and freshly cracked pepper. Set the dressing aside.",
    "Rinse and drain the black beans. Dice the bell peppers, and slice the green onions.",
    "Combine the beans, bell peppers, green onions, and cooled quinoa in a large bowl. Pour the dressing over top, and stir until everything is evenly mixed and coated in dressing. Taste and adjust the salt if needed. Serve immediately or refrigerate until ready to eat. Make sure to stir the salad well before serving."
  ],
  "ingredients": [
    "0",
    "1 cup uncooked quinoa",
    "1/4 cup olive oil",
    "1 Tbsp apple cider vinegar",
    "1/2 tsp smoked paprika",
    "1/4 tsp cumin",
    "1/8 tsp garlic powder",
    "1/2 tsp salt",
    "Freshly cracked pepper",
    "15 oz can black beans",
    "2 bell peppers (preferable red, yellow, or orange)",
    "2 green onions"
  ],
  "__v": 2
}