{
  "hash": "7947bb4ad29a0c3e41aabe7179d4cf757a4266cf",
  "title": "Gordon Ramsay’s Shepherd’s Pie",
  "image": "",
  "href": "http://gordonramsaysrecipes.com/03/shepherd-pie/",
  "firstAdded": "2014-12-24T03:14:46.443000",
  "users": [
    null
  ],
  "keywords": [
    "filling",
    "olive",
    "oil",
    "lamb",
    "beef",
    "lbs",
    "carrot",
    "onion",
    "rosemary",
    "thyme",
    "garlic",
    "used",
    "salt",
    "pepper",
    "worcestershire",
    "splashes",
    "tomato",
    "puree",
    "red",
    "wine",
    "glugs",
    "chicken",
    "stock",
    "sure",
    "looks",
    "mash",
    "golden",
    "potatoes",
    "cream",
    "butter",
    "egg",
    "yolks",
    "parmesan",
    "cheese",
    "minimum",
    "prep",
    "work",
    "dice",
    "separate",
    "herbs",
    "stems",
    "peel",
    "slice",
    "pieces",
    "open"
  ],
  "directions": [
    "0",
    "Cooking the Potatoes:",
    "This part is easy as pie (no pun intended), just boil some water, throw some salt and your potatoes in, and set a timer for 15 minutes – start on your filling. Upon the timer going off, take your potatoes out and strain the water off. Put potatoes back into the pan, or into a medium mixing bowl. Mash the potatoes with their ingredients from above and keep warm (your filling should be about done by this point)",
    "Cooking the Filling:",
    "Pour Olive Oil into a hot, rather large pan, then add meat. Stir meat as if your life depends on it for a few minutes so it’s nice and brown, and broken into very small pieces. Add your Rosemary, Thyme, and Garlic, then stir some more. Quickly add your Carrot, and Onion, stir a little longer. The idea at this point is to get everything to a minced consistency.",
    "Add Worcestershire Sauce, stir, add Tomato Puree, stir, add Red Wine and sweat down for a minute or two. Add chicken stock and cook for 3 more minutes. I made mine without the stock because I didn’t notice it the first time I watched the show. You can add it, or leave it out.",
    "Final Instructions:",
    "Scoop your meat mixture into a deep casserole or other oven safe dish and then spoon the mash over the top. Spread the mash over the top of the mix with the bottom of the spoon and then sprinkle a generous portion of Parmesan cheese over the top. Poke the top with a fork several times to give it a peaked look and stick it in the oven at 400 degrees for 18-20 minutes to brown the potatoes and set the pie. Serve it up and watch people melt! Oh I love Shepherd Pie!",
    "You can watch the video below to get a better idea of how it’s done."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "The Filling:",
    "Olive Oil (2 Tbsp)",
    "Ground Lamb or Beef (about 1.5 lbs)",
    "1 Large Carrot (grated)",
    "1 Large Onion (grated)",
    "Fresh Rosemary",
    "Fresh Thyme",
    "Minced Garlic (I used 4 cloves)",
    "Salt",
    "Pepper",
    "Worcestershire Sauce (several splashes)",
    "Tomato Puree or Paste (no more than a small can)",
    "Red Wine (several glugs)",
    "Chicken Stock (not sure, but it looks like about 1/4 cup)",
    "The Mash:",
    "Golden Potatoes (about 1.5 lbs)",
    "Heavy Cream ( 1/4 cup)",
    "Butter (3 1/2 Tbsp)",
    "Salt",
    "Pepper",
    "Egg Yolks (2)",
    "Parmesan Cheese (1/4 cup, minimum)",
    "Prep Work:",
    "Dice the garlic",
    "Separate your herbs from the stems",
    "Separate your Egg Yolks",
    "Peel and Slice your potatoes into even pieces",
    "Open your wine if it’s not already",
    "Open your can of Tomato Paste"
  ],
  "__v": 1
}