{
  "hash": "b3fe298a9e67d10d33c795dd6f3f51946d33fdab",
  "title": "Brown Rice & Green Bean Miso Salad",
  "image": "https://static.wixstatic.com/media/26357d_0d4a215df0554da49c09bcf9501cb699~mv2_d_2592_3888_s_4_2.jpg/v1/fill/w_1181,h_1772,al_c,q_90,usm_0.66_1.00_0.01/26357d_0d4a215df0554da49c09bcf9501cb699~mv2_d_2592_3888_s_4_2.webp",
  "href": "https://www.pickuplimes.com/single-post/2017/03/16/Brown-Rice-Green-Bean-Miso-Salad",
  "extension": "Chrome",
  "firstAdded": "2019-05-31T11:42:26.808000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Drain the soaked brown rice and add to a medium pot over high heat. Add 1 cup of water and crush in the bouillon cube. Note: if the bouillon cube is added without crushing it can get stuck to the bottom of the pot and not evenly distribute. Bring to a boil, then reduce to a simmer and partially cover with a lid. Cook until al dente, about 20 minutes. If a small amount of moisture remains, remove the rice from the element and put the lid on tightly. The rice will absorb the extra moisture and become more fluffy, and less gummy.",
    "With the rice is cooking, cut the vegetables and prepare the salad dressing by adding all the ingredients to a blender, and blend on high until well combined. Note: if using ginger powder instead of fresh ginger, you can whisk this in a bowl instead of blending.",
    "Add the cooked rice and vegetables into a medium bowl. Add the dressing and toss until coated. Enjoy immediately or allow the rice to marinate in the sauce in the fridge and serve later."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS: SALAD",
    "1/2 cup brown rice, soaked overnight*",
    "1/2 vegetable bouillon cube",
    "10 long flat green beans, cut into thirds**",
    "2 medium red bell peppers, diced",
    "1/2 medium red onion, minced",
    "INGREDIENTS: Dressing",
    "1 small lime, juiced",
    "2 tsp olive oil",
    "1 tsp sesame oil",
    "2 tsp miso paste",
    "1 tsp soy sauce",
    "1 tsp rice vinegar, or other vinegar",
    "1 cm chunk fresh ginger***",
    "pepper to taste"
  ],
  "__v": 1
}