{
  "hash": "edb1ab17d562fdbdfd1cb18b228145a4a9ce2b54",
  "title": "Paul McCartney's refried bean tacos",
  "image": "http://www.marinmamacooks.com/wp-content/uploads/2012/06/Paul-McCartneys-refried-bean-tacos1-640x425.jpg",
  "href": "http://marinmamacooks.com/2012/06/paul-mccartneys-refried-bean-tacos/",
  "extension": "Chrome",
  "firstAdded": "2017-08-06T01:18:53.934000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "First, chop up your onion, and then de-seed and chop up your tomatoes.",
    "Heat 2 tablespoons olive oil in a large skillet over medium heat. Add the onion and a pinch of salt, and cook for about 4-5 minutes, stirring frequently until the onion is soft but not browned.",
    "Stir in the refried beans. Add in the chopped tomatoes and cook until heated through. Season to taste with a bit of sea salt.",
    "If you like your tacos spicy, add the 1 to 2 teaspoons of chill sauce to the refried bean mixture.",
    "It's time to heat up your tortillas. You can heat up the tortillas 2 ways.",
    "Toss the tortillas on the grill, and grill them until slightly charred and pliable, about 20 seconds per side.",
    "Don't feel like turning on the grill? Then turn on your stove. Set your burner to low and put the tortilla on top of the grate and cook for about 20 seconds per side.",
    "Top each tortilla with the bean mixture and then add your favorite fixings. Make sure to squeeze some fresh lime juice on each taco."
  ],
  "ingredients": [
    "0",
    "1 medium yellow onion, finely chopped",
    "2 tablespoons extra-virgin olive oil",
    "1 15-ounce can of refried beans - I love Amy's Organic Refried Beans, as they come in BPA free cans",
    "4 medium tomatoes, de-seeded and chopped - I typically use Italian plum tomatoes, but love using heirloom tomatoes in the summer",
    "pinch or two of sea salt",
    "1 package of whole grain corn tortillas or taco shells",
    "Monterey jack cheese",
    "1 lime",
    "*Optional - 1-2 teaspoons hot chili sauce - I did not add this because the kid's do not like things too spicy",
    "sliced avocado or guacamole for topping the tacos"
  ],
  "__v": 1
}