{
  "hash": "0581b13401ff7b68d45289848ccc089aebd50321",
  "title": "Gluten free Yeast free Vegan Pizza Crust Recipe",
  "image": "http://www.veganricha.com/wp-content/uploads/2015/08/gluten-free-yeast-free-vegan-pizza-crust-9475.jpg",
  "href": "http://www.veganricha.com/2015/09/gluten-free-yeast-free-vegan-pizza-crust-recipe.html",
  "extension": "",
  "firstAdded": "2015-09-23T10:45:30.833000",
  "users": [
    null
  ],
  "keywords": [
    "chickpea",
    "flour",
    "white",
    "garbanzo",
    "beans",
    "chia",
    "seed",
    "meal",
    "brown",
    "rice",
    "coconut",
    "use",
    "baking",
    "soda",
    "garlic",
    "salt",
    "wet",
    "oil",
    "lemon",
    "juice",
    "water",
    "toppings",
    "marinara",
    "pizza",
    "spinach",
    "basil",
    "tofu",
    "ricotta",
    "thyme",
    "vegan",
    "cheese"
  ],
  "directions": [
    "0",
    "Roast the chickpea flour in a large skillet over medium heat for 4 to 5 minutes. Stir once every minute for the first 2 minutes. Then every 20 seconds. Cool and transfer to a bowl. Roasted flour gives a better flavor profile. You can skip the roasting and use the chickpea flour as is in the batter..",
    "Add the rest of the dry ingredients to the chickpea flour bowl and whisk well.",
    "Add lemon juice to ¾ cup water and add to the bowl. Add oil and mix or whisk until there are no lumps. Add 1 to 2 tbsps more water and mix in to make a thick batter. Let the mixture sit for 5 minutes.",
    "Meanwhile, Preheat the oven to 400 degrees F.",
    "If the batter is too thick/stiff, add 1 to 2 tsp more water and mix in. Drop the thick batter on parchment lined baking sheet. Spray water on the batter. Use a large spoon or spatula to spread it into a circle. Spray water on the batter to avoid sticking to the spatula while spreading.",
    "Bake the crust for 12 minutes. Remove from oven and top with sauce, veggies, cheese of choice.",
    "Bake again for 12 to 14 minutes. Broil for a minute to crisp or melt the cheese if needed.",
    "Cool for 2 minutes before slicing."
  ],
  "ingredients": [
    "0",
    "1 cup chickpea flour (flour of white garbanzo beans)",
    "2 tbsp chia seed meal",
    "2 Tbsp brown rice flour or white rice flour",
    "1 Tbsp coconut flour (or use more chickpea flour)",
    "½ tsp baking powder",
    "¼ tsp baking soda",
    "¼ tsp garlic powder",
    "½ tsp salt",
    "Wet:",
    "1 Tbsp oil",
    "½ tsp lemon juice",
    "¾ cup + 2 Tbsp water",
    "Toppings:",
    "Marinara or other pizza sauce",
    "spinach or chopped basil",
    "tofu thyme basil ricotta , use less thyme and add some basil, or use vegan cheese or choice"
  ],
  "__v": 1
}