{
  "hash": "77bdd7f865c13fc37c58db3d3f19ddfb11713901",
  "title": "CINNAMON NUT SWIRL MUG CAKE",
  "image": "https://www.budgetbytes.com/wp-content/uploads/2019/04/Cinnamon-Nut-Swirl-Mug-Cake-front-spoonful.jpg",
  "href": "https://www.budgetbytes.com/cinnamon-nut-swirl-mug-cake/",
  "extension": "Chrome",
  "firstAdded": "2019-04-13T01:28:06.515000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a small mug (about 1 cup volume), stir together the dry ingredients for the mug cake batter: flour, brown sugar, baking powder, salt, cinnamon, and chopped pecans.",
    "Add the melted butter and milk to the dry ingredients in the mug and stir until a thick batter forms.",
    "In a separate small bowl or mug, melt the butter for the cinnamon butter swirl (about 15 seconds in the microwave). Stir the brown sugar and cinnamon into the melted butter.",
    "Drizzle the cinnamon butter swirl over the mug cake batter, then gently fold them together until they are only about half mixed. There should be thick ribbons of the cinnamon butter swirl throughout the batter.",
    "Microwave the mug cake for 45-55 seconds (for a 1100 watt microwave, cooking time will vary with microwave wattage). The mug cake will create quite a bit of steam as it cooks, so don't be alarmed. Let the mug cake cool for 1-2 minutes.",
    "While the mug cake is cooling, stir together the powdered sugar and milk for the icing, using the same small bowl used for the cinnamon butter swirl. The residual cinnamon in the bowl will flavor the icing.",
    "Drizzle the icing over the mug cake and enjoy while it is still warm."
  ],
  "ingredients": [
    "0",
    "MUG CAKE BATTER",
    "1/4 cup all-purpose flour ($0.03)",
    "1 Tbsp brown sugar ($0.04)",
    "1/4 tsp baking powder ($0.01)",
    "1/8 tsp salt ($0.01)",
    "1/8 tsp cinnamon ($0.02)",
    "1 Tbsp chopped pecans or walnuts (optional) ($0.16)",
    "1/2 Tbsp butter, melted ($0.03)",
    "2 Tbps milk ($0.04)",
    "CINNAMON BUTTER SWIRL",
    "1/2 Tbsp butter, melted ($0.03)",
    "1 tsp brown sugar (0.02)",
    "1/2 tsp cinnamon ($0.05)",
    "ICING",
    "1 Tbsp powdered sugar ($0.01)",
    "1/2 tsp milk ($0.01)"
  ],
  "__v": 3
}