{
  "hash": "ce7ecd11709ba00080df5564dd20da1b369a42c1",
  "title": "Chicken Zucchini Alfredo",
  "image": "http://images.media-allrecipes.com/userphotos/560x315/1030093.jpg",
  "href": "http://allrecipes.com/recipe/232579/chicken-zucchini-alfredo/?internalSource=rotd&referringId=17245&referringContentType=recipe%20hub&clickId=cardslot%201",
  "extension": "Chrome",
  "firstAdded": "2017-01-13T18:28:31.568000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Fill a large pot with lightly salted water and bring to a rolling boil. Stir in the fettuccine, bring back to a boil, and cook pasta over medium heat until cooked through but still firm to the bite, about 8 minutes. Reserve about 1/2 cup cooking water and drain pasta.",
    "Heat 1 tablespoon olive oil in a skillet over medium heat; cook and stir 1 clove garlic in hot oil until fragrant, about 30 seconds. Add zucchini and red pepper flakes. Continue to cook and stir until zucchini are tender, about 5 minutes. Transfer vegetables to a large bowl and cover with aluminum foil.",
    "Season chicken breast halves with kosher salt and black pepper.",
    "Heat 1 tablespoon olive oil over medium-high heat in the same skillet used to cook zucchini. Pan-fry chicken in hot oil until juices run clear and center is no longer pink, about 5 minutes per side. Transfer chicken to a plate and cut into strips. Cover with aluminum foil.",
    "Whisk milk and flour together in a bowl.",
    "Heat remaining 1 tablespoon olive oil in a large saucepan; cook and stir remaining 1 clove garlic in hot oil until fragrant, about 30 seconds. Stir in flour mixture and bring to a boil while stirring constantly. Reduce heat to low and continue cooking and stirring for 2 minutes. Stir Parmesan cheese, evaporated milk, and 1/2 teaspoon salt into the flour mixture, stirring until cheese is melted and sauce is heated through, about 5 minutes. Season with salt and black pepper.",
    "Toss pasta, chicken strips, zucchini, and parsley into sauce, adding reserved cooking water as needed if sauce is too thick."
  ],
  "ingredients": [
    "0",
    "12 ounces whole wheat fettuccine",
    "3 tablespoons extra-virgin olive oil, divided",
    "2 cloves garlic, minced and divided",
    "2 zucchinis, halved lengthwise and cut into thin half moons",
    "1 pinch red pepper flakes (optional)",
    "4 (4 ounce) skinless, boneless chicken breast halves",
    "kosher salt and ground black pepper to taste",
    "1",
    "1 cup cold milk",
    "1 tablespoon all-purpose flour",
    "3/4 cup grated Parmesan cheese",
    "1/2 cup fat-free evaporated milk",
    "1/2 teaspoon kosher salt",
    "1/4 cup chopped fresh flat leaf parsley",
    "2",
    "395 g whole wheat fettuccine",
    "50 ml extra-virgin olive oil, divided",
    "2-1/4 cloves garlic, minced and divided",
    "2-1/4 zucchinis, halved lengthwise and cut into thin half moons",
    "1-1/4 pinches red pepper flakes (optional)",
    "4-3/4 (4 ounce) skinless, boneless chicken breast halves",
    "kosher salt and ground black pepper to taste",
    "3",
    "275 ml cold milk",
    "9 g all-purpose flour",
    "70 g grated Parmesan cheese",
    "140 ml fat-free evaporated milk",
    "3 g kosher salt",
    "20 g chopped fresh flat leaf parsley"
  ],
  "__v": 1
}