{
  "hash": "5893e41f4e94b9d4f4efeeed35ce3ddc9cddeca4",
  "title": "One Pot Greek Chicken and Rice Pilaf",
  "image": "http://littlespicejar.com/wp-content/uploads/2016/05/One-Pot-Greek-Chicken-with-Rice-Pilaf-300x420.jpg",
  "href": "http://littlespicejar.com/one-pot-greek-chicken-and-rice-pilaf/",
  "extension": "Firefox",
  "firstAdded": "2019-03-03T08:48:09.900000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "CHICKEN: Combine 2 tablespoons of olive oil, lemon juice, minced garlic, red wine vinegar, salt, pepper, red pepper flakes, and oregano in a zip top bag. Add the chicken breasts, zip the bag and give it a good shake until the chicken breasts are evenly covered in the marinade. Allow the chicken to marinate for 15 minutes and up to 1 hour.",
    "In a large sauté pan, heat the remaining 1 tablespoon of olive oil over medium high heat. Remove the chicken breasts from the marinade and discard marinade. Cook the chicken breasts for 4-6 minutes per side or [b]until the chicken is all the way cooked through and registers 165ºF on a thermometer[/b]. Remove the chicken to a plate. Cover loosely with a piece of foil and keep warm.",
    "RICE PILAF: Rinse the rice in a fine mesh strainer under cold running water for 2 minutes, use your fingers to rub the rice, set aside. Place the butter in the same sauté pan and allow it to melt over medium high heat. Add the rinsed rice and allow to toast for 3-4 minutes, stirring frequently so the rice doesn’t burn. Add the chicken broth and lemon juice to the pot and allow it to come to a boil. Stir just once to break up any lump. Cover, reduce heat to low and let the rice cook for 8 minutes. At the 8 minute mark, remove the cover, the rice won’t be cooked through yet, add the lemon zest and lemon slices to the rice and top with the cooked chicken breasts. Cover and continue to cook for 5-10 minutes or until the liquid dried up and the rice cooked through. Allow to stand for 5 minutes before topping with parsley and serving."
  ],
  "ingredients": [
    "0",
    "4 boneless, skinless chicken breasts (or thighs)",
    "3 tablespoons EACH olive oil AND lemon juice",
    "2 tablespoons red wine vinegar",
    "1 tablespoon minced garlic",
    "½ teaspoon salt and 1/4 teaspoon black pepper",
    "¼ teaspoon red pepper flakes (or more!)",
    "4 teaspoons fresh oregano (or 2 tsp dried)",
    "Rice Pilaf:",
    "1 tablespoon butter",
    "1 ¼ cup long grain [b]parboiled rice[/b]",
    "2 ½ cup chicken broth",
    "2-3 tablespoons lemon juice (see notes)",
    "zest of 1 lemon / sliced lemons (if desired)",
    "¼ cup chopped parsley"
  ],
  "__v": 1
}