{
  "hash": "259f192668fd4a6336d8dd94dca2c76c9cc3fe1e",
  "title": "Noodles in Black Bean Sauce",
  "image": "http://kimchimari.com/wp-content/uploads/2014/08/Jjajangmyeon-Black-Bean-Sauce-Noodles-1-2-678x1024.jpg",
  "href": "https://kimchimari.com/jjajang-myeon/",
  "extension": "Chrome",
  "firstAdded": "2019-01-25T16:09:29.008000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Chop all vegetables into small cubes.",
    "Save",
    "Chopped vegetables for Jjajang Myeon",
    "3. In a non-stick frying pan, add equal amount of chunjang and oil to pan on medium/medium low heat. Should be bubbling but not burning. Stirring often, cook for 7 min.",
    "Save",
    "stir frying jajang (black bean paste) in oil",
    "Lot of oil will be leftover after stir frying the paste.",
    "Save",
    "Jjajang sauteed in oil (after 7 min of cooking)",
    "4. WHILE the choonjang is cooking, in ANOTHER pan, add 2 T oil to pan on medium heat. Sauté just onions and cabbages for 10 min or more until onions become translucent. This will make your sauce taste sweeter!",
    "Save",
    "cooked onions and cabbages",
    "5. Remove chunjang from pan. It should be easy to bunch up the cooked chunjang and remove from oil. Like so-",
    "Save",
    "chunjang cooked in oil",
    "6. Discard the leftover oil in pan.",
    "7. Remove onions and cabbages from pan and set aside. Sauté pork on med-high heat for 2-3 min in the same pan.",
    "8. Once pork is cooked, return onions, cabbages to pan. Add 1 T oil and remaining vegetables. Sauté all ingredients on med-high heat for 5 – 7 min. Veggies should still be slightly crunchy.",
    "9. Add the cooked chunjang paste to pan (step 8) and stir everything, making sure the paste coats the ingredients evenly.",
    "Save",
    "Jajang sauce with vegetables for jajangmyeon",
    "10. Stir fry for 2 min. Add 1 C water and 1 T sugar. Cook until the sauce is reduced to half. Reduce further for more condensed flavor.",
    "11. Fresh noodles (국수 guksu) are best for Jajangmyeon. If you can buy one’s that says “짜장면 국수”, it should work fine. Believe it or not, I could not find it at my local market. Probably because not many Koreans make Jajangmyeon at home in Korea. I bought 칼국수 (Kalguksu/Kalgooksoo) and that worked fine. Just cook the noodles in boiling water for 7-10 min (based on package directions) and rinse in cold water.",
    "Save",
    "fresh Korean noodle package (생 칼국수 saeng kalgooksoo)",
    "12. Sauce is now ready!"
  ],
  "ingredients": [
    "0",
    "1/2 C Chinese black bean paste (춘장 chunjang/choonjang)",
    "1/2 C or 3 fresh, dried or fresh shitake mushrooms, chopped (optional)",
    "3 oz (80g) pork loin, cut into cubes",
    "1 medium size onion, chopped",
    "1 1/2 C cabbage, chopped",
    "1/2 C zucchini, chopped",
    "1 carrot, chopped (optional)",
    "2 green onions, chopped",
    "1/2 cucumber, julienned (as garnish)",
    "1 T sugar",
    "1 C water",
    "1/2 C + 3 T vegetable oil",
    "1 pack of fresh noodles for jajangmyeon or kal guksu"
  ],
  "__v": 1
}