{
  "hash": "e110cd76cf0c5d66ffc2ecb75a9c42af7d7d6fa0",
  "title": "Easy 1-Pot Massaman Curry",
  "image": "http://recipe-folder.com/img/recipe-images/069/782/682773169.jpg",
  "href": "http://recipe-folder.com/recipe/5eb192fece7e4d08309a3551",
  "extension": "User Added",
  "firstAdded": "2020-05-05T16:23:26.259000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "https://minimalistbaker.com/easy-1-pot-massaman-curry/",
    "PROTEIN OPTIONS",
    "You have options for added protein or you can just stick with vegetables.",
    "To keep it vegan-friendly, follow the link above to make Crispy Peanut Tofu.",
    "Or, to keep this a 1-pot recipe, simply add (pressed) cubed extra-firm tofu to the curry in the last 10 minutes of cooking or sauté pressed tofu in a little oil and season with salt, pepper, and curry powder before cooking the curry. Set aside, then add back in in the last few minutes of cooking for best results.",
    "Alternatively, add meat such as shrimp or chicken to the curry once it's simmering (during step 4) and simmer until cooked completely through.",
    "CURRY",
    "Heat a large pot or dutch oven (we like this one) over medium heat. Once hot, add oil (or water) and shallot. Sauté 2 minutes, stirring frequently. Turn down heat if browning too quickly.",
    "Add whole cumin and coriander seeds (or powder) and sauté for another 1-2 minutes, stirring frequently. Then add red curry paste and stir to combine. Cook for 1 minute more.",
    "Add potatoes and carrots and stir to coat. Cook for 2 minutes. Then add coconut milk, water (starting with the lesser amount), cinnamon, cardamom, nutmeg, coconut aminos, maple syrup, and peanut butter. (Reserve lime juice for later).",
    "The liquid should cover all of the ingredients — if it does not, add a bit more coconut milk or water to cover. Bring to a simmer over medium-high heat.",
    "Once it reaches a low boil, reduce heat to a simmer (add meat at this time if cooking with shrimp or chicken) and cook for 10-15 minutes uncovered. You don't want it boiling, so ensure it's cooking over low heat at a simmer.",
    "Add lime in the last few minutes of cooking and stir. Then taste and adjust flavor as needed, adding more lime for acidity, salt or coconut aminos for saltiness, curry paste for heat / more intense curry taste, maple syrup for sweetness, cinnamon or nutmeg for warmth, or peanut butter for creaminess / more intense peanut flavor.",
    "Stir and cook a few minutes more. Then turn off heat and let stand for at least 5 minutes before serving (this allows the flavors to meld).",
    "To serve, divide between serving bowls and enjoy as is or with a side of rice, cauliflower rice, quinoa, or steamed greens (optional). Fresh lime juice, cilantro, and roasted peanuts (optional) make lovely additions as well.",
    "STORAGE",
    "Store cooled leftovers in the refrigerator up to 4-5 days or in the freezer up to 1 month. Reheat in the microwave or in a saucepan. Add more water or coconut milk as needed to rehydrate."
  ],
  "ingredients": [
    "0",
    "PROTEIN OPTIONS optional",
    "1",
    "1 batch Crispy Baked Peanut Tofu (vegan-option)",
    "2",
    "1/2 lb. shrimp (seafood option — wild caught when possible)",
    "3",
    "1 large skinless chicken breast, cubed (meat option — free-range, local, organic when possible)",
    "4",
    "CURRY",
    "5",
    "2 Tbsp coconut or avocado oil (if avoiding oil, sub water and add more as needed)",
    "6",
    "3 medium shallots, thinly sliced (or sub 1 small onion)",
    "7",
    "1 tsp whole cumin seed (or sub powder)",
    "8",
    "1 tsp whole coriander seed (or sub powder)",
    "9",
    "5 Tbsp red curry paste (we love Thai Kitchen brand)",
    "10",
    "1 ½ cups baby potatoes cut into bite-size pieces",
    "11",
    "2 large carrots, peeled and diced 1/4-inch thick",
    "12",
    "2 14-oz. cans light fat coconut milk (sub up to 1 can with full-fat coconut milk for creamier, richer curry — texture shown in photos above)",
    "13",
    "1-1 ½ cups water",
    "14",
    "1/4 tsp ground cinnamon",
    "15",
    "1 dash each cardamom and nutmeg (if you don't have, omit)",
    "16",
    "2-3 Tbsp coconut aminos (or sub tamari or soy sauce, but start with less as they're saltier)",
    "17",
    "1-2 Tbsp maple syrup or coconut sugar (or sub stevia to taste)",
    "18",
    "2 Tbsp peanut butter (in place of traditional roasted peanuts — can sub roasted peanuts)",
    "19",
    "1-2 Tbsp lime juice (or lemon)",
    "20",
    "FOR SERVING optional",
    "21",
    "Cauliflower Rice, Rice, or Quinoa",
    "22",
    "Lime wedges",
    "23",
    "Fresh cilantro",
    "24",
    "Steamed or curried greens",
    "25",
    "Roasted salted peanuts, chopped"
  ],
  "__v": 2,
  "hidden": true
}