{
  "hash": "f610f067300d41c4652b1b44db05358ff8a6376d",
  "title": "Gooseberry tart recipe",
  "image": "http://i.telegraph.co.uk/multimedia/archive/01926/tart_intro_1926442b.jpg",
  "href": "http://www.telegraph.co.uk/foodanddrink/recipes/8582937/Gooseberry-tart-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-07-11T15:17:25.517000",
  "users": [
    null
  ],
  "keywords": [
    "pastry",
    "plain",
    "flour",
    "baking",
    "butter",
    "salt",
    "icing",
    "sugar",
    "egg",
    "yolk",
    "cold",
    "water",
    "gooseberries",
    "caster",
    "topped",
    "tailed",
    "filling",
    "yolks",
    "double",
    "cream",
    "zest",
    "lemon"
  ],
  "directions": [
    "0",
    "Put everything for the pastry except the egg yolk and water into a food processor and whizz until you have a breadcrumb-like mixture. Mix the yolk and water together and add it while the motor is running until the pastry comes together. Don't overwork the dough – as soon as it forms a ball, take it out of the processor. Wrap in clingfilm and put it in the fridge for about six hours.",
    "To prepare the gooseberries, heat the sugar and water gently, stirring from time to time to help the sugar dissolve. With the liquid at a simmer add the gooseberries and cook for three minutes, until they are just softening. Scoop out with a slotted spoon and set aside.",
    "Allow the pastry to come to room temperature, then roll it out on a lightly floured surface to fit a 20-23cm (8-9in) tart tin. Press into the tin, trim off the excess and place in the fridge for half an hour (or in the freezer).",
    "Heat the oven to 190°C/375°F/gas mark 5 and put in a metal baking-sheet. Line the pastry case with greaseproof paper and beans, place on the baking-sheet and bake blind for 10 minutes. Remove the paper and beans and leave the pastry to cool a little while you make the filling.",
    "Beat the egg yolks and sugar for 10 minutes, until the mixture has tripled in volume. Add the cream and zest. Spoon the gooseberries into the tart case and pour the filling over the top. Return it to the oven and bake for 25 to 30 minutes. Let the tart cool for an hour then sift some icing sugar over the top and serve with sweetened whipped cream."
  ],
  "ingredients": [
    "0",
    "For the pastry",
    "125g (4½oz) plain flour",
    "¼ tsp baking powder",
    "70g (2¾oz) butter",
    "pinch of salt",
    "35g (1¼oz) icing sugar",
    "1 egg yolk",
    "1 tbsp cold water",
    "For the gooseberries",
    "100g (3½oz) caster sugar",
    "150ml (5fl oz) water",
    "350g (12oz) gooseberries, topped and tailed",
    "For the filling",
    "2 egg yolks",
    "50g (1¾oz) caster sugar",
    "75ml (2¾fl oz) double cream",
    "finely grated zest of ½ lemon"
  ],
  "__v": 1
}