{
  "hash": "4fbae51c74daf95a14f5811cbb97e29b41cd32de",
  "title": "Chicken Pot Pie Pockets",
  "image": "http://www.chef-in-training.com/blog/wp-content/uploads/2013/06/Chicken-Pot-Pie-Pockets-2.jpg?afaf6d",
  "href": "http://www.chef-in-training.com/2013/06/chicken-pot-pie-pockets/",
  "extension": "Firefox",
  "firstAdded": "2016-05-06T01:44:24.899000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large microwave safe bowl, combine cream cheese and butter. Microwave in 15 second intervals until slightly melted and able to stir until smooth.",
    "Add onion powder and garlic salt to cream cheese/butter mixture and stir well.",
    "Add chicken, potatoes, carrots and celery to cream cheese mixture. Stir until well combined.",
    "Unroll both sheets of refrigerated pie crust dough. Cut each of the round pie crusts into quarters.",
    "On one quarter of pie crust dough, put ¼ of cream cheese/chicken mixture (about ¾-1 cup.) Place a second quarter of pie crust dough over the top (make sure it lines up with bottom quarter) and pinch seams to seal off. You can flute the pie crust edges for a prettier look.",
    "Repeat until you have 4 pie pockets. Cut about three small slits on the tops of each pie pocket for breathing. Place on a greased cookie sheet. (At this point you can freeze the pie crusts. Pull out when desired from freezer and place on greased cookie sheets and let sit for about 10-15 minutes before cooking. Then continue with remaining direction)",
    "Bake at 400 degrees F for about 20 minutes or until tops are golden brown.",
    "FOR WHITE SAUCE: Melt butter in saucepan, add flour and stir to combine to form a roux. Once you have your roux, add half and half (or milk) and stir constantly until sauce thickens. Remove from heat and stir in Garlic salt and onion powder until well combined."
  ],
  "ingredients": [
    "0",
    "8 oz. cream cheese",
    "4 Tbsp. butter",
    "¼ tsp. garlic salt",
    "¼ tsp. onion powder",
    "1½ cups cooked and shredded chicken, I usually buy a rotisserie chicken and shred it up.",
    "½ cup peeled, cooked and diced potatoes",
    "½ cup peeled, cooked and chopped carrots",
    "¼ cup cooked and chopped celery",
    "1 box refrigerated Pillsbury Pie Crust",
    "1",
    "¼ cup butter",
    "¼ cup flour",
    "2 cups half and half",
    "½ tsp. garlic salt",
    "½ tsp. onion powder"
  ],
  "__v": 1
}