{
  "hash": "ee594ca120c657f8d3322ffb378fa0e7d4c0ecf1",
  "title": "Vegan Gluten-free Chocolate Peppermint Christmas Cake",
  "image": "http://thevegan8.com/wp-content/uploads/2015/12/chocolatepeppermintcake2-1-of-1.jpg",
  "href": "http://thevegan8.com/2015/12/22/vegan-gluten-free-chocolate-peppermint-cake-oil-free/",
  "extension": "",
  "firstAdded": "2015-12-22T15:31:01.515000",
  "users": [
    null
  ],
  "keywords": [
    "flour",
    "scale",
    "accurate",
    "use",
    "regular",
    "almond",
    "meal",
    "skins",
    "light",
    "produce",
    "results",
    "starch",
    "potato",
    "cocoa",
    "aluminumfree",
    "baking",
    "salt",
    "espresso",
    "useilly",
    "brand",
    "makes",
    "chocolate",
    "richer",
    "maple",
    "syrup",
    "pumpkin",
    "puree",
    "aquafaba",
    "chickpeas",
    "overpower",
    "flavor",
    "peppermint",
    "glaze",
    "peppermints",
    "presentation",
    "purpose",
    "crucial",
    "sub",
    "best",
    "necessary",
    "moist",
    "dont",
    "bobs",
    "red",
    "cake",
    "bits",
    "left",
    "doesnt",
    "fluffy",
    "make",
    "sure",
    "grind",
    "bit",
    "vitamix",
    "highly",
    "recommend",
    "king",
    "arthur",
    "honeyville",
    "simple",
    "truth",
    "kroger",
    "texas",
    "heb",
    "perfect",
    "cakes",
    "amazing",
    "birthday",
    "omit",
    "replace",
    "vanilla"
  ],
  "directions": [
    "0",
    "Make sure your pan is ready before preparing the ingredients. You will need to line a 9 inch round metal pan with parchment on the bottom. I cut a round circle of paper for the bottom. The best way to make the perfect circle is to place the pan on the paper and draw a line around the edge of the pan. Lightly spray only along the inside sides of the pan and place the parchment paper circle down on the bottom. Add some cocoa powder to the inside sides and swirl the pan around over the sink, with the cocoa powder covering the spray well on the sides as your rotate the pan. Turn the pan over and tap hard the excess powder out. Preheat your oven to 350 degrees.",
    "Make sure to weigh all your ingredients for accurate results. I can't stress the importance of this enough. Fluff your almond flour with a whisk first to break up any lumps, as it tends to lump in storage. To measure, scoop your cups into the dry ingredients, pat down well to make sure there are no gaps and then level off, or simply use the scale for accuracy, making sure your bowl is on the scale and zeroed out before adding the ingredients. Add the almond flour, potato starch, cocoa powder, baking powder, salt and espresso (if using) to a large bowl and whisk everything together really well until there are no lumps remaining. Really make sure it is smooth.",
    "In a separate medium bowl, add the syrup, pumpkin (make sure to level off), aquafaba and peppermint extract. Lightly beat the liquids with a handheld mixer just until smooth and slightly frothy. Pour over the dry ingredients and beat again until completely smooth, about 30 seconds.",
    "Pour the batter into your prepared pan and bake on the middle rack for 25 minutes, or a toothpick comes out clean from the center (may have a few DRY crumbs, but shouldn't have wet batter), I removed mine at exactly 25 mins. Make sure it is cooked through. Let cool in the pan 30 minutes before removing from the pan. Then place your serving platter on top and flip it over, so the flat side is facing up. Cool completely before adding glaze.",
    "For the chocolate peppermint glaze, simply whisk the ingredients until smooth and drizzle over the top. It will take a few minutes because of all the cocoa powder. Garnish with crushed peppermints for presentation, if desired. Keep cake stored in a sealed container to retain it's moisture, at room temperature."
  ],
  "ingredients": [
    "0",
    "1½ cups blanched almond flour (150 g, use a scale for accurate results, do not use regular almond meal (with the skins), it is not light enough and will not produce the same results)",
    "½ cup potato starch, not potato flour (80 g)",
    "¼ cup + 2 tablespoons unsweetened cocoa powder (35 g)",
    "2 teaspoons aluminum-free baking powder (8 g)",
    "½ teaspoon fine sea salt (4 g)",
    "optional: 1 teaspoon finely ground espresso (I useIlly brand, this makes the chocolate richer)",
    "¾ cup + 2 tablespoons pure maple syrup (210 mL)",
    "¼ cup + 2 tablespoons unsweetened pumpkin puree (92 g)",
    "½ cup aquafaba (the liquid from a can of chickpeas)",
    "¼ teaspoon peppermint extract (I found this to be just enough to not overpower the peppermint flavor, because there is peppermint in the glaze too)",
    "Chocolate Peppermint Glaze",
    "¼ cup pure maple syrup",
    "3 tablespoons unsweetened cocoa powder",
    "1/16th teaspoon peppermint extract",
    "⅛ teaspoon fine sea salt",
    "optional: crushed peppermints for presentation purpose",
    "Note: It is crucial to not sub these ingredients for best results. It's necessary to use blanched almond flour because it is what makes the cake so moist and light. I don't recommend Bob's Red Mill blanched almond flour for this cake. It is never finely ground enough and there is always little bits of almond still left and it doesn't produce as light, fluffy results. If you must use it, make sure to grind it down a bit further in a vitamix. I highly recommend King Arthur Flour or Honeyville, Simple Truth brand from Kroger, or if you are in Texas, use the HEB brand, it's perfect and what I use for my cakes.",
    "Note 2: This is the chocolate cake version of this amazing birthday cake! To make this a regular chocolate, omit the peppermint extract and replace with 1½ teaspoons vanilla extract."
  ],
  "__v": 1
}