{
  "hash": "8e9e7ca9be9638b8bc024e62933b97dd1d4a2cf9",
  "title": "Fattet Hummus (Mid-Eastern Savory Chickpea Bread Pudding)",
  "image": "https://images.food52.com/bKhgWQ0ORMB8XdoTA0WzpPepJVo=/753x502/c16253c3-0727-48e2-b94e-92c068609b01--2014-0422_CP_mideastern-chickpea-bread-pudding-007.jpg",
  "href": "https://food52.com/recipes/27712-fattet-hummus-mid-eastern-savory-chickpea-bread-pudding",
  "extension": "Chrome",
  "firstAdded": "2018-01-26T22:40:47.544000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Soak the chickpeas overnight. Rinse well several times under cold running water, then place them in a large pot.",
    "Cover the chickpeas with with about twice their own volume of fresh cold water, bring to a boil, then lower the heat. Simmer them for one hour until tender. Add the cumin and a small dash of olive oil. Keep the pot covered to make sure the liquid remains simmering-hot and ready for use later. (Contrarily, you could use canned chickpeas, and skip to the next step. Make sure to have some hot water ready.)",
    "Put the yogurt in a large glass mixing bowl. Add the tahini, lemon juice, and crushed garlic. Whisk well. Bring two inches of water to a rolling boil in a pot and place the glass bowl on top. Heat the yogurt mix gently, whisking the whole time. Make sure it does not come to a boil; the idea is to just warm it up and blend the flavors together. If the yogurt mixture thickens too much, add a little of the chickpea broth until you get a soupy consistency. Add salt and white pepper to taste.",
    "Separate the pita loaves into two thin layers, then cut them into bite-sized pieces with kitchen scissors. Heat half the olive oil in a frying pan and shallow-fry the pita until crunchy and golden. Alternatively, brush the separated pita rounds with olive oil, toast them well in a hot oven, then break them into bite-sized pieces by hand. You could even simply use day-old bread, if you're in a hurry.",
    "Spread the bread in an even layer in a deep serving platter or bowl. Ladle out about a cup or so of the reserved hot chickpea broth, and drizzle it on top of the bread pieces until they are just soaked.",
    "Set aside 1 to 2 tablespoons of the chickpeas for garnish. With a ladle, scoop the remaining hot chickpeas out of the broth and spread them evenly on top of the bread. Pour the warmed yogurt mixture over the chickpeas. Gently stir the layers together with a large slotted spoon. Top with the reserved chickpeas.",
    "Heat 3 tablespoons of olive oil and fry the pine nuts until golden, then pour them, along with the hot oil, over the chickpea-yogurt mixture. Sprinkle paprika, cayenne pepper, and the torn mint leaves on top for garnish, and enjoy immediately!"
  ],
  "ingredients": [
    "0",
    "2 cups chickpeas, dry",
    "3 cups natural yogurt",
    "2 tablespoons tahini",
    "1/2 lemon, juiced",
    "1 to 2 garlic cloves, crushed",
    "pinches cumin",
    "pinches white pepper (optional)",
    "pinches salt",
    "4 to 5 small pita loaves",
    "1/2 cup olive oil",
    "2 to 3 tablespoons pine nuts",
    "pinches paprika or cayenne pepper (optional for garnish)",
    "3 to 4 mint leaves (optional for garnish)"
  ],
  "__v": 1
}