{
  "hash": "3d54f1d822dcda08498d215a9f05af5215a171ae",
  "title": "Deliciously Buttery Colcannon",
  "image": "https://thetinyvegankitchen.files.wordpress.com/2015/10/img_1279.jpg?w=620",
  "href": "https://thetinyvegankitchen.com/2015/10/20/deliciously-buttery-colcannon/",
  "extension": "",
  "firstAdded": "2016-08-26T21:09:31.002000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Method:",
    "Over a pot of water, remove the kale from the stems and cut into thin ribbons with a scissors. Allow the strips to fall into the pot, rinse well to remove all dirt and grit.",
    "Add the potatoes to a large pot of water with the garlic and bring to the boil. Adding the garlic at this point infuses the potatoes with it’s flavour. I always add garlic to boiled potatoes for extra flavour. Once boiling, reduce the heat and simmer until cooked. You should be able to put a knife through the spuds with ease.",
    "Meanwhile heat the oil in a pan and gently cook the onion and scallion until soft. Then add the kale, cover with a lid and simmer for about one minute. The kale should be a vibrant colour but not cooked through, you want to maintain its goodness and texture. Strain any liquid that may be in the pot.",
    "Once the potatoes are cooked strain any liquid that may be in the pot and reduce the heat to the lowest temperature. Using a masher proceed to mash the potatoes. Keeping them over a low heat ensures that any remaining moisture will evaporate. Once the potatoes are mashed to your liking add in the butter. Using a wooden spoon stir the mixture well making sure the butter is well mixed in and the texture is creamy with no lumps.",
    "Add the kale mix to the potatoes and stir well. Season with salt and pepper."
  ],
  "ingredients": [
    "0",
    "What you’ll need: (serves 8)",
    "250g of curly kale",
    "2kg potatoes peeled and washed",
    "1 bunch of scallions finely sliced",
    "1/2 white onion, peeled and finely chopped",
    "4 cloves of garlic, peeled and finely chopped",
    "3 tablespoons of oil",
    "50g Pure Dairy Free spread (a little more if you want an extra creamy texture)",
    "1/2 teaspoon salt (tastebud intuition, a little more or a little less to your taste)",
    "1/2 teaspoon black pepper (tastebud intuition again)"
  ],
  "__v": 1
}