{
  "hash": "a51e44af52eb249a28a785099c3f7557cc387d06",
  "title": "Mochi Ice Cream",
  "image": "",
  "href": "https://food52.com/recipes/61670-mochi-ice-cream",
  "extension": "Chrome",
  "firstAdded": "2019-08-15T21:38:08.747000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "First, you'll need to pre-scoop your ice cream and freeze the individual balls. I found it was easy to freeze them in a plastic wrap-lined egg carton, which cradles the mini scoops and gives you an idea of how big each should be. Take the ice cream out of the freezer to soften for a few minutes; meanwhile, line an egg carton with plastic wrap. Use a small scooper (I used a cookie scooper) to divide the ice cream among the divots. Send back into the freezer for a couple of hours or until rock-solid. (If you'll be freezing the ice cream scoops any longer, you'll want to go back in and wrap the whole carton in more plastic to ward off freezer burn.)",
    "When the ice cream balls are good and frozen, it's time to make mochi! In your microwave. Whisk the flour and sugar together in a microwave-safe bowl. Add the water and whisk to combine.",
    "Cover the bowl with plastic wrap and microwave for 1 minute. Use a wet rubber spatula to stir the mixture, then re-cover and microwave for 1 more minute. Stir again, cover, and microwave for 30 final seconds. The color should now be translucent.",
    "Lay down a piece of parchment on your work surface, then use a fine-mesh sieve or sifter to cover it with potato starch (or cornstarch, or additional rice flour). Transfer the mochi to the parchment, sift over more starch, and wait for it to cool down enough to handle.",
    "Use a rolling pin to roll the mochi out so that it's about 1/4-inch thick. Applying more starch as you need to. Transfer the parchment to a baking sheet and refrigerate for about 15 minutes, until firm and cool to the touch.",
    "Use a 3- or 3 1/2-inch cookie cutter to cut rings out of the mochi. (Err on the big side—it's better to have too-big circles than too-small ones.) You can mush the scraps back together and reroll to form additional circles, though they may be a bit tougher and therefore harder to work with later on. Dust the excess starch off the circles with a pastry brush, then stack them on a plate so that there is a layer of plastic wrap below each one.",
    "Now put on a pair of plastic gloves if you have them. Working preferably with one ice cream scoop at a time (and in close proximity to the freezer!) take a mochi circle, with the plastic wrap beneath it, place the ice cream on top, and move quickly to wrap and smoosh the mochi around it. Use the plastic wrap as a guide to tie everything together (I twist it very tightly at the seam to hold all the parts inside—almost like a harness!). Transfer the mochi ball to the freezer, then proceed until you've gone through all the ice cream. Freeze the balls for at least a couple of hours, until frozen solid. Before serving, let the mochi sit at room temperature for about 5 minutes, until the outer layer has returned to its soft, smooshy state."
  ],
  "ingredients": [
    "0",
    "1 pint",
    "ice cream",
    "3/4 cup",
    "sweet glutinous rice flour",
    "1/4 cup",
    "sugar",
    "3/4 cup",
    "water",
    "Potato starch, cornstarch, or additional rice flour, for dusting"
  ],
  "__v": 1
}