{
  "hash": "46c542d432c14d5a3b5ccfe8f1065bd59e79262a",
  "title": "Herbal Theory and Practice - Skin, herbs for bruises and some herbal terms",
  "image": "http://1.bp.blogspot.com/-WjUDLlljyJ4/VMUUSARjh2I/AAAAAAAAALQ/rWyWC6E9taE/s1600/Diagram-of-the-Human-Skin.jpg",
  "href": "http://wwootw.blogspot.co.uk/2015/01/herbal-theory-and-practice-skin-herbs.html",
  "firstAdded": "2015-01-26T17:27:07.793000",
  "users": [
    null
  ],
  "keywords": [
    "apprentice",
    "herbwife",
    "need",
    "learn",
    "theory",
    "human",
    "body",
    "conditions",
    "affect",
    "order",
    "understand",
    "use",
    "works",
    "month",
    "set",
    "task",
    "researching",
    "structure",
    "function",
    "skin",
    "form",
    "help",
    "bruises",
    "asked",
    "research",
    "meaning",
    "terms",
    "describing",
    "herbs",
    "herb",
    "uses",
    "actions",
    "largest",
    "organ",
    "known",
    "integumentary",
    "consists",
    "outer",
    "layer",
    "epidermis",
    "dermis",
    "contains",
    "structures",
    "capillary",
    "hair",
    "follicles",
    "sebaceous",
    "secrete",
    "protective",
    "oils",
    "sweat",
    "glands",
    "sensory",
    "nerve",
    "endings",
    "elastic",
    "fibres",
    "underlaid",
    "subcutaneous",
    "tissue",
    "fat",
    "blood",
    "vessels"
  ],
  "directions": [
    "0",
    "The skin has very important functions. It is a protective boundary to our bodies, providing mechanical protection from injury & chemicals, protection from damaging ultra-violet light and protection from external micro-organisms. It keeps essential water and nutrients inside. Small molecules can be absorbed through the skin and pass into the body. A way to demonstrate this is to rub a clove of garlic on the sole of your foot, half an hour later you can smell it on your breath. The skin is one of our main organs of elimination, this is a very important part of its function to herbalists. We regulate our temperature through blood vessels in the skin and through sweating. The skin is a huge sensory organ, with many receptors for touch and other kinds of physical stimulation, which is essential to our proper development and our well-being.",
    "Bruises & herbal remedies for bruises",
    "Bruises are purple marks under the skin caused by capillary haemorrhage from an external injury or from an internal cause such as steroid therapy or haemophilia. Surgery can cause extensive bruising. Bruises cause localised pain & swelling and can take up to 2 weeks to heal. Bruising can be very extensive and cause stiffness and pain in muscles and around joints. Older people can be particularly prone to bruising due to capillary fragility. Habitual bruising without injury can be a sign of a serious illness such as Leukaemia, so it is advisable to get a check-up by a doctor if this is the case. The herbal approach to bruising aims to promote regeneration of circulation and to remove damaged blood & tissue quickly.",
    "Elder bark bruise salve",
    "One of my tasks this month was to harvest some elder bark by cutting elder twigs and stripping off the bark to make a salve for bruises. The bark was used to make a double-infused oil by dividing the bark into 2 equally sized piles. The first pile was put in a saucepan and covered with sunflower oil and heated inside another pan with gently boiling water for 2 hours. The first lot of bark was strained out and the second lot of bark was put into the same oil to infuse for another 2 hours. The infused oil was then strained through a sieve lined with a piece of muslin and then added back to the pan with beeswax (1/8 beeswax to oil eg 25g beeswax to 200ml oil), until the beeswax all melted. The oil was then poured into small jars, when cool it solidified into a salve to apply externally to bruises. This is not a traditional use of elder bark, although there are references to using elder leaves for bruises. Using elder bark was suggested by my herbal mentor Sarah Head. My husband Barry bruised his hand recently, the bruise disappeared within 2 days so it definitely works."
  ],
  "ingredients": [
    "0",
    "As an apprentice herbwife I need to learn theory about the human body, conditions which affect it and the actions of herbs in order to understand what to use and why it works. This month I have been set the task of researching the structure and function of skin, how bruises form and herbs that can help bruises. I was also asked to research the meaning of some terms describing the actions of herbs and a herb that uses these actions.",
    "The skin",
    "The skin is the largest organ of the human body, it is also known as the integumentary system. The skin consists of the outer layer the Epidermis; the Dermis which contains structures such as capillary blood vessels, hair follicles, sebaceous glands which secrete protective oils, sweat glands, sensory nerve endings and elastic fibres; this is underlaid by Subcutaneous tissue including fat and blood vessels."
  ],
  "__v": 1
}