{
  "hash": "2d93cbb6ec9dd9d3e8bdd8d8b3d4eeccf29e9adc",
  "title": "Gluten Free and Dairy Free Oatmeal Chocolate Chip Cookies",
  "image": "https://www.nobiggie.net/wp-content/uploads/2014/09/Gluten-Free-and-Dairy-Free-Oatmeal-Chocolate-Chip-Cookie-recipe-NoBiggie.net-so-soft-and-chewy.jpg",
  "href": "https://www.nobiggie.net/gluten-free-and-dairy-free-oatmeal-chocolate-chip-cookies/",
  "extension": "Chrome",
  "firstAdded": "2018-02-07T22:19:43.134000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 degrees. Mix all wet ingredients together: palm shortening, coconut palm sugar, honey, lemon juice, vanilla, and eggs, adding the eggs in at the end one at a time. Mix well in your mixer. In a different bowl combine all the dry ingredients together with a whisk: GF flour, fine ground GF oats, baking soda, cinnamon and sea salt. Stop your mixer and dump in all the dry ingredients. Mix well, but don't over mix. Add in the mini chocolate chips and run your mixer on low a few times to mix them into the cookie dough.",
    "Using a uniform ice cream scooper, place cookie dough scoops onto a parchment lined or silpat lined cookie sheet pan. Bake for 10 - 13 minutes until the cookies start to look golden brown. Pull out of the oven and cover with a clean hand towel and let the cookies continue to sit on the hot pan for another 10 minutes or so. This recipe makes 12 to 14 cookies (depending on size)."
  ],
  "ingredients": [
    "0",
    "(wet ingredients)",
    "½ Cup palm shortening",
    "½ Cup Coconut Palm Sugar (blonde) - this gives it a brown sugar taste",
    "3 Tbs. honey",
    "3 eggs, room temperature",
    "2 tsp. lemon juice, freshly squeezed",
    "2 tsp. vanilla",
    "(dry ingredients)",
    "1 Cup gluten free flour blend (I used Namaste brand)",
    "1¼ cup gluten free oats, ground fine in a food processor",
    "1 tsp. baking soda",
    "½ tsp. cinnamon",
    "½ tsp. sea salt",
    "½ cup Enjoy Life mini chocolate chips"
  ],
  "__v": 1
}