{
  "hash": "96843f0e9b876d4bed9f90fc0dc2bd2fd564f387",
  "title": "Dark Chocolate Peppermint Truffles",
  "image": "https://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2015/11/dark-chocolate-peppermint-truffles-5.jpg",
  "href": "https://sallysbakingaddiction.com/2015/11/29/dark-chocolate-peppermint-truffles/",
  "extension": "Chrome",
  "firstAdded": "2018-10-01T22:20:40.740000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place semi-sweet chocolate in a large heatproof bowl. Microwave in four fifteen second increments, stirring after each, for a total of 60 seconds. Stir until almost completely melted. Set aside. Why are you doing this? I like to briefly warm the chocolate before it is mixed with the cream to help initiate the melting and mixing process.",
    "Pour cream into a small saucepan over medium heat. Whisking occasionally, heat until it just begins to boil. Remove from the heat, then whisk in the vanilla and peppermint extracts. Pour over the chocolate. Gently begin stirring with a wooden spoon in one directions. Do not forcefully stir, always be gentle! Once the chocolate and cream are smooth, stir in the butter until combined and melted. Cover with plastic wrap pressed on the top of the mixture then allow to sit at room temperature for 30 minutes. After 30 minutes, place in the refrigerator until it reaches \"scoopable\" consistency, about 5 hours.",
    "Line a lage baking sheet with parchment paper or a silicone baking mat. Set aside.",
    "Remove mixture from the refrigerator. Measure 1 teaspoon, roll mixture in your hands into a ball as best as you can, then place on the baking sheet. The mixture might be a little sticky. Coat your palms with a little cocoa powder, which I find helps you handle the mixture. Repeat rolling the rest of the mixture. (A rolling tip: If you can't roll into perfect balls, do the best you can and place on the baking sheet. The air will help \"dry out\" the truffles. After 15 minutes, you'll be able to roll them into neater balls.)",
    "Roll each ball into cocoa powder to coat. Serve immediately or cover at room temperature for up to 1 week to serve at a later time. You can refrigerate the truffles, but I prefer serving and eating them at room temperature. So, allow to come to room temperature before serving if you prefer.",
    "Make ahead tip: Layer truffles in a tupperware between parchment paper and store at room temperature or in the refrigerator for up to 1 week. Freeze for up to 2 months, then thaw overnight in the refrigerator."
  ],
  "ingredients": [
    "0",
    "14 ounces (397g) semi-sweet chocolate, coarsely chopped1",
    "3/4 cup (180ml) heavy cream, heavy whipping cream, or double cream (not milk or half-and-half)",
    "1/2 teaspoon pure vanilla extract",
    "1 and 1/2 teaspoons peppermint extract",
    "2 Tablespoons (30g) unsalted butter, softened to room temperature",
    "3/4 cup (65g) natural unsweetened or Dutch-process cocoa powder"
  ],
  "__v": 1
}