{
  "hash": "1430c99d67e10aa9da1af0ef90b238c717f19e71",
  "title": "Naturally-Dyed Red Velvet Cake with Cream Cheese Frosting",
  "image": "//images.food52.com/wlmZd_cjK6mbe_klVm7ODtlNF-Y=/fit-in/800x0/9c9bdc15-b65a-4904-9891-9cb2fc4e896c--red_velvet_cake-0717.jpg",
  "href": "http://food52.com/blog/15776-an-all-natural-red-velvet-cake-that-s-truly-red?utm_source=Facebook&utm_medium=SocialMarketing&utm_campaign=Social",
  "extension": "Chrome",
  "firstAdded": "2016-02-09T11:10:31.036000",
  "users": [
    null
  ],
  "keywords": [
    "cake",
    "beet",
    "red",
    "beets",
    "buttermilk",
    "white",
    "wine",
    "vinegar",
    "lemon",
    "juice",
    "vanilla",
    "flour",
    "cocoa",
    "dutchprocess",
    "baking",
    "cream",
    "tartar",
    "salt",
    "neutralflavored",
    "oil",
    "unsalted",
    "butter",
    "softened",
    "granulated",
    "sugar",
    "eggs",
    "cheese",
    "frosting",
    "room",
    "crme",
    "frache",
    "confectioners",
    "zest"
  ],
  "directions": [
    "0",
    "To make the cake, preheat oven to 350º F and position a rack in the center of the oven. Butter two 8-inch cake pans and line them with parchment paper. Butter the paper too, then dust the pans with flour.",
    "Photo by Yossy Arefi",
    "Add the beet purée, buttermilk, vinegar, lemon juice, and vanilla extract to a food processor fitted with the steel blade and process until very smooth.",
    "Sift the cake flour, cocoa powder, baking powder, cream of tartar, and salt together in a bowl. Beat the sugar, oil, and butter together in a large bowl until creamy, then add the eggs one at a time, mixing for 30 seconds after each addition.",
    "Alternate adding the flour mixture and beet mixture to bowl, beginning and ending with the flour mixture. Divide between the prepared pans and bake until a cake tester inserted into the center of the cake comes out clean, 20 to 30 minutes.",
    "Cool the cakes on a rack for 20 minutes then invert onto the rack to cool completely.",
    "Photos by Yossy Arefi",
    "To make the frosting, beat the butter and cream cheese together on high speed until fluffy and smooth, then add the crème fraîche. Turn the mixer to low and gradually add the confectioners' sugar until just combined, then turn the mixer up to medium-high and beat until fluffy and smooth, making sure to stop the mixer and scrape down to the bottom of the bowl so everything is evenly mixed. Add the lemon zest, vanilla extract, and salt.",
    "Photo by Yossy Arefi",
    "To assemble the cake, trim the tops of the cake layers so they are flat, if necessary. Place one layer on a serving plate or pedestal and spread about 1 cup of frosting on top. Top with the second cake layer, then smooth a thin coat of frosting on the outside of the cake.",
    "Photos by Yossy Arefi",
    "Chill for at least 30 minutes, then cover the cake with a second, heavier coat of frosting to finish."
  ],
  "ingredients": [
    "0",
    "For the cake:",
    "1\tcup beet purée, from fresh red beets (not cooked)",
    "3/4\tcup buttermilk",
    "1\ttablespoon white wine vinegar",
    "2\ttablespoons lemon juice",
    "1\ttablespoon vanilla extract",
    "2 1/2\tcups cake flour",
    "3\ttablespoons cocoa powder, not Dutch-process",
    "2\tteaspoons baking powder",
    "1\tteaspoon cream of tartar",
    "1\tteaspoon salt",
    "1/2\tcup neutral-flavored oil",
    "1/2\tcup unsalted butter, softened",
    "2\tcups granulated sugar",
    "3\tlarge eggs",
    "For the cream cheese frosting:",
    "8\tounces cream cheese, at room temperature",
    "8\tounces unsalted butter",
    "2\ttablespoons crème fraîche",
    "1\tpound confectioners' sugar",
    "1/2\tteaspoon lemon zest",
    "1\tteaspoon vanilla extract",
    "1\tpinch salt"
  ],
  "__v": 1
}