{
  "hash": "5edb9fe1e47cc3800c60c90653f7e053c1aadf72",
  "title": "Easy Chocolate Frosting",
  "image": "http://s3.amazonaws.com/yummy_uploads2/blog/4894.jpg",
  "href": "http://www.theyummylife.com/Chocolate_Frosting",
  "extension": "Chrome",
  "firstAdded": "2015-04-09T03:29:56.430000",
  "users": [
    null
  ],
  "keywords": [
    "semisweet",
    "bittersweet",
    "chocolate",
    "chips",
    "canned",
    "evaporated",
    "almond",
    "milk",
    "desired",
    "butter",
    "coconut",
    "canola",
    "oil",
    "vanilla",
    "sugar",
    "directions"
  ],
  "directions": [
    "0",
    "Directions",
    "Combine chocolate chips, evaporated milk, butter and vanilla in microwave-proof bowl. Microwave on full power for 30-40 seconds. Remove and whisk until chocolate chips melt in and mixture is smooth (return to microwave for a few seconds if necessary). Add powdered sugar and continue whisking until smooth.",
    "SPREAD WHILE IT'S WARM. It goes on more smoothly and easily that way. If it cools off and thickens too much before you're ready to use it, just zap it for a few second in the microwave, stir, and spread.",
    "DOUBLE IT. Recipe makes enough for a thin layer of frosting on a 9x13 cake or pan of brownies. Recipe may be doubled, if a thicker frosting layer is desired.",
    "STOVE TOP METHOD. You may also heat the ingredients (everything except the powdered sugar) over the lowest heat in a pot on top of the stove. Stir constantly until everything melts together and the consistency is smooth. Remove from heat and whisk in the powdered sugar until smooth.",
    "MORE FLAVORS. This same method can be used to create other frosting flavors. Simply swap out the chocolate chips for other flavors of baking chips. White chips for a vanilla frosting. Peanut butter chips for a peanut butter frosting. Butterscotch chips for a butterscotch frosting. Etc. You can also stir in cinnamon or other sweet spices, substitute other extracts for the vanilla, or add maple syrup or molasses."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 cup semisweet or bittersweet chocolate chips",
    "1/4 cup canned evaporated milk (may substitute almond milk, if desired)",
    "2 tablespoons butter (may substitute coconut, canola or vegetable oil, if desired)",
    "1/2 teaspoon vanilla extract",
    "1 cup powdered sugar",
    "Directions"
  ],
  "__v": 1
}