{
  "hash": "cf5fbfd1631752bcafc752ff03bb7086d59efe9c",
  "title": "Thai Curry Chicken Meatballs (GF, DF, P, Whole30)",
  "image": "http://www.onelovelylife.com/wp-content/uploads/2015/01/pumpkin-meatball-curry1.jpg",
  "href": "http://www.onelovelylife.com/thai-curry-chicken-meatballs/",
  "extension": "Chrome",
  "firstAdded": "2017-01-03T03:03:26.329000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large bowl, blend ground chicken breast, zucchini, cilantro, ginger, and salt. Toss with a fork until just mixed in (it'll probably feel like you have too much zucchini at first. Don't worry! Just keep going.)",
    "Using a small scoop or a heaped tablespoon, scoop out meatballs onto a baking sheet lined with foil and greased with a bit of coconut oil. (Depending on the size of your meatballs, you'll end up with about 24-28 meatballs).",
    "Bake at 400 degrees for 12-15 minutes, or until they're cooked through. If desired, broil an additional 1-2 minutes for browning.",
    "1",
    "While the meatballs are baking, Whisk together coconut milk, pumpkin puree, cashew butter, chili sauce (or oil), curry paste, ginger, and tamari in a large sauté pan over medium-low heat until smooth and heated through. Taste and add additional curry paste, chili sauce (for more kick), or tamari as desired. Stir in cilantro. Add water as needed to thin out the sauce.",
    "When the meatballs are cooked through, add them to the sauce and stir to coat well."
  ],
  "ingredients": [
    "0",
    "1 lb. ground chicken breast* (or, see note below)",
    "1½- 2 cups shredded zucchini, patted dry with paper towels",
    "2 Tbsp cilantro, minced",
    "1-2 tsp fresh ginger, minced",
    "½ tsp salt",
    "coconut oil for greasing baking sheet",
    "1",
    "1 (14oz) can coconut milk",
    "1 cup pumpkin puree",
    "¼ cup cashew butter (sunflower seed butter or peanut butter will also work)",
    "2-3 Tbsp Thai sweet chili sauce (use 2 tsp chile oil for Paleo/Whole30)",
    "1-2 Tablespoons red curry paste",
    "2 tsp fresh ginger",
    "2 tsp gluten free tamari (use coconut aminos for Paleo/Whole30, or you can use soy sauce)",
    "¼ cup cilantro, minced",
    "juice of 1 lime",
    "½-3/4c water (as needed)"
  ],
  "__v": 1
}