{
  "hash": "0dde51cb4763ec632dd9c6097f5acbda912991e8",
  "title": "By Candace Derickx 8 COMMENTS SKILLET BANANA BREAD I love my cast-iron skillets. They are my most favorite thing in my kitchen. I love how they cook everything so even and retain heat. They move from stove-top to oven and back again with ease, and they are super easy to maintain. Also, no scary chemicals like in many of the non-stick pans on the market. Finally, using a cast iron pan actually adds iron into your diet! How cool is that? Hands down Lodge is the best and I recommend you buy the one that is already seasoned for you. Refer to their website for use & care. I’ve decided to devote a whole category to cast-iron skillet cooking. You can find the first recipe here. Skillet Banana Bread",
  "image": "https://i2.wp.com/www.lifeinpleasantville.com/wp-content/uploads/2012/03/skillet-banana-bread1-e1332791621820.jpg?resize=600%2C450",
  "href": "http://www.lifeinpleasantville.com/skillet-banana-bread/",
  "extension": "Chrome",
  "firstAdded": "2017-09-21T23:24:02.073000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350F. Using an electric mixer on medium-high, beat the butter and sugars in a large bowl until smooth and creamy. Beat in the eggs, one at a time, then beat in the bananas and vanilla. In a separate bowl, mix together the flour, baking soda, salt, cinnamon, cardamom, and allspice. Add the flour mixture to the banana mixture and fold in with a spatula until well blended. Gently fold the nuts and sour cream into the batter until just blended, being careful not overmix.",
    "Lightly butter a 10 or 12 inch cast iron skillet. Pour the batter into the skillet; place in the oven and bake until a toothpick inserted in the centre comes out clean, 45 minutes to 1 hour. Remove from the oven and let cool in the pan. To serve, flip the bread out of the pan or serve it from the skillet, sliced into wedges."
  ],
  "ingredients": [
    "0",
    "By Candace Derickx 8 COMMENTS",
    "SKILLET BANANA BREAD",
    "I love my cast-iron skillets. They are my most favorite thing in my kitchen. I love how they cook everything so even and retain heat. They move from stove-top to oven and back again with ease, and they are super easy to maintain. Also, no scary chemicals like in many of the non-stick pans on the market. Finally, using a cast iron pan actually adds iron into your diet! How cool is that? Hands down Lodge is the best and I recommend you buy the one that is already seasoned for you. Refer to their website for use & care. I’ve decided to devote a whole category to cast-iron skillet cooking. You can find the first recipe here.",
    "Skillet Banana Bread",
    "1/2 cup (1 stick) unsalted butter, room temp",
    "1/2 cup granulated sugar",
    "1/2 cup light brown sugar",
    "2 eggs",
    "3 very ripe bananas, mashed",
    "1/2 tsp vanilla extract",
    "2 cups all-purpose flour",
    "1 tsp baking soda",
    "1/4 tsp salt",
    "1/2 tsp ground cinnamon",
    "1/2 tsp ground cardamom",
    "Pinch ground allspice",
    "1/4 to 1/2 cup chopped pecans or walnut (depends how nutty you like it)",
    "1/4 cup sour cream"
  ],
  "__v": 1
}