{
  "hash": "bdf2dac94a3d5c6f70d791afe2ea2ee7cf44a088",
  "title": "The Ultimate Mexican Nacho Burger",
  "image": "http://www.veggiesdontbite.com/wp-content/uploads/2015/08/mexican-nacho-veggie-bean-burger-109-Edit.jpg",
  "href": "http://www.veggiesdontbite.com/2015/09/03/the-ultimate-mexican-nacho-burger/",
  "extension": "",
  "firstAdded": "2015-11-12T15:59:39.569000",
  "users": [
    null
  ],
  "keywords": [
    "brown",
    "rice",
    "black",
    "beans",
    "rinsed",
    "pinto",
    "tomatoes",
    "onion",
    "cilantro",
    "mild",
    "nacho",
    "jalapeno",
    "slices",
    "cornmeal",
    "himalayan",
    "pink",
    "salt",
    "used",
    "gluten",
    "free",
    "sprouted",
    "wheat",
    "burger",
    "buns",
    "toppings",
    "ultimate",
    "cheese",
    "guacamole",
    "easy",
    "mexican",
    "salsa",
    "vegan",
    "sour",
    "cream",
    "tortilla",
    "chips",
    "lettuce"
  ],
  "directions": [
    "0",
    "Preheat oven to 375.",
    "Chop tomatoes, onion, cilantro and jalapeno slices if haven’t already. Cook rice according to package directions or use a precooked version.",
    "Rinse beans and place into a large bowl with the rest of the ingredients except the cornmeal. Using your hands, mix well by squishing everything together.",
    "Add cornmeal and combine again with your hands.",
    "Taste and add salt if needed. Combine more.",
    "Set mixture in the refrigerator for at least 30 minutes to an hour, the longer the better. This will allow the cornmeal to suck up the liquid and will make the mixture sturdier so you can grill if preferred.",
    "Meanwhile, make toppings of choice if not prepped already.",
    "Once mixture is ready, shape into 4 inch patties.",
    "Bake at 375 on a parchment lined cookie sheet for 15-20 minutes on each side, or until just browned. Remove from oven and allow to cool and set in for about 5-7 minutes.",
    "You can also cook on stove top over medium heat for 6-8 minutes on each side (depending on stove). Make sure to keep pan covered to help the burger cook throughout and achieve the best texture possible. This helps prevent a mushy burger. Check every few minutes to prevent burning, should be slightly browned when ready.",
    "These are also grillable. If you grill these on the BBQ make sure to grill cold, right from the fridge. Grill on low heat until browned on each side. Carefully flip, if they don’t flip easily allow to cook longer.",
    "Top with lettuce, guacamole, salsa, sour cream, jalapeno slices and chips and smother with cheese sauce.",
    "Stuff into your mouth, the messier you get the better."
  ],
  "ingredients": [
    "0",
    "• 2 cups cooked brown rice",
    "• 1 can (15 ounces) black beans, rinsed",
    "• 1 can (15 ounces) pinto beans, rinsed",
    "• ½ cup chopped tomatoes (about 1 three inch tomatoes)",
    "• ½ cup chopped onion (about ½ a three inch onion)",
    "• ½ cup chopped cilantro",
    "• ½ cup chopped mild nacho jalapeno slices",
    "• 3 tablespoons cornmeal",
    "• Himalayan pink salt to taste (I used 1 teaspoon)",
    "• Gluten free or sprouted wheat burger buns",
    "Toppings:",
    "• Ultimate Cheese Sauce",
    "• Guacamole",
    "• Easy Fresh Mexican Salsa",
    "• Vegan sour cream",
    "• Jalapeno nacho slices",
    "• Tortilla chips",
    "• Lettuce"
  ],
  "__v": 1
}