{
  "__v": 1,
  "directions": [
    "0",
    "Preriscalda il forno a 180°C.",
    "Lava la buccia della zucca sotto l'acqua corrente per rimuovere qualsiasi traccia di terra, poi togli i semi e affettala in spicchi spessi circa 2 cm.",
    "Fodera una teglia con la carta da forno e spennellala con un po' di olio extravergine di oliva.",
    "Adagia le fette di zucca di lato sulla taglia e condiscile con un pizzicotto di sale grosso, del pepe nero macinato sul momento e un filo d'olio extravergine di oliva.",
    "Cuoci la zucca in forno caldo per almeno 30 minuti, finché non diventa dorata e quasi caramellata sui bordi. La polpa e la buccia devono essere morbide.",
    "Fondi i formaggi con burro e latte in un pentolino a fuoco molto basso, mescolando continuamente con una frusta, poi aggiungi la polpa di ⅔ della zucca, senza buccia e schiacciata con una forchetta. Mescola fino a che non ottieni una crema omogenea e arancio tenue.",
    "Cuoci la pasta al dente, scolala e mettila in una pirofila da forno o in tante monoporzioni in ghisa, coprendola con la crema di formaggi alla zucca. Taglia a cubetti la zucca rimasta e uniscila alla pasta, mescolando bene per amalgamare il condimento. Spolvera di pangrattato e passa la pasta in forno caldo per 5 - 10 minuti con funziona grill finché non è ben dorata in superficie e ancora cremosa e morbida sotto.",
    "Servi immediatamente portando direttamente in tavola le cocottine in ghisa, che manterranno la pasta calda e fumante più a lungo."
  ],
  "firstAdded": "2014-10-10T12:07:20.842000",
  "hash": "6608db4c85cd2f0341bf97e5a402addc74449289",
  "href": "http://it.julskitchen.com/vegetariane/pasta-ai-quattro-formaggi-autunnale-con-la-zucca",
  "image": "http://farm7.static.flickr.com/6226/6302630273_ea9caeb0f8_b.jpg",
  "ingredients": [
    "0",
    "500 g di zucca mantovana, senza semi e tagliata a fette, con la buccia",
    "sale grosso",
    "pepe nero macinato fresco",
    "olio extravergine di oliva",
    "1 noce di burro",
    "50 ml di latte",
    "80 g di Asiago",
    "1 cucchiaio di pecorino romano grattato",
    "1 cucchiaio di parmigiano reggiano grattato",
    "2 cucchiai di Blue Stilton (o qualsiasi formaggio blu, come il gorgonzola)",
    "350 g di maccheroni",
    "pan grattato"
  ],
  "keywords": [
    "zucca",
    "mantovana",
    "senza",
    "semi",
    "tagliata",
    "fette",
    "buccia",
    "sale",
    "grosso",
    "pepe",
    "nero",
    "macinato",
    "fresco",
    "olio",
    "extravergine",
    "oliva",
    "noce",
    "burro",
    "latte",
    "asiago",
    "cucchiaio",
    "pecorino",
    "romano",
    "grattato",
    "parmigiano",
    "reggiano",
    "cucchiai",
    "blue",
    "stilton",
    "qualsiasi",
    "formaggio",
    "blu",
    "come",
    "gorgonzola",
    "maccheroni",
    "pan"
  ],
  "title": "Mac&Cheese autunnali con la zucca",
  "users": [
    null
  ]
}