{
  "hash": "6da520edc54f18223bac0bc6a173cd103a0d1c55",
  "title": "EricaEBWalkerKaren SandsEricaChristopher MusantéLaurie Mom of 3AngieSarahWendeCulinary Adventures in the KitchenKalliJamieviciouslynomaliciousviciouslynomaliciousKarenC. JaneSarahSherry YMichelle S.JoeJillStephenJackie SeweSusan ProbstAlicialoraEricaMichellejenniferReginatazYasha beagleyMichelleEricaCourtneyLauraAmandaKerryEricaJessicaDOREENEricaMelissaSandiCiaraMelissaVivi RoEchoJane",
  "image": "http://www.favfamilyrecipes.com/wp-content/uploads/2013/06/mongolian-beef.jpg",
  "href": "http://www.favfamilyrecipes.com/mongolian-beef.html",
  "extension": "Chrome",
  "firstAdded": "2015-04-08T21:15:51.463000",
  "users": [
    null
  ],
  "keywords": [
    "oil",
    "ginger",
    "garlic",
    "soy",
    "water",
    "brown",
    "sugar",
    "flank",
    "steaks",
    "cornstarch",
    "green",
    "onions"
  ],
  "directions": [
    "0",
    "Make the sauce by heating 4 tsp. vegetable oil in a medium saucepan over medium/low heat. Don’t get the oil too hot. Add ginger and garlic to the pan and quickly add the soy sauce and water before the garlic scorches. Dissolve the brown sugar in the sauce, then raise the heat to medium and boil the sauce 2-3 minutes or until sauce thickens a little bit. Remove sauce from heat.",
    "Slice the flank steak against the grain into ¼ inch slices. Tilt the blade of your knife at about a 45 degree angle to the top of the steak so you get wider cuts. Dip the steak pieces into cornstarch to apply a very thin dusting to both sides of each piece of beef. Let the beef sit about 10 min. so the cornstarch sticks. As the beef sits, heat up 1 c. oil in a wok (or skillet). Heat the oil over medium heat until its hot, but not smoking. Add the beef to the oil and saute for just 2 minutes, or until beef just begins to darken on the edges. Stir the meat around a little bit so that it cooks evenly.",
    "After a few minutes, use a large slotted spoon to take the meat out and onto paper towels, then pour most of the oil out of the skillet. Put the pan back over the heat, dump the meat back into it and stir-fry for 1 minute. Add the sauce, cook for 1 minute while stirring and add green onions. Cook for 1 more minute. Now at this point you can either remove the beef with a slotted spoon or tongs and discard the sauce (this is what P.F. Chang's does) OR thicken the sauce with a cornstarch-water mixture to desired thickness and serve it over rice with the beef."
  ],
  "ingredients": [
    "0",
    "4 tsp. vegetable oil",
    "2 tsp. ginger, minced",
    "2 Tbsp. garlic, minced",
    "1 c. soy sauce",
    "1 c. water",
    "1 c. brown sugar (packed)",
    "2 c. vegetable oil",
    "2 Lb. flank steaks",
    "½ c. cornstarch",
    "3 large green onions"
  ],
  "__v": 1
}