{
  "__v": 1,
  "directions": [
    "0",
    "Step 1:",
    "In a stand mixer fitted with the paddle attachment, or in a large bowl, cream the butter and cream cheese until smooth. Add the salt and vanilla, stirring to combine.",
    "Step 2:",
    "Now, add the confectioners’ sugar, one cup at a time. It may seem like a lot, but all the sugar will eventually incorporate, turning the mixture into a thick, sticky dough. Stir in the coconut until evenly distributed. Place the dough in the refrigerator and cover for at least 30 minutes, to make the mixture firm.",
    "Step 3:",
    "Remove the dough from the refrigerator and shape the dough into small balls, about 1 inch in diameter, and then lightly press them here and there to make them lopsided and somewhat, well, potato-like.",
    "Step 4:",
    "Place the finished white “potatoes” on a baking sheet. If you’d like a break, keep them in the refrigerator for the next few minutes; the confections will begin to soften quickly and won’t roll as well in the coating mixture if you leave them out too long.",
    "Step 5:",
    "In a shallow bowl, place cinnamon, cinnamon sugar or cocoa. Roll the potatoes in the mixture to coat all over. Tap off any excess.",
    "Step 6:",
    "Place the candies back on the baking sheet and refrigerate for 30 minutes to allow them to “set” completely. After this, they can be kept in the refrigerator or at cool room temperature. Seal in an airtight container for up to 3 weeks."
  ],
  "firstAdded": "2014-03-11T04:00:28.996000",
  "hash": "2cfe430f419eac1607019869bc7d8f7b6740af3f",
  "href": "http://www.craftsy.com/blog/2014/03/how-to-make-irish-potato-candy/?ext=FB_CulC_PP_E_blog_20140309&utm_source=Page%20Post-Culinary%20Club&utm_medium=Engagement&utm_campaign=Facebook&initialPage=true",
  "image": "http://cdn3.craftsy.com/blog/wp-content/uploads/2014/02/potatocandy6.jpg",
  "ingredients": [
    "0",
    "Ingredients:",
    "1/4 cup (1/2 stick) unsalted butter, softened to cool room temperature",
    "4 ounces (half of an 8-ounce brick) cream cheese, softened to cool room temperature",
    "1/2 teaspoon salt",
    "1 teaspoon vanilla extract",
    "4 cups confectioners’ sugar, sifted",
    "2 1/2 cups sweetened coconut flakes",
    "cinnamon, or sifted cocoa, for coating"
  ],
  "keywords": [
    "unsalted",
    "butter",
    "softened",
    "cool",
    "room",
    "brick",
    "cream",
    "cheese",
    "salt",
    "vanilla",
    "confectioners",
    "sugar",
    "sifted",
    "sweetened",
    "coconut",
    "cinnamon",
    "cocoa",
    "coating"
  ],
  "title": "Irish potato candy",
  "users": [
    null
  ]
}