{
  "hash": "93499ddb70a1ac127919937bf681c733b0556094",
  "title": "Thai chicken and mushroom filo pie",
  "image": "http://recipe-folder.com/img/recipe-images/079/593/1000853679.jpg",
  "href": "https://www.bhg.com.au/thai-chicken-and-mushroom-filo-pie",
  "extension": "Chrome",
  "firstAdded": "2019-04-08T04:04:32.149000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 180°C. Prick skins of sweet potatoes with a fork. Roast on an oven tray for 45 minutes. When cool enough to handle, peel and dice flesh. Set aside.",
    "Meanwhile, put stock in a large saucepan over a high heat. Bring to the boil then reduce to a simmer. Add chicken; poach for 5 minutes. Add mushrooms for 30 seconds then remove chicken and mushrooms with a slotted spoon and set aside in a bowl. Reserve stock. When chicken is cool enough to handle, shred. Set aside.",
    "Heat oil in large wide frying pan over a low-medium heat. Add 80g of the butter. Add tom yum paste and flour, whisking continuously until bubbling and smooth. Pour in the reserved warm stock, stirring until combined and smooth. Add coconut cream, lime leaves, green shallots, peas, zest, juice and fish sauce or salt. Cook for 3–5 minutes. Add chicken, mushrooms, sweet potato, chilli and fried shallots. The consistency should be thick. If still runny, cook for a few extra minutes to reduce. Set aside.",
    "Melt the remaining butter and grease 8 mini pie tins. Lay 1 sheet of filo on a clean surface and brush with melted butter. Repeat with 5 additional pastry sheets, brushing each layer. Lay pastry in tin, letting the excess hang over. Repeat for remaining tins. Fill each pastry case with chicken mixture then fold overhanging pastry inwards. Brush tops with the remaining butter and sprinkle over sesame seeds.",
    "Bake in oven for 20 minutes or until golden on top. Serve."
  ],
  "ingredients": [
    "0",
    "500g sweet potatoes",
    "500ml chicken stock",
    "800g skinless chicken thigh fillets, cut into 2cm cubes",
    "250g button or oyster mushrooms, sliced",
    "100g enoki mushrooms, trimmed (optional)",
    "2 Tbsp peanut oil",
    "140g butter",
    "3 Tbsp tom yum paste*",
    "100g plain flour",
    "400ml can coconut cream",
    "3 kafir lime leaves, shredded",
    "5 green shallots, sliced",
    "1⁄2 cup frozen peas",
    "Finely grated zest and juice of 1 lime"
  ],
  "__v": 1
}