{
  "hash": "7d57ed6cb1ca00e7d31dc98691f38d9c676d5f29",
  "title": "Quinoa Harvest Bowl",
  "image": "",
  "href": "http://katu.com/amnw/am-northwest-cooking-recipes/quinoa-harvest-bowl",
  "extension": "Chrome",
  "firstAdded": "2017-11-11T05:24:25.657000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 400-degrees F.",
    "Wash, peel and chop sweet potatoes and golden beets. Arrange on a baking sheet. Drizzle and toss in 1-2 tbsp. extra virgin olive oil until everything is coated. Place vegetables in oven for 35-40 minutes, or until thoroughly cooked and tender. When finished, remove from oven and set aside.",
    "Prepare quinoa as described on package. (Typically, this means boiling water or vegetable broth, adding quinoa, reducing heat, and stirring frequently for about 30 minutes—or until liquid is absorbed.) When quinoa is cooked, fluff it, remove from heat, and set aside.",
    "Prepare balsamic glaze by combining balsamic glaze ingredients in blender. Blend until everything is well-incorporated and becomes a lighter brown color (1-2 minutes).",
    "Toast pecans by placing pecans on an unprepared frying pan. Turn the stovetop to ‘low-medium’ heat. Turn pecans frequently for 3-4 minutes, or until pecans begin to toast. Remove from heat immediately and set aside.",
    "Chop or rip rinsed kale into small pieces and set aside.",
    "To assemble the dish, combine quinoa, sweet potatoes, beets, dried cranberries, pecans, and kale. Drizzle with balsamic glaze just before serving. Top with feta (optional) or enjoy as is!"
  ],
  "ingredients": [
    "0",
    "What you’ll need:",
    "2 cups rainbow quinoa (measure when dry)",
    "1 cup dried cranberries",
    "3 sweet potatoes, peeled and chopped into ½-inch chunks",
    "6 golden beets, peeled and chopped into ¼-inch chunks",
    "¾ cup toasted pecans",
    "1 cup chopped kale—or other dark, leafy green",
    "1-2 tbsp. extra virgin olive oil (or enough to coat*)",
    "Optional: ½ cup feta",
    "For the balsamic glaze:",
    "3 tablespoons balsamic vinegar",
    "1 tablespoon Dijon mustard",
    "2 garlic cloves, minced",
    "1/2 cup olive oil",
    "Salt to taste"
  ],
  "__v": 1
}