{
  "hash": "c2e7db65412b34e48fb102d61893e76e22c11966",
  "title": "Peanut Butter Cup Cake",
  "image": "http://cf.chocolatechocolateandmore.com/wp-content/plugins/simple-share-buttons-adder/buttons/plain/facebook.png",
  "href": "http://chocolatechocolateandmore.com/peanut-butter-cup-cake/",
  "extension": "Chrome",
  "firstAdded": "2015-08-21T21:57:21.415000",
  "users": [
    null
  ],
  "keywords": [
    "devils",
    "food",
    "listed",
    "box",
    "make",
    "cake",
    "instant",
    "coffee",
    "granules",
    "butter",
    "softened",
    "creamy",
    "peanut",
    "vanilla",
    "sugar",
    "cream",
    "milk",
    "semisweet",
    "chocolate",
    "chips",
    "whipping"
  ],
  "directions": [
    "0",
    "Prepare cake according to package directions adding 1 teaspoon of instant coffee granules (dry) to the batter. Bake as directed for a 2 layer cake. Let cool completely.",
    "Cream together butter and peanut butter until smooth. Add vanilla. Add powdered sugar one cup at a time until all incorporated and smooth (will be thick)",
    "Add in cream, a few tablespoons at a time, mixing well after each addition until desired consistency is reached. Filling will be stiff but smooth.",
    "Divide filling in half and spread (press) filling onto top of each layer, just to the edge of each layer.",
    "Place chocolate chips in a heat proof bowl. Set aside. Heat cream either in the microwave for about 1 minute or on the stove until hot but not boiling. Pour heated cream over chocolate chips and let sit for 2 minutes. Stir until chips are completely melted and chocolate is smooth.",
    "Place one filling topped layer on cake plate and use half of the ganache, spreading evenly over top of filling. Place second layer on top and repeat with remaining ganache. Let ganache set before slicing cake."
  ],
  "ingredients": [
    "0",
    "1 box devil's food cake mix (plus ingredients listed on box to make cake)",
    "1 teaspoon instant coffee granules",
    "1/2 cup butter, softened",
    "1 cup creamy peanut butter",
    "1 teaspoon vanilla extract",
    "5 cups powdered sugar",
    "1/2 cup cream or milk",
    "1 cup semi-sweet chocolate chips",
    "1/2 cup heavy whipping cream"
  ],
  "__v": 1
}