{
  "hash": "e11abfc81408c8e9ab66cb7fe9d10beac7bf2d30",
  "title": "RED CURRY WONTON SOUP WITH ZUCCHINI NOODLES",
  "image": "https://healthynibblesandbits.com/wp-content/uploads/2018/09/Red-Curry-Wonton-Soup-Square-150x150.jpg",
  "href": "https://healthynibblesandbits.com/red-curry-wonton-soup-zucchini-noodles/",
  "extension": "Chrome",
  "firstAdded": "2019-05-05T10:59:36.518000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare the Broth: I like preparing the curry broth ahead because this gives the broth more time to develop the flavors.",
    "Heat the 1 tablespoon of oil in a pot. Add onions and cook them for 2 to 3 minutes. Next, add the minced ginger, garlic, and chilies (if using) and cook for about 30 seconds, stirring constantly. Add the red curry paste and sugar and stir to combine.",
    "Add the vegetable broth and 1 teaspoon salt, cover the pot, and bring the broth to boil. Reduce the heat to a simmer and swirl in the coconut milk. Let the broth simmer for about 10 minutes, covered. Turn off the heat and let the broth sit on the stove, covered, as you make the dumplings.",
    "Make the Dumplings",
    "Drain the tofu and wrap the tofu around a layer of paper towels. Press the tofu by placing the tofu block on a plate and weighing it down with a stack of plates. Let it sit for 15 to 20 minutes. Remove the paper towels and transfer the tofu to a bowl.",
    "Using your hands, squeeze the tofu until you get a soft mush. Set the tofu aside.",
    "Heat 1 tablespoon of oil in a large pan. Add the minced ginger and garlic and cook for 30 seconds, stirring constantly. Add the corn, peas, scallions, and 1/2 teaspoon of salt to the pan and cook for 2 to 3 minutes. Remove the pan from heat. Let the vegetables cool for 5 minutes",
    "Add the vegetables, chopped basil, and soy sauce to the bowl with the tofu. Stir to combine all the ingredients. Taste to see if the filling has been seasoned to your liking.",
    "Get your dumpling-making station set up. Take the wrappers out of the packaging. Have a small bowl filled with water, a large baking sheet, and 2 kitchen or linen towels ready. The wrappers and the dumplings dry out pretty quickly. Use one towel to cover the wrappers and another large towel to cover the finished dumplings.",
    "Dip a finger into the bowl of water and wet 2 adjacent sides of the dumpling wrappers. Spoon about 2 teaspoons to 1 tablespoon of filling into the center of the wrapper. If you can fit more filling into the dumpling, great! Seal the wrapper on the diagonal (dry sides over the wet sides) so that you end up with a triangle shape. Press down on the sides to get rid of any air pockets and to make sure that the dumpling is sealed. You don’t want the filling to release while they’re cooking.",
    "Lightly wet one of the base corners of the folded triangle, and fold the dumpling in half so that the other base corner overlaps the wet corner. Repeat until you have all the dumplings filled. If you need a visual, refer to the photos above or watch this video for my folding technique.",
    "Cook the Dumplings & Serve",
    "Bring the red curry broth to a simmer again. Turn off the heat and add the zucchini noodles. The noodles should soften in several minutes.",
    "Bring a big pot of water to boil. Add about half of the dumplings into the boiling water and cook for 3 to 4 minutes. All the dumplings should float to the top. Transfer the cooked dumplings to the pot with the red curry broth. Cook the remaining dumplings or freeze them.",
    "Serve the dumplings and zucchini noodles into bowls. Ladle some broth over the dumplings and noodles. Garnish with sliced scallions and more Thai basil, if desired."
  ],
  "ingredients": [
    "0",
    "Red Curry Broth",
    "1 tablespoon canola or vegetable oil",
    "1/2 cup diced onions",
    "1 tablespoon minced ginger",
    "2 cloves garlic, minced",
    "1 or 2 Thai chilies, sliced (optional)",
    "2 tablespoons red curry paste",
    "2 teaspoons sugar (maple syrup, honey or agave works also)",
    "4 cups vegetable broth*",
    "1 teaspoon kosher salt",
    "3/4 cup full-fat coconut milk",
    "1 1/2 pounds zucchini, spiralized",
    "Tofu Wontons",
    "14 ounce package of firm tofu",
    "1 tablespoon canola or vegetable oil",
    "1 tablespoon minced ginger",
    "2 cloves garlic, minced",
    "1/2 cup corn kernels",
    "1/2 cup peas",
    "2 scallions, sliced",
    "1/2 teaspoon kosher salt",
    "1/4 cup chopped Thai basil**",
    "1 1/2 tablespoons soy sauce",
    "35 to 40 square dumpling wrappers (medium thickness)",
    "Garnish",
    "sliced scallions",
    "Thai basil"
  ],
  "__v": 1
}