{
  "hash": "e4c28cf96499f657843647e03403d29d441c6df4",
  "title": "Mom's Texas Brownies, grain free",
  "image": "http://cdn.beautyandthefoodie.com/wp-content/uploads/2014/01/texas-brownies-071-photo-d.jpg-comp.jpg",
  "href": "http://beautyandthefoodie.com/moms-texas-brownies-grain-free/",
  "extension": "Chrome",
  "firstAdded": "2015-10-11T05:16:56.223000",
  "users": [
    null
  ],
  "keywords": [
    "brownies",
    "sifted",
    "buy",
    "coconut",
    "flour",
    "sweetener",
    "sugar",
    "paleo",
    "erythritol",
    "low",
    "carb",
    "option",
    "butter",
    "ghee",
    "red",
    "palm",
    "oil",
    "brand",
    "grown",
    "ecuador",
    "organic",
    "family",
    "farms",
    "partner",
    "natural",
    "promote",
    "sustainable",
    "agriculture",
    "rainforest",
    "orangutan",
    "habitats",
    "harmed",
    "brewed",
    "decaf",
    "use",
    "water",
    "coffee",
    "cocoa",
    "cacao",
    "eggs",
    "almond",
    "milk",
    "apple",
    "cider",
    "vinegar",
    "mixed",
    "separate",
    "bowl",
    "makes",
    "free",
    "buttermilk",
    "look",
    "curdled",
    "vanilla",
    "baking",
    "soda",
    "frosting",
    "make",
    "pulsing",
    "pulse",
    "blender",
    "processor",
    "used",
    "swerve"
  ],
  "directions": [
    "0",
    "Preheat oven to 400 F and grease or oil an 8x8 pan well.",
    "In a large metal or ceramic mixing bowl, combine: ½ cup sifted coconut flour and ¾ cup coconut sugar, or low carb sweetener option. Mix together thoroughly. Set aside.",
    "In a medium size sauce pan, combine: ½ cup ghee or red palm oil, ½ brewed coffee or water, and 2 tbsp cocoa powder. Stir and heat to boiling on stove top.",
    "Pour boiling cocoa- coffee mixture over coconut flour sweetener mixture in bowl. Stir together.",
    "Add to mixture: 3 eggs, the premixed 6 tbsp coconut milk or almond milk + 1 ¼ tsp apple cider vinegar mixture, baking soda and vanilla extract. Mix together well using a large spoon or electric mixer.",
    "Pour batter into well-greased pan.",
    "Bake at 400 F for 20 minutes or until toothpick comes out of center clean.",
    "While brownies are baking, prepare the frosting:",
    "In a small sauce pan combine: ¼ cup ghee or butter or coconut oil, 1 tbsp cocoa powder, and 1 ½ tbsp. coconut milk or almond milk. Stir and heat to a boil, and turn heat to low.",
    "Mix into the saucepan the powdered sweetener of choice (coconut sugar or low carb one) and vanilla extract. Stir until smooth. Leave saucepan on lowest heat.",
    "Pour warm frosting over the top of brownies as soon as you take them out of the oven. Try to cover entire surface with liquid frosting, can use a spoon to spread.",
    "Cool brownies and frosting completely before cutting or serving, as the frosting needs to set and thicken. You can put them in the fridge once cooled off enough, to speed up the process (I cooled on the counter for 15 minutes and then put in the fridge for about 45 minutes, but it could be ready sooner).",
    "Cut and serve once frosting is set. *Cover and store unused portions in the fridge."
  ],
  "ingredients": [
    "0",
    "Brownies:",
    "½ cup coconut flour, sifted, where to buy coconut flour",
    "¾ cup sweetener of choice: coconut sugar for paleo, or erythritol for low carb option.",
    "½ cup butter, ghee, or organic red palm oil (this brand is grown in Ecuador on small organic family farms and partner with Natural Habitats to promote sustainable agriculture, and where no rainforest or orangutan habitats are harmed).",
    "½ cup brewed organic coffee or decaf coffee, or can use ½ cup water in place of this (if you can’t have coffee)",
    "2 tbsp cocoa powder or cacao powder (unsweetened)",
    "3 eggs",
    "6 tbsp unsweetened coconut milk or almond milk + 1 ¼ tsp apple cider vinegar, mixed together in a separate bowl (this makes dairy free buttermilk and it will look curdled).",
    "1 tsp organic GF vanilla extract.",
    "1 tsp baking soda",
    "FROSTING:",
    "¼ cup ghee or butter or coconut oil",
    "1 tbsp cocoa powder or cacao powder",
    "½ cup powdered sweetener of choice: coconut sugar for paleo (make this by pulsing coconut sugar in blender or processor until powdered), or for Low Carb use ½ cup powdered erythritol (pulse in blender or processor until powdered), I used Swerve.",
    "1 ½ tbsp coconut milk or almond milk (unsweetened)",
    "½ tsp organic GF vanilla"
  ],
  "__v": 1
}