{
  "hash": "46d0716b2124af0591c5d4fea9ddac1632608294",
  "title": "Korean Corn Grilled Cheese",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/9123f08/2147483647/strip/true/crop/3551x5327+0+0/resize/840x1260!/quality/90/?url=https%3A%2F%2Fca-times.brightspotcdn.com%2Fd9%2F3d%2Ffbe8b40f46a1b71d053007701c29%2F3084468-fo-0711-saturday-cooks-mrt-012.JPG",
  "href": "https://www.latimes.com/food/story/2019-07-31/best-grilled-cheese-sandwich-korean-corn-cheese",
  "extension": "Chrome",
  "firstAdded": "2019-08-18T22:19:57.444000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the butter in a large cast-iron or nonstick skillet over medium-high heat. Add the onion and cook, stirring, until soft and just beginning to brown at the edges, 2 to 3 minutes. Add the corn and sugar (if using) and cook, stirring occasionally, until crisp-tender, about 3 minutes. Scrape the corn into a bowl and let cool for 10 minutes (wipe the skillet clean and reserve). Stir in the 2 tablespoons mayonnaise, followed by the mozzarella, fontina and parsley, and season with salt and pepper.",
    "Brush a thin layer of mayonnaise on each slice of the sourdough bread, then turn the slices over. Divide the corn mixture among 4 slices of bread, then sandwich them with the other 4 slices. (Make sure the “mayonnaise sides” are facing outward .)",
    "Heat the reserved skillet over medium heat. Add 2 sandwiches to the skillet, cover, and cook, flipping once, until golden brown outside and the cheese is melted inside, 8 to 10 minutes. Transfer the sandwiches to a cutting board and repeat with the remaining sandwiches.",
    "As soon as they’re cooked, cut the sandwiches in half and eat, being careful not to burn your mouth on the molten cheese.",
    "Variation:",
    "Elotes Grilled Cheese: Substitute queso Oaxaca for the mozzarella, substitute queso fresco for the fontina, substitute cilantro for the parsley, and add 1/2 teaspoon chile-lime salt, such as Tajin to the corn mixture. Serve hot with a squeeze of fresh lime."
  ],
  "ingredients": [
    "0",
    "1 tablespoon unsalted butter",
    "½ cup minced yellow onion",
    "1½ cups corn kernels (from 3 to 4 ears)",
    "Granulated sugar (optional), if you think the corn needs it",
    "2 tablespoons mayonnaise, plus more for brushing",
    "8 ounces low-moisture mozzarella, shredded (2 cups)",
    "4 ounces fontina or provolone cheese, shredded (1 cup)",
    "2 tablespoons minced flat-leaf parsley",
    "Kosher salt and freshly ground black pepper",
    "8 slices really good sourdough bread, cut ¾-inch thick"
  ],
  "__v": 1
}