{
  "hash": "4c1b28767e721e8554678183f855c9f616c5acbe",
  "title": "Mushroom and Leek Flatbread Pizza [Vegan, Gluten-Free]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/04/pizza.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/mushroom-and-leek-flatbread-pizza/",
  "extension": "Chrome",
  "firstAdded": "2015-05-13T07:55:07.226000",
  "users": [
    null
  ],
  "keywords": [
    "cassava",
    "flour",
    "water",
    "baking",
    "salt",
    "olive",
    "oil",
    "divided",
    "flax",
    "egg",
    "soaked",
    "cashews",
    "garlic",
    "juice",
    "lemon",
    "nutritional",
    "yeast",
    "non",
    "milk",
    "used",
    "coconut",
    "mushrooms",
    "leek",
    "cleaned",
    "oregano",
    "parsley"
  ],
  "directions": [
    "0",
    "Soak cashews for at least 2 hours in water, drain and set aside.",
    "Pre-heat the oven to 450f degrees and line a pizza stone or thin baking sheet with parchment paper, set aside.",
    "Prep the toppings, make the sauce by combining the soaked cashews and the rest of ingredients in a blender and mix until smooth. Set aside.",
    "Clean the mushrooms with a damp paper towel, slice thin and set aside.",
    "Prep the leeks by removing the outer layer and the green top and rinse in between the layers (you can save the top for veggie stock, but not for this recipe)! Then cut off the bottom bulb and discard, but keep enough to hold the whole leek together. Then slice into thin half moons by slicing the leek in half vertically and then horizontally. Place chopped leeks into a bowl of cold water and drain any excess dirt.",
    "Now onto the dough! Place another piece of parchment paper on your counter, and toss a little more flour on there for rolling.",
    "Measure flour and place into a bowl with baking powder, mix around with a fork. Then add the water and mix with a wooden spoon, next up is the flax egg or egg, keep mixing and then salt and HALF your olive oil. You can now use your hands to roll into a ball.",
    "Put your dough on the floured parchment paper, kneading by hand first and then adding another piece of parchment paper to the top and roll out. The dough should be thin, but not to the point of falling apart!",
    "Place the ready dough on parchment paper on top of your baking sheet or on your pizza stone and pop it in the oven for 5 minutes.",
    "After 5 minutes, remove the pizza from the oven and get ready to top it off! Firstly, with your remaining oil, brush enough oil to cover the crust surface in a thin layer (you probably won’t use all of it).",
    "Then with a spatula, spread the cashew cheese sauce, next top with leeks, and finally the mushrooms. With any remaining oil, sprinkle it over top and add a pinch of sea salt and oregano over top.",
    "Place back into the oven for 15 minutes, rotating the pizza mid way. As an option (which I took…) you can broil this for an additional 3 minutes or so just to get a little more color! Your pizza is done and ready to be sliced and served!"
  ],
  "ingredients": [
    "0",
    "1 cup cassava flour",
    "1/2 + 1/3 cup water",
    "1/2 tsp baking powder",
    "pinch sea salt",
    "1/4 cup olive oil, divided in half",
    "1 flax egg",
    "1",
    "1 cup soaked cashews",
    "1/4 cup water",
    "2 cloves garlic",
    "1 tsp salt",
    "juice of half a lemon",
    "1 tsp nutritional yeast",
    "2 tbsp non dairy milk (I used coconut)",
    "2",
    "6 oz mushrooms, sliced thin",
    "1 leek, cleaned and sliced thin",
    "pinch sea salt",
    "pinch dried oregano",
    "optional: garnish with fresh parsley"
  ],
  "__v": 1
}