{
  "hash": "a7186104aa845536cd18fa5e79ec9a11758904c0",
  "title": "Chocolate Dipped Caramallow Patties",
  "image": "http://1.bp.blogspot.com/-AddLboLiKsY/UTALTplwqoI/AAAAAAAAV1Q/DqPTiDJSl8I/s280/chocolate+dipped+caramallows+with+sea+salt.JPG",
  "href": "http://www.rookno17.com/2013/03/how-to-make-easy-chocolate-dipped.html?spref=pi&m=1",
  "extension": "Firefox",
  "firstAdded": "2015-10-23T13:49:31.605000",
  "users": [
    null
  ],
  "keywords": [
    "batch",
    "minute",
    "caramel",
    "adapted",
    "foodcom",
    "unsalted",
    "butter",
    "granulated",
    "sugar",
    "dark",
    "brown",
    "light",
    "corn",
    "syrup",
    "sweetened",
    "condensed",
    "milk",
    "mini",
    "marshmallows",
    "high",
    "quality",
    "chocolate",
    "tempered",
    "flake",
    "used",
    "murray",
    "river",
    "salt"
  ],
  "directions": [
    "0",
    "Prepare a 9x9 or 10x10 pan by lining with parchment paper in each direction so that parchment overhangs all four sides and can be used to lift out the finished caramel. Use nonstick spray or butter to grease the parchment.",
    "Step 1: Place butter in a medium microwave-safe bowl. Microwave on low power just long enough to soften the butter. Remove from microwave and stir in the sugars, corn syrup and condensed milk. Microwave for 2 minutes. Stir. Microwave for another 2 minutes. Stir. Microwave for a final 2 minutes. Stir and pour immediately into the prepared pan. Gently tilt pan to move caramel into each corner, then tap pan firmly on a flat surface to help level the hot candy. Set aside to cool for 1 hour. Use overhanging parchment to lift the cooled candy out of the pan and continue to cool for an additional hour.",
    "Here's my sheet of caramel after I removed it from my 10x10 pan",
    "Step 3: Using a sharp, greased knife, cut caramel into 1.5\"x 1.5\" squares.",
    "Step 4: Line a baking sheet with parchment or wax paper. Create caramallows by placing a mini marshmallow in the center of a square of caramel.",
    "Bring top and bottom corners together.",
    "Fold right and left sides toward the center.",
    "Roll between palms to form a smooth ball.",
    "Press gently between palms to form a patty, then place on the lined baking sheet. You'll notice that the patties will go from uniformly flat, to more of an oyster shape as the marshmallow resumes its fluffy form.",
    "Refrigerate the caramallows for 30 minutes.",
    "(This will make them easier to handle and dip.)",
    "Step 5: Drop a caramallow in the melted chocolate. Using a dipping fork, or a plastic fork with the center tines snapped off, flip the candy over to make sure both sides are coated. Remove with the fork and gently tap off excess chocolate. Gently scrape bottom along the side of bowl. Only half of the candy should be on the fork. This will make it easier to transfer from the fork to the parchment. Sprinkle with just a touch of salt.",
    "Step 6: Refrigerate caramels 10-15 minutes, until chocolate has set. Store at room temperature. At room temp, the caramel is soft, luscious, and melts in your mouth!"
  ],
  "ingredients": [
    "0",
    "One batch 6-minute Caramel (adapted from food.com)",
    "1/4 cup unsalted butter",
    "1/2 cup granulated sugar",
    "1/2 cup dark brown sugar",
    "1/2 cup light corn syrup",
    "1/2 cup sweetened condensed milk",
    "30-40 mini marshmallows",
    "10 oz. high quality dark chocolate, chopped, melted & tempered",
    "A fine flake salt for garnish (I used Murray River Salt)"
  ],
  "__v": 1
}