{
  "hash": "b7dda3852c7be89d0d9fb5e4c6cdee0e8eb56527",
  "title": "Paleo French Toast",
  "image": "http://blog.paleohacks.com/wp-content/uploads/2015/08/Paleo-French-Toast-4.jpg",
  "href": "http://blog.paleohacks.com/paleo-french-toast/",
  "extension": "Chrome",
  "firstAdded": "2016-02-06T13:31:40.601000",
  "users": [
    null
  ],
  "keywords": [
    "almond",
    "flour",
    "arrowroot",
    "starch",
    "salt",
    "baking",
    "milk",
    "apple",
    "cider",
    "vinegar",
    "honey",
    "flaxseeds",
    "water",
    "banana",
    "mashed",
    "cinnamon",
    "vanilla",
    "coconut",
    "oil",
    "cooking",
    "blueberries",
    "berries",
    "maple",
    "syrup",
    "drizzled"
  ],
  "directions": [
    "0",
    "How to Make It:",
    "1. Preheat the oven to 350°F.",
    "2. For the Paleo bread: Measure all the wet ingredients (7 T almond milk, apple cider vinegar, honey, 4 T ground flaxseeds), except the water, and mix in a bowl thoroughly to ensure the mix isn’t clumpy. Note: This is important to do first so that the flaxseeds can soak up the liquid",
    "3. Measure all the dry ingredients (1 ½ cup almond flour, arrowroot powder, sea salt, baking powder), add to a bowl and mix.",
    "4. Add the wet ingredients to the dry ingredients and mix. If the dough is stiff, add the extra water. (It will most likely need the 2 to 3 T water, but don’t add more than this as the mix will become too wet).",
    "5. Line a small baking loaf tin with baking paper, then add the bread mix to the tin.",
    "6. Place in the oven and bake for 25 to 30 minutes, or until lightly golden on top and feels solid to the touch.",
    "7. While the bread is baking, prepare the French toast ingredients and toppings. Mash the ½ banana in a large bowl.",
    "8. Add ½ cup almond milk, ¼ T flaxseed, cinnamon, vanilla and stir. If the batter is too chunky, add more almond milk to thin it out. It should be pourable. Place the batter to the side for later.",
    "9. Slice the extra banana for toppings, prep any berries and place to the side.",
    "10. Once cooked, carefully remove the bread from the oven and take the loaf out of the tin. Place on a cooling rack for 5 minutes.",
    "11. Remove the bread from the baking paper and slice into thick pieces.",
    "12. Heat a pan to medium-high. Add a little coconut oil to the pan.",
    "13. Dip a slice of bread in the batter mixture, but be quite quick so that the bread doesn’t get too soaked. Make sure the slice of bread is fully covered, then add to the pan.",
    "14. Cook for 3 to 4 minutes on each side or until evenly golden brown. Flip carefully using a spatula. If the french toast appears to be browning too quickly or burning, turn down the heat.",
    "15. Stack French toast slices and add desired toppings (banana, berries and honey).",
    "16. Dig in!"
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "1 1/2 cups almond flour",
    "3/4 cup arrowroot starch powder",
    "1 t sea salt",
    "1 t baking powder",
    "7 T almond milk",
    "2 t apple cider vinegar",
    "1 t honey",
    "4 T ground flaxseeds",
    "2 to 3 T water",
    "1/2 ripe banana (1/4 cup mashed)",
    "1/2 cup almond milk",
    "1/4 to 1/2 t cinnamon",
    "Dash of vanilla extract",
    "1/4 T ground flaxseeds",
    "Coconut oil for cooking",
    "Banana, sliced",
    "Blueberries (or any berries)",
    "Honey or maple syrup, drizzled"
  ],
  "__v": 1
}