{
  "hash": "3dbf68177793135da26c4f14e6ca9761403b2d4f",
  "title": "Chili con carne van Jamie Oliver",
  "image": "http://www.lekkeretenmetlinda.nl/wp-content/uploads/chili-con-carne-van-jamie-oliver-1a.jpg",
  "href": "http://www.lekkeretenmetlinda.nl/chili-con-carne-van-jamie-oliver/",
  "extension": "Chrome",
  "firstAdded": "2016-11-28T16:26:53.261000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Hoe maak je de chili con carne van Jamie Oliver:",
    "Je kunt het gerecht op 2 manieren maken op het fornuis of in de oven. Kies je voor de oven, laat deze voorverwarmen op 150 graden.",
    "Snijd de uien en knoflook fijn. Verwarm een pan met dikke bodem met de olijfolie en bak de ui en knoflook op een zacht vuurtje glazig.",
    "Snijd ondertussen de paprika’s in blokjes. Voeg toe aan de pan met het fijngehakte chilipepertje, komijn en snuf chilipeper. Bak een minuut of 3.",
    "Voeg het gehakt toe en laat al roerend bruinbakken. Maal de zongedroogde tomaatjes fijn met de hakmolen van de staafmixer of snijd heel fijn met een mes tot een pasta. Voeg de tomatenpasta, 2 blikken tomaten en passata toe aan de saus. Breek het kaneelstokje in tweeën en doe bij de saus. Plaats de deksel op de pan. Zet de pan in de oven voor 1,5 uur of laat zachtjes pruttelen op het vuur. Spoel de kidney bonen af en voeg 30 minuten voor einde van de kooktijd toe."
  ],
  "ingredients": [
    "0",
    "voor 8 personen",
    "2 uien",
    "1 teen knoflook",
    "1 eetlepel olijfolie",
    "1 rode paprika",
    "1 gele paprika",
    "1 gedroogd chilipepertje, fijngehakt (zonder zaadjes)",
    "1 flinke theelepel komijn",
    "snuf chilipeper naar smaak",
    "500 gram rundergehakt",
    "8 zongedroogde tomaatjes op olie",
    "2 blikken tomaten à 400 gram",
    "1 fles passata (700 ml)",
    "1 kaneelstokje",
    "2 blikken kidney bonen",
    "voor erbij: guacamole, rijst geraspte kaas (cheddar), tortillachips en groene salade"
  ],
  "__v": 1
}