{
  "hash": "cbcc379e1f86e046742d1645fdaa6be9f03dc648",
  "title": "Qchenne kaprysy Dla każdego coś smacznego Powitanie i kontakt",
  "image": "http://to-tylko-blog.blog.pl/files/2014/02/IMG_4393-300x225.jpg",
  "href": "http://to-tylko-blog.blog.pl/2014/02/03/pierogi-z-ciasta-drozdzowego/",
  "extension": "",
  "firstAdded": "2016-09-22T10:53:52.782000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Grzyby namoczyć na 15 minut , potem ugotować je w tej samej wodzie. Ugotowane odcedzić i pokroić w drobną kostkę.Jeśli kapusta jest za kwaśna przepłukać ją wodą i odcisnąć, rozdrobnić lekko nożem, włożyć do garnka, zalać wodą od gotowania grzybów i gotować tak długo aż ta woda wyparuje całkiem. Cebulę obrać i pokroić w kosteczkę, obsmażyć na 2 łyżkach oleju, do zeszklonej dodać grzyby i odparowaną kapustę, wszystko chwilę podsmażyć, dokładnie wymieszać, doprawić pieprzem do smaku. Lekko przestudzić i układać na krążkach ciasta."
  ],
  "ingredients": [
    "0",
    "Składniki na ciasto:",
    "500 g mąki",
    "250 ml ciepłego mleka",
    "20 g (1/5 kostki) drożdży",
    "pół łyżeczki cukru",
    "1 łyżeczka soli",
    "3 łyżki oleju",
    "Mąkę wsypać do suchej miski dodać sól i olej. Mleko podgrzać, 2/3 mleka wlać do miski z mąką, w pozostałej ilości rozmieszać rozkruszone drożdże i cukier. Kiedy drożdże zaczną pracować dolać rozczyn do miski z mąką. Wszystko wyrobić ręką na jednolitą elastyczną masę, która nie przykleja się ani do ręki, ani do miski. Ciasto brać porcjami i na stolnicy lekko posypanej mąką rozwałkowywać placki na grubość 2-3 mm. Szklanką wykrawać krążki, nakładać na każdy krążek po łyżeczce farszu, składać na pół i dokładnie zlepiać brzegi – najpierw palcami, a następnie widelcem. Uformowane odkładać na kilka minut żeby podrosły.",
    "Tak przygotowane pierogi możemy :",
    "smażyć na patelni na nieco większej ilości tłuszczu po kilka minut z każdej strony",
    "piec ok. 15-20 minut w piekarniku nagrzanym do 180*C",
    "Ja dzisiaj smażyłam :)",
    "Składniki na farsz :",
    "400 g kapusty kiszonej",
    "2 garście suszonych grzybów",
    "1 duża lub 2 małe cebule",
    "pieprz mielony do smaku",
    "1 i 1/2 szklanki wody"
  ],
  "__v": 1
}