{
  "hash": "d857319cdea55f44ddca18dc2646b06d810ddef9",
  "title": "BROCCOLI WALNUT PESTO",
  "image": "http://static.squarespace.com/static/537e3f1fe4b0a67f78e926bb/5383a006e4b0d7dd6b3fb42c/5383a01be4b0d7dd6b3fc6d6/1389955835000/pesto-13-of-16.jpg?format=original",
  "href": "http://www.produceonparade.com/broccoli-walnut-pesto/",
  "extension": "Chrome",
  "firstAdded": "2015-03-24T15:12:51.628000",
  "users": [
    null
  ],
  "keywords": [
    "broccolibroccoli",
    "head",
    "broccoli",
    "florets",
    "salt",
    "pasta",
    "dry",
    "pesto",
    "walnuts",
    "garlic",
    "basil",
    "lemon",
    "juice",
    "walnut",
    "olive",
    "oil",
    "work",
    "miso",
    "apple",
    "cider",
    "vinegar"
  ],
  "directions": [
    "0",
    "Start by bringing a medium pot of salted water to boil. Chop off the broccoli florets and once the water is boiling, place them in the water. Allow them to boil for about 3 minutes. Then, remove the florets with a slotted spoon and submerge in a large bowl of cold water. Allow to rest in the water until ready for use.",
    "Keep that water boiling and add another dash of salt. Add the dry pasta and cook according to package. I like to use a pasta that is dense and sturdy, so it can stand up to being stirred with the pesto. Once the pasta is al dente, strain, but not completely. Leave about 1/2 cup of pasta water at the bottom, with the noodles. Place the pot of noodles aside until ready to use.",
    "In a food processor, combine all the pesto sauce ingredients and process until it's reached a fine consistency. There will be a lot of scraping down the sides of the bowl, but it's a small price to pay.",
    "Now, strain the broccoli from the cold water and add the florets to the processor. Process until very smooth and creamy.",
    "Add the pesto sauce into the pot of noodles and stir very well, ensuring to combine the water at the bottom. You can add a pinch of salt here too.",
    "Serve hot with crushed walnuts on top, if you like!"
  ],
  "ingredients": [
    "0",
    "Broccoli:Broccoli:",
    "1 large head of broccoli, florets only",
    "dash of salt",
    "Pasta:",
    "16 oz. of dry pasta",
    "dash of salt",
    "Pesto Sauce:",
    "1/3 cup of walnuts, chopped",
    "2 garlic cloves, whole",
    "1 Tbsp. fresh basil paste or small handful of fresh basil (optional)",
    "1 Tbsp. lemon juice",
    "1 Tbsp. walnut oil (olive oil will work, too)",
    "1 Tbsp. miso paste",
    "1 tsp. apple cider vinegar",
    "Pasta:",
    "Pesto Sauce:"
  ],
  "__v": 3
}