{
  "__v": 1,
  "directions": [
    "0",
    "Cook 1 pound of pasta in heavily salted water until extremely al dente, about 8 minutes. Lift the pasta from the water and spread on baking sheets to cool; drizzle lightly with olive oil to keep it from sticking together.",
    "Using the boiling water, blanch the greens for 1 minute or so. Drain in a colander. When they are cool, roughly chop the greens and set aside.",
    "Heat 3 tablespoons olive oil over medium heat. Warm the garlic in the oil, but don’t let it brown. Add the chopped greens, rosemary, fennel seeds and red pepper. Lightly salt the greens, stir them around the pan, and turn off the heat.",
    "To assemble the dish, put the cooked pasta and cooked greens in a large bowl and mix gently. Add the ricotta and mix again.",
    "Butter a shallow earthenware gratin dish. Put the pasta mixture in dish and sprinkle generously with grated pecorino. Cover and keep at room temperature for up to several hours.",
    "Preheat the oven to 400°F. Shortly before serving time, bake the pasta for 15 minutes. Uncover and bake for 5 minutes more. Serve immediately."
  ],
  "firstAdded": "2014-06-18T13:39:26.083000",
  "hash": "827c54351ac10e3f05ccbbf0b77a8a4be55642c1",
  "href": "http://www.lottieanddoof.com/2009/01/baked-orecchiette/",
  "image": "http://www.lottieanddoof.com/wp-content/uploads/2009/01/img_4654.jpg",
  "ingredients": [
    "0",
    "1 pound orecchiette",
    "2 teaspoons finely chopped fresh rosemary",
    "Olive oil",
    "1 teaspoon red pepper flakes",
    "1 1/2 pounds rapini (broccoli rabe), chard, or kale washed and stemmed",
    "Salt",
    "1 tablespoon fennel seeds, lightly crushed",
    "1/2 pound fresh ricotta",
    "Butter",
    "4 garlic cloves, chopped",
    "Grated pecorino"
  ],
  "keywords": [
    "orecchiette",
    "rosemary",
    "olive",
    "oil",
    "red",
    "pepper",
    "rapini",
    "broccoli",
    "rabe",
    "chard",
    "kale",
    "washed",
    "stemmed",
    "salt",
    "fennel",
    "seeds",
    "lightly",
    "ricotta",
    "butter",
    "garlic",
    "pecorino"
  ],
  "title": "Orechiette al Forno",
  "users": [
    null
  ]
}