{
  "hash": "d09495b2c37fe4d5ac0fd3c9349093c6f03d5c75",
  "title": "Mexican Hot Chocolate Snowball Cookies",
  "image": "https://www.loveandoliveoil.com/wp-content/uploads/2015/12/mexican-chocolate-snowballs-600x900.jpg",
  "href": "https://www.loveandoliveoil.com/2015/12/mexican-hot-chocolate-snowballs-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2018-10-09T17:17:24.713000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 degrees F. Prepare baking sheets by lining with parchment paper or a silicone baking mat.",
    "In a bowl, whisk together flour, almond flour, cocoa powder, cinnamon, salt, and cayenne and set aside.",
    "In a large bowl or the bowl of a stand mixer, beat butter until smooth and fluffy. Add powdered sugar and vanilla and almond extract and beat for 1 to 2 minutes on medium-high speed. Add dry ingredients and mix on low speed until incorporated. Stir in chopped nuts.",
    "Scoop dough by heaping teaspoonfuls and roll into 1-inch diameter balls. Arrange on prepared baking sheet, leaving 1 to 2 inches of space between cookies. Fill up two cookie sheets if you have them, you can easily bake two sheets at once with this recipe.",
    "Bake for 18 to 20 minutes, rotating sheets top to bottom and front to back part way through baking, until tops are lightly cracked and no longer shiny.",
    "Let cookies cool to room temperature. Add a few spoonfuls of powdered sugar and a bit of cocoa powder too (if desired) to a plastic or small paper bag. Add 4 or 5 cooked cookies to bag and shake gently until cookies are completely coated. Remove from bag, tapping of excess sugar. Repeat with remaining cookies.",
    "Cookies will keep in an airtight container for up to 5 days."
  ],
  "ingredients": [
    "0",
    "3/4 cup all-purpose flour",
    "1/3 cup almond flour or very finely ground almonds",
    "3 tablespoons cocoa powder",
    "1/2 teaspoon ground cinnamon",
    "1/4 teaspoon salt",
    "pinch cayenne (optional)",
    "1/2 cup (1 stick) unsalted butter, room temperature",
    "1/2 cup powdered sugar",
    "1 teaspoon vanilla extract",
    "1/4 teaspoon almond extract",
    "1/2 cup lightly toasted sliced or slivered almonds, finely chopped",
    "powdered sugar or a mix of cocoa powder and powdered sugar, for coating"
  ],
  "__v": 1
}