{
  "hash": "ab83131a82b27d393714c27410f55c33c52c1327",
  "title": "Lighter chicken cacciatore",
  "image": "//www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/lighter-chicken-cacciatore.jpg?itok=5JTIX2Oi",
  "href": "https://www.bbcgoodfood.com/recipes/lighter-chicken-cacciatore",
  "extension": "Chrome",
  "firstAdded": "2018-03-12T20:39:37.556000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the oil in a large non-stick frying pan. Tip in the prosciutto and fry for about 2 mins until crisp. Remove with a slotted spoon, letting any fat drain back into the pan, and set aside. Put the onion, garlic and herbs in the pan and fry for 3-4 mins.",
    "Spread the onion out in the pan, then lay the chicken breasts on top. Season with pepper and fry for 5 mins over a medium heat, turning the chicken once, until starting to brown on both sides and the onion is caramelising on the bottom of the pan. Remove the chicken and set aside on a plate. Raise the heat, give it a quick stir and, when sizzling, pour in the wine and let it bubble for 2 mins to reduce slightly.",
    "Lower the heat to medium, return the prosciutto to the pan, then stir in the tomatoes (breaking them up with your spoon), tomato purée and mushrooms. Spoon 4 tbsp of water into the empty tomato can, swirl it around, then pour it into the pan. Cover and simmer for 15-20 mins or until the sauce has thickened and reduced slightly, then return the chicken to the pan and cook, uncovered, for about 15 mins or until the chicken is cooked through. Season and scatter over the parsley to serve."
  ],
  "ingredients": [
    "0",
    "1 tbsp olive oil",
    "3 slices prosciutto, fat removed, chopped",
    "1 medium onion, chopped",
    "2 garlic cloves, finely chopped",
    "2 sage sprigs",
    "2 rosemary sprigs",
    "4 skinless chicken breasts (550g total weight), preferably organic",
    "150ml dry white wine",
    "400g can plum tomatoes in natural juice",
    "1 tbsp tomato purée",
    "225g chestnut mushrooms, quartered or halved if large",
    "small handful chopped flat-leaf parsley, to serve"
  ],
  "__v": 3
}