{
  "hash": "39d0ca4b3b917d134e6eadc69df880b76ec0704d",
  "title": "Mushroom Pesto Crostini",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2004/5/28/0/ei1c12_pesto_crostini.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/mushroom-pesto-crostini-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-05-18T12:29:43.883000",
  "users": [
    null
  ],
  "keywords": [
    "porcini",
    "mushrooms",
    "white",
    "button",
    "walnuts",
    "garlic",
    "italian",
    "parsley",
    "leaves",
    "olive",
    "oil",
    "parmesan",
    "salt",
    "black",
    "pepper",
    "slices",
    "inchthick",
    "baguette",
    "bread"
  ],
  "directions": [
    "0",
    "Place the porcini mushrooms in a bowl of hot water; press to submerge. Let stand until the mushrooms are tender, about 15 minutes. Scoop out mushrooms, being careful not to stir any dirt that may have sunk to the bottom of the water. Discard mushroom water.",
    "Combine the porcini mushrooms, button mushrooms, walnuts, garlic, and parsley in a food processor and pulse until coarsely chopped. With the machine running, gradually add 1/2 cup of the oil, blending just until the mushrooms are finely chopped.",
    "Transfer the mushroom mixture to a medium bowl. Stir in the Parmesan. Season the pesto with salt and pepper, to taste. If not using mushroom pesto right away, cover tightly with plastic wrap to prevent possible discoloration of mushrooms.",
    "Preheat a grill pan to medium-high heat. Arrange the bread slices on pan, cut-side down. Brush the remaining 1/4 cup of oil over the bread slices. Cook until pale golden and crisp, about 5 minutes.",
    "Alternatively, you can toast the bread in the oven. Preheat the oven to 375 degrees F. Arrange the bread slices on 2 heavy large baking sheet. Brush the remaining 1/4 cup of oil over the bread slices. Bake until pale golden and crisp, about 15 minutes.",
    "Spread the mushroom pesto over the crostini. Arrange the crostini on a platter and serve.",
    "SERVINGS: 36 (PER CROSTINI); Calories: 179; Total Fat 6 grams; Saturated Fat: 1 grams; Protein: 5 grams; Total carbohydrates: 24 grams; Sugar: 1 grams Fiber: 1 grams; Cholesterol: 0 milligrams; Sodium: 356 milligrams",
    "Recipe courtesy Giada De Laurentiis"
  ],
  "ingredients": [
    "0",
    "1 ounce dried porcini mushrooms",
    "8 ounces white button mushrooms, quartered",
    "1/2 cup walnuts, toasted",
    "2 garlic cloves",
    "1 1/2 cups fresh Italian parsley leaves",
    "3/4 cup olive oil",
    "1/2 cup freshly grated Parmesan",
    "Salt and freshly ground black pepper",
    "36 slices (1/2-inch-thick) baguette bread"
  ],
  "__v": 1
}