{
  "hash": "8b4ddbe26fd98cbd482b86c29a71185b5c065f98",
  "title": "Three-Layer Chocolate Ganache Cake",
  "image": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Three-Layer-Chocolate-Ganache-Cake_EXPS_MRRA20_60144_B01_15_1b-696x696.jpg",
  "href": "https://www.tasteofhome.com/recipes/three-layer-chocolate-ganache-cake/",
  "extension": "Chrome",
  "firstAdded": "2020-05-07T01:32:32.442000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350°. Line bottoms of 3 greased 9-in. round baking pans with parchment paper; grease paper. In a large bowl, whisk flour, sugar, cocoa and baking soda. Beat in mayonnaise, coffee and vanilla. Transfer batter to prepared pans. Bake 30-35 minutes or until a toothpick inserted in center comes out clean. Cool in pans 10 minutes before removing to wire racks; remove paper. Cool completely.",
    "For filling, in a small heavy saucepan, mix sugar and cornstarch. Whisk in milk. Cook and stir over medium heat until thickened and bubbly. Reduce heat to low; cook and stir 2 minutes longer. Remove from heat; stir in vanilla. Cool completely. In a large bowl, cream butter. Gradually beat in cooled mixture. Stir in chocolate chips.",
    "For ganache, place chocolate in a large bowl. In a small saucepan, bring cream just to a boil. Pour over chocolate; let stand 5 minutes. Stir with a whisk until smooth. Stir in vanilla. Cool to room temperature, stirring occasionally. Refrigerate, covered, until cold. Beat ganache just until soft peaks form, about 15-30 seconds (do not overbeat).",
    "Place 1 cake layer on a serving plate; spread with half of the filling. Repeat layers. Top with remaining cake layer. Frost top and sides of cake with ganache. In a microwave-safe bowl, combine chocolate, cream and butter. Microwave at 50% power for 1-2 minutes or until smooth, stirring twice. Cool slightly, stirring occasionally. Drizzle over cake, allowing some to flow over sides. Refrigerate at least 2 hours before serving."
  ],
  "ingredients": [
    "0",
    "4 cups all-purpose flour",
    "2-1/4 cups sugar",
    "3/4 cup baking cocoa",
    "4 teaspoons baking soda",
    "2-1/4 cups mayonnaise",
    "2-1/4 cups cold brewed coffee",
    "1-1/2 teaspoons vanilla extract",
    "FILLING:",
    "1 cup sugar",
    "2 tablespoons cornstarch",
    "1 cup 2% milk",
    "2 teaspoons vanilla extract",
    "1 cup butter, softened",
    "3/4 cup miniature semisweet chocolate chips",
    "GANACHE:",
    "8 ounces semisweet chocolate, chopped",
    "2 cups heavy whipping cream",
    "1 teaspoon vanilla extract",
    "GLAZE:",
    "8 ounces semisweet chocolate, chopped",
    "3/4 cup heavy whipping cream",
    "1/4 cup butter, cubed"
  ],
  "__v": 1
}