{
  "hash": "ee5ee579bac46f83519104b78968296b455be221",
  "title": "Coconut Flour Bread",
  "image": "http://blog.paleohacks.com/wp-content/uploads/2014/05/coconut-flour-bread.jpg",
  "href": "http://blog.paleohacks.com/coconut-flour-bread-recipe/",
  "extension": "Chrome",
  "firstAdded": "2016-01-12T15:30:08.981000",
  "users": [
    null
  ],
  "keywords": [
    "coconut",
    "flour",
    "baking",
    "soda",
    "salt",
    "eggs",
    "separated",
    "organic",
    "grassfed",
    "butter",
    "milk",
    "raw",
    "honey",
    "coldpressed",
    "virgin",
    "oil"
  ],
  "directions": [
    "0",
    "How To Make It:",
    "Begin by using the coconut oil to lightly grease a loaf pan. Be sure to also line the pan with baking paper, and apply a coating of oil to this too; the last thing we want is for your delectable creation to get stuck and fall apart at the last minute!",
    "Preheat your oven to 300-350F.",
    "Take three of your eggs and separating the whites from the yolks.",
    "Set the yolks aside and with a handheld electric whisk, beat the whites until they become stiff.",
    "Set aside the whites and grab your yolks. Using a food processor, thoroughly mix together the yolks with the remaining four whole eggs, butter, coconut milk, and honey.",
    "Begin gradually mixing in the coconut flour, baking soda, and salt with the dry ingredients. Combine everything together until the mixture thickens up.",
    "Pour your thickened batter out of the food processor and into a large mixing bowl before thoroughly folding in the egg whites.",
    "With the egg whites completely folded into the mixture, pour it into your loaf pan and bake at 300-350F for 40 minutes.",
    "You may tempted at this point to remove your loaf because it will have browned, but patience is the key here because the inside won’t quite be cooked yet. Reduce the heat a touch to 275-300F, cover the loaf pan, and cook for an additional 5-10 minutes.",
    "Now simply remove your loaf pan from the oven, slip out the loaf, and leave it to cool on a wire rack. Wait until your loaf is completely cooled before slicing into it.",
    "I would just like to reemphasize that timing is everything with this kind of recipe, so as tempted as you might be, please make sure you wait a good 45-60 minutes for the loaf to cool to ensure a nice, clean cut.",
    "You might not get it perfect on your first attempt as baking grain-free breads can be somewhat of an art rather than an exact science, but give it a shot and I’m confident you’ll be hooked for life!",
    "###"
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "3/4 cup coconut flour",
    "1 tsp baking soda",
    "Pinch of sea salt",
    "4 whole eggs",
    "3 eggs, separated",
    "4 – 5 Tbsp organic, grass-fed butter",
    "3 Tbsp coconut milk",
    "1 Tbsp raw honey",
    "Organic, cold-pressed virgin coconut oil"
  ],
  "__v": 1
}