{
  "hash": "1cc2465fab1d5367c7e4d6d148ec6309e5944de2",
  "title": "Hawaiian Pork Burger",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2012/06/hawaiian-pork-burger-vertical-a-640.jpg",
  "href": "http://www.simplyrecipes.com/recipes/hawaiian_pork_burger/",
  "extension": "Chrome",
  "firstAdded": "2016-05-16T17:59:45.050000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Use your (clean) hands to mix the ground pork, green onion, allspice, salt, pepper and ground ginger together in a large bowl until just combined. Don't knead the mixture too much or the burgers will be tough.",
    "Gently form 4 equal patties, with a slight indentation in the middle (the burgers will contract as they cook, the indentation helps keep the burgers from bulging in the middle too much).",
    "If you want, you can separate the patties with wax paper and store them for a few hours in the fridge before grilling.",
    "2 Prepare your grill for medium high, direct heat. Scrape down the grill grates and coat with vegetable oil. Place the pork patties on the hot grill and paint the top with barbecue sauce. Cover the grill and cook for 5-7 minutes. Flip the burgers and paint with more barbecue sauce.",
    "3 After you'e flipped the burgers, lay the pineapple rings down on a hot part of the grill. Cook the burgers for another 5 to 7 minutes, until cooked through.",
    "Cook the pineapple rings for 3-5 minutes, or until you have nice grill marks on one side. Flip the pineapple and grill another 1-2 minutes.",
    "Remove the pineapple and burgers from the grill and let them rest 5 minutes.",
    "4 While the meat is resting, toast the burger buns on the hot grill until the edges brown nicely, about 1-2 minutes.",
    "To construct the burger, lay some lettuce on the bun, add the burger patty and paint with a little more barbecue sauce. Top with the ham, then the pineapple, then the other bun.",
    "Serve immediately."
  ],
  "ingredients": [
    "0",
    "1 pound ground pork",
    "1/4 cup minced green onion",
    "1/2 teaspoon ground ginger",
    "1/8 teaspoon ground allspice",
    "1/8 teaspoon salt (more to taste, but be careful, the BBQ sauce is salty, as is the ham)",
    "Pinch black pepper",
    "4 pineapple rings, fresh or canned",
    "1/4 cup your favorite barbecue sauce",
    "4 burger buns",
    "4 large lettuce leaves (use leafy lettuce)",
    "1/4 pound thinly sliced ham"
  ],
  "__v": 1
}