{
  "hash": "bdb2ce4e8eedd45dd1f9c67bfd20047ff95fc559",
  "title": "Vegan Mushroom Wellington recipe",
  "image": "https://www.deliciouseveryday.com/wp-content/uploads/2011/09/Vegan-Mushroom-Wellington-thumb-1-5-300x300.jpg",
  "href": "https://www.deliciouseveryday.com/mushroom-wellington/",
  "extension": "Chrome",
  "firstAdded": "2017-07-25T19:29:52.552000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Place a large frying pan over a low to medium-low heat. Add the 1 /2 tbs of olive oil followed by onion and reduce heat to low. Season with salt and pepper and cook, stirring occasionally, for 15 to 20 minutes, until the onions are golden brown. Keep an eye on the onions to make sure they don't catch.",
    "Remove the onions from the pan and return the pan to the heat. Add the baby spinach and cook until wilted. Remove from the baby spinach from the pan and leave to cool.",
    "Increase the heat to medium/high and return the pan to the heat. Add the remaining olive oil and place the mushrooms, top side down. Cook until lightly golden (about 5 minutes) before turning over and cooking for a further 5 minutes or until golden. Remove from the heat, and drain on paper towel top side up as they will release a lot of liquid as they cool. Transfer the onions, spinach and mushrooms to the refrigerator and cool completely.",
    "Preheat the oven to 200 degrees Celsius (390 Fahrenheit). Place a sheet of baking paper on the baking tray and then place the puff pastry sheet on top. Spread half the caramelised onions over the middle third of the pastry, making sure to leave an extra 2cm (3/4 inch) border at the edge of the pastry. Top with half of the baby spinach. Spread the dijon mustard over the mushrooms and season well with salt and pepper. Place the mushrooms on top of the spinach. Top the mushrooms with thyme and the remaining baby spinach and onions.",
    "Very carefully roll the pastry over the top of the mushroom mixture until you have a log. Press down to seal the edges. Roll over the log so that the seam is facing the bottom.",
    "To make the vegan egg wash whisk all of the ingredients together in a bowl. Very lightly coat with the vegan egg wash. Place the pastry in the freezer for 10 minutes before repeating with another layer of vegan egg wash and freezing the pastry for a further 10 minutes.",
    "Place the pastry back on the baking sheet and tray and place in the oven for 30 to 35 minutes, or until golden and flakey."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "4 large portabello mushrooms stalks trimmed and cleaned",
    "3 large onions peeled and chopped",
    "3 tbs olive oil",
    "300 g baby spinach (10 1/2 oz)",
    "4 sprigs of thyme leaves picked",
    "1 vegan puff pastry",
    "1 tbs dijon mustard",
    "salt and pepper to taste",
    "VEGAN EGG WASH",
    "1 tbs aquafaba (chickpea water)",
    "1 tbs almond or cashew milk",
    "1 tsp neutral flavoured oil",
    "1/2 tsp maple syrup or brown rice syrup"
  ],
  "__v": 1
}