{
  "hash": "3faccd62500ef5cbecbcec4577e7457ff0ea2f8c",
  "title": "Lacto-Fermented Cranberry Apple Butternut Relish",
  "image": "http://pixiespocket.com/wp-content/uploads/2014/11/M-Y-E-S-C-A-P-E-682x1024.png",
  "href": "http://pixiespocket.com/2014/11/fermented-cranberry-relish.html",
  "extension": "",
  "firstAdded": "2015-09-27T01:54:39.034000",
  "users": [
    null
  ],
  "keywords": [
    "cranberries",
    "thumb",
    "ginger",
    "firm",
    "apple",
    "butternut",
    "squash",
    "reserve",
    "good",
    "long",
    "slice",
    "peel",
    "cinnamon",
    "star",
    "anise",
    "pods",
    "wide",
    "mouth",
    "jar"
  ],
  "directions": [
    "0",
    "My recipe was fermented in a wide mouth quart jar using the salt brine method of lacto-fermentation. I use Himalayan Sea Salt and the lids and supplies offered by Fermentools, although any fermentation method that you prefer should work.",
    "Pulse the cranberries and ginger together in a food processor or blender to bust up the cranberries a bit but don’t puree it – leave some texture.",
    "Add the cranberries and ginger to the quart jar. I layered mine with the butternut squash and apples so that it would look fancy, but that is totally not required.",
    "Push in the cinnamon stick and star anise pods.",
    "Slide the long strip of butternut squash peel into the jar. The skin has beneficial buggies to help start the fermentation.",
    "Prepare a 2% salt brine, pour into the jar to cover the fruit.",
    "Add the weight to push everything under the brine. (the most important thing!)",
    "Add the Fermentools seal, lid, band, and airlock.",
    "Label the jar, sit back, and let it work its magic.",
    "After one day, the brine should be pinkish from the cranberries. It will continue to darken as the process goes on.",
    "It will take a few days for the bubbles to start in this jar, but once it starts going, beware! I had to change the airlock three times during the fermentation process due to the bubbles forcing the pink brine up into the airlock.",
    "A day or two after bubbles have started to appear, open the lid and taste a piece of fruit to see how you like it – from here on, it is up to you! Taste every few days until you like the texture and flavor of your ferment.",
    "Once you are satisfied, swap out your fermenting lid for a regular storage lid and stick it in the fridge."
  ],
  "ingredients": [
    "0",
    "2 cups cranberries (1 bag)",
    "2 inch thumb of ginger, peeled and minced",
    "1 firm apple, diced",
    "1 cup of peeled butternut squash, diced (reserve one good long slice of peel)",
    "1 cinnamon stick",
    "2 star anise pods",
    "Wide mouth quart jar"
  ],
  "__v": 1
}