{
  "hash": "1455af2d21f3bcf5fef95374bf691c085a6e5dd9",
  "title": "Skillet Chicken with Creamy Cilantro Lime Sauce",
  "image": "http://sallysbakingaddiction.com/wp-content/uploads/2015/07/Skillet-Chicken-with-Creamy-Cilantro-Lime-Sauce-5.jpg",
  "href": "http://sallysbakingaddiction.com/2015/07/08/skillet-chicken-with-creamy-cilantro-lime-sauce/",
  "extension": "Chrome",
  "firstAdded": "2017-06-02T06:08:32.821000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "Preheat oven to 375°F (190°C).",
    "If the chicken breasts are uneven in thickness, pound them down so they're all even. This way all the breasts will cook through similtaneously. Sprinkle each with salt and pepper.",
    "In a large ovenproof skillet, heat the oil over medium-high heat. Add the chicken and cook for 6-7 minutes, turning once. You want the chicken nice and browned on the outside. (It doesn't have to be cooked all the way through yet.) Set chicken on a plate and cover tightly with foil until step 5.",
    "Remove skillet from heat and add the broth, lime juice, onion, cilantro, and red pepper. Return to heat. Cook and stir to scrape up the browned bits from the bottom of the skillet. Bring to a boil. Allow to boil gently, uncovered, for 10 minutes or until the liquid is reduced to around 1/4 cup. (During this time you can steam some veggies to have on the side, like asparagus.) Reduce heat to medium-low, then add the cream and butter. Stir until butter has melted.",
    "Add chicken to the sauce and place the skillet in the preheated oven. Bake uncovered until the chicken is completely cooked through, about 5-10 minutes.",
    "Serve chicken with sauce spooned on top and any of the listed optional garnishes. Leftovers keep well in the refrigerator for a few days. Reheat to your liking.",
    "Recipe Notes:",
    "Adjust the amount of red pepper flakes to your liking. This amount made the chicken mildly spicy. The cream in the sauce mellows out the spice.",
    "You can use whole milk instead, but for the thickest, richest sauce I highly recommend heavy cream. If using whole milk, make sure it is at room temperature to help prevent curdling."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "4 skinless boneless chicken breasts",
    "1/4 teaspoon salt",
    "1/4 teaspoon freshly ground black pepper",
    "1 Tablespoon olive oil",
    "1 cup chicken broth (I recommend reduced sodium)",
    "1 Tablespoon fresh lime juice (I use closer to 1.5 Tbsp)",
    "1/4 cup finely chopped onion",
    "1 Tablespoon chopped cilantro",
    "1/2 teaspoon red pepper flakes1",
    "3 Tablespoons heavy cream2",
    "2 Tablespoons unsalted butter, cubed",
    "optional: lime wedges and more cilantro for garnish, steamed asparagus for serving"
  ],
  "__v": 1
}