{
  "hash": "af48b611169cf1c0b7aefb988d4ced76929c66f7",
  "title": "Lemon sole with chipotle & ancho chilli recado",
  "image": "//cdn.jamieoliver.com/recipe-database/335_448/4clzeE-taZdBLJJ9sO5b3_.jpg",
  "href": "http://www.jamieoliver.com/recipes/fish-recipes/lemon-sole-with-chipotle-ancho-chilli-recado/",
  "extension": "Chrome",
  "firstAdded": "2017-08-29T22:30:35.494000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Method",
    "Preheat the oven to 180ºC/gas 4.",
    "To make the recado, place the unpeeled garlic in a small roasting tin and roast for 15 to 20 minutes, or until the cloves are soft. Transfer to a plate, allow to cool, then remove the skins.",
    "Place the chipotle and ancho chillies in a small bowl. Pour over boiling water to just cover and leave for 15 minutes to soak. Drain in a colander, reserving the liquid.",
    "Place the chillies, garlic, oregano and a large pinch of sea salt in a food processor and blend to a paste. Add the lime juice and 4 tablespoons of the reserved liquid and blitz to combine. Transfer to a non-reactive bowl.",
    "Place the fish in the marinade, cover with clingfilm and refrigerate for 30 minutes.",
    "For the salad, halve the tomatoes and slice the cucumber and spring onions. Halve, destone and roughly chop the avocado. Combine in a bowl with 3 tablespoons of oil and the lime juice. Season well.",
    "Preheat a barbecue or cast-iron griddle pan to a medium heat. Remove the fish from the refrigerator and cook, turning once, for about 3 minutes each side, occasionally adding some more marinade with a brush during cooking.",
    "Divide the fish among plates and serve with the avocado salad and freshly squeezed lime wedges."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "4 lemon sole or dab fillets , skin on, from sustainable sources",
    "1 lime",
    "CHIPOTLE & ANCHO CHILLI RECADO",
    "4 cloves of garlic",
    "2 dried chipotle chillies",
    "2 dried ancho chillies",
    "1½ tablespoon dried oregano",
    "½ a lime",
    "CHUNKY AVOCADO & CHERRY TOMATO SALAD",
    "14 ripe cherry tomatoes",
    "1 Lebanese cucumber",
    "3 spring onions",
    "1 ripe avocado",
    "extra virgin olive oil",
    "1 lime"
  ],
  "__v": 1
}