{
  "hash": "7340d65e80005403287820b13df9a43443224eaa",
  "title": "Roasted Prime Rib with Sauteed Mushrooms and Mom's Creamy Horseradish Sauce",
  "image": "//images.food52.com/28FPVQ1E2DcRyO5pZGxamo3wK-I=/753x502/d923f99c-1b05-45d3-8d0a-ead52e9fe1c4.ROASTED_PRIME_RIB_WITH_SAUTEED_MUSHROOMS_AND_MOM_S_CREAMY_HORSERADISH_SAUCE.jpg",
  "href": "http://food52.com/recipes/14661-roasted-prime-rib-with-sauteed-mushrooms-and-mom-s-creamy-horseradish-sauce?from_related=1&related_src_type=post",
  "extension": "Chrome",
  "firstAdded": "2015-07-24T22:47:54.441000",
  "users": [
    null
  ],
  "keywords": [
    "meat",
    "kosher",
    "salt",
    "black",
    "pepper",
    "garlic",
    "medium",
    "shallots",
    "rosemary",
    "leaves",
    "thyme",
    "olive",
    "oil",
    "standing",
    "roast",
    "trimmed",
    "multiply",
    "divide",
    "recipethis",
    "translates",
    "roughly",
    "rib",
    "people",
    "horseradish",
    "cream",
    "lemon",
    "juice",
    "paprika",
    "cayenne",
    "sauteed",
    "mushrooms",
    "lbs",
    "washed",
    "unsalted",
    "butter",
    "worcestershire",
    "parsley"
  ],
  "directions": [
    "0",
    "MARINATE: In a food processor, place salt, pepper, garlic, shallots, rosemary, thyme, and olive oil. Pulse until combined. Place the roast bone-side down in a large pan and pour the marinade over it. Rub as much as you can into every crevasse. Cover and refrigerate 4-24 hours.",
    "ROAST: Remove the meat and let it come to room temperature, about 1 hour before you plan to put it into the oven. Meanwhile, preheat the oven to 550 and place the rack in the center. Insert a meat thermometer into the thickest part of the roast. When the oven is ready, place the roast, uncovered, into the oven. Immediately reduce the oven temperature to 350. Cook until the thermometer registers 125 degrees, about 15-20 minutes per pound, or 2 1/2 hours for an 8 lb roast. Check the temperature of the meat in several other places. A range of 125-155 will give you a good variety of doneness. Cover the roast with foil and let it rest on the counter at least 15 minutes before carving.",
    "MAKE THE SAUCE : You can do this while the meat cooks. In a medium bowl, beat cream until stiff. With the mixer on, add lemon juice, salt, paprika, cayenne and horseradish. Chill until ready to serve.",
    "SAUTE THE MUSHROOMS: Heat a large skillet over HIGH heat. Add the butter and olive oil. When the butter foams, give the pan a shake and then add the mushrooms, Worcestershire sauce, and garlic. Toss the mushrooms until brown, about 5-10 minutes. Remove from heat and season with salt and pepper to taste. Toss with parsley and then place in a serving dish.",
    "CARVE: Slice the first piece between the ribs, close to the bone. Cut the second piece half way to the next bone and so on and so on giving each person basically half of the meat between the ribs.",
    "SERVE: Top with sauteed mushrooms and whipped horseradish sauce. Garnish with fresh parsley."
  ],
  "ingredients": [
    "0",
    "FOR THE MEAT:",
    "2 tablespoons kosher salt",
    "3 teaspoons ground black pepper",
    "3 cloves garlic",
    "2 medium shallots",
    "2 tablespoons fresh rosemary leaves",
    "2 tablespoons fresh thyme leaves",
    "1/2 cup olive oil",
    "1 ( 8lb) standing rib roast, trimmed (to multiply or divide the recipe,this translates to roughly 1 rib for every 2-3 people)",
    "FOR THE HORSERADISH SAUCE:",
    "1 cup heavy cream",
    "6 tablespoons lemon juice",
    "1/2 teaspoon salt",
    "1/4 teaspoon paprika",
    "1/4 teaspoon cayenne pepper",
    "4 tablespoons grated horseradish",
    "FOR THE SAUTEED MUSHROOMS:",
    "2 lbs mushrooms, washed, dried, and if large, chopped",
    "4 tablespoons unsalted butter",
    "2 tablespoons olive oil",
    "1-2 tablespoons Worcestershire sauce",
    "2 cloves garlic, finely chopped",
    "salt and pepper, to taste",
    "6 tablespoons fresh parsley, chopped"
  ],
  "__v": 1
}