{
  "hash": "428ab11837ef3d62b6de25049f828b4cad4bfeb1",
  "title": "Chocolate-Peanut Butter Granola Bar",
  "image": "",
  "href": "http://www.bhg.com/recipe/chocolate-peanut-butter-granola-bar/",
  "extension": "Chrome",
  "firstAdded": "2016-08-07T15:15:33.998000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 degrees F. Line a 13x9x2-inch baking pan with foil. Coat foil with cooking spray; set aside. Spread oats in a 15x10x1-inch baking pan. Bake for 10 to 15 minutes or until toasted, stirring twice. Remove from oven; let cool. Reduce oven temperature to 300 degrees F.",
    "Meanwhile in a small saucepan combine the corn syrup, peanut butter, brown sugar, butter, and honey. Heat and stir over medium heat just until peanut butter and brown sugar are melted. Remove from heat. Stir in vanilla and salt.",
    "In a large bowl combine the toasted oats, rice cereal, pretzels, wheat germ, and chia seeds. Stir to combine. Pour corn syrup mixture over oat mixture. Stir to combine.",
    "Press oat mixture into the prepared baking dish. Sprinkle chocolate pieces evenly over the top. Press chocolate pieces firmly into oat mixture. Bake for 12 to 15 minutes or until firm. Cool completely in pan on a wire rack.",
    "From the Test Kitchen",
    "TO MAKE AHEAD:",
    "Layer bars between sheets of waxed paper in an airtight container; cover. Store at room temperature for up to 3 days or freeze for up to 3 months."
  ],
  "ingredients": [
    "0",
    "Nonstick cooking spray",
    "1 cup regular rolled oats",
    "1/4cup light-color corn syrup",
    "1/4cup peanut butter",
    "3 tablespoons packed brown sugar",
    "2 tablespoons butter",
    "2 tablespoons honey",
    "1 tablespoon vanilla",
    "1/2teaspoon salt",
    "2 cups crisp rice cereal",
    "3/4cup coarsely broken pretzel sticks",
    "1/4cup toasted wheat germ",
    "2 tablespoons chia seeds",
    "1/4cup miniature semisweet chocolate pieces"
  ],
  "__v": 2
}