{
  "hash": "a86badb2ade9dc797dfd24c61baea45426d9a4bc",
  "title": "chocoladebrood",
  "image": "http://www.xandrabaktbrood.nl/wp-content/uploads/2017/02/Heel-Holland-Bakt-chocoladebrood-21-e1486666682587.jpg",
  "href": "http://www.xandrabaktbrood.nl/brood-2/heel-holland-bakt-chocoladebrood/",
  "extension": "Chrome",
  "firstAdded": "2017-02-21T21:55:57.261000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Bereiding chocoladebrood",
    "1. CACAOMASSA MAKEN",
    "Meng de cacaopoeder, suiker en 50 g water tot een gladde massa.",
    "2. MENGEN EN KNEDEN",
    "Doe de tarwebloem, verse gist, zout (gist en zout niet bij elkaar), de boter of margarine, 280 g water en de cacaomassa in de mengkom van de staande mixer en laat de motor 3 minuten op de laagste stand (stand 2 KitchenAid) draaien tot een samenhangend deeg.",
    "3. GLUTENCHECK",
    "Controleer of het deeg voldoende gluten heeft ontwikkeld door een beetje deeg te pakken en dit met beide handen uit elkaar te trekken, als kauwgum. Kun je het zo dun uittrekken dat je er bijna doorheen kunt kijken en het niet scheurt, dan is het deeg goed.",
    "4. KNEDEN EN VERDELEN",
    "Kneed de chocolade door het deeg. Verdeel het deeg in twee gelijke stukken, gebruik hiervoor een weegschaal.",
    "5. OPBOLLEN",
    "Bol de beide stukken deeg op: vorm op een licht met bloem bestoven werkvlak een langwerpige vorm van het deeg en rol het op. Herhaal dit nogmaals en leg de bol met de mooie, gladde kant naar boven. Breng het deeg mooi op spanning door het deeg met één hand, met je handpalm, naar je toe te rollen. Doe dit heel rustig en zachtjes door met een aaiende beweging tegen de onderkant van de bol deeg te duwen. Controleer: duw zachtjes op de bol, je voelt dat er meer spanning op staat en het deeg zachtjes terugveert.",
    "6. RIJZEN",
    "Dek het deeg af met een licht met tarwebloem bestoven keukendoek. Leg de doek er losjes overheen. Laat het deeg op een tochtvrije plaats ca. 30 minuten rijzen: dit is de bolrijs.",
    "7. OPBOLLEN EN RIJZEN",
    "Bol het deeg nogmaals op: kneed het deeg heel kort, trek het in de lengte uit en rol op. Leg het met de gladde kant naar boven en rol het met je handpalmen naar je toe tot er voldoende spanning op staat. Leg ze op een met bakpapier beklede bakplaat. Dek ze af met de keukendoek en laat 1 uur rijzen: dit is de tweede bolrijs.",
    "8. BAKKEN",
    "Verwarm tijdig de oven voor op 200 °C. Bestuif de broden licht met roggebloem of maizena en bak de chocoladebroden in ca. 25 minuten bruin en knapperig. Verlaag de oventemperatuur naar 180 °C direct nadat je de broden in de oven hebt geschoven.",
    "9. AFKOELEN",
    "Laat de broden na het bakken goed afkoelen op een rooster."
  ],
  "ingredients": [
    "0",
    "BEREIDINGSTIJD: ca. 40 minuten / RIJSTIJD: 1,5 uur / OVENTIJD: 25 minuten",
    "INGREDIËNTEN (2 kleine broden):",
    "35 g cacaopoeder",
    "15 g suiker",
    "50 g + 280 g water",
    "500 g tarwebloem voor brood + extra om te bestuiven",
    "20 g verse gist ( of 7 gr instantgist)",
    "10 g zout",
    "15 g boter of margarine, op kamertemperatuur",
    "150 g chocolade van goede kwaliteit (callets of grof gehakt)",
    "maizena of roggebloem om te bestuiv"
  ],
  "__v": 1
}