{
  "hash": "7deee8038833af70a6e8930da9911a0ccf6ab0af",
  "title": "Mushroom Lentil Loaf",
  "image": "https://i2.wp.com/pumpkinandpeanutbutter.com/wp-content/uploads/2015/02/img_0282.jpg?resize=640%2C960",
  "href": "http://pumpkinandpeanutbutter.com/2015/03/19/mushroom-lentil-loaf/",
  "extension": "Chrome",
  "firstAdded": "2017-07-25T19:25:10.502000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "Step 1",
    "Preheat the oven to 375 degrees and cover a baking sheet in parchment paper or foil. In a small bowl, mix together the glaze ingredients and set aside.",
    "Step 2",
    "In a large pan, drizzle olive oil and sauté diced onion over medium high heat until tender. Add in carrots and celery and cook for 5 minutes on medium heat. Add in the sliced mushrooms and sauté until all the vegetables are tender (5-10 minutes), then remove from heat.",
    "Step 3",
    "Pour the cooked vegetables into a food processor with 1¼ cups of the cooked lentils, ½ cup oats, tomato paste, soy sauce, Worcestershire sauce, thyme, and salt and pepper. Process for just a few seconds until the ingredients are combined, but not completely pureed. You want them to still have a chunky texture. Pour the contents into a large mixing bowl, then add in the rest of the lentils, oats, and almonds meal. Stir the ingredients together until they are completely combined and are sticking together well. If the dough is crumbly, add a tbsp or two of water.",
    "Step 4",
    "Use your hands to form the contents into a large ball, then place the ball onto the covered baking sheet. Form the ball into a loaf shape (mine was about 8-10 inches long and 4-5 inches wide). Cover the loaf with half of the ketchup glaze, then bake for 30 minutes. Pull the loaf out of the over and covered with the remainder of the glaze, then bake for an additional 10-15 minutes. The loaf is done when a form comes out clean. Let it cool for 5-10 minutes before slicing, otherwise it will not cut clean.",
    "Step 5",
    "I served mine with mashed potatoes, but it would be great with any kind of grain, starch, or vegetable on the side!"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 cups green lentils, cooked (about ¾ cup dry green lentils)",
    "2 tbsp olive oil",
    "½ medium yellow onion, diced",
    "½ cup carrots, diced",
    "½ cup celery, diced",
    "8 oz button mushrooms, sliced",
    "2 heaping tbsp tomato paste",
    "2 tbsp soy sauce (or tamari, if gluten free)",
    "1 tbsp Worcestershire sauce (use Annie's Natural brand, if vegan or vegetarian)",
    "1 ¼ tsp thyme",
    "1 cup of old fashioned oats, divided",
    "½ cup almond meal",
    "for the glaze",
    "½ cup organic ketchup",
    "1 tbsp coconut sugar (I used a little less)",
    "1 tsp whole grain dijon mustard",
    "1 tsp apple cider vinegar"
  ],
  "__v": 1
}