{
  "hash": "8273c6b47319cbab29208d1e3cf932c11d803366",
  "title": "Ricotta Dumplings With Asparagus And Green Garlic",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/ricotta-dumplings-with-asparagus-and-green-garlic",
  "extension": "Chrome",
  "firstAdded": "2017-03-29T14:49:01.177000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparation",
    "Dumplings",
    "Check the wetness of the ricotta before preparing dumplings. If the ricotta is sold in an individual drained basket, then all you need to do is pat dry and adjust the quantity to 1½ cups. For ricotta that’s not drained, you’ll need to press it to drain any excess liquid. Line a colander with cheesecloth and set inside a large bowl (to catch the liquid draining from the ricotta). Spoon ricotta onto cheesecloth and put a paper towel on top. Weigh ricotta down using cans or other heavy pantry items; chill for at least 4 hours and up to 24. The ricotta should be dry and crumbly. Measure out 1½ cups.",
    "Pulse ricotta, Grana Padano, egg, egg yolk, and salt in a food processor just until smooth. Sprinkle flour over ricotta mixture and pulse again until just combined. Transfer dumpling batter to a medium bowl.",
    "Dust a parchment-lined rimmed baking sheet generously with flour. Using a metal spoon, scoop out 2–3 tsp. dumpling batter and scrape spoon against side of bowl at a 45° angle to smooth batter. Using your finger tip, push batter off spoon and let drop onto baking sheet (this may take a few tries). The dumpling will slightly curve at each ends. Dust tops with more flour. (You should have about 65 dumplings.)",
    "Asparagus and Assembly",
    "Bring a large pot of lightly salted water to a boil. Add asparagus and cook until almost tender, 2–3 minutes. Transfer to a bowl of ice water; drain and pat dry. Reserve pot.",
    "Meanwhile, bring chicken stock to a simmer in a large skillet over medium heat.",
    "Return pot of water to a gentle simmer and add dumplings (one by one so they don’t crush each other), stirring occasionally, until they’re almost double in size and cooked through and tender, about 4 minutes (dumplings will quickly float to surface).",
    "Transfer dumplings to pan; add butter and green garlic. Cook, tossing often, until sauce has thickened and garlic has slightly softened, about 3 minutes. Add asparagus, chives, and lemon juice and toss to warm asparagus; season with salt and pepper. Serve dumplings with more cheese and drizzle with olive oil.",
    "Do Ahead: Dumplings can be formed 1 month ahead. Freeze on baking sheet, then transfer to resealable plastic bag once frozen. Cook from frozen about 6 minutes."
  ],
  "ingredients": [
    "0",
    "Ricotta Dumplings With Asparagus And Green Garlic",
    "Once you get the hang of it, forming these dumplings is easy, but it may take a little practice at first.",
    "Ingredients",
    "4–6 SERVINGS",
    "Dumplings",
    "2 cups whole-milk ricotta",
    "1 cup finely grated Grana Padano, plus more (for serving)",
    "1 large egg, room temperature",
    "1 egg yolk, room temperature",
    "2¼ teaspoons kosher salt, plus more",
    "¼ cup all-purpose flour, plus more",
    "Asparagus And Assembly",
    "8 ounces asparagus, trimmed, cut into 1-inch pieces",
    "2 cups chicken stock or low-sodium chicken broth",
    "1 green garlic stalk, pale green and white parts, thinly sliced crosswise",
    "3 tablespoons unsalted butter, cut into pieces",
    "2 tablespoons chopped chives",
    "2 teaspoons fresh lemon juice",
    "Kosher salt, freshly ground pepper",
    "Olive oil (for drizzling)"
  ],
  "__v": 1
}