{
  "hash": "df4122cd0ba2efbef9cdce73a794307a067a5936",
  "title": "Sticky tamarind chicken with soured cream dip",
  "image": "http://realfood.tesco.com/media/images/Sticky-chicken-wings-1-LGH-441945f8-b2ec-402d-96c1-12c4de84efc9-0-1400x919.jpg",
  "href": "http://realfood.tesco.com/recipes/sticky-tamarind-chicken-with-soured-cream-dip.html",
  "extension": "Chrome",
  "firstAdded": "2015-12-17T16:11:21.048000",
  "users": [
    null
  ],
  "keywords": [
    "tamarind",
    "dark",
    "soft",
    "brown",
    "sugar",
    "soy",
    "clear",
    "honey",
    "olive",
    "oil",
    "ginger",
    "garlic",
    "chilli",
    "chicken",
    "wings"
  ],
  "directions": [
    "0",
    "Chicken wings are the ultimate sharing dish so rustle up a platter of these gorgeously sticky, sweet wings for friends and family to tuck into. Tamarind, soy, ginger and chilli combine to make a puncy marinade that gives succulent, juicy chicken - the ideal Bonfire Night party idea.",
    "In a dish, combine the tamarind, sugar, soy, honey, oil, ginger, garlic and chilli. Add the chicken and turn to coat. Cover and chill for at least 1 hour or overnight. Preheat the oven to gas 6, 200°C, fan 180°C. Remove the chicken wings from the marinade and arrange in a roasting tin; season well. Cook for 25 minutes, turning halfway and basting with any leftover marinade, until cooked through with no pink meat showing.",
    "Alternatively, cook the wings on the barbecue (the coals should be white-hot with no trace of flame – this takes about an hour with traditional coals) for 20-25 minutes, turning frequently and basting with the leftover marinade, until cooked through.",
    "Meanwhile, mix the dip ingredients in a small bowl; season. Set aside. Scatter the wings with the extra coriander sprigs. Serve with the dip and lime wedges for squeezing over."
  ],
  "ingredients": [
    "0",
    "3 tbsp tamarind paste",
    "2 tbsp dark soft brown sugar",
    "2 tbsp soy sauce",
    "3 tbsp clear honey",
    "1 tbsp olive oil",
    "5cm (2in) piece fresh ginger, grated",
    "2 garlic cloves, crushed or grated",
    "1 tsp chilli flakes",
    "12 chicken wings"
  ],
  "__v": 2
}