{
  "hash": "1173dd069210d49fd5f155f70db5cc94cf6e4960",
  "title": "Mint Chocolate Chip Ice-Cream (Keto and Dairy-free)",
  "image": "http://ketodietapp.com/Blog/image.axd?picture=%2f2014%2f05%2fMintChocChip10.jpg",
  "href": "http://ketodietapp.com/Blog/post/2014/05/01/Mint-Chocolate-Chip-Ice-Cream-(Keto-and-Dairy-free)",
  "extension": "Chrome",
  "firstAdded": "2015-10-11T04:51:22.300000",
  "users": [
    null
  ],
  "keywords": [
    "coconut",
    "milkalmond",
    "milk",
    "erythritollowcarb",
    "sweetener",
    "list",
    "vanilla",
    "extractrecipe",
    "herevanilla",
    "bean",
    "peppermint",
    "dark",
    "chocolatedark",
    "chocolate"
  ],
  "directions": [
    "0",
    "Halve the avocado and scoop the pulp in a bowl. Very ripe avocados work best!",
    "Add coconut milk, mint, powdered Erythritol and stevia. I keep my coconut milk in the fridge, so it creamed but it's not required in this recipe.",
    "You can use heavy whipping cream or almond milk instead of the coconut milk.",
    "Add vanilla and peppermint extracts...",
    "Adding alcohol-based extracts prevents the ice-cream from getting too hard.",
    "... and blend until smooth. Place the mixture into the ice-cream maker and process according to the manufacturer's instructions. It may take anything between 30-60 minutes depending on your ice-cream maker.",
    "If you don't have an ice-cream maker, freeze the coconut milk (or cream) and blend with the rest of ingredients (apart from the chocolate chips). Then, add the chocolate chips and mix with a spoon.",
    "Meanwhile, chop the dark chocolate into small pieces or use chocolate chips.",
    "When the ice-cream is done, add the chocolate and mix with a spatula to distribute it evenly. Place in the freezer for 30-60 minutes if the ice-cream is too soft.",
    "Enjoy immediately or transfer into single-serving containers and keep in the freezer.",
    "Ice-cream straight from the freezer may be too hard but you know the trick. Microwave for 10-20 seconds or leave at room temperature for 20-30 minutes before serving!"
  ],
  "ingredients": [
    "0",
    "coconut milkalmond milk",
    "Erythritollow-carb sweetener from this list",
    "vanilla extractrecipe herevanilla bean",
    "peppermint extract",
    "peppermint extract",
    "dark chocolatedark 85% chocolate"
  ],
  "__v": 1
}