{
  "hash": "bff414d72280848ed4c3c303a35181bb35215633",
  "title": "Paleo Cinnamon Rolls",
  "image": "http://blog.paleohacks.com/wp-content/uploads/2015/07/cinnamon-roll-recipe.jpg",
  "href": "http://blog.paleohacks.com/paleo-cinnamon-rolls/",
  "extension": "Chrome",
  "firstAdded": "2016-01-08T14:52:00.181000",
  "users": [
    null
  ],
  "keywords": [
    "almond",
    "flour",
    "coconut",
    "baking",
    "soda",
    "oil",
    "egg",
    "honey",
    "vanilla",
    "palm",
    "sugar",
    "cinnamon",
    "cashews",
    "soaked",
    "boiling",
    "water",
    "hour",
    "maple",
    "syrup"
  ],
  "directions": [
    "0",
    "How To Make It:",
    "1. Preheat oven to 350°F and grease a pie dish with coconut oil.",
    "2. To prepare the cinnamon rolls: In a large bowl combine almond flour, coconut flour, baking soda, coconut oil, egg, honey, and 1 t vanilla extract until smooth. Place the dough in the freezer for 10 minutes to harden slightly.",
    "3. Place the dough on a sheet of wax paper and cover with another sheet of wax paper. Using a rolling pin, roll the dough out into an 8 in. x 12 in. rectangle.",
    "4. Sprinkle the coconut sugar over the rolled out dough and generously sprinkle with the cinnamon. Using the wax paper to help, roll the dough tightly into a log and seal the end. Place the log in the freezer for another 10 minutes to harden (this will make cutting the rolls easier.)",
    "5. Take the log out of the freezer and cut into 8 equal rolls. Place the rolls in the pie dish, with one in the center and the others around it. Bake for 15-20 minutes until golden brown. Allow the rolls to cool slightly before drizzling with the glaze.",
    "6. To prepare the glaze: Place the drained cashews, maple syrup, water, remaining coconut oil, and vanilla in a blender, and blend until smooth. Drizzle the glaze over the cooked cinnamon rolls and enjoy!"
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "1 1/2 cups almond flour",
    "1 T coconut flour",
    "1 t baking soda",
    "2 T coconut oil, melted",
    "1 egg",
    "1 T honey",
    "1 t vanilla extract",
    "1/4 cup coconut palm sugar",
    "1 T cinnamon",
    "1/3 cup cashews, soaked in boiling water for 1 hour and drained",
    "2 T maple syrup",
    "2 T water",
    "1 T coconut oil, melted",
    "1/4 t vanilla extract"
  ],
  "__v": 1
}