{
  "hash": "b947d183eab470dac22936e4bda3e4cf32c441d5",
  "title": "Fettuccine with Walnuts and Parsley",
  "image": "//food.fnr.sndimg.com/content/dam/images/food/fullset/2018/2/16/0/FN_Ellie-Krieger-Fettuccini-Walnuts-Parsley-H-107_s4x3.jpg.rend.hgtvcom.826.620.suffix/1518807192836.jpeg",
  "href": "https://www.foodnetwork.com/recipes/ellie-krieger/fettuccine-with-walnuts-and-parsley-recipe-1953057",
  "extension": "Chrome",
  "firstAdded": "2019-06-18T12:21:10.751000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cook the pasta al dente according to package directions, then drain in a colander.",
    "Meanwhile, toast the walnuts in a small dry skillet over medium-high heat until fragrant, stirring frequently, 3 to 5 minutes.",
    "In the pot the pasta was cooked in, heat the olive oil over low heat, add the garlic stirring until soft and fragrant, 3 to 4 minutes (be careful not to burn it). Return the pasta to the pot, add the broth, all but 2 tablespoons of the walnuts, the parsley, salt and pepper and toss to combine, cooking over low heat for 1 to 2 minutes. Add 1/2 cup Parmesan and toss to combine. Arrange 1/2 cup of arugula leaves on each of 4 serving plates. Top each with about 2 cups of pasta. Sprinkle with remaining cheese, the reserved walnuts and more parsley. Serve hot.",
    "Excellent source of: Protein, Fiber, Vitamin A, Vitamin C, Vitamin K, Iron, Manganese",
    "Good source of: Folate, Copper, Magnesium, Calcium"
  ],
  "ingredients": [
    "0",
    "12 ounces (3/4 box) whole-wheat fettuccine",
    "2/3 cup chopped toasted walnuts, 2 tablespoons reserved for garnish",
    "1/4 cup olive oil",
    "5 cloves garlic, minced",
    "1/2 cup low-sodium chicken stock",
    "1/2 cup chopped parsley leaves, plus more for garnish",
    "1/2 teaspoon salt",
    "1/2 teaspoon fresh ground black pepper",
    "1 ounce grated Parmesan (about 3/4 cup)",
    "2 cups arugula leaves, gently packed"
  ],
  "__v": 1
}