{
  "hash": "c91bf86443b0d7790b3284085b076a03c0ed8613",
  "title": "BBQ BACON CHEESE BALL\nAll you need are 6 ingredients to make this delicious, sweet and savory BBQ Bacon Cheese Ball!",
  "image": "http://www.gimmesomeoven.com/wp-content/uploads/2014/12/BBQ-Bacon-Cheese-Ball-4.jpg",
  "href": "http://www.gimmesomeoven.com/bbq-bacon-cheeseball/",
  "firstAdded": "2015-02-25T16:51:48.132000",
  "users": [
    null
  ],
  "keywords": [
    "strips",
    "bacon",
    "crisplycooked",
    "green",
    "onions",
    "brick",
    "cream",
    "cheese",
    "used",
    "lowfat",
    "softened",
    "sharp",
    "cheddar",
    "bbq",
    "storebought",
    "salt",
    "pepper",
    "pecans"
  ],
  "directions": [
    "0",
    "DIRECTIONS:",
    "Add half of the bacon, half of the green onions, cream cheese, cheddar cheese and bbq sauce to a large mixing bowl. Stir together until evenly combined. Taste the mixture and season with a pinch of salt and pepper if needed, stirring the mixture once more to incorporate it.",
    "Transfer the mixture to the center of a large sheet of plastic wrap. Form into a ball and wrap tightly with the plastic wrap. Refrigerate (or freeze) for at least 1-2 hours, or until mostly firm.",
    "Add the remaining bacon, green onions and pecans to a large plate, and use your fingers to combine them. Unwrap the cheese ball and place it in the center of the plate. Then gently roll the ball around until it is coated with the bacon mixture.",
    "Serve immediately with crackers or vegetable sticks for dipping. Or wrap and refrigerate the cheese ball again until you are ready to serve it."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS:",
    "6 strips of bacon, crisply-cooked, drained and diced",
    "4 green onions, thinly sliced",
    "1 (8-ounce) brick of cream cheese (I used low-fat), softened",
    "1 cup shredded sharp cheddar cheese",
    "1/3 cup bbq sauce, homemade or store-bought",
    "(salt and pepper)",
    "1/4 cup chopped pecans, toasted"
  ],
  "__v": 1
}