{
  "hash": "0807c28885f64f211e322e994db8d159e7bbb802",
  "title": "Merguez Sausages",
  "image": "http://www.canadianliving.com/img/photos/biz/resized/600x400/600x400_MerguezSausage1410534508.jpg",
  "href": "http://www.canadianliving.com/food/merguez_sausages.php",
  "extension": "Chrome",
  "firstAdded": "2016-03-06T12:30:35.318000",
  "users": [
    null
  ],
  "keywords": [
    "boneless",
    "lamb",
    "shoulder",
    "chunks",
    "garlic",
    "harissa",
    "salt",
    "fennel",
    "seeds",
    "coriander",
    "cumin",
    "sumac",
    "pepper",
    "cayenne",
    "pork",
    "sausage",
    "casings",
    "ice",
    "water",
    "approx"
  ],
  "directions": [
    "0",
    "In bowl, combine lamb, garlic, harissa, salt, fennel seeds, coriander, cumin, sumac, pepper and cayenne pepper. Cover and refrigerate overnight. (Make-ahead: Refrigerate for up to 24 hours.) Using stand mixer with meat grinder attachment fitted with coarse screen, grind lamb mixture. Cover and refrigerate until well chilled, about 3 hours. Meanwhile, rinse casings; soak in cold water for 30 minutes. Using stand mixer with meat grinder attachment fitted with medium screen, grind lamb mixture. If needed, sprinkle with up to 1/2 cup ice water to keep mixture moist. Load pork casings onto large nozzle attachment of stand mixer (use small nozzle for lamb casings). Using attachment, fill casings with lamb mixture, twisting into 5-inch (12 cm) links. Prick sausages all over with toothpick. Arrange on baking sheet; refrigerate for 1 hour. Cut into links. Place sausages on greased grill over medium heat; close lid and grill, turning once, until browned and juices run clear when sausage is pierced or instant-read thermometer inserted in centre of several reads 160F (71C), about 18 minutes. (Alternatively, in skillet, heat 1 tsp olive oil over medium-high heat; cook sausages until browned all over. Reduce heat to medium; cook, turning occasionally until juices run clear when sausage is pierced or instant-read thermometer inserted in centre of several reads 160F/71C, 15 to 18 minutes.)",
    "Tip from The Test Kitchen: Reserve any leftover lamb mixture to make patties or meatballs.",
    "If using porl casings, load them onto the large nozzle attachment. If using lamb casings, load them onto the small nozzle attachment. To avoid any air pockets when filling your casings, make sure the meat mixture has reached the tip of the nozzle before you tie your knots."
  ],
  "ingredients": [
    "0",
    "1.35 kg boneless lamb shoulder, cut in 2-inch (5 cm) chunks",
    "6 cloves garlic, chopped",
    "4 tsp (18 mL) (18 mL) harissa paste",
    "1-3/4 tsp (9 mL) (9 mL) salt",
    "1-1/2 tsp (7 mL) (7 mL) ground fennel seeds",
    "1 tsp (5 mL) (5 mL) each ground coriander, ground cumin, ground sumac and pepper",
    "1/2 tsp (2 mL) (2 mL) cayenne pepper",
    "Pork sausage casings, (or lamb sausage casings)",
    "1/2 cup (125 mL) (125 mL) Ice water, (approx)"
  ],
  "__v": 2
}