{
  "hash": "cdd80c0c3aeef0a9190b7d435d5fb6f56685a7a8",
  "title": "Chicken Arrabbiata",
  "image": "http://www.budgetbytes.com/wp-content/uploads/2014/02/Chicken-Arrabbiata-above.jpg",
  "href": "http://www.budgetbytes.com/2014/02/chicken-arrabbiata/",
  "extension": "Chrome",
  "firstAdded": "2016-08-21T14:03:52.242000",
  "users": [
    null,
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Season the chicken thighs with a pinch of salt and pepper, then dredge each piece in flour until they are lightly coated.",
    "Heat the olive oil in a large skillet over medium heat. When the oil is hot (it will sizzle if a pinch of flour is dropped into the oil), add the chicken. Brown the chicken on both sides (5-7 minutes each side), then remove the chicken from the skillet. While the chicken is browning, mince the garlic.",
    "After the chicken is removed from the skillet, add the minced garlic and sauté briefly (1-2 minutes, or just until the garlic is soft, but not brown). Add both cans of tomatoes with juices, basil, crushed red pepper, and chicken broth to the skillet. Stir to combine.",
    "Return the chicken to the skillet with the sauce, and spoon some sauce over top of each piece. Allow the sauce to come up to a simmer. Simmer the chicken in the sauce for 30 minutes, turning the chicken over half way through to make sure both sides receive adequate heat.",
    "Serve the chicken and sauce over cooked pasta and garnish with roughly chopped parsley."
  ],
  "ingredients": [
    "0",
    "2 Tbsp olive oil $0.32",
    "6 bone-in chicken thighs (2.5 lbs.) $3.99",
    "Pinch salt & pepper $0.05",
    "⅓ cup all-purpose flour (for dredging) $0.08",
    "4 cloves garlic $0.32",
    "1 (15 oz.) can diced tomatoes $0.69",
    "1 (15 oz.) can crushed tomatoes $0.69",
    "½ tsp dried basil $0.05",
    "¼ tsp crushed red pepper (or more to taste) $0.03",
    "½ cup chicken broth $0.07",
    "Handful parsley (for garnish, optional) $0.14",
    "12 oz. pasta for serving $1.41"
  ],
  "__v": 2
}