{
  "hash": "120b365b46a8ba933f2ccc4ef65018d600858e94",
  "title": "Tomato Herb Rice with White Beans and Spinach",
  "image": "http://www.budgetbytes.com/wp-content/uploads/2016/10/Tomato-Herb-Rice-with-White-Beans-and-Spinach-V.jpg",
  "href": "http://www.budgetbytes.com/2016/10/tomato-herb-rice-with-white-beans-and-spinach/",
  "extension": "Chrome",
  "firstAdded": "2016-10-03T17:56:38.838000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place the spinach in a bowl and allow it to thaw slightly as you prepare the beginning of the dish. Dice the onion and mince the garlic.",
    "Add the olive oil to a heavy bottomed pot or deep skillet along with the minced garlic, oregano, basil, thyme, rosemary, a pinch of crushed red pepper, and a little freshly cracked black pepper (about 10 cranks of a pepper mill). Sauté the spices over medium-low heat for about one minute.",
    "Add the tomato paste and brown sugar to the pot and continue to sauté for 2-3 minutes, or until the tomato paste takes on a deep burgundy color. Add the onion and salt and continue to sauté for a few minutes more, or until the onions become soft and transparent.",
    "Meanwhile, drain and rinse the cannellini beans in a colander. Add the diced tomatoes (with juices), cannellini beans, spinach, and uncooked rice to the pot. Pour in the vegetable broth and stir briefly to combine the ingredients.",
    "Place a lid on the pot and turn the heat up to medium-high. Allow the contents to come up to a boil. Once it reaches a boil, turn the heat down to the lowest setting that allows the liquid to maintain a simmer. Let the pot simmer for 15-20 minutes, or until most of the liquid is absorbed (there may still be some around the edges. Turn the heat off and let the pot rest, undisturbed, for 10 additional minutes.",
    "Finally, fluff the contents of the pot with a fork, making sure to not stir vigorously. Serve immediately."
  ],
  "ingredients": [
    "0",
    "2 Tbsp olive oil $0.22",
    "2 cloves garlic $0.16",
    "½ tsp oregano $0.05",
    "½ tsp basil $0.05",
    "¼ tsp thyme $0.03",
    "¼ tsp rosemary $0.03",
    "Pinch of crushed red pepper $0.02",
    "Freshly cracked black pepper $0.05",
    "3oz. tomato paste (about ¼ cup) $0.33",
    "½ tsp brown sugar $0.02",
    "¼ tsp salt $0.02",
    "1 small yellow onion $0.25",
    "15oz. can fire roasted diced tomatoes $1.50",
    "15oz. can cannellini beans $1.29",
    "¼ lb. frozen chopped spinach $0.43",
    "1 cup uncooked long grain white rice $0.48",
    "1.5 cups vegetable broth* $0.19"
  ],
  "__v": 1
}