{
  "hash": "7d03a4a0be5789e515930071a3a6da8411488448",
  "title": "Chipotle Brisket Sandwich on a Cheddar Biscuit",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/chipotle-brisket-sandwich-on-a-cheddar-biscuit.html",
  "firstAdded": "2015-01-24T16:08:46.936000",
  "users": [
    null
  ],
  "keywords": [
    "yellow",
    "onions",
    "beef",
    "brisket",
    "pointcut",
    "flatcut",
    "kosher",
    "salt",
    "black",
    "pepper",
    "garlic",
    "ale",
    "oil",
    "jalepenos",
    "chipotle",
    "peppers",
    "adobo",
    "pureed",
    "granulated",
    "smoked",
    "paprika",
    "allpurpose",
    "flour",
    "dusting",
    "baking",
    "soda",
    "cold",
    "unsalted",
    "cubes",
    "butter",
    "brushing",
    "cheddar",
    "buttermilk",
    "storebought",
    "guacamole",
    "mayonnaise",
    "lemon",
    "juice",
    "slices",
    "white"
  ],
  "directions": [
    "0",
    "For the brisket: Preheat the oven to 275 degrees F.",
    "Lay the sliced onions in the bottom of a roasting pan. Place the brisket on top of the onions and season with salt and pepper. Top with the garlic cloves and ale. Cover tightly with foil and roast until tender, 5 to 6 hours. Loosen the cover and let cool to room temperature.",
    "Heat the vegetable oil in a large saute pan over medium heat. Add the jalapeno and diced onion and cook until tender, 8 to 10 minutes. Add the pureed chipotle peppers and cook until warmed through, about 2 minutes. Remove from the heat and let cool to room temperature.",
    "Remove any excess fat from the cooled brisket with a spatula. Slice the brisket across the grain into 1 1/2-inch-thick pieces and gently pull the meat apart by hand. Place the meat in a large bowl and season with the granulated garlic, paprika, 1 teaspoon pepper and 2 teaspoons salt. Add the cooked onion and jalapeno mixture and toss gently to combine.",
    "For the biscuits: Increase the oven temperature to 375 degrees F and line a baking sheet with parchment paper.",
    "Combine the flour, baking powder, baking soda and salt in a large bowl. Cut in the 2 sticks of cold butter until the mixture is crumbly, being careful not to overmix. Add the Cheddar. Add the buttermilk a little at a time, just until the mixture is combined and moist. Turn the mixture out onto a lightly floured surface. Gently roll or press the dough into a 1-inch-thick rectangle. Cut the dough into 4-by-4-inch squares or use a large biscuit cutter, place on the baking sheet and brush with the melted butter. Bake until golden brown, about 45 minutes. Brush with additional melted butter while the biscuits are still warm. Set aside.",
    "For the chipotle sauce: Combine the guacamole, mayonnaise, chipotle peppers and lemon juice in a medium bowl and mix well. Season with salt, cover and refrigerate.",
    "To serve: Heat the butter in a large saute pan over medium heat. Add the onions and cook, stirring occasionally, until deep golden brown, about 20 minutes.",
    "Preheat the oven to 350 degrees F.",
    "Loosely wrap the biscuits in foil and place in the oven until warm. For each sandwich, place 6 to 8 ounces of the brisket mixture in a small saute pan. Heat until very warm, stirring so the brisket does not brown. Turn off the heat and top with 1 slice of Cheddar and some caramelized onions. Cover the pan until the cheese melts. Cut the warm biscuit in half lengthwise and fill with the brisket mixture. Top with the desired amount of chipotle sauce and serve.",
    "Professional Recipe: This recipe was provided by a chef, restaurant or culinary professional and makes a large quantity. The Food Network Kitchens chefs have not tested this recipe in the proportions indicated and therefore cannot make any representation as to the results.",
    "Recipe courtesy of Kounty Quarthouse, South Range, WI"
  ],
  "ingredients": [
    "0",
    "4 yellow onions, 2 sliced and 2 finely diced",
    "One 4-pound beef brisket (point-cut or flat-cut)",
    "Kosher salt and freshly ground black pepper",
    "12 cloves garlic, peeled",
    "6 cups ale",
    "2 tablespoons vegetable oil",
    "4 large jalepenos, minced",
    "3 to 4 chipotle peppers in adobo sauce, pureed",
    "2 tablespoons granulated garlic",
    "1 tablespoon smoked paprika",
    "3 cups all-purpose flour, plus more for dusting",
    "1 tablespoon baking powder",
    "1 teaspoon baking soda",
    "1 teaspoon kosher salt",
    "1 cup (2 sticks) cold unsalted butter, cut into small cubes, plus more melted butter, for brushing",
    "1 1/2 cups shredded Cheddar",
    "1 1/2 to 2 cups buttermilk",
    "1 cup homemade or store-bought guacamole",
    "1/2 cup mayonnaise",
    "3 to 4 chipotle peppers in adobo sauce, pureed",
    "1/4 cup lemon juice",
    "Kosher salt",
    "2 tablespoons unsalted butter",
    "2 yellow onions, sliced",
    "6 to 8 slices white or yellow Cheddar"
  ],
  "__v": 1
}