{
  "hash": "19eef431d819670b4f575737657a3328c7072039",
  "title": "Milk-Braised Pork with Fried-Herb Salsa\nRecipe from the Tasting Table Test Kitchen\nYield: 6 to 8 servings Prep Time: 30 minutes, plus marinating time Cook Time: 3 hours and 30 minutes Total Time: 4 hours, plus marinating time",
  "image": "",
  "href": "http://www.tastingtable.com/entry_detail/national/17991/recipes_home/How_to_Make_Milk_Braised_Pork_with_Fried_Herb_Salsa.htm",
  "firstAdded": "2015-02-09T23:15:06.681000",
  "users": [
    null
  ],
  "keywords": [],
  "directions": [
    "0",
    "Make the pork: Place the pork on a clean work surface and season generously with salt and half the sage and rosemary. Wrap in plastic and marinate overnight in the refrigerator.",
    "Preheat the oven to 350°. Take the pork out of the refrigerator a few hours before cooking to take the chill off; remove and discard the sage and rosemary. Heat the olive oil in a large Dutch oven over medium-high heat. When the oil is hot, add the meat and cook, working in two batches so as to not overcrowd, until the meat is a deep golden brown on all sides, about 30 minutes. Transfer the meat to a plate and pour any excess grease out of the pot. Place the meat back in the pot and add the milk, bay leaf, lemon zest, garlic and remaning sage and rosemary. Cover the pan and bake on the center rack, turning the meat occasionally until the pork is tender and the milk has curdled and becomes golden brown, about 2½ to 3 hours.",
    "Meanwhile, make the fried-herb sauce: In a small saucepan over medium heat, pour enough oil until it reaches a depth of 1 inch. When the oil is hot, fry the herbs in batches until just crisp, about 40 to 45 seconds. Remove using a slotted spoon and transfer to a paper-lined plate. Season with salt and set aside.",
    "In a mortar and pestle or using your knife, pound the garlic into a paste. Add the lemon zest and lemon juice and allow to sit for 5 minutes. Add the fried herbs and gently pound the herbs until they have just broken down. Stir in the olive oil and set aside.",
    "To serve, slice the pork and serve with the fried-herb salsa and crushed red pepper flakes."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS"
  ],
  "__v": 1
}