{
  "hash": "fe6d28b637b11dbd594626b94c5f6f7ee651d00d",
  "title": "TEMPEH COCONUT CURRY WITH CAULIFLOWER RICE",
  "image": "http://llbalanced.com/wp-content/uploads/2014/12/curry.jpg",
  "href": "http://llbalanced.com/recipes/tempeh-coconut-curry-cauliflower-rice/",
  "extension": "Chrome",
  "firstAdded": "2015-05-18T10:45:49.996000",
  "users": [
    null
  ],
  "keywords": [
    "curry",
    "extravirgin",
    "olive",
    "oil",
    "divided",
    "cubes",
    "used",
    "westsoy",
    "brand",
    "medium",
    "yellow",
    "onion",
    "dice",
    "garlic",
    "turmeric",
    "salt",
    "garbanzo",
    "beans",
    "rinsed",
    "sugar",
    "light",
    "coconut",
    "milk",
    "organic",
    "lowsodium",
    "broth",
    "extra",
    "sauting",
    "tempeh",
    "broccoli",
    "andor",
    "brussels",
    "sprouts",
    "recipe",
    "cauliflower",
    "rice",
    "head",
    "stem",
    "roughly",
    "pieces",
    "grassfed",
    "butter",
    "sub",
    "vegan",
    "shocked",
    "raw",
    "florets",
    "bite",
    "sized",
    "approx",
    "bottoms",
    "bowl",
    "filled",
    "ice",
    "water",
    "colander"
  ],
  "directions": [
    "0",
    "urry",
    "Heat a large skillet to medium-high. Add 2 tablespoons olive oil. When oil is shimmering (not smoking!), add tempeh.",
    "Sauté tempeh, stirring infrequently, allowing it to brown on all sides. If the tempeh is sticking, add water or vegetable stock as needed.",
    "Remove tempeh from pan and set aside.",
    "Add 2 more tablespoons olive oil. When oil is shimmering, add onions and cook until translucent. Add garlic, curry powder, turmeric and salt.",
    "Sauté another 30-40 seconds until the garlic and curry are fragrant.",
    "Add garbanzo beans, coconut sugar, coconut milk, vegetable broth and seared tempeh.",
    "Stir mixture and turn head to medium-low. Allow to simmer for 15 minutes, covered.",
    "Stir in vegetables and simmer another 2 minutes.",
    "Add salt to taste. Serve over cauliflower rice.",
    "Cauliflower Rice",
    "Add cauliflower florets to a food processor and process until you achieve the texture of rice. Only fill the processor ½ full, or you will make a mash instead. Process in batches if necessary.",
    "Add cauliflower to a medium skillet or sauté pan and heat to medium. When cauliflower is warmed through (approximately 3-4 minutes), add salt, butter and olive oil.",
    "Stir until butter is melted. Allow to cook another 10 minutes, stirring frequently. The goal is to cook the “rawness” out of the cauliflower but not brown it.",
    "Add salt to taste and serve below Tempeh Coconut Curry."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "Curry",
    "¼ cup extra-virgin olive oil divided1 8 ounce package organic tempeh cut into 1 inch cubes, I used Westsoy Brand1 medium sweet yellow onion small dice3 cloves garlic minced1 tablespoon curry powder½ teaspoon turmeric2 teaspoons salt plus more to taste1 15 ounce can organic garbanzo beans rinsed and drained2 tablespoons coconut sugar1 15 ounce can light organic coconut milk1 cup organic low-sodium vegetable broth plus extra for sautéing tempeh3 cups blanched broccoli and/or Brussels sprouts recipe below",
    "Cauliflower Rice",
    "1 large head cauliflower rinsed, stem removed and cut roughly into 2-3 inch pieces1/2 teaspoon sea salt1 tablespoon olive oil1 tablespoon organic grass-fed butter sub more olive oil for vegan",
    "Blanched and Shocked Vegetables",
    "1 teaspoon sea salt1 ½ cups raw broccoli florets chopped into bite sized pieces (approx. 1 ½ inches)1 ½ cups Brussels sprouts bottoms removed and sliced in half1 large bowl filled with ice water1 colander"
  ],
  "__v": 1
}