{
  "__v": 1,
  "directions": [
    "0",
    "Make Filling:",
    "1. Heat oil in a large pan (12″) on medium heat. Add onions and cook for 2 minutes.",
    "2. Add garlic and stir for another minute.",
    "3. Add tomato paste and allow to brown a little, approximately 2 minutes.",
    "4. Add poblanos and stir for another minute.",
    "5. Add ground beef and stir with a wooden spoon, trying to break up any clumps. Cook until there are no more pink spots, approximately 6-8 minutes.",
    "6. Add cumin, chili powder, tomato vinegar, dried cilantro, and salt. Stir.",
    "7. Simmer on low heat for 10 minutes. Most of the liquid should be evaporated by now. Turn off the heat and let it cool to room temperature.",
    "Making Empanadas:",
    "1. Put oven racks in upper and lower thirds of the oven. Preheat oven to 400 degrees F (375 degrees F with convection).",
    "2. Divide the dough into 12 equal pieces. While the remaining dough remains covered, roll out one piece on a lightly floured surface. Shoot for a 5 inch round about 1/8 inch thick.",
    "3. Spoon two rounded tablespoons of filling onto the dough and fold in half. Press the edges securely together, decoratively if you wish. Transfer to un-greased baking sheet.",
    "4. Make the rest of the empanadas the same way and brush with egg wash.",
    "5. Bake for 25 minutes, rotating baking sheets in the middle. Cool for 5 minutes before serving."
  ],
  "firstAdded": "2014-08-16T22:09:24.389000",
  "hash": "f1aff81adb6e537459e145a17107d1e69e33d250",
  "href": "http://www.foodmayhem.com/2008/07/beef-and-poblano-empanadas.html",
  "image": "http://farm4.static.flickr.com/3046/2712325642_88d6968a3f.jpg",
  "ingredients": [
    "0",
    "1 tablespoon canola oil",
    "1 1/2 cup chopped onion",
    "1 tablespoon chopped garlic",
    "1 tablespoon tomato paste",
    "1 roasted poblano, cleaned and chopped",
    "1 lb 7 oz ground beef",
    "1 tablespoon cumin",
    "1 tablespoon chili powder",
    "1 tablespoon tomato vinegar",
    "1 teaspoon dried cilantro",
    "salt to taste",
    "1 egg lightly beaten with 1 tablespoon of water for egg wash"
  ],
  "keywords": [
    "canola",
    "oil",
    "onion",
    "garlic",
    "tomato",
    "roasted",
    "poblano",
    "cleaned",
    "beef",
    "cumin",
    "chili",
    "vinegar",
    "cilantro",
    "salt",
    "lightly",
    "water",
    "egg",
    "wash"
  ],
  "title": "Beef and Poblano Empanadas",
  "users": [
    null
  ]
}