{
  "hash": "aa45c5ad0b74eba5110020285339238b62a64817",
  "title": "Apple butter cake",
  "image": "http://www.chocolatemoosey.com/wp-content/uploads/2015/09/Caramel-Apple-Butter-Layer-Cake-8568.jpg",
  "href": "http://www.chocolatemoosey.com/2015/09/10/caramel-apple-butter-layer-cake/",
  "extension": "Chrome",
  "firstAdded": "2016-09-08T14:22:37.275000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350F. Line the bottom of two 8-inch round cake pans (1 1/2 inches deep) with parchment paper then lightly grease with cooking spray.",
    "In a large bowl, mix together the flour, baking powder, baking soda, cinnamon, nutmeg, and salt.",
    "In a large mixing bowl, beat together on medium speed the oil, sugar, and brown sugar until combined. Beat in the eggs, one at a time, until smooth. Beat in the apple butter and vanilla. Add the flour mixture alternately with the milk, adding the flour in 3 additions and the milk in 2 additions (begin and end with dry ingredients). Add the walnuts.",
    "Divide the batter between the two cake pans and bake 30-35 minutes or until a toothpick inserted in the center comes out clean. Cool for 15 minutes then invert the cake pans. Cool completely on a wire rack.",
    "In a large mixing bowl (with whisk attachment if using stand mixer), beat the heavy cream until it thickens and stiff peaks form, roughly 3-4 minutes (when you pull the beaters up, peaks will form and not fall over). Transfer to another bowl and keep cold in the refrigerator.",
    "In the same mixing bowl (no need to clean bowl - switch to paddle if using stand mixer), beat together the cream cheese, sugar, and salt until smooth and creamy, about 2-3 minutes. Beat in the caramel and vanilla. Scrape down the bowl as necessary.",
    "Fold the whipped cream into the cream cheese mixture until fully incorporated. Refrigerate until ready to assemble.",
    "Cut each cake layer horizontally into two layers for a total of four layers. Place one layer, cut side up, on a serving plate or stand. Spread one third of the filling on top. Place another layer, cut side down, on top. Repeat with the remaining filling and layers. Right before serving, garnish with caramel apple topping.",
    "Make the topping right before serving: In a large skillet, melt the butter. Once hot, add the apples and walnuts. Cook for 5 minutes or until the apples start to soften. Add the caramel sauce and stir. Remove from the heat and cool 15 minutes before garnishing cake."
  ],
  "ingredients": [
    "0",
    "2 1/2 cups all purpose flour",
    "1 1/2 teaspoons baking powder",
    "1 teaspoon baking soda",
    "1 teaspoon ground cinnamon",
    "1/2 teaspoon ground nutmeg",
    "1/2 teaspoon salt",
    "1/2 cup vegetable oil",
    "1 cup granulated sugar",
    "1/2 cup brown sugar",
    "2 eggs, room temperature",
    "1 1/2 cups Musselman's Apple Butter",
    "1 teaspoon vanilla extract",
    "1/2 cup whole milk, room temperature",
    "1 cup chopped walnuts",
    "1/2 cup heavy whipping cream",
    "8 ounces full-fat cream cheese, room temperature",
    "1 cup powdered sugar",
    "Pinch of salt",
    "1/2 cup caramel sauce (homemade or store bought)",
    "1/4 teaspoon vanilla extract",
    "1 tablespoon butter",
    "1 large apple, cored, peeled, and thinly sliced",
    "1/4 cup chopped walnuts",
    "1/4 cup caramel sauce (homemade or store bought)"
  ],
  "__v": 1
}