{
  "hash": "ebf03e1fd2ff6d721cbfe297b8d7aca69909a98e",
  "title": "Filipino Longanisa Sausage",
  "image": "http://lh5.ggpht.com/ayIpTzJIJ4PdKOiACkLyyH95ekIL8FNvGH4RovJN3JKtROBYgMiEx8Y9rquBt1swboYCfaL94D73dz2q_he1LNrXqW8=s450-c",
  "href": "http://www.keyingredient.com/recipes/117820365/filipino-longanisa-sausage/?locale=en_US",
  "extension": "Chrome",
  "firstAdded": "2015-10-08T15:08:07.163000",
  "users": [
    null
  ],
  "keywords": [
    "lbs",
    "lean",
    "pork",
    "meat",
    "coarsely",
    "chilled",
    "fat",
    "salitre",
    "drug",
    "salt",
    "peter",
    "mortons",
    "tender",
    "quick",
    "nitrate",
    "sodium",
    "nitrite",
    "available",
    "grocery",
    "stores",
    "garlic",
    "bay",
    "leaf",
    "cane",
    "vinegar",
    "brown",
    "sugar",
    "achuete",
    "oil",
    "achiote",
    "soy",
    "rice",
    "white",
    "paprika",
    "black",
    "pepper",
    "red",
    "sausage",
    "casing"
  ],
  "directions": [
    "0",
    "Achuete, also called achiote, atsuete, annatto is a small, reddish seed. If you do not have achuete oil on hand, take a shortcut and go to a Mexican grocery and get a three-ounce packet of Pasta de Achiote (annatto seed paste). Use 1 T for the recipe above. The achiote adds a reddish tinge and additional flavor to the sausage. The leftover paste can also be used to make a colorful and tasty addition to Spanish rice.",
    "Combine all ingredients except casing and let stand for 1-2 hours. Fill casing with mixture. Tie the end of the casing with kitchen string. Twist the sausage at every five inches or so to form the sausages. Place finished sausages on a tray and let them cure and dry in the refrigerator for 4-5 days, turning them over once a day. (Instead of making links, you can simply shape the sausage into patties.)",
    "When ready to cook, put desired number of sausages in a skillet. Add enough water to come halfway up the side of the links. Prick sausage lightly with a fork. Let simmer over medium heat until water evaporates.",
    "Add two tablespoons of oil and fry till nicely browned. Serve hot."
  ],
  "ingredients": [
    "0",
    "2\tlbs lean pork meat coarsely ground or chopped and chilled",
    "½ to 1\tlb pork fat, diced",
    "¼\ttsp. salitre (available in drug stores as salt peter) or 1 t Morton's Tender Quick (sodium nitrate, sodium nitrite) available in most grocery stores.",
    "5-6\tcloves garlic, minced",
    "⅓\tt. ground bay leaf or 1 leaf finely chopped (optional)",
    "2\tT sugar cane vinegar or 3 T brown sugar",
    "2\tT achuete oil or 1 T achiote paste (see note below)",
    "⅛\tcup soy sauce",
    "⅛\tcup rice or white vinegar",
    "1½\tt sea salt",
    "1\tt paprika",
    "1\tt black pepper",
    "1\tt red pepper flakes (optional)",
    "sausage casing"
  ],
  "__v": 1
}