{
  "hash": "a024db0085972cc6e1242963c5a0180260698a92",
  "title": "INDONESIAN GINGER CHICKEN THIGHS",
  "image": "https://cooksmarts.imgix.net/meal_photos/1099/20180528-Indonesian-Ginger-Chicken-Thighs-NM-2.jpg?ixlib=rails-2.1.4&w=430&drp=1",
  "href": "https://mealplans.cooksmarts.com/days/1099?version=standard&servings=6",
  "extension": "",
  "firstAdded": "2018-05-29T16:40:39.665000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Rice - (Double if making Wednesday’s meal.) For white rice, rinse until clear. Fill a saucepan or Dutch oven (or rice cooker) with rice, water (use 2:1 ratio for water to rice), and some salt. Cover with lid and bring to a boil. Once water boils, stir, lower heat to a low-medium, and cover. Check white rice after ~20 min; brown at ~45 min. Rice is done when it's absorbed all the water. If it's not done, leave the cover on until all water has been absorbed. Take cover off to release steam and fluff with a wooden spoon after 5 minutes. (Can be done up to 5 days ahead)",
    "Green beans / Jalapenos / Ginger (for sauce and chicken) / Garlic - (If prepping right before cooking, get grill / oven heating before continuing with prep.) Prep as directed. Combine green beans and jalapenos. Store ginger for sauce in one container. Combine ginger and garlic for chicken in a third container. (Can be done up to 5 days ahead)",
    "Make marinade - Combine ginger (portion for chicken), garlic, soy sauce (portion for chicken), lime juice, honey, and fish sauce. (Can be done up to 5 days ahead)",
    "Marinate chicken - Place chicken in a baking dish. (Note: If you're going to cook chicken in the oven, line baking dish with some foil first to prevent the marinade from sticking while it bakes.) Combine chicken with marinade. Tenderize with a fork. Marinate for at least 20 minutes and up to 2 hours.",
    "Make peanut sauce - Combine ginger (portion for sauce), peanut butter, water (portion for sauce), brown sugar, vinegar (portion for sauce), and soy sauce (portion for sauce) in a microwave-safe bowl. Heat, stirring every 20 seconds, until sugar is dissolved and sauce is creamy and smooth. Stir in some hot sauce if you’d like. (Can be done up to 5 days ahead)",
    "Season the tops of the chicken thighs with some salt and pepper.",
    "If making chicken on the grill: Heat grill to 500F / 260C degrees, keeping one part of the grill on direct heat and one part on indirect heat. Brush grill with some cooking oil. Cook chicken over direct heat until lightly browned (watch it closely - the honey in the marinade can burn). Transfer to indirect heat and continue cooking with the lid closed until chicken reaches an internal temperature of 165F / 74C degrees, 8 to 10 minutes.",
    "If making chicken in the oven: Heat oven to 425F / 218C. Transfer baking dish with chicken and marinade to oven. Roast, uncovered, until chicken reaches an internal temperature of 165F / 74C degrees, 25 to 30 minutes.",
    "While chicken is cooking, heat a wok over medium-high heat. Add cooking oil and then green beans to heated oil. Saute until beans start to darken and char in spots. Add water (portion for beans) to the pan and cover the beans with a lid or foil. Steam beans, covered, until tender, 3 to 4 minutes.",
    "Uncover green beans and add jalapenos and vinegar (portion for green beans). Saute for 1 minute more. Season with some salt and pepper.",
    "Give peanut sauce a stir. If stored in the refrigerator, you may need to warm it in the microwave for a few seconds and / or add some water to soften it.",
    "Reheat rice if made ahead (reserve half if doubled for Wednesday).",
    "Serve chicken over rice with green beans on the side. Enjoy with peanut sauce over top."
  ],
  "ingredients": [
    "0",
    "Peanut Sauce:",
    "Ginger - 3/4 tsp, grated",
    "Peanut butter, creamy - 3/8 cup",
    "Water - 4 1/2 Tbsp, plus more until smooth and pourable",
    "Brown sugar - 1 1/2 Tbsp",
    "Vinegar, rice - 1 1/2 Tbsp",
    "Soy sauce, low-sodium - 1 1/2 Tbsp",
    "Hot sauce of choice (opt) - to taste",
    "Indonesian Chicken Thighs:",
    "Rice, uncooked white or brown - 1 1/8 cups",
    "Ginger - 1 1/2 Tbsp, grated",
    "Garlic - 3 cloves, chopped",
    "Soy sauce, low-sodium - 3/8 cup",
    "Lime juice - 1 1/2 tsp",
    "Honey - 3 tsp",
    "Fish sauce - 3 tsp",
    "Chicken thighs, boneless and skinless - 6",
    "Sauteed Green Beans:",
    "Green beans - 1 1/2 lbs, chopped into 1” / 2.5 cm pieces",
    "Jalapenos (opt) - 1 1/2, diced",
    "Oil, cooking - 1 1/2 Tbsp",
    "Water - 1 1/2 Tbsp",
    "Vinegar, rice - 1 1/2 Tbsp"
  ],
  "__v": 2
}