{
  "hash": "81af8882f996e9c340bb570dd5ee14fbb78ef426",
  "title": "Bay Scallop Chowder",
  "image": "//images.food52.com/4gud-tj2Dy4fRI8b0Ywiqabl2cc=/753x502/0ef75bca-e4df-4cf1-8e2a-d62362e50d00--121410F_192.JPG",
  "href": "http://food52.com/recipes/8415-bay-scallop-chowder",
  "extension": "Chrome",
  "firstAdded": "2016-01-21T14:53:15.733000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "butter",
    "thickly",
    "smoked",
    "bacon",
    "onion",
    "garlic",
    "clove",
    "red",
    "pepper",
    "bottled",
    "clam",
    "broth",
    "chicken",
    "stock",
    "canned",
    "lowsodium",
    "bouquet",
    "garni",
    "bay",
    "leaves",
    "parsley",
    "thyme",
    "sprigs",
    "black",
    "peppercorns",
    "wrapped",
    "cheesecloth",
    "yukon",
    "gold",
    "potatoes",
    "dice",
    "cream",
    "cornstarch",
    "leeks",
    "white",
    "tender",
    "green",
    "lengthwise",
    "crosswise",
    "scallops",
    "membranes",
    "salt",
    "chives"
  ],
  "directions": [
    "0",
    "Melt the butter in a large enameled cast-iron casserole. Add the bacon and cook over moderately high heat, stirring, until lightly browned, about 2 minutes. Add the onion and cook, stirring occasionally, until softened, about 7 minutes. Stir in the garlic and crushed red pepper and cook, stirring, until the garlic is fragrant, about 2 minutes.",
    "Add the clam broth, chicken stock and bouquet garni to the casserole and bring to a boil over high heat. Lower the heat to moderately high heat and simmer uncovered for 20 minutes. (The recipe can be refrigerated for up to 2 days. Bring to a boil before proceeding.)",
    "Add the diced potatoes to teh soup and cook over moderately high heat until just tender, about 10 minutes. Discard the bouquet garni.",
    "In a medium bowl, whisk 1/4 cup of the heavy cream with the cornstarch until smooth. Whisk in the remaining 2 cups cream, then whisk the mixture into the soup. Bring the soup to a boil over moderately high heat. Add the leeks and cook until just tender, about 4 minutes. (The chowder can stand at room temperature for up to 3 hours. Rewarm before finishing.)",
    "Stir the scallops into the chowder and cook over moderate heat just until opaque throughout, 2 to 3 minutes; don't let the soup boil. Season with salt and pepper. Ladle the chowder into a tureen or individual bowls. Garnish with the chopped chives and serve at once."
  ],
  "ingredients": [
    "0",
    "3 tablespoons unsalted butter",
    "2 ounces thickly sliced smoked bacon, finely chopped",
    "1 large onion, finely chopped",
    "1 large garlic clove, minced",
    "1/2 teaspoon crushed red pepper",
    "6 cups bottled clam broth",
    "6 cups chicken stock or canned low-sodium broth",
    "Bouquet garni made with 2 bay leaves, 5 fresh parsley sprigs, 3 fresh thyme sprigs and 8 black peppercorns, wrapped in cheesecloth",
    "1 1/2 pounds Yukon Gold potatoes, peeled and cut into 1/4-inch dice",
    "2 1/4 cups heavy cream",
    "2 tablespoons cornstarch",
    "2 large leeks, white and tender green, halved lengthwise and sliced crosswise 1/8 inch thick",
    "1 1/2 pounds bay scallops, membranes removed",
    "Salt and freshly ground black pepper",
    "1/4 cup finely chopped fresh chives"
  ],
  "__v": 1
}