{
  "hash": "4f28aeb3155cf794b0201b44c8ab0fdc9b687e41",
  "title": "Dukkah-Spiced Shrimp & Tahini Sauce",
  "image": "https://media.blueapron.com/recipes/2768/square_newsletter_images/1515692046-1-0004-4723/0212_2PF_Dukkah-Shrimp_74957_WEB_SQ_hi_res.jpg",
  "href": "https://www.blueapron.com/recipes/dukkah-spiced-shrimp-tahini-dressing-with-roasted-cabbage-potatoes",
  "extension": "Chrome",
  "firstAdded": "2018-05-26T20:24:18.067000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare & roast the potatoes:",
    "Place an oven rack in the center of the oven, then preheat to 450°F. Line a sheet pan with aluminum foil. Wash and dry the fresh produce. Cut the potatoes lengthwise into 1-inch-wide wedges. Place on the sheet pan. Drizzle with olive oil and season with salt and pepper; toss to coat. Arrange in an even layer, skin side down, on one side of the sheet pan. Roast 10 minutes, or until lightly browned and slightly tender when pierced with a fork. Leaving the oven on, remove from the oven.",
    "2 Prepare & roast the vegetables:",
    "While the potatoes roast, cut out and discard the core of the cabbage; roughly chop the leaves. Peel and large dice the onion. Place the chopped cabbage and diced onion in a bowl. Drizzle with olive oil and season with salt and pepper; toss to coat. Carefully arrange in an even layer on the other side of the sheet pan of roasted potatoes. Roast 23 to 25 minutes, or until the vegetables are lightly browned and the potatoes are tender when pierced with a fork. Remove from the oven.",
    "3 Prepare the remaining ingredients:",
    "While the vegetables roast, using a peeler, remove the yellow rind of the lemon, avoiding the white pith; mince the rind to get 2 teaspoons of zest (or use a zester). Quarter and deseed the lemon. Peel and roughly chop the garlic.",
    "4 Make the sauce:",
    "While the vegetables continue to roast, in a bowl, combine the tahini, lemon zest, the juice of all 4 lemon wedges, half the dukkah seasoning, and a drizzle of olive oil. Season with salt and pepper to taste.",
    "5 Cook the shrimp & serve your dish:",
    "Once the vegetables have roasted for about 15 minutes, pat the shrimp dry with paper towels; season with salt and pepper. In a medium pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the seasoned shrimp and cook, stirring occasionally, 3 to 4 minutes, or until lightly browned. Add the chopped garlic and remaining dukkah seasoning; season with salt and pepper. Cook, stirring frequently, 30 seconds to 1 minute, or until combined and the shrimp are cooked through. Turn off the heat. Serve the cooked shrimp and roasted vegetables with the sauce on the side. Enjoy!"
  ],
  "ingredients": [
    "0",
    "10",
    "oz",
    "Shrimp",
    "2",
    "cloves",
    "Garlic",
    "¾",
    "lb",
    "Golden Potatoes",
    "½",
    "lb",
    "Cabbage",
    "1",
    "Red Onion",
    "1",
    "Lemon",
    "2",
    "Tbsps",
    "Tahini",
    "1",
    "Tbsp",
    "Dukkah Seasoning (Za'atar, Ground Coriander, Ground Fennel Seeds, Ground Cumin, & Black Sesame Seeds)"
  ],
  "__v": 1
}