{
  "hash": "82ec76ed51234a936a31dd050f5b93182cb7acdf",
  "title": "Slow-Roasted Beef Tenderloin Recipe",
  "image": "http://www.seriouseats.com/recipes/assets_c/2014/12/20141217-tenderloin-roast-recipe-food-lab-primary-thumb-1500xauto-417108.jpg",
  "href": "http://www.seriouseats.com/recipes/2014/12/slow-roasted-beef-tenderloin-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-12-03T09:56:12.711000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "The Day Before: Using butcher's twine, tie tenderloin at 1-inch intervals using butcher's knots. Season generously with salt and pepper. Transfer to a wire rack set in a foil-lined rimmed baking sheet and refrigerate uncovered at least overnight and up to 2 nights.",
    "When Ready to Cook: Adjust oven rack to center position and preheat oven to 225°F. Place baking sheet with rack and tenderloin in the oven and roast until internal temperature registers 120 to 125°F on an instant-read thermometer, 2 to 3 hours. Remove from oven and set aside at room temperature for 10 minutes. Cut and remove twine.",
    "To Finish Under Broiler: Adjust rack to 6 inches from broiler element and preheat broiler to high. Heat butter, swirling, in a medium skillet over high until foaming subsides and butter turns a light nutty brown. Add thyme and shallots and stir until crackling stops. Pour butter mixture over tenderloin and spread with a spoon until all surfaces are coated. Remove the shallots from the top surface of the meat. Place pan with tenderloin under the broiler and broil, turning every 30 seconds, until well browned on all sides and an internal temperature registers 125°F for rare or 130°F for medium-rare, about 2 minutes total. Proceed to Step 5.",
    "To Finish on Stovetop: Heat butter, swirling, in a medium skillet over high heat until foaming subsides and butter turns a light nutty brown. Add tenderloin, shallots, and thyme, and cook, turning occasionally and spooning the hot butter and aromatics over the roast until well browned on all sides and an internal temperature registers 125°F for rare or 130°F for medium-rare, about 1 1/2 minutes.",
    "Transfer tenderloin to cutting board and allow to rest for 5 minutes. Slice into 1/2-inch slices, sprinkle with chives and coarse sea salt, and serve with Horseradish Cream Sauce."
  ],
  "ingredients": [
    "0",
    "1 center-cut trimmed beef tenderloin, 2 to 3 pounds (see note above)",
    "Kosher salt and freshly ground black pepper",
    "4 tablespoons unsalted butter",
    "4 sprigs thyme",
    "1 shallot, roughly sliced",
    "Finely minced chives, for serving",
    "Coarse sea salt such as fleur de sel or Maldon, for serving",
    "1 recipe Horseradish Cream Sauce, for serving"
  ],
  "__v": 1
}