{
  "__v": 1,
  "directions": [
    "0",
    "To make the arugula green sauce: Combine all the ingredients in a blender or food-processor, and blend until very smoothly pureed. Transfer to an air-tight container until needed.",
    "To make the pork loin cutlets: Cut the pork loin into 1/4″ (7 mm) thick slices. Lay them evenly on a large piece of parchment paper with at least 1 1/2″ (4 cm) space between each. Cover with another piece of parchment paper, then with a meat-pounder (or even just a hammer), pound and flatten each slices into a bit thinner than 1/8″ (3 mm) thickness. Use a toothpick to secure a leaf of fresh sage onto every cutlets, then season with fine sea salt and freshly ground black pepper on both sides.",
    "Season approx 1/3 cup of all-purpose flour with a pinch of salt and pepper. Gently dab the cutlets with the sage-side only into the flour to very lightly coat the surface. Dust off any excess flour and repeat with the rest. Heat up 3 tbsp of olive oil in a large flat skillet over high heat. Place the cutlets sage/flour-side down into the skillet, and cook until you see the bottom edges are golden browned, and the top side looks barely pinkish (they will further cook while resting). Transfer to a plate, with the browned side up, and repeat with the rest of the cutlets.",
    "To assemble the sandwich: Preheat the broiler on high. Smear a layer of arugula green sauce on each side of the sliced open sesame rolls. Toast a few inches under the broiler until browned (this will happen quickly so watch out!). Scoop the avocados out of the skin and disgard the pit. Roughly smash it with a fork, season lightly with salt and pepper, then pile 1/2 of an avocado on each side of the bread (1 avocado for each sandwich).",
    "Generously pile the pork cutlet into the sandwich as you apply a generous smear of arugula green sauce between each cutlets. Top with some shaved Parmigiano cheese and a little squeeze of lime juice."
  ],
  "firstAdded": "2014-08-10T12:16:28.421000",
  "hash": "e7d108dec131091fe361bbb5758d0a77951ae4bf",
  "href": "http://www.ladyandpups.com/2014/07/31/stacked-green-pig-sandwich/",
  "image": "http://www.ladyandpups.com/wp-content/uploads/2014/07/stacked-pig-sandwich11.jpg",
  "ingredients": [
    "0",
    "Pork loin cutlets:",
    "15.5 oz (440 grams) of pork loin",
    "18 ~ 20 fresh sage leaves",
    "Fine sea salt and freshly ground black pepper to season",
    "Approx 1/3 cup of all-purpose flour for dusting",
    "15.5 oz (440 grams) of pork loin",
    "18 ~ 20 fresh sage leaves",
    "Fine sea salt and freshly ground black pepper to season",
    "Approx 1/3 cup of all-purpose flour for dusting",
    "Arugula green sauce:",
    "1 cup (30 grams) of fresh parsley leaves",
    "1/2 cup (25 grams) of baby arugula",
    "6 sprigs of fresh thyme",
    "5 fillets of anchovies",
    "1 clove of garlic",
    "1 ~ 2 tbsp of chopped pickled jalapeño or green chili",
    "2 tsp of capers",
    "1/4 tsp of freshly ground black pepper",
    "1/2 cup of extra virgin olive oil",
    "1 cup (30 grams) of fresh parsley leaves",
    "1/2 cup (25 grams) of baby arugula",
    "6 sprigs of fresh thyme",
    "5 fillets of anchovies",
    "1 clove of garlic",
    "1 ~ 2 tbsp of chopped pickled jalapeño or green chili",
    "2 tsp of capers",
    "1/4 tsp of freshly ground black pepper",
    "1/2 cup of extra virgin olive oil",
    "2 ripen avocados",
    "2 sesame sandwich rolls",
    "Parmigiano cheese for shaving",
    "Lime to serve"
  ],
  "keywords": [
    "pork",
    "loin",
    "cutlets",
    "sage",
    "leaves",
    "salt",
    "black",
    "pepper",
    "season",
    "approx",
    "allpurpose",
    "flour",
    "dusting",
    "arugula",
    "green",
    "parsley",
    "baby",
    "sprigs",
    "thyme",
    "fillets",
    "anchovies",
    "clove",
    "garlic",
    "pickled",
    "jalapeo",
    "chili",
    "capers",
    "extra",
    "virgin",
    "olive",
    "oil",
    "ripen",
    "avocados",
    "sesame",
    "sandwich",
    "rolls",
    "parmigiano",
    "cheese",
    "shaving",
    "lime",
    "serve"
  ],
  "title": "STACKED GREEN PIG SANDWICH",
  "users": [
    null
  ]
}