{
  "hash": "afce7bfa82b1b36b0fe20c2ce387202452e0df25",
  "title": "Lemon Bars",
  "image": "http://www.bakingobsession.com/wordpress/wp-content/lemonbarslast2.jpg",
  "href": "http://www.bakingobsession.com/2008/04/14/lemon-bars/",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T22:54:58.513000",
  "users": [
    null
  ],
  "keywords": [
    "crust",
    "unsalted",
    "butter",
    "sugar",
    "vanilla",
    "salt",
    "allpurpose",
    "flour",
    "filling",
    "eggs",
    "zest",
    "lemon",
    "lime",
    "preferably",
    "organic",
    "strained",
    "juice",
    "dusting"
  ],
  "directions": [
    "0",
    "Make the crust:",
    "Position a rack in the lower third of the oven and preheat the oven to 350 F. Lightly butter a 3×14-inches tart pan with removable bottom.",
    "In a bowl, combine the melted butter with the sugar, vanilla, and salt. Add the flour and mix just until incorporated. Press the dough evenly over the bottom and sides of the tart pan. Freeze until firm, about 15-20 minutes. You can juice the lemons while the crust is chilling.",
    "Place the tart pan on a cookie sheet and bake for about 20-25 minutes, or until the crust is fully baked and deep golden brown; press it down with the back of a spoon or prick it with a fork if it bubbles up.",
    "Make the filling:",
    "While the crust is baking, make the filling. Stir together the sugar and flour in a bowl until well mixed. Whisk in the eggs. Stir in the lemon or lime zest and juice.",
    "When the crust is ready, turn the oven down to 300 F. Slide the rack with the pan out, and pour the filling onto the hot crust. Bake for about 20 minutes longer, or until the topping no longer jiggles in the center when the pan is tapped. Set on a rack to cool completely in the pan.",
    "Unmold the tart. Dust with powdered sugar if you wish. Cut into 1-inch wide bars using a sharp knife.",
    "After 3 days, the crust softens but the bars still taste quite good for up to a week."
  ],
  "ingredients": [
    "0",
    "For the crust:",
    "8 tbsp (1 stick) unsalted butter, melted",
    "¼ cup sugar",
    "¾ tsp pure vanilla extract",
    "¼ tsp salt",
    "1 cup all-purpose flour",
    "For the filling:",
    "1 cup sugar",
    "3 tbsp all-purpose flour",
    "3 large eggs",
    "Finely grated zest of 1 lemon on lime, preferably organic",
    "½ cup strained fresh lime or lemon juice",
    "Powdered sugar for dusting (optional)"
  ],
  "__v": 1
}