{
  "hash": "a9a9eaf754b96ffc876d1443c70947af7f0ad68f",
  "title": "nstantní polenta",
  "image": "",
  "href": "http://www.menudomu.cz/instantni-polenta/",
  "extension": "Chrome",
  "firstAdded": "2015-12-08T09:16:02.991000",
  "users": [
    null
  ],
  "keywords": [
    "ingredience",
    "porci",
    "formika",
    "muffina",
    "polenty",
    "dly",
    "vvaru",
    "pep",
    "dal",
    "koen",
    "podle",
    "chuti",
    "nap",
    "chilli",
    "nebo",
    "kari",
    "erstv",
    "bylinky",
    "mslo",
    "olej",
    "vymazn",
    "formiky"
  ],
  "directions": [
    "0",
    "Postup přípravy:",
    "Polenta je stejná jako kuskus v tom, že když ji uděláte jen z vody, nebude dobře chutnat.",
    "Ten základ musí být ještě před tím, než ji do něho vsypete, dobře ochucený, bude se vám zdát,",
    "že možná až příliš, ale má tendenci vše kolem sebe pohlcovat, a tak málo koření = nevýrazný výsledek.",
    "Postupujeme tak, že si připravíme pánev nebo rendlík s nepřilnavým povrchem. Necháme v něm rozpustit trochu másla.",
    "Vezmeme formičku, podle které chceme vytvarovat polentu – např. na muffiny.",
    "Teď je třeba vývar. Nejvhodnější je domácí zeleninový nebo kuřecí.",
    "Chápu, že jen kvůli polentě se nikomu nebude chtít dělat, i když byste ho využili určitě jako základ na šťávu k masu,",
    "ke kterému budete polentu připravovat jako přílohu. Nicméně lze použít vodu a tak 1/4 kostky nebo 1/4 gelové kapsle bujonu na jednu porci.",
    "V tom případě pak už nepřidávejte sůl, protože je v tom soli už tak až až. Do formičky nalijte vývar skoro až po okraj a vlijte do rozpálené pánve.",
    "Popřípadě vlijte vodu, přiveďte ji spolu s máslem k varu a pak přidejte bujon. Je na čase kořenit – a toho je důležité se nebát.",
    "Polenta bude až tou poslední věcí, kterou do pánve vsypete. Když je tekutina s kořením a máslem 2-3 minuty provařená, přidejte polentu.",
    "Jako odměrka zas poslouží stejná formička – polenty by mělo být malinko přes polovinu objemu.",
    "Nasypte do pánve a chvilku ještě na vysoký stupeň promíchávejte. Tekutina začne mizet okamžitě.",
    "Ztlumte oheň nebo úplně vypněte. Ještě chvilku promíchávejte, pak ideálně ještě na minutu nebo dvě přikryjte pokličkou.",
    "Mezi tím vymažte formičku a pak do ní pořádně napěchujte polentu. Takhle ji můžete mít připravenou půl hodiny nebo klidně i den před podáváním.",
    "Pak stačí dát do rozehřáté trouby. Pokud ještě nevychladla, i s formičkou. Další den už klidně bez ní. Vždy půjde v pohodě po pár zatřepání dostat ven.",
    "Ideální jsou opět formičky nepřilnavé místo porcelánových – ty vymažte pořádně. Pokud chcete, aby to vypadalo pěkně,",
    "na dno formičky před polentou dejte lístek bylinky, perfektně se do ní vtiskne a pak bude na vrcholu bábovičky.",
    "Polenta se často podává s gorgonzolou. Dělá se také v tenké vrstvě na pekáči a pak za studena krájí na čtverečky a opéká na pánvi.",
    "Je to pružná, nedrolivá hmota, takže i na pánvi ji ohřejete a osmažíte skvěle.",
    "Dobře saje omáčky a sosy. Je nutno s nimi na talíři nešetřit."
  ],
  "ingredients": [
    "0",
    "Ingredience na 1 porci (formička na muffina):",
    "1 díl polenty",
    "2 díly vývaru",
    "sůl, pepř",
    "další koření podle chuti např. chilli nebo kari",
    "čerstvé bylinky",
    "máslo",
    "olej na vymazání formičky"
  ],
  "__v": 1
}