{
  "hash": "35b69e6c5bb70725192e9156372257f6c421958b",
  "title": "Mushroom, Gruyère, and Spinach Quiche",
  "image": "http://cdn-image.myrecipes.com/sites/default/files/styles/300x300/public/image/recipes/ck/14/04/mushroom-gruyere-spinach-quiche-ck-x.jpg?itok=9E8okHze",
  "href": "http://www.myrecipes.com/recipe/mushroom-gruyere-spinach-quiche",
  "extension": "Chrome",
  "firstAdded": "2016-06-06T04:59:27.170000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 425°.",
    "Weigh or lightly spoon flour into dry measuring cups; level with a knife. Combine flour, 1/4 teaspoon salt, 1/4 teaspoon pepper, and baking powder in a food processor; pulse 2 times to combine. Combine oil and 3 tablespoons water. With processor on, slowly add oil mixture through food chute; process until dough comes together. Turn dough out onto a lightly floured surface. Knead 1 minute. Press dough into a 5-inch disk; wrap in plastic wrap, and chill 20 minutes.",
    "Roll dough into a 12-inch circle. Fit dough into a 9-inch deep-dish pie plate coated with cooking spray. Line dough with foil; arrange pie weights or dried beans on foil. Bake at 425° for 12 minutes or until edges are golden. Remove weights and foil; bake an additional 2 minutes. Cool on a wire rack.",
    "Reduce oven temperature to 350°.",
    "Cook bacon in a large skillet over medium-high heat until crisp. Remove bacon from pan, reserving drippings; crumble. Return pan to medium-high heat. Add shallots to drippings in pan; sauté 2 minutes. Add mushrooms and thyme; cook 10 minutes, stirring occasionally. Stir in spinach; cook 2 minutes or until spinach wilts. Remove from heat; let stand 10 minutes. Drain any excess liquid.",
    "Place milk, half-and-half, eggs, egg white, remaining 1/2 teaspoon salt, and 1/4 teaspoon pepper in a blender; process until smooth.",
    "Arrange half of cheese over bottom of crust; top with spinach mixture and remaining half of cheese. Carefully pour milk mixture over cheese. Sprinkle with bacon. Bake at 350° for 45 minutes or until filling is set. Let stand 10 minutes."
  ],
  "ingredients": [
    "0",
    "5.6 ounces unbleached all-purpose flour (about 1 cup plus 2 tablespoons)",
    "3/4 teaspoon kosher salt, divided",
    "1/2 teaspoon freshly ground black pepper, divided",
    "1/4 teaspoon baking powder",
    "1/4 cup extra-virgin olive oil",
    "3 tablespoons ice water",
    "Cooking spray",
    "3 center-cut bacon slices",
    "1/4 cup chopped shallots",
    "1 (8-ounce) package presliced mushrooms",
    "2 teaspoons fresh thyme",
    "2 cups packed baby spinach",
    "1 cup 1% low-fat milk",
    "1/3 cup half-and-half",
    "3 large eggs",
    "1 large egg white",
    "2 ounces cave-aged Gruyère cheese, grated"
  ],
  "__v": 1
}