{
  "hash": "ce5424adaf475406aea3c5fb04653591bbee7d40",
  "title": "LIGHT ALFREDO SAUCE",
  "image": "https://minimalistbaker.com/wp-content/uploads/2012/08/minimalist-baker-cheesey-ciabatta-680x1024.jpg",
  "href": "https://minimalistbaker.com/light-alfredo-sauce-cheesy-garlic-ciabatta/",
  "extension": "",
  "firstAdded": "2018-03-24T05:13:03.136000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Preheat oven to 400 degrees F (204 C).",
    "Heat medium to large saucepan over medium heat. Once hot, add olive oil and garlic, stirring quickly to ensure it doesn't burn.",
    "Next, add milk and veggie broth and stir.",
    "Then, begin adding 1 Tbsp of flour at a time, stirring with a whisk to reduce clumps. I recommend starting with 2-3 Tbsp and adding more later if needed. You can also thicken with extra parmesan cheese.Add salt, pepper, red pepper flake, pesto, cheese and stir.",
    "Bring a pot to a boil and cook pasta at this time. Drain and set aside.",
    "Reduce heat on sauce slightly and let simmer for 5 minutes, stirring occasionally. If you notice the sauce is too thin, add a little more flour. If too thick, add a little more milk.",
    "In the meantime, split your ciabatta roll in half and butter lightly. Slice it into thick strips, add the parmesan, garlic powder and mozzarella and place in the oven on a baking sheet.",
    "Watch closely - it should only take 5 minutes to toast up. Remove from oven when lightly browned and cheese is melted.",
    "If you have clumps in your sauce at this point (I usually have a few), pour mixture into a blender and puree until smooth. Then return to saucepan, add your favorite pasta, toss and serve immediately."
  ],
  "ingredients": [
    "0",
    "ALFREDO SAUCE",
    "1 Tbsp extra virgin olive oil",
    "3 cloves garlic, minced",
    "1 cup low-fat milk",
    "1/2 cup veggie broth (DIY or store-bought)",
    "2-4 Tbsp flour",
    "1/4 each tsp salt and pepper",
    "1/4 cup grated Parmesan cheese",
    "1 Tbsp pesto (I used basil)",
    "optional: healthy pinch red pepper flake",
    "(10-12 ounces pasta, boiled)"
  ],
  "__v": 1
}