{
  "hash": "894592d32797bee2ea25ee09674a46060b4d2db8",
  "title": "Tortilla Soup",
  "image": "https://patijinich.com/wp-content/uploads/2014/01/tortilla-soup-912x622.jpg",
  "href": "https://patijinich.com/recipe/tortilla-soup/",
  "extension": "Chrome",
  "firstAdded": "2017-10-29T11:23:47.775000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Set a comal or skillet over medium heat. Once it is hot, toast the guajillo chiles for about a minute per side.",
    "In a medium saucepan, place the toasted guajillos, tomatoes, and garlic clove and cover with water. Place over medium-high heat and bring to a boil. Reduce heat to medium and simmer anywhere from 12 to 15 minutes, until tomatoes are fully cooked and mushy, and the guajillos have rehydrated and plumped up.",
    "Place the guajillos, tomatoes, garlic and onion in a blender, along with 1 cup of the simmering liquid and salt. Puree until completely smooth.",
    "In a large soup pot, heat the 2 tablespoons oil over medium-high heat. Once hot, but not smoking, pour in the tomato puree. It will sizzle, make noise and smoke. Partially cover with a lid, if you need to. Let the puree cook, season and thicken, changing from a bright red to a darker red and thicker consistency, for about 12 minutes, stirring occasionally. Pour in the chicken broth, add the parsley sprig and once it comes to a simmer, continue simmering for another 10 minutes. Before serving, remove the parsley sprig.",
    "To prepare the garnishes: Fry or bake the tortilla strips. Flash fry the ancho or pasilla chile strips, literally 5 seconds in already hot oil in a skillet set over medium heat, drain in a paper towel.",
    "Serve in soup bowls. Add a handful of tortilla crisps, and let people decide how much cream, queso fresco, chile crisps and avocado to add to their bowls. Or, if you don’t want to give anyone a choice, place all the garnishes in the soup plates, and pour the hot soup into the bowls at the table."
  ],
  "ingredients": [
    "0",
    "3guajillo chilesstemmed and seeded",
    "1poundripe tomatoes",
    "1clovegarlic",
    "1/2cuproughly chopped white onion",
    "1/2teaspoonkosher or coarse sea saltor to taste",
    "2tablespoonsvegetable oil",
    "6cupschicken broth",
    "1sprig fresh parsley",
    "12corn tortillascut into 1- to 2-inch strips",
    "1ancho or pasilla chilestemmed, seeded, cut into 1-inch strips and quickly fried (optional, for garnish)",
    "vegetable oilfor frying",
    "8ouncesqueso frescodiced",
    "1/2cupMexican style creamcrème fraiche or sour cream",
    "1ripe Mexican avocadohalved, pitted, meat scooped out and diced"
  ],
  "__v": 1
}