{
  "hash": "cdf02864a65177cc8486c9eb362c6ae9bed2badf",
  "title": "Falafel Heaven",
  "image": "http://recipe-folder.com/img/recipe-images/038/564/1013373638.jpg",
  "href": "https://www.theguardian.com/lifeandstyle/2015/mar/20/worlds-best-falafel-recipe-henry-dimbleby-back-to-basics",
  "extension": "Chrome",
  "firstAdded": "2020-02-06T13:33:15.279000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Drain the split fava beans well in a sieve or colander. Tip them into a food processor, along with the rest of the ingredients, except for the sesame seeds. Blitz the ingredients to a rough paste and tip it out on to a clean surface.",
    "Divide the mixture into 12-16 pieces, each about the size of a small golf ball. Press them down with your fingers to make small patties.",
    "Sprinkle around 3 tbsp sesame seeds on to a plate and coat each side of the falafels roughly with the seeds. Transfer them to the fridge for at least 10 minutes.",
    "To cook the falafel, fill a small pan with oil to a depth of about 3cm. Heat the oil – it will be ready when a piece of bread dropped in sizzles and turns brown quickly. Turn the heat down and start to cook the falafel in batches. I cooked mine 4 at a time and kept them warm on a baking tray in a low oven. Cook each side for 2-3 minutes, or until it is golden brown then flip them over and fry the other side.",
    "Serve with a minty yoghurt sauce (see below), flatbreads and spiced aubergine (recipes below)."
  ],
  "ingredients": [
    "0",
    "Preparation time: 15 minutes, plus overnight soaking",
    "Cooking time: 5-8 minutes",
    "Serves 4-6",
    "250g dried split fava beans, covered in cold water and soaked overnight",
    "3 garlic cloves, crushed",
    "½ leek, finely chopped",
    "5 spring onions, finely chopped",
    "½ tsp bicarbonate of soda",
    "1 tsp gram flour",
    "1 tbsp chopped coriander",
    "1 tbsp chopped parsley",
    "1 tsp ground cumin",
    "A pinch of cayenne pepper",
    "Salt and black pepper",
    "Sesame seeds",
    "Oil, for frying (rapeseed, rice bran or sunflower)"
  ],
  "__v": 1
}