{
  "hash": "e69e5a74870120db967e40fa8b6798d0af870e50",
  "title": "Beef & Pineapple Red Curry\nOne Pot: 120+ Easy Meals from Your Skillet, Slow Cooker, Stockpot, and More\nEditors of Martha Stewart Living\nRed curry paste, a jarred blend of chiles and other seasonings, is a fantastic ingredient to keep in your pantry. Combined with coconut milk, it makes a quick sauce for a Thai-style curry.",
  "image": "http://content0.tastebook.com/content/photo/photo/gdhtHSZf13c223233343837323Or71oqQc_1429689988.jpg",
  "href": "http://www.tastebook.com/recipes/4203235-Beef-Pineapple-Red-Curry",
  "extension": "Chrome",
  "firstAdded": "2015-04-23T23:13:53.709000",
  "users": [
    null
  ],
  "keywords": [
    "oil",
    "red",
    "curry",
    "sirloin",
    "steak",
    "trimmed",
    "strips",
    "green",
    "beans",
    "crosswise",
    "pineapple",
    "cubes",
    "lowsodium",
    "chicken",
    "broth",
    "coconut",
    "milk",
    "basil",
    "leaves",
    "torn"
  ],
  "directions": [
    "0",
    "Directions",
    "1",
    "In a large skillet or wok, heat oil over medium-high. Add curry paste and cook, stirring, until fragrant, 30 seconds.",
    "2",
    "Add steak and cook, stirring, until browned, 2 minutes.",
    "3",
    "Add green beans and pineapple; cook, stirring, until pineapple starts to release juices, 1 minute.",
    "4",
    "Add broth and coconut milk, and bring to a boil. Reduce heat and cook at a rapid simmer until green beans are crisp-tender, 8 minutes.",
    "5",
    "Garnish with basil before serving.",
    "PEELING A PINEAPPLE:",
    "To remove the skin from this prickly fruit, slice off the top and bottom. Stand the pineapple on end, and slice off the peel in strips, following the curve of the fruit. Quarter the peeled pineapple. Stand the quarters on end, and slice out the cores. Cut quarters in half lengthwise. Slice into wedges or cubes."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 tablespoon vegetable oil",
    "1/4 cup red curry paste",
    "1 pound sirloin steak, trimmed and cut against the grain into very thin strips",
    "1/2 pound green beans, trimmed and cut in half crosswise",
    "12 ounces pineapple, cut into 1-inch cubes",
    "1 1/2 cups low-sodium chicken broth",
    "1 cup unsweetened coconut milk",
    "1/2 cup fresh basil leaves, torn"
  ],
  "__v": 1
}