{
  "hash": "a4bb884a59727fb7a86d5356eda4955bf42f2545",
  "title": "Coconut Macaroons",
  "image": "http://www.onceuponachef.com/images/2014/11/chocolate-dipped-coconut-macaroons.jpg",
  "href": "http://www.onceuponachef.com/2014/12/coconut-macaroons.html",
  "extension": "Chrome",
  "firstAdded": "2015-03-29T19:13:00.542000",
  "users": [
    null
  ],
  "keywords": [
    "sweetened",
    "coconut",
    "scant",
    "condensed",
    "evaporated",
    "milk",
    "vanilla",
    "eggs",
    "whites",
    "salt",
    "semisweet",
    "chocolate",
    "best",
    "quality",
    "ghirardelli"
  ],
  "directions": [
    "0",
    "Preheat the oven to 325°F. Set oven racks in the upper and lower thirds of the oven. Line two baking sheets with parchment paper.",
    "In a medium bowl, mix together the shredded coconut, sweetened condensed milk and vanilla extract. Set aside.",
    "In the bowl of an electric mixer, beat the egg whites and salt until stiff peaks form. Use a large rubber spatula to fold the egg whites into the coconut mixture.",
    "Using two spoons, form heaping tablespoons of the mixture into mounds on the prepared baking sheets, spacing about 1 inch apart. Bake for about 25 minutes, until the tops are lightly golden and the bottoms and edges are deeply golden.",
    "If dipping the macaroons in chocolate, melt the chocolate in a microwave-safe bowl at medium power, stopping and stirring at 30 second intervals, until just smooth and creamy. (Alternatively, melt the chocolate in a double boiler over simmering water.) Dip the bottoms of the macaroons in the chocolate, letting any excess drip back into the bowl, and return to the lined baking sheets. Place the macaroons in the refrigerator for about 10 minutes to allow the chocolate to set."
  ],
  "ingredients": [
    "0",
    "One 14-ounce bag sweetened shredded coconut",
    "7/8 cup (a scant cup) sweetened condensed milk (not evaporated milk)",
    "1 teaspoon vanilla extract",
    "2 large eggs whites",
    "1/4 teaspoon salt",
    "4 ounces semi-sweet chocolate, best quality such as Ghirardelli, chopped (optional)"
  ],
  "__v": 1
}