{
  "hash": "b274de2966335b50477cf8ce0bf2828131408368",
  "title": "Angela (Oh She Glows)",
  "image": "http://cdn.ohsheglows.com/wp-content/uploads/2013/09/veganchickpeapancake.jpg",
  "href": "http://ohsheglows.com/2013/09/15/jumbo-chickpea-pancake-a-high-protein-filling-vegan-breakfast-or-lunch/",
  "extension": "Chrome",
  "firstAdded": "2016-05-26T16:57:54.173000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare the vegetables and set aside. Preheat a 10-inch skillet over medium heat.",
    "In a small bowl, whisk together the chickpea flour, garlic powder, salt, pepper, baking powder, and optional red pepper flakes.",
    "Add the water and whisk well until no clumps remain. I like to whisk it for a good 15 seconds to create lots of air bubbles in the batter.",
    "Stir in the chopped vegetables.",
    "When the skillet is pre-heated (a drop of water should sizzle on the pan), spray it liberally with olive oil or other non stick cooking spray.",
    "Pour on all of the batter (if making 1 large pancake) and quickly spread it out all over the pan. Cook for about 5-6 minutes on one side (timing will depend on how hot your pan is), until you can easily slide a pancake flipper/spatula under the pancake and it's firm enough not to break when flipping. Flip pancake carefully and cook for another 5 minutes, until lightly golden. Be sure to cook for enough time as this pancake takes much longer to cook compared to regular pancakes.",
    "Serve on a large plate and top with your desired toppings. Leftovers can be wrapped up and placed in the fridge. Reheat on a skillet until warmed throughout."
  ],
  "ingredients": [
    "0",
    "1 green onion, finely chopped (about 1/4 cup)",
    "1/4 cup finely chopped red pepper",
    "1/2 cup chickpea flour (also known as garbanzo flour or besan)",
    "1/4 teaspoon garlic powder",
    "1/4 teaspoon fine grain sea salt",
    "1/8 teaspoon freshly ground black pepper",
    "1/4 teaspoon baking powder",
    "pinch red pepper flakes (optional)",
    "1/2 cup + 2 tablespoons water",
    "For serving: salsa, avocado, hummus, cashew cream (optional)"
  ],
  "__v": 1
}