{
  "hash": "811a875230215d0067d60cd32a3be8bd37f3fa4b",
  "title": "Rosemary Chicken Lasagna",
  "image": "http://i0.wp.com/feastingathome.flywheelsites.com/wp-content/uploads/2013/01/rosemary-Chicken-lasagna-7046.jpg?resize=640%2C426",
  "href": "http://www.feastingathome.com/2013/01/rosemary-chicken-lasagna.html",
  "extension": "Chrome",
  "firstAdded": "2015-05-01T21:12:51.592000",
  "users": [
    null
  ],
  "keywords": [
    "filling",
    "lbs",
    "chicken",
    "breast",
    "bite",
    "size",
    "pieces",
    "replace",
    "wild",
    "mushrooms",
    "red",
    "onion",
    "garlic",
    "rosemary",
    "kosher",
    "salt",
    "generous",
    "pinches",
    "cracked",
    "pepper",
    "spinach",
    "arugula",
    "olive",
    "oil",
    "mozzarella",
    "divided",
    "saving",
    "bchamel",
    "milk",
    "ricotta",
    "parmesan",
    "lemon",
    "zest",
    "egg",
    "roll",
    "wrappers",
    "pasta",
    "sheets",
    "bechamel",
    "butter",
    "flour",
    "hot",
    "nutmeg",
    "white",
    "truffle",
    "amazingnote",
    "salty",
    "using",
    "regular",
    "need"
  ],
  "directions": [
    "0",
    "Preheat oven to 400F",
    "Cut chicken into ½ inch, bite size pieces. Season with 2 generous three finger pinches of kosher salt and cracked pepper. Saute in a skillet, on medium heat, with 1-2 T oil until golden brown, and cooked through. Place chicken in a bowl and set aside. In the same pan, saute diced onion until tender, on med high heat, about 5 min. You may need to add a little more oil. Add garlic, lower heat to medium, saute 2 minutes. Add rosemary, mushrooms, ½ tsp kosher salt and lower heat to med low, and saute until mushrooms release liquid and are tender, about 10 minutes. Add chopped spinach, stir until wilted and add chicken. Set aside.",
    "Make Bechamel Sauce:",
    "In a small pot, melt butter on med low heat. Add flour and stir for five minutes on med heat until flour is golden. Whisk in a cup of hot milk at a time. Add Rosemary and bring to a boil, d",
    "o not leave unattended, stirring constantly. Add 4 oz. mozzarella and stir until melted and thickened. Add salt, nutmeg and white pepper. Simmer for a few minutes, then set aside.",
    "Assemble Lasagna. Use fresh pasta sheets if possible. If not available, substitute large egg roll wrappers. Butter or grease a 8x 12 in pan. Pour ½ C bechamel sauce in the bottom and spread out. Lay down one layer of fresh pasta sheet or two layers of egg roll wrappers. Using a teaspoon, place teaspoon sized dollops of ricotta, using up about half the container. Spread out the ½ of the chicken mushroom filling, Drizzle ½ C bechemal, sprinkle ¼ C Parmesan, and 4 oz of the fresh mozzarella and half of the lemon zest. Repeat, adding another single layer of pasta, or two layers of egg roll wrappers, lightly pressing down. Add dollops of ricotta, the remainder of the chicken mushroom filling, ½ C bechamel, the remaining mozzarella, ¼ C Parmesan and remaining lemon zest. At this point, you could drizzle with a little truffle oil ( it's delicious). Top with the last layer of pasta ( or egg roll wrappers) pour the remainder of the bechamel, spreading evenly. Add the final ¼ C of Parmesan. Sprinkle with a little rosemary.4. Bake covered tightly with foil in a 400F oven for 40 minutes or until hot and bubbly. Remove foil and bake uncovered until top is golden, about 10 more minutes. Let rest out of the oven 10-15 minutes before cutting, so it sets up.",
    "Yield: 8"
  ],
  "ingredients": [
    "0",
    "Filling:",
    "1½ lbs chicken breast, cut into bite size, ½ inch pieces ( or replace with 1 lb wild mushrooms)",
    "8 oz sliced mushrooms (optional- or replace with 8 oz more chicken)",
    "½ red onion- diced",
    "8 cloves garlic -chopped",
    "1 T fresh rosemary- chopped",
    "½ tsp kosher salt -plus two generous pinches for chicken",
    "cracked pepper",
    "1-2 C packed, chopped fresh spinach ( or arugula)",
    "2 T olive oil",
    "---",
    "12 oz fresh mozzarella, cut into ½ inch pieces, divided -saving 4 oz for béchamel",
    "15 oz whole milk ricotta",
    "¾ C Parmesan",
    "lemon zest 1T",
    "1 package egg roll wrappers, or fresh pasta sheets",
    "Bechamel Ingredients:",
    "4 T butter ( or olive oil)",
    "4 T flour",
    "1 T fresh rosemary, chopped",
    "3 C hot whole milk",
    "1¼ tsp kosher salt",
    "½ tsp nutmeg",
    "¼ tsp white pepper",
    "Truffle oil- optional but amazingNote: Kosher salt is less salty than table salt. If using regular table salt you will need less."
  ],
  "__v": 1
}