{
  "hash": "5441cdb3862a028fd8aa571576543e36a80915a6",
  "title": "15-min Pea & Basil Pesto Pasta",
  "image": "https://static.wixstatic.com/media/26357d_8fe54e3b83c14fc3b246799338026d1a~mv2_d_4000_6000_s_4_2.jpg/v1/fill/w_788,h_1181,al_c,q_85,usm_0.66_1.00_0.01/26357d_8fe54e3b83c14fc3b246799338026d1a~mv2_d_4000_6000_s_4_2.webp",
  "href": "https://www.pickuplimes.com/single-post/2019/03/29/15-min-Pea-Basil-Pesto-Pasta",
  "extension": "Chrome",
  "firstAdded": "2019-05-31T09:15:31.159000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cook pasta according to package instruction in salted water until al dente.",
    "Roast pine nuts in a medium pan on high heat for 2 minutes, stirring throughout. Remove from heat and add to food processor, reserving 2 Tbsp for topping.",
    "To the same pan add the oil and garlic and sauté for 2 minutes, adding a splash of water to deglaze the pan as needed. Add to the food processor as well*.",
    "Back to the same pan add the oil and shallots, and let cook for 2 minutes, , adding a splash of water to deglaze the pan as needed. Then add the roasted paprika and cook for 1 minute longer.",
    "While the shallot cooks, add the peas, lemon juice, basil, olive oil, salt and pepper to the food processor which already contains the pine nuts and garlic. Blend until creamy.",
    "When pasta is done, drain, rinse, and return to the pot. Add to the shallot mixture on top, pour over the pea pesto, add the arugula, and toss to combine. Plate, garnish, and enjoy!",
    "Notes",
    "*We like to cook the garlic first before adding it to the pesto for the extra flavour, but if you'd like you can add raw garlic straight to the food processor instead and skip this step.",
    "Storage: keep pasta in an air-tight container in the fridge for up to 4 days.",
    "Variations: use spinach instead of arugula, or try adding diced sun-dried tomato in place or along with the roasted peppers."
  ],
  "ingredients": [
    "0",
    "9 oz (250 g) pasta, we used linguine",
    "1/2 cup (68 g) roasted pine nuts, reserve 2 Tbsp for topping",
    "1 tsp (5 ml) oil",
    "4 cloves garlic, minced",
    "1 tsp (5 ml) oil",
    "2 shallots, diced",
    "2 large roasted bell peppers (aka paprikas) from a jar, diced",
    "1.5 cup (225 g) cooked green peas, 1/4 cup (38 g) reserved for topping",
    "1 lemon, juiced",
    "1 heaping cup (30 g) fresh basil, chopped",
    "2 Tbsp (30 ml) olive oil",
    "Black pepper and salt to taste",
    "2 cups (50 g) arugula",
    "INGREDIENTS: Optional Toppings",
    "Roasted pine nuts",
    "Green peas",
    "Chili flakes",
    "Fresh basil",
    "Lemon wedges"
  ],
  "__v": 3
}