{
  "hash": "df98a91c14e695ac7310c0f7a35315738a40ccd8",
  "title": "Enchiladas",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2014/06/enchiladas-vertical-b1.jpg",
  "href": "http://www.simplyrecipes.com/recipes/enchiladas/",
  "extension": "",
  "firstAdded": "2017-07-13T22:13:59.720000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Preheat oven to 350 degrees F.",
    "2 In a large frying pan at medium-high heat add a tablespoon of oil. When the oil is shimmering and hot (not quite smoking), add a corn tortilla to the pan. Cook it for 2-3 seconds, use a metal spatula to turn it over, and cook it for 2 to 3 seconds more. Lift up the tortilla with a spatula, add another tortilla underneath. Cook the second tortilla for 2-3 seconds, lift both tortillas, and add another tortilla underneath. Repeat the process with all the tortillas, adding more oil as needed. This way you can brown and soften the tortillas without using a lot of fat. It's important to pre-cook the tortillas because not only does cooking them help soften them for rolling, cooking them in a little fat helps develop the flavor of the tortillas. As the tortillas brown a little, remove them to a plate.",
    "2 Heat olive oil in a large sauté pan on medium heat. Add the chopped onion and cook for 5-6 minutes, until translucent. Add the garlic and cook for a minute more. Add the crushed tomatoes. Add the green chiles. Add 1/2 cup of water. Add the oregano. Bring to a simmer and taste. If the sauce tastes too vinegary, add half a teaspoon of sugar to the sauce. Remove from heat.",
    "3 Put a little olive oil on the bottom of a 3-quart casserole pan. Take a tortilla, cover 2/3 of it lightly with the shredded cheese, then roll up the tortilla and place it in the casserole pan. Continue until all tortillas are filled and rolled.",
    "4 Add sauce to the top of the tortillas in the the casserole pan. Make sure the rolled up tortillas are covered with the sauce. If not, add a little water to thin the sauce to spread it more evenly over the tortillas. Cover the whole thing with the rest of the grated cheese. Put the casserole in the oven for 10-15 minutes or until the cheese melts.",
    "Serve with sliced iceberg lettuce that has been dressed only with vinegar and salt. Garnish enchiladas with cilantro and sour cream.",
    "See Perfect Guacamole for a great guacamole avocado side dish."
  ],
  "ingredients": [
    "0",
    "Peanut oil, canola oil, or other high smoke point oil",
    "12 corn tortillas",
    "2 teaspoons olive oil (or peanut or canola)",
    "1/2 onion, chopped (about 3/4 cup)",
    "1 clove of garlic, minced (about 1 teaspoon)",
    "14-ounce can (about 1 3/4 cup) crushed tomatoes (preferably fire roasted)",
    "3/4 cup of chopped cooked green chiles (about a 4-ounce can), or 1/3 cup chopped pickled jalapeños (more or less to taste, depending on the heat of the chiles and how spicy you want your enchiladas)",
    "1/2 cup water",
    "1/2 teaspoon dried oregano",
    "1 lb (4 cups) of jack cheese, mild cheddar , or a mix, grated",
    "A handful of cilantro",
    "1 cup of sour cream",
    "Half a head of iceberg lettuce"
  ],
  "__v": 1
}