{
  "hash": "31e278223c7583b6cad4ea5f323e8fca590efc71",
  "title": "Greek Vegan Pastitsio",
  "image": "http://www.veggiesdontbite.com/wp-content/uploads/2015/01/greek-vegan-pastitsio-47e1.jpg",
  "href": "http://www.veggiesdontbite.com/2015/01/12/greek-vegan-pastitsio/",
  "extension": "Chrome",
  "firstAdded": "2015-06-18T09:15:36.930000",
  "users": [
    null
  ],
  "keywords": [
    "kind"
  ],
  "directions": [
    "0",
    "note: I used the green lentils here because they stay the most firm when cooked. You can use brown, but they will get a tad mushier. I wouldn’t recommend red as they get very soft. You can use water to cook the rice in but the broth gives it a little more flavor. If you do not have fresh tomatoes, you can use canned or bottled crushed tomatoes but I found they give a tangier flavor that I didn’t love. You can also omit the white wine if preferred, but it gives a great flavor to the dish. If you want to make this nut free, you can add another head of cauliflower instead or sub with silken tofu. The consistency and taste when baked may not be exactly the same but it will still work. I use veggie broth throughout this dish so take note when calculating how much you need.",
    "Tips to prep ahead: Make the cream and “meat” sauce beforehand, then simply boil the pasta the day of and put the dish together. Make sure you set the sauces out to get to room temp before assembling.",
    "Instructions:",
    "Preheat oven to 350. Cook brown rice in 2 cups veggie broth in a pot over the stove, watching to make sure it doesn’t burn. The rice will be very al dente when done but you don’t want it fully cooked so that it doesn’t get mushy when adding it to the final dish.",
    "Boil cauliflower until very soft. Once soft, drain and add it along with all other cream sauce ingredients to a high speed blender and blend until smooth and creamy. You can use a regular blender, but may need to mix it a while to get a smooth consistency. Set sauce aside.",
    "Chop onion and sauté in veggie broth or olive oil in a sauté pan until slightly cooked. Add lentils and sauté until onions become soft. Add more veggie broth if it gets too dry.",
    "Wash and chop tomatoes and parsley and add to the pan. Sauté for a few minutes, then add wine, salt and pepper. Add rice and continue to cook until lentils begin to get soft and rice softens a little. You do not want it to get overly cooked. Once done, pour into a bowl and use an immersion blender to pulse mixture until chunky but not mushy. You want pieces of rice and lentils and not a paste. If you do not have an immersion blender, you can pour the sauce into a food processor to chop, but be careful with the sauce being too hot.",
    "Cook pasta according to package instructions, but less about a minute or so. You want the pasta slightly al dente since it will be baking again in the oven.",
    "In a bowl, mix half of the pasta with 1 cup of the “meat” sauce and ½ cup of the cream sauce. Place on the bottom of a 9 x 12 baking dish. Then spread remaining “meat” sauce evenly over the pasta. The sauce makes quite a bit so if it seems to be too much for you, you can leave some out and use it as a pasta sauce at a later time.",
    "Mix the other half of the pasta with 1 cup of the cream sauce and place over “meat” sauce layer. Pour the remaining cream sauce over the top and spread evenly. Top with Hemp Almond Parmesan or parmesan of choice.",
    "Cover with foil and bake at 350 for 35 minutes. Remove foil and bake an additional 15 minutes. Let cool and set before cutting and serving for best results."
  ],
  "ingredients": [
    "0",
    "this kind"
  ],
  "__v": 1
}