{
  "hash": "dd60f3467d362c8853e4a5d241a468e6e9e9082a",
  "title": "No Churn Vegan Chocolate Ice Cream",
  "image": "http://cdn3.minimalistbaker.com/wp-content/uploads/2014/08/CREAMY-No-Churn-Vegan-Chocolate-Ice-Cream-FIVE-ingredients-NATURALLY-SWEETENED-SO-delicious-vegan-glutenfree.jpg",
  "href": "http://minimalistbaker.com/no-churn-vegan-chocolate-ice-cream/",
  "extension": "Chrome",
  "firstAdded": "2016-08-18T20:28:32.536000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place a large mixing bowl in the freezer to chill for 10 minutes.",
    "In the meantime, add moist, pitted dates to a food processor and process until small bits remain. Then add hot water a little at a time until it forms a thick paste. Set aside.",
    "Without tipping the cans, scoop out the coconut cream from the cans of coconut cream OR coconut milk, reserving the clear liquid for other uses. Place in chilled mixing bowl.",
    "NOTE: If you're using coconut milk, you'll likely use less sweetener because there's less volume.",
    "Using a mixer, whip until creamy and smooth. Then add cocoa powder, vanilla, almond milk and half of the date paste. Whip until fully incorporated.",
    "Taste and adjust flavors as needed. I ended up adding most of the date paste and a little more cocoa powder.",
    "Transfer to a parchment-lined freezer-safe container and cover loosely with plastic wrap, then foil to help freeze.",
    "You can take this out in a couple of hours for a chilled mousse-like ice cream. Freeze overnight for a firmer ice cream.",
    "Set out for at least 20 minutes prior to scooping, and use a scoop warmed under hot water for a proper scoop.",
    "Will keep in the freezer for up to one week, but best when fresh."
  ],
  "ingredients": [
    "0",
    "2 14-ounce cans coconut cream OR full fat coconut milk, chilled overnight in the fridge (I like Trader Joe's coconut cream, or Thai Kitchen coconut milk)",
    "2/3 cup unsweetened cocoa or cacao powder powder",
    "14-16 ounces pitted dates (if not sticky and moist, soak in warm water for 10 minutes then drain)",
    "1 tsp pure vanilla extract",
    "1/2 cup unsweetened almond milk",
    "1",
    "1 ounce espresso, cooled",
    "1/2 tsp cinnamon",
    "Cacao nibs"
  ],
  "__v": 1
}