{
  "hash": "cc8153c1c32c914ee8f013dbb904c1125b7b3ade",
  "title": "Lamb Meatballs with Spinach and Orzo",
  "image": "https://images.food52.com/edyQiU3GdWolQS8MvrBeEqlwltc=/753x502/af8dc79b-743d-49ef-8b1f-216544768d05--recipe-lamb.jpg",
  "href": "https://food52.com/recipes/69987-lamb-meatballs-with-spinach-and-orzo",
  "extension": "Chrome",
  "firstAdded": "2017-04-24T20:09:14.061000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350°F, with a rack in the center position.",
    "In a large bowl, gently combine the lamb, spinach, onion, feta cheese, egg, bread crumbs, garlic, lemon zest, 1 tablespoon of the olive oil, the salt, and pepper until well mixed. Form the mixture into 1½-inch meatballs, being careful not to squeeze the mixture too vigorously (working gently ensures tender meatballs).",
    "Heat the remaining 2 tablespoons olive oil in a medium (5- to 6-quart) Dutch oven over medium-high heat. When the oil is shimmering, add the meatballs and cook, turning, until browned all over, about 10 minutes. Remove and set aside on a plate to rest.",
    "Add the orzo to the Dutch oven and stir to coat with the oils in the pan. Stir in the broth, then return the meatballs to the pan.",
    "Cover the pot and bake until the orzo has absorbed most of the liquid and a thermometer inserted into the largest meatball reads 160°F, about 30 minutes. Uncover and continue baking until the orzo is completely tender, about 10 minutes. If it doesn’t look like the liquid is totally absorbed but the orzo is well done, give the pot a gentle stir to incorporate the liquid.",
    "Serve warm, topped with some feta and the mint.",
    "FUN HACK! MEATBALL SHORTCUT I’ve included instructions to brown the meatballs first, before adding the orzo, because I like the dark color and caramelized flavor it imparts, but if you’re short on time (or patience), you can definitely skip this step—just add the raw meatballs to the orzo immediately after adding the chicken broth, then proceed with the recipe as written."
  ],
  "ingredients": [
    "0",
    "1 1/2 pounds ground lamb",
    "9 ounces frozen spinach, thawed and squeezed dry",
    "1/2 medium red onion, finely chopped (about 1 cup)",
    "1/2 cup feta cheese, plus more for topping",
    "1 egg, beaten",
    "1/2 cup Italian-style bread crumbs",
    "2 cloves garlic, very finely chopped",
    "1 teaspoon grated lemon zest",
    "3 tablespoons extra virgin olive oil",
    "1 teaspoon kosher salt",
    "1 teaspoon ground black pepper",
    "1 1/2 cups orzo",
    "3 cups low-sodium chicken broth",
    "2 tablespoons chopped fresh mint"
  ],
  "__v": 1
}