{
  "hash": "e170e90a55cf3f805658321b2b1fcda822529f45",
  "title": "Linzer Cookies",
  "image": "",
  "href": "http://katu.com/amnw/am-northwest-cooking-recipes/linzer-cookies-11-27-2017",
  "extension": "Chrome",
  "firstAdded": "2017-12-03T03:04:37.808000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In the bowl of an electric stand mixer fitted with the paddle attachment, beat together the butter and granulated sugar at medium low speed until light and fluffy. Add the almond meal and mix until smooth, then add the egg and vanilla extract and beat until combined. Reduce speed to low, add the flour mixture in three increments, and mix until a thick dough forms. Cover the dough in plastic wrap and refrigerate for 1 hour.",
    "Preheat the oven to 350 degrees Fahrenheit. Roll out the dough until it is 1/4-inch thick. Cut out various shapes with a cookie cutter, then cut smaller shapes out of half of the cookies to create little \"windows\" which will display the filling. Make sure you have an even number of intact cookies and \"window\" cookies, since the intact cookies are the bottom and the \"window\" cookies are the top of the linzer cookies.",
    "Place the cookies on a baking sheet lined with parchment paper as you cut them out, leaving 1-inch of space around each cookie. Place the baking sheet in the oven and bake until they're lightly golden around the edges, about 10 to 15 minutes. Remove and allow to cool completely before spreading the intact bottom cookie with fruit preserves and placing a \"window\" cookie on top. Once all the cookies are assembled, dust them with powdered sugar and serve.",
    "Makes about 2 dozen linzer cookies."
  ],
  "ingredients": [
    "0",
    "3 cups all purpose flour",
    "1/4 teaspoon flake sea salt",
    "12 ounces unsalted butter, at room temperature",
    "1 cup granulated sugar",
    "1/2 cup almond meal",
    "1 large egg",
    "1 1/2 teaspoons vanilla extract",
    "fruit preserves, for filling",
    "powdered sugar, for dusting"
  ],
  "__v": 1
}