{
  "hash": "75f27d60acb15792cca2a2020ac4aab61ae7f83d",
  "title": "Recipe: Slow Cooker White Chicken Chili",
  "image": "http://p-fst2.pixstatic.com/54c86b1fdbfa3f30e6019852/_w.540_s.fit_/01-Chili-.jpg",
  "href": "http://www.thekitchn.com/recipe-slow-cooker-white-chicken-chili-215412",
  "extension": "Chrome",
  "firstAdded": "2015-10-05T21:20:57.489000",
  "users": [
    null
  ],
  "keywords": [
    "boneless",
    "skinless",
    "chicken",
    "breasts",
    "thighs",
    "yellow",
    "onion",
    "stalks",
    "celery",
    "green",
    "chili",
    "peppers",
    "preferably",
    "fireroasted",
    "garlic",
    "cumin",
    "kosher",
    "salt",
    "coriander",
    "oregano",
    "bay",
    "leaf",
    "lowsodium",
    "stock",
    "cannellini",
    "navy",
    "beans",
    "rinsed",
    "frozen",
    "corn",
    "serve",
    "monterey",
    "jack",
    "cheese",
    "lime",
    "wedges",
    "cilantro",
    "sour",
    "cream",
    "hot"
  ],
  "directions": [
    "0",
    "Combine the chicken, onions, celery, green chili peppers, garlic, cumin, 1 1/2 teaspoons of salt, coriander, oregano, and bay leaf in a 6-quart (or larger) slow cooker. Stir to make sure the spices coat everything, and nestle the chicken into the vegetables. Pour the chicken stock over top, covering the chicken and vegetables by an inch or so.",
    "Place the lid on the slow cooker. Cook for 4 hours on high or 6 hours on low. (It's fine to cook for 8 hours on low, if needed, but the chicken tends to fall apart a bit more when you shred after cooking, rather than staying in pieces.)",
    "About 30 minutes before the end of cooking, remove the lid of the slow cooker and add the beans and corn. Taste and add another 1/2 teaspoon of salt or other seasonings as desired. Add the lid back on and cook for the remaining time.",
    "Lift the chicken from the slow cooker and shred it into large, bite-sized pieces with two forks. Stir the chicken back into the soup and remove the bay leaf. (For a creamier chicken chili, see Recipe Notes below.)",
    "Serve with shredded cheese, wedges of lime, chopped cilantro, and sour cream.",
    "The soup will keep for 5 days refrigerated or 3 months frozen.",
    "Recipe Notes",
    "Creamier chicken chili: For a creamier chili, melt 3 tablespoons of butter in a small saucepan over medium heat. Whisk in 3 tablespoons all-purpose flour, and cook for 1 to 2 minutes. Slowly whisk in 1 cup whole milk. Once all the milk is added, continue cooking, stirring occasionally, until the sauce is thickened. Stir this into the slow cooker along with the beans and corn.",
    "Spicier chicken chili: Roast 2 poblano peppers and 2 jalapeno peppers over a gas flame or under the broiler until charred. When cool enough to handle, rub away the skin, remove the seeds and membranes (or save for an even spicier chili!), and roughly chop. Add to the slow cooker along with the chicken at the beginning of cooking.",
    "Smaller slow cookers: If you have a smaller slow cooker, divide all the ingredients in half and cook as directed.",
    "Stovetop chili: Rather than a slow cooker, you can also cook this chili on the stovetop. Follow the same instructions, but simmer the soup in a stockpot or Dutch oven over low heat on the stovetop for about an hour, or until the chicken easily shreds apart."
  ],
  "ingredients": [
    "0",
    "1 1/2 to 2 pounds boneless, skinless chicken breasts, thighs, or a mix",
    "1 large yellow onion, diced",
    "2 stalks celery, diced",
    "2 4-ounce cans diced green chili peppers, preferably \"fire-roasted\"",
    "3 cloves garlic, minced",
    "2 teaspoons cumin",
    "1 1/2 to 2 teaspoons kosher salt",
    "1/2 teaspoon coriander",
    "1/2 teaspoon dried oregano",
    "1 bay leaf",
    "4 cups low-sodium chicken stock",
    "1 13.5-ounce can cannellini or navy beans, drained and rinsed",
    "1 cup frozen corn",
    "To serve: shredded monterey jack cheese, lime wedges, chopped cilantro, sour cream, hot sauce"
  ],
  "__v": 1
}