{
  "__v": 1,
  "directions": [
    "0",
    "Pulire bene i broccoletti, lessarli in acqua bollente per qualche istante, ripassarli in padella con olio extravergine e uno spicchio d'aglio, aggiustare di sale e in ultimo frullarli con il frullatore a immersione aggiungendo, se serve, un poco di acqua di cottura (eliminare lo spicchio d'aglio). Si deve ottenere una salsa piuttosto fluida. Lavorare la ricotta con la forchetta, unire un filo d'olio extravergine d'oliva e un pizzico di sale, continuare fino a ottenere una crema.",
    "Sbriciolare la mollica di pane e farla tostare in un padellino antiaderente con un filo di olio extravergine d'oliva.",
    "Trascorso il tempo necessario, dividere l'impasto in parti uguali e iniziare a stenderlo con le mani fino a ottenere delle corde piuttosto affusolate (circa un centimetro di diametri). Tagliare le corde ottenute a tocchetti di un centimetro. Su una superficie di legno esercitare una leggera pressione con il pollice su ciascun tocchetto, trascinandolo fino a ottenere la caratteristica forma dell'orecchietta.",
    "Adagiare le orecchiette su un vassoio precedentemente cosparso di semola. Lasciar asciugare almeno un'ora. Cuocerle in acqua bollente e salata e scolare al dente, saltarle in padella con la salsa di broccoletti e impiattare.",
    "Adagiare alla base del piatto la salsa di ricotta, quindi le orecchiette e in ultimo una manciata di pane tostate per aggiungere una nota croccante."
  ],
  "firstAdded": "2014-10-09T19:48:26.310000",
  "hash": "baa401a47e31d8e953298b1f7d1c841a19d1770f",
  "href": "http://www.gamberorosso.it/index.php?option=com_k2&view=item&id=330368&Itemid=17&lang=it&Itemid=5116",
  "image": "",
  "ingredients": [
    "0",
    "500 g di semola di grano duro; 200 g di acqua a temperatura ambiente; 500 g di broccoletti crudi (circa un mazzo); 200 g di ricotta di pecora; 1 spicchio d'aglio; 80 g di mollica di pane raffermoolio extravergine d'oliva"
  ],
  "keywords": [
    "semola",
    "grano",
    "duro",
    "acqua",
    "temperatura",
    "ambiente",
    "broccoletti",
    "crudi",
    "circa",
    "mazzo",
    "ricotta",
    "pecora",
    "spicchio",
    "daglio",
    "mollica",
    "pane",
    "raffermoolio",
    "extravergine",
    "doliva"
  ],
  "title": "Orecchiette con crema di ricotta e broccoletti",
  "users": [
    null
  ]
}