{
  "hash": "cac7b66f8cb4d5b224ad25d053a4796a25281fe9",
  "title": "BEST CHICKEN ENCHILADAS EVER!",
  "image": "https://www.gimmesomeoven.com/wp-content/uploads/2014/10/Chicken-Enchiladas-61.jpg",
  "href": "https://www.gimmesomeoven.com/best-chicken-enchiladas-ever/",
  "extension": "",
  "firstAdded": "2018-12-01T02:46:41.124000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 degrees F. Prepare your enchilada sauce, if making homemade.",
    "In large saute pan, heat oil over medium-high heat. Add onion and saute for 3 minutes, stirring occasionally. Add diced chicken and green chiles, and season with salt and pepper. Sauté for 6-8 minutes, stirring occasionally, or until the chicken is cooked through. Remove from heat and set aside.",
    "To assemble the enchiladas, set up an assembly line including: tortillas, enchilada sauce, beans, chicken mixture, and cheese. Lay out a tortilla, and spread two tablespoons of sauce over the surface of the tortilla. Add beans in a line down the middle of the tortilla, then add in a spoonful of the chicken mixture, then sprinkle with 1/3 cup cheese. Roll up tortilla and place in a greased 9 x 13-inch baking dish. Repeat with the remaining ingredients. Then spread the remaining enchilada sauce on top of the tortillas, and sprinkle on the remaining shredded cheese.",
    "Bake uncovered for 20 minutes. Remove from oven and serve immediately, garnished with chopped fresh cilantro if desired."
  ],
  "ingredients": [
    "0",
    "2 tablespoons avocado oil (or any mild oil)",
    "1 small white onion, peeled and diced",
    "1.5 pounds boneless skinless chicken breasts, diced into small 1/2-inch pieces (*or see substitution below for using pre-cooked shredded chicken)",
    "sea salt and black pepper",
    "1 (4-ounce) can diced green chiles",
    "1 (15.5 ounce) can black beans, rinsed and drained",
    "8 large flour tortillas",
    "3 cups Mexican-blend shredded cheese",
    "1 batch red enchilada sauce, or 1 can store-bought enchilada sauce",
    "optional toppings: fresh cilantro, diced red onions, avocado, sour cream"
  ],
  "__v": 1
}