{
  "hash": "c8d3b1a21c6ac04a111c72168a571d76eeada17a",
  "title": "Skillet-Charred Green Beans with Crispy Sesame Topping",
  "image": "https://res.cloudinary.com/hksqkdlah/image/upload/ar_1:1,c_fill,dpr_1.0,f_auto,q_auto:low,w_600/41886-sfs-skillet-charred-green-beans-crispy-sesame-topping-7",
  "href": "https://www.cooksillustrated.com/recipes/11197-skillet-charred-green-beans-with-crispy-sesame-topping",
  "extension": "Chrome",
  "firstAdded": "2019-03-08T13:16:32.032000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "If your green beans are thin and tender, microwave them for 6 to 8 minutes; microwave thicker, tougher green beans for 10 to 12 minutes. To make the beans without a microwave, bring ¼ cup of water to a boil in a skillet over high heat. Add the beans, cover, and cook for 5 minutes. Transfer the beans to a bowl and wash the skillet before proceeding with the recipe. Korean red pepper flakes, called gochugaru, can also be sold as “Korean chili powder.”",
    "1. Process sesame seeds, panko, and peppercorns in spice grinder or mortar and pestle until uniformly ground to medium-fine consistency that resembles couscous. Transfer sesame mixture to 12-inch nonstick skillet, add 2 teaspoons vegetable oil, and stir to combine. Cook over medium-low heat, stirring frequently, until light golden brown, 5 to 7 minutes. Remove skillet from heat; add pepper flakes, sesame oil, salt, and orange zest; and stir to combine. Transfer sesame mixture to bowl and set aside. Wash out skillet thoroughly and dry with paper towels.",
    "2. Rinse green beans but do not dry. Place in medium bowl, cover, and microwave until tender, 6 to 12 minutes, stirring every 3 minutes. Using tongs, transfer green beans to paper towel–lined plate and let drain.",
    "3. Heat remaining 2 tablespoons vegetable oil in now-empty skillet over high heat until just smoking. Add green beans in single layer. Cook, without stirring, until green beans begin to blister and char, 4 to 5 minutes. Toss green beans and continue to cook, stirring occasionally, until green beans are softened and charred, 4 to 5 minutes longer. Using tongs, transfer green beans to serving bowl, leaving any excess oil in skillet. Sprinkle with scallions and sesame mixture and serve."
  ],
  "ingredients": [
    "0",
    "3\ttablespoons sesame seeds",
    "1\ttablespoon panko bread crumbs",
    "1\tteaspoon Sichuan peppercorns",
    "2\tteaspoons plus 2 tablespoons vegetable oil",
    "1\tteaspoon Korean red pepper flakes",
    "1\tteaspoon toasted sesame oil",
    "¾\tteaspoon kosher salt",
    "½\tteaspoon grated orange zest",
    "1\tpound green bean, trimmed",
    "2\tscallions, green parts only, sliced thin"
  ],
  "__v": 1
}