{
  "hash": "d631e6ec9f1a18ec31c35d120445dd872000bc83",
  "title": "Dublin Coddle - Irish Sausage, Bacon, Onion and Potato Hotpot",
  "image": "http://img.sndimg.com/food/image/upload/w_158,h_118/v1/img/recipes/28/88/85/picTLEnun.jpg",
  "href": "http://www.food.com/recipeprint.do?rid=288885",
  "extension": "Chrome",
  "firstAdded": "2016-09-19T16:19:26.623000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "Peel the potatoes. Cut large ones into three or four pieces: leave smaller ones whole. Finely chop the parsley. Boil the water and in it dissolve the bouillon cube.",
    "Grill or broil the sausages and bacon long enough to colour them. Be careful not to dry them out! Drain briefly on paper towels. When drained, chop the bacon into one-inch pieces. If you like, chop the sausages into large pieces as well. (Some people prefer to leave them whole.).",
    "Preheat the oven to 300F / 150°C In a large flameproof heavy pot with a tight lid, start layering the ingredients: onions, bacon, sausages or sausage pieces, potatoes. Season each layer liberally with fresh-ground pepper and the chopped fresh parsley. Continue until the ingredients are used up. Pour the bouillon mixture over the top. On the stove, bring the liquid to a boil. Immediately turn the heat down and cover the pot. (You may like to additionally put a layer of foil underneath the pot lid to help seal it.).",
    "Page 2 of 2Dublin Coddle - Irish Sausage, Bacon, Onion and Potato Hotpot (cont.)",
    "DIRECTIONS",
    "Put the covered pot in the oven and cook for at least three hours. (Four or five hours won't hurt it.) At the two-hour point, check the pot and add more water if necessary. There should be about an inch of liquid at the bottom of the pot at all times.",
    "To Serve. Guinness, bottled or draft, goes extremely well with this dish (indeed, adding a little to the pot toward the end of the process wouldn't hurt anything). Another good accompaniment is fresh soda bread, used to mop up the gravy!"
  ],
  "ingredients": [
    "0",
    "\"This traditional supper dish of sausages, bacon, onions and potatoes dates back at least as far as the early eighteenth century. It seems to be more of a city dish than a rural one: it was a favourite of Jonathan Swift, author of Gulliver's Travels and dean of Christ Church Cathedral in Dublin. In Dublin itself, coddle retains its reputation as a dish that can be prepared ahead of time and left in a very slow oven while the people who're going to eat it have to be out of the house for a while - making it an excellent dish for very busy people! The name of the dish is probably descended from the older word caudle, derived from a French word meaning \"to boil gently, parboil, or stew\". The more recent version of the verb, \"coddle,\" is still applied to gently cooked eggs, \"Coddled Eggs\". Please note, the sausages used should be the best quality 100% pork sausages you can get your hands on! This recipe would also work VERY well if cooked in a crock-pot, reduce the liquid by about half if cooking the coddle this way. Serve with Guinness and Irish soda bread. Although this is an easy to prepare one pot meal and its simplicity belies its amazing taste and flavour - comfort food at its best! Sláinte.\"",
    "INGREDIENTS",
    "2 kg potatoes",
    "2 large onions, peeled and sliced thickly",
    "450 g good quality pork sausages",
    "450 g bacon, piece thick cut",
    "500 ml water",
    "1 ham stock cube or 1 beef or 1 chicken stock cube, if ham stock isn't available",
    "3 -4 tablespoons fresh parsley, chopped",
    "salt ( to season)",
    "coarse-ground pepper ( to season)"
  ],
  "__v": 1
}