{
  "hash": "64d88108d5ee95e3292db0d8096df9091c91ffad",
  "title": "Turkish Slow-Cooked Beef and Vegetable Stew (Güveç)",
  "image": "https://images.food52.com/LWYEiIAXwiVxPyg8qWtwIEfth5A=/753x502/a9c12e3a-d542-4550-a960-47e9b8077e06--2017-1003_slow-cooked-beef-and-vegetables_rocky-luten_018.jpg",
  "href": "https://food52.com/recipes/73623-turkish-slow-cooked-beef-and-vegetable-stew-guvec",
  "extension": "Chrome",
  "firstAdded": "2018-03-01T01:39:16.593000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place a rack in the middle of the oven (or in the lower third, if the size of your pot requires it) and heat the oven to 425°F.",
    "Spread the meat over the bottom of a large Dutch oven or other heavy ovenproof pot. Spread the onion, garlic, and carrot over the meat, then add the rest of the vegetables.",
    "Combine the water, pepper and or tomato pastes, sugar, and salt in a medium bowl, stirring to dissolve the paste. Pour over the stew ingredients. Place the pot over high heat and bring the liquid to a boil; do not stir. Transfer the pot to the oven and cook the stew, uncovered, until the liquid reduces by one-half to two-thirds and the meat is tender, about 3 1/2 hours; stir once after about 1 1/2 hours. If after the 3 1/2 hours all of the ingredients are still submerged in liquid, raise the heat to 450°F and cook until some of the ingredients are exposed and beginning to brown, 20 to 30 minutes.",
    "Remove from the oven, cover, and allow to rest for 30 minutes before serving hot, or let the stew cool in the pot before refrigerating or freezing."
  ],
  "ingredients": [
    "0",
    "2 pounds boneless beef chuck, cut into 1 1/2-inch pieces",
    "1 large onion, coarsely chopped",
    "6 garlic cloves (or to taste), coarsely chopped",
    "1 small carrot, peeled and grated",
    "3 large tomatoes, cut into eighths",
    "5 or 6 medium green anaheim chiles, seeded and cut into 1-inch pieces",
    "1 large eggplant, cut into 1 1/2-inch pieces",
    "7 cups water",
    "1/4 cup plus 3 tablespoons sweet or hot Turkish pepper paste or tomato paste, or a combination",
    "1 teaspoon sugar",
    "2 teaspoons fine sea salt"
  ],
  "__v": 1
}