{
  "hash": "d514db5111479ad4a79494fee82c19e48631c3f2",
  "title": "Mashed Potato Cazuela",
  "image": "https://patijinich.com/wp-content/uploads/2017/09/606-mashed-potato-casserole-912x622.jpg",
  "href": "https://patijinich.com/recipe/mashed-potato-cazuela/",
  "extension": "Chrome",
  "firstAdded": "2017-10-29T13:23:49.659000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Bring a large pot of salted water to a boil. Carefully drop in the diced potatoes and cook until a fork or pairing knife slides in easily, but the potatoes are still holding their shape, about 12 minutes. Remove with a slotted spoon or spider and place in a large bowl.",
    "Drop in the diced carrots and cook for just one minute, remove and set aside in a smaller bowl. Finally drop in the peas and cook for one minute, then remove and place in the bowl with carrots.",
    "Melt the butter in a small skillet over medium heat. Once it sizzles, add the onion and cook until wilted, stirring occasionally, about 3 to 4 minutes. Remove from the heat.",
    "Pre-heat the oven to 350 degrees Fahrenheit.",
    "Add the cooked onions, mustard, cream, egg, salt and pepper to the bowl with the potatoes, and gently mix and mash until well incorporated. Add the peas, carrots, olives and pickled jalapeños and mix well. Scrape into a 9” x 11” baking dish or into small individual ramekins.",
    "Bake for 20 to 25 minutes, until the top has slightly browned. Serve or keep warm."
  ],
  "ingredients": [
    "0",
    "3poundsIdaho or Yukon Gold potatoespeeled and diced",
    "1/2poundcarrotspeeled and cut into small dice",
    "1cupfresh peasor thawed from frozen",
    "3tablespoonsunsalted butter",
    "1cupchopped white onion",
    "1tablespoonyellow mustard",
    "2/3cupMexican crema",
    "1large egglightly beaten",
    "1teaspoonkosher or coarse sea salt",
    "To tastefreshly ground black pepper",
    "1/3cupchopped manzanilla olives stuffed with pimientosor more to taste",
    "1/3cupchopped pickled jalapeñosor more to taste"
  ],
  "__v": 1
}