{
  "hash": "d60d10bcc43e379fbf06a2e19c80954abf4802ed",
  "title": "Lemon Meringue Pie",
  "image": "http://assets.simplyrecipes.com/wp-content/uploads/2016/05/lemon-meringue-pie-vertical-b-1600.jpg",
  "href": "http://www.simplyrecipes.com/recipes/lemon_meringue_pie/",
  "extension": "Chrome",
  "firstAdded": "2017-03-02T19:35:47.794000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Pre-bake the pie shell: Preheat oven to 375°F. Line a frozen pie shell with aluminum foil so that the foil extends over the edges (will make convenient handles). Fill two-thirds of the way with pie weights or dry beans.",
    "Bake for 20 minutes. Then remove the foil and the pie weights. Poke the bottom of the crust in several places with the tines of a fork. This will help prevent the bottom from bubbling up.",
    "Put the crust back in the oven and bake for 15 minutes more, or until the crust is lightly browned. Remove from oven and set aside.",
    "(If you are using a packaged frozen pie crust, please follow the directions on the package to pre-bake.)",
    "2 Make the lemon filling: Whisk the egg yolks in a medium bowl and set aside.",
    "In a medium-sized saucepan, add 6 Tbsp cornstarch, 1 1/3 cup sugar, 1/4 teaspoon salt, and 1 1/2 cups water, and whisk to combine. Bring to a boil on medium heat, whisking constantly. Let simmer for 1 minute. The mixture will begin to thicken.",
    "Once the cornstarch mixture has thickened up well (consistency of Cream of Wheat) remove from heat. Take a spoonful of the cornstarch mixture and whisk it into the beaten egg yolks to temper the yolks. Continue to whisk in spoonfuls of the cornstarch mixture until you've used about half of the cornstarch mixture.",
    "Then add the egg yolk mixture back to the pot with the cornstarch. Reduce the heat to low and cook for a minute, stirring.",
    "Remove from heat and stir in the lemon juice, lemon zest, and butter.",
    "3 Preheat oven to 325°F.",
    "4 Prepare cornstarch mixture to help fortify the meringue: In a small saucepan, whisk together 1 Tbsp cornstarch and 1/3 cup of cold water until the cornstarch dissolves. Heat on medium heat and whisk until the mixture bubbles and thickens. Remove from heat and set aside.",
    "5 Whisk together the sugar and cream of tartar: Whisk together 1/2 cup plus 2 tablespoons of sugar and 1/4 teaspoon of cream of tartar, set aside. (If you do not have cream of tartar, instead add a teaspoon of white vinegar to the egg whites with the vanilla in the next step.)",
    "6 Beat egg whites, add sugar and cream of tartar, add cornstarch mixture: Place egg whites and 1/2 teaspoon vanilla extract in the bowl of your mixer. Start beating the egg whites on low speed and gradually increase the speed to medium.",
    "Once the egg whites are frothy, slowly add in the sugar and cream of tartar, a spoonful at a time. Beat until the egg whites form soft peaks.",
    "Add the cornstarch water mixture (it should look like a gel) a spoonful at a time, as you continue to beat the egg whites. Increase the speed to high and continue to beat until the egg whites have formed stiff peaks. Do not over-beat, or your meringue will be grainy.",
    "7 Fill pie shell with filling, top with meringue: Heat the lemon filling again, until it is steamy. Scoop it into the pre-baked pie shell, spreading it evenly.",
    "Working quickly, use a rubber spatula to spread the meringue mixture evenly around the edge of the pie.",
    "Make sure the mixture attaches to the crust with no gaps. The crust will help anchor the meringue and help keep it from shrinking.",
    "Fill in the center with more meringue mixture.",
    "Use the back of a spoon to create peaks all over the meringue.",
    "8 Bake: Bake the pie for 20 minutes at 325°F, until the meringue is golden brown.",
    "Transfer to a wire rack and let cool completely to room temperature. If the pie is even remotely warm when you cut into it, the lemon base may be runny. To help firm up the base, after the pie has cooled down, you can place the pie on top of a cooling pack covered with a tea towel.",
    "Best eaten the same day."
  ],
  "ingredients": [
    "0",
    "1 frozen pie crust (see pie crust recipe for instructions to make your own, use a butter crust or butter and shortening crust recipe)",
    "5 large egg yolks",
    "6 Tbsp cornstarch",
    "1 1/3 cup sugar",
    "1/4 teaspoon salt",
    "1 1/2 cups water",
    "1/2 cup lemon juice",
    "2 teaspoons lemon zest",
    "2 Tbsp butter",
    "1 Tbsp corn starch",
    "1/3 cup cold water",
    "1/4 teaspoon cream of tartar (can use vinegar instead of cream of tartar, see method instructions)",
    "1/2 cup plus 2 Tbsp white granulated sugar",
    "5 large egg whites (room temperature)",
    "1/2 teaspoon vanilla extract"
  ],
  "__v": 1
}