{
  "__v": 1,
  "directions": [
    "0",
    "Combine all filling ingredients in a large mixing bowl and mix thoroughly (I mix by clean hand). Cover and refrigerate until ready to use.",
    "Make the dough, Method 1: Place the flour in the work bowl of a food processor with the dough blade. Run the processor and pour the warm water in until incorporated. Pour the contents into a sturdy bowl or onto a work surface and knead until uniform and smooth. The dough should be firm and silky to the touch and not sticky.[Note: it’s better to have a moist dough and have to incorporate more flour than to have a dry and pilling dough and have to incorporate more water).",
    "Make the dough, Method 2 (my mom’s instructions): In a large bowl mix flour with 1/4 cup of water and stir until water is absorbed. Continue adding water one teaspoon at a time and mixing thoroughly until dough pulls away from sides of bowl. We want a firm dough that is barely sticky to the touch.",
    "Both dough methods: Knead the dough about twenty strokes then cover with a damp towel for 15 minutes. Take the dough and form a flattened dome. Cut into strips about 1 1/2 to 2 inches wide. Shape the strips into rounded long cylinders. On a floured surface, cut the strips into 3/4 inch pieces. Press palm down on each piece to form a flat circle (you can shape the corners in with your fingers). With a rolling pin, roll out a circular wrapper from each flat disc. Take care not to roll out too thin or the dumplings will break during cooking. Leave the centers slightly thicker than the edges. Place a tablespoon of filling in the center of each wrapper and fold the dough in half, pleating the edges along one side (see images above).",
    "To boil: Bring a large pot of water to a boil and add dumplings to pot. Boil the dumplings until they float.",
    "To steam: Place dumplings on a single layer of napa cabbage leaves or on a well-greased surface and steam for about 6 minutes.",
    "To pan fry (potstickers): Place dumplings in a frying pan with 2-3 tbsp of vegetable oil. Heat on high and fry for a few minutes until bottoms are golden. Add 1/2 cup water and cover. Cook until the water has boiled away and then uncover and reduce heat to medium or medium low. Let the dumplings cook for another 2 minutes then remove from heat and serve.",
    "To freeze: Assemble dumplings on a baking sheet so they are not touching. Freeze for 20-30 minutes until dumplings are no longer soft. Place in ziploc bag and freeze for up to a couple of months. Prepare per the above instructions, but allow extra time to ensure the filling is thoroughly cooked.",
    "To serve: Serve dumplings or potstickers hot with your choice of dipping sauce combinations."
  ],
  "firstAdded": "2014-08-15T23:58:28.625000",
  "hash": "111de261b1ed3a79d6f2e974fcef48a19661c7ed",
  "href": "http://userealbutter.com/2007/10/04/chinese-dumplings-and-potstickers-recipe/",
  "image": "http://userealbutter.com/recipe_photos/chinese-dumplings-pot-stickers30.jpg",
  "ingredients": [
    "0",
    "pork filling",
    "1 lb ground pork",
    "4 large napa cabbage leaves, minced",
    "3 stalks green onions, minced",
    "7 shitake mushrooms, minced (if dried – rehydrated and rinsed carefully)",
    "1/2 cup bamboo shoots, minced",
    "1/4 cup ginger root, minced",
    "3 tbsp soy sauce",
    "2 tbsp sesame oil",
    "2 tbsp corn starch",
    "OR",
    "shrimp filling",
    "1/2 lb raw shrimp, peeled, deveined, and coarsely chopped",
    "1/2 lb ground pork",
    "3 stalks green onions, minced",
    "1/4 cup ginger root, minced",
    "1 cup water chestnuts, minced",
    "1 tsp salt",
    "3 tbsp sesame oil",
    "2 tbsp corn starch",
    "dough",
    "Note: you will want to double this for the amount of filling listed – I just tend to use leftover pork filling for soup meatballs. A single batch will yield about 40 dumplings depending on size.",
    "2 cups all-purpose flour",
    "1/2 cup warm water",
    "flour for worksurface",
    "dipping sauce",
    "2 parts soy sauce",
    "1 part vinegar (red wine or black)",
    "a few drops of sesame oil",
    "chili garlic paste (optional)",
    "minced ginger (optional)",
    "minced garlic (optional)",
    "minced green onion (optional)",
    "sugar (optional)"
  ],
  "keywords": [
    "pork",
    "filling",
    "napa",
    "cabbage",
    "leaves",
    "stalks",
    "green",
    "onions",
    "shitake",
    "mushrooms",
    "rehydrated",
    "rinsed",
    "carefully",
    "bamboo",
    "shoots",
    "ginger",
    "root",
    "soy",
    "sesame",
    "oil",
    "corn",
    "starch",
    "shrimp",
    "raw",
    "coarsely",
    "water",
    "chestnuts",
    "salt",
    "dough",
    "want",
    "double",
    "listed",
    "tend",
    "use",
    "leftover",
    "soup",
    "meatballs",
    "single",
    "batch",
    "yield",
    "dumplings",
    "depending",
    "size",
    "allpurpose",
    "flour",
    "worksurface",
    "dipping",
    "parts",
    "vinegar",
    "red",
    "wine",
    "black",
    "drops",
    "chili",
    "garlic",
    "onion",
    "sugar"
  ],
  "title": "chinese dumplings and potstickers",
  "users": [
    null
  ]
}