{
  "hash": "807ca968c754566a1ed7510890ba2f77e0b10aa0",
  "title": "ZUCCHINI LASAGNA",
  "image": "https://www.skinnytaste.com/wp-content/uploads/2012/09/Skinnytaste-Zucchini-Lasagna-550x827.jpg",
  "href": "https://www.skinnytaste.com/zucchini-lasagna/",
  "extension": "Chrome",
  "firstAdded": "2018-10-24T01:32:27.622000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium sauce pan, brown meat and season with salt. When cooked drain in colander to remove any fat.",
    "Add olive oil to the pan and saute garlic and onions about 2 minutes. Return the meat to the pan, add tomatoes, basil, salt and pepper. Simmer on low for at least 30-40minutes, covered. Do not add extra water, the sauce should be thick.",
    "Meanwhile, slice zucchini into 1/8″ thick slices, add lightly salt and set aside or 10 minutes. Zucchini has a lot of water when cooked, salting it takes out a lot of moisture. After 10 minutes, blot excess moisture with a paper towel.",
    "Preheat a gas grill or grill pan to medium high, and grill 2 to 3 minutes per side, until slightly browned. Place on paper towels to soak any excess moisture.",
    "Preheat oven to 375°.",
    "In a medium bowl mix ricotta cheese, parmesan cheese and egg. Stir well.",
    "In a 9×12 casserole spread 1/2 cup of sauce on the bottom and layer the zucchini to cover. Spread 1/2 cup of the ricotta cheese mixture, then top with 1 cup of the mozzarella cheese and repeat the process until all your ingredients are used up. The last layer top with remaining zucchini and sauce, cover with foil and bake 30 minutes. Uncover the foil and bake 20 minutes (to dry up the sauce) then place the remaining 1 cup mozzarella and bake until melted, 10 minutes.",
    "Let stand about 5 – 10 minutes before serving."
  ],
  "ingredients": [
    "0",
    "1 lb 93% lean ground beef",
    "1 1/2 teaspoons kosher salt",
    "1 tsp olive oil",
    "1/2 large onion, chopped",
    "3 cloves garlic, minced",
    "1 (28 oz can) crushed tomatoes",
    "2 tbsp chopped fresh basil",
    "black pepper, to taste",
    "3 medium (8 ounces each) zucchini, sliced 1/8″ thick",
    "1 1/2 cups part-skim ricotta",
    "1/4 cup Parmigiano Reggiano",
    "1 large egg",
    "16 oz (4 cups) shredded part-skim mozzarella cheese"
  ],
  "__v": 1
}