{
  "hash": "35df94261ab6df029cb87541e6ba91aa2d76c750",
  "title": "Strawberry-Basil Upside-Down Cake with Balsamic Glaze and White Chocolate",
  "image": "http://target.scene7.com/is/image/Target/c_Strawberry-Basil-Upside-Down-Cake-with_RT?hei=340",
  "href": "http://www.cooking.com/recipes-and-more/recipes/strawberry-basil-upside-down-cake-balsamic-glaze-white-chocolate-recipe?CCAID=cknwfhne06185az&s=s0085567335s&mid=2101020&rid=85567335",
  "extension": "Chrome",
  "firstAdded": "2015-03-26T19:56:20.702000",
  "users": [
    null
  ],
  "keywords": [
    "cake",
    "divided",
    "strawberries",
    "basil",
    "leaves",
    "light",
    "brown",
    "sugar",
    "flour",
    "baking",
    "soda",
    "salt",
    "unsalted",
    "butter",
    "softened",
    "vanilla",
    "eggs",
    "lowfat",
    "buttermilk",
    "balsamic",
    "glaze",
    "vinegar",
    "firmly",
    "white",
    "chocolate",
    "drizzle"
  ],
  "directions": [
    "0",
    "Preheat the oven to 350 degrees F. Line the bottom of a deep-sided 9-inch round cake pan with parchment paper, then grease the paper with butter.",
    "Arrange 1 1/2 to 2 cups of the sliced strawberries in a single, tightly packed, layer in the bottom of the cake pan.",
    "In a small bowl, mash one cup of strawberries with basil and brown sugar. Gently spoon and spread the mixture over the strawberries in the pan.",
    "In a medium bowl, whisk together the flour, baking soda, baking powder and salt.",
    "In a large bowl or mixer, cream the sugar and butter together until pale and fluffy. Beat in the vanilla then the eggs, one at a time. Gradually add in the flour, alternating with the buttermilk, and ending with flour. Mix until the flour is just combined (if you overmix, the cake texture won’t be as delicate).",
    "Pour cake batter over the strawberries, smoothing it out evenly toward the edges of the pan.",
    "Bake 45 to 50 minutes, until the top is browned and a toothpick inserted in the center comes out clean. Let cool for 5 minutes then run a knife around the edges of the pan to loosen the sides. Invert the cake onto a serving platter and remove the parchment paper.",
    "To make the white chocolate drizzle, cut the chocolate into small chunks and prepare a double boiler. Heat the chocolate over the double boiler with the water at a boil for about 3 minutes, stirring, then, if needed, cut the heat down to low and stir until completely melted. It’s essential not to let any of the water into the chocolate or it will seize up. (Microwaving at a reduced power level in short time segments, stirring each time, is also an option.) Use a pastry bag with a small round tip or spoon melted chocolate into a resealable plastic bag and snip off a corner to drizzle.",
    "To make the balsamic glaze: in a small saucepan over medium heat, heat the balsamic vinegar with the brown sugar. Reduce the mixture by half, stirring often and keeping an eye out that it doesn't burn, about 4 to 5 minutes. Use a fork to drizzle the glaze over the cake or place in a plastic resealable bag and snip off a corner to drizzle.",
    "Garnish the cake with a drizzle of balsamic glaze, a drizzle of white chocolate sauce, strawberries and basil leaves."
  ],
  "ingredients": [
    "0",
    "Cake:",
    "2 1/2 to 3 cups sliced fresh strawberries, divided, plus whole strawberries for garnish",
    "1 tablespoon minced basil plus whole leaves for garnish",
    "1/2 cup light brown sugar",
    "1 3/4 cups flour",
    "1/2 teaspoon baking soda",
    "1 1/2 teaspoons baking powder",
    "1/4 teaspoon salt",
    "1 cup sugar",
    "1 stick unsalted butter, softened",
    "1 teaspoon vanilla extract",
    "2 large eggs",
    "3/4 cup low-fat buttermilk",
    "Balsamic Glaze:",
    "1/3 cup balsamic vinegar",
    "1 tablespoon light brown sugar, firmly packed",
    "White Chocolate Drizzle:",
    "3 or 4 ounces white chocolate"
  ],
  "__v": 1
}