{
  "hash": "b3a056448235d22dbbd88b414c443b2653777828",
  "title": "WINTER VEGETABLE HOMINY HASH EN CROUTE",
  "image": "",
  "href": "http://www.thugkitchen.com/veggie_hash_en_croute",
  "extension": "Chrome",
  "firstAdded": "2016-11-06T02:02:26.761000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Warm up the oven to 400 degrees and line a large baking sheet with some parchment paper.",
    "In a large sauté pan, skillet, or wok warm up the olive oil over a medium heat. Add the onion and sauté until it starts to look translucent, about 3 minutes. Add the tempeh and keep cooking until it starts to brown in some places, another 3-5 minutes. Now add the bell pepper, carrot, parsnip, and mushrooms. Cook all that shit until everything starts to soften up, 3 minutes. You’ll be able to tell. Now sprinkle the soy sauce and garlic over the whole damn pot, stir, then add the chili powder, paprika, oregano, and cinnamon and stir it all up so everything is coated. Your place will start to smell so damn good that you can anticipate a “what’s cooking” comment from your nosey neighbor. Then add the hominy and white wine and sorta scrap up anything that’s been sticking to the bottom of the pan. Let it all cook together for about a minute so some of the wine will evaporate then add the lime juice and turn off the heat. Taste and add more garlic or whatever the fuck you are missing. You can make this filling the day before too if you’re one of those people who plan shit.",
    "When you’re ready to bake everything, put 2 of the 9” by 9” end to end and roll them together to seal the crease and make it one long piece on a well-floured surface. Then roll it a little more so you get a sheet that’s about 11” by 17”. Add half the filling to half of the sheet that’s closest to you, leaving about half an inch around. Wet the edges with a little water to help that shit stick here in a minute. Now fold that fucker over like you’re tucking a food baby with a puff pastry blanket, pressing the seams together so that they stick, and kinda tucking the ends and the seam under the log. Transfer this whole thing to your baking dish then brush it with a little olive oil and sprinkle some extra paprika and oregano on top for looks. Cut a couple slits in some kinda pattern to take the fancy level even higher. Repeat with the rest of the puff pastry and filling.",
    "Stick that shit in the oven and bake it for 25-35 minutes or until it looks golden brown and flakey as fuck.",
    "Serve warm along with some pumpkin seed and chipotle sauce and prepare yourself for compliments.",
    "* Cant find a parsnip or don’t even wanna fucking look? Use more carrot instead.",
    "** Hominy is when maize kernels get soaked in a lime mixture and get all swollen up. It’s fucking awesome. You can buy hominy already cooked in cans near the beans and salsa at the store, or you can find it dried and cook it yourself like the package says.",
    "*** Don’t have a bottle already open on Thanksgiving? Get your shit together. Not drinking? Use vegetable broth instead.",
    "**** Puff pastry will be in the freezer section of the store, next to the piecrusts. There’s recipes out there to make this from scratch but on Thanksgiving love yourself and get that shit from the store. You’ve got enough holiday fuckery on your plate."
  ],
  "ingredients": [
    "0",
    "Serves 6-8 people",
    "2 tablespoons olive oil",
    "1 brown onion, chopped",
    "8 ounce block of tempeh, crumbled into small pieces with your hands",
    "1 red bell pepper, chopped",
    "1 cup grated carrot",
    "1 cup grated parsnip*",
    "1 ½ cups chopped cremini mushrooms",
    "2 cloves garlic, minced",
    "2 tablespoons soy sauce, tamari, or braggs",
    "1 tablespoon mild chili powder",
    "1 teaspoon paprika",
    "½ teaspoon dried oregano",
    "¼ teaspoon cinnamon",
    "2 cups hominy**",
    "¼ cup white wine***",
    "2 tablespoons lime juice",
    "4 9” by 9” sheets of puff pastry, defrosted****",
    "olive oil for brushing"
  ],
  "__v": 1
}