{
  "hash": "b2696b1317b155c3169e8e6105fe7e250f72c23a",
  "title": "How To Cook the Perfect Pork Belly",
  "image": "http://recipe-folder.com/img/recipe-images/010/471/1249771010.jpg",
  "href": "http://www.foodtolove.co.nz/how-to-cook-the-perfect-pork-belly-35055?utm_source=exacttarget&utm_medium=email&utm_campaign=49545&utm_content=413090&user_id=a9bb80cc3ddc66cd1b4abd435638aa1477970e8c",
  "extension": "Firefox",
  "firstAdded": "2016-09-22T01:05:17.383000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare the meat for cooking",
    "Prick or score the fat and rub in a generous amount of salt. Place, uncovered, in the fridge for at least 2 hours but preferably overnight. Wipe off the excess moisture and salt with paper towels before cooking.",
    "Cook it slowly and carefully",
    "The best crackling is produced slowly; this way, it is crisp but not greasy. Give the pork a blast of about 20 minutes at 230°C at the start of cooking to get the process going and ensure the entire surface dries out. Reduce the temperature and continue cooking the meat as per your recipe. The pockets of air in the crackling expand and dry out with a super-crispy result.",
    "Make sure it's well rested",
    "When the pork is cooked, leave it to cool slightly in the cooking liquid. Line a flat baking tray with plastic wrap. Carefully lift the pork into the tray and make sure you get rid of any bits of vegetables or herbs, as they will end up pressed into the pork. Cover the pork with another sheet of plastic wrap and then cover with a flat tray or dish. Weigh the pork down with some cans and leave to cool in the fridge overnight.",
    "Trim and cut into portions",
    "Unwrap and trim uneven edges so that you have a neat sheet of meat. Cut the meat into portions, place on a rack in the oven to reheat and finish with a careful turning under a grill set to medium (not high) and not too close, to catch any bits that haven’t bubbled."
  ],
  "ingredients": [
    "0",
    "Pork belly"
  ],
  "__v": 2
}