{
  "__v": 1,
  "directions": [
    "0",
    "To prepare the filling, combine the cream cheese and confectioners’ sugar in a medium bowl and mix well until blended and smooth. Refrigerate the mixture while you make the muffins to allow it to cool and thicken slightly.",
    "For the muffins, preheat your oven to 350˚ F and line or spray your muffin pans. In a medium bowl, combine the flour, cinnamon, nutmeg, cloves, pumpkin pie spice, salt and baking soda then whisk to blend. In a large bowl using an electric mixer on medium-low speed combine the eggs, sugar, pumpkin puree and oil until blended. Turn the mixer to low and add in the dry ingredients, mix just until incorporated.",
    "Fill each muffin pan with just enough batter to cover the bottom of each well (about 1-2 tablespoons). Scoop a small amount of the cream cheese mixture into each muffin well, then top each with the remaining batter, covering the cream cheese completely.",
    "Bake for 20-25 minutes (30-35 for large muffins). Transfer to a wire rack and let cool completely before serving. It may be tempting to eat them hot from the oven, but the cream cheese will be extremely hot, patience is a virtue."
  ],
  "firstAdded": "2014-06-28T16:43:15.874000",
  "hash": "88d47b321621377ce7b703b0b005c8950b03a054",
  "href": "http://www.seebrookecook.com/2011/09/pumpkin-cream-cheese-muffins.html",
  "image": "http://2.bp.blogspot.com/-k5Jq8mJTPWk/ToXGscUK9gI/AAAAAAAAAMI/WLhgGE3w27E/s400/pumpmuff1.jpg",
  "ingredients": [
    "0",
    "Ingredients:",
    "For the filling:",
    "8 oz cream cheese, softened (I used light)",
    "1 cup confectioners’ sugar",
    "For the muffins:",
    "3 cups white-wheat/all-purpose flour",
    "1 tsp ground cinnamon",
    "1 tsp ground nutmeg",
    "1 tsp ground cloves",
    "1 Tbsp plus 1 tsp pumpkin pie spice",
    "1 tsp salt",
    "1 tsp baking soda",
    "4 large eggs",
    "2 cups sugar",
    "2 cups pumpkin puree",
    "1¼ cups vegetable oil (or applesauce, I used half of each)"
  ],
  "keywords": [
    "filling",
    "cream",
    "cheese",
    "softened",
    "used",
    "light",
    "confectioners",
    "sugar",
    "muffins",
    "whitewheatallpurpose",
    "flour",
    "cinnamon",
    "nutmeg",
    "pumpkin",
    "pie",
    "spice",
    "salt",
    "baking",
    "soda",
    "eggs",
    "puree",
    "oil",
    "applesauce"
  ],
  "title": "Pumpkin Cream Cheese Muffins",
  "users": [
    null
  ]
}