{
  "hash": "8f984f7bce28e036067e4e3ab591c01cba6bbb56",
  "title": "Pineapple Pork Kebabs (no grill required)",
  "image": "http://www.budgetbytes.com/wp-content/uploads/2015/06/Pineapple-Pork-Kebabs-text.jpg",
  "href": "https://www.budgetbytes.com/2015/06/pineapple-pork-kebabs-no-grill-required/",
  "extension": "",
  "firstAdded": "2017-03-01T05:30:18.863000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "If using wooden or bamboo skewers, soak the skewers in water for at least 30 minutes to help prevent burning under the broiler.",
    "Prepare the marinade by mincing two cloves of garlic and grating about one inch of fresh ginger into a bowl. Add the soy sauce, oil, and honey. Stir to combine.",
    "Cut the pork chops into one inch cubes. Place the cubed pork in a bowl or shallow dish and pour the marinade over top. Stir until the pork is coated in the marinade. Cover the dish and refrigerate for at least 30 minutes.",
    "Cut the onion and bell pepper into one-inch pieces. Drain the juice from the canned pineapple chunks. Place the onion and bell pepper in a bowl, add one tablespoon of oil, and a liberal sprinkle of salt and pepper. Toss to coat.",
    "Thread the soaked skewers with alternating pieces of onion, bell pepper, pineapple, and pork until all the pieces are used. Arrange the skewers on a broiler pan or a sheet pan with wire racks set on top.",
    "Adjust the oven rack so that the top of the skewers will be 5-6 inches from the broiler. Preheat the broiler on high for at least five minutes. Place the skewers under the broiler and cook for five minutes, or just until the edges begin to brown. rote the skewers and return to the oven for an additional five minutes. Continue cooking and rotating the skewers until they are evenly browned on all sides.** Top the kebabs with fresh chopped cilantro and a squirt of Sriracha, if desired."
  ],
  "ingredients": [
    "0",
    "2 cloves garlic, minced $0.16",
    "1 inch fresh ginger, grated $0.12",
    "2 Tbsp soy sauce $0.30",
    "2 Tbsp canola or vegetable oil $0.18",
    "1 Tbsp honey $0.12",
    "1",
    "1.25 lbs. boneless pork chops $1.96*",
    "1 Vidalia onion $0.69",
    "1 green bell pepper $0.79",
    "1 20oz. can pineapple chunks (packed in juice) $1.37",
    "1 Tbsp canola or vegetable oil $0.05",
    "salt and pepper $0.05",
    "2",
    "½ bunch cilantro $0.50",
    "Sriracha (to taste) $0.50"
  ],
  "__v": 1
}