{
  "hash": "1a50375ae106b7600950955bbf6ad2a9096033f1",
  "title": "Apple Crepes",
  "image": "http://cdn-image.myrecipes.com/sites/default/files/styles/300x300/public/image/recipes/ay/10/01/apple-crepes-ay-1946187-x.jpg?itok=sIEatHDl",
  "href": "http://www.myrecipes.com/recipe/apple-crepes",
  "extension": "Chrome",
  "firstAdded": "2015-05-18T19:53:54.808000",
  "users": [
    null,
    null
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "click",
    "savings",
    "sugar",
    "salt",
    "eggs",
    "lightly",
    "lowfat",
    "milk",
    "unsalted",
    "butter",
    "tart",
    "apples",
    "granny",
    "smith",
    "cubes",
    "cinnamon",
    "apple",
    "juice",
    "cider",
    "plain",
    "vanilla",
    "yogurt"
  ],
  "directions": [
    "0",
    "Make crepe batter: In a blender, pulse flour, 1 Tbsp. sugar and salt. Add eggs and milk; blend until mixture is thick and no lumps remain. Pour into a bowl and let stand at room temperature for 30 minutes.",
    "Make filling: Melt butter in a skillet; add apples. Sauté, stirring occasionally, until apples begin to soften, about 3 minutes. Sprinkle with remaining 3 Tbsp. sugar and cinnamon and sauté until apples begin to brown, about 5 minutes longer. Pour in juice; cook 2 minutes longer, stirring. Remove from heat.",
    "Whisk batter. If necessary, thin with an additional tablespoon of milk (batter should have consistency of thin cream). Mist a 10-inch nonstick skillet with cooking spray and warm over medium heat. When pan is hot, ladle in 1/4 cup of batter. Quickly tilt skillet so batter coats surface in a thin layer. Cook until edges begin to brown, about 2 minutes. Lift edge of crepe and, using your fingers, carefully flip. Cook for 30 seconds; transfer to a plate. Cover with a clean kitchen towel. Repeat with remaining batter, misting skillet with cooking spray between crepes as necessary.",
    "Over low heat, rewarm apple mixture. Fold each crepe into quarters. Arrange 2 on each plate and top with a portion of apple mixture and a dollop of yogurt, if desired."
  ],
  "ingredients": [
    "0",
    "1 1/4 cups all-purpose flour $Click to see savings",
    "1/4 cup sugar $Click to see savings",
    "Pinch of salt",
    "4 large eggs, lightly beaten $Click to see savings",
    "1 1/4 cups low-fat milk $Click to see savings",
    "1 tablespoon unsalted butter",
    "3 tart apples, such as Granny Smith, peeled and cut into 1/2-inch cubes $Click to see savings",
    "1/4 teaspoon cinnamon $Click to see savings",
    "1/4 cup apple juice or cider $Click to see savings",
    "Plain or vanilla yogurt, optional $Click to see savings"
  ],
  "__v": 2
}