{
  "hash": "9ac66cf9b5fb9dd6d06a8d0ae8aa34a3e2960cf3",
  "title": "Overnight French Bread",
  "image": "https://www.butteredsideupblog.com/wp-content/uploads/2017/09/Overnight2BFrench2BBread2B14-150x150.jpg",
  "href": "https://www.butteredsideupblog.com/overnight-french-bread-a-care-package-with-bobs-red-mill/",
  "extension": "Firefox",
  "firstAdded": "2018-12-25T08:12:36.941000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Whisk the yeast into the water with 1/4 teaspoon of the sugar. Let sit for 5 minutes.",
    "Add the yeast mixture, remaining sugar, olive oil, 2 cups of the flour, and salt to the bowl of a stand mixer fitted with the paddle attachment. Beat on low speed until everything is moistened. Switch to the dough hook and knead for 8 minutes, adding enough extra flour to make a soft but smooth dough. You just want the dough to clear the sides of the bowl. Don’t add too much flour!",
    "Transfer the dough to an large, oiled bowl and turn to coat with the oil. Cover tightly and place in the refrigerator overnight, or 8-12 hours.",
    "The next morning, let the dough sit at room temp for 30 minutes to take off the chill.",
    "Form the dough into a long log. Place on a piece of parchment paper on top of a wooden cutting board or pizza peel. Using the edge of your hands, tuck the sides of the dough under again and again. This forms surface tension on the dough. Cover and let rise for 1 hour.",
    "45 minutes into the rising time, preheat your oven to 425 degrees F. Place a heavy baking sheet or pizza stone in the oven to preheat. Place a metal baking pan underneath the baking sheet. Have a kettle of water on hand.",
    "Transfer the risen dough, parchment paper and all, onto the preheated baking sheet/pizza stone. Pour about 1-2 cups of water into the baking pan underneath the bread and quickly shut the oven door. Don’t open the oven door for the next 15 minutes at least (otherwise you’ll let the steam escape).",
    "Bake for 20-25 minutes, or until the crust is deep golden brown. Remove from oven and place on a wire cooling rack to cool completely."
  ],
  "ingredients": [
    "0",
    "1 package active dry yeast (about 2 1/4 tsp)",
    "1 cup warm water (no more than 110 degrees F)",
    "1 tbsp + 1 tsp organic cane sugar",
    "2 tbsp extra virgin olive oil",
    "3 to 3 1/2 cups Bob's Red Mill organic all-purpose flour divided",
    "1 1/2 tsp unrefined sea salt"
  ],
  "__v": 1
}