{
  "__v": 3,
  "directions": [
    "0",
    ">>> For Cake",
    "--------------------",
    "Preheat oven to 175 degrees Celcius and place rack in center of oven. Grease two 9in (23 cm) round cake pans and line the bottoms of the pans with parchment paper. Set aside.",
    "In a mixing bowl sift together flour, salt, and cocoa powder. Set aside.",
    "In bowl of your electric mixer, beat the butter until soft (about 1-2 minutes). Add the sugar and beat until light and fluffy (about 2-3 minutes). Add the eggs, one at a time, beating well after each addition. Add the vanilla extract and beat until combined.",
    "In a measuring cup, whisk the buttermilk with the dragon fruit/beetroot juice and red food coloring. With the mixer on low speed, alternately add the flour mixture and buttermilk to the butter mixture, in three additions, beginning and ending with the flour.",
    "Lastly, in a small cup combine the vinegar and baking soda. Allow the mixture to fizz and then quickly fold into the cake batter.",
    "Working quickly, divide the batter evenly between the two prepared pans and smooth the top with an offset spatula or the back of a spoon. Bake in the preheated oven for approximately 25 - 30 minutes, or until a toothpick inserted in the center of the cakes comes out clean. Cool the cakes in their pans on a wire rack for 10 minutes. Place a wire rack on top of the cake pan and invert, lifting off the pan. Once the cakes have completely cooled, wrap in plastic and place the cake layers in the refrigerator for at least an hour (or overnight). (This is done to make filling and frosting the cakes easier.)",
    "----------------------------------",
    ">>> For Cream Cheese Frosting",
    "----------------------------------",
    "In the bowl of your electric mixer, beat the cream cheese and butter until smooth.",
    "Add the vanilla and icing sugar and continue to beat until light and slightly fluffy.",
    "Using the whisk attachment, gradually add the heavy cream and whip until the frosting is thick enough to spread. Add more cream as needed to get the right spreadable or piping consistency.",
    "-----------------------------",
    ">>> For Chocolate Frosting",
    "-----------------------------",
    "Combine the cream in the pan and bring to boil.",
    "Remove from heat and pour the boiling cream over the chocolate.",
    "Stir with a wooden spoon until creamy and smooth.",
    "Cover chocolate mixture with clingfilm and refrigerate for 1 to 2 hours before use.",
    "-----------------------",
    ">>> Assemble",
    "-----------------------",
    "With a serrated knife, cut each cake layer in half, horizontally. You will now have four cake layers.",
    "Place one of the cake layers, top of the cake facing down, onto your serving platter. Spread the cake layer with a layer of cream cheese frosting.",
    "Place another layer of cake on top of the frosting and alternately continue to frost with chocolate and stack the cake layers.",
    "Finally, frost the top and sides of the cake if possible. You may garnish the cake with shredded coconut."
  ],
  "firstAdded": "2014-10-16T05:17:14.485000",
  "hash": "22817fc2fa48c97a6b4e45cae3b9ad9cd0ae9876",
  "href": "http://www.thestar.com.my/Lifestyle/Food/Recipes/2011/11/21/Red-Velvet-Cake/",
  "image": "http://www.thestar.com.my/~/media/Images/TSOL/Photos-Gallery/Kuali/2011/11/velvet11.ashx?w=620&h=413&crop=1&",
  "ingredients": [
    "0",
    "250g self raising flour",
    "1/2 tsp salt",
    "18g cocoa powder",
    "115g unsalted butter, at room temperature",
    "180g sugar",
    "2 large eggs",
    "1 tsp vanilla extract",
    "150g buttermilk**",
    "100g beetroot / red dragon fruit juice",
    "1 tbsp red food colouring , use more if necessary",
    "1 tsp white vinegar",
    "1 tsp baking soda",
    "---------------------------------------------------",
    "**You can make your own buttermilk by adding 1.5 tsp of white vinegar, cider vinegar, or lemon juice to 150g of milk. Let this mixture stand 5 to 10 minutes before use.",
    "------------------------------",
    "Cream Cheese Frosting",
    "------------------------------",
    "250g cream cheese, room temperature",
    "125g unsalted butter, room temperature",
    "1 tsp vanilla extract",
    "80g icing sugar, sifted",
    "100g chilled heavy whipping cream (double cream) (35-40% butterfat)",
    "---------------------------",
    "Chocolate Frosting",
    "---------------------------",
    "350g heavy whipping cream",
    "350g dark chocolate couverture, chopped",
    "50g butter, softened"
  ],
  "keywords": [
    "self",
    "raising",
    "flour",
    "salt",
    "cocoa",
    "unsalted",
    "butter",
    "room",
    "sugar",
    "eggs",
    "vanilla",
    "buttermilk",
    "beetroot",
    "red",
    "dragon",
    "fruit",
    "juice",
    "food",
    "colouring",
    "use",
    "necessary",
    "white",
    "vinegar",
    "baking",
    "soda",
    "make",
    "adding",
    "cider",
    "lemon",
    "milk",
    "mixture",
    "stand",
    "minutes",
    "cream",
    "cheese",
    "frosting",
    "icing",
    "sifted",
    "chilled",
    "whipping",
    "double",
    "butterfat",
    "chocolate",
    "dark",
    "couverture",
    "softened"
  ],
  "title": "Red Velvet Cake",
  "users": [
    null
  ]
}