{
  "hash": "db4e0d95d45d86e3cab0436de9aa29174c547757",
  "title": "Roasted Broccoli Salad with Feta, Barley, and Pomegranate",
  "image": "http://assets.simplyrecipes.com/wp-content/uploads/2016/12/22180525/2016-12-27-Broccoli-Salad-5.jpg",
  "href": "http://www.simplyrecipes.com/recipes/roasted_broccoli_salad_with_feta_barley_and_pomegranate/",
  "extension": "Chrome",
  "firstAdded": "2016-12-31T03:24:18.740000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Cook the barley: Bring a medium saucepan of salted water to a boil. Add the barley, turn the heat to simmer, and cook, uncovered, for 30 minutes, or until tender. Drain and set aside.",
    "2 Meanwhile, begin heating the oven to 450F. Line a rimmed baking sheet with parchment.",
    "3 Prep the broccoli: Separate the broccoli crowns from the stems. Separate the crowns into florets. Peel off the tough outer skin from the stems with a vegetable peeler, and then cut into bite-size pieces.",
    "4 Roast the broccoli: On the baking sheet, spread the broccoli florets and stems and sprinkle with the oil. Use your hands to massage the oil into the broccoli so it is well coated, and spread in one layer. Sprinkle with 1/4 teaspoon salt and some freshly-ground black pepper.",
    "Roast for 15 minutes, or until tender. Remove and let cool.",
    "5 Toast the almonds: As the broccoli roasts, spread the almonds in one layer on a baking sheet and toast in the oven for 3 to 5 minutes, or until golden. Watch carefully so they don't burn. Remove and let cool",
    "6 Make the dressing: In a small bowl, whisk the vinegar, lemon juice, mustard, salt and pepper together. Gradually whisk in oil.",
    "7 Assemble the salad: In a bowl, toss the barley, broccoli and spinach with the dressing. Transfer to plates or bowls and sprinkle with the almonds, feta and pomegranate seeds."
  ],
  "ingredients": [
    "0",
    "2/3 cup pearl barley",
    "2 pounds broccoli with the stems",
    "2 tablespoons olive oil",
    "1/4 teaspoon salt",
    "Freshly-ground black pepper",
    "1/3 cup sliced almonds",
    "4 handfuls fresh baby spinach leaves",
    "1/2 cup crumbled feta",
    "Seeds (arils) from 1/2 pomegranate, about 1/2 cup",
    "2 tablespoons balsamic vinegar",
    "1 tablespoon lemon juice",
    "1 teaspoon Dijon mustard",
    "Salt and pepper, to taste",
    "1/3 cup olive oil"
  ],
  "__v": 1
}