{
  "hash": "442c010fd241cd6355ba99fe26d861d92cced2fc",
  "title": "Corn and Black Bean Cakes",
  "image": "",
  "href": "http://www.forksoverknives.com/recipes/corn-black-bean-cakes/",
  "firstAdded": "2015-01-13T14:27:07.514000",
  "users": [
    null
  ],
  "keywords": [
    "wheat",
    "pastry",
    "flour",
    "cornmeal",
    "aluminumfree",
    "baking",
    "salt",
    "unflavored",
    "plant",
    "milk",
    "applesauce",
    "medium",
    "red",
    "bell",
    "pepper",
    "seeded",
    "frozen",
    "corn",
    "kernels",
    "thawed",
    "canned",
    "black",
    "beans",
    "rinsed",
    "onions",
    "white",
    "light",
    "green",
    "parts",
    "tomato",
    "salsa",
    "use",
    "storebought",
    "sour",
    "cream",
    "cilantro"
  ],
  "directions": [
    "0",
    "Preheat the oven to 200°F.",
    "In a large bowl, whisk together the flour, cornmeal, baking powder, and salt until well combined. Make a well in the center of the flour mixture and add the plant milk, applesauce, bell pepper, corn, black beans, and green onions. Gently fold the ingredients together just until incorporated. Do not overmix.",
    "Heat a griddle or large nonstick pan over medium heat until a few droplets of water dropped in the pan jump and sizzle.",
    "Spoon ½ cup batter for each pancake onto the pan, making sure they don’t touch each other, until no more will fit. Cook until the undersides are crisp and the pancake can be flipped easily without falling apart, about 4 minutes. Using a spatula, turn the pancakes over and cook until the other side is lightly browned and crisp, about 4 minutes. Transfer the pancakes to a heatproof platter and place in the oven to keep warm. Repeat with the remaining batter.",
    "Serve the pancakes topped with salsa, sour “cream,” and chopped cilantro."
  ],
  "ingredients": [
    "0",
    "1½ cups whole wheat pastry flour",
    "½ cup cornmeal",
    "1 tablespoon aluminum-free baking powder",
    "½ teaspoon sea salt",
    "1½ cups unsweetened, unflavored plant milk",
    "1⁄4 cup unsweetened applesauce",
    "1 medium red bell pepper, seeded and finely diced",
    "1 (10-ounce) package frozen corn kernels, thawed",
    "1 cup cooked or canned black beans, rinsed and drained",
    "6 green onions, white and light green parts thinly sliced",
    "Tomato Salsa (or use store-bought), for serving",
    "Sour “cream,\" for serving",
    "chopped fresh cilantro, for serving"
  ],
  "__v": 1
}