{
  "hash": "09f7fad3ced634bfff2b5f79df6172052d810907",
  "title": "Chicken Fried Steak",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2006/6/26/0/ea1004_country_fried_steak2.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/alton-brown/chicken-fried-steak-recipe.html",
  "firstAdded": "2015-01-24T23:31:14.454000",
  "users": [
    null
  ],
  "keywords": [
    "beef",
    "round",
    "trimmed",
    "excess",
    "fat",
    "kosher",
    "salt",
    "black",
    "pepper",
    "allpurpose",
    "flour",
    "eggs",
    "oil",
    "chicken",
    "broth",
    "milk",
    "thyme",
    "leaves"
  ],
  "directions": [
    "0",
    "Preheat oven to 250 degrees F.",
    "Cut the meat with the grain into 1/2-inch thick slices. Season each piece on both sides with the salt and pepper. Place the flour into a pie pan. Place the eggs into a separate pie pan. Dredge the meat on both sides in the flour. Tenderize the meat, using a needling device, until each slice is 1/4-inch thick. Once tenderized, dredge the meat again in the flour, followed by the egg and finally in the flour again. Repeat with all the pieces of meat. Place the meat onto a plate and allow it to sit for 10 to 15 minutes before cooking.",
    "Place enough of the vegetable oil to cover the bottom of a 12-inch slope-sided skillet and set over medium-high heat. Once the oil begins to shimmer, add the meat in batches, being careful not to overcrowd the pan. Cook each piece on both sides until golden brown, approximately 4 minutes per side. Remove the steaks to a wire rack set in a half sheet pan and place into the oven. Repeat until all of the meat is browned.",
    "Add the remaining vegetable oil, or at least 1 tablespoon, to the pan. Whisk in 3 tablespoons of the flour left over from the dredging. Add the chicken broth and deglaze the pan. Whisk until the gravy comes to a boil and begins to thicken. Add the milk and thyme and whisk until the gravy coats the back of a spoon, approximately 5 to 10 minutes. Season to taste, with more salt and pepper, if needed. Serve the gravy over the steaks.",
    "Recipe courtesy Alton Brown, 2006"
  ],
  "ingredients": [
    "0",
    "2 pounds beef bottom round, trimmed of excess fat",
    "2 teaspoons kosher salt",
    "1 teaspoon freshly ground black pepper",
    "1 cup all-purpose flour",
    "3 whole eggs, beaten",
    "1/4 cup vegetable oil",
    "2 cups chicken broth",
    "1/2 cup whole milk",
    "1/2 teaspoon fresh thyme leaves"
  ],
  "__v": 1
}