{
  "hash": "21886f6df2eabfcc039365403608cf73fbaa313e",
  "title": "Why You Should Bake Your Eggs Inside An Avocado",
  "image": "",
  "href": "http://www.epicurious.com/recipes-menus/why-you-should-bake-your-eggs-inside-an-avocado-article",
  "firstAdded": "2015-02-04T23:19:18.035000",
  "users": [
    null
  ],
  "keywords": [
    "baking",
    "eggs",
    "inside",
    "bread",
    "time",
    "gave",
    "egg",
    "inahole",
    "upgrade",
    "deserves"
  ],
  "directions": [
    "0",
    "What do you all think of this eggs in exciting holes trend? I happen to be a huge fan, especially of eggs in avocado. For starters, it's a glorious one-two punch of omega-3's in the morning--who wouldn't want that? Also, warm avocado is not as scary as it sounds. The flavor does change a bit, but not in a bad way--more in a smoky, delicious kind of way. Finally, that warm creamy texture with an oozing egg on top is everything I want for breakfast in the colder months. The best part is that the whole thing takes less than 5 minutes to prep. Here's how you do it:",
    "Halve your avocado and remove the stone. Scoop out some of the flesh (about 1 tablespoon) so you have a hole big enough for your egg. Repeat with remaining avocados.",
    "Put your avocados in a small baking dish. You want them to be sort of snug, so they don't tip over. It helps to nestle the avocados in pie weights, dried beans, or coarse salt to keep them standing up straight.",
    "Crack one egg at a time into a small ramekin or glass. Slide the eggs carefully into the holes of each avocado. (Pro tip: Put a couple drops of hot sauce or whatever condiment you like in the hole before you add the egg.)",
    "Season with salt and pepper and drizzle any desired condiments over the avocado halves (I like to put a little pesto or chimichurri here).",
    "Bake at 450°F for 10 to 12 minutes, or until your egg whites are set and the yolks are still a little runny. (Don't like an oozy yolk? Beat the eggs before you add them to the avocado.)",
    "Douse with more desired condiments or toppings (cilantro, scallions, and chiles are all delicious options) and enjoy!"
  ],
  "ingredients": [
    "0",
    "Still baking your eggs inside a piece of bread? It's time you gave your egg -in-a-hole the upgrade it deserves."
  ],
  "__v": 1
}