{
  "__v": 1,
  "directions": [
    "0",
    "Peel, seed and dice the tomatoes, reserving the juices. In a small pot, bring the chicken broth to a boil; add the tomatoes and juices, onion and green pepper, and let simmer while you prepare the roux.",
    "In a separate skillet, heat the butter or bacon fat over medium heat; stir in the flour. Cook and stir over medium, stirring constantly, until roux reaches a light beige color. Quickly stir in the broth and tomato mixture, adding slowly, but continuously, until fully incorporated. Stir in the milk and season with salt and pepper, and simmer for 5 to 10 minutes or until nicely thickened. Taste and adjust seasonings. Serve over hot biscuits, with meatloaf, over rice, or spooned on grits alongside some fried catfish and with some hushpuppies on the side.",
    "Cook's Note: I prefer the creaminess from milk, however, plain tap water may be substituted. May also substitute 1 (14.5 ounce) can of stewed/diced tomatoes, undrained, or whole tomatoes, undrained, then chopped, for the fresh tomatoes. Use a pair of kitchen shears to chop the tomatoes up right in the can. Double tomatoes if you prefer. May also be made without the onion and bell pepper if desired."
  ],
  "firstAdded": "2014-08-13T23:57:52.643000",
  "hash": "b9e91b60f35e310216907d056685180adcae5f73",
  "href": "http://www.deepsouthdish.com/2009/10/southern-homestyletomato-gravy.html",
  "image": "http://3.bp.blogspot.com/_OFpCCX-zBts/TS9D7S1wtBI/AAAAAAAANlo/4L7pOpvKNd0/s400/Homestyle%2BTomato%2BGravy.jpg",
  "ingredients": [
    "0",
    "2 cups of chopped tomatoes, with liquid (about 3 medium)",
    "1 tablespoon of finely chopped onion",
    "1 tablespoon of finely chopped green bell pepper",
    "1 cup of chicken broth",
    "1/2 cup of butter or bacon fat",
    "1/2 cup of all purpose flour",
    "1 to 2 cups of milk or water, for desired consistency",
    "Kosher salt & fresh cracked pepper",
    "Commercial or homemade biscuits"
  ],
  "keywords": [
    "tomatoes",
    "medium",
    "onion",
    "green",
    "bell",
    "pepper",
    "chicken",
    "broth",
    "butter",
    "bacon",
    "fat",
    "purpose",
    "flour",
    "milk",
    "water",
    "desired",
    "consistency",
    "kosher",
    "salt",
    "cracked",
    "commercial",
    "biscuits"
  ],
  "title": "Southern Homestyle Tomato Gravy",
  "users": [
    null
  ]
}