{
  "hash": "8374a58836ed692cc8354d0020aeab50d10e471f",
  "title": "Festive Beet Citrus Salad with Kale and Pistachios",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2013/12/beet-citrus-salad-kale-vertical-a-1200.jpg",
  "href": "https://www.simplyrecipes.com/recipes/festive_beet_citrus_salad_with_kale_and_pistachios/",
  "extension": "",
  "firstAdded": "2018-01-28T00:03:47.496000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Cook the beets: Scrub the beets clean, leaving the skin on. You can boil or roast the beets to cook them.",
    "If boiling, boil the beets separately by color (otherwise the red beets will run into the the orange, turning the orange beets red). Place each batch of beets in a pot and cover with water by about an inch. Add a couple teaspoons of salt. Bring to a boil and reduce to a simmer. Simmer until you can just pierce easily with a fork, 30 to 60 minutes, depending on the size of the beets. Drain. Let cool. Rub the skins off.",
    "To roast the beets, wrap them in foil and roast them in a 400°F oven for 1 to 1 1/2 hours, until fork tender. Then cool and peel. See our roasted beets recipe.",
    "2 While the beets are cooking, prepare the dressing and prep the rest of the ingredients. Place all of the dressing ingredients into a jar, cover and shake until well blended.",
    "3 Marinate beets in dressing: Cut the beets into 1/2-inch to 1-inch pieces. Separate by color and place in separate bowls and toss with a little of the dressing (use about a third of the dressing). Chill for an hour or up to two days.",
    "4 Sprinkle sliced kale with some dressing: 15 minutes to an hour or two before serving, place the thinly sliced kale in a serving bowl. Sprinkle half of the remaining dressing over the sliced kale and toss to lightly coat the leaves.",
    "5 Serve: Either create a composed salad by placing the beets, citrus, mint, parsley, over the kale, sprinkling with the chopped roasted pistachios, and drizzling with the remaining dressing, OR toss everything together, sprinkling with with pistachios at the end."
  ],
  "ingredients": [
    "0",
    "6 - 10 large beets (about 4 to 5 pounds), a mix of red, pink, and golden",
    "2 - 3 blood oranges (or cara cara or navel oranges or a mixture)",
    "1 bunch of kale (lacinato or dinosaur kale if available), center ribs removed, leaves thinly sliced",
    "1 cup roasted pistachios, roughly chopped",
    "1/4 cup chopped fresh mint leaves",
    "3 Tbsp chopped Italian parsley",
    "2 Tbsp lemon juice",
    "1/2 cup good quality extra virgin olive oil",
    "6 Tbsp seasoned rice vinegar (or unseasoned rice vinegar plus 2 teaspoons of sugar)",
    "Zest of one orange",
    "Zest of one lemon",
    "2 Tbsp capers, coarsely chopped",
    "1/2 teaspoon salt",
    "Freshly ground black pepper to taste"
  ],
  "__v": 1
}