{
  "hash": "21ae0df9ad841e83dca0fee131f5aa8a14abca48",
  "title": "Salted Caramel Apple Pie Bars",
  "image": "https://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2014/07/salted-caramel-apple-pie-bars-recipe-5.jpg",
  "href": "https://sallysbakingaddiction.com/2014/07/03/salted-caramel-apple-pie-bars/",
  "extension": "Chrome",
  "firstAdded": "2018-09-15T22:20:35.313000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 300°F (149°C). Line the bottom and sides of an 8-inch square baking pan with aluminum foil or parchment paper, leaving enough overhang on all sides. Set aside.",
    "Make the crust: Stir the melted butter, granulated sugar, vanilla, and salt together in a medium bowl. Add the flour and stir until everything is combined. Press the mixture evenly into the prepared baking pan. Bake for 15 minutes while you prepare the filling and streusel.",
    "Make the apple filling: Combine the sliced apples, flour, granulated sugar, cinnamon, and nutmeg together in a large bowl until all of the apples are evenly coated. Set aside.",
    "Make the streusel: Whisk the oats, brown sugar, cinnamon, and flour together in a medium bowl. Cut in the chilled butter with a pastry blender or two forks (or even with your hands) until the mixture resembles coarse crumbs. Set aside.",
    "Remove the crust from the oven, and turn the oven up to 350°F (177°C). Evenly layer the apples on top of the warm crust. It will look like there are too many apple slices, so layer them tightly and press them down to fit. Sprinkle the apple layer with streusel and bake for 30–35 minutes or until the streusel is golden brown.",
    "Remove from the oven and allow to cool for at least 20 minutes at room temperature, then chill in the refrigerator for at least 2 hours (or overnight). Lift the foil or parchment out of the pan using the overhang on the sides and cut into bars. I usually cut them into 16 smaller bars, but you can cut them into 12 larger bars. Once cut, drizzle some salted caramel sauce on top of each. These apple pie bars can be enjoyed warm, at room temperature, or even cold."
  ],
  "ingredients": [
    "0",
    "Shortbread Crust",
    "1/2 cup (115g) unsalted butter, melted",
    "1/4 cup (50g) granulated sugar",
    "1 teaspoon vanilla extract",
    "1/4 teaspoon salt",
    "1 cup (125g) all-purpose flour (spoon & leveled)",
    "Apple Filling",
    "2 large apples, peeled and thinly sliced (1/4 inch thick)1",
    "2 Tablespoons all-purpose flour",
    "2 Tablespoons granulated sugar",
    "1 teaspoon ground cinnamon",
    "1/8 teaspoon ground nutmeg",
    "Streusel",
    "1/2 cup (40g) old-fashioned oats",
    "1/3 cup (70g) packed light or dark brown sugar",
    "1/4 teaspoon ground cinnamon",
    "1/4 cup (30g) all-purpose flour",
    "1/4 cup (60g) unsalted butter, cold and cubed",
    "homemade salted caramel sauce (step-by-step photos included)"
  ],
  "__v": 1
}