{
  "__v": 1,
  "directions": [
    "0",
    "Preheat the oven to 325 degrees. Lightly grease and flour a 9x5 inch loaf pan, tapping out any excess flour. (I like to brush the loaf pan with melted butter, lay a cut sheet of parchment paper on the bottom of the pan, butter that and then flour the entire inside and then tap out the excess. It ensures that your bread comes out perfectly.) In a medium bowl, whisk the 1-1/2 cups of flour with the baking powder and salt and set aside.",
    "In a large bowl beat the butter with the sugar at medium-high speed until fluffy, about 3 minutes. With the mixer at medium-low speed, add the eggs, one at a time, making sure each one gets incorporated before adding the next one. Add the vanilla extract. Add the flour mixture in 3 batches, beating at low speed between additions until incorporated. Continue to beat for 30 seconds longer.",
    "Spread one-third of the batter in the prepared pan, then spread half of the Nutella on top. Repeat with another third of the batter and the remaining Nutella. Top with the remaining batter. Lightly swirl the Nutella into the batter with a butter knife. Do not overmix.",
    "Bake the cake for about 1 hour and 10 minutes, until a toothpick inserted in the center comes out clean. Let the cake cool in the pan for 15 minutes. Invert the cake onto a wire rack, turn it right side up and let cool completely, about 2 hours. Cut the cake into slices and serve.",
    "The pound cake can be kept in an airtight container at room temperature for up to 3 days. It can also be wrapped tightly and frozen."
  ],
  "firstAdded": "2014-07-11T23:02:56.309000",
  "hash": "234a609cb85ba3d9d2c48af795fa07966d437f53",
  "href": "http://theitaliandishblog.com/imported-20090913150324/2010/2/5/nutella-bread.html",
  "image": "http://theitaliandishblog.com/storage/4 shot nutella bread.jpg?__SQUARESPACE_CACHEVERSION=1265242487794",
  "ingredients": [
    "0",
    "1-1/2 cups all purpose flour, plus more for dusting",
    "1/4 teaspoon salt",
    "3/4 teaspoon baking powder",
    "2 sticks unsalted butter, room temperature (16 tablespoons, or 1 cup)",
    "1-1/4 cups sugar",
    "4 large eggs, at room temperature",
    "2 teaspoons pure vanilla extract",
    "One 13-ounce jar Nutella"
  ],
  "keywords": [
    "purpose",
    "flour",
    "dusting",
    "salt",
    "baking",
    "unsalted",
    "butter",
    "room",
    "sugar",
    "eggs",
    "vanilla",
    "jar",
    "nutella"
  ],
  "title": "Nutella Bread",
  "users": [
    null
  ]
}