{
  "__v": 1,
  "directions": [
    "0",
    "Cheesy beer bread (adapted from Juanita’s Cocina)",
    "Preheat the oven to 375 degrees F. Grease two regular loaf pans.",
    "In a large bowl, mix together the flour, salt, and baking powder. Add 1 1/2 cups of the shredded cheese and green onion; toss together so that everything is well combined.",
    "Add the beer and honey to the flour mixture. Mix until all ingredients are incorporated and there are no dry bits of flour. Don’t worry if your dough is lumpy, it’s supposed to be that way.",
    "Divide the dough between the loaf pans and smooth the top of the dough. Bake for about 40-50 minutes (at the halfway mark, pull the bread out and cover the tops with the reserved 1/2 cup of shredded cheese. Place back into oven and continue baking), or until the top of the loaves is a golden brown and a tester inserted into the center of the loaves comes out clean.",
    "Allow the bread to cool in the pan for 10 minutes before turning them out onto a cooling rack to cool completely."
  ],
  "firstAdded": "2014-11-18T00:14:49.408000",
  "hash": "34d8e8aba84104cac6f661d8c95839925d32ba2c",
  "href": "http://www.bigoven.com/recipe/cheesy-beer-quick-bread/593019",
  "image": "http://mda.bigoven.com/pics/rs/256/cheesy-beer-quick-bread.jpg",
  "ingredients": [
    "0",
    "2 cups Shredded Cheese; reserve 1/2 cup for topping the bread (I used three types: cheddar, mozzarella and Monterey Jack)",
    "1/2 cups Green Onion; Chopped",
    "6 cups All purpose flour",
    "2 tsp salt",
    "2 tbsp Baking Powder",
    "24 oz Beer; (2 bottles) (I used one light and one medium-bodied)",
    "2 tbsp Honey"
  ],
  "keywords": [
    "cheese",
    "reserve",
    "bread",
    "used",
    "types",
    "cheddar",
    "mozzarella",
    "monterey",
    "jack",
    "green",
    "onion",
    "purpose",
    "flour",
    "salt",
    "baking",
    "beer",
    "bottles",
    "light",
    "mediumbodied",
    "honey"
  ],
  "title": "Cheesy Beer Quick Bread",
  "users": [
    null
  ]
}