{
  "hash": "493b4cd7d998c122235d8ab6a6ca5cb4c6b8e462",
  "title": "Healthy Gingerbread Muffins Video!",
  "image": "https://cmt.azureedge.net/media/healthy_gingerbread_muffins_video_201811181255333909816nrmh.jpg",
  "href": "https://www.copymethat.com/r/madPPKe/healthy-gingerbread-muffins-video/",
  "extension": "",
  "firstAdded": "2018-12-27T18:40:20.042000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Steps",
    "Preheat oven to 350 degrees F. Line a muffin tin with muffin liners; spray the inside of the liners with nonstick cooking spray to ensure the muffins do not stick.",
    "In a large bowl, whisk together flour, baking soda, cinnamon, ginger, cloves and salt. Set aside.",
    "In a separate bowl, add coconut oil, maple syrup, molasses, egg, yogurt and almond milk. Whisk together until smooth and well combined. Add dry ingredients and mix until just combined. Pour batter into liners, filling about 1/2 of the way full. Sprinkle with a little coarse sugar (this will create a beautiful muffin and a delicious crunch on the outside). Bake muffins for 18-22 minutes until a tester comes out clean or with just a few crumbs attached. Makes 12 muffins. Enjoy with a cup of coffee!",
    "Notes",
    "To make muffins vegan: Instead of an egg, replace with a flax egg (1 tablespoon flaxseed meal 3 tablespoons water).",
    "To make dairy free: Sub coconut, almond or soy yogurt for the greek yogurt.",
    "Feel free to use white whole wheat flour or you can use half whole wheat and half all-purpose flour."
  ],
  "ingredients": [
    "0",
    "ngredients",
    "1 1/2 cups whole wheat pastry flour",
    "1 teaspoon baking soda",
    "1 1/2 teaspoons cinnamon",
    "3/4 teaspoon ground ginger",
    "1/4 teaspoon ground cloves",
    "1/4 teaspoon salt",
    "3 tablespoons coconut oil, melted and cooled to warm",
    "1/4 cup pure maple syrup",
    "1/4 cup blackstrap molasses",
    "1 egg, at room temperature",
    "1 teaspoon vanilla",
    "1/3 cup nonfat plain greek yogurt",
    "1/2 cup unsweetened vanilla almond milk (any milk will work)",
    "Optional: Coarse sugar or sparkling sugar, for sprinkling on top"
  ],
  "__v": 1
}