{
  "hash": "1069b93802ccae48aa1185220ccfe31d332a2a95",
  "title": "NUT FREE VEGAN NACHO CHEESE SLICES. GLUTEN-FREE RECIPE",
  "image": "http://www.veganricha.com/wp-content/uploads/2014/09/nacho-cheese-slices-3335-300x449.jpg",
  "href": "http://www.veganricha.com/2014/09/nut-free-vegan-nacho-cheese-slices.html",
  "extension": "",
  "firstAdded": "2015-09-22T22:09:51.322000",
  "users": [
    null
  ],
  "keywords": [
    "chickpea",
    "flour",
    "garlic",
    "clove",
    "onion",
    "mustard",
    "cumin",
    "pickled",
    "jalapeno",
    "red",
    "roasted",
    "pimento",
    "pepper",
    "tomato",
    "salt",
    "smoked",
    "paprika",
    "adobo",
    "use",
    "chipotle",
    "canned",
    "peppers",
    "nutritional",
    "yeast",
    "lemon",
    "juice",
    "vinegar",
    "apple",
    "cider",
    "white",
    "water"
  ],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Put everything in a blender and blend until fully combined. Use ¾ cup water for shredd-able block, 1 cup water for slices.",
    "Add to thick bottom pan, and heat at medium-low heat. Keep stirring frequently.",
    "The mixture will start to thicken and get lumpy, then smooth out. The mixture will eventually become custard-like and evenly thick. After the mixture has become a thick even custard, Cook for another 2 -3 minutes to cook the chickpea flour. Stir continuously. You can carefully taste at this point and add salt, spice and tang if needed.",
    "Add the chopped jalapeno and pepper flakes if using and mix in.",
    "Transfer the hot mixture to a greased brownie pan or parchment.",
    "Spray oil on top. Place another parchment on top and press to a thin square. or use rolling pin.",
    "Chill for an hour. Slice and use or store refrigerated for upto 5 days.",
    "Or transfer the mixture to a greased deep small container. Chill for an hour or more before shredding.",
    "* You can make nacho cheese sauce with the recipe as well. Use a ¼ cup chickpea flour with 1 cup of water or non dairy milk. Cook to thicken (about 5 to 6 minutes so chickpea flour gets cooked through, taste and adjust. Use to top nachos!"
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "½ cup chickpea flour",
    "1 garlic clove",
    "½ tsp each of garlic powder, onion powder, mustard powder",
    "¼ tsp cumin powder",
    "½ pickled jalapeno",
    "2 Tbsp roasted red pepper or roasted pimento pepper",
    "2 Tbsp chopped tomato",
    "⅓ tsp salt",
    "½ tsp smoked paprika",
    "½ to 1 chipotle pepper in adobo sauce (use chipotle powder if you cannot find gf canned peppers)",
    "2 Tbsp nutritional yeast",
    "1 to 1.5 tsp lemon juice",
    "½ tsp vinegar (apple cider or white)",
    "¾ to 1 cup water",
    "chopped Jalapeno and pepper flakes"
  ],
  "__v": 1
}