{
  "hash": "c863983e38a4d68bafc4e46b3cd731902f24e312",
  "title": "Delicious Cranberry Quick Bread Recipe",
  "image": "",
  "href": "http://www.totalrecipesearch.com/delicious-cranberry-quick-bread-recipe/",
  "extension": "Chrome",
  "firstAdded": "2016-01-01T20:32:00.373000",
  "users": [
    null
  ],
  "keywords": [
    "search",
    "featured",
    "recipes",
    "recipe",
    "categories",
    "world",
    "holiday",
    "desserts",
    "breads",
    "using",
    "baking",
    "soda",
    "combination",
    "leavening",
    "yeastdelicious",
    "cranberry",
    "quick",
    "bread",
    "recipeauthor",
    "totalrecipesearchdate",
    "january",
    "smells",
    "quite",
    "good",
    "oven",
    "yeast",
    "timeconsuming",
    "technical",
    "implies",
    "easy",
    "used",
    "ways",
    "meal",
    "breakfast",
    "spread",
    "toppings",
    "light",
    "lunch",
    "paired",
    "hearty",
    "soup",
    "warming",
    "coldweather",
    "dinner",
    "finicky",
    "treated",
    "care",
    "activate",
    "rise",
    "advantage",
    "nearly",
    "infinite",
    "varieties",
    "combinations",
    "fruits",
    "cheeses",
    "nuts",
    "grains",
    "incorporated",
    "basic",
    "follows",
    "features",
    "appropriate",
    "thanksgiving",
    "christmas",
    "time",
    "year",
    "flavored",
    "juice",
    "orange",
    "peel",
    "cranberries",
    "oranges",
    "classic",
    "sweetness",
    "tartness",
    "great",
    "way",
    "new",
    "baker",
    "begin",
    "mastering",
    "basics",
    "making",
    "essential",
    "skills",
    "measuring",
    "combining",
    "judging",
    "times",
    "learned",
    "quickly",
    "immediate",
    "gratification",
    "scrumptious",
    "loaf",
    "prep",
    "minutes",
    "hour",
    "allpurpose",
    "flour",
    "sifted",
    "granulated",
    "white",
    "sugar",
    "butter",
    "egg",
    "raisins",
    "dark",
    "golden",
    "coarsely",
    "directions"
  ],
  "directions": [
    "0",
    "Sift together the flour, sugar, baking powder and baking soda into a large bowl. With a pastry blender, cut the butter into the flour mixture until the butter is the size of peas and is well integrated with the flour.",
    "Combine the beaten egg, orange juice and orange rind in a small bowl. Slowly stir the orange juice mixture into the dry ingredients. Stir until the dry ingredients are evenly moist, but do not over-mix. Gently fold in the cranberries and raisins.",
    "Grease two 8½-inch loaf pans. Either glass or metal will work. Divide the batter evenly between the two pans and smooth the tops with the back of a large spoon. Bake in 350-degree oven for approximately 1 hour and 10 minutes. To test for doneness, insert a toothpick into the middle top of one of the loaves. If dough does not cling to the toothpick, the bread is done. If not done, check again in five minutes.",
    "Set the pans on a cooling rack for 10 minutes, and then gently remove the loaves from the pans. Let cool completely before slicing."
  ],
  "ingredients": [
    "0",
    "Search",
    "FEATURED RECIPES",
    "RECIPE CATEGORIES",
    "AROUND THE WORLD",
    "HOLIDAY",
    "DESSERTS",
    "Quick breads are made using baking powder, baking soda or a combination of the two as the leavening, rather than yeast.Delicious Cranberry Quick Bread RecipeAuthor: TotalRecipeSearchDate: January 15, 2015",
    "Nothing smells quite as good as bread fresh from the oven. While baking using yeast bread recipes can be time-consuming and a little technical, quick breads are, as the name implies, quick and easy. Quick breads can be used in many ways and for every meal: toasted for breakfast, spread with toppings for a light lunch or paired with a hearty soup for a delicious and warming cold-weather dinner.",
    "Quick breads are made using baking powder, baking soda or a combination of the two as the leavening, rather than yeast. Baking powder and soda are much less finicky than yeast, which must be treated with care, or it will not activate and the bread will not rise.",
    "Another advantage of quick breads is that they can be made using nearly infinite varieties and combinations of ingredients – fresh fruits, dried fruits, vegetables, cheeses, nuts and grains can all be incorporated into basic quick bread recipes. The recipe that follows features cranberries, so it is appropriate around Thanksgiving and Christmas, although it is delicious any time of the year. It is flavored with orange juice and grated orange peel; cranberries and oranges are a classic combination of sweetness and tartness.",
    "Quick breads are a great way for the new baker to begin mastering the basics of making breads. Essential skills such as measuring and combining ingredients and judging baking times are learned quickly and with the nearly immediate gratification of a scrumptious loaf of homemade bread.",
    "Orange Cranberry Quick Bread Recipe",
    "Prep time: 25 minutes",
    "Cook time: 1 hour, 10 minutes",
    "Ingredients",
    "2 cups all-purpose flour, sifted",
    "1 cup granulated white sugar",
    "1½ teaspoons baking powder",
    "½ teaspoon baking soda",
    "¼ cup butter",
    "1 egg, beaten",
    "1 teaspoon shredded orange peel",
    "¾ cup juice from about 2 large oranges",
    "1½ cup raisins, either dark or golden",
    "1½ cups fresh cranberries, coarsely chopped",
    "Directions"
  ],
  "__v": 1
}