{
  "hash": "52fb12d3a010fdcb24bf62b4ca105e01e8109010",
  "title": "Blueberry Crumb Bars",
  "image": "http://www.cookingclassy.com/wp-content/uploads/2012/11/blueberry+crumb+bars41.jpg",
  "href": "http://www.cookingclassy.com/2012/06/blueberry-crumb-bars/",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T21:25:51.429000",
  "users": [
    null
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "granulated",
    "sugar",
    "divided",
    "baking",
    "salt",
    "lemon",
    "zest",
    "egg",
    "yolk",
    "vanilla",
    "salted",
    "butter",
    "chilled",
    "cubes",
    "cornstarch",
    "juice",
    "blueberries",
    "room",
    "raw",
    "turbinado"
  ],
  "directions": [
    "0",
    "Preheat oven to 375 degrees. Butter an 8x8 baking dish, set aside. In a large mixing bowl whisk together flour, 1/2 cup granulated sugar, baking powder, salt and lemon zest. In a small mixing bowl, whisk together egg yolk and vanilla until combine. Add egg mixture and cold butter cubes to flour mixture and using a fork or a pastry cutter (or even your fingertips), cut mixture together until it resembles coarse crumbs. Gently press 2/3 of the mixture evenly into prepared 8x8 dish.",
    "In a separate mixing bowl, whisk together remaining 1/4 cup granulated sugar and 2 tsp cornstarch. Stir in lemon juice then add blueberries. Toss mixture to evenly coat then pour and spread coated blueberries evenly over crust in baking dish. Sprinkle remaining crumb mixture over berry layer (I pressed some of the mixture together in my hands while sprinkling to make larger crumbs). Sprinkle 1 1/2 Tbsp Raw Turbinado sugar evenly over top. Bake in preheated oven for about 38 - 42 minutes until top is golden brown. Allow to cool for about 20 - 30 minutes before cutting into squares (or serve warm with vanilla ice cream, yum). Store bars in an airtight container in refrigerator (Note: I tried these cold, straight out of the refrigerator and I preferred them warm vs cold. Just a personal preference. I would say if you like cold berry pie then you would like cold bars but I like my berry pies warm so I loved these bars warm. So, with that said, when I would eat one I would heat in the microwave for about 10-15 seconds to rewarm it first).",
    "Recipe Source: adapted from Smitten Kitchen and allrecipes.com"
  ],
  "ingredients": [
    "0",
    "1 1/2 cups all-purpose flour",
    "3/4 cup granulated sugar, divided",
    "1/2 tsp baking powder",
    "1/8 tsp salt",
    "1 tsp lemon zest",
    "1 large egg yolk",
    "1 tsp vanilla extract",
    "1/2 cup salted butter, chilled and cut into cubes",
    "2 tsp cornstarch",
    "1 Tbsp lemon juice",
    "2 cups fresh blueberries, at room temperature",
    "1 1/2 Tbsp Raw Turbinado sugar"
  ],
  "__v": 1
}