{
  "hash": "a66b26b5a26a75569163dc2e48eaecde49fddb3f",
  "title": "Baked seafood with tomatoes and Turkish cheese",
  "image": "",
  "href": "http://www.ottolenghi.co.uk/baked-seafood-with-tomatoes-and-turkish-cheese-shop",
  "extension": "Firefox",
  "firstAdded": "2016-01-04T18:06:49.101000",
  "users": [
    null
  ],
  "keywords": [
    "fennel",
    "bulbs",
    "net",
    "fronds",
    "garlic",
    "olive",
    "oil",
    "cumin",
    "seeds",
    "lightly",
    "tomato",
    "raki",
    "ouzo",
    "italian",
    "plum",
    "tomatoes",
    "tinned",
    "caster",
    "sugar",
    "thyme",
    "leaves",
    "picked",
    "extra",
    "strips",
    "shaved",
    "lemon",
    "peel",
    "bass",
    "bream",
    "fllets",
    "skin",
    "pieces",
    "squid",
    "tentacles",
    "raw",
    "prawns",
    "unpeeled",
    "prefer",
    "turkish",
    "white",
    "cheese",
    "feta",
    "broken",
    "chunks",
    "unsalted",
    "butter",
    "urfa",
    "kind",
    "flaked",
    "chilli",
    "juice",
    "salt",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "Preheat the oven to 220ºC.",
    "In a large frying pan sauté the fennel and garlic in the olive oil on a medium heat for about 10 minutes or until softened. Add the cumin and fennel seeds and cook for another minute. Stir in the tomato paste and then add the raki or ouzo. Allow this to bubble away for a couple of minutes. Mix in the tomatoes, sugar, half of the thyme, the lemon skin, 1 teaspoon of salt and some black pepper and stir well. Simmer gently until the sauce thickens, 15-20 minutes, adding a little extra water if it goes much thicker than your typical pasta sauce. Taste and add salt and pepper accordingly. Remove from the heat and discard the lemon peel.",
    "Divide the hot sauce evenly between four individual casserole dishes or small pans. Alternatively, use one large dish. Season the sea bass pieces with salt and pepper and dot them inside, skin side down. Arrange over the squid followed by the prawns. Press the feta pieces around the fish so that they are also slightly submerged in the sauce. Finish with the remaining tablespoon of thyme leaves. Place on the top shelf in the oven 8-12 minutes, depending on the size of your dishes, or until the seafood is just cooked, the sauce bubbles nicely and the cheese turns golden.",
    "Just before the casseroles are done, melt the butter in a small frying pan until it starts to foam. Add the chilli and cook until the butter just begins to brown. Pour in the lemon juice, stir and remove from the heat. Spoon this over the hot casseroles as soon as they come out of the oven. Sprinkle with the fennel fronds and serve hot with bread on the side."
  ],
  "ingredients": [
    "0",
    "2 large fennel bulbs, thinly sliced (400g net), plus the fronds for garnish",
    "5 garlic cloves, thinly sliced",
    "3 tbsp olive oil",
    "2 tsp cumin seeds, toasted and lightly crushed",
    "2 tsp fennel seeds, toasted and lightly crushed",
    "2 tsp tomato paste",
    "150ml raki or ouzo",
    "600g peeled and chopped Italian plum tomatoes (fresh or tinned)",
    "1½ tsp caster sugar",
    "2 tbsp thyme leaves, picked, plus extra for garnish",
    "2 strips of shaved lemon peel",
    "2 sea bass or bream fıllets, skin on, cut into 4cm pieces (175g net)",
    "160g squid, including tentacles, sliced into 1 cm strips",
    "200g large raw peeled prawns, deveined, or you can keep them unpeeled if you prefer",
    "150g Turkish white cheese or feta, broken into 2cm chunks",
    "60g unsalted butter",
    "1½ tsp urfa chilli flakes or another kind of flaked chilli",
    "1½ tsp lemon juice",
    "Salt and black pepper"
  ],
  "__v": 1
}