{
  "__v": 1,
  "directions": [
    "0",
    "Make the dough first. (I use my Kitchenaid now for making chapati dough and its a breeze, will share details in a later post). Mix the atta and salt well together. Add a few drops of oil and mix with fingertips. Add water little at a time and keep kneading into a soft dough. Knead for 3-4 mins and coat with some more oil (don't overdo the oil bit, very few drops will do). Set aside while making the filling.",
    "Boil and grate the potatoes. I used to mash them but that leaves small lumps here and there making it harder to roll out the aloo parathas smoothly. Grating is a better method to ensure a smooth filling.",
    "Mix all ingredients for the filling together, making sure they are well incorporated.",
    "The spices you add to the filling also make a large difference to the taste of your aloo parathas. There are tons of different versions here. Since I visited TH's aunt in Mumbai and watched her Marathi maid make aloo parathas (in awe, I must add!), I use her recipe for the aloo filling.",
    "4. Divide the dough into 8 equal parts and roll into smooth balls. Do the same with the filling. I like to make the size of the filling slightly smaller than the dough balls but you can make them into equal sizes if you wish.",
    "5. Flour the surface you are going to use to roll the parathas. Take one dough ball, place it on the floured surface and flatten with fingertips into a small round. I find that doing this with my fingertips makes it easier to get the surface equally thick than rolling with a rolling pin. The Vahrevah Chef agrees.",
    "6. Place a filling ball in the centre of the flattened dough ball.",
    "7. Gather the dough ball around the filling, sealing it gently on top.",
    "8. Make it into a momo-like ball, making sure that the dough covers the filling ball completely.",
    "9. You can pinch off the extra bit of dough on top. I sometimes just flatten it against the top and continue.",
    "10. Again, using your fingertips, gently press the filled dough ball into a small circle, making sure the thickness is equal on all sides.",
    "In case you are wondering, there was no tripod used in any of the pics. I clicked with my left hand. The things food blogging teaches you - mind-boggling!",
    "11. Then use your rolling pin to flatten it out to as thick or thin as you want. I keep it slightly thicker than chapatis. And before you ask, I still can't make a perfectly round chapati / paratha, so help me God. Oh, you weren't going to ask..",
    "Ok moving on.",
    "12. Transfer rolled paratha to a hot griddle. Make sure you tap out the excess flour used in rolling. I didn't take enough for this paratha so ignore the excessive white patches.",
    "13. Cook until both sides are golden brown. When done, brush with some ghee / butter or oil and transfer to a plate. I use my olive oil spray while making chapatis / parathas. You can spray on the oil at the end and it creates zero mess. Of course if you want to use ghee, then the mess doesn't matter, only the flavour does!",
    "That's it! Serve hot with a pat of butter on top, some curd and pickles."
  ],
  "firstAdded": "2014-03-31T14:39:28.363000",
  "hash": "766713a3bbc6e0b96bf39d277eebfcd489e5a4a0",
  "href": "http://www.cookingandme.com/2011/02/aloo-paratha-step-by-step-recipe.html",
  "image": "http://farm6.static.flickr.com/5171/5457754231_cb46f68483.jpg",
  "ingredients": [
    "0",
    "Ingredients:",
    "For Dough:-",
    "2 cups atta / whole wheat flour",
    "Just over 1/2 cup water",
    "1 tsp salt (or to taste)",
    "A few drops of oil",
    "For Aloo Filling:-",
    "2 medium sized potatoes",
    "1 tsp red chilli powder",
    "1/2 tsp jeera / cumin powder",
    "1/4 tsp ajwain / omam / carom seeds",
    "1/2 tsp chaat masala (or garam masala)",
    "1/2 tsp salt",
    "A handful of coriander leaves, chopped fine"
  ],
  "keywords": [
    "dough",
    "atta",
    "wheat",
    "flour",
    "water",
    "salt",
    "drops",
    "oil",
    "aloo",
    "filling",
    "medium",
    "sized",
    "potatoes",
    "red",
    "chilli",
    "jeera",
    "cumin",
    "ajwain",
    "omam",
    "carom",
    "seeds",
    "chaat",
    "garam",
    "masala",
    "coriander",
    "leaves"
  ],
  "title": "Aloo Paratha (Punjabi Aloo Paratha)",
  "users": [
    null
  ]
}