{
  "__v": 1,
  "directions": [
    "0",
    "In una terrina capiente amalgamate la ricotta con l'uovo, il Parmigiano, gli spinaci, la noce moscata, sale e pepe. A questo punto aggiungete la farina (o il pangrattato), la cui quantità va regolata in base alla consistenza del composto, che dipende a sua volta dalla quantità di acqua residua degli spinaci, e dall'umidità della ricotta. Questo per dirvi che non posso darvii una dose precisa ma indicativa. Io, di solito, metto 2-3 cucchiai rasi di farina. Il composto deve essere morbido ma non troppo, consistente giusto quello che basta per formare delle quenelle con due cucchiai (se preferite, potete semplicemente versare il composto a cucchiaiate nell'acqua bollente, ma così sono più carine), che appoggerete man mano che saranno pronte, su un vassoio ricoperto con carta forno, che farete riposare in frigorifero fino al momento di cuocerle. Comunque, per evitare che le quenelle si sciolgano nell'acqua, potete sempre fare una prova, cuocendone una, e regolandovi di conseguenza.",
    "Mettete una pentola con abbondante acqua sul fuoco, quando sobbolle, salate e versate le quenelle con delicatezza. Quando verranno a galla, contate ancora un minuto circa, e poi scolate con uno scolagnocchi o una schiumarola, ma non con lo scolapasta, onde evitare lo schiacciamento... Mentre cuociono le quennelle, preparate il condimento, sciogliendo lo zola con la panna, e il Parmigiano, in un pentolino su fuoco dolce. Servire le quennelle con la crema di formaggio, spolverizzata con pepe a piacere. Se non amate il Gorgonzola, ma qui sposa benissimo, potete sempre accompagnare il piatto, con il classico burro fuso, salvia e Parmigiano.",
    "Buon appetito e vedrete che ve ne chiederanno ancora...!!!"
  ],
  "firstAdded": "2014-10-10T11:54:11.420000",
  "hash": "5fb0be0ede6a874bb3bcc4d7bd947dd1c31793fd",
  "href": "http://aleonlykitchen.blogspot.it/2012/02/quenelle-di-ricotta-e-spinaci-con-crema.html",
  "image": "http://3.bp.blogspot.com/-OmFruE_ttp0/Tz1O_D7xQvI/AAAAAAAAAp4/dDx_9doc3c0/s400/Quenelle+di+ricotta+e+spinaci+1.jpg",
  "ingredients": [
    "0",
    "Ingredienti per 4 persone",
    "300 gr. di ricotta",
    "300 gr. di spinaci già cotti, ben strizzati e tritati",
    "50 - 60 gr. di Parmigiano grattugiato",
    "1 uovo",
    "farina bianca q.b. (o pangrattato)",
    "sale e pepe q.b",
    "un pizzico di noce moscata",
    "per la crema al Gorgonzola",
    "150 gr. di Gorgonzola dolce",
    "3-4 cucchiai di panna fresca (o 2-3 di latte o metà e metà)",
    "Parmigiano grattugiato a piacere",
    "pepe"
  ],
  "keywords": [
    "ingredienti",
    "persone",
    "ricotta",
    "spinaci",
    "cotti",
    "ben",
    "strizzati",
    "tritati",
    "parmigiano",
    "grattugiato",
    "uovo",
    "farina",
    "bianca",
    "pangrattato",
    "sale",
    "pepe",
    "pizzico",
    "noce",
    "moscata",
    "crema",
    "gorgonzola",
    "dolce",
    "cucchiai",
    "panna",
    "fresca",
    "latte",
    "met",
    "piacere"
  ],
  "title": "Quenelle di ricotta e spinaci con crema al Gorgonzola",
  "users": [
    null
  ]
}