{
  "hash": "981279e515d80e7917de7bef9111fd0376d20e50",
  "title": "Weeknight Lemon Chicken Skillet Dinner",
  "image": "http://cdn-image.myrecipes.com/sites/default/files/styles/300x300/public/weeknight-lemon-chicken-skillet-dinner-ck.jpg?itok=pDVYF_7v",
  "href": "http://www.myrecipes.com/recipe/weeknight-lemon-chicken-skillet-dinner?XID=mr_socialflow_facebook",
  "extension": "Chrome",
  "firstAdded": "2016-06-06T04:58:01.466000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 450°.",
    "Place potatoes in a medium saucepan; cover with water. Bring to a boil, and simmer 12 minutes or until tender. Drain.",
    "Heat a large ovenproof skillet over medium-high heat. Add 1 teaspoon oil to pan. Sprinkle chicken with 1/4 teaspoon salt and 1/4 teaspoon pepper. Add chicken and thyme sprigs to pan; cook 5 minutes or until chicken is browned. Turn chicken over. Place pan in oven; bake at 450° for 10 minutes or until chicken is done. Remove chicken from pan.",
    "Return pan to medium-high heat. Add remaining 2 teaspoons oil. Add potatoes, cut sides down; mushrooms; and 1 tablespoon thyme; cook 3 minutes or until browned, stirring once. Combine milk and flour in a small bowl, stirring with a whisk. Add remaining salt, remaining pepper, flour mixture, stock, lemon, and beans to pan; simmer 1 minute or until slightly thickened. Add chicken; cover, reduce heat, and simmer 3 minutes or until beans are crisp-tender. Sprinkle with parsley."
  ],
  "ingredients": [
    "0",
    "12 ounces baby red potatoes, halved",
    "1 tablespoon olive oil, divided",
    "4 (6-ounce) skinless, boneless chicken breast halves, pounded to 3/4-inch thickness",
    "3/4 teaspoon kosher salt, divided",
    "1/2 teaspoon freshly ground black pepper, divided",
    "2 thyme sprigs",
    "4 ounces cremini mushrooms, quartered",
    "1 tablespoon chopped fresh thyme",
    "1/4 cup whole milk",
    "5 teaspoons all-purpose flour",
    "1 3/4 cups unsalted chicken stock (such as Swanson)",
    "8 very thin lemon slices",
    "1 (8-ounce) package trimmed haricots verts (French green beans)",
    "2 tablespoons chopped fresh flat-leaf parsley"
  ],
  "__v": 1
}