{
  "hash": "1c4a94045f93878b445afccac58608883c4602ac",
  "title": "Soft-Baked White Chocolate Cranberry Cookies",
  "image": "https://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2012/11/White-Chocolate-Cranberry-Cookies-5.jpg",
  "href": "https://sallysbakingaddiction.com/2012/11/22/soft-baked-white-chocolate-chip-cranberry-cookies/",
  "extension": "Chrome",
  "firstAdded": "2018-10-09T17:43:47.777000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large bowl using a hand-held mixer or stand mixer with paddle attachment, beat the butter for 1 minute on medium speed until completely smooth and creamy. Add the brown sugar and granulated sugar and mix on medium high speed until fluffy and light in color. Beat in egg and vanilla on high speed. Scrape down the sides and bottom of the bowl as needed.",
    "In a separate bowl, whisk the flour, cornstarch, baking soda and salt together until combined. On low speed, slowly mix into the wet ingredients until combined. The cookie dough will be quite thick. Add the white chocolate chips and dried cranberries mix on low for about 5-10 seconds until evenly disbursed. Cover dough tightly with aluminum foil or plastic wrap and chill for at least 2 hours and up to 2 days. Chilling is mandatory for this cookie dough.",
    "Remove cookie dough from the refrigerator and allow to sit at room temperature for 10 minutes-- if the cookie dough chilled longer than 2 hours, let it sit at room temperature for about 30 minutes. This makes the cookie dough easier to scoop and roll.",
    "Preheat oven to 350F. Line two large baking sheets with parchment paper or silicone baking mats. (Always recommended for cookies.) Set aside.",
    "Once chilled, the dough will be slightly crumbly, but will come together if you work the dough with your hands as you roll into individual balls. Scoop and roll balls of dough, about 1 Tablespoon of dough each, into balls. Place 10 - 12 on each baking sheet. Bake in batches for 8-10 minutes, until barely golden brown around the edges. They will look extremely soft when you remove them from the oven. Allow to cool for 5 minutes on the cookie sheet. If the cookies are too puffy, try gently pressing down on them with the back of a spoon. They will slightly deflate as you let them cool. Transfer to cooling rack to cool completely."
  ],
  "ingredients": [
    "0",
    "3/4 cup (1.5 sticks to 170g) unsalted butter, softened to room temperature",
    "3/4 cup (150g) packed dark brown sugar",
    "1/4 cup (50g) granulated sugar",
    "1 large egg, at room temperature",
    "2 teaspoons vanilla extract",
    "2 cups (250g) all-purpose flour",
    "2 teaspoons cornstarch (aka cornflour)",
    "1 teaspoon baking soda",
    "1/2 teaspoon salt",
    "3/4 cup (135g) white chocolate chips",
    "3/4 cup (105g) dried cranberries"
  ],
  "__v": 1
}