{
  "hash": "1bb3f83e7650622bee4c1749992ba9cf735ce2b1",
  "title": "SALTED CARAMEL ROLO BROWNIES",
  "image": "https://farm9.staticflickr.com/8637/16446129615_9ef3c9cf13_b.jpg",
  "href": "http://bakelovegive.com/salted-caramel-rolo-brownies/",
  "firstAdded": "2015-02-14T02:50:24.713000",
  "users": [
    null,
    null
  ],
  "keywords": [
    "eggs",
    "granulated",
    "sugar",
    "brown",
    "butter",
    "cocoa",
    "vanilla",
    "allpurpose",
    "flour",
    "salt",
    "semisweet",
    "chocolate",
    "chips",
    "room",
    "cubed",
    "unsalted",
    "cream",
    "bean",
    "flaky"
  ],
  "directions": [
    "0",
    "Preheat oven to 300 degrees Fahrenheit. Spray mold cavities with non-stick cooking spray and set aside.",
    "In a stand mixer fitted with the whisk attachment, beat eggs at medium speed until light and fluffy. Beat in both sugars until mixture is smooth. Add butter, cocoa, vanilla, flour, and salt and mix until fully incorporated and glossy.",
    "Using a small cookie scoop, scoop batter into each cavity of the brownie mold. Press a mini ROLO into the center of each brownie and bake for 15 minutes.",
    "Let cool for 5-10 minutes before popping pan into freezer for 5 minutes to help release the brownies. Wipe cavities with a damp paper towel, spray with cooking spray and repeat with remaining half of batter.",
    "1",
    "Using the double boiler method, place a heat safe bowl on top of a small pan of simmering water. Add chocolate chips and stir until melted and smooth. Remove from heat and stir in butter until fully combined and shiny.",
    "2",
    "Place sugar in the bottom of a heavy saucepan over medium-high heat. Whisk the sugar as it begins to caramelize, breaking up clumps as the sugar melts. Once sugar is completely melted, stop stirring and allow to reach 350 degrees Fahrenheit, swirling occasionally. Sugar should be a rich brown color with toasted aromas.",
    "Once caramel reaches 350 degrees Fahrenheit, carefully whisk in butter until completely melted. Take caution as the caramel will violently bubble when added.",
    "Remove from heat and whisk in heavy cream and sea salt until caramel is smooth and silky.",
    "Allow to cool for 15 minutes before pouring into a heat safe jar and allow to come to room temperature. Refrigerate sauce between use.",
    "3",
    "Place cooled brownie bites on a wire rack with a sheet of parchment paper underneath.",
    "Transfer ganache and salted caramel sauce into disposable decorating bags. Twist closed and cut off a small opening at the tip.",
    "Drizzle chocolate and caramel atop each brownie. Store in an airtight container at room temperature."
  ],
  "ingredients": [
    "0",
    "4 large eggs",
    "1 cup granulated sugar",
    "1 cup packed brown sugar",
    "8 ounces (2 sticks) butter, melted",
    "1¼ cups cocoa",
    "2 teaspoons vanilla",
    "½ cup all-purpose flour",
    "½ teaspoon salt",
    "1",
    "⅓ cup semisweet chocolate chips",
    "2 tablespoons butter, room temperature, cubed",
    "2",
    "2 cups granulated sugar",
    "12 tablespoons unsalted butter, room temperature, cubed",
    "1 cup heavy cream, room temperature",
    "1 tablespoon vanilla bean sea salt (or any flaky sea salt)"
  ],
  "__v": 2
}