{
  "hash": "342af2f90a3b87250fa3fbc3febdfd25e5e89966",
  "title": "Strawberry Shortcake Cupcakes",
  "image": "http://www.ladybehindthecurtain.com/wp-content/uploads/2013/02/Untitled.jpg",
  "href": "http://www.ladybehindthecurtain.com/strawberry-shortcake-cupcakes/",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T22:13:54.650000",
  "users": [
    null
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "granulated",
    "sugar",
    "baking",
    "salt",
    "eggs",
    "butter",
    "softened",
    "milk",
    "vanilla",
    "strawberries",
    "whipped",
    "cream",
    "frosting",
    "recipe",
    "cheese",
    "almond"
  ],
  "directions": [
    "0",
    "Preheat oven to 350 degrees. Line 3 cupcake tins with 36 cupcake liners.",
    "In a large bowl combine flour, sugar, baking powder and salt. In a large mixing bowl blend butter until light and fluffy.",
    "Add the eggs one at a time until well combined add the milk and vanilla.",
    "Add the dry ingredients.",
    "Mix until batter is light and fluffy. Batter will be thick.",
    "Fill cupcake liners 1/2 full.",
    "TIP: If you fill the liners any more the cupcakes will rise too high and make a BIG mess.",
    "Bake 20 minutes or until a toothpick inserted into the center comes out clean.",
    "Cool completely in the cupcake pans.",
    "Once cupcakes have cooled; hollow out some of the center of the cupcake, cut the tops off the strawberries and insert into the hollow area.",
    "Cover with frosting.",
    "TIP: This is NOT a sweet frosting, if you only want a small amount of frosting make recipe as listed above otherwise double recipe.",
    "Using the whisk attachment combine the cream cheese, sugar and extracts until well combined. While the mixture is still whipping, slowly pour in the heavy cream.",
    "Stop and scrape the bottom of the bowl a couple of times.",
    "Whip until the cream can hold a stiff peak.",
    "NOTE: These cupcakes can be frosted a day in advance as long as you keep them refrigerated. Also, they can stay out a couple of hours while serving but you should store the leftover cupcakes in the refrigerator."
  ],
  "ingredients": [
    "0",
    "3 cups all-purpose flour",
    "2 cups granulated sugar",
    "3 teaspoons baking powder",
    "1/2 teaspoon salt",
    "6 large eggs",
    "2 cups butter, softened",
    "1/2 cup milk",
    "2 teaspoons vanilla extract",
    "36 whole strawberries",
    "1 whipped cream frosting recipe (below)",
    "8 ounce cream cheese",
    "1/2 cup granulated sugar",
    "1 teaspoon vanilla extract",
    "1/2 teaspoon almond extract",
    "2 cups heavy cream"
  ],
  "__v": 1
}