{
  "hash": "1c948aa942a6cca0110e2c0d17e09c57e7a437f4",
  "title": "Boozy Cherry-Chocolate Pies",
  "image": "//food.fnr.sndimg.com/content/dam/images/food/fullset/2013/5/1/0/FNM_060113-Boozy-Cherry-Chocolate-Pies-Recipe_s4x3.jpg.rend.hgtvcom.826.620.suffix/1371616361522.jpeg",
  "href": "https://www.foodnetwork.com/recipes/food-network-kitchen/boozy-cherry-chocolate-pies-recipe-2122050",
  "extension": "Chrome",
  "firstAdded": "2019-06-18T12:18:51.378000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Whisk the sugar, rum, vanilla, orange zest and 1/4 teaspoon salt in a large bowl until the sugar dissolves. Add the cherries and cornstarch and toss; set aside until juicy, about 30 minutes. Line a baking sheet with foil and coat with cooking spray. Place six 5-to-6-inch ceramic tart dishes on the prepared pan. Add 3/4 cup cherries to each dish using a slotted spoon; top each with 1 tablespoon butter and 2 teaspoons chocolate. Transfer the remaining cherry mixture to a saucepan; add 1/2 cup water and simmer over medium heat, stirring occasionally, until thickened, 5 to 7 minutes. Divide among the dishes; cool completely.",
    "Dust a surface with flour. Using a paring knife, cut out 6 circles from the piecrust, 1/2 inch bigger than the tart dishes (use the dishes as a guide). Place on another baking sheet; chill until ready to bake. Position a rack in the lower third of the oven and preheat to 375 degrees F. Top each dish with a piece of dough, pressing the edge against the dish to seal; pierce several times with a knife. Bake 45 minutes, then brush each pie with heavy cream and sprinkle with sugar. Continue baking until golden, about 15 more minutes. Serve with ice cream."
  ],
  "ingredients": [
    "0",
    "3/4 cup turbinado sugar, plus more for sprinkling",
    "1/2 cup light rum",
    "1 tablespoon vanilla extract",
    "1/2 teaspoon grated orange zest",
    "Kosher salt",
    "3 pounds Bing cherries, pitted and halved",
    "3 tablespoons cornstarch",
    "Cooking spray",
    "6 tablespoons cold unsalted butter, cut into pieces",
    "1 1/2 ounces semisweet chocolate, chopped (about 1/4 cup)",
    "All-purpose flour, for dusting",
    "1 1/2 14-ounce packages refrigerated piecrust dough (3 pieces)",
    "Heavy cream, for brushing",
    "Vanilla ice cream, for serving"
  ],
  "__v": 1
}