{
  "hash": "81ccf8153ddb17b9e544dacb0b78ff5588cd92df",
  "title": "Roasted Tomato and Herb Quiche [Vegan, Gluten-Free]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/05/quiche.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/roasted-tomato-and-herb-quiche/",
  "extension": "Chrome",
  "firstAdded": "2015-05-24T13:52:59.114000",
  "users": [
    null
  ],
  "keywords": [
    "hothouse",
    "plum",
    "onthevine",
    "tomatoes",
    "extra",
    "virgin",
    "olive",
    "oil",
    "salt",
    "coriander",
    "flax",
    "seed",
    "water",
    "rolled",
    "oats",
    "pine",
    "nuts",
    "walnuts",
    "significantly",
    "expensive",
    "good",
    "leek",
    "garlic",
    "firm",
    "tofu",
    "lemon",
    "juice",
    "nutrition",
    "yeast",
    "chives",
    "basil",
    "cracked",
    "black",
    "pepper",
    "added",
    "turns",
    "peppermill"
  ],
  "directions": [
    "0",
    "Preheat oven to 400 degrees and line two baking sheets with parchment paper.",
    "Rinse the tomatoes and with a pairing knife, cut the stem out. Slice the tomatoes about ¾ of a centimeter thick. Toss the tomatoes with the rest of the ingredients in a large bowl to coat.",
    "Line the tomatoes in a single layer on the prepared baking sheets and roast for 20 minutes until wrinkly. Remove from the oven and turn the heat down to 350 degrees to cook the crust.",
    "1",
    "In a small bowl, whisk together flax and water and set aside.",
    "In a bowl of a food processor, ground the oats and nuts until it resembles a course flour. Add in the flax egg, salt and oil. Stir until mostly combined, adding more water if necessary. The dough should stick together when you pinch it.",
    "Transfer the dough evenly over the base of the pie dish. Starting from the centre of the dish, press the mixture evenly into the pan, working your way outward and up the sides of the pan. Poke a few fork holes in the dough with a fork so your pie crust does not explode.",
    "Bake the crust at 350F for 14-16 minutes, or until golden and firm to touch. When the crust is done, turn the heat up to 375 degrees and let the crust cool while you prepare the filling.",
    "2",
    "Drain the tofu, rinse and cut into half vertically. Wrap the two pieces of tofu in paper towels or a clean dishtowel and add some weight to the top with a heavy book or use a tofu press.",
    "Cut off the dark green stalk of the leek and discard. Cut the leek in half lengthwise but leave the root tip in tact so the leek is still in one piece. Chop into half-moons and transfer to a water filled bowl. Swish the leeks around and drain. Dry with a clean dishtowel and set aside. Peel and mince the garlic.",
    "Heat the olive oil in a skillet over medium heat. When the skillet is hot, add the leeks and cook for 5 minutes. If the leeks are browning too quickly, turn down the heat. For this recipe, the leeks should be just soft and not brown. Add the garlic and cook for an additional 2 minutes. Take the leek-garlic mixture off the heat and set aside to cool.",
    "Crumble the pressed tofu into a bowl of a clean food processor with the lemon juice and nutritional yeast. Process the tofu until it is completely smooth and creamy. Add a splash of unsweetened almond milk to help the tofu along if it needs it. Wipe out the large bowl used for the tomatoes and add the tofu mixture to it. Add the rest of the filling ingredients to the bowl and mix with a spatula until fully combined.",
    "Spread the tofu mixture evenly into the prepared cooled crust using a spatula. Top with the semi-roasted tomatoes and bake for 35-40 minutes until the crust is golden. Let the quiche rest for 15 minutes before cutting into it. Top with the small basil leaves, cut and serve."
  ],
  "ingredients": [
    "0",
    "2 pounds hothouse or plum or on-the-vine tomatoes",
    "1 tablespoon extra virgin olive oil",
    "½ teaspoon fine grain sea salt",
    "Pinch of coriander (optional)",
    "1",
    "1 tablespoon ground flax seed + 3 tablespoons warm water",
    "1½ cups rolled oats",
    "½ cup pine nuts or walnuts (Walnuts are significantly less expensive but just as good)",
    "2 tablespoons extra virgin olive oil",
    "½ teaspoon fine grain sea salt",
    "2",
    "1 tablespoon extra virgin olive oil",
    "1 leek",
    "5 garlic cloves, minced",
    "15 ounce package extra firm tofu",
    "2 teaspoons fresh lemon juice",
    "2 tablespoons nutrition yeast",
    "½ cup chopped fresh chives",
    "½ cup chopped fresh basil",
    "¾ teaspoon fine grain sea salt",
    "Cracked black pepper, to taste (I added about 3 turns of the peppermill)"
  ],
  "__v": 1
}