{
  "hash": "fa6f1c544525d7200b6256df665ba01a2931b94e",
  "title": "Crisp Hoi An Pancakes",
  "image": "http://www.epicurious.com/images/recipesmenus/2014/2014_may/51234430.jpg",
  "href": "http://www.epicurious.com/recipes/food/views/crisp-hoi-an-pancakes-51234430",
  "firstAdded": "2015-02-22T19:20:55.638000",
  "users": [
    null
  ],
  "keywords": [
    "rice",
    "flour",
    "turmeric",
    "kosher",
    "salt",
    "oil",
    "divided",
    "shrimp",
    "pepper",
    "scallions",
    "mung",
    "bean",
    "sprouts",
    "greenleaf",
    "bibb",
    "lettuce",
    "leaves",
    "mixed",
    "tender",
    "herbs",
    "mint",
    "cilantro",
    "thai",
    "basil",
    "nuoc",
    "cham"
  ],
  "directions": [
    "0",
    "Batter: Whisk flour, turmeric, salt, and 1 1/2 cups water in a large bowl until smooth. Cover and let sit at room temperature 1 hour (this allows the rice flour to hydrate; the batter will get creamier as it sits).",
    "Assembly: Heat 1 tablespoon oil in a medium nonstick skillet over medium-high heat. Add shrimp, season with salt and pepper, and cook, tossing often, until cooked through, about 3 minutes. Transfer to a plate.",
    "Wipe out skillet and return to medium high heat. Add remaining 4 tablespoons oil. Mix batter to reincorporate rice flour, pour 1/2-cupful into skillet, and swirl pan to evenly spread out batter. (Be careful: Batter will splatter.) Cook pancake, shaking pan occasionally, until almost cooked and edges begin to curl, about 4 minutes. Top with one-fourth of scallions, one-fourth of bean sprouts, and one-fourth of shrimp and cook until pancake is golden brown and crisp, about 1 minute. Using a spatula, fold pancake in half, forming a half-moon. Transfer to paper towels to drain. Repeat with remaining batter (mixing before adding to pan), scallions, bean sprouts, and shrimp to make 3 more pancakes, adding more oil to skillet as needed.",
    "Cut pancakes into wedges. To eat, tuck each wedge inside a lettuce leaf along with some herbs and dip in Nuoc Cham."
  ],
  "ingredients": [
    "0",
    "1 cup rice flour",
    "1/2\tteaspoons ground turmeric",
    "1/2\tteaspoons kosher salt",
    "1",
    "5 tablespoons (or more) vegetable oil, divided",
    "4 ounces small shrimp, peeled, deveined",
    "Kosher salt, freshly ground pepper",
    "6 scallions, thinly sliced",
    "4 ounces mung bean sprouts (about 1 cup)",
    "Large green-leaf or Bibb lettuce leaves and mixed tender herbs (such as mint, cilantro, and Thai basil; for serving)",
    "Nuoc Cham"
  ],
  "__v": 1
}