{
  "__v": 1,
  "directions": [
    "0",
    "Pour the soup, milk, and broth into the crockpot.",
    "Add the chicken (if you opted to add vegetables place them in first) on top of the soup mixture.",
    "Cook the contents on low for 6-7 hours.",
    "After about 6 hours, remove the chicken and shred it into large chunks.",
    "Return the chicken to the crockpot and add the noodles. Continue to cook on low for another 2 hours.",
    "Don’t forget to stir 4-5 times while cooking this tasty dish so the contents stay well mixed and do not stick. Serve by placing a nice and generous spoonful of mashed potatoes on your plate and top it with the creamy chicken and noodles. Sprinkle with salt and pepper to taste.",
    "For the example dish, we added a baked biscuit on the side, which is perfect for dipping! Give this easy and inexpensive crockpot recipe a try and see what you can come up with. It is sure to become a new household favorite."
  ],
  "firstAdded": "2014-09-21T23:11:44.333000",
  "hash": "c5e4719d80c756f1a965f7d4fb488b7e254e6e4c",
  "href": "http://momentswithmandi.com/crockpot-chicken-noodle-mash/",
  "image": "http://momentswithmandi.com/wp-content/uploads/2013/10/crockpot-chicken-noodle-mash.jpg",
  "ingredients": [
    "0",
    "4-5 chicken breasts (Boneless, skinless, frozen is perfect)",
    "2 regular size cans of cream of chicken soup",
    "2 regular size cans of chicken broth",
    "1 stick of butter",
    "½ cup of milk",
    "1 bag of egg noodles (I use a 16 oz. bag of frozen but you are free to use dried if you wish)",
    "Salt and pepper to taste",
    "Instant mashes potatoes OR homemade mashed potatoes (2 pounds of potatoes cooked, peeled, cubed and mashed with 1 cup of milk, salt, pepper, and butter to taste)"
  ],
  "keywords": [
    "chicken",
    "breasts",
    "boneless",
    "skinless",
    "frozen",
    "perfect",
    "regular",
    "size",
    "cream",
    "soup",
    "broth",
    "butter",
    "milk",
    "egg",
    "noodles",
    "free",
    "use",
    "wish",
    "salt",
    "pepper",
    "instant",
    "mashes",
    "potatoes",
    "cubed",
    "mashed"
  ],
  "title": "Crockpot Chicken & Noodle Mash",
  "users": [
    null
  ]
}