{
  "hash": "3ac406f47df8c2e2054b6e1429283e0105387966",
  "title": "Artichoke & wild mushroom pie",
  "image": "http://www.bbcgoodfood.com/sites/bbcgoodfood.com/files/recipe_images/recipe-image-legacy-id--2311_10.jpg",
  "href": "http://www.bbcgoodfood.com/recipes/2185/artichoke-and-wild-mushroom-pie",
  "firstAdded": "2015-01-06T13:59:28.501000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "onions",
    "grilled",
    "artichoke",
    "hearts",
    "mixed",
    "mushrooms",
    "garlic",
    "clove",
    "thyme",
    "leaves",
    "pack",
    "readymade",
    "shortcrust",
    "pastry",
    "egg",
    "salt",
    "water",
    "glaze",
    "flat",
    "leaf",
    "parsley",
    "roughly",
    "carton",
    "soured",
    "cream",
    "serve"
  ],
  "directions": [
    "0",
    "Heat oven to 200C/fan 180C/gas 6. Heat half the oil in a medium frying pan, then gently fry the onions for 12-15 mins until softened and lightly browned. Tip the onions into a bowl and mix with the artichoke hearts, season if you like and set aside. Heat the remaining oil in the same pan (there’s no need to clean it) over a high-ish heat. Add the mushrooms, then stir-fry for 2-3 mins until soft, throw in the garlic and thyme and continue to cook for a minute. Remove from the heat, season well and allow to cool.",
    "On a floured surface, roll out the pastry into a rough circle about 40cm in diameter and drape over a large baking sheet.",
    "Pile the onions and artichokes into the middle of the pastry and spread them out evenly, leaving a 10cm border around the edge, then pile the mushrooms on top.",
    "Bring the edges of the pastry up over the filling. Brush the exposed pastry edge with the egg glaze. Bake for 20-25 mins until the pastry is crisp and golden brown. Sprinkle with parsley and serve immediately with the sour cream and relish."
  ],
  "ingredients": [
    "0",
    "3 tbsp olive oil",
    "2 large onions, finely sliced",
    "300g grilled artichoke hearts, halved",
    "300g mixed mushrooms, halved if large",
    "1 garlic clove, crushed",
    "1 tsp fresh thyme leaves",
    "500g pack ready-made shortcrust pastry",
    "1 egg, a pinch of salt and 1 tbsp water, beaten together to glaze",
    "large handful flat leaf parsley leaves, very roughly chopped",
    "142ml carton soured cream, to serve"
  ],
  "__v": 1
}