{
  "hash": "c6b283f660a77d0ff454c5bade8296183a840a62",
  "title": "Babish Foccacia Bread",
  "image": "",
  "href": "http://recipe-folder.com/recipe/5b772f243d946d7ece1c64bf",
  "extension": "User Added",
  "firstAdded": "2018-08-17T20:25:08.007000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Get your stand mixer ready with the dough hook, and in the stand mixing bowl add 850g of bread flour along with 2 ½ cups of room temperature water and mix on low for a few minutes.",
    "1",
    "Combine ½ a cup of water that is about 105°F with 1 full packet of active dry yeast and a pinch of sugar. Whisk to combine and let stand at room temperature for about 5 minutes and then add to your shaggy ball of dough in your stand mixer.",
    "2",
    "Once water is fully absorbed add 2 Tbsp of kosher salt, and then knead on a medium speed for about 5 minutes.",
    "3",
    "Generously oil a bowl, add your dough mixture, cover, and let sit for about 2 hours.",
    "4",
    "Using a rubber spatula, fold the dough stuck to the edges onto itself.",
    "5",
    "In an 18x13 rimmed baking sheet, add about ½ a cup of olive oil and spread out until pan is fully coated.",
    "6",
    "Place the bread mixture onto the baking sheet and using the olive oil, fold the mixture onto itself a few times and then start to spread the dough across the surface of the pan. If the dough keeps springing back, place some olive oil on the bread and cover it with plastic wrap for 15 minutes. You may have to do it a few times, but it’ll eventually spread to the whole pan.",
    "7",
    "Once the pan is filled out, hit it with some more oil, and then cover and let it ferment overnight in the fridge so for about 12 hours. If any bubbles form, just poke them with a knife, and using oiled fingers, pull the bread just off the edges.",
    "8",
    "Coat bread in olive oil and let sit covered at room temperature for about an hour. Make dimples in the dough with your fingers.",
    "9",
    "Preheat oven at 450°F for 1 hour. Coat the dough one last time with olive oil and kosher salt and bake for about 30 minutes.",
    "10",
    "Remove and place on a baking rack for about an hour and half to cool. Serve and enjoy!"
  ],
  "ingredients": [
    "0",
    "Bread flour",
    "1",
    "Salt",
    "2",
    "Olive oil",
    "3",
    "Yeast",
    "4",
    "Water"
  ],
  "__v": 1,
  "hidden": true
}