{
  "hash": "1a021480438efe9aad9315b3cf1063db2ed42af6",
  "title": "WILD RICE HOTDISH WITH RAS EL HANOUT AND DATES",
  "image": "http://enchor.ca/uploads/3/4/4/4/3444473/6490101.jpg?1491777270",
  "href": "http://enchor.ca/test.html",
  "extension": "Chrome",
  "firstAdded": "2017-04-09T22:41:05.545000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 375 F (190 C). Grease a 33-by-23-cm (13-by-9-inch) baking dish. (Alternatively, if you use a Dutch oven to cook the onion mixture — see below — you can bake the mixture in the Dutch oven.)",
    "In a medium saucepan, com­bine the wild rice, water, and 1/4 tsp (1 mL) of the salt and bring to a boil over high heat. Reduce the heat to a simmer, cover, and cook for 30 minutes. Drain the rice.",
    "In a large pot or 4-litre Dutch oven, heat 4 tbsp (60 mL) of the olive oil over medium-high heat. Add the onion, carrots, a few turns of black pepper, and 1/4 tsp (1 mL) of the salt and cook, stir­ring, until soft, about 10 minutes. Add the ras el hanout and cook for 2 more minutes and then add the beef and remaining 1/4 tsp (1 mL) salt. Cook, breaking up the meat with a spoon, until it is no longer pink. Add the flour (see note) and stir to combine. Add the coconut milk and cook, stirring, until thickened, and then add the broth and cook, stirring, until thickened. Add the dates. Reduce the heat to low and simmer for 10 minutes. Taste and adjust seasonings as desired. Stir in the wild rice and mix tocombine. If not using a Dutch oven, pour the mixture into the baking dish.",
    "Place the saltines (see note) in a large zip-top bag, crush them up, then toss them with the remaining 1 tbsp (15 mL) olive oil. Spread the crackers over the top of the dish. Bake uncovered for 35 minutes. Top with fresh parsley and lemon juice. Let cool slightly before serving.",
    "Notes: During Passover, use 2 tbsp (30 mL) potato starch in place of the flour, and substitute sheets of matzo for the saltines."
  ],
  "ingredients": [
    "0",
    "3/4 cup (175 mL) wild rice, rinsed and drained",
    "2 cups (500 mL) water",
    "3/4 tsp (3 mL) kosher salt",
    "5 tbsp (75 mL) olive oil",
    "1 large onion, finely chopped",
    "4 large carrots, cut into 1/2 inch pieces",
    "Black pepper",
    "4 tsp (20 mL) Ras el Hanout (recipe follows)",
    "1 lb (450 grams) ground beef (85 per cent lean)",
    "1/4 cup (50 mL)flour (see note)",
    "1 can (398 mL/13.5 oz) full fat coconut milk",
    "1-1/3 cups (325 mL) beef or vegetable broth",
    "1/3 cup (75 mL) packed pitted dates, cut into 1/2-inch pieces",
    "1 sleeve saltines (see note)",
    "1/4 cup (50 mL) chopped fresh flat-leaf parsley",
    "1 tbsp (15 mL) lemon juice",
    "RAS EL HANOUT",
    "1/2 tsp (2 mL) ground cardamom",
    "1/2 tsp (7 mL) ground cumin",
    "1/2 tsp (2 mL) ground cinnamon",
    "1/2 tsp (2 mL) paprika",
    "1/2 tsp (2 ML) ground nutmeg",
    "1/4 tsp (1 mL) ground black pepper",
    "1/2 tsp (2 mL) cayenne pepper",
    "1/4 tsp (1 mL) ground coriander",
    "1/4 tsp (1 mL) ground allspice",
    "1/4 tsp (1 mL) ground cloves"
  ],
  "__v": 1
}