{
  "hash": "758fe7ba197a96a4921000c101749e42479d7715",
  "title": "Miso Pate",
  "image": "http://www.drweil.com/drw/file/miso_paste_RCP.jpg?id=9755",
  "href": "http://www.drweil.com/drw/u/RCP00239/Miso-Pate.html",
  "extension": "Chrome",
  "firstAdded": "2015-06-12T12:21:36.042000",
  "users": [
    null
  ],
  "keywords": [
    "loaf",
    "goodquality",
    "wheat",
    "bread",
    "stale",
    "unsalted",
    "broth",
    "tahini",
    "red",
    "mugi",
    "hatcho",
    "miso",
    "toastedsesame",
    "oil",
    "garlic",
    "mashed",
    "medium",
    "onion",
    "parsley",
    "dry",
    "sherry",
    "needed",
    "dashes",
    "thyme",
    "sage",
    "rosemary",
    "allspice",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "Preheat oven to 250° F",
    "Place the bread slices on a baking sheet and bake them until they are thoroughly dry, about 45 minutes. Let the bread cool, then break it into pieces. You should have about 4 cups of pieces. Put the bread and broth in a bowl and work it with your hands until evenly moist.",
    "In a separate bowl, mix the tahini, miso, garlic and sesame oil until well blended. Add to the moistened bread and work everything together well using your hands. Add the onions, parsley and sherry.",
    "Season well with thyme, sage or rosemary, allspice and pepper. Add a few more tablespoons of sherry if needed and knead with your hands until pate is well blended. Add a little more liquid (broth or water) if necessary, to make a moist, sticky consistency.",
    "Pack the pate firmly into a small loaf pan or bowl. Cover and refrigerate for 24 hours. (This is important!)",
    "Remove the pate from the refrigerator at least a half-hour before serving. Un-mold it and serve with crackers."
  ],
  "ingredients": [
    "0",
    "1 loaf good-quality whole wheat bread, sliced (OK if stale)",
    "1 cup unsalted vegetable broth",
    "1 cup tahini",
    "1 1/2 tablespoons red, mugi or hatcho miso",
    "1 tablespoon toasted-sesame oil",
    "2 cloves garlic, mashed",
    "1 medium onion, finely chopped",
    "1/2 cup chopped fresh parsley",
    "3 tablespoons dry sherry, or more as needed",
    "Dashes of thyme, sage or rosemary, and allspice",
    "Freshly ground black pepper to taste"
  ],
  "__v": 1
}