{
  "hash": "dfd16ec05c6cb892b90b15ee6166e179e2ccb615",
  "title": "Gluten Free Naan Bread Recipe - Flat or Pita Bread",
  "image": "http://alittleinsanity.wpengine.netdna-cdn.com/wp-content/uploads/2014/05/gluten-free-naan-bread-recipe-flat-bread-pita-300x200.jpg",
  "href": "http://alittleinsanity.com/gluten-free-naan-bread-recipe/",
  "extension": "",
  "firstAdded": "2015-11-02T15:10:02.694000",
  "users": [
    null
  ],
  "keywords": [
    "water",
    "honey",
    "dry",
    "active",
    "yeast",
    "erikas",
    "purpose",
    "gluten",
    "free",
    "flour",
    "baking",
    "salt",
    "olive",
    "oil",
    "proofing",
    "bowl",
    "apple",
    "cider",
    "vinegar",
    "clove",
    "garlic",
    "granulated",
    "onion",
    "pepper",
    "approx",
    "tapioca",
    "corn",
    "starch",
    "dusting",
    "rolling",
    "bread"
  ],
  "directions": [
    "0",
    "Stir together Warm Water & Honey in the bowl of your Stand Mixer. Add in the Dry Active Yeast and allow to proof for approx. 10 minutes while you prepare the other ingredients.",
    "In Medium Bowl, whisk together Gluten Free Flour Mix, Baking Powder & Salt.",
    "After yeast has proofed, add your Dry Ingredients along with the Olive Oil & Apple Cider Vinegar to the Stand Mixer bowl.",
    "Using the paddle attachment, mix the dough on a medium-high speed for approximately 2 minutes.",
    "Using a spatula, scrape down the sides and bottom of bowl and form dough into a ball. Then drizzle the extra Olive Oil over the dough ball so that it is well coated.",
    "Set dough aside to proof (I cover mine with a kitchen towel) for approximately 1 hour or until the dough doubles in size.",
    "BAKING STONE OVEN INSTRUCTIONS: Preheat your oven and stone to 450 degrees.",
    "CAST IRON PAN STOVE TOP INSTRUCTION: Preheat your cast iron pan on a medium heat until it's evenly hot and reduce heat as necessary to maintain the temp. You may need a little bit of oil on the cast iron pan if it's not well seasoned or dry.",
    "Line your cutting board with parchment paper and dust generously with Tapioca or Corn Starch to prevent sticking. Make sure your rolling pin is ready to go.",
    "Divide the dough into 8 pieces (I just eyeball this as I go).",
    "Roll each piece into a ball and flatten with your hands into a thick disk before rolling out. With the residual oil left in the bowl, the dough shouldn't stick to your hands, but use dust your hands if necessary.",
    "Roll out the dough ball into a circle that is approx. ¼\" thick. Don't roll it too thin.",
    "Place the flattened dough onto your prepared hot baking stone or pan and allow to cook for 2-5 minutes until the bottom is lightly browned. When cooking on the stovetop in a pan, you may need to flip the bread over after a minute or two so that both sides cook thoroughly. The bread may bubble and puff up as it cooks - that's perfect!",
    "Remove bread from oven/pan and place onto a plate and cover with a kitchen towel - this step is essential to keeping the bread moist before serving.",
    "Repeat the process until all pieces are cooked. Once you get a rhythm down, you can be preparing the next piece as the others are cooking. I rotate 2 or 3 on my Baking Stone at a time and it's all done in less then 15 minutes.",
    "1",
    "In a small fry pan, add Olive Oil, Crushed Garlic & Seasonings and sauté until garlic is soft. (You can use just Olive Oil if you want)",
    "Using a basting brush, baste the finished bread (top & bottom) generously with the seasoned Oil and cover with towel until serving. This step not only adds amazing flavor, but helps the bread to stay soft - even after refrigerating or freezing and re-heating later.",
    "Store any unused bread in the fridge for 2-3 day - or freeze for up to one month. To reheat, cover the bread with a towel and microwave for 15-30 seconds."
  ],
  "ingredients": [
    "0",
    "1 Cup + 2 Tablespoons Warm Water",
    "2 Tablespoons Honey",
    "2¼ Teaspoons Dry Active Yeast",
    "1",
    "3 Cups Erika's All Purpose Gluten Free Flour Mix",
    "1 Tablespoon Baking Powder",
    "1 Teaspoon Salt",
    "2",
    "1 Tablespoon Olive Oil for Mix In + 1 Tablespoon for Proofing Bowl",
    "2 Teaspoons Apple Cider Vinegar",
    "3",
    "2 Tablespoons Olive",
    "1 Clove of Garlic - Crushed",
    "½ Teaspoon Granulated Onion",
    "½ Teaspoon Salt",
    "Pepper to taste",
    "4",
    "Approx. ¼ Cup Tapioca or Corn Starch For Dusting & Rolling Out Bread"
  ],
  "__v": 1
}