{
  "hash": "5307b0ea17b1b6e2b522b05ff0cd3373d5cf19c9",
  "title": "easy breakfast stuffed peppers",
  "image": "https://www.themediterraneandish.com/wp-content/uploads/2018/04/Easy-Stuffed-Peppers-for-Breakfast-The-Mediterranean-Dish-2.jpg",
  "href": "https://www.themediterraneandish.com/easy-stuffed-peppers/",
  "extension": "",
  "firstAdded": "2018-05-05T18:11:22.675000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 degrees F.",
    "Arrange pepper halves in a baking dish or cast iron skillet. Add 1 cup water to the bottom of dish or skillet. Cover with foil and bake in heated oven for 10 to 15 minutes.",
    "Meanwhile, make the potato hash stuffing. Begin by heating a 12-inch cast iron skillet over high heat. Add mushrooms, cook tossing regularly until nicely browned. Season with salt. Remove from skillet.",
    "Turn heat to medium-high. To the skillet, add 2 tbsp extra virgin olive oil. When oil is shimmering but not smoking (which will be quick), add onions and potatoes. Season with salt and pepper and the spices. Cook, stirring regularly for 5 minutes. Add the garlic, and continue to cook over medium-high heat, stirring regularly, until potatoes are tender, another 5 to 7 minutes or so.",
    "Now, add the cooked mushrooms, tomato, and parsley to the potatoes. Stir to combine. Remove from heat.",
    "Remove pepper halves from oven (do not drain water.) Stuff each with the potato stuffing about 3/4 of the way. Now, carefully crack one egg into each pepper over the potato stuffing.",
    "Cover with aluminium foil (make sure to tent the foil so it does not stick to the egg yokes.) Bake in heated oven for 18 to 20 minutes, or until the eggs are soft set (longer if you like the eggs more cooked.) Serve immediately!"
  ],
  "ingredients": [
    "0",
    "3 bell peppers, any color, halved length-wise and cored",
    "water",
    "Private Reserve Greek extra virgin olive oil",
    "6 oz mushrooms, any kind, sliced or chopped",
    "1 cup chopped yellow onion",
    "1o to 12 oz gold potatoes, peeled and diced small",
    "Salt and pepper",
    "3/4 tsp all-natural Aleppo pepper",
    "3/4 tsp organic coriander",
    "3/4 tsp organic cumin",
    "1/2 tsp organic turmeric",
    "3 garlic cloves, chopped",
    "1/2 cup chopped or sliced cherry tomatoes",
    "1/2 cup packed chopped fresh parsley",
    "6 eggs"
  ],
  "__v": 1
}