{
  "hash": "8ea68be70bb1abbe412c7b84bf0ee12c5f028a9a",
  "title": "Candy Cane Cookies",
  "image": "http://p-fst2.pixstatic.com/548780d6dbfa3f0cc3017eb4/_w.540_s.fit_/2014-12-15-CandyCaneCookies-5.jpg",
  "href": "http://www.thekitchn.com/recipe-candy-cane-cookies-dessert-recipes-from-the-kitchn-213928",
  "firstAdded": "2014-12-22T18:45:58.684000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "butter",
    "softened",
    "room",
    "sugar",
    "egg",
    "vanilla",
    "peppermint",
    "almond",
    "allpurpose",
    "flour",
    "salt",
    "red",
    "food",
    "coloring"
  ],
  "directions": [
    "0",
    "Cream together the butter and sugar in the bowl of a stand mixer with a paddle attachment or with a hand mixer until they look soft and frosting-like. Scrape down the sides of the bowl, then mix in the egg, vanilla, and peppermint. Scrape down the sides of the bowl. With the mixer on low speed, mix in the flour and salt just until no more visible flour remains.",
    "Use a stiff spatula to mix the dough a few times by hand to work in any last bits of flour. Divide the dough and set one piece aside. Add 1/2 teaspoon of red food coloring to the remaining dough and work the dye into the dough with the spatula, kneading by hand, or in the mixer on low, whichever method seems easiest to you. Add additional food coloring as needed until the dough is a bright, vibrant red.",
    "Pat both pieces of dough into 1-inch thick circles, wrap in plastic, and refrigerate for at least 1 hour or up to 3 days. This will make the cookies easier to roll out and shape.",
    "When ready to bake the cookies, preheat the oven to 375°F. Place one rack in the top third and another rack in the bottom third of the oven. Line two baking sheets with parchment or nonstick baking mats.",
    "Remove both pieces of dough from the fridge and unwrap. Pinch off walnut-sized pieces of dough (roughly 2 tablespoons) and roll each into a thick rope about 6 inches long. Pinch the two ropes together at the top and gently twist them together. Transfer the twisted ropes to the baking sheet and gently \"hook\" the top to create a candy cane shape.",
    "Repeat with the remaining dough. If the dough starts to break as you roll it or become hard to work with, put it back in the fridge to chill for 15 minutes. When all the cookies have been shaped, chill both sheets of cookies for 15 minutes before baking — this helps the cookies hold their shape during baking.",
    "Bake for 10 to 12 minutes, until the bottom edges and the tips of the cookies are just barely starting to turn golden. Cool for 10 minutes on the baking sheet and then transfer to cooling racks to finish cooling completely.",
    "Store cookies between layers of wax paper in an airtight container. They are actually best the day after baking (their flavors have time to mellow) and will stay fresh for about 2 weeks."
  ],
  "ingredients": [
    "0",
    "1 cup unsalted butter, softened to room temperature",
    "1 cup powdered sugar",
    "1 large egg",
    "1 teaspoon vanilla extract",
    "1 teaspoon peppermint extract (or 1/2 teaspoon almond extract)",
    "3 cups all-purpose flour",
    "1/2 teaspoon salt",
    "1/2 to 3/4 teaspoon red food coloring"
  ],
  "__v": 1
}