{
  "hash": "00ab9d2749074e067403d262284299c424521b50",
  "title": "The Original Shannon Airport Irish Coffee",
  "image": "http://img.sndimg.com/food/image/upload/w_158,h_118/v1/img/recipes/28/92/13/pichDplRp.jpg",
  "href": "http://www.food.com/recipeprint.do?rid=289213",
  "extension": "Chrome",
  "firstAdded": "2016-09-15T22:11:19.738000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "Take a wine glass and pour enough of the coffee to fill it just over half way.",
    "Add the sugar and stir until it dissolves.",
    "Add the whisky and stir.",
    "Slowly pour a thick layer of double cream, over the back of a teaspoon, on to the top of the coffee so that it floats on top.",
    "Do NOT stir the coffee, but drink it through the cream."
  ],
  "ingredients": [
    "0",
    "ABOUT THIS RECIPE",
    "\"The original recipe as per Joseph Sheridan should be: \"Cream, rich as an Irish brogue; Coffee, strong as a friendly hand; Sugar, sweet as the tongue of a rogue; Whiskey, smooth as the wit of the land.\" An After Dinner classic and with a rich history - use good Irish Whiskey, freshly brewed coffee and pouring cream (Double cream) - NOT whipped cream for this authentic and delectable boozy coffee! History: From 1939 to 1945 Joseph Sheridan was the head Chef of a catering company based at the Shannon airport (20 miles north of Limerick , Ireland ). Joseph Sheridan was taxed with trying to find a suitable drink for passengers who had traveled for eighteen hours by seaplane and then had to travel by boat to the terminal. Hot coffee and tea was obviously not enough to take the chill out of the passengers so Joseph began to offer an alternative. His mix of Irish whiskey and coffee became known as Irish Coffee, and Joseph had secured his place in drink history To this day if you travel through Shannon Airport you will find the “Sheridan Bar” in the departures lounge, and a plaque that has been placed there in honour of Joseph’s great warm libation. (and yes, they do serve his original Irish Coffee recipe.) Sláinte!\"",
    "INGREDIENTS",
    "1 cup strong black hot coffee",
    "1 -2 teaspoon sugar",
    "25 ml measure Irish whiskey",
    "2 tablespoons double cream"
  ],
  "__v": 1
}