{
  "hash": "b906b29a957d0702fc5fe8fbad5450fcf2e278da",
  "title": "Sausage Spinach Ravioli With Tomato Cream Sauce",
  "image": "http://www.italianfoodforever.com/staging/wp-content/uploads/2008/05/sausageravioli1.jpg",
  "href": "http://www.italianfoodforever.com/2008/05/sausage-spinach-ravioli-with-tomato-cream-sauce/",
  "extension": "Chrome",
  "firstAdded": "2016-07-28T08:45:10.202000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "Combine the flour and salt on a flat work surface; shape into a mound and make a well in the center.",
    "Add the eggs and 1 tablespoon of the olive oil to the well and lightly beat with a fork.",
    "Gradually draw in the flour from the inside wall of the well in a circular motion.",
    "Continue to incorporate all the flour until it forms a ball, then wrap the ball in plastic wrap and let rest 30 minutes.",
    "While the pasta is resting, prepare the filling.",
    "Steam the spinach and drain well, pressing the spinach to remove all excess liquid.",
    "In a heavy frying pan heat the olive oil and saute the onion with the sausage meat until the onion is tender and the sausage meat lightly browned, then add the garlic, and season with salt and pepper.",
    "Place the sausage mixture, spinach, egg and cheese in a food processor and pulse just until the mixture is combined. (You want to retain a coarse mixture so be careful not to over process the filling.)",
    "Cut the ball of dough in 1/2, cover and reserve the piece you are not immediately using to prevent it from drying out.",
    "Dust the counter and dough with a little flour, then press the dough into a rectangle and roll it through a pasta machine, 2 or 3 times, at widest setting.",
    "Pull and stretch the sheet of dough with the palm of your hand as it emerges from the rollers, and begin to reduce the setting and crank the dough through again, 2 or 3 times.",
    "Continue tightening until the machine is at the second narrowest setting; the dough should be almost paper-thin.",
    "Beat 1 egg with 1 tablespoon of water to make an egg wash.",
    "Dust the counter and sheet of dough with flour, lay out the long sheet of pasta, and brush the top surface with the egg wash, which acts as a glue. Drop 1 tablespoon of the filling on 1/2 of the pasta sheet, about 2-inches apart, then fold the other 1/2 over the filling like a blanket.",
    "With your fingers, gently press out air pockets around each mound of filling, and use a sharp knife to cut each pillow into squares and crimp the 4 edges with the tins of a fork to make a tight seal. (A fluted pastry wheel also works well to make an attractive edge around the pasta.)",
    "Dust the ravioli and a sheet pan with cornmeal to prevent the pasta from sticking and lay them out to dry slightly while assembling the rest. (If not using within an hour or two refrigerate until needed.)",
    "To prepare the sauce, heat the two tablespoons of oil in a heavy pot and cook the garlic for just a minute.",
    "Add the tomatoes, salt, pepper, and pepper flakes and cook over medium low heat for 10 minutes.",
    "Add the cream and fresh, chopped herbs and mix well, and cook over low heat an additional 10 minutes, then keep the sauce warm while you cook the pasta.",
    "Cook the ravioli in plenty of boiling salted water until tender. (They will float to the top when ready, so be careful not to overcrowd the pot.)",
    "Drain the ravioli and return to the pot.",
    "Pour half of the sauce mixture into the pot and carefully stir until the ravioli is lightly coated.",
    "Serve the ravioli with a spoonful of additional sauce and a sprinkling of grated cheese.",
    "Serve hot."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "Dough:",
    "2 Cups All-Purpose Flour",
    "3 Eggs",
    "1/2 Teaspoon Salt",
    "2 Tablespoons Olive Oil",
    "Filling:",
    "8 Cups Fresh Spinach, Cleaned And Coarsely Chopped",
    "4 Large Italian Sausage Links, Removed From Casings",
    "1 Medium Onion, Chopped",
    "2 Cloves Garlic, Peeled And Minced",
    "3 Tablespoons Olive Oil",
    "1/2 Cup Grated Parmesan Cheese",
    "1 Egg",
    "Salt & Pepper",
    "Sauce:",
    "2 Tbsp. Olive Oil",
    "2 Cloves Garlic, Minced",
    "1/2 Tsp. Crushed Red Pepper Flakes",
    "1 (28 ounce) Can Crushed Tomatoes",
    "Salt & Pepper",
    "1/2 Cup Heavy Whipping Cream",
    "1/4 Cup Chopped Fresh Parsley (Or Basil)",
    "Additional:",
    "1 Egg",
    "Grated Parmesan Cheese To Serve"
  ],
  "__v": 1
}