{
  "hash": "3e33393cbd3a8e494b5dc2c98d9d196e9ac514ee",
  "title": "Sabich Sandwiches (Pitas With Eggplant, Eggs, Hummus, and Tahini) Recipe",
  "image": "https://www.seriouseats.com/recipes/images/2016/03/20160317-sabich-sandwich-vicky-wasik-4-1500x1125.jpg",
  "href": "https://www.seriouseats.com/recipes/2016/03/sabich-sandwich-eggplant-egg-hummus-pita-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2018-08-07T16:26:54.867000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place tomatoes in a fine-mesh strainer set over a bowl and toss with a generous pinch of salt. Let stand 30 minutes.",
    "Meanwhile, heat 1/4 inch oil in a large skillet over medium-high heat until shimmering. Working in batches if necessary, fry eggplant slices, rotating for even browning and turning once halfway through, until golden on both sides and tender throughout, about 5 minutes; lower heat if oil begins to smoke. Transfer eggplant to a paper towel–lined baking sheet and sprinkle with salt.",
    "Transfer tomatoes to a medium bowl and discard drained liquid. Add cucumber, lemon juice, and parsley to tomatoes. Season Israeli salad with salt to taste and mix well.",
    "In a medium bowl, toss cabbage with vinegar and season with salt.",
    "In each pita pocket, smear 3 tablespoons (45ml) of hummus in an even layer. Layer 2 to 3 slices fried eggplant on top of each. Drizzle each with 1 tablespoon (15ml) tahini sauce, then top with sliced eggs, Israeli pickles, and remaining tahini sauce. Spoon some of the Israeli salad into each pita, drizzle with amba, and serve."
  ],
  "ingredients": [
    "0",
    "2 plum tomatoes (7 ounces; 200g), cored and diced",
    "Kosher salt",
    "Olive oil or vegetable oil, for frying",
    "3/4 pound Italian eggplant (about 1 medium eggplant; 350g), sliced into 1/2-inch-thick rounds",
    "1/2 large seedless cucumber (7 ounces; 200g), diced",
    "2 tablespoons (30ml) fresh juice from 1 lemon",
    "1 tablespoon minced flat-leaf parsley",
    "1/4 cored head cabbage (7 ounces; 200g), thinly shredded",
    "2 tablespoons (30ml) white wine vinegar",
    "4 fresh rounds pita bread, warmed and split just enough to form a pocket",
    "3/4 cup homemade or store-bought hummus (6 ounces; 170g)",
    "1/2 cup (120ml) homemade or store-bought tahini sauce (note that tahini and tahini sauce are different products)",
    "4 hard-boiled eggs, peeled and sliced",
    "Israeli pickles, for serving (see note)",
    "Amba sauce, for serving (see note)"
  ],
  "__v": 1
}