{
  "__v": 1,
  "directions": [
    "0",
    "Stir all 'Dressing' ingredients together in a cup. Make sure shrimp paste and honey dissolve fully. Taste-test for sweetness and spice, adding more honey or chili to taste. Set aside.",
    "Use a sharp knife to peel the green papaya, then slice it in half and use a spoon to scrape out the seeds. Using the largest grater you have, grate the papaya, or you can use a potato peeler to create thin, ribbon-like strips. Place in a large bowl.",
    "Add sliced tomato, spring onion, chili/cayenne, bean sprouts, green beans (if using), shrimp or tofu (if using) and most of the basil. Pour over the dressing, tossing well to combine.",
    "Add nuts and toss again. Taste-test the salad. If not sweet enough, add a little more honey or a sprinkling of sugar. If not flavorful enough, add a little more fish sauce or soy sauce. If too sweet or salty, add more lime juice. Add more chili for a spicier salad.",
    "To serve, scoop into individual bowls or onto serving plates. Top with remaining basil leaves plus fresh coriander and a sprinkling of more nuts. Serve immediately and ENJOY!",
    "Make Ahead Tip: If you wish to make this salad ahead of time, combine all ingredients except the nuts and the dressing. You can then leave it covered in the refrigerator several hours, or overnight. Add the dressing and peanuts at the last minute, then toss and serve."
  ],
  "hash": "4f0d1daa13bd4a13215722076313273edbb41b39",
  "href": "http://thaifood.about.com/od/thaisnacks/r/PapayaSalad.htm",
  "image": "http://0.tqn.com/d/thaifood/1/I/_/a/greenpapayasaladblognew.jpg",
  "ingredients": [
    "0",
    "1 small green papaya, OR 1/2 large (see recipe)",
    "1/2 cup roasted peanuts or cashews",
    "2 cups bean sprouts",
    "1 to 2 tomatoes, cut into thin wedges or long strips",
    "3 spring onions, cut into long matchstick-like pieces",
    "1/2 cup fresh basil, leaves left whole or chopped",
    "handful of fresh coriander",
    "1 red chili, sliced, seeds removed (reduce or omit, to taste)",
    "optional: 1 cup blanched green beans",
    "optional: cooked baby shrimp OR cubed fried tofu",
    "DRESSING:",
    "1/2 tsp. shrimp paste OR substitute 1 Tbsp. fish sauce OR soy sauce for vegetarians",
    "2 Tbsp. good-tasting vegetable oil",
    "2 Tbsp. fish sauce OR soy sauce for vegetarians",
    "3 Tbsp. lime juice",
    "1/2 to 1 Tbsp. liquid honey, to taste",
    "1/8 to 1/4 tsp. chili flakes or cayenne pepper, to taste"
  ],
  "keywords": [
    "green",
    "papaya",
    "recipe",
    "roasted",
    "peanuts",
    "cashews",
    "bean",
    "sprouts",
    "tomatoes",
    "wedges",
    "long",
    "strips",
    "spring",
    "onions",
    "matchsticklike",
    "pieces",
    "basil",
    "leaves",
    "left",
    "coriander",
    "red",
    "chili",
    "seeds",
    "reduce",
    "omit",
    "beans",
    "baby",
    "shrimp",
    "cubed",
    "fried",
    "tofu",
    "dressing",
    "fish",
    "soy",
    "vegetarians",
    "goodtasting",
    "oil",
    "lime",
    "juice",
    "honey",
    "cayenne",
    "pepper"
  ],
  "title": "Thai Green Papaya Salad (\"Som Tam\")",
  "users": [
    null
  ]
}