{
  "hash": "acc2ffe993bff059953734108ab9369ff6ce6b88",
  "title": "Bacon, Egg and Fried Green Tomato Sandwich",
  "image": "http://target.scene7.com/is/image/Target/c_Bacon-Egg-and-Fried-Green-Tomato-Sandwich_RT?hei=340",
  "href": "http://www.cooking.com/recipes-and-more/recipes/bacon-egg-fried-green-tomato-sandwich-recipe?CCAID=cknwfhne06265bd&s=s0085567335s&mid=2106310&rid=85567335",
  "extension": "Chrome",
  "firstAdded": "2015-04-23T23:59:26.840000",
  "users": [
    null
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "kosher",
    "salt",
    "sprinkling",
    "stoneground",
    "cornmeal",
    "eggs",
    "milk",
    "mayonnaise",
    "capers",
    "slices",
    "bacon",
    "green",
    "tomato",
    "inchthick",
    "english",
    "muffins",
    "fat",
    "butter"
  ],
  "directions": [
    "0",
    "In a shallow baking dish, mix the flour with 1/2 teaspoon of the salt. In another shallow baking dish, mix the cornmeal with the remaining 1/2 teaspoon salt. Whisk one of the eggs and the milk in a third shallow baking dish. Set near the stove in that order. Line a baking sheet with a wire rack.",
    "Mix the mayonnaise and capers in a small bowl.",
    "Lay the slices of bacon in a cold cast-iron skillet. Turn the heat to medium-high and cook until the bacon is good and crispy, flipping the pieces as they brown, and lowering the heat if needed to prevent burning. Put a metal lid on top of the bacon to keep the pieces flat, if desired. As they finish, move to paper-towel lined plate.",
    "Meanwhile, dip the tomato slices in the flour, then the egg, and then the cornmeal, patting to adhere. Reserve on the rack until the bacon is done.",
    "When the bacon is all cooked, turn the heat in the skillet to medium-low if it isn’t already. Place the tomatoes in the bacon fat and cook until the cornmeal lightly browns, about 3 minutes. Flip and brown the other side, a couple of minutes. Remove to the wire rack.",
    "Toast the English muffins.",
    "Meanwhile, heat the bacon fat or butter in a medium nonstick skillet over medium heat. Crack the remaining 4 eggs into the skillet and sprinkle with salt. Gently poke at the whites with a rubber spatula to help them set. Cook to desired doneness (my preference is 1 to 1 1/2 minutes for sunny-side up).",
    "Spread one quarter of the caper mayonnaise on each English muffin half. Top each half with 1 fried tomato, 1 egg and 4 slices bacon. Serve with knife and fork."
  ],
  "ingredients": [
    "0",
    "1/2 cup all-purpose flour",
    "1 teaspoon kosher salt, plus more for sprinkling",
    "1/2 cup stone-ground cornmeal",
    "5 large eggs",
    "1 tablespoon milk",
    "1/4 cup mayonnaise",
    "1/2 teaspoon capers, minced",
    "8 slices bacon, cut in half",
    "1 large green tomato, cut into four 1/2-inch-thick slices",
    "2 English muffins",
    "1 tablespoon bacon fat or butter"
  ],
  "__v": 1
}