{
  "__v": 1,
  "directions": [
    "0",
    "Line a platter with paper towels, and set aside.",
    "In a large Dutch oven (I use a 5-quart size), cook the bacon over medium high heat, stirring occasionally, until the fat is rendered and the bacon is lightly browned, approximately 20 minutes. With a slotted spoon, remove the bacon to the platter and let it drain.",
    "Pour off all but 1 tablespoon of the bacon fat (discard or save for another use). Add the onions and garlic, and cook until the onions are translucent, 5-6 minutes. Add vinegar, sugar, maple syrup and coffee, and bring to a boil, stirring and scraping up the bacon bits from the bottom of the pan. After 2 minutes, add the bacon, and stir to combine.",
    "Reduce heat to simmer, and cook, uncovered, for 2 hours, stirring occasionally to make sure nothing is burning. If the jam seems to be cooking too fast, add 1/4 cup of water every now and then. When the liquid is syrupy, remove the pot from the heat. Let it sit for 5 minutes, then transfer contents to a food processor and pulse 3 or 4 times until coarsely chopped. Transfer to a heat-resistant bowl. Let the jam cool, then refrigerate in an airtight container.",
    "The jam will keep in the refrigerator for up to 4 weeks, though if your family is like mine, this jam has no hope of lasting that long. Not even close."
  ],
  "firstAdded": "2014-06-28T23:35:21.325000",
  "hash": "a641ef13672901a2cc198d909078f4de0a3d0e26",
  "href": "http://www.theperfectpantry.com/2011/01/recipe-for-bacon-jam-and-cheese-panini.html",
  "image": "http://ninecooks.typepad.com/.a/6a00d83451fa5069e20147e15960b5970b-800wi",
  "ingredients": [
    "0",
    "1-1/2 lb sliced center cut hickory-smoked bacon, cut crosswise into 1-inch pieces",
    "2 medium yellow onions, peeled and chopped",
    "3 garlic cloves, smashed and peeled",
    "1/2 cup cider vinegar",
    "1/2 cup packed brown sugar (light or dark; I prefer light)",
    "1/4 cup pure maple syrup",
    "3/4 cup brewed strong coffee"
  ],
  "keywords": [
    "center",
    "hickorysmoked",
    "bacon",
    "crosswise",
    "pieces",
    "medium",
    "yellow",
    "onions",
    "garlic",
    "smashed",
    "cider",
    "vinegar",
    "brown",
    "sugar",
    "dark",
    "prefer",
    "light",
    "maple",
    "syrup",
    "brewed",
    "strong",
    "coffee"
  ],
  "title": "Bacon jam",
  "users": [
    null
  ]
}