{
  "hash": "2b8d5e2d89a45fd078c351ff4efca232953e422c",
  "title": "4.86 from 7 votes Print\nAutumn Crunch Pasta Salad",
  "image": "",
  "href": "https://www.chelseasmessyapron.com/autumn-crunch-pasta-salad/",
  "extension": "Chrome",
  "firstAdded": "2018-08-29T20:11:22.105000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Get Ingredients Powered by Chicory",
    "Instructions",
    "Cook the pasta according to package directions.",
    "While the pasta is cooking, prepare the dressing. In a food processor or blender (I used my small Twister jar on the Blendtec) combine the apple cider vinegar, white wine vinegar, sugar, (adjust -- more or less to personal preference, we like a less sweet dressing and use about 2 tablespoons) paprika, and onion powder. Pulse or blend for about 10 seconds. Slowly add in the oil and pulse until just combined. Stir in the poppyseeds. IF you don't have a blender or food processor you can combine the ingredients in a bowl or mason jar and whisk (or shake jar) vigorously.",
    "Drain the pasta once it's cooked through and immediately toss a few tablespoons of the dressing with the pasta. This helps the pasta soak in the dressing and the flavor.",
    "Chill the dressed pasta in the fridge.",
    "Meanwhile, combine the (washed and de-stemmed) spinach with the chopped celery in a large bowl. Add in the cranberries and a can of drained mandarine oranges.",
    "If desired peel the apple (We like to leave on the peel!) and then slice into thin slices. Toss with lemon juice and then add to the salad.",
    "Pour dressing over the salad and toss. Add in the completely cooled pasta and toss with the rest of the salad.",
    "If you want to toast the pecans, place them in a single layer in a dry saucepan (don't add anything) over medium heat. Stir constantly until the nuts are barely fragrant -- just a couple of minutes. Watch carefully as the nuts are VERY easily scorched/burned.",
    "Alternatively, you can candy the pecans if desired. Check the link in the last paragraph of the blog text for how to candy pecans. *UPDATE: we've found we like this salad even more with the pecans coarsely chopped- you'll get more in each bite!",
    "Top the salad with the pecans and (if desired) feta cheese.",
    "Enjoy immediately.",
    "Recipe Notes"
  ],
  "ingredients": [
    "0",
    "Print",
    "Autumn Crunch Pasta Salad",
    "Prep Time",
    "20 mins",
    "Total Time",
    "20 mins",
    "Course: Salad",
    "Cuisine: American",
    "Servings: 6 -8 as a side",
    "Author: Chelsea",
    "Report this ad",
    "Ingredients",
    "5 ounces fresh spinach half a 10 ounce bag",
    "1 and 1/2 cups dry small pasta",
    "3/4 cup chopped celery",
    "3/4 cup dried cranberries",
    "1 can (15 ounces) can mandarin oranges",
    "1 large Granny Smith Apple",
    "1 teaspoon lemon juice",
    "1/3 cup pecans, coarsely chopped*",
    "Optional: Feta cheese",
    "Dressing",
    "2 tablespoons apple cider vinegar",
    "2 tablespoons white wine vinegar",
    "2-4 tablespoons white sugar",
    "1/8 teaspoon each: paprika & onion powder",
    "4 tablespoons olive oil or vegetable oil",
    "1/2 tablespoon poppyseeds"
  ],
  "__v": 1
}