{
  "__v": 2,
  "directions": [
    "0",
    "First make the dough. Mix the flour, salt, sugar and baking powder in a large bowl. For the wet ingredient, I happen to have 1/4 cup of duck fat laying around (who doesn’t?), so I mixed that with 1/4 cup of olive oil to make up 1/2 cup of grease in total. Or just use 1/2 cup of vegetable oil as the original recipe. Mix the egg with the fat/oil and water, then pour into the dry mix. Mix with a fork to have them come together first, then take the dough out onto a surface and knead until smooth. I did that for about 2 min. Cover with plastic wrap and set aside for 1 hour (the oil may ooze out of the dough, just knead it back when using).",
    "Now, despite my epic effort, I still only managed to use HALF of those chives… the other half is still laying in my fridge shriveling away… Wash the chives and cut them into very short segments around 1/3″/1cm. Scramble the eggs with 1 tsp of salt + 4 tbsp of olive oil + 1 tsp of white pepper. Try to break them up with a wooden spatula and let the eggs pieces “toast” a bit until it’s lightly browned and fragrant. Mix the ground pork with corn starch, sesame oil, soy sauce, dark soy sauce, salt, bonito stock powder and white pepper. Dice the onion finely then saute in a pan with 3 tbsp of olive oil + 1 tsp of salt and white pepper, until lightly browned. Split the ground pork into 2 portions. Add 1 portion to the onion and brown up the pork nicely as well. Take everything out of the pan and let it cool down. The filling consists of both sauteed pork AND raw pork. Because I want the flavor from the caramelized pork bits as well as the raw pork that’s gonna bind everything together.",
    "When the sauteed pork is cooled down, mix it up with the chives, eggs and raw pork. At this point, I also added 5 tbsp of panko to absorb the juice. But it’s totally optional.",
    "Preheat the oven to 375°F/190°C. Now take a piece of dough about a 2″/5cm ball. Flour the board and rolling pin and roll the dough out into a 1/8″/0.5cm thick sheet. Take 2 tbsp of the filling and place in the center of the sheet. Bring the dough together from the side and pinch it together on the top relatively tight. There WILL be access dough. Snip it off with a kitchen scissor then twist/pinch the top of the bun together again. This is kind of a “buns for dummies” I came up with. Place them evenly on a baking sheet with parchment paper and brush with egg wash on top. Bake for 30 min until golden brown.",
    "I ended up with 16 hot pockets, with some leftover fillings."
  ],
  "firstAdded": "2014-06-19T14:32:15.226000",
  "hash": "3854a4accdde3a4372ba654934becd9a896bebe3",
  "href": "http://www.ladyandpups.com/2012/06/03/asian-hot-pocket-eng/",
  "image": "http://www.ladyandpups.com/wp-content/uploads/2012/05/jiucai-knish-25-1024x670.jpg",
  "ingredients": [
    "0",
    "Pie Dough: adapted from Smitten Kitchen",
    "2 1/2 cups of all-purpose flour",
    "1 large egg",
    "1/2 tsp of salt",
    "1 tsp of sugar",
    "1 tsp of baking powder",
    "1/4 cup of duck fat",
    "1/4 cup of olive oil",
    "1/2 cup of water",
    "Filling: (there may be some leftovers)",
    "300 g of chopped Asian chives",
    "350 g of ground pork",
    "1 tsp of corn starch",
    "1 tsp of sesame oil",
    "2 tsp of soy sauce",
    "1/2 tsp of dark soy sauce",
    "1/4 tsp of salt",
    "1/4 tsp of bonito stock powder (if available)",
    "1/2 tsp of white pepper",
    "6 eggs (1 tsp of salt + 4 tbsp of olive oil + 1 tsp of white pepper)",
    "1 onion (3 tbsp of olive oil + 1 tsp of salt and white pepper)",
    "(optional) 5 tbsp of panko",
    "Egg Wash:",
    "1 egg + 1 tsp of water"
  ],
  "keywords": [
    "pie",
    "dough",
    "adapted",
    "smitten",
    "kitchen",
    "allpurpose",
    "flour",
    "egg",
    "salt",
    "sugar",
    "baking",
    "duck",
    "fat",
    "olive",
    "oil",
    "water",
    "filling",
    "leftovers",
    "asian",
    "chives",
    "pork",
    "corn",
    "starch",
    "sesame",
    "soy",
    "dark",
    "bonito",
    "stock",
    "available",
    "white",
    "pepper",
    "eggs",
    "onion",
    "panko",
    "wash"
  ],
  "title": "Asian hot pocket",
  "users": [
    null
  ]
}