{
  "hash": "567a3c4ae6f6cd600201936e260f1b4e18f2be98",
  "title": "Dark Chocolate Silk Pie",
  "image": "",
  "href": "http://www.veganricha.com/2014/05/dark-chocolate-silk-pie-with-chocolate.html",
  "extension": "Chrome",
  "firstAdded": "2015-06-20T10:56:00.282000",
  "users": [
    null
  ],
  "keywords": [
    "oat",
    "flour",
    "certified",
    "oats",
    "almond",
    "almonds",
    "starch",
    "finer",
    "grind",
    "cornstarch",
    "flax",
    "meal",
    "sugar",
    "salt",
    "cocoa",
    "dark",
    "chocolate",
    "crust",
    "solid",
    "coconut",
    "oil",
    "olive",
    "milk",
    "fat",
    "raw",
    "theo",
    "bar",
    "vegan",
    "semisweet",
    "chips",
    "vanilla"
  ],
  "directions": [
    "0",
    "In a bowl, add all the dry ingredients and whisk. Add in the oils and mix until crumbs.",
    "Add the almond milk and mix into a smooth stiff dough. Roll out the dough between 2 parchment sheets to slightly larger than a 9 inch circle. Place in a greased pie pan and shape and seal edges. Chill for half an hour in the refrigerator. Prick holes. Bake for 16-17 mins at pre-heated 350 degrees F.",
    "1",
    "Add coconut milk, cornstarch, sugar and cocoa powder to pan and whisk to mix the sugar well. Heat at medium heat and bring to simmering boil. The mixture will thicken as it starts to simmer. cook for another minute. total 8 to 9 mins. Take off heat and cool for a minute.",
    "Add the dark chocolate, semi-sweet chocolate, coconut oil, vanilla let sit for a minute.",
    "Whisk until all the chocolate melts and gets smooth. Taste and adjust sweet at this point. Pour the mix into the baked and cooled pie shell. Chill for a few hours or Freeze for 1-2 hours to make it easier to slice. Slice, thaw slightly and serve. Decorate with cashew cream or whipped coconut cream."
  ],
  "ingredients": [
    "0",
    "½ cup oat flour (ground certified gf oats)",
    "¾ cup almond flour (ground almonds, grind with some oats or starch for a finer grind)",
    "1 Tbsp cornstarch",
    "1 Tbsp flax meal",
    "3 Tbsp sugar",
    "⅛ tsp fine sea salt",
    "¼ cup cocoa powder (1 Tbsp more for dark chocolate crust)",
    "1 Tbsp solid coconut oil",
    "1 Tbsp olive oil",
    "1-2 Tbsp almond milk",
    "1",
    "1 15 oz can full fat coconut milk",
    "1.5 Tbsp cornstarch",
    "1 Tbsp cocoa powder",
    "¼ cup ground raw sugar",
    "One 3 oz Theo 70% or 85% dark chocolate bar (2/3 cup or 3 oz chocolate)",
    "3 Tbsp vegan semisweet chocolate chips",
    "1 Tbsp coconut oil",
    "1 tsp vanilla extract"
  ],
  "__v": 1
}