{
  "hash": "323cf8f237298e30fdd935aa451b3db548832e59",
  "title": "Colorado River of Cheese and Macaroni",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2009/11/11/0/DV0509_Colorado-River-of-Cheese-and-Macaroni_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/colorado-river-of-cheese-and-macaroni-recipe.html",
  "firstAdded": "2015-01-24T19:30:27.033000",
  "users": [
    null
  ],
  "keywords": [
    "basic",
    "bechamel",
    "recipe",
    "follows",
    "dry",
    "white",
    "wine",
    "mustard",
    "paprika",
    "salt",
    "pepper",
    "sharp",
    "cheddar",
    "divided",
    "days",
    "longer",
    "aged",
    "cheese",
    "make",
    "oily",
    "asiago",
    "parmesan",
    "elbow",
    "macaroni",
    "butter",
    "room",
    "medium",
    "onion",
    "quarts",
    "milk",
    "iodized",
    "nutmeg",
    "allpurpose",
    "flour"
  ],
  "directions": [
    "0",
    "Bring the Basic Bechamel Sauce to a simmer over low heat. Add the white wine and stir to combine. Stir in the mustard, paprika, and salt and pepper. Gradually add the cheeses, reserving about 1/4 cup of each cheese for the top of the casserole. Stir the sauce thoroughly between each addition of the cheese. Simmer until the cheese is well blended.",
    "Bring a large pot of salted water to a boil over high heat. Add the elbow macaroni and cook to al dente. Drain.",
    "Preheat the oven to 375 degrees F.",
    "In a large casserole dish (or in numerous smaller dishes) add a 1/2-inch of the warm cheese sauce. Fill the casserole with the drained elbow macaroni. Top with another layer of cheese sauce, covering the macaroni completely and sprinkle with the reserved cheese. Bake the macaroni until the top is brown, about 20 to 25 minutes. Cooking time will vary depending on the size of the casserole dish. Remove from the oven and serve hot.",
    "This recipe was provided by professional chefs and has been scaled down from a bulk recipe provided by a restaurant. The FN chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results.",
    "Basic Bechamel Sauce:",
    "In a small saucepan over low heat, add the onion and 1/2 cup of butter and saute until very soft, but do not brown. In another saucepan, scald the milk. Stir the sauteed onions into the milk along with the salt, pepper and nutmeg. Make a blonde roux by mixing the remaining 1/2 cup butter and the flour in a small bowl. Add the roux to the simmering milk and cook until the mixture coats the back of a spoon.*",
    "*Cook's Note: This can be prepared 1 to 2 days in advance and refrigerated",
    "Recipe courtesy Patrick Rhea, owner of Dell Rhea's Chicken Basket in Willowbrook, IL"
  ],
  "ingredients": [
    "0",
    "Basic Bechamel Sauce, recipe follows",
    "2 ounces dry white wine",
    "1 tablespoon ground mustard",
    "1 teaspoon paprika",
    "1/2 to 1 teaspoon salt",
    "1/2 teaspoon white pepper",
    "4 cups (2 pounds) shredded sharp Cheddar, divided (aged no more than 30 days as a longer aged cheese can make your sauce oily)",
    "1 cup (1/2 pound) shredded Asiago, divided",
    "1 cup (1/4 pound) grated Parmesan, divided",
    "8 cups (2 pounds) elbow macaroni",
    "1 cup (2 sticks) butter, room temperature, divided",
    "1/2 (2 ounces) medium onion, finely diced",
    "10 cups (2 1/2 quarts) whole milk",
    "3/4 teaspoon iodized salt",
    "3/4 teaspoon white pepper",
    "1/2 teaspoon grated nutmeg",
    "1/2 cup all-purpose flour"
  ],
  "__v": 1
}