{
  "hash": "12bc61b8f039c6aaf77a375593d28bf2596e4f7e",
  "title": "VEGAN RAW CRUNCH BARS",
  "image": "https://quicheaweek.files.wordpress.com/2013/03/duo41.jpg?w=640&h=351",
  "href": "https://quicheaweek.wordpress.com/2013/03/25/vegan-raw-crunch-bars/",
  "extension": "Chrome",
  "firstAdded": "2016-01-08T16:09:48.707000",
  "users": [
    null
  ],
  "keywords": [
    "almonds",
    "coarsely"
  ],
  "directions": [
    "0",
    "In a medium sized mixing bowl, combine the almonds, cashews, walnuts, hemp, sunflower and pumpkin seeds, and the ground flaxseed. Add 20g of the sesame seeds as well as 20g of the whole flaxseeds. Toss in the cacao nibs and salt. Mix everything together. Pour in the maple syrup and 1 tablespoon of the agave. Mix! Use a chopstick. Works like a dream. A sticky dream.",
    "Get out a square baking pan. Line it with wax paper. Press down the sticky nutty/seedy/sticky stuff. Sprinkle the remaining sesame seeds and flaxseeds on top. Drizzle the final teaspoon of agave on top. Cover with saran wrap and place in your freezer for a few hours or until everything has properly hardened. Remove and cut into 8 equal pieces. Munch on.",
    "About these ads",
    "Share this:",
    "Pinterest794TwitterFacebook14TumblrRedditMore",
    "Related",
    "Maple Crunch Protein and Fiber Bars",
    "In \"recipes\"",
    "Amazing Meal No-Bake Protein Bars",
    "In \"Food Reviews\"",
    "Fruit Tart [Raw + Vegan + Gluten-Free + Blah Blah Blah]",
    "In \"gluten-free\"",
    "Tags: 15% off, agave, almonds, breakfast, brooklyn, cashews, chocolate, coarse salt, coupon, crunch, dairy-free, dessert, diet, easy, egg-free, equinox, exercise, finger food, flaxseed, food, gluten-free, gym, health food, healthy, hemp seeds, high protein, low calorie, low carb, lunch, maple syrup, new york, no-bake, nutrition, nutrition bars, nuts, paleo, promo code, protein, protein bar, pumpkin seeds, raw, raw crunch bars, sesame seeds, skinny, snack, sunflower seeds, sweet, vegan, vegetarian, walnuts, workout",
    "10 comments",
    "Kathy Leveque\t· March 26, 2013 - 7:03 am · Reply→",
    "Hey Molly, thanks for the props :) It’s also nice when someone speaks your language. For your readers, enjoy 15% off your order at http://www.rawcrunchbar.com coupon code MOLLYROCKS if you don’t feel like making them all the time, I know, cause I’ve been hand-making these darn things for over 10 years. Much Love,",
    "Kathy Leveque",
    "mollyEatsSeitan\t· March 26, 2013 - 4:39 pm · Reply→",
    "Thanks so much!! Your bars are honestly ridiculously good. I’ve made my coworkers try them, my roommate, and strangers on the street. Ok not strangers. But soon. I’m pretty sure I have one in my bag at all times…just in case.",
    "Kelsey\t· March 27, 2013 - 9:47 am · Reply→",
    "question! I have no intention of buying agave, the studies I’ve read about it have freaked me out…and I’m not vegan… what would I use to replace that? or could I replace the agave+maple syrup with the original honey and what would that amount be? pleasey!",
    "mollyEatsSeitan\t· March 27, 2013 - 9:55 am · Reply→",
    "I found that maple syrup alone was too thin just, you know, tastes a hell of a lot better than agave. just try replacing the agave with the same amount of honey. I’m sure it’ll work out.",
    "Kelsey\t· March 27, 2013 - 10:14 am ·",
    "Thanks! My mom is coming to visit and she is trying to eat more Raw food… I was thinking this might be a perfect snack for us!",
    "» The Sunday Brunch Buffet 3/31/2013 The Live-In Kitchen\t· March 31, 2013 - 2:03 am · Reply→",
    "[…] excited to try vegan raw crunch bars for a healthy […]",
    "Sesame Crusted Tofu and Green Beans | Quiche-a-Week\t· April 1, 2013 - 9:01 am · Reply→",
    "[…] are a couple things you can do with the leftover sesame and flax seeds from your Vegan Raw Crunch Bars. You can accidentally spill them from time to time, place to place, ensuring you’ll find a […]",
    "Sibel\t· April 4, 2013 - 4:45 pm · Reply→",
    "Hello those seem delicious but I guess it would be crunchier if you put them in the dehydrator for about 8-10 hours ;) I will try both version :)",
    "Rebecca\t· April 17, 2013 - 10:21 am · Reply→",
    "I’m finding items on Amazon that are higher prices for “Prime” and lower prices with shipping costs… Kinda defeats the value of prime membership. Thanks for the great recipes.",
    "#foodfriday: vegan raw crunch bars |\t· June 6, 2014 - 2:31 pm · Reply→",
    "[…] these vegan raw crunch bars are no-bake and a great way to get protein in a natural way– no powders. a healthy snack that you can pack with you on the go? sign us up. find the recipe on quiche-a-week. […]",
    "Leave a Reply",
    "← TabouliSesame Crusted Tofu and Green Beans →",
    "CONTACT ME",
    "You have a question? Weird! I have an email account!",
    "DO YOU LIKE ME MORE THAN A FRIEND?",
    "FOLLOW BLOG VIA EMAIL",
    "Enter your email address to follow this blog and receive notifications of new posts by email.",
    "FOLLOW ME ON TWITTER",
    "SEE ME ON…",
    "BLOGS I FOLLOW",
    "thom:::woodley",
    "Brooklyn Porridge Co.",
    "Keepin' It Kind",
    "Rantings of an Amateur Chef",
    "thelittleloaf",
    "Move Eat Create",
    "allierotenberg.wordpress.com",
    "theBERRY",
    "fiveandspice.com",
    "saucysmile",
    "Baker Bettie",
    "Food Fitness Fresh Air",
    "Chickpeas and Change",
    "Pb & Jess",
    "Cupcake Artist",
    "Vegan Shop-Up",
    "my little happies",
    "Kristens Kreations",
    "Hare Krishna Women",
    "whisk flip stir"
  ],
  "ingredients": [
    "0",
    "1 ounce almonds, coarsely chopped"
  ],
  "__v": 1
}