{
  "hash": "e0058342fef2852a9619f9b65028a8f954e6d222",
  "title": "Apple-Pear Galette",
  "image": "http://cdn-image.realsimple.com/sites/default/files/styles/rs_main_image/public/image/images/0811/apple-pear-galette_300.jpg?itok=je6gdPCa",
  "href": "http://www.realsimple.com/food-recipes/browse-all-recipes/apple-pear-galette",
  "extension": "Chrome",
  "firstAdded": "2015-07-30T22:56:52.289000",
  "users": [
    null
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "surface",
    "refrigerated",
    "piecrusts",
    "apricot",
    "preserves",
    "empire",
    "gala",
    "cortland",
    "apples",
    "bartlett",
    "pears",
    "lemon",
    "juice",
    "ginger",
    "cinnamon",
    "granulated",
    "sugar",
    "egg",
    "beate"
  ],
  "directions": [
    "0",
    "Directions",
    "Heat oven to 350° F. On a lightly floured surface, place one piecrust on top of the other and roll out the stack to form one 16-inch circle. Transfer to a parchment-lined baking sheet. Spread 1/4 cup of the preserves on the crust, leaving a 2-inch border.",
    "In a large bowl, toss the apples, pears, flour, lemon juice, ginger, cinnamon, and 3 tablespoons of the sugar. Transfer to the crust, leaving the border clear. Fold the edges of the crust over the fruit mixture.",
    "Brush the egg on the crust and sprinkle with the remaining teaspoon of sugar. Bake until the crust is golden brown and the fruit is tender, 50 to 60 minutes.",
    "In a small saucepan, heat the remaining 2 tablespoons of preserves and 1 tablespoon water over medium heat until liquid, 2 to 3 minutes. Brush on the fruit. Serve warm or at room temperature.",
    "To Bring It: The galette can be made one day ahead; just cover it tightly with plastic wrap. To prevent it from sliding around on the serving plate, dab some preserves in the center of the plate before placing the galette on top."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 tablespoons all-purpose flour, plus more for the surface 2 9-inch refrigerated piecrusts 1/4 cup plus 2 tablespoons apricot preserves 3 Empire, Gala, or Cortland apples, peeled and sliced 1/4-inch thick 3 Bartlett pears, peeled and sliced 1/4 inch thick 2 tablespoons fresh lemon juice 1 teaspoon grated fresh ginger 1/2 teaspoon ground cinnamon 3 tablespoons plus 1 teaspoon granulated sugar 1 large egg, beate"
  ],
  "__v": 1
}