{
  "hash": "28a2182fa377135d4bf7d391ddce0aae4fa86722",
  "title": "Olive Oil Carrot Bread with Candied Carrots",
  "image": "http://www.brooklynsupper.net/wp-content/uploads/2015/03/olive-oil-carrot-bread04-201x300.jpg",
  "href": "http://www.brooklynsupper.net/2015/03/olive-oil-carrot-bread-with-candied-carrots/",
  "extension": "Chrome",
  "firstAdded": "2015-06-17T21:53:40.290000",
  "users": [
    null
  ],
  "keywords": [
    "candied",
    "carrots",
    "young",
    "look",
    "spray",
    "greens",
    "theyre",
    "necessary",
    "sugar",
    "water",
    "olive",
    "oil",
    "carrot",
    "bread",
    "allpurpose",
    "flour",
    "wheat",
    "pastry",
    "baking",
    "soda",
    "salt",
    "nutmeg",
    "ginger",
    "eggs",
    "lemon",
    "zest",
    "vanilla",
    "extra",
    "virgin"
  ],
  "directions": [
    "0",
    "For the Candied Carrots",
    "If needed, trim all but 1/2-inch of the carrot greens. Peel and halve carrots.",
    "In a wide sauce pan, heat the sugar and water over medium heat. When sugar has dissolved, add the carrots and turn heat down so that mixture bubbles ever so gently. Cook, swirling pan occasionally, for 20 minutes or until thinnest part of carrot is translucent.",
    "For the Olive Oil Carrot Bread",
    "Preheat oven to 350 degrees F. Liberally butter a 9 x 5 inch loaf pan. (Note that my pan was 8 1/2 x 4 1/2-inches; I poured the extra batter into 2 buttered ramekins and baked those for 50 minutes.)",
    "In a small bowl, combine the flours, baking powder and soda, sea salt, and spices.",
    "In a large bowl, or the bowl of a stand mixer fitted with the paddle attachment, beat eggs and sugar on low speed. Add grated carrots, zest, and vanilla. With mixer still on low, fold in half the flour, all of the olive oil, and then the remaining flour. Mix just until everything is well combined.",
    "Spoon into prepared loaf pan, and slide into oven. Set a timer for 40 minutes. Pull bread from oven and carefully lay 3 or 4 candied carrot halves across the top; spoon 2 tablespoons of the syrup over the top. (The idea here is for the carrots to sink into the top ever so slightly.) Slide back into the oven, and bake 20 – 30 minutes more or until a toothpick inserted in the center comes out with just a few crumbs attached.",
    "Cool for 20 minutes, and then flip out onto a platter or rack to cool completely. Slice and serve with a generous smear of salted butter.",
    "This carrot bread is best the day of, but will keep nicely wrapped in foil, at room temperature for a few days."
  ],
  "ingredients": [
    "0",
    "For the Candied Carrots",
    "4 young carrots (I like the look of a little spray of greens, but they’re not necessary)",
    "1 cup sugar",
    "1 cup water",
    "For the Olive Oil Carrot Bread",
    "1 cup all-purpose flour",
    "1 cup whole wheat pastry flour",
    "1 teaspoon baking powder",
    "1/2 teaspoon baking soda",
    "1 teaspoon sea salt",
    "1/2 teaspoon freshly grated nutmeg",
    "1/2 teaspoon ground ginger",
    "3 eggs",
    "1 1/4 cups sugar",
    "2 cups grated carrots",
    "1 tablespoon lemon zest",
    "1 teaspoon vanilla extract",
    "1 cup extra virgin olive oil"
  ],
  "__v": 1
}