{
  "hash": "095a6c3f8234c36b92484450e25e70ddd8b8ba95",
  "title": "Fried Caprese Bombs",
  "image": "http://www.seriouseats.com/recipes/assets_c/2015/05/20150511-Fried-Caprese-Bombs-Open-Morgan-Eisenberg-thumb-625xauto-423041.jpg",
  "href": "http://www.seriouseats.com/recipes/2015/05/fried-caprese-salad-bombs-appetizer-tomato-mozzarella-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-06-10T19:01:09.356000",
  "users": [
    null
  ],
  "keywords": [
    "golf",
    "ballsized",
    "tomatoes",
    "ciliegine",
    "size",
    "mozzarella",
    "balls",
    "paper",
    "towels",
    "allpurpose",
    "flour",
    "breadcrumbs",
    "eggs",
    "milk",
    "canola",
    "oil",
    "frying",
    "balsamic",
    "vinegar",
    "honey",
    "flaky",
    "salt",
    "maldon",
    "sprinkling",
    "bunch",
    "basil",
    "leaves"
  ],
  "directions": [
    "0",
    "1 Using an apple corer or melon baller, gently scoop out the centers of the tomatoes and discard. Push a mozzarella ball into each hollowed tomato, being careful not to rip the tomatoes.",
    "2 Pour the flour in a shallow bowl. Pour the breadcrumbs in another. In a third shallow bowl, beat the eggs with the milk. Dip the tomatoes into the flour and roll to coat, and then dip them into the egg mixture. Roll the tomatoes in the breadcrumbs to coat. Repeat the egg and breadcrumb coatings a second time.",
    "3 In a saucepan over medium-high heat, combine the balsamic vinegar and honey. Bring to a gentle boil, then reduce heat and simmer until the balsamic has reduced by half and easily coats the back of the spoon, about 10 minutes. Remove from heat and set aside.",
    "4 In a high-walled, heavy-bottomed skillet heat 1/2-inch of oil over medium-high heat until it reaches 350°F. Fry the tomatoes in batches, turning, until golden brown all over. Using a slotted spoon, transfer tomatoes to a paper towel-lined plate. Sprinkle with sea salt.",
    "5 Serve the tomatoes while warm with additional mozzarella balls and a basil leaf garnish. Drizzle with the balsamic reduction and serve."
  ],
  "ingredients": [
    "0",
    "16 golf ball-sized tomatoes (see note above)",
    "16 \"ciliegine\" (small 1/2-inch size) fresh mozzarella balls, plus more for serving, drained and dried with paper towels",
    "1/2 cup all-purpose flour",
    "1 cup seasoned breadcrumbs",
    "2 large eggs",
    "2 tablespoons milk",
    "Vegetable or canola oil, for frying",
    "3/4 cup balsamic vinegar",
    "1/4 cup honey",
    "Flaky sea salt, such as Maldon, for sprinkling",
    "1 small bunch basil leaves, for garnish"
  ],
  "__v": 1
}