{
  "hash": "916f142b139ace35a333527be87cc64105cb2f2d",
  "title": "JULSKINKA",
  "image": "",
  "href": "http://www.vardagsmatad.se/2011/12/08/var-godaste-julskinka/",
  "extension": "Chrome",
  "firstAdded": "2015-12-23T13:18:06.465000",
  "users": [
    null
  ],
  "keywords": [
    "vetegluten",
    "sojamjl",
    "gram",
    "tofu",
    "vatten",
    "msk",
    "tomatpur",
    "tsk",
    "grovmalen",
    "svartpeppar",
    "vitlkspulver",
    "lkpulver",
    "rkarom",
    "salt",
    "paprika",
    "grnsaksfond",
    "olja",
    "ljus",
    "sirap",
    "alt",
    "agavenektar",
    "buljong",
    "trning",
    "grnsaksbuljong",
    "tomatjuice",
    "eller",
    "passerade",
    "tomater"
  ],
  "directions": [
    "0",
    "Blanda vetegluten och sojamjöl för sig i en bunke. De övriga ingredienserna placerar du i en mixer eller hushållsmaskin. Mixa ingredienserna tills du får en jämn fin smet, och tofun upplösts helt. Blanda ner de blöta ingredienserna i veteglutenet och rör om hastigt med en gaffel tills allt är väl blandat.",
    "Knåda degen i 5 minuter eller tills den blivit fast och fin och lite gummiaktig. Låt degen sedan vila i 15 minuter. Blanda under tiden ingredienserna till buljongen i en hög kastrull som kan täcka skinkan.",
    "Linda in degen i en silduk – eller annan textil som du kan koka skinka i – och knyt åt sidorna som en stor smällkaramell. Koka upp bjuljongen och sänk försiktigt ned knytet i kastrullen. Låt skinkan sjuda i 2 timmar. Vattnet skall vara så varm att det ångar men inte så att det kokar kraftigt. Du känner att skinkan fått en ordentlig fasthet när den är klar.",
    "Lyft sedan upp skinkan och låt den svalna ordentligt. Nu kan skinkan skivas upp som pålägg, användas i matlagning eller griljeras med söt senap och ströbröd. Tänk på att gluten blir fastare ju längre du tillagar det. Så stek eller ugnsgrilla på hög värme under kortare tid istället för tvärt om. Smaklig måltid!"
  ],
  "ingredients": [
    "0",
    "4 dl\tVetegluten",
    "0,5 dl\tSojamjöl",
    "200 gram\tTofu",
    "2,5 dl\tVatten",
    "2 msk\tTomatpuré",
    "1 tsk\tGrovmalen svartpeppar",
    "1 tsk\tVitlökspulver",
    "1 tsk\tLökpulver",
    "1 tsk\tRökarom",
    "1 tsk\tSalt",
    "1 tsk\tPaprika",
    "1 msk\tGrönsaksfond",
    "1 msk\tOlja",
    "1 msk\tLjus sirap alt. agavenektar",
    "BULJONG:",
    "1 st\tTärning grönsaksbuljong",
    "1 msk\tGrönsaksfond",
    "7 dl\tVatten",
    "1 tsk\tGrovmalen svartpeppar",
    "1 dl\tTomatjuice eller passerade tomater",
    "1/2 tsk\tRökarom"
  ],
  "__v": 1
}