{
  "hash": "97f6cc17ae5630d78a71b6c1d0856aba12e69144",
  "title": "Creamy Corn Pasta With Basil",
  "image": "",
  "href": "https://cooking.nytimes.com/recipes/1018212-creamy-corn-pasta-with-basil?action=click&module=RecipeBox&pgType=recipebox-page&region=all&rank=54",
  "extension": "Chrome",
  "firstAdded": "2017-08-06T06:03:26.176000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "PREPARATION",
    "Bring a large pot of well-salted water to a boil. Cook pasta until 1 minute shy of al dente, according to the package directions. Drain, reserving 1/2 cup of pasta water.",
    "Meanwhile, heat oil in large sauté pan over medium heat; add scallion whites and a pinch of salt and cook until soft, 3 minutes. Add 1/4 cup water and all but 1/4 cup corn; simmer until corn is heated through and almost tender, 3 to 5 minutes. Add 1/4 teaspoon salt and 1/4 teaspoon pepper, transfer to a blender, and purée mixture until smooth, adding a little extra water if needed to get a thick but pourable texture.",
    "Heat the same skillet over high heat. Add butter and let melt. Add reserved 1/4 cup corn and cook until tender, 1 to 2 minutes. (It’s O.K. if the butter browns; that deepens the flavor.) Add the corn purée and cook for 30 seconds to heat and combine the flavors.",
    "Reduce heat to medium. Add pasta and half the reserved pasta cooking water, tossing to coat. Cook for 1 minute, then add a little more of the pasta cooking water if the mixture seems too thick. Stir in 1/4 cup of the scallion greens, the Parmesan, the herbs, the red pepper flakes, 1/4 teaspoon salt and 1/4 teaspoon pepper. Sprinkle with fresh lemon juice to taste. Transfer to warm pasta bowls and garnish with more scallions, herbs, a drizzle of olive oil and black pepper."
  ],
  "ingredients": [
    "0",
    "Fine sea salt",
    "12ounces dry orecchiette or farfalle",
    "1tablespoon olive oil, plus more for drizzling",
    "1bunch scallions (about 8), trimmed and thinly sliced (keep the whites and greens separate)",
    "2large ears corn, shucked and kernels removed (2 cups kernels)",
    "½teaspoon ground black pepper, more for serving",
    "3tablespoons unsalted butter",
    "½cup grated Parmesan cheese, more to taste",
    "⅓cup torn basil or mint, more for garnish",
    "¼teaspoon red pepper flakes, or to taste",
    "Fresh lemon juice, as needed"
  ],
  "__v": 1
}