{
  "hash": "dcacd6b8fc35c8cf86f7461d4ba351dd6538ff6d",
  "title": "Loaded Enchilada Casserole",
  "image": "",
  "href": "http://katu.com/amnw/am-northwest-cooking-recipes/loaded-enchilada-casserole",
  "extension": "Chrome",
  "firstAdded": "2018-01-27T02:20:26.910000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Nacho Sauce: In blender jar, combine water, cashews, nutritional yeast flakes, salt, smoked paprika, granulated onion, cumin, and chipotle pepper (if using). Blend until the sauce is super smooth. Through the top of the blender jar with the motor on low, add the E-Z Gel through the top and blend for about 10 seconds until smooth. Let sit 5 minutes and blend again for another 5 to 10 seconds.",
    "Casserole: Grease the inside of the Crock Pot (or a 9 x 13-inch baking dish if using the oven). Cover the bottom with a thin layer of the enchilada sauce. Layer half of the tortillas, beans, chilies, corn, crumbles or strips, nacho sauce, and enchilada sauce into the dish. Repeat the layers with remaining ingredients, ending with the enchilada and nacho sauces.",
    "Cover and cook on low for 3 to 4 hours or high for 2 to 3 hours, or until hot and bubbly and the tortillas are tender when pierced. If not using a Crock Pot, cover the dish with foil and bake the casserole in a preheated 400°F oven for 40 minutes, remove the foil and bake another 10 minutes, or until hot and bubbly and the tortillas are tender when pierced.",
    "Serve the enchilada casserole hot with any or all of the toppings: scallions, cilantro, black olives, and jalapenos."
  ],
  "ingredients": [
    "0",
    "Nacho Sauce:",
    "2 cups water",
    "1/2 cup raw, unsalted cashews, soaked for several hours",
    "1/3 cup nutritional yeast flakes",
    "1 1/2 teaspoons smoked paprika",
    "1 1/4 teaspoons sea salt",
    "1 teaspoon granulated onion",
    "1 teaspoon ground cumin",
    "1/4 cup E-Z Gel*",
    "1 canned chipotle in adobo (look for gluten-free if necessary), optional",
    "Casserole",
    "10 (6-inch) corn tortillas",
    "1 28-ounce can enchilada sauce (gluten-free if necessary)",
    "3 cups cooked pinto beans (or 2 15-ounce cans, rinsed and drained)",
    "1 27-ounce can whole green roasted chilies, drained and chilies sliced open",
    "1 1/2 cups frozen, thawed corn",
    "1 10-ounce bag Beyond Beef crumbles or Beyond Chicken strips, optional",
    "Toppings:",
    "Sliced scallions, for garnish",
    "Chopped cilantro, for garnish",
    "Sliced black olives, optional for garnish",
    "Pickled jalapeno slices, optional"
  ],
  "__v": 1
}