{
  "hash": "c175206f002ca732ed9ad9df7c0bb8f1a9e5be59",
  "title": "Short Ribs with Tagliatelle",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/short-ribs-with-tagliatelle-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2017-02-07T22:16:17.433000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place the olive oil in a large heavy soup pot over medium heat. Cook the pancetta until golden and crisp, about 4 minutes. Meanwhile, season the short ribs with salt and pepper, and dredge in the flour. Using a slotted spoon, remove the pancetta from the pan and set aside. Add the short ribs to the pan and brown on all sides, about 7 minutes total.",
    "Meanwhile, combine the onion, carrot, parsley and garlic in a food processor and blend until finely minced. Then add the tomatoes and tomato paste and pulse.",
    "Once the short ribs are browned, carefully add the mixture from the food processor to the pot. Return the pancetta to the pot and stir. Add the rosemary, thyme, oregano, bay leaf, beef broth, and wine. Bring the mixture to a boil. Reduce the heat and simmer, covered, for 1 hour and 15 minutes. Remove the lid and simmer for another hour and a half, stirring occasionally. Remove the meat and bones from the pot. Discard the bones. Shred the meat and return it to the pot. Season with 1/2 teaspoon salt and 3/4 teaspoon pepper, or to taste.",
    "Bring a large pot of salted water to a boil over high heat. Add the pasta and cook until tender but still firm to the bite, stirring occasionally, about 8 to 10 minutes for dried pasta and 2 to 3 minutes for fresh. Drain the pasta, reserving 1 cup of the cooking liquid. Add the pasta to the pot and stir to combine. Add the reserved pasta liquid 1/4 cup at a time, if",
    "needed, to moisten the pasta. Transfer to serving bowls, top each bowl with 1 teaspoon of chocolate shavings. Serve immediately.",
    "Recipe courtesy of Giada De Laurentiis"
  ],
  "ingredients": [
    "0",
    "3 tablespoons olive oil",
    "2 ounces chopped pancetta (about 1/2 cup)",
    "2 1/2 pounds short ribs",
    "Salt",
    "Freshly ground black pepper",
    "1/4 cup all-purpose flour",
    "1 medium onion, chopped",
    "1 carrot, chopped",
    "1/2 cup fresh parsley leaves",
    "2 cloves garlic",
    "1 (14-ounce) can tomatoes (whole or diced)",
    "1 tablespoon tomato paste",
    "1 teaspoon chopped fresh rosemary leaves",
    "1 teaspoon dried thyme",
    "1/2 teaspoon dried oregano",
    "1 bay leaf",
    "2 1/2 cups beef broth",
    "3/4 cup red wine",
    "1 pound fresh or dried tagliatelle",
    "4 to 6 teaspoons shaved bittersweet chocolate"
  ],
  "__v": 1
}