{
  "hash": "c88b18457dfcd9d772aebd0ad5d908c2a6d68f80",
  "title": "Smores Fudge Bars",
  "image": "http://cookiesandcups.com/wp-content/uploads/2013/06/smoresfudgebars.jpg",
  "href": "http://cookiesandcups.com/smores-fudge-bars/",
  "firstAdded": "2014-12-21T18:07:20.714000",
  "users": [
    null,
    null
  ],
  "keywords": [
    "graham",
    "cracker",
    "crumbs",
    "butter",
    "granulated",
    "sugar",
    "salt",
    "milk",
    "chocolate",
    "chips",
    "sweetened",
    "condensed",
    "light",
    "corn",
    "syrup",
    "water",
    "egg",
    "whites",
    "cream",
    "tartar",
    "vanilla"
  ],
  "directions": [
    "0",
    "Preheat oven to 350°",
    "Line a 9x9 baking pan with foil. Set aside.",
    "Mix all the ingredients for your crust together and press evenly into pan.",
    "Bake for 10 minutes. Remove from oven and set aside.",
    "Next make your chocolate filling. In a medium sauce pan combine the milk chocolate and sweetened condense milk together over medium-low heat and stir until melted. Pour immediately onto crust.",
    "1",
    "Combine sugar, corn syrup, water and salt in a small saucepan over medium-high heat. Boil together until a candy thermometer reads 240°.",
    "While mixture is boiling beat 2 egg whites and cream of tartar together until soft peaks form.",
    "When syrup is ready, turn mixer onto low and drizzle the syrup along the side of the bowl slowly combining it into the egg whites.",
    "When all the syrup has been added turn mixer up to medium high and beat for 7-8 minutes until thick and glossy. When there is about one minute left add in the vanilla.",
    "Spread about 1½ - 2 cups of the Fluff on top of the chocolate layer.",
    "Turn oven onto broil and place pan under broiler for 1 minute or until the top of the marshmallow layer gets lightly golden.",
    "Cut into squares when ready to serve."
  ],
  "ingredients": [
    "0",
    "2 cups graham cracker crumbs",
    "½ cup butter, melted",
    "¼ cup granulated sugar",
    "½ tsp salt",
    "1",
    "2 cups milk chocolate chips",
    "14 oz sweetened condensed milk",
    "2",
    "¾ cup sugar",
    "½ cup light corn syrup",
    "¼ cup water",
    "¼ tsp salt",
    "2 egg whites",
    "¼ tsp cream of tartar",
    "1½ tsp vanilla extract"
  ],
  "__v": 2
}