{
  "hash": "e0e524d866055dc4e27034a600f79bb4f99dc924",
  "title": "DIY pot noodles",
  "image": "",
  "href": "https://www.rivercottage.net/recipes/diy-pot-noodles",
  "extension": "Chrome",
  "firstAdded": "2019-08-08T14:09:06.766000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Put all the ingredients, except the soy sauce and lime, in a ‘pot’. Pour over boiling water to just cover everything, pressing the ingredients down. Cover and leave for 8–10 minutes, stirring once or twice, then add soy sauce and lime juice to taste, and eat.",
    "Serving suggestions",
    "Variation - curried mushroom pot",
    "This works ‘instantly’ with raw mushrooms and defrosted frozen peas; you can of course add other finely sliced or shredded cooked veg too. Mix ½ teaspoon cornflour with 1 teaspoon curry powder and put into a ‘pot’ with a nest of thin, quick-cook egg noodles, 3–4 finely sliced mushrooms, 1 tablespoon defrosted frozen peas, 1 finely grated small garlic clove and a finely grated 1–2cm piece of ginger, along with about 25g paneer (Indian cheese) if you can get hold of some. Season with salt and pepper. Pour over boiling water to just cover everything, pressing the ingredients down. Cover and leave for 8–10 minutes, stirring once or twice, then eat."
  ],
  "ingredients": [
    "0",
    "1 nest of thin, quick-cook egg noodles",
    "1 teaspoon vegetable bouillon powder, or ¼ veg stock cube",
    "A small pinch of soft brown sugar",
    "1 small carrot, peeled and very thinly sliced or cut into fine julienne",
    "3–4 spring onions, trimmed and finely sliced",
    "6 sugar snap peas, shredded, or a few frozen petits pois",
    "1 leaf of spring greens or green cabbage or a couple of leaves of pak choi, stalk removed, finely shredded",
    "½ teaspoon freshly grated ginger",
    "½ garlic clove, grated",
    "¼ red or green chilli, deseeded and finely chopped (optional)",
    "2 teaspoons soy sauce",
    "Juice of ½ lime"
  ],
  "__v": 1
}