{
  "hash": "43626516457251fc9f64fa80517fd57752103419",
  "title": "NAANBROOD VAN 2 INGREDIËNTEN",
  "image": "https://uitpaulineskeuken.nl/wp-content/uploads/2015/04/zelf-naanbrood-maken-5-710x380.jpg",
  "href": "https://uitpaulineskeuken.nl/2015/04/naanbrood-van-2-ingredienten.html",
  "extension": "Chrome",
  "firstAdded": "2017-06-30T09:48:46.491000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Zo maak je het",
    "Kneed een soepel deeg van het zelfrijzend bakmeel met de yoghurt en het zout. Heb je geen zelfrijzend bakmeel dan kun je ook 400 gr bloem + 11 gr bakpoeder gebruiken. Het deeg is goed als het lekker elastisch en iets plakkerig aanvoelt.",
    "Verdeel het deeg in 8 gelijke stukken.",
    "Rol ieder stuk uit op een met olie ingevet keukenblad. Of leg er een velletje bakpapier onder, zo voorkom je dat het blijft plakken. Rol het lekker plat uit.",
    "Laat in de tussentijd een grillpan goed heet worden. Hoe heter hoe beter.",
    "Maak een kruidenolie door de olijfolie te mengen met een geperst teentje knoflook en de za’atar. Breng het extra op smaak met wat peper en zout.",
    "Leg een lapje deeg in de hete grillpan en bestrijk het platbrood met de kruidenolie. Gebruik hiervoor een kwastje.",
    "Bak het naanbrood in ongeveer 2 tot 3 minuten per kant goudbruin en draai het dan om.",
    "Bestrijk ook de andere kant met de kruidenolie.",
    "Nadat je andere zijde ook een minuut of 2 gegrild hebt, is je naanbrood klaar.",
    "Het is wel het lekkkerste om het naanbrood meteen op te eten. Bijvoorbeeld met zelfgemaakte baba ganoush.",
    "Heb je wat over? Je kunt het heel goed invriezen. Voor gebruiken even toasten in je tosti-ijzer en je broodje is weer heerlijk vers.",
    "3",
    "36"
  ],
  "ingredients": [
    "0",
    "Ingrediënten voor 8 st.",
    "400 gr zelfrijzend bakmeel",
    "300 gr volle yoghurt",
    "7 gr zout",
    "Kruidenolie",
    "100 ml olijfolie",
    "1 teentje knoflook",
    "2 tl za’atar",
    "Peper en zout"
  ],
  "__v": 1
}