{
  "hash": "3c841a64f609e582c0cdde0feae30f5f16a4df21",
  "title": "Goat Cheese Zucchini Quesadillas with Grilled Corn Pico de Gallo",
  "image": "http://del.h-cdn.co/assets/15/27/980x490/landscape-1435764919-weeknight-dinners-quesadilla.jpg",
  "href": "http://www.delish.com/cooking/recipe-ideas/recipes/a42994/goat-cheese-zucchini-quesadillas-grilled-corn-pico-de-gallo/?zoomable",
  "extension": "Chrome",
  "firstAdded": "2016-05-15T23:01:21.010000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "Heat grill pan over high heat. Rub corn with 1 tablespoon olive oil and season with salt and pepper. Grill for 9 minutes, rotating sides every 3 minutes, until kernels are softened and surface is lightly charred on all sides. Remove to plate and let cool.",
    "Place zucchini and squash slices in medium-sized bowl and toss with 2 tablespoons of olive oil and season with salt and pepper. on grill pan, arrange slices in single layer; grill for 2 minutes per side or until softened with light grill marks. Remove to bowl and grill remaining slices; let cool slightly.",
    "Cut corn off cobs into large bowl. Add tomatoes, red onion, cilantro, jalapeno (optional), lime juice, and 1 tablespoon of olive oil. Stir gently to combine; season with salt and pepper.",
    "Arrange 4 tortillas on clean work surface. Place ½ cup grated Monterrey Jack cheese on each and arrange zucchini and squash slices in single layer on top. Crumble about ¼ cup of goat cheese on top of each one. Place remaining tortillas on top of cheese and vegetables and press down lightly.",
    "Heat large nonstick skillet over medium-high heat and grease lightly with remaining 1 tablespoon of olive oil. Place one quesadilla on skillet and cook for 2 minutes, or until golden brown; flip and cook for another 1 to 2 minutes or until the cheeses are melted and both sides are browned.",
    "Continue cooking remaining quesadillas. Cut into quarters and serve with corn pico de gallo."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "2 ears corn, husks removed",
    "5 tbsp. extra-virgin olive oil, divided",
    "kosher salt",
    "Black pepper",
    "1 Small zucchini, thinly sliced (about 1 c.)",
    "1 Small squash, thinly sliced (about 1 c.)",
    "1/2 pt. grape tomatoes, quartered (1 c.)",
    "1/4 small red onion, finely chopped (1/3 c.)",
    "1/4 c. finely chopped cilantro",
    "1/2 Small jalapeño, minced (optional)",
    "Juice of 1/2 lime (2 tbsp.)",
    "8 8-inch whole-wheat flour tortillas",
    "4 oz. goat cheese, crumbled (about 1 c.)",
    "8 oz. Monterey Jack cheese, grated (2 c.)"
  ],
  "__v": 1
}