{
  "hash": "905bb5eae35c38d22f9f9326cc35c64a3c0aed0e",
  "title": "Meyer Lemon Soufflé",
  "image": "",
  "href": "http://www.tastingtable.com/cook/recipes/how-to-make-meyer-lemon-souffle",
  "firstAdded": "2015-02-10T18:40:08.991000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "butter",
    "room",
    "cubed",
    "greasing",
    "ramekins",
    "castor",
    "sugar",
    "dusting",
    "egg",
    "yolks",
    "granulated",
    "cornstarch",
    "milk",
    "vanilla",
    "whites",
    "cream",
    "tartar",
    "kosher",
    "salt",
    "confectioners"
  ],
  "directions": [
    "0",
    "Preheat the oven to 375°. Using a pastry brush, butter four 10-ounce ramekins using an upward brushstroke. Lightly dust each ramekin with castor sugar, shaking out the excess. Place the ramekins in the refrigerator for 5 to 10 minutes so that the butter solidifies.",
    "In a mixing bowl, whisk together the egg yolks and sugar until the yolks have nearly doubled in size and have become thick and yellow. Whisk in the cornstarch, then slowly add half of the warm milk to temper the eggs, whisking constantly to prevent the yolks from curdling.",
    "Return the mixture to a 2-quart saucepan over medium-low heat, whisking constantly until slightly thickened, 5 to 6 minutes. Remove the saucepan from the heat and whisk in the butter, Meyer lemon juice and zest and vanilla. Transfer to a large mixing bowl and press plastic wrap directly onto the surface of the pastry cream and allow it to sit at room temperature for 15 minutes.",
    "In a large mixing bowl or in the bowl of a stand mixer, beat the egg whites, cream of tartar and a pinch of salt together until foamy. Continue to beat while gradually adding 1 tablespoon of sugar until stiff, glossy peaks form.",
    "Stir ⅓ of the egg whites into the Meyer lemon mixture, then fold in the remaining whites until there are no streaks, making sure not to overmix.",
    "Fill the batter to the top of each prepared ramekin and flatten using an offset spatula or butter knife. Using your thumb, wipe around the inside rim to remove any batter and to help the soufflé rise evenly.",
    "Bake the soufflés in the center of the oven on a wire rack set over a rimmed baking sheet for 12 to 14 minutes or until just firm, risen and golden brown on top. Dust the tops with confectioners' sugar and serve immediately. The soufflés will begin to deflate within 5 minutes."
  ],
  "ingredients": [
    "0",
    "3 tablespoons unsalted butter, at room temperature, cubed, plus more for greasing the ramekins",
    "Castor sugar, for dusting the ramekins",
    "2 large egg yolks",
    "3 tablespoons granulated sugar",
    "1½ tablespoons cornstarch",
    "⅓ cup warm milk",
    "1½ teaspoons vanilla extract",
    "5 large egg whites, at room temperature",
    "½ teaspoon cream of tartar",
    "Pinch kosher salt",
    "1 tablespoon granulated sugar",
    "Confectioners' sugar, for dusting"
  ],
  "__v": 1
}