{
  "hash": "319ad7b067c3f4043d9e331ade7fc3228dfe69e7",
  "title": "Classic Cream Puffs",
  "image": "http://i2.wp.com/bakerbettie.com/wp-content/uploads/2014/01/cream-puffs1.jpg?w=205",
  "href": "http://bakerbettie.com/classic-cream-puffs/",
  "extension": "Chrome",
  "firstAdded": "2016-02-13T02:13:12.838000",
  "users": [
    null
  ],
  "keywords": [
    "water",
    "unsalted",
    "butter",
    "pieces",
    "kosher",
    "salt",
    "granulated",
    "sugar",
    "allpurpose",
    "flour",
    "eggs",
    "cream",
    "cold",
    "vanilla"
  ],
  "directions": [
    "0",
    "Place water, butter, sugar, and salt in a sauce pot over medium high heat. Stir until butter is melted and everything comes to a boil.",
    "Reduce heat to medium. Add flour into the mixture all at once while stirring quickly. Continue to stir and cook off the moisture in the dough until it pulls away from the sides and starts to form into a ball. This should take about a minute.",
    "Place dough into the bowl of a stand mixer fitted with a paddle attachment or a large bowl if using a hand mixer. Allow to cool for about 5 minutes.",
    "With the mixer on medium-low speed, add eggs in one at a time. Do not add another egg until the one before has been completely absorbed into the batter. The batter will look smooth and glossy when ready. (Alternatively, you can mix in the eggs by hand. This just takes a bit longer. Mix each egg until completely absorbed before adding the next).",
    "Place batter in a pastry bag fitted with a large round tip or a zip top bag with the tip cut off.",
    "Preheat oven to 425F. Line baking sheets with parchment or silpat.",
    "Hold the pastry bag over the baking sheet and squeeze over one area until you have about a 2 inch round. Release the pressure from the bag and pull up to release the dough mound. You will have a little peak on the each that can be smoothed out with a wet fingertip. Keep the mounds about 2 inches apart. (about 9 per baking sheet)",
    "Place the baking sheet in the oven and turn to heat up to 450F. Bake for 10 minutes (without opening the oven) then drop the heat down to 350F and bake for 13-15 more minutes until the shells are crispy on the outside and set.",
    "Fill cooled pastries with creme chantilly (recipe follows) and dust with powdered sugar.",
    "1",
    "Whip cream by hand, in stand mixer with whisk attachment, or with a hand mixer until just starting to thicken.",
    "Add sugar and vanilla and continue whipping until soft to medium peaks form.",
    "Fill a pastry bag with the cream, and pipe into the bottom of the puffs until filled."
  ],
  "ingredients": [
    "0",
    "1 cup water (8 fl oz, 240 ml)",
    "1 stick unsalted butter, cut into pieces (1/2 cup, 4 oz, 113 grams)",
    "large pinch kosher salt",
    "2 TBSP granulated sugar (0.8 oz, 24 grams)",
    "1 cup all-purpose flour (4.5 oz, 127 grams)",
    "4 large eggs",
    "1",
    "1½ cups heavy cream, cold",
    "3 TBSP powdered sugar",
    "1 tsp vanilla"
  ],
  "__v": 1
}