{
  "__v": 1,
  "directions": [
    "0",
    "Make the gnocchi:\nScrub and dry the sweet potatoes, then prick them all over with a fork. Place the sweet potatoes on a plate and microwave them on \"high\" until they're fork-tender, about 5 minutes per side. Remove the sweet potatoes from the microwave, cut them in half, and then scoop the flesh into a medium bowl. Using a fork, thoroughly mash the sweet potatoes, or alternately, pass the sweet potato flesh through a ricer.",
    "Transfer 3 cups of the mashed sweet potatoes to a large bowl. Add the strained ricotta, stirring until thoroughly combined. Stir in the Parmesan cheese and salt, and then start adding the flour, 1/2 cup at a time, until a soft dough forms. (See Kelly's Notes.) Shape the dough into a large ball.",
    "Lightly flour a baking sheet and set it aside. Lightly flour your work surface and divide the dough into six equal portions. Take one portion and roll it on your work surface or between your hands until it's about 20 inches in length. Cut the dough into 20 pieces to form each gnocchi then transfer them to the floured baking sheet. Repeat the rolling and cutting process with the remaining five pieces of dough.",
    "Using the back of a fork, press each gnocchi into the tines to form indentations.",
    "Prior to cooking the gnocchi, make the brown butter sauce (recipe follows).",
    "When you're ready to cook the gnocchi, bring a large pot of salted water to a boil. Add a portion of the gnocchi to the boiling water, stir, and then let the gnocchi cook until they float back up to the top, about 1 minute.",
    "Remove the gnocchi with a slotted spoon to a serving bowl. Repeat the cooking process with the remaining gnocchi.",
    "Toss the warm gnocchi with the prepared brown butter sauce. Garnish with Parmesan cheese and serve.",
    "Make the brown butter:\nMelt the butter in a medium saucepan over medium heat, stirring occasionally. Cook the butter until the foam subsides and it begins to turn a golden brown color, about 3 minutes. Turn off the heat and add the sage leaves, allowing them to cook for 1 minute.",
    "Remove the brown butter from the heat and stir in the balsamic vinegar, salt and pepper. Serve immediately with the sweet potato gnocchi.",
    "Kelly's Notes:\nSweet potatoes will vary in how much moisture they contain, but it's important to not add too much flour or your gnocchi will be dense. The goal is to add the least amount of flour while still making a cohesive, pliable dough. You should end up using roughly 2 cups of flour to reach this point."
  ],
  "firstAdded": "2014-10-20T07:39:43.220000",
  "hash": "6039fe6243af2809c2ca0e57e0ba1ce041494145",
  "href": "http://www.justataste.com/2013/12/sweet-potato-gnocchi-with-balsamic-brown-butter-recipe/",
  "image": "http://www.justataste.com/wp-content/uploads/2013/12/sweet-potato-gnocchi-balsamic-sage-brown-butter-recipe-175x265.jpg",
  "ingredients": [
    "0",
    "For the gnocchi:",
    "2 (1-pound) red-skinned sweet potatoes",
    "1 (12-oz.) container fresh ricotta, strained in a sieve for 2 hours",
    "1 cup grated Parmesan cheese",
    "2 teaspoons salt",
    "2 1/2 cups (or more) all-purpose flour",
    "1",
    "For the gnocchi:",
    "2 (1-pound) red-skinned sweet potatoes",
    "1 (12-oz.) container fresh ricotta, strained in a sieve for 2 hours",
    "1 cup grated Parmesan cheese",
    "2 teaspoons salt",
    "2 1/2 cups (or more) all-purpose flour"
  ],
  "keywords": [
    "gnocchi",
    "redskinned",
    "potatoes",
    "container",
    "ricotta",
    "strained",
    "sieve",
    "hours",
    "parmesan",
    "cheese",
    "salt",
    "allpurpose",
    "flour"
  ],
  "title": "Sweet Potato Gnocchi with Balsamic Brown Butter",
  "users": [
    null
  ]
}