{
  "hash": "488cd952f2a80d89c7e9700db46fcfe283b964bd",
  "title": "Roasted Vegetable Lentil Salad\nACTIVE TIME\n25m\nTOTAL TIME\n40m\n6-8 servings",
  "image": "http://target.scene7.com/is/image/Target/c_RC_2224_rt_Roasted-Vegetable-Lentil-Salad_RT?hei=340",
  "href": "http://www.cooking.com/recipes-and-more/recipes/roasted-vegetable-lentil-salad-recipe",
  "firstAdded": "2015-02-09T21:42:16.178000",
  "users": [
    null
  ],
  "keywords": [
    "green",
    "beluga",
    "lentils",
    "picked",
    "rinsed",
    "stock",
    "cooking",
    "instructions",
    "salt",
    "baby",
    "fingerling",
    "potatoes",
    "washed",
    "pieces",
    "olive",
    "oil",
    "divided",
    "brussels",
    "cleaned",
    "larger",
    "lengthwise",
    "smaller",
    "sprouts",
    "onion",
    "red",
    "wine",
    "vinegar",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "Preheat oven to 425 degrees F.",
    "Cook lentils per package directions, substituting vegetable stock for water and adding salt to taste after 15 to 20 minutes of cooking (you will need approximately 2 cups of stock).",
    "In a medium bowl, toss potatoes with 1 teaspoon oil and season with a good sprinkling of salt. Place on parchment-lined baking pan. Add Brussels sprouts to bowl and toss with another teaspoon of oil and season with salt. Roast vegetables for 20 to 25 minutes, until tender.",
    "While vegetables are roasting, caramelize onion in sauté pan with remaining 3 to 4 teaspoons oil, stirring occasionally to prevent burning, about 20 to 25 minutes, and seasoning with salt to taste.",
    "In a large bowl, combine lentils, roasted vegetables and caramelized onions and toss with vinegar. Taste and add additional salt and/or vinegar and pepper if desired. Serve warm or cold.",
    "Tip: Make extra caramelized onions and keep refrigerated to add to other dishes including sandwiches, salads and omelets."
  ],
  "ingredients": [
    "0",
    "1/2 pound of green or beluga lentils, picked over and rinsed",
    "Vegetable stock for cooking lentils (see instructions)",
    "Salt to taste",
    "1/2 pound baby or fingerling potatoes, washed and cut into bite-sized pieces",
    "1 to 2 tablespoons olive oil, divided",
    "1/2 pound Brussels sprouts, cleaned, larger sprouts quartered lengthwise, smaller sprouts halved",
    "1/2 large onion, sliced",
    "3 to 4 tablespoons red wine vinegar",
    "Freshly ground black pepper to taste (optional)"
  ],
  "__v": 1
}