{
  "hash": "37e3a5b350f423989162d1b9c0e24c8a852dd83b",
  "title": "Oven Baked Chicken Taquitos",
  "image": "http://cherishedbliss.com/wp-content/uploads/2014/03/Oven-Baked-Chicken-Taquitos-1.jpg",
  "href": "http://cherishedbliss.com/oven-baked-chicken-taquitos/",
  "firstAdded": "2015-02-08T20:52:30.240000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "breast",
    "broth",
    "salt",
    "pepper",
    "cream",
    "cheese",
    "softened",
    "onions",
    "green",
    "cilantro",
    "garlic",
    "gloves",
    "jalapeno",
    "roma",
    "tomatoes",
    "chili",
    "cumin",
    "kosher",
    "oregano",
    "corn",
    "tortillas",
    "olive",
    "oil",
    "brushing",
    "taquitos",
    "baking"
  ],
  "directions": [
    "0",
    "First cook the chicken breast in a large stock pot or in a crock pot.",
    "If cooking chicken on the stove top, use 2-4 cups of broth.",
    "If using a crock pot use about a cup of broth.",
    "Cover and simmer chicken until falling apart tender.",
    "If cooking in the crock pot cook on high for 3 -4 hours.",
    "Shred chicken once chicken has cooled. If using a stand mixer you do not need to shred the chicken before mixing.",
    "Preheat oven to 425 degrees.",
    "Next in a large mixing bowl, add chicken breast, softened cream cheese, green onions, cilantro, garlic, jalapeno, tomatoes, and all seasonings. Mix everything together until combined well.",
    "Next, line a baking sheet with foil.",
    "Then wrap 5 corn tortillas in parchment paper, at a time, and heat in the microwave on high for about 30 seconds, or until soft and flexible. Now add about 2 TBSP of chicken filling and spread it in the middle of a tortilla.Tightly wrap the tortilla and place seam side down. Repeat this process until all the chicken filling has been used.",
    "Once all the tortillas are made, spray the tortillas with vegetable or olive oil. I use a Misto Sprayer for this step. You may also brush on the oil as well.",
    "Cook for 25-30 minutes @ 425 degrees.",
    "Serve oven baked chicken taquitos with a your favorite hot sauce, green sauce, sour cream, and/or avocado salad."
  ],
  "ingredients": [
    "0",
    "4 chicken breast",
    "4 cups of vegetable or chicken broth",
    "salt and pepper, to taste",
    "8 oz cream cheese, softened",
    "4-6 green onions (no more than ½ cup), finely chopped (including the green part)",
    "2 TBSP cilantro, finely chopped",
    "3 garlic gloves, minced",
    "1 small jalapeno, finely chopped",
    "2 roma tomatoes, finely chopped",
    "1 tsp chili powder",
    "½ tsp cumin",
    "½ tsp pepper",
    "½ tsp kosher salt",
    "1 tsp oregano",
    "30 corn tortillas",
    "olive or vegetable oil, for brushing the taquitos before baking"
  ],
  "__v": 1
}