{
  "hash": "4df9f6c6c1e77d36b2e9580fbedb0ff99c7f2997",
  "title": "MICROWAVE SPAGHETTI SQUASH WITH TOMATOES & BASIL",
  "image": "//steamykitchen.com/wp-content/uploads/2011/11/spaghetti-squash-recipe-5802.jpg",
  "href": "http://steamykitchen.com/19385-microwave-spaghetti-squash-with-tomatoes-and-basil.html",
  "extension": "Chrome",
  "firstAdded": "2015-09-03T23:08:07.470000",
  "users": [
    null
  ],
  "keywords": [
    "spaghetti",
    "squash",
    "olive",
    "oil",
    "garlic",
    "tomatoes",
    "basil",
    "leaves",
    "salt",
    "pepper",
    "balsamic",
    "vinegar",
    "pecorino",
    "parmesan",
    "cheese"
  ],
  "directions": [
    "0",
    "Using a sharp paring knife, carefully pierce (I really mean stab) the spaghetti squash in a few places (about 6 slashes is good). Microwave on high for 10-12 minutes, turning/rotating the squash halfway during cooking. A fork should very easily pierce through the squash, if there is resistance - microwave for an additional 1-2 minutes.",
    "Let squash cool for a few minutes before handling. Carefully (the squash will be steaming hot!), use a chef's knife to cut the squash in half, lengthwise. The squash should be soft and easy to cut. Remove and discard the seeds. Use two forks to scrape apart the strands of the squash. Compost or discard the skin.",
    "Heat a large saute pan over medium heat with the olive oil. Add in the garlic and cook for 1 minute. Add in the tomatoes and basil and cook for 2 minutes. Turn heat to medium-high and add in the spaghetti squash and toss. Season with salt and pepper and drizzle in the balsamic vinegar. Taste the squash - adjust seasoning and if the squash still needs a bit more time to cook through, cover and cook for 2 minutes. If the squash texture is perfect, toss in the grated cheese and serve immediately."
  ],
  "ingredients": [
    "0",
    "1 spaghetti squash",
    "1 tablespoon olive oil",
    "4 cloves garlic, minced",
    "2 tomatoes, chopped",
    "few basil leaves, chopped",
    "salt and pepper",
    "1 teaspoon balsamic vinegar",
    "1/4 cup grated pecorino or parmesan cheese"
  ],
  "__v": 1
}