{
  "hash": "5a84d43d3cb9be4589ab4d87d38f725d5ee4085f",
  "title": "Balsamic Grilled Vegetables",
  "image": "http://passets-cdn.pinterest.com/images/follow-on-pinterest-button.png",
  "href": "http://www.familyfreshcooking.com/2011/06/13/balsamic-grilled-vegetables-get-grillin-recipe/",
  "extension": "Chrome",
  "firstAdded": "2015-04-24T20:30:59.041000",
  "users": [
    null
  ],
  "keywords": [
    "portobello",
    "mushrooms",
    "cleaned",
    "pieces",
    "green",
    "beans",
    "trim",
    "ends",
    "cherry",
    "tomatoes",
    "red",
    "onion",
    "bite",
    "sized",
    "chunky",
    "garlic",
    "skins",
    "splashes",
    "olive",
    "oil",
    "balsamic",
    "vinegar",
    "salt",
    "smoked",
    "paprika",
    "black",
    "pepper",
    "herbs",
    "favorite",
    "cheese"
  ],
  "directions": [
    "0",
    "Pre heat your grill (I use a gas grill) to medium high heat. Toss all your chopped vegetables in a large bowl with enough oil and balsamic for an even thin coating. Put them in your grill basket. Grill with the lid closed for about 15-20 minutes until the veggies are slightly charred and cooked to your liking. Toss every few minutes to ensure that they are not burning and they cook on all sides.",
    "Grilled vegetables are more a cooking method than anything that would require precise measurements. Feel free to experiment will all kinds of veggies. Just be sure to watch closely, denser ones will take longer to cook. If you find certain ones are quick grillers, then prepare your selections in batches.",
    "Chop vegetables so they are relatively similar sizes.",
    "Experiment with seasonings and sauces for different flavor combinations.",
    "Use whatever you have on hand. Zucchini, asparagus, bell pepper, squash, etc. would be great too."
  ],
  "ingredients": [
    "0",
    "2 Portobello Mushrooms, cleaned and chopped into 1 inch pieces",
    "12 ounces Green Beans, trim ends and cut in half",
    "8 ounces Cherry Tomatoes",
    "1 Red Onion, cut into bite sized chunky pieces",
    "a handful of Garlic Cloves, skins removed",
    "a few splashes of Olive Oil",
    "a few splashes of Balsamic Vinegar",
    "Garlic Salt to taste",
    "Smoked Paprika to taste",
    "Black Pepper to taste",
    "Fresh Herbs",
    "Your favorite cheese"
  ],
  "__v": 1
}