{
  "hash": "b0724869fb6449bfa692d2a1515c990b9cff083c",
  "title": "Nutella Stuffed Skillet Cookie",
  "image": "https://www.washingtonpost.com/rf/image_982w/2010-2019/WashingtonPost/2017/11/27/Others/Images/2017-11-15/washopostfoodlab22.JPG",
  "href": "https://www.washingtonpost.com/recipes/nutella-stuffed-skillet-cookie/16123/?tid=a_inl&utm_term=.0ac0aaef5f76",
  "extension": "Firefox",
  "firstAdded": "2017-12-23T18:31:28.652000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 300 degrees. Have a 10-inch cast-iron skillet at hand. (This can be baked in a 12-inch skillet; check doneness after 25 minutes.)",
    "Combine the butter and sugars in the bowl of a stand mixer or handheld electric mixer; beat on medium speed for about 5 minutes, until light and fluffy. Add the vanilla extract. Reduce the speed to medium-low; add the eggs one at a time, beating until fully incorporated. Stop to scrape down the bowl.",
    "Add the flour, baking soda and salt. Beat on medium-low speed to form a firm dough, then add the chocolate chips and beat on low speed just until evenly distributed.",
    "Press half the cookie dough into the bottom of the skillet. Spread the Nutella evenly over that dough, leaving a 1/2 inch margin around the edge. (This is easy to do with an offset spatula.) Top with the remaining cookie dough, making sure to cover the Nutella completely at the edges -- sealing them, if you can.",
    "Bake (middle rack) for 25 to 35 minutes; or until the edges are golden brown, and the top looks slightly under-baked, yet it should be fairly firm to the touch. Transfer to a wire rack to cool; the residual heat from the pan should continue to cook the cookie for a bit. Let sit for at least 10 minutes before serving."
  ],
  "ingredients": [
    "0",
    "16 tablespoons (2 sticks) unsalted butter, cut into cubes, at room temperature",
    "1 cup packed light brown sugar",
    "1 cup granulated sugar",
    "2 1/2 teaspoons vanilla extract",
    "2 large eggs",
    "2 1/4 cups flour",
    "1/2 teaspoon baking soda",
    "1/4 teaspoon salt",
    "2 cups semisweet chocolate chips",
    "1/2 cup Nutella or other chocolate-hazelnut spread (see headnote)"
  ],
  "__v": 1
}