{
  "hash": "32c6fd1bd0403544d723d77c0892b0811e9763e4",
  "title": "Curried Squash and Pear Soup",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2005/10/curried-squash-pear-soup-vertical-a-1800.jpg",
  "href": "https://www.simplyrecipes.com/recipes/curried_squash_and_pear_soup/",
  "extension": "",
  "firstAdded": "2018-01-28T01:12:02.198000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Sauté the butternut squash: Heat 2 Tbsp olive oil and 1 teaspoon butter in a large, thick-bottomed pot on high heat. Add half of the cubed butternut squash. Toss to coat with the oil. Let cook until lightly browned on several sides.",
    "Remove with a slotted spoon to a bowl. Repeat with the remaining butternut squash. Remove to a bowl.",
    "2 Cook the onions and spices: Add 1 tablespoon of olive oil to the pot. Add the chopped onion. Lower the heat to medium and cook for a few minutes to soften.",
    "Then add the curry powder, ground ginger, and nutmeg. Cook for a few minutes more.",
    "3 Add the chopped pear, and toss to coat. Cook for a minute more.",
    "4 Add water, stock, pear nectar, salt, pepper, then simmer: Add the browned butternut squash to the onion pear mixture. Add the water, stock, pear nectar, salt, and pepper. Bring to a boil on high heat; partially cover, reduce heat, and simmer 30 minutes.",
    "5 Purée: Purée using a stick blender or if using a standing blender, purée a third of the soup at a time.",
    "If the soup is too thick for you, add a little water to thin it. If it is too thin for you, bring it to a boil and let it boil down a bit.",
    "6 Add cream: Turn off heat. Stir in 1/4 cup of cream.",
    "Ladle soup into bowls, and garnish with pear slices."
  ],
  "ingredients": [
    "0",
    "6 cups cubed butternut squash (about 1 1/2 pounds)",
    "3 Tbsp olive oil",
    "1 teaspoon butter",
    "1 medium onion, chopped (about 1 1/2 cups)",
    "2 1/2 teaspoons yellow curry powder",
    "1/2 teaspoon ground ginger",
    "Pinch of nutmeg",
    "2 cups peeled, chopped Bartlett pear (about 1 pound, 3 pears)",
    "1 1/2 cups water",
    "1 cup pear nectar",
    "4 cups chicken or vegetable stock (use veg stock for vegetarian option)",
    "1/2 teaspoon salt",
    "1/8 teaspoon black pepper",
    "1/4 cup heavy whipping cream",
    "1 small Bartlett pear, cored and thinly sliced"
  ],
  "__v": 1
}