{
  "hash": "38810748f2fcbc6097402fd06922a3e25422fec3",
  "title": "Instant Pot Spaghetti Squash with Marinara",
  "image": "//food.fnr.sndimg.com/content/dam/images/food/fullset/2019/1/07/0/FNK_Instant-Pot-Spaghetti-Squash_s4x3.jpg.rend.hgtvcom.826.620.suffix/1546894450492.jpeg",
  "href": "https://www.foodnetwork.com/recipes/food-network-kitchen/instant-pot-spaghetti-squash-with-marinara-5500659",
  "extension": "Firefox",
  "firstAdded": "2020-04-03T16:22:39.128000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Add 1 cup water to a 6-quart Instant Pot®, then put the rack in the bottom with the handles going up the sides. Deeply pierce the squash all over 12 to 16 times with a fork, then place on the rack (if needed, trim the stem so the squash fits comfortably in the pot, but be careful not to cut into the squash itself).",
    "Follow the manufacturer's guide for locking the lid and preparing to cook. Set to pressure cook on high for 12 minutes (see Cook's Note).",
    "Meanwhile, add the canned tomatoes to a medium bowl and use your hands to lightly crush the tomatoes. Set aside.",
    "After the pressure-cook cycle is complete, follow the manufacturer's guide for quick release and wait until the quick-release cycle is complete. Being careful of any remaining steam, unlock and remove the lid. Use 2 kitchen towels to remove the rack and squash to a cutting board. Carefully pour the water out of the pot. Allow the squash to cool slightly while you prepare the marinara sauce.",
    "Set the pot to high saute and allow it to heat up for 2 minutes. Add 2 tablespoons of the oil, then add the onions and a large pinch of salt. Cook, stirring occasionally, until the onions are softened and starting to brown lightly, 6 to 8 minutes. Add the garlic and a pinch of red pepper flakes and cook, stirring frequently, until the garlic is softened, 2 to 3 minutes. Stir in the reserved tomatoes and a large pinch of salt and bring to a strong simmer; cook, stirring occasionally, until the sauce is reduced slightly and thickened, about 10 minutes. Season with additional salt and red pepper flakes if needed.",
    "While the sauce is reducing, remove the squash from the rack and split it in half lengthwise. Use a spoon to remove the seeds, then use a fork to scrape the strands of squash from the inside of the skin.",
    "Transfer the squash to a large platter and stir in the remaining 2 tablespoons oil, 1 teaspoon salt and red pepper flakes to taste. Season with more salt if needed, then top with the hot marinara sauce. Sprinkle with the Parmesan and basil."
  ],
  "ingredients": [
    "0",
    "1 small spaghetti squash (about 3 pounds)",
    "One 28-ounce can whole tomatoes",
    "1/4 cup extra-virgin olive oil",
    "1 medium yellow onion, finely chopped",
    "Kosher salt",
    "3 cloves garlic, finely minced",
    "Crushed red pepper flakes, as needed",
    "1/4 cup grated Parmesan",
    "Torn fresh basil leaves, for garnish"
  ],
  "__v": 1
}