{
  "hash": "a5236431b6e3ae9152988c04d881a0ef19fe43f8",
  "title": "Easy Vegan Fried Rice",
  "image": "https://minimalistbaker.com/wp-content/uploads/2015/08/AMAZING-HEALTHY-Vegan-Fried-Rice-with-Crispy-Tofu-vegan-glutenfree-recipe-chinese-friedrice-plantbased-minimalistbaker.jpg",
  "href": "https://minimalistbaker.com/easy-vegan-fried-rice/",
  "extension": "",
  "firstAdded": "2018-02-07T02:46:03.351000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400 degrees F (204 C) and line a baking sheet with parchment paper (or lightly grease with non-stick spray).",
    "In the meantime wrap tofu in a clean, absorbent towel and set something heavy on top (such as a cast iron skillet) to press out the liquid.",
    "Once the oven is preheated, dice tofu into 1/4-inch cubes and arrange on baking sheet. Bake for 26-30 minutes. You’re looking for golden brown edges and a texture that’s firm to the touch. The longer it bakes, the firmer and crispier it will become, so if you’re looking for softer tofu remove from the oven around the 26-28 minute mark. I prefer crispy tofu, so I bake mine the full 30 minutes. Set aside.",
    "While the tofu bakes prepare your rice by bringing 12 cups of water to a boil in a large pot. Once boiling, add rinsed rice and stir. Boil on high uncovered for 30 minutes, then strain for 10 seconds and return to pot removed from the heat. Cover with a lid and let steam for 10 minutes*.",
    "While rice and tofu are cooking, prepare sauce by adding all ingredients to a medium-size mixing bowl and whisking to combine. Taste and adjust flavor as needed, adding more tamari or soy for saltiness, peanut butter for creaminess, brown sugar for sweetness, or chili garlic sauce for heat.",
    "Once the tofu is done baking, add directly to the sauce and marinate for 5 minutes, stirring occasionally.",
    "Heat a large metal or cast iron skillet over medium heat. Once hot, use a slotted spoon to scoop the tofu into the pan leaving most of the sauce behind. Cook for 3-4 minutes, stirring occasionally, until deep golden brown on all sides (see photo). Lower heat if browning too quickly. Remove from pan and set aside.",
    "To the still hot pan add garlic, green onion, peas and carrots. Sauté for 3-4 minutes, stirring occasionally, and season with 1 Tbsp (15 ml) tamari or soy sauce.",
    "Add cooked rice, tofu, and remaining sauce and stir. Cook over medium-high heat for 3-4 minutes, stirring frequently.",
    "Serve immediately with extra chili garlic sauce or sriracha for heat (optional). Crushed salted, roasted peanuts or cashews make a lovely additional garnish. Leftovers keep well in the refrigerator for 3-4 days, though best when fresh. Reheat in a skillet over medium heat or in the microwave."
  ],
  "ingredients": [
    "0",
    "1 cup (~250 g | 8 ounces) extra-firm tofu*",
    "1 cup (185 g) long- or short-grain brown rice*, rinsed thoroughly in a fine mesh strainer",
    "4 cloves (12 g) garlic, minced",
    "1 cup (100 g) chopped green onion",
    "1/2 cup (72 g) peas",
    "1/2 cup (64 g) carrots, finely diced",
    "1",
    "3 Tbsp (45 ml) tamari or soy sauce, plus more for veggies + to taste",
    "1 Tbsp (16 g) peanut butter",
    "2 -3 Tbsp (27-41 g) organic brown sugar, muscovado sugar, or maple syrup",
    "1 clove (3 g) garlic, minced",
    "1-2 tsp chili garlic sauce (more or less depending on preferred spice)",
    "optional: 1 tsp toasted sesame oil (or sub peanut or grape seed oil)"
  ],
  "__v": 1
}