{
  "hash": "024c9fd84993b552fe815e1c3e7a81b9279df7ff",
  "title": "Grilled Steak Salad With Fish Sauce Vinaigrette",
  "image": "https://images.food52.com/kPHa7EBIOrIDR3TrfcdNt90qwi8=/753x502/aadc8d19-28ec-47ee-b902-67018c50f1c4--2018-0523_grilled-steak-salad-with-herby-fish-sauce-vinaigrette_3x2_ty-mecham_011.jpg",
  "href": "https://food52.com/recipes/76965-grilled-steak-salad-with-fish-sauce-vinaigrette",
  "extension": "Chrome",
  "firstAdded": "2018-08-07T16:46:07.740000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To make the vinaigrette: Combine all ingredients in a jar with a tight fitting lid. Shake until the sugar is dissolved. Add another tablespoon of water if it’s too salty/strong. Adjust seasoning and acidity, to taste. Tip: keep the vinaigrette at room temperature so it doesn’t cool down the steaks when used as a post-grill marinade.",
    "Pat the steak dry with paper towels, and season both sides evenly with kosher salt, freshly ground black pepper, and brown sugar. Refrigerate while getting the grill ready.",
    "Heat the grill to medium-high heat and brush your grates clean.",
    "In a bowl, toss the sugar snap peas with 1 tablespoon vegetable oil and season with salt and black pepper to taste. Place a grill tray or mat on the grill grate (to prevent peas from falling through); add peas and arrange in a single layer. Cook 2 to 3 minutes per side, or until tender and charred and still bright green. Transfer to a bowl; set aside.",
    "Lightly brush the steak on both sides with vegetable oil. Grill the steak to your desired doneness, 3 to 5 minutes per side (for medium-rare, the internal temperature should reach 130 degrees F). Transfer the steak to a pan or casserole, and pour one-half of the vinaigrette over the steak. Let marinate for about 10 minutes, turning the steak a few times. Transfer to a cutting board, and thinly slice across the grain. Don’t discard the vinaigrette/marinade! Pour it into a small bowl or serving vessel for passing at the table.",
    "Meanwhile, toss the grilled sugar snap peas with the sliced radishes. Add vinaigrette to taste, tossing several times to coat. Taste; season with a pinch or two of kosher salt, if needed.",
    "On a large serving platter, combine the sugar snap peas, radishes, chopped herbs, watercress, and steak. Sprinkle sesame seeds and drizzle a little more of the vinaigrette over the salad. Serve warm or at room temperature, passing more vinaigrette at the table."
  ],
  "ingredients": [
    "0",
    "1 pound skirt or flank steak",
    "1/2 teaspoon kosher salt, plus more to taste",
    "1/2 teaspoon freshly ground black pepper",
    "1 teaspoon brown sugar",
    "1 splash vegetable oil",
    "1 small bunch of radishes, thinly sliced",
    "3/4 pound sugar snap peas, trimmed and strings removed",
    "1/2 cup chopped herbs (I like a mix of cilantro and mint)",
    "1 handful Sesame seeds, for serving",
    "3 handfuls watercress or arugula, for serving"
  ],
  "__v": 1
}