{
  "hash": "883f462fc66c5352cc5ac3457066ebbd903737e2",
  "title": "TOM KHA GAI (THAI COCONUT CHICKEN SOUP)",
  "image": "https://www.gimmesomeoven.com/wp-content/uploads/2016/02/Tom-Kha-Recipe-3.jpg",
  "href": "https://www.gimmesomeoven.com/tom-kha-gai/",
  "extension": "Chrome",
  "firstAdded": "2019-01-02T23:58:29.950000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Using the back of a knife, lightly smash the lemongrass on a cutting board. Cut the lemongrass into 1-inch pieces, and add to a large stockpot.",
    "Add lemongrass, ginger, fresh lime juice (or kaffir lime leaves), chicken broth, and the white parts of the green onions to the stockpot, and stir to combine. Bring to a boil over high heat. Then reduce heat to medium-low and simmer for 10 minutes, stirring occasionally. Strain out the broth and discard the solids, then return the broth to the stockpot.",
    "Add cooked chicken, mushrooms, coconut milk, fish sauce, and sugar, and stir to combine. Increase heat to medium-high until it reaches a simmer, then continue cooking for 1-2 more minutes until the mushrooms are cooked and softened, stirring occasionally. Taste and season with salt and pepper, if needed.",
    "Serve immediately, garnished liberally with your desired toppings and the green parts of the green onions."
  ],
  "ingredients": [
    "0",
    "2 stalks fresh lemongrass, tough outer layers removed",
    "2 tablespoons grated (or finely-chopped) fresh ginger",
    "1/4 cup fresh lime juice or 10 kaffir lime leaves*",
    "6 cups good-quality chicken stock",
    "4 green onions, thinly-sliced with the white and green parts separated",
    "2 cups cooked shredded chicken",
    "8 ounces white, shiitake, or oyster mushrooms (or you could use a combination of your favorites), sliced",
    "2 (13.5-ounce) cans coconut milk",
    "2 tablespoons fish sauce",
    "1-3 teaspoons coconut sugar, to taste (or use another favorite sweetener)",
    "toppings: fresh cilantro, thinly-sliced Thai red chiles**, fresh lime wedges, etc."
  ],
  "__v": 1
}