{
  "hash": "e046e259c79be742df997e7373195be6d80ca2f3",
  "title": "Bacon and cheese rolls",
  "image": "http://www.taste.com.au/images/recipes/agt/2008/07/20073_l.jpg",
  "href": "http://www.taste.com.au/recipes/20073/bacon+and+cheese+rolls",
  "firstAdded": "2014-12-26T09:50:58.391000",
  "users": [
    null
  ],
  "keywords": [
    "plain",
    "bread",
    "flour",
    "sachets",
    "yeast",
    "caster",
    "sugar",
    "salt",
    "milk",
    "butter",
    "shortcut",
    "bacon",
    "rashers",
    "coarsely",
    "cheddar"
  ],
  "directions": [
    "0",
    "Step 1 Combine flour, yeast and sugar in a large bowl. Stir in salt. Make a well in the centre. Add milk and butter.",
    "Step 2 Use a wooden spoon to stir the mixture until well combined, then use your hands to bring the dough together in the bowl. Turn onto a lightly floured surface and knead for 10 minutes or until the dough is smooth and elastic.",
    "Step 3 Brush a large bowl with olive oil to grease. Place the dough in the bowl and cover with a damp tea towel. Set aside in a warm, draught-free place to prove for 45 minutes-1 hour or until the dough has almost doubled in size.",
    "Step 4 Punch down the centre of the dough with your fist. Turn onto a lightly floured surface. Knead for 2 minutes or until the dough is elastic and has returned to its original size.",
    "Step 5 Preheat oven to 190C. Lightly flour a baking tray. Divide the dough into 8 equal portions. Roll each portion into a ball and place, about 5cm apart of your hand to flatten slightly.",
    "Step 6 Sprinkle the bacon and cheddar over the rolls, leaving a 1cm-wide border. Cover with a damp tea towel. Set aside in a warm, draught-free place to prove for 30 minutes or until the dough has almost doubled in size.",
    "Step 7 Bake in oven for 25-30 minutes or until the cheddar melts, and the rolls are golden and sound hollow when tapped on the base. Transfer to a wire rack to cool slightly."
  ],
  "ingredients": [
    "0",
    "450g (3 cups) plain bread flour",
    "1 tablespoon (14g/2 sachets) dried yeast",
    "2 teaspoons caster sugar",
    "1/2 teaspoon salt",
    "250ml (1 cup) warm milk",
    "2 tablespoons melted butter",
    "175g short-cut bacon rashers, finely chopped",
    "120g (1 1/2 cups) coarsely grated cheddar"
  ],
  "__v": 1
}