{
  "hash": "03e64d8dbc793cdcab89f8460f7d853a593c3a05",
  "title": "Creamy Broccoli Cheddar Soup",
  "image": "http://del.h-cdn.co/assets/15/45/640x640/square-1446661433-delish-broccoli-soup-weeknight-din-1.jpg",
  "href": "http://www.delish.com/cooking/recipe-ideas/recipes/a44630/creamy-broccoli-cheddar-soup-recipe/?zoomable",
  "extension": "Chrome",
  "firstAdded": "2016-06-22T19:52:41.297000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "In a large pot, melt butter over medium-high heat. Add onion and cook until soft, 5 minutes. Add garlic and stir until fragrant, 1 minute. Add flour and cook, stirring constantly, until it turns golden, 3 minutes.",
    "Add broth and half-and-half and bring to a boil. Reduce heat to medium and add broccoli. Simmer until broccoli is bright green, 4 minutes, then remove four pretty pieces of broccoli (for garnish) and rinse under cold water. Reduce heat to low and cover partially; simmer until broccoli is tender, 15 minutes.",
    "If you have an immersion blender, puree soup in pot. Otherwise, working in batches, carefully puree soup in a blender (holding down lid with an old towel to prevent hot liquid from spurting out the top). Pour pureed soup into a large bowl.",
    "Immediately whisk in cheddar and season with salt and pepper and nutmeg.",
    "Ladle soup into bowls and garnish with Greek yogurt or sour cream (if using), black pepper, and reserved broccoli."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "3 tbsp. unsalted butter",
    "1 small white or yellow onion, diced",
    "2 cloves garlic, minced",
    "3 tbsp. all-purpose flour",
    "4 c. vegetable broth",
    "2 c. half-and-half",
    "2 small heads broccoli, cut into florets and stems cut into 1-in. pieces (8 to 10 c.)",
    "3 oz. sharp white cheddar, grated (1 1/2 cups)",
    "kosher salt",
    "Freshly ground black pepper",
    "pinch of nutmeg",
    "Greek yogurt or sour cream, for garnish (optional)"
  ],
  "__v": 1
}