{
  "hash": "338897b5911fdeceeaa411cc87f50c019c6294da",
  "title": "Cauliflower, Cashew, Pea and Coconut Curry",
  "image": "https://static01.nyt.com/images/2019/01/16/dining/16spicerex3/merlin_149034798_5368bea5-0f32-437c-a89d-27ccca8dc5a3-articleLarge.jpg",
  "href": "https://cooking.nytimes.com/recipes/1019911-cauliflower-cashew-pea-and-coconut-curry?em_pos=medium&emc=edit_ck_20190120&nl=cooking&nl_art=2&nlid=79859114emc%3Dedit_ck_20190120&ref=headline&te=1",
  "extension": "Firefox",
  "firstAdded": "2019-07-08T00:24:12.747000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place the ginger, garlic and green chile in a mortar and pestle with a pinch of salt. Mash until a paste forms and set aside. Alternately, finely chop the ginger, garlic and green chile together, sprinkle with a pinch of salt, then mash into a coarse paste using the flat portion of your chef’s knife.",
    "In a large skillet with a lid, heat 3 tablespoons oil over medium. Cook the onions until golden, about 10 minutes. Add the ginger paste and cook, stirring, until fragrant, 3 to 4 minutes.",
    "Stir in the tomato paste, coriander, cumin, chile powder and 1 1/4 teaspoons salt. Stir in the cauliflower and coconut milk and bring to a simmer. Reduce the heat to low, cover and cook until the cauliflower is tender, 10 to 12 minutes.",
    "Meanwhile, heat the remaining 1 tablespoon oil in a small skillet over medium. Fry the cashews, stirring occasionally, 2 minutes. Transfer to a plate to cool.",
    "Add the peas and garam masala to the cauliflower mixture and cook, stirring, 5 minutes. Season to taste with salt.",
    "Top the curry with the cashews, cilantro and a squeeze of lemon just before serving. Serve with a big steaming bowl of basmati rice."
  ],
  "ingredients": [
    "0",
    "1 (1-inch) piece fresh ginger, peeled and chopped",
    "4 garlic cloves, chopped",
    "1 green chile, roughly chopped (seeded if you prefer less heat)",
    "Kosher salt",
    "4 tablespoons canola oil",
    "2 large onions, finely chopped",
    "1 tablespoon tomato paste",
    "1 ½ teaspoons ground coriander",
    "1 ¼ teaspoons ground cumin",
    "½ teaspoon chile powder",
    "1 large head cauliflower (about 1 1/4 pounds), broken into bite-size florets",
    "1 (14-ounce) can unsweetened coconut milk",
    "4 ounces unsalted cashews (about 3/4 cup)",
    "½ cup frozen peas",
    "½ teaspoon garam masala",
    "1 small bunch cilantro, leaves chopped, for serving",
    "1 lemon wedge, for serving",
    "Cooked basmati rice, for serving"
  ],
  "__v": 2
}