{
  "hash": "303bdbb3a4efa24631b878e9b2f79e5be8767d7e",
  "title": "Swiss Chard Pancakes [Farçous]",
  "image": "https://farm2.staticflickr.com/1575/24291521846_fd2471fa6f_z.jpg",
  "href": "https://smittenkitchen.com/2016/01/swiss-chard-pancakes/",
  "extension": "Chrome",
  "firstAdded": "2018-01-26T22:50:25.739000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "If you’d like to keep your finished pancakes warm while you cook them: Heat oven to 250 degrees F and line a baking sheet with foil.",
    "Make the batter: Put everything except the Swiss chard and oil in a blender or food processor and whirl until the batter is smooth. Scrape down sides. Add chard leaves and pulse machine until they’re chopped to your desired consistency.",
    "Cook the pancakes: Heat a large skillet over medium-high heat and pour in a good puddle (1/4-inch deep) of oil. Once oil is hot enough that a droplet of batter hisses and sputters, spoon about 3 tablespoons batter in per pancake. It will spread quickly. Cook until browned underneath and (the edges will scallop, adorably), then flip, cooking on the other side until browned again. Transfer to a paper towel-lined plate, and then, if you’d like to keep them warm, to the foil-lined tray in the oven.",
    "Repeat with remaining batter. Serve with lemony yogurt or another sauce of your choice.",
    "Do ahead: Unused batter keeps in fridge for 3 days. Finished pancakes keep in fridge for a couple days, and will freeze much longer. Separate pancakes with pieces of waxed or parchment paper so they don’t glue together."
  ],
  "ingredients": [
    "0",
    "2 cups (475 ml) whole milk",
    "2 1/2 cups (325 grams) all-purpose flour",
    "3 large eggs",
    "1 teaspoon coarse salt",
    "Freshly ground black pepper",
    "1 small onion, coarsely chopped",
    "10 fresh chives, snipped",
    "1 shallot, coarsely chopped",
    "2 garlic cloves, split, germ removed, and coarsely chopped",
    "Leaves from 10 parsley sprigs",
    "5 large or 10 small Swiss chard leaves, center ribs removed, roughly chopped",
    "About 1/2 cup (120 ml) grapeseed, peanut, vegetable, or olive oil",
    "To serve: Plain, thick yogurt mixed with a little lemon zest, lemon juice and salt, to taste"
  ],
  "__v": 1
}