{
  "hash": "baa5de1c602893191cf5937270e35251aa2d10f9",
  "title": "One Pot Roasted Greek Chicken and Rice",
  "image": "",
  "href": "http://girlandthekitchen.com/one-pot-roasted-greek-chicken-and-rice/",
  "extension": "Chrome",
  "firstAdded": "2016-10-31T02:22:00.076000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine the chicken and marinade in a ziplock bag and marinade for a minimum of 30 minutes and up to over night.",
    "Preheat the oven to 350-degrees",
    "Heat up a skillet large enough to contain the chicken and the rice, over medium heat with the 1 tbsp olive oil in it.",
    "Using tongs or you hands, remove the chicken from the marinade...BUT DO NOT THROW OUT THE MARINADE.",
    "Place the chicken skin side down into the pan and cook until brown. You may have to do this in batches. Remove and set aside.",
    "Remove the darkened bits from the chicken and wipe pan clean with a paper towel. I like to hold the paper towel with tongs and wipe it around so that I do not burn my hands",
    "Add the remaining olive oil to the pan and add in shallots, red pepper flakes, onion and garlic. Sweat them out. Not allowing any color to come to the veggies.",
    "Add in all the remaining rice ingredients and the marinade.",
    "Let the liquid come to a simmer and allow to simmer for 30 seconds.",
    "Place chicken on top of the rice, nestling it in gently. Place a lid on the pan. Bake in the oven for 35 minutes.",
    "Remove the lid and bake for 10 more minutes to allow the chicken to brown. The rice is done when all the liquid has evaporated.",
    "Remove, allow to rest for 10 minutes and fluff with a fork.",
    "Garnish with extra lemons and parsley."
  ],
  "ingredients": [
    "0",
    "Marinade",
    "1 fryer chicken, cut up into pieces or feel free to just use thighs and drumsticks (about 3-pounds)",
    "2 whole lemons, zested and juiced",
    "3 tablespoons of oregano",
    "½ a cup of water",
    "5 cloves of garlic, sliced",
    "1 tsp of red pepper flakes or more if you are feeling dangerous",
    "Rice",
    "2 tbsp olive oil, separated",
    "1 shallot, finely diced",
    "3 garlic cloves, minced on microplaner",
    "1 large onion, finely diced",
    "a pinch of red pepper flakes",
    "1 cup long grain rice",
    "1½ cups chicken broth / stock",
    "¾ cup water",
    "1 tbsp dried oregano",
    "1 tsp salt",
    "Black pepper",
    "Chopped parsley and lemon zest to garnish"
  ],
  "__v": 1
}