{
  "hash": "cb54125d07615c01ab7bb270951b03edb0783ce9",
  "title": "Lasagna Roll Ups",
  "image": "http://www.cookingclassy.com/wp-content/uploads/2015/07/lasagna-roll-ups10-srgb..jpg",
  "href": "http://www.cookingclassy.com/2015/07/lasagna-roll-ups/",
  "extension": "Chrome",
  "firstAdded": "2015-09-14T22:24:12.069000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "divided",
    "lean",
    "beef",
    "yellow",
    "onion",
    "tomatoes",
    "garlic",
    "basil",
    "oregano",
    "salt",
    "black",
    "pepper",
    "container",
    "ricotta",
    "cheese",
    "egg",
    "flat",
    "leaf",
    "parsley",
    "mozzarella",
    "parmesan",
    "romano",
    "uncooked",
    "lasagna",
    "noodles"
  ],
  "directions": [
    "0",
    "Preheat oven to 375 degrees. Drizzle one tablespoon olive oil into a large non-stick fry pan. Heat over medium high heat, crumble ground beef over oil, add chopped onions and cook mixture stirring occasionally and breaking up meat, until browned. Drain fat from beef. Pour beef mixture into a food processor and pulse for about 5 seconds until it is ground into fine pieces. Pour beef mixture back into fry pan and add crushed tomatoes, minced garlic, basil, oregano and 1 tablespoon olive oil and stir. Season sauce with salt and pepper to taste then cover with a lid and simmer over low heat while preparing pasta and cheese mixture.",
    "Cook lasagna noodles in a large pot of boiling water along with 1 tsp salt and 2 tablespoon olive oil to al dente according to directions listed on package. Once noodles are cooked, drain and line noodles in a single layer on waxed paper or cookie sheets sprayed lightly with non-stick cooking spray.",
    "Prepare cheese mixture (I do this while pasta is cooking) by stirring together ricotta cheese, egg, 1/4 tsp salt and 1/4 tsp pepper with a fork in a large mixing bowl until well combine. Stir in chopped fresh parsley. Add in 2 cups grated mozzarella cheese, 1/2 cup Parmesan cheese and 1/3 cup Romano cheese, stir mixture until well combine.",
    "Stir meat sauce and spread 1/3 cup evenly into a 13x9 inch baking dish. Spread 1/4 cup cheese mixture evenly onto each cooked lasagna noodle (it will be a thin layer), then spread 1 heaping tablespoon meat sauce along the top of cheese covered noodle. Roll noodles up jellyroll style and arrange seam side down in baking dish. Cover rolled noodles with remaining meat sauce then sprinkle remaining 1/2 cup Mozzarella cheese and 1/4 cup Parmesan cheese evenly over roll-ups. Tent baking dish with foil (don't allow foil to rest on cheese or it will stick you just want to loosely tent to prevent the cheese from browning) and bake for 35 minutes in preheated oven. Serve warm garnished with chopped fresh basil and parsley.",
    "*Along with the basil and oregano, you can also add in a little bit of rosemary, thyme and crushed fennel seeds if desired.",
    "Recipe Source: Cooking Classy"
  ],
  "ingredients": [
    "0",
    "4 Tbsp olive oil, divided",
    "8 oz lean ground beef",
    "1/4 cup finely chopped yellow onion",
    "1 (28 oz) can crushed tomatoes",
    "3 cloves garlic, minced",
    "3 Tbsp chopped fresh basil or 2 tsp dried basil*, plus more for serving",
    "1/2 tsp dried oregano",
    "Salt and freshly ground black pepper, to taste",
    "1 (15 oz) container ricotta cheese",
    "1 large egg",
    "3 Tbsp fresh flat leaf parsley, chopped, plus more for serving",
    "2 1/2 cups freshly grated mozzarella cheese, divided",
    "3/4 cup freshly, finely grated Parmesan cheese, divided",
    "1/3 cup freshly, finely grated Romano cheese",
    "1/4 tsp salt",
    "1/4 tsp freshly ground black pepper",
    "12 uncooked lasagna noodles"
  ],
  "__v": 1
}