{
  "hash": "b588e6bd356ddafe6924d333b1ded3a2af3f81f4",
  "title": "Baked Oatmeal With Strawberries, Banana And Chocolate",
  "image": "",
  "href": "http://ifood.tv/oatmeal/453994-baked-oatmeal-with-strawberries-banana-and-chocolate",
  "extension": "Chrome",
  "firstAdded": "2015-03-06T01:35:19.822000",
  "users": [
    null
  ],
  "keywords": [
    "rolled",
    "oats",
    "light",
    "brown",
    "sugar",
    "baking",
    "orange",
    "zest",
    "salt",
    "walnut",
    "halves",
    "almonds",
    "strawberries",
    "semisweet",
    "chocolate",
    "chips",
    "milk",
    "egg",
    "butter",
    "vanilla",
    "banana"
  ],
  "directions": [
    "0",
    "Preheat oven to 375°F and generously spray the inside of a 10-1/2 by 7 inch baking dish with cooking spray and place on a baking sheet.",
    "Start by mixing together the dry ingredients; only throw in half of the walnuts and chocolate during this step, because we chose to top the oatmeal before baking with the other half.",
    "Now, add some sliced strawberries, again we only added half now and top the oatmeal before baking with the remaining half.",
    "Grab another bowl and whisk together milk, one egg and vanilla extract.",
    "Pour the oat mixture into the sprayed casserole. Arrange the remaining walnuts, chocolate and strawberries on top, then do the same with some sliced banana.",
    "Next, pour the milk mixture all over the oats and shake or shimmy the baking dish so the wet ingredients make their way throughout the dry.",
    "Place the baking dish onto a baking sheet (that is just in case anything bubbles over) and bake for 35-40 minutes until the wet ingredients have been absorbed, the oatmeal puffs up a bit and is golden brown on top."
  ],
  "ingredients": [
    "0",
    "2 Cups Rolled oats",
    "1 Cup Light brown sugar",
    "1 tsp Baking powder",
    "1 Tbsp Orange zest",
    "1 tsp Salt",
    "1 Cup Walnut halves (or Almonds??)",
    "1 Cup Fresh strawberries",
    "1 Cup Semi-sweet chocolate chips",
    "2 Cups Milk",
    "1 Egg",
    "3 Tbsp Butter, melted",
    "2 tsp Vanilla extract",
    "1 Banana"
  ],
  "__v": 3
}