{
  "hash": "827124f67cb4b61296c6d58bab34ef5db91c20ff",
  "title": "Red Velvet Cake",
  "image": "https://divascancook.com/wp-content/uploads/2009/11/red-velvet-cupcakes.jpg",
  "href": "https://divascancook.com/the-best-red-velvet-cake-recipe-easy-homemade-moist-with-southern-flair/",
  "extension": "Chrome",
  "firstAdded": "2019-11-20T14:02:34.958000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 325 F.",
    "Generously grease and flour (2) 9-inch round cake pans. Set aside.",
    "In a medium bowl, whisk together flour, baking soda, baking powder, cocoa powder, and salt. Set aside.",
    "In a large bowl, combine the sugar and vegetable oil.",
    "Mix in the eggs, buttermilk, vanilla and red food coloring until combined.",
    "Stir in the coffee and white vinegar.",
    "Combine the wet ingredients with the dry ingredients a little at a time, mixing after each addition, just until combined. (Batter will be thin)",
    "Pour the batter evenly into each pan.",
    "Bake in the middle rack for 30-40 minutes or until a toothpick inserted in center comes out with moist crumbs clinging to it. Do not over bake as the cake will continue to cook as it cools.",
    "Let pans cool on a cooling rack until the pans are warm to the touch.",
    "Slide a knife or offset spatula around the inside of the pans to loosen the cake from the pan.",
    "Gently remove the cakes from the pan and let them finish cooling. (The warm cake will be very delicate)",
    "Frost the cake with cream cheese frosting when the cakes have cooled completely."
  ],
  "ingredients": [
    "0",
    "2 cups all-purpose flour",
    "1 teaspoon baking soda",
    "1 teaspoon baking powder",
    "1 teaspoon salt",
    "2 Tablespoons unsweetened, cocoa powder",
    "2 cups sugar",
    "1 cup vegetable oil or canola",
    "2 eggs",
    "1 cup buttermilk",
    "2 teaspoons vanilla extract",
    "1-2 oz. red food coloring, more or less depending on how deep you want the color",
    "½ cup plain hot coffee, prepared (don't skip this ingredient)",
    "1 teaspoon white distilled vinegar"
  ],
  "__v": 1
}