{
  "hash": "59032f15695ff417ec07078fc08f91851bf55dee",
  "title": "Creamy Indian-spiced vegan sweet potato soup",
  "image": "http://ninecooks.typepad.com/.a/6a00d83451fa5069e2017d3f75a3aa970c-800wi",
  "href": "http://www.theperfectpantry.com/2013/01/creamy-indian-spiced-vegan-sweet-potato-soup-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-01-11T01:00:56.790000",
  "users": [
    null
  ],
  "keywords": [
    "leftover",
    "mashed",
    "potatoes",
    "medium",
    "onion",
    "olive",
    "oil",
    "ginger",
    "root",
    "garlic",
    "smashed",
    "curry",
    "use",
    "hot",
    "course",
    "turmeric",
    "cumin",
    "lemon",
    "juice",
    "agave",
    "nectar",
    "honey",
    "coconut",
    "milk",
    "kosher",
    "salt",
    "black",
    "pepper",
    "apple",
    "cashews"
  ],
  "directions": [
    "0",
    "Pierce the sweet potatoes in a few places, and cook in the microwave on full power for 9 minutes, or until the potatoes are quite soft. When they're cool enough to handle, scrape out the flesh into a bowl, and discard the skins. (Skip this step if you're using leftover mashed potatoes.)",
    "In a Dutch oven, sauté the onions in the oil over low heat for 2-3 minutes, until translucent. Add the ginger and garlic, and sauté for 1 minute, stirring constantly. Stir in the curry powder, turmeric and cumin, and cook for 20 seconds until just slightly fragrant. Add the sweet potato plus 1 cup of water, and stir to combine all ingredients.",
    "Bring to a boil, then reduce the heat to simmer. Stir in the lemon juice and honey. Taste, and add salt and pepper as needed.",
    "Then, add the coconut milk. Stir to incorporate, and simmer for 5 minutes. Remove the pot from the stove, and use an immersion blender to purée the soup to the texture you like (I like mine slightly \"rustic\"). If you don't have an immersion blender, let the soup cool for a few minutes, and purée in batches in a food processor or blender.",
    "If the soup is too thick, add more coconut milk and/or water. Taste the soup, and adjust seasonings with more lemon, honey, salt and pepper, to your liking.",
    "Serve hot, garnished with chopped apples and cashews."
  ],
  "ingredients": [
    "0",
    "2 large sweet potatoes (or 3-4 cups leftover mashed sweet potatoes)",
    "1 medium onion, diced",
    "2 tsp olive oil",
    "1 tsp grated fresh ginger root",
    "2 cloves garlic, smashed",
    "1 tsp curry powder (hot or sweet; I use hot, of course)",
    "1/2 tsp turmeric",
    "1 tsp ground cumin",
    "1 tsp fresh lemon juice, or more to taste",
    "1 tsp agave nectar (or honey), or more to taste",
    "6 oz coconut milk, or more to taste",
    "Kosher salt and fresh black pepper, to taste",
    "A few teaspoons of chopped apple and cashews, for garnish"
  ],
  "__v": 1
}