{
  "hash": "0abb33d13f2dfc8f7f7c497ca853cf1c6a6b748d",
  "title": "Pumpkin Snickerdoodles",
  "image": "http://www.cookingclassy.com/wp-content/uploads/2014/10/pumpkin-snickerdoodles5-srgb.jpg",
  "href": "http://www.cookingclassy.com/2014/10/pumpkin-snickerdoodles/",
  "extension": "Chrome",
  "firstAdded": "2016-08-22T18:03:44.147000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a mixing bowl whisk together flour, cornstarch, cream of tartar, baking soda, baking powder, salt, cinnamon, ginger, nutmeg and allspice for 20 seconds, set aside.",
    "In the bowl of an electric stand mixer fitted with the paddle attachment, cream together butter, granulated sugar and brown sugar (not until pale and fluffy, just to combined. Occasionally scrape down sides and bottom of bowl throughout entire mixing process if not using a paddle attachment that constantly scrapes bowl while mixing). Mix in egg yolk, then mix in pumpkin and vanilla extract. With mixer set on low speed, slowly add in dry ingredients then mix until combined. Divide dough in half and place each half in a bowl, cover with plastic wrap and chill 45 minutes to 1 hour (dough should be slightly sticky so the cinnamon sugar will stick when rolling but they should be manageable to roll in the palms of your hands). Preheat oven to 350 degrees during last 10 minutes of refrigeration.",
    "In a small bowl, whisk together 1/4 cup granulated sugar with 1 1/2 tsp cinnamon. Scoop dough out 2 even tablespoons at a time (run the measuring spoon against side and edge of bowl so it will slightly deflate the dough while also giving an equal tbsp, twice per ball) and shape into a ball, roll dough ball in cinnamon sugar mixture to evenly coat then transfer to Silpat or parchment paper lined baking sheets spacing cookies 2-inches apart. Bake in preheated oven 12 - 14 minutes (they should look just slightly under-baked as they'll cook slightly once removed from oven). Cool on baking sheet about 5 minutes then transfer to a wire rack to cool completely.",
    "Recipe source: Cooking Classy"
  ],
  "ingredients": [
    "0",
    "3 1/4 cups all-purpose flour",
    "3 1/2 tsp cornstarch",
    "1 tsp cream of tartar",
    "1 tsp baking soda",
    "1/2 tsp baking powder",
    "1/2 + 1/8 tsp salt",
    "3/4 tsp ground cinnamon",
    "1/2 tsp ground ginger",
    "1/4 tsp ground nutmeg",
    "1/4 tsp ground allspice",
    "1 cup granulated sugar",
    "3/4 cup packed light brown sugar",
    "1 cup unsalted butter, softened",
    "1 large egg yolk",
    "3/4 cup canned pumpkin puree",
    "1 1/2 tsp vanilla extract",
    "1/4 cup granulated sugar",
    "1 1/2 tsp ground cinnamon"
  ],
  "__v": 1
}