{
  "hash": "f38ad5a970f2d322166853c7b170a651f90de3b4",
  "title": "Gluten-Free Shells with Beets, Ricotta, and Pistachios",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/gluten-free-shells-beets-ricotta-pistachios",
  "extension": "Chrome",
  "firstAdded": "2015-05-04T22:28:06.932000",
  "users": [
    null
  ],
  "keywords": [
    "raw",
    "pistachios",
    "olive",
    "oil",
    "drizzling",
    "kosher",
    "salt",
    "black",
    "pepper",
    "ricotta",
    "golden",
    "beets",
    "scrubbed",
    "shallot",
    "champagne",
    "vinegar",
    "glutenfree",
    "shells",
    "short",
    "pasta",
    "chives",
    "flaky"
  ],
  "directions": [
    "0",
    "Preheat oven to 350°. Toast pistachios on a baking sheet, stirring occasionally, until golden brown, 8–10 minutes. Let cool, then chop. Toss in a small bowl with 1 tsp. oil; season with kosher salt and pepper.",
    "Process ricotta and 1 Tbsp. oil in a food processor until smooth (or whisk in a bowl); season with kosher salt and pepper.",
    "Cook beets in a large pot of boiling salted water until just tender, 12–15 minutes. Transfer to a kitchen towel and let cool slightly. Rub off skins with paper towels and slice ¼” thick. Toss in a large bowl with shallot, vinegar, and 4 Tbsp. oil; season with kosher salt and pepper.",
    "Return beet cooking liquid to a boil and use it to cook pasta, stirring occasionally, until al dente. Drain pasta, reserving ½ cup pasta cooking liquid.",
    "Meanwhile, heat a large skillet over medium-high. Cook beets and dressing, tossing occasionally, until beets are golden brown in spots, 8–10 minutes. Add pasta and cook, tossing and adding cooking liquid as needed, until pasta is coated.",
    "Serve pasta over ricotta topped with pistachios and chives and drizzled with oil. Season with sea salt and pepper."
  ],
  "ingredients": [
    "0",
    "⅓ cup raw pistachios",
    "1 teaspoon plus 5 Tbsp. olive oil; plus more for drizzling",
    "Kosher salt and freshly ground black pepper",
    "1 cup ricotta",
    "2 pounds small golden beets, scrubbed",
    "1 large shallot, finely chopped",
    "3 tablespoons Champagne vinegar",
    "12 ounces gluten-free shells or other short pasta",
    "1 tablespoon finely chopped fresh chives",
    "Flaky sea salt"
  ],
  "__v": 1
}