{
  "hash": "0a12a50f6d394231c7bf54bd280b175543eac1a0",
  "title": "Chocolate Olive Oil Cake",
  "image": "https://farm5.staticflickr.com/4494/23763887218_c6bdb66eef_z.jpg",
  "href": "https://smittenkitchen.com/2017/10/chocolate-olive-oil-cake-more-book-tour/",
  "extension": "Chrome",
  "firstAdded": "2019-06-14T04:36:44.386000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make cake: Heat oven to 350 degrees F. Line the bottom of 9-inch round cake pan with a fitted round of parchment paper and coat the bottoms and sides with nonstick cooking spray.",
    "Whisk together flour, cocoa, baking soda, salt and granulated sugar in the bottom of a large mixing bowl. Add brown sugar and olive oil, and whisk to combine. Add water and vinegar and whisk until smooth.",
    "Pour into prepared pan. Bake for 30 to 35 minutes, or until the top is springy and a tester inserted in the center comes out with just a few sticky crumbs (but not wet or loose batter). Cool the cake in the pan on a wire rack for 10 minutes, then cut around it with a knife to ensure it is loosened and flip it out onto a cooling rack to cool the rest of the way.",
    "Make glaze: Combine chocolate, cocoa powder, olive oil, corn syrup, and salt in a medium bowl and microwave to melt, in 15 to 30 second increments, stirring between each until just melted. Whisk until smooth. Pour over completely cooled cake and use spatula to gently nudge it down the sides.",
    "Cake keeps: At room temperature for 2 to 3 days and up to a week in the fridge. On day 4 in the fridge, ours was as moist as day one, basically a miracle."
  ],
  "ingredients": [
    "0",
    "1 1/2 cups (195 grams) all-purpose flour",
    "3/4 cup (60 grams) unsweetened cocoa, any variety, sifted if lumpy",
    "1 1/2 teaspoons baking soda",
    "1/2 teaspoon fine sea salt",
    "3/4 cup (150 grams) granulated sugar",
    "3/4 cup (145 grams) dark brown sugar",
    "1/2 cup (120 ml) olive oil",
    "1 1/2 cups (355 ml) water or coffee",
    "1 tablespoon (15 ml) cider vinegar or white vinegar",
    "3/4 cup (135 grams) semisweet chocolate chips",
    "2 tablespoons (10 grams) cocoa powder",
    "3 tablespoons (45 ml) olive oil",
    "1 tablespoon (20 grams) light corn syrup (for shine)",
    "A pinch or two of flaky sea salt"
  ],
  "__v": 1
}