{
  "__v": 1,
  "directions": [
    "0",
    "In a large mixing bowl mix together the oats, ground flax and salt.",
    "In a medium glass bowl combine the maple syrup and peanut butter. Microwave on high for 1 minute or until the maple syrup is bubbling. Stir to combine the melted peanut butter (or whatever butter you are using) with the maple syrup. Add the coconut oil, mashed banana and vanilla. Mix the wet mixture with the dry oats until completely combined and the all the oats are moistened. Cover the mixing bowl and place in the freezer for 10-15 minutes to chill before adding the chocolate chips.",
    "Meanwhile preheat the oven to 350 degrees F. Grease a 12-cup muffin pan with butter, oil or cooking spray.",
    "Remove the dough from the freezer and fold in the chocolate chips. Divide the dough evenly among the 12 muffin cups. Starting in the middle, press down lightly with your fingers to form a bowl. Press from the bottom up to form the dough around the sides of the cups. If the dough is sticking to your hands try wetting them lightly, but I found just using my messy hands worked best.",
    "Bake the cups for 10-15 minutes or until the cookies are lightly golden around the top. Remove from the oven and let cool 5 minutes, then run a butter knife around the edges and carefully dump the cups out.",
    "Allow the cups to cool or eat warm (DO THIS!). Serve the cups IN A BOWL and pour in some thick milk. Do not use skim milk for this, whole milk or thick canned coconut milk is best. Garnish with fresh berries, chocolate chips and nuts. EAT!"
  ],
  "firstAdded": "2014-09-08T10:17:04.729000",
  "hash": "77e58854137d82179a717b096c8c4bf53d4f4ebe",
  "href": "http://www.halfbakedharvest.com/oatmeal-chocolate-chip-cookies-n-milk-breakfast-cups/",
  "image": "http://www.halfbakedharvest.com/wp-content/uploads/2014/08/Oatmeal-Chocolate-Chip-Cookie-n-Milk-Breakfast-Cups-111.jpg",
  "ingredients": [
    "0",
    "2 1/2 cups old fashioned oats",
    "2 tablespoons ground flax-meal",
    "1/2 teaspoon salt",
    "1/3 cup real maple syrup (or honey, but I liked maple with these)",
    "2 tablespoons tahini (or peanut butter or almond butter)*",
    "1/4 cup coconut oil (may use canola or butter)",
    "1 very ripe banana, mashed well",
    "2 teaspoons vanilla extract",
    "1-2 cups semi-sweet or dark chocolate chips (I used 2 cups of course)",
    "whole milk or coconut milk (yogurt is good too), for serving*",
    "toasted nuts, chocolate chips, fresh berries and or sliced bananas, for serving"
  ],
  "keywords": [
    "old",
    "fashioned",
    "oats",
    "flaxmeal",
    "salt",
    "real",
    "syrup",
    "honey",
    "liked",
    "maple",
    "tahini",
    "peanut",
    "almond",
    "butter",
    "coconut",
    "oil",
    "use",
    "canola",
    "banana",
    "mashed",
    "vanilla",
    "semisweet",
    "dark",
    "chocolate",
    "chips",
    "used",
    "course",
    "milk",
    "yogurt",
    "good",
    "nuts",
    "berries",
    "bananas"
  ],
  "title": "Oatmeal Chocolate Chip Cookie's 'n' Milk Breakfast Cups.",
  "users": [
    null
  ]
}