{
  "hash": "e0373721544bc90d2dfb6c165f6c79190fc9164f",
  "title": "Corn Tortillas",
  "image": "https://patijinich.com/wp-content/uploads/2015/04/403-Homemade-Corn-Tortillas-912x622.jpg",
  "href": "https://patijinich.com/recipe/homemade-corn-tortillas/",
  "extension": "Chrome",
  "firstAdded": "2017-10-29T11:37:17.260000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Set a comal, griddle or ungreased dry skillet over medium heat for at least 8 to 10 minutes, until very hot.",
    "Meanwhile, cut 2 circles about the size of the tortilla press plates out of thin plastic bags, such as produce bags from the grocery store.",
    "In a large mixing bowl, mix together the corn tortilla flour, salt and the water and knead in a circular motion. It should feel smooth and without lumps, like Play Doh. Though, it shouldn’t be too wet or sticky. If it doesn’t feel smooth and feels coarse when you attempt to make the masa balls, add a bit more water. Masa dries out fast, so if you leave it unattended, cover it with a clean moist kitchen towel or cloth.",
    "To make the tortillas, one by one, make dough balls of about 1 1/2-inch in diameter. Place one plastic circle on the bottom of the tortilla press and place the masa ball on top. Place the other plastic circle on top of the ball and clamp down the press to make a flat disk. As you clamp down the press, jiggle it a little as you are getting to the bottom, this makes for a rounder tortilla. It should be about 5-inches in diameter and about 1/8-inch in height.",
    "If the edges of the tortilla seem cracked and jagged, the dough needs a bit more water. Once you have a tortilla with smoother edges, you are set. (Alternatively, you can place a ball of dough between two plastic pieces and roll the tortillas out with a rolling pin).",
    "Open the press, take the top plastic off, lift the bottom plastic with the tortilla in one hand and peel the tortilla from the plastic with the other hand. I peel it with my right hand, as I am right handed. Lay it on the griddle, skillet or comal softly, but swiftly.",
    "Once the tortilla is on the hot surface, don’t touch it for the next 30 seconds! Even if it didn’t lay completely straight, resist the temptation to fiddle with it. Let it cook until it can be flipped without sticking to the comal, just like pancakes, or until a spatula can easily lift it. Another sign that it is ready to be flipped, is it becomes opaque on the side that it was cooking on.",
    "Turn over, and cook for a minute, until opaque and starting to get brown freckles on the side that is now on the hot surface. If it is opaque but it has white-ish areas, you need to leave it a bit longer until it becomes freckled with brown spots.",
    "Turn over once more, and now after 10 to 15 seconds, the tortilla should puff up like pita bread, if not all over tortilla, at least in an area of it. If it is not puffing, gently tease it by poking with your finger softly in an area of the tortilla around the center. Once it puffs, let the tortilla cook for another 15 to 20 seconds, so that it cooks internally in the puffed up area. That is the difference between ok tortillas, and to die for, malleable, fully cooked, soft tortillas.",
    "Transfer each cooked tortilla to a clean kitchen towel or a cloth-lined tortillero.",
    "If eaten that same day, tortillas may be kept wrapped in a clean kitchen towel or cloth. If not, wrap in a kitchen towel, place inside a closed plastic bag, and store in the refrigerator. They will keep for up to 3 days, afterwards they will turn too hard. Reheat on hot comal for 30 seconds or so on each side before eating. They can also be frozen and kept for months."
  ],
  "ingredients": [
    "0",
    "2cupscorn tortilla flour",
    "Pinch kosher or coarse sea salt",
    "1 3/4cupswater(or enough for a Play Doh consistency may vary with climate)"
  ],
  "__v": 1
}