{
  "hash": "f2c57c41e3df48fa4899dd08b563c03296e51356",
  "title": "Roasted Root Vegetables with Tomatoes and Kale",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2014/03/roasted-root-vegetables-tomatoes-kale-vertical-a2-1200.jpg",
  "href": "https://www.simplyrecipes.com/recipes/roasted_root_vegetables_with_tomatoes_and_kale/",
  "extension": "",
  "firstAdded": "2018-01-27T23:44:00.140000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Roast the root vegetables: Preheat oven to 450°F. Into a large roasting pan, mix together the vegetables, garlic, 3 Tbsp olive oil. Sprinkle with salt. Roast for 45 minutes, turning the vegetables over in the pan halfway through cooking.",
    "2 Make the tomato base: While the root vegetables are roasting, in a 4 to 5 quart Dutch oven, heat 3 Tbsp of olive oil over medium high heat. When the oil is hot, add the onions and sauté until the edges of the onions just begin to brown. Stir in the tomato paste, and cook a minute longer.",
    "Using your hands, tear the canned tomatoes into large pieces as you add them to the pot. Add the remaining liquid from the can into the pot. Stir well. Add the Italian seasoning. Bring to a simmer, then lower the heat to the lowest possible setting. Cover the pot and let cook gently while the root vegetables are roasting.",
    "3 Combine and simmer the roasted root vegetables, tomatoes, and greens: When the root vegetables are ready (they should be browned on the edges and easily pierced with a fork), remove from the oven. Add chopped leafy greens to the pot of tomatoes. Simmer until the greens are wilted, about 5 minutes. Stir in the root vegetables. Season with salt and pepper to taste. Season with Tabasco to taste if using."
  ],
  "ingredients": [
    "0",
    "3 to 4 pounds of root vegetables such as parsnips, rutabagas, carrots, potatoes, golden beets, turnips, and celery root, peeled and cut into chunks",
    "1 head of garlic, the cloves separated and peeled",
    "6 Tbs olive oil, divided 3 Tbsp and 3 Tbsp",
    "1 teaspoon Kosher salt",
    "1/2 cup chopped onion",
    "1 heaping tablespoon tomato paste",
    "1 28-ounce can of whole peeled tomatoes",
    "2 cups (packed) of chopped leafy greens such as kale or chard",
    "1 teaspoon Italian seasoning or dried oregano",
    "Black pepper to taste",
    "Tabasco sauce (optional, to taste)"
  ],
  "__v": 1
}