{
  "hash": "bf81558207382f36ed6680e047bd9e112cc3a75c",
  "title": "LIÈGE WAFELS",
  "image": "",
  "href": "https://bluebottlecoffee.com/preparation-guides/liege-wafel",
  "extension": "Chrome",
  "firstAdded": "2020-05-16T14:26:52.865000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Makes 9 wafels",
    "These Belgian-style yeasted wafels, a delicious breakfast or sweet snack, became a guest favorite at our Ferry Building Cafe and remain beloved today. They are tender and fluffy inside, with a crisp, sweet outer crust that makes syrup unnecessary.",
    "Step 1",
    "Bloom the yeast in a small bowl with the lukewarm water for 5 minutes. It should begin to foam.",
    "Step 2",
    "Melt the butter in your microwave or over a pilot light or very low heat, stirring as it starts to melt. You are aiming for the consistency of pudding, soft enough to stir with a whisk or spatula; it should not be liquid or contain solid pieces. If it melts to a liquid state, cool it, stirring occasionally, until it is opaque again.",
    "Step 3",
    "Sift the flours, granulated sugar, and salt into a large bowl.",
    "Step 4",
    "Crack the eggs into a medium bowl. Add the vanilla extract, or split the vanilla bean in half and scrape the seeds into the eggs. Whisk vigorously to blend eggs and break up any clumps of vanilla.",
    "Step 5",
    "Add the eggs, butter, and yeast mixture to the flour mixture all at once. Whisk until fairly smooth, but do not overmix.",
    "Step 6",
    "Cover batter and let rest at room temperature until doubled in size. This will take 1-2 hours depending on the temperature of your kitchen. You may also refrigerate the batter overnight for a slower rise.",
    "Step 7",
    "Gently fold the pearl sugar into the dough. Let rest at room temperature for 15 minutes. Preheat a waffle maker (Belgian style if available) to medium-high heat.",
    "Step 8",
    "Scoop ½ cup to ¾ cup batter into the waffle maker (start with the smaller amount and increase as needed) and sprinkle a bit of additional pearl sugar on top for extra crispness. Cook until browned and crisp. Serve immediately, and then cook the remaining wafels until you run out of batter. We don’t recommend syrup with these, but a tart jam is lovely!"
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "2 tsp active dry yeast",
    "⅔ cup lukewarm water (about 100°F)",
    "1 cup unsalted butter, cut into 1 tbsp pieces",
    "1⅓ cup pastry flour",
    "1 cup all-purpose flour",
    "1½ tbsp granulated sugar",
    "¾ tsp Maldon or other flaky sea salt",
    "3 eggs, at room temperature",
    "1 tbsp pure vanilla extract or 1 vanilla bean",
    "¼ cup Belgian pearl sugar",
    "Notes: Pearl sugar is compressed beet sugar; it looks a bit like rock salt and caramelizes in the waffle iron to add extra crispness to the wafels. It is difficult to substitute—we recommend hunting down the real thing. Pastry flour, on the other hand, can be substituted with all-purpose flour; if you do, use a total of 2 cups all-purpose flour. We also recommend using organic ingredients, if possible.",
    "COOK TIME",
    "20-30 minutes, plus at least 2 hours resting time"
  ],
  "__v": 1
}