{
  "hash": "9b0af0d357ea3fc33ab9ec2230d74fc508709879",
  "title": "Mary Berry's Chocolate Cappuccino Tart",
  "image": "https://flockler.com/thumbs/sites/192/cappuccino-tart-mary-berry-quick-cooking-a5c039cb-f5eb-482f-b08d-cb78adf7390b_s600x600_c5280x3074_l0x1552.jpg",
  "href": "https://thehappyfoodie.co.uk/recipes/mary-berrys-chocolate-cappuccino-tart",
  "extension": "Chrome",
  "firstAdded": "2019-04-25T19:16:42.507000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "You will need: a 23cm (9in) round, loose-bottomed, fluted tart tin with deep sides and a piping bag with a plain nozzle (optional).",
    "Instructions",
    "Prep time: 15 minutes, plus chilling (minimum 2 hours, ideally overnight) • Cook time: 5 minutes",
    "To make the base, melt the chocolate and butter in a wide-based pan over a medium heat (see note). Remove the pan from the heat, add the crushed biscuits and stir to combine. Press into the base of the tart tin and chill in the fridge while you make the filling.",
    "To make the filling, place the chocolate and butter in a large heatproof bowl and add the coffee and double cream. Set the bowl over a pan of just simmering water and heat until runny, stirring gently until smooth. Remove from the heat and allow to cool down a little, then mix in the crème fraîche by hand.",
    "Carefully pour the mixture into the tin on top of the biscuit base and chill for a minimum of 2 hours, or ideally overnight, until set.",
    "Remove the tart from the tin and place it on a cake stand or plate.",
    "Serve straight from the fridge.",
    "To decorate, spoon the whipped cream into a piping bag (if using) and pipe or dollop five large blobs of the cream into the middle of the tart. Sprinkle over the chocolate shavings or grated chocolate and serve in thin slices.",
    "Cook’s Notes:",
    "• You’ll need full-fat crème fraîche for this recipe to help the filling set.",
    "• Be sure not to overheat the chocolate and butter mixture – heat it until it is just warm enough to melt.",
    "Prepare Ahead: Can be made up to a day ahead and kept in the fridge. Decorate 2 hours before serving."
  ],
  "ingredients": [
    "0",
    "For the base:",
    "50g (2oz) dark chocolate, broken into pieces",
    "75g (3oz) butter",
    "15 digestive biscuits, finely crushed",
    "For the filling:",
    "350g (12oz) dark chocolate, broken into pieces",
    "100g (4oz) butter",
    "1 heaped tsp instant coffee granules dissolved in 1 tsp boiling water",
    "250ml (9fl oz) double cream",
    "200g (7oz) full-fat crème fraîche (see note)",
    "To decorate:",
    "150ml (5fl oz) double cream, lightly whipped",
    "Chocolate shavings or coarsely grated chocolate"
  ],
  "__v": 1
}