{
  "hash": "7d363c2aa5129165c3dc0767948c70877daad39c",
  "title": "Roasted tomato, basil & Parmesan quiche",
  "image": "http://www.bbcgoodfood.com/sites/bbcgoodfood.com/files/recipe_images/recipe-image-legacy-id--327537_12.jpg",
  "href": "http://www.bbcgoodfood.com/recipes/6295/roasted-tomato-basil-and-parmesan-quiche",
  "extension": "",
  "firstAdded": "2015-07-02T13:24:54.562000",
  "users": [
    null
  ],
  "keywords": [
    "cherry",
    "tomatoes",
    "drizzle",
    "olive",
    "oil",
    "parmesan",
    "vegetarian",
    "alternative",
    "eggs",
    "pot",
    "double",
    "cream",
    "basil",
    "leaves",
    "ones",
    "left",
    "scattering",
    "plain",
    "flour",
    "extra",
    "dusting",
    "cold",
    "butter",
    "pieces"
  ],
  "directions": [
    "0",
    "To make the pastry, tip the flour and butter into a bowl, then rub together with your fingertips until completely mixed and crumbly. Add 8 tbsp cold water, then bring everything together with your hands until just combined. Roll into a ball and use straight away or chill for up to 2 days. The pastry can also be frozen for up to a month.",
    "Roll out the pastry on a lightly floured surface to a round about 5cm larger than a 25cm tin. Use your rolling pin to lift it up, then drape over the tart case so there is an overhang of pastry on the sides. Using a small ball of pastry scraps, push the pastry into the corners of the tin. Chill in the fridge or freezer for 20 mins. Heat oven to 200C/fan 180C/gas 6.",
    "In a small roasting tin, drizzle the tomatoes\nwith olive oil and season with salt and pepper.\nPut the tomatoes in a low shelf of the oven.",
    "Lightly prick the base of the tart with a\nfork, line the tart case with a large circle of\ngreaseproof paper or foil, then fill with baking\nbeans. Blind-bake the tart for 20 mins,\nremove the paper and beans, then continue\nto cook for 5-10 mins until biscuit brown.",
    "When you remove the tart case from the\noven, take out the tomatoes, too.",
    "While the tart is cooking, beat the eggs\nin a large bowl. Gradually add the cream,\nthen stir in the basil and season. When the case is ready, sprinkle half the cheese over\nthe base, scatter over the tomatoes, pour\nover the cream mix, then finally scatter over\nthe rest of the cheese. Bake for 20-25 mins\nuntil set and golden brown. Leave to cool\nin the case, trim the edges of the pastry,\nthen remove from the tin. Scatter over the\nremaining basil and serve in slices."
  ],
  "ingredients": [
    "0",
    "300g cherry tomatoes",
    "drizzle olive oil",
    "50g parmesan (or vegetarian alternative), grated",
    "2 eggs",
    "284ml pot double cream",
    "handful basil leaves, shredded, plus a few small ones left whole for scattering",
    "1",
    "280g plain flour, plus extra for dusting",
    "140g cold butter, cut into pieces"
  ],
  "__v": 1
}