{
  "__v": 1,
  "directions": [
    "0",
    "Innanzitutto dobbiamo preparare le crespelle. In una terrina rompo le uova ed inizio a sbatterle con un pizzico di sale. Bisogna aggiungere, sempre continuando a mescolare, sia il latte che la farina. Tu setacci la farina ed io verso il latte mentre mescolo? Ok! All’opera!",
    "La pastella è morbida e senza grumi. Ora aggiungiamo anche una noce di burro fusa, mescoliamo bene e lasciamo riposare per mezz’ora. Poi possiamo cuocere le crespelle.",
    "A quello ci pensi tu? Perfetto! Io intanto allora pulisco per benino i funghi. Li pulisci, li taglio a pezzettini e li cucino in una padella con due cucchiai d’olio, una noce di burro e un pizzico di sale.",
    "Adesso c’è da tagliare a dadi il prosciutto cotto e la fontina.",
    "Mentre tu inizi a farcire le crespelle, io metto la besciamella a scaldare in un pentolino e grattugio il parmigiano in scaglie.",
    "C’è da mettere una crespella su ogni piatto (usiamo piatti adatti ad essere infornati). Distribuiamo su ciascuna prosciutto e fontina in pari quantità e aggiungiamo i funghi cotti. Copriamo ogni crespella con un’altra crespella e adesso che la besciamella è calda, verso una mestolata di besciamella su ogni piatto. Ora puoi spargere sulla besciamella le scaglie di parmigiano. Ed ora…in forno! Sotto il grill per 5-10 minuti, finchè saran dorate e….tutti a tavola!",
    "A presto!"
  ],
  "firstAdded": "2014-10-12T14:22:01.333000",
  "hash": "89a2de8ba1681da1151292eb223cac6537d4e865",
  "href": "http://gattoghiotto.blogspot.it/2011/03/la-ricetta-della-porta-accanto-le.html",
  "image": "http://3.bp.blogspot.com/-cAN3K-BJoGo/TY-ND68NWhI/AAAAAAAADCc/mLOOrCqzmGA/s640/crespel2-ok.jpg",
  "ingredients": [
    "0",
    "Ecco cosa ci occorre:",
    "Per le crespelle:",
    "mezzo litro di latte",
    "20 cucchiai di farina",
    "2 uova",
    "una noce di burro",
    "sale",
    "Per farcire:",
    "100 grammi di funghi champignon",
    "120 grammi di prosciutto cotto in un’unica fetta",
    "80 grammi di fontina dolce",
    "80 grammi di besciamella",
    "parmigiano reggiano",
    "olio",
    "burro",
    "sale"
  ],
  "keywords": [
    "ecco",
    "cosa",
    "occorre",
    "crespelle",
    "mezzo",
    "litro",
    "latte",
    "cucchiai",
    "farina",
    "uova",
    "una",
    "noce",
    "burro",
    "sale",
    "farcire",
    "grammi",
    "funghi",
    "champignon",
    "prosciutto",
    "cotto",
    "ununica",
    "fetta",
    "fontina",
    "dolce",
    "besciamella",
    "parmigiano",
    "reggiano",
    "olio"
  ],
  "title": "La ricetta della porta accanto: Le crespelle ai funghi",
  "users": [
    null
  ]
}