{
  "hash": "4924f9d849c8cbdb6f5979e1ff7dc633ab88ea60",
  "title": "Eggs Benedict",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/ree-drummond/eggs-benedict-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-10-06T06:10:59.447000",
  "users": [
    null
  ],
  "keywords": [
    "egg",
    "yolks",
    "juice",
    "lemons",
    "butter",
    "slightly",
    "cooled",
    "salt",
    "cayenne",
    "pepper",
    "eggs",
    "english",
    "muffins",
    "split",
    "buttered",
    "slices",
    "canadian",
    "bacon",
    "warmed",
    "skillet",
    "paprika"
  ],
  "directions": [
    "0",
    "Add the egg yolks to a blender or a food processor. Add in the lemon juice and blend for several seconds. With the blender on, slowly drizzle in the melted butter. Turn off the blender and add in a little salt and cayenne. Whip it again until combined. Set this aside for a minute.",
    "Next, poach an egg by gently cracking an egg into simmering, slightly bubbling water.",
    "Leave the egg alone for 2 to 2 1/2 minutes, and then remove it with a slotted spoon and carefully place it on a plate. Repeat with the remaining eggs.",
    "To serve, place a buttered, toasted English muffin half on a plate. Top the English muffin with a warm slice of Canadian bacon. Place the warm poached egg on top. And then drizzle on some warm hollandaise. Sprinkle a little paprika on top.",
    "Food Network Kitchens suggest caution in consuming raw and lightly-cooked eggs due to the risk of Salmonella or other food-borne illness. To reduce this risk, we recommend you use only fresh, properly-refrigerated, clean, grade A or AA eggs with intact shells, and avoid contact between the yolks or whites and the shell. For recipes that call for eggs that are raw or undercooked when the dish is served use shell eggs that have been treated to destroy Salmonella, by pasteurization or another approved method.",
    "2012 Ree Drummond, All Rights Reserved"
  ],
  "ingredients": [
    "0",
    "3 egg yolks",
    "Juice of 2 whole lemons",
    "2 sticks butter, melted and slightly cooled",
    "Dash of salt",
    "Cayenne pepper",
    "4 whole eggs",
    "2 English muffins, split, toasted and buttered",
    "4 slices Canadian bacon, warmed in a skillet",
    "Dash of paprika"
  ],
  "__v": 1
}