{
  "hash": "aded4ab9ed479fa951b6749266fb67aa5aa9af95",
  "title": "DOUBLE CHEESE WHITE PIZZA QUINOA BAKE",
  "image": "http://withsaltandwit.com/wp-content/uploads/2014/10/32.jpg",
  "href": "http://withsaltandwit.com/white-pizza-quinoa-bake/",
  "extension": "Chrome",
  "firstAdded": "2017-07-03T22:45:56.402000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Preheat oven to 425 degrees F. Grease a 9x13 baking dish with cooking spray and set aside.",
    "Cook the quinoa according to package instructions, substituting the water for vegetable broth. When quinoa is finished cooking, remove from heat, fluff with a fork and add Italian Seasoning and salt. Stir. Cover quinoa and set aside.",
    "In a large sauté pan over medium heat, add butter and melt. Add flour and whisk until well combined. Whisk for 1-2 minutes until the roux gets a slight blonde color to it and smells nutty.",
    "In a blender, puree milk and cottage cheese until well blended and smooth.",
    "Add milk mixture to skillet and whisk until fully incorporated.",
    "Slowly whisk in 1/2 cup parmesan cheese and whisk until cheese is fully melted. Remove from heat. Add tomatoes, quinoa and cherry tomatoes. Fold in marinated mozzarella. Pour into prepared baking dish. Sprinkle evenly with remaining 1/2 cup parmesan cheese.",
    "Bake for 20 minutes. Let sit for 5 minutes then serve."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Report this ad",
    "2 cups uncooked quinoa, substituting water for vegetable broth",
    "2 tablespoons Italian Seasoning",
    "1 teaspoon sea salt",
    "1 teaspoon black pepper",
    "2 tablespoons butter",
    "3 tablespoons tapioca starch (or flour)",
    "1 1/2 cups almond milk (or milk of choice)",
    "1/2 cup low fat cottage cheese",
    "1 cup shredded parmesan",
    "1 cup marinated or fresh mozzarella, chopped small",
    "4 cups cherry tomatoes, chopped",
    "Chopped parsley or basil for garnish"
  ],
  "__v": 1
}