{
  "hash": "e18306d243d779ab4fb70e35412a24a9ddbd179f",
  "title": "Garlic-Rosemary Pull-Apart Dinner Rolls with Asiago Cheese",
  "image": "http://thecozyapron.com/wp-content/uploads/2014/11/garlic-rosemary-asiago-rolls_11-14-14_6_ca.jpg",
  "href": "http://thecozyapron.com/garlic-rosemary-pull-apart-dinner-rolls-with-asiago-cheese/",
  "extension": "Chrome",
  "firstAdded": "2017-02-18T21:38:44.274000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparation:",
    "-To prepare your dough, add the teaspoon of sugar to the warm water, and mix with a fork to dissolve; next, sprinkle the yeast over top in an even layer, and using the fork, gently mix to dissolve; allow the yeast mixture to sit for 10 minutes, until foamy.",
    "-While the yeast activates, add the milk, the butter, the sugar and the salt to a small sauce pan, and gently heat the mixture until the butter is melted; whisk to blend, and allow to slightly cool.",
    "-Next, add the milk/butter/sugar/salt mixture to a large bowl; add in the mashed potato and the eggs, and using a hand mixer, mix on low until well blended, about 1 minute.",
    "-Then, add in 2 cups of the flour and the chopped rosemary leaves, and mix on low until smooth.",
    "-Add in the yeast mixture, and mix that until well incorporated.",
    "-Now, using a wooden spoon, add in the rest of the flour, and stir to combine until a “shaggy” dough is formed.",
    "-Flour a work surface, and turn the dough out onto it; knead for about 4-6 minutes, adding a little more flour as needed, until the dough is smooth and elastic.",
    "-Spray a large bowl with cooking spray, place the dough into the bowl, and cover with plastic wrap; place the dough into a warm place (I usually put mine the microwave, or into a very lightly “warmed” oven that has been turned off) and allow for it to double in size, about 1 hour 20 minutes.",
    "-While the dough is rising, you can put together your filling; add the ¼ cup butter to a small, microwave-safe dish, and melt it; then, add in the pressed garlic, and stir with a fork to combine; cover with plastic wrap, and keep warm to keep it fluid (or you can reheat it in the microwave, if needed).",
    "-Line a baking sheet with parchment paper, and lightly mist it with cooking spray.",
    "-Once the dough has doubled, punch it down, and turn it out onto a floured work surface.",
    "-Roll the dough out into a rectangle shape, about ¼” thick (it will be fairly large); then, drizzle or brush onto the dough the “garlic butter”, reserving about 1 tablespoon of it to keep for brushing over the rolls before baking them.",
    "-Next, sprinkle over 2 cups of the grated asiago cheese as evenly as possible, and starting from the top, carefully and as tightly as possible, roll the dough towards yourself, and pinch the seam closed.",
    "-Next, cut the dough “log” in half for easier slicing of the rolls.",
    "-Then, cut about ¾” – 1” rolls from each of the log halves (shaping each individual roll with your hands if they need to be made tighter), and place onto your prepared baking sheet; place the rolls tightly against each other.",
    "-Next, cover the rolls with plastic wrap, and allow them to double in size, for about 40-45 minutes.",
    "-During the last 15 minutes, preheat your oven to 350°.",
    "-Brush the rolls very lightly with the remaining tablespoon of garlic butter, and sprinkle over the remaining ½ cup of asiago; bake for about 24-28 minutes, or until a pale golden color, and serve warm. (You can even brush a bit more butter over them before serving.)"
  ],
  "ingredients": [
    "0",
    "Dough Ingredients:",
    "• ¼ cup warm water (110°)",
    "• 1 teaspoon granulated sugar",
    "• 1 (¼ ounce) packet active dry yeast",
    "• 1 cup whole milk",
    "• ½ cup unsalted butter",
    "• ¼ cup granulated sugar",
    "• 2 teaspoons salt",
    "• ½ cup mashed potato (*see note below)",
    "• 2 large eggs, beaten",
    "• 4 ½ cups all-purpose flour, plus more for kneading",
    "• 1 ½ tablespoons chopped, fresh rosemary leaves",
    "Filling Ingredients:",
    "• ¼ cup unsalted butter",
    "• 3 cloves garlic, pressed through garlic press",
    "• 2 ½ cups grated asiago cheese, divided use",
    "(*The addition of the mashed potato makes for a fluffier roll; you can simply prick a medium-size russet potato a few time with a fork, and place it into the microwave to cook for a few minutes; once tender, cool slightly, and scoop out the flesh and pass it through a ricer, or mash very well until lump-free.)"
  ],
  "__v": 1
}