{
  "hash": "1b2993fba952916a5a1833e04b5fae98d129356e",
  "title": "HOMEMADE PEPPERMINT PATTIES",
  "image": "http://butterwithasideofbread.com/wp-content/uploads/2016/10/Homemade-Peppermint-Patties.BSB_.IMG_5296-600x490.jpg",
  "href": "http://butterwithasideofbread.com/2016/10/homemade-peppermint-patties/",
  "extension": "Chrome",
  "firstAdded": "2017-05-06T22:46:49.428000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine butter, corn syrup, extract and powdered sugar in a mixing bowl. Mix with an electric mixer for about 3 minutes, until ingredients are well combined and are holding together.",
    "Remove dough from bowl and break off about 2 teaspoon-sized sections. Roll into a ball and gently flatten with your hands. Put patties down on a pan lined with wax or parchment paper. Once all patties are made, place pan in the freezer for 10-15 minutes.",
    "Melt chocolate in microwave for 1 minute 20 seconds. Let sit for an additional minute in the microwave. Remove and gently stir. Remove peppermint patties from freezer. Use a fork or a handy Winton Dipping tool like I did to dip each patty in the chocolate, flip to coat the other side, then tap to remove any excess. Transfer chocolate coated patties to wax paper to cool. Top with chocolate jimmies if you'd like.",
    "Store in an airtight container, refrigerate if preferred but it's not necessary. Yields 40 mints.",
    "*Add 1 teaspoon peppermint extract, then mix until well combined. Taste dough. If you'd like them to be stronger, add an additional ½ to 1 teaspoon extract. You can also use 2 drops of peppermint essential oil instead or even 2 teaspoons mint extract for a more subtle mint flavor. Think Andes Mints as opposed to Starlight mints! Yum.",
    "**When making candy like this I really find that dipping chocolate just works best. You can purchase Ghirardelli Melting Wafers at most grocery stores. I buy my melting chocolate in bulk on Amazon. If you really want to use chocolate chips instead, I suggest melting ½ a tablespoon of shortening or 2 tsp coconut oil in with the chocolate chips, to thin it out and make it easier to dip the candy."
  ],
  "ingredients": [
    "0",
    "¼ cup softened butter",
    "⅓ cup light corn syrup",
    "1-2 tsp peppermint extract*",
    "3 cups powdered sugar",
    "2 cups dark dipping chocolate**",
    "chocolate jimmies, if desired"
  ],
  "__v": 1
}