{
  "hash": "d6f7ead71952b175d29b84240adc198cdb50f71d",
  "title": "Sweet Potato and Black Bean Tacos",
  "image": "",
  "href": "https://cookieandkate.com/2016/sweet-potato-black-bean-tacos/",
  "extension": "Chrome",
  "firstAdded": "2017-11-06T23:11:38.970000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Roast the sweet potatoes: Preheat the oven to 425 degrees Fahrenheit and line a large, rimmed baking sheet with parchment paper for easy clean-up. Toss the prepared sweet potatoes with the olive oil, cayenne pepper (if using) and salt. Arrange in a single layer and bake for 30 to 40 minutes, tossing halfway, until the sweet potatoes are tender and caramelizing at the edges.",
    "Prepare the black beans: Warm the olive oil in a large saucepan over medium heat. Add the onions and a sprinkle of salt. Cook, stirring occasionally, until the onions have softened and are turning translucent, about 5 to 8 minutes. Add the cumin and chili powder and cook for about 30 seconds while stirring. Pour in the beans and water. Stir, cover and reduce heat to maintain a gentle simmer.",
    "Cook for 5 minutes, then remove the lid and use a potato masher or a fork to mash up at least half of the beans. Remove from heat, stir in the vinegar, season with salt (I added over ¼ teaspoon) and pepper, and cover until you’re ready to serve.",
    "Make the avocado dip: First, toast the pepitas in a skillet over medium heat, stirring often, until they are fragrant and starting to make little popping noises, about 5 minutes. Transfer to a bowl and set aside.",
    "Scoop the avocado flesh into a food processor or blender. Add the cilantro, jalapeño, garlic, lime juice, water and salt. Blend until smooth, scraping down the sides of the processor/blender as necessary. Add almost all of the pepitas (reserve a few tablespoons for garnish) and process just until the pepitas are chopped into small pieces (some remaining texture is desirable). Taste, and add more salt if necessary. Transfer the dip to a small bowl for serving.",
    "To warm the tortillas, heat a large skillet over medium heat and warm the tortillas in batches, flipping to warm each side. Alternatively, you can warm them directly over a low flame on a gas range. Stack the warmed tortillas on a plate and cover with a tea towel to keep warm.",
    "To assemble the tacos, spread black beans down the middle of each tortilla, then top with some sweet potatoes and avocado-pepita dip. Garnish with feta, pepitas, and anything else that strikes your fancy. Repeat with remaining tortillas and serve."
  ],
  "ingredients": [
    "0",
    "Roasted sweet potatoes",
    "2 pounds sweet potatoes (3 to 4 medium sweet potatoes), peeled and sliced into 1-inch chunks",
    "2 tablespoons olive oil",
    "¼ teaspoon cayenne pepper (omit if sensitive to spice)",
    "¼ teaspoon fine sea salt",
    "Spicy black beans",
    "1 tablespoon olive oil",
    "1 small yellow or white onion, finely chopped",
    "Fine sea salt",
    "2 teaspoons ground cumin",
    "¼ teaspoon chili powder",
    "2 cans black beans, rinsed and drained (or 3 cups cooked black beans)",
    "⅓ cup water",
    "1 teaspoon sherry vinegar or lime juice",
    "Freshly ground black pepper, to taste",
    "Avocado-pepita dip",
    "2 avocados, pitted",
    "1 cup lightly packed fresh cilantro (mostly leaves, some small stems are ok)",
    "½ cup pepitas",
    "1 small jalapeño, seeded and roughly chopped, or ¼ teaspoon red pepper flakes (go easy if sensitive to spice)",
    "2 cloves garlic, roughly chopped",
    "2 tablespoons lime juice (about 1 medium lime) or 1 tablespoon sherry vinegar",
    "2 tablespoons water",
    "½ teaspoon fine grain sea salt",
    "Freshly ground black pepper, to taste",
    "Everything else",
    "8 to 10 small corn tortillas",
    "Crumbled feta",
    "Suggested garnishes: Pickled jalapeños or pickled radishes or pickled red onions, torn cilantro, hot sauce, etc."
  ],
  "__v": 1
}