{
  "hash": "8b6057570e434089eacb6bdf029f2d8d7beaa4e0",
  "title": "Twice Baked Potato Casserole...a Family Favorite!",
  "image": "http://3.bp.blogspot.com/-peTpxGle2FA/VI-JZqxvRMI/AAAAAAAARKk/Pws_Wk90T2Q/s280/Twice%2Bbaked%2Bpotato%2Bcasserole%2Bedited.jpg",
  "href": "http://sweetteaandcornbread.blogspot.com/2012/06/twice-baked-potato-casserolea-family.html?m=1",
  "extension": "Chrome",
  "firstAdded": "2016-01-13T21:27:47.379000",
  "users": [
    null
  ],
  "keywords": [
    "potatoes",
    "cream",
    "cheese",
    "tbs",
    "butter",
    "cheddar",
    "buttermilk",
    "sour",
    "parmesan",
    "real",
    "bits",
    "strips",
    "crisp",
    "fried",
    "bacon",
    "pkg",
    "dry",
    "ranch",
    "dressing",
    "salt",
    "water",
    "tspblack",
    "pepper",
    "tspseasoned"
  ],
  "directions": [
    "0",
    "If you want a lighter, lower fat version of this, you can use margarine instead of butter, light cream cheese, low fat buttermilk, and fat free plain Greek yogurt for the sour cream.",
    "Peel and cut the potatoes in large chunks. You don't have to dice these small because you will be smashing them anyway. Salt your boiling water (as you would for pasta) and bring to a boil, turn down to simmer until fork tender. Drain the potatoes in a colander well. I use my cast iron so I can cook the potatoes, mash and mix and return to the pan to finish in the oven. You can put them in a casserole dish to bake also and for company, I usually do.",
    "Place the drained potatoes back in the warm pan, but not on the hot burner or they will scorch on the bottom. Have you ever scorched potatoes in the pan? It's a mess! Add the cream cheese and the butter. Place the cover back on the pan and leave it for about 10 or 15 minutes. The cream cheese and the butter will soften and melt and make it really easy to mash the potatoes. Using a good old fashioned potato masher, mash the potatoes, cream cheese and butter up a little. Don't over mash at this point, you still have good things to add.",
    "Add the sour cream and buttermilk and mash some more. I like to leave mine with a some chunks in them, but if you prefer you can mash them smooth.",
    "Add the ranch dressing mix, black pepper, and seasoned salt and stir. Fold in the bacon bits, half of the cheddar cheese and the Parmesan cheese.",
    "Smooth the mixture down and sprinkle the rest of the cheddar cheese on top. I sometimes also put a little of the bacon on top. If you are baking in a casserole dish, you will need a two quart dish sprayed with cooking spray. Place in a preheated 350 degree oven for 25 -30 minutes or until the cheese is melted and just starting to brown.",
    "It should be hot and bubbly when you remove it from the oven. You can garnish the top with some more bacon, chives or sliced green onions at this point."
  ],
  "ingredients": [
    "0",
    "6 large potatoes (7 or 8 if they are on the small side)",
    "4 oz. cream cheese",
    "2 Tbs. butter",
    "2 cups shredded cheddar cheese",
    "1/4 cup buttermilk",
    "1/4 cup sour cream",
    "1/2 cup Parmesan cheese",
    "1/2 cup real bacon bits or 5 strips of crisp fried bacon",
    "1 pkg. dry ranch dressing mix",
    "1 tsp salt (to salt the water the potatoes are cooked in)",
    "1/2 tsp.black pepper",
    "1/2 tsp.seasoned salt"
  ],
  "__v": 1
}