{
  "hash": "772d2a649a37541380127febc3562a5528dfa64c",
  "title": "Deadpool Pizza",
  "image": "",
  "href": "http://recipe-folder.com/recipe/5b7731c83d946d7ece1c64c9",
  "extension": "User Added",
  "firstAdded": "2018-08-17T20:36:24.276000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Start by measuring out 250 grams each of bread flour and 00 Italian flour followed by 2 tsp of active yeast and whisk together.",
    "1",
    "Add 8 grams of kosher salt, and again whisk together.",
    "2",
    "Add exactly 325 mL of tap water (Creating a 60% hydration dough).",
    "3",
    "Using a wooden spoon, mix together until a shaggy ball forms. At this point, bravely pour out onto an un-floured countertop.",
    "4",
    "Get to kneading until the dough has formed into a semi-smooth mass. Try to resist adding flour or water, if you can. If it’s too sticky, try the slap and fold method. If it’s too dry, just keep working it. Knead it until no more dry clumps of flour remain.",
    "5",
    "Ferment at room temperature for 8-24 hours. Lightly oil a nice big bowl because this will double in size. Drop the dough into the bowl, cover and let sit for 8-24 hours (my crust sat for 12 hours).",
    "6",
    "Once finished fermenting, oil a few proofing bowls with olive or vegetable oil.",
    "7",
    "Then scrape your dough out onto a generously oiled countertop (make sure the countertop is oiled, or the dough will stick!). Make sure that your hands are also generously oiled or the dough will stick to your hands.",
    "8",
    "Knead a little bit to get some of the dough out and then divide into 4 pieces for its long cold proof in the fridge.",
    "9",
    "Form the four pieces into balls by taking the top and tucking underneath to form a nice smooth ball.",
    "10",
    "Top each ball of dough with oil and then cover with plastic before placing into the fridge for 3 whole days.",
    "11",
    "Once the dough has risen, scrape out onto a generously floured countertop, flattening out into a nice circle, and rolling out via wine/whiskey bottle or roller.",
    "12",
    "Use your knuckles, turning hand over hand, until the dough has been stretched out - leaving a little extra dough on the outside to form our crust.",
    "13",
    "Sprinkle corn flour or semolina flour down on pizza peel, then place the crust on top. This will help the pizza roll around freely, allowing us to easily slide it off the pizza steel.",
    "14",
    "Build the pizza by spreading tomato sauce on top, followed by a healthy layer of freshly shredded mozzarella cheese (don’t use pre-shredded mozzarella. It is coated in potato starch and will result in nasty, not even melted mozzarella cheese).",
    "15",
    "Evenly spread out the freshly sliced olives and pineapple.",
    "16",
    "Top with a little freshly shredded parmesan cheese to keep the toppings in place.",
    "17",
    "Preheat the oven to 550°F for 1 hour.",
    "18",
    "Place the pizza peel with pizza into the oven and let the pizza cook for 8 minutes."
  ],
  "ingredients": [
    "0",
    "250g bread flour",
    "1",
    "250g 00 Italian Flour",
    "2",
    "2 tsp active yeast",
    "3",
    "8g kosher salt",
    "4",
    "325 mL water",
    "5",
    "Vegetable or olive oil"
  ],
  "__v": 1,
  "hidden": true
}