{
  "hash": "ddf4d97ed07d9846dbd139b80a4de73db331140b",
  "title": "Homemade Cauliflower Breadstick Recipe",
  "image": "http://organichealth.co/wp-content/uploads/2015/05/admin-ajax-7.jpg",
  "href": "http://organichealth.co/homemade-cauliflower-breadstick-recipe/",
  "extension": "Chrome",
  "firstAdded": "2015-05-16T08:05:49.333000",
  "users": [
    null
  ],
  "keywords": [
    "italian",
    "seasoning",
    "basil",
    "eggs",
    "slightly",
    "marinara",
    "dipping",
    "cauliflower",
    "rice",
    "mozzarella",
    "cheese",
    "course",
    "oregano",
    "salt"
  ],
  "directions": [
    "0",
    "As mentioned n the ingredients, you will need eight cups of cauliflower ”rice.” To have the cauliflower “rice”, you will need to make it out of two heads of cauliflower.",
    "Wash the cauliflower, remove the core, and slice it into chunks.",
    "Using a food processor blend the cauliflower pieces until they have a rice-like texture.",
    "Now you have your “rice.”",
    "Using a vast saucepan heat about two inches of water until it begins to boil.",
    "Add the “rice” and put a lid over the pan allowing it to steam for at least five to seven minutes.",
    "Preheat your oven to 400 degrees F.",
    "After steaming the “rice” dump it into a large bowl add two cups of mozzarella to the ”rice.” Mix well.",
    "Then add the eggs, oregano, and salt.",
    "Stir the mixture as well as possible.",
    "Spread the mixture out evenly onto a baking sheet and place it in the oven for about an hour.",
    "Unless you notice, the crust being golden brown before then.",
    "Allow the brad sticks to cool once removed from the oven.",
    "Apply the remaining mozzarella and the Italian seasoning to the top of the bread sticks",
    "Put the baking sheet back into the oven just ling enough for the cheese to melt the cheese and serve with marinara dipping sauce.",
    "Now you have a tasty, healthy, and unique treat!"
  ],
  "ingredients": [
    "0",
    "ne teaspoon of Italian Seasoning",
    "Two teaspoons of dried basil",
    "Two eggs that have been beaten (slightly)",
    "Marinara dipping sauce",
    "8 cups of cauliflower “rice.”",
    "4 cups of mozzarella cheese shredded of course.",
    "Two teaspoons of dried oregano",
    "1/2 teaspoon of salt"
  ],
  "__v": 1
}