{
  "hash": "49372b8687a41cb0aafdc8a15087a7b47699a86c",
  "title": "Ruskie pierogi ze Lwowa",
  "image": "//static.smaker.pl/photos//a/5/7/a579f137c26f3d8c764b4c9c0f762a68_350177_5644870d003f3_wm.jpg",
  "href": "http://smaker.pl/przepis-ruskie-pierogi-ze-lwowa,114791,futka.html",
  "extension": "",
  "firstAdded": "2016-09-16T22:11:56.744000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Przygotowanie",
    "Ziemniaki gotujemy w lekko osolonej wodzie i studzimy. Pokrojoną cebulkę szklimy na maśle i również studzimy. Po ostudzeniu mielimy oba składniki wraz z białym serem w maszynce do mięsa, mieszamy oraz doprawiamy do smaku solą i świeżo zmielonym pieprzem.",
    "Farsz przygotowujemy dzień wcześniej, a przez noc schładzamy go w lodówce - wtedy będzie najsmaczniejszy. Dawniej farsz leżakował przez noc w zimnej piwnicy lub spiżarce.",
    "Na stolnicę przesiewamy mąkę, dodajemy jajko, miękkie masło oraz gorącą wodę i zagniatamy ciasto przez około 20 - 25 minut.",
    "Długi czas wyrabiania sprawi, że ciasto będzie elastyczne, delikatne i aksamitnie gładkie. Ogromną zaletą tego ciasta jest to, że nie wysycha podczas lepienia.",
    "Ciasto rozwałkowujemy na cienki placek i wycinamy koła za pomocą szklanki.",
    "Na każdy kawałek ciasta nakładamy solidną porcję farszu i lepimy pierożki, które układamy na lnianej ściereczce.",
    "Pierożki wrzucamy partiami na osolony wrzątek z dodatkiem łyżeczki masła i gotujemy około 5 minut od momentu ich wypłynięcia na powierzchnię. Gotowe pierożki odcedzamy za pomocą łyżki cedzakowej i odstawiamy, aby obciekły z wody.",
    "Pierożki podajemy otulone zeszkloną cebulką - koniecznie na maśle! Smak całości dopieści kleks gęstej śmietany ;)"
  ],
  "ingredients": [
    "0",
    "Pierogi ruskie to klasyka polskiej kuchni. Każdy ma swój sposób na ich przygotowanie i każde smakują inaczej. Mój Mąż zawsze mile wspomina kuchnię Babci Janci, która robiła niepowtarzalne w smaku pierogi. Śmiało mogę potwierdzić, że były one wyśmienite i jedyne w swoim rodzaju. Niestety o przepis i sposób przygotowania nie mogłam już jej zapytać, ale postanowiłam przeszukać stare kulinarne zapiski i znalazłam przepis na ruskie pierogi przywieziony ze Lwowa, które przygotowywała Babcia. Skład ciasta jest zupełnie inny od tego, które ja przygotowuję na co dzień, ale było warto! Ciasto jest elastyczne, delikatne i niezwykle smakowite. Całość otula maślana nuta i wypełnia smakowity farsz. Serdecznie polecam, w szczególności z kleksem gęstej śmietany :)",
    "Składniki",
    "CIASTO:",
    "500 g mąki pszennej",
    "1 jajko",
    "1 szklanka gorącej wody",
    "50 g miękkiego masła",
    "1 płaska łyżeczka soli",
    "FARSZ:",
    "800 g obranych ziemniaków",
    "300 g białego twarogu",
    "1 cebula biała",
    "masło (do smażenia)",
    "sól i pieprz",
    "OKRASA:",
    "cebula biała",
    "masło"
  ],
  "__v": 1
}