{
  "hash": "cb897afed602f48532f0e6d910f7bb2b6255c161",
  "title": "Vegan Cornbread (Gluten-Free",
  "image": "https://cmt.azureedge.net/media/vegan_cornbread_gluten_free_20180827205805800288a1zas.jpg",
  "href": "https://www.copymethat.com/r/iaDFJWd/vegan-cornbread-gluten-free/",
  "extension": "",
  "firstAdded": "2018-12-29T00:12:23.204000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350 °F (175 °C) and line a muffin pan with 12 muffin liners or line an 8\" x 8\" pan with a piece of parchment paper.",
    "Pour the milk in a large mixing bowl, add the apple cider vinegar, and give it a few stirs. Let sit for 5 minutes while preparing the dry ingredients.",
    "In a medium mixing bowl, stir together all the dry ingredients. Set aside.",
    "To the milk mixture, add the melted coconut oil, sugar and vanilla and stir until well combined.",
    "Add the dry mixture and stir just until combined.",
    "Pour into the prepared pan. Bake muffins for 12 minutes and bread for 20 minutes. A toothpick inserted in the middle should come out with a few moist crumbs but no wet batter.",
    "Let the muffins cool for 5 minutes in the pan and then remove to a wire rack to cool completely. The bread can be eaten immediately but will be very difficult to cut – it's better to wait for 2-3 hours until it's firmed up just a little.",
    "Store any leftovers in an airtight container for up to 3 days."
  ],
  "ingredients": [
    "0",
    "Wet ingredients:",
    "1 cup (240 ml) milk of choice, room temperature or warm (this is important so that the coconut oil doesn't harden once added) 1",
    "2 teaspoons apple cider vinegar",
    "1/3 cup (75 g) coconut oil, melted 2",
    "1/2 cup (100 g) raw or granulated sugar",
    "1/2 teaspoon vanilla",
    "Dry ingredients:",
    "2/3 cup (88 g) medium grind gluten-free cornmeal (non-GF cornmeal works, too)",
    "1 1/3 cup (123 g) oat flour (use certified gluten-free, if necessary) 3",
    "3/4 teaspoon salt",
    "2 1/2 teaspoons baking powder",
    "1/2 teaspoon baking soda"
  ],
  "__v": 1
}