{
  "__v": 1,
  "directions": [
    "0",
    "Il riso va preparato con qualche ora d'anticipo, perché al momento della preparazione delle arancine dev'essere ben freddo.",
    "Preparare il brodo vegetale con gli aromi. Una volta pronto, rimuovere la carota, il sedano e la cipolla di cottura e sciogliere lo zafferano nel brodo (a causa delle contaminazioni milanesi io ho messo lo zafferano direttamente nel riso, al termine della cottura - Nota di Mapi). Regolare di sale.",
    "In un tegame capiente, dare un giro abbondante di olio extravergine di oliva (io ho fatto metà olio e metà burro, sempre per le contaminazioni milanesi che vogliono il risotto preparato esclusivamente con il burro - nota di Mapi) e fare appassire la cipolla tagliata finemente. Versare il riso e fare tostare un pochino. Versare nel tegame buona parte del brodo, non tutto in modo da poterne aggiungere all'occorrenza regolandosi in funzione del tipo di riso e della sua cottura.",
    "Fermare la cottura quando il riso sarà al dente (meglio 12 minuti che 14, nota di Mapi) e si presenterà piuttosto compatto (ovvero non dev'essere cremoso come un tipico buon risotto!). Immergere il tegame nel lavello riempito d'acqua fredda (evitando che l'acqua entri all'interno) e mantecare con il burro e il parmigiano grattugiato. Se serve, per abbattere la temperatura ed evitare che il riso continui a cuocere, rinnovare l'acqua fredda dentro il lavello.",
    "Una volta tiepido, versare il riso dentro una teglia e lasciare da parte affinché raffreddi completamente. Poi coprire con carta d'alluminio e conservare in frigorifero per almeno 3-4 ore.",
    "Anche il ragù è bene prepararlo in anticipo, sia per comodità sia perché anch'esso dovrà essere freddo al momento della preparazione delle arancine.",
    "In un po' di cipolla tagliata finemente e fatta appassire in olio extravergine di oliva, versare i pisellini, coprire con un po' d'acqua, salare e cuocere per una decina di minuti o comunque il necessario (devono essere cotti ma non scotti). Scolare e tenere da parte.",
    "Tagliare finemente, o tritare al mixer, la carota, la cipolla e il sedano. Insieme alla foglia d'alloro, fare rosolare gli aromi tritati in un giro d'olio extravergine di oliva dentro un tegame.",
    "Aggiungere le due carni e farle rosolare, sgranandole nel frattempo con un cucchiaio di legno perché la grana risulti fine. Sfumare con il vino bianco. Lasciare evaporare i liquidi e quindi aggiungere la polpa di pomodoro e il concentrato di pomodoro sciolto nell'acqua. Salare e fare cuocere a fiamma bassa per circa mezz'ora, o comunque fino ad ottenere un ragù piuttosto asciutto.",
    "Togliere dal fuoco e lasciare intiepidire. Aggiungere i piselli, mescolare delicatamente e lasciare raffreddare il tutto.Per il condimento \"al burro\", preparare una besciamella vellutata e non troppo densa (e con il giusto grado di sale, anche questo servirà a dare sapore al ripieno) e lasciare raffreddare.",
    "Una volta fredda, aggiungere il prosciutto e la scamorza tagliati a tocchetti piccoli e amalgamare. Se l'avete previsto, aggiungete anche il prezzemolo.",
    "FATTO TUTTO QUESTO…. SI PARTE!",
    "Prima di tutto disporre a portata di mano tutti gli ingredienti necessari e attrezzarsi di vassoi, teglie, scodelle…. la preparazione delle arancine è una specie di catena di montaggio (bella in compagnia!) che diventa più piacevole, o comunque meno stressante, se preventivamente organizzata.",
    "Cominciare dalla preparazione della \"lega\". Si tratta della pastella di acqua e farina che serve a sigillare l'arancina e a creare una base per la panatura con il pangrattato che aiuterà a conferire doratura, spessore e croccantezza al punto giusto. Versare l'acqua in una scodella profonda, aggiungere la farina, una bella manciata di sale e amalgamare bene con una frusta. Tenere da parte e passare alla creazione delle arancine.",
    "Ci sono vari modi per formare e farcire le arancine, questo secondo me è il procedimento più semplice anche per chi le fa per la prima volta ed è anche quello che consente di organizzare e distribuire meglio il lavoro.In pratica bisogna prima fare tutte le sfere o gli ovali, poi fare il buco, poi farcirle. Premesso che le arancine possono essere enormi, normali e mignon, con una mano prendete un po' di riso in base alla grandezza dell'arancina che desiderate. Poi, girando con tutte e due le mani, formate una palla se volete farle alla carne, oppure date una forma ovale se volete farle al burro. Se volete farle miste, conviene comunque procedere facendole prima tutte in un modo e poi nell'altro.",
    "Posate la \"futura\" arancina su un vassoio e ricominciate fino a terminare il riso. Lasciatele riposare per una mezz'ora, in modo che raffreddino (anche se il riso era freddo di frigo, col calore delle mani si saranno un po' scaldate) e che il riso si compatti rendendo poi più facile la farcitura.",
    "Tenendo la palla di riso con una mano, con il pollice dell'altra mano create un buco in alto e al centro e cominciate ad allargarlo spingendo sia verso il basso che sui lati. Posate nuovamente la palla di riso sul vassoio e passate alle altre, fino a completarle tutte.",
    "Se prevedete di fare anche quelle ovali, procedete con queste prima di passare al ripieno delle precedenti. In questo caso, con il pollice occorre fare una pressione al centro per lungo, spingendo anche in questo caso verso il basso e sui lati.",
    "A questo punto passare alla farcitura. Anche in questo caso, se le prevedete di due tipi, procedere prima con tutte quelle di un tipo poi con tutte quelle dell'altro tipo.",
    "Con la punta delle dita prendere un po' di ragù con i piselli e inserirle all'interno del buco precedentemente creato.",
    "Poi chiudere l'arancina: un po' spingendo il condimento verso il basso, e un po' cercando di portare in avanti il riso per chiudere l'arancina. Girare l'arancina tra le mani per darle la forma e per rendere la superficie liscia e compatta, senza buchi o piccole fessure. Posare l'arancina con il ripieno sul vassoio e passare ad un'altra, fino a completarle tutte.",
    "Al termine, lavare le mani e ripetere l'operazione con un eventuale secondo ripieno.",
    "Quando tutte le arancine saranno pronte sul vassoio, passare alla \"lega\". Dare qualche colpo di frusta alla pastella per riprendere l'amalgama di acqua e farina e a questo punto immergere singolarmente le arancine dentro la lega, poggiandole poi sul vassoio, fino al completamento dell'operazione per tutte le arancine. Io preferisco separare lega e panatura per fare in modo che la lega scoli un pochino dall'arancina al vassoio e non finisca a fiotti dentro il pangrattato. Scolando, tra l'altro, la lega resta uno strato sottile, sottile sarà la panatura e sottile e croccante sarà la crosticina finale. Naturalmente la lega non deve asciugare troppo, quindi se si devono fare tantissime arancine magari è il caso di prevedere più step di lega-panatura.",
    "E ora la panatura. Versare il pangrattato dentro una teglia e, ad una ad una, passare ogni singola arancina dentro il pangrattato, pressandole bene con le mani per \"saldare\" bene lega e pangrattato, per rendere compatta la superficie delle arancine e, all'occorrenza, per riprenderne un pochino la forma.E finalmente la frittura!",
    "Versare l'olio in una friggitrice o in un tegame piuttosto alto. Quando l'olio sarà ben-ben-ben caldo (io ho preso il mio fido termometro e ho atteso che l'olio raggiungesse la temperatura di 200 °C - nota di Mapi), immergere le arancine per 2-3 minuti o comunque fino a quando non risulteranno dorate in superficie.E a questo punto la \"manciata\"!…",
    "...servire e mangiare calde!Visto che si tratta di un bel lavorone di preparazione, c'è chi quando ci si mette-ci si mette, ne prepara un bel po' e in parte le congela. Non lo so per esperienza diretta perché finora le abbiamo sbafate tutte subito, ma chi ha provato mi ha riferito di averle messe in freezer non ancora fritte dentro un contenitore, di averle tirate fuori all'occorrenza con qualche ora d'anticipo per farle scongelare completamente e poi di averle fritte. Pare che il risultato sia ottimo."
  ],
  "firstAdded": "2014-10-09T19:41:16.778000",
  "hash": "9e659ba76424f385a2b714753c52895bc7bd651e",
  "href": "http://laapplepiedimarypie.blogspot.it/2012/11/arancine-palermitane-classiche-alla.html",
  "image": "http://i298.photobucket.com/albums/mm257/Marellla/1%20Blog%20dal%2017%20sett%202012/Arancine%20classiche/7868.jpg",
  "ingredients": [
    "0",
    "Per il riso",
    "1 kg di riso originario (alcuni usano il Roma)",
    "2,5 l circa di brodo vegetale (con carota, cipolla, sedano)",
    "una bustina di zafferano",
    "50 g di burro",
    "50 g di parmigiano grattugiato",
    "una cipolla medio-piccola",
    "olio extravergine di oliva q.b.",
    "sale q.b.",
    "Per il ripieno \"al burro\" con prosciutto cotto, scamorza bianca e besciamella (per circa 9 arancine)",
    "80 g di prosciutto cotto in una fetta sola e di buona qualità (io di coscia e senza conservanti)",
    "120 g di scamorza bianca",
    "150 ml di latte + 15 g di farina + 10 g di burro + sale q.b. per la besciamella",
    "prezzemolo q.b. (opzionale, qui non c'è)",
    "Per il ripieno \"alla carne\" con ragù e piselli (per circa 9 arancine)",
    "100 g di macinato di vitello (2° taglio)",
    "100 g di macinato di maiale",
    "100 g piselli freschi o surgelati, ma al netto delle bucce",
    "180 g di polpa di pomodoro",
    "un cucchiaio scarso di concentrato di pomodoro + tre dita d'acqua in un bicchiere",
    "una cipolla piccola, una carota, un gambetto di sedano, una foglia d'alloro",
    "1/2 bicchiere circa di vino bianco per sfumare",
    "olio extravergine di oliva q.b.",
    "sale q.b.",
    "Per la lega (ne resterà molta, ma occorre poter immergere bene l'arancina)",
    "800-900 ml d'acqua",
    "400-450 g di farina 00",
    "una manciata di sale",
    "(io ho usato 300 g di farina, 600 ml d'acqua e una bella presa di sale e mi è avanzata ancora molta lega - Nota di Mapi)",
    "Per la panatura (ne resterà molto anche qui)",
    "700-800 g di pangrattato (io ne ho usati 500 g e me ne è avanzato moltissimo - Nota di Mapi)",
    "Per la frittura",
    "3 l di olio di semi di mais (o comunque abbondante per poter friggere in olio profondo)"
  ],
  "keywords": [
    "riso",
    "originario",
    "alcuni",
    "usano",
    "roma",
    "circa",
    "brodo",
    "vegetale",
    "carota",
    "cipolla",
    "sedano",
    "una",
    "bustina",
    "zafferano",
    "burro",
    "parmigiano",
    "grattugiato",
    "mediopiccola",
    "olio",
    "extravergine",
    "oliva",
    "sale",
    "ripieno",
    "prosciutto",
    "cotto",
    "scamorza",
    "bianca",
    "besciamella",
    "arancine",
    "fetta",
    "sola",
    "buona",
    "qualit",
    "coscia",
    "senza",
    "conservanti",
    "latte",
    "farina",
    "prezzemolo",
    "opzionale",
    "qui",
    "non",
    "alla",
    "carne",
    "rag",
    "piselli",
    "macinato",
    "vitello",
    "taglio",
    "maiale",
    "freschi",
    "surgelati",
    "netto",
    "delle",
    "bucce",
    "polpa",
    "pomodoro",
    "cucchiaio",
    "scarso",
    "concentrato",
    "tre",
    "dita",
    "dacqua",
    "bicchiere",
    "piccola",
    "gambetto",
    "foglia",
    "dalloro",
    "vino",
    "bianco",
    "sfumare",
    "lega",
    "rester",
    "molta",
    "occorre",
    "poter",
    "immergere",
    "bene",
    "larancina",
    "manciata",
    "usato",
    "bella",
    "presa",
    "avanzata",
    "ancora",
    "nota",
    "mapi",
    "panatura",
    "molto",
    "anche",
    "pangrattato",
    "usati",
    "avanzato",
    "moltissimo",
    "frittura",
    "semi",
    "mais",
    "comunque",
    "abbondante",
    "friggere",
    "profondo"
  ],
  "title": "Arancine palermitane classiche: alla carne",
  "users": [
    null
  ]
}