{
  "hash": "acff6256555f71e13d22bc6eb7450b942a42de05",
  "title": "30-MINUTE CASHEW ALFREDO",
  "image": "https://minimalistbaker.com/wp-content/uploads/2017/08/30-Minute-Cashew-Alfredo-SQUARE.jpg",
  "href": "https://minimalistbaker.com/30-minute-cashew-alfredo/",
  "extension": "",
  "firstAdded": "2017-12-16T00:01:09.943000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Soak cashews in very hot water for 20 minutes. Then drain and add to a high-speed blender.",
    "To blender, also add arrowroot starch (for thickening), nutritional yeast, garlic, sea salt, vegan parmesan cheese, and 1 cup (240 ml) unsweetened dairy-free milk.",
    "Blend on high until creamy and smooth, scraping down sides as needed. Taste and adjust flavor as needed, adding more garlic for kick/zing, nutritional yeast or vegan parmesan cheese for cheesy flavor, salt for saltiness, or dairy-free milk if too thick.",
    "Transfer to a rimmed skillet and cook over medium-low to medium heat for 5 minutes, whisking frequently. The sauce should thicken and bubble. Add more dairy-free milk as needed to thin (I typically add up to 1/2 - 1 cup (120-240ml) more). Then it's ready to serve!",
    "Enjoy with zucchini noodles or your favorite pasta. It could even be enjoyed layered in lasagna! Top with additional Vegan Parmesan Cheese and Roasted Tomatoes for more flavor.",
    "Notes",
    "*Nutrition information is a rough estimate for 1 of 6 (1/4 cup) servings calculated without additional toppings / garnishes or pasta."
  ],
  "ingredients": [
    "0",
    "ngredients",
    "ALFREDO",
    "1 1/4 cups (150 g) raw cashews, soaked",
    "optional: 1 Tbsp (7 g) arrowroot starch",
    "3-4 Tbsp (9-12 g) nutritional yeast",
    "2-3 cloves garlic, crushed (~1 1/2 Tbsp or 9g)",
    "1/2 tsp sea salt",
    "1-2 Tbsp (5-10 g) vegan parmesan cheese, plus more for serving",
    "1-2 cups (240-480 ml) unsweetened plain almond or rice milk, plus more as needed",
    "FOR SERVING optional",
    "10 ounces pasta (GF or regular - I like Trader Joe's GF fusilli)",
    "Vegan Parmesan Cheese",
    "Roasted Tomatoes"
  ],
  "__v": 1
}