{
  "hash": "3ec7e347e68d42993c3443da1b2351516fff38b5",
  "title": "Turkey Ramen",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/turkey-ramen",
  "extension": "Chrome",
  "firstAdded": "2016-11-07T16:46:05.443000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparation",
    "Broth",
    "Bring scallions, carrots, garlic, ginger, kombu, stock, and bonito flakes to a boil in a large heavy pot (at least 8 quarts). Reduce heat and simmer, skimming occasionally, until stock is reduced to about 8 cups, 1 hour or so. Strain stock into a clean pot; add soy sauce.",
    "DO AHEAD: Broth can be made 2 days ahead. Let cool; cover and chill.",
    "Ramen and Assembly",
    "While the broth is simmering, bring a medium pot of water to a boil. Carefully add eggs and boil gently 7 minutes. (Egg yolks will be shiny yellow and almost jammy; egg whites will be just set.) Using a slotted spoon, transfer eggs to a bowl of ice water to stop cooking; let cool. Peel; set aside.",
    "Return broth to a simmer (it should be very hot). At the same time, cook noodles in a large pot of boiling water according to package directions until al dente; drain (no need to salt the water, as ramen noodles contain more salt than regular pasta).",
    "Divide noodles among deep bowls. Top with sliced turkey, placing it off to one side. Ladle broth over turkey and noodles. Halve eggs and place a half on top of noodles in each bowl. Mound some sliced scallions next to egg and tuck half a sheet of nori along edge of bowl so half of it is sticking out.",
    "Serve ramen drizzled with chili oil, sesame oil, and soy sauce and topped with shichimi togarashi."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "4 SERVINGS",
    "Broth",
    "2 bunches scallions, chopped",
    "2 carrots, peeled, cut into pieces",
    "1 head of garlic, halved crosswise",
    "1 1\" piece ginger, peeled, thinly sliced",
    "1 piece dried kombu",
    "12 cups turkey stock or low-sodium chicken broth",
    "¼ cup bonito flakes",
    "2 tablespoons soy sauce",
    "Ramen And Assembly",
    "2 large eggs",
    "1 10-oz. package fresh thin and wavy ramen noodles or 3 3-oz. packages dried",
    "8 ounces leftover cooked turkey meat",
    "1 bunch scallions, thinly sliced",
    "2 toasted nori sheets, torn in half",
    "Chili oil, toasted sesame oil, soy sauce, and shichimi togarashi (for serving; optional)",
    "Ingredient Info",
    "Shichimi togarashi, a Japanese red-pepper seasoning mix, can be found at Japanese markets and in the Asian foods section of some supermarkets."
  ],
  "__v": 1
}