{
  "hash": "ca7318aa0386ab3bdf60c2083cf25ef9b2c4b725",
  "title": "ROAST RIB OF BEEF",
  "image": "//cdn.shopify.com/s/files/1/2074/7101/articles/Ginger_Pig_Final-22_1024x1024.jpg?v=1519723887",
  "href": "https://thegingerpig.co.uk/blogs/recipes/roast-rib-of-beef",
  "extension": "Chrome",
  "firstAdded": "2020-01-14T12:25:08.835000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Remove the meat from the fridge 1 hour before cooking.",
    "Preheat the oven to 220°C and calculate the required roasting time using the guide above.",
    "Place the joint into a deep roasting tray so that it is standing up on the bone. Pat the surface of the meat dry with kitchen paper. Using your hands, coat the surface of the joint with a little oil, just enough to allow seasoning to stick, then season with salt and pepper (if using). Make sure you season just before you put the joint in the oven, otherwise the salt will start to draw out moisture, creating a wet surface and making it harder to get a decent crust. Place into the oven, and roast for 20 minutes.",
    "While the meat is searing, toss the shallots with 1 tbsp oil and set to one side.",
    "When the initial searing time is up, remove the beef from the oven. Turn the oven down to 170°C and leave the door open for a few seconds to help it come down to temperature.",
    "Add the shallots to the roasting tray around the beef, and return the tray to the oven for your calculated roasting time.",
    "When the cooking time is over, remove the roasting tray from the oven. Allow the meat to rest in the tray for 10 minutes, then remove the meat from the roasting tray, wrap in foil and allow it to rest for another 20.",
    "While the meat is resting, make the gravy. Skim off the excess fat using a side spoon - the easiest way to do this is to pour the liquid into a jug and let it settle for a few minutes before skimming. Place the roasting tray, remaining juices and shallots over a high heat on the hob and add the red wine and stock, using a wooden spoon to gently scrape up any tasty bits. Simmer until reduced by around a quarter, taste, and reduce a little more if you'd like. Add the cornflour and water mix, stir well and simmer for another 2 minutes, then season with salt if you feel it's needed. Pour into a serving jug and keep warm until you're ready to eat."
  ],
  "ingredients": [
    "0",
    "1 large prime rib or wing rib joint (2 or more bones)",
    "2 tbsp oil",
    "Sea salt",
    "Black pepper, optional",
    "6 shallots, peeled and halved"
  ],
  "__v": 1
}