{
  "hash": "98629ac92887a3bf747e6eb31b33a468360d775e",
  "title": "Instant Pot Braised Curry Beef",
  "image": "https://thewoksoflife.com/wp-content/uploads/2018/09/braised-curry-beef-10.jpg",
  "href": "https://thewoksoflife.com/2018/10/braised-curry-beef-instant-pot/",
  "extension": "Chrome",
  "firstAdded": "2018-10-09T17:48:38.115000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "First, blanch the beef to get rid of any impurities. Boil a pot of water, add the chunks of beef, and bring to a boil again. Drain immediately, rinse, and set aside.",
    "Heat ¼ cup of oil in the Instant Pot on the sauté setting. Add the garlic, shallots, and bay leaves to infuse the oil. Cook for a few minutes. Then add the curry powder and turmeric. Stir until well-combined. If need be, add a little bit more oil so the curry powder doesn’t stick to the bottom of the pot. Take care not to burn the spices!",
    "After a minute, add in the beef, broth or water (reduce the amount of liquid here to ⅔ cup if using beef chuck instead of outside flank), sugar, salt, and tomato paste. Seal the Instant Pot, and turn on the meat stew setting for 35 minutes (reduce cooking time to 20 minutes if using beef chuck).",
    "Meanwhile, sauté the onions in 1 tablespoon oil in your wok for 1-2 minutes. They should still be a bit crunchy. Set aside. Release pressure completely from the Instant Pot (using either the quick pressure release or natural release).",
    "When safe, open the lid of the Instant Pot, and turn on the sauté setting. Stir in cornstarch slurry, and allow the sauce to thicken for a couple minutes. If the curry isn’t thick enough for your liking, make and add more cornstarch slurry accordingly. After the sauce has thickened, stir in the sautéed onions. Taste for seasoning and add salt to taste. Serve over rice."
  ],
  "ingredients": [
    "0",
    "3½ pounds beef outside flank/rough flank (牛腩) - can also substitute beef brisket or chuck, cut into large (2-inch) cubes",
    "¼ cup vegetable oil, plus 1 tablespoon (divided)",
    "5 cloves of garlic, chopped",
    "5 shallots, finely chopped",
    "3 bay leaves",
    "⅓ cup good curry powder",
    "1 teaspoon turmeric powder",
    "2 cups beef broth, chicken broth, or water",
    "4 teaspoons sugar",
    "1 tablespoon salt, plus more to taste",
    "2 tablespoons tomato paste",
    "2 large onions, cut into wedges",
    "Cornstarch Slurry (2 teaspoons cornstarch, dissolved in 1 tablespoon water)"
  ],
  "__v": 1
}