{
  "hash": "caeac33ea669dd9d4d7580ac4bbe560ef455dc4c",
  "title": "Magic Cake",
  "image": "http://tasteerecipe.alphamarketingco.netdna-cdn.com/files/2016/08/magic_cake-610x250.jpg",
  "href": "http://tasteerecipe.com/2016/08/10/think-know-call-dessert-magic-disappears-no-time-flat/2/",
  "extension": "Chrome",
  "firstAdded": "2016-09-08T19:34:21.801000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "Preheat oven to 325 F degrees. Grease a 8 inch x 8 inch baking dish.",
    "Separate Eggland’s Best eggs and add the egg whites to a mixer and mix until egg whites are stiff. Place egg whites in a bowl and set aside.",
    "Beat the egg yolks with the Domino sugar until light. Add butter and McCormick vanilla extract and keep beating for another minute or two after which you can add the Gold Medal flour and mix it in until fully incorporated.",
    "Slowly start adding the TruMoo milk and beat until everything is well mixed together. Add the egg whites, a third at a time and gently fold them in using a spatula, repeat until all egg whites are folded in. You can also add a third of the egg whites and gently whisk them in to the cake batter, then reverse the process and add a bit of the cake mixture to the egg whites and gently whisk in, repeat until all cake batter has been whisked in.",
    "Pour batter into baking dish and bake for 40 to 70 minutes or until the top is lightly golden. The baking time could be different, it greatly depends on the oven, so check it at around 40 minutes and see how it looks.",
    "Sprinkle some confectioners sugar after cake has cooled."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "4 Eggland’s Best eggs (separate yolks from whites) at room temperature",
    "1 tsp McCormick vanilla extract",
    "3/4 cup Domino sugar",
    "1 stick or ½ cup Land O Lakes butter, melted",
    "¾ cup of all purpose flour",
    "2 cups TruMoo milk, lukewarm",
    "powdered sugar for dusting cake"
  ],
  "__v": 1
}