{
  "hash": "6400a0b5631d5a14b0c9f7fc5127294a970b3496",
  "title": "CRAWFISH STUFFED PORK TENDERLOIN WITH HERBED TASSO CREAM SAUCE",
  "image": "//cdn.shopify.com/s/files/1/0207/8590/files/Red_Stick_Spice_Stuffed_Loin_InRegister_Final_1024x1024.jpg?17144987021663956422",
  "href": "http://www.redstickspice.com/blogs/recipes/70216645-crawfish-stuffed-pork-tenderloin-with-herbed-tasso-cream-sauce",
  "extension": "Chrome",
  "firstAdded": "2016-05-09T19:28:05.203000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 375°F. Using a paring knife, trim any excess fat, silverskin and connective tissue from the pork tenderloin. Begin making making cuts long ways on the tenderloin. Make shallow cuts and pull the tenderloin away from the cut. Continue making these cuts in order to achieve a flattened piece. Repeat with the second tenderloin. Place the tenderloins between two pieces of plastic wrap and pound lightly to flatten.",
    "In a bowl, create the stuffing by combining the crawfish, Andouille, onions, celery, red bell pepper, garlic, green onions, parsley, Herbsaint, mayonnaise, Panko and Savory Steak and Chop blend. Divide the stuffing between the two tenderloins. Spread evenly then roll the tenderloins to create a spiral effect. Tie with butcher’s twine and season on all sides with salt, cracked black pepper and liberally with Red Stick Spice Company House Blend.",
    "Heat a sauté pan over medium-high heat and add the Avocado Oil. Sear the pork tenderloins, one at a time, until golden. Move to a roasting pan and bake for 20-25 minutes or until a meat thermometer registers 145 degrees. The meat will be slightly pink.",
    "Remove from oven and allow to rest for 10 minutes. Remove the butcher’s twine. Slice and Serve with the Herbed Tasso Cream.",
    "INGREDIENTS FOR HERBED TASSO CREAM SAUCE:",
    "¼ cup unsalted butter",
    "¼ cup tasso, finely diced",
    "2 tsp dried Tarragon",
    "1 Tbl minced shallots",
    "1 Tbl minced garlic",
    "1 tsp flour",
    "2 Tbl white wine",
    "1 cup heavy whipping cream",
    "½-1 cup seafood stock",
    "Salt and white pepper to taste",
    "DIRECTIONS FOR THE HERBED TASSO CREAM:",
    "In a skillet, melt butter over medium-high heat. Add the tasso and shallots and sauté for 3-5 minutes or until the shallots are wilted. Add the garlic and sauté just until fragrant taking care not to brown the garlic. Add the flour. Stir and cook until the flour smells fragrant and nutty. Add the dried Tarragon and wine. Stir and cook for 1 minute. Add the cream and stock and simmer to reduce by about half. Taste and adjust the salt and pepper to taste.",
    "Serve the sliced pork tenderloin on a buffet with the cream in a dish with a ladle on the side. To plate individual portions, pool the cream on the plate and place the serving of pork tenderloin on top."
  ],
  "ingredients": [
    "0",
    "1 package pork tenderloin (will contain two tenderloins)",
    "½ pound chopped crawfish tails",
    "¼ cup finely diced andouille",
    "¼ cup minced onions",
    "¼ cup minced celery",
    "¼ cup minced red bell pepper",
    "1 tsp minced garlic",
    "¼ cup sliced green onions",
    "¼ cup chopped parsley",
    "½ tsp Herbsaint",
    "½ cup mayonnaise",
    "½ cup Panko bread crumbs",
    "2 Tbl Savory Steak & Chop",
    "Salt & Cracked Black Pepper",
    "1 oz House Blend",
    "Roasted Garlic Avocado Oil or All Natural Avocado Oil"
  ],
  "__v": 1
}