{
  "hash": "eed189ee2274f252c100058daea5d9329b76df24",
  "title": "Lemon-Glazed Madeleines",
  "image": "http://farm3.static.flickr.com/2117/2049476207_967ef4926b_o.jpg",
  "href": "http://www.davidlebovitz.com/2007/12/humpy-madeleine/",
  "firstAdded": "2015-01-15T10:35:00.449000",
  "users": [
    null
  ],
  "keywords": [
    "eggs",
    "room",
    "granulated",
    "sugar",
    "rounded",
    "salt",
    "flour",
    "baking",
    "zest",
    "lemon",
    "unsalted",
    "cooled",
    "butter",
    "preparing",
    "molds",
    "freshlysqueezed",
    "juice",
    "water"
  ],
  "directions": [
    "0",
    "Brush the indentations of a madeleine mold with melted butter. Dust with flour, tap off any excess, and place in the fridge or freezer.",
    "In the bowl of a standing electric mixer, whip the eggs, granulated sugar, and salt for 5 minutes until frothy and thickened.",
    "Spoon the flour and baking powder, if using, into a sifter or mesh strainer and use a spatula to fold in the flour as you sift it over the batter. (Rest the bowl on a damp towel to help steady it for you.)",
    "Add the lemon zest to the cooled butter, then dribble the butter into the batter, a few spoonfuls at a time, while simultaneously folding to incorporate the butter. Fold just until all the butter is incorporated.",
    "Cover the bowl and refrigerate for at least 1 hour. (Batter can be chilled for up to 12 hours.)",
    "To bake the madeleines, preheat the oven to 425 degrees.",
    "8. Plop enough batter in the center of each indentation with enough batter which you think will fill it by 3/4’s (you’ll have to eyeball it, but it’s not brain-surgery so don’t worry if you’re not exact.) Do not spread it.",
    "10. Bake for 8-9 minutes or until the cakes just feel set. While the cakes are baking, make a glaze in a small mixing bowl by stirring together the powdered sugar, lemon juice, and water until smooth.",
    "11. Remove from the oven and tilt the madeleines out onto a cooling rack. The moment they’re cool enough to handle, dip each cake in the glaze, turning them over to make sure both sides are coated and scrape off any excess with a dull knife. After dipping, rest each one back on the cooking rack, scalloped side up, until the cakes are cool and the glaze has firmed up.",
    "Storage: Glazed madeleines are best left uncovered, or not tightly-wrapped; they’re best eaten the day they’re made. They can be kept in a container for up to three days after baking, if necessary. I don’t recommend freezing them since the glaze will melt."
  ],
  "ingredients": [
    "0",
    "3 large eggs, at room temperature",
    "2/3 cup (130g) granulated sugar",
    "rounded 1/8 teaspoon salt",
    "1 1/4 cup (175g) flour",
    "1 teaspoon baking powder (optional)",
    "zest of one small lemon",
    "9 tablespoons (120g) unsalted butter, melted and cooled to room temperature, plus additional melted butter for preparing the molds",
    "3/4 cup (150g) powdered sugar",
    "1 tablespoon freshly-squeezed lemon juice",
    "2 tablespoons water"
  ],
  "__v": 1
}