{
  "hash": "162124648d0c4cdac08b9ea032a811d157b975af",
  "title": "Gnocchi alla romana",
  "image": "http://www.giallozafferano.it/images/ricette/2/232/foto_hd/hd450x300.jpg",
  "href": "http://ricette.giallozafferano.it/Gnocchi-alla-romana.html",
  "extension": "Chrome",
  "firstAdded": "2016-08-05T09:25:42.773000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Ponete il latte in un tegame sul fuoco, e aggiungete una noce di burro, il sale, e un pizzico noce moscata",
    "Appena inizierà a bollire versatevi a pioggia il semolino, mescolando energicamente con una frusta, per evitare la formazione di grumi.",
    "Cuocete il composto a fuoco basso per qualche minuto, fino a che non si sarà addensato; dopodiché togliete il recipiente dal fuoco ed incorporate al composto i due tuorli mescolando questa volta con un mestolo di legno.",
    "Unite anche il parmigiano e mescolate il tutto nuovamente.",
    "A questo punto versate metà dell'impasto ancora bollente su un foglio di carta forno e utilizzando le mani, dategli una forma cilindrica. Per non scottarvi troppo potete passare le mani sotto l'acqua fredda.",
    "Una volta ottennuto un cilindro uniforme, avvolgetelo nella carta forno. Ripetete la stessa operazione per la seconda metà dell'impasto tenuto da parte e riponete i due rotoli in frigorifero per una ventina di minuti.",
    "Una volta raffreddato, otterrete un impasto compatto e con un coltello riuscirete ad ottenere dei dischi perfetti.",
    "Per facilitarvi nel taglio consigliamo di inumidire la lama con dell'acqua. Una volta ottenuti circa 40 pezzi disponeteli su una teglia precedentemente imburrata e cospargeteli con il burro fuso, ma non bollente.",
    "Spolverizzate la superficie con il pecorino romano e cuocete in forno statico preriscaldato a 200° per 20-25 minuti (se utilizzate il forno ventilato 180° per 15 minuti). Dopodichè azionate la funzione grill e lasciateli gratinare per 4-5 minuti.",
    "Una volta pronti servite i vostri gnocchi alla romana ben caldi!"
  ],
  "ingredients": [
    "0",
    "250g semolino",
    "1l latte",
    "100g burro",
    "2 tuorli",
    "Parmigiano reggiano 100 g",
    "40g pecorino",
    "7g sale",
    "noce moscata q.b."
  ],
  "__v": 3
}