{
  "hash": "354982e2011078973e937121deba9f39b902d2c0",
  "title": "#5under5: Black Sesame-Crusted Cheddar Cheese Ball [Vegan]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/10/Cheeeseball-Cut-1200x749.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/black-sesame-crusted-cheddar-cheese-ball/",
  "extension": "",
  "firstAdded": "2015-12-29T22:53:59.223000",
  "users": [
    null
  ],
  "keywords": [
    "raw",
    "cashews",
    "sundried",
    "tomatoes",
    "nutritional",
    "yeast",
    "miso",
    "water",
    "apple",
    "cider",
    "vinegar",
    "squeeze",
    "lemon",
    "juice",
    "salt",
    "mustard",
    "red",
    "pepper",
    "black",
    "sesame",
    "seeds",
    "gently",
    "pulsed",
    "spice",
    "grinder",
    "slightly",
    "extra",
    "brokenup",
    "pretzels",
    "rolling"
  ],
  "directions": [
    "0",
    "About 2-4 hours prior to starting the recipe, soak your cashews and sun-dried tomatoes in a bowl of warm water until soft.",
    "When you’re ready to begin, drain the cashews and tomatoes and give them a good rinse. Add them to the mug of a high-speed blender or food processor and blend until a paste is formed. You might have to stop every few minutes to scrape down the sides of the blender.",
    "Add the nutritional yeast, miso, and any optional seasonings you might be using. Blend until completely smooth and free of cashew/sun-dried tomato chunks. You’ll also need to add about a teaspoon of water or other liquid to loosen up the cheese. Depending on how soft your cashews are and how powerful your blender is, this could take anywhere from 5 to 15 minutes. Patience is key! Don’t forget to taste for seasonings and adjust to your preference.",
    "When a completely smooth and thick cheese paste is formed, scoop the mixture out of the blender and onto a piece of plastic wrap. Tightly wrap the cheese in the plastic to form a ball shape. (You might want to double-wrap to ensure nothing leaks out.)",
    "Refrigerate the wrapped cheese ball for a minimum of four hours before you plan to serve it. If you prefer a softer cheese, feel free to chill it for less, but be warned that you’ll have a harder time shaping and decorating it.",
    "Once the cheese is nice and solid, unwrap it and pat/form into a smoother circular shape with your hands. (You’ll want to wear gloves for this part!)",
    "Spread out 1/4 cup of black sesame seeds on a plate and roll the cheese ball around until it’s completely coated.",
    "Serve with crackers, pretzels, sliced apples, and your other favorite cheese accompaniments."
  ],
  "ingredients": [
    "0",
    "1 1/2 cup raw cashews – $2.20",
    "2 tablespoons sun-dried tomatoes – $0.60",
    "1/4 cup nutritional yeast – $0.60",
    "1 tablespoon miso paste – $0.12",
    "1 teaspoon water (or apple cider vinegar, or a squeeze of lemon juice, if you have it)",
    "Salt to taste",
    "Optional: 1/2 teaspoon mustard powder, pinch of red pepper flakes",
    "1/4 cup black sesame seeds gently pulsed in a spice grinder until slightly crushed – $0.50",
    "Optional: extra crushed or broken-up pretzels, for rolling"
  ],
  "__v": 1
}