{
  "hash": "158ff51a4c6b2f4af6283c69789ec2dc937d8020",
  "title": "Chocolate Cream Pie",
  "image": "https://tastesbetterfromscratch.com/wp-content/uploads/2016/05/Chocolate_Cream_Pie-2-150x150.jpg",
  "href": "https://tastesbetterfromscratch.com/chocolate-cream-pie/",
  "extension": "Chrome",
  "firstAdded": "2018-08-12T01:54:15.099000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the crust: (Can be made a day or two in advance)",
    "Preheat oven to 350°F.",
    "Add Oreo cookies to a food processor and pulse into a fine crumb. Pour the crumbs into a bowl and stir in melted butter until combined.",
    "Press mixture evenly and firmly into the bottom and up the sides of a 9in pie dish. Bake for 10-12 minutes. Set aside to cool.",
    "For the chocolate pudding filling:",
    "To a medium sauce pan over medium heat, add the sugar, and milk and whisk well to combine. Bring mixture to a simmer, whisking frequently.",
    "Meanwhile, add the egg yolks and cornstarch to a bowl and whisk until smooth.",
    "Once the saucepan mixture is simmering, add a few spoonfuls of the hot liquid into the egg yolks and whisk to temper the eggs. Add a few more spoonfuls of the hot liquid into the egg yolks. Then slowly whisk the egg yolk mixture into the remaining mixture in the saucepan. Whisk constantly until the mixture begins to thicken and comes to a very gently boil (big bubbles begin to break the surface).",
    "Remove pan from the heat and whisk in the butter, chopped chocolate, and vanilla extract. Stir well until completely smooth.",
    "Pour filling into the cooled cookie crust and smooth into an even layer. Place a piece of plastic wrap gently on top and refrigerate until filling is set, about 4–6 hours or overnight, if desired.",
    "For the topping:",
    "Once pudding has set, make the topping by adding the cream to a mixing bowl. Mix with electric mixers on high speed for 1-2 minutes.",
    "Add the sugar and vanilla extract. Continue mixing until soft peaks form, about 2-3 minutes.",
    "Spread whipped cream over pie and garnish with curled chocolate, if desired. (I use this method for making chocolate curls)."
  ],
  "ingredients": [
    "0",
    "For the Oreo crust:",
    "24 Oreo cookies",
    "5 Tablespoons butter",
    "For the chocolate pudding filling:",
    "1/3 cup granulated sugar",
    "2 1/2 cups whole milk",
    "6 large egg yolks",
    "2 Tablespoons cornstarch",
    "6 Tablespoons salted butter , chopped into pieces",
    "8 ounces good quality semi-sweet chocolate , chopped (I like Ghirardelli's)",
    "1 1/2 teaspoons vanilla extract",
    "For the whipped topping:",
    "1 cup heavy whipping cream",
    "2 Tablespoons powdered sugar , or granulated sugar",
    "1 1/2 teaspoons vanilla extract"
  ],
  "__v": 1
}