{
  "__v": 1,
  "directions": [
    "0",
    "Heat olive oil in a medium sauce pan over medium heat.",
    "Add the rice and stir to coat. Toast the rice, stirring often, just until it starts to turn golden.",
    "Pour in the chicken broth, bring to a boil, turn heat to low, and cover.",
    "Cook, covered, for 15-20 min or until most of the liquid is absorbed.",
    "Remove from heat and add the butter, grated zucchini, cheddar, and garlic powder. Stir until well incorporated. Cover and let sit for 5 min.",
    "Stir again and add salt and pepper to taste and a splash of milk if you need to think the texture.",
    "To Freeze and Reheat:",
    "Cook your rice and allow it to cool just enough to handle. Measure your portion onto a square of plastic wrap. Flatten the rice into a square and wrap tightly. Place several squares of rice onto a baking sheet or square of cardboard if you have a small freezer. When the rice is frozen, take the wrapped squares and place them into a zippered freezer bag. To reheat the rice simply unwrap the square and place it in a microwave-safe dish with a lid. For every cup of rice sprinkle it with about 1 teaspoon of water. Nuke it on 50% power for one minute (Microwaves vary, you may need to experiment a little). Fluff the rice with a fork, and repeat the process as necessary."
  ],
  "firstAdded": "2014-11-18T00:16:06.478000",
  "hash": "a86ba1c2c40bce48116188a383f4829d1721802d",
  "href": "http://www.bigoven.com/recipe/cheesy-zucchini-rice/317236",
  "image": "http://mda.bigoven.com/pics/rs/256/cheesy-zucchini-rice-5.jpg",
  "ingredients": [
    "0",
    "1 tablespoons Olive oil",
    "1 cup Long grain rice",
    "2 cups Chicken broth",
    "2 tablespoons butter",
    "1 Zucchini; grated (or fnely chopped in food processor)",
    "1 cup shredded cheese",
    "1/2 teaspoon garlic powder",
    "Salt & pepper",
    "Skim milk; as needed"
  ],
  "keywords": [
    "olive",
    "oil",
    "long",
    "rice",
    "chicken",
    "broth",
    "butter",
    "zucchini",
    "fnely",
    "food",
    "processor",
    "cheese",
    "garlic",
    "salt",
    "pepper",
    "skim",
    "milk",
    "needed"
  ],
  "title": "Cheesy Zucchini Rice",
  "users": [
    null
  ]
}