{
  "hash": "a416f48b550741752f0e2df3f6501ddd85d59986",
  "title": "Ultimate Peanut Butter Cake",
  "image": "https://farm2.staticflickr.com/1469/26457443542_4ee83b8ca6_b.jpg",
  "href": "http://bethcakes.com/the-ultimate-peanut-butter-lovers-cake/",
  "extension": "Firefox",
  "firstAdded": "2019-07-15T00:00:36.911000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350*F and spray four 6-inch cake pans with cooking spray. (You can use three 8-inch cake pans or three 9-inch cake pans. The layers might be thinner, and baking time will vary, but there will be enough batter for larger cake layers.)",
    "Whisk together flour, baking soda, baking powder, powdered peanut butter (if using!), and salt.",
    "Cream butter on medium speed with an electric mixer. Add peanut butter; mix well. Add both sugars and vanilla. Mix until combined. Add eggs one at a time with mixer running; mix well.",
    "Add half of the flour mixture and half of the buttermilk to the butter/sugar mixture. Mix until just incorporated. Repeat with remaining flour and buttermilk; mix until combined.",
    "Divide batter among cake pans and bake for about 25 minutes (this will change depending on the size of the pans you use), or until a toothpick inserted into the center of the cake layers comes out clean.",
    "Let cake cool in pans for 5-10 minutes, then turn out onto a wire rack to cool completely."
  ],
  "ingredients": [
    "0",
    "peanut butter cake",
    "Preheat oven to 350*F and spray four 6-inch cake pans with cooking spray. (You can use three 8-inch cake pans or three 9-inch cake pans. The layers might be thinner, and baking time will vary, but there will be enough batter for larger cake layers.)",
    "Whisk together flour, baking soda, baking powder, powdered peanut butter (if using!), and salt.",
    "Cream butter on medium speed with an electric mixer. Add peanut butter; mix well. Add both sugars and vanilla. Mix until combined. Add eggs one at a time with mixer running; mix well.",
    "Add half of the flour mixture and half of the buttermilk to the butter/sugar mixture. Mix until just incorporated. Repeat with remaining flour and buttermilk; mix until combined.",
    "Divide batter among cake pans and bake for about 25 minutes (this will change depending on the size of the pans you use), or until a toothpick inserted into the center of the cake layers comes out clean.",
    "Let cake cool in pans for 5-10 minutes, then turn out onto a wire rack to cool completely.",
    "peanut butter frosting",
    "Cream butter on medium speed with an electric mixer. Add peanut butter; mix until smooth.",
    "Add vanilla and half of the powdered sugar. Mix on low speed until just combined, and then medium-high speed until completely combined. Add 1 to 2 tablespoons of cream, and repeat with remaining powdered sugar.",
    "Once cake layers are cool, spread frosting between layers and over the outside of the cake. (I chose to go with the \"naked cake\" look, but there should be enough frosting to have a thicker layer around the outside if you prefer that.)",
    "Press chopped peanuts into frosting around the bottom of the cake.",
    "*At this point, I like to pop my cakes into the freezer for about 20-30 minutes. I've found that it's easier to get the drips I want when the cake is cold. But you can skip this part if you'd like!*",
    "peanut butter ganache",
    "Combine peanut butter chips and cream in a small saucepan over medium low heat. Stir continuously until smooth. Let ganache cool.",
    "I usually use a squeeze bottle or a piping bag to make the drips, and recently I came across a really great video that demonstrates how to do this. So skip to the 3 minute mark if you'd like to see how drips are done!",
    "To finish off the cake, you can pipe any leftover frosting around the top and sprinkle with more chopped peanuts.",
    "Congrats, you're done!"
  ],
  "__v": 1
}