{
  "hash": "0f238006fafc4605283a11ff196a82dc916fa9a2",
  "title": "carrot cake with cream cheese frosting",
  "image": "https://thehungrymum.files.wordpress.com/2015/05/the-hungry-mum-donna-hay-carrot-cake-1.jpg?w=490",
  "href": "https://thehungrymum.com/2015/05/14/donna-hay-carrot-cake-with-cream-cheese-frosting/?fbclid=IwAR182cQ-tgL33Pn0rYLcB4LVO4yepvtIi46mSYtvZg_fFwGPNYghoZlVXvY",
  "extension": "Chrome",
  "firstAdded": "2018-10-31T05:25:29.094000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 180C and grease and line two, 20cm round cake tins with non-stick baking paper and set aside.",
    "Place flour, baking powder, bicarbonate of soda, cinnamon and ginger in a medium size bowl and use a fork to combine and aerate the ingredients.",
    "In bowl of electric mixer with the beater attachment mix together sugar and oil until combined.",
    "Add eggs, one at a time, and beat well.",
    "Scrape down sides of bowl with a spatula then fold in the flour mixture.",
    "Using a spoon stir in carrots and pecans until just combined – don’t over-mix.",
    "Scrape into the two tins then bake for 21-ish minutes – you may have to cook for a bt longer but test with a skewer first.",
    "Leave in tins for ten minutes then remove from tins and cool on wire racks.",
    "Meanwhile make the cream cheese icing: in bowl of food processor blitz icing sugar to remove any lumps then add diced cream cheese and lemon juice. Process until smooth – about 1 minute.",
    "When cakes are totally cold place one cake on serving platter then top with some of the icing and place second cake on top, then use spatula to cover top. We left our sides naked as I love that look but you can cover yours with frosting if you wish."
  ],
  "ingredients": [
    "0",
    "¾ cup brown sugar",
    "¾ cup vegetable oil",
    "3 eggs",
    "1½ cups plain flour",
    "1½ teaspoons baking powder",
    "1 teaspoon bicarb soda",
    "1 teaspoon ground cinnamon",
    "½ teaspoon ground ginger",
    "2½ cups grated carrot (about five carrots)",
    "½ cup chopped pecan",
    "cream cheese frosting:",
    "250g cream cheese, softened",
    "90g icing sugar, sifted",
    "1½ tablespoons lemon juice"
  ],
  "__v": 1
}