{
  "hash": "8991561860217ea9a4b571aa4b894a8aceb59029",
  "title": "Spaghetti con le cozze",
  "image": "http://livesicilia.it/wp-content/uploads/2014/04/pasta-con-cozze-00.jpg",
  "href": "http://livesicilia.it/2014/04/11/ricetta-del-giorno-spaghetti-con-le-cozze_472139/",
  "extension": "Chrome",
  "firstAdded": "2016-06-30T19:51:28.154000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Procedimento per la preparazione della pasta con le cozze:",
    "La prima cosa da fare per la corretta riuscita del piatto, è sicuramente pulire per bene le cozze, sapete farlo? Pulite per bene i gusci ed eliminate il filo che si trova nella parte laterale della cozza. Sciacquatele bene sotto l'acqua e mettetele in un tegame con coperchio.",
    "Accendete la fiamma ed attendete che le cozze si aprano da sole. Non appena si saranno aperte, toglietele dal fuoco e cominciate a sgusciarle. Mettete le cozze sgusciate in un piatto fondo oppure in una contenitore per alimenti ed aggiungete il brodo delle cozze precedentemente filtrato.",
    "*In questo modo le cozze si manderanno morbide e umide.",
    "Prima di continuare con la preparazione del piatto, è opportuno che mettiate da parte un po' ( circa 6 cozze ) con guscio, vi torneranno utili, quando dovrete ultimare la presentazione del piatto, con una simpatica guarnizione.",
    "Intanto mettete a cucinare gli spaghetti.",
    "In una casseruola versate dell'olio d'oliva ed aggiungete 1 spicchio d'aglio (intero o tritato). Se volete potete aggiungere anche un pezzetto di peperoncino.",
    "Non appena l'aglio comincia a soffriggere aggiungete il brodo delle cozze e un pezzetto di scorza di limone (senza la parte bianca che è amara).",
    "Lasciate soffriggere per qualche minuto poi, togliete la scorza di limone e lo spicchio d'aglio intero. Quando mancheranno 3 minuti circa alla fine della cottura della pasta trasferitela nella casseruola con il brodo delle cozze e ultimate lì la cottura aggiungendo l'acqua di cottura della pasta all'occorrenza.",
    "Si dovrà formare una cremina attorno agli spaghetti.",
    "Non appena gli spaghetti saranno cotti, aggiungete le cozze ed il prezzemolo tritato.",
    "*Se aggiungeste prima le cozze rischierebbero di diventare troppo gommose.",
    "Servite la pasta con le cozze nei piatti di portata e decorate con prezzemolo tritato e scorzetta di limone tritata. Aggiungete le cozze con il guscio e spolverate con del pepe nero.",
    "I vostri spaghetti con le cozze sono adesso pronte per essere assaggiati!"
  ],
  "ingredients": [
    "0",
    "ngredienti per due persone:",
    "200 gr. spaghetti",
    "1 kg di cozze",
    "(potete usarne un pochino meno ma a me piace ben condita)",
    "olio d'oliva",
    "1 spicchio d'aglio",
    "scorza di limone",
    "prezzemolo",
    "sale, pepe"
  ],
  "__v": 1
}