{
  "hash": "65346f3612245f7c2b3c3fd882119cdde55cfa01",
  "title": "Decadent Creations 'Bad Santa' Bourbon-Glazed Apple Gingerbread Upside-down Cake",
  "image": "",
  "href": "http://katu.com/amnw/am-northwest-cooking-recipes/bad-santa-upside-down-cake-12-04-2017",
  "extension": "Chrome",
  "firstAdded": "2017-12-07T03:45:10.080000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Pan-Glaze:",
    "¼ cup butter, softened",
    "½ cup brown sugar",
    "Peel and chop the apples & place in a small mixing bowl or casserole dish. Pour the Bourbon over the apples, & let them soak while you make the batter.",
    "Cream the first portion of butter and first portions of sugars with the paddle attachment of a stand mixer. Slowly add the combined canola, eggs, yolk, and molasses. Mix until combined. Scrape bowl. Add the combined dry ingredients all at once, while the mixer is off. Turn the mixer on speed 1 and let the wet & dry come together. Then drizzle the buttermilk at a pace that isn't too splashy. Give it one more good scrape. 'Flash' it for a brief moment on moment on a medium speed. Volia! Batter: Done!",
    "Make the pan-glaze & assemble the upside-down cake for baking:",
    "In a fresh mixing bowl with the paddle attachment, cream the second portion of butter and second portion of brown sugar. Drain off the excess Bourbon from the soaking apples. Slowly pour in the extra Bourbon & mix until combined. In a pan-sprayed, parchment-lined 9 inch round cake pan spread the Bourbon-licious pan-glaze into the bottom of the pan. Disperse the Bourbon-soaked apples evenly over the pan-glaze. Pour the gingerbread cake batter over the top. Bake at 350 F for 60 minutes, turn the pan halfway through baking. Cool for 20 minutes. Scrape the sides of the pan with an offset spatula for easy unmolding. Flop the cake out onto a cake board, plate or cake stand. Carefully peel away the parchment. If some apples stick a little, you can always piece it together. It's rustic, after all!"
  ],
  "ingredients": [
    "0",
    "¾ cup butter, softened, salted or unsalted, Santa is too drunk to care...",
    "1 cup packed brown sugar",
    "½ cup granulated sugar",
    "½ cup canola oil",
    "1 egg yolk",
    "3 eggs",
    "1 ¼ cup molasses, blackstrap preferred",
    "2 ¾ cup all-purpose flour",
    "1 tsp. Baking powder",
    "½ tsp. baking soda",
    "1 tsp. Ground Cinnamon",
    "2 tsp. Ground Ginger",
    "½ tsp. Ground cloves",
    "½ tsp. Sea salt",
    "1/3 cup cocoa, Dutch preferred",
    "1 cup buttermilk",
    "2 medium Granny Smith apples",
    "double-shot of Bourbon"
  ],
  "__v": 1
}