{
  "hash": "d3ed21064a2e8ebf112cf4f5d550f82538c54f0e",
  "title": "Baked Tofu With Red Wine Mushroom Sauce [Vegan, Gluten-Free]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/04/tofu6.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/baked-tofu-with-red-wine-mushroom-sauce/",
  "extension": "Chrome",
  "firstAdded": "2015-05-08T14:33:35.658000",
  "users": [
    null
  ],
  "keywords": [
    "medium",
    "onion",
    "garlic",
    "lbs",
    "brown",
    "mushrooms",
    "red",
    "wine",
    "rosemary",
    "glutenfree",
    "flour",
    "recipe",
    "baked",
    "tofu",
    "method",
    "rice",
    "stalks",
    "green",
    "parsley"
  ],
  "directions": [
    "0",
    "The best thing to do to get a great texture in your tofu is the freeze and thaw it before you press and marinate. So once it’s unthawed completely, cut your block into 6 slices and press out as much water as you can just with your hands. Then, line a plate with some paper towel or a clean kitchen towel and wrap the tofu in it then put some heavy things on top. Leave it for at least an hour.",
    "When that’s done, make a marinade for the tofu. Feel free to use whatever you like here. I used a combo of braggs, miso broth, garlic, a dash of hot sauce and some red wine vinegar. Keep the tofu in that brew for at least an hour to overnight.",
    "When ready, pre-heat the oven to 400F. Toss the tofu in a bit of rice flour and place on a parchment paper lined sheet. Baked for 20 minutes or until slightly crisp on the outside.",
    "For the sauce, in a large pan, water-saute the onions until soft. Add in the garlic and cook about a minute, just until fragrant.",
    "Toss in the mushrooms and let them cook until they release their moisture. Pour in the wine and stock and let it reduce to about half. If needed, add in the flour to thicken.",
    "In a plate, lay down the dersired amount of rice and top it with the baked tofu. Drizzle the sauce overtop and garnish with green onions and parsley."
  ],
  "ingredients": [
    "0",
    "1 medium sweet onion – diced",
    "2 garlic cloves – minced",
    "1 lbs brown mushrooms – sliced",
    "1 cup red wine",
    "1 Tbsp rosemary",
    "2 Tbsp gluten-free flour",
    "1 recipe baked tofu – See above for method",
    "4 cup brown rice – cooked",
    "2 stalks green onion – sliced",
    "1 Tbsp dried parsley"
  ],
  "__v": 1
}