{
  "hash": "9de0fbd2ecd620a77e0491ec5ee7150bb3fb40ad",
  "title": "Lemon Raspberry Cheesecake Squares",
  "image": "https://i2.wp.com/www.livewellbakeoften.com/wp-content/uploads/2014/05/LRCheesecake-1024x707.jpg?resize=1024%2C707",
  "href": "https://www.livewellbakeoften.com/lemon-raspberry-cheesecake-squares/",
  "extension": "",
  "firstAdded": "2017-07-14T01:31:34.690000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 325 degrees. Spray 8x8 baking pan with cooking spray or line with parchment paper and set aside.",
    "Place graham crackers in a food processor and process until you have fine crumbs. Add in the melted butter and sugar, stir to fully combine. Press mixture firmly into the bottom of the 8x8 pan and bake for 10 minutes. Set aside to cool.",
    "For the filling, using a stand mixer with the paddle attachment or handheld mixer beat the cream cheese on medium speed until smooth. Add in one egg at a time, mixing thoroughly after each one. Add in the sugar, lemon juice, and lemon zest making sure to mix well after each ingredient.",
    "For the raspberry swirl, place the raspberries and sugar in a blender and blend until smooth. At this point you can strain the mixture to remove the seeds if you prefer.",
    "Pour the cheesecake filling on top of the cooled graham cracker crust. Spoon the raspberry mixture in different spots on the filling, then use a knife to lightly swirl.",
    "Bake at 325 for about 35 minutes.",
    "Allow to cool completely, then refrigerate for at least 3 hours or overnight.",
    "Cut into squares and enjoy!"
  ],
  "ingredients": [
    "0",
    "Crust",
    "9 full-sheet graham crackers (or 1 and ¼ cups graham cracker crumbs)",
    "½ stick (4 tablespoons) melted butter",
    "2 tablespoons granulated sugar",
    "Filling",
    "16 oz. cream cheese, softened to room temperature",
    "2 large eggs",
    "½ cup granulated sugar",
    "2 lemons, juiced and zested",
    "Raspberry Swirl",
    "⅓ cup raspberries",
    "1 tablespoon sugar"
  ],
  "__v": 1
}