{
  "hash": "f4b1c3657e182d6faa58f8b73deb8df65c12da30",
  "title": "Crispy Tofu in Shiitake Broth",
  "image": "",
  "href": "https://www.bonappetit.com/recipe/crispy-tofu-in-shiitake-broth",
  "extension": "Chrome",
  "firstAdded": "2018-04-02T01:41:28.389000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Stir ¼ cup soy sauce and brown sugar in a medium bowl. Cut tofu into ½\"-thick slabs and then into squares. Pat dry with paper towels. Add tofu and toss to coat. Let sit, tossing occasionally, 20 minutes.",
    "Meanwhile, remove green tops from scallions and very thinly slice; set aside. Coarsely chop white parts and place in a medium pot. Add mushrooms, kombu, ginger, garlic, and 8 cups water and bring to a simmer over medium-high. Reduce heat to low and cook 10 minutes. Remove from heat; discard kombu. Let dashi sit 20 minutes (this will coax more flavor from aromatics), then fish out and discard scallions, mushrooms, ginger, and garlic.",
    "Heat vegetable oil in a large skillet, preferably nonstick, over medium-high. Cook tofu, working in batches if needed, until golden brown and crisp around edges, about 3 minutes per side. Transfer to paper towels to drain; season with salt.",
    "While tofu is cooking, bring dashi to a boil. Add bok choy and carrots and cook until tender, about 3 minutes. Add remaining 2 Tbsp. soy sauce; taste and season with more salt if needed.",
    "Ladle soup into bowls and add tofu, radishes, and reserved scallion tops; drizzle with sesame oil.",
    "Do Ahead: Dashi can be made 3 days ahead. Let cool; cover and chill, or freeze up to 3 months."
  ],
  "ingredients": [
    "0",
    "¼ cup plus 2 tablespoons reduced-sodium soy sauce",
    "1 tablespoon light brown sugar",
    "1 12-ounce package firm tofu, drained",
    "3 scallions",
    "12 shiitake mushrooms, rinsed, patted dry",
    "2 4x3-inch pieces dried kombu",
    "1 3-inch piece ginger, peeled, thinly sliced",
    "4 garlic cloves",
    "2 tablespoons vegetable oil",
    "Kosher salt",
    "4 baby bok choy (about 12 ounces total), halved lengthwise",
    "2 medium carrots, peeled, thinly sliced into rounds",
    "1 small radish, trimmed, thinly sliced into rounds",
    "Toasted sesame oil (for serving)"
  ],
  "__v": 1
}