{
  "__v": 1,
  "directions": [
    "0",
    "It a bowl add the yeast, oil and water together and allow to stand for 5 mins to activate the yeast. Then add the salt and flour and stir to combine. If the dough is a little dry add a little more water, or if too wet, more flour. The dough should come together and clean the sides of the bowl. Gently knead on a floured surface for a couple of minutes and then allow to rest while you make your filling.",
    "In a bowl add the veggie mince, water, tomato, ginger, tamari and agave. Allow to hydrate. In a frying pan fry the spring onion and chilli together in the oil. Then add the stuffing mixture and gently fry until heated through around 5 mins.",
    "On a floured surface roll out your dough to about half a cm thickness. Using a 6cm cutter or a larger glass cut out rounds and place to one side. Once all the dough is used up it is time to stuff them with the mix. Take one of the dough rounds in your left hand (if right handed) add a tsp or so of mixture to the middle of the round. Then take one edge with your right hand and gently start to pinch and crimp the edge until all the edges are sealed together and have made a little parcel. Then gently twist to give the authentic shape of the bao bun!",
    "Now if using a steamer pop each bun on a piece of baking paper and place in the steamer, if not bring a pan of water to the boil and place a colander on top. The colander must not be touching the water!!!",
    "Pop each bao bun on a piece of baking paper and pop in the colander giving them space inbetween as the bun dough does spread as it cooks. Pop the lid on and steam for 15-20 minutes until firm to the touch and piping hot in the middle.",
    "While you are steaming the buns you can make the broth. In a sauce pan add all of the ingredients except the spring onion, mange tout and cabbage. Gently simmer to release all the wonderful flavours. Check the seasoning and adjust to your taste. 5 mins before serving add the vegetables to allow them to just cook through but still have bite. Then dish up the broth and pop 4 - 5 bao buns on top and serve immediately! Enjoy!"
  ],
  "firstAdded": "2014-11-09T14:54:31.887000",
  "hash": "ccd83ffe38bd2ad978fe1772a4d7154988b8d978",
  "href": "http://deerlybelovedbakery.blogspot.co.uk/2013/06/steamed-bao-buns-in-spicy-miso-broth.html",
  "image": "http://4.bp.blogspot.com/-dyKrgu-MN5E/Uai_LYjwyUI/AAAAAAAADyQ/BpIiAo0PzWI/s1600/collagesteamedvegbun.jpg",
  "ingredients": [
    "0",
    "Bao bun dough:",
    "2 Cups of flour",
    "Pinch of Salt",
    "2 Tbsp of Dried Yeast",
    "1/4 Cup of Olive Oil",
    "2/3 Cup of Water",
    "Bao Bun Stuffing:",
    "1 Tbsp of Canola or Sunflower Oil",
    "2 Spring Onions Chopped",
    "1 Packet of Dried Veggie Mince (Granose)",
    "2/3 Cup of Water",
    "1 Tbsp of Tomato Purée",
    "1/4 Tsp Red Chilli finely chopped",
    "1/4 Teaspoon Ginger Powder",
    "1 Tbsp Tamari",
    "1/2 Tsp of Agave",
    "Miso Broth:",
    "5 Cups of Water",
    "2 Tbsp of Miso Paste",
    "1 Tbsp of Tamari",
    "1/4 Teaspoon of Chilli chopped finely",
    "1 Tbsp of Sesame Oil",
    "1/2 Tsp of Agave",
    "1cm Cube of fresh Ginger grated",
    "1 Clove Garlic grated",
    "2 Spring Onions chopped into chunky pieces",
    "1 Cup of Mange Tout",
    "1 Cup Savoy Cabbage Finely Shredded",
    "You will also need a steamer or a pan with a lid and a colander."
  ],
  "keywords": [
    "bao",
    "bun",
    "dough",
    "flour",
    "salt",
    "yeast",
    "olive",
    "oil",
    "water",
    "stuffing",
    "canola",
    "sunflower",
    "spring",
    "onions",
    "veggie",
    "mince",
    "granose",
    "tomato",
    "red",
    "chilli",
    "ginger",
    "tamari",
    "agave",
    "miso",
    "broth",
    "sesame",
    "cube",
    "clove",
    "garlic",
    "chunky",
    "pieces",
    "mange",
    "tout",
    "savoy",
    "cabbage",
    "need",
    "steamer",
    "pan",
    "lid",
    "colander"
  ],
  "title": "Steamed Bao Buns in a Spiced Miso Broth",
  "users": [
    null
  ]
}