{
  "hash": "4d8bb5862d823051b94ad8e881e98e43edda2368",
  "title": "Asparagus, Crispy Prosciutto and Brie Grilled Cheese",
  "image": "http://heatherchristo.com/cooks/wp-content/uploads/2014/04/Asparagus-Crispy-Prosciutto-and-Brie-Tartines.jpg",
  "href": "http://heatherchristo.com/cooks/2014/04/29/asparagus-crispy-prosciutto-and-brie-grilled-cheese/",
  "extension": "Chrome",
  "firstAdded": "2015-07-03T03:54:06.233000",
  "users": [
    null
  ],
  "keywords": [
    "slices",
    "rustic",
    "bread",
    "como",
    "olive",
    "oil",
    "clove",
    "garlic",
    "brie",
    "soft",
    "melty",
    "cheese",
    "spears",
    "asparagus",
    "kosher",
    "salt",
    "prosciutto"
  ],
  "directions": [
    "0",
    "Heat a grill or grill man to medium heat.",
    "Reserve 2 tablespoons of the olive oil and drizzle the rest over the bread, oiling both sides of each piece.",
    "Grill the bread on both sides until lightly golden and toasted, then set aside. (Leave the grill or pan on medium heat). Rub each slice of bread on both sides with the raw garlic clove, which will turn into a thin layer of garlic paste on the surface of the bread.",
    "In a heavy skillet, fry the prosciutto over medium-high heat until all of the fat has rendered and the prosciutto is crispy. Set aside.",
    "Cook the asparagus in the prosciutto fat pan and sprinkle with salt and grill until tender on the hot grill or grill pan. About 3-4 minutes.",
    "Layer two ounces of cheese on each slice of bread and cook in same pan for about 1 minute or JUST until the cheese has started to melt.",
    "Pile the asparagus on top of the cheese and put the prosciutto on top. Serve sandwiches hot or slice in half and serve as appetizers."
  ],
  "ingredients": [
    "0",
    "4 large slices rustic bread (such as como)",
    "1/8 cup olive oil",
    "1 clove garlic",
    "8 ounces brie cheese (or some other soft, melty cheese)",
    "16 spears asparagus",
    "kosher salt",
    "8 slices prosciutto"
  ],
  "__v": 1
}