{
  "hash": "300204af6fdaa3061d01e23b28e3d31a5df9d07f",
  "title": "Creamy Tomato Tortellini Soup",
  "image": "",
  "href": "http://recipe-folder.com/recipe/5e5932d748b0720821295688",
  "extension": "User Added",
  "firstAdded": "2020-02-28T15:33:43.166000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "eat about 2 tablespoons of olive oil in a large Dutch oven. Cook the onion until softened, about 6-8 minutes. Add garlic and Italian seasoning, cook for another 2 minutes until fragrant.",
    "1",
    "Sprinkle the flour and cook for 1 minute, stirring. Add broth, and stir until the flour dissolves. Stir in the canned diced tomatoes. Bring to a boil and then reduce to a simmer for 5-6 minutes, uncovered. Blend the soup using an immersion blender until smooth. Note: if you don’t have an immersion blender, you can use a regular blender and return to the pot after blending. Just be sure to do it in batches and carefully since the liquid will be hot.",
    "2",
    "Stir in the sugar to reduce the acidity of the tomatoes. Season with salt and pepper to taste.",
    "3",
    "Add the tortellini and simmer for 12-15 minutes or according to package instructions. If you’re using frozen tortellini, you may have to cook it a bit longer.",
    "4",
    "Add heavy cream to taste and simmer for 3 minutes. Add spinach, and cook for another 1-2 minutes, stirring. Top with parmesan cheese when serving. Enjoy!",
    "5",
    "Recipe Notes",
    "6",
    "Special equipment: Immersion blender.",
    "7",
    "Storing: Refrigerate in an airtight container for up to 3 days. To reheat, simmer in a saucepan or a pot until warmed up. Or microwave.",
    "8",
    "Freezing: This soup will freeze well for up to 2 months. Let the soup cool completely and freeze in freezer-friendly containers or bags. To reheat, thaw in the refrigerator first, usually overnight or over 2 days."
  ],
  "ingredients": [
    "0",
    "Olive oil",
    "1",
    "1 small yellow onion, diced",
    "2",
    "3 cloves garlic, minced",
    "3",
    "1 teaspoon Italian seasoning",
    "4",
    "2 tablespoons all-purpose flour",
    "5",
    "3 cups chicken or vegetable broth",
    "6",
    "1 (28 oz) can diced tomatoes (preferably fire-roasted)",
    "7",
    "1 teaspoon granulated sugar",
    "8",
    "Salt and pepper to taste",
    "9",
    "4 to 5 cups fresh or frozen cheese tortellini",
    "10",
    "1/2 cup heavy cream, plus more to taste",
    "11",
    "3 cups fresh spinach leaves, packed",
    "12",
    "Shredded parmesan cheese for topping"
  ],
  "__v": 1,
  "hidden": true
}