{
  "__v": 1,
  "directions": [
    "0",
    "Wash kale if needed, and spin dry or dry with paper towels. Heat the oil, either in the Ninja Cooker on the Stovetop/High setting or in a large frying pan on medium-high. When the oil is hot, add the kale and saute until it's softened into a flat layer, about 3-4 minutes in the Ninja Cooker and slightly less in a pan. If you're using a regular slow cooker, spray it well with non-stick spray or oil and transfer the cooked kale to the slow cooker. If you're using the Ninja Cooker, turn to Slow Cook/Low setting.",
    "Drain red peppers and chop into fairly small pieces. Slice the green onions and crumble the Feta. Add the chopped red pepper and sliced green onion to the slow cooker with the kale. Beat the eggs well, pour over other ingredients in the slow cooker, and stir so all ingredients are well-combined. Season with Spike Seasoning and black pepper, then sprinkle on the Feta.",
    "Cook on low for 2 - 3 hours, or until the frittata is well set and cheese is melted. (I cooked mine for 2 hours and 45 minutes and it was perfect, but I got distracted with a phone call and it may have been done slightly sooner than that. I think the Ninja cooks a little hotter than other slow cookers, so it may take slightly longer if you don't use the Ninja Cooker.) Serve hot, with a dollop of low-fat sour cream if desired.",
    "This will keep well in the fridge for several days and can be reheated in the microwave. (Don't microwave too long or it will get rubbery.)"
  ],
  "firstAdded": "2014-10-05T22:51:26.641000",
  "hash": "64f63a1eb91d75b33c5d006bf192720ea02092b1",
  "href": "http://www.kalynskitchen.com/2013/08/slow-cooker-frittata-kale-red-pepper-feta.html",
  "image": "http://4.bp.blogspot.com/-YGwmEknuiqQ/Uf6nYKSt3CI/AAAAAAAAiM4/CIPNIt6yd2M/s1600/1-text-slow-cooker-kale-frittata-500-kalynskitchen.jpg",
  "ingredients": [
    "0",
    "1 - 2 tsp olive oil to saute the kale (only 1 teaspoon for the Ninja, but 2 teaspoons to saute on the stove.)",
    "5 oz. baby kale",
    "non-stick spray or oil (to spray the slow cooker if you don't use the Ninja)",
    "6 oz. roasted red pepper (from a jar), diced fairly small",
    "1/4 cup sliced green onion",
    "4-5 oz. crumbled Feta",
    "8 eggs, well beaten",
    "1/2 tsp. Spike Seasoning (or other all-purpose seasoning blend)",
    "fresh-ground black pepper to taste",
    "low-fat sour cream for serving (optional, but good)"
  ],
  "keywords": [
    "olive",
    "oil",
    "kale",
    "ninja",
    "saute",
    "stove",
    "baby",
    "spray",
    "slow",
    "cooker",
    "dont",
    "use",
    "roasted",
    "red",
    "pepper",
    "jar",
    "fairly",
    "green",
    "onion",
    "crumbled",
    "feta",
    "eggs",
    "spike",
    "allpurpose",
    "seasoning",
    "blend",
    "freshground",
    "black",
    "lowfat",
    "sour",
    "cream",
    "good"
  ],
  "title": "Slow Cooker Frittata with Kale, Roasted Red Pepper, and Feta",
  "users": [
    null
  ]
}