{
  "hash": "dffd490be2d9a6ed8cb2b046482fc91d4d906a2e",
  "title": "Pie Maker Mini Cinnamon Scrolls",
  "image": "https://img.bestrecipes.com.au/NRNT9gcx/w643-h428-cfill-q90/br/2018/03/best-mini-cinnamon-scrolls-recipe-515914-1.jpg",
  "href": "https://www.bestrecipes.com.au/recipes/best-mini-cinnamon-scrolls-recipe/fpo3uejp",
  "extension": "Chrome",
  "firstAdded": "2020-04-03T00:15:07.617000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 200°C.",
    "Heat the milk and butter in a small pan until it almost comes to a boil, then take it off the heat and allow it to cool down. You don't want the milk to be too hot when you add the yeast or it will prevent it from rising.",
    "Mix together the flour, sugar and salt in a large bowl. Add the yeast and stir to combine. Make a well in the middle of the ingredients and add the warm milk mixture. Mix everything together until the dough starts pulling away from the side of the bowl.",
    "Cover the bowl with plastic wrap and set it aside in a warm place for 30 minutes.",
    "Meanwhile, make the filling. Mix together the butter, sugar and cinnamon in a bowl until well combined. Lightly spray two mini muffin trays with oil, or grease with melted butter, and set aside.",
    "Divide the dough into two pieces. Working with one piece at a time, and using a rolling pin, roll out the dough on a lightly floured surface to form a 20 cm x 30 cm rectangle. Spread ½ the filling evenly over the rectangle. Roll it up using one of the long edges to make a long cylinder shape.",
    "Using a sharp knife, cut the rolled up dough into 12 slices. Place each piece into a mini muffin cup. Continue with the other piece of dough until all the cups are filled. Cover the trays with oiled plastic wrap and let the scrolls rise in a warm place for 30-40 minutes, or until they've doubled in size.",
    "Bake the scrolls on the middle shelf of the oven for 10-15 minutes or until golden brown. Remove the scrolls from their pan and let them rest on a cooling rack while you prepare the icing.",
    "To make the icing, whisk together the icing sugar and milk in a small bowl. If it seems too thick add a little more milk ½ teaspoon at a time. Once you have a smooth, runny icing, drizzle it over the scrolls. Allow the scrolls to set before serving."
  ],
  "ingredients": [
    "0",
    "225 ml milk",
    "75 g unsalted butter",
    "425 g plain flour sifted",
    "70 g caster sugar",
    "1/2 tsp sea salt",
    "10 g fast action dried yeast"
  ],
  "__v": 2
}