{
  "hash": "7bc12c335cfd95a881a34f9a0050d8b8b79f392d",
  "title": "Stir-Fried Chicken with Chinese Garlic Sauce",
  "image": "http://3.bp.blogspot.com/-QACCR-QAUdk/UXScqbzkXAI/AAAAAAAAKtE/7ezj0rPg7Mk/s1600/stir+fried+chicken+with+chinese+style+garlic+sauce.jpg",
  "href": "http://blog.seasonwithspice.com/2013/04/stirfry-chicken-with-garlic-sauce.html",
  "firstAdded": "2015-02-21T03:03:14.587000",
  "users": [
    null,
    null
  ],
  "keywords": [
    "chicken",
    "breast",
    "tenders",
    "crosswise",
    "inchthin",
    "strips",
    "sesame",
    "oil",
    "season",
    "spices",
    "white",
    "pepper",
    "peanut",
    "garlic",
    "ginger",
    "red",
    "chili",
    "roughly",
    "onion",
    "snow",
    "peas",
    "trimmed",
    "bell",
    "squeezed",
    "lemon",
    "juice",
    "rice",
    "vinegar",
    "low",
    "sodium",
    "soy",
    "dark",
    "chinese",
    "wine",
    "dry",
    "sherry",
    "brown",
    "sugar",
    "cornstarch"
  ],
  "directions": [
    "0",
    "In a large bowl, toss chicken strips with toasted sesame oil and white pepper. Marinate for 10 minutes.",
    "In a small bowl, stir together rice vinegar, soy sauce, dark soy sauce, Chinese rice wine (if using), brown sugar and cornstarch. Set aside.",
    "Heat a wok or large frying pan over high heat. Add 2 tbsp of oil. When the oil is hot, add the chicken pieces, spreading it out as much as possible. Sear for 1 minute without stirring until the edges are lightly browned, then stir to cook all sides until just cooked through - about 2-3 minutes more. Transfer chicken to a bowl (leaving the oil in the wok), and set aside.",
    "Heat the wok on low fire, and when hot again, add in garlic, ginger, and red chili flakes. Stir-fry for about 10 seconds, or until fragrant. Turn up the heat to high, add in snow peas and red onion, and stir-fry for another 30 seconds. Add in red bell pepper, and cook for one minute – making sure to stir and toss the ingredients well. Then take the prepared sauce, give it a stir, and quickly pour it into the wok, cooking until the sauce thickens – about 30 seconds. Add in a bit of water if needed. Stir in the cooked chicken, toss well, and cook for a further 30 seconds. Turn fire off, squeeze lemon juice over the dish, and then transfer to a serving plate. Serve hot with steamed rice (brown rice is best)."
  ],
  "ingredients": [
    "0",
    "1 pound chicken breast tenders – cut crosswise into 1/2-inch-thin strips",
    "1 tsp toasted sesame oil",
    "1/4 tsp Season with Spice’s finely ground white pepper",
    "2 tbsp peanut oil or vegetable oil",
    "5-6 garlic cloves – minced",
    "1 tbsp freshly grated ginger",
    "1 tsp red chili flakes",
    "1/2 cup roughly chopped red onion",
    "A handful of snow peas - trimmed",
    "1/2 red bell pepper – cut into thin strips",
    "1 tbsp freshly squeezed lemon juice",
    "For the sauce:",
    "1 tablespoon rice vinegar",
    "1 1/2 tablespoon low sodium soy sauce",
    "1 tablespoon dark soy sauce",
    "2 teaspoons Chinese rice wine, or dry sherry (optional)",
    "1/2 tablespoon brown sugar",
    "1 tbsp cornstarch"
  ],
  "__v": 2
}