{
  "hash": "d6fd758e3839861cc5cf76efa2ffdf11fce4fb47",
  "title": "Spicy Vegetarian Lentil Samosas",
  "image": "https://i1.wp.com/eathealthyeathappy.com/wp-content/uploads/2014/07/lentilsamosas12feat1.jpg?fit=750%2C563",
  "href": "http://eathealthyeathappy.com/spicy-lentil-samosas-vegetarian/",
  "extension": "Chrome",
  "firstAdded": "2017-08-14T20:40:59.153000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the oven to 375. Rinse the lentils well, then combine with water in a medium pan. Put a lid on tilted so steam can escape, and simmer on medium heat about 20-25 minutes. While the lentils cook, get the veggies, ginger and garlic ready.",
    "In a large pan, combine the oil and chopped onion over medium heat. Cook until the onions start to get tender, about 5 minutes. Add the potatoes, carrot and spices and cook for about 10 minutes, stirring occasionally. Lower the heat if things start to stick. Add the pepper, ginger and garlic and cook for another 10 minutes. Add some water if it starts to look dry.",
    "When the lentils are done, stir them in. Cook everything together for 5-10 minutes, stirring occasionally and adding water if needed.",
    "Spray two cookie sheets with nonstick. Prepare samosas as shown, arrange on the sheets and give them a good dousing with nonstick to help them brown. Bake 10 minutes, then turn them over, spray again and bake another 10 minutes."
  ],
  "ingredients": [
    "0",
    "1 c lentils",
    "3 c water",
    "2 medium potatoes, peeled and diced",
    "2 small or 1 large carrot, diced",
    "a 2' cube fresh ginger, chopped fine",
    "5-7 cloves garlic, chopped fine",
    "1 large onion, diced",
    "1 red pepper, diced",
    "1 green chile (optional), seeded and diced",
    "2 Tbs olive oil",
    "1-2 tsp curry powder",
    "1-2 tsp garam masala",
    "1 tsp paprika (spring for smoked, you won't be disappointed)",
    "1 tsp chili powder",
    "1 tsp cumin",
    "1/4 - 1/2 tsp red pepper flakes",
    "1/2 tsp salt",
    "12 egg roll or spring roll wrappers",
    "nonstick cooking spray"
  ],
  "__v": 1
}