{
  "hash": "38c181ccac8c80176787051be55f71ab486c3b68",
  "title": "Beignets",
  "image": "",
  "href": "http://recipe-folder.com/recipe/5b772be63d946d7ece1c64b1",
  "extension": "User Added",
  "firstAdded": "2018-08-17T20:11:18.983000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Start by combining 1 ½ cups of buttermilk with ½ a cup of boiling milk to which we are going to add 4 tsp of dry yeast and 2 ½ Tbsp of sugar.",
    "1",
    "Stir to combine and set aside for 10 minutes.",
    "2",
    "In a stand mixer bowl, combine 22 ounces of bread flour with ½ tsp of baking soda and ½ a tsp of kosher salt. Mix to combine before adding our milk and yeast mixture. Make sure your dough hook is attached and mix for about 3-4 minutes. You want the dough to be sticky.",
    "3",
    "Transfer dough to a separate bowl. Cover and let sit for 1 hour.",
    "4",
    "Liberally flour your work surface and turn out your dough onto the flour. Coat the dough with a nice thick layer of flour before rolling out to about ¼ inch thick. Trim off the edges to make a nice big rectangle and then cut into smaller rectangles.",
    "5",
    "Preheat your oil to 370°F and then add 3-5 pieces of dough to the oil. Be sure to baste the skyward facing side of the beignets constantly for about 2 minutes before flipping and letting cook for about 30 more seconds.",
    "6",
    "Remove from oil and place on a plate that is lined with paper towels.",
    "7",
    "Dust them down with liberally with powdered sugar. Serve and enjoy!",
    "8",
    "If you want to make them like the beignets from The Princess and the Frog, add honey to them before you add your powdered sugar!"
  ],
  "ingredients": [
    "0",
    "1 ½ cups buttermilk",
    "1",
    "½ cup boiling milk",
    "2",
    "4 tsp dry yeast",
    "3",
    "2 ½ Tbsp sugar",
    "4",
    "22 ounces of bread flour",
    "5",
    "½ tsp baking soda",
    "6",
    "½ tsp kosher salt",
    "7",
    "Flour",
    "8",
    "2 quarts of vegetable oil",
    "9",
    "Honey (optional)"
  ],
  "__v": 1,
  "hidden": true
}