{
  "hash": "b02fb9d23e37b496bfc8d26f222fa2c5bef91d97",
  "title": "Greek-Style Winter Greens Pie",
  "image": "http://www.pbs.org/food/wp-content/blogs.dir/2/files/2012/02/jennifer-greek-style-winter-greens-pie-288x162.jpg",
  "href": "http://www.pbs.org/food/recipes/greek-style-winter-greens-pie/",
  "extension": "Chrome",
  "firstAdded": "2017-04-02T14:28:50.760000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400 degrees.",
    "Heat 1 tablespoon olive oil in a very large skillet over medium heat. Saute the onions and garlic, stirring frequently, until golden and tender. Add the greens and allow to wilt, stirring often to bring wilted greens to the top. When the greens have cooked down, continue sauteing until the pan is dry, another 3 or 4 minutes. Set aside to cool slightly.",
    "Combine eggs, feta, salt, pepper flakes, scallions, parsley, and lemon juice in a large bowl. Add the cooked greens, and stir to combine.",
    "Pour the remaining 3 tablespoons olive oil into a small bowl. Use a pastry brush to lightly coat the inside of a 9x9 square baking dish with the olive oil. Unroll the phyllo sheets and cover with a damp cloth while you work. Stack 3 sheets on a cutting board and lightly brush with olive oil, then fit into the bottom and sides of prepared pan. Repeat with 3 more sheets, and fit into pan at a 90-degree angle to the first sheets.",
    "Fill pan with greens mixture, then oil and layer 3 more stacked sheets of phyllo on top, folding and tucking to enclose filling. Brush top with any remaining olive oil. Use a sharp knife to score pie all the way through, into 6 portions.",
    "Bake pie in the preheated oven until puffed, golden, and crisp, about 30 minutes. Cool slightly then re-cut along scored portion lines. Serve hot, warm or at room temperature."
  ],
  "ingredients": [
    "0",
    "4 tablespoons olive oil, divided",
    "1 large onion, diced",
    "2 cloves garlic, minced",
    "10 cups chopped winter greens, such as kale, chard, beet greens, and turnip greens, center ribs removed",
    "2 eggs",
    "4 ounces crumbled feta cheese",
    "¼ teaspoon salt",
    "¼ teaspoon red pepper flakes",
    "½ cup chopped scallions",
    "½ cup chopped parsley",
    "2 tablespoons fresh lemon juice",
    "9 phyllo dough sheets, thawed"
  ],
  "__v": 1
}