{
  "hash": "4d0a40f58863a64cefb456506ce95b4fd3b0fc21",
  "title": "HE BEST 9 VEGETABLE LASAGNA EVER! [VEGAN]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/01/lasagna-side-angle-lead-picture.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/nine-vegetable-lasagna/",
  "firstAdded": "2015-01-22T19:03:56.669000",
  "users": [
    null
  ],
  "keywords": [
    "lasagna",
    "noodles",
    "jars",
    "arabiata",
    "used",
    "raos",
    "arabriata",
    "using",
    "regular",
    "tomato",
    "sure",
    "red",
    "pepper",
    "vegan",
    "cheese",
    "follow",
    "heart",
    "daiya",
    "mozzarellas"
  ],
  "directions": [
    "0",
    "Preheat the oven to 450°F",
    "Steam the onion, broccoli, carrots, cauliflower, zucchini, sweet potato until soft (about 10 minutes)",
    "Add the spinach leaves and finish steaming until just wilted (about 3 minutes)",
    "While the vegetables are steaming: Pour 1 jar of tomato sauce into a large bowl",
    "Puree the ricotta ingredients and add to the tomato sauce",
    "Puree the steamed vegetables and add to the tomato sauce. You should now have the ricotta, tomato sauce, and the steamed vegetables all stirred together.",
    "Add a thin layer of tomato sauce on the bottom of your pan",
    "Layer the lasagna noodles so they are overlapping a 1/2 inch for each noodle",
    "Spread a layer of cheese on top of each noodle",
    "Spread a layer of sauce",
    "Repeat until all of your ingredients are gone",
    "Top with cheese and sauce, put foil on the top of the casserole, and put it in the oven!",
    "I take the 2nd jar of sauce and pour half on top of the lasagna and serve the other half in a bowl for dinner.",
    "After 1/2 hr, reduce the cooking temperature to 350°F.",
    "Cook an additional half an hour up to a full hour, then let it rest for 15 minutes before slicing. Mangia! Mangia!"
  ],
  "ingredients": [
    "0",
    "1 package of lasagna noodles",
    "2 jars of arabiata tomato sauce (I used Rao’s Arabriata Tomato Sauce. If using regular tomato sauce, be sure to add red pepper flakes to it.)",
    "3 packages of vegan cheese (I used Both Follow Your Heart and Daiya Mozzarellas), shredded"
  ],
  "__v": 1
}