{
  "hash": "8a9189665447da3d78101cb67ef938730e857422",
  "title": "Save\n0 from 0 votes Print\nBanana Bundt Cake {with cream cheese frosting}",
  "image": "https://www.crazyforcrust.com/wp-content/uploads/2014/08/Banana-Bundt-Cake-with-Cream-Cheese-Frosting.jpg",
  "href": "https://www.crazyforcrust.com/banana-bundt-cake/",
  "extension": "Chrome",
  "firstAdded": "2018-11-30T13:25:52.112000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350°F. Butter and flour a 12-cup fluted bundt pan.",
    "Whisk together flour, salt, and baking powder in a medium bowl. With an electric mixer, cream butter and sugar until light and fluffy. Stir in mashed bananas and vanilla. Add eggs, one at a time, beating well after each addition. Add the flour mixture (with the mixer on low) in two parts alternately with the buttermilk, beginning and ending with flour. Beat just until it comes together. Do not overmix!",
    "Pour batter into prepared pan. Bake until a toothpick inserted in centers comes out clean, 45-55 minutes.",
    "Once done, cool cake completely in pan. Turn out cake onto serving dish.",
    "Make the frosting: Mix melted butter and cream cheese. Mix in powdered sugar, salt if using, and vanilla. The frosting will be thick but still easily spreadable. Pour over cake and use a spatula to frost it. (I use a whisk to make my frosting, if the cream cheese is soft enough. If not, use a hand mixer.)",
    "Store cake loosely covered in the refrigerator. It tastes best at room temperature. Will keep for up to 3 days."
  ],
  "ingredients": [
    "0",
    "1 teaspoon salt",
    "1 teaspoon baking powder",
    "3 cups all-purpose flour plus more for pan (be sure to use a spoon to scoop the flour into the measuring cup so that it is not packed and you do not use too much)",
    "1/2 cup unsalted butter softened, plus more for pan",
    "2 overripe bananas mashed (about 1 cup)",
    "3/4 cup granulated sugar",
    "3/4 cup brown sugar",
    "5 large eggs",
    "1 teaspoon vanilla",
    "2/3 cup buttermilk make your own by adding 1 teaspoon white vinegar to 2/3 cup milk and let it sit for 5 minutes"
  ],
  "__v": 1
}