{
  "hash": "fc98fd394ddc746cb085e75bdb35edd8cd67997c",
  "title": "Tuscan Bean Soup",
  "image": "http://del.h-cdn.co/assets/cm/15/11/54fdf3e5b8f4d-tuscan-bean-soup-del0813-de.jpg",
  "href": "http://www.delish.com/cooking/recipe-ideas/recipes/a21841/tuscan-bean-soup-recipe-del0813/?zoomable",
  "extension": "Chrome",
  "firstAdded": "2016-06-22T19:46:40.989000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "Adult Slice the onion.",
    "Child Chop the onion into small pieces.",
    "Adult Smash the garlic with the flat side of the chef ’s knife to remove the peel and slice. Heat a large stockpot over medium heat. Add olive oil. When the oil is hot, add the chopped onion and reduce the heat to low. Cook, stirring occasionally, about 10 minutes, or until onions are translucent.",
    "Child Meanwhile, help chop the garlic slices and add to the onion. Help stir for three minutes or until lightly browned or onions are ready, using oven mitts to protect hands from heat. While the onions are cooking, help tear up the kale and broccoli rabe.",
    "Adult Add the greens to the stockpot, increase heat to medium, and stir the greens until they wilt.",
    "Child Help open the cans of beans and tomatoes with a can opener. With clean hands, squeeze the tomatoes into the stockpot.",
    "Adult Drain and rinse the beans in a colander. Add to the stockpot and bring to simmer, cooking 5 more minutes.",
    "Child Help stir while adult adds the chicken broth (using oven mitts to protect hands while stirring). Pluck the thyme leaves from their stems. Add to the pot.",
    "Adult Season to taste with salt and freshly ground pepper. Cook an additional 10 minutes and serve with Italian bread."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1 medium onion",
    "2 clove garlic",
    "2 tbsp. olive oil",
    "½ bunch kale",
    "½ bunch broccoli rabe",
    "2 can white cannellini beans",
    "1 can whole tomatoes",
    "4 c. chicken broth",
    "3 sprig fresh thyme",
    "kosher salt",
    "Freshly ground pepper",
    "1 loaf Italian bread"
  ],
  "__v": 1
}