{
  "hash": "cedcb7ac09efe9260788586903b60b6cb4e28042",
  "title": "Enchiladas Suizas",
  "image": "https://d2k9njawademcf.cloudfront.net/indeximages/47770/full/15602119365_27a9ab3a7b_b.jpg?1414066894",
  "href": "http://food52.com/recipes/26577-enchiladas-suizas?utm_source=zergnet.com&utm_medium=referral&utm_campaign=zergnet_399574",
  "extension": "",
  "firstAdded": "2015-03-02T18:18:22.869000",
  "users": [
    null
  ],
  "keywords": [
    "medium",
    "white",
    "yellow",
    "onion",
    "tomatillos",
    "poblano",
    "green",
    "chiles",
    "garlic",
    "unpeeled",
    "chicken",
    "stock",
    "cilantro",
    "stems",
    "leaves",
    "oregano",
    "preferably",
    "mexican",
    "allspice",
    "clove",
    "cumin",
    "zest",
    "juice",
    "lime",
    "salt",
    "jalapeo",
    "chile",
    "seeds",
    "boneless",
    "corn",
    "tortillas",
    "jack",
    "mild",
    "cheddar",
    "cheese",
    "sour",
    "cream",
    "crme",
    "frache",
    "crema"
  ],
  "directions": [
    "0",
    "Heat the broiler. Peel and quarter onion. Remove papery husks and wash tomatillos. Cut poblanos in half lengthwise and remove stems and seeds. On a foil-lined sheet pan, place onion, tomatillos, unpeeled garlic cloves and poblanos skin side up. Broil vegetables until mildly charred, turning the onion pieces and tomatillos over after a few minutes to expose other sides to the heat source. Take care that the garlic doesn't get too burnt.",
    "Scrape blackened skin from the poblanos, peel the garlic and put vegetables into a blender; include any juices from the baking sheet. (Drain and add canned green chiles, if using.) Add chicken stock, cilantro, spices, lime juice and zest, and salt and blend until completely puréed. Taste, and if you want it to be spicier, add the jalapeño and purée again until completely smooth.",
    "Pour contents of blender into a heavy-bottomed sauce pan and simmer for 20 to 30 minutes until slightly reduced. Taste and add more salt, if needed. If salsa is too thick, add a little bit of water to it. Lower oven temperature to 350° F.",
    "Make the enchiladas one at a time: Dip a tortilla in the salsa until just softened. Lay out on a plate, put some chicken across the middle of the tortilla and roll it up. Place in a baking dish or directly on an oven-safe dinner plate. When all of the tortillas have been made, ladle the salsa generously over them, sprinkle the cheese over the top, and place the baking dish or plates into the oven. Bake for 15 minutes, until chicken filling is heated through and cheese has melted. Serve with generous dollop of sour cream on top, and some chopped fresh cilantro."
  ],
  "ingredients": [
    "0",
    "1 medium white or yellow onion",
    "4 large or 6 small tomatillos",
    "2 poblano chiles (or 1 can of whole green chiles)",
    "3 to 4 cloves of garlic, unpeeled",
    "1 1/2 cups chicken stock",
    "1 handful cilantro leaves and stems, plus more leaves for garnish",
    "1/2 teaspoon dried oregano, preferably Mexican",
    "1 pinch ground allspice or clove",
    "1 teaspoon cumin, ground",
    "Zest and juice of one lime",
    "1 teaspoon salt, plus more to taste",
    "1 jalapeño chile, seeds removed (optional)",
    "2 cups boneless cooked chicken, shredded, sliced or diced",
    "8 corn tortillas",
    "2 cups shredded jack or mild cheddar cheese",
    "1/2 cup sour cream, crème fraîche, or Mexican crema"
  ],
  "__v": 1
}