{
  "hash": "f6f2b59893b40706bdaedf20d2f7f23d7f6049e6",
  "title": "Vegan Moussaka Recipe",
  "image": "http://f.tqn.com/y/easteuropeanfood/1/W/y/-/0/-/Vegan-Moussaka.jpg",
  "href": "http://easteuropeanfood.about.com/od/crossculturalmaincourses/r/Vegan-Moussaka-Recipe.htm",
  "extension": "Chrome",
  "firstAdded": "2015-04-19T08:58:40.662000",
  "users": [
    null
  ],
  "keywords": [
    "moussaka",
    "olive",
    "oil",
    "yellow",
    "onion",
    "garlic",
    "pressed",
    "eggplant",
    "cubes",
    "tempeh",
    "red",
    "wine",
    "stock",
    "water",
    "fireroasted",
    "firm",
    "tomatoes",
    "juice",
    "tomato",
    "cinnamon",
    "allspice",
    "pepper",
    "salt",
    "black",
    "bread",
    "crumbs",
    "vegan",
    "cheese",
    "bchamel",
    "soy",
    "milk",
    "spelt",
    "flour",
    "softened",
    "butter"
  ],
  "directions": [
    "0",
    "PREPARATION",
    "Heat the oven to 425 degrees. Place the olive oil in a large sauté pan over medium-high heat. Add the onion and garlic and cook for 3 minutes, stirring frequently. Add the eggplant, tempeh, wine, tomatoes, tomato paste, cinnamon, allspice and crushed red pepper flakes, and cook until the eggplant is just soft, about 18 minutes, stirring frequently. You may need to add a small amount of water to prevent sticking. Add the salt and pepper to taste.",
    "Meanwhile, prepare the béchamel sauce. Place the soy milk and salt in a small saucepan over medium-high heat. Heat until the milk is just about to boil, about 3 minutes. Lower the heat to low. Create a roux by combining the flour and vegan butter in a small bowl and mixing well. Add this to the soy milk and whisk well until the sauce thickens, about 3 minutes.",
    "Transfer the eggplant mixture to a well-oiled 8-inch casserole dish. Evenly sprinkle the bread crumbs on top. Pour the béchamel sauce on top of the bread crumbs and top with the grated vegan cheese.",
    "Bake until the cheese melts, about 10 minutes. Congratulate yourself for making moussaka before serving it warm.",
    "Note: If you like, you can sweat the eggplant before using in this dish. Slice the eggplant into 1/2-inch cutlets, then slice the cutlets into 1/2-inch cubes. Arrange in a single layer on a baking sheet or casserole dish and sprinkle liberally with salt. Allow to sit for 20 to 30 minutes before rinsing with water and draining well.",
    "Variations:",
    "Alternatively, you can slice the eggplant into 1/4-inch strips and grill them. Instead of mixing in the eggplant with the tempeh layer, you can create a layer of eggplant slices on the bottom of the casserole, which is how the dish is traditionally made.",
    "Replace the tempeh with an equal amount of chopped seitan or crumbled extra-firm or super-firm tofu."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "Moussaka:",
    "2 tablespoons olive oil",
    "1 small yellow onion, diced (1 1/4 cups)",
    "4 garlic cloves, pressed or minced",
    "1 small eggplant, cut into 1/2-inch cubes (3 cups) (see Note, below)",
    "8 ounces tempeh, diced",
    "3/4 cup red wine or vegetable stock or water",
    "1 (14.5-ounce) can fire-roasted tomatoes, or 1 3/4 cups diced and pressed firm tomatoes with juice",
    "2 tablespoons tomato paste",
    "1/4 teaspoon ground cinnamon",
    "1/4 teaspoon ground allspice",
    "1/4 teaspoon crushed red pepper flakes",
    "1 teaspoon sea salt, or to taste",
    "1/4 teaspoon freshly ground black pepper",
    "1/2 cup bread crumbs",
    "1 cup grated vegan cheese",
    "Béchamel Sauce:",
    "1 1/4 cups unsweetened soy milk",
    "1/4 teaspoon sea salt",
    "3 tablespoons spelt flour",
    "2 tablespoons softened vegan butter or olive oil"
  ],
  "__v": 1
}