{
  "hash": "8e55aaf0fb8d67e7733c752529dbc8f81f7ef575",
  "title": "Mashed Potato Cakes with Broccoli and Cheese",
  "image": "//images.food52.com/1jwcTdn7NL_nmBbOiiUjwAcnFvE=/753x502/d88f8f3d-c2e3-4872-a0ae-d26a048b33a6--2014-1031_mashed-potato-cakes-011.jpg",
  "href": "https://food52.com/recipes/26127-mashed-potato-cakes-with-broccoli-and-cheese",
  "extension": "Chrome",
  "firstAdded": "2016-08-02T19:07:53.559000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Peel the potatoes and cut them into 2-inch pieces. Put them in a large pot and add cold water to cover and several large pinches of salt. Bring to a boil, then lower the heat and simmer the potatoes until they easily slip off a sharp knife when you pierce them (this should take 15 to 20 minutes).",
    "While the potatoes are cooking, combine the butter and milk with 1/2 teaspoon of salt in a small saucepan and set over low heat. When the milk is hot and the butter has melted, turn off the heat.",
    "Drain the cooked potatoes and return them to the pot over low heat. Mash them with a potato masher or a fork over the heat (this removes any excess water from the potatoes). Still over the heat, stir in the warm milk and butter, and then the crème fraîche or sour cream and a few grinds of pepper. Taste and add more salt if necessary. Cover the pot and set the potatoes aside to cool to room temperature.",
    "Heat the olive oil in a medium saucepan over low heat. Add the broccoli, garlic, and a large pinch of salt; stir through. Cook until the broccoli is completely soft and everything is lightly caramelized, about 20 minutes. Remove the broccoli from the pan and chop it finely.",
    "Add the broccoli to the room temperature potatoes, along with the cheddar, eggs, and 1/2 cup panko. Combine thoroughly.",
    "Put the rest of the panko in a shallow dish and season with salt and pepper. Form the potato mixture into small cakes (about 2 inches in diameter) and coat them well in the panko.",
    "Heat the oven to 250° F and arrange a cooling rack on a rimmed baking sheet. Set a large heavy skillet over medium heat and cover the bottom of the pan with a thin layer of olive oil. When the oil is hot, fry the potato cakes in batches (don't crowd the pan!) until browned, about 2 minutes per side. Transfer the cakes to the rack as they're done, and keep them warm in the oven while you cook the rest. Serve warm with a poached egg on top of each cake, if you like.",
    "***I used potatoes from a box. Baked at 350 for 20 minutes. Turn on broil for about 1-2 minutes each side."
  ],
  "ingredients": [
    "0",
    "2 pounds Yukon gold potatoes",
    "Kosher salt",
    "3 tablespoons unsalted butter",
    "1/2 cup whole milk",
    "2 tablespoons crème fraîche or sour cream",
    "Freshly ground black pepper",
    "3 tablespoons olive oil, plus more for frying",
    "1 1/2 cups broccoli florets",
    "1 fat clove garlic, crushed",
    "1/2 cup grated sharp cheddar cheese",
    "2 large eggs, beaten",
    "2 1/2 cups panko crumbs",
    "Poached eggs for serving (optional)"
  ],
  "__v": 2
}