{
  "hash": "70bca02fe70de851b8c3b32c05e33dc402024331",
  "title": "Spiced potatoes with cashews, fennel, coriander and cardamom",
  "image": "http://recipe-folder.com/img/recipe-images/032/023/3523392032.jpg",
  "href": "http://www.telegraph.co.uk/food-and-drink/recipes/spiced-potatoes-with-cashews-fennel-coriander-and-cardamom/",
  "extension": "Chrome",
  "firstAdded": "2017-03-29T00:00:08.629000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "METHOD",
    "Soak the cashew nuts in warm water for 20 minutes.",
    "Prick the new potatoes with a fork lightly (this helps them cook all the way through). Heat 1 tbsp vegetable oil in a wok or kadhai. Add the potatoes and fry for 3-4 minutes until they turn crisp and golden brown. Drain on kitchen paper and set aside.",
    "Paid content",
    "Recommended by",
    "Whisk the yogurt and mix in the chilli powder, fennel powder and cumin powder. Stir the spiced yogurt and set aside.",
    "Drain most of the water from the cashew nuts; blend the cashew nuts to a fine puree. Set aside.",
    "Heat the remaining oil in the kadhai. Add the chopped onions and sauté until they begin to soften for 4-5 minutes.",
    "Add the chopped garlic and ginger and fry for a couple of minutes as it cooks.",
    "Turn the heat to a low setting and add the spiced yogurt. Stir well for a minute and add the cashew nut paste. Stir for 2-3 mins.",
    "Tip in the tomato puree and stir for a further 2 minutes. As the curry starts to leave oil from the sides of the pan add the fried potatoes, water and salt to taste.",
    "Bring to a boil and simmer for 10-15 mins stirring ever so often until the potatoes have soaked in the flavours and cooked all the way through.",
    "Add the cardamom powder, crushed methi/fenugreek leaves if using, fresh coriander and ginger."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "60g cashew nuts",
    "18-20 small new potatoes, peeled",
    "3 tbsp vegetable oil",
    "200g Greek yogurt, lightly whisked",
    "1½ tsp kashmiri chilli powder (or mild paprika)",
    "1 tsp fennel powder",
    "½ tsp cumin powder",
    "1 medium white onion, finely chopped",
    "3 cloves of garlic, finely chopped",
    "2.5cm piece of ginger, finely chopped",
    "2 tbsp tomato puree",
    "150ml water",
    "½ tsp ground cardamom powder",
    "1 tsp crushed dried fenugreek leaves (optional)",
    "1 tbsp coriander leaves for garnish",
    "Slivers of ginger for garnish"
  ],
  "__v": 1
}