{
  "hash": "57fd93b693ad7bf36817e2bd7d6ba6da6fed2ac0",
  "title": "Pineapple Upside Down Cake Jell-O® Shots",
  "image": "http://tiphero.com/wp-content/uploads/2017/04/vlcsnap-2017-04-25-12h01m28s311-e1493148167302.png",
  "href": "http://tiphero.com/pineapple-upside-down-cake-jello-shots/",
  "extension": "Chrome",
  "firstAdded": "2017-07-03T00:40:03.305000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Equipment",
    "2 mini muffin tins",
    "non-stick cooking spray (without strong flavor)",
    "Directions",
    "Use a knife to cut a tiny bit off of the very bottom off of each maraschino cherry so that it will sit upright. Spray the mini muffin tins with non-stick cooking spray. Place 1 trimmed cherry in each cup of the mini muffin tins.",
    "Pour the pineapple juice into a small saucepan. (If you want sweeter jello shots, you can whisk in the granulated sugar at this point.) Whisk the powdered gelatin into the juice mixture little by little and let it sit for 5 minutes, or until the gelatin has softened.",
    "Heat the pan over medium heat and whisk until the sugar (if using) and gelatin are completely dissolved, about 2 to 3 minutes. Do not let the mixture boil or it may prevent the gelatin from setting properly.",
    "Remove the pan from heat and stir in the vodka.",
    "Transfer half of the pineapple juice mixture to a separate container and stir in the grenadine.",
    "Add 2 teaspoons of the grenadine mixture to each cup of the mini muffin tins. Carefully transfer the tins to the refrigerator and chill them until the gelatin has set, about 20 minutes.",
    "Remove the muffin tins with the set grenadine mixture from the fridge and add 2 teaspoons of the pineapple juice mixture to each cup (make sure that the pineapple juice mixture is not too hot, or it else it will start to melt the grenadine layer). Carefully transfer the muffin tins back to the refrigerator and chill them until the gelatin has set, about 20 minutes.",
    "Take the jello shots out of the muffin tins and serve them immediately. If you want to serve them at a later time, transfer the finished jello shots to a sealed container or cover the muffin pan with plastic wrap and keep it in the fridge until you’re ready to serve them."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "one jar maraschino cherries",
    "1⅓ cups canned pineapple juice",
    "1 Tablespoon granulated sugar, or to taste (optional, for sweeter jello shots)",
    "2 Tablespoons (or 2 envelopes) unflavored powdered gelatin",
    "½ – ¾ cup vanilla flavored vodka or plain vodka",
    "1½ tablespoons grenadine"
  ],
  "__v": 1
}