{
  "hash": "c7d1da4910f5136af7bc0cf7a7e80b44080b7c8a",
  "title": "Chunky Chicken Chowder",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2012/3/1/0/0164246_chicken-chowder_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/sunny-anderson/chunky-chicken-chowder-recipe.html",
  "firstAdded": "2015-01-23T20:59:01.093000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "thighs",
    "bone",
    "skin",
    "kosher",
    "salt",
    "black",
    "pepper",
    "butter",
    "oil",
    "vidalia",
    "onion",
    "thyme",
    "sprigs",
    "bundle",
    "bay",
    "leaves",
    "garlic",
    "roughly",
    "stock",
    "russet",
    "potatoes",
    "cubes",
    "frozen",
    "white",
    "corn",
    "allpurpose",
    "flour",
    "milk",
    "cream",
    "lemon",
    "spritzing"
  ],
  "directions": [
    "0",
    "Cut the flaps from the thighs and cube the meat, leaving some meat on the bone. Season the chicken with salt and pepper. Add 2 tablespoons of the butter and the oil to a large stock pot on medium-high heat. When the butter is melted and oil is hot, add the chicken thigh bones and cubed thigh meat. Brown on all sides, then remove the meat to a plate. Lower the heat slightly and add the onions, thyme and bay leaves. Season onions with salt and saute until tender, about 5 minutes. Add the garlic and cook, stirring, until the garlic is tender, about 4 minutes more. Stir the chicken back into the pot and add the stock. Raise the heat, bring to a boil, then lower the heat and simmer for 20 minutes. Add the potatoes and frozen corn and bring to a boil. Reduce the heat to a simmer and cook until potatoes are tender, about 30 minutes more.",
    "Meanwhile, make a paste with the remaining 2 tablespoons of butter and the flour, in a small bowl and set aside. When the potatoes are tender remove the thyme sprigs and the bay leaves. Lower the heat and add the milk, cream and the flour paste in bits. Stir to mix and allow the flour to blend into the chowder. Season, to taste, with salt and pepper. Transfer the chowder to a serving bowl and spritz with lemon before serving.",
    "Cook's Note: Don't remove the bones from the soup. They have tasty morsels of chicken that you'll want to savor for the entire chowder experience.",
    "Recipe courtesy Sunny Anderson, 2010"
  ],
  "ingredients": [
    "0",
    "4 chicken thighs, bone in, skin removed",
    "Kosher salt and freshly ground black pepper",
    "4 tablespoons butter",
    "1 tablespoon vegetable oil",
    "1 large Vidalia or sweet onion, chopped",
    "10 to 12 thyme sprigs, in a bundle",
    "2 bay leaves",
    "4 cloves garlic, roughly chopped",
    "4 cups chicken stock",
    "2 russet potatoes, peeled and cut into bite-sized cubes",
    "8 ounces frozen white corn",
    "2 tablespoons all-purpose flour",
    "2 cups milk",
    "1 cup heavy cream",
    "1 lemon, halved for spritzing"
  ],
  "__v": 1
}