{
  "hash": "165b86b83513ad664b44f79ae224b29ca0110a90",
  "title": "Lemon Raspberry Trifle",
  "image": "",
  "href": "http://www.glorioustreats.com/2015/01/lemon-raspberry-trifle.html",
  "extension": "Chrome",
  "firstAdded": "2016-08-07T18:53:45.351000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare Lemon Curd by combining all ingredients in a double boiler (or a metal bowl over a pot of simmering water). Heat, while stirring (with a whisk), until mixture thickens. The lemon curd is done when it is thick enough to coat the back of a spoon. Remove from heat, cover and refrigerate until cool. If desired, pour lemon curd through a fine strainer before refrigerating. Lemon curd may be store in the fridge up to 2 weeks.",
    "Prepare cake. You may use a Sponge Cake (I used the recipe in my book, Glorious Layered Desserts), Angel Food Cake, or Pound Cake.",
    "Once baked and cooled (or feel free to use store bought) cut cake into small bites (about 1\" squares) and spread onto a baking sheet. Bake in a pre-heated oven at 350* for 8-12 minutes. Check after 5 minutes, you may want to flip them over or move them around a bit so they bake evenly. You want the cake to be dry on the outside, but have some softness in the center. Baking the cake bites is totally optional, but I love the bit of extra texture it adds to the final dessert.",
    "While the cake bakes, prepare raspberries by placing in a bowl and sprinkling 1-2 tablespoons of sugar evenly on the fruit. Stir and put in the fridge for 15-20 minutes, until there is some juice in the bottom of the bowl. Stir raspberries as needed to make sure the sugar gets dissolved and mixed in well. Frozen raspberries will be much juicer, so you'll have to adjust accordingly (fresh may need to sit in the fridge a bit longer). If using fresh berries, you may reserve a few for garnish if desired.",
    "Prepare lemon cream",
    "In the bowl of an electric mixer, beat cream cheese until smooth. Add heavy cream slowly, while mixing. When the cream begins to thicken, slowly add powdered sugar, vanilla and then (fully cooled) lemon curd. Continue to beat until all ingredients are well incorporated and mixture is light and fluffy.",
    "Assemble dessert-",
    "Scoop lemon cream into a large ziplock bag, close bag and snip off about 1/2 inch from one of the corners of the bag.",
    "Begin assembly by adding a few pieces of cake to each dish, then adding a layer of lemon cream, some raspberries (with some of the juices), then repeat - cake, cream, raspberries.",
    "Serve immediately or refrigerate up to 30 minutes before serving.",
    "If preparing ahead, prepare each component, but assemble shortly before serving."
  ],
  "ingredients": [
    "0",
    "Sponge Cake, Angel Food Cake or Pound Cake (1 loaf size cake, or 1/2 of a large round cake)",
    "Lemon Curd",
    "1/4 cup fresh lemon juice",
    "2 teaspoons finely grated lemon zest",
    "1/3 cup sugar",
    "4 egg yolks",
    "3 Tbsp. butter",
    "Lemon Cream",
    "4 oz. (1/2 block) cream cheese",
    "1 cup heavy cream",
    "1/2 cup powdered sugar",
    "1/2 teaspoon vanilla extract",
    "3 Tbsp. lemon curd (from recipe above)",
    "2 cups fresh or frozen raspberries"
  ],
  "__v": 1
}