{
  "hash": "ac1186fb52ba41a4935a4cb26d5c007ccc892a30",
  "title": "VEGAN SPANISH OMELET WITH CARAMELIZED ONION, ROASTED GARLIC AND ROSEMARY",
  "image": "http://cilantroandcitronella.com/wp-content/uploads/2015/11/Vegan-Spanish-Omelet-5-Cilantro-and-Citronella.jpg",
  "href": "http://www.cilantroandcitronella.com/vegan-spanish-omelet-with-caramelized-onion-roasted-garlic-and-rosemary/",
  "extension": "Chrome",
  "firstAdded": "2017-08-14T21:10:35.771000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "MARY",
    "Save Recipe Print Recipe",
    "Oil for frying",
    "1 large onion",
    "1 head garlic",
    "3 medium sized potatoes (about 45 grams)",
    "1 cup (120 grams) chickpea (gram) flour",
    "1 cup (250 ml) water",
    "1 teaspoon white vinegar",
    "1 teaspoon salt, plus a pinch for the onions",
    "2 teaspoons fresh rosemary, roughly chopped",
    "Heat a tablespoon of oil in a small pan over medium-low heat. Peel and slice the onion and add it to the pan with a pinch of salt. Fry very gently, stirring often, until golden brown and caramelized. It could take 45 minutes to an hour.",
    "Meanwhile, heat about 2 cm of oil in a pan over medium-high heat. I usually test my oil by dipping in a wooden chopstick. When bubbles form around the chopstick, the oil is hot. While the oil heats up, peel the potatoes, cut them in half lengthwise and slice into 1/2 to 1 cm slices. Fry the potatoes until soft and beginning to turn golden brown. Remove to a paper towel-lined dish to drain.",
    "You can roast your garlic in the oven, but I prefer to roast it in the microwave with a clay garlic roaster*(see note). Cut off the top of the head of garlic and drizzle over a tablespoon of oil. Place in the garlic roaster and cook on high for 2 minutes. Alternatively, place the oiled garlic in a microwave-safe dish and add 2 tablespoons of water. Cover with cling film or a plate and cook on high for 2 minutes or until soft. When cool enough to handle, squeeze out all the cloves and chop or mash them. Set aside.",
    "In a blender or food processor, combine the chickpea flour, water, vinegar, 1 teaspoon salt, and rosemary. Blend until it forms a smooth batter.",
    "In a large bowl combine the fried potatoes, caramelized onions, roasted garlic and chickpea flour batter and stir well. Heat 1 tablespoon of oil in a medium-sized pan over medium heat and add the omelet batter. Cover and cook for about 5 minutes until the bottom browns. Uncover and place a large plate over your pan. Quickly flip over the pan onto the plate. Slide the omelet back into the pan to cook on the second side, covered, for a further 5 minutes until brown. Finally, slide the omelet out of the pan onto a plate and serve."
  ],
  "ingredients": [
    "0",
    "AND ROSEMARY",
    "Save Recipe Print Recipe",
    "Oil for frying",
    "1 large onion",
    "1 head garlic",
    "3 medium sized potatoes (about 45 grams)",
    "1 cup (120 grams) chickpea (gram) flour",
    "1 cup (250 ml) water",
    "1 teaspoon white vinegar",
    "1 teaspoon salt, plus a pinch for the onions",
    "2 teaspoons fresh rosemary, roughly chopped"
  ],
  "__v": 1
}