{
  "hash": "d2a575967f246c6d54373385d7ae8f10173952e9",
  "title": "Fudgy Molten Lava Brookie Cups",
  "image": "",
  "href": "http://www.chelseasmessyapron.com/fudgy-molten-lava-brookie-cups/",
  "extension": "Chrome",
  "firstAdded": "2016-08-07T18:31:10.932000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium pan over low heat, combine the chocolate chips, sweetened condensed milk, and the pinch of salt.",
    "Stir constantly until the chocolate is melted and smooth. Remove from the heat and stir in the vanilla.",
    "Pour the mixture evenly in a parchment lined 8 x 8 pan. Place in the fridge and allow to harden for at least 2 hours. Using a 1/2 teaspoon measuring spoon, scoop out small bits and roll them into balls.",
    "Place the balls on a plate, cover, and freeze until completely frozen through.",
    "Preheat the oven to 350 degrees F. Generously grease a miniature muffin tin and set aside.",
    "Beat together the brownie mix, butter (not melted, just at room temperature), and the large egg until completely combined.",
    "Surround one of the chocolate balls with the brownie dough. The less surrounding the chocolate ball, the more \"molten\" the chocolate will be.",
    "Place the cookie brownie balls into the prepared muffin tin. They should only fill the muffin tin 3/4ths the way.",
    "Bake for 12-14 minutes remembering the key to the molten is slightly underbaking these.",
    "Remove and allow to cool. Twist out (or coax with a spoon) of the muffin tin.",
    "Enjoy optionally topped with a sprinkle of powdered sugar.",
    "For a molten treat later on, microwave these for 5-10 seconds and enjoy!"
  ],
  "ingredients": [
    "0",
    "3 cups milk chocolate chips",
    "1 can (14 ounces) sweetened condensed milk",
    "Tiny pinch of salt",
    "2 teaspoons vanilla extract",
    "1 (18.4 ounces) chocolate fudge brownie mix (do not make according to package directions, follow the instructions in this recipe)",
    "1/2 cup butter, at room temperature not melted",
    "1 large egg",
    "Optional: powdered sugar"
  ],
  "__v": 1
}