{
  "hash": "8f67d3869d3152b6a8a4fbd54943d17a27b3b2e4",
  "title": "Easy Balsamic Chicken Skewers + BIG GIVEAWAY!",
  "image": "http://www.gimmesomeoven.com/wp-content/uploads/2014/05/DeLallo-Balsamic-Chicken-Skewers-4.jpg",
  "href": "http://www.gimmesomeoven.com/easy-balsamic-chicken-skewers/",
  "extension": "Chrome",
  "firstAdded": "2016-08-28T21:03:31.622000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Whisk together balsamic vinegar and honey until combined to form your marinade. Add the marinade and chicken pieces to a large ziplock bag or mixing bowl, and toss until combined. Seal/cover and refrigerate to marinate for at least 10 minutes, or up to 8 hours. Also, if you are using wooden skewers, set them to soak in a pan of water for at least 10 minutes so that they do not burn.",
    "When you are ready to cook the chicken, heat a grill to medium-high heat. Remove the chicken pieces from the marinade, reserving the marinade for later, and thread chicken onto skewers. Season the skewers generously with salt and pepper. Place on a grill that has been lightly greased with cooking spray. Cook the chicken skewers for 3-4 minutes per side, turning once, until the chicken is no longer pink inside and cooked through. Remove chicken skewers from grill and place on a serving plate.",
    "Meanwhile or after, pour the reserved marinade into a small saucepan and bring to a boil over high heat. Reduce heat to medium-low and simmer for about 12 minutes, or until the mixture is reduced by half and is thick enough to coat the back of a spoon. (The glaze will thicken even more as it cools.) Remove from heat, and brush the glaze onto the skewers until they are all evenly coated. Serve warm."
  ],
  "ingredients": [
    "0",
    "2 cups DeLallo balsamic vinegar",
    "1/4 cup honey",
    "2 pounds boneless, skinless chicken breasts, cut into bite-sized pieces",
    "kosher salt and freshly-ground black pepper",
    "wooden or metal skewers"
  ],
  "__v": 1
}