{
  "hash": "628049d725435dd02d9a6796b33fd883f57521e8",
  "title": "Balthazar's Mushroom Soup",
  "image": "https://farm1.staticflickr.com/887/39243287200_6a77185134_z.jpg",
  "href": "https://smittenkitchen.com/2007/01/balthazar-cream-of-mushroom-soup/",
  "extension": "Firefox",
  "firstAdded": "2019-07-14T23:33:06.184000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare your dried mushrooms: Soak them in 1 cup of boiling water for 20 to 30 minutes, until plump. Remove them from the liquid and mince the mushrooms, setting them aside. Strain the soaking liquid through a coffee filter to remove grit and reserve this too.",
    "Make the soup: Bundle your sage and rosemary together with kitchen twine. Heat the olive oil in a large pot over a medium flame. When the oil is hot, add the herb bundle and sizzle for a few minutes on both sides to infuse the oil. Add the onion, garlic, salt and pepper and cook for 5 minutes, until the onion is soft and translucent but not brown. Turn the flame to high and add the white mushrooms and shiitakes. Cook for 10 minutes, during which the mushrooms will give off their liquid (which should evaporate quickly due to the high heat) and deflate significantly. Stir occasionally.",
    "Add the chicken stock and the dried mushrooms along with the soaking water. Simmer for 30 minutes.",
    "Remove the herbs, then add the cream and butter. Working in batches, puree the soup in a blender (or, if you have an immersion blender, it makes this much easier; you can work right inside your pot) until your desired consistency, or fully smooth. Return to the pot and keep at a very low simmer until ready to serve."
  ],
  "ingredients": [
    "0",
    "1 ounce dried mushrooms (porcini, morels, or shitakes)",
    "1/2 cup olive oil",
    "2 fresh sprigs of rosemary",
    "4 fresh sprigs of sage",
    "1 large yellow onion, peeled and thinly sliced",
    "3 garlic cloves, peeled and thinly sliced",
    "1 1/2 teaspoons salt",
    "1/4 teaspoon freshly ground white pepper",
    "1 pound white button or cremini mushrooms, cleaned and thinly sliced",
    "1 pound shitake mushrooms stemmed, cleaned and thinly sliced",
    "6 cups chicken stock, vegetable stock, or water",
    "1 cup heavy cream",
    "2 tablespoons unsalted butter"
  ],
  "__v": 1
}