{
  "hash": "5228fa74595d1e7cbea940974e66ecfc9f03293f",
  "title": "TZATZIKI SAUCE",
  "image": "https://img.sndimg.com:443/food/image/upload/fl_progressive,c_fill,q_80,w_560,h_315/v1/img/recipes/30/41/66/aAm0V6IR9mmEdMM83zJg_DSC_0863.JPG",
  "href": "https://www.geniuskitchen.com/recipe/tzatziki-sauce-greek-cucumber-yogurt-sauce-304166?photo=cGhvdG8tMzc1NDQ5",
  "extension": "",
  "firstAdded": "2019-01-02T01:02:21.141000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Peel cucumbers and dice. Put them in a colander and sprinkle with the tablespoon of salt (draws water out). Cover with a plate and sit something heavy on top. Let sit for 30 minute Drain well and wipe dry with a paper towel.",
    "In food processor or blender, add cucumbers, garlic, lemon juice, dill and/or mint, and a few grinds of black pepper. Process until well blended, then stir into yogurt. Taste before adding any extra salt, then salt if needed. Place in refrigerator for at least two hours before serving so flavors can blend.",
    "This will keep for a few days in the refrigerator, but you will need to drain off any water and stir each time you use it.",
    "** If you can’t find the thicker Greek Yogurt Cheese, you can use regular, plain yogurt that is either full fat or low fat. To thicken, spoon yogurt into cheese cloth that has been quadrupled. Draw the corners of the cloth up and tie together. Suspend above a bowl for 2 hours so that water can drip out. The consistency of the yogurt should be like that of sour cream.",
    "You can skip this draining process, if you want, but you will have a moderately messier, runnier result.",
    "Submit a Correction"
  ],
  "ingredients": [
    "0",
    "3 cups Greek yogurt (also called Yogurt Cheese, see below for alternative)",
    "3 tablespoons lemon juice (or juice of one lemon)",
    "1 garlic clove, minced",
    "1 large English cucumber, diced (the long, skinny ones)",
    "1 tablespoon salt (for salting cucumbers)",
    "1 tablespoon fresh dill (or both, depending on preference) or 1 tablespoon of fresh mint, chopped (or both, depending on preference)",
    "salt & freshly ground black pepper"
  ],
  "__v": 1
}