{
  "hash": "5e28a83b52423ee0bd3ec49ae9d3041afa4e7c69",
  "title": "One-pan Mediterranean Baked Halibut Recipe with Vegetables",
  "image": "https://www.themediterraneandish.com/wp-content/uploads/2016/05/One-Pan-Baked-Halibut-Recipe-7.jpg",
  "href": "https://www.themediterraneandish.com/one-pan-mediterranean-baked-halibut-recipe-with-vegetables/",
  "extension": "Chrome",
  "firstAdded": "2019-07-29T20:39:23.344000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 220 degrees C.",
    "In a large mixing bowl, whisk the sauce ingredients together. Add the green beans, tomatoes, and onions and toss to coat with the sauce. With a large slotted spoon or spatula, transfer the vegetables to a large baking sheet (21 x 15 x 1 inch baking sheet, for example). Keep the vegetables to one side or one half of the baking sheet and make sure they are spread out in one layer.",
    "Now, add the halibut fillet strips to the remaining sauce, toss to coat. Transfer the halibut fillet to the baking sheet next to the vegetables and pour any remaining sauce on top.",
    "Lightly sprinkle the halibut and vegetables with a little more seasoned salt.",
    "Bake in 220 degrees C heated oven for 15 minutes. Then transfer the baking sheet to the top oven rack and broil for another 3 minutes or so, watching carefully. The cherry tomatoes should begin to pop under the broiler.",
    "When ready, remove the baked halibut and vegetables from the oven. Serve with your favorite grain, Lebanese rice, or pasta."
  ],
  "ingredients": [
    "0",
    "Sauce:",
    "Zest of 2 lemons",
    "Juice of 2 lemons",
    "1/2 cup extra virgin olive oil",
    "1 1/2 tbsp freshly minced garlic",
    "2 tsp dill weed",
    "1 tsp seasoned salt, more for later",
    "1/2 tsp ground black pepper",
    "1 tsp dried oregano",
    "1/2 to 3/4 tsp ground coriander",
    "The rest:",
    "500g fresh green beans",
    "500g cherry tomatoes",
    "1 large yellow onion sliced into half moons",
    "650g halibut fillet, slice into 4cm pieces"
  ],
  "__v": 8
}