{
  "hash": "10b6f25009344c837610d3443f98236f9144d14d",
  "title": "Dutch oven Stacked Enchiladas",
  "image": "http://farm6.static.flickr.com/5023/5654017095_997a40f9b5_d.jpg",
  "href": "http://www.cooking-outdoors.com/dutch-oven-stacked-enchiladas/",
  "extension": "Chrome",
  "firstAdded": "2015-08-04T23:21:48.863000",
  "users": [
    null
  ],
  "keywords": [
    "camp",
    "chef",
    "dutch",
    "oven",
    "beef",
    "turkey",
    "onion",
    "yellow",
    "white",
    "corn",
    "tortillas",
    "chilies",
    "enchilada",
    "olives",
    "taco",
    "seasoning",
    "mexican",
    "cheese"
  ],
  "directions": [
    "0",
    "Preparation",
    "Prepare 24 briquettes; place at least 18 briquettes under your 12-inch Camp Chef Dutch oven to prepare for browning. Place chopped onions in Dutch oven, stirring frequently, when they are half way to tender age or ground beef or turkey and brown until thoroughly cooked. Add your taco seasoning mix and stir thoroughly. Remove meat and onions from Dutch oven to drain.",
    "Remove bottom briquettes until only eight remain then place 16 briquettes on top of your lid.",
    "Now it is time to start layering your stacked enchilada. Take one or two heaping scoop full’s one third of meat and spread on bottom of Dutch oven; keeping in mind that you will be making about three layers. Now spread one third of sliced olives, diced chilies, and enchilada sauce over the meat. Cover this with 5 to 6 of your corn tortillas and then cover your tortillas with one third of your cheese. Simply repeat this until all of your ingredients are in a Dutch oven.",
    "Now it is simply a matter of cooking the Dutch oven stacked enchiladas until done, approximately 30 minutes."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "12 inch Camp Chef Dutch oven",
    "2-pounds ground beef or ground turkey",
    "1- large onion chopped",
    "1-package yellow or white corn tortillas",
    "2- small cans diced chilies",
    "1-large can enchilada sauce",
    "1-8 ounce can sliced olives",
    "2-packages of taco seasoning mix",
    "4-cups of shredded Mexican mix cheese"
  ],
  "__v": 1
}