{
  "hash": "b84f36aa6ed004b572d5e21aabe6dd5c0211aeb7",
  "title": "FISH TACO ZUCCHINI NOODLE BOWL WITH CREAMY AVOCADO DRESSING",
  "image": "http://inspiralized.com/wp-content/uploads/2017/05/6A2A0207.jpg",
  "href": "http://inspiralized.com/fish-taco-zucchini-noodle-bowl-with-creamy-avocado-dressing/",
  "extension": "Chrome",
  "firstAdded": "2017-05-30T21:41:09.574000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Bring a medium pot with a pinch of salt, water and the corn to a boil. Once boiling, let cook for 2-3 more minutes or until corn is easily pierced with a fork. Strain and set aside.",
    "While the corn cooks, place the cod in a bowl with the olive oil, garlic and lime juice and combine. Let sit for 5 minutes. Then, remove the fish from the marinade and season the cod with Cajun seasoning.",
    "While fish marinates, place all of the ingredients for the dressing into a food processor and pulse until creamy. Taste and adjust, if needed. Set aside.",
    "Heat a grill pan or skillet to medium-high. Once heated, place in the cod and cook for about 5 minutes, turning halfway until fish is opaque and flakes easily.",
    "While fish cooks, scrape the corn off the cob with a knife into a small bowl and set aside. Also, toss the zucchini noodles in a large bowl with the avocado sauce until fully combined.",
    "Once fish is done cooking, assemble the fish taco bowls: divide the zucchini noodles into three bowls and place equal portions of black beans, corn and tomatoes. Top each with a piece of fish and garnish with jalapeno slices. Serve immediately."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "For the fish:",
    "1/2 tablespoon extra virgin olive oil",
    "1 garlic clove, minced",
    "1 tablespoon lime juice",
    "(3) 3-oz pieces of cod or white fish",
    "2 teaspoons Cajun seasoning",
    "For the creamy avocado dressing:",
    "2-3 tablespoons chopped cilantro",
    "1 garlic clove, minced",
    "salt and pepper, to taste",
    "2 tablespoons extra virgin olive oil",
    "juice of 1 lime",
    "1 avocado, peeled and pitted",
    "For the rest:",
    "1 large ear of corn, shucked and broken into two pieces",
    "1/2 cup canned black beans, drained and rinsed",
    "3 medium zucchinis, Blade C, noodles trimmed",
    "3/4 cup halved cherry tomatoes",
    "1 small jalapeno, sliced – to garnish"
  ],
  "__v": 1
}