{
  "hash": "76fa637380e211a2d69dcb3020cc91b4fa8fd055",
  "title": "Fingerling Potato Salad With Aioli, Pesto, Fried Shallots, and Pecorino",
  "image": "http://www.seriouseats.com/recipes/assets_c/2014/09/20140903-fingerling-potato-salad-finished-joshua-bousel-thumb-625xauto-410684.jpg",
  "href": "http://www.seriouseats.com/recipes/2014/09/fingerling-potato-salad-aioli-pesto-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-06-11T13:12:02.157000",
  "users": [
    null
  ],
  "keywords": [
    "aioli",
    "egg",
    "yolk",
    "juice",
    "lemon",
    "garlic",
    "clove",
    "dijon",
    "mustard",
    "kosher",
    "salt",
    "canola",
    "oil",
    "extravirgin",
    "olive",
    "pesto",
    "basil",
    "leaves",
    "rinsed",
    "pine",
    "nuts",
    "medium",
    "parmiggianoreggiano",
    "cheese",
    "fried",
    "shallots",
    "potatoes",
    "fingerling",
    "black",
    "pepper",
    "white",
    "wine",
    "vinegar",
    "pecorino",
    "romano",
    "grating"
  ],
  "directions": [
    "0",
    "1 For the Aioli: Process egg yolk, lemon juice, garlic, mustard, and salt in a food processor fitted with a steel blade until well blended, about 5 seconds. With processor running, drizzle in oil in a slow, steady stream, stopping to scrape down sides as necessary. Transfer aioli to container and refrigerate until ready to use.",
    "2 For the Pesto: Combine basil, pine nuts, and garlic in the clean bowl of a food processor. Pulse until basil and pine nuts are finely chopped, scraping down sides of bowl as necessary. With the food processor running, pour oil in a slow, steady stream, stopping to scrape down sides of bowl as necessary. Add Parmigiano-Reggiano and pulse to combine. Season with salt and pepper. Transfer pesto to container and set aside.",
    "3 For the fried shallots: Place shallots and oil in small saucepan. Place over high heat and cook, stirring frequently, until shallots begin to bubble. Continue cooking, stirring constantly to ensure even cooking. When shallots are light golden brown, transfer to strainer and drain. Spread shallots in a single layer on a paper towel lined plate and blot dry with a second paper towel. Season with salt to taste. Set aside.",
    "4 For the Potatoes: Place potatoes, 1 tablespoon salt, 1 tablespoon vinegar, and 1 quart tepid water in a medium saucepan. Bring to a boil over high heat, stirring occasionally until salt is dissolved. Reduce to a simmer and cook until potatoes show no resistance when poked with a paring knife, about 17 minutes. Drain potatoes and immediately toss with remaining 2 teaspoons of vinegar, then spread in a single layer on a rimmed baking sheet. Let cool to warm room temperature, about 10 minutes.",
    "5 Transfer potatoes to a large bowl, add aioli and toss to coat. Refrigerate until completely chilled.",
    "6 Transfer potatoes to a large serving dish. Drizzle pesto all over potatoes and sprinkle with fried shallots. Top with grated pecorino and serve."
  ],
  "ingredients": [
    "0",
    "For the Aioli:",
    "1 large egg yolk",
    "2 teaspoons fresh juice from 1 lemon",
    "1 1/2 teaspoons minced garlic (about 1 large clove)",
    "1/2 teaspoon Dijon mustard",
    "1/8 teaspoons kosher salt",
    "1/4 cup canola oil",
    "1/4 cup extra-virgin olive oil",
    "For the Pesto:",
    "1 cup packed fresh basil leaves, rinsed and dried",
    "1/8 cup pine nuts, toasted",
    "2 medium cloves garlic",
    "1/4 cup extra-virgin olive oil",
    "3 tablespoons finely grated fresh Parmiggiano-Reggiano cheese",
    "For the Fried Shallots:",
    "3/4 cup thinly sliced shallots",
    "3/4 cup canola oil",
    "For the Potatoes:",
    "2 pounds fingerling potatoes, halved if small or quartered if large",
    "Kosher salt and freshly ground black pepper",
    "5 teaspoons white wine vinegar",
    "Pecorino Romano cheese, for grating"
  ],
  "__v": 1
}