{
  "hash": "78633d24c76bbd5ad88eefe9b846a136845a677d",
  "title": "Malay chicken curry",
  "image": "",
  "href": "https://www.cooked.com/uk/Atul-Kochhar/Absolute-Press/30-minute-curries/Poultry/Malay-chicken-curry-recipe",
  "extension": "Chrome",
  "firstAdded": "2017-05-30T14:13:57.629000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "METHOD",
    "Get the potatoes cooking as quickly as possible. Quarter the potatoes lengthways, adding them to the boiling water as you cut. Be careful the water doesn’t splash you as you add the potatoes. Re-cover the pan and return the water to the boil, then boil, uncovered, for 15 minutes, or until the potatoes are tender. When the potatoes are tender, drain them well, return to the pan, cover to keep hot and set aside.",
    "Meanwhile, make the spice powder. Heat the dry non-stick pan over a high heat. Add the dried chilli, cinnamon stick, star anise and coriander, cumin and fennel seeds, and stir until they are aromatic. Tip the spices into the spice grinder and grind until a fine powder forms.",
    "Cut the chicken thigh fillets into bite-sized pieces. Peel and thinly slice the garlic cloves. Peel, halve and thinly slice the shallot.",
    "Heat the vegetable oil over a medium-high heat in the pan. Add the garlic, cinnamon and star anise, and stir them around to flavour the oil. Add the shallot and continue stirring until it is lightly coloured. Add the onion paste and garlic paste, and stir them into the shallot for 30 seconds. Add the spice powder, curry leaves and turmeric, and continue stirring for 30 seconds to cook the turmeric. Watch closely so the spices do not burn.",
    "Add the coconut milk, water and tamarind liquid. Season with salt and stir to make sure nothing is sticking to the bottom of the pan. Bring to the boil, stirring, then reduce the heat to medium. Stir in the chicken and leave the curry to gently simmer for 10 minutes, or until the chicken is cooked through and tender.",
    "Meanwhile, peel and very finely chop the ginger.",
    "When the chicken is cooked, stir the ginger into the pan with the potatoes. Adjust the seasoning with salt, if necessary, and garnish with fresh curry leaves, if you have any."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "9\twell-scrubbed new potatoes",
    "600g\tchicken thigh fillets",
    "3\tgarlic cloves",
    "1\tbanana shallot, or 2 ordinary shallotsc",
    "1 tablespoon\tvegetable oil",
    "1/2\tcinnamon stick",
    "1\tstar anise",
    "2 tablespoons\tsee method for ingredients",
    "1 teaspoon\tsee method for ingredients",
    "10\tfresh or dried curry leaves, plus extra fresh leaves to garnish (optional)",
    "1 teaspoon\tground turmeric",
    "125ml\tcoconut milk",
    "300ml\twater",
    "2 tablespoons\ttamarind liquid",
    "2cm\tpiece of fresh ginger",
    "sea salt",
    "FOR THE SPICE POWDER",
    "1\tlarge dried red chilli",
    "1/2\tcinnamon stick",
    "1\tstar anise",
    "1 tablespoon\tcoriander seeds",
    "1 teaspoon\tcumin seeds",
    "1 teaspoon\tfennel seeds"
  ],
  "__v": 1
}