{
  "hash": "904facaabffce0152e7315a3251fc00b10f78f38",
  "title": "\" Sweet Cinnamon Bread \"Aloha Rolls",
  "image": "http://pictures.food.com/api/file/72LyGYHVRDS7S4xSeZX9-rollsafterrising.jpg/convert?loc=/pictures.food.com/recipes/ho/ld/in/g./22/29/07/G9QHm2RST8S1Yg5ZnmYo_rollsafterrising.jpg&width=614&height=461&fit=crop",
  "href": "http://www.food.com/recipe/quot-sweet-cinnamon-bread-quot-501613",
  "extension": "Chrome",
  "firstAdded": "2016-08-07T16:30:24.283000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "* Breadmaker Directions *.",
    "Add all dry ingredients to a bowl and sift together. Add all liquid ingredients and mix together. Spray bread pan with cooking spray. Add liquid ingredients to bread pan and then add dry ingredients. ( If adding another ingredient such as a fruit or vegetable, add after the dry ingredients). Set breadmaker to quick loaf.",
    "* Conventional Oven *",
    "Preheat oven to 350 degrees.",
    "Add all dry ingredients to a mixing bowl and sift together.",
    "Add all liquid ingredients to another mixing bowl and mix.",
    "Add dry ingredients to liquid ingredients and mix well.",
    "Spray a 8 X 5 loaf pan with cooking spray.",
    "Add bread mixture to pan and cook for 50 minutes or until an inserted toothpick comes out clean.",
    "* ( If adding another ingredient such as a fruit or vegetable, add with liquid ingredients ) *.",
    "1",
    "In a small bowl, dissolve yeast in 1/4 cup warm water. Not so hot you can't touch it, just tepid warm, cover and leave for about 10 minutes.",
    "In a stand mixer, beat the yeast mixture, eggs, pineapple juice, 1/4 cup water, sugar, vanilla, and melted butter. When all combined, gradually stir in salt/flour mixture until a stiff batter like dough is formed. ***If your dough is too wet, don't be afraid to add more flour, a tablespoon at a time until it is dry enough to handle. It should come away from the mixing bowl in a 'ball' after kneading.",
    "Knead for 10 minutes using the dough hook or by hand if you don't have a stand mixer, again use more flour if kneading by hand if the dough is too sticky or wet to handle.",
    "Cover with a clean cloth and place somewhere warm to let rise for 1 hour or more, until the dough is doubled in size (or more than doubled for extra airy, light rolls).",
    "Punch the air out of the dough and turn it onto a well floured surface.",
    "Divide dough into 2 equal pieces and then divide each of those 2 pieces into 8 individual little balls, seam side down to form the rolls, so you get 16 rolls total.",
    "Use 2, 2 X 9 inch baking pans, grease and flour both pans.",
    "Put 9 balls (rolls), seam side down, into each pan. For a total of 18 rolls in 2 pans.",
    "After the balls are places in the pans, there will be quite a bit of room in the pans. That's okay, because they need to rise. Cover and let rise again until the rolls are doubled in size and taking up most, if not all of the pan. This process of rising could take 40 minutes, or more.",
    "Preheat oven to 350°F.",
    "Bake for 15-20 minutes, until a nice golden brown on top of the rolls. The author of the recipe says to test if the rolls are cooked through, tip them out of the pan (use a cloth!) and tap the center of the base of the rolls. If it sounds hollow, they're done. If not, return to the oven for another 5-10 minutes. Every oven is different but now you know the trick to see if they're done. Note: I did not test the rolls like this to see if they were done. They were nicely browned, when I took mine out of the oven (I've made three batches of these rolls now) and they were perfectly cooked after 20 minutes in a 350 F oven in my house.",
    "After you have removed the rolls from the oven, brush the tops with melted butter."
  ],
  "ingredients": [
    "0",
    "cooking spray",
    "2 1⁄2 cups flour",
    "1 teaspoon baking soda",
    "1⁄2 teaspoon baking powder",
    "3 teaspoons cinnamon",
    "2 cups brown sugar",
    "3 eggs",
    "1⁄2 cup vegetable oil",
    "2 teaspoons vanilla extract",
    "1⁄2 cup milk",
    "1",
    "1⁄4 ounce active dry yeast",
    "1⁄4 cup warm water",
    "2 eggs",
    "1⁄2 cup pineapple juice",
    "1⁄4 cup water",
    "1⁄3 cup white sugar",
    "1⁄2 teaspoon vanilla extract",
    "1⁄4 cup butter, melted",
    "4 cups all-purpose flour (I used unbleached white flour)",
    "1⁄4 teaspoon salt (added to the flour)",
    "melted butter, for brushing on the rolls after they have been cooked"
  ],
  "__v": 1
}