{
  "__v": 1,
  "directions": [
    "0",
    "Heat a non-stick frying pan over a medium heat. Drop a knob of butter in, you want enough so that when it melts it covers the bottom of the pan. Sprinkle salt & pepper over your meatballs and when the butter's melted add them to the pan. Fry and keep moving them around until they're brown almost all over. Not beige, properly browned. While they're cooking preheat your oven to about 100C/200F. When your meatballs look done, transfer them to an oven-proof dish and pop them into the oven to keep warm.",
    "You should have a little fat and butter left in the pan. Tilt the pan to one side so it makes a pool. Add your flour and stir it in until you have a pretty smooth paste. Now add your stock, turn the heat up a little and bring it to the boil while stirring and scraping all the flour from the bottom of the pan.",
    "Let it bubble away for a couple of minutes and thicken. While it's working its magic, add your mustard, honey and Worcester sauce. Turn the heat down to medium again, remove your balls from the oven and pour your cream into your sauce. Stir it all together and add your balls to the gravy.",
    "Let it all bubble away for a few minutes. Taste the sauce and see if it needs anything. The balance of flavours here is totally up to you.",
    "When you think it's perfect, sp"
  ],
  "firstAdded": "2014-08-29T21:50:38.915000",
  "hash": "e85d49457bae761be5927d90dc7f0f2c4812d14f",
  "href": "http://www.thelondoner.me/2013/12/swedish-meatball-recipe.html",
  "image": "http://4.bp.blogspot.com/-IAbFOMi9bA8/UptnutmdkOI/AAAAAAAAecU/Y76uOalt9p0/s1600/swedish+meatball+recipe+-+7.jpg",
  "ingredients": [
    "0",
    "Around 500g free-range pork meatballs (I like these)",
    "Knob of butter",
    "1tbsp plain flour",
    "300ml chicken stock",
    "1tbsp mustard",
    "1-2tbsp Worcester sauce",
    "1tsp honey",
    "300ml double cream",
    "Salt n pepper",
    "Big pinch of dried parsley"
  ],
  "keywords": [
    "freerange",
    "pork",
    "meatballs",
    "knob",
    "butter",
    "plain",
    "flour",
    "chicken",
    "stock",
    "mustard",
    "worcester",
    "honey",
    "double",
    "cream",
    "salt",
    "pepper",
    "parsley"
  ],
  "title": "Ultimate Swedish Meatball",
  "users": [
    null
  ]
}