{
  "hash": "7a18002410ec6750a6090390ef0bf01f9d9b8e6f",
  "title": "Bomboloni",
  "image": "https://images.food52.com/WgRWddt-qisOEukREJonUd7KnDw=/753x502/3f2b61f3-80e8-4cd9-95ee-51aab000e47f--buvette_753.jpg",
  "href": "https://food52.com/recipes/33135-bomboloni",
  "extension": "Chrome",
  "firstAdded": "2018-01-02T16:53:59.132000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a small bowl, whisk together the milk, egg, and egg yolk.",
    "Meanwhile, combine the flour, sugar, salt, and yeast in the bowl of a stand mixer fitted with a dough hook and mix briefly just to combine. Add the egg mixture to the dry ingredients and set the mixer on high speed. Let the dough mix until it goes from quite loose to the consistency of very thick cake batter, 2 to 3 minutes. Don’t panic while it’s mixing in fear that it won’t thicken and think you need to add more flour — just let it keep mixing and it will get there on its own. Once it’s thickened, stop the machine and scrape down the sides and the bottom of the bowl with a rubber spatula to make sure there are no pockets of flour or egg hiding anywhere.",
    "Turn the mixer to medium speed and add the butter a little bit at a time (approximately 1 tablespoon per addition). Once all of the butter has been added, let the dough mix until it begins to pull away from the sides of the bowl and starts to gather on the dough hook, about 5 minutes.",
    "Butter the surface of a large mixing bowl, and transfer the dough to the bowl, making sure to use your fingers or a rubber spatula. Using your fingertips, spread the surface of the dough with a tiny bit more butter, and cover the bowl with plastic wrap. Set the dough aside until it has risen a little bit and is quite soft to the touch, either a couple of hours at room temperature, or overnight in the refrigerator. Know that brioche, heavy with all of its rich dairy, is a slow riser. Don’t be disheartened if the dough hasn’t doubled in size like most bread doughs. It will be just fine.",
    "Once the dough has relaxed and risen, generously flour your work surface. Break off walnut-size pieces of dough (about 1.5 ounces each) and roll them on the work surface with the palm of your hand to form even balls. You should have 13 pieces.",
    "To make bomboloni, transfer the 13 dough balls to a floured baking sheet and cover with a clean kitchen towel for an hour or two. You’re looking for dough that hasn’t quite doubled in size, but has risen a little and taken on some new air, and, most important, appears relaxed.",
    "Meanwhile, heat 2 inches of oil in a large, heavy pot set over medium-high heat until it reaches 375°F, or until a pinch of flour sizzles on contact. Dust the excess flour from the bomboloni and carefully place them, in batches if necessary depending on the size of your pot, in the hot oil. Fry, turning occasionally, until browned on all sides, about 5 minutes total. Transfer the browned bomboloni to a paper towel-lined plate or tray to drain. Roll in plenty of sugar and serve immediately while hot."
  ],
  "ingredients": [
    "0",
    "1/2 cup plus one tablespoon whole milk",
    "1 large egg",
    "1 large egg yolk",
    "2 1/2 cups unbleached all-purpose flour, plus extra for dusting",
    "1/4 cup sugar",
    "3/4 teaspoon coarse salt",
    "3/4 teaspoon active dry yeast",
    "5 tablespoons (1/2 stick plus 1 tablespoon) unsalted butter, at room temperature, plus more for greasing",
    "Oil, for frying (corn, peanut, vegetable, canola, or grape-seed oil all work well)",
    "Extra sugar, preferably superfine sugar, for rolling"
  ],
  "__v": 1
}