{
  "hash": "b293f67f4640d8ff8dcb7e396206702843b2b924",
  "title": "Lamb or Chicken Biryani",
  "image": "http://www.seriouseats.com/recipes/assets_c/2014/02/2014.20.02 Indian Lamb Biryani-thumb-625xauto-385595.jpg",
  "href": "http://www.seriouseats.com/recipes/2014/02/beyond-curry-lamb-biryani-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-03-17T05:10:33.884000",
  "users": [
    null
  ],
  "keywords": [
    "marinade",
    "ghee",
    "clarified",
    "butter",
    "medium",
    "onions",
    "divided",
    "cubed",
    "lamb",
    "shoulder",
    "milk",
    "yogurt",
    "hot",
    "green",
    "chilies",
    "serrano",
    "thai",
    "turmeric",
    "ginger",
    "garlic",
    "cumin",
    "seeds",
    "coriander",
    "red",
    "chilli",
    "kosher",
    "salt",
    "potatoes",
    "dry",
    "bay",
    "leaves",
    "cinnamon",
    "broken",
    "shards",
    "star",
    "anise",
    "pods",
    "black",
    "cardamom",
    "pod",
    "mace",
    "petals",
    "peppercorns",
    "fennel",
    "seed",
    "tomatoes",
    "garam",
    "masala",
    "cilantro",
    "rice",
    "basmati",
    "juice",
    "lime"
  ],
  "directions": [
    "0",
    "For the Marinade: Heat 1 tablespoon ghee in a heavy bottomed saucepan over medium heat until shimmering. Add half of the onion and cook, stirring, until brown browned, about 10 minutes. Transfer to a bowl. In a large bowl, combine yogurt, turmeric, green chillies, ginger, garlic, 1 tablespoon ground cumin, 1 tablespoon ground coriander, chilli powder, and 2 teaspoons salt. Roughly chop the onions and add to the mix. Add the lamb, mix well to coat, and refrigerate at least 2 hours and up to overnight.",
    "For the gravy: When ready to cook, add the remaining ghee to the heavy bottomed saucepan and heat over medium heat until shimmering. Add the potatoes and cook, turning occasionally, until golden brown, about 10 minutes. Transfer to a plate. Add remaining onions and cook, stirring, until golden brown, about 10 minutes. Add 2 bay leaves, cloves, cinnamon, star anise, black cardamom, peppercorns, fennel seeds. Cook, stirring, until fragrant, about 2 minutes. Add the crushed tomatoes and cook until the oil separates from the tomatoes, bout 4 minutes. Add the garam masala and stir for 1 minute.",
    "Add half of the cilantro and the marinated lamb (discard excess marinade). Add 1 cup of water and stir to combine. Bring to a boil, reduce to a bare simmer, cover, and cook until lamb is completely tender, about 3 hours. (See note above.)",
    "Meanwhile, bring a large pot of water to a boil. Add lime juice and remaining 2 bay leaves. Season well with salt. Add rice and cook until almost tender. Drain well and spread on a plate to dry.",
    "To Asemble: Add remaining tablespoon ghee to a large Dutch oven and spread evenly over bottom. Add a 2 inch layer of rice. Next add the lamb gravy and sprinkle some coriander leaves. Add another layer of rice, lamb gravy and coriander, repeating until all of the rice and lamb is used up, finishing with a layer of rice. Cover and place the dutch oven on low heat. Cook until the rice is fragrant and completely cooked, about 20 minutes. Serve immediately."
  ],
  "ingredients": [
    "0",
    "For the Marinade:",
    "3 tablespoons ghee (clarified butter)",
    "6 finely sliced medium onions (about 6 cups), divided",
    "1 1/2 pounds cubed lamb shoulder (see note above)",
    "2 cups whole milk yogurt",
    "2 hot green chilies (such as Serrano or Thai)",
    "1 teaspoon turmeric powder",
    "1 tablespoon grated fresh ginger",
    "1 tablespoon grated fresh garlic (about 3 medium cloves)",
    "2 tablespoons toasted and ground cumin seeds, divided",
    "2 tablespoons toasted and ground coriander seeds, divided",
    "1 1/2 tablespoons red chilli powder",
    "Kosher Salt",
    "For the Sauce:",
    "2 medium potatoes, quartered",
    "4 dry bay leaves, divided",
    "5 cloves",
    "2 inch piece of cinnamon broken into shards",
    "2 star anise pods",
    "1 black cardamom pod",
    "2 mace petals",
    "5 black peppercorns",
    "2 teaspoons whole fennel seed",
    "1 cup crushed tomatoes",
    "1 tablespoon garam masala powder",
    "1 cup fresh cilantro leaves, chopped, divided",
    "For the Rice:",
    "2 1/2 cups Basmati rice",
    "1 teaspoon juice from 1 lime"
  ],
  "__v": 1
}