{
  "hash": "47a4797efbd94a04d6b4d7b2c26332a1d0ae4bee",
  "title": "PEANUT BUTTER-TOFFEE CHOCOLATE EGGS",
  "image": "http://www.azgrabaplate.com/wp-content/uploads/Peanut-Butter-Toffee-Chocolate-Eggs5.jpg",
  "href": "http://www.azgrabaplate.com/peanut-butter-toffee-chocolate-eggs/",
  "extension": "Chrome",
  "firstAdded": "2017-04-21T23:34:14.712000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Line a baking sheet with waxed paper and set aside.",
    "Add the peanut butter, powdered sugar, and vanilla to a food processor. Pulse several times until the mixture forms into a clump. If it seems too soft, add a bit more powdered sugar and pulse a few more times.",
    "Transfer the mixture to a bowl and stir in the toffee bits.",
    "Pull off a bit of the mixture (about 1-1/2 tablespoons) and shape it into a flat egg, about 1-inch-thick, and 3-inches-long. Place it on the baking sheet.",
    "Continue until all the dough is used (you should have 10 eggs).",
    "Place the tray in the freezer for 20-30 minutes.",
    "Add the chocolate chips to a microwave-safe bowl, along with the shortening. Microwave in 20-second increments until the chips are almost completely melted. Stir until the chips and shortening are combined and smooth.",
    "Remove the eggs from the freezer.",
    "One at a time, slide a fork under each egg and dip it into the chocolate. Lift and allow the excess chocolate to drip back into the bowl. Place on the baking sheet.",
    "Return to the freezer for about 10 minutes. Drizzle the remaining chocolate over the eggs and quickly garnish with the sprinkles.",
    "Allow the drizzled chocolate to harden (you may want to return to the freezer) before serving.",
    "Store the eggs in a container, either in the refrigerator or freezer, with a bit of waxed paper between layers.",
    "Notes",
    "You don't have to add the toffee bits to this recipe, and you can use crunchy peanut butter, or any kind of nut butter, if you prefer. Personalize these treats as you like!"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1/2 cup smooth peanut butter",
    "1/2 cup powdered sugar",
    "1/4 teaspoon pure vanilla extract",
    "1/4 cup toffee bits",
    "1-1/2 cups milk chocolate chips",
    "2 tablespoons shortening",
    "Colored candy sprinkles for garnish"
  ],
  "__v": 1
}