{
  "__v": 1,
  "directions": [
    "0",
    "Make The Dough: In a small saucepan, warm the milk over low heat until lukewarm (no need to use a thermometer, but to be precise: about 95 degrees F). Pour the warm milk into the bowl of a stand electric mixer fitted with the dough hook attachment and manually stir in the sugar and yeast. Cover with a towel and let stand until the yeast is foamy, about 5-10 minutes. Add the softened butter, eggs, and salt. Scrape down the sides and manually stir as needed. Gradually add the flour and beat at medium speed until a soft dough forms. Increase speed to medium-high and beat until the dough is soft and supple, about 10 minutes longer. *If you do not have a stand-mixer with a hook attachment, knead the dough by hand in this step.",
    "Transfer the dough to a lightly floured surface and knead it with your hands for about 2 minutes. Form the dough into a ball and transfer it to a lightly greased bowl. Cover the dough and let sit in a warm place until doubled in size, 1 to 2 hours.",
    "Line the bottom of a 9x13 inch baking dish with parchment paper,leaving room on the sides. Turn the dough out onto a lightly floured work surface and, using a rolling in, roll into a 10x24 inch rectangle. I used a ruler for accuracy. Make sure the dough is smooth and evenly thick, even at the corners.",
    "Make The Filling: In a medium bowl, toss the frozen raspberries with the sugar and cornstarch. Spread the cold sugared raspberries evenly over the dough. Tightly roll up the dough to form a 24-inch-long log. Cut into 16 even rolls (about 1.5 inches in width each). Arrange them in the prepared baking pan, cut sides up. Cover the rolls and let them rise in a warm place until they are puffy, about 2 hours. The berries will release their juice at the bottom of the pan - this is OK.",
    "Preheat the oven to 400F degrees. Cover the rolls with aluminum foil and bake for about 25 minutes, until they are golden and the berries are bubbling. Transfer the pan to a rack to cool for about 15 minutes.",
    "Make The Glaze: In a small bowl, whisk the confectioner’s sugar and heavy cream until smooth. Add more sugar or cream, depending how thick you want the glaze. Pour glaze over the rolls and serve warm.",
    "Make Ahead: During the second rise, cover the sliced rolls and let sit overnight at room temperature before baking. Baked rolls can be frozen up to 2 months and warmed up to enjoy at a later date. Glaze right before serving."
  ],
  "firstAdded": "2014-08-12T00:05:41.550000",
  "hash": "5802c8668079a33f1165e7865dea0b380c02db72",
  "href": "http://sallysbakingaddiction.com/2012/12/16/raspberry-swirl-sweet-rolls/",
  "image": "http://sallysbakingaddiction.com/wp-content/uploads/2012/12/Raspberry-Sweet-Rolls-3.jpg",
  "ingredients": [
    "0",
    "DOUGH",
    "1 cup (120ml) milk",
    "2/3 cup (135g) granulated sugar",
    "1 and 1/2 tablespoons active dry yeast (2 standard size packets)",
    "1/2 cup (1 stick or 115g) unsalted butter, softened to room temperature",
    "2 large eggs",
    "1/2 teaspoon salt",
    "4 and 1/2 cups (562g) all-purpose flour, plus more for dusting/rolling",
    "FILLING",
    "One 10-oz. package frozen raspberries (NOT thawed)",
    "1/4 cup plus 2 Tablespoons (80g) granulated sugar",
    "1 teaspoon cornstarch",
    "GLAZE",
    "1 cup (120g) confectioners' sugar",
    "3 Tablespoons (30ml) heavy cream (or half-and-half or milk)"
  ],
  "keywords": [
    "dough",
    "milk",
    "granulated",
    "sugar",
    "active",
    "dry",
    "yeast",
    "standard",
    "size",
    "unsalted",
    "butter",
    "softened",
    "room",
    "eggs",
    "salt",
    "allpurpose",
    "flour",
    "dustingrolling",
    "filling",
    "frozen",
    "raspberries",
    "thawed",
    "cornstarch",
    "glaze",
    "confectioners",
    "cream",
    "halfandhalf"
  ],
  "title": "Raspberry Swirl Sweet Rolls",
  "users": [
    null
  ]
}