{
  "hash": "a7c677a703fb571a60a0d018a4f3f78717943dd9",
  "title": "Pierogi drożdżowe ukraińskie na Wigilię i Święta",
  "image": "//static.smaker.pl/photos//9/c/4/9c435f7ae6e5b85740d36b6740331fe2_364905_5678abdfae993_wm.jpg",
  "href": "http://smaker.pl/przepis-pierogi-drozdzowe-ukrainskie-na-wigilie-i-swieta,115183,monika1978.html",
  "extension": "",
  "firstAdded": "2016-09-16T20:56:45.140000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Przygotowanie",
    "Wszystkie składniki na ciasto drożdżowe muszą być w temperaturze pokojowej, najlepiej przygotować godzinę, wcześniej.",
    "Mąkę przesiewamy, dodajemy sól, kawałki masła, pokruszone drożdże, cukier, śmietanę oraz surowe jajka.",
    "Zagniatamy ciasto i odstawiamy w ciepłe miejsce na przynajmniej 1/2 godziny.",
    "Farsz",
    "Marchewkę obieramy, kroimy na grube plastry i gotujemy w bulionie warzywnym do miękkości.",
    "3 jajka gotujemy na twardo i siekamy.",
    "Obraną cebulę kroimy i podsmażamy na maśle.",
    "Ugotowane marchewki odcedzamy i przecieramy lub miksujemy, następnie dodajemy pokrojone jajka, cebulę, mieszamy, doprawiamy solą i cukrem.",
    "Ciasto wałkujemy podsypując stół mąką, wykrawamy krążki o średnicy ok.10 cm., na każdy wykładam farsz i zlepiamy.",
    "wykładamy na blaszce wyłożonej papierem do pieczenia, nakłuwamy widelcem, smarujemy roztrzepanym jajkiem.",
    "Pieczemy 25 minut w 180 stopniach ( góra/ dół ), na środku.",
    "Z porcji wychodzi ok. 30 sztuk, po 15 na każdej blaszce.",
    "Ja piekę z podwójnej porcji, bo są przepyszne i można jeść bez końca.",
    "Serdecznie polecam."
  ],
  "ingredients": [
    "0",
    "To przepis M. Kuronia podobnie, jak pierożki kurpiowskie polecam bo są delikatne w smaku i bardzo łatwe do przygotowania. Smacznego.",
    "Składniki",
    "Ciasto:",
    "350 g mąki najlepiej do ciast drożdżowych Typ 550",
    "2 jajka",
    "20 g drożdży",
    "125 ml kwaśnej śmietany 22%",
    "100 g masła",
    "sól, cukier ok. łyżeczki",
    "Farsz:",
    "3 jajka ugotowane na twardo",
    "1 jajko surowe",
    "400 g marchewki",
    "250 ml wywaru warzywnego, np. kostka warzywna",
    "1 mała cebula",
    "2 - 3 łyżki masła",
    "sól, cukier do smaku ok. łyżeczki"
  ],
  "__v": 1
}