{
  "hash": "e890207651edc049e509efe07c40a6acfcfc19a3",
  "title": "Mongolian Beef (Without Using a Wok)",
  "image": "https://omnivorescookbook.com/wp-content/uploads/2018/05/1805_Mongolian-Beef_003.jpg",
  "href": "https://omnivorescookbook.com/mongolian-beef/",
  "extension": "Chrome",
  "firstAdded": "2018-08-25T23:22:13.877000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Combine flank steak, Shaoxing wine, and salt in a large bowl. Gently mix well with your hand. Let marinate at room temperature for 10 to 15 minutes.",
    "Mix all the sauce ingredients in a medium-sized bowl.",
    "When you’re ready to cook, add the cornstarch to the marinated beef. Mix to coat all the beef pieces with cornstarch.",
    "Heat peanut oil in a large nonstick skillet until hot. Spread the steak with minimal overlapping. Use a pair of tongs to rearrange the beef, if necessary. Let cook for 1 minute without moving, or until the bottom turns golden brown. Flip and cook the other side, 40 seconds or so, until golden but the inside still a bit pink. Transfer the steak to a big plate.",
    "If there is a lot of oil left in the pan, use a couple layers of kitchen paper towel held in a pair of tongs to remove extra oil, leaving 1 tablespoon of oil in the pan.",
    "Add the ginger, garlic, and the white part of the green onion into the skillet. Cook and stir for 30 seconds to release the fragrance.",
    "Stir the sauce again until the cornstarch is fully dissolved. Pour into the pan and immediately stir with a spatula. The sauce will thicken very quickly, in a couple seconds. Return the cooked beef to the pan, along with the green part of the green onion. Cook and stir a few more times to mix well. Transfer everything to a plate immediately.",
    "Serve hot over steamed rice as a main."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Marinade",
    "1 lbs (450 g) flank steak, sliced against the grain into 1/4” (1/2 cm) pieces (*Footnote 1)",
    "2 tablespoons Shaoxing wine or dry sherry",
    "1/2 teaspoon salt",
    "Sauce",
    "1/4 cup water or chicken stock",
    "1/4 cup light soy sauce or soy sauce",
    "2 teaspoons dark soy sauce or soy sauce",
    "1/4 cup sugar",
    "2 teaspoons cornstarch",
    "Stir fry",
    "1/4 cup cornstarch",
    "1/4 cup peanut oil or vegetable oil",
    "2 teaspoons minced ginger",
    "3 cloves garlic chopped",
    "4 green onions cut into 2-inch pieces, white and green parts separated"
  ],
  "__v": 1
}