{
  "hash": "e3ddc32831249a9032c77248a0364e69b922d3e7",
  "title": "stroganoff-pannetje met gehaktballetjes",
  "image": "https://cdn1.blovcdn.com/bloglovin/aHR0cCUzQSUyRiUyRnd3dy5rZXVrZW5saWVmZGUubmwlMkZ3cC1jb250ZW50JTJGdXBsb2FkcyUyRjIwMTYlMkYwOSUyRldhdGVybWVyay1zdHJvZ2Fub2ZmLXBhbm5ldGplLW1ldC1nZWhha3RiYWxsZXRqZXMtNDc2NS0zMDB4MTk5LmpwZw==?checksum=7d04af1d65a1d0944ac14714c115770a0453d103&format=j",
  "href": "https://www.bloglovin.com/blogs/keukenloveliefde-4403039/stroganoff-pannetje-met-gehaktballetjes-5195444621",
  "extension": "Chrome",
  "firstAdded": "2017-03-30T20:45:14.450000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Doe de ingrediënten voor het gehakt (gebruik de helft van de peterselie) in een kom en voeg naar smaak zout en peper toe. Kneed het gehakt door elkaar en draai er circa 20 gehaktballetjes van.",
    "Verhit de hapjespan en wacht totdat de Thermo-spot egaal rood gekleurd is. Hij heeft dan de juiste temperatuur bereikt voor het beste bakresultaat. Voeg de gehaktballetjes toe (je hoeft geen boter of olie te gebruiken!) en bak rondom goudbruin. Je hoeft de gehaktballetjes nog niet helemaal gaar te bakken, want ze garen straks verder in de saus. Schep de gehaktballetjes uit de pan op een bord.",
    "Bak de paprika’s, champignons, ui, knoflook en paprikapoeder in het bakvet van de gehaktballetjes op hoog vuur. Bak net zolang totdat de groenten geslonken zijn. Voeg de tomatenpuree toe en bak een minuut mee. Verkruimel het bouillontablet erboven en voeg 250 ml water en de room toe. (Voor wat extra pit voeg ik worcestersaus en tabasco toe, maar dit is optioneel.) Breng het vocht aan de kook en zet dan het vuur laag. Voeg de gehaktballetjes toe en doe de deksel op de pan. Laat 10 minuten zachtjes pruttelen, of totdat de gehaktballetjes gaar zijn en het vocht iets is ingedikt."
  ],
  "ingredients": [
    "0",
    "Voor de gehaktballetjes",
    "500 g rundergehakt",
    "45 g paneermeel",
    "2 el mosterd",
    "1 el paprikapoeder",
    "1 ei",
    "Bosje platte peterselie, fijngehakt",
    "Voor de stroganoffsaus",
    "2 paprika’s, zaadlijsten verwijderd en in smalle repen gesneden",
    "400 g champignons, in plakjes gesneden",
    "1 grote ui, fijngesnipperd",
    "1 teen knoflook, uitgeperst",
    "1 el paprikapoeder",
    "70 g tomatenpuree (klein blikje)",
    "1 runderbouillonblokje",
    "200 ml kook-, of slagroom",
    "Worcestersaus en tabasco, optioneel voor extra pit!",
    "Eventueel aardappelzetmeel of maizena om de saus te binden"
  ],
  "__v": 1
}