{
  "hash": "fa47008902e6c8049e32cc18fcc118a3eb8b18e0",
  "title": "How To Cook Perfect Steak in the Oven",
  "image": "http://p-fst1.pixstatic.com/51b0b5d574c5b629af0001d6._w.540_s.fit_.jpg",
  "href": "http://www.thekitchn.com/how-to-cook-a-perfect-steak-in-the-oven-cooking-lessons-from-the-kitchn-108490",
  "extension": "Chrome",
  "firstAdded": "2015-07-12T15:34:59.323000",
  "users": [
    null
  ],
  "keywords": [
    "ribeye",
    "steak",
    "canola",
    "oil",
    "kosher",
    "salt",
    "black",
    "pepper",
    "equipment",
    "cast",
    "iron",
    "skillet",
    "long",
    "tongs",
    "wellpadded",
    "oven",
    "mitt"
  ],
  "directions": [
    "0",
    "Instructions",
    "Let the steak come to room temperature: open the package and drain out any juices. Blot the steak dry with paper towels or a rag. Let the steak come to room temperature, if it isn't already.",
    "Heat the skillet under the broiler 20 minutes before cooking: Turn on your oven's broiler and place an oven rack 6 to 8 inches below the broiler element. Put a cast iron skillet on the rack to heat up with the oven.",
    "Prepare the oil and salt and pepper: Pour a little canola or vegetable oil (about 2 tablespoons) into a small bowl. Put about 1 tablespoon of kosher salt into a ramekin and mix in a generous amount of freshly ground black pepper.",
    "Brush the steak with oil and sprinkle with salt and pepper: Brush the oil all over the steak, coating it generously on both sides and on the ends. Sprinkle the salt and pepper mix generously on both sides of the steak, patting it into the steak so it sticks.",
    "Turn on a stove burner to high heat.",
    "Transfer the hot skillet from the oven to the stovetop: Very, very carefully remove the hot cast iron skillet from the oven, using your thickest and most reliable oven mitt or pad! Place it over the stovetop burner.",
    "Place the steak in the pan: Use long, sturdy kitchen tongs to place the steak on the hot pan. It should sizzle immediately.",
    "Cook the steak for 30 seconds on each side: Cook the steak for 30 seconds, then flip it over. Cook the steak for an additional 30 seconds on the other side.",
    "Transfer the skillet with the steak back to the oven: Carefully put the skillet and steak back in the oven. (Don't forget to turn off the burner.)",
    "Roast the steak in the oven for 2 minutes per side: Cook the steak for 2 minutes. Open the oven and carefully flip the steak, using the long tongs. Return to the oven and cook for an additional 2 minutes. At this point your steak will be medium-rare (as seen in the photos). If you prefer your steak closer to medium, add 2 minutes to the oven time.",
    "Rest the steak: Take the steak out of the oven and turn off the oven. Remove the steak from the pan and put it on a large cutting board. Cover it with aluminum foil and let the steak rest for about 5 minutes.",
    "Slice the steak and serve: Slice the steak against the grain and fan slices out on each plate. Serve immediately."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "One approximately 1-pound ribeye steak, 1 to 1 1/2 inches thick",
    "Canola or vegetable oil",
    "Kosher salt",
    "Freshly ground black pepper",
    "Equipment",
    "Cast iron skillet",
    "Long tongs",
    "Very thick or well-padded oven mitt"
  ],
  "__v": 1
}