{
  "hash": "a7a6afe1b500c66602a4daf8e396b09e24ba132f",
  "title": "Spicy Lobster Cakes with Mango and Avocado Salsa",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2016/3/25/2/RF0612H_Spicy-Lobster-Cake_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/nancy-fuller/spicy-lobster-cakes-with-mango-and-avocado-salsa.html",
  "extension": "Chrome",
  "firstAdded": "2016-06-24T04:04:51.679000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Bring a large pot of water to a boil and prepare an ice water bath. Add the lobster tails to the boiling water and cook until they curl up and the meat is white, about 8 minutes. Transfer them to the ice bath to stop the cooking process, about 2 minutes. Remove the meat from the shells, chop into small pieces and set aside.",
    "In a large bowl, whisk together the mayonnaise, chives, tarragon, mustard, cayenne, shallot, lemon juice and some salt and pepper. Add the lobster meat, melted butter and 1 cup of the panko and mix to combine.",
    "Put the remaining 1 cup panko on a baking sheet. Form the lobster mixture into appetizer-size cakes (about 1/4 cup each), coat the cakes in the panko and place on a plate or baking sheet.",
    "Heat the olive oil in a large nonstick skillet over medium-high heat. Working in batches and adding oil as needed, fry the lobster cakes on each side until golden and cooked through, about 3 minutes per side. Serve topped with the Mango and Avocado Salsa.",
    "Add the cilantro, mango, jalapeno and lime juice to a food processor and pulse until finely chopped. Pour into a medium bowl, add the scallions, avocado and salt and pepper to taste and stir to combine.",
    "Recipe courtesy of Nancy Fuller"
  ],
  "ingredients": [
    "0",
    "6 lobster tails",
    "1 cup mayonnaise",
    "2 tablespoons chopped chives",
    "2 tablespoons chopped fresh tarragon",
    "1 tablespoon Dijon mustard",
    "Pinch cayenne pepper",
    "1 shallot, finely chopped",
    "Juice of 1/2 lemon",
    "Kosher salt and freshly ground black pepper",
    "2 tablespoons butter, melted",
    "2 cups panko breadcrumbs",
    "1 tablespoon olive oil, plus more if needed",
    "Mango and Avocado Salsa, recipe follows",
    "1 cup fresh cilantro leaves, roughly chopped",
    "1 large mango, chopped",
    "1 jalapeno, quartered",
    "Juice of 1 lime",
    "3 scallions, sliced",
    "1 avocado, diced",
    "Kosher salt and freshly ground black pepper"
  ],
  "__v": 1
}