{
  "hash": "83c16c4ece2b8bd4feee9e35dd7686d3838c2ff7",
  "title": "Chicken Marbella\n16 pieces, 10 or more portions",
  "image": "http://www.silverpalate.com/sites/default/files/styles/prod_fullpage_view/public/recipe_thumbnails/SP_r019a_Chicken%20Marabella%2014.jpg",
  "href": "http://www.silverpalate.com/recipe/store-favorites/chicken-marbella",
  "firstAdded": "2015-01-08T18:20:45.409000",
  "users": [
    null
  ],
  "keywords": [
    "pieces",
    "portions",
    "olive",
    "oil",
    "red",
    "wine",
    "vinegar",
    "prunes",
    "spanish",
    "green",
    "olives",
    "capers",
    "bit",
    "juice",
    "bay",
    "leaves",
    "head",
    "garlic",
    "pureed",
    "oregano",
    "coarse",
    "salt",
    "black",
    "pepper",
    "chickens",
    "brown",
    "sugar",
    "dry",
    "white",
    "italian",
    "flatleaf",
    "parsley",
    "cilantro"
  ],
  "directions": [
    "0",
    "Combine the olive oil, vinegar, prunes, olives, capers and juice, bay leaves, garlic, oregano, and salt and pepper in a large bowl. Add the chicken and stir to coat. Cover the bowl and refrigerate overnight. 2. Preheat the oven to 350°F. 3. Arrange the chicken in a single layer in one or two large, shallow baking pans and spoon the marinade over it evenly. Sprinkle the chicken pieces with the brown sugar and pour the white wine around them. 4. Bake, basting frequently with the pan juices, until the thigh pieces yield clear yellow (rather than pink) juice when pricked with a fork, 50 minutes to 1 hour. 5. With a slotted spoon, transfer the chicken, prunes, olives, and capers to a serving platter. Moisten with a few spoonfuls of the pan juices and sprinkle generously with the parsley or cilantro. Pass the remaining pan juices in a sauceboat. Note: To serve Chicken Marbella cold, cool to room temperature in the cooking juices before transferring the pieces to a serving platter. If the chicken has been covered and refrigerated, reheat it in the juices, then allow it to come to room temperature before serving. Spoon some of the reserved juice over the chicken."
  ],
  "ingredients": [
    "0",
    "16 pieces, 10 or more portions",
    "Ingredients:",
    "1/2 cup olive oil",
    "1/2 cup red wine vinegar",
    "1 cup pitted prunes",
    "1/2 cup pitted Spanish green olives",
    "1/2 cup capers with a bit of juice",
    "6 bay leaves",
    "1 head of garlic, peeled and finely pureed",
    "1/4 cup dried oregano",
    "Coarse salt and freshly ground black pepper, to taste",
    "4 chickens (2 1/2 pounds each), quartered",
    "1 cup brown sugar",
    "1 cup dry white wine",
    "1/4 cup fresh Italian (flat-leaf) parsley or fresh cilantro, finely chopped"
  ],
  "__v": 1
}