{
  "hash": "fec97813c6e1ff69687cf0424a78198368ca2ff2",
  "title": "Lemon Pepper Roast Chicken in a Slow Cooker Recipe\nYIELD: 4 to 6 servings PREP TIME: 20 minutes COOK TIME: 4 hours 10 minutes TOTAL TIME: 4 hours 30 minutes",
  "image": "http://www.thelittlekitchen.net/wp-content/uploads/2013/04/lemon-pepper-roast-chicken-slow-cooker-the-little-kitchen-8255.jpg",
  "href": "http://www.thelittlekitchen.net/lemon-pepper-roast-chicken-in-a-slow-cooker/",
  "extension": "Chrome",
  "firstAdded": "2015-05-07T17:28:52.468000",
  "users": [
    null
  ],
  "keywords": [
    "lemon",
    "pepper",
    "seasoning",
    "salt",
    "pinches",
    "cayenne",
    "onion",
    "zest",
    "carrots",
    "thirds",
    "celery",
    "quarters",
    "chicken",
    "rinsed",
    "patted",
    "dry",
    "paper",
    "towel",
    "neck",
    "gizzards",
    "gravy",
    "unsalted",
    "butter",
    "allpurpose",
    "unbleached",
    "flour",
    "white",
    "wine"
  ],
  "directions": [
    "0",
    "Directions:",
    "Mix lemon pepper, salt, cayenne pepper, onion powder, ground pepper and lemon pepper together in a small bowl and set aside.",
    "Chop vegetables and add to a 6 to 7 quart slow cooker.",
    "Prep the chicken",
    "Fold wings back below the chicken. Put lemon pepper spices inside and all over the skin of the chicken. Add the quartered lemon pieces to the inside cavity of the chicken. Taking the lemon you halved, squeeze one-half over the chicken and over the vegetables. Add the two halves on top of the vegetables in the slow cooker.",
    "Lay the chicken inside the slow cooker on top of the vegetables. (No need to add water or broth). Turn slow cooker on high for 3 to 4 hours or on low for 4 to 6 hours until chicken is thoroughly cooked through to an internal temperature of 160 degrees F.",
    "Remove chicken with turkey lifters and place into a baking dish and broil for 4 to 6 minutes or until the skin is crisp.",
    "Carve the chicken and serve with the vegetables from the slow cooker if desired.",
    "Gravy",
    "Remove vegetables and pour chicken broth from the bottom of the slow cooker into a fat separator or use a spoon to remove any extra fat. Strain the liquid.",
    "In skillet, melt butter on medium heat. Add flour and mix with a wooden spoon to cook the flour. Whisk in 1 to 1.5 cups of the strained chicken broth. Bring to a boil and allow to boil for 30 to 60 seconds. Add in white wine and stir. Simmer for 2 to 3 minutes and season to taste.",
    "Leftover chicken: Make a chicken salad or these chicken pot pies.",
    "Note: No need for chicken broth or water to be added to this recipe, a broth will accumulate around the vegetables below the chicken as it cooks. Feel free to save and use that in a future soup or another recipe if you decide not to make a gravy with it."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "1/2 Tablespoon lemon pepper seasoning",
    "3 teaspoons salt",
    "2 pinches cayenne pepper",
    "pinch onion powder",
    "1/4 teaspoon freshly ground pepper",
    "zest of one lemon, then take the lemon & cut in half",
    "4 carrots, cut into thirds",
    "4 celery, cut into thirds or quarters",
    "1 lemon, quartered",
    "4 to 5 pound whole chicken, rinsed and patted dry with a paper towel, neck & gizzards removed (if any)",
    "Gravy (optional)",
    "1 Tablespoon unsalted butter",
    "2 Tablespoons all-purpose unbleached flour",
    "1/4 white wine",
    "salt & pepper"
  ],
  "__v": 1
}