{
  "__v": 1,
  "directions": [
    "0",
    "Preheat the oven to 180°C/fan160°C/gas 4. Heat a non-stick frying pan over a medium heat, then fry the sausages on both sides for 5 minutes until browned. Remove and set aside, making sure to take out the wooden sticks.",
    "Add the sliced onion to the pan, then fry for 5 minutes until softened, adding the garlic for 30 seconds at the end.",
    "Stir through the tomatoes, pulses, rosemary, half the parsley, 50ml water and some seasoning, then transfer to a 1.1 litre (or thereabouts) ovenproof dish, nestling the sausage swirls in the sauce.",
    "Mix the remaining parsley with the breadcrumbs, then sprinkle over the cassoulet.",
    "Transfer to the oven and bake for 25 minutes until the sausages are cooked through and the breadcrumbs are crisp.More recipesMash recipesSausage recipesRoastsSlow-cooker recipesComfort food"
  ],
  "firstAdded": "2014-10-04T12:00:25.206000",
  "hash": "01aec4d708807e4328ec2be08520c5f0aaf0b47e",
  "href": "http://www.deliciousmagazine.co.uk/recipes/crunchy-cumberland-sausage-cassoulet-with-mixed-beans-recipe",
  "image": "http://www.deliciousmagazine.co.uk/images/recipes/5973/5973_1_296.jpg",
  "ingredients": [
    "0",
    "2 outdoor-bred Cumberland pork sausage swirls (from Asda, Sainsbury’s and Waitrose)",
    "1 red onion, finely sliced",
    "1 fat garlic clove, crushed",
    "400g tin cherry tomatoes",
    "410g tin mixed pulses in water, drained and rinsed",
    "2 fresh rosemary sprigs, leaves picked and chopped",
    "Small bunch of fresh flatleaf parsley, chopped",
    "50g dried white breadcrumbs (we like Sainsbury’s Natural)"
  ],
  "keywords": [
    "outdoorbred",
    "cumberland",
    "pork",
    "sausage",
    "swirls",
    "asda",
    "sainsburys",
    "waitrose",
    "red",
    "onion",
    "fat",
    "garlic",
    "clove",
    "tin",
    "cherry",
    "tomatoes",
    "mixed",
    "pulses",
    "water",
    "rinsed",
    "rosemary",
    "sprigs",
    "leaves",
    "picked",
    "bunch",
    "flatleaf",
    "parsley",
    "white",
    "breadcrumbs",
    "natural"
  ],
  "title": "Crunchy cumberland sausage cassoulet with mixed beans recipe",
  "users": [
    null
  ]
}