{
  "hash": "d53bd0cd03e69ea34da0f50b5671075f83f1df32",
  "title": "ONE SKILLET CHICKEN WITH LEMON GARLIC CREAM SAUCE",
  "image": "http://littlespicejar.com/wp-content/uploads/2015/09/One-Skillet-Chicken-with-Lemon-Garlic-Cream-Sauce-24-300x420.jpg",
  "href": "http://littlespicejar.com/one-skillet-chicken-with-lemon-garlic-cream-sauce/",
  "extension": "Chrome",
  "firstAdded": "2017-01-14T15:06:07.373000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS:",
    "Using a mallet, pound down the chicken breasts/thighs into ½ inch thickness. Sprinkle a pinch of salt and pepper on both sides of the chicken.",
    "In a 2 cup measuring cup or a small bowl, combine the chicken broth, lemon juice, garlic, and red pepper flakes.",
    "Position a rack in the lower third of the oven and preheat the oven to 375ºF.",
    "Heat the olive oil in a large oven-safe skillet over medium high heat. Add the chicken and allow to brown on both sides for 2-3 minutes per side. Don’t worry if the chicken isn’t cooked completely, we’ll finish it in the oven. Remove the chicken to a plate.",
    "Reduce the flame to medium, add the shallots to the skillet along with the chicken broth mixture. Using a whisk, scrape the bottom of the pan so all the brown bits are loosened. Kick the heat back up to medium high and let sauce reduce for about 10-15 minutes [b]or until about ⅓ cup of the sauce remains[/b].",
    "When the sauce has thickened, remove from the flame, add the butter and whisk until it melts completely. With the skillet off the flame, add the heavy cream, whisk to combine. Place the skillet back over the flame for just 30 seconds, DO NOT allow the sauce to boil. Remove from heat, add the chicken back into the pan and drizzle the sauce over the chicken. Place the skillet in the oven for 5-8 minutes or until the chicken is completely cooked through. Top with chopped parsley or basil and serve warm with additional lemon slices.",
    "NOTES:",
    "Use boneless skinless chicken breasts/thighs that about the same thickness. I pounded mine down to about ½ inch.",
    "After a few comments from readers, I’ve adjusted the amount of time it takes to reduce the sauce (step #5). Keep in mind, the key is to reduce it to ⅓ cup and that I can only provide an estimate. It may take you more or less time than what is actually listed."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS:",
    "4 boneless skinless chicken breasts (or thighs)",
    "salt and pepper",
    "1 cup chicken broth",
    "2 tablespoons lemon juice",
    "1 tablespoon minced garlic",
    "½ teaspoon red pepper flakes (or more to taste)",
    "1 tablespoon olive oil",
    "⅓ cup finely diced shallots (or red onions)",
    "2 tablespoons salted butter",
    "¼ cup heavy cream",
    "2 tablespoons chopped parsley or basil"
  ],
  "__v": 1
}