{
  "hash": "f62a20e03225b73dda9619aae597598e004c2865",
  "title": "How To Cook Beans in the Oven",
  "image": "http://recipe-folder.com/img/recipe-images/046/747/755410646.jpg",
  "href": "http://www.thekitchn.com/how-to-cook-beans-in-the-oven-cooking-lessons-from-the-kitchn-102908",
  "extension": "Chrome",
  "firstAdded": "2016-08-24T16:48:41.190000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Soak the beans: Eight hours or the night before you want to cook the beans, pour them into a bowl and cover them with an ample quantity of water. Stir in 1 heaping tablespoon salt. Let the beans sit all night at room temperature, then pour off the water in the morning and proceed to cooking. Note on soaking: As I discuss above, this method still works really well even if you don't soak your beans. I do try to remember to soak as I find they cook faster and more evenly — especially when dealing with enormous beans like these Chestnut beauties. But you can also skip soaking, or do a fast soak as detailed in the Recipe Notes.",
    "Heat the oven to 325°F and put beans in an oven-safe pot: Heat the oven to 325°F. Drain the beans and put them in an oven-safe pot that holds at least 3 quarts. I like using this Dutch oven, but a clay pot is also very good.",
    "Stir in salt and pepper: Add 1 teaspoon salt and a generous quantity of black pepper to the beans.",
    "Add smashed garlic cloves, a bay leaf, and other herbs, if desired: These aromatics are optional; good beans have plenty of flavor on their own! But I often like to add a few smashed cloves of garlic and some red pepper flakes, or a sprig of rosemary.",
    "Cover with water: Cover the beans with water. There should be at least 1 inch of water above the beans. Bring the pot to a boil on the stove. (Note: If cooking red kidney beans or white cannellini beans, boil for a full 15 minutes. Both contain levels of a toxin present when eaten raw or undercooked, and if you want to be on the safe side, boil them before putting them in the oven to ensure this is completely gone.)",
    "Bake for 75 minutes, then check: Cover the beans. Put in the oven and cook for 75 minutes. Taste the beans to see if they are soft and cooked through. Small beans, such as little pintos, will often be done at this point, especially if they soaked all night. If they are still mealy or crunchy inside, put them back in the oven and continue checking in 15 to 20 minute intervals until done. This will usually take no more than 90 minutes, but allow more time if your beans are large, or if they weren't soaked. Taste and season with additional salt if desired."
  ],
  "ingredients": [
    "0",
    "1 pound dried beans",
    "Salt and freshly ground black pepper",
    "Garlic cloves, optional",
    "Bay leaf, optional",
    "Other herbs, dried or fresh, optional"
  ],
  "__v": 2
}