{
  "hash": "5a8f8517355be23cd82571c12118145dc2bc2987",
  "title": "Real Hummus recipe",
  "image": "http://i2.wp.com/humus101.com/EN/wp-content/uploads/Header_PLATE.jpg?resize=455%2C325",
  "href": "http://humus101.com/EN/2006/10/14/hummus-recipe/",
  "extension": "Chrome",
  "firstAdded": "2015-06-30T12:44:53.075000",
  "users": [
    null
  ],
  "keywords": [
    "extralarge",
    "bowls",
    "hummus",
    "chickpeas",
    "smallest",
    "tahini",
    "juice",
    "squeezed",
    "lemons",
    "garlic",
    "cumin",
    "baking",
    "soda",
    "salt",
    "olive",
    "oil",
    "pars"
  ],
  "directions": [
    "0",
    "How do I make that into Hummus? (Directions)",
    "[Brut: 10-20 hours. Net: 30 minutes]",
    "1. Pour the chickpeas over a large plate. Go over them and look for damaged grains small stones, or any other thing you would rather leave out of the plate.",
    "2. Wash the chickpeas several times, until the water is transparent. Soak them in clean water over night with 1 tablespoon of baking soda. Then, wash it, and soak again in tap water for a few more hours. The grains should absorb most of the water and almost double their volume.",
    "3. Wash the chickpeas well and put them in a large pot. Cover with water, add the rest baking soda and NO salt. Cook until the grains are very easily smashed when pressed between two fingers. It should take around 1-1.5 hours, during which it is advised to switch the water once again, and remove the peels and foam which float over the cooking water. When done, sieve the grains and keep the cooking water.",
    "4. Put the chickpeas into a food processor and grind well. Leave it to chill a little while before you continue.",
    "5. Add the tahini and the rest of the ingredients and go on with the food processor until you get the desired texture. If the Humus is too thick, add some of the cooking water. It should be thinner than the actual desired texture.",
    "Serve with some good olive oil and chopped parsley."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "[4 extra-large bowls of Hummus]",
    "1 cups dried chickpeas (the smallest you can find)",
    "1/2 cup tahini",
    "juice from 1 squeezed lemons",
    "1-2 garlic cloves",
    "1/2 teaspoon cumin",
    "1 tablespoon + 1/8-1/4 teaspoon baking soda",
    "salt",
    "olive oil",
    "pars"
  ],
  "__v": 1
}