{
  "hash": "36f01be37ee5dce312dc68768c444f677edf2a3a",
  "title": "CARROT CAKE",
  "image": "https://www.twopeasandtheirpod.com/wp-content/uploads/2015/03/Carrot-Cake-8.jpg",
  "href": "https://www.twopeasandtheirpod.com/carrot-cake/",
  "extension": "Chrome",
  "firstAdded": "2018-02-10T16:43:14.572000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS:",
    "Preheat oven to 350 degrees. Butter two 9-inch round, 2-inch deep cake pans. Dust with flour, tapping out excess. Set pans aside.",
    "In a medium bowl, whisk together flour, baking soda, baking powder, salt, cinnamon, and nutmeg. Set aside.",
    "In the bowl of a stand mixer, beat the eggs until combined. Add the sugar and beat on medium speed well combined, about 2 minutes. Add in the vanilla. With the mixer on low, add the oil in a thin steady stream and continue to beat until fully incorporated.",
    "Add the flour mixture and mix until just combined. Don’t overmix. Stir in the grated carrots and raisins.",
    "Scrape batter into prepared pans, dividing evenly. Bake until golden brown and a toothpick inserted into centers comes out clean, about 30-35 minutes. Let cool in pans on a wire rack for 15 minutes. Run a knife around edges of cakes to loosen, and turn out cakes onto rack. Turn right side up, and let cool completely.",
    "While the cakes are cooling, make the frosting. In the bowl of a stand mixer fitted with the paddle attachment, combine the butter and cream cheese and beat until smooth. Gradually add the powdered sugar. Add the lemon juice and vanilla, and beat until light and fluffy, about 2 minutes.",
    "Using a serrated knife, carefully trim rounded top of cakes. Place one cake, cut side up, on a plate or cake stand. Spread half of the frosting over cake. Invert the remaining cake on top of the frosted bottom layer so that the flat side (the bottom) is on top. Spread remaining frosting over top."
  ],
  "ingredients": [
    "0",
    "FOR THE CAKE:",
    "2 cups all-purpose flour",
    "1 teaspoon baking soda",
    "1 teaspoon baking powder",
    "1 teaspoon salt",
    "2 teaspoons ground cinnamon",
    "1/4 teaspoon ground nutmeg",
    "4 large eggs",
    "2 cups granulated sugar",
    "1 teaspoon vanilla extract",
    "1 cup canola or vegetable oil",
    "2 cups grated carrots",
    "1/2 cup raisins",
    "FOR THE CREAM CHEESE FROSTING:",
    "1/2 cup butter, at room temperature",
    "8 oz cream cheese, at room temperature",
    "5 cups powdered sugar",
    "1 tablespoon lemon juice",
    "1/2 teaspoon vanilla extract"
  ],
  "__v": 1
}