{
  "hash": "b0e1c688ee6662de4950c37f51840d70b87f3ade",
  "title": "Pizza maison",
  "image": "https://assets.afcdn.com/recipe/20181017/82862_w600cxt0cyt0cxb3888cyb5184.jpg",
  "href": "https://www.marmiton.org/recettes/recette_pizza-maison_313213.aspx",
  "extension": "Firefox",
  "firstAdded": "2020-01-02T09:41:18.210000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Etape 1 Dans un saladier, placez les 300 g de farine, puis la levure, puis le bicarbonate de soude, la pincée de sel et celle de poivre. Ajoutez aussi le paprika et le sel d'ail selon votre goût. Mélangez à sec pour homogénéiser les ingrédients.",
    "Etape 2 Versez ensuite la moitié des 20 cl d'eau, remuez avec votre doigt. Versez enfin le reste de l'eau puis remuez, lorsque la pâte est collante, utilisez votre main pour mélanger le tout, jusqu'à obtenir une pâte collante sans reste de farine.",
    "Etape 3 Ajoutez alors un peu de farine à la main, mélangez et pétrissez. Recommencez l'opération (farine plus pétrissage) jusqu'à obtenir une boule de pâte que ne colle plus.",
    "Etape 4 Mettez un peu de farine au fond de votre saladier et sur ses côtés, puis remettez la boule dedans, et couvrez avec un torchon propre.",
    "Etape 5 Laissez reposer la pâte environ 2 heures (ou moins voire pas du tout si vous êtes pressés).",
    "Etape 6 Préparation de la pizza. Mettez votre four à préchauffer à 220°C. Sur votre plan de travail, étalez un peu de farine afin que la boule de colle pas.",
    "Etape 7 Saupoudrez votre boule d'un peu de farine et sortez là du saladier. Avec un rouleau à pâtisserie, faites-en un disque d'environ 35 cm de diamètre.",
    "Etape 8 Posez la pâte ainsi formée sur votre plaque, avec en dessous du papier sulfurisé ou à défaut de la farine, pour que la pâte ne reste pas collée sur la plaque à la cuisson.",
    "Etape 9 Étalez la sauce tomate sur la pâte, jusqu'à ne presque plus voir la pâte au travers (2 à 3 mm d'épaisseur de sauce).",
    "Etape 10 Repartissez ensuite la viande sur la surface. Faites de même avec le fromage, jusqu'à couvrir correctement toute la surface. Enfin placez les olives. Saupoudrez d'une belle pincée d'herbes de Provence.",
    "Etape 11 Enfournez au milieu du four pendant 8 min pour une pâte moelleuse, 10 à 12 min pour une pâte plus croustillante.",
    "Etape 12 Sortez la pizza quand le fromage est bien fondu et commence à faire des bulles et à dorer. Découpez et servez."
  ],
  "ingredients": [
    "0",
    "450 g de farine de blé (blanche ou complète)",
    "30 cl d'eau",
    "1.5 sachet de levure à pain",
    "3/4 cuillère à café de bicarbonate",
    "3 pincées de sel",
    "2 pincées de poivre",
    "30 cl de sauce tomate pour pâtes/pizza (épicée ou non selon votre goût)",
    "375 g de viande (bœuf haché ou non, dès de poulet...)",
    "300 g de fromage râpé (mozzarella ou mélange mozza/cheddar/parmesan recommandés)",
    "2 pincées de herbes de Provence",
    "12 olives noires dénoyautées"
  ],
  "__v": 1
}