{
  "hash": "384cc7aba4274739f4cbd910e4695fef1d0f6c37",
  "title": "Chicken and Asparagus Crepes",
  "image": "",
  "href": "http://www.grosvenormarket.com/blog/chicken-and-asparagus-crepes/",
  "firstAdded": "2015-02-03T14:13:55.765000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "butter",
    "dish",
    "rotisserie",
    "chicken",
    "ricotta",
    "cheese",
    "parmesan",
    "herbs",
    "parsley",
    "dill",
    "chives",
    "mint",
    "kosher",
    "salt",
    "pepper",
    "storebought",
    "crepes",
    "shallot",
    "asparagus",
    "trimmed",
    "pieces",
    "lowsodium",
    "broth",
    "lemon",
    "zest"
  ],
  "directions": [
    "0",
    "Directions",
    "1. Preheat the oven to 425 degrees F. Butter a large baking dish. Combine the chicken, ricotta, 1/2 cup parmesan, 3 tablespoons herbs, 3/4 teaspoon salt and 1/2 teaspoon pepper in a medium bowl. Spoon about 1/4 cup filling across the lower half of each crepe; roll up to enclose the filling. Place the crepes, seam-side down, in the baking dish. Cover with foil and bake until the filling is hot, about 15 minutes.",
    "2. Meanwhile, melt 3 tablespoons butter in a skillet over medium-high heat. Add the shallot and cook until it softens, about 1 minute. Add the asparagus and cook until just tender, about 3 minutes. Add the chicken broth, lemon zest and the remaining 1 tablespoon herbs and simmer until the sauce is slightly thickened, about 2 minutes. Stir in the remaining 1/4 cup parmesan and season with salt and pepper.",
    "3. Divide the crepes among plates, top with the asparagus and sauce, and sprinkle with parmesan."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "3 tablespoons unsalted butter, plus more for the dish",
    "2 1/2 cups shredded rotisserie chicken",
    "1 1/2 cups ricotta cheese",
    "3/4 cup grated parmesan cheese, plus more for serving",
    "1/4 cup chopped fresh herbs (such as parsley, dill, chives or mint)",
    "Kosher salt and freshly ground pepper",
    "8 store-bought crepes (about 9 inches each)",
    "1 shallot, sliced",
    "1/2 pound asparagus, trimmed and cut into pieces",
    "3/4 cup low-sodium chicken broth",
    "1 teaspoon finely grated lemon zest"
  ],
  "__v": 1
}