{
  "hash": "3dba768af2603f9ed69cb3e8e9aec9a3609b0282",
  "title": "Non-Dairy & Paleo Strawberry Cheesecake",
  "image": "http://thehealthyfoodie.com/wp-content/uploads/2014/07/Non-Dairy-Cheesecake.png",
  "href": "http://thehealthyfoodie.com/non-dairy-paleo-strawberry-cheesecake/",
  "extension": "Chrome",
  "firstAdded": "2016-04-25T12:02:09.819000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Line the bottom of a 9” springform pan with parchment paper. To do that, remove the ring and cover the bottom with parchment paper. Fold the excess paper back under the plate and, while holding it in place with one hand, put the ring back in its position with the other hand. Bring the excess paper back from under the pan but do not cut it off.",
    "Grease the side of the pan with lard or ghee or any other healthy and heat resistant fat you prefer.",
    "Add all the ingredients of the crust to your food processor and process on pulse until the mixture has the texture of coarse sand. Press at the bottom and side of the pan. You want to bring the crust up to about halfway up the side of the pan.",
    "Preheat the oven to 350F",
    "Use a box grater or the grater disc of your food processor to grate the cauliflower.",
    "Place the grated cauliflower in a microwave safe bowl and cover loosely with plastic film; microwave for about 4-6 minutes on high. Let the cauliflower cool for a few minutes, until it can be handled safely with your bare hands, and then squeeze it as dry as you possibly can (you could do this by pressing the cauliflower down a fine mesh sieve or wringing it with a tea towel. See this post for more info). Set aside to cool.",
    "Bring 3-4 cups of water to a boil.",
    "Rinse the cashew pieces under running cold water and add them, along with the coconut milk to the bowl of your food processor. Process until real smooth and creamy, about 5 minutes.",
    "Add reserved cauliflower and resume processing until really smooth again, about 3-4 minutes.",
    "Add honey, coconut oil, salt, cinnamon, apple cider vinegar and vanilla and then resume processing until well combined, about 30 seconds.",
    "Throw in the lemon zest and juice and mix to combine; add eggs, one at a time, mixing for about 30 seconds between each addition.",
    "Finally, add tapioca starch and give your filling a final 30 second spin. Pour over the reserved crust.",
    "Place the cake over a piece of aluminum foil and fold it over the pan so the exterior is completely covered. Now place your cake in a rimmed roasting pan, then delicately pour some boiling water into the roasting pan so it goes to about 1/4 of the way up the side of the pan. Place that rig onto the middle rack of your oven and bake for 15 minutes then decrease the temperature to 250F and bake for another 90 minutes.",
    "Turn off the oven and crack the door open. Leave the cake in the oven, undisturbed, for about 1 hour, or until cool enough to be handled with your bare hands, and then slide it out of the oven.",
    "When the “cheesecake” is completely cooled, run a knife around the rim and refrigerate uncovered for at least 6 hours, preferably overnight.",
    "Sprinkle the gelatin over 1/2 cup of cold water and let it rest for a few minutes to allow the gelatin to soak up as much water as possible.",
    "Meanwhile, bring 1 cup of strawberries and half a cup of water to a boil in a small saucepan. Let that boil vigorously for about 5 minutes, until the strawberries have relinquished pretty much all their pretty red color to the water.",
    "Strain through a fine meshed sieve right over the bloomed gelatin, then stir until the gelatin is completely dissolved. Stir in maple syrup, vanilla extract and salt and let this mixture cool until it starts to set. You can place it in the fridge to speed up the process but make sure you check on it often.",
    "While your strawberry jelly is setting, arrange the strawberries over the top of your cake to completely cover it.",
    "Apply the strawberry jelly generously over the fresh strawberries with a pastry brush. If you find it has set a little bit too much, you can give it a few seconds in the microwave to soften it up, but make sure you don’t leave it in there for too long. Go 3-5 seconds at a time, no more.",
    "Place the cake in the fridge until the jelly is completely set, about an hour, then slice and serve."
  ],
  "ingredients": [
    "0",
    "150g (2 cups) finely shredded unsweetened coconut",
    "100g (1 cup) raw hazelnuts, finely ground",
    "35g (1/4 cup) coconut flour",
    "1/4 cup coconut oil, melted",
    "2 tbsp raw honey, melted",
    "1 tbsp blackstrap molasses",
    "1 tsp Himalayan salt",
    "1/2 tsp ground ginger",
    "1/2 tsp ground Ceylon cinnamon",
    "300g (2 cups) raw cashew pieces, soaked overnight",
    "1 cup full fat coconut milk",
    "500g (1.1lb) raw cauliflower, grated",
    "1 cup raw honey, melted",
    "3/4 cup coconut oil",
    "1 tsp Himalayan salt",
    "1/2 tsp ground Ceylon cinnamon",
    "1 tbsp apple cider vinegar",
    "1 tbsp pure vanilla extract",
    "6 large eggs",
    "the juice and zest of 1 lemon",
    "1/4 cup tapioca flour",
    "4 + 1 cups fresh strawberries, stems removed",
    "1 tablespoon grassfed gelatin",
    "1/2 cup cold water",
    "1/2 cup water",
    "2 tablespoons pure maple syrup or raw honey",
    "pinch Himalayan salt",
    "1/2 teaspoon pure vanilla extract"
  ],
  "__v": 1
}