{
  "__v": 1,
  "directions": [
    "0",
    "Method",
    "Fillet the fish and use the bones with the water to make a fish stock (please see below).",
    "Heat the olive oil in a large pan, add the vegetables and garlic and cook gently for 20 minutes, or until soft but not coloured. Add the orange zest, tomatoes, red pepper, bay leaf, thyme, saffron, prawns and fish fillets. Cook briskly for 2 - 3 minutes, then add the stock and orange juice, bring to the boil and simmer for 40 minutes. Meanwhile, for the croûtons, thinly slice the baguette and fry the slices in the olive oil until crisp and golden. Drain on kitchen paper and rub one side of each piece with the garlic clove.",
    "Liquidise the soup and pass through a conical sieve into a clean pan, pressing out as much liquid as possible with the back of a ladle. Return the soup to the heat and season to taste with the cayenne, salt and pepper.",
    "Ladle the soup into a warmed tureen and put the croûtons, parmesan cheese and rouille into separate dishes. To serve, ladle the soup into warmed bowls and leave each person to spread some rouille on to the croûtons, float them on their soup and sprinkle them with some of the par"
  ],
  "firstAdded": "2014-04-10T12:55:04.821000",
  "hash": "2bdd57279c4aa5ef9eb70727b8befb427242f238",
  "href": "http://www.rickstein.com/Classic-fish-soup-with-rouille-and-cro%C3%BBtons-Recipes.htm",
  "image": "http://www.rickstein.com/thumb/phpThumb.php?src=../images/recipe-images/fishsoupsmall.jpg&w=150&h=200&q=100&zc=C",
  "ingredients": [
    "0",
    "900 g (2 lb) mixed fish, such as gurnard, conger eel, dogfish, pouting, cod and grey mullet",
    "1.2 litres (2 pints) water",
    "The other ingredients for making fish stock (see below)",
    "85 ml (3 fl oz) olive oil",
    "75 g (3 oz) each onion, celery, leek and fennel, roughly chopped",
    "3 garlic cloves, sliced",
    "Juice of ½ orange plus 2 pared strips of orange zest",
    "200 g (7 oz) can of chopped tomatoes",
    "1 small red pepper, seeded and sliced",
    "1 bay leaf and 1 sprig of thyme",
    "A pinch of saffron strands",
    "100 g (4 oz) unpeeled, cooked North Atlantic prawns",
    "A pinch of cayenne pepper",
    "Sea salt and freshly ground black pepper",
    "1 quantity of rouille (please see below)",
    "For the croûtons:",
    "1 mini French baguette",
    "Olive oil, for frying",
    "1 garlic clove",
    "25 g (1 oz) parmesan cheese"
  ],
  "keywords": [
    "mixed",
    "fish",
    "gurnard",
    "conger",
    "eel",
    "dogfish",
    "pouting",
    "cod",
    "grey",
    "mullet",
    "litres",
    "pints",
    "water",
    "making",
    "stock",
    "olive",
    "oil",
    "onion",
    "celery",
    "leek",
    "fennel",
    "roughly",
    "garlic",
    "juice",
    "pared",
    "strips",
    "orange",
    "zest",
    "tomatoes",
    "red",
    "pepper",
    "seeded",
    "bay",
    "leaf",
    "sprig",
    "thyme",
    "saffron",
    "strands",
    "unpeeled",
    "north",
    "atlantic",
    "prawns",
    "cayenne",
    "salt",
    "black",
    "quantity",
    "rouille",
    "crotons",
    "mini",
    "french",
    "baguette",
    "frying",
    "clove",
    "parmesan",
    "cheese"
  ],
  "title": "Classic fish soup with rouille and croûtons",
  "users": [
    null
  ]
}