{
  "hash": "b4be0139a25f45afc8d72a69fb07894bc8091c1d",
  "title": "Beef Lasagna",
  "image": "http://munchies-images.vice.com/wp_upload/beef-lasagna-matty.jpg?crop=1xw:0.6xh;*,*&resize=1200:*",
  "href": "https://munchies.vice.com/en/recipes/beef-lasagna",
  "extension": "Chrome",
  "firstAdded": "2017-01-09T18:43:01.011000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Set stove top to high heat. In a large, deep cast iron or enamel pot (like a Le Creuset), pour canola oil to cover the bottom of the pot. Add the ground beef. Once the bottom is browned, continue stirring until all beef is brown— not grey—and is boiling.",
    "While the beef is browning, dice the garlic into a mince. Add a pinch of salt and rub your knife against it to break it down into a paste. Grate the carrot. Chop the onion into a small dice. Add the olive oil into a saucepan and sauté vegetables over medium heat until you see some caramelization (brown, but not dark brown). Once that happens, add the tomato paste and cook for another five minutes to get that raw tomato taste out of there.",
    "Combine veggies and tomato paste to the beef. Stir and combine to make a beautiful mix. At this point, add the chili flakes and beef stock. Bring to a boil and reduce to let every thing come together. This should take 15 minutes. Stir every 3-5 minutes so nothing burns.",
    "Once the stock has reduced down (you’re looking for a thick sauce), add half of the milk. Reduce it down, then add the rest of the milk and reduce. Take off the heat and add the three egg yolks. Stir that in and let it emulsify into the meat. Taste for salt and pepper and adjust as necessary.",
    "Dice the parsley. Now it’s time to assemble the lasagna. Pre-heat the oven to 350° F.",
    "Ladle the meat sauce onto the bottom of your casserole dish, then lay down noodles, then another layer of meat sauce, then layer your cheese, then noodle and so on until your dish is full. Add chopped parsley to the middle layer and add grated part on the top layer.",
    "Place casserole dish on a baking tray so no cheese drips over the sides and burns the bottom of the oven. Cook until golden brown on top (30-35 minutes).",
    "Once its golden brown, bring it to your counter and let rest for 15 minutes. Cut into squares and serve with a salad or something that will cut this meat and cheese party."
  ],
  "ingredients": [
    "0",
    "1/2 cup canola oil",
    "4 lbs ground beef",
    "1 cup good olive oil",
    "1 head of garlic",
    "1 carrot",
    "1 large onion",
    "4 tablespoons tomato paste",
    "3 tablespoons dried red chilies",
    "1 liter beef stock",
    "2 cups milk",
    "4 egg yolks",
    "1 bunch parsley",
    "1 box of oven ready lasagna noodles",
    "3 lbs mozzarella",
    "250-gram wedge of Parmesan cheese"
  ],
  "__v": 1
}