{
  "__v": 1,
  "directions": [
    "0",
    "Combine the egg whites and honey in a heatproof bowl.",
    "Begin by tempering the eggs, which will create a nice crispy cookie exterior. Place the bowl over a pot with boiling water inside and whisk the eggs and honey together until creamy and warm. Test with your finger - if they’re warm to the touch, they’re tempered.",
    "When the egg and honey mixture is warm to the touch, take the bowl off the heat and mix in coconut, quinoa and salt.",
    "Chill in the fridge for at least two hours.",
    "Preheat the oven to 325 degrees F and line a baking sheet with a non-stick baking mat or double parchment paper (the bottoms are sensitive and will burn easily).",
    "Using an ice cream scoop or two spoons, scoop the coconut quinoa dough onto the baking sheet. You will probably need to form the cookies into little round half domes with your fingers, pressing them together tightly so they are sure to stick together while baking.",
    "Bake in the center of a warm oven for 15 minutes until the cookies are nice and golden brown.",
    "Let them cool for at least 10 minutes or until completely cooled. Enjoy!"
  ],
  "firstAdded": "2014-08-12T21:39:21.946000",
  "hash": "94b0fd31b13b86eb6bf6cdf068d388eac280fe01",
  "href": "http://simplysugarandglutenfree.com/alyssas-quinoa-coconut-macaroons/",
  "image": "http://simplysugarandglutenfree.com/wp-content/uploads/2012/07/Quinoa-Coconut-Macaroons2.jpg",
  "ingredients": [
    "0",
    "6 tablespoons egg whites (from about 3 large eggs)",
    "1/4 cup honey (raw is preferable; agave or maple syrup would probably as well)",
    "1 1/2 cups unsweetened shredded coconut",
    "1 cup cooked quinoa",
    "Pinch of salt"
  ],
  "keywords": [
    "egg",
    "whites",
    "eggs",
    "honey",
    "raw",
    "preferable",
    "agave",
    "maple",
    "syrup",
    "probably",
    "coconut",
    "quinoa",
    "salt"
  ],
  "title": "Alyssa’s Quinoa Coconut Macaroons",
  "users": [
    null
  ]
}