{
  "hash": "06c57af8f5cdee46ae6bb13a9e888e85ac6c08a0",
  "title": "Farfalle with carbonara & spring peas",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/200_1_1350897897_lrg.jpg",
  "href": "http://www.jamieoliver.com/recipes/pasta-recipes/farfalle-with-carbonara-and-spring-peas/",
  "firstAdded": "2014-12-31T14:54:10.485000",
  "users": [
    null
  ],
  "keywords": [
    "farfalle",
    "freerange",
    "egg",
    "double",
    "cream",
    "salt",
    "black",
    "pepper",
    "rashers",
    "higherwelfare",
    "pancetta",
    "smoked",
    "streaky",
    "bacon",
    "podded",
    "frozen",
    "peas",
    "sprigs",
    "mint",
    "leaves",
    "picked",
    "parmesan",
    "cheese"
  ],
  "directions": [
    "0",
    "First of all, bring a large pan of salted water to the boil, add the farfalle, and cook according to the packet instructions. Whisk the egg in a bowl with the cream, salt and pepper. Put your pancetta or bacon into a second pan and cook until crispy and golden.",
    "When the farfalle is nearly cooked, add the peas for the last minute and a half. This way they will burst in your mouth and be lovely and sweet. When cooked, drain in a colander, saving a little of the cooking water. Add the pasta to the pancetta and stir in most of the mint, finely sliced - if the pan isn't big enough, mix it all together in a large warmed bowl.",
    "Now you need to add the egg and cream mix to the pasta. What's important here is that you add it while the pasta is still hot. This way, the residual heat of the pasta will cook the eggs, but not so that they resemble scrambled eggs, as I've seen in some dodgy old restaurants on the motorway! The pasta will actually cook the egg enough to give you a silky smooth sauce. Toss together and loosen with a little of the reserved cooking water if necessary. Season with salt and pepper, sprinkle with the Parmesan and the rest of the mint leaves, and serve as soon as possible."
  ],
  "ingredients": [
    "0",
    "455 g farfalle",
    "1 free-range egg",
    "100 ml double cream",
    "sea salt",
    "freshly ground black pepper",
    "12 rashers higher-welfare pancetta or smoked streaky bacon",
    "3 handfuls fresh podded or frozen peas",
    "2 sprigs fresh mint, leaves picked",
    "2 handfuls Parmesan cheese, freshly grated"
  ],
  "__v": 1
}