{
  "hash": "55a349d6385982ab32e760e1702c8ba801d80639",
  "title": "THE Mac and Cheese",
  "image": "http://www.thatwhichnourishes.com/wp-content/uploads/2013/07/mac-and-cheese4-480x640.jpg",
  "href": "http://www.thatwhichnourishes.com/the-mac-and-cheese/",
  "extension": "Chrome",
  "firstAdded": "2015-09-13T11:44:33.736000",
  "users": [
    null,
    null
  ],
  "keywords": [
    "pasta",
    "butter",
    "flour",
    "milk",
    "sharp",
    "white",
    "cheddar",
    "salt",
    "pepper",
    "panko",
    "bread",
    "crumbs"
  ],
  "directions": [
    "0",
    "Boil your choice of pasta (I love cavatappi ’cause it’s just so fun) in water salted with a teaspoon or so of salt until al dente.",
    "While the pasta is cooking, melt 1/2 c. (1 stick) of butter in a large saucepan over medium heat. Sprinkle in 1/2 c. flour and whisk together for 2-3 minutes to let it cook.",
    "Add in 1 T. salt and up to 1 T. pepper. It’s a lot of spice, but you’ll need it. If you’re not huge pepper fans cut that down a bit, but you need the full amount of salt for this amount of pasta. I use Kosher or sea salt or my new favorite Real Salt. Slowly pour in 4 cups of whole milk (don’t skimp here–in fact you can even use some cream) whisking as you go until smooth.",
    "Grease a 9×13″ dish with butter and add the cooked pasta to the dish.",
    "Over the top of the pasta sprinkle 6 cups freshly shredded Cheddar (I use white or sharp), or any mix of cheese you prefer. Some favorites with Cheddar are Havarti and Gouda.",
    "Pour the beautiful cream sauce over the top of the cheese and pasta and let it sit a couple minutes to begin to melt the cheese.",
    "Then, stir the whole beautiful cheesy goodness together and make the topping.",
    "In a small skillet, melt 2 T. butter over medium heat. Add in 1/2 c. panko bread crumbs. Stir constantly until golden brown. Sprinkle over the pasta and cheese.",
    "Bake in a 325 degree preheated oven for 12-15 minutes.",
    "Hot, cheesy perfection.",
    "Serves approx. 6-8 as a main dish or 10-12 as a side."
  ],
  "ingredients": [
    "0",
    "1 lb. pasta",
    "1/2 c. butter",
    "1/2 c. flour",
    "4 c. milk",
    "6 c. sharp or white Cheddar",
    "1 T. salt",
    "1 T. pepper",
    "2. T. butter",
    "1/2 c. panko bread crumbs"
  ],
  "__v": 2
}