{
  "hash": "ee491af12b82895a0a9fc17a5d01c62a5632cae1",
  "title": "Brown Ale Beer Stew with Mashed Potatoes and Parsnips",
  "image": "http://i0.wp.com/lifefoodandbeer.com/wp-content/uploads/2014/12/Brown-Ale-Beef-Stew-1.jpg?resize=680%2C1020",
  "href": "http://lifefoodandbeer.com/brown-ale-beef-stew/",
  "firstAdded": "2014-12-12T05:41:53.583000",
  "users": [
    null
  ],
  "keywords": [
    "oil",
    "beef",
    "stew",
    "meat",
    "salt",
    "pepper",
    "onion",
    "garlic",
    "tomato",
    "worcestershire",
    "stock",
    "beer",
    "thyme",
    "bay",
    "leaf",
    "baby",
    "carrots",
    "parsley"
  ],
  "directions": [
    "0",
    "*If using a crockpot, preheat to low or high heat.",
    "Preheat oil in a large soup pot over medium high heat. Season beef with salt and pepper, and add to pan for a couple minutes each side, to sear the meat. Cook in a few batches to evenly brown each piece. Remove beef from the pan, and add to a bowl.",
    "Once all the meat is browned, add the Onion and Garlic to the pan. Cook until onions begin to turn translucent. Add the Carrots, Tomato Paste, and Worcestershire Sauce and stir to fully coat the veggies.",
    "Add the Beef Stock scrapping the bottom of the pan to remove any pan drippings. Add the Beer and continue stirring until the tomato paste is dissolved. Add the Thyme and Bay Leaf.",
    "Stove Top: Reduce the heat to low, cover and cook for 2 hours. Add the carrots, and continue cooking for an addition 30 minutes. Add additional beef stock if sauce becomes too thick. Season with Salt and Pepper to Taste.",
    "Crockpot: Add ingredients into a large crockpot and cook for 4 hours on high or 8 hours on low. Season with Salt and Pepper to taste.",
    "Serve with Mashed Potato and Parsnips."
  ],
  "ingredients": [
    "0",
    "2 Tablespoons Oil",
    "3 Pounds Beef Stew Meat",
    "Salt and Pepper",
    "1 Large Onion- Diced",
    "6 Cloves Garlic- Chopped",
    "6 Tablespoons Tomato Paste",
    "½ Tablespoon Worcestershire Sauce",
    "3 Cups Beef Stock",
    "¾ Cup Beer",
    "1 Tablespoon Dried Thyme",
    "1 Bay Leaf",
    "2-3 Handfuls Baby Carrots- Sliced",
    "Fresh Chopped Parsley- For Garnish"
  ],
  "__v": 1
}