{
  "hash": "6d04d3366147ab121f103ffc40229b29df2e5f3f",
  "title": "Prime Rib",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2006/12/prime-rib-vertical-600-dm.jpg",
  "href": "http://www.simplyrecipes.com/m/recipes/prime_rib/",
  "extension": "",
  "firstAdded": "2015-04-23T08:02:01.163000",
  "users": [
    null
  ],
  "keywords": [
    "standing",
    "ribs",
    "estimate",
    "people",
    "rib",
    "bones",
    "away",
    "tied",
    "kitchen",
    "string",
    "ask",
    "butcher",
    "prepare",
    "roast",
    "way",
    "salt",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "Remove the beef roast from the refrigerator 3 hours before you start to cook it. Sprinkle it with salt all over and let it sit, loosely wrapped in the butcher paper. Roasts should be brought close to room temperature before they go into the oven, to ensure more even cooking.",
    "2 If your butcher hasn't already done so, cut the bones away from the roast and tie them back on to the roast with kitchen string. This will make it much easier to carve the roast, while still allowing you to stand the roast on the rib bones while cooking.",
    "3 Preheat your oven to 500°F (or the highest temp your oven reaches less than 500°F). Pat the roast dry with paper towels (pre-salting should have made the roast release some moisture), and sprinkle the roast all over with salt and pepper.",
    "4 Place the roast fat side up and rib bones down in a roasting pan. Insert a meat thermometer into the thickest part of the roast, making sure that the thermometer isn't touching a bone.",
    "5 After browning the roast at a 500°F temperature in the oven for 15 minutes, reduce the oven temperature to 325°F. To figure out the total cooking time, allow about 13-15 minutes per pound for rare and 15-17 minutes per pound for medium rare. The actual cooking time will depend on the shape of the roast, how chilled your roast still is when it goes into the oven, and your particular oven. A flatter roast will cook more quickly than a thicker one. There are so many variables involved that affect cooking time, this is why you should use a meat thermometer. A prime rib roast is too expensive to \"wing it\". Error on the rare side, you can always put the roast back in the oven to cook it more if it is too rare for your taste.",
    "Roast in oven until thermometer registers 115°-120°F for rare or 125°-130°F for medium. (The internal temperature of the roast will continue to rise after you take the roast out of the oven.)",
    "Check the temperature of the roast using a meat thermometer 30 to 45 minutes before you expect the roast to be done. For example, with a 10 pound roast, you would expect 2 1/2 hours of total cooking time (15 minutes at 500° and 2 1/4 hours at 325°). In this case, check after 1 hour 45 minutes of total cooking time, or 1 hour 30 minutes after you lowered the oven temp to 325°. (A benefit of using a remote thermometer is that you don't have to keep checking the roast, you'll be able to see exactly what the temperature is by looking at the thermometer outside of the oven.)",
    "Once the roast has reached the temperature you want, remove it from the oven and place it on a carving board. Cover it with foil and let it rest for 30 minutes before carving. The internal temperature of the roast will continue to rise while the roast is resting.",
    "6 Cut away the strings that were used to hold the roast to the rack of rib bones. Remove the bones (you can save them to make stock for soup if you want.) Then, using a sharp carving knife, slice meat across the grain for serving, making the slices about 1/4-1/2 inch thick.",
    "Making gravy",
    "To make the gravy, remove the roast from the pan. Place pan on stove on medium high heat. Pour off all but 2 tablespoons of the drippings to a separate container. Into the 2 tablespoons of drippings in the pan stir in 1 to 2 tablespoons of flour. Stir with a wire whisk until the flour has thickened and the gravy is smooth. Continue to cook slowly and stir constantly. Slowly add back the previously removed drippings (remove some of the fat beforehand if there is a lot of fat). In addition add either water, milk, stock, cream or beer to the gravy, enough to make 1 cup. Season the gravy with salt and pepper and herbs. (See also How to Make Gravy.)",
    "[1] According to Darrell Corti of the Sacramento specialty market Corti Brothers, irrespective of the USDA beef grading system, \"prime rib\" has always referred to that particular cut of beef, a cut which was popularized by restaurants in the 20s and 30s, using quality or \"prime\" beef. Regardless of the USDA grading system, \"prime beef\" has historically referred to quality beef that is raised for consumption with good fat marbling, white fat, and bright red meat, as opposed to tough or lean beef from an ox raised for work.",
    "With the current USDA grading system, \"Prime\" is the label given to the highest grade, and \"Choice\" the next highest; both are high quality grades. Because of high cost and fewer sources over the past decade or two, USDA Prime Grade prime rib has been replaced by most markets with USDA Choice Grade prime rib roast. A USDA \"Choice\" grade standing rib roast has become what most people buy when they buy prime rib in America."
  ],
  "ingredients": [
    "0",
    "One standing rib roast, 3 to 7 ribs (estimate serving 2 people per rib), bones cut away from the roast and tied back to the roast with kitchen string (ask your butcher to prepare the roast this way)",
    "Salt",
    "Freshly ground black pepper"
  ],
  "__v": 1
}