{
  "hash": "50e67a009ff884fdb04b208a162d0c14e35bed52",
  "title": "HOMEMADE CHOCOLATE (VEGAN, PALEO, REFINED SUGAR-FREE)",
  "image": "",
  "href": "https://vibrantandpure.com/2018/11/29/homemade-chocolate-vegan-paleo-refined-sugar-free/",
  "extension": "Chrome",
  "firstAdded": "2019-04-23T05:25:18.140000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Using the double boiler method, melt the cacao butter. Boil some water in a medium sized pot or pan, and place a bowl over the boiling pot with the cacao butter. Keep on eye on it, stirring occasionally, until fully liquid.",
    "Remove the bowl of cacao butter from the stove and mix in 1/2 cup cacao powder, sweetener of choice, vanilla extract, sea salt (optional), and CBD oil (if using). Stir until you have a mixture that looks like melted chocolate. Pour into the mold of your choice and add in and extras (like nuts) if you’re using. You can use chocolate bar molds or simply use a silicone ice cube tray.",
    "Place into the freezer or refrigerator for about an hour, or until hardened. You can store the chocolate at room temperature but I find it does best in the refrigerator or freezer."
  ],
  "ingredients": [
    "0",
    "1/2 cup cacao powder",
    "1/2 cup cacao butter ( I like wild foods, which I got on amazon)",
    "3 tablespoons maple syrup (can do more or less depending how sweet you like your chocolate)",
    "1/2 teaspoon vanilla extract",
    "small pinch of sea salt",
    "(optional add ins: 15- 20 chopped roasted almonds, toasted coconut chips, 1/8 teaspoon peppermint extract for mint chocolate, 1/4 teaspoon rosewater for rose flavored chocolate, gluten-free pretzels—the possibilities are endless!)",
    "Here is the CBD chocolate recipe:",
    "1/2 cup cacao powder",
    "1/2 cup cacao butter",
    "3 tablespoons maple syrup (can do more or less depending how sweet you like your chocolate)",
    "1/2 teaspoon vanilla extract",
    "small pinch of sea salt",
    "2 droppers full of CBD oil (I used the mint chocolate flavor from CW Hemp)",
    "**This recipe makes two chocolate bars– so each bar contains the equivalent of one dropper full of CBD. I used this dosage based on the bottle’s recommendations."
  ],
  "__v": 1
}