{
  "hash": "2cab8112a110b655d9e80a95b8c6efb599481c32",
  "title": "Honey Mustard Chicken & Potatoes",
  "image": "https://cafedelites.com/wp-content/uploads/2018/09/Honey-Mustard-Chicken-Potatoes-IMAGE-7.jpg",
  "href": "https://cafedelites.com/honey-mustard-chicken-potatoes/",
  "extension": "Chrome",
  "firstAdded": "2018-12-28T02:31:57.785000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400°F (200°C). Generously season chicken thighs with salt, pepper and garlic powder.",
    "Heat olive oil in a large, oven-proof non stick pan (or a well-seasoned cast iron skillet) over medium-high heat. Sear chicken thighs for 3 minutes each side, until the skin becomes golden and crisp. Leave 2 tablespoons of chicken juices in the pan for added flavour, and drain any excess.",
    "Fry the garlic in the same pan around the chicken for 1 minute until fragrant. Add the honey, both mustards, and water to the pan, mixing well, and combine all around the chicken.",
    "Add in the potatoes; mix them through the sauce. Season with salt and pepper, to your tastes. Allow the honey mustard sauce to simmer for two minutes, then transfer to the hot oven and bake for 40-45 minutes, or until the chicken is completely cooked through to the bone and no linger pink in the middle.",
    "OPTIONAL: Remove from the oven after 30 minutes; add in the green beans (mixing them through the sauce), and return to the oven to bake for a further 15 minutes, or until the chicken is completely cooked through and no longer pink in the middle, and the potatoes are fork tender."
  ],
  "ingredients": [
    "0",
    "4-5 chicken thighs bone in, skin on or off",
    "Salt and pepper to season",
    "1-1/2 tablespoons garlic powder",
    "1 tablespoon olive oil",
    "1 tablespoon minced garlic",
    "1/4 cup honey",
    "3 tablespoons wholegrain mustard",
    "2 tablespoons smooth Dijon mustard",
    "2 tablespoons water",
    "1 pound (500 g) baby red potatoes quartered",
    "8 ounces (250 g) green beans halved (OPTIONAL)",
    "1-2 sprigs rosemary (OPTIONAL)"
  ],
  "__v": 1
}