{
  "hash": "4bb6102054cb19ab532d7d9f461b9dde982ce238",
  "title": "Brazilian Paprika Chicken Stew with White Beans",
  "image": "",
  "href": "http://www.oliviascuisine.com/brazilian-paprika-chicken-stew-white-beans/",
  "extension": "Chrome",
  "firstAdded": "2016-12-10T19:27:25.980000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large bowl, toss the chicken and sausage with the lime juice and season with salt and pepper.",
    "Heat 3 tablespoons of oil in a dutch oven, over medium high heat, and brown the chicken and sausage, about 2 minutes per side. Depending on the size of your pot, you will have to work in 3-4 batches, adding more oil when necessary. Remove the chicken/sausage to a plate.",
    "Lower the heat to medium, add the remaining oil and sauté the onions and garlic until softened, about 3 minutes. Then, add the paprika and the tomato paste and stir to combine.",
    "Pour the chicken broth and add the bay leaves and thyme. Once the liquid starts boiling, reduce the heat to low and let the stew simmer for 30 to 40 minutes or until the chicken is cooked through and almost falling apart.",
    "With a ladle, remove a bit of the broth into a cup and stir in the flour to make a roux. Return the roux to the pot and add the beans. Cook for 10 more minutes until the sauce has thickened.",
    "Taste for seasoning and add more salt and/or pepper, if necessary. Remove the bay leaves and sprinkle the parsley.",
    "Serve immediately, over rice or with bread."
  ],
  "ingredients": [
    "0",
    "1 pound skinless, boneless chicken breasts, cut into 1-inch pieces",
    "1 pound skinless, boneless chicken thighs, cut into 1-inch pieces",
    "½ pound chicken sausage, sliced",
    "Juice of one lime",
    "Salt and freshly ground pepper",
    "⅓ cup vegetable oil",
    "1 large onion, chopped",
    "3 garlic cloves, minced",
    "1 tablespoon paprika, or to taste",
    "1 tablespoon tomato paste",
    "5 cups chicken broth",
    "2 bay leaves",
    "1 tablespoon thyme leaves",
    "1½ cups cooked white beans (you can use canned)",
    "1 tablespoon flour",
    "¼ cup parsley"
  ],
  "__v": 1
}