{
  "hash": "ab8c9a65e60280495b3801d2d8af76615c50ca80",
  "title": "Vegetable Kugel with Caramelized Leeks",
  "image": "http://i0.wp.com/whatjewwannaeat.com/wp-content/uploads/2014/03/Vegetable-Kugel-9.png?resize=427%2C640",
  "href": "http://whatjewwannaeat.com/vegetable-kugel-caramelized-leeks/",
  "extension": "Chrome",
  "firstAdded": "2015-06-20T12:57:06.177000",
  "users": [
    null
  ],
  "keywords": [
    "leeks",
    "oil",
    "greasing",
    "pan",
    "sauting",
    "russet",
    "potato",
    "washed",
    "medium",
    "zucchini",
    "white",
    "onion",
    "garlic",
    "eggs",
    "matzo",
    "meal",
    "salt",
    "divided",
    "cracked",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "Pre-heat oven to 350 degrees F. First, slice the light parts of the leeks into rounds and heat up a large sauté pan over medium heat. Add a tablespoon of oil and leeks with ¼ teaspoon salt and turn heat to low. Sauté, stirring often until slightly browned and translucent.",
    "Meanwhile, grease a 9 x 13 casserole dish with oil.",
    "Shred up the remaining vegetables with a hand grater or food processer- potato, sweet potato, zucchini, onion and garlic and remove as much water as you can with paper towels. This is important for a dry kugel! Combine with leeks, eggs, ¼ cup vegetable oil, matzo meal, salt and pepper in a large bowl. If you mixture is wet, add in a little more matzo meal.",
    "Pour mixture into the casserole dish and bake for 45 minutes until kugel is cooked through and topping is browned.",
    "Let cool slightly, cut into squares and eat!",
    "You can even make this ahead and reheat in the oven when ready to serve."
  ],
  "ingredients": [
    "0",
    "2 large leeks, or 3 small leeks",
    "¼ cup vegetable oil, plus more for greasing pan and sautéing",
    "1 large russet potato, washed well and peeled",
    "1 large sweet potato, washed well and peeled",
    "2 medium zucchini, washed well and NOT peeled",
    "1 medium white onion",
    "3 medium garlic cloves",
    "3 large eggs, beaten",
    "3 tablespoons matzo meal",
    "1 teaspoon salt, divided",
    "½ teaspoon cracked black pepper"
  ],
  "__v": 1
}