{
  "hash": "782e8593354abcf110f658269f5e6df083f14732",
  "title": "Baked Chicken Parmesan",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2005/02/baked-chicken-parmesan-vertical.jpg",
  "href": "http://www.simplyrecipes.com/recipes/baked_chicken_parmesan/",
  "extension": "",
  "firstAdded": "2016-04-24T02:00:54.622000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Prepare the sauce. In a large saucepan, heat the garlic and oil together over medium high heat until the garlic starts to sizzle. Stir in the tomatoes, basil, oregano, sugar, a pinch of salt and pepper. Bring to a simmer. Continue to simmer until sauce thickens a bit and flavors meld, about 10-12 minutes. Taste sauce, adjust seasoning if necessary, cover and keep warm.",
    "2 Preheat oven to 450°F. Cut each chicken breast half in half for smaller pieces. With a meat pounder, pound the chicken pieces to flatten them to an even thickness - between 1/4 - 1/2 inch. You might find it easier to put the chicken between layers of plastic wrap before pounding.",
    "3 Whisk together mustard, vinegar, salt, and 1/4 teaspoon of pepper in a large bowl, add the chicken pieces, tossing to coat well.",
    "4 In another bowl, mix together the bread crumbs, grated cheese, and 1/4 teaspoon of pepper. Mix well and add in the melted butter. Transfer to a shallow plate. Dredge the chicken pieces 1 piece at a time in the crumb mixture, coating completely. Press the crumbs in gently to adhere and transfer to a stick-free baking sheet. Bake in the middle of the oven until golden brown and cooked through, about 15 minutes.",
    "Serve with a side of rice or pasta. Ladle sauce over the chicken."
  ],
  "ingredients": [
    "0",
    "2 medium garlic cloves, peeled and minced",
    "1/4 cup extra virgin olive oil",
    "1 can (28 oz) crushed tomatoes (we use Muir-Glen)",
    "1/2 teaspoon dried basil",
    "1/4 teaspoon dried oregano",
    "1/4 teaspoon sugar",
    "Salt and ground black pepper",
    "3 Tbsp Dijon mustard",
    "1 Tbsp white-wine vinegar",
    "1/2 teaspoon salt",
    "1/2 teaspoon black pepper",
    "4 (5-oz) skinless boneless chicken breast halves (or deboned thighs)",
    "3/4 cup of breadcrumbs (we make our breadcrumbs from old French bread)",
    "1 cup finely grated Parmesan cheese",
    "3 Tbsp unsalted butter, melted"
  ],
  "__v": 1
}