{
  "hash": "66b9a0c21976463d9318e5bb0feb3793cd6f22bd",
  "title": "easy crockpot chicken and dumplings.",
  "image": "http://www.howsweeteats.com/wp-content/uploads/2012/10/cdumplings-3.jpg",
  "href": "http://www.howsweeteats.com/2012/10/easy-crockpot-chicken-and-dumplings/",
  "extension": "Chrome",
  "firstAdded": "2017-07-01T02:11:40.512000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "directions:",
    "In the bottom of your crockpot, layer onions, carrots and garlic. Season chicken breasts with salt and pepper then lay them on top.",
    "Heat a small saucepan over medium heat and add butter. Once sizzling, whisk in flour and cook for 2-3 minutes to create a roux, until it's golden in color. Add in 2 cups of chicken stock and mix well, bringing to a boil. Cook for 4-5 minutes, stirring, then remove from heat and pour over the chicken and vegetables. Add remaining chicken stock, put the lid on and cook on low for 6 hours.",
    "After 6 hours, turn the crockpot heat onto high. Using forks or kitchen tongs, lightly shred the chicken breasts. (This should be easy since they have cooked so long.) Stir half and half into the crockpot, then recover while you make the dumplings. In a bowl, combine flour, sugar, baking powder, salt and pepper. Crumble in butter with your fingers and rub into the flour until evenly dispersed and coarse crumbs form. Add in milk, stirring well just until a sticky dough forms. Use a tablespoon measure and add small scoops of the dough into the crockpot, starting by placing them around the outside first, then the inside. Cover and cook for another 1-1.5 hours, until dumplings are cooked but soft and not longer raw in the middle. Taste and season additionally if desired.",
    "Serve immediately!"
  ],
  "ingredients": [
    "0",
    "ingredients:",
    "1 sweet onion, diced",
    "1 cup chopped carrots",
    "2 garlic cloves, minced",
    "2.5 pounds boneless, skinless chicken breasts",
    "1/2 teaspoon salt",
    "1/2 teaspoon flour",
    "56 ounces low-sodium chicken stock",
    "2 tablespoons butter",
    "2 tablespoons flour",
    "1/2 cup half and half",
    "dumplings",
    "1 1/8 cups all-purpose flour",
    "1 1/2 teaspoons baking powder",
    "1 teaspoon granulated sugar",
    "1/2 teaspoon salt",
    "1/4 teaspoon pepper",
    "2 tablespoons cold butter, cut into small pieces",
    "1/2 cup milk (whole, 2% or 1%)"
  ],
  "__v": 1
}