{
  "hash": "2eeb8d515520f4ac065941cba7399ad598961793",
  "title": "Blackened Shrimp Cocktail",
  "image": "http://munchies-images.vice.com/wp_upload/blackened-shrimp-recipe.jpg?crop=1xw:0.6xh;*,*&resize=1200:*",
  "href": "https://munchies.vice.com/en/recipes/blackened-shrimp-cocktail",
  "extension": "Chrome",
  "firstAdded": "2017-01-20T15:04:51.404000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the cocktail sauce: Combine all ingredients in a bowl and refrigerate until ready to use.",
    "Cook the shrimp: Wash the shrimp, pat them dry, and set them aside.",
    "Mix the black pepper, cayenne, garlic powder, salt, onion powder, and white pepper together in a bowl.",
    "Dredge each shrimp in the dry rub. Be generous, the more coverage you get, the more flavor you get!",
    "Slick a heavy bottomed skillet (cast-iron would be great) with the oil and heat it up over medium.",
    "Once the oil is just on the verge of smoking, add the shrimp and cook them 1 1⁄2 to 2 minutes on one side, then give them a flip and cook them on the other side.",
    "There may be a moment where you think, “Oh shit! I’m burning these shrimp!” That’s the idea -- you want them to burn a little bit. They are called blackened shrimp, not nicely browned shrimp.",
    "Remove them from the pan. If you can’t wait, now is as good a time as any to eat them, but if prefer to serve them in the classic shrimp cocktail style, let them chill unwrapped in the fridge for at least 30 minutes, up to an hour.",
    "To serve: I like to serve these up as cheesy and old-school as possible, which means putting the cocktail sauce in the bottom of a glass and fanning the shrimp out on the rim. Put a lemon wedge in there for good measure while you’re at it. And for the love of God, if you happen to have decorative pot leaves on hand, use as many as humanly possible (for flair)."
  ],
  "ingredients": [
    "0",
    "for the cocktail sauce:",
    "1/4 cup ketchup",
    "2 tablespoons fresh lemon juice",
    "2 teaspoons freshly grated horseradish*",
    "1 teaspoon Worcestershire sauce",
    "*you can use the prepared stuff, but if you do, you’re a NINNY! (JK you aren’t a ninny, but it really is much cooler if you use fresh)",
    "for the shrimp:",
    "1 dozen large shrimp (about 3/4 pound), peeled and deveined",
    "2 teaspoons black pepper",
    "2 teaspoons cayenne pepper",
    "2 teaspoons garlic powder",
    "2 teaspoons kosher salt",
    "2 teaspoons onion powder",
    "2 teaspoons white pepper",
    "2 tablespoons olive oil"
  ],
  "__v": 1
}