{
  "hash": "459fc6861cb44ef6c6fbcefa0f3a684e80379206",
  "title": "7-Layer Steak Sandwich",
  "image": "https://ak-hdl.buzzfed.com/static/2016-01/28/12/enhanced/webdr08/enhanced-29799-1454000422-1.png",
  "href": "http://www.buzzfeed.com/melissaharrison/7-layer-steak-sandwich",
  "extension": "Chrome",
  "firstAdded": "2016-02-01T19:40:13.267000",
  "users": [
    null,
    null
  ],
  "keywords": [
    "sirloin",
    "loin",
    "steaks",
    "kosher",
    "salt",
    "pepper",
    "oil",
    "divided",
    "unsalted",
    "butter",
    "yellow",
    "onion",
    "button",
    "mushrooms",
    "sourdough",
    "bread",
    "boule",
    "slices",
    "cheddar",
    "cheese",
    "baby",
    "spinach",
    "strips",
    "bacon",
    "provolone",
    "swiss",
    "work",
    "great",
    "recipe",
    "use",
    "boneless",
    "steak",
    "best"
  ],
  "directions": [
    "0",
    "PREPARATION",
    "Season each steak generously with salt and pepper, making sure to rub the salt and pepper into the sides of the steak.",
    "In a cast iron skillet, heat the vegetable over high heat until smoking hot. Lay the steaks in the pan and cook for about 2 minutes. Flip the steaks, then add the butter, swirling it around the pan. Using a large spoon, scoop the melted butter over the tops of the steak, basting them continuously. Cook for about 2 minutes to get medium rare. (Check the steaks with an instant read thermometer if you have one; you want an internal temperature of about 135˚F.) Set the steaks aside on a cutting board to rest.",
    "Wipe out the skillet and heat the remaining 2 tablespoons of oil over medium-high heat. Add the onion and mushrooms and sauté, stirring constantly, until caramelized, about 20 minutes.",
    "Using a serrated knife, slice the top off the bread and scoop out the insides to create a bread bowl. Nestle one steak into the bottom of the bread bowl. Layer the cheddar cheese evenly on top. Add the caramelized onions and mushrooms and use a spoon to spread them evenly over the cheese. Top with the spinach, then the bacon, then the Swiss cheese. Finally, put the second steak on top, tucking it under the lip of the bread bowl. Cover with the bread lid and wrap the entire loaf in foil.",
    "Place the wrapped sandwich in the fridge and put a cutting board on top of it. Stack books on the cutting board to compress the sandwich. Chill in the fridge for at least 5 hours.",
    "Preheat the oven to 250˚F. Remove the foil from the sandwich and place it on a baking sheet. Bake for 20 minutes, until the bread is slightly crisp. Slice into wedges and enjoy!"
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "2 (12-oz) sirloin or top loin steaks*",
    "Kosher salt and freshly ground pepper",
    "¼ cup plus 2 tablespoons vegetable oil, divided",
    "2 tablespoons unsalted butter",
    "½ large yellow onion, chopped",
    "2 cups button mushrooms, chopped",
    "1 large sourdough bread boule",
    "6 slices cheddar cheese",
    "1 cup baby spinach",
    "6 strips cooked bacon",
    "6 slices Provolone or Swiss cheese",
    "*Sirloin or top loin steaks work great for this recipe, but you can use any boneless cut of steak that you like best."
  ],
  "__v": 2
}