{
  "hash": "412efb8111f8eed6ac06042eb367064f8794b283",
  "title": "Last-Minute Vegan Fruit Tart",
  "image": "http://serenae.com/wp-content/uploads/2010/08/fruittart1.jpg",
  "href": "http://serenae.com/2010/08/10/last-minute-vegan-fruit-tart/",
  "extension": "Chrome",
  "firstAdded": "2015-06-23T11:53:00.826000",
  "users": [
    null
  ],
  "keywords": [
    "shortbread",
    "crust",
    "nonhydrogenated",
    "nondairy",
    "butter",
    "room",
    "confectioners",
    "sugar",
    "allpurpose",
    "flour",
    "ice",
    "water"
  ],
  "directions": [
    "0",
    "Preheat the oven to 350°F (180°C). Lightly grease the pie pan with canola oil or nondairy butter. I used this 9″ tart pan, but any similarly sized pie dish or square casserole dish will do. Use tartlet pans or even a muffin pan if you want to make cute little tartlets.",
    "In a medium-sized bowl, cream the butter and confectioners’ sugar until light and fluffy. (If you have an electric mixer, use it. If not, a spoon employed vigorously for several minutes is also sufficient. My mixture was creamy–rather than fluffy–and still turned out fine.)",
    "Add the flour a third at a time and beat until the dough just comes together. If your dough, like mine, doesn’t just “come together”, stir in ice water one tablespoon at a time until the dough begins to form a loose ball. It’s okay if it’s still a little crumbly. If you’re not on a tight schedule, I recommend covering the dough4 and chilling it in the fridge for at least 2 hours. This will help prevent shrinking when you bake.",
    "Press the mixture into the bottom of your prepared pan. (If you are making tartlets, be sure that you spread the dough quite thin in the tartlet pans or muffin tin, as it will puff up when baking.) Bake for about 20 minutes, or until lightly browned. Bake time will vary depending on your oven. Mine took about 35 minutes, so start out with 20 and check every 5-10 minutes after that. Remove from the oven and place somewhere to cool.",
    "—",
    "PASTRY CREAM (CUSTARD):",
    "1/3 cup (65g) granulated sugar",
    "2 tbsp (16g) all-purpose flour",
    "4 tbsp (32g) cornstarch",
    "1/4 cup (60mL) water",
    "1 1/3 cups (315mL) nondairy milk (I used rice milk, but soy milk is obviously fine, too)",
    "2 tsp vanilla or lemon extract (I used vanilla)",
    "Hey, slice your fruit first since you’re going to put it on as soon as the pastry cream is done!",
    "In a medium-sized bowl, beat together the sugar, flour, cornstarch, and water on high speed until creamy, about 2 minutes. (Again, I just used a fork for about 4 minutes, adding the ingredients one at a time.) Set aside.",
    "In a saucepan, bring the milk to a simmer. Pour about 1/3 cup (80mL) of the hot milk into the sugar mixture and stir to thoroughly combine. This doesn’t have to be precise; just make sure the sugar mixture is a little liquid-y. Pour this sugar-milk mixture back into the saucepan with the rest of the milk. Return to the stove and heat over medium-low heat, whisking constantly. This is important! Don’t stop whisking for anything, not even zombies or kittens! It will begin to thicken immediately. (They’re not kidding. It only takes about a minute or two, if that, for the cream to thicken sufficiently.)",
    "Scrape the bottom and sides of the pan as you whisk. Cook until it begins to bubble, then whisk as vigorously as you can for 30 seconds, and remove from heat. (Mine never bubbled. If yours doesn’t either, just remove from heat when it seems about as thick as your average chocolate pudding.) Stir in the vanilla/lemon extract.",
    "Your pie crust should be baked and ready, so go ahead and pour the cream into the crust right away, smoothing it flat with a rubber spatula or large spoon. It doesn’t have to be perfect, since the fruit will be covering it anyway. Be sure to put your fruit on top immediately, before the pastry cream sets.",
    "If your crust isn’t ready yet, you can store the pastry cream (covered) in the fridge for up to 3 days.",
    "—",
    "TOPPING:",
    "3-4 tbsp (80g) jelly, jam or preserves (I used apricot jam. Peach is also good.)",
    "2 1/2 cups fruit, sliced (I used about 1 1/2 cups of strawberries, 1 kiwi, 7 blackberries, and a handful of blueberries)",
    "Arrange your sliced fruit on top of the tart. Even if you’re the worst pastry decorator in the history of the world, there’s no way this will look anything but delicious.",
    "Heat the jelly in a small saucepan, whisking constantly. Once it’s hot, strain into a small bowl, mug, or measuring cup, leaving behind seeds or anything else solid. It should be liquid enough to pour. If it’s too thick, just reheat with a little water added.",
    "Using a pastry brush (or a small spoon, in a pinch), brush the heated jelly over the top of the fruit. Everything should be covered with a thickish layer, but not overwhelmed. It should look moist, shiny, and wonderful. NOTE: it may be difficult to stop yourself from devouring the tart right then and there. (Another argument for tartlets.)",
    "Serves 8, supposedly. It served three of us, with about 1/6 left over."
  ],
  "ingredients": [
    "0",
    "SHORTBREAD CRUST:",
    "1/2 cup (112g) non-hydrogenated, nondairy butter, at room temperature3",
    "1/4 cup (25g) confectioners’ sugar",
    "1 cup (125g) all-purpose flour",
    "4 tbsp ice water"
  ],
  "__v": 1
}