{
  "hash": "7bf5fcf4a5ac256d7ecacb1a4ed0b2dadbfda20d",
  "title": "Gong bao chicken",
  "image": "http://realfood.tesco.com/media/images/Gong-bao-chicken-LGH-ed658b88-9d68-4baa-a228-b1a2670855ba-0-1400x919.jpg",
  "href": "http://realfood.tesco.com/recipes/gong-bao-chicken.html",
  "extension": "Chrome",
  "firstAdded": "2015-12-17T16:13:30.905000",
  "users": [
    null
  ],
  "keywords": [
    "oil",
    "chicken",
    "breasts",
    "pieces",
    "spring",
    "onions",
    "ginger",
    "garlic",
    "red",
    "chilli",
    "crumbled",
    "extra",
    "serve",
    "roasted",
    "peanuts",
    "steamed",
    "white",
    "rice"
  ],
  "directions": [
    "0",
    "This delicious Chinese chicken dish is flavoured with fresh ginger, garlic, chilli and peanuts, and drizzled in a soy-infused sauce. A classic Chinese recipe that can be made in just 20 minutes and a great dinner for two idea.",
    "For the sauce, put the stock, sugar, rice wine vinegar, soy and cornflour in a bowl and whisk to combine. Set aside until needed. Heat the oil in a large wok set over a high heat. Add the chicken pieces and cook for 2-3 minutes, until golden. Remove and set aside.",
    "In the same wok, stir-fry most of the spring onions, the ginger, garlic and chilli for 2 minutes, or until fragrant. Add the peanuts and continue cooking for 2 minutes, or until golden.",
    "Return the chicken to the wok and pour over the sauce. Cook, stirring, for 3-4 minutes, until the sauce is glossy and thickened and the chicken is cooked through with no pink meat showing. Divide the chicken between plates and scatter over the remaining spring onions and a little extra chilli. Serve with rice."
  ],
  "ingredients": [
    "0",
    "1 tbsp vegetable oil",
    "2 chicken breasts, cut into 2.5cm (1in) pieces",
    "2 spring onions, sliced",
    "5cm (2in) piece fresh ginger, finely sliced",
    "2 garlic cloves, finely chopped",
    "1 dried red chilli, crumbled, plus extra to serve",
    "handful roasted peanuts",
    "steamed white rice, to serve"
  ],
  "__v": 2
}