{
  "__v": 2,
  "directions": [
    "0",
    "To make the risotto, heat 2 tbsp of the oil in a heavy bottomed pot over medium heat. Add the onions, salt lightly and sweat, stirring frequently so that the onions do not brown.",
    "After 5 or 6 minutes when the onions begin to wilt, add the garlic and cook a minute longer. Then add the rice and stir well to coat with the oil, add more oil if necessary.",
    "Continue cooking, stirring frequently until the grains of rice becomes translucent then deglaze with wine.",
    "When the wine has been reduced to syrup, add 1/2 cup of the hot stock and stir it. Once thickened, add another 1/4 cup stock, stir, and then season lightly. Continue until the rice is nearly cooked and the stock is nearly finished.",
    "To make the cream corn, after steaming the corn until tender, cool and remove kernels from cobs. Set aside 1 1/4cups of kernels. Cook the rest of the corn and the cobs in milk and cream for an hour on low heat.",
    "Remove the cobs from the corn cream mixture and purée, adding cream as needed. Then season to taste with salt and pepper.",
    "To make the sauce, in a medium saucepan, combine all the ingredients and bring to a boil, simmer for 15 minutes. Stir in the cream and simmer for an additional 15 minutes, then whisk in butter, piece by piece.",
    "Purée the mixture with a hand blender and then pass through a strainer into a double boiler or a clean pot, then add salt to taste and froth with frothing wand if desired.",
    "To serve the dish: Add the shrimp to the risotto three minutes before plating. When the shrimp is cooked, add the reserved kernels and corn puree as needed. Then fold in your cheese and butter."
  ],
  "firstAdded": "2014-10-16T05:32:47.516000",
  "hash": "66d54e8939bc7d37fbbf16a0c58bea23ca6a1fa6",
  "href": "http://www.thestar.com.my/Lifestyle/Food/Recipes/2011/10/17/Risotto-with-Sweet-Corn-and-Shrimp/",
  "image": "http://www.thestar.com.my/~/media/Images/TSOL/Photos-Gallery/Kuali/2011/10/risotto.ashx?w=620&h=413&crop=1&",
  "ingredients": [
    "0",
    "Risotto",
    "-------------------",
    "3 tbsp olive oil",
    "1 cup minced onion",
    "1 tsp minced garlic",
    "1 1/4 cup carnaroli rice",
    "1/2 cup white wine",
    "1litre chicken stock at a simmer",
    "1/2 cup freshly grated parmesan",
    "2 tbsp butter",
    "1 cup blanched sweet peas",
    "3 tbsp sweet pea purée",
    "Salt and pepper to taste",
    "15 pieces of shrimp sliced in half lengthwise",
    "---------------------",
    "Creamed Corn",
    "---------------------",
    "10 ears of corn, cleaned and steamed until tender",
    "1 cup milk",
    "1 cup cream (25%)"
  ],
  "keywords": [
    "risotto",
    "olive",
    "oil",
    "onion",
    "garlic",
    "carnaroli",
    "rice",
    "white",
    "wine",
    "litre",
    "chicken",
    "stock",
    "simmer",
    "parmesan",
    "butter",
    "peas",
    "pea",
    "salt",
    "pepper",
    "pieces",
    "shrimp",
    "lengthwise",
    "creamed",
    "corn",
    "ears",
    "cleaned",
    "steamed",
    "tender",
    "milk",
    "cream"
  ],
  "title": "Risotto with Sweet Corn and Shrimp",
  "users": [
    null
  ]
}