{
  "hash": "ce41c374fdb2dd2b83b6f29b8fb18106c02d049d",
  "title": "Gluten Free Buckwheat Pizza Dough",
  "image": "http://www.economiesofkale.com/wp-content/uploads/2012/11/Buckwheat-gluten-free-pizza.jpg",
  "href": "http://www.economiesofkale.com/2012/11/gluten-free-buckwheat-pizza-doug/",
  "extension": "",
  "firstAdded": "2015-12-14T01:25:48.294000",
  "users": [
    null
  ],
  "keywords": [
    "active",
    "dry",
    "yeast",
    "buckwheat",
    "flour",
    "water",
    "salt",
    "olive",
    "oil",
    "polenta",
    "dusting"
  ],
  "directions": [
    "0",
    "Mix the yeast, 1 tablespoon of the buckwheat flour and ¼ cup of warm water in a small bowl. Set aside for 5 minutes.",
    "Mix 1¼ cups of buckwheat flour, ½ cup of warm water, salt and oil in a large bowl. Add the yeast mixture and mix until smooth. Slowly mix in the remaining buckwheat flour until you have a smooth ball of dough.",
    "Knead the dough on floured surface for around five minutes, until you have a ball of dough that sticks together but is not wet. Place the ball of dough back into the bowl, cover and allow to rise for 45 minutes to 1 hour. It will not rise much in this time, but that is okay. .",
    "While the dough is rising, dust your pizza stone with polenta, place it in the oven and preheat to 250C (500F). If you don't have a pizza stone, preheat a baking tray in the oven instead.",
    "When you are ready to make the pizza, stretch out the dough to the required size, remove the pizza stone from the oven and place the dough on top. Quickly place all of the toppings on top (it's a good idea to have them already prepped) and put it back in the oven. Cook for 10-15 minutes, until toppings are cooked and cheese is bubbly.",
    "Enjoy (and keep some leftovers for your lunch the next day if you can!)"
  ],
  "ingredients": [
    "0",
    "2¼ tsp active dry yeast",
    "1¾ cups buckwheat flour",
    "¾ cup warm water",
    "1 tsp salt",
    "½ tbsp olive oil",
    "Polenta, for dusting"
  ],
  "__v": 1
}