{
  "hash": "46c85bb4a97fbcc620db6fb7f9b46a2bbcada4cd",
  "title": "SPAGHETTI SQUASH BURRITO BOWLS",
  "image": "http://www.makingthymeforhealth.com/wp-content/uploads/2014/09/Spaghetti-Squash-Burrito-Bowls-_thu_thumb.jpg",
  "href": "http://makingthymeforhealth.com/spaghetti-squash-burrito-bowls/",
  "extension": "Chrome",
  "firstAdded": "2017-08-01T03:06:23.658000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS:",
    "Preheat the oven to 375°F and line a cookie sheet with foil OR fill a 9 x 13” glass baking dish with about an inch of water. If you’re making the full recipe, you’ll have four bowls total (or four halves of squash) so you’ll probably need two separate cookie sheets or baking dishes (or one of each!).",
    "Wash the spaghetti squash and then slice off the stem at the top (if it is too hard to cut, try cutting a few slices in it and microwaving it for 5 minutes to help soften it). Cut each squash in half lengthwise and then use a spoon to scrap out the seeds and the darker yellow strands that the seeds are attached to.",
    "Rub a little bit of high heat oil on the inner edges of the squash and then place each half face down on the baking sheet/dish. Roast in the oven for 30-45 minutes, depending on the size (longer for larger squash). You can test to see if it’s done by scraping the inside with a fork. Strands should come loose as you scrape all the way down to the flesh.",
    "While the squash is roasting, prepare the filling by warming one tablespoon oil in a large pan over medium heat. Sauté the red onion for a few minutes and then add the peppers and jalapeno. Sprinkle with salt & pepper and cumin and cook to desired softness. I like mine with a little crunch so I only cooked them for about 6-7 minutes.",
    "When the squash is done cooking, allow it to cool for a few minutes before handling. Turn the oven to broil and then transfer the squash to a surface where you can scrape the inside and begin stuffing.",
    "Scrape about 3/4 of the inside out onto a dish and then layer the filling inside (black beans and corn, peppers and onion, salsa and cilantro). Top with the spaghetti squash and press down then add another layer of filling. Sprinkle green onion on top and then finish with shredded cheese.",
    "Broil in the oven for about 5 minutes so that the cheese is bubble and golden brown then serve!"
  ],
  "ingredients": [
    "0",
    "INGREDIENTS:",
    "2 medium sized spaghetti squash",
    "1 tablespoon high heat oil (I use sunflower oil)",
    "1 (14.5 ounce) can black beans, drained and rinsed",
    "1 (16 ounce) jar of salsa (use your preferred level of spiciness)",
    "2 tablespoons olive oil (or preferred cooking oil)",
    "1 large bell pepper or two small, cored and sliced",
    "1 large red onion, sliced",
    "2 cups corn kernels, frozen and defrosted or fresh",
    "1 cup fresh cilantro, finely chopped",
    "2 jalapenos, cored and sliced (optional)",
    "6 green onions, sliced (optional)",
    "1 teaspoon cumin",
    "salt & pepper",
    "1 cup shredded cheddar/monterey jack cheese"
  ],
  "__v": 1
}