{
  "hash": "83d73b43b33ee46b8f41f752efc3dcbcf3e8e05b",
  "title": "Chicken casserole",
  "image": "",
  "href": "http://www.goodtoknow.co.uk/recipes/130678/Chicken-casserole",
  "extension": "Chrome",
  "firstAdded": "2018-02-08T13:21:03.855000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large cast-iron casserole or frying pan, heat a little oil and brown the chicken pieces all over, then transfer to a plate (you may need to do this in batches). Brown the bacon and put on the plate with the chicken. Add a knob of butter to the oil in the casserole and gently brown the onions and mushrooms, before adding the chicken and bacon back into the casserole.",
    "Add the carrot, celery, bouquet garni, chicken stock and wine to the chicken and season well. Cover and transfer to a preheated oven at 170ºC (325ºF, gas mark 3) for 30-40 mins.",
    "With a slotted spoon, transfer the chicken and vegetables to a large dish and keep warm. Mix the flour and butter together to form a paste (called a beurre manie).",
    "Bring the sauce in the casserole to the boil and add a small amount of the beurre manie to it, whisking continuously until dissolved. The mixture should begin to thicken. Add the rest of the beurre manie a little at a time until you have reached the desired thickness (you may not need all of it).",
    "Stir in the double cream, then pour over the chicken and sprinkle with some chopped parsley."
  ],
  "ingredients": [
    "0",
    "1 large 2kg (4½ lb) chicken, jointed into 8 pieces",
    "100g (4oz) streaky bacon, chopped",
    "25g (1oz) soft butter, plus extra for the sauce",
    "200g (8oz) small onions or shallots, whole and peeled",
    "150g (5oz) button mushrooms",
    "2 carrots, cut into chunks",
    "1 stick celery, cut into chunks",
    "Bouquet garni (bay leaf, thyme, parsley stalks, black peppercorns)",
    "500ml (18fl oz) chicken stock",
    "300ml (½ pt) white wine",
    "25g (1oz) plain flour",
    "2tbsp double cream"
  ],
  "__v": 1
}