{
  "__v": 2,
  "directions": [
    "0",
    "Grease 9in round mould with melted butter or corn oil and line the bottom with grease-proof paper.",
    "Combine the yolks, sugar, water, melted butter/corn oil, vanilla extract, yellow colouring and flour in a bowl. Mix until the batter is smooth.",
    "In another clean mixing bowl, whisk the whites and 100g of sugar until medium peak.",
    "Fold the whites into the vanilla batter and mix well. Do not over-mix as this will cause the volume of the sponge to drop.",
    "Pour the light batter into the greased mould and bake at 180 degrees Celcius for 30 minutes.",
    "As for the Creamy Corn Filling, combine milk, water, sugar, salt and agar-agar powder in a saucepan and bring to boil.",
    "In a separate bowl, dissolve the custard powder in the coconut milk. Add in a can of cream corn kernel.",
    "Stir in the coconut custard mix into the boiling milk and continue to cook till mixture boils and thickens. Add in 1-2 drops of yellow colouring, stir well and set aside.",
    "To assemble the cake, cut the vanilla sponge into three horizontal layers.",
    "Place the first layer of sponge into a 10in cake ring/ springfoam pan.",
    "Pour 1/3 of the creamy corn filling onto the sponge and smoothen it.",
    "Then top with the second layer of sponge and spread another half of the remaining filling.",
    "Top with the last piece of sponge, spread and finish off the balance of the filling.",
    "Cool it down & refrigerate for at least 3-4 hours to allow the custard to set thoroughly.",
    "Unmould, garnish as required. (You may also cover the side of the cake with whipped topping and coat with desiccated coconut).",
    "The cake is ready to be cut & served."
  ],
  "firstAdded": "2014-10-16T05:35:55.383000",
  "hash": "5b0e26eca09c7d344405e5cebb0de528d9f7ad5d",
  "href": "http://www.thestar.com.my/Lifestyle/Food/Recipes/2011/09/29/Creamy-Corn-Layer-Cake/",
  "image": "http://www.thestar.com.my/~/media/Images/TSOL/Photos-Gallery/Kuali/2011/9/corn.ashx?w=620&h=413&crop=1&",
  "ingredients": [
    "0",
    "Vanilla Sponge",
    "---------------------",
    "5 egg yolks",
    "40g sugar",
    "60g water",
    "60g melted butter/corn oil",
    "1 tbsp vanilla extract",
    "1-2 drops yellow colouring (optional)",
    "100g super fine flour",
    "5 egg whites",
    "100g sugar",
    "-------------------------",
    "Creamy Corn Filling",
    "-------------------------",
    "400g milk",
    "400g water",
    "150g sugar",
    "3g salt",
    "12g agar-agar powder",
    "300g coconut milk",
    "80g custard powder",
    "1 canned cream corn kernel",
    "1-2 drops yellow colouring"
  ],
  "keywords": [
    "vanilla",
    "sponge",
    "egg",
    "yolks",
    "sugar",
    "water",
    "buttercorn",
    "oil",
    "drops",
    "yellow",
    "colouring",
    "super",
    "flour",
    "whites",
    "creamy",
    "corn",
    "filling",
    "milk",
    "salt",
    "agaragar",
    "coconut",
    "custard",
    "canned",
    "cream",
    "kernel"
  ],
  "title": "Creamy Corn Layer Cake",
  "users": [
    null
  ]
}