{
  "hash": "acd3168ff4c81906ca32840eea5865159e021be4",
  "title": "Black Rye-Style Vegan Buns",
  "image": "http://freerangecookies.com/wp-content/uploads/2014/09/rye-style-blackish-gf-vegan-buns.jpg",
  "href": "http://freerangecookies.com/2014/09/24/blackish-rye-style-vegan-buns/",
  "extension": "Chrome",
  "firstAdded": "2015-04-19T10:10:48.024000",
  "users": [
    null
  ],
  "keywords": [
    "today",
    "sorghum",
    "flour",
    "bread",
    "blend",
    "cocoa",
    "psyllium",
    "husk",
    "chia",
    "seeds",
    "sugar",
    "caraway",
    "instant",
    "yeast",
    "baking",
    "salt",
    "olive",
    "oil",
    "coffee",
    "equal",
    "espresso",
    "water",
    "tomorrow",
    "dissolved",
    "sesame",
    "cornmeal",
    "nod",
    "dark",
    "rye",
    "breads"
  ],
  "directions": [
    "0",
    "In a medium bowl, combine gluten free flour, cocoa powder, psyllium husk powder, chia seeds, sugar, caraway seeds, 1 teaspoon yeast, baking powder, and salt.",
    "Add oil and coffee (or water) in cup to dry ingredients and stir thoroughly to combine. Dough will thicken in a few minutes as psyllium and chia seeds work their magic. Cover and refrigerate overnight.",
    "The next day, remove dough from fridge about an hour before you plan on baking. Heat oven to 350 degrees. Line a cookie sheet with parchment paper. Dissolve 1/8 teaspoon yeast in water and stir into dough.",
    "Blend desired seed toppings in a small bowl.",
    "Using a #10 disher to portion, drop dough into bowl of seeds, coating on all sides. Flatten balls slightly and top with sea salt if you like. A few minutes (10-1in a warm place is all that's needed before baking.",
    "Bake for 22-24 minutes.",
    "*About the psyllium, check the label to make sure no gluten-containing ingredients have been added. Konsyl (found at Walgreens) works well on a regular basis."
  ],
  "ingredients": [
    "0",
    "Today",
    "1 1/2 cups sorghum flour bread blend",
    "1/4 cup unsweetened cocoa powder",
    "1 tablespoon psyllium husk powder*",
    "1 tablespoon chia seeds, ground",
    "1 or 2 tablespoons sugar",
    "1 tablespoon caraway seeds",
    "1 teaspoon instant yeast",
    "1/2 teaspoon baking powder",
    "1/2 teaspoon salt",
    "3 tablespoons olive oil + coffee to equal 1 cup (or instant espresso in water)",
    "Tomorrow",
    "1/8 teaspoon instant yeast dissolved in 1 tablespoon water",
    "Seeds for topping: 4 tablespoons sesame, 1 tablespoon caraway seeds, plus a few tablespoons cornmeal as a nod to traditional dark rye breads",
    "Sea salt"
  ],
  "__v": 1
}