{
  "hash": "ffb26f1debfae135123c6aa3b4eb6448ff9da56d",
  "title": "Festive Gubana",
  "image": "http://www.annabel-langbein.com/images/recipes/heros/Festive-Gubana_hero.jpg?width=608&547",
  "href": "http://www.annabel-langbein.com/recipes/festive-gubana/374/",
  "extension": "Chrome",
  "firstAdded": "2015-12-11T04:07:39.295000",
  "users": [
    null
  ],
  "keywords": [
    "dough",
    "butter",
    "milk",
    "dry",
    "yeast",
    "granules",
    "sugar",
    "highgrade",
    "flour",
    "salt",
    "filling",
    "fruit",
    "mince",
    "chocolate",
    "chips",
    "dust",
    "icing"
  ],
  "directions": [
    "0",
    "Preheat oven to 180°C. Line two 26-28cm round cake tins with baking paper.",
    "Place the butter in a small pot and heat gently until melted. Remove from the heat and add the milk. The mixture should be at blood temperature before you sprinkle the yeast and sugar over the top. Stir for a minute or two until the yeast is absorbed.",
    "Mix flour and salt together in a large bowl. Add the milk mixture and stir until just combined. Tip the dough onto a lightly floured surface and knead until smooth and silky – about 60-100 kneading strokes. Place the dough in a large, lightly oiled container, cover with a clean cloth and leave to rise in a warm place until it has almost doubled in size – about 1 hour.",
    "When risen, divide the dough in half. Roll half the dough out to a thickness of about 1cm to form a 60 x 30cm rectangle. Spread half the fruit mince over each rectangle, leaving a 2cm border. Sprinkle over half the chocolate chips. Roll the rectangle up tightly along the longest edge to create a long cylinder shape and place into one of the lined cake tins. Repeat the process with the other half of the dough and filling to make the second Festive Gubana.",
    "Cover loaves with a clean teatowel and leave to rise in a warm place for 45 minutes until nearly doubled in size. Bake for 30 minutes until golden and cooked through. Dust with icing sugar to serve."
  ],
  "ingredients": [
    "0",
    "Dough:",
    "125g butter",
    "2 cups milk",
    "3 tsp dry yeast granules",
    "3/4 cup sugar",
    "6 cups high-grade flour",
    "1 tsp salt",
    "Filling:",
    "3 cups sweet fruit mince",
    "1 cup chocolate chips",
    "To dust:",
    "icing sugar"
  ],
  "__v": 1
}