{
  "hash": "45c3fb948b25ea939ad9e51680d60d949ce053a1",
  "title": "Palmiers (Made With Blitz Puff Pastry)",
  "image": "https://d2k9njawademcf.cloudfront.net/indeximages/55320/full/2015-0417_how-to-make-palmiers_james-ransom-124.jpg?1432735929",
  "href": "http://food52.com/recipes/36116-palmiers-made-with-blitz-puff-pastry",
  "extension": "Chrome",
  "firstAdded": "2015-06-17T12:38:04.312000",
  "users": [
    null
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "kosher",
    "salt",
    "cold",
    "unsalted",
    "butter",
    "cubes",
    "cool",
    "water",
    "vanilla",
    "sugar",
    "needed",
    "coating",
    "headnote",
    "link"
  ],
  "directions": [
    "0",
    "In a large bowl, whisk the flour and salt to combine.",
    "Toss the cubed butter into the flour to coat each piece. After it’s well coated, begin to “cut in” or “rub in” the flour. For this task, shingle the butter between the palms of your hands or using your fingers. The idea is to flatten the butter into big shards. Continue to toss the butter in with the flour as you work, recoating the shingled pieces of butter throughout mixing. The action is done when the majority of the pieces of butter are the size of walnut halves.",
    "Make a well in the center of the flour mixture, and add the water. Mix until the dough comes together—it should be cohesive but not sticky or overly wet.",
    "Transfer the dough to a parchment-lined baking sheet and form it into a rectangle about 6 by 4 inches (roughly one-third the size of a baking sheet). The size doesn’t need to be precise, just aim for making a rectangle with sharp edges and corners. Cover the dough with plastic wrap and transfer to the refrigerator for 20 to 30 minutes, until the dough is chilled but still pliable (not too firm).",
    "On a lightly floured surface, roll out the dough into a rectangle about 3/4-inch thick (about 10 by 25 inches). The thickness and shape of the rectangle is more important than the dimensions themselves. Complete a four-fold by folding the outside edges inward, having them meet slightly off center. The result will look a little like an open book with an off-center spine. (In other words: Fold the edge on the left toward the center, about three-quarters of the way across the dough. Fold the edge on the right one-quarter of the way across the dough. Make sure the edges meet.) Now fold the larger half over the shorter half, hiding the seam, and transfer the dough back to the parchment-lined baking sheet and cover directly with plastic wrap. Refrigerate for 20 to 30 minutes before starting the second fold.",
    "Remove the dough from the refrigerator and, on a lightly floured surface, roll out into the 3/4-inch thick, approximately 10- by 25-inch rectangle again. You'll now do a three-fold (which looks like folding a business letter): Fold the left hand edge of the dough one-third of the way over the dough. Fold the right hand edge one-third of the way over the dough as well, resting it on the piece you just folded over. Return the dough to the baking sheet, cover directly with plastic wrap, and refrigerate for 20 to 30 minutes.",
    "Repeat step 5 and complete a second four-fold. Wrap and refrigerate the dough for 20 to 30 more minutes.",
    "Repeat step 6 and complete a second three-fold (you'll have done 4 folds total: 2 four folds and 2 three folds). If the dough is still chilled after this fold, you can proceed with shaping the palmiers. If the dough feels slightly warm, wrap and refrigerate again for 20 to 30 minutes.",
    "To shape the palmiers, divide the dough in half using a bench knife or a sharp chef’s knife. Roll out the dough on a lightly floured surface to 1/2-inch thick. Try to maintain the rectangular shape while you roll and aim for a finished size of around 13 by 15 inches. If the dough’s edges are rough, you can trim them away to make clean edges.",
    "Preheat the oven to 425° F. Sprinkle a few tablespoons of vanilla sugar over the dough and use your rolling pin to gently press the sugar into the dough. Fold the edges from the longer side inward, meeting each other exactly in the center of the dough. Fold one half over onto the other half. The resulting shape looks a bit like a heart and is also often referred to as an “elephant ear.”",
    "Use a sharp knife to slice the log of dough into individual pieces about 1/2-inch thick. Dip both sides into the vanilla sugar and transfer to a parchment-lined baking sheet. At this point, you can freeze the palmiers for baking later (you might have to bake the cookies for an extra 5 minutes).",
    "Bake the palmiers 20 to 25 minutes, until the dough is very golden brown and the sugar is deeply caramelized. Cool completely before serving."
  ],
  "ingredients": [
    "0",
    "1 pound (3 1/3 cups) all-purpose flour",
    "1 1/4 teaspoons (10 grams) kosher salt",
    "1 pound cold unsalted butter, cut into 1/2-inch cubes",
    "9 fluid ounces (1 cup plus 2 tablespoons) cool water",
    "Vanilla sugar, as needed for coating (see headnote for link)"
  ],
  "__v": 1
}