{
  "hash": "b038f114c4b0f93301994b648fa43724e387b580",
  "title": "Pork Loin with Cognac Sauce",
  "image": "http://www.tartineandapronstrings.com/wp-content/uploads/2015/02/pork-loin-cognac-h-DSCF2452-296x197.jpg",
  "href": "http://www.tartineandapronstrings.com/2015/02/19/pork-loin-in-cognac-sauce/",
  "extension": "Chrome",
  "firstAdded": "2015-11-28T03:02:49.063000",
  "users": [
    null
  ],
  "keywords": [
    "centre",
    "pork",
    "loin",
    "roast",
    "kosher",
    "salt",
    "cracked",
    "black",
    "pepper",
    "olive",
    "oil",
    "garlic",
    "sage",
    "leaves",
    "rosemary",
    "cognac",
    "chicken",
    "broth",
    "water",
    "needed",
    "unsalted",
    "butter",
    "cream",
    "fat",
    "slurry",
    "cornstarch",
    "stirred"
  ],
  "directions": [
    "0",
    "Remove pork from the refrigerator, season the outside with kosher salt and freshly cracked black pepper. Let sit at room temperature at least 1 hour before cooking.",
    "Heat the olive oil in a large Dutch oven pot or pan over medium-high heat. Sauté the garlic, sage, and rosemary until fragrant, about 1 minute.",
    "Add the pork loin to the pan and sear each side until all sides are browned. Remove pork loin to a plate. Strain the bits of browned herbs and add about 1-2 tablespoonfuls of the strained oil back into the pot.",
    "Add 1 cup of Cognac to the pan to deglaze, scraping off the bottom with a wooden spoon. Cook until the alcohol has evaporated, about 1 to 2 minutes.",
    "Lower the heat of the pot or pan to medium-low and add the whole pork loin back in, then pour ½ the chicken broth or water in. Cover with a lid and simmer for about 45 minutes to 1 hour, or until an internal temperature of 160 F (71 C) is reached. About halfway point, around the 20-minute mark, lift the lid and continue cooking with a partially covered the pot.",
    "Check the pot every 5 to 10 minutes to make sure the liquid has not dried out. Ideally, you want to always have at least about 1 cup of liquid in the pot. Add the rest of the broth or water, if needed. Keep adding liquid, as required.",
    "When the pork is cooked through, remove to a plate and let it rest for 15-30 minutes. Add 1 tablespoon of Cognac to deglaze, stirring about 1 to 2 minutes until the smell of alcohol is gone. Mix in the butter and continue stirring.",
    "Lower the heat again to the lowest setting and slowly add the cream. Stir gently until combined. Avoid boiling, as this will result in a separated sauce.",
    "To thicken the sauce, add a cornstarch slurry, which is composed of 2 tablespoons of cornstarch mixed with 2 tablespoons of water. Add more slurry as needed. The sauce should be silky - not too thick but not too watery. In the end, you may have some extra sauce that you can use for other dishes.",
    "Slice the resting pork loin then transfer back into the sauce before serving."
  ],
  "ingredients": [
    "0",
    "1.5 - 2 pounds centre pork loin roast",
    "kosher salt and freshly cracked black pepper",
    "¼ cup olive oil",
    "6 cloves garlic, peeled and crushed",
    "4 tablespoons sage leaves, chopped",
    "2 tablespoons rosemary leaves, chopped",
    "1 cup Cognac + 1 tablespoon",
    "1 to 1-1/2 cups chicken broth or water (plus more if needed)",
    "2 tablespoons unsalted butter",
    "½ cup heavy cream (35% fat)",
    "cornstarch slurry (2 Tbsp cornstarch stirred with 2 Tbsp water) - optional"
  ],
  "__v": 1
}