{
  "hash": "32a2ff7d7b1fd3ea48766cd1f39f43d09b1c99ce",
  "title": "Smoky, Spicy Vegetarian Pasta with Eggs and Mushrooms",
  "image": "https://images.food52.com/HMICeuI8i0f5746dX5RzxLoNihk=/753x502/6fb3d417-96ea-4ea4-84b2-6c0f086c92c3--2017-0919_smoky-vegetarian-spaghetti-with-mushrooms_instagram_bobbi-lin_3197_1-.jpg",
  "href": "https://food52.com/recipes/73146-smoky-spicy-vegetarian-pasta-with-eggs-and-mushrooms",
  "extension": "Chrome",
  "firstAdded": "2018-01-05T12:51:24.248000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Bring a large pot of water to a boil. Salt generously, then cook the pasta to al dente (a couple of minutes less than specified in the recipe instructions).",
    "Meanwhile, heat the olive oil and chile flakes in a medium skillet over medium-high heat. Add the mushrooms, then sauté until the mushrooms are cooked through and starting to crisp, 3 to 5 minutes. Add the garlic and stir until toasted and fragrant, 1 minute more. Set aside.",
    "Now whisk the egg, yolks, cheese, and a generous amount of salt and pepper in a large bowl that can fit over the pot you're using to boil the pasta.",
    "When the pasta is nearly done, reserve 1 cup of the pasta cooking water in a liquid measuring glass. Use about 3 tablespoons (a bit less than 1/4 cup) to temper the egg mixture—pour it slowly into the eggs while you constantly whisk. This should also begin to melt the cheese. Then use tongs to transfer the pasta to the bowl (but don't drain the water from the pot). Set the bowl back over the pot of boiling water—like a double boiler!—and use tongs to coat the pasta in the egg-cheese mixture, until eggs thicken and leave a trail in their wake. Add a bit more pasta water by the tablespoon if you need to. The cheese will stay a bit clumpy—don't worry. Add the mushrooms and their oil and toss to combine.",
    "Serve immediately, topped with Parmesan cheese. Season with additional salt and pepper."
  ],
  "ingredients": [
    "0",
    "8 ounces spaghetti",
    "2 ounces (1 small handful) wild mushrooms, preferably black trumpet, cleaned with woody stems removed",
    "1 large egg + 2 large egg yolks",
    "Salt and pepper",
    "1/2 cup (4 1/2 ounces) finely grated smoked mozzarella",
    "2 tablespoons olive oil",
    "1/4 teaspoon crushed red chile flakes",
    "1 garlic clove, smashed and roughly chopped",
    "Grated Parmesan, for serving"
  ],
  "__v": 1
}