{
  "hash": "d592b5df0a050496c740e2f45565279b8759371e",
  "title": "Lemon Bars",
  "image": "",
  "href": "https://www.bonappetit.com/recipe/lemon-bars",
  "extension": "Chrome",
  "firstAdded": "2020-01-29T03:37:38.247000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "RECIPE PREPARATION",
    "Crust",
    "Preheat oven to 350°. Using an electric mixer on low speed, beat butter, sugar, and salt in a medium bowl until butter is almost completely smooth, about 2 minutes. Increase speed to medium and beat until butter is creamy, about 2 minutes more. Mix in egg yolk and vanilla. Reduce speed to low, add flour and poppy seeds, if using, and mix until no dry spots remain.",
    "Firmly press dough into an 8x8\" baking dish, working about ½\" up the sides (the firmer you press, the easier it will be to cut the baked crust). Bake until golden brown on bottom and a shade or two darker at the edges, 25−35 minutes. Let cool completely if making unbaked lemon bars. If you are baking lemon bars, start the curd just before the crust is finished baking so that both are warm when you assemble.",
    "Filling and Assembly",
    "Combine lemon juice, salt, and ¼ cup sugar in a small saucepan. Scrape in seeds from vanilla bean and add pod. Bring to a simmer over medium heat, stirring to dissolve sugar.",
    "Whisk egg yolks, egg, and remaining ½ cup sugar in a medium bowl until no longer grainy and slightly lightened in color, about 2 minutes.",
    "Whisking constantly, gradually stream hot lemon mixture into eggs, then transfer mixture back to saucepan. Cook over medium heat, whisking constantly, until thickened and marks from whisk are just visible, 5–7 minutes. Remove from heat and whisk in butter until smooth, adding a couple of pieces at a time and whisking until incorporated before adding more.",
    "For unbaked lemon bars, strain warm curd through a fine-mesh sieve into a medium nonreactive bowl. Cover with plastic wrap, pressing directly against surface. Chill until cold, about 1 hour. Stir curd to loosen and scrape into cooled crust; smooth top. Chill until curd has re-set, at least 1 hour.",
    "Just before serving, cut lemon bars into squares and dust with powdered sugar.",
    "For baked lemon bars, reduce oven temperature to 300˚. Strain warm curd through a fine-mesh sieve into warm crust and bake until curd is set around the edges (filling should still wobble when dish is jiggled; it will set completely as it cools), 12−15 minutes. Do not overbake or filling may curdle. Transfer to a wire rack and let cool, about 2 hours, then chill until cold, at least 1 hour.",
    "Just before serving, cut lemon bars into squares and dust with powdered sugar.",
    "Do ahead: Lemon bars (without powdered sugar) can be made 1 day ahead. Cover and keep chilled."
  ],
  "ingredients": [
    "0",
    "Crust",
    "6 tablespoons chilled unsalted butter, cut into pieces",
    "3 tablespoons granulated sugar",
    "½ teaspoon kosher salt",
    "1 large egg yolk",
    "½ teaspoon vanilla extract",
    "1 cup all-purpose flour",
    "1 teaspoon poppy seeds (optional)",
    "Filling and assembly",
    "⅔ cup fresh lemon juice",
    "½ teaspoon kosher salt",
    "¾ cup granulated sugar, divided",
    "1 vanilla bean, split lengthwise",
    "3 large egg yolks",
    "1 large egg",
    "½ cup (1 stick) chilled unsalted butter, cut into pieces",
    "Powdered sugar (for serving)"
  ],
  "__v": 1
}