{
  "hash": "6e08f81623ee8c80713e82ce03ae5a9b99c80d2f",
  "title": "Creamy Beet Risotto\nwith Orange-Arugula Salad",
  "image": "https://images.purplecarrot.com/uploads/recipe/image/451/_1400_700_fba4_b429_d2ddc936_Vegan_BeetRisotto_Hero-67c13d7817dc212ccf26c43e59629f07.jpg",
  "href": "https://www.purplecarrot.com/plant-based-recipes/creamy-beet-risotto-with-orange-arugula-salad",
  "extension": "Chrome",
  "firstAdded": "2018-07-12T17:47:26.759000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "1 Prep your beets",
    "Preheat oven to 400 °F. Peel and chop the beets. Put beets on a baking sheet. Rinse, dry, and pick 1 tsp of the thyme leaves. Toss beets in 1 tsp oil, thyme, a good pinch of salt and pepper. Roast until beets are tender, about 18 to 22 minutes.",
    "2 Play farro",
    "Peel and mince shallot. Mince garlic. Heat 1 tbsp oil in a saucepan over medium heat. Add shallot and pinch salt, and cook until softened, about 1 minute. Stir in garlic and cook until fragrant, 30 seconds. Stir in farro, cook until lightly toasted, about 2 minutes. Stir in vegetable powder and 2 cups water. Bring to a simmer and cook until most of the liquid has been absorbed, 15 to 20 minutes.",
    "3 Stir it up",
    "When the beets are roasted, stir them into the almost-cooked farro until it turns a deep purple, about 1 minute. Continue to simmer until farro is tender, stirring often, about 5 minutes. Remove from the heat and add the vegan parmesan and vegan butter. Season with salt and pepper to taste.",
    "4 Get dressed",
    "Zest 1 tbsp of the orange and put it in a medium bowl. Peel the orange by cutting off both ends and then using a knife to cut away the peel and pith (the bitter, white spongy layer between peel and fruit). Supreme the orange by cutting the segments away from the membrane, over the bowl with the zest, to catch any juice.",
    "5 Time for salad",
    "Rinse and dry the arugula and add it to the medium bowl with the orange zest and slices. Toss with 1 tsp of olive oil and a pinch of salt and pepper.",
    "6 You got served",
    "Put a scoop of the beet-farro risotto in a shallow bowl and garnish with a sprig of thyme (one of the smaller, more tender stems). Serve with the arugula-orange salad and enjoy!",
    "SIMILAR RECIPES"
  ],
  "ingredients": [
    "0",
    "10 oz beets",
    "Fresh thyme",
    "1 shallot",
    "Garlic",
    "3/4 cup farro",
    "2 tbsp vegetable powder",
    "1/4 cup vegan parmesan cheese",
    "1 tbsp vegan butter",
    "1 orange",
    "2 oz arugula",
    "Salt and pepper*",
    "1 tbsp plus 2 tsp olive oil*",
    "*Not included"
  ],
  "__v": 1
}