{
  "hash": "8c9a901385d1f883bec8cb576c93bf7dfc414eed",
  "title": "Low Calorie Sesame Chicken Stir Fry",
  "image": "https://www.favfamilyrecipes.com/wp-content/uploads/2014/08/Low-Calorie-Sesame-Chicken-Stir-Fry-267x400.jpg",
  "href": "https://www.favfamilyrecipes.com/sesame-chicken-stir-fry/",
  "extension": "Chrome",
  "firstAdded": "2018-02-07T14:22:10.928000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Cook noodles according to package directions.",
    "While noodles are cooking, combine sauce ingredients (sugar, soy sauce, pineapple juice, vinegar, garlic, ginger, and red pepper flakes) in a saucepan and heat gently over medium heat.",
    "When sauce is smooth and sugar has dissolved, SLOWLY add cornstarch mixture a little at a time (you may not need ALL of it) and stir constantly until sauce has thickened to desired thickness. Set aside",
    "In a large skillet, heat 1 Tbsp. coconut oil over medium heat. Add vegetables and stir-fry until they become hot and crisp-tender. Remove from skillet and set aisde (cover with aluminum foil to keep hot).",
    "In the same skillet, add 1 Tbsp. coconut oil. Add chicken and stir fry until chicken becomes white on all sides (doesn't need to be completely cooked through), drain any excess water.",
    "Add sauce to the skillet with the chicken and stir to coat. Simmer on low heat for about 5-7 minutes or until chicken is cooked through, stirring often. Sprinkle chicken with sesame seeds.",
    "Drain noodles and serve on individual plates. Top with vegetables and chicken/sauce mixture."
  ],
  "ingredients": [
    "0",
    "Ingredients (with Amazon Links)",
    "1 12oz pkg. thin spaghetti noodles (Ronzoni Smart Taste)",
    "1/2 c. sugar",
    "1/2 c. \"lite\" soy sauce",
    "1/2 c. unsweetened pineapple juice",
    "1/2 c. white distilled vinegar",
    "3 cloves garlic crushed",
    "2 tsp. fresh ginger finely grated",
    "crushed red pepper flakes to taste",
    "2 Tbsp. cornstarch mixed with 1/4 c. water",
    "1 Tbsp. coconut oil",
    "1 2 Lb. pkg. frozen stir-fry vegetables (or a mixture of fresh stir-fry vegetables)",
    "1 Tbsp. coconut oil",
    "2 Lbs. chicken breast sliced diagonally into thin strips",
    "2 Tbsp. sesame seeds or to taste"
  ],
  "__v": 1
}