{
  "hash": "05e1c80c10ef895a5938325fdd5e46a947478846",
  "title": "Make-Ahead Chili & Cheese Lasagna",
  "image": "//assets.myfoodandfamily.com/adaptivemedia/rendition/133281.jpg?id=1ddd94b3c22d330b20e08ceca596c6641698c967&ht=650&wd=1004&clid=pim",
  "href": "https://www.myfoodandfamily.com/recipe/133281/make-ahead-chili-cheese-lasagna?utm_source=Facebook&utm_medium=Social&utm_campaign=Owned&utm_content=43556",
  "extension": "Firefox",
  "firstAdded": "2019-04-08T20:56:37.800000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Let's Make It",
    "Brown meat with garlic in large skillet. Add next 7 ingredients; stir. Simmer 5 min., stirring occasionally.",
    "Spread 2 cups meat sauce onto bottom of 13x9-inch baking dish sprayed with cooking spray; cover with layers of 3 noodles, 1/2 cup each cottage cheese and shredded cheese, and 2 cups of the remaining meat sauce. Repeat layers twice. Top with remaining shredded cheese. Cool. Wrap tightly in foil. Freeze up to 2 months. Refrigerate overnight to thaw.",
    "Heat oven to 375°F. Unwrap lasagna, leaving just top covered with foil. Bake 1 hour 10 min. or until heated through, uncovering after 1 hour. Let stand 10 min. before cutting to serve.",
    "Kitchen Tips",
    "Tip 1",
    "Healthy Living",
    "Save 40 calories and 4g of total fat, including 2g of sat fat, per serving by preparing with extra-lean ground beef and 1 pkg. (7 oz.) KRAFT Mexican Style 2% Milk Finely Shredded Four Cheese, adding 1/3 cup, instead of the suggested 1/2 cup, shredded cheese to each layer.",
    "Tip 2",
    "Serving Suggestion",
    "Serve with a mixed green salad tossed with your favorite KRAFT Lite Dressing.",
    "Tip 3",
    "Note",
    "If you only have 1 (13x9-inch) baking dish and want to free it up for other uses, line the empty dish with foil, with ends of foil extending over sides. Assemble lasagna in prepared dish; cover with additional foil. Freeze until firm. Use foil handles to lift lasagna from dish; rewrap. Freeze up to 2 months. When ready to serve, unwrap lasagna and place in 13x9-inch baking dish sprayed with cooking spray; cover with foil. Thaw overnight in refrigerator, then bake as directed."
  ],
  "ingredients": [
    "0",
    "What You Need",
    "Select All",
    "1 lb. lean ground beef",
    "2 cloves garlic, minced",
    "1 jar (24 oz.) OLIVO by CLASSICO Traditional Pasta Sauce",
    "3/4 cup TACO BELL® Thick & Chunky Salsa",
    "1/4 cup water",
    "1 can (15.5 oz.) black beans, rinsed",
    "1 green pepper, finely chopped",
    "1 Tbsp. chili powder",
    "2 tsp. ground cumin",
    "9 lasagna noodles, cooked",
    "1-1/2 cups BREAKSTONE'S or KNUDSEN 2% Milkfat Low Fat Cottage Cheese",
    "1 pkg. (8 oz.) KRAFT Mexican Style Shredded Four Cheese with a TOUCH OF PHILADELPHIA"
  ],
  "__v": 1
}