{
  "hash": "644be8b911a556628a67a3c2a4af8a6669ea3bd9",
  "title": "Lepinja (Balkan Flatbread)",
  "image": "https://www.curiouscuisiniere.com/wp-content/uploads/2016/08/Lepinja-with-Ajvar-7178.21.jpg",
  "href": "https://www.curiouscuisiniere.com/lepinja/",
  "extension": "Chrome",
  "firstAdded": "2019-01-02T23:44:32.542000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Place the warm milk in a large bowl. Sprinkle the yeast over the milk and let it stand until softened and foamy, 5 min.",
    "Add the water and sugar to the milk and yeast. Mix to combine.",
    "Add the flour and salt, mixing until a soft dough comes together. Turn the dough out on a lightly floured surface and knead for 5-7 minutes by hand (or 2-3 minutes in a stand mixer fitted with a dough hook), until the dough is smooth but still slightly sticky.",
    "Shape the dough into a ball and place it into a clean bowl. Cover the bowl with a damp tea towel and let the dough rise in a warm and draft-free place until doubled, roughly 1 hour.",
    "Once the dough has risen, punch it down. Re-cover it with the damp tea towel and let rise a second time, until doubled, roughly 1 hour.",
    "Punch down the dough a second time and divide it into 6 portions. Shape each portion into a ball. Place the balls onto a lightly floured surface, cover them with the damp tea towel, and let them rest for 5-10 minutes.",
    "After resting, flatten the balls into discs that are ½ inch thick. Place the flattened rounds on to a floured baking sheet. Cover them with the damp tea towel and let them rise for 20 minutes.",
    "While the bread is rising this final time, preheat your oven to 450⁰F.",
    "Once risen, uncover the dough, place the baking sheet into oven, and bake for 5-7 minutes, until the breads are just starting to turn golden.",
    "Lower the heat to 300⁰F and bake for another 7-10 minutes, until evenly golden.",
    "Remove the lepinja from oven and wrap them in a (dry) tea towel for 10 minutes to soften the crust.",
    "Slice the lepinja open to serve, if desired. Serve warm.",
    "The bread will keep on the counter for 2-3 days."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 Tbsp milk, warmed to 80-90⁰F",
    "2 ¼ tsp active dry yeast (1 package)",
    "1 c water",
    "1 tsp sugar",
    "3 c unbleached all purpose flour",
    "1 tsp salt"
  ],
  "__v": 1
}