{
  "hash": "4c27189b7d1d9ec29c1561de25246890e527fa71",
  "title": "Nutella Espresso Pancakes\nserves 2 (yields about 6 medium pancakes)",
  "image": "http://farm3.staticflickr.com/2864/9922936514_422b5692eb_b.jpg",
  "href": "http://tworedbowls.com/2013/09/25/nutella-espresso-pancakes/",
  "extension": "Chrome",
  "firstAdded": "2015-04-24T18:11:20.988000",
  "users": [
    null
  ],
  "keywords": [
    "flour",
    "sugar",
    "baking",
    "soda",
    "salt",
    "instant",
    "espresso",
    "coffee",
    "work",
    "egg",
    "use",
    "buttermilk",
    "yogurt",
    "milk",
    "butter",
    "cooled",
    "pan",
    "vanilla",
    "nutella",
    "drizzle",
    "chocolate",
    "chips",
    "sprinkling"
  ],
  "directions": [
    "0",
    "In a medium bowl, sift together the flour, sugar, baking powder, baking soda, and salt. If using instant espresso powder, sift it into the dry ingredients as well.",
    "In a separate large bowl, beat the egg. Add milk (or buttermilk, or yogurt+milk, whatever you’re using), melted butter, vanilla, and Nutella. If using liquid espresso or coffee, add that here as well, and mix until well-blended. Note: I used a 1/2 cup of Greek yogurt and a 1/2 cup of milk as a buttermilk substitute, but I felt that the other flavors in these pancakes were so strong that the buttermilk might not be necessary.",
    "Fold the dry ingredients into the wet until just incorporated. A few lumps are good. Let batter set for a few minutes.",
    "Heat a griddle or pan over medium heat. Coat griddle surface with oil or butter. When the griddle is hot enough that water droplets dance when dropped onto it, pour two to three tablespoons of batter onto the griddle. I used a 1/4 cup scoop, which works well and also keeps the counter fairly drip-free. Sprinkle a few chocolate chips evenly over the uncooked surface of the pancake. When bubbles form in the batter and leave a brief hole when they pop, flip the pancake and let brown on the other side for about 2-3 more minutes, then remove to a plate. I keep the pancakes that are done in the oven at 200 degrees, on an oven-safe plate. Repeat until batter is gone, then serve with your choice of topping. (I used more Nutella. Like there was ever a real choice.)"
  ],
  "ingredients": [
    "0",
    "1 cup flour",
    "1 tbsp sugar",
    "1 tsp baking powder",
    "1/2 tsp baking soda",
    "1/2 tsp salt",
    "1-2 tbsp espresso, or 1 tbsp instant espresso powder (coffee will work too)",
    "1 large egg",
    "1 cup milk (you can use buttermilk if you like, or 1/2 cup yogurt and 1/2 cup milk)",
    "2 tbsp butter, melted and cooled, plus more for the pan",
    "1/4 tsp vanilla extract (optional)",
    "1 tbsp Nutella, plus more for drizzle",
    "1/4 cup chocolate chips for sprinkling on top"
  ],
  "__v": 1
}