{
  "hash": "c5d50871d22f1ac39079ed699c060b728aafe980",
  "title": "Seafood Doria",
  "image": "",
  "href": "http://www.justonecookbook.com/seafood-doria/",
  "extension": "Chrome",
  "firstAdded": "2016-10-29T17:17:23.036000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Butter the gratin dishes.",
    "Using the tip of a sharp knife or hands, cut off the smaller stalks of broccoli from the larger central stalk to remove whole florets, rotating the head of broccoli as you go.",
    "In a small saucepan, bring water to a rapid boil. Add a big pinch of salt. Add the broccoli florets and cook until crisp-tender, 1 to 1½ minutes. Remove with a fine mesh and plunge immediately in the ice water to stop cooking. Drain and set aside.",
    "1",
    "Chop the onion finely and cut the mushrooms into thin slices.",
    "In a large frying pan, heat 1 ½ Tbsp. butter over medium heat. Add the onion and sauté until tender.",
    "Add the mushrooms and sauté till tender. Then add the steamed rice, break the big chunks of rice and combine well.",
    "Season with kosher salt and freshly ground black pepper. Divide the rice into 4 portions and transfer to the individual gratin dishes. Cover with aluminum foil and keep warm.",
    "2",
    "Clean clams and scallops. Peel and devein shrimp if necessary. Cut the squid body into rings. Also cut the garlic cloves into thin slices.",
    "In a large frying pan, heat 2 Tbsp. olive oil and cook sliced garlic on medium heat until fragrant. Then add all the seafood into the pan.",
    "Stir fry to coat the seafood with oil. Add ½ cup white wine and cover with a lid. Cook covered until all the clams open up.",
    "Once all the clam shells are open (dispose of any unopened ones), season with freshly ground black pepper. Then remove all the seafood to a plate/bowl and cover with aluminum foil, set aside.",
    "Reduce the remaining seafood sauce in the frying pan until the sauce is reduced in half, roughly ¼ cup. Keep the sauce in a bowl or measuring cup.",
    "3",
    "In a large frying, heat 4 Tbsp. unsalted butter on medium low heat. Once melted, add 4 Tbsp. all-purpose flour to the pan.",
    "Blend the flour with butter until no more lumps. Keep stirring to avoid burning the roux.",
    "Gradually add warm milk and combine well, scraping the bottom of the pan.",
    "Once blended well, season with kosher salt. Add ¼ cup reserved seafood sauce and keep stirring to combine with the béchamel sauce.",
    "Add 1 tsp. soy sauce and mix well to combine. Keep stirring and cook on low heat until the desired consistency.",
    "4",
    "When the sauce consistency thickens and you can draw a line on the bottom of the pan, add the seafood.",
    "Mix well and add the blanched broccoli.",
    "Pour the seafood mix and béchamel sauce on the butter rice in gratin dishes. Make sure each one gets all the different ingredients.",
    "Sprinkle with freshly grated Gruyere cheese and panko bread crumbs for crispy texture.",
    "Set the oven setting to broil (high) and preheat for 5 minutes. Broil for 2-3 minutes until the cheese has melted and turns golden color on top. Garnish with parsley and serve warm."
  ],
  "ingredients": [
    "0",
    "½ Tbsp. (7 g) unsalted butter for greasing gratin dishes",
    "1 small head broccoli",
    "A big pinch of kosher salt for blanching",
    "A small block Gruyere cheese for topping",
    "2 Tbsp. panko for topping",
    "Italian parsley for garnish",
    "1",
    "½ large onion",
    "4 cremini or button mushrooms",
    "1 ½ Tbsp. (21 g) unsalted butter (if you use salted, reduce adding salt while cooking)",
    "4 large bowls of steamed rice (1.8 lb, 800 g)",
    "A pinch of kosher salt",
    "Freshly ground black pepper",
    "2",
    "16 manila clams",
    "24 baby scallops",
    "12 large shrimps",
    "4 small calamari",
    "2 garlic cloves",
    "2 Tbsp. olive oil",
    "½ cup (120 ml) white wine",
    "3",
    "4 Tbsp. (57 g) unsalted butter",
    "4 Tbsp. (30 g) all-purpose flour",
    "2 cups (480 ml) warm milk",
    "¼ cup (60 ml) reserved seafood sauce (see in recipe)",
    "Freshly ground black pepper",
    "1 tsp. soy sauce"
  ],
  "__v": 1
}