{
  "hash": "62f0241df1d946d6160a775624ea0661569de2ac",
  "title": "Skinny Pumpkin Cheesecake Brownies",
  "image": "https://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2012/09/Skinny-Pumpkin-Brownies-3.jpg",
  "href": "https://sallysbakingaddiction.com/2012/09/20/skinny-pumpkin-cheesecake-brownies/",
  "extension": "Chrome",
  "firstAdded": "2018-09-16T22:15:43.742000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350°F (177°C). Spray an 8-inch square baking pan with non-stick cooking spray or line with parchment. Set aside.",
    "Grind the oats in your food processor to produce a powdery flour. If you are not gluten intolerant, you may just use 1/2 cup of whole wheat flour instead of oat flour.",
    "Add the oat flour and the rest of the brownie ingredients into a blender (yes, a blender!). For easier blending, place the liquid ingredients into the blender first. Blend until mixture is smooth and oats are ground up. You will have to stop the blender and scrape down the sides a few times. Batter will be very thin. *If you like very sweet brownies, add a couple more Tablespoons of maple syrup to the batter.",
    "Pour batter into prepared baking dish. Prepare the pumpkin swirl by beating together pumpkin puree and cream cheese together on high speed until smooth. Add the sugar, egg yolk and all of the spices. Beat until combined and creamy. Drop pumpkin mixture by spoonfuls onto the batter, swirling gently with a knife to create a marbled effect. (Try not to overmix!)",
    "Bake for 22-25 minutes or until brownies begin to pull away from the sides of the pan. I covered my brownies loosely with aluminum foil at the 15 minute mark. Brownies will be extra fudgy, so be sure to wait until COMPLETELY cooled – I stuck mine in the refrigerator for 1 hour, which allowed them to be cut very easily.",
    "Cut into 12 squares. I enjoy mine cold and suggest storing in the refrigerator.",
    "Make ahead tip: Brownies can be frozen up to 2-3 months. Thaw overnight in the refrigerator before enjoying."
  ],
  "ingredients": [
    "0",
    "Brownies",
    "1/2 cup old-fashioned rolled oats (I used certified GF)",
    "3/4 cup vanilla 0% Greek yogurt (or regular yogurt, low fat or nonfat, plain or vanilla)",
    "1/4 cup milk (almond milk, coconut milk, cow milk, soy milk)",
    "2 egg whites - save 1 yolk for cheesecake swirl",
    "2 teaspoons vanilla extract",
    "1/4 teaspoon salt",
    "1 teaspoon baking powder",
    "1/2 cup pure maple syrup (or agave or honey)",
    "1/2 cup unsweetened cocoa powder",
    "Pumpkin Cheesecake Swirl",
    "1/4 cup pure pumpkin puree",
    "2 Tablespoons reduced fat cream cheese, softened",
    "2 Tablespoons granulated sugar",
    "1 egg yolk",
    "1 teaspoon ground cinnamon",
    "1/4 teaspoon ground nutmeg",
    "1/4 teaspoon ground cloves"
  ],
  "__v": 1
}