{
  "hash": "00562b7b41b7af0b34b37e5b61f9901ee64edf75",
  "title": "Summer Vegetable Lasagna...Just Add Sausage!",
  "image": "http://images.parents.mdpcdn.com/sites/parents.com/files/styles/width_360/public/recipe/images/RU281492.jpg",
  "href": "http://www.parents.com/recipe/summer-vegetable-lasagna-just-add-sausage/",
  "extension": "Chrome",
  "firstAdded": "2016-07-01T05:09:08.718000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 375 degrees F. Preheat grill to medium. Brush the sweet peppers, zucchini, and eggplant with oil and season with salt and pepper, to taste. Grill the vegetables for 2 to 3 minutes per side or until they are grill marked and tender. Grill the sausage for 15 to 20 minutes or until done (165 degrees F). When cool enough to handle, coarsely chop the vegetables and sausage.",
    "In a medium bowl, combine the chopped vegetables and pasta sauce. Transfer 3 cups into another bowl and set aside. Add the sausage to the remaining pasta sauce mixture.",
    "In a medium bowl, combine the ricotta, 3/4 cup Parmesan cheese, eggs, and pepper, to taste.",
    "Coat an 8-inch square baking pan with cooking spray. Layer 2 lasagna noodles, 1/2 cup ricotta mixture, and 1 cup vegetarian sauce mixture. Repeat layers 2 more times. Sprinkle on 1 cup mozzarella cheese and 2 Tbs. Parmesan cheese. Repeat the process in a second baking pan using the meat sauce mixture.",
    "Cover the pans with foil. Bake, covered, for 25 minutes. Uncover and bake for 25 minutes more until bubbly and lightly browned on top. Let stand for 10 minutes before serving."
  ],
  "ingredients": [
    "0",
    "2 red, orange, or yellow sweet peppers, halved and seeded",
    "1 zucchini, bias-sliced 1/4-inch thick",
    "2 tablespoons olive oil",
    "1/4 teaspoon salt",
    "Freshly ground black pepper",
    "2 links uncooked turkey sausage (8 oz.)",
    "1 28 ounce jar pasta sauce",
    "2 cups part-skim ricotta cheese",
    "1 cup shredded Parmesan cheese, divided",
    "2 eggs, lightly beaten",
    "Nonstick cooking spray",
    "1 8 ounce package no-cook lasagna noodles (12 sheets)",
    "2 cups shredded mozzarella cheese"
  ],
  "__v": 1
}