{
  "hash": "ac19750ca876c21accb02d9516bd982d2a313bc7",
  "title": "Honey Whole Wheat Pumpkin Bread",
  "image": "http://cookieandkate.com/images/2011/10/whole-wheat-pumpkin-bread-9-550x821.jpg",
  "href": "http://cookieandkate.com/2011/whole-wheat-pumpkin-bread/",
  "extension": "Chrome",
  "firstAdded": "2016-09-04T11:56:54.059000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 325 degrees Fahrenheit (165 degrees Celsius) and grease a 9x5 inch loaf pan.",
    "In a large bowl, beat oil and honey together. Add eggs, and beat well.",
    "Stir in pumpkin purée and vanilla, then the salt, cinnamon, ginger, nutmeg and allspice. Stir in flour, just until combined. If you’re adding millet, stir that in as well.",
    "Add baking soda to hot water, stir to mix, and then mix briefly into batter until it is evenly distributed. Spread batter into the greased loaf pan.",
    "Sprinkle with cinnamon, and swirl with the tip of a table knife for a pretty marbled effect. Sprinkle a big pinch of turbinado sugar on top for a light, sweet crunch.",
    "Bake for 55 to 65 minutes. Be sure to check that the bread is done baking by inserting a toothpick in the top. It should come out clean. If the top of the bread jiggles when you pull it out of the oven, it’s NOT done! Let the bread cool in the loaf pan for 5 minutes, then transfer it to a wire rack to cool for 30 minutes before slicing."
  ],
  "ingredients": [
    "0",
    "⅓ cup melted coconut oil or extra-virgin olive oil",
    "½ cup honey",
    "2 eggs",
    "1 cup pumpkin purée",
    "1 teaspoon vanilla extract",
    "½ teaspoon salt",
    "½ teaspoon cinnamon, plus more to swirl on top",
    "½ teaspoon ginger",
    "¼ teaspoon nutmeg",
    "¼ teaspoon allspice or cloves",
    "1¾ cups whole wheat pastry flour or regular whole wheat flour",
    "Optional- ⅓ to ½ cup rinsed millet",
    "1 teaspoon baking soda*",
    "¼ cup hot water*",
    "Optional- turbinado (raw) sugar for sprinkling on top"
  ],
  "__v": 1
}