{
  "hash": "d4fb3f69b0d123965dcbbce613d40216badf1d72",
  "title": "5.0 from 8 reviews\nShanghai-Style Red Vegetable Soup",
  "image": "https://thewoksoflife.com/wp-content/uploads/2018/10/shanghai-style-red-vegetable-soup-10.jpg",
  "href": "https://thewoksoflife.com/2018/10/red-vegetable-soup-shanghai-luo-song-tang/",
  "extension": "Chrome",
  "firstAdded": "2019-01-02T23:41:51.486000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Rinse 2 pounds of oxtails and pat them very dry. Heat 2 tablespoons of oil in a thick-bottomed soup pot over medium heat to brown the oxtails.",
    "Brown the oxtails lightly on both sides. While that’s happening, slice 2 large onions, smash 6 cloves of garlic, and add them in once the oxtails are finished browning. Stir well and cook until the onions turn soft.",
    "While the onions are cooking, cut 3 small tomatoes into rough chunks. Add them to the pot when the onions have softened. Clear a space in the center of the pot, and add 2 tablespoons of tomato paste, letting it fry lightly. Stir and cook until the tomatoes are slightly dissolved and the oil in the pot turns reddish––a few minutes over medium heat.",
    "Now add 10 cups water, and turn up the heat to high. Cut the carrots and cabbage, and add them to the pot, along with 5 bay leaves, 2 teaspoons salt, and 1 teaspoon black pepper. Cover and bring to a boil, then reduce the heat to simmer for 60 minutes.",
    "After 60 minutes of simmering, peel and cut the potatoes, and add them to the soup. Bring it to boil, then reduce the heat to simmer for 30 more minutes, or until the potatoes are tender. Salt to taste before serving.",
    "Soups (and stews) always taste better the next day, so don’t fret if you have leftovers. Freeze the soup for another meal, and you will be very happy that you did!"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 pounds oxtails",
    "2 tablespoons vegetable oil",
    "2 large onions",
    "6 cloves of garlic",
    "3 small tomatoes (12 ounces), roughly chopped",
    "2 tablespoons tomato paste",
    "10 cups water",
    "2 large carrots (about 12 ounces), cut into large chunks",
    "¼ cabbage (about 12 ounces), roughly chopped",
    "5 bay leaves",
    "2 teaspoons salt",
    "1 teaspoon ground black pepper",
    "2 large potatoes (about 1 pound), peeled and cut into large chunks"
  ],
  "__v": 1
}