{
  "hash": "299b0379a0e9043d6b2f3c76ae5415731cce5c8f",
  "title": "Barbecue Ribs with Root Beer Barbecue Sauce",
  "image": "http://www.cheatsheet.com/wp-content/uploads/2014/07/iStock_000018367440_Small-640x428.jpg?378ebf",
  "href": "http://www.cheatsheet.com/culture/cooking-with-root-beer-6-recipes-for-bbq-chili-and-more.html/?a=viewall",
  "extension": "Chrome",
  "firstAdded": "2016-06-20T04:15:54.686000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions: Combine 12 cups water with salt, molasses, cloves, cinnamon sticks, and star anise in a large saucepan. Bring to a boil, cook until salt dissolves. Remove, and let cool completely.",
    "Place ribs in a plastic container and cover with brine. Cover, and refrigerate at least 4 hours, or up to 24 hours, turning occasionally.",
    "Remove ribs from brine, rinse, and pat dray. Set onto baking racks over baking sheets. Refrigerate several hours until surface dries.",
    "Heat oil in a medium saucepan set over medium heat. Add onions, and cook until softened. Add ginger and garlic, and cook 1 minute. Add paprika, and cook 1 minute more. Stir in root beer, then simmer until reduced by half. Add ketchup, brown sugar, and molasses. Cook over low heat, just until flavors meld and sauce has reduced, stirring occasionally, about 30 minutes. Add lemon juice, and season with salt and pepper, to taste.",
    "Prepare smoker with soaked chips and set temperature to 225 to 250 degrees Fahrenheit. If using a charcoal grill, set up for direct and indirect heat. Brush ribs lightly with canola oil, and smoke until tender and juicy, about 2 hours. Brush with sauce, and turn occasionally during last 15 minutes of cooking. If using a charcoal grill, finish ribs over hot part of grill. Serve."
  ],
  "ingredients": [
    "0",
    "Ribs",
    "½ cup kosher salt",
    "¼ cup molasses",
    "10 whole cloves",
    "4 cinnamon sticks",
    "3 star anise pods",
    "2 racks St. Louis-style pork ribs, trimmed",
    "Sauce",
    "2 tablespoons canola oil, plus more",
    "1 sweet onion, finely chopped",
    "2 tablespoons finely grated fresh ginger",
    "2 garlic cloves, finely chopped",
    "2 teaspoons smoked paprika",
    "2 cups root beer",
    "2 cups ketchup",
    "Scant ¼ cup packed light brown sugar",
    "2 tablespoons molasses",
    "Juice and zest of 1 lemon",
    "Kosher salt and freshly ground black pepper"
  ],
  "__v": 1
}