{
  "hash": "80078a6c7b26e30ba83db0ec9f64a90fb3f5628e",
  "title": "Green Curry Paste",
  "image": "//images.food52.com/0l7TtcavrCVuwcGo08NzdFfSnoQ=/753x502/7c4d8bcb-3044-47d2-850a-40553874ebae--IMG_8630.jpg",
  "href": "http://food52.com/recipes/26834-green-curry-paste",
  "extension": "Chrome",
  "firstAdded": "2015-09-14T12:36:14.730000",
  "users": [
    null
  ],
  "keywords": [
    "coriander",
    "seeds",
    "cumin",
    "white",
    "peppercorns",
    "green",
    "thai",
    "chiles",
    "serranos",
    "partially",
    "seeded",
    "headnote",
    "shallots",
    "root",
    "bunch",
    "cilantro",
    "leaves",
    "stems",
    "galangal",
    "alternatively",
    "use",
    "ginger",
    "turmeric",
    "stalks",
    "lemongrass",
    "tender",
    "kaffir",
    "lime",
    "zest",
    "limes",
    "heads",
    "garlic",
    "kosher",
    "salt",
    "shrimp"
  ],
  "directions": [
    "0",
    "Important note: Do not handle Thai chiles or large quantities of any hot pepper without wearing gloves. Seeding Thai chiles is not for the faint of heart--they are tiny and incredibly hot. This is why we recommend serranos as an alternative.",
    "Combine the coriander seeds, cumin seeds, and white peppercorns In a small, dry skillet over medium heat. Toast until fragrant and the white peppercorns are beginning to get a little color, about 3 minutes. Set aside to cool.",
    "Combine the cooled, toasted spices along with the remaining ingredients in a blender or food processor. If using a blender, put the lighter ingredients, like cilantro, in first and the heavier ingredients on top. As you purée the ingredients, the shallots and garlic will release a lot of moisture, but the mixture will still be fairly dry. With this in mind, be sure to use your blender's tamper to help blend the ingredients evenly. If using a food processor, scrape down the bowl regularly to ensure a smooth paste.",
    "Blend until homogenous and fairly smooth. If desired, pack the paste into ice cube trays and freeze. Pop out the frozen cubes and store in a zipper-top bag. You may store some of the fresh paste in a container in the refrigerator, but be sure to use it within two weeks.",
    "When you use the curry paste, start with one frozen cube (or about 2 tablespoons fresh paste) for a curry that will generously feed two people. This will make a moderately spicy, deeply flavorful curry. If you like very spicy curries, you may want to use up to two frozen cubes (or about 1/4 cup fresh paste). Start small and work your way up. To get the best flavor from your homemade curry paste, fry it in a couple tablespoons of coconut milk before adding other ingredients."
  ],
  "ingredients": [
    "0",
    "2 tablespoons coriander seeds",
    "1 tablespoon cumin seeds",
    "1 tablespoon white peppercorns",
    "8 ounces green Thai chiles (or serranos), partially seeded (see headnote) and chopped",
    "4 to 5 large shallots (about 3/4 pound), peeled and chopped",
    "3 ounces coriander root (or one bunch of cilantro, both leaves and stems)",
    "1/4 cup peeled and chopped galangal root (alternatively, you may use fresh ginger)",
    "3 tablespoons peeled and chopped fresh turmeric root (do not substitute ground turmeric)",
    "2 stalks lemongrass, tender bottom part only, chopped",
    "3 kaffir lime leaves (or the zest of 3 limes), chopped",
    "2 heads garlic, cloves peeled",
    "1 1/2 teaspoons kosher salt",
    "1 tablespoon shrimp paste (optional)"
  ],
  "__v": 1
}