{
  "hash": "6b4cf0e5d7fcbfd4304ff147f2ab7888445aaf1f",
  "title": "Mocha Cheesecake Brownies",
  "image": "https://sallysbakingaddiction.com/wp-content/uploads/2015/12/mocha-cheesecake-brownies-recipe-4.jpg",
  "href": "https://sallysbakingaddiction.com/2015/12/04/mocha-cheesecake-brownies/",
  "extension": "",
  "firstAdded": "2017-07-14T01:20:54.377000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the brownie batter: Melt the butter and chopped chocolate in a medium saucepan over medium heat, stirring constantly, about 5 minutes. Or melt in a medium microwave safe bowl in 20 second increments, stirring after each, in the microwave. Remove from the heat, pour into a large mixing bowl, and allow to slightly cool for 10 minutes.",
    "Adjust the oven rack to the lower third position and preheat oven to 350°F (177°C). Line the bottom and sides of a 9-inch square baking pan with aluminum foil or parchment, leaving an overhang on all sides to easily lift the brownies out of the pan when cool. Set aside.",
    "Whisk the granulated sugar into the cooled chocolate/butter mixture. Add the eggs, one at a time, whisking until smooth after each addition. Whisk in the vanilla. Gently fold in the flour, cocoa powder, espresso powder, and salt. Set aside.",
    "Make the cheesecake batter: In a large bowl using a hand-held mixer or stand mixer fitted with a paddle or whisk attachment, beat the cream cheese for 1 minute on high speed until completely smooth and creamy. Reduce to medium-high speed and beat in the sugar until combined. Beat in the egg and vanilla extract until combined. Finally, fold in the white chocolate chips with a rubber spatula or wooden spoon. Set aside.",
    "Spread about half of the brownie batter into the prepared baking pan. The batter is thick, so do your best to spread it to every corner making 1 even layer. Top with all of the cheesecake batter. Spread this in a thick, even layer. Layer on the rest of the thick brownie batter, spreading as best you can. If some cheesecake swirls out on top or if you can't quite cover the corners with brownie batter, that's OK! Sprinkle the optional chocolate chips on top.",
    "Bake for 35-38 minutes or until the brownies begin to pull away from the edges of the pan. A toothpick inserted in the center should come out with only a few moist crumbs when the brownies are done. All ovens are different, so keep an eye on them after 30 minutes and use the toothpick test to see when yours are finished.",
    "Allow the brownies to cool in the pan set on a wire rack for 45 minutes. Then cover and refrigerate for at least 2 hours and up to 1 day. The cheesecake layer must be cold before cutting into squares.",
    "Once chilled, lift the foil out of the pan using the overhang on the sides and cut into squares. For neat squares, I use a very sharp knife and wipe it clean with a paper towel after each cut."
  ],
  "ingredients": [
    "0",
    "1/2 cup (115g) unsalted butter",
    "8 ounces (228g) coarsely chopped quality semi-sweet chocolate",
    "3/4 cup (150g) granulated sugar",
    "3 large eggs, at room temperature",
    "1 teaspoon pure vanilla extract",
    "1/2 cup + 2 Tablespoons (80g) all-purpose flour (spoon & leveled)",
    "2 Tablespoons (11g) natural unsweetened or dutch-process cocoa powder",
    "2 teaspoons espresso powder1",
    "1/4 teaspoon salt",
    "optional: 1/2 cup (90g) mini or regular size semi-sweet chocolate chips (for topping)"
  ],
  "__v": 1
}