{
  "hash": "eda76c0e22d86c50a5ca1fece780c3acbc8305c7",
  "title": "Easy Homemade Burrito Bowls",
  "image": "https://iowagirleats-iowagirleats.netdna-ssl.com/wp-content/uploads/2014/08/dada.jpg",
  "href": "https://iowagirleats.com/2014/08/29/easy-homemade-burrito-bowls/",
  "extension": "Chrome",
  "firstAdded": "2018-12-22T04:01:30.780000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "Mix the seasonings together in a small bowl. Mist or brush chicken breasts with extra virgin olive oil then season on both sides with the mix and grill for 3-4 minutes a side over medium-high heat until no longer pink in the center. Let rest for 5 minutes then chop and set aside.",
    "For the Cilantro-Lime Rice: Bring water, oil, and salt to a boil in a saucepan. Rinse rice in a strainer under cold water then add to the boiling water, place a lid on top, turn heat down to medium-low, and then simmer until rice is tender, about 15 minutes. Add lime juice and cilantro then stir to combine and set aside.",
    "Add black beans to a small saucepan with water and 1 Tablespoon seasoning mix. Bring to a boil then reduce heat to low to stay warm.",
    "For the Quick Gacamole: Add all ingredients to a bowl then mash with a potato masher. Taste and adjust garlic salt if necessary.",
    "Scoop cooked Cilantro-Lime Rice into bowls then top with grilled chicken, seasoned beans, cherry tomatoes, sweet corn, shredded cheese, romaine lettuce, and Quick Guacamole. Serve with Tabasco sauce and salsa, if desired.",
    "Note: for the entire recipe you will need 1 lime and 6 Tablespoons chopped cilantro",
    "Each bite of these Easy Homemade Burrito Bowls is like a party in my mouth. Add salsa and a few shakah-shakahs of green Tabasco sauce if you desire before digging in. Me? I simply slather that guacamole goodness all over the bowl before mining for rice clumps and digging in. Enjoy!",
    "previous: cookies & cream no-bake chex bars (gluten-free) next: savoring and sipping savannah, ga!",
    "77 Comments [+]",
    "Leave a Comment",
    "name*",
    "email*",
    "url",
    "message*",
    "Did you make this recipe? Rate it!",
    "0.5",
    "1.5",
    "2.5",
    "3.5",
    "4.5",
    "PRINT RECIPE",
    "You Might Also Like",
    "Gluten-Free Thai Chicken Flatbread Pizza",
    "Crock Pot Ranchero Chicken",
    "Crock Pot Bourbon Chicken Sammies with Crunchy Apple Slaw",
    "“Roasted” Garlic Chicken Skillet",
    "hi, i’m kristin!",
    "I'm a Midwestern wife and Mama of two little boys and a baby girl. After being diagnosed with Celiac Disease in 2013, Iowa Girl Eats is a place I share delicious and approachable gluten-free recipes made with everyday, in-season ingredients. Visit my Recipe Index for inspiration!",
    "MORE ABOUT ME",
    "recipes delivered.",
    "receive a 7 day gluten-free meal plan for subscribing!",
    "BI-WEEKLY DAILY",
    "Popular Posts Today",
    "Recent Posts",
    "Chocolate-Peppermint Puppy Chow (For Humans!)",
    "5 Family-Favorite Gluten-Free Christmas Recipes",
    "Gluten-Free Banana-Nut Mini Muffins (Video)",
    "Gluten-Free Homestyle Beef and Noodles",
    "Gift Guide for 1-4 Year Olds: 10 Toys They’ll Play with for Years!",
    "Iowa Girl Eats is a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to Amazon.com."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "SERVES 4",
    "1lb chicken breasts, pounded to an even thickness",
    "15oz can black beans, drained and rinsed",
    "1/2 cup water",
    "1-1/2 cups cups cherry tomatoes, halved",
    "1-1/2 cups sweet corn kernels (fresh or frozen-then-thawed)",
    "4oz freshly shredded Monterey Jack cheese",
    "1 small head romaine lettuce, sliced",
    "For the seasoning mix:",
    "1 Tablespoon chili powder",
    "2 teaspoons garlic powder",
    "1-1/4 teaspoons salt",
    "1/2 teaspoon cumin",
    "1/2 teaspoon onion powder",
    "1/4 teaspoon dried oregano",
    "1/4 teaspoon cayenne pepper",
    "For the Cilantro-Lime Rice:",
    "2 cups water",
    "1 Tablespoon canola or vegetable oil",
    "1/2 teaspoon salt",
    "1 cup long grain white rice",
    "1/4 cup chopped cilantro",
    "juice of 1/2 lime",
    "For the Quick Guacamole:",
    "3 ripe avocados",
    "juice from 1/2 lime",
    "2 Tablespoons chopped cilantro",
    "garlic salt, to taste"
  ],
  "__v": 1
}