{
  "__v": 1,
  "directions": [
    "0",
    "Overnight Soak: Rinse and sort the beans. Add 6-8 cups of cold water to 1 pound of dried beans. Let stand overnight or at least 8 hours. Drain and rinse the beans. Side Note: If you don't have time to do an overnight soak, try the quick soak method: Rinse and sort the beans. Add 6-8 cups of water to 1 pound of dried beans. Bring water to a boil, boil for 2 minutes, remove from heat; cover and let stand for 1 hour. Drain and rinse the beans.",
    "Heat the olive oil in a large Dutch oven or pot over medium heat. Add onions, carrots, & celery. Cook for 4-5 minutes. Add garlic and cook for 30-60 seconds before adding stock, drained white beans, ham hock, bay leaf, sea salt and freshly cracked pepper, to taste. Cover and cook over low heat for at least 3 1/2-4 hours, stirring occasionally. Slowly break up the ham from the bone a little every time you stir the soup then remove any fat or bone from the ham hock along the way.",
    "Remove the lid from the pan for 30 minutes prior to serving, making sure all fat and bone have been remove from the soup. Taste and re-season with sea salt and freshly cracked pepper, to taste. Remove the bay leaf and ladle into bowls. Serve with salad and bread if desired. Enjoy."
  ],
  "firstAdded": "2014-10-12T14:07:54.325000",
  "hash": "d79a00a459011dbc57f68a2594827fccad1b2e13",
  "href": "http://www.fortheloveofcooking.net/2013/12/slow-simmered-white-bean-and-ham-soup.html",
  "image": "http://www.fortheloveofcooking.net/wp-content/uploads/2013/12/DSC_2536.jpg",
  "ingredients": [
    "0",
    "1 lb of dried white beans",
    "6-8 cups of water",
    "1-2 tsp olive oil",
    "1 small sweet yellow onion, diced",
    "3 carrots, peeled and diced",
    "3 stalks of celery, diced",
    "2 cloves of garlic, minced",
    "1 ham hock, extra fat remove from the outside of the hock",
    "6 cups of chicken stock",
    "1 bay leaf",
    "Sea salt and freshly cracked pepper, to taste"
  ],
  "keywords": [
    "white",
    "beans",
    "water",
    "olive",
    "oil",
    "yellow",
    "onion",
    "carrots",
    "stalks",
    "celery",
    "garlic",
    "ham",
    "extra",
    "fat",
    "outside",
    "hock",
    "chicken",
    "stock",
    "bay",
    "leaf",
    "salt",
    "cracked",
    "pepper"
  ],
  "title": "SLOW SIMMERED WHITE BEAN AND HAM SOUP",
  "users": [
    null
  ]
}