{
  "hash": "223e4a47a8e48a24c4be8d68f8f9c5a43fb08cb5",
  "title": "Curried Cauliflower Bisque",
  "image": "http://winnebagolife.com/wp-content/uploads/2015/09/Adinaro-Curried-Cauliflower-Bisque-pic-3.jpg",
  "href": "http://winnebagolife.com/2015/09/healthy-rv-eating-curried-cauliflower-bisque",
  "extension": "Firefox",
  "firstAdded": "2015-10-09T13:40:05.529000",
  "users": [
    null
  ],
  "keywords": [
    "head",
    "cauliflower",
    "florets",
    "onion",
    "tbs",
    "coconut",
    "olive",
    "oil",
    "garlic",
    "salt",
    "broth",
    "chicken",
    "russet",
    "potato",
    "mediumlarge",
    "red",
    "curry",
    "fat",
    "milk",
    "garnishes",
    "croutons",
    "using",
    "baguette",
    "roasted",
    "cashews",
    "cilantro"
  ],
  "directions": [
    "0",
    "Preheat oven to 375 degrees. Toss the cauliflower and sweet onion with the oil and garlic. Spread on a lightly greased baking sheet, and sprinkle with sea salt. Roast until the veggies start turning a nice golden brown color on their edges…somewhere between 25-35 minutes (keep an eye on them!), and stirring once during the cooking cycle.",
    "Once that’s in the oven, add the broth and potatoes to a large stock pot. Cook over medium-high heat. Once it boils, add curry paste, and then turn off the burner until the veggies are done roasting.",
    "Adinaro Curried Cauliflower Bisque pic 3",
    "Once the veggies are done roasting, add them to the stock pot and increase the heat to high. Boil mixture for about 5 minutes. Turn off the burner and stir in coconut milk and curry powder.",
    "Puree ingredients in a blender or food processor until completely smooth. Be very careful! For safety, puree hot ingredients in small batches, and start on the lowest setting.",
    "Pureeing Soup in VitaMix",
    "And there you have it! At this point, I like to taste the finished product, and determine if I need a little more spices or curry paste, adding accordingly. Plus, you’ll want to check the consistency. It can come out a little thick. If it does, simply add water to thin it to desired consistency."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "1 large head of cauliflower, cut into florets",
    "1 large sweet onion, chopped",
    "2 TBS melted coconut oil or olive oil",
    "2 tsp minced garlic",
    "Sea salt to taste",
    "7 cups broth (chicken or vegetable)",
    "1 Russet potato (medium-large), chopped and peeled",
    "3 TBS red curry paste",
    "1 14-oz can full fat coconut milk",
    "1 tsp curry powder",
    "Optional garnishes:",
    "Homemade croutons using whole grain baguette",
    "Roasted cashews",
    "Fresh cilantro"
  ],
  "__v": 1
}