{
  "hash": "f471febdb8d56e0b4c3e84dedbe3e7bbab7ad893",
  "title": "Baked Southwest Teff Burgers",
  "image": "https://img.washingtonpost.com/rf/image_982w/2010-2019/WashingtonPost/2014/04/03/Others/Images/2014-04-03/food131396539440.jpg",
  "href": "https://www.washingtonpost.com/pb/recipes/baked-southwest-teff-burgers/13979/",
  "extension": "",
  "firstAdded": "2015-12-29T22:45:12.076000",
  "users": [
    null
  ],
  "keywords": [
    "wholegrain",
    "teff",
    "headnote",
    "water",
    "roasted",
    "potato",
    "cubes",
    "glutenfree",
    "rolled",
    "oats",
    "nosaltadded",
    "black",
    "beans",
    "rinsed",
    "white",
    "onion",
    "scallions",
    "cilantro",
    "leaves",
    "tender",
    "stems",
    "juice",
    "lime",
    "garlic",
    "cumin",
    "light",
    "agave",
    "nectar",
    "salt",
    "pepper",
    "seeded",
    "jalapeo"
  ],
  "directions": [
    "0",
    "DIRECTIONS",
    "Preheat the oven to 375 degrees.Grease a large rimmed baking sheet with canola oil spray.",
    "Toast the teff in a medium saucepan over medium heat, stirring frequently, for about 3 minutes. Add the water and whisk while the mixture just starts to boil. Cover and reduce the heat to low; cook for about 20 minutes, whisking occasionally and adjusting the heat so the mixture is barely bubbling. The water should be absorbed, and the teff should be moist. Remove from the heat and let it sit, covered, for 5 minutes, then uncover and cool to room temperature.",
    "Combine the cooled teff with the sweet potato cubes, rolled oats, beans, scallions, white onion, cilantro, lime juice, garlic (to taste), cumin, agave, salt, black pepper and the jalapeño pepper, if using, in a large bowl; gently mix together until well combined.",
    "Transfer half of the mixture to a food processor; pulse 10 times, then transfer to a separate bowl. Repeat with the remaining half. Do not over-process, or it will become mushy.",
    "Shape the mixture into 8 equal-size patties and transfer to the baking sheet. Bake for 10 minutes, then turn the patties over and bake for 10 minutes.",
    "Serve hot.",
    "NOTE: Peel a small sweet potato (about 10 ounces) and cut it into 1/2-inch cubes. Transfer to a medium bowl and toss with 1/2 tablespoon of extra-virgin olive oil and a pinch each of salt and pepper. Spread the cubes in a single layer on a baking sheet. Bake in a 350-degree oven for 15 minutes or until tender, stirring once about halfway through."
  ],
  "ingredients": [
    "0",
    "1/2 cup whole-grain teff (see headnote)",
    "2 cups water",
    "1 cup roasted sweet potato cubes (see NOTE)",
    "1 cup gluten-free rolled oats",
    "1 cup homemade or no-salt-added black beans, drained and rinsed",
    "1 cup finely chopped white onion",
    "1/2 cup chopped scallions",
    "1 cup chopped cilantro leaves and tender stems",
    "Juice of 1 lime",
    "2 to 4 cloves garlic, minced",
    "1 teaspoon ground cumin",
    "1 teaspoon light agave nectar",
    "1/4 teaspoon fine sea salt",
    "1/2 teaspoon freshly ground black pepper",
    "1 tablespoon seeded, diced jalapeño pepper (optional)"
  ],
  "__v": 1
}