{
  "hash": "f84d44ebd2b8e2f884470e6d1dd94cff2f1531b0",
  "title": "Pumpkin Cheesecake",
  "image": "http://cdn-image.myrecipes.com/sites/default/files/styles/300x300/public/image/recipes/sl/14/11/pumpkin-cheesecake-sl-x.jpg?itok=CMy4u3jX",
  "href": "http://www.myrecipes.com/recipe/pumpkin-cheesecake-6",
  "firstAdded": "2015-01-23T22:36:29.334000",
  "users": [
    null
  ],
  "keywords": [
    "crust",
    "cinnamonflavored",
    "graham",
    "cracker",
    "crumbs",
    "chocolate",
    "click",
    "savings",
    "pecans",
    "butter",
    "granulated",
    "sugar",
    "cooking",
    "spray",
    "filling",
    "cream",
    "cheese",
    "softened",
    "room",
    "firmly",
    "light",
    "brown",
    "pumpkin",
    "pie",
    "spice",
    "vanilla",
    "eggs",
    "lemon",
    "juice",
    "container",
    "sour",
    "savingsclick"
  ],
  "directions": [
    "0",
    "Prepare Crust: Preheat oven to 325°. Stir together first 5 ingredients in a medium bowl until well blended. Press mixture onto bottom and 1 inch up sides of a lightly greased (with cooking spray) 9-inch springform pan. Bake 10 minutes. Let stand at room temperature until ready to use.",
    "Prepare Filling: Beat cream cheese and next 3 ingredients at medium-low speed with an electric mixer in a large bowl just until smooth. Add eggs, 1 at a time, beating at low speed just until yellow disappears after each addition.",
    "Process pumpkin in a food processor 1 to 2 minutes or until very smooth. Stir together lemon juice and 1 1/2 cups pumpkin puree; reserve remaining pumpkin puree. Add pumpkin-lemon juice mixture to cream cheese mixture, and beat at low speed just until blended; pour into prepared crust.",
    "Bake at 325° for 50 minutes to 1 hour or until center of cheesecake jiggles. (Prepare Topping during last 10 minutes of bake time.)",
    "Prepare Topping: Stir together sour cream and 3 Tbsp. granulated sugar; reserve 1/3 cup sour cream-sugar mixture. Stir together remaining sour cream mixture, pinch of pumpkin pie spice, and reserved pumpkin puree.",
    "Remove cheesecake from oven. Gently spread sour cream-pumpkin mixture over cheesecake. Dollop with reserved 1/3 cup sour cream-sugar mixture; gently swirl with a knife.",
    "Return cheesecake to oven, and bake at 325° for 5 more minutes. Turn oven off. Let cheesecake stand in oven, with door closed, 15 minutes. Remove cheesecake from oven, and gently run a knife around outer edge of cheesecake to loosen from sides of pan. (Do not remove sides of pan.) Cool completely on a wire rack (about 2 hours). Cover and chill 8 to 12 hours.",
    "How to Make a Leaf Garnish: Cut refrigerated piecrusts into decorative shapes using seasonal cookie cutters. Arrange cutouts in a single layer on a baking sheet; score dough with the tip of a paring knife to create designs, if desired. Bake dough according to package directions until golden and done. Remove cutouts to a wire rack; cool and decorate as desired."
  ],
  "ingredients": [
    "0",
    "CRUST",
    "3/4 cup cinnamon-flavored graham cracker crumbs",
    "3/4 cup chocolate graham cracker crumbs $Click to see savings",
    "1/2 cup finely chopped toasted pecans",
    "5 tablespoons butter, melted $Click to see savings",
    "3 tablespoons granulated sugar $Click to see savings",
    "Vegetable cooking spray",
    "FILLING",
    "4 (8-oz.) packages cream cheese, softened at room temperature $Click to see savings",
    "1 cup firmly packed light brown sugar $Click to see savings",
    "1 teaspoon pumpkin pie spice",
    "1 teaspoon vanilla extract",
    "4 large eggs $Click to see savings",
    "1 (15-oz.) can pumpkin",
    "1 tablespoon fresh lemon juice",
    "TOPPING",
    "1 (16-oz.) container sour cream $Click to see savings$Click to see savings",
    "3 tablespoons granulated sugar $Click to see savings",
    "Pinch of pumpkin pie spice"
  ],
  "__v": 1
}