{
  "hash": "a248db34eb9489d5d32a5ad3b706e7d377db279b",
  "title": "Cheesecake Factory Copycat: Sundried Tomato Fettuccine {Lightened Up}",
  "image": "http://www.tablefortwoblog.com/wp-content/uploads/2013/02/cheesecake-factory-sundried-tomato-pasta-copycat-tablefortwoblog-3.jpg",
  "href": "http://www.tablefortwoblog.com/cheesecake-factory-copycat-lightened-up-sundried-tomato-fettuccine/?utm_source=Table+for+Two+Email+Subscription&utm_campaign=8914492086-RSS_EMAIL_CAMPAIGN&utm_medium=email",
  "extension": "Chrome",
  "firstAdded": "2015-03-27T23:31:11.959000",
  "users": [
    null
  ],
  "keywords": [
    "fettuccine",
    "reserved",
    "pasta",
    "water",
    "olive",
    "oil",
    "garlic",
    "sundried",
    "tomato",
    "halves",
    "petite",
    "tomatoes",
    "granulated",
    "sugar",
    "plain",
    "nonfat",
    "greek",
    "yogurt",
    "light",
    "sour",
    "cream",
    "baby",
    "spinach",
    "salt",
    "pepper",
    "red"
  ],
  "directions": [
    "0",
    "In a large stockpot, bring water to a boil, add 1 tbsp. of olive oil then add your fettuccine. Cook according to direction on the box then drain (reserving 1 cup of the pasta water) and set aside.",
    "In a small bowl, combine the plain Greek yogurt and light sour cream, mix together with a spoon and set aside.",
    "While the pasta is cooking, in a large skillet, add the remaining 3 tbsp. of olive oil to the skillet over medium high heat. Once the oil is heated up, add garlic and sundried tomato halves. Sauté until fragrant, about 2 minutes.",
    "Turn the heat down to medium low and gently add the diced tomatoes, tomato paste, and granulated sugar. Stir until well-incorporated.",
    "Swiftly whisk in the Greek yogurt and sour cream mixture. You'll want to slowly add it in but whisk fast to get it all incorporated well. After all of it has been added and combined, bring the heat up to medium high and let it simmer and thicken for about 5-7 minutes.",
    "Season the sauce with salt and pepper, to taste, then add in the baby spinach. Once the spinach has wilted, you may add in the cooked pasta and turn off the heat.",
    "Toss to coat the pasta. If the mixture seems too thick, this is where you can slowly add the reserved pasta water (DO NOT add the full cup all at once, pour slowly and stir and see if you need more).",
    "You may top with crushed red pepper flakes, if desired.",
    "Serve hot."
  ],
  "ingredients": [
    "0",
    "¾ pound dried fettuccine",
    "1 cup reserved pasta water",
    "4 tbsp. olive oil",
    "5 cloves garlic, minced",
    "½ cup sundried tomato halves, sliced",
    "1 (14.5 ounce) can of petite diced tomatoes, drained",
    "3 tbsp. tomato paste",
    "½ tbsp. granulated sugar",
    "½ cup plain non-fat Greek yogurt",
    "¼ cup light sour cream",
    "1½ cups baby spinach",
    "Salt & pepper, to taste",
    "Crushed red pepper flakes (optional)"
  ],
  "__v": 1
}