{
  "__v": 1,
  "directions": [
    "0",
    "Combine tomatoes, scallion whites, cilantro, garlic, chipotle, and 3/4 teaspoon salt in bowl; set aside.",
    "Combine shrimp, 1/4 teaspoon salt, and 1/4 teaspoon pepper in separate bowl. Heat 1 tablespoon oil in 12-inch nonstick skillet over medium-high heat until just smoking. Add half of shrimp to pan in single layer and cook, without moving them, until spotty brown and edges turn pink on bottom side, about one minute. Flip each shrimp and continue to cook until all but very center is opaque, about 30 seconds. Transfer shrimp to large plate. Repeat with remaining 1 tablespoon oil and remaining shrimp.",
    "Return skillet to medium-high heat. Add tomato mixture and lime juice and cook until tomatoes soften slightly, about one minute. Stir in shrimp and cook until shrimp are cooked through, about one minute. Transfer to platter and sprinkle with scallion greens and avocado. Serve with lime wedges."
  ],
  "firstAdded": "2014-08-16T03:14:35.457000",
  "hash": "a3cc34101a182e40a6ef582efd4f13a6ab111d05",
  "href": "http://www.refinery29.com/americas-test-kitchen/4?crlt.pid=camp.F0pH85uO5xUH",
  "image": "//static1.refinery29.com/bin/entry/1bb/x,80/1147146/shrimpembed.jpg",
  "ingredients": [
    "0",
    "1 pound tomatoes, cored and cut into 1/2-inch pieces",
    "6 scallions, white and green parts separated, sliced thin",
    "1/4 cup minced fresh cilantro",
    "3 garlic cloves, minced",
    "2 teaspoons minced canned chipotle chiles in adobo sauce",
    "Salt and pepper",
    "1 1/2 pounds peeled and deveined extra-large shrimp (21 to 25 per pound)",
    "2 tablespoons vegetable oil",
    "1 tablespoon lime juice, plus lime wedges for serving",
    "1 avocado, halved, pitted, and cut into 1/2-inch pieces"
  ],
  "keywords": [
    "tomatoes",
    "cored",
    "pieces",
    "scallions",
    "white",
    "green",
    "parts",
    "separated",
    "cilantro",
    "garlic",
    "canned",
    "chipotle",
    "chiles",
    "adobo",
    "salt",
    "pepper",
    "extralarge",
    "shrimp",
    "oil",
    "juice",
    "lime",
    "wedges",
    "avocado"
  ],
  "title": "shrimp with tomato, lime, and avocado recipe",
  "users": [
    null
  ]
}