{
  "hash": "324fde3cad05f8269b386020b74e6439e01c7aca",
  "title": "Masala Khichdi",
  "image": "http://cdn.holycowvegan.net/wp-content/uploads/2014/06/masala-khichdi-3.jpg",
  "href": "http://holycowvegan.net/2014/06/masala-khichdi.html",
  "extension": "Firefox",
  "firstAdded": "2015-05-19T15:20:05.550000",
  "users": [
    null
  ],
  "keywords": [
    "brown",
    "rice",
    "moong",
    "dal",
    "oil",
    "cumin",
    "seeds",
    "onion",
    "sprig",
    "curry",
    "leaves",
    "tomato",
    "puree",
    "medium",
    "tomatoes",
    "potato",
    "cubes",
    "green",
    "peas",
    "frozen",
    "japanese",
    "eggplants",
    "turmeric",
    "cayenne",
    "coriander",
    "garam",
    "masala",
    "knob",
    "ginger",
    "salt",
    "mint"
  ],
  "directions": [
    "0",
    "If you have a pressure cooker, heat oil in the pressure cooker.",
    "Add the cumin seeds and when they sputter, add the onions and curry leaves.",
    "Saute, stirring, until brown spots appear on the onions.",
    "Add the ginger and saute another minute.",
    "Add the tomato puree, turmeric, cayenne and coriander powder. Mix well and cook, stirring frequently, until the tomato puree darkens a couple of shades and bubbles at the corners.",
    "Add the vegetables. If you're using frozen peas, don't add them now.",
    "Add the rice and lentils.",
    "Mix everything well together, then add six cups of water or vegetable stock.",
    "If you're cooking in a pressure cooker, cover now and let the khichdi cook for 20 minutes after the cooker comes to pressure.",
    "On the stovetop, if not using a pressure cooker, bring the water to a boil, cover the pot with a tight-fitting lid and cook 45 minutes or until the rice and lentils are really soft. Add more water if needed at any time. You want the khichdi to have a slightly runny consistency, like a risotto. It shouldn't be too dry.",
    "Open the pressure cooker or pot. If you're using frozen peas, add them at this point and stir the khichdi well. Add the garam masala and salt and return the khichdi to heat to let it warm through.",
    "Garnish with the coriander or mint leaves.",
    "Serve hot."
  ],
  "ingredients": [
    "0",
    "1½ cups brown rice",
    "1 cup moong dal",
    "1 tsp vegetable oil",
    "1 tsp cumin seeds",
    "1 large onion, chopped",
    "1 sprig curry leaves",
    "½ cup tomato puree or 2 medium tomatoes",
    "1 sweet potato, cut into small cubes",
    "1 cup green peas, frozen or fresh",
    "2 Japanese eggplants, cut into small cubes",
    "¼ tsp turmeric",
    "½ tsp cayenne",
    "1 tbsp coriander powder",
    "1 tsp garam masala",
    "1-inch knob of ginger, grated",
    "Salt to taste",
    "½ cup finely chopped coriander or mint leaves"
  ],
  "__v": 1
}