{
  "hash": "93e2be742e2b2c9b10f4ff906579d3359e94f18d",
  "title": "Overnight Buttermilk Soft and Fluffy Cinnamon Rolls",
  "image": "http://www.averiecooks.com/wp-content/uploads/2013/02/overnightcinnrolls-26.jpg",
  "href": "http://www.averiecooks.com/2013/02/overnight-buttermilk-soft-and-fluffy-cinnamon-rolls.html",
  "firstAdded": "2014-12-21T18:18:22.318000",
  "users": [
    null
  ],
  "keywords": [
    "dough",
    "allpurpose",
    "flour",
    "divided",
    "granulated",
    "sugar",
    "instant",
    "dry",
    "yeast",
    "use",
    "red",
    "star",
    "platinum",
    "salt",
    "unsalted",
    "butter",
    "eggs",
    "lightly",
    "whisked",
    "buttermilk",
    "filling",
    "soft",
    "sit",
    "rises",
    "light",
    "brown",
    "cinnamon",
    "used",
    "cream",
    "cheese",
    "frosting",
    "batch",
    "softened",
    "vanilla",
    "confectioners"
  ],
  "directions": [
    "0",
    "Dough - To the bowl of a stand mixer fitted with the paddle attachment, combine 4 cups flour, 1/3 cup sugar, yeast, salt to taste; set aside.",
    "Place 6 tablespoons butter in a small microwave-safe bowl, and heat to melt, about 45 seconds; set aside. Crack eggs in another bowl and whisk; set aside.",
    "Add buttermilk to a glass measuring cup and warm to temperature, about 45 seconds on high power in the microwave. (Based on the type of yeast used, milk temperatures will vary. Red Star Platinum yeast calls for warmer temperatures than most, 120 to 130F; other brands and yeast call for much lower temperatures, about 95 to 105F. Warm milk according to manufacturer's recommendations on the packaging. Taking the temperature with a digital thermometer is highly recommended, but if you're not, make sure the milk is warm, not hot. Err on the cooler rather than hotter side so you don't kill the yeast.) If the milk separates or gets a little funny looking after being warmed, whisk it to smooth it out.",
    "To the dry ingredients in the stand mixer, add the melted butter, eggs, buttermilk, and beat on medium-low speed for about 1 minute, or until combined.",
    "Switch to the dough hook (the dough will have stuck to the paddle and just pick off what you can and put it into the bowl) and knead for 10 to 12 minutes (15 to 18 minutes by hand). If after 5 minutes more flour is needed, add the remaining 1/4 cup flour, 1 tablespoon at a time, until the dough clears the side of the bowl but sticks to the bottom. This is a very sticky, tacky, moist, and borderline sloppy dough; don't be tempted to over-flour it. It's supposed to be that way. The more flour you add now, the less fluffy and more dense the rolls will be. Dough should clear the sides of the mixer while kneading but sticking to the bottom is fine.",
    "Remove the dough from the mixing bowl, spray a large mixing with cooking spray, and place the dough in the bowl. Cover with plasticwrap and place it in a warm, draft-free place to rise for about 2 to 2 1/2 hours, or doubled in size. I keep my bowl inside a powered-off oven. Every 45 minutes or so, I power on the oven for 1 minute to 400F, as if I am preheating it, then I power it off. Do not, repeat not, keep the oven on. These short bursts of 1 minute of heat create a stable 85F-ish warm environment, ideal for the yeast. If your rising spot is cold, it will take longer than 2 1/2 hours.",
    "Prepare a 11-by-17-inch or similar sized jellyroll pan or sheetcake pan with a raised edge, or use a 9-by-13-inch pan. I prefer a jellyroll pan because it's slightly larger so the rolls are less squished, have more room to rise, and bake more evenly. Line pan with aluminum foil, spray with cooking spray; set aside.",
    "Rolling Out the Dough - After dough has doubled in size, punch it down. Turn dough out onto a floured Silpat or floured countertop. Knead it lightly for about 2 minutes. With a rolling pin, roll it out to a 16-by-12-inch rectangle; just slightly larger than a standard Silpat.",
    "Filling - With a knife, butter the dough with 1/2 cup soft butter, leaving a 3/4-inch border around the edges. Sprinkle the brown sugar over it. Sprinkle the cinnamon over the brown sugar; I was very generous with the cinnamon and used almost 5 teaspoons and recommend at least 3; just eyeball it and shake it on.",
    "Slicing the Dough - Loosen the dough from the counter using a bench scraper (or metal spatula), and starting with a long edge, roll the dough into a tight log. Pinch the seam closed and turn log so seam side is down. Gently stretch the log to be 18 inches in length with an even diameter all the way around and pat the ends to even them up. Don't fret if your log isn't perfect; it's okay.",
    "Slice the cylinder into 12 evenly sized rolls (about 1 1/2 inches wide) using a bench scraper, serrated knife, or plain unwaxed dental floss (works great to not squish and compact the log). Arrange the rolls cut side down in the prepared baking pan. Cover with plastic wrap.",
    "Decide to Make Straight Through - Let rise in a warm, draft-free place until the rolls have nearly doubled in size, 1 to 1 1/2 hours.",
    "Or...Decide to Make as Overnight Rolls - Don't let rolls rise after they've been sliced and placed in covered pan. Place pan in refrigerator for up to 16 hours. Before baking, let the rolls sit at room temperature until they have nearly doubled in size, about 1 hour.",
    "Baking -For either version, bake at 350F for 22 to 25 minutes, or until lightly golden on top and cooked through but not overly browned. Immediately and generously, spread cream cheese frosting on the warm rolls. Serve immediately. Rolls are best eaten fresh, but will keep in an airtight container at room temperature for up to 5 days. Reheat leftover rolls for a few seconds in the microwave before serving. If you have issues with cream cheese frosting at room temperature, then refrigerate the leftover rolls; I don't. For longterm storage, I recommend making the rolls as directed and then freezing unfrosted rolls; allow to thaw at room temp prior to serving and frost as directed. I prefer freezing finished rolls rather than freezing uncooked dough.",
    "Cream Cheese Frosting - I recommend making this at night if you're doing the overnight version, refrigerating it, and taking out along with the rolls as they rise so when you need it, it's well softened.",
    "Frosting may be halved (makes about 3 cups as written), but unused frosting can be stored in the refrigerator for up to 2 weeks and I have frozen frosting for up to 3 months; I'd rather have too much than not enough. All measurements and ingredients are to taste; consider adding buttermilk, almond extract, orange zest, heavy cream, or your other favorite specialty tweaks as desired. I keep it very simple.",
    "To the bowl of a stand mixer fitted with the paddle attachment, combine 1/2 cup butter, cream cheese, and beat on medium speed to combine, about 1 minute. Add the vanilla, 3 cups confectioners' sugar (I don't bother sifting), and beat until smooth and fluffy, about 3 minutes, stopping to scrape down the sides of the bowl as necessary. Add remaining 1 cup of sugar (or more, or none) as necessary, to taste, based on desired frosting consistency and flavor."
  ],
  "ingredients": [
    "0",
    "Dough",
    "up to 4 1/4 cups all-purpose flour, divided",
    "1/3 cup granulated sugar",
    "2 1/4 teaspoons instant dry yeast (one 1/4-ounce packet, I use Red Star Platinum)",
    "pinch salt, optional and to taste",
    "6 tablespoons unsalted butter, melted (3/4 of one stick)",
    "3 large eggs, lightly whisked",
    "3/4 cup buttermilk",
    "Filling",
    "1/2 cup unsalted butter (1 stick), very soft - let it sit out while dough rises",
    "1 to 1 1/4 cups light brown sugar, packed",
    "about 3 teaspoons cinnamon (I used almost 5 teaspoons)",
    "Cream Cheese Frosting - batch may be halved",
    "1/2 cup unsalted butter, softened",
    "6 ounces cream cheese, softened",
    "1 tablespoon vanilla extract",
    "1 pound confectioners' sugar (4 cups)"
  ],
  "__v": 1
}