{
  "__v": 1,
  "directions": [
    "0",
    "Lavare bene le melanzane e tagliarle a fette di c.ca 5 mm quindi posizionatele in uno scolapasta leggermente inclinato, cospargetele di sale grosso e lasciatele spurgare il liquido amarognolo per almeno 1 ora. Sciacquatele bene per eliminare il sale ed asciugatele con attenzione. Friggetele in olio caldo finché non saranno ben dorate, scolatele e sistematele su carta assorbente affinché si asciughino dall'olio. Tenete in caldo",
    "Preparate la salsa. Fate rosolare l'aglio in olio extra vergine quindi buttate i pomodori pelati e fate cuocere facendo insaporire bene ed aggiungendo qualche foglia di basilico. Salate. Tagliate le melanzane a strisce non troppo piccole tenendo qualche fetta intera per la decorazione del piatto, e mettetele nella salsa. Buttate la pasta in acqua bollente salata e fate cuocere al dente. Scolate e passatela nel sugo saltandola per un istante, impiattate e cospargete di abbondante ricotta salata grattugiata a fori grandi. Decorate con un ciuffetto di basilico fresco. Servite, gustate e ascoltate la voce degli angeli!"
  ],
  "firstAdded": "2014-10-10T11:46:16.349000",
  "hash": "771d0010ee92ed5c2968e2ac4be40e0f5b85f7e0",
  "href": "http://www.andantecongusto.it/2012/03/pasta-diva-per-maria-callas-pasta-alla.html",
  "image": "http://2.bp.blogspot.com/-MGRjTLEkGZU/T3NHnGfJDlI/AAAAAAAAB1Y/8rIGjKgLJlI/s640/META+CON+MUSICA.jpg",
  "ingredients": [
    "0",
    "Ingredienti per 4 persone:",
    "500 gr di pomodori pelati (io quelli fatti in casa da mia suocera)",
    "350 gr di pasta corta (maccheroni, o pennette rigate o tortiglioni)",
    "200 gr di ricotta salata (infornata per chi preferisce)",
    "2 belle melanzane lunghe",
    "1 o 2 spicchi d'aglio",
    "Basilico fresco",
    "Olio extra vergine",
    "Sale"
  ],
  "keywords": [
    "ingredienti",
    "persone",
    "pomodori",
    "pelati",
    "quelli",
    "fatti",
    "casa",
    "mia",
    "suocera",
    "pasta",
    "corta",
    "maccheroni",
    "pennette",
    "rigate",
    "tortiglioni",
    "ricotta",
    "salata",
    "infornata",
    "chi",
    "preferisce",
    "belle",
    "melanzane",
    "lunghe",
    "spicchi",
    "daglio",
    "basilico",
    "fresco",
    "olio",
    "extra",
    "vergine",
    "sale"
  ],
  "title": "Pasta alla Norma",
  "users": [
    null
  ]
}