{
  "hash": "01c68f05f6daad9f6ac19849d48c2f38cfd29482",
  "title": "Black Bean Vegan Enchiladas",
  "image": "http://lightorangebean.com/wp-content/uploads/2014/11/Black-bean-Enchiladas-feature-210x210.jpg?x22420",
  "href": "http://lightorangebean.com/black-bean-vegan-enchiladas/",
  "extension": "Chrome",
  "firstAdded": "2017-09-18T20:44:53.729000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat oil in a saute pan over medium heat. Add onion and garlic to cook until soft and fragrant, about 3 minutes. Add the chili powder, cumin powder, and salt. Cook another 2 minutes. Add the beans and tomato puree and bring to a boil. Turn the heat to low. Mash the beans with a potato masher and simmer 5 minutes.",
    "Remove the bean mixture from the heat and strain, reserving the sauce. Transfer the strained bean mixture to a medium bowl and mix together with ½ cup cilantro, jalapenos, and 4 oz of cheese.",
    "Preheat oven to 350 °F.",
    "Spread ½ cup of the sauce in the bottom of the baking dish. Microwave 5 tortillas at a time or follow the package instructions to soften. Scoop about ¼ cup bean mixture into each tortilla and roll it up tightly. Place the filled and rolled tortillas in the baking dish seam-side down. Finish all tortillas.",
    "Dip the pastry brush in the sauce and brush the ends of each tortilla. Pour the remaining sauce evenly over the enchiladas.",
    "Sprinkle the remaining cheese over the top of the enchiladas, cover the baking dish with aluminum foil. Bake for 20 minutes. Remove the foil, bake for additional 2-3 minutes until the cheese is slightly brown.",
    "Garnish with the remaining cilantro before serving."
  ],
  "ingredients": [
    "0",
    "1 tbs canola oil",
    "1 medium size yellow onion (finely chopped, approximately 8 oz)",
    "2 cloves garlic, minced",
    "3 tbs chili powder",
    "2 tsp cumin powder",
    "2 cups cooked black beans",
    "1 tsp salt",
    "2 cups tomato puree or 1 can (15 oz) tomato sauce + ½ cup water",
    "½ cup + 1 tbs chopped fresh cilantro",
    "1 medium size jalapenos (seeded, finely chopped, approximately 1 oz)",
    "8 oz vegan cheese (Mexican style GoVeggie preferred)",
    "12-14 (5.5-inch) corn tortillas (gluten-free if desired)"
  ],
  "__v": 1
}