{
  "__v": 1,
  "directions": [
    "0",
    "While your cake is baking in the oven, cut & slice your strawberries & set aside. When your cake is almost done baking combine your sugar, PET milk & butter in a sauce pan and heat to a boil. Stirring & mixing together continually, add your vanilla right when the sauce start to come to a boil. Allow your mixture to boil for 3 minutes. Once your cake is out of the oven for about 5 minutes, place your sliced strawberries on top of the hot cake. Then allow your heated sauce to cool slightly, about 5-7 minutes & pour your very warm/hot topping mixture over the strawberries that are on top of the cake.",
    "(Basically everything happens quickly once you get your cake out of the oven. You want a very warm sauce mixture on top of a very warm cake to allow the heat to soak in all that sauce goodness along with the juice of the strawberries.)",
    "Cover & place in the refrigerator to cool overnite or you can serve if the cake has been in the fridge for several hours. This is one of those recipes that the older it is the better it is. – love that kind of recipe, don’t you?"
  ],
  "firstAdded": "2014-09-22T04:12:12.316000",
  "hash": "589bf3b38b728bd3befb0ce632459910ff5c77fa",
  "href": "http://www.nestofposies-blog.com/2013/06/the-easiest-strawberry-shortcake-ever/",
  "image": "http://www.nestofposies-blog.com/wp-content/uploads/2013/06/easiest-strawberry-shortcake.jpg",
  "ingredients": [
    "0",
    "CAKE:",
    "a box of yellow cake mix (we use Ducan Hines) make the cake according to the back of the box in a 13×9 inch baking dish",
    "TOPPING:",
    "2-3 pints of fresh strawberries sliced",
    "1 1/4 cup of sugar",
    "1/2 cup of Evaporated milk (I used PET milk)",
    "4 Tablespoons (half stick) of butter",
    "1 teaspoon of vanilla"
  ],
  "keywords": [
    "cake",
    "yellow",
    "use",
    "ducan",
    "hines",
    "make",
    "according",
    "box",
    "baking",
    "dish",
    "pints",
    "strawberries",
    "sugar",
    "evaporated",
    "used",
    "pet",
    "milk",
    "butter",
    "vanilla"
  ],
  "title": "THE EASIEST STRAWBERRY SHORTCAKE ~ EVER!",
  "users": [
    null
  ]
}