{
  "hash": "23baa5174e5172c389306c98cdbf6125119d40db",
  "title": "Hříbkové risotto",
  "image": "",
  "href": "http://www.menudomu.cz/hribkove-risotto/",
  "extension": "Chrome",
  "firstAdded": "2015-12-08T09:41:46.433000",
  "users": [
    null
  ],
  "keywords": [
    "ingredience",
    "porci",
    "arborio",
    "erstv",
    "hbky",
    "mal",
    "alotky",
    "mslo",
    "cel",
    "kmn",
    "hladkolist",
    "petrelka",
    "lce",
    "nastrouhanho",
    "parmaznu",
    "pep"
  ],
  "directions": [
    "0",
    "Postup receptu najdete níž ve videu. K tomu je asi dobré dodat, že 100g rýže myslím samozřejmě syrové. Arborio je vhodná na risotta obecně, i když se používají i jiné druhy kulatozrnné rýže. Tato je celkem dobře dostupná, v supermarketu seženete tohle 500g balení za asi 43 Kč. Je vhodná pro svá velká zrnka, bílou barvu a velké množství škrobu, díky němuž při vaření skvěle absorbuje vodu, aniž by se rozvařila. Na návodu píší ohledně množství tekutiny, kterou absorbuje při vaření 1 díl rýže ku 1,5 dílu vody. Moje zkušenost je taková, abyste na tenhle návod nekoukali. Pokud budete risotto dělat celou dobu pod poklicí a na velmi malém ohni, možná byste se tomu mohli přiblížit, ale já tomu musím vždy poskytnout vláhy mnohem víc. Čas vaření právě tohoto typu (od zn. Lagris) je celkem odpovídající – píší 16-18 minut. Já ji dělala asi 20. Ale zkrátka vařte, dokud nebude rýže opravdu měkká a přilévejte stejně tak. Já jsem na tuto porci spotřebovala asi 3 dcl vody. Záleží i na pánvi/rendlíku/hrnci, kde risotto vaříte. Každopádně dolévejte vždy tak, abyste základ neutopili a trocha zrnek byla ještě na hladině vidět. Čím méně nepřilnavý povrch inventář má, tím víc budete muset míchat.",
    "Na titanové pánvi téměř není třeba.",
    "VIDEOrecept:",
    "Nejdříve tedy očistěte houby (z hříbků oškrábejte povrch nohy a pokud je klobouk znečištěný, navlhčeným ubrouskem vše otřete) – každopádně, čistěte je až opravdu na poslední chvíli před zpracováním. Průřezy uprostřed oddělte jako první, ty uschovejte a zbytek jich nakrájejte na drobné kousky. Na drobno pokrájejte i šalotky. Ty zpěňte na másle, přidejte orestovat houby, když pustí vodu a začnou lehce zlátnout,",
    "zarestujte minutku i rýži a pak můžete začít podlévat.",
    "Zkoušela jsem tento recept pouze s vodou už několikrát. Šalotky a množství hřibů zajistí dostatek chuti, po přidání parmazánu a petrželky nebudete nic postrádat. Samozřejmě můžete ale podle preferencí použít místo toho i zeleninový vývar nebo vodu, v níž se vyluhovaly sušené houby. Vše přidávejte ohřáté, nepřilévejte do risotta studené tekutiny. Vyjma bílého vína, to je jasné, že ho ohřívat nemusíte. Také ho tam zdaleka nemůžete dát tolik, risotto by bylo velmi kyselé. Na jednu porci stačí tak velký panák dobrého suchého. Zbývající tekutinou musí být opět voda, vývar a nebo louh. Na ozdobu použijte plátky hub orestované dozlatova na másle se solí,",
    "pepřem a kmínem.",
    "Skvělá je k tomu i parmazánová sušenka. Stačí rozpálit troubu na gril na maximální teplotu, rošt dát v troubě výš a nechat sýr zezlátnout a rozpéct v zapékací kulaté misce a nebo prostě na pečícím papíru – tvar zajistíte např. tvořítkem. Sušenku pak nechte vychladnout. Začne být křupavá. Ideálně ji položte na ubrousek,",
    "aby se odsál přebytečný tuk.",
    "Pokud někomu chybí maso, může vše posypat vysmaženou slaninou a nebo se nechat inspirovat další variantou. Když jsem si risotto zkoušela vařit před natáčením, orestovala jsem k němu půlky malých houbiček a také kousek kuřecích prsou s kůží.",
    "Ozdobeno jarní cibulkou restovanou s houbičkami."
  ],
  "ingredients": [
    "0",
    "Ingredience na 1 porci:",
    "100g rýže arborio",
    "3 čerstvé hříbky",
    "2 malé šalotky",
    "máslo",
    "celý kmín",
    "hladkolistá petrželka",
    "4 lžíce nastrouhaného parmazánu",
    "sůl",
    "pepř"
  ],
  "__v": 1
}