{
  "hash": "112d1757c71c00fc6ba12d1cf76c4038b4e94394",
  "title": "Pork Chops with Mushrooms and Cauliflower Mash",
  "image": "http://del.h-cdn.co/assets/15/50/980x490/landscape-1449780504-porkchopscaulimushl1a.jpg",
  "href": "http://www.delish.com/cooking/recipe-ideas/recipes/a45168/pork-chops-mushrooms-cauliflower-mash-recipe/?zoomable",
  "extension": "Chrome",
  "firstAdded": "2016-06-22T20:58:59.932000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "Season pork chops all over with salt and pepper. In a large skillet over medium-high heat, heat 1 tablespoon butter and olive oil. Add pork chops in batches and cook 4 minutes per side. Remove from heat and cover with foil to keep warm.",
    "Add thyme and mushrooms to skillet and cook 2 to 3 minutes without stirring. Add garlic and season with salt and pepper. Discard thyme stems and add chicken stock and heavy cream, breaking up any brown bits on the pan with a wooden spoon. Cook until reduced by half, 5 to 7 minutes. Stir in 1 tablespoon butter and chopped parsley.",
    "In a large pot of boiling salted water, boil cauliflower until fork tender, about 12 minutes. Drain, then return cauliflower to pot and add milk and remaining 2 tablespoons butter. Using an immersion blender or food processor, puree cauliflower mixture. Stir in Parmesan and season with salt and pepper.",
    "Serve mushrooms topped with cauliflower mash and pork chop. Pour any juice from pork chops over top and garnish with parsley."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "4 bone-in pork chops (1\" thick)",
    "kosher salt",
    "Black pepper",
    "4 tbsp. butter",
    "1 tbsp. extra-virgin olive oil",
    "8 sprigs fresh thyme",
    "16 oz. baby bella mushrooms, sliced",
    "3 cloves garlic, minced",
    "1 c. low-sodium chicken stock",
    "1 tbsp. heavy cream",
    "1/4 c. chopped parsley, plus more for garnish",
    "1 head cauliflower, cut into florets",
    "1/4 c. whole milk",
    "1/4 c. grated Parmesan"
  ],
  "__v": 1
}