{
  "hash": "222da7e339203751ab182bb73a448e12f94d65d7",
  "title": "Loaded M&M Oreo Cookie Bars",
  "image": "http://cdn.averiecooks.com/wp-content/uploads/2013/09/mmoreocookiebars-24.jpg",
  "href": "http://www.averiecooks.com/2013/09/loaded-mm-oreo-cookie-bars.html",
  "firstAdded": "2015-02-20T00:52:03.424000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "butter",
    "egg",
    "light",
    "brown",
    "sugar",
    "vanilla",
    "allpurpose",
    "flour",
    "used",
    "oreo",
    "birthday",
    "cake",
    "type",
    "chocolate",
    "sandwich",
    "cookie",
    "substituted",
    "heaping",
    "coarsely",
    "addins",
    "leftover",
    "cookies",
    "graham",
    "crackers",
    "chocolatecovered",
    "pretzels",
    "mms",
    "plain",
    "use",
    "favorite",
    "flavor",
    "candy"
  ],
  "directions": [
    "0",
    "Preheat oven to 350F. Line an 8-by-8-inch baking pan with aluminum foil, spray with cooking spray; set aside.",
    "In a large, microwave-safe bowl melt the butter, about 1 minute on high power.",
    "Wait momentarily before adding the egg so you don't scramble it. Add the egg, brown sugar, vanilla, and whisk until smooth.",
    "Add the flour and stir until just combined, don't overmix.",
    "Stir in the Oreos.",
    "Turn batter out into prepared pan, smoothing the top lightly with a spatula.",
    "Evenly sprinkle the M&Ms over the top, lightly pressing them down with your finger or a spatula.",
    "Bake for about 20 to 22 minutes, or until done based on add-ins used. Top should be set and edges slightly firm. A toothpick inserted in the center (if you can find a bare patch to test) should come out clean, or with a few moist crumbs, but no batter. Allow bars to cool in pan for at least 30 minutes before slicing and serving. Bars will keep airtight at room temperature for up to 1 week, or in the freezer for up to 6 months."
  ],
  "ingredients": [
    "0",
    "1/2 cup unsalted butter (1 stick), melted",
    "1 large egg",
    "1 cup light brown sugar, packed",
    "1 tablespoon vanilla extract",
    "1 cup all-purpose flour",
    "18 Oreo Cookies, coarsely chopped (I used Oreo Chocolate Birthday Cake Sandwich Cookies; another type of chocolate sandwich cookie may substituted, or about 2 heaping cups of coarsely chopped add-ins including leftover cookies, graham crackers, chocolate-covered pretzels, etc.)",
    "about 1/2 cup M&M's (I used plain, use your favorite flavor or other chopped candy)"
  ],
  "__v": 1
}