{
  "hash": "8f9f6dfaedf42419f4d30d5a0ba596634df0c533",
  "title": "Warm Skillet Bread and Artichoke Spinach Dip",
  "image": "http://www.seasonsandsuppers.ca/wp-content/uploads/2013/12/breadanddip18B.jpg",
  "href": "http://www.seasonsandsuppers.ca/warm-skillet-bread-artichoke-spinach-dip/",
  "extension": "Chrome",
  "firstAdded": "2015-10-12T14:43:19.125000",
  "users": [
    null
  ],
  "keywords": [
    "use",
    "loaf",
    "frozen",
    "bread",
    "dough",
    "thawed",
    "allpurpose",
    "flour",
    "active",
    "dry",
    "instant",
    "yeast",
    "salt",
    "milk",
    "warmed",
    "hot",
    "oil",
    "butter",
    "artichoke",
    "spinach",
    "dip",
    "loosely",
    "baby",
    "jar",
    "marinated",
    "hearts",
    "coarsely",
    "regular",
    "canned",
    "artichokes",
    "cream",
    "cheese",
    "room",
    "typical",
    "brick",
    "sour",
    "mayonnaise",
    "clove",
    "garlic",
    "sriracha",
    "parmesan",
    "mozzarella",
    "pepper",
    "serve"
  ],
  "directions": [
    "0",
    "For making bread dough: (If using pre-made dough, skip ahead to make the dip and then Cutting/shaping dough below)",
    "Add two cups of the flour to a large bowl of the bowl of a stand mixer fitted with a kneading hook. Add salt and combine. Warm milk to lukewarm. Stir in yeast and let stand a few minutes. Add yeast mixture to bowl, along with the vegetable oil or melted butter. Mix and add additional flour in 1/4 cup increments until a smooth dough forms. Knead until smooth. Transfer dough to an oiled bowl. Cover with plastic wrap and let rise until doubled, about 1 hour.",
    "Make Dip: Meanwhile, place fresh spinach in a bowl with 1 Tbsp. of water. Cover tightly with plastic wrap and microwave on high for 1 minute. Remove from microwave, leave covered and let stand 15 minutes to cool. Drain spinach well and add to a medium bowl.",
    "Add the remaining dip ingredients and mix until well combined. Cover and refrigerate until needed.",
    "Cutting/shaping dough: Turn dough out onto a lightly floured cutting board. Using a sharp knife or bench scraper, cut the dough into 16 equal pieces. (I cut in half, then each piece in half, then repeat cutting each piece into equal parts until I have 16 pieces). Shape each piece into a ball by pinching the edges together underneath.",
    "Generously butter an 8-inch cast-iron skillet. Find a bowl that is about 5 1/2-inches across the top, spray the outside with cooking spray and place it, top side down, in the center of the skillet. (*If you can't find a bowl, take a sheet of tin foil and shape it into a tight circle about 5 1/2-inches around and 1 inch high and place it in the centre. Spray it with cooking spray.",
    "Arrange the dough balls around the outside of the skillet, pushing them together as needed until they all fit. Brush dough balls generously with melted butter. Cover the skillet with plastic wrap and let rise until puffy, about 30 minutes.",
    "Pre-heat oven to 375° F. with rack in center of oven. Remove bowl from center of skillet. Spoon prepared dip into the center space, pushing it right up to the edge of the dough. Sprinkle top of dip with additional mozzarella/Parmesan. Bake in the pre-heated oven for about 30 minutes, until rolls are golden and sound hollow when tapped and the dip is bubbly.",
    "Remove from oven. Raise oven rack to the top third and switch oven to broil. Sprinkle the rolls with additional mozzarella cheese and return skillet to oven under the broiler, until the cheese and dip is browned.",
    "Let skillet stand at least 5-10 minutes, or until just warm (not hot). Add a bit of freshly ground pepper on top, if you like. Do watch the hot skillet handle and wrap in a towel if it is still to hot to hold. Serve with a dip \"knife\" and let everyone serve themselves."
  ],
  "ingredients": [
    "0",
    "Bread Dough: (or use one loaf of frozen bread dough, thawed)",
    "2 3/4 - 3 cups all-purpose flour",
    "2 1/2 tsp. active dry or instant yeast",
    "1 tsp. fine salt",
    "1 cup milk, warmed but not hot",
    "2 Tbsp. vegetable oil or melted butter",
    "Artichoke Spinach Dip:",
    "4 cups loosely packed fresh baby spinach (or 1/2 of a 10 oz. package frozen spinach, thawed, drained)",
    "170 ml jar of marinated artichoke hearts, drained and coarsely chopped (can also use regular canned artichokes, about 2/3 cup chopped)",
    "4 oz. cream cheese, room temperature (1/2 a typical brick)",
    "1/2 cup sour cream",
    "1/4 cup mayonnaise",
    "1 clove garlic, minced",
    "1/2 tsp. Sriracha sauce (or any \"hot sauce\" you like)",
    "1/4 cup freshly grated Parmesan cheese",
    "1/4 cup mozzarella, shredded + more for topping",
    "Salt and pepper",
    "To serve:",
    "1/4 cup mozzarella, shredded",
    "Freshly ground pepper"
  ],
  "__v": 1
}