{
  "hash": "a35c8f9448f6887895cf20c9f4c8f9ba9a5b5627",
  "title": "Chocolate Peanut Butter Fudge",
  "image": "http://mydarlingvegan.com/wp-content/uploads/2014/11/chocolate_peanut_butter_fudge.png",
  "href": "http://mydarlingvegan.com/2014/11/chocolate-peanut-butter-cup-fudge/",
  "extension": "Chrome",
  "firstAdded": "2015-11-29T18:13:03.590000",
  "users": [
    null
  ],
  "keywords": [
    "chocolate",
    "fudge",
    "vegan",
    "chips",
    "coconut",
    "milk",
    "tbps",
    "nondairy",
    "butter",
    "used",
    "earth",
    "balance",
    "vanilla",
    "sugar",
    "peanut",
    "tbsps",
    "brown",
    "max",
    "cleos",
    "bars"
  ],
  "directions": [
    "0",
    "Line an 8.5x4.5 (or similar sized) loaf pan with parchment paper so that it hangs over the sides and set aside.",
    "To make the chocolate fudge:",
    "Place the chocolate chips and vanilla extract in a small bowl. Set aside.",
    "In a small sauce pan heat the coconut milk & butter to a scald (just before boiling). Immediately pour over the chocolate chips and cover for 2 minutes. Remove lid and stir together gently until completely incorporated.",
    "Transfer to a food processor along with the powdered sugar and process until smooth.",
    "Pour into prepared loaf and and place in the refrigerator while preparing the peanut butter fudge.",
    "To make the peanut butter fudge:",
    "Combine the non-dairy butter and brown sugar in a small pot and bring to boil. Let boil for 2 minutes. Once ready place in a food processor with peanut butter and powdered sugar. With motor running, slowly add the non-dairy milk, scraping down the sides as necessary. You may need to add 1-2 more tablespoons of milk at this point. The fudge will be thick but should be spreadable.",
    "Pour over the top of the chocolate fudge, spreading evenly. Roughly chop Go Max Go Cleo's into small chunks and spread evenly over the top, pressing down lightly. Place in freezer and allow it to freeze all the way through, at least 2 hours.",
    "Cut into bite-size pieces. Store in the freezer."
  ],
  "ingredients": [
    "0",
    "Chocolate Fudge",
    "12 oz vegan chocolate chips",
    "½ cup coconut milk",
    "1 tbps non-dairy butter (I used Earth Balance)",
    "1 tsp vanilla extract",
    "1 cup powdered sugar",
    "Peanut Butter Fudge",
    "3 tbsps non-dairy butter",
    "⅓ cup brown sugar",
    "⅔ cup peanut butter",
    "¼ cup non-dairy milk",
    "2 cup powdered sugar",
    "2 Go Max Go Cleo's Bars"
  ],
  "__v": 1
}