{
  "hash": "987b93b232bdbb933c9c7eb3226e9ddce2bff253",
  "title": "Roasted Butternut Squash Ravioli with a Sage Brown Butter Sauce",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2004/1/13/0/em1d75_butternut_squash_ravioli.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/emeril-lagasse/roasted-butternut-squash-ravioli-with-a-sage-brown-butter-sauce-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-12-08T08:24:36.468000",
  "users": [
    null
  ],
  "keywords": [
    "butter",
    "shallots",
    "roasted",
    "butternut",
    "squash",
    "puree",
    "salt",
    "white",
    "pepper",
    "cream",
    "parmigianoreggiano",
    "cheese",
    "nutmeg",
    "recipe",
    "pasta",
    "dough",
    "rolled",
    "wide",
    "ribbons",
    "sage",
    "leaves",
    "parsley"
  ],
  "directions": [
    "0",
    "In a large saute pan, over medium heat, melt 1 tablespoon of the butter. Add the shallots and saute for 1 minute. Add the squash puree and cook until the mixture is slightly dry, about 2 to 3 minutes. Season with salt and pepper. Stir in the cream and continue to cook for 2 minutes. Remove from the heat and stir in 3 tablespoons cheese and nutmeg, to taste. Season with salt and pepper. Cool completely.",
    "Cut the pasta ribbons into 3-inch squares. Place 2 teaspoons of the filling in the center of each pasta square. Bring 1 corner of the square to the other, forming a triangle and seal the pasta completely. Add the pasta to pot of boiling salted water. Cook until al dente, about 2 to 3 minutes or until the pasta floats and is pale in color.",
    "Remove the pasta from the water and drain well. Season the pasta with salt and pepper.",
    "In a large saute pan, melt the remaining 8 tablespoons of butter. Add the sage to the butter and continue to cook until the butter starts to brown. Remove from the heat.",
    "Place some of the pasta in the center of each serving plate. Spoon the butter sauce over the pasta. Sprinkle the 2 ounces of cheese over each plate and garnish with parsley.",
    "Recipe courtesy of Emeril Lagasse, 2000"
  ],
  "ingredients": [
    "0",
    "9 tablespoons butter",
    "3 tablespoons minced shallots",
    "1 cup roasted butternut squash puree",
    "Salt",
    "Freshly ground white pepper",
    "3 tablespoons heavy cream",
    "3 tablespoons grated Parmigiano-Reggiano cheese, plus 2 ounces",
    "Pinch nutmeg",
    "1 recipe pasta dough, rolled out into wide ribbons, about 1/4-inch thick",
    "12 fresh sage leaves",
    "1 tablespoon finely chopped fresh parsley leaves"
  ],
  "__v": 1
}