{
  "hash": "352adbe6f0ab2c04682783b0080464c0b0d9d24d",
  "title": "One Pot Ratatouille Rice",
  "image": "https://yupitsvegan.com/wp-content/uploads/2016/09/one-pot-ratatouille-rice-vegan-5-150x150.jpg",
  "href": "https://yupitsvegan.com/one-pot-ratatouille-rice/",
  "extension": "Chrome",
  "firstAdded": "2017-08-06T17:18:40.711000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "In a skillet or saucepan, warm the olive oil over medium heat. Add the onion with a sprinkle of salt, and cook for 3 to 5 minutes, stirring frequently, until translucent. Add the garlic and cook for 30 to 60 seconds more, until fragrant.",
    "Add the zucchini, eggplant, black pepper, oregano, red pepper flakes, another pinch of salt; stir; and cook for 60 seconds. Add the bell pepper and tomatoes with another pinch of salt and cook for 2 to 3 minutes, until the tomatoes start to release some liquid.",
    "Finally, add the rice and vegetable broth and stir. Bring the mixture to a gentle boil, then reduce it to a simmer. Cover the pan and cook the mixture, stirring occasionally, for about 15 to 18 minutes or until the rice is done. Add more liquid if you notice the liquid is low and/or the rice is sticking to the bottom of the pan.",
    "Season to taste with more salt, pepper, dried herbs, and red pepper flakes as desired. Serve hot, topped with chiffonade of fresh basil. Once cooled to room temperature, leftovers can be stored for up to 5-7 days in the refrigerator."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 tbsp olive oil",
    "1 white or yellow onion diced",
    "3 cloves garlic minced",
    "1 medium zucchini diced",
    "1/2 eggplant diced (I used a larger ovoid eggplant - if using Japanese eggplant, which are smaller, you could use a whole eggplant)",
    "1/8 tsp black pepper",
    "1/2 tsp dried oregano",
    "1/4 tsp red pepper flakes",
    "1 red bell pepper diced",
    "2 Roma tomatoes diced",
    "1 cup white rice (see notes)",
    "1 and 1/2 cups vegetable broth plus more as needed",
    "fresh basil chiffonade for serving"
  ],
  "__v": 1
}