{
  "hash": "0c2b8e927afaf6baa9bbfaa4b2ac5cf87449872f",
  "title": "Homemade KFC!",
  "image": "",
  "href": "http://www.everynookandcranny.net/homemade-kfc/",
  "extension": "Chrome",
  "firstAdded": "2016-01-28T11:54:41.786000",
  "users": [
    null
  ],
  "keywords": [
    "credit",
    "marvellous",
    "fab",
    "foodie",
    "friend",
    "flour",
    "approx",
    "salt",
    "thyme",
    "basil",
    "oregano",
    "celery",
    "cracked",
    "black",
    "pepper",
    "mustard",
    "paprika",
    "smoked",
    "stuff",
    "garlic",
    "ginger",
    "chilli",
    "recommended",
    "zinger",
    "vibe",
    "method"
  ],
  "directions": [
    "0",
    "Method",
    "Whisk ingredients together then store in an airtight jar until needed It should last as long as the minimum use by date on your ingredients. That’s all there is to it!",
    "To cook chicken portions or burgers",
    "Ingredients",
    "Bone-in, skin-on chicken portions or skinless or boneless chicken breasts if making burgers",
    "Plain flour (to toss the chicken in)",
    "The Secret Blend of Herbs and Spices as above",
    "1-2 beaten eggs",
    "Fine cornmeal (optional)",
    "Milk, a bay leaf plus some salt and pepper (if making bone in KFC portions)",
    "Oil spray or a small amount of butter to dot the pieces with",
    "Method for Cooking Chicken Pieces or Burgers",
    "If cooking bone in chicken portions, put your portions in a large saucepan with the bay leaf and a generous seasoning of salt and pepper then cover with milk.",
    "Bring to the boil then reduce to a simmer for 10-15 minutes until just cooked through.",
    "Drain well in a colander and then dry off with paper towels.",
    "In one shallow bowl place some plain flour to toss the chicken pieces in as their first coating. I use around 100g flour for 6-8 pieces of chicken but just go by eye.",
    "In a second shallow dish, beat 1-2 eggs then toss your flour coated chicken in this.",
    "In a third bowl, place about 100g (half a cup-ish) of the blend of flour, herbs and spices and if you fancy an extra crunchy coating, add a few tablespoons of fine cornmeal. I love to do it this way.",
    "If you want an extra thick coating, at this stage dip back into the eggs then into the coating one last time.",
    "Place on a greaseproof or foil lined baking tray and spray liberally with oil or dot with a small knob of butter per chicken portion. Bake in an oven preheated to 180°C for 25-30 minutes by which time the chicken will be piping hot through to the bone and the coating will have crispened up nicely. Turn once half way through cooking spraying with more oil or butter if liked.",
    "To make burgers use skinless, boneless chicken breasts and do NOT poach them in milk first. I add a teaspoon or so of chilli powder to the spice mix for that Zinger, spicy vibe.",
    "Simply coat in flour, dip in the egg then the coating as above and either bake for 20-25 minutes or fry in a frying pan for approximately 8-10 minutes turning once until cooked through and no pink remaining. I must admit to prefering to shallow fry in a little rapeseed oil if making burgers as they have a lot less fat than the bone-in, skin on portions.",
    "Serve burgers with a slice of cheese melted on top, salsa, mayonnaise and a hash brown (homemade if you have the time) á la the Colonel himself"
  ],
  "ingredients": [
    "0",
    "Credit – Marvellous Mo, my fab foodie friend!",
    "Ingredients",
    "2 cups flour (approx 250g)",
    "1/2 tsp salt",
    "1/2 tsp dried thyme",
    "1/2 tsp dried basil",
    "1/2 tsp dried oregano",
    "1 tbsp celery salt",
    "1 tbsp cracked black pepper",
    "1 tbsp mustard powder",
    "2 tbsp paprika (not the smoked stuff)",
    "2 tsp garlic salt",
    "1 tsp ground ginger",
    "1 tsp chilli powder (optional but recommended for that “Zinger” vibe)",
    "Method"
  ],
  "__v": 1
}