{
  "hash": "1a70d639794e3cdc92c6f62e84f7afd3783ae180",
  "title": "Cranberry Almond Cake",
  "image": "http://www.budgetbytes.com/wp-content/uploads/2013/11/Cranberry-Almond-Cake-duo.jpg",
  "href": "http://www.budgetbytes.com/2013/11/cranberry-almond-cake/",
  "extension": "Chrome",
  "firstAdded": "2016-02-12T14:47:20.938000",
  "users": [
    null
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "baking",
    "butter",
    "salted",
    "room",
    "white",
    "sugar",
    "eggs",
    "vanilla",
    "almond",
    "milk",
    "cranberries",
    "almonds"
  ],
  "directions": [
    "0",
    "In a medium bowl, stir together the flour and baking powder until very well combined. Set the flour mixture aside. Preheat the oven to 350 degrees.",
    "In a large bowl, beat the butter and sugar together with a mixer until they are light and fluffy (start on low speed, then increase to high). Add the eggs, vanilla, and almond extract and beat again until the mixture is very light and creamy in texture (start on low speed again, then increase to high. Beat for about one minute on high).",
    "Add half of the flour mixture and beat on low until the flour is incorporated. Add half of the milk and beat until incorporated (it may look a little lumpy at first). Repeat with the second half of the flour and then with the second half of the milk. The end product should be a light, fluffy cake batter.",
    "Rinse the cranberries and then roughly chop them so that that each berry is at least cut in half. Fold the chopped cranberries into the cake batter. Spread the cake batter into a 9-inch pie plate coated with non-stick spray. Sprinkle the almonds over top and press them lightly into the cake batter. Bake for 35 minutes, or until the cake and almonds are lightly browned on top."
  ],
  "ingredients": [
    "0",
    "1½ cups all-purpose flour $0.15",
    "1½ tsp baking powder $0.04",
    "½ cup (1 stick) butter (salted, room temperature) $1.16",
    "1 cup white sugar $0.15",
    "2 large eggs $0.34",
    "½ tsp vanilla extract $0.14",
    "½ tsp almond extract $0.14",
    "½ cup milk $0.12",
    "6 oz. (1¼ cups) fresh cranberries $1.25",
    "⅓ cup sliced almonds $0.83"
  ],
  "__v": 1
}