{
  "hash": "17641d68107210b7ab24591bd1d391dc565795e5",
  "title": "Rustic Potato and Greens Pie",
  "image": "http://saramoulton.com/wp-content/uploads/2012/01/rustic_potato_greens_pie-280x186.jpg",
  "href": "http://saramoulton.com/2015/01/rustic-potato-and-greens-pie-2/",
  "extension": "Chrome",
  "firstAdded": "2015-04-16T11:18:49.890000",
  "users": [
    null
  ],
  "keywords": [
    "basic",
    "butter",
    "pastry",
    "recipe",
    "storebought",
    "single",
    "crust",
    "pie",
    "boiling",
    "potatoes",
    "yukon",
    "gold",
    "red",
    "bliss",
    "medium",
    "onion",
    "cooking",
    "greens",
    "chard",
    "spinach",
    "collards",
    "mustard",
    "mixture",
    "extra",
    "virgin",
    "olive",
    "oil",
    "garlic",
    "gruyre",
    "cheese",
    "parmigianoreggiano",
    "ricotta",
    "nutmeg",
    "preferably",
    "kosher",
    "salt",
    "black",
    "pepper",
    "eggs"
  ],
  "directions": [
    "0",
    "Directions",
    "1. Prepare the Basic Butter Pastry. Chill half while you make the filling. (Freeze the remaining half for another use.) Preheat the oven to 375°F.",
    "2. Scrub the potatoes and cut them into 1 1/2 inch pieces (about 2 cups); place them in a medium saucepan. Add cold salted water to cover by 1 inch. Bring the water to a boil over high heat; reduce the heat to low and simmer the potatoes for 15 to 20 minutes, or until they are tender when pierced with a knife.",
    "3. Meanwhile, finely chop the onion (about 1 cup). Thoroughly rinse and spin dry the greens, remove the tough stems, and coarsely chop the leaves (about 24 cups). (If using chard, the stems will be tender; reserve them to stir-fry for another meal.)",
    "4. Heat the olive oil in a large skillet over medium heat until hot. Reduce the heat to medium-low; add the onion and cook for 5 minutes or until it has softened. Press in the garlic (about 2 teaspoons) and cook for 1 minute. Add half the greens and cook 4 to 5 minutes, or until they have wilted. Remove the greens with tongs to a medium bowl. Repeat with the remaining half of the greens. Return the first batch of greens to the skillet and cook for 2 minutes more, or until any liquid that collected in the skillet has evaporated.",
    "5. When the potatoes are done, drain and mash them with a potato masher. Combine the potatoes and the greens mixture in a large bowl and set aside to cool slightly.",
    "6. Meanwhile, roll out the pastry between lightly floured sheets of wax paper to make a 12-inch round; pat the edges of the pastry to make the round even. Fit the pastry into a 9-inch pie plate; press against the sides of the plate, allowing the excess to hang over the edges. Put the pie plate in the fridge while you prepare the remaining ingredients.",
    "7. Grate the Gruyére (about ½ cup) and Parmigiano-Reggiano (about 2/3 cup Microplane-grated or about 1/3 cup grated on the fine side of a box grater); fold the cheeses into the potato mixture along with the ricotta, nutmeg, and salt and pepper to taste.",
    "8. Lightly beat the eggs, reserve 1 tablespoon. Stir the rest of the eggs into the potato mixture and spoon the filling into the pastry-lined pie plate. Gently lift the overhanging pastry over the filling, pleating as necessary to make it fit. (It will make a 1- to 1 ½ inch border covering the edges of the filling, which will be uncovered in the center.) Brush the pastry with the reserved 1 tablespoon egg.",
    "9. Bake the pie for about 40 minutes or until the filling is heated through and the pastry is golden. Let stand for 10 minutes before cutting."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "½ recipe Basic Butter Pastry (see recipe below)",
    "or store-bought pastry for a single crust pie",
    "3/4 pound small boiling potatoes, such as Yukon gold or Red Bliss",
    "1 medium onion",
    "2 pounds cooking greens, such as chard, spinach, collards, mustard, or a mixture",
    "2 T extra virgin olive oil",
    "2 garlic cloves",
    "2 oz Gruyére cheese",
    "1 oz Parmigiano-Reggiano",
    "1 c ricotta",
    "1/8 t nutmeg (preferably freshly grated)",
    "Kosher salt and freshly ground black pepper",
    "2 large eggs"
  ],
  "__v": 1
}