{
  "hash": "62ba61cbf90421d5c052cbcaeca40a5d5b18ac9b",
  "title": "Spicy Steak Salad Wraps",
  "image": "",
  "href": "https://www.bonappetit.com/recipe/spicy-steak-salad-wraps",
  "extension": "Chrome",
  "firstAdded": "2018-07-30T19:52:00.334000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Whisk garlic, sugar, 2 Tbsp. adobo, 2 Tbsp. lime juice, and 2 Tbsp. oil in a small bowl to combine. Season steak with salt and pepper and place in a large resealable plastic bag; add marinade. Seal bag and massage steak to coat. Let sit at room temperature 15 minutes, or chill, turning bag occasionally, up to 4 hours.",
    "Whisk yogurt, remaining 1 Tbsp. adobo, remaining 1 Tbsp. lime juice, and ¾ tsp. salt in a small bowl; set aside for serving.",
    "Remove steak from marinade, allowing any excess to drip back into bag, and lightly pat dry with paper towels. Heat remaining 1 Tbsp. oil in a large cast-iron skillet over high until just beginning to smoke. Cook steak, turning occasionally, until deeply browned and an instant-read thermometer inserted into the thickest part registers 130° for medium-rare, 4–8 minutes, depending on the thickness of the meat. Transfer steak to a cutting board and let rest 10 minutes before slicing against the grain.",
    "Arrange steak, lettuce, radishes, cilantro, and lime wedges on a platter or a couple of plates so that each component is visible and easily accessible. Place corn nuts in a small bowl. Serve with reserved spicy yogurt for spooning into wraps."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "2 garlic cloves, finely grated",
    "1¼ tsp. sugar",
    "3 Tbsp. adobo (from a can of chipotles in adobo), divided",
    "3 Tbsp. fresh lime juice, divided",
    "3 Tbsp. extra-virgin olive oil, divided",
    "1 lb. skirt steak, cut crosswise into 3 equal pieces",
    "¾ tsp. kosher salt, plus more",
    "Freshly ground black pepper",
    "¾ cup plain Greek yogurt",
    "2 small or 1 large head of iceberg lettuce, leaves separated, covered, chilled",
    "6 radishes, trimmed, thinly sliced, covered, chilled",
    "Cilantro leaves with tender stems and lime wedges (for serving)",
    "½ cup lightly crushed corn nuts"
  ],
  "__v": 1
}