{
  "hash": "80fc7e22cf1b498ddfd790eb5268922dfb2b879c",
  "title": "Spanish Roasted Potatoes with Tomato Sauce",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2011/09/spanish-potatoes-vertical-b-640.jpg",
  "href": "http://www.simplyrecipes.com/recipes/spanish_roasted_potatoes_with_tomato_sauce/",
  "extension": "",
  "firstAdded": "2017-07-14T02:18:02.687000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Preheat oven to 375°F. Toss the potatoes with 3 tablespoons of olive oil and salt well. Arrange in one layer in a casserole pan or rimmed baking tray and roast until browned, about 50 minutes.",
    "2 While the potatoes are roasting, make the sauce. Heat 2 tablespoons of olive oil in a medium pot set over medium-high heat. Sauté the chopped onions, stirring occasionally, for 4-5 minutes, or until they begin to brown on the edges. Add the garlic and sauté another 2 minutes.",
    "3 Add the white wine to the pan and turn the heat to high. Boil on a high boil until the wine is reduced by half, then add the tomato paste and stir to combine. Add the crushed tomatoes, Tabasco sauce, salt, sugar and smoked paprika. Stir well and reduce the heat to a bare simmer. Let the sauce cook slowly while the potatoes roast. If you want, you can use a blender or an immersion blender to purée the sauce until smooth.",
    "4 When the potatoes are well browned, toss with the tomato sauce and return to the casserole pan. Continue to roast until the tomato sauce dries out a bit on the potatoes and caramelizes, about 10 minutes.",
    "Serve with the remaining tomato sauce as an appetizer or side dish."
  ],
  "ingredients": [
    "0",
    "2 pounds Yukon gold potatoes, or other waxy potato (peeled or un-peeled, your choice), cut into 1 to 1 1/2-inch chunks",
    "Olive oil",
    "Salt",
    "1/2 medium yellow onion, chopped",
    "3 garlic cloves, chopped",
    "1/2 cup white wine (can substitute stock)",
    "2 Tbsp tomato paste",
    "A 14-ounce can of crushed tomatoes",
    "2 teaspoons Tabasco or other hot sauce",
    "1 teaspoon smoked paprika",
    "1 teaspoon salt",
    "1 teaspoon sugar"
  ],
  "__v": 1
}