{
  "hash": "f320230171b45fa8011ce41872bc59017e1f1336",
  "title": "Homemade McDonald's McGriddles",
  "image": "http://hilahcooking.com/wp-content/uploads/2013/05/mcgriddles.jpg",
  "href": "http://hilahcooking.com/homemade-mcdonalds-mcgriddles/",
  "extension": "",
  "firstAdded": "2015-04-23T07:46:37.234000",
  "users": [
    null
  ],
  "keywords": [
    "maple",
    "syrup",
    "batch",
    "pancake",
    "batter",
    "eggs",
    "strips",
    "bacon",
    "pork",
    "sausage",
    "patties",
    "slices",
    "american",
    "cheese"
  ],
  "directions": [
    "0",
    "Before you start the maple sugar, line a baking sheet with parchment paper or a silpat if you have one. Set aside.",
    "Pour the syrup in a small pot and put over medium heat. Bring to boil, stirring frequently. Once it starts to boil heavily, make sure you keep stirring to keep it from attaching to the pot.",
    "After a minute, check the temperature if you have a thermometer. When the syrup reaches about 230ºF it will begin to \"calm down\" and be less frighteningly lava-like. You should notice it get slightly darker, as well.",
    "Two-three minutes later: Once it's gotten quite dark and just when you notice a twinge of caramel-smell, remove from heat. At that point it should be 265ºF on a thermometer.",
    "Pour the maple syrup out onto your lined baking sheet and spread thinly. DO NOT TOUCH IT. It's hot as molten lead (almost). Let cool. Pop it in the fridge if you're in a hurry. Once cool, you can peel it off the paper in chunks and break it up by smashing it in some fashion.",
    "Phew. That's done. Now on to the pancakes. Make a single batch of my pancake recipe, or any recipe that will yield 8 4\" pancakes.",
    "If you're using round molds for your pancakes, grease the insides with a little butter. Heat your griddle over medium heat until hot. Smear some butter around on it and place as many pancake molds as you can on the griddle.",
    "Pour 2 tablespoons batter into each one, top with several maple crystals, pour 2 more tablespoons on top of that. The idea is to sandwich the crystals within the pancakes do avoid maple sugar sticking all over your griddle and being a pain.",
    "Cook until bubbles appear around the edges AND the edges of the cakes look cooked. Remove the rings with tongs and flip the cakes. Cook another 1-2 minutes until done.",
    "Top with a slice of cheese, scrambled or fried egg, bacon or sausage, and another pancake.",
    "Eat right away! Or cool and freeze for a rainy day."
  ],
  "ingredients": [
    "0",
    "½ cup maple syrup",
    "1 batch of pancake batter",
    "4 eggs",
    "4 strips bacon, cooked and cut in half (or 4 cooked pork sausage patties)",
    "4 slices American cheese"
  ],
  "__v": 1
}