{
  "hash": "c5b32a9c5899925f9a00ca60eaba347f0faa6217",
  "title": "CAULIFLOWER CRUSTED GRILLED CHEESE SANDWICHES",
  "image": "https://uz71pyzpz0-flywheel.netdna-ssl.com/wp-content/uploads/2015/08/cauliflower-grilled-cheese-8-330x330.jpg",
  "href": "https://kirbiecravings.com/cauliflower-crusted-grilled-cheese-sandwiches",
  "extension": "Chrome",
  "firstAdded": "2018-04-15T14:40:04.950000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 450F. Place cauliflower into food processor and pulse until crumbs about half the size of a grain of rice.",
    "Place cauliflower into large microwave safe bowl and microwave for 2 minutes. Your cauliflower should be soft and tender (and hot!). (If you don't want to use the microwave to dry out the cauliflower and prefer to steam and wring with a cloth to dry, check out my wringing instructions here.)",
    "Stir cauliflower to mix up the bottom and top cauliflower. Place back into the microwave and cook for another 3 minutes. Remove and stir again so that all the cauliflower cooks evenly. Place back into microwave and cook for 5 minutes. At this point, you should see the cauliflower is starting to become more dry. Microwave for another 5 minutes. Cauliflower should still be slightly moist to the touch, but should look dry and clumped up (like photo above; similar to as if someone had chewed it up and spit it back out.) If you've made cauliflower pizza or breadsticks with the cloth wringing dry method, it should look the same.",
    "Allow cauliflower to cool for a few minutes. Then add in egg and cheese. Stir to combine until smooth paste forms. Stir in seasoning. Divide dough into 4 equal parts. Place onto large baking sheet lined with parchment paper. Using your knuckles and fingers, shape into square bread slices about 1/3 inch thick. Bake cauliflower bread for about 15-18 minutes or until golden brown. Remove from oven and let cool a few minutes.",
    "Using a good spatula, carefully slide cauliflower bread off of parchment paper. Now you are ready to assemble your sandwiches. You can do this a few different ways. You can either cook on the stove top as you would normally cook a grilled cheese. You can also place sandwiches into toaster oven and broil for several minutes (5-10) until cheese is completely melted and"
  ],
  "ingredients": [
    "0",
    "1 medium head of cauliflower (raw), cut into small florets and stem removed",
    "1 large egg",
    "1/2 cup shredded Parmesan cheese",
    "1 tsp Italian herb seasoning",
    "2 thick slices of white cheddar cheese (you can also use shredded cheddar cheese)"
  ],
  "__v": 1
}