{
  "hash": "a0487ce651f3749a9bad5cd3e0bcd383c735d653",
  "title": "Vegetarian Singapore Noodles",
  "image": "https://thewoksoflife.com/wp-content/uploads/2018/09/vegetarian-singapore-noodles-13.jpg",
  "href": "https://thewoksoflife.com/2018/09/vegetarian-singapore-noodles/",
  "extension": "Chrome",
  "firstAdded": "2018-09-30T19:03:46.570000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "In a large bowl, soak the mei fun dried rice noodles in 8 cups of hot water for 30 to 45 minutes minutes. Drain the rice noodles in a colander and set aside.",
    "Prepare the vegetables and set them aside. The dish comes together quickly, so it helps to put them on plates ready to go by the stove. If using dried mushrooms, soak them for at least 30 minutes in hot water. (For other tips, see our Chinese Dried and Preserved Ingredients page.) When preparing the fresh leeks, they should be julienned first and then washed 2 to 3 times, as they are quite sandy.",
    "Combine 1 teaspoon turmeric powder, 1½ tablespoons Malaysian curry powder, 2 teaspoons salt, 1¼ teaspoons sugar, and ⅛ teaspoon ground white pepper. Set aside.",
    "Heat your wok to medium heat, and add ¼ cup of vegetable oil around the perimeter of the wok.",
    "Stir the garlic into the oil, and immediately add the Shiitake mushrooms, bell pepper, carrots, cabbage, broccoli, and ⅔ of your leeks. Turn the heat up to the highest setting.",
    "Stir-fry everything together for 1 minute, and add the spices you prepared earlier along with 1 tablespoon of Shaoxing wine.",
    "Next, add the mei fun dried rice noodles and stir fry everything together for another 5-6 minutes until well combined and the rice noodles are warmed through. Cover the wok for 1 minute if you feel it’s not hot enough or if the noodles are not lightly sizzling. A quiet wok at this point means there’s not enough heat! If your stove heat is not very strong, warming the noodles may take longer, and they may start to dry out. If this happens, add 2 tablespoons of water around the perimeter of the wok.",
    "When steam starts rising from your noodles and they’re nearly done, add the other ⅓ of the leeks to the mixture. Stir fry for another minute, incorporating the leeks. A fresh and slightly more raw onion flavor is what we’re going for! Transfer to a dish and serve immediately"
  ],
  "ingredients": [
    "0",
    "8 ounces mei fun dried rice noodles",
    "3 ounces fresh Shiitake mushrooms, or 4 to 5 reconstituted dried shiitake mushrooms, sliced",
    "1 small yellow or red bell pepper, julienned",
    "1 medium carrot, julienned",
    "6 ounces napa cabbage, julienned",
    "3 ounces broccoli florets, cut into small pieces",
    "5 ounces leeks, julienned and thoroughly washed",
    "1 teaspoon turmeric powder",
    "1½ tablespoons Malaysian curry powder",
    "2 teaspoons salt",
    "1¼ teaspoons sugar",
    "⅛ teaspoon fresh ground white pepper",
    "¼ cup vegetable oil",
    "2 cloves garlic, chopped",
    "1 tablespoon Shaoxing wine",
    "2-3 tablespoons hot water"
  ],
  "__v": 1
}