{
  "hash": "528b529bf6629b1c2c52e5c02c1cd8680b1d0c69",
  "title": "CHERRY JAM - LOW SUGAR",
  "image": "",
  "href": "http://www.freshpreserving.com/recipes/jam-maker/cherry-jam-low-sugar",
  "extension": "Chrome",
  "firstAdded": "2015-07-13T22:32:13.718000",
  "users": [
    null
  ],
  "keywords": [
    "cherries",
    "lbs",
    "ball",
    "realfruit",
    "low",
    "nosugar",
    "needed",
    "pectin",
    "bottled",
    "lemon",
    "juice",
    "butter",
    "margarine",
    "granulated",
    "sugar",
    "honey"
  ],
  "directions": [
    "0",
    "WASH, stem and pit cherries. Coarsely chop cherries using kitchen scissors or chef’s knife, and then crush with a potato masher. Measure required quantity of crushed cherries and remaining ingredients for your recipe; set aside.",
    "SPRINKLE pectin evenly over bottom of the Pot fitted with the Stirrer. Add crushed cherries evenly over pectin. Pour lemon juice evenly over cherries. Add butter/margarine to help reduce foaming.",
    "PRESS Jam button – the cook time will automatically default to 21 minutes. Press enter.",
    "WAIT 4 minutes for appliance to sound 4 short beeps indicating that it is time to add sweetener. Add sugar, sugar substitute or honey gradually while Stirrer continues running. Place the Glass Lid on the Pot.",
    "THE APPLIANCE will continue to automatically stir your ingredients while it cooks. Stay within earshot of the Jam & Jelly Maker, the appliance will beep again at the end of the process signaling jam cooking is complete. Press cancel, unplug the appliance and immediately remove Glass Lid.",
    "REMOVE Stirrer using a pot holder. Skim foam, if necessary, from top of jam.",
    "PRESERVE the low sugar cherry jam immediately, using 1 of the 3 ways listed here.",
    "Sour Cherry Variation: Prepare sour cherries and measure as for Sweet Cherry Jam. Omit lemon juice. Proceed with Sweet Cherry Jam recipe above"
  ],
  "ingredients": [
    "0",
    "3-2/3 cups crushed sweet cherries (about 2 1/4 lbs)",
    "3 Tbsp Ball® RealFruit™ Low or No-Sugar Needed Pectin",
    "2 Tbsp bottled lemon juice",
    "1/2 tsp butter or margarine",
    "Up to 1 cup granulated sugar, sugar substitute, or honey"
  ],
  "__v": 3
}