{
  "__v": 1,
  "directions": [
    "0",
    "First take care of the quinoa. Add a half cup of water to a pot with a pinch of salt and simmer it. Once simmering, add the quinoa and cook until the water is absorbed. Don’t leave any water in the pot and this will make the bean mix even looser.",
    "Process the beans, onion, garlic, mushrooms, jalapeño and tahini into a smooth mixture. It may seem a bit dry at first, but it should smooth out after a second.",
    "Remove the mix to a bowl and add the rest of the ingredients, including the cooked quinoa. Mix well. This mix will seem very loose and make you think, “No f***ing way is this going to work,” but the flax and oat bran will take a few minutes to fully absorb what liquid they can.",
    "Cover a sheet tray with wax paper or a silpat and form your sliders as best you can. I used roughly 1/3 cup per slider. Place them on the paper or silpat and when you are finished, put the tray in the freezer for at least 30 minutes. I went for 40 minutes and they were easy to work with at that point.",
    "Heat about 1/8″ vegetable oil in a heavy pan on medium high. Once hot, very gently place 3-4 patties in the pan and fry for 4 minutes per side. If you have a fish spatula, this process is much easier. You can even slide the raw patties onto the spatula and lay them in the oil. To flip, don’t be afraid to use you fingers to help guide things in place. If you are too heavy handed, you make mash the slider or splash hot oil around when you flip them.",
    "The sliders will absorb some of the oil as they cook. If too much is absorbed after cooking a few, just add more and let it get hot before adding the next batch.",
    "Drain on paper towels and when ready to serve, garnish with avocado, sliced red onion, sriracha and jalapeño as a few suggestions."
  ],
  "firstAdded": "2014-08-12T21:46:07.579000",
  "hash": "a64d516ba70534671dbe65f8da1cbf6fe250fb81",
  "href": "http://www.kneadforfood.com/black-bean-quinoa-sliders/",
  "image": "http://www.kneadforfood.com/wp-content/uploads/2014/02/Black-Bean-Sliders-Final.jpg",
  "ingredients": [
    "0",
    "2 Cans Black Beans, drained and rinsed",
    "1 Small Red Onion diced",
    "3 Cloves Garlic minced",
    "4oz Button Mushrooms diced",
    "1 Jalapeño sliced",
    "1/4 Cup Flax Meal",
    "1/2 Cup Oat Bran",
    "1/4 Cup Tahini",
    "1/4 Cup Quinoa",
    "1/3 Cup Cilantro chopped",
    "2 Tspn Cumin Seeds toasted and ground",
    "1 Tspn Coriander Seeds toasted and ground",
    "Salt and Pepper",
    "Vegetable Oil for Frying"
  ],
  "keywords": [
    "black",
    "beans",
    "rinsed",
    "red",
    "onion",
    "garlic",
    "button",
    "mushrooms",
    "jalapeo",
    "flax",
    "meal",
    "oat",
    "bran",
    "tahini",
    "quinoa",
    "cilantro",
    "tspn",
    "cumin",
    "seeds",
    "coriander",
    "salt",
    "pepper",
    "oil",
    "frying"
  ],
  "title": "Black Bean Quinoa Sliders",
  "users": [
    null
  ]
}