{
  "hash": "03454aaf93d2ce9c44bd974a99d316b812027282",
  "title": "Anneau au bacon, oeufs et fromage pour le brunch",
  "image": "https://images-gmi-pmc.edge-generalmills.com/2c57833d-9e14-40f0-af45-6f657aaaab59.jpg",
  "href": "https://www.lifemadedelicious.ca/recipes/anneau-au-bacon-oeufs-et-fromage-pour-le-brunch/bde5237d-8236-4fb1-9349-350bc7d1db56",
  "extension": "",
  "firstAdded": "2019-04-10T20:44:17.853000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Étapes",
    "Préchauffer le four à 375 °F (190 °C). Tapisser de papier sulfurisé une grande plaque à biscuits. Dans une poêle de 10 po (25 cm), faire cuire le bacon à feu moyen environ 4 minutes ou jusqu'à ce qu'il soit cuit sans être croustillant, en le retournant une fois. (Il continuera de cuire au four.) Réserver le bacon ; égoutter de la poêle tout le gras de cuisson du bacon excepté 2 cuillères à thé.",
    "Dans un bol moyen, battre à la fourchette ou au fouet 1/3 tasse du lait, les oeufs, le sel et le poivre, jusqu'à ce que le tout soit bien mélangé. Ajouter le poivron. Verser la préparation aux oeufs dans la poêle. À mesure que le mélange chauffera, une partie des oeufs commencera à coaguler. Pousser délicatement les portions cuites vers le pourtour de la poêle avec une spatule en métal. Ne pas remuer constamment. À mesure que des portions d'oeufs coagulent, les pousser vers le pourtour et les placer sur le dessus du mélange déjà ferme. Cuire de 5 à 6 minutes ou jusqu'à ce que la préparation aux oeufs ait épaissi uniformément, tout en étant encore tendre et humide.",
    "Dérouler la pâte et la diviser en 8 triangles. Sur une plaque à biscuits recouverte de papier sulfurisé, disposer les triangles en plaçant les côtés plus étroits au centre et les superposer en forme d'étoile en laissant un cercle de 4 po (10 cm) ouvert au milieu (voir le diagramme). Les pointes de pâte à croissant pourraient dépasser des rebords de la plaque à biscuits. Appuyer sur la pâte superposée pour l'aplatir.",
    "Placer du bacon sur chacun des triangles. Saupoudrer 1/3 tasse du fromage sur la partie la plus large de la pâte. Déposer les oeufs à la cuillère par-dessus le fromage. Saupoudrer de ⅓ tasse du fromage. Ramener les pointes des triangles par-dessus les oeufs et le fromage, et les glisser sous la pâte pour former un anneau (la garniture sera visible). Badigeonner délicatement la pâte avec la cuillère à soupe restante de lait ; saupoudrer du ⅓ tasse de fromage restant.",
    "Faire cuire de 20 à 25 minutes ou jusqu'à ce que la pâte soit bien dorée. Laisser refroidir 2 minutes. À l'aide d'une spatule large, dégager doucement l'anneau de la plaque à biscuits ; le glisser délicatement sur un plat de service. Garnir de coriandre fraîche et de salsa."
  ],
  "ingredients": [
    "0",
    "4 tranches de bacon, coupées en deux sur le sens de la largeur",
    "1/3 t. (75 mL) plus 1 c. à soupe (15 mL) de lait",
    "4 oeufs, légèrement battus",
    "Sel et poivre, si désiré",
    "1/4 t. (50 mL) de poivron rouge, haché",
    "1 boîte de croissants Pillsbury* Original (pâte pour 8 croissants)",
    "1 t. (250 mL) de mélange mexicain de fromages râpés",
    "Coriandre fraîche, hachée, si désiré",
    "1 t. (250 mL) de Salsa Gros morceaux Old El Paso*, si désiré"
  ],
  "__v": 1
}