{
  "hash": "dedd75deafd2f672542f91e9ebe8ca7be7ca0baf",
  "title": "White Beans with Spinach & Sausage",
  "image": "http://i2.wp.com/69.195.124.110/~itsmysid/wp-content/uploads/2012/06/beanplate.jpg?resize=300%2C400",
  "href": "http://itsmysideoflife.com/2012/06/white-beans-and-spinac/",
  "extension": "Chrome",
  "firstAdded": "2016-09-07T20:42:31.188000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "If using dry beans, soak over night in hot water with lid on. A trick- boil water, pour beans in , cover with lid let it sit. In the morning, rinse out then head on to the next step.",
    "Sausage– I cook the sausage in a cast iron skillet before adding to the beans. I like to sear it well on the sides then cut it up ( if using sausage links). Once it’s all cooked I add it along with whatever juice/grease that the sausage made from the pan and add it into the beans. If you cook in anything other than a cast iron skillet a little oil would help in the pan but I never add anything in the cast iron . ***",
    "Pour chicken broth and garlic into a large pot. Place on medium high heat and bring to a simmer. Add in the oil and oregano then beans. Stir it up before adding in tomatoes. Heat through till the beans are tender. It takes about an hour or more depending on heat variation. If using canned it won’t take long at all. Once beans are tender add in the spinach and cook just until the leaves are wilted. Stir it in and sprinkle cracked pepper on top.",
    "Simple dish you can dress up or dress down. I like serving this along side ribs, or any BBQ dish. I also mash up the beans that are left over and make quesadillas out of them, perfect for lunch time.",
    "Slow-cooker directions, Follow everything above but instead of a pot put it all into the slow-cooker. Cook sausage in a pan still, you want that nice flavor from the sear. . These small beans are small and will turn to mash for any longer than 4 hours. ( my slow cooker even on low runs hot) Low, 4hrs or until beans are tender. Add in the greens at the end."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "3/4 pound kielbasa (turkey or chicken work great if you don’t’ want to use beef!)",
    "2 cups chicken broth (vegetable broth works great in a pinch as well!)",
    "2 cloves of garlic",
    "1 teaspoon dried oregano",
    "1 tablespoon olive oil",
    "2 cups Cannellini beans (you can use canned if needed make sure you rinse them as well)* see my suggestion above if using dry beans",
    "Two medium sized tomatoes diced up really small, it should come to about 1 cup or more",
    "6 cups baby spinach leaves",
    "Freshly cracked pepper to taste"
  ],
  "__v": 1
}