{
  "hash": "6908186e68e8187c0e1f070776151db7abf6761a",
  "title": "Deep-Fried Turkey",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/alton-brown/deep-fried-turkey-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-11-23T17:53:18.021000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place the hot water, kosher salt and brown sugar into a 5-gallon upright drink cooler and stir until the salt and sugar dissolve completely. Add the ice and stir until the mixture is cool. Gently lower the turkey into the container. If necessary, weigh down the bird to ensure that it is fully immersed in the brine. Cover and set in a cool dry place for 8 to 16 hours.",
    "Remove the turkey from the brine, rinse and pat dry. Allow to sit at room temperature for at least 30 minutes prior to cooking.",
    "Place the oil into a 28 to 30-quart pot and set over high heat on an outside propane burner with a sturdy structure. Bring the temperature of the oil to 250 degrees F. Once the temperature has reached 250, slowly lower the bird into the oil and bring the temperature to 350 degrees F. Once it has reached 350, lower the heat in order to maintain 350 degrees F. After 35 minutes, check the temperature of the turkey using a probe thermometer. Once the breast reaches 151 degrees F, gently remove from the oil and allow to rest for a minimum of 30 minutes prior to carving. The bird will reach an internal temperature of 161 degrees F due to carry over cooking. Carve as desired.",
    "Recipe courtesy of Alton Brown, 2006"
  ],
  "ingredients": [
    "0",
    "6 quarts hot water",
    "1 pound kosher salt",
    "1 pound dark brown sugar",
    "5 pounds ice",
    "1 (13 to 14-pound) turkey, with giblets removed",
    "Approximately 4 to 4 1/2 gallons peanut oil*",
    "*Cook's Note: In order to determine the correct amount of oil, place the turkey into the pot that you will be frying it in, add water just until it barely covers the top of the turkey and is at least 4 to 5 inches below the top of the pot. This will be the amount of oil you use for frying the turkey."
  ],
  "__v": 1
}