{
  "hash": "716524b7e1f6ba5aa6405b4ff122f3e0071e5f98",
  "title": "Can’t-F***-It-Up Eggs Benedict",
  "image": "https://d3awvtnmmsvyot.cloudfront.net/api/file/HpMQUJcRTLaeNUapVkzD/convert?fit=max&w=2300&quality=60&cache=true&rotate=exif&compress=true",
  "href": "https://www.chefsteps.com/activities/can-t-f-it-up-eggs-benedict",
  "extension": "Chrome",
  "firstAdded": "2017-11-30T01:16:22.541000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "About 2 hours before brunch, preheat Joule to 147 °F / 64 °C",
    "One of the greatest benefits of sous vide is flexibility. Yes, you have to start this process two hours in advance, but guess what? All you do is put some eggs and some ingredients for hollandaise into a pot of preheated water, and then you’re free to prep your muffins, drink some mimosas, and hang out with your friends until just before go time. Doesn’t that sound relaxing? This is Saturday morning, after all—it should be chill AF.",
    "What’s this Joule you speak of?",
    "Joule is a sleek and powerful sous vide tool made by our very own team here at ChefSteps. Joule is really good at cooking proteins like steak exactly the way you like them, but it’s got lots of other special talents too. One of them is brunch. Watch the video above to see why, then order your very own Joule!",
    "Make shallot and vinegar reduction",
    "40 g",
    "Champagne vinegar",
    "25 g",
    "Shallots, minced",
    "Combine vinegar and shallots in a small pot.",
    "Over high heat, reduce liquid by half.",
    "Strain to remove shallots (optional).",
    "Combine ingredients for hollandaise",
    "150 g",
    "Butter, salted",
    "85 g",
    "Egg yolk",
    "60 g",
    "Water",
    "20 g",
    "Lemon juice",
    "20 g",
    "Vinegar reduction, strained, from above",
    "3 g",
    "Salt, kosher",
    "Dump everything in a ziplock-style bag, and lower it into the bath. No need to mix it ahead of time.",
    "NOTE: Your reduction will be a little heavier if you don’t strain out the shallots, so use 25 g instead.",
    "Start cooking the hollandaise",
    "Let the hollandaise cook at 147 °F / 64 °C for 1–2 hours, or until you’re ready to serve brunch. (You can technically leave it in longer, but it’ll get thicker the longer you leave it in.)",
    "Cooking the ingredients sous vide means you can throw everything in a blender right before breakfast, and your hollandaise will come out velvety smooth.",
    "Add eggs to the same pot",
    "Eggs",
    "While the hollandaise is cooking, pop all your eggs into another ziplock-style bag. (You can cook eggs directly in the water, but the bag makes it easier to lift them out when you’re done.) If the bag floats, just scoop some of the cooking water into it until it sinks.",
    "The eggs can cook at the exact same temperature and for the same amount of time as the hollandaise, so just put them in the same pot.",
    "CHEF’S TIP: Eggs cooked at 147 °F / 64 °C turn out nice and gooey on the inside. If you like your eggs a different way, use our Egg Calculator to pick your perfect temp, but remember: if you choose a different time-and-temperature combination for your eggs, you’ll have to cook them separately from the hollandaise. The beauty here lies in the simplicity—two things, one pot!",
    "About an hour before brunch, toast some muffins",
    "English muffins",
    "-",
    "Butter, salted, as needed",
    "Preheat your oven to 200 °F / 93 °C.",
    "Halve the English muffins, and spread some butter on each half. In a skillet over high heat, toast the muffin halves four at a time. Press down on them with another skillet to get an extra-crispy crust.",
    "Put ham on those muffins",
    "-",
    "Ham, thinly sliced, as needed",
    "Lay your muffins, nook-and-cranny side up, on a baking sheet. Top each one with a little ham nest, leaving a space in the center to put the egg in later.",
    "We make ham nests so the eggs won’t slide off when you’re ready to serve those Benedicts. After all, if you’re going to be a hero, this brunch can’t just taste good; it’s gotta look good too.",
    "Keep everything toasty in the oven",
    "In your 200 °F / 93 °C preheated oven, reserve the ham and muffins until you’re ready to eat. Put some plates in there too so you can serve each masterpiece on a nice, warm palette.",
    "Mince dill",
    "-",
    "Dill, fresh, as needed",
    "Mince up some dill; set aside.",
    "Bring it all together",
    "Blend hollandaise",
    "About 20 minutes before go time, take that bag of hollandaise out of the water. It’s going to look all greasy and separated, but don’t stress. It’ll come together just fine.",
    "Blend everything on medium until it looks nice and fluffy and light yellow.",
    "Plate up the muffins",
    "Put two muffin halves on each plate so you can crack all the eggs at once in the next step.",
    "Crack and serve eggs",
    "Pull those eggs out of the water and put them in a bowl nearby. Rest a slotted spoon in another bowl right next to the eggs.",
    "Now carefully crack each egg over the slotted spoon so that the excess runny white drains into the bowl. Transfer the egg to a ham nest. Repeat until all the ham nests are topped with eggs.",
    "Pour on hollandaise, and make ’em pretty",
    "Pour hollandaise straight from the blender onto each egg. You can just eyeball the amount—be conservative at first so you don’t run out.",
    "Sprinkle on the minced dill. Add other herbs and spices if you want—we like a dusting of paprika."
  ],
  "ingredients": [
    "0",
    "40 g",
    "Champagne vinegar",
    "25 g",
    "Shallots, minced",
    "150 g",
    "Butter, salted, plus more for muffins",
    "85 g",
    "Egg yolk",
    "60 g",
    "Water",
    "20 g",
    "Lemon juice",
    "3 g",
    "Salt, kosher",
    "12",
    "Eggs",
    "6",
    "English muffins",
    "-",
    "Ham, thinly sliced, as needed",
    "-",
    "Dill, fresh, as needed"
  ],
  "__v": 1
}