{
  "hash": "fe867625c8891be8e65443f058fe6df7e193ce7c",
  "title": "Unstuffed Bell Peppers",
  "image": "http://static.budgetbytes.com/wp-content/uploads/2014/08/Unstuffed-Peppers-skillet-spoon.jpg",
  "href": "http://www.budgetbytes.com/2014/08/unstuffed-bell-peppers/",
  "extension": "Chrome",
  "firstAdded": "2015-07-03T04:02:59.175000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "clove",
    "garlic",
    "medium",
    "onion",
    "beef",
    "bell",
    "peppers",
    "tomatoes",
    "uncooked",
    "white",
    "rice",
    "basil",
    "oregano",
    "cracked",
    "pepper",
    "broth",
    "tomato",
    "worcestershire"
  ],
  "directions": [
    "0",
    "Mince the garlic and dice the onion and bell peppers. In a heavy skillet, sauté the garlic and onion in olive oil over medium heat until soft and transparent (2-3 minutes). Add the ground beef and cook until fully brown (5 minutes). Lastly, add the diced bell pepper to the skillet and continue to sauté until they are slightly soft (3-5 minutes).",
    "Add the diced tomatoes and their juices to the skillet along with the uncooked rice, basil, oregano, and some freshly cracked pepper (10-15 cranks of a pepper mill). Stir the ingredients in the skillet well.",
    "Add 1.5 cups of beef broth to the skillet and stir to combine. Place the lid on the skillet, turn the heat up to high, and allow the mixture to come up to a full boil. Once it reaches a boil, turn the heat down to low and let it simmer for 30 minutes. You should be able to hear the liquid simmering quietly the whole time. If you can't, turn the heat up just slightly until it begins to simmer.",
    "After 30 minutes, remove the lid, and check to see if the rice is tender and most of the liquid has been absorbed. If the rice is still a bit crunchy, return the lid and allow it to continue to cook for 10 minutes more.",
    "Once the rice is tender, fluff the mixture with a fork. In a separate bowl, combine the tomato sauce and worcestershire sauce. Pour the tomato sauce over the skillet and serve."
  ],
  "ingredients": [
    "0",
    "1 Tbsp olive oil $0.16",
    "1 clove garlic $0.08",
    "1 medium onion $0.42",
    "½ lb. ground beef $2.25",
    "2 medium bell peppers $1.98",
    "1 (15 oz.) can diced tomatoes $1.69",
    "1 cup uncooked white rice $0.33",
    "1 tsp basil $0.10",
    "1 tsp oregano $0.10",
    "Freshly cracked pepper $0.05",
    "1½ cups beef broth $0.20",
    "1 (8 oz.) can tomato sauce $0.99",
    "1 tsp worcestershire sauce $0.02"
  ],
  "__v": 1
}