{
  "hash": "35609002c97acc98e4ec539ae08d1fafbed2bcac",
  "title": "CARNE AL TORO",
  "image": "http://www.javirecetas.com/images/57/carne-al-toro.jpg",
  "href": "http://javirecetas.hola.com/carne-al-toro-receta-facil/",
  "extension": "Chrome",
  "firstAdded": "2015-10-11T15:17:20.892000",
  "users": [
    null
  ],
  "keywords": [
    "ingredientes",
    "hacer",
    "carne",
    "toro",
    "para",
    "personas",
    "gramos",
    "vacuno",
    "ternera",
    "guisar",
    "cebolla",
    "mediana",
    "dientes",
    "ajo",
    "cucharadas",
    "aceite",
    "oliva",
    "hojas",
    "laurel",
    "rebanada",
    "pan",
    "tomate",
    "frito",
    "bote",
    "vino",
    "blanco",
    "vaso",
    "tubo",
    "cucharada",
    "cuarto",
    "especias",
    "caracoles",
    "usa",
    "una",
    "cuchara",
    "pequea",
    "pizca",
    "nuez",
    "moscada",
    "meidia",
    "postre",
    "sal"
  ],
  "directions": [
    "0",
    "Receta para hacer Carne al Toro (para dos personas):",
    "Pelamos la cebolla y la cortamos muy fina, muy fina (para que casi desaparezca en la salsa). Pelamos los dientes de ajo y los picamos también muy finos.",
    "Cogemos una cacerola de buen tamaño (para que entre toda la carne) y añadimos las cucharadas de aceite. Calentamos y añadimos la cebolla, el ajo picado, las dos hojas de laurel y la rebanada de pan.",
    "Pochamos las verduras durante 15 minutos o hasta que esté la cebolla traslúcida (sin quemarla) y después añadimos la carne cortada en tacos (dile al carnicero que la quieres para guisar y el mismo te la corta a trozos).",
    "Remueve bien la carne hasta que coja color por todos los lados (unos 10 minutos). Mientras tanto en un mortero machacamos las especias de caracoles con media cucharita de sal hasta que quede todo muy fino (casi polvo).",
    "Cuando la carne esté lista retira las hojas de laurel, el pan y desecha. Añade las especias molidas, el vino blanco, una pizca de nuez moscada rallada y remueve bien. Dejamos a fuego bajo hasta que el vino se haya reducido a la mitad, esta operación debe durar entre 60 y 90 minutos, así la carne de ternera quedará muy, muy blanda. No conviene tener el fuego fuerte, pues el vino se consumirá pronto y la carne se quedará algo dura, más dura que un toro",
    "Pasado este tiempo añade el tomate frito (de bote o de lata) y mezcla bien, deja al fuego unos 20 minutos para que se integre todo bien y listo.",
    "Sirve con unas patatas fritas y por supuesto con pan (mira la foto). Ojo que pica!!!",
    "A comer:",
    "Esta carne al toro no tiene ninguna complicación, es muy fácil de hacer, lo único que se tarda un rato, pero es una receta muy sencilla.",
    "Cuando estés dando color a la carne te puede pasar que ésta empiece a soltar agua. Si te pasa esto tienes dos opciones. Si la carne no ha cogido todavía color tendrás que esperar a que se consuma todo el líquido que ha soltado la carne antes de que puedas añadir las especias y el vino. Si la carne ya perdió el color a crudo por todos lados puedes añadir las especias y el vino sin esperar a que se consuma previamente el líquido, el único problema es que tardará más en reducir el líquido y tardarás algo más en comerte tu carne al toro. Pero tendrás la ventaja de que la carne se hará más lentamente y se pondrá más tierna.",
    "Por último ten cuidado con el picante, si quieres una carne al toro algo más conservadora échale solo 1 cucharada de especias y si la quieres más picante echa una cucharada y media, a mi me gusta así, pero pica"
  ],
  "ingredients": [
    "0",
    "Ingredientes para hacer Carne al Toro (para 2 personas):",
    "500 gramos de carne de vacuno (ternera) para guisar",
    "1 cebolla mediana (200 gramos)",
    "2 dientes de ajo",
    "4 cucharadas de aceite de oliva",
    "2 hojas de laurel",
    "1 rebanada de pan",
    "250 gramos de tomate frito (de bote)",
    "250 ml de vino blanco (1 vaso de tubo)",
    "1 cucharada y un cuarto de especias de caracoles (usa una cuchara pequeña)",
    "1 pizca de nuez moscada",
    "Meidia cuchara de postre con sal"
  ],
  "__v": 1
}