{
  "hash": "af40f72ac9a2561564425e639ee687e3acdef9b1",
  "title": "Glazed gammon steaks with pineapple",
  "image": "http://ukcdn.ar-cdn.com/recipes/xlarge/d394a148-7996-4de9-baf0-9dfd8b6b213a.jpg",
  "href": "http://allrecipes.co.uk/recipe/2944/glazed-gammon-steaks-with-pineapple.aspx",
  "extension": "Chrome",
  "firstAdded": "2016-04-04T17:02:35.237000",
  "users": [
    null
  ],
  "keywords": [
    "longgrain",
    "rice",
    "smoked",
    "gammon",
    "steaks",
    "ozeach",
    "trimmed",
    "fat",
    "pineapple",
    "rings",
    "natural",
    "juice",
    "mango",
    "chutney",
    "orange",
    "frozen",
    "peas",
    "sweetcorn",
    "cornflour",
    "pepper"
  ],
  "directions": [
    "0",
    "Cook the rice in a saucepan of boiling water for 10–12 minutes, or according to the packet instructions, until tender.",
    "Meanwhile, preheat the grill to high. Halve the gammon steaks and snip through the curved edges at intervals so the steaks will not curl during cooking. Put the steaks in the bottom of the grill pan and cook 5 cm (2 in) away from the heat for 5 minutes.",
    "Turn the steaks over. Drain the pineapple, reserving the juice, and cut each ring in half. Arrange 2 halves on each steak and sprinkle with a little pepper. Spread the mango chutney over the steaks and pineapple. Mix the pineapple juice from the can with the orange juice and pour around the steaks. Grill for 5 more minutes or until the gammon is cooked through.",
    "When the rice is tender, stir in the frozen vegetables. Cook for 2 minutes or until hot, then drain off any excess water. Spoon the rice onto plates, then place the gammon steaks and pineapple alongside.",
    "Pour the juices from the grill pan into a small saucepan, stir in the cornflour and bring to the boil. Cook, stirring, for 1–2 minutes or until thickened. Season with pepper, then drizzle over the rice and gammon.",
    "Some more ideas",
    "For a spicier topping, sprinkle some chopped fresh chilli or crushed dried chillies over the pineapple. * A delicious alternative to pineapple and mango is 1 small thinly sliced red onion, 1 diced Gala apple and 2 tbsp cranberry sauce. Make the sauce with 200 ml (7 fl oz) each apple and orange juice. * Instead of rice, cook 225 g (8 oz) bulghur wheat in 1.2 litres (2 pints) boiling chicken or vegetable stock for 10 minutes, then mix in the frozen vegetables."
  ],
  "ingredients": [
    "0",
    "250 g (8 1/2 oz) long-grain rice",
    "2 smoked gammon steaks, about 225 g (8 oz)each, trimmed of fat",
    "1 can pineapple rings in natural juice, about 227 g",
    "2 tbsp mango chutney",
    "300 ml (10 fl oz) orange juice",
    "1",
    "100 g (3½ oz) frozen peas",
    "100 g (3½ oz) frozen sweetcorn",
    "1 tbsp cornflour",
    "pepper"
  ],
  "__v": 2
}