{
  "hash": "01355df783f0bde83f9515b7a2f62d004ef7db27",
  "title": "Peanut Butter Chocolate Chunk Cookie Bars",
  "image": "http://cdn.averiecooks.com/wp-content/uploads/2013/03/pbchocolatecookiebars-19.jpg",
  "href": "http://www.averiecooks.com/2013/03/peanut-butter-chocolate-chunk-cookie-bars.html",
  "firstAdded": "2015-02-20T01:53:39.588000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "butter",
    "egg",
    "light",
    "brown",
    "sugar",
    "granulated",
    "vanilla",
    "heaping",
    "creamy",
    "peanut",
    "jif",
    "skippy",
    "use",
    "purpose",
    "flour",
    "baking",
    "soda",
    "salt",
    "semisweet",
    "roughly",
    "used",
    "trader",
    "joes",
    "dark",
    "chocolate",
    "bar"
  ],
  "directions": [
    "0",
    "Preheat oven to 350F. Line an 8-by-8-inch baking pan with aluminum foil, spray with cooking spray; set aside.",
    "In a large microwave-safe bowl, melt the butter, about 1 minute. Allow the butter to cool momentarily so you don't scramble the egg. Add the egg, sugars, vanilla, and stir vigorously to combine, for about 1 minute. Stir in the peanut butter. Add the flour, baking soda, optional salt and stir until just incorporated. Stir in chocolate. Turn batter out into prepared pan, smoothing it lightly with a spatula. Bake for 18 to 22 minutes, or until center is just set and golden (a toothpick test should come out clean if you hit dough but because of the abundance of chocolate, hitting chocolate is more likely). Bars will firm up more in pan as they cool.",
    "Allow bars to cool in pan for at least 30 minutes before slicing and serving. Store extra bars in an airtight container at room temperature for up to 1 week, or in the freezer for up to 3 months.",
    "Bars may be kept gluten-free by replacing the flour with your favorite gluten-free baking blend."
  ],
  "ingredients": [
    "0",
    "1/2 cup unsalted butter, melted (1 stick)",
    "1 large egg",
    "3/4 cup light brown sugar, packed",
    "1/4 cup granulated sugar",
    "1 tablespoon vanilla extract",
    "heaping 1/2 cup creamy peanut butter (like Jif or Skippy, do not use homemade)",
    "1 1/4 cups all purpose flour",
    "1/2 teaspoon baking soda",
    "pinch salt, optional and to taste",
    "6 to 7 ounces dark or semi-sweet chocolate, roughly chopped (I used Trader Joe's Dark Chocolate Pound Plus Bar, 54%)"
  ],
  "__v": 1
}