{
  "hash": "72d6af50d45fd77b35d794af76d71bbe657104c7",
  "title": "Skillet-Fried Chicken",
  "image": "http://images.meredith.com/rrmag/images/recipe/l_RU197258.jpg",
  "href": "http://www.rachaelraymag.com/recipe/skillet-fried-chicken/",
  "extension": "Chrome",
  "firstAdded": "2015-10-13T17:14:20.924000",
  "users": [
    null
  ],
  "keywords": [
    "dark",
    "brown",
    "sugar",
    "worcestershire",
    "hot",
    "tabasco",
    "salt",
    "pepper",
    "chicken",
    "thighs",
    "drumsticks",
    "flour",
    "cayenne",
    "garlic",
    "baking",
    "paprika",
    "egg",
    "oil"
  ],
  "directions": [
    "0",
    "In a medium saucepan, bring 4 cups water, the brown sugar, worcestershire, hot sauce, 2 tbsp. salt and 1 tbsp. pepper to a simmer over medium-high heat, stirring, until the sugar dissolves. Transfer to a large, heatproof bowl and let cool to room temperature. Add the chicken (make sure it's submerged completely) and refrigerate for at least 3 hours or overnight. Remove the chicken from the brine and pat dry.",
    "In a bowl, whisk the flour, cayenne, garlic powder, baking powder, paprika, 2 tsp. salt and 1 tsp. pepper. In another bowl, whisk 1 1/2 cups water, the egg and 1 tbsp. oil. Slowly whisk the flour mixture into the liquid mixture.",
    "In a large (10- to 12-inch) cast-iron skillet, heat the remaining 3 cups oil until it registers 325 degrees on an instant-read thermometer. Working with half of the chicken, dip each piece into the batter, let the excess drip off, then add to the skillet (the chicken won't be entirely submerged in the oil). Fry, turning once, until the chicken is deep golden-brown, 12 to 14 minutes. Transfer to paper towels to drain. Increase the heat, if necessary, to bring the oil back to 325 degrees . Batter and fry the remaining chicken, then transfer to paper towels to drain."
  ],
  "ingredients": [
    "0",
    "1/4 cup (packed) dark brown sugar",
    "3 tablespoons worcestershire sauce",
    "1 tablespoon hot sauce, such as Tabasco",
    "Salt and pepper",
    "4 chicken thighs",
    "4 chicken drumsticks",
    "1 1/4 cups flour",
    "2 teaspoons cayenne",
    "2 teaspoons garlic powder",
    "2 teaspoons baking powder",
    "2 teaspoons paprika",
    "1 egg",
    "3 cups plus 1 tbsp. vegetable oil"
  ],
  "__v": 1
}