{
  "hash": "2a9393be26bfc358800bbb9540e1011b86cd6a76",
  "title": "Nutella-Stuffed Cinnamon Sugar Muffins",
  "image": "https://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2013/05/nutella-stuffed-muffins-4.jpg",
  "href": "https://sallysbakingaddiction.com/2013/05/05/nutella-stuffed-cinnamon-sugar-muffins/",
  "extension": "Chrome",
  "firstAdded": "2018-09-15T22:28:07.965000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 425F. Spray muffin pan with cooking spray and set aside.",
    "In a large bowl of an electric or stand mixer, cream butter and sugar together on medium speed. Mix in the egg, vanilla extract, and milk. Gently stir in flour, baking powder, cinnamon, nutmeg, and salt. Do not overmix - stir until *just* combined.",
    "Spoon 1 heaping Tablespoon of batter into muffin cavity. Layer with 1 heaping teaspoon Nutella in the center and spoon another heaping Tablespoon of batter on top. If the muffin tins are completely full, that is ok. They will not overflow. Repeat layering batter and Nutella into each muffin tin. I got exactly 8 muffins. Fill the empty muffin tins halfway with water for even baking.",
    "Bake at 425F for 5 minutes. Keeping the muffins in the oven, reduce temperature to 350F and bake for an additional 13-17 minutes until batter is set. Allow muffins to cool for about 5 minutes.",
    "While the muffins are cooling, make the cinnamon-sugar topping. Melt the butter for about 30 seconds in the microwave. Stir and stick back in microwave if not fully melted. In a separate small bowl, stir together the sugar and cinnamon. Dip the top of each muffin into the melted butter and dip into the cinnamon-sugar mixture. Swirl them around in the cinnamon-sugar a bit to make sure you get a thick coating. Set upright on cooling rack.",
    "Muffins stay fresh in an airtight container up to 1 week. Muffins freeze well, up to 3 months."
  ],
  "ingredients": [
    "0",
    "Muffins",
    "1/3 cup (5 Tablespoons or 75g) unsalted butter, softened to room temperature",
    "1/2 cup (100g) granulated sugar",
    "1 large egg",
    "1 teaspoon vanilla extract",
    "1/2 cup (120ml) milk",
    "1 and 1/2 cups (190g) white whole wheat flour flour (spoon & leveled)",
    "1 and 1/2 teaspoons baking powder",
    "1/2 teaspoon ground cinnamon",
    "1/4 teaspoon ground nutmeg",
    "1/2 teaspoon salt",
    "8 heaping teaspoons Nutella",
    "Cinnamon-Sugar Topping",
    "1/4 cup (50g) granulated sugar",
    "2 teaspoons cinnamon",
    "3 Tablespoons (45g) unsalted butter"
  ],
  "__v": 1
}