{
  "hash": "7d1fb10d212ee6c5144ea7773d0e2fb95fc7c2ad",
  "title": "Mexican Chocolate Tortilla Chip Pie",
  "image": "http://ourfourforks.com/wp-content/uploads/2015/04/mexican-chocolate-tortilla-chip-pie-gluten-free-vegan-final2-ourfourforks.com_-533x800.jpg",
  "href": "http://ourfourforks.com/tortilla-chip-pie/",
  "extension": "",
  "firstAdded": "2015-10-01T21:11:30.329000",
  "users": [
    null
  ],
  "keywords": [
    "coconut",
    "oil",
    "brown",
    "sugar",
    "cinnamon",
    "food",
    "good",
    "cantina",
    "tortilla",
    "chips",
    "reserved",
    "notes",
    "vegan",
    "semisweet",
    "chocolate",
    "fat",
    "milk",
    "avocado",
    "vanilla",
    "chipotle",
    "ancho",
    "chile",
    "chilled",
    "overnight",
    "maple",
    "syrup",
    "stevia"
  ],
  "directions": [
    "0",
    "Preheat oven to 350 degrees Fahrenheit.",
    "Melt coconut oil and sugar together.",
    "In a large bowl, pour melted butter and sugar over ground tortilla chips and cinnamon and mix until fully combined. Press into a 9-inch pie plate and bake for 12-15 minutes. Allow to cool completely.",
    "1",
    "Pour the chocolate chips into a medium-size saucepan.",
    "Scoop the just the thick part of the coconut milk from the can and add it to the sauce pan, along with ⅓ cup of the coconut milk liquid.",
    "Over low to medium heat, stir the chocolate and coconut milk together until the chocolate has melted.",
    "Add the vanilla extract, cinnamon and chile powder and whisk until smooth and set aside to cool.",
    "Add the avocado flesh to a food processor or blender along with the cooled chocolate mixture and process on high until smooth making sure there aren't any avocado pieces remaining.",
    "Pour the mixture into the cooled tortilla chip pie crust and place in the refrigerator for at least 4 hours to set.",
    "2",
    "Scoop out the solidified part of the chilled coconut milk into a chilled bowl.",
    "Beat on high with a hand mixer until smooth and light. Add the vanilla extract and maple syrup or stevia and beat again for about thirty seconds. Place in the refrigerator until ready to use.",
    "3",
    "After filling has chilled, spread the whipped cream on top of the pie. Sprinkle the top with reserved crushed tortilla chips and chopped chocolate chips. Keep in the fridge until ready to eat. The crust will be crunchiest if eaten the day of."
  ],
  "ingredients": [
    "0",
    "⅓ cup coconut oil",
    "⅓ cup coconut sugar (or brown sugar)",
    "1 teaspoon ground cinnamon",
    "2 cups finely ground Food Should Taste Good cantina tortilla chips (a 311g bag), 2 tablespoons reserved (see notes)",
    "1",
    "10 ounces vegan semi-sweet chocolate chips, 2 tablespoons reserved and chopped",
    "1 can full fat coconut milk",
    "1 ripe avocado",
    "1 teaspoon vanilla extract",
    "½ teaspoon ground cinnamon",
    "¼ teaspoon chipotle or ancho chile powder, plus more to taste",
    "2",
    "1 can full fat coconut milk, chilled overnight",
    "½ teaspoon vanilla extract",
    "2 teaspoons pure maple syrup or stevia to taste"
  ],
  "__v": 1
}