{
  "hash": "5407a140eca7a3b6e2f1e5cc888a65396086f87f",
  "title": "Chicken Cordon Bleu Sliders",
  "image": "",
  "href": "http://abc.go.com/shows/the-chew/recipes/chicken-cordon-bleu-sliders-michael-symon",
  "extension": "Firefox",
  "firstAdded": "2015-10-02T15:57:44.061000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "cordon",
    "bleu",
    "sliders",
    "marinade",
    "buttermilk",
    "pickle",
    "juice",
    "dill",
    "hot",
    "hungarian",
    "paprika",
    "garlic",
    "boneless",
    "skinless",
    "thighs",
    "frying",
    "peanut",
    "oil",
    "flour",
    "kosher",
    "salt",
    "black",
    "pepper",
    "slider",
    "pieces",
    "ham",
    "slices",
    "gruyere",
    "cheese",
    "buns",
    "course",
    "dijon",
    "mustard"
  ],
  "directions": [
    "0",
    "For the Marinade: in a large bowl add buttermilk, pickle juice, paprika and garlic, and whisk until combined. Add the chicken pieces and marinate for 1 hour.",
    "For Frying: in a large Dutch oven or cast iron skillet add 2-3 inches of oil then heat to 350ºF.",
    "In a baking dish, add flour and season with salt and pepper, set aside.",
    "Remove the chicken from the marinade and allow excess liquid to drip off before dredging in flour. Add chicken to flour and coat completely. Shake off any excess flour and place gently in hot oil. Fry until golden-brown and crispy, about 8 minutes. Fry in 2 batches, if needed.",
    "Remove chicken and place on a sheet tray with a baking rack to drain.",
    "For the Sandwich: while the chicken is frying, heat a sauté pan over medium-high heat. Add the ham and cook until warm and crispy, about 4 minutes. In the sauté pan, separate the ham into 8 individual pieces and top each with a piece of gruyere. Add 1-2 tablespoons of water and reduce the heat to medium. Cover and allow the cheese to melt and remove the pan from heat.",
    "Spread 1 tablespoon of mustard on each bun. Top each piece of chicken with ham and cheese and place on a slider bun and serve.",
    "Helpful tip: marinate overnight to save time."
  ],
  "ingredients": [
    "0",
    "ts",
    "Chicken Cordon Bleu Sliders",
    "Marinade",
    "1 cup buttermilk",
    "1/2 cup pickle juice, dill or sweet hot",
    "1/2 teaspoon Hungarian hot paprika",
    "2 cloves garlic (thinly sliced)",
    "1 pound boneless skinless chicken thighs (cut in half)",
    "Frying",
    "peanut oil",
    "1 cup flour",
    "kosher salt and black pepper (to taste)",
    "Slider",
    "4 pieces thinly sliced ham (cut in half)",
    "4 slices gruyere cheese (cut in half)",
    "8 slider buns",
    "8 tablespoons course dijon mustard"
  ],
  "__v": 1
}