{
  "hash": "edf551ba1623dd0c95f0d01152fe84219efa5cd2",
  "title": "Butter Bean and Cider",
  "image": "https://cookingonabootstrap.com/wp-content/uploads/2018/02/wp-image-1019966460-1280x640.jpg",
  "href": "https://cookingonabootstrap.com/2018/02/01/butterbean-cider-cassoulet-recipe/",
  "extension": "Chrome",
  "firstAdded": "2019-12-28T21:38:54.638000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "First locate a large, wide pan – usually known as a sauté pan, but any pan will do. Peel and finely chop your garlic, and peel and slice your onion, and toss them into the pan. Add the oil and bring to a low heat, just to knock the raw, acerbic edge from your alliums.",
    "Cook for a couple of minutes, then slice your carrots and add those too, along with the thyme. Give it all a stir and leave it on the heat.",
    "Drain and rinse both cans of beans, and tip them into the pan, followed shortly by the cider, pepper and paprika. If you prefer and you have it kicking about the house, you can use white wine.",
    "Bring the heat up to medium-high, and add a third of the stock. Allow it to come to the boil, then reduce the heat to a simmer. Cook for 40 minutes, adding more stock as necessary to prevent it from drying out as the beans will thicken the sauce.",
    "After 40 minutes, finely chop the tomato and add to the pan along with the mustard and vinegar. Cook on a simmer for another 40 minutes, adding stock as required.",
    "Remove from the heat completely for a further 40 minutes and cover with a lid or tin foil, or a large plate. It will continue to gently cook in its own retained heat and save you some money in the process.",
    "Heat through and stir well to serve – preferably with some bread and a pile of greens."
  ],
  "ingredients": [
    "0",
    "1 whole head of garlic",
    "2 large onions",
    "4 large carrots",
    "1 tbsp oil",
    "a generous pinch of dried thyme",
    "400g tin of cannelini or haricot or borlotti beans",
    "400g tin of butter beans",
    "200ml cider",
    "1.2l vegetable stock",
    "a few pinches black pepper",
    "1/2 tsp paprika",
    "1 tbsp light coloured vinegar or lemon juice",
    "1 large tomato (optional)",
    "1 tsp English mustard"
  ],
  "__v": 4
}