{
  "hash": "45175c00a9fb09f607b58cbfe7e6821397ceae21",
  "title": "Homemade Eclairs with Peanut Butter Mousse Filling",
  "image": "http://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2018/08/homemade-eclairs-3.jpg",
  "href": "https://sallysbakingaddiction.com/2018/09/06/homemade-eclairs/",
  "extension": "Chrome",
  "firstAdded": "2018-09-07T17:05:09.588000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "Prepare the choux pastry dough recipe through step 4. You can use the choux pastry dough immediately for the eclairs or cover and refrigerate for up to 3 days.",
    "Preheat oven to 400°F (204°C). Line two baking sheets with parchment paper. Lightly brush the parchment with water, which creates a humid environment for the pastry shells allowing them to puff up without drying out or burning.",
    "Transfer choux pastry dough to a piping bag fitted with a Ateco #809 piping tip. Pipe 4-inch logs 3 inches apart. Watch the video in the blog post above for a visual. You can also use a zipped-top bag and cut off the corner for easy piping. Using a water moistened finger, smooth down any peaks or ends, then lightly brush each log with egg wash.",
    "Bake for 20 minutes then, keeping the pastries in the oven, reduce oven to 350°F (177°C) and continue to bake for 10-15 more minutes until golden brown. Do not open the oven as the pastries cook, as cool air will prevent them from properly puffing up. Remove from the oven and transfer to a cooling rack. Allow to cool completely before filling.",
    "Make the peanut butter mousse: Using a handheld or stand mixer fitted with a whisk attachment, beat heavy cream on medium-high speed until soft peaks form, about 3 minutes. Temporarily transfer to another mixing bowl. Using a handheld or stand mixer fitted with a whisk attachment, beat the cream cheese on medium-high speed until creamy and smooth. Add the confectioners' sugar, vanilla extract, and peanut butter then beat on medium-high speed until combined and creamy. Using a rubber spatula, fold in the whipped cream until combined. Taste. Stir in a pinch of salt, if desired. Transfer mousse to a piping bag fitted with a small-ish round or open star piping tip. I suggest Wilton piping round tip 12, which is wide enough for the mousse to pipe out, but you can still nudge it inside the eclair. Set aside as you make the ganache.",
    "Make the chocolate ganache: Place chopped chocolate in a bowl. Heat the cream in a small saucepan until it begins to gently simmer. (Do not let it come to a rapid boil-- that's too hot!) Pour over chocolate and let it sit for 2-3 minutes to gently soften the chocolate. Slowly stir until completely combined and chocolate has melted.",
    "Assemble the eclairs: Use a toothpick to prick a hole in 1 end of each eclair shell. The peanut butter mousse piping tip is larger than this hole, but you should still be able to nudge the piping tip inside. Carefully pipe mousse into each eclair shell, stopping when it feels full. Pipe the mousse from both ends of the eclair if you notice it's not reaching the other end. (Don't have a piping tip for this? Slice the eclair in half horizontally, then sandwich peanut butter mousse inside.) Dip the top of each into chocolate ganache and place on a serving plate or cooling rack until ready to serve. Chocolate ganache topping sets in about an hour at room temperature or in about 30 minutes in the refrigerator.",
    "Cover and store leftover filled pastries in the refrigerator for up to 3 days. Cover and store unfilled pastries at room temperature for 1 day, in the refrigerator for 5 days, or freeze for up to 3 months. Thaw in the refrigerator before filling and serving.",
    "Make ahead tip: See choux pastry recipe for how to prepare the dough ahead of time. Peanut butter mousse can be prepared, covered, and refrigerated for up to 3 days before using. Chocolate ganache can also be prepared, covered, and refrigerated for up to 3 days before using. Microwave the refrigerated ganache for a few seconds until it's thin enough for dipping/coating.",
    "Recipe Notes:",
    "I don't suggest using a natural style peanut butter for the chocolate peanut butter frosting as it could produce a thick, greasy, or crumbly frosting."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "1 batch choux pastry",
    "egg wash: 1 egg beaten with 1 Tablespoon milk or water",
    "Peanut Butter Mousse",
    "1 cup (240ml) heavy cream",
    "8 ounces (224g) full-fat brick style cream cheese, softened to room temperature",
    "1 cup (120g) confectioners' sugar",
    "1 teaspoon pure vanilla extract",
    "1/2 cup (130g) creamy peanut butter*",
    "salt, to taste",
    "Chocolate Ganache",
    "1 cup (240ml) heavy cream",
    "two 4-ounce semi-sweet chocolate bars (226g), finely chopped"
  ],
  "__v": 1
}