{
  "hash": "557ba9e2a05200c44b4a3e04bd2e02310a6cac7d",
  "title": "Beef and barley stew",
  "image": "http://atmedia.imgix.net/6e4c689d0fb5a0d8f0b63f6d78a23f61ed430511?auto=compress&w=640.0&fit=max",
  "href": "http://www.thekitchn.com/recipe-slow-cooker-beef-and-barley-stew-107027",
  "extension": "Chrome",
  "firstAdded": "2016-11-22T20:29:14.487000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Canola oil 1 (2- to 3-pound) chuck or round beef roast, trimmed of fat and cut into bite-sized pieces Salt and pepper 1 large onion, diced 8 to 10 ounces medium whole white button or brown mushrooms, stems trimmed 3 celery stalks, diced 3 cloves garlic, finely chopped 1 teaspoon dried thyme 1 bay leaf 1/2 cup red wine 2 cups beef stock 2 cups chicken stock 1 cup pearl barley",
    "Film the bottom of a large frying pan or skillet with canola oil and set over medium-high heat until the oil is hot. While the oil is heating, season the meat generously with salt and pepper.",
    "Working in batches, add a single layer of meat to the bottom of the pan. Let it sit for 2 to 3 minutes until the cubes loosen and are seared golden-brown. Flip the cubes and sear the other sides. When all sides are seared, remove the meat to the insert of a slow cooker that holds at least 4 quarts. Sear the remaining meat in batches. If there is any liquid in the pot after the last batch is finished, pour it over the meat. Place the pan back on the stove.",
    "Heat 1 teaspoon of canola oil in the pan and cook the onions with a pinch of salt until they are translucent and brown around the edges. Add the mushrooms and another pinch of salt, and cook until they have released all the moisture and have turned golden-brown. Add the celery and cook until just softened.",
    "Clear a space in the middle of the vegetables and sauté the garlic until fragrant, about 30 seconds. Stir in the thyme and bay leaf.",
    "Pour the wine into the pot to deglaze, scraping up all the browned bits from the bottom of the pan with a wooden spoon as the wine bubbles. Let the wine reduce down until most of it has evaporated or been absorbed by the vegetables. Transfer everything to the slow cooker.",
    "Add both stocks to the slow cooker and top with enough water to cover the meat and veggies by about 1/2 inch. Cover and cook for 4 hours on low. Stir in the barley, cover again, and cook until the meat and barley are tender, about 2 hours more on low. Skim off any fat if desired, taste, and add salt and pepper as needed.",
    "Stovetop instructions: This recipe can be made on the stovetop instead. Sear the meat in a large Dutch oven or heavy-bottomed pot instead of the frying pan and transfer to a bowl or plate. Proceed with cooking the vegetables and deglazing in the same pot. Add the meat back into the pot, along with the stock and water. Bring to a boil, cover the pot, and let simmer for 1 hour. Add the barley and continue cooking for another 45 minutes, until both the barley and meat are tender."
  ],
  "ingredients": [
    "0",
    "1 (2- to 3-pound) chuck or round beef roast, trimmed of fat and cut into bite-sized pieces",
    "1 large onion, diced",
    "8 to 10 ounces medium whole white button or brown mushrooms, stems trimmed",
    "3 cloves garlic, finely chopped",
    "1 teaspoon dried thyme",
    "1/2 cup red wine",
    "2 cups beef stock",
    "2 cups chicken stock",
    "1 cup pearl barley"
  ],
  "__v": 2
}