{
  "hash": "770fb54a42ebfd10644a5eb71f7838ec66c1a662",
  "title": "Classic Chocolate Vanilla Ice Cream Cake",
  "image": "http://s6655.pcdn.co/wp-content/uploads/2018/08/IMG_0259.jpg",
  "href": "http://www.eatliverun.com/classic-chocolate-vanilla-ice-cream-cake/",
  "extension": "Chrome",
  "firstAdded": "2020-06-03T23:39:35.621000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "First, make the cake layers. Preheat the oven to 350 degrees. Butter and flour two 9\" cake pans. Do not just use cooking spray here - really get in there with the butter and the flour.",
    "In a large mixing bowl, whisk together the flour, baking powder, baking soda and salt. Sift in the cocoa powder and stir to combine well.",
    "In another bowl, blend together the oil, sugar, eggs and vanilla. Add the buttermilk and mix well.",
    "Pour the wet ingredients into the dry ingredients and mix until just combined. Batter will be slightly lumpy but be sure not to over-mix.",
    "Divide batter between your two prepared cake pans. Bake for 35 minutes, until the edges of the cakes have separated from the pan and the cakes are light and springy. Remove from oven and let cool for 10 minutes in the pan before turning out onto a cooling rack to cool. Set aside and cool COMPLETELY before proceeding to next step with the ice cream.",
    "Line one of the now empty cake pans with plastic wrap. Scoop out your ice cream and fill the pan - smoothing the top with a knife and really getting all around the edges. It should fill the pan completely. Place this in the freezer for at least four hours, or preferably overnight.",
    "When you're ready to assemble your cake, place one of the chocolate cake layers on a cake plate or serving dish. Remove the ice cream layer by lifting on the plastic wrap and placing down on the cake. Peel away the plastic and place the other cake layer on top of this ice cream layer.",
    "Place cake back in freezer for a couple hours (or overnight) before frosting!",
    "When you're ready to frost your cake, beat the cream with the sugar and vanilla until fluffy and peaks appear. Smooth the frosting all over the frozen cake. This doesn't need to be perfect! Top with sprinkles. Place back in the freezer. When ready to serve the cake, remove from the freezer for 20 minutes before serving so the cake can defrost a bit. Run a knife until hot water to heat to make slicing much easier."
  ],
  "ingredients": [
    "0",
    "For cake -",
    "2 cups all purpose flour",
    "1 tsp baking powder",
    "1.5 tsp baking soda",
    "1 tsp salt",
    "2/3 cup cocoa powder preferably dutch process",
    "1.5 cups sugar",
    "2/3 cup vegetable oil",
    "2 whole eggs",
    "2 cups buttermilk",
    "2 tsp vanilla extract",
    "For ice cream layer -",
    "1.5 quarts Dreyer's Slow Churned Vanilla Ice Cream set on the counter to thaw for 30 minutes",
    "For frosting -",
    "2 cups heavy whipping cream",
    "1 tsp vanilla extract",
    "1/2 cup sugar",
    "rainbow sprinkles optional but fun!"
  ],
  "__v": 1
}