{
  "hash": "4c92d015b9fb4fd6e5c7363106be2dc6f9801662",
  "title": "Jeweled Wheat Berries and Asparagus",
  "image": "",
  "href": "https://www.shape.com/recipe/jeweled-wheat-berries-and-asparagus",
  "extension": "Chrome",
  "firstAdded": "2020-03-29T20:26:43.610000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DirectionsInstructions Checklist",
    "Step 1",
    "In a medium saucepan, combine wheat berries, 10 cups water, and 1 teaspoon salt. Bring to a boil over medium-high heat. Reduce heat to medium low, and simmer until wheat berries are soft, 45 to 60 minutes. Drain well, and let cool slightly.",
    "Step 2",
    "Meanwhile, preheat oven to 350°. Line a baking sheet with parchment. Toss sliced lemon rounds with 1 teaspoon oil on the prepared baking sheet, and spread in a single layer. Roast until lemon slices are caramelized, watching carefully toward the end and flipping halfway through, 25 to 30 minutes. Let cool, then finely chop 8 slices. Keep remaining slices whole.",
    "Step 3",
    "Increase oven to 400°. On a large rimmed baking sheet, toss the asparagus with the remaining 2 tablespoons oil. Season with salt and pepper. Roast until bright green and crisp tender, about 10 minutes.",
    "Step 4",
    "To make the dressing, in a blender or food processor, pulse the cilantro, shallot, lime juice, honey, cumin, and coriander until finely chopped. With the motor running, pour in the olive oil in a slow stream. Season with salt and pepper.",
    "Step 5",
    "Scrape the dressing into a medium bowl. Add the cooked wheat berries, chopped roasted lemon, parsley, dill, pomegranate seeds, pistachios, and scallions. Season with salt, and toss to combine.",
    "Step 6",
    "Arrange asparagus on the bottom of a platter. Spoon wheat berry salad over asparagus. Garnish with remaining roasted lemon slices. Drizzle with olive oil, and serve.",
    "Pro Cook Tip",
    "Soaking grains cuts the cooking time in half and makes them easier to digest. \"Put them in a mason jar, and cover them with water the night before,\" Fiffer says. \"The next day, drain them before cooking.\""
  ],
  "ingredients": [
    "0",
    "IngredientsSalads and Asparagus",
    "1 ¾ cups raw wheat berries (4 cups cooked)",
    "Sea salt and freshly ground black pepper",
    "2 small lemons, very thinly sliced into rounds",
    "2 tablespoons plus 1 teaspoon extra-virgin olive oil, plus more for drizzling",
    "2 bunches asparagus (2 pounds), ends trimmed",
    "2 cups parsley, roughly chopped",
    "1 cup dill, roughly chopped",
    "¾ cup pomegranate seeds",
    "¾ cup toasted pistachios, roughly chopped",
    "3 scallions, green parts only, thinly sliced on the bias",
    "Dressing",
    "¾ cup tightly packed cilantro leaves and stems",
    "½ small shallot, chopped",
    "3 tablespoons fresh lime juice",
    "1 ½ teaspoons honey",
    "¾ teaspoon ground cumin",
    "¾ teaspoon ground coriander",
    "⅓ cup extra-virgin olive oil"
  ],
  "__v": 1
}