{
  "hash": "e91863cbeb0754a4bde570c0ce6e528389c86b3e",
  "title": "Shrimp Tacos Recipe with Ranchero Sauce",
  "image": "http://www.aspicyperspective.com/wp-content/uploads/2012/04/shrimp-tacos-recipe-210x210.jpg",
  "href": "http://www.aspicyperspective.com/ranchero-sauce-shrimp-taco-recipe/2/",
  "extension": "Chrome",
  "firstAdded": "2017-08-01T03:07:13.257000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the grill to medium heat. For the Ranchero Sauce: Add the oil to a sauce pan and place it over medium heat. Saute the onion, jalapeno, and garlic until soft--3-5 minutes.",
    "Add the red pepper, tomato paste, vinegar, sugar, cumin, stock and 1/4 tsp salt. Simmer for 10 minutes on low.",
    "Remove from heat and carefully pour into a blender. Add the cream and place the lid on the blender--sightly jarred so it can vent. Puree the sauce until smooth, then set aside.",
    "For the Shrimp Taco Recipe: Sprinkle the raw shrimp with salt pepper and paprika. Place the corn and the shrimp on the grill. Grill the shrimp for 2 minutes per side, until just pink. Grill the corn for 2 minutes per side, rotating to get char marks on all sides. When the corn has cooled a little, cut it off the cobs.",
    "Warm the tortillas in the microwave. Place a bed of cabbage on the bottom of a tortilla, followed by 3-4 shrimp, corn, grapes and avocado. Drizzle with ranchero sauce and serve."
  ],
  "ingredients": [
    "0",
    "1 tablespoon oil",
    "1 shallot, peeled and chopped",
    "1 jalapeno, seeded and diced (use half is sensitive to heat)",
    "1 garlic clove, chopped",
    "1 whole jarred roasted red pepper, chopped (or homemade)",
    "1 tablespoon tomato paste",
    "2 tablespoons apple cider vinegar",
    "1 tablespoon brown sugar",
    "4 teaspoons ground cumin",
    "1/4 cup stock, any variety",
    "1/4 cup heavy cream",
    "1",
    "1 pound raw jumbo shrimp, peeled and de-veined",
    "hot smoked paprika",
    "salt and pepper",
    "3 corn cobs, shucked and cleaned",
    "1 1/2 cups shredded red cabbage",
    "1 1/2 cups seedless red grapes, halved",
    "2 avocados, chopped",
    "Tortillas, 16 corn or 8 wheat"
  ],
  "__v": 1
}