{
  "hash": "fbd3c311491f6d725c32a75b2ef38e4c07b63576",
  "title": "Slow-Cooker Pulled Pork Tacos with Quick Pickled Onions",
  "image": "http://www.loveandoliveoil.com/wp-content/uploads/2017/04/pulled-pork-tacos3-600x900.jpg",
  "href": "http://www.loveandoliveoil.com/2017/04/slow-cooker-pulled-pork-tacos.html",
  "extension": "Chrome",
  "firstAdded": "2017-04-21T23:36:01.025000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "Remove string from pork shoulder. Place in slow cooker along with pineapple juice, lime juice, lime zest, garlic, onion, brown sugar, salt, pepper, oregano, and cumin. Cover and cook on low heat for 10 hours, or until pork is tender and practically falling apart.",
    "Remove pork shoulder from slow cooker and transfer to a cutting surface. Pull into shreds using two forks. If making this ahead of time, the shredded meat should be stored in an airtight container overnight.",
    "Reserve remaining liquid. If making this a day ahead of time, place in a bowl or container and refrigerate overnight. The fat should separate out in a layer on the top, which you can easily remove. Otherwise, if using the same day, skim off as much fat as you can and proceed as instructed.",
    "Place reserved liquid in a large saucepan and bring to a simmer. Let it reduce until thickened, about 10 minutes. Add shredded meat and cook over medium-low heat until heated through.",
    "Spoon meat into warm tortillas. Top with pickled onions and fresh cilantro, as desired.",
    "For Pickled Onions:",
    "Place thinly sliced onions in a bowl. Sprinkle generously with salt and let sit for 5 minutes, then pour boiling water over top. This will help get rid of some of the raw bite of the onion. Drain well.",
    "Heat vinegar, sugar, salt, and peppercorns in a saucepan or in the microwave until sugar is completely dissolved. Pour over onions. Cover and refrigerate for at least 30 minutes, or overnight."
  ],
  "ingredients": [
    "0",
    "For Pulled Pork:",
    "3 pounds boneless pork shoulder",
    "1 cup pineapple juice",
    "1/4 cup lime juice",
    "1 teaspoon lime zest",
    "5 garlic cloves, chopped",
    "1 medium onion, sliced",
    "2 tablespoons light brown sugar",
    "1 teaspoon kosher salt",
    "1 teaspoon ground oregano",
    "1/2 teaspoon ground cumin",
    "1/2 teaspoon freshly ground black pepper",
    "18 6-inch corn tortillas, warmed",
    "fresh cilantro, for topping",
    "For Pickled Onions:",
    "1 red onion, very thinly sliced",
    "boiling water, for blanching",
    "1 cup apple cider vinegar (or use a mix of cider and white vinegar)",
    "2 tablespoons granulated sugar",
    "1 teaspoon kosher salt",
    "1 teaspoon whole black peppercorns"
  ],
  "__v": 1
}