{
  "hash": "901db96a63c863e6a2710b126ebab1171f845d84",
  "title": "Shiitake-and-Swiss-Chard Soup with Hand-Cut Noodles",
  "image": "https://imagesvc.timeincapp.com/v3/mm/image?url=https%3A%2F%2Fcdn-image.foodandwine.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2Fmedium_2x%2Fpublic%2F201103-xl-shiitake-chard-soup.jpg%3Fitok%3D5ZCjgkNw&w=800&q=85",
  "href": "https://www.foodandwine.com/recipes/shiitake-and-swiss-chard-soup-with-hand-cut-noodles",
  "extension": "Firefox",
  "firstAdded": "2018-10-05T18:19:39.340000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Step 1",
    "In a large pot, combine the kombu with 14 cups of water and bring to a simmer. Cook over low heat, without boiling, for 30 minutes. Discard the kombu and bring the cooking broth to a boil. Add the ground mushrooms and return to a boil. Remove from the heat, cover and let steep for 30 minutes.",
    "Step 2",
    "In the bowl of a standing electric mixer fitted with the dough hook, mix the flour and water at medium speed just until the flour is moistened. Increase the speed to medium high and beat until a smooth, firm, elastic dough forms, 8 to 10 minutes. Wrap the dough in plastic; let stand for 30 minutes.",
    "Step 3",
    "Strain the broth into a heatproof bowl. Wipe out the pot and return the broth to it. Add the soy sauce and mirin and bring to a boil. Add the sliced shiitakes and Swiss chard and cook just until tender, 2 minutes; keep warm.",
    "Step 4",
    "On a lightly floured surface, roll the dough out 1/8 inch thick. Using a pastry wheel, slice the dough into uneven strips. Bring the broth back to a boil and add the noodles. Cook, stirring, until tender and the soup is slightly thickened, 5 minutes. Ladle the soup into bowls and garnish with kimchi and a little honey."
  ],
  "ingredients": [
    "0",
    "One 1-ounce sheet of dried kombu (see Note)",
    "3 ounces dried shiitake mushrooms, finely ground in a food processor",
    "2 cups all-purpose flour",
    "3/4 cup water",
    "1/2 cup soy sauce",
    "1/4 cup mirin",
    "6 ounces fresh shiitake mushrooms, stemmed and caps thinly sliced",
    "1 pound Swiss chard—stems finely chopped, leaves coarsely chopped",
    "Kimchi and honey, for serving (optional)"
  ],
  "__v": 1
}