{
  "hash": "0e1c14aa312349c556751194631bd00b3e4b178d",
  "title": "Spiced Teff Chocolate Mousse (Vegan, Gluten Free)",
  "image": "http://i0.wp.com/willfrolicforfood.com/wp-content/uploads/2014/12/spiced-teff-chocolate-mousse-breakfast-3284.jpg?resize=682%2C1024",
  "href": "http://willfrolicforfood.com/2014/12/spiced-teff-chocolate-mousse-vegan-gluten-free.html",
  "extension": "",
  "firstAdded": "2015-10-27T20:36:10.325000",
  "users": [
    null
  ],
  "keywords": [
    "brown",
    "ivory",
    "teff",
    "flour",
    "milk",
    "coconut",
    "almond",
    "best",
    "cocoa",
    "salt",
    "cinnamon",
    "nutmeg",
    "cardamon",
    "vanilla",
    "bean",
    "seeds",
    "sugar"
  ],
  "directions": [
    "0",
    "Pour the almond or coconut milk into an unheated, cool cooking pot.",
    "Add all of the Teff Flour next.",
    "With a wire whisk blend the flour into the water until most lumps disappear.",
    "Whisk in the cocoa powder, salt, cinnamon, nutmeg, cardamom, and vanilla.",
    "Place the pot over medium heat. Stir at first with a whisk, until lumps vanish. Then change to a metal or wooden spoon.",
    "Stir after a minute or two to prevent any of the mix from sticking on bottom or sides. After it begins to steam or bubble, stir constantly until it thickens. Once it thickens, stir in the coconut sugar. Remove from heat and cover for a few minutes, while you set out your bowls (or dessert cups, why not?).",
    "Once it has cooled enough to eat, spoon into your bowls carefully, as it can retain quite a lot of heat. It looses its glorious glossy look after only a minute or two, so serve immediately! Whipped coconut cream can be added for a festive touch, with curls of chocolate on top.",
    "Leftovers keep up to 4 days in the fridge (and thicken significantly! They can be reconstituted with ½ cup of coconut or almond milk and plenty of whisking over medium high heat."
  ],
  "ingredients": [
    "0",
    "1 C Brown or Ivory Teff Flour",
    "3 C Milk [Coconut or Almond is best]",
    "6 tablespoons Cocoa Powder",
    "dash of salt",
    "2 teaspoons Cinnamon",
    "¼ teaspoon Nutmeg",
    "½ teaspoon Cardamon",
    "1 teaspoon Vanilla or Vanilla Bean seeds",
    "½ cup coconut sugar"
  ],
  "__v": 1
}