{
  "hash": "4ec0dfc7a1507177319a87ea51f6b127780f3b5b",
  "title": "oven-braised beef with tomatoes and garlic",
  "image": "https://smittenkitchendotcom.files.wordpress.com/2015/02/oven-braised-beef-with-tomatoes-and-garlic1.jpg?w=750",
  "href": "https://smittenkitchen.com/2015/02/oven-braised-beef-with-tomatoes-and-garlic/",
  "extension": "Firefox",
  "firstAdded": "2019-07-07T23:52:25.477000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In an oven: Heat oven to 300°F (150°C). Coarsely chop tomatoes with their juice in a food processor (Gourmet’s suggestion) or go at them in their can with kitchen shears (my lazy preference) to break them up. Put roast in an ovenproof 4- to 5-quart heavy pot or a casserole dish with a lid — a tight fit is just fine, as it will shrink very soon. Pour tomatoes over roast and scatter garlic around it. Season generously with salt and pepper. Braise in middle of oven, covered, until very tender, 3 to 4 hours.",
    "In an IntantPot or Electric Multi-Cooker: Coarsely chop tomatoes with their juice in a food processor (Gourmet’s suggestion) or go at them in their can with kitchen shears (my lazy preference) to break them up. Put roast in cooking insert. Pour tomatoes over roast and scatter garlic around it. Season generously with salt and pepper. Press the meat/stew button, and set the beef to cook at high pressure for 75 minutes. Let the pressure release naturally for 10 minutes, then release the pressure manually, and take out the roast and test for doneness. If it is not cooked to your liking, return to the pot for another 5 to 10 minutes at the same setting — meat/stew at high pressure. Once it is done, if you wish, press Cancel, transfer meat to a serving dish, press Sauté and let the sauce in the pot reduce for 10 to 20 minutes, until your desired thickness is achieved, then pour it over the meat.",
    "Both methods, to serve: Cut roast into 1/4-inch-thick slices and serve with sauce, garlic, squeezed from its peels (or you can leave others to do this) and orzo (Gourmet’s suggestion, of course not gluten-free), mashed potatoes (recipe at the end) or crusty bread. Leftovers shredded over egg noodles sound wonderful as well.",
    "Do ahead: Like almost all braises, this is even better on the second day, which means it’s a dream of a dinner party dish. Let it cool to room temperature, then chill it in the fridge until needed. Defat the sauce before warming (it will be a cinch once solidified on top) and rewarm at 300 for 30 to 45 minutes.",
    "Notes: What to buy: Gourmet is absolutely adamant that you should buy your meat from a supermarket, and not a fancy butcher shop, where the meat is often too lean and becomes dry when cooked. I, ever the rebel, and eager to part ways with my hard-earned money, didn’t listen and bought a lovely and dearly priced grass-fed organic one with a good marbling of fat and regret nothing. But you have every reason to keep this as budget-friendly as possible.",
    "Why truss? It’s a valid question, especially as we are not stuffing the roast and thus have nothing to contain. This is almost purely an aesthetic choice; it’s about appearance, not flavor. Trussing keeps a roast from spreading out too much as it expands while cooking, losing that nice round shape you paid so much for. If it flattens, it also might end up completely submerged in the liquid, tasting more boiled than braised, which would be a bummer.",
    "How to truss: Note, don’t use mine as much of a guide; it’s far more trussed than this dish requires. (I couldn’t say no when the butcher offered to do it for me.) Two or three loops — at either end, or with a third one in the middle — would have done just fine. Keep them loose; you want the meat to expand even while gently encouraging it to keep it’s shape, plus cotton butchers twine, the best thing to use, will shrink in the oven as well. If you’re still nervous about how to proceed, check out one of these videos on YouTube (using fewer loops and not trimming the fat, okay?). [Trussing Video 1 or 2]",
    "To dabble: You should not make this if you care for neither garlic nor tomatoes, for obvious reasons. And I hope that you anticipate that this will be a simple (but lovely) dish as written. Nevertheless, there’s no reason not to dabble if you’ve got a couple pet ingredients you’d prefer this with. I don’t think I’d be able to resist adding a couple glugs of red wine, maybe a halved onion and some thyme next time. A tablespoon or two of tomato paste will add more body to the sauce. And I’ve rarely met a beef braise that didn’t taste good with a dash of vinegar (sherry, balsamic or malt) or Worcestershire, bay leaves, mushrooms (which I’d saute and add at the end)."
  ],
  "ingredients": [
    "0",
    "1 28-ounce can whole tomatoes",
    "1 (3 to 3 1/2 pound) boneless beef chuck roast, tied with a string",
    "1 head garlic, separated into cloves, left unpeeled"
  ],
  "__v": 3
}