{
  "hash": "882387c5b3a85b4215bd866be637ae8dcdb221cd",
  "title": "Kale Pasta with Burst Tomato Sauce",
  "image": "http://i2.wp.com/funnyloveblog.com/wp-content/uploads/2014/05/IMG_1303.jpg?resize=683%2C1024",
  "href": "http://funnyloveblog.com/2014/05/14/kale-pasta-with-burst-tomato-sauce/",
  "extension": "Chrome",
  "firstAdded": "2015-07-25T21:06:48.710000",
  "users": [
    null
  ],
  "keywords": [
    "wheat",
    "spaghetti",
    "long",
    "pasta",
    "washed",
    "torn",
    "kale",
    "dry",
    "white",
    "wine",
    "cherry",
    "tomatoes",
    "red",
    "pepper",
    "roughly",
    "parsley",
    "leaves",
    "anchovy",
    "butter",
    "garlic",
    "salt",
    "parmesan",
    "cheese"
  ],
  "directions": [
    "0",
    "Cook the pasta to package directions. Right before draining, reserve one cup of the cooking water. Drain the pasta and set aside.",
    "In the same pot, add a drizzle of olive oil, the crushed red pepper, and the anchovy paste. Turn the heat to medium-high. When the anchovy paste sizzles and melts into the oil, add half the garlic, the kale, and parsley to the pot, then pour in the wine. Toss the kale around for 4-6 minutes until wilted and the garlic is fragrant, then add the pasta back to the pot and toss everything together. Add the reserved cooking water a bit at a time to coat the pasta. Taste, and add salt if needed to your taste, or more crushed red pepper if you'd like.",
    "For the burst tomato sauce (I start this when the pasta water is boiling) add all the tomatoes with a drizzle of olive oil to a skillet with a tight fitting lid. Cover the tomatoes and turn the heat to medium-high. Let the tomatoes steam and burst for about 15 minutes until a sauce has formed. Add 2 of the minced garlic cloves, the butter, and a sprinkle of salt. Cook for 2 minutes until the garlic is fragrant, then taste and add more salt if needed.",
    "Serve the pasta topped with the tomatoes and cheese, if desired.",
    "Enjoy!"
  ],
  "ingredients": [
    "0",
    "10 ounces whole wheat spaghetti, or other long cut pasta",
    "6 cups washed, torn kale",
    "1 cup dry white wine",
    "3 cups cherry tomatoes",
    "1/2 teaspoon crushed red pepper, plus more to taste",
    "1/2 cup roughly chopped parsley leaves",
    "1 tablespoon anchovy paste",
    "1 tablespoon butter",
    "4 cloves minced garlic",
    "salt, optional, to taste",
    "parmesan cheese, optional, for serving"
  ],
  "__v": 1
}