{
  "hash": "90b171f8de0fa8f32c1519cfdc2da4efc81f72ad",
  "title": "Gluten-Free Cinnamon Coffee Chocolate Chip Muffins",
  "image": "http://thevegan8.com/wp-content/uploads/2015/07/cinnmoncoffeemuffins6-1-of-1.jpg",
  "href": "http://thevegan8.com/2015/07/20/gluten-free-cinnamon-coffee-chocolate-chip-muffins/",
  "extension": "Chrome",
  "firstAdded": "2015-08-01T13:12:26.471000",
  "users": [
    null
  ],
  "keywords": [
    "almond",
    "flour",
    "used",
    "bobs",
    "red",
    "oat",
    "glutenfree",
    "necessary",
    "use",
    "tapioca",
    "starchflour",
    "quality",
    "strong",
    "saigon",
    "dont",
    "bland",
    "cinnamon",
    "coconut",
    "sugar",
    "baking",
    "salt",
    "dairyfree",
    "semisweet",
    "chocolate",
    "chips",
    "enjoy",
    "life",
    "brand",
    "brewed",
    "stronger",
    "muffins",
    "sub",
    "light",
    "plantbased",
    "rice",
    "milk",
    "want",
    "coffee",
    "vanilla",
    "starch",
    "crucial",
    "really",
    "incredible",
    "moisture",
    "structure",
    "rise",
    "starches",
    "drier",
    "risk",
    "trust",
    "grinding",
    "cooking",
    "consistency",
    "process",
    "couple",
    "minutes",
    "finer",
    "pieces",
    "quick",
    "grind",
    "smoother",
    "oats",
    "try",
    "sorghum",
    "think",
    "work",
    "tested",
    "yield",
    "similar",
    "results",
    "make",
    "bit",
    "fragile"
  ],
  "directions": [
    "0",
    "Preheat the oven to 350 degrees and place 8 liners in a muffin pan. I always use Reynolds Stay-Brite interior foil lined because they never stick and perform perfect every time.",
    "Brew your coffee.",
    "Add the almond flour, oat flour, tapioca starch, cinnamon, coconut sugar, baking powder and salt to a large bowl and whisk together until there are no lumps remaining. When measuring the almond flour, make sure to use a scale for accurate weight measurements. Otherwise, using a measuring cup, scoop out the almond flour with it and lightly pat down and then level off with your finger. Do the same way with the tapioca, as it tends to leave gaps in the spoon. Stir in the chocolate chips.",
    "Pour the coffee (or plant milk if not using coffee) into the dry ingredients and stir until it is well mixed and smooth, but don't overmix or the batter will become too thick. Sprinkle extra chocolate chips on top if desired.",
    "Pour the batter evenly among 8 liners, they should be about ¾ full. Bake for 20-22 minutes until golden brown and the tops are firm to the touch and slightly cracked. Mine took just under 22 minutes. Let them cool 15-20 minutes before eating while they finish cooking and firming up. These are just as incredible the next day too. I keep them stored in a tight container at room temperature so they stay soft."
  ],
  "ingredients": [
    "0",
    "1¼ cups blanched almond flour (140 g, I used Bob's Red Mill)",
    "½ cup oat flour (68 g, use gluten-free if necessary, I use Bob's Red Mill)",
    "¼ cup tapioca starch/flour (30 g, I use Bob's Red Mill)",
    "1 tablespoon + 1 teaspoon quality strong cinnamon (I use Saigon, don't use a bland cinnamon!)",
    "½ cup coconut sugar (76 g)",
    "2 teaspoons baking powder",
    "½ teaspoon fine sea salt",
    "¼ cup + 2 tablespoons dairy-free semi-sweet chocolate chips (85 g, I use Enjoy Life brand)",
    "¾ cup strong brewed coffee (the stronger it is, the stronger the muffins, sub with a light plant-based milk such as almond or rice milk if you don't want to use coffee and add a teaspoon of vanilla extract)",
    "Note: The almond flour and tapioca starch are crucial ingredients, as they are what really give incredible moisture and structure and rise. Other starches will not yield the same results and will make them much drier, so sub at your own risk. Trust me, I tested. I make my own oat flour by just grinding up gluten-free quick cooking oats until it is a very fine consistency. I let it process for a couple of minutes. The finer your flour is, the smoother your muffins will be. You don't want pieces of oats throughout. I use quick oats because they grind smoother. If you can't do oats, you can try sorghum flour and I think that would still work, I have not tested it, but it should yield similar results, may make them a bit more fragile."
  ],
  "__v": 1
}