{
  "__v": 1,
  "directions": [
    "0",
    "First, make the Salty Peanut Sugar. Toast the peanuts in a dry pan over a low heat, just until they take on a light golden colour. Place in the freezer for 10 minutes (this will prevent them turning to a paste when you process them).",
    "Place the cold peanuts, the sugar and salt into a food processor and pulse until the peanuts are ground down almost completely into the sugar. Place in a shallow bowl and set aside.",
    "To make the sauce, melt all the ingredients together either in the microwave or in a small saucepan. Stir well to combine the ingredients, and keep warm.",
    "To make the churros, place about 2 inches (4cm) of canola oil in a small saucepan to heat up, and get out a piping bag with a 1.5cm star shaped nozzle.",
    "While the oil is heating up, combine the flour, baking powder, olive oil and hot water in a bowl and stir to combine into a stiff paste. Scrape up the past and fill the prepared piping bag.",
    "To test the oil, squeeze out a small amount of the dough, and snip into the oil with scissors. When it sizzles and turns a light golden brown, the oil is ready.",
    "Using the same process, snip longer lengths of dough into the oil and fry until a light golden brown, before removing to some paper towel to drain.",
    "When all the dough is used, toss the churros into the peanut sugar, coating them well, and serve with the warm chocolate sauce. Heaven!"
  ],
  "firstAdded": "2014-07-10T23:17:37.371000",
  "hash": "0d692f6db0b7b35561d6b2240ccf9ab8f1a09e5b",
  "href": "http://www.thesugarhit.com/2014/06/churros-with-salty-peanut-sugar.html",
  "image": "http://www.thesugarhit.com/wp-content/uploads/2014/06/Churros-with-Salty-Peanut-Sugar-3.jpg",
  "ingredients": [
    "0",
    "3oz (75g) unsalted peanuts",
    "5oz (150g) caster sugar",
    "1 heaped tsp flake salt",
    "1",
    "4oz (100g) dark chocolate (70% cocoa solids)",
    "¼ cup (65ml) cream",
    "¼ cup (65ml) brewed coffee",
    "2 tbsp maple syrup",
    "2",
    "1 cup minus 2 tbsp (125g) plain flour",
    "1 tsp baking powder",
    "1 tbsp olive oil",
    "1 cup boiling water",
    "oil, for frying"
  ],
  "keywords": [
    "unsalted",
    "peanuts",
    "caster",
    "sugar",
    "heaped",
    "flake",
    "salt",
    "dark",
    "chocolate",
    "cocoa",
    "solids",
    "cream",
    "brewed",
    "coffee",
    "maple",
    "syrup",
    "minus",
    "plain",
    "flour",
    "baking",
    "olive",
    "oil",
    "boiling",
    "water",
    "frying"
  ],
  "title": "Churros with Salty Peanut Sugar",
  "users": [
    null
  ]
}