{
  "hash": "45b27b9c69d61b2c54b600b0512aa647acb228d6",
  "title": "basic anytime biscuits",
  "image": "http://www.recipe.com/images/basic-anytime-biscuits-R034960-ss.jpg",
  "href": "http://www.recipe.com/basic-anytime-biscuits/",
  "extension": "Chrome",
  "firstAdded": "2015-10-06T12:56:06.505000",
  "users": [
    null
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "baking",
    "soda",
    "salt",
    "cold",
    "butter",
    "milk",
    "sour",
    "cream"
  ],
  "directions": [
    "0",
    "Turn on oven to 400 degree F. Combine flour, baking powder, baking soda, and salt in a large mixing bowl. Using a pastry blender, cut butter into dry ingredients until mixture resembles coarse crumbs. (Or, crumble the butter in with your fingers.)",
    "2.",
    "In a small bowl, stir together milk and sour cream until mixture is almost smooth. Make a well in the center of the flour mixture. Add the milk mixture all at once. Using a wooden spoon stir just until the dough sticks together.",
    "3.",
    "Using hands or wooden spoon, push dough onto a lightly floured surface. Sprinkle a little flour on hands. Gently knead 8 or 10 times or just until dough holds together.",
    "4.",
    "Pat dough to 1/2-inch thickness. (Or, roll dough with a floured rolling pin.) Using the edge of a clean, floured ruler, cut dough into large diamonds or squares, approximately 3 inches. Place on ungreased baking sheet, leaving a 1-inch space between each biscuit.",
    "5.",
    "Bake for 12 to 15 minutes or until golden brown. Using a wide spatula, carefully remove biscuits from baking sheet. Serve immediately. Makes 12 biscuits.",
    "6.",
    "You will need an adult helper.",
    "Variation",
    "*Biscuit Toppers:",
    "Before baking, you can brush tops of homemade or purchased, ready-to-bake biscuits with melted butter. Add toppers such as mini chocolate chips, chopped nuts, cinnamon and sugar, or shredded cheddar cheese and pepproni slices.",
    "NUTRITION INFORMATION",
    "Per Serving: cal. (kcal) 154, Fat, total (g) 7, chol. (mg) 18, sat. fat (g) 4, carb. (g) 19, fiber (g) 1, pro. (g) 3, vit. A (RE) 72.12, sodium (mg) 300, calcium (mg) 70.68, iron (mg) 1.08, Percent Daily Values are based on a 2,000 calorie diet"
  ],
  "ingredients": [
    "0",
    "2 cups all-purpose flour",
    "1 1/2 teaspoons baking powder",
    "1/2 teaspoon baking soda",
    "1/2 teaspoon salt",
    "1/4 cup cold butter",
    "1/2 cup milk",
    "1/2 cup dairy sour cream"
  ],
  "__v": 1
}