{
  "hash": "49a8592661bbeab9fb3990a2ffd1710062f9e354",
  "title": "Vegan Hoppin’ John",
  "image": "",
  "href": "https://toriavey.com/toris-kitchen/vegan-hoppin-john/",
  "extension": "Firefox",
  "firstAdded": "2018-09-10T04:52:26.484000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Soak black eyed peas overnight, then drain, rinse and set aside. In a medium saucepot or large saute pan, heat 2 tbsp olive oil over high until it just begins to smoke (keep a close eye on it-- you don't want the oil to darken in color, but you do want it to get very hot). Add the mushrooms in a single layer and let them sear undisturbed for 2-3 minutes until they begin to turn golden on the searing side. Stir continuously for another 1-2 minutes until the mushrooms are golden throughout. Reduce heat to medium.",
    "Add carrots, celery and onion along with the remaining 1 tbsp of olive oil. Cook until vegetables are soft and translucent (about 7-10 minutes), then add garlic and cook for 1 minute more until fragrant.",
    "Add fire roasted tomatoes, smoked paprika, turmeric, cayenne, chili powder, vegetable stock and soaked black eyed peas to the pan, stir to blend. Bring mixture to a simmer over medium heat, then cover and cook for 25 -30 minutes until the beans are just tender - don't overcook them or they will get mushy. Remove the lid and continue to cook until the liquid has reduced by half. Season with salt to taste. I usually add about 1 tsp. if using a low sodium broth. Salt really makes the other flavors pop!",
    "Serve hot over steamed rice. Garnish with chopped scallions, if desired. May also be served as a warm dip with corn or tortilla chips."
  ],
  "ingredients": [
    "0",
    "2 cups dried black eyed peas",
    "8 oz sliced mushrooms",
    "3 tbsp olive oil divided",
    "4 whole carrots peeled and roughly chopped",
    "2 celery stalks roughly chopped",
    "1 whole onion roughly chopped",
    "1 tsp crushed garlic",
    "15 oz diced fire roasted tomatoes 1 can",
    "1 tsp smoked paprika",
    "1/4 tsp turmeric",
    "1/4 tsp cayenne",
    "1/8 tsp chili powder",
    "2 cups vegetable stock low sodium ok",
    "Salt to taste",
    "Chopped scallions garnish - optional",
    "6 cups steamed white or brown rice for serving prepared"
  ],
  "__v": 1
}