{
  "hash": "170bd814c145bb4bc00182fb79ad4434dc5b4917",
  "title": "Vegetable Chow Fun",
  "image": "http://thewoksoflife.com/wp-content/uploads/2016/04/vegetable-chow-fun-11.jpg",
  "href": "http://thewoksoflife.com/2016/04/vegetable-chow-fun/",
  "extension": "Chrome",
  "firstAdded": "2016-08-02T21:01:17.388000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Take the rice noodles out of the refrigerator and allow to sit on the counter until they are at room temperature. Cut them into 1½-inch wide ribbons.",
    "In a small bowl, dissolve ½ teaspoon salt and ¼ teaspoon sugar in the hot water. Add the soy sauces, oyster sauce, sesame oil, and white pepper. Set aside.",
    "Heat your wok over medium high heat, and add ¼ cup oil. In a bowl, mix the flour, cornstarch, ¼ teaspoon of salt, and ¼ teaspoon white pepper, and toss the eggplant in this dry mixture until well coated. Place the eggplant slices evenly in the pan and fry for 2 minutes on each side until brown. Turn over each of the pieces, and when browned on both sides, remove to a plate or sheet pan and set aside.",
    "Heat the wok over high heat, and add the ginger slices. Spread 1 tablespoon of oil around the perimeter of the wok. Let the ginger fry to 10 seconds to infuse the oil, and stir in the garlic and the white portions of the scallions.",
    "Next, add the mushrooms, red peppers and stir fry for another 20 seconds. Then, add the Shaoxing wine and the rice noodles. The heat should be at the highest setting. Give the noodles a quick stir for 30 seconds, and pour the soy sauce mixture over the noodles. Continue gently stir-frying the noodles using a scooping motion for 2 minutes. Make sure you scrape the bottom of the wok with your spatula to prevent the noodles from sticking. The high heat of the wok should also prevent the noodles from sticking.",
    "Next, add the eggplant, snow peas, bean sprouts, and the rest of the scallions. Continue stir-frying until the noodles are heated through and the snow peas turn a bright green – about 2 minutes. Plate and serve with your favorite hot chili oil!"
  ],
  "ingredients": [
    "0",
    "16 ounces fresh rice noodles (if you can’t find these at your Asian grocery, we have a recipe here!)",
    "salt",
    "¼ teaspoon sugar",
    "2 teaspoons hot water",
    "2 teaspoons soy sauce",
    "1 teaspoon dark soy sauce",
    "1 tablespoon oyster sauce or vegetarian oyster sauce",
    "½ teaspoon sesame oil",
    "Freshly ground white pepper, to taste",
    "¼ cup, plus 1 tablespoon vegetable oil (divided)",
    "1 tablespoon all-purpose flour",
    "3 tablespoons cornstarch",
    "1 large Chinese or Japanese eggplant, sliced into ?-inch thick slices",
    "3 thin slices fresh ginger",
    "2 cloves garlic, sliced",
    "3 scallions, sliced at an angle into 1 to 2-inch pieces (white and green parts separated)",
    "1 cup sliced fresh or dried shiitake mushrooms",
    "2 red holland peppers (spicy) or ½ red bell pepper (non-spicy) cut into strips",
    "1 tablespoon Shaoxing wine",
    "1 cup fresh snow peas, trimmed",
    "1½ cups fresh bean sprouts"
  ],
  "__v": 1
}