{
  "hash": "8a5896dd22158cde761c36e4854de6cb4e458bed",
  "title": "World's Easiest Pie Crust - VeganEasy Vegan Spelt Pie Crust",
  "image": "http://img.sndimg.com/food/image/upload/w_555,h_416,c_fit,fl_progressive,q_95/v1/img/recipes/17/18/44/piczKOFM9.jpg",
  "href": "http://www.food.com/recipe/worlds-easiest-pie-crust-vegan-171844",
  "extension": "Chrome",
  "firstAdded": "2015-05-24T07:47:57.730000",
  "users": [
    null
  ],
  "keywords": [
    "flour",
    "white",
    "wheat",
    "combo",
    "salt",
    "sugar",
    "vegan",
    "best",
    "oil",
    "orange",
    "juice",
    "soymilk",
    "spelt",
    "sprouted",
    "nondairy",
    "milk",
    "used",
    "light"
  ],
  "directions": [
    "0",
    "In a large bowl place all of the dry ingredients.",
    "Add Orange Juice and oil, mix with a fork",
    "Pat into 9-inch pan with fingertips. If pre-baked crust is desired bake at 425 for 10 -12 minutes.",
    "Note** Vegan sugar should be used for the best texture. It taste yummy with cane sugar or table sugar as well.",
    "1",
    "In a food processor add the 3 cups of spelt flour and salt. Process for a minute to incorporate the flour and salt.",
    "Combine the non-dairy milk and light oil in a cup and mix well. I use a whisk to do this. Then feed the milk-oil mixture through the feeding tube in the food processor and into the flour mixture. The dough should be in large crumbles. At this point, stop the machine and feel the dough. It shouldn't be sticky or dry, but a little oily and hold together well. Try not to handle the dough too much as it tends to toughen the dough.",
    "Once you have the right consistency remove the dough crumbles onto a prepared surface to roll out your dough. I use a large plastic sheet, but waxed paper can also be used. I try to avoid using a floured surface as it will make the dough dry. I have found that with this dough that it isn't necessary.",
    "Shape the dough into a disc and cut it in half. Reshape the first piece of dough into a disc and roll it out. I wrap the dough around my rolling pin then place it onto the pie pan and unroll. Once I have the dough in place I position it carefully but do not stretch it, it will shrink. I prick the sides and bottom of the bottom crust.",
    "Fill the pie with the desired ingredients and roll out the second disc of dough and put it on top.",
    "Flute the edges with a fork and then trim the pie crust edges. Brush the pie with some of the non-dairy milk and then make slits in the top crust to let out the steam.",
    "Bake according to the type of pie you are making.",
    "Enjoy!"
  ],
  "ingredients": [
    "0",
    "1 1⁄2 cups flour (can be white or whole wheat or combo of both)",
    "1⁄2 teaspoon salt",
    "2 tablespoons sugar (vegan is best)",
    "1⁄2 cup oil",
    "2 tablespoons orange juice (or vegan soymilk)",
    "1",
    "3 cups spelt flour (not sprouted)",
    "1 teaspoon sea salt",
    "1⁄2 cup soymilk (other non-dairy milk can be used)",
    "1⁄2 cup light oil"
  ],
  "__v": 1
}