{
  "hash": "ca63b435e7fe46bd24a2c8c74da43ab7e17d5090",
  "title": "One-Skillet Steak And Spring Veg With Spicy Mustard",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/one-skillet-steak-and-spring-veg-with-spicy-mustard",
  "extension": "Chrome",
  "firstAdded": "2017-05-24T13:28:44.193000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparation",
    "Season steak all over with salt and pepper. Whisk grated garlic, mustard, vinegar, honey, cayenne, ⅓ cup oil, and 1 Tbsp. water in a medium bowl to combine; season spicy mustard with salt and pepper.",
    "Heat a dry medium skillet, preferably cast iron, over medium-high. Rub steak all over with 1 Tbsp. oil and cook, turning every 2 minutes or so and making sure to get color on the fat cap, until medium-rare (an instant-read thermometer inserted into the center will register 120°), about 10 minutes. Transfer steak to a plate to rest. Pour off oil from skillet, leaving crispy bits behind.",
    "Heat remaining 2 Tbsp. oil in same skillet over low. Add sliced garlic and all but about 2 Tbsp. scallions (save those for serving) and cook, stirring often, until translucent and softened, about 3 minutes. Add peas and a splash of water and cook, stirring and mashing to break up slightly, until peas are tender, about 5 minutes. Add asparagus; season with salt and pepper. Cook, stirring often, until asparagus is just tender, about 5 minutes. Remove from heat.",
    "Slice steak and shingle over vegetables in skillet. Drizzle some mustard sauce over steak and top with reserved scallions. Serve with remaining mustard sauce alongside."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "4 SERVINGS",
    "1 pound boneless New York strip steak, patted dry",
    "Kosher salt, freshly ground pepper",
    "5 garlic cloves, 1 grated, 4 thinly sliced",
    "⅓ cup Dijon mustard",
    "1 tablespoon sherry vinegar or red wine vinegar",
    "1 teaspoon honey",
    "1–2 pinches cayenne pepper",
    "⅓ cup plus 3 tablespoons olive oil",
    "1 bunch scallions, thinly sliced, divided",
    "1 10-ounce bag frozen peas",
    "1 bunch asparagus, trimmed, cut into 1-inch pieces"
  ],
  "__v": 1
}