{
  "hash": "977bb71bb72c5d8f1bec010f3d5c72f68efef610",
  "title": "Grilled Potato and Onion Salad with Blue Cheese and Bacon",
  "image": "http://cdn-image.foodandwine.com/sites/default/files/styles/recipe_carousel_551_551/public/2014-r-xl-portuguese-style-roast-potatoes.jpg?itok=kQrU5viN",
  "href": "http://www.foodandwine.com/recipes/grilled-potato-and-onion-salad-with-blue-cheese-and-bacon",
  "extension": "Chrome",
  "firstAdded": "2015-12-18T20:31:20.192000",
  "users": [
    null
  ],
  "keywords": [
    "meaty",
    "bacon",
    "red",
    "onions",
    "extravirgin",
    "olive",
    "oil",
    "kosher",
    "salt",
    "black",
    "pepper",
    "new",
    "potatoes",
    "diameter",
    "scrubbed",
    "mayonnaise",
    "cheese",
    "gorgonzola",
    "roquefort",
    "maytag",
    "blue",
    "crumbled"
  ],
  "directions": [
    "0",
    "Preheat the oven to 400°. Spread the bacon slices in a single layer on a baking sheet. Bake until they are brown and crisp, about 15 minutes. Transfer the bacon slices to paper towel—lined plates to drain. Crumble into 1/2-inch pieces.",
    "Light a grill. In a large bowl, toss the red onion slices with 1 tablespoon of the olive oil. Season with salt and pepper. Grill the onions over moderately high heat, turning once, until lightly charred and tender, about 5 minutes. Cut the grilled onions into 1/2-inch pieces.",
    "In a large pot of salted cold water, bring the potatoes to a boil. Simmer until they are beginning to get tender, about 5 minutes. Drain the potatoes and cut them in half. In a large bowl, toss the potatoes with the remaining 3 tablespoons of olive oil and season with salt and pepper. Grill the potatoes over moderately high heat, turning once, until they are tender and browned, about 5 minutes.",
    "In a large bowl, mix the mayonnaise with the blue cheese. Add the bacon, onions and potatoes and toss to coat. Transfer the salad to a clean bowl and serve."
  ],
  "ingredients": [
    "0",
    "1 pound sliced meaty bacon",
    "3 red onions, sliced 1/2 inch thick",
    "1/4 cup extra-virgin olive oil",
    "Kosher salt and freshly ground black pepper",
    "3 1/2 pounds small new potatoes (about 1 1/2 inches in diameter), scrubbed",
    "1/2 cup mayonnaise",
    "1/2 pound blue cheese, such as Gorgonzola, Roquefort or Maytag Blue, crumbled"
  ],
  "__v": 1
}