{
  "hash": "ce1b73666a65ab910ca9e77f39a939864549a172",
  "title": "Raw Vegan Pizza with Red Pepper Flax Crust",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2013/11/Raw-Vegan-Pizza-Recipe-1200x800.jpg",
  "href": "http://www.onegreenplanet.org/plant-based-recipes/raw-vegan-pizza-with-red-pepper-flax-crust/",
  "extension": "Chrome",
  "firstAdded": "2015-04-12T14:32:08.458000",
  "users": [
    null
  ],
  "keywords": [
    "pine",
    "nuts",
    "juice",
    "lemon",
    "garlic",
    "clove",
    "herbes",
    "provence",
    "fave",
    "herbs",
    "rejuvelac",
    "water",
    "nutritional",
    "yeast",
    "salt",
    "red",
    "bell",
    "pepper",
    "sunflower",
    "hemp",
    "flax",
    "seeds",
    "veggies",
    "tamari",
    "extra",
    "virgin",
    "olive",
    "oil",
    "tomatoes",
    "sundried",
    "kind",
    "use",
    "stored",
    "dates",
    "miso",
    "basil",
    "oregano"
  ],
  "directions": [
    "0",
    "Blend all the ingredients until very smooth and thick.",
    "Wrap in cheesecloth, place in a bowl and leave alone for preferably 2-5 days. You can use the cheese right away but the longer you let it age, the more flavour and texture it will develop.",
    "1",
    "Put all the ingredients in your food processor and process until everything has combined into rough, slightly wet “dough”.",
    "Spread this evenly onto parchment on a pizza pan and dehydrate in your oven at its lowest temperature for 3-5 hours or until it’s like a giant cracker.",
    "If you have a dehydrator, you can use that instead and set it to just above 115 degrees.",
    "2",
    "Evenly coat the veggies in tamari and oil and let them marinate in your oven at its lowest temperature, or in your dehydrator, for about an hour.",
    "3",
    "Blend all the ingredients until smooth.",
    "Spread this evenly on your crust, followed by pieces of cheese, then the marinated veggies.",
    "Pair with a salad and you’ve got one super delicious, super healthy dinner than everyone can enjoy!"
  ],
  "ingredients": [
    "0",
    "1 cup pine nuts",
    "Juice of one lemon",
    "1 garlic clove",
    "2 teaspoons herbes de provence (or other fave herbs)",
    "2 tablespoons rejuvelac (or water)",
    "2 tablespoons nutritional yeast",
    "Salt, to taste",
    "1",
    "1 red bell pepper",
    "1/3 cup each of sunflower seeds, hemp seeds and flax seeds",
    "Salt and pepper, to taste",
    "2",
    "About 2 cups of whatever veggies you like",
    "1 teaspoon each of tamari and extra virgin olive oil",
    "3",
    "¾ cup chopped tomatoes",
    "3 tablespoons sundried tomatoes (the kind I use are stored in olive oil)",
    "½ teaspoon lemon juice",
    "1-2 dates",
    "1 tablespoon miso",
    "1 small garlic clove",
    "Fresh or dried basil and oregano, to taste"
  ],
  "__v": 1
}