{
  "hash": "ee9a382ab15ad15aa3478460958ff34f968abe42",
  "title": "Pompoenspaghetti voor Halloween",
  "image": "http://053e44c254414925813d3f8f1212f0b3.objectstore.eu/w3tc/wp-content/uploads/sites/10/2016/10/RECEPT-POMPOENSPAGHETTI-738x547.jpg?ff0309",
  "href": "http://chickslovelittleones.com/pompoenspaghetti-voor-halloween-food/",
  "extension": "Chrome",
  "firstAdded": "2016-10-26T19:47:16.260000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "En zo doe je het:",
    "– Snijd 1 pompoen doormidden en verwijder de pompoenpitten en draden.",
    "– Schil ‘m vervolgens en snijd het vruchtvlees in blokjes.",
    "– Doe in een pannetje met kokend water.",
    "– Kook de pompoen in ca. 8 minuten totdat-ie zacht genoeg is en je er makkelijk met een vork in kunt prikken. Wil je de spaghetti in een pompoen serveren? Snijd dan het kapje van de overige pompoenen af en hol ze uit.",
    "– Snipper ondertussen de ui.",
    "– Giet de pompoenblokjes af en zet even weg.",
    "– Zet de pan die je zojuist voor de pompoen hebt gebruikt terug op het fornuis en verwarm hier wat olie in.",
    "– Fruit de ui hierin aan.",
    "– Voeg de pompoen toe, samen met de kokosmelk, een flinke snuf peper en zout, de tijm en paprikapoeder.",
    "– Laat kort doorpruttelen op laag vuur. Kook ondertussen de spaghetti gaar.",
    "– Pureer de pompoensaus glad met een staafmixer.",
    "– Giet de spaghetti af en doe bij de pompoensaus.",
    "– Meng goed door en breng eventueel nog extra op smaak met de kruiden en wat peper en zout.",
    "– Maak af met wat gehakte amandelen en Parmezaanse kaas.",
    "– Serveer de pompoenspaghetti eventueel in de uitgeholde pompoenen."
  ],
  "ingredients": [
    "0",
    "Men neme (voor 4 personen):",
    "– 1 kleine oranje pompoen (of ca. 400 gram pompoenblokjes) + evt. 4 kleine pompoenen om de spaghetti in te serveren",
    "– een kleine ui",
    "– 250 milliliter kokosmelk",
    "– een flinke snuf gedroogde tijm",
    "– een flinke snuf paprikapoeder",
    "– 250 gram spaghetti (wij rekenen in dit recept 75 gram pp voor volwassenen en 50 gram voor kinderen, maar pas dit gerust naar wens aan)",
    "– een handje amandelen",
    "– Parmezaanse kaas",
    "– olijfolie, peper en zout"
  ],
  "__v": 1
}