{
  "hash": "d2b26bc54c35d4fa6c1802454e4cb00e3d4d40ad",
  "title": "Courgetti Fastonara",
  "image": "http://the5-2dietbook.com/wp-content/uploads/2014/01/001-550x412.jpg",
  "href": "http://the5-2dietbook.com/food/courgetti-fastonara",
  "extension": "Chrome",
  "firstAdded": "2016-01-26T19:07:40.222000",
  "users": [
    null
  ],
  "keywords": [
    "serves",
    "medium",
    "courgette",
    "cals",
    "white",
    "chestnut",
    "mushrooms",
    "tablespoonsg",
    "plain",
    "flavoured",
    "philadelphia",
    "light",
    "soft",
    "cheese",
    "depending",
    "flavour",
    "truffle",
    "olive",
    "oil",
    "calories",
    "use",
    "calorie",
    "spray",
    "parmesanitalian",
    "hard",
    "black",
    "pepper",
    "basil"
  ],
  "directions": [
    "0",
    "Method",
    "Add the olive or truffle oil to a non-stick saucepan and let it get pretty hot – then sauté the mushrooms till they’re browned. Don’t move them around too much, so they get nice caramelised edges.",
    "While the mushrooms are cooking, cut the courgette into very fine spaghetti like strands, or fettuccine-like noodles -you can use a sharp knife, a box grater or see my tip below about the Julienne Cutter I use which makes it very easy. Pat the 'noodles' dry with kitchen roll.",
    "When the mushrooms are browned, tip them into a warmed serving plate. Add the courgettes to the same pan, stir fry them in the little oil/moisture left from the mushrooms for 1 minute or so, depending on the thickness of the noodles (they take very little time to cook and you don't want them to go soggy).",
    "Add the cream cheese and cooked mushrooms to the pan, on a low heat, for 30 seconds or until the cream cheese begins to melt and cover the courgette. Tip onto a plate, and add lots of pepper and herbs, if using."
  ],
  "ingredients": [
    "0",
    "Serves 1",
    "1 medium courgette (around 34 cals)",
    "50g quartered white or chestnut mushrooms (7 cals)",
    "2 tablespoons/30g plain or flavoured Philadelphia Light or other soft cheese (40-45 depending on flavour)",
    "1/2 teaspoon truffle or olive oil (22 calories - or use 1-calorie spray)",
    "Optional: 10g finely grated parmesan/Italian hard cheese (40-45 cals)",
    "Fresh black pepper, plus fresh basil if you have some"
  ],
  "__v": 1
}