{
  "hash": "e445898909cc5a3a2cb121007bafb136a5ee58dc",
  "title": "Cauliflower Piccata",
  "image": "http://www.connoisseurusveg.com/wp-content/uploads/2016/07/cauliflower-piccata-4.jpg",
  "href": "http://www.connoisseurusveg.com/cauliflower-piccata/",
  "extension": "Chrome",
  "firstAdded": "2016-08-16T03:07:43.210000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Rinse cauliflower and remove outer leaves. Trim the stem so it's about level with the bottom of the crown. Set the crown on a cutting board, stem side down, and slice in half, making a cut straight down the center. Continue making parallel cuts, about ¾ inch apart, to cut the cauliflower into about 6 slabs.",
    "Stir flour, salt and pepper together in a shallow dish.",
    "Coat the bottom of a large nonstick skillet generously with oil and place over medium heat. Take one of your cauliflower slabs and dredge each side in the flour mixture. If you have a tough time getting it to stick, try brushing the surface of the cauliflower with a bit of non-dairy milk or water. Place the coated cauliflower slab into the skillet. Repeat for remaining slabs, arranging in a single layer in the skillet and avoiding overcrowding. Cook them in batches if they don't all fit nicely, adding oil to the skillet as needed.",
    "Cook cauliflower slabs for about 5 minutes, gently flip and cook five minutes more on opposite side, until they're just tender. Handle them carefully, as the coating is rather fragile. Remove from skillet and transfer to a paper towel-lined plate.",
    "Place vegan butter into skillet. When butter is melted, add shallot. Lower heat and cook for 5 minutes. Add wine, lemon juice and capers to skillet. Raise heat back up to medium and bring to a simmer. Allow to cook until reduced by half, about 5 minutes. Taste-test and season the sauce with salt and pepper to taste.",
    "Return cauliflower to skillet, and allow to cook just another minute or so, so it tenderizes a bit more and the coating sucks up some of the sauce.",
    "Divide pasta onto plates and top with cauliflower. Sprinkle with parsley and serve."
  ],
  "ingredients": [
    "0",
    "1 medium cauliflower crown",
    "½ cup whole wheat or all-purpose flour",
    "¼ tsp. salt",
    "¼ tsp. black pepper",
    "about ¼ cup olive oil",
    "3 tbsp. vegan butter",
    "1 large shallot, minced",
    "¼ cup dry white wine",
    "3 tbsp. lemon juice",
    "2 tbsp. capers",
    "salt and pepper to taste",
    "1",
    "cooked pasta of choice",
    "fresh parsley"
  ],
  "__v": 1
}