{
  "hash": "f08da4facc6e0283538f096ce9fd81d7adbdbcb2",
  "title": "Gluten-Free Wheat-Free Baking Tips + Substitutions",
  "image": "http://3.bp.blogspot.com/-yGLwaAx3dYs/VB4Mbtfj7uI/AAAAAAAAR-0/iQ77SE-Gh3I/s1600/sunflower-gluten-free-goddess.jpg",
  "href": "http://glutenfreegoddess.blogspot.com/2008/12/baking-cooking-substitutions-for-gluten.html",
  "firstAdded": "2015-01-17T09:05:36.771000",
  "users": [
    null
  ],
  "keywords": [
    "glutenfree",
    "nonwheat",
    "generally",
    "fall",
    "weights",
    "light",
    "allpurpose",
    "heavier",
    "blend",
    "medium",
    "flours",
    "mixed",
    "lighten",
    "tenderize",
    "help",
    "bind",
    "batter",
    "dough",
    "works",
    "tastes",
    "best",
    "starch",
    "result",
    "gummy",
    "texture",
    "starchy",
    "include",
    "white",
    "rice",
    "ubiquitous",
    "starches",
    "tapioca",
    "cornstarch",
    "potato",
    "flour",
    "different",
    "animal",
    "arrowroot",
    "akin",
    "purpose",
    "superfine",
    "sorghum",
    "known",
    "jowar",
    "certified",
    "oat",
    "closest",
    "option",
    "brown",
    "work",
    "opinion",
    "makes",
    "appetizing",
    "product",
    "tend",
    "unless",
    "proper",
    "fiber",
    "added",
    "grains",
    "psuedograins",
    "contain",
    "protein",
    "think",
    "buckwheat",
    "quinoa",
    "millet",
    "cornmeal",
    "nut",
    "meal",
    "beanlegume",
    "baking",
    "wheat",
    "similar",
    "denser",
    "darker",
    "color",
    "rise",
    "sticky",
    "substituting",
    "going",
    "match",
    "weight",
    "instance",
    "sub",
    "rises",
    "soft",
    "tender",
    "tends",
    "tad",
    "tough",
    "nicely",
    "wish",
    "combine",
    "achieve",
    "softness",
    "golden",
    "crust",
    "favor",
    "higher",
    "baked",
    "goods",
    "youll",
    "recipes",
    "featuring",
    "almond",
    "hazelnut",
    "groat",
    "related",
    "rhubarb",
    "tasting",
    "ive",
    "handle",
    "oats",
    "superior",
    "better",
    "plain",
    "startling",
    "high",
    "arsenic",
    "levels",
    "products",
    "recommend",
    "consuming",
    "lot",
    "research",
    "slightly",
    "feel",
    "dissolves",
    "mouth",
    "odd",
    "cookedrice",
    "use",
    "babycakes",
    "knock",
    "based",
    "chick",
    "pea",
    "boost",
    "lower",
    "carbs",
    "loathe",
    "soy",
    "metallic",
    "tastebuds",
    "celiac",
    "trouble",
    "digesting",
    "milled",
    "beans",
    "alternative",
    "subbing",
    "bean",
    "start",
    "using",
    "recipe",
    "tummy",
    "bake",
    "make",
    "sure",
    "polentastyle",
    "cakes",
    "breads",
    "muffins",
    "brings",
    "grainy",
    "avoiding",
    "corn",
    "try",
    "coconut",
    "unto",
    "itself",
    "rich",
    "highly",
    "absorbaent",
    "need",
    "fat",
    "stir",
    "sit",
    "behaves",
    "used",
    "flaxmeal",
    "bakingpancake",
    "substituted",
    "onetoone",
    "develop",
    "preferred",
    "needs",
    "longer",
    "time",
    "extra",
    "egg",
    "general",
    "blends",
    "inferior",
    "gummier",
    "adjust",
    "moisture",
    "level",
    "live",
    "altitude",
    "experience",
    "helps",
    "course",
    "follow",
    "instinct",
    "grow",
    "accustomed",
    "particular",
    "oven",
    "kitchen",
    "climate",
    "dry",
    "humid",
    "tips",
    "consistently",
    "undercooking",
    "middle",
    "sinking",
    "ovens",
    "quite",
    "temperamental",
    "new",
    "ones",
    "purchase",
    "thermometer",
    "gauge",
    "performing",
    "surprised",
    "reader",
    "discover",
    "preheating",
    "stage",
    "takes",
    "reaches",
    "true",
    "despite",
    "declares",
    "target",
    "check",
    "alone",
    "equal",
    "temp",
    "instead",
    "eye",
    "faster",
    "solve",
    "problem",
    "especially",
    "really",
    "adding",
    "flax",
    "seed",
    "karinas",
    "notes",
    "bit",
    "batters",
    "stiffer",
    "stretch",
    "xanthan",
    "gum",
    "thing",
    "climbs",
    "slow",
    "speed",
    "lift",
    "beaters",
    "encourage",
    "beater",
    "bowl",
    "figure",
    "eights",
    "slight",
    "angle",
    "practice",
    "technique",
    "soon",
    "winging",
    "goddess",
    "starchflour",
    "interchangeable",
    "softer",
    "end",
    "possibility",
    "sparingly",
    "turn",
    "dont",
    "gluey",
    "thickening",
    "gravy",
    "love",
    "gives",
    "spring",
    "tenderness",
    "pancake",
    "mixes",
    "basic",
    "super",
    "easy",
    "solution",
    "familiar",
    "waffle",
    "pamelas",
    "ultimate",
    "contains",
    "buttermilk",
    "limits",
    "tried",
    "advantage",
    "salt",
    "usually",
    "decrease",
    "converting",
    "fair",
    "leavening",
    "ideas",
    "template",
    "cooking",
    "fats",
    "main",
    "dairyfree",
    "gfcf",
    "vegan",
    "butter",
    "buttery",
    "flavor",
    "successfully",
    "years",
    "current",
    "mainstay",
    "organic",
    "oil",
    "choose",
    "quality",
    "silky",
    "mild",
    "lovely",
    "biscuit",
    "style",
    "solid",
    "shortening",
    "cutting",
    "quick",
    "pancakes",
    "bring",
    "warmer",
    "liquifies",
    "number",
    "popular",
    "hearthealthy",
    "wonderful",
    "feature",
    "herbs",
    "citrus",
    "strong",
    "flavors",
    "pumpkin",
    "virgin",
    "olive",
    "salad",
    "dressings",
    "prefer",
    "canola",
    "nongmo",
    "expeller",
    "pressed",
    "buy",
    "reputable",
    "brand",
    "cookies",
    "natural",
    "nondairy",
    "trans",
    "spectrum",
    "nonhydrogenated",
    "palm",
    "pie",
    "crusts",
    "crisps",
    "crumbles",
    "streusel",
    "toppings",
    "drawback",
    "lacks",
    "tasteless",
    "compensate",
    "good",
    "vanilla",
    "reason",
    "simply",
    "called",
    "thinner",
    "oils",
    "wetter",
    "indian",
    "ayurvedic",
    "boiled",
    "separated",
    "properly",
    "theoretically",
    "traces",
    "milk",
    "sugar",
    "lactose",
    "sensitive",
    "source",
    "confirm",
    "testing",
    "casein",
    "free",
    "disadvantage",
    "heart",
    "healthy",
    "proinflammatory",
    "health",
    "food",
    "matter",
    "ghee",
    "advocates",
    "saturated",
    "raises",
    "inflammation",
    "body",
    "available",
    "differing",
    "degrees",
    "usefulness",
    "soybean",
    "form",
    "whipped",
    "water",
    "useful",
    "harder",
    "margarine",
    "raise",
    "creamy",
    "nottootangy",
    "mayonnaise",
    "chocolate",
    "readers",
    "content",
    "kind",
    "substitution",
    "alternatives",
    "applesauce",
    "fruit",
    "nuts",
    "ginger",
    "cinnamon",
    "care",
    "tangy",
    "squash",
    "baby",
    "pears",
    "apricots",
    "prunes",
    "canned",
    "jarred",
    "purees",
    "fruits",
    "remember",
    "stronger",
    "fare",
    "equally",
    "molasses",
    "spices"
  ],
  "directions": [
    "0",
    "Egg Subs:",
    "My first choice is Ener-G Egg Replacer. It works well in most recipes. Whisk it with warm water for a light frothy texture and hot water for a thicker, binding effect. A recipe adjustment may be needed to help body and volume- adding a tablespoon of starch like tapioca, arrowroot, or applesauce helps. For more creaminess, you might try adding a teaspoon of fat as well, such as light olive oil or Vegenaise (yolks have fat, after all).",
    "If avoiding corn (Ener-G Egg Replacer may use a corn source according to several corn sensitive readers), substitute 1 tablespoon tapioca or potato starch plus 3 tablespoons water for each egg called for in recipe to help binding. You will need to increase leavening a bit to compensate- add an extra 1/4 teaspoon baking powder.",
    "Flax seed meal is a choice for those not allergic to flax seeds. Use two tablespoons ground flax meal plus 1/8 teaspoon baking powder blended with 3 tablespoons of water for each egg called for in recipe.",
    "Chia seeds can also be used as a gel for gluten-free baking. From the genus Salvia hispanica, chia is a plant in the Mint family- an excellent alternative for those of us allergic to flax seed.",
    "Note on using seed based gels: They often make gluten-free baked goods a tad gummy in the center- especially those based on rice flour. And they lack the leavening factor. Additional compensation in a recipe is needed to make the gels work. I would add 1/2 teaspoon more baking powder.",
    "Banana: Try a half mashed ripe banana plus 1/4 teaspoon baking powder for each egg. Think about flavors- banana is not always simpatico.",
    "Mayo: Use 3 tablespoons vegan mayonnaise in place of one egg, for binding. I would add a little extra leavening- 1/2 teaspoon baking powder.",
    "Tofu: Use 1/4 cup silken tofu for one egg for binding; I would add a little extra leavening- 1/2 teaspoon baking powder.",
    "Not vegan: Dissolve 1 tablespoon unflavored gelatin in 1 tablespoon cold water; add 2 tablespoons boiling water. Beat vigorously until frothy. I would also add a little extra leavening- 1/4 teaspoon baking powder. Gelatin does make it a little rubbery- so use as a last resort.",
    "Find my egg-free recipes here in my vegan index.",
    "Sugar-Free? Sugar substitutes include:",
    "In standard baking recipes, 2/3 to 3/4 cup honey (reduce liquid in recipe by 1/4 cup) can be substituted for 1 cup granulated or brown sugar. I would start with the lesser amount; gluten-free starches combined with honey may create a gummy texture.",
    "Honey or agave is not recommended for crisp cookies- the cookies will be chewier and softer. Flavor and density will also be affected.",
    "If you are a vegan, try using maple syrup (it adds a maple flavor- not always desirable) or gluten-free brown rice syrup, or organic raw agave syrup. I would start with the guidelines for honey, above.",
    "Blackstrap molasses (from cane or sorghum) can also be used. It has a distinctive, deep taste. Use roughly half, and add ginger and cinnamon.",
    "As a wrap-up, in general, when using a liquid sweetener, use less than the amount of sugar called for (taste test to adjust sweetness level). Adjust the liquid by two tablespoons less to begin with. And note that overall volume of the batter may be less, so you may have to use a smaller baking pan.",
    "For an extensive discussion about sugar substitutes see this post Sugar Blues: Gluten-Free Baking Without Sugar.",
    "Dairy Substitutions:",
    "A favorite dairy free substitute in gluten-free cooking and baking is organic light coconut milk. I use it in sauces, soups, curries and stir-fries. It’s fabulous in whipped sweet potatoes, pumpkin and winter squashes. Check and compare labels- as too much guar gum, a common additive in coconut milk, can act as a laxative for sensitive individuals.",
    "Another terrific non-dairy choice is hemp milk. It has a strong taste- and takes some getting used to- but hemp has nifty EFA's and Omegas and is richer, creamier than most other non-dairy milks (such as rice milk, soy milk or nut milks). I use it creamy sauces, smoothies, ice cream, and soups. I also use in creamy desserts like my fabulous Vegan Pumpkin Pie. Not all hemp milks are equal when it comes to taste, so shop around and taste test. And some (Living Harvest vanilla hemp milk, for example) may use a barley enzyme in the natural vanilla flavorings; always call the manufacturer to discuss the gluten-free safety of the product.",
    "Rice milk is thin but it works. Try vanilla rice milk in sweet recipes for a flavor boost.",
    "Nut milks and soy milks are silky and work beautifully in gluten-free baking.",
    "Here's how to make your own non-dairy condensed milk or evaporated milk.",
    "Sweetened Condensed Coconut Milk:",
    "3 cups coconut milk (or other non-dairy milk)",
    "1/2 cup organic sugar- or sweeten to taste with agave",
    "Stir ingredients together in a sauce pan and heat gently; cook slowly over low to almost medium heat, stirring constantly, until the volume is reduced to about 1 cup.",
    "Add some vanilla extract to taste, if you like; and a pinch of sea salt, if desired.",
    "Cool the condensed milk and refrigerate if not using right away",
    "For Evaporated Coconut or Non-Dairy Milk:",
    "As above, but omit the sugar and pour the milk into a saucepan; cook gently over low to medium heat, stirring until the coconut milk is thickened and reduced to 1 and 1/2 cups. Cool. Refrigerate.",
    "Some Dairy-Free Tips:",
    "For a tasty creamy sauce for comfort foods like mac and cheese try my vegan Cheesy Uncheese Sauce- it's scary good.",
    "In savory recipes try using a light vegetable broth in place of milk- this works in soups, and mashed potatoes that top my Vegetarian Shepherd's Pie, etc.",
    "For a thorough non-dairy resource check the wonderful web site Go Dairy-Free. Its author has a new cookbook and guide to dairy-free living that has extensive resources, titled Go Dairy Free.",
    "Gluten-Free Thickeners",
    "For making gravy, use a slurry made with arrowroot starch instead of wheat flour; it thickens better than gluten flour, anyway. I like to add a dash of dry sherry, brandy, or wine to the gravy as well. (What's a slurry? Stir a tablespoon of arrowroot starch into an equal amount of cold water. You now have a slurry. Add it to the gravy and stir over gentle heat till thickened.) Arrowroot, by the way, is a starchy powder made from West Indies tubers. It's a good choice for those avoiding corn and potato.",
    "Other starches also work for thickening gravy, sauces and soups:",
    "Potato starch is a Kosher favorite for thickening. Make a slurry and add it to gravies, sauces and soups. Stir constantly as you heat gently till thickened- and don't boil it. Potato flour can get lumpy. It's not my favorite thickener.",
    "Cornstarch may be used to thicken stir-fry sauces and chile that you'll be eating right away (it doesn't freeze well). Cornstarch also creates a glossy look (I don't like my gravy shiny) and it doesn't re-heat well. It also gets a bit gluey for my taste if it starts to over-cook.",
    "Tapioca starch (also a tuber- called manioc, yucca or cassava) thickens a sauce rather quickly. You can add it to a soup or sauce near the end of cooking time if you need to.",
    "Taste test and make sure the starch slurry you added has cooked enough so that your sauce, gravy or soup doesn't taste \"starchy\"; if it does, continue to stir and cook a bit longer.",
    "For making a roux- a cooked flour and butter paste used as a thickening base in white sauces, stews, cream soups, gumbo, and cheesy dishes like macaroni and cheese- there are several choices.",
    "Sweet rice flour is an excellent choice for making a roux; it has a lovely neutral taste and is tolerated by most- except those allergic to rice.",
    "If you need to avoid rice flour in a roux I might suggest using sorghum flour- it works.",
    "And if you are avoiding grains completely, try making a slurry with potato starch instead and adding it into the liquid as you heat it. Use sparingly- as potato starch or potato flour thickens and clumps quickly.",
    "Other thickening ideas include:",
    "Add some cooked mashed or baked potato, or even sweet potato; whisk it in; stir well and cook gently.",
    "If you can do eggs, adding egg yolks helps to thicken a sauce or soup base. Stir and cook through thoroughly but do not boil or heat too quickly; use gentle, lower heat and whisk to blend.",
    "Using gums for a gluten sub:",
    "Xanthan gum is a cellulose additive that adds stretch and viscosity to gluten-free recipes, but those who are hyper-sensitive to corn (xanthan gum is often derived from a corn base) might try using guar gum.",
    "Guar gum is legume derived, so those who are sensitive to beans, soy or legumes may react to it. Even if one is not allergic to legumes, guar gum may act as a laxative in sensitive individuals.",
    "I was recently asked about baking with no gums. Here are some thoughts:",
    "Try adding a tablespoon of potato starch, or tapioca starch (or arrowroot); certain starches have a binding ability, especially when whisked with warm liquid.",
    "If you can handle eggs- try adding an extra whipped egg white.",
    "Adding 1-2 tablespoons of honey- or agave- to a baking recipe adds moisture and binding.",
    "If you can tolerate flax seed meal; try making a gel and adding a tablespoon to recipes. It doesn't bind quite as well- but it adds fiber and has a lovely texture.",
    "For things like muffins and quick breads- I have a crazy thought. How about adding a half cup of fruit jam to the batter? The fruit pectin will help with binding and moisture.",
    "In all my experimenting, I have found that not using gums does make for a crumbly, more fragile result. Though flax seed meal can definitely help.",
    "Peanut Free:",
    "For a legume-free nut-free peanut butter substitute try using sunflower seed butter aka Sunbutter in recipes- it is delicious in cookies, cakes, brownies and stir-fry \"peanut\" sauce. Check with the manufacturer if you are highly allergic to peanuts; you'll want to confirm the sunflower seed butter was made in a peanut-free legume-free facility.",
    "Sesame seed butter (also called tahini) is another choice. It tends to be a tad bitter, though, and may not be kid friendly; I compensate by adding a little honey or agave, to taste.",
    "Other seed and nut butters include hemp butter, cashew butter, soy butter, pecan butter and almond butter; all may replace peanut butter in any recipe.",
    "Yeast-free:",
    "If you are allergic to baker's yeast you will need to find leavening that helps the bread or pizza dough rise. Baking powder and baking soda are two alternatives (use a teaspoon of lemon juice in the recipe to help activate the rising action). Check with your physician to see if baking powder and/or baking soda is acceptable for you. See my New Irish Soda Bread recipe here.",
    "For those of you using eggs, organic free-range eggs would be an excellent way to create rise in yeast-free bread baking. Try adding two extra egg whites, beaten till frothy. You may need even more, depending upon the recipe. Experiment with eggs and find what works for you."
  ],
  "ingredients": [
    "0",
    "Gluten-free non-wheat flours generally fall into three weights- light starch, all-purpose medium, or heavier whole grain. A blend of medium and heavy flours with some starch mixed in to lighten, tenderize, and help bind the batter or dough works best, and tastes best (too much starch can result in a gummy texture).",
    "Light, starchy GF flours include sweet rice flour*, white rice flour, and the ubiquitous gluten-free starches- tapioca starch, cornstarch, potato starch (NOT potato flour, which is whole different animal) and arrowroot starch.",
    "Medium flours are akin to 'all purpose flour'- these include sorghum flour, certified gluten-free oat flour, and superfine brown rice flour. If you cannot find sorghum flour (also known as jowar flour) certified gluten-free oat flour is the closest option. Brown rice flour will work in a pinch- though, in my opinion, makes for a less appetizing product. Rice flours tend to be gummy, unless proper fiber and starch is added.",
    "The heavier grains (including psuedo-grains like quinoa) tend to contain more protein. Think of flours like buckwheat, quinoa, millet, cornmeal, nut meal, and bean/legume flours as akin to baking with whole wheat flour. You get a similar denser product, often darker in color, and with less rise.",
    "*Note that sweet rice flour is very sticky.",
    "For substituting flours:",
    "If you are going to substitute a flour choice, match your flour weight. Sub sorghum with gluten-free oat flour, or brown rice flour (medium weight to medium weight), for instance, and sub heavier millet with heavier buckwheat. Sub cornstarch with potato starch or tapioca starch (starch to starch). Note that potato starch is light and rises soft, and tender, while tapioca starch tends to get a tad tough, though it does brown nicely. You may wish to combine these two starches to achieve both softness and a golden crust.",
    "I favor a higher protein (but tender) texture to my baked goods; so you'll find many recipes featuring whole grain sorghum flour, almond flour or hazelnut flour, buckwheat flour, (not a grain at all, but a groat, related to rhubarb) and millet flour.",
    "The best tasting gluten-free flour I've found is sorghum- also known as sweet sorghum and jowar. If you can handle oats- certified gluten-free oat flour is also superior.",
    "Brown rice flour is a better baking choice than plain white rice flour (but, please NOTE- with the startling high arsenic levels in brown rice products, I cannot recommend consuming a lot of brown rice flour- do your research on this).",
    "White rice flour has a slightly gummy mouth feel- it dissolves in the mouth- and has an odd cooked-rice taste. I tend not to use it. But if you like it, Babycakes? Knock yourself out.",
    "As for the bean based flours like soy and chick pea flour, many use them to boost protein and lower the carbs in gluten-free baking. I loathe soy and bean flours. They taste metallic to my tender tastebuds. And like many a celiac, I have trouble digesting them (milled beans!); but if beans work for you, it's an alternative high protein choice. Start by subbing only a part of the flour blend with a bean flour- say, start with using 1/2 cup in a recipe. See how you (and your tummy) like it.",
    "If you can bake with cornmeal (make sure it is certified gluten-free), I have many recipes with it- tender polenta-style cakes and breads and muffins. Gluten-free cornmeal brings a tender, sweet and slightly grainy texture to baked goods. (If avoiding corn, try substituting your own whole grain flour blend, or use almond meal as part of the blend.)",
    "Coconut flour is an animal unto itself. It is fiber rich and highly absorbaent. if you add it to a recipe blend, you may need to add more fat or liquid. Stir it in and let it sit to see how it behaves.",
    "For subbing coconut flour in a recipe- I have used flaxmeal, and almond meal.",
    "Your own preferred gluten-free flour blend (or baking/pancake mix) can be substituted in all of my baking recipes one-to-one. Texture and rise may be slightly different, however. You'll need to develop a feel for your own preferred blend and how it behaves (needs longer baking time? an extra egg white?). In general, GF blends based on white rice flour and starch will give you an inferior, gummier product.",
    "And please note- you may have to adjust the moisture level in my recipes if you use different flours than I have used or live at a different altitude. Experience helps, of course; follow your instinct as you bake and grow accustomed to how your particular gluten-free flour blend works with your oven, in your kitchen, and climate (dry or humid).",
    "Tips: If recipes are consistently under-cooking (gummy in the middle or sinking) your oven temperature may be off. Some ovens can be quite temperamental. Even new ones. Purchase an oven thermometer to gauge how your oven is performing. You may be surprised, as one reader was, to discover that your preheating stage takes additional time before it reaches true baking temperature- despite the on light that declares oven ready.",
    "If your oven is on target, but your baked goods are gummy, first check your flour blend- is is white rice based? That alone can equal gummy. Try baking at a higher temp- at 375º or 400º instead. Keep an eye on it- it will rise faster and bake faster. But it just may solve your problem- especially for breads.",
    "Adding fiber to your batter can really help texture. Try adding flax seed meal.",
    "Karina's Notes on gluten-free batter:",
    "Gluten-free batters are a bit different than wheat flour batters. They are stiffer at first, then stretch and get sticky as the xanthan gum and starches do their thing.",
    "If the batter \"climbs\" the beaters, slow down the speed and slightly lift the beaters to encourage the batter to move back down into the bowl. Move your beater around the bowl in figure eights, at a slight angle. Practice your technique- soon you'll be winging around gluten-free baking like a goddess.",
    "Starches:",
    "Gluten-free starches include cornstarch, arrowroot starch, tapioca starch/flour, and potato starch. In baking they are- for the most part- interchangeable. That said, tapioca starch on its own can bake up tough. So blend it with potato starch or cornstarch for a softer end product.",
    "Sweet rice flour is also a possibility, but it is a very sticky starch; use it sparingly in baking (no more than 1/4 cup) or the recipe may turn out gummy.",
    "Note: Potato flour is not the same as potato starch. I don't use potato flour in my baking; it's heavy, gluey and best used sparingly for thickening a gravy. But I love potato starch in breads and muffins and cakes- it gives breads spring, and tenderness.",
    "You can also add 1/4 cup flax seed meal to your flour blend for added fiber.",
    "Using Baking and Pancake Mixes as a Basic Flour Sub:",
    "This is a super easy solution- especially for those not familiar with gluten-free baking. For an all-purpose baking, waffle and pancake mix try Pamela's Ultimate Baking and Pancake Mix. Please note* it contains dairy (buttermilk) and almond meal- so it may be off limits to some, but it is the best gluten-free baking mix I've tried.",
    "The advantage to using a gluten-free baking or pancake mix in a recipe is: the xanthan gum and salt is already in the blend. I do not usually decrease the leavening in the recipe I am converting, however; gluten-free baking seems to fair better with an extra leavening boost.",
    "For gluten-free flour blend ideas and a basic GF flour template see Karina's Gluten-Free Baking + Cooking Tips.",
    "Fats:",
    "The main fat most of us need to substitute in gluten-free dairy-free (aka GF/CF) and vegan baking is butter. Butter is a tough one because it brings so much buttery flavor to the recipe. However, I've been baking and cooking successfully without it for years.",
    "My current mainstay? Organic coconut oil. Choose the best quality for silky texture and mild taste. It is lovely in sweet recipes. For biscuit style recipes I use it solid, as a shortening, cutting into the flour blend. For quick breads and pancakes, bring it to a warmer temperature so that it liquifies.",
    "Mainstay number two? Olive oil. This popular heart-healthy oil is wonderful in breads, muffins and cakes that feature herbs, citrus, and strong flavors like pumpkin. And of course, I love extra virgin olive oil for quick salad dressings.",
    "If you prefer Canola oil, choose a non-GMO, organic, expeller pressed, and buy a reputable brand.",
    "When I bake cookies, I use organic coconut oil or an all natural non-dairy no trans fats shortening. The one I use is Spectrum Organic Shortening made from non-hydrogenated palm oil. I also recommend the organic shortening for pie crusts. It also works for crisps and crumbles (note* I now prefer coconut oil in crumbles and streusel toppings). The one drawback with using this shortening is it lacks flavor- it is tasteless. To compensate I add an extra teaspoon of good vanilla extract to the recipe.",
    "If you prefer another vegetable oil besides olive oil- for whatever reason- simply substitute that oil for the butter called for in a recipe- but start with 1 to 2 tablespoons less. Some thinner oils may result in a wetter batter.",
    "Ghee is a popular fat in Indian and Ayurvedic cooking that is pure butter fat (boiled and separated from whole milk). If done properly ghee theoretically contains no traces of milk protein (casein) or the milk sugar lactose- but- if you are sensitive at all, please check your source to confirm that proper testing was done on the ghee and it is indeed, casein free. The advantage is the flavor- it tastes like butter. The big disadvantage is that ghee is pure saturated animal fat, and therefore not heart healthy- at all. Saturated animal fat is pro-inflammatory. Ghee is not a health food (no matter what ghee advocates say). Pure saturated animal fat raises inflammation in the body.",
    "There are several non-dairy margarine blends available- with differing degrees of usefulness in baking. Most are soybean oil based. Many have some form of casein added (check ingredients!). In general the softer or whipped blends have too much water in them to be useful in baking. The harder stick style (though not as healthy) is better in baking. I do not recommend using any trans fat margarine or shortening. Trans fats raise inflammation in the body.",
    "In a pinch, I have found that a creamy, mild and not-too-tangy gluten-free vegan mayonnaise can sub for part of the butter or margarine in a baking recipe- especially in chocolate recipes.",
    "Fat free?",
    "Some readers like to lower the fat content in a recipe. For this kind of substitution there are several alternatives. One of the most popular is to use applesauce. Applesauce works well in recipes with fruit, nuts, ginger, and cinnamon- such as muffins, cookies and cakes. I don't care for it in chocolate recipes. I don't like my chocolate tasting tangy.",
    "Another choice is canned pumpkin, squash or sweet potato. Or try gluten-free baby food- such as jarred pears or apricots, even prunes. Canned or jarred purees of fruits and vegetables add body and moisture to the batter, with zero fat.",
    "Remember- stronger fruit flavors fare better in recipes with equally strong tastes- such as molasses, warm spices such as cinnamon and ginger, and pumpkin."
  ],
  "__v": 1
}