{
  "hash": "d9076b7c079490d12943797783bb8645b0ac02b0",
  "title": "Fig and Walnut Panforte Recipe:",
  "image": "",
  "href": "http://whatscookingamerica.net/Cake/FigWalnutPanforte.htm",
  "extension": "Chrome",
  "firstAdded": "2015-09-03T17:39:35.614000",
  "users": [
    null
  ],
  "keywords": [
    "walnuts",
    "yellow",
    "raisins",
    "currants",
    "figs",
    "allpurpose",
    "flour",
    "zest",
    "lemon",
    "orange",
    "cinnamon",
    "nutmeg",
    "coriander",
    "cardamom",
    "white",
    "pepper",
    "granulated",
    "sugar",
    "honey",
    "unsalted",
    "butter"
  ],
  "directions": [
    "0",
    "* To toast nuts, preheat oven to 350° F. Place nuts in a single layer in an ungreased shallow pan or rimmed baking sheet. Bake 5 to 10 minutes, stirring once or twice during toasting to aid in even browning, or until they are golden brown. Remove from oven and remove from pan; let cool.",
    "Preparation:",
    "Preheat oven to 300° F. and adjust oven rack to center position. Brush an 8-inch cake pan or an 8-inch Springform Pan with butter. Cut a dish of parchment paper, or rice paper* to fit pan bottom; pat gently into place and spray with nonstick spray. NOTE: If using Asian-style rice paper, wet the paper to make it easier to cut, then trim it to the correct size with scissors.",
    "In a small bowl, mix the walnuts with the raisins, currants, figs, flour, orange zest, lemon zest, cinnamon, cloves, nutmeg, coriander, cardamom, and white pepper; set aside.",
    "In a medium saucepan over low heat, combine the sugar, honey, and butter. Cook, stirring occasionally to prevent scorching, until mixture comes to a full boil and reaches a temperature between 242 degrees F. and 248 degrees F. on a candy thermometer (soft ball stage); remove from heat. Immediately pour into the walnut mixture and stir together quickly.",
    "Pour batter into prepared springform pan. Smooth top with the slightly wet palm of your hand. It hardens quickly so work fast.",
    "Place cake in center of middle oven rack. Bake about 30 to 40 minutes until set. Remove from oven; cool completely on a wire rack.",
    "When cool, loosen panforte from pan by running a small knife around perimeter (if using a springform pan, remove sides of springform pan). Use knife to peel away parchment paper.",
    "When cool, it can be wrapped in several layers of plastic wrap and a layer of aluminum foil and stored in an airtight container for several weeks, or frozen for up to six months. Serve at room temperature. Cut into small wedges to serve.",
    "Makes 16 servings."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "1 1/2 cups toasted walnuts*",
    "1/2 cup yellow raisins",
    "1/2 cup currants",
    "1/2 cup chopped dried figs",
    "1/2 cup all-purpose flour",
    "Zest of one lemon",
    "Zest of one orange",
    "1 teaspoon ground cinnamon",
    "1/4 teaspoon ground cloves",
    "1/4 teaspoon freshly ground nutmeg",
    "1/4 teaspoon ground coriander",
    "1/4 teaspoon ground cardamom",
    "Pinch of white pepper",
    "3/4 cup granulated sugar",
    "3/4 cup honey",
    "2 tablespoons unsalted butter"
  ],
  "__v": 1
}