{
  "hash": "5c5ef3df67587c35230cd6dbf35cee560baaac86",
  "title": "Reese’s Peanut Butter Cheesecake",
  "image": "http://cf.tasteandtellblog.com/wp-content/uploads/2014/12/Reeses-Peanut-Butter-Cheeecake-recipe-Taste-and-Tell-1-opt.jpg",
  "href": "http://www.tasteandtellblog.com/reeses-peanut-butter-cheesecake/",
  "extension": "Chrome",
  "firstAdded": "2016-07-14T17:24:06.915000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 325°F.",
    "Put the chocolate sandwich cookies in a food processor and process until they form fine crumbs. Add in the butter and salt and process to combine. Press the mixture into the bottom and halfway up the sides of a 9-inch springform pan. Bake for 10-12 minutes, then set aside to cool. Wrap aluminum foil around the sides and the bottom of the springform pan tightly to ensure water cannot leak through.",
    "Beat the cream cheese until smooth. Add in the eggs, one at a time, scraping down the sides of the bowl in between each addition. Add in the brown sugar, peanut butter, cream and vanilla; beat until combined. Gently fold in the chopped up Reese’s Miniatures. Pour the mixture into the cooled crust.",
    "Place the pan inside a larger pan and carefully add about 1 inch of hot water in the larger pan. Bake the cheesecake until it is just set, about 1 hour 15 minutes. Turn off the oven and allow the temperature to come down gently for about an hour. Remove from the oven, cool completely, then refrigerate until completely cool.",
    "To make the chocolate topping, heat the cream until simmering, just before boiling. Remove from the heat and add the chocolate chips. Allow the mixture to sit for a couple minutes, then stir until smooth. Pour over the top of the cheesecake, allowing it to drip down the sides. Sprinkle the Reese’s minis over the top of the cheesecake."
  ],
  "ingredients": [
    "0",
    "30 chocolate sandwich cookies",
    "6 tablespoons butter, melted",
    "Dash of salt",
    "1",
    "32 oz cream cheese",
    "5 eggs",
    "1½ cups brown sugar",
    "1 cup smooth peanut butter",
    "½ cup cream",
    "1 teaspoon vanilla",
    "12 oz Reese’s Peanut Butter miniature cups, unwrapped and roughly chopped",
    "2",
    "½ cup cream",
    "1 cup semi-sweet chocolate chips",
    "1 (8 oz) package Reese’s Minis"
  ],
  "__v": 1
}