{
  "hash": "592b4ba03636ae6e9ab4ccdfe68c9f4a9fb1d64f",
  "title": "Beef rendang & turmeric rice",
  "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/beef-rendang-turmeric-rice.jpg?itok=DlBYtKBK",
  "href": "http://www.bbcgoodfood.com/recipes/beef-rendang-turmeric-rice",
  "extension": "",
  "firstAdded": "2016-09-21T19:12:00.744000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the paste, soak the chillies in boiling water for 15 mins. Drain, remove seeds and whizz with the rest of the paste ingredients in a small food processor until smooth.",
    "Heat the oil in a wok or a heavy-based flameproof casserole dish. Fry the paste for 5 mins until the aroma is released. Add the beef and the lemongrass, and mix well. Once the beef starts to lose its pinkness, add the coconut milk and 250ml water. Bring to the boil, then lower to a simmer, uncovered. Stir occasionally to avoid sticking, and more often towards the end.",
    "Meanwhile, toast the coconut in a frying pan on a low heat for 5-7 mins until golden brown. Set aside to cool. Using a blender, coarsely blend it to finer pieces – but not too fine. Put to one side.",
    "After 2 hrs, add the coconut, kaffir lime leaves, chicken stock powder, tamarind paste, sugar and salt to the pan. Simmer for 30 mins more. You should start to see the oil separating from the mix. It’s ready when the meat is tender and almost falling apart.",
    "For the rice, use a heavy-based saucepan with a lid. Heat the oil in the pan and add the mustard seeds. Once the seeds start popping, add the turmeric, curry leaves (if using) and rice, and mix well. Add the chicken stock and 1 litre of water. Bring to the boil, then turn down to the lowest simmer and cook, covered, for 5 mins. Remove from the heat, with the lid on and leave to steam for 25 mins."
  ],
  "ingredients": [
    "0",
    "3 tbsp vegetable oil",
    "2kg beef Beef bee-fThe classic cut of meat for a British Sunday roast, beef is full of flavour, as well as being a… shin or skirt, cut into bite-sized cubes",
    "2 lemongrass stalks, bashed (see 'Tip' for how to prepare)",
    "2 x 400ml cans coconut milk",
    "4 tbsp desiccated coconut",
    "2 kaffir lime leaves, torn",
    "1½ tbsp chicken stock powder (we used one from an Asian supermarket)",
    "2 tbsp tamarind paste",
    "1 tsp golden caster sugar",
    "¼ tsp salt"
  ],
  "__v": 1
}