{
  "hash": "1028fa7bff185a5481513a3d2540d332da30084a",
  "title": "Simple Labor Day Salad Starring Lemony Almond Cheese",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2012/08/Labor-Day-Salad-Starring-Lemony-Almond-Cheese.jpeg",
  "href": "http://www.onegreenplanet.org/vegan-food/simple-salad-starring-lemony-almond-cheese/",
  "extension": "",
  "firstAdded": "2015-04-01T08:02:22.511000",
  "users": [
    null
  ],
  "keywords": [
    "almonds",
    "miso",
    "contents",
    "probiotic",
    "capsule",
    "dulse",
    "nutritional",
    "yeast",
    "mild",
    "leafy",
    "green",
    "use",
    "grape",
    "tomatoes",
    "regular",
    "ones",
    "onions",
    "red",
    "best",
    "drizzle",
    "juice",
    "andor",
    "zest",
    "lemon"
  ],
  "directions": [
    "0",
    "Put the almonds in a food processor and process with just barely enough water to make it smooth.",
    "While processing, add the dulse, miso paste and the contents of one probiotic capsule. If you would like, you can add a dash of nutritional yeast as well.",
    "Transfer paste to a cheesecloth-lined strainer. I like to place the cheesecloth in a fine mesh sieve and put that over a bowl to catch the water that drips out.",
    "Much like yogurt, the cheese needs time to culture. Place the bowl in a warm location overnight. I used the inside of my gas stove.",
    "After about 12 hours, smell and taste the cheese. Does it smell slightly cheesy and taste fermented enough? If it does, you’re done. Wrap up in cheesecloth, shape the cheese into whatever shape you want and put it in the fridge to ripen. If it doesn’t, put it back in the warm place for awhile.",
    "Assemble the veggies into a salad and crumble the cheese over the top."
  ],
  "ingredients": [
    "0",
    "1 c. blanched almonds",
    "1 t. sweet miso paste",
    "The contents of one probiotic capsule",
    "1/4 t. dulse",
    "Nutritional yeast (optional)",
    "1",
    "Any mild leafy green",
    "Tomatoes (use grape tomatoes or chop regular ones)",
    "Chopped onions (I like red best)",
    "A drizzle of lemon juice and/or the zest of one lemon (optional)"
  ],
  "__v": 1
}