{
  "hash": "d1d8c1c42e759ea9e8e5b89885934d2bd26ca9a4",
  "title": "Instant Pot Chicken Alfredo",
  "image": "",
  "href": "https://www.shugarysweets.com/wp-json/mv-create/v1/creations/281/print",
  "extension": "Chrome",
  "firstAdded": "2019-03-23T16:47:18.278000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "First, set your Pressure Cooker on your counter and plug it in. Find a safe spot that when you release the pressure, you have clearance above.",
    "Next, layer your ingredients in the order specified. This makes a difference. Start by adding your chicken broth, then heavy whipping cream, and fresh pressed garlic.",
    "Do not stir. Next, break your fettuccine noodles in half. This helps them fit in the pressure cooker. Place them in your milk and broth mixture gently, moving around slightly until they are covered completely.",
    "Top with 1 lb fresh chicken breast (or frozen actually works with this recipe too). Lay over the top (they don't need to be covered with liquid.",
    "Secure your lid and make sure your vent is turned to pressure (each version is different so check your manual to make sure you understand how to prep your Instant Pot for cooking).",
    "Set your Instant Pot for \"Manual\" for 8 minutes. Allow it to come to pressure, then the timer will count down the 8 minutes.",
    "Once the 8 minutes are done, allow it to \"NATURALLY\" release (meaning don't touch it) for an additional 8 minutes. Once that time is up, do a QUICK RELEASE.",
    "Open carefully (away from your face so the steam doesn't burn you)! Remove the chicken (to shred it, or slice it). Then add the parmesan cheese. I use freshly shredded parmesan (not the green can stuff). Stir your noodles with the cheese, then add back your chicken. Salt and pepper, generously, to taste.",
    "Allow it to sit for about 1 or 2 minutes to thicken if needed."
  ],
  "ingredients": [
    "0",
    "1 1/2 cups chicken broth",
    "1 1/2 cups heavy whipping cream",
    "1 tsp pressed garlic (several cloves)",
    "1/2 lb fettuccini noodles, broken in half",
    "1 lb chicken breast",
    "1 cup parmesan cheese",
    "salt and pepper, to taste"
  ],
  "__v": 1
}