{
  "hash": "6d52359272e6e89aa84d337ea63ccf08a7f20593",
  "title": "Dijon and Cognac Beef Stew",
  "image": "",
  "href": "https://cooking.nytimes.com/recipes/1017085-dijon-and-cognac-beef-stew",
  "extension": "Chrome",
  "firstAdded": "2017-03-26T15:28:05.368000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "PREPARATION",
    "Place salt pork in a Dutch oven or a large heavy kettle over low heat, and cook until fat is rendered. Remove solid pieces with a slotted spoon, and discard. Raise heat, and add onion and shallots. Cook until softened but not browned, 10 to 15 minutes. Use a slotted spoon to transfer to a large bowl.",
    "If necessary, add 2 tablespoons butter to the pan to augment fat. Dust beef cubes with flour, and season with salt and pepper. Shake off excess flour, and place half the cubes in the pan. Cook over medium-high heat until well browned, almost crusty, on all sides, then transfer to a bowl with onions. Repeat with remaining beef.",
    "Add Cognac to the empty pan, and cook, stirring, until the bottom is deglazed and the crust comes loose. Add stock, Dijon mustard and 1 tablespoon Pommery mustard. Whisk to blend, then return meat and onion mixture to pan. Lower heat, cover pan partway, and simmer gently until meat is very tender, about 1 1/2 hours.",
    "Add carrots, and continue simmering for 30 minutes, or until slices are tender. As they cook, heat 2 tablespoons butter in medium skillet over medium-high heat, and sauté mushrooms until browned and tender.",
    "Stir mushrooms into stew along with remaining mustard and red wine. Simmer 5 minutes, then taste, and adjust seasoning. Serve hot."
  ],
  "ingredients": [
    "0",
    "¼pound salt pork, diced",
    "1large onion, finely diced",
    "3shallots, chopped",
    "2 to 4tablespoons butter, as needed",
    "2pounds beef chuck, in 1-inch cubes",
    "2tablespoons flour",
    "Salt and freshly ground black pepper",
    "4tablespoons butter, as needed",
    "½cup Cognac",
    "2cups beef stock",
    "½cup Dijon mustard",
    "4tablespoons Pommery mustard",
    "4large carrots, peeled and cut into half-moon slices",
    "½pound mushrooms, stemmed, cleaned and quartered",
    "¼cup red wine"
  ],
  "__v": 1
}