{
  "hash": "83e4b074b4dbe8c446580c54274c996c4e38809e",
  "title": "Jamaican Beef Patties Recipe",
  "image": "http://f.tqn.com/y/homecooking/1/W/c/s/1/jamaicanpatties_getty2400.jpg",
  "href": "http://homecooking.about.com/od/beefrecipes/r/blbeef94.htm?utm_source=pinterest&utm_medium=social&utm_campaign=shareurlbuttons_nip",
  "extension": "Chrome",
  "firstAdded": "2016-09-07T07:23:17.941000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the pastry:Whisk together flour, curry powder, and salt in a large bowl. Place in the bowl of a food processor fitted with the metal blade. Add shortening and margarine. Pulse until mixture is crumbly. Add cold water and pulse just until a dough forms. Do not over-process.Roll dough on a floured wooden cutting board to 1/8-inch thickness. (At this point, you may cover the dough ball in plastic wrap and refrigerate overnight.",
    "Let rest at room temperature for 15 minutes before proceeding.) Cut circles 8 inches in diameter (use a paper template). Cover circles with plastic wrap until ready to use.For the filling:In a heavy skillet over medium heat, saute onion and Scotch bonnet chile peppers in margarine until softened. Add ground beef, curry powder, thyme, allspice, salt, and pepper. Saute, stirring often, until beef is browned and broken apart, about 10 minutes.Stir breadcrumbs and beef stock into the ground beef. Cover and simmer 10 minutes, stirring occasionally, until all the liquid has been absorbed. It should not be watery, yet still remain moist. Remove from heat and let cool for 10 minutes.Preheat oven to 400 F. Line baking sheets with Silpat baking liners or grease pans.Place 2 to 3 tablespoons of the meat filling in the center of each pastry circle. Moisten the edges of the circles, fold in half, and seal edges with the tines of a fork. Mix remaining water with the egg. Brush the tops of the patties with the egg wash.",
    "Bake 30 to 40 minutes until golden.Let rest for 10 minutes before serving.Yield: 10 patties"
  ],
  "ingredients": [
    "0",
    "Pastry:",
    "2 cups all-purpose flour",
    "1/2 Tablespoon curry powder",
    "1/4 teaspoon salt",
    "1/4 cup solid shortening",
    "1/4 cup (1/2 stick or 4 Tablespoons) cold margarine",
    "1/3 cup icy cold water",
    ".",
    "Meat Filling:",
    "2 Tablespoons margarine",
    "1 small white onion, finely chopped",
    "1/4 teaspoon chopped Scotch bonnet chile pepper",
    "1/2 pound lean ground beef",
    "1/2 teaspoon curry powder",
    "1/2 teaspoon dried thyme, crushed",
    "1/2 teaspoon ground allspice berries",
    "1/2 teaspoon salt",
    "1/2 teaspoon freshly ground black pepper",
    "1/4 cup breadcrumbs",
    "1/4 cup beef or chicken stock",
    "1/4 cup water",
    "1 egg, beaten"
  ],
  "__v": 1
}