{
  "hash": "17b60c04848b6efd32e1fc5a10e7d0815117b94d",
  "title": "Salt-Baked Potatoes with Roasted Garlic and Rosemary Butter",
  "image": "",
  "href": "http://www.americastestkitchen.com/recipes/6685-salt-baked-potatoes-with-roasted-garlic-and-rosemary-butter?tag=atkntk-20&extcode=LN15C2QAA&sourcekey=CL15032AA",
  "extension": "Chrome",
  "firstAdded": "2015-03-14T10:17:27.627000",
  "users": [
    null
  ],
  "keywords": [
    "salt",
    "russet",
    "potatoes",
    "scrubbed",
    "sprigs",
    "rosemary",
    "garlic",
    "outer",
    "papery",
    "skin",
    "head",
    "discarded",
    "olive",
    "oil",
    "unsalted",
    "butter",
    "softened"
  ],
  "directions": [
    "0",
    "Adjust oven rack to middle position and heat oven to 450 degrees. Spread 2 1/2 cups salt in even layer in 13 by 9-inch baking dish. Gently nestle potatoes in salt, broad side down, leaving space between potatoes. Add rosemary sprigs and garlic, cut side up, to baking dish. Cover baking dish with foil and crimp edges to tightly seal. Bake 1 1/4 hours; remove pan from oven. Increase oven temperature to 500 degrees. 2. Carefully remove foil from baking dish. Remove garlic and set aside to cool. Brush exposed portion of each potato with 1 teaspoon oil. Return uncovered baking dish to oven and bake until potatoes are tender when pierced with tip of paring knife and skins are glossy, 15 to 20 minutes. 3. Meanwhile, once garlic is cool enough to handle, squeeze root end until cloves slip out of their skins. Using fork, mash garlic, butter, 1/8 teaspoon kosher salt (or pinch table salt) and minced rosemary to smooth paste. Remove any clumped salt from potatoes (holding with kitchen towel if necessary), split lengthwise, top with portion of butter, and serve immediately."
  ],
  "ingredients": [
    "0",
    "2 1/2 cups plus 1/8 teaspoon salt",
    "4 russet potatoes, scrubbed and dried",
    "2 sprigs plus 1/4 teaspoon minced fresh rosemary",
    "1 whole head garlic, outer papery skin removed and top quarter of head cut off and discarded",
    "4 teaspoons olive oil",
    "4 tablespoons unsalted butter, softened"
  ],
  "__v": 1
}