{
  "hash": "359e9d475eafaf90332ca6428bc54d7a472d6968",
  "title": "Blueberry Cupcakes with Blueberry Cream Cheese Frosting",
  "image": "http://stlcooks.com/wp-content/uploads/2013/05/blueberry_cupcakes.jpg",
  "href": "http://stlcooks.com/2013/06/blueberry-cupcakes-with-blueberry-cream-cheese-frosting/",
  "extension": "Chrome",
  "firstAdded": "2015-08-20T21:54:23.121000",
  "users": [
    null
  ],
  "keywords": [
    "cupcakes",
    "unsalted",
    "butter",
    "softened",
    "allpurpose",
    "flour",
    "baking",
    "salt",
    "granulated",
    "sugar",
    "lemon",
    "zest",
    "eggs",
    "freeze",
    "blueberries",
    "pulverized",
    "mini",
    "food",
    "processor",
    "lowfat",
    "buttermilk",
    "pureed",
    "vanilla",
    "frosting",
    "cream",
    "cheese",
    "confectioners"
  ],
  "directions": [
    "0",
    "Cupcakes:",
    "Preheat oven to 350 degrees. Line cupcake tins with liners.",
    "Mix together flour. baking powder and salt. Set aside.",
    "In a large measuring cup or bowl, mix together buttermilk, blueberry puree and vanilla extract. Set aside until needed.",
    "Using an electric mixer, beat butter, granulated sugar, and lemon zest in a mixing bowl until pale, about 2 minutes. Add eggs one at a time, mixing well after each addition. Mix in pulverized blueberries.",
    "Mix in flour mixture in three batches, alternating with two batches of buttermilk mixture. Mix until just combined, scraping down bowl as needed. (I like to mix the last bit by hand using a spatula to make sure I get all the stuff at the bottom.) Scoop batter into cupcake tins.",
    "Bake until golden brown and a toothpick inserted into center of cake comes out clean, about 21 to 24 minutes. Allow cupcakes to cool in tins for 10 minutes, and then remove cupcakes and place them on a cooling rack.",
    "Frosting:",
    "In a large mixing bowl, mix butter until it is softened and uniform. Add cream cheese and beat together until it is uniform. Add pulverized blueberries. Add 3 cups of sugar to the mixture and mix. Add more sugar if necessary. Mix again until mixture is creamy and spreadable. Add more sugar if necessary, otherwise prepare to frost cake."
  ],
  "ingredients": [
    "0",
    "For cupcakes:",
    "1 cup (2 sticks) unsalted butter, softened",
    "3 cups all-purpose flour",
    "1 tablespoon baking powder",
    "1/2 teaspoon salt",
    "2 cups granulated sugar",
    "1 tablespoon finely grated lemon zest",
    "4 large eggs",
    "1.2 oz (34 grams) freeze dried blueberries, pulverized in a mini food processor",
    "3/4 cup low-fat buttermilk",
    "1/2 cup pureed fresh blueberries",
    "1 teaspoon pure vanilla extract",
    "For frosting:",
    "1 cup of butter, softened",
    "8 oz of cream cheese, softened",
    "1.2 oz (34 grams) freeze dried blueberries, pulverized in a mini food processor",
    "3-5 cups of confectioners sugar"
  ],
  "__v": 1
}