{
  "hash": "b37b06e435a44143d4a699558272b9c43612e43c",
  "title": "Cuban Roast Pork",
  "image": "",
  "href": "http://recipe-folder.com/recipe/5c2c08911d4c575ccd824d45",
  "extension": "User Added",
  "firstAdded": "2019-01-02T00:40:49.390000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Buy a nice large pork shoulder or fresh ham try to buy with the skin on the fresh ham. I am doubtful you will find a pork shoulder with the skin on it but you can try. THE NIGHT BEFORE: Take your pork shoulder or fresh ham and stab it all over making deep stabbings in the meat all over the roast. Next take your salt pour about two tablespoons full in your hands and rub deep all over the pork roast or fresh ham sticking your fingers in the deep stabbed holes to penetrate the salt well into the meat. Do this all around the fresh ham. You will need about 2 tablespoons of salt all together. If it is a very large fresh ham you might need as much as three tablespoons of salt. Rubbing deep into the meat all over and into the holes made with a sharp knife. Please be careful with the knife when stabbing the pork so as to not cut yourself. Make sure your hands are dry as well as the handle of the knife when stabbing the pork. You do not want your hand to slide down onto the sharp blade as I have seen happen when stabbing the pork.",
    "1",
    "After salting put the pork to a side. In a blender add the lime/lemon or sour orange juice, garlic cloves, and the seasonings bay leaf, cumin powder, oregano, pepper, 1 teaspoon salt. Blend on high until all is liquefied. This is your Cuban Mojo, pour one cup of the mojo in a jar cover and reserve for later. Now take your pork roast and pour the rest of the sauce all over the pork roast rubbing the mojo sauce deep into the pork meat in the slits or holes. The secret is to make sure you rub your pork meat roast or fresh ham with all this lime/garlic sauce making sure it is well introduced into the meat. When done sprinkle a little more oregano, cumin, black pepper over the entire roast again just a little sprinkle. Cover with aluminum foil; and refrigerate until the next day for roasting.",
    "2",
    "Next day remove pork from the refrigerator let stand on the counter for at least an hour then put into a preheated 325 degree oven. Depending on how large a roast you have roast about 3 to 4 hours or a little more. Pour a half cup of the reserved mojo and baste your roast every hour with some of the mojo. Roast is done when the juices run clear and the meat is tender. Do not cover with aluminum foil to roast. You can tent the roast with aluminum foil but do not crimp the edges all arond. You want to roast your pork meat not steam it. I do not even tent mine. If the roast starts to get to brown on top tent it with the foil. Take a large piece of foil and fold in half then put over the roast leaving the sides open, no crimping. A five pond roast can take as long as five or six hours slow roasting. When done remove roast from the oven take out of the pan put into another pan. Let roast hang out for a bit.",
    "3",
    "In your pan there should be lots of pan drippings pour them into a frying pan over medium heat and add the onions and fry them in the drippings. Next take half cup of the reserved mojo from the refrigerator and pour into the onions sauteing everything for about five minutes. After about 10 minutes slice all of your roast and pour the mojo with onions all over the meat mixing it well into all of the pork meat. Serve with Cuban black beans and white rice. See my postings for these dishes.",
    "4",
    "There is another traditional dish served with the pork, rice, and black beans. It is called Yuca (Casava)it is boiled when tender it is served with the pork, black beans and rice. It looks like boiled potato only it is long and very starchy. It is served with a mojo sauce that is also pored over it but only lemon or lime juice and fresh garlic is used. But that is another recipe. It is a tradition to also include that dish with the Cuban roast pork dinner. Dont forget the Crispy Cuban bread and the Sangria or wine, For dessert pass a delicious flan. Buen Apetito"
  ],
  "ingredients": [
    "0",
    "1 large 4 or 5 pound pork roast shoulder or fresh ham (ham that is not cured or smoked or cooked)",
    "1",
    "2 c sour orange or fresh lime or lemon juice",
    "2",
    "1 large bay leaf",
    "3",
    "2 tsp dried oregano",
    "4",
    "2 tsp cumin powder",
    "5",
    "2 Tbsp salt and 1 teaspoon salt.",
    "6",
    "1/2 tsp black pepper",
    "7",
    "20 clove fresh garlic peeled, cloves can be left whole",
    "8",
    "·",
    "9",
    "cuban mojo sauce",
    "10",
    "2 large onions sliced in thin rounds",
    "11",
    "1/2 c roast pork pan drippings",
    "12",
    "1/2 c reserved garlic and lime sauce mixture"
  ],
  "__v": 1,
  "hidden": true
}