{
  "hash": "cea7c18d48919208cddcc0b44749702f6b7ec4c0",
  "title": "Kittencal's Italian Melt-In-Your-Mouth Meatballs",
  "image": "http://img.sndimg.com/food/image/upload/w_266/v1/img/recipes/69/17/3/picWHFvSl.jpg",
  "href": "http://www.food.com/recipe/kittencals-italian-melt-in-your-mouth-meatballs-69173",
  "firstAdded": "2014-12-09T15:02:14.993000",
  "users": [
    null
  ],
  "keywords": [
    "lbs",
    "mixture",
    "beef",
    "pork",
    "work",
    "egg",
    "slightly",
    "parmesan",
    "cheese",
    "use",
    "hold",
    "meat",
    "dry",
    "breadcrumbs",
    "slices",
    "bread",
    "garlic",
    "salt",
    "black",
    "pepper",
    "milk",
    "oregano",
    "parsley"
  ],
  "directions": [
    "0",
    "Mix all ingredients together in a large bowl.",
    "Shape into small meatballs (at this point you can place on a jelly-roll/baking sheet and freeze to use later, or cover with plastic wrap refrigerate up to 24 hours before using).",
    "Drop the meatballs into simmering pasta sauce, do not stir for at least 20 minutes or you will risk breaking the meatballs.",
    "Continue cooking in the simmering sauce for another 20 minutes (depending on how fast your sauce is simmering 40 minutes total should fully cook the meatballs).",
    "After the 40 minutes cooking time continue cooking your sauce with the meatballs in for as long as desired.",
    "**note** you may also bake the meatballs at 350 degrees F for 25 minutes or until cooked through."
  ],
  "ingredients": [
    "0",
    "1 1/2 lbs ground beef (a mixture of 1 pound ground beef and 1/2 pound ground pork will work well also)",
    "1 large egg, slightly beaten",
    "1/2 cup grated parmesan cheese",
    "1/3 cup breadcrumbs (or use enough to hold the meat together (no dry breadcrumbs? just soak 3 slices of bread in the 1/3 )",
    "1 -2 tablespoon fresh minced garlic (or use 1 teaspoon garlic powder or to taste)",
    "1 -2 teaspoon salt (or to taste, I use 2 teaspoons seasoned salt)",
    "1 teaspoon fresh ground black pepper",
    "1/3 cup milk (can use up to 1/2 cup milk)",
    "1/2 teaspoon dried oregano (optional, or to taste)",
    "1/4 cup chopped fresh parsley (or 2 tablespoons dried parsley)"
  ],
  "__v": 1
}