{
  "hash": "38f2144a9143f06429d4ad10e5fc75a1994322ce",
  "title": "Bacon-and-Egg Ramen Noodle Bowl Serves 4",
  "image": "http://www.foodandwine.com/fwx/sites/production/files/fwx-stacked-breakfast-bowl.jpg",
  "href": "http://www.foodandwine.com/fwx/food/dont-wait-lunch-have-noodles-breakfast?xid=NL_FWxNL042115RamenIsTheBest",
  "extension": "Chrome",
  "firstAdded": "2015-04-21T18:53:05.881000",
  "users": [
    null
  ],
  "keywords": [
    "serves",
    "eggs",
    "slices",
    "smoked",
    "bacon",
    "panko",
    "breadcrumbs",
    "salt",
    "pepper",
    "canola",
    "oil",
    "frying",
    "ginger",
    "garlic",
    "pork",
    "stock",
    "soy",
    "box",
    "ramen",
    "egg",
    "noodles",
    "spinach",
    "green",
    "onions",
    "red",
    "chiles",
    "canned",
    "bamboo",
    "shoots",
    "chile",
    "bunch",
    "cilantro",
    "radishes"
  ],
  "directions": [
    "0",
    "Preheat oven to 350°.",
    "Bring a saucepan of water to boil. Carefully place eggs in water and boil for 5 1/2 minutes. Remove and place directly in an ice bath.",
    "Line a baking tray with parchment paper and bake bacon for 25 to 30 minutes, turning halfway through, until crispy.",
    "While the bacon is cooking, prepare the eggs. In a medium bowl, combine panko, breadcrumbs and a pinch of salt and pepper, then stir together. In the other medium bowl, crack and beat one egg. Carefully peel the soft-boiled eggs. Heat 2 1/2 inches of canola oil in a large saucepan to 350°. Dip soft-boiled eggs, first in the egg wash until coated and then the breadcrumb mixture, ensuring the coating completely covers the egg. Repeat a second time. Fry for 2 minutes, until eggs are golden brown on all sides. Carefully remove eggs and set aside on a wire rack to cool.",
    "Heat a large saucepan over medium high and add vegetable oil. When hot, add ginger and garlic and cook for 30 seconds, stirring often. Pour in stock and soy sauce and bring to a boil. Add noodles and cook according to package instructions in the stock. Using tongs, divide the noodles among 4 large bowls and pour over the remaining stock.",
    "Top noodles with 1 egg, 2 pieces of bacon, 1/4 cup of spinach, green onions, chiles and bamboo shoots. Garnish with cilantro and radishes.",
    "Note: If you can't find bamboo shoots in chile oil, kimchi is a fantastic and delicious option."
  ],
  "ingredients": [
    "0",
    "Serves 4",
    "5 eggs",
    "8 slices smoked bacon",
    "1/2 cup panko",
    "1/2 cup breadcrumbs",
    "Salt and pepper",
    "Canola oil, for frying",
    "1 teaspoon vegetable oil",
    "1 tablespoon ginger, grated",
    "2 cloves garlic, finely diced",
    "8 cups pork (or vegetable) stock",
    "1 tablespoon soy sauce",
    "1 box (300 grams) dried ramen (or egg) noodles",
    "1 cup chopped spinach",
    "2 green onions, sliced",
    "2-3 red chiles, finely sliced",
    "1/2 cup canned bamboo shoots in chile oil",
    "Small bunch of cilantro, to garnish",
    "Sliced radishes, to garnish"
  ],
  "__v": 1
}