{
  "hash": "b0f4f44d666f0c9136e550476024c66761d7bdb8",
  "title": "Chickpea Chili on Baked Potatoes",
  "image": "",
  "href": "https://www.forksoverknives.com/recipes/chickpea-chili-baked-potatoes/?utm_medium=newsletter&utm_campaign=Baked-Potatoes-8/26&utm_source=mailchimp&utm_term=Chickpea-Chili",
  "extension": "Chrome",
  "firstAdded": "2017-08-26T23:23:05.171000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place the soaked and drained chickpeas in a medium saucepan and add 3 cups water. Bring to a boil over high heat. Reduce the heat to medium and simmer, partially covered, until they are tender to the bite but not falling apart, 30 to 45 minutes. Add water as necessary to keep the chickpeas covered. Drain and set aside.",
    "Preheat the oven to 450°F.",
    "Use a fork to poke holes in the potatoes in several places. Place them on a baking sheet and bake until a fork goes through to the center easily, 40 to 60 minutes. (If the potatoes are baked before the stew is ready, turn the oven off and let the potatoes stand in hot oven until ready to serve.)",
    "Meanwhile, in a large saucepan, place the tomatoes, red bell pepper, mushrooms, onion, garlic, cumin, and oregano. Cook over medium heat for 20 minutes, stirring occasionally. (The juices from the onion and tomatoes will be enough to keep the sauce from burning.) Transfer the sauce to a blender or food processor and blend until smooth. Set aside.",
    "To the same saucepan, add 3 cups water. Add the reserved cooked chickpeas, the celery, green bell pepper, and corn. Bring to a boil over high heat. Add the reserved tomato sauce, vinegar, lemon juice, paprika, chili powder, half of the cilantro, and salt to taste. Cook until the vegetables are tender and the chili thickens, 15 to 20 minutes.",
    "Use a sharp knife to cut down the length of each potato and spread them open. Pour a good helping of the chili over each potato. Garnish"
  ],
  "ingredients": [
    "0",
    "1 cup dried chickpeas, soaked and drained",
    "4 large russet potatoes (about 2 pounds), scrubbed",
    "4 cups diced tomatoes",
    "2 cups diced red bell pepper",
    "8 ounces button mushrooms, trimmed and diced (about 2 cups)",
    "1 cup finely chopped red onion",
    "2 cloves garlic, minced",
    "1 teaspoon ground cumin",
    "2 teaspoons dried oregano",
    "1½ cups diced celery",
    "1 cup finely chopped green bell pepper",
    "1 cup fresh or frozen corn",
    "2 tablespoons white wine vinegar",
    "1 tablespoon fresh lemon juice",
    "1 teaspoon smoked paprika",
    "¼ teaspoon chili powder or to taste",
    "¼ cup finely chopped fresh cilantro, divided",
    "Sea salt, to taste"
  ],
  "__v": 1
}