{
  "hash": "40b3f151b611a9e824124aaab84914c33d8effdf",
  "title": "Salmon and Quinoa Bowls with Kale and Tahini-Yogurt Sauce",
  "image": "http://feedmephoebe.com/wp-content/uploads/2015/01/IMG_4744.jpg",
  "href": "http://feedmephoebe.com/2015/01/balanced-diet-salmon-quinoa-bowls-kale-tahini-yogurt-sauce/",
  "extension": "Chrome",
  "firstAdded": "2015-05-05T22:35:51.581000",
  "users": [
    null,
    null
  ],
  "keywords": [
    "white",
    "quinoa",
    "bunch",
    "lacinato",
    "tuscan",
    "dinosaur",
    "kale",
    "stems",
    "medium",
    "carrot",
    "lemon",
    "juice",
    "garlic",
    "olive",
    "oil",
    "salt",
    "chickpeas",
    "rinsed",
    "canned",
    "currants",
    "cranberries",
    "cherries",
    "hemp",
    "seeds",
    "sockeye",
    "salmon",
    "fillets",
    "skin",
    "tahini",
    "water",
    "greek",
    "yogurt"
  ],
  "directions": [
    "0",
    "In a medium saucepan, combine the quinoa and 2 cups water. Bring to a boil, cover, and reduce the heat to low. Cook for 15 minutes, then let stand covered for 10 minutes off the heat. Fluff with a fork and set aside.",
    "Meanwhile in a large mixing bowl, combine the kale, carrots, lemon juice, garlic, 2 tablespoons of olive oil and 1/2 teaspoon sea salt. With clean hands, toss the kale until very well coated in the lemon and oil. Add the cooked quinoa to the kale along with the chickpeas, dried fruit and hemp seeds (if using). Mix until well-incorporated and taste for seasoning.",
    "Heat 2 tablespoons of oil in a large nonstick or cast iron skillet. Pat the salmon dry and season with salt. Cook the salmon skin-side down over high heat until nicely browned, 2-3 minutes. Carefully flip the fish and cook for another 2 minutes, until opaque up the sides.",
    "Divide the quinoa between 4 bowls and top with the seared salmon.",
    "In a medium mixing bowl, whisk together the ingredients for the sauce until smooth. Add more water as necessary to make the sauce drizzle-friendly. Spoon over the fish and serve immediately."
  ],
  "ingredients": [
    "0",
    "1 cup white quinoa",
    "1 bunch Lacinato, Tuscan or dinosaur kale, thick stems removed and thinly sliced",
    "1 medium carrot, peeled and thinly sliced",
    "2 tablespoons lemon juice",
    "2 garlic cloves, minced",
    "Olive oil",
    "Sea salt",
    "2 cups cooked chickpeas, rinsed and drained if canned",
    "1/4 cup dried currants, cranberries or cherries",
    "1 tablespoon hemp seeds (optional)",
    "Four 4-ounce sockeye salmon fillets (skin on)",
    "1/4 cup tahini paste",
    "1/2 cup water",
    "1 tablespoon lemon juice",
    "1/2 cup Greek yogurt",
    "1/2 teaspoon sea salt"
  ],
  "__v": 2
}