{
  "hash": "f0b213a8a54d97d065daff733a15ebedadff19d3",
  "title": "Chocolate Peanut Butter Cup Cookies",
  "image": "https://smittenkitchendotcom.files.wordpress.com/2018/02/chocolate-peanut-butter-cup-cookies.jpg?w=750",
  "href": "https://smittenkitchen.com/2018/02/chocolate-peanut-butter-cup-cookies/",
  "extension": "Chrome",
  "firstAdded": "2018-03-01T01:41:37.353000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat oven: To 375 degrees F.",
    "Make filling: Line a small tray or plate with parchment paper. In a medium bowl, mix peanut butter, powdered sugar, and salt with a fork; it’s a little messy but it will come together. Once evenly mixed, use a teaspoon measure to scoop heaped teaspoons of filling into little balls. Spread them out on prepared tray or plate. Once you’ve used all the filling, put the tray in the freezer while you make the cookie portion.",
    "Make cookie with a hand or stand mixer: Beat softened butter with peanut butter and sugars until creamed together. Add vanilla, egg, and salt, and beat until combined. Sift in baking powder and cocoa, beat to combine, then add flour and mix until flour disappears.",
    "Make cookie in a food processor: Pulse flour, cocoa, baking powder, salt, and sugars in food processor until mixed. Cut cold butter (if using, softened works fine here too) into chunks and add to bowl. Run machine until fully blended. Add peanut butter, egg, and vanilla and run machine until it is blended, scraping sides down as needed, and then keep running until dough balls together.",
    "Assemble cookies: Place 1 to 2 tablespoons extra granulated sugar in a small bowl. Line a large baking sheet with parchment paper. Take a scoop of cookie dough that’s just shy of 2 tablespoons (a #40 scoop holds 1.75 tablespoons and is perfect for this) and place it in the palm of your hand. Flatten it with your fingers. Take a peanut butter filling from the freezer and place it in the center, and wrap the chocolate dough around, rolling it in your palms until smooth. Roll it in the granulated sugar to coat, place it on your prepared baking sheet and gently flatten the cookie, just slightly, with your fingers. Repeat with remaining dough.",
    "Bake cookies: For 8 to 10 minutes. This is going to seem like really little time, and the cookies are definitely going to look underbaked, but remember that we are just baking a thin outer shell of a cookie (the center doesn’t need to be baked), and this does not take long. Let cookies rest and set up on baking sheet for 5 minutes before transferring to cooling rack to cool.",
    "Store: At room temperature in an airtight container."
  ],
  "ingredients": [
    "0",
    "2/3 cup (170 grams) creamy peanut butter",
    "2/3 cup (80 grams) powdered sugar",
    "Two pinches of flaky seas salt",
    "1/2 cup (115 grams or 4 ounces) unsalted butter, at room temperature for a mixer, cold is fine for food processor",
    "1/2 cup (100 grams) granulated sugar, plus more to coat cookies",
    "1/2 cup (95 grams) dark brown sugar",
    "1/4 cup (65 grams) creamy peanut butter",
    "1 large egg",
    "1 teaspoon (5 ml) vanilla extract",
    "1 1/3 cups (175 grams) all-purpose flour",
    "2/3 cup (55 grams) dutched cocoa powder (see note)",
    "2 teaspoons baking powder",
    "1/4 teaspoon fine sea or table salt"
  ],
  "__v": 1
}