{
  "hash": "ee2f473e1cf7bc0f8d018b1eb00e4da87586fac4",
  "title": "Quince Jelly",
  "image": "http://www.bbcgoodfood.com/sites/default/files/styles/bbcgf_recipe/public/user-recipe/Quince%20Jelly_4.JPG?itok=8khBxb6t",
  "href": "http://www.bbcgoodfood.com/recipes/10762/quince-jelly",
  "extension": "Chrome",
  "firstAdded": "2015-10-24T16:40:12.749000",
  "users": [
    null
  ],
  "keywords": [
    "lemon",
    "juiced",
    "scented",
    "geranium",
    "leaves",
    "white",
    "sugar",
    "juice",
    "quinces",
    "saucepan"
  ],
  "directions": [
    "0",
    "Firstly, I wash and chop up enough whole quinces to fill my biggest pan, I don't bother weighing them as I am only interested in the amount of juice I have at the end.",
    "Pour in enough water to cover and boil until soft, approximately 2 hours.",
    "Pour the whole mixture into a clean, ironed, pillowcase. I iron on a high heat just before I pour in the mixture.",
    "Here comes the tricky bit, tie the top of the pillowcase with string and then tie the string to an upturned chair. I place a large bowl or pan, big enough to catch all the drips, underneath and place a cloth over the whole thing to keep the flies off. Leave to drip overnight.",
    "Measure the amount of fluid you have in the pan next day and add 500g of white granulated sugar for each 600ml of juice.",
    "Throw in a few lemon scented geranium leaves and the juice of one lemon. Boil until it reaches setting point, I find this by spooning some of the juice onto a cooled plate and looking for the wrinkles on top. Don't worry if you get the setting point wrong and you find your jellys not set the next day, just pop it back into the pan and boil again.",
    "Remove the geranium leaves and spoon off any scum on the top. Pour the, now beautiful red coloured, liquid into sterilized jars. I sterilize mine by boiling them for 10mins and then once filled with the hot liquid, screw the lids (also boiled with the jars) on tightly. I then turn the jars upside down and leave for about an hour before turning them upright again.",
    "All done, just remember the jelly tastes better if you can leave it for a few weeks."
  ],
  "ingredients": [
    "0",
    "1 lemon, juiced",
    "2/3 lemon scented geranium leaves",
    "500g of white sugar for each 600ml of juice",
    "chopped quinces, enough to fill a large saucepan"
  ],
  "__v": 1
}