{
  "hash": "21f4d53af6ab28b2d3c3e4b8c98cdfe34a4049e6",
  "title": "SHRIMP PO’ BOY",
  "image": "https://api.norecipes.com/wp-content/uploads/2015/06/recipeshrimp-po-boy.1024x1024.jpg",
  "href": "https://norecipes.com/shrimp-po-boy",
  "extension": "Chrome",
  "firstAdded": "2018-10-09T17:34:36.269000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "STEPS",
    "Make the remoulade by putting the mayonnaise, mustard, capers, parsley, scallion, garlic, lemon zest, lemon juice, 1/2 teaspoon smoked paprika, and hot sauce in a small bowl and whisk to combine. Chill in the refrigerator while you make the rest of the sandwich.",
    "For the shrimp, add 2-inches of oil to a heavy bottomed pot and preheat to 350 degrees F (180C). Prepare a wire rack lined with a triple layer of paper towels. Have all the vegetables for the sandwich ready in advance as you want to serve this as soon as the shrimp is done.",
    "If the crust on your bread is no longer crisp, throw it in a 350 degree F oven for a few minutes to crisp.",
    "Mix 2 teaspoons smoked paprika, salt, garlic powder, onion powder and black pepper together in a small bowl.",
    "Dry any excess water off the shrimp using paper towels and them put them in a bowl. Toss the shrimp while sprinkling the seasoning mix over the shrimp to coat each one evenly.",
    "Put the cornmeal and flour in a bag and add the shrimp in batches, closing the bag and tossing to coat each shrimp evenly.",
    "Dig out the shrimp from the bag and add them to the pre-heated oil. Fry until the shrimp are golden brown and crisp and use a wire strainer to transfer to the prepared wire rack. Repeat with the rest of the shrimp.",
    "To assemble the sandwiches, slice the bread in half leaving a little crust at the back to act as a hinge. Spread a layer of remoulade onto the bottom bread and then top with the shrimp, pickles, lettuce and tomatoes. Finish with another drizzle of remoulade and extra hot sauce to taste. Serve immediately."
  ],
  "ingredients": [
    "0",
    "For Remoulade",
    "1/4 cup\tMayonnaise",
    "1 tablespoon\tWhole grain mustard",
    "2 teaspoons\tCapers in brine (drained and chopped)",
    "4 grams\tFlat leaf parsley (1 tablespoon chopped)",
    "1\tScallion (minced)",
    "4 grams\tGarlic (1 small clove grated)",
    "1 teaspoon\tLemon zest (zest from 1/2 lemon)",
    "2 teaspoons\tLemon juice",
    "1/2 teaspoon\tPimentón (smoked paprika)",
    "1/2 teaspoon\tHot sauce (to taste)",
    "For Fried Shrimp",
    "450 grams\tSmall shrimp (shelled and deveined)",
    "2 teaspoons\tPimentón (smoked paprika)",
    "1 teaspoon\tSalt",
    "1/2 teaspoon\tGarlic powder",
    "1/2 teaspoon\tOnion powder",
    "1/2 teaspoon\tGround black pepper",
    "1/4 cup\tCornmeal",
    "1/2 cup\tAll-purpose flour",
    "For Sandwich",
    "2\tDill pickles (sliced)",
    "Iceberg lettuce (shredded)",
    "1 large\tTomato (sliced)",
    "2 small loaves\tFrench bread (10-inches long)"
  ],
  "__v": 1
}