{
  "hash": "8a64a6613526ff63602c040a3479cec2fdb9d3e2",
  "title": "BUTTERNUT SQUASH SOUP WITH CHORIZO AND AGAVE SYRUP",
  "image": "http://www.caciqueinc.com/wp-content/uploads/2016/05/ComfortInABowlButternutSquashSoup-1.jpg",
  "href": "http://www.caciqueinc.com/recipes/comfort-in-a-bowl-butternut-squash-soup-with-chorizo-and-agave-syrup/",
  "extension": "Chrome",
  "firstAdded": "2017-04-15T20:57:37.697000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "HOW TO MAKE IT",
    "In a large stockpot caramelize the onions with olive oil over low heat stirring occasionally, about 15 minutes. Add the balsamic vinegar to deglaze, add butternut squash, and ginger, sauté for 2 minutes so the squash is bathed in the caramelized onions.",
    "Add one quart of chicken broth, it should be enough to completely cover the squash, if not add more to submerge the squash. Add the pear and the thyme and bring to a boil. Stir and lower heat to a simmer, cover and let cook for 30 to 45 minutes until the squash is soft when pierced with a fork.",
    "In the mean time, in a separate sauté pan prepare the chorizo according to package instructions. Place in a small serving dish.",
    "Cube the Panela cheese into small ½ pieces. Place in a small serving dish, cover with plastic wrap and return to refrigerator. Pour or dollop the Crema Agria in a small serving dish. Place minced chive in small serving dish. Set aside all garnishes.",
    "Remove the soup from the heat and cool slightly. Remove and discard the thyme and the ginger. Remove the Panela cheese from the refrigerator and set aside to reach room temperature.",
    "Very carefully process the soup in batches in a blender or with a hand immersion blender. If the soup is too thick, add more chicken broth, the soup should have a hearty consistency. Add salt and pepper if necessary but with a light hand as the toppings are very flavorful.",
    "Serve the soup very hot in a deep bowl, and offer all of the toppings. The recommended topping order is a robust tablespoon of cheese first, followed by the same amount of chorizo, a dollop of the sour cream, a thin stream of agave syrup, and a bit of chives."
  ],
  "ingredients": [
    "0",
    "GARNISH",
    "®",
    "®",
    "®"
  ],
  "__v": 1
}