{
  "hash": "81f0d3175e73ddb87b0fcda17682dbbdd73f4b12",
  "title": "The Best Chewy Café-Style Chocolate Chip Cookies",
  "image": "",
  "href": "http://hostthetoast.com/best-chewy-cafe-style-chocolate-chip-cookies/",
  "extension": "Chrome",
  "firstAdded": "2017-03-02T09:29:43.624000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium-sized bowl, whisk together the flour, baking soda, cornstarch, and salt. Set aside.",
    "In a large bowl, beat together the cooled melted butter and the sugars with a hand-mixer for about one minute. Then, add in the eggs and vanilla extract. Beat until just combined.",
    "Slowly add in the dry ingredients and mix briefly, just until there are no flour clumps left. Fold in the chocolate chips.",
    "Cover and refrigerate the dough for 30 minutes to an hour.",
    "Remove the dough from the refrigerator and preheat the oven to 325 degrees, making sure you have the racks in the middle of the oven.",
    "Scoop ¼ cup of cookie dough at a time and roll into balls. Then, tear the balls in half by pulling gently on both sides. Smush the two halves together again, but this time have the lumpy, torn sides face upward. Place on a baking sheet lined with parchment paper, making sure the cookies have plenty of space to spread.",
    "Bake for about 12 minutes, rotating half-way through, or until the cookies have spread out and the edges are golden, but the center of the cookie still looks soft and just slightly under-cooked. Let cool on the baking sheets until the cookies are firm enough to remove. Every oven is different, so I recommend starting with just one or two cookies on the tray to see what baking time works best for you!",
    "Repeat with remaining batches, until all cookies are baked. Enjoy with a cold glass of milk!"
  ],
  "ingredients": [
    "0",
    "2 cups + 2 tablespoons all purpose flour",
    "1 teaspoon baking soda",
    "2 teaspoons cornstarch",
    "½ teaspoon salt",
    "1 ½ sticks (6 oz) butter, melted and cooled",
    "1 cup brown sugar, lightly packed (I used light brown sugar, but dark brown sugar will work as well if you want a more molasses-y flavor)",
    "½ cup granulated sugar",
    "2 large eggs",
    "2 teaspoons vanilla extract",
    "1½ cups dark chocolate chips"
  ],
  "__v": 1
}