{
  "hash": "bc5abd7edcdb055951f94874ff2ea93bc0d19eaa",
  "title": "Pad See Yew",
  "image": "http://cdn-image.foodandwine.com/sites/default/files/styles/551x551/public/ricotta-filled-handkerchief-pasta-with-pesto-and-marinara-xl-recipe1016.jpg?itok=DtR_nT16",
  "href": "http://www.foodandwine.com/recipes/pad-see-yew",
  "extension": "Chrome",
  "firstAdded": "2017-01-28T14:48:00.622000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a bowl, mix the fish sauce, miso, oyster sauce, sugar and soy.",
    "In a large pot of boiling lightly salted water, cook the bok choy until crisp-tender, 2 minutes; transfer to a plate. Add the noodles to the boiling water and cook until firm but pliable, 5 minutes. Drain and rinse under cold water; shake out any excess water. Transfer the noodles to a bowl; toss with 1 tablespoon of the oil.",
    "Heat 1 tablespoon of the oil in a large nonstick skillet. Add the shrimp, season with salt and cook over high heat until pink throughout, 2 minutes. Add the shrimp to the bok choy. Add the remaining 1/4 cup plus 1 tablespoon of oil to the skillet and heat until shimmering. Add the garlic and cook, stirring, for 30 seconds. Add the eggs and cook over high heat for about 30 seconds, just until lightly scrambled. Add the noodles and toss lightly. Add the fish sauce mixture and toss. Cook, without stirring, just until the liquid is nearly evaporated, about 5 minutes. Stir the noodles once, then cook until browned on the bottom, 2 to 3 minutes longer. Add the shrimp and bok choy; cook just until heated through. Transfer the noodles to a large platter, sprinkle with the chiles and peanuts and serve with lime wedges."
  ],
  "ingredients": [
    "0",
    "3 tablespoons Asian fish sauce",
    "1 tablespoon miso paste or fermented yellow beans",
    "1 tablespoon oyster sauce",
    "4 teaspoons sugar",
    "1/4 cup low-sodium soy sauce",
    "1 pound bok choy, cut into 2-inch pieces",
    "2/3 pound dried rice stick noodles",
    "1/4 cup plus 3 tablespoons vegetable oil",
    "3/4 pound shelled and deveined medium shrimp",
    "Salt",
    "4 large garlic cloves, minced",
    "3 large eggs, beaten",
    "3 Thai bird chiles or serrano chiles, thinly sliced",
    "2 tablespoons chopped roasted salted peanuts (optional)",
    "Lime wedges, for serving"
  ],
  "__v": 1
}