{
  "hash": "328e2af94fb14c424526385562af0e8f26b3700b",
  "title": "Sweet & Spicy Tofu (or Tempeh too!) [Vegan, Gluten-Free]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/04/glazed-tofu-close.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/sweet-and-spicy-tofu/",
  "extension": "Chrome",
  "firstAdded": "2015-04-25T20:11:21.956000",
  "users": [
    null
  ],
  "keywords": [
    "kosher",
    "salt",
    "garlic",
    "paprika",
    "black",
    "pepper",
    "onion",
    "cayenne",
    "oregano",
    "thyme",
    "red",
    "raw",
    "brown",
    "sugar",
    "tofu",
    "tempeh",
    "tbs",
    "safflower",
    "oil",
    "orange",
    "marmalade",
    "lime",
    "juice",
    "wedges"
  ],
  "directions": [
    "0",
    "Combine the seasonings in a small bowl and stir until evenly blended. Add the sugar and the salt and blend.",
    "If using tofu, cut it into slices of your desired thickness. I cut the block in half, then I cut each half into 4 slices for a total of 8 thin rectangular slices.",
    "If using tempeh, I sometimes steam it first if I want it softer but I didn’t this time. I split the tempeh in half so that I had two thin rectangles. The way I do this is to lay the tempeh on a cutting board, hold the top steady with the palm of my hand and with a knife, slice through it like I am splitting open a bagel. Then I cut each thin rectangle in half so I have 4 pieces.",
    "Press the slices of the tofu or tempeh into the spice blend and cover both sides with it.",
    "Heat a skillet with medium-high heat and add the oil. Sauté the tofu or tempeh in the skillet for about 4 minutes. Flip the slices and cook until both sides are browned.",
    "Meanwhile, mix the orange marmalade and the lime juice in a bowl. When the tofu or tempeh is ready, pour the marmalade mixture into the pan and stir it around until it melts. Carefully turn the tofu or tempeh slices in the pan so that both sides get covered in the orange glaze."
  ],
  "ingredients": [
    "0",
    "1 ½ tsp. kosher salt",
    "1 ½ tsp. garlic powder",
    "1 ¾ tsp. paprika",
    "¾ tsp. ground black pepper",
    "¾ tsp. onion powder",
    "¾ tsp. cayenne pepper",
    "1 tsp. dried oregano",
    "1 tsp. dried thyme",
    "¼ tsp. red pepper flakes (optional)",
    "1",
    "1 tsp. raw brown sugar",
    "¼ tsp. kosher salt",
    "1 package tofu, drained or 1 package tempeh",
    "1 Tbs. safflower oil",
    "¼ cup orange marmalade",
    "1 Tbsp. lime juice",
    "Lime wedges"
  ],
  "__v": 1
}