{
  "hash": "db6d4cd25304221613c23679692a604a12dd66ee",
  "title": "Chocolate Sundae Cupcakes",
  "image": "https://hips.hearstapps.com/ghk.h-cdn.co/assets/17/45/1510091784-baked-by-melissa-chocolate-sundae-cupcake-1217.jpg?crop=1.0xw:1xh;center,top&resize=480:*",
  "href": "https://www.goodhousekeeping.com/food-recipes/dessert/a46792/chocolate-sundae-cupcakes-recipe/",
  "extension": "Chrome",
  "firstAdded": "2019-10-07T15:18:19.973000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350°F. Line cupcake pan with cupcake liners.",
    "Make cake: With a hand mixer or a stand mixer fitted with the paddle attachment, whip the butter for 1 minute on high speed, then scrape down the sides of the bowl with a spatula. Add the sugar to the butter and beat on high speed for 2 minutes. Scrape down the sides of the bowl again.",
    "With the mixer on medium-low speed, add the vanilla extract; then add the eggs one at a time. Scrape down the edges of the bowl midway through.",
    "Combine the flour, cocoa powder, baking soda and sea salt in a separate bowl.",
    "With the mixer on low speed, add half the flour mixture. When it’s mostly incorporated, add half the sour cream. Add the remainder of the dry and wet ingredients, scraping down the sides of the bowl between additions. Stop mixing as soon as you have a smooth batter.",
    "Pour the batter into the prepared pan and bake until the middle of the cake feels springy when you gently press your finger against it, about 25 to 30 minutes. Let the cake cool completely before icing.",
    "Meanwhile, make icing: Pour cream, vanilla and sugar into chilled mixing bowl and whip on high speed until stiff peaks form, about 2 minutes.",
    "Assemble cupcakes: Frost each cupcake with Whipped Vanilla Icing; then drizzle hot fudge sauce onto each. Top each with sprinkles and a cherry."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Grandma Annie's Chocolate Cake",
    "1/2 lb. unsalted butter, at room temperature (2 sticks)",
    "2 c. sugar",
    "2 tsp. pure vanilla extract",
    "2 large eggs, at room temperature",
    "3 c. all-purpose flour",
    "2/3 c. Unsweetened cocoa powder",
    "2 tsp. baking soda",
    "1/4 tsp. fine sea salt",
    "2 c. sour cream, at room temperature (16 ounces)",
    "Whipped Vanilla Icing",
    "2 c. heavy cream, at room temperature",
    "1 tsp. pure vanilla extract",
    "1/2 c. confectioners' sugar"
  ],
  "__v": 1
}