{
  "hash": "b3f66721a2f169f745c26f4ebcc6109f79a403bf",
  "title": "Eggplant & Olive Spread - pressure cooker recipe",
  "image": "https://i2.wp.com/www.hippressurecooking.com/wp-content/uploads/2015/08/baba_ganoush_top.jpg?resize=750%2C558&ssl=1",
  "href": "https://www.hippressurecooking.com/pressure-cooker-eggplant-spread/",
  "extension": "Chrome",
  "firstAdded": "2019-07-17T15:34:57.087000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Peel the eggplant in alternating stripes of skin and no skin (to keep some of the flavor and color of the skin, but not too much!!) Slice the biggest chunks possible to cover the bottom of your pressure cooker. The rest can be roughly chopped.",
    "In the pre-heated pressure cooker, on medium heat without the lid, add the olive oil. When the oil has heated, carefully place the large chunks of eggplant \"face down\" to fry and caramelize on one side, about 5 minutes - throw in the garlic cloves with the skin on.",
    "Then, flip over the eggplant add the remaining uncooked eggplant, salt, and water.",
    "Close and lock the lid of the pressure cooker.",
    "For electric pressure cookers: Cook for 5 minutes at high pressure. For stove top pressure cookers: Turn the heat up to high and when the cooker indicates it has reached high pressure, lower to the heat to maintain it and begin counting 3 minutes pressure cooking time.",
    "When time is up, open the cooker by releasing the pressure through the valve.",
    "Take the pressure cooker base to the sink, and tip it to remove and discard most of the brown liquid.",
    "Fish out the garlic cloves and remove their skin. Add the Tahini, lemon juice, cooked and uncooked garlic cloves and black olives and puree everything together using an immersion blender (tilt the pan to get everything in the nook so it immerses the head immersion blender).",
    "Pour out to the serving dish and sprinkle with fresh Thyme, remaining black olives and a dash of fresh olive oil before serving."
  ],
  "ingredients": [
    "0",
    "4 tablespoons olive oil",
    "2 pounds (1k) eggplant",
    "3-4 garlic cloves, skin on (reserve one to use fresh at the end)",
    "1 teaspoon salt",
    "½ cup (125ml) water or use 1 cup (250ml) for electrics",
    "1 lemon, juiced (about ¼ cup of juice)",
    "1 tablespoons tahini",
    "¼ cup black olives, pitted (reserve a few un-pitted for garnish)",
    "a few sprigs of fresh thyme (about a tablespoon of leaves)",
    "Fresh Extra Virgin Olive Oil"
  ],
  "__v": 1
}