{
  "hash": "5d62c7c807d0444c100fb55115acca3b75dc0cb8",
  "title": "Béarnaise Sauce",
  "image": "https://fthmb.tqn.com/_YzjTLE_ARiYMrSRrivKb-8wQFQ=/960x0/filters:no_upscale()/200341618-001-56a20f053df78cf772717f01.jpg",
  "href": "https://www.thespruce.com/bearnaise-sauce-recipe-995328",
  "extension": "Chrome",
  "firstAdded": "2018-02-15T04:04:36.449000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat an inch or two of water in a saucepan over a medium heat. Also, your clarified butter should be warm, but not hot.",
    "In a separate saucepan, heat the vinegar, shallots, peppercorns and half of the tarragon to a simmer and reduce until the mixture is nearly dry (au sec). There should be about two tablespoons of liquid remaining. Remove from heat and transfer to a glass or stainless steel bowl (not aluminum).",
    "Add the egg yolks and whisk for a minute or two, until the mixture is light and foamy.",
    "The water in the saucepan should have begun to simmer. Set the bowl directly atop the saucepan of simmering water. The water itself should not come in contact with the bottom of the bowl. Whisk the egg-vinegar mixture for a minute or two, until it is slightly thickened.",
    "Remove the bowl from the heat and begin adding the melted butter slowly at first, a few drops at a time, while whisking constantly. If you add it too quickly, the emulsion will break.",
    "Continue beating in the melted butter. As the sauce thickens, you can gradually increase the rate at which you add it, but at first, slower is better.",
    "After you've added all the butter, strain the sauce into a new bowl, stir in the chervil and the remaining tarragon. Season to taste with lemon juice, Kosher salt and cayenne pepper (or a dash of Tabasco sauce). The finished béarnaise sauce will have a smooth, firm consistency. If it's too thick, you can adjust the consistency by whisking in a few drops of warm water.",
    "It's best to serve béarnaise right away. You can hold it for about an hour or so, provided you keep it warm. After two hours, though, you should toss it — both for quality and safety reasons."
  ],
  "ingredients": [
    "0",
    "1 cup clarified butter (about 2½ sticks before clarifying)",
    "4",
    "egg yolks",
    "½ cup white wine",
    "vinegar",
    "½ tsp crushed black",
    "peppercorns",
    "2 Tbsp chopped",
    "shallots",
    "1 Tbsp chopped",
    "tarragon",
    "1 Tbsp chopped",
    "chervil (or parsley)",
    "Kosher salt, to taste",
    "Cayenne pepper (or a dash of",
    "Tabasco sauce), to taste",
    "Lemon juice, to taste"
  ],
  "__v": 2
}