{
  "__v": 1,
  "directions": [
    "0",
    "Use a breadmaker, add all wet ingredients first: egg, water and tangzhong. Then add the dry ingredients on top in this order: salt, sugar, milk powder, bread flour, cake flour and lastly instant yeast. Turn on your breadmaker and set to “dough” mode. When all ingredients just come together, pour in the melted butter and let the breadmaker continue kneading. (Note: As the dough is extremely sticky and too difficult to knead by hands, it’s recommended to use a breadmaker.) Keep kneading until the dough is smooth, not too sticky on the surface and elastic. The time of kneading in the breadmaker is about 30 minutes. Then let the dough stay inside the breadmaker to complete the 1st round of proofing, about 40 minutes, double in size.",
    "Transfer the dough to a clean floured surface. Deflate and divide into 9 equal portions, each about 60 grams. Knead into ball shapes (see picture 1). Cover with cling wrap, let rest for 15 minutes at room temperature.",
    "To shape the dough: Turn each portion with seal facing upward. Fold from top to bottom (see picture 2). Turn seal downward, flatten the dough (see picture. Turn seal upward again, tightly pinch the top and the bottom edges together (see picture 4). Then roll it into a 40cm long tube with two hands. Wrap tube-shaped dough around a greased cream horn mould, starting at the tip (see picture 5-8). Place on a baking tray lined with baking paper, with seam side down. Repeat this step with the rest of the dough. Let proof for the 2nd round, about 40 minutes (preferably at 38C/100F, 85% humidity).",
    "Brush whisked egg on surface. Bake in a pre-heated 180C (356F) oven for 13 to 15 minutes, until turns brown. Remove from the oven and transfer onto a wire rack. Let cool completely. Remove the cream horn moulds.",
    "Prepare the filling: use an electric mixer to beat the whipping cream, sugar and Nutella until stiff. Chill in fridge if necessary.",
    "When ready to serve, Pipe whipped Nutella cream into the horns to fill in. Enjoy!"
  ],
  "firstAdded": "2014-07-04T19:14:55.181000",
  "hash": "a795fcc470c0c6fefd629d1ebba9a4c560c8dfc5",
  "href": "http://en.christinesrecipes.com/2010/10/nutella-cream-horns-tangzhong-method.html",
  "image": "http://lh6.ggpht.com/_V0CoK16CILc/TKiBKz8KIBI/AAAAAAAAJE8/ANfA_Ptb6JI/s800/%E8%87%BB%E5%AD%90%E6%9C%B1%E5%8F%A4%E5%8A%9B%E8%99%9F%E8%A7%92%E5%8C%85%20Nutella%20Cream%20Horns01.jpg",
  "ingredients": [
    "0",
    "Prepare 9 cream horn mouldsIngredients:",
    "210 gm bread flour",
    "56 gm cake flour",
    "20 gm milk powder",
    "42 gm caster sugar",
    "½ tsp salt",
    "6 gm instant yeast",
    "30 gm whisked egg",
    "85 gm water",
    "84 gm tangzhong (refer this recipe to see how to make tangzhong)",
    "22 gm unsalted butter, melted",
    "Filling:",
    "½ cup whipping cream",
    "2 tsp caster sugar",
    "2½ tbsp Nutella"
  ],
  "keywords": [
    "prepare",
    "cream",
    "horn",
    "mouldsingredients",
    "bread",
    "flour",
    "cake",
    "milk",
    "caster",
    "sugar",
    "salt",
    "instant",
    "yeast",
    "whisked",
    "egg",
    "water",
    "refer",
    "recipe",
    "make",
    "tangzhong",
    "unsalted",
    "butter",
    "filling",
    "whipping",
    "nutella"
  ],
  "title": "Nutella Cream Horns (Tangzhong Method)",
  "users": [
    null
  ]
}