{
  "hash": "ef1bdd9f511e5c5a7ceef401a981052fb2d72ce5",
  "title": "Lemon-Lime Mousse",
  "image": "http://cook.sndimg.com/content/dam/images/cook/fullset/2012/5/15/0/CC-Francois-Devour_lemon-lime-mousse-recipe-02a_s4x3.jpg/jcr:content/renditions/cq5dam.web.266.200.jpeg",
  "href": "http://www.cookingchanneltv.com/recipes/lemon-lime-mousse.html",
  "extension": "Chrome",
  "firstAdded": "2015-07-31T15:58:19.825000",
  "users": [
    null
  ],
  "keywords": [
    "view",
    "lemonlime",
    "mousse",
    "total",
    "time",
    "min",
    "prep",
    "inactive",
    "yield",
    "servings",
    "leveleasy",
    "eggs",
    "sugar",
    "salt",
    "juice",
    "lemons",
    "andor",
    "limes",
    "cream",
    "vanilla",
    "strawberries",
    "orange",
    "flavored"
  ],
  "directions": [
    "0",
    "DIRECTIONS",
    "To make the lemon curd:",
    "In a non-reactive saucepan whisk together 4 eggs, 4 yolks (reserve the 4 egg whites), 3/4 cup sugar, salt, juice, and zest. Cook over medium heat while stirring constantly, until it thickens, about 10 minutes.",
    "The lemon curd is done when it is as thick as pudding and coats the back of a spoon or spatula. Press through a fine mesh strainer. Cover with plastic wrap and refrigerate until the lemon curd is cool. Can be made a day or two ahead.",
    "Whip the egg whites and remaining sugar until they reach stiff peaks. Add 1/3 of the whites to the chilled lemon curd and mix to lighten the texture of the curd. Gently fold the remaining whites in.",
    "Whip the heavy cream with the vanilla extract, until stiff peaks. Fold the whipped cream gently into the lemon mousse. Fold just until the cream is smoothly incorporated. Place the mousse into a piping bag and fill the jars evenly.",
    "To make the strawberries: Start with very fresh and sweet berries. If they aren't as sweet as you like, you can add more sugar, or less if they are very ripe.",
    "Mix the berries, sugar and liqueur in a bowl. Let the berries sit for at least 30 minutes, so they release some of their juices. Can be made several hours in advance. Spoon the berries over the mousse.",
    "They can be served immediately or refrigerated for several hours"
  ],
  "ingredients": [
    "0",
    "View Photo: Lemon-Lime Mousse",
    "TOTAL TIME: 45 min",
    "Prep: 45 min",
    "Inactive Prep:--",
    "Cook:--",
    "YIELD:8 servings",
    "LEVEL:Easy",
    "INGREDIENTS",
    "MOUSSE:",
    "8 large eggs",
    "1 cup sugar",
    "1/2 teaspoon salt",
    "3/4 cup juice (lemons and/or limes)",
    "3/4 cup heavy cream",
    "1 teaspoon pure vanilla extract",
    "STRAWBERRIES:",
    "1 pound fresh strawberries, sliced thin",
    "1/4 cup sugar",
    "1 to 2 tablespoons orange flavored"
  ],
  "__v": 1
}