{
  "hash": "44152bb154c99aeac6aeb48e81f4af1463b86d71",
  "title": "Slow Cooker Chicken Cacciatore",
  "image": "https://www.wellplated.com/wp-content/uploads/2018/05/Crock-Pot-Chicken-Cacciatore-140x140.jpg",
  "href": "https://www.wellplated.com/slow-cooker-chicken-cacciatore/",
  "extension": "Chrome",
  "firstAdded": "2018-12-06T15:22:59.013000",
  "users": [
    null,
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Lightly coat a large slow cooker with nonstick spray. Heat 1 tablespoon olive oil in a large skillet over medium high. Season both sides of the chicken with salt and pepper. Once the oil is hot and shimmering, add the chicken in a single layer. Cook on the first side for 3 to 4 minutes, until browned, moving the chicken as little as possible so that it gets a nice sear. Flip and brown on the other side, about 2 additional minutes. Transfer the chicken to the slow cooker.",
    "Reduce the skillet heat to medium. With a paper towel, carefully wipe out the skillet. Add the remaining 2 teaspoons olive oil. One the oil is hot, add the onion and cook until beginning to soften, about 3 minutes. Add the garlic and 1 tablespoon balsamic vinegar. Cook for 1 minute, or until the garlic is fragrant and the vinegar has reduced. Transfer to the slow cooker, along with any pan drippings.",
    "Top the chicken with the tomatoes, green bell pepper, mushrooms, and Italian seasoning. If using chicken breasts: cover and cook on HIGH for 1 1/2 to 2 1/2 hours or LOW for 4 to 5 hours, until the chicken is cooked through. If using chicken thighs: cover and cook for 3 to 4 hours on HIGH or 5 to 6 hours on LOW. Remove the chicken from the slow cooker as soon as it reaches 165 degrees F. If desired, chop or shred the chicken (or you can serve the pieces whole).",
    "At this point, you can serve the sauce right away if you are in a hurry, BUT, if time allows, this is what I like to do for the best-ever sauce: Uncover the slow cooker and let cook on HIGH for 1 hour to allow the sauce to thicken and the flavor to further develop. Just before serving, stir in the remaining 1/2 teaspoon balsamic vinegar. Taste and season the sauce with additional salt/pepper as desired. If you've chopped or shredded the chicken, return it to the sauce and toss to combine and warm through. Otherwise, serve the chicken pieces whole with a generous amount of the sauce on top. Serve hot over pasta, rice, polenta, or veggie noodles, with a big extra spoonful of sauce and a sprinkle of parsley and Parmesan."
  ],
  "ingredients": [
    "0",
    "1 tablespoon extra-virgin olive oil — plus 2 teaspoons, divided",
    "2 pounds boneless skinless chicken breasts — or thighs",
    "1 teaspoon kosher salt",
    "1/2 teaspoon black pepper",
    "1 medium yellow onion — chopped",
    "3 cloves garlic — minced",
    "1 tablespoon balsamic vinegar — plus 1/2 teaspoon, divided",
    "1 can crushed tomatoes — 28 ounces",
    "1 medium green bell pepper — chopped",
    "8 ounces sliced baby bella cremini mushrooms",
    "2 teaspoons Italian seasoning"
  ],
  "__v": 2
}