{
  "hash": "8665ae3a940dd9a0825712fe109af14d6766f3ad",
  "title": "CITRUS AVOCADO SALMON CEVICHE",
  "image": "https://thehealthyfoodie.com/wp-content/uploads/2016/08/Salmon-Avocado-Citrus-Ceviche-21.jpg",
  "href": "https://thehealthyfoodie.com/citrus-avocado-salmon-ceviche/",
  "extension": "Chrome",
  "firstAdded": "2018-11-29T17:20:13.685000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cut the salmon into ½\" cubes and place it in a mixing bowl. Sprinkle salt over the fish, then squeeze the juice of half the orange, half lemon and half lime directly into the bowl and over the fish. Stir well and send to the refrigerator for 45 minutes to 1 hour.",
    "When the salmon is done curing, remove the peel and pith from the remaining half orange, and then, working over a bowl, carefully extract the flesh from between the membranes with the tip of your knife. Let those pieces of orange flesh (also known as supremes) fall right into the bowl.",
    "Add the diced avocado and chopped green onion to the bowl, and then carefully scoop out the cubes of salmon with a slotted spoon to add them to this bowl as well (hold on to that marinade, you'll be using it in a sec). Mix delicately until just combined and set aside.",
    "To the citrus marinade, add the mayo, honey and cayenne pepper and mix with a whisk until well combined and slightly frothy.",
    "Place a 3\" cookie cutter on a serving plate; spoon half of the salmon mixture into the pastry cutter and gently press it down with the back of a spoon. Remove the cutter and repeat with remaining salmon mixture on a second plate. Garnish with a handful of micro-greens and top with a few tablespoons of the citrus vinaigrette. Serve immediately"
  ],
  "ingredients": [
    "0",
    "175g (6oz) skinless salmon fillet",
    "½ ripe avocado, diced",
    "½ green onion, finely chopped",
    "1 large orange",
    "½ lemon",
    "½ lime",
    "2 tbsp paleo mayo",
    "1 tsp unpasteurized honey",
    "¼ tsp salt (I use Himalayan salt)",
    "⅛ tsp cayenne pepper"
  ],
  "__v": 1
}