{
  "hash": "5353a78549870612e4ba20a5362e71bc39b42d4b",
  "title": "Baked Triple Cheese and Salsa Tortilla Chip Dip",
  "image": "http://cdn.averiecooks.com/wp-content/uploads/2013/12/salsatortilladiptext.jpg",
  "href": "http://www.averiecooks.com/2013/12/baked-triple-cheese-and-salsa-tortilla-chip-dip.html",
  "firstAdded": "2015-01-24T00:42:33.080000",
  "users": [
    null
  ],
  "keywords": [
    "corn",
    "tortilla",
    "chips",
    "round",
    "triangle",
    "campbells",
    "cheddar",
    "cheese",
    "soup",
    "fajita",
    "seasoning",
    "mccormick",
    "mrs",
    "divided",
    "mexican",
    "pepper",
    "jack",
    "blend",
    "brickstyle",
    "cream",
    "softened",
    "room",
    "temp",
    "salsa"
  ],
  "directions": [
    "0",
    "Preheat oven to 375F. Spray a 9-inch pie dish (or similar-sized oven-safe baking dish) with cooking spray.",
    "Place tortilla chips in dish so they cover the majority of the bottom, slightly overlapping. This prevents soup from seeping through.",
    "Add the soup and lightly spread it evenly over the chips with a spatula or knife.",
    "Evenly sprinkle the fajita mix over the top.",
    "Evenly sprinkle not quite half the cheese over the top (I used about 40% of the bag); set aside remainder.",
    "Add the cream cheese in about 1/4 cup blobs and with a spatula or knife, do your best to carefully distribute it evenly over the pan without disturbing the other layers. Some small bald patches are okay because it bakes together. Tip - the softer your cream cheese is, the easier this step is.",
    "Evenly pour the salsa over the top, spreading it lightly with a spatula or knife if necessary.",
    "Evenly sprinkle reserved cheese over the top.",
    "Bake for about 30 to 40 minutes, or until top is golden browned, bubbly, and dip is done to your liking. Allow dip to cool momentarily before serving.",
    "Serving Suggestions - tortilla chips, bread, crackers, bagel chips, pita chips, mini toast crackers, carrot/celery/zucchni/jicama/cucumber sticks, bell pepper wedges, or eat by the spoonful. Dip is best warm and fresh, but extra will keep airtight in the refrigerator for up to 5 days. Gently re-heat in micro before serving leftover portion. We ate the leftover portion in squares like lasagna."
  ],
  "ingredients": [
    "0",
    "10 to 15 corn tortilla chips (round or triangle)",
    "one 10.75-ounce can Campbell's Cheddar Cheese Soup",
    "one 1.25-ounce packet fajita seasoning mix (McCormick, Mrs. Dash, etc.)",
    "one 8-ounce bag shredded cheese, divided (Mexican blend, Pepper Jack blend, etc.)",
    "8 ounces brick-style cream cheese, very well softened to room temp",
    "8 ounces salsa"
  ],
  "__v": 1
}