{
  "__v": 1,
  "directions": [
    "0",
    "Line a baking tray with parchment paper; set aside. Before beginning to melt the chocolate, have all the ingredients chopped, prepped, and ready to go so that they're ready to be added while the chocolate is hot and melty.",
    "Coarsely chop the chocolate or break into chunks to encourage smooth melting. Place chocolate in a large microwave-safe bowl. Heat on high power to melt, about 2 to 3 minutes, stopping every 15 seconds to check and stir until it can be stirred smooth. Be careful not to scorch it; or use a double boiler.",
    "Pour melted chocolate onto parchment and with a spatula or offset knife, smooth into a large rectangle, about 10x15-inches, and about 1/8-inch thick; just eyeball. Reserve 1 to 2 tablespoons in the bottom of the bowl for final chocolate drizzle; set aside.",
    "Evenly sprinkle with caramels, Oreos, pistachios, and sea salt to taste.",
    "Evenly drizzle with reserved 1 to 2 tablespoons chocolate; optional but helps 'glue' the toppings down and adds visual appeal.",
    "Allow chocolate to set up for at least 3 hours at room temp, or in the freezer for about 30 minutes.",
    "After chocolate has set, break into pieces or chop with a knife. Bark will keep airtight at room temp for many weeks and in the fridge or freezer for many months."
  ],
  "firstAdded": "2014-06-12T09:12:13.411000",
  "hash": "0eeeb0f71fe63e05e855e980714c4721c1b5697c",
  "href": "http://www.averiecooks.com/2014/06/pistachio-salted-caramel-and-oreo-dark-chocolate-bark.html",
  "image": "http://www.averiecooks.com/wp-content/uploads/2014/06/pistachiobark-16.jpg",
  "ingredients": [
    "0",
    "16 ounces dark chocolate (1 pound; I used TJ's Dark Chocolate Pound Plus Bar)about 20 small caramel squares, unwrapped and diced small (if you can find salted caramels I recommend them, but regular may be used)6 to 8 Oreo cookies, roughly chopped about 3/4 cup shelled, lightly salted pistachios (unsalted may be substituted) generous pinch of sea salt for sprinkling, optional and to taste"
  ],
  "keywords": [
    "tjs",
    "dark",
    "chocolate",
    "barabout",
    "caramel",
    "squares",
    "unwrapped",
    "caramels",
    "recommend",
    "regular",
    "used",
    "oreo",
    "cookies",
    "roughly",
    "shelled",
    "lightly",
    "salted",
    "pistachios",
    "unsalted",
    "substituted",
    "generous",
    "salt",
    "sprinkling"
  ],
  "title": "Pistachio, Salted Caramel, and Oreo Dark Chocolate Bark",
  "users": [
    null
  ]
}