{
  "hash": "133a5ee3666c8105091ce5bc2bf4eb6060a9b02f",
  "title": "CHICKEN ALFREDO TORTELLINI SOUP",
  "image": "https://1.bp.blogspot.com/-7Gl0WCv6Fxs/WlFv80gLjmI/AAAAAAAAx7M/vOM4rhWF1p4PDBEh_RKa7uF6LWrYDS6VACLcBGAs/s320/Chicken-Alfredo-Tortellini-Soup-SQUARE.jpg",
  "href": "https://www.theslowroasteditalian.com/2018/01/chicken-alfredo-tortellini-soup.html",
  "extension": "",
  "firstAdded": "2019-07-02T15:27:22.690000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Warm a large pot over medium-high heat. Once you can feel the heat when you hold your hand 6 inches above the pot, add the butter and let it melt. Add the onion and carrots. Cook the vegetables until the onions are translucent, about 3 minutes. Add the garlic and cook for 30 seconds.",
    "Then add the chicken, salt and pepper. Stir to combine. Cook for 3 minutes, just to get a little color on the chicken, stirring occasionally. Don’t worry about the chicken being cooked through, because we are going to continue cooking it.",
    "Sprinkle the flour over the chicken and veggies. Stir to coat everything and continue cooking for 2 to 3 minutes to cook out the floury taste. Stir in the chicken stock, half-and-half and red pepper flakes. Continue cooking until the soup thickens, 5 to 10 minutes.",
    "Add the tortellini to the pot and cook until al dente (has a bite to it), 5 to 7 minutes (frozen takes longer). Remove the pot from the heat. Sprinkle a handful of cheese over the soup and stir. Once it has melted into the soup, add another handful. Slowly melting the cheese will give the soup a smooth consistency. Taste for seasoning and add salt and pepper as necessary. Pour into",
    "bowls and garnish with the spinach."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "2 tablespoons unsalted butter",
    "1/2 medium yellow onion, diced",
    "4 ounces baby carrots, halved lengthwise and sliced into half-moons",
    "2 cloves garlic, minced",
    "1 pound boneless skinless chicken breasts, cut into bite-size cubes",
    "1 teaspoon kosher salt",
    "1/2 teaspoon freshly ground black pepper",
    "1/4 cup all-purpose flour",
    "4 cups reduced-sodium chicken stock",
    "1 cup half-and-half",
    "1 teaspoon crushed red pepper flakes",
    "9 ounces cheese tortellini, frozen or fresh",
    "2 cups freshly shredded Parmesan cheese",
    "2 ounces fresh baby spinach"
  ],
  "__v": 1
}