{
  "hash": "1aa7424398935b03894754dbf2f5863bab69a7d1",
  "title": "Orange and Beet Salad",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2006/02/orange-beet-salad-600.jpg",
  "href": "https://www.simplyrecipes.com/recipes/orange_and_beet_salad/",
  "extension": "",
  "firstAdded": "2018-01-27T22:25:52.095000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Cook the beets: You can either boil or roast the beets. To boil the beets, cover the unpeeled beets with water, bring to a boil, and simmer for 30 minutes or until beets can easily be pierced through with a fork.",
    "If you prefer to roast the beets instead of boiling them, wrap the unpeeled beets in aluminum foil and bake them in the oven at 400°F for an hour or until done. (See our Roasted Beets recipe.)",
    "After cooking, allow the beets to come to room temperature and remove their peels. Slice or quarter them.",
    "If you have time, place them in a small bowl and marinate them in half of the oil and vinegar dressing.",
    "2 Make the dressing: While the beets are cooking, make the dressing by putting all of the dressing ingredients into a jar. Seal and shake until the dressing is well blended.",
    "3 Compose the salad: Compose individual salad plates with arugula, a few slices of orange, a few beets, a few slices of red onion and a few chopped walnuts.",
    "If you want some added color, gently add a few slices of the orange to the beet juice from your bowl of beets. Let the oranges absorb the beet color and use in your salad.",
    "Sprinkle dressing over the individual salads."
  ],
  "ingredients": [
    "0",
    "1 bunch of beets, leaves removed (save them for beet greens!) - about 4 or 5 medium sized, scrubbed clean",
    "2 large navel oranges, peels cut off with a small small knife and sliced",
    "1 bunch of arugula leaves, cleaned, and any thick stems removed",
    "Several thin slices of red onion",
    "optional 1/4 cup chopped walnuts",
    "3 Tbsp white wine vinegar",
    "1/4 cup olive oil",
    "1/4 teaspoon dried mustard",
    "Salt and pepper to taste"
  ],
  "__v": 1
}