{
  "hash": "ea42222b11fdd542b886bce54af7a5a58e2db3af",
  "title": "How to Make Healthy Instant Pot Turkey Taco Meat (From Frozen!)",
  "image": "https://thefoodieandthefix.com/wp-content/uploads/2018/05/DSC_7439-11.jpg",
  "href": "https://thefoodieandthefix.com/how-to-make-instant-pot-taco-meat-from-frozen/",
  "extension": "Firefox",
  "firstAdded": "2020-05-02T21:08:10.447000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Seasoning:",
    "Stir together all ingredients.",
    "Taco meat:",
    "Put the tomato sauce and broth (or water) in the bottom of your Instant Pot liner, put the block of frozen turkey on top, sprinkle everything with the seasoning and set on manual for 25 minutes, then quick release.",
    "When it's finished, break up the meat really well with a sturdy spatula and turn on the saute function to let simmer and thicken for a few minutes. Serve with all of your favorite taco fixin's!",
    "Notes",
    "*I updated this recipe with increased liquids to better avoid the burn notice!",
    "21 Day Fix Container Counts per serving: 1 Red",
    "Weight Watchers Freestyle Points: 0 points if you're making this with 99% fat free ground turkey, 4 points if you use 93% fat free"
  ],
  "ingredients": [
    "0",
    "Smoky Southwestern Seasoning:",
    "1 Tbs chili powder",
    "2 tsp ground cumin",
    "1 tsp coriander",
    "1/2 tsp onion powder",
    "1/2 tsp garlic powder",
    "1/2 tsp dried oregano",
    "1/2 tsp smoked paprika (don't skip this!)",
    "3/4 tsp salt",
    "Taco Meat:",
    "1 lb lean ground turkey (though this would work with ANY ground meat!)",
    "1 cup (8 oz) no sodium tomato sauce or 100% tomato juice",
    "1/2 cup chicken broth or water",
    "2 Tbs of the seasoning recipe above (or 3 Tbs of low sodium taco seasoning)",
    "Optional: Add some chili flakes or diced jalapeno if you want it to be spicy. (add chili flakes to the seasoning or add jalapenos at the end when it's simmering)"
  ],
  "__v": 1
}