{
  "hash": "05dabed243bca1fe3443e6963693a36aea0f35c6",
  "title": "Gordon Ramsay’s Herb Crusted Rack of Lamb",
  "image": "",
  "href": "http://gordonramsaysrecipes.com/11/gordon-ramsays-herb-crusted-rack-lamb-f-word/",
  "firstAdded": "2014-12-24T03:08:18.535000",
  "users": [
    null
  ],
  "keywords": [
    "lamb",
    "racks",
    "bones",
    "salt",
    "pepper",
    "olive",
    "oil",
    "crust",
    "slices",
    "stale",
    "bread",
    "crumbs",
    "tbs",
    "parmesan",
    "roughly",
    "sprig",
    "parsley",
    "thyme",
    "coriander",
    "rosemary",
    "english",
    "mustard",
    "sub",
    "dijon",
    "splash"
  ],
  "directions": [
    "0",
    "Preparing the Lamb:",
    "Pre-heat the oven to 400 degrees Fahrenheit. It should actually be 392 degrees, but don’t worry about getting that technical unless you have a digital oven.",
    "Place lamb on cutting board fat side up. Lightly score the fat layer with a sharp knife. Next, generously sprinkle the lamb with salt and pepper. Mop up the excess seasoning with the rack of lamb, ensuring it’s thoroughly coated.",
    "Heat some olive oil in an oven safe pan. Seal the lamb by holding each side in the oil long enough to develop color (careful not to burn your hands). Gordon Ramsay says, “it’s simple mathematics, no color, equals no taste”. Quite simple indeed! Make sure you brown that lamb.",
    "Transfer the pan with the lamb into the oven and bake for 7-8 minutes. Prepare the crust while the lamb is cooking.",
    "Preparing the Crust:",
    "Place all of the ingredients for the crust except the mustard into a blender and pulse several times until it looks nice and green. Make sure you don’t over do it with the olive oil, just a splash.",
    "Pour the mixture into a deep dish (bowl or plate) and set aside.",
    "Putting it All Together:",
    "Remove the lamb from the oven and brush generously with mustard. Dip the lamb into the crust mixture coating it completely. Dip several times to ensure an even coating. Allow meat to rest for a bit.",
    "Place it back into the oven for 3-4 minutes when you’re ready to serve.",
    "Gordon serves the lamb with potatoes boulangère and courgettes provençal, but you can serve with anything you find fitting. I’ll gladly post the recipe for the side dishes if someone wants it. Just ask for it in a comment.",
    "Let me know how this recipe turns out for you.",
    "EDIT: I’ve added one of the side dishes, Gordon Ramsay’s Potatoes Boulangère. I will add the other soon and update this post with it’s link.",
    "You may also like -"
  ],
  "ingredients": [
    "0",
    "Ingredients for the Lamb:",
    "2 large racks of Lamb cut in half with 3 bones per serving",
    "Salt",
    "Pepper",
    "Olive Oil",
    "Ingredients for the Crust:",
    "4 slices of stale bread made into crumbs.",
    "7 Tbs. grated parmesan (roughly 1/2 a cup)",
    "Sprig parsley",
    "Sprig thyme",
    "Sprig coriander",
    "Sprig rosemary",
    "2 tablespoons English mustard (or sub with dijon)",
    "splash of olive oil"
  ],
  "__v": 1
}