{
  "hash": "4aa42583747fa445a9235729600fc30697a7ddf0",
  "title": "Sweet Chilli Chicken Rice Bowl",
  "image": "https://res.cloudinary.com/hellofresh/image/upload/f_auto,fl_lossy,q_auto,w_1200/v1/hellofresh_s3/image/sweet-chilli-chicken-rice-bowl-2199e1a9.jpg",
  "href": "https://www.hellofresh.com.au/recipes/sweet-chilli-chicken-rice-bowl-5c1b1a64e3f33906b2304352/",
  "extension": "Chrome",
  "firstAdded": "2019-08-16T10:54:03.909000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium saucepan, bring the water (for the rice) to the boil. Add the jasmine rice, stir, cover with a lid and reduce the heat to low. Cook for 12 minutes, then remove from the heat and set aside, covered, for another 10-15 minutes, or until the rice is tender and the water has absorbed. TIP: The rice will finish cooking in its own steam so don't peek! Season with salt and pepper.",
    "While the rice is cooking, thinly slice the long red chilli (see ingredients list), if using. In a small bowl, combine the chilli, rice wine vinegar (for the pickle), water (for the pickle), a generous pinch of salt and a generous pinch of sugar. Stir to coat the chilli in the liquid, then set aside until just before serving.",
    "While the chilli is pickling, thinly slice the carrot (unpeeled) into half-moons. Thinly slice the zucchini into half-moons. Roughly chop the Asian greens. Roughly chop the coriander. Cut the chicken breast into 1cm strips.",
    "Heat a large frying pan over a medium-high heat. Add the sesame seeds and toast, tossing, for 3-4 minutes or until golden. Transfer to a small bowl. Add the mayonnaise, sesame oil, soy sauce, sugar and rice wine vinegar (for the dressing). Mix well and set aside. TIP: The hot sesame seeds might sizzle in the sauce, this adds to the flavour!",
    "Return the frying pan to a medium-high heat with a drizzle of olive oil. Add the carrot and zucchini and cook until tender, 3 minutes. Add the Asian greens and cook until wilted, 2 minutes. Season to taste with salt and pepper and transfer to a plate. Return the pan to a medium-high heat with a drizzle of olive oil. Add the chicken and cook, tossing occasionally, until cooked through, 4-5 minutes. Remove from the heat and stir through the sweet chilli sauce.",
    "Drain the pickled chilli. Divide the rice between bowls and top with the sweet chilli chicken, carrot, zucchini and Asian greens. Stir the sesame dressing until well combined and drizzle over the top. Sprinkle with the coriander, crushed peanuts and pickled chilli (if using). TIP: For the low-calorie option, serve with 1/2 the rice, 1/2 the peanuts and 1/2 the sesame dressing."
  ],
  "ingredients": [
    "0",
    "1 packet",
    "jasmine rice",
    "½ unit",
    "long red chilli",
    "1 unit",
    "carrot",
    "1 bunch",
    "Asian greens",
    "1 unit",
    "zucchini",
    "1 bag",
    "coriander",
    "1 packet",
    "chicken breast",
    "2 sachet",
    "sesame seeds",
    "(ContainsSesame)",
    "1 tub",
    "mayonnaise",
    "(ContainsEgg)",
    "1 tub",
    "sweet chilli sauce",
    "1 packet",
    "crushed peanuts",
    "(ContainsPeanuts)",
    "Not included in your delivery",
    "olive oil",
    "1.25 cup",
    "water (for the rice)",
    "2 tbs",
    "rice wine vinegar (for the pickle)",
    "2 tbs",
    "water (for the pickle)",
    "2 tsp",
    "sesame oil (or oil)",
    "(ContainsSesame)",
    "1.5 tsp",
    "soy sauce (or gluten free tamari soy sauce)",
    "(ContainsSoya, Gluten)",
    "1 tsp",
    "sugar",
    "1 tsp",
    "rice wine vinegar (for the dressing)"
  ],
  "__v": 1
}