{
  "hash": "2908919596cf6b83a01fff09db71efb6c576118a",
  "title": "Meatballs in Guajillo Sauce",
  "image": "https://patijinich.com/wp-content/uploads/2017/08/605-meatballs-in-guajillo-sauce-912x622.jpg",
  "href": "https://patijinich.com/recipe/meatballs-in-guajillo-sauce/",
  "extension": "Chrome",
  "firstAdded": "2017-10-29T13:21:33.608000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat a casserole over medium-high heat. Once hot, toast the guajillo chiles, turning often, until toasted deeply browned and you can smell the chile fumes, about 2 minutes. Add the tomatillos and garlic, cover with water, and bring to a boil over high heat. Reduce heat to medium and simmer until the tomatillos are thoroughly cooked, their color has changed from a bright green to olive, and the guajillos have plumped up and rehydrated, about 12 minutes. Remove from the heat.",
    "Using a slotted spoon, transfer the tomatillos, garlic, chiles and 1/2 cup cooking liquid to a blender. Allow to cool slightly, add 1 teaspoon salt and puree until completely smooth. Drain the water from the casserole or soup pot, rinse and dry, and return to the stove.",
    "Add the oil and heat over medium heat. Once hot, add 1 cup of the chopped onion and cook until tender and the edges have just begun to brown, about 5 minutes. Add the tomatillo puree, cover partially as the thick sauce will splash and splutter, and simmer for about 7 to 8 minutes, until the sauce has thickened and darkened.",
    "Meanwhile combine the ground turkey with the breadcrumbs, egg, remaining 1/4 cup onion, remaining 1/2 teaspoon salt, and pepper. Mix together well.",
    "When the tomatillo puree has cooked down stir in the broth, scraping the bottom and sides of the casserole to incorporate any sauce sticking to the bottom and sides of the pan.",
    "Place the ground turkey mixture and a small bowl of water next to the casserole. Wet your hands, and start shaping the turkey into approximately 1 1/2-inch balls. Gently drop the balls into the sauce as you form them. When all the meatballs have been added to the sauce, add the sprigs of epazote or cilantro and simmer over medium heat, uncovered, for 35 minutes. Serve."
  ],
  "ingredients": [
    "0",
    "6guajillo chilesstemmed and seeded",
    "2poundstomatilloshusked and rinsed",
    "3garlic clovespeeled",
    "1 1/2teaspoonskosher or coarse sea saltdivided, or to taste",
    "2tablespoonscanola or safflower oil",
    "1 1/4cupsfinely chopped oniondivided",
    "2poundsground turkey breast",
    "1/2cupunseasoned breadcrumbs",
    "1large egglightly beaten",
    "1/4teaspoonfreshly ground black pepper",
    "3cupschicken broth",
    "2sprigs offresh epazoteor cilantro sprigs, or substitute 4 dried leaves"
  ],
  "__v": 1
}