{
  "hash": "b1b706c013830bedfe8b8a97748123c701f344f7",
  "title": "Wicked Chicken Riggies",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2013/2/25/0/DV1602H_wicked-chicken-riggies-recipe_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/wicked-chicken-riggies-recipe.html",
  "firstAdded": "2015-01-24T19:34:13.942000",
  "users": [
    null
  ],
  "keywords": [
    "chipotle",
    "pepper",
    "adobe",
    "serrano",
    "chiles",
    "stemmed",
    "rough",
    "hot",
    "chili",
    "oil",
    "olive",
    "red",
    "onion",
    "dice",
    "garlic",
    "dry",
    "basil",
    "oregano",
    "kosher",
    "salt",
    "sprinkling",
    "black",
    "cayenne",
    "green",
    "bell",
    "yellow",
    "favorite",
    "tomato",
    "cream",
    "romano",
    "sugar",
    "rigatoni",
    "noodles",
    "chicken",
    "breast",
    "strips",
    "locatelli",
    "cheese",
    "scallions",
    "retain",
    "final"
  ],
  "directions": [
    "0",
    "For the hot sauce: In a blender, carefully blenderize the chipotle peppers, serrano chiles and pepper oil. This stuff is hot! Be careful with splatter! Reserve.",
    "For the chicken: In a large braiser or saucepot, warm 3/4 cup of the olive oil over medium heat for 2 to 3 minutes. Add the onions, garlic, basil, oregano, salt, black pepper, cayenne and red pepper flakes. Stir well and cook until the onions are translucent.",
    "Stir the fresh chopped bell peppers into the onion mixture. Stir to coat. Add the reserved hot sauce. Continue cooking for 2 to 3 minutes, stirring occasionally. Add the tomato sauce, heavy cream, Romano and sugar. Whisk well!",
    "Lower the heat until the sauce slightly bubbles, and stir well. Turn the heat to low or off while sauteing the chicken strips and cooking the rigatoni noodles.",
    "When the sauce is nearing doneness, cook the rigatoni noodles according to package directions. I like to pre-cook my pasta for sauteed pasta dishes such as this. Pre-cooking rigatoni to near doneness, straining and holding at room temperature, or completely chilling down if holding for several hours or more and then dunking in hot, boiling water prior to sauteing works well.",
    "For the chicken saute, heat a large saute pan with the remaining olive oil. First, sprinkle the chicken strips with 1 teaspoon salt (more or less), and add to the hot olive oil, one layer at a time. Do not overcrowd the pan. Cook in batches if necessary. Add a dash of black pepper if desired. Flip and shake the chicken pieces around in the hot pan to sear all sides. Cook until opaque and lightly brown, about 4 minutes. Set aside.",
    "Toss the tomato sauce and chicken in a large bowl in half-batches, or altogether. Pour onto a serving platter or individual pasta bowls. Garnish with locatelli cheese and reserved fresh scallions.",
    "This recipe was provided by a chef, restaurant or culinary professional and may have been scaled down from a bulk recipe. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results.",
    "Recipe courtesy Pasta's Kitchen Team, Pastabilities"
  ],
  "ingredients": [
    "0",
    "1/2 can chipotle pepper in adobe sauce",
    "10 serrano chiles, stemmed, rough chop",
    "3/4 cup hot pepper oil ( chili oil)",
    "3/4 cup olive oil plus 3 to 4 tablespoons",
    "1 red onion, small dice",
    "2 tablespoons finely minced fresh garlic",
    "1 tablespoon dry basil",
    "1 tablespoon dry oregano",
    "2 teaspoons kosher salt, plus more for sprinkling",
    "1 teaspoon black pepper, plus more for sprinkling",
    "2 teaspoons cayenne pepper",
    "2 teaspoons red pepper flakes",
    "1 green bell pepper, small dice",
    "1 red bell pepper, small dice",
    "1 yellow bell pepper, small dice",
    "8 cups favorite tomato sauce",
    "6 cups heavy cream",
    "2 cups grated Romano",
    "1/4 cup sugar",
    "1 to 1 1/2 pounds dried rigatoni noodles",
    "2 pounds chicken breast, cut into strips",
    "Shredded locatelli cheese, or favorite grated cheese, for serving",
    "4 scallions, fine dice (retain for final garnish)"
  ],
  "__v": 1
}