{
  "hash": "2512a13e9e53e24af9f5d06d0619e12db594dd80",
  "title": "Goat Cheese Polenta with Roasted Vegetables",
  "image": "https://cookieandkate.com/images/2017/11/goat-cheese-polenta-recipe-2.jpg",
  "href": "https://cookieandkate.com/2017/vegetable-goat-cheese-polenta-recipe/",
  "extension": "",
  "firstAdded": "2018-04-30T13:06:00.720000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To roast the vegetables: Preheat the oven to 400°F. On a large, rimmed baking sheet, combine the vegetables with 2 tablespoons olive oil and a sprinkle of salt and pepper. Toss until they are lightly coated in oil, then arrange the vegetables in a single layer across the pan. Bake for 25 to 40 minutes (timing will depend on your choice of vegetables), tossing halfway, until the vegetables are tender and deeply golden on the edges.",
    "To cook the polenta: In a medium saucepan, warm 2 teaspoons olive oil over medium heat until shimmering. Add the chopped bell pepper and ½ teaspoon salt. Cook, stirring occasionally, until the pepper is tender, about 5 minutes.",
    "Add the amount of water specified on your package of polenta, crank up the heat and bring the mixture to a boil. Pour in the polenta, whisk to combine, and reduce heat to medium-low. Cook until thickened, which can take as little as 5 minutes depending on your polenta, whisking often to remove any clumps. Remove the pot from the heat, and stir in the butter, salsa verde and freshly ground black pepper, to taste. Add additional salt, if necessary. Gently fold in the crumbled goat cheese, just until combined. Cover and set aside.",
    "Cook your eggs as desired. Divide the grits and eggs into 4 bowls. Divide the vegetables into the bowls and finish them with a light sprinkle of green onion. Serve with additional salsa verde and/or hot sauce on the side."
  ],
  "ingredients": [
    "0",
    "Roasted vegetables",
    "About 2 pounds mixed vegetables (I used a small butternut squash and red onion here; broccoli, Brussels sprouts, sweet potato and bell peppers are also great)",
    "2 tablespoons extra-virgin olive oil",
    "Fine sea salt",
    "Freshly ground black pepper",
    "Goat cheese polenta",
    "2 teaspoons extra-virgin olive oil",
    "1 red bell pepper, chopped",
    "½ teaspoon fine-grain sea salt, to taste",
    "3 to 4 cups water, according to package directions",
    "1 cup corn polenta (also called grits)*",
    "1 tablespoon butter",
    "1 to 3 tablespoons mild salsa verde (homemade or store-bought)",
    "Freshly ground black pepper",
    "2 ounces goat cheese, crumbled (about ½ cup crumbled)",
    "Eggs, etc.",
    "4 eggs, cooked as desired**",
    "Finely sliced green onion, for garnish",
    "Additional salsa verde and/or hot sauce (I love Cholula)"
  ],
  "__v": 1
}