{
  "hash": "07acfb1c75806524f4dc7e33201832d73770deac",
  "title": "Quick & Delicious Hollandaise Sauce",
  "image": "http://img.sndimg.com/food/image/upload/w_555,h_416,c_fit,fl_progressive,q_95/v1/img/recipes/36/37/05/picUC3FfK.jpg",
  "href": "http://www.food.com/recipe/quick-delicious-hollandaise-sauce-363705",
  "extension": "Firefox",
  "firstAdded": "2016-06-02T09:19:20.099000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "NOTE: I HAVE BEEN MAKING HOLLANDAISE FOR YEARS AND HAVE NEVER HAD A SINGLE OCURRRENCE OF \"SALMONELLA\"! USE ONLY THE FRESHEST CRACK-FREE EGGS THAT HAVE BEEN PROPERLY REFRIGERATED. BEFORE BREAKING EGGS, SANITIZE THE OUTER SHELLS FIRST, THEN RINSE WELL FOR ADDED SAFETY. ALWAYS SERVE HOLLANDAISE WITHIN 1 HOUR OF PREPARATION. (STEP ONE): FINELY grate one washed, fresh organic lemon to yield 1/8 teaspoon zest; KNEAD and squeeze enough lemons to yield 1 tablespoon juice.",
    "SELECT a durable, quality kitchen blender with a removable center lid knob.",
    "SEPARATE two large eggs and add the yolks into the blender.",
    "ADD the lemon juice, lemon zest, 2-3 drops Tabasco brand sauce, and 1 pinch cayenne pepper; COVER blender and pulse a few times until mixture is combined.",
    "PLACE 8 tablespoons (1 stick) unsalted butter in a microwave-safe measuring cup with spout; MELT butter on reduced power or in increments, until just melted.",
    "REMOVE blender lid's center knob to leave a feeding hole; REPLACE adjusted lid.",
    "SLOWLY trickle the melted butter into blender feeder hole by drips or up to the thinnest steady stream, until all of the butter has been added, and the mixture is completely blended and emulsified (if mixture is too thick, thin with 1 teaspoon lukewarm water, then re-blend).",
    "SEASON hollandaise with 7/8 - 1 teaspoon kosher salt.",
    "SERVE immediately, or keep Hollandaise warmed over a double boiler until just heated; stir as needed).",
    "ENJOY!"
  ],
  "ingredients": [
    "0",
    "2 large egg yolks",
    "8 tablespoons unsalted butter",
    "1 tablespoon fresh organic lemon juice",
    "1⁄8 teaspoon fresh organic lemon zest",
    "2 -3 drops Tabasco sauce (important ingredient, use Tabasco brand only)",
    "1 pinch cayenne pepper (or paprika, for milder sauce)",
    "kosher salt, to taste (about 7/8-1 teaspoon)"
  ],
  "__v": 1
}