{
  "hash": "496dd0c034d754269df08bdd76f173fd45d73335",
  "title": "Thumbprint Cookie Recipe (low carb, paleo diet, gluten free) MARCH 7, 2016 BY CAITLIN WEEKS LEAVE A COMMENT I made this thumbprint cookie recipe for an essential oils class I had at my house. The people loved them so much and asked for more. My little brother ate about 10 in one sitting and my husband liked them because they are low carb and Paleo, and gluten free. Low Carb and Paleo Thumbprint Cookie Recipe",
  "image": "http://www.grassfedgirl.com/wp-content/uploads/2016/03/rasberry_thumbprint_cookie_sq_b.jpg",
  "href": "http://www.grassfedgirl.com/low-carb-and-paleo-thumbprint-cookie-recipe/",
  "extension": "Chrome",
  "firstAdded": "2016-03-11T13:15:38.359000",
  "users": [
    null
  ],
  "keywords": [
    "thumbprint",
    "cookie",
    "recipe",
    "low",
    "carb",
    "paleo",
    "diet",
    "gluten",
    "free",
    "march",
    "caitlin",
    "weeks",
    "leave",
    "comment",
    "essential",
    "oils",
    "class",
    "house",
    "people",
    "loved",
    "asked",
    "brother",
    "ate",
    "sitting",
    "husband",
    "liked",
    "prep",
    "time",
    "minutes",
    "yield",
    "cookies",
    "almond",
    "flour",
    "order",
    "eggs",
    "swerve",
    "stevia",
    "coconut",
    "sugar",
    "vanilla",
    "drop",
    "nutmeg",
    "oil",
    "raspberry",
    "fruit",
    "jam",
    "carbohydrate"
  ],
  "directions": [
    "0",
    "Directions:",
    "Preheat the oven to 350 degrees. Cover a cookie sheet with parchment paper. Mix the eggs, almond flour, sweetener, vanilla, and essential oil in a bowl until well combined. Roll about 2 tablespoons of the dough into a ball with your hands and place it on the sheet evenly spaced. When all the dough is used up, use your thumb to make an imprint on each cookie. Bake the cookies for 15-17 minutes until golden brown. Remove the cookies from the oven and let them cool for 10 minutes. Add 2 teaspoons of jam onto each cookie, serve and enjoy. Keep in the freezer for the long term.",
    "Nutrition Info: Calories: 113 Protein:7 g , Total Fat : 7.2 g, Total Carbs: 8.1 g, Net Carbs: 6.6 g, Fiber: 1.5 g (nutrition facts based on 16 servings)"
  ],
  "ingredients": [
    "0",
    "Thumbprint Cookie Recipe (low carb, paleo diet, gluten free)",
    "MARCH 7, 2016 BY CAITLIN WEEKS LEAVE A COMMENT",
    "I made this thumbprint cookie recipe for an essential oils class I had at my house. The people loved them so much and asked for more. My little brother ate about 10 in one sitting and my husband liked them because they are low carb and Paleo, and gluten free.",
    "Low Carb and Paleo Thumbprint Cookie Recipe",
    "Prep Time: 10 minutes",
    "Cook Time: 15 minutes",
    "Yield: 12-16 cookies",
    "Ingredients:",
    "2 cups blanched almond flour (order here)",
    "2 eggs, beaten (order here)",
    "1/4 cup Swerve (order here) or 1/2 teaspoon stevia extract (order here)",
    "or 1/4 cup coconut sugar (order here)",
    "1 teaspoon vanilla extract (order here)",
    "1 drop nutmeg essential oil, optional (order here)",
    "1/2 cup raspberry all fruit jam (order here) (8 grams carbohydrate in 2 teaspoons)"
  ],
  "__v": 1
}