{
  "hash": "86f2bfc61f29fdfc0e54cdc4e02b711a2956c1f0",
  "title": "20-Minute Cheesy Chicken Enchilada Soup",
  "image": "http://www.gimmesomeoven.com/wp-content/uploads/2014/09/20-Minute-Cheesy-Chicken-Enchilada-Soup-5.jpg",
  "href": "http://www.gimmesomeoven.com/cheesy-chicken-enchilada-soup-recipe/",
  "extension": "Chrome",
  "firstAdded": "2016-11-30T04:54:42.431000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the oil in a large stock over medium-high heat. (To save time, peel and dice the onion for the minute or so that the oil heats.) Add the onion and saute for 5 minutes, or until cooked and translucent. Add the garilc and saute for an additional minute until fragrant. Stir in the masa harina and cook for an additional minute.",
    "Pour in half of the chicken stock, and stir until completely combined. Add in the remainder of the chicken stock, and stir to combine. Immediately add in the chicken, enchilada sauce, black beans, tomatoes, green chiles, salt and cumin, and stir until combined. Continue stirring occasionally until the mixture reaches a simmer. Reduce heat to medium-low and let it simmer for 3 minutes, stirring occasionally so that the soup does not stick to the bottom of the pan. Then stir in the cheese, one handful at a time, until combined. Taste, and season the soup to taste with salt.",
    "Serve the soup warm with desired toppings."
  ],
  "ingredients": [
    "0",
    "2 tablespoons vegetable oil",
    "1 cup diced white onion (about 1 small white onion)",
    "2 cloves garlic, minced",
    "1/2 cup masa harina (corn flour)",
    "3 cups chicken stock",
    "2 cups cooked, shredded chicken",
    "1 1/4 cups (or 1 10-ounce can) red enchilada sauce, homemade or store-bought*",
    "1 (14-ounce) can black beans, rinsed and drained",
    "1 (14-ounce) can diced tomatoes, with juices (I prefer fire-roasted)",
    "1 (4-ounce) can chopped green chiles",
    "1/2 teaspoon ground cumin",
    "8 ounces sharp cheddar cheese, freshly grated",
    "1 teaspoon salt, or more/less to taste",
    "optional toppings: tortilla chips/strips, diced/sliced avocado, grated cheese, sour cream, chopped fresh cilantro, and/or pico de gallo"
  ],
  "__v": 1
}