{
  "hash": "9e240070f6ae53a2599ef42094c86ccbc006c188",
  "title": "Chickpea, Quinoa and Turmeric Curry",
  "image": "http://media.jrn.com/images/425*585/b99709645z.1_20160419113935_000_go1falno.1-0.jpg",
  "href": "http://archive.jsonline.com/features/recipes/376227431.html",
  "extension": "Chrome",
  "firstAdded": "2016-10-06T05:09:34.780000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place potatoes in a pan of cold water and bring to a boil, then let them cook about 25 minutes, until you can easily stick a knife through them. Drain well.",
    "Place potatoes in a large pan and add garlic, turmeric, coriander, chile, ginger, coconut milk, tomato paste and diced tomatoes. Bring to a boil, season with salt and pepper, then add quinoa and water.",
    "Reduce heat to a simmer, cover and allow to cook. Over the next 30 minutes, stir every 5 minutes or so to make sure nothing sticks to the bottom.",
    "Halfway through cooking, add the chickpeas.",
    "(This is quite a long cooking time, but this is how long quinoa takes to cook with all these ingredients, rather than just in water.)",
    "When there are just 5 minutes left, add the spinach and stir it in until it wilts. Once the quinoa has cooked and is fluffy, not crunchy, it’s ready.",
    "Notes: Be so careful with turmeric, it stains everything. Wear an apron while making this, try not to leave turmeric-coated spoons on white surfaces and don’t spill it over anything!",
    "If you like a bit of heat, add a sliced red chili to the cooking curry at the same time as the other spices."
  ],
  "ingredients": [
    "0",
    "serves 6",
    "1 pound new potatoes, halved",
    "3 garlic cloves, crushed",
    "1 tablespoon ground turmeric",
    "1 teaspoon ground coriander",
    "1 teaspoon chile flakes or powder",
    "1 teaspoon ground ginger",
    "1 can (14 ounces) coconut milk",
    "1 tablespoon tomato paste",
    "1 can (14.5 ounces) diced tomatoes",
    "Salt and pepper",
    "1 cup quinoa",
    "1 2/3 cups just- boiled water",
    "1 can (14 ounces) chickpeas, drained and rinsed",
    "5 ounces spinach"
  ],
  "__v": 2
}