{
  "hash": "9493b220317c03eaeafeaccb28eecdb5493b1d95",
  "title": "Cream of Mushroom Soup",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2014/12/cream-of-mushroom-soup-horiz-d-1600.jpg",
  "href": "https://www.simplyrecipes.com/recipes/cream_of_mushroom_soup/",
  "extension": "Chrome",
  "firstAdded": "2018-01-25T02:50:52.116000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Sauté the mushrooms: Heat olive oil on medium high heat in a 5-6 quart thick-bottomed pot. When the oil is hot, swirl in the butter. Once the butter has melted, add the mushrooms, stir to coat with the olive oil and butter.",
    "Cook the mushrooms on medium high heat until they are lightly browned and have released most of their water, about 10 minutes.",
    "Remove 1 cup of the cooked mushrooms from the pot and set aside (they will be added back in later).",
    "2 Add shallots, garlic: Reduce heat to medium. Add the minced shallots and the garlic to the pot, stir to combine, cook for about a minute.",
    "3 Add salt, tarragon, stock: Add the salt, dried tarragon, and the stock to the pot. Increase the heat to medium high, bring to a simmer and cook, uncovered, for 10 minutes. Remove from heat.",
    "4 Purée soup: Using an immersion blender or working in batches with a standing blender, purée the soup until smooth.",
    "Then return to the pot. (If the soup is too thick for you, add some water or more stock to thin the soup to the desired level of thickness.)",
    "5 Stir in cream and reserved mushrooms: Whisk the cream into the soup and add the black pepper. Adjust salt and pepper to taste. Stir in the reserved cooked mushrooms."
  ],
  "ingredients": [
    "0",
    "4 Tbsp olive oil",
    "4 Tbsp butter",
    "2 pounds (900 g) cremini (or button) mushrooms, cleaned, roughly chopped or sliced 1/8-inch thick",
    "Small handful of shiitake mushrooms (chopped)",
    "3/4 cup minced shallots (6 ounces, 170 g)",
    "3 cloves garlic, minced (3 teaspoons)",
    "1 teaspoon kosher salt",
    "3/4 teaspoon dried tarragon",
    "4 cups (1 liter) chicken stock (or vegetable stock for vegetarian option)",
    "1/2 cup (120 ml) heavy cream",
    "1/2 teaspoon freshly ground black pepper (more or less to taste)"
  ],
  "__v": 1
}