{
  "__v": 2,
  "directions": [
    "0",
    "Prepare pork: Cut pork along the grain into long 1 1/2- to 2-inch-wide strips. Remove and discard any sinew but do not trim fat. Transfer pork to a large sealable plastic bag. Stir together remaining pork ingredients in a small bowl until combined well. Add to pork and turn to coat, then squeeze bag to eliminate as much air as possible and seal. Marinate pork, chilled, at least 4 hours but no longer than 24.",
    "Roast pork: Put oven rack in lower third of oven and preheat oven to 375°F. Put 1/2 inch water in a 13- by 9-inch roasting pan and place a metal rack across top of pan (rack should not touch water).",
    "Remove pork from marinade, reserving marinade, and arrange pork strips 1 inch apart on rack. Roast in oven 15 minutes.",
    "Meanwhile, bring marinade to a boil in a 1-quart saucepan, then boil 1 minute (marinade may look curdled). Remove from heat.",
    "Brush both sides of pork with some marinade and roast 10 minutes more. Generously brush both sides of pork with marinade again and roast, basting 2 or 3 times, 10 minutes more. I recommend brushing it as many times as it takes to use the marinade up; you won’t regret it.",
    "Increase oven temperature to 400°F and roast pork until strips are mahogany-colored and caramelized on edges, 10 to 15 minutes more (pork shoulder will need the most time, tenderloin the least; totally cooking time will be about 50 minutes). Transfer to a cutting board and let stand, loosely covered with foil, 10 minutes."
  ],
  "firstAdded": "2014-06-19T07:48:18.398000",
  "hash": "2b1af585a1ac6a3c5b4c586cd7d9921aceab156f",
  "href": "http://smittenkitchen.com/blog/2007/05/deb-1-mandoline-0/",
  "image": "http://farm1.static.flickr.com/191/507087305_c86d94cff9.jpg",
  "ingredients": [
    "0",
    "1 pound solid piece boneless pork butt (shoulder) or pork tenderloin",
    "1/4 cup hoisin sauce",
    "1/4 cup soy sauce (low-sodium is best here)",
    "1/4 cup Chinese rice wine or sake",
    "1 tablespoon finely chopped peeled fresh ginger",
    "1 teaspoon finely chopped garlic",
    "1/2 teaspoon salt (see Note below)"
  ],
  "keywords": [
    "solid",
    "boneless",
    "butt",
    "shoulder",
    "pork",
    "tenderloin",
    "hoisin",
    "soy",
    "lowsodium",
    "best",
    "chinese",
    "rice",
    "wine",
    "sake",
    "ginger",
    "garlic",
    "salt"
  ],
  "title": "Roast Pork",
  "users": [
    null
  ]
}