{
  "hash": "3c285b49346a616cb19a9801ec149d98156a8870",
  "title": "Skinny Tortilla-less Chicken and Poblano Enchiladas",
  "image": "http://ifoodreal.com/wp-content/uploads/2014/05/uncooked-dish-skinny-tortillaless-chiken-poblano-enchiladas-recipe.jpg",
  "href": "http://ifoodreal.com/skinny-tortilla-less-chicken-and-poblano-enchiladas/",
  "extension": "Chrome",
  "firstAdded": "2015-07-20T13:25:19.790000",
  "users": [
    null
  ],
  "keywords": [
    "boneless",
    "skinless",
    "chicken",
    "breasts",
    "chili",
    "cumin",
    "poblanos",
    "green",
    "bell",
    "peppers",
    "jalapeos",
    "white",
    "swiss",
    "chard",
    "leaves",
    "low",
    "fat",
    "mozzarella",
    "cheese",
    "divided",
    "avocado",
    "cilantro",
    "tomato",
    "garlic",
    "salt",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "Preheat oven to 425 degrees F and line rimmed baking sheet with foil or parchment paper. In a small bowl, mix chill powder with cumin and rub chicken breasts with the mixture. Place in a single layer on prepared baking sheet along with poblanos (3 green bell peppers + 2 jalapeños). Bake uncovered for 35 minutes. Remove from the oven, transfer chicken to a medium bowl and peppers to another bowl that you can cover tightly with a lid. Let peppers sit covered and chicken to cool down for 15 minutes.",
    "In the meanwhile, rinse Swiss chard and shake off excess water. Lay flat on a cutting board, one leaf at a time, and using sharp knife remove the membrane and cut into 2 parts. Repeat the same steps with remaining leaves. You should end up with 8 \"tortillas\". Set aside.",
    "In a medium bowl, mix together Enchilada Sauce Ingredients. Spread 1 cup sauce on the bottom of 8\" x 11\" baking dish. Set aside.",
    "Remove the stem, seeds (leave some in, they are not very hot) and skin from poblanos (3 green bell peppers + 2 jalapeños). Some skin left on is fine. Cut or rip with your hands into wide strips and set aside in a bowl. Shred cooled down chicken using 2 forks and mix with 1 + 1/2 cup Enchilada Sauce.",
    "To roll enchiladas: Place one \"tortilla\" at a time on a flat surface and fold in half lengthwise. Fill with 1/4 cup chicken mixture and top with 1 - 2 poblano strips + 1 tbsp cheese and roll. Place into previously prepared baking dish and repeat this step with remaining enchiladas.",
    "Top evenly rolled enchiladas with remaining Enchilada Sauce and 1/2 cup cheese. Bake for 10 mins. Remove from the oven, cover with foil and let stand for 10 minutes. Serve hot with avocado and cilantro if desired."
  ],
  "ingredients": [
    "0",
    "1 lb boneless & skinless chicken breasts",
    "1/2 tsp chili powder",
    "1/2 tsp cumin",
    "3 Poblanos or 3 green bell peppers + 2 jalapeños*",
    "4 large white Swiss chard leaves",
    "1 cup low fat mozzarella cheese, divided",
    "Avocado and cilantro for garnish, optional",
    "2 x 14 oz cans tomato sauce",
    "1 tsp cumin",
    "1 tsp chili powder",
    "1 tsp garlic powder",
    "1/4 tsp salt",
    "1/2 tsp black pepper, ground"
  ],
  "__v": 1
}