{
  "__v": 1,
  "directions": [
    "0",
    "Method of making fillings:",
    "Combine softened butter with sugar.",
    "Add egg, stir well, then followed by desiccated coconut. Combine all ingredients well. You can make the filling while waiting for the 2nd round of proofing completed. Or you might like to prepare in advance, cut into 6 equal portions, place in fridge until you need it. If they are chilled too long, place them in room temperature for a while before use. That would be much easier to handle.",
    "Method of making buns:",
    "Please refer to the previous recipe to make dough with tangzhong (step 1 to 3). After completing the 1st round of proofing, double in size, transfer dough to a clean floured surface.",
    "Deflate and divide the dough into six equal portions. Knead into ball shapes. Cover with cling wrap, let rest for 15 minutes.",
    "Roll out each part with a rolling pin into an oval shape. Place custard filling evenly onto the surface of dough. Roll from top to bottom to enclose the filling. Flatten dough with pin. Again, roll from top to bottom. Knead into a ball shape. Repeat this step of rolling and wrapping fillings with the rest of your dough. With seals facing down, place the six balls into a greased baking tray or lined with baking paper, covered with cling wrap or a wet towel. Leave it for the 2nd round of proofing, about 45 to 60 minutes, until double in size.",
    "Brush whisked egg on surface of buns. Sprinkle sesame seeds if you like. Bake in a pre-heated 180C (356F) oven for 35 minutes, or until golden brown. At about 5 minutes before removing from oven, brush syrup on the surface of buns. Transfer onto a wire rack and let cool completely."
  ],
  "firstAdded": "2014-07-04T18:57:25.371000",
  "hash": "8e63368a1df33766328558dc7fff84661050c597",
  "href": "http://en.christinesrecipes.com/2010/03/japanese-style-coconut-custard-buns.html",
  "image": "http://1.bp.blogspot.com/_V0CoK16CILc/S6XvdqI5UEI/AAAAAAAAIYE/iXE1QmQLqng/s800/%E6%A4%B0%E8%93%89%E9%BA%B5%E5%8C%85%20Coconut%20Custard%20Buns01.jpg",
  "ingredients": [
    "0",
    "Ingredients of buns:",
    "350 gm bread flour",
    "55 gm caster sugar",
    "5 gm salt",
    "56 gm egg",
    "7 gm milk powder (to increase fragrance, optional)",
    "125 ml milk",
    "120 gm tangzhong (refer to this recipe for making tanzhong)",
    "5 to 6 gm instant yeast",
    "30 gm butter (cut into small pieces, softened at room temperature)",
    "Ingredients of fillings:",
    "30 gm butter, softened",
    "30 gm caster sugar",
    "30 gm egg, whisked",
    "60 gm desiccated coconut"
  ],
  "keywords": [
    "buns",
    "bread",
    "flour",
    "caster",
    "sugar",
    "salt",
    "egg",
    "milk",
    "increase",
    "fragrance",
    "tangzhong",
    "refer",
    "recipe",
    "making",
    "tanzhong",
    "instant",
    "yeast",
    "butter",
    "pieces",
    "softened",
    "room",
    "fillings",
    "whisked",
    "desiccated",
    "coconut"
  ],
  "title": "Japanese Style Coconut Custard Buns",
  "users": [
    null
  ]
}