{
  "hash": "082f1f3c857f400b5da09254f5d72c2eccdcf9ee",
  "title": "BUFFALO SAUCE BURGER",
  "image": "https://cooksmarts.imgix.net/meal_photos/1098/20180528-Buffalo-Sauce-Burger-NM-2.jpg?ixlib=rails-2.1.4&w=430&drp=1",
  "href": "https://mealplans.cooksmarts.com/days/1098?version=standard&servings=6",
  "extension": "",
  "firstAdded": "2018-05-29T16:38:47.152000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make buffalo blue cheese sauce - Crumble cheese and chop green onions. Combine cheese, green onions (white and green parts), yogurt, and mayonnaise. Add hot sauce until sauce is spiced to your liking. The sauce should be easy to spread, so if it is very thick, thin it with some water. (Can be done up to 5 days ahead)",
    "Celery / Carrots - Slice into sticks and combine. If prepping ahead, soak them in cold water in the fridge to help them stay crisp. (Can be done up to 4 days ahead)",
    "Make burgers - Use hands to combine beef with Worcestershire sauce, salt, and pepper. Form into 1\" / 2.5 cm thick patties and make a depression in the center with your thumb (this will prevent them from rounding in the middle as they cook). Cover and refrigerate if not making right away. (Can be done 1 day ahead)",
    "Onions - Thinly slice.",
    "If making burgers on the grill: Heat grill to 500F / 260C degrees. Brush grill grates with first portion of cooking oil and then grill patties for 2 minutes on each side over direct heat (i.e., over the flames). Move patties to indirect heat, close the grill, and cook for another 2 to 3 minutes for medium-rare, 3 to 4 minutes for medium, and 5 to 6 minutes for well-done. Brush buns with second portion of cooking oil and toast on grill for the last 2 to 3 minutes.",
    "If making burgers on stovetop: Heat a skillet or grill pan over medium-high heat. Brush pan with first portion of cooking oil and then place patties on heated oil. Cook patties for 2 minutes on each side. Then lower heat to medium and cook for another 2 to 3 minutes for medium-rare, 3 to 4 minutes for medium, and 5 to 6 minutes for well-done. Brush buns with second portion of cooking oil and place, cut-side down, in skillet or pan. Toast until golden brown.",
    "Spread the tops and bottoms of buns with half the buffalo blue cheese sauce (reserve the other half). Place some spinach leaves and then a burger patty on each of the bottom buns. Finish with a slice of onion. Close burgers with the top bun.",
    "Serve burgers with celery and carrot sticks and the remaining buffalo blue cheese sauce for dipping. Enjoy!"
  ],
  "ingredients": [
    "0",
    "Buffalo Sauce Burger:",
    "Celery (opt) - 3 stalks, sliced into sticks for dipping",
    "Carrots - 12 oz, sliced into sticks for dipping",
    "Beef, ground - 2 1/4 lbs",
    "Worcestershire sauce - 3 tsp",
    "Salt - 3/4 tsp",
    "Black pepper - 3/8 tsp",
    "Onions, medium and red - 3/4, thinly sliced",
    "Oil, cooking - 1 1/2 Tbsp + 1 1/2 Tbsp",
    "Hamburger buns - 6",
    "Spinach, baby - 1 1/2 oz (sub any lettuce leaves)",
    "Buffalo Blue Cheese Sauce:",
    "Cheese, blue - 3 oz, crumbled (sub feta or goat cheese)",
    "Green onions - 1 1/2 stalks, chopped, green and white parts combined",
    "Yogurt, plain or Greek - 3/4 cup",
    "Mayonnaise - 3 Tbsp",
    "Hot sauce of choice - 3 tsp, more to taste"
  ],
  "__v": 2
}