{
  "hash": "ec4bfbc702af10785e92428fd2ba3c527189315c",
  "title": "One Pot Pasta with Tomato & Mascarpone Sauce",
  "image": "https://www.happyveggiekitchen.com/wp-content/uploads/2014/11/1-tomato-mascarpone-pasta-047-1023x1024.jpg",
  "href": "https://www.happyveggiekitchen.com/tomato-mascarpone-one-pot-pasta/",
  "extension": "Firefox",
  "firstAdded": "2019-03-03T08:04:42.205000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large pot, heat some olive oil and gently saute your onions until soft.",
    "Add the garlic and herbs, and saute on a very low heat for a further 1-2 minutes until fragrant.",
    "Add tomatoes, tomato paste, salt and balsamic vinegar. Cook for 5 minutes, until bubbling.",
    "Now add the fusilli along with the boiling water. The sauce will be very watery and runny but don’t worry- the pasta will absorb all the excess water as it cooks.",
    "Bring to the boil, and then simmer for 10 to 12 minutes, stirring often, until the pasta has cooked and the sauce has thickened back up. If it goes too dry, add some more water. It’s hard to say how much you’ll need because some pasta brands are thicker than others.",
    "Now add the spinach, basil and butter, and stir over a low heat until it’s cooked down.",
    "Finally, stir in the mascarpone until melted. You should have a deliciously thick, creamy sauce."
  ],
  "ingredients": [
    "0",
    "500 g (18 oz) fusilli",
    "Olive oil",
    "1 medium red onion, or 1/2 of a large one*, chopped (or a couple of shallots)",
    "5 garlic cloves, crushed",
    "1 Tblsp dried Italian herbs",
    "2 tsps salt",
    "2 cans (400g / 14oz each) canned chopped tomatoes with liquid (I like to use one can of cherry tomatoes + one can of regular chopped tomatoes)",
    "140g (5oz) of tomato paste – you may want more or less depending on how watery your canned tomatoes are so use your judgement here.",
    "1 Tblsp balsamic vinegar",
    "950 ml / 4 cups of boiling water (you may need more)",
    "A few handfuls of fresh basil",
    "250g / 9oz fresh spinach (try adding some rocket/arugula too!)",
    "25-50g / 2-4 Tblsps of butter (as much as you dare!)",
    "3 heaping dessertspoons of mascarpone"
  ],
  "__v": 1
}