{
  "hash": "efa441a091c65e88ca4adc819c1509f817635a6c",
  "title": "PUMPKIN, ARUGULA AND VEGAN ‘GOAT CHEESE’ GNOCCHI",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/01/gnocci.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/pumpkin-arugula-and-vegan-goat-cheese-gnocchi/",
  "firstAdded": "2015-01-23T11:02:43.083000",
  "users": [
    null
  ],
  "keywords": [
    "pumpkin",
    "stockbroth",
    "garlic",
    "clove",
    "red",
    "chili",
    "medium",
    "brown",
    "onion",
    "arugula",
    "leaves",
    "rinsed",
    "goz",
    "gnocchi",
    "check",
    "vegan",
    "glutenfree"
  ],
  "directions": [
    "0",
    "At least an hour or two before you are ready to make this (or overnight), pop the ‘Goat Cheese’ nuts into a large bowl of water and allow to soak.",
    "When you are ready to make this dish, drain nuts and combine all ‘Goat Cheese’ ingredients in a high-speed blender. Blend on high until smooth and creamy and then transfer mixture to a small bowl or jar.",
    "Heat vegetable stock in a large pot over medium-high heat.",
    "Add garlic, chilli, onion and pumpkin, and simmer until pumpkin is soft.",
    "Remove from heat, allow to cool slightly (for safety), and blend in batches until smooth and creamy.",
    "Return blended pumpkin sauce to the pot, season with sea salt and fresh black pepper, and place over low heat.",
    "In a second pot, bring 4 cups of water to the boil over high heat.",
    "Carefully add gnocchi (watch out for hot splashes!) and allow to simmer for a couple of minutes until gnocchi rises to the top.",
    "Remove gnocchi from heat, strain, and divide among plates or bowls.",
    "Remove sauce from heat and pour evenly over pasta.",
    "Garnish with ‘Goat cheese’, fresh herbs and pumpkin seeds. Enjoy!"
  ],
  "ingredients": [
    "0",
    "2 cups chopped Pumpkin",
    "1 cup Vegetable Stock/Broth",
    "1 Garlic clove, peeled and chopped",
    "⅓ small Red Chili, chopped (optional)",
    "½ medium Brown Onion",
    "2 cups Arugula leaves, rinsed",
    "500g/17.6oz packet of Gnocchi (check ingredients for vegan & gluten-free)"
  ],
  "__v": 1
}