{
  "hash": "9df83b1d52814c2bf0d3cecea7b28c4a05ca7220",
  "title": "Stuffed Eggplant (Papoutsakia)",
  "image": "http://www.saveur.com/sites/saveur.com/files/images/2010-07/131-stuffed-eggplant400.jpg",
  "href": "http://www.saveur.com/article/Recipes/Stuffed-Eggplant-Papoutsakia",
  "firstAdded": "2014-12-26T09:08:55.449000",
  "users": [
    null
  ],
  "keywords": [
    "eggplants",
    "extravirgin",
    "olive",
    "oil",
    "garlic",
    "medium",
    "yellow",
    "onion",
    "beef",
    "pork",
    "lamb",
    "kosher",
    "salt",
    "black",
    "pepper",
    "tomatoes",
    "dry",
    "red",
    "wine",
    "oregano",
    "cinnamon",
    "unsalted",
    "butter",
    "flour",
    "milk",
    "parmesan",
    "cheese",
    "egg",
    "yolks",
    "nutmeg"
  ],
  "directions": [
    "0",
    "Cut each eggplant in half lengthwise and, using a spoon, scoop out most of the flesh, leaving a 1⁄2\"-thick eggplant shell; coarsely chop scooped-out flesh and set aside. Working in 2 batches, heat 1⁄4 cup oil in a 12\" skillet over medium-high heat. Add eggplant shells and cook, turning once, until browned and just wilted, about 5 minutes. Transfer eggplant shells to paper towels; set aside.",
    "Discard oil and wipe out skillet. Heat 1⁄4 cup oil in skillet over medium-high heat; add garlic and onions and cook, stirring often, until soft, about 5 minutes. Add meat, breaking it into small pieces with a wooden spoon, and season with salt and pepper; cook, stirring occasionally, until browned, about 5 minutes. Stir in reserved eggplant flesh, tomatoes, wine, oregano, cinnamon, and cloves; season with salt and pepper and bring to a simmer. Cook, stirring occasionally, until sauce has thickened, about 45 minutes. Remove pan from heat and set meat sauce aside.",
    "Heat butter in a 4-qt. saucepan over medium-high heat. Add flour and cook, whisking constantly, until smooth and slightly toasted, 1–2 minutes. Add milk; cook, whisking often, until sauce coats the back of a spoon, 8–10 minutes. Remove from heat, add 3⁄4 cup cheese and egg yolks; season with salt, pepper, and nutmeg. Stir béchamel until smooth; set aside.",
    "Heat oven to 350˚. Put eggplant shells cut side up in a rimmed baking sheet lined with aluminum foil. Sprinkle shells with half the remaining cheese and fill each with reserved meat sauce. Spoon béchamel over top and sprinkle with remaining cheese. Bake until eggplants are tender, about 20 minutes. Increase heat to broil and cook until béchamel is golden brown and bubbly, about 5 minutes more."
  ],
  "ingredients": [
    "0",
    "6 small eggplants (about 3⁄4 or 1 lb. each)",
    "3⁄4 cup extra-virgin olive oil",
    "7 cloves garlic, minced",
    "1 medium yellow onion, minced",
    "3⁄4 lb. ground beef, pork, or lamb",
    "Kosher salt and freshly ground black pepper, to taste",
    "2 cups crushed tomatoes",
    "3⁄4 cups dry red wine",
    "2 tbsp. dried oregano",
    "1⁄4 tsp. ground cinnamon",
    "1⁄8 tsp. ground cloves",
    "4 tbsp. unsalted butter",
    "1⁄2 cup flour",
    "2 cups milk",
    "1 1⁄2 cups finely grated Parmesan cheese",
    "2 egg yolks",
    "Pinch of freshly grated nutmeg, to taste"
  ],
  "__v": 1
}