{
  "hash": "105babecac914387eff060b668b0ad393bd8a255",
  "title": "Cheddar Chive Soufflés",
  "image": "http://www.fifteenspatulas.com/wp-content/uploads/2011/09/cheddarsouffle6-200x160.jpg",
  "href": "http://www.fifteenspatulas.com/cheddar-chive-souffles/",
  "firstAdded": "2014-12-21T18:28:58.878000",
  "users": [
    null
  ],
  "keywords": [
    "greasing",
    "ramekins",
    "use",
    "old",
    "butter",
    "wrappers",
    "parmigiano",
    "reggiano",
    "flour",
    "hot",
    "milk",
    "egg",
    "yolks",
    "sharp",
    "cheddar",
    "mustard",
    "chives",
    "whites",
    "mixed",
    "water",
    "cream",
    "tartar",
    "salt",
    "pepper"
  ],
  "directions": [
    "0",
    "Grease the bottom and sides of your ramekin(s) and sprinkle with parmesan cheese. Pop into the freezer for at least 5 minutes so the parmesan cheese sticks.",
    "Preheat your oven to 375 degrees F.",
    "In a small saucepan, melt the butter and cook until it stops sputtering (the water has cooked out). Whisk in the flour and a pinch of salt and cook for 2 minutes over medium. While constantly whisking, slowly pour in the milk, and turn the heat to high. Keep whisking, and once the mixture starts to boil, take the pan off the heat.",
    "In a big bowl, whisk together the egg yolks until smooth. Temper the eggs into the mixture by first pouring some of the hot sauce into the eggs (while constantly whisking), then pouring the eggs into the saucepan (whisk, whisk, whisk)! Whisk in the cheddar, mustard, chives, and a pinch of salt and pepper.",
    "In a very clean bowl, whip the egg whites and cream of tartar together with a hand mixer, until you get stiff peaks. Stir in 1/4 of the stiff egg whites into the egg yolk cheese base to lighten it, then fold the rest in via 3 installments, until the mixture is nice and light. Be gentle so you don't deflate the egg whites.",
    "Portion the souffle mixture into your ramekins, and fill them up to the top. Place on a sheet pan and bake for 25 minutes if you are using the small ramekins, and 35 minutes if you are doing the big one. Enjoy!"
  ],
  "ingredients": [
    "0",
    "butter for greasing the ramekins (I use old butter wrappers for this)",
    "2 tbsp grated parmigiano reggiano",
    "3 tbsp butter",
    "3 tbsp flour",
    "1.25 cups hot milk",
    "4 egg yolks",
    "6 oz sharp cheddar, grated",
    "1 tsp mustard",
    "2 tbsp chopped chives",
    "5 egg whites mixed with 1 tbsp water",
    "1/2 tsp cream of tartar",
    "salt and pepper"
  ],
  "__v": 1
}