{
  "hash": "f2aa974437262c12720c596370f26928818b16db",
  "title": "Greek Yogurt Blueberry Lemon Pound Cake",
  "image": "",
  "href": "http://amyshealthybaking.com/blog/2016/08/21/greek-yogurt-blueberry-lemon-pound-cake/",
  "extension": "Chrome",
  "firstAdded": "2017-05-26T22:05:56.977000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350°F, and lightly coat a 9x5” loaf pan with nonstick cooking spray.",
    "To prepare the cake, whisk together the flour, baking powder, baking soda, salt, and lemon zest in a medium bowl. In a separate bowl, whisk together the butter, egg whites, vanilla extract, and stevia. Stir in the Greek yogurt, mixing until no large lumps remain. Stir in the lemon juice and 2 tablespoons of milk. Alternate between adding the flour mixture and remaining milk, beginning and ending with the flour mixture, and stirring just until incorporated. (For best results, add the flour mixture in 3 equal parts.) Set aside 2 tablespoons of blueberries, and gently fold in the rest with a spatula.",
    "Spread the batter into the prepared pan, and gently press the remaining blueberries into the top. Bake at 350°F for 45-55 minutes or until the top feels firm to the touch and a toothpick inserted into the center comes out clean. Cool in the pan for 10 minutes before transferring to a wire rack to cool completely."
  ],
  "ingredients": [
    "0",
    "2 ¾ cups (330g) white whole wheat flour or gluten-free* flour (measured like this)",
    "1 ½ tsp baking powder",
    "¾ tsp baking soda",
    "½ tsp salt",
    "3 tbsp (15g) freshly grated lemon zest",
    "1 tbsp (14g) unsalted butter or coconut oil, melted and cooled slightly",
    "3 large egg whites, room temperature",
    "1 tbsp (15mL) vanilla extract",
    "2 tsp vanilla crème stevia",
    "¾ cup (180g) plain nonfat Greek yogurt",
    "½ cup (120mL) freshly squeezed lemon juice",
    "½ cup + 2 tbsp (150mL) nonfat milk",
    "1 ½ cups (210g) fresh blueberries Coupons"
  ],
  "__v": 1
}