{
  "hash": "3bdfbbf6511de4fa28320dc2cc9223cb8e0d8e42",
  "title": "Squash with Chilli Yoghurt and Coriander Sauce",
  "image": "https://flockler.com/thumbs/sites/192/ottolenghi-squash-with-yoghurt-a60e04f2-5e92-43cb-ae23-6ebd049f2c4e_s600x600.jpg",
  "href": "https://thehappyfoodie.co.uk/recipes/ottolenghis-squash-with-chilli-yoghurt-and-coriander-sauce?fbclid=IwAR3IWHDuD5bGHDKPnyTJyPWBdF4XG9f_WlZH72M2CHFG0VdUFYhnQD_MEEw",
  "extension": "Firefox",
  "firstAdded": "2019-10-19T04:11:51.312000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Preheat the oven to 220°C/200°C Fan/Gas Mark 7.",
    "Cut the squash in half lengthways, remove and discard the seeds, and then cut into 2cm-thick wedges, about 7cm long, leaving the skin on. Place in a large bowl with the cinnamon, 2 tablespoons of the olive oil, ¾ teaspoon of salt and a good grind of pepper. Mix well so that the squash is evenly coated. Place the squash on two baking trays, skin side down, and roast for 35 - 40 minutes, until soft and starting to colour on top. Remove from the oven and set aside to cool.",
    "To make the herb paste, place the coriander, garlic, the remaining 4 tablespoons of oil and a generous pinch of salt in a small food processor, blitz to form a fine paste and set aside.",
    "Reduce the oven temperature to 180°C/ 160°C Fan/Gas Mark 4. Lay the pumpkin seeds out on a baking tray and roast in the oven for 6- 8 minutes. The outer skin will pop open and they will become light and crispy. Remove from the oven and allow to cool.",
    "When you are ready to serve, swirl together the yoghurt and Sriracha sauce. Lay the squash wedges on a platter, drizzle over the spicy yoghurt sauce and then the herb paste (you can also swirl the yoghurt sauce and herb paste together, if you like). Scatter the pumpkin seeds on top, followed by the extra coriander leaves, and serve."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 small coquina or one large butternut squash (1.4kg in total)",
    "1 tsp ground cinnamon",
    "90ml olive oil",
    "50g coriander, leaves and stalks, plus extra leaves to garnish",
    "1 small garlic clove, crushed",
    "20g pumpkin seeds",
    "200g Greek yoghurt",
    "1½ tsp Sriracha (or another savoury chilli sauce)",
    "salt and black pepper"
  ],
  "__v": 1
}