{
  "hash": "eea49d08bf2d6bcec22d34cab3620b7102606754",
  "title": "ARUGULA, PEAR, AND GOAT CHEESE SALAD",
  "image": "http://www.plumpiecooks.com/wp-content/uploads/2011/12/salad_above21.jpg",
  "href": "http://www.plumpiecooks.com/2011/12/arugula-pear-and-goat-cheese-salad/",
  "extension": "Chrome",
  "firstAdded": "2019-11-23T11:52:01.282000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To prepare the vinaigrette, mix together the shallots, sherry vinegar, pomegranate molasses (or balsamic + honey substitution), and mustard. Slowly whisk in the olive oil until dressing comes together. I like to save bell jars or jars from jam or jelly to use for dressings. Instead of whisking in the olive, I put all of the ingredients into the jar, secure the top very tightly, and shake vigorously until the dressing comes together.",
    "For the salad, mix lettuces in a large bowl. Add pears and half of the crumbled goat cheese (Tip: It is easier to crumble the goat cheese if it is cold). Pour dressing over lettuce but save two tablespoons of dressing. Remember, you can always add, but you can’t take away. Using your heads or salad tongs, toss until dressing lightly coats salad. Add more dressing if salad looks dry.",
    "Crumble the remaining goat cheese over salad. Top with pine nuts (or pistachios) and pomegranate seeds. Serve immediately and enjoy!"
  ],
  "ingredients": [
    "0",
    "For the vinaigrette:",
    "1 large shallot, halved and thinly sliced",
    "1 tablespoon pomegranate molasses (or 1 tablespoon balsamic vinegar + 1 teaspoon honey)",
    "2 tablespoons sherry vinegar (or apple cider) vinegar",
    "1 teaspoon dijon mustard",
    "1/3 cup good quality, extra virgin olive oil",
    "salt and pepper to taste",
    "For the salad:",
    "4 cups of arugula, light packed",
    "4 cups of romaine lettuce, torn into bite-size pieces",
    "1 ripe pear, cored and cut into 1/2-inch pieces",
    "1/3 cup pomegranate seeds",
    "3 ounces fresh goat or feta cheese, crumbled",
    "1/4 cup pine nuts (or pistachios*), lightly toasted",
    "*if using pistachios, coursely chop"
  ],
  "__v": 1
}