{
  "hash": "95aa1d8d38feddac17377d2b71df91412d0cdfce",
  "title": "ROASTED RED PEPPER AND GARLIC SOUP",
  "image": "https://cdn77-s3.lazycatkitchen.com/wp-content/uploads/2018/10/roasted-red-pepper-and-garlic-soup-bowl-800x1200.jpg",
  "href": "https://www.lazycatkitchen.com/roasted-red-pepper-garlic-soup/",
  "extension": "Chrome",
  "firstAdded": "2018-12-10T18:36:00.134000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "HARISSA ROASTED CHICKPEAS",
    "Drain the chickpeas, spread them on a large plate or tray and allow them to air dry, if you have time. If you are in a rush, blot them on a clean kitchen towel or paper towel.",
    "Heat up a heavy-bottomed pan on a medium-high heat. Pour 1 tablespoon of olive oil in the hot pan and wait a few seconds for the oil to heat up.",
    "Chuck the drained chickpeas into the hot oil. Stir the chickpeas from time to time so that they don’t burn.",
    "Mix the harissa paste (let the oil drain away for a few seconds after measuring it out, a fork is useful here) into the chickpeas and sprinkle them with salt.",
    "Keep on roasting the chickpeas until they are evenly coated in harissa. Taste and adjust the amount of salt if necessary. Take off the heat and set aside.",
    "SOUP",
    "Preheat the oven to 205° C / 400° F.",
    "Cut the top off the garlic and drizzle the exposed cloves with a little bit of olive oil.",
    "Wrap the garlic in a piece of foil covering the entire bulb and stick it into the oven for about 40 minutes, until the cloves get soft and sticky.",
    "Heat up 1 tbsp of oil at the bottom of a medium size pot.",
    "Add the diced red onion and fry on a low heat until almost translucent, stirring from time to time.",
    "Mix in the smoked paprika and harissa paste. Fry them off gently for another minute on a low heat, stirring frequently.",
    "Add the chopped tomatoes, thyme, salt and a good grind of black pepper.",
    "Place the drained roasted peppers into a blender and add the squeezed roasted garlic flesh. Blend until smooth with a splash of water if needed. You could also add a sticky Medjool date to balance the flavours if you’d rather avoid adding sugar.",
    "Add roasted red pepper and garlic puree to the tomatoes. Allow the mixture to come to a gentle simmer.",
    "Add a splash of stock / water to achieve the consistency you like and adjust the spicing to your taste. I’ve added a bit of homemade date syrup to balance the acidity.",
    "Divide between two bowls. Serve topped with the spiced chickpeas, vegan cream (optional) and fresh parsley."
  ],
  "ingredients": [
    "0",
    "2 cups cooked chickpeas (about 1 cup dry)",
    "1 tbsp olive oil",
    "2-3 tsp harissa paste (oil drained)",
    "salt, to taste"
  ],
  "__v": 1
}