{
  "hash": "a281d4544f4ed7e827385ab302dc97d99b359f18",
  "title": "Grilled Eggplant Tartines",
  "image": "http://recipe-folder.com/img/recipe-images/095/023/4110089095.jpg",
  "href": "http://recipe-folder.com/recipe/5ed59f3dce7e4d08309a375b",
  "extension": "User Added",
  "firstAdded": "2020-06-02T00:37:17.908000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Step 1",
    "1",
    "Cut bread loaf in half lengthwise, then in half crosswise (for four pieces). Sprinkle eggplant slices lightly with salt and ground black pepper. Brush both sides of eggplant slices and cut sides of bread with 1/4 cup olive oil.",
    "2",
    "Step 2",
    "3",
    "Grill eggplant slices, covered, directly over medium 7 to 8 minutes or until browned and tender, turning once. Add bread, cut side down, to grill rack the last 1 to 2 minutes.",
    "4",
    "Step 3",
    "5",
    "Rub toasted sides of bread with garlic halves. Arrange eggplant, mozzarella, and tomatoes on toasted sides of bread. Return to grill. Grill, covered, 1 to 2 minutes or until cheese softens. Top with Parmesan and basil. Drizzle with additional olive oil and sprinkle with cracked black pepper. Serves 4.",
    "6",
    "Nutrition Facts",
    "7",
    "Per Serving:",
    "8",
    "586 calories; 25 g total fat; 9 g saturated fat; 2 g polyunsaturated fat; 10 g monounsaturated fat; 44 mg cholesterol; 1007 mg sodium. 432 mg potassium; 62 g carbohydrates; 4 g fiber; 6 g sugar; 20 g protein; 0 g trans fatty acid; 1330 RE vitamin a; 16 IU vitamin a; 0 mg vitamin c; 0 mg thiamin; 1 mg riboflavin; 0 mg niacin equivalents; 34 mg vitamin b6; 0 mcg folate; 382 mg calcium; 1 mg iron;"
  ],
  "ingredients": [
    "0",
    "1 1 pound loaf Italian baguette",
    "1",
    "8 0.75 inches thick slices eggplant",
    "2",
    "Salt and ground black pepper",
    "3",
    "¼ cup olive oil",
    "4",
    "1 clove garlic, halved",
    "5",
    "1 8 ounce ball fresh mozzarella cheese, sliced",
    "6",
    "4 medium roma tomatoes, thinly sliced",
    "7",
    "¼ cup shredded Parmesan cheese"
  ],
  "__v": 1,
  "hidden": true
}