{
  "hash": "b3285b5a7c821a88e66c2e3b28e4e3633b0cfc57",
  "title": "Cheesy Butternut Squash Mac & Cheese",
  "image": "http://cdn.fitmencook.com/wp-content/uploads/2015/10/IMG_5804-8.jpg",
  "href": "http://fitmencook.com/cheesy-butternut-squash-mac-cheese/",
  "extension": "Chrome",
  "firstAdded": "2017-08-06T04:02:55.422000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Set oven to 400F.",
    "Cut the end off the butternut squash and then slice it down the middle. Remove the seeds from the inside and then place the butternut squash on a baking sheet. Spray it with coconut or olive oil and sprinkle with sea salt & pepper. Roast in the oven for 1 hour or until the squash is tender.",
    "Cook the macaroni – according to the instructions – given while the squash is baking. Once it is finished, set the macaroni aside.",
    "Set a nonstick skillet on medium high heat and toss in turkey bacon. Cook the bacon long enough on each side that it becomes crispy, about 3 to 5 minutes per side. Once the bacon is crispy remove it from the skillet, allow it cool down for about 2 minutes, then chop the bacon into pieces to create bacon bits.",
    "Remove the squash from the oven and allow the squash to cool down (almost to room temperature). Then cut it into chunks and peel the pieces.",
    "To a high powered blender (I used the Vitamix Pro Series 750), add all of the ingredients except for the bacon bits and garnish. Blend the ingredients to create the creamy, cheesy sauce.",
    "Pour the sauce over the macaroni and stir thoroughly with a spatula. Then, toss in bacon bits and stir it again. Season to taste with more sea salt & pepper.",
    "Garnish with freshly chopped chives or parsley."
  ],
  "ingredients": [
    "0",
    "Substitute: wheat macaroni",
    "Substitute: wheat macaroni",
    "1 tablespoon fresh thyme",
    "1/2 tablespoon fresh rosemary",
    "sea salt & pepper to taste (I used truffle sea salt to boost the flavors)",
    "chives"
  ],
  "__v": 1
}