{
  "hash": "54b18759599f37af2843c9481f850ac8de2bcdde",
  "title": "Salted Peanut Butter Cookies",
  "image": "https://farm6.staticflickr.com/5666/22189488541_34ab9f5b82_z.jpg",
  "href": "https://smittenkitchen.com/2015/10/salted-peanut-butter-cookies/",
  "extension": "Chrome",
  "firstAdded": "2018-01-26T22:48:33.570000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350°F. Line a rimmed baking sheet with parchment paper.",
    "In a medium bowl, whisk together the light brown sugar and eggs until smooth. Whisk in the vanilla extract, then the peanut butter until smooth and completely incorporated; you shouldn’t be able to see any ribbons of peanut butter. Ovenly says you know the dough is ready when it has the consistency of Play-Doh, but I can tell you as the mom of a Play-Doh fanatic that mine was thinner, softer.",
    "If you’d like to get those pretty striations across the top of the cookies, chill the dough by freezing it in its bowl for 15 minutes, stirring it once (so the edges don’t freeze first), before scooping it. If you’re not obsessed with these markings, you can scoop it right away. Scoop or spoon the dough into balls — Ovenly uses about a 1/4-cup scoop (probably #16); I use a 1 2/3 tablespoons or #40 scoop. Place on prepared pan. For the tallest final shape, place the tray in the freezer for 15 minutes before baking.",
    "Sprinkle the dough balls lightly with coarse-grained sea salt just before baking. Bake smaller cookies for 14 to 15 minutes and larger for 18 to 20. When finished, cookies should be golden at edges. They’ll need to set on the sheet for a minute or two before they can be lifted intact to a cooling sheet. Trust me, you should let these cool completely before eating so the different textures (crisp outside, soft inside) can set up.",
    "Do ahead: You can definitely make the dough in advance and either refrigerate it for a couple days or freeze it longer. However, if I were going to freeze it, I’d probably go ahead and scoop it first. You can bake them right from the freezer.",
    "About chilling the dough: The Ovenly recipe says you can scoop and bake the cookies right away, but they keep their shape better if you chill them in the freezer for 15 minutes first. I tried it with and without and did find a better dome and final shape with the 15 minutes after. However, I was incredibly charmed by the striated marks from the cookie scoop on top of the cookie I bought last weekend, as well as in the photo in their book, and I realized that I couldn’t get it at home with just-mixed dough; you’ll get more of a blob shape from your scoop. So, I also chilled the dough for 15 minutes before scooping it and was then satisfied with the shape. It’s not necessary unless you’re as taken with top pattern as I am.",
    "Two questions I suspect someone will ask very soon: Can you make this with all-natural peanut butter and can you make this with almond or a nut butter? The answer to both is yes, however, the authors themselves warn that you’ll get the best final shape and texture from a smooth, thick processed peanut butter like Skippy (their recommendation; updated to note, thanks to a commenter suggestion, that the 16.3-ounce jar of Skippy is estimated to contain 1 3/4 cups, saving you some measuring). I suspect an almond or cashew butter will have a similar effect as natural peanut butter."
  ],
  "ingredients": [
    "0",
    "Post navigation",
    "Previous post: the broccoli roast Next post: baked potatoes with wild mushroom ragù",
    "RECIPES",
    "salted peanut butter cookies",
    "OCTOBER 15, 2015 JUMP TO COMMENTS",
    "I have never been particularly interested in recipes — or, if we’re being completely tactlessly honest, people — defined by what they are not, which is probably why you don’t see a lot of recipes with flour/dairy/gluten/meat/sugar-free, no-bake, one-bowl, hand-whisked or the like in recipe titles here, although we have plenty of all of the above. My favorite foods in this category are accidentally what they are; it’s a perk, but not the purpose. I’d rather talk about what a recipe does have, like flavor, or texture or an appeal that makes it almost painful not to make it in the minutes after you read about it.",
    "But I am not immune to the charms of ingredient absences. Many years ago, I assembled some easy after-school snack recipes for a magazine — something I couldn’t have been less of an expert on then, pre-kids, or, frankly, now (an apple and a cookie, maybe?) — and it gave me a chance to audition a three-ingredient peanut butter cookie a friend had told me about that was curiously absent in flour, butter, baking powder or baking soda and even salt. The results were, I mean, okay. It was peanut butter and sugar, it couldn’t possibly not be delicious. But they weren’t exceptional; they merely fit the bill.",
    "So, when the Ovenly Bakery’s cookbook came out last year and a reader emailed insisting I pick it up (I did) and I saw a peanut butter cookie that was similar, I dismissed it as probably not worth it. And then, as these things happen, while walking past a coffee shop on Sunday, I abruptly decided my husband and I needed a re-up, and while in there even more abruptly decided we had to split the last peanut butter cookie at the shop before someone else got to it. It was spectacular: tall, dome-shaped with a crisp exterior and decadently tender center, absolutely intense with peanut butter in a way that invokes peanut butter cups, and topped not with the usual wan flakes of sea salt but tiny coarse boulders. When I realized that it was in fact the Ovenly cookie, it was clear that they knew a few things about this three-ingredient cookie that I did not.",
    "First, they use slightly less sugar and peanut butter per egg, rather than the classic 1 cup, 1 cup, 1 egg ratio. They use light brown sugar instead of granulated white sugar, which I suspect leads to the softer cookie and more dynamic flavor. Finally, it’s scooped tall and chilled before baking so it keeps its height. The result is perfect, and absolutely nothing like the ones I made years ago, in all the best ways.",
    "Meanwhile, the list of absences in the recipe are notably long. There’s no butter, no flour or leaveners; the whole thing is whisked by hand in one bowl and has all of five ingredients, two of which are vanilla and salt. And yet if the recipe dictated that I had to render lard, then roast and blend my own peanuts while standing on my head and singing in tune to make them, I’d probably consider it. They’re that good.",
    "One year ago: Carrot Cake with Cider and Olive Oil",
    "Two years ago: Lazy Pizza Dough + Favorite Margherita Pizza",
    "Three years ago: Pancetta White Bean and Swiss Chard Pot Pies",
    "Four years ago: Apple Pie Cookies",
    "Five years ago: Apple and Cheddar Scones",
    "Six years ago: Apple Cider Doughnuts",
    "Seven years ago: Twice-Baked Shortbread and Acorn Squash Quesadillas with Tomatillo Salsa",
    "Eight years ago: Pumpkin Bread Pudding",
    "Nine years ago: Wild Mushroom and Stilton Galette",
    "And for the other side of the world:",
    "Six Months Ago: Artichoke Gratin Toasts",
    "1.5 Years Ago: Baked Eggs with Spinach and Mushrooms",
    "2.5 Years Ago: Bee Sting Cake",
    "3.5 Years Ago: Pasta with Garlicky Broccoli Rabe",
    "4.5 Years Ago: Heavenly Chocolate Cake Roll",
    "Salted Peanut Butter Cookies",
    "Barely adapted, just a bunch of extra notes, from the Ovenly cookbook",
    "Yield 26 to 28 cookies with a 1 2/3 tablespoon or #40 scoop. (I halved the recipe and regret it so much.)",
    "1 3/4 cups (335 grams) packed light brown sugar",
    "2 large eggs, at room temperature",
    "1/2 teaspoon vanilla extract",
    "1 3/4 cups (450 grams) smooth peanut butter (see note at end)",
    "Coarse-grained sea salt, to finish"
  ],
  "__v": 1
}