{
  "hash": "92b8ab5cd9fbf6c25ccc750d205eb7650963f3f3",
  "title": "One Pot Curried Spaghetti with Kale (30-minute recipe)",
  "image": "https://holycowvegan.net/wp-content/uploads/2017/07/one-pot-curried-spaghetti-5.jpg",
  "href": "https://holycowvegan.net/one-pot-curried-spaghetti-kale/",
  "extension": "Chrome",
  "firstAdded": "2017-08-06T17:44:26.584000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "nstructions",
    "Heat the oil in a large saucepan. Add the garlic and red pepper flakes and let the garlic cook until it starts to turn blonde.",
    "Add the garam masala and turmeric. Stir well, then add the tomato paste and cook, stirring, until the paste starts to slightly darken, about 2-3 minutes. Add the kale and saute for a couple of minutes.",
    "Add the pasta and stir well to mix. Add 5 cups of water and salt and ground black pepper to taste.",
    "Bring the pasta to a boil over medium heat, then cover with a lid and let the pasta cook 8 minutes. After 8 minutes, take the lid off, give the pasta a good stir, and let it continue to cook another 2-4 minutes until the pasta is cooked al dente. The mix will still look a little soupy, but it will thicken upon standing.",
    "Stir in the coconut milk. Check seasoning. Serve hot. This pasta is best eaten just after cooking because that's when it will be creamiest, but if you need to reheat later, pop it into the microwave until warm, and then stir with a fork."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "12 oz dry spaghetti, broken into 1-inch pieces",
    "1 tsp olive oil or coconut oil",
    "3 large cloves garlic, finely minced",
    "1 tsp red pepper flakes",
    "1/2 tsp turmeric",
    "1 heaping tbsp garam masala (curry powder will do at a pinch)",
    "2 tbsp tomato paste",
    "18-20 leaves kale, tough stems trimmed, then finely shredded. I used lacinato, but curly kale or purple kale would be fine too. So would baby kale.",
    "1/2 cup canned coconut milk (stir the can after opening with a spoon so you don't just get the thick or thin part)",
    "Salt and ground black pepper to taste"
  ],
  "__v": 1
}