{
  "hash": "caeb958cb309403a824990befa247f04a1fb3396",
  "title": "Show-Stopping Crusted Cauliflower Casserole",
  "image": "http://s7w2p1.scene7.com/is/image/ExactTarget/ugc/432752503.tif?hei=340",
  "href": "http://www.cooking.com/recipes-and-more/recipes/show-stopping-crusted-cauliflower-casserole-recipe?CCAID=cknwrdne04942at",
  "firstAdded": "2014-12-19T20:10:18.653000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "hot",
    "italian",
    "sausage",
    "casings",
    "yellow",
    "onion",
    "stalks",
    "celery",
    "cream",
    "head",
    "cauliflower",
    "florets",
    "sage",
    "parmesan",
    "pecorino",
    "cheese",
    "premade",
    "pie",
    "dough",
    "egg",
    "lightly"
  ],
  "directions": [
    "0",
    "directions",
    "Preheat oven to 400 degrees F.",
    "Heat olive oil in an 8-inch skillet over medium-high heat. Add sausage to the pan. Mash the sausage down with the back of a spoon to break it into small clumps. Cook until the sausage is browned on all sides, then remove it from the skillet.",
    "Add the onion and celery to the same pan and cook, stirring frequently until the onion is softened and lightly browned. Pour in cream and bring to a simmer. Once simmering, add in cauliflower and stir to coat with cream.",
    "Add the sausage back to the pan along with sage and stir together until everything is evenly coated with cream. The cauliflower will still be raw, but coated in warm cream.",
    "Remove the pan from heat. Sprinkle the Parmesan evenly over the cauliflower and sausage mixture.",
    "Gently place the round dough on top of the mixture within the interior of the pan, not hanging over the edges. Tuck any excess dough under itself. It will not be perfectly smooth, as the cauliflower is still hard enough to poke through in spots.",
    "Cut a couple of 2-inch vent slits in the top of the dough (this is your chance to be artistic!).",
    "In a small bowl, mix egg with 1 tablespoon water to create an egg wash. Brush egg wash onto dough.",
    "Bake at 400 degrees F for 30-40 minutes, or until crust is golden brown and filling is bubbling.",
    "Allow to cool for 5 minutes before serving. Serve warm."
  ],
  "ingredients": [
    "0",
    "ingredients",
    "2 tablespoons olive oil",
    "8 ounces hot Italian sausage, casings removed",
    "1 small yellow onion, sliced",
    "2 stalks celery, sliced",
    "3/4 cup cream",
    "1 head cauliflower (about 5 cups), cut into florets",
    "1 tablespoon sage, chopped",
    "1 cup grated Parmesan or pecorino cheese",
    "1 (8-inch) premade pie dough",
    "1 egg, lightly beaten"
  ],
  "__v": 1
}