{
  "hash": "0051abc2c66c3208a9afe3a72d84fec632a7322d",
  "title": "Crispy Peking Duck in Pancakeswith Beautiful Homemade Plum Sauce",
  "image": "http://recipe-folder.com/img/recipe-images/008/186/3441278108.jpg",
  "href": "http://www.jamieoliver.com/recipes/duck-recipes/crispy-peking-duck-in-pancakes/",
  "extension": "Chrome",
  "firstAdded": "2015-12-09T16:16:17.174000",
  "users": [
    null
  ],
  "keywords": [
    "duck",
    "salt",
    "fivespice",
    "ginger",
    "destoned",
    "plums",
    "sugar",
    "pinches",
    "soy",
    "chilli",
    "orange",
    "zest",
    "cucumber",
    "bunch",
    "spring",
    "onions",
    "packs",
    "premade",
    "pancakes"
  ],
  "directions": [
    "0",
    "Method",
    "Peking duck is something that has always been very close to the Oliver family. Bizarrely enough, the fact that my parents ran a pub restaurant meant that we very rarely went out for dinner as a family, but when we did, my old man used to take us out to this Chinese restaurant in Sawbridgeworth where we all fell in love with Peking duck.",
    "There are hundreds of ways of cooking duck in Asian cultures – steamed, roasted, pumped up with bicycle pumps to remove the meat from the skin – but we're at home and so we can't do with all this mucking about. My way is simple and it works...",
    "Preheat the oven to 170ºC/325ºF/gas 3. Rub a nice 1.2kg duck with loads of salt, inside and out. Dust the bird all over with five-spice and, if you've got any, grate some fresh ginger and rub it round the cavity, leaving the ginger inside to flavour. Place the duck in a roasting tray and put it in the oven. All you need to do is check on it every so often and spoon away the excess fat that has rendered out of the duck. This will make the skin go wonderfully crispy. Generally, after a couple of hours it will be perfect – the leg meat will pull off the bone and the skin will be wonderfully crisp. You don't always need to, but I sometimes turn the heat up to 200ºC/400ºF/gas 6 for a short while until it's really crispy.",
    "While this beautiful bird is cooking, you can make your plum sauce. Chuck 10 or 12 destoned plums into a pan with 5 tablespoons of sugar, a couple of pinches of five-spice, a couple of tablespoons of soy sauce, half a teaspoon of chilli powder and a splash of water. Bring to the boil, then simmer until you get a nice shiny pulp. You can remove the plum skins if you want to, but I usually leave them in. Sometimes I add a little grated orange zest, as this goes well with duck. Put the sauce to one side to cool before serving it, and taste to check the seasoning.",
    "As for the spring onions and cucumber, that's straightforward. Use half a cucumber and a bunch of spring onions and finely slice them. I strongly advise buying a couple of packs of pre-made pancakes which you can place in a steamer or microwave and slowly steam until nice and hot. The bamboo steamers are only a few quid from Chinese supermarkets, so it's worth getting hold of some and they're great to serve at the table.",
    "Once the duck has cooled a little bit, use two forks to shred all the meat off the carcass. I remember the Chinese lady at the restaurant in Sawbridgeworth doing this. You can do the same, putting all the meat with its crispy skin on to a serving plate. Take a pancake, place some duck, a bit of spring onion, a little cucumber and a dollop of plum sauce on to it, then roll it up – lovely."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1.2\tkg\tduck",
    "salt",
    "five-spice",
    "fresh ginger",
    "10-12\tdestoned plums",
    "5\ttablespoons\tsugar",
    "2\tpinches\tfive-spice",
    "2\ttablespoons\tsoy sauce",
    "½\tteaspoon\tchilli powder",
    "grated orange zest",
    "½\tcucumber",
    "1\tbunch\tspring onions",
    "2\tpacks\tpre-made pancakes"
  ],
  "__v": 1
}