{
  "hash": "82278148c1eea20ba492c8eb95bfc4b583b3fb20",
  "title": "Macadamia Nut Spreadable Pepper-Herb Feta [Vegan]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2014/09/Macadamia-Nut-Spreadable-Pepper-Herb-Feta-Vegan-1200x800.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/macadamia-nut-spreadable-pepper-herb-feta/",
  "extension": "Chrome",
  "firstAdded": "2015-06-06T05:00:58.592000",
  "users": [
    null
  ],
  "keywords": [
    "macadamia",
    "nuts",
    "soaked",
    "overnight",
    "rinsed",
    "water",
    "lemon",
    "juice",
    "clove",
    "garlic",
    "nutritional",
    "yeast",
    "white",
    "miso",
    "citric",
    "acid",
    "salt",
    "oregano",
    "thyme",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "Line a one cup rectangular container (glass preferably; I use one of my food storage containers) with cheesecloth. You want to cut the cloth so that you have about a 2-inch excess around all sides. (You will be folding the cloth over the cheese.) Set aside.",
    "In a small bowl, combine the dried herbs and black pepper. Set aside.",
    "Put the macadamia nuts through the sea salt in a high-speed blender and process until smooth. This will take a few minutes as you will need to tamp down the mixture and/or stir occasionally. You want the mixture to be fairy thick and dry, but you can add small amounts of additional water if needed.",
    "When smooth spoon out about half of the cheese and place it in the prepared container. Press the cheese down evenly and make sure it reaches into the corners.",
    "Sprinkle on the dried herbs/pepper mixture.",
    "Scoop out the remaining cheese mixture and gently spread it over top of the dried herbs/pepper. Again, make sure the cheese reaches into the corners. Smooth down the top, tap the container on the counter a few times, and fold over the cheesecloth so that it fully covers the cheese. If it fits, put the container’s cover on and place in the refrigerator. If it doesn’t, place something heavy on top of the cheese (i.e., a glass filled with water, etc.) and place in the refrigerator.",
    "Let the cheese “rest” for 24 hours before removing from the container."
  ],
  "ingredients": [
    "0",
    "1 cup macadamia nuts, soaked overnight, rinsed and drained",
    "1/2 cup water",
    "2 Tbsp. fresh lemon juice",
    "1 clove garlic",
    "1 tsp. nutritional yeast",
    "1 tsp. white miso paste",
    "1/4 tsp. citric acid",
    "1/4 tsp. sea salt",
    "1/2 tsp. dried oregano",
    "1/2 tsp. dried thyme",
    "1/4 tsp. ground black pepper"
  ],
  "__v": 1
}