{
  "hash": "93c28c4f4b937f290730775c4af60c2384658ce7",
  "title": "Pressurecookerized Stony Lonesome Pinot Noir Beef StewChili Pressurecookerized!",
  "image": "",
  "href": "http://www.hippressurecooking.com/forums/topic/can-you-make-my-crockpot-stew-taste-just-as-good-in-the-pressure-cooker/",
  "firstAdded": "2015-01-10T19:20:41.369000",
  "users": [
    null
  ],
  "keywords": [
    "venisonn",
    "elk",
    "cubed",
    "olive",
    "canola",
    "oil",
    "medium",
    "onion",
    "carrots",
    "ribs",
    "celery",
    "clove",
    "garlic",
    "salt",
    "dry",
    "red",
    "wine",
    "pinot",
    "noir",
    "cabernet",
    "sauvignon",
    "beef",
    "broth",
    "potatoes",
    "dice",
    "rosemary",
    "crumbled",
    "tbs",
    "flour",
    "butter",
    "kidney",
    "beans",
    "soaked",
    "quicksoaked",
    "onions",
    "stalk",
    "green",
    "pepper",
    "lean",
    "bitter",
    "cocoa",
    "tomato",
    "chili",
    "nutmeg",
    "cinnamon",
    "bay",
    "leaf",
    "black",
    "mustard",
    "ginger",
    "allspice",
    "beer",
    "hot"
  ],
  "directions": [
    "0",
    "Trim stew beef and cut into bite sized pieces (do not coat in flour).",
    "In the pre-heated pressure cooker, without the lid at high heat, add",
    "the oil, and brown the meat until golden on all sides. Remove, and set",
    "aside.",
    "Add the onions, carrots, celery, garlic, onion powder and seasoned",
    "salt and sautee’ until the onions begin to soften (about 3-5",
    "minutes).",
    "Now, deglaze the aromatics with the wine and let it almost completely",
    "evaporate (don’t worry, you are concentrating the flavor and removing",
    "the liquid).",
    "Add the meat, and beef broth. Stir everything together and add the",
    "potatoes on top (do not stir anymore) and sprinkle or rosemary.",
    "Pressure Cook on HIGH 20-25 minutes, with natural open (if the",
    "pressure has not come down by itself in 10 minutes, you can release",
    "the remaining pressure using the Normal open).",
    "In the meantime, in a small pan, melt the butter and stir in the flour.",
    "You will get a thick paste, continue cooking it until it turns from white",
    "to a light tan. Set aside and wait for pressure cooking to finish.",
    "When the cooking time has completed, open the pressure cooker, add",
    "the butter mixture stir and simmer everything together for 5 minutes",
    "before serving.",
    "1",
    "In the pre-heated pressure cooker, without the lid, sauté the onion, celery and pepper until the onion has begun to soften. Shove the vegetables aside and brown all of the meat stirring infrequently until the water from it has evaporated and it begins to brown (about 5-10 minutes).",
    "Add the cocoa powder, tomato paste, garlic, chili powder, nutmeg and cinnamon, bay leaf, pepper, and pinches of other spices. Mix well and saute’ together for another minute before adding the beans and beer. Mix well.",
    "Close and lock the lid. Pressure cook for 10 minutes at high pressure. When time is up, open the cooker with natural release (10-20 minutes)– remove the cooker from the burner and do not touch. For electric pressure cookers disable the weep warm cycle and un-plug the cooker.",
    "Open the cooker and stir-in the salt and hot pepper sauce. Let stand for 5 minutes before serving."
  ],
  "ingredients": [
    "0",
    "1-1/2lb Venisonn or Elk, cubed",
    "1 T olive or canola oil",
    "1 medium onion, diced",
    "1-2 medium carrots, sliced",
    "2 ribs celery sliced",
    "1 clove garlic, minced",
    "1 t onion powder",
    "1 t seasoned salt",
    "1 c dry red wine (pinot noir or cabernet sauvignon)",
    "1 c beef broth",
    "3 or 4 Potatoes, large 1″ dice",
    "½ t fresh chopped rosemary or a dash crumbled dry",
    "8 Tbs or ½ c flour",
    "1 Tbsp Butter",
    "1",
    "2 cups dry kidney beans, soaked or quick-soaked",
    "1 T oil",
    "2 medium onions, chopped",
    "1 large stalk celery chopped",
    "½ green pepper chopped",
    "1 lb lean ground beef",
    "2 tablespoons bitter cocoa powder",
    "2 tablespoons tomato paste",
    "2 cloves garlic minced",
    "1 T chili powder",
    "⅛ t nutmeg and cinnamon",
    "1 bay leaf",
    "½ t black pepper",
    "a pinch of each: dry mustard, ginger, cloves and allspice",
    "2 cups beer",
    "½ t hot pepper sauce",
    "1 t salt"
  ],
  "__v": 1
}