{
  "hash": "5ed92ce192ef441d0cafa2a42724c7f59a4bbfa4",
  "title": "Tomato Chutney",
  "image": "https://d1c8xu194km6ge.cloudfront.net/assets/332386/Black_Bean_Quinoa_Burgers-36_HD1280.jpg",
  "href": "https://rouxbe.com/recipes/5557",
  "extension": "Chrome",
  "firstAdded": "2018-02-18T10:29:41.046000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Step 1: Preparing Your Mise en Place",
    "*Note: This chutney is best when make with juicy ripe tomatoes; however, if that is not an option, canned tomatoes can be used instead.",
    "To prepare the fresh tomatoes, peel, seed and dice them — otherwise known as Tomato Concassé.",
    "Lastly, gather and prepare the rest of your mise en place.",
    "**Note: If using another sweetener other than stevia, you may need to add more to achieve the right balance of sweet and sour.",
    "Step 2: Cooking & Finishing the Chutney",
    "To cook the chutney, dry-sauté the onions for approximately minutes, or until they are soft and translucent.",
    "Next add the garlic and cook for 30 seconds or so. Then add the rice wine vinegar, tomatoes, stevia and mustard.",
    "Bring the mixture up to a gentle simmer and then reduce the heat, cover the pan and let cook for 45 minutes to 1 hour (or more). Ultimately, the time will vary depending on things like how watery the tomatoes were to begin with. Stir the chutney from time to time, to ensure it does not scorch. The chutney is done when almost all of the liquid has evaporated from the tomatoes. The consistency should be that of a rather thick jam.",
    "Once done, remove from the heat and let cool before adding the fresh basil. Note: if canned tomatoes were used, you may want to use a potato masher to break up any bigger pieces of tomato.",
    "Lastly, stir in the basil and refrigerate for a few hours or overnight. Serve this chutney as a cold-sauce or as a condiment with any number of dishes. This chutney pairs very well with these Mushroom Black Bean-Qunioa Burgers."
  ],
  "ingredients": [
    "0",
    "3 large ripe tomatoes*",
    "1 onion, finely minced",
    "3 cloves garlic, minced",
    "1 tbsp stone ground mustard (grainy)",
    "Seasoning, to taste",
    "1/2 tsp stevia powder (or sweetener of choice)**",
    "1/2 cup rice wine vinegar",
    "1/4 cup freshly chopped basil"
  ],
  "__v": 3
}