{
  "hash": "1d6d0ede86596ea9f8496ace8d3cb908063134c6",
  "title": "Creamy Mushroom and Spinach Orzo (Risoni) (One Pot)",
  "image": "http://cdn2.recipetineats.com/wp-content/uploads/2015/05/Spinach-Parmesan-Creamy-Risoni-3-Servings.jpg",
  "href": "http://www.recipetineats.com/creamy-mushroom-and-spinach-orzo-risoni-one-pot/",
  "extension": "Chrome",
  "firstAdded": "2016-04-05T20:46:43.878000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "used",
    "button",
    "mushrooms",
    "butter",
    "garlic",
    "onion",
    "flour",
    "milk",
    "low",
    "fat",
    "chicken",
    "broth",
    "orzo",
    "risoni",
    "salt",
    "black",
    "pepper",
    "parmesan",
    "cheese",
    "frozen",
    "spinach",
    "box",
    "thawed",
    "excess",
    "water",
    "squeezed",
    "extra",
    "parsley"
  ],
  "directions": [
    "0",
    "Heat the olive oil in a large non stick pan over high heat (if you aren't using non stick, use more oil).",
    "Add the mushrooms and cook until softened (around 3 minutes). Remove from the pan and set aside.",
    "Lower the heat to medium and melt the butter in the pan. Add garlic and onion, and sauté until the onion becomes translucent - around 3 minutes.",
    "Add the flour, stir it in and cook for 1 minute.",
    "Add the milk and chicken broth and use a whisk to mix the butter flour mixture into the liquid.",
    "Increase heat to medium high. Add the orzo/risoni, salt and pepper, stir once, then put a lid on (Note 2). Bring it to a simmer, then leave it to cook for around 8 to 10 minutes or until the orzo/risoni is cooked but still slightly firm, and it is still quite saucy. Note: If you have a strong stove, turn it down slightly so it just simmers).",
    "While the orzo is cooking, break up the spinach into little pieces with your fingers.",
    "Remove the pan from the stove. Stir through the parmesan, spinach and cooked mushrooms. Check if more salt or pepper is required.",
    "Serve immediately, garnished with more parmesan and fresh finely chopped parsley, if desired."
  ],
  "ingredients": [
    "0",
    "1 tbsp olive oil",
    "1.2 lb / 600g mushrooms, sliced (I used button mushrooms)",
    "1",
    "3 tbsp butter",
    "3 garlic cloves, minced",
    "1 small onion, finely diced",
    "3 tbsp flour",
    "1½ cups milk (I used low fat)",
    "3 cups chicken broth",
    "1½ cups orzo / risoni (Note 1)",
    "½ tsp salt",
    "Black pepper",
    "¾ cup parmesan cheese, grated",
    "8oz / 250g frozen spinach (1 box), thawed, excess water squeezed out",
    "2",
    "Extra parmesan cheese",
    "Finely chopped parsley"
  ],
  "__v": 1
}