{
  "hash": "b3ecf8829d18fde246ee94849e2c787c171e2605",
  "title": "Cheesy Breakfast Bake\nACTIVE TIME\n15m\nTOTAL TIME\n1h 15m",
  "image": "http://s7w2p1.scene7.com/is/image/ExactTarget/ugc/268991871.tif",
  "href": "http://www.cooking.com/recipes-and-more/recipes/cheesy-breakfast-bake-recipe?CCAID=cknwrdne04947at",
  "firstAdded": "2014-12-19T20:15:37.487000",
  "users": [
    null
  ],
  "keywords": [
    "spray",
    "olive",
    "oil",
    "turkey",
    "breakfast",
    "sausage",
    "casings",
    "bought",
    "bulk",
    "eggs",
    "milk",
    "green",
    "onions",
    "loaf",
    "sourdough",
    "bread",
    "cubes",
    "sharp",
    "cheddar",
    "cheese",
    "kosher",
    "salt",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "directions",
    "Spray a 13 x 9 baking dish with nonstick spray.",
    "Heat the olive oil in a large nonstick skillet over medium-high heat. Add sausage and cook, stirring and breaking up the sausage with the back of a wooden spoon, until browned and crumbly, about 6 minutes. Let cool.",
    "In a medium bowl, whisk together the eggs, milk, green onions and a big pinch of salt and pepper until blended. Spread half of the cubed bread out in an even layer in the baking dish, add the cooled sausage on top and sprinkle with half of the cheese. Top with remaining bread and cheese, then pour the egg mixture over the top of the casserole. Press down on the bread with your hands to make it’s soaking up the egg mixture. Cover with plastic wrap, place a plate on top, and refrigerate for at least 2 hours, or if time allows, overnight.",
    "Heat oven to 350 degrees F.",
    "Remove the plastic wrap from the casserole and sprinkle with the remaining cheese. Bake for 1 hour, until puffed and golden. Garnish with additional green onions, if desired.",
    "Tip: We recommend soaking the casserole overnight before baking so the bread will be saturated with the eggs and milk. After baking you’re left with a delicious creamy savory bread pudding like texture."
  ],
  "ingredients": [
    "0",
    "ingredients",
    "Nonstick spray",
    "1 teaspoon olive oil",
    "12 ounces turkey breakfast sausage, casings removed or bought in bulk",
    "7 large eggs",
    "2 3/4 cups whole milk",
    "4 green onions, thinly sliced, plus more for garnish",
    "One 14.5-ounce loaf sourdough bread, cut into 1-inch cubes",
    "2 cups grated sharp cheddar cheese (8 ounces)",
    "Kosher salt and freshly ground black pepper"
  ],
  "__v": 1
}