{
  "hash": "b7890fc526b6015ff1cf7988fe32d5e18c23c61c",
  "title": "Lemon Meringue Pie",
  "image": "http://seitanbeatsyourmeat.com/wp-content/uploads/2015/03/vegan-lemon-meringue-pie.jpg",
  "href": "http://seitanbeatsyourmeat.com/pi-day-vegan-lemon-meringue-pie/",
  "extension": "Chrome",
  "firstAdded": "2015-06-22T11:52:51.420000",
  "users": [
    null
  ],
  "keywords": [
    "crust",
    "flour",
    "baking",
    "salt",
    "coconut",
    "oil",
    "sugar",
    "cold",
    "water",
    "apple",
    "cider",
    "vinegar",
    "vodka",
    "lemon",
    "filling",
    "cornstarch",
    "agar",
    "nondairy",
    "milk",
    "juice",
    "lemons",
    "zest",
    "meringue",
    "chickpeas",
    "cream",
    "tartar",
    "vanilla",
    "grind",
    "food",
    "processor",
    "granulated"
  ],
  "directions": [
    "0",
    "For the crust: Preheat oven to 350°F. Place flour, baking powder, and salt into a large bowl and cut in oil until dough resembles pebbles. Add water/vinegar and vodka and mix until completely incorporated. Roll out the dough on a floured surface and transfer to a greased pie tin. Crimp the edges (this is a good resource for pie crust). Poke holes in the bottom of the pan with a fork. Bake for 25 minutes or until just starting to turn golden. The pie will be baked again after the meringue step. Let cool.",
    "For the lemon filling: Combine all ingredients in a medium-sized saucepan over medium-high heat. Bring the mixture to a boil and whisk constantly for 5 minutes until the filling is the consistency of pudding. Pour into the baked pie crust.",
    "For the meringue: Pour the liquid from the can of chickpeas into the bowl of a stand mixer (or use electric hand mixers…but you don’t want to do this by hand!). Add the cream of tartar. Whip the bean juice with the whisk attachment until it starts to thicken. Gradually add the sugar and vanilla and continue whipping. This process took me 7-8 minutes, but I’ve read that it can take up to 15 or 20 minutes.",
    "You’ll want to keep it going on high speed until the mixture is the consistency of thick whipped cream. If it’s gloopy, your meringue will deflate. A spoonful of meringue at the proper consistency will not drip if you hold it upside down.",
    "I took a start-to-finish video of the meringue-making process: it goes from liquid to foam to clouds!",
    "To assemble: Preheat oven to 200°F. Pipe dollops of meringue on top of the pie. Bake for 2 1/2-3 hours or until the meringue is toasted. The baking time will depend on the amount of meringue on your pie, and how it’s piped on. Thick layers will take longer to bake. Remove from the oven and let cool completely, letting the meringue set.",
    "To make meringue cookies out of leftover meringue, dollop meringue onto a parchment-lined baking sheet and bake at 200°F for 2 hours. Turn off the oven and let dry with the oven door cracked for a couple of hours."
  ],
  "ingredients": [
    "0",
    "Crust:",
    "2 cups flour",
    "¾ teaspoon baking powder",
    "¼ teaspoon salt",
    "⅓ cup coconut oil",
    "2 tablespoons sugar",
    "⅓ cup cold water plus 1 teaspoon apple cider vinegar",
    "2 tablespoons vodka",
    "Lemon Filling:",
    "1 1/4 cups sugar",
    "1/2 cup cornstarch",
    "1/4 teaspoon agar powder",
    "1/4 teaspoon salt",
    "1 1/4 cups non-dairy milk",
    "1 cup water",
    "3/4 cup lemon juice (3-4 lemons)",
    "1 1/2 tablespoons lemon zest (1-2 lemons)",
    "Meringue:",
    "1 15 ounce can chickpeas",
    "1/4 teaspoon cream of tartar",
    "3/4 cup plus 2 tablespoons finely ground sugar*",
    "3/4 teaspoon vanilla",
    "*Grind granulated sugar in a food processor so it’s somewhere between granulated and powdered sugar."
  ],
  "__v": 1
}