{
  "hash": "8c832d7a9f3c29b2851298c362c5c14a61e0916f",
  "title": "Pinto Beans And Ham",
  "image": "http://www.thegratefulgirlcooks.com/wp-content/uploads/2014/12/Pinto-Beans-And-Ham-300x200.jpg",
  "href": "http://www.thegratefulgirlcooks.com/pinto-beans-and-ham/",
  "extension": "",
  "firstAdded": "2016-01-28T16:19:32.833000",
  "users": [
    null
  ],
  "keywords": [
    "pinto",
    "beans",
    "regular",
    "sized",
    "leftover",
    "bone",
    "meat",
    "attached",
    "ham",
    "medium",
    "brown",
    "onion",
    "heaping",
    "garlic",
    "cumin",
    "salt",
    "black",
    "pepper",
    "water",
    "saltpepper",
    "usually"
  ],
  "directions": [
    "0",
    "Rinse the pinto beans in a strainer. Place beans into a large stockpot. Cover completely with water.",
    "Add ham bone (or chopped ham). Add additional water, if necessary to more than cover the beans and ham.",
    "Add onion, garlic, salt, pepper, and cumin.",
    "Bring water to a boil. Reduce heat to medium-low heat. Let beans cook for approximately 4 hours. For first half of cooking time, keep a lid on the beans, but with lid vented. After about 2 hours, remove the lid and continue cooking, uncovered for remainder of time. As water level begins to reduce, add a bit more water back into the pot so that beans remain submerged during cooking time.",
    "Check beans to make sure they are fully softened. Remove ham bone from pot; remove any ham meat from bone and add the ham back into the pot.",
    "Taste test the beans when fully cooked. Mixture will thicken slightly as the amount of water reduces through the long cooking time. Season with additional salt and pepper, to taste.",
    "Serve hot with some cornbread or tortillas on the side, and enjoy!"
  ],
  "ingredients": [
    "0",
    "1 bag pinto beans (regular sized - about 2-3 cups)",
    "1 large leftover ham bone (with meat attached), OR 2 cups chopped cooked ham",
    "1 medium brown onion, chopped",
    "1 heaping Tablespoon minced garlic",
    "¼ teaspoon cumin",
    "1 teaspoon salt",
    "1 teaspoon black pepper",
    "Water",
    "Additional Salt/Pepper, to taste (I usually have to add more before serving)"
  ],
  "__v": 1
}