{
  "hash": "d64aba0e91e505b844af7c096e59cc331f6f7532",
  "title": "Broccoli Stir Fry with Ginger and Sesame",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2007/10/broccoli-stir-fry-ginger-horiz-a2-1600.jpg",
  "href": "https://www.simplyrecipes.com/recipes/broccoli_stir_fry_with_ginger_and_sesame/",
  "extension": "",
  "firstAdded": "2018-01-28T01:03:31.669000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Toast the sesame seeds: Toast the sesame seeds by first heating a small, stick-free sauté pan on medium high heat. Add the sesame seeds and jiggle the pan so they spread out in a single layer.",
    "Let them cook until lightly browned, stirring occasionally, about 2-3 minutes. Do not walk away from them while cooking, as once they start to brown they can easily burn. Once lightly toasted remove from heat and put into a small bowl.",
    "2 Mix stock, soy sauce, sesame oil: Mix the stock, soy sauce, and dark sesame oil together in a small bowl, set aside.",
    "3 Sauté the broccoli, garlic, ginger: Heat 1 Tbsp of peanut oil (or canola or other high smoke point oil) in a large, cover-able sauté pan on medium high heat. Add the broccoli florets, stir to coat the florets with the oil, Sauté for about a minute.",
    "Clear a space in the middle of the broccoli and add the ginger and garlic. Add a little more oil to the ginger and garlic (about a teaspoon) and sauté for half a minute, stirring just the garlic and ginger, until fragrant. Then stir the garlic and ginger in with the broccoli.",
    "4 Add the stock soy mixture and simmer: Add the stock soy sesame oil mixture to the pan. Bring to a simmer, reduce the heat and cover. Let cook for 2-3 minutes, until broccoli is still firm, but can be pierced with a fork. Remove from heat.",
    "Remove broccoli with a slotted spoon to a bowl. Return pan to heat, increase heat to high and boil down the liquid until just a couple tablespoons remain.",
    "Turn off heat, return broccoli to the pan, add the toasted sesame seeds, toss with the liquid. Put into a serving bowl."
  ],
  "ingredients": [
    "0",
    "1 Tbsp sesame seeds",
    "1/2 cup chicken or vegetable stock (use vegetable stock for vegan option)",
    "1 Tbsp soy sauce (use gluten-free soy sauce for gluten-free option)",
    "1 Tbsp dark sesame oil",
    "Peanut, canola, or grapeseed oil, or some other high smoke-point cooking oil",
    "1 pound broccoli florets, rinsed, patted dry, cut into bite-sized pieces",
    "2 cloves of garlic, minced (about 1 Tbsp)",
    "1 Tbsp minced fresh ginger"
  ],
  "__v": 1
}