{
  "hash": "08ec23c3cb06e79fc0a8e25e655349b2a91f4c30",
  "title": "Kremowe risotto z kurkami - przepis Jamie'go Oliviera",
  "image": "//static.smaker.pl/photos//a/d/3/ad30fde5d72910c6838cfb0bcce1d394_110705_57ded5cce4510_wm.jpg",
  "href": "http://smaker.pl/przepis-kremowe-risotto-z-kurkami-przepis-jamie-go-oliviera,120261,agnieszkacrow.html",
  "extension": "",
  "firstAdded": "2016-09-21T14:49:35.224000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Suszone grzyby przesypujemy do wysokiego naczynia i zalewamy gorącym bulionem.",
    "Cebulę kroimy na drobną kosteczkę. Na patelni rozgrzewamy łyżkę oliwy z oliwek i wrzucamy cebulę. Podsmażamy, aż się delikatnie zeszkli. Następnie wsypujemy ryż i dokładnie mieszamy, żeby dokładnie oblepił się cebulką. Dolewamy wino i cały czas mieszamy, aż odparuje.",
    "Odcedzamy bulion z grzybów, grzyby przekładamy do miseczki.",
    "Gdy wino już wyparuje wlewamy po 1 chochelce bulionu. Cały czas mieszamy, aż bulion odparuje i czynność powtarzamy aż do skończenia bulionu.",
    "Gdy ryż będzie al dente dodajemy do niego odcedzone z bulionu grzyby, świeżo starty parmezan i łyżkę masła. Mieszamy i pozostawiamy na kilka minut, by powstała delikatna, kremowa konsystencja.",
    "Na patelni rozpuszczamy łyżkę masła i wrzucamy kurki (w całości). Przesmażamy je do miękkości, następnie odcedzamy z masła i delikatnie mieszamy z posiekaną natką pietruszki. Na koniec skrapiamy sokiem z cytryny.",
    "Na talerzu układamy ryż, na nim kurki z pietruszką, wierzch posypujemy startym parmezanem.",
    "Smacznego :)"
  ],
  "ingredients": [
    "0",
    "1 torebka ryżu arborio",
    "1,5 litra bulionu warzywnego",
    "garść suszonych prawdziwków",
    "2 garście świeżych kurek",
    "1,5 szklanki białego, wytrawnego wina",
    "1 większa cebula",
    "Natka pietruszki",
    "kilka kropel soku z cytryny",
    "2 łyżki masła",
    "2 łyżki świeżo startego parmezanu",
    "Oliwa z oliwek",
    "Sól"
  ],
  "__v": 1
}