{
  "hash": "c7873cf58c94ab4a5ac2d2ea33c0467beb87b466",
  "title": "The Best Zucchini Brownies You'll Ever Eat",
  "image": "https://www.ambitiouskitchen.com/wp-content/uploads/2018/08/Zucchini-Week-4-2.jpg",
  "href": "https://www.ambitiouskitchen.com/the-best-zucchini-brownies/",
  "extension": "Chrome",
  "firstAdded": "2019-06-13T20:05:55.001000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 degrees F. Line an 8x8 inch pan with parchment paper and spray with nonstick cooking spray.",
    "In a large bowl, add your shredded zucchini, making sure it is squeezed of all excess moisture with a paper towel. This is very important. SQUEEZE IT AND GET ALL THAT WATER OUT!",
    "Next add in egg, tahini, maple syrup, coconut sugar and vanilla; stir until smooth. Gently stir in cocoa powder into the batter, mixing until well incorporated. Next add in coconut flour, baking soda, salt and finally the melted coconut oil. Stir until well combined. Fold in chocolate chips (and walnuts if you are using).",
    "Pour into prepared pan. Bake for 30-35 minutes or until toothpick inserted into center comes out with just a few crumbs attached (it should not be completely wet, but a little gooeyness is just fine). Allow to cool completely. This will be tough, but it’s the best way to make sure the bars stay together perfectly since they will be moist.",
    "Once ready for the chocolate drizzle: Add 2 tablespoons chocolate chips and coconut oil to a small microwave safe bowl. Microwave in 30 second increments, stirring inbetween, until chocolate is melted. Drizzle over zucchini brownies. Sprinkle with a little fancy sea salt (trust me, it’s good!). Cut into 16 squares."
  ],
  "ingredients": [
    "0",
    "1 cup shredded zucchini that’s been squeezed of excess moisture",
    "1 large egg",
    "1/2 cup tahini*",
    "¼ cup pure maple syrup",
    "½ cup coconut sugar",
    "1 teaspoon vanilla extract",
    "½ cup high quality cocoa powder (or cacao powder)",
    "2 tablespoons coconut flour",
    "½ teaspoon baking soda",
    "½ teaspoon salt",
    "2 tablespoons melted and cooled coconut oil",
    "⅓ cup chocolate chips, dairy free if desired",
    "Optional: ½ cup chopped walnuts",
    "For the topping",
    "2 tablespoons chocolate chips, dairy free if desired",
    "1/2 teaspoon coconut oil",
    "Fancy sea salt, for sprinkling on top"
  ],
  "__v": 1
}