{
  "hash": "e4ac7f9f6ff7d5732b5ab2270d9197d41d8fb51f",
  "title": "Butternut Squash Pot Pie",
  "image": "http://ourfourforks.com/wp-content/uploads/2015/02/butternut-squash-pot-pie-vegan-glutenfree-final-ourfourforks-533x800.jpg",
  "href": "http://ourfourforks.com/butternut-squash-pot-pie/",
  "extension": "",
  "firstAdded": "2015-10-01T21:08:30.241000",
  "users": [
    null
  ],
  "keywords": [
    "cubed",
    "butternut",
    "squash",
    "roasted",
    "degrees",
    "fahrenheit",
    "minutes",
    "olive",
    "oil",
    "divided",
    "slices",
    "pieces",
    "vegan",
    "omit",
    "bacon",
    "skinless",
    "boneless",
    "chicken",
    "breasts",
    "thighs",
    "chickpeas",
    "salt",
    "black",
    "pepper",
    "leeks",
    "white",
    "palegreen",
    "parts",
    "rounds",
    "garlic",
    "bunch",
    "kale",
    "center",
    "ribs",
    "stems",
    "leaves",
    "sage",
    "sprigs",
    "thyme",
    "stripped",
    "cranberries",
    "prunes",
    "used",
    "gluten",
    "free",
    "allpurpose",
    "flour",
    "addition",
    "youll",
    "need",
    "pie",
    "crust",
    "recipe",
    "cornstarch",
    "lowsodium",
    "low",
    "sodium",
    "broth",
    "egg",
    "nondairy",
    "milk",
    "double",
    "substituting",
    "regular",
    "great",
    "flaky",
    "results",
    "savory",
    "omitting",
    "mushroom",
    "onion",
    "powders"
  ],
  "directions": [
    "0",
    "Place a rack in lower third of oven; preheat to 375°.",
    "1",
    "In a large skillet over medium-high heat, cook bacon, stirring often, until crisp, about 4 minutes. Transfer to a plate with a slotted spoon.",
    "Season chicken with salt and pepper, add 1 tablespoon of olive oil and cook in same skillet with the bacon grease until brown, about 3 minutes per side. Add a splash of water to skillet. Cover, reduce heat, and cook until chicken is cooked through, 10–12 minutes. Transfer to a plate.",
    "2",
    "Add 1 tablespoon (vegan: 2 tablespoons) of olive oil to skillet on medium heat and then add leeks, season with salt and pepper, and cook, stirring often, until softened, about 5 minutes. Add a splash of water and add garlic and chopped kale, cover, and cook until leeks are very soft, 5–7 minutes. Transfer to a large bowl.",
    "Shred chicken (vegan: add chickpeas) and add to leeks along with thyme leaves, chopped sage, cranberries, reserved bacon (vegan: omit) and reserved roasted butternut squash.",
    "Melt remaining 2 tablespoons of olive oil in a medium saucepan over medium-high heat. Whisk in ¼ cup flour and cook, whisking constantly, about 1 minute. Whisk in broth, adding a little at a time, until smooth. In a small bowl, mix cornstarch with 1 tablespoon of water and add to the saucepan. Simmer, stirring occasionally, until thickened, 5–7 minutes. Mix sauce into leek mixture; season with salt and pepper and let cool.",
    "If making 4 mini pot pies (see notes), divide the pie dough into 8 equal pieces. Roll out 1 ball of dough on a lightly floured surface into a circle. Transfer to a 3” mini pie tin and trim any access dough that may hang down. Repeat for remaining 3 mini pie tins.",
    "Spoon filling into each of the 4 pie tins (you may have extra filling) and then roll out remaining 4 balls of dough to cover each pie. Trim any excess flour and then use the back of a fork to crimp the edges of the bottom and top pie crust together around the circumference of each tin.",
    "Cut a few vents on top and brush with egg (vegan: brush with non-dairy milk).",
    "Bake until crust is golden brown, 50–60 minutes. Let pie cool slightly before serving."
  ],
  "ingredients": [
    "0",
    "1½ cups cubed butternut squash, peeled and roasted (400 degrees Fahrenheit for 20-25 minutes)",
    "4 tablespoons olive oil, divided",
    "3 slices bacon cut into ¼” pieces (vegan: omit bacon)",
    "1 pound skinless, boneless chicken breasts or thighs (vegan: 1 15 oz can of chickpeas, drained)",
    "salt and freshly ground black pepper",
    "3 leeks, white and pale-green parts only, thinly sliced into rounds",
    "4 garlic cloves, chopped",
    "1 small bunch kale, center ribs and stems removed, leaves chopped",
    "1 tablespoon fresh sage, chopped",
    "2 sprigs thyme, leaves stripped",
    "½ cup dried cranberries or dried prunes (I used a mix)",
    "¼ cup gluten free all-purpose flour (in addition to what you'll need for the pie crust recipe, below)",
    "1 teaspoon cornstarch",
    "2 cups low-sodium chicken broth (vegan: 2 cups low sodium vegetable broth)",
    "1 egg (vegan: 1 tablespoon non-dairy milk)",
    "1 double gluten free pie crust (I used this one substituting regular flour with gluten free all-purpose - great, flaky results. I used the savory version, omitting the mushroom, onion and garlic powders.)"
  ],
  "__v": 1
}