{
  "__v": 1,
  "directions": [
    "0",
    "Bring a large pot filled with 4 Quarts of water (measure) and 2 Tablespoons salt ( measure) to a boil. Measuring will ensure perfectly flavorful pasta.",
    "In a skillet, heat 1 T oil over medium high heat. Saute onion until tender. Add mushrooms, and turn heat down to medium. Saute until golden and tender. Add a pinch salt and pepper. Add wilting greens and sauté, stirring often until just wilted. Set Aside.",
    "Whisk two eggs in a small bowl. Set aside.",
    "When water comes to a boil, add pasta and stirring until pasta begins to boil. Turn heat down, but maintain the low boil, until pasta is cooked to al dente, about 7 minutes ( see directions on package). Using a 1 cup measuring cup, scoop out 1 cup of the hot pasta water and set aside. Add the fresh peas, sugar peas and asparagus tips to the boiling pasta, turn the heat up to high and boil one minute. Drain pasta and vegetables. Do not rinse. Return to the pot, turn heat off.",
    "With a fork, stir in 3 T of hot pasta water, one tablespoon at a time, gradually, to the eggs, to temper the eggs ( to warm them). Stir well.",
    "Pour egg/water mixture over the pasta and with a big wood spoon, gently stir to coat the pasta. Stir in ⅓ C fresh grated parmesan, cracked pepper and more pasta water as need to loosen the pasta. Place on a platter or bowl and sprinkle with mint, lemon zest and remaining parmesan. Dot with dollops of burrrata."
  ],
  "firstAdded": "2014-09-28T17:40:45.285000",
  "hash": "94150c0b8e816679f6ae2da2a8f37152c22422c5",
  "href": "http://www.feastingathome.com/2014/03/spring-orecchiette-pasta-with-burrata.html",
  "image": "http://1.bp.blogspot.com/-WZ1ZndkYmVw/UycUgRxCkyI/AAAAAAAANp0/jzgVuaXcB7A/s1600/spring+pasta-1015.jpg",
  "ingredients": [
    "0",
    "16 oz Orecchiette pasta",
    "4 Quarts water",
    "2 T kosher salt",
    "2 C fresh peas",
    "2 C sugar peas",
    "1 Cup Asparagus tips (optional)",
    "1 sweet onion- diced",
    "8 oz mushrooms sliced or quartered -cremini, shittaki, buttons or morrels",
    "2 C wilting greens- dandilion, arugula, chard, spinach",
    "1 T olive oil",
    "generous pinch salt",
    "cracked pepper",
    "2 Eggs",
    "½ C parmesan",
    "1 ball burrata cheese- optional",
    "lemon zest",
    "2 T fresh mint ribbons"
  ],
  "keywords": [
    "orecchiette",
    "pasta",
    "quarts",
    "water",
    "kosher",
    "salt",
    "peas",
    "sugar",
    "asparagus",
    "tips",
    "onion",
    "mushrooms",
    "cremini",
    "shittaki",
    "buttons",
    "morrels",
    "wilting",
    "greens",
    "dandilion",
    "arugula",
    "chard",
    "spinach",
    "olive",
    "oil",
    "generous",
    "cracked",
    "pepper",
    "eggs",
    "parmesan",
    "ball",
    "burrata",
    "cheese",
    "lemon",
    "zest",
    "mint",
    "ribbons"
  ],
  "title": "Spring Orecchiette Pasta with Burrata",
  "users": [
    null
  ]
}