{
  "hash": "bbf8a339738825b7147df9395dfe1a6922339770",
  "title": "Honey White Bread",
  "image": "http://img.sndimg.com/food/image/upload/w_614,h_461,c_fit/v1/img/submissions/recipe/0/ZjGKnwGR96ainWHAKv7Q_20150712_113038.jpg",
  "href": "http://www.food.com/recipe/honey-white-bread-523624",
  "extension": "Chrome",
  "firstAdded": "2015-10-06T03:14:52.008000",
  "users": [
    null
  ],
  "keywords": [
    "water",
    "boil",
    "electric",
    "kettle",
    "cool",
    "bit",
    "honey",
    "local",
    "raw",
    "active",
    "dry",
    "yeast",
    "use",
    "kind",
    "jar",
    "store",
    "frig",
    "salt",
    "bread",
    "flour"
  ],
  "directions": [
    "0",
    "5 Easy Steps:.",
    "1. In a large mixing bowl, whisk together warm water and honey until honey is dissolved. Add yeast, and cover with a towel.",
    "2. In about 10-20 minutes, your mixture should look like the picture above. (I would describe it as delightfully frothy.) Mix in your salt, and then add the bread flour one cup at a time. (I use the whisk for the first three cups and then switch to a wooden spoon or silicone spatula for the last three cups. For the very last cup, I don't even stir.).",
    "(Take any rings off between Steps 2 and 3. I learned this the hard way. Keep them on the counter that is farthest away from the garbage disposal. I also learned this the hard way.).",
    "3. Add a little extra flour to your hands and knead the dough, about 5 minutes. (Maybe this will get me in trouble with the baking police, but I knead the dough right in the large mixing bowl. It keeps my counter cleaner.) Place kneaded dough in a large, greased bowl and cover with towel.",
    "4. After an hour, your dough should have risen significantly. (Here comes the best part!) Punch the dough (Don't hold back! Get out all your frustration!) and then knead again for a couple of minutes. Divide into two lightly-greased loaf pans and cover with your towel once more.",
    "5. After allowing the dough to rise for 30 minutes in the loaf pans, bake in a preheated oven at 325 for 30-35 minutes. (For my oven, it's about 33 minutes. A lot of bread recipes use an oven at 350. I find 325 works better for honey.)."
  ],
  "ingredients": [
    "0",
    "2 cups warm water (I boil mine first in the electric kettle and then let it cool off a bit.)",
    "2⁄3 cup honey (Local and Raw if you can get it.)",
    "1 3⁄4 tablespoons active dry yeast (I use the kind in the jar and store in the frig.)",
    "1 1⁄2 teaspoons salt",
    "6 cups bread flour"
  ],
  "__v": 1
}