{
  "hash": "c476c31f518321088b1d254a3b4a9826e52e134d",
  "title": "Wonton Wrappers",
  "image": "https://chinasichuanfood.com/wp-content/uploads/2015/02/homemade-wonton-wrapper-2.jpg",
  "href": "https://www.chinasichuanfood.com/wonton-wrappers/",
  "extension": "Chrome",
  "firstAdded": "2018-08-25T23:11:52.022000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "In a large bowl, mix flour with salt and then add egg in. Stir well.",
    "Slowly add water and keep stirring the mixture. Then grasp with hand to form a ball. Adjust the amount of water based on the water absorbing capacity of your brand of flour. Stop adding water when there is no dry flour in your bowl.",
    "Place the dough in a large bowl, cover with plastic wrap and rest for 10 minutes.",
    "And then knead the dough again for around 8-15 minutes until smooth. Rest for around 30 minutes.",
    "Divide dough in half. Press on half down and roll out to a larger wrapper around 3mm in thickness. Fold up and cover with plastic wrap again for the next resting process.",
    "Finish the other half and reset both for another 30 minutes.",
    "Take one larger wrapper out and divide in half. Roll each of the halves into paper-thin wrapper or as thin as possible. Keep dusting. Then cut the large wrappers into small squares around 8cm.",
    "Repeat to finish all.",
    "Notes",
    "Dust the wrappers and then store in plastic bags; they can be store for couple of days in fridge.",
    "Vegan friendly solution: Skip eggs and add around around 2g dietary alkali powder in the water. If you do not have dietary alkali powder, you can use baked soda as a substitute (bake baking soda on a lined baking tray at 120 degree C). Do not touch it during the process to prevent skin irritation.",
    "You can surely use stand mixer or bread-maker to knead the dough and use a noodle machine to flatten the dough firstly."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "4 cups of plain flour",
    "3 middle size eggs",
    "1 teaspoon salt",
    "1 cup water +1/4 cup more if needed",
    "Starch for dusting (cornstarch or wheat starch recommended)"
  ],
  "__v": 1
}