{
  "hash": "509b2da68b1d02e942102646a3e7b17af73e3eec",
  "title": "Mint Chocolate Power Bars",
  "image": "http://i1.wp.com/www.greenkitchenstories.com/wp-content/uploads/2017/01/MintChocolatePowerBars_03.jpg?resize=800%2C597",
  "href": "http://www.greenkitchenstories.com/mint-chocolate-power-bars/",
  "extension": "Chrome",
  "firstAdded": "2018-01-05T15:54:12.052000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Line a 16 x 22 cm baking tin with parchment paper.",
    "Add the seeds, coconut, chia seeds, cacao powder, oats and salt to a food processor and pulse on high speed until coarsely crumbly. Pour into a bowl and add coconut oil, dates, nut butter, mint (oil or dried leaves) to the food processor. Run on high speed until entirely smooth and sticky. Add the seed and cacao crumbles and pulse quickly until mixed together. Help out with a spatula in case the mixture isn’t combined. Taste and add more mint flavour or salt if needed, then pulse a few more times.",
    "Transfer to the baking tin and, using the palm of your hand or the back of a spoon (coated in coconut oil), press the mixture down very firmly to create an even and compact bar (roughly 2 cm high). Scatter the cacao nibs on top and use a spatula to press them down slightly into the mixture.",
    "Let set in the freezer for approx. 15-30 minutes before cutting into approx. 18 bars.",
    "Store the bars in an airtight container in the freezer and they will keep for a few months. You can wrap them in baking paper to make them more portable. Thaw them ever so slightly before serving.",
    "NB: For a nut-free alternative, replace the nut butter with a seed butter of choice."
  ],
  "ingredients": [
    "0",
    "You can add a few tablespoons protein powder of choice (instead of the desiccated coconut) if you are making them as post-workout bars. Nuts can of course also be used instead of the seeds, if preferred.",
    "150 g / 1 cup mixed pumpkin seeds and sunflower seeds, toasted if preferred",
    "5 tbsp desiccated coconut, unsweetened",
    "4 tbsp chia seeds",
    "3 tbsp cacao powder",
    "50 g / 1/2 cup rolled oats",
    "2 pinches sea salt",
    "4 tbsp virgin coconut oil",
    "180 g soft fresh dates (roughly 16 dates / 1 packed cup), pitted",
    "5 tbsp nut butter of choice (we love using a combination of tahini and cashew butter but peanut butter also works great)",
    "a few drops peppermint oil (or 2-3 tsp dried mint leaves, crushed)",
    "Topping",
    "60 g / ½ cup raw cacao nibs"
  ],
  "__v": 1
}