{
  "hash": "0c191f1a0a345fe593c8d20b5463f4b1659de1f0",
  "title": "Fattoush Style Salad with Crispy Quinoa",
  "image": "",
  "href": "http://www.spoonforkbacon.com/2019/01/fattoush-style-salad-with-crispy-quinoa/",
  "extension": "Chrome",
  "firstAdded": "2019-02-07T22:18:22.736000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "1. Place all vinaigrette ingredients, except oil, into a large bowl and whisk together. Whisk oil into remaining ingredients, a little at a time, until fully incorporated. Remove 1/3 of vinaigrette from mixing bowl and set aside.",
    "2. Add romaine to large mixing bowl and toss together with vinaigrette until evenly coated, then spread dressed romaine onto a large platter.",
    "3. Add remaining vinaigrette, tomatoes, cucumbers, onion, garbanzo beans, and toasted pita bread to mixing bowl and toss together until everything is evenly coated.",
    "4. Pour mixture over dressed romaine and top with split burrata and crispy quinoa. Lightly season with salt and pepper and serve.",
    "**For crispy quinoa: Melt 2 tablespoons unsalted butter in a large skillet, over medium heat, and top with 1 cup cooked and cooled quinoa. Spread quinoa into a thin layer over butter and allow quinoa to get crispy, don’t stir. Once quinoa begins to brown and crisp around edges, begin tossing and stirring with a wooden spoon until quinoa browns and crisps all over. Lightly season with salt and pepper. Spread toasted quinoa onto a clean baking sheet, in a single layer and allow quinoa to cool completely before using."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "mustard vinaigrette:",
    "1/2 shallot, minced",
    "1 garlic clove, minced",
    "2 tablespoons whole grain (or Dijon) mustard",
    "2 tablespoons honey",
    "2 teaspoons red wine vinegar",
    "1/2 cup plus 1 tablespoon extra-virgin olive oil",
    "cracked black pepper to taste",
    "2 large heads romaine, cleaned, ends removed and chopped",
    "5 vine ripe tomatoes, quartered",
    "2 Persian cucumbers, sliced",
    "1/8 red onion, very thinly sliced",
    "1 (15 ounce) can garbanzo beans, drained and peeled",
    "2 balls burrata cheese, halved",
    "2 large toasted or grilled pita bread, broken into large pieces",
    "1 cup crispy cooked quinoa**"
  ],
  "__v": 1
}