{
  "hash": "87ac5a965a506a05d8abc250bd8d43e97835860a",
  "title": "Flank Steak and Kale Tacos with Pico De Gallo Salsa",
  "image": "http://images.fitpregnancy.mdpcdn.com/sites/fitpregnancy.com/files/styles/width_360/public/recipe/images/RU269144.jpg",
  "href": "http://www.fitpregnancy.com/recipe/flank-steak-kale-tacos-pico-de-gallo-salsa",
  "extension": "Chrome",
  "firstAdded": "2016-08-30T18:09:52.550000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place marinade ingredients in a large bowl and whisk to combine (or use a sealable freezer bag). Submerge steak in marinade, cover dish or close bag, and marinate in refrigerator for 2 hours or overnight.",
    "While steak is marinating, make pico de gallo: Place salsa ingredients in a medium-sized bowl; mix to combine. Set aside.",
    "To prepare kale, heat olive oil in a skillet over medium heat. add onions and cook until soft (about 4 minutes). Add kale and cook until kale wilts, stirring frequently (about 3 minutes). Season with salt and pepper. Set aside.",
    "To cook steak, preheat grill to medium-high. Remove steak from marinade and grill 4 to 7 minutes per side. Remove from grill and let sit 5 minutes; slice diagonally across the grain into thin strips.",
    "Heat tortillas to soften. Fill tortillas with kale mixture, steak and 3 tablespoons pico de gallo and serve immediately."
  ],
  "ingredients": [
    "0",
    "1/4 cup olive oil",
    "1/4 cup lime juice",
    "2 tablespoons honey",
    "2 cloves garlic, minced",
    "1 tablespoon chili powder",
    "Pinch of salt and pepper (to taste)",
    "1/4 bunch fresh cilantro, chopped",
    "5 plum tomatoes, seeded and diced",
    "1/2 cup finely diced red onion",
    "1 jalapeno (stems, ribs, seeds removed), minced",
    "Juice of 1 lime",
    "Salt and pepper to taste",
    "2 tablespoons olive oil",
    "1 white onion, diced",
    "1 bunch toscano kale, stemmed and cut into bitesized pieces",
    "Pinch of salt and pepper",
    "2 pounds flank steak",
    "20 corn tortillas"
  ],
  "__v": 1
}