{
  "hash": "8ce3d2ba814f4f1396f2134e107316a82345f57e",
  "title": "Rassolnik czyli rosyjska zupa ogórkowa",
  "image": "//static.smaker.pl/photos//8/8/8/888aa4d7bb3e33c0fa9bbe48f1d1213c_350732_56e1cb413dc74_wm.jpg",
  "href": "http://smaker.pl/przepis-rassolnik-czyli-rosyjska-zupa-ogorkowa,116358,anika1.html",
  "extension": "",
  "firstAdded": "2016-09-17T20:14:03.127000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Karkówkę myjemy, kroimy w plastry i zalewamy ok 2,5 litra wody. lekko solimy i gotujemy ok 1 godziny, aż mięso będzie miękkie. Pamiętamy o zdejmowaniu szumowin. Następnie mięso wyjmujemy i po lekkim schłodzeniu kroimy na kawałki",
    "Pęczak gotujemy wg przepisu na opakowaniu",
    "Z wywaru z gotowania mięsa odlewamy ok 1 litr ( wszystkie szumowiny zostają na dnie ), resztę wylewam. Do garnka wlewamy litr wywaru i uzupełniamy go wodą, tak aby było ok 2,5 litra płynu. Zagotowujemy. Dodajemy liście i ziele angielskie oraz mięso. Delikatnie solimy. Gotujemy na małym ogniu",
    "Cebulę siekamy i szklimy na oleju, a następnie dodajemy startą na grubych oczkach marchewkę i smażymy razem ok 3 minuty, po czym dodajemy do wywaru z mięsem",
    "Do zupy dodajemy koncentrat pomidorowy, a także pokrojone w kostkę ziemniaki i gotujemy, aż warzywa będą miękkie",
    "Następnie dodajemy starte na dużych oczkach ogórki i ugotowany pęczak. Dosalamy i doprawiamy pieprzem, a także dolewamy wodę spod ogórków ( ilość zależy od tego, jak kwaśna zupę chcemy uzyskać ). Gotujemy jeszcze ok 5 minut",
    "Zupa najlepiej smakuje na drugi dzień jak smaki się \"przegryzą\", choć i w pierwszy jest bardzo smaczna"
  ],
  "ingredients": [
    "0",
    "4 średniej wielkości ogórki kiszone + woda spod ogórków ( ilość wg uznania )",
    "600 g karkówki",
    "4 dość duże ziemniaki",
    "pol szklanki kaszy pęczak",
    "1 duża marchewka",
    "1 cebula",
    "3 łyżeczki koncentratu pomidorowego",
    "2 liście laurowe",
    "2 ziela angielskie",
    "sól pieprz",
    "2 łyżki oleju"
  ],
  "__v": 1
}