{
  "hash": "dc064bdfcf9a4b49ad8d200b0d039d4d5b63ba1f",
  "title": "Rigatoni with smoky eggplant, tomato and oregano",
  "image": "https://www.goodfood.com.au/content/dam/images/h/0/w/s/3/3/image.related.wideLandscape.940x529.h0yd6r.png/1528873563719.jpg",
  "href": "https://www.goodfood.com.au/recipes/rigatoni-with-smoky-eggplant-tomato-and-oregano-20180405-h0yd6r",
  "extension": "Chrome",
  "firstAdded": "2018-12-27T23:47:42.253000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Take one eggplant, prick it a few times with a fork or skewer and char it over a gas flame or grill inside your kitchen. Better yet, use an outdoor grill. It should be completely blackened outside and soft on the inside. If the skin gets completely black but it's not yet soft in the middle, finish roasting it in a 180C oven until softened. Set aside and allow to cool.",
    "Meanwhile, cut the other eggplant into medium-sized chunks. Heat about 100ml olive oil in a wide, deep heavy-bottomed pan and when hot, add the eggplant. Make sure the heat is on high when the eggplant goes in and then immediately turn it down to medium-high. Season the eggplant and try to brown it on a few sides. Some will stick and that's OK. As with browning meat, the trick is not to shake it around straight away. Drop it in, make sure it's in one even layer, then leave it for a few minutes. The eggplant will absorb a lot of the oil so you may need to add a bit more (which you can always remove later). It will brown, then start to release from the pan. Once it softens it will stick a bit more. That's OK, too. Once most is soft and brown, remove from the pan onto a paper-towel-lined plate.",
    "In the same pan, add a bit more olive oil if the pan is dry and sizzle the garlic cloves until fragrant then add dried chillies. Next, add the cherry tomatoes and oregano, season again. Turn your heat to medium and allow the tomatoes to cook gently without burning the garlic – they will soon begin to burst and release their juice, which will form the base of the sauce. Set this pan aside until ready to finish.",
    "Meanwhile take the smoky eggplant and peel away all the charred skin and stem. Chop the fleshy interior as finely as possible or throw in the food processor to make your life easier. Set aside.",
    "Cook the pasta in boiling salted water to your liking. Scoop the pasta out of the pot and into the pan with the tomatoes. Place this pan over medium heat and fold in your eggplant puree, the browned eggplant and a good ladleful of pasta water. Toss all of this together quite vigorously. That agitation and tossing motion is not just to impress your friends: it emulsifies the starches in the pasta and water to create a beautiful coating on your pasta. Don't be afraid to keep adding more pasta water to loosen the sauce. I'm always surprised at how much I use; just mind the salt. When all is combined, try to pull out the oregano stems before serving.",
    "Check for seasoning and add a squeeze of lemon if the tomatoes haven't provided enough acidity. Serve in individual bowls or a share platter topped with a drizzle of good extra virgin olive oil, crumbled ricotta salata, grated parmesan and some fresh oregano leaves."
  ],
  "ingredients": [
    "0",
    "450g rigatoni",
    "2 medium-sized purple eggplants",
    "4 garlic cloves, smashed",
    "2 punnets (about 400g) cherry tomatoes",
    "6 stems fresh oregano plus more for garnishing",
    "½ tsp dried chilli flakes",
    "extra virgin olive oil",
    "about 50g ricotta salata",
    "about 60g freshly grated parmesan"
  ],
  "__v": 1
}