{
  "hash": "861c404cad0e9188594bb7ab7feaa893d7e686a4",
  "title": "Superfood Chocolate Quinoa Bark.",
  "image": "http://www.halfbakedharvest.com/wp-content/uploads/2016/01/Superfood-Chocolate-Quinoa-Bark-1.jpg",
  "href": "http://www.halfbakedharvest.com/superfood-chocolate-quinoa-bark/",
  "extension": "Chrome",
  "firstAdded": "2016-02-15T23:47:47.058000",
  "users": [
    null
  ],
  "keywords": [
    "honey",
    "syrup",
    "works",
    "great",
    "maple",
    "flavor",
    "think",
    "best",
    "coconut",
    "oil",
    "vanilla",
    "instant",
    "coffee",
    "granules",
    "love",
    "good",
    "flaky",
    "salt",
    "uncooked",
    "quinoa",
    "rinsed",
    "raw",
    "almonds",
    "roughly",
    "cashews",
    "mixed",
    "used",
    "hemp",
    "flax",
    "chia",
    "sesame",
    "seeds",
    "vegan",
    "use",
    "dark",
    "chocolate",
    "cacao",
    "nibs",
    "roses",
    "order"
  ],
  "directions": [
    "0",
    "Instructions",
    "Preheat the oven to 350 degrees F. Line a baking sheet with parchment paper.In a large microwave safe bowl, melt together the honey or maple and coconut oil on power level high, stirring every 30 seconds until smooth (this took about 1 minute for me). Whisk in the vanilla, coffee granules and salt.Add the quinoa, almonds, cashews and mixed seeds. Stir until all the dry ingredients are evenly coated in the wet ingredients. Spread the mixture out in an even, thin layer on the prepared baking sheet.Bake for 20-25 minutes or until the the bark is golden in color and crisp. You'll know the bark is done when the cashews and quinoa look caramelized and are a deep golden brown in color.While the bark is baking, melt the chocolate over a double boiler or in the microwave, heating on 30 second intervals and stirring after each interval until the chocolate is melted and smooth. Spread the melted chocolate over the bark in an even layer. Sprinkle with cacao nibs.Place the pan in the fridge to set, about 30 minutes (or the freezer for 15). Remove and break into pieces. Store in a sealed container in the fridge."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1/2 cup honey or maple syrup (either works great, I like the maple flavor I think best)",
    "2 tablespoons coconut oil",
    "2 teaspoons vanilla",
    "2 teaspoons instant coffee granules (optional, but I LOVE the flavor)",
    "good pinch of flaky sea salt",
    "1 cup uncooked quinoa, rinsed + dried",
    "1/2 cup raw almonds, roughly chopped",
    "1/2 cup raw cashews, roughly chopped",
    "1/2 cup mixed raw seeds (I used hemp seeds, flax seeds, chia seeds + sesame seeds)",
    "12 ounces vegan or dark chocolate, chopped (I like to use 92% dark chocolate)",
    "Cacao nibs + dried roses, for topping (optional)",
    "Order Ingredients"
  ],
  "__v": 1
}