{
  "hash": "2ec9e2c1ba821a3f08db637b07dfb32cb918bf50",
  "title": "CHEWY PEANUT BUTTER GRANOLA BARS",
  "image": "https://www.gimmesomeoven.com/wp-content/uploads/2019/01/Healthy-Chewy-Peanut-Butter-Granola-Bars-Recipe-7-Recovered.jpg",
  "href": "https://www.gimmesomeoven.com/chewy-peanut-butter-granola-bars/",
  "extension": "Chrome",
  "firstAdded": "2019-02-07T22:17:43.600000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS:",
    "Line an 8 x 8-inch or 9 x 9-inch square baking pan with parchment paper. Set aside.",
    "Stir the peanut butter, honey and coconut oil together in a medium saucepan. Cook over medium heat, stirring occasionally, until the mixture reaches a simmer. Continue to simmer for 1 minute, stirring often so that the bottom of the mixture does not burn. Remove from the heat.",
    "Add the vanilla and salt, and stir until combined. Add in the oats and almonds, and stir until completely combined. (Optional step: If you would like the chocolate chips not to melt, I recommend chilling transferring the granola to the refrigerator at this point for about 15 minutes, or until it reaches room temperature.) Then stir in the chocolate chips until combined.",
    "Press the granola firmly and evenly into the bottom of the prepared pan. (I use the bottom of a measuring cup to help press it down so that it’s nice and flat.) Sprinkle a few extra chocolate chips on top if you would like. Then cover and refrigerate the granola bars for about an hour or so, or until they are chilled.",
    "Use the parchment paper to lift the bars out of the pan and transfer them to a cutting board. Cut, serve, and enjoy! Or store in a sealed container for up to 5 days, or freeze for up to 3 months."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS:",
    "3/4 cup natural peanut butter",
    "1/2 cup honey",
    "2 tablespoons coconut oil",
    "1 teaspoon vanilla extract",
    "1/2 teaspoon sea salt*",
    "2 1/4 cups old-fashioned oats*",
    "1 cup slivered or chopped almonds",
    "optional: 1/2 cup mini semisweet chocolate chips, plus extras for sprinkling on top"
  ],
  "__v": 1
}