{
  "hash": "486c60f3ab0ef952e84d6486eb9698e2729731ee",
  "title": "High Vibe Pumpkin Pie (Vegan, Gluten Free)",
  "image": "http://i0.wp.com/willfrolicforfood.com/wp-content/uploads/2015/11/high-vibe-pumpkin-pie-gluten-free-vegan-1457.jpg?resize=683%2C1025",
  "href": "http://willfrolicforfood.com/2015/11/high-vibe-vegan-gluten-free-pumpkin-pie.html",
  "extension": "",
  "firstAdded": "2015-11-18T14:11:03.928000",
  "users": [
    null
  ],
  "keywords": [
    "rolled",
    "oat",
    "certified",
    "gluten",
    "free",
    "oats",
    "necessary",
    "raw",
    "unsalted",
    "sunflower",
    "seeds",
    "coconut",
    "oil",
    "maple",
    "syrup",
    "salt",
    "cinnamon",
    "pumpkin",
    "puree",
    "fat",
    "milk",
    "sugar",
    "brandy",
    "vanilla",
    "cardamom",
    "ginger",
    "clove",
    "nutmeg"
  ],
  "directions": [
    "0",
    "Preheat the oven to 350F.",
    "Add the oats to the bowl of a high powered blender. Grind until you have a semi-fine flour. Add the sunflower seeds, coconut oil, maple syrup, salt and cinnamon. Blend until it comes together into a smooth, pliable dough. Scoop the dough out of the blender out into a 9\" pie or tart pan. Using your hands, press the crust into the pan evenly. You want the crust to go all the way up the sides of the pan to form the \"wall\" of the crust, but not over the edges of the pan. Prick holes all over the crust. Bake for 15 minutes, rotating half-way through, until golden. One baking, remove from the oven and set aside to cool slightly.",
    "In a medium sauce pot, whisk together the pumpkin custard ingredients: pumpkin puree, coconut milk, maple syrup, coconut sugar, brandy, vanilla, cardamom, ginger, clove, cinnamon and nutmeg. Stir everything together until smooth. Place the mix over medium high heat. The mixture will smooth out more as it cooks. Cook, stirring relatively constantly and scraping down the sides of the pan, until reduced by half of the original volume. This takes roughly 20-25 minutes. Once done, the filling will coat the back of a spoon thickly.",
    "Pour the pie filling into the pie crust, smoothing out the top with a spatula. Bake at 350F for 25 minutes. The filling will thicken and turn a dark brown color. Remove the pie from the oven and let cool on the countertop to room temperature. Then place the pie in the fridge to chill for a minimum of 3 hours, ideally overnight. The pie will be firm and golden orange when it's ready.",
    "Slice into your pie and enjoy! Best served with coconut whip or a la mode."
  ],
  "ingredients": [
    "0",
    "1⅓ cup rolled oat (certified gluten free oats if necessary)",
    "⅓ cup raw unsalted sunflower seeds",
    "¼ cup coconut oil",
    "½ cup maple syrup",
    "pinch sea salt",
    "¼ teaspoon cinnamon",
    "1",
    "1 13 oz can pumpkin puree",
    "1 13 oz can full fat coconut milk",
    "¼ cup maple syrup",
    "¼ cup coconut sugar",
    "¼ cup brandy",
    "¼ cup vanilla extract",
    "1 teaspoon ground cardamom",
    "1 teaspoon ground ginger",
    "¼ teaspoon ground clove",
    "¼ teaspoon cinnamon",
    "dash nutmeg (or to taste)"
  ],
  "__v": 1
}