{
  "hash": "1aef486b44ab5d060d35bdb8789e48df4feca30c",
  "title": "Gluten-Free Millet Flat Bread (Bajri no Rotlo)",
  "image": "",
  "href": "http://indiaphile.info/millet-flat-bread-bajri-rotlo/",
  "extension": "",
  "firstAdded": "2015-10-10T21:57:37.082000",
  "users": [
    null
  ],
  "keywords": [
    "millet",
    "bajri",
    "bajra",
    "flour",
    "extra",
    "dusting",
    "salt",
    "ghee",
    "use",
    "coconut",
    "oil",
    "vegan",
    "water",
    "squares",
    "parchment",
    "wax",
    "paper",
    "plastic",
    "sheets"
  ],
  "directions": [
    "0",
    "In a medium bowl, mix together the bajri flour and salt.",
    "Add the water and mix with your hands or a wooden spoon until it forms a smooth dough that looks a little like clay.",
    "Divide the dough into six equal parts.",
    "Roll each piece of dough between your palms forming a ball and then press the ball between your palms to flatten, creating a disc shape.",
    "Line your rolling surface with a sheet of parchment or plastic. Skip this step if you are confident in your rolling abilities. Having the parchment helps to avoid sticking and makes it easy to transfer the rolled out flat bread to the pan.",
    "Take one disc of dough, make sure to cover the rest so they don’t dry out, and press both sides into the extra bajri flour.",
    "Place the disc onto the parchment or plastic sheet. Sprinkle some more dry bajri flour on top of the disc and roll it out into about a 6 inch disc. Add more dry flour as needed.",
    "Heat a 12 inch cast iron skillet or a non-stick skillet (if using non-stick, heat with a tablespoon of oil and wipe the oil away when ready to cook the flat bread) over a medium heat.",
    "Put a single rotlo on the pan. Brush the top with some water.",
    "After about two minutes, when the rotlo has a few bubbles and starts to brown underneath, flip the rotlo over.",
    "When the rotlo is evenly cooked on both sides, remove it from the pan and toast it directly over the flame for about 20 to 30 seconds. Make sure to move the rotlo around to avoid burning.",
    "Transfer to a platter and brush with 2 teaspoons of ghee or coconut oil."
  ],
  "ingredients": [
    "0",
    "2 cups millet flour (bajri or bajra flour) plus a little extra for dusting",
    "1/2 tsp salt",
    "2 tbsp ghee (use coconut oil to keep it vegan)",
    "2/3 cup water",
    "6 to 12 squares of parchment paper, wax paper or thick plastic sheets about 8 inches x 8 inches"
  ],
  "__v": 1
}