{
  "hash": "1f81febce6bfd300ad72bf956f0112776b0237dd",
  "title": "Pasta Puttanesca",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2013/02/pasta-puttanesca-vertical-2.jpg",
  "href": "http://www.simplyrecipes.com/recipes/pasta_puttanesca/",
  "firstAdded": "2014-12-02T03:26:25.524000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "onion",
    "garlic",
    "canned",
    "anchovies",
    "tomato",
    "red",
    "pepper",
    "tomatoes",
    "oregano",
    "nonpariel",
    "capers",
    "olives",
    "black",
    "green",
    "roughly",
    "parsley",
    "spaghetti",
    "salt",
    "drizzling"
  ],
  "directions": [
    "0",
    "1 Heat the olive oil over medium-high heat in a large, deep saute pan. When the oil is hot, sauté the onions until they're soft and translucent, about 4-5 minutes. While the onions are cooking, stir in the chopped anchovies along with some of the oil from the can. Add the garlic and cook another minute.",
    "2 Mix in the tomato paste and cook it for 2 minutes, stirring occasionally. Add the crushed tomatoes, oregano, chili pepper flakes, and olives. Turn the heat down to a gentle simmer.",
    "3 Bring a large pot of salted water to a boil. When you add the spaghetti to the boiling water to cook, add the capers to the sauce and continue to simmer it gently. Cook the pasta according to the package instructions, to al dente, cooked but still slightly firm.",
    "4 Drain the pasta and put in a large bowl. Drizzle a little olive oil over the pasta and mix to combine. Stir the parsley into the pasta sauce. Add a ladle's worth of sauce to the pasta and mix to combine. Serve in shallow bowls with more sauce on top."
  ],
  "ingredients": [
    "0",
    "2 Tbsp olive oil",
    "1/2 cup minced onion",
    "3 cloves garlic, chopped",
    "3-4 canned anchovies, chopped",
    "2 Tbsp tomato paste",
    "1/2 teaspoon red pepper flakes",
    "1 28-ounce can crushed tomatoes",
    "2 teaspoons dried oregano",
    "2 Tbsp small (non-pariel) capers",
    "3/4 cup pitted olives (black or green), roughly chopped",
    "1/4 cup chopped fresh parsley",
    "1 pound spaghetti",
    "Salt",
    "Olive oil for drizzling"
  ],
  "__v": 1
}