{
  "hash": "a07c67e674e22234def2c983614b8ab122f7b489",
  "title": "How to Make Smoky Pesto Cashew Cheez",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2013/11/Smoky-Pesto-Cashew-Cheez.jpg",
  "href": "http://www.onegreenplanet.org/vegan-food/how-to-make-smoky-pesto-cashew-cheez/",
  "extension": "",
  "firstAdded": "2015-04-01T07:05:15.516000",
  "users": [
    null
  ],
  "keywords": [
    "agar",
    "water",
    "raw",
    "cashews",
    "lemon",
    "juice",
    "olive",
    "oil",
    "smoke",
    "nutritional",
    "yeast",
    "salt",
    "onion",
    "garlic",
    "quick",
    "oilfree",
    "pesto",
    "recipe",
    "follows",
    "basil",
    "leaves",
    "roughly",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "Clean and dry the bowl of the food processor and grind the cashews. Either lightly oil a 9″ x 5″ loaf pan or use medium-sized ramekins to get round cheezes. One loaf pan is perfect for this recipe, but if you go smaller, you will need more than one pan or dish.",
    "In a medium-sized sauce pan, bring the 3 cups of water and agar flakes to a boil and keep the mixture at a nice, rolling boil for 5 minutes, whisking often. Meanwhile, add the remaining cheez ingredients – but not the pesto or the water/agar – to the food processor. Process until everything is combined and you have a thick paste. When the agar mixture has boiled for 5 minutes, remove from the heat and immediately whisk in the cashew mixture. It will start off rather chunky, but will melt into the agar. Once it’s all whisked and smooth, quickly dump in the pesto and stir only one or two times. You don’t want to fully incorporate the pesto – you’re looking for streaks and lumps.",
    "Quickly pour the cheez into the prepared pan(s) or dish(es). Pop into the ‘frige and allow to firm up. Once the cheez is firm, you can remove it from the pan(s) by running a knife around the edges. Serve sliced, as is, or use in quesadillas or grilled sandwiches.",
    "1",
    "In a food processor, pulse the basil, garlic and pepper until finely chopped. Remove from processor and set aside."
  ],
  "ingredients": [
    "0",
    "1 oz. agar flakes or powder",
    "3 cups water",
    "2 cups raw cashews, ground into a fine powder",
    "3 tbsp. fresh lemon juice",
    "1/2 tbsp. olive oil",
    "1/4-1/2 tsp. Liquid Smoke",
    "1/4 cup nutritional yeast",
    "1 1/2 tsp. salt",
    "1/2 tsp. onion flakes or powder",
    "1/2 tsp garlic powder",
    "1 cup quick, oil-free pesto (recipe follows)",
    "1",
    "2 cups fresh basil leaves",
    "2 cloves garlic, peeled and roughly chopped",
    "dash ground black pepper"
  ],
  "__v": 1
}