{
  "hash": "ab09f02a779794e4578a20fe14df33a3095f2c05",
  "title": "21 Easy, Healthy Snacks For When You're Trying To Lose Weight « Fribliss21 Easy, Healthy Snacks For When You’re Trying To Lose Weight | READMEEVERYDAY21 Easy, Healthy Snacks For When You’re Trying To Lose Weight | BuzzBoomBoxBruschetta Recipe With Guacamole - Healing TomatoLentil Soup In A Roasted Butternut Squash - Healing Tomato",
  "image": "http://www.healingtomato.com/wp-content/uploads/2016/10/butternut-squash-french-fries.jpg",
  "href": "http://www.healingtomato.com/2016/10/20/butternut-squash-french-fries/",
  "extension": "Chrome",
  "firstAdded": "2016-12-12T22:50:21.740000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Take a butternut squash that has a long neck. Wash it thoroughly and then dry it.",
    "Cut off the butternut squash at the base of the neck. Wrap up the bottom part of the squash and refrigerate it for a future recipe",
    "Cut of the top part of the neck and discard. Preheat oven to 450 degrees",
    "Peel the skin of the butternut squash and cut it into long strips. Place them in a bowl and add 2 tsp of extra virgin olive oil. Add more if the strips are not fully coated. I used a small butternut squash which only needed 2 tsp",
    "Add 2 tsp of freshly chopped tarragon and 1 tsp of salt. Mix well and then transfer to baking sheet. Spread it out evenly",
    "Bake in the oven for 15-20 minutes until they turn crispy. Remove from the oven and let them cool",
    "In a food processor, add 1 avocado that is peeled and roughly chopped",
    "Add 2 tsp of freshly squeezed lime juice",
    "Add 1 tsp of salt and black pepper. Black pepper is optional",
    "Add 1/2 cup of almond milk. If you prefer creamier, add more almond milk",
    "Add 2 Tbsp of water and blend on low speed until it is well blended",
    "Transfer the fries to a plate and sprinkle the avocado dressing or with a side of the ketchup"
  ],
  "ingredients": [
    "0",
    "Long neck section of a small butternut squash",
    "2 tsp of extra virgin olive oil",
    "2 tsp of freshly chopped tarragon",
    "1 tsp of salt",
    "1 avocado",
    "2 tsp of freshly squeezed lime juice",
    "1 tsp of salt",
    "1/2 cup of almond milk (adjust for texture preference)",
    "2 Tbsp of water",
    "1 tsp black pepper (optional)"
  ],
  "__v": 1
}