{
  "hash": "c727bbcbfb17a863d57c80a9e7584f6eceeb347b",
  "title": "Sunday Pork Ragu",
  "image": "https://d2k9njawademcf.cloudfront.net/slides/5385/original/050311F_409.JPG?1304472461",
  "href": "http://food52.com/recipes/11544-sunday-pork-ragu",
  "extension": "Chrome",
  "firstAdded": "2015-06-10T01:02:01.635000",
  "users": [
    null
  ],
  "keywords": [
    "pork",
    "bones",
    "head",
    "pieces",
    "salt",
    "divided",
    "links",
    "italian",
    "sausage",
    "spicy",
    "medium",
    "yellow",
    "onion",
    "garlic",
    "extra",
    "virgin",
    "olive",
    "oil",
    "tomato",
    "goodquality",
    "tomatoes",
    "bay",
    "leaf",
    "parsley",
    "pepper",
    "pasta",
    "shape",
    "rigatoni",
    "penne",
    "best",
    "basil",
    "julienned",
    "pecorino",
    "romano",
    "cheese"
  ],
  "directions": [
    "0",
    "Preheat oven to 400 degrees. Line a baking sheet with sides with aluminum foil. Place a baking rack over the foil and place the ribs on the rack. There should be a little space between each rib. Sprinkle with 1/2 teaspoon salt. Place baking pan in oven and roast for 30-40 minutes (the bigger pieces you may have to turn halfway through) until nicely browned and caramelized. Remove pan from oven and with tongs take each rib off the rack. Place on a paper-towel lined plate to further drain.",
    "On cutting board, carefully remove casings from sausage. Slice each link into four pieces, or simply pinch off balls of sausage about 1 to 1 1/2 inches in diameter. Set each piece of sausage on wire rack (no need to wash the rack beforehand). Place baking pan in oven and roast for about 30 minutes, or until sausage is browned and caramelized. It usually is not necessary to turn the sausage, but you can if you wish. Remove pan from oven and turn off oven.",
    "On cutting board, cut onion into medium-small dice. Thinly slice garlic cloves, then roughly chop. (You don't want the garlic pieces too small or they will burn.) Heat a large, heavy saucepan or Dutch oven over medium-low heat. Add olive oil. When oil has warmed, add onion and saute until just beginning to turn golden brown (about 10 minutes), stirring occasionally with a wooden spoon. Add garlic to pan and stir frequently. When the garlic aroma becomes heady and fragrant (watch carefully to make sure garlic is not browning too quickly), clear a hot spot in the pan with your wooden spoon. Add tomato paste and saute until the tomatoes begins to release their fragrance. Mix tomato paste with onion and garlic mixture and add 5.5 ounces of water to pan. (Easiest way to do this is to simply fill tomato paste can with water.) Drain juice from canned tomatoes and reserve about a cup of it. Add bay leaf and tomatoes to pan. You can add tomatoes whole -- they will cook down. Or simply cut each tomato into about four pieces with kitchen shears before adding them to the pot.",
    "Bring tomato-onion-garlic mixture to a simmer and add pork bones and sausages, nestling them carefully into the sauce. You want enough meat to flavor the sauce, but not so much that it overwhelms the tomato sauce. Lower heat and cook tomato sauce at a low simmer for about two hours, stirring occasionally. During the first hour of cooking, if level of sauce in the pan begins to evaporate, add reserved tomato liquid, as needed. After the first hour of cooking, add water to the sauce instead if sauce is looking too thick. The sauce will smell wonderful as it cooks, infusing your home with pork and tomato aromas. Inhale and savor, and pour yourself a glass of your favorite red wine.",
    "After about two hours of cooking, begin to add salt, about 1 teaspoon at a time. Let sauce cook for about 15 minutes, so that the salt's flavor can be absorbed before adding more. Add a few grinds of fresh black pepper and the parsley. Taste and adjust the seasonings until the flavors are to your liking. Continue to cook for another half hour or so. (Total cooking time should be at least 2 1/2 to 3 hours, but honestly you cannot cook this sauce too much. The longer it simmers, the better it will taste.)",
    "About half an hour before you are ready to eat, fill a large stockpot with water. Bring to a boil and add a tablespoon or two of salt. Taste it and see if you can taste the salt. If you can't taste the salt, then add a little more. When water is rapidly boiling, add dried pasta. Give a good stir with a slotted spoon and bring back to a boil. Cook for about eight minutes, then begin tasting the pasta. When it is al dente (just slightly chewy, but not hard) drain pasta, but reserve a cup or two of the cooking water.",
    "If the sauce looks too thick, add a ladle or two of pasta water. Warm a big spaghetti serving bowl with some of the pasta water. Add a ladleful of sauce to the bottom of the bowl. Top with a tablespoon or two of cheese. Add a few large spoonfuls of pasta. Top with sauce, more cheese and a sprinkling of basil. Add another layer of pasta, sauce, cheese and basil. Keep layering the ingredients until the bowl is full. Add bones and sausage around the edges of the bowl. Top with a handful of basil and more cheese.",
    "Serve pasta in bowls with additional grated cheese and basil. Pour some more red wine, and serve with warm bread. Enjoy!"
  ],
  "ingredients": [
    "0",
    "3/4 pound pork bones (see head note), cut into approximately 2-inch pieces",
    "1-2 tablespoons salt (or more to taste), divided",
    "5 links sweet Italian sausage",
    "3 links, spicy Italian sausage",
    "1 medium yellow onion",
    "6 small garlic cloves (about 3/4 ounce)",
    "2 tablespoons Extra Virgin olive oil",
    "1 small can (5.5 oz) tomato paste",
    "2 large (28 ounces each) cans good-quality tomatoes (see head note)",
    "1 bay leaf",
    "1/2 cup fresh parsley, chopped",
    "Freshly ground pepper to taste",
    "1 pound dried pasta (a shape such as rigatoni or penne is best -- see head note)",
    "1/2 cup fresh basil, julienned",
    "1/2 cup Pecorino Romano cheese (or more to taste)"
  ],
  "__v": 1
}