{
  "hash": "45e22c1e6071f3cedcaac7a617de74583e35fe9d",
  "title": "Spring Veg Hot Pot [Vegan, Gluten-Free]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/03/pie1-1191x800.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/spring-veg-hot-pot/?utm_source=Green+Monster+Mailing+List&utm_campaign=34d088fc26-NEWSLETTER_EMAIL_CAMPAIGN&utm_medium=email&utm_term=0_bbf62ddf34-34d088fc26-106311653",
  "extension": "",
  "firstAdded": "2015-03-28T08:10:51.844000",
  "users": [
    null
  ],
  "keywords": [
    "carrots",
    "onion",
    "leeks",
    "olive",
    "oil",
    "garlic",
    "spears",
    "asparagus",
    "white",
    "canellini",
    "butterlima",
    "beans",
    "frozen",
    "green",
    "peas",
    "glutenfree",
    "used",
    "rice",
    "flour",
    "free",
    "herb",
    "cream",
    "cheese",
    "stock",
    "potato"
  ],
  "directions": [
    "0",
    "Preheat your oven to 350 degrees.",
    "Peel/ Wash/ Trim your carrots, onion and leeks then fry in a small drizzle of olive oil for 10 mins on a medium heat in a large deep based oven proof frying pan or casserole dish.",
    "Crush the garlic into the pan, season with a good pinch of salt and pepper and add your roughly chopped asparagus, white beans and frozen peas and cook for a further 5 mins. Once the vegetables are softened (and the peas are defrosted) stir in the flour, cream cheese and vegetable stock.",
    "Bring to the boil then simmer covered for 15 mins. Add a splash of water if the sauce is thickening too quickly.",
    "Top the filling with a layer of thin slices of unpeeled potato, you can do this randomly or in a nice swirl like I did. Cover with foil or put the lid on and bake in the oven for 20 mins. Then uncover for 10-15 mins to crisp up potatoes.",
    "It is done when the potato slices are browned around the edges and the filling is bubbling away underneath. Serve hot with any side you like. If you are serving this at a party then make a couple of big pan fuls, place a large spoon in each pan and watch it disappear!"
  ],
  "ingredients": [
    "0",
    "2 carrots",
    "1 large onion",
    "2 leeks",
    "olive oil",
    "2 cloves garlic",
    "10 spears of asparagus",
    "1 can white beans such as canellini or butter/lima beans",
    "1 cup frozen green peas",
    "1 tbsp gluten-free flour – I used rice flour",
    "3 1/2 ounces dairy free garlic and herb cream cheese",
    "14 ounces gluten-free vegetable stock",
    "1 large potato"
  ],
  "__v": 1
}