{
  "hash": "06789bf7e8e079b46b4daf48abb40fb0e4c26194",
  "title": "One Pan Crispy Spanish Chicken and Rice (Arroz Con Pollo)",
  "image": "http://i1.wp.com/cafedelites.com/wp-content/uploads/2015/06/Arroz-Con-Pollo-19.jpg?zoom=2&resize=600%2C900",
  "href": "http://cafedelites.com/2015/06/21/one-pan-spanish-chicken-and-rice/",
  "extension": "Chrome",
  "firstAdded": "2015-09-13T14:34:19.945000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "thighs",
    "bone",
    "skin",
    "salt",
    "black",
    "pepper",
    "garlic",
    "olive",
    "oil",
    "onion",
    "pieces",
    "shortcut",
    "bacon",
    "trimmed",
    "fat",
    "smoked",
    "ham",
    "paprika",
    "threads",
    "imitation",
    "saffron",
    "use",
    "vine",
    "ripened",
    "tomatoes",
    "juice",
    "jarred",
    "roasted",
    "peppers",
    "piquillo",
    "strips",
    "water",
    "mixed",
    "stock",
    "broth",
    "dry",
    "white",
    "wine",
    "notes",
    "longgrain",
    "rice",
    "frozen",
    "peas",
    "thawed",
    "flatleaf",
    "parsley"
  ],
  "directions": [
    "0",
    "Preheat an oven to 200C | 390F. Wash and pat chicken dry with a paper towel. Season with salt, pepper and garlic powder. Heat a small amount oil in a 10-12 inch cast iron pan over medium-high heat until hot but not smoking. Sear chicken thighs skin-side down, turning once until golden brown on both sides, (about 3 minutes each side). Transfer chicken to a plate.",
    "Pour out half of the fat from skillet and add onion and bacon. Fry, stirring, until onion has softened and bacon has crisped (about 5 minutes). Add the garlic, paprika and saffron; cook until fragrant. Add tomatoes and peppers, fry until soft. Stir through the stock (or broth) and wine, stirring all ingredients to combine well. Salt to season (if needed)",
    "Add rice and allow to simmer, uncovered, for about 5 minutes, while stirring occasionally. Return the chicken and any juices from the plate to the pan; cover with a double layer of foil and transfer to the oven to bake for 40 minutes.",
    "Uncover the pan and check that rice is tender and the liquid has been absorbed. Change oven setting to grill/broil (on medium-high heat - depending on your oven). Transfer chicken pieces to a clean plate; stir peas through the rice, covering them with the hot rice as much as possible; place the chicken back on top of the rice and grill/broil for about 10 minutes OR until the chicken is golden and crisp, and the peas are cooked through. Garnish with fresh chopped parsley."
  ],
  "ingredients": [
    "0",
    "5 chicken thighs, bone in and optional skin on",
    "Salt and freshly ground black pepper",
    "1 teaspoon garlic powder",
    "1 tablespoon olive oil",
    "1 large onion, chopped",
    "6oz | 160g (6 pieces) shortcut bacon trimmed of all fat, chopped (or smoked ham)",
    "3 garlic cloves, minced",
    "2 teaspoons sweet paprika",
    "½ teaspoon crushed saffron threads (or ¾ teaspoon imitation saffron powder is fine to use)",
    "2 vine ripened tomatoes, diced (or 1 small can diced tomatoes including juice)",
    "1 cup jarred fire roasted peppers in garlic (Piquillo), cut into strips",
    "1½ cups water mixed with 2 teaspoons vegetable stock powder (or use chicken broth)",
    "½ cup dry white wine *See Notes",
    "1½ cups long-grain white rice",
    "¾ cup frozen peas (not thawed)",
    "Chopped fresh flat-leaf parsley, for garnish"
  ],
  "__v": 1
}