{
  "hash": "a69821be114371d7f539e6478c9932ddbba73a15",
  "title": "Irish Potato Cakes with Avocado Basil Ranch",
  "image": "",
  "href": "http://www.veganricha.com/2016/03/irish-potato-cakes-with-avocado-basil-ranch.html",
  "extension": "Chrome",
  "firstAdded": "2017-09-03T17:38:08.404000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Chop 1 potato and add to a pot of cold water. Bring to a boil then continue to cook over medium heat for 5 to 7 minutes until done. Drain, cool slightly, add salt, pepper, milk, flax, nutritional yeast, oil and kala namak and mash well. Taste and add salt if needed to keep the mixture saltier than regular mashed potatoes.",
    "Grate the other potato. Add a ½ tsp lemon juice and mix in. Squeeze the grated potato with paper towel to remove some of the excess moisture..",
    "Mix the grated potato with mashed potatoes.",
    "Mix the baking powder in ¼ cup flour and add to the potato bowl and mix in. If the mixture is too stiff, add another tbsp of non dairy milk.",
    "Heat a skillet over medium heat. When hot, add a few drops of oil to grease. Drop dollops of the potato mixture on the greased pan. Shape and flatten and cook 4 to 5 minutes each side. (To bake: Bake at 425 degrees F for 15 to 20 minutes. Broil for a minute if needed).",
    "Garnish with scallions and vegan butter. Serve with avocado ranch.",
    "For the avocado ranch: Blend all the ingredients. Add water if needed. Taste and adjust seasoning. Add nutritional yeast for cheesy flavor (optional)"
  ],
  "ingredients": [
    "0",
    "2 large russets",
    "¾ teaspoon fine salt, plus more for seasoning the potatoes before cooking",
    "¼ teaspoon or more freshly ground black pepper",
    "¼ cup non dairy milk",
    "1 tbsp flax seed meal",
    "1 to 2 tbsp nutritional yeast (optional)",
    "a generous pinch of kala namak (Indian black salt) optional",
    "1 tsp oil",
    "½ tsp lemon juice",
    "¼ to ⅓ cup unbleached all purpose flour ( or use a gluten-free flour which is neutral tasting)",
    "½ tsp baking powder",
    "oil for cooking",
    "1",
    "1 ripe avocado",
    "1 tbsp fresh basil",
    "½ tsp garlic",
    "½ tsp or more ranch seasoning",
    "generous dash of black pepper and salt",
    "2 tsp lime juice",
    "water as needed"
  ],
  "__v": 1
}