{
  "hash": "86a1e3d304358bb56d50db0e9e0d81047c1568b3",
  "title": "Chocolate Peanut Butter Thumbprint Cookies",
  "image": "http://bakingbites.com/wp-content/uploads/2017/04/DSC_9700.jpg",
  "href": "http://bakingbites.com/2017/04/chocolate-peanut-butter-thumbprint-cookies/",
  "extension": "Chrome",
  "firstAdded": "2017-04-21T23:18:19.590000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350F. Line a baking sheet with parchment paper.",
    "In a medium bowl, sift together flour, cocoa powder and salt.",
    "In a large bowl, cream together butter and sugar until light and creamy. Blend in milk and vanilla extract, then slowly blend in the flour mixture with the mixer on low speed. Dough will be dry, but will come together as you mix. If necessary, add in an additional teaspoon or two of milk.",
    "Shape dough into 1-inch balls and arrange on prepared baking sheet. Using your thumb or the back of a spoon, make an indentation in the top of each ball of dough and pipe (or spoon) peanut butter to fill the indentation completely up.",
    "Bake for 13-15 minutes, until cookies are set and are just firm around the outside edge. Allow cookies to cool for 2-3 minutes on the baking sheet, then transfer to a wire rack to cool completely.",
    "When the cookies have cooled, melt half of the chocolate chips in a small, microwave-safe bowl. Add unmelted chips to the warm, melted chips and stir until all the chocolate chips have melted (to quickly temper the chocolate). IF necessary, warm mixture for 10 seconds in the microwave if not all the chocolate chips melt. Drizzle chocolate over the cookies using a piping bag or the tines of a fork. Allow chocolate to set at room temperature.",
    "Makes 3 1/2 dozen."
  ],
  "ingredients": [
    "0",
    "2 1/4 cups all purpose flour",
    "6 tbsp unsweetened cocoa powder",
    "1/2 tsp salt",
    "1 cup butter, room temperature",
    "2/3 cup sugar",
    "1 tbsp milk",
    "1 tsp vanilla extract",
    "approx 1/2 cup peanut butter",
    "1/3 cup chocolate chips"
  ],
  "__v": 1
}