{
  "hash": "ac20702dd4cd02cad32e7a95652efd3b9eca6eba",
  "title": "Coconut Flour Brownies with Chocolate Ganache from Everyday Grain-Free Baking by Kelly Smith.",
  "image": "http://gourmandeinthekitchen.com/wp-content/uploads/2015/02/Coconut-Ganache-Brownie-from-Everyday-Grain-Free-Baking.jpg?c3c4ca",
  "href": "http://gourmandeinthekitchen.com/2015/coconut-flour-brownies-with-chocolate-ganache/?utm_content=buffer0e189&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer",
  "firstAdded": "2015-02-11T15:19:18.759000",
  "users": [
    null
  ],
  "keywords": [
    "coconut",
    "flour",
    "baking",
    "soda",
    "salt",
    "oil",
    "unsalted",
    "butter",
    "palm",
    "shortening",
    "dairyfree",
    "mini",
    "chocolate",
    "chips",
    "cocoa",
    "honey",
    "milk",
    "eggs",
    "vanilla",
    "ganache",
    "brownies"
  ],
  "directions": [
    "0",
    "Preheat oven to 350°F.Lightly oil an 8x8-inch baking dish; set aside.",
    "In a small bowl, mix together the coconut flour, baking soda and salt; set aside.",
    "Place the coconut oil and butter (or palm shortening) in a small saucepan and melt over low heat. Add the chocolate chips, cocoa powder and honey. Stir the mixture until the chocolate chips begin to soften. Then, remove from heat and continue stirring until the chocolate chips are completely melted and the mixture is well combined. Set aside to cool.",
    "In a large bowl, add the coconut milk, eggs and vanilla. Whisk together until well combined. Then, slowly whisk in the cooled chocolate mixture, using a rubber spatula to get all of the chocolate mixture out of the saucepan.",
    "Next, sift the dry ingredients into the wet while whisking vigorously. Continue whisking until no lumps remain. Allow the batter to rest about 5 minutes so the coconut flour can absorb some of the liquid. Then, pour the brownie batter into the prepared baking dish.",
    "Bake for approximately 25 minutes, just until a toothpick inserted into the center comes out clean. Remove from oven and allow bars to cool completely in the baking dish. For an ultra-chocolatey treat, top with my decadent Chocolate Ganache ."
  ],
  "ingredients": [
    "0",
    "1/2 cup coconut flour",
    "1/4 teaspoon baking soda",
    "1/4 teaspoon sea salt",
    "1/3 cup coconut oil",
    "1/4 cup unsalted butter (or palm shortening)",
    "1/2 cup dairy-free mini chocolate chips",
    "1 tablespoon cocoa powder",
    "1/2 cup honey",
    "1/2 cup coconut milk",
    "2 large eggs",
    "1 teaspoon pure vanilla extract",
    "Optional: Chocolate Ganache for topping brownies"
  ],
  "__v": 1
}