{
  "hash": "cd9640b4a61db693ea0d42a6d13a45fadbf9f183",
  "title": "Baharat-Spiced Sufganiyot with Espresso Fudge",
  "image": "http://prodstatics3cdn1.tastingtable.com/images/articles/2014_12/Web-Article-Sufganyah-Doughnuts-Donut-Jelly-Chocolate-Hannukah-Cooking-Recipe-Fried-Dough.jpg",
  "href": "http://www.tastingtable.com/entry_detail/national/18507/recipes_home/How_to_Make_Baharat_Spiced_Sufganiyot_with_Espresso_Fudge.htm",
  "firstAdded": "2014-12-19T20:20:26.570000",
  "users": [
    null
  ],
  "keywords": [
    "black",
    "peppercorns",
    "paprika",
    "cinnamon",
    "cardamom",
    "nutmeg",
    "granulated",
    "sugar",
    "bread",
    "flour",
    "dry",
    "active",
    "yeast",
    "milk",
    "butter",
    "room",
    "egg",
    "yolk",
    "kosher",
    "salt",
    "lemon",
    "zest",
    "vanilla",
    "canola",
    "oil",
    "frying",
    "allpurpose",
    "cream",
    "light",
    "brown",
    "cocoa",
    "semisweet",
    "chocolate",
    "chips",
    "orange",
    "shots",
    "brewed",
    "espresso"
  ],
  "directions": [
    "0",
    "Make the baharat-spiced sugar: Toast the black peppercorns, cumin seeds, coriander seeds and cloves in a small skillet over medium heat until fragrant, 2 to 3 minutes. Remove from the heat and let the spices cool. Transfer the spices along with the paprika, cinnamon, cardamom and nutmeg to a splice blender and pulse until smooth. Makes ¼ cup.",
    "In a large bowl, combine the sugar with 2 teaspoon baharat spice mix and set aside.",
    "Make the sufganiyot: Combine the bread flour and dry active yeast in a mixing bowl and set aside.",
    "In another mixing bowl, combine the remaining ingredients; set aside.",
    "Place the dry ingredients in the bowl of a stand mixer. Add the wet ingredients and mix on low for 10 to 12 minutes until the dough comes together and looks like a shaggy ball.",
    "Spray the bottom of a large bowl with nonstick spray. Place the dough inside and cover it with a damp kitchen towel. Set the bowl in a warm part of the kitchen for 45 minutes. Remove the dough and gently fold over 3 times. Place the dough back in the bowl; cover and place in a warm place for an additional 45 minutes.",
    "Meanwhile, make the hot espresso fudge: In a small saucepan over medium-low heat, melt the butter. Whisk in the flour until well incorporated. Add the cream, salt, sugars, cocoa powder and vanilla extract and bring to simmer. Cook, whisking frequently, until thickened, 2 to 3 minutes. Add the chocolate chips, orange zest and espresso and whisk until the chocolate is melted and the sauce is smooth and glossy, another 2 minutes.",
    "Remove the dough and place on a lightly floured work surface. Roll dough out to ¼-inch-thick rectangle and cut out circles using a 2-inch ring mold. Place the rounds on a parchment-lined baking sheet; cover with a damp kitchen towel and let sit for 15 minutes.",
    "Meanwhile, pour enough oil into a 6-quart Dutch oven or heavy-bottomed pot until it reaches a depth of 3 inches. Heat the oil until a deep-fry thermometer reads 350°.",
    "Fry the doughnuts in batches of 4 or 5 until golden brown on both sides, 2 to 3 minutes. Remove the doughnuts using a slotted spoon and toss with the baharat-spiced sugar while still warm.",
    "Serve the warm doughnuts with the fudge dipping sauce on the side."
  ],
  "ingredients": [
    "0",
    "1 tablespoon whole black peppercorns",
    "1 teaspoon whole cloves",
    "1½ tablespoons sweet paprika",
    "1 teaspoon ground cinnamon",
    "¼ teaspoon ground cardamom",
    "¼ teaspoon ground nutmeg",
    "½ cup granulated sugar",
    "1¾ cups bread flour",
    "1 tablespoon dry active yeast",
    "½ cup whole milk",
    "3 tablespoons butter at room temperature",
    "1 large egg",
    "1 egg yolk",
    "½ teaspoon kosher salt",
    "½ teaspoon lemon zest",
    "¼ teaspoon vanilla extract",
    "Canola oil, for frying",
    "1 tablespoon butter",
    "1 tablespoon all-purpose flour",
    "¾ cup heavy cream",
    "1/8 teaspoon kosher salt",
    "¼ cup granulated sugar",
    "¼ cup light brown sugar",
    "¼ cup cocoa powder",
    "½ teaspoon vanilla extract",
    "2 tablespoons semisweet chocolate chips",
    "¼ teaspoon orange zest",
    "4 tablespoons or 2 shots freshly brewed espresso"
  ],
  "__v": 1
}