{
  "hash": "f138af70a4054159a1b232d6e0a7b83501e10b79",
  "title": "Fried Bread and Butter Pickles with Buttermilk Chive Dressing",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2013/2/25/0/DV1602H_fried-bread-and-butter-pickles-with-buttermilk-chive-dressing-recipe_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/fried-bread-and-butter-pickles-with-buttermilk-chive-dressing-recipe.html",
  "firstAdded": "2015-01-24T15:50:27.034000",
  "users": [
    null
  ],
  "keywords": [
    "oil",
    "frying",
    "allpurpose",
    "flour",
    "bread",
    "butter",
    "pickles",
    "recipe",
    "follows",
    "kosher",
    "salt",
    "buttermilk",
    "chive",
    "dressing",
    "pickling",
    "cucumbers",
    "ice",
    "yellow",
    "mustard",
    "seed",
    "red",
    "pepper",
    "apple",
    "cider",
    "vinegar",
    "granulated",
    "sugar",
    "turmeric",
    "sour",
    "cream",
    "bunch",
    "chives",
    "rounds",
    "dill",
    "picked",
    "cracked",
    "black"
  ],
  "directions": [
    "0",
    "Place the vegetable oil in an 8-quart stainless steel soup pot and place on medium heat until the oil reaches 350 degrees F.",
    "Place the flour in a medium mixing bowl and, with a slotted spoon, add the Bread and Butter Pickles to the flour. Coat the pickles with the flour, making sure they are individually coated, as the pickles tend to stick together. This is easy to achieve if done in 2 or 3 small batches. Add the pickles to the hot oil and fry, turning once, until golden brown and crispy on both sides. Drain into a paper-towel-lined mixing bowl to absorb any excess grease. Season with kosher salt. Serve on a small plate with a ramekin of Buttermilk Chive Dressing.",
    "Slice the cucumbers 1/4-inch thick by hand or on a mandoline into large mixing bowl. Toss the cucumbers with the pickling salt and cover with a thin layer of ice. Set aside for 4 hours.",
    "Drain, rinse and drain the cucumbers again. Toss the drained cucumbers with the mustard seed and crushed red pepper. Transfer to a storage container, leaving enough room for the brine.",
    "Make the brine by combining the vinegar, 4 cups water, the sugar and turmeric in a nonreactive saucepot. Brine to a boil and pour over the cucumbers. Let cool to room temperature before storing in a refrigerator for 3 weeks before using.",
    "In a small mixing bowl, add the sour cream, buttermilk and apple cider vinegar and whisk until the ingredients are incorporated. Add the chives, dill, sugar, and salt and pepper to taste and stir once more. Cover and store in the refrigerator until ready to use. For best results, do a day or two ahead of time before using.",
    "This recipe was provided by a chef, restaurant or culinary professional and may have been scaled down from a bulk recipe. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results.",
    "Recipe courtesy Andrew Donovan, The Brine and Bottle"
  ],
  "ingredients": [
    "0",
    "1 gallon vegetable oil, for frying",
    "1 pound all-purpose flour",
    "Bread and Butter Pickles, recipe follows",
    "Kosher salt",
    "Buttermilk Chive Dressing, recipe follows",
    "3 pounds pickling cucumbers",
    "2 tablespoons pickling salt",
    "Ice",
    "2 teaspoons whole yellow mustard seed",
    "2 teaspoons crushed red pepper flakes",
    "4 cups apple cider vinegar",
    "1 cup granulated sugar",
    "1 teaspoon turmeric",
    "1 cup sour cream",
    "4 ounces buttermilk",
    "2 ounces apple cider vinegar",
    "1 bunch fresh chives, cut into small rounds",
    "1 bunch fresh dill, picked and finely chopped",
    "1 tablespoon granulated sugar",
    "Kosher salt and cracked black pepper"
  ],
  "__v": 1
}