{
  "hash": "4d835c5db3ce29f4c0011f6e9ead1b1705fe1ea8",
  "title": "TEMPEH 'CRAB' CAKES WITH HORSERADISH-DILL MAYO",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2013/11/Tempeh-Crab-Cakes-1066x800.jpg",
  "href": "http://www.onegreenplanet.org/plant-based-recipes/tempeh-crab-cakes-with-horseradish-dill-mayo/",
  "firstAdded": "2015-01-08T13:23:49.716000",
  "users": [
    null
  ],
  "keywords": [
    "flaxseed",
    "mixed",
    "tbs",
    "water",
    "tempeh",
    "safflower",
    "oil",
    "divided",
    "bell",
    "pepper",
    "stalks",
    "celery",
    "scallions",
    "reserve",
    "greens",
    "clove",
    "garlic",
    "vegan",
    "mayonnaise",
    "parsley",
    "zest",
    "lemon",
    "juice",
    "baking",
    "glutenfree",
    "worcestershire",
    "tamari",
    "balsamic",
    "vinegar",
    "dry",
    "mustard",
    "old",
    "bay",
    "seasoning",
    "kelp",
    "dulse",
    "salt",
    "cayenne",
    "corn",
    "flake",
    "bread",
    "crumbs"
  ],
  "directions": [
    "0",
    "Steam the tempeh – 20 minutes in a steamer or 5 minutes in the microwave. Let cool.",
    "Meanwhile, combine the flaxseed with the water. Mix and let stand for 10 minutes. This is your binder. Heat 1 Tbs. oil in a large skillet. Saute the bell pepper, celery, scallions and garlic until softened, about 5 minutes. Transfer to a large mixing bowl and let cool. Wipe the skillet clean.",
    "Crumble the tempeh into a bowl. It should look like tiny pebbles. Add the vegetables along with the mayo, parsley, lemon zest, and lemon juice. Add the baking powder, Worcestershire sauce, flax gel and seasonings to the bowl and mix (with your hands is best) until everything is well combined and you have a relatively smooth mix with no big chunks of anything. Add the bread crumbs and mix again until smooth. Check the mixture to see that you have a consistency that will hold together. If the mixture feels too loose, add more crumbs, up to another ¼ cup. Cover and refrigerate the tempeh mix for at least 30 minutes; the longer, the better. Note: you could use a food processor but the cakes won’t look as pretty on the inside.",
    "Divide the mixture into cakes. The cakes should be smaller in diameter and thicker than a burger patty. Let the cakes rest for a few minutes so they can set. This will help them absorb moisture and hold together better. This recipe makes about 6 average-sized cakes or 8 small ones.",
    "Heat the remaining Tbs. of oil to the skillet. Cook the cakes on medium-high heat until they are golden brown, about 4 minutes on each side. Be sure to flip them very gently so they don’t break apart.",
    "Serve while hot with my Horseradish-Dill Mayonnaise and lemon slices or wedges."
  ],
  "ingredients": [
    "0",
    "1 Tbs. flaxseed mixed with 3 Tbs. warm water",
    "One 8 oz. package of tempeh",
    "2 Tbs. safflower oil, divided",
    "1 bell pepper, finely chopped",
    "2 stalks celery, finely chopped",
    "3 scallions, finely chopped (reserve some greens for garnish)",
    "1 clove garlic, minced",
    "¼ cup Vegan mayonnaise",
    "2 Tbsp. fresh parsley, chopped",
    "Zest of one lemon",
    "Juice of ½ a lemon",
    "1 Tbs. baking powder",
    "1 tsp. gluten-free Vegan Worcestershire sauce OR",
    "½ tsp. gluten-free tamari and ½ tsp. balsamic vinegar",
    "2 tsp. dry mustard",
    "1 Tbs. Old Bay Seasoning",
    "2 tsp. kelp or dulse flakes",
    "1 tsp. garlic powder",
    "Salt and pepper to taste",
    "A dash of cayenne pepper",
    "1/3 – ½ cup corn flake crumbs or gluten-free bread crumbs"
  ],
  "__v": 1
}