{
  "__v": 2,
  "directions": [
    "0",
    "Preheat the oven on 420ºF/220ºC. Trim the cauliflowers into large florets and try to peel off as much tough fibers on the stems as possible. Take half of the large florets, and cut off the “mini” florets at the tips. Basically what I will be left with is a lot of mini cauliflowers with a few big stems. Evenly spread the mini florets on a baking dish and toss with extra virgin olive oil, salt, black and white pepper and Parmigiano cheese. Bake in the oven until golden-browned and soft.",
    "Meanwhile, transfer the stems and the rest of the large florets in a food processor, and pulse until chopped into very tiny pieces (the size of chopped garlic). These pieces need to be very tiny. Tiny enough that they will melt into the risotto while it’s cooking. Heat up 2 tbsp of olive oil and 1 tbsp of butter in a dutch oven on medium heat, and saute the onion, garlic and thyme with a pinch of salt until translucent but NOT browned. While that’s happening, warm up the chicken stock and salt it (how much? as how I would like my chicken soup). Then hold the arborio rice in a sieve and rinse under cold water for NO MORE THAN 10 sec…",
    "Rinse off the excess starch on the rice JUST A BIT, in terms of creating a better consistency in the final product. If extra creaminess is desired, it can be created by adding a little nub of mascarpone in the end.",
    "Once the onions and etc are translucent, add the arborio rice. Saute the rice in the oil a bit until they start to stick to the pot a little bit. Add the curry powder and chopped cauliflower, and cook slightly, then add 1 cup of chicken stock and 1/2 cup of milk. Turn the heat down to medium low and let the rice simmer in the liquid while stirring occasionally. When the liquid is absorbed by 1/2, TURN OFF the heat and put the lid on. Leave the pot alone for 20 min. At this point, the pot can sit there for 20 min or until whenever the “order” comes in. But I wouldn’t leave it for more than 2 hours. In that case the rice may need to be taken out and spread thinly on a sheet pan. When the “order” comes in, open the lid and turn the heat back on to medium low. Add 1 cup of chicken stock + 1/2 cup of milk at a time and let it simmer. Every time the liquid is absorbed by half, add another 1-cup-chicken-stock+1/2-cup-milk. NEVER let the cooking liquid run dry. The stirring should be occasional, like every 3~5 min, NOT CONSTANT.",
    "From time to time, taste-test the rice. It should still have a bit of bite but not “powdery”. Be very careful now. The rice will go from perfectly cooked to you-just-missed-the-boat mushy in a few seconds. So when the rice is done , make sure there’s enough liquid in the risotto that when the pot is “shaken”, a ripple can run across the surface. AND TURN OFF THE HEAT IMMEDIATELY. Add 2 tbsp of butter and let it melt into the liquid. Top the risotto with the toasted florets and more shaved parmigiano cheese. Sprinkle a few leaves of thyme and serve immediately."
  ],
  "firstAdded": "2014-06-19T15:56:37.685000",
  "hash": "d99d86b74439f886542418bab721d942a5437d4d",
  "href": "http://www.ladyandpups.com/2012/07/06/white-broccoli-risotto-eng/",
  "image": "http://www.ladyandpups.com/wp-content/uploads/2012/07/cauliflower-risotto-4-1024x675.jpg",
  "ingredients": [
    "0",
    "1 Cauliflower",
    "1 1/2 cup of arborio rice",
    "2 tbsp of olive oil",
    "1 tbsp of butter",
    "1 small diced onion",
    "3 cloves of chopped garlic",
    "4 sprigs of thyme",
    "1/4 tsp of curry powder",
    "4 cups of chicken stock, warmed up (might be more than needed but let’s be safe)",
    "2 cups of whole milk (again might be more than actually needed)",
    "2 tbsp of butter to be melted at the end",
    "Parmigiano cheese",
    "Salt and pepper"
  ],
  "keywords": [
    "cauliflower",
    "arborio",
    "rice",
    "olive",
    "oil",
    "butter",
    "onion",
    "garlic",
    "sprigs",
    "thyme",
    "curry",
    "chicken",
    "stock",
    "warmed",
    "needed",
    "lets",
    "safe",
    "milk",
    "actually",
    "end",
    "parmigiano",
    "cheese",
    "salt",
    "pepper"
  ],
  "title": "“WHITE BROCCOLI” RISOTTO",
  "users": [
    null
  ]
}