{
  "hash": "8e518bc4ec103929b12b93a1728804192ae0ad4e",
  "title": "S'mores Bars",
  "image": "https://princesspinkygirl.com/wp-content/uploads/2016/07/Smores-Bars-square-featured-200x200.jpg",
  "href": "https://princesspinkygirl.com/smore-bars/?fbclid=IwAR3z5I0UMvPdCLXnNLKXK-tAMZbCth4ubsuHJUBuqfw3gwpVoCZON-W0t9E",
  "extension": "Chrome",
  "firstAdded": "2020-04-26T17:29:11.651000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 degrees",
    "Grease 9x13 pan with non-stick butter spray",
    "In a medium size bowl mix graham cracker crumbs, powdered sugar and butter with a spoon (see note below regarding the melted butter and the crust).",
    "Place mixture in the bottom of the baking pan. Distribute the mixture evenly and press down and firmly with your fingers to \"pack it\" along the bottom and sides of the pan.",
    "Place in oven and bake for approx. 5-8 minutes (just until sides begin to get a bit golden brown)",
    "Remove from oven and let cool.",
    "Lay the Hershey bars on top of the graham cracker mixture - covering up all of the graham cracker as completely as possible.",
    "Place in over for approx. 3 minutes (until chocolate just begins to melt and gets shiny)",
    "Let cool for 1-2 min.",
    "Place marshmallows on top of the chocolate - pack them in their closely next to each other.",
    "Turn oven to \"broil\" - put pan into oven and STARE at them! They only need to be in there for about 2 minutes. BUT, every oven is different! Watch them like a hawk or they will burn and set on fire (I am not kidding here - learn from my experience!!) As soon as they begin to brown, take them out of the oven.",
    "Let them cool completely (after they initially cooled, I place them in the refrigerator to set even more - this will make them easier to cut)",
    "Cut and serve - (tip: they can get really sticky to cut, warm a sharp knife under hot water, dry it off and immediately slice them - you may want to repeat this if the knife starts to get sticky!)"
  ],
  "ingredients": [
    "0",
    "2 Cups graham cracker crumbs",
    "8-12 Tablespoons butter (melted)",
    "1/2 Cup powdered sugar",
    "4 Hershey Chocolate Bar (use 4.4 ounce bars)",
    "1 package mini marshmallows"
  ],
  "__v": 1
}