{
  "hash": "5fd10bad5a007970f9f4d973b102202ef9a5fbf5",
  "title": "The BEST Healthy Paleo Banana Bread",
  "image": "https://1.bp.blogspot.com/-3K5j4VwzELo/VBozhZJkC9I/AAAAAAAAMog/ShbMInyBYLc/s280/Healthier%2BPaleo%2BBanana%2BBread.jpg",
  "href": "http://www.southerninlaw.com/2014/09/the-best-healthy-paleo-banana-bread-recipe-low-fat-gluten-free.html?m=1",
  "extension": "Chrome",
  "firstAdded": "2017-01-04T17:59:11.483000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat your oven to 170C/340F.",
    "Grease and line a small loaf tin (we used this 21cm x 7.5cm deep loaf tin) and set aside.",
    "In a medium mixing bowl, mash your bananas and add in your honey, vanilla, melted butter/coconut oil, applesauce and eggs.",
    "Mix in your coconut flour, baking soda and almond meal and allow to sit for two minutes. The mix will look really runny at first, but the coconut flour will soon absorb the liquid and form a thicker batter. It's more of a pancake batter consistency than a thick cake batter, however, if your mix is extremely liquidy, add in coconut flour one teaspoon at a time (I don't recommend doing this unless your coconut flour is not very absorbent - if you use this coconut flour you'll have a perfect batter!)",
    "Pour your banana bread mixture into your prepared loaf tin and bake for 40 minutes to an hour (keep an eye on it - cooking times will depend on your pan size) or until your loaf is cooked through and a skewer inserted into the middle removes clean.",
    "If your banana bread is browning too quickly but isn't cooked in the middle, cover it with foil.",
    "Allow to cool completely before slicing.",
    "We find this banana bread keeps best in a sealed container in the refridgerator and it will keep for up to a week. You can also freeze the slices by wrapping the slices individually and storing them in a sealed zip lock bag in the freezer."
  ],
  "ingredients": [
    "0",
    "The BEST Healthy Paleo Banana Bread Recipe makes 1 small loaf/9-10 slices",
    "lower fat, lower sugar, grain free, paleo, refined sugar free",
    "1 cup + 1 tbsp (250g/2 medium bananas) ripe mashed banana",
    "2 1/2 tbsp (50g) honey",
    "2 tsp (10ml) vanilla extract",
    "3 1/2 tbsp (50g) butter or coconut oil, melted",
    "1/4 cup (60g) unsweetened applesauce",
    "4 eggs (~200g)",
    "1/2 cup (55g) coconut flour (I recommend this one for the best results!)",
    "1/2 cup (50g) almond meal",
    "3/4 tsp baking soda"
  ],
  "__v": 1
}