{
  "hash": "38f32ab22903a50d755775ef12c0ffd881643256",
  "title": "CHILI LIME SHRIMP BOWLS",
  "image": "https://www.budgetbytes.com/wp-content/uploads/2012/03/ChiliLimeShrimpBowlsabove-200x200.jpg",
  "href": "https://www.budgetbytes.com/chili-lime-shrimp-bowls/",
  "extension": "",
  "firstAdded": "2020-02-23T14:27:04.756000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Begin by marinating the shrimp. Prepare the marinade by combining the chili powder, honey, and soy sauce with the juice of one lime, one clove of minced garlic, and one teaspoon of vegetable oil. Rinse the shrimp and shake off excess water. Add the marinade, stir to coat, and refrigerate until ready to cook.",
    "Begin to cook the rice. Combine 2 cups of dry rice with four cups of water. Cover and bring to a boil over high heat. As soon as it reaches a full boil, turn the heat down to the lowest setting and let simmer for 20 minutes. After 20 minutes, turn the heat off and leave it covered until ready to serve. Fluff with a fork just prior to serving.",
    "Prepare the seasoned black beans. Add 1 tablespoon of vegetable oil to a medium pot and add two cloves of minced garlic and one seeded and minced jalapeno. Saute for about one minute and then add the cumin. Saute for one minute more and then add the black beans. Stir and heat through.",
    "Prepare the pineapple salsa. Drain the can of crushed pineapple well. Cut the red onion into a small dice. Remove the seeds from the jalapeno and cut it into a small dice. Roughly chop 1/4 bunch of cilantro. Combine the pineapple, jalapeno, red onion, cilantro, the juice of one lime, and 1 tsp of salt in a bowl. Stir until combined. Taste and adjust the salt and cilantro as desired.",
    "To cook the shrimp heat a large skillet over a medium flame. Add the shrimp and all of the marinade. Cook just until the shrimp is opaque and has curled up. Remove the shrimp from the skillet and continue to let the marinade simmer until it has reduced and thickened (about five minutes more). Pour the thickened marinade back over the shrimp and stir to coat.",
    "Build the shrimp bowls. Place one cup of rice in the bottom of a bowl. Top with about 3/4 cup seasoned black beans and about 1/2 cup of pineapple salsa. Place 7 or 8 shrimp on top. Garnish with extra cilantro if desired. Dig in!"
  ],
  "ingredients": [
    "0",
    "1 lb peeled shrimp (40-50) ($5.43)",
    "1 tsp chili powder ($0.05)",
    "1 Tbsp + 1 tsp vegetable oil, divided ($0.04)",
    "1 tsp honey ($0.05)",
    "1 tsp soy sauce ($0.07)",
    "3 cloves garlic, divided ($0.24)",
    "2 medium limes ($0.68)",
    "2-15 oz cans black beans** ($1.12)",
    "1/2 tsp cumin ($0.03)",
    "2 medium jalapeños ($0.22)",
    "20 oz can crushed pineapple ($1.23)",
    "1/2 small red onion ($0.32)",
    "1 tsp salt ($0.05)",
    "1/4 bunch cilantro ($0.21)",
    "2 cups long grain rice ($0.71)"
  ],
  "__v": 1
}