{
  "hash": "3d1cdcb4f6c2ffd0780f1bfcb4ce65ff31e7d6c9",
  "title": "red curry noodles",
  "image": "https://pinchofyum.com/wp-content/uploads/Curry-Noodle-Stir-Fry-Chopsticks-600x900.jpg",
  "href": "https://pinchofyum.com/red-curry-noodles",
  "extension": "Chrome",
  "firstAdded": "2019-02-07T22:01:07.036000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Noodles: Boil for 3-5 minutes (depending on thickness). Drain and set aside.",
    "Garlic and Ginger: Heat the olive oil over medium heat. Add the garlic and ginger. Saute until soft and fragrant.",
    "Tofu and Vegetables: Give your tofu a quick press with paper towels to get extra water out. Add the curry paste, tofu, and the vegetables to the pan. Stir gently, and saute until the everything is almost starting to caramelize a little bit – about 10 minutes.",
    "Sauce: Add the coconut milk, soy sauce, sugar, and chili paste. Throw in your cilantro.",
    "Finish: Add the cooked noodles and toss to combine. YUM!",
    "NOTES",
    "Vegetables: You can kind of use anything here. Fresh, frozen, whatever. I usually like mushrooms, spinach, bell peppers, broccoli, and carrots. I have used both fresh and frozen – but frozen is especially handy if you’re short on time because there’s zero chopping!",
    "Sugar: Sugar is optional. I do find that the whole thing tastes better with a little sweetness, but I’ve also made it without sugar during Sugar Free January, and that was good, too! I just add a little more hot sauce and soy sauce to get a little more bang.",
    "Noodles: I like to use Pad Thai-shaped noodles. I use brown rice noodles during Sugar Free January. I usually buy the Thai Kitchen or Lotus brands. For more al dente noodles and a less sticky dish overall, soak them in warm water for 30 minutes instead of boiling! I prefer boiling them because I like the sticky, saucy texture."
  ],
  "ingredients": [
    "0",
    "8 ounces stir fry rice noodles",
    "2 tablespoons olive oil",
    "2 cloves garlic, minced",
    "1 thumb-size piece of ginger, peeled and grated",
    "14 ounces extra firm tofu, cubed",
    "3 tablespoons red curry paste",
    "4 cups stir fry vegetables (see notes)",
    "1 (14-oz) can coconut milk",
    "2 tablespoons soy sauce",
    "2 tablespoons sugar",
    "1 tablespoons sriracha or chili paste",
    "a handful of cilantro, chopped"
  ],
  "__v": 1
}