{
  "hash": "dccda598a45159c091d0cec0a4a09fb945e42924",
  "title": "Healthy baked chicken tenders",
  "image": "http://sarahlipoff.com/wp-content/uploads/2012/07/So-says-Sarah2.jpg",
  "href": "http://sarahlipoff.com/2014/01/22/healthy-baked-chicken-tenders/",
  "extension": "Chrome",
  "firstAdded": "2015-03-12T01:04:06.410000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "tenders",
    "plain",
    "yogurt",
    "mustard",
    "salt",
    "pepper",
    "corn",
    "starch",
    "panko",
    "bread",
    "crumbs",
    "italian",
    "seasoning",
    "sunflower",
    "oil"
  ],
  "directions": [
    "0",
    "Toss the chicken tenders in a plastic bag along with the yogurt and mustard. Give things a dash of salt and pepper and toss in the fridge for at least 20-minutes or up to an hour. If you like things spicy, add a few drops of your favorite hot sauce.",
    "Mix together the corn starch and panko crumbs in another big zip-top baggie. Sprinkle in the Italian seasoning and you are ready to shake. Corn starch has less calories than white flower and crisps up wonderfully. You could also use whole-wheat or almond flour instead.",
    "Preheat your oven to 425˚F and drizzle the oil around a sheet pan. Take the happily marinated chicken from the fridge, toss a few at a time in the corn starch/flour and panko mixture, and then place on the sheet pan. Keep going until all are coated and ready to go.",
    "Once coated, place on the sheet pan. Try not to cluster, which causes the tenders to steam and kind of turn out like mush. For extra crispiness, place the oil-coated sheet pan in the oven for a couple of minutes before adding the tenders. They’ll hit the pan with a sizzle, which is awesome.",
    "Pop the chicken tenders in the oven and toast for 7 to 10-minutes and then flip. If your pan seems a bit dry, drizzle a bit more oil to help your chicken crisp. Cook for another 7 to 10-minutes, or until the other side is nicely browned."
  ],
  "ingredients": [
    "0",
    "1 lb chicken tenders",
    "1/2 cup plain yogurt",
    "1 tablespoon mustard",
    "Dash salt and pepper",
    "1/2 cup corn starch",
    "1 cup Panko crumbs (or plain bread crumbs)",
    "1 teaspoon Italian seasoning",
    "2 tablespoons sunflower oil"
  ],
  "__v": 1
}