{
  "hash": "5f326e53e61d5dd4175ad212782dc0fe0809a77e",
  "title": "Food 52's Hanukkah Churros",
  "image": "http://a.abcnews.com/images/Entertainment/ht_hanukkah_churros_nt_121204_ms.jpg",
  "href": "http://abcnews.go.com/GMA/recipe/hanukkah-churros-17849281?nwltr=GMAR_tryPic_pos2",
  "firstAdded": "2014-12-19T19:58:49.712000",
  "users": [
    null
  ],
  "keywords": [
    "churros",
    "sugar",
    "unsalted",
    "butter",
    "allpurpose",
    "flour",
    "eggs",
    "vanilla",
    "cinnamon",
    "oil",
    "deepfrying",
    "sauces",
    "nutella",
    "cream",
    "frozen",
    "strawberries",
    "hulled",
    "juice",
    "lemon",
    "sweetened",
    "condensed",
    "milk"
  ],
  "directions": [
    "0",
    "Cooking Directions",
    "To make the churros: Put 1 cup water, 2 tablespoons of the sugar, and the butter in a small saucepan. Bring to a boil. Reduce the heat and add the flour, beating it in quickly and firmly with a whisk until a ball is formed. Take off the heat and use a wooden spoon to mix in the eggs one at a time. Stir in the vanilla extract. Let the dough cool down a bit while you make the sauces. Transfer the dough to a pastry bag fitted with a big star tip. Mix the remaining ?? cup sugar and the cinnamon together in a shallow dish.",
    "To make the Nutella sauce: Warm the Nutella and the heavy cream in a bowl in the microwave for 30 seconds. Continue in 30-second intervals until the Nutella is melted. Or make it on the stove: warm the Nutella and the heavy cream in a small saucepan over medium-low heat, stirring occasionally, until smooth and melted. Mix well and serve warm.",
    "To make the strawberry sauce: Put the strawberries and sugar in a small saucepan and cook over medium heat for about 10 minutes. The sugar should dissolve and the strawberries should soften and break down. Transfer the mixture to a food processor, add the vanilla and lemon juice, and process until very smooth. Set aside to cool.",
    "You can serve the sweetened condensed milk as is or heat it in a saucepan over medium heat for 10 to 15 minutes, stirring constantly, until golden brown. Serve warm.",
    "Heat the oil in a large heavy saucepan (the oil should be about 2 inches deep) until very hot but not smoking; to test it, add a cube of bread to the oil, it should brown in 30 seconds. Squeeze the dough into the hot oil in sections of about 4 inches. Cook 4 to 5 churros at a time, making sure not to crowd the pan. Fry the churros for 2 to 3 minutes on each side, until they puff up and turn deep golden brown. Use a slotted spoon to remove the churros from the oil and drain on paper towels. Roll the churros in the cinnamon sugar and serve immediately, with the sauces on the side."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "For the churros:",
    "1/2 cup plus 2 tablespoons sugar",
    "4 tablespoons unsalted butter",
    "1 cup all-purpose flour",
    "3 large eggs",
    "2 teaspoons vanilla extract",
    "2 teaspoons ground cinnamon",
    "Vegetable oil for deep-frying (about 3 cups)",
    "For the sauces:",
    "3/4 cup Nutella",
    "1/4 cup heavy cream",
    "1 1/2 cups frozen strawberries (or hulled fresh)",
    "2 tablespoons sugar",
    "1 teaspoon vanilla extract",
    "Juice from 1/2 lemon",
    "1 cup sweetened condensed milk"
  ],
  "__v": 1
}