{
  "hash": "773a95e83549f3ca760429aad2d1c503d7badbfe",
  "title": "One Pot Saucy Creamy Mac and Cheese",
  "image": "https://www.recipetineats.com/wp-content/uploads/2015/01/DSC_0005-150x150.jpg",
  "href": "https://www.recipetineats.com/one-pot-saucy-creamy-mac-cheese/",
  "extension": "Chrome",
  "firstAdded": "2018-01-25T01:54:03.021000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Preheat the oven to 180C/350F.",
    "Melt the butter in a deep fry pan or skillet (Note 4) over medium heat. (Note 5)",
    "Add the flour and stir until combined so a thick paste forms (\"roux\"). Cook, stirring constantly, for 1 minute.",
    "Add half the milk and use a whisk to dissolve the roux into the milk. It will thicken quickly, then add the remaining milk. Whisk in small circles, rotating around the pan, to dissolve all the roux into the milk.",
    "Add the water, salt and 5 grinds of pepper, then turn the heat up to medium high. Whisk leisurely so the bottom doesn't stick to the pan. When the white sauce starts to steam and thickens such that you can see it coating the edges of the pan (around 2 to 3 minutes), add the macaroni.",
    "Turn the heat down to medium and stir gently with a wooden spoon to mix the macaroni through and ensure the bottom doesn't stick. Cook it for 1 minute. Be sure not to cook it for longer than this after adding the macaroni - this really impacts the \"sauciness\" of the dish and ensuring the macaroni isn't overcooked.",
    "Cover the fry pan (Note 6), then transfer it immediately to the oven on the middle shelf.",
    "Bake for 12 minutes, then remove from the oven. It will seem like there is too much sauce but it reduces and thickens in the next steps. The pasta should be just cooked (al dente). It will continue cooking from the residual heat.",
    "Turn the oven off and turn the grill/broiler on high.",
    "Stir through the cheese, just enough to disperse it through the macaroni. As you stir, this will melt the cheese and thicken the sauce. Don't stir too much because otherwise the sauce will thicken too much due to the evaporation.",
    "Sprinkle over the panko and parmesan cheese, then place under the grill/broiler for a few minutes to brown.",
    "Remove from the grill/broiler and let it rest for 5 minutes before serving.",
    "Recipe Notes",
    "1. If you change the cheese you use, you may need to adjust the amount of salt. For example, if you use gruyere instead of cheddar or tasty cheese, you may need to increase the salt a touch because gruyere is not as salty. If you use mozzarella instead of provolone, you will probably need to add a pinch of salt because provolone is saltier.",
    "2. This recipe is very sensitive to different types of pastas. It will work well with any pasta like macaroni, spirals, small shells etc that cook in around 9 to 10 minutes in boiling water (per packet instructions). However, it won't work with pastas like penne which take around 13 minutes in boiling water because it absorbs more water and takes much longer to cook than this recipe directs so you will end up with a far less saucy Mac and Cheese.",
    "Risoni and spaghetti cook too quickly so you'll end up with far too much sauce. You can experiment and adjust the water and roux quantities if you wish, to make this with other pastas.",
    "3. Make sure you get Provolone Dolce, not Provolone Piccante. Dolce is the one that is kind of soft - when you squeeze it, it's like a rubber ball and it has melting qualities of mozzarella cheese. In Australia, you can get it from Harris Farms and it is not that expensive - around $20/kg ($10/lb), and you only need 75k / 2.5 oz. Piccante is harder, much sharper and more like parmesan cheese.",
    "4. The fry pan I used was 26cm / 10\" in diameter and 6cm/2.4\" deep. It was JUST big enough for this recipe. Spillage during cooking was not the risk because this sauce doesn't splatter or bubble, but I had to be quite careful when stirring.",
    "It works better with a slightly deeper skillet / fry pan or a large casserole pot.",
    "5. If you are using a very heavy based one or a strong gas stove, you may need to turn the heat down to medium low so the butter and roux doesn't brown. Mac and Cheese is not meant to have brown sauce!",
    "6. I don't have a lid for my fry pan. I just use the lid for a large pot. If I make this in a skillet, I use foil.",
    "7. This nutrition is for 6 servings. No, it's not the healthiest dish in the world. Yes, you should wear your stretchy jeans."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "4 tbsp unsalted butter",
    "6 tbsp flour",
    "3 cups of milk (full or low fat - I used low fat)",
    "2 cups of water",
    "1 tsp salt (Note 1)",
    "Black pepper",
    "1/2 lb / 250g dried macaroni (elbow pasta) (Note 2)",
    "2 cups (150g / 5oz) grated tasty or cheddar cheese (or any sharp, flavoured cheese that melts well)",
    "1 cup (75g / 2.5 oz) grated provolone dolce cheese (or mozzarella or other mild flavoured good melting cheese) (Note 3)",
    "Topping",
    "1/4 cup panko breadcrumbs (or ordinary breadcrumbs)",
    "1/4 cup parmesan cheese , grated",
    "1/2 tbsp fresh parsley , finely chopped (optional)"
  ],
  "__v": 1
}