{
  "hash": "9941c1e63526fe93aaf4f945444d311a65be3692",
  "title": "Savoury Pastry",
  "image": "https://www.mykitchenstories.com.au/wp-content/uploads/2017/07/Pastry-repairs-733x1100.jpg",
  "href": "https://www.mykitchenstories.com.au/how-to-make-basic-savoury-pastry/",
  "extension": "Chrome",
  "firstAdded": "2020-04-03T00:32:05.346000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "C/ 350 F . 10 degrees less for a fan forced oven",
    "Put the flour, butter and salt into the bowl of the food processor and blitz till it resembles fine breadcrumbs,",
    "Mix the egg and milk till it measures up to 100 ml",
    "Pour it into the food processor and mix till the dough comes together and forms a ball then turn off and empty onto the bench. ( if you are sure at this stage it is dry and bread crumb like and you have blitzed it properly, add only a teaspoon of liquid. You can add it in- you can't take it out!)",
    "Push the dough together. It should be mixed enough however if it is dry and is hard to press into a ball, wet your hands and give it another try. You can work it together gently.",
    "Flatten into a disc, wrap in plastic and refrigerate for at least 30 minutes ( or up to 2 days). When ready to roll, take it out of the fridge and sprinkle a bench with a little flour. Start rolling from the middle outwards turning and moving so it doesn't stick. You don't need lots of flour. Run your knife under the pastry and turn. Roll out to the size you need. Then fold in half and lift into your tart tin. Try to make sure the pastry is not too thick. Thinner pastry is much better.",
    "Push into the corners of the tin and trim around the edges. Pop this back into the fridge to chill for 30 minutes or up to 2 days covered.",
    "When ready to bake put onto a tray and fill with paper and baking beans. Bake for 15 minutes or until the pastry is starting to set and cook. The edges will be a little browner than the middle. remove the baking paper and beans ( check for splits and repair if necessary).",
    "Return to the oven again for 15-20 minutes or until the middle of the tart case is cooked and golden.",
    "Take out and cool then trim the edges. Cut outwards with a sharp paring knife.",
    "Your pastry is now ready to fill.",
    "Notes",
    "I like a very crispy cooked base and do this even if I am filling and adding a top. I just fill and egg wash around the top edge before covering with pastry, and pressing the cooked and raw together before baking.)"
  ],
  "ingredients": [
    "0",
    "300 gm plain flour 10.58 oz",
    "150 gm unsalted butter chilled cut into cubes",
    "1/4 teaspoon salt",
    "1 Egg",
    "80 ml milk (enough to measure up to 100 ml when added to the egg)"
  ],
  "__v": 1
}