{
  "hash": "0f4b8c239ec1ad8122eb9d75b998b21444720503",
  "title": "Ham and Onion cheese roll",
  "image": "http://4.bp.blogspot.com/-G6e3jpqyDdw/UrVhPeD0xOI/AAAAAAAAPSg/E8Ptc27DvK0/s640/Ham+and+onion+cheese+rolls+3.jpg",
  "href": "http://dailydelicious.blogspot.com.au/2014/02/ham-and-onion-cheese-roll-have-your.html",
  "firstAdded": "2014-12-26T09:52:20.035000",
  "users": [
    null
  ],
  "keywords": [
    "milk",
    "garlic",
    "unsalted",
    "butter",
    "salt",
    "bread",
    "flour",
    "granulated",
    "sugar",
    "instant",
    "yeast",
    "filling",
    "olive",
    "oil",
    "ham",
    "pieces",
    "onions",
    "caramelised",
    "cheddar",
    "cheese",
    "thyme"
  ],
  "directions": [
    "0",
    "Mix together chopped garlic with half the milk. Warm the other half and add sugar & yeast, leave to foam.",
    "Sift the flours in a bowl, add and salt, whisk to combine. Pour both milk mixture into the bowl.",
    "Use large spoon (or pastry scraper) to mix everything together, and knead briefly to bring all the ingredients together (add more milk if the dough's too dry).",
    "Take the dough out of the bowl and knead, you will see the dough will be elastic after about 2 minutes.",
    "Add the butter and knead by using the heel of your hands to compress and push the dough away from you, then fold it back over itself. Give the dough a little turn and repeat. Put the weight of your body into the motion and get into a rhythm. Keep folding over and compressing the dough. Knead for 10-15 minutes or until the dough is soft, pliable, smooth and slightly shiny, almost satiny.",
    "Put the dough into a light buttered bowl. Let the dough rise in a warm place until double in size (can be 1 hour or 1 hour and a half check often depend on the temperature).",
    "Preheat the oven to 220°C.",
    "Roll the dough into 35cmx25cm rectangle.",
    "Brush with the olive oil, sprinkle ham, cheese (about 2/3 of the cheese) thyme and onion over the dough.",
    "Roll the dough place on the lined baking sheet.",
    "Let the dough rise until almost double in size.",
    "5 minutes before baking, sprinkle the rest of the cheese over the bread.",
    "Bake for 25 minutes until the bread is golden brown."
  ],
  "ingredients": [
    "0",
    "210-220 ml Milk",
    "2 cloves Garlic, chopped",
    "50g Unsalted butter",
    "5g Salt",
    "350g Bread flour",
    "1 tbsp Granulated sugar",
    "1 tsp Instant yeast",
    "Filling and topping",
    "2 tbsp Olive oil",
    "120g Ham, cut into small pieces",
    "2 large onions, caramelised",
    "170g Cheddar cheese, grated",
    "Dried thyme"
  ],
  "__v": 7
}