{
  "__v": 2,
  "directions": [
    "0",
    "Take your cream cheese or Neufchâtel out of the fridge, and let it sit while you quickly brown your meat.",
    "Add the sausage and tortellini to your Crock Pot. Pour the tomatoes, liquid and all, and broth over the top. Add your cream cheese to the Pot in chunks.",
    "Give your Crock Pot a good stir to get everything evenly distributed, making sure the liquids are adequately covering the tortellini.",
    "Cook on LOW for a total of 3 1/2 – 4 hours. Stir at 1 1/2 hours, and again at 3 hours, removing the lid for the last 30 minutes of cooking. This will give the sauce some time to thicken up. You can leave the lid off longer if you need more thickening time, but stir every so often."
  ],
  "firstAdded": "2014-09-22T18:12:55.910000",
  "hash": "72ff3fe606064bfc7cb40ad5e16a9e0bd3b1de5c",
  "href": "http://icecreamwithafork.wordpress.com/2013/08/21/crock-pot-sausage-cheese-tortellini/",
  "image": "http://icecreamwithafork.files.wordpress.com/2013/08/2153.jpg?w=637&h=637",
  "ingredients": [
    "0",
    "1 lb. Italian Sausage (We use HOT for the spice, but sub in the meat you’d like best!)",
    "20 oz. Frozen Three-Cheese Tortellini (The Buitoni kind is in the specialty refrigerated case in the deli area of the grocery store. I pop them right in the freezer when I get home.)",
    "32 oz. Low Sodium Chicken Broth",
    "2 Cans Diced Tomatoes – The kind that are seasoned with basil, garlic & oregano. If you don’t have the seasoned ones, you’ll need to add in your own seasonings.",
    "8 oz. Cream Cheese or Neufchâtel Cheese – We use the low fat kind when using cream cheese.",
    "Grated Parmesan Cheese (not pictured) for topping!"
  ],
  "keywords": [
    "italian",
    "sausage",
    "use",
    "hot",
    "spice",
    "sub",
    "meat",
    "youd",
    "best",
    "frozen",
    "threecheese",
    "tortellini",
    "buitoni",
    "kind",
    "specialty",
    "refrigerated",
    "case",
    "deli",
    "area",
    "grocery",
    "store",
    "pop",
    "right",
    "freezer",
    "home",
    "low",
    "sodium",
    "chicken",
    "broth",
    "tomatoes",
    "basil",
    "garlic",
    "oregano",
    "dont",
    "ones",
    "youll",
    "need",
    "seasonings",
    "neufchtel",
    "fat",
    "using",
    "cream",
    "cheese",
    "parmesan",
    "pictured"
  ],
  "title": "Crock Pot Sausage & Cheese Tortellini",
  "users": [
    null
  ]
}