{
  "hash": "7a66eb11ce85f70e9d84b50f07df263e9b09c441",
  "title": "Authentic Injera (aka Ethiopian Flat Bread)",
  "image": "",
  "href": "http://www.food.com/recipe/authentic-injera-aka-ethiopian-flat-bread-96980",
  "extension": "",
  "firstAdded": "2015-10-30T01:17:03.277000",
  "users": [
    null
  ],
  "keywords": [
    "teff",
    "water",
    "salt",
    "oil",
    "skillet"
  ],
  "directions": [
    "0",
    "Mix ground teff with the water and let stand in a bowl covered with a dish towel at room temperature until it bubbles and has turned sour; This may take as long as 3 days, although I had success with an overnight fermentation; The fermenting mixture should be the consistency of a very thin pancake batter.",
    "Stir in the salt, a little at a time, until you can barely detect its taste.",
    "Lightly oil an 8 or 9 inch skillet (or a larger one if you like); Heat over medium heat.",
    "Pour in enough batter to cover the bottom of the skillet; About 1/4 cup will make a thin pancake covering the surface of an 8 inch skillet if you spread the batter around immediately by turning and rotating the skillet in the air; This is the classic French method for very thin crepes; Injera is not supposed to be paper thin so you should use a bit more batter than you would for crepes, but less than you would for a flapjack pancakes.",
    "Cook briefly, until holes form in the injera and the edges lift from the pan; Do not let it brown, and don't flip it over as it is only supposed to be cooked on one side.",
    "Remove and let cool. Place plastic wrap or foil between successive pieces so they don't stick together.",
    "To serve, lay one injera on a plate and ladle your chosen dishes on top (e.g., a lovely doro wat or alicha). Serve additional injera on the side. Guests can be instructed to eat their meal without utensils, instead using the injera to scoop up their food."
  ],
  "ingredients": [
    "0",
    "1 1⁄2 cups ground teff (180 g)",
    "2 cups water",
    "salt, to taste",
    "vegetable oil, for the skillet"
  ],
  "__v": 1
}