{
  "hash": "b6ed54d06cc80bab4368e77106b1bec5eda84440",
  "title": "salsa criolla:",
  "image": "https://scontent-lga1-1.xx.fbcdn.net/hphotos-xft1/v/t1.0-9/11826038_940519459337414_2365768048519196367_n.jpg?oh=3f4c2935dc4c9bbaa2cca908d241a8c0&oe=5679DD03",
  "href": "https://www.facebook.com/175958982460136/photos/a.401912716531427.92222.175958982460136/940517626004264/?type=1&theater",
  "extension": "Chrome",
  "firstAdded": "2015-08-11T11:25:32.853000",
  "users": [
    null
  ],
  "keywords": [
    "ingredientes",
    "para",
    "preparar",
    "salsa",
    "criolla",
    "tomates",
    "firmes",
    "bien",
    "rojos",
    "morrn",
    "rojo",
    "amarillo",
    "cebolla",
    "mediana",
    "dientes",
    "ajo",
    "perejil",
    "aceite",
    "vinagre",
    "sal",
    "pimienta"
  ],
  "directions": [
    "0",
    "Para preparar la salsa criolla no es preciso alguna cocción, es solamente picar y mezclar. Para que la piel de los tomates se desprenda más fácil, lo mejor es hacer un pequeño corte en la base con forma de cruz.",
    "Luego debes dejarlos unos segundos en un recipiente con agua hirviendo. Ten preparado otro recipiente con agua fría para pasar los tomates, de este modo se evita que se cocinen. Luego solo se debe retirar la piel desde las puntas del corte.",
    "Corta los tomates al medio, saca las semillas y corta en cubos chicos. El mismo procedimiento se debe seguir con los morrones, pero además de las semillas asegúrate de retirar las nervaduras internas (partes blancas).",
    "Lo ideal es que los cubitos del tomate y el morrón picado sean del mismo tamaño. Corta la cebolla también en pequeños cuadrados y los dos dientes de ajo en trozos lo más chicos que puedas.",
    "Mezcla todo en un bowl, agrega sal y pimienta a gusto, una cucharada de aceite y otra de vinagre. Antes de consumir se recomienda dejar reposar en la heladera al menos una hora. Para conservar la salsa criolla debes usar un frasco de vidrio y refrigerar."
  ],
  "ingredients": [
    "0",
    "Ingredientes para preparar salsa criolla",
    "2 tomates firmes y bien rojos",
    "1 morrón rojo",
    "1 morrón amarillo",
    "1 cebolla mediana",
    "2 dientes de ajo",
    "perejil",
    "aceite",
    "vinagre",
    "sal",
    "pimienta"
  ],
  "__v": 1
}