{
  "hash": "b15b7fc8fa14b333c4a836ed4be3c0c114a524d5",
  "title": "Gingery Noodle Sala",
  "image": "http://recipe-folder.com/img/recipe-images/089/605/1098578989.gif",
  "href": "https://food52.com/recipes/81355-gingery-noodle-salad",
  "extension": "Chrome",
  "firstAdded": "2020-02-02T16:43:00.159000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Bring a large pot of water to a boil and salt it. Put the sesame seeds in a medium skillet over medium heat and toast, shaking the pan occasionally, until they are golden and fragrant, 3 to 5 minutes. Transfer to a bowl.",
    "Use a microplane or the smallest holes on a box grater to grate the ginger into a large bowl. Add the scallion whites, soy sauce, lemon juice, and oils, and sprinkle with salt and pepper. Taste and adjust the seasoning.",
    "Stack the snow peas a few at a time and slice them lengthwise into 3 or 4 thin strips. It’s okay if some peas pop out or split; just save them all together. Cut all the remaining pods.",
    "When the water boils, add the pasta and stir. Cook, stirring occasionally, until it’s tender but not mushy; start checking after 5 minutes. When the pasta is ready, stir the snow peas into the pot and immediately drain, shaking off as much excess water as possible (but don’t rinse). Add to the bowl with the dressing and toss gently to coat. Garnish with the scallion greens and sesame seeds, and serve warm or let sit for up to 1 hour and serve at room temperature."
  ],
  "ingredients": [
    "0",
    "Salt",
    "2 tablespoons",
    "sesame seeds",
    "1",
    "2-inch piece fresh ginger, peeled",
    "6",
    "scallions, whites and greens separated and chopped",
    "1/4 cup",
    "soy sauce",
    "2 tablespoons",
    "fresh lemon juice",
    "2 tablespoons",
    "dark sesame oil",
    "2 tablespoons",
    "good-quality vegetable oil",
    "Pepper",
    "1 pound",
    "snow peas, trimmed",
    "8 ounces",
    "whole wheat angel hair pasta, broken in half"
  ],
  "__v": 1
}