{
  "hash": "6b1768c81753cd826a2cb954f7079977622985d6",
  "title": "Vegetable Lasagna Recipe",
  "image": "http://www.inspiredtaste.net/wp-content/uploads/2013/05/Vegetable-Lasagna-Recipe-2.jpg",
  "href": "http://www.inspiredtaste.net/22401/fresh-vegetable-lasagna-recipe/",
  "firstAdded": "2015-01-24T20:42:39.311000",
  "users": [
    null
  ],
  "keywords": [
    "lasagna",
    "noodles",
    "extra",
    "filling",
    "holes",
    "extravirgin",
    "olive",
    "oil",
    "onion",
    "garlic",
    "red",
    "pepper",
    "medium",
    "zucchinis",
    "pieces",
    "yellow",
    "squash",
    "bunch",
    "spinach",
    "jar",
    "roasted",
    "peppers",
    "heaping",
    "tomatoes",
    "generous",
    "basil",
    "leaves",
    "container",
    "wholemilk",
    "ricotta",
    "cottage",
    "cheese",
    "eggs",
    "parmesan",
    "lowmoisture",
    "mozzarella",
    "salt",
    "black"
  ],
  "directions": [
    "0",
    "Heat oven to 350 degrees F (177 degrees C). Lightly oil or spray 13-inch by 9-inch baking dish with non-stick cooking spray.",
    "1",
    "Bring a large pot of salted water to the boil then cook lasagna noodles according to package directions. (We add a couple teaspoons of olive oil to the water so the noodles do not stick together). Drain then lay flat on a sheet of aluminum foil.",
    "2",
    "Heat olive oil in a large frying pan with sides over medium heat. Add onion and cook, stirring occasionally until translucent; 3 to 5 minutes. Add garlic, red pepper flakes, zucchini, squash and a pinch of salt then cook, stirring occasionally until softened but still with some crunch and edges just start to brown; 5 to 8 minutes.",
    "Next add spinach until wilted.",
    "Next, add roasted red peppers and crushed tomatoes. Stir then bring to a low simmer. Simmer until liquid has thickened and reduced by half; 5 to 8 minutes. Add basil then season to taste with additional salt and pepper.",
    "3",
    "Add ricotta cheese (or cottage cheese), eggs and a 1/2 teaspoon of salt to a medium bowl then stir until well combined.",
    "4",
    "Spoon just enough vegetable mixture into the baking dish to lightly cover bottom (about 1 cup). Arrange four noodles lengthwise and side by side to cover the bottom. (If the noodles are short on one end, you may need to cut an extra noodle and place into dish to cover where the other noodles have not).",
    "Spread about half of the ricotta cheese (or cottage cheese ) mixture over the noodles. Sprinkle with a third of the parmesan cheese and a third of the mozzarella cheese. Then, top with about a third of the vegetable mixture. Add another layer of four noodles then repeat with remaining cheese and vegetables.",
    "Finish with a final layer of noodles, vegetables, parmesan cheese and mozzarella cheese.",
    "5",
    "Cover loosely with aluminum foil and bake 20 minutes, uncover then bake 15 minutes until cheese is crusty around the edges. To make cheese golden brown on top, slide under the broiler for 1 to 2 minutes.",
    "Let rest at least 15 minutes before serving."
  ],
  "ingredients": [
    "0",
    "14 lasagna noodles (2 extra for filling in holes)",
    "2 tablespoons extra-virgin olive oil",
    "1 cup (140 grams) chopped onion (1/2 large onion)",
    "3 garlic cloves , minced",
    "1/8 to 1/4 teaspoon crushed red pepper flakes",
    "2 medium zucchinis, cut into 1/2-inch pieces (500 grams or 4 cups)",
    "2 medium yellow squash, cut into 1/2-inch pieces (500 grams or 4 cups)",
    "1 bunch spinach",
    "12 ounce jar roasted red peppers, drained and cut into 1/2-inch pieces (1 heaping cup or 215 grams)",
    "1 (28 ounce) can crushed tomatoes",
    "Generous handful fresh basil leaves, chopped",
    "One 15-ounce (425 grams) container whole-milk ricotta cheese (substitute: cottage cheese)",
    "2 large eggs",
    "2 ounces (57 grams) parmesan cheese , grated (1 cup)",
    "8 ounces (227 grams) low-moisture whole-milk mozzarella cheese , shredded",
    "Salt and freshly ground black pepper to taste"
  ],
  "__v": 3
}