{
  "hash": "ca1635d60aca0e98c1c2f712e424e5614003e9f5",
  "title": "Beef Vindaloo",
  "image": "http://recipe-folder.com/img/recipe-images/019/846/1348033819.jpg",
  "href": "http://recipe-folder.com/recipe/5dc725588af0070830188d88",
  "extension": "User Added",
  "firstAdded": "2019-11-09T20:45:12.103000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Using a spice grinder, add the cumin, yellow mustard, fenugreek, black pepper corn seeds and red chillies (remove heads if any). Blend together under powder.",
    "1",
    "Place into a small bowl and pour in the white wine vinegar and sugar, mix together. Place to the side",
    "2",
    "In a heavy bottom pot or pressure cooker, heat the 2 tablespoons of vegetable oil and onions and cook until soft. Mix in the softened onions into the spice bowl made earlier. Blend together with a hand blender until paste. If you do not have a hand blender use a food processor.",
    "3",
    "Using the same pot the onions cooked in, heat up another 2 tablespoon of vegetable oil and the beef cubes. Brown all sides of the beef and cook for about 10 minutes, on medium high heat.",
    "4",
    "Remove the browned meat into a plate. (meat should not be cooked at this point) Pour half the juices onto the meat and keep the other half of the juices into the pot.",
    "5",
    "To the same pot, add the ginger and garlic cook for about 2 minutes. Add the coriander, turmeric and cardamon powder and continue cooking for another minute.",
    "6",
    "Add the Vindaloo paste into the pot and season with salt to taste.",
    "7",
    "Add the meat back into the pot and pour in 1 cup of water (for pressure cooker) (1 1/2 to 2 1/2 cups for the pot). Mix together and place the lid on the pressure cooker or on your pot.",
    "8",
    "Pressure Cooking: Cook for 15 minutes on medium high heat - Regular pot cooking time: Cook for 1 to 1 1/2 hours on medium heat (check on the meat to see if it is cooked and if there is enough liquid in the pot so it does not stick or burn)",
    "9",
    "Allow for the pressure cooker to cool down (whenever using a pressure cooker please follow manufacturer instructions) Open the the lid of the pressure cooker and see if the meat is cooked and tender.",
    "10",
    "Cook for an additional 5 minutes so that the sauce reduces a little or serve as is if you prefer more sauce.",
    "11",
    "Serve on a bed of yellow and white rice or rice of choice. Perfect with Naan bread.",
    "12",
    "Cooking Times",
    "13",
    "Preparation Time: 30 minutes",
    "14",
    "Cooking Time: 1 hour and 30 minutes",
    "15",
    "Inactive Time: 30 minutes",
    "16",
    "Total Time: 2 hours and 30 minutes"
  ],
  "ingredients": [
    "0",
    "1 1/2 Beef Stew Meat - 1 1/2 inch cubes",
    "1",
    "Vindaloo Paste:",
    "2",
    "1 Tbs cumin seeds",
    "3",
    "1 tsp yellow mustard seeds",
    "4",
    "1 tsp fenugreek seeds",
    "5",
    "1 tsp black pepper corns",
    "6",
    "4 - 8 ea dry red chilies",
    "7",
    "4 Tbs white wine vinegar",
    "8",
    "1/2 tsp sugar (optional)",
    "9",
    "1 1/2 tsp hot curry powder",
    "10",
    "1 ea large onion - finely diced",
    "11",
    "4 Tbs vegetable oil",
    "12",
    "1 ea inch fresh ginger - finely chopped",
    "13",
    "1 to 2 cloves garlic - crushed",
    "14",
    "2 tsp ground coriander",
    "15",
    "1/4 tsp cardamon powder or 5 cardamon pod seeds ground",
    "16",
    "1/2 tsp turmeric",
    "17",
    "Salt & Pepper to taste"
  ],
  "__v": 1,
  "hidden": true
}