{
  "hash": "ea29e07b246b2e56c8c2c0812cd96e04e00f45d3",
  "title": "Creamy Roasted Cauliflower and Potato Soup",
  "image": "//www.backtothebooknutrition.com/wp-content/uploads/2015/01/Creamy-Cauliflower-and-Potato-Soup-BRIGHTER.jpg",
  "href": "http://www.backtothebooknutrition.com/creamy-roasted-cauliflower-and-potato-soup/?utm_content=buffer0f99c&utm_medium=social&utm_source=facebook.com&utm_campaign=buffer",
  "firstAdded": "2015-02-06T21:33:16.795000",
  "users": [
    null
  ],
  "keywords": [
    "pastured",
    "ghee",
    "divided",
    "shallots",
    "garlic",
    "pressed",
    "thyme",
    "russet",
    "skins",
    "sub",
    "yukon",
    "gold",
    "potatoes",
    "think",
    "wonderful",
    "flavor",
    "texture",
    "didnt",
    "hand",
    "making",
    "chicken",
    "stock",
    "broth",
    "salt",
    "bay",
    "leaf",
    "head",
    "cauliflower",
    "florets",
    "black",
    "pepper",
    "milk",
    "sour",
    "cream",
    "fraiche",
    "thicker",
    "soup",
    "raw",
    "cheddar",
    "crumbled",
    "used",
    "bacon",
    "sure",
    "bowl",
    "generous",
    "reserved",
    "grease",
    "chives"
  ],
  "directions": [
    "0",
    "Preheat oven to 450 degrees.",
    "Place cauliflower florets on a foil-lined roasting pan. Toss with 1 Tbsp melted ghee and season to taste with sea salt or house seasoning (I use a 4:1:1 ratio of sea salt:blackpepper:garlic powder). Roast for 20 minutes or until edges have begun to brown and florets are fork tender. (I cook my bacon on a second foil-lined pan at the same time as the cauliflower and add the drippings to the soup pot once it has cooked. I leave the oven on so I can give the crumbled bacon a quick reheat before adding it to each bowl of soup.)",
    "Meanwhile, saute the shallots, garlic and thyme in the remaining 2 Tbsp ghee in a large Dutch oven. When shallots are soft, add the potatoes, chicken stock (I used 4 cups, but reduce to 3 cups if you want a thicker soup), 2 tsp sea salt, and bay leaf. Bring to a boil, then cover and reduce to a simmer for 20-30 minutes, until potatoes are soft.",
    "Back to the Cauliflower: Transfer the cooled roasted cauliflower to a blender, add the milk, and puree until smooth.",
    "Once the potatoes are soft, add the cauliflower puree and stir to mix. Use an immersion blender to puree the soup to your liking (alternatively, transfer the soup to the blender in batches until all has been pureed and returned to the pot).",
    "Turn off the heat, stir in the heavy cream, and season with additional salt and pepper to taste.",
    "To serve, ladle soup into bowls and top with shredded cheddar, sour cream, chopped bacon, and chives."
  ],
  "ingredients": [
    "0",
    "3 Tbsp pastured ghee, divided",
    "3 large shallots",
    "6 large cloves garlic, minced or pressed",
    "1 tsp chopped fresh thyme",
    "2 very large Russet potatoes, skins on and diced (can sub Yukon gold for 1 of the potatoes - I think it would add a wonderful flavor and texture, but I didn't have any on hand when making this)",
    "3-4 cups chicken stock or broth (homemade if you have it!)",
    "3-4 tsp sea salt",
    "1 bay leaf",
    "1 large head cauliflower, cut into florets",
    "3/4 tsp ground black pepper",
    "1 1/2 cups milk",
    "1/2-3/4 cups heavy cream (could substitute sour cream or cream fraiche for thicker soup)",
    "Grated raw cheddar",
    "Raw sour cream or cream fraiche",
    "Thick cut pastured bacon, cooked and crumbled (I used a pound of bacon to be sure each bowl got a generous amount as garnish)",
    "Reserved bacon grease (optional)",
    "Fresh chopped chives"
  ],
  "__v": 1
}