{
  "hash": "3fc0137fbe3211123a0fd9bb8a44b9c68b8c82f6",
  "title": "Classic Southern Buttermilk Bathed Fried Chicken",
  "image": "https://d2k9njawademcf.cloudfront.net/indeximages/474/original/090809F_0806.JPG?1403235756",
  "href": "http://food52.com/recipes/446-classic-southern-buttermilk-bathed-fried-chicken",
  "extension": "Chrome",
  "firstAdded": "2015-06-10T01:04:12.140000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "quarters",
    "leg",
    "thigh",
    "separated",
    "thyme",
    "marjoram",
    "onion",
    "garlic",
    "cayenne",
    "pepper",
    "salt",
    "black",
    "quarts",
    "buttermilk",
    "vinegarbased",
    "hot",
    "allpurpose",
    "flour",
    "peanut",
    "canola",
    "oil",
    "frying"
  ],
  "directions": [
    "0",
    "In a medium bowl, mix all of the dry spices. Add chicken and toss until well coated. Let the mixture stand at room temp (if cooking within 4 hours) or refrigerated in a large bowl for one hour.",
    "Pour enough buttermilk over the chicken to cover completely and stir in the hot sauce. Leave on the countertop for one to three hours, or refrigerate up to 24 hr. Pour chicken legs into colander and allow excess buttermilk to drain.",
    "In a large bowl, mix the flour with salt and pepper to season well. One-by-one add the chicken pieces, making sure they are thoroughly coated with flour on all sides. Leave them in the bowl with the excess flour while you wait on the oil.",
    "Fill a very large pot 4-6 inches deep with oil and heat to 325 degrees. Grab each piece of chicken and slap it back and forth between your hands a few times to knock off the excess flour before slipping it into the oil. As the legs go into the oil, the temperature will drop. Turn the flame to high to increase the temperature to 350 as the chicken cooks. Cook 12-18 minutes until golden brown and at least 160 degrees at the bone, Remove to a rack to drain and season immediately with salt. Cool a few minutes and serve."
  ],
  "ingredients": [
    "0",
    "6 chicken leg quarters (leg and thigh separated)",
    "1 teaspoon dried thyme",
    "1 teaspoon dried marjoram",
    "2 teaspoons onion powder",
    "2 teaspoons garlic powder",
    "1.5 teaspoons cayenne pepper",
    "3 tablespoons salt",
    "1 tablespoon black pepper",
    "1",
    "1-2 quarts buttermilk",
    "4 tablespoons vinegar-based hot sauce",
    "6 cups all-purpose flour",
    "peanut or canola oil for frying"
  ],
  "__v": 1
}