{
  "hash": "932f279f2503bf2f11bdf866f8f9677a444b1cb8",
  "title": "Curried Quinoa Salad",
  "image": "https://minimalistbaker.com/wp-content/uploads/2017/12/DELICIOUS-Curried-Quinoa-Salad-with-vegetables-Creamy-Curry-Dressing-Flavorful-healthy-10-ingredients-required-vegan-glutenfree-plantbased-quinoa-curry-salad-recipe-54.jpg",
  "href": "https://minimalistbaker.com/curried-quinoa-salad/",
  "extension": "",
  "firstAdded": "2018-04-30T16:42:08.237000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Add quinoa to a small saucepan and toast over medium heat for 2 minutes, stirring occasionally, being careful not to burn. Then add salt, curry powder, and water and bring to a boil.",
    "Once boiling, reduce heat to a simmer, cover, and cook for 20 minutes or until all water is absorbed. Set aside off heat, uncovered, to cool - at least 15 minutes.",
    "In the meantime, prepare dressing by adding curry paste, tahini, lemon juice, maple syrup, salt, pepper, and oil (optional) and whisk to combine. Then add water to thin until a pourable dressing is achieved.",
    "Taste and adjust seasonings as needed, adding more maple syrup for sweetness, lemon for acidity, salt for saltiness, or curry paste for intense curry flavor.",
    "Add all ingredients (quinoa mostly cooled) to a mixing bowl and top with dressing. Then toss to combine and serve. Enjoy at room temperature or chill. Garnish with additional pomegranate, radish, green onion, or cilantro (optional).",
    "Leftovers will keep covered in the refrigerator up to 3 days. Dressing will keep for 5 days."
  ],
  "ingredients": [
    "0",
    "QUINOA",
    "1 cup (184 g) quinoa, well rinsed and drained",
    "Pinch sea salt",
    "1 tsp curry powder",
    "1 3/4 cups (420 ml) water",
    "DRESSING",
    "4 Tbsp (60 g) green curry paste (or store-bought, though fresh is best)",
    "3 Tbsp (45 g) tahini",
    "2 Tbsp (30 ml) lemon juice",
    "1 Tbsp (15 ml) maple syrup",
    "Pinch each salt and black pepper",
    "optional: 1 Tbsp (15 ml) olive oil (if avoiding oil, sub water)",
    "Water to thin",
    "FOR SERVING",
    "1 red bell pepper, diced (119 g)",
    "3 radishes, thinly sliced (13 g)",
    "1 cup (30 g) fresh chopped cilantro",
    "optional: 1/2 cup (87 g) pomegranate arils",
    "optional: 4 green onion, thinly sliced (60 g)",
    "optional: 2 Tbsp (20 g) nut or seed of choice (e.g. hemp seeds or roasted cashews)",
    "optional: Fresh chopped cilantro"
  ],
  "__v": 1
}