{
  "hash": "519ab466b6d931bdbda6e128f6beadb463b9f998",
  "title": "Deconstructed Stuffed Cabbage Casserole",
  "image": "http://1.bp.blogspot.com/-dvHFIcWe7MI/TtwqufmCO7I/AAAAAAAATjo/iBZ5QMk3KpI/s1600/Deconstructed-Cabbage-Roll-Casserole-recipe-kalynskitchen.jpg",
  "href": "http://www.kalynskitchen.com/2011/12/recipe-for-deconstructed-stuffed.html",
  "extension": "Firefox",
  "firstAdded": "2015-10-11T12:53:46.782000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "divided",
    "depending",
    "pan",
    "lean",
    "beef",
    "onion",
    "garlic",
    "thyme",
    "hungarian",
    "good",
    "quality",
    "paprika",
    "makes",
    "difference",
    "flavor",
    "dish",
    "sharp",
    "making",
    "kids",
    "leave",
    "salt",
    "black",
    "pepper",
    "seasoning",
    "meat",
    "mixture",
    "cabbage",
    "heads",
    "green",
    "coarsely",
    "petite",
    "dice",
    "tomatoes",
    "juice",
    "tomato",
    "water",
    "rinse",
    "used",
    "brown",
    "rice",
    "cheese",
    "blend",
    "mozzarella",
    "lowfat",
    "cheddar",
    "provolone"
  ],
  "directions": [
    "0",
    "Instructions:",
    "Preheat oven to 350F/180C. Spray a large glass or crockery casserole dish with non-stick spray. (I used a dish that was 12\" x 10\".)",
    "Heat 1-2 tsp. olive oil in a large frying pan; add ground beef and cook until it's done and nicely browned, breaking apart as it cooks. (I like to use a potato masher to break the meat apart once it's partly done.) Remove ground beef to a bowl.",
    "In the same pan, add a little more olive oil if needed, then add chopped onion and cook over medium heat until the onion is translucent and starting to brown, about 5 minutes. Add the minced garlic, dried thyme, and paprika and cook about 2 minutes more. Then add the diced tomatoes with juice, tomato sauce, and ground beef. Rinse each of the cans out with a little water (about 1/4 cup total) and add to the pan. Let mixture simmer until it's hot and slightly thickened, about 15-20 minutes.",
    "While the meat mixture simmers, cut cabbage in half, cut out the core, and remove any wilted outer leaves, and then chop the cabbage coarsely into pieces. (They don't have to be all the same size. I chopped it into pieces that varied from 1/2 inch to 1 1/2 inches.) Heat about 2 tsp. olive oil in a large frying pan or dutch oven with high sides, add the cabbage and cook over medium-high heat until the cabbage is wilted and about half cooked, turning it over several times so it all wilts and cooks. Season cabbage with salt and fresh-ground black pepper.",
    "When the meat and tomato sauce mixture has cooked 15-20 minutes and thickened a bit, stir in the 2 cups of cooked rice and gently combine.",
    "Spray a large glass or crockery casserole dish with non-stick spray and the layer half the cabbage, half the meat mixture, other half of cabbage, and other half of meat mixture. Cover tightly with foil and bake 40 minutes, or until the mixture is just starting to bubble on the edges.",
    "Remove foil and sprinkle on cheese (if using.) Bake uncovered an additional 20 minutes, or until the cheese is melted and starting to slightly brown. Serve hot.",
    "This freezes well, and I'm looking forward to enjoying it several more times when I eat the portions I have in the freezer. To reheat, I would recommend thawing overnight in the refrigerator and then either microwaving it until hot or heating in the oven in a glass dish covered with foil."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "1 1/2 T olive oil, divided (more or less, depending on your pan)",
    "1 lb. lean ground beef",
    "1 large onion, chopped small",
    "1 T finely minced garlic",
    "1/2 tsp. dried thyme",
    "1 tsp. sweet Hungarian Paprika (good quality paprika makes a big difference in flavor in a dish like this)",
    "1/2 tsp. sharp Hungarian Paprika (optional; if making for kids I might leave this out)",
    "salt and fresh ground black pepper to taste (for seasoning meat mixture and cooked cabbage)",
    "1 1/2 heads green cabbage, coarsely chopped",
    "1 can (14.5 oz.) petite dice tomatoes with juice",
    "1 can (15 oz.) tomato sauce",
    "1/4 cup water (just enough to rinse out each of the cans)",
    "2 cups cooked rice (I used brown rice)",
    "2 cups low-fat cheese (optional; I used a blend of 80% low-fat mozzarella, 10% low-fat cheddar, and 10% Provolone.)"
  ],
  "__v": 1
}