{
  "hash": "c3de2556eb9ad18a40fe00701de1fc27ce3f5113",
  "title": "Crispy Baked Split Chicken Breasts",
  "image": "https://www.101cookingfortwo.com/wp-content/uploads/2018/08/Oven-Baked-Crispy-Garlic-Split-Chicken-Breast-1-150x150.jpg",
  "href": "https://www.101cookingfortwo.com/oven-baked-crispy-garlic-split-chicken/",
  "extension": "",
  "firstAdded": "2019-03-05T02:39:27.136000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Preheat oven to 400 convection or 425 degrees conventional oven.",
    "Pat dry chicken breasts. Trim the chicken of any trim-able fat and remove the rib area and discard.",
    "Cut the chicken into chunks. The normal size ones in half and the super humungous ones into thirds.",
    "Prepare a baking pan with aluminum foil, a baking rack and spray with PAM.",
    "Combine spices and then sprinkle and rub on all surfaces.",
    "Place on rack with larger pieces in the corners. And thinner edges to center.",
    "Bake until internal temp of 165. About 35 minutes depending on your oven and thickness of the chicken.",
    "Recipe Notes",
    "Pro Tips:",
    "Properly cutting up the chicken breasts are important for this recipe to work. Better serving sizes, more even cooking, easier to get properly cooked and more surface area for seasoning.",
    "The celery salt adds some taste but skip if you don't have it.",
    "The cayenne pepper is also optional/to taste. The 1/2 teaspoon is a 5/10 heat level — more than some want.",
    "I like cooking chicken on racks, but it is not that important here.",
    "Keep the thicker parts of the chicken towards the outside of the baking tray.",
    "Be sure to check for a final internal temperature of 165. Do not guess or cook by time alone."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "3 bone-in skin-on chicken breast - scale to what you need, AKA split chicken breast",
    "1 teaspoon garlic powder",
    "1/2 teaspoon celery salt - optional if you have it",
    "1/2 teaspoon onion powder",
    "1/2 teaspoon kosher salt",
    "1/4 teaspoon black pepper",
    "1/2 teaspoon cayenne pepper - optional",
    "1 teaspoon Dual action baking powder"
  ],
  "__v": 1
}