{
  "__v": 1,
  "directions": [
    "0",
    "Method - How to make Samosa Recipe",
    "First of all boil the potatoes. Put oil and salt into the maida and mix well. Knead the flour with the help of luke warm water. The dough should be hard. Cover it and leave for 30 minutes to set.",
    "How to prepare the filler for stuffing.",
    "Peel the boiled potatoes and mash them with hands.",
    "Now heat 1 table spoon oil in a pan and put coriander powder, green chilli and ginger into it. Roast the masala and add mashed potatoes to it. Now add garam masala, salt and amchoor powder to it. Stir the masala with spoon to mix well. Turn off the flame. Let it cool down and put cashews and raisins to it. The filling to stuff the samosa is ready.",
    "Now make 10 equal sized balls from the dough. Take one ball and roll it into a thick flat disc of 8 inch.",
    "Cut the disc into two equal parts with knife. Fold the one part in a cone shape. Stick the ends of the samosa with water.",
    "Stuff the samosa with a filling. Now place a plate at the end of the samosa and stick it with the help of a water. Check the shape of the samosa. Prepare all the samosa in the same manner.",
    "Heat oil in a pan and put 4 samosas into it to fry. Fry them till they turn brown on a medium flame. Once the samosas are properly fried, take them out on a plate. Fry all the samosas in the same manner."
  ],
  "firstAdded": "2014-03-31T14:43:44.250000",
  "hash": "383c3f5662a5462109b95e2b75306f12bc8b1c09",
  "href": "http://nishamadhulika.com/en/13-samosa_recipe.html",
  "image": "http://nishamadhulika.com/files/samose_802574148.jpg",
  "ingredients": [
    "0",
    "Ingredients to knead the flour for samosa.",
    "Maida - 300 gms.",
    "Ghee - 75 gms.",
    "Salt - according to the taste.",
    "Ingredients to prepare the filler.",
    "Potato - 600 gms.",
    "Green peas - 1/2 small bowl (optional)",
    "Cashews - 12-15",
    "Raisins - 25-30 (optional)",
    "Green chilli - 2-3 (chopped)",
    "Ginger - 2 inch long piece (grated)",
    "Coriander leaves - 1 table spoon (chopped)",
    "Coriander powder - 2 tea spoon.",
    "Garam masala - 1/4 tea spoon.",
    "Amchoor powder - 1/4 tea spoon.",
    "Salt - according to the taste",
    "Oil - to fry."
  ],
  "keywords": [
    "knead",
    "flour",
    "samosa",
    "maida",
    "gms",
    "ghee",
    "salt",
    "according",
    "prepare",
    "filler",
    "potato",
    "green",
    "peas",
    "bowl",
    "cashews",
    "raisins",
    "chilli",
    "ginger",
    "long",
    "coriander",
    "leaves",
    "tea",
    "garam",
    "masala",
    "amchoor",
    "oil",
    "fry"
  ],
  "title": "Samosa",
  "users": [
    null
  ]
}