{
  "hash": "fe1a6917140fee0a9c42ddc84f97ba5abe1c84e3",
  "title": "gluten-free apple cinnamon bread pudding",
  "image": "http://www.runningwithspoons.com/wp-content/uploads/2013/10/Gloomy-Fall-Day.jpg",
  "href": "http://www.runningwithspoons.com/2013/10/04/gluten-free-bread-pudding-and-a-giveaway/",
  "extension": "Chrome",
  "firstAdded": "2016-02-09T11:07:47.478000",
  "users": [
    null
  ],
  "keywords": [
    "udis",
    "gluten",
    "free",
    "bread",
    "cubes",
    "vanilla",
    "almond",
    "milk",
    "eggs",
    "lightly",
    "maple",
    "syrup",
    "cinnamon",
    "nutmeg",
    "salt",
    "raisins",
    "brown",
    "sugar",
    "coconut",
    "oil",
    "apples",
    "cored"
  ],
  "directions": [
    "0",
    "Begin by generously greasing an 8x8 inch baking dish. Add bread cubes, making sure there is enough to cover the entire bottom of the pan. If not, cut up another slice.",
    "In a medium sized mixing bowl, whisk together milk, eggs, maple syrup, vanilla, cinnamon, nutmeg, and salt until well incorporated.",
    "Pour wet mixture over bread cubes, pressing down on them to ensure that they soak up the liquid. Fold in raisins and let sit for at least 20 minutes, checking regularly to make sure the bread cubes are getting spongy.",
    "Preheat oven to 350F.",
    "While bread cubes are soaking, prepare your apples by adding the coconut oil and apple slices to a skillet over medium-low heat and cooking until tender, approximately 8 minutes. Remove from heat and allow to cool.",
    "Spoon apples over bread cube mixture, distributing evenly and using a spoon to fill some of the gaps between the cubes. Sprinkle with brown sugar.",
    "Bake for 45 minutes to an hour, or until apples are golden brown and egg mixture is set.",
    "Remove from oven and serve. Top with maple syrup or enjoy as-is. Store leftovers in a sealed container in the fridge for up to 5 days."
  ],
  "ingredients": [
    "0",
    "6 cups (~5 oz.) Udi's Gluten Free Whole Grain Bread, cut into 1' cubes",
    "1 cup vanilla almond milk",
    "3 eggs, lightly beaten",
    "1/3 cup maple syrup",
    "1 tsp. vanilla extract",
    "1 tsp. ground cinnamon",
    "1/2 tsp. ground nutmeg",
    "1/4 tsp. salt",
    "1/4 cup raisins",
    "1/4 cup brown sugar",
    "1 Tbsp. coconut oil",
    "2 apples, peeled, cored, and sliced 1/4' thick"
  ],
  "__v": 1
}