{
  "hash": "c7884ed2e4bcd2b9ff21f0438c7f998494c8058e",
  "title": "Refrigerator Pickled Beets Recipe",
  "image": "http://recipe-folder.com/img/recipe-images/003/921/2456926803.jpg",
  "href": "https://whatscookingamerica.net/Vegetables/RefrigeratorPickledBeets.htm",
  "extension": "",
  "firstAdded": "2016-11-15T18:05:19.695000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 degrees F. Place rack in middle of oven.",
    "Prepare beets: Wash and scrub the whole beets to clean off any dirt. Leave the beet whole unless you have some extra large ones (if extra large, cut in half). Trim off the stems (leafy tops) and ends of the beets. On a large baking sheet, cover with aluminum foil. Place prepared beets, in a single layer, on top. Toss lightly with some olive oil to coat the beets. Place another large sheet of aluminum foil on top of the beets and crunch up the sides of the aluminum foil together to seal. Place in oven and roast no more than 1 hour until tender and easily pierced with the tip of a paring knife. Remove from oven and take off the top foil. Set aside to cool enough to handle. Then peel.",
    "Pickling brine: In a large saucepan over medium-high heat, add apple cider vinegar, water, sugar, garlic cloves and peppercorns; bring to a boil, stirring until sugar melts. Reduce heat and let the pickling brine simmer approximately 5 minutes. Remove from heat and let brine cool before adding the cooked beets.",
    "How to pickle beets: Place sliced beets into a large jar that will fit in your refrigerator. Pour cooled Pickling Brine over the beets and gently stir. Place, covered, in the refrigerator. Let them sit in the refrigerator, maybe stirring once in a while, at least a week before eating them. These Refrigerator Pickled Beets will last a long time in the refrigerator, probably 2 to 3 months."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "3 pounds fresh small whole beets (use similar size beets)*",
    "2 cups apple cider vinegar",
    "2 cups water",
    "2 cups granulated sugar",
    "3 or 4 garlic cloves, sliced in half",
    "1 tsp peppercorns"
  ],
  "__v": 7
}