{
  "hash": "baf7a28e88b1f83ef725f973db21f05f3ea56647",
  "title": "Baked Cinnamon Sugar Donut Holes",
  "image": "http://i0.wp.com/www.livewellbakeoften.com/wp-content/uploads/2016/08/Baked-Cinnamon-Sugar-Donut-Holes-4.jpg?resize=680%2C1020",
  "href": "http://www.livewellbakeoften.com/2016/08/09/baked-cinnamon-sugar-donut-holes/",
  "extension": "Chrome",
  "firstAdded": "2016-08-20T07:30:35.893000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350°F. Spray a 24-count mini muffin pan with nonstick cooking spray and set aside.",
    "In a large mixing bowl, whisk together the flour, baking powder, cinnamon, and salt. Set aside.",
    "In a separate bowl, mix together the International Delight Caramel Macchiato Iced Coffee, Greek yogurt, sugar, egg, vanilla, and melted butter until fully combined. Add the dry ingredients to the wet ingredients and mix until just combined, making sure not to over mix the batter.",
    "Pipe (or spoon) the batter evenly into all 24 mini muffin cavities, only filling each one about ¾ of the way full.",
    "Bake at 350°F for 9-11 minutes or until a toothpick inserted into the center of the donut holes comes out clean. Remove from the oven and allow to cool in the pan for about 5 minutes. Gently remove from the pan to a wire rack to cool.",
    "1",
    "Add the melted butter to small bowl and set aside. In a separate bowl, mix together the granulated sugar and cinnamon until well combined. Take each donut hole and dunk it into the melted butter, making sure it is fully coated. Then dip it into the cinnamon and sugar mixture, making sure to coat well. Repeat until all of the donut holes are coated, then serve and enjoy!"
  ],
  "ingredients": [
    "0",
    "1 and ½ cups all-purpose flour (spooned & leveled)",
    "1 and ½ teaspoons baking powder",
    "½ teaspoon ground cinnamon",
    "¼ teaspoon salt",
    "½ cup International Delight Caramel Macchiato Iced Coffee",
    "¼ cup plain Greek yogurt",
    "½ cup granulated sugar",
    "1 large egg",
    "1 teaspoon vanilla extract",
    "3 tablespoons unsalted butter, melted and slightly cooled",
    "1",
    "¼ cup unsalted butter, melted and slightly cooled",
    "½ cup granulated sugar",
    "2 teaspoons ground cinnamon"
  ],
  "__v": 1
}