{
  "hash": "319428846ae427575c1d76d0260990a3b2094073",
  "title": "Basic White Sandwich Bread\nMakes 2 loaves",
  "image": "http://atmedia.imgix.net/8cc283cff2b30518c2b9debc9c1b5dfd2606853c?auto=compress&w=540.0&h=540.0&fit=max",
  "href": "http://www.thekitchn.com/how-to-make-basic-white-sandwich-bread-cooking-lessons-from-the-kitchn-166588",
  "extension": "",
  "firstAdded": "2016-11-08T18:07:15.442000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make sure the water is warm to the touch. If you can't comfortably hold your finger in the water for several seconds, wait for it to cool. Pour the water into the bowl of a standing mixer or large mixing bowl and sprinkle the yeast over top. Let this stand for 5 minutes until the yeast is dissolved.",
    "Melt the butter in the microwave. Stir in the milk, sugar, and salt. Pour 1 cup of flour and the milk mixture over the yeast. Stir until this comes together into a loose, lumpy batter.",
    "Add another 4 1/2 cups of flour, reserving the remaining cup if the dough is sticky during kneading. Stir until a floury, shaggy dough is formed.",
    "Using the dough hook attachment on a standing mixer, knead the dough for 8-10 minutes. Alternatively, knead the dough by hand against the counter. If the dough is bubble-gum sticky against the sides of the bowl or the counter, add extra flour a tablespoon at a time until it is no longer sticky. The dough is kneaded when it is smooth, feels slightly tacky, forms a ball without sagging, and springs back when poked.",
    "Clean out the mixing bowl and film it with a little oil. Form the dough into a ball and turn it in the bowl to coat it with oil. Cover the bowl and let the dough rise in a warm spot until doubled in bulk, about one hour.",
    "Sprinkle a little flour on the counter and turn the dough out on top. Divide the dough in two and shape each half into a loose ball. Let the balls rest for 10 minutes.",
    "Grease two loaf pans or film them with non-stick cooking spray. Shape each ball of dough into a loaf (see this tutorial for step-by-step instructions) and transfer to the loaf pans. It's important that the surface of the loaves be stretched taut; this helps them rise and prevents an overly-dense interior. Let the loaves rise a second time until they start to dome over the edge of the pan, 30-40 minutes.",
    "Heat the oven to 425° F about halfway through the second rise.",
    "Slash the tops of the loaves with a serrated knife and put them in the oven. Immediately turn down the heat to 375°F and bake for 30-35 minutes. Finished loaves will be dark golden-brown and sound hollow when tapped on the bottom. Remove the loaves from the pans and let them cool completely before slicing.",
    "Loaves will keep at room temperature for several days. Loaves can also be wrapped in foil and plastic, and frozen for up to three months."
  ],
  "ingredients": [
    "0",
    "2 teaspoons active-dry yeast",
    "1 cup (8 oz) warm water",
    "2 tablespoons (1 oz) unsalted butter",
    "1 cup (8 oz) milk - whole, 2%, or skim",
    "2 tablespoons white sugar",
    "1 tablespoon salt",
    "5 1/2 - 6 1/2 cups (24 3/4 ounces - 29 1/4 ounces) all-purpose flour"
  ],
  "__v": 1
}