{
  "hash": "b2f98458f50ebb54dad4f8131528f562254e09cb",
  "title": "Linguine with Clams",
  "image": "https://www.williams-sonoma.com/wsimgs/rk/images/dp/recipe/201707/0046/img15l.jpg",
  "href": "https://www.williams-sonoma.com/recipe/linguine-with-clams-cf.html",
  "extension": "Chrome",
  "firstAdded": "2017-06-27T00:06:36.827000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Scrub the clams well under cold running water.",
    "Bring a large pot of salted water to a boil over high heat. Add the linguine and stir occasionally until the water returns to a boil. Cook according to the package directions until al dente.",
    "While the linguine is cooking, in a large saucepan over medium heat, heat together the olive oil, garlic and red pepper flakes until the garlic softens and is fragrant but not browned, about 3 minutes. Add the clams and wine and cover. Increase the heat to high and cook, shaking the pan occasionally by its handle, until the clams have opened, about 4 minutes. Remove from the heat and discard any unopened clams. Add the butter and swirl the saucepan to melt the butter into the cooking liquid.",
    "Drain the linguine and return it to its cooking pot. Pour the clams and sauce over the linguine and mix gently. Transfer to a serving platter or individual pasta bowls, dividing the clams evenly. Sprinkle with the parsley and serve at once. Serves",
    "Variation: If you can’t stand the idea of serving pasta without tomatoes, in a frying pan, sauté 2 cups whole grape or cherry tomatoes in 2 Tbs. olive oil over high heat until they are hot and begin to wilt, 3 to 4 minutes. Add them to the clams and their sauce along with the pasta."
  ],
  "ingredients": [
    "0",
    "3 dozen littleneck clams (about 3 lbs.)",
    "Kosher salt",
    "1 lb. linguine",
    "1/4 cup extra-virgin olive oil",
    "3 cloves garlic, minced",
    "1/4 tsp. red pepper flakes, or to taste",
    "1/2 cup dry white wine",
    "2 Tbs. unsalted butter",
    "3 Tbs. fresh flat-leaf parsley, finely chopped"
  ],
  "__v": 1
}