{
  "hash": "7f59d3e129233e2aaa6516749dd9fffec7d192ad",
  "title": "ANGEL FOOD CAKE (GRAIN-FREE, PALEO)",
  "image": "//deliciouslyorganic.net/wp-content/uploads/2015/07/Paleo-Grain-Free-Angel-Food-Cake-H2.jpg",
  "href": "http://deliciouslyorganic.net/angel-food-cake-grain-free-paleo/",
  "extension": "Chrome",
  "firstAdded": "2016-02-14T13:46:18.956000",
  "users": [
    null
  ],
  "keywords": [
    "cake",
    "egg",
    "whites",
    "room",
    "lemon",
    "juice",
    "celtic",
    "salt",
    "cream",
    "tartar",
    "vanilla",
    "maple",
    "coconut",
    "sugar",
    "arrowroot",
    "flour",
    "prices",
    "thrive",
    "market",
    "best",
    "ive",
    "seen",
    "whipped",
    "paleo",
    "berries"
  ],
  "directions": [
    "0",
    "Instructions",
    "Preheat the oven to 350ºF and adjust the rack to the middle position.",
    "Place the egg whites and lemon juice in the bowl of a standing mixer. Whisk the egg mixture on medium-high until foamy, about 30 seconds. Add the salt, cream of tartar and vanilla. Whisk the mixture on medium-high until soft peaks form, about 1-2 minutes.",
    "With the mixer on medium-high, slowly add 1/2 cup of the maple sugar, 1 tablespoon at a time. Sift the remaining 1/4 cup maple sugar and arrowroot flour into a small bowl. With the mixer on medium, slowly add the arrowroot mixture. Turn the speed up to medium-high and whip until smooth (there might be some tiny little lumps from the sugar, but it will melt in the oven while baking).",
    "Pour the batter into a clean (and NOT oiled), 12-cup angel food cake pan (I'm still on the look-out for a glass or stainless steel angel food cake pan. If you know where to purchase one, please let me know!). Bake for 40-45 minutes, until cake is puffed and the top is just turning golden brown.",
    "Remove the cake from the oven. Carefully turn the cake upside-down and place on top of a can. Let cool completely, about 1 hour. Run a knife around the outside of the cake and invert onto a cake platter (you might need to shake the cake a little to get it to separate from the center tube of the cake pan). Serve alone or with whipped cream and berries."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "For the Cake:",
    "12 large egg whites, room temperature",
    "1 teaspoon fresh lemon juice",
    "1/4 teaspoon Celtic sea salt",
    "1 1/4 teaspoons cream of tartar",
    "1 tablespoon pure vanilla extract",
    "3/4 cup maple or coconut sugar",
    "1 cup arrowroot flour (the arrowroot flour prices over at Thrive Market are the best I've seen anywhere!)",
    "1 1/2 cups heavy cream, whipped (or whipped coconut cream for Paleo), optional",
    "1 pint berries (optional)"
  ],
  "__v": 1
}