{
  "hash": "669ee3f8e76edd00eeecd924f9ae9274d4d5bc2c",
  "title": "Watermelon Look-Alike Raisin Bread",
  "image": "http://www.jocooks.com/wp-content/uploads/2015/03/watermelon-look-alike-raisin-bread.jpg",
  "href": "http://www.jocooks.com/bakery/breads/watermelon-look-alike-raisin-bread/",
  "extension": "Chrome",
  "firstAdded": "2017-08-05T20:41:16.645000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Warm the butter and milk together in the microwave for 30 seconds or until butter is melted. Add milk mixture to a large bowl. Add the instant yeast, the egg, sugar and salt, then whisk it all together. You can start adding flour, I added about 2 cups of flour, one cup at once and mixed it with a wooden spoon. Don’t add the last cup of flour yet.",
    "The dough should be very sticky but this is where you need to divide the dough into 2 parts. One part will be used for the red part of the watermelon. The other half needs to be divided in half, so you’ll end up with 1/4 of the initial dough. You’ll have 3 pieces of dough. Take the bigger piece of dough and add red food coloring, add a few drops to achieve the color you want. Also add the raisins at this time and about 1/2 cup of flour. Knead it all together, if you want you can transfer it to your mixer but you should be able to knead by hand too. Make sure the color is fully mixed in. The dough should no longer be sticky, so add more flour if needed.",
    "Take one of the smaller pieces of dough and add the green food coloring and mix until the color is fully mixed. Add about 1/4 cup of flour and knead. Add more flour as needed as well. To the other piece of dough all you need to do is add 1/4 cup of flour or as much as needed and knead until it’s no longer sticky but still soft.",
    "Now should have 3 pieces of dough, the red dough with the raisins, the white dough and the green dough. Cover the bowls up with plastic wrap and let them rise in a warm place until doubled in size.",
    "Take the red dough and punch down to remove the air then form it into a log that’s the same length as your bread pan. Take the white dough and roll it out until it’s large enough to completely cover the red log. Wrap this dough around the red log and make sure the seams are sealed. Take the green dough now and repeat, roll it out until it’s big enough to cover the log, and wrap it around the log, sealing the seams. Place it in your greased bread pan.",
    "Preheat oven to 350 F degrees.",
    "Let the bread rise again until it doubles in size, depending on how warm your kitchen is, it should take anywhere from half hour to an hour. Bake it in a preheated 350 F degree oven for about 35 minutes. Take it out of the oven and remove it from the bread pan immediately onto a cooling rack.",
    "Let it cool completely before slicing into it.",
    "Recipe Notes",
    "Please keep in mind that nutritional information is a rough estimate and can vary greatly based on products used."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 cup milk",
    "1 1/2 tbsp unsalted butter",
    "1/4 cup sugar",
    "3/4 tsp salt",
    "2 1/4 tsp instant yeast 8 g",
    "1 egg",
    "3 cups all-purpose flour",
    "1 cup raisins",
    "a few drops red food coloring",
    "a few drops of green food coloring"
  ],
  "__v": 1
}