{
  "hash": "6f613cd6b111fef09f7491b8a18104bb629860d4",
  "title": "Creamy Shrimp Pasta Recipe",
  "image": "http://natashaskitchen.com/wp-content/uploads/2017/05/Creamy-Shrimp-Alfredo-Pasta-5-600x900.jpg",
  "href": "http://natashaskitchen.com/2017/05/26/creamy-shrimp-pasta-recipe/",
  "extension": "Chrome",
  "firstAdded": "2017-06-16T22:01:45.460000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Season shrimp with ½ tsp salt, ¼ tsp black pepper and ¼ tsp paprika. Please a large, non-stick pan over medium/high heat and add 1 Tbsp oil. Once oil is hot, add shrimp in a single layer and cook 2 min per side or just until cooked through and no longer translucent. Remove to a separate dish to prevent overcooking.",
    "In the same hot pan, add 2 Tbsp butter with finely chopped onion and sauté until soft and golden (3-5 mins), stirring often. Add minced garlic and sauté another minute until fragrant. Stir in ⅓ cup white wine and boil down until there is only 25% of the liquid left.",
    "Stir in 2 cups cream, bring to a light boil then simmer 2 min. Sprinkle sauce with ⅓ cup parmesan cheese and stir just until creamy and smooth. Let it come just to a simmer without boiling then turn off the heat and season sauce with more salt, pepper and paprika to taste.",
    "Stir in the zoodles and cooked shrimp, tossing until zoodles are well coated in sauce. Serve in warm pasta bowls with a generous sprinkle of finely chopped parsley, more parmesan cheese and some freshly cracked black pepper.",
    "Notes",
    "Important: do not boil the alfredo sauce once the cheese is in, or the cheese will separate from the cream."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Zoodles",
    "1 lb large raw shrimp, peeled and deveined",
    "1 Tbsp olive oil",
    "½ medium onion, finely chopped",
    "2 Tbsp butter",
    "1 garlic clove, minced",
    "⅓ cup white wine (I used Chardonnay)?",
    "2 cups heavy whipping cream",
    "⅓ cup shredded parmesan cheese",
    "Salt and black pepper to taste",
    "¼ tsp paprika, or to taste",
    "Parsley, finely chopped, to garnish"
  ],
  "__v": 4
}