{
  "hash": "0cd7b1b0d21d7d3e39547cd542e7e3410f1f6cc4",
  "title": "Kora orzechowa",
  "image": "http://static.mojewypieki.com/upload/images/przepisy/Kora%20orzechowa/Kora_orzechowa_2.jpg",
  "href": "http://www.mojewypieki.com/post/kora-orzechowa",
  "extension": "",
  "firstAdded": "2016-09-17T16:14:24.720000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Wykonanie:",
    "Galaretki rozpuścić w 750 ml wody, pozostawić do ostudzenia. Przed samym wyłożeniem ich na ciasto schłodzić w lodówce, by lekko zgęstniały.",
    "Odłożyć kilka pełnych łyżek kremu brzoskwiniowego (będzie nam potrzebny do posmarowania blatu ciasta pod galaretką).",
    "Na blat pozostawiony w formie wyłożyć połowę kremu brzoskwiniowego. Delicje maczać w kawie z alkoholem, układać na kremie, czekoladą do dołu, lekko je w niego wciskając. Jeśli pozostanie kawy - nasączyć mocniej delicje. Na nie wyłożyć pozostały krem brzoskwiniowy, wyrównać. Na krem położyć drugi blat ciasta, cienko posmarować odłożonym kremem brzoskwiniowym. Na wierzchu poukładać brzoskwinie z syropu, pokrojone w plasterki. Całość zalać lekko gęstniejącą galaretką brzoskwiniową.",
    "Przechowywać w lodówce, do 5 dni.",
    "Smacznego :-).",
    "* Posiadam jedną taką formę, więc składniki podzieliłam na pół i przygotowałam bezpośrednio przed pieczeniem. Gotowe surowe ciasto nie może czekać na upieczenie poprzedniego - białka opadną.",
    "** Puszki z brzoskwiniami są o różnej masie - mogę podpowiedzieć, że będziecie potrzebować około 400 ml syropu z brzoskwiń."
  ],
  "ingredients": [
    "0",
    "Ciasto popularne i dość znane, bardzo lubiane! Przyznam, że piekłam je po raz pierwszy (generalnie nie przepadam za pieczeniem ciast wielowarstwowych - w przeszłości zdarzało mi się zapomnieć o jednej z warstw ;-). Nie bardzo wiedziałam jakiego smaku się spodziewać: mamy tutaj bardzo wiele różnych połączeń - orzechy, kawa, rodzynki, wiórki, brzoskwinie, czekolada... ale po skosztowaniu pierwszego kawałka pomyślałam 'Hej, ja to ciasto już gdzieś jadłam :-)'. Ciasto jest dość popularne w Polsce na uroczystości weselne lub komunijne - może stąd znałam już jego smak? Jest naprawdę bardzo smaczne; wilgotne, nie za słodkie, nawet można powiedzieć, że lekko orzeźwiające. Cała blacha znika nie wiadomo w jakich okolicznościach ;-).",
    "Przed przystąpieniem do wykonania ciasta bardzo proszę przeczytać przepis od początku do końca.",
    "Składniki na ciasto:",
    "8 białek",
    "200 g drobnego cukru do wypieków",
    "3 żółtka",
    "200 g zmielonych orzechów laskowych lub włoskich",
    "100 g wiórków kokosowych",
    "100 g rodzynków",
    "3 łyżki mąki pszennej",
    "1 łyżeczka proszku do pieczenia",
    "Wszystkie składniki powinny być w temperaturze pokojowej. Zmielone orzechy, wiórki, rodzynki, przesianą mąkę i proszek do pieczenia - wymieszać, odłożyć.",
    "W misie miksera ubić białka, na sztywno. Łyżka po łyżce, powoli, dodawać cukier, nie zaprzestając ubijania (kolejną łyżkę cukru dodajemy po ropuszczeniu się poprzednio dodanej łyżki). Powinna powstać gęsta, błyszcząca i sztywna piana. Dodać żółtka i ubić (nie zmieniając końcówki miksera). Wsypać odłożone wcześniej suche składniki i delikatnie wymieszać szpatułką.",
    "2 formy o wymiarach 28 x 38 cm (lub trochę mniejszą) z wysokimi bokami wyłożyć papierem do pieczenia. Ciasto podzielić na dwie części, wyłożyć do foremek, wyrównać.*",
    "Piec w temperaturze 160ºC przez około 35 minut do otrzymania sztywnych, chrupiących blatów. Jeden z blatów pozostawić w formie.",
    "Krem brzoskwiniowy:",
    "syrop z 1 dużej puszki brzoskwiń (puszka o łącznej masie 820 g)**",
    "5 łyżek cukru",
    "300 ml wody",
    "2 opakowania budyniu śmietankowego (bez cukru, opakowanie standardowe na 500 ml mleka)",
    "5 żółtek",
    "1 łyżka mąki pszennej",
    "300 g masła",
    "Wszystkie składniki powinny być w temperaturze pokojowej.",
    "Do garnuszka przelać 400 ml syropu z brzoskwiń, 150 ml wody i cukier. Zagotować.",
    "W osobnej miseczce zmiksować blenderem kolejne 150 ml wody, budynie śmietankowe (proszek), żółtka i mąkę pszenną. Mieszankę wlać na wrzący syrop brzoskwiniowy i ugotować budyń. Budyń przełożyć do miseczki, przykryć folią spożywczą (folia powinna dotykać budyniu) i odstawić do całkowitego wystudzenia.",
    "W misie miksera utrzeć masło, przez kilkanaście minut, do puszystości. Dodawać budyń, łyżka po łyżce, cały czas ucierając do powstania gładkiej, bezgrudkowej masy.",
    "Ponadto:",
    "1/3 szklanki likieru kawowego lub wódki wymieszanej z 1/3 szklanki mocnej kawy, wystudzonej",
    "2 opakowania delicji o smaku pomarańczowym",
    "2 galaretki o smaku brzoskwniowym",
    "brzoskwinie pozostałe z puszki, pokrojone w plasterki"
  ],
  "__v": 1
}