{
  "hash": "050d3f711c51e0c01e6574e4aa14fffe711dd048",
  "title": "Pancetta Bacon Pasta",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2011/1/11/0/DV1102H_pancetta-bacon-pasta_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/pancetta-bacon-pasta-recipe.html",
  "firstAdded": "2015-01-24T19:35:24.799000",
  "users": [
    null
  ],
  "keywords": [
    "clarified",
    "butter",
    "pancetta",
    "recipe",
    "follows",
    "garlic",
    "white",
    "wine",
    "cream",
    "pasta",
    "parmesan",
    "pepper",
    "salt",
    "professional",
    "scaled",
    "bulk",
    "provided",
    "restaurant",
    "food",
    "network",
    "kitchens",
    "chefs",
    "tested",
    "proportions",
    "indicated",
    "make",
    "representation",
    "results",
    "pork",
    "belly",
    "pink",
    "kosher",
    "brown",
    "sugar",
    "black",
    "dusting",
    "juniper",
    "berries",
    "cracked",
    "bay",
    "leaves",
    "crumbled",
    "nutmeg",
    "allspice",
    "thyme",
    "pureed",
    "sprigs"
  ],
  "directions": [
    "0",
    "Heat the butter in a large saute pan. Add the Pancetta and saute until slightly brown. Add the garlic, saute briefly, and then deglaze with the wine. Reduce the wine by half, and then add the heavy cream. Reduce this by one third, and then toss in your cooked pasta. Heat the pasta through and add the Parmesan, white pepper, and salt and toss. Pour into bowls and add more Parmesan cheese (as much as you like).",
    "Ask your butcher for a 5 pound, nice square piece of pork belly (skinless) that will fit into a 2-gallon zip-top bag.",
    "Pat the belly with paper towels to dry. Mix together all the spices. Wearing plastic gloves, rub the cure mixture into both sides of the belly. Place in a 2-gallon zip-top bag, put on a sheet pan, and refrigerate. Every day for 1 week, turn the bag over and massage the belly (through the bag) to ensure saturation. The pork will take on a slightly darker color than what it was. This is a sign that the cure is working. It will also draw some moisture out of the belly. When the meat is darker and firmer, remove the belly from the bag and run under water to remove any cure sediment. Pat dry and lightly cover with a dusting of ground white pepper. Roll the belly very tightly into a log and wrap tightly with cheesecloth. Tie the end and hang in a 34 to 38 degree F refrigerator for at least 2 weeks.At this time the bacon should be fully cured and have a good firmness when squeezed.",
    "Recipe courtesy David Hill, owner Hills' Restaurant and Lounge in Spokane, WA."
  ],
  "ingredients": [
    "0",
    "1 tablespoon clarified butter",
    "1 pound 4 ounces Pancetta, diced, recipe follows",
    "1 teaspoon finely diced garlic",
    "1/4 cup white wine",
    "5 ounces heavy cream",
    "Cooked pasta, for serving",
    "1/4 cup finely grated Parmesan, plus more for serving",
    "1/4 teaspoon ground white pepper",
    "1/4 teaspoon salt",
    "This recipe was provided by professional chefs and has been scaled down from a bulk recipe provided by a restaurant. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results.",
    "5 pounds fresh pork belly",
    "2 teaspoons pink salt",
    "2 ounces kosher salt",
    "2 1/2 tablespoons brown sugar",
    "4 tablespoons ground black pepper",
    "1 tablespoon ground white pepper, plus more for dusting",
    "2 tablespoons juniper berries, cracked",
    "5 bay leaves, crumbled small",
    "1 teaspoon ground nutmeg",
    "1/4 teaspoon ground allspice",
    "1 tablespoon dried thyme leaves",
    "2 tablespoons pureed fresh garlic",
    "5 sprigs fresh thyme"
  ],
  "__v": 1
}