{
  "hash": "394460282468859b26001b87439921f7b89f248a",
  "title": "INSTRUCTIONS\nNote: click on times in the instructions to start a kitchen timer while cooking. Preheat oven to 375 degrees.\nMix 1/4 cup canola oil, salt and pepper with sliced carrots and potatoes.\nMix 1 tbsp canola oil, brown sugar, garlic and rub all over pork loin.\nOn one large cookie sheet, put down some foil and add the carrots and potatoes.\nSpread apart the vegetables to make an opening in the pan for the pork.\nAdd the pork to the pan.\nRoast the pork and vegetables for 40-50 minutes, or until a meat thermometer registers at 150 degrees in the center of the roast. Open your oven and remove the pork onto a plate or cutting board to let it rest and cover it with a piece of foil.\nLet the pork rest for 5-10 minutes, then remove the veggies from the oven once you are ready to serve the pork. This allows them to finish cooking while only using one pan and makes sure they are hot when the pork has rested.\nNUTRITION INFORMATION",
  "image": "https://dinnerthendessert.com/wp-content/uploads/2015/07/Brown-Sugar-Garlic-Pork-312x232.jpg",
  "href": "https://dinnerthendessert.com/brown-sugar-garlic-pork-with-carrots-potatoes/",
  "extension": "Chrome",
  "firstAdded": "2018-08-14T02:07:27.792000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Note: click on times in the instructions to start a kitchen timer while cooking.",
    "Preheat oven to 375 degrees.",
    "Mix 1/4 cup canola oil, salt and pepper with sliced carrots and potatoes.",
    "Mix 1 tbsp canola oil, brown sugar, garlic and rub all over pork loin.",
    "On one large cookie sheet, put down some foil and add the carrots and potatoes.",
    "Spread apart the vegetables to make an opening in the pan for the pork.",
    "Add the pork to the pan.",
    "Roast the pork and vegetables for 40-50 minutes, or until a meat thermometer registers at 150 degrees in the center of the roast.",
    "Open your oven and remove the pork onto a plate or cutting board to let it rest and cover it with a piece of foil.",
    "Let the pork rest for 5-10 minutes, then remove the veggies from the oven once you are ready to serve the pork.",
    "This allows them to finish cooking while only using one pan and makes sure they are hot when the pork has rested.",
    "NUTRITION INFORMATION"
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "2 lb pork loin trimmed of excess fat",
    "4 garlic cloves minced",
    "4 tablespoons brown sugar",
    "1 tablespoon canola oil",
    "2 lbs carrots peeled and sliced",
    "2 lbs potatoes scrubbed and cut into 1 inch chunks",
    "1/4 cup canola oil for vegetables",
    "salt and pepper to taste"
  ],
  "__v": 1
}