{
  "hash": "e0df1af9f86bffcc43fdd3241ca70254be80652e",
  "title": "Dark Chocolate Pudding",
  "image": "",
  "href": "http://cooking.nytimes.com/recipes/1017198-dark-chocolate-pudding?action=click&module=Collection+Band+Recipe+Card&region=Our+Best+Chocolate+Recipes&pgType=supercollection&rank=4",
  "extension": "Chrome",
  "firstAdded": "2016-11-08T22:04:44.019000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "PREPARATION",
    "In a small heatproof bowl, whisk together egg and yolks. Set aside.",
    "Place chocolate, butter and vanilla extract in a food processor or blender but don’t turn on.",
    "In a medium pot, whisk together milk, cream, brown sugar, cocoa, cornstarch and salt until smooth. Bring to a full boil, whisking, and let bubble for 1 to 2 minutes to activate cornstarch. At that point, it will start to thicken, and when it does immediately pull the pot off the heat. (You don’t want to overboil the cornstarch, which can cause it to thin out again.)",
    "Pour a little of the hot cornstarch mixture into the eggs, stirring constantly to prevent them from curdling, then pour eggs back into the pan with the remaining cornstarch mixture. Cook over low heat, whisking constantly, until mixture just returns to a bare simmer (one bubble is plenty). Immediately pour into the food processor or blender. Run the machine until the pudding is very smooth (the hot milk mixture will melt the chocolate).",
    "Pour into individual bowls or teacups or 1 large decorative bowl and cover with plastic wrap. Refrigerate until firm and cold, at least 4 hours for individual servings and as many as 8 hours for 1 large bowl. Pudding can be made 3 days ahead. Serve with whipped cream or whipped crème fraîche, decorated with chocolate shavings and a pinch of sea salt, if you like."
  ],
  "ingredients": [
    "0",
    "NGREDIENTS",
    "1 large egg, plus 2 yolks",
    "6 ounces/170 grams bittersweet chocolate, preferably 66 percent to 74 percent cacao, chopped",
    "2 tablespoons/30 grams unsalted butter, softened",
    "1 teaspoon/5 milliliters vanilla extract",
    "2 ½ cups/590 milliliters whole milk",
    "½ cup/120 milliliters heavy cream",
    "⅓ cup/67 grams light or dark brown sugar",
    "2 tablespoons/15 grams unsweetened cocoa powder",
    "2 tablespoons/20 grams cornstarch",
    "¼ teaspoon/2 grams fine sea salt",
    "Whipped cream or crème fraîche, for serving",
    "Chocolate shavings, for garnish (optional)",
    "Flaky sea salt, for garnish (optional)"
  ],
  "__v": 1
}