{
  "hash": "e3bf313286995dc1b1a8b0ba3393c8e16c863f51",
  "title": "Hello, Tamago Kake Gohan, Your Time Has Come",
  "image": "http://www.seriouseats.com/images/2016/04/20140416-tamago-kake-gohan-recipe-14.jpg",
  "href": "http://www.seriouseats.com/2016/04/tamago-kake-gohan-japanese-egg-rice-tkg.html",
  "extension": "Chrome",
  "firstAdded": "2016-05-01T15:29:48.965000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Some people like to be fussy, perhaps separating the egg and mixing the white into the rice first before folding in the yolk. Others will whip together the soy sauce and the egg before stirring it into the rice. I've tried all these techniques, and honestly, I can find absolutely no reason to use them when the easiest method works just as well: Dump the egg into the rice, season it, and stir. Making a little well in the rice helps a bit, and it looks cute and all, but it's also not necessary by any means.",
    "My grandmother always used extremely simple seasonings. A drizzle of soy sauce, a little pinch of salt, a little pinch of MSG, and some finely torn or shredded nori. Some people like to add a dash of dashi (or, more frequently, some granules of Hondashi), which can give it an appealingly savory and smoky flavor. Some people will drizzle in mirin for sweetness. I generally don't bother, although, when I've got some on hand, I've been known to use bottled, concentrated soba noodle tsuyu, which contains all of those ingredients in a conveniently premixed form.",
    "The real trick is in the beating. You need to beat thoroughly, and you need to beat vigorously. It'll take a little effort to get all the clumps out of the rice, but you want to continue beating even after that's happened. Just like creaming butter and sugar for a cookie dough, as you beat the rice and egg mixture, it will incorporate more and more air. Meanwhile, egg proteins will also stretch and tangle, giving the dish more cohesion. By the time you're done, the mixture should flow and settle very, very slowly in the bowl—just slightly thicker than an Italian-style risotto, but far lighter."
  ],
  "ingredients": [
    "0",
    "Start with a bowl of rice—about a cup of cooked rice per egg is right. So long as it's not stale, it can be cold, lukewarm, hot, or anywhere in between. If you've got leftover rice in the fridge, put some in a bowl, cover it with a saucer, and microwave it for a minute, and it'll be good to go.",
    "Next, you need an egg. You do want to use a good, clean egg and break it cleanly, as you're going to be eating it raw. If you are squeamish about such things, buy pasteurized eggs (or pasteurize them yourself, using a sous vide circulator at 135°F for two hours), or gently coddle your eggs in simmering water for a couple of minutes before adding them. Coddled eggs won't have quite the same lightness after they're added to the rice, but you'll get the general effect."
  ],
  "__v": 1
}