{
  "hash": "e63386c57718523e66fc4412ed60fe73f811f737",
  "title": "Rosemary Focaccia",
  "image": "http://www.onceuponachef.com/images/2015/01/Rosemary-Focaccia-11.jpg",
  "href": "http://www.onceuponachef.com/recipes/rosemary-focaccia.html",
  "extension": "Chrome",
  "firstAdded": "2017-08-08T07:06:21.325000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine the warm water, yeast and sugar in a small bowl; stir to dissolve the sugar and yeast. Let sit about 10 minutes, until the mixture is foamy. (This is called proofing the yeast, or making sure it is active; if it doesn't foam, it's not fresh and won't work.)",
    "In the bowl of a mixer fitted with a dough hook, combine the flour and 1 tablespoon of kosher salt. Mix briefly on low speed to combine. Add the yeast mixture and 1/2 cup of olive oil; mix on low speed until the dough comes together, then turn the speed up to medium and continue to knead for 5 to 6 minutes, until the dough becomes smooth and soft. Sprinkle with a bit of flour if the dough is really sticky and tacky.",
    "Transfer the dough to a clean, very lightly floured surface. Knead by hand briefly until the dough comes together into a smooth ball.",
    "Clean the mixer bowl if necessary (sometimes the dough will come out entirely but sometimes a bit of dough might stick), then coat the inside of the bowl with about 1 teaspoon of olive oil. Return the dough to the bowl, flipping once so that both the top and bottom of dough are lightly slicked with oil. Cover the bowl with plastic wrap and put it in a warm, draft-free place until the dough has doubled in size, 1-2 hours. (Hint: the warmer the spot, the faster it will rise.)",
    "Coat a 12\" x 16\" rimmed baking sheet with 1/4 cup of olive oil. (It will seem like a lot, but that's what makes the bottom crispy.) Plop the dough onto the prepared pan and begin pressing it out with your hands to fit the size of the pan. Turn the dough over a few a times to coat both sides with olive oil. Continue to stretch the dough to fit the pan. Once the dough is stretched, spread your fingers out and make impressions almost all the way through the dough (don't poke holes, just press down to the bottom of the pan). Cover the pan with plastic wrap and place in the warm, draft-free spot until the dough has puffed up and doubled in size, about 1 hour.",
    "While the dough is rising a second time, preheat the oven to 425 degrees F. Set the oven rack in the middle position.",
    "Sprinkle the top of the focaccia with the remaining 3/4 teaspoon kosher salt and rosemary, then lightly drizzle 1-2 teaspoons of olive oil on top so it pools in the indentations. Bake until golden brown, about 20 minutes. Remove the focaccia from the oven and let it cool in the pan on a wire rack for about 15 minutes. Transfer the focaccia to a cutting board and slice into squares. Drizzle a touch more oil on top before serving, if desired."
  ],
  "ingredients": [
    "0",
    "1-3/4 cup warm water",
    "1 packet (2-1/4 teaspoons) active dry yeast (not instant active dry yeast or rapid rise yeast)",
    "1 tablespoon sugar",
    "5 cups all purpose flour, spooned into measuring cup and leveled-off with a knife, plus more for kneading",
    "1 tablespoon + 3/4 teaspoon kosher salt, divided",
    "3/4 cup extra virgin olive oil, divided, plus more for oiling the bowl and drizzling on top",
    "1 tablespoon chopped fresh rosemary, from several sprigs"
  ],
  "__v": 1
}