{
  "hash": "3fd117e2429353a8a0e96f719e18e2c3785e3733",
  "title": "Zucchini Muffins Recipe\nPrep time: 15 minutesCook time: 25 minutesYield: Makes 12-14 muffins",
  "image": "",
  "href": "https://www.simplyrecipes.com/recipes/zucchini_muffins/",
  "extension": "Chrome",
  "firstAdded": "2019-08-03T11:29:41.530000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "METHOD",
    "You don't need a mixer for this recipe.",
    "1 Mix eggs, sugar, vanilla, then add zucchini and melted butter: Preheat the oven to 350°F (175°C). Beat the eggs in a large bowl. Mix in the sugar and vanilla extract. Stir in the grated zucchini and the melted butter.",
    "2 Mix dry ingredients: In a separate bowl, mix together the flour, baking soda, baking powder, cinnamon, ground ginger, nutmeg, and salt.",
    "3 Combine to make batter: Stir these dry ingredients into the zucchini mixture. (Do not over-mix!) Stir in walnuts, raisins or cranberries if using.",
    "4 Fill muffin pan: Coat each muffin cup in your muffin pan with a little butter or vegetable oil spray. Use a spoon to distribute the muffin dough equally among the cups, filling the cups up completely, above the surface of the muffin tin.",
    "5 Bake: Bake at 350°F on the middle rack until muffins are golden brown, and the top of the muffins bounce back when you press on them, about 20-30 minutes. Test with a long toothpick or a thin bamboo skewer to make sure the center of the muffins are done.",
    "Set on wire rack to cool for 5 minutes. Remove muffins from the tin let cool another 20 minutes."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "2 large eggs",
    "1 1/3 cup (280 g) sugar",
    "2 teaspoons vanilla extract",
    "3 cups (packed) grated fresh zucchini",
    "3/4 cup unsalted butter, melted",
    "2 3/4 cups (400 g) all-purpose flour",
    "1 teaspoon baking soda",
    "1 teaspoon baking powder",
    "1/4 teaspoon salt",
    "2 teaspoons cinnamon",
    "1 teaspoon ground ginger",
    "1/2 teaspoon nutmeg",
    "1 cup walnuts (optional)",
    "1 cup raisins or dried cranberries (optional)"
  ],
  "__v": 1
}