{
  "hash": "325fc439dfe5f11239aec8d3d65a6511488cae97",
  "title": "Rib-Eye Steak With Tomato Vinaigrette and Smashed Potatoes",
  "image": "http://cdn-image.realsimple.com/sites/default/files/styles/rs_main_image/public/1437160804/rib-eye-steak.jpg?itok=sTid5VGn",
  "href": "http://www.realsimple.com/food-recipes/browse-all-recipes/rib-eye-steak-tomato-vinaigrette",
  "extension": "Chrome",
  "firstAdded": "2015-12-06T20:00:47.958000",
  "users": [
    null
  ],
  "keywords": [
    "fingerling",
    "potatoes",
    "kosher",
    "salt",
    "black",
    "pepper",
    "chives",
    "olive",
    "oil",
    "sherry",
    "red",
    "wine",
    "vinegar",
    "cherry",
    "grape",
    "tomatoes",
    "sugar",
    "boneless",
    "ribeye",
    "steaks",
    "total"
  ],
  "directions": [
    "0",
    "DIRECTIONS",
    "Place the potatoes in a large pot and add enough cold water to cover. Bring to a boil and add 2 teaspoons salt. Reduce heat and simmer until very tender, 15 to 18 minutes. Drain and return to the pot. Toss in the chives, 2 tablespoons of the oil, 1 tablespoon of the vinegar, and ¼ teaspoon each salt and pepper. Lightly flatten each potato with a spoon. Cover to keep warm.",
    "Meanwhile, combine the tomatoes, sugar, 3 tablespoons water, the remaining 3 tablespoons of vinegar, and ¼ teaspoon each salt and pepper in a medium saucepan over medium-high heat. Cook, stirring occasionally, until the tomatoes are soft and the liquid is thickened, 6 to 8 minutes.",
    "Heat the remaining tablespoon of oil in a large skillet over medium-high heat. Season the steaks with ½ teaspoon salt and ¼ teaspoon pepper. Cook until an instant-read thermometer inserted into the thickest part of each steak registers 130° F, 4 to 5 minutes per side for medium-rare. Let rest for 5 minutes, then slice against the grain.",
    "Serve the tomato vinaigrette over the steak with the potatoes alongside."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1¼pounds fingerling potatoes",
    "Kosher salt and black pepper",
    "2tablespoons chopped fresh chives",
    "3tablespoons olive oil",
    "4tablespoons sherry or red wine vinegar",
    "1pint cherry or grape tomatoes, halved",
    "2teaspoons sugar",
    "2 boneless rib-eye steaks (1 inch thick; about 2 pounds total)"
  ],
  "__v": 1
}