{
  "hash": "a29399ee4e94adf1c47e9e00f118c783e3a82ab0",
  "title": "BAKED CAULIFLOWER WINGS",
  "image": "http://myfridgefood.com/media/6843/cauliflowerwingsmango.jpg",
  "href": "http://myfridgefood.com/recipes/appetizer/baked-cauliflower-wings",
  "firstAdded": "2014-12-21T18:14:07.020000",
  "users": [
    null
  ],
  "keywords": [
    "head",
    "cauliflower",
    "smallmediumish",
    "size",
    "batter",
    "water",
    "flour",
    "used",
    "wheat",
    "white",
    "salt",
    "garlic",
    "onion",
    "smoked",
    "paprika",
    "chili",
    "powdercayenne",
    "generous",
    "black",
    "pepper",
    "oil",
    "mango",
    "sriracha",
    "glaze",
    "jam",
    "preserves",
    "use",
    "orange",
    "marmalade",
    "grape",
    "jelly",
    "variations",
    "hot",
    "franks",
    "red",
    "apple",
    "juice",
    "thinner"
  ],
  "directions": [
    "0",
    "Preheat the oven to 450 degrees F. Chop the cauliflower into5-2 inch pieces. Mix everything under batter in a bowl until smooth and thick enough batter that can coat the cauliflower pieces well.(add more flour if needed). Dip cauliflower in the batter and place on parchment lined baking sheet. Line the sheet with parchment or grease very well. Bake for 20 minutes.",
    "Glaze: (optional)",
    "In a pan, mix all the ingredients under glaze and heat on medium. Taste and adjust spice, sweet and tang if needed(add sugar or vinegar for extra sweet or tang). You can also use fresh or frozen ripe mango puree + maple/sugar instead of preserves. Once the glaze is hot, taste and adjust spice + sweet. add the baked cauliflower to it. Toss well to coat carefully and let the glaze come to a boil. 1-2 minutes. You can use a large pan that can fit all the florets or do 2 batches. do not toss/move the florets too much. Remove from pan and Serve hot as is, or with rice/grains or with any creamy cool dips like ranch. Alternatively, bring the sauce ingredients to a boil and pour over the baked cauliflower, mix to coat and serve.",
    "Variations: Use grape jelly or Orange preserves. Add a 1/4 cup ketchup to the glaze.",
    "Use Barbecue sauce or sweet and sour sauce."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "1 head of cauliflower (mine was small-medium-ish size)",
    "Batter:",
    "1 cup water",
    "3/4 cup + 2 Tbsp flour (I used half whole wheat + half white)",
    "3/4-1 tsp salt or to taste",
    "1 tsp each of garlic powder, onion powder",
    "1/2 tsp each of smoked paprika, chili powder/cayenne",
    "a very generous dash of black pepper",
    "2 tsp oil (optional)",
    "Mango Sriracha Glaze:",
    "1 cup mango jam or preserves (or use orange marmalade or grape jelly for variations)",
    "1/4 cup Sriracha sauce or Hot sauce to taste",
    "1 Tbsp or more hot sauce or to taste (I used Frank’s red hot)",
    "1/4 cup Orange juice or apple juice (more juice if you like a thinner glaze)",
    "a generous pinch of garlic powder"
  ],
  "__v": 1
}