{
  "hash": "7a692403f4c1204793acfe524f5b1886466a6535",
  "title": "S'mores Peanut Butter Cups",
  "image": "http://cf.spendwithpennies.com/wp-content/uploads/2016/08/smores-cups-for-SWP-1-of-1-5.jpg",
  "href": "http://www.spendwithpennies.com/smores-peanut-butter-cups/",
  "extension": "Chrome",
  "firstAdded": "2016-10-28T19:36:12.944000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Set out 20 cupcake liners on a cookie sheet (I prefer the foil kind as they are sturdier, but regular paper ones would work, too).",
    "Break or cut your graham crackers into rectangles that are small enough to fit snugly in the bottom of your cupcake liners (they do not have to be exactly round -- I got about 4-5 pieces out of each graham cracker)",
    "Spread each cracker piece with about 1 tsp of peanut butter -- set aside.",
    "Spoon your marshmallow fluff into a Ziploc bag and set aside.",
    "Prepare your chocolate by placing the chocolate chips and shortening in a large, microwave-safe bowl and microwaving in 25-second increments (stirring well between each) until chocolate is completely melted.",
    "Spoon a small amount (about 1 Tbsp) of chocolate into a cupcake liner until the entire bottom of the liner is covered.",
    "Place a peanut butter-topped graham cracker piece on top of the chocolate.",
    "Cut a hole in the corner of the bag holding your marshmallow fluff and pipe about 1 Tbsp of fluff on top of each cracker.",
    "Spoon chocolate on top of marshmallow fluff until covered (make sure the sides are covered as well).",
    "Repeat until all cupcake liners are filled.",
    "Place cookie sheet with filled liners in refrigerator and allow cups to chill at least 30 minutes before serving."
  ],
  "ingredients": [
    "0",
    "5 graham crackers",
    "½ cup creamy peanut butter",
    "1½ cup marshmallow fluff (or homemade)",
    "3 cups milk chocolate chips",
    "2 tsp shortening (like Crisco)"
  ],
  "__v": 1
}