{
  "hash": "094097e024c84ae8df36f24de0b052cf4fc3c65c",
  "title": "Lighter Chicken Piccata Risotto with Crispy Capers",
  "image": "http://cdn.iowagirleats.com/wp-content/uploads/2014/10/Lighter-Chicken-Picatta-Risotto-with-Crispy-Capers-iowagirleats-14_mini.jpg",
  "href": "http://iowagirleats.com/2014/10/06/chicken-piccata-risotto-crispy-capers/",
  "extension": "Chrome",
  "firstAdded": "2016-09-07T20:48:56.592000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "Bring chicken broth to a boil in a saucepan then turn heat to low and keep at a simmer. Meanwhile, heat 1 Tablespoon each butter and extra virgin olive oil in a large pan over medium heat. Add shallot, season with salt and pepper, then sauté until tender, 2-3 minutes. Add garlic and dried thyme then sauté for 1 minute. Add rice then stir to coat and cook for 1 minute.",
    "Add hot chicken broth all at once then stir near constantly until rice is tender and nearly all the broth is absorbed, 25-30 minutes, keeping broth at a simmer over medium heat. When nearly all the broth has been absorbed but rice is still creamy, add spinach then keep stirring until rice is cooked through. Remove pan from heat then stir in the juice from 1/2 lemon, parmesan cheese, and remaining 1 Tablespoon butter. Taste then add salt and pepper if necessary and then set aside.",
    "Meanwhile, heat remaining 2 Tablespoons extra virgin olive oil in a large skillet over medium-high heat. Add capers then sauté until slightly opened, brown, and crispy, 2-3 minutes. Transfer with a slotted spoon to a paper towel-lined plate to drain. Season chicken breasts on both sides with salt and pepper then saute in caper-infused olive oil for 3-4 minutes on both sides. When chicken has 1 minute left to saute, squeeze second lemon half over chicken. Plate risotto then top with chicken and sprinkle crispy capers on top."
  ],
  "ingredients": [
    "0",
    "ngredients",
    "SERVES 4",
    "5 cups chicken broth",
    "3 Tablespoons extra virgin olive oil, divided",
    "2 Tablespoons butter, divided",
    "1 large shallot, chopped",
    "1 clove garlic, minced",
    "1/4 teaspoon dried thyme",
    "salt and pepper",
    "1 cup RiceSelect Arborio Rice",
    "2 cups baby spinach, roughly chopped",
    "1 lemon, cut in half",
    "1/4 cup freshly grated parmesan cheese",
    "1/4 cup capers, drained and patted dry very well",
    "4 chicken breasts"
  ],
  "__v": 1
}