{
  "hash": "954cae71bd2fba1dad8d73133b0baa4bef572915",
  "title": "Hot N' Cheesy Spinach & Artichoke Dip",
  "image": "http://i0.wp.com/thekitchenmagpie.com/wp-content/uploads/images/2010/06/Spinach-Artichoke-Dip_512x3841.jpg?resize=512%2C384",
  "href": "http://www.thekitchenmagpie.com/hot-n-cheesy-spinach-artichoke-dip/",
  "extension": "Chrome",
  "firstAdded": "2015-06-27T23:03:15.567000",
  "users": [
    null
  ],
  "keywords": [
    "roasted",
    "garlic",
    "frozen",
    "spinach",
    "defrosted",
    "artichokes",
    "cream",
    "cheese",
    "sour",
    "parmigianoreggiano",
    "mozzarella",
    "pepper"
  ],
  "directions": [
    "0",
    "Kick the tires and light the fires to 350 degrees.",
    "This is as easy as falling off a horse. Mix the cream cheese, sour cream, very squeezed out spinach, roasted garlic that you chopped or smushed up, the chopped artichokes and pepper. Cream it all together well.",
    "Whip it up, get that spinach broken up, the creams melded together, don’t worry, the more you mix it, the better it is.",
    "Then add in the cheese. Now this Parmigiano-Reggiano makes this dip taste amazing. That and the roasted garlic give this hot dip an edge on most others.",
    "Mix in half the mozzarella cheese.",
    "Place your dip into a greased baking pan or pyrex baking container and add the remaining mozza cheese to the top.",
    "Bake uncovered at 350 for 20-25 minutes until the cheese is melted and a knife inserted in the middle comes out hot.",
    "Then you can serve it piping hot out of the oven, put some lovely artisan breads in there (which I did not make myself, as if) or vegetables, crackers, you name it.",
    "If you cover it with tinfoil for a few minutes, you also heat the bread up quite nicely before serving."
  ],
  "ingredients": [
    "0",
    "4-5 cloves of roasted garlic",
    "1 package of frozen spinach, defrosted and well drained",
    "1 can of artichokes, chopped up",
    "1 package of cream cheese",
    "¼ cup of sour cream",
    "⅓ cup of shredded Parmigiano-Reggiano cheese",
    "¾ cup of mozzarella cheese",
    "1 tsp of pepper"
  ],
  "__v": 1
}