{
  "hash": "28735790639460978933baa6c85dd005d0b8b9a3",
  "title": "Parsnip Hummus with Garlic Chili Oil (Vegan, Paleo)",
  "image": "http://gourmandeinthekitchen.com/wp-content/uploads/2014/02/Parsnip-Hummus-with-Chili-Oil-on-gourmandeinthekitchen.com-paleo-vegan.jpg?c3c4ca",
  "href": "http://gourmandeinthekitchen.com/2014/parsnip-hummus-dip-recipe/",
  "firstAdded": "2015-01-06T14:36:23.647000",
  "users": [
    null
  ],
  "keywords": [
    "tablespoonsml",
    "coconut",
    "oil",
    "garlic",
    "clove",
    "red",
    "pepper",
    "tablespoonml",
    "extra",
    "virgin",
    "olive",
    "parsnips",
    "cubed",
    "pieces",
    "cupml",
    "divided",
    "use",
    "cumin",
    "coriander",
    "himalayan",
    "salt",
    "tablespoonsg",
    "tahini",
    "sesame",
    "seed",
    "squeezed",
    "lemon",
    "juice",
    "filtered",
    "water",
    "parsley",
    "leaves",
    "finish"
  ],
  "directions": [
    "0",
    "Place the coconut oil, garlic, and red pepper flakes in a small skillet over low heat. Cook until the garlic and red pepper is fragrant and darkens but doesn’t burn (about 3 minutes).",
    "Remove from heat, add in extra virgin olive oil and cover with lid and let cool to room temperature while you prepare the hummus. Strain oil before serving with the dip.",
    "Bring the cubed parsnips along with 2 Tablespoons of the olive oil, cumin, coriander and salt and ¼ cup of filtered water to a simmer over medium-low heat in a medium sauté pan , stirring to coat as necessary.",
    "Cover and reduce heat to low, cook for 10-15 minutes until the parsnips are tender and easily pierced with the tip of a knife.",
    "Puree the cooked parsnips along with the minced garlic, tahini, and remaining 2 Tablespoons of olive oil and lemon juice in a food processor until smooth and thick, scraping down the sides of the food processor as necessary (about 2 minutes). Add additional salt or lemon juice to taste.",
    "With the motor running slowly drizzle in enough of the remaining water to create a light fluffy consistency (another 2 to 3 minutes). Spoon into a bowl and let cool to room temperature or covered in the fridge before serving.",
    "Serve drizzled with the garlic chili oil and chopped parsley with chopped vegetables or crackers alongside."
  ],
  "ingredients": [
    "0",
    "2 Tablespoons/30ml coconut oil",
    "1 large garlic clove, peeled and minced",
    "1 Tablespoon red pepper flakes",
    "2 Tablespoon/30ml extra virgin olive oil",
    "1 lb parsnips (about 6), peeled and cubed into 1 inch pieces",
    "1/4 cup/60ml extra virgin olive oil (divided use)",
    "1 ½ teaspoons ground cumin",
    "¼ teaspoon ground coriander",
    "¾ teaspoon sea salt or Himalayan salt",
    "2 large garlic cloves, finely minced",
    "6 Tablespoons/90g tahini (sesame seed paste)",
    "4 Tablespoons/60ml freshly squeezed lemon juice",
    "6 Tablespoons/90ml filtered water (divided use)",
    "Freshly chopped parsley leaves to finish (optional)"
  ],
  "__v": 1
}