{
  "hash": "c02fdd87ea647051d044aaf1c25d46897143c8d8",
  "title": "Chicken and Potatoes with Garlic Parmesan Cream Sauce",
  "image": "//dsms0mj1bbhn4.cloudfront.net/v2/3935ce4ae884713b3ae97c698ecd5c3d080fda05/images/share-buttons/share-headers-new/sharing-shr.png",
  "href": "http://damndelicious.net/2016/05/08/chicken-potatoes-garlic-parmesan-cream-sauce/",
  "extension": "Chrome",
  "firstAdded": "2016-05-19T23:20:00.164000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400 degrees F. Lightly oil a 9×13 baking dish or coat with nonstick spray.",
    "Season chicken with Italian seasoning, salt and pepper, to taste.",
    "Melt 2 tablespoons butter in a large skillet over medium high heat. Add chicken, skin-side down, and sear both sides until golden brown, about 2-3 minutes per side; set aside.",
    "Melt remaining 1 tablespoon butter in the skillet. Stir in spinach and cook, stirring occasionally, until it begins to wilt, about 2 minutes; set aside.",
    "To make the garlic parmesan cream sauce, melt butter in the skillet over medium heat. Add garlic, and cook, stirring frequently, until fragrant, about 1-2 minutes. Whisk in flour until lightly browned, about 1 minute.",
    "Gradually whisk in chicken broth, thyme and basil. Cook, whisking constantly, until incorporated, about 1-2 minutes. Stir in half and half and Parmesan until slightly thickened, about 1-2 minutes. If the mixture is too thick, add more milk as needed; season with salt and pepper, to taste.",
    "Place chicken in a single layer into the prepared baking dish. Top with potatoes, spinach and cream sauce.",
    "Place into oven and roast until completely cooked through, reaching an internal temperature of 165 degrees F, about 25-30 minutes.",
    "Serve immediately, garnished with parsley, if desired."
  ],
  "ingredients": [
    "0",
    "6 bone-in, skin-on chicken thighs",
    "1 tablespoon Italian seasoning",
    "Kosher salt and freshly ground black pepper, to taste",
    "3 tablespoons unsalted butter, divided",
    "3 cups baby spinach, roughly chopped",
    "16 ounces baby Dutch potatoes, halved*",
    "2 tablespoons chopped fresh parsley leaves",
    "1",
    "1/4 cup unsalted butter",
    "4 cloves garlic, minced",
    "2 tablespoons all-purpose flour",
    "1 cup chicken broth, or more, as needed",
    "1 teaspoon dried thyme",
    "1/2 teaspoon dried basil",
    "1/2 cup half and half*",
    "1/2 cup freshly grated Parmesan",
    "Kosher salt and freshly ground black pepper, to taste"
  ],
  "__v": 1
}