{
  "hash": "6d62f7d245414f62ecc1b49520dbf5eec153b962",
  "title": "Chorizo empanadas",
  "image": "http://fiveandspice.com/wp-content/uploads/2011/09/chorizo_empanadas_2_a.jpg",
  "href": "http://fiveandspice.com/2011/09/12/chorizo-empanadas/",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T22:32:27.119000",
  "users": [
    null
  ],
  "keywords": [
    "empanada",
    "dough",
    "purpose",
    "flour",
    "salt",
    "cold",
    "butter",
    "pieces",
    "ice",
    "water",
    "egg",
    "white",
    "vinegar",
    "glaze",
    "filling",
    "olive",
    "oil",
    "yellow",
    "onion",
    "spanish",
    "chorizo",
    "roasted",
    "red",
    "pepper",
    "arugula",
    "sage",
    "leaves",
    "pine",
    "nuts",
    "clove",
    "garlic",
    "needed",
    "pecorino",
    "romano",
    "creme",
    "fraiche"
  ],
  "directions": [
    "0",
    "Chorizo empanadas (makes 18)",
    "Empanada Dough:",
    "2 1/4 cups all purpose flour",
    "1 teaspoon salt",
    "1/2 cup cold butter, cut up into pieces",
    "1/3 cup ice water",
    "1 egg, beaten",
    "1 tablespoon white vinegar",
    "1 egg, for the glaze",
    "1 1/2 tablespoon water, for the glaze",
    "Empanada filling:",
    "olive oil",
    "1 yellow onion, diced",
    "6 ounces dried Spanish chorizo, finely diced",
    "1 cup roasted red pepper, finely chopped",
    "several handfuls of arugula (2-3 cups), chopped",
    "2 ounces sage leaves",
    "2 ounces pine nuts",
    "1 large clove of garlic",
    "2/3 cups olive oil (plus a little more if needed)",
    "2 ounces grated Pecorino Romano",
    "1 teaspoon salt",
    "1/2 cup creme fraiche",
    "In a food processor, pulse together the dry ingredients for the dough. Then quickly pulse in the butter until the mixture looks like a coarse meal. Add in the beaten egg and ice water, and vinegar pulse until everything comes together to form a dough. Then scoop the dough out (don’t cut yourself on the food processor blade – it happens!) and form it into a ball. Knead it a few times on a lightly floured surface, flatten it into a disc, cover it with plastic wrap, and chill for an hour in the refrigerator. You can also make the dough by hand with rubbing the butter into the dry ingredients with your fingers until you have a course meal. Then, quickly stir in the egg, ice water, and vinegar with a fork until it just combines into a dough.",
    "Heat a couple of splashes of olive oil in a large skillet over medium-high heat. Stir in the onion and cook for a couple of minutes until it becomes translucent. Then, turn the heat down to low and continue to cook, stirring occasionally, until the onions are well caramelized, about 10 minutes. Scrape out of the pan into a bowl.",
    "Add the chopped chorizo to the pan and cook for about 3-5 minutes over medium, until sizzling and lightly crisped on the outside. Transfer the chorizo to the bowl with the onion and wipe the pan clean.",
    "Add just a tiny amount of oil to the pan, then add the roasted pepper, and arugula and cook for just a minute, until the arugula is wilted. Add to the chorizo and onions, stir in salt and pepper to taste, and set aside.",
    "In the bowl of a mortar and pestle (this can also be done in the food processor – if you’ve gotten around to cleaning it since making the dough), pound together the sage leaves, pine nuts, garlic clove, Pecorino, and salt. Little by little, smash in the olive oil, until you have reached a chunky pesto consistency. Stir about half of this into the creme fraiche. Taste, and if you’d like stronger sage flavor, stir in a bit more. (The rest you can reserve for drizzling on top of some other treat.)",
    "When you’re ready to make the empanadas, preheat your oven to 400F. Divide the dough into 18 equal pieces (I generally do this by dividing it in half twice, then into thirds) and roll each piece into a ball. Then, on a lightly floured surface, roll each ball into about a 4 inch circle (maybe a bit smaller).",
    "Spread each circle with a layer of the sage-creme fraiche mixture, leaving a space around the edge that’s between 1/4-1/2 inch. Then, scoop a nice spoonful or two of the chorizo mixture into the middle of each.",
    "Fold the dough in half to make little half-moons, using a little water to moisten the edges and help them to seal. Then, press the edges with the tines of a fork. Place the empanadas on two parchment lined baking sheets. Whisk together the egg and water for the glaze, and lightly brush each of the empanadas with the mixture.",
    "Bake each sheet of empanadas for 15-20 minutes, or until they are golden brown. Transfer to a cooling rack and allow to cool for about 5-10 minutes. Then, serve warm."
  ],
  "ingredients": [
    "0",
    "Empanada Dough:",
    "2 1/4 cups all purpose flour",
    "1 teaspoon salt",
    "1/2 cup cold butter, cut up into pieces",
    "1/3 cup ice water",
    "1 egg, beaten",
    "1 tablespoon white vinegar",
    "1 egg, for the glaze",
    "1 1/2 tablespoon water, for the glaze",
    "Empanada filling:",
    "olive oil",
    "1 yellow onion, diced",
    "6 ounces dried Spanish chorizo, finely diced",
    "1 cup roasted red pepper, finely chopped",
    "several handfuls of arugula (2-3 cups), chopped",
    "2 ounces sage leaves",
    "2 ounces pine nuts",
    "1 large clove of garlic",
    "2/3 cups olive oil (plus a little more if needed)",
    "2 ounces grated Pecorino Romano",
    "1 teaspoon salt",
    "1/2 cup creme fraiche"
  ],
  "__v": 1
}