{
  "hash": "2245c7afae30f4c2a8de8a65d65b59f5889ff2ba",
  "title": "Gluten Free Paleo Seed Fruit Bread Recipe",
  "image": "https://simplygluten-free.com/wp-content/uploads/2012/04/gluten-free-paleo-seed-nut-bread.jpg",
  "href": "https://simplygluten-free.com/blog/2012/04/gluten-free-paleo-seed-fruit-bread-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-02-06T13:28:52.724000",
  "users": [
    null
  ],
  "keywords": [
    "organic",
    "sunbutter",
    "coconut",
    "oil",
    "liquefied",
    "preparing",
    "pan",
    "eggs",
    "lemon",
    "juice",
    "arrowroot",
    "tapioca",
    "starch",
    "kosher",
    "salt",
    "baking",
    "soda",
    "medjool",
    "dates",
    "apricots",
    "dice",
    "roasted",
    "pumpkin",
    "seeds"
  ],
  "directions": [
    "0",
    "Directions",
    "Preheat oven to 350 degrees. Brush an 8 inch by 4 inch loaf pan with some coconut oil. Line the pan with a piece of parchment paper and brush the paper with a little more coconut oil.",
    "Combine the Sunbutter, 2 tablespoons coconut oil, eggs and lemon juice in a mixing bowl and blend with a hand blender until smooth. Whisk the arrowroot powder or tapioca starch with the salt and baking soda and add to the Sunbutter mixture until fully combined. Stir in the chopped dates. Reserve a tablespoon of the chopped apricots and stir the rest into the mixture. Reserve a tablespoon of the seeds and stir the rest into the mixture. Pour the batter into the prepared pan, smooth the top with a spatula, sprinkle the top with the reserved apricots and seeds and gently press them into the top of the bread. Bake for 40 minutes or until the bread is browned and a toothpick inserted into the center of the bread comes out clean. Let cool in the pan for at least 15 minutes.",
    "Servings"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 cup organic, unsweetened Sunbutter",
    "2 tablespoons coconut oil (liquefied) plus more for preparing the pan",
    "3 large eggs",
    "1 teaspoon lemon juice",
    "¼ cup arrowroot powder or tapioca starch",
    "1 teaspoon kosher or fine sea salt",
    "¼ teaspoon baking soda",
    "½ cup Medjool dates, pitted and chopped",
    "½ cup dried apricots, cut into small dice",
    "1 cup roasted pumpkin seeds"
  ],
  "__v": 1
}