{
  "hash": "a1461762299d3573f3f57ab06b3631a0ad49f6eb",
  "title": "Pork Cutlets Parmigiana",
  "image": "https://static01.nyt.com/images/2017/01/20/dining/20COOKING-PORKCUTLETS-PARMIGIANA1/20COOKING-PORKCUTLETS-PARMIGIANA1-articleLarge.jpg",
  "href": "https://cooking.nytimes.com/recipes/12080-pork-cutlets-parmigiana?module=Recipe+of+The+Day&pgType=homepage&action=click",
  "extension": "Chrome",
  "firstAdded": "2018-07-08T22:52:12.817000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "PREPARATION",
    "Pound each slice of pork on a flat surface with a meat pounder or a mallet to about 1/4-inch thick. (Properly pounded slices will look like veal scallopini.)",
    "Place the egg, water, cumin, rosemary and salt and pepper in a mixing bowl, and beat well. Place the bread crumbs on a flat dish.",
    "Dip the pork slices in the egg mixture to coat and then dip in the bread crumbs. Pat lightly with the flat side of a kitchen knife to help the crumbs to adhere.",
    "Meanwhile, heat the olive oil in a saucepan and add the garlic and onions. Cook, stirring for one minute; do not brown. Add the tomatoes, oregano, salt and pepper to taste. Bring to a boil and simmer for 5 minutes.",
    "In a large nonstick skillet over medium heat, add 2 tablespoons of vegetable oil and place as many cutlets as possible in one layer. When the slices are golden brown on one side, about 3 minutes, cook on the other side for 3 minutes. As the pieces are done, transfer them to a heated platter. Add more oil, if necessary, to the skillet, and continue cooking the rest of the slices in the same manner.",
    "Preheat oven to 400 degrees.",
    "In a baking dish large enough to hold the cutlets in one layer, spoon a little sauce over the bottom, add the cutlets, spoon more tomato sauce on top and cover each cutlet with mozzarella cheese. Add the remaining sauce. Sprinkle the Parmesan cheese over the dish and bake until piping hot and cheese is melted, about 10 minutes."
  ],
  "ingredients": [
    "0",
    "8",
    "thin slices lean boneless loin of pork, about 2 ounces each",
    "1",
    "egg, beaten",
    "3",
    "tablespoons water",
    "1",
    "teaspoon ground cumin",
    "2",
    "teaspoons finely chopped fresh rosemary, or 1 teaspoon dried",
    "Salt and freshly ground pepper to taste",
    "1 ½",
    "cups fine fresh bread crumbs",
    "1",
    "tablespoon olive oil",
    "1",
    "tablespoon finely chopped garlic",
    "2",
    "tablespoons finely chopped onions",
    "2",
    "cups canned crushed tomatoes",
    "1",
    "teaspoon chopped fresh oregano, or 1/2 teaspoon crumbled dried",
    "4",
    "tablespoons vegetable oil",
    "4",
    "thin slices of mozzarella cheese, sliced in half",
    "4",
    "tablespoons grated Parmesan or Romano cheese"
  ],
  "__v": 1
}