{
  "hash": "b886fbdbd71d0da6d9d5376ad5b7b164cdc3148b",
  "title": "Julia Child's Hollandaise Sauce",
  "image": "http://img.sndimg.com/food/image/upload/w_555,h_416,c_fit,fl_progressive,q_95/v1/img/recipes/25/13/32/eqjfDNzySl6Casano4Bp_143%20hollandaise.jpg",
  "href": "http://www.food.com/recipe/julia-childs-hollandaise-sauce-251332",
  "extension": "Chrome",
  "firstAdded": "2015-10-12T12:18:36.487000",
  "users": [
    null
  ],
  "keywords": [
    "egg",
    "yolks",
    "water",
    "lemon",
    "juice",
    "needed",
    "soft",
    "unsalted",
    "butter",
    "cayenne",
    "pepper",
    "salt",
    "white"
  ],
  "directions": [
    "0",
    "Whisk the yolks, water, and lemon juice in the saucepan for a few moments, until thick and pale (this prepares them for what is to come).",
    "Set the pan over moderately low heat and continue to whisk at reasonable speed, reaching all over the bottom and insides of the pan, where the eggs tend to overcook.",
    "To moderate the heat, frequently move the pan off the burner for a few seconds, and then back on. (If, by chance, the eggs seem to be cooking too fast, set the pan in the bowl of cold water to cool the bottom, then continue).",
    "As they cook, the eggs will become frothy and increase in volume, and then thicken. When you can see the pan bottom through the streaks of the whisk and the eggs are thick and smooth, remove from the heat.",
    "By spoonfuls, add the soft butter, whisking constantly to incorporate each addition. As the emulsion forms, you may add the butter in slightly larger amounts, always whisking until fully absorbed. Continue incorporating butter until the sauce has thickened to the consistency you want.",
    "Season lightly with salt, pepper, and a dash of cayenne pepper, whisking in well. Taste and adjust the seasoning, adding droplets of lemon juice if needed. Serve lukewarm."
  ],
  "ingredients": [
    "0",
    "3 egg yolks",
    "1 tablespoon water",
    "1 tablespoon fresh lemon juice, if needed (or more)",
    "6 -8 ounces very soft unsalted butter",
    "1 dash cayenne pepper",
    "salt, to taste",
    "fresh ground white pepper, to taste"
  ],
  "__v": 1
}