{
  "hash": "6632dff46c4fe3898d479d3464576fae590c39df",
  "title": "Roasted Garlic and Chipotle Salsa",
  "image": "http://cdn-image.myrecipes.com/sites/default/files/styles/300x300/public/image/recipes/su/08/04/garlic-salsa-su-635676-x.jpg?itok=9UCJ7wSX",
  "href": "http://www.myrecipes.com/recipe/roasted-garlic-chipotle-salsa",
  "extension": "Chrome",
  "firstAdded": "2017-02-05T05:53:58.354000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cut garlic in half crosswise and wrap both halves in one piece of foil. Cut three of the tomatoes in half crosswise and place, cut side up, on a 12- by 15-inch baking sheet. Bake garlic and tomatoes in a 400° regular or convection oven until garlic is soft when squeezed (unwrap to test) and tomatoes are shriveled, about 45 minutes. Dice remaining tomato and reserve.",
    "Meanwhile, place dried New Mexico and chipotle chilies in a small bowl and add 1 cup boiling water. Let stand until chilies are soft, about 10 minutes.",
    "In an 8- to 10-inch nonstick frying pan over high heat, cook tortilla, turning once, until crisp and browned on both sides, 3 to 4 minutes total. When cool enough to handle, break into 2-inch pieces.",
    "When garlic is cool enough to handle, squeeze cloves from skin into a blender or food processor; discard skin. Add roasted tomatoes, chilies and soaking water, tortilla, cilantro, and lime juice. Whirl until smooth. Stir in onion and reserved diced tomato. Add salt to taste.",
    "Nutritional analysis per 1/4 cup."
  ],
  "ingredients": [
    "0",
    "1 head garlic",
    "4 tomatoes (about 8 oz. each), rinsed, stemmed, and cored",
    "3 dried New Mexico or California chilies (about 5 in. long), rinsed, stemmed, seeded, and coarsely chopped",
    "2 dried chipotle chilies (about 1 in. long), stemmed",
    "1 corn tortilla (about 6 in.)",
    "1 cup fresh cilantro sprigs, rinsed",
    "3 tablespoons lime juice",
    "1/2 cup diced red onion",
    "Salt"
  ],
  "__v": 1
}