{
  "hash": "2b7417e0c2d5e47500d598d46d0bdf234376f4d5",
  "title": "Roasted Cod & Mushrooms in Miso Broth",
  "image": "https://www.cleaneatingmag.com/.image/t_share/MTUzNjcyMTgxNzk5MTk5ODAw/roasted-cod--mushrooms-in-miso-broth_77_web.jpg",
  "href": "https://www.cleaneatingmag.com/recipes/roasted-cod-mushrooms-in-miso-broth-recipe",
  "extension": "Chrome",
  "firstAdded": "2018-11-21T02:18:41.793000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparation",
    "1. Arrange racks in top and bottom thirds of oven; preheat to 450ºF. Place a large baking sheet in oven while it preheats. Line a 9 x 13-inch baking dish with parchment paper.",
    "2. Make broth: In a medium saucepan on medium, heat broth, 1 cup water, ginger and kombu. Place miso in a medium heat-proof bowl. When mixture just begins to boil, reduce heat to medium-low. When mixture comes down to a simmer, transfer about ½ cup to bowl with miso and whisk to dissolve. Transfer miso mixture back into saucepan with broth; stir in white and light green parts of onions, enoki mushrooms (if using), mirin and vinegar. Reduce heat to low, cover and keep warm.",
    "3. Prepare fish: Pat fish dry. Rub fish with 1 tbsp oil and sprinkle all over with ½ tsp salt and pepper. Place in prepared baking dish. In a medium bowl, toss shiitake mushrooms with remaining 1 tbsp oil and ¼ tsp salt. Carefully remove hot baking sheet from oven and spread shiitakes evenly on it. Place baking sheet and baking dish in the oven and roast fish and mushrooms for about 10 to 12 minutes, stirring mushrooms once, until fish is cooked through and mushrooms are golden.",
    "4. Remove kombu and ginger from broth. Divide broth among 4 wide, shallow bowls. Place a piece of fish in each one; drizzle each with ½ tsp mirin. Scatter shiitakes and reserved dark green onion slices on top of fish.",
    "Nutrition Information",
    "Serving Size: 1 fillet in brothCalories: 211Carbohydrate Content: 8 gCholesterol Content: 54 mgFat Content: 8 gFiber Content: 1 gProtein Content: 24 gSaturated Fat Content: 1 gSodium Content: 786 mgSugar Content: 5 gMonounsaturated Fat Content: 5 gPolyunsaturated Fat Content: 1 g"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Broth",
    "1½ cups low-sodium vegetable broth",
    "5 2-inch- long slices ginger",
    "1 2-inch piece kombu",
    "2-3 tbsp white miso (TIP: Remember that miso varies by brand. The darker the miso, the stronger the flavor and the saltier it is. If using a darker miso, use less.)",
    "2 green onions, thinly sliced on a diagonal, dark green parts separated",
    "½ cup enoki mushrooms, optional",
    "1½ tsp mirin",
    "½ tsp rice vinegar",
    "Fish",
    "4 4- to 6-oz 1-inch-thick cod fillets",
    "2 tbsp avocado oil, divided",
    "¾ tsp sea salt, divided",
    "¼ tsp ground black pepper",
    "4 oz shiitake mushrooms, stemmed and thinly sliced (about 2½ cups)",
    "2 tsp mirin"
  ],
  "__v": 1
}