{
  "hash": "f03870c317920bc4cd66e7450e634488fee43ade",
  "title": "Scallion Pancakes (Serves 5-6",
  "image": "http://www.thatwasvegan.com/wp-content/uploads/2012/03/scallion-cakes1.jpg",
  "href": "http://www.thatwasvegan.com/2012/03/19/scallion-pancakes-pa-jun-pajeon-with-a-sweet-spicy-dipping-sauce/",
  "firstAdded": "2015-02-07T17:21:32.845000",
  "users": [
    null
  ],
  "keywords": [
    "flour",
    "cold",
    "water",
    "start",
    "chili",
    "korean",
    "thai",
    "work",
    "theyre",
    "pretty",
    "similar",
    "turmeric",
    "salt",
    "bunch",
    "scallions",
    "lengthwise",
    "pieces",
    "oil",
    "frying"
  ],
  "directions": [
    "0",
    "Mix everything together but the scallions, and let sit for about 10 minutes. The batter should be thinner than if you were making pancakes, but not watery. If it’s thicker than your usual pancake batter, mix in water a T at a time. Then add your scallions and give it one last stir. (If you want to get fancy, you can add the scallions directly to the pan, then pour the batter over them!)",
    "Heat a frying pan over medium-high heat with a VERY THIN layer of oil (I used canola). You just want the thinnest of coatings- we’re not deep frying these suckers! Pour about 1/4 of your batter into the pan, creating a thin pancake.",
    "Cook for 4-5 minutes, flip and give it another 2-3 minutes on the other side. You want it to be golden brown but not burnt. Keep a close eye, especially on your first batch, to make sure you get the timing right. The amount of oil you started with, along with the power of you stove will effect the required cooking time.",
    "As the batches are finish, place on a paper towel to absorb any excess oil, then slice them with a knife or pizza cutter into any shape you’d like.",
    "Serve hot with Sweet & Spicy Dipping Sauce!"
  ],
  "ingredients": [
    "0",
    "2 cups flour",
    "1.5 cups cold water (to start, you might add more)",
    "2 t chili paste (Korean or Thai will work, they’re pretty similar)",
    "Pinch of Turmeric",
    "2 t salt",
    "1 bunch scallions, halved lengthwise then sliced into 2 inch pieces",
    "Oil for frying"
  ],
  "__v": 1
}