{
  "hash": "8a89f5ba58ee6062f4a9aa67d17862fa6d074d8a",
  "title": "Mike's Wasabi & Soy Roasted Almonds",
  "image": "https://img-global.cpcdn.com/001_recipes/4583452720496640/640x640sq70/photo.jpg",
  "href": "https://cookpad.com/us/recipes/359706-mikes-wasabi-soy-roasted-almonds",
  "extension": "Chrome",
  "firstAdded": "2017-03-08T23:01:42.361000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Method",
    "30 mins",
    "Heat oven to 350°.",
    "Mix your wet and dry ingredients in separate bowls.",
    "Spread almonds evenly on a nonstick tinfoil lined cookie sheet.",
    "Bake for 12 - 15 minutes. Check for crispness to your taste.",
    "Pull almonds from oven and add them to your wet mixture. Mix well and shake off excess fluid quickly.",
    "Quickly spread your almonds evenly back on the cookie sheet and place in oven for 12 - 15 more minutes stirring only once.",
    "After roasting, place hot almonds in your dry ingredients mixture. Coat almonds well and press down and squeeze mixture on to your almonds. You'll want the powder to adhere to almonds firmly. The sweat from your cooling almonds will assist you in your efforts.",
    "Shake off excess powder through a strainer if you enjoy a mild almond. Don't shake whatsoever if you like your almonds a bit spicer.",
    "Authors Note: I do add additional Cayenne Pepper, Japanese Mustard and Powdered Salt to my dry ingredients at the end with great results. But that may be too much heat for some. ;0) Remember, you're the Chef! Get creative with this recipe and make it your own!",
    "Instead of a conventional oven, I use a convection oven that uses direct circulating high heat to roast these Almonds. It works quite well so if you have one. The picture posted below of my convection oven has crispy chicken in it but you get the point. :0)",
    "Lastly, know that the Cornstarch in this recipe acts as a binder as well as a sugar."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "4 servings",
    "Nuts & Baking the Nuts",
    "5 cup Almonds [de-shelled - skins on]",
    "1 large Cookie Sheet",
    "1 large Non-Stick Tinfoil",
    "Wet Ingredients [mix well]",
    "1/3 cup Soy Sauce [if you find you need need more soy just add it]",
    "1 tsp Granulated Garlic Powder",
    "1 tsp Granulated Onion Powder",
    "1 tsp Cayenne Pepper [optional]",
    "1 medium Mixing Bowl",
    "Dry Ingredients [mix well]",
    "6 tbsp Wasabi Powder [purchase tinted green with horseradish & asian mustard included]",
    "1 tsp Fine Powdered Salt",
    "1 tsp Cornstarch",
    "1 medium Mixing Bowl",
    "Options In Your Dry Ingredients",
    "1 tsp Ground Ginger Powder",
    "1 tsp Cayenne Pepper & Fine Powdered Salt",
    "1/4 tsp Chinese 5 Spice [I haven't tried this spice addition yet but most say they prefer it]",
    "1 dash Japanese [or Asian] Mustard"
  ],
  "__v": 1
}