{
  "hash": "912e78bd22a53181a19cb07047edb89bc998468b",
  "title": "Instant Pot Chicken Noodle Soup",
  "image": "https://www.jocooks.com/wp-content/uploads/2018/01/instant-pot-chicken-noodle-soup-1-5.jpg",
  "href": "https://www.jocooks.com/recipes/instant-pot-chicken-noodle-soup/",
  "extension": "Firefox",
  "firstAdded": "2020-02-09T14:00:48.889000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Turn your Instant Pot to the saute setting. (See your manufacturer's guide for detailed instructions on how to use your instant pot.)",
    "Add the butter and cook until the butter has melted. Add the onion, carrots and celery and saute for 3 minutes until the onion softens and becomes translucent.",
    "Season with salt and pepper, add the thyme, parsley, oregano and stir. Pour in the chicken broth. Add the chicken pieces and add another 4 cups of water.",
    "Close the lid (follow the manufacturer's guide for instructions on how to close the instant pot lid). Set the Instant Pot to the Soup setting and set the timer to 7 minutes.",
    "Once the Instant Pot cycle is complete, wait until the natural release cycle is complete, should take about 10 minutes. Follow the manufacturer's guide for quick release, if in a rush. Carefully unlock and remove the lid from the instant pot.",
    "Remove the chicken pieces from the soup and shred with two forks.",
    "Add the noodles to the soup and set the Instant Pot to the saute setting again. Cook for another 6 minutes uncovered, or until the noodles are cooked.",
    "Turn off the Instant Pot, by pressing the cancel button. Add the shredded chicken back to the Instant Pot, taste for seasoning and adjust as necessary. Garnish with additional parsley if preferred."
  ],
  "ingredients": [
    "0",
    "2 tbsp butter unsalted",
    "1 large onion chopped",
    "2 medium carrots chopped",
    "2 stalks celery chopped",
    "1 tsp salt or to taste",
    "1 tsp pepper or to taste",
    "1 tsp thyme dry, 1 tbsp if using fresh",
    "1 tbsp parsley fresh, chopped",
    "1 tbsp oregano fresh, chopped, 1 tsp if using dry",
    "4 cups chicken broth no sodium added",
    "2 lbs chicken with skin and bones, use at least 1 chicken breast",
    "4 cups water",
    "5 oz egg noodles uncooked, (about 2 cups)"
  ],
  "__v": 1
}