{
  "__v": 1,
  "directions": [
    "0",
    "Separate one egg at a time into a small bowl, letting the white fall into the bowl and discarding the yolk. If there’s any trace of yolk in the white, discard the white and start over. If it’s yolk-free, transfer to a clean medium mixing bowl. Repeat with the remaining 2 eggs.",
    "Add cream of tartar to the whites and beat with an electric mixer on medium-high speed until soft peaks form. Slowly add sugar, about 1 tablespoon at a time, until all the sugar has been added. Continue beating until the whites are stiff and glossy. Add vanilla and beat for 30 seconds more.",
    "Position racks in the upper and lower thirds of the oven; preheat to 200°F. Line 2 large baking sheets with parchment paper. Place a small amount of the meringue under each corner of the paper to secure it to the pan. Fill a 1-quart sealable plastic bag (or pastry bag fitted with a 1/2-inch plain tip) with the meringue. Seal the bag almost completely, leaving a small opening for air to escape from the top as you squeeze. Snip off one corner of the bag with scissors, making a 3/4-inch-wide opening. Fold the top of the bag over a few times, then gently push the meringue down to the snipped corner. Working with the bag perpendicular to the baking sheet, pipe the meringue into 1 1/2-inch-diameter cookies, spacing them about 1/2 inch apart.",
    "Bake the cookies until dry and crisp throughout, about 1 1/2 hours. Transfer the pans to wire racks and let the cookies cool to room temperature, about 15 minutes."
  ],
  "firstAdded": "2014-11-01T01:22:19.092000",
  "hash": "879b464bcc3fb462ffd1180dd221ef09d1103783",
  "href": "http://www.eatingwell.com/recipes/meringues.html",
  "image": "http://assets.eatingwell.com/sites/default/files/imagecache/standard/recipes/DS5784.JPG",
  "ingredients": [
    "0",
    "3 large egg whites, at room temperature (see Tip)",
    "1/4 teaspoon cream of tartar",
    "3/4 cup sugar",
    "1/2 teaspoon vanilla extract"
  ],
  "keywords": [
    "egg",
    "whites",
    "room",
    "tip",
    "cream",
    "tartar",
    "sugar",
    "vanilla"
  ],
  "title": "Meringues",
  "users": [
    null
  ]
}