{
  "hash": "161245361459738e239a85ce0c15e203f0eaaed9",
  "title": "Angry pasta fagioli",
  "image": "https://i.guim.co.uk/img/media/573baea336447e46b92212ed21bf48057895b363/0_0_4016_4993/master/4016.jpg?width=300&quality=85&auto=format&fit=max&s=7c0129d2a58f4a920b914f38a5ffbe76",
  "href": "https://www.theguardian.com/food/2019/sep/28/jamie-oliver-easy-vegetarian-recipes-cauliflower-katsu-mushroom-stroganoff-cottage-pie-pasta-fagioli-soup",
  "extension": "Chrome",
  "firstAdded": "2019-09-29T09:09:42.827000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Peel the squash (deseed if needed) and scrub the carrot, then chop into 1cm chunks, and place in a large casserole pan on a medium heat with two tablespoons of olive oil. Prick and throw in the whole chillies (this will give you a warming, gentle heat), then cook for 10 minutes, or until lightly golden, stirring regularly.",
    "Peel and finely chop the onion and garlic, then add to the pan and cook for a further 10 minutes, or until softened and caramelised.",
    "Wrap the pasta in a clean tea towel and bash with a rolling pin to crack and break it up (give it some welly!), then stir into the pan with a pinch of sea salt and black pepper. Tip in the beans (juices and all) and scrunch in the tomatoes, along with three tins’ worth of water. Pop the lid on and simmer for 20 minutes, or until thickened and the pasta is cooked, stirring occasionally.",
    "Meanwhile, strip the rosemary leaves into a mortar, add a pinch of salt and bash to a paste with the pestle, then muddle in three tablespoons of extra-virgin olive oil and the vinegar. Swirl into the pan and serve up."
  ],
  "ingredients": [
    "0",
    "300g butternut squash",
    "1 carrot",
    "Olive oil",
    "4 fresh red chillies",
    "1 onion",
    "2 garlic cloves",
    "300g dried wholemeal penne",
    "Salt and black pepper",
    "1 x 400g tin borlotti beans",
    "1 x 400g tin quality plum tomatoes",
    "2 sprigs fresh rosemary",
    "Extra-virgin olive oil",
    "1 tsp red-wine vinegar"
  ],
  "__v": 1
}