{
  "hash": "ebc250541080f53aecc3b639be0de19adea7c06b",
  "title": "GARLICKY WHITE BEAN SOUP WITH DARK GREENS",
  "image": "http://www.thenourishinggourmet.com/wp-content/uploads/2009/03/ng_whitebeansoup2.jpg",
  "href": "http://www.thenourishinggourmet.com/2009/03/garlicky-white-bean-soup-with-dark-greens.html",
  "extension": "Chrome",
  "firstAdded": "2015-05-01T05:06:51.398000",
  "users": [
    null
  ],
  "keywords": [
    "white",
    "overnight",
    "plenty",
    "water",
    "used",
    "great",
    "northern",
    "beans",
    "garlic",
    "smashed",
    "bay",
    "leaves",
    "olive",
    "oil",
    "baby",
    "spinach",
    "bunch",
    "kale",
    "swiss",
    "chard",
    "dark",
    "green",
    "press",
    "oregano",
    "tomato",
    "salt",
    "pepper"
  ],
  "directions": [
    "0",
    "-Rinse and drain your beans, then add to a large pot. Add 10-12 cups of water, the smashed garlic cloves, bay leaves and olive oil.",
    "Bring to a boil and turn down heat to a low simmer. Simmer until beans are soft and tender. How long this takes will depend on how old your beans are, and what type you are using, but it should generally take about 1 1/2 hours.",
    "2-Wash and drain the baby spinach leaves (or wash and chop dark greens of your choice). Add to soup and allow to simmer while you do step three. Baby spinach will only take a few minutes to completely cook, while kale or swiss chard can take up to 10-15 minutes to really soften.",
    "3- In a small saucepan heat the olive oil until hot. Add the tomato paste, oregano, and garlic. Continually stir until the the olive oil is tinted with red, and the garlic is softening (but not brown). Pour this flavorful mix over your beans in the pot and stir in.",
    "4-Taste test, you will need to add plenty of salt and pepper (remember you haven’t added any in yet). Serve slightly cooled. If you serve it piping hot, you won’t be able to taste as much of the flavors. Enjoy!"
  ],
  "ingredients": [
    "0",
    "Soak 4 cups of white beans overnight in plenty of water (I used great northern beans)",
    "10-12 cups of water",
    "2 garlic cloves, smashed and peeled",
    "3 bay leaves",
    "2 tablespoons olive oil",
    "4 cups of baby spinach (or one bunch of kale, swiss chard, or dark green of your choice)",
    "1/3 cup of olive oil",
    "6 garlic cloves, peeled and minced or put through garlic press",
    "3 teaspoons dried oregano",
    "1/4 cup of tomato paste",
    "Sea Salt and Pepper"
  ],
  "__v": 1
}