{
  "hash": "379e363b2e6d27fc86a3a2a9fe2892803de63f3c",
  "title": "sushi bowls",
  "image": "http://lh3.ggpht.com/_OaYG005JPDs/S6O9fBGzt9I/AAAAAAAAA_s/-ZpluoIZegw/s640/Sushi%20Bowl.jpg",
  "href": "http://www.budgetbytes.com/2010/03/sushi-bowls/",
  "extension": "Chrome",
  "firstAdded": "2015-07-03T03:56:10.282000",
  "users": [
    null
  ],
  "keywords": [
    "uncooked",
    "short",
    "sushi",
    "rice",
    "vinegar",
    "white",
    "sugar",
    "salt",
    "imitation",
    "crab",
    "medium",
    "avocado",
    "cucumber",
    "carrot",
    "radishes",
    "sesame",
    "seeds",
    "sheets",
    "nori",
    "seaweed"
  ],
  "directions": [
    "0",
    "Place three cups of uncooked short grain rice in a medium pot. Cover the rice with cold water, swirl around then carefully pour off the water. Repeat this until the water is no longer cloudy (usually 3-4 rinses).",
    "After draining off the rinse water, add 3 cups of cold water to the pot. Bring to a boil over high heat without a lid. Once it comes to a boil, reduce the heat to warm and cook with a lid on for 10 minutes. After ten minutes, turn the heat off and let sit (with the lid still on) for an additional 15 minutes.",
    "Mix together the rice vinegar, sugar and salt. Microwave for 20 seconds and stir to dissolve the sugar and salt. Microwave additional time, if needed, to help the sugar and salt dissolve.",
    "Once the rice has finished cooking, dump it out from the pot into a large bowl. Sprinkle half of the vinegar/sugar/salt mixture onto the rice and gently fold it in until it is well incorporated (try not to squish the rice). Sprinkle the remainder of the vinegar mixture on the rice and fold it in again until it is evenly mixed and the rice looks shiny and is fairly sticky.",
    "1",
    "While the rice is cooking, wash and cut/slice the cucumber, raddish, carrot (I shredded mine) and avocado.",
    "Place one cup of cooked sushi rice in each bowl and divide your toppings evenly between the six bowls. I like to arrange the toppings in a pretty way to make it feel even more like I’m eating “real” sushi.",
    "Sprinkle ¼-1/2 tsp of sesame seeds over each bowl. Crumble/tear the nori and top each bowl with a small amount (about ¼ sheet). See notes below for additional topping ideas, optional condiments and how to store the sushi bowls to enjoy later in the week!"
  ],
  "ingredients": [
    "0",
    "3 cups uncooked short grain rice (sushi rice) $1.43",
    "2 Tbsp rice vinegar $0.09",
    "2 Tbsp white sugar $0.02",
    "1 tsp salt $0.05",
    "8 oz. imitation crab $2.99",
    "1 medium avocado $0.99",
    "1 medium cucumber $0.50",
    "1 large carrot $0.21",
    "2 medium radishes $0.12",
    "3 tsp sesame seeds $0.07",
    "1½ sheets nori (seaweed) $0.70"
  ],
  "__v": 1
}