{
  "hash": "e2c129e4188cfb0236703512e44215f1d9b27784",
  "title": "Unique Grilling: Crispin Cider \"Beer Can\" Chicken With Hard Cider Glaze",
  "image": "http://www.seriouseats.com/sponsored/images/2014/08/20140810-Crispin-Cider-Can-Chicken-Jennifer-Olvera.jpg",
  "href": "http://www.seriouseats.com/sponsored/2014/08/unique-grilling-crispin-cider-beer-can-chicke.html",
  "extension": "Chrome",
  "firstAdded": "2016-05-10T17:19:17.157000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the glaze by adding cider, mustard garlic, brown sugar, lemon juice, Worcestershire sauce and butter to a small saucepan over medium-high heat. Bring to a boil, reduce heat to low and simmer until sauce has reduced by half and thickened slightly.",
    "Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread the coals, placing a drip pan in the center, for indirect grilling. Alternatively, set half the burners of a gas grill to high heat, placing a drip pan where you plan to cook the bird. Set cooking grate in place, cover gill and allow to preheat for 5 minutes. Clean and oil the grilling grate.",
    "Remove and discard the fat just inside the neck and body cavities of the chicken. Remove the package of giblets and set it aside for another use. Rub chicken with olive oil and season with salt and pepper. Fill an empty can 3/4 of the way with cider, making an extra hole in the top of the can with a church-key can opener. Firmly nestle chicken upright on the can. Alternately, place the bird on a vertical chicken-roaster that is filled 3/4 of the way with cider. Transfer the chicken to the center of the grill grate over the drip pan, away from direct heat. The chicken should remain vertical throughout. Using half of the glaze for grilling and reserving the rest, baste the chicken with some of the sauce.",
    "Grill the chicken until it is browned and cooked through, basting periodically with glaze, about 1 1/2 hours or until an instant-read meat thermometer registers 170°F when inserted into the thickest part of a thigh (but not touching the bone). If chicken starts to get too browned, loosely tent with foil.",
    "Transfer the chicken to a cutting board and let it rest for about 10 minutes. Carefully lift the chicken off the can or roaster using tongs. Carve and serve, passing reserved sauce tableside."
  ],
  "ingredients": [
    "0",
    "For the Glaze:",
    "8 ounces Crispin Cider",
    "1 tablespoon Dijon mustard",
    "2 cloves garlic, minced",
    "2 tablespoons brown sugar",
    "1 1/2 tablespoons fresh-squeezed lemon juice",
    "1 tablespoon Worcestershire sauce",
    "2 tablespoons butter",
    "Kosher salt and black pepper",
    "For the Chicken:",
    "1 (4 pound) roasting chicken",
    "1 1/2 tablespoons olive oil",
    "8 ounces Crispin Cider"
  ],
  "__v": 1
}