{
  "hash": "8c0ffd5d64d8676784e321a9b92038ee010864e7",
  "title": "Mini shell pasta with a creamy smoked bacon & pea sauce",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/341_1_1350901552_lrg.jpg",
  "href": "http://www.jamieoliver.com/recipes/pasta-recipes/mini-shell-pasta-with-a-creamy-smoked-bacon-and-pea-sauce/",
  "firstAdded": "2014-12-31T14:42:16.524000",
  "users": [
    null
  ],
  "keywords": [
    "slices",
    "higherwelfare",
    "smoked",
    "streaky",
    "bacon",
    "pancetta",
    "bunch",
    "mint",
    "parmesan",
    "cheese",
    "salt",
    "black",
    "pepper",
    "organic",
    "chicken",
    "stock",
    "cube",
    "mini",
    "shell",
    "pasta",
    "olive",
    "oil",
    "frozen",
    "peas",
    "heaped",
    "dessertspoons",
    "halffat",
    "crme",
    "frache",
    "lemon"
  ],
  "directions": [
    "0",
    "Finely slice the bacon. Pick the mint leaves and discard the stalks. Finely grate the Parmesan. Bring a large pan of salted water to the boil and drop in the stock cube (if using). Stir until it's dissolved, then add the mini shells and cook according to the packet instructions. Get a large frying pan over a medium heat and add a good lug of olive oil. Add the bacon to the pan, sprinkle a little pepper over and fry until golden and crisp.",
    "Meanwhile, finely chop your mint leaves. As soon as the bacon is golden, add your frozen peas and give the pan a good shake. After a minute or so, add the crème fraîche and chopped mint to the bacon and peas. Drain the pasta in a colander over a large bowl, reserving some of the cooking water.",
    "Add the pasta to the frying pan. Halve your lemon and squeeze the juice over the pasta. When it's all bubbling away nicely, remove from the heat. The sauce should be creamy and delicious but if it's too thick for you, add a splash of the reserved cooking water to thin it out a bit. Add the grated Parmesan and give the pan a shake to mix it in.",
    "Divide your pasta between plates or bowls, or put it on the table in a large serving dish and let everyone help themselves. Lovely with a simply dressed green salad."
  ],
  "ingredients": [
    "0",
    "6 slices higher-welfare smoked streaky bacon or pancetta",
    "1 small bunch fresh mint",
    "100 g Parmesan cheese",
    "sea salt",
    "freshly ground black pepper",
    "1 organic chicken stock cube, optional",
    "400 g dried mini shell pasta",
    "olive oil",
    "300 g frozen peas",
    "2 heaped dessertspoons half-fat crème fraîche",
    "1 lemon"
  ],
  "__v": 1
}