{
  "hash": "76505faf8e1dfe6fb8c2c1bf1e02320b0a733c37",
  "title": "Cheesy fried tortellini",
  "image": "http://www.amuse-your-bouche.com/wp-content/uploads/2015/04/Cheesy-fried-tortellini-2.jpg",
  "href": "http://www.amuse-your-bouche.com/cheesy-fried-tortellini/",
  "extension": "Chrome",
  "firstAdded": "2015-04-13T23:57:49.944000",
  "users": [
    null
  ],
  "keywords": [
    "tortellini",
    "used",
    "spinach",
    "ricotta",
    "eggs",
    "lightly",
    "plain",
    "flour",
    "panko",
    "breadcrumbs",
    "oil",
    "frying",
    "vegetarian",
    "parmesanstyle",
    "cheese",
    "salt",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "Boil the tortellini in a pan of water for just a couple of minutes, until half-cooked. Drain them, and gently spread them out on a lined baking tray in a single layer. Leave to cool.",
    "Toss each piece of tortellini in the flour, then dip in the egg, then coat in the breadcrumbs. Place back onto the baking tray while you do the rest (I found it easiest to do this in batches of about 8 pieces at a time).",
    "When you’ve breaded all of the tortellini, heat about 1cm of oil in a deep frying pan or large wok (or, of course, use a deep fryer). When the oil is heated to the point that a breadcrumb will sizzle when added, add one batch of the tortellini. Don’t overcrowd the pan - the tortellini need to be in a single layer, with a bit of space in between them. When the undersides are golden brown, turn each piece over, and repeat with the other side.",
    "Leave the cooked tortellini to drain on some kitchen paper while you cook the remaining batches.",
    "When all of the tortellini are cooked, add the parmesan cheese and plenty of salt and pepper, and toss until all the tortellini are well-coated. Serve immediately."
  ],
  "ingredients": [
    "0",
    "400g (~3 cups) fresh tortellini (I used spinach and ricotta)",
    "2 eggs, lightly beaten",
    "100g plain flour",
    "200g panko breadcrumbs",
    "Oil for frying",
    "50g vegetarian parmesan-style cheese, finely grated",
    "Salt",
    "Black pepper"
  ],
  "__v": 1
}