{
  "hash": "8cfd2bda9a5e7be6eab6ce5aa746b1075af8efa3",
  "title": "Roast pheasant with wild mushroom, potato & bacon ragout",
  "image": "http://www.bbcgoodfood.com/sites/default/files/styles/bbcgf_recipe/public/recipe_images/recipe-image-legacy-id--1136452_11.jpg?itok=QsMBbssW",
  "href": "http://www.bbcgoodfood.com/recipes/2604657/roast-pheasant-with-wild-mushroom-potato-and-bacon",
  "extension": "Chrome",
  "firstAdded": "2016-01-21T21:17:30.302000",
  "users": [
    null
  ],
  "keywords": [
    "pack",
    "porcini",
    "mushrooms",
    "ovenready",
    "pheasant",
    "sunflower",
    "oil",
    "smoked",
    "bacon",
    "lardon",
    "medium",
    "baking",
    "potato",
    "chunks",
    "white",
    "wine",
    "flatleaf",
    "parsley",
    "roughly",
    "watercress",
    "leaves",
    "serve",
    "olive"
  ],
  "directions": [
    "0",
    "Heat oven to 200C/180C fan/gas 6. Pour about 200ml of hot water from the kettle over the mushrooms and leave to soak for 20 mins. Drain, reserving the liquid. Squeeze any excess liquid from the mushrooms, but keep them whole.",
    "Generously season the pheasant all over. Heat the sunflower oil in a shallow flameproof dish and slowly brown the legs, turning frequently, for 20 mins. Brown the breast for a further 10 mins, then remove from the dish. Add the bacon to the dish and sizzle until starting to crisp. Throw in the potatoes, increase the heat and fry with the bacon until brown around the edges. Add the mushrooms and fry to heat through. Pour in the wine, sizzle for a moment, and pour over the reserved mushroom liquid, keeping the last drop back as it may be gritty. Nestle the pheasant, breast-side up, in the middle of the dish and roast in the oven for 25 mins.",
    "Remove from the oven, lift the pheasant onto a plate, cover loosely with foil, then leave to rest for about 15 mins. Tip any resting juices into the potatoes, stir in the parsley, then transfer everything into a serving dish. Put the watercress in a bowl and toss with a drizzle of olive oil. Serve with the potato ragout and the pheasant ready to carve."
  ],
  "ingredients": [
    "0",
    "25g pack dried porcini mushrooms",
    "1 oven-ready pheasant",
    "1 tbsp sunflower oil",
    "70g pack smoked bacon lardon",
    "2 medium baking potato, chopped into small chunks",
    "125ml white wine",
    "small handful flat-leaf parsley",
    ", roughly chopped",
    "small handful watercress",
    "leaves, to serve",
    "1 tbsp olive oil"
  ],
  "__v": 2
}