{
  "hash": "12568b2f719dc5e4a12d9a6d1056a96062e946ac",
  "title": "Cream Cheese-Filled Banana Bread",
  "image": "https://images.food52.com/iHbPB1fn2SxcLKYaiTRFUcmBoSw=/170x170/cfe688e9-40ed-4b81-b473-26edc0e391fd--2015-0915_how-to-cook-thai-sticky-rice_bobbi-lin_10633.jpg",
  "href": "https://blu179.mail.live.com/?tid=cm11jenRlw5RGCNdidZ1wIng2&fid=flinbox",
  "extension": "Firefox",
  "firstAdded": "2015-10-11T13:15:28.907000",
  "users": [
    null
  ],
  "keywords": [
    "bread",
    "egg",
    "light",
    "brown",
    "sugar",
    "granulated",
    "liquidstate",
    "coconut",
    "oil",
    "canola",
    "substituted",
    "sour",
    "cream",
    "lite",
    "okay",
    "greek",
    "yogurt",
    "vanilla",
    "mashed",
    "bananas",
    "allpurpose",
    "flour",
    "baking",
    "soda",
    "salt",
    "cheese",
    "filling",
    "softened",
    "brickstyle"
  ],
  "directions": [
    "0",
    "Directions:",
    "Preheat oven to 350F. Spray one 9x5-inch loaf pan with floured cooking spray, or grease and flour the pan; set aside.",
    "Bread - In a large bowl, add the egg, sugars, coconut oil, sour cream, vanilla, and whisk to combine.",
    "Add the bananas and stir to incorporate.",
    "Add 1 cup flour, baking powder, baking soda, optional salt, and fold with spatula or stir gently with a spoon until just combined; don't overmix; set aside.",
    "Turn about two-thirds of the batter out into the prepared pan, smoothing the top lightly with a spatula and pushing it into corners and sides as necessary; set aside.",
    "Cream Cheese Filling - In a large bowl, add all ingredients and whisk to combine. Alternatively, mix with a hand mixer.",
    "Evenly pour filling mixture over the bread, smoothing the top lightly with a spatula and pushing it into corners and sides as necessary.",
    "Top with remaining batter, smoothing the top very lightly with a spatula as to not disturb cream cheese layer and pushing batter into corners and sides as necessary.",
    "Bake for about 48 to 50 minutes or until the top is domed, golden, and the center is set, and a toothpick inserted in the center comes out clean, or with a few moist crumbs, but no batter. Note this is tricky because the cream cheese never gets totally solid so the toothpick test isn't the most accurate. Tip - Tent the pan with a sheet of foil draped over it at the 30 minute-mark if you feel the tops and sides will become too browned before center cooks through. Baking times will vary based on moisture content of bananas, cream cheese, climate, and oven variances. Bake until done; watch your bread, not the clock.",
    "Allow bread to cool in pan for about 15 minutes before turning out on a wire rack to cool completely before slicing and serving. Optionally, serve bread with Honey Butter, Cinnamon-Sugar Butter, Blueberry Butter, Strawberry Butter, or Vanilla Browned Butter Glaze. Bread will keep airtight at room temperature for up to 1 week, or in the freezer for up to 6 months."
  ],
  "ingredients": [
    "0",
    "Bread",
    "1 large egg",
    "1/2 cup light brown sugar, packed",
    "1/4 cup granulated sugar",
    "1/4 cup liquid-state coconut oil (canola or vegetable may be substituted)",
    "1/4 cup cup sour cream (lite is okay; or Greek yogurt may be substituted)",
    "2 teaspoons vanilla extract",
    "1 cup mashed ripe bananas (about 2 large bananas)",
    "1 cup all-purpose flour",
    "1/2 teaspoon baking powder",
    "1/2 teaspoon baking soda",
    "pinch salt, optional and to taste",
    "Cream Cheese Filling",
    "1 large egg",
    "4 ounces softened brick-style cream cheese (lite is okay)",
    "1/4 cup granulated sugar",
    "3 tablespoons all-purpose flour"
  ],
  "__v": 1
}