{
  "__v": 1,
  "directions": [
    "0",
    "Add the sliced potatoes to a bowl of ice water and let them sit for 30 minutes. AFter 30 minutes, remove the potatoes and place them on one or two towels, patting them as dry as possible. Cover a baking sheet or two with paper towels.",
    "Add the oil to a large pot and heat over medium heat until the temperature reaches 350 degrees. You can do this while the potatoes are soaking. You really NEED to use a candy thermometer for this to ensure that the oil doesn't get too hot. One the oil is hot, add the potatoes in batches and fry until slightly golden, about 2 to 3 minutes. Remove the potatoes and place them on the paper towels to drain. Let all of the potatoes cool for about 10 to 15 minutes, then make sure the oil is still at 350 and fry them in batches again. This time, you want to fry until they are even more golden and maybe a little puffy. Remove and place on the baking sheet again quickly, but this time you can let them drain for a second and them throw them on a plate or a sheet of parchment paper. Cover immediately with lots of the herb salt. Add the parmesan and toss, toss, toss. Taste to see if they need more salt or cheese. Of course they do!",
    "herb salt",
    "Combine the basil, cilantro, parsley, oregano, salt and garlic powder in a bowl and mix until combined."
  ],
  "firstAdded": "2014-08-10T13:11:43.485000",
  "hash": "370e89aebe96816e8c183fb41373546b5215d81f",
  "href": "http://www.howsweeteats.com/2014/08/herbed-salted-garlic-parmesan-french-fries/",
  "image": "http://www.howsweeteats.com/wp-content/uploads/2014/07/fries-I-howsweeteats.com-1-2.jpg",
  "ingredients": [
    "0",
    "4 large russet potatoes, thinly sliced",
    "2 quarts vegetable or peanut oil",
    "2 tablespoons freshly chopped basil",
    "2 tablespoons freshly chopped cilantro",
    "2 tablespoons freshly chopped parsley",
    "2 tablespoons freshly chopped oregano",
    "1 tablespoon flaked sea salt",
    "1/2 teaspoon garlic powder",
    "1/3 cup freshly grated parmigiano reggiano cheese"
  ],
  "keywords": [
    "russet",
    "potatoes",
    "quarts",
    "peanut",
    "oil",
    "basil",
    "cilantro",
    "parsley",
    "oregano",
    "flaked",
    "salt",
    "garlic",
    "parmigiano",
    "reggiano",
    "cheese"
  ],
  "title": "Herb Salted Garlic Parmesan French Fries",
  "users": [
    null
  ]
}