{
  "hash": "6b048df16ff3fc5f9a5fa4d1410063762d12d048",
  "title": "Homemade Speculoos Cookies",
  "image": "",
  "href": "http://www.foodiefiasco.com/easyrecipe-print/14825-0/",
  "extension": "Firefox",
  "firstAdded": "2015-11-25T13:40:56.170000",
  "users": [
    null
  ],
  "keywords": [
    "butter",
    "earth",
    "balance",
    "sugar",
    "erythritol",
    "brown",
    "molasses",
    "energ",
    "egg",
    "replacer",
    "mixed",
    "water",
    "vanilla",
    "almond",
    "meal",
    "cinnamon",
    "ginger",
    "salt"
  ],
  "directions": [
    "0",
    "In a large mixing bowl (or the bowl of a stand mixer), combine butter or Earth Balance, sugar or erythritol, and brown sugar or erythritol plus molasses and beat until combined and fluffy. Add in molasses, egg or egg replacer, and vanilla extract and beat until smooth. Add in almond meal, cinnamon, ginger, cloves, and salt and stir until combine.",
    "Turn the cookie dough out onto a piece of parchment paper. Place another piece of parchment paper on top of the dough and, using a rolling pin, roll out the dough to ¼ inch thickness. Place on a baking sheet. Chill in the freezer for one hour. After an hour, fetch the baking sheet from the oven and carefully peel the cookie dough fro the parchment paper. Using a pizza cutter, cut the dough into 48 even squares.",
    "Preheat oven to 325°F, and line another baking sheet with parchment paper. Using a thin spatula, carefully lift up the cookies from the original parchment paper and place 1 inch apart on the prepared baking sheet. Bake in the oven at 325°F for 12-15 minutes, or until they're golden/slightly brown. Let cool on wire racks. Feel free to make some cookie butter... if these last that long. Devour."
  ],
  "ingredients": [
    "0",
    "¼ cup butter or Earth Balance",
    "½ cup sugar or erythritol",
    "¼ cup brown sugar or erythritol plus ½ teaspoon molasses",
    "1 teaspoon molasses",
    "1 large egg (or 1½ teaspoons Ener-g egg replacer mixed with 2 tablespoons water)",
    "½ teaspoon vanilla extract",
    "2 cups almond meal",
    "2½ teaspoons ground cinnamon",
    "¼ teaspoons ground ginger",
    "¼ teaspoons ground cloves",
    "¼ teaspoons salt"
  ],
  "__v": 1
}