{
  "hash": "6d1970978fffdec66be64e869647fb72f8b12b70",
  "title": "APPLE FRITTERS",
  "image": "",
  "href": "http://www.spoonforkbacon.com/2017/11/apple-fritters/",
  "extension": "Chrome",
  "firstAdded": "2018-01-02T16:51:55.339000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "1. Doughnuts: Place warm milk in a mixing bowl along with 1 teaspoon of sugar. Sprinkle yeast over the milk mixture and allow mixture to sit for about 10 minutes, until foamy and bubbling.",
    "2. Once mixture is bubbling, add egg yolks, butter and salt and stir together.",
    "3. Begin stirring in flour, 1/2 cup at a time until the mixture comes together as a sticky dough. Lightly flour a clean surface and turn out the sticky dough. Knead the dough for 5 to 7 minutes or until the dough has become soft and pliable, adding more flour 1 tablespoon at a time, as needed.",
    "4. Place dough into a lightly greased bowl, cover and place in a warm, dry place until it has doubled in size, about 1 hour.",
    "5. Apple filling: Melt butter I a skillet over medium heat. Add apples an sauté for 2 to 3 minutes. Stir in sugar and cinnamon and lower heat to medium-low. Simmer mixture until apples have slightly caramelized and the liquid has thickened into a sweet syrup. Remove from heat and cool completely.",
    "6. To assemble: Punch dough down and turn out onto a clean and lightly floured surface. Roll dough out until 1/2 inch thick. Sprinkle apple mixture over have of the dough and fold other half of dough over the apples, gently pressing the edges of dough together.",
    "7. Cut 1/2 inch strips through the filled dough both vertically and horizontally until you have small and sticky pieces of dough with apple filling.",
    "8. Push the mixture together and continue to chop until apples are evenly dispersed throughout the pieces of dough.",
    "9. With well floured hands, form the pieces of dough and apple into a 10” by 3” log, pressing the pieces together as best as possible.",
    "10. Cut 10, 1” pieces from the log and transfer onto a lightly floured baking sheet, about 2 inches apart. Loosely cover and allow fritters to rise for about 20 minutes (fritters should puff up, but not double in size).",
    "11. Meanwhile, fill a large skillet with 3 inches oil and preheat to 350˚F.",
    "12. Press each exposed piece of apple into each fritter before carefully dropping the fritters into the hot oil, 2 to 3 at a time.",
    "13. Fry each fritter on each side for 3 to 4 minutes or until golden brown. Drain into a baking sheet lined with a cooling rack. Repeat until all of the fritters have been fried.",
    "14. Maple glaze: Place syrup and powdered sugar into a large mixing bowl and whisk together until mixture is thick and smooth. Add water, 1 tablespoon at a time, until a thick but pourable consistency has been achieved.",
    "15. Dip top half of each warm fritter into the glaze, shaking to remove any excess and place back onto the cooling rack. Repeat until all frittered have been glazed. Allow glaze to set on fritters, about 15 minutes. Serve."
  ],
  "ingredients": [
    "0",
    "Makes 10",
    "Ingredients:",
    "basic yeast doughnuts:",
    "2 tablespoons active-dry yeast",
    "1/2 cup warm milk (about 110˚F)",
    "1/2 cup superfine sugar",
    "3 large egg yolks, lightly beaten",
    "2 1/2 tablespoons unsalted butter, softened",
    "1 teaspoon salt",
    "2 1/2 cups all purpose flour, plus more for dusting",
    "apple filling:",
    "3 tablespoons unsalted butter",
    "3 large apples (such as gala, golden delicious, etc), peeled, cored and chopped into 1/2 inch pieces",
    "1/4 cup light brown sugar",
    "1 teaspoon ground cinnamon",
    "pinch salt",
    "maple glaze:",
    "1/4 cup pure maple syrup",
    "2 cups sifted powdered sugar",
    "2 to 4 tablespoons hot water",
    "vegetable oil for frying"
  ],
  "__v": 1
}