{
  "hash": "5abb003979ce018ac1e369a00011b34d8d4acd55",
  "title": "Bean Soup with Spigariello Broccoli",
  "image": "http://3.bp.blogspot.com/-XwLzB3bJ7jI/TsZ-YQl1omI/AAAAAAAAGZQ/lG1PYs6xAC8/s980/Kitchen%2BBlog%2BHeader.jpg",
  "href": "http://fromseedtotablerecipes.blogspot.com/2009/01/bean-soup-with-spigariello-broccoli.html",
  "extension": "Chrome",
  "firstAdded": "2015-04-08T09:17:33.902000",
  "users": [
    null
  ],
  "keywords": [
    "beans",
    "presoaked",
    "spigariello",
    "broccoli",
    "shoots",
    "guanciale",
    "bacon",
    "olive",
    "oil",
    "carrot",
    "onion",
    "rosemary",
    "garlic",
    "oven",
    "roasted",
    "cherry",
    "sundried",
    "tomatoes",
    "ham",
    "drizzle",
    "vinegar",
    "pepper"
  ],
  "directions": [
    "0",
    "Put the presoaked beans into a large pot with 6 cups water. Bring to a boil, turn the heat down and simmer, partly covered.",
    "While the beans are cooking prepare the Spigariello broccoli. Remove the largest bottom leaves from the broccoli shoots, trim off the leaf stems and discard, coarsely chop the leaves. Cut off and discard any tough bottoms from the shoots (if the stalks are large enough you can peel off the tough skin and use the tender inner parts). Cut the shoots crosswise into pieces. Add the chopped broccoli to the beans and continue to simmer, partly covered.",
    "Put the guanciale or bacon in a medium skillet over medium low heat. Saute the guanciale or bacon until crisp. Add the carrot, onion, and rosemary to the skillet, turn the heat up a bit and cook, stirring frequently, until the vegetables start to brown. Remove the skillet from the heat, stir in the minced garlic and chopped tomatoes and set aside.",
    "When the beans are nearly tender (the amount of time to this stage will vary depending on the age of the beans - the older they are the longer it takes), stir in the sauteed vegetable mixture (sofrito) and diced ham; continue to cook the soup until the beans are fully tender but not falling apart. Taste for salt (I added none because of the saltiness of the guanciale and ham), add a splash of vinegar (amazing how a touch of vinegar can brighten the flavor), and grind in some fresh black pepper.",
    "Serves at least 4."
  ],
  "ingredients": [
    "0",
    "1/2 pound dried beans, presoaked",
    "1/2 pound Spigariello Broccoli shoots",
    "1 ounce guanciale or bacon, finely diced",
    "1 tablespoon olive oil",
    "1 very large carrot, peeled and diced",
    "1/2 very large sweet onion, diced",
    "1 tablespoon (about) minced fresh rosemary",
    "2 large cloves garlic, minced",
    "1/4 cup diced oven roasted cherry tomatoes, or sundried tomatoes",
    "1/2 pound ham, diced",
    "a drizzle of vinegar",
    "fresh ground pepper to taste"
  ],
  "__v": 1
}