{
  "hash": "4ddf01bcb0e263b202e1832cb2d8848dc2d63018",
  "title": "Orange Orzo Salad with Almonds, Feta and Olives",
  "image": "https://cookieandkate.com/images/2018/01/mediterranean-orzo-salad-with-orange-parsley-almonds-5.jpg",
  "href": "https://cookieandkate.com/2018/orange-orzo-salad-recipe/",
  "extension": "",
  "firstAdded": "2018-05-01T16:23:24.366000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Bring a large pot of salted water to boil. Add the orzo and cook until al dente, according to package directions. Before draining, reserve roughly ½ cup pasta cooking water. Drain, and immediately rinse the orzo under cold running water until the orzo is no longer warm. Drain well.",
    "Toast the almonds in a medium skillet over medium heat, stirring frequently, until fragrant and turning golden on the edges, about 5 minutes. Transfer the almonds to a cutting board and chop them.",
    "In a large serving bowl, combine the cooked orzo, chopped almonds, parsley, olives, green onion, raisins, and feta (if using).",
    "In a liquid measuring cup or small bowl, combine the orange zest, orange juice, olive oil, vinegar, garlic and salt. Add ¼ cup of the reserved pasta cooking water, and whisk until blended.",
    "Pour the dressing over the salad and toss to combine. It might seem like too much dressing at first, but don’t worry. Season with pepper, to taste.",
    "Let the orzo salad rest for at least 10 minutes (or up to several hours in the refrigerator) so it has time to soak up the dressing. Season to taste with additional salt, if necessary, and serve. Leftovers will keep well in the refrigerator for up to four days."
  ],
  "ingredients": [
    "0",
    "8 ounces whole wheat orzo pasta (I used DeLallo brand)",
    "½ cup raw almonds",
    "1 cup chopped flat-leaf parsley",
    "½ cup pitted Kalamata olives, halved",
    "½ cup chopped green onion",
    "½ cup raisins, preferably golden",
    "½ cup crumbled feta cheese (optional)",
    "1 teaspoon orange zest",
    "¼ cup fresh-squeezed orange juice (from 1 to 2 oranges, preferably organic)",
    "¼ cup extra-virgin olive oil",
    "2 tablespoons white wine vinegar",
    "1 medium clove garlic, pressed or minced",
    "¼ teaspoon salt",
    "Freshly ground black pepper, to taste"
  ],
  "__v": 1
}