{
  "hash": "16a59daacedd8cdf2027d4bb112d495c1fb05d94",
  "title": "Fresh-Fig Cake With Honey Cream-Cheese Frosting",
  "image": "https://static01.nyt.com/images/2017/09/08/dining/08COOKING-FIG-CAKE/08COOKING-FIG-articleLarge.jpg",
  "href": "https://cooking.nytimes.com/recipes/1018919-fresh-fig-cake-with-honey-cream-cheese-frosting?em_pos=large&emc=edit_ck_20170908&nl=cooking&nlid=79859114",
  "extension": "Firefox",
  "firstAdded": "2019-07-15T00:03:32.784000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the cake: Heat oven to 325 degrees. Butter and flour a 10-inch cake pan (or two 9-inch pans), and line the bottom with parchment paper.",
    "In a large bowl, whisk together flour, cinnamon, ginger, cardamom, baking soda and salt.",
    "Using an electric mixer, whisk to combine sugar and eggs until light and fluffy, about 4 minutes. Whisk in oil and buttermilk or yogurt to combine.",
    "Using a rubber spatula, gently fold dry ingredients into egg mixture just until combined. Fold in figs, jam and pecans.",
    "Scrape into prepared cake pan and bake until browned and springy to the touch, about 65 to 75 minutes (or 35 to 45 minutes for the 9-inch pans). If the top gets too dark before the cake is finished baking, cover it with foil. Transfer to a wire rack and let cool completely.",
    "While cake is cooling, make the frosting: Using an electric mixer, beat butter, cream cheese and salt on low speed until smooth. Beat in honey and vanilla, then beat in confectioners’ sugar.",
    "To assemble the cake, remove cooled cake from pan and peel off parchment paper. Slice cake in half horizontally, so you end up with 2 layers. (You don’t need to do this for the 9-inch cakes.) Spread half the frosting between the layers, sandwiching it. Dollop remaining frosting in a thick layer on top of the cake, leaving a 1-inch border on the top of the cake, the sides, bare. Chill until ready to serve. Just before serving, top with sliced figs."
  ],
  "ingredients": [
    "0",
    "Butter, for greasing the pan",
    "3",
    "cups/384 grams all-purpose flour, more for flouring the pan",
    "1",
    "teaspoon ground cinnamon",
    "½",
    "teaspoon ground ginger",
    "½",
    "teaspoon ground cardamom",
    "¾",
    "teaspoon baking soda",
    "½",
    "teaspoon fine sea salt",
    "1 ½",
    "cups/300 grams granulated sugar",
    "4",
    "large eggs",
    "¾",
    "cup extra-virgin olive oil",
    "2",
    "tablespoons buttermilk or plain yogurt",
    "¾",
    "cup/116 grams chopped fresh figs (3 to 4 figs)",
    "¾",
    "cup/225 grams fig jam",
    "¾",
    "cup/85 grams chopped pecans or walnuts"
  ],
  "__v": 1
}