{
  "hash": "2242adf5c07956f90b09184e1f796980f1634cd2",
  "title": "Chicken Pesto Pizza Recipe",
  "image": "http://ciaoflorentina.com/wp-content/uploads/2016/02/Chicken-pesto-pizza-recipe-6.jpg",
  "href": "http://ciaoflorentina.com/chicken-pesto-pizza-recipe/",
  "extension": "Chrome",
  "firstAdded": "2016-08-27T21:57:59.574000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare your pizza dough according to the recipe directions.",
    "To make the walnut pesto, add the basil leaves, walnuts, garlic, olive oil and lemon juice to the bowl of a food processor and puree until smooth but still with a little bit of texture. Adjust seasonings to your taste with sea salt and refrigerate until ready to use.",
    "Preheat your oven to 500”F with the pizza stone in it for at least 45 minutes or longer.",
    "Sprinkle some flour on your kitchen counter or over a pastry board and place one of the pizza dough balls on top. Sprinkle with some flour and using the palm of your hand gently press down on the dough until flat.",
    "Flip the dough on the other side and sprinkle some more flour on top if needed. Continue to press down with the palm of your hand and gently stretching the sides until the pie is thin too your liking. You could also use your knuckles and help stretch the dough as well, just be careful not to tear it.",
    "Sprinkle some flour on your pizza peel or cardboard and gently place the dough on top.",
    "Sprinkle a little flour or corn meal on top of the pizza stone in the oven and very carefully transfer the pizza pie to the pizza stone. Just give the pizza peel or cardboard box an nice little shake and it will slide right in.",
    "Bake the pizza pie for 3 minutes then remove it from the oven back to your pizza peel.",
    "Spoon a thin layer of the walnut pesto over the top and layer with the pepper jack cheese slices. Sprinkle the grilled chicken on top and a little bit more pepper jack cheese.",
    "Gently transfer the pizza pie back to the hot pizza stone and bake an additional 5 minutes or so , until the cheese has melted and the crust is crispy.",
    "Repeat with the remaining pizza pies and allow each pizza to rest for a few minutes for the cheese to set before cutting into it. Sprinkle with the fresh basil and enjoy with extra red pepper flakes on top."
  ],
  "ingredients": [
    "0",
    "1 batch rustic pizza dough, formed into 6 dough balls",
    "1 pound best grilled chicken, sliced",
    "1½ pounds pepper jack cheese, shredded or thinly sliced",
    "2 basil sprigs, for garnish",
    "Red pepper flakes for serving",
    "1",
    "2 bunches basil, leaves only",
    "⅓ c walnuts, chopped",
    "½ c extra virgin olive oil",
    "1 large lemon, juiced",
    "2 garlic cloves, grated"
  ],
  "__v": 1
}