{
  "hash": "bdb0b9c5459b1a6c79c62c3cbb0875a772575822",
  "title": "Humble Home-Cooked Beans",
  "image": "http://recipe-folder.com/img/recipe-images/097/907/2580472997.jpg",
  "href": "https://www.jamieoliver.com/recipes/vegetables-recipes/humble-home-cooked-beans/",
  "extension": "Chrome",
  "firstAdded": "2017-09-26T10:33:40.097000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "My first thought when I saw these beans on a menu in Italy was ‘Beans on toast?’ But then I tasted them. I felt pretty humbled that such a simple dish had been made to taste so gorgeous. Once you’ve learned how to season and cook them in the right way, you can apply the method to cannellini beans, butter beans, borlotti beans, haricots verts, lentils, even chickpeas. If you’ve grown your own beans, good on ya! Fresh ones will take about 45 minutes to cook, but you’re more likely to get dried beans as they’re cheap, and very reliable to cook. However, they will need soaking for at least 12 hours.",
    "Drain your soaked beans, then give them a good wash. Place them in a deep pot and cover them with cold water. Throw in your garlic, herb sprigs, bay leaves, celery stick, potato and tomatoes. Place the beans on the heat and slowly bring to the boil. Cover with a lid and simmer very gently for 45 minutes to an hour, depending on whether you’re using fresh or dried, until soft and cooked nicely. Skim if necessary, topping up with boiling water from the kettle if you need to.",
    "When the beans are cooked, drain them in a colander, reserving enough of the cooking water to cover them halfway up when put back in the pot. Remove the garlic, herbs, celery, potato and tomatoes from the beans. Squeeze the garlic cloves out of their skins and pinch the skin off the tomatoes. Put the garlic, tomatoes and potato on to a plate, mash them with a fork and stir back into the beans. Season well with salt and pepper, and pour in three generous lugs of extra virgin olive oil and a few splashes of vinegar. Stir in the parsley and serve on some toasted sourdough bread."
  ],
  "ingredients": [
    "0",
    "300 g dried borlotti or cannellini beans , soaked in cold water for at least 12 hours",
    "3 cloves garlic , unpeeled",
    "a few sprigs fresh thyme",
    "1 sprig fresh rosemary",
    "3 bay leaves",
    "1 stick celery , trimmed",
    "1 small potato , peeled and halved",
    "2 cherry tomatoes",
    "extra virgin olive oil",
    "red wine vinegar",
    "a few sprigs fresh flat-leaf parsley , chopped",
    "4 slices sourdough bread"
  ],
  "__v": 3
}