{
  "hash": "dfecfbddf21446c193d7b902f987a74a3cf5a5f3",
  "title": "Chipotle Pineapple Jerk Glazed Ham.pastapieandpirouettespeppermintdollyEmilygringalicioustorihousewifeintrainingTaylor @ Food Faith FitnessLaura (Blogging Over Thyme)Nicky @ Pink Recipe BoxLiz @ Floating KitchenlaurengriershineshkaSue/theviewfromgreatislandsLinda | Brunch with JoyLaura (Tutti Dolci)Robyn @realfoodwholelifeArielNikki BJodi@prairiekuchenHilary HamiltonWilliamcookingontheweekendshalfbakedharvestEmeliahalfbakedharvestteritahalfbakedharvestLucyhalfbakedharvestMary",
  "image": "",
  "href": "http://www.halfbakedharvest.com/chipotle-pineapple-jerk-glazed-ham/",
  "extension": "Chrome",
  "firstAdded": "2016-10-30T18:51:48.229000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Remove the ham from the refrigerator (still wrapped) a couple of hours (depending on your house temp) before you intend to cook it so that it can get closer to room temperature.",
    "Preheat oven to 325 degrees F. Place ham in a roasting pan. In a small bowl combine all the dry ingredients for the spice mixture. Rub the spice rub all over the ham, depending on the size of your ham you may or may not need to use all of the spice mixture. Cover tightly with foil and bake for 1 1/2 hours.",
    "While the ham is cooking, in a medium sauce pan, combine the brown sugar, maple syrup, bourbon or rum, chipotle chiles and pineapple juice. Bring to a boil over medium-high heat, stirring constantly. Once the mixture has come to a boil, reduce the heat to low and simmer for 10-15 minutes, or until reduced by about half. Remove from the heat and set aside until the ham is done.",
    "After the ham has been baking for 1 1/2 hours, remove from the oven and increase the oven temperature to 400 degrees F.",
    "Brush the baked ham with the glaze (you might not use all the glaze), then place the chopped pineapple in the bottom of the dish around the ham. If desired, you may also use toothpicks to secure the pineapple onto the ham. Return the ham to the oven and bake uncovered until heated through and caramelized, 25 to 30 minutes. Remove and let sit 5 minutes. Serve warm with the remaining glaze."
  ],
  "ingredients": [
    "0",
    "1 ready-to-eat, cooked ham, bone-in, shank end or butt end, about 9-11 pounds",
    "1 tablespoon garlic powder",
    "2-3 teaspoons cayenne",
    "2 teaspoons onion powder",
    "2 teaspoons ground thyme",
    "2 teaspoons brown sugar",
    "2 teaspoons pepper",
    "2 teaspoons chipotle chile powder",
    "1 teaspoon smoked paprika",
    "1 teaspoon all-spice",
    "1/2 teaspoon cinnamon",
    "1/2 a small pineapple chopped or one (14 ounce) can",
    "1/2 cup brown sugar",
    "1/2 cup maple syrup",
    "1/4 cup bourbon or rum (optional)",
    "1-2 chipotle chilies in adobo, finely chopped",
    "3/4 cup pineapple juice"
  ],
  "__v": 1
}