{
  "hash": "20f1f05381c14f9a654780bb137fa5354f691704",
  "title": "Wild Mushroom and Beef Stew",
  "image": "http://girlandthekitchen.com/wp-content/uploads/2014/03/Wild-Mushroom-and-Beef-Stew-Recipe-1-of-10.jpg",
  "href": "http://girlandthekitchen.com/wild-mushroom-and-beef-stew/",
  "extension": "Chrome",
  "firstAdded": "2015-10-07T20:10:13.503000",
  "users": [
    null
  ],
  "keywords": [
    "chuck",
    "bite",
    "size",
    "cubes",
    "onion",
    "variety",
    "mushrooms",
    "bay",
    "leaf",
    "garlic",
    "sprigs",
    "thyme",
    "cognac",
    "oil",
    "salt",
    "pepper",
    "quarts",
    "beef",
    "stock"
  ],
  "directions": [
    "0",
    "We begin by cutting up our meat into medium bite size cubes and seasoning well with salt and pepper on both sides. Preheat a Dutch oven or a thick bottomed pot with vegetable oil until it starts to smoke.",
    "While you are at it, preheat the oven to 325-degrees.",
    "Place the beef into the pot, making sure not to overcrowd the pan. Allow to brown on all sides.",
    "In the meantime, wash and roughly chop your mushrooms. I used button, cremini, shitake and oyster mushrooms in this dish. If you use shitake mushrooms, make sure you remove and discard the stems as they are very woodsy and tough.",
    "Dice up an onion while you are at it as well.",
    "Check on the meat and remove once nice and brown. Set aside. You will have some fat and yummy bits on the bottom of the pot. Let it be. This is your flavor.",
    "Add in the onions, a few cloves of garlic, a few stems of thyme, a bay leaf and mushrooms and toss to cover with the fat in the pot. Sautee for about 10 minutes.",
    "Add the meat back into the pot and sprinkle evenly with one tablespoon of flour. Mix to combine until none of the flour remains.",
    "Take about 1 cup of cognac and pour into the pot. NEVER POUR OUT OF THE BOTTLE! I flame can catch onto the bottle while pouring and the bottle will explode. I have seen this happen, it's not a pretty site. Pour into a cup first then pour into the pot. You can either let it cook out as it or light the cognac on fire with a long match or if the pot is shallow enough, tilt it towards the flame so it will catch on fire. Flaming it is a neat party trick :) This is also called, deglazing.",
    "Once all the alcohol has cooked out, about 3 minutes, you will be left with a beautiful glazed meat.",
    "After 30 minutes, turn the heat down to 275-degrees and allow to cook for another 90 minutes or until meat is nice and tender."
  ],
  "ingredients": [
    "0",
    "2 pounds of chuck, cut up into bite size cubes",
    "1 large onion",
    "1 pound of a variety of mushrooms",
    "1 bay leaf",
    "5 cloves of garlic",
    "6 sprigs of thyme",
    "1 cup Cognac",
    "vegetable oil",
    "salt and pepper to taste",
    "about 2 quarts beef stock"
  ],
  "__v": 1
}