{
  "hash": "896a065b90e9b759e89b68fa6aa6369b07241569",
  "title": "Pie Maker Mini Mac And Cheese Pies",
  "image": "https://www.sheknows.com/wp-content/uploads/2020/04/b5usbtcpzgm8bnykzape.jpeg",
  "href": "https://www.sheknows.com/food-and-recipes/articles/1034819/mini-mac-and-cheese-pies-recipe/",
  "extension": "Chrome",
  "firstAdded": "2020-04-03T00:52:22.615000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium saucepan over medium-low heat, melt the butter. When it melts, sprinkle in the flour while whisking to create a roux. Pour the milk in gradually while whisking. When the sauce is smooth, add the Parmesan. Season with salt and pepper. Set aside.",
    "In a small dry saucepan over medium heat, fry the pancetta until crispy. Drain the oil, and set the pancetta aside.",
    "In a pot, boil water for the pasta. When it boils, season with salt, and add the pasta. Cook, following the directions on the package less 1 minute or until al dente (because it will still cook in the oven).",
    "Preheat the oven to 350 degrees F.",
    "With 1 puff pastry laid flat on the table, cut 3 round shapes with a knife using the baking dishes as basis for measuring. Include the sides of the baking dishes so that the puff pastry can drape over.",
    "Grease each baking dish, and then lay 1 puff pastry in each. Prick the puff pastry with a fork.",
    "In a bowl, mix together the pasta, cheese sauce and pancetta. Transfer the pasta to the 3 baking dishes.",
    "Top each dish with the sliced cheese.",
    "With the second puff pastry laid flat on the table, cut 3 more round shapes with a knife to use as the covers for the pies. Pinch the sides of the puff pastry to seal them, and prick them on top with a fork.",
    "Brush the tops of the pies with egg wash.",
    "Place the pies on the middle rack of the oven, and bake for 30 minutes or until golden brown."
  ],
  "ingredients": [
    "0",
    "2 tablespoons butter",
    "2 tablespoons flour",
    "2 cups milk",
    "1 cup grated Parmesan",
    "Salt",
    "Pepper",
    "7 ounces macaroni pasta",
    "3 ounces pancetta, diced",
    "2 store-bought round puff pastries",
    "3 slices individually wrapped sliced cheese",
    "1 egg, lightly whisked (for egg wash)"
  ],
  "__v": 1
}