{
  "hash": "76427855da863903c62d1011718714521965b757",
  "title": "The Best Chicken Francaise",
  "image": "http://www.recipe30.com/wp-content/uploads/2016/10/chicken-francese-848x477.jpg",
  "href": "http://www.recipe30.com/chicken-francaise.html/",
  "extension": "Chrome",
  "firstAdded": "2017-04-07T15:46:53.697000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Remove chicken skin, then butterfly cut your breast. Hold a long sharp knife along the thicker part of the breast, place your hand on top and slice through the breast almost until the end. Cut parallel to your cutting board, and open the breast like a book. Place cling film on a board, add your breast spread open, sandwich it in cling film and flatten using the flat side of a meat mallet or the underside of a saucepan.",
    "Crack the eggs into a large enough dish to fit chicken breast. Season eggs with salt and pepper, give them a light beat.",
    "Chop the parsley (keep a few sprigs for garnish) and add half to egg wash.",
    "Grate all the Parmesan cheese and add to egg-wash, mix well.",
    "Get your wine and chicken stock portions ready.",
    "Add the plain flour to a plate.",
    "Peel the garlic and place in garlic press (or chop finely).",
    "To a frying pan on moderate heat, add the olive oil and half the butter.",
    "Coat the chicken in the flour, shake off any excess flour.",
    "Dip the chicken in the egg wash, make sure it’s totally covered and place in hot oil.",
    "Cook chicken for approx 4 minutes each side (depending on thickness). Flip over once brown and cook the other side. Transfer chicken to a hot plate and rest.",
    "To the same frying pan on full heat, add the white wine (alcohol can catch fire so be careful, turn off heat first if unsure). Add the crushed garlic. Add the squeeze of half a lemon. Add the chicken stock. Add the remainder of chopped parsley. Add the remainder of butter and reduce for 2 minutes on full heat.",
    "Return the chicken to the sauce and continue heating chicken on medium heat.",
    "Serve the chicken, and reduce the sauce until it looks a little thicker (not too thick)"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 chicken breasts",
    "Half cup plain flour",
    "2 eggs",
    "1 handful of fresh parsley",
    "50g - 2oz Parmesan cheese",
    "1 cup white wine (click for wine alternatives)",
    "1 cup chicken stock",
    "1 garlic clove",
    "4 tbsp olive oil",
    "4 tbsp butter",
    "Half lemon",
    "Salt and pepper"
  ],
  "__v": 1
}