{
  "hash": "df038c644db460c979f8bc320f07fa93204e52ab",
  "title": "Chicken Soup with Farina Dumplings",
  "image": "https://bakingwithsibella.files.wordpress.com/2013/03/chicken-soup-with-farina-dumplings.jpg?w=656",
  "href": "https://bakingwithsibella.com/2013/03/02/chicken-soup-with-farina-dumplings/",
  "extension": "Chrome",
  "firstAdded": "2018-12-11T13:27:02.468000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a stock pot filled with water add chicken and all the vegetables. Bring it to a boil and then lower the temperature and simmer for about 30 minutes.",
    "Strain the stock and set aside all that’s left in the sieve.",
    "Return the clear stock into the pot. Finely chop chicken, carrots and parsnip and put back into the stock. Onion, celery, and parsley can be discarded. Spice with vegeta, salt and pepper. Let it simmer lightly.",
    "Dumplings need to be prepared immediately before you want to add them to the soup. Do not let the dumpling mixture sit and wait, because they will not turn out good.",
    "For the dumplings combine farina with salt, pepper and nutmeg in a small bowl. Add softened butter and egg and make a mixture gently mixing with a fork. Do not use electric mixer. Do not over mix.",
    "Take a small spoon and grab some of the mixture. With another spoon help shape the mixture into a nice oval and put it into simmering soup. Work fast. Dumplings will start expanding and coming to the surface.",
    "When they are about triple in size, turn off the stove, add chopped parsley to the soup and let it sit for about 5 minutes before serving. If dumplings are made right they will have a soft consistency, somewhat grainy texture and will not be hard or fall apart."
  ],
  "ingredients": [
    "0",
    "1. 5 – 2 l (1.5 – 2 quarts) water",
    "100-200 g (3.5 – 7 oz) chicken (I usually use breast without skin, but dark meat can be used as well) or veal",
    "2 medium carrots (cut once lengthwise and once across)",
    "1 parsnip (cut once lengthwise and once across)",
    "1 celery stalk",
    "1 small onion",
    "2 parsley twigs",
    "Vegeta",
    "Salt",
    "Pepper",
    "Parsley (finely chopped)"
  ],
  "__v": 1
}