{
  "hash": "15e429b868878c08115335ee68ca1c48a12c2e50",
  "title": "15-Bean Soup with Ham and Sausage Recipe:",
  "image": "http://whatscookingamerica.net/Soup/15-BeanSoup1.jpg/15-Bean-Soup1.JPG",
  "href": "http://whatscookingamerica.net/Soup/15-Beani-Soup.htm",
  "firstAdded": "2014-12-27T15:00:55.884000",
  "users": [
    null
  ],
  "keywords": [
    "bean",
    "soup",
    "seasoning",
    "oil",
    "onion",
    "garlic",
    "ham",
    "bone",
    "hocks",
    "kielbasa",
    "sausage",
    "carrots",
    "washed",
    "zucchini",
    "tomatoes",
    "container",
    "chicken",
    "broth",
    "stock",
    "salt",
    "pepper"
  ],
  "directions": [
    "0",
    "Dried Bean Preparation:",
    "Set aside the Seasoning Packet that comes with the 15-Bean Soup Mix.",
    "Rinse and drain the dried beans. Place the beans in a large pot and cover with cold water by approximately 3 inches.",
    "Quick Soak or Power Soak: Bring water almost to a boil (small bubbles appear around the edges of the pot) and let simmer 2 minutes. Remove from heat, cover with lid, and let stand for one (1) hour. After 1 hour, drain off the water.",
    "Your beans are now ready to use in your favorite recipes.",
    "Stove Top Method:",
    "In a large soup pot or Dutch oven over medium-high heat, add some vegetable oil and sauté onions and garlic until tender. Add reserved Seasonings, ham, ham bone, sausage, prepared beans, stewed or diced tomatoes with liquid, carrots, and zucchini. Pour in enough chicken broth until bean mixture is covered with at least 2 inches of liquid over the top of the soup bean mixture.",
    "Bring the soup mixture just to a boil, stir and reduce heat to medium-low to simmer for 2 to 2 1/2 hours until all the different bean sizes are tender. While the soup is simmering, stir every once in awhile and add additional water if needed. Add salt and pepper to taste.",
    "Serve soup in individual soup bowls. Enjoy!",
    "Serves many.",
    "Slow Cooker (Crock Pot) Method:",
    "Preheat the Slow Cooker (Crock Pot). Set aside the Seasoning Packet that comes with the 15 bean soup mix.",
    "Add oil to a large frying pan over medium-high heat and sauté onions and garlic until tender.",
    "Rinse the beans and add to slow cooker along with reserved Seasonings, onions, garlic, ham, ham bone, sausage, carrots, zucchini, and stewed or diced tomatoes with liquid. Pour in enough chicken broth until bean mixture is covered with at least 2 inches of liquid over the top of the soup mixture. Stir and cover with lid.",
    "Cook on high for 4 hours or low for 8 hours (until all the beans are tender).",
    "Salt and pepper to taste and serve in individual soup bowls. Enjoy!",
    "Serves many."
  ],
  "ingredients": [
    "0",
    "1 pound bag of dried 15-Bean Soup Mix with Seasoning Packet*",
    "Vegetable oil",
    "1 large onion, chopped",
    "3 to 4 cloves garlic, minced",
    "1 pound cooked ham, chopped",
    "1 ham bone or 2 to 3 ham hocks**",
    "1 pound kielbasa sausage, cut in half and sliced",
    "2 large carrots, washed, peeled, and chopped",
    "1 small zucchini, sliced (optional)",
    "2 (15-ounce) cans diced or stewed tomatoes (with liquid)",
    "1 (32-ounce) container chicken broth or stock***",
    "Salt and pepper to taste"
  ],
  "__v": 1
}