{
  "hash": "44cca39a664dc33c1988a97a30b64479819b84ef",
  "title": "Emeril's Fettucine with Ramps, Spring Peas and Pancetta",
  "image": "http://a.abcnews.com/assets/images/font-sm_off2.gif",
  "href": "http://abcnews.go.com/GMA/recipe/emerils-fettucine-ramps-spring-peas-pancetta-16078153?nwltr=GMAR_featureHed",
  "extension": "Chrome",
  "firstAdded": "2015-04-17T16:11:32.132000",
  "users": [
    null
  ],
  "keywords": [
    "salt",
    "pasta",
    "water",
    "fettuccine",
    "olive",
    "oil",
    "ramps",
    "diagonal",
    "shallot",
    "emerils",
    "original",
    "essence",
    "creole",
    "seasoning",
    "recipe",
    "follows",
    "garlic",
    "pancetta",
    "frozen",
    "green",
    "peas",
    "cream",
    "parsley",
    "parmigianoreggiano",
    "cheese",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "Bring a large pot of salted water to a boil and cook the fettuccine until al dente, about 12 minutes.",
    "While the pasta is cooking, make the sauce: In a 12-inch (or larger) saute pan, heat the olive oil over medium-high heat. Add the ramps, shallot, Essence, and the 1 /2 teaspoon salt, and cook until the ramps are tender and shallots are translucent, 2 to 4 minutes. Add the garlic, pancetta, and peas and cook for 2 minutes longer. Increase the heat to high, add the cream, and bring it to a boil. Then reduce the heat to medium and simmer until the cream thickens, about 5 minutes.",
    "Drain the pasta in a colander, reserving 1 cup of the cooking water.",
    "Add the drained pasta, 1 /2 cup of the reserved cooking water, and the parsley and cheese to the sauce and cook, tossing constantly, until heated through and well combined, about 1 minute. If the mixture seems dry, add the remaining cooking water, a little at a time, as needed.",
    "Remove the pan from the heat and transfer the pasta mixture to a large serving bowl or to individual bowls. Sprinkle with additional cheese and black pepper if desired.",
    "Substitute for Emeril's Original Essence:",
    "Recipe courtesy Emeril Lagasse, copyright MSLO, Inc., all rights reserved",
    "2 1/2 tablespoons paprika",
    "2 tablespoons salt",
    "2 tablespoons garlic powder",
    "1 tablespoon black pepper",
    "1 tablespoon onion powder",
    "1 tablespoon cayenne",
    "1 tablespoon dried oregano",
    "1 tablespoon dried thyme",
    "In a small bowl combine all the ingredients thoroughly. Store in an airtight container.",
    "Yield: Makes about 2/3 cup",
    "Recipe courtesy Emeril Lagasse, adapted from Emeril 20-40-60, Fresh Food Fast, Harper Studio Publisher, New York, 2009, copyright MSLO, Inc., all rights reserved",
    "This recipe was styled by chef Karen Pickus for Good Morning America."
  ],
  "ingredients": [
    "0",
    "1/2 teaspoon salt, plus more for the pasta water",
    "1 pound fettuccine",
    "2 teaspoons olive oil",
    "1 cup ramps, thinly sliced on the diagonal",
    "1/4 cup thinly sliced shallot",
    "1 tablespoon Emeril's Original Essence or Creole Seasoning (recipe follows)",
    "1 teaspoon minced garlic",
    "8 ounces pancetta, diced",
    "1 cup blanched fresh or frozen green peas",
    "2 cups heavy cream",
    "1/4 cup chopped fresh parsley",
    "1/2 cup grated Parmigiano-Reggiano cheese, plus more for serving (optional)",
    "Freshly ground black pepper, for serving (optional)"
  ],
  "__v": 1
}