{
  "hash": "dda95d7e653cedb2934b267a7409104c8eb3ce0e",
  "title": "Small Ribeye Roast",
  "image": "https://www.101cookingfortwo.com/wp-content/uploads/2017/12/Smaller-Ribeye-Roast-1-150x150.jpg",
  "href": "https://www.101cookingfortwo.com/smaller-rib-eye-roast/",
  "extension": "Chrome",
  "firstAdded": "2018-01-10T18:26:09.544000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Preheat oven to 500 degrees and lower a rack so the roast will be in the middle of the oven.",
    "Mix 3 tablespoon of softened butter with 3 cloves of crushed or minced garlic.",
    "Poke a 15-20 half inch knife holes into the roast.",
    "Slather the butter/garlic mixture onto the roast pushing some of the mixture into the holes. Add some salt and pepper to the roast to taste.",
    "Prep a roasting pan with a rack and give the rack a heavy coat of PAM. A cake pan is good here. The pan needs some sides to prevent splatter.",
    "Place on rack fat side up and into a 500-degree oven for 20 minutes then decrease the temperature of the oven to 325 degrees and continue to roast until desired internal temperature.",
    "Place fat side up on the rack and into a 500-degree oven for 20 minutes then decrease the temperature of the oven to 325 degrees and continue to roast until desired internal temperature. For my 2 1/2 pound roast, an additional 45 minutes for 130 degrees, 55 minutes for 140 and 60 minutes for 145. But when I used roast slightly over 3 pounds, it added 30 minutes to the cooking time. Never cook by time alone. Always check with a meat thermometer. Your time may vary.",
    "Tent lightly with foil and allow to rest for 15-20 minutes before cutting. Remember the roast will increase in temperature a few degrees when tented.",
    "Recipe Notes",
    "You will probably have some smoking from the oven due to the butter and the high temperature to start. So you have some choices. You can just realize it will probably happen and live with it. You can eliminate the butter and use a higher temperature vegetable oil which still may smoke some. You could add some water to the pan under the rack so when the butter melts off, it hits the water .(max temp of 212) instead of the 500 degree pan."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2-3 pound boneless ribeye roast",
    "3 cloves garlic crushed or minced",
    "3 tablespoons butter",
    "salt and pepper to taste",
    "Servings:"
  ],
  "__v": 1
}