{
  "__v": 1,
  "directions": [
    "0",
    "Halve and seed spaghetti squash. Bake cut side up at 400 degrees for 50 minutes, or until fork-tender. Scrape out meat with fork and set aside. (I actually happened to have this on hand in a plastic bag in the fridge)",
    "Peel and slice tomatoes approximately 1/4\" thick. Arrange tomato slices in a single layer in the bottom of a greased cake pan or cookie sheet. Sprinkle with olive oil, balsamic vinegar, dried herbs, and salt. Put under broiler till tomatoes are dehydrated and starting to brown. Remove from oven and stir, tomatoes should easily disintegrate, forming a sauce.",
    "Melt bacon fat in a skillet over med-high heat. Dice onion, carrots, celery, and garlic. Cook in bacon fat till soft and brown. Add chicken stock, tomatoes, and cream. Turn heat to medium, and simmer. Texture should resemble a slightly creamy broth.",
    "In another skillet, brown Italian sausage.",
    "Add Italian sausage and spaghetti squash to pan with broth. Toss and serve."
  ],
  "firstAdded": "2014-09-20T16:36:39.403000",
  "hash": "8ad740597bf8a2877185a3a9361e3f748b1f93bd",
  "href": "http://www.reddit.com/r/ketorecipes/comments/2cp8nq/italian_sausage_and_spaghetti_squash_in_roasted/",
  "image": "",
  "ingredients": [
    "0",
    "Ingredients: 1 lb Ground Hot Italian Sausage, 1 Spaghetti Squash, 1 Med. White Onion, 2 Med. Carrots, 3 Celery Stalks, 3-4 Tomatoes, 3 Cloves Garlic, Balsamic Vinegar, Dried Oregano (or any other Italian herb blend), Olive Oil, Bacon Fat, 1.5 cups Chicken Stock, .5 cup Heavy Cream"
  ],
  "keywords": [
    "hot",
    "sausage",
    "spaghetti",
    "squash",
    "white",
    "onion",
    "med",
    "carrots",
    "celery",
    "stalks",
    "tomatoes",
    "garlic",
    "balsamic",
    "vinegar",
    "oregano",
    "italian",
    "herb",
    "blend",
    "olive",
    "oil",
    "bacon",
    "fat",
    "chicken",
    "stock",
    "cream"
  ],
  "title": "Italian Sausage and Spaghetti Squash in Roasted Tomato Broth",
  "users": [
    null
  ]
}