{
  "hash": "351fce60da89268f24f8058ad1e4b7f1969ac17f",
  "title": "Roasted Poblano Corn Chowder",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2014/08/roasted-poblano-corn-chowder-vertical-a-800.jpg",
  "href": "http://www.simplyrecipes.com/recipes/roasted_poblano_corn_chowder/",
  "extension": "",
  "firstAdded": "2017-07-13T22:13:31.940000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Roast the chiles. There are lots of ways to do this (see How to Roast Green Chiles over an Open Flame), I tend to just put them either directly on the flame, or in one of those grill pans with holes in them, over the gas flame. You can roast them on a grill or under a broiler. Just make sure they get blackened all over. Then put them in a bowl, cover the bowl and let them steam. When they've cooled down enough to touch, use your fingers or a dampened paper towel to strip off the charred bits. Cut them open, remove and discard the stem, seed pod and inside veins. Roughly chop the chiles and set aside.",
    "2 Melt butter in a 5 to 6 quart heavy-bottomed pot on medium high heat. Once the butter is melted, add the onions and the celery, stir to coat with the butter. Cook for 8 to 10 minutes, lowering the heat to medium, until the onions and celery are softened and are beginning to brown.",
    "3 While the onions are cooking, if using fresh corn on the cob, cut the fresh kernels of corn away from the cobs.",
    "4 Once the onions and celery are beginning to brown, add the garlic and cook for a minute more. Add the potatoes and the stock to the pot. Add the bay leaves, cumin, oregano, and salt. Increase heat and bring to a simmer. Lower heat to maintain a simmer and cook for 8-10 minutes until the potatoes are just cooked through.",
    "5 Add the corn kernels to the pot and cook for 4 to 5 minutes, until cooked through. Add the chopped roasted poblanos to the pot.",
    "6 Remove the bay leaves. Stir in the cream. Add black pepper, more or less to taste. At this point, if you want a thicker base for your chowder, you can use an immersion blender or standup blender to purée about a third of the soup.",
    "To serve, sprinkle with a little fresh lime juice and serve with a slice or two of lime."
  ],
  "ingredients": [
    "0",
    "5 to 6 large poblano green chiles (to yield 1 1/2 cups roasted, peeled, and chopped), (can sub canned chopped green chiles, enough to yield 1 to 1 1/2 cups, the amount depends on how hot the chiles are)",
    "3 Tbsp butter",
    "2 medium onions, diced (about 2 1/2 cups)",
    "2 ribs celery, diced (about 3/4 cup)",
    "1 clove garlic, minced (1 teaspoon)",
    "2 medium yukon gold potatoes, peeled, cut into 1-inch chunks (10 - 12 ounces)",
    "4 ears of corn (enough to yield 4 cups of corn kernels), or 4 cups of corn",
    "5 cups chicken stock (use vegetable stock for vegetarian option)",
    "1 teaspoon kosher salt",
    "2 bay leaves",
    "1 teaspoon ground cumin",
    "1/2 teaspoon dry oregano",
    "1 cup heavy cream",
    "1/2 teaspoon black pepper",
    "2 limes, one sliced for garnish, one for juice (can substitute lemon juice)"
  ],
  "__v": 1
}