{
  "hash": "8e269b30c9baec1b751c2aa07ac59ba5f04a6644",
  "title": "Roasted Cauliflower and Farro Salad with Feta and Avocado",
  "image": "http://cookieandkate.com/images/2014/04/roasted-cauliflower-and-farro-salad-with-feta-and-avocado.jpg",
  "href": "http://cookieandkate.com/2014/roasted-cauliflower-and-farro-salad-with-feta-and-avocado/",
  "extension": "",
  "firstAdded": "2015-07-05T07:39:37.670000",
  "users": [
    null
  ],
  "keywords": [
    "head",
    "cauliflower",
    "florets",
    "olive",
    "oil",
    "red",
    "pepper",
    "light",
    "sprinkle",
    "finegrain",
    "salt",
    "uncooked",
    "farro",
    "rinsed",
    "garlic",
    "pressed",
    "kalamata",
    "olives",
    "lengthwise",
    "rounds",
    "oilpacked",
    "sundried",
    "tomatoes",
    "roughly",
    "feta",
    "crumbled",
    "heaping",
    "lemon",
    "juice",
    "lemons",
    "worth",
    "black",
    "avocado",
    "strips",
    "leafy",
    "spring",
    "greens",
    "spinach",
    "arugula",
    "good",
    "choices"
  ],
  "directions": [
    "0",
    "To roast the cauliflower: Preheat the oven to 425 degrees Fahrenheit. Toss the cauliflower florets with olive oil, red pepper flakes and a light sprinkle of sea salt. Roast for 25 to 30 minutes on the middle rack, turning halfway, until the cauliflower is tender and golden on the edges.",
    "To cook the farro: In a medium saucepan, combine the rinsed farro with at least three cups water (enough water to cover the farro by a couple of inches). Bring the water to a boil, then reduce heat to a gentle simmer, and cook until the farro is tender to the bite but still pleasantly chewy. (Pearled farro will take around 15 minutes, unprocessed farro will take 25 to 40 minutes.) Drain off the excess water and mix in two teaspoons of olive oil, the garlic and sea salt. Set aside.",
    "In a large serving bowl, toss together the roasted cauliflower, cooked farro, olives, sun-dried tomatoes, feta and lemon juice. Taste and season with additional salt and pepper if necessary.",
    "Divide the avocado and greens among four salad plates. Top with a generous amount of the cauliflower and farro salad. Finish the plates with an extra squeeze of lemon juice or drizzle of olive oil, if desired. Serve."
  ],
  "ingredients": [
    "0",
    "1 large head cauliflower, cut into bite-sized florets",
    "2 tablespoons olive oil",
    "¼ teaspoon red pepper flakes",
    "Light sprinkle fine-grain sea salt",
    "1",
    "1 cup uncooked farro, rinsed",
    "2 teaspoons olive oil",
    "2 cloves garlic, pressed or minced",
    "¼ teaspoon fine-grain sea salt",
    "2",
    "15 pitted kalamata olives, some halved lengthwise and some sliced into small rounds",
    "¼ cup oil-packed sun-dried tomatoes, rinsed and roughly chopped",
    "2 ounces feta, crumbled (a heaping half cup)",
    "1 tablespoon lemon juice (about ½ lemon's worth)",
    "Freshly ground black pepper, to taste",
    "1 avocado, sliced into thin strips",
    "4 handfuls leafy greens (spring greens, spinach or arugula are all good choices)"
  ],
  "__v": 1
}