{
  "__v": 1,
  "directions": [
    "0",
    "To make the tart dough: In the bowl of an electric mixer fitted with the paddle attachment, cream the butter and confectioners’ sugar about 1 minute. Add the cocoa and beat until incorporated. Add the egg yolk and vanilla and beat until smooth. Sift in the flour and beat on low speed until just combined. Scrape the dough onto a sheet of plastic wrap and form it into a disk. Wrap and chill until firm, about 1 hour, or up to 3 days.",
    "Preheat oven to 325°F. On a lightly floured surface, roll the tart dough to 3/16-inch thick. Using a 2-1/2 inch round cutter, cut out 24 rounds of dough and press them into mini-muffin tins or 2 dozen 2-inch tart pans, trimming away any excess dough; prick the dough all over with a fork. Chill the tart shells for 20 minutes.",
    "Line the tart shells with foil or parchment and fill (to the top) with dried beans, rice, or pie weights. Bake for 15 minutes. Remove foil and weights and bake for 5 to 10 minutes longer or until the pastry looks dry, set, and is lightly browned. Transfer to a wire rack to cool. Remove cooled shells from tart pans and transfer to a serving plate.",
    "To prepare the filling: Place the water in a large saucepan. Add the sugar and corn syrup. Cook the mixture over medium-high heat, swirling the pan occasionally, until you have a dark amber caramel, about 10 minutes.",
    "Carefully whisk in the butter, cream, and crème fraiche stirring until smooth. The caramel will hiss and bubble up so stand back. The caramel can be made up to 5 days ahead and refrigerated. Divide the caramel among the tart shells while still warm or reheat the caramel in the microwave or over low heat until it is pourable. Let tarts rest until the caramel is set, at least 20 minutes.",
    "To make the ganache: In a saucepan, bring the cream to a boil. Place the chocolate in a bowl. Pour the hot cream over the chocolate; add a pinch of sea salt, and let sit for 2 minutes, then whisk until smooth. Pour some of the ganache into each of the tarts while it is still warm. Let the chocolate set at room temperature for at least 2 hours before serving. Chill if you are transporting these tarts any distance. Sprinkle top with additional coarse sea salt if desired.",
    "NOTE: You can also make this as a single larger tart if you like. It is equally delicious served either way."
  ],
  "firstAdded": "2014-07-20T19:14:34.933000",
  "hash": "2e7fd197ea7a4dbc29a3481a74861ab18956da85",
  "href": "http://theheritagecook.com/chocolate-caramel-tartlets-for-chocolate-monday/",
  "image": "http://theheritagecook.com/wp-content/uploads/2011/01/Chocolate-Caramel-Tart-iStock3.jpg",
  "ingredients": [
    "0",
    "Chocolate Tart Dough",
    "1/2 cup (1 stick) unsalted butter, at room temp",
    "1/2 cup plus 1 tbsp confectioners’ sugar",
    "1/4 cup unsweetened cocoa powder",
    "1 large egg yolk",
    "3/4 tsp vanilla extract",
    "1-1/4 cups all-purpose flour",
    "Caramel Filling",
    "1/2 cup water",
    "2 cups sugar",
    "1/4 cup light corn syrup",
    "1/2 cup unsalted butter (1 stick)",
    "1/2 cup heavy cream",
    "2 tbsp crème fraiche (sour cream or additional heavy cream may be substituted)",
    "Chocolate Ganache",
    "1/2 cup heavy cream",
    "3-1/2 oz bittersweet chocolate, chopped (you may use semisweet if you prefer)",
    "Pinch sea salt, such as fleur de sel",
    "Topping",
    "Coarse sea salt, such as fleur de sel, optional"
  ],
  "keywords": [
    "chocolate",
    "tart",
    "dough",
    "unsalted",
    "butter",
    "room",
    "temp",
    "confectioners",
    "sugar",
    "cocoa",
    "egg",
    "yolk",
    "vanilla",
    "allpurpose",
    "flour",
    "caramel",
    "filling",
    "water",
    "light",
    "corn",
    "syrup",
    "cream",
    "crme",
    "fraiche",
    "sour",
    "substituted",
    "ganache",
    "bittersweet",
    "use",
    "semisweet",
    "prefer",
    "salt",
    "fleur",
    "sel",
    "coarse"
  ],
  "title": "Chocolate Caramel Tartlets",
  "users": [
    null
  ]
}