{
  "hash": "64a42e85256d88d11246751748a86517dca37f87",
  "title": "Rye Bread",
  "image": "",
  "href": "https://thestayathomechef.com/rye-bread/",
  "extension": "Chrome",
  "firstAdded": "2020-01-15T19:35:11.546000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In the bowl of a stand mixer, combine the yeast, water, salt, caraway, and rye flour. Add in all-purpose flour 1 cup at a time, adding more if necessary to form a dough ball that doesn't stick to the sides of the bowl. Dough should be soft, not stiff, but should hold together on its own without being overly sticky.",
    "Transfer to a lightly greased large bowl. Cover with a dish towel and let rise until double, about 1 hour.",
    "Shape it into a loaf by stretching the dough from the top center of the dough ball over the edges, and then underneath. It should look and feel like you are holding the loaf with two hands and are pulling the dough inside out with your thumbs. Give several of those pulls with your thumbs until you have a nice looking little loaf.",
    "Dust a pizza peel or wooden cutting board with cornmeal. Put the loaf on the prepared board and let it rise for another 40 minutes.",
    "Preheat a pizza/baking stone in the oven to 450 degrees. Place a shallow pan on the rack below the baking stone.",
    "Dissolve the cornstarch in the 1/4 cup water. Microwave for 45 seconds. Brush the cornstarch liquid on top of the loaf and cut several parallel lines on the top.",
    "Bake the loaf directly on the stone. When you put the loaf in, pour a tall glass of water into the shallow pan below. It'll pop and sizzle and steam, so watch your hands. Close the oven door and bake for 30 minutes."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 1/2 tablespoons instant dry yeast",
    "2 cups warm water",
    "1 1/2 teaspoons salt",
    "1 1/2 tablespoons caraway seeds",
    "1 1/2 cup rye flour",
    "3 cups all-purpose flour",
    "2 tablespoons cornmeal for dusting",
    "Cornstarch Wash",
    "1/4 tsp cornstarch",
    "1/4 cup water"
  ],
  "__v": 1
}