{
  "hash": "bc6eb714e5a4b36edf2878f2d050f94aa800ceb7",
  "title": "General Tso Chicken",
  "image": "",
  "href": "https://www.reddit.com/r/EatCheapAndHealthy/comments/3yelod/cheap_and_healthy_general_tsos_chicken/",
  "extension": "Firefox",
  "firstAdded": "2017-12-18T02:00:14.730000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a bowl, make the General Tso sauce: Whisk together the soy sauce, vinegar, honey, garlic chili sauce, chicken broth, and 2 teaspoons of the cornstarch. Set aside.",
    "In a pan over high heat, add 1/2 cup water and bring to a boil. Add broccoli to the pan and cover. Steam for 2 minutes or until broccoli has turned bright green and is crunchy-tender (just shy of cooked through.) Remove broccoli from pan, drain and rinse with cool water to stop cooking. Set broccoli aside. Empty water from wok or pan and dry well. Return pan to stove.",
    "In a medium bowl, add chicken, remaining 2 teaspoons of cornstarch, salt and pepper and stir to coat chicken evenly.",
    "Heat the wok over high heat. When very hot, add cooking oil and swirl to coat. To get a nice crust on the chicken, you'll cook them in a single layer, giving them plenty of space to brown. Add half the chicken to pan in a single layer. Let cook undisturbed for 1-2 minutes, until the bottom of chicken is browned, flip chicken, cook until other side is browned. The chicken should be halfway cooked through - remove the half-cooked chicken pieces to a plate to set aside. As you take chicken pieces out, continually add in more of the raw chicken to the pan to cook.",
    "When all the chicken have cooked, turn heat to medium. Let the pan cool a bit before adding the rest of the ingredients (so they don't burn). The pan should still have some cooking oil left from the chicken. To the pan, add the green onions, garlic and ginger. Stir fry until fragrant, about 30 seconds. Control your heat so that the ingredients don't burn.",
    "Pour in the General Tso's sauce to pan and bring mixture to a simmer. Return the chicken and broccoli to the pan, toss and cook for 1 minute. The sauce should thicken and the chicken should be cooked through completely. Sprinkle with sesame seeds and serve immediately."
  ],
  "ingredients": [
    "0",
    "4 tablespoons soy sauce",
    "4 teaspoons rice vinegar (or white vinegar)",
    "2 tablespoon honey",
    "3 teaspoons garlic chili sauce",
    "1 cup chicken broth",
    "6 teaspoons cornstarch, divided",
    "2 large heads broccoli, cut into florets",
    "2 pounds chicken thighs",
    "Black pepper",
    "3 tablespoons of cooking oil",
    "3 cloves minced garlic",
    "2 teaspoon minced ginger",
    "8 stalks green onion",
    "2 teaspoon roasted sesame seeds"
  ],
  "__v": 3
}