{
  "__v": 1,
  "directions": [
    "0",
    "Step One",
    "In a large, deep skillet, heat the vegetable oil and a small yellow onion (loosely diced). Allow this to soften for 3-4 minutes while mincing the garlic & chili and gathering the spices (which are essential for a good curry).",
    "Step Two",
    "Next, add the garlic, chili, and ginger to the onions with about 1/2 a teaspoon of each spice. As with all good curries, you develop so much more flavor by directly spicing the onions at the beginning as opposed to adding them to the completed dish later on. Stir and allow the spices to mingle with the onions for several minutes.",
    "Step Three",
    "Now, add almost all the other ingredients to the pan – throw in the (drained and rinsed) chickpeas, the can of tomatoes, the light coconut milk*, and about 1 large sweet potato that has been peeled and diced into ~1 inch chunks.",
    "Tip: Your grocery store is likely selling light and full-fat coconut milk at the same price, but the light coconut milk is simply full-fat diluted with water. Save some money and buy one can of full-fat, dilute it with equal parts water, and voila – you have 2 cans of light coconut milk for the price of one.",
    "Step Four",
    "Turn the heat down to a simmer, cover, and go take a break. This curry will need at least 30 minutes (50 is ideal) to fully break down and absorb all these beautiful spices. Stir occasionally and give the dish at taste after 20 minutes; I often add a lot more spices at this point; especially cinnamon, turmeric, and salt. If you want the dish extra spicy, a dash of cayenne pepper wouldn’t be a bad idea.",
    "Step Five",
    "At the last minute before serving, add a handful or two of fresh chopped parsley to complete this dish. Serve atop fluffy jasmine rice for an unforgettably creamy and comforting meal. Again, this keeps amazingly well in the refrigerator for 2-3 days. Yay for leftovers!"
  ],
  "firstAdded": "2014-09-08T10:04:52.944000",
  "hash": "609fd8bd9c86483e67a3b01c769f1e74dc753547",
  "href": "http://www.oneingredientchef.com/sweet-potato-stew/",
  "image": "http://www.oneingredientchef.com/wp-content/uploads/2014/02/Sweet_Potato_Stew_Pan.jpg",
  "ingredients": [
    "0",
    "1 small yellow onion",
    "1 tablespoon vegetable oil",
    "3 cloves garlic",
    "1/2 teaspoon dried spices: cinnamon, turmeric, cumin, coriander, ground cloves",
    "Salt, to taste",
    "1 teaspoon fresh grated ginger"
  ],
  "keywords": [
    "yellow",
    "onion",
    "oil",
    "garlic",
    "spices",
    "cinnamon",
    "turmeric",
    "cumin",
    "coriander",
    "salt",
    "ginger"
  ],
  "title": "COCONUT CURRIED SWEET POTATO & CHICKPEA STEW",
  "users": [
    null
  ]
}