{
  "hash": "3fca8e8726686ac4d9cb86d5370101f8067aae0b",
  "title": "Sweet Potato, Spinach and Chickpea Filo Pie",
  "image": "http://www.fnstatic.co.uk/images/content/recipe/sweet-potato-spinach-and-chickpea-filo-pie-.jpg ",
  "href": "http://www.foodnetwork.co.uk/recipes/sweet-potato-spinach-and-chickpea-filo-pie.html",
  "extension": "Chrome",
  "firstAdded": "2016-08-28T12:00:04.569000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Method",
    "1. To make the filling, melt the dairy free pure sunflower spread in a large heavy-based saucepan and sauté the onion until softened and just beginning to brown around the edges. Stir in the garlic and ginger and cook for another 30 seconds or so. Add the garam masala, cumin and coriander and cook for a further minute, stirring.",
    "2. Tip the sweet potatoes and chickpeas into the onion mixture and mix well to combine, then allow to sauté for a couple of minutes. Stir in the stock, tomatoes, coconut milk and sugar. Season with salt and pepper. Bring to the boil, then reduce the heat and simmer for about 10 minutes until the sweet potatoes are completely tender but still holding their shape.",
    "3. Fold the spinach into the sweet potato mixture and cook for another couple of minutes until the spinach is cooked through and tender. The mixture should be nice and chunky at this point – any excess liquid should be reduced down. Remove from the heat and leave to cool completely.",
    "4. To finish making the pie, preheat the oven to 180°C. Brush the base and sides of a large 1.5 litre ovenproof frying pan or you can use a 23cm loose-bottomed cake tin with melted Pure dairy free sunflower spread. Brush two of the filo sheets with melted sunflower spread, then overlap side-by-side in the base of the pan or tin so they drape over the sides. Spoon in half of the cooled sweet potato mixture and smooth over the base. Brush another two sheets of filo, layering them as before, then add the rest of the sweet potato mixture, again smoothing down the layer. Fold the overhanging pastry over to completely cover the filling. Crumple as much as you need of the remaining filo sheets to cover the top of the pie, brushing with the remaining melted sunflower spread. Bake for 25-30 minutes or until the filo is crisp and golden.",
    "5. If using a frying pan, carefully slide the pie on to a board (or remove it from the tin). Serve cut into slices and put on plates with some salad, if liked.",
    "Main Course Vegetarian Dairy Free Pie Chickpeas"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "8-10 filo pastry sheets, thawed if frozen",
    "50g Pure dairy free sunflower spread, melted",
    "For the filling",
    "25g Pure dairy free sunflower spread",
    "1 small onion, diced",
    "1 large garlic clove, finely chopped",
    "1 heaped teaspoon freshly grated root ginger",
    "1 teaspoon garam masala",
    "½ teaspoon each ground cumin and coriander",
    "450g sweet potatoes, peeled and diced",
    "400g can chickpeas, drained and rinsed",
    "200ml vegetable stock",
    "400g can chopped tomatoes",
    "125ml coconut milk",
    "Good pinch of sugar",
    "100g frozen spinach",
    "Sea salt and freshly ground black pepper",
    "Lightly dressed mixed green salad, to serve"
  ],
  "__v": 1
}