{
  "hash": "957cbd880f9a573dd059a433bd8252306a68dc4a",
  "title": "Peanut Butter Pie",
  "image": "http://1g3qt034qrei26p6x54fpg09.wpengine.netdna-cdn.com/wp-content/uploads/2016/09/alton-brown-peanut-butter-pie_200.jpg",
  "href": "http://altonbrown.com/peanut-butter-pie-recipe/",
  "extension": "",
  "firstAdded": "2017-09-25T13:51:37.642000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the oven to 350°F.",
    "Combine the wafers and granulated sugar in a food processor. Process until the wafers are fine crumbs. Melt 6 tablespoons of the butter and drizzle it into the crumb mixture. Pulse to combine. Press this mixture into the bottom, up the sides, and just over the lip of a 9-inch metal pie pan. Bake on the middle rack of the oven for 10 minutes. Cool completely.",
    "Once the crust has cooled, put the peanut butter and the remaining 4 tablespoons butter in the food processor. Process for 1 minute, then add the confectioners' sugar and vanilla and process for another 1 1/2 to 2 minutes, until smooth. Carefully spread the mixture in the pie shell and bake for 10 minutes. Remove from the oven and cool while preparing the topping.",
    "Put the cream in a heatproof bowl and microwave on high just until simmering, approximately 30 seconds. Remove from the microwave and add the chocolate. Make sure the chocolate is completely submerged in the cream. Set aside for 2 minutes. Gently whisk until the chocolate is melted and combined with the cream, 2 to 3 minutes.",
    "Spread the chocolate mixture over the pie and chill in the refrigerator for 1 1/2 hours before serving."
  ],
  "ingredients": [
    "0",
    "6 1/2 ounces chocolate wafers",
    "1 tablespoon granulated sugar",
    "10 tablespoons unsalted butter, at room temperature, divided",
    "1 batch Homemade Peanut Butter",
    "3 ounces confectioners' sugar",
    "1 teaspoon vanilla extract",
    "1/4 cup heavy cream, plus 1 tablespoon",
    "2 ounces good-quality bittersweet chocolate"
  ],
  "__v": 1
}