{
  "hash": "f9ee1abdf6ccd3fadb17776d019b5265e283ac9b",
  "title": "Recipe: Super Paleo CookiesNutrition Facts",
  "image": "",
  "href": "http://www.ourpaleolife.com/recipe/super-paleo-cookies/",
  "extension": "Chrome",
  "firstAdded": "2016-01-08T16:18:12.953000",
  "users": [
    null
  ],
  "keywords": [
    "coconut",
    "flour",
    "eggs",
    "medjool",
    "deglet",
    "noor",
    "dates",
    "honey",
    "raw",
    "almonds",
    "walnuts",
    "hemp",
    "seeds",
    "sunflower",
    "salt",
    "vanilla",
    "ginger",
    "cocoa"
  ],
  "directions": [
    "0",
    "Preheat oven to 350°F. Line a cookie sheet with parchment paper or a silicone baking mat. Set aside.",
    "In the bowl of a food processor, add the coconut flour, eggs, dates, honey, almonds, and walnuts. Pulse until nuts are chopped into smallish pieces (not completely pulverized) and the mixture forms a paste.",
    "Add in the hemp seeds, sunflower seeds, salt, vanilla, ginger, and cocoa powder. Pulse until even combined and mixture is a thick paste/dough.",
    "Using a large cookie scoop (approximately 3 Tbsp capacity), scoop mixture onto prepared baking sheet, 2\" apart. With barely damp fingers, press each cookie down to flatten about 1/2\" thick and 2.5\" diameter. If your fingers are too wet, you'll get flat, glossy cookie tops. Barely damp will let your fingers stick to the dough a little bit and give you pretty, crispy tops",
    "Bake in the preheated oven for 13 minutes, or until the center is not mushy-soft when pressed. Let cool on cookie sheet for 2 minutes before removing to cool completely on a wire rack. Let sit out for at least 6 hours (more in humid climates) to dry out. If you don't, they will get really sticky when stored.",
    "Store in an non-airtight container in a cool location for up to 2 weeks. Airtight containers will seal in moisture and make the cookies sticky."
  ],
  "ingredients": [
    "0",
    "1/4 cup Coconut Flour",
    "4 Large Eggs",
    "8 Medjool Dates (or 18 Deglet Noor Dates), pitted",
    "1/4 cup Honey",
    "1/2 cup Raw Almonds",
    "1/4 cup Walnuts",
    "1/2 cup Hemp Seeds",
    "1/2 cup Sunflower Seeds",
    "1/2 tsp Sea Salt",
    "1 tsp Pure Vanilla Extract",
    "1 tsp Ground Ginger",
    "3 Tbsp Cocoa Powder"
  ],
  "__v": 1
}