{
  "hash": "826698fe48144be1bc730145856689571159f2fb",
  "title": "Roasted Peppers with Spaghetti Stuffing",
  "image": "http://cupofjo.com/wp-content/uploads/2015/04/Screen-Shot-2015-05-03-at-6.20.14-PM-680x726.png",
  "href": "http://cupofjo.com/2015/04/spaghetti-stuffed-roasted-peppers/",
  "extension": "Chrome",
  "firstAdded": "2015-08-26T06:29:30.220000",
  "users": [
    null
  ],
  "keywords": [
    "bell",
    "peppers",
    "preferably",
    "red",
    "orange",
    "yellow",
    "spaghetti",
    "extravirgin",
    "olive",
    "oil",
    "anchovy",
    "fillets",
    "onion",
    "capers",
    "rinsed",
    "wine",
    "vinegar",
    "oregano",
    "leaves"
  ],
  "directions": [
    "0",
    "Place bell peppers directly over the flame of a gas-stove burner and roast, turning with tongs, until blackened all over. (Or roast peppers under the broiler.) Transfer to a large bowl, cover with plastic wrap, and let stand 15 minutes. Peel off skins, slice off tops and remove ribs and seeds.",
    "Bring a large pot of water to a boil; add salt. Cook pasta two minutes less than instructed on package. Drain.",
    "Preheat oven to 350F. Heat a large sauté pan over medium-high. Swirl in oil to coat, then add anchovies, breaking them up with the back of a spoon until dissolved. Add onion and capers and cook, stirring occasionally, just until onion is softened, about 3 minutes. Pour in vinegar and cook, stirring frequently, until almost evaporated. Add pasta and toss to coat.",
    "Generously season cavity of each pepper with salt, then fill with a heaping 1/2 cup pasta mixture, twirling pasta with a fork to fit snugly. Place peppers side by side in a two-quart oval baking dish. Bake until pasta starts to brown in a few spots, 10 to 15 minutes. Let cool slightly before serving, topped with oregano."
  ],
  "ingredients": [
    "0",
    "6 bell peppers (preferably a mix of red, orange and yellow)",
    "8 oz. thin spaghetti",
    "2 tbsp. extra-virgin olive oil",
    "2 anchovy fillets",
    "1/2 red onion, thinly sliced",
    "2 tbsp. capers, rinsed and drained",
    "2 tbsp. red wine vinegar",
    "Fresh oregano leaves, for serving"
  ],
  "__v": 1
}