{
  "hash": "a3446ea531abbfe951560aa22dfb1cd0084ca29c",
  "title": "miso soba soup",
  "image": "http://d1wcgy4dy6voh7.cloudfront.net/wp-content/uploads/2014/01/IMG_0012.jpg",
  "href": "http://www.loveandlemons.com/2014/01/05/miso-soba-soup/",
  "firstAdded": "2015-01-07T17:45:29.661000",
  "users": [
    null
  ],
  "keywords": [
    "kombu",
    "water",
    "dashi",
    "shiitake",
    "mushrooms",
    "soba",
    "noodles",
    "notes",
    "white",
    "shiro",
    "miso",
    "ginger",
    "scallions",
    "cubes",
    "firm",
    "tofu",
    "baby",
    "bok",
    "choy",
    "pieces",
    "coarse",
    "stalks",
    "soy",
    "tamari",
    "shichimi",
    "chile",
    "sprinkling",
    "bonito",
    "ponzu"
  ],
  "directions": [
    "0",
    "Make the dashi: gently rinse the kombu piece. Place it in a medium pot with 4 cups water. Gently simmer for 10 minutes. Don’t let it boil, or the kombu flavor will turn bitter. Once the kombu piece is soft, remove it and bring the water to a boil for just a few minutes.",
    "Add your soba noodles, then reduce heat again and add in ½ cup more water. (It should be just below boiling, you don’t want the miso to boil). In a small bowl, stir the miso paste together with some of the hot dashi water (until it’s not clumpy), then stir to incorporate it into the soup broth.",
    "Add the ginger, scallions and shiitakes, and gently simmer for about 10 more minutes or until the soba noodles are cooked through. (Note: If your soup is getting too thick add more water until it is a thinner consistency).",
    "In the last few minutes of cooking time, add the tofu and bok choy. Taste and adjust seasonings to your liking. Remove from heat once the bok choy is wilted but still has some bite.",
    "Top with shichimi and bonito flakes, (both optional), and serve with ponzu or extra soy sauce on the side."
  ],
  "ingredients": [
    "0",
    "a piece of dried kombu, about 2x3 inches",
    "4 cups water",
    "1",
    "4 cups dashi",
    "½ cup sliced shiitake mushrooms",
    "6 oz. soba noodles (see notes)",
    "3-4 tablespoons white or shiro miso",
    "1 teaspoon grated ginger",
    "¼ cup chopped scallions",
    "½ cup tofu cubes (firm tofu)",
    "4 baby bok choy pieces, coarse stalks thinly sliced",
    "a few teaspoons soy sauce or tamari",
    "2",
    "shichimi or a pinch of chile flakes (optional)",
    "sprinkling of bonito flakes (optional)",
    "ponzu, on the side"
  ],
  "__v": 1
}