{
  "hash": "dac634f113478d0815650c3ef3c67555821196d8",
  "title": "Cranberry Cornmeal Cake",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2009/9/23/0/0117183_Cranberry-Cornbread-Cake_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/cranberry-cornmeal-cake-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-12-21T23:07:32.097000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "butter",
    "room",
    "extra",
    "pan",
    "allpurpose",
    "flour",
    "dusting",
    "yellow",
    "cornmeal",
    "baking",
    "salt",
    "orange",
    "zest",
    "oranges",
    "cranberries",
    "pieces",
    "sugar",
    "vanilla",
    "egg",
    "yolks",
    "eggs"
  ],
  "directions": [
    "0",
    "Put an oven rack in the center of the oven. Preheat the oven to 350 degrees F. Butter and flour a 9-inch round cake pan.",
    "In a medium bowl, whisk together the flour, cornmeal, baking powder, salt, and orange zest. Measure 3 tablespoons of the flour mixture into a small bowl. Add the chopped cranberries and toss until coated. Using a stand mixer fitted with a paddle attachment, beat the butter and sugar on medium speed until light and fluffy, about 2 minutes. Beat in the vanilla extract. Add the egg yolks and whole eggs, 1 at a time. Gradually add the flour mixture and mix until just incorporated. Using a spatula, gently fold in the cranberries.",
    "Pour the batter into the prepared cake pan and smooth the surface with a spatula. Bake until the cake is golden brown, and a cake tester inserted into the center of the cake comes out clean, about 40 minutes. Cool for 20 minutes. Remove the cake from the pan and transfer to a wire rack to cool completely. Cut the cake into wedges, arrange on a serving platter and serve with the Caramel Walnut Sauce. (The cake can be made 1 day ahead. Store airtight in a plastic container.)",
    "Note: This recipe has been updated and may differ from what was originally published or broadcast.",
    "Recipe courtesy of Giada De Laurentiis"
  ],
  "ingredients": [
    "0",
    "3/4 cup (1 1/2 sticks) unsalted butter, at room temperature, plus extra for the pan",
    "1 cup all-purpose flour, plus extra for dusting the pan",
    "1/2 cup yellow fine cornmeal",
    "1 teaspoon baking powder",
    "1/8 teaspoon fine sea salt",
    "1/4 cup orange zest (from 2 large oranges)",
    "3/4 cup dried cranberries, chopped into 1/4-inch pieces",
    "1 1/4 cups sugar",
    "1/2 teaspoon pure vanilla extract",
    "4 large egg yolks",
    "2 large eggs"
  ],
  "__v": 1
}