{
  "hash": "3356bf6accd2cdf3315cb87db44b13a15062f3c5",
  "title": "Gingerbread men",
  "image": "http://recipe-folder.com/img/recipe-images/010/012/3923768010.jpg",
  "href": "https://www.taste.com.au/recipes/gingerbread-men/3a04ab1d-a84a-424f-800a-7ebcbe92fa09",
  "extension": "Chrome",
  "firstAdded": "2018-10-31T06:18:39.421000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Step 1",
    "Preheat oven to 180°C. Brush 2 baking trays with melted butter to lightly grease.",
    "Step 2",
    "Use an electric beater to beat the butter and sugar in a bowl until pale and creamy. Add the golden syrup and egg yolk and beat until combined. Stir in the flour, ginger, mixed spice and bicarbonate of soda. Turn onto a lightly floured surface and knead until smooth. Press dough into a disc. Cover with plastic wrap and place in the fridge for 30 minutes to rest.",
    "Step 3",
    "Meanwhile, place egg white in a clean, dry bowl. Use an electric beater to beat until soft peaks form. Gradually add icing sugar and beat until stiff peaks form. Divide icing among 3 bowls. Cover 1 bowl with plastic wrap and place in the fridge. Add red colouring to 1 bowl and stir until combined. Add green colouring to remaining bowl and stir until combined. Cover with plastic wrap and place in the fridge.",
    "Step 4",
    "Place the dough between 2 sheets of baking paper and roll out until about 4mm thick. Use a 9cm gingerbread man cutter to cut out shapes. Place on trays about 3cm apart. Repeat with any excess dough.",
    "Step 5",
    "Bake in oven for 10 minutes or until brown. Remove from oven. Transfer to a rack to cool.",
    "Step 6",
    "Place prepared icings in small plastic bags. Cut a small hole in a corner of each bag. Pipe icing over gingerbread men to decorate. Finish with Smarties."
  ],
  "ingredients": [
    "0",
    "Melted butter, to grease",
    "125g butter, at room temperature",
    "100g (1/2 cup, firmly packed) CSR Brown Sugar",
    "125ml (1/2 cup) golden syrup",
    "1 egg, separated",
    "375g (2 1/2 cups) plain flour",
    "1 tablespoon ground ginger",
    "1 teaspoon mixed spice",
    "1 teaspoon bicarbonate of soda",
    "Plain flour, to dust",
    "150g (1 cup) CSR Pure Icing Sugar, sifted",
    "8-10 drops red liquid food colouring",
    "8-10 drops green liquid food colouring",
    "Smarties, to decorate"
  ],
  "__v": 1
}