{
  "hash": "823c57f03034a4faf8532bb08296c3712f1142d1",
  "title": "Whiskey and Rye Chocolate Chip Cookies",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/whiskey-and-rye-chocolate-chip-cookies",
  "extension": "Firefox",
  "firstAdded": "2015-10-24T12:36:13.730000",
  "users": [
    null
  ],
  "keywords": [
    "chocolate",
    "wafers",
    "preferably",
    "cacao",
    "divided",
    "allpurpose",
    "flour",
    "rye",
    "baking",
    "soda",
    "kosher",
    "salt",
    "unsalted",
    "butter",
    "room",
    "dark",
    "brown",
    "sugar",
    "granulated",
    "egg",
    "vanilla",
    "bourbon",
    "bean",
    "split",
    "lengthwise",
    "flaky",
    "use",
    "wafer",
    "cookies",
    "specialty",
    "food",
    "grocery",
    "stores",
    "online"
  ],
  "directions": [
    "0",
    "Pulse ¾ cup chocolate wafers in a food processor until pea-sized pieces form. Whisk all-purpose flour, rye flour, baking soda, and kosher salt in a medium bowl.",
    "Using an electric mixer on medium speed, beat butter, brown sugar, and granulated sugar in a large bowl, scraping down sides of bowl as needed, until light and fluffy, 3–4 minutes. Add egg, vanilla, and bourbon and beat until fully incorporated, about 1 minute. Reduce speed to low and slowly add dry ingredients, mixing just to blend. Fold in chopped chocolate and remaining chocolate wafers.",
    "Portion dough into 16 balls (about ¼ cup each) and transfer to a rimmed sheet sheet as you go. Wrap tightly with plastic wrap and chill at least 3 hours or up to 1 day.",
    "Position rack in middle of oven and preheat to 350°. Scrape vanilla seeds into sea salt in a small bowl and mix to combine (save pod for another use).",
    "Divide dough balls between 2 parchment-lined baking sheets, spacing 3\" apart. Flatten each ball to about ¾\" thick and sprinkle with vanilla salt. Bake cookies, rotating sheets halfway through, until golden brown around the edges, 14–18 minutes (cookies will firm up as they cool). Let cool slightly on baking sheets, then transfer to wire racks and let cool completely.",
    "Do Ahead: Cookies can be made 1 day ahead. Store airtight at room temperature."
  ],
  "ingredients": [
    "0",
    "1½ cups chocolate wafers (preferably 72% cacao), divided",
    "2 cups all-purpose flour",
    "½ cup rye flour",
    "½ teaspoon baking soda",
    "1½ teaspoons kosher salt",
    "¾ cup (1½ sticks) plus 1 tablespoon unsalted butter, room temperature",
    "¾ cup dark brown sugar",
    "¾ cup granulated sugar",
    "1 large egg",
    "1½ teaspoons vanilla extract or vanilla paste",
    "1 teaspoon bourbon",
    "1 vanilla bean, split lengthwise",
    "1 teaspoon flaky sea salt",
    "1",
    "Find chocolate wafers (do not use chocolate wafer cookies) at specialty food stores, some grocery stores, and online."
  ],
  "__v": 1
}