{
  "hash": "3dacb90cacd2883b439cd800e6625f198b7afdf9",
  "title": "Creole White Beans with Chicken",
  "image": "http://www.budgetbytes.com/wp-content/uploads/2015/08/Creole-White-Beans-with-Chicken-text-2.jpg",
  "href": "http://www.budgetbytes.com/2015/08/creole-white-beans-with-chicken/",
  "extension": "Chrome",
  "firstAdded": "2016-08-21T14:12:27.220000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place the beans in a large pot and cover with water. Soak the beans overnight in the refrigerator OR, place the beans in a large pot, cover with water, and bring to a boil over high heat. Boil for one minute, turn the heat off and let the beans sit, covered, for one hour. Drain the beans in a colander.",
    "Mince the garlic and dice the onion, celery, and bell peppers. Pull the parsley leaves from the stems and give them a rough chop.",
    "Add the olive oil, garlic, and onion to a large pot and sauté over medium heat until the onions begin to turn transparent (3-5 minutes). Add the celery and bell peppers and sauté a few minutes more, or just until they begin to soften.",
    "Remove the skin from the chicken thighs (if they came with skin) and trim the excess fat if desired. Nestle the chicken thighs down into the sautéed vegetables.",
    "Add the soaked beans, a handful of the parsley (the rest will be used later), Creole seasoning, oregano, smoked paprika, some cracked pepper, and six cups of water. Stir gently to distribute the spices, but not to disturb the thighs.",
    "Cover the pot and bring it to a boil over high heat. Once it reaches a full boil, turn the heat down to low and let it simmer for two hours. Make sure the pot is simmering the whole time, increasing the heat slightly if needed to help it maintain a simmer.",
    "After two hours, test the beans to make sure they are soft. Remove the chicken thighs and use two forks to shred the meat and remove the bones (if using bone-in thighs).",
    "Use a large wooden spoon to smash the beans against the side of the pot to help the liquid thicken. Taste the beans and adjust the salt or Creole seasoning if desired. Return the shredded chicken to the pot and top with fresh parsley. Serve alone or over a bed of rice."
  ],
  "ingredients": [
    "0",
    "1 lb. navy beans (dry) $1.79",
    "1 Tbsp olive oil $0.16",
    "4 cloves garlic $0.32",
    "1 yellow onion $0.37",
    "4 stalks celery $0.79",
    "2 green bell peppers $1.76",
    "1 red bell pepper $1.79",
    "½ bunch flat leaf parsley $0.39",
    "4 skinless chicken thighs (bone-in or boneless) $3.48",
    "2 Tbsp Creole Seasoning blend $0.60",
    "1 tsp oregano $0.10",
    "½ Tbsp smoked paprika $0.15",
    "freshly cracked pepper $0.05",
    "6 cups water $0.00"
  ],
  "__v": 1
}