{
  "hash": "86e20ba96b8ccbff64c5c36cf3fd3510fd1dfad2",
  "title": "Kimchi Fried Rice",
  "image": "http://media2.popsugar-assets.com/files/2012/03/12/1/192/1922195/3aa9590817007bf2_kimchi_fried_rice_square.large/i/Kimchi-Fried-Rice.jpg",
  "href": "http://www.popsugar.com/food/Kimchi-Fried-Rice-Recipe-22273793",
  "extension": "Chrome",
  "firstAdded": "2015-05-11T18:35:05.158000",
  "users": [
    null
  ],
  "keywords": [
    "oil",
    "drizzling",
    "rice",
    "chicken",
    "beef",
    "pork",
    "spam",
    "dayold",
    "white",
    "short",
    "scallions",
    "ends",
    "green",
    "parts",
    "separated",
    "generous",
    "roughly",
    "kimchi",
    "reserved",
    "juice",
    "sesame",
    "soy",
    "eggs",
    "seeds"
  ],
  "directions": [
    "0",
    "DIRECTIONS",
    "I find that the kimchi has plenty of garlic for my palate, but if you're fending off vampires or you're a true allium fiend, feel free to mince some up and add it when you toss in the scallion ends.",
    "Heat oil in a wok or a large skillet over medium-high heat. Add meat and cook, stirring occasionally, until cooked through (about 2-3 minutes).",
    "Meanwhile, place rice in a large bowl and drizzle with a little vegetable oil. With your hands, separate rice grains as much as possible without smashing or breaking them. Use just enough oil to coat each grain.",
    "To the pan, add the white parts of the scallions and cook just until fragrant, about 30 seconds. Add the kimchi and juice and stir to toss. Add the rice and toss to coat, distributing the ingredients evenly. Allow the rice to cook for about 10 minutes, tossing halfway through, or as needed, to keep the bottom of the rice from burning.",
    "Drizzle with the sesame oil and soy sauce, and toss to distribute evenly. Cook for another 3-5 minutes, tossing as needed to keep the bottom of the rice from burning. Taste for seasoning, and add a sprinkling more sesame oil and soy sauce, if desired. Reserve a handful of green onions and toss the rest in the pan with the rice. Quickly give it a toss to distribute, then divide rice between two bowls.",
    "In a small pan, fry both eggs and use to top the kimchi fried rice. Garnish with reserved green onions and sesame seeds."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1 tablespoon vegetable oil, plus more for drizzling on rice",
    "1/2 cup chopped chicken, beef, pork, or Spam",
    "3 cups day-old cooked white short grain rice",
    "3 finely sliced scallions, white ends and green parts separated",
    "1 generous cup roughly chopped kimchi, plus some reserved juice",
    "2 teaspoons sesame oil",
    "1 teaspoon soy sauce",
    "2 eggs",
    "Sesame seeds, for garnish"
  ],
  "__v": 1
}