{
  "hash": "a680d47e026092c23dd44ad8dbf52b450884777b",
  "title": "Pork Carnitas (Mexican Slow Cooker Pulled Pork)",
  "image": "http://cdn2.recipetineats.com/wp-content/uploads/2016/03/Pork-Carnitas_square_1200px.jpg",
  "href": "http://www.recipetineats.com/pork-carnitas-mexican-slow-cooker-pulled-pork/",
  "extension": "Chrome",
  "firstAdded": "2016-09-06T23:07:58.521000",
  "users": [
    null,
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Rinse and dry the pork shoulder, rub in salt and pepper.",
    "Combine the rub ingredients then rub all over the pork.",
    "Place the pork in a slow cooker (fat cap up), top with the onion, jalapeño, minced garlic (don't worry about spreading it) and squeeze over the juice of the orange.",
    "Cook on low for 8 to 10 hours or on high for 6 hours (or 1h 30 m in a pressure cooker on high).",
    "The meat should be tender and falling off the bone. Remove from the slow cooker and let cool slightly. Then shred the pork using two forks.",
    "Skim off the fat from the juices remaining in the slow cooker and discard the fat. Then if you are left with a lot more than 1½ to 2 cups of juice, then reduce it (either in the slow cooker on the sauté setting with the lid off, or in a saucepan). The liquid will be SALTY, it is the seasoning for the pork. Set aside.",
    "1",
    "Heat 1 tbsp of oil in a large non stick pan over high heat. Place shredded pork into the pan and press down and cook until the bottom side is golden brown and crusty.",
    "Drizzle over the juices and serve immediately (if you are using defrosted carnitas, this is not applicable as the juices are already on the meat - see Note 4c).",
    "If you are reheating the carnitas (Note 4), then flip and cook the other side briefly just to warm through. I really recommend only making one side crusty and leaving the other side juicy and moist."
  ],
  "ingredients": [
    "0",
    "5 lb / 2.5 kg pork shoulder (pork butt), skinless, bone-in (4lb/2kg without bone) (Note 3)",
    "1 onion, chopped",
    "1 jalapeno, deseeded, chopped",
    "2½ tsp salt",
    "1 tsp black pepper",
    "4 cloves garlic, minced",
    "2 oranges, juice only (or sub with ¾ cup fresh orange juice)",
    "1",
    "1 tbsp dried oregano",
    "2 tsp ground cumin",
    "1 tbsp olive oil"
  ],
  "__v": 2
}