{
  "hash": "340f13571b8ca82be1da0c4ace9453d6abbd33b4",
  "title": "Balsamic BBQ Seitan and Tempeh Ribs",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2013/11/seitan-ribs-1066x800.jpg",
  "href": "http://www.onegreenplanet.org/plant-based-recipes/balsamic-bbq-seitan-and-tempeh-ribs/",
  "extension": "Chrome",
  "firstAdded": "2015-06-08T09:14:51.675000",
  "users": [
    null
  ],
  "keywords": [
    "raw",
    "turbinado",
    "sugar",
    "tbs",
    "smoked",
    "paprika",
    "cayenne",
    "pepper",
    "garlic",
    "oregano",
    "kosher",
    "salt",
    "black",
    "parsley",
    "apple",
    "cider",
    "vinegar",
    "balsamic",
    "maple",
    "syrup",
    "ketchup",
    "red",
    "onion",
    "clove",
    "serrano",
    "chile",
    "seeded",
    "vital",
    "wheat",
    "gluten",
    "mexican",
    "nutritional",
    "yeast",
    "water",
    "tahini",
    "lowsodium",
    "soy",
    "smoke"
  ],
  "directions": [
    "0",
    "In a small bowl, combine the ingredients for the spice rub. Mix well and set aside.",
    "In a small saucepan over medium heat, combine the apple cider vinegar, balsamic vinegar, maple syrup, ketchup, red onion, garlic and chile. Stir and let simmer, uncovered, for about an hour. Increase the heat to medium-high and cook for 15 more minutes until the sauce thickens. Stir it often. If it seems too thick, add some water.",
    "Preheat the oven to 350 degrees. In a large bowl, combine the dry ingredients for the seitan and mix well. In a smaller bowl, combine the wet ingredients. Add the wet ingredients to the dry and mix until just combined. Knead the dough lightly until everything is combined and the dough feels elastic.",
    "Grease or spray a baking dish. Add the dough to the baking dish, flattening it and stretching it out to fit the dish. Cut the dough into 8 strips and then in half to make 16 thick ribs. (Note: if you want the ribs thin, this is enough dough to fill 2 baking sheets. If you want them thick, it is enough for one).",
    "Top the dough with the spice rub and massage it in a bit. Bake the seitan for 40 to 60 minutes or until the seitan has a sturdy texture to it (thinner ribs will cook faster). Remove the dish from the oven. Recut the strips and carefully remove them from the baking dish.",
    "Increase the oven temperature to 400 degrees. Slather the ribs with BBQ sauce and lay them on a baking sheet. Put the ribs back in the oven for just about 10 minutes so the sauce can get a bit charred. Alternatively, you can cook the sauce-covered ribs on a grill or in a grill pan.",
    "1",
    "Slice a package of tempeh into 6 or 8 rectangles, depending how wide you want the “ribs” to be. If you want them to be thinner, slice the tempeh in half like a bagel first. I like my tempeh thin so I do this extra cut all the time. Steam the tempeh for 15 minutes until it softens a bit.",
    "Coat the tempeh with the spice rub. Cook the tempeh ribs in the oven or in a skillet until browned on both sides. This should take about 8 minutes per side. Brush the BBQ sauce on the tempeh and cook for another few minutes until slightly charred."
  ],
  "ingredients": [
    "0",
    "1/4 cup raw turbinado sugar",
    "2 Tbs. smoked paprika",
    "1 tsp. cayenne pepper",
    "3 garlic cloves, minced",
    "2 tsp. dried oregano",
    "1 Tbs. Kosher salt",
    "1 ½ tsp. ground black pepper",
    "¼ cup fresh parsley, minced",
    "1",
    "½ cup apple cider vinegar",
    "¾ cup balsamic vinegar",
    "¾ cup maple syrup",
    "1 1/2 cups ketchup",
    "1 red onion, minced",
    "1 garlic clove, minced",
    "1 serrano chile, seeded and minced",
    "2",
    "2 cups vital wheat gluten",
    "3 Tbs. Mexican chile powder",
    "3 Tbs. dried onion powder",
    "3 Tbs. dried garlic powder",
    "¼ cup nutritional yeast",
    "½ tsp. ground black pepper",
    "2 cups water",
    "¼ cup tahini",
    "¼ cup low-sodium soy sauce",
    "2 tsp. liquid smoke"
  ],
  "__v": 1
}