{
  "hash": "5408b832e3217a4a7a10956e866381a7dae54440",
  "title": "Oven-Baked Buffalo Hot Wings (Paleo)",
  "image": "",
  "href": "http://www.food.com/recipe/oven-baked-buffalo-hot-wings-paleo-523221",
  "extension": "Chrome",
  "firstAdded": "2015-10-06T04:13:19.004000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "drumetts",
    "organic",
    "chickens",
    "wings",
    "pieces",
    "discard",
    "tips",
    "hot",
    "commercial",
    "butter",
    "cayenne",
    "pepper",
    "salt",
    "garlic",
    "baking",
    "olive",
    "oil",
    "flavored",
    "cooking",
    "spray",
    "pam"
  ],
  "directions": [
    "0",
    "Preheat oven 250&deg;F Line baking sheet with foil. Spray baking rack with Olive oil Pam and place in pan.",
    "Spray the chicken pieces with Olive oil Pam, then salt and pepper to taste. Season with garlic powder.",
    "In a large zip lock bag, place 1/4 cup of the baking powder and 1 tsp of cayenne pepper. Add half the chicken and toss until coated. Place on the cooking rack. Repeat with other half of chicken and remaining powder and cayenne.",
    "Bake coated chicken wings for 20 min at 250 F, then increase heat to 425 F and bake for 20 more minutes. Turn pieces over and bake for another 20 min or until golden brown and chicken is thoroughly cooked.",
    "If making your own buffalo sauce, heat prepared hot sauce (commercial or homemade) and butter in a sauce pan until well blended. Pour sauce in a large bowl. If using a commercially prepared buffalo sauce just pour it in a large bowl. I highly recommend my habanero mango sauce (also paleo compliant), but Franks Red Hot Buffalo Sauce is quite good and not terrible from a paleo point of view.",
    "Toss all the cooked chicken until evenly coated. Transfer to a platter and serve with your favorite sides."
  ],
  "ingredients": [
    "0",
    "50 chicken, drumetts (organic) or 25 whole chickens, wings cut into two pieces (discard tips)",
    "2 cups hot sauce (commercial or homemade)",
    "1 cup butter (organic)",
    "2 teaspoons cayenne pepper",
    "1 teaspoon salt",
    "1 teaspoon pepper",
    "1 teaspoon garlic powder",
    "1⁄2 cup baking powder",
    "olive oil flavored cooking spray (Pam)"
  ],
  "__v": 1
}