{
  "hash": "ebdbf4d97cad5ae752aa90a81e09328dcc9698a7",
  "title": "Oven Baked Skinny Shredded Barbecue Chicken Sandwiches",
  "image": "http://77easyrecipes.com/wp-content/uploads/2016/07/Oven-Baked-Skinny-Shredded-Barbecue-Chicken-Sandwiches.jpg",
  "href": "http://77easyrecipes.com/oven-baked-skinny-shredded-barbecue-chicken-sandwiches/",
  "extension": "Chrome",
  "firstAdded": "2017-02-12T22:49:51.281000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "1. Preheat oven to 325 degrees. Place chicken breasts in a roasting pan or rectangular Pyrex baking dish. Arrange sliced onions over the chicken, then pour the barbecue sauce over top, reserving 1 cup for later. Cover the baking dish/pan tightly with foil and place in the oven. Cook chicken for 1 hour, remove foil and cook for about 10 minutes longer until chicken is fork tender.",
    "2. In the meantime, prepare the coleslaw-In a large bowl add the cabbage, carrots and scallions. In a small bowl mix together the dressing ingredients. Refrigerate the coleslaw and dressing separately until ready to serve. Don’t toss until serving to keep coleslaw crisp and crunchy, not soggy.",
    "3. Remove the chicken to a plate or cutting board. Using two forks, pull the chicken breasts apart to shred the meat. Place the shredded chicken back in the pan, add the reserved 1 cup barbecue sauce and toss the chicken well to thoroughly coat in the sauce that’s remaining in the pan.",
    "4. Serve the pulled chicken warm. Place on the bottom of each sandwich thin ½ cup barbecue shredded chicken. Add onion, ¾ cup slaw and top with sandwich thin.",
    "5. If you have any leftovers, the shredded chicken freezes great. You can use leftover chicken to stuff a baked potato or add to a salad. Plus, this recipe can easily be cut in half!",
    "Makes 12 servings (each serving ½ cup shredded chicken and ¾ cup coleslaw)"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 pounds boneless, skinless chicken breast",
    "1 large onion, thinly sliced",
    "1 (18 oz) bottle of Sweet Baby Ray’s Honey Barbecue sauce or your favorite",
    "6 cups shredded white cabbage, 1 (10 oz) bag",
    "1 cup shredded carrots",
    "¾ cup scallions, chopped",
    "4 tablespoons light mayonnaise, I like Best Foods (Hellman’s) Light",
    "1 tablespoon plus 2 teaspoons apple cider vinegar",
    "2½ tablespoons spicy brown mustard",
    "1 tablespoon honey",
    "¼ teaspoon prepared white horseradish",
    "2 packages Oroweat’s Honey Wheat Sandwich Thins, see shopping tip"
  ],
  "__v": 1
}