{
  "hash": "9c75c8648601b02ca467e5b8686d687d3c72a813",
  "title": "Instant Pot Beets",
  "image": "https://www.pressurecookrecipes.com/wp-content/uploads/2017/10/instant-pot-beets-recipe-200x200.jpg",
  "href": "https://www.pressurecookrecipes.com/instant-pot-beets/",
  "extension": "Chrome",
  "firstAdded": "2019-06-17T23:37:12.845000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare Beets: Rub and wash the beets under cold running tap water. If your beets come with greens & stems, trim them off and save them for another dish (stir-frying with garlic tastes great). Trim off & discard the roots.",
    "Pressure Cook Beets: Pour 1 cup (250ml) cold tap water in the pressure cooker. Place a trivet or steamer basket in the Instant Pot, then place 6 medium beets (784g, 7.5” circumference) on the trivet. Close the lid and cook at High Pressure for 24 minutes (firm and a little crunchy) - 28 minutes (soft with some chew) + Quick Release (immediately release the pressure by turning the venting knob to venting position). Carefully open the lid.*Pro Tip 1: Adjust the cooking time according to your beets' size using the time chart below.Beets Pressure Cooking Time Chart:Pressure Cooking Method: High Pressure, then Quick ReleaseBeets Circumference: Texture Preference (Firm & a little crunchy - Soft with some chew)5 inches: 11 - 15 minutes5.5 inches: 14 - 18 minutes6 inches: 17 - 21 minutes6.5 inches: 18 - 23 minutes7 inches: 20 - 25 minutes7.5 inches: 24 - 28 minutes8 inches: 27 - 31 minutes8.5 inches: 30 - 34 minutes9 inches: 32 - 36 minutes",
    "Peel and Serve: The skins are edible. To peel or not to peel is of personal preference. Cut beets into quarters (you can wear disposable gloves to handle the beets if you don't want beet-stained fingers). Season with salt if desired and serve hot or cold."
  ],
  "ingredients": [
    "0",
    "6 (1 3/4 lb, 784g) medium beets (7.5” circumference)",
    "1 cup (250ml) cold water"
  ],
  "__v": 1
}