{
  "__v": 1,
  "directions": [
    "0",
    "To make the mole-d beef: (If using small dried chili, cut the stems off of the chili and shake out the seeds) Soak the ancho chili/or small dried chili with enough hot water to cover until soft (microwave on high for 1 min will do it). Add the soften chili along with 2 tbsp of the soaking water, and tequila, onion, garlic and thyme in a blender and blend until pureed. Set aside. Mix Mexican chili powder, unsweetened coco powder, paprika, ground cumin and ground coriander in a small bowl, set aside. Heat olive oil and unsalted butter in a large skillet over high heat.",
    "Cook the ground beef with 1 1/4 tsp of sea salt and 1/2 tsp of freshly ground black pepper until nicely browned (if water starts to emit from the beef in the beginning which prevents proper browning, just continue to cook until all liquid has evaporated). Once browned, add the spice-mixture and cook until fragrant, then add the chili-puree. Scrape off any browned-bits on the skillet and cook until most of the moisture has evaporated, just a few min.",
    "Transfer to a container and set aside until needed. Can be made the day before and reheat before serving.",
    "To make the reprocessed beans: Drain the beans thoroughly into a large sieve, then rinse off any excess starch with water, drain again and set aside. Heat olive oil, chicken stock, thyme leaves, onion powder and black pepper in a skillet until warm. Add the beans and cook for a couple min until most liquid has evaporated. Set aside until needed. Can be done the day before and reheat before serving.",
    "To make the sour cream cabbage slaw: Nothing worse than watery slaws, so we’re gonna drain the liquid out of the vegetables first.",
    "Cut the tomatoes in half and squeeze out any excess juice from the center, then finely dice them. Thoroughly mix the diced tomatoes, finely shredded cabbage, minced shallots, chopped cilantro and mined green chili (or jalapeño) with 1 1/4 tsp of salt and 2 tbsp of lime juice. Let sit for 20 to 25 min then squeeze out excess liquid out of the vegetables with your hands and transfer them to another bowl. Discard the liquid. Mix the vegetables with sour cream and freshly ground black pepper until evenly coated. This is something you should make right before serving.",
    "To cook the quail eggs: Heat 2 tbsp of oil in a non-stick skillet over medium-high heat. Crack the quail eggs into a small dish then slide into the skillet (quail egg-shells tend to shatter more easily). Cook on one side only just until the egg-whites are set, with the yolk still runny. Season lightly with salt and pepper, and set aside on a plate.",
    "To fry the tortillas: Add enough canola oil in a pot until it reaches 1 1/2″ (4 cm) deep. Heat over medium-high heat until a wooden chopstick bubbles up along the edges in the oil. Fry the tortilla, one by one (unless you have an enormous pot), until puffed and golden browned on both side, adjusting the temperature of the oil as you go. Each tortilla should only take 1 to fry.",
    "Drain them on paper-towels and serve immediately.",
    "To assemble the tostadas: Pretty self-explanatory. Pile mole-beef, sour cream cabbage slaw, reprocessed beans and fried quail eggs over the crispy tortilla. Squeeze lime juice on top and dashes of tabasco."
  ],
  "firstAdded": "2014-08-09T18:51:14.475000",
  "hash": "183175fd726d63e4e1df71310f8290bc3de2e32e",
  "href": "http://www.ladyandpups.com/2014/08/08/easy-mole-d-beef-tostadas/",
  "image": "http://www.ladyandpups.com/wp-content/uploads/2014/08/ground-beef-taco-front2.jpg",
  "ingredients": [
    "0",
    "Easy mole-d beef:",
    "17.6 oz (500 grams) of ground beef (75% lean)",
    "2 medium ancho chili, or 8 small dried chili",
    "2 tbsp of tequila",
    "1 small red onion, roughly chopped",
    "3 cloves of garlic",
    "4 sprigs of fresh thyme leaves",
    "1 1/2 tsp of Mexican chili powder",
    "1 1/2 tsp of unsweetened coco powder",
    "1 tsp of paprika",
    "3/4 tsp of ground cumin",
    "1/2 tsp of ground coriander",
    "2 tbsp of olive oil + 1 tbsp of unsalted butter",
    "1 1/4 tsp of sea salt",
    "1/2 tsp of freshly ground black pepper",
    "17.6 oz (500 grams) of ground beef (75% lean)",
    "2 medium ancho chili, or 8 small dried chili",
    "2 tbsp of tequila",
    "1 small red onion, roughly chopped",
    "3 cloves of garlic",
    "4 sprigs of fresh thyme leaves",
    "1 1/2 tsp of Mexican chili powder",
    "1 1/2 tsp of unsweetened coco powder",
    "1 tsp of paprika",
    "3/4 tsp of ground cumin",
    "1/2 tsp of ground coriander",
    "2 tbsp of olive oil + 1 tbsp of unsalted butter",
    "1 1/4 tsp of sea salt",
    "1/2 tsp of freshly ground black pepper"
  ],
  "keywords": [
    "easy",
    "moled",
    "beef",
    "lean",
    "medium",
    "ancho",
    "chili",
    "tequila",
    "red",
    "onion",
    "roughly",
    "garlic",
    "sprigs",
    "thyme",
    "leaves",
    "mexican",
    "coco",
    "paprika",
    "cumin",
    "coriander",
    "olive",
    "oil",
    "unsalted",
    "butter",
    "salt",
    "black",
    "pepper"
  ],
  "title": "EASY MOLE-D BEEF TOSTADAS",
  "users": [
    null
  ]
}