{
  "hash": "4577074c7ff288c473a553752ca081f2f075c1ce",
  "title": "Skinny Spinach Lasagna",
  "image": "http://cdn.pinchofyum.com/wp-content/uploads/2014/03/spinach-lasagna-41.jpg",
  "href": "http://pinchofyum.com/skinny-spinach-lasagna",
  "extension": "Firefox",
  "firstAdded": "2016-04-06T00:48:29.155000",
  "users": [
    null
  ],
  "keywords": [
    "butter",
    "garlic",
    "thyme",
    "spinach",
    "lbs",
    "ricotta",
    "cheese",
    "used",
    "milk",
    "nonfat",
    "egg",
    "salt",
    "nutmeg",
    "squeeze",
    "lemon",
    "juice",
    "noboil",
    "lasagna",
    "noodles",
    "jar",
    "spaghetti",
    "marinara",
    "trader",
    "joes",
    "tomato",
    "basil",
    "mozzarella"
  ],
  "directions": [
    "0",
    "Melt the butter in a large skillet over medium heat. Add the garlic and thyme; saute for 2-3 minutes. Add the spinach; saute until just barely wilted, about 2 minutes. Remove from heat.",
    "In a large bowl, combine the ricotta, egg, salt, nutmeg, and a squeeze of lemon juice. Add the spinach and stir to combine. Transfer some of the mixture to a food processor and pulse a few times to break up some of the spinach pieces (totally optional, but makes for a really nice texture).",
    "Preheat the oven to 375 degrees. Spread a little bit of tomato sauce in the bottom of a 9x13 pan. Layer with 3 lasagna noodles, ⅓ of the spinach mixture, ¼ of the tomato sauce, and ¼ of the cheese. Repeat and pour ½ cup water over the two layers. Repeat once more, ending with noodles, sauce, and cheese. Pour ½ cup water over the whole thing again and cover tightly with oiled foil.",
    "Bake for 30-40 minutes; when the liquid is bubbling and the noodles have softened, remove the foil and bake uncovered for 10 more minutes. Let stand for 10-15 minutes before serving so that the lasagna noodles can soak up all the extra moisture."
  ],
  "ingredients": [
    "0",
    "2 tablespoons butter",
    "1 tablespoon minced garlic",
    "2 teaspoons minced fresh thyme",
    "6 ounces fresh spinach",
    "2 lbs. ricotta cheese (I used 1 lb. whole milk and 1 lb. nonfat)",
    "1 egg",
    "½ teaspoon salt",
    "¼ teaspoon nutmeg",
    "a squeeze of lemon juice (optional, to taste)",
    "12 no-boil lasagna noodles",
    "1 24 ounce jar of spaghetti or marinara sauce (I used Trader Joe's tomato basil)",
    "2 cups shredded mozzarella cheese"
  ],
  "__v": 1
}