{
  "hash": "5b780792ee0be6831a6e1d1f6c8ea79856f3c7a7",
  "title": "Black-Eyed Peas with Bacon and Pork",
  "image": "//food.fnr.sndimg.com/content/dam/images/food/fullset/2010/6/24/1/NY0701_Black-Eyed-Peas-with-Bacon-and-Pork_s4x3.jpg.rend.hgtvcom.826.620.suffix/1371593540909.jpeg",
  "href": "https://www.foodnetwork.com/recipes/patrick-and-gina-neely/black-eyed-peas-with-bacon-and-pork-recipe-1920605",
  "extension": "Firefox",
  "firstAdded": "2019-07-12T21:06:07.223000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "If using dried black-eyed peas, put them in a large pot and cover with about 4 inches of water. Soak the peas overnight, then drain the water and rinse. Alternatively, you can \"quick-soak\" the peas by bringing them and the water to a boil for 2 minutes. After this, remove them from the heat, cover the pot and soak the peas for 1 hour. Then, drain and rinse the peas.",
    "Heat the oil in a large pot over medium-high heat. When the oil is shimmering, add the pork. Sear until the pork is browned on all sides, 4 to 5 minutes. Add the bacon, onion and garlic to the pot and cook, stirring, until the onion and garlic are lightly browned, about 6 to 8 minutes. Add the salt, black pepper, cayenne and garlic powder. Cook until the entire mixture is coated with the spices, about 2 minutes. Pour in the stock and water and drop in the bay leaves. Bring the mixture to a boil, then reduce the heat and simmer, covered, for about 30 minutes.",
    "When the pork begins to fall apart, add the prepared peas to the pot and simmer until the peas are very soft, about 1 to 1 1/2 hours (see Cook's Note).",
    "Taste for seasonings, and add some hot-pepper vinegar, if desired. Discard the bay leaves and transfer the black-eyed peas to a serving bowl."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 pound dried black-eyed peas (fresh or canned black-eyed peas can be substituted)",
    "2 tablespoons vegetable oil",
    "6 ounces pork shoulder, diced into 1/2-inch cubes",
    "4 strips thick sliced bacon, cut into 1/2-inch pieces",
    "1 medium onion, small diced",
    "4 garlic cloves, sliced",
    "1 1/2 teaspoons salt",
    "1 teaspoon freshly cracked black pepper",
    "1/2 teaspoon cayenne pepper",
    "1 teaspoon garlic powder",
    "4 cups chicken stock",
    "2 cups water",
    "3 bay leaves"
  ],
  "__v": 1
}