{
  "hash": "c70aa7c889e0dcd0ff6d434462f0c58adcd9208a",
  "title": "Crispy Kale, Roasted Butternut Squash & Tomato Pappardelle",
  "image": "https://images.food52.com/G_aMXrgIE8X_8ljP2IYovalBPrQ=/753x502/2561726d-1091-468d-82fd-3fa36bc319de--Pasta2.jpg",
  "href": "https://food52.com/recipes/63795-crispy-kale-roasted-butternut-squash-tomato-pappardelle",
  "extension": "Chrome",
  "firstAdded": "2018-01-05T12:52:09.503000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 400 degrees F.",
    "Drizzle the cherry tomatoes and cubed butternut squash liberally with olive oil and season with salt and pepper. Arrange in one layer on a rimmed baking sheet and bake until the tomatoes wilt and squash browns on the edges (the smaller you cube your squash, the crispier the edges will get, which I like!). This will take about 20-30 minutes, so start checking after 20 minutes.",
    "Meanwhile, tear the kale leaves into small pieces and drizzle them liberally with olive oil and season with salt and pepper. Arrange in a single layer on another rimmed baking sheet and bake for about 10-12 minutes, or until crispy. They burn easily so start checking after 10 minutes.",
    "Set the cooked vegetables aside. Bring a large pot of well-salted water to boil. Add the pasta and cook until just shy of al dente. Drain the pasta and set aside, reserving 1/2 cup of the pasta cooking water.",
    "Heat a tablespoon of olive oil in a large skillet over medium-high heat. Add the garlic and onion and cook until softened and fragrant, about 3 minutes. Add the white wine (or use water) and cook until the liquid is almost fully reduced.",
    "Add the cooked pasta and the reserved pasta water and toss together, cooking for about a minute.",
    "Remove from the heat and toss with the vegetables. Top each plate with a bit of freshly grated Parmesan cheese."
  ],
  "ingredients": [
    "0",
    "1 pound dried pappardelle pasta",
    "1/2 bunch kale, washed and stems removed",
    "2 pints cherry tomatoes",
    "1 small butternut squash, peeled and cubed",
    "1 small yellow onion, diced",
    "1 clove garlic, minced",
    "1/2 cup dry white wine, optional (sub water if you prefer)",
    "salt and pepper to taste",
    "1/2 cup freshly grated Parmesan cheese",
    "olive oil for drizzling"
  ],
  "__v": 1
}