{
  "hash": "15f67adc558bc782ec9c315fc8e337a5a3ce204a",
  "title": "Homemade Corn Dogs",
  "image": "http://www.acozykitchen.com/wp-content/uploads/2010/06/CornDogs_OH2.jpg",
  "href": "http://acozykitchen.com/homemade-corn-dogs/",
  "extension": "Chrome",
  "firstAdded": "2015-05-24T17:03:07.963000",
  "users": [
    null
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "yellow",
    "corn",
    "meal",
    "baking",
    "salt",
    "soda",
    "cayenne",
    "egg",
    "milk",
    "hot",
    "veggie",
    "dogs",
    "cornstarch",
    "dredging",
    "skewers",
    "length"
  ],
  "directions": [
    "0",
    "Grab a pair of tongs and line a baking sheet with paper towels. (For the corn dogs after frying.)",
    "Pour your oil in a cast iron skillet, dutch oven, or deep fryer. Heat over medium-high heat until your thermometer reads 375F (Note: My thermometer broke (long story) so I eyeballed this. Obviously, this isn’t the way to go but I just tested the oil by putting a drop of the batter in. When it rose to the top, I knew it was ready).",
    "In a medium mixing bowl, whisk together the flour, yellow corn meal, baking powder, salt, baking soda and cayenne. In a large bowl whisk the one egg and whole milk. Then add the dry ingredients to the wet ingredients all at once, mixing until just combined. The mixture will look a lot like pancake mix. Don’t over-mix and let it rest for 10 minutes. Note: I found it easiest to transfer the mixture to a skinnier cup. It made it much easier to dip in the batter.",
    "While your batter is resting, lay your cornstarch on a baking sheet or big plate. Place each hot dog on a skewer and roll in the cornstarch, being sure to pat off any excess. Then quickly dip the hot dog in and out of the batter. Immediately place the corn dog in the hot oil. Be careful! The oil will be hot and may splash back at you. Cook until the coating is golden brown, 4-5 minutes. Remove with tongs and place on paper towels for draining. Serve with ketchup and mustard."
  ],
  "ingredients": [
    "0",
    "2/3 cups of all-purpose flour",
    "1/2 cup of yellow corn meal",
    "1 tablespoon of baking powder",
    "1 teaspoon of salt",
    "1/4 teaspoon of baking soda",
    "1/4 teaspoon of cayenne",
    "1 egg",
    "3/4 cup of whole milk",
    "4 hot dogs or veggie dogs",
    "4 tablespoons of cornstarch (for dredging)",
    "4 skewers (cut to a 6 inch length)"
  ],
  "__v": 1
}