{
  "hash": "8bc44b01d95c9e1b2a1a3d3de863b544fa737077",
  "title": "Raw Chocolate Pudding (Vegan + No Added Sugar)",
  "image": "http://cdn.ohsheglows.com/wp-content/uploads/2015/02/veganchocolatemousse-5360.jpg",
  "href": "http://ohsheglows.com/2015/02/02/raw-chocolate-pudding-vegan-no-added-sugar/",
  "extension": "Chrome",
  "firstAdded": "2016-02-15T21:15:40.949000",
  "users": [
    null
  ],
  "keywords": [
    "pudding",
    "medium",
    "bananas",
    "avocado",
    "smooth",
    "raw",
    "almond",
    "butter",
    "cacao",
    "vanilla",
    "pink",
    "himalayan",
    "salt",
    "toppings",
    "coconut",
    "whipped",
    "cream",
    "recipe",
    "linked",
    "notes",
    "hazelnuts",
    "raspberry",
    "chia",
    "seed",
    "jam",
    "pomegranate",
    "arils"
  ],
  "directions": [
    "0",
    "Directions:",
    "Add all pudding ingredients into a food processor and process until smooth, stopping to scrape down the sides of the bowl as needed. I like to let the machine run for a couple minutes to get it super smooth.",
    "Portion the pudding into a container and chill in the fridge for an hour or so. Or you can serve it right away with the recommended toppings. Best enjoyed within 12-24 hours or so.",
    "Tips:",
    "Tips: 1) You want to avoid using overly ripe, brown bananas in this recipe or the banana flavour will overwhelm. Yellow with a few spots is best. 2) If you want an \"instant\" cold pudding, refrigerate the bananas and avocado prior to making this pudding. 3) For the coconut whipped cream recipe, see here. 4) For toasted hazelnuts, roast the nuts at 300F for 10-14 minutes until the skins start to fall off the nuts. Place toasted nuts in an old tea towel and rub vigorously to remove the skins.For my Raspberry Chia Seed Jam recipe, see here. 6) I don't recommend using an avocado that is bruised as it will be bitter. A soft, but still green, avocado is perfect for this recipe."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "For the pudding:",
    "3 medium bananas, peeled (see note)",
    "1/2 medium avocado, pitted (see note)",
    "1/4 cup smooth raw almond butter",
    "4-5 tablespoons raw cacao powder, or to taste",
    "1 teaspoon pure vanilla extract",
    "pinch of pink Himalayan salt or fine sea salt",
    "Optional toppings:",
    "Coconut Whipped Cream (recipe linked in notes below)",
    "1/4 cup hazelnuts, toasted and chopped",
    "Raspberry chia seed jam (recipe linked in notes below)",
    "Pomegranate arils"
  ],
  "__v": 1
}