{
  "hash": "d6d3465abae083b8285db1ab88b62779916e6a89",
  "title": "Tasting Table's Matzah Shortbread and Charoset Compote",
  "image": "http://a.abcnews.com/assets/images/font-sm_off2.gif",
  "href": "http://abcnews.go.com/GMA/recipe/matzah-shortbread-charoset-compote-recipe-tasting-table-23245098?nwltr=GMAR_tryHed_pos1",
  "extension": "Chrome",
  "firstAdded": "2015-03-27T21:18:12.204000",
  "users": [
    null
  ],
  "keywords": [
    "matzah",
    "shortbread",
    "meal",
    "almond",
    "flour",
    "sugar",
    "kosher",
    "salt",
    "margarine",
    "charoset",
    "compote",
    "fuji",
    "apples",
    "granny",
    "smith",
    "water",
    "dark",
    "brown",
    "ginger",
    "cinnamon",
    "nutmeg",
    "walnuts",
    "figs",
    "red",
    "wine"
  ],
  "directions": [
    "0",
    "For the Matzah shortbread: Preheat oven to 375 degrees F. In a medium mixing bowl, whisk together the matzah meal, almond flour, sugar and salt. Add the margarine and mix with a spoon until the mixture resembles wet sand. Transfer the dough mixture to a parchment-lined cookie sheet, and press into a rectangular shape about 1/4-inch thick. With a bench scraper or knife, gently score dough into 11/2-inch squares. Bake for 12 minutes, until golden brown. Remove from the oven and let cool on the cookie sheet on a wire rack. Once cook, break the shortbread into 24 squares using the score-lines as a guide.",
    "In a large skillet over high heat, combine the apples, water, dark brown sugar, salt, cloves, ginger, cinnamon and nutmeg. Bring to a simmer, then reduce heat to low. Cook, stirring occasionally, until most of the liquid has been evaporated, about 20 minutes.",
    "Place the walnuts on a parchment-lined cookie sheet and toast in the oven until lightly browned, about 8 minutes. Add the toasted walnuts, figs and red wine to the apples and continue to cook on low until all the wine has been absorbed, about 10 minutes. Remove from heat and let cool. Once cooled, transfer to the bowl of a food processor and pulse several times to bring the ingredients together, being careful not to over process so that it remains chunky. Serve with the matzah shortbreads.",
    "Recipe courtesy TastingTable.com."
  ],
  "ingredients": [
    "0",
    "Matzah Shortbread",
    "1 cup matzah meal",
    "1 cup almond flour",
    "1/4 cup sugar",
    "2 teaspoons kosher salt",
    "1 stick (8 tablespoons) margarine, melted",
    "Charoset Compote",
    "2 Fuji apples, finely diced",
    "2 Granny Smith apples, finely diced 1 cup water",
    "3 tablespoons dark brown sugar",
    "1/2 teaspoon kosher salt",
    "1/4 teaspoon ground cloves",
    "1/4 teaspoon ground ginger",
    "1/4 teaspoon ground cinnamon",
    "1/4 teaspoon ground nutmeg",
    "1 cup chopped walnuts",
    "1/2 cup dried figs, finely diced",
    "1/2 cup Kosher red wine"
  ],
  "__v": 1
}