{
  "hash": "108c139fb114e0904c7b41986ffdcec7aa23869a",
  "title": "HEALTHY HORCHATA – CINNAMON RICE MILK",
  "image": "http://www.oneingredientchef.com/wp-content/uploads/2014/07/Horchata.jpg",
  "href": "http://www.oneingredientchef.com/horchata/",
  "extension": "Chrome",
  "firstAdded": "2015-05-08T22:22:11.213000",
  "users": [
    null
  ],
  "keywords": [
    "uncooked",
    "white",
    "rice",
    "raw",
    "cashews",
    "water",
    "vanilla",
    "cinnamon",
    "medjool",
    "dates",
    "andor",
    "sweetener"
  ],
  "directions": [
    "0",
    "Step One",
    "Soak the cashews and rice (virtually any kind of white rice will work here) together in several inches of water for 2-6 hours. This will allow both ingredients to soften and become easier to blend. The easier they blend, the more flavor they will impart.",
    "Step Two",
    "Once the rice & cashews are softened, drain the soaking water and combine them in a blender with all the other ingredients – water, vanilla, cinnamon, and dates (pitted!). With dates alone, this drink won’t be too terribly sweet. If you’d like more sweetness, feel free to add a little natural sugar. More “natural” sweeteners like maple syrup or sucanat are not only healthier but add a nice rustic taste here that works extremely well with the spices. With all the ingredients in the blender, blend on high for 2 minutes to fully puree all the solid ingredients. A Vitamix is super helpful here, but any decent blender should get the job done.",
    "Step Three",
    "Strain. No matter how good your blender, there will still be grainy particles (mostly rice) in the liquid. Strain this off using a cheesecloth, nut milk bag, or even a paint filter bag that can be found for $2 at a hardware store (for more on these straining options, see my How to Make THICK Almond Milk post).",
    "Step Four",
    "The beverage is finished at this point, but is best served chilled. To do that, pour the strained liquid into a mason jar, seal, and refrigerate for several hours before serving."
  ],
  "ingredients": [
    "0",
    "1/3 cup uncooked white rice",
    "1/4 cup raw cashews",
    "3 cups water",
    "1+ teaspoon vanilla extract",
    "1 teaspoon ground cinnamon",
    "5 medjool dates (and/or other sweetener)"
  ],
  "__v": 1
}