{
  "hash": "8e1776597aa5d36d4bc16c7b8c1e2bdafb4f5cb5",
  "title": "Roast Pumpkin and Squash Seeds",
  "image": "http://p-fst1.pixstatic.com/525dd329697ab06b8600c2d1._w.540_s.fit_.jpg",
  "href": "http://www.thekitchn.com/how-to-roast-pumpkin-and-squash-seeds-4687",
  "extension": "Chrome",
  "firstAdded": "2015-12-08T15:41:47.562000",
  "users": [
    null
  ],
  "keywords": [
    "winter",
    "squash",
    "pumpkin",
    "neutral",
    "oil",
    "canola",
    "rice",
    "bran",
    "coconut",
    "salt"
  ],
  "directions": [
    "0",
    "Instructions",
    "Scoop and clean the seeds: Preheat oven to 300°F. Cut the squash according to how you are going to use it. Scoop the seeds from the cavity and place in a colander. Pinch away all the large chunks of squash flesh and strings. Place the colander under cool running water and remove any additional squash flesh. Shake colander to remove water.",
    "Dry the seeds: Dump the seeds out onto a towel and pat to dry. The seeds might stick to the towel a bit.",
    "Oil and salt the seeds: Place the seeds on a baking tray and drizzle with a small amount of oil, approximately 1 teaspoon for 3/4 cup of seeds. Add a pinch or two of salt.",
    "Toss and bake the seeds: Toss the seeds until they are evenly coated with oil and salt. Spread out so they are in a single layer, though some overlapping is fine. Place the baking sheet into the oven. Roast until the seeds are just starting to brown, about 20 to 25 minutes. If your oven has uneven spots, you may want to stir after 10 minutes.",
    "Remove and cool: Remove the seeds from the oven and let the seeds cool on the tray. Enjoy right away or keep for a few days in an airtight container.",
    "Recipe Notes",
    "Sweet Pumpkin Seeds: Omit or reduce the salt and roast the seeds on parchment-lined baking sheet. Let cool, then toss with brown sugar or a little maple syrup. Not too much, just enough to lightly coat the seeds. You can also add cinnamon, allspice, nutmeg or other 'sweet' spices. Toss well to coat evenly. Return the tray to the oven and continue to roast for another 10 to 15 minutes or so.",
    "Sweet-Hot Pumpkin Seeds: Toss the seeds with a little honey and sriracha or chili flakes. A little cumin might be nice, or curry powder. Roast as with sweet seeds.",
    "Savory Pumpkin Seeds: Add herbs such as chopped rosemary, dried oregano and/or spices such as smoked paprika, chili powder, cumin to the seeds before roasting. Check carefully to be sure the herbs and spices aren't browning too quickly. If so, roast at a sightly lower heat."
  ],
  "ingredients": [
    "0",
    "A large winter squash such as a pumpkin",
    "Neutral oil such as canola, rice bran, or coconut",
    "Salt"
  ],
  "__v": 1
}