{
  "hash": "6533e560424abc417119ef4415594b514e78dcb7",
  "title": "Broccoli Rabe Peanut Soba Noodles",
  "image": "https://cookieandkate.com/images/2015/05/peanut-soba-noodles-with-broccoli-rabe.jpg",
  "href": "https://cookieandkate.com/2015/broccoli-rabe-peanut-soba-noodles/",
  "extension": "Firefox",
  "firstAdded": "2018-10-22T17:50:54.235000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare the broccoli rabe by rinsing it well and patting it dry. Slice off the tough lower ends of the stems and discard. Slice off any remaining stems that are over ¼-inch in diameter and discard those as well, since they will be too fibrous even after cooking.",
    "Next, prepare the peanut sauce. In a 2-cup liquid measuring cup, whisk together the ingredients until well blended. Set aside.",
    "Bring a large pot of salted water to boil. Meanwhile, warm 2 tablespoons olive oil in a large skillet over medium heat. Add the broccoli rabe and season with a dash of salt and a small pinch of red pepper flakes. Toss to combine and continue cooking, stirring occasionally, until the leaves have wilted and the stems are easily pierced by a fork, about 8 minutes. Remove from heat.",
    "Once the water is boiling, add the soba noodles and cook just until al dente, about 5 minutes. Drain the noodles, then return them to the pot, add the broccoli rabe and toss with peanut sauce (you might not quite need all of it) until blended.",
    "Transfer to a serving bowl or individual bowls and top with a sprinkle of chopped cilantro, a small squeeze of lime juice, a sprinkle of sesame seeds and red pepper flakes, if you’d like some extra heat."
  ],
  "ingredients": [
    "0",
    "6 ounces soba noodles or whole grain spaghetti",
    "1 pound broccoli rabe",
    "2 tablespoons extra-virgin olive oil",
    "Salt",
    "Peanut sauce",
    "½ cup creamy peanut butter",
    "¼ cup reduced sodium tamari or reduced-sodium soy sauce",
    "3 tablespoons rice vinegar",
    "3 tablespoons water",
    "2 tablespoons honey or agave nectar",
    "1 teaspoon grated fresh ginger",
    "2 cloves garlic, pressed or minced",
    "¼ teaspoon red pepper flakes, plus more for sprinkling",
    "Garnishes",
    "Small handful chopped fresh cilantro",
    "1 small lime wedge",
    "½ teaspoon sesame seeds"
  ],
  "__v": 2
}