{
  "hash": "eeedbc120d4a50fdd957225d4b0e653d8cac9ed6",
  "title": "butternut squash & cider soup",
  "image": "https://alexandracooks.com/wp-content/uploads/2014/10/15587670555_4bcffdf8f4_o1.jpg",
  "href": "https://alexandracooks.com/2014/10/21/butternut-squash-and-cider-soup-served-with-rosemary-and-sage-flatbread/",
  "extension": "Chrome",
  "firstAdded": "2019-01-02T23:46:36.001000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Heat a medium-size saucepan over low heat. Add the onion, garlic, and 1/2 cup water. Cook until the shallot and garlic are softened, being careful not to let them burn, 5 to 7 minutes — the water will be nearly evaporated.",
    "Add the squash and the chicken stock and bring to a boil. Reduce the heat, cover, and simmer until the squash is soft, about 20 minutes.",
    "Using an immersion blender, purée until roughly smooth. (Alternatively, carefully pour the mixture into a blender. Holding the top down with a towel, blend until smooth.) Add the cider, 1/2 cup of the sour cream, and salt. Continue blending until well combined. Taste, add more salt if necessary. (I often add another teaspoon of kosher salt.) Add more sour cream if desired (I always do.). Thin out with more stock — you may need as much as another cup of stock. Taste, adjust seasoning again as necessary. Serve immediately with good bread."
  ],
  "ingredients": [
    "0",
    "DESCRIPTION",
    "Adapted from Food52 and The Essential New York Times Cookbook. I have made a double quantity here and have made a few minor adjustments: onion for shallot, no garnish, a bit more chicken stock…that’s about it.",
    "INGREDIENTS",
    "1/2 large white or yellow onion, minced",
    "1 clove garlic, peeled and minced",
    "8 cups peeled, seeded and cubed butternut squash",
    "1 cup chicken stock, preferably homemade, plus more for thinning out as needed",
    "1 1/2 cups apple cider",
    "1/2 cup to 2/3 cup sour cream",
    "1 teaspoon salt, plus more to taste",
    "Cracked black pepper",
    "Bread for serving"
  ],
  "__v": 1
}