{
  "__v": 1,
  "directions": [
    "0",
    "Mix together cabbage, scallions, and panko. Add a few pinches of salt and a few grinds of pepper. Gently mix in eggs. This will be on the watery side, but if it feels much too watery, add 1/4 more panko. Don’t add much more than that, this should not become a dry dough.",
    "Heat a large skillet to medium-high. Add a few splashes of olive oil.",
    "Using a quarter-cup measuring cup (or similar sided scooping device), drop the batter into the skillet and flatten gently with a spatula. Turn the heat down to medium and cook okonomiyakis on each side for 2-3 minutes. (or if you’re making larger pancakes, cook each side for 3-4 minutes).",
    "Remove from pan, brush with worcestershire sauce, squeeze sweet mayo on top, and top with sesame seeds and (optional) bonito flakes."
  ],
  "firstAdded": "2014-08-24T21:00:47.258000",
  "hash": "de8ccb3dd60b30ea36451818e3f36c878fb466b0",
  "href": "http://www.loveandlemons.com/2012/06/01/okonomiyaki/",
  "image": "http://d1wcgy4dy6voh7.cloudfront.net/wp-content/uploads/2012/06/okonomiyaki.jpg",
  "ingredients": [
    "0",
    "3 cups cabbage, finely shredded on a mandoline",
    "1 bunch scallions, white and green parts, chopped (a little more than 1 cup)",
    "1 cup panko (up to 1/4 cup more if your mixture is overly watery after you add the eggs)",
    "3 eggs, beaten",
    "a splash of oil, for the pan",
    "salt & pepper",
    "(optional other fillings: chopped shrimp, meat, etc…)",
    "toppings:",
    "vegan worcestershire sauce (we found that the ingredients in Annie’s brand are remarkably close to the actual ingredients in okonomiyaki sauce.",
    ". Regular worcestershire is less sweet and the sauce should be slightly sweet).",
    "sweet mayo: 1/4 cup mayo (I used vegan mayo), plus 1 teaspoon honey, plus 1/4 teaspoon sriracha. (put it in a squirt bottle, or a small plastic bag with a tiny corner cut off)",
    "sesame seeds",
    "bonito flakes (optional – these are not vegetarian)"
  ],
  "keywords": [
    "cabbage",
    "mandoline",
    "bunch",
    "scallions",
    "white",
    "green",
    "parts",
    "panko",
    "mixture",
    "overly",
    "watery",
    "eggs",
    "splash",
    "oil",
    "pan",
    "salt",
    "pepper",
    "fillings",
    "shrimp",
    "meat",
    "toppings",
    "vegan",
    "worcestershire",
    "annies",
    "brand",
    "remarkably",
    "close",
    "actual",
    "okonomiyaki",
    "regular",
    "slightly",
    "used",
    "mayo",
    "honey",
    "sriracha",
    "squirt",
    "bottle",
    "plastic",
    "corner",
    "sesame",
    "seeds",
    "bonito",
    "vegetarian"
  ],
  "title": "veggie okonomiyaki",
  "users": [
    null
  ]
}