{
  "hash": "7f6eda9f0e91712b8f0fae1c244156b5badb6fef",
  "title": "Skinny Chicken Enchiladas",
  "image": "http://cdn.pinchofyum.com/wp-content/uploads/2012/02/enchilada2.jpg",
  "href": "http://pinchofyum.com/skinny-chicken-enchiladas",
  "extension": "Chrome",
  "firstAdded": "2015-08-11T17:17:29.708000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "breasts",
    "black",
    "beans",
    "rinsed",
    "corn",
    "salsa",
    "taco",
    "seasoning",
    "water",
    "tortillas",
    "cheddar",
    "cheese",
    "avocado",
    "crema",
    "notes",
    "cilantro",
    "cotija"
  ],
  "directions": [
    "0",
    "Put the first 6 ingredients in a crockpot. If your salsa is not very saucy, be sure to include the ¼ cup water or more if necessary. Cook on high for about 3 hours (or longer on the low setting) until chicken is cooked through. You can also cut the chicken breasts into halves to help them cook faster. Use 2 forks to shred the chicken and mix everything together.",
    "Preheat the oven to 400 degrees. Soften the corn tortillas in the microwave, 3 at a time, for about 25 seconds. Fill them with a few tablespoons of filling, roll once, and place seam-side down in a large baking dish (I did 2 smaller baking dishes). Continue until all tortillas have been filled, rolled and placed in dish. Be sure to pack them in tightly next to each other so that they don't come apart.",
    "Sprinkle evenly with the shredded cheese and bake for about 15-20 minutes, until cheese is melted and bubbly and everything is heated through.",
    "Remove from oven and drizzle with crema. Sprinkle with avocado pieces, fresh cilantro, and Cotija cheese crumbles."
  ],
  "ingredients": [
    "0",
    "1 lb. chicken breasts",
    "1 can black beans, drained and rinsed",
    "1 can corn, drained",
    "16 oz. fresh salsa",
    "3 tablespoons taco seasoning",
    "¼ cup water (optional)",
    "12 small corn tortillas",
    "1 cup shredded cheddar cheese",
    "1 avocado, diced",
    "¼ cup crema (see notes)",
    "fresh cilantro, Cotija cheese for topping"
  ],
  "__v": 1
}