{
  "hash": "47bdabcfd01204354a6f2d62f260f02d3a1c3d8b",
  "title": "Kangaroo Steaks in Red Wine Sauce",
  "image": "",
  "href": "http://www.bbcgoodfood.com/user/2876241/recipe/kangaroo-steaks-red-wine-sauce",
  "extension": "Firefox",
  "firstAdded": "2016-01-03T18:32:31.144000",
  "users": [
    null
  ],
  "keywords": [
    "loin",
    "kangaroo",
    "fillet",
    "steaks",
    "goodquality",
    "dry",
    "red",
    "wine",
    "clove",
    "garlic",
    "onion",
    "chives",
    "oil",
    "cream"
  ],
  "directions": [
    "0",
    "Method",
    "Combine wine, chives, garlic and onion in bowl. Add kangaroo meat, toss until coated. cover with plastic wrap. Refrigerate for at least 2 hours or overnight. Remove meat from marinade, drain. Reserve marinade.",
    "Heat oil in pan; add meat. Cook over high heat 2 minutes to seal sides, turning. For rare meat, cook 2 more minutes. For medium meat, reduce heat to medium, continue cooking for 3 minutes. (If using steaks cook for 3-4 minutes, turning occasionally.) **Note: Kangaroo meat has a very low fat content and will become dry if overcooked. Cook it to rare or medium stage only and leave for a few minutes before serving. This will produce tender, juicy kangaroo meat.**",
    "Remove meat from pan. Cover and keep warm. Add reserved marinade and cream to pan juices, bring to boil. Reduce heat to low and simmer uncovered 3 minutes or until sauce has reduced and thickened. Return meat to heated sauce in pan if further cooking/warming required - do not re-fry or heat in microwave!!",
    "Slice cooked fillets thinly and serve with warm sauce. Suggestion: Serve with mashed (or crushed sweet) potato and fresh vegetables"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "500g loin kangaroo fillet or 4 kangaroo fillet steaks",
    "1 cup good-quality dry red wine",
    "1 clove garlic, crushed",
    "1 small onion, finely chopped",
    "1 teaspoon chopped fresh chives",
    "1 tablespoon oil",
    "½ cup cream"
  ],
  "__v": 1
}