{
  "__v": 1,
  "directions": [
    "0",
    "A little note on Sichuan peppercorns: Not all Sichuan peppercorns are created equal. The quality and variety of the these mini pods will separate your dish from being bland to great. There are two major varieties, one green and one red. The green one delivers a powerful “numbing” sensation on your tongue which is the meaning of the word “ma” in Chinese dishes. The red one provides an intensely floral and peppery fragrance but with very little of the “numbing” effect. They are usually used together to produce the perfect balance in Sichuan cuisine. Online source for ingredients, including \"douban chili paste\" is listed on my website.",
    "Make the chili oil: If you don’t already have homemade and bottled Sichuan chili oil on hand (why the hell don’t you?), you can put together a quick one. Combine vegetable oil, scallion, ginger, garlic, star anise, cinnamon, green peppercorn and red peppercorn in a small sauce pot. Set over medium heat and let the ingredients fry in the oil until the garlic and scallion are faintly browned. Add the chili flakes, ground coriander, and cumin. Evenly stir and keep frying for another minute until the chili flakes slightly darken in color. Turn off the heat and set it aside (the longer it sits, the better the flavor).",
    "Make the dan-dan sauce: Mix the pork evenly with soy sauce and sesame oil. Set aside. Purée garlic, ginger, douban paste, and peanut butter in a food processor until smooth. You don’t have to do this if you don’t mind the sometimes chunky texture of douban paste -- just mince the garlic and ginger, then combine it with douban paste and peanut butter. In a medium heavy-bottom pot, nicely brown the pork in 1 tbsp of oil. Add the ground red sichuan peppercorn, puréed paste and sauté until fragrant, with some brown bits forming at the bottom of the pot, approximately 2 minutes. Add the rice wine and deglaze the pot, then add the chicken stock. Bring to a simmer then add 1/2 to 1 teaspoon of sugar to balance out the saltiness. Then add ground white pepper and keep simmering for another 5 minutes.",
    "Meanwhile, bring another big pot of water to boil and cook the noodles according to package instructions. I would suggest NOT using fresh noodles as they absorb the sauce too quickly once combined. Drain the noodles once cooked, toss with sauce, and divide them into 2 bowls. Divide the sauce into the same bowls and add a few sprigs of cilantro or diced scallions.",
    "Add 2 tablespoons (or more) of the chili oil on top through a sieve. Stir and slurp and… BURN!"
  ],
  "firstAdded": "2014-06-06T13:59:43.941000",
  "hash": "b16e6e882503a6617a5165f2943802d3dbae2506",
  "href": "http://food52.com/recipes/23713-sichuan-dan-dan-noodles",
  "image": "https://d2k9njawademcf.cloudfront.net/indeximages/35731/full/2013-0924_CP-sichuan-dan-dan-noodle-008.jpg?1380209345",
  "ingredients": [
    "0",
    "1/2 cup vegetable oil",
    "1 scallion, cut into segments",
    "2 slices of ginger",
    "2 cloves of garlic, smashed",
    "2 star anise pods",
    "1 small piece of cinnamon, approximately 1 inch long",
    "3 teaspoons green Sichuan peppercorns, crushed",
    "1 teaspoon red Sichuan peppercorns, crushed",
    "2 1/2 tablespoons chili flakes (preferably Sichuan or Korean)",
    "1/8 teaspoon ground coriander",
    "1/8 teaspoon ground cumin",
    "1",
    "5.3 ounces (150 grams) ground pork",
    "1 teaspoon soy sauce",
    "1 teaspoon sesame oil",
    "4 cloves of garlic",
    "1 piece of ginger, approximately 1 tablespoon",
    "2 to 3 tablespoons douban chili paste, depending on saltiness",
    "3 1/2 tablespoons unsweetened peanut butter",
    "1/2 teaspoon ground red sichuan peppercorn",
    "2 tablespoons Chinese cooking wine, or rice wine",
    "2 1/4 cups unsalted chicken stock",
    "1 bunch of Asian dry noodles",
    "Chopped scallions or cilantro, for garnish"
  ],
  "keywords": [
    "oil",
    "scallion",
    "segments",
    "slices",
    "ginger",
    "garlic",
    "smashed",
    "star",
    "anise",
    "pods",
    "cinnamon",
    "long",
    "green",
    "sichuan",
    "peppercorns",
    "red",
    "chili",
    "preferably",
    "korean",
    "coriander",
    "cumin",
    "pork",
    "soy",
    "sesame",
    "douban",
    "depending",
    "saltiness",
    "peanut",
    "butter",
    "peppercorn",
    "chinese",
    "cooking",
    "rice",
    "wine",
    "unsalted",
    "chicken",
    "stock",
    "bunch",
    "asian",
    "dry",
    "noodles",
    "scallions",
    "cilantro"
  ],
  "title": "Sichuan Dan-Dan Noodles",
  "users": [
    null
  ]
}