{
  "hash": "8afd00afa3c99a91922290fffa52454f10f6197d",
  "title": "Buttermilk Fried Chicken",
  "image": "http://content1.tastebook.com/content/photo/photo/Or71oqQc13c223235333232323fgVZzKUv_1430467613.jpg",
  "href": "http://www.tastebook.com/recipes/4230015-Buttermilk-Fried-Chicken?&ref=Email_B2C_2015-4-30",
  "extension": "Chrome",
  "firstAdded": "2015-05-01T14:31:52.327000",
  "users": [
    null
  ],
  "keywords": [
    "ngredients",
    "fryer",
    "chicken",
    "parts",
    "buttermilk",
    "shaken",
    "dry",
    "mustard",
    "cayenne",
    "coarse",
    "salt",
    "pepper",
    "allpurpose",
    "flour",
    "yellow",
    "cornmeal",
    "neutraltasting",
    "oil",
    "safflower",
    "frying"
  ],
  "directions": [
    "0",
    "Directions",
    "1",
    "Place chicken parts in one or two shallow dishes, just large enough to hold them snugly. In a medium bowl, whisk together the buttermilk, mustard powder, and 1 teaspoon cayenne; season with salt and pepper. Pour marinade over the chicken, making sure the parts are completely submerged. Alternatively, divide the chicken and marinade evenly among large resealable bags; rest the bags on a rimmed baking sheet to catch any leaks.) Cover tightly and refrigerate at least 4 hours or up to overnight.",
    "2",
    "Remove chicken from the marinade and allow to drain on a wire rack set over a rimmed baking sheet for 1 hour before cooking (discard marinade). Meanwhile, whisk together the flour, cornmeal, and remaining 1/4 teaspoon cayenne; season with salt and pepper. Spread mixture in a shallow dish.",
    "3",
    "When you are ready to begin frying, pour a scant 1/2 inch oil into a large cast-iron skillet and heat over medium until oil registers 375°F on a deep- fry thermometer. (Alternatively, test by dropping a cube of white crustless bread into the oil; it should turn golden brown within 1 minute.)",
    "4",
    "While the oil is heating, and working with a few parts at a time, dredge chicken in the flour mixture, turning to completely coat. Shake off excess flour and set chicken on a parchment- lined baking sheet as you work.",
    "5",
    "Preheat oven to 200°F. Set a clean wire rack on a rimmed baking sheet with several layers of paper towels on top of rack. Working in batches (skillet should be filled but without pieces touching each other), arrange chicken, skin side down, in a single layer. Adjust heat so temperature of oil remains between 330°F and 340°F during frying. Cover and cook until chicken is crisp and golden on bottom and parts remove easily from pan, 4 to 5 minutes. Carefully turn chicken and continue frying (covered) until crisp and cooked through (breasts should register 160°F and thighs 165°F on an instant- read thermometer), 4 to 5 minutes more. Remove each part as soon as it is ready (wings, drumsticks, and thinner breast pieces cook faster than thighs). Transfer to prepared rack on baking sheet and keep warm in the oven while cooking remaining chicken, returning oil to 375°F before adding each batch. Serve chicken hot.",
    "Reprinted from Martha’s American Food: A Celebration of Our Nation’s Most Treasured Dishes, from Coast to Coast Copyright © 2012 by Martha Stewart. Published by Clarkson Potter, an imprint of Penguin Random House LLC."
  ],
  "ingredients": [
    "0",
    "ngredients",
    "1 whole fryer chicken (2 1/2 to 3 pounds), cut into 10 parts",
    "1 quart buttermilk, well shaken",
    "1 1/2 tablespoons dry mustard powder",
    "1 1/4 teaspoons cayenne",
    "Coarse salt and freshly ground pepper",
    "1 1/2 cups all-purpose flour",
    "2 tablespoons yellow cornmeal",
    "Neutral-tasting oil, such as safflower, for frying"
  ],
  "__v": 1
}