{
  "hash": "01f1f19d9729b3add1b30b612b4121dae8ee1d1e",
  "title": "The Best Way to Cook Beets",
  "image": "https://farm5.static.flickr.com/4070/4312427545_cd65631b12_o.jpg",
  "href": "http://food52.com/blog/437-the-best-way-to-cook-beets",
  "extension": "Chrome",
  "firstAdded": "2015-07-14T19:33:50.566000",
  "users": [
    null
  ],
  "keywords": [
    "trick",
    "successfully",
    "cooking",
    "beets",
    "soften",
    "concentrating",
    "flavor"
  ],
  "directions": [
    "0",
    "Heat your oven to 350 degrees.",
    "Cut off the leggy root (seen above) and the tops (here's a great recipe for the leaves: Pink Greens). Then scrub the beets if they're dirty.",
    "Lay a large piece of foil on a baking sheet, leaving half the foil hanging off one end. Place the beets on top of the foil on the baking sheet. Sprinkle the beets with olive oil -- just enough to dress them like salad greens -- and season with salt and pepper. Fold the foli in half to make a packet and crimp the edges.",
    "Bake until the beets are tender (you can check by piercing a fork through the foil). It usually takes 40 to 60 minutes, depending on the size of the beets. Let them cool in the foil packets.",
    "When the beets are cool enough to touch, remove them from the packet and peel off the skins -- they should slip off like Concord grape skins.",
    "What to do with your perfectly roasted beets? Oh, where to begin! Here are 3 ideas:",
    "1. Cut the beets into small wedges and toss them with Greek yogurt and Meyer lemon zest and juice.",
    "2. Slice the beets into thin circles, arrange in a cluster on a flameproof pan, cover the beets with thin slices of Camembert and broil until the cheese melts and begins to toast.",
    "3. Cut the beets into tiny cubes, dress them with a sharp mustardy vinaigrette and spoon them atop a tuft of mache, frisee or baby arugula. Serve with roasted salmon (this one perhaps!)."
  ],
  "ingredients": [
    "0",
    "The trick to successfully cooking beets is to soften them while also concentrating their sweet flavor."
  ],
  "__v": 1
}