{
  "hash": "203e196fa5ef7fed9148d5de8f6a90800053dc8b",
  "title": "Blackened Salmon Tacos with Forbidden Rice & Mango Guacamole",
  "image": "https://cmt.azureedge.net/media/blackened_salmon_tacos_with_forbidden_ri_201808200015560255625ka6c6.jpg",
  "href": "https://www.copymethat.com/r/v63rcrF/blackened-salmon-tacos-with-forbidden-ri/",
  "extension": "",
  "firstAdded": "2018-12-29T00:19:59.641000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cook rice on the stovetop according to the directions on the package. Black rice typically takes about 45 minutes to cook and is chewy when done.",
    "Preheat oven to 400 degrees F if you are baking the salmon (options to grill are in the notes section). Line a large baking sheet with parchment paper and grease lightly with olive oil or nonstick cooking spray. Place salmon skin side down and sprinkle blackening seasoning on the salmon. Use your fingertips to rub the seasoning evenly all over the salmon. Bake for 15-20 minutes or until salmon easily flakes with a fork. Mine is always perfect at 18 minutes!",
    "While the salmon and rice are cooking, make the mango guacamole. In a medium bowl, add the avocado and use a fork to mash it until it reaches the desired consistency. (If you like chunky guac, don’t mash it as much.) Add in diced red onion, jalapeno, cilantro, lime zest and juice, and mango; stir well to combine then add salt and pepper to taste. Set aside until tacos are ready to assemble.",
    "Once salmon is done cooking, flake it with a fork and discard the skin. Add a salmon and rice to warm corn tortillas, then top each with a heaping tablespoon of guacamole. Serves 4 people, 2 tacos each."
  ],
  "ingredients": [
    "0",
    "For the rice:",
    "3/4 cup uncooked forbidden rice (black rice)",
    "For the salmon:",
    "1 pound fresh salmon (I prefer wild)",
    "1 tablespoon blackening seasoning",
    "For the mango guacamole:",
    "1 medium ripe avocado",
    "1/4 cup diced red onion",
    "1/2 jalapeno, seeded and minced",
    "1/4 cup fresh chopped cilantro",
    "1 ripe mango, diced",
    "Zest and juice of 1 small lime",
    "Salt and pepper to taste",
    "For the tacos:",
    "8 corn tortillas",
    "To garnish: extra cilantro & diced red onion"
  ],
  "__v": 1
}