{
  "hash": "cd370f1edb6f9bbb892fd21d9ca66c9dc1703139",
  "title": "Chicken Broccoli Stilton Pasta Bake",
  "image": "http://i0.wp.com/neilshealthymeals.com/wp-content/uploads/2015/06/Chicken-Broccoli-Stilton-Pasta-Bake-Featured-Image.jpg?fit=620%2C812",
  "href": "http://neilshealthymeals.com/chicken-broccoli-stilton-pasta-bake/",
  "extension": "Chrome",
  "firstAdded": "2016-04-17T15:35:26.175000",
  "users": [
    null
  ],
  "keywords": [
    "wheat",
    "fusilli",
    "broccoli",
    "florets",
    "skimmed",
    "milk",
    "corn",
    "flour",
    "mixed",
    "cold",
    "water",
    "crumbled",
    "stilton",
    "cheese",
    "chicken",
    "breast",
    "fillets",
    "bite",
    "sized",
    "chunks",
    "low",
    "fat",
    "cheddar",
    "salt",
    "pepper"
  ],
  "directions": [
    "0",
    "Pre-heat oven to 180C Fan",
    "Bring a large pan of salted water to the boil, stir in the pasta and return to the boil. Turn down to simmer for 8 minutes.",
    "Add the broccoli florets and cook for a further 6 minutes, then drain through a sieve and place the pasta and florets into a casserole dish.",
    "In a medium sized saucepan make the stilton sauce by combining the milk and corn flour over a low heat. Bring to the boil, stirring constantly, until thickened, season to taste, then turn the heat down and add the stilton cheese.",
    "Stir the chicken into the stilton sauce and allow it to cook, gently, for about 5 – 6 minutes, again stirring constantly, making sure all the chicken is well combined into the sauce.",
    "Mix the chicken and stilton sauce with the pasta and broccoli together in the casserole dish, top with the grated cheddar cheese and bake for about 20 minutes until the cheese has melted on top and is golden coloured.",
    "Serve with extra vegetables or a mixed leaf salad."
  ],
  "ingredients": [
    "0",
    "200g whole wheat fusilli",
    "150g broccoli florets",
    "400ml skimmed milk",
    "20g corn flour mixed with 2 tbsp. cold water",
    "70g crumbled stilton cheese",
    "370g chicken breast fillets, cut into small bite sized chunks",
    "80g grated low fat cheddar cheese",
    "Freshly ground salt and pepper"
  ],
  "__v": 1
}