{
  "hash": "862ddf4fb9557bc8063070d62de4d20479689d84",
  "title": "Julishka Pie (Juliška Pita)",
  "image": "https://bakingwithsibella.files.wordpress.com/2011/11/043.jpg?w=656",
  "href": "https://bakingwithsibella.com/2011/11/25/julishka-pie-juliska-pita/",
  "extension": "Chrome",
  "firstAdded": "2018-12-11T13:21:08.545000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Also needed: 9X13 in baking pan",
    "1. Roll out both sheets of puff pastry on a lightly flour dusted surface to the size of the 9X13 in baking pan (or just a bit larger). Bake the 1st sheet on the pan turned up-side down for 10 minutes at 365 F or until nice golden color. Let it cool down for few minutes and carefully cut it into rectangles (to get about 25 pieces, make 4 cuts vertically and 4 horizontally).",
    "2. Bake the 2nd sheet for 5 minutes at 350 F. It just needs to be half done. Set aside.",
    "3. For the dough divide eggs. Beat egg whites with a pinch of salt until firm, set aside. In a stand mixer mix 5 yolks, 1 cup of sugar and vanilla until pale yellow and smooth. Melt chocolate in a hot water bath, add to yolk mixture and mix by hand (collage photos 1 & 2). Fold in ground walnuts and egg whites at the end.",
    "4. Place the half done puff pastry sheet into the baking pan and pour the dough on the top of it (see collage photo 3). Bake at 375 F about 20- 30 minutes or until firm to touch. Let it cool down completely.",
    "5. For the frosting base whisk 5 tbsp flour and 1/4 milk until smooth. Lightly boil 1 cup of milk and with constant mixing add the flour mixture to it. Mix until it becomes thick, then take it off the stove and cool down.",
    "6. Mix sugar, vanilla and butter until smooth and fluffy. Add it to the completely cooled down frosting base and again mix well to combine.",
    "7. Spread the frosting onto the top of the pie (see collage photo 4), arrange all the puff pastry rectangles that you’ve previously cut (collage photo 5). Dust with confectioners sugar (collage photo 6), cover with aluminium foil and leave it in the fridge for at least 3 hours before serving.",
    "Before serving, cut into the sizes of your prearranged rectangles and voila… Enjoy!"
  ],
  "ingredients": [
    "0",
    "Julishka Pie (Juliška Pita)",
    "NOVEMBER 25, 2011 ~ BAKINGWITHSIBELLA.COM",
    "Julishka (read Yuleeshkah) is a very rich desert, loved and made for at least 60 years in Bosnia and practically all regions of Ex-Yugoslavia. It’s a classic, it never fails to surprise one’s taste buds, it is delectable! I usually make it for the holidays and my husband’s birthday since it’s his favorite desert. Julishka is entirely made from scratch and the process requires some time, but the end result is just pure joy!",
    "Ingredients: Printable version",
    "1 pack of Puff Pastry Sheets (thawed)",
    "1 cup (200 g sugar)",
    "1 pack vanilla sugar (or 1 tsp vanilla extract)",
    "5 eggs (divided)",
    "6 oz (175 g) good chocolate* 50-60% cocoa",
    "1 3/4 (100 g) finely ground walnuts",
    "1 1/4 cups (300 ml) milk",
    "5 tbsp flour",
    "10 1/2 tbsp (150 g) unsalted butter (room temperature)",
    "3/4 cup (150 g) sugar",
    "2 packs vanilla sugar (or 1 tbsp vanilla extract)",
    "1 tbsp confectioners sugar (for dusting)"
  ],
  "__v": 1
}