{
  "hash": "5c9ebaec17e857c03d18eaad52a96c7e40287b26",
  "title": "Vegan Tofu 'Scallops'",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2013/11/vegan-scallops-tofu-1071x800.jpg",
  "href": "http://www.onegreenplanet.org/plant-based-recipes/vegan-tofu-scallops/",
  "extension": "Chrome",
  "firstAdded": "2015-05-01T12:17:21.329000",
  "users": [
    null
  ],
  "keywords": [
    "block",
    "extrafirm",
    "tofu",
    "pressed",
    "choose",
    "organicnongmo",
    "tbs",
    "glutenfree",
    "tamari",
    "broth",
    "kosher",
    "salt",
    "kelp",
    "old",
    "bay",
    "seasoning",
    "oil",
    "vegan",
    "butter",
    "lemon",
    "slices"
  ],
  "directions": [
    "0",
    "Cut the block of tofu in half and then cut each half in two width-wise. You should have 4 thin rectangles. I used a75 inch-biscuit cutter to press 2 circles out of each rectangle of tofu. If you don’t have a biscuit cutter, you can use a cookie cutter or even the top of a can of cooking spray. Save the leftover tofu pieces for a stir-fry. Using a paring knife, cut a shallow X in the top and bottom of each scallop.",
    "Combine the tamari and the broth in a shallow bowl. Marinate the scallops for at least 30 minutes. Remove them from the marinade and pat the scallops dry with a paper towel. If they are wet, they will not sear in the pan. Sprinkle the scallops with a bit of salt, kelp flakes and Old Bay Seasoning on both sides.",
    "Heat a large skillet over medium-high heat. Add the vegetable oil and the butter to the pan. When the butter melts, carefully place each scallop in the pan. Don’t overcrowd the pan; if your pan can’t hold all 8 scallops comfortably, cook them in 2 batches. Once you put the scallop down, don’t move it. Don’t touch it. Let it form a sear. You should be able to see the bottom of the scallop browning.",
    "After about 2 minutes, carefully flip the scallops over and cook on the other side. While the 2nd side is cooking, tilt the pan and use a large spoon to baste the tops of the scallops with the butter and oil. This will keep them from drying out. You should see the sides of the scallops turning brown like pretty rings. Remove from the pan with a slotted spoon and place on a paper towel to drain before serving. Serve with lemon slices."
  ],
  "ingredients": [
    "0",
    "1 block extra-firm tofu, pressed and drained (choose organic/non-GMO)",
    "2 Tbs. gluten-free tamari",
    "2 Tbs. vegetable broth",
    "Kosher salt",
    "Kelp flakes",
    "Old Bay Seasoning",
    "2 Tbs. vegetable oil",
    "2 Tbs. vegan butter",
    "Lemon slices"
  ],
  "__v": 1
}