{
  "hash": "85f66b49eb494a455c3e49ccdd14b49a81c9f50f",
  "title": "Fluffy Naan Bread",
  "image": "http://ukcdn.ar-cdn.com/recipes/xlarge/52695fd7-9248-410d-b930-048a816a3cb2.jpg",
  "href": "http://allrecipes.co.uk/recipe/16225/fluffy-naan-bread.aspx",
  "firstAdded": "2015-02-07T10:01:53.511000",
  "users": [
    null
  ],
  "keywords": [
    "hand",
    "hot",
    "water",
    "caster",
    "sugar",
    "active",
    "yeast",
    "plain",
    "flour",
    "salt",
    "butter",
    "divided",
    "natural",
    "yoghurt",
    "coriander",
    "leaves"
  ],
  "directions": [
    "0",
    "In a large bowl, stir together the water, yeast and sugar. Allow to stand for 5-10 minutes or until frothy.",
    "Add the flour, salt, half of the butter and yoghurt. With a blunt knife, stir the mixture into a shaggy mess, then knead by hand until the dough is smooth and elastic, 3-5 minutes.",
    "Cover the bowl with cling film and sit in a warm spot for 45-60 minutes or until double its size. Alternatively, you can place the bowl into the refrigerator for an overnight cold prove. If allowing for an overnight prove, remember to allow the dough to sit at room temperature for 1 hour before proceeding onto the next step.",
    "Punch the dough down and knead gently. Divide into 2-3 equal sized balls. Roll each ball into a naan shape (tear shaped), making them relatively thin.",
    "Brush a large frying pan with oil and wipe with a kitchen towel. Heat to a medium heat and place the dough onto it, wait until the naan bread unevenly puffs up, about 3-4 minutes. Brush some melted butter on 5-6 random spots before turning it over to cook for a further 2-3 minutes or until the spots are browned",
    "Transfer to a clean tea towel and keep it warmed. Serve hot, brushed with melted butter (if desired) and sprinkled with coriander leaves. Enjoy!"
  ],
  "ingredients": [
    "0",
    "80ml hand hot water",
    "1 teaspoon caster sugar",
    "1 teaspoon dried active yeast",
    "125g plain flour",
    "1 pinch salt",
    "2 tablespoons melted butter, divided",
    "1 tablespoon plain natural yoghurt",
    "coriander leaves, chopped for garnish"
  ],
  "__v": 1
}