{
  "hash": "50f087407969d030b94ed9ddae2d701811786321",
  "title": "Caramel & Vanilla Cheesecake with Fresh Berries | Vegan, Gluten-Free & Paleo",
  "image": "http://blissfulbasil.com/wp-content/uploads/2014/05/07-DSC_2315.jpg",
  "href": "http://blissfulbasil.com/2014/05/19/caramel-vanilla-cheesecake-with-fresh-berries-vegan-gluten-free-paleo/",
  "extension": "Chrome",
  "firstAdded": "2016-01-08T19:47:56.490000",
  "users": [
    null
  ],
  "keywords": [
    "medjool",
    "dates",
    "raw",
    "almonds",
    "soaked",
    "cashews",
    "coconut",
    "butter",
    "fullfat",
    "milk",
    "vanilla",
    "bean",
    "scraped",
    "almond",
    "maple",
    "syrup",
    "oil",
    "salt",
    "blueberries",
    "raspberries",
    "blackberries",
    "pepitas"
  ],
  "directions": [
    "0",
    "Add the dates and raw almonds to a food processor. Process for 2-3 minutes until the crust begins to roll into a large ball.",
    "Line the bottom of a 5-inch springform pan with parchment paper and grease sides with coconut oil. Scoop the date and almond mixture into the pan and press down with fingers. If the mixture is sticking to your hands, dip your fingertips in water to repel the dates. Pop in the freezer for 15 minutes or more to set.",
    "1",
    "While the crust is setting, make the vanilla cheesecake layer by adding the soaked cashews, dates, coconut butter, coconut milk, and the vanilla bean flecks to a food processor. Process for 4-5 minutes, stopping to scrape the mixture down the sides as frequently as needed. Tip: if your dates aren't wet and soft, soak them in water for 30 minutes or more prior to making this layer.",
    "Remove the springform pan from the freezer, and pour the \"cheesecake\" mixture on top of the crust. Spread evenly with the back of a spoon. Pop in the freezer for 30 minutes to set the cheesecake layer.",
    "2",
    "Add the almond butter, maple syrup, coconut oil, vanilla extract, and sea salt to a sauce pan over medium-low heat. Whisk together for 3 minutes or until all ingredients melt together. Turn off the heat and let it cool until the cheesecake layer has set.",
    "Fill the remainder of the springform pan with the caramel layer and return to freezer for 25-30 minutes to set.",
    "Remove the cheesecake from the springform pan and place on a plate. Top the cheesecake with more caramel, if desired. Decorate the cheesecake with the berries and pepitas. Slice and serve.",
    "Refrigerate leftovers."
  ],
  "ingredients": [
    "0",
    "⅓ cup packed and pitted medjool dates",
    "⅓ cup raw almonds",
    "1",
    "¼ cup soaked raw cashews",
    "¼ cup packed and pitted medjool dates",
    "¼ cup coconut butter",
    "½ cup full-fat coconut milk",
    "1 vanilla bean, scraped",
    "2",
    "½ cup raw almond butter",
    "½ cup pure maple syrup",
    "⅓ cup coconut oil",
    "2 teaspoons vanilla extract",
    "¼ teaspoon sea salt",
    "3",
    "¼ cup blueberries",
    "¼ cup raspberries",
    "¼ cup blackberries",
    "pepitas"
  ],
  "__v": 1
}