{
  "hash": "a5723773ca56cd82dd7ffaf3fb57918fe6967c5a",
  "title": "Oven-Braised Chicken Stew, Hungarian-Style",
  "image": "https://images.food52.com/WxshD9fjgHQukEWG5ROucr82CK0=/753x502/0a3fbc23-78a5-494b-b0c4-ad0f65b07b0b--2014-0225_CP_oven-braised-chicken-stew-hungarian-style-049.jpg",
  "href": "https://food52.com/recipes/25921-oven-braised-chicken-stew-hungarian-style",
  "extension": "Chrome",
  "firstAdded": "2018-01-31T02:02:24.739000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat oven to 325° F. Season the chicken thighs on both sides with salt and pepper. Heat fat in a large, oven-safe sauté pan or Dutch oven. Brown the thighs in batches, about five minutes per side. Remove chicken to a plate and cover with foil to keep warm.",
    "Discard all but 2 tablespoons of fat from the pan, lower the heat slightly, and add the onions. Sauté until tender and translucent and starting to brown. Add the mushrooms and cook a few minutes more, until they begin to brown as well. Add the garlic and sauté until fragrant, about 30 seconds, then add the paprika (all three), the porcini powder, and the rest of the herbs and spices. Cook, stirring, about a minute, being careful not to let the paprika scorch. Deglaze with wine, stirring to scrape up any browned bits, and cook until mostly evaporated. Add tomatoes and broth and bring to a boil, then lower the heat to a simmer. Return the chicken to the pan, nestling the thighs skin-side up in the sauce, and scatter the peppers over everything. Cover, place in the oven, and cook for 1 1/2 hours, or until the chicken is falling-off-the-bone tender.",
    "Remove the pan from the oven. Remove the chicken to a plate and allow to sit until cool enough to handle. Meanwhile, return the pan to the oven, uncovered, and let the sauce cook down for another half hour while the chicken rests. (Alternatively, you can do this over a low flame on the stovetop.)",
    "When the chicken is cool enough to handle, remove and discard the skin, bones, and gristle. Roughly shred the meat by hand, return to the sauce, and heat through. Season to taste with salt and freshly ground pepper. If using sour cream, put it in a heat-proof bowl, mix in the flour, and then stir in some of the sauce, a few spoonfuls at a time, to temper the cream. Then pour the cream mixture back into the pan, stir to incorporate, and gently heat through, long enough to cook off any raw flour taste and thicken the stew slightly, but taking care not to let it boil. Serve stew over noodles, spaetzle, or root vegetable purée, or just eat as is, garnished with some chopped fresh parsley and a sprinkle of sweet paprika, with a nice loaf of freshly baked, crusty rye bread."
  ],
  "ingredients": [
    "0",
    "8 bone-in, skin-on chicken thighs (3 to 4 pounds)",
    "2 tablespoons fat (lard, or a neutral oil such as sunflower, canola, or vegetable)",
    "1 large yellow onion, chopped",
    "1/2 pound cremini mushrooms, chopped",
    "4 large garlic cloves, minced (remove and discard any green shoots)",
    "1 heaping tablespoons sweet Hungarian paprika",
    "1/2 teaspoon hot or half-sharp paprika",
    "1/4 teaspoon sweet smoked paprika",
    "1 teaspoon porcini (or other wild mushroom) powder, or more/less to taste (grind dry mushrooms in a clean coffee or spice grinder; grind a whole package and store the remainder in jar)",
    "1/4 teaspoon each caraway seed, fennel seed, dried rosemary, dried thyme, and dried marjoram, ground together",
    "1/4 cup flat-leaf parsley, finely chopped, plus extra for garnish",
    "1/2 cup dry white wine",
    "One 15-ounce can stewed tomatoes",
    "2 cups chicken broth",
    "Salt and freshly ground black pepper, to taste",
    "1/2 pound Hungarian wax, banana, or cubanelle peppers, seeds and ribs removed, chopped",
    "1/2 cup sour cream (optional)",
    "1/2 tablespoon flour (optional)"
  ],
  "__v": 1
}