{
  "hash": "f61be1bea10aebcd73cb194a2fce1fcc1eb71d5c",
  "title": "Korean Pineapple Pork Lettuce Wraps",
  "image": "http://www.halfbakedharvest.com/wp-content/uploads/2016/03/Korean-Pineapple-Pork-Lettuce-Wraps.-7.jpg",
  "href": "http://www.halfbakedharvest.com/korean-pineapple-pork-lettuce-wraps/",
  "extension": "Chrome",
  "firstAdded": "2016-05-16T17:54:59.925000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place the pork in a roasting pan/dutch oven and rub all over with the salt and brown sugar. Let the pork sit for 15-20 minutes.",
    "Preheat the oven to 325 degrees F.(*crockpot version in the notes)",
    "In a bowl, whisk together the soy sauce, rice wine vinegar, ginger, diced pineapple and green onions. Remove a 1/3 cup of the marinade and set aside for later. Now add 2 cups of water to the marinade. Pour the marinade over the pork. Cover the pork tightly with foil or the dutch oven lid. Roast for 3-4 hours or until the pork shreds easily. Towards the end of cooking, check the pork and make sure the sauce is not getting too low. If the sauce is thickening too much, add water to keep the pork moist. You want the pork submerged in liquid at least 1/3 a way up the pot.",
    "Meanwhile, add the pineapple slices to a baking sheet and sprinkle with 2 tablespoons brown sugar. Pour the reserved 1/3 cup marinade over the pineapple. Once you've removed the pork from the oven, add the pineapple and increase the heat to 425 degrees F. Roast the pineapple until it is golden and caramelized, about 8-10 minutes. Watch closely as the pineapple can burn fast.",
    "Remove the pork from the pot and pour the sauce left in the pot into a heat safe bowl. Stick the bowl in the freezer for 5-10 minutes and then remove it and skimp any fat off the top of the sauce. Reserve the sauce for serving. Shred the pork.",
    "To assemble the warps, divide the pork among the lettuce and top with caramelized pineapple slices. Add shredded carrots, cucumbers, green onions and sesame seeds. Drizzle with the spicy sauce (recipe below) and serve with steamed rice. EAT!",
    "!Spicy Sauce",
    "Combine all the ingredients in a bowl and whisk until combined and smooth."
  ],
  "ingredients": [
    "0",
    "3-4 pounds Smithfield Boneless Netted Fresh Pork Shoulder",
    "2 teaspoons salt",
    "1/2 cup brown sugar",
    "1 cup soy sauce",
    "1/4 cup rice wine vinegar",
    "2 tablespoons fresh grated ginger",
    "1/4 cup finely diced pineapple",
    "2 tablespoons sriracha",
    "4 green onions, chopped",
    "2 cups water",
    "1/2 a pineapple, cored + cut in half moons",
    "2 tablespoons brown sugar",
    "1-2 heads butter lettuce",
    "shredded carrots + sliced cucumbers",
    "greens onions + fresno chiles, sliced",
    "sliced limes + sesame seeds",
    "steamed coconut rice or regular rice",
    "1/4 cup sesame oil",
    "1 tablespoon gochujang (korean chile paste) or sriracha"
  ],
  "__v": 1
}