{
  "hash": "b48da938264125b597393571f522099e1ea1e151",
  "title": "IRISH CAR BOMB CAKE",
  "image": "",
  "href": "http://cake.betterrecipes.com/irish-car-bomb-cake.html",
  "extension": "Chrome",
  "firstAdded": "2016-03-26T15:37:32.513000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "butter",
    "guinness",
    "dutch",
    "cocoa",
    "dark",
    "chocolate",
    "cayenne",
    "kosher",
    "salt",
    "flour",
    "granulated",
    "sugar",
    "baking",
    "soda",
    "eggs",
    "separated",
    "sour",
    "cream",
    "irish",
    "creme",
    "milk",
    "baileys"
  ],
  "directions": [
    "0",
    "Pans:",
    "Butter the bottom of 2 8-inch pans",
    "Cut rounds of parchment to line the bottom of the pans, then butter the parchment and sides.",
    "Spinkle natural cocoa powder and coat the pan with a fine layer.",
    "Set aside.",
    "Guinness Cake:",
    "In a heavy saucepan melt the Butter with the Guinness, Dutched Cocoa and 2 oz 55% dark Chocolate until smooth.",
    "Remove from heat, stir in the Cayenne and Salt, then set aside to cool.",
    "Whisk the Flour, Sugar and Baking Soda together in a large bowl.",
    "Add the cooled Guinness/Butter/Cocoa mixture beating at medium speed until well combined.",
    "Add the Egg yolks & Sour Cream and beat 2 minutes more.",
    "In a separate bowl, beat the egg whites with a pinch of salt until stiff peaks form.",
    "Fold egg whites into batter.",
    "Divide batter between the 2 prepared pans",
    "Bake for 35 to 40 minutes or until a toothpick comes out clean.",
    "Cool in the pan for 15 minutes, before turning out onto a Cooling rack.",
    "Peel parchment from the bottom and cool completely before frosting with........",
    "Bailey's Ermine Frosting:",
    "whisk together Milk, Bailey's and Flour until \"dissolved\".",
    "Set over medium-low flame, whisking constantly, until thickened like pastry cream.",
    "Remove from the flame and Whisk in a pinch of salt.",
    "Pour into another bowl to stop the cooking and cover on the surface with plastic wrap to prevent a \"crust\" from forming or the frosting will be lumpy.",
    "Meanwhile, beat the Butter and Sugar together until light and fluffy.",
    "Once the Custard is no longer hot, but merely warm.",
    "Turn the mixer to medium and begin adding the custard 1 TB at a time, waiting until completely incorporated before adding the next.",
    "Once all the custard has been added, turn the mixer to Medium-High and beat until light and fluffy (You should here the same \"slapping\" sound in the mixing bowl that occures when making Meringue based ButterCreme)",
    "Times below include only the cake baking portion. as cooling times for the custard will vary"
  ],
  "ingredients": [
    "0",
    "1 cup\tUnsalted Butter",
    "1 cup\tGuinness",
    "⅔ cup\tDutch Cocoa Powder",
    "2 oz\t55-65% Dark Chocolate",
    "Pinch of Cayenne",
    "1 tsp\tKosher Salt",
    "2 cups\tAp Flour",
    "2 cups\tGranulated Sugar",
    "1¼ tsp\tBaking Soda",
    "2\tLarge Eggs; Separated",
    "½ cup\tSour Cream",
    "Irish Butter Creme:",
    "⅔ cup\tWhole Milk",
    "½ cup\tBailey's Irish Cream",
    "3 tb\tPlus 2 Tsp Ap Flour",
    "Pinch of Kosher Salt",
    "1 cup\tUnsalted Butter",
    "¾ cup\tPlus 1 Tb Granulated Sugar"
  ],
  "__v": 1
}