{
  "hash": "d19b6e8b1eb0a8e94277c26329429ce3a1690d9e",
  "title": "Sichuan-Style Chicken With Rice Noodles",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/sichuan-style-chicken-rice-noodles",
  "extension": "Chrome",
  "firstAdded": "2017-02-03T14:08:28.813000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cut 1 bunch scallions into 1\" pieces; thinly slice remaining bunch of scallions and set aside. Bring 12 cups water to a brisk simmer in a large stockpot and add scallion pieces, kombu, ginger, star anise, Sichuan peppercorns, ¼ cup soy sauce, and 1 Tbsp. salt; cook until kombu is softened, 10–15 minutes.",
    "Add chicken to pot and reduce heat so liquid is at a very gentle simmer. Poach chicken, uncovered, until cooked through and an instant-read thermometer inserted into the thickest part of breast registers 160°, 40–45 minutes. Transfer chicken to a plate and let cool.",
    "Meanwhile, increase heat to medium-high and bring poaching liquid to a boil; cook until reduced by half, 30–45 minutes. Fish out scallions, ginger, and star anise from pot with a slotted spoon and discard. Add noodles to poaching liquid and cook according to package instructions. Drain and toss in a large bowl with 1 tsp. sesame oil.",
    "Combine kale, sugar, a pinch of salt, and remaining 1 tsp. sesame oil in a medium bowl and massage kale, rubbing between your fingers, until softened and shiny, about 30 seconds. Add vinegar, rice noodles, reserved sliced scallions, 1 Tbsp. furikake, and remaining 2 Tbsp. soy sauce and toss to combine; season with salt.",
    "Remove skin and bones from chicken; discard. Slice or shred meat. Serve with noodles, drizzled with chili oil and sprinkled with more furikake."
  ],
  "ingredients": [
    "0",
    "Sichuan-Style Chicken With Rice Noodles",
    "You’ll find many of the ingredients for this chicken and noodles recipe in the Asian section of your supermarket or health food store. Stock up: We promise you’ll be making this well into fall.",
    "Ingredients",
    "4 SERVINGS",
    "1½ bunches scallions, divided",
    "1 8-inch piece dried kombu",
    "1 2-inch piece ginger, peeled, thinly sliced",
    "3 star anise pods",
    "1 tablespoon Sichuan peppercorns",
    "¼ cup plus 2 tablespoons soy sauce",
    "1 tablespoon kosher salt, plus more",
    "1 3½–4-pound chicken",
    "8 ounces dried thin rice noodles (not vermicelli)",
    "2 teaspoons toasted sesame oil, divided",
    "½ bunch Tuscan kale, tough stems removed, leaves very thinly sliced (about 3 cups)",
    "Pinch of sugar",
    "2 tablespoons unseasoned rice vinegar",
    "1 tablespoon furikake seasoning, plus more for serving",
    "Chili oil (for serving)",
    "Ingredient Info",
    "Furikake, a dried blend of seaweed, sesame seeds, fish flakes, salt, and other seasonings, can be found at Asian markets, some supermarkets, and online."
  ],
  "__v": 1
}