{
  "hash": "f906fd6486a1cd53fa76ade3a2bc1c17502deb8f",
  "title": "Lebanese Fish with Herby Tahini Sauce Over Rice",
  "image": "https://images.food52.com/xLvaQ2itQ8H7pLpzkvp008MjEVA=/753x502/10deeb11-b999-4e9f-9eff-a0e8b079f236--2016-0913_fish-with-tahini-and-caramelized-onions_alpha-smoot_468.jpg",
  "href": "https://food52.com/recipes/62885-lebanese-fish-with-herby-tahini-sauce-over-rice",
  "extension": "Chrome",
  "firstAdded": "2018-01-02T17:07:25.356000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "If you are not using cilantro to garnish the finished dish, then reserve a few sprigs of parsley to instead. Pulse the parsley and garlic together in a food processor and then add the tahini. Blend the garlic, parsley, and tahini well. Add the lemon juice and blend again, the tahini will seize up and become thick. Add a pinch of salt and begin to drizzle water in while the processor is running until the sauce thins out to a pourable consistency. Taste and adjust for salt and lemon juice. Add more of each if needed",
    "Preheat the oven to as hot as it will go, 450 to 500° F. Clarify 4 tablespoons of butter by melting it gently and then removing the foam and reserving the pure fat. To a hot sauté pan, add the olive oil and onion slices with a pinch of salt. Stir quickly and cook over high heat until the onions are brown and caramelized. Drain and reserve. Fry the pine nuts in the clarified butter until they are golden. Drain and reserve. Set a pot of water on to boil and salt. When the water comes to a boil cook the rice in the water for 10 minutes, then drain.",
    "1",
    "While the rice is cooking in the water, rub the flesh of the fish with the olive oil, season it with salt and pepper, and bake in the hot oven. When the rice is cooked and drained, toss it with two tablespoons of butter, the onions, and the pine nuts, reserving a few pine nuts and onions to garnish the fish with.",
    "Place the rice on a platter and top with the fish. Pour about 1/4 to 1/2 cup of tahini over the fish and pass the rest tableside because people will want more. Garnish with some sprigs of cilantro, the reserved onions and the pine nuts, and place the lime slices around the edge of the plate. Serve warm or room temperature"
  ],
  "ingredients": [
    "0",
    "1 to 2 cloves garlic (if you really like the garlic the way I do, add another clove)",
    "1 bunch flat-leaf parsley",
    "3/4 cup tahini",
    "1/3 cup freshly squeezed lemon juice",
    "1/4 to 3/4 cups water (the water is extremely variable, depending on the brand of tahini and is used to thin the sauce out to a thick creamy consistency)",
    "Salt",
    "1 cup basmati rice",
    "4 tablespoons unsalted butter",
    "2 tablespoons extra-virgin olive oil",
    "1 large yellow onion, peeled and sliced into 1/4-inch rings",
    "1/2 cup pine nuts",
    "1",
    "2 pounds fish filet (firm, white-fleshed fish like halibut or hake recommended)",
    "2 tablespoons olive oil",
    "Salt and pepper, for seasoning",
    "2 tablespoons butter",
    "2 limes, quartered",
    "1/2 bunch cilantro or parsley, for optional garnish"
  ],
  "__v": 1
}