{
  "hash": "940f1c3a847549b5074f2d35612cefe1a784f78c",
  "title": "Peach Pies in a Jar",
  "image": "http://www.tablespoon.com/-/media/Images/Articles/qd/2011/07/2011-08-04-peach-pie-in-a-jar-586x322.jpg",
  "href": "http://www.tablespoon.com/recipes/peach-pies-in-a-jar/f387c558-fec3-4e33-81ca-ba251b68689f",
  "extension": "Firefox",
  "firstAdded": "2015-04-09T15:13:06.284000",
  "users": [
    null
  ],
  "keywords": [
    "box",
    "pillsbury",
    "refrigerated",
    "pie",
    "crusts",
    "mushy",
    "peaches",
    "sugar",
    "lemon",
    "juice",
    "salt",
    "vanilla",
    "nutmeg",
    "cornstarch",
    "instant",
    "tapioca",
    "pies",
    "turbinado",
    "raw",
    "works",
    "toppings",
    "desired",
    "widemouth",
    "canning",
    "jars"
  ],
  "directions": [
    "0",
    "Preheat oven to 400 degrees. Allow pie crusts to sit at room temperature 10 minutes before using. Meanwhile, clean and dry the jars. Unroll the first crust on a cutting board and cut into quarters. Fit one quarter into each of the jars, pressing crust to fit up sides and along bottom of each jar.",
    "In a large bowl, combine peach slices, sugar, lemon juice, salt, vanilla, cornstarch and nutmeg (optional). Let sit 5 to 10 minutes until peaches are juicy.",
    "Meanwhile, cut 4 circles from the second crust, each approximately the same size as the mouth of the jars. Cut each circle into strips.",
    "Using your fingers, place peach slices into the jars, layering to fit as many as possible in each. Spoon a Tbsp of the liquid from the bowl over the peaches in each jar.",
    "Using the lattice pie crust technique (weaving basket-style), add strips to top of pies. Gently wet the strips and sprinkle with sugar.",
    "Place jar-pies on a baking sheet and place in preheated 400 degree oven. Bake for 20 minutes, then reduce heat to 350 and bake and additional 10 to 15 minutes. Remove pies to a cooling rack and cool completely before serving.",
    "Topping suggestions: Whipped cream dusted with nutmeg or cinnamon, cinnamon ice cream, vanilla bean ice cream, peach syrup, or mashed berries.",
    "Note: The canning-jar covers can be used to transport these pies to a picnic or potluck!"
  ],
  "ingredients": [
    "0",
    "1 box Pillsbury refrigerated pie crusts (2 crusts)",
    "4 large, ripe (but not mushy) peaches, peeled, pitted and sliced",
    "1/4 cup sugar",
    "1 tablespoon lemon juice",
    "1/4 teaspoon salt",
    "1/2 teaspoon vanilla",
    "1/4 teaspoon nutmeg (optional)",
    "1 tablespoon cornstarch (or ground instant tapioca)",
    "for sugar top of pies (turbinado, or raw sugar, works well for this)",
    "as toppings desired",
    "4 (4 oz.) wide-mouth canning jars"
  ],
  "__v": 1
}