{
  "hash": "03e67f57b0b09276d2900cefe233c876228169f5",
  "title": "4th of July “Fireworks” Bundt Cake by Tiffany Kent",
  "image": "",
  "href": "http://katu.com/amnw/am-northwest-cooking-recipes/4th-of-july-fireworks-bundt-cake",
  "extension": "Chrome",
  "firstAdded": "2018-07-05T01:22:07.687000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350° F.",
    "Spray a bundt pan with your preferred nonstick spray and set aside.",
    "To make frosting: combine ingredients from Buttercream Frosting recipe. Start by combining butter or shortening, powdered sugar, and clear vanilla extract and beat with an electric mixer. Add in warm milk until you’ve reached a desirable consistency and powdered sugar is thoroughly mixed in. Mix and set aside. (You may need to add more milk when getting ready to use the frosting later.) If you want to do frosting in red, white, and blue, you'll want to separate frosting into three equal parts and add red and blue dye to two parts, leaving one white. Then, set aside.",
    "Make the Cake Colors: Mix up the cake mix using the ingredients above. Then, separate the batter into three equal parts in three respective bowls. Using red dye, turn one bowl of batter red. Do the same with the blue dye. Leave one bowl white. (I used about 5-6 drops of regular food dye, or a bit less if you're using gel food dye. As a rule of thumb, the cake will lighten some as it bakes--so you'll want your batter very vibrant.)",
    "Pour the white batter first into the prepared Bundt pan. Make sure to do an even pour. Then, pour the red batter over. Finish with the blue batter. Try to keep the batter even as you pour and reduce splatter. Bake 35-40 minutes, or until a toothpick inserted comes out clean.",
    "7. Let the Bundt pans cool for at least a half hour. Then, carefully remove the Bundt pan and place onto a cutting board. Using a very sharp knife, remove the uneven \"top\" portion to create a flat surface, then place (cut side facing down) onto a cake stand or plate.",
    "8. Warm icing in the microwave for 10-15 seconds, then carefully drizzle over Bundt cake. (It does not have to be perfect to be beautiful!) Start slow. Add additional sprinkles if you prefer!",
    "9. Chill the cake in the refrigerator. Then, wait for guests to arrive. Cut into the cake and reveal the fun colors--red, white, and blue! Try not to eat it all in one sitting. Enjoy! Happy 4th of July!"
  ],
  "ingredients": [
    "0",
    "GF White Cake Recipe—you will need to double this recipe! (If you're in a hurry, you can use a box of white cake mix.)",
    "•\t1 Bundt pan",
    "•\tNonstick spray",
    "•\t1 cup white sugar",
    "•\t1 ½ cups Bob’s Red Mill 1:1 GF flour (blue and clear package)",
    "•\t½ cup grass-fed butter, melted",
    "•\t1 ¾ teaspoons baking powder",
    "•\t2 eggs + 1 egg white",
    "•\t½ cup milk",
    "•\t2 teaspoons clear vanilla extract",
    "Additional cake requirements:",
    "•\tRed food dye (either drop, or try gel dye for vibrant color)",
    "•\tBlue food dye (either drop, or try gel dye for vibrant color)",
    "Buttercream Frosting recipe:",
    "•\t1 cup unsalted grass-fed butter, softened - for PURE white frosting, substitute Spectrum Organic All Vegetable Shortening",
    "•\t6 cups powdered sugar",
    "•\t2 teaspoons clear vanilla extract",
    "•\t6-8 Tbsp. warm milk (or more, until you reach desired consistency)"
  ],
  "__v": 1
}