{
  "__v": 1,
  "directions": [
    "0",
    "Go ahead: You can make the spice rub at home! Apply it to the salmon beforehand and transport the fish in a large plastic bag or travel container. To make the spice rub, mix together the paprika, chipotle, cumin, sea salt and pepper in small bowl. Rub generously over both sides of the salmon. This can be made up to one day ahead. It will save a lot of cooking mess at the campsite!",
    "Ideally, the salmon should cook over a hot fire whose flame is starting to die down, so that you don't char the fish. If using charcoal briquets, follow the same instruction. In a pan, cook the fillet over medium heat.",
    "While you're waiting for your coals to be ready, prepare the salsa. Combine the cherry tomatoes with the diced onion, cilantro, jalapeño, lime juice and sea salt. Mix thoroughly to combine and set aside until ready to use.",
    "When the fire is ready, cook the salmon for about 4-5 minutes per side, being careful to not disturb the salmon while it cooks. Depending on the thickness of the fillet, it may need slightly more or less time. Be mindful of this when cooking, and adjust cooking time accordingly. I like my salmon to be a little bit pink in the middle, and the above cooking times will yield just that.",
    "Let the salmon rest for about five minutes before serving.",
    "While the salmon rests, warm your corn tortillas in aluminum foil over the fire.",
    "To serve, flake the salmon with a fork. Build the taco by layering salmon, cabbage, salsa and cheese. Serve with lime and cilantro on the side."
  ],
  "firstAdded": "2014-06-18T16:16:13.713000",
  "hash": "001b5895487f3470b15700059432c47cc011e20f",
  "href": "http://alitedesigns.com/field-notes/campfire-recipe-salmon-tacos",
  "image": "http://alitedesigns.com/uploads/field_notes/Tacos_horiz_3.jpg",
  "ingredients": [
    "0",
    "For the salmon:",
    "1 pound wild Alaskan salmon fillets",
    "1 tablespoon paprika",
    "2 teaspoons chipotle chile powder",
    "1 teaspoon cumin",
    "1 teaspoon sea salt",
    "1 teaspoon ground pepper",
    "For the salsa:",
    "2 cups cherry or grape tomatoes, halved",
    "1/4 small red onion, diced",
    "1/4 cup fresh cilantro, chopped",
    "1/2 small jalapeño, finely diced (use the whole chile if you prefer more heat)",
    "Juice of 1 lime",
    "1/2 teaspoon sea salt",
    "Corn tortillas for serving",
    "Garnish:",
    "Finely sliced purple cabbage",
    "Cotija or Feta cheese, crumbled",
    "Lime slices",
    "Cilantro"
  ],
  "keywords": [
    "salmon",
    "wild",
    "alaskan",
    "fillets",
    "paprika",
    "chipotle",
    "chile",
    "cumin",
    "salt",
    "pepper",
    "salsa",
    "cherry",
    "grape",
    "tomatoes",
    "red",
    "onion",
    "cilantro",
    "jalapeo",
    "use",
    "prefer",
    "heat",
    "juice",
    "lime",
    "corn",
    "tortillas",
    "purple",
    "cabbage",
    "cotija",
    "feta",
    "cheese",
    "crumbled",
    "slices"
  ],
  "title": "Grilled Salmon Tacos",
  "users": [
    null
  ]
}