{
  "hash": "2c48adf1c7141838721cfffe9a29daa70980430e",
  "title": "Chocolate Chip Cookies",
  "image": "https://www.washingtonpost.com/rf/image_982w/2010-2019/WashingtonPost/2017/11/30/Food/Images/fd-studio_028-001.JPG",
  "href": "https://www.washingtonpost.com/recipes/best-brown-butter-chocolate-chip-cookies/16188/?tid=a_inl&utm_term=.1a4ab0b818c4",
  "extension": "Firefox",
  "firstAdded": "2017-12-23T18:26:21.804000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Melt the chilled half of the butter in a medium skillet over medium heat, swirling it in the pan occasionally. It’ll foam and froth as it cooks, and start to crackle and pop. Once the crackling stops, keep a close eye on the melted butter, continuing to swirl the pan often. The butter will start to smell nutty, and brown bits will form in the bottom. Once the bits are amber brown (2 1/2 to 3 minutes or so after the sizzling stops), remove the butter from the heat and immediately pour it into a small bowl, bits and all. This will stop the butter from cooking and burning. Let cool for 20 minutes.",
    "Position racks in the upper and lower thirds of the oven; preheat to 350 degrees. Line several baking sheets with parchment paper.",
    "Combine the remaining 8 tablespoons of room-temperature butter and the brown sugar in the bowl of a stand mixer or use a handheld electric mixer; beat on medium speed for 3 to 5 minutes, until the mixture is very smooth (but not quite fluffy). Reduce the speed to medium-low; beat in the vanilla extract and molasses until well incorporated.",
    "Pour the cooled brown butter into the bowl, along with the granulated sugar. Beat for 2 minutes (medium-low), until smooth; the mixture will lighten in color and become fluffy.",
    "Reduce the speed to low; add the egg and egg yolk, beating for 1 minute, then stop to scrape down the bowl. Add the flour, kosher salt and baking soda; beat on low speed just until everything is incorporated. Use a spatula to fold in the chocolate chips and pecans and finish incorporating all of the dry flour bits into the dough.",
    "Scoop the dough in 2-tablespoon-size balls onto the prepared baking sheets, leaving about 2 inches between the balls. Use a light, two-fingered pinch to sprinkle each portion of dough with coarse or flaky sea salt.",
    "Bake (upper and lower racks) for 12 to 15 minutes until golden brown, rotating the baking sheets top to bottom and front to back halfway through. Let the cookies rest on the baking sheets for 5 minutes before transferring to a wire rack to cool.",
    "Repeat to use all the dough."
  ],
  "ingredients": [
    "0",
    "16 tablespoons (2 sticks) unsalted butter, half at room temperature",
    "1 cup packed light brown sugar",
    "2 teaspoons vanilla extract",
    "1 teaspoon molasses",
    "1/2 cup granulated sugar",
    "1 large egg, plus 1 large egg yolk",
    "2 1/4 cups flour",
    "1 teaspoon kosher salt",
    "1 teaspoon baking soda",
    "1 cup bittersweet chocolate chips",
    "1/2 cup coarsely chopped pecans",
    "Flaky or coarse sea salt, for sprinkling"
  ],
  "__v": 1
}