{
  "hash": "535f23aad1dddf661d605da11731f35361fb7bba",
  "title": "Roasted Beets with Balsamic Glaze",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2011/02/roasted-beets-balsamic-glaze-vertical-a-2000.jpg",
  "href": "https://www.simplyrecipes.com/recipes/roasted_beets_with_balsamic_glaze/",
  "extension": "",
  "firstAdded": "2018-01-27T23:26:13.371000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Preheat oven to 400°F and line pan with aluminum foil.",
    "2 Rub beets with olive oil, sprinkle with salt, place in pan, cover with foil: Place the beets in the pan. Rub olive oil over the beets, and sprinkle with salt. Cover the beets with another sheet of aluminum foil.",
    "3 Roast for 1 to 2 hours: Roast for 1 to 2 hours, depending on the size of the beets and how old they are. After 1 hour, test every fifteen minutes by poking a beet with the tines of a fork.",
    "Once the fork tines go in easily, the beets are tender and cooked. Remove from the oven.",
    "4 Prepare balsamic glaze: While the beets are cooling, prepare the balsamic glaze. In a small, shallow sauté pan, add the balsamic vinegar and sugar. Heat on high until the vinegar has reduced to a syrup consistency. Remove from heat.",
    "5 Peel and cut cooked beets: After the beets have cooled for several minutes, but are still warm to the touch, peel off the outer skins and discard. Cut the beets into quarters or more, bite-sized pieces.",
    "6 Pour glaze over beets: Place beets in a serving bowl. Pour balsamic glaze over the beets. Stir in grated orange zest, and add salt and pepper to taste.",
    "Garnish with a little orange zest to serve."
  ],
  "ingredients": [
    "0",
    "2 pounds red beets, medium sized, scrubbed clean, green tops removed (see beet greens recipe for what to do with beet greens)",
    "Olive oil",
    "Salt",
    "1/2 cup balsamic vinegar",
    "2 teaspoons sugar",
    "1 teaspoon grated orange zest",
    "Freshly ground black pepper"
  ],
  "__v": 1
}