{
  "hash": "23049a9dfb9cbe27e5594329acaeb77de538d24a",
  "title": "Paleo Breakfast Sausage Scotch Eggs",
  "image": "http://cdn.stupideasypaleo.com/wp-content/uploads/2013/11/Breakfast-Sausage-Scotch-Eggs-21.png",
  "href": "http://stupideasypaleo.com/2013/11/23/paleo-breakfast-sausage-scotch-eggs/",
  "extension": "Chrome",
  "firstAdded": "2015-06-21T20:25:45.315000",
  "users": [
    null
  ],
  "keywords": [
    "medium",
    "eggs",
    "lean",
    "pork",
    "gingerbread",
    "spice",
    "click",
    "recipe",
    "salt",
    "black",
    "pepper",
    "honey",
    "omit"
  ],
  "directions": [
    "0",
    "Start by cooking the eggs. I steam them instead of hard-boil because the shell comes *right* off. To do that, place a medium pot on the stovetop, and fit with a steamer basket. Add an inch of water to the pot, and bring the water to a boil. Place the eggs into the steamer basket, cover and steam for 10 minutes. Set up a medium bowl with ice and water. When the time is up, plunge the eggs right into the ice bath. Cool for at least 10 minutes and peel.",
    "Preheat the oven to 350°F (177°C). Line a baking sheet with parchment paper or foil.",
    "In a large bowl, combine the ground pork, gingerbread spice mix, salt, pepper and optional honey. Mix until combined but don't over mix; that'll make the meat tough. Now it's time to assemble the Scotch eggs.",
    "For each scotch egg: Fill a ⅓ cup measure with the seasoned ground pork and turn the lump into your hand. Flatten the pork into a wide circle like you're making a burger.",
    "Put the egg in the center. Carefully fold the meat circle up, gradually flattening as you go, until the egg is shrouded in meaty goodness. Make sure there are no cracks and that the meaty suit of armor is uniform.",
    "Place on the baking sheet. Bake for 15-20 minutes. Eat hot or cold."
  ],
  "ingredients": [
    "0",
    "6 medium eggs",
    "1 lb lean ground pork",
    "1 tbsp homemade gingerbread spice mix (click for recipe)",
    "1-1/2 tsp salt",
    "½ tsp black pepper",
    "1 tbsp honey (optional, omit for Whole30)"
  ],
  "__v": 1
}