{
  "hash": "667c67c7f4b949a027418321d392861f50cd2020",
  "title": "GREEN GOODNESS BOWL WITH PESTO STEELHEAD TROUT",
  "image": "https://www.eatingbirdfood.com/wp-content/uploads/2017/07/green-goodness-rice-bowl-4-300x300.jpg",
  "href": "https://www.eatingbirdfood.com/green-goodness-bowl-pesto-steelhead-trout/",
  "extension": "Chrome",
  "firstAdded": "2017-09-18T20:50:32.548000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Preheat oven to 400° F.",
    "Make pesto: add basil, garlic and pine nuts in a food processor. Process until finely minced. With the machine running slowly drizzle in the olive oil and process until the mixture is smooth. Add the cheese and process very briefly, just long enough to combine. Remove 3 teaspoons from food processor and set aside for later.",
    "Prep fish: add filets to a baking sheet and sprinkle with a little sea salt and fresh cracked pepper. Spread pesto sauce on top of each fillet. Bake prepared fillets in preheated oven for 12-15 minutes or until fish is cooked through and flakes easily with a fork.",
    "While fish is baking, prep grains and greens. Add 2 packages of Seeds of Change brown rice + quinoa blend to a large skillet with 3 teaspoons pesto and 1/4 cup water. Cook over medium heat for 2-3 minutes and then add fresh arugula, baby peas, dill and cilantro. Toss and heat until grain and peas are warm and arugula has wilted a bit.",
    "Prep 4 bowls: add a base of the grains and greens mixture to each bowl, top with cucumber, avocado and one fillet of baked fish. Add chopped pine nuts on top of each filet for garnish and sprinkle each bowl with spring onion, fresh dill, cilantro and cracked pepper. Serve immediately."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "Basil Pesto",
    "1 cup fresh basil leaves",
    "1 clove garlic",
    "2 Tablespoons pine nuts",
    "1/2 cup parmesan",
    "2 Tablespoons olive oil",
    "Bowls",
    "1 lb (4 fillets) wild-caught steelhead trout or salmon",
    "sea salt and ground pepper",
    "2 packages Seeds of Change Organic Quinoa and Brown Rice",
    "1/4 cup water",
    "3-4 big handfuls arugula",
    "2 Tablespoons chopped dill + more for garnish",
    "2 Tablespoons chopped cilantro + more for garnish",
    "2 cups baby peas (thawed if frozen)",
    "1/2 cucumber, thinly sliced",
    "1 avocado, sliced",
    "1/2 cup spring onions, chopped",
    "extra pine nuts (for garnish)"
  ],
  "__v": 1
}