{
  "hash": "63b25e8d05e4ab9149c425eb5b92530a2477c7d6",
  "title": "Peach-Almond Upside-Down Cake",
  "image": "http://target.scene7.com/is/image/Target/c_Peach-Almond-Upside-Down-Cake_RT?hei=340",
  "href": "http://www.cooking.com/recipes-and-more/recipes/peach-almond-upside-down-cake-recipe?CCAID=cknwfhne06185bh&s=s0085567335s&mid=2101020&rid=85567335",
  "extension": "Chrome",
  "firstAdded": "2015-03-26T19:56:52.940000",
  "users": [
    null
  ],
  "keywords": [
    "light",
    "brown",
    "sugar",
    "butter",
    "peaches",
    "cake",
    "allpurpose",
    "flour",
    "baking",
    "soda",
    "salt",
    "softened",
    "tube",
    "almond",
    "granulated",
    "eggs",
    "buttermilk",
    "almonds"
  ],
  "directions": [
    "0",
    "Preheat the oven to 350 degrees F.",
    "To make the topping, heat the butter in a small skillet over medium-low heat until the butter is melted. Pour the butter into a 9 x 2-inch round cake pan, swirling the pan to coat evenly. Sprinkle the brown sugar evenly over the butter. Arrange the peaches, overlapping slightly, over the sugar mixture.",
    "Whisk together the flour, baking powder, baking soda and salt in a medium bowl. With an electric mixer on medium speed, beat the butter and almond paste until well mixed. Add the granulated sugar and beat until smooth and creamy, about 2 minutes. Add the eggs and almond extract until blended. With the mixer on low speed, beat in the flour mixture in thirds alternating with the buttermilk, beginning and ending with the flour mixture.",
    "Spoon the batter over the peach mixture, spreading evenly.",
    "Bake until a toothpick inserted in the center comes out with a few moist crumbs attached, about 1 hour. Cover loosely with a tent of foil during the last 15 minutes of baking time to prevent overbrowning. Transfer to a rack and cool 5 minutes. Run a small knife around the edge of the pan to loosen the cake from the pan. Carefully invert onto a serving plate. Sprinkle with the toasted almonds. Serve warm or at room temperature."
  ],
  "ingredients": [
    "0",
    "Topping:",
    "2/3 cup packed light brown sugar",
    "1/4 cup (1/2 stick) butter",
    "2 cups sliced peaches",
    "Cake:",
    "1 1/2 cups all-purpose flour",
    "1 1/2 teaspoons baking powder",
    "1/4 teaspoon baking soda",
    "1/2 teaspoon salt",
    "1/2 cup (1 stick) softened butter",
    "One 7-ounce tube almond paste",
    "3/4 cup granulated sugar",
    "2 large eggs",
    "1/2 teaspoon almond extract",
    "1/2 cup buttermilk",
    "2 tablespoons sliced almonds, toasted"
  ],
  "__v": 1
}