{
  "hash": "51d11edead569df0f02501f0064780a6b25495ed",
  "title": "Maki Sushi",
  "image": "",
  "href": "http://www.menudomu.cz/maki-sushi/",
  "extension": "Chrome",
  "firstAdded": "2015-12-08T09:48:10.526000",
  "users": [
    null
  ],
  "keywords": [
    "ingredience",
    "avokdov",
    "lososov",
    "maki",
    "rolky",
    "sushi",
    "vody",
    "octa",
    "lika",
    "cukru",
    "liky",
    "soli",
    "pltky",
    "asy",
    "nori",
    "pokud",
    "plme",
    "wasabi",
    "prku",
    "tmav",
    "fialovho",
    "avokda",
    "dkg",
    "erstvho",
    "oitnho",
    "lososa",
    "nakldan",
    "zzvor",
    "sojov",
    "omka",
    "rolovac",
    "rohoka"
  ],
  "directions": [
    "0",
    "Sushi rýži je ideální připravovat v rýžovaru, který ale není běžnou součástí českých kuchyní. Plánem B je tedy postup uvedený ve videu. Vždy se musí důkladně propláchnout, dokud není odtékající voda čirá, trvá to i minutu nebo dvě. Pak ji nechte chvilku v sítku a po pár minutách propláchněte ještě znovu. Rýži pak vsypte do hrnce se studenou vodou (hrnec musí být včetně poklice z materiálu vhodného pro vložení do trouby), prudce přiveďte k varu a hned jak začne silně klokotat, už to všechno bez odklápění poklice rovnou přemisťujte do předem dobře vyhřáté trouby na 150-160°C. Po 17-20 minutách je hotovo. Pak ji nechte ještě přiklopenou chvilku někde odpočívat. Po 5-10 minutách odklopte. Ještě nechte chladnout. Ještě vlažnou ji přesypte do mísy (ideálně bambusové, aby rýže dýchala, nebo dřevěné, doporučuje se i hliněná, nicméně sklo ničemu také neublíží).",
    "Pak zalijeme osoleným a oslazeným Octem na sushi. Nejrůznější prameny uvádějí někdy celkem odlišné množství octa, které máme použít. Já jsem na hrnek syrové rýže použila 25ml octa. K tomu 1 lžičku cukru a půl lžičky soli. A s výsledkem jsem byla chuťově v rýži spokojena. Sůl a cukr se samotné v octu nerozpustí, proto je ideální směs ohřát a rozmíchat. Ohřát, ne vařit. A pak nechat chladnout. Rýži s octem dobře, ale opatrně smícháme. Nesmíme z ní udělat kaši.",
    "Už studené můžeme začít vrstvit na Řasu nori. Tu pokládáme na rolovací podložku vždy lesklou stranou dolů, hrubou nahoru. V začátcích, když si člověk není příliš jist, můžete používat na maki 2/3 velikosti řasy. Pak postačí polovina. Můžeme ji buď rozstřihnout nebo přeložit a roztrhnout. Řasu dejte až na kraj podložky. Rozmístěte na ni v tenké vrstvě malou hrst rýže. Výška rýžového sloupce určitě nesmí přesáhnout 0,5 cm. Doporučuju 3 mm. Všude by mělo být rýže stejně. I úplně na krajích. Jen 1-1,5 cm široký pruh nejdál od sebe na řase nechte bez rýže. K ruce si připravte misku s ledovou vodou a pár kapkami octa na sushi. Ponořte tam prsty vždy, když prsty budou kvůli lepivosti rýže vyhlašovat poplach.",
    "Křen wasabi má dvě základní podoby. Koupíte ho buď ve formě pasty a nebo prášku, který se pak cca 1:1 smíchá s vodou. Prášek je zpravidla kvalitnější. Sice nemá tak výraznou barvu, ale chuťově je lepší. Na porci pro 1 osobu bohatě stačí čajová lžička prášku. Ke konzumaci je hned po smíchání. Na špičku ukazováčku si dejte malé množství wasabi (menší než pecka od třesně) a přejeďte 2-3 cm od bližšího kraje, uděláte takový stín, čárku rovnoběžnou s okrajem řasy, která bude podkladem pod plnící suroviny.",
    "Náplně do maki sushi mohou být různé. V dnešní době se fantazii v sushi meze rozhodně nekladou. Lidi si spíš navymýšleli až příliš mnoho variant. Stálicemi jsou ale jednoznačně losos, tuňák a další syrové, leč opravdu čerstvé ryby určené i ke konzumaci za syrova, krevety, chobotnice, ale i žlutá ředkev, avokádo, mango, klasická okurka hadovka, houby shi-take… Leč se vám může zdát množství dané na rýži až až dostačující, po pořádném stažení do rolky si beztak řeknete, že jste mohli přidat. Ale to uvidíte, až budete mít první urolovanou. Náplň se každopádně dává spíše ve větším množství tenounkých plátků než v jednom kuse s průřezem 1×1 cm. Sushi se pak i lépe konzumuje. A jaké je správné množství? Řekněme prostředníček na ruce dospělé ženy s BMI kolem 21. :-D. Asi tak….",
    "Celé rolky se často radí ještě chvilku vychladit. Pak už stačí jen opravdu velmi ostrým nožem namočeným v té ledové vodě přeříznout na 6-8 stejných kousků.",
    "Nakládaný zázvor seženete v barvě zázvoru „přirozené“ a nebo růžový. Lepší je ten přírodní. Růžový je levnější, ale je to krabicák mezi víny. A chybět samozřejmě nesmí ani kvalitní Sojová omáčka. Kikkoman s červeným víčkem je klasika. Se zeleným má menší obsah soli, ale chutná jen jako 1:1 zředěný červený s vodou. Pokud chcete použít jinou sojovku, tak jedině té samé třídy a nebo lepší. To, co máte na krámě hned vedle Maggi do polévky se na sushi nedává zkrátka kvůli špatné chuti.",
    "Kde to všechno pořídit? Dnes existuje už dost e-shopů, kde bez problému poskládáte do jednoho nákupního košíku všechny potřebnosti, např. levnesushi.cz, susi.cz, degusto.cz, japafoods.cz s kamennou prodejnou na Praze 1 i Praze 6, koishi-shop.cz s kamennou prodejnou v Brně a další. Takzvané sushi sety mají někdy i v supermarketech. Jednotlivě seženete ingredience i v Makru.",
    "A za kolik? Záleží, kde nakupujete :) Všechny potřebnosti jsem viděla i v Tescu na Novém Smíchově v Praze, jen jsou tak o třetinu dražší než v e-shopech. Osobně jsem byla nakupovat v Japa Shopu v Bubenči. A na účtence bylo následující: 1kg rýže za 98 Kč, 360ml octa za 130 Kč, balení řas 10 ks za 45 Kč, wasabi pasta 50 Kč, wasabi prášek 30g za 80 Kč, sojovka Kikkoman 80 Kč, světlý zázvor 65 Kč, podložka na rolování 50 Kč. Lososa jsem kupovala v sashimi kvalitě v Makru, tuším kolem 600 Kč za kg. Avokádo jedině tmavě fialové, které je zralé. Když koupíte zelené, kupujete tvrdé a nezralé, bude vám v sushi křupat a zhořkne. Fialové má máslovou konzistenci, musí se s ním pracovat jemně. Na všechno kolem sushi potřebujete prostě ostrou kudlu.",
    "Z jednoho 250 ml hrnku syrové rýže připravíte tak 6 rolek, když počítáme nějaké malé ztráty. Vznikne tedy takové porce, jakou vidíte ve videu, třikrát."
  ],
  "ingredients": [
    "0",
    "Ingredience na 3 avokádové a 3 lososové maki rolky",
    "250 ml rýže na sushi",
    "375 ml vody na rýži",
    "25 ml octa na sushi",
    "1 lžička cukru",
    "1/2 lžičky soli",
    "3 plátky řasy nori (pokud ji půlíme)",
    "2-3 lžičky wasabi prášku",
    "2 lžičky vody do wasabi",
    "1/2 tmavě fialového avokáda",
    "9 dkg čerstvého očištěného lososa",
    "nakládaný zázvor",
    "sojová omáčka",
    "+ rolovací rohožka"
  ],
  "__v": 1
}