{
  "hash": "bdba730abeadec15515ca492e66e320175b2a74e",
  "title": "Sticky Ginger Soy Glazed Chicken",
  "image": "http://www.budgetbytes.com/wp-content/uploads/2016/07/Sticky-Ginger-Soy-Glazed-Chicken-bowl-Vs.jpg",
  "href": "http://www.budgetbytes.com/2016/07/sticky-ginger-soy-glazed-chicken/",
  "extension": "Chrome",
  "firstAdded": "2016-08-21T13:47:09.733000",
  "users": [
    null,
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Mince the garlic and grate the ginger using a fine holed cheese grater or box grater. In a small bowl stir together the brown sugar, soy sauce, garlic, ginger, some freshly cracked pepper (about 15 cranks of a pepper mill), and cooking oil. Place the chicken thighs in a shallow dish or a gallon size zip lock bag. Pour the marinade over the chicken and turn to coat. Cover the chicken and marinate for at least 30 minutes or up to a day (refrigerated).",
    "When ready to cook the chicken, heat a large skillet over medium flame. Once hot, add ½ Tbsp cooking oil and swirl to coat the bottom of the skillet. Add half of the chicken pieces and let cook until well browned on each side and cooked through. Remove the cooked chicken to a clean plate, then repeat with the second batch.",
    "Once all the chicken has been removed from the skillet, pour the leftover marinade into the skillet and allow it to come up to a boil. Whisk the marinade as it boils to dissolve any browned bits from the skillet. Let it continue to boil until it reduces to a thick glaze*. Turn the heat off, add the cooked chicken back to the skillet, and dredge it in the thick glaze. Garnish with sliced green onions and sesame seeds if desired."
  ],
  "ingredients": [
    "0",
    "¼ cup brown sugar $0.16",
    "3 Tbsp soy sauce $0.26",
    "2 cloves garlic $0.16",
    "1 Tbsp fresh ginger, grated $0.05",
    "Freshly cracked pepper $0.05",
    "1 Tbsp cooking oil $0.04",
    "1",
    "8 boneless, skinless chicken thighs (about 1.75 lbs.) $7.10",
    "½ Tbsp cooking oil $0.02",
    "2",
    "2 green onions $0.17",
    "1 tsp sesame seeds $0.07"
  ],
  "__v": 2
}