{
  "hash": "5b815bfa413a414b004b0b1a51552cce320e0743",
  "title": "Corn & Chickpea Bowl with Miso-Jalapeño Tahini",
  "image": "",
  "href": "https://www.bonappetit.com/recipe/corn-and-chickpea-bowl-with-miso-jalapeno-tahini",
  "extension": "Chrome",
  "firstAdded": "2018-06-24T13:31:50.009000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "RECIPE PREPARATION",
    "Tahini",
    "Purée ginger, jalapeños, garlic, cilantro, lime juice, tahini, miso, and 3 Tbsp. water in a blender until smooth. Season with salt.",
    "Do Ahead: Tahini can be made 1 day ahead. Transfer to an airtight container and chill.",
    "Bowl Assembly",
    "Heat 2 Tbsp. oil in a large skillet over medium. Add garlic and cook, turning occasionally, until golden brown, about 4 minutes. Mash garlic with a spoon and stir into oil. Add chickpeas and increase heat to medium-high. Cook, undisturbed, until golden brown and beginning to crisp underneath, about 3 minutes. Toss and continue to cook, tossing occasionally, until golden brown all over, 2–3 minutes more. Add corn along with 1 Tbsp. oil and cook, tossing, until corn kernels are golden around the edges and tender, 5–7 minutes. Sprinkle za’atar over and toss to coat. Season with salt.",
    "Lightly drizzle lettuce, tomatoes, and avocado with oil in a large bowl and toss to combine; season with salt.",
    "Divide tahini among bowls and top with vegetables and chickpea mixture. Sprinkle with feta. Serve with lime wedges and cilantro alongside."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "Tahini",
    "1 ¾-inch piece ginger, peeled, finely grated",
    "2 small jalapeños, seeded, chopped",
    "2 small garlic cloves, finely grated",
    "1 cup (packed) cilantro leaves with tender stems",
    "⅓ cup fresh lime juice",
    "⅓ cup tahini",
    "1½ tablespoons miso",
    "Kosher salt",
    "Bowl Assembly",
    "3 tablespoons olive oil, divided, plus more for drizzling",
    "2 garlic cloves, lightly crushed",
    "1 14-ounce can chickpeas rinsed, drained",
    "3 ears of corn, shucked, kernels removed",
    "1 tablespoon za’atar (another flavorful spice blend like curry powder is great here too)",
    "Kosher salt",
    "4 cups Little Gem or other small lettuce leaves, torn if large",
    "4 small tomatoes, cut into wedges",
    "2 avocados, cut into wedges",
    "Crumbled feta, lime wedges, and cilantro (for serving)"
  ],
  "__v": 1
}