{
  "hash": "208dafa96972f5b6e6e23ef7d9e16f1b3c00ede4",
  "title": "Zucchini Pancakes",
  "image": "https://static01.nyt.com/images/2016/08/15/dining/15COOKING-POTATOPANCAKES2/15COOKING-POTATOPANCAKES1-articleLarge.jpg",
  "href": "https://cooking.nytimes.com/recipes/1013960-zucchini-pancakes",
  "extension": "Chrome",
  "firstAdded": "2017-09-02T18:21:44.315000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "FOR THE PANCAKES",
    "Preheat oven to 250 degrees. Place zucchini in a colander over a bowl, and mix with 1/2 teaspoon salt. Allow to drain for five minutes. Transfer to a cloth kitchen towel, and squeeze hard to extract as much moisture as possible. Squeeze a second time; volume will shrink to about half the original.",
    "In a large mixing bowl, combine zucchini and eggs. Using a fork, mix well. Add flour, 1/2 teaspoon salt, olive oil, feta, scallions, dill and 1/2 teaspoon black pepper. Mix well, add baking powder, and mix again.",
    "Place a cast iron skillet or other heavy skillet over medium heat. Add 2 tablespoons vegetable oil and heat until shimmering. Place heaping tablespoons of zucchini batter in pan several inches apart, allowing room to spread. Flatten them with a spatula if necessary; pancakes should be about 3/8 inch thick and about 3 inches in diameter. Fry until golden on one side, then turn and fry again until golden on other side. Repeat once or twice, frying about 5 to 6 minutes total, so pancakes get quite crisp. Transfer to a plate lined with paper towels, and keep warm in oven. Continue frying remaining batter, adding more oil to pan as needed. Serve hot.",
    "For yogurt sauce: In a small bowl, combine yogurt, garlic and salt. Mix well, and serve on the side or on pancakes."
  ],
  "ingredients": [
    "0",
    "3medium zucchini, shredded",
    "Salt",
    "freshly ground black pepper",
    "3large eggs, beaten",
    "½cup all-purpose flour",
    "1tablespoon extra virgin olive oil",
    "1cup crumbled feta cheese",
    "3scallions, finely chopped",
    "⅓cup finely chopped dill",
    "1teaspoon baking powder",
    "4 to 6tablespoons vegetable oil, more as needed",
    "for the yogurt sauce:",
    "⅔ cup plain yogurt",
    "2 cloves garlic, finely chopped",
    "½ teaspoon salt"
  ],
  "__v": 2
}