{
  "hash": "7df4ec26c3b32f9a3b7dfa4c3f495f4c10500ff8",
  "title": "Curried Kale, Potato & Lentil Soup (1-Pot!)",
  "image": "https://minimalistbaker.com/wp-content/uploads/2016/12/SIMPLE-1-Pot-Curried-Lentil-Vegetable-Soup-Easy-hearty-SO-healthy-vegan-glutenfree-curry-soup-recipe-minimalistbaker.jpg",
  "href": "https://minimalistbaker.com/curried-potato-lentil-soup-1-pot/",
  "extension": "Firefox",
  "firstAdded": "2018-12-27T17:54:28.591000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat a large pot over medium heat. Once hot, add oil, onion, ginger, and carrots. Season with a pinch each sea salt and black pepper and stir. Cook for 3-5 minutes, stirring frequently, until onions are soft and fragrant.",
    "Add garlic and potatoes and stir. Cook for 3-4 minutes to brown slightly, and then add curry powder. Stir to coat. Cook 2 minutes more.",
    "Add lesser amount of vegetable broth (5 cups or 1200 ml as original recipe is written // adjust if altering batch size) and increase heat to medium-high. Once at a low boil, add lentils, stir, and reduce heat to low. Simmer for 20-25 minutes, uncovered, or until lentils and potatoes are tender.",
    "Taste and adjust seasonings, adding coconut sugar for a little sweetness (optional), more curry powder for intense curry flavor, or sea salt and pepper for more balance. I added more of each.",
    "If the soup has thickened too much, add remaining vegetable broth (1 cup or 240 ml as original recipe is written // adjust if altering batch size) , stir, and cook until warmed through.",
    "In the last few minutes of cooking, add the kale and cover to steam until tender but still vibrant green - about 2-3 minutes.",
    "Serve immediately as is or with cilantro and fresh lemon juice (optional). This would also go well with my Easy Vegan Wheat Bread, or Garlic & Herb Flatbread! Store leftovers in the refrigerator up to 5 days or in the freezer up to 1 month."
  ],
  "ingredients": [
    "0",
    "1 Tbsp coconut oil (or sub a neutral oil, such as avocado)",
    "1 cup diced yellow or white onion",
    "1 tsp minced fresh ginger",
    "2 medium whole carrots (peeled and chopped)",
    "1 pinch sea salt + black pepper (plus more to taste)",
    "4 cloves garlic, minced (yields ~2 Tbsp as original recipe is written)",
    "3 cups diced potatoes (I used 1/2 peeled sweet potato, 1/2 unpeeled baby yellow potato)",
    "1 1/2 Tbsp curry powder*",
    "5-6 cups vegetable broth (or store-bought- I like Imagine brand)",
    "1 cup green lentils (thoroughly rinsed and drained)",
    "1 Tbsp coconut sugar (optional // plus more to taste)",
    "4 cups chopped green or purple kale"
  ],
  "__v": 1
}