{
  "hash": "35c465026593eb184abae4142fbdb1e500bd820d",
  "title": "thai noodle salad with peanut sauce ★★★★★5 from 22 reviews\nA simple delicious recipe for Thai Noodle Salad with Peanut Sauce, loaded up with healthy veggies. Vegan and Gluten free, this make-ahead salad is perfect for midweek lunches or large gatherings. Make a double batch of the peanut sauce and use for Buddha Bowls and Spring rolls- trust me you will want to! Add Sesame Ginger Tofu for added protein!",
  "image": "https://c0qzv5k3rl-flywheel.netdna-ssl.com/wp-content/uploads/2017/08/Thai-Noodle-Salad-with-Peanut-Sauce-100-7-150x150.jpg",
  "href": "https://www.feastingathome.com/thai-noodle-salad-with-peanut-sauce/",
  "extension": "Chrome",
  "firstAdded": "2018-06-17T03:30:12.546000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "instructions",
    "Cook pasta according to directions on package. ( See notes for rice noodles) Drain and chill under cold running water.",
    "In the meantime, blend the peanut sauce ingredients together in a blender until smooth.",
    "Place shredded veggies, bell pepper, scallions, cilantro and jalapeño in a bowl. Toss. Add the cold noodles to the bowl and toss again. Pour the peanut sauce over top and toss well to combine.",
    "Taste, adjust the salt and serve, garnishing with roasted peanuts and cilantro and a lime wedge.",
    "notes",
    "If cooking pad thai style rice noodles, add the noodles to a pot of boiling water. Turn heat off, stir and let steep 2-3 minutes until tender, drain and run under cool water."
  ],
  "ingredients": [
    "0",
    "6 ounces dry noodles (brown rice noodles, pad thai style rice noodles, soba noodles, linguini)",
    "4 cups mix of cabbage, carrots and radish, shredded or grated",
    "1 red bell pepper, finely sliced",
    "3 scallions, sliced",
    "½ bunch cilantro, chopped (or sub basil and mint)",
    "1 tablespoon (or less, or more) jalapeño, finely chopped",
    "¼-½ cup roasted, crushed peanuts ( garnish)"
  ],
  "__v": 1
}