{
  "hash": "6cca53b048305a9b17fdb416fd34b70d1fc46d96",
  "title": "Green Chili",
  "image": "https://www.wellplated.com/wp-content/uploads/2019/02/Easy-Green-Chili-Recipe-140x140.jpg",
  "href": "https://www.wellplated.com/green-chili-recipe/",
  "extension": "Chrome",
  "firstAdded": "2019-02-07T22:10:40.814000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Place a rack in the center of your oven and preheat the oven to 400 degrees F. For easy cleanup, line a large rimmed baking sheet with foil or parchment paper and place the poblanos, garlic, jalapeño, and onion in the center. Drizzle with 1 tablespoon oil and sprinkle with 1/2 teaspoon salt and 1/4 teaspoon pepper. Bake for 20 to 25 minutes, until the peppers and onions are golden brown and soft. Transfer to a cutting board and let cool. Peel the garlic, then further chop the vegetables into small pieces.",
    "While the vegetables roast, heat a large dutch oven or similar sturdy-bottomed pot with a lid over medium heat. Once the pan is hot, add the remaining 2 tablespoons oil. Then once the oil is hot but not yet smoking, add half of the pork and sprinkle with 1/2 teaspoon salt and 1/4 teaspoon pepper. Stir and cook, disturbing the pork as little as possible, until the pork is lightly browned on all sides, about 4 minutes. It will not be cooked all the way through. Remove to a plate and set aside. Repeat with the second half of the pork, remaining 1/2 teaspoon salt and 1/4 teaspoon pepper. Return all of the pork to the pot.",
    "Sprinkle in the cornmeal, then stir to coat. Stir in the diced tomatoes in their juices, tomatillo salsa, 3 cups chicken broth, oregano, cloves, and chopped roasted vegetables.",
    "Bring the chili to a simmer over medium-high heat, then reduce heat to medium low, partially cover the pot, and simmer for 20 minutes, stirring occasionally.",
    "With a ladle or large spoon, scoop 2 cups of the chili from the pot and transfer to a blender. Be sure to scoop up some of the roasted vegetables and tomatoes, but be careful that you do not get any pork cubes. (I find it easiest to scoop up big ladlefuls, then use a fork to pick the pork cubes out and put them back into the pot, then transfer the ladle contents to the blender.) Hold down the blender lid with a folded kitchen towel. Pulse it a few times to get the soup moving, then increase the pulse time by a few seconds per pulse, until it purées easily. Purée the mixture until smooth, then pour it back into the pot.",
    "Stir in the hominy. Continue to simmer partially covered, stirring occasionally, until the pork is very tender, about 15 minutes more. Give the chili one last big stir. If the chili is thicker than you would like, add the additional 1 cup of chicken broth a little at a time, until you reach your desired consistency. Enjoy hot, topped with avocado, cilantro, and/or Greek yogurt as desired."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "3 poblano peppers — stemmed, seeded, and coarsely chopped into 3/4-inch pieces (about 3 cups)",
    "4 medium garlic cloves — peels on and left whole",
    "2 jalapeno peppers — seeds and membranes removed and chopped into 1/4- to 1/2-inch pieces (about 1/2 cup)",
    "1 medium yellow onion — chopped into 1/4- to 1/2-inch pieces (about 1 cup)",
    "3 tablespoons extra-virgin olive oil — divided",
    "1 1/2 teaspoons kosher salt — divided",
    "3/4 teaspoon ground black pepper — divided",
    "2 pounds pork tenderloin — cut into 1 1/2-inch pieces",
    "1/4 cup fine-grain cornmeal",
    "1 (14.5 ounce) can fire-roasted diced tomatoes",
    "1 (16-ounce) jar prepared tomatillo (green) salsa — about 1 1/2 cups",
    "3–4 cups low-sodium chicken broth — divided",
    "1 teaspoon dried oregano",
    "1 pinch ground cloves",
    "1 (15-ounce) can white hominy, drained",
    "FOR SERVING:",
    "Sliced avocado",
    "Chopped fresh cilantro",
    "Plain nonfat Greek yogurt"
  ],
  "__v": 1
}