{
  "hash": "553b02786d865d222c0785662c16c9ec542fe5a1",
  "title": "italian apple olive oil cake",
  "image": "https://www.themediterraneandish.com/wp-content/uploads/2017/10/Italian-Apple-Olive-Oil-Cake-The-Mediterranean-Dish-5-150x150.jpg",
  "href": "https://www.themediterraneandish.com/italian-olive-oil-cake-apple/",
  "extension": "",
  "firstAdded": "2018-05-05T18:27:13.293000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 degrees F.",
    "Place the chopped apples in a bowl and add orange juice; just enough juice to toss and coat apples so as to prevent browning.",
    "In a large mixing bowl sift together the flour, cinnamon, nutmeg, baking powder and baking soda. Set aside for now",
    "In the bowl of a stand mixer fitted with a whisk, add sugar and olive oil. Mix on low for 2 minutes until well-combined.",
    "While mixer is on, add the eggs, one at a time, and continue to mix another 2 minutes until mixture increases in volume (it should be thicker but still runny)",
    "In the large bowl with the dry ingredients, make a well in the middle of the flour mixture. Add the wet mixture (the sugar and olive oil mixture) into the well. Using a wooden spoon, stir until just blended; it will be a thick batter (do not add anything to loosen it).",
    "Drain raisins (which have been soaking in water) completely; and rid apples of excess juice. Add both raisins and apples to the batter and mix with spoon until well-combined. Again, batter will be fairly thick.",
    "Line a 9-inch cake pan with parchment paper. Spoon thick batter into the pan, and level the top with the back of your wooden spoon.",
    "Bake in 350 degrees F for 45 minutes or until an inserted tooth pick or wooden skewer comes out clean.",
    "Cool completely in pan. When ready, simply lift parchment up to transfer cake into a serving dish. Dust with confectioner’s sugar. Alternatively, heat some dark honey to serve on top (those with a sweeter tooth like this option.)"
  ],
  "ingredients": [
    "0",
    "2 large Gala apples, peeled and chopped as finely as possible",
    "Orange juice to soak apples in",
    "3 cups all-purpose flour",
    "1/2 tsp ground cinnamon",
    "1/2 tsp ground nutmeg",
    "1 tsp baking powder",
    "1 tsp baking soda",
    "1 cup sugar",
    "1 cup Private Reserve extra virgin olive oil",
    "2 large eggs",
    "2/3 cup gold raisins, soaked in warm water for 15 minutes and then drained well",
    "Confectioner’s sugar for dusting"
  ],
  "__v": 1
}