{
  "hash": "1512caf438e293f1f1abc240f6977fd6e63f7642",
  "title": "Coconut Flour Brownies",
  "image": "http://www.veganricha.com/wp-content/uploads/2014/10/Coconut-flour-Brownie-0952.jpg?5bf3b9",
  "href": "http://www.veganricha.com/2014/10/coconut-flour-brownies-vegan-gluten-free-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-06-20T10:57:59.515000",
  "users": [
    null
  ],
  "keywords": [
    "dark",
    "chocolate",
    "theo",
    "use",
    "semi",
    "make",
    "bitter",
    "vegan",
    "chips",
    "enjoy",
    "life",
    "light",
    "coconut",
    "almond",
    "non",
    "milk",
    "maple",
    "syrup",
    "sugar",
    "drops",
    "stevia",
    "oil",
    "organic",
    "canola",
    "vanilla",
    "flaxmeal",
    "psyllium",
    "husk",
    "flour",
    "cornstarch",
    "arrowroot",
    "tapioca",
    "starch",
    "baking",
    "soda",
    "salt",
    "mini",
    "regular",
    "size",
    "fold",
    "batter"
  ],
  "directions": [
    "0",
    "Preheat the oven to 365 degrees F.",
    "Heat coconut milk to just about a boil. Pour into to a bowl. Add the flax meal, psyllum husk, Dark chocolate, semi sweet chocolate and let sit for minute. Then mix well to melt to a smooth consistency.",
    "Add the maple, sugar, oil, vanilla extract, and mix well. Let sit for 5 minutes.",
    "In another bowl, add coconut flour, starch, baking powder and soda and salt. Whisk well.",
    "Add dry to the wet and mix to combine. Fold in the chocolate chips. Taste and add more sugar if needed. The batter will be more of a spongy soft dough and it will continue to dry out. Do not let it sit for long. bake immediately. Transfer batter/dough to greased or parchment lined pan. Pat down to flatten.",
    "Bake at 365 degrees F for 24 to 25 minutes. Cool for 10 minutes before slicing. If using smaller multiple pans, bake for 18 to 19 minutes. Brownies are best served warm right after baking. Store on the counter for the day and refrigerator for a few days. Reheat before serving."
  ],
  "ingredients": [
    "0",
    "½ cup 70 to 85% dark chocolate like Theo (or use semi sweet to make less bitter)",
    "½ cup vegan semi sweet chocolate chips like Enjoy Life",
    "1 cup light coconut milk or almond milk or other non dairy milk",
    "½ cup maple syrup",
    "2 Tbsp ground sugar or 12 drops stevia",
    "3 Tbsp oil (coconut or organic canola)",
    "2.5 tsp vanilla extract",
    "3 Tbsp flaxmeal",
    "2 tsp psyllium husk (or use flaxmeal)",
    "¾ cup + 2 Tbsp Tbsp coconut flour",
    "3 Tbsp cornstarch (or arrowroot or tapioca starch)",
    "¼ tsp baking soda",
    "¼ tsp baking powder",
    "⅛ tsp pinch of salt",
    "¼ cup vegan mini chocolate chips or regular size chocolate chips (to fold into the batter)"
  ],
  "__v": 1
}