{
  "hash": "6e35a910b83e1856ce5ef2d924cfe68350625897",
  "title": "CHOCOLATE CHOCOLATE CHIP PANCAKES (GF)",
  "image": "https://minimalistbaker.com/wp-content/uploads/2017/07/AMAZING-Chocolate-Chocolate-Chip-Pancakes-20-minutes-naturally-sweetened-SO-fluffy-vegan-glutenfree-breakfast-chocolate-pancakes-recipe-12.jpg",
  "href": "https://minimalistbaker.com/vegan-chocolate-chocolate-chip-pancakes/",
  "extension": "Chrome",
  "firstAdded": "2019-08-09T18:57:30.241000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To a large bowl, add oat flour, gluten-free flour, almond flour, cocoa powder, baking powder, and salt. Whisk to combine and set aside.",
    "To a separate mixing bowl, add banana and mash. Then add melted coconut oil, vanilla extract (optional), and maple syrup and whisk to combine. Then add non-dairy milk and whisk to combine. If the coconut oil hardens or clumps, it's not a big deal. You can microwave (for 45 seconds - 1 minute) to remelt - otherwise proceed.",
    "Add the wet ingredients to the dry ingredients and gently fold everything together. Then add the chocolate chips (see photo) and gently fold/mix until the batter is well combined. It should be thick but pourable/scoopable. If too thin, add more gluten-free or almond flour. If too thick, thin with a little non-dairy milk.",
    "Heat a large nonstick skillet, griddle, or cast-iron skillet over medium heat. Carefully rub skillet with coconut oil.",
    "Once hot, spoon 1/4 - 1/3 cup of the batter onto skillet. Cook until surface of pancakes have some bubbles and the edges appear dry (~2 minutes). Carefully flip pancakes and cook until browned on the underside (~2 minutes more).",
    "Transfer cooked pancakes to a baking sheet or plate and keep warm in a 200-degree F (94 C) oven. Continue cooking until all batter is used up - about 12 pancakes (as original recipe is written).",
    "These pancakes are delicious on their own, but they're amplified with toppings (see options above). Store cooled leftover pancakes (without toppings) in a container separated with wax or parchment paper to prevent sticking. Will keep in the refrigerator up to 4 days or in the freezer up to 1 month. Reheat in the toaster oven or oven until hot."
  ],
  "ingredients": [
    "0",
    "3/4 cup gluten-free oat flour* (I ground mine from whole oats)",
    "3/4 cup gluten-free all-purpose flour (I used my DIY blend)",
    "1/4 cup almond flour* (not almond meal, OR sub more gluten-free blend)",
    "1/3 cup cocoa powder",
    "2 tsp baking powder",
    "1/2 tsp sea salt",
    "1 medium ripe banana (the riper the better)",
    "1 1/2 Tbsp melted coconut oil* (plus more for cooking)",
    "1 tsp vanilla extract (optional)",
    "1 1/2 Tbsp maple syrup (I like Grade A)",
    "1 1/4 cup non-dairy milk (I used plain unsweetened almond milk)",
    "1/4 cup vegan dark or semi-sweet chocolate chips (I prefer Enjoy Life)"
  ],
  "__v": 1
}