{
  "hash": "77b3e2fb88492e8dd08fd738187464e994f790c5",
  "title": "Spaghetti & Meatball Soup",
  "image": "http://del.h-cdn.co/assets/16/43/980x490/landscape-1477597840-spaghetti-and-meatball-soupl2.jpg",
  "href": "http://www.delish.com/cooking/recipe-ideas/recipes/a49879/spaghetti-and-meatball-soup-recipe/?zoomable",
  "extension": "Chrome",
  "firstAdded": "2016-11-30T03:18:21.116000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "Preheat oven to 400 degrees F. Line rimmed sheet pan with parchment paper or use a casserole dish. In a large mixing bowl add 2 garlic cloves, breadcrumbs, parsley, onion, egg, 1 teaspoon Italian seasoning, 1 teaspoon salt, and 1/2 teaspoon black pepper. Stir until combined and add ground beef; mix by hand until just incorporated. Form 1\" meatballs and place in a single layer on sheet pan. Meatballs should be touching. Drizzle with olive oil and bake 20 minutes.",
    "Meanwhile bring a large stock pot of water to a boil and season generously with salt. Cook pasta according to al dente package directions. Drain in colander and rinse with water; set aside. Return pot to stove over medium heat and add 1 tablespoon olive oil, remaining Italian seasoning, and remaining garlic; sauté for 2 minutes. Season with 1/2 teaspoon salt and 1/4 teaspoon pepper. Stir in broth and crushed tomatoes and bring to a boil; simmer 5 to 8 minutes.",
    "Add spaghetti and meatballs to soup just before serving. Warm through and ladle into bowls; garnish with parsley and serve immediately."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "3 garlic cloves, minced",
    "1/2 c. panko breadcrumbs",
    "1/2 c. chopped parsley, plus more for garnish",
    "1 small red onion, chopped",
    "1 egg",
    "1 1/2 tsp. Italian seasoning",
    "kosher salt",
    "Freshly ground black pepper",
    "1 lb. ground beef",
    "extra-virgin olive oil",
    "1/2 lb. spaghetti",
    "3 c. low-sodium chicken broth",
    "3 c. crushed tomatoes"
  ],
  "__v": 1
}