{
  "hash": "81bca9f1b9fe92a06de07fa082330d4935bca684",
  "title": "Skillet Pork Chops with Mushroom Sauce",
  "image": "http://simplygloria.com/wp-content/uploads/2015/01/Skillet-Pork-Chops-with-Mushroom-Sauce-by-SimplyGloria.com-pork-mushrooms.jpg",
  "href": "http://simplygloria.com/skillet-pork-chops-with-mushroom-sauce/",
  "extension": "Chrome",
  "firstAdded": "2016-04-16T18:27:09.444000",
  "users": [
    null
  ],
  "keywords": [
    "pork",
    "chops",
    "salt",
    "pepper",
    "purpose",
    "flour",
    "divided",
    "olive",
    "oil",
    "butter",
    "mushrooms",
    "red",
    "onion",
    "dashes",
    "worcestershire",
    "garlic",
    "sprig",
    "rosemary",
    "beef",
    "broth",
    "plain",
    "greek",
    "yogurt",
    "sour",
    "cream",
    "baby",
    "spinach",
    "parsley",
    "garnishing"
  ],
  "directions": [
    "0",
    "Sprinkle salt and pepper on each side of all the pork chops. Combine 3/4 cup of flour with more salt and pepper in a wide shallow dish. Dredge each pork chop into the flour mixture on both sides. Set aside on a plate.",
    "Preheat a large skillet with oil and 1 tablespoon butter on medium-high heat. Once the butter has melted, place each pork chop in the skillet and brown each side until golden brown. (May take about 3-5 minutes on each side, depending upon how thick your chops are or how hot your pan is.) Then place them on the plate off to the side.",
    "Put the heated skillet back on medium-high heat with 1 tablespoon of butter. {Do not wipe out the pan.} Saute mushrooms and onions with the dashes of Worcestershire sauce and stir occasionally for 5 minutes. Add garlic and rosemary with 3 tablespoons of flour and give it a stir.",
    "Pour beef broth over the mushroom mixture and stir. It will begin to slightly thicken while simmering for 5 minutes. Gently add in the Greek yogurt until combined. Fold in the spinach.",
    "Set the cooked pork chops in the sauce and simmer for 3 more minutes and serve."
  ],
  "ingredients": [
    "0",
    "6-8 pork chops",
    "salt and pepper",
    "3/4 cup all purpose flour and 3 tablespoons, divided",
    "3 tablespoons olive oil",
    "2 tablespoons butter, divided",
    "16 ounces mushrooms, sliced",
    "1 small red onion, sliced",
    "5 (or more) dashes of Worcestershire sauce",
    "3 cloves garlic, crushed",
    "1 small sprig rosemary or 1 teaspoons of dried rosemary",
    "1 1/2 cup beef broth",
    "1 cup plain Greek yogurt or sour cream",
    "2 cups fresh baby spinach",
    "fresh parsley for garnishing, optional"
  ],
  "__v": 1
}