{
  "hash": "0358222e4a553124cc4e526d93c9fa57ece00d94",
  "title": "Apfelmus-Schokomuffins",
  "image": "http://www.carrotsforclaire.com/wp-content/uploads/2014/11/3.jpg",
  "href": "http://www.carrotsforclaire.com/2014/10/15/apfelmus-schokomuffins-fuer-alle-es-gibt-grund-zu-feiern/",
  "extension": "Firefox",
  "firstAdded": "2016-10-13T14:51:54.518000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Den Backofen auf 180 Grad Umluft vorheizen.",
    "Die trockenen Zutaten in einer Schüssel verrühren.",
    "Apfelmus und Datteln pürieren oder die Datteln im Apfelmus zerdrücken. (Die Dattelflüssigkeit im Kühlschrank aufheben, sie macht sich gut in Smoothies.)",
    "Die flüssigen Zutaten zu den trockenen geben und mit einem Teigschaber ausgiebig durchmischen. Sofern die Masse nicht cremig genug ist, Dinkelmilch zufügen.",
    "Den Teig in eingefettete und gestaubte Muffin-Förmchen oder in Silikonformen geben, gehackte Nüsse darauf verteilen (oder später Kokosraspeln) und für etwa 45 Minuten in den Ofen schieben. Fertig sind sie, wenn nur eine minimale Teigmenge am Zahnstocher haften bleibt.",
    "Danach aus der Form nehmen und auf einem Rost abkühlen lassen. Erst ausgekühlt haben sie innen die gewünschte saftige aber nicht mehr nasse Konsistenz und ihr volles Aroma erreicht!",
    "Kurz vor dem Verzehr wird ein wenig Ahornsirup über die Muffins geträufelt oder sie werden dünn damit eingepinselt. Wer auf Nüsse verzichtet hat, gibt jetzt Kokosraspeln darüber."
  ],
  "ingredients": [
    "0",
    "100g Buchweizenmehl (alternativ Dinkel)",
    "15g Kakao (wenn möglich Faire Trade)",
    "wahlweise 3 EL geriebene Haselnüsse, Mandeln oder Kokosraspeln, alternativ 1 EL Öl",
    "1 TL Backpulver",
    "1/3 TL Bourbon-Vanillepulver oder Mark 1/2 Vanille",
    "1 Prise Salz",
    "200ml ungesüßtes Apfelmus",
    "6 Datteln, für mind. 30 Minuten in Wasser eingeweicht",
    "evtl. 50ml Dinkelmilch oder andere Getreide- oder Nussmilch",
    "Für das Topping",
    "2-3 EL grob gehackte Haselnüsse, andere Nüsse oder 1-2 EL Kokosraspeln",
    "etwas Ahornsirup"
  ],
  "__v": 1
}