{
  "hash": "f7220f960d8ad1967c180d8c2312f994bfc93e16",
  "title": "Lentil and Sausage Soup for a Cold Winter's Night",
  "image": "//images.food52.com/zwJPh5toXEmbxfSXXrzRMl260g4=/753x502/c7802ab1-e5e5-49a8-887b-0f213742b147--480kmpDUeopuyRj5hs9Ptp02RtLrwo9NG9MVDfRL-wM.jpg",
  "href": "http://food52.com/recipes/2348-lentil-and-sausage-soup-for-a-cold-winter-s-night",
  "extension": "Chrome",
  "firstAdded": "2015-08-31T21:13:31.568000",
  "users": [
    null
  ],
  "keywords": [
    "french",
    "green",
    "lentils",
    "bay",
    "leaves",
    "bacon",
    "fat",
    "olive",
    "oil",
    "divided",
    "sausages",
    "herbs",
    "andor",
    "garlic",
    "yellow",
    "white",
    "onion",
    "sturdy",
    "red",
    "wine",
    "stalks",
    "celery",
    "possible",
    "marjoram",
    "equivalent",
    "carrots",
    "depending",
    "size",
    "chicken",
    "beef",
    "stock",
    "preferably",
    "organic",
    "ketchup",
    "spinach",
    "frozen",
    "dont",
    "use",
    "instead",
    "parsley",
    "salt",
    "pepper",
    "vinegar"
  ],
  "directions": [
    "0",
    "Fill a tea kettle with water and put it on the stove to boil while you do the following step.",
    "Heat 2 T of oil or bacon fat with one of the bay leaves and gently saute the sausages, if they are not already cooked. If they are pre-cooked (or if not, once you've cooked them), slice them into ¾“ slices and brown them in the bacon fat or oil. Remove the sausage slices with a slotted spoon and set them aside.",
    "Rinse the lentils in cold water two or three times, pick out any stones or other debris, and put the lentils on the stove in a saucepan with at least three cups of hot water from the kettle. If it hasn’t boiled at this point, don’t worry about it. Stir the lentils and cook them over medium heat, while you chop the vegetables. Be sure to keep an eye on the cooking lentils and stir them occasionally. Add more hot water as they cook, if they start to look dry. (You don’t have to do this step if you have a lot of time to make this soup. I.e., you can put them in the soup, uncooked, with the hot water, after you have cooked the onions and garlic.)",
    "If time is short, heat your stock in the microwave or on the stove so it will be nice and hot when you need it, in a few minutes.",
    "Meanwhile, dice the onions so they are about ½” square; chop the garlic. Add the remaining oil or bacon fat, as well as the onions and garlic, to the pan in which the sausages were browned; cook over medium heat, stirring occasionally. When the onions start to look a bit translucent, push them aside with a spoon and add the wine. Cook for a minute or two to deglaze the pot.",
    "Stir the lentils in with the cooking water. It doesn’t matter whether they are cooked. Just add them now, and add the stock.",
    "Chop the celery into small dice and chop a small handful of the celery leaves, if you have them; add to the soup. Add the marjoram and stir well, continuing to cook.",
    "Cut the carrots into slices or chunks, depending on how thick they are. Add them to the pot, with the reserved sausages, and the salt and pepper to taste, and stir well. (I add the sausages at this point, rather than earlier, because the kind I use tends to fall apart, even after browned, if I cook them much longer. You can add them when you combine the lentils and their cooking water, if that's not a problem for you.)",
    "Cook for at least another ten minutes, adding more water if necessary and stirring occasionally, to prevent the lentils from sticking. At this point, you can also turn it down to simmer, if you have the time, but do keep an eye on the lentils, please, and add more water if necessary.",
    "Add the ketchup and stir well. Cook until the carrots are tender.",
    "Test and correct the seasonings. Add the spinach and the parsley. Heat until the soup is very hot.",
    "Pass the red wine vinegar separately, for people to add, to taste. Serve with a hearty whole grain bread and fresh butter.",
    "Enjoy!!!"
  ],
  "ingredients": [
    "0",
    "1 1/2 cups French green lentils",
    "2 bay leaves",
    "3 tablespoons bacon fat or olive oil, divided",
    "3 or 4 sausages made with herbs and/or garlic",
    "1 large yellow or white onion",
    "4 cloves of garlic",
    "1/2 cup sturdy red wine",
    "3 stalks of celery, and their leaves if possible",
    "1 tablespoon dried marjoram or an equivalent amount of fresh",
    "4 or 5 carrots, depending on their size",
    "4 cups chicken or beef stock (preferably homemade)",
    "3 tablespoons organic ketchup",
    "2 cups chopped spinach (frozen is fine, if you don't have fresh; just use 1 1/2 cups instead)",
    "1/4 cup chopped parsley",
    "Salt and pepper, to taste",
    "Red wine vinegar, to taste"
  ],
  "__v": 1
}