{
  "hash": "fcc5e1d30ab3480b761b60d1de49fe6f47cde828",
  "title": "SWEET ONION GRATINATE",
  "image": "",
  "href": "http://lidiasitaly.com/recipes/sweet-onion-gratinate/",
  "extension": "Chrome",
  "firstAdded": "2018-02-28T16:45:16.526000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "For this recipe you will need a 12- or 14-inch skillet with a cover, for sautéing the onions and a large rimmed baking sheet such as a 12- by 18- inch half sheet",
    "Cooking the Onions:",
    "Peel the onions and cut in half through the stem ends. Rinse the halves in cold water for a moment. Slice the halves cross-wise into very thin half-moon shapes: you should have over 12 cups of onions. Preheat the oven to 450 degrees.",
    "Put the oil and butter in the skillet, set over medium heat, and before the butter is all melted, dump in all the onions and turn them over to coat. Drop in the bay leaves, sprinkle with the salt, turn and stir the onions a bit more, then cover the pan. Let the onions sweat and soften for about 10 minutes, stirring just once or twice, but otherwise keeping them covered.",
    "Uncover the pan and continue to cook the onions and to gradually evaporate the juices. Adjust the heat to keep the juices bubbling without any danger of burning the onions and stir frequently. After 10 minutes or so, the onions should be very soft, wet and glassy, but with hardly any liquid left in the pan. If there’s a lot of liquid, raise the heat slightly and cook longer, stirring as the juices evaporate. But don’t let the onions or the pan get completely dry. Remove it from the heat while they’re still moist and let them cool off just a bit.",
    "Assembling and Baking the Gratin:",
    "Butter the baking sheet generously, using 3 to 4 tablespoons of the soft butter. Trim off the crusts of the bread slices and lay them in one layer in the sheet pan, sides touching, to cover the bottom completely. Fill any empty spaces with pieces of bread cut to shape. Now press down gently over all the bread with your hand, to compress the layer slightly and close any gaps. Spread the remaining soft butter all over the bread with a rubber spatula or big spoon.",
    "While the onions are still warm, spoon them onto the bread and spread in an even layer; scrape the flavorful cooking juices from the pan too. Sprinkle all the cheese evenly over the onions, covering the entire surface, but don’t press the cheese down at all.",
    "Bake for 10 minutes or so; rotate the pan for even cooking and bake another 10 or 15 minutes until the cheese is a deep brown-gold crust and the edges of the bread are also crisp and dark (but not burnt).",
    "Let the gratin cool for at least a few minutes on a wire rack (the pan will be very hot!). Serve it warm or room temperature, cut in pieces of any size."
  ],
  "ingredients": [
    "0",
    "For the Onion Topping",
    "3-1/2 pounds large sweet onions, such as Vidalia or Walla Walla",
    "1/4 cup extra-virgin olive oil",
    "4 tablespoons butter",
    "4 bay leaves",
    "1/2 teaspoon salt",
    "for the Base and the Gratin",
    "9 or more thick slices of hearty white bread (about 3/4 pound) see note below,",
    "8 tablespoons (1 stick) soft butter",
    "2 cups freshly grated Grana Padano (about 12 ounces)"
  ],
  "__v": 1
}