{
  "hash": "71555e0a49548cfc0a7983bb73327217b3d5dc07",
  "title": "Onion rings",
  "image": "http://1.bp.blogspot.com/_TtjHZtf6vtA/S-hR7W1dGaI/AAAAAAAAIUM/s3w6UvBvLuo/onionring2.jpg",
  "href": "http://foodwishes.blogspot.com/2010/05/can-i-get-onion-rings-instead-of-fries.html",
  "extension": "Chrome",
  "firstAdded": "2017-04-28T05:35:56.198000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Onion rings have an odd place in American cuisine. Everyone seems to love them, and they're on the menu at just about every burger joint in the country, yet their popularity as a side dish to meat on buns doesn't even come close to the venerable French fry.",
    "The reason is as obvious as it is annoying – they cost extra. Fries always come with the burger, but if you want those crispy, golden brown rings of pleasure, it's going to be $00 more.",
    "Sure you crave the crunchy goodness, but the thought of paying extra to upgrade a side dish at Big Bad Billy's Burgers and Beers seems downright un-American.",
    "So, as much as you may want them, and as much as you may fantasize about what a nice treat they'd be while standing in line, when you come belly to cash register, you just can't pull the trigger.",
    "Well, I have good news – this onion rings recipe is so easy, and so amazingly crispy, you can now make up for all those years of deep-fried denial by making these at home.",
    "If fact, these are so good, you may want to consider charging your friends and family a little bit extra for the upgrade. Enjoy!"
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "1/2 cup all-purpose flour",
    "1/4 cup cornstarch",
    "2 tablespoons instant mashed potatoes",
    "big pinch of cayenne",
    "1 cup cold club soda",
    "2-3 cups Panko (Japanese-style breadcrumbs), or as needed",
    "fine salt to taste",
    "vegetable oil for frying",
    "2-3 yellow onions, cut into 1/4-inch rings",
    "*Note: the amounts in the video were for a smaller batch. The amounts above will make a nice large batch, enough for about 8 servings."
  ],
  "__v": 1
}