{
  "hash": "2505dbdf843154866922dedf9c1e6dbfc84a8751",
  "title": "VEGAN CHEESEBURGER SOUP\nAuthor: Beth Hornback | Pass the Plants Prep Time: 30 minutes Cook Time: 30 minutes Total Time: 1 hour Yield: 8 servings Category: Soup Cuisine: Vegan American",
  "image": "",
  "href": "https://passtheplants.com/vegan-cheeseburger-soup/",
  "extension": "Chrome",
  "firstAdded": "2018-09-22T01:55:22.636000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "MAKE THE CHEESE SAUCE/SOUP BASE",
    "In a large soup pot, add potatoes, carrots, red lentils, oats, garlic, and cashews.",
    "Cover with 4 cups of water or vegetable broth and bring to a boil, then reduce to a simmer.",
    "Cook for 10 minutes or until lentils and veggies are soft.",
    "Remove to a blender and set aside.",
    "Return soup pot to the stove (don’t worry about cleaning it out).",
    "MAKE THE “BURGER MEAT”",
    "In a large food processor, pulse the pepitas and sun-dried tomatoes until a finely crumbled and no large pieces remain. Do not puree into a paste. Set aside.",
    "Using the shredding attachment, shred the onion, cauliflower, mushrooms, and garlic.",
    "Heat the soup pot to medium-high, and add the shredded vegetables.",
    "Sauce the vegetables until cooked throughout and no moisture remains in the pot.",
    "Reduce heat to medium and add the pepita/sun-dried tomato mixture.",
    "Cook for 1-2 minutes, stirring to combine.",
    "Add the steak sauce and soy sauce and cook for 1-2 minutes more. Turn off heat.",
    "ASSEMBLE THE SOUP",
    "Blend the cheese sauce until smooth and creamy.",
    "Pour the cheese sauce into the soup pot and stir to combine with the vegetable meat substitute mixture.",
    "Add 2 cups of water or vegetable broth and stir to combine.",
    "Bring the mixture to a boil and reduce to a simmer until warmed through.",
    "Season with salt and pepper to taste, and serve with desired toppings."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "SOUP BASE/CHEESE SAUCE",
    "3 medium gold potatoes, peeled and chopped into 1/2” pieces (about 2 cups)",
    "3 carrots, chopped into 1/2” pieces, (about 1 1/2 cups)",
    "1/2 cup red lentils, rinsed in fine-mesh strainer",
    "1/2 cup rolled oats (not quick oats)",
    "1/2 cup raw cashews",
    "2-3 garlic gloves, peeled",
    "4 cups water",
    "2 cups water, vegetable broth, or vegan beef broth",
    "1/2 cup nutritional yeast",
    "2 tablespoons light miso paste",
    "1 teaspoon salt, plus more to taste",
    "VEGETABLE MEAT SUBSTITUTE (THE “GROUND MEAT”)",
    "3/4 cup raw pepitas (pumpkin seeds) or walnuts",
    "1/4 cup sun-dried tomato strips (dry-packed)",
    "1 large white onion, diced",
    "1/2 head cauliflower (about 2 cups florets)",
    "8 oz. crimini mushrooms",
    "3 garlic cloves, peeled",
    "2 tablespoons Steak sauce or vegan worcestershire sauce",
    "1 tablespoon soy sauce",
    "OPTIONAL TOPPINGS",
    "chopped pickles",
    "chopped red onion or scallions (grilled or raw)",
    "chopped lettuce",
    "vegan bacon bits",
    "chopped tomatoes"
  ],
  "__v": 1
}