{
  "hash": "4cb2ddb9a197c11e6531c0229b578eecda6b8348",
  "title": "SPAGHETTI CARBONARA",
  "image": "",
  "href": "http://www.gimmesomeoven.com/spaghetti-carbonara/",
  "firstAdded": "2015-02-20T02:01:02.779000",
  "users": [
    null
  ],
  "keywords": [
    "spaghetti",
    "onion",
    "regular",
    "turkey",
    "bacon",
    "eggs",
    "milk",
    "parmesan",
    "black",
    "pepper",
    "olive"
  ],
  "directions": [
    "0",
    "DIRECTIONS:",
    "Bring a big pot of salted water to a boil on the stove. (Use about 2 Tbsp. salt - this is the secret to flavorful Italian pasta!)",
    "While waiting for the water to boil, heat 1 Tbsp. of oil in a large skillet over medium-heat. Add the turkey bacon and cook until it is nearly crispy, stirring every few minutes. (If using real bacon, you will not need to add oil initially, and you may actually need to drain some grease before the next step.) Then add the diced onion to the skillet, and continue cooking until the bacon is crispy and the onion is translucent.",
    "In a separate small bowl, whisk together eggs, milk, parmesan and black pepper until well-blended. Set aside.",
    "Once the pasta water is ready, add the spaghetti and cook according to package instructions until it is al dente. (Usually about 9-11 minutes.)",
    "When the pasta is ready, carefully and quickly drain out the pasta water, and return the pasta to the hot pot immediately. Then while stirring the pasta with one hand, use the other to pour the egg mixture into the pasta and continue to toss until the egg mixture is cooked into the pasta. (You may see a few tiny clumps, but in general, the eggs will just coat the individual pieces almost like a sauce.) Then add in the bacon and eggs mixture and toss until mixed.",
    "Feel free to garnish with extra parmesan and/or chopped fresh parsley. Serve immediately."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS:",
    "1 lb. spaghetti",
    "1/2 large onion, diced (about 1 cup)",
    "1/2 lb. bacon (regular or turkey bacon), diced",
    "5 eggs",
    "1/4 cup milk",
    "1/4 cup parmesan (or more)",
    "1 tsp. freshly ground black pepper",
    "olive oi"
  ],
  "__v": 1
}