{
  "hash": "b00d00fd3c669fe61b59b8e32a9d8d233dd1891c",
  "title": "LEMON GARLIC CHICKEN ASPARAGUS PASTA",
  "image": "https://therecipecritic.com/wp-content/uploads/2017/03/Lemon-Garlic-Asparagus-Chicken-Pasta-2-e1488914417636.jpg",
  "href": "https://therecipecritic.com/lemon-garlic-chicken-asparagus-pasta/",
  "extension": "",
  "firstAdded": "2019-04-09T01:17:36.528000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large pot bring water to a boil and add the pasta. Cook according to package directions. Drain and set aside.",
    "While the pasta cooks, heat olive oil in a large skillet over medium-high heat. Add the chicken and season with salt, black pepper and oregano. Cook for 5 minutes, stirring occasionally until browned and cooked through. Add 1 teaspoon minced garlic and cook for another minute, until fragrant. Transfer to plate and set aside.",
    "Add butter to the same skillet and melt over medium high heat. Add remaining minced garlic and asparagus and saute for 1 minute, until just starting to turn bright green. Whisk in the cream, lemon juice, lemon zest, garlic powder, oregano, parmesan and mozarella cheese. Allow the sauce to thicken and cheese to melt. Add the drained pasta and chicken back into the skillet. Season with salt and black pepper to taste (I used about 1½ teaspoons salt + ½ teaspoon black pepper). Toss to coat well until everything is heated through.",
    "Serve hot and sprinkle with more parmesan cheese, chopped parsley, and lemon slices, if desired."
  ],
  "ingredients": [
    "0",
    "7 ounces dried pasta (I used bow tie)",
    "1½ tablespoons olive oil",
    "2 medium boneless skinless chicken breasts, cut into 1 inch chunks or strips",
    "Salt and black pepper, to taste",
    "½ teaspoon dried oregano",
    "3 tablespoons butter, unsalted",
    "1½ tablespoons minced garlic, divided",
    "1 pound asparagus, ends trimmed and cut into 2-inch pieces",
    "½ cup heavy cream",
    "Juice and zest of one lemon",
    "1 teaspoon garlic powder",
    "½ teaspoon dried oregano",
    "¼ teaspoon dried thyme",
    "⅓ cup grated parmesan cheese, plus more for garnish",
    "½ cup grated mozzarella cheese",
    "Chopped fresh parsley and lemon slices for garnish, if desired"
  ],
  "__v": 1
}