{
  "hash": "efa7ebff5883e88b7c39a4503bd732d44e276c7b",
  "title": "Broccoli Apple Soup",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2013/11/broccoli-apple-soup-vertical.jpg",
  "href": "https://www.simplyrecipes.com/recipes/broccoli_apple_soup/",
  "extension": "",
  "firstAdded": "2018-01-27T22:00:53.403000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Separate the broccoli florets from the stems. Peel the outer tough skin of the stems with a vegetable peeler. Slice the stems into rounds and chop finely (a mini chopper food processor works well for this step).",
    "2 Heat a thick-bottomed medium large (4-quart) saucepan on medium heat. Melt the butter in the pan. Add the onion and the apple and lower the heat to low. Cover and cook for 10 minutes, until onions are translucent and apples are softened.",
    "3 Add the broccoli florets and the chopped broccoli to the apple onion mixture. Add the stock and the cider. Tie up the thyme sprigs with kitchen string and add to the pot. Add strips of lemon peel to the pot as well. Increase the heat, bring to a boil, reduce the heat to maintain a low simmer, covered. Cook for 20 to 25 minutes.",
    "4 Remove from heat. Remove thyme and lemon peels from the soup and discard. Working in batches, filling up the blender bowl to no more than one third full at a time, purée the soup.",
    "5 Return soup to the pot, reheat and adjust seasonings to taste. Garnish with chopped fresh chives to serve."
  ],
  "ingredients": [
    "0",
    "1 large bunch of broccoli (about 3 heads with stems)",
    "3 Tbsp butter",
    "1 cup of thinly sliced or finely chopped yellow or white onion",
    "1 good cooking apple (a non-tart apple such as Jonagold, golden delicious, McIntosh), peeled, cored, chopped",
    "3 cups of chicken stock",
    "1 cup of unfiltered apple juice or apple cider (not hard cider)",
    "4 sprigs of lemon thyme or thyme",
    "2 strips of lemon peel",
    "1 Tbsp chopped fresh chives for garnish"
  ],
  "__v": 1
}