{
  "hash": "fc83c7a21dcde305b50c49941de9b86174e8e3d9",
  "title": "Paleo Sweet Potato Meringue Pie",
  "image": "http://4.bp.blogspot.com/-eQSvRXXe6Gw/UjYq7HOEiCI/AAAAAAAALJI/Y953xgEYMSs/s640/IMG_3350.jpg",
  "href": "http://cupcakesomg.blogspot.com/2013/09/paleo-sweet-potato-meringue-pie.html",
  "extension": "Chrome",
  "firstAdded": "2016-02-06T17:40:12.418000",
  "users": [
    null
  ],
  "keywords": [
    "crust",
    "coconut",
    "flour",
    "arrowroot",
    "salt",
    "cold",
    "grassfed",
    "butter",
    "cubed",
    "pieces",
    "ice",
    "water",
    "filling",
    "potatoes",
    "oil",
    "eggs",
    "egg",
    "yolk",
    "orange",
    "zest",
    "juice",
    "maple",
    "syrup",
    "maybe",
    "want",
    "sweetertry",
    "figure",
    "cinnamon",
    "nutmeg",
    "vanilla",
    "meringue",
    "whites",
    "room",
    "temp",
    "raw",
    "honey"
  ],
  "directions": [
    "0",
    "Preheat oven to 350 degrees F.",
    "In a food processor, pulse coconut and arrowroot flours and salt until well incorporated, about 10 seconds. Add the cold butter (this important--don't fuck it up with room temperature butter) to the flour and pulse until the flour becomes crumbly, about 45 seconds.",
    "While food processor is running, add ice cold water (don't fuck this one up either), in a slow steady stream. Add enough for the flour to start to bind together. It may not come together in the food processor, so I ended up dumping this in a bowl after adding about 1/2 cup of water and continued to incorporate the water with my hands. Ultimately, you're just trying to make the dough come together, but it will be crumbly. Test by pressing the dough together in your hand to see if it stays together. If not, add more water. Work quickly!",
    "Once dough can come together, dump it onto a big sheet of plastic wrap and form into a ball, then wrap and place in the fridge for about 30 minutes.",
    "Steam sweet potatoes for about 30 minutes, or until they're fork tender.",
    "Allow sweet potatoes to cool slightly, then toss sweet potatoes in a large bowl. Using a hand mixer (or blender/food processor/fork, whatever), puree sweet potatoes with coconut oil and eggs. Once combined, add zest, orange juice, maple syrup, spices, and vanilla. Taste here and decide if you want it sweeter.",
    "Remove chilled pie crust from fridge and press into a pie plate (this is easier than rolling it out, just be careful about making it even across the pie plate).",
    "Using a fork, poke holes on the bottom and sides of the crust, then place in oven for about 10 minutes.",
    "Remove crust from oven, then dump filling into the pie shell. Place back in the oven for about 50-60 minutes, or until a skewer comes out clean.",
    "Cool for about an hour.",
    "Make meringue by beating egg whites with a hand mixer until glossy peaks form. Then, add honey and continue to beat until well incorporated.",
    "Dallop meringue all over pie--use a spatula or fork or something to make peaks.",
    "Place pie back in the oven and turn on your broiler. Broil for about 1-2 minutes, or until meringue is golden. Allow to cool for another hour before serving."
  ],
  "ingredients": [
    "0",
    "For the crust",
    "1 1/2 cups coconut flour",
    "1/2 cup arrowroot flour",
    "1 tsp salt",
    "8 TBSP/1 stick of very cold grass-fed butter, cubed into small pieces",
    "1/2 - 1 cup ice cold water",
    "For the filling",
    "4 large sweet potatoes, peeled and cubed",
    "2 TBSP coconut oil",
    "2 eggs and 1 egg yolk",
    "1 TBSP orange zest",
    "juice of half an orange",
    "1/2 cup pure maple syrup (maybe more if you want it sweeter--try it and figure it out)",
    "1 tsp cinnamon",
    "1/2 tsp nutmeg",
    "1 tsp vanilla extract",
    "For the meringue",
    "3 egg whites, room temp",
    "3-4 TBSP raw honey"
  ],
  "__v": 1
}