{
  "hash": "285a9eea9dcdcd8dba45a4ae452848125a8738cd",
  "title": "Eggplant Dip (Baba Ghanouj)",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2011/09/eggplant-dip-vertical-600.jpg",
  "href": "https://www.simplyrecipes.com/recipes/eggplant_dip_baba_ghanouj/",
  "extension": "",
  "firstAdded": "2018-01-28T20:44:53.594000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1a Oven method Preheat oven to 400°F. Poke the eggplants in several places with the tines of a fork. Cut the eggplants in half lengthwise and brush the cut sides lightly with olive oil (about 1 Tbsp). Place on a baking sheet, cut side down, and roast until very tender, about 35-40 minutes. Remove from oven and allow to cool for 15 minutes.",
    "1b Grilling method Preheat grill. Poke the eggplants in a few places with a fork, then rub the eggplants with 1 tablespoon of the olive oil. Grill over high heat, turning as each side blackens. Put the charred eggplants in a paper bag, close the bag and let the eggplants steam in their skins for 15-20 minutes.",
    "2 Scoop the eggplant flesh into a large bowl and mash well with a fork. Combine the eggplant, minced garlic, remaining olive oil (about 2 Tbsp), tahini, cumin, 2 Tbsp of the lemon juice, the salt, and a pinch of cayenne. Mash well. You want the mixture to be somewhat smooth but still retaining some of the eggplant's texture.",
    "3 Allow the baba ghanouj to cool to room temperature, then season to taste with additional lemon juice, salt, and cayenne. If you want, swirl a little olive oil on the top. Sprinkle with fresh chopped parsley.",
    "Serve with pita bread, crackers, toast, sliced baguette, celery, or cucumber slices."
  ],
  "ingredients": [
    "0",
    "1-2 globe eggplants (totaling 2 lbs)",
    "3 Tbsp extra virgin olive oil",
    "2-3 Tbsp roasted tahini (sesame paste)",
    "1-2 garlic cloves (more or less depending on how garlicky you want your baba ghanouj to be), finely chopped",
    "1 teaspoon ground cumin",
    "Juice of one lemon - about 2 1/2 tablespoons",
    "Salt and cayenne pepper to taste",
    "1 Tbsp chopped parsley"
  ],
  "__v": 1
}