{
  "hash": "c9c5f100ae053d3df3b5b9b7090737a418ba471e",
  "title": "Plant- Based “Beefy” Burgers These amazing plant- based burgers surprisingly imitate the texture flavor and looks of a real beef burger except without the beef! Packed full of whole grains and superfoods these are a healthier alternative to the traditional Hamburger. With Grilling season upon us these burgers are perfect for your next BBQ!",
  "image": "",
  "href": "http://katu.com/afternoon-live/cooking-recipes/beefy-hamburger-without-the-beef",
  "extension": "Chrome",
  "firstAdded": "2018-05-17T03:04:43.400000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "-process walnuts finely in a food processor and set aside in a large mixing bowl. Process mushrooms, then add butter and pulse until incorporated. Add brown rice, oats, beets, vegan mayo, coconut aminos, garlic, chili flake, salt & pepper and process lightly. Add processed mixture to ground walnuts and mix thoroughly with spatula. Set mixture in the fridge for one hour before forming patties.",
    "-use a ½ measuring cup or 4 oz scoop and form burgers.",
    "- heat grill or grill pan over med/hi. Spray with pan spray. Cook patties for approx 4 mins on each side until heated all the way through. Make sure to achieve nice char on each side before flipping. Dress them up with your favorite toppings and Enjoy!"
  ],
  "ingredients": [
    "0",
    "-2 cups walnuts raw and halved",
    "-2 cups brown rice or other grains (ex. Bulgur, freekeh, ect.)",
    "-8 oz Portobello mushrooms cleaned and rough chopped",
    "-1/2 cup uncooked rolled oats (use gluten free if allergen)",
    "-2 TBLS veganaise",
    "-3 ounces vegan butter chilled and cubed",
    "-3 garlic cloves finely chopped",
    "-2 TBLS raw red beets grated on microplane",
    "-1 TBLS coconut aminos or tamari",
    "-one small pinch chili flakes",
    "-salt and pepper to taste ( Suggested salt amount 2 ½ tsp Sea salt or pink Himalayan salt",
    "- your favorite hamburger buns, toppings and sauces"
  ],
  "__v": 1
}