{
  "hash": "d5a73a38f7f73e59c8c12d5def5735233c392d78",
  "title": "Lasagna Stuffed Peppers",
  "image": "http://www.threeolivesbranch.com/wp-content/uploads/2016/10/IMG_0659-e1477940736712-768x1024.jpg",
  "href": "http://www.threeolivesbranch.com/recipe/lasagna-stuffed-peppers/",
  "extension": "Chrome",
  "firstAdded": "2017-10-03T23:26:49.238000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare your sauce if necessary.",
    "Slice the bell peppers in half lengthwise (through the stem and bottom). Remove all seeds and ribs from the peppers. Set aside.",
    "Slice the zucchini into thin slices, approximately 1/8\". Set aside.",
    "Make the cheese mixture by combining the ricotta, egg, Parmesan, mozzarella, basil, parsley, salt, and black pepper. Mix to combine and set aside.",
    "Heat the oven to 350F.",
    "Place the pepper halves on a large baking sheet. In the bottom of each pepper, spread 1/2 Tbsp of the sauce. Then add 1 Tbsp of the cheese mixture and spread out across the pepper. Add zucchini slices on top to cover and trim to fit.",
    "Repeat with another layer of sauce, cheese, and zucchini.",
    "Top each pepper with a little more cheese, just to cover, and a drizzle of sauce. If your peppers are already full, you can stop at any layer.",
    "Sprinkle the tops with some additional mozzarella and Parmesan if you want a crunchy, gooey top.",
    "Place the peppers in the oven and bake until the cheese is melted and starting to brown, approximately 15-20 minutes. The peppers will just start to soften. If the pepper is getting too soft and you are not getting any color on the cheese, switch to the broil setting in the oven, move the peppers to the top rack, and broil briefly until browned. (Do not use a silicone sheet liner when broiling).",
    "Remove from oven and let stand a few minutes. Serve warm with salad or pasta if you wish."
  ],
  "ingredients": [
    "0",
    "4 large",
    "bell peppers any color, see note",
    "1 medium",
    "zucchini approximately 6 oz",
    "1 1/4 cups",
    "sauce (any type, see note) (plus more for serving)",
    "15 oz",
    "ricotta",
    "1 large",
    "egg",
    "1/2 cup",
    "freshly grated Parmesan",
    "1/2 cup",
    "mozarella shredded",
    "1/2 Tbsp",
    "dried basil",
    "1 tsp",
    "dried parsley",
    "1/2 tsp",
    "salt",
    "1/2 tsp",
    "black pepper"
  ],
  "__v": 1
}