{
  "hash": "43ad2fbcb57110ee0d1e310e0ad16ffe1c5abd14",
  "title": "No Bake Samoa Cheesecakes",
  "image": "http://www.cookingclassy.com/wp-content/uploads/2015/01/samoa-no-bake-cheesecakes3edit-srgb..jpg",
  "href": "http://www.cookingclassy.com/2015/01/no-bake-samoa-cheesecakes/",
  "extension": "Chrome",
  "firstAdded": "2016-06-22T21:23:18.004000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare caramel sauce according to directions listed (only use 2 pinches table/sea salt instead). Pour into a jar and allow to cool completely.",
    "For the chocolate ganache:",
    "Place milk and semi-sweet chocolate chips in a heat proof bowl. Heat heavy cream nearly to a boil, then pour over chocolate chips. Stir until chocolate has melted.",
    "In a bowl, using a fork, stir together crushed shortbread with melted butter until evenly moistened.",
    "In a mixing bowl using an electric hand mixer, whip heavy cream until soft peaks form. Add 3 Tbsp of the powdered sugar and whip until stiff peaks form. Scoop out a heaping 1/2 cup of the whipped cream mixture, transfer to a piping bag and set aside in refrigerator (this will be for the piped cream on top of the cheesecakes). In a separate mixing bowl, whip cream cheese until smooth. Add remaining powdered sugar (1/2 cup + 3 Tbsp) and vanilla and mix to combined. Stir and fold in remaining whipped cream mixture (that which isn't being refrigerated).",
    "To assemble cheesecakes:",
    "Spoon 1 1/2 Tbsp chocolate ganache into bottom of each cup (pour right into middle so it doesn't run down sides of cup. Do a little less of each layer listed if making 8 servings). Freeze or refrigerate until firm, then pour about 2 Tbsp of the shortbread crust mixture over chocolate layer and gently spread and press into an even layer. Spoon cheesecake filling into a large pipping bag and pipe filling over shortbread crust layer. Cover with plastic wrap and chill 2 hours.",
    "Spoon a heaping tablespoon of the caramel sauce over cheesecake filling. Top evenly with a heaping tablespoon of the coconut mixture. Transfer remaining chocolate ganache (rewarm in microwave slightly so it's pipe-able) to a small piping bag (or small resealable bag with corner cut) and drizzle over coconut layer. Top with whipped cream mixture that was set aside. Serve within several hours of adding caramel and coconut topping.",
    "Recipe source: Cooking Classy"
  ],
  "ingredients": [
    "0",
    "Recipe here (only use 2 pinches salt)",
    "1 cup sweetened coconut, toasted and slightly crushed",
    "1/3 cup semi-sweet chocolate chips",
    "1/3 cup milk chocolate chips",
    "1/2 cup cup heavy cream",
    "1 cup crushed shortbread cookies (I recommend using Lorna Doone, about 19 cookies)",
    "2 Tbsp unsalted butter, melted",
    "1 1/4 cups heavy cream",
    "3/4 cup + 2 Tbsp powdered sugar",
    "12 oz cream cheese, softened (don't melt)",
    "1/2 tsp vanilla extract."
  ],
  "__v": 1
}