{
  "hash": "9fe0a7e9a36252eed7589bb5efbd891a7f4b1084",
  "title": "Boeuf Bourguignon",
  "image": "//files.meilleurduchef.com/mdc/photo/recipe/beef-bourguignon-recipe/beef-bourguignon-recipe-1200.jpg",
  "href": "https://www.meilleurduchef.com/cgi/mdc/l/en/recipe/beef-bourguignon-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-03-10T14:06:48.490000",
  "users": [
    null
  ],
  "keywords": [
    "beef",
    "stew",
    "meat",
    "chuck",
    "shin",
    "brisket",
    "trimmings",
    "carrots",
    "onion",
    "flour",
    "bouquet",
    "garni",
    "garlic",
    "red",
    "wine",
    "brown",
    "veal",
    "stock",
    "sunflower",
    "peanut",
    "oil",
    "salt",
    "pepper",
    "sugar",
    "aromatic",
    "streaky",
    "bacon",
    "button",
    "mushrooms",
    "pearl",
    "onions",
    "unsalted",
    "butter",
    "utensils",
    "chefs",
    "knife",
    "sabatier",
    "chinois",
    "strainer"
  ],
  "directions": [
    "0",
    "Method for Boeuf Bourguignon:",
    "1",
    "Before starting this Bœuf Bourguignon recipe, make sure you have organised all the necessary ingredients.",
    "2",
    "Prepare the aromatic vegetables. Using a slicing knife, cut the carrots and onions into a coarse mirepoix.",
    "3",
    "Heat some oil in a stew pan, then add the meat cuts...",
    "4",
    "... and brown them.",
    "5",
    "Add the aromatic garnish...",
    "6",
    "... and sweat them for a few minutes, while stirring frequently.",
    "7",
    "Sprinkle the mixture with flour, then roast in the oven for a few minutes so that the starch cells burst.",
    "8",
    "Combine to incorporate the flour.",
    "9",
    "Moisten with red wine...",
    "10",
    "... and brown veal stock.",
    "11",
    "Add the garlic (crushed or chopped) and the bouquet garni.",
    "12",
    "Cover the pot with a lid, then place in the oven on high heat (180°C/gas 4) for about 2 hours.",
    "13",
    "In the meantime, brown-braise the pearl onions: Place them in a sauté pan. Add a knob of butter, a small amount of sugar, salt and water (make sure the onions are immersed all the way through). Bring to medium heat. When the butter is melted and the water comes to the boil, make a lid with greaseproof paper and place it over the onions. Cook on low heat until the evaporation is complete. Remove the paper lid and continue cooking by tossing the pan. The onions must be caramelized, but not burnt. Keep warm in the oven.",
    "14",
    "Blanch the bacon lardons: Place them into a large amount of cold, salted water and bring to a temperature close to boiling temperature.",
    "15",
    "Drain...",
    "16",
    "... and brown in a non-stick frying pan. Remove from the pan...",
    "17",
    "... and brown the button mushrooms (cut into coarse dices) in the same pan.",
    "18",
    "While the preparation is cooking in the oven, stir regularly to ensure that it does not stick to the bottom of the pot. When cooked, remove from the oven.",
    "19",
    "Tranfer the meat pieces into a separate recipient.",
    "20",
    "Sift the sauce, using a chinois with metal mesh or a fine sieve.",
    "21",
    "Combine the meat pieces with the garnish. Season to taste. Use bain-marie cooking to keep warm.",
    "22",
    "This dish must be served hot."
  ],
  "ingredients": [
    "0",
    "Ingredients for 4:",
    "1kg beef stew meat (chuck, shin, brisket...) with trimmings",
    "2 carrots",
    "1 onion",
    "30g flour",
    "1 bouquet garni",
    "2 garlic cloves",
    "40cl red wine",
    "40cl brown veal stock",
    "Sunflower or peanut oil",
    "Salt",
    "Pepper",
    "Sugar",
    "For the aromatic garnish:",
    "150g streaky bacon",
    "150g button mushrooms",
    "150g pearl onions",
    "20g unsalted butter",
    "Utensils:",
    "Chef's Knife 20 cm Sabatier",
    "Chinois Strainer Ø 18.5cm"
  ],
  "__v": 1
}