{
  "hash": "fcc21428ab361bb8ecc20393c4afaadfe795774c",
  "title": "Moroccan Chicken Brochettes",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/moroccan-chicken-brochettes",
  "extension": "Chrome",
  "firstAdded": "2017-06-06T20:20:11.268000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparation",
    "Garlic Sauce",
    "Place garlic in a mortar; season with salt and pound to a very fine paste. (Alternatively, place garlic on a cutting board, season with salt, and mash with the side of a chef’s knife.) Transfer garlic paste to a small bowl and gradually whisk in oil.",
    "Very gradually whisk yogurt into garlic mixture until emulsified. (Add too fast and sauce will break. If it does break, gradually whisk in 1 tsp. water just before serving.)",
    "DO AHEAD: Garlic sauce can be made 6 hours ahead. Cover and chill.",
    "Chicken",
    "Toss chicken, garlic, parsley, cumin, paprika, and red pepper flakes in a medium bowl; season with salt. Cover and chill at least 2 hours.",
    "Prepare grill for medium-high heat and oil grate. Thread chicken onto skewers. Grill, turning occasionally, until cooked through, 8–12 minutes. Serve with garlic sauce, pita bread, labneh, tomatoes, and mint.",
    "DO AHEAD: Chicken can be marinated 12 hours ahead. Keep chilled."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "8 SERVINGS",
    "Garlic Sauce",
    "4 garlic cloves, finely chopped",
    "Kosher salt",
    "⅓ cup olive oil",
    "3 tablespoons plain yogurt",
    "Chicken",
    "2 pounds skinless, boneless chicken thighs, cut into 2” pieces",
    "2 garlic cloves, chopped",
    "½ cup finely chopped fresh flat-leaf parsley",
    "2 teaspoons ground cumin",
    "2 teaspoons paprika",
    "¼ teaspoon crushed red pepper flakes",
    "Kosher salt",
    "Vegetable oil (for grilling)",
    "Warm pita bread, labneh (Lebanese strained yogurt), chopped tomatoes, and fresh mint leaves (for serving)",
    "Special Equipment",
    "Sixteen 8” bamboo or metal skewers"
  ],
  "__v": 1
}