{
  "hash": "7b6b28eecc4f89f14190b1de26611554b95203f5",
  "title": "Beef stroganoff with herby pasta",
  "image": "//www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--52759_11.jpg?itok=j0_LrhCV",
  "href": "https://www.bbcgoodfood.com/recipes/8828/beef-stroganoff-with-herby-pasta",
  "extension": "Chrome",
  "firstAdded": "2018-05-13T19:48:14.137000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Freeze the beef for 45 mins before you begin, slice as thinly as you can, then season.",
    "In a large, non-stick frying pan, melt half the butter with half the oil. Increase the heat, then quickly sear the beef in batches until browned on both sides. Remove the meat and set aside. Repeat with the mushrooms, then set aside with the beef. Boil the pasta.",
    "Add the remaining butter and oil to the pan and soften the shallots for a few mins. Stir in the flour for 1 min, then gradually stir in the stock. Bubble for 5 mins until thickened, then stir in the mustard, purée, crème fraîche and seasoning. Bubble for 1 min more, then return the beef and mushrooms to the pan.",
    "Drain the pasta, toss with half the parsley, season, then serve with the creamy stroganoff, sprinkled with the remaining parsley."
  ],
  "ingredients": [
    "0",
    "400g beef rump steak, trimmed",
    "1 tbsp butter Butter butt-errButter is made when lactic-acid producing bacteria are added to cream and churned to make an…",
    "1 tbsp olive oil Olive oil ol-iv oylProbably the most widely-used oil in cooking, olive oil is pressed from fresh olives. It's…",
    "300g small button mushroom",
    "400g pappardelle pasta",
    "3 shallots Shallot shal-lotRelated to the onion (as opposed to being a younger version of it), shallots grow in clusters at… , finely chopped",
    "1 tbsp plain flour",
    "300ml beef stock",
    "1 tbsp Dijon mustard",
    "1 tbsp tomato purée",
    "3 tbsp crème fraîche",
    "½ x 20g pack flat-leaf parsley, chopped"
  ],
  "__v": 1
}