{
  "__v": 1,
  "directions": [
    "0",
    "Halfway fill a large mixing bowl with ice cubes; set aside. Place four small jars (or 6 if you’d prefer smaller portions) near your work area. Fill a medium size pot with an inch or two of water; place a double boiler insert, or a large bowl, over the pot. Add the chocolate and melt completely. Once it’s melted, remove from heat and set the double boiler insert over the prepared bowl of ice cubes. Add the milk and stir with a spatula until mostly combined (make sure to scrape the bottom and edges of the insert while you’re mixing). Using a hand mixer on medium-low speed, beat the mixture for 3-5 minutes. During this time it’s going to be super bubbly, then fine lines will start to appear. Once the bubbles have diminished and all you can see are lines, mix for an additional 10 seconds then work quickly to pour the mousse into the jars. Tap each jar on the counter to remove any trapped air bubbles, top with lid, then refrigerate for at least 2 hours, or until set. Mousse will keep in the refrigerator for up to 5 days.",
    "If you happen to overmix the the mousse and it cannot be poured into the jars, return the double boiler insert to the pot of water, melt the mixture completely, then set insert over the bowl of ice cubes and start the mixing process again.",
    "When you’re ready to serve, top with coconut whipped cream, toasted coconut flakes, and chocolate shavings.",
    "Yield: 4 servings"
  ],
  "firstAdded": "2014-07-07T09:51:55.683000",
  "hash": "134c0481abf6e88c85e59538c1ddcf00942f6afa",
  "href": "http://www.ohladycakes.com/2014/03/two-ingredient-chocolate-mousse.html",
  "image": "http://farm8.staticflickr.com/7405/12976237164_1b5aec840d_b.jpg",
  "ingredients": [
    "0",
    "Mousse",
    "6 oz good quality dark chocolate, 65% dark",
    "3/4 cup Califia Farms toasted coconut almondmilk",
    "Toppings",
    "Coconut whipped cream",
    "Toasted coconut flakes",
    "Shaved chocolate"
  ],
  "keywords": [
    "mousse",
    "good",
    "quality",
    "chocolate",
    "dark",
    "califia",
    "farms",
    "coconut",
    "almondmilk",
    "toppings",
    "whipped",
    "cream",
    "shaved"
  ],
  "title": "TOASTED COCONUT CHOCOLATE MOUSSE",
  "users": [
    null
  ]
}