{
  "__v": 2,
  "directions": [
    "0",
    "Heat oven to 170°C. Line the bottom of a 25cm springform pan (7.5cm high) with parchment paper cut to fit. Do not butter or flour the pan.",
    "Whisk together flour, baking powder, salt, and 1¼ cups sugar in a large bowl. Make a well in the center and add oil, yolks, water or orange juice, lemon zest and vanilla. Whisk well for about 1 minute or until smooth.",
    "Beat egg whites in the bowl of an electric mixer until frothy. Add cream of tartar or lemon juice and beat until whites hold soft peaks. With the mixer running, slowly mix in the remaining ¼ cup sugar. Beat whites until they are glossy and hold stiff peaks. The peak of egg whites on the end of the beater should not droop when you turn the beaters over.",
    "Use a large whisk or spatula to gently stir about a third of the whites into the batter to lighten it. Then gently fold in the remaining whites until just blended.",
    "Pour batter into prepared pan and level the top. Bake for 45 to 55 minutes until a skewer inserted into the centre comes out clean.",
    "Place cake on a wire rack and let it cool completely in the pan. Run a spatula or knife around the outside edge of the cake and unmould it from the pan. Peel off the parchment and place the cake on a serving platter. Garnish lightly with powdered (icing) sugar to serve."
  ],
  "firstAdded": "2014-10-14T16:47:37.501000",
  "hash": "f2876081a8f083d0d3056611c21d850fe04b2c01",
  "href": "http://www.thestar.com.my/Lifestyle/Food/Recipes/2014/05/09/Classic-Chiffon-Cake/",
  "image": "http://www.thestar.com.my/~/media/Images/TSOL/Photos-Upload/Food and Drink/2014/05/chiffon cake.ashx?w=620&h=413&crop=1&",
  "ingredients": [
    "0",
    "2¼ cups sifted cake flour (250g)",
    "2 tsp baking powder",
    "¼ tsp salt",
    "1½ cups sugar, divided",
    "½ cup vegetable oil",
    "7 egg yolks (about ½ cup)",
    "¾ cup water or orange juice",
    "1 tbsp grated lemon zest",
    "1½ tsp pure vanilla extract",
    "10 egg whites (about 1 1/3 cups)",
    "½ tsp cream of tartar or lemon juice"
  ],
  "keywords": [
    "sifted",
    "cake",
    "flour",
    "baking",
    "salt",
    "sugar",
    "divided",
    "oil",
    "egg",
    "yolks",
    "water",
    "orange",
    "juice",
    "lemon",
    "zest",
    "vanilla",
    "whites",
    "cream",
    "tartar"
  ],
  "title": "Classic Chiffon Cake",
  "users": [
    null
  ]
}