{
  "hash": "8b07c5b848311d35b1e1efbf8fc32185a5618500",
  "title": "Butternut Squash Kale Lasagna",
  "image": "http://mydarlingvegan.com/wp-content/uploads/2016/12/butternut-squash-lasagna3.jpg",
  "href": "http://www.mydarlingvegan.com/2016/12/butternut-squash-and-kale-lasagna-with-garlic-bechamel-sauce/",
  "extension": "Chrome",
  "firstAdded": "2017-09-18T20:43:01.319000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To prepare the butternut squash: Preheat the oven to 425. Slice the butternut squash in half, lengthwise. Drizzle with 1 tablespoon of olive oil, sprinkle with garlic, sage, allspice, and salt. Flip the squash over so that the inside is face-down on the baking sheet and bake for 40 minutes, until very tender.",
    "While squash is baking make the Bechamel Sauce (directions below) and prepare the noodles and kale.",
    "To prepare the kale: In a large sauté pan, heat the additional 1 tablespoon of olive oil over medium-low heat. Add sliced onions and sauté slowly, stirring occasionally, for about 15 minutes. Once onions are soft and lightly browned, stir in chopped kale. Sauté for another 5 minutes until kale is cooked.",
    "Boil lasagna noodles in a large pot of water according to packaged directions.",
    "When butternut squash is done, remove from heat and reduce oven to 375 degrees. With a spoon scoop out squash from the skin, and mash. Set aside.",
    "1",
    "Heat vegan butter in a medium sauce pan over medium-high heat. Once butter is melted, add flour and stir over heat for 3-4 minutes, until mixture is smooth and golden-brown. In another pot, bring milk and minced garlic to a boil. Add hot milk to butter/flour mixture in 3 batches. Bring to a boil, whisking often, then reduce heat to a simmer. Cook for 10 minutes, whisking constantly. Once thick and creamy, remove from heat and set aside. Sauce will continue to thicken as it cools.",
    "2",
    "In an 8x8 or 9x6 baking sheet, pour a small amount of Bechamel Sauce on the bottom and spread evenly.",
    "Lay down a layer of noodles followed by Bechamel Sauce, mashed butternut squash, and then sautéd kale. Top this with more Bechamel Sauce and repeat the process (see photos above).",
    "Top with a 3rd layer of noodles and final layer of Bechamel.",
    "Cover in foil and bake for 40 minutes. Remove from heat and let cool 15 minutes before slicing. Top with vegan parmesan cheese and/or parsley and serve."
  ],
  "ingredients": [
    "0",
    "1 butternut squash",
    "2 tablespoon olive oil, divided",
    "3-4 cloves of garlic, minced",
    "2 teaspoons sage",
    "1/2 teaspoon allspice",
    "pinch of salt",
    "1 red onion, thinly sliced",
    "4 cups fresh kale, packed",
    "8 ounces lasagna noodles",
    "1",
    "5 tablespoons vegan butter",
    "1/4 cup all-purpose flour",
    "4 cups unsweetened soy milk",
    "4-5 cloves garlic, minced",
    "1/4 teaspoon nutmeg",
    "pinch of salt, to taste",
    "2",
    "Vegan parmesan cheese",
    "Shredded vegan mozzarella",
    "Italian parsley, minced"
  ],
  "__v": 1
}