{
  "__v": 1,
  "directions": [
    "0",
    "Whisk the eggs and 4 Tbs. water together in a shallow dish.",
    "Mix the flour, salt, pepper, and garlic powder in another shallow dish. Dip the chops in the flour, then over into the egg. Then back over into the flour mixture once again.",
    "This is what puts the extra crispy coating on the chops. Be sure to get plenty of flour on in this last coating,",
    "then shake them a little and place in a pan with about a half inch of oil. Be sure the oil is hot, but not too hot or the chops will cook too fast. You need to get it good and hot and then turn to about medium. Cook for about 6 minutes on each side.",
    "Try not to turn more than twice or your breading will come off.",
    "Remove from the pan to a 9\"x13\" baking dish.",
    "Saute the garlic a little in the butter.",
    "Add the honey, soy sauce, brown sugar, cayenne, and ginger.",
    "Bring to a boil then reduce to low and simmer for about 5 minutes. Watch this carefully because it will foam and might boil over.",
    "Pour 1/2 of the glaze over the pork chops.",
    "Flip them over and pour the other 1/2 over the other side.",
    "Place uncovered in a preheated 350 degree oven for about 20-25 minutes. This sets the glaze and finishes them to be sure they are cooked through"
  ],
  "firstAdded": "2014-07-20T19:39:52.176000",
  "hash": "8a91fc957c212e90e3f601370b758264d9c72ff9",
  "href": "http://www.keyingredient.com/recipes/714794970/crunchy-honey-garlic-pork-chops/",
  "image": "http://lh6.ggpht.com/_lCujSgmTyVW2DKi1AU7QO4l6ULbgd9xqico52HKvBB-w4RC_Uiu_F55XKhGtgfKZVb2acV804SNpdAZUGsrArB164tW=s450-c",
  "ingredients": [
    "0",
    "6-9\tpork chops (not too thick, you can use boneless pork loin)",
    "2\teggs",
    "4\tTbs water",
    "2\tcups flour",
    "1\ttsp. salt",
    "1\ttsp. black pepper",
    "1\ttsp. garlic powder",
    "Canola or vegetable oil for frying chops",
    "Glaze: 1½ cups honey",
    "½\tcup brown sugar",
    "½\ttsp. ginger",
    "dash of cayenne pepper (to your taste)",
    "½\tcup soy sauce",
    "1\tTbs chopped garlic",
    "2\tTbs butter"
  ],
  "keywords": [
    "chops",
    "use",
    "boneless",
    "pork",
    "loin",
    "eggs",
    "tbs",
    "water",
    "flour",
    "salt",
    "black",
    "pepper",
    "garlic",
    "canola",
    "oil",
    "frying",
    "glaze",
    "honey",
    "brown",
    "sugar",
    "ginger",
    "cayenne",
    "soy",
    "butter"
  ],
  "title": "Crunchy honey garlic pork chops",
  "users": [
    null
  ]
}