{
  "hash": "19afde0371899234e0ffe3369fc8afdf07af7271",
  "title": "Cinnamon Roll Recipe",
  "image": "https://addapinch.com/wp-content/blogs.dir/3/files/2010/12/cinnamon-rolls-recipe-DSC_0754.jpg",
  "href": "https://addapinch.com/cinnamon-rolls-recipe/",
  "extension": "",
  "firstAdded": "2017-07-14T02:52:29.670000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Add yeast and sugar to warm milk in a large bowl. Stir gently to combine and allow the yeast to foam to proof. Once the yeast has proofed, stir in melted butter, salt, eggs, and flour into yeast mixture. Gently mix until well-combined.",
    "Turn dough onto a lightly floured surface and knead for 10-12 minutes. Form the dough into a large ball and place into a large buttered glass bowl. Cover lightly with plastic or with a tea towel and place in a warm location free of any drafts. Allow to rise so that the dough is doubled in size.",
    "1",
    "Place dough on a large lightly floured surface and roll to a ¼ inch thickness. Spread softened butter over the top of the dough.",
    "Stir together the brown sugar and cinnamon and sprinkle generously all over the buttered dough.",
    "Tightly roll the dough, beginning at the long edge, until a log of dough has been formed.",
    "Cut the dough into ¾-inch to 1-inch slices and place onto a lightly buttered sheet pan.",
    "2",
    "Preheat oven to 400º Fahrenheit.",
    "Allow rolls to rise for 30 minutes on sheet pan.",
    "Place rolls into oven and allow to cook until lightly browned and cooked through, but not overcooked, about 15-20 minutes.",
    "While cinnamon rolls are baking, prepare cream cheese frosting by creaming together butter, confectioner's sugar, cream cheese, vanilla and salt.",
    "Remove cinnamon rolls from the oven and allow to cool slightly.",
    "Spread frosting generously over rolls while they are warm."
  ],
  "ingredients": [
    "0",
    "1 cup warm milk",
    "2¼ teaspoons (1 packet) yeast",
    "½ cup granulated sugar",
    "½ cup melted butter",
    "2 teaspoons Kosher salt",
    "2 large eggs",
    "4½ cups all-purpose flour + a little for handling",
    "1",
    "1 cup packed brown sugar",
    "2½ tablespoons cinnamon",
    "½ cup butter",
    "2",
    "½ cup butter, softened",
    "1½ cup confectioners sugar",
    "¼ cup cream cheese",
    "½ tablespoon vanilla",
    "⅛ teaspoon Kosher salt"
  ],
  "__v": 1
}