{
  "hash": "95dd9e8e297ad04d40a7fe58017eaff122fdf896",
  "title": "Sweet Potato, Red Cabbage and Kelp Noodle Bowl with Rich Miso Dressing",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2012/10/Sweet-Potato-red-cabbage-kelp-noodle-bowl.jpeg",
  "href": "http://www.onegreenplanet.org/vegan-food/recipe-sweet-potato-red-cabbage-and-kelp-noodle-bowl-with-rich-miso-dressing/",
  "extension": "",
  "firstAdded": "2015-03-25T12:56:52.230000",
  "users": [
    null
  ],
  "keywords": [
    "kelp",
    "noodles",
    "red",
    "cabbage",
    "medium",
    "potato",
    "sprouted",
    "mung",
    "mixed",
    "beans",
    "work",
    "cilantro",
    "used",
    "brown",
    "rice",
    "miso",
    "olive",
    "oil",
    "garlic",
    "clove",
    "lemon",
    "juiced",
    "filtered",
    "water"
  ],
  "directions": [
    "0",
    "If using non organic sweet potato, peel it. If using organic, you can leave the skin on but brush carefully under water. In a food processor, shred the sweet potato using the shredder blade.",
    "Shred the cabbage by using the slicer shredder (if you use the regular shredder, it will come out too fine). You can also use a hand shredder for the sweet potato and a knife to cut very thin strips of cabbage if you don’t have a food processor.",
    "You have the option to steam the vegetables for 3-4 minutes to make them softer, or you can leave them raw. I found the flavours marry together better when slightly steamed. When steaming, separate cabbage and sweet potato to avoid everything turning purple!",
    "Rinse the kelp noodles and give them a rough chop.",
    "To make the dressing, combine all ingredients in a small blender and buzz until smooth, or simply whisk together in a small bowl.",
    "Combine all ingredients in a big bowl and toss with miso dressing."
  ],
  "ingredients": [
    "0",
    "2 cups kelp noodles",
    "¼ red cabbage (2 cups)",
    "1 medium sweet potato",
    "½ cup sprouted beans (Mung beans or mixed beans will work)",
    "Big handful fresh cilantro",
    "1",
    "3 Tbsp miso (I used brown rice miso)",
    "2 Tbsp olive oil",
    "1 garlic clove, minced",
    "½ lemon, juiced",
    "¼ cup warm filtered water"
  ],
  "__v": 1
}