{
  "hash": "e2803d0d1e9b9470384288366c99521ac578f0fa",
  "title": "Turkish Stuffed Eggplant",
  "image": "http://i112.photobucket.com/albums/n177/onionsaregross/album2/IMG_7407_zps1ef17024.jpg",
  "href": "http://thedomesticman.com/2013/09/24/karniyarik-turkish-stuffed-eggplant/",
  "extension": "Chrome",
  "firstAdded": "2015-06-21T20:30:14.045000",
  "users": [
    null
  ],
  "keywords": [
    "lengthwise",
    "mediumsized",
    "eggplants",
    "salt",
    "beef",
    "onion",
    "medium",
    "tomatoes",
    "slices",
    "rest",
    "coarsely",
    "tomato",
    "garlic",
    "pepper",
    "parsley",
    "coconut",
    "oil",
    "ghee",
    "chiles",
    "serrano",
    "jalapeo",
    "okay",
    "depending",
    "heat",
    "preference",
    "green",
    "bell",
    "long",
    "strips"
  ],
  "directions": [
    "0",
    "Slice your eggplants in half lengthwise (if you’re using 4 medium-sized eggplants for this recipe, you’ll want to pare the eggplant in stripes lengthwise instead of slicing them in half). Fill a large bowl with water, stir in 2 tsp of salt, then add the sliced eggplants. Weigh the eggplants down with a plate to keep them submerged; soak for 30 minutes while you prep the filling. This step helps remove the bitterness from the eggplants.",
    "Heat a skillet on medium heat for a minute, then add the ground beef. Sauté until most of the pink is gone, stirring frequently to break up chunks, about 4 minutes. Add the onions and continue to sauté until the onions start to soften, about 4 more minutes.",
    "Add the coarsely chopped tomatoes (be sure to reserve four tomato slices for later), tomato paste, garlic, and salt and pepper; simmer until the tomatoes are softened, another 5 minutes.",
    "Stir in the chopped parsley, season to with more salt and pepper to taste, and set aside.",
    "Remove the eggplants from the water, rinse, and pat dry. Season with a little salt and pepper.",
    "In a large skillet (I just washed the one I had used to make the filling), warm 2 tbsp ghee or coconut oil on med/high heat for a minute, the place the eggplant cut-side-down. Cook in batches until browned, about 4 minutes, then set on paper towels to drain. You only need to brown the cut side of the eggplant. If you’re using medium-sized eggplants, you’ll want to brown them on the pared stripes, a couple minutes per side, until the whole eggplant is browned.",
    "Pre-heat your oven to 400 degrees. Scoop out the seed part of each eggplant and set aside. You don’t need to spoon out too much of the eggplant, just enough to make a divot to put the filling into. If you’re using medium-sized eggplants, simply make a deep slice lengthwise and push apart each slice to create an opening for the filling.",
    "Spoon in the filling then lay down half of a chili pepper and a tomato slice on each eggplant. It’s okay if you have leftover filling – you can sauté it in ghee or oil with the scooped out eggplant pieces to have something to snack on while the eggplants bake.",
    "Bake until the eggplants are soft all the way through, 20-30 minutes, then rest for 5 minutes before serving."
  ],
  "ingredients": [
    "0",
    "2 large eggplants, cut in half lengthwise, or 4 medium-sized eggplants",
    "2 tsp sea salt",
    "1 lb ground beef",
    "1 small onion, diced",
    "2 medium tomatoes, one sliced into 4 slices, the rest coarsely chopped",
    "1 tbsp tomato paste",
    "2 cloves garlic, minced",
    "1/2 tsp each salt and pepper, more to taste",
    "1 small handful fresh parsley, chopped",
    "2 tbsp coconut oil or ghee",
    "4 long green chiles (serrano or jalapeño okay, depending on heat preference), or 1/2 of a green bell pepper cut into 4 long strips"
  ],
  "__v": 1
}