{
  "hash": "0bc3eb9a2504465d81076b5f03fd85a3887c2415",
  "title": "Lentils, Rice, Caramelized Onions",
  "image": "https://static01.nyt.com/images/2020/03/30/dining/30pantry-blog1/merlin_171118218_7451b004-98b1-47d0-80c3-68652a406514-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "href": "https://www.nytimes.com/2020/03/30/dining/pantry-mujadara-coronavirus.html",
  "extension": "Chrome",
  "firstAdded": "2020-03-31T09:48:05.902000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Add 3/4 cups rinsed rice to the pot and continue to simmer until everything is very tender, another 18 to 25 minutes.",
    "Sign up to receive an email when we publish a new story about the coronavirus outbreak.",
    "Sign Up",
    "As it cooks, keep an eye on it. If the mixture looks too thick, cover the pot, or add more liquid. If it seems too thin and soupy, turn up the heat and boil off some of the liquid. The consistency is up to you.",
    "When all is tender and lovely, taste it and add lots of salt, pepper and some kind of acid — lemon juice, vinegar or sumac — for brightness. Top with the reserved golden onions and serve this in bowls, drizzled with your best olive oil, and garnished with red-pepper flakes, chopped fresh herbs, if you have some, and flaky salt. Without the garnish, it’s a drab-looking dish. But even unadorned, the earthy flavors of the lentils combined with those sweet golden onions will shine bright."
  ],
  "ingredients": [
    "0",
    "To make it, heat a slick of oil or other fat in a medium saucepan. I used a combination of olive oil and duck fat. Add sliced onions, shallots or leeks — the more the merrier. The browned onions are the best part of this dish, so you really can’t overdo it, but just know that the more onions you add, the longer they will take to caramelize. I used two shallots and two small onions, because that’s what I had, but in a perfect world, I’d use one giant white onion, thinly sliced.",
    "Add a pinch of salt, and sauté until the onions turn golden brown, 15 to 25 minutes. Watch them carefully, especially toward the end of cooking. If they are cooking too quickly, turn down the heat. If they’re not getting brown, crank it. Some dark brown strands mixed in with the golden ones are OK, but you don’t want them to burn. When they are done, transfer half of them to a plate and add a couple of thinly sliced garlic cloves to the ones left in the pot. Sauté the garlic until fragrant, about a minute, then add 1 teaspoon ground cumin, 1/4 teaspoon ground allspice, if you have it, and a pinch of cayenne, and sauté for a few seconds to toast the spices and bring out their flavor. If you have any herbs sprigs — thyme, oregano or rosemary — add them to the pot. Otherwise, add a large pinch of dried herbs.",
    "[For a similar recipe from Melissa, see this One-Pot Mujadara With Leeks and Greens.]",
    "Now add 5 cups broth or water (or a combination), and bring to a simmer. Add enough olive oil and salt to the liquid so that it tastes good. Then add 1 cup rinsed lentils (any kind) and let simmer, partly covered, until they are almost but not quite done, about 25 to 30 minutes for green or brown lentils, and 15 to 20 for red lentils."
  ],
  "__v": 1
}