{
  "hash": "f92c0408d0f459dccfc14f83c3863a66a049151b",
  "title": "RumChata™ Cheesecake",
  "image": "https://images-gmi-pmc.edge-generalmills.com/1622fa7d-8696-4c7e-94cd-b7e2513e8a97.jpg",
  "href": "https://www.bettycrocker.com/recipes/rumchata-cheesecake/309cfb78-ac42-425e-bdf3-c48908736864",
  "extension": "",
  "firstAdded": "2018-12-17T23:49:16.417000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat oven to 350°F.",
    "In food processor, crush cereal to fine crumbs. Pulse in remaining Crust ingredients. Press in bottom (and part way up side if you want) of 9-inch springform pan. Bake 10 minutes. Place on cooling rack. Reduce oven temperature to 325° F.",
    "When crust is cool, wrap bottom of pan with heavy-duty foil, making sure it goes up the sides a few inches. Wrap pan one or two more times with foil.",
    "In large bowl, beat cream cheese with electric mixer on medium speed until smooth. Beat in 3/4 cup sugar, followed by eggs, one at a time, and egg yolk, beating well and scraping bowl after each addition. With mixer on low, beat in remaining Filling ingredients until smooth. Scrape mixture into foil-wrapped pan; place pan in high-sided roasting pan. Place in oven; create a water bath by carefully pouring a few cups of water into roasting pan--enough to go up sides of cheesecake pan a bit, but not as high as the foil.",
    "Bake about 1 hour 45 minutes or until cheesecake is golden on top with a little wiggle in center. Turn off oven; leave cheesecake in oven 1 hour. Cheesecake will fall slightly (but should still have a flat top). Remove from oven; place on rack while you make Sour Cream Topping.",
    "Heat oven to 350° F again. In small bowl, beat Sour Cream Topping ingredients until smooth. Spread evenly over top of cheesecake; place in heated oven 10 minutes. Remove from oven, back on rack to cool 1 hour. Remove foil from pan; refrigerate cheesecake at least 4 hours before serving. To remove cheesecake from springform pan, wrap sides of pan with towel dampened with hot water until towel is cool. Loosen side of springform.",
    "Before serving, make Cinnamon Drizzle. In 1-quart saucepan, melt 1/4 cup butter. Add remaining Cinnamon Drizzle ingredients. Cook over medium-high heat until sugar melts and mixture comes to a boil. Boil about 1 minute. Remove from heat; cool 10 minutes before drizzling over cheesecake."
  ],
  "ingredients": [
    "0",
    "4 cups Cinnamon Toast Crunch™ cereal Save $",
    "1/4 cup unsalted butter, melted Save $",
    "3 tablespoons sugar Save $",
    "Dash of salt Save $",
    "1",
    "4 packages (8 oz each) cream cheese, softened Save $",
    "3/4 cup sugar Save $",
    "3 whole eggs Save $",
    "1 egg yolk Save $",
    "3/4 cup RumChata™ liqueur Save $",
    "1/2 cup sour cream Save $",
    "2 tablespoons rum Save $",
    "1/2 teaspoon ground cinnamon Save $",
    "Dash of salt Save $",
    "2",
    "1 1/4 cups sour cream Save $",
    "1/4 cup RumChata™ liqueur Save $",
    "1/4 cup sugar Save $",
    "3",
    "1/4 cup unsalted butter Save $",
    "1/2 cup sugar Save $",
    "2 tablespoons water Save $",
    "2 teaspoons ground cinnamon Save $",
    "Dash of salt Save $"
  ],
  "__v": 1
}