{
  "hash": "e737bec868279b507e85fa9408058e6cee0aa72a",
  "title": "Lemon Curd Filled Doughnut Holes",
  "image": "http://www.willcookforsmiles.com/wp-content/uploads/2016/08/Lemon-Curd-Filled-Doughnut-Holes-6.jpg",
  "href": "http://www.willcookforsmiles.com/2016/08/lemon-curd-filled-doughnut-holes.html",
  "extension": "Chrome",
  "firstAdded": "2016-08-16T03:12:17.294000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Pour oil into a medium pot, a frying pan with high sides, or a large sauce pot. Heat it over medium heat until oil reaches 350 degrees. (I find that heat setting that's just a little bit over medium holds the temperature best.)",
    "Line a large cookie sheet with paper towels to catch oil and place a cooling rack on top of paper towels.",
    "Add lemon curd into a piping bag fitted with a long, filling attachment. Set aside.",
    "In a medium mixing bowl, whisk milk and egg until smooth.",
    "Add flour, baking powder, sugar, and salt, mix until all combined.",
    "Add melted butter and mix well.",
    "Fold in lemon zest until evenly spread throughout.",
    "Using a cookie scoop, scoop out dough and drop it into heated oil in batches of 5-6, depending on how big your pot is. (I dip the cookie scoop into some oil and shake it off before doing each batch, this prevents dough from sticking and created smooth dough drops. I also rinse out the scoop between batches, to wash off any stuck on dough. Again, this is to help create smooth doughnut holes.)",
    "Fry doughnut holes for about 4-5 minutes (until they turn deep golden), turning them over every couple of minutes if they haven't turned themselves. (Remember to use metal tongs or metal slotted spoon to take doughnuts out and turn them.)",
    "Take doughnuts out onto the prepared cooling rack. Repeat frying the dough in batches with remaining batter.",
    "Once the doughnut holes are cooled enough to handle, gently inert the pastry filling tip into the doughnut and squeeze some lemon curd inside. Repeat with all doughnut holes.",
    "Sprinkle filled doughnut holes with powdered sugar."
  ],
  "ingredients": [
    "0",
    "1 cup whole milk",
    "1 large egg",
    "¼ cup unsalted butter, melted",
    "2 cups all-purpose flour",
    "4 Tbsp. white granulated sugar",
    "1½ Tbsp. baking powder",
    "Pinch of salt",
    "Zest from 1 lemon",
    "10 oz. lemon curd, for filling",
    "Powdered sugar, for topping",
    "5-6 cups of vegetable oil for frying"
  ],
  "__v": 1
}