{
  "hash": "873462c6f2511a0845110ffda8821bde0b73b79b",
  "title": "Cauliflower Fried Rice",
  "image": "//food.fnr.sndimg.com/content/dam/images/food/fullset/2017/2/8/0/CCTIF306H_Cauliflower-Fried-Rice_s4x3.jpg.rend.hgtvcom.616.462.suffix/1486567665432.jpeg",
  "href": "https://www.cookingchanneltv.com/recipes/tiffani-thiessen/cauliflower-fried-rice-3629531",
  "extension": "Firefox",
  "firstAdded": "2018-02-17T05:14:54.222000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "Watch how to make this recipe.",
    "Heat an 8-inch nonstick skillet over medium heat and coat with olive oil. Beat the eggs in a small bowl, then swirl into the pan to form a thin, crepe-like layer. When almost cooked through, 3 to 4 minutes, flip to quickly cook the other side. Cut into thin strips and set aside.",
    "Add the cauliflower florets in batches to a food processor and pulse to the size of rice. Reserve.",
    "Heat the vegetable oil in a large, high-sided pan over medium-high heat. When the oil shimmers, add the garlic and ginger and stir constantly until fragrant, about 30 seconds. Add the cauliflower rice and carrots and cook, stirring rapidly and continuously, for 2 to 3 minutes, until softened slightly. Add 2 tablespoons water to the bottom of the pan and keep stirring, scraping up anything that sticks. Reduce the heat to medium and cook until the water has evaporated, about 2 minutes. Add 2 tablespoons of the soy sauce and stir in the peas and bean sprouts. Cook, stirring continuously to keep the mixture moving, until all of the liquid has evaporated, 3 to 5 minutes. Add the remaining 2 tablespoons of soy sauce, the egg strips and the scallions; stir to heat the eggs and scallions through. Remove from heat and stir in the sesame oil.",
    "Transfer to a serving dish and garnish with the reserved scallions."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Olive oil, to coat pan",
    "2 large eggs",
    "1 head cauliflower, cut into florets (about 1 pound)",
    "2 tablespoons vegetable oil",
    "3 cloves garlic, minced",
    "1 tablespoon minced fresh ginger (about a 1-inch knob of ginger)",
    "1 cup diced carrot (about 3 medium carrots)",
    "1/4 cup soy sauce",
    "1 cup frozen peas",
    "1 cup bean sprouts (about 3 1/2 ounces)",
    "3 scallions, sliced thin, 1 tablespoon reserved for garnish",
    "1/2 tablespoon sesame oil"
  ],
  "__v": 1
}