{
  "hash": "e0183c7542790bab247624a699015accb80d926f",
  "title": "Chicken and Mushrooms with Marsala Wine Sauce",
  "image": "http://cdn-image.myrecipes.com/sites/default/files/styles/300x300/public/image/recipes/ck/10/09/chicken-and-mushrooms-ck-x.jpg?itok=ixLCc1lp",
  "href": "http://www.myrecipes.com/recipe/chicken-mushrooms-with-marsala-wine-sauce",
  "extension": "Chrome",
  "firstAdded": "2016-06-21T23:46:22.935000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place porcini mushrooms in a small bowl; cover with boiling water. Cover and let stand 30 minutes or until tender. Drain and rinse; drain well. Thinly slice.",
    "Place each chicken breast half between 2 sheets of heavy-duty plastic wrap; pound chicken to 1/2-inch thickness using a meat mallet or small heavy skillet. Combine 3 teaspoons flour, 1/4 teaspoon salt, and black pepper in a shallow dish. Dredge chicken in flour mixture.",
    "Heat a large stainless steel skillet over medium-high heat. Add 1 tablespoon oil to pan; swirl to coat. Add chicken; cook 3 minutes on each side or until done. Remove from pan; cover and keep warm.",
    "Heat remaining 1 tablespoon oil in pan over medium-high heat. Add onion, red pepper, and garlic; sauté 2 minutes or until onion is lightly browned. Add remaining 1/2 teaspoon salt, porcini, shiitake, button mushrooms, and oregano; sauté 6 minutes or until mushrooms release moisture and darken. Sprinkle with remaining 1 teaspoon flour; cook 1 minute, stirring constantly. Stir in wine; cook 1 minute. Add broth; bring to a boil. Reduce heat, and simmer 1 minute. Add chicken and tomatoes; cook 2 minutes or until thoroughly heated, turning chicken once. Sprinkle with basil."
  ],
  "ingredients": [
    "0",
    "1/2 cup dried porcini mushrooms (about 1/2 ounce)",
    "4 (6-ounce) skinless, boneless chicken breast halves",
    "4 teaspoons all-purpose flour, divided",
    "3/4 teaspoon salt, divided",
    "1/4 teaspoon freshly ground black pepper",
    "2 tablespoons olive oil, divided",
    "1/2 cup chopped onion",
    "1/4 teaspoon crushed red pepper",
    "5 garlic cloves, thinly sliced",
    "1 1/2 cups thinly sliced shiitake mushroom caps (about 4 ounces)",
    "1 1/2 cups thinly sliced button mushrooms (about 4 ounces)",
    "1 teaspoon dried oregano",
    "1/2 cup dry Marsala wine",
    "2/3 cup fat-free, lower-sodium chicken broth",
    "1 cup halved cherry tomatoes",
    "1/4 cup small fresh basil leaves"
  ],
  "__v": 1
}