{
  "hash": "ee7714da4d72fa069c604d0c61961154e5ee1848",
  "title": "Cajun rice & barbecue turkey burrito",
  "image": "https://jamieoliverprod.s3.amazonaws.com/recipe-database/oldImages/recipe_single/978_6_1442240183.jpg",
  "href": "http://www.jamieoliver.com/recipes/rice-recipes/cajun-rice-barbecue-turkey-burrito/",
  "extension": "Chrome",
  "firstAdded": "2015-12-09T16:11:40.981000",
  "users": [
    null
  ],
  "keywords": [
    "red",
    "pepper",
    "celery",
    "chilli",
    "spring",
    "onions",
    "garlic",
    "bunch",
    "coriander",
    "olive",
    "oil",
    "salt",
    "black",
    "pack",
    "uncle",
    "bens",
    "precooked",
    "wholegrain",
    "rice",
    "lemon",
    "zest",
    "juice",
    "leftover",
    "turkey",
    "heaped",
    "quality",
    "barbecue",
    "flour",
    "tortillas",
    "feta",
    "cheese",
    "lowfat",
    "natural",
    "yoghurt",
    "serve",
    "cholula",
    "hot"
  ],
  "directions": [
    "0",
    "Method",
    "For this recipe, you will need 250g leftover cooked turkey",
    "This is a quick, easy and super delicious way to use up any leftover turkey from your Christmas dinner – with the holy Cajun trinity of onion, pepper and celery in the rice and pops of caramelised meat, all wrapped up in a soft tortilla – trust me, it’s to die for. You can make this with any leftover meat, so just go for whatever you’ve got in the fridge.",
    "Deseed the pepper and trim the celery, then roughly chop into 1cm chunks. Deseed and finely slice the chilli, then trim and finely slice the spring onions and peel and finely slice the garlic. Pick the coriander leaves and set aside for later, then finely slice the stalks. Put all the chopped veg and herb stalks into a large non-stick frying pan over a high heat with a couple of lugs of olive oil and a pinch of salt and pepper. Fry for around 5 minutes, or until soft, stirring regularly. Add the rice, lemon zest and juice and cook for a further 5 minutes, or until golden and warmed through.",
    "Meanwhile, toss the turkey in the barbecue sauce, then add to a medium frying pan over a medium-high heat and cook for 5 to 10 minutes, or until crispy and slightly caramelised.",
    "Warm the tortillas in a dry frying pan, then divide and pile equal amounts of the Cajun rice and turkey onto one side of each tortilla. Scatter over the reserved coriander leaves and crumble the feta on top. Roll them up, tucking in one side as you go, so you end up with four open-ended burritos. Serve with a dollop of yoghurt and a drizzle of chilli sauce on the side."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1\tred pepper",
    "2\tsticks of celery",
    "1\tfresh red chilli",
    "6\tspring onions",
    "2\tcloves of\tgarlic",
    "1\tbunch of\tfresh coriander",
    "olive oil",
    "sea salt",
    "freshly ground black pepper",
    "1 x 250\tg pack of\tUncle Ben’s pre-cooked wholegrain rice",
    "1\tlemon\t, zest and juice of",
    "250\tg\tleftover cooked turkey",
    "3\theaped tablespoons\tquality barbecue sauce",
    "4\tlarge\tflour tortillas",
    "30\tg\tfeta cheese",
    "low-fat natural yoghurt\t, to serve",
    "Cholula hot chilli sauce\t, to serve"
  ],
  "__v": 1
}