{
  "hash": "764520d14cd50d972f128389cfb58f99fe5c8036",
  "title": "Rolada ziemniaczana z pieczarkami",
  "image": "https://1.bp.blogspot.com/-oimwkJ1OZXU/V-OvqIIdFqI/AAAAAAAAdI8/XvRIYSSYOpMgyDVZsDTke7V6X3qj1IdFgCEw/s640/IMG_2870.JPG",
  "href": "http://sio-smutki.blogspot.com.es/2016/09/rolada-ziemniaczana-z-pieczarkami.html",
  "extension": "",
  "firstAdded": "2016-09-26T15:05:33.043000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Przygotowanie:",
    "Zaczynam od farszu: pieczarki kroję w plasterki i podsmażam przez kilka minut na niewielkiej ilości oleju (do odparowania wody). Podsmażam też pokrojoną w kostkę cebulę - do zeszklenia i lekkiego zarumienienia. Wszystko przekładam do miski i miksuję blenderem. Dodaję posiekaną natkę pietruszki, jajko oraz sól i pieprz do smaku, dokładnie mieszam. Dodaję bułkę tartą i jeszcze raz mieszam, odstawiam.",
    "Ciasto: ugotowane, ciepłe ziemniaki duszę dokładnie widelcem lub przepuszczam przez praskę. Przekładam je do miski, wyrównuję i nożem dzielę na 3 równe części. Jedną część wyjmuję a w jej miejsce wsypuję taką ilość mąki, by wypełniła puste miejsce. Odłożone ziemniaki przekładam z powrotem, dodaję jajko, sól do smaku i łyżką mieszam ciasto do połączenia się składników (nie za długo, bo zrobi się rzadkie). Ciasto dzielę na 2 części.",
    "Na stolnicy układam arkusz papieru śniadaniowego (u mnie 23x 30 cm), oprószam go mocno mąką i rozwałkowuję na nim jedną część ciasta. Na rozwałkowanym cieście układam połowę farszu, pozostawiając wolne brzegi. Pomagając sobie papierem zwijam roladę, sklejam jej brzegi, wciskając widelec robię wzorki. Tak samo przygotowuję drugą roladę.",
    "Rolady przekładam na blachę wyłożoną natłuszczonym papierem i wstawiam do piekarnika nagrzanego do 185 stopni C (góra-dól, bez termoobiegu) na ok. 40 minut. Na kilka minut przed końcem pieczenia smaruję rolady rozmąconym jajkiem, i włączam na chwilę termoobieg (160 stopni C), by się ładnie zarumieniły."
  ],
  "ingredients": [
    "0",
    "Składniki:",
    "Ciasto:",
    "650 g. ziemniaków (waga po ugotowaniu)",
    "1 jajko",
    "ok. 1 szklanki mąki pszennej",
    "sól",
    "Farsz:",
    "0,5 kg pieczarek",
    "1 duża cebula",
    "olej",
    "sól, pieprz",
    "posiekana natka pietruszki",
    "1 jajko",
    "3 łyżki bułki tartej",
    "Dodatkowo:",
    "mąka do podsypania",
    "olej do natłuszczenia blachy",
    "jajko"
  ],
  "__v": 1
}