{
  "hash": "9e05c43a94925fd01d478cdab15a654cdc88eef9",
  "title": "Greek-KittencalS- Greek Moussaka",
  "image": "http://img.sndimg.com/food/image/upload/w_555,h_416,c_fit,fl_progressive,q_95/v1/img/recipes/88/80/4/picMWskIr.jpg",
  "href": "http://www.food.com/recipe/kittencals-greek-moussaka-88804",
  "extension": "Chrome",
  "firstAdded": "2015-12-06T11:33:23.289000",
  "users": [
    null
  ],
  "keywords": [
    "medium",
    "eggplants",
    "olive",
    "oil",
    "needed",
    "lean",
    "beef",
    "use",
    "lamb",
    "onions",
    "garlic",
    "lots",
    "tomato",
    "oregano",
    "divided",
    "salt",
    "black",
    "pepper",
    "cheese",
    "butter",
    "flour",
    "halfandhalf",
    "cream",
    "egg",
    "parmesan"
  ],
  "directions": [
    "0",
    "Grease a 9 x 9-inch baking pan although you could use a 13 x 9 pan using a smaller pan will result in a thicker casserole.",
    "Peel the eggplants then slice 1/4-inch thick (or a little thicker won't hurt).",
    "Brush cookie sheet with olive oil.",
    "Coat each side of sliced eggplant with olive oil then season slices with salt and freshly ground pepper (I use seasoned salt for this and use as much pepper as desired).",
    "Place the eggplant slices on cookie sheet; broil under the broiler until brown; turn and broil the other side, brushing with oil if needed; repeat with all eggplant slices.",
    "In the bottom of the prepared baking dish arrange half of the eggplant slices.",
    "In a large skillet, combine beef and onions; cook stirring until the beef is no longer pink and the onions are soft; drain fat.",
    "Add in the garlic, tomato sauce, oregano, 1/2 tsp salt and black pepper to taste; pour mixture over eggplant slices.",
    "Arrange the remaining eggplant slices over the beef mixture.",
    "PREPARE THE CHEESE SAUCE: Melt the butter in a saucepan, whisk in flour, 1/2 tsp salt and pepper to taste; gradually stir in half and half or milk, cook and stir over medium heat until thick and bubbly.",
    "In a small bowl, beat egg; stir in some of the hot sauce, then add egg to sauce mixture, mix well; add in Parmesan cheese, and stir again.",
    "Pour the cheese sauce over mixture in baking dish.",
    "Bake in a preheated 350 degree F oven for 45 minutes.",
    "Cut into squares.",
    "Note: If doubling this recipe to serve 8 it is best to make two separate casseroles instead of one larger one."
  ],
  "ingredients": [
    "0",
    "2 medium eggplants",
    "olive oil (as needed)",
    "1 lb lean ground beef (or can use ground lamb)",
    "2 medium onions, peeled and chopped",
    "2 tablespoons fresh minced garlic (or to taste, I use lots!)",
    "1 (8 ounce) can tomato sauce",
    "1 teaspoon dried oregano (or to taste)",
    "1 teaspoon salt, divided (or to taste, I use seasoned salt)",
    "1⁄2 teaspoon fresh ground black pepper (or to taste)",
    "CHEESE SAUCE",
    "3 tablespoons butter",
    "1⁄2 teaspoon salt (I use seasoned salt)",
    "1⁄2 teaspoon fresh ground black pepper (or to taste)",
    "2 tablespoons flour",
    "1 cup half-and-half cream",
    "1 egg",
    "1⁄2 cup grated parmesan cheese (can use more)"
  ],
  "__v": 1
}