{
  "hash": "5bd0a33ff8d43c87df7ea378f8b79f80a93ec0aa",
  "title": "Mini Pies in a Cupcake Tin",
  "image": "http://www.tablespoon.com/-/media/Images/Articles/qd/2013/07/2013-07-21-mini-pies-586x322.jpg",
  "href": "http://www.tablespoon.com/recipes/mini-pies-in-a-cupcake-tin/8f1f2894-2665-49ba-905a-146c352bd16f",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T22:09:44.718000",
  "users": [
    null
  ],
  "keywords": [
    "count",
    "pillsbury",
    "refrigerated",
    "pie",
    "crusts",
    "filling",
    "cherry",
    "blueberry",
    "apple",
    "peach",
    "egg",
    "whisked"
  ],
  "directions": [
    "0",
    "Preheat oven to 350°F. Grease 12 muffin cups with cooking spray.",
    "Roll out a single pie crust on a flat surface. Use a large cookie cutter or any sort of circular lid to cut out a 4-inch circle of dough. Press each dough circle into the bottom of a muffin tin so that a tiny rim of dough remains sticking out the top. Repeat with remaining dough to fill all 12 muffin cups.",
    "Fill each cup with about 1/4 cup pie filling, or until the filling nearly fills the cups.",
    "Use the remaining dough to cover the tops of each pie. To make a lattice crust, use a knife or pizza cutter to cut out thin strips of dough, then lace together to form a lattice. To make a standard crust, cut out a circle of dough just large enough to cover the top of the crust. Use your fingers to gently press the top crust to the bottom crust until they stick together and no gaps remain.",
    "Use a pastry brush to brush the tops of each pie with the whisked egg. Then bake for 25-30 minutes, or until the crust is lightly golden and the filling begins to bubble.",
    "Remove and let cool for at least 15 minutes. Then very carefully use a knife to loosen the edges of each pie and gently lift each pie out. Serve immediately or cover and refrigerate."
  ],
  "ingredients": [
    "0",
    "2 (2-count) packages Pillsbury™ Refrigerated Pie Crusts",
    "4 cups or 2 (21-ounce) cans pie filling (cherry, blueberry, apple, peach, etc.)",
    "1 egg, whisked"
  ],
  "__v": 1
}