{
  "hash": "b80d68b80d770aba6f849f3dd9f2d678b9511bff",
  "title": "White and Dark Chocolate Cream Cheese Chocolate Cake Bars",
  "image": "http://cdn.averiecooks.com/wp-content/uploads/2012/03/whitedarkbars-5.jpg",
  "href": "http://www.averiecooks.com/2012/04/white-and-dark-chocolate-cream-cheese-chocolate-cake-bars.html",
  "extension": "Firefox",
  "firstAdded": "2015-10-11T13:13:32.301000",
  "users": [
    null
  ],
  "keywords": [
    "box",
    "devils",
    "food",
    "favorite",
    "boxed",
    "chocolate",
    "cake",
    "unsalted",
    "butter",
    "softened",
    "egg",
    "bourbon",
    "vanilla",
    "especially",
    "nice",
    "cold",
    "brewed",
    "coffee",
    "water",
    "necessary",
    "semisweet",
    "chips",
    "white",
    "sweetened",
    "condensed",
    "milk",
    "use",
    "whipped",
    "cream",
    "cheese",
    "clear",
    "imitation",
    "layer",
    "whiter"
  ],
  "directions": [
    "0",
    "Directions:",
    "Preheat oven to 350F and prepare a 9-by-13 inch pan by lining it with aluminum foil and then spraying it with cooking spray. In a large mixing bowl, combine the cake mix, butter, egg, vanilla and mix either with a mixer, with a spoon, or with your hands, kneading it together. The batter will be extremely thick and will be difficult to combine, but keep stirring or use your fingers and knead it together, adding the coffee (will deepen the flavor and does not make them taste like coffee) or water if necessary. Press the dough it into the prepared pan. It will be tacky, sticky, and a bit tricky to work with, but keep pressing, spreading, and finessing it. Sprinkle the white and dark chocolate chips evenly over the top.",
    "In a mixing bowl, combine the sweetened condensed milk, cream cheese, 1/2 teaspoon vanilla, and stir until well combined, and pour mixture evenly over dough, using a spatula to gently spread and even it if necessary.",
    "Bake for 24 to 27 minutes, or until edges of bars begin to barely brown and pull away slightly from the sides of the pan, or until the middle has barely set, taking care not to overbake. Note that the middle will not seem very well set and will be jiggly upon removing from oven and that is okay, you want to keep these gooey. They will continue to set up more after they have cooled. Allow bars to cool well before slicing and serving. Store in an airtight container in the refrigerator for up to a week or freeze for up to three months."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "1 box devil's food cake chocolate cake mix (or your favorite boxed chocolate cake mix)",
    "1/2 cup unsalted butter (1 stick), softened",
    "1 large egg",
    "1 teaspoon vanilla extract (bourbon vanilla is especially nice)",
    "1 to 2 tablespoons cold brewed coffee or water, optional if necessary",
    "3/4 cup semi-sweet chocolate chips",
    "3/4 cup white chocolate chips",
    "1 can (14-ounces) sweetened condensed milk",
    "1/2 cup (4 ounces) cream cheese, softened (I use whipped cream cheese)",
    "1/2 teaspoon vanilla extract (clear imitation vanilla extract will keep this layer whiter)"
  ],
  "__v": 1
}