{
  "hash": "fd1eb4528873b4dbd931c667d06afbc84ad54089",
  "title": "Chicken and Broccoli Stir Fry",
  "image": "",
  "href": "http://www.dinneratthezoo.com/chicken-and-broccoli-stir-fry/",
  "extension": "Chrome",
  "firstAdded": "2016-05-02T17:15:05.619000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat 1 teaspoon of oil in a Kitchen Fair 10\" Expressions fry pan over medium heat. Add the broccoli and mushrooms and cook for 4-5 minutes until vegetables are tender.",
    "Add the ginger and garlic to the pan and cook for 30 seconds more.",
    "Remove the vegetables from the pan; place them on a plate and cover.",
    "Wipe the pan clean with a paper towel and turn the heat to high. Add the remaining tablespoon of oil.",
    "Season the chicken pieces with salt and pepper and add them to the pan in a single layer - you may need to do this step in batches. Cook for 3-4 minutes on each side until golden brown and cooked through.",
    "Add the vegetables back to the pan and cook for 2 more minutes or until the vegetables are warmed through.",
    "In a bowl whisk together the oyster sauce, chicken broth, sugar, sesame oil and soy sauce. In a small bowl mix the cornstarch with a tablespoon of cold water.",
    "Pour the oyster sauce mixture over the chicken and vegetables; cook for 1 minute. Add the cornstarch and bring to a boil; cook for 1 more minute or until sauce has started to thicken.",
    "Serve immediately, with rice if desired."
  ],
  "ingredients": [
    "0",
    "1 pound boneless skinless chicken breast, cut into 1 inch pieces",
    "1 tablespoon + 1 teaspoon vegetable oil",
    "2 cups small broccoli florets",
    "1 cup sliced mushrooms (if you don't like mushrooms you can add more broccoli instead)",
    "2 teaspoons minced fresh ginger",
    "1 teaspoon minced garlic",
    "¼ cup oyster sauce",
    "¼ cup low sodium chicken broth or water",
    "1 teaspoon sugar",
    "2 teaspoons toasted sesame oil",
    "1 teaspoon soy sauce",
    "1 teaspoon cornstarch",
    "salt and pepper to taste"
  ],
  "__v": 1
}