{
  "hash": "3cd5108710a27bdbea5906c8ecfbd70b80fa12c2",
  "title": "Sweet and Sour Pork Ribs",
  "image": "http://omnivorescookbook.com/wp-content/uploads/2015/01/Sweet-and-Sour-Pork-Ribs-5.jpg",
  "href": "http://omnivorescookbook.com/recipes/sweet-and-sour-pork-ribs",
  "firstAdded": "2015-01-10T13:40:16.122000",
  "users": [
    null
  ],
  "keywords": [
    "pork",
    "spare",
    "ribs",
    "trimmed",
    "centimeters",
    "length",
    "footnote",
    "onebone",
    "sections",
    "shaoxing",
    "wine",
    "thumbsize",
    "ginger",
    "onion",
    "white",
    "save",
    "green",
    "star",
    "anise",
    "chili",
    "pepper",
    "chinese",
    "black",
    "vinegar",
    "light",
    "soy",
    "peanut",
    "oil",
    "sugar"
  ],
  "directions": [
    "0",
    "Rinse pork ribs with running water and transfer to a large pot. Add water to cover the ribs. Add shaoxing wine, ginger, green onion, star anise and chili pepper to the pot. Cover and bring to a boil. Uncover and continue to cook for 5 minutes. Use a ladle to skim the foam from the surface and discard it.",
    "Transfer the ribs to a colander to drain. Scoop ginger, green onion, star anise, and chili pepper from the broth and discard. You can save the broth and use it to make soup later (*see footnote.",
    "Mix black vinegar and light soy sauce in a small bowl, set aside.",
    "Add peanut oil and sugar to a wok and cook over medium heat. Stir constantly with a spatula to dissolve the sugar slowly. When the sugar is fully dissolved, use spatula to scoop some liquid mixture to observe its color. When the sugar turns pale yellow, immediately and carefully add the ribs to the wok. Stir constantly to coat them well with melted sugar. Stir until the ribs turn golden brown, turn off heat.",
    "Tilt the wok and use spatula to place the ribs on one side of the wok. Use a large spoon to scoop out the extra oil and transfer it to a small bowl, until there is only about 1 tablespoon of oil left. (You could transfer the ribs to a plate and then remove the oil, but I found it too time consuming to do so.)",
    "Turn back to medium high heat. Pour the vinegar and soy sauce mixture over the ribs and quickly stir to mix well. Continue to stir until the sauce has reduced and is thick enough to coat the ribs. Stop heat immediately and transfer the ribs to a plate.",
    "Garnish the ribs with chopped green onion. Serve warm."
  ],
  "ingredients": [
    "0",
    "700 grams (1.5 pounds) pork spare ribs, trimmed to 4 centimeters (1.5 inches) in length (*footnote 1), cut into one-bone sections",
    "2 tablespoons shaoxing wine",
    "1 thumb-size ginger, sliced",
    "5 - 6 green onion, white part (save the green part for garnish)",
    "1 whole star anise",
    "2 dried chili pepper",
    "1",
    "2 tablespoons Chinese black vinegar",
    "1 tablespoon light soy sauce",
    "4 tablespoons peanut oil",
    "3 tablespoons sugar"
  ],
  "__v": 1
}