{
  "hash": "d86696ecaefdefb0c12908fc6a5a49f8a454cf5a",
  "title": "PUMPKIN CUPCAKES WITH CREAM CHEESE FROSTING",
  "image": "https://www.browneyedbaker.com/wp-content/uploads/2009/11/pumpkin-cupcakes-15-600.jpg",
  "href": "https://www.browneyedbaker.com/pumpkin-cupcakes-with-cream-cheese-frosting/",
  "extension": "Chrome",
  "firstAdded": "2019-10-07T15:23:00.722000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS:",
    "Make the Cupcakes: Preheat oven to 350 degrees F. Line a 12-cup muffin pan with paper liners; set aside.",
    "In a medium bowl, whisk together the flour, baking powder, baking soda, salt, cinnamon, nutmeg and cloves; set aside.",
    "In a large bowl, whisk together the pumpkin, both sugars and the vegetable oil until completely combined, making sure to break up any chunks of brown sugar so no lumps remain. Whisk in the eggs, one at a time. Add the flour mixture in two additions, folding with a rubber spatula until no flour pockets remain.",
    "Divide the batter between the baking cups, filling each about two-thirds full. Bake until a skewer inserted into the center comes out clean, 18 to 22 minutes. Allow to cool in the pan for 5 to 10 minutes, then remove to a wire rack. Allow the cupcakes to cool completely before frosting.",
    "Make the Frosting: With an electric mixer on medium-high speed, beat the butter until fluffy, 2 to 3 minutes. Add the cream cheese, vanilla and salt and continue to beat for an additional 2 minutes, scraping the sides of the bowl as needed. Reduce the mixer speed to low and add the powdered sugar gradually and mix until smooth and combined, scraping down sides of bowl as needed. Increase the mixer speed to medium-high and beat until light and fluffy, 1 to 2 minutes.",
    "Using a decorating bag and tip (I used the Ateco #827 tip) or an offset spatula, frost the tops of the cupcakes. (If you like the frosting piled high as pictured, this is the perfect amount of frosting. If you prefer less, you can scale the frosting down.) The cupcakes can stay at room temperature for a few hours, but should be refrigerated for longer-term storage up to 4 days."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS:",
    "FOR THE CUPCAKES:",
    "1⅓cupsall-purpose flour",
    "1teaspoonbaking powder",
    "1teaspoonbaking soda",
    "½teaspoonsalt",
    "½teaspoonground cinnamon",
    "Pinch",
    "of ground nutmeg",
    "Pinch",
    "of ground cloves",
    "¾cupcanned pumpkin",
    "½cupgranulated sugar",
    "½cupdark brown sugar",
    "½cupvegetable oil",
    "2eggs",
    "FOR THE CREAM CHEESE FROSTING:",
    "1cupunsalted butter(at room temperature)",
    "8ouncescream cheese(at room temperature)",
    "2½teaspoonsvanilla extract",
    "Pinch",
    "of salt",
    "4cupspowdered sugar"
  ],
  "__v": 1
}