{
  "hash": "534f3805a97ef279c4504e5a59d7f2cf7cd0f31c",
  "title": "Lemon Pepper Chicken & Creamy Rice",
  "image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-02/12/19/enhanced/webdr09/enhanced-27703-1455325011-10.jpg",
  "href": "http://www.buzzfeed.com/clairenolan/if-youre-looking-for-an-easy-one-pot-meal-this-chicken-dish",
  "extension": "Chrome",
  "firstAdded": "2016-03-24T16:18:11.448000",
  "users": [
    null
  ],
  "keywords": [
    "lemon",
    "pepper",
    "paprika",
    "garlic",
    "olive",
    "oil",
    "lbs",
    "chicken",
    "thighs",
    "skin",
    "butter",
    "yellow",
    "onion",
    "arborio",
    "rice",
    "white",
    "wine",
    "broth",
    "milk",
    "parmesan",
    "parsley"
  ],
  "directions": [
    "0",
    "Preheat your oven to 350˚F/ 175˚C.",
    "Combine lemon pepper, paprika, and garlic in a small bowl. In a large oven-proof pot, heat olive oil on medium heat. Season both sides of the chicken and place in the pot skin side down. Cook for three minutes, turn the heat up to medium high and cook for an additional two minutes (or until browned). Turn the chicken over and cook for another 3-4 minutes. Remove chicken from the pot and set aside. (Don’t worry! It will finish cooking when you put it in the oven.)",
    "With a paper towel, carefully wipe out excess fat, leaving the seasoning. On medium high, melt two Tbsp. of butter in the pot and add the diced onions and minced garlic. Cook until onions are translucent (1-2 minutes). Add the rice and stir until it becomes translucent (1-2 minutes). Pour in the white wine and let it cook until most of the wine has evaporated (about two minutes). Add the chicken broth, one cup of milk, and a dash of pepper and stir. Bring it to a simmer. Place the chicken back into the pot. Cover with a lid or foil and bake for 30 minutes (remove lid after 20 minutes).",
    "Remove the chicken from the pot and broil on high for 2-3 minutes or until the skin has nicely browned. Add the other two Tbsp. butter, parmesan, 1/2 cup of milk and parsley to the rice. Stir until well combined. Return the chicken on top of the rice and serve."
  ],
  "ingredients": [
    "0",
    "3 Tbsp. Lemon Pepper",
    "1 Tbsp. Paprika",
    "2 cloves Garlic, minced",
    "1 Tbsp. Olive Oil",
    "2 lbs Chicken Thighs With Skin",
    "4Tbsp. Butter",
    "1 Yellow Onion, diced",
    "4 cloves Garlic, minced",
    "1 1/2 cup Arborio Rice",
    "1/4 cup White Wine",
    "4 cups Chicken Broth",
    "1 1/2 cup Milk",
    "Pepper to taste",
    "1 cup Parmesan",
    "1/4 cup Parsley (Optional)"
  ],
  "__v": 1
}