{
  "hash": "fc4d4fa6e84571bcef203c9e07c8b599e74a5fee",
  "title": "Pot Red Lentil Chili",
  "image": "https://minimalistbaker.com/wp-content/uploads/2016/02/AMAZING-Red-Lentil-CHILI-with-black-beans-and-corn.-Hearty-thick-rich-and-filling-vegan-glutenfree-chili-lentils-recipe.jpg",
  "href": "https://minimalistbaker.com/1-pot-red-lentil-chili/",
  "extension": "Chrome",
  "firstAdded": "2018-12-10T18:36:42.775000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Heat a large pot over medium heat. Once hot, add oil, onion, and red pepper. Season with a healthy pinch each salt and pepper and stir. Sauté for 3-4 minutes, stirring frequently.",
    "Add jalapeño and garlic to a mortar and pestle and crush into a rough paste (alternatively, blend in a small food processor, or finely mince). Add to the pot with onion and red pepper, and season with another pinch salt and pepper.",
    "Add 2/3 of the chili powder (2 Tbsp as original recipe is written), half of the cumin (1 Tbsp as original recipe is written), paprika, diced tomatoes, tomato paste, and water, and stir to combine. Bring to a low boil over medium high heat.",
    "Once boiling, add lentils and reduce heat to medium-low or low, so it's at a gentle simmer. You want to see bubbles, but you don't want it boiling. Cook for 15 minutes, or until lentils are mostly tender. As it's cooking you may need to add more water if the mixture is looking too dry and the lentils aren't submerged (I didn't find that necessary).",
    "Next add kidney beans, black beans, 1/4 tsp each salt and pepper, and remaining cumin (1 Tbsp as original recipe is written) and chili powder (1 Tbsp as original recipe is written), and stir to combine.",
    "Bring to a simmer over medium heat, then reduce heat slightly to low (or medium-low), add corn (optional), cover, and gently simmer for 20 minutes to meld the flavors together. Stir occasionally.",
    "Taste and adjust seasonings as needed, adding more chili powder or cumin for smokiness, salt for saltiness, or a little coconut sugar to balance the heat and draw out the other flavors.",
    "Serve as is, or garnished with chili cheese fritos, fresh jalapeño, cilantro, red onion, and/or avocado (optional).",
    "Store leftovers in the refrigerator up to 4 days, and in the freezer up to 1 month. Reheat on the stovetop, or in the microwave."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "US Customary - Metric",
    "2 Tbsp avocado or coconut oil",
    "1 medium white or yellow onion, diced",
    "1 medium red pepper, diced",
    "1/2 tsp each sea salt and black pepper (divided // plus more to taste)",
    "1 jalapeño , diced with seeds",
    "4 cloves garlic (4 cloves yield ~2 Tbsp)",
    "3 Tbsp chili powder (divided)",
    "2 Tbsp ground cumin (divided)",
    "1 tsp smoked paprika",
    "2 15-ounce cans diced tomatoes (if unsalted, add more sea salt)",
    "3 Tbsp tomato paste",
    "1 3/4 cup water (plus more as needed)",
    "3/4 cup dry red lentils thoroughly rinsed in cold water + drained",
    "1 15-ounce can kidney beans (slightly drained)",
    "1 15-ounce can black beans (slightly drained)",
    "1-2 Tbsp coconut sugar (or maple syrup)",
    "1 15-ounce can corn, drained (optional)",
    "FOR SERVING optional",
    "DIY Chili \"Cheese” Fritos",
    "Rice or Quinoa",
    "Fresh chopped cilantro",
    "Avocado"
  ],
  "__v": 1
}