{
  "hash": "5646b2932b67c18f4eedba0b71479c5e9aa6b515",
  "title": "Greek Chicken with Baked Spaghetti Squash",
  "image": "https://www.flavcity.com/wp-content/uploads/2018/05/greek-chicken-squash-meal-prep-400x300.jpg",
  "href": "https://www.flavcity.com/greek-chicken-meal-prep/",
  "extension": "Chrome",
  "firstAdded": "2019-08-25T23:46:35.859000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Order of cooking:",
    "Roast the squash and cherry tomatoes",
    "Cook the veggies while the squash is roasting",
    "Roast chicken as soon as the squash comes out of the oven or roast at the same time but lower the oven temperature to 375 degrees F. This will increase the squash cooking time by 20 minutes.",
    "Make the tea",
    "For the squash, pre-heat the oven to 400 degrees F. Carefully cut the squash in half from top to bottom and scoop out the seeds. Place squash on a tin foil lined sheet tray and season the inside of the squash with a drizzle of olive oil, a generous pinch of salt, and a couple cracks of pepper. Roast in the oven for 65-75 minutes until the nice and golden on top. You will know the squash is ready when a knife pierces deep in the flesh with ease, if it still feels hard, roast for another 15 minutes.",
    "While the squash is roasting, toss the cherry tomatoes with 1 tablespoon each of olive oil and balsamic vinegar, along with ½ teaspoon salt, and a couple cracks of pepper. Mix well and place on a tin foil lined sheet tray and roast in the oven with the squash for 20 minutes, or until the tomatoes burst and look slightly wilted. Set aside.",
    "Pre-heat a large pan over medium heat with 1.5 tablespoons of olive oil. Add the chopped onions and next 2 ingredients along with ½ teaspoon of salt and a couple cracks of pepper. Cook for 7 minutes, stirring occasionally. Add the garlic and sliced chile peppers and cook for another 4 minutes or until all the veggies have softened. Check for seasoning, you may need a small pinch of salt. Turn off the heat and set aside.",
    "Once the squash has cooled down, use a large fork and rake the squash from top to bottom. Scrape out all of the strands of squash and add them to the pan with the cooked veggies. Turn the heat on medium and cook everything together for 3 minutes, stirring well. Turn off the heat and add the lemon zest, lemon juice, walnuts, and parsley. Mix well and check for seasoning, you will most likely need a pinch of salt and maybe a little more lemon juice. Set aside.",
    "Let the chicken breasts sit at room temperature for 20 minutes before cooking and raise the oven temperature to 400 degrees F. Make the marinade by combining the garlic and next 4 ingredients in a small bowl, whisk well to combine. Place the chicken breasts on a tin foil lined sheet tray and season both sides with a generous pinch of salt and a few grind of pepper. Pour the marinade all over the chicken and roast in the oven for 45 minutes, skin side up. Remove from oven and set aside.",
    "For the tea, bring the water and next 4 ingredients to a low simmer for 7 minutes. Take off heat and add the lemon juice. Strain the tea into serving cups and add 1-2 teaspoons of honey in each cup. If using raw honey, wait for the tea to cool down a little so the heat doesn't destroy some of the nutrients. You can make a double batch and leave the leftover tea in the pot at room temperature overnight.",
    "Prepare you meal prep containers for the week and enjoy!"
  ],
  "ingredients": [
    "0",
    "For the Chicken:",
    "5 bone-in chicken breasts",
    "6 cloves of garlic finely grated or chopped",
    "½ teaspoon each of dried oregano & thyme",
    "Zest of 2 lemons",
    "Juice of 2 lemons",
    "3 tablespoons of olive oil",
    "Kosher salt",
    "Freshly cracked pepper",
    "For the spaghetti squash:",
    "1 large spaghetti squash",
    "8 ounces of cherry tomatoes",
    "½ a red onion chopped",
    "1 red bell pepper thinly sliced",
    "1 bulb of fennel chopped",
    "2 cloves of garlic minced",
    "½ a red hot chile pepper finely sliced or ½ teaspoon red pepper flakes",
    "Zest of 1 lemon",
    "Juice of half a lemon",
    "3 tablespoons freshly chopped Italian flat leaf parsley",
    "2-3 tablespoons of chopped & toasted optional walnuts",
    "1 tablespoon balsamic vinegar",
    "Olive oil",
    "Kosher salt",
    "Freshly cracked pepper"
  ],
  "__v": 1
}