{
  "hash": "c3b87cb9e3d448a8e8612d24c5d864052716b9e1",
  "title": "matzo ball",
  "image": "https://toriavey.com/images/2012/03/MG_1733.jpg",
  "href": "https://toriavey.com/toris-kitchen/perfect-chicken-soup/",
  "extension": "Chrome",
  "firstAdded": "2018-12-11T13:54:52.227000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place the chicken into a large stock pot. Cover with 4 quarts of water.",
    "Bring water to a boil over medium high heat. Let the chicken boil for 10-15 minutes, skimming the foam and particles that rise to the surface of the water periodically, till most of the foam is gone.",
    "Replenish the liquid that was removed during scumming with hot water (it's usually around 1-2 cups). Do a final skimming to remove any leftover foam. Add the carrots, celery, onion, parsley, dill, peppercorns, and cloves to the pot. Add 1 tbsp kosher salt to the water (if you're salt sensitive or using a kosher salted bird, salt less). Bring back to a simmer.",
    "Put the lid on the pot and vent it. Reduce heat to medium low so the soup is slowly simmering (not boiling- a rolling boil will make the stock cloudy, a slow simmer should do it. Let the soup cook for 90 minutes.",
    "After 90 minutes of cooking, when the chicken is tender, turn off the heat. Use a pair of tongs to carefully pull the chicken from the broth. Put it on a plate. Taste the chicken broth and season with additional salt, if desired. Allow the chicken and the broth to cool.",
    "Carefully strain the broth into another pot through a mesh strainer. Reserve the cooked carrots and celery for later, if you wish; discard the spices, herbs, and onion halves.",
    "When the soup is completely cool, you can skim the fat from the top of the broth if you want to-- it will come off in a gel-like layer. I actually don't like to skim the fat, especially for holidays; a few droplets on the surface make the broth silky and give it flavor.",
    "If you are adding the saffron, crush the threads into powder, then stir them into the broth. Saffron adds a depth of flavor and a deep golden color to the broth. It's got a distinctive essence, so don't add it unless you're sure you like it.",
    "Pull the meat from the chicken bones into bite-sized pieces.",
    "If you are cooking something in your broth, like matzo balls or kreplach, bring the broth to a boil and cook them in the broth before adding back in the reserved vegetables or chicken pieces. Do a final tasting and adjust seasoning, adding more salt to taste if desired. Some people prefer to cook their matzo balls in salted water in a separate pot, because a lot of the soup gets soaked up by the matzo balls. Personally I prefer cooking the matzo balls in the soup, as they turn out more flavorful this way. That said, if you're feeding a big crowd and need to stretch your soup, cooking the matzo balls in salted water (or another pot of broth) is the way to go.",
    "Add the cooked vegetables and/or chicken pieces back to the broth at the very end, for the last few minutes of cooking, until warmed through.",
    "Serve hot. Sometimes I add a little more chopped fresh dill to the broth before serving. I love dill."
  ],
  "ingredients": [
    "0",
    "ngredients",
    "3-4 lbs whole chicken",
    "6 large carrots, peeled and sliced",
    "6 celery stalks, peeled and sliced (including leaves)",
    "1 brown (yellow) onion, skin on, rinsed and sliced in two halves",
    "Handful fresh parsley",
    "Handful fresh dill",
    "2 tsp black peppercorns",
    "3 whole cloves (optional- I add more because I like a strong clove flavor)",
    "2 bay leaves",
    "Kosher salt",
    "1/4 tsp saffron threads (optional-- adds a rich yellow color and depth of flavor to the broth; only use hi"
  ],
  "__v": 1
}