{
  "__v": 1,
  "directions": [
    "0",
    "Cut cauliflower, as you would a pie, into 6 pieces if it's a smaller head and 8 pieces if it's a larger one.",
    "Wash and carefully place large cauliflower pieces in a colander to drain.",
    "Combine oil and tomatoes in a large wide pot on medium-high heat. (Since the pot is large, you may need to turn it on to high if your stove burner is small.)",
    "Add ginger, salt, turmeric, cumin, coriander, cayenne, cloves and cinnamon, stir well and sauté for 3 to 4 minutes, or until oil glistens from tomatoes.",
    "Reduce the heat to low while you mix in cauliflower. Carefully place each large piece of cauliflower into the pot and gently stir so that the tomato masala covers all the pieces. If necessary, use a large spoon to ladle tomato masala into the nooks and crannies of the cauliflower pieces.",
    "Increase the heat to medium, cover and cook for 8 to 10 minutes, stirring once halfway through. When you stir, if you notice that the cauliflower isn't cooking, increase the heat. If it's sticking to the bottom of the pot, decrease the heat. Pierce one of the larger pieces with a knife to see if it is soft (not mushy). If necessary, cook cauliflower, covered, for another 1 to 2 minutes. (If florets have broken apart because they overcooked, don't worry; this dish is still delicious.)"
  ],
  "firstAdded": "2014-05-10T01:33:11.514000",
  "hash": "ffb487a29a2865be21dc83f9b41ccf5f793a7806",
  "href": "http://www.today.com/id/42672439/ns/today-today_food/t/vijs-home-lamb-popsicles-cauliflower-steak/",
  "image": "",
  "ingredients": [
    "0",
    "Ingredients",
    "1 head cauliflower, outside stalks cut off",
    "1/2 cup cooking oil",
    "1 1/2 cups puréed or crushed canned tomatoes",
    "1 tablespoon finely chopped ginger",
    "1 1/2 teaspoon salt",
    "1 teaspoon turmeric",
    "1 tablespoon ground cumin",
    "1 tablespoon ground coriander",
    "1 teaspoon ground cayenne pepper",
    "10 cloves (optional)",
    "3-inch cinnamon stick (optional)"
  ],
  "keywords": [
    "head",
    "cauliflower",
    "outside",
    "stalks",
    "cooking",
    "oil",
    "pured",
    "canned",
    "tomatoes",
    "ginger",
    "salt",
    "turmeric",
    "cumin",
    "coriander",
    "cayenne",
    "pepper",
    "cinnamon"
  ],
  "title": "Spicy cauliflower steak",
  "users": [
    null
  ]
}