{
  "hash": "0ee6582fa2e813794b04072e55d53c153d52dbc1",
  "title": "Cauliflower Chickpea Curry",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2014/05/cauliflower-chickpea-curry-horiz-b-1600.jpg",
  "href": "https://www.simplyrecipes.com/recipes/cauliflower_chickpea_curry/",
  "extension": "",
  "firstAdded": "2018-01-28T02:07:35.934000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Sauté curry powder and onion: Heat the oil in a thick-bottomed pot (with lid) on medium heat. Add the curry powder to the oil and let cook for a minute until fragrant.",
    "Add the sliced onion, toss with the curried oil. Let cook until softened about 6 to 8 minutes.",
    "2 Add ginger, chickpeas, tomatoes, cauliflower, bay leaf, salt, pepper, water: Once the onions have softened, add the ginger and the chickpeas, toss to coat with everything.",
    "Add the tomatoes, shredding the whole tomatoes with your fingers as you add them to the pot. Include any tomato juice from the can.",
    "Add the cauliflower florets, the salt, pepper, bay leaf, and water.",
    "3 Simmer until cauliflower is cooked through: Bring to a simmer. Lower the heat and cover. Cook 15 to 18 minutes until the cauliflower is cooked through and tender.",
    "4 Toss with cilantro and mint to serve: Remove from heat. Toss with fresh chopped cilantro and minced mint.",
    "Serve with rice or rice pilaf. If you want dollop a little sour cream or plain yogurt over it (non-vegan option)."
  ],
  "ingredients": [
    "0",
    "1 Tbsp vegetable oil or olive oil",
    "2 teaspoons of yellow curry powder",
    "1 medium yellow onion, cut in half and then sliced across the grain (about 1 1/2 cups sliced onion)",
    "1-inch piece of ginger root, peeled and grated (1 teaspoon grated)",
    "1 1/2 cups cooked chickpeas (garbanzo beans) (a 15-ounce can, rinsed and drained)",
    "1 head cauliflower, cored, florets separated (see How to Cut and Core Cauliflower)",
    "1 15-ounce can of whole, peeled tomatoes",
    "1 teaspoon Kosher salt",
    "1/8 teaspoon freshly ground black pepper",
    "1 bay leaf",
    "1/2 cup water",
    "1/2 cup (packed) roughly chopped cilantro (leaves and young stems)",
    "2 teaspoons minced fresh mint leaves"
  ],
  "__v": 1
}