{
  "hash": "4b5919876967d3b3ac635de99183f2eb5b2ad576",
  "title": "Vegan Green Bean Casserole",
  "image": "http://cdn3.minimalistbaker.com/wp-content/uploads/2014/12/Green-Bean-Casserole-SQUARE.jpg",
  "href": "http://minimalistbaker.com/easyrecipe-print/10840-0/",
  "extension": "Chrome",
  "firstAdded": "2016-12-18T18:57:33.996000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400 degrees and bring a large pot of water to a boil and salt well - it will help season the green beans. Add green beans and cook for 5 minutes, then drain and place in an ice water bath to stop cooking. Drain and set aside.",
    "In the meantime, start preparing sauce. In a large oven-safe skillet over medium heat, add vegan butter or olive oil and shallots and garlic. Season with salt and pepper and stir. Cook for 2-3 minutes, then add mushrooms and season with a bit more salt and pepper. Cook for 3-4 minutes more or until lightly browned.",
    "Sprinkle in flour and whisk to stir and coat the veggies. Cook for 1 minute, then slowly add in veggie stock, whisking to incorporate.",
    "Add almond milk next and whisk to stir again. Season with a touch more salt and pepper bring to a simmer, then reduce heat to low to thicken. Cook for 5-7 minutes more, or until thick and bubbly. Taste and adjust seasonings as needed.",
    "Remove from heat and add 1/2 cup of the fried onions and all of the cooked green beans. Toss to coat well, and top with remaining fried onions.",
    "Bake in 400 degree oven for 15 minutes, or until warmed through and bubbly and slightly browned on top. Serve immediately (handle pan carefully).",
    "Leftovers store well in the fridge for up to a few days."
  ],
  "ingredients": [
    "0",
    "1 pound green beans, rinsed, trimmed and cut in half",
    "Sea salt and black pepper",
    "2 Tbsp vegan butter or olive oil",
    "1 shallot, minced",
    "2 cloves garlic, minced",
    "1 cup finely chopped mushrooms (button, baby bella or cremini)",
    "2 Tbsp all purpose flour",
    "3/4 cup vegetable broth",
    "1 cup unsweetened plain almond milk",
    "1 1/2 cups crispy fried onions (I love Trader’s Brand - check ingredients to ensure vegan friendly), divided"
  ],
  "__v": 1
}