{
  "__v": 1,
  "directions": [
    "0",
    "Combine all dry ingredients: flour, salt, sugar and instant yeast in a bowl. Make a well in the center. Whisk and combine all wet ingredients: milk, egg and tangzhong, then add into the well of the dry ingredients. Knead until you get a dough shape and gluten has developed, then knead in the butter. Mind you, it’d be quite messy at this stage (That's why I used a bread maker). Keep kneading until the dough is smooth, not sticky and elastic. (Tip: you might like to test if the dough is ready. Stretch the dough with two hands. If it forms a thin “membrane” that’s very elastic in texture. Use a finger to poke a hole. If the hole is a circle, not an irregular tear-off (see picture. That means you have successfully kneaded the dough to a perfect stage. Yet, don’t over-knead the dough. Otherwise all the tissues inside would be broken apart.) The time of kneading all depends on how hard and fast you knead. (Note: I use bread maker to do this hardest part and messy job for me. I added the wet ingredients into my bread maker first, then followed by the dry ingredients. The yeast is the last to add.)",
    "Knead the dough into a ball shape. Place in a greased bowl and cover with a wet towel or cling wrap. Let it proof till it's doubled in size, about 40 minutes (Note: the time will vary and depends on the weather. The best temperature for proofing is 28C. I still used my bread maker in this stage. And my bread maker has a heater.)",
    "Transfer to a clean floured surface. Deflate and divide the dough into four to six equal portions. Knead into ball shapes. Cover with cling wrap, let rest for 15 minutes (see picture 2).",
    "Knead each part into a long tube, about 41cm in length (it depends on how long your sausage). Roll to enclose the sausage, with seals facing down (see picture 3). Place rolls on a tray lined with baking paper, covered with cling wrap or a wet towel. Leave it for the 2nd round of proofing, about 45 to 60 minutes, until double in size.",
    "Brush whisked egg on surface of rolls. Bake in a pre-heated 180C (356F) oven for 35 minutes, or until golden brown. Transfer onto a wire rack and let cool completely."
  ],
  "firstAdded": "2014-07-04T18:59:10.922000",
  "hash": "5932a5ae1f0701da269ef3f41072b3be20f665b2",
  "href": "http://en.christinesrecipes.com/2010/03/hong-kong-style-sausage-rolls.html",
  "image": "http://3.bp.blogspot.com/_V0CoK16CILc/S5O5saTsC5I/AAAAAAAAIXQ/VDQ26dwzkxs/s800/%E8%85%B8%E4%BB%94%E5%8C%85%20Sausage%20Rolls01.jpg",
  "ingredients": [
    "0",
    "4 to 6 sausages, any kind to your liking",
    "350 gm bread flour",
    "55 gm caster sugar",
    "5 gm salt",
    "56 gm egg",
    "7 gm milk powder (to increase fragrance, optional)",
    "125 ml milk",
    "120 gm tangzhong (refer to this recipe for making tanzhong)",
    "5 to 6 gm instant yeast",
    "30 gm butter (cut into small pieces, softened at room temperature)"
  ],
  "keywords": [
    "sausages",
    "kind",
    "liking",
    "bread",
    "flour",
    "caster",
    "sugar",
    "salt",
    "egg",
    "milk",
    "increase",
    "fragrance",
    "tangzhong",
    "refer",
    "recipe",
    "making",
    "tanzhong",
    "instant",
    "yeast",
    "butter",
    "pieces",
    "softened",
    "room"
  ],
  "title": "Hong Kong Style Sausage Rolls",
  "users": [
    null
  ]
}