{
  "hash": "ad15bea6fd116d2bd5a7b49a9001523219e3e0de",
  "title": "Crockpot BBQ Ranch Chicken Tacos",
  "image": "https://www.chelseasmessyapron.com/wp-content/uploads/2015/07/Crockpot-BBQ-Ranch-Chicken-Tacos-easy-and-delicious-150x150.jpg",
  "href": "https://www.chelseasmessyapron.com/crockpot-bbq-ranch-chicken-tacos/",
  "extension": "Firefox",
  "firstAdded": "2020-06-03T01:17:30.336000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Cut the chicken breasts in half so you have four big pieces.",
    "Spray a slow cooker with nonstick spray.",
    "In the slow cooker, place the chicken, garlic, and chicken broth. Cook on high for 3-4 hours or low for 6-7 hours until the chicken is very tender and shreds easily.",
    "Drain the slow cooker and shred the chicken with two forks.",
    "Measure the chicken, you should have 3 cups when shredded. If you weren't able to weigh your chicken and since chicken breasts vary in size, if you don't have this much or you have more, adjust the sauce to the amount you have.",
    "For the sauce, in a large bowl, mix together the BBQ sauce, seasoning mix, brown sugar, Worcestershire sauce, yellow mustard, and pepper.",
    "Pour the sauce mixture over the chicken, stir, and cook for another 30-45 minutes on low. (25-30 minutes if you have a hot slow cooker)",
    "Place the chicken inside the tortilla shells and top with the toppings of your choice"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 (~1 and 1/2 pounds) very large boneless skinless chicken breasts",
    "1 teaspoon minced garlic",
    "1 and 1/2 cups chicken broth",
    "2 cups BBQ sauce * best quality recommended",
    "1 package (1 ounce) Ranch Salad Dressing & Seasoning Mix dry",
    "1 tablespoon brown sugar packed",
    "1/2 tablespoon Worcestershire sauce",
    "1 teaspoon yellow mustard",
    "1/4 teaspoon pepper",
    "Tortilla shells",
    "Toppings such as: cheddar cheese, shredded iceberg lettuce, chopped tomato, cilantro, squeeze of lime, chopped red onion, sour cream"
  ],
  "__v": 1
}