{
  "hash": "4bc00babbc8e243224a147902906c530ef4cd002",
  "title": "Emeril Lagasse'S Ham Glaze",
  "image": "http://recipe-folder.com/img/recipe-images/022/079/1744697122.jpeg",
  "href": "http://www.food.com/recipe/emeril-lagasses-easter-feast-spiced-honey-and-lemon-baked-ham-365737",
  "firstAdded": "2015-01-06T20:35:07.505000",
  "users": [
    null
  ],
  "keywords": [
    "bonein",
    "hickory",
    "smoked",
    "spiral",
    "ham",
    "honey",
    "light",
    "brown",
    "sugar",
    "lemon",
    "juice",
    "dry",
    "mustard",
    "ginger",
    "black",
    "pepper",
    "nutmeg"
  ],
  "directions": [
    "0",
    "Preheat the oven to 350 degrees F. Line a shallow baking sheet with parchment paper or aluminum foil and set a wire baking rack on top.",
    "Using kitchen twine, tie the ham at 2 to 3-inch intervals both horizontally and vertically. This will hold the slices together as well as help the ham remain moist while baking. Position the ham (bottom side up) on the rack.",
    "Combine the remaining ingredients in a small bowl and whisk together. Pour 1/4 cup glaze evenly over the ham, then turn the ham so that the uncoated side is up. Pour 1/2 cup glaze evenly over the top.",
    "Bake the ham for 30 minutes. Remove ham from the oven and brush with remaining glaze. Bake 30 minutes longer. Baste the ham a final time with the juices that have accumulated on the bottom of the pan and cook 10 minutes longer, or until the ham is heated through and the edges are nicely browned.",
    "Remove the ham from the oven and let it rest for 5 minutes. Remove and discard the kitchen twine and transfer the ham to a serving platter. Carefully pour any accumulated glaze/cooking juices from the baking sheet into a small gravy boat or container. Brush the ham a final time with the glaze. Serve ham hot or at room temperature. Leftover ham is delicious in sandwiches.",
    "Note: If ham begins to brown excessively before it is heated through, tent loosely with aluminum foil and continue cooking."
  ],
  "ingredients": [
    "0",
    "1 bone-in hickory smoked spiral sliced ham, cooked (8 to 10 pounds)",
    "3/4 cup honey",
    "1/2 cup light brown sugar",
    "1/4 cup lemon juice",
    "1 teaspoon dry mustard",
    "1/2 teaspoon ground ginger",
    "1/2 teaspoon ground cloves",
    "1/2 teaspoon fresh ground black pepper",
    "1/4 teaspoon grated nutmeg"
  ],
  "__v": 1
}