{
  "__v": 1,
  "directions": [
    "0",
    "Remove the rice noodles from packaging, and measure out 1.5 oz. Place it in a zip lock bag. Grab the ziplock bag with your hands and carefully break up the noodles into smaller pieces. Set aside.",
    "Wipe the jar clean, and add in all ingredients from soy sauce through to baby spinach, in that order.",
    "Then pack the broken up noodles into the jar. Screw on the lid and store in the refrigerator for upto a day.",
    "When you are ready to eat, pour boiling water into the jar. Pour in enough water to cover the noodles, about 1 1/2 cups. Replace the lid and let the noodles soak for about 12 minutes or till they have softened. Mix the soup gently so that the stock cube dissolves evenly. Be careful, the jar will be very hot, use a towel or oven mitts to handle the jar.",
    "Note: Adding hot water to a very cold glass jar can cause the glass to crack! If your jar is very cold (or if your fridge is set to very cold), leave the jar out at room temparature for about 15 minutes before adding hot water.",
    "5. Tip your almost instant noodle soup into a bowl and serve. Or eat it directly from the jar!"
  ],
  "firstAdded": "2014-08-18T20:39:11.555000",
  "hash": "0ceeb795a6f1edd374b835b6b6db8702c78f396b",
  "href": "http://www.veggiebelly.com/2013/11/almost-instant-noodle-soup-recipe.html",
  "image": "http://www.veggiebelly.com/wp-content/upLoads/2013/11/instant-noodles-in-jar-hot-water.jpg",
  "ingredients": [
    "0",
    "an approximately 16 oz glass jar, preferably a wide mouth one, with lid",
    "1.5 oz rice noodle sticks",
    "1 tablespoon soy sauce",
    "1/2 teaspoon lime juice",
    "1/4th of a stock cube",
    "1/8th teaspoon garlic powder, optional",
    "1/4th teaspoon grated ginger, optional",
    "½ cup shredded carrot",
    "½ cup shredded napa cabbage",
    "12 leaves of baby spinach"
  ],
  "keywords": [
    "glass",
    "jar",
    "preferably",
    "wide",
    "mouth",
    "lid",
    "rice",
    "noodle",
    "soy",
    "lime",
    "juice",
    "stock",
    "cube",
    "garlic",
    "ginger",
    "carrot",
    "napa",
    "cabbage",
    "leaves",
    "baby",
    "spinach"
  ],
  "title": "Almost Instant Noodle Soup in a Jar Recipe",
  "users": [
    null
  ]
}