{
  "hash": "89091fb487dfa5a5a6c00c540ba2e364746d8f6e",
  "title": "Air-fried General Tso’s Chicken",
  "image": "",
  "href": "https://www.cookinglight.com/recipes/air-fried-general-tso-chicken",
  "extension": "",
  "firstAdded": "2018-12-26T21:52:31.260000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Beat egg in a large bowl, add chicken, and coat well.",
    "In another bowl, combine 1/3 cup cornstarch with salt and pepper.",
    "Transfer chicken with a fork to cornstarch mixture, and stir with a spatula to coat every piece.",
    "Transfer chicken to air-fryer oven racks (or fryer basket, in batches), leaving a little space between pieces.",
    "Preheat air-fryer at 400°F for 3 minutes. Add the battered chicken; cook for 12 to 16 minutes, giving things a shake midway.",
    "Let dry 3 to 5 minutes. If chicken is still damp on one side, cook for 1 to 2 minutes more.",
    "Whisk together remaining 2 teaspoons cornstarch with broth, soy sauce, ketchup, sugar, and rice vinegar.",
    "Heat canola oil and chiles in a large skillet over medium heat.",
    "When gently sizzling, add the ginger and garlic; cook until fragrant, about 30 seconds.",
    "Re-whisk cornstarch mixture; stir into mixture in skillet. Increase heat to medium-high.",
    "When sauce begins to bubble, add chicken.",
    "Stir to coat; cook until sauce thickens and nicely clings to chicken, about 1 1/2 minutes.",
    "Turn off heat; stir in 1 tablespoon green onion and sesame oil.",
    "Transfer to a serving plate, and top with sesame seeds and remaining 1 tablespoon green onion."
  ],
  "ingredients": [
    "0",
    "1 large egg",
    "1 pound boneless, skinless chicken thighs, patted dry and cut into1 to 1 1/4-inch chunks",
    "1/3 cup plus 2 tsp. cornstarch, divided",
    "1/4 teaspoon kosher salt",
    "1/4 teaspoon ground white pepper",
    "7 tablespoons lower-sodium chicken broth",
    "2 tablespoons lower-sodium soy sauce",
    "2 tablespoons ketchup",
    "2 teaspoons sugar",
    "2 teaspoons unseasoned rice vinegar",
    "1 1/2 tablespoons canola oil",
    "3 to 4 chiles de árbol, chopped and seeds discarded",
    "1 tablespoon finely chopped fresh ginger",
    "1 tablespoon finely chopped garlic",
    "2 tablespoons thinly sliced green onion, divided",
    "1 teaspoon toasted sesame oil",
    "1/2 teaspoon toasted sesame seeds"
  ],
  "__v": 2
}