{
  "hash": "aeb611fe5acdc6176dff0cf112827e71690e8e7a",
  "title": "Oatmeal Soda Bread",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2013/03/oatmeal-soda-bread-horiz-a-1200.jpg",
  "href": "http://www.simplyrecipes.com/recipes/oatmeal_soda_bread/?utm_campaign=yummly&utm_medium=yummly&utm_source=yummly",
  "extension": "Firefox",
  "firstAdded": "2017-12-24T16:27:01.963000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Preheat oven to 450°F. Place oats in a food processor and pulse until finely ground.",
    "2 In a large bowl, vigorously whisk together the finely ground oats, flour, baking soda, sugar, and salt.",
    "3 Stir the buttermilk and egg together. Make a well in the middle of the flour mixture and pour in the buttermilk egg mixture.",
    "Gently fold the surrounding flour over the buttermilk with a wooden spoon. Continue to gently fold until just combined. Do not over mix! The dough should look very shaggy. It should be on the moist side. If it is too wet to handle, add a little more flour. If too dry, add a little more buttermilk.",
    "4 Place dough on a lightly flour dusted surface. Knead one or two times only, and form into a mound shape. Grease a large cast iron frying pan with a little butter and place the dough in the center. (If you don't have a cast iron frying pan, just put on a greased baking sheet that can take high heat.)",
    "Score the center of the dough in a cross shape with a sharp knife, making 1 1/2 inch deep cuts.",
    "5 Place in the oven and bake for 15 minutes at 450°F (230 °C). Then lower the oven temperature to 400°F (205°C) and cook for 25 minutes more.",
    "To test if the bread is done, take it out of the oven, turn it over and knock on the bottom. If it sounds hollow, it's done.",
    "6 Remove pan from oven and let sit for 10 minutes. Note, take care with the hot handles of the cast iron pan! I never leave this one to chance (after having burned myself pretty badly once picking up a hot pan), and I rub an ice cube over the hot handle to cool it down, so that someone doesn't inadvertently pick up the pan by the handle.",
    "Remove bread from pan and let cool further on a wire rack for another 15 minutes or so. The bread is best if eaten within hours of baking. Serve with butter and jam. If saving for later, wrap in a slightly damp clean tea towel."
  ],
  "ingredients": [
    "0",
    "2 cups (170 g) old fashioned rolled oats",
    "2 1/4 cups (290 g) all purpose flour plus more for dusting",
    "2 teaspoons baking soda",
    "1 teaspoon sugar",
    "1 teaspoon kosher salt",
    "1 1/2 cups (350 ml) buttermilk",
    "1 egg, lightly beaten",
    "Butter for greasing the pan"
  ],
  "__v": 1
}