{
  "__v": 1,
  "directions": [
    "0",
    "Add the sliced potatoes to a large saucepan and add enough water to cover the potatoes. Add ½ teaspoon of the salt to the pot. With the heat on high, bring the water to a boil. Once it reaches a boil, reduce the heat to medium and simmer for about 15 minutes, until the potatoes are tender. Drain the potatoes and then add to a large bowl. Use a potato masher to mash the potatoes. Add the remaining ¼ teaspoon salt, cumin, chili powder, oregano and chipotle peppers. Mix until well combined.",
    "In a medium skillet, heat the olive oil over medium heat. When hot, add in the kale and green onions. Cook for about 2 to 3 minutes, until the kale is bright green and tender. Add the mixture to the bowl with the mashed sweet potatoes. Next add in the black beans and mix until well combined.",
    "Place the tortillas on a work surface. Use a spatula to smear about ⅓ to ½ cup of the filling on half of the tortilla. Top with about ¼ cup of the cheese (or to taste). Fold the empty half of the tortilla over the filling to form a semicircle. Repeat with remaining tortillas.",
    "Wipe out the skillet you used for the kale and set over medium high heat. When hot, spray lightly with nonstick cooking spray. Place an assembled quesadilla in the pan and cook, flipping once halfway through, until both sides are browned and the cheese is melted. Cut into triangles and serve with hot sauce, greek yogurt and/or salsa."
  ],
  "firstAdded": "2014-10-20T07:38:47.140000",
  "hash": "a7fae79ea92a65b82be42b3398c009a5f732839f",
  "href": "http://cookiemonstercooking.com/2013/03/04/sweet-potato-black-bean-and-kale-quesadillas/",
  "image": "http://cdn.cookiemonstercooking.com/wp-content/uploads/2013/03/Sweet-potato-black-bean-and-kale-quesadillas-web-1.jpg",
  "ingredients": [
    "0",
    "3 medium sweet potatoes, sliced ½ inch thick*",
    "¾ teaspoon salt, divided",
    "½ teaspoon cumin",
    "½ teaspoon chili powder",
    "¼ teaspoon oregano",
    "1 to 2 chipotle peppers in adobo sauce, minced",
    "½ tablespoon olive oil",
    "3 cups chopped kale",
    "3 green onions, thinly sliced",
    "1 can black beans, drained and rinsed",
    "8 to 10 large flour tortillas",
    "2 to 2 ½ cups freshly grated cheddar cheese",
    "hot sauce, optional",
    "greek yogurt or sour cream, optional",
    "salsa, optional"
  ],
  "keywords": [
    "medium",
    "potatoes",
    "salt",
    "divided",
    "cumin",
    "chili",
    "oregano",
    "chipotle",
    "peppers",
    "adobo",
    "olive",
    "oil",
    "kale",
    "green",
    "onions",
    "black",
    "beans",
    "rinsed",
    "flour",
    "tortillas",
    "cheddar",
    "cheese",
    "hot",
    "greek",
    "yogurt",
    "sour",
    "cream",
    "salsa"
  ],
  "title": "Sweet Potato, Black Bean and Kale Quesadillas",
  "users": [
    null
  ]
}