{
  "hash": "e1b9e312b9b7580014ece35d9c4e9acf8e71a330",
  "title": "Honey Lavender Lemonade, Chipotle BBQ Grilled Chicken and Apple Slaw with Mint Vinaigrette",
  "image": "//media.foodnetwork.ca/recipetracker/dmm/H/O/Honey_Lavender_Lemonade__Chipotle_BBQ_Grilled_Chicken_and_Apple_Slaw_with_Mint_Vinaigrette_001.jpg",
  "href": "https://www.foodnetwork.ca/recipe/honey-lavender-lemonade-chipotle-bbq-grilled-chicken-and-apple-slaw-with-mint-vinaigrette/12387/",
  "extension": "Chrome",
  "firstAdded": "2018-08-21T11:52:42.542000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place sugar and water in a small pot over medium heat. Bring to a boil and remove once sugar dissolves.",
    "Add lavender flowers, honey and citric acid to pot, stir. Set aside to cool.",
    "Place water and lemon juice in a large pitcher. Strain honey lavender syrup, add to pitcher and stir. Place in fridge until serving.",
    "1. Heat oil in a large pot over medium heat. Add onions, season with salt and pepper, sauté until caramelized, approximately 7- 10 minutes.",
    "2. Add remaining ingredients, stir to incorporate. Simmer for 1 ½ hours.",
    "3. Puree with immersion blender until smooth, set aside until grilling chicken.",
    "1. Place buttermilk, garlic, chipotle with adobo sauce and black pepper in a blender. Puree until smooth.",
    "2. Place chicken thighs in a large container. Add buttermilk adobo mixture, massage into chicken and place in fridge to marinate overnight.",
    "3. Preheat grill to medium heat and brush with vegetable oil.",
    "4. Remove chicken from marinade, season with salt and place on grill.",
    "5. Grill chicken 3-4 minutes per side, lower heat to medium-low and baste with BBQ Sauce.",
    "6. Continue to grill at medium low heat for 6-8 minutes, flipping chicken and basting until chicken is cooked.",
    "7. Remove from heat, tent with foil to keep warm.",
    "1. Place sugar and vinegar in a small pot over medium heat. Bring to a boil until sugar dissolves. Remove from heat.",
    "2. Add mint stems, garlic and shallots, stir. Set aside for 10 minutes to infuse flavour and cool.",
    "3. Strain vinegar and sugar mixture into a medium bowl.",
    "4. Slowly whisk olive oil into the mixture, set aside until assembling Apple Slaw.",
    "1. Place cabbage and salt in a large bowl. Toss, set aside for 30 minutes to wilt cabbage.",
    "2. Rinse salt from cabbage, strain, pat dry and place in a large bowl.",
    "3. Add apples, Mint Vinaigrette and mint leaves to cabbage. Season with salt and pepper. Toss and set aside until assembly.",
    "1. Place one piece of BBQ Grilled Chicken on a plate.",
    "2. Spoon Apple Slaw with Mint Vinaigrette beside BBQ Grilled Chicken.",
    "3. Serve with a cold glass of Honey Lavender Lemonade."
  ],
  "ingredients": [
    "0",
    "1 cup sugar",
    "1 cup water",
    "2 Tbsp lavender flowers, dried",
    "½ cup honey",
    "¼ tsp citric acid",
    "7 cup cold water",
    "2 cup lemon juice (approx. juice of 8 lemons)",
    "2 Tbsp vegetable oil",
    "3 sweet onions, diced",
    "3 L ketchup",
    "⅓ cup chipotle in adobo sauce",
    "1 Tbsp mustard powder",
    "1 cup brown sugar",
    "2 cup apple cider vinegar",
    "salt and pepper",
    "1 L buttermilk",
    "3 clove garlic, smashed",
    "⅓ cup chipotle in adobo sauce",
    "1 tsp black pepper",
    "8 chicken thighs, deboned, skin on",
    "vegetable oil for grilling",
    "salt",
    "barbeque sauce",
    "3 Tbsp sugar",
    "¼ cup white vinegar",
    "2 bunch mint, leaves picked for Apple Slaw recipe, stems reserved",
    "3 clove garlic, sliced",
    "2 shallots, sliced",
    "3 Tbsp extra virgin olive oil",
    "½ green cabbage, julienned",
    "2 Tbsp salt, plus extra for seasoning",
    "2 Granny Smith apples, julienned",
    "mint leaves from Mint Vinaigrette recipe, finely chopped",
    "Mint Vinaigrette",
    "pepper",
    "1 Honey Lavendar Lemonade",
    "1 Chipotle BBQ Grilled Chicken",
    "1 Apple Slaw with Mint Vinaigrette"
  ],
  "__v": 1
}