{
  "hash": "406a4c4555abba1d99205e174f6bf3df526bd891",
  "title": "Revolutionary Pancakes",
  "image": "http://www.mynewroots.org/site/wp-content/uploads/2015/05/pancake2.jpg",
  "href": "http://www.mynewroots.org/site/page/3/",
  "extension": "",
  "firstAdded": "2015-11-25T22:52:20.151000",
  "users": [
    null
  ],
  "keywords": [
    "revolutionary",
    "pancakes",
    "buckwheat",
    "groats",
    "glutenfree",
    "quinoa",
    "millet",
    "amaranth",
    "work",
    "parts",
    "water",
    "need"
  ],
  "directions": [
    "0",
    "Directions:",
    "1. Soak buckwheat and other grain overnight in pure water with an acidic medium (such as apple cider vinegar or lemon juice, read more about that here). In the morning, drain and rinse well.",
    "2. Place grains in a blender with water equal to the volume of grains used (if you used 1/2 cup buckwheat and 1/2 cup quinoa, use 1 cup water). Blend on highest setting until smooth, and add more water if needed. The consistency should be like pancake batter: fluid and pour-able but not thin and watery. Add any other elements you’d like, but try to maintain the consistency – add more water if necessary.",
    "3. Heat a large skillet or griddle with just a little bit of coconut oil or ghee. When hot, pour desired amount of batter onto the skillet, wait until bubbles form on the top and the batter becomes almost opaque, then flip. I recommend starting the first batch off in a really hot pan, then lowering the heat slightly to cook the rest. No need to add fat to the pan after the first round – once the pan is hot enough the pancakes should cook without the need for any additional oil.",
    "4. Serve hot with desired toppings. Store leftovers in the fridge for up to three days. Freeze extras and reheat in a toaster oven before enjoying."
  ],
  "ingredients": [
    "0",
    "Revolutionary Pancakes",
    "Ingredients:",
    "1 part buckwheat groats",
    "1 part other gluten-free grain (quinoa, millet and amaranth all work well)",
    "about 2 parts water, as need"
  ],
  "__v": 1
}