{
  "hash": "1c17bb402651f218122f9f8f098c4e54b72dce7f",
  "title": "White Pizza with Pecorino, Scallions, and Egg",
  "image": "http://ob8qxdtnu3-flywheel.netdna-ssl.com/wp-content/uploads/2014/08/Onion-Egg-Pizza-002.jpg",
  "href": "http://www.acouplecooks.com/2014/08/white-pizza-pecorino-scallions-egg-4-years/",
  "extension": "Chrome",
  "firstAdded": "2016-03-31T17:01:15.926000",
  "users": [
    null
  ],
  "keywords": [
    "scallions",
    "green",
    "onions",
    "mozzarella",
    "cheese",
    "pecorino",
    "romano",
    "eggs",
    "pizza",
    "dough",
    "olive",
    "oil",
    "kosher",
    "salt"
  ],
  "directions": [
    "0",
    "Prepare the dough using either the stand mixer or food processor methods (you also can knead by hand; follow this video instruction for more). Follow the preparation instructions in the dough recipe if prepared in advance.",
    "Place a pizza stone in the oven and preheat to 475°F.",
    "Prepare the toppings: Slice the green parts off of the scallions so they form long ribbons. In a small skillet, heat ½ tablespoon olive oil. Add the scallions and sauté until slightly tender, stirring, for 1 minute. Remove from the heat.",
    "When the oven is ready, stretch the dough into a circle (see this video for instructions). Place the dough on a floured pizza peel or pull the pizza stone out of the oven and carefully place the dough on it.",
    "Quickly assemble the pizza: Brush olive oil over the dough and sprinkle with kosher salt. Sprinkle ¾ cup mozzarella cheese, then ½ cup Pecorino cheese. Top with scallions. Carefully crack two eggs on top and sprinkle with a bit of kosher salt.",
    "Bake the pizza: Transfer the pizza to the oven on the pizza peel, and bake until the egg white is set and the yolk is still runny, about 7 minutes."
  ],
  "ingredients": [
    "0",
    "4 scallions (green onions)",
    "¾ cup shredded mozzarella cheese",
    "½ cup shredded Pecorino Romano cheese",
    "2 eggs",
    "1 pizza dough",
    "Olive oil",
    "Kosher salt"
  ],
  "__v": 1
}