{
  "__v": 1,
  "directions": [
    "0",
    "For the butter, mix all of the ingredients together in a large bowl, then beat well with a wooden spoon until there are no lumps of butter left. Spoon onto a large sheet of cling film, then wrap tightly in a sausage shape. Chill until firm (or put in the freezer if you’re short of time).",
    "Set up a pan with a steamer or suspend a heatproof colander over the top of a pan. Cut the leeks in half lengthways, then slice into long strips, about the thickness of tagliatelle. Cover, then steam for 6 mins until tender, with no signs of squeakiness. Season, then set aside.",
    "Dry the scallops on kitchen paper and season. Heat a heavy-based pan, then add the oil. Once hot, add the scallops, keeping them close together – this helps the sides to stay straight and tall rather than sagging. Sizzle for 2 mins until caramelised and you can see the heat creeping up the outside. Turn over with a palette knife, then fry for 1 min more. Take off the heat, then add a few good slices of the butter to the pan, spooning over the scallops as it melts.",
    "To serve, wind a nest of warm leeks in the centre of 4 plates, top each with 3 scallops, spoon over the buttery sauce (it looks smart trickled around the plate), then sprinkle with the remaining parsley. Squeeze over a little lemon juice before you tuck in."
  ],
  "firstAdded": "2014-06-26T11:41:38.393000",
  "hash": "73c37ba6c2ace3ca4f964b653cb63fa9c02e72e1",
  "href": "http://www.bbcgoodfood.com/recipes/6669/seared-scallops-with-leeks-and-lemon-chilli-butter",
  "image": "http://www.bbcgoodfood.com/sites/bbcgoodfood.com/files/recipe_images/recipe-image-legacy-id--10383_11.jpg",
  "ingredients": [
    "0",
    "4 young, but not baby leeks leeks, trimmed",
    "12 scallops, roes on or off",
    "1 tbsp light olive oil",
    "lemon wedges, to serve",
    "1",
    "250g pack butter, softened",
    "1 red chilli, deseeded and finely chopped",
    "2 garlic cloves, crushed",
    "zest 2 lemon",
    "bunch parsley, leaves chopped, plus extra to serve"
  ],
  "keywords": [
    "young",
    "baby",
    "leeks",
    "trimmed",
    "scallops",
    "roes",
    "light",
    "olive",
    "oil",
    "lemon",
    "wedges",
    "serve",
    "pack",
    "butter",
    "softened",
    "red",
    "chilli",
    "deseeded",
    "garlic",
    "zest",
    "bunch",
    "parsley",
    "leaves",
    "extra"
  ],
  "title": "Seared scallops with leeks & lemon chilli butter",
  "users": [
    null
  ]
}