{
  "hash": "7995644ba18c55792188ae8cea3cebb909a1cf61",
  "title": "Xacuti",
  "image": "http://www.ndtv.com/cooks/images/chicken-xacuti-tara_med.jpg",
  "href": "http://food.ndtv.com/recipe-xacuti-385454",
  "extension": "Chrome",
  "firstAdded": "2015-12-24T16:06:30.008000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "skinned",
    "pieces",
    "bone",
    "washed",
    "oil",
    "bay",
    "leaves",
    "onion",
    "salt",
    "spice",
    "cinnamon",
    "black",
    "peppercorns",
    "coriander",
    "seeds",
    "cumin",
    "kashmiri",
    "chillies",
    "stalk",
    "long",
    "green",
    "roughly",
    "garlic",
    "coconut",
    "unsalted",
    "cashew",
    "nuts",
    "white",
    "poppy",
    "water"
  ],
  "directions": [
    "0",
    "For the spice paste, heat oil in a pan and add cinnamon stick, cloves, black peppercorns, coriander seeds, cumin seeds and kashmiri chillies. Mix in the onion and saute the mixture till the onions caramelize. Cool the mixture and grind with a little water. Add the green chillies, ginger paste, garlic paste and grind again to a fine consistency.",
    "For the coconut paste, heat oil on medium heat in a pan. Toast the cashew nuts, poppy seeds and coconut till they are a light golden brown. Cool and grind with a little water.",
    "For the chicken, heat oil in a pan, add bay leaves and saute for 30 seconds. Add the onions and saute till a pale pink. Mix the spice paste and saute, stirring continuously, until it thickens and releases oil. Put the heat on high, add chicken and mix well in the spices. Add a cup of water, cover the pan and let simmer for 15 minutes.",
    "Now, add the coconut paste, a little water and cook uncovered for 5 minutes. Add salt (to taste). Cool and refrigerate overnight.",
    "Reheat next day over low heat while stirring. Serve hot with bread or plain boiled white rice.",
    "Key Ingredients: Chicken, vegetable oil, onion, salt, cinnamon, cloves, black pepper, coriander seeds, cumin seeds, kashmiri mirch, green chillies, garlic, poppy seeds, bay leaf, cashew nuts, desiccated coconut"
  ],
  "ingredients": [
    "0",
    "For the chicken:",
    "800-900 gm skinned chicken pieces with bone, washed",
    "4 Tbsp oil",
    "2 bay leaves",
    "1 onion, finely chopped",
    "Salt",
    "For the spice paste:",
    "2 Tbsp oil",
    "1 cinnamon stick",
    "4 cloves",
    "4 black peppercorns",
    "1 Tsp coriander seeds",
    "2 tsp cumin seeds",
    "5-6 kashmiri chillies, stalk and seeds removed",
    "1 onion, finely chopped",
    "3 long green chillies, roughly chopped",
    "8 garlic cloves, chopped",
    "For the coconut paste:",
    "2 Tbsp oil",
    "1/4 cup unsalted cashew nuts",
    "2 Tsp white poppy seeds",
    "1/2 cup unsweetened grated coconut",
    "Water"
  ],
  "__v": 3
}