{
  "hash": "0d0a491b92c08bdb48f5b9753f8d2b514d99bca3",
  "title": "Shepherd’s Pie",
  "image": "http://picturetherecipe.com/wp-content/uploads/2012/04/Shepherds-Pie-Final-copy1.jpg",
  "href": "http://picturetherecipe.com/index.php/recipes/shepherds-pie/",
  "extension": "Chrome",
  "firstAdded": "2015-12-27T21:50:32.646000",
  "users": [
    null
  ],
  "keywords": [
    "beef",
    "olive",
    "oil",
    "onion",
    "garlic",
    "medium",
    "carrots",
    "stalks",
    "celery",
    "frozen",
    "peas",
    "herb",
    "italian",
    "seasoning",
    "worcestershire",
    "tomato",
    "parsley",
    "potatoes",
    "skinned",
    "boiled",
    "butter",
    "cream",
    "salt",
    "pepper",
    "egg",
    "wash"
  ],
  "directions": [
    "0",
    "– Heat some olive oil in a deep pan.",
    "– Toss in the finely diced onion and sautee till it turns soft and translucent.",
    "– Add the finely chopped garlic and sautee it with the onions for a couple minutes.",
    "– Then add the diced carrots, celery and frozen green peas to the pan and mix together.",
    "– Add the ground beef, spread it well and let it brown on medium-high heat along with all the veggies.",
    "– Once the meat is browned season the meat well with salt, pepper, the italian seasoning herbs and worcestershire sauce. Stir well.",
    "– Then pour in a cup of tomato sauce, mix well and bring to a boil. Then put a lid on, lower the heat and let the sauce simmer for 10 minutes or so while you prepare the mashed potatoes. Just before you turn off the heat, stir in some freshly chopped parsley.",
    "– Peel, cut and boil the potatoes in well salted water. Then drain them and toss them in a mixing bowl.",
    "– Add the butter,cream and garlic powder (optional) to them while still hot and mash them with a potato masher. Season it with salt and pepper according to your taste.",
    "– To assemble the dish, spoon the ground beef mix in the bottom of a casserole dish, or small oven proof individual serving dishes.",
    "– You can then spoon or pipe (to make it a little fancier) the mashed potatoes over the top. If you spoon it, flatten it a little over the top and with a fork make some lines on top. the ridges are what will brown and form a nice crust.",
    "– Lightly brush a little egg wash (an egg beaten with a teaspoon of water) on the ridges of the mashed potatoes. Pop it into the oven at 400F for around 10-15 minutes. Then stick them under the broiler for another few minutes (4-5) until the mashed potato topping froms a nice golden brown crust.",
    "– Garnish with a sprig of fresh parsley."
  ],
  "ingredients": [
    "0",
    "1 lb ground beef",
    "2 tbsp Olive Oil",
    "1/2 large onion, finely chopped",
    "3-4 cloves of garlic, finely minced",
    "2 medium carrots, finely diced",
    "2 stalks of celery, finely diced",
    "3/4 cup of frozen peas",
    "1 tsp dried herb Italian Seasoning",
    "1 tbsp Worcestershire sauce",
    "1 cup Tomato sauce",
    "A handful of fresh parsley, finely chopped",
    "3-4 medium potatoes, skinned & boiled.",
    "3 tbsp butter",
    "2/3 cup of cream",
    "Salt Pepper to taste.",
    "1 egg (for egg wash)"
  ],
  "__v": 1
}