{
  "hash": "2934c8fcedd376c23c5c6d28314463b8a97066cf",
  "title": "Saffron Custard Tart With Figs and Blackberries [Vegan]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/04/tart4.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/saffron-custard-tart-with-figs-and-blackberries/",
  "extension": "Chrome",
  "firstAdded": "2015-05-27T08:43:15.798000",
  "users": [
    null
  ],
  "keywords": [
    "organic",
    "turkish",
    "figs",
    "split",
    "flakesrolled",
    "buckwheat",
    "flour",
    "mixed",
    "nuts",
    "used",
    "hazelnuts",
    "walnuts",
    "egg",
    "milled",
    "chia",
    "water",
    "odourless",
    "coconut",
    "oil",
    "grease",
    "tart",
    "pan",
    "plain",
    "rice",
    "milk",
    "vanilla",
    "bean",
    "pod",
    "barley",
    "malt",
    "sweetener",
    "orange",
    "blossom",
    "agar",
    "kuzu",
    "diluted",
    "arrowroot",
    "cornstarch",
    "saffron",
    "rustic",
    "fig",
    "nut",
    "crust",
    "vegan",
    "custard",
    "purple",
    "honey",
    "blackberries"
  ],
  "directions": [
    "0",
    "Preheat oven to 180 C and coat a 12 inch round tart/quiche pan with coconut oil",
    "In a food processor, pulverize buckwheat flakes into a powder/flour",
    "Add nuts to the food processor and grind until they are a coarse meal",
    "Add dried figs, vanilla and grind until well combined and the mixture is slightly sticking together",
    "Transfer mixture to a bowl, add in chia egg and mix until everything starts to bind",
    "Transfer mixture into greased tart pan and press it firmly into the bottom and slightly up the slides. Use a mini pastry roller to flatten and even it out. Poke several wholes in the base of the tart with a fork.",
    "Bake in a preheated oven for 10-12min. Remove from oven and set aside to cool.",
    "Once cooled, line the crust with figs and blackberries and set aside",
    "1",
    "Whisk together rice milk and coconut milk in a pot over medium-low heat",
    "Add agar agar powder and stir with a whisk for about 2-3 minutes, until fully diluted",
    "Slice vanilla bean pod vertically and scrape out the seeds. Add seeds and pod to the pot with the milk, stir to combine and let the vanilla infuse the milk for about 5 minutes on medium-low heat.",
    "Add sweetener, orange blossom water and diluted kuzu and stir frequently over medium heat until slightly thickened (it should be a thick liquid, like a heavy cream at this point, but not like a custard yet, as it will set once cooled), boil for an additional 1-2 minutes and remove from heat.",
    "2",
    "Slice fresh figs into quarters and place cut side up onto the crust. Add fresh blackberries. You will want to complete this step before preparing the custard.",
    "Prepare Custard. Remove from heat and pour into the crust, filling the crevices between the figs and balckberries.",
    "Let cool for about 20 minutes and then refrigerate to set for at least 1 hour or overnight."
  ],
  "ingredients": [
    "0",
    "6 organic dried turkish figs, split in half",
    "1 cup buckwheat flakes/rolled buckwheat, ground into a fine flour",
    "1 cup mixed nuts (I used hazelnuts and walnuts)",
    "1 chia egg (1 tbsp milled chia + 3 tbsp water)",
    "1 tbsp odourless coconut oil, to grease the tart pan",
    "1",
    "1 cup plain rice milk",
    "1 cup coconut milk",
    "1 vanilla bean pod",
    "2 – 4 tbsp barley malt or other liquid sweetener",
    "1 tsp orange blossom water",
    "1/4 tsp agar agar powder (not flakes)",
    "3 tsp kuzu, diluted in 1/4 c water as you would do with arrowroot or cornstarch",
    "1/4 tsp pure saffron powder",
    "2",
    "1 Rustic Buckwheat, Fig & Nut Crust, or your crust of choice",
    "2 C Vegan Saffron Custard",
    "10 fresh figs, quartered (I used purple honey figs.)",
    "About 1 cup fresh blackberries"
  ],
  "__v": 1
}