{
  "hash": "af4fc5018217badd71327c735989a7def56d553c",
  "title": "LEMON SUNSHINE CUPCAKES",
  "image": "http://cf.tasteandtellblog.com/wp-content/uploads/2017/04/Lemon-Sunshine-Cupcakes-tasteandtellblog.com-3-600x900.jpg",
  "href": "http://www.tasteandtellblog.com/lemon-sunshine-cupcakes/",
  "extension": "Chrome",
  "firstAdded": "2017-04-21T23:58:27.602000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To make the cupcakes: Preheat the oven to 350ºF. Line 36 muffin tins with cupcake liners.",
    "In a medium bowl, mix the flour, baking powder and salt; set aside. In a large bowl, beat the sugar and the butter with an electric mixer on medium speed. Add the eggs, 1 at a time, beating well after each addition. Beat in the extracts. On low sped, alternately add the ⅓ of the flour mixture, ½ of the buttermilk, another ⅓ of the flour, the remaining buttermilk and then the remaining flour, beating just until blended.",
    "Divide batter evenly among muffin cups, filling each about ⅔ full.",
    "Bake for 15 to 18 minutes, or until a toothpick inserted in the middle comes out clean. Cool for 5 minutes; remove to a cooling rack to cool completely.",
    "To make the lemon curd: Combine the sugar, cornstarch and salt in a medium saucepan. Add the water, egg yolks and lemon juice and stir to combine. Cook over medium heat, stirring often, until it thickens. Remove from the heat and stir in the butter and the lemon zest. Transfer to a bowl and cover. Refrigerate until completely cooled.",
    "To make the fluffy frosting: In a stand mixer, beat the egg whites until they form stiff peaks.",
    "Meanwhile, heat the sugar and corn syrup over medium heat. Heat until it comes to a full boil, then remove from the heat.",
    "Once the egg whites are stiff, slowly pour in the hot sugar mixture. Do not scrape the sides of the bowl, or you will have sugar crystals in the frosting. Beat the frosting until it forms a shiny, fluffy marshmallow frosting, 5-7 minutes. Beat in the vanilla extract.",
    "To assemble the cupcakes: Use a sharp knife to cut a cone out of the center of each cupcake, reserving the cut out piece. Fill the center with 1 teaspoon of lemon curd. Replace the cut out piece of the cupcake. Repeat with the remaining cupcakes.",
    "Pipe the frosting onto the cupcakes, then sprinkle with coconut."
  ],
  "ingredients": [
    "0",
    "Cupcakes:",
    "3 cups all-purpose flour",
    "2 teaspoons baking powder",
    "1 teaspoon salt",
    "2 cups granulated sugar",
    "1 cup butter, softened",
    "4 eggs",
    "1 teaspoon coconut extract",
    "1 teaspoon vanilla extract",
    "2 cups buttermilk",
    "Lemon Curd Filling:",
    "3/4 cup granulated sugar",
    "2 tablespoons cornstarch",
    "dash of salt",
    "3/4 cup water",
    "2 slightly beaten egg yolks*",
    "3 tablespoons lemon juice",
    "1 tablespoon butter",
    "1 teaspoon lemon zest",
    "Fluffy Frosting:",
    "4 egg whites*, at room temperature",
    "1 cup granulated sugar",
    "2/3 cup light corn syrup",
    "1 teaspoon vanilla extract",
    "sweetened, flaked coconut"
  ],
  "__v": 1
}