{
  "hash": "b65d36b53257e1267e4cf583f2927268fb5ddc66",
  "title": "Roasted Cabbage Slaw with Hazelnuts & Lemon",
  "image": "https://atmedia.imgix.net/ccb61de13d98e36db9707509fb2bb7ddb5562529?auto=format&q=45&w=600.0&h=800.0&fit=max&cs=strip",
  "href": "https://www.thekitchn.com/recipe-roasted-cabbage-slaw-with-hazelnuts-lemon-recipes-from-the-kitchn-178256",
  "extension": "",
  "firstAdded": "2018-01-28T23:48:12.997000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the broiler (top element) of your oven.",
    "Core both cabbage halves. Roughly shred the cabbage, using a sharp knife, a mandoline, or the shredding blade of a food processor. Place in a large bowl and toss, lightly, with olive oil and spread in one thick layer on a big baking sheet.",
    "Broil for 5 to 7 minutes, or until the tips of the cabbage shreds begin to char. Stir thoroughly to turn the cabbage, then broil for an additional 5 minutes. You're not cooking the cabbage completely through — you're trying to add as much color and crispiness to the edges as possible.",
    "Remove the cabbage from the oven and set aside to cool for a few minutes. Turn the oven to bake and down to 350°F. Roughly chop the hazelnuts and spread in a baking dish. Bake for 5 to 10 minutes or until lightly toasted (watch closely — the size of the hazelnuts, the baking dish, and your oven will all determine the actual roasting time).",
    "Whisk together 1 tablespoon olive oil, the juice of 1 lemon, and the honey.",
    "Toss the semi-cooled and wilted cabbage with the dressing and salt and pepper to taste. Toss with 1 cup of the toasted hazelnuts. Spread on a large platter and garnish with the remaining 1/4 cup of hazelnuts. If desired, also garnish generously with shaved Gruyere cheese. Serve warm or at room temperature."
  ],
  "ingredients": [
    "0",
    "1/2 head red cabbage",
    "1/2 head Savoy cabbage",
    "1 1/4 cup hazelnuts",
    "1 teaspoon honey",
    "1 ounce Gruyere cheese, optional"
  ],
  "__v": 1
}