{
  "__v": 1,
  "directions": [
    "0",
    "Preheat your oven to 350°F / 175°C. Combine all the ingredients, except for the chocolate chips, in a food processor and process until very smooth. Make sure to scrape the sides and the top to get the little chunks of chickpeas and process again until they're combined.",
    "Put in the chocolate chips and stir it if you can, or pulse it once or twice. The mixture will be very thick and sticky.",
    "With wet hands, form into 1½\" balls. Place onto a Silpat or a piece of parchment paper. If you want them to look more like normal cookies, press down slightly on the balls. They don't do much rising.",
    "Bake for about 10 minutes. The dough balls will still be very soft when you take them out of the oven. They will not set like normal cookies.",
    "Store in an airtight container at room temperature (or in the fridge) for up to 1 week."
  ],
  "firstAdded": "2014-09-29T14:24:20.958000",
  "hash": "f9640539d734258464fe343b89db26acdf02629d",
  "href": "http://www.texanerin.com/2012/04/grain-free-peanut-butter-chocolate-chip-cookie-dough-bites.html",
  "image": "http://www.texanerin.com/content/uploads/2012/04/grain_free_chocolate_chip_cookie_dough_bites_21.jpg",
  "ingredients": [
    "0",
    "1¼ cups canned chickpeas, well-rinsed and patted dry with a paper towel1",
    "2 teaspoons vanilla extract",
    "½ cup + 2 tablespoons (165 grams) natural peanut butter, SunButter Natural or almond butter - room temperature 2",
    "¼ cup (80 grams) honey (commenters have used agave and maple syrup with success!)",
    "1 teaspoon baking powder3",
    "a pinch of salt if your peanut butter doesn't have salt in it",
    "½ cup (90 grams) chocolate chips (use vegan and dairy-free chocolate chips, if needed)"
  ],
  "keywords": [
    "canned",
    "chickpeas",
    "wellrinsed",
    "patted",
    "dry",
    "paper",
    "towel",
    "vanilla",
    "peanut",
    "sunbutter",
    "natural",
    "almond",
    "butter",
    "room",
    "honey",
    "commenters",
    "used",
    "agave",
    "maple",
    "syrup",
    "success",
    "baking",
    "doesnt",
    "salt",
    "use",
    "vegan",
    "dairyfree",
    "chocolate",
    "chips",
    "needed"
  ],
  "title": "Grain-free Peanut Butter Chocolate Chip Cookie Dough Bites",
  "users": [
    null
  ]
}