{
  "hash": "0a2f0044a7c26d0f0bdd9b7d8fbde11f5af36e45",
  "title": "Thyme-Scented Squash Gratin",
  "image": "http://ghk.h-cdn.co/assets/15/38/980x490/landscape-1442346770-ghk-1015-thyme-scented-squash-gratin.jpg",
  "href": "http://www.goodhousekeeping.com/food-recipes/easy/a34576/thyme-scented-squash-gratin/?zoomable",
  "extension": "Chrome",
  "firstAdded": "2016-12-12T16:58:18.850000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "Heat outdoor grill on medium-high. Toss zucchini and squash with oil and 1/2 teaspoon each salt and pepper. Grill 12 minutes or until mostly tender, turning over once. Transfer to cutting board; let cool. Squash can be grilled up to 3 hours ahead.",
    "Meanwhile, in 3-quart saucepan, heat butter and garlic on medium until butter melts, stirring frequently. Sprinkle flour over butter. Cook 1 minute, stirring. Slowly whisk in milk until smooth, then add thyme and 1/4 teaspoon each salt and pepper. Heat to simmering on high, stirring occasionally. Reduce heat to maintain simmer; cook 1 minute or until thickened. Remove from heat. Sauce can be made up to 1 hour ahead and kept in bowl covered with plastic wrap. Reheat on medium-low until hot, whisking, before adding to squash.",
    "Preheat oven to 425 degrees F. Grease 3-quart broil-safe baking dish. Very thinly slice zucchini and squash; arrange half in prepared baking dish, pressing down gently. Top with half of white sauce. Repeat with remaining squash and white sauce. Top with cheese. Bake 15 minute or until cheese is beginning to brown. Broil on High 2 to 4 minutes or until top is deep golden brown. Let stand at least 5 minutes before serving."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 lb. small zucchini, trimmed and halved lengthwise",
    "2 lb. small yellow summer squash, trimmed and halved lengthwise",
    "2 tbsp. olive oil",
    "2 tbsp. butter",
    "2 cloves garlic, crushed with press",
    "3 tbsp. all-purpose flour",
    "1 c. whole milk",
    "1 tsp. fresh thyme leaves",
    "1 c. coarsely shredded Gruyere cheese"
  ],
  "__v": 1
}