{
  "hash": "8787ca6c277e3c1a82ab7da410d62b240b89685d",
  "title": "Fettuccine Alfredo",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/tyler-florence/fettuccine-alfredo-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-12-08T08:48:10.970000",
  "users": [
    null
  ],
  "keywords": [
    "flour",
    "unbleached",
    "allpurpose",
    "dusting",
    "salt",
    "eggs",
    "yolks",
    "extravirgin",
    "olive",
    "oil",
    "water",
    "cornmeal",
    "cream",
    "unsalted",
    "butter",
    "softened",
    "parmigianoreggiano",
    "cracked",
    "black",
    "pepper",
    "flatleaf",
    "parsley"
  ],
  "directions": [
    "0",
    "To make pasta dough: Combine the flour and salt; shape into a mound on your work surface and make a well in the center. Add whole eggs, yolks, and 1 tablespoon olive oil to the well and lightly beat with a fork. Gradually draw in the flour from the inside wall of the well in a circular motion. Use 1 hand for mixing and the other to protect the outer wall. Continue to incorporate all the flour until it forms a ball. Knead and fold the dough until elastic and smooth, this should take about 10 minutes. Brush the surface with remaining olive oil and wrap the dough in plastic wrap; let rest for about 30 minutes to allow the gluten to relax. Divide the ball of dough in small sections, cover and reserve the dough you are not immediately using to prevent it from drying out. Form the dough into a rectangle and roll it through the pasta machine, 2 or 3 times, at widest setting. Pull and stretch the sheet of dough with the palm of your hand as it emerges from the rollers. Reduce the setting and crank dough through again, 2 or 3 times. Continue tightening and rolling until the sheet is about 1/4-inch thick. Keep in mind, overly thick pasta tastes gummy. Cut the long sheet into workable 18-inch pieces. Now, using the fettuccine cutting attachment, run the sheets through the cutting slot. Dust the noodles and a baking sheet with cornmeal. Coil the strands into a nest. Allow to dry for about 10 minutes before cooking.",
    "To prepare alfredo sauce: Heat heavy cream over low-medium heat in a deep saute pan. Add butter and whisk gently to melt. Sprinkle in cheese and stir to incorporate. Season with freshly cracked black pepper. In a large stockpot, cook pasta in plenty of boiling salted water for 3 minutes. Quickly drain the pasta and add it to the saute pan, gently toss the noodles to coat in the alfredo. Transfer pasta to a warm serving bowl. Top with more grated cheese and chopped parsley. Serve immediately.",
    "2001 Television Food Network, G.P. All Rights Reserved"
  ],
  "ingredients": [
    "0",
    "3 cups 00 flour or unbleached all-purpose, plus more for dusting",
    "1 teaspoon salt",
    "3 eggs plus 2 yolks",
    "1 tablespoon extra-virgin olive oil, plus 1 tablespoon",
    "1 tablespoon water",
    "Cornmeal, for dusting",
    "1 pint heavy cream",
    "1/2 cup (1 stick) unsalted butter, softened",
    "1 cup freshly grated Parmigiano-Reggiano",
    "Freshly cracked black pepper",
    "Chopped fresh flat-leaf parsley, for garnish"
  ],
  "__v": 1
}