{
  "hash": "e00d5ab0dca8616825040753e360c6851a4cc9e2",
  "title": "Jambalaya",
  "image": "http://www.gimmesomeoven.com/wp-content/uploads/2014/03/Jambalaya-14.jpg",
  "href": "http://www.gimmesomeoven.com/jambalaya-recipe/",
  "extension": "Chrome",
  "firstAdded": "2017-01-03T03:10:20.903000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat 2 tablespoons. olive oil in a large saute pan over medium-high heat. Add celery, onion, bell peppers, jalapeno and garlic. Saute for about 5 minutes, stirring occasionally, until the vegetables are soft and mostly cooked. Add the remaining tablespoon of olive oil, chicken and sausage, and stir to combine. Continue sauteing for an additional 5 minutes, or until the chicken is no longer pink and mostly cooked.",
    "Add the chicken stock, tomatoes, rice, Cajun spice, bay leaf, thyme, and cayenne, and stir to combine. Reduce heat to medium-low, cover and simmer for about 25-30 minutes, or until the rice is cooked, stirring occasionally. (Don't forget to stir, or the rice may burn on the bottom of the pan.)",
    "Once the rice is tender, add in the shrimp and okra and stir to combine. Let the mixture continue to simmer, stirring occasionally, until the shrimp are cooked and pink. Remove bay leaf and season the jambalaya with salt and pepper and hot sauce and additional Cajun/Creole seasoning if needed. Remove from heat and serve with optional garnishes if desired.",
    "*If you like spicy jambalaya, I recommend adding 2 jalapenos with their seeds in. If you like it mild, I'd go with just 1 seeded jalapeno. Or you can go somewhere in between, and always add extra hot sauce at the end if it's too mild.",
    "**I also like heavily seasoned jambalaya, so I go with a full 2 Tbsp. If you think that might be too much, I recommend adding just 1 Tbsp and then taste-testing the rice before adding the shrimp. If you want to add more at that point, just stir some extra seasoning in when you add the shrimp."
  ],
  "ingredients": [
    "0",
    "3 tablespoons olive oil",
    "2 ribs celery, chopped",
    "1 white onion, diced",
    "1 small red bell pepper, cored and diced",
    "1 small yellow bell pepper, cored and diced",
    "1 small green bell pepper, cored and diced",
    "1-2 jalapeno peppers, seeded and finely chopped (*more/less to taste, see note below)",
    "4 cloves garlic, minced",
    "2 boneless skinless chicken breasts, cut into bite-sized pieces",
    "1 pound andouille sausage, thinly sliced into rounds",
    "3 cups chicken stock",
    "1 (14 ounces) can crushed tomatoes",
    "1 1/2 cups uncooked white or brown rice",
    "2 tablespoons Cajun or Creole seasoning (**more/less to taste, see note below)",
    "1 bay leaf",
    "1 teaspoons thyme, crushed",
    "1/4 teaspoon cayenne pepper",
    "1 pound raw shrimp, peeled and deveined",
    "(optional) 1 cup thinly-sliced okra",
    "salt and pepper",
    "(optional garnishes: chopped fresh parsley, thinly-sliced green onions, hot sauce)"
  ],
  "__v": 1
}