{
  "hash": "4d7919bab3371892c4ffa6fbb3e4493be31b6a7c",
  "title": "Pineapple Fried Rice",
  "image": "https://www.connoisseurusveg.com/wp-content/uploads/2015/07/pineapple-fried-rice-1-of-2.jpg",
  "href": "https://www.connoisseurusveg.com/pineapple-fried-rice-with-basil-peanuts",
  "extension": "Firefox",
  "firstAdded": "2020-02-09T14:17:20.552000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place a large skillet over medium heat and coat the bottom with 1 tablespoon of the oil.",
    "When the oil is hot, add the pineapple in an even layer.",
    "Cook the pineapple for about 3 minutes, until the pieces begin to soften up and brown on the bottoms, flip and cook for about 3 minutes more.",
    "Remove the pineapple from the skillet and transfer it to a plate.",
    "Add the remaining oil to the skillet.",
    "Give the oil a minute to heat up, and then add white parts of scallions, garlic and ginger.",
    "Sauté about 1 minute, until very fragrant.",
    "Raise the heat to high. Add the bell pepper and stir-fry it for about 1 minute.",
    "Add the rice, soy sauce and sriracha (if using) to the skillet. Continue to stir-fry everything for 4 to 5 minutes, until the rice begins to dry out and crisp up in spots.",
    "Return the pineapple to the skillet and add the edamame. Flip everything a few times to mix the ingredients.",
    "Cook everything for about 1 minute more, just to heat up the edamame.",
    "Remove the skillet from the heat and stir in the green parts of scallions, basil and peanuts.",
    "Divide onto plates and serve."
  ],
  "ingredients": [
    "0",
    "2 tablespoons canola oil, or high-heat oil of choice, divided",
    "2 cups diced pineapple (1-inch pieces, about 1/2 of a pineapple)",
    "4 scallions, white and green parts separated and chopped",
    "3 garlic cloves, minced",
    "1 teaspoon fresh grated ginger",
    "1 medium red bell pepper, diced",
    "3 cups cooked rice, preferably 1-2 days old and chilled",
    "3 tablespoon soy sauce or tamari",
    "1 tablespoon sriracha, or to taste (optional)",
    "1 cup shelled frozen edamame, thawed",
    "1/2 cup chopped fresh basil leaves",
    "1/4 cup roasted peanuts, roughly chopped"
  ],
  "__v": 1
}