{
  "hash": "d0dc6532dd46d1f7cf96b4a2e8b1e6b918fa2402",
  "title": "Crispy Oven Roasted Bone-In Chicken Breast",
  "image": "https://ifoodblogger.com/wp-content/uploads/2017/10/Oven-Roasted-Bone-In-Chicken-Breast-370.jpg",
  "href": "https://ifoodblogger.com/oven-roasted-bone-in-chicken-breast/",
  "extension": "",
  "firstAdded": "2019-01-09T22:43:53.920000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "If possible, prepare the chicken brine and brine the chicken breasts for 2 to 4 hours.",
    "Preheat oven to 400F.",
    "Dry chicken breasts with a paper towel and rub with olive oil all over. Evenly sprinkle salt and spices on each side and gently pat to make sure the seasoning properly adheres to the surface of the chicken.",
    "Line a baking sheet with aluminum foil. Fit a cooling rack inside the baking sheet and set aside.",
    "Heat 1/2 cup of cooking oil (you can use olive oil or any other oil you prefer) in a large skillet over medium-high heat. Place chicken breast skin side down on the skillet and cook for 2 minutes. Flip and continue cooking for another 2 minutes.",
    "Transfer the chicken breasts onto the baking sheet, skin side up. Pour about 1 Tbsp of the cooking oil from the skillet over each chicken breast.",
    "Bake at 400F for about 45 minutes, until internal temperature of the meat reaches 160F.",
    "Let rest for 5 minutes and serve.",
    "Notes",
    "I recommend that for optimal results you should bake the breasts to 160F internal temperature instead of 165F. As I mentioned in my How To Bake Chicken Breast post, my experiments showed that internal meat temperature keeps rising by 5 degrees during the 5 minute rest period. This will ensure that the meat is safe to eat and is optimally tender and juicy."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 large bone-in skin-on chicken breasts",
    "1/2 Tbsp olive oil",
    "1 tsp salt 1/2 tsp if the meat has been brined",
    "1/2 tsp granulated garlic powder",
    "1/2 tsp freshly ground black pepper",
    "1 tsp dark chili powder",
    "1/2 cup cooking oil"
  ],
  "__v": 1
}