{
  "__v": 1,
  "directions": [
    "0",
    "Add all ingredients (except butter) into a breadmaker, first the wet ingredients (milk, egg, tangzhong), then followed by the dry ingredients (sugar, salt, bread flour, wholemeal flour, yeast). (Note: I used to make a small well in the flour, then add the yeast into it.)",
    "Select the “dough” mode (refer to the manual of your breadmaker to select the kneading dough programme). When all ingredients come together, add the butter (see picture 1). Knead until the dough becomes elastic.",
    "Let the dough complete the 1st round of proofing, until doubled in size, about 40 minutes.",
    "Transfer the dough to a clean floured surface. Deflate and divide into 3 equal portions. Knead into ball shapes (see picture 2). Cover with plastic wrap, let rest for 15 minutes at room temperature.",
    "Roll out each dough ball with a rolling pin into an oval shape. Roll up the dough and seal tightly (see picture 3 & 4). Seal faces downward. Roll out each portion to 30cm in length with your rolling pin (picture. Seal faces upward and roll into a cylinder shape (see picture 6 & 7). The seal faces down (see picture 8). Arrange the rolled-up dough in a greased or non-stick loaf tin. Repeat this step for the other two portions. Leave it for the 2nd round of proofing, about 40 minutes, or until the dough rises up to 4/5 of the height of the tin inside (see picture 9). Close the loaf lid. (Remark: If your tin doesn’t have a lid, just brush a bit of whisked egg on surface.)",
    "Bake in a pre-heated 170C / 335F oven for 30 to 35 minutes. Remove the loaf from the oven and tin. Transfer onto a wire rack and let cool completely. Slice to serve or place in an airtight plastic bag or container once it's thoroughly cooled."
  ],
  "firstAdded": "2014-07-04T19:08:23.636000",
  "hash": "6399ee712c53f5a721145c549b8419562d0bef29",
  "href": "http://en.christinesrecipes.com/2012/10/tangzhong-wholemeal-loaf.html",
  "image": "http://4.bp.blogspot.com/-tmYcTO2v5e0/UIfOHZ2VUQI/AAAAAAAAK_E/YRsfUvJyj4Q/s1600/%25E6%25B9%25AF%25E7%25A8%25AE%25E5%2585%25A8%25E9%25BA%25A5%25E9%25BA%25B5%25E5%258C%2585%2BTangzhong%2BWholemeal%2BToast01.jpg",
  "ingredients": [
    "0",
    "110 gm milk",
    "45 gm whisked egg",
    "100 gm Tangzhong (refer to this recipe)",
    "40 gm sugar",
    "5 gm salt",
    "200 gm bread flour",
    "150 gm wholemeal / whole wheat flour",
    "6 gm instant dry yeast",
    "40 gm unsalted butter, softened at room temperature"
  ],
  "keywords": [
    "milk",
    "whisked",
    "egg",
    "tangzhong",
    "refer",
    "recipe",
    "sugar",
    "salt",
    "bread",
    "flour",
    "wholemeal",
    "wheat",
    "instant",
    "dry",
    "yeast",
    "unsalted",
    "butter",
    "softened",
    "room"
  ],
  "title": "Tangzhong Wholemeal Toast",
  "users": [
    null
  ]
}