{
  "hash": "4493e7ea70d7c6f3cda3f6dd9b9e12c45aab2b77",
  "title": "ASIAN MAPLE BRAISED PORK BUTT",
  "image": "",
  "href": "http://pork.betterrecipes.com/asian-maple-braised-pork-butt.html",
  "extension": "Chrome",
  "firstAdded": "2015-11-06T15:57:35.993000",
  "users": [
    null
  ],
  "keywords": [
    "boneless",
    "pork",
    "butt",
    "fist",
    "sized",
    "pieces",
    "salt",
    "pepper",
    "yellow",
    "onions",
    "rough",
    "bunch",
    "green",
    "ginger",
    "roots",
    "head",
    "garlic",
    "smashed",
    "star",
    "anise",
    "mustard",
    "rice",
    "wine",
    "vinegar",
    "soy",
    "hoisin",
    "mashed",
    "lemongrass",
    "stalk",
    "brown",
    "sugar",
    "maple",
    "syrup",
    "chicken",
    "stock",
    "pan",
    "way",
    "meat"
  ],
  "directions": [
    "0",
    "First brown all sides of pork in two heavy bottom saute pans, making sure fatty sides are nice and crispy.",
    "Place meat in a two inch deep sheet pan, making sure meat is slightly spread apart. Drain part of fat from saute pans and add the next 13 ingredients to pans, half in each and saute about 5 minutes until the sugar is caramelizing the vegetables but not burning. Deglaze with cup of chicken stock in each pan. Fill each pan with stock until about half full and bring to a boil.",
    "Pour each pan of onion and sauce over meat and, if needed, add more stock to keep liquid about 3/4 of way up meat. Cover with a layer of parchment paper and tightly cover with foil. Bring pan to a boil on stove top, and once the foil makes a dome, it is boiling. If not brought to a boil, it may need an extra half hour to braise meat.",
    "Place pork in a 325 degree oven and braise about three hours. Check to for doneness, pork should be falling apart and difficult to pick up because of tenderness.Strain all braising liquid and reduce in a saute pan until it has a saucy and syrupy consistency, but constantly taste to check for saltiness."
  ],
  "ingredients": [
    "0",
    "12 lb\tBoneless Pork Butt, cut into fist sized pieces",
    "Salt & Pepper, to taste",
    "8\tYellow Onions, rough chop",
    "4 bunch\tGreen Onions, rough chop",
    "12\tFresh Ginger Roots, peeled and sliced",
    "4 head\tGarlic, smashed",
    "8\tStar Anise",
    "4 T Mustard Powder",
    "1 c\tRice Wine Vinegar",
    "2 c\tSoy Sauce",
    "2 c\tHoisin Sauce",
    "4\tMashed Lemongrass Stalk",
    "2 c\tBrown Sugar",
    "3 c\tMaple Syrup",
    "Chicken Stock To Fill Pan 3/4 Way Up Meat"
  ],
  "__v": 3
}