{
  "__v": 1,
  "directions": [
    "0",
    "polenta: Combine polenta and liquid in a sauce pot with a few pinches of salt over medium heat. Bring to a boil, then reduce heat and stir with a wooden spoon every now and again, while cooking ver slowly for ~15-20 minutes. Set aside to cool a bit.",
    "bechamel: In the meantime, heat the butter and flour to make a loose roux. Cook out for about a minute, then whisk in the milk. Bring to a boil, then reduce to a low simmer. Season, to taste with salt and freshly ground pepper. Grate some nutmeg over the top. Smell the glory that is bechamel. Continue to simmer very slowly for ~13-15 minutes. Remove from heat. Whisk in parmesan cheese.",
    "mushrooms: Wipe any dirt from the mushrooms and cut them into slices. Cook",
    "them for ~3 - 4 minutes in butter.*",
    "Butter a wide shallow cake tin or fireproof dish. Spread ⅓ of the polenta evenly across the bottom of the pan. Scatter ⅓ of the mushrooms evenly over the polenta. Ladle ⅓ of the bechamel over this. Repeat two more times. Grate a bunch of parmesan over the very top of the pie. The second and third layers of polenta are kind of tricky since you can't really \"spread\" them anymore, per se. What I did was sort of patted out a thin layer and lifted it into place in the pan. It didn't fit tightly like a cap, but it seemed to work.",
    "Slide into a preheated 375° F oven for ~30 minutes until there is a bubbling",
    "golden crust on top of the dish. Serve as is or with a lightly dressed green salad for a totally comforting meal."
  ],
  "firstAdded": "2014-08-16T22:28:25.197000",
  "hash": "f2eb46f63049f7ed85197da1f76ae5965e097903",
  "href": "http://www.girlichef.com/2011/09/50-women-game-changers-in-food-14.html",
  "image": "http://4.bp.blogspot.com/-SRui1ppLo_s/TmouVD8ZSlI/AAAAAAAAH8g/AVcK_qmkFgI/s1600/Mixed+Mushrooms+lightly+saut%25C3%25A9ed.jpg",
  "ingredients": [
    "0",
    "polenta",
    "8 oz. (scant 1⅓ c.) polenta",
    "3 c. mushroom stock/mushroom soaking liquid/water",
    "bechamel",
    "2 oz. butter",
    "2 Tbs. flour",
    "2½ c. warmed milk",
    "kosher salt",
    "freshly ground black or white pepper",
    "freshly grated nutmeg",
    "2 oz. freshly grated parmesan cheese",
    "mushrooms",
    "8 oz. mixed mushrooms (I used shiitake, oyster, crimini, black trumpet)",
    "2 oz. butter",
    "to finish",
    "~½ oz. freshly grated parmesan"
  ],
  "keywords": [
    "polenta",
    "scant",
    "mushroom",
    "stockmushroom",
    "soaking",
    "liquidwater",
    "bechamel",
    "butter",
    "tbs",
    "flour",
    "warmed",
    "milk",
    "kosher",
    "salt",
    "black",
    "white",
    "pepper",
    "nutmeg",
    "parmesan",
    "cheese",
    "mushrooms",
    "mixed",
    "used",
    "shiitake",
    "oyster",
    "crimini",
    "trumpet",
    "finish"
  ],
  "title": "Mushroom Polenta Pie",
  "users": [
    null
  ]
}