{
  "hash": "c769f4f3c6859190f1e90b6b31f7a88571cfd88f",
  "title": "Eggplant with Yogurt and Tomato Relish",
  "image": "https://c7.staticflickr.com/9/8623/27945553814_0611532225_z.jpg",
  "href": "https://smittenkitchen.com/2016/07/eggplant-with-yogurt-and-tomato-relish/",
  "extension": "Chrome",
  "firstAdded": "2018-09-07T17:07:11.571000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat oven to 425 degrees. Trim eggplants and cut in half lengthwise; season cut sides with salt and pepper. Coat a large roasting pan with olive oil (1 to 2 tablespoons). Arrange eggplants cut side down; sprinkle with more salt and pepper. Roast for 25 minutes on the first side, or until brown underneath then flip and roast 5 to 10 minutes more. Remove from oven and let cool slightly.",
    "Meanwhile, make couscous, if using it. Bring 3/4 cup water and a few pinches of salt to a simmer then pour it over dried couscous in a bowl. Cover with a lid or foil and let side for 5 minutes to absorb, then fluff with a fork.",
    "Make tomato relish by pulsing garlic and parsley in a blender or food processor until finely chopped, then add tomatoes and pulse until they’re well chopped. Add 1 tablespoon olive oil, vinegar, salt, freshly ground black pepper or a pinch or two of red pepper flakes and pulse to combine. No food process or blender? Not a problem at all; just mince the garlic and parsley well and finely chop the tomatoes; stir this together with the remaining ingredients. Both methods: taste for seasoning. We like this extra sharp and almost always add 1 more teaspoon vinegar and more salt. The longer it sits, the more potent it gets.",
    "To assemble, schmear each eggplant half with a little yogurt. If you’re using couscous, sprinkle a little on top. Spoon tomato relish over and serve the rest of all the above on the side."
  ],
  "ingredients": [
    "0",
    "3 tablespoons olive oil, divided",
    "1 1/4 to 1 1/2 pounds eggplant; I prefer the long, thin variety here but any will do",
    "Salt and freshly ground black pepper",
    "1/2 cup (75 grams) dried couscous (optional)",
    "1 garlic clove",
    "1/4 cup packed flat-leaf parsley leaves",
    "1 cup cherry or grape tomatoes",
    "2 teaspoons red wine vinegar, plus more to taste",
    "Red pepper flakes",
    "1/2 cup plain yogurt"
  ],
  "__v": 1
}