{
  "hash": "2df86f5c918003c230720f8b321973b86bbebbf3",
  "title": "Black Iron Skillet Deep Dish Pizza",
  "image": "http://3.bp.blogspot.com/-BqtTQXClFL0/Ujrv9Cwo8rI/AAAAAAAAWRw/2lkIFsXI__8/s640/1+labeled.jpg",
  "href": "http://menumusings.blogspot.com/2013/09/black-iron-skillet-deep-dish-pizza.html",
  "extension": "Chrome",
  "firstAdded": "2015-10-13T16:47:27.665000",
  "users": [
    null
  ],
  "keywords": [
    "okay",
    "fair",
    "warning",
    "didnt",
    "measure",
    "thing",
    "concept",
    "recipe",
    "people",
    "vary",
    "widely",
    "preference",
    "amounts",
    "cheese",
    "meats",
    "veggies",
    "feels",
    "right",
    "family",
    "premade",
    "pizza",
    "dough",
    "bench",
    "flour",
    "rolling",
    "canola",
    "oil",
    "skillet",
    "pepperoni",
    "deli",
    "green",
    "bell",
    "peppers",
    "tomatoes",
    "seasonings",
    "basil",
    "oregano",
    "garlic",
    "italian",
    "sausage",
    "marinara",
    "lots",
    "mozzarella",
    "butter"
  ],
  "directions": [
    "0",
    "Step-by-Step:",
    "The crust -",
    "Preheat the oven to 350 degrees F.",
    "I picked up some pre-made pizza dough on the way home so that dinner would come together quickly. This was enough dough to make a standard \"large\" pizza. To make your own dough, click the link under the ingredient list.",
    "We are also going to go for the \"stuffed crust\" concept, so let's get our cheese \"sticks\" ready by cutting a block of cheese into little logs. Then get your dough rolled out. Roll out the dough on a floured surface, then sprinkle the rested dough with more flour.",
    "Don't forget to flour your rolling pin also, so it won't stick. Roll out the dough in a nice wide circle. Can you tell that Lily has done this before ... a few times?! LOL",
    "Now prepare your black iron skillet. I'm going to add a tablespoon or so of canola oil to the bottom. I want a crunchy crust on the bottom.",
    "1 Tbsp canola oil",
    "Transfer the dough to the pan. Let it drape loosely.",
    "Gently press the dough all the way into the pan.",
    "I really thought I had some mozzarella string cheese, but I didn't, so I added the logs of Vermont white cheddar to the edges of the crust.",
    "Then I rolled the edges of the crust around the cheese. Now we are all ready to put in the filling.",
    "The filling -",
    "For the deep dish pizza concept, we are NOT going to add the sauce first. I am actually creating a barrier between the dough and the sauce with my other fillings. So here, Lily covered the whole bottom with pepperoni. Feel free to use turkey pepperoni, or your choice of deli meats (ham, turkey, salami, etc.). There were not any spaces left. Then I added a handful of green bell peppers.",
    "Next I added a chopped up fresh tomato. Now Lily added a layer of cheese. Looking at the photo, I think she may be casting a spell on the Pizza Spirits for good luck!! HaHa!! But then again, she's always working her magic in in the kitchen!",
    "We started with about 3 cups of mozzarella, chopped into small pieces. We will use about half of that in this first cheese layer.",
    "Now I will liberally season it all up with some dried basil.",
    "Finally, here comes the sauce. I made some Italian Sausage Marinara for an eggplant parmigiana recipe, and had some left over in the freezer. This is the perfect dish to use it for. Click here to see the recipe for Italian Sausage Marinara. If you are just heading home from work and need something faster than a \"make your own\" recipe, just grab a jar of your favorite marinara, brown some Italian sausage, add them together and season the whole thing up really well. If you do this, let the marinara reduce down a bit so it's not too runny. But do promise me you'll make your own one day, because this MADE the whole pizza wonderful!!",
    "Now add the other half of the diced up mozzarella cheese to the top.",
    "I added thin slices of a large juicy end-of-season tomato, and then topped that with some freshly ground Italian seasoning.",
    "Lastly, I went out and picked some fresh oregano from the garden, stripped some of the leaves, and sprinkled them over the top.",
    "Cook -",
    "Now let's do some magic!! To get that crunchy crust, I'm going to do a little trick. Before I throw the whole thing in the oven, I'm going to cook it on the stove top for a few minutes on high/medium-high so that oil in the bottom can get super hot and start cooking the bottom of the crust.",
    "Then put it into the preheated oven. Okay - here's a confession. I thought I had preheated the oven to 450 degrees F, but I didn't. It was at 350 degrees. So I cooked it for about 10 minutes on 350 degrees, then kicked the temperature up to 450 degrees for the next 10-12 minutes. It wasn't my intention, but it happened to work out great!",
    "After I removed it from the oven, I brushed the crust with some melted garlic butter. Why? Because I like it that way. Haha. When we do get pizza delivery, I LOVE the garlic butter that comes with it, so I incorporated that idea into this recipe as well.",
    "Brushing on the garlic butter gave my pizza several minutes to rest. After all, I don't want the whole thing to collapse when I cut into it. Haven't we ALL had that happen with layered dishes - like a too hot lasagna? Not pretty!",
    "Now serve up some deliciousness!",
    "So here is the finished, stuffed crust, deep dish pizza. Isn't it a beauty?!",
    "Let's see how this goes......",
    "Oh - MY!!!! I probably could have let it sit a bit longer, but I couldn't help myself.",
    "Now tell me.. what do you think? I can tell you that from this end, it was fabulous! Rich and satisfying thanks to the home made marinara. Fresh flavors from the tomatoes, herbs and peppers. Melted cheese, crunchy crust, and meaty filling! I bet you wish YOU had a fork and knife to dig in!",
    "So all in all.. a great afternoon project for us. We had a good time making this, and had a great meal in the end. I hope you'll try it, as well!!"
  ],
  "ingredients": [
    "0",
    "Okay, here is fair warning. I didn't measure a thing! This is more of a concept recipe. People vary widely in their preference for amounts of sauce, cheese, meats, veggies, etc. So do what feels right for your family.",
    "Premade pizza dough",
    "bench flour for rolling out dough",
    "1 Tbsp canola oil for skillet",
    "Pepperoni or deli meats of your choice",
    "green bell peppers",
    "fresh tomatoes - some diced, some sliced",
    "dried seasonings of your choice",
    "dried basil",
    "dried oregano",
    "garlic powder",
    "Italian sausage marinara",
    "2 -3 cups",
    "lots of shredded or chopped mozzarella cheese",
    "about 3 cups",
    "garlic butter sauce"
  ],
  "__v": 1
}