{
  "hash": "72847a1fd1277935a5713cb0f4d55fd07d7ec02c",
  "title": "Mexican Achiote Roast Chicken By Cooks and Kid May 30, 2016 0 Reviews 0 Ratings",
  "image": "http://recipe-folder.com/img/recipe-images/027/965/2199161527.gif",
  "href": "https://food52.com/recipes/56119-mexican-achiote-roast-chicken",
  "extension": "Firefox",
  "firstAdded": "2019-05-25T03:54:24.655000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "Achiote Paste",
    "Heat a cast iron skillet over medium heat for 5 minutes. Add the canela, peppercorns, allspice, oregano and achiote seeds. Toast, shaking the pan until fragrant, about 15 seconds. Remove from the heat and transfer to a spice grinder. Grind to a fine powder, working in batches if necessary",
    "Reheat the skillet over medium heat. Add the garlic cloves and roast, turning them from time to time, until slightly soft and blackened in spots about 6 minutes. Turn off the heat and remove the garlic from the pan. Once cool enough to handle, peel the garlic and discard the skin.",
    "In a blender, combine the ground spices and seeds, roasted garlic and cider vinegar. Puree until smooth. Transfer to a container and refrigerate until ready to use.",
    "Roast Chicken",
    "Preheat the oven to 425°F.",
    "In a small bowl mix together achiote paste (8 tbsp), softened butter, and salt until well incorporated. Set aside.",
    "Place the chicken in a large bowl and rub the paste butter mixture all over the chicken. You may want to use gloves for this process because the paste will stain your hands.",
    "Transfer the chicken and onion slices to a foil lined baking sheet. Bake for 20 minutes and then baste the chicken and onions with the juices. Bake for an additional 20 minutes or until cooked through. Serve the chicken and onions with tortillas, limes and cilantro."
  ],
  "ingredients": [
    "0",
    "Roast Chicken",
    "8 tablespoons achiote paste",
    "2 tablespoons unsalted butter, room temperature",
    "1 1/2 tablespoons kosher salt",
    "1 large onion, sliced thick",
    "6 chicken leg quarters, approx 4 lbs",
    "optional for serving: limes, cilantro and corn tortillas"
  ],
  "__v": 1
}