{
  "hash": "bf8604aeb18940334c6b20f076f185f1c20f9d81",
  "title": "Carrot Hummus",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/carrot-hummus",
  "extension": "Chrome",
  "firstAdded": "2016-10-08T13:42:18.547000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Toast caraway and coriander seeds in a small skillet over medium heat, swirling pan often and adding cumin seeds during the last 30 seconds of cooking, until fragrant, about 2 minutes. Let cool, then grind finely in spice mill or with mortar and pestle.",
    "Heat 2 Tbsp. oil in a medium saucepan over medium. Add carrots, season with salt and pepper, and cook, stirring occasionally, until carrots are tender, 6–8 minutes. Add chickpeas and one-third of the spice mixture; cook, stirring occasionally, until carrots are completely tender, about 5 minutes. Let cool slightly.",
    "Transfer carrot mixture to a blender and add garlic, carrot juice, peanut butter, lemon juice, and 4 Tbsp. oil; blend until smooth. Season with salt and pepper.",
    "Toast peanuts in a small skillet over medium heat, tossing occasionally, until lightly browned, about 2 minutes. Add honey and half of the remaining spice mixture; cook, stirring, until honey is caramelized and darker in color and pan is mostly dry, 5–8 minutes. Transfer peanut mixture to a parchment-lined rimmed baking sheet, spread in a single layer, and let cool. Coarsely chop.",
    "Meanwhile, blend chiles and adobo with remaining spice mixture in blender until smooth, adding water as necessary to thin. Serve hummus with adobo harissa dolloped in the center; sprinkle with peanuts. Drizzle with oil.",
    "Do Ahead: Hummus can be made 3 days ahead. Cover and chill. Bring to room temperature before serving."
  ],
  "ingredients": [
    "0",
    "1 tablespoon caraway seeds",
    "1 tablespoon coriander seeds",
    "1 tablespoon cumin seeds",
    "6 tablespoons olive oil, divided, plus more for drizzling",
    "½ pound carrots, chopped",
    "Kosher salt, freshly ground pepper",
    "1 15-ounce can chickpeas, drained",
    "2 garlic cloves, finely grated",
    "½ cup carrot juice or water",
    "¼ cup natural smooth peanut butter",
    "2 tablespoons fresh lemon juice",
    "¼ cup unsalted, roasted peanuts",
    "1 tablespoon honey",
    "2 canned chipotle chiles in adobo, plus 2 tablespoons adobo sauce",
    "1",
    "A spice mill or mortar and pestle"
  ],
  "__v": 1
}