{
  "hash": "d8909b3eee723a5aa3196943a2fbd6d2b0e0a601",
  "title": "The Greenest Coconut Curry with Clams and Rice Noodles",
  "image": "",
  "href": "https://www.bonappetit.com/recipe/the-greenest-coconut-curry-with-clams-and-rice-noodles",
  "extension": "Chrome",
  "firstAdded": "2018-04-02T01:42:46.802000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "RECIPE PREPARATION",
    "Purée chopped chile, ginger, lemongrass, garlic, fish sauce, brown sugar, and 3 cups water in a blender until smooth. Transfer curry to a small bowl. Reserve blender (no need to clean).",
    "Purée coconut cream, cilantro, 3 cups basil, and ¼ cup ice water in blender until very smooth; set herb purée aside.",
    "Heat oil in a large saucepan or small pot over medium-high. Add clams, cover, and cook until clams open, 5–7 minutes. Uncover and transfer opened clams to a medium bowl, reserving cooking liquid in saucepan. If any clams are still closed, cover and cook a few minutes longer, then add to bowl with others; discard any clams that refuse to open.",
    "Add curry base to saucepan and bring to a boil. Reduce heat and simmer 10 minutes to let flavors meld.",
    "Meanwhile, cook noodles according to package directions. Drain and rinse under cold water. Divide among bowls.",
    "Using a slotted spoon, transfer clams to noodle bowls. Pour any accumulated clam-cooking liquid into curry mixture and stir in herb purée; bring to a boil. Immediately remove from heat and squeeze in juice from lime. Taste and season with salt if needed. Ladle curry over clams and noodles. Top with sliced chile and basil leaves."
  ],
  "ingredients": [
    "0",
    "2 serrano chiles, 1 coarsely chopped, 1 thinly sliced",
    "1 3-inch piece ginger, peeled, thinly sliced",
    "2 lemongrass stalks, bottom third only, tough outer layers removed, thinly sliced",
    "2 garlic cloves, smashed",
    "1 tablespoon fish sauce",
    "1 tablespoon light brown sugar",
    "1 5.4-ounce can coconut cream",
    "3 cups cilantro leaves with tender stems",
    "3 cups basil leaves, plus more for serving",
    "2 tablespoons virgin coconut oil or vegetable oil",
    "36 littleneck clams (about 4 pounds), scrubbed",
    "8 ounces rice stick noodles",
    "½ lime",
    "Kosher salt"
  ],
  "__v": 1
}