{
  "hash": "3dfcd155d9787f0bbe97341ebcc451bb2ee168be",
  "title": "Thai Sweet Potato Veggie Burgers with Spicy Peanut Sauce",
  "image": "http://cdn.ohsheglows.com/wp-content/uploads/2013/10/thaiveggieburger-2351.jpg",
  "href": "http://ohsheglows.com/2013/10/28/thai-sweet-potato-veggie-burgers-with-spicy-peanut-sauce/",
  "extension": "Chrome",
  "firstAdded": "2016-02-15T23:02:25.741000",
  "users": [
    null
  ],
  "keywords": [
    "burgers",
    "potato",
    "cilantro",
    "basil",
    "leaves",
    "garlic",
    "ginger",
    "roasted",
    "salted",
    "peanuts",
    "glutenfree",
    "rolled",
    "oats",
    "processed",
    "coarse",
    "flour",
    "chickpeas",
    "rinsed",
    "flax",
    "water",
    "mixed",
    "bowl",
    "sesame",
    "seed",
    "oil",
    "lowsodium",
    "tamari",
    "coconut",
    "aminos",
    "soyfree",
    "option",
    "lime",
    "juice",
    "coriander",
    "salt",
    "black",
    "pepper",
    "peanut",
    "clove",
    "smooth",
    "almond",
    "sunflower",
    "butter",
    "needed",
    "maple",
    "syrup",
    "sweetener",
    "cayenne"
  ],
  "directions": [
    "0",
    "Directions:",
    "Preheat the oven to 350F and line a large baking sheet with parchment paper.",
    "Peel the sweet potato. Using a box grater with the regular-sized grate holes, grate 1.5 cups of sweet potato. Place in large bowl. I had about 1/2 of the sweet potato leftover, so I sliced it into 1-cm rounds and placed it on the baking sheet. Drizzle with oil and toss to coat.",
    "In a large bowl, stir together the grated sweet potato, cilantro, basil, garlic, ginger, and chopped peanuts.",
    "In a food processor, add the oats and process until finely chopped. You want the texture to be like a coarse flour. Stir the oat flour into the bowl with the vegetables.",
    "Now add the drained chickpeas into the processor and process until finely chopped. You want the mixture to be a cross between a coarse paste and finely chopped chickpeas, but don't completely puree the chickpeas. Stir the processed chickpeas into the bowl with the vegetables and oat flour.",
    "In a mug, whisk together the ground flax and water. Let it sit for only 20 seconds or so, any longer and it will get too thick. Stir this flax egg into the vegetable chickpea mixture until fully combined.",
    "Stir in the sesame oil, tamari, lime juice, coriander, salt, and pepper all to taste.",
    "Shape the mixture into 6-8 patties, packing each patty tightly between your hands so it holds together well. Place each patty onto the prepared baking sheet along with the sweet potato rounds.",
    "Bake for 20 minutes, then gently flip the patties and potato rounds and bake for another 15-17 minutes until golden on both sides. You might have to remove the sweet potato a bit early - just keep an eye on them so they don't burn.",
    "While the burgers are baking, prepare the peanut sauce. Add all sauce ingredients into a food processor and process until smooth. Adjust ingredients to taste if desired. The sauce will thicken up as it sits.",
    "After baking, place patties on a cooling rack for 10 minutes to cool slightly. Serve with toasted buns (or lettuce or whole grain wraps), tomato slices, roasted sweet potato, lettuce, and the peanut sauce.",
    "The peanut sauce will store in the fridge for at least a week. The burgers can be frozen (after baking and cooling) for a couple weeks.",
    "Tips:",
    "Notes: 1) To make the burgers soy-free, use coconut aminos in place of the tamari or simply omit it all together. 2) To make this recipe nut-free, omit the peanuts in the burgers and use sunflower seeds instead. For the peanut sauce, you can probably use sunflower seed butter instead of the peanut butter, but you will likely have to adjust the other ingredients to taste since its more bitter than peanut butter."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "For the burgers:",
    "1 large sweet potato",
    "1/2 cup cilantro, finely chopped",
    "1/4 cup fresh basil leaves, finely chopped",
    "3 large garlic cloves, minced",
    "2 teaspoons finely grated ginger",
    "1/2 cup roasted and salted peanuts, finely chopped",
    "3/4 cup gluten-free rolled oats, processed into a coarse flour",
    "1 (15-ounce) can chickpeas, drained and rinsed",
    "2 tablespoons ground flax + 3 tbsp water, mixed in bowl",
    "1/2 tablespoon sesame seed oil",
    "1 tablespoon low-sodium tamari (or coconut aminos for soy-free option)",
    "1 teaspoon fresh lime juice",
    "1 teaspoon ground coriander",
    "1 teaspoon fine grain sea salt, or to taste",
    "Freshly ground black pepper, to taste",
    "For the peanut sauce:",
    "1 garlic clove",
    "6 tablespoons smooth peanut butter (or almond or sunflower seed butter)",
    "2.5 tablespoons fresh lime juice",
    "2 tablespoons low-sodium tamari (or coconut aminos)",
    "1-2 tablespoons water, as needed",
    "1/2 tablespoon pure maple syrup (or other sweetener)",
    "1 teaspoon freshly grated ginger",
    "1/8 teaspoon cayenne pepper"
  ],
  "__v": 1
}