{
  "hash": "c2c258063a9409ff1877c82893f4ce3fb97ca822",
  "title": "Crunchy Tater Tots from Scratch",
  "image": "http://img.sndimg.com/food/image/upload/w_614,h_461,c_fit/v1/img/submissions/recipe/0/4YW4mGVRTigM45S50X62_Tater%20Tots.JPG",
  "href": "http://www.food.com/recipe/crunchy-tater-tots-from-scratch-523310",
  "extension": "Chrome",
  "firstAdded": "2015-10-06T04:03:05.761000",
  "users": [
    null
  ],
  "keywords": [
    "medium",
    "potatoes",
    "allpurpose",
    "flour",
    "egg",
    "lightly",
    "salt",
    "black",
    "pepper",
    "oil",
    "frying"
  ],
  "directions": [
    "0",
    "In a large size sauce pan or Dutch oven, place peeled potatoes with water and bring to a rapid boil un-covered, cook the potatoes until slightly fork tender, but still firm in the center, (about 15 to 20 minutes).",
    "Let potatoes cool completely, then grate them using a cheese grater or food mill, you can also smash them with a fork for a more lumpy texture.",
    "Add the flour, egg, salt and pepper and mix by gently folding until completely combined.",
    "Form into small 1 inch balls, and then shape them into a small size barrel shapes, (pictured).",
    "Place them in the freezer for about 1 hour to let them cool completely and firm up.",
    "Heat the oil in a large size skillet, Dutch oven or fryer to 350 degrees F. and then fry the cooled tots until golden brown on all sides, (about 2 to 3 minutes). Drain excess oil on paper towels.",
    "You can freeze the tots after frying. (If you are planning on freezing for a later time, don’t fry tots completely golden brown, you can brown them to perfection later in the oven). Place into a freezer zip-lock bag and freeze for up to 3 months.",
    "Remove from the freezer when you need them and bake on a greased cookie sheet in a 400 degree F. oven for 12 to 15 minutes or until golden brown and crispy.",
    "Makes about 6 dozen 1 1/2 inch tots."
  ],
  "ingredients": [
    "0",
    "6 medium potatoes, peeled and whole",
    "1⁄2 cup all-purpose flour",
    "1 large egg, lightly beaten",
    "1 1⁄2 teaspoons salt",
    "1⁄4 teaspoon black pepper",
    "1 -2 cup oil, for frying"
  ],
  "__v": 1
}