{
  "hash": "c715a44c350f7d81d92357bd7a6008ab7239db2c",
  "title": "Blue Apron's Chicken Supremes with Sugar Snap Peas, Ramps and Sweet Potatoes",
  "image": "http://a.abcnews.com/assets/images/font-sm_off2.gif",
  "href": "http://abcnews.go.com/GMA/recipe/chicken-supremes-recipe-blue-apron-23636002?nwltr=GMAR_tryPic_pos2",
  "extension": "Chrome",
  "firstAdded": "2015-04-17T16:19:36.503000",
  "users": [
    null
  ],
  "keywords": [
    "sugar",
    "snap",
    "peas",
    "garlic",
    "bunch",
    "ramps",
    "lemon",
    "potatoes",
    "chicken",
    "supremes",
    "bonein",
    "skinon",
    "breasts",
    "thyme",
    "butter"
  ],
  "directions": [
    "0",
    "Wash and dry the fresh produce. Heat a large pot of salted water to boiling on high. Slice the sugar snap peas on an angle. Peel and slice the garlic. Trim off and discard the roots of the ramps, then roughly chop the remaining white bottoms and green leaves. Cut the lemon into quarters and remove the seeds. Peel and cut the sweet potato into large pieces.",
    "Once the water is boiling, add the sweet potato and cook 14 to 16 minutes, or until very tender when pierced with a fork. Drain thoroughly and return the to the pot. Add half the butter (save the rest for the chicken) and a drizzle of olive oil, then, using a fork, mash the sweet potatoes until smooth; season with salt and pepper to taste.",
    "While the sweet potatoes cook, pat the chicken dry with paper towels, then season both sides with salt and pepper. In a large pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the seasoned chicken to the pan, skin side down first, and loosely cover the pan with aluminum foil. Cook 4 to 6 minutes on the first side, or until browned.",
    "Flip the chicken and cook 4 to 6 minutes, or until browned and cooked through. Turn off the heat and add the garlic, remaining butter and lemon thyme sprigs. Once the butter melts, spoon the butter sauce over the chicken until thoroughly coated. Transfer the cooked chicken and thyme springs to a plate to rest; leave the garlic and any drippings in the pan.",
    "Add 2 teaspoons of olive oil to the pan with the garlic and drippings and heat on medium until hot. Add the ramps and cook, stirring frequently, 30 seconds to 1 minute, or until fragrant and slightly softened. Add the sugar snap peas and cook, stirring occasionally, 2 to 3 minutes, or until bright green and slightly tender; season with salt and pepper to taste.",
    "Slice the chicken breasts crosswise on an angle. Divide the mashed sweet potatoes and saut??ed vegetables between 2 plates. Top each plate with the juice of 1 lemon wedge and a drizzle of olive oil. Garnish with the remaining lemon wedges. Enjoy!"
  ],
  "ingredients": [
    "0",
    "6 Ounces Sugar Snap Peas",
    "2 Cloves Garlic",
    "1 Bunch Ramps",
    "1 Lemon",
    "2 Sweet Potatoes",
    "2 Chicken Supremes (Bone-In, Skin-On Breasts)",
    "1 Bunch Lemon Thyme",
    "2 Tablespoon Butter"
  ],
  "__v": 1
}