{
  "hash": "566485345eef37bae445da19783336a6fa164939",
  "title": "Roasted Potato and Asparagus Lentil Salad with Tangy Mustard-Lemon Dressing",
  "image": "",
  "href": "http://ohsheglows.com/2014/04/25/roasted-potato-and-asparagus-lentil-salad-with-tangy-mustard-lemon-dressing/",
  "extension": "Chrome",
  "firstAdded": "2015-03-21T21:07:11.477000",
  "users": [
    null
  ],
  "keywords": [
    "salad",
    "uncooked",
    "french",
    "green",
    "lentilsdu",
    "puy",
    "lentils",
    "medium",
    "yellow",
    "potatoes",
    "bunch",
    "asparagus",
    "ends",
    "broken",
    "red",
    "onion",
    "extra",
    "virgin",
    "olive",
    "oil",
    "divided",
    "dill",
    "dressing",
    "makes",
    "coarse",
    "seededold",
    "fashioned",
    "mustard",
    "post",
    "dijon",
    "lemon",
    "juice",
    "pink",
    "salt"
  ],
  "directions": [
    "0",
    "Preheat the oven to 425F and line two large baking sheets with parchment paper.",
    "Rinse lentils in a fine mesh sieve. Place lentils in a medium pot along with 3 cups of water. Bring water to a boil and then reduce heat to medium and simmer the lentils for about 18-20 minutes, or until tender. Drain off water and season lentils with salt (such as Herbamare).",
    "Place chopped potatoes on one baking sheet and drizzle with 1/2 tablespoon oil. Toss to coat and sprinkle liberally with salt and pepper.",
    "Roast the potatoes for 15 minutes. Meanwhile, place the asparagus on the other baking sheet (and the red onion if you prefer to roast it too - see headnote) and drizzle with 1/2 tbsp. oil. Sprinkle with salt and pepper.",
    "After the potatoes have roasted for 15 minutes, flip the potatoes and return them to the oven along with the asparagus (and red onion if you are roasting that) for another 12-15 minutes. The potatoes should be golden on the bottom when ready and the asparagus will be tender. Add roasted veggies into a large bowl along with the lentils and gently toss to combine.",
    "Meanwhile, prepare the dressing by whisking all of the dressing ingredients together. I love a tangy dressing with a bite so I used 4 tbsp. lemon juice. If you prefer a less acidic dressing you might want to add more olive oil or you can also experiment with adding a touch of maple syrup (the sweetness will offset a bit of the bite). It's definitely a dressing you can play around with!",
    "Pour half of the dressing onto the veggies and lentils in the bowl and toss to combine. Season with salt and pepper to taste. Serve the salad warm with a garnish of fresh dill (optional), with the rest of the dressing served on the side."
  ],
  "ingredients": [
    "0",
    "FOR THE SALAD:",
    "1 cup uncooked French green lentils/du Puy lentils (about 2 1/2 cups cooked)",
    "3 medium yellow potatoes, diced (about 3 1/2 cups)",
    "1 bunch asparagus, ends broken off and chopped",
    "1/2 medium red onion, diced (about 1 1/2 cups)",
    "1 tablespoon extra virgin olive oil, divided",
    "handful minced fresh dill, for garnish (optional)",
    "FOR THE DRESSING (MAKES 2/3 CUP):",
    "2 tablespoons coarse seeded/old fashioned mustard (see photo in post)",
    "2 tablespoons Dijon mustard",
    "4 tablespoons extra virgin olive oil",
    "3-4 tablespoons fresh lemon juice, to taste",
    "pinch or two fine grain sea salt or pink salt"
  ],
  "__v": 2
}