{
  "hash": "49cde6491d4ad03713f5be9588c7e718e984e0e2",
  "title": "Recipe Notes",
  "image": "http://p-fst2.pixstatic.com/556677352a099a299a0071f9/_w.540_s.fit_/2015-05-25-Lettuce-Radishes-Recipes-1.jpg",
  "href": "http://www.thekitchn.com/recipe-jeffrey-alford-amp-naomi-duguids-lettuce-salad-with-hot-beef-dressing-recipes-from-the-kitchn-218920",
  "extension": "Chrome",
  "firstAdded": "2016-01-14T16:49:38.226000",
  "users": [
    null
  ],
  "keywords": [
    "coarsely",
    "torn",
    "romaine",
    "lettuce",
    "peanut",
    "oil",
    "garlic",
    "ginger",
    "beef",
    "salt",
    "soy",
    "water",
    "cornstarch",
    "cold",
    "roasted",
    "sesame"
  ],
  "directions": [
    "0",
    "About 4 packed cups coarsely torn romaine lettuce (see Note)",
    "For the hot beef dressing: 1 tablespoon peanut oil or vegetable oil 1 tablespoon minced garlic 1 tablespoon minced ginger 1/2 pound (1 packed cup) ground beef 1/2 teaspoon salt, or to taste 1 tablespoon soy sauce, or to taste 1 tablespoon Jinjiang (black rice) vinegar, or to taste 1/2 cup warm water 2 teaspoons cornstarch 1 tablespoon cold water 1/2 teaspoon roasted sesame oil",
    "Place the lettuce in a wide salad bowl or serving dish and set aside.",
    "To make the hot beef dressing, place a wok or heavy skillet over medium-high heat. When it is hot, add the oil and swirl to coat the bottom of the pan. Toss in the garlic and stir-fry for 10 seconds, then add the ginger. Stir-fry over medium-high to medium heat until slightly softened and starting to turn color.",
    "Add the meat and use your spatula to break it up so there are no lumps at all, then add the salt and stir-fry until most of the meat has changed color. Add the soy sauce and vinegar and stir to blend. Add the warm water and stir. (The hot beef dressing can be prepared ahead to this point and set aside for up to 20 minutes. When you are ready to proceed, bring the dressing to a boil.)",
    "While the beef dressing mixture is coming to a boil, place the cornstarch in a small cup or bowl and stir in the cold water to make a smooth paste. Once the liquid is bubbling in the pan, give the cornstarch mixture a final stir, add to the pan, and stir for about 1 minute; the liquid will thicken and become smoother.",
    "Taste for salt, and add a little salt or soy sauce if you wish. Add the sesame oil and stir once, then pour the hot dressing onto the lettuce. Immediately toss the salad to expose all the greens to the hot dressing. Serve immediately (or see Note).",
    "→ Check out the book! Beyond the Great Wall by Naomi Duguid and Jeffrey Alford",
    "Reprinted with permission from Beyond the Great Wall by Naomi Duguid and Jeffrey Alford, copyright © 2008. Published by Artisan."
  ],
  "ingredients": [
    "0",
    "About 4 packed cups coarsely torn romaine lettuce (see Note)",
    "1 tablespoon peanut oil or vegetable oil",
    "1 tablespoon minced garlic",
    "1 tablespoon minced ginger",
    "1/2 pound (1 packed cup) ground beef",
    "1/2 teaspoon salt, or to taste",
    "1 tablespoon soy sauce, or to taste",
    "1/2 cup warm water",
    "2 teaspoons cornstarch",
    "1 tablespoon cold water",
    "1/2 teaspoon roasted sesame oil"
  ],
  "__v": 1
}