{
  "hash": "8a672fdca7bb94f72590edc0ca48d11d18d1b6bf",
  "title": "Coconut Curried Kale and Sweet Potato",
  "image": "http://cookieandkate.com/images/2015/03/coconut-curried-kale-and-sweet-potato.jpg",
  "href": "http://cookieandkate.com/2015/coconut-curried-kale-and-sweet-potato-recipe/",
  "extension": "Chrome",
  "firstAdded": "2015-08-12T14:19:04.337000",
  "users": [
    null
  ],
  "keywords": [
    "extravirgin",
    "olive",
    "oil",
    "divided",
    "onion",
    "potato",
    "butternut",
    "squash",
    "cubes",
    "garlic",
    "pressed",
    "ginger",
    "curry",
    "bunches",
    "kale",
    "stemmed",
    "broth",
    "fullfat",
    "coconut",
    "milk",
    "lime",
    "juice",
    "pepitas",
    "green",
    "pumpkin",
    "seeds",
    "salt",
    "black",
    "pepper",
    "red",
    "brown",
    "basmati",
    "rice",
    "rinsed"
  ],
  "directions": [
    "0",
    "To cook the rice, bring a large pot of water to boil. Add the rinsed rice and cook for 30 minutes, reducing heat as necessary to prevent overflow but keep the water boiling. Turn off the heat, drain the rice and return the rice to pot. Cover and let the rice rest for 10 minutes or longer, until you're ready to serve.",
    "Meanwhile, warm 2 tablespoons olive oil in a Dutch oven over medium heat until shimmering. Add onion and cook, stirring frequently, until softened, about 5 minutes. Add sweet potato or squash, cover and cook, stirring occasionally, until the sweet potato is bright orange (or until the butternut is just beginning to brown), about 5 minutes. Transfer the mixture to a bowl for now.",
    "Add 1 tablespoon olive oil to the pot and raise the heat to medium-high. Add garlic, ginger and curry powder and cook, stirring constantly, until fragrant, about 30 seconds. Add half of the kale and stir until it's beginning to wilt, about 1 minute. Stir in remaining greens, broth, all but ½ cup coconut milk and ½ teaspoon salt.",
    "Cover pot, reduce heat to medium low, and cook, stirring occasionally, until kale is wilted, about 12 to 15 minutes. Pour in sweet potato or squash mixture, cover and continue to cook until kale and sweet potato or squash are tender, 10 to 20 minutes.",
    "Meanwhile, toast the pepitas in a medium skillet over medium-low heat, stirring frequently, until they're fragrant and making little popping noises, about 3 to 5 minutes. Transfer to a bowl to cool.",
    "Once the kale and sweet potato/squash are tender, uncover the pot and increase heat to medium-high. Cook, stirring occasionally, until most of the liquid has evaporated and sauce has thickened, 2 to 5 minutes.",
    "Remove from heat and stir in the remaining coconut milk. Add the lime juice and season with salt, pepper and optional red pepper flakes, to taste. Divide rice into bowls, then top with kale mixture and a generous sprinkling of pepitas before serving."
  ],
  "ingredients": [
    "0",
    "3 tablespoons extra-virgin olive oil, divided",
    "1 onion, chopped",
    "2 pounds sweet potato or butternut squash, peeled and sliced into ½-inch cubes",
    "5 garlic cloves, pressed or minced",
    "2 teaspoons grated fresh ginger",
    "1 teaspoon curry powder",
    "2 large bunches of kale (about 2 pounds), stemmed and chopped",
    "1 cup vegetable broth",
    "1 (14-ounce) can full-fat coconut milk",
    "1 tablespoon lime juice",
    "⅓ cup pepitas (green pumpkin seeds)",
    "Salt, to taste",
    "Freshly ground black pepper, to taste",
    "Red pepper flakes (optional), to taste",
    "1",
    "1½ cups brown basmati rice, rinsed",
    "Salt, to taste"
  ],
  "__v": 1
}