{
  "hash": "8c33e58945b125a565844a240547467ebace1101",
  "title": "Bizcocho de convento",
  "image": "http://3.bp.blogspot.com/-jQA8OQelclY/VWLTmQaHq0I/AAAAAAAAHNU/ZhZwG_Db53Y/s400/DSCN7654.JPG",
  "href": "http://www.caceroladas.com/2015/05/bizcocho-de-convento.html",
  "extension": "Chrome",
  "firstAdded": "2015-07-03T12:13:43.135000",
  "users": [
    null
  ],
  "keywords": [
    "ingredientes",
    "huevos",
    "pequeos",
    "sobre",
    "levadura",
    "vasos",
    "los",
    "agua",
    "azcar",
    "harina",
    "vaso",
    "aceite",
    "girasol",
    "leche",
    "ralladura",
    "limn",
    "cucharaditas",
    "ans",
    "esencia",
    "vainilla",
    "mantequilla",
    "para",
    "untar",
    "molde",
    "glass",
    "decorar"
  ],
  "directions": [
    "0",
    "Preparación:",
    "Lo primero que haremos será precalentar el horno a unos 180º calor arriba y abajo.",
    "En un bol añadimos los 4 huevos de tamaño L (si fueran pequeños ponemos 5) y con la medida de un vaso normal de agua ponemos el azúcar y mezclamos bien con una barilla manual o máquina hasta que salga espumilla.",
    "Seguidamente incorporamos el vaso de leche y el vaso de aceite de girasol.... mezclamos de nuevo.",
    "El siguiente paso será añadir los ingredientes secos, la harina tamizada que incorporamos en tandas.... primero un vaso y mezclamos, hasta llegar a los tres vasos.",
    "Ponemos el sobre de levadura.",
    "Ahora le pondremos la esencia que mas nos guste... ralladura de limón, esencia de vainilla o un chupito de anís.. eso ya es opcional.",
    "Mezclar todo muy bien hasta obtener una masa homogénea y sin grumos.",
    "Untaremos un molde grande con mantequilla y un poco de harina para que nos sea mas fácil el desmoldarlo después.",
    "Metemos al horno a 170-180º unos 60-70 minutos dependiendo de la potencia del horno.",
    "Dejaremos enfriar y espolvoreamos con azúcar glass o impalpable.",
    "Fácil no?",
    "Os animo a prepararlo que seguro que os encantará y como veis es muy sencillo con productos muy básicos y desde luego que tendréis bizcocho para rato....."
  ],
  "ingredients": [
    "0",
    "Ingredientes:",
    "4 Huevos L o 5 pequeños.",
    "1 Sobre de Levadura.",
    "2 vasos (de los de agua) de azúcar.",
    "3 vasos (de los de agua) de harina.",
    "1 vaso (de los de agua) de aceite de girasol.",
    "1 vaso (de los de agua) de leche.",
    "Ralladura de limón o 2 cucharaditas de anís o esencia de vainilla.",
    "Mantequilla para untar el molde.",
    "Azúcar glass para decorar."
  ],
  "__v": 1
}