{
  "hash": "14dbcd5883e61895efe8ecd8056496df8eb2c6e3",
  "title": "Mediterranean Roasted Sweet Potato & Farro Salad",
  "image": "https://cookieandkate.com/images/2016/03/mediterranean-sweet-potato-farro-salad.jpg",
  "href": "https://cookieandkate.com/2016/mediterranean-sweet-potato-farro-salad-recipe/",
  "extension": "",
  "firstAdded": "2018-05-01T16:14:35.163000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 425 degrees Fahrenheit. To cook the farro: Bring a large pot of salted water to boil over high heat. Add the farro, then reduce heat to maintain a simmer. Cook, stirring occasionally, until the farro is tender to the bite but still pleasantly chewy (pearled farro will take as little as 15 minutes; unprocessed farro will take 25 to 40 minutes). Drain off the excess water and return the farro to the pot. Set aside.",
    "To roast the sweet potatoes: Line a large, rimmed baking sheet with parchment paper for easy cleanup. Place the cubed sweet potato on the pan and drizzle with enough olive oil to lightly coat the sweet potatoes. Sprinkle the sumac over the sweet potatoes, followed by salt and pepper, then toss until the sweet potatoes are thoroughly coated in oil and spices. Arrange the sweet potatoes in a single layer and roast for 20 to 30 minutes, tossing halfway, until they are caramelized on the edges and tender when pierced with a fork.",
    "To pickle the onion: In a small pan or medium pot, combine the onion, vinegar, sugar and ½ cup water. Cook over medium heat, occasionally swirling the pan, for 4 to 8 minutes, or until the sugar has dissolved and the liquid is slightly reduced in volume. Remove from heat and set aside.",
    "Once the farro is done cooking, add the chopped kale to the pot. Drizzle with olive oil, then stir to combine. Season with salt (I added ¼ teaspoon) and pepper, to taste.",
    "To assemble the salad: Drain the excess liquid from the pickled onions, then add the onions to the pot of farro and kale. Add the roasted sweet potatoes and squeeze an entire lemon’s worth of juice into the pot. Stir to combine and season generously with salt and pepper, to taste. Divide the salad into individual bowls and top each one with mint leaves, chopped hazelnuts and crumbled cheese."
  ],
  "ingredients": [
    "0",
    "¾ cup farro (the semi-pearled variety cooks faster)",
    "1 pound sweet potatoes (1 large or 2 small), peeled and sliced into 1” cubes",
    "1 to 2 tablespoons olive oil, plus more for drizzling",
    "2 teaspoons ground sumac (optional but recommended)",
    "Salt, to taste",
    "Freshly ground black pepper, to taste",
    "1 bunch Tuscan kale (also known as Lacinato kale), ribs removed and chopped into bite-sized pieces",
    "1 small red onion, halved and thinly sliced",
    "2 tablespoons red wine vinegar",
    "2 tablespoons sugar or honey or maple syrup",
    "1 medium lemon",
    "1 handful fresh mint leaves",
    "3 tablespoons roughly chopped hazelnuts",
    "⅓ cup (about 2 ounces) crumbled salata cheese or feta cheese (optional)"
  ],
  "__v": 1
}