{
  "hash": "db2dcef4cd4a20773595af8b7182036c58176ea7",
  "title": "HESTON’S LEMON TART",
  "image": "https://78.media.tumblr.com/tumblr_lngthjmEq01qiwoc6.png",
  "href": "http://aspoonful-of-sugar.tumblr.com/post/7020198775/hestons-lemon-tart",
  "extension": "Chrome",
  "firstAdded": "2018-05-30T11:38:55.185000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Method:",
    "Preheat the oven to 180°C, gas mark 4.",
    "Roll the pastry between 2 sheets of clingfilm to a thickness of 2mm. It should be 10cm wider than the tart case.",
    "Peel off the clingfilm, roll the pastry around a rolling pin, lift it over a 23cm tart case and unroll it so the edges hang over the sides.",
    "Press the pastry to fit the tin leaving the edges overhanging to trim after baking (this will ensure the tart case is unaffected by the pastry shrinking). Prick with a fork and leave to rest in the fridge for 30 minutes.",
    "Take a sheet of parchment larger than the tart tin, scrunch it up and lay over the pastry (this will make it easier to fit into the edges of the tart). Place baking beans on top and bake for 20 minutes.",
    "Remove the parchment and beans and return the tart to the oven for 10 minutes until golden brown. Remove from the oven and allow to cool completely before running a knife around the tin edge to remove the excess pastry. Carefully lift the tart case out of the tin and place on a serving plate.",
    "While the case is cooling, zest 3 lemons and reserve, then roll all 4 of the lemons on a work surface with the palm of your hand (to release more juice). Juice them and measure out 150ml.",
    "Put the butter and sugar into a pan with the juice, zest and eggs and place the pan over a medium heat. Stir continuously for 10-15 minutes (do not allow to simmer) until the butter has melted and the sugar has dissolved.",
    "Increase the heat to medium-high and stir until it begins to simmer; simmer for 5 seconds only, then remove from the heat. Pass the mixture through a fine sieve into a bowl. Cover with clingfilm to avoid a skin forming, and place the bowl in the fridge to cool for 30 minutes.",
    "When cold, pour the lemon filling into the centre of the tart allowing the lemon curd to flow evenly to the edges. Place in the fridge for at least 1 hour or until set, before serving with crème fraîche and fresh raspberries."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "375g All Butter Shortcrust Pastry",
    "4 Unwaxed Lemons* (juice of 4, finely grated zest of 3)",
    "170g unsalted butter, cubed",
    "220g unrefined, golden caster sugar",
    "5 medium Free Range Eggs,",
    "1 medium Free Range Egg yolk, beaten",
    "(You will also need some baking beans)"
  ],
  "__v": 1
}