{
  "hash": "2bdec7a3292b9ab68fea7483db2f6d729f0068e0",
  "title": "Savory Tempeh Breakfast Hash",
  "image": "https://bg6fhgmkni-flywheel.netdna-ssl.com/wp-content/uploads/2018/02/hash-1@2x-683x1024.jpg",
  "href": "https://wellvegan.com/breakfast/savory-tempeh-breakfast-hash",
  "extension": "Firefox",
  "firstAdded": "2019-05-25T16:33:31.020000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Bring a pot of water to a boil and fit it with a steamer basket. Slice the tempeh into 1-inch strips and steam, covered, for 10 minutes.",
    "Meanwhile, combine the soy sauce or tamari, sesame oil, rice vinegar, garlic, and maple syrup or agave in a Ziplock bag or Tupperware. Add the steamed tempeh to the container and shake to coat. Allow the tempeh to marinate for at least 20 minutes, or overnight if you remember.",
    "While the tempeh marinates, dice the potatoes and onion. Put the broccoli in your food processor and pulse until finely chopped, or shred with a sharp knife.",
    "Warm a cast iron skillet over medium heat. When hot, add a tablespoon of grapeseed oil and swirl to coat the bottom of the pan. Add the potato and season with a pinch of salt and black pepper. Cook until tender and golden, about 15 minutes, stirring frequently to prevent the pieces from sticking to the skillet. When done, remove from heat, transfer potatoes to a plate, and set aside.",
    "Remove the tempeh from the marinade, transfer it to a cutting board, and give it a rough chop. Carefully wipe the skillet clean and return to medium heat. Add another tablespoon of grapeseed oil and swirl the pan to coat the bottom. Spill the chopped tempeh into the skillet and use a spatula to break up the pieces. Cook for 7 minutes, until golden. Then add the onion and cook for 3 minutes more, until softened and lightly browned on the edges. Remove from heat, transfer tempeh to a plate, and set aside.",
    "Carefully wipe the skillet clean one last time and warm over medium-low heat. When hot, add a teaspoon of grapeseed oil and the tomatoes. Cook for 3 to 5 minutes, allowing the tomatoes to blister and sputter. Gently press down on the tomatoes with a spatula to help them release their juices. Then stir in the broccoli.",
    "Continue to cook until the broccoli is bright green, about a minute. Return the potatoes and tempeh to the pan and toss to combine the flavors. Remove from heat and serve warm with avocado and hot sauce, if desired."
  ],
  "ingredients": [
    "0",
    "8 oz. tempeh",
    "¼ cup soy sauce or tamari",
    "2 tsp. sesame oil",
    "1 Tbsp. rice vinegar",
    "2 garlic cloves, minced",
    "1 tsp. maple syrup or agave",
    "2 Tbsp. + 1 tsp. grapeseed oil",
    "3 small red or yellow potatoes, diced into ½-inch pieces (about 2 cups)",
    "½ white onion, diced",
    "1 small head of broccoli, shredded (about 1 ½ cups)",
    "Pinch of salt and black pepper",
    "1 ½ cups grape or cherry tomatoes",
    "Avocado, for serving (optional)",
    "Hot sauce, for serving (optional)"
  ],
  "__v": 1
}