{
  "hash": "2383c6b3d47f592d1b07df75d8de941c2b43d0c8",
  "title": "Crock Pot Chicken and Stuffing",
  "image": "http://thecozycook.com/wp-content/uploads/2015/06/Crock-Pot-Chicken-and-Stuffing-..jpg",
  "href": "http://thecozycook.com/crock-pot-chicken-and-stuffing/",
  "extension": "Chrome",
  "firstAdded": "2017-03-28T23:00:04.884000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Sprinkle the chicken with salt/pepper/parsley and place on the bottom of the crock pot.",
    "In a large bowl, mix together the soup, sour cream, stuffing, and half of the water/broth and place over the chicken.(Mix in the optional ingredients as well, if you choose)",
    "Lay the stuffing evenly over the chicken.",
    "To keep the vegetables separate from the stuffing, place a layer of foil over the stuffing, then place your vegetables on top of the foil. This makes it easier to lift the veggies out and stir the stuffing, if you're able.",
    "Add the remaining water/broth during the cooking process as needed. I always use all of it but crock pots cook differently, so adding as needed is safer. If you're leaving for the day, add the remaining water/broth when you return if you feel you need it.",
    "Cook on high for 4 hours, or on low for 6-7",
    "*No need to cook the stuffing mix prior to adding to crock pot"
  ],
  "ingredients": [
    "0",
    "3-4 large boneless skinless chicken breasts, salted and peppered if desired.",
    "1 teaspoon dry parsley",
    "1(10.5) ounce can of cream of chicken soup",
    "8 oz. sour cream (equivalent to 1 cup)",
    "1 (6 oz.) box stuffing mix* (Stove Top & Pepperidge Farm are a few of my favs)",
    "¾ cup low-sodium chicken broth (you can also use water)- Only use ½ cup at first, add more as needed.",
    "2 cups fresh or frozen green beans",
    "1 cup baby carrots",
    "1",
    "½ cup diced onions",
    "½ cup diced celery",
    "¼ cup dried cranberries",
    "½ cup crumbled sausage (cooked or raw)- (I use Banquet Brown 'N Ready pre-cooked sausage links, diced)",
    "Rosemary, to taste (I use 1 tablespoons of fresh rosemary if I have it on hand)"
  ],
  "__v": 1
}