{
  "hash": "54300e397d62bc690251b25f6401aecc3cf30720",
  "title": "MAROKKAANSE KEFTA",
  "image": "http://www.francescakookt.nl/wp-content/uploads/marokkaanse-kefta-3-680x450.jpg",
  "href": "http://www.francescakookt.nl/marokkaanse-kefta/",
  "extension": "Chrome",
  "firstAdded": "2016-09-28T20:18:41.071000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Maak een kruisje in het vel van de tomaat en leg in een kom of pan. Overgiet met kokend water en laat 10 minuten staan. Daarna kun je heel gemakkelijk het vel van de tomaten aftrekken. Hak de tomaten fijn of stamp ze met een pureestamper (zo doe ik het altijd). Snipper de sjalot en hak de knoflook fijn.",
    "Meng in de tussentijd het gehakt met de koriander, ras el hanout, komijnpoeder, pimentpoeder, pimenton, nootmuskaat, pijnboompitten en een snuf zeezout en zwarte peper in een kom en kneed met je handen door elkaar. Voor een nog rijkere smaak laat je dit nog een aantal uren intrekken terwijl je de kom afgedekt in de koelkast zet, maar het hoeft niet. Rol er kleine gehaktballetjes van.",
    "Zet een grote braadpan op het vuur (dit kan uiteraard ook in een tajine bereid worden) en fruit de sjalot en knoflook in 2 eetlepels olijfolie. Schenk de tomaat erbij met een snuf zout en laat dit een paar minuten pruttelen. Nu gaan de gehaktballetjes erbij. Deze kun je eerst even bruin aanbakken in een andere pan en dan toevoegen aan de tomatensaus of je legt ze direct in de saus en laat ze daarin garen. Laat dit 15-20 minuten stoven. Proef en breng eventueel extra op smaak.",
    "Serveer in ieder geval met flatbread of Turks brood om in de zalige saus te dopen. Ik vind het ook lekker om er rijst en roergebakken spinazie bij te serveren."
  ],
  "ingredients": [
    "0",
    "Wat je nodig hebt voor 4 personen",
    "- 6 smaakvolle tomaten",
    "- 1 sjalot",
    "- 4 teentjes knoflook",
    "- 400gr lamsgehakt",
    "- klein bosje koriander, fijngehakt",
    "- 1tl ras el hanout",
    "- 1tl komijnpoeder",
    "- 1/2tl pimentpoeder",
    "- 1/2tl pimenton (gerookt paprikapoeder)",
    "- mespuntje nootmuskaat",
    "- 2el pijnboompitten, fijngehakt",
    "- zeezout",
    "- zwarte peper",
    "- olijfolie",
    "- om te serveren: bijvoorbeeld flatbread (of Turks brood), roergebakken spinazie (met sjalot en knoflook) en (zilvervlies)rijst"
  ],
  "__v": 1
}