{
  "hash": "b73a1c1e81d109bf5cb8d155eda53966e6a81080",
  "title": "Bolognese Sauce Recipe (Instant Pot)",
  "image": "https://stripedspatula.com/wp-content/uploads/2018/02/bolognese-sauce-instant-pot-1-680x952.jpg",
  "href": "https://stripedspatula.com/bolognese-sauce-recipe-instant-pot/",
  "extension": "",
  "firstAdded": "2019-01-03T15:24:21.377000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Heat olive oil in the Instant Pot insert on the hottest sauté setting. Add onions, carrots, and celery, and cook until softened and lightly browned, about 8-10 minutes.",
    "Add ground beef, pork, and pancetta to the Instant Pot with 1 teaspoon kosher salt and 1/2 teaspoon freshly-ground black pepper. Sauté, breaking up meats with a spoon, until lightly-browned and most of the juices have evaporated.",
    "Add garlic and tomato paste to the Instant Pot, and cook for 1 minute, until fragrant. Deglaze the insert with red wine, scraping up any brown bits from the bottom. Simmer for 2-3 minutes, until most of the wine has evaporated.",
    "Stir in crushed tomatoes in purée, water, and 1/4 cup chopped parsley. Bring to a simmer. Place lid on Instant pot, seal, and set the unit to HIGH pressure for 20 minutes.",
    "Quick release pressure and carefully lift lid when the float drops. Switch the Instant Pot to the lowest heat sauté setting and bring to a bubble. Simmer, uncovered, for 5-10 minutes, stirring often, until the sauce is thickened to your desired consistency.",
    "Stir in heavy cream and remaining 1/4 cup chopped parsley. Season to taste with salt and pepper.",
    "Serve over cooked pasta with plenty of freshly-grated cheese and a sprinkling of parsley, if desired."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 tablespoon olive oil",
    "1-1/2 cups diced yellow onion",
    "1/2 cup diced carrots",
    "1/2 cup diced celery",
    "1 pound ground beef chuck",
    "1/2 pound ground pork",
    "4 ounces diced pancetta",
    "2 cloves garlic , minced",
    "2 tablespoons tomato paste",
    "1/2 cup dry red wine",
    "28 ounces crushed San Marzano tomatoes , in purée",
    "1/2 cup water",
    "1/2 cup Italian parsley , divided",
    "1/4 cup heavy cream",
    "kosher salt and freshly-ground black pepper",
    "cooked tagliatelle, pappardelle, or your favorite pasta , for serving"
  ],
  "__v": 1
}