{
  "hash": "a063c9ca0811f082e437fc7683404a3eb48947df",
  "title": "Scallops with Blood Orange, Fennel and Pistachios",
  "image": "http://recipe-folder.com/img/recipe-images/026/913/1883285126.jpg",
  "href": "http://www.foodandwine.com/recipes/scallops-blood-orange-fennel-and-pistachios",
  "extension": "Firefox",
  "firstAdded": "2017-05-16T00:29:03.271000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large bowl, soak the fennel in ice water. Peel the blood oranges with a sharp knife, being sure to remove all of the bitter white pith. Working over a bowl, cut in between the membranes to release the sections.",
    "In a medium bowl, whisk the 6 tablespoons of blood orange juice with 1/4 cup of the olive oil and season with salt and pepper. Drain the fennel and pat dry. Add it to the dressing and toss to coat. Mound the salad on 10 plates.",
    "In a large skillet, heat the remaining 1/2 cup of oil until shimmering. Season the scallops with salt and pepper and rub with the fennel pollen. Add the scallops to the skillet and cook over high heat until browned on the bottom, about 3 minutes. Add the butter and capers to the skillet. Turn the scallops over and cook just until white throughout, 2 minutes longer. Set the scallops on the fennel salad.",
    "Cook the capers, basting them with the fat in the pan, until browned and crisp, 2 minutes. Scatter the capers, olives, pistachios and orange sections all around and serve."
  ],
  "ingredients": [
    "0",
    "2 small fennel bulbs—halved, cored and very thinly shaved on a mandoline",
    "2 blood oranges",
    "6 tablespoons fresh blood orange juice",
    "3/4 cup extra-virgin olive oil",
    "Salt",
    "Freshly ground pepper",
    "10 large sea scallops",
    "1 teaspoon fennel pollen",
    "2 tablespoons unsalted butter",
    "2 tablespoons brined capers, drained and patted dry",
    "1/4 cup sliced green olives",
    "1/4 cup unsalted roasted pistachios, coarsely chopped"
  ],
  "__v": 1
}