{
  "hash": "04f7c74f97e21f763ee40331ebc7e9e66ad71a3e",
  "title": "French Silk Pie",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/ree-drummond/french-silk-pie.html",
  "extension": "Chrome",
  "firstAdded": "2016-10-19T21:14:08.038000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the crust: Preheat the oven to 350 degrees F.",
    "Crush the crackers in a food processor or resealable bag. Pour them into a bowl and stir in the melted butter and sugar. Press into a pie pan and bake until golden and set, 5 minutes. Remove from the oven and set aside to cool slightly.",
    "For the filling: In a small microwave-safe bowl, melt the baking chocolate until stirrable (about 45 seconds on high). Set aside to cool.",
    "It is important for the bowl and ingredients to be cold for the next stage of making the filling--to get the right texture and result. In a large chilled bowl with an electric mixer, beat the sugar and butter until fluffy, 1 to 2 minutes.",
    "When the melted chocolate is cooled, drizzle it over the butter/sugar mixture. Add the vanilla extract. Beat the mixture thoroughly until combined (on a stand mixer, you will be using the whisk attachment).",
    "Turn your mixer to a medium speed and over a period of 15 to 20 minutes, add in the 4 cold eggs, one at a time, leaving about 5 minutes between each egg addition. Once the pie filling is well mixed, pour it into the baked pie shell, scraping every last speck of it out of the bowl. Smooth out the pie filling and place the pie in the refrigerator to chill for at least 2 hours (preferably longer).",
    "For the topping: Add the heavy cream and sugar to the bowl of an electric mixer fitted with the whisk attachment and whip until it is stiff. Cover the pies with a thick layer of cream. Grate the semisweet chocolate over the top.",
    "Contains Raw Eggs: The Food Network Kitchen suggest caution in consuming raw and lightly cooked eggs due to the slight risk of salmonella or other food-borne illness. To reduce this risk, we recommend you use only fresh, properly refrigerated, clean grade A or AA eggs with intact shells, and avoid contact between the yolks or whites and the shell. For recipes that call for eggs that are raw or undercooked when the dish is served, use shell eggs that have been treated to destroy salmonella, by pasteurization or another approved method.",
    "Recipe courtesy of Ree Drummond"
  ],
  "ingredients": [
    "0",
    "12 graham crackers (the 4-section large pieces)",
    "1/3 cup butter, melted",
    "1/3 cup sugar",
    "4 ounces unsweetened baking chocolate",
    "1 1/2 cups sugar",
    "1 cup (2 sticks) salted butter, softened but still cold",
    "1 teaspoon vanilla extract",
    "4 eggs, cold",
    "1 1/2 cups heavy cream",
    "1/4 cup powdered sugar",
    "Piece of semisweet chocolate, for grating"
  ],
  "__v": 1
}