{
  "hash": "c2741ce53b5ac6bc1689a53d173cc5703f35a591",
  "title": "Bravas Potatoes Recipe - Patatas Bravas",
  "image": "http://0.tqn.com/d/spanishfood/1/I/C/B/-/-/patatasbravas200x151.jpg",
  "href": "http://spanishfood.about.com/od/tapas/r/patatasbravas.htm",
  "keywords": [
    "medium",
    "potatoes",
    "salt",
    "spanish",
    "olive",
    "oil",
    "frying",
    "tomato",
    "mustard",
    "tabasco",
    "paprika",
    "toothpicks"
  ],
  "directions": [
    "0",
    "This bravas potato recipe makes 4 servings as an appetizer.",
    "Peel the potatoes. Cut potatoes into 1/3\" to 1/2\" chunks as follows: Cut the potato lengthwise, then cut it lengthwise again. You should have four long pieces. Now, cut each of those pieces into 3-4 pieces, cutting crosswise. This should give you nice bit-sized pieces, small enough to use a toothpick to skewer. Sprinkle with salt.",
    "Pour olive oil in a wide, deep frying pan, with a heavy bottom. Heat the oil on medium high until hot. To test the oil, carefully place one piece of potato in the oil. It is hot enough if the potato immediately fries. If there is no bubbling/frying, the oil is not hot enough and the potato will absorb too much oil. Once the potatoes are fried(about 10 minutes), use a slotted spoon or spatula to remove and set them aside to drain.",
    "Using a small 8-inch frying pan, put 1-2 tablespoons of the olive oil in the pan. Heat over medium heat. Pour tomato sauce into the pan and \"saute\" the tomato sauce for 5 minutes. Turn heat down and add the mustard, stirring well. Finally, add the Tabasco and paprika, and mix well. Taste the sauce and adjust as necessary with salt, more Tabasco, etc.",
    "Place the potatoes on a plate or in a wide open dish. Pour the sauce over the potatoes and serve warm, with toothpicks.",
    "Another dish that uses fried potato chunks to start, and finishes with a garlicky sauce is Alioli potatoes. Try serving these side-by-side as complementary tapas.",
    "<<-- List of Tapas Recipes in \"What are Tapas?\" FAQ"
  ],
  "ingredients": [
    "0",
    "4 medium potatoes",
    "salt to taste",
    "1 1/2 - 2 cups Spanish olive oil for frying",
    "1 - 16 oz can of tomato sauce",
    "1 1/2 tsp mustard",
    "1 tsp Tabasco sauce",
    "1 tsp sweet Spanish paprika",
    "toothpicks for serving"
  ],
  "__v": 0
}