{
  "hash": "f137cb8806bf256fb23f35c90677759cf632f553",
  "title": "Bacon-Wrapped Double Pork Meatloaf",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2010/5/25/1/0069394F1_Bacon-Wrapped-Double-Pork-Meatloaf_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/aida-mollenkamp/bacon-wrapped-double-pork-meatloaf-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-10-30T09:40:52.232000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the oven to 400 degrees F and arrange a rack in the upper third. Line a baking sheet with foil and set aside.",
    "Add the oil to a medium pan over medium heat. When the oil shimmers, add the onion, garlic and thyme and cook until softened, about 3 minutes; set aside.",
    "In a large bowl, add the eggs, buttermilk, mustard, Worcestershire, salt, and pepper. Whisk until the eggs are broken up and evenly combined. Add the onion mixture, ground pork, sausage, cracker crumbs, and parsley. Mix until thoroughly combined (don't squeeze mixture).",
    "Dampen your hands, and put the meat on the prepared baking sheet. Form the meat into a 9 by 5- inch loaf. Arrange the bacon across the top of the loaf and bake until the internal temperature is 155 degrees F, on an instant-read thermometer, about 55 to 65 minutes. Remove from the oven to a cutting board and let cool for 10 to 15 minutes before slicing and serving.",
    "Recipe courtesy of Aida Mollenkamp"
  ],
  "ingredients": [
    "0",
    "1 tablespoon vegetable oil",
    "1/2 medium white onion, finely chopped (about 1 cup)",
    "2 medium garlic cloves, minced",
    "Leaves from 4 sprigs thyme (about 1 teaspoon)",
    "2 large eggs",
    "1/2 cup well-shaken lowfat buttermilk",
    "2 tablespoons Dijon mustard",
    "1 tablespoon Worcestershire sauce",
    "1 teaspoon kosher salt",
    "1/2 teaspoon freshly ground black pepper",
    "2 pounds ground pork",
    "1 pound bratwurst pork sausage, removed from casings and broken up",
    "1 cup crushed saltine crackers (about 20)",
    "1/4 cup finely chopped fresh Italian parsley leaves",
    "8 strips bacon"
  ],
  "__v": 1
}