{
  "hash": "919431db12984aa110eaafbd7d70b2221fdbc0cd",
  "title": "Peach ButterPeach Butter Ice Cream with Salted Coconut Caramel Sauce",
  "image": "http://i1.wp.com/willfrolicforfood.com/wp-content/uploads/2015/07/peach-butter-coconut-caramel-ice-cream-vegan-4973.jpg?resize=682%2C1024",
  "href": "http://willfrolicforfood.com/2015/07/peach-ice-cream-vegan-dulce-de-leche.html",
  "extension": "",
  "firstAdded": "2015-11-11T16:36:22.680000",
  "users": [
    null
  ],
  "keywords": [
    "peaches",
    "bourbon",
    "whiskey",
    "coconut",
    "sugar",
    "lemon",
    "juice",
    "zest",
    "arrowroot",
    "flour",
    "peach",
    "butter",
    "fat",
    "milk",
    "raw",
    "honey",
    "cinnamon",
    "celtic",
    "salt",
    "salted",
    "caramel",
    "basic",
    "recipe",
    "fast",
    "slow",
    "cacao",
    "nibs",
    "nuts"
  ],
  "directions": [
    "0",
    "Cook everything except arrowroot together until reduced by ¼.",
    "In a medium bowl, combine the arrowroot flour with 2 cups of the juice from the cooked down peaches. Stir together until smooth and combined, with no lumps. I find using an immersion blender here helps to get rid of any starchy pockets.",
    "Add the arrowroot back into the peaches and cook down further until the mixture is reduced by half of the original volume.",
    "Cut off heat and blend with an immersion blender until smooth. You can also do this in batches in a blender once the mix has cooled down a bit.",
    "Cool in the fridge covered until ready to use. The peach butter keeps up to a week in the fridge, but can be frozen for up to a month.",
    "1",
    "Combine the peach butter, coconut milk, honey, cinnamon, and sea salt in a blender and blend until smooth and creamy.",
    "Cool the base in your fridge for a minimum of 30 minutes before pouring it into your ice cream maker.",
    "Make in your ice cream maker according to maker directions OR",
    "to make this ice cream without a maker, pour the base into ice cube trays and freeze for 3 hours then blend in a high powered blender until creamy and smooth with a splash of coconut milk to get it going.",
    "Once your ice cream base is at soft-serve consistency, spread the ice cream out into a loaf pan. You can swirl the coconut caramel into the ice cream at this point and freeze for 3 hours before scooping out and serving OR reserve the coconut caramel as a topping. It's up to you! I personally like it better as a swirl.",
    "Scoop your ice cream out and add toppings to your liking! Voila!"
  ],
  "ingredients": [
    "0",
    "15 cups sliced peaches (about 20-25 peaches)",
    "2 tablespoons bourbon whiskey",
    "1 cup coconut sugar",
    "¼ cup lemon juice",
    "1 tablespoon lemon zest",
    "½ cup arrowroot flour",
    "1",
    "2¾ cups peach butter",
    "2 cups full fat coconut milk (1 13 oz can)",
    "¼ cup raw honey",
    "1 teaspoon cinnamon",
    "pinch Celtic sea salt",
    "salted coconut caramel (add ⅛ teaspoon Celtic sea salt to the basic recipe -- fast or slow)",
    "optional: cacao nibs or toasted nuts"
  ],
  "__v": 1
}