{
  "hash": "942a5ec2e19ef3765e6e1b10c1c567f908056f4b",
  "title": "Chocolate Swiss Roll Cake",
  "image": "https://cdn.sallysbakingaddiction.com/wp-content/uploads/2019/05/chocolate-swiss-roll-cake-4.jpg",
  "href": "https://sallysbakingaddiction.com/chocolate-cake-roll/",
  "extension": "Chrome",
  "firstAdded": "2020-06-11T15:43:57.228000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Vanilla Whipped Cream",
    "1 cup (240ml) cold heavy cream or heavy whipping cream",
    "Tablespoons (38g) granulated sugar or confectioners’ sugar",
    "1 teaspoon pure vanilla extract",
    "optional: 2 Tablespoons marshmallow creme (“Fluff”)",
    "Chocolate Topping",
    "1/2 cup (120ml) heavy cream or heavy whipping cream",
    "one 4 ounce bar (113g) semi-sweet chocolate, finely chopped",
    "optional for glossy shine: 1 teaspoon light corn syrup",
    "Instructions",
    "Preheat oven to 350°F (177°C). Spray a 12×17 inch baking pan with nonstick spray or grease with butter, so the parchment paper sticks. Then line it with parchment paper so the cake seamlessly releases. Spray or grease the parchment paper too. We want an extremely nonstick surface for this cake roll!",
    "Make the cake: Using a hand mixer or a stand mixer fitted with whisk attachment, beat the egg whites and granulated sugar together in a medium bowl on high speed for 5 minutes or until stiff peaks form. Set aside. In another bowl, beat the egg yolks, brown sugar, and vanilla extract together until pale and creamy, about 2 minutes.",
    "Sift the flour, 3 Tablespoons cocoa powder, baking powder, and salt together into a large bowl bowl. Pour the melted butter, coffee, and egg yolk mixture over the dry ingredients. Beat everything together on medium speed until completely combined. Using a rubber spatula or wooden spoon, gently fold in the egg whites until completely combined. Avoid over-mixing and deflating those whites! Batter will be very light.",
    "Spread batter evenly into prepared pan. It will be a very thin layer. Shimmy the pan on the counter to smooth out the top. Bake for 10 minutes or until the top of the cake gently springs back when touched with your finger. Do NOT over-bake!",
    "Roll the cake: As the cake bakes, place a piece of parchment paper (larger than the cake) or a thin kitchen towel flat on the counter. Sprinkle with a light coating of cocoa powder. Once the cake comes out of the oven, immediately invert it onto the parchment/towel. Peel off the parchment paper that was on the bottom of the cake as it baked. Starting with the narrow end, slowly and gently roll the cake up with the parchment/towel. The cake will be warm. Allow the cake to cool completely rolled up in the parchment/towel. Place in the refrigerator to speed it up, about 2-3 hours.",
    "Remove the cake roll from the refrigerator and allow to sit on the counter for a few minutes to warm up as you prepare the whipped cream.",
    "Make the whipped cream: Using a hand mixer or a stand mixer fitted with a whisk attachment, whip the heavy cream, sugar, and vanilla extract on medium-high speed until medium to stiff peaks form, about 2-3 minutes. Then beat in the marshmallow creme, if using.",
    "Slowly and gently unroll the cake. Spread whipped cream evenly on top, leaving about a 1/2 inch border around the cake. Gently roll the cake back up, without the parchment/towel this time. Place on a wire rack set on a baking sheet (to catch the extra ganache). Set aside on the counter or in the refrigerator as you prepare the ganache.",
    "Make the ganache topping: Place chopped chocolate and corn syrup, if using, in a medium bowl. Heat the cream in a small saucepan until it begins to gently simmer. (Do not let it come to a rapid boil– that’s too hot!) Pour over chocolate, then let it sit for 2-3 minutes to gently soften the chocolate. Slowly stir until completely combined and chocolate has melted.",
    "Pour ganache all over cake roll. Feel free to spoon up any dripped ganache and spoon over the cake again. Refrigerate for at least 30-60 minutes before slicing and serving.",
    "Cover leftover cake and store in the refrigerator for up to 3 days."
  ],
  "ingredients": [
    "0",
    "4 large eggs, separated",
    "1/3 cup (65g) granulated sugar",
    "1/3 cup (65g) packed light or dark brown sugar",
    "1 Tablespoon (15ml) strong brewed coffee *or* 1 teaspoon espresso powder",
    "1/4 cup (60g) unsalted butter, melted",
    "1 teaspoon pure vanilla extract",
    "1/2 cup (62g) all-purpose flour (spoon & leveled)",
    "3 Tablespoons natural unsweetened cocoa powder, plus 2 Tablespoons (10g) for rolling*",
    "1 teaspoon baking powder",
    "1/4 teaspoon salt"
  ],
  "__v": 1
}