{
  "hash": "3dd06857cbebb3d5166354d40d210aec47cf2756",
  "title": "Spicy Soba Noodles",
  "image": "http://1.bp.blogspot.com/-SLHpdWUlbBQ/Uiucv87vFaI/AAAAAAAAb94/mgGgA3ax-eA/s1600/Screen+Shot+2013-09-07+at+4.36.41+PM.png",
  "href": "http://jenessasdinners.blogspot.com.au/2013/09/spicy-soba-noodles.html",
  "extension": "Chrome",
  "firstAdded": "2015-11-29T19:00:22.680000",
  "users": [
    null
  ],
  "keywords": [
    "makes",
    "servings",
    "buckwheat",
    "noodles",
    "gor",
    "bundles",
    "soba",
    "packaged",
    "edamame",
    "beans",
    "cabbage",
    "cole",
    "slaw",
    "usually",
    "extra",
    "firm",
    "tofu",
    "red",
    "bell",
    "pepper",
    "julienned",
    "jalapeno",
    "scallions",
    "sesame",
    "seeds",
    "spicy",
    "korean",
    "gochujang",
    "thai",
    "chili",
    "thats",
    "easier",
    "sambal",
    "sriracha",
    "horseradish",
    "ginger",
    "rice",
    "wine",
    "vinegar",
    "lowsodium",
    "soy",
    "oil"
  ],
  "directions": [
    "0",
    "ring a large pot of water to a boil on the stove top.",
    "Start by slicing the tofu into six slabs, and pressing them gently between a few sheets of paper towel. Let them sit between the paper towel for about 10 minutes to drain the excess water.",
    "Meanwhile, chop your red pepper, jalapeno, scallions, and cabbage. Mince the ginger, as well.",
    "Make the sauce by stirring all the ingredients together in a bowl.",
    "Coat the tofu slabs with most of the sauce in a small baking dish. Toss the pepper and jalapeno together with a little sauce, as well.",
    "Bring a grill or frying pan to high heat, and cook the tofu well on each side. In the same pan, you can cook the pepper and jalapeno. Be sure not to discard the remaining sauce in the baking dish.",
    "While the tofu and peppers cook, place the noodles in boiling water for 4-5 minutes. Drain and rinse with cold water. When dry, toss in the baking dish with the remaining sauce and sesame seeds.",
    "You can transfer the noodles into a large bowl to toss with the edamame, cabbage, and scallions.",
    "When the tofu and peppers are done, allow to cool a bit, cube the tofu, and toss with the noodles. If the final dish seems a little dry, add a bit more gochujang and sesame oil."
  ],
  "ingredients": [
    "0",
    "Ingredients (makes 4 servings):",
    "1/2 lb. buckwheat soba noodles (200 g/or 2 bundles if that is how your soba is packaged)",
    "1 cup cooked edamame beans",
    "2 cups finely chopped cabbage or cole slaw mix",
    "14 oz. (usually one package) extra firm tofu",
    "1 red bell pepper, julienned",
    "1 jalapeno, sliced thinly",
    "1/4 cup chopped scallions",
    "1 tbsp. toasted sesame seeds",
    "Spicy Sauce:",
    "3 tbsp. Korean sweet and spicy sauce (\"gochujang\"), or Thai chili paste if that's easier to find",
    "2 tbsp. sambal or sriracha",
    "1/2 tbsp. horseradish paste",
    "1 tsp. finely chopped ginger",
    "2 tbsp. rice wine vinegar",
    "1 tbsp. low-sodium soy sauce",
    "1 tbsp. sesame oil"
  ],
  "__v": 1
}