{
  "hash": "43ae71046979181d8ead272a9eccef8a83f7af15",
  "title": "In a large sauté pan, add 1 tablespoon of olive oil and place over medium-high heat. Add the chorizo and cook, breaking up with a wooden spoon or potato masher, until well browned, about 8 minutes. Add the onions and chiles, season with red chile flakes, salt and pepper, and sauté until translucent, about 4 minutes. Add the beans and sauté to warm through. Season with salt and pepper to taste. Remove from heat, set aside and keep warm. In a large bowl, add the eggs, half-and-half, hot sauce and 2 tablespoons chopped cilantro, and whisk thoroughly to combine. Place a large nonstick pan over medium heat, and add 1 to 2 tablespoons of oil (or butter). Pour the eggs into the pan and whisk to scramble. Season with salt and pepper to taste. Remove from heat and do not overcook! In a griddled tortilla, add some scrambled egg mixture and some bean mixture. Top with some cotija cheese, Tomatillo Salsa, cilantro, pickled jalapenos, and hot sauce to taste.",
  "image": "",
  "href": "http://abc.go.com/shows/the-chew/recipes/egg-and-cheese-tacos-with-chorizo-and-pinto-beans-mario-batali",
  "extension": "Firefox",
  "firstAdded": "2015-10-02T15:55:37.866000",
  "users": [
    null
  ],
  "keywords": [
    "egg",
    "cheese",
    "tacos",
    "chorizo",
    "pinto",
    "beans",
    "olive",
    "oil",
    "divided",
    "casing",
    "red",
    "onion",
    "fresno",
    "chili",
    "seeds",
    "rinsed",
    "eggs",
    "halfandhalf",
    "hot",
    "bunch",
    "cilantro",
    "white",
    "corn",
    "tortillas",
    "charred",
    "slightly",
    "griddle",
    "cotija",
    "crumbled",
    "recipe",
    "tomatillo",
    "salsa",
    "pickled",
    "jalapenos"
  ],
  "directions": [
    "0",
    "In a large sauté pan, add 1 tablespoon of olive oil and place over medium-high heat. Add the chorizo and cook, breaking up with a wooden spoon or potato masher, until well browned, about 8 minutes. Add the onions and chiles, season with red chile flakes, salt and pepper, and sauté until translucent, about 4 minutes. Add the beans and sauté to warm through. Season with salt and pepper to taste. Remove from heat, set aside and keep warm.",
    "In a large bowl, add the eggs, half-and-half, hot sauce and 2 tablespoons chopped cilantro, and whisk thoroughly to combine. Place a large nonstick pan over medium heat, and add 1 to 2 tablespoons of oil (or butter). Pour the eggs into the pan and whisk to scramble. Season with salt and pepper to taste. Remove from heat and do not overcook!",
    "In a griddled tortilla, add some scrambled egg mixture and some bean mixture. Top with some cotija cheese, Tomatillo Salsa, cilantro, pickled jalapenos, and hot sauce to taste."
  ],
  "ingredients": [
    "0",
    "Egg & Cheese Tacos with Chorizo & Pinto Beans",
    "2 tablespoons olive oil (divided)",
    "8 ounces fresh chorizo (removed from casing)",
    "1/2 red onion (thinly sliced)",
    "1 fresno chili (seeds removed, finely chopped)",
    "1/4 teaspoon red chili flakes",
    "1 can pinto beans (drained and rinsed, 15 ounces)",
    "6 eggs",
    "2 tablespoons half-and-half",
    "1 teaspoon hot sauce (plus more to garnish)",
    "1 bunch cilantro",
    "12 white corn tortillas (charred slightly on a griddle)",
    "1 cup cotija cheese (crumbled, plus more for garnish)",
    "1 recipe Tomatillo Salsa",
    "1 cup pickled jalapenos"
  ],
  "__v": 1
}