{
  "hash": "7fe63a1ac28f790dd355e86783a06cf04fb8dfbd",
  "title": "Refried Black Beans",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2013/02/refried-black-beans-vertical-735-opt.jpg",
  "href": "http://www.simplyrecipes.com/recipes/refried_black_beans/",
  "extension": "",
  "firstAdded": "2017-07-14T02:18:43.472000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Place dry beans in a bowl and add enough water to cover the beans by two inches. Let sit overnight. Alternatively, if you don't have time to soak the beans overnight, place the dry beans in a large bowl and pour boiling water over the beans, covering the beans with at least an inch of water, and let sit for one hour. Note, if your dry beans are a little old, or if you have reason to believe that they will be tough to cook (beans stored in hot or humid climates can get tough), you can add some salt to the water (1 1/2 teaspoons of salt 2 quarts of water) which at this stage will help the beans soften when they cook later.",
    "2 Once the beans have soaked, they should have expanded noticeably. Drain the soaking liquid. Heat a tablespoon of olive oil in a large thick-bottomed pot on medium high heat. Add the cumin. Once the cumin is sizzling, add the chopped onion. Cook for 5 minutes or so, until translucent. Add the minced garlic and cook for a minute more. Add the drained beans and 2 quarts of water. Bring to a simmer. Partially cover the pot and lower the heat to maintain a simmer. Simmer for 2 hours. At the 2 hour mark, add 2 teaspoons of salt (if you salted the soaking water in step 1, then taste first, and only add a teaspoon or so more of salt if you think it needs it). Add 1/2 cup chopped fresh cilantro. Let cook uncovered for another half hour, or until the beans are tender.",
    "3 Heat 2 Tbsp of olive oil in a large frying pan on medium high heat. Add the chipotle powder, chili powder, and cumin. Once the spices are sizzling, add the chopped white onion and cook until translucent. Add the garlic and cook a minute more.",
    "4 Add the cooked black beans (and liquid from the pot) to the frying pan. Use a potato masher to mash the beans in the pan. Let them cook 3 to 4 minutes longer. If the beans are a little soupy for your taste, just let them cook longer. If too thick or dry, add more water. Adjust seasonings to taste.",
    "Garnish with chopped green onions, fresh cilantro, and crumbled cotija or queso fresco cheese. Serve with tortilla chips or corn or flour tortillas (corn if you are gluten-free). Great in tacos or burritos, or for a dip, or a side with steak."
  ],
  "ingredients": [
    "0",
    "1 lb dry black beans",
    "1 Tbsp olive oil",
    "1/2 teaspoon ground cumin",
    "1/2 large white onion, chopped (about 1 1/2 cups)",
    "1 garlic clove, minced",
    "2 teaspoons salt",
    "1/2 cup chopped fresh cilantro (leaves and tender stems)",
    "1 teaspoon chipotle chili powder",
    "1 teaspoon chili powder",
    "1/2 teaspoon ground cumin",
    "1/2 large white onion, chopped (about 1 1/2 cups)",
    "1 garlic clove, minced",
    "Green onion",
    "Cilantro",
    "Crumbled cotija or queso fresco cheese",
    "Tortilla chips or corn tortillas"
  ],
  "__v": 1
}