{
  "__v": 1,
  "directions": [
    "0",
    "Put the chocolate in a medium heatproof bowl and set aside. Put the caster sugar in a medium pan over medium heat and leave until the sugar begins to dissolve and caramelise around the edges. Using a silicon spatula, drag the dissolved sugar towards the middle to help it dissolve evenly.",
    "Once the sugar is fully dissolved and has turned a dark golden brown colour, pour in half the cream, all the vanilla and light brown sugar - it will bubble up furiously, so be careful and go slowly. Once the bubbling has subsided, add the remaining cream. If the caramel is lumpy, put over low heat and allow to melt. Once you have a smooth caramel, add the butter and sea salt. Stir gently to combine.",
    "Pour the hot caramel over the chocolate and stir gently to combine. Chill until firm enough to form into balls.",
    "To make the truffles, have a small bowl of cocoa powder ready and a baking tray lined with baking parchment. Take large teaspoons of the ganache mixture and roll into balls, then roll in the cocoa powder and set on the baking tray. Chill the truffles until needed."
  ],
  "firstAdded": "2014-03-22T13:47:14.613000",
  "hash": "f696c86e03b00301731f71a6561ee9053aefe92f",
  "href": "http://uktv.co.uk/food/recipe/aid/654948",
  "image": "http://uktv.co.uk/images/300240/65861_salted_caramel_truffles.jpg?Salted-caramel-truffles-recipe",
  "ingredients": [
    "0",
    "300 g dark chocolate, about 70 per cent cocoa solids, finely chopped",
    "300 g caster sugar",
    "300 ml double cream",
    "½ tsp vanilla extract",
    "20 g light soft brown sugar",
    "20 g unsalted butter",
    "½ tsp flaked sea salt",
    "cocoa powder, for dusting"
  ],
  "keywords": [
    "dark",
    "chocolate",
    "cent",
    "cocoa",
    "solids",
    "caster",
    "sugar",
    "double",
    "cream",
    "vanilla",
    "light",
    "soft",
    "brown",
    "unsalted",
    "butter",
    "flaked",
    "salt",
    "dusting"
  ],
  "title": "Salted caramel truffles",
  "users": [
    null
  ]
}