{
  "hash": "075db10f46a2dbf03c74ba4a2e565479768d9b98",
  "title": "Chicken Stir Fry with Veggies and Garlic Sauce {Paleo, Whole30",
  "image": "https://www.paleorunningmomma.com/wp-content/uploads/2018/01/chicken-stir-fry-7-189x189.jpg",
  "href": "https://www.paleorunningmomma.com/chicken-stir-fry-garlic-sauce-paleo-whole30/",
  "extension": "Chrome",
  "firstAdded": "2018-08-30T02:56:25.420000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Make sure chicken and veggies are sliced/chopped as needed before beginning.",
    "In a high speed blender or food processor, blend all sauce ingredients until smooth. Place sliced chicken in a large bowl and pour 3-4 Tbsp of sauce over chicken, toss to evenly coat.",
    "Heat a large nonstick skillet or wok over medium-high heat and add oil once hot. Once skillet is fully heated, add 1 1/2 Tbsp oil. Add all the veggies and stir to coat. Cook, stirring to avoid browning, about 3 minutes - do not overcook at this stage. Veggies should just begin to soften. Remove veggies to a plate or bowl and cover with foil, set aside.",
    "Add remaining 1 1/2 Tbsp oil to skillet and keep heat set on med-hi/hi. Add all chicken, leaving any marinade in the bowl. Sprinkle lightly with sea salt and pepper. Cook, stirring to brown evenly, about 3-5 minutes or until cooked through (the thinner you sliced your chicken, the quicker it will cook.)",
    "Lower heat to medium and pour all sauce over chicken, then add veggies back in. Stir, and allow to simmer another 2 minutes or until sauce thickens and veggies are crisp-tender. Serve hot, alone or over cauliflower rice. Garnish with scallions, sesame seeds or a bit of crushed red pepper for spice. Enjoy!"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "sauce, blend:",
    "1 medjool date pitted (softened if necessary*)",
    "2 Tbsp Nakano All Natural Rice Vinegar",
    "4 cloves garlic sliced",
    "1 inch fresh ginger peeled and sliced",
    "1/4 cup + 1 Tbsp coconut aminos",
    "1/4 cup + 1 Tbsp chicken bone broth",
    "1/2 Tbsp sesame oil",
    "1/2 Tbsp tapioca or arrowroot starch",
    "veggies:",
    "2 cups broccoli florets",
    "1 medium bell pepper thinly sliced",
    "1 cup snow peas",
    "Handful shredded cabbage or slaw mixture*",
    "1 1/2 Tbsp coconut oil or olive oil",
    "chicken:",
    "1.25 - 1.5 lbs boneless skinless chicken thighs sliced into 1” pieces",
    "1 1/2 Tbsp coconut oil or olive oil",
    "Salt and pepper"
  ],
  "__v": 1
}