{
  "hash": "5b7549f451cdb72f440ac47b75f7e2e446678dd8",
  "title": "Easy Pan Pizza With Sun-dried Tomatoes, Caramelized Onions, Olives, and Breadcrumbs (Vegan)",
  "image": "http://www.seriouseats.com/recipes/assets_c/2013/02/20120206-vegan-pizza-potatoes-zucchini-10-thumb-625xauto-304278.jpg",
  "href": "http://www.seriouseats.com/recipes/2013/02/easy-party-pan-pizza-sun-dried-tomatoes-olives-caramelized-onions-sfinzione-sicilian-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-11-29T18:50:06.699000",
  "users": [
    null
  ],
  "keywords": [
    "square",
    "pan",
    "pizza",
    "dough",
    "recipe",
    "extravirgin",
    "olive",
    "oil",
    "onions",
    "kosher",
    "salt",
    "black",
    "pepper",
    "pankostyle",
    "vegan",
    "breadcrumbs",
    "tomatoes",
    "preferably",
    "san",
    "marzano",
    "oilpacked",
    "sun",
    "roughly",
    "olives",
    "torn",
    "basil",
    "leaves"
  ],
  "directions": [
    "0",
    "Complete Square Pan Pizza Dough Recipe through step 3, adjust oven rack to center position and preheating oven to 500°F about 1 hour before baking. While dough rises, heat 2 tablespoons olive oil and onions in a heavy-bottomed Dutch oven or saucepan over medium-high heat. Season to taste with salt. Cook, stirring occasionally, until onions are starting to brown and a caramelized patina is left on the bottom of the pan, about 10 minutes. Add 2 tablespoons water and cook, scraping up browned bits. Repeat process 3 more times, cooking onions while stirring until caramelized patina builds up, then scraping it off with water. After fourth time, season onions to taste with salt and pepper and transfer to a small bowl.",
    "Combine panko with remaining 2 tablespoons olive oil, season to taste with salt and pepper, and toss to combine.",
    "Transfer drained tomatoes to a medium bowl. Crush tomatoes through fingertips until no pieces larger than 1/4-inch remain. Season to taste with salt.",
    "Once pizza dough has filled out pan, spead tomatoes evenly over surface (you may not need them all). Add chopped sun-dried tomatoes and olives, followed by caramelized onions. Add breadcrumbs and evenly coat surface. Bake until breadcrumbs are an even golden brown and bottom of pizza is browned and crisp, 15 to 20 minutes total. Remove from oven, sprinkle with torn basil, cut into squares, and serve."
  ],
  "ingredients": [
    "0",
    "1 recipe Square Pan Pizza Dough Recipe",
    "1/4 cup extra-virgin olive oil",
    "2 large onions, finely sliced (about 3 cups)",
    "Kosher salt and freshly ground black pepper",
    "2 cups panko-style vegan breadcrumbs",
    "1 (28-ounce can) whole peeled tomatoes, preferably San Marzano, drained",
    "1 cup oil-packed sun dried tomatoes, drained, roughly chopped",
    "3/4 cup pitted olives, roughly chopped",
    "1 handful roughly torn basil leaves"
  ],
  "__v": 1
}