{
  "hash": "b165e693fb7e418f8d48ca9d8c480842f390ebe9",
  "title": "How To Make Socca",
  "image": "http://atmedia.imgix.net/0135943ce0fd9cea3195951e97fb6a143ba69d3c?auto=compress&w=540.0&h=500.0&fit=max",
  "href": "http://www.thekitchn.com/how-to-make-socca-a-naturally-gluten-free-chickpea-flatbread-cooking-lessons-from-the-kitchn-169513",
  "extension": "Chrome",
  "firstAdded": "2016-09-03T17:03:33.358000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 cup (4 1/2 ounces) chickpea flour 1 cup (8 ounces) water 1 1/2 tablespoons extra-virgin olive oil, plus more for the pan 1/2 teaspoon salt Optional seasonings: 1 tablespoon chopped fresh herbs (rosemary, thyme, oregano), 1-2 cloves minced garlic, 1/8-1/2 teaspoon spice (chili powder, cumin, smoked paprika, za'atar)",
    "Equipment",
    "10-inch cast-iron skillet, pie tin, or other metal baking dish Spatula Knife",
    "1. Prepare the Chickpea Batter - Whisk together the chickpea flour, water, olive oil, and salt in a small bowl. Let rest for 1/2 hour to 2 hours to give the flour time to absorb the water.",
    "2. Heat the Broiler and the Pan - Set an oven rack six inches below your oven's broiler and turn on the broiler. Set a cast iron skillet or other baking dish on the rack to warm for five minutes.",
    "3. Pour the Batter - Remove the skillet from the oven using oven mitts. Add a teaspoon or so of olive oil and swirl to coat the bottom of the pan. Whisk the chickpea batter quickly and then pour half into the hot skillet (or all if making a thicker pancake). Tilt the pan so the batter coats the entire surface of the pan.",
    "4. Broil the Socca - Broil for 3 to 5 minutes, until you see the top of the socca begin to blister and brown. If you find the top browning before the batter is fully set, move the skillet to a lower oven rack until done. The socca should be fairly flexible in the middle but crispy on the edges.",
    "5. Slice and Serve - Use a spatula to work your way under the socca and ease it from the pan. Slice it into wedges or squares, sprinkle with salt and pepper, and drizzle with a little good olive oil. Repeat with any remaining batter.",
    "Socca is best if eaten immediately after baking while still warm, but can be refrigerated and re-toasted for up to a week.",
    "Additional Notes:",
    "• To Bake in the Oven: Heat the oven to 450°F and pre-heat the baking dish for 5 minutes. Bake the socca for 8-10 minutes, until it's cooked through, then run it under the broiler to blister the top.",
    "• To Bake on the Stove Top: Film a pan with oil and set over medium-high heat. Pour in the socca batter. After about 3 minutes when the edges are firm, gently lift the pancake and flip it. Cook on the other side for another 2 to 3 minutes, until both surfaces are dry and beginning to brown.",
    "• Finding Chickpea Flour: You can find chickpea flour in the bulk bins at Whole Foods and other natural foods-type stores. Bob's Red Mill also sells it in packages. Look for it under the name \"garbanzo bean flour\" if you're having trouble finding it. They are the same product."
  ],
  "ingredients": [
    "0",
    "1 cup (4 1/2 ounces) chickpea flour",
    "1 cup (8 ounces) water",
    "1 1/2 tablespoons extra-virgin olive oil, plus more for the pan",
    "1/2 teaspoon salt"
  ],
  "__v": 1
}