{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 200C",
    "Put a large pot of water on to boil",
    "Pop the little chucks of pumpkin on a baking tray lined with baking paper. Drizzle with a little olive oil, sprinkle with salt and pepper and roast in the oven for about 20 minutes, or until golden.",
    "While the pumpkin is baking, place the parsley, bread, broccolini and a good lug of olive oil in the bowl of a food processor and pulse until you achieve a fine crumb. Transfer to a separate bowl and give the processor a quick rinse.",
    "In a small bowl, combine the yoghurt, mustard, mozzarella and ¾ of the goat’s cheese. Season to taste and set aside.",
    "Pop the cherry tomatoes in the food processor and pulse a few times to chop a little bit. Add the cheese and yoghurt mixture and stir well.",
    "Boil the orrechiette in salted boiling water until just before al dente – you want it just undercooked. Drain the pasta and reserve a little of the pasta water for later use.",
    "Return the pasta to the saucepan and add the cheesy yoghurt mixture to it. Add the pumpkin and stir well to combine. Add a little pasta water if it looks a little gluggy and thick – you want the sauce to be at the consistency of cream (don’t worry if it’s a little bit runny as the pasta will soak it up as it bakes in the oven).",
    "Transfer the pasta to a large baking dish or individual baking cups. Sprinkle the green, broccolini breadcrumb mix evenly across the top, sprinkle with the remaining goat’s cheese and pop into the oven to bake for 20-25 minutes or until the topping is crunchy. Remove from the oven, sprinkle with a little lemon zest and a squeeze of lemon juice and serve.",
    "Serves 2-4"
  ],
  "firstAdded": "2014-09-08T19:32:05.440000",
  "hash": "4deb2f39d163e133bde8e4621fefcdd4ce778ce3",
  "href": "http://fingerforkknife.com/2012/05/13/broccolini-and-pumpkin-maccheese/",
  "image": "http://fingerforkknife.files.wordpress.com/2012/05/p1060984.jpg?w=640&h=480",
  "ingredients": [
    "0",
    "1 small butternut pumpkin, peeled, seeded and chopped into small cubes",
    "Good quality olive oil",
    "½ bunch flat-leaf parsley, stems removed",
    "1 thick slice of sourdough bread, stale or dried out in the oven",
    "2 bunches of broccolini, heads roughly chopped, hard woody stems removed",
    "2 tbsp thick Greek yoghurt",
    "¼ cup good quality goat’s cheese",
    "¼ cup fresh mozzarella, shredded or torn",
    "2 cups cherry tomatoes",
    "1½ cups dried orecchiette pasta",
    "2 tsp wholegrain mustard",
    "Sea salt",
    "Freshly ground black pepper",
    "Lemon zest and juice"
  ],
  "keywords": [
    "butternut",
    "pumpkin",
    "seeded",
    "cubes",
    "good",
    "quality",
    "olive",
    "oil",
    "bunch",
    "flatleaf",
    "parsley",
    "stems",
    "slice",
    "sourdough",
    "bread",
    "stale",
    "oven",
    "bunches",
    "broccolini",
    "heads",
    "roughly",
    "hard",
    "woody",
    "greek",
    "yoghurt",
    "goats",
    "cheese",
    "mozzarella",
    "torn",
    "cherry",
    "tomatoes",
    "orecchiette",
    "pasta",
    "wholegrain",
    "mustard",
    "salt",
    "black",
    "pepper",
    "lemon",
    "zest",
    "juice"
  ],
  "title": "Broccolini and Pumpkin Mac+Cheese",
  "users": [
    null
  ]
}