{
  "hash": "1882822c6c85cd4d03bea15eb9b6fcd14f63a5c0",
  "title": "Veggie Black Bean Enchiladas",
  "image": "https://cookieandkate.com/images/2016/04/vegetable-enchiladas.jpg",
  "href": "https://cookieandkate.com/2016/vegetarian-enchiladas-recipe/",
  "extension": "",
  "firstAdded": "2018-01-07T16:29:33.256000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400 degrees Fahrenheit with one rack in the middle of the oven and one in the upper third. Lightly grease a 13 by 9-inch pan with olive oil or cooking spray.",
    "In a large skillet over medium heat, warm the olive oil until simmering. Add the onions and a pinch of salt. Cook, stirring often, until the onions are tender and translucent, about 5 to 7 minutes. Add the broccoli and bell pepper, stir, and reduce heat to medium-low. Cover the skillet (I don’t have a lid for mine, so I just placed a cookie sheet on top). Cook, stirring occasionally, for about 8 to 9 minutes, or until the broccoli is brighter green and just starting to turn golden on the edges.",
    "Add the cumin and cinnamon to the skillet and cook until fragrant, about 30 seconds. Add the spinach, a few handfuls at a time, stirring until it has reduced in size. Repeat with remaining spinach and cook until all of the spinach has wilted.",
    "Transfer the contents of the pan to a medium mixing bowl. Add the drained beans, ¼ cup cheese and a drizzle of enchilada sauce (about 2 tablespoons). Season with ½ teaspoon salt and some freshly ground black pepper, to taste.",
    "Assemble the enchiladas: Pour ¼ cup enchilada sauce into your prepared pan and tilt it from side to side until the bottom of the pan is evenly coated. To assemble your first enchilada, spread ½ cup filling mixture down the middle of a tortilla, then snugly wrap the left side over and then the right, to make a wrap. Place it seam side down against the edge of your pan. Repeat with remaining tortillas and filling.",
    "Drizzle the remaining enchilada sauce evenly over the enchiladas, leaving the tips of the enchiladas bare. Sprinkle the remaining shredded cheese evenly over the enchiladas.",
    "Bake, uncovered, on the middle rack for 20 minutes. If the cheese on top isn’t golden enough for your liking, carefully transfer the enchiladas to the upper rack of the oven and bake for an additional 3 to 6 minutes, until sufficiently golden and bubbly.",
    "Remove from oven and let the enchiladas rest for 10 minutes (they’re super hot!). Before serving, sprinkle chopped cilantro down the center of the enchiladas. Serve immediately."
  ],
  "ingredients": [
    "0",
    "2 cups homemade enchilada sauce",
    "2 tablespoons olive oil",
    "1 cup chopped red onion (about 1 small red onion)",
    "1 red bell pepper, chopped",
    "1 bunch of broccoli or 1 small head of cauliflower (about 1 pound), florets removed and sliced into small, bite-sized pieces",
    "1 teaspoon Frontier Co-op Ground Cumin",
    "¼ teaspoon Frontier Co-op Ground Cinnamon",
    "5 to 6 ounces baby spinach (about 5 cups, packed)",
    "1 can (15 ounces) black beans, drained and rinsed, or 1 ½ cups cooked black beans",
    "1 cup shredded Monterey Jack cheese, divided",
    "½ teaspoon salt, to taste",
    "Freshly ground black pepper, to taste",
    "8 whole wheat tortillas (about 8” in diameter)",
    "Handful of chopped cilantro, for garnishing"
  ],
  "__v": 1
}