{
  "hash": "11320fbcbffb7f74afe9f6f9a3e9d7329e8c9b39",
  "title": "Fermented Fruit Kvass (Fermenting technique from Rebecca Wood)\n1 large glass jar",
  "image": "http://www.greenkitchenstories.com/wp-content/uploads/2012/09/Fruit_kvass_4.jpg",
  "href": "http://www.greenkitchenstories.com/fermented-fruit-kvass/",
  "extension": "",
  "firstAdded": "2015-09-24T21:52:38.074000",
  "users": [
    null
  ],
  "keywords": [
    "glass",
    "jar",
    "mixed",
    "organic",
    "fruit",
    "used",
    "peaches",
    "blackberries",
    "unpasteurized",
    "honey",
    "ginger",
    "best",
    "result",
    "filtered",
    "mineral",
    "water"
  ],
  "directions": [
    "0",
    "Place fruit, honey and ginger in the jar. Add water to fill up the jar, except the top inch. You’ll need that extra space to allow pressure to build. Tightly close the jar. Place in room temperature for 2-3 days, give it a shake twice a day to prevent bacteria from forming on the surface. After 24 hours you can see fermentation bubbles. Taste your brew every day to see when it is ready, it depends on the room temperature and sugar content. It should taste sweet and tangy and the fruit look ‘cooked’. Strain the brew and drink as it is or store in the fridge for up to a week.",
    "If you have any problems with the fermenting process, you could add whey or yeast as a starter, it could depend on the water or the honey you use. I use (scandinavian) tap water or filtered tap water.",
    "The natural alcohol level in homemade Kvass is very very low, about 0.05%-1.0%, which means that children can drink it too.",
    "Other Kvass Combinations",
    "cherry, raspberry, cardamom",
    "apple, raisins, cinnamon",
    "lemon, dried apricots, ginger",
    "mango, chai spices",
    "beet, apple, lemon balm",
    "nectarine, camomile",
    "blackberry, peaces, vanilla bean",
    "dried prunes, lemon, ginger",
    "Keep refrigerated for up to 1 week."
  ],
  "ingredients": [
    "0",
    "1/4 of a large glass jar of mixed organic ripe fruit (we used fresh peaches and blackberries)",
    "1 tbsp unpasteurized honey",
    "1-inch fresh ginger, peeled",
    "pure water to almost fill the jar (you get best result with filtered or mineral water)"
  ],
  "__v": 1
}