{
  "hash": "bfaf68636d87210db743f4014dd52abdd8c0d5be",
  "title": "Lemon Buttermilk Bundt Cake",
  "image": "http://thecafesucrefarine.com/wp-content/uploads/Lemon-Buttermilk-Pound-Cake-1.jpg",
  "href": "http://thecafesucrefarine.com/2016/03/lemon-buttermilk-bundt-cake/",
  "extension": "Chrome",
  "firstAdded": "2016-03-22T18:27:55.376000",
  "users": [
    null
  ],
  "keywords": [
    "purpose",
    "flour",
    "baking",
    "soda",
    "salt",
    "butter",
    "softened",
    "make",
    "sure",
    "nice",
    "soft",
    "granulated",
    "sugar",
    "eggs",
    "buttermilk",
    "lemon",
    "zest",
    "medium",
    "size",
    "lemons",
    "juice",
    "syrup",
    "water"
  ],
  "directions": [
    "0",
    "Preheat the oven to 325°F with oven rack in the middle position. Spray a 10-inch bundt pan with baking spray and wipe the spray in all the grooves with a paper towel. Spray again lightly.",
    "In a medium bowl, whisk together the flour, baking soda and salt. Set aside. In another bowl, combine the buttermilk, lemon zest and lemon juice. Set aside",
    "In the bowl of an electric mixer fitted with the paddle attachment (or beaters), cream the butter and sugar on medium speed until light and fluffy, 3-4 minutes.",
    "Scrape down the sides of the bowl, then beat in the eggs one at a time, beating well after each addition. Scrape down the sides of the bowl again.",
    "Ad one-quarter of the flour mixture with mixer on low speed. When most of the flour has been incorporated add one-third of the buttermilk mixture. Repeat two times, then end with the last quarter of the flour mixture. Scrape down the sides of the bowl, and mix for another 20 seconds to make sure all of the ingredients are well incorporated. Remove bowl from mixer and scrape and stir mixture by hand one more time.",
    "Transfer the batter to the prepared bundt pan and smooth the top.",
    "Bake for 1 hour and 5 minutes, or until a cake tester comes out clean. Cool the cake in the pan for ten minutes on a rack.",
    "While the cake is cooling make the syrup. Combine the water, lemon juice and sugar in a saucepan and bring to a boil, stirring occasionally.",
    "Invert the warm cake onto a rack. Slip a large piece of aluminum foil under the rack to catch the drips from the glaze. Gradually brush the hot syrup over the cake, letting it soak in. Don't try to hurry or the glaze will simply drip off onto the foil.",
    "Allow the cake to cool completely before cutting."
  ],
  "ingredients": [
    "0",
    "3 cups all purpose flour",
    "1 teaspoon baking soda",
    "½ teaspoon salt",
    "2 sticks (8 ounces) butter, softened (make sure it's nice and soft)",
    "2 ¼ cups granulated sugar",
    "3 large eggs",
    "1 cup buttermilk",
    "finely grated lemon zest from 2 medium size lemons",
    "2 tablespoons fresh lemon juice",
    "For the Syrup",
    "2 tablespoons water",
    "3 tablespoons fresh lemon juice",
    "½ cup granulated sugar"
  ],
  "__v": 1
}