{
  "hash": "569dab32cde80acff93babd2e6b2f95f262dc945",
  "title": "Smashed Potatoes with Roasted-Garlic Gravy",
  "image": "http://www.epicurious.com/images/recipesmenus/2008/2008_november/350612.jpg",
  "href": "http://www.epicurious.com/articlesguides/bestof/toprecipes/bestpotatorecipes/recipes/food/views/Smashed-Potatoes-with-Roasted-Garlic-Gravy-350612",
  "firstAdded": "2015-01-24T01:21:24.860000",
  "users": [
    null
  ],
  "keywords": [
    "head",
    "garlic",
    "olive",
    "oil",
    "drizzling",
    "leek",
    "washed",
    "onion",
    "left",
    "unpeeled",
    "carrots",
    "parsnip",
    "celery",
    "ribs",
    "turkish",
    "california",
    "bay",
    "leaf",
    "black",
    "peppercorns",
    "dry",
    "white",
    "wine",
    "soy",
    "cold",
    "water",
    "boiling",
    "potatoes",
    "unsalted",
    "butter",
    "pieces",
    "extravirgin",
    "allpurpose",
    "flour"
  ],
  "directions": [
    "0",
    "Roast garlic and make stock: Preheat oven to 400°F.",
    "Separate 6 cloves from garlic (do not peel), drizzle with a little olive oil, and double-wrap tightly in foil. Roast until garlic is very soft, about 45 minutes.",
    "While garlic roasts, heat oil (2 tablespoons) in a 4-to 5-quart heavy pot over medium heat until it shimmers, then cook vegetables, remaining garlic cloves (separated but not peeled), bay leaf, and peppercorns, stirring occasionally, until browned, about 8 minutes. Stir in wine and boil until most has evaporated. Add soy sauce and water and simmer, uncovered, 30 minutes.",
    "Strain stock through a fine-mesh sieve into a large measuring cup. If you have more than 4 cups, boil to reduce; if less, add water.",
    "Boil potatoes: Unless they are very small, cut potatoes (peeled if desired) into 2-inch pieces. Generously cover with cold water in a 5-quart saucepan and add 2 teaspoons salt. Simmer, uncovered, until just tender, 12 to 15 minutes. Reserve 1/3 cup cooking liquid and stir butter and oil into it. Drain potatoes, then return to pan along with reserved liquid and coarsely mash. Season with salt and pepper and keep warm, covered.",
    "Make Gravy while potatoes cook: Mash roasted garlic to a purée.",
    "Melt butter in a heavy medium saucepan over medium heat. Stir in flour and garlic purée and cook, stirring, 2 minutes. Slowly add stock, whisking, then simmer 3 minutes. Season with salt and pepper.",
    "Cooks’ note: Stock or gravy can be made 3 days ahead and chilled."
  ],
  "ingredients": [
    "0",
    "1 large head garlic",
    "2 tablespoons olive oil plus additional for drizzling",
    "1 leek, quartered and washed",
    "1 onion, left unpeeled, quartered",
    "2 carrots, quartered",
    "1 parsnip, quartered",
    "2 celery ribs, quartered",
    "1 Turkish or 1/2 California bay leaf",
    "1/2 teaspoon black peppercorns",
    "1 1/2 cups dry white wine",
    "1/3 cup soy sauce",
    "6 cups cold water",
    "1",
    "4 pounds boiling potatoes",
    "3 tablespoons unsalted butter, cut into pieces",
    "3 tablespoons extra-virgin olive oil",
    "2",
    "5 tablespoons unsalted butter",
    "1/3 cup all-purpose flour"
  ],
  "__v": 1
}