{
  "__v": 1,
  "directions": [
    "0",
    "Combine flour, baking powder, and salt in a mixing bowl and whisk thoroughly until the ingredients are evenly distributed. Set aside.",
    "Put the cocoa powder in the bowl where the hot water is and stir until the cocoa powder is diluted. Set aside.",
    "Combine the butter and sugar in a separate mixing bowl then cream (electric mixer is needed) until texture become fluffy",
    "Add the eggs while mixing continuously then put-in the vanilla essence.",
    "Put in half of the flour-baking powder-salt mixture then mix well.",
    "Add the other half of the flour-baking powder-salt mixture then continue mixing until all the ingredients are well distributed.",
    "Pour the cocoa mixture and continue mixing until texture becomes smooth.",
    "Preheat the oven to 375 degrees Fahrenheit",
    "Fill the cupcake pan with cupcake paper cups.",
    "Put the batter in each paper cup then bake for 18 minutes (insert toothpick in the cupcakes, if it comes out clean then the cupcakes are done).",
    "Remove the cupcake from the oven and allow to cool down over a wire rack.",
    "Melt the chocolate by placing it in a bowl over boiling water.",
    "Once melted, set aside and allow to cool down to room temperature",
    "Put the butter in a mixing bowl then cream (use electric mixer)",
    "Add the sugar and continue mixing until the texture becomes fluffy.",
    "Put-in the vanilla essence and chocolate then mix thoroughly until texture becomes smooth.",
    "Place the frosting over the cupcakes. (I use a pipe so that the frosting can easily be swirled. If you don’t have any tools, you may use a spoon or spatula to spread the frosting.",
    "Serve with a smile. Share and enjoy!"
  ],
  "firstAdded": "2014-05-10T10:58:46.037000",
  "hash": "e50fff44cd53384a2070c44a15d72a3ef5751723",
  "href": "http://panlasangpinoy.com/2009/11/06/dessertchocolate-cupcake-recipe/",
  "image": "http://panlasangpinoy.com/wp-content/uploads/2009/11/Chocolate-Cupcake.jpg",
  "ingredients": [
    "0",
    "1 1/3 cups all purpose flour, sifted",
    "2 tsp baking powder",
    "1/2 tsp salt",
    "1/2 cup cocoa powder",
    "1 cup hot water",
    "1/2 cup unsalted butter",
    "1 cup granulated sugar, sifted",
    "2 pieces raw eggs",
    "2 tsp vanilla essence",
    "1",
    "2/3 cup unsalted butter",
    "1 1/3 cups confectioners sugar, sifted",
    "4 ounces unsweetened chocolate",
    "1 1/2 tsp vanilla essence"
  ],
  "keywords": [
    "purpose",
    "flour",
    "sifted",
    "baking",
    "salt",
    "cocoa",
    "hot",
    "water",
    "unsalted",
    "butter",
    "granulated",
    "sugar",
    "pieces",
    "raw",
    "eggs",
    "vanilla",
    "essence",
    "confectioners",
    "chocolate"
  ],
  "title": "Chocolate Cupcake Recipe",
  "users": [
    null
  ]
}