{
  "hash": "8cff83ee09a0c02a22df4ff60fa05bb25d002dad",
  "title": "BREAKFAST KIFLE",
  "image": "https://bakingwithsibella.files.wordpress.com/2015/02/kifle.jpg?w=656&h=451",
  "href": "https://bakingwithsibella.com/2015/02/20/breakfast-kifle/",
  "extension": "Chrome",
  "firstAdded": "2018-12-11T13:18:27.050000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "How to prepare:",
    "Combine all dry ingredients in a mixer bowl and start mixing slowly",
    "Combine water, milk and oil and while mixer is on slow, start adding liquid to the bowl with dry ingredients.",
    "Increase the speed to medium and mix for 3-4 minutes",
    "Now let it rest for about 5 minutes and then mix again 3-4 minutes. Kifle dough is supposed to be medium firm. If it’s too soft, add more flour.",
    "Dust your working surface with flour, remove the dough from the bowl and knead it by hand 10-20 times. Place it back into the bowl, cover with a kitchen towel and let it rise until double in volume (about 1 hour).",
    "Divide the dough in two. Roll each piece into a 45 cm (18 inch) circle. With a pizza cutter, cut each circle once vertically, once horizontally and twice diagonally to get 8 triangles.",
    "To form a kifla, first fold in both corners at a short side of the triangle. Now pressing down roll the bread until the end tip. You can also shape it to look like a crescent. Place it onto a greased baking sheet with the end tip facing down. Repeat will all remaining triangles.",
    "8. Cover them and let rest and rise for about 30 minutes.",
    "9. Heat your oven to 400 F (200 C).",
    "10. Lightly beat an egg white and brush over bread.",
    "11. Sprinkle each kifla with salt.",
    "12. Bake about 15-20 minutes or until golden brown.",
    "13. Remove from the oven, brush with melted butter and cover for 10 minutes."
  ],
  "ingredients": [
    "0",
    "Breakfast Kifle",
    "FEBRUARY 20, 2015 ~ BAKINGWITHSIBELLA.COM",
    "Kifle (sing. kifla) are one of the most popular Bosnian breakfast breads. In the US kifle are known as a Christmas pastry filled with walnuts, but in Bosnia, kifle are actually any type of bread or pastry made in a shape of a crescent and today I wanted to introduce the most loved and known kind.",
    "Every Bosnian bakery or a grocery store sells kifle. They are always fresh, airy and super delicious. They are usually served at breakfast with variety of spreads such as butter, paté, cream cheese, jam, honey, nutella, etc. Sometimes we slice them length-wise and make sandwiches or they can be served instead of bread at a lunch or dinner table.",
    "They are made out of most simple ingredients, found in every pantry and can easily be prepared at home. I usually make them for a weekend breakfast when everyone is home and can take time to enjoy them.",
    "BREAKFAST KIFLE",
    "[Printable recipe]",
    "Ingredients:",
    "650-700 g (about 5 cups) all purpose flour",
    "1 envelope active dry yeast",
    "1 TBSP sugar",
    "2 tsp salt",
    "300 ml (1 + 1/4 cup) warm water",
    "200 ml (about 1 cup) warm milk",
    "50 ml (1/4 cup) oil",
    "+",
    "1 egg white (lightly beaten)",
    "Salt for sprinkling",
    "Butter (melted) for brushing"
  ],
  "__v": 1
}