{
  "hash": "b434f80ac43fc0b42d1d3ca8ec1c1c3040fb37db",
  "title": "Rigatoni with Sausage, Peas and Fresh Ricotta",
  "image": "https://images.food52.com/pZTzaA4JzKbbdnwdue9eV15F5YU=/753x502/1b0859ae-36da-4185-ad64-5f96a66230db--032211F_372.JPG",
  "href": "https://food52.com/recipes/10448-rigatoni-with-sausage-peas-and-fresh-ricotta",
  "extension": "Chrome",
  "firstAdded": "2017-02-13T15:54:33.830000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Run the tomatoes through a food mill and discard the peels and seeds. (You can puree them in a blender or food processor if you don't have a mill.)",
    "Heat the olive oil gently in a large heavy saucepan over medium low heat. Add the bay leaf, fennel, garlic and red pepper flakes (for a milder sauce, you can add these at the end). Season with salt and pepper and saute until the fennel is soft and ever so slightly brown at the edges.",
    "Add the tomatoes, stir, and lower the heat to low. Cook gently, stirring every so often, for 2 hours.",
    "If you have a grill or grill pan, grill the sausages whole, then slice into 1/2-inch rounds. Alternatively, you can rub them with a bit of olive oil and roast in the oven on a sheet tray at 400 for 10 to 12 minutes, and then slice into rounds.",
    "When the sauce is reduced, cook the pasta according to the package directions (but probably you should add the pasta to rapidly boiling, highly salted water; then once it comes back up to a boil, cook for 8 to 10 minutes). Retain 1 cup of pasta water and drain the pasta.",
    "Pour two-thirds of the sauce into a large saute pan, add the sausage and heat through over medium heat.",
    "Add the warm pasta to the sauce, plus about 1/2 cup of pasta water (more if you think you need it). Saute, turning with tongs and shaking the pan until the sauce has been absorbed into the pasta. Add the peas at the last minute.",
    "Serve with a HEAPING dollop of cold ricotta cheese and shavings of ricotta salata. Garnish with fennel fronds."
  ],
  "ingredients": [
    "0",
    "2 large cans whole San Marzano tomatoes (look for DOP or is it DOC I can't remember)",
    "4 tablespoons olive oil",
    "1 bay leaf (pref fresh)",
    "1 cup diced fresh fennel (reserve the fronds for garnish)",
    "4 cloves garlic, peeled and smashed",
    "1/2 tablespoon red pepper flakes, or to taste",
    "1 pound sweet or hot (or both) Italian sausage with fennel seeds",
    "1/2 cup defrosted petit pois",
    "1 pound rigatoni (large ridges)",
    "1 pint fresh ricotta",
    "1/4 pound ricotta salata"
  ],
  "__v": 1
}