{
  "hash": "9382d0accba6252feedcd889221cf62594d49549",
  "title": "CHICKEN FRANCAISE WITH ARTICHOKE HEARTS",
  "image": "",
  "href": "http://www.geniuskitchen.com/recipe/chicken-francaise-with-artichoke-hearts-408199",
  "extension": "Chrome",
  "firstAdded": "2017-11-21T22:11:49.992000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Over medium heat melt 1 tbsp of butter and 1 tbsp olive oil in large saucepan.",
    "You’ll need two shallow dishes, one for the eggwash and in the other combine 1/3 cup flour, 1 tsp salt, ½ tsp pepper, and ½ tsp paprika.",
    "Pat THINLY sliced chicken dry (pound them thin, if you can’t buy them thin) Dredge the chicken in the flour, shake off excess, and evenly coat in the egg wash. Then place in pan. You’ll probably have to work in batches, depending on the size of your pan.",
    "Brown the chicken on both sides on med-high heat, about 4 minutes on each side. Repeat steps until all the chicken has been browned and set aside.",
    "Turn heat down to medium and add 1 tbsp of olive oil to pan. Sautee shallots until translucent, being careful not to burn. Add artichokes and turn the heat up to medium high so that artichokes will get a little crisp to them.",
    "Return heat to medium. Push the artichokes and shallots to one side of the pan, leaving an area for you to melt a tbsp of butter and a tbsp of flour together. Whisk together to create a roux which will thicken the sauce.",
    "Mix together roux, shallots, and artichokes in pan. Add chicken stock, white wine, lemon juice, ½ tsp of salt, and ½ tsp pepper, and parsley. Stir to make sure the roux dissolves evenly in the liquid to prevent clumping. Let sauce reduce and flavors connect for about 10 minutes.",
    "Return chicken to pan and spoon sauce over so that it is completely immersed in the sauce. Cook the chicken thoroughly, about 7-10 minutes, depending on thickness of chicken.",
    "Remove chicken and put on serving platter or plate and pour sauce over top."
  ],
  "ingredients": [
    "0",
    "1 -1 1⁄4 lb thinly sliced chicken breast",
    "1 (14 ounce) canquartered water-packed artichoke hearts, drained",
    "1⁄2 cup white wine",
    "1⁄2 cup chicken stock",
    "1⁄4 cup fresh squeezed lemon juice",
    "1⁄4 cup minced shallot",
    "1⁄3 cup flour, and",
    "1 tablespoon flour",
    "2 tablespoons butter",
    "2 tablespoons olive oil",
    "1 tablespoon chopped fresh parsley",
    "1 1⁄2 teaspoons kosher salt",
    "1 teaspoon cracked black pepper",
    "1⁄2 teaspoon paprika",
    "eggwash -one egg beaten with 3 tbs water"
  ],
  "__v": 1
}