{
  "hash": "eac96bc65ad8384343e6e77e2b875fe5f3202774",
  "title": "Super Simple Friday Night Meatballs",
  "image": "http://www.seriouseats.com/recipes/assets_c/2014/09/20140721-meatballs-carinaromano-thumb-1500xauto-411156.jpg",
  "href": "http://www.seriouseats.com/recipes/2014/09/super-simple-friday-night-meatballs-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-03-07T10:43:38.752000",
  "users": [
    null
  ],
  "keywords": [
    "tomatoes",
    "extravirgin",
    "olive",
    "oil",
    "garlic",
    "tomato",
    "kosher",
    "salt",
    "black",
    "pepper",
    "meatballs",
    "slices",
    "bread",
    "crusts",
    "eggs",
    "beef",
    "adobo",
    "seasoning",
    "goya",
    "parsley",
    "leaves",
    "frying",
    "pasta",
    "parmesan",
    "cheese"
  ],
  "directions": [
    "0",
    "For the Sauce: Crush tomatoes by hand, with a food mill, or in the food processor to a very rough puree. Heat oil in a large Dutch oven over medium heat until shimmering. Add garlic and cook, stirring, until softened but not browned, about 1 minute. Add tomato paste and cook, stirring, until fragrant, about 1 minute longer. Add crushed tomatoes, bring to a simmer, cover, and reduce heat to low. Season lightly with salt and pepper. Meanwhile, make the meatballs.",
    "For the Meatballs: Tear bread into rough chunks and pulse in the food processor until reduced to fine crumbs. Transfer to a large bowl. Add the eggs and mix with your hands until combined. Add beef, adobo seasoning, and half of the parsley. Combine mixture with your hands, working the bread crumbs into the meat until meat mixture can form a ball that holds together when tossed back into the bowl. Do not over mix.",
    "Place a small amount of mixture on a microwave-safe plate and microwave on high until cooked, about 20 seconds. Taste and add salt and/or pepper to mixture to taste. Using wet hands, form the mixture into balls roughly 2 tablespoons each, about 1 1/2- to 2-inches across. Place the balls on a large parchment or wax paper-lined tray as you work.",
    "Add enough oil to a large cast iron or stainless steel sauté pan to form a thin layer across the bottom. Heat over medium-high heat until shimmering. Add as many meatballs as will fit in a single layer and cook until well browned on first side. Gently turn balls with tongs or a thin metal spatula and continue cooking and turning until well browned on all sides. As the meatballs finish browning, add them to the pot of sauce and replace them with raw meatballs. Continue, adding more oil as necessary, until all meatballs are browned and in the sauce.",
    "Simmer over low heat for 1 hour. Season to taste with salt and pepper and stir in remaining fresh parsley. Serve with pasta and grated Parmesan cheese."
  ],
  "ingredients": [
    "0",
    "For the Sauce:",
    "2 (28 ounce) cans whole peeled tomatoes",
    "2 tablespoons extra-virgin olive oil",
    "6 to 8 cloves minced garlic (about 2 tablespoons)",
    "1 (6 ounce) can tomato paste",
    "Kosher salt and freshly ground black pepper",
    "For the Meatballs:",
    "4 slices bread, crusts removed",
    "2 eggs",
    "2 pounds 80/20 ground beef",
    "1 1/2 tablespoons adobo seasoning (such as Goya), see note above",
    "1/2 cup minced fresh parsley leaves",
    "Kosher salt and freshly ground black pepper",
    "Olive oil for frying",
    "Pasta and grated Parmesan cheese for serving"
  ],
  "__v": 1
}