{
  "hash": "a24d0c0992e7cd859a8d5727582af0cf183847de",
  "title": "Chile & Orange-Glazed Chicken",
  "image": "https://media.blueapron.com/recipes/2755/square_newsletter_images/1516981424-1-0039-5250/0205_2PP_Chile_Orange_Glazed_Chicken_0034_SQ_hi_res.jpg",
  "href": "https://www.blueapron.com/recipes/chile-orange-glazed-chicken-with-roasted-vegetables-garlic-mashed-potatoes",
  "extension": "Chrome",
  "firstAdded": "2018-02-14T23:40:20.754000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare the ingredients:",
    "Place an oven rack in the center of the oven, then preheat to 450°F. Heat a medium pot of salted water to boiling on high. Wash and dry the fresh produce. Peel the carrots; quarter lengthwise, then cut crosswise into 2-inch pieces. Cut off and discard the bottom 1/2 inch of the broccoli stem; cut the broccoli into small pieces, keeping the florets intact. Large dice the potatoes. Peel the garlic; using the flat side of your knife, smash each clove once to flatten. Halve the orange; squeeze the juice into a medium bowl, straining out any seeds. Cut off and discard the root ends of the scallions; thinly slice, separating the white bottoms and green tops.",
    "2 Roast the vegetables:",
    "Place the sliced carrots and broccoli pieces on a sheet pan. Drizzle with olive oil and season with salt and pepper; toss to coat. Arrange in an even layer. Roast 19 to 21 minutes, or until browned and tender when pierced with a fork. Remove from the oven.",
    "3 Cook & mash the potatoes:",
    "While the vegetables roast, add the diced potatoes and smashed garlic to the pot of boiling water. Cook 14 to 16 minutes, or until tender when pierced with a fork. Turn off the heat. Drain thoroughly and return to the pot. Add the sliced white bottoms of the scallions and 2 tablespoons of olive oil. Using a fork, mash to your desired consistency. Season with salt and pepper to taste. Cover to keep warm.",
    "4 Make the glaze:",
    "While the potatoes cook, to the bowl of orange juice, add as much of the chile paste as you’d like, depending on how spicy you’d like the dish to be. Whisk to combine; season with salt and pepper.",
    "5 Cook & glaze the chicken:",
    "While the potatoes continue to cook, pat the chicken dry with paper towels. Season with salt and pepper on both sides. In a medium pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the seasoned chicken; cook 5 to 7 minutes on the first side, or until browned. Flip and cook 5 to 6 minutes, or until lightly browned. Add the glaze (carefully, as the glaze may splatter) and cook, constantly spooning the glaze over the chicken, 30 seconds to 1 minute, or until the glaze is thickened and the chicken is cooked through. Turn off the heat.",
    "6 Serve your dish:",
    "Serve the glazed chicken (including any glaze from the pan) with the mashed potatoes and roasted vegetables. Garnish with the sliced green tops of the scallions. Enjoy!"
  ],
  "ingredients": [
    "0",
    "2",
    "Boneless, Skinless Chicken Breasts",
    "6",
    "oz",
    "Carrots",
    "2",
    "cloves",
    "Garlic",
    "1",
    "Cara Cara Orange",
    "¾",
    "lb",
    "Golden Potatoes",
    "½",
    "lb",
    "Broccoli",
    "2",
    "Scallions",
    "1",
    "Tbsp",
    "Ancho Chile Paste"
  ],
  "__v": 1
}