{
  "hash": "346004549b0ec36d07aeeb7fd76c0371a7805fca",
  "title": "Next Level Vegan Enchiladas",
  "image": "http://cdn.ohsheglows.com/wp-content/uploads/2016/02/20160129-Vegan-enchiladas-with-cashew-cilantro-cream-sauce-blog-00756.jpg",
  "href": "http://ohsheglows.com/2016/02/01/next-level-vegan-enchiladas/",
  "extension": "Chrome",
  "firstAdded": "2016-02-15T22:04:44.547000",
  "users": [
    null
  ],
  "keywords": [
    "enchiladas",
    "dice",
    "potato",
    "extravirgin",
    "olive",
    "oil",
    "medium",
    "red",
    "onion",
    "garlic",
    "jarred",
    "roasted",
    "pepper",
    "oilpacked",
    "sundried",
    "tomatoes",
    "baby",
    "spinach",
    "roughly",
    "black",
    "beans",
    "rinsed",
    "enchilada",
    "batch",
    "lime",
    "juice",
    "chili",
    "cumin",
    "salt",
    "mediumlarge",
    "soft",
    "tortilla",
    "wraps",
    "toppings",
    "cilantrolimegarlic",
    "cashew",
    "cream",
    "green",
    "avocado",
    "cilantro"
  ],
  "directions": [
    "0",
    "Directions:",
    "Prepare the Homemade Enchilada Sauce and soak the cashews for the Cilantro-Lime-Garlic Cashew Cream before you begin.",
    "Lightly grease a large rectangular baking dish (at least 8x12-inches). Set aside.",
    "Add the chopped sweet potato into a medium pot of water and bring to a boil. Reduce heat and simmer for 9 to 15 minutes, uncovered, until fork tender. Drain and set aside. You can also steam the potatoes until tender, instead of boiling.",
    "In a large skillet, stir together the oil, onion, and garlic and sauté over medium heat for around 3 to 5 minutes until the onion softens. Season with a pinch of salt and pepper.",
    "Preheat the oven to 350F.",
    "Add the chopped roasted peppers, sun-dried tomatoes, cooked/drained sweet potato, spinach, and black beans. Cook for 3 to 5 minutes over medium-high heat, until the spinach is wilted.",
    "Stir in 1/4 cup plus 2 tablespoons of homemade enchilada sauce, followed by the lime juice, chili powder, cumin, and salt. Adjust seasonings to taste, if desired.",
    "Add 3/4 cup of Enchilada sauce onto the bottom of your casserole dish and spread it out evenly.",
    "Scoop 3/4 cup of the sweet potato and black bean filling onto each tortilla. Roll up the tortilla and place it, seam side down, in the casserole dish. Repeat for the rest. If you have any leftover filling, you can spread it on top of the tortillas. Spread all of the remaining enchilada sauce on top of the tortillas until they are completely covered in sauce.",
    "Bake the enchiladas, uncovered, at 350⁰F for 20 to 25 minutes, until the sauce is a deep red colour and the enchiladas are heated through.",
    "While the enchiladas are baking, prepare the Cilantro-Lime-Garlic Cashew Cream.",
    "When enchiladas are ready to serve, add half of the cashew cream into a baggie, snip off the corner, and “pipe” the sauce all over the enchiladas. Alternatively, you can simply spread or dollop the sauce on top of each enchilada. Garnish with chopped cilantro, avocado, red pepper flakes, and green onion. Serve any remaining cashew cream on the side with a spoon.",
    "Tips:",
    "Make it kid-friendly: Omit the cayenne and red pepper flakes."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "For the enchiladas:",
    "2 cups peeled and chopped (1/2-inch dice) sweet potato (260g)",
    "1 tablespoon plus 1 teaspoon extra-virgin olive oil",
    "1 medium red onion, diced (2 to 2 1/2 cups)",
    "3 large garlic cloves, minced",
    "1 cup jarred roasted red pepper, drained and chopped",
    "1/2 cup oil-packed sun-dried tomatoes, drained and finely chopped",
    "2 cups baby spinach, roughly chopped",
    "1 (14-ounce) can black beans (about 1 1/2 cups), drained and rinsed",
    "2 1/2 cups Homemade Enchilada Sauce (1 batch)",
    "1 tablespoon fresh lime juice",
    "1 teaspoon chili powder",
    "1 teaspoon ground cumin",
    "1/2 teaspoon fine sea salt, or to taste",
    "5 to 6 medium/large soft tortilla wraps",
    "For the toppings:",
    "Cilantro-Lime-Garlic Cashew Cream",
    "Chopped green onion, red pepper flakes, avocado, and cilantro"
  ],
  "__v": 1
}