{
  "hash": "652b873fcc4ac7f51f7a849204ef63046b208413",
  "title": "Coconut-Almond French Toast Casserole",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/food-network-kitchens/coconut-almond-french-toast-casserole.html",
  "extension": "Chrome",
  "firstAdded": "2015-03-10T16:03:56.117000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "butter",
    "greasing",
    "dish",
    "slices",
    "texas",
    "toast",
    "thicksliced",
    "bread",
    "eggs",
    "halfandhalf",
    "granulated",
    "sugar",
    "vanilla",
    "cinnamon",
    "salt",
    "sweetened",
    "coconut",
    "almonds",
    "allpurpose",
    "flour",
    "softened",
    "egg",
    "yolk"
  ],
  "directions": [
    "0",
    "Confectioners' sugar and berries, for garnish, optional",
    "Preheat the oven to 300 degrees F. Lightly butter a 9-by-13-inch casserole dish.",
    "For the French toast: Lay the bread slices in one layer (it's OK if they overlap a little) on a baking sheet. Bake the slices (to dry them out a little) for 6 minutes, then flip and bake for 6 minutes more. Set aside to cool.",
    "Whisk together the eggs, half-and-half, granulated sugar, vanilla, cinnamon and salt in a large bowl. Dunk each bread slice in the egg mixture to coat thoroughly and shingle the slices in the buttered casserole dish. Pour any remaining egg mixture over the bread. Cover the dish with plastic wrap and refrigerate for at least 6 hours or overnight.",
    "For the coconut-almond crust: Put 1/2 cup of the coconut, 1/3 cup of the almonds, granulated sugar, flour and salt in a food processor and process until very fine. Add the butter, egg and egg yolk and process well to form a smooth paste.",
    "To assemble the casserole: Preheat the oven to 350 degrees F. Spread the coconut-almond mixture evenly over the soaked bread slices. Top with the remaining 1/4 cup sliced almonds and 3 tablespoons coconut and bake until puffed and lightly golden and the custard is set (the center of the casserole will no longer jiggle when shaken), 45 to 50 minutes. Allow to cool for 1 hour before serving, or serve at room temperature.",
    "Serve with a sprinkling of powdered sugar and berries if using.",
    "Copyright 2013 Television Food Network, G.P. All rights reserved",
    "Recipe courtesy Food Network Kitchens"
  ],
  "ingredients": [
    "0",
    "Unsalted butter, for greasing dish",
    "9 slices Texas Toast or other thick-sliced bread",
    "6 large eggs",
    "3 1/2 cups half-and-half",
    "5 tablespoons granulated sugar",
    "1 teaspoon pure vanilla extract",
    "1/2 teaspoon ground cinnamon",
    "Pinch of salt",
    "1/2 cup plus 3 tablespoons sweetened coconut flakes",
    "1/3 cup plus 1/4 cup sliced almonds",
    "5 tablespoons granulated sugar",
    "5 tablespoons all-purpose flour",
    "Pinch salt",
    "6 tablespoons unsalted butter, softened",
    "1 large egg plus 1 large egg yolk"
  ],
  "__v": 1
}