{
  "hash": "dd39db15b9060e6f4605d51eb6dec47be6e68fc6",
  "title": "Easy Salted Oat Fudge",
  "image": "http://cookieandkate.com/images/2014/12/healthy-fudge-recipe.jpg",
  "href": "http://cookieandkate.com/2014/easy-salted-fudge-recipe/",
  "firstAdded": "2015-01-07T11:32:42.763000",
  "users": [
    null
  ],
  "keywords": [
    "creamy",
    "unsalted",
    "almond",
    "peanut",
    "butter",
    "semisweet",
    "chocolate",
    "chips",
    "maple",
    "syrup",
    "honey",
    "cubes",
    "coconut",
    "oil",
    "salt",
    "scale",
    "nut",
    "salted",
    "cinnamon",
    "vanilla",
    "oats",
    "flour",
    "step",
    "pecans",
    "nuts",
    "flaky",
    "sprinkling"
  ],
  "directions": [
    "0",
    "Prep work: Preheat oven to 325 degrees Fahrenheit. Cut two strips of parchment paper to fit across the interior of an 8 to 9-inch square baker. Criss-cross the papers at the bottom of the baker and fold the ends up the sides of the baker (see photos). If you need to make your own oat flour, blend 1 and ¾ cups oats in a blender or food processor until ground into a fine flour.",
    "Toast the nuts: Arrange the nuts in a single layer on a small, rimmed baking sheet (I used parchment paper for easy clean-up). Bake for 7 to 10 minutes, until fragrant (7 minutes for thinner/smaller/chopped nuts and about 10 for whole pecans). If you're using large nuts like pecans, transfer them to a cutting board and chop them into small pieces with a chef's knife.",
    "Make the fudge: In a medium-sized, heavy-bottomed pot, combine the nut butter, chocolate chips, sweetener, butter, salt and cinnamon. Warm the pot over medium heat, stirring often, until the mixture is melted throughout. Remove the pot from heat.",
    "Stir the vanilla extract into the pot, followed by the oat flour and finally, the chopped pecans. The mixture will have thickened up at this point, so you might have to put some muscle into it to mix in those pecans. You can do it!",
    "Carefully dump the fudge mixture into your lined square baker. Use the back of a sturdy mixing spoon to push the mixture across the baker so it's roughly evenly distributed. Cover the bottom side of a thick, heavy-bottomed drinking glass or mason jar with parchment paper and press it down on the fudge repeatedly until the fudge is evenly packed. If you're finishing the fudge with flaky sea salt, lightly sprinkle some on top now and gently press it into place with the bottom of your parchment-covered glass.",
    "Cover and freeze the fudge for 30 to 45 minutes, until it's firm to the touch and no longer shiny in the middle. If you're not in a hurry, you can refrigerate the fudge for a couple of hours or longer.",
    "Use a chef's knife to slice the fudge into 1¼-inch wide columns and rows. Fudge will keep well for a couple of days at room temperature, or for a few weeks in the freezer, sealed in an air-tight freezer bag."
  ],
  "ingredients": [
    "0",
    "¾ cup creamy unsalted almond butter or peanut butter",
    "¾ cup semi-sweet chocolate chips",
    "⅓ cup maple syrup or honey",
    "4 tablespoons butter, sliced into small cubes, or ¼ cup melted coconut oil",
    "¾ teaspoon salt (scale back, to taste, if your nut butter is salted)",
    "½ teaspoon ground cinnamon",
    "1½ teaspoons vanilla extract",
    "1¾ cups oats ground into flour, see step 1",
    "1 cup whole pecans or other nuts",
    "Optional: Flaky sea salt, for sprinkling on top"
  ],
  "__v": 1
}