{
  "hash": "926ff9a7ee8478e846ec253f36b01749d6bca830",
  "title": "Easy Teriyaki Chicken",
  "image": "http://search.chow.com/thumbnail/1600/0/www.chowstatic.com/assets/2014/09/30551_easy_teriyaki_chicken_3000x2000.jpg",
  "href": "http://www.chow.com/recipes/30551-easy-teriyaki-chicken",
  "extension": "Chrome",
  "firstAdded": "2015-05-18T01:22:45.448000",
  "users": [
    null
  ],
  "keywords": [
    "lowsodium",
    "soy",
    "honey",
    "ginger",
    "holes",
    "box",
    "grater",
    "boneless",
    "skinless",
    "chicken",
    "breasts",
    "thighs",
    "black",
    "pepper",
    "oil",
    "medium",
    "scallions"
  ],
  "directions": [
    "0",
    "1Bring the soy sauce and honey to a simmer in a small saucepan over medium heat, stirring often until the honey has completely dissolved, about 5 minutes. Add the ginger, stir to combine, remove from the heat, and set aside.",
    "2If using chicken breasts, place them on a cutting board and cover with a sheet of plastic wrap. Use a meat mallet or a frying pan to gently pound them to a 1/2-inch thickness. Cut each in half so you have 4 pieces roughly the same size. (If using chicken thighs, no need to pound or cut.) Season both sides of the chicken with pepper.",
    "3Heat the oil in a large frying pan over high heat until shimmering. Add the chicken in a single layer and cook without disturbing until browned, about 3 minutes. Flip and cook the second side until browned, about 3 minutes more.",
    "4Reduce the heat to medium, slowly pour in the reserved sauce, and cook, flipping the chicken occasionally to coat in the sauce, until cooked through, about 3 minutes.",
    "5Transfer the chicken from the pan, letting the excess sauce drip off, to a clean cutting board. Reduce the sauce in the pan over medium heat until slightly thickened, about 3 minutes more. Slice the chicken crosswise into 1/2-inch pieces. Place on a serving dish, top with the sauce, and sprinkle with the scallions."
  ],
  "ingredients": [
    "0",
    "3/4 cup low-sodium soy sauce",
    "1/4 cup honey",
    "1 1/4 teaspoons peeled, grated fresh ginger (from about a 1-1/2-inch piece), grated on the small holes of a box grater",
    "1 pound boneless, skinless chicken breasts or thighs",
    "Freshly ground black pepper",
    "4 teaspoons vegetable oil",
    "2 medium scallions, thinly sliced"
  ],
  "__v": 1
}