{
  "hash": "4415e9d725e6aa953734572deb3f0dfca99302ff",
  "title": "How to Make Vegan Pepper Jack Cashew Cheese",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2013/12/pepper-jack-cashew-cheez-1200x724.jpg",
  "href": "http://www.onegreenplanet.org/vegan-food/how-to-make-vegan-pepper-jack-cashew-cheese/",
  "extension": "",
  "firstAdded": "2015-04-01T06:36:37.771000",
  "users": [
    null
  ],
  "keywords": [
    "pomonas",
    "pectin",
    "use",
    "brand",
    "wont",
    "set",
    "water",
    "raw",
    "cashews",
    "lemon",
    "juice",
    "nutritional",
    "yeast",
    "salt",
    "onion",
    "garlic",
    "red",
    "pepper",
    "depending",
    "heatometer",
    "agar",
    "makes",
    "firmer",
    "cheese",
    "quickly",
    "stir",
    "added",
    "canned",
    "green",
    "chilies",
    "pimientos",
    "putting",
    "containers",
    "doing",
    "cause",
    "bit",
    "shorter",
    "shelf",
    "life"
  ],
  "directions": [
    "0",
    "Lightly oil half (6) of a cupcake tin rounds in a pan with a 12 cupcake capacity (or if you have a 6 cup one, just use that!). Use your blender to combine 1/2 package of the dry pectin (about 4.5 teaspoons) and the agar powder (optional) with the water and lemon juice. Pour water mixture into a small sauce pan and bring to a boil over medium high heat while stirring constantly. Set to low heat and let simmer while you grind cashews, nutritional yeast, salt, garlic powder and onion powder until very fine in food processor or with your Estrogen (Blendtec) or Testosterone (Vitamix) Blender. Do not over process and make nut butter.",
    "Mix 1/2 C. water (not included in amount above list) with the small calcium packet from the pomona’s pectin package, set aside. Pour the boiled water mixture over the ground cashew mixture into the power blender, ignoring instructions in your blender manual that say not to use boiling water in it. Blend until smooth and creamy. It’s gonna thicken quickly, so immediately add HALF (1/4 C.) of the calcium water and the crushed red pepper flakes and pulse until all combined. Immediately pour the hot cheese into the prepared cupcake tin(s).",
    "Refrigerate uncovered for an hour. Turn mini cashew cheeses out onto a plate (upside down) and let set uncovered in the fridge for another 4-5 hours. 1 serving of cashew cheese is half of one mini round, which is the perfect amount for 1 grilled cheese sandwich or 1 quesadilla. This recipe makes 12 servings of cheese. Don’t forget to store the rest of your pectin and calcium water for the next batch. Calcium water stores well in the fridge and the pectin will store in your pantry indefinitely. Cashew cheese keeps for about a week in the fridge and freezes well."
  ],
  "ingredients": [
    "0",
    "1/2 package Pomona’s Pectin (must use this brand! Otherwise it won’t set!)",
    "1 C. water",
    "1 C. raw cashews",
    "2 T. lemon juice",
    "2 T. nutritional yeast",
    "1 t. sea salt",
    "1/2 t. onion powder",
    "1 t. garlic powder",
    "1/2 to 2 t. crushed red pepper flakes (depending on your heat-o-meter)",
    "1 t. agar powder (optional, makes for an even firmer cheese)",
    "you can also quickly stir in some added some canned green chilies and pimientos just before putting in containers to set, but doing so will cause the cheese to have a bit of a shorter shelf life."
  ],
  "__v": 1
}