{
  "hash": "40b28d428eec65ddec7f3f2f62885237429ff549",
  "title": "CHRISTMAS ROCKY ROAD",
  "image": "https://www.nigella.com/assets/uploads/recipes/public-thumbnail/christmas-rocky-road-5624b09b6c3f3.jpg",
  "href": "https://www.nigella.com/recipes/christmas-rocky-road",
  "extension": "Chrome",
  "firstAdded": "2018-11-22T21:32:31.682000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Chop both sorts of chocolate small, or use chocolate buttons made for melting, and then put into a heavy-based pan to melt with the butter and syrup over a gentle heat.",
    "Put the biscuits into a freezer bag and bash them with a rolling pin to get big- and little-sized crumbs; you want some pieces to crunch and some sandy rubble.",
    "Put the Brazil nuts into another freezer bag and also bash them so you get different-sized nut rubble.",
    "Take the pan off the heat, and add the crushed biscuits and nuts, whole glacé cherries and mini-marshmallows. Turn carefully to coat everything with syrupy chocolate.",
    "Tip into a foil tray (I use one 236mm x 296mm / 9¼ x 12 inches), smoothing the top as best you can, although it will look bumpy.",
    "Refrigerate until firm enough to cut, which will take about 1½–2 hours. Then take the set block of rocky road out of the foil tray ready to cut.",
    "Push the icing sugar through a small sieve to dust the top of the Rocky Road. Then, if you like, add a sprinkling of edible glitter for some festive sparkle.",
    "With the long side in front of you, cut into it 6 slices down and 4 across, so that you have 24 almost-squares."
  ],
  "ingredients": [
    "0",
    "250 grams dark chocolate",
    "150 grams milk chocolate",
    "175 grams soft butter",
    "4 tablespoons golden syrup",
    "200 grams amaretti biscuits",
    "150 grams brazil nuts (shelled)",
    "150 grams red glace cherries",
    "125 grams mini marshmallows",
    "1 tablespoon icing sugar",
    "edible glitter"
  ],
  "__v": 1
}