{
  "hash": "59f7d3d4a7de33e9f41acb4d1e251890618ddae4",
  "title": "Radicchio and Comté Cheese Tart",
  "image": "http://prodstatics3cdn1.tastingtable.com/images/articles/2015_03/Web-Article-Radicchio-and-Comte-Cheese-Tart-Quiche-Recipe1.jpg",
  "href": "http://www.tastingtable.com/cook/recipes/how-to-make-comte-cheese-tart-with-radicchio",
  "extension": "Chrome",
  "firstAdded": "2015-03-03T19:49:51.369000",
  "users": [
    null
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "kosher",
    "salt",
    "cold",
    "unsalted",
    "butter",
    "pieces",
    "ice",
    "water",
    "radicchio",
    "heads",
    "slivers",
    "core",
    "bacon",
    "eggs",
    "cream",
    "dijon",
    "mustard",
    "thyme",
    "leaves",
    "nutmeg",
    "comt",
    "cheese"
  ],
  "directions": [
    "0",
    "Make the crust: In a food processor, pulse the flour, salt and butter until the butter is the size of small peas. Add the water, 1 tablespoon at a time, until the dough sticks together when pressed. Gently form the dough into a disk and wrap in plastic wrap. Refrigerate until firm, at least 30 minutes.",
    "Once the dough has chilled, roll it out into a ¼-inch-thick round, then transfer it into a 9-inch tart pan, pressing the extra dough under around the edge to make a neat crust.",
    "Place a rack in the center of the oven and preheat the oven to 350°.",
    "Make the filling: In a large skillet over medium heat, melt the butter. Add the radicchio and cook, stirring occasionally, until wilted and tender, 4 to 5 minutes. Transfer the radicchio to a bowl and set aside. Wipe the skillet clean.",
    "Place the clean skillet over medium heat and add the bacon. Cook until brown and crisp, 5 to 8 minutes. Remove the bacon and allow to drain on a paper towel-lined plate.",
    "In a mixing bowl, whisk together the eggs, cream, mustard, thyme, salt and nutmeg.",
    "In the prepared tart pan, layer the cooked radicchio, bacon and grated cheese, then pour the egg mixture on top. Place the pan on a baking sheet and bake until the filling is set and golden brown on top, 45 to 50 minutes. Allow the tart to cool in the pan for 20 minutes.",
    "Serve the tart warm or at room temperature."
  ],
  "ingredients": [
    "0",
    "1¼ cups (6 ounces) all-purpose flour",
    "½ teaspoon kosher salt",
    "½ cup (1 stick) cold unsalted butter, cut into small pieces",
    "¼ cup ice water",
    "2 tablespoons butter",
    "1¾ pounds radicchio (about 3 heads), cut into ¼-inch slivers, core removed",
    "¼ pound bacon, cut into ¼-inch pieces",
    "3 large eggs",
    "1 cup heavy cream",
    "1 teaspoon Dijon mustard",
    "1 teaspoon fresh thyme leaves",
    "½ teaspoon kosher salt",
    "¼ teaspoon freshly grated nutmeg",
    "1 cup (3 ounces) grated Comté cheese"
  ],
  "__v": 1
}