{
  "hash": "24f40ba66c0e08ee4d2e73fcd3ee041712774a70",
  "title": "Bolognese Zoodle Bake",
  "image": "https://cdn4.ruled.me/wp-content/uploads/2017/02/IMG_0361-web-1.jpg",
  "href": "https://www.ruled.me/bolognese-zoodle-bake/",
  "extension": "Chrome",
  "firstAdded": "2017-04-08T18:31:32.978000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat a skillet over medium heat, and set your slow cooker onto “low.” Finely dice half of a medium sized white onion while you wait for the skillet to heat up.",
    "Add olive oil to the frying pan.",
    "Once the oil becomes hot, add the diced onion. Cook until the onions start to become translucent and pick up a bit of color.",
    "Add in the minced garlic cloves.",
    "Crumble the ground beef into the pan. Don't worry too much about breaking up the chunks as they cook. Everything is going to fall apart in the slow cooker anyway.",
    "Add in ½ a teaspoon of thyme, ½ a teaspoon of nutmeg, ½ a teaspoon of marjoram, and black pepper to taste.",
    "Mix everything together and allow the beef to cook until it has mostly browned.",
    "Add 2 cups of Rao's basil tomato marinara sauce and stir into the beef.",
    "Stir in the 2 tablespoons of heavy whipping cream.",
    "Finish the sauce by mixing in ¼ of a cup of chicken bouillon.",
    "Turn the heat off and allow the sauce to rest for about 10 minutes before transferring it into the preheated slow cooker. Be careful not to pour hot sauce into cold stoneware. I've cracked them before!",
    "Cover the slow cooker and allow the sauce to simmer for 8 hours. Stir occasionally to prevent burning. When the sauce is ready it will take on a deep color and the house will smell like lasagne. After the sauce has finished cooking you can season with salt if needed.",
    "Preheat your oven to 350 degrees Fahrenheit.",
    "Set up a vegetable spiralizer. Use it to process the zucchini into noodles, and place the noodles in a casserole dish. Break apart the longer strands so that none of them are too long.",
    "Add 2 tablespoons of olive oil to the noodles. Season to taste and then mix together.",
    "Spread your bolognese sauce over the top of the zucchini.",
    "Top the casserole with 1 cup of shredded mozzarella cheese.",
    "If baking directly after cooking the bolognese sauce then you will only need to heat in the oven for 15-20 minutes. If you've made the sauce ahead of time and it's been chilled in the refrigerator then you will need to bake for 30-35 minutes.",
    "Garnish with fresh basil if desired."
  ],
  "ingredients": [
    "0",
    "1.5 pounds ground beef",
    "1 tablespoon olive oil",
    "½ medium white onion, about 100g or 3.5oz",
    "2-3 cloves of garlic, minced",
    "½ teaspoon thyme",
    "½ teaspoon ground nutmeg",
    "½ teaspoon ground marjoram",
    "2 cups Rao's basil tomato marinara sauce",
    "2 tablespoons heavy whipping cream",
    "¼ cup chicken bouillon",
    "salt and pepper to taste",
    "2-3 medium zucchini, about 570g or 20oz",
    "2 tablespoons olive oil",
    "1 cup shredded mozzarella cheese",
    "salt and pepper to taste",
    "optional garnish: fresh basil"
  ],
  "__v": 1
}