{
  "hash": "a0e6aad5a77fafbb1653cc4cba53db6bdf109f76",
  "title": "Broccoli and Cheddar-Stuffed Potato Skins with Avocado Cream",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2008/1/30/0/EK0404_Broccol_and_Cheddar_Stuffed_Potato_Skins.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/ellie-krieger/broccoli-and-cheddar-stuffed-potato-skins-with-avocado-cream-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-01-27T20:50:54.080000",
  "users": [
    null
  ],
  "keywords": [
    "idaho",
    "potatoes",
    "total",
    "scrubbed",
    "canola",
    "oil",
    "salt",
    "broccoli",
    "florets",
    "coarsely",
    "cooking",
    "spray",
    "pieces",
    "canadian",
    "bacon",
    "extrasharp",
    "cheddar",
    "scallions",
    "greens",
    "reserved",
    "medium",
    "avocado",
    "reducedfat",
    "sour",
    "cream",
    "lime",
    "juice",
    "cilantro",
    "leaves",
    "clove",
    "garlic"
  ],
  "directions": [
    "0",
    "Preheat oven to 450 degrees F.",
    "Pierce potatoes several times with a fork and wrap in paper towels. Microwave on high for 13 to 15 minutes, until potatoes are cooked through. Remove from microwave and cool until potatoes are easy to handle. Slice potatoes in half lengthwise. Using a spoon, scoop all but 1/8 inch of the inside of the potato, leaving skin intact. Reserve scooped potato flesh for another use.",
    "Brush both inside and outside of potatoes with oil and sprinkle with salt. Place potatoes, skin-side down, on a baking sheet and bake until skins are crisp and edges are golden brown, about 20 minutes.",
    "In the meantime, prepare the filling. Steam the broccoli until crisp-tender, about 3 to 4 minutes. Drain and set aside. Spray a nonstick pan with cooking spray and preheat over medium-high heat. Add the Canadian bacon and cook until crisp stirring often, about 3 to 4 minutes. Reserve.",
    "To make avocado cream, combine scallion whites, avocado, sour cream lime juice, cilantro, garlic and salt in the small bowl of a food processor and process on high until smooth. About 30 seconds.",
    "Toss the broccoli with cheese and spoon filling evenly among potatoes. Lower oven to 400 degrees F and return potatoes to oven until cheese is melted, about 5 minutes. Spoon 1 tablespoon of the avocado cream on top of broccoli-filled potatoes, then top with scallion greens and 1 teaspoon crisped bacon bits.",
    "Yield: 8 servings (1 serving equals 2 potato halves, 1 tablespoon avocado cream, 1/2 teaspoon scallions and 1 teaspoon bacon bits)",
    "Per Serving:",
    "Calories 180; Total Fat 10 g; (Sat Fat 3.5 g, Mono Fat 2 g, Poly Fat 1 g) ; Protein 8 g; Carb 15 g; Fiber 3 g; Cholesterol 20 mg; Sodium 380 mg",
    "(*Analyzed using 1 pound of potatoes)",
    "2007, Ellie Krieger All Rights Reserved"
  ],
  "ingredients": [
    "0",
    "8 small Idaho potatoes (about 2 1/2 pounds total), scrubbed and dried",
    "4 teaspoons canola oil",
    "1/4 teaspoon salt",
    "8 ounces broccoli florets, coarsely chopped (about 4 cups)",
    "Cooking spray",
    "3 pieces Canadian bacon, finely diced (about 3 ounces)",
    "3/4 cup grated extra-sharp Cheddar (about 3 ounces)",
    "2 scallions, thinly sliced, greens reserved",
    "1 medium avocado",
    "2 tablespoons reduced-fat sour cream",
    "2 tablespoons lime juice",
    "1/4 cup cilantro leaves",
    "1 clove garlic",
    "1/4 teaspoon salt"
  ],
  "__v": 1
}