{
  "hash": "f435af34628505cb87e314f1f4aa4f3ccbcabed4",
  "title": "Butternut Squash Soup",
  "image": "",
  "href": "https://www.thekitchn.com/butternut-squash-soup-262088",
  "extension": "Chrome",
  "firstAdded": "2018-12-31T22:41:02.655000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Sweat the onion, butternut squash, and apple. Heat the oil in a large Dutch oven over medium-high heat until shimmering. Add the onion, squash, and apple, and season with 1/2 teaspoon of the salt. Cook, stirring often, until the onions are translucent and the squash and apples begin to brown, about 10 minutes.",
    "Bloom the spices. Add the curry powder, ginger, and cinnamon and stir to coat the vegetables. Cook, stirring regularly, until the spices are fragrant, about 2 minutes.",
    "Add the broth and bring to a simmer. Add the broth and stir, scraping the bottom of the pan to loosen up the browned bits. Bring to a simmer, then reduce the heat to low.",
    "Cook the squash until tender. Cover and simmer until the squash is very tender and the soup is golden-brown and fragrant, about 20 minutes.",
    "Remove the pan from the heat, add the pumpkin, and blend. Remove the pot from the heat. Stir in the pumpkin, maple syrup, cream cheese, and remaining 1/2 teaspoon salt until the cream cheese is melted. Use an immersion blender to blend the soup until smooth. (Alterntiavely, blend the soup in batches in a stand blender.)",
    "Serve the soup. Serve the soup with a splash of heavy cream or half-and-half and a sprinkling of ground cinnamon.",
    "Recipe Notes",
    "Storage: Refrigerate in an airtight container for up to 4 days, or freeze for up to 2 months."
  ],
  "ingredients": [
    "0",
    "3 tablespoons olive oil",
    "1 small onion, diced (about 1 cup)",
    "1 small butternut squash (about 1 1/2 pounds), peeled, seeded, and cut into 1/2-inch pieces (or 1 pound cut squash)",
    "1 large honeycrisp apple, peeled and chopped",
    "1 teaspoon kosher salt, divided",
    "1 teaspoon curry powder",
    "1 teaspoon ground ginger",
    "1/2 teaspoon ground cinnamon",
    "1 quart (32 ounces) low-sodium chicken or vegetable broth",
    "1 cup pumpkin purée",
    "2 tablespoons maple syrup",
    "2 ounces cream cheese",
    "Heavy cream or half-and-half, for serving",
    "Equipment",
    "6-quart Dutch oven",
    "Measuring cups and spoons",
    "Chef’s knife and cutting board",
    "Immersion blender",
    "Can opener",
    "Wooden spoon",
    "Vegetable peeler"
  ],
  "__v": 2
}