{
  "hash": "7bfab60162e4b14d442ba8ae2a992b42deb00897",
  "title": "Cheese Empanadas",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/cheese-empanadas.html",
  "firstAdded": "2015-01-24T16:08:02.013000",
  "users": [
    null
  ],
  "keywords": [
    "shortening",
    "salt",
    "precooked",
    "corn",
    "flour",
    "harina",
    "pan",
    "maseca",
    "mozzarella",
    "cheese",
    "melts",
    "oil",
    "frying"
  ],
  "directions": [
    "0",
    "Mixing by hand, combine 2 cups warm water, the shortening and salt in a medium bowl. Slowly add the flour, mixing quickly to avoid lumps. Knead until the ingredients are evenly combined. Let the dough rest for 5 minutes, then shape into small balls (about 3 ounces each).",
    "Using a hand tortilla press, place a piece of waxed paper on the bottom, center a dough ball on top and cover with another piece of waxed paper. Gently press down to flatten the ball into a thin circle (not too thin or it will crack). Alternatively, you can use a wooden board or large plate to press the dough.",
    "Remove the top paper and add 1 tablespoon of the cheese to the middle of the pressed dough. Carefully fold one edge of the circle over the cheese to the other edge, and press the edges together to close the empanada. Using a small bowl, place it over the empanada close to the edge and press down slightly to cut the edge and evenly seal it. Repeat with the remaining dough and cheese. Set the empanadas on a large platter and refrigerate for 30 minutes.",
    "In a large heavy-bottomed saucepan, add enough vegetable oil to fill the pan about a third of the way. Heat over medium heat until a deep-frying thermometer inserted in the oil reaches 350 degrees F. Gently remove the wax paper from each empanada and fry two to four at a time (depending on the pan size) until golden brown, about 5 minutes. Serve immediately.",
    "This recipe was provided by a chef, restaurant or culinary professional and may have been scaled down from a bulk recipe. The Food Network Kitchens have not tested it for home use and therefore cannot make any representation as to the results.",
    "Recipe courtesy Pica Pica, LLC"
  ],
  "ingredients": [
    "0",
    "1 tablespoon vegetable shortening",
    "1/2 tablespoon salt",
    "1 cup precooked corn flour, such as Harina P.A.N. or Maseca",
    "2 cups shredded mozzarella or any cheese that melts",
    "Vegetable oil, for frying"
  ],
  "__v": 1
}