{
  "__v": 1,
  "directions": [
    "0",
    "1 Heat the vegetable oil in a large soup pot set over medium-high heat. Salt the chicken pieces well, pat them dry and brown them in the oil. Don't crowd the pot, so do this in batches. Set the chicken pieces aside as they brown.",
    "2 Sauté the onions in the oil for 3-4 minutes, stirring often and scraping any browned bits off the bottom of the pot. Add the ginger and garlic and sauté another 1-2 minutes, then add the sweet potatoes and stir well to combine.",
    "3 Add the chicken, chicken broth, crushed tomatoes, peanut butter, peanuts, coriander and cayenne and stir well to combine. Bring to a simmer and taste for salt, adding more if needed. Cover the pot and simmer gently for 90 minutes (check after an hour), or until the chicken meat easily falls off the bone and the sweet potatoes are tender.",
    "4 Remove the chicken pieces and set them in a bowl to cool, until cool enough to touch. Remove and discard the skin if you want, or chop it and put it back into the pot. Shred the meat off the bones and put the meat back in the pot.",
    "5 Adjust the seasonings for salt and cayenne, then add as much black pepper as you think you can stand—the stew should be peppery. Stir in the cilantro and serve by itself, or with simple steamed rice."
  ],
  "firstAdded": "2014-08-16T22:41:54.251000",
  "hash": "979d41740c12130777ebaa06ce9a95c86278796f",
  "href": "http://www.simplyrecipes.com/recipes/african_chicken_peanut_stew/",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2010/12/african-chicken-peanut-stew-a.jpg",
  "ingredients": [
    "0",
    "2-3 pounds chicken legs, thighs and/or wings",
    "3 Tbsp vegetable oil",
    "1 large yellow or white onion, sliced",
    "A 3-inch piece of ginger, peeled and minced",
    "6-8 garlic cloves, chopped roughly",
    "2-3 pounds sweet potatoes, peeled and cut into chunks",
    "1 15-ounce can of crushed tomatoes",
    "1 quart chicken stock",
    "1 cup peanut butter",
    "1 cup roasted peanuts",
    "1 Tbsp ground coriander",
    "1 teaspoon cayenne, or to taste",
    "Salt and black pepper",
    "1/4 to 1/2 cup of chopped cilantro"
  ],
  "keywords": [
    "chicken",
    "legs",
    "thighs",
    "andor",
    "wings",
    "oil",
    "yellow",
    "white",
    "onion",
    "ginger",
    "garlic",
    "roughly",
    "potatoes",
    "chunks",
    "tomatoes",
    "stock",
    "peanut",
    "butter",
    "roasted",
    "peanuts",
    "coriander",
    "cayenne",
    "salt",
    "black",
    "pepper",
    "cilantro"
  ],
  "title": "African Chicken Peanut Stew\n90",
  "users": [
    null
  ]
}