{
  "hash": "2f042d1c66eef7d2cbf55d134f9d814e203b1f34",
  "title": "From Scratch Cheddar Cheese Biscuits",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/from-scratch-cheddar-cheese-biscuits.html",
  "firstAdded": "2015-01-24T19:47:50.323000",
  "users": [
    null
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "dusting",
    "dry",
    "milk",
    "cream",
    "cheese",
    "cold",
    "unsalted",
    "chilled",
    "butter",
    "sugar",
    "baking",
    "salt",
    "buttermilk",
    "cheddar",
    "jam"
  ],
  "directions": [
    "0",
    "Preheat the oven to 350 degrees F. Line 2 baking sheets with parchment paper. Add the flour, powdered milk, cream cheese, butter, sugar, baking powder and salt to a stand mixer fitted with a paddle attachment and mix on low speed until the flour resembles coarse cornmeal. With the mixer running, slowly add the buttermilk and mix until a dough forms. Increase the speed to medium and mix until the dough starts to stick to the sides of the mixing bowl. Stop the mixer.",
    "Add the Cheddar and mix on low speed until incorporated, about 10 seconds. (You don't want to break up the cheese.)",
    "Place the dough on a floured rolling surface and knead it 25 times, until the dough is soft and doesn't stick to your hands or the board. Roll out the dough to 3/4-inch thickness and cut out 36 biscuits with a biscuit cutter, transferring the biscuits to the prepared baking sheets.",
    "Bake the biscuits, rotating the baking sheets halfway through, until golden brown, about 30 minutes. Serve with butter and jam.",
    "Professional Recipe: This recipe was provided by a chef, restaurant or culinary professional and makes a large quantity. The Food Network Kitchens chefs have not tested this recipe in the proportions indicated and therefore cannot make any representation as to the results.",
    "Recipe courtesy of From Scratch Restaurant"
  ],
  "ingredients": [
    "0",
    "7 cups all-purpose flour, plus more for dusting",
    "2 cups dry powdered milk",
    "1 pound cream cheese, cold",
    "1/2 cup (1 stick) unsalted butter, melted, plus chilled butter for serving",
    "1/2 cup sugar",
    "3 tablespoons baking powder",
    "2 tablespoons table salt",
    "3 1/2 cups buttermilk",
    "3 cups shredded Cheddar",
    "Jam, for serving"
  ],
  "__v": 1
}