{
  "hash": "7c9cbc0adb51ddff4f0ea6278cbcf5e51e6cbc14",
  "title": "5 Ingredient Funfetti Shortbread Bites",
  "image": "http://www.cookingclassy.com/wp-content/uploads/2016/08/funfetti_shortbread_bites3..jpg",
  "href": "http://www.cookingclassy.com/2016/08/5-ingredient-funfetti-shortbread-bites/",
  "extension": "Chrome",
  "firstAdded": "2016-08-22T11:33:22.364000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Butter a 13 by 9-inch baking dish and line with 2 sheets of parchment paper (one horizontally and one vertically. I also like to butter between parchment sheets so they stick) leaving a 1-inch over hang on all sides, set aside.",
    "In the bowl of an electric stand mixer cream together butter and sugar until well combined (not light and fluffy, just well blended). Mix in almond extract. With mixer set on low speed slowly add in flour and mix until combined (it will take a while and will appear dry and sandy at first but it will start to come together). Mix in 2 1/2 Tbsp of the sprinkles. Press dough into an even layer in prepared baking dish (I did it with my hands first then used the bottom of a flat measuring cup to help smooth it out). Sprinkle remaining 1 Tbsp sprinkles over top and lightly press into dough. Chill dough in refrigerator 30 minutes. Preheat oven to 350 degrees about halfway through chilling.",
    "Lift dough from pan using parchment overhang on all sides. Cut into 1/2-inch squares using a large sharp knife (it works best to just cut long rows. Run large knife underneath cookies to help remove them from parchment as needed). Transfer about 1/3 of the cookies to an unbuttered baking sheet (also do not line pan with parchment or silicone liners) and scatter cookies out spacing cookies 1/2-inch apart. Bake in preheated oven 8 - 12 minutes (keep remaining that aren't currently baking refrigerated). Repeat process with remaining bites, adding them to a cool baking sheet. Cool completely then transfer to an airtight container and store at room temperature.",
    "*Unsalted butter will work great too. Simply whisk in 1/2 tsp salt with the flour before adding if using unsalted butter.",
    "Recipe source: inspired by Land O Lakes"
  ],
  "ingredients": [
    "0",
    "1 cup (226g) salted butter, cold and diced into 1 Tbsp pieces*",
    "3/4 cup (155g) granulated sugar",
    "3/4 tsp almond extract",
    "2 1/4 cups (318g) all-purpose flour",
    "3 1/2 Tbsp (42g) nonpareils sprinkles, divided"
  ],
  "__v": 1
}