{
  "__v": 1,
  "directions": [
    "0",
    "Method",
    "1. Heat a griddle pan until quite hot. Slice the courgettes on the diagonal into thin slices, no more than half a centimetre thick. Oil the slices, place on the griddle in a single layer and cook, undisturbed, for three minutes, or until the base has well-charred lines. Turn and repeat on the other side. Repeat with the remaining courgettes. Transfer to a plate as you cook each batch.",
    "2. As you stand over the griddle, stir together the chickpeas, lemon juice, roasted cumin, tomato and red onion and season to taste.",
    "3. Blend together all the ingredients for the dressing with two tablespoons of water until smooth; I use a good stick blender, but a mortar and pestle will also work. Adjust the seasoning and vinegar to taste and keep aside.",
    "4. To assemble, place the courgettes on plates or a platter, slightly overlapping at the edges. Drizzle with the dressing. Mix the coriander into the chickpeas, scatter them over with the feta cheese and serve."
  ],
  "firstAdded": "2014-06-26T10:53:05.170000",
  "hash": "0eb7ccecab58c24b5f268dbf1aad7e0121daf4f3",
  "href": "http://www.redonline.co.uk/food/recipes/courgette-carpaccio-with-chickpea-salsa",
  "image": "http://assets.redonline.co.uk/var/ezflow_site/storage/images/media/banners/article-banners/food/recipe-pics/griddled-courgette-carpaccio-anjum-s-indian-vegetarian-feast-anjum-annand-emma-lee/5559273-1-eng-GB/griddled-courgette-carpaccio-anjum-s-indian-vegetarian-feast-anjum-annand-emma-lee_article_banner_img.jpg",
  "ingredients": [
    "0",
    "Serves: 4 as a side dish, or 2 as a light lunch",
    "Preparation time: 20 minutes",
    "Cooking time: 5 minutes",
    "You will need",
    "For the salad:",
    "4 large courgettes (a mix of green and yellow, if possible) Olive oil, to brush 400g can chickpeas, drained well and rinsed 1½ tbsp lemon juice, or to taste 1 scant tbsp roasted ground cumin 1 small tomato, finely chopped 1/3-1/2 small red onion, finely chopped Salt, to taste 30g coriander (leaves and roots), chopped 75–100g feta cheese For the pistachio dressing:",
    "3/4–1 tbsp red or white wine vinegar, or to taste 1 small garlic clove, peeled 15g pistachios (roasted is fine) 2½ tbsp extra virgin olive oil ¼ tsp coarsely ground black pepper, or to taste ¼ tsp caster sugar"
  ],
  "keywords": [
    "serves",
    "dish",
    "light",
    "lunch",
    "preparation",
    "time",
    "minutes",
    "cooking",
    "need",
    "salad",
    "courgettes",
    "green",
    "yellow",
    "possible",
    "olive",
    "oil",
    "brush",
    "chickpeas",
    "rinsed",
    "lemon",
    "juice",
    "scant",
    "roasted",
    "cumin",
    "tomato",
    "red",
    "onion",
    "salt",
    "coriander",
    "leaves",
    "roots",
    "feta",
    "cheese",
    "pistachio",
    "dressing",
    "white",
    "wine",
    "vinegar",
    "garlic",
    "clove",
    "pistachios",
    "extra",
    "virgin",
    "coarsely",
    "black",
    "pepper",
    "caster",
    "sugar"
  ],
  "title": "Griddled courgette carpaccio, chickpea salsa and pistachio dressing",
  "users": [
    null
  ]
}