{
  "hash": "71fb20780f8d24b262b27f477d8638f0f38c3b9b",
  "title": "Savoy Cabbage & Zucchini Okonomiyaki (Japanese Pancake) Recipe",
  "image": "https://yummybeet.com/wp-content/uploads/2018/05/Okonomiyaki-recipe-with-savoy-cabbage-and-zucchini-683x1024.jpg",
  "href": "https://yummybeet.com/savoy-cabbage-zucchini-okonomiyaki-japanese-pancake/",
  "extension": "Firefox",
  "firstAdded": "2018-10-05T22:11:13.905000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large mixing bowl, stir very well to combine cabbage, zucchini, white parts of green onions, water or broth, 1 tablespoons tamari or soy sauce, vegetable bouillon (if using water), and flour.",
    "Heat oil over high heat in a large non-stick or cast-iron skillet. Add cabbage mixture and pack down pretty firmly. Cover, reduce heat to medium-low, and cook for 10 minutes, until the bottom is a deep golden brown. Protecting your hands from the heat with dry kitchen towels or oven mitts with a good grip, place a large cutting board or plate over skillet and invert pancake, then slide it back into the pan (now brown side up), cover, and cook for a further 10 to 12 minutes, until pancake is completely cooked through and tender, and light brown on the second side. Slide onto a large plate, serving platter, or cutting board. Set aside to cool for at least 10 minutes. Meanwhile, prepare the condiments.",
    "In a small bowl, mix mayonnaise and sriracha until combined. In a second small bowl, mix ketchup, remaining 1 teaspoon tamari or soy sauce, and Worcestershire until combined.",
    "To assemble, dress by drizzling mayonnaise mixture and ketchup mixture over the okonomiyaki, sprinkle with green parts of green onion and sesame seeds, slice into wedges, and warm, room temperature, or chilled."
  ],
  "ingredients": [
    "0",
    "450 g (4 cups shredded) savoy cabbage, cored and finely shredded",
    "1 (220 g, 2 cups grated) medium zucchini, grated",
    "2 green onions, white and green parts, thinly sliced, divided",
    "1/2 cup water or vegetable broth",
    "1 Tbsp plus 1 tsp tamari or soy sauce, divided",
    "2 tsp vegetable bouillon powder (skip if using vegetable broth)",
    "2/3 cup organic unbleached all-purpose flour or gluten-free all-purpose flour",
    "1 Tbsp coconut oil or sesame oil",
    "3 Tbsp mayonnaise",
    "2 to 3 tsp sriracha, to taste",
    "2 Tbsp ketchup",
    "1 tsp Worcestershire sauce, gluten-free and vegan if necessary",
    "2 tsp sesame seeds"
  ],
  "__v": 1
}