{
  "hash": "4c3df765237e2bacf99d2c5c5d89dbff4bd6517b",
  "title": "Slow Cooked Sticky Asian Lamb",
  "image": "http://emsfoodforfriends.com.au/version2/wp-content/uploads/2013/08/IMG_3267-e1423622744380.jpg",
  "href": "http://emsfoodforfriends.com.au/slow-cooked-sticky-asian-lamb/",
  "extension": "Firefox",
  "firstAdded": "2016-01-06T02:36:38.048000",
  "users": [
    null
  ],
  "keywords": [
    "need",
    "leg",
    "lamb",
    "bone",
    "tbs",
    "peanut",
    "oil",
    "kecap",
    "manis",
    "indonesian",
    "soy",
    "sesame",
    "rice",
    "wine",
    "vinegar",
    "brown",
    "sugar",
    "star",
    "anise",
    "stalks",
    "lemon",
    "grass",
    "bruised",
    "ginger",
    "roughly",
    "garlic",
    "red",
    "chilli",
    "green",
    "onions",
    "diagonally",
    "seeds",
    "pack",
    "flat",
    "noodles",
    "steamed",
    "asian",
    "greens",
    "serve"
  ],
  "directions": [
    "0",
    "Heat a large, heavy based pan until quite hot, add the peanut oil and sear the leg of lamb as best you can on all sides. Pop the lamb into the slow cooker. You could do this dish in the oven if you wish but you will need a good casserole dish with a lid.",
    "In a bowl whisk together the kecap manis, rice wine vinegar, brown sugar and sesame oil. Pour over the lamb and add the garlic, ginger, chilli, lemongrass and star anise. Give everything a good stir, pop the lid on, turn the cooker on to high and don’t even think about it for at least two hours. Lift the lid, turn the lamb over and baste with the sauce whenever you think of it but don’t be too precious.",
    "After about 6 hours, remove the lamb from the cooker and cover with foil to keep warm. Strain the liquid from the cooker into a small saucepan and bring to a simmer. Reduce the liquid for about 20-25 minutes or until it has reduced by half. It won’t be too sticky but it will thicken slightly on cooling. You don’t want it too sticky as it is nice to have the liquid soak into the noodles. If there is a lot of fat in the liquid, place the strained liquid in a jug and pop it in the freezer for 30 minutes. No word of a lie, the fat will solidify and lift out really easily.",
    "Cook the noodles according to packet instructions. Drain the noodles and toss with a teaspoon of sesame oil (to prevent sticking) and pop them on a large platter. With a couple of forks, gently pull the lamb apart and arrange over the noodles. Discard the bones but make sure you have a secret little gnaw. Scatter over the sliced green onions and drizzle over the syrupy sauce. Finally scatter over the toasted sesame seeds and serve in the middle of the table with a platter of steamed greens."
  ],
  "ingredients": [
    "0",
    "You will need:",
    "2kg leg of lamb, on the bone",
    "1tbs of peanut oil",
    "1/2 a cup of kecap manis (indonesian sweet soy)",
    "1 tsp sesame oil",
    "1/4 cup of rice wine vinegar",
    "1/4 cup of brown sugar",
    "3 star anise",
    "2 stalks fresh lemon grass, beaten and bruised",
    "8 cm piece of ginger, roughly chopped",
    "4 cloves of garlic, roughly chopped",
    "1 large red chilli, roughly chopped",
    "6 green onions, sliced diagonally",
    "1 tbs of toasted sesame seeds",
    "250gm pack of flat rice stick noodles",
    "1 tsp sesame oil (for the noodles)",
    "Steamed Asian greens to serve"
  ],
  "__v": 1
}