{
  "hash": "c955dc96be2b9a3801e487ac0f23e2fda3c1a347",
  "title": "Coconut Flour Tortillas",
  "image": "http://askgeorgie.com/wp-content/uploads/2012/09/004-9.jpg",
  "href": "http://askgeorgie.com/coconut-flour-tortillas-grain-free-gfcf-paleo-gluten-free-younameit/",
  "extension": "Chrome",
  "firstAdded": "2016-01-12T15:21:16.869000",
  "users": [
    null
  ],
  "keywords": [
    "egg",
    "whites",
    "almond",
    "milk",
    "coconut",
    "flour",
    "cumin",
    "garlic",
    "salt",
    "cayenne",
    "pepper"
  ],
  "directions": [
    "0",
    "Method",
    "1. In a blender pitcher, combine all ingredients. Process for 10-20 seconds to break up any lumps in the coconut flour. Let is sit for 10 minutes so the coconut flour hydrates.",
    "2. Heat a nonstick skillet over medium heat and oil the bottom lightly if the nonstick coating isn’t great. When hot, pick up the pan and pour 1/4 cup of the batter into the center of the pan, giving the pan a tilt-rotate-jiggle action to spread the batter into a thin pancake about 8 inches or so across.",
    "3. Put the pan back on the burner and let it cook until the top of the tortilla doesn’t look shiny anymore, and is not sticky to the touch. If it feels solid enough to flip, its time to flip. If it needs another minute, give it another minute. Timing isn’t crucial.",
    "4. Use a big, wide pancake turner to flip it onto the other side. Another minute of cooking, and your tortilla is done. I recommend removing it to a paper towel-lined plate to free up the skillet for the next tortilla. Stacking the cooked tortillas on a bare plate works too, but gets some condensation moisture on the bottom to they end up a bit wet.",
    "MakesThe last tortilla might be smaller than the others if you have less than 2 oz of batter remaining at the end."
  ],
  "ingredients": [
    "0",
    "1 cup egg whites",
    "1/4 cup unsweetened almond milk",
    "1/4 cup coconut flour",
    "1/2 tsp each: cumin and garlic",
    "1/4 tsp each: salt and cayenne pepper"
  ],
  "__v": 1
}