{
  "hash": "7df1484d92d1fad5a9f2aadac8c2242ac0d9ac24",
  "title": "Broccoli-Stuffed Portabello Mushrooms with Dijon-Cheddar Sauce",
  "image": "http://ericasrecipes.com/wp-content/uploads/2014/07/Broccoli-Stuffed-Portabello-Mushrooms-2aW-1024x736.jpg",
  "href": "http://ericasrecipes.com/2014/07/broccoli-stuffed-portabello-mushrooms-dijon-cheddar-sauce/",
  "extension": "Chrome",
  "firstAdded": "2015-09-14T18:27:08.639000",
  "users": [
    null
  ],
  "keywords": [
    "portabello",
    "mushroom",
    "caps",
    "cooking",
    "spray",
    "olive",
    "oil",
    "mister",
    "broccoli",
    "florets",
    "crumbs",
    "dayold",
    "bread",
    "italian",
    "parsley",
    "thyme",
    "leaves",
    "egg",
    "lightly",
    "kosher",
    "salt",
    "divided",
    "cracked",
    "pepper",
    "unsalted",
    "butter",
    "allpurpose",
    "flour",
    "milk",
    "skim",
    "sharp",
    "cheddar",
    "cheese",
    "countrystyle",
    "dijon",
    "mustard"
  ],
  "directions": [
    "0",
    "Heat oven to 400F. Bring a large pot of water to a boil.",
    "Prepare the mushrooms: wipe off any dirt with a lightly damp paper towel. Remove the stems and discard (these can be saved, diced, and added to the stuffing, but mine were tough so I didn't save them). Using a spoon, gently scrape off the gills on the underside of the mushroom caps. Spray both sides with olive oil and place upside down on a bake sheet.",
    "Blanch the broccoli in the boiling water 2 minutes. Transfer to a ice bath to stop the cooking. Drain. Chop finely (this can be accomplished easily with a mini chopper or by pulsing in a food processor).",
    "In a large bowl, combine the chopped broccoli, bread crumbs, parsley, thyme, egg, 1/2 t salt, and pepper. Distribute the stuffing into the mushrooms. Bake at 400F for 15 minutes or until mushrooms are cooked through and juicy and the stuffing is lightly browned.",
    "While the mushrooms are cooking, prepare the cheese sauce. In a medium saucepan over medium-high heat, whisk the butter and flour until smooth and bubbly. Cook an additional minute to cook the flour. Whisking constantly, slowly add in the milk. Cook, stirring constantly, until thickened enough to coat the back of a wooden spoon. Remove from the heat and whisk in the cheese, Dijon, and 1/4 t salt until smooth.",
    "Serve the stuffed mushrooms with sauce drizzled over. Yield: 3 servings as a main course; 6 as a side."
  ],
  "ingredients": [
    "0",
    "6 large portabello mushroom caps",
    "olive oil cooking spray or olive oil in a mister",
    "10 oz fresh broccoli florets",
    "1 c fresh bread crumbs made from day-old bread",
    "2 T fresh Italian parsley, chopped",
    "1 T fresh thyme leaves, chopped",
    "1 egg, lightly beaten",
    "1/2 + 1/4 t kosher salt, divided",
    "pinch fresh cracked pepper",
    "2 t unsalted butter",
    "2 t all-purpose flour",
    "1 c milk (not skim)",
    "1 c shredded sharp cheddar cheese",
    "1 t country-style Dijon mustard"
  ],
  "__v": 1
}