{
  "hash": "f1e6c5992441789bcbd7af46d4a8979565476ad5",
  "title": "Flu Fighter Garlic Soup",
  "image": "",
  "href": "http://recipe-folder.com/recipe/5e752c09138ae0082650dbd9",
  "extension": "User Added",
  "firstAdded": "2020-03-20T20:48:09.527000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium-sized pan heat oil and sauteed the onions, turmeric powder, red chili flakes and garlic. Add a little salt, so that the onions will cook faster.",
    "1",
    "Now add the carrots, mushrooms and coriander and fry for a couple of minutes.",
    "2",
    "Stir in the rinsed quinoa and vegetable broth/water. Add some more salt and pepper and cook for about 15-20 minutes until the quinoa is cooked. If you feel that the quinoa has absorbed a lot of water making a stew like consistency add some more broth/water. Switch off the stove.",
    "3",
    "Stir in the chopped kale and minced garlic if using. The heat will wilt the greens.",
    "4",
    "MY NOTES:",
    "5",
    "Lentils can be used instead of quinoa and in that case the cooking time would be about 35-40 minutes. Using a pressure cooker would reduce the cooking time.",
    "6",
    "I used no-salt added homemade vegetable broth. So used about 1.25 teaspoons of salt to the soup and that’s what is reflected in the sodium content in the chart below. If you use store-bought vegetable broth the sodium content will vary."
  ],
  "ingredients": [
    "0",
    "•\t3 tablespoons extra-virgin olive oil",
    "1",
    "•\t1 big onion, chopped",
    "2",
    "•\t5 cloves garlic, minced",
    "3",
    "•\t1 big carrot, finely chopped",
    "4",
    "•\t5 mushroom caps, finely chopped",
    "5",
    "•\t1/4 cup coriander, finely chopped (I just use cilantro…)",
    "6",
    "•\t1/2 cup quinoa, rinsed (you can use egg noodles here instead!)",
    "7",
    "•\t1/8 teaspoon turmeric powder",
    "8",
    "•\t6 cups water or vegetable broth",
    "9",
    "•\tsalt, pepper and crushed red chili flakes to taste",
    "10",
    "OPTIONAL INGREDIENTS:",
    "11",
    "• 1 cup kale, finely chopped (any greens you want, really! Bok Choy is awesome in this.)",
    "12",
    "• 3 cloves garlic, minced (more garlic, yes please!)",
    "13",
    "SUBSTITUTIONS",
    "14",
    "quinoa – lentils",
    "15",
    "kale – spinach, swiss chard"
  ],
  "__v": 1,
  "hidden": true
}