{
  "__v": 1,
  "directions": [
    "0",
    "In a Dutch oven, pot, or deep sauté pan, combine the chicken with the vinegar, water, fish sauce, garlic and bay leaf. (The liquid should almost cover the chicken. If not, add a bit more water.) Bring the liquid to a boil, then reduce to a simmer. Allow the chicken to simmer, uncovered, for 25 to 30 minutes, until tender but not falling off the bone.",
    "With a slotted spoon, remove the chicken from the braising liquid and transfer to a plate. Blot very well with paper towels. Turn the heat up and reduce until the sauce is thick enough to coat the back of a spoon (about 10 minutes more). Stir in the coconut milk, paprika, cayenne, and pepper.",
    "Heat a wok or large skillet over high heat. Add the oil and swirl to coat the base. Add the chicken pieces and sear until golden brown and crispy, about 2 minutes on each side (carefully, if there is excess moisture from the chicken that may make the oil spit.) Return the chicken to the sauce to turn so they are coated all around. Transfer the chicken and sauce to a large serving platter or individual plates. Serve hot with a generous amount of rice on the side."
  ],
  "firstAdded": "2014-08-17T15:46:47.835000",
  "hash": "01ebbb554e0dc50ffaa559df5fdd5e17025a4a0b",
  "href": "http://appetiteforchina.com/recipes/filipino-coconut-chicken-adobo/",
  "image": "http://static.squarespace.com/static/51f7fb1ee4b03d20c9b4c34b/5205419ee4b07cd5f413d79b/520541a3e4b07cd5f413d9a7/1376077968292/coconut-chicken-adobo-1.jpg?format=750w",
  "ingredients": [
    "0",
    "2 1/2 pounds (about 8 pieces) bone-in chicken thighs with skin",
    "1/2 cup white vinegar",
    "2 cups water",
    "2 tablespoons fish sauce, or substitute soy sauce",
    "3 cloves garlic",
    "1 bay leaf",
    "3/4 cup thick coconut milk",
    "1/2 teaspoon ground paprika",
    "1/2 teaspoon ground cayenne pepper",
    "1/4 teaspoon freshly ground black pepper",
    "2 tablespoons peanut or vegetable oil."
  ],
  "keywords": [
    "pieces",
    "bonein",
    "chicken",
    "thighs",
    "skin",
    "white",
    "vinegar",
    "water",
    "fish",
    "soy",
    "garlic",
    "bay",
    "leaf",
    "coconut",
    "milk",
    "paprika",
    "cayenne",
    "pepper",
    "black",
    "peanut",
    "oil"
  ],
  "title": "Coconut Chicken Adobo",
  "users": [
    null
  ]
}