{
  "hash": "c96c9fc6e82f3aa86abefc2db8ada089a88af686",
  "title": "Pork Souvlaki (Skewers) with Tzatziki Sauce",
  "image": "http://www.mygreekdish.com/wp-content/uploads/2013/11/Pork-Souvlaki-Skewers-with-Pita-bread-and-Tzatziki-Sauce-800x558.jpg",
  "href": "http://www.mygreekdish.com/recipe/pork-souvlaki-skewers-with-tzatziki/",
  "extension": "Chrome",
  "firstAdded": "2015-12-15T14:10:15.992000",
  "users": [
    null
  ],
  "keywords": [
    "pork",
    "souvlaki",
    "leg",
    "chunks",
    "goodquality",
    "olive",
    "oil",
    "juice",
    "lemon",
    "tsps",
    "mustard",
    "oregano",
    "salt",
    "pepper",
    "wooden",
    "skewers",
    "tzatziki",
    "cucumber",
    "garlic",
    "yogurt",
    "tbsps",
    "red",
    "wine",
    "vinegar",
    "dill",
    "serve",
    "pita",
    "breads",
    "onions",
    "tomato"
  ],
  "directions": [
    "0",
    "Instructions",
    "To prepare the pork souvlaki (skewers), cut the pork into 2 cm pieces and place them in a large bowl, along with all the marinade ingredients. Use your hands to mix really well, cover with plastic wrap and put in the fridge for 20 minutes.",
    "In the meantime prepare the tzatziki sauce for the pork souvlaki. Pour into a food processor the olive oil and 2 cloves of garlic; blend until the garlic is diluted (don’t leave any large pieces of garlic). Into a large bowl, grate the cucumber, season with salt and pepper and leave it aside for 10 minutes. Wrap the grated cucumber into a towel and squeeze, in order to get rid of most of the water. Into a bowl, add the cucumber, the blended garlic and oil, the yogurt, 1-2 tbsps of chopped dill, 1-2 of red wine vinegar, salt and pepper and mix. Tore in the fridge and serve cold.",
    "Cut the wooden skewers to fit your griddle pan and soak them in water for 10 minutes. (This will prevent them from burning.) Thread the pieces of pork, comfortably, on the skewers.",
    "Preheat a grill or griddle pan on a high heat. Cook the pork skewers for about 8 to 10 minutes, turning occasionally, until nicely coloured and cooked through.",
    "While your pork is cooking, prepare the pita breads. Preheat the oven to 250C. Use a cooking brush to oil the pita breads on both sides and season with salt and oregano. Place a large oven tray (upside down) at the bottom of the oven and place the pita breads on top of the tray. Bake for 1-2 minutes.",
    "To serve the pork souvlaki (skewers), slice 2 red onions and place on a platter; top with the pork skewers, drizzle with some extra virgin olive oil and a good squeeze of lemon juice. Serve while still warm with some pita breads and tzatziki sauce or wrap them up like a sandwich, adding some tzatziki, sliced onions and tomatoes. Enjoy!"
  ],
  "ingredients": [
    "0",
    "For the pork souvlaki",
    "800g leg of pork, cut in 2cm chunks (28 ounces)",
    "100ml good-quality olive oil (1/3 of a cup and 1 tbsp)",
    "juice of 1/2 lemon",
    "2 tsps mustard",
    "1 tsp dried oregano",
    "a pinch of salt and freshly ground pepper",
    "8 wooden skewers",
    "For the tzatziki sauce",
    "1 cucumber",
    "2 cloves of garlic",
    "1/4 of a cup olive oil",
    "500g of yogurt (18 ounces)",
    "1-2 tbsps of red wine vinegar",
    "1-2 tbsps chopped dill (optional)",
    "salt and freshly ground pepper to taste",
    "To serve",
    "8 pita breads",
    "2 red onions, sliced",
    "1 tomato sliced"
  ],
  "__v": 1
}