{
  "hash": "b8dbe8c1340f399cc623dd8446b81fd55cb0932f",
  "title": "Pressure Cooker Pork Chops and Cabbage - one pot meal",
  "image": "",
  "href": "http://www.hippressurecooking.com/20-minute-pressure-cooker-pork-chops-and-cabbage/",
  "firstAdded": "2015-01-20T02:54:11.512000",
  "users": [
    null
  ],
  "keywords": [
    "thickcut",
    "pork",
    "chops",
    "fennel",
    "seeds",
    "salt",
    "pepper",
    "head",
    "cabbage",
    "oil",
    "meat",
    "stock",
    "flour"
  ],
  "directions": [
    "0",
    "Unwrap the pork chops and sprinkle with fennel, salt and pepper.",
    "Prepare the cabbage by slicing the cabbage in half almost through the core, and then in thick ¾ inch slices and set aside.",
    "In the pre-heated pressure cooker,on medium-high heat without the lid, add oil, and brown all of the chops on one side only - only two at a time may fit depending on the size of the pressure cooker base, or the chops.",
    "When all of the chops have been browned and set aside, add the cabbage slices into the empty pressure cooker.",
    "On top of the cabbage arrange the pork chops brown-side up, overlapping as needed. Pour any juice from the chops and meat stock around the edges.",
    "Close and lock the lid of the pressure cooker. Turn the heat up to high and when the cooker reaches pressure, lower to the heat to the minimum required by the cooker to maintain pressure. Cook for 6-8 minutes at high pressure.",
    "When time is up, open the cooker by slowly releasing the pressure using the Normal release.",
    "Using tongs, move the cabbage and pork chops to a serving platter and tent lightly with foil while preparing the gravy.",
    "Bring the left-over juices in the pressure cooker to a boil and whisk-in the flour.",
    "Pour thickened sauce on top of cabbage and pork chop platter and serve."
  ],
  "ingredients": [
    "0",
    "4 thick-cut Pork Chops (about ¾\" or 2 cm)",
    "1 teaspoon fennel seeds",
    "1 teaspoon salt",
    "1 teaspoon pepper",
    "1 small head of cabbage (about a pound or 500g)",
    "1 tablespoon vegetable oil",
    "¾ cup meat stock",
    "2 teaspoons, flour"
  ],
  "__v": 1
}