{
  "hash": "e602d4b65c03da2cf37218daa426008bebffbd42",
  "title": "Chicken Kiev\nPURE INDULGENT PLEASURE",
  "image": "https://jamieoliverprod.s3.amazonaws.com/recipe-database/oldImages/recipe_single/1306_1_1436535910.jpg",
  "href": "http://www.jamieoliver.com/recipes/chicken-recipes/chicken-kiev/",
  "extension": "Chrome",
  "firstAdded": "2015-12-09T16:25:38.925000",
  "users": [
    null
  ],
  "keywords": [
    "rashers",
    "smoked",
    "streaky",
    "bacon",
    "olive",
    "oil",
    "skinless",
    "chicken",
    "breasts",
    "butcher",
    "bone",
    "way",
    "plain",
    "flour",
    "freerange",
    "eggs",
    "breadcrumbs",
    "sunflower",
    "baby",
    "spinach",
    "rocket",
    "lemons",
    "butter",
    "garlic",
    "bunch",
    "flatleaf",
    "parsley",
    "knobs",
    "unsalted",
    "room",
    "cayenne",
    "pepper",
    "broccoli",
    "mash",
    "maris",
    "piper",
    "potatoes",
    "head",
    "knob"
  ],
  "directions": [
    "0",
    "Method",
    "Making a really great expression of a chicken Kiev will put smiles on people’s faces. Good-quality chicken stuffed with gorgeous garlicky butter and crispy crumbled bacon, then coated with golden breadcrumbs – you know it’s going to be good. This is pure indulgent pleasure, so simply make sure you balance up your meals in the days that follow.",
    "Fry the bacon in a pan on a medium heat with a tiny drizzle of olive oil, until golden and crisp, then remove. For the butter, peel the garlic, then finely chop with the parsley leaves and mix into the softened butter with the cayenne. Firm up in the fridge.",
    "Working one-by-one on a board, stuff the chicken breasts. To do this, start by pulling back the loose fillet on the back of the breast – put your knife in the opposite direction and slice to create a long pocket (watch how-to video below). Open the pocket up with your fingers, cut the chilled butter into four and push one piece into the pocket, then crumble in a rasher of crispy bacon. Fold and seal back the chicken, completely covering the butter and giving you a nice neat parcel. Repeat with the 3 remaining breasts.",
    "Preheat the oven to 180°C/350°F/gas 4. Place the flour in one shallow bowl, whisk the eggs in another, and put the breadcrumbs and a pinch of seasoning into a third. Evenly coat each chicken breast in flour, then beaten egg, letting any excess drip off, and finally, turn them in the breadcrumbs, patting them on until evenly coated. Shallow-fry in 2cm of sunflower oil on a medium to high heat for a couple of minutes on each side, or until lightly golden, then transfer to a tray and bake in the oven for 10 minutes, or until cooked through. You can bake them completely in the oven and skip the frying altogether, you just need to drizzle them with olive oil and bake for about 20 minutes – they won’t be as golden, but they’ll be just as delicious.",
    "Meanwhile, peel and roughly chop the potatoes and cook in a large pan of boiling salted water for 12 to 15 minutes, or until tender. Chop up the broccoli and add it to the potatoes for the last 8 minutes. Drain and leave to steam dry, then return to the pan and mash with a knob of butter and a pinch of salt and pepper. Divide the mash between your plates and place a Kiev on top of each portion. Lightly dress the spinach leaves or rocket in a little oil and lemon juice, then sprinkle over the top as a salady garnish. Serve with a wedge of lemon on the side.",
    "Comments"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "4\trashers of\tsmoked streaky bacon",
    "olive oil",
    "4 x 150\tg\tskinless chicken breasts\t, (I got mine from the butcher with the bone in, but either way is fine)",
    "3\ttablespoons\tplain flour",
    "2\tlarge\tfree-range eggs",
    "150\tg\tfresh breadcrumbs",
    "sunflower oil",
    "2\tlarge handfuls of baby spinach , or rocket",
    "2\tlemons",
    "FOR THE BUTTER:",
    "4\tcloves of\tgarlic",
    "½\ta bunch of\tfresh flat-leaf parsley (15g)",
    "4\tknobs of unsalted butter\t, (at room temperature)",
    "1\tpinch of\tcayenne pepper",
    "FOR THE BROCCOLI MASH:",
    "800\tg\tMaris Piper potatoes",
    "1\thead of\tbroccoli",
    "1\tknob of\tunsalted butter"
  ],
  "__v": 1
}