{
  "hash": "8154612e12abc1616c4352dcd9bdf85fcbd5d97a",
  "title": "Espresso Fudge Brownies with Mocha Swirl Cookie Dough",
  "image": "https://i2.wp.com/cafedelites.com/wp-content/uploads/2015/05/Mocha-Cookie-Dough-Brownies-12.jpg?resize=600%2C900",
  "href": "https://cafedelites.com/2015/05/24/espresso-fudge-brownies-with-mocha-swirl-cookie-dough/?w3tc_note=flush_all",
  "extension": "",
  "firstAdded": "2017-07-14T20:28:55.464000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Brownies:",
    "Preheat oven to 160C | 325F. Line a 8x8-inch baking pan with parchment/baking paper, pressing into the corners of the base of the pan and leaving some paper over hanging to easily remove your brownies; set aside.",
    "Melt the butter over stove top in a medium-sized saucepan over low heat. Add the sugar; stir to combine and continue to stir over the heat until butter/sugar mixture is hot (about 1 minute) and sugar has dissolved (the mixture should be shiny).",
    "Remove from the heat; stir in the coffee to dissolve; add the cocoa powder continuously whisking to blend. Allow to cool slightly (about 5 minutes), before whisking through the vanilla extract until all ingredients are well combined.",
    "Add in eggs, one at a time, beating after each addition, until the batter is smooth and glossy. Add flour and chocolate chips; stir through until just combined (do not beat or over mix).",
    "Pour the brownie batter evenly into the prepared pan, smoothing the top over with a spatula (or with the back of a metal spoon). Place in the oven and bake for 25-30 minutes or until a toothpick inserted into the centre comes out slightly dirty. Remove from oven and allow to cool completely in the pan.",
    "Cookie Dough:",
    "Combine butter, vanilla and sugars in a bowl and beat until light and fluffy. Add the flour and salt; beat until a cookie dough forms. Fold in half of the chocolate chips; mix to combine. Divide batter in half. Set one cookie dough aside. To the other, add the coffee and cocoa powder mixture and stir through to combine. (Add 1-2 tablespoons of milk or just enough to make it the same consistency as the other cookie dough if needed).",
    "When brownies have cooled completely; scoop the plain cookie dough over the top and spread evenly. Scoop out the mocha flavoured cookie dough over the top of the plain layer, and swirl with the back of a metal knife. Top with remaining chocolate chips.",
    "Cut into 16 squares."
  ],
  "ingredients": [
    "0",
    "Brownies:",
    "1/2 cup (1 stick) butter, (100g)",
    "1 cup sugar",
    "1 1/2 tablespoons instant coffee powder dissolved in 1 tablespoon boiled water",
    "2/3 cup unsweetened cocoa powder",
    "2 teaspoons pure vanilla extract",
    "1/3 teaspoon salt",
    "2 x-large eggs , cold",
    "1/2 cup flour (plain or all purpose)",
    "1/3 cup chocolate chips of choice (milk, dark or semi-sweet)",
    "Cookie Dough:",
    "1/4 cup butter , softened at room temperature",
    "1 teaspoon pure vanilla extract",
    "2 tablespoons brown sugar",
    "2 tablespoons caster sugar (or a natural sweetener)",
    "1/2 cup flour (plain or all purpose)",
    "pinch of salt",
    "1/4 cup chocolate chips of choice (milk, dark or semi-sweet), divided",
    "1/2 teaspoon instant coffee powder + 1/2 tablespoon unsweetened cocoa powder dissolved in 1 tablespoon boiled water"
  ],
  "__v": 1
}