{
  "hash": "07b70e6c08f9c723c4dbdcd0738b2e3287f4c360",
  "title": "Най-вкусната шоколадова торта",
  "image": "http://farm8.staticflickr.com/7174/6470877785_eee0633a12_o.jpg",
  "href": "http://sunshineskitchen.com/the-best-chocolate-cake/",
  "firstAdded": "2015-02-11T19:02:59.267000",
  "users": [
    null
  ],
  "keywords": [],
  "directions": [
    "0",
    "Фурната се загрява на 180°C.",
    "Брашното, двата вида захар, какаото, содата, бакпулвера и солта се слагат в дълбока купа и се разбъркват добре.",
    "Яйцата, олиото и айрана се разбъркват и се добавят към сухите съставки. Всичко се разбърква добре.",
    "Накрая се излива горещото кафе и сместа се бърка, докато стане гладка и хомогенна.",
    "Имайте предвид, че сместа е сравнително течна, не като класическо тесто за кекс/блат. Именно на това се дължи сочността му, след изпичане, така че не се притеснявайте.",
    "Готовата смес се излива в предварително намаслена и покрита с какао форма за торта. Пече се за 40-45 минути, като времето варира в зависимост от големината на формата и от това дали решите да изпечете цялата смес наведнъж или на части. Ако ползвате форма с диаметър 20см, имайте предвид, че трябва да имате достатъчно височина, т.е. ако стените на формата са ниски, ще трябва да изпечете блатовете на части. Другият вариант е да сложите хартия за печене с височина около 10см от вътрешната страна на формата за торта, за да може тя да попречи на тестото да се излее, а и да му помогне да се изпече високо и равномерно.",
    "След като блатът е готов, се охлажда напълно и след това се разрязва на 3 равни части.",
    "*От посочените продукти се получават 3 блата с диаметър 18-20см. Правила съм по-голяма торта, с диаметър 24-26см, като за нея направих двойна доза и изпекох на два пъти, като всеки блат разрязах на две и се получиха общо 4 блата.",
    "Продукти за шоколадовия мус:",
    "400г шоколад (в случая, 200г черен и 200г млечен)",
    "400мл сладкарска сметана",
    "3 жълтъка",
    "3 белтъка",
    "Шоколадът се нарязва на малки парчета. Сметаната се загрява до кипване и се излива при шоколада. Оставя се за минута, след това се разбърква, докато се получи хомогенна смес. Охлажда се на стайна темепратура, като се бърка от време на време, за да не хване “кора”",
    "Жълтъците се разбиват на водна баня и се добавят към още топлия шоколадов ганаш. Разбърква се, докато всичко се обедини добре. Внимавайте при разбиването на водна баня, водата не бива да докосва дъното на съда за разбиване, защото температурата става прекалено висока и яйцата ще се сготвят. А ние не искаме омлет",
    "Охладеният на стайна температура ганаш се прибира в хладилник за час, докато стегне и стане много гъст.",
    "Белтъците се разбиват на сняг с щипка сол на водна баня (това е по желание, ако не се притеснявате от ползването на пресни яйца, можете и да го пропуснете).",
    "Малка част от тях се добавя към шоколада и се разбърква внимателно. В началото може да ви е трудно, тъй като ганашът е стегнат, но не се притеснявайте, след като се добави малко от белтъка, сместа ще се отпусне. На 2-3 пъти се добавя белтъка и се разбърква със силиконова шпатула, като се внимава да не спадне сместа и да се запази максимално от въздуха в белтъците.",
    "Мусът се прибира в хладилник за 30-40 минути, или докато стегне и стане удобен за нанасяне върху тортата.",
    "Имайте предвид, че колкото по-черен шоколад (с по-висок % на какао) използвате, толкова по-гъст ще бъде мусът. При 50:50 черен към млечен, се получават добри резултати. Не бих ви съветвала да ползвате единствено млечен, тъй като рискувате мусът да не стегне.",
    "Сглобяване:",
    "Върху поднос или поставка за торта се слага един шоколадов блат. Върху него се нанася част от муса и се разпределя равномерно. Така се процедира и с останалите блатове. Накрая цялата торта се измазва с шоколадовия мус и се декорира по желание.",
    "В случая, аз съм подредила по борда шоколадови пурички, но може да използвате всичко, което ви е налично. Например да облепите със смлени ядки, настърган шоколад, дори натрошени трохи от блат. Използвайте въображението си, то няма да ви подведе."
  ],
  "ingredients": [
    "0",
    "Продукти за форма с диаметър 20см*:",
    "180г брашно",
    "150г захар",
    "125г кафява захар",
    "60г какао",
    "1 и 1/4 чаена лъжица сода бикарбонат",
    "1 и 1/4 чаена лъжица бакпулвер",
    "щипка сол",
    "2 яйца, стайна температура",
    "140мл гъст айран",
    "75мл олио",
    "140мл прясно, горещо кафе"
  ],
  "__v": 1
}