{
  "hash": "cbd9c1788da754a551e3415d473f4f8ef672a33a",
  "title": "Easy DIY Tonic Water",
  "image": "http://www.nwedible.com/wp-content/uploads/2015/06/DIY-Tonic-Water17-525x700.jpg",
  "href": "http://www.nwedible.com/easy-diy-tonic-water/",
  "extension": "",
  "firstAdded": "2015-09-23T11:19:13.334000",
  "users": [
    null
  ],
  "keywords": [
    "limes",
    "cinchona",
    "bark",
    "granulated",
    "citric",
    "acid",
    "black",
    "peppercorns",
    "coriander",
    "fennel",
    "seed",
    "nutmeg",
    "cardamom",
    "pods",
    "clove",
    "water",
    "needed",
    "sugar",
    "desired"
  ],
  "directions": [
    "0",
    "Zest limes with a vegetable peeler, then slice the peeled limes in half.",
    "Add the lime zest and fruit, cinchona bark, citric acid and all spices to a medium saucepan. Add 4 cups water to the saucepan, stir, and bring everything to a simmer over medium heat.",
    "When the mixture comes to a simmer, remove the saucepan from the heat, cover, and let the tonic mixture steep 25 minutes.",
    "Strain the tonic concentrate through a strainer to remove large spices and lime rind. Press down on the limes and spices to extract as much liquid as possible.",
    "Line a fine mesh sieve with a double layer of very fine cheesecloth or lint-free cloth. Strain the tonic concentrate through the fabric to remove the fine particulate of the cinchona bark. It can take some time for the tonic concentrate to fully filter through the fabric. When the tonic concentrate is fully filtered, it will have a warm orange color but should not be gritty or opaque.",
    "Measure out the tonic concentrate. You should have about 3½ cups concentrate.",
    "Add 1 cup sugar to the concentrate and stir until the sugar is fully dissolved.",
    "Add additional water to the concentrate as needed to bring the total volume of tonic concentrate to 4 cups.",
    "Taste the concentrate. Add 1 tablespoon tonic concentrate to 6 oz (3/4 cup) club soda to assess the flavor of the tonic concentrate. If a sweeter tonic water is desired, add additional sugar to the concentrate until the desired flavor is achieved. Stir to fully dissolve the sugar.",
    "1",
    "Add 1 tablespoon tonic concentrate to 6 oz club soda or sparkling water to make tonic water. Additional tonic concentrate can be added as desired for a more intense flavor."
  ],
  "ingredients": [
    "0",
    "5 limes",
    "¼ cup powdered cinchona bark",
    "¼ cup granulated citric acid",
    "1 tsp black peppercorns",
    "1 tsp coriander",
    "1 tsp fennel seed",
    "½ a nutmeg",
    "4 cardamom pods",
    "1 clove",
    "4 cups water, plus more as needed.",
    "1 cup sugar, plus more if desired."
  ],
  "__v": 1
}