{
  "hash": "976af7ad7bc7301496c6e13fd5818d0bd3cffb6b",
  "title": "CABBAGE AND CUCUMBER SALAD",
  "image": "https://i1.wp.com/prepareandnourish.com/wp-content/uploads/2017/05/Cabbage-Salad.jpg?resize=150%2C150&ssl=1",
  "href": "https://prepareandnourish.com/cabbage-cucumber-salad/",
  "extension": "Chrome",
  "firstAdded": "2017-06-16T12:52:18.639000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Finely shred or chop cabbage, discarding the cores (or composting). Season with 1 teaspoon of salt and mix thoroughly with hands pressing into the cabbage to help release natural juices. Set aside",
    "Add chopped cucumbers, fresh dill and green onions.",
    "Squeeze the juice of one lemon. Add additional salt and pepper to taste. Pour oil and combine well.",
    "Store in the refrigerator for up to 4 days. See notes if wanting longer storage time.",
    "RECIPE NOTES",
    "To make this days in advance: shred cabbage and set aside. Cut the remaining fresh ingredients and keep separate from cabbage. When ready to serve, season cabbage with 1 teaspoon of salt and massage well to help release juices. Add remaining ingredients, including lemon juice and oil and combine well.",
    "My Amazon Picks",
    "Mueller Austria V-Pro 5 Blade Adjustable Mand…",
    "$29.99$59.99",
    "(1049)",
    "Pyrex Prepware 3-Piece Glass Mixing Bowl Set",
    "$12.49$14.69",
    "(800)",
    "Utopia Kitchen Stainless-Steel Chef Knife,8-Inches",
    "$9.99$19.99",
    "(611)",
    "PROORAL Cut Resistant Gloves Kitchen Supplies Cut Resistant with Leve…",
    "(42)",
    "All",
    "Ads by Amazon",
    "Share",
    "Stumble",
    "Pin",
    "Tweet",
    "Yum",
    "YOU MAY ALSO LIKE",
    "Carrot Salad with Cilantro and Garlic",
    "Asian Cucumber Salad",
    "Pan Browned Sweet Potato & Quinoa Salad",
    "ABOUT ANYA",
    "Anya is the founder and author behind Prepare & Nourish, a place where she shares her passion for traditional, healthy and delicious foods. She enjoys re-creating her deeply rooted Slavic recipes with nourishing ingredients all the while keeping her home and homeschooling their children. She and her husband love to share good food with good friends around their hand-crafted farmhouse table in Northern California. You can connect with Anya on Facebook, Instagram, Twitter, and Pinterest.",
    "« BREAKFAST KALE EGG CUPSREAL FOOD PATRIOTIC “JELLO” CAKE »",
    "COMMENTS",
    "JONI GOMES SAYS",
    "May 22, 2017 at 8:03 am",
    "Such a good recipe!! This reminds me of my childhood, my german grandpa used to make a similar salad!",
    "Reply",
    "ANYA SAYS",
    "May 22, 2017 at 8:05 am",
    "Oh how fun! Love those recipes that bring out childhood memories.",
    "Reply",
    "RAIA TODD SAYS",
    "May 22, 2017 at 9:48 am",
    "Raw cabbage and cucumbers are two of my bunnies… er, kids favorite things! I know they’re gonna love this.",
    "Reply",
    "ANYA SAYS",
    "May 22, 2017 at 3:37 pm",
    "Haha! You’re such a good mama!",
    "Reply",
    "LINDA SPIKER SAYS",
    "May 22, 2017 at 4:03 pm",
    "Wow. What a gorgeous, simple recipe! Love the green and white without any other color. Makes for a very pretty picture!",
    "Reply",
    "ANYA SAYS",
    "May 22, 2017 at 9:44 pm",
    "Thank you Linda. I love the simplicity of this salad.",
    "Reply",
    "RENEE SAYS",
    "May 22, 2017 at 4:41 pm",
    "Loved the FB video! This sounds so fresh and delicious. I love easy salad sides like this in the summer when I don’t want to cook! My girls would gobble this up for lunch!",
    "Reply",
    "EMILY @ RECIPES TO NOURISH SAYS",
    "May 22, 2017 at 8:44 pm",
    "This recipe is so you my dear friend! I love everything about it, especially that beautiful dill. Can’t go wrong with dill! Such a delicious, refreshing salad.",
    "Reply",
    "ANYA SAYS",
    "May 22, 2017 at 9:43 pm",
    "Thanks Emily! Dill is such an amazing herb – adds so much flavor!",
    "Reply",
    "REAL FOOD WITH DANA SAYS",
    "May 23, 2017 at 7:28 am",
    "I love cucumber salads! So great for the summer months, like you said, when we’re not feeling the hot side dishes so much",
    "Reply",
    "ANYA SAYS",
    "May 23, 2017 at 12:04 pm",
    "Totally get that. Cucumbers are very refreshing too.",
    "Reply",
    "JEAN SAYS",
    "May 23, 2017 at 10:08 am",
    "Such a refreshing salad for the summer!",
    "Reply",
    "ANYA SAYS",
    "May 23, 2017 at 12:03 pm",
    "Agreed! We’re all about refreshing right now in this heat.",
    "Reply",
    "MICHELE SPRING SAYS",
    "May 23, 2017 at 3:55 pm",
    "This looks so delicious and refreshing! Perfect for those really hot summer days when you don’t want to cook or have anything hot.",
    "Reply",
    "ANYA SAYS",
    "May 23, 2017 at 5:22 pm",
    "Yep! This salad is great with grilled chicken. No side needed.",
    "Reply",
    "JO ROMERO SAYS",
    "May 23, 2017 at 11:23 pm",
    "This is a great idea, and I love dill in everything so I’m pretty sure I’d love this salad. Definitely one to put on the table this summer!",
    "Reply",
    "ANYA SAYS",
    "May 24, 2017 at 8:06 am",
    "Agreed Jo! It makes a great summer salad indeed.",
    "Reply",
    "KARI - GET INSPIRED EVERYDAY! SAYS",
    "May 25, 2017 at 7:52 am",
    "What an awesome recipe, I love the addition of dill in there! I love a good Caesar too, but you just can’t beat a salad that keeps for a few days, that’s pretty much the only way I can manage to get a salad in every day!",
    "Reply",
    "ANYA SAYS",
    "May 25, 2017 at 10:45 am",
    "I love that it can be kept for longer. Thanks Kari.",
    "Reply",
    "CHIHYU SAYS",
    "May 27, 2017 at 6:52 pm",
    "This looks delicious ! It’ll be perfect as a side and for the upcoming hot summer days !",
    "Reply",
    "ANYA SAYS",
    "May 27, 2017 at 9:06 pm",
    "Yep – great summer salad! Thanks Chihyu for your comment.",
    "Reply",
    "KATJA SAYS",
    "May 27, 2017 at 8:15 pm",
    "This reminds me of food my grandma made back in Finland. Simple and delicious.",
    "Reply",
    "ANYA SAYS",
    "May 27, 2017 at 9:04 pm",
    "It must be an Eastern European thing. So simple and delicious indeed.",
    "Reply",
    "CRISTINA CURP SAYS",
    "May 28, 2017 at 12:44 pm",
    "So refreshing and light! Perfect for these hot Hawaii summers! Yum!",
    "Reply",
    "DARRYL EDWARDS SAYS",
    "May 28, 2017 at 2:37 pm",
    "This looks like a very clean and refreshing salad. A reminder that summer is here! Thanks so much!",
    "Reply",
    "KENDRA CARDOZA SAYS",
    "May 29, 2017 at 10:08 am",
    "I have a slight obsession with persian cucumbers This one is definitely going on my menu!",
    "Reply",
    "ANYA SAYS",
    "May 30, 2017 at 11:46 am",
    "I’m with you on the persian cucumbers. Love ’em!",
    "Reply",
    "RACHEL SAYS",
    "May 29, 2017 at 7:32 pm",
    "I miss dill so much during the winter. I’m totally in love with spring/summer recipes that use it in all the ways.",
    "Reply",
    "ANYA SAYS",
    "May 30, 2017 at 11:45 am",
    "I would be so sad without dill in my life.",
    "Reply",
    "BECKY WINKLER SAYS",
    "June 5, 2017 at 10:41 am",
    "Love this! I am already running low on ways to use the cabbages in my CSA box, and I know cucumbers aren’t far behind!",
    "Reply",
    "ANYA SAYS",
    "June 5, 2017 at 3:19 pm",
    "Yes!! We love cucumbers!",
    "Reply",
    "LEAVE A REPLY",
    "Your email address will not be published. Required fields are marked *",
    "Comment",
    "Name *",
    "Email *",
    "Website",
    "Recipe Rating",
    "LOOKING FOR SOMETHING?",
    "PINTEREST CRAZINESS",
    "Visit Anya | Prepare + Nourish's profile on Pinterest.",
    "FAVORITE GRAIN FREE FLOUR",
    "FEATURED POSTS",
    "STAY UP TO DATE!",
    "Join our newsletter to get all the latest straight to your inbox!",
    "First NameE-Mail Address",
    "WHAT I’VE BEEN UP TO",
    "Load More...Follow on Instagram",
    "CONNECT WITH ME",
    "COPYRIGHT © 2017 · DIVINE THEME BY RESTORED 316",
    "HOME | ABOUT | CONTACT | DISCLAIMER | COPYRIGHT © 2016 · PREPARE & NOURISH",
    "Share",
    "Stumble",
    "Pin",
    "Tweet",
    "Yum",
    "Select Directio"
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1/2 head white cabbage shredded or chopped",
    "2 persian cucumbers sliced",
    "2 tablespoons fresh dill chopped",
    "2 tablespoons green onions chopped",
    "2 teaspoon unrefined salt divided",
    "1/2 lemon, juiced",
    "3 tablespoons avocado or extra virgin olive oil",
    "additional salt and pepper to taste"
  ],
  "__v": 1
}