{
  "hash": "87fda52dda729afbe2aa27cea3c7af4cb2933029",
  "title": "Peasant Leek and Spinach Casserole",
  "image": "https://images.food52.com/nXcA7knOC9at8inR6YaVT35D8yM=/753x502/4e1e3942-85b6-46ee-bdd6-bc9cc9edf2ba--image_MG_1492_psd.jpg",
  "href": "https://food52.com/recipes/20299-peasant-leek-and-spinach-casserole",
  "extension": "",
  "firstAdded": "2018-01-28T21:54:52.703000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Carefully wash the leaks. (I ended up with soiled food so many times, and therefore cannot help but repeat the mantra.) Quarter the leeks lengthwise, and then slice thinly crosswise.",
    "In a small pot, bring water to boil. Add the rice and boil for about 5 minutes. Drain the rice and set aside.",
    "In a large saucepan combine the oil with the leeks and place over medium heat (you can heat the oil first, but starting the leeks in cold oil brings out a slightly different mellower flavor). Simmer the leeks for about 12 minutes, until very soft.",
    "Add the garlic and continue to simmer for another minute or two.",
    "Add the spinach, cover and continue to simmer until the spinach has wilted completely. (If needed add a drop of water.)",
    "Preheat the oven to 340F. Add the rice to the leeks and spinach and generously season with salt and pepper. Add the Hungarian paprika, mix well and transfer into 9x13 inch casserole. (Any baking dish will do as long as the vegetable layer is quite thin, no more than 1 to 1 1/2 inches tall.)",
    "Add about 2 cups of water to the casserole (you want the water barely covering the dish, and if needed you can always add more during baking.) Bake for about 45 minutes, or until all the water has evaporated, the rice is plump and the top of the casserole is nicely caramelized.",
    "Serve the dish at room temperature. (And do not forget the kefir!)"
  ],
  "ingredients": [
    "0",
    "20 ounces leeks (white and light green parts only)",
    "20 ounces baby spinach, chopped",
    "1 cup white rice",
    "1 1/2 teaspoons sweet Hungarian paprika",
    "4 garlic cloves, minced",
    "1/3 cup vegetable oil",
    "Salt and freshly ground pepper"
  ],
  "__v": 1
}