{
  "hash": "2e5a7b4cfd9b75ec55eef7b387b4c024d3552c46",
  "title": "Chicken Bellagio",
  "image": "",
  "href": "http://recipe-folder.com/recipe/5ee13bec8cd82843f810abe8",
  "extension": "User Added",
  "firstAdded": "2020-06-10T20:00:44.257000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Drop the pasta into a pot of boiling salted water and cook un l “al dente” (approx. 8 mins.)",
    "1",
    "Season the chicken breasts evenly (one side only) with salt and pepper. Coat the chicken lightly with flour",
    "2",
    "(both sides), shaking off any excess. Dip the chicken into the egg wash, and then coat them evenly (both",
    "3",
    "sides) with the seasoned breadcrumbs. Gently press the breadcrumbs onto the chicken to help “set” the",
    "4",
    "coa ng.",
    "5",
    "Ladle the oil onto a flat grill or into a large sauté pan and allow to heat. Carefully place the breaded",
    "6",
    "chicken breasts onto the grill or into the pan and cook un l the chicken is crispy and has turned a light,",
    "7",
    "even golden brown. Turn the chicken over and con nue to cook un l done.",
    "8",
    "While the chicken and pasta are cooking, ladle the parmesan cream sauce into a small non-s ck sauce pot",
    "9",
    "or sauté pan set over medium heat. Allow the sauce to come up to a boil, s rring occasionally to prevent",
    "10",
    "burning. As soon as the sauce begins to boil, remove it from the heat immediately. Set aside and keep",
    "11",
    "warm.",
    "12",
    "Ladle the basil oil and chicken broth into a large non-s ck sauté pan set over medium heat. Cook the",
    "13",
    "sauce ingredients un l heated through. Add bu􀂂er s rring to incorporate. Con nue to cook un l just",
    "14",
    "heated through. Add the well-drained pasta and cheese to the pan tossing to incorporate.",
    "15",
    "Mound the pasta onto the center of the serving pla􀂂er, leaving a 1” open border within the rim. Ladle 2 fz.",
    "16",
    "of the parmesan cream sauce onto the pla􀂂er and around the pasta.",
    "17",
    "Place the chicken cutlets on top of the pasta at a slight angle (shingled if necessary). When pla􀂂ed",
    "18",
    "correctly, very li􀂂le of the pasta will remain visible. Drizzle the remaining parmesan cream sauce randomly",
    "19",
    "over the chicken. Sprinkle the chopped parsley evenly over the chicken and pasta.",
    "20",
    "Set the prosciu􀂂o slices around the top of the chicken forming a fluffy “crown” with an open area le􀁛 in",
    "21",
    "the center.",
    "22",
    "Place the arugula into a clean stainless steel mixing bowl. Drizzle the oil into the bowl and over the",
    "23",
    "arugula. Squeeze the lemon wedge over the arugula and season with a li􀂂le salt and pepper. Add the",
    "24",
    "parm/romano into the bowl. Gently toss the ingredients together to coat the arugula with the dressing.",
    "25",
    "Mound the arugula on top of (centered) the chicken and over the pasta within the open area of the",
    "26",
    "prosciu􀂂o “crown”."
  ],
  "ingredients": [
    "0",
    "8 oz. Spaghe ni Pasta",
    "1",
    "1 fz. Canola Oil",
    "2",
    "2 ea. Boneless, Skinless Chicken Breasts (3 Oz.), Pounded Approximately 6” Wide",
    "3",
    "1/4 tsp. Kosher Salt",
    "4",
    "1/8 tsp. Freshly Ground Black Pepper",
    "5",
    "1 oz. All-Purpose Flour",
    "6",
    "2 fz. Egg Wash",
    "7",
    "2 oz. Seasoned Breadcrumbs",
    "8",
    "3 fz. Parmesan Cream Sauce",
    "9",
    "1-1/2 fz. Basil Oil",
    "10",
    "1/2 fz. Chicken Broth",
    "11",
    "1 tbl. Bu􀂂er",
    "12",
    "1/4 oz. Parmesan/Romano Cheese Blend",
    "13",
    "1/2 tsp. Parsley, Chopped",
    "14",
    "3/4 oz. Prosciu􀂂o, Sliced 1/16”",
    "15",
    "1/2 oz. Baby Arugula",
    "16",
    "1/2 tsp. Olive Oil",
    "17",
    "Pinch Kosher Salt",
    "18",
    "Pinch Freshly Ground Black Pepper",
    "19",
    "1 tsp. Lemon Juice, Freshly Squeezed",
    "20",
    "1/4 oz. Parmesan/Romano Cheese Blend"
  ],
  "__v": 1,
  "hidden": true
}