{
  "hash": "e7516d42748b7580d31941159ed6ff44592046f3",
  "title": "Coconut Noodle Soup",
  "image": "https://i0.wp.com/gratefulgrazer.com/wp-content/uploads/2019/01/B2-Coconut-Noodle-Soup.jpg?resize=980%2C1470",
  "href": "https://gratefulgrazer.com/home/coconut-noodle-soup/",
  "extension": "Chrome",
  "firstAdded": "2019-01-25T15:09:00.029000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Bring 4 quarts of water to a boil. Preheat grill pan on a second burner if including shrimp.",
    "On a third burner, add coconut oil to a stockpot or Dutch oven over medium heat. Stir in shallot, garlic, and ginger, and cook, stirring constantly, 2 minutes, or until shallot is translucent.",
    "Stir in red bell pepper and frozen edamame, and cook 4 minutes, or until warm.",
    "Stir in vegetable broth, coconut milk, red curry powder, turmeric, cayenne pepper, and salt and pepper. Use a whisk to incorporate coconut milk into the soup if needed. Reduce heat to low and simmer 10 minutes, or until remaining components are ready to serve.",
    "In the meantime, spread shrimp (if including) on a preheated grill pan. Cook 4 minutes, or until shrimp easily separates from the pan. Flip and repeat on the other side until shrimp turns pink. Remove cooked shrimp from heat and set aside.",
    "In the final few minutes of cooking, add brown rice noodles to a pot of boiling water and cook 2 minutes, or until tender. Drain and set aside.",
    "Stir spinach into the soup and turn off heat.",
    "To serve, divide cooked noodles between bowls and ladle soup on top to cover. Divide cooked shrimp between bowls if using. Garnish with basil, cilantro, green onion, lime, and chili pepper if desired."
  ],
  "ingredients": [
    "0",
    "2 tablespoons coconut oil",
    "1 large shallot, diced (½ cup)",
    "4 cloves garlic, sliced (1 tablespoon)",
    "2 inch piece of ginger, grated (1 ½ tablespoon)",
    "1 red bell pepper, chopped",
    "1 cup frozen shelled edamame",
    "4 cups vegetable broth",
    "1 can unsweetened coconut milk (13.66 ounces, see note)",
    "1 tablespoon red curry powder (see note)",
    "1 tablespoon ground turmeric",
    "½ teaspoon cayenne pepper, or to taste (optional for spicy flavor; use less or omit for a milder flavor)",
    "Salt and pepper",
    "16 pieces extra large frozen shrimp thawed, peeled and tails removed (optional, see note)",
    "4 ounces dry brown rice noodles (see note)",
    "2 cups baby spinach"
  ],
  "__v": 1
}