{
  "hash": "2208c7d75e5369a45e5baedb361010e520a47121",
  "title": "Middle Eastern Spiced Chickpea Salad",
  "image": "https://www.recipetineats.com/wp-content/uploads/2014/05/Spiced-Chickpea-Salad_3-2.jpg",
  "href": "https://www.recipetineats.com/middle-eastern-spiced-chickpea-salad/",
  "extension": "Firefox",
  "firstAdded": "2018-04-17T01:51:43.534000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Combine the Dressing ingredients in a jar and shake. Set aside for 20 minutes to allow the flavours to develop.",
    "Place chickpeas in a large bowl. Scatter over Spices, then toss to coat. The wetness of the chickpeas will make the spices stick.",
    "Heat 2 tbsp olive oil in a large pan over high heat and fry the chickpeas for a couple of minutes. Shake the pan so the chickpeas roll, or stir gently (so the spice coating doesn't come off). Transfer into bowl and cool slightly.",
    "Combine the Salad Ingredients in a bowl. Drizzle with a bit of Dressing and toss. Transfer to serving bowl.",
    "Top salad with chickpeas (warm or at room temperature). Drizzle with more Dressing. Toss very gently, if desired (don't toss too much otherwise spice comes off chickpeas). Serve immediately.",
    "Great served with a dollop of yoghurt and pita bread to stuff the salad into.",
    "Recipe Notes",
    "1. Feel free to use dried chickpeas you have cooked yourself if you prefer. You'll need 1 3/4 cup. Wet the chickpeas and drain per recipe (so the spices stick).",
    "2. Sherry vinegar is fantastic for dressings because it's not as sharp as other vinegars. I can't remember if it's sold in Australian supermarkets, I think I get mine from Harris Farms. If you can't find it, sub with white wine vinegar or red wine vinegar.",
    "3. To smash the garlic clove, peel it then use the side of your knife and hit it with the palm of your hand so the garlic clove bursts open but mostly stays in one piece. Doing this infuses the dressing with subtle garlic flavour and makes it easy to pick the garlic out later. Alternatively, just mince the garlic.",
    "4. This salad is lovely served with a dollop of yoghurt, or stuff it into pita bread.",
    "5. You probably may not need all the dressing, so keep the leftover in a jar to use for another salad. It's a terrific all purpose vinaigrette.",
    "6. Nutrition assumes this serves 4 as a side. Note that the dressing quantities is quite generous. Typically I only use about half. 60 calories of the 295 calories per serving is attributable to the olive oil in the dressing, so if you don't use it all, you will reduce the calories."
  ],
  "ingredients": [
    "0",
    "Chickpeas",
    "400g / 14 oz can chickpeas, drained but still wet (Note 1)",
    "2 tbsp olive oil",
    "Chickpea Spices",
    "1 tsp ground cumin",
    "1 1/2 tsp All Spice",
    "1 tsp ground cardamon",
    "1/4 tsp salt",
    "Salad",
    "2 cucumbers , diced",
    "2 tomatoes (or 3 medium tomatoes), diced",
    "1 red onion (small) , diced",
    "1/4 cup coriander leaves , roughly chopped",
    "1/4 cup parsley , roughly chopped",
    "Dressing",
    "1 1/2 tbsp sherry vinegar (Note 2)",
    "Zest of half a lemon",
    "2 tbsp lemon juice",
    "1/4 cup extra virgin olive oil",
    "1 tsp caster sugar",
    "1 garlic clove, smashed (Note 3)",
    "Salt and pepper"
  ],
  "__v": 1
}