{
  "__v": 1,
  "directions": [
    "0",
    "Heat the stock in a saucepan over medium heat. Hold it at low temperature so it’s warm when you are ready to add it to the soup.",
    "Heat a cast-iton pan over medium high heat. Add the olive oil and the ramp stems. Cook for 1 to 2 minutes until translucent but do not brown. Add the pimentón and the bread and stir until all flavors are incorporated. Add the stock and bring liquid to a simmer. Cover the pot and cook for 15 to 20 minutes. Add the ramp greens, stir and cook for another 3 minutes. Taste the broth and adjust seasoning if needed (depends on how salty your stock is).",
    "To cook the eggs, you can cook them all at once in the pot or you can cook them in a smaller pan one portion at a time (which I prefer to do so it looks nicer). Ladle a serving of soup into a small saucepan. Heat over medium heat so the soup is simmering. Crack one egg into the soup and let it slowly cook in the broth for 2 to 3 minutes until the white is set but yolk is still runny. Add a pinch of salt on top of the egg and serve immediately."
  ],
  "firstAdded": "2014-06-06T14:22:24.595000",
  "hash": "86f9a618c5ab6423a721939d79501e33efb22eca",
  "href": "http://www.cannellevanille.com/gluten-free/comfort-garlic-soup-ramps/",
  "image": "http://www.cannellevanille.com/wp-content/uploads/2014/05/EDOC8007_edited.jpg",
  "ingredients": [
    "0",
    "1 quart (1 liter) chicken or vegetable stock",
    "1/4 cup olive oil",
    "6 ounces (185 g) ramps, washed and thinly sliced (separate the white stems from the green leaves)",
    "1 tablespoon Spanish pimentón (paprika)",
    "1 slice of stale gluten-free bread, crumbled (you could always toast it slightly to make it drier)",
    "Salt",
    "4 eggs"
  ],
  "keywords": [
    "chicken",
    "stock",
    "olive",
    "oil",
    "ramps",
    "washed",
    "separate",
    "white",
    "stems",
    "green",
    "leaves",
    "spanish",
    "pimentn",
    "paprika",
    "slice",
    "stale",
    "glutenfree",
    "bread",
    "crumbled",
    "toast",
    "slightly",
    "make",
    "drier",
    "salt",
    "eggs"
  ],
  "title": "Ramp soup with poached eggs",
  "users": [
    null
  ]
}