{
  "hash": "692ccba13f63be1d67f12e266a2081ba4b1a8c9a",
  "title": "Pumpkin Cake Cheesecake",
  "image": "https://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2014/09/Pumpkin-Cake-Cheesecake-this-is-one-of-my-favorite-desserts-to-make-in-the-Fall.jpg",
  "href": "https://sallysbakingaddiction.com/2014/09/23/pumpkin-cake-cheesecake/",
  "extension": "Chrome",
  "firstAdded": "2018-09-15T22:17:09.544000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Adjust oven rack to the lower third position and preheat the oven to 350F degrees. Spray a 9-inch springform pan with nonstick cooking spray. Wrap aluminum foil on the bottom and tightly around the outside walls of the springform pan, as shown in photos on my How to Prevent Cheesecake Cracks page. Set aside.",
    "Make the cheesecake first: Using a handheld or stand mixer fitted with a paddle attachment, beat the cream cheese and granulated sugar together on medium speed in a large bowl - about 3 full minutes until the mixture is smooth and creamy. Add the sour cream, vanilla, and flour and beat until combined. On low speed, add the eggs one at a time, beating after each addition until just blended. Do not overmix the filling after you have added the eggs. Set aside.",
    "Make the pumpkin cake: In a medium bowl, whisk the oil, brown sugar, eggs, vanilla, and blotted-dry pumpkin (see notes) together until combined and uniform in texture. In a large bowl, whisk the flour, baking soda, cinnamon, pumpkin pie spice, and salt together. Pour the wet ingredients into the dry ingredients and whisk until no large lumps remain. Avoid overmixing the pumpkin cake batter.",
    "Spread 1 and 1/2 cups of the pumpkin cake batter over bottom of prepared pan. On top of the pumpkin batter, drop large spoonfuls of the cheesecake batter. Top with large spoonfuls of remaining pumpkin cake batter. Repeat with remaining cream cheese batter. It does not have to be neat and perfect. Do not swirl with a knife. See photo above of what my cake looked like before going into the oven.",
    "Place the springform pan into a large roasting pan and place into the oven. Fill with about 1 inch of hot water. The foil wrapped around the pan will prevent water from leaking inside. Click here to read more about my cheesecake water bath.",
    "Bake for 65-75 minutes or until the center is almost set.4 If you find the edges are browning, loosely place aluminum foil on top of the cake as it bakes. Once done, turn the oven off and open the door slightly. Let the cheesecake sit in the oven for 1 hour. Remove from the oven and allow to cool completely at room temperature. Refrigerate for at least 6 hours or overnight (preferred). Loosen the cheesecake from the rim of the pan and remove the rim.",
    "Make the cream cheese frosting (this can be made up to 2 day sin advance - cover and store in the refrigerator until ready to use.) Using a handheld or stand mixer fitted with a paddle attachment, beat the cream cheese and butter together on medium-high speed in a medium bowl until smooth and creamy. Add the confectioners sugar, vanilla, and salt. Beat on low speed for 30 seconds, then turn up to high speed and beat until smooth and creamy. Beat in 1-2 Tablespoons of milk, depending how thick or thin you want the frosting. Spread onto chilled cheesecake. Top with pecans, if desired.",
    "Cut into slices and serve cheesecake chilled. Cover leftover cheesecake and store in the refrigerator for up to 4 days.",
    "Make ahead tip: This pumpkin cake cheesecake freezes well up to 2 months, covered tightly. Thaw overnight in the refrigerator. The cream cheese frosting can be made in advance-- see step #7."
  ],
  "ingredients": [
    "0",
    "Cheesecake",
    "16 ounces (448g) full-fat cream cheese, softened to room temperature",
    "3/4 cup (150g) granulated sugar",
    "1/4 cup (60g) plain yogurt or sour cream1",
    "1 teaspoon vanilla extract",
    "1 Tablespoon (8g) all-purpose flour",
    "3 large eggs",
    "Pumpkin Cake",
    "3/4 cup (180ml) canola or vegetable oil",
    "1 cup (200g) packed light or dark brown sugar",
    "2 large eggs",
    "1 teaspoon vanilla extract",
    "1 and 1/3 cups (318g) pumpkin puree (canned or fresh)2",
    "1 cup (125g) all-purpose flour (measured correctly)",
    "1 teaspoon baking soda",
    "1 and 1/2 teaspoons ground cinnamon",
    "1 teaspoon pumpkin pie spice3",
    "1/4 teaspoon salt",
    "Cream Cheese Frosting",
    "4 ounces (112g) full-fat cream cheese, softened to room temperature",
    "2 Tablespoons (16g) unsalted butter, softened to room temperature",
    "2 cups (240g) confectioners' sugar, sifted",
    "1 teaspoon vanilla extract",
    "1/8 teaspoon salt",
    "1-2 Tablespoons (15-30ml) milk",
    "chopped pecans, optional"
  ],
  "__v": 1
}