{
  "hash": "9b0e2a4f9ebb9afae9bcfc58a6ffe9b6a4adea65",
  "title": "Pie de levadura fermentado “Sourdough Starter”",
  "image": "",
  "href": "http://www.gustausted.com/2012/10/pie-de-levadura-para-masa-madre-agria.html",
  "extension": "Chrome",
  "firstAdded": "2015-11-10T03:27:05.271000",
  "users": [
    null
  ],
  "keywords": [
    "tazas",
    "harina",
    "todo",
    "uso",
    "cucharadita",
    "sal",
    "cucharadas",
    "azcar",
    "cucharada",
    "levadura",
    "seca",
    "agua",
    "calientita",
    "que",
    "metas",
    "dedo",
    "queme"
  ],
  "directions": [
    "0",
    "Preparación:",
    "En un tazón mediano mezcla los ingredientes secos con una cuchara de madera y añade el agua calientita gradualmente. Revuelve hasta que la mezcla se vea como una pasta suave. Cubre con una toalla de cocina o manta de cielo y déjala en un lugar tibio a que se agrie (85°F, 30°C). Revuelve ocasionalmente varias veces al día. En 2 o 3 días estará listo.",
    "Guárdalo en el refrigerador en un contenedor de plástico fuerte con un hoyito en la tapa para que escapen los gases",
    "Para hacer una masa para tu receta de pan con masa fermentada favorita, saca una taza del pie de levadura (starter) y combina con 1 taza de harina todo uso y 1 taza de agua calientita; mezcla bien con la cuchara de palo. No te preocupes por los grumos en la mezcla, la fermentación los disolverá en pocas horas. Cubre con una toalla o papel film y déjalo en un lugar tibio varias horas o toda la noche.",
    "Antes de añadir cualquier ingrediente adicional a la receta, regresa por lo menos ½ taza de la masa fermentada al contenedor de pie de levadura “starter” del refrigerador, para reponer el “starter”.",
    "Si el pie de levadura “starter” no se repone de esta manera por lo menos una vez por semana, añade ½ taza de cada uno: harina y agua tibia al contenedor, mezcla, déjalo fuera del refrigerador toda la noche, cubierto con una toalla de cocina o con papel film. Al día siguiente en la mañana, revuelve la mezcla, tápalo y refrigera hasta que lo necesites.",
    "Ocasionalmente, vierte todo el contenido del pie de levadura fermentado en un tazón y lava el contenedor para remover residuos acumulados que se van pegando.",
    "Para reponer, añade porciones iguales de harina y agua y cubre y déjalo en un lugar tibio toda la noche (30°C)",
    "Si tu pie de levadura “starter” no se ve con burbujitas después de uso continuo, salpica con una pequeña cantidad de levadura seca y mezcla bien.",
    "Esto también si se congela y después se descongela y no tiene esa apariencia de espuma burbujeante. Si se forma líquido, simplemente revuélvelo y continúa usándolo como se necesite."
  ],
  "ingredients": [
    "0",
    "2 Tazas de harina todo uso",
    "1 cucharadita de sal",
    "3 cucharadas de azúcar",
    "1 cucharada de levadura seca",
    "2 tazas de agua calientita (que metas el dedo y no te queme)"
  ],
  "__v": 1
}