{
  "hash": "222aff4c9b9fdb725ef7531f43b474f7835cb1dd",
  "title": "Cream Cheese Chicken Taquitos",
  "image": "http://www.thisgrandmaisfun.com/wp-content/uploads/2014/08/Taquitos-Cream-Cheese.jpg",
  "href": "http://www.thisgrandmaisfun.com/cream-cheese-chicken-taquitos/",
  "extension": "Chrome",
  "firstAdded": "2016-09-21T22:25:06.303000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Mix chili powder, garlic powder, cumin, salt and pepper to taste, cream cheese, and water in a medium mixing bowl. Pour half of the mixture into your crockpot, place chicken in crockpot and pour remaining mixture over the chicken.",
    "Cover and cook on low 8 hours or high for 4 hours.",
    "Minutes before serving, remove chicken from crock pot, shred with two forks, and return to slow cooker. Give it a stir. Cook about 15 minutes longer.",
    "Preheat oven to 400. Here is a great trick to keep your corn tortilla from falling apart. Place 1 corn tortilla on a skillet, put about ⅛ cup cheese on the corn tortilla. Warm the tortilla until the cheese melts, remove tortilla from pan. Melting the cheese on the corn tortilla will keep it from falling apart in the next step.",
    "Place about ¼ cup of the chicken mixture onto the middle of each corn tortilla that has the melted cheese on it or a flour tortilla.",
    "Top with 1-2 tablespoons shredded cheese. Roll tightly and place in a single layer on a greased baking sheet. If using corn tortilla brushing some olive oil over them will help with browning and crisping.",
    "Bake 10 minutes, until tortillas are slightly browned and shredded cheese is melted. Serve with desired toppings and sauces."
  ],
  "ingredients": [
    "0",
    "2 boneless skinless chicken breasts",
    "1 teaspoon chili powder",
    "1 teaspoon garlic powder",
    "1 teaspoon cumin",
    "salt + pepper",
    "8 ounces cream cheese",
    "⅓ cup water",
    "1 to 1 ½ cups shredded colby or Mexican blend cheese",
    "12 6 inch corn or flour tortillas",
    "optional: cilantro, salsa, sour cream, or other toppings as desired"
  ],
  "__v": 1
}