{
  "hash": "eefc2d5aa4ed24eaabe3a7e8af6bfb066b606c23",
  "title": "STEW CHICKEN",
  "image": "",
  "href": "https://metemgee.com/2013/05/13/chicken-stew-brown-stew-chicken/",
  "extension": "Chrome",
  "firstAdded": "2016-11-23T18:04:03.713000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "Make a dry rub by combining: dried onions, granulated garlic, thyme, oregano, brown sugar, cayenne pepper and salt. Season chicken overnight with dry rub and place in the refrigerator. Before cooking let chicken sit at room temperature for at least 1/2 hour. Add cassareep and mustard to mixture and let sit for at least 15 minutes before cooking. In a large pot on medium heat, saute diced onions and garlic in hot oil. Let cook until onions become soft and brown. Add tomatoes and continue to cook for about 3 minutes or until tomatoes are soft. Add seasoned chicken and saute to 5 to 10 minutes, turning occasionally to ensure even browning of chicken. Add diced potatoes, reduce heat, cover and let cook for about 3 additional minutes. The chicken and potatoes should “spring” their own liquids/juices at this point, if this doesn’t happen you may add 1/2 cup of water to prevent burning. Add wine and tomato paste. Cover pot and continue to cook on low heat for about 30 minutes, or until potatoes and chicken are completely cooked and tender. In some cases you may need to add a cup or two of water or chicken stock, to prevent the stew from become too thick. Once the chicken and potatoes are cooked and the stew simmers to a semi thick consistency, remove from heat and enjoy with some rice or bread.",
    "Tips and ramblings:",
    "1. You may want to start off with 2 tsp of salt and add a bit more if need, as you go along.",
    "2. If the chicken and potatoes finish cooking but the stew is not as thick as you would like, increase the heat and let the gravy cook down.",
    "3. Sometimes potatoes take a long time to cook, in tomato paste, so I let the potatoes cook, then add the tomato paste towards the end."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 lbs bone-in, skinless chicken thighs",
    "1 lb potatoes (peeled and cut into quarters)",
    "1 tbsp dried onions",
    "1 tbsp granulated garlic",
    "1 tbsp dried thyme",
    "1 tsp dried oregano",
    "1 tbsp brown sugar",
    "1/2 tsp paprika",
    "1/2 tsp cayenne pepper",
    "1 tbsp cassareep",
    "1 tsp spicy brown mustard",
    "1 large onions (diced)",
    "6 cloves of garlic (finely chopped)",
    "1 cup of diced tomatoes (about 2 large tomatoes)",
    "About 2 to 3 tsp salt",
    "1 tbsp of tomato paste",
    "2 tbsp oil",
    "1 cup of sweet white wine",
    "about 2 cups of water (if needed)"
  ],
  "__v": 1
}