{
  "__v": 5,
  "directions": [
    "0",
    "Method of making tangzhong:",
    "Mix flour in water well without any lumps. Cook over medium-low heat, stirring consistently with a wooden spoon, whisk or spatula to prevent burning and sticking while you cook along the way.",
    "The mixture becomes thicker and thicker. Once you notice some “lines” appear in the mixture for every stir you make with the spoon. It’s done. You get the Tangzhong. (Some people might like to use a thermometer to check the temperature. After a few trials, I found this simple method works every time.) Remove from heat.",
    "Transfer into a clean bowl. Cover with a cling wrap sticking onto the surface of Tangzhong to prevent from drying up. Let cool. The Tangzhong can be used straight away once it cools down to room temperature. Just measure out the amount you need. The leftover Tangzhong can be stored in fridge up to a few days as long as it doesn't turn grey. If so, you need to discard and cook some more. (Note: The chilled Tangzhong should return to room temperature before adding into other ingredients. )",
    "Method of making bread:",
    "Combine all dry ingredients: flour, salt, sugar and instant yeast in a bowl. Make a well in the center. Whisk and combine all wet ingredients: milk, egg and Tangzhong, then add into the well of the dry ingredients. Knead until you get a dough shape and gluten has developed, then knead in the butter. Mind you, it’d be quite messy at this stage (That's why I used a bread maker). Keep kneading until the dough is smooth, not sticky and elastic. To test if the dough is ready, you might stretch the dough. If it forms a thin “membrane”, it’s done. The time of kneading all depends on how hard and fast you knead. (Note: I use bread maker to do this hardest part and messy job for me. I added the wet ingredients into my bread maker first, then followed by the dry ingredients. The yeast is the last to add.)",
    "Knead the dough into a ball shape. Place in a greased bowl and cover with a wet towel or cling wrap. Let it proof till it's doubled in size, about 40 minutes (Note: the time will vary and depends on the weather. The best temperature for proofing is 28C. I still used my bread maker in this stage. And my bread maker has a heater.)",
    "Transfer to a clean floured surface. Deflate and divide the dough into four equal portions. Knead into ball shapes. Cover with cling wrap, let rest for 15 minutes.",
    "Roll out each portion of the dough with a rolling pin into an oval shape. Sprinkle bacon and cheese evenly as much as you like. Roll from the upper, shorter end down to the bottom (as picture shown). Flatten the dough with your rolling pin. Then roll once again. The seals face down.",
    "Arrange the rolled-up dough in a greased or non-stick loaf tin (as picture shown). Leave it for the 2nd round of proofing, about 40 minutes, or until the dough rises up to 3/4 of the height of the tin inside.",
    "Brush whisked egg on surface. Bake in a pre-heated 350F oven for 35 to 40 minutes. Remove from the oven and tin. Transfer onto a wire rack and let cool completely. Slice to serve or place in an airtight plastic bag or container once it's thoroughly cooled.",
    "Bacon and Cheese Bread Procedures",
    "Notes:",
    "If you find yourself too tired of kneading dough, just like me, you can use a bread maker instead. This recipe is designed for bread makers, yet you can make a soft and fluffy loaf with or without it, by using the Tangzhong.",
    "The cheese would be melted and created some holes inside the bread. If you’d like a better looking, cut the cheese into smaller pieces."
  ],
  "firstAdded": "2014-06-17T23:34:47.898000",
  "hash": "639da2c6893b9c1cb68c069ba413b9a4cde1485e",
  "href": "http://en.christinesrecipes.com/2010/03/japanese-style-bacon-and-cheese-bread.html",
  "image": "http://4.bp.blogspot.com/_V0CoK16CILc/S4s9S9QaNuI/AAAAAAAAIWU/2tipphyUiCA/s800/%E8%8A%9D%E5%A3%AB%E7%85%99%E8%82%89%E9%BA%B5%E5%8C%85%20Bacon%20Cheese%20Bread.jpg",
  "ingredients": [
    "0",
    "Prepare a 10.5cm(W)x 20.5cm(L) x10cm(H) loaf tin",
    "Ingredients of Tangzhong (The amount is enough to make two loafs):",
    "1/3 cup bread flour",
    "1cup water (could be replaced by milk, or 50/50 water and milk)",
    "Ingredients of bread:",
    "2½ cups bread flour",
    "3tbsp+2tsp caster sugar",
    "1tsp salt",
    "1 large egg",
    "1tbsp+1tsp milk powder (to increase fragrance, optional)",
    "½cup milk",
    "120gm Tangzhong (use half of the Tangzhong you make from above)",
    "2 tsp instant yeast",
    "3tbsp butter (cut into small pieces, softened at room temperature)",
    "Fillings:",
    "bacon, to taste",
    "cheese, to taste"
  ],
  "keywords": [
    "prepare",
    "cmwx",
    "cml",
    "xcmh",
    "loaf",
    "tin",
    "tangzhong",
    "make",
    "loafs",
    "bread",
    "flour",
    "replaced",
    "water",
    "milk",
    "tbsptsp",
    "caster",
    "sugar",
    "salt",
    "egg",
    "increase",
    "fragrance",
    "use",
    "instant",
    "yeast",
    "butter",
    "pieces",
    "softened",
    "room",
    "fillings",
    "bacon",
    "cheese"
  ],
  "title": "Japanese Style Bacon and Cheese Bread (Tangzhong Method",
  "users": [
    null
  ]
}