{
  "__v": 1,
  "directions": [
    "0",
    "Preheat the oven to 190°C/170°C fan/ Gas 5 and line 2-3 baking trays with baking paper. First make the plain macaroons by sieving half the ground almonds and half the icing sugar together in a clean dry bowl.",
    "Whisk the egg whites until they form stiff peaks. Add the caster sugar and whisk until the mixture is stiff and glossy. Gently fold half the mixture into the ground almonds and icing sugar until evenly mixed keeping as much air in as possible. In a different bowl, repeat step 1 with the remaining ground almonds and icing sugar but this time sieve in the cocoa powder. Fold in the rest of the egg mixture.",
    "Place the macaron mixture into 2 separate disposable piping bags and snip off the end to make a hole about 1cm (½in) wide. Pipe 4 cm (1½in) circles of mixture onto the paper, spaced well apart. Leave to set for 15 minutes to allow a crust to form.",
    "Bake the macarons in the oven for 5 minutes, then gently lift the baking paper over to turn them upside down. Return to the oven for 6-8 minutes then leave to cool completely.",
    "For the fillings, lightly whip the cream, then split into 2 bowls. Stir the chestnut puree into one and the melted chocolate into the other. An hour before serving, sandwich the plain macarons with chestnut cream and the chocolate ones with chocolate cream. Dust with icing sugar."
  ],
  "firstAdded": "2014-11-03T19:04:05.671000",
  "hash": "a00cc6774b246591c20ec12d323031d412afb942",
  "href": "http://realfood.tesco.com/recipes/chestnut-and-chocolate-macarons.html",
  "image": "http://realfood.tesco.com/media/images/Chestnut&ChocMacaroons_HERO-45e31188-c008-48d0-87a2-ef318faae8b5-0-472x310.jpg",
  "ingredients": [
    "0",
    "Ingredients",
    "125g ground almonds",
    "250g icing sugar",
    "3 egg whites",
    "30g caster sugar",
    "10g cocoa powder"
  ],
  "keywords": [
    "almonds",
    "icing",
    "sugar",
    "egg",
    "whites",
    "caster",
    "cocoa"
  ],
  "title": "Chestnut and chocolate macarons recipe",
  "users": [
    null
  ]
}