{
  "hash": "4cb4abae7894477853a7304894c3cfccd9b40031",
  "title": "RUSTIC CABBAGE, POTATO & WHITE BEAN SOUP",
  "image": "https://farm6.staticflickr.com/5601/15238469789_dc31752b0e_c.jpg",
  "href": "http://thesimpleveganista.blogspot.com/2014/10/rustic-cabbage-potato-white-bean-soup.html",
  "extension": "Chrome",
  "firstAdded": "2015-06-20T07:55:09.855000",
  "users": [
    null
  ],
  "keywords": [
    "water",
    "olive",
    "grapeseed",
    "oil",
    "sauteing",
    "leeks",
    "use",
    "white",
    "pale",
    "green",
    "parts",
    "rinsed",
    "carrots",
    "stalks",
    "celery",
    "garlic",
    "herbs",
    "provence",
    "thyme",
    "rosemary",
    "oregano",
    "tomatoes",
    "broth",
    "medium",
    "gold",
    "potatoes",
    "head",
    "cabbage",
    "savoy",
    "beans",
    "cannellini",
    "great",
    "northern",
    "navy",
    "mineral",
    "salt",
    "cracked",
    "pepper",
    "parsley"
  ],
  "directions": [
    "0",
    "Prepare your vegetables. After slicing your leeks, be sure to place them in a colander and rinse them well under cool running water to remove any dirt and sand that may have collected between the leaf sheaths. If there's a lot of dirt, place sliced leeks in a bowl of cool water and gently swish the leeks around to dislodge any unwanted remnants. Drain water by gently tilting the bowl with one hand and holding your hand over the leeks with the other so they don't fall out, or simply drain into a colander. Repeat until leeks are clear of dirt and sand. Here is a good tutorial from, The Kitchn, on how to wash and prep your leeks. Lastly, another method you may try is this: Slice off the root and the dark green parts. Slice in half vertically. Run under cold running water, opening up the layers as you rinse. Lay on flat surface and slice thinly hortizontally.",
    "In a large dutch oven or stock pot, heat water/oil over medium to medium-high heat, add leeks, carrots and celery, saute for 5 minutes. Smells delicious already! Add garlic and spices, saute for 1 minute more or until fragrant. Add tomatoes, broth, potatoes, cabbage and beans, bring to a boil, cover, reduce heat to low and simmer for 30 minutes, until potatoes and cabbage are tender. Taste for seasoning adding salt & pepper as needed.",
    "Serve topped with parsley and a serving of socca or crusty bread. Enjoy!"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1/4 cup water or 2 tablespoons olive or grapeseed oil (for sauteing)",
    "2 leeks (use white & pale green parts), sliced and rinsed",
    "2 carrots, diced",
    "2 stalks celery, diced",
    "2 - 3 cloves garlic, minced",
    "1 tablespoon herbs de Provence OR 1 teaspoon each thyme, rosemary, oregano",
    "1 can (15oz) diced tomatoes",
    "6 - 7 cups vegetable broth or water",
    "2 medium gold potatoes, diced",
    "1/2 head large cabbage, sliced (savoy or green)",
    "3 cups cooked white beans or 2 cans (15oz), drained and rinsed (use cannellini, great northern or navy)",
    "mineral salt & fresh cracked pepper, to taste",
    "1/4 cup chopped parsley, to garnish"
  ],
  "__v": 1
}