{
  "hash": "956e03cc543214c301c5a27dfb8141b3a86e8bf3",
  "title": "Almond & Walnut Stuffed Pears",
  "image": "",
  "href": "http://www.drweilonhealthyaging.com/hya/ecs/subpage/recipedetail.html?docid=RCP00154",
  "extension": "Chrome",
  "firstAdded": "2016-01-26T03:31:08.026000",
  "users": [
    null
  ],
  "keywords": [
    "firm",
    "pears",
    "anjou",
    "bartlett",
    "walnuts",
    "almonds",
    "sugar",
    "egg",
    "white",
    "wine",
    "ingredient"
  ],
  "directions": [
    "0",
    "Preheat oven to 400°F. Coat a 7-by-11-inch or similar baking dish (just large enough to contain the pear halves) with cooking spray.",
    "Peel pears and cut in half lengthwise. Scoop out and discard the cores. Scoop out a bit more of the pulp at the center. To prevent tilting, flatten out the part that rests on the dish by cutting off a small slice. Put pear scraps in a food processor, along with walnuts, almonds,",
    "1⁄4 cup sugar and egg. Pulse until everything is well mixed but still has some texture.",
    "3. Spoon the nut mixture into the pear cavities and sprinkle with the remaining 1 tablespoon sugar. Place the pears in the prepared baking dish and pour wine around them.",
    "4. Bake the pears until they are tender and the filling is golden brown and firm to the touch, 40 to 50 minutes. Carefully transfer pears to a platter and pour remaining liquid into a saucepan. Cook, uncovered, over medium heat until syrupy, about 5 minutes. Serve the pears warm, with the syrup.",
    "Tip:",
    "Rub peeled pear halves with a lemon half to prevent discoloration.",
    "Ingredient Note:",
    "Good choices for sweet white wine include ice wine, late-harvest Riesling, sauterne and vin santo. You can also use dry red wine: add",
    "1⁄4 cup sugar and a pinch of cinnamon.",
    "Makes 4 servings."
  ],
  "ingredients": [
    "0",
    "4 firm ripe pears, such as Anjou or Bartlett",
    "1⁄4 cup chopped walnuts",
    "1⁄4 cup chopped almonds",
    "1⁄4 cup plus 1 tablespoon sugar",
    "1 large egg",
    "1 1⁄2 cups sweet white wine (see Ingredient Note)"
  ],
  "__v": 1
}