{
  "hash": "cf7fa1c2860f4f63094ea819ba84b9f0cf44576d",
  "title": "Pureed Red Pepper and Potato Soup",
  "image": "https://static01.nyt.com/images/2008/09/24/health/nutrition/25recipes.health.ready/25recipes.health.ready-articleLarge-v2.jpg",
  "href": "https://cooking.nytimes.com/recipes/1016457-pureed-red-pepper-and-potato-soup?join_cooking_newsletter=false&login=facebook",
  "extension": "Chrome",
  "firstAdded": "2017-03-29T19:50:31.603000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "PREPARATION",
    "Heat the olive oil over medium heat in a large, heavy soup pot and add the onion and carrot. Cook, stirring often, until the onion begins to soften, and add 1/2 teaspoon salt. Continue to cook, stirring often, until tender, about 5 minutes, and stir in the garlic and the tomato paste. Stir for a minute or two, until the garlic is fragrant and the tomato paste has darkened, and add the peppers, paprika, and another 1/2 teaspoon salt. Cook, stirring often, until the peppers begin to soften, about 5 minutes.",
    "Add the potatoes, stock, and bouquet garni and bring to a simmer. Add salt to taste, 1 to 2 teaspoons, cover and simmer over low heat for 1 hour. Remove the bouquet garni.",
    "Using an immersion blender, or in a blender or food processor fitted with the steel blade (working in batches and covering the blender lid or food processor with a kitchen towel to prevent the hot soup from splashing), blend the soup until smooth. Strain the soup through a medium strainer, pushing it through the strainer with a spatula or the bowl of a ladle, and return to the heat. Heat through, add salt and pepper to taste, and serve. Garnish with garlic croutons and slivered fresh basil or chopped thyme, and drizzle a few drops of olive oil over each serving if desired."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "2 tablespoons extra virgin olive oil, plus a drizzle for serving",
    "1 medium onion, chopped",
    "1 large carrot, peeled and chopped",
    "Salt, preferably kosher salt",
    "4 plump garlic cloves, green shoots removed, minced",
    "1 tablespoon tomato paste",
    "2 pounds (4 large) red bell peppers, seeded, membranes removed, cut in large dice",
    "2 teaspoons sweet paprika",
    "1 pound russet potatoes (about 2 medium), peeled and diced",
    "2 quarts chicken or vegetable stock",
    "A bouquet garni made with a bay leaf and a couple of sprigs each thyme and parsley, tied together in a bundle",
    "Freshly ground pepper",
    "Garlic croutons (toast thin slices of baguette and rub with a cut clove of garlic)",
    "Slivered basil leaves or chopped fresh thyme leaves"
  ],
  "__v": 1
}