{
  "hash": "3ef1ed17820ed516a6fd57dfa389150f08700600",
  "title": "Bizcocho invertido de piña y coco",
  "image": "http://static1.lasrecetascocina.com/wp-content/uploads/2014/07/Bizcocho-invertido-830x622.jpg",
  "href": "http://www.lasrecetascocina.com/bizcocho-invertido-de-pina-y-coco/",
  "extension": "Chrome",
  "firstAdded": "2015-06-16T13:13:39.710000",
  "users": [
    null
  ],
  "keywords": [
    "ingredientes",
    "lata",
    "pia",
    "almbar",
    "harina",
    "azcar",
    "aceite",
    "girasol",
    "yogur",
    "huevos",
    "sobre",
    "levadura",
    "coco",
    "rallado"
  ],
  "directions": [
    "0",
    "Elaboración",
    "Lo primero que haremos será precalentar el horno a 180ºC y, en un bol, vamos a batir los huevos junto al azúcar hasta que doblen su volumen (unos tres minutos). Luego agregamos el yogur y el aceite, volvemos a batir, lo justo para que se mezclen bien los ingredientes. Tamizamos la harina con la levadura y la añadimos a la mezcla, removemos con movimientos envolventes hasta que esté bien integrada.",
    "Ya que tenemos la masa lista vamos a preparar el molde. Cubrimos la base con papel sulfurizado y engrasamos todo con mantequilla. Yo utilizo un molde desmontable pero podéis usar otro sin problema. Cuando lo tengáis listo cortáis las rodajas de piña y las colocáis a vuestro gusto, en los huecos que queden añadimos coco rallado. Por último, vierte la masa del bizcocho y hornea durante 40 minutos a 180ºC.",
    "Cuando esté hecho deja enfriar y añádele el almíbar de la piña. Desmolda ¡Y a disfrutar!.",
    "Notas",
    "En lugar de piña se puede usar cualquier otra fruta como melocotón, fresas, manzana… ¡Lo que quieras!.",
    "Ten en cuenta el agua que contiene la fruta. Yo tuve la piña un rato sobre papel absorbente para que soltaran agua antes de meterlas en el horno con el bizcocho."
  ],
  "ingredients": [
    "0",
    "Ingredientes",
    "1 lata de piña en almíbar",
    "250 gr de harina",
    "250 gr de azúcar",
    "100 gr de aceite de girasol",
    "1 yogur",
    "3 huevos",
    "1 sobre de levadura",
    "Coco rallado"
  ],
  "__v": 1
}