{
  "hash": "bc7103dbbba0c03041db7447734ef9c3be003b4a",
  "title": "Tender & crisp chicken legs with sweet tomatoes",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/595_1_1350912582_lrg.jpg",
  "href": "http://www.jamieoliver.com/recipes/chicken-recipes/tender-and-crisp-chicken-legs-with-sweet-tomatoes/",
  "extension": "Chrome",
  "firstAdded": "2015-05-03T14:36:41.676000",
  "users": [
    null
  ],
  "keywords": [
    "higherwelfare",
    "chicken",
    "legs",
    "jointed",
    "salt",
    "black",
    "pepper",
    "bunch",
    "basil",
    "leaves",
    "picked",
    "stalks",
    "red",
    "yellow",
    "cherry",
    "plum",
    "tomatoes",
    "bulb",
    "garlic",
    "broken",
    "chilli",
    "olive",
    "oil",
    "tinned",
    "cannellini",
    "beans",
    "new",
    "potatoes",
    "scrubbed"
  ],
  "directions": [
    "0",
    "This recipe takes literally minutes to put together but then requires slow, gentle cooking. However, in return for your patience, what happens in the pan from just a couple of ingredients is an absolute joy and never fails, so it's a good one to serve if you have guests.",
    "Preheat your oven to 180°C/350°F/gas 4. Season your chicken pieces all over and put them into a snug-fitting pan in one layer. Throw in all the basil leaves and stalks, then chuck in your tomatoes. Scatter the garlic cloves into the pan with the chopped chilli and drizzle over some olive oil. Mix around a bit, pushing the tomatoes underneath. Place in the oven for 1½ hours, turning the tomatoes halfway through, until the chicken skin is crisp and the meat falls off the bone.",
    "If you fancy, you can add some drained cannellini beans or some sliced new potatoes to the pan and cook them with the chicken. Or you can serve the chicken with some simple mashed potato. Squeeze the garlic out of the skins before serving. You could even make it part of a pasta dish – remove the chicken meat from the bone and shred it, then toss into a bowl of linguini or spaghetti and serve at once."
  ],
  "ingredients": [
    "0",
    "4 higher-welfare chicken legs, jointed",
    "sea salt",
    "freshly ground black pepper",
    "1 big bunch fresh basil, leaves picked, stalks finely chopped",
    "2 big handfuls red and yellow cherry tomatoes and ripe plum tomatoes, cherry tomatoes halved, plum tomatoes quartered",
    "1 whole bulb garlic, broken into cloves",
    "1 fresh red chilli, finely chopped",
    "olive oil",
    "410 g tinned cannellini beans, drained, optional",
    "2 handfuls new potatoes, scrubbed, optional"
  ],
  "__v": 1
}