{
  "hash": "9343c2e1cc16e2c1accf4119660ac27161ea4287",
  "title": "Spicy Chicken Legs and Cauliflower Couscous with Cherries, Pistachios, and Mint",
  "image": "http://del.h-cdn.co/assets/15/32/640x640/square-1438813298-weeknight-dinner-chicken.jpg",
  "href": "http://www.delish.com/cooking/recipe-ideas/recipes/a43425/spicy-chicken-legs-cauliflower-couscous-recipe/?zoomable",
  "extension": "Chrome",
  "firstAdded": "2016-06-22T20:32:58.930000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "In a large bowl, whisk together rice vinegar, orange juice, Sriracha, garlic, soy sauce, honey, crushed red pepper, and 2 tablespoons olive oil until combined. Add chicken legs; let marinate 15 minutes.",
    "In a food processor fitted with a metal blade, pulse cauliflower florets until they reach the size of couscous.",
    "Heat 2 tablespoons olive oil in a large skillet and add cauliflower couscous. Cook until softened, 3 to 4 minutes. Season with salt and pepper. Transfer to a paper towel-lined plate and set aside.",
    "Meanwhile, preheat oven to 400 degrees F. Heat a lightly-oiled grill pan over medium-high heat. Remove chicken from marinade and season with salt and pepper. Grill chicken 4 minutes per side to get a nice char on the outside, then place pan in oven to finish cooking for 10 minutes or until it reaches an internal temperature of 165 degrees F. Let rest 5 minutes.",
    "In a large bowl, stir together cauliflower couscous, cherries, mint, pistachios, lemon zest, and remaining 1 tablespoon olive oil. Season with salt and pepper and garnish with mint.",
    "Serve chicken legs with couscous and lemon wedges."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1/4 c. rice vinegar",
    "1/4 c. freshly squeezed orange juice",
    "2 tbsp. sriracha",
    "2 cloves garlic, minced",
    "2 tbsp. soy sauce",
    "2 tbsp. honey",
    "1 tsp. crushed red pepper flakes",
    "5 tbsp. extra-virgin olive oil, divided",
    "4 whole skin-on chicken legs, about 8-oz. each",
    "1 head cauliflower, cut into florets",
    "kosher salt",
    "Black pepper",
    "25 cherries, pitted and finely chopped (1/2 c.)",
    "1/4 c. chopped mint, plus more for garnish",
    "1/4 c. chopped toasted pistachios",
    "1 tbsp. lemon zest",
    "Lemon wedges"
  ],
  "__v": 1
}