{
  "hash": "d66d92ae2e0d927808ced96123fbf81211ffcaf9",
  "title": "Pepperoni Pizza Spaghetti Squash Boats",
  "image": "//www.everydaymaven.com/wp-content/uploads/2015/10/IMG_7464.jpg",
  "href": "http://www.everydaymaven.com/2015/pepperoni-pizza-spaghetti-squash-boats/",
  "extension": "",
  "firstAdded": "2016-01-01T15:25:52.383000",
  "users": [
    null
  ],
  "keywords": [
    "medium",
    "spaghetti",
    "squash",
    "lengthwise",
    "seeds",
    "roasted",
    "microwave",
    "favorite",
    "brand",
    "pizza",
    "horizon",
    "organic",
    "mozzarella",
    "cheese",
    "pieces",
    "nitritefree",
    "pepperoni",
    "rounds",
    "parmesan",
    "locatelli",
    "red",
    "pepper"
  ],
  "directions": [
    "0",
    "Move oven rack to high position (if Broiler is at the top). Preheat oven to Broil. Line a baking sheet with tin foil and set each cooked squash half (cut side up) on baking sheet. Use a fork to gently scrape the squash into spaghetti-like strands.",
    "Use ½ cup pizza sauce per squash half (you may need more if your squash are on the large side) and mix in until most of the spaghetti strands are coated. Sprinkle ½ cup shredded mozzarella per squash half (again, you may need more based on squash size) and top with pepperoni rounds.",
    "Place baking sheet into broiler and broil 3 to 6 minutes until cheese is melted and starting to brown. Broil time will be affected by the type of broiler you have (low or high) so watch it carefully the first time so they don't burn.",
    "Remove, allow to cool for 5 minutes, serve with grated Parmesan and crushed red pepper flakes on the side and Enjoy!"
  ],
  "ingredients": [
    "0",
    "1 medium spaghetti squash, halved lengthwise, seeds removed and roasted (or cooked in the microwave)",
    "1 cup your favorite brand pizza sauce",
    "1 cup Horizon Organic Shredded Mozzarella Cheese",
    "12 to 15 pieces small nitrite-free pepperoni rounds",
    "grated Parmesan or Locatelli for serving (optional)",
    "crushed red pepper flakes for serving (optional)"
  ],
  "__v": 1
}