{
  "hash": "143601ecf6c087f64325cdd8ab7dccde8e9b455f",
  "title": "Bang Bang Chicken: The Authentic Sichuan Version",
  "image": "https://thewoksoflife.com/wp-content/uploads/2018/08/bang-bang-chicken-10.jpg",
  "href": "https://thewoksoflife.com/2018/08/bang-bang-chicken-sichuan/",
  "extension": "Chrome",
  "firstAdded": "2018-08-28T21:23:43.236000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "First, poach the chicken. In a small pot, add 2 cups water, 3 slices ginger and 1 scallion. Bring it to a boil, then add in the chicken breast. Once the water boils again, put the lid on and turn the heat to the lowest setting. Cook for 10-12 minutes. The chicken breast is done if the juice comes out clear when you poke the middle with a chopstick. Transfer the chicken breast to an ice bath to stop the cooking process and keep the chicken moist. Don’t discard the cooking water, as we’ll be using it later in the recipe.",
    "Second, assemble the plate. Julienne the cucumber and spread it in an even layer on a shallow plate. Now, hammer the chicken with a rolling pin to flatten the meat and break it up into shreds. Layer the chicken on top of the cucumber.",
    "Third, prepare the sauce. Mix together the following: ½ cup chicken stock (i.e., the cooking water from the chicken), 2 tablespoons light soy sauce, 4 teaspoons Chinese dark vinegar, 2 tablespoons sugar, 1½ tablespoons sesame oil, 1 tablespoon chili oil (or to taste), 2 tablespoons toasted sesame seeds, 1 teaspoon ground Sichuan peppercorn, ½ teaspoon salt, and 2 tablespoons finely chopped scallions.",
    "Finally, pour the sauce over the chicken and cucumber, and serve. Toss the chicken and cucumber to coat with the sauce just before you’re ready to dig in!"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 large chicken breast (or 2 smaller ones), about ½ lb",
    "3 slices ginger",
    "1 scallion, plus 2 tablespoons finely chopped scallions",
    "½ seedless cucumber, julienned",
    "½ cup chicken stock (i.e., the cooking water from the chicken)",
    "2 tablespoons light soy sauce",
    "4 teaspoons Chinese dark vinegar",
    "2 tablespoons sugar",
    "1½ tablespoons sesame oil",
    "1 tablespoon chili oil (or to taste)",
    "2 tablespoons toasted sesame seeds",
    "1 teaspoon ground Sichuan peppercorn",
    "½ teaspoon salt"
  ],
  "__v": 1
}