{
  "__v": 1,
  "directions": [
    "0",
    "In a food processor, pulse the yogurt, 1/4 cup of olive oil, garlic, and 2/3 cup of the peas until combined. Set aside.",
    "Using a julienne slicer for thin strands or a regular vegetable peeler for wider ribbons, slice the squash. It can be a little tricky. Work around the squash as you make your way towards the center of the vegetable. You may lose some of the squash in slicing. So it goes!",
    "Warm two tablespoons of olive oil In a large skillet over medium-low heat. Add the squash and saute until just soft, about 3 to 4 minutes, stirring occasionally. You may have to cook the squash in two batches.",
    "While the squash cooks, warm the remaining two tablespoons of olive oil over medium heat in a small skillet. Add the pine nuts and chile flakes. Cook, stirring often, until the pine nuts are golden brown, about 4 minutes. Set aside.",
    "Add the yogurt sauce to a large mixing bowl. Toss the squash pasta carefully with the sauce. Add the remaining peas, fresh basil leaves, Feta, and the toasted pine nuts. Add 1/2 to 1 teaspoon of sea salt, according to taste, along with a generous sprinkle of cracked pepper. Give another careful toss. Best served immediately."
  ],
  "firstAdded": "2014-06-18T15:53:03.850000",
  "hash": "9613391534141071f52646583f88e0f02fd557c1",
  "href": "http://theyearinfood.com/2013/09/squash-pasta-with-yogurt-peas-and-chile-facing-that-open-space.html",
  "image": "http://farm4.staticflickr.com/3701/9716680383_96fb3c064b_o.jpg",
  "ingredients": [
    "0",
    "2 cups yogurt",
    "1/2 cup olive oil",
    "4 cloves garlic, minced or pressed",
    "2 cups fresh or frozen peas",
    "1.5 – 2 pounds summer squash of choice",
    "1/2 cup pine nuts",
    "1/2 – 1 teaspoon chile flakes",
    "1 cup fresh basil leaves, torn",
    "8 ounces Feta cheese, crumbled",
    "Sea salt",
    "Cracked black pepper"
  ],
  "keywords": [
    "yogurt",
    "olive",
    "oil",
    "garlic",
    "pressed",
    "frozen",
    "peas",
    "summer",
    "squash",
    "pine",
    "nuts",
    "chile",
    "basil",
    "leaves",
    "torn",
    "feta",
    "cheese",
    "crumbled",
    "salt",
    "cracked",
    "black",
    "pepper"
  ],
  "title": "SQUASH PASTA WITH YOGURT, PEAS AND CHILE",
  "users": [
    null
  ]
}