{
  "hash": "e4cccef8227e8c403328c464c31edb3845598183",
  "title": "Sticky Pecan Rolls [Vegan, Gluten-Free]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/03/Sticky-pecan-rolls.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/sticky-pecan-rolls/",
  "extension": "",
  "firstAdded": "2015-04-06T14:20:20.321000",
  "users": [
    null
  ],
  "keywords": [
    "unscented",
    "coconut",
    "oil",
    "brushing",
    "tin",
    "vegan",
    "sugar",
    "cinnamon",
    "recipe",
    "allpurpose",
    "puff",
    "pastry",
    "dough",
    "butter",
    "pecans",
    "agave",
    "nectar",
    "makes",
    "glutenfree",
    "baking",
    "flour",
    "oat",
    "arrowroot",
    "salt",
    "active",
    "dry",
    "yeast",
    "xanthan",
    "gum",
    "roomtemperature",
    "milk",
    "chilled",
    "canola",
    "rice",
    "granular",
    "sunflower",
    "lecithin",
    "lemon",
    "juice"
  ],
  "directions": [
    "0",
    "In a medium bowl, whisk together the flours, arrowroot, sugar, salt, yeast, xanthan gum, and baking powder. Pour in the coconut milk and oil and, using a rubber spatula, stir until a thick dough forms. If the dough is too dry, add lukewarm water 1 tablespoon at a time. Wrap the dough in plastic and refrigerate for 2 hours.",
    "Put the dough and the butter into a food processor and pulse until the dough is freckled with quarter-size pieces of butter. Wrap the dough in plastic and refrigerate for 1 more hour.",
    "1",
    "Line a shallow pan, such as a loaf pan, with parchment paper and set aside.",
    "In a liquid measuring cup, combine the coconut oil and canola oil, stir gently, and set aside.",
    "In a blender or food processor, combine the rice milk, coconut milk, agave nectar, sunflower lecithin, salt, and xanthan gum and blend for 1 minute. Very slowly add half of the oil mixture, followed by the lemon juice, and then the remaining oil mixture. Blend for 1 more minute.",
    "Pour the mixture into the prepared pan and refrigerate until solid, about 3½ hours. Chop the butter into 1-inch cubes and store in an airtight container for up to 7 days.",
    "2",
    "Preheat the oven to 375°F. Brush 8 cups of a 12-cup muffin tin lightly with oil and set aside.",
    "In a small bowl, whisk together the sugar and cinnamon. Set aside.",
    "Between 2 pieces of parchment paper, roll out the pastry dough into a large 15 by 7-inch rectangle. Remove the parchment paper and cut the dough in half lengthwise. Brush each side with 2½ tablespoons of the melted butter, sprinkle with the cinnamon-sugar, and top with ¾ cup of the pecans (if using), dividing them evenly between the two pieces of dough. Roll each side into a log and cut into 3-inch slices. Put each slice into a muffin cup. Brush with the remaining 3 tablespoons butter, followed by the agave nectar, and then top with the remaining ¼ cup pecans.",
    "Bake for 12 minutes, and then rotate the pan 180 degrees. Bake until golden brown, 10 minutes. Let the pecan rolls cool in the muffin tin for 10 minutes before serving."
  ],
  "ingredients": [
    "0",
    "Melted unscented coconut oil, for brushing the tin",
    "½ cup vegan sugar",
    "2 teaspoons ground cinnamon",
    "1 recipe All-Purpose Puff Pastry Dough (below)",
    "½ cup melted “butter” (below)",
    "1 cup chopped pecans (optional)",
    "¼ cup agave nectar",
    "1",
    "makes 1 1⁄4 pounds",
    "2 cups Gluten-Free All-Purpose Baking Flour",
    "½ cup gluten-free oat flour",
    "1¼ cups arrowroot",
    "¹⁄³ cup vegan sugar",
    "2 teaspoons salt",
    "2¼ teaspoons active dry yeast",
    "2 teaspoons xanthan gum",
    "1 teaspoon baking powder",
    "1¾ cups room-temperature coconut milk",
    "½ cup melted unscented coconut oil",
    "1 cup plus 2 tablespoons chilled vegan butter",
    "2",
    "1½ cups melted unscented coconut oil",
    "1 cup canola oil",
    "¾ cup rice milk",
    "¼ cup coconut milk",
    "1 teaspoon agave nectar",
    "2 tablespoons granular sunflower lecithin",
    "1 tablespoon salt",
    "2 teaspoons xanthan gum",
    "1 tablespoon fresh lemon juice"
  ],
  "__v": 1
}