{
  "hash": "fb4668b1c919a374f2699db737a3dce47474ae8e",
  "title": "Roasted Apple Butter",
  "image": "https://images.food52.com/mhC59eLjXp409C9hPllCjImt8_s=/753x502/6bded758-f169-4935-b469-f4803af67e93--IMG_6203.jpg",
  "href": "https://food52.com/recipes/23998-roasted-apple-butter",
  "extension": "Chrome",
  "firstAdded": "2018-01-02T17:12:16.891000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400°. Cut apples into large chunks (quarters for small apples, eighths for larger). Arrange on a large metal roasting pan, add the 1/4 cup of cider and lemon juice, then sprinkle with brown sugar and salt and dot with butter.",
    "Roast for 30–35 minutes, or until apples are very soft and fall apart at the touch of a fork. Remove from oven and let rest for one minute, then pour the remaining 3/4 cup of cider over the pan. (This will help deglaze the pan and pick up the maximum amount of yummy caramelized flavor. Be careful when you pour, though, as it will sputter and steam a bit.)",
    "Transfer apples and liquid to a large flat-bottomed bowl or pot. Mash with a spoon, fork, or potato masher until the pieces have been broken up into sauce.",
    "Run the mixture through a food mill to remove the cores, seeds, and peels (see note above if you do not have a food mill). Stir in the spices, then give it a taste. Add more sweetener and/or spices until you have the flavor where you want it.",
    "At this point, assess the consistency of your butter. If you’d like it to be a bit smoother, you can blend it up with a food processor or an immersion blender. (I like mine with a little bit of texture, so I leave it as is.) If it isn’t quite as thick as you’d like it to be, transfer it a heavy bottom saucepan and cook over low heat, stirring occasionally, until you’ve achieved the right consistency. (Beware of cooking it down too much though, as you can wind up with a very heavy, intense butter. I like mine at the point where it just holds its form when stirred or spread. When it cooks down more than this, I find it develops an overwhelming pectin texture, which isn’t my favorite.)",
    "Once cooled, store in an airtight container in the fridge for up to a week, or freeze it to keep it for longer."
  ],
  "ingredients": [
    "0",
    "1 cup cider, divided into 1/4- and 3/4-cup amounts",
    "7 tablespoons dark brown sugar",
    "1 teaspoon lemon juice",
    "1 pinch kosher salt",
    "2 tablespoons unsalted butter, cut into small cubes",
    "3 pounds apples",
    "1/2 teaspoon cinnamon",
    "1 pinch nutmeg",
    "1 pinch cloves"
  ],
  "__v": 1
}