{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 350°F. Toast barley on a rimmed baking sheet until light golden brown and fragrant, 8–10 minutes. Set aside.",
    "Bring broth to a boil in large saucepan; reduce heat to low and keep broth warm. Heat 1 tablespoon butter in a large skillet over medium heat. Add onion, season with salt and pepper, and cook, stirring often, until softened and translucent, about 5 minutes.",
    "Add barley, thyme, bay leaf, and 2 cups warm broth to skillet and bring to a boil. Reduce heat and simmer, stirring often, until broth is almost absorbed, about 5 minutes. Add remaining broth by ½-cupfuls, allowing it to be absorbed before adding more and stirring often, until barley is tender and mixture is creamy, 40–50 minutes (you may not use all the broth). Remove bay leaf.",
    "Meanwhile, cook spinach and parsley in a large pot of boiling salted water until leaves are bright green and just wilted, about 5 seconds. Drain; transfer to a bowl of ice water and let cool. Drain and squeeze well to remove excess water.",
    "Coarsely chop spinach and parsley, then purée with oil and a splash of water in a blender, adding more water as needed, until smooth. Set spinach purée aside.",
    "Mix garlic, lemon zest, and lemon juice into barley mixture, then mix in Parmesan ¼-cupful at a time, stirring until melted and well combined before adding more. Mix in remaining 2 tbsp butter. Remove barley risotto from heat and mix in spinach purée and herbs; season with salt and pepper."
  ],
  "firstAdded": "2014-06-18T14:17:07.543000",
  "hash": "11f14c96de775cc7268f9d77aae6c82a7d1c8247",
  "href": "http://www.lottieanddoof.com/2014/04/toasted-barley-risotto-with-spinach-and-herb-puree/",
  "image": "http://www.lottieanddoof.com/wp-content/uploads/2014/04/IMG_2321.jpg",
  "ingredients": [
    "0",
    "1 cup pearled, hulled, or hull-less barley",
    "8 cups low-sodium vegetable broth (I used 4 cups of low-sodium broth ,mixed with 4 cups of water)",
    "3 tablespoons unsalted butter, divided",
    "1 medium onion, finely chopped",
    "Kosher salt and freshly ground black pepper",
    "2 teaspoons chopped fresh thyme",
    "1 bay leaf",
    "½ bunch spinach, thick stems removed (about 2 cups)",
    "½ bunch flat-leaf parsley, thick stems removed (about 1 cup)",
    "2 tablespoons olive oil",
    "1 garlic clove, finely grated",
    "1 teaspoon finely grated lemon zest",
    "1 tablespoon lemon juice",
    "1 cup finely grated Parmesan cheese",
    "⅓ cup chopped chives"
  ],
  "keywords": [
    "pearled",
    "hulled",
    "hullless",
    "barley",
    "used",
    "lowsodium",
    "broth",
    "mixed",
    "water",
    "unsalted",
    "butter",
    "divided",
    "medium",
    "onion",
    "kosher",
    "salt",
    "black",
    "pepper",
    "thyme",
    "bay",
    "leaf",
    "bunch",
    "spinach",
    "stems",
    "flatleaf",
    "parsley",
    "olive",
    "oil",
    "garlic",
    "clove",
    "lemon",
    "zest",
    "juice",
    "parmesan",
    "cheese",
    "chives"
  ],
  "title": "Toasted Barley Risotto with Spinach and Herb Purée",
  "users": [
    null
  ]
}