{
  "hash": "6281d212d2830da803913d35354bc853d0460822",
  "title": "Carnitas",
  "image": "https://patijinich.com/wp-content/uploads/2014/01/carnitas-912x622.jpg",
  "href": "https://patijinich.com/recipe/carnitas/",
  "extension": "Chrome",
  "firstAdded": "2017-10-29T11:26:08.821000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In the jar of a blender, place the water, onion, garlic cloves, marjoram, thyme, black pepper, cumin, stemmed whole cloves and 1 tablespoon salt. Puree until smooth.",
    "Set a large Dutch oven or heavy casserole over medium-high heat. Add the lard (or vegetable shortening or oil), and once it has heated up, add the pork chunks and sprinkle in 1/2 teaspoon of salt. Brown the meat on all sides, stirring and flipping as each side browns, about 10 minutes.",
    "Pour the onion mixture over the meat, let it come to a simmer and cook for 5 to 6 minutes. Pour in the orange juice and sweetened condensed milk, add the 2 bay leaves, and give it a good stir. Let it come to a simmer, then reduce heat to medium-low to low and cover.",
    "Cook covered, stirring and scrapping the bottom of the casserole 2 to 3 times along the way, until the meat is completely cooked and coming easily apart if you pull one piece, about one hour and a half. Remove the lid, cook for another 4 to 5 minutes. Scoop out the carnitas with a slotted spoon, leaving any fat behind, and serve in a bowl or platter. Shred with a fork, if desired, before tucking into tacos. Or do like we do, serve straight from the pot.",
    "Serve with warm corn tortillas and pickled jalapeños or salsa verde cruda on the side."
  ],
  "ingredients": [
    "0",
    "Half a white onionpeeled and coarsely chopped",
    "1 1/2cupswater",
    "6clovesgarlic",
    "1teaspoondried marjoram",
    "1teaspoondried thyme",
    "1teaspoonfreshly ground black pepper",
    "Pinch cumin",
    "4whole clovesstems removed",
    "1tablespoonkosher or coarse sea saltor to taste",
    "1tablespoonlardvegetable shortening or oil",
    "4 to 5poundsboneless pork shoulder or buttcut into 4-inch chunks, fat on!",
    "1/2teaspoonkosher or coarse sea salt",
    "2bayleaves",
    "1cupfreshly squeezed orange juice",
    "2tablespoonssweetened condensed milk"
  ],
  "__v": 1
}