{
  "hash": "403758fbcdb3a8d98440b6236c365c4713ee5634",
  "title": "Cast-Iron Pan Pizza",
  "image": "",
  "href": "http://www.bonappetit.com/test-kitchen/how-to/article/pan-pizza-video",
  "extension": "Chrome",
  "firstAdded": "2017-07-03T20:47:46.687000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "First, you'll need to preheat the oven to 525˚—or as hot as it'll go. (Don't broil it, though, as that would burn the cheese in a heartbeat.) Then, get out one 1-pound package of store-bought dough. If your local pizzeria sells it fresh, get that stuff. If not, the grocery store variety is totally fine. Remove it from the packaging and stretch the dough out, working it into a flattened round.",
    "Then, set a 9-12\" cast-iron pan over a burner set to medium-high. You want to preheat the pan so it's hot but not smoking (just watch your hands—and don't grab the handle!). Although any size pan is really fine, keep in mind that the smaller the pan, the thicker the crust will be. If deep dish-style pizza is your jam, go for the 9\". If you want a crispier crust, use a larger pan. Sprinkle the hot pan with cornmeal and flour, and set the dough snugly in the pan (again, watch your digits). Pull the sides of the dough up the sides of the pan so it doesn't slump back down, being sure to distribute the dough evenly for no thin patches. Brush the top of the dough with olive oil and let it start cooking over the burner.",
    "Once the dough starts to bubble, season with salt and pepper and add 2-3 ounces of your favorite marinara sauce. Have a batch the homemade stuff on hand? Great; use that. If not, reach for a store-bought jar. Spread the marinara over the dough, and don't worry about leaving too much space for a crust. This baby is supposed to be messy—besides, the tomato caramelizes at the edges, making every bite packed with flavor. Top with 2-3 cups grated mozzarella cheese, depending on how gooey you like things.",
    "Slide that pizza into the oven and let it bake for 10-15 minutes until the cheese is melted, bubbling, and golden. Brush the crust with a mix of honey, chile flakes, and water (to thin the honey). The spicy honey will lacquer the crust. Let it rest a few minutes, top the cheese with fresh torn basil leaves, and slice. And… that's it. Seriously, it's that easy. And, uh, cheesy."
  ],
  "ingredients": [
    "0",
    "one 1-pound package of store-bought dough"
  ],
  "__v": 1
}