{
  "hash": "8b1651cb64cb88339cb4edd2b2731e2a1b311d01",
  "title": "Homemade Gnocchi",
  "image": "",
  "href": "http://keepinitkind.com/homemade-gnocchi/",
  "extension": "Chrome",
  "firstAdded": "2017-04-22T21:48:58.597000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 400. Place the russet potatoes on the baking sheet. Bake in the preheated oven for 1 hour or until easily pierced with a fork. Remove from oven and slice each of them in half lengthwise.",
    "Bring a large pot of water to a boil. I like to use an 8qt. pot and fill it most of the way with water. Add a bit of salt to the water.",
    "Once the potatoes are cool enough to touch (don't let them cool completely. You want them to be as warm as possible but still be able to handle them), peel the skins from the potato and place the insides in a large bowl.",
    "It is best to run the potatoes through a ricer, but you can mash them or even puree them in a food processor. I usually just opt to mash them and I mash for a long time. When I'm done, it's pretty smooth. Add olive oil (totally optional), salt and pepper to the potatoes according to your taste.",
    "Add flour to the mashed potato in 1/4 cup intervals, using your hands to work the flour in with each addition. You want to use as little flour as possible to achieve a perfect ball of dough. Once you think you have the right consistency, tear off a tiny piece, roll it into a ball and drop it into the boiling water. If it rises to the top without falling apart, that's good but you still want to taste it. If it tastes gummy, add flour to the dough by the tablespoon until you get a firmer dough.",
    "You can turn the boiling water down to low while you form the gnocchi because this will take a little while.",
    "Turn the dough out onto a floured surface. Tear a piece off and roll into a long rope about 3/4 inch in diameter. Cut the rope in half, then with the two ropes next to each other, slice them into 1/2 inch \"pillows.\"",
    "Use a fork or a gnocchi board to shape the gnocchi. Use your thumb to roll it down to the end. You will get ridges on once side and a \"dimple\" on the other side which holds whatever sauce you cook it in. Repeat until the entire ball of dough has been rolled into gnocchi.",
    "Turn the water back up to a boil. Line two baking sheets with parchment paper.",
    "In batches, drop the gnocchi into the boiling water. They will dance around for awhile but once they rise to the top and stay there for a couple of seconds, they are done. Use a slotted spoon to remove (Don't let them hang at the top of the water for more than a few seconds). Place the gnocchi on the lined baking sheets, making sure that none are touching.",
    "You can now serve them in whatever gnocchi recipe you desire, or you can store them for later. Enjoy!",
    "Once the gnocchi have cooled, place the baking sheet(s) in the freezer. Once they are frozen, transfer them to an airtight container and freeze until ready to use. They will keep in the freezer for 1-2 months."
  ],
  "ingredients": [
    "0",
    "4 russet potatoes (other potatoes will work, but you may want to switch to bread flour if you use anything else)",
    "1 - 1 1/2 cups whole wheat flour",
    "1 tablespoon olive oil (optional)",
    "salt and pepper to taste",
    "water"
  ],
  "__v": 1
}