{
  "hash": "ae16c0bccdfb724a9e29b32bd3be0daf672098e1",
  "title": "Spaghetti With Sausage and Peppers",
  "image": "http://cdn-image.myrecipes.com/sites/default/files/styles/300x300/public/image/recipes/sl/08/02/spaghetti-sausage-sl-1704073-x.jpg?itok=9SzFJo0Y",
  "href": "http://www.myrecipes.com/recipe/spaghetti-with-sausage-peppers",
  "extension": "Firefox",
  "firstAdded": "2016-04-01T17:56:09.364000",
  "users": [
    null
  ],
  "keywords": [
    "uncooked",
    "spaghetti",
    "mild",
    "italian",
    "sausage",
    "casings",
    "medium",
    "onion",
    "eighths",
    "mediumsize",
    "green",
    "bell",
    "pepper",
    "strips",
    "red",
    "yellow",
    "garlic",
    "olive",
    "oil",
    "tomatoes",
    "basil",
    "oregano",
    "salt",
    "parmesan",
    "cheese"
  ],
  "directions": [
    "0",
    "Prepare pasta according to package directions.",
    "Meanwhile, cook sausage in a large Dutch oven over medium-high heat 8 to 10 minutes or until meat is no longer pink, breaking sausage into pieces while cooking. Remove sausage and drippings from Dutch oven, and drain well on paper towels.",
    "Sauté onion and next 3 ingredients in hot oil in Dutch oven over medium-high heat 5 to 6 minutes or until vegetables are crisp-tender. Stir in tomatoes, salt, and pepper; cook 4 minutes or until thoroughly heated. Stir in sausage, pasta, and cheese. Transfer mixture to serving platter, and serve immediately.",
    "To freeze: Prepare recipe as directed. Cool 30 minutes. Place pasta mixture in a 13- x 9-inch baking dish. Cover tightly with plastic wrap and aluminum foil. Freeze up to 2 months. Thaw in refrigerator 24 hours. Preheat oven to 350°. Remove and discard plastic wrap and aluminum foil. Cover with aluminum foil, and bake at 350° for 40 to 45 minutes or until thoroughly heated.",
    "Turkey Spaghetti With Sausage and Peppers: Substitute 1 (1-lb.) package Italian turkey sausage for mild Italian sausage. Remove and discard casings from sausage. Increase olive oil to 2 Tbsp. Cook sausage in 1 Tbsp. hot oil as directed in Step 2. Discard any drippings in Dutch oven. Proceed with recipe as directed, sauteing onion and next 3 ingredients in remaining 1 Tbsp. oil."
  ],
  "ingredients": [
    "0",
    "8 ounces uncooked spaghetti",
    "1 (1-lb.) package mild Italian sausage, casings removed",
    "1 medium onion, cut into eighths",
    "1 medium-size green bell pepper, cut into strips",
    "1 medium-size red or yellow bell pepper, cut into strips",
    "2 to 3 garlic cloves, minced",
    "1 tablespoon olive oil",
    "1 (28-oz.) can diced tomatoes with basil, garlic, and oregano",
    "1/4 teaspoon salt",
    "1/4 teaspoon pepper",
    "1/2 cup grated Parmesan cheese"
  ],
  "__v": 1
}