{
  "hash": "e7f29b20fe205205b5558eaac55dda0ea23a87e1",
  "title": "Beef Stroganoff",
  "image": "https://i0.wp.com/pressureluckcooking.com/wp-content/uploads/2018/05/Beef-Stroganoff-2.jpg?w=1080&ssl=1",
  "href": "https://pressureluckcooking.com/recipe/instant-pot-beef-stroganoff/",
  "extension": "Chrome",
  "firstAdded": "2018-09-28T17:14:16.533000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cook the egg noodles on the stovetop according to package instructions while the meat’s cooking and strain and set aside (Note: you can also do this during Step 7 while the Stroganoff is pressure cooking, but just make sure you do it separately on the stove and don’t add the noodles directly into the pot while pressure cooking or they will absorb too much of the liquid and will become mushy)",
    "Season the meat with the kosher salt & pepper (about 1-2 tsp of each should be fine) and rub it in well",
    "Add the olive oil and butter to the Instant Pot and hit “Sauté” and adjust so it’s on the “More” or “High” setting. After about 3 minutes (and once the butter’s melted and oil’s bubbling), add in the meat and sear on all sides so it’s lightly browned (about 2-3 minutes total; the meat shouldn’t be fully cooked at all). Remove the meat with a slotted spoon and set aside in a bowl for the time being",
    "Now, add the onion to the pot with the already heated oil and butter and let cook for 2 minutes and then add the mushrooms and let cook for 3 minutes more. Then, add in the garlic and cook for another minute",
    "Next, add in the dijon mustard and seasoned salt, stir well and deglaze (scrape) the bottom of the pot so nothing’s stuck to it",
    "Lastly, add in the beef broth and thyme and stir well followed by adding back in the browned beef",
    "Secure the lid, hit the “Keep Warm/Cancel” button followed by the “Manual” or “Pressure Cook” button High Pressure for 7 minutes for firmer meat and 12 minutes for more tender meat. Do a quick release when done OR allow a 10 minute natural release (meaning you do nothing for 10 minutes when done and the timer count up to either “00:10” or “L0:10”) followed by a quick release if you wish it to be more tender – this goes for either cooking time you choose",
    "When the lid comes off, hit the “Keep Warm/Cancel” button and then hit “Sauté” again and adjust so it’s on the “More” or “High” setting. Bring the pot to a bubble and add in the cornstarch slurry and stir immediately. Then, add in the onion mix packet and let bubble for a minute and then turn the pot to “Keep Warm” so that the bubbles die down",
    "Once the bubbles have mostly subsided, add in the sour cream and Boursin. Stir well until they are both totally melded into the sauce and it will be ready!",
    "Place some noodles in individual bowls and then follow with some the beef and plenty of sauce",
    "Enjoy!"
  ],
  "ingredients": [
    "0",
    "12 oz package of wide ribbon-like egg noodles, boiled separately according to package",
    "1.5-2 lbs of beef stew meat/chuck cubes OR chuck roast cut into cubes",
    "Kosher salt, a few generous shakes for seasoning the meat",
    "Black pepper, a few generous shakes for seasoning the meat",
    "3 tbsp of olive oil",
    "2 tbsp of salted butter",
    "1 large yellow onion, diced",
    "16 oz of white mushrooms, sliced",
    "1 tbsp of crushed garlic",
    "1 tbsp of dijon mustard",
    "1 tsp of seasoned salt",
    "1.5 cups of beef broth",
    "1 tsp of dried thyme",
    "2 tbsp of cornstarch + 2 tbsp of water",
    "1 packet of dry onion dip/soup mix",
    "1 cup (8 oz) of sour cream",
    "5.2 oz of Boursin Garlic & Herb or 5 oz of a brick of cream cheese"
  ],
  "__v": 3
}