{
  "hash": "94c2272b4121c06c7fc5c25d191c1417c70cbb73",
  "title": "Arroz Con Gandules (Smaller Qty)",
  "image": "http://recipe-folder.com/img/recipe-images/008/506/391571408.jpg",
  "href": "http://recipe-folder.com/recipe/5eaf8593ce7e4d08309a3527",
  "extension": "User Added",
  "firstAdded": "2020-05-04T03:01:39.673000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat your caldero or Dutch oven to medium heat, and add your olive oil, bacon/ham (if using), and sofrito. Stir constantly until fragrant and tender, but not browned, about 2 minutes.",
    "1",
    "Next add in the Sazon, tomato sauce, and chicken bouillon. Stir to combine.",
    "2",
    "Add the oregano, cilantro (if using), bay leaves, olives (if using and water/broth. Allow the liquid to come up to a boil, and taste it for salt. If it needs more saltiness, add in another chicken bouillon cube. You want this liquid to be highly seasoned, as it will determine the final seasoning of the rice.",
    "3",
    "Add in the drained pigeon peas, then bring the mixture back up to a boil. Once the mixture is boiling, add the rice. Stir the rice to get it submerged and distribute the pigeon peas throughout.",
    "4",
    "Allow the rice to absorb all the visible liquid, uncovered. Once most of the visible surface liquid is absorbed, stir and cover the rice, lower the flame to low, and allow it to steam for 10-12.5 minutes. It's done with all the liquid is absorbed and the grains are fluffy and fully cooked.",
    "5",
    "https://www.delishdlites.com/?s=arroz+con+gandules",
    "6",
    "Notes: This recipe freezes very well, so make a big batch and portion it into storage bags for a quick weeknight side dish. To reheat, transfer into a microwave safe bowl and cover with plastic wrap. Microwave for a few minutes, stirring occasionally until the rice is hot & fluffy."
  ],
  "ingredients": [
    "0",
    "1/2 tablespoon olive oil",
    "1",
    "3 tablespoons (0.2 cup) country ham or bacon, diced (optional)",
    "2",
    "3 tablespoons (0.2 cup) sofrito homemade is best!",
    "3",
    "1.5 cups water or low sodium chicken broth",
    "4",
    "0.5 packet sazón con achiote y culantro",
    "5",
    "0.5 cube chicken bouillon or more if needed",
    "6",
    "3 tablespoons (0.2 cup) tomato sauce",
    "7",
    "1/2 teaspoon Italian seasoning",
    "8",
    "1/8 cup fresh cilantro, chopped optional",
    "9",
    "1 to 1.5 bay leaves",
    "10",
    "7.5 ounce can Pigeon Peas/Gandules drained and rinsed",
    "11",
    "1 cups parboiled rice"
  ],
  "__v": 1,
  "hidden": true
}