{
  "hash": "c19ea6540d901bfc1d5715fe65402df9fdfea29f",
  "title": "3 Ingredient Peanut Butter Mousse Frosting",
  "image": "http://cdn.minimalistbaker.com/wp-content/uploads/2013/12/3-Ingredient-Peanut-Butter-Mousse-and-Frosting-in-ONE-minimalistbaker.com_.jpg",
  "href": "http://minimalistbaker.com/3-ingredient-peanut-butter-mousse/",
  "extension": "Chrome",
  "firstAdded": "2015-03-08T12:39:47.393000",
  "users": [
    null
  ],
  "keywords": [
    "fat",
    "milk",
    "alternatively",
    "coconut",
    "cream",
    "salted",
    "natural",
    "creamy",
    "peanut",
    "butter",
    "agave",
    "nectar",
    "maple",
    "syrup",
    "sugar",
    "honey",
    "vegan"
  ],
  "directions": [
    "0",
    "Chill your coconut milk overnight. In the morning, without shaking or tipping, remove the lid and scoop out the solid cream from the top into a chilled bowl. Leave the liquid in the bottom of the can and reserve it for use in smoothies, baked goods, etc. (If your coconut milk didn't harden, see this post for tips on how to save it.)",
    "Using a mixer, beat until creamed together, light and fluffy - about 45 seconds.",
    "Add peanut butter, starting with 2 Tbsp and adding from there to desired taste.",
    "Add sweetener of choice to desired sweetness, observing that the more liquid you add the less firm the mousse will be.",
    "Either use immediately as a spreadable frosting, or chill for several hours to let it set and firm up as a mousse.",
    "Eat as a mousse topped with plain coconut whipped cream, bananas or chocolate sauce. Alternatively, use as a dip for fruit/baked goods. If using as a frosting, don't frost your muffins, cookies and cakes, etc., until just before serving as it needs to be chilled right up until serving.",
    "Reserve leftovers in a covered container in the fridge. Will keep for up to 1 week."
  ],
  "ingredients": [
    "0",
    "1 can full fat coconut milk (alternatively, 1/2 can coconut cream)*",
    "3-4 Tbsp salted, natural creamy peanut butter",
    "2-3 Tbsp agave nectar, maple syrup or powdered sugar (or honey if not vegan)"
  ],
  "__v": 1
}