{
  "hash": "9937998ee61d4b73e98841b053b7a54b3a75843a",
  "title": "VEGETARIAN EGGS BENEDICT",
  "image": "https://homemadehooplah.com/wp-content/uploads/2015/03/easyvegetarianeggsbenedict2d.jpg",
  "href": "https://homemadehooplah.com/easy-vegetarian-eggs-benedict/",
  "extension": "Chrome",
  "firstAdded": "2019-01-06T16:14:26.390000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "FOR THE HOLLANDAISE SAUCE",
    "In a small saucepan over medium heat, melt the butter, then set aside to cool, about 5 minutes.",
    "In a small bowl, whisk together egg yolks, lemon juice, cayenne powder, and salt.",
    "Whisking the egg mixture vigorously, slowly pour in the melted butter. Continue to whisk until sauce is thick and creamy.",
    "Loosely cover bowl and set aside while poaching eggs.",
    "FOR POACHING THE EGGS",
    "Watch this video on how to poach an egg - it's amazing! The following written instructions go over the same methods.",
    "Bring a large saucepan filled with water to a simmer, but not boiling. This means small bubbles on the bottom and very few bubbles breaking the surface. Depending on your cooking unit, this should happen on medium heat or between 240/260 degrees.",
    "Crack an egg into a small bowl, then set within easy reach of the saucepan.",
    "Using a large spoon, stir the simmering water so that it creates a small whirlpool in the center of the pot. Pick up the bowl with the raw egg and quickly drop the egg into the center of the whirlpool.",
    "Let the egg cook in the water, untouched, for 2 1/2 minutes. Using a slotted spoon, scoop the egg out of the water and gently touch the white and yolk. The whites should be firm but the yolk should move freely under the cooked surface.",
    "If needed or desired, you can cook the egg in the water for another 30 seconds to achieved the doneness you'd prefer.",
    "When finished with an egg, set aside until you're ready to add to a sandwich. Use a slotted spoon to remove any film on the top of the water and then repeat the poaching steps with the next egg.",
    "PUTTING IT ALL TOGETHER",
    "While the eggs are cooking, toast the English muffins and slice up the tomato and avocado.",
    "Assemble the sandwiches starting with a toasted English muffin, then a tomato slice, followed by avocado, then topped with a poached egg. Drizzle Hollandaise on top.",
    "Using a knife, gently break the surface over the yolk. Serve immediately."
  ],
  "ingredients": [
    "0",
    "HOLLANDAISE SAUCE",
    "4 egg yolk",
    "1 tbsp lemon juice",
    "1/2 cup unsalted butter",
    "1 pinch cayenne powder",
    "1 pinch salt",
    "---------------------------------",
    "4 large egg very fresh! *",
    "2 medium tomatoes",
    "1 ripe avocado",
    "4 English muffin"
  ],
  "__v": 2
}