{
  "hash": "fce56da37f31d084b81d723a7742b06107f3f34c",
  "title": "CHA-CHA-CHING CHILI",
  "image": "http://lh6.ggpht.com/_OaYG005JPDs/SssuEPGWzRI/AAAAAAAAAUM/vmKD1PrG0rk/s400/chili.jpg",
  "href": "http://www.budgetbytes.com/2009/05/cha-cha-ching-chili/",
  "extension": "Chrome",
  "firstAdded": "2016-02-12T15:17:38.902000",
  "users": [
    null
  ],
  "keywords": [
    "total",
    "recipe",
    "cost",
    "servings",
    "approx",
    "prep",
    "time",
    "min",
    "lean",
    "beef",
    "bottle",
    "juice",
    "tomatoes",
    "black",
    "beans",
    "kidney",
    "chili",
    "seasoning",
    "frozen",
    "corn",
    "kernels",
    "med",
    "yellow",
    "onion"
  ],
  "directions": [
    "0",
    "STEP 1: Brown the ground beef in a large pot over medium heat until no pink meat remains. Stir the meat well while it is cooking to break up large chunks and make sure all of it is cooked through.",
    "STEP 2: Add the diced (or roughly chopped if your knife skills are still lacking) yellow onion. Stir and cook until the onion is transparent.",
    "STEP 3: Add the contents of the chili seasoning packet, V8 juice, drained beans, tomatoes (not drained) and the frozen corn. Stir well.",
    "STEP 4: Continue to heat through, stirring occasionally. If the chili is too soupy for your tastes, just continue to let the chili cook and some of the liquid will evaporate. Be sure to stir every once in a while to prevent anything from sticking to the bottom of the pot. Once the chili is nice and hot, it is ready to eat!",
    "Sprinkle a little bit (approx. 1/4 cup shredded) cheddar cheese over the top of your bowl for an added $0.19 per serving!",
    "Notes: This recipe is endlessly adjustable! Use turkey, chicken or tempeh instead of beef. Dice up any vegetables that are in your fridge and add them to the pot (squash and bell peppers go really well). Change up the beans to suit your tastes or just use up what you have on your shelf… do whatever you want, the bottom line is that this chili is delicious and cheap!",
    "To round out this meal try making some corn muffins. A box of mix can usually be bought for less than 50¢. Just add milk (about 17¢/.5 cup) and one egg (about 22¢ ea) and you’ve got about 6 muffins for under a dollar. The whole meal, chili, muffin and cheese is less than $2! CHA-CHING!",
    "Be sure to immediately freeze any portion that you don’t think you will be able to eat within 4-5 days. Then, when you’re feelin’ in the chili mood again just take it out of the freezer and thaw in the microwave or over low heat in a sauce pan!",
    "ENJOY!"
  ],
  "ingredients": [
    "0",
    "Total Recipe cost: $9.80",
    "Servings Per Recipe: 8 (approx. 1 cup each)",
    "Cost per serving: $1.23",
    "Prep time: 5 min. Cook time: 20 min. Total: 25 min.",
    "INGREDIENTS\tCOST",
    "1 lb.\tlean ground beef\t$3.98",
    ".5 large bottle\tV8 juice\t$1.29",
    "1 can\tdiced tomatoes\t$1.24",
    "1 can\tblack beans\t$0.78",
    "1 can\tkidney beans\t$0.82",
    "1 packet\tchili seasoning\t$0.64",
    ".5 bag\tfrozen corn kernels\t$0.47",
    "1 med\tyellow onion\t$0.58",
    "TOTAL $9.80"
  ],
  "__v": 1
}