{
  "hash": "bb46bdd201f49b1a5f1219f76da79a32b67a65aa",
  "title": "flourless chocolate espresso olive oil cake with honey whipped ricotta.",
  "image": "https://www.halfbakedharvest.com/wp-content/uploads/2020/02/Flourless-Chocolate-Espresso-Cake-1-224x224.jpg",
  "href": "https://www.halfbakedharvest.com/flourless-chocolate-espresso-cake/",
  "extension": "Chrome",
  "firstAdded": "2020-03-24T16:55:25.640000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350 degrees F. Grease a 9-inch spring-form pan and line the bottom with parchment paper. 2. In a medium bowl, melt the dark chocolate and olive oil in the microwave until melted and smooth. Let cool 5 minutes. Whisk in the 5 egg yolks, sugar, cocoa powder, espresso powder, salt, and vanilla until combined.3. In a large bowl, using an electric mixer, whip the egg whites on medium speed until stiff peaks form. Fold half of the whipped egg whites into the chocolate mix until just combined, fold in the remaining egg whites. Gently stir in the chocolate chunks. Transfer the batter to the prepared pan, spreading it in an even layer. Bake 25-30 minutes, until the center is no longer jiggly. Remove from the oven and let sit 10 minutes.4. To make the honey whipped ricotta. In the bowl of a food processor, combine the ricotta, honey, and vanilla. Pulse until smooth and creamy, about 2-3 minutes. Taste, adding more honey if needed to sweeten. Store leftovers in an airtight container at room temperature for up to one week.5. Serve the cake warm or at room temp, dusted with cocoa powder and dolloped with honey whipped ricotta. Store leftovers in an airtight container at room temperature for up to one week."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "7 ounces dark chocolate (75% - 85% dark)",
    "1/2 cup extra virgin olive oil",
    "5 large eggs, separated",
    "3/4 cup granulated sugar",
    "2 teaspoons espresso powder",
    "1/2 teaspoon kosher salt",
    "1 tablespoon vanilla extract",
    "¼ cup unsweetened cocoa powder",
    "2 ounces semi-sweet or milk chocolate chunks",
    "WHIPPED RICOTTA",
    "2 cups whole milk ricotta cheese",
    "2 tablespoons honey",
    "2 teaspoons vanilla extract"
  ],
  "__v": 1
}