{
  "hash": "e25b42e1154eeec7edc85704c8db84efd2b841d0",
  "title": "GENERAL TSO'S CHICKEN",
  "image": "http://img.sndimg.com/food/image/upload/w_707,h_398,c_fill,fl_progressive,q_80/v1/img/recipes/16/47/06/lSfuBJlS6WKSVp6VUkAy_general-tsos-chicken-4.jpg",
  "href": "http://www.geniuskitchen.com/recipe/general-tsos-chicken-164706?photo=cGhvdG8tMzg2MzYy&ftab=reviews",
  "extension": "Chrome",
  "firstAdded": "2018-02-10T02:44:56.167000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "Place sauce ingredients in a quart jar with a lid and shake to mix. If you make this ahead of time just refrigerate until needed, shaking it again when you are ready to use it. This also keeps your dirty dishes down.",
    "Mix cornstarch slurry in a large bowl- the mixture will be strange but trust me it works. It will be VERY thick almost paste like. Add ALL the chicken pieces and stir to coat. Using a fork remove ONE chicken piece at a time and let the excess mixture drip off. YES even though the mixture has a weird consistency it will not stick like paste and the excess will drip off. Add chicken to the hot (350 degree) oil and fry until crispy. Only cook 7 or 8 chicken pieces at a time. You do not want to lower the temp of the oil by cooking too many at a time. You can use a simple cooking or candy thermometer to judge the temp of the oil.",
    "Drain on paper towels. Want them extra crispy? Put them on a rack over a sheet pan. Keep warm- I just put them in the oven with the oven off. Repeating until all chicken is fried.",
    "In a separate wok or large skillet add a small amount of oil and heat to 400 degrees. Again, a candy thermometer works great. (Want less dishes? You can just drain the oil after you fry all the chicken, leave a small amount (about a tsp) in the pan and use the same pan if you like.)",
    "Add green onions and hot peppers and stir fry about 30 seconds.",
    "Stir (or shake jar) sauce mixture, and then add to pan with onions and peppers, cook until thick. Some reviews didn't kniw what \"thick\" meant. Thick like the same sauce you get at a restaurant.you want it to just coat the chicken. If it gets too thick, add a little water or other liquid. The thickness of the sauce should be similar to what you get when ordering this at a restaurant.",
    "Add chicken to sauce in wok and heat just until the chicken is hot enough for you. It may not even need a minute if you kept the chicken warm. The quicker you serve it the crispier the chicken stays.",
    "Don't be scared by any negative reviews. It's not rocket science though if you have never cooked with a cornstarch slurry it may feel like an experiment. Trust yourself! You've got this! If you have any doubts reread the recipe and get everything in order before you start to cook. I promise you will thank yourself and maybe even me! Enjoy!",
    "Oh it's great served over rice!"
  ],
  "ingredients": [
    "0",
    "READY IN: 40mins\tSERVES: 8",
    "UNITS: US",
    "INGREDIENTS Nutrition",
    "3 lbs boneless skinless chicken breasts, cut into chunks",
    "2 cups green onions, sliced",
    "8 small dried chilies, seeds removed (bird pepper or thai chilies are good)",
    "CORNSTARCH SLURRY",
    "1⁄4 cup soy sauce, low sodium preferred",
    "1 egg, beaten",
    "1 cup cornstarch",
    "SAUCE",
    "1⁄2 cup cornstarch",
    "1⁄4 cup water",
    "1 1⁄2 teaspoons fresh garlic, minced",
    "3⁄4 cup sugar",
    "1⁄2 cup soy sauce",
    "1⁄4 cup white vinegar",
    "1⁄4 cup sherry wine or 1⁄4 cup white wine",
    "14 1⁄2 ounces chicken broth (a can)"
  ],
  "__v": 1
}