{
  "__v": 1,
  "directions": [
    "0",
    "1 Cook the corn ears, in their husks, either on the grill for a smokey flavor, or by steaming in a large covered stock pot with an inch of boiling water at the bottom of the pot, for 12-15 minutes. Let the corn cool (can run under cold water to speed up the cooling), remove the husks and silk. I recommend cooking the corn in the husks for the added flavor that the husks impart. If you boil or steam the corn ears after you've already husked them, or if you cook them in the microwave, reduce the cooking time by a few minutes.",
    "2 To remove the kernels from the cobs, stand a corn cob vertically over a large, shallow bowl. Use a sharp knife to make long, downward strokes, removing the kernels from the cob, as you work your way around the cob. Note: it may help to work over a low table, to be in a better ergonomic position to cut the cobs this way.",
    "3 In a medium sized bowl, mix together the corn, chopped arugula, bacon, and onions. In a separate bowl, whisk together the oil, vinegar, salt and pepper, and cumin. Mix dressing into salad just before serving. Taste and add more vinegar if necessary to balance the sweetness of the corn."
  ],
  "firstAdded": "2014-11-01T17:45:15.401000",
  "hash": "3f4bcc4ee83a144eefb80494735d6a1e9a73e6d8",
  "href": "http://www.simplyrecipes.com/recipes/arugula_corn_salad_with_bacon/",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2007/08/corn_salad_arugula_bacon.jpg",
  "ingredients": [
    "0",
    "4 large ears of corn",
    "2 cups of chopped arugula (about one bunch)",
    "4 strips of bacon, cooked, chopped",
    "1/3 cup chopped green onions",
    "1 Tbsp olive oil",
    "1 Tbsp white wine vinegar",
    "1/8 teaspoon ground cumin",
    "Salt and freshly ground black pepper to taste"
  ],
  "keywords": [
    "ears",
    "corn",
    "arugula",
    "bunch",
    "strips",
    "bacon",
    "green",
    "onions",
    "olive",
    "oil",
    "white",
    "wine",
    "vinegar",
    "cumin",
    "salt",
    "black",
    "pepper"
  ],
  "title": "Arugula Corn Salad with Bacon",
  "users": [
    null
  ]
}