{
  "hash": "952b8f3ef52c52e380ce26fd581e870f689fdfa0",
  "title": "Eggplant Salad with Roasted Tomatoes",
  "image": "https://cdn.loveandlemons.com/wp-content/uploads/2015/08/IMG_2015_08_08_05642-2-4.jpg",
  "href": "https://www.loveandlemons.com/eggplant-salad/",
  "extension": "Chrome",
  "firstAdded": "2019-07-04T22:14:32.050000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 300°F and line a baking sheet with parchment paper. Place the cherry tomatoes on the baking sheet and toss with a drizzle of olive oil and a few pinches of salt and pepper. Roast the tomatoes until they’re shriveled up and golden brown around the edges - about 30-35 minutes, depending on the size of your tomatoes.",
    "Bring a pot of salted water to a boil. Add the farro and reduce heat to a high simmer. Cover and cook for 30-40 minutes or until tender. Drain and set aside in a large bowl.",
    "Chop the eggplant into 1-inch pieces and place on a paper towel with a few pinches of salt. Let it sit for about 20 minutes. As water releases from the eggplant flesh, pat it dry. (This is my shortcut. If you want to properly salt your eggplant this is a good video).",
    "In a large skillet, heat a splash of olive oil over medium heat, add the eggplant and cook until it’s tender and golden brown on each side, about 10-12 minutes. Add the chickpeas and garlic halfway through, along with a few pinches of salt and pepper.",
    "Add the roasted tomatoes, cooked eggplant and chickpea mixture, pine nuts, arugula and basil to the large bowl with the farro. Add a generous splash of sherry vinegar and toss. Drizzle with olive oil and season with salt and pepper (and more sherry vinegar if necessary), to taste."
  ],
  "ingredients": [
    "0",
    "1½ cups cherry tomatoes, sliced in half",
    "3-4 small eggplant",
    "Extra-virgin olive oil, for drizzling",
    "¾ cup uncooked farro",
    "½ cup cooked chickpeas, drained and rinsed",
    "1 garlic clove, minced",
    "½ cup pine nuts, toasted",
    "Big handful of arugula",
    "Big handful of torn basil",
    "Generous splashes of sherry vinegar",
    "Sea salt & freshly ground black pepper"
  ],
  "__v": 1
}