{
  "__v": 5,
  "directions": [
    "0",
    "Preheat oven to 450 degrees. Give coconut a rough chop so it’s about the same size as the panko pieces. Combine it with Panko and spices in a shallow dish. Mix well to distribute all of the spices. Place the flour in another shallow dish, and the egg in another. Give the egg a quick beating. Working with one chicken tender at a time, dredge in flour and then dip in egg, and then finally coat in the coconut Panko mixture. Press in with your fingers to make sure the entire thing is well coated.",
    "Place chicken tenders on a foil-lined baking sheet (for easy clean up!) that has been sprayed with non-stick cooking spray. I give mine a teeny drizzle of olive oil on top to help them crisp nicely, but it’s optional.",
    "Bake in your 450 degree oven for about 20 minutes or until juices run clear. Try not to overcook them because chicken tenders go from perfect to overcooked really fast! If your tenders are on the small side, they could even be done in about 15 minutes so keep an eye on them. If they’re big they can take more like 25. The coconut will be nice and golden and the panko crisp, but light in color still.",
    "Combine apricot preserves, rice wine vinegar and red pepper flakes and place in a small bowl for the dipping sauce."
  ],
  "firstAdded": "2014-04-19T16:14:32.086000",
  "hash": "1a72727174227693e44fa30583b3419e69655378",
  "href": "http://www.sixsistersstuff.com/2012/01/baked-crispy-coconut-chicken-with-sweet.html",
  "image": "http://3.bp.blogspot.com/-BAZ8atOEOkI/Tx2wcznivWI/AAAAAAAACNU/kHxYhylT3Sc/s400/Crispy+Coconut+Chicken.jpg",
  "ingredients": [
    "0",
    "12 chicken tenders (I cut up 4 boneless, skinless chicken breasts into strips)",
    "2 eggs",
    "1/2 c. flour",
    "1 c. sweetened coconut flakes",
    "1 c. panko bread crumbs",
    "1 1/2 tsp garlic powder",
    "3/4 tsp table salt",
    "1/4 tsp onion powder",
    "1/8 tsp cayenne pepper (you can leave this out if you want to skip the spice for the kiddos)",
    "1/2 c. apricot preserves (you can use sugar free if you wish)",
    "1 Tbl. rice wine vinegar",
    "3/4 tsp. crushed red pepper flakes",
    "Side of steamed string beans"
  ],
  "keywords": [
    "tenders",
    "boneless",
    "skinless",
    "chicken",
    "breasts",
    "strips",
    "eggs",
    "flour",
    "sweetened",
    "coconut",
    "panko",
    "bread",
    "crumbs",
    "garlic",
    "salt",
    "onion",
    "cayenne",
    "pepper",
    "leave",
    "want",
    "skip",
    "spice",
    "kiddos",
    "apricot",
    "preserves",
    "use",
    "sugar",
    "free",
    "wish",
    "tbl",
    "rice",
    "wine",
    "vinegar",
    "red",
    "steamed",
    "string",
    "beans"
  ],
  "title": "Baked Crispy Coconut Chicken with Sweet and Spicy Apricot Dipping Sauce ",
  "users": [
    null
  ]
}