{
  "__v": 1,
  "directions": [
    "0",
    "METHOD",
    "1.\tFor the meatloaf: heat the oil in a large non-stick frying pan and gently fry the onion, carrot, celery and garlic for 10 minutes until well softened, stirring regularly.",
    "2.\tStir the chilli powder and thyme into the pan and cook with the vegetables for a further 2 minutes, stirring constantly. Remove the pan from the heat and tip the contents into a large mixing bowl. Leave to cool for 10-15 minutes. Preheat the oven to 200C/fan oven 180C/gas 6.",
    "3.\tAdd the beef, pork, sausage meat, 3 tbsp of the ketchup, 1 tbsp of the Worcestershire sauce, breadcrumbs, parsley, egg, salt and plenty of freshly ground black pepper to the vegetables and mix with clean hands until thoroughly combined. The mixture should feel fairly stiff but moist.",
    "4.\tPlace the meatloaf mixture in the centre of a sturdy baking tray or small roasting tin and form into a loaf shape roughly 28cm by 14cm. (It is important that the tin has sides, or the juices will escape.) Mix the remaining 4 tbsp ketchup, 1 tbsp Worcestershire sauce and the sugar in a small bowl and spread over the top of the meatloaf.",
    "5.\tBake in the centre of the oven for 45 minutes until browned and firm. The loaf will have released lots of juice as it cooks but you can use this to make the gravy. Remove the loaf from the oven and transfer carefully to a warmed serving plate. Cover loosely with a piece of foil.",
    "6.\tFor the gravy: place the baking tray or roasting tin on the hob over a low heat and stir the flour into the juices using a wooden spatula. Cook for 20-30 seconds, stirring continuously. Slowly start adding the stock, just a little at a time, stirring constantly until it is all incorporated. Stir in the 1 tsp ketchup.",
    "7.\tBring the gravy to a simmer and cook for 4-5 minutes, stirring to lift the juices and sticky sediment from the base of the tin. If the gravy is a little lumpy, use a metal whisk to help combine the flour. Season with a little more salt and pepper if necessary. Strain the gravy through a sieve into a warmed jug.",
    "8.\tCut the meatloaf into thick slices and serve with the gravy for pouring."
  ],
  "hash": "af7e900646540a374544cf8b040d8972aebb1fee",
  "href": "http://uktv.co.uk/food/recipe/aid/652447#52e968cdbf94c9b106000003",
  "image": "http://uktv.co.uk/images/300240/56296_meatloaf_recipe.jpg?Meatloaf-with-gravy-recipe",
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1 tbsp sunflower oil",
    "1 medium onion, finely chopped",
    "1 medium carrot, peeled and diced",
    "1 stick of celery, trimmed and diced",
    "2 garlic cloves, crushed",
    "1-1.5 tsp chilli powder",
    "1 tsp dried thyme or 1 tbsp freshly chopped thyme leaves",
    "300 g minced beef",
    "300 g minced pork",
    "450 g good quality pork sausage meat",
    "7 tbsp tomato ketchup",
    "2 tbsp Worcestershire sauce",
    "75 g fresh white breadcrumbs",
    "1 small bunch of flat leaf parsley, leaves chopped",
    "1 large egg, beaten",
    "1 tsp fine sea salt",
    "2 tbsp dark brown sugar",
    "For the gravy",
    "1 tbsp plain flour",
    "400 ml beef or pork stock",
    "1 tsp ketchup"
  ],
  "keywords": [
    "sunflower",
    "oil",
    "medium",
    "onion",
    "carrot",
    "celery",
    "trimmed",
    "garlic",
    "chilli",
    "thyme",
    "leaves",
    "beef",
    "pork",
    "good",
    "quality",
    "sausage",
    "meat",
    "tomato",
    "ketchup",
    "worcestershire",
    "white",
    "breadcrumbs",
    "bunch",
    "flat",
    "leaf",
    "parsley",
    "egg",
    "salt",
    "dark",
    "brown",
    "sugar",
    "gravy",
    "plain",
    "flour",
    "stock"
  ],
  "title": "MEATLOAF WITH GRAVY",
  "users": [
    null
  ]
}