{
  "hash": "bb217ed7bd94f57821aba986715135d573c458fa",
  "title": "Best Almond Cake",
  "image": "",
  "href": "https://www.americastestkitchen.com/recipes/7675-best-almond-cake",
  "extension": "Chrome",
  "firstAdded": "2015-05-09T00:18:48.171000",
  "users": [
    null
  ],
  "keywords": [
    "almonds",
    "allpurpose",
    "flour",
    "salt",
    "baking",
    "soda",
    "eggs",
    "sugar",
    "lemon",
    "zest",
    "lemons",
    "almond",
    "unsalted",
    "butter",
    "oil"
  ],
  "directions": [
    "0",
    "Adjust oven rack to middle position and heat\noven to 300 degrees. Grease 9-inch round cake\npan and line with parchment paper. Pulse 1½ cups\nalmonds, flour, salt, baking powder, and baking soda\nin food processor until almonds are finely ground,\n5 to 10 pulses. Transfer almond mixture to bowl. 2. Process eggs, 1 1/4 cups sugar, 1 tablespoon lemon\nzest, and almond extract in now-empty processor until\nvery pale yellow, about 2 minutes. With processor running,\nadd melted butter and oil in steady stream, until\nincorporated. Add almond mixture and pulse to combine,\n4 to 5 pulses. Transfer batter to prepared pan. 3. Using your fingers, combine remaining 2 tablespoons\nsugar and remaining 1/2 teaspoon lemon\nzest in small bowl until fragrant, 5 to 10 seconds.\nSprinkle top of cake evenly with remaining 1/3 cup\nalmonds followed by sugar-zest mixture. 4. Bake until center of cake is set and bounces back\nwhen gently pressed and toothpick inserted in center\ncomes out clean, 55 to 65 minutes, rotating pan after\n40 minutes. Let cake cool in pan on wire rack for 15\nminutes. Run paring knife around sides of pan. Invert\ncake onto greased wire rack, discard parchment, and\nreinvert cake onto second wire rack. Let cake cool,\nabout 2 hours. Cut into wedges and serve. (Store cake\nin plastic wrap at room temperature for up to 3 days.)"
  ],
  "ingredients": [
    "0",
    "1 1/2 cups plus 1/3 cup blanched sliced almonds, toasted",
    "3/4 cup (3 3/4 ounces) all-purpose flour",
    "3/4 teaspoon salt",
    "1/4 teaspoon baking powder",
    "1/8 teaspoon baking soda",
    "4 large eggs",
    "1 1/4 cups (8 3/4 ounces) plus 2 tablespoons sugar",
    "1 tablespoon plus 1/2 teaspoon grated lemon zest (2 lemons)",
    "3/4 teaspoon almond extract",
    "5 tablespoons unsalted butter, melted",
    "1/3 cup vegetable oil"
  ],
  "__v": 1
}