{
  "hash": "c38a6b84a8554b4100af19e52fba5830141373e1",
  "title": "Pastrami",
  "image": "https://images.food52.com/p6WzpLO6EoP3VlJoVdAe49FYwGQ=/753x502/cb613bf1-681e-4290-bf19-de24819faca2--2013-1011_pastrami-004.jpg",
  "href": "https://food52.com/recipes/24500-pastrami?affil=cj&utm_source=cj&utm_medium=affiliate&utm_campaign=Food52+Welcome10+Discount+Code&company=VigLink&website=6165148",
  "extension": "Chrome",
  "firstAdded": "2018-04-29T18:04:08.490000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a small skillet, lightly toast 1/2 teaspoon of the peppercorns, 1/2 teaspoon of the coriander, and 1/2 teaspoon of the mustard seeds over medium heat until fragrant, about 3 minutes.",
    "Grind in a spice mill.",
    "Put the ground spices in a large pot and add the pepper flakes, allspice, cloves, mace, ginger, bay leaf, cinnamon stick, kosher salt, pink salt, granulated sugar, brown sugar, honey, garlic, and 4 quarts water. Bring the brine to a simmer, stirring until the salt and sugar are dissolved. Remove from the heat and let cool to room temperature. Transfer the brine to a vessel large enough to hold it and the meat—which will be added later— and refrigerate until chilled.",
    "Put the brisket in the brine and weight it down (with a plate and tomato cans, for example) to keep it completely submerged. Cover and refrigerate for 5 days. Remove the brisket from the brine, rinse it, dry it, and put it on a large platter. Discard the brine. In a spice mill, process the remaining peppercorns, coriander seeds, mustard seeds, and the fennel seeds. Transfer the spices to a small bowl and mix well. Coat the brisket with the spice mixture and sprinkle the shiro dashi over it. Cover the platter and refrigerate for about 12 hours.",
    "Preheat the oven to 250°F.",
    "Put the brisket on a rack in a roasting pan. Add a cup of water to the pan and tightly cover the pan with aluminum foil. Cook the brisket until it reaches 165°F on a meat thermometer, 3 to 4 hours. (If you don’t have a thermometer, the brisket is ready when it is very tender.) Let the meat rest for at least 2 hours at room temperature, or cover and refrigerate overnight. To serve, transfer the pastrami to a cutting board and cut against the grain into thin slices. The pastrami will keep, tightly covered, in the refrigerator for up to a week."
  ],
  "ingredients": [
    "0",
    "3 1/2 tablespoons black peppercorns",
    "3 1/2 tablespoons coriander seeds",
    "2 tablespoons mustard seeds",
    "1/2 teaspoon red pepper flakes",
    "1/2 teaspoon allspice berries",
    "1/2 teaspoon whole cloves",
    "1/4 teaspoon ground mace",
    "1/4 teaspoon ground ginger",
    "1 bay leaf, crushed",
    "1/4 cinnamon stick, crushed",
    "1 1/4 cups kosher salt",
    "2 2/3 tablespoons pink salt (sodium nitrite)",
    "1 cup granulated sugar",
    "1/2 cup packed dark brown sugar",
    "1/4 cup honey",
    "5 garlic cloves, minced",
    "One 5-pound brisket from the fatty end (point), untrimmed",
    "1 1/2 tablespoons fennel seeds",
    "1/2 cup shiro dashi"
  ],
  "__v": 1
}