{
  "hash": "421f934fa7d9bd91d3c0769a827421c5fcd6da51",
  "title": "QUINOA AND SAUTÉED VEGGIE CAKES [VEGAN, GLUTEN-FREE]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/02/quinoacake.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/quinoa-and-sauteed-veggie-cakes/",
  "firstAdded": "2015-02-11T15:21:49.379000",
  "users": [
    null
  ],
  "keywords": [
    "dry",
    "quinoa",
    "rinsed",
    "water",
    "flaxseed",
    "extravirgin",
    "olive",
    "oil",
    "garlic",
    "onion",
    "carrots",
    "turmeric",
    "salt",
    "used",
    "oat",
    "flour"
  ],
  "directions": [
    "0",
    "Place quinoa and 1 1/2 cups water in a small pot and bring to a boil. Reduce heat, and simmer for 15 minutes, until all liquid is absorbed. Remove from heat and allow to sit.",
    "Mix flaxseed with 6 tablespoons of water in a small bowl. Place in the refrigerator for about 10 minutes, until gelled. Once thickened, this mixture will act as eggs would to bind the quinoa mixture together.",
    "Meanwhile, heat olive oil in a skillet over medium heat. Add garlic and onion and sauté 5 minutes, until fragrant. Add in carrots, turmeric, and salt, and sauté another 5 minutes until softened. Remove from heat.",
    "Preheat oven to 375 degrees F. Line a baking sheet with parchment paper. Mix together quinoa, flaxseed eggs, sautéed veggies, and flour, adding more flour or water, as needed, to allow the mixture to stick together nicely. Form into 8 patties, and place on the lined baking sheet. Bake 25-30 minutes, until golden, flipping once halfway through. OR cook 5 minutes per side over medium heat in a large skilled coated with olive oil.",
    "Serve."
  ],
  "ingredients": [
    "0",
    "3/4 cup dry quinoa, rinsed",
    "1 1/2 cups water",
    "2 tbsp ground flaxseed",
    "6 tbsp water",
    "2 tbsp extra-virgin olive oil",
    "2 cloves garlic, minced",
    "1 small onion, diced",
    "2 small carrots, peeled and diced",
    "1 tsp turmeric",
    "1/2 tsp salt",
    "1/4 cup flour of choice (I used gf oat flour)"
  ],
  "__v": 1
}