{
  "hash": "2609513dff0508f3d57c790434849d06336a90f5",
  "title": "Patatas Bravas",
  "image": "https://res.cloudinary.com/hksqkdlah/image/upload/ar_1:1,c_fill,dpr_1.0,f_auto,q_auto:low,w_600/29269_sfs-patatas-bravas-24",
  "href": "https://www.cooksillustrated.com/recipes/8796-patatas-bravas",
  "extension": "Chrome",
  "firstAdded": "2019-03-08T13:22:29.732000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "While this dish is traditionally served as part of a tapas spread, it can also be served as a side dish with grilled or roasted meat. Bittersweet or hot smoked paprika can be used in place of sweet, if desired. If you make this substitution, be sure to taste the sauce before deciding how much cayenne to add, if any. A rasp-style grater makes quick work of turning the garlic into a paste.",
    "1. FOR THE SAUCE: Heat oil in small saucepan over medium-low heat until shimmering. Add garlic, paprika, salt, and cayenne and cook until fragrant, about 30 seconds. Add tomato paste and cook for 30 seconds. Whisk in water and bring to boil over high heat. Reduce heat to medium-low and simmer until slightly thickened, 4 to 5 minutes. Transfer sauce to bowl, stir in vinegar, and let cool completely. Once cool, whisk in mayonnaise. (Sauce can be refrigerated for up to 24 hours. Bring to room temperature before serving.)",
    "2. FOR THE POTATOES: Bring 8 cups water to boil in large saucepan over high heat. Add potatoes and baking soda. Return to boil and cook for 1 minute. Drain potatoes.",
    "3. Return potatoes to saucepan and place over low heat. Cook, shaking saucepan occasionally, until any surface moisture has evaporated, 30 seconds to 1 minute. Remove from heat. Add 1 1/2 teaspoons salt and stir with rubber spatula until potatoes are coated with thick, starchy paste, about 30 seconds. Transfer potatoes to rimmed baking sheet in single layer to cool. (Potatoes can stand at room temperature for up to 2 hours.)",
    "4. Heat oil in large Dutch oven over high heat to 375 degrees. Add all potatoes (they should just be submerged in oil) and cook, stirring occasionally with wire skimmer or slotted spoon, until deep golden brown and crispy, 20 to 25 minutes.",
    "5. Transfer potatoes to paper towel–lined wire rack set in rimmed baking sheet. Season with salt to taste. Spoon 1/2 cup sauce onto bottom of large platter or 1 1/2 tablespoons sauce onto individual plates. Arrange potatoes over sauce and serve immediately, passing remaining sauce separately."
  ],
  "ingredients": [
    "0",
    "1\ttablespoon vegetable oil",
    "2\tteaspoons garlic, minced to paste",
    "1\tteaspoon sweet smoked paprika",
    "½\tteaspoon kosher salt",
    "½—3;\tteaspoon cayenne pepper",
    "¼\tcup tomato paste",
    "½\tcup water",
    "2\tteaspoons sherry vinegar",
    "¼\tcup mayonnaise",
    "Potatoes",
    "2 ¼\tpounds russet potatoes, peeled and cut into 1-inch pieces",
    "½\tteaspoon baking soda",
    "Kosher salt",
    "3\tcups vegetable oil"
  ],
  "__v": 1
}