{
  "hash": "f2df16ba3536cd30323c049d33f003552e2490aa",
  "title": "Ultra-Easy Cheesecake Made in a Rice Cooker",
  "image": "https://img-global.cpcdn.com/001_recipes/6554010631798784/640x453cq70/photo.jpg",
  "href": "https://cookpad.com/us/recipes/148908-ultra-easy-cheesecake-made-in-a-rice-cooker",
  "extension": "Chrome",
  "firstAdded": "2015-05-05T09:02:46.500000",
  "users": [
    null
  ],
  "keywords": [
    "eggs",
    "sugar",
    "helpful",
    "hints",
    "lemon",
    "juice",
    "cream",
    "cheese",
    "milk",
    "pancake",
    "cake",
    "flour"
  ],
  "directions": [
    "0",
    "Method",
    "1Bring the cream cheese to room temperature or heat it up in a little in the microwave, and mix well to soften.",
    "+",
    "2Add the eggs, sugar, and lemon juice and mix. Add the heavy cream and flour bit by bit while mixing well. You can also use a food processor to speed up the process.",
    "+",
    "3Pour the batter into a rice cooker and switch on! (Tip: For a smooth texture, strain through a sieve to remove any lumps).",
    "+",
    "4It is done once you stick it with a toothpick and it comes out clean (cook for longer if it's still not cooked enough).",
    "+",
    "5The cake is really soft and delicate when hot, so remove the rice cooker bowl from the machine, and cover with plastic wrap. Leave to cool. Transfer to a plate once it cools to room temperature.",
    "+",
    "6To flip the cake without crumbling it, place a small plate that fits inside the pot - or use your hand if you don't have a plate like that. Lightly press down on the cake, then flip it over.",
    "+",
    "7Chill the cake well in the refrigerator, and it's done! You can have fun with this by pouring fruit sauce over the cake and varying it in other ways.",
    "+",
    "8When using a 3 cup rice cooker, the cake will be have more height than the 5-cup version, so it may not cook through in one cooking cycle. Try cooking the cake for a longer time or halving the ingredients.",
    "+",
    "9This cake freezes well. Tightly wrap with plastic wrap, place into a zip-type plastic bag, press out the air, and freeze."
  ],
  "ingredients": [
    "0",
    "2\tEggs",
    "100 grams\tSugar (see Helpful Hints)",
    "2 tbsp\tLemon juice",
    "200 grams\tCream cheese",
    "200 ml\tHeavy cream (or milk)",
    "40 grams\tPancake mix (or cake flour)"
  ],
  "__v": 1
}