{
  "hash": "d6b332d82f4f02e16719b30fdb432e7100cc6512",
  "title": "Fresh Blueberry Pie",
  "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/20200512-blueberry-pie-delish-ehg-10771-1589574426.jpg?crop=0.668xw:1.00xh;0.100xw,0&resize=480:*",
  "href": "https://www.delish.com/cooking/recipe-ideas/a32501337/blueberry-pie-recipe/",
  "extension": "Chrome",
  "firstAdded": "2020-05-29T02:00:23.399000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place butter and flour into freezer for 30 minutes before starting crust process. (You want them SUPER cold.)",
    "In a large bowl, whisk together flour, sugar, and salt. (Alternately, you can do this in a food processor.) Add butter and, using your hands, mix together until pea-sized and some slightly larger pieces form. Add vinegar and then ice water, 1 tablespoon at a time, until dough starts to come together and is moist but not wet and sticky (test by squeezing some with your fingers). Mixture will be crumbly.",
    "Turn dough onto a lightly floured surface and form into 2 balls. Flatten into disks (making sure there are no/minimal cracks). Cover with plastic wrap and refrigerate until dough is very cold, at least 2 hours or up to overnight.",
    "Cook 2 cups blueberries with lemon juice and zest, sugar, salt, and nutmeg for 5 minutes.",
    "In a small bowl, whisk together cornstarch and water, then add saucepan and cook 1 minute more. Remove from heat and add remaining 3 cups blueberries. Let cool while rolling out pie crust.",
    "Preheat oven to 400° with a large baking sheet on middle rack. Take one disk of pie crust out of the fridge and let sit at room temperature for 10 minutes to make it easier to roll out.",
    "Lightly flour a clean work surface and roll pie crust into a 13” circle. Place crust over a shallow 9” pie plate and lightly press it in making sure the dough has minimal gaps between the pan. Trim crust to a 1” overhang, then tuck dough under itself and crimp crust.",
    "Roll second disc of pie crust on a lightly floured surface into a 10” circle. Cut into 1 ½” thick strips.",
    "Pour blueberry filling into pie crust and place pie crust strips into a lattice over filling. Trim ends as needed and press into bottom crust. Place into freezer for 15 minutes.",
    "Brush crust with egg wash and sprinkle with Demerara sugar. Place on preheated baking sheet and bake until golden and filling is bubbly, 40 to 45 minutes. Let cool 2 hours before slicing."
  ],
  "ingredients": [
    "0",
    "FOR THE PIE CRUST",
    "1 c. (2 sticks) cold butter, cut into 1/2\" pieces",
    "3 c. all-purpose flour, plus more for surface",
    "2 tbsp. granulated sugar",
    "1/2 tsp. kosher salt",
    "1 tbsp. apple cider vinegar",
    "8 tbsp. ice water",
    "Egg wash, for brushing",
    "Demerara sugar, for sprinkling",
    "FOR BLUEBERRY FILLING",
    "5 c. blueberries, rinsed, and divided",
    "Zest and juice of 1 large lemon",
    "1/3 c. granulated sugar",
    "1/2 tsp. kosher salt",
    "1/4 tsp. nutmeg",
    "2 tbsp. cornstarch",
    "2 tbsp. water"
  ],
  "__v": 1
}