{
  "hash": "9f80e585bcaf873000d7f49fb59165a9d7fd9e7c",
  "title": "Profiteroles with chocolate custard & caramel sauce",
  "image": "https://img.taste.com.au/wvRyKSYU/w720-h480-cfill-q80/taste/2016/11/profiteroles-with-chocolate-custard-caramel-sauce-84034-1.jpeg",
  "href": "https://www.taste.com.au/recipes/profiteroles-chocolate-custard-caramel-sauce/96f7a9aa-cd24-4da4-9042-99399dc7954d",
  "extension": "Chrome",
  "firstAdded": "2018-10-29T23:01:58.696000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make profiteroles: Place the water and butter in a saucepan. Bring just to the boil. Remove from heat and use a wooden spoon to beat in flour until combined.",
    "Cook, stirring, over medium heat for 2-3 minutes or until the mixture forms a ball and comes away from side of pan. Set aside for 5 minutes to cool.",
    "Gradually add egg, 1 tablespoon at a time, beating well after each addition, until the dough is thick and glossy.",
    "Preheat oven to 200°C. Line 2 baking trays with non-stick baking paper. Place heaped dessertspoonfuls of dough, about 3cm apart, on trays.",
    "Use wet hands to pat down any peaks of dough. Sprinkle trays with water to create steam. Bake for 30-35 minutes or until puffed and golden.",
    "Turn off oven. Use a knife to pierce the base of each profiterole. Place profiteroles in oven for 20 minutes to dry out. Transfer to a wire rack to cool.",
    "For the filling, stir the chocolate in a heatproof bowl over a saucepan of simmering water (don't let the bowl touch the water) until the chocolate melts and is smooth. Remove from heat. Gradually stir in the custard until well combined. Place in the fridge for 1 hour or until the mixture thickens.",
    "Use a small serrated knife to cut each profiterole in half. Divide the chocolate custard among the profiterole bases. Top with the remaining profiterole halves.",
    "Place the butter, brown sugar and cream in a small saucepan over low heat. Cook, stirring, for 5 minutes or until the butter melts, the sugar dissolves and the sauce is smooth and combined.",
    "Drizzle the caramel sauce over the profiteroles."
  ],
  "ingredients": [
    "0",
    "250ml (1 cup) water",
    "80g butter, at room temperature, chopped",
    "150g (1 cup) plain flour, sifted",
    "3 eggs, at room temperature, lightly whisked",
    "FILLING",
    "100g dark chocolate, finely chopped",
    "250g Pauls Premium Vanilla Custard",
    "50g butter",
    "125g (3/4 cup, lightly packed) brown sugar",
    "250ml (1 cup) thickened cream"
  ],
  "__v": 5
}