{
  "hash": "afb835313230f76e48ff420a1e5ba0212378fe11",
  "title": "Vietnamese Restaurant-Style Grilled Lemongrass Pork",
  "image": "http://vietworldkitchen.com/.a/6a00d8341ef22f53ef011570366ea4970b-500pi",
  "href": "http://www.vietworldkitchen.com/blog/2009/04/vietnamese-restaurantstyle-grilled-lemongrass-pork-thit-heo-nuong-xa.html",
  "firstAdded": "2015-02-09T19:52:08.012000",
  "users": [
    null
  ],
  "keywords": [
    "granulated",
    "light",
    "brown",
    "sugar",
    "garlic",
    "shallot",
    "yellow",
    "onion",
    "stalk",
    "lemongrass",
    "trimmed",
    "black",
    "pepper",
    "dark",
    "soy",
    "fish",
    "oil"
  ],
  "directions": [
    "0",
    "Cut the pork shoulder steak into pieces about 3 to 4 inches big. Set aside.",
    "Put the sugar, garlic, shallot and lemongrass into an electric mini chopper and process to a fine texture. (Or, mince the garlic, shallot, and lemongrass individually, put them into a bowl, and add the sugar.) Add the pepper, soy sauce, fish sauce, and oil and process to combine well. Aim for a relatively smooth texture. The marinade will be chocolate brown. Transfer to a bowl.",
    "Add the pork, and turn to coat well. Cover and set aside at room temperature to marinate for 1 hour. Or, refrigerate up to 24 hours, letting the meat sit out at room temperature for 45 minutes to remove some of the chill before grilling.",
    "Preheat a grill to medium-high. Grill for 6 to 8 minutes, turning frequently, until cooked through. Nick with a knife to test. Transfer to a plate, loosely cover with foil or an inverted bowl for 10 minutes before slicing and serving."
  ],
  "ingredients": [
    "0",
    "11/2 to 2 tablespoons granulated or light brown sugar",
    "1 tablespoon chopped garlic",
    "1 tablespoon chopped shallot or yellow onion",
    "1 stalk lemongrass, trimmed and finely chopped (3 tablespoons)",
    "1/4 teaspoon black pepper",
    "1 1/2 teaspoon dark (black) soy sauce",
    "1 1/2 tablespoon fish sauce",
    "1 tablespoon oil"
  ],
  "__v": 1
}