{
  "hash": "a73e31d5ee942d2598f77c63db34e7d253186cb4",
  "title": "Perfect Cauliflower Crust Keto Pizza",
  "image": "",
  "href": "https://theketocookbook.com/keto-recipes/keto-pizza/",
  "extension": "Chrome",
  "firstAdded": "2017-11-06T15:05:00.823000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1",
    "The first step is to prepare your cauliflower for your base. You want to chop up the head of cauliflower into florets, and pop them into a blender and pulse until they have a rice-like consistency. If you don't have a blender, you can just use a cheese grater.",
    "2",
    "Next, bring a pot of water to the boil, add your cauli-rice, and boil for about 5 minutes. Strain off the water and leave the cauli-rice cool a little bit.",
    "3",
    "Now you want to get as much water as possible out of the cauliflower, as this will directly impact the texture of your base. If you don't get the water out it will be a softer (still delicious) base.",
    "To get the water out, pour the cauli-rice into a cheesecloth or similar, and fold the cloth around it. Now you want to squeeze as hard as you can to get every drop of water out, but be careful not to burn your hands!",
    "4",
    "Now you should have a nice dry mixture, so pop it into a bowl and add you oregano, salt, pepper and the egg and mix it well. Use you hands and really get stuck in!",
    "5",
    "Line a baking sheet with parchment paper (this is very important, as it WILL stick, trust me), and spread your mixture out into your desired shape. My baking tray is rectangular so I just tend to go with that.",
    "Make the dough about 1/3 of an inch thick, with a little bit higher around the edges for the crust effect!",
    "6",
    "Pop it into a preheated oven at 400F for about 30-35 mins. The crust should be a golden brown, and firm to the touch when done, so be careful not to take it out too early.",
    "Now your crust is ready for whatever delicious toppings you want! Since this is a keto pizza, cheese is going to feature pretty heavily! We used some tomato purée for the sauce, followed by mozzarella, black olives, some onion and crumbled feta cheese.",
    "Put it back in the oven for another 5-10 mins, until the cheese is bubbling and you cant stop yourself from eating it anymore. There you have it, the perfect keto pizza. Let us know what you think in the comments!"
  ],
  "ingredients": [
    "0",
    "1 lbs Cauliflower",
    "1 large, beaten Egg",
    "1 cup Mozzarella Cheese",
    "1 tsp Dried Oregano",
    "1 cup Feta Cheese",
    "4oz Black Olives",
    "White Onion",
    "1/2 cup Tomato Purée",
    "pinch Black Pepper",
    "pinch Salt"
  ],
  "__v": 3
}