{
  "hash": "506cf655e9dec9cc067b9ac5e8e5b23e55e7e343",
  "title": "*Easy 5-Minute Almost Cheesecake Dessert*~*~",
  "image": "https://scontent-sea.xx.fbcdn.net/hphotos-xap1/v/t1.0-9/1528457_10206281462025399_2577914644590261005_n.jpg?oh=dfb1333b58d3ee49b256145ce28e54b0&oe=55E43418",
  "href": "https://www.facebook.com/photo.php?fbid=10206281457305281&set=a.2398767538536.2136976.1531467008&type=1&theater",
  "extension": "Chrome",
  "firstAdded": "2015-05-03T23:49:27.433000",
  "users": [
    null
  ],
  "keywords": [
    "butter",
    "graham",
    "cracker",
    "crumbs",
    "sweetened",
    "condensed",
    "milk",
    "sour",
    "cream",
    "lemon",
    "juice",
    "cherry",
    "blueberry",
    "pie",
    "filling"
  ],
  "directions": [
    "0",
    "Directions",
    "Preheat oven to 350 degrees F (oven rack set to lowest bottom position).",
    "Grease an 8 x 8-inch square baking dish.",
    "In the baking dish melt the butter inside the oven.",
    "Remove from oven; sprinkle the cracker crumbs in the melted butter, stir well; press on the bottom of the baking dish to form a crust.",
    "Bake the graham crust in a 350 degree oven for 7 minutes; remove and set aside.",
    "In a medium bowl, mix together the sweetened condensed milk, sour cream and lemon juice.",
    "Spread evenly over the crumb/crust.",
    "Spoon the pie filling evenly over the cream layer (don't worry if it sinks a bit, it will all bake together).",
    "Bake on lowest oven rack for 25-30 minutes, or until set (don't over bake).",
    "Serve warm or chill overnight (this will firm up and develop in flavor if left in the refrigerator overnight).",
    "** This dessert is very good so you might want to consider doubling it -- this can be easily doubled and baked in a 13 x 9-inch baking pan, double the canned pie filling too and bake it for just a couple minutes longer.",
    "www.food.com",
    "(¯`•.•´¯)¸•´¯`☆",
    ".`•.¸¸.•´",
    "Please FOLLOW ME; I am always posting awesome stuff on my timeline! www.facebook.com/tonya.l.thompson.79",
    "Don't just LIKE it, SHARE it so your friends see it! It also saves it in your Timeline Photo Album so it's stored for later! Just click on the picture and click SHARE at the bottom."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1/4-1/3 cup butter",
    "1 1/2 cups graham cracker crumbs",
    "1 (14 ounce) cans sweetened condensed milk",
    "8 ounces sour cream",
    "1/4 cup lemon juice",
    "1 (21 ounce) cans cherry pie filling ( or blueberry pie filling)"
  ],
  "__v": 1
}