{
  "__v": 1,
  "directions": [
    "0",
    "Bring milk to a bare simmer in a small saucepan over moderate heat. Remove from heat and let cool to 105 - 115F.",
    "Stir together warm water, yeast and 1/2 tsp. sugar in bowl until yeast is dissolved. Let stand until foamy, approx. 5 minutes.",
    "Add butter and ? cup sugar to yeast mixture and mix with paddle attachment at low speed until combined (it is okay if the butter does not entirely mix and is clumped slightly together).",
    "Add warm milk and let sit for a minute. Mix until butter is melted.",
    "Add eggs and mix until well combined.",
    "Add salt and 4 cups of flour and mix, scraping down sides of bowl as necessary.",
    "Switch to dough hook and beat in two cups of flour at medium speed, scraping down the sides once or twice. If needed, add more flour in tbsp. increments to make dough pull away from the sides. Beat for 5 minutes more. Dough will be sticky.",
    "Transfer to a large oiled bowl and turn to coat with oil. Cover with plastic wrap and let rise in a warm, draft-free place until doubled in bulk, approx. 2 1/2 hours.",
    "Butter two large baking sheets. Punch dough down and turn onto lightly floured surface. Roll out to about a 1/2 \" thickness and cut into desired shapes - 3\" rounds if available, otherwise 3\" squares are fine.",
    "Place on cookie sheets and cover loosely with plastic wrap. Let rise until a finger pressed into the dough leaves an imprint, approx. 1 1/2 to 2 hours.",
    "Preheat oven to 375 F.",
    "Place buns in oven and bake until golden brown and sound hollow when tapped, approx. 14 - 20 minutes per batch. Cool completely before serving."
  ],
  "firstAdded": "2014-11-13T04:39:36.448000",
  "hash": "01a3c439ccc95cee160f5637101cbaca7b798eb9",
  "href": "http://www.bigoven.com/recipe/homemade-hamburger-buns/165729",
  "image": "http://mda.bigoven.com/pics/rs/256/homemade-hamburger-buns-2.jpg",
  "ingredients": [
    "0",
    "2 cup Whole Milk",
    "1/2 cup Water; warm (105 -115 degrees F)",
    "5 teaspoons Active Dry Yeast",
    "1/2 teaspoon Sugar",
    "1/4 cup Sugar",
    "2 ounces Butter; cut into small pieces and softened",
    "2 large Egg; lightly beaten",
    "1 tablespoon Salt",
    "6 cup All-purpose flour; (up to 6 1/2 cups)"
  ],
  "keywords": [
    "milk",
    "water",
    "degrees",
    "active",
    "dry",
    "yeast",
    "sugar",
    "butter",
    "pieces",
    "softened",
    "egg",
    "lightly",
    "salt",
    "allpurpose",
    "flour"
  ],
  "title": "Homemade Hamburger Buns",
  "users": [
    null
  ]
}