{
  "__v": 1,
  "directions": [
    "0",
    "Whisk together the softened butter, sugar, salt and cardamom.",
    "Heat the milk to 37 degrees, add the yeast and let it dissolve.",
    "Pour the milk over the butter mixture and stir while adding the flour, a little at a time. Knead the dough for 5-10 minutes in the machine and let it rest 45 minutes under a cloth.",
    "Make the custard by mixing eggs, sugar, milk and potato flour in a saucepan. Simmer the sauce until it thickens and let cool. Mix in the vanilla sugar.",
    "Rårör the raspberries with the sugar so they are mashed easily.",
    "Take the dough and divide it into two pieces. Roll out one piece into a flat rectangle, about 30 × 50 cm. Spread the custard over the plate and then raspberry cake over.",
    "Fold the dough with a treslag from the long side so you now get a dough with three layers, about 10 × 50 cm.",
    "Cut the dough into 3-4 inch wide lengths. Cut a hole in the middle and thread one end through the hole. Place the buns on a baking sheet and let rise 20 minutes.",
    "Doing the same procedure with the second deghalvan.",
    "Bake in the oven at 250 degrees for about 10 minutes."
  ],
  "firstAdded": "2014-07-20T18:54:46.748000",
  "hash": "818d2e2bbe3b009b3e54db235b9481070434428a",
  "href": "http://gronaskafferiet.se/vanilj-hallonbullar/",
  "image": "http://gronaskafferiet.se/wp-content/uploads/2012/07/MG_8020_.jpg",
  "ingredients": [
    "0",
    "150g softened butter",
    "1 cup sugar",
    "5 dl milk",
    "35 g yeast",
    "2 teaspoon coarsely ground cardamom",
    "0.5 teaspoon salt",
    "14 cups flour",
    "1 egg",
    "2 tablespoons sugar",
    "4 cups milk",
    "3 tablespoons potato flour",
    "1 tbsp vanilla sugar",
    "2 cups raspberries",
    "2 tablespoons sugar"
  ],
  "keywords": [
    "softened",
    "butter",
    "sugar",
    "milk",
    "yeast",
    "coarsely",
    "cardamom",
    "salt",
    "flour",
    "egg",
    "potato",
    "vanilla",
    "raspberries"
  ],
  "title": "Vanilj & hallonbullar",
  "users": [
    null
  ]
}