{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 200 degrees.",
    "In a large skillet, melt one tablespoon butter over medium heat. Add the shallots and saute, stirring, for about 2-3 minutes to soften. Salt and pepper both sides of the cod fillets and place in pan. Add the wine and water and poach cod until cooked, about 7 minutes. Using a large spatula, remove cod from broth and place in wide, shallow soup bowls. Place bowls with cod in oven to keep warm.",
    "Raise the heat on broth and bring to a boil to reduce by about one cup. Reduce heat to medium low and add coconut milk, remaining butter, tarragon and parsley, and stir. Add mushrooms and cook for about five minutes, until mushrooms are tender. Turn off heat. Add salt and pepper to taste.",
    "Remove bowls from oven. Divide fresh sorrel between the bowls. Ladle broth over the fish and sorrel. Garnish with fresh tarragon leaves. Serve immediately."
  ],
  "firstAdded": "2014-06-18T16:28:40.105000",
  "hash": "70889a55f346220627c86b138f16374e5cb79268",
  "href": "http://theyearinfood.com/page/28",
  "image": "http://farm6.staticflickr.com/5069/5694222217_61437737e0_b.jpg",
  "ingredients": [
    "0",
    "2 8-ounce cod fillets (can substitute any firm white fish or salmon)",
    "12 ounces dry white wine",
    "2 tablespoons butter",
    "1/4 cup minced shallot",
    "8 ounces coconut milk",
    "8 ounces water",
    "1 tablespoon fresh tarragon, minced + more for garnish",
    "1 tablespoon flatleaf parsley, minced",
    "2 ounces brown beech mushrooms (can substitute any light, delicately-flavored mushroom)",
    "handful fresh sorrel (can substitute other spring greens)",
    "salt + pepper to taste"
  ],
  "keywords": [
    "cod",
    "fillets",
    "firm",
    "white",
    "fish",
    "salmon",
    "dry",
    "wine",
    "butter",
    "shallot",
    "coconut",
    "milk",
    "water",
    "tarragon",
    "flatleaf",
    "parsley",
    "brown",
    "beech",
    "mushrooms",
    "light",
    "delicatelyflavored",
    "mushroom",
    "sorrel",
    "spring",
    "greens",
    "salt",
    "pepper"
  ],
  "title": "POACHED COD IN COCONUT MILK",
  "users": [
    null
  ]
}