{
  "hash": "2b534743d310577c8bd83762eb521c7de98ab601",
  "title": "Vegan Holishkes (Stuffed Cabbage) [Vegan]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/03/holishkes-32-1024x765.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/vegan-holishkes-stuffed-cabbage/",
  "extension": "Chrome",
  "firstAdded": "2015-05-13T12:33:02.152000",
  "users": [
    null
  ],
  "keywords": [
    "head",
    "cabbage",
    "tomatoes",
    "tbs",
    "apple",
    "cider",
    "vinegar",
    "brown",
    "sugar",
    "tomato",
    "paprika",
    "garlic",
    "kosher",
    "salt",
    "black",
    "pepper",
    "allspice",
    "egg",
    "replacer",
    "water",
    "vegan",
    "beef",
    "crumbles",
    "rice",
    "onion",
    "dill",
    "seed"
  ],
  "directions": [
    "0",
    "Bring a large pot of water to a boil and carefully immerse the head of cabbage, core side down. Boil the cabbage for 5 minutes. You want it to be tender but not too soft and falling apart. Carefully drain the cabbage into a colander and allow it to cool enough so you can handle it.",
    "Cut the core out with a paring knife. Carefully remove whole leaves being careful not to tear them. Pat each leaf dry and with your paring knife, shave the stems so they are not so thick and tough.",
    "Shred the rest of the cabbage to use in the filling and in the dish.",
    "1",
    "In a medium saucepan, combine the crushed tomatoes, diced tomatoes, vinegar, brown sugar and tomato paste. Cook on medium heat. Season the sauce with paprika, garlic powder, salt, pepper and allspice. Cover and heat until the sauce comes to a low boil, reduce the heat to a low simmer and cook for just 20 minutes.",
    "2",
    "In a mug, combine the egg replacer and water. Mix and let stand 5 minutes until thickened. In a large bowl, combine the beefy crumbles, rice, shredded cabbage, and onion. Mix in the egg replacer and tomato sauce. Add the seasoning and mix well. Taste for seasoning adjustments. Set the filling aside.",
    "3",
    "Take each cabbage leaf and put it on your work station so that it curls up like a bowl. Place ¼ cup of the filling on the cabbage leaf near the stem end. Curl up the leaf from the stem end so that the filling is covered. Fold the left side of the cabbage leaf over and then continue to roll up the leaf. Tuck the right side of the cabbage leaf into the middle. Lay the cabbage roll seam-side down and continue making more cabbage rolls until you use up all the filling.",
    "In a Dutch oven or large pot, heat 1 Tbs. olive oil. Make a bed with about 2 or 3 cups of shredded cabbage. Lay 4 of your cabbage rolls on top of the shredded cabbage. Top with a few ladles of sauce. Put the remaining cabbage rolls on top of the sauce and cover them with more sauce. Cook over medium-high heat until the sauce bubbles. Reduce the heat to a simmer, cover the pot and cook for 90 minutes to 2 hours until the cabbage is tender. When they are done, carefully remove the stuffed cabbage from the pot with tongs and set on a plate.",
    "To serve, spoon some of the cooked cabbage into bowls. Top with 2 stuffed cabbage rolls and top with more sauce."
  ],
  "ingredients": [
    "0",
    "1 large head cabbage",
    "1",
    "1-28 oz. can crushed tomatoes",
    "1-14 oz. can diced tomatoes",
    "2 Tbs. apple cider vinegar",
    "2 Tbs. brown sugar",
    "2 Tbs. tomato paste",
    "1 Tbs. paprika",
    "2 tsp. garlic powder",
    "1 tsp. kosher salt",
    "½ tsp. black pepper",
    "¼ tsp. allspice",
    "2",
    "1 tsp. egg replacer + ¼ cup water",
    "1 package vegan beef crumbles",
    "1 cup cooked brown rice",
    "½ cup cabbage, finely chopped",
    "½ small onion, minced",
    "½ cup tomato sauce",
    "2 tsp. dill seed",
    "1 tsp. garlic powder",
    "1 tsp. onion powder",
    "1 tsp. paprika",
    "½ tsp. kosher salt",
    "½ tsp. black pepper"
  ],
  "__v": 1
}