{
  "hash": "206513a025f201818b2742870be92fe004f646ec",
  "title": "Broccoli Cheddar Baked Potatoes",
  "image": "https://www.budgetbytes.com/wp-content/uploads/2016/06/Broccoli-Cheddar-Baked-Potatoes-V2s.jpg",
  "href": "https://www.budgetbytes.com/broccoli-cheddar-baked-potatoes/",
  "extension": "Firefox",
  "firstAdded": "2019-02-03T22:08:28.799000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 400ºF. Take the broccoli out of the freezer and allow it to thaw as the potatoes bake. Once thawed, roughly chop the broccoli into small pieces and then set aside until ready to use.",
    "Wash the potatoes well, then dry with paper towel or a clean dish towel. Use a fork to prick several holes in the skin of each potato. Pour the olive oil into a small dish, then use your hands to coat each potato in oil. Place the oil coated potatoes on a baking sheet, and season generously with salt. Bake the potatoes for 45-60 minutes, or until tender all the way through.",
    "Towards the end of the baking time, begin to prepare the cheese sauce. Add the butter and flour to a medium sauce pot, then place the pot over a medium flame. Whisk the butter and flour together as they melt. Allow the mixture to begin to bubble and foam, whisking continuously. Continue to cook for one minute to remove the raw flour flavor, but do not let the flour begin to brown.",
    "Whisk the milk into the butter and flour mixture. Bring the milk up to a simmer, whisking frequently. When it reaches a simmer, it will thicken. Once thick enough to coat a spoon, turn the heat down to the lowest setting. Season the white sauce with the salt and garlic powder.",
    "Add a handful of the shredded cheddar to the sauce at a time, whisking until it has fully melted before adding the next handful. Once all of the cheddar has been melted into the sauce, stir in the chopped broccoli. Leave the sauce over a low flame, stirring occasionally, to keep it warm.",
    "When the potatoes are finished baking, carefully slice them open. Use a fork to slightly mash the insides of the potatoes. When ready to serve, place each potato on a plate and ladle the broccoli cheese sauce over each potato. Garnish with extra shredded cheddar, if desired."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "BAKED POTATOES",
    "4 russet potatoes (2 lb. total) ($2.99)",
    "1 Tbsp olive oil ($0.16)",
    "Salt ($0.02)",
    "BROCCOLI CHEESE SAUCE",
    "1/2 lb frozen broccoli florets ($0.85)",
    "3 Tbsp butter ($0.23)",
    "3 Tbsp all-purpose flour ($0.03)",
    "3 cups whole milk ($0.93)",
    "1/2 tsp salt ($0.03)",
    "1/4 tsp garlic powder ($0.02)",
    "6 oz medium cheddar, shredded ($1.46)"
  ],
  "__v": 1
}