{
  "hash": "7c49cd9ded5c25664b37da4c4090a2620a8cd539",
  "title": "Beef tagine",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/75_1_1434019445_lrg.jpg",
  "href": "http://www.jamieoliver.com/recipes/beef-recipes/beef-tagine/",
  "extension": "Chrome",
  "firstAdded": "2015-08-17T09:37:10.471000",
  "users": [
    null
  ],
  "keywords": [
    "quality",
    "stewing",
    "beef",
    "olive",
    "oil",
    "onion",
    "bunch",
    "coriander",
    "tinned",
    "chickpeas",
    "tomatoes",
    "organic",
    "stock",
    "squash",
    "deseeded",
    "chunks",
    "prunes",
    "stoned",
    "roughly",
    "torn",
    "flaked",
    "almonds",
    "spice",
    "rub",
    "salt",
    "black",
    "pepper",
    "level",
    "ras",
    "hanout",
    "cumin",
    "cinnamon",
    "ginger",
    "paprika"
  ],
  "directions": [
    "0",
    "I like to think of a tagine as a sort of stew with attitude. It's really all about the spices and the slow cooking, giving all the wonderful flavours time to develop. What's great is that you don't need an authentic Moroccan tagine in order to recreate this beautiful food – a saucepan will still give you great results. Having been to Marrakesh and learnt all the principles, I now feel I'll be able to rustle up an endless variety of tagines at home. Give this one a try and you'll see what I mean.",
    "Mix all the spice rub ingredients together in a small bowl. Put the beef into a large bowl, massage it with the spice rub, then cover with cling film and put into the fridge for a couple of hours – ideally overnight - that way the spices really penetrate and flavour the meat.",
    "When you're ready to cook, heat a generous lug of olive oil in a tagine or casserole– type pan and fry the meat over a medium heat for 5 minutes. Add your chopped onion and coriander stalks and fry for another 5 minutes. Tip in the chickpeas and tomatoes, then pour in 400ml of stock and stir. Bring to the boil, then put the lid on the pan or cover with foil and reduce to a simmer for 1½ hours.",
    "At this point, add your squash, the prunes and the rest of the stock. Give everything a gentle stir, then pop the lid back on the pan and continue cooking for another 1½ hours. Keep an eye on it and add a splash of water if it looks too dry.",
    "Once the time is up, take the lid off and check the consistency. If it seems a bit too runny, simmer for 5 to 10 minutes, more with the lid off. The beef should be really tender and flaking apart now, so have a taste and season with a pinch or two of salt. Scatter the coriander leaves over the tagine along with the toasted almonds, then take it straight to the table with a big bowl of lightly seasoned couscous and dive in.",
    "*Ras el hanout (Arabic for \"top of the shop\") is a blend of the best spices a vendor has in his shop. The mixture varies depending on who is selling it, but can be a combination of anywhere from 10 to 100 spices. It usually includes nutmeg, cinnamon, mace, aniseed, turmeric, cayenne, peppercorns, dried galangal, ginger, cloves, cardamom, chilli, allspice and orris root."
  ],
  "ingredients": [
    "0",
    "600 g quality stewing beef",
    "olive oil",
    "1 onion, peeled and finely chopped",
    "1 small bunch of fresh coriander",
    "400 g tinned chickpeas, drained",
    "400 g tinned chopped tomatoes",
    "800 ml organic vegetable stock",
    "1 small squash, approximately 800g, deseeded and cut into 5cm chunks",
    "100 g prunes, stoned and roughly torn",
    "2 tablespoons flaked almonds, toasted",
    "For the spice rub",
    "sea salt",
    "freshly ground black pepper",
    "1 level tablespoon ras el hanout spice mix",
    "1 level tablespoon ground cumin",
    "1 level tablespoon ground cinnamon",
    "1 level tablespoon ground ginger",
    "1 level tablespoon sweet paprika"
  ],
  "__v": 1
}