{
  "hash": "7d9145a692142ae4c1482f6a0efbceb3e798895b",
  "title": "tandoori chicken bites",
  "image": "https://lh6.googleusercontent.com/-XrxKek-j3og/T9c-rBexwzI/AAAAAAAAHHg/OGMdpkQTiyo/s640/Tandoori+Chicken+Bites+bowl.jpg",
  "href": "http://www.budgetbytes.com/2012/06/tandoori-chicken-bites/",
  "extension": "Chrome",
  "firstAdded": "2016-02-12T15:04:45.720000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "breasts",
    "plain",
    "yogurt",
    "lemon",
    "juice",
    "garlic",
    "ginger",
    "salt",
    "coriander",
    "cumin",
    "turmeric",
    "cayenne",
    "pepper",
    "garam",
    "masala",
    "paprika",
    "divided"
  ],
  "directions": [
    "0",
    "Cut the chicken breasts into small chunks. I cut each breast into 3-4 strips lengthwise, and then each strip into 4-5 chunks to yield approximately 40 pieces. Place the chicken pieces in a large zip top bag.",
    "Add to the rest of the ingredients to the bag (yogurt, minced garlic, grated ginger, lemon juice, salt, coriander, cumin, turmeric, cayenne, garam masala, and ½ Tbsp of the paprika). Close the bag tightly and smoosh it around to mix the ingredients. Place the bag in the refrigerator for 2 to 24 hours to marinate.",
    "Preheat the oven to 425 degrees. Cover a baking sheet with foil and spray with non-stick spray. Wipe the marinade from the chicken pieces and place them in a bowl. Sprinkle the last tablespoon of paprika and a pinch more of salt over the chicken pieces (add more cayenne if hot chicken pieces are desired). Toss to coat. The extra paprika here just helps the red color, you can skip it if desired. A little extra salt definitely helps, though.",
    "Place the chicken pieces on the prepared baking sheet, spaced out so they do not touch. Bake for 15 minutes in the fully preheated oven. Take the sheet out, turn each piece of chicken over, and bake for an additional 15 minutes. Serve warm."
  ],
  "ingredients": [
    "0",
    "3 large chicken breasts $6.37",
    "½ cup plain yogurt $0.27",
    "1 Tbsp lemon juice $0.05",
    "2 cloves garlic $0.16",
    "1 inch fresh ginger $0.18",
    "½ tsp salt $0.02",
    "½ tsp coriander $0.03",
    "½ tsp cumin $0.03",
    "½ tsp turmeric $0.03",
    "½ tsp cayenne pepper $0.03",
    "½ Tbsp garam masala $0.08",
    "1½ Tbsp paprika, divided $0.23"
  ],
  "__v": 1
}