{
  "hash": "0dc4709d43745205cafd19b5f84aa348fafbf731",
  "title": "Chicken Cacciatore",
  "image": "https://www.jocooks.com/wp-content/uploads/2013/09/chicken-cacciatore-1-4.jpg",
  "href": "https://www.jocooks.com/recipes/chicken-cacciatore/",
  "extension": "Chrome",
  "firstAdded": "2018-10-27T15:56:40.130000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400 F degrees.",
    "Add the olive oil and butter to a large oven-safe skillet with a lid, and heat until butter has melted.",
    "Add the chicken to the skillet and season generously with salt and pepper. Fry the chicken on both sides until golden, about 4 min per side. The chicken doesn't have to be cooked through, as it will continue cooking while in the oven. Transfer the chicken to a plate and set aside.",
    "Add the garlic and onions to the skillet and saute for 2 minutes until the onion is translucent and the garlic becomes aromatic. Add the chopped mushrooms and cook for 5 min until the mushrooms cook down then add the peppers. I like to cook my mushrooms first, but you could add the mushrooms and peppers all at once. Stir and cook for a couple more minutes until the peppers soften a bit.",
    "Add the turmeric, oregano, bay leaves, red wine, tomato paste, and diced tomatoes. Stir well and bring to a boil.",
    "Add the chicken back to the pot, cover with a lid and place in the oven. Bake for 45 minutes to an hour.",
    "Top with whole Kalamata olives and garnish with fresh parsley before serving.",
    "Serve over noodles, rice or polenta."
  ],
  "ingredients": [
    "0",
    "2 tbsp olive oil",
    "2 tbsp butter",
    "2 lb chicken wings and drumsticks",
    "1/2 tsp salt or to taste",
    "1/4 tsp pepper or to taste",
    "4 cloves garlic minced",
    "1 onion medium, chopped",
    "1 lb white mushrooms cleaned and chopped",
    "1 green bell pepper chopped",
    "1 red bell pepper chopped",
    "1 yellow bell pepper chopped",
    "1/4 tsp turmeric",
    "2 tsp dried oregano",
    "2 bay leaves",
    "1 cup red wine",
    "2 tbsp tomato paste",
    "14.5 oz diced tomatoes (1 can)",
    "3/4 cup Kalamata olives pitted",
    "1 tbsp fresh parsley chopped"
  ],
  "__v": 1
}