{
  "hash": "9f5e5d3b415598ac2c16befbe7299ba9fed295d3",
  "title": "Chocolate Peanut Butter Fudgies",
  "image": "http://dietdessertndogs.files.wordpress.com/2008/01/pbfudgycookieclose.jpg",
  "href": "http://www.rickiheller.com/2008/02/and-chocolate-peanut-butter-makes-three/",
  "extension": "Chrome",
  "firstAdded": "2017-01-04T18:06:07.141000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 375 F. Lightly spray two cookie sheets with nonstick coating, or line with parchment paper.",
    "In a medium bowl, cream the peanut butter with the Sucanat and oil. Add the maple syrup, vanilla, vinegar, and eggplant and mix to combine well.",
    "In a large bowl, sift together the flour, cocoa, baking soda, baking powder, and salt.",
    "Pour the wet mixture over the dry and stir to mix well. You should have a slightly sticky dough, but one that still holds its shape.",
    "Using a tablespoon or small ice cream scoop, place mounds of dough on the cookie sheet about 2 inches apart. Wet your hands and flatten the cookies slightly (to about 1/4 inch thickness) with your palms, or use the bottom of a glass dipped in water.",
    "Bake in preheated oven about 12 minutes, rotating pans halfway, until cookies are puffed and cracked on top. Remove from oven and allow to cool completely before removing from the sheets (they will firm up as they cool).",
    "Makes about 30 cookies. These may be frozen."
  ],
  "ingredients": [
    "0",
    "Chocolate Peanut Butter Fudgies",
    "These cookies present the ultimate mixture of chocolate and peanut butter, with a base that’s crispy on the edges and chewy in the middle. No one will ever guess that they’re housing some hidden eggplant in the batter!",
    "1/2 cup natural crunchy peanut butter",
    "2/3 cup Sucanat or other unrefined evaporated cane juice",
    "1/4 cup sunflower oil or other light-tasting oil",
    "1/2 cup pure maple syrup",
    "1 Tbsp. pure vanilla extract",
    "1 tsp. apple cider vinegar",
    "1/3 cup pureed cooked eggplant (you may substitute another moisture-rich vegetable, such as cooked zucchini, or use unsweetened applesauce)",
    "1-1/2 cups light spelt flour",
    "1/3 cup dark cocoa powder",
    "1 tsp. baking soda",
    "1 tsp. baking powder",
    "1/2 tsp. fine sea salt"
  ],
  "__v": 1
}