{
  "hash": "5a9adedd5d8b7d64ea0948942a60b1e064b94f32",
  "title": "Tamago Boro (Egg Biscuits)",
  "image": "http://food-4tots.com/wp-content/uploads/2014/04/P3094302-copy2.jpg",
  "href": "http://food-4tots.com/2014/04/16/tamago-boro-egg-biscuits/2/",
  "extension": "Chrome",
  "firstAdded": "2015-06-02T09:38:42.862000",
  "users": [
    null
  ],
  "keywords": [
    "potato",
    "starch",
    "refer",
    "low",
    "protein",
    "cake",
    "flour",
    "dry",
    "baking",
    "milk",
    "icing",
    "sugar",
    "sifted",
    "egg",
    "corn",
    "flavourless",
    "salad",
    "oil"
  ],
  "directions": [
    "0",
    "Methods:",
    "Mix together potato starch flour, low protein flour, milk powder and baking powder until well-combined. Sieve and set aside.",
    "Break egg in a mixing bowl. Beat until the yolk and white are well mixed. No need to beat until foamy. Use only 50g of this egg liquid.",
    "Stir in icing sugar in 2-3 batches and mix well after each addition.",
    "Stir in flour mixture from step 1 in 2-3 batches and mix well after each addition (note 2). Add in oil and combine well. You will get a sticky and wet dough. Do not add any extra flour as the dough will turn dry after some time. You should be able to roll a small piece of dough into ball.",
    "Cover the dough with a damp cloth (note 3).",
    "Cut the dough into tiny pieces (slightly bigger than the size of a soya bean, approximately 1 gram) (note 4)",
    "Arrange the biscuits on a baking tray lined with baking parchment paper. Allow some gaps between the biscuits.",
    "Preheat oven at 170°C (note 5).",
    "Spray water onto the biscuits. Transfer the tray to the oven and bake for 10-15 minutes or until light golden brown. Give the biscuits another spray before you close the door of the oven. Rotate the tray 180 degree half way during baking for even colour. If you want texture to be crunchy, bake for another 8-10 minutes (note 6 & 7).",
    "After baking, remove the baking tray from oven and transfer the egg biscuits to a cooling rack. Leave to cool down completely before storing in an air-tight container."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "140g potato starch (refer to photo below)",
    "20g low protein flour (cake flour)",
    "20g dry milk (baking milk powder) (note 1)",
    "1 teaspoon baking powder",
    "40g icing sugar (sifted)",
    "50g egg liquid (about one 65g large egg)",
    "2 teaspoons of corn oil (or any flavourless salad oil)"
  ],
  "__v": 1
}