{
  "hash": "f3e381bd1e15c4844c100a049de2a11b431d6539",
  "title": "Slow Cooker French Onion Soup",
  "image": "http://s3.amazonaws.com/yummy_uploads2/blog/5331.jpg",
  "href": "http://www.theyummylife.com/French_Onion_Soup",
  "extension": "Firefox",
  "firstAdded": "2015-05-02T13:28:33.403000",
  "users": [
    null
  ],
  "keywords": [
    "caramelized",
    "onions",
    "yellow",
    "olive",
    "oil",
    "soup",
    "dry",
    "sherry",
    "chicken",
    "broth",
    "lowsodium",
    "recommended",
    "beef",
    "reduced",
    "sodium",
    "soy",
    "sprigs",
    "thyme",
    "tied",
    "bundle",
    "twine",
    "bay",
    "leaf",
    "black",
    "pepper",
    "salt",
    "cheesy",
    "bread",
    "hearty",
    "fit",
    "inside",
    "bowl",
    "baguette",
    "slices",
    "parmesan",
    "cheese",
    "gruyere",
    "swiss",
    "stringier",
    "use",
    "mozzarella"
  ],
  "directions": [
    "0",
    "Step 1, Caramelize the Onions:",
    "Cut the peeled onions in halves and then quarters from pole to pole. Cut each quarter, pole to pole, in 1/4 inch slices. Coat inside of slow cooker with cooking spray. Add sliced onions and olive oil to slow cooker; toss with tongs or 2 forks to separate slices and distribute olive oil. Cover and cook on high for approx. 12-14 hours, until browned to caramel color. Keep an eye on them during the last few hours of cooking time; if they begin to burn around the edges, stir, re-cover, and continue cooking until caramelized throughout.",
    "Step 2, Make the Soup:",
    "Add the sherry to the caramelized onions in the slow cooker, and cook on high with the lid off for 1/2 hour to evaporate the alcohol. Add chicken and beef broths & soy sauce. Tie thyme sprigs into a bundle with cooking twine. Add thyme, bay leaves, and black pepper to the soup. Stir, cover and cook on high for 1-1/2 hours. Remove bay leaf and thyme sprigs. Taste and add salt, if needed. (For speedier finishing on the stove-top, transfer caramelized onions to a large stove-top pan. Add the sherry and cook on medium-high heat for 10 minutes. Add the broths, soy sauce, and seasonings; cover and simmer for 30 minutes.)",
    "Step 3, Refrigerate:",
    "Put soup in fridge overnight or up to 2 days.",
    "Step 4, Prepare the Bread:",
    "Place bread slices on a baking sheet, and toast in a 400 degree oven until the bread is dry and crisp, approx. 10-15 minutes.",
    "Step 5, Assemble and Broil Individual Bowls:",
    "Reheat desired amount of soup in microwave or on stove top. Ladle heated soup into individual oven-safe bowls, top with the toasted bread, sprinkle on grated Parmesan, and then shredded Gruyere. Adjust oven rack to 6\" below broiler. Place bowls on baking sheet and broil just until cheese completely melts, 3-4 minutes. (If you don't have oven proof bowls, melt the cheese on top of the toasted bread and transfer the cheese toast to the top of filled bowls of hot soup.)",
    "The soup (minus the bread and cheese) freezes well.",
    "Nutritional Info (for one 10-oz serving topped with bread and cheese): 289 calories, 16g fat, 22.7g carbs, 4.1g fiber, 5.6g sugar, 17.3g protein; Weight Watchers PointPlus: 8"
  ],
  "ingredients": [
    "0",
    "FOR CARAMELIZED ONIONS:",
    "6 large yellow onions",
    "2 tablespoons olive oil",
    "FOR SOUP:",
    "1/2 cup dry sherry",
    "4 cups chicken broth (low-sodium recommended)",
    "2 cups beef broth",
    "1/3 cup reduced sodium soy sauce",
    "6 sprigs fresh thyme, tied in bundle with twine",
    "1 bay leaf",
    "1/2 teaspoon ground black pepper",
    "salt to taste",
    "FOR CHEESY TOASTED BREAD TOPPING:",
    "6 large hearty bread slices (1/2\" thick) cut to fit inside top of soup bowl; or 12 (or more) small baguette slices",
    "6 tablespoons grated Parmesan cheese",
    "2-1/2 cups (8 oz) shredded Gruyere cheese (may substitute Swiss; or, for stringier melted cheese use half shredded mozzarella)"
  ],
  "__v": 3
}