{
  "hash": "fdea7ec9c6fe3dec5be4e50426f722dc1e9bafcc",
  "title": "the best sweet potato gnocchi",
  "image": "https://static1.squarespace.com/static/55ef7551e4b0b4a9db94c388/t/565e893ee4b0298e19c21921/1449036120481/the+best+sweet+potato+gnocchi?format=1500w",
  "href": "http://www.chewandtaste.com/blog/best-sweet-potato-gnocchi",
  "extension": "Chrome",
  "firstAdded": "2016-10-01T15:07:50.549000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "1. Preheat your oven to 425°F. Drizzle your potatoes with olive oil, and a little salt and then place them on a baking sheet, w/the cut-side down, and roast until tender enough to put a fork through, about 30-40 minutes.",
    "2. Once they have cooled down a little, run the potato flesh (w/out skins)* through a potato ricer (or if you don't have one a potato masher or large fork will work) and in the egg, and add the flour, 1/2 cup at a time, until a dough forms. *( I recommend keeping the potato skins for a delicious snack the next day :)",
    "3. To know how much flour to use, add flour until the dough is moist but not sticky. My advice is, if this is your first time and you are in doubt, err on the side of adding more flour (I had a royal flop when I didn't add enough, so I'm sensitive)",
    "4. On a floured clean surface, divide the dough into about 8 equal pieces. Rolling each individual piece into a rope ( 1/2 inch in diameter).",
    "5. Cut each rope into many 1/2 -inch gnocchi sized pieces.",
    "6. Bring a big ol' pot of salted water to a gentle boil over medium heat. Working in batches, simmer the gnocchi for about 5 minutes, wait just a minute or so past when they float to the surface of the water. Using a slotted spoon to scoop out and place the gnocchi on a baking sheet. Reserve about 1/4 a cup of the gnocchi cooking water.",
    "For the sauce:",
    "7. In a large frying pan, melt the butter over medium heat. Once it starts foaming, add your sliced shallots and, watching it carefully allow the butter to start to brown, be stirring to ensure the mixture doesn't stick to the bottom of the pan. Next add your chopped rosemary and thyme.",
    "8. When the butter is brown, remove your pan from the stove, and stir in the balsamic vinegar. Stir in gnocchi and 1/4 cup of the reserved pasta water, return to heat, and cook until just coated in the sauce. Finish with your cheese garnish and salt and pepper to taste!"
  ],
  "ingredients": [
    "0",
    "ngredients",
    "1/4 pound Russet potatoes (cut in half lengthwise)",
    "3/4 pounds sweet potatoes (cut in half lengthwise)",
    "1 large egg",
    "1 to 2 cups all purpose flour",
    "1 tbls olive oil",
    "2 tsp salt",
    "3 tbsp butter",
    "3 sprigs rosemary, and 3 sprigs thyme",
    "garnish of parmesan cheese",
    "brown butter sauce",
    "2 shallots sliced thinly",
    "3 tbsp balsamic vinegar"
  ],
  "__v": 1
}