{
  "hash": "8c1ef401dabe08e8eb0abdeb01e04c234e1c0c97",
  "title": "ENCHANTED FLORET\nA versatile vegetable takes to the soup pot",
  "image": "http://prodstatics3cdn1.purewow.com/images/articles/2012_02/EnchantedFloret549x305.jpg",
  "href": "http://www.purewow.com/entry_detail/recipe/1593/A-versatile-vegetable-takes-to-the-soup-pot.htm",
  "extension": "Chrome",
  "firstAdded": "2015-03-30T18:50:02.443000",
  "users": [
    null
  ],
  "keywords": [
    "prosciutto",
    "slices",
    "unsalted",
    "butter",
    "yellow",
    "onion",
    "celery",
    "stalks",
    "trimmed",
    "garlic",
    "head",
    "cauliflower",
    "coarsely",
    "nutmeg",
    "chicken",
    "broth",
    "preferably",
    "cream",
    "salt",
    "white",
    "pepper"
  ],
  "directions": [
    "0",
    "Preheat the oven to 375˚. Arrange the prosciutto slices in a single layer on a parchment paper-lined baking sheet. Bake about 10 minutes or until crispy. Let cool slightly, then crumble the prosciutto into pieces and set aside.",
    "Meanwhile, in a large pot melt the butter over medium-high heat. Add the onion, celery and garlic and cook, stirring occasionally, until the vegetables are soft, about 5 minutes. Add the cauliflower and nutmeg, stir well to coat and cook, stirring occasionally, for 5 minutes.",
    "Add the broth to the pot and bring the mixture to a boil. Reduce the heat to low, partially cover the pot and simmer the soup until the cauliflower is very tender, about 20 minutes. Remove from heat and let cool slightly.",
    "Working in batches, puree the soup in a blender or the bowl of a food processor fitted with a steel blade attachment (or use an immersion blender). Return the soup to the pot and add more broth if it's too thick. Stir in the cream and season with salt and pepper. Divide the soup among bowls, garnish with the prosciutto and serve immediately."
  ],
  "ingredients": [
    "0",
    "2 ounces thinly sliced prosciutto (about 3 slices)",
    "2 tablespoons unsalted butter",
    "1 yellow onion, finely chopped (about 2 cups)",
    "2 celery stalks, trimmed and finely chopped (about ½ cup)",
    "2 garlic cloves, finely chopped",
    "1 head cauliflower, trimmed and coarsely chopped (about 4 cups)",
    "¼ teaspoon freshly grated nutmeg",
    "4 cups chicken broth, preferably homemade",
    "¼ cup heavy cream",
    "Salt and freshly ground white pepper"
  ],
  "__v": 1
}