{
  "__v": 1,
  "directions": [
    "0",
    "Warm a stockpot over medium heat. Add the oil. When hot, add the chicken legs. Brown all sides for about ten minutes, rotating them for an even browning as necessary.",
    "Meanwhile, combine the miso paste with about 1 cup of the chicken broth. Mash it with a spoon to dissolve. Set aside.",
    "When the chicken has a nice, brown crust, add the remaining chicken broth, the water and the dissolved miso paste. Deglaze the pot by scraping any browned bits from the bottom.",
    "Add the ginger, garlic and sherry. Reduce heat and let the chicken legs simmer until cooked through, another 20 minutes or so. When the chicken is ready, remove from the pot with tongs and set aside to cool. (Placing in a fridge or freezer will expedite the cooling process.)",
    "Turn off the heat on the broth, and skim any excess fat off the top.",
    "While the chicken is cooling, cook the pasta according to directions – but be very careful to not overcook! Drain and set aside.",
    "Prepare your vegetables. Wash and dice the green onions, chop the broccoli florets into bite-size chunks, wash the arugula.",
    "When the chicken is cool enough to be handled, remove skin and tear or chop into bite-size chunks.",
    "Return the broth to a low flame. Add the broccoli and chicken and allow to simmer until broccoli is cooked but firm. Turn off heat and add green onions and arugula. Due to the saltiness of the miso, you may not need to add any salt. However, a few twists of a pepper mill is a welcome touch.",
    "Ladle soup into bowls, and divide the noodles among each bowl. Serve hot!"
  ],
  "firstAdded": "2014-06-18T16:48:02.960000",
  "hash": "fcee9a9307b23c009496a7c2d3eccd68e31c6668",
  "href": "http://theyearinfood.com/2010/12/chicken-ginger-soup-with-noodles.html",
  "image": "http://farm6.staticflickr.com/5244/5261834532_81a72d6dbc_b.jpg",
  "ingredients": [
    "0",
    "3 chicken legs",
    "4 cups chicken broth",
    "2 cups water",
    "3 tablespoons miso (I used Westbrae’s Brown Rice Miso, which has a pleasing, subtle sweetness to it)",
    "3 tablespoons fresh ginger, minced (I like ginger! Use a little less if you aren’t as enamored)",
    "2 large cloves garlic, minced",
    "2 tablespoons dry sherry, optional",
    "4 ounces dry pasta (I use vermicelli rice noodles, but anything will work: conventional pasta, soba, buckwheat noodles, etc)",
    "1 bunch green onions",
    "1.5 cups broccoli florets",
    "2 cups arugula or spinach",
    "2 teaspoons oil",
    "salt + pepper to taste"
  ],
  "keywords": [
    "chicken",
    "legs",
    "broth",
    "water",
    "used",
    "westbraes",
    "brown",
    "rice",
    "miso",
    "pleasing",
    "subtle",
    "sweetness",
    "ginger",
    "use",
    "arent",
    "enamored",
    "garlic",
    "dry",
    "sherry",
    "vermicelli",
    "work",
    "conventional",
    "pasta",
    "soba",
    "buckwheat",
    "noodles",
    "bunch",
    "green",
    "onions",
    "broccoli",
    "florets",
    "arugula",
    "spinach",
    "oil",
    "salt",
    "pepper"
  ],
  "title": "CHICKEN GINGER SOUP WITH NOODLES",
  "users": [
    null
  ]
}