{
  "hash": "149829effce913886d6810b810947aff19793aa5",
  "title": "Healthy Dark Chocolate Peppermint Cookies\nsimplyquinoa.com\nI made this ADD IMAGE Dessert\nThe Add tag button has moved! Click the tag (label) icon above the recipe to open the Tag menu. OK",
  "image": "https://cmt.azureedge.net/media/healthy_dark_chocolate_peppermint_cookie_2018103002140451248246ufbd.jpg",
  "href": "https://www.copymethat.com/r/P1FvOZu/healthy-dark-chocolate-peppermint-cookie/",
  "extension": "",
  "firstAdded": "2018-12-28T23:43:29.732000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350ºF and line a baking sheet with parchment paper.",
    "Whisk together the flours, cocoa powder and other dry ingredients (minus the sugar) in medium mixing bowl and set aside.",
    "Beat together the coconut oil and sugar until fluffy. Beat in remaining wet ingredients.",
    "Add half of the dry ingredients into the wet ingredients and stir with a large wooden spoon until combined. Add in the rest of the dry ingredients and continue to mix until you have a thick, cookie-like dough. Fold in the chocolate chips.",
    "Spoon the dough into your hands and shape into balls. Place on parchment lined baking sheet and gently flatten with your hands (this is optional, but make the cookies more uniform in shape). Sprinkle with crushed peppermint candies if desired.",
    "Bake in the center of a warm oven for 12 minutes, until the edges are lightly browned and the top of the cookies is still slightly tender to the touch.",
    "Cool on a wire rack for 5 - 10 minutes and enjoy!",
    "Dunk these babies in a glass of almond milk (or regular milk if you so choose) and relish in the chocolatey goodness that you just created."
  ],
  "ingredients": [
    "0",
    "1/2 cup buckwheat flour",
    "1/2 cup quinoa flour",
    "2 tablespoons tapioca starch",
    "1/4 cup raw cacao powder",
    "1/2 teaspoon baking soda",
    "1/2 teaspoon fine sea salt",
    "1/3 cup coconut oil",
    "1/2 cup coconut sugar",
    "1/4 cup maple syrup",
    "1 tablespoon nut/seed butter of choice I like tahini",
    "1 flax egg",
    "1 teaspoon vanilla extract",
    "1/2 - 1 teaspoon peppermint extract",
    "1/2 cup dark chocolate chips",
    "Crushed peppermint candies to garnish optional"
  ],
  "__v": 1
}