{
  "hash": "40183db1e03a1d96533791474678c0d2369d3eaf",
  "title": "Smoked Pork Loin with Dried-Fruit Chutney",
  "image": "http://recipe-folder.com/img/recipe-images/009/651/17154609.jpg",
  "href": "https://www.americastestkitchen.com/recipes/9062-smoked-pork-loin-with-dried-fruit-chutney?incode=MASAD00L0&ref=new_search_experience_1",
  "extension": "Chrome",
  "firstAdded": "2017-08-28T15:08:53.787000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prep Time: Minutes ━ Difficulty: Easy ━ Servings: Servings",
    "NOTE - The roast needs to be refrigerated for at least 6 hours or up to 24 hours after the salt rub is applied. A blade-end roast is our preferred cut, but a center-cut boneless loin roast can also be used. Any variety of wood chip except mesquite will work; we prefer hickory. If you’d like to use wood chunks instead of wood chips when using a charcoal grill, substitute two medium wood chunks, soaked in water for 1 hour, for the wood chip packet.",
    "FOR THE PORK: Combine sugar and salt in small bowl. Tie roast with twine at 1-inch intervals. Rub sugar-salt mixture over entire surface of roast, making sure roast is evenly coated. Wrap roast tightly in plastic wrap, set roast in rimmed baking sheet, and refrigerate for at least 6 hours or up to 24 hours.",
    "Just before grilling, soak wood chips in water for 15 minutes, then drain. Using large piece of heavy-duty aluminum foil, wrap soaked chips in 8 by 4 1/2-inch foil packet. (Make sure chips do not poke holes in sides or bottom of packet.) Cut 2 evenly spaced 2-inch slits in top of packet.",
    "FOR A CHARCOAL GRILL: Open bottom vent halfway. Arrange 25 unlit charcoal briquettes over half of grill and place disposable pan filled with 3 cups water on other side of grill. Light large chimney starter two-thirds filled with charcoal briquettes (4 quarts). When top coals are partially covered with ash, pour evenly over unlit briquettes. Place wood chip packet on coals. Set cooking grate in place, cover, and open lid vent halfway. Heat grill until hot and wood chips are smoking, about 5 minutes.",
    "FOR A GAS GRILL: Remove cooking grate and place wood chip packet directly on primary burner. Place disposable pie plate filled with 1 inch water directly on other burner(s). Set grate in place, turn all burners to high, cover, and heat grill until hot and wood chips are smoking, about 15 minutes. Turn primary burner to medium and turn off other burner(s). (Adjust primary burner as needed to maintain grill temperature of 300 degrees.)",
    "Clean and oil cooking grate. Unwrap roast and pat dry with paper towels. Place roast on grill directly over water pan about 7 inches from heat source. Cover (position lid vent over roast if using charcoal) and cook until meat registers 140 degrees, 1 1/2 to 2 hours, rotating roast 180 degrees after 45 minutes.",
    "FOR THE CHUTNEY: Combine wine, apricots, cherries, vinegar, water, sugar, shallot, and ginger in medium saucepan. Bring to simmer over medium heat. Cover and cook until fruit is softened, 10 minutes. Remove lid and reduce heat to medium-low. Add butter, Dijon, and dry mustard and continue to cook until slightly thickened, 4 to 6 minutes. Remove from heat and season with salt. Transfer to bowl and let stand at room temperature.",
    "Transfer roast to cutting board, tent with foil, and let stand for 30 minutes. Remove and discard twine. Slice roast 1/4 inch thick and serve with chutney."
  ],
  "ingredients": [
    "0",
    "PORK",
    "½\tcup packed light brown sugar",
    "¼\tcup Kosher salt",
    "1\t(3 1/2- to 4-pound) blade-end boneless pork loin roast, trimmed",
    "2\tcups wood chips",
    "1\tDisposable 13 by 9-inch aluminum roasting pan (if using charcoal) or 1 (9-inch) disposable aluminum pie plate (if using gas)",
    "CHUTNEY",
    "¾\tcup dry white wine",
    "½\tcup dried apricots, diced",
    "½\tcup dried cherries",
    "¼\tcup white wine vinegar",
    "3\ttablespoons water",
    "3\ttablespoons packed light brown sugar",
    "1\tshallot, minced",
    "2\ttablespoons grated fresh ginger",
    "1\ttablespoon unsalted butter",
    "1\ttablespoon Dijon mustard",
    "1 ½\tteaspoons dry mustard",
    "Kosher salt"
  ],
  "__v": 3
}