{
  "hash": "2cd135ff30079417d282517de21fe3d00d84f3c6",
  "title": "Brown Butter Pecan Pie Bars",
  "image": "https://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2016/10/brown-butter-pecan-pie-bars-5.jpg",
  "href": "https://sallysbakingaddiction.com/2016/11/02/brown-butter-pecan-pie-bars/",
  "extension": "Chrome",
  "firstAdded": "2018-09-15T22:11:17.335000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350°F (177°C) and grease a 9x13 inch pan or line with parchment paper leaving an overhang on the sides to lift the finished bars out. Set aside.",
    "For the crust: Slice the butter up into pieces and place in a light-colored skillet. (Light colored helps you determine when the butter begins browning.) Melt the butter over medium heat, stirring occasionally. Once melted, the butter will begin to foam. Keep stirring occasionally. After 5-8 minutes, the butter will begin browning-- you'll notice lightly browned specks begin to form at the bottom of the pan and it will have a nutty aroma. Once browned, remove from heat immediately and allow to cool for 5 minutes.",
    "In a large bowl, stir the brown butter, granulated sugar, vanilla extract, and salt together in a medium bowl. Stir in the flour until evenly combined. Press the mixture evenly into the prepared baking pan. Bake for 15 minutes.",
    "For the topping: Combine the butter, brown sugar, maple syrup, and heavy cream in a medium saucepan over medium heat. Whisk to combine the ingredients and dissolve the sugar. Bring to a boil and allow to boil for 3 minutes. As it is boiling, carefully spoon 1/2 cup of the mixture into a glass measuring cup. Slowly drizzle and stir hot mixture into the eggs. Stir frequently to keep it moving so the eggs do not scramble. Once all of the mixture is added to the beaten eggs, slowly drizzle and whisk this back into the pot. The trick is to always be stirring/whisking to avoid scrambling the eggs. Remove from heat, stir in the pecans, and pour evenly over the crust.",
    "Bake for 30-35 minutes. A toothpick inserted in the center should come out *mostly* clean. If the top is getting too brown as it bakes, loosely cover with aluminum foil. Remove from the oven, set on a wire rack, and allow to cool completely before cutting into squares. Cover and store leftover bars at room temperature or in the refrigerator for up to 1 week."
  ],
  "ingredients": [
    "0",
    "Brown Butter Crust",
    "1 cup (230g; 2 sticks) unsalted butter",
    "1/2 cup (100g) granulated sugar",
    "1 teaspoon pure vanilla extract",
    "1/2 teaspoon salt",
    "2 cups (250g) all-purpose flour (spoon & leveled)",
    "Pecan Pie Topping",
    "1/2 cup (115g) unsalted butter",
    "1/2 cup (100g) packed light or dark brown sugar (I prefer dark here)",
    "1/2 cup (120ml) pure maple syrup",
    "2 Tablespoons (30ml) heavy cream",
    "2 large eggs, beaten",
    "3 cups (300g) coarsely chopped Diamond of California shelled pecans",
    "optional: sea salt for sprinkling"
  ],
  "__v": 1
}