{
  "hash": "39c3a73ec55a9a7d1e6a4072612a416d65371129",
  "title": "Zucchini in Herbed Coconut Yogurt Curry",
  "image": "https://xebiijq7c0-flywheel.netdna-ssl.com/wp-content/uploads/2017/04/zucchini-in-yogurt-coconut-curry12.jpg",
  "href": "https://brooklynsupper.com/coconut-yogurt-curry/",
  "extension": "Chrome",
  "firstAdded": "2017-05-02T13:52:10.601000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To make the curry sauce: Thaw frozen coconut or place dried coconut in a little hot water to plump it up.",
    "In a blender, grind the roasted chana dal to a powder. Add the cumin seeds, black mustard seeds, and turmeric powder and grind. Have about 1 cup of water by the blender. Next, grind the coconut and green chiles, adding a little water to help the blades along. Then add the cilantro and slowly add just enough water to keep the blender blades moving, about 1/2 cup, depending on the size of your blender container. Grind until you have a smooth paste, add the yogurt. Blend well so that all of the paste is incorporated.",
    "Cut the squash in half lengthwise. Then cut each half into 1/2-inch-thick rounds, with large pieces cut into half again.",
    "In a sauté pan, fit a steamer with water at a level that is just below the steamer and not touching it. Place the summer squash in the steamer basket. Cover and steam over medium heat until just tender, about 10 minutes. Immediately immerse the squash in a bowl of cold water to avoid overcooking.",
    "Put the oil in the sauté pan over medium heat. When the oil is hot and shimmering, add one black mustard seed. When the seed sizzles and pops, add the remaining mustard seeds and the asafetida. Keep a lid handy to cover the pan while the mustard seeds are popping. When the popping starts to subside (a few seconds), turn the heat to medium-low. Rub the curry leaves between your fingers a little to release their natural oils, and drop them and the dried red chile into the oil. Cover immediately, as moisture from the curry leaves will cause the oil to spatter. Then stir to evenly coat everything with oil, a few seconds.",
    "Mix the steamed summer squash into the pan. Next, add the curry sauce and 1 teaspoon salt. Turn the heat to medium. You want the mixture to boil once. When it does, turn it off.",
    "Taste for salt and adjust as needed. Garnish with cilantro leaves. Serve with rice. The dish is served either just prepared or chilled. If eating the next day, do not reheat before serving."
  ],
  "ingredients": [
    "0",
    "Curry Sauce",
    "1/2 cup unsweetened grated coconut (fresh, frozen, or dried)",
    "1 tablespoon roasted chana dal (chana dalia)*",
    "1/2 teaspoon cumin seed",
    "1 1/2 teaspoons black mustard seeds",
    "1/4 teaspoon turmeric powder",
    "2 or 3 Indian green chiles or serrano chiles",
    "1 cup cilantro leaves and tender stems",
    "2 cups plain yogurt , lightly beaten by hand",
    "Squash",
    "1 pound summer squash (2 or 3 small yellow or green zucchini)",
    "2 teaspoons mild-flavored oil such as canola",
    "1/2 teaspoon black mustard seeds",
    "pinch of asafetida (hing) powder",
    "1 sprig curry leaves (about 20 leaves)",
    "1 dried red chile , broken in half",
    "salt",
    "cooked rice , for serving",
    "chopped cilantro leaves , for garnish"
  ],
  "__v": 1
}