{
  "__v": 1,
  "directions": [
    "0",
    "PREPARAZIONE PIZZA VELOCE FATTA IN CASA",
    "1Procuratevi una ciotola che possa farvi lavorare agevolmente e versateci l'acqua tiepida: il leggero calore dell'acqua è necessario per dare modo ai lieviti di attivarsi, poiché state preparando un impasto con tempi stretti e vi serve una lievitazione esplosiva. Sciogliete quindi lievito e zucchero in acqua e, una volta terminato, versateci tutta la farina. Eliminate i grumi con un cucchiaio di legno e iniziate a impastare con una mano dentro la ciotola, aiutandovi girandola in senso orario con l'altra mano, simulando così il lavoro di un'impastatrice professionale.",
    "2Ripiegate l’impasto su se stesso lavorandolo per circa 5 minuti, unite il sale e l’olio impastando per qualche altro minuto e fermatevi per circa 10 minuti coprendo la ciotola con un canovaccio. Riprendete l'impasto lavorandolo sul piano allo stesso modo della ricetta della pizza in teglia, fino a ottenere una massa compatta e leggermente appiccicosa: è importante che non ci siano più grumi. Ungete un contenitore capiente con dell'olio extravergine e poneteci l'impasto coprendolo con pellicola trasparente. A questo punto servono due condizioni fondamentali per la lievitazione, calore e umidità: fate scaldare dell'acqua in un pentolino fino a ebollizione e mettetelo nel forno spento vicino all'impasto, chiudendo la porta. Avrete ottenuto una camera di lievitazione. Lasciate che l'impasto cresca nel forno.",
    "3",
    "FacebookTwitterGooglePinterest",
    "Per una pizza in teglia alta, morbida e soffice (come quella che vedete realizzata nelle foto di questa ricetta), tirate fuori l'impasto dal forno dopo 1 ora e stendetelo delicatamente sul banco di lavoro spolverizzato di farina. Trasferite quindi l'impasto in una teglia leggermente unta di olio e finite di stenderlo con delicatezza per preservare i gas di lievitazione.",
    "4",
    "FacebookTwitterGooglePinterest",
    "Conditelo con pomodori pelati spezzettati a mano o passati al passaverdura e un filo di olio extravergine; mettete la teglia nel forno spento a lievitare per altri 30 minuti. A questo punto tirate fuori la teglia per preriscaldare il forno alla massima temperatura per almeno 30 minuti.",
    "5",
    "FacebookTwitterGooglePinterest",
    "Cuocete la pizza sul pavimento del forno per almeno 10 minuti; condite poi con la mozzarella e trasferite la teglia in alto (a 3/4 di altezza del forno) per terminare la cottura: ci vorranno circa 3-4 minuti e la mozzarella dovrà essersi sciolta. Qualora voleste invece una pizza in teglia più bassa e croccante, dovrete lasciare l’impasto a lievitare nel forno per circa un’ora e mezzo; tiratelo fuori stendendolo delicatamente sul banco di lavoro spolverizzato di farina e trasferitelo in una teglia unta leggermente di olio. Anche in questo caso il forno dovrà essere preriscaldato alla temperatura più alta possibile per almeno 30 minuti e la pizza dovrà cuocere senza mozzarella per almeno 10 minuti. Condite con la mozzarella e terminate la cottura esattamente come per la versione precedente.",
    "Potete spolverizzare la pizza con dell'origano prima di servirla in tavola.",
    "VARIANTE PIZZA VELOCE FATTA IN CASA",
    "Qualora voleste fare pizze differenti dalla classica margherita, ricordatevi che ogni condimento ha il proprio tempo di cottura, quindi regolatevi di conseguenza per evitare di stracuocere o lasciare ancora crudo qualche ingrediente."
  ],
  "firstAdded": "2014-10-08T14:07:17.029000",
  "hash": "8bddb2b7a8bda09e66e277d9be5430009c912d24",
  "href": "http://www.agrodolce.it/ricette/pizza-veloce-fatta-in-casa/",
  "image": "http://cdn3.www.agrodolce.it/wp-content/uploads/2014/01/pizzaeasy6_1-640x399.jpg",
  "ingredients": [
    "0",
    "Farina 00400 g",
    "Acqua tiepida250 g",
    "Lievito di birra fresco5 g",
    "Olio extravergine di oliva10 g",
    "Sale10 g",
    "Zucchero1 pizzico",
    "Pomodori pelati300 g",
    "Mozzarella250 g"
  ],
  "keywords": [
    "farina",
    "acqua",
    "tiepida",
    "lievito",
    "birra",
    "fresco",
    "olio",
    "extravergine",
    "oliva",
    "sale",
    "zucchero",
    "pizzico",
    "pomodori",
    "pelati",
    "mozzarella"
  ],
  "title": "Pizza veloce fatta in casa",
  "users": [
    null
  ]
}