{
  "hash": "70eb99477777fcd59e4b95f7c84b9941d08487bd",
  "title": "Mediterranean Leg Of Lamb Roast {Instant Pot}",
  "image": "",
  "href": "https://traditionalcookingschool.com/food-preparation/instant-pot-lamb-roast/",
  "extension": "Firefox",
  "firstAdded": "2018-02-23T15:01:27.290000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Turn electric cooker to sauté, or put stove-top cooker on burner over medium heat.",
    "Let it get quite hot. If using an electric cooker, wait until the screen says HOT.",
    "Then drizzle in olive oil.",
    "Put the roast in, and swirl it around so it can get coated with oil.",
    "Lift it off the bottom of the cooker to prevent sticking.",
    "Then let it sear on one side, then flip it over to sear on the other side.",
    "Sprinkle the roast with the salt, pepper, and all herbs.",
    "Add broth.",
    "Then cover the pot, checking the seal and components to make sure all is well.",
    "If using an electric cooker, set to high pressure for 50 minutes.",
    "If using a stove-top cooker, bring to high pressure and maintain for 45 to 50 minutes.",
    "Then, when cooking time is done, place a towel over the venting knob to do a quick pressure release.",
    "Open the lid.",
    "Add potatoes.",
    "Then cover the pot, checking the seal and components to make sure all is well.",
    "If using an electric cooker, set to high pressure for 10 minutes.",
    "If using a stove-top cooker, bring to high pressure and maintain for 9 to 10 minutes.",
    "Then, when cooking time is done, place a towel over the venting knob to do a quick pressure release. Open the lid.",
    "Check potatoes for doneness.",
    "Then, using a slotted spoon, transfer the potatoes and roast to a serving platter.",
    "Cover to keep warm while you make the gravy out of the broth.",
    "Finally, whisk the arrowroot into the water, then add to the broth in the pot while stirring. It should thicken immediately from the retained heat; you can turn it to sauté if it needs additional heat for thickening.",
    "Serve and enjoy!"
  ],
  "ingredients": [
    "0",
    "2 tablespoons olive oil",
    "5 to 6 pound leg of lamb, bone-in or boneless",
    "1 teaspoon sea salt",
    "1 bay leaf, crushed",
    "1/2 teaspoon pepper",
    "1 teaspoon marjoram",
    "1 teaspoon sage",
    "3 cloves garlic, minced",
    "1 teaspoon ginger",
    "1 teaspoon thyme",
    "2 cups broth",
    "2-1/2 to 3 pound potatoes, peeled and cut into 2\" to 3\" pieces",
    "2 to 3 tablespoons arrowroot powder + 1/3 cup water (optional)"
  ],
  "__v": 1
}