{
  "__v": 1,
  "directions": [
    "0",
    "Marinate the chicken: In a medium bowl, stir together the soy sauce, rice wine, and cornstarch until the cornstarch is dissolved. Add the chicken and toss to coat. Let stand for 10 minutes.",
    "Prepare the sauce: In another bowl, combine the vinegar, soy sauce, hoisin sauce, sesame oil, sugar, cornstarch, and Sichuan pepper. Stir until the sugar and cornstarch is dissolved and set aside.",
    "You may need to turn on your stove’s exhaust fan, because stir-frying dried chilis on high heat can get a little smoky. Heat a wok or large skillet over high heat until a bead of water sizzles and evaporates on contact. Add the peanut oil and swirl to coat the base. Add the chilis and stir-fry for about 30 seconds, until the chilis have just begun to blacken and the oil is slightly fragrant. Add the chicken and stir-fry until no longer pink, about 2 to 3 minutes.",
    "Add the scallion whites, garlic, and ginger, and stir-fry for 30 seconds. Pour in the sauce and mix to coat the other ingredients. Stir in the peanuts and cook for another 1 to 2 minutes. Transfer to a serving plate, sprinkle the scallion greens on top, and serve."
  ],
  "firstAdded": "2014-08-17T15:56:04.937000",
  "hash": "f0ae5b25e55d99d060a1e79c4c5f32243f4d82d1",
  "href": "http://appetiteforchina.com/recipes/kung-pao-chicken-lunch-champions",
  "image": "http://static.squarespace.com/static/51f7fb1ee4b03d20c9b4c34b/t/5209c662e4b0f6f84d979125/1376372322918/kung-pao-chicken.jpg?format=750w",
  "ingredients": [
    "0",
    "1 pound skinless, boneless chicken breast or thighs, cut into 1-inch cubes",
    "2 tablespoons peanut or vegetable oil",
    "8 to 10 dried red chilis",
    "5 scallions, white and green parts separated and thinly sliced",
    "2 cloves garlic, minced",
    "1 teaspoon minced or grated ginger",
    "¼ cup unsalted dry-roasted peanuts"
  ],
  "keywords": [
    "skinless",
    "boneless",
    "chicken",
    "breast",
    "thighs",
    "cubes",
    "peanut",
    "oil",
    "red",
    "chilis",
    "scallions",
    "white",
    "green",
    "parts",
    "separated",
    "garlic",
    "ginger",
    "unsalted",
    "dryroasted",
    "peanuts"
  ],
  "title": "Kung Pao Chicken",
  "users": [
    null
  ]
}