{
  "hash": "6db87461449abcc94b1243cd5642b284df5e6702",
  "title": "Black and White Bean Burgers",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2012/05/White-and-Black-Bean-Burgers.jpg",
  "href": "http://www.onegreenplanet.org/vegan-food/recipe-black-and-white-bean-burgers/",
  "extension": "",
  "firstAdded": "2016-01-03T13:36:25.888000",
  "users": [
    null
  ],
  "keywords": [
    "black",
    "beans",
    "chickpeas",
    "onion",
    "brown",
    "rice",
    "flour",
    "use",
    "buckwheat",
    "want",
    "make",
    "glutenfree",
    "juice",
    "lemon",
    "salt",
    "chile",
    "cornmeal",
    "olive",
    "oil",
    "pepper",
    "seasoning"
  ],
  "directions": [
    "0",
    "Rinse and drain the black beans and chickpeas. Place half of each along with the chopped onion in a food processor and pulse until coarsely ground. Set aside.",
    "Place the rest of the beans in a medium-size bowl and using a potato masher (or a fork) mash the beans. Next add the bean/onion mixture to the bowl, along with the brown rice, flour, lemon juice, chile powder, and salt. Stir until well-combined. Add 1/2 cup of the cornmeal and stir again. Let the ingredients sit for a bit to allow the cornmeal to absorb any moisture. If the mixture still seems too wet, add more cornmeal until you achieve the desired consistency.",
    "Shape the bean dough into patties. Depending on their size, you should be able to create 6 to 8 patties.",
    "Heat an oven (convection or regular) to 250 degrees. While the oven is warming, get out a medium-sized skillet, add the oil, and place it on a burner set to medium-high heat. Once the oil is warm, add the patties. I like to sprinkle a little salt and pepper on the uncooked side of the patty. Let the patties cook about 5 minutes until brown on the bottom and then flip. Cook the other side another 5 minutes. Place the patties in an oven-safe pan and bake in the warmed oven for about 10 – 15 minutes."
  ],
  "ingredients": [
    "0",
    "1 can Black Beans",
    "1 can Chickpeas",
    "1 small onion, chopped",
    "1 cup cooked brown rice",
    "3 tablespoons flour, (Use buckwheat if you want to make this gluten-free)",
    "Juice of 1 lemon",
    "1 teaspoon salt",
    "1 tablespoon Chile Powder",
    "½ – ¾ cup Cornmeal",
    "2 tablespoons Olive Oil",
    "Salt and Pepper (optional seasoning)"
  ],
  "__v": 1
}