{
  "hash": "00acb21b6ac50a8031dca21340b37cb436a9e581",
  "title": "Chilaquiles Frittata Bake",
  "image": "http://32mkaa3h94o148joxo1e67fb.wpengine.netdna-cdn.com/wp-content/uploads/2017/01/0S9A7512-427x640.jpg",
  "href": "http://joythebaker.com/2017/01/chilaquiles-frittata-bake/",
  "extension": "Chrome",
  "firstAdded": "2017-06-30T00:56:29.275000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place a rack in the center of the oven and preheat oven to 375 degrees F.",
    "In a 10-inch cast iron (or any other oven-proof skillet) heat can of tomatoes (juice and all) over medium heat until it simmers around the edges. Add the sliced garlic and spices, and simmer until some of the juice simmers off, about 4 minutes.",
    "Remove from heat.",
    "In a medium saucepan, heat oil over medium-high heat. Once the oil is hot, add some of the tortilla wedges, being careful not to crowd the pan. Fry until both sides of the tortilla wedges are golden brown and crisp, about 4 minutes. Remove from the pan and place on a few layers of paper towel to drain. Salt lightly and continue cooking the tortillas in batches.",
    "Layer the fresh tortilla chips into the warm tomatoes and garlic. Dig some of the chips into the tomato and layer the chips around the edges. Some of the chips can be sticking up, not everything has to be flat.",
    "Sprinkle in chopped bacon.",
    "In a medium bowl whisk together eggs, milk, and a good pinch of salt and pepper. Pour over the tomato, chip and bacon mixture. Top with grated cheese.",
    "Place in the oven and bake until the eggs are set, 25 - 30 minutes.",
    "Remove from the oven and garnish with fresh parsley, and a big dollop of sour cream and salsa. Enjoy warm in big slices!"
  ],
  "ingredients": [
    "0",
    "1 14-ounce can diced tomatoes",
    "2 cloves garlic, peeled and sliced",
    "1/2 teaspoon ground cumin",
    "1/2 teaspoon chili powder",
    "1/2 teaspoon crushed red pepper flakes",
    "1/4 teaspoon garlic powder",
    "8 tortillas, each tortilla cut into 6 wedges",
    "1/4 cup vegetable oil",
    "sea salt and fresh cracked black pepper",
    "6 sliced crisp bacon, diced",
    "8 large eggs",
    "2 tablespoons whole milk",
    "1/2 cup grated monterey or pepper jack cheese",
    "chopped fresh parsley, a dollop of sour cream, a dollop of salsa for topping"
  ],
  "__v": 1
}