{
  "hash": "4b0daabd0415fe9411dbd796f8c2610d49642504",
  "title": "Green Onion Pancakes",
  "image": "http://3.bp.blogspot.com/-Pkp4DOT388I/UyX5fbaySNI/AAAAAAAAMdM/w1Arr-v4a_4/s540/SSWF-ScallionPancakes.JPG",
  "href": "http://www.seasaltwithfood.com/2014/03/green-onion-pancakes.html",
  "extension": "Chrome",
  "firstAdded": "2015-11-22T22:12:18.169000",
  "users": [
    null
  ],
  "keywords": [
    "dough",
    "scallions",
    "salt",
    "mixture",
    "peanut",
    "oil",
    "frying",
    "unbleached",
    "allpurpose",
    "flour",
    "water",
    "filling",
    "stalks",
    "roasted",
    "sesame"
  ],
  "directions": [
    "0",
    "Make the dough: Combine the flour and salt in a large mixing bowl and make a well in the center. Bring the water to the boil, remove it from the heat to let is stop bubbling and then pour it on to the flour. Mix in quickly with the handle of a wooden spoon. When the mixture is cool enough to handle, transfer it to a work surface and knead into smooth dough. Cover and let the dough rest for 30 minutes.",
    "Make the filling: In a small bowl, combine chopped scallions and sea salt. Set aside.",
    "Make the pancake: Working on a lightly floured surface, break the dough into 8 to 12 pieces. Work with one piece at a time. Flatten each piece of dough with your palm, and roll into a thin rectangular shape. Brush the surface with sesame oil and sprinkle with the scallions and sea salt mixture. Starting with the edge closest (the long end) to you and roll up the dough. Then roll it up again from one end like a snail, tuck the end and flatten the dough with your palm to your desired thickness. Repeat with the remaining dough, oil, scallions and sea salt mixture.",
    "Then, heat a heavy, flat-bottomed frying-pan (or cast-iron pan) over a medium heat. Pour a little oil to coat the surface. When the oil is nice and hot, place the dough and fry until both sides are golden brown in color. Serves warm."
  ],
  "ingredients": [
    "0",
    "Dough",
    "Scallions And Sea Salt Mixture",
    "Peanut Oil, frying",
    "Dough",
    "3 Cups (360 grams) Unbleached All-Purpose Flour",
    "A Pinch of Sea Salt",
    "1 Cup (250 ml) Water",
    "Filling",
    "6 to 8 Stalks Scallions, chopped",
    "1 tsp Sea Salt",
    "1- 2 Tbsp of Roasted Sesame Oil"
  ],
  "__v": 1
}