{
  "hash": "f8cfcce8732234ce007b35710a1b0bb96f2cb336",
  "title": "Crispy Roast Lemon Chicken Thighs with Potatoes\nTasteBook.com\nThis is our favorite way to fix chicken on harried weeknights. It requires just a few ingredients, it’s very easy, and the potatoes get all caramelized and lemony—heavenly.",
  "image": "http://content1.tastebook.com/content/photo/user_photo/AXg8RcEY13c223233353034323ZzKUv4Pk_1429603566.jpg",
  "href": "http://www.tastebook.com/recipes/4203550-Crispy-Roast-Lemon-Chicken-Thighs-with-Potatoes",
  "extension": "Chrome",
  "firstAdded": "2015-04-23T23:06:21.446000",
  "users": [
    null
  ],
  "keywords": [
    "medium",
    "white",
    "yukon",
    "gold",
    "potatoes",
    "bonein",
    "skinon",
    "chicken",
    "thighs",
    "lemons",
    "sprigs",
    "rosemary",
    "extravirgin",
    "olive",
    "oil",
    "salt",
    "black",
    "pepper",
    "flatleaf",
    "parsley"
  ],
  "directions": [
    "0",
    "Directions",
    "1",
    "Preheat the oven to 450 degrees. Peel the potatoes and cut each lengthwise into 6 wedges. Place the potatoes in a bowl of cold, salted water.",
    "2",
    "Place the chicken thighs on a rimmed metal baking sheet or pan. Squeeze the juice of the whole lemon over the chicken. Thinly slice the other half lemon.",
    "3",
    "Strip the leaves from the rosemary and sprinkle them over the chicken, tucking some of the leaves under the skin. Season the chicken with salt and pepper.",
    "4",
    "Drain the potatoes and pat them dry. Toss the potatoes with the olive oil and salt and pepper to taste. Scatter the potatoes and oil in a single layer around and between the chicken pieces. Tuck the lemon slices here and there.",
    "5",
    "Roast for 30 minutes. Turn the potatoes, and roast another 15 to 25 minutes, until the chicken is cooked through with crisped skin, and the potatoes are browned and tender. Remove from the oven, and serve sprinkled with fresh parsley."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "4 medium white or Yukon Gold potatoes",
    "4 large bone-in, skin-on chicken thighs",
    "1 1/2 lemons",
    "2 sprigs fresh rosemary",
    "1/4 cup extra-virgin olive oil",
    "Salt and freshly ground black pepper",
    "Chopped fresh flat-leaf parsley"
  ],
  "__v": 1
}