{
  "hash": "a99e68e7aa0ff2f633413334613e0bab944c46fa",
  "title": "Vegan Butternut Squash Mac and Cheese",
  "image": "http://www.lepetiteats.com/wp-content/uploads/2014/10/IMG_30131.jpg",
  "href": "http://www.lepetiteats.com/vegan-butternut-squash-mac-and-cheese/",
  "extension": "Chrome",
  "firstAdded": "2017-08-14T21:41:48.055000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 375 degrees. Place squash in a steamer basket set over boiling water and cover. Cook for about 15-20 minutes or until easily pierced with a fork. Remove from heat and allow to cool slightly, then transfer to a food processor and blend until completely smooth. Pass through a mesh strainer to remove any remaining lumps.",
    "Boil pasta in a pot of salted water until al dente. Drain and set aside.",
    "To make the panko sage breadcrumbs, melt 1 tablespoon of Earth Balance in a small skillet over medium-low heat. Add sage and smashed garlic, cooking until sage is crisp on both sides, about 1-2 minutes. Remove sage leaves and drain on paper towels. Add panko to skillet and stir to combine. Cook until breadcrumbs are golden and toasted, about 3 minutes. Season with salt and crumble sage leaves back into pan. Reserve mixture for later use.",
    "To make the cashew béchamel, blend cashews and ½ cup of almond milk in a food processor or high speed blender until smooth. Melt Earth Balance in a medium saucepan and add flour. Cook over medium heat, stirring often, until flour is cooked through and mixture has turned golden brown, about 3 minutes. Gradually add the remaining cup of almond milk and all remaining ingredients, stirring to combine, and cook until mixture has thickened, about 3-5 minutes.",
    "Remove bechamel from heat and fold in butternut squash puree until completely incorporated. Add pasta to pot and combine with sauce. Spoon into greased individual ramekins or a 9x9 inch baking dish. Sprinkle generously with breadcrumb mixture and bake for about 20 minutes."
  ],
  "ingredients": [
    "0",
    "for the panko-sage crust:",
    "1 Tbsp. Earth Balance or other vegan butter substitute",
    "1 clove garlic, smashed",
    "8-10 sage leaves",
    "¼ cup panko breadcrumbs",
    "salt and freshly ground pepper, to taste",
    "for the macaroni:",
    "2 cups cubed butternut squash",
    "1 lb. dried pasta",
    "¼ cup cashews",
    "1½ cups plain almond milk",
    "2 Tbsp. Earth Balance or other vegan butter substitute",
    "2 Tbsp. flour",
    "½ tsp. salt",
    "¼ tsp. nutmeg",
    "2-3 Tbsp. nutritional yeast",
    "1 clove garlic, grated",
    "⅛ tsp. cayenne",
    "¼ tsp. ground mustard"
  ],
  "__v": 1
}