{
  "hash": "a40ef65b92965f88dfb6e85db92e68b08b81824a",
  "title": "Black Lentils with Red Kidney Beans",
  "image": "",
  "href": "https://www.splendidtable.org/recipes/black-lentils-with-red-kidney-beans",
  "extension": "Chrome",
  "firstAdded": "2019-06-03T19:16:02.923000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Soak the lentils and beans in the measured soaking water for 4–5 hours.",
    "Transfer the pulses and their soaking water to a deep saucepan and add the measured water, plus the salt and black cardamom pods. Bring the liquid to the boil, then cover the pan with a lid and simmer over low heat for 1 hour or until the lentils and beans are cooked.",
    "In a separate large saucepan, heat the ghee over low heat, then add the garlic and chilli and cook for 1 minute. Stir in the tomato purée, garam masala and chilli powder and cook for another minute.",
    "Tip the cooked lentils and beans into the pan of spices, mixing well. Cover the pan with a lid and cook over low heat for 1–1 1/2 hours, stirring every 10–15 minutes to ensure the mixture does not stick to the base of the pan. If the lentils become too thick during cooking, add just enough of the measured boiling water to loosen the mixture.",
    "Finally, when the dal is ready, add the cream and mix well. Garnish with the coriander and sliced chilli and serve immediately with rice, naan or chapatti."
  ],
  "ingredients": [
    "0",
    "300g (10 1/2oz) whole black lentils (urad dal)",
    "100g (3 1/2oz) dried red kidney beans",
    "roughly 500ml (18fl oz) water, for soaking",
    "1.4 litres (2 1/2 pints) water",
    "1 1/2 teaspoons salt",
    "4 black cardamom pods",
    "1 tablespoon ghee",
    "4 garlic cloves, finely chopped",
    "1 small green chilli, finely chopped",
    "2 tablespoons tomato purée",
    "1 tablespoon garam masala",
    "1 teaspoon chilli powder",
    "100–200ml (3 1/2–7fl oz) boiling water, to loosen, if required",
    "1 tablespoon double cream",
    "rice, naan or chapatti, to serve"
  ],
  "__v": 1
}