{
  "hash": "85d436ab184678c105ca1976f1c6f5877f9f21cd",
  "title": "Mexican Shrimp Cocktail",
  "image": "http://www.simplyrecipes.com/recipes/mexican_shrimp_cocktail/",
  "href": "http://www.simplyrecipes.com/recipes/mexican_shrimp_cocktail/",
  "keywords": [
    "medium",
    "shrimp",
    "raw",
    "salt",
    "red",
    "onion",
    "cucumber",
    "celery",
    "jalapeno",
    "tomatoes",
    "juices",
    "ketchup",
    "cilantro",
    "juice",
    "lime",
    "hot",
    "tabasco",
    "crystal",
    "avocado",
    "chunks"
  ],
  "directions": [
    "0",
    "1 If you have pre-cooked, peeled and deveined shrimp you can skip to the next step. If you are working with raw shrimp, peel and devein them. If you have a little extra time and want your shrimp to be extra good, put the shells in 1 1/2 quarts of cool salted water, bring to a boil, then strain the shell stock into a separate pot and cook the shrimp in that liquid. If you want to skip that step, just bring a medium pot salted water to a boil (a tbsp salt for 2 quarts of water), add the shrimp, and cook for 2-3 minutes, until just cooked through. Reserve a cup of the cooking water and chill it.",
    "2 Cut half of the shrimp into large chunks, leaving the other half whole (for a more attractive presentation). Put the chopped shrimp in a bowl with the chopped onions, cucumber, celery, jalapeno, tomatoes, ketchup, cilantro, lime juice and hot sauce. Gently stir to combine, and chill. Once the cooking water has cooled at least to room temperature, add a little at a time to the shrimp cocktail, until the shrimp cocktail is the consistency you want (we like ours a little on the soupy side).",
    "3 To serve, add salt and more hot sauce to taste and gently mix in the chopped avocados. Dip the whole shrimp in the cocktail and arrange them on top. Serve in parfait glasses or in small bowls with tortilla chips on the side.",
    "Yield: Serves 4-6."
  ],
  "ingredients": [
    "0",
    "1 pound medium shrimp, raw or cooked",
    "Salt",
    "1 cup chopped red onion",
    "1 cup peeled, diced cucumber",
    "1/2 cup chopped celery",
    "1 jalapeno, minced",
    "1 15-ounce can whole peeled tomatoes, chopped OR 1 1/2 cups of freshly chopped tomatoes with their juices",
    "1/2 cup ketchup",
    "1/4 cup chopped cilantro",
    "Juice of a lime, about 2 Tbsp",
    "Hot sauce (like Crystal or Tabasco) to taste (about 1 Tbsp to 1/4 cup of Crystal)",
    "1 avocado, cut into chunks"
  ],
  "__v": 0
}