{
  "hash": "b2e1e5d238ac924c1b3a0f21942c74c72fd93351",
  "title": "STICKY BRAISED PORK",
  "image": "http://i2.wp.com/notwithoutsalt.com/wp/wp-content/uploads/2M1A9965.jpg?resize=800%2C1200",
  "href": "http://notwithoutsalt.com/sticky-braised-pork/",
  "extension": "Chrome",
  "firstAdded": "2016-12-08T04:37:19.792000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 300. Heat a little oil in a heavy bottomed pot large enough to hold all shanks standing upright. Liberally salt shanks all over. Working in batches, sear shanks on all sides until browned, removing to a plate or platter after browned (if you’re using a pork shoulder just sear it on all sides). After finished browning all shanks, place oranges cut side down to char. Once oranges have been burnt, remove to platter with pork shanks. Sauté the rest of vegetables, including jalapeños and garlic, until they have softened slightly. Add sorghum to pan and stir to coat veggies. Place all shanks back in pot, standing upright. Place burnt orange halves, thyme, rosemary, and peppercorns in and around shanks. Cover meat with stock, and bring to a simmer. Cover pot with a lid or wrap foil over tightly, and place in oven to braise for 3.5-4 hours, or until tender. When done, the meat should be pulling away from the bone, but not falling off. Remove meat to a clean platter. Strain braising jus to remove all veg/aromatics. Skim fat from the surface. Return jus to a clean pot, and boil until liquid is reduced by 2/3 and is syrupy. (Recipe can be made to this point 2-3 days ahead)",
    "Pour the reduced glaze over the pork to coat. Sprinkle benne, peanuts, and herbs all over and serve."
  ],
  "ingredients": [
    "0",
    "4-6 Pork Shanks, osso bucco cut, 14-16 oz each (I used a 3 to 4 pound bone in pork shoulder)",
    "As needed, canola oil",
    "1 orange, cut in half",
    "1 onion, rough chopped",
    "2 carrots, rough chopped",
    "4 stalks celery, rough chopped",
    "2 jalapenos, split lengthwise",
    "4 cloves garlic, smashed",
    "¼ c sorghum molasses (I used regular blackstrap molasses)",
    "4 sprigs fresh thyme",
    "4 sprigs fresh rosemary",
    "1 T black peppercorns",
    "As needed, pork/chicken stock",
    "1/8 c benne seeds (toasted sesame seeds)",
    "1/8 c crushed peanuts (toasted)",
    "1/8 c soft herbs (parsley, chervil, chives) chiffonade cut"
  ],
  "__v": 1
}