{
  "hash": "cd65f6e0c2574d3b294b54be3d9d473b888ac8ca",
  "title": "Strawberry Freezer Jam",
  "image": "http://www.herecomesthesunblog.net/wp-content/uploads/2014/05/Strawberry-Freezer-Jam.jpg",
  "href": "http://www.herecomesthesunblog.net/2014/05/strawberry-freezer-jam.html",
  "extension": "Firefox",
  "firstAdded": "2015-04-15T03:52:19.849000",
  "users": [
    null
  ],
  "keywords": [
    "pints",
    "strawberries",
    "sugar",
    "box",
    "sure",
    "jell",
    "fruit",
    "pectin",
    "water",
    "sized",
    "mason",
    "jars"
  ],
  "directions": [
    "0",
    "Wash and rinse your mason jars, lids and berries.",
    "Cut up strawberries and place in a food processor.",
    "Strawberry Jam",
    "Crush the strawberries in the food processor, 1 cup at a time. Do not purée. Leave some strawberry bits.",
    "strawberry jam3",
    "Place 2 cups crushed strawberries into a bowl.",
    "Add 4 cups sugar to the crushed strawberries and stir until completely mixed. Let sit for 10 minutes.",
    "Place Sure Jell into a saucepan with 3/4 cups water. Bring to a boil on high heat, stirring constantly. Boil 1 minute stirring constantly. Remove from heat.",
    "After the Sure Jell is dissolved in the water, add the mixture to the berries and stir constantly until sugar is completely dissolved and no longer grainy, about 3 minutes.",
    "Using a funnel, pour jam into mason jars. Fill up to the bottom of the rim, leaving 1/2 inch at the top.",
    "strawberry jam2",
    "Screw lid on tight. Let stand at room temperature for 24 hours until set. Store in fridge in for up to 3 weeks or in freezer for a year.",
    "Strawberry Freezer Jam Final",
    "Strawberry Freezer Jam makes the perfect gift for Mother’s Day. Package it up with a cute cupcake liner and a bow.",
    "This Strawberry Freezer Jam is perfect to package up for a Mother's Day gift!"
  ],
  "ingredients": [
    "0",
    "2 pints strawberries",
    "4 cups sugar",
    "1 box Sure Jell fruit pectin",
    "3/4 cup water",
    "Half Pint sized mason jars"
  ],
  "__v": 1
}