{
  "hash": "a530b598b0e5257e3bc2a4627a0da2813797989f",
  "title": "Tacos Al Pastor",
  "image": "https://keviniscooking.com/wp-content/uploads/2017/04/Authentic-Tacos-Al-Pastor-square2-180x180.jpg",
  "href": "https://keviniscooking.com/al-pastor/",
  "extension": "Chrome",
  "firstAdded": "2019-02-07T16:07:22.530000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Using gloves, crack the stem off and scrape out the seeds from the dried chiles. Place them in a blender and cover with hot water (typically about 1 cup). Allow to soften for 20 minutes.",
    "To the blender add achiote paste, one onion, skin removed and halved, pineapple, garlic, cinnamon, salt, Mexican oregano and epazote (optional). Blend until pureed.",
    "Trim fat from the pork shoulder and slice meat into 2 to 4 inch chunks. Place in a plastic bag that seals or container that can be covered with a lid and pour the chile mixture over the pork. Using gloves, mix the chile marinade and pork and chill in refrigerator overnight. 8 hours is fine, but 24 hours is better. Allow meat to come to room temp prior to cooking.",
    "For the Grill:",
    "Preheat grill to 225°F. Shake off excess marinade and place pork chunks on cleaned and greased grill.",
    "Slow roast at 225°F covered with aluminum foil for 4 hours. Remove the aluminum foil and continue roasting for 1 hour or until completely tender when pulled with a fork.",
    "Oven Method:",
    "Preheat oven to 225°F. Shake off excess marinade and place pork chunks in a 11x13\" baking pan or stone.",
    "Slow roast at 225°F covered with aluminum foil for 4 hours. Remove the aluminum foil and continue roasting for 1 hour or until completely tender when pulled with a fork.",
    "Instant Pot (Pressure Cooker) Method:",
    "Place marinated pork and remaining marinade in the Instant Pot (Pressure Cooker) and close lid and lock. Press (Manual) and at the High Pressure setting, then use the [+] button to choose 45 minutes pressure cooking time. When done, Quick Release, remove from pressure cooker and place pork chunks in a 11x13\" baking pan or stone. Roast uncovered for 30 minutes in 325°F oven to render fat and crisp up edges.",
    "Slow Cooker Method:",
    "Place marinated pork and remaining marinade in the slow cooker for 4 hours on high or 8 hours on Low. Remove from slow cooker and place pork chunks in a 9×13″ baking pan or stone. Roast uncovered for 30 minutes in 325°F oven to render fat and crisp up edges.",
    "Serving:",
    "Serve over rice and beans or in small tortillas topped with chopped remaining onion, cilantro, squeeze of lime juice and hot salsa (See Note 4).",
    "Notes",
    "If dried chiles are not available substitute 1/4 cup chili powder (guajillo preferably) total with 1/4 water when blending with marinade ingredients.",
    "Achiote paste can be found in most Mexican markets and adds that authentic deep red color and flavor. Read more about it here.",
    "Epazote is similar to oregano and fennel with minty notes. It’s found in Mexican cooking and is typically used in beans, helping reduce their tendency to cause flatulence.",
    "I like diced pineapple on top as well, but this is optional."
  ],
  "ingredients": [
    "0",
    "5 lbs pork shoulder (boneless)",
    "4 dried Pasillas chiles (optional, See note 1)",
    "4 dried Guajillo chiles (optional, See note 1)",
    "3 dried De Arbol chiles (optional, See note 1)",
    "3 tbsp achiote paste (optional, See note 2)",
    "2 onions (separated)",
    "1½ cups fresh pineapple (or canned)",
    "5 cloves garlic",
    "1 tsp cinnamon",
    "2 tsp kosher salt",
    "1 tsp Mexican oregano",
    "2 tsp epazote (optional, See Note 3)",
    "corn or flour tortillas",
    "1 bunch cilantro",
    "limes"
  ],
  "__v": 1
}