{
  "hash": "23280887c26c4f7ec63bce5f29610921d5c272e2",
  "title": "Polenta Bake With Caramelized Onions and Portobello Bacon [Vegan, Gluten-Free]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/05/Polenta-Bake-with-Caramelized-Onion-and-Portabella-Bacon-VEGG-Chef-1.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/polenta-bake-with-caramelized-onions-and-portobello-bacon/",
  "extension": "Chrome",
  "firstAdded": "2015-05-19T23:23:40.306000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "divided",
    "medium",
    "yellow",
    "onion",
    "slices",
    "garlic",
    "rosemary",
    "thyme",
    "water",
    "plain",
    "nondairy",
    "milk",
    "soy",
    "almond",
    "rice",
    "bouillon",
    "cube",
    "rapunzel",
    "organic",
    "gourmet",
    "brand",
    "salt",
    "nutritional",
    "yeast",
    "polenta",
    "portobello",
    "mushroom",
    "stem",
    "tamari",
    "maple",
    "syrup",
    "smoke",
    "smoked"
  ],
  "directions": [
    "0",
    "Heat 1 tablespoon of olive oil in a large skillet on medium heat. Add the sliced onions and stir to coat the onions with the oil. Spread the onions out evenly over the pan and let cook, stirring occasionally so they caramelize. You may need to lower the heat as they cook so they don’t burn. Usually 30 minutes. Remove from pan and set aside.",
    "1",
    "Preheat oven to 375. Rub a 2-quart casserole dish with coconut oil or olive oil and set aside. Heat 1 tablespoon oil in a medium saucepan on medium heat. Add the diced onions and cook, stirring occasionally until translucent, about 5 minutes. Add the garlic, rosemary and thyme, cook another minute. Stir in water, milk, and vegetable bouillon cube and bring to a boil.",
    "Lower the heat and whisk in salt, nutritional yeast then lastly the polenta, continually whisk until thick and creamy about 5 minutes. Be careful because polenta can splatter easily and burn you so turn the heat down if it’s bubbling too much. Taste it and see if you need to add more salt then pour into the casserole dish and smooth it out with a spatula. Bake for 30-35 minutes or until firm.",
    "While the polenta bakes make the skillet portabella bacon in the same pan you caramelized the onions (to dirty less dishes)",
    "Remove polenta from oven, top with chopped portabella bacon and caramelized onions. Let the polenta cool for 10 minutes before cutting to serve.",
    "2",
    "Lay portobello slices flat on flat surface. Whisk olive oil, tamari, maple syrup, liquid smoke and smoked salt in a small bowl. Use a basting brush to coat both sides of the portobello slices with the marinade, let them sit to marinate a few minutes – the longer the better.",
    "Heat skillet on medium heat and place the portobellos in a single layer. Cook 5 minutes on one side and 3 minutes on the other or until caramelized. You may need to do them in two batches depending on the size of your skillet.",
    "3",
    "Preheat oven to 350.",
    "Lay portobello slices flat on flat surface. Whisk olive oil, tamari, maple syrup, liquid smoke and smoked salt in a small bowl. Use a basting brush to coat both sides of the portobello slices with the marinade, let them sit to marinate a few minutes – the longer the better.",
    "Place marinated portobello slices on a wire rack over a cookie sheet. Bake for 15 minutes, flip portobellos then continue baking for another 15 minutes. Watch them closely after 20 minutes as the small mushrooms will crisp quicker. Take them out as they are done and let them cool 5 minutes. As they cool they will crisp up around the edges."
  ],
  "ingredients": [
    "0",
    "2 tablespoons olive oil, divided",
    "1 medium yellow onion, cut into thin slices",
    "1/2 medium yellow onion, diced",
    "3 garlic cloves, minced",
    "1 tablespoon fresh rosemary, minced",
    "1 tablespoon fresh thyme, minced",
    "2 1/2 cups water",
    "2 cups plain non-dairy milk (soy, almond, rice etc.)",
    "1 vegetable bouillon cube (Rapunzel or Organic Gourmet Brand)",
    "1 teaspoon salt",
    "2 tablespoon nutritional yeast",
    "2 cups polenta",
    "1",
    "1 large portobello mushroom, stem removed and cut into 1/4″ thick slices",
    "2 teaspoons olive oil",
    "2 teaspoons tamari of soy sauce",
    "2 teaspoons maple syrup",
    "1/2 teaspoon liquid smoke",
    "pinch smoked salt (optional)"
  ],
  "__v": 1
}