{
  "hash": "707881e3c9e348888cfcf725794771b3b37e78c3",
  "title": "Heston Blumenthal's Scotch Eggs",
  "image": "http://www.sbs.com.au/food/sites/sbs.com.au.food/files/styles/full/public/scotch-eggs_0.jpg?itok=Rzy2kiA-&mtime=1379320112",
  "href": "http://www.sbs.com.au/food/recipes/heston-blumenthals-scotch-eggs",
  "extension": "Chrome",
  "firstAdded": "2015-09-13T08:30:20.292000",
  "users": [
    null
  ],
  "keywords": [
    "medium",
    "eggs",
    "goodquality",
    "sausages",
    "skins",
    "smoked",
    "paprika",
    "cornflour",
    "french",
    "mustard",
    "salt",
    "black",
    "pepper",
    "plain",
    "flour",
    "fullcream",
    "milk",
    "breadcrumbs",
    "groundnut",
    "oil",
    "deepfrying"
  ],
  "directions": [
    "0",
    "Put 8 of the eggs into a pan in which they fit in a single layer. Add enough cold water to cover the eggs by 3 cm and cover with a lid then place the pan over a high heat.",
    "Once the water comes to a boil, remove the pan from the heat and allow to stand for 3 minutes. In the meantime, fill a bowl with ice and cold water and after the 3 minutes, transfer the eggs to the iced water. Leave to cool for 10–15 minutes.",
    "Place the sausage meat in a food processor with the smoked paprika, cornflour, mustard, and a splash of cold water. Season with salt and freshly ground black pepper and blitz together. Divide into eight balls, approximately 55 g per portion.",
    "Once the eggs are cool enough to handle, carefully peel off the shells using a teaspoon.",
    "Flatten each portion of sausage meat between two sheets of plastic wrap into a circle, then remove the top layer of plastic. Place an egg in the centre of each sausage meat circle. Wrap the sausage meat around the egg, by bringing all of the edges together and twist the top of the plastic. Press the edges to seal but don’t press too hard. Place in the fridge for 20 minutes.",
    "In the meantime, put some plain flour into a small bowl and season it with salt and freshly ground black pepper. Beat the remaining eggs in a second small bowl and stir in the milk. Put the breadcrumbs into a third bowl. Roll each coated egg in the flour, gently tapping off any excess, then dip it in the beaten egg. Finally, roll it in the breadcrumbs, making sure that all sides are coated. Place the eggs in the fridge for 15 minutes.",
    "Preheat the oven to 190ºC/gas mark 5. Heat a deep-fat fryer to 190ºC or place a deep saucepan of oil over a high heat until it reaches this temperature.",
    "Fry the Scotch eggs two at a time for 2 minutes until golden brown. Remove from the oil with a slotted spoon and place on a cooling rack over a baking tray. When all the eggs have been fried, place the tray in the oven for an additional 10 minutes. Serve immediately while the yolks are still runny.",
    "Note",
    "• The texture and quality of meat around the egg will be determined by the sausage meat that you use. If you want a smooth casing, use more of a banger type sausage.",
    "• If you use coarse breadcrumbs, blitz them in a food processor for approximately 5 seconds to create a coarse powder so the crumbs don’t absorb too much fat during frying."
  ],
  "ingredients": [
    "0",
    "10 medium eggs",
    "450 g good-quality sausages, skins removed (see note)",
    "½ tsp smoked paprika",
    "2 tsp cornflour",
    "45 g French mustard",
    "salt and black pepper",
    "plain flour",
    "50 ml full-cream milk",
    "125 g breadcrumbs (see note)",
    "groundnut oil, for deep-frying"
  ],
  "__v": 2
}