{
  "hash": "ace836c91ce9467e817d193237884b9f12e81e6a",
  "title": "Smothered Turkey Wings",
  "image": "http://assets.simplyrecipes.com/wp-content/uploads/2016/12/22190121/smothered-turkey-wings-vertical-a-1800.jpg",
  "href": "http://www.simplyrecipes.com/recipes/smothered_turkey_wings/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+elise%2Fsimplyrecipes+%28Simply+Recipes%29",
  "extension": "Chrome",
  "firstAdded": "2017-01-10T12:40:40.142000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Prep the turkey wings: Use poultry sheers or a sharp knife to separate each turkey wing into 3 segments—drumette, flat, and tip. Set aside the tips for making stock.",
    "2 Slow roast the turkey wings: Place turkey wing drumettes and flats, skin side up, onto a rimmed baking sheet or roasting pan. Toss with olive oil. Sprinkle with salt.",
    "Cover with aluminum foil and put into a 275°F oven for 2 1/2 hours.",
    "3 Make the stock: While the turkey wing drumettes and flats are roasting, make stock with the tips. Heat 2 Tbsp olive oil in a medium, thick-bottomed pot on medium high heat. Add the turkey wing tips and let them brown on all sides.",
    "Add the chopped carrot, onion, and celery, and sauté them for a few minutes with the wings.",
    "Add 3 cups of water, enough to cover the wings and vegetables, and salt. Bring to a boil on high heat, then reduce to a low simmer on the lowest setting. Cover and let simmer while the wings roast in the oven, a couple of hours.",
    "4 Strain the stock: When the wings are close to being done, strain the stock so you can start making the gravy. Remove and discard the largest solids from the pot. Then strain the rest of the stock through a fine mesh strainer. Reserve the stock for the next step.",
    "5 Make the gravy: Make a roux by melting 3 Tbsp butter in a medium sized, thick-bottomed pot, on medium heat. Add the flour and whisk to combine. Let the roux cook and bubble for a minute or so.",
    "Slowly whisk in the turkey stock you made in steps 3 and 4, whisking constantly to break up any lumps.",
    "Whisk in the mustard, salt, pepper, and thyme. Whisk in the cream. Let simmer on low heat to thicken.",
    "6 Broil the wings to brown them: After 2 1/2 hours of slow cooking in the oven, the turkey wings should be fall apart tender (if not, you can leave them in longer until they are).",
    "Remove the foil and place the wings on a rack a few inches under the broiler. Broil for 5 minutes or so, until the wing skin gets somewhat browned.",
    "7 Scrape the wing roasting pan drippings into the gravy: You don't have to do this, but it will add even more flavor to your gravy. If the drippings are really stuck to the pan, place the roasting pan on your stovetop and turn on the burners under the pan.",
    "Add a cup of water to the pan and use a metal spatula to scrape up the drippings. Pour them off into the pot with the gravy.",
    "To serve, pour the gravy over the wings. Serve with a side of mashed potatoes, root vegetables, or cauliflower."
  ],
  "ingredients": [
    "0",
    "6 whole turkey wings (about 5 pounds), or 7 turkey wings without the tips",
    "1 Tbsp olive oil",
    "Salt",
    "2 Tbsp olive oil",
    "1 carrot, chopped",
    "1 half onion, chopped",
    "1 celery rib, chopped",
    "3 cups water",
    "1/2 teaspoon salt",
    "3 Tbsp butter",
    "3 Tbsp flour",
    "3 cups of turkey stock (that you make in step...)",
    "1/2 teaspoon yellow mustard",
    "1/2 teaspoon salt",
    "1/4 teaspoon pepper",
    "1/2 teaspoon dried thyme",
    "1/4 cup cream"
  ],
  "__v": 1
}