{
  "hash": "aec5d9b3f2486c60e6a44b83ca01b84bf802bdc5",
  "title": "Kedgeree",
  "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/user-collections/my-colelction-image/2015/12/recipe-image-legacy-id--24486_12.jpg?itok=wo4Bez5k",
  "href": "http://www.bbcgoodfood.com/recipes/10421/kedgeree",
  "extension": "Chrome",
  "firstAdded": "2016-08-09T14:29:12.941000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the rice, heat the oil in a large, lidded pan, add the onion, then gently fry for 5 mins until softened but not coloured. Add the spices, season with salt, then continue to fry until the mix start to go brown and fragrant; about 3 mins.",
    "Add the rice and stir in well. Add 600ml water, stir, then bring to the boil. Reduce to a simmer, then cover for 10 mins. Take off the heat and leave to stand, covered, for 10-15 mins more. The rice will be perfectly cooked if you do not lift the lid before the end of the cooking.",
    "Meanwhile, put the haddock and bay leaves in a frying pan, cover with the milk, then poach for 10 mins until the flesh flakes. Remove from the milk, peel away the skin, then flake the flesh into thumbsize pieces. Place the eggs in a pan, cover with water, bring to the boil, then reduce to a simmer. Leave for 4½-5 mins, plunge into cold water, then peel and cut the eggs into quarters. Gently mix the fish, eggs, parsley, coriander and rice together in the pan. Serve hot, sprinkled with a few extra herbs."
  ],
  "ingredients": [
    "0",
    "milk",
    "Milk",
    "mill-k",
    "One of the most widely used ingredients, milk is often referred to as a complete food. While cow…",
    "egg",
    "Egg",
    "egg",
    "The ultimate convenience food, eggs are powerhouses of nutrition, packed with protein and a…",
    "parsley",
    "Parsley",
    "par-slee",
    "One of the most ubiquitous herbs in British cookery, parsley is also popular in European and…"
  ],
  "__v": 1
}