{
  "hash": "8b29befe9cee4ad306254ec863d767b54dd1d10a",
  "title": "Versatile meat ragù",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/739_1_1436962741_lrg.jpg",
  "href": "http://www.jamieoliver.com/recipes/pork-recipes/versatile-meat-rag/",
  "extension": "Chrome",
  "firstAdded": "2015-07-30T17:52:27.082000",
  "users": [
    null
  ],
  "keywords": [
    "extra",
    "virgin",
    "olive",
    "oil",
    "rashers",
    "higherwelfare",
    "streaky",
    "bacon",
    "red",
    "onions",
    "garlic",
    "celery",
    "trimmed",
    "butternut",
    "squash",
    "carrots",
    "pork",
    "beef",
    "wineglasses",
    "wine",
    "tinned",
    "plum",
    "tomatoes",
    "sprigs",
    "rosemary",
    "bay",
    "leaf",
    "salt",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "Heat the oil in a very large casserole-type pan and add the bacon. Then add the onion, garlic, celery, squash and carrot, and cook very gently for about 15 minutes until soft. Add the mince, break it up with a wooden spoon and cook for about 10 minutes.",
    "Turn the heat up, pour in the wine and simmer for a few minutes. Add the tomatoes, then fill an empty tin twice with water and add this to the pan too. Drop in the rosemary sprigs and bay leaf, and season with salt and pepper. Bring to the boil and simmer for 1½ hours with the lid on. After this time, if the ragù is still quite liquid, remove the lid, turn the heat up and simmer for a few more minutes to reduce.",
    "Eat straight away if you like. If you're making this ahead of time, then allow to cool and divide between three containers or plastic freezer bags. Stick a label on with the date, name of the dish, and what to serve it with. It can be kept in the fridge for 3 days or freezer for 2 months. If you freeze it, remember to give instructions to defrost in the fridge before reheating until piping hot. Whether it's delicious vegetarian or vegan recipes you're after, or ideas for gluten or dairy-free dishes, you'll find plenty here to inspire you. For more info on how we classify our lifestyle recipes please read our special diets fact sheet, or or for more information on how to plan your meals please see our special diets guidance."
  ],
  "ingredients": [
    "0",
    "4 tablespoons extra virgin olive oil",
    "6 rashers higher-welfare streaky bacon, sliced",
    "2 red onions, peeled and finely chopped",
    "2 cloves garlic, peeled and finely chopped",
    "2 sticks celery, trimmed and sliced",
    "1 butternut squash, peeled and chopped",
    "3 carrots, peeled and chopped",
    "750 g higher-welfare minced pork",
    "750 g minced beef",
    "2 wineglasses red wine",
    "5 x 400 g tinned plum tomatoes",
    "3 sprigs of fresh rosemary",
    "1 fresh bay leaf",
    "sea salt",
    "freshly ground black pepper"
  ],
  "__v": 1
}