{
  "hash": "dfa9f06dcaa7548e71c03855143a41b027d332a0",
  "title": "Zucchini Tuna Cakes",
  "image": "https://i0.wp.com/www.chocolatesalad.com/wp-content/uploads/2015/08/DSC_0137.jpg?zoom=2&resize=545%2C362",
  "href": "http://www.chocolatesalad.com/zucchini-tuna-cakes/",
  "extension": "Chrome",
  "firstAdded": "2018-01-25T21:13:45.927000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Grate up about half of a medium sized zucchini or about 100 grams. Dump all that grated zucchini into a thin dish towel or cheese cloth and wrap all the sides up around it forming a ball. Twist the cloth at the top, right above the ball of zucchini, and keep twisting it as tight as you can to squeeze as much liquid out of the zucchini as possible. It will all come out through the towel.",
    "In a mixing bowl, add the squeezed zucchini and all the other cake ingredients and mix well together.",
    "Heat a medium frying pan to medium low. Spray with non stick spray.",
    "Scoop about half of the mixture out into one side of the frying pan and use your spoon to form a round flat cake, about 1/2 inch thick. Then do the same with the rest of the mixture on the other side of the frying pan. Let it cook for about 5-6 minutes on medium low. You can check the bottom if you want, so when it gets a little crispy and golden brown, flip it over with a spatula and let it cook about the same amount on the other side.",
    "While the cakes are cooking, you can mix up your lemon dill yogurt sauce. Just mix the yogurt, lemon juice, dill, and garlic sauce in a small bowl and set it aside.",
    "When the cakes are ready, scoop them out onto a plate and put all the yogurt sauce on top."
  ],
  "ingredients": [
    "0",
    "1/2 medium zucchini (about 100 g) grated, and liquid squeezed out",
    "1 can tuna, drained",
    "2 T oats",
    "2 T shredded cheese",
    "1 large egg",
    "1/4 t garlic salt",
    "1/4 t dill",
    "1/4 t onion powder",
    "fresh ground pepper",
    "For the Lemon Yogurt Sauce:",
    "2 T greek yogurt",
    "1 t lemon juice",
    "1/4 t dill",
    "1/4 garlic salt"
  ],
  "__v": 1
}