{
  "hash": "5873a3a299452ebb4df3cbff5cd5a1ee27c59cee",
  "title": "CAULIFLOWER NOODLE LASAGNA",
  "image": "https://2.bp.blogspot.com/-UJiBD_wsXPE/VCTTj0DfwNI/AAAAAAAAA9E/Bemhw788Zew/s1600/Cauliflower-Noodle-Lasagna.jpg",
  "href": "http://www.theironyou.com/2014/09/cauliflower-noodle-lasagna.html",
  "extension": "Chrome",
  "firstAdded": "2016-05-15T22:59:09.943000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "Cauliflower Noodles",
    "Preheat oven to 375°F (190°C), line a large baking sheet with parchment paper and grease with olive oil.",
    "In a food processor rice the cauliflower, until you get a texture finer than rice. Once it’s riced measure it and make sure you have 3 cups packed.",
    "Place cauliflower rice in a bowl and microwave on high for 2 minutes, give it a good stir and microwave for another 2 minutes.",
    "Place the cauliflower rice in a tea towel and twist it to squeeze as much moisture as you can (I usually squeeze out over a cup of liquid). This is very important. The cauliflower rice needs to be dry.",
    "Place drained cauliflower rice back in the bowl and add eggs, salt and pepper and mix until combined.",
    "Spread the mixture onto the lined baking sheet. Place in the oven and bake for 15 minutes.",
    "Remove from the oven, let cool 5 to 10 minutes and carefully peel it off the parchment paper.",
    "Transfer to a large cutting board or work surface.",
    "Depending on the size and shape of your baking dish, cut the cauliflower noodles so that it will fit into the dish. Set aside.",
    "Cauliflower bechamel sauce",
    "In a medium saucepan add cauliflower florets, milk, garlic, salt and pepper. Bring to a boil, reduce to a simmer, cover with a lid and cook for 15 minutes.",
    "Remove from the heat and with an immersion blender, blend until smooth (be careful not to splatter yourself!)",
    "Add eggs, one at a time, working quickly to make sure that they don’t poach.",
    "It will look like a thin white foamy liquid, that’s OK. It will work out in the end. Set aside.",
    "Assemble lasagna",
    "Preheat oven to 320°F (160°C) and place a rack in the middle.",
    "Spread a couple of tablespoons of bolognese sauce in the bottom of a baking dish (I used a 9x13 inch one).",
    "Arrange cauliflower sheets side by side, covering the bottom of the baking dish.",
    "Spread with ⅓ of the cauliflower bechamel. Top with ⅓ of bolognese sauce and sprinkle with ¼ cup Parmesan cheese. Repeat to make 3 layers, and top with remaining cauliflower bechamel and Parmesan cheese.",
    "Cover with foil (to prevent sticking, either spray foil with cooking spray, or make sure the foil does not touch the cheese).",
    "Bake in preheated oven for 25 minutes. Remove foil, and bake an additional 25 minutes. Cool for 15 minutes before serving."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Serves 8",
    "4 cups / 24.6 oz / 700 gr Bolognese sauce (make your own Bolognese sauce with this recipe)",
    "1 ½ cups / 7 oz / 200 gr grated Parmesan cheese*",
    "Cauliflower noodles",
    "3 cups cauliflower rice, packed",
    "3 eggs",
    "½ teaspoon fine grain sea salt",
    "¼ teaspoon ground black pepper",
    "Cauliflower bechamel sauce",
    "¾ cup / 180 ml milk (your choice of milk)",
    "2 cups / 7 oz / 200 gr cauliflower florets",
    "1 clove garlic",
    "1 teaspoon fine grain sea salt",
    "A pinch of ground black pepper",
    "3 free-range organic eggs",
    "*skip to keep it paleo"
  ],
  "__v": 1
}