{
  "hash": "b17940c7e9a53e8b0f2225ff566cb18683e37385",
  "title": "Polenta – idealny dodatek do mięs z sosami",
  "image": "http://zapisz.net/images/646_img_6490.jpg",
  "href": "http://to-tylko-blog.blog.pl/2015/02/23/polenta-idealny-dodatek-do-mies-z-sosami/",
  "extension": "",
  "firstAdded": "2016-09-22T20:44:22.020000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "W garnku (najlepiej z grubym dnem) zagotować 2 szklanki osolonej wody. W dodatkowym kubku przygotować gorącą wodę, która będzie nam potrzebna do dolewania do kaszy w trakcie jej gotowania. Do gotującej się wody wsypujemy cienkim strumieniem najpierw pół szklanki przygotowanej kaszki, zbyt nagłe wsypanie spowoduje że zrobi nam się wielka klucha. W trakcie wsypywania i gotowania ciągle mieszamy energicznie drewnianą łyżką żeby kasza nie przypaliła się. Kiedy pierwsza porcja zgęstnieje dolewamy trochę gorącej wody z kubka aby kaszę rozrzedzić, a kiedy zagotuje się ponownie, dosypujemy kolejną porcję kaszy ale nie całość tylko jej połowę, pamiętajmy o ciągłym mieszaniu. I teraz znowu dolewamy odrobinę wody i ponownie część kaszy i tak aż sucha kasza nam się już skończy. Gotowanie wymaga trochę czasu ok 15-20 minut. Ten czas nada kaszce smaku i wyeliminuje delikatnie gorzkawy smak jaki posiada w sobie ten rodzaj kaszki. Dobrze ugotowana kasza powinna odstawać od ścianek garnka, wówczas przekładamy ją na zmoczone zimną wodą płaskie naczynie (talerz, taca, naczynie żaroodporne itp.), wygładzamy łyżką i odstawiamy do ściągnięcia. Stężałą kaszkę kroimy w kostki. Ja tuż przed podaniem obsmażam je leciutko na patelni z masłem."
  ],
  "ingredients": [
    "0",
    "Polenta, mamałyga – jak zwał tak zwał ale chodzi o to samo, czyli o potrawę z kaszki lub mąki kukurydzianej. U nas mało popularna, lecz we Włoszech polenta to potrawa narodowa. Pod nazwą mamałyga popularna jest w krajach kuchni rumuńskiej, bułgarskiej i ukraińskiej. Polentę możemy serwować na słono jak i na słodko, w postaci papki lub w dowolnie pokrojone kawałki. Możemy ją podawać z sosami, mięsami, owocami, twarogiem, ze śmietaną, z cukrem, obsmażoną a nawet grillowaną. Polecam spróbować :)",
    "Składniki:",
    "2 szklanki wody",
    "1 szklanka kaszki kukurydzianej",
    "sól",
    "gorąca woda w kubku do dolewania w czasie gotowania"
  ],
  "__v": 1
}