{
  "hash": "766789d93e0a8562c9ab7440f16ad41a71c2ed12",
  "title": "Greek Chicken Kebabs with Tzatziki Sauce",
  "image": "http://www.cookingclassy.com/wp-content/uploads/2015/04/greek-chicke-kebabs3-srgb..jpg",
  "href": "http://www.cookingclassy.com/2015/04/greek-chicken-kebabs-with-tzatziki-sauce/",
  "extension": "Chrome",
  "firstAdded": "2016-06-22T20:10:10.282000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the kebabs:",
    "In a bowl whisk together 1/4 cup olive oil, lemon juice, vinegar, garlic, oregano, basil, thyme, coriander and season with salt and pepper to taste (I used 3/4 tsp salt 1/4 tsp pepper). Place chicken in a gallon size resealable bag, pour olive oil mixture over chicken and press chicken into marinade. Seal bag and refrigerate 45 minutes to 2 hours (no longer than 2 hours or the chicken will start to get mealy because of the acidic ingredients). If using wooden skewers soak them in water for 30 minutes.",
    "Drizzle and toss veggies with 2 Tbsp of the olive oil (I just left them on the cutting board and tossed them) and season lightly with salt.",
    "Preheat a grill over medium-high heat. Thread a red bell pepper, red onion, zucchini, 2 chicken pieces on to skewer and repeat twice. Brush grill lightly with olive oil, place skewers on grill and grill until chicken registers 165 degrees in center, about 7 - 9 minutes, rotating once halfway through cooking. Garnish with parsley, serve warm with Tzatziki sauce.",
    "For the Tzatziki:",
    "Place diced cucumber in a mesh strainer or colander and sprinkle with salt, toss to evenly coat then allow to rest 30 minutes at room temperature.",
    "Rinse cucumbers and place over several layers of paper towels. Squeeze some of the liquid from cucumbers (almost as if wringing moisture from a cloth). Place cucumbers in food processor and pulse to chop fine (if there's excess liquid drain it off).",
    "Pour cucumbers into a mixing bowl add Greek yogurt, garlic, lemon juice, olive oil, parsley, and dill and season with salt and pepper to taste. Whisk to combine. Store in refrigerator in an airtight container.",
    "*I just peeled the cucumber, sliced in half lengthwise, then used a spoon to scoop the seeds out and diced into chunks."
  ],
  "ingredients": [
    "0",
    "1 3/4 - 2 lbs bonless skinless chicken breasts, diced into 1 1/4-inch cubes",
    "1/4 cup + 2 Tbsp olive oil, divided, plus more for grill",
    "3 Tbsp fresh lemon juice",
    "1 Tbsp red wine vinegar",
    "3 cloves garlic, minced",
    "2 tsp dried oregano",
    "1/2 tsp dried basil",
    "1/2 tsp dried thyme",
    "1/2 tsp ground coriander",
    "Salt and freshly ground black pepper",
    "2 large red bell peppers, diced into 1 1/4-inch pieces",
    "3 small zucchini (nearly 1 lb), sliced into rounds slightly under 1/2-inch thick",
    "1 large red onion, diced into 1 1/4-inch wedges",
    "1 medium cucumber (about 8 oz), peeled, seeded and chopped into chunks*",
    "1 tsp salt, plus more to taste",
    "2 (5.3 oz) containers plain Greek yogurt (1 heaping cup)",
    "1 clove garlic, finely minced",
    "1 Tbsp fresh lemon juice",
    "1 Tbsp extra virgin olive oil",
    "1 Tbsp chopped fresh parsley, plus more for garnishing kebabs",
    "1 Tbsp chopped fresh dill (or 1 tsp dried)",
    "Freshly ground black pepper"
  ],
  "__v": 1
}