{
  "hash": "d24707456b7f7c9922af64c8a0bc85ef6289e6f8",
  "title": "Best Ever Sloppy Joe",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2009/11/sloppy-joe-horiz-a-1600.jpg",
  "href": "http://www.simplyrecipes.com/recipes/sloppy_joes/",
  "extension": "",
  "firstAdded": "2016-04-24T02:02:19.428000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Sauté the carrots, onions, celery, and garlic: Heat olive oil in a large sauté pan on medium high heat. Add the minced carrots and sauté for 5 minutes. (If you are using bell pepper instead of carrots, add those at the same time as the onions.)",
    "Add the chopped onion and celery. Cook, stirring occasionally until onions are translucent, about 5 more minutes.",
    "Add the minced garlic and cook for 30 more seconds. Remove from heat. Remove vegetables from the pan to a medium sized bowl, set aside.",
    "2 Brown the ground beef: Using the same pan (or you can cook the meat at the same time as the vegetables in a separate pan to save time), crumble the ground beef into the pan. You will likely need to do this in two batches, otherwise you will crowd the pan and the beef won't easily brown.",
    "Sprinkle with salt.",
    "Do not stir the ground beef, just let it cook until it is well browned on one side. Then flip the pieces over and brown the second side. Use a slotted spoon to remove the ground beef from the pan (can add to the set-aside vegetables) and repeat with the rest of the ground beef.",
    "If you are using extra lean beef, you will likely not have any excess fat in the pan. If you are using 16% or higher, you may have excess fat. Strain off all but 1 tablespoon of the fat.",
    "3 Add ketchup, tomato sauce, Worcestershire, vinegar, sugar, spices to the ground beef and vegetables: Return the cooked ground beef and vegetables to the pan. Use a wooden spoon to break up any chunks of ground beef into smaller bits.",
    "Add the ketchup, tomato sauce, Worcestershire sauce, vinegar and brown sugar to the pan. Stir to mix well. Add ground cloves, thyme, and cayenne pepper.",
    "Lower the heat to medium low and let simmer for 10 minutes. Adjust seasonings to taste.",
    "Serve with toasted hamburger buns."
  ],
  "ingredients": [
    "0",
    "1 Tbsp olive oil",
    "1/2 cup minced carrots (can sub chopped bell pepper)",
    "1 cup finely chopped onion (about 1 medium onion)",
    "1/2 cup finely chopped celery",
    "2 cloves garlic, minced",
    "1/2 teaspoon salt",
    "1 1/4 lb ground beef",
    "1/2 cup ketchup",
    "2 cups tomato sauce (or 1 15-ounce can whole tomatoes, puréed)",
    "1 Tbsp Worcestershire sauce",
    "1 Tbsp red wine vinegar",
    "1 1/2 Tbsp brown sugar",
    "Pinch ground cloves",
    "1/2 teaspoon dried thyme",
    "Pinch cayenne pepper",
    "2 turns of freshly ground black pepper",
    "4 hamburger buns"
  ],
  "__v": 1
}