{
  "hash": "25a447a3814351bcf613fc940df74a83f57e984f",
  "title": "Mozzarella-Stuffed Crispy Baked Onion Rings Recipe",
  "image": "http://www.seriouseats.com/recipes/assets_c/2015/04/20150412-Baked-Mozzarella-Stuffed-Onion-Rings-Cheese-Morgan-Eisenberg-thumb-1500xauto-421875.jpg",
  "href": "http://www.seriouseats.com/recipes/2015/04/mozzarella-stuffed-crispy-baked-onion-rings-recipe.html",
  "extension": "",
  "firstAdded": "2017-07-14T02:26:37.270000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large, shallow container, combine onion slices and buttermilk, making sure to coat all of the onions. Cover and refrigerate for at least one hour, or overnight (longer soaking will yield more tender onions).",
    "Preheat the oven to 425°F. Line a baking sheet with foil. Remove onions from the buttermilk and arrange on the prepared baking sheet. Arrange onion slices in pairs, with each pair having one ring about 1/2 inch smaller in diameter than its partner (the goal is to nest one inside the other with just a small gap between them).",
    "Remove the string cheese from the freezer just long enough to soften it up slightly, about 5 minutes. Quarter the cheese sticks lengthwise. Press the cheese string quarters snugly in the gap between each onion ring pair. You should be able to fit about 2 string cheese quarters per onion ring.",
    "Pour 3/4 cup flour into a small bowl. In a separate bowl, beat the eggs. In a third bowl, combine the remaining 1/4 cup flour, corn meal, panko, crushed Corn Chex, salt, and pepper. Gently dip the stuffed onion rings, one at a time, into the flour, and then into the egg, and then back into the flour. Dip the rings once more in the egg and then into the panko coating. Transfer coated onion rings to the baking sheet. Spray onion rings liberally with nonstick cooking spray.",
    "Bake until crisp and golden, about 22 minutes, flipping once halfway through. Serve with marinara or ranch for dipping."
  ],
  "ingredients": [
    "0",
    "1 large sweet onion, cut into 1/2 inch thick rings",
    "2 1/2 cups buttermilk",
    "12 sticks part skim mozzarella cheese sticks, frozen",
    "1 cup whole wheat flour, divided (see note above)",
    "3 large eggs",
    "1/2 cup cornmeal",
    "1/2 cup panko",
    "1/2 cup Corn Chex or cornflakes, crushed",
    "1/2 teaspoon kosher salt",
    "1/4 teaspoon ground black pepper",
    "Nonstick cooking spray",
    "Marinara sauce or ranch dressing, for dipping"
  ],
  "__v": 1
}