{
  "hash": "ead5b29309eb4d706663c90b6908a9ec48d90ef4",
  "title": "ROASTED CAULIFLOWER SOUP",
  "image": "https://www.spendwithpennies.com/wp-content/uploads/2018/02/Roasted-Cauliflower-Soup-3.jpg",
  "href": "https://www.spendwithpennies.com/roasted-cauliflower-soup/",
  "extension": "Firefox",
  "firstAdded": "2018-11-26T03:54:17.445000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Preheat oven to 450 degrees F. Line a baking tray with foil and lightly spray with nonstick cooking spray.",
    "Add cauliflower and whole garlic cloves to baking tray. Drizzle evenly with oil, salt and pepper. Toss until evenly coated, then spread out into a single layer.",
    "Roast at 450 degrees F for 30-35 minutes, until golden brown and tender. Stir cauliflower once half way through cooking then spread back into an even layer.",
    "Melt the butter in a Dutch oven or soup pot over medium heat. Sprinkle in flour and cook for 2 minutes. Reduce heat to low and slowly whisk in chicken broth, onion powder, thyme, nutmeg and cayenne pepper. Add cauliflower and garlic and bring to a boil, whisking constantly, then reduce to a simmer for 5 minutes or until thickened.",
    "Puree with an immersion blender or working in batches, puree in blender, taking care to let smoke escape or it will explode (I leave a corner open and cover with a paper towel).",
    "Pour creamy blender contents back into pot. Season with salt and pepper to taste. For a thinner soup, stir in additional chicken broth or m"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 large head cauliflower approx. 6 cups",
    "4 garlic cloves peeled",
    "3 tablespoons olive oil",
    "1 teaspoon salt",
    "1/2 teaspoon ground black pepper",
    "2 tablespoons butter",
    "2 tablespoons all-purpose flour",
    "4 cups low sodium chicken broth",
    "1/2 teaspoon onion powder",
    "1/2 teaspoon dried thyme",
    "1/4 teaspoon ground nutmeg",
    "1/4 teaspoon cayenne pepper optional"
  ],
  "__v": 1
}