{
  "hash": "2ede614bed1dd5472901b7f3c55fecc3cea8ccf9",
  "title": "VEGAN SWEET POTATO BUTTERNUT SQUASH TORTILLA",
  "image": "https://minimalistbaker.com/wp-content/uploads/2017/12/AMAZING-Vegan-Sweet-Potato-Butternut-Squash-Gratin-8-ingredients-1-bowl-required-BIG-flavor-vegan-glutenfree-plantbased-gratin-butternutsquash-sweetpotato-minimalistbaker-recipe-8.jpg",
  "href": "https://minimalistbaker.com/vegan-sweet-potato-butternut-squash-tortilla/",
  "extension": "",
  "firstAdded": "2018-04-30T16:40:45.663000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 degrees F (176 C) and use a mandolin or sharp knife to very thinly slice the peeled sweet potato and butternut squash.",
    "Add sliced potatoes and squash to a large mixing bowl and top with oil, rosemary, thyme, parsley, nutritional yeast, salt, and garlic. Toss to combine.",
    "Add to a 9x13-inch (or similar size - mine was slightly smaller) baking dish in a single layer, trying to arrange the potatoes and squash in layers like lasagna. Press down to flatten. Then cover with foil.",
    "Bake for 40 minutes. Then remove foil and bake for another 10-15 minutes at 375 degrees F (190 C) or until the potatoes and squash are fork tender and slightly golden brown on the edges.",
    "Let cool briefly. Then serve with fresh herbs and a sprinkle more nutritional yeast or vegan parmesan cheese (optional).",
    "Store leftovers loosely covered in the fridge up to 3 days or in the freezer up to 1 month. Reheat in the microwave or a 350-degree F (176 C) oven until hot."
  ],
  "ingredients": [
    "0",
    "TORTILLA",
    "2 cups (~250 g) peeled, thinly sliced sweet potatoes",
    "4 cups (~500 g) thinly sliced butternut squash (peeled, seeds removed)",
    "4-6 Tbsp (60-90 ml) olive or avocado oil*",
    "2 Tbsp (6 g) fresh chopped rosemary or thyme (I used both)",
    "1/4 cup (7 g) chopped fresh parsley, plus more for serving",
    "2 Tbsp (6 g) nutritional yeast",
    "1/2 tsp sea salt",
    "3 garlic cloves, chopped (9 g)",
    "FOR SERVING optional",
    "2 Tbsp (10 g) vegan parmesan cheese"
  ],
  "__v": 1
}