{
  "hash": "e6582cd4a81dd2227340cf62e1c93f4bdc3f0cea",
  "title": "BACON, BRUSSELS SPROUTS, BUTTERNUT SQUASH PASTA",
  "image": "https://reciperunner.com/wp-content/uploads/2016/11/Bacon-Brussels-Sprouts-Butternut-Squash-Pasta2-680x991.jpg",
  "href": "https://reciperunner.com/bacon-brussels-sprouts-butternut-squash-pasta/",
  "extension": "",
  "firstAdded": "2018-04-30T23:04:28.383000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 425 degrees.",
    "In a large bowl toss together the vegetables, oil, salt and pepper until coated.",
    "Dump the vegetables out onto a rimmed baking sheet and spread them out into a single layer.",
    "Roast the vegetables for 10 minutes then remove from the oven, toss and place back in the oven to roast for another 10 minutes or until the squash is tender.",
    "While the vegetables roast cook the pasta according to package instructions, reserve 1 cup of the pasta water.",
    "Heat a large skillet over medium heat.",
    "Cut the bacon into small pieces and add it to the skillet.",
    "Cook the bacon until crisp, about 5 minutes, then remove it from the skillet and drain on paper towels.",
    "Discard the excess bacon grease, but don't wipe out the skillet.",
    "Add the cooked pasta to the skillet along with the roasted vegetables, bacon and parmesan cheese.",
    "Toss everything together and slowly add in some of the pasta water until a sauce starts to form.",
    "Season with more salt and pepper and top with extra parmesan cheese."
  ],
  "ingredients": [
    "0",
    "1 tablespoon extra virgin olive oil",
    "3 cups cubed butternut squash, peeled",
    "2 cups halved Brussels sprouts",
    "4 shallots, cut into chunks",
    "Kosher salt and fresh ground black pepper to taste",
    "3/4 pound whole wheat farfalle or pasta of choice",
    "3 strips bacon",
    "Kosher salt and fresh ground black pepper to taste",
    "1/2 cup shredded parmesan cheese"
  ],
  "__v": 1
}