{
  "hash": "9b3218ddd5ea23df81a5dc05946cf8c0dbe789d8",
  "title": "Coffee \"S'mores\" Pie",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/coffee-s-mores-pie",
  "extension": "Chrome",
  "firstAdded": "2015-05-08T18:56:16.388000",
  "users": [
    null
  ],
  "keywords": [
    "servings",
    "graham",
    "cracker",
    "crust",
    "crackers",
    "food",
    "processor",
    "cream",
    "nutella",
    "semisweet",
    "bittersweet",
    "chocolate",
    "unsalted",
    "butter",
    "coffee",
    "ganache",
    "exceed",
    "cacao",
    "cubes",
    "beans",
    "meringue",
    "egg",
    "whites",
    "sugar"
  ],
  "directions": [
    "0",
    "Preparation",
    "Graham Cracker Crust",
    "Mix graham cracker crumbs and remaining ingredients in a small bowl to blend. Press mixture onto bottom and up sides of pie dish; chill until crust is firm, about 30 minutes.",
    "Coffee Ganache",
    "Place chocolate and butter in a large bowl. Bring cream, coffee, and 2 Tbsp. water to a boil in a small saucepan. Remove from heat; cover and let steep for 5 minutes.",
    "Strain cream mixture through a fine-mesh sieve into bowl with chocolate and butter; discard coffee grounds. Stir until melted and ganache is smooth. Pour into chilled crust; smooth top. Chill until set, about 1 hour.",
    "Meringue",
    "Using an electric mixer with clean, dry beaters on medium speed, beat egg whites in a medium bowl until light and frothy. Add sugar in 4 additions, beating for 1 minute after each addition. Continue beating egg whites until stiff and glossy.",
    "Spoon meringue over coffee ganache; swirl decoratively with a spatula or the back of a spoon. Using a kitchen torch, if desired, toast meringue until golden brown in spots. DO AHEAD: Pie can be made 8 hours ahead. Keep chilled."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "SERVINGS: 8",
    "Graham Cracker Crust",
    "9 whole graham crackers, ground finely in a food processor",
    "2 tablespoons heavy cream",
    "2 tablespoons Nutella",
    "1 ounce semisweet or bittersweet chocolate, melted",
    "1 tablespoon unsalted butter, melted",
    "Coffee Ganache",
    "12 ounces semisweet or bittersweet chocolate (do not exceed 61% cacao), finely chopped",
    "2 tablespoons (1/4 stick) unsalted butter, cut into 1/2' cubes",
    "1 1/4 cups heavy cream",
    "2 tablespoons finely ground coffee beans",
    "Meringue",
    "2 large egg whites",
    "1/2 cup sugar"
  ],
  "__v": 1
}