{
  "hash": "2a82ccad9d0bd6eadcf6b60fb66fa658c4c3191d",
  "title": "Κοτόπουλο μπούτι με λιαστές ντομάτες σε κρεμώδη σάλτσα",
  "image": "https://kouzinista.files.wordpress.com/2015/03/chicken-with-sun-dried-tomato-sauce-kouzinistablog1l.jpg?w=600&h=900",
  "href": "https://kouzinista.wordpress.com/2015/03/15/chicken-with-creamy-sun-dried-tomato-sauce/",
  "extension": "Chrome",
  "firstAdded": "2016-01-10T02:20:01.958000",
  "users": [
    null
  ],
  "keywords": [],
  "directions": [
    "0",
    "Προθερμαίνουμε το φούρνο στους 200°C, στις αντιστάσεις. Θα χρειαστούμε μια φαρδιά κατσαρόλα, κεραμική ή αντικολλητική, που να μπαίνει στο φούρνο. Αν δεν έχουμε, θα λερώσουμε, αναγκαστικά, δύο σκεύη, ένα αντικολλητικό τηγάνι για το σοτάρισμα και ένα πυρίμαχο σκεύος για το φούρνο.",
    "Πλένουμε τα μπούτια κοτόπουλου και τα στεγνώνουμε καλά με απορροφητικό χαρτί. Αλατοπιπερώνουμε από όλες τις πλευρές.",
    "Ζεσταίνουμε το ελαιόλαδο στην κατσαρόλα, σε μέτρια προς δυνατή φωτιά, μέχρι να κάψει. Προσθέτουμε τα κομμάτια του κοτόπουλου, σε μία στρώση, με το δέρμα προς τα κάτω. Τα σοτάρουμε, μέχρι να ροδίσουν καλά, 3 με 4 λεπτά από κάθε πλευρά. Αποσύρουμε τα κομμάτια του κοτόπουλου και τα ακουμπάμε σε μια πιατέλα.",
    "Χαμηλώνουμε τη φωτιά και στο λάδι που έμεινε στην κατσαρόλα, σοτάρουμε το κρεμμύδι, μέχρι να μαλακώσει και να αρχίσει να καραμελώνει, περίπου 5 λεπτά. Προσθέτουμε τις λιαστές ντομάτες, το σκόρδο και το μπούκοβο και σοτάρουμε για ένα λεπτό ακόμα. Ρίχνουμε το αλεύρι και ανακατεύοντας γρήγορα, το καβουρδίζουμε ελαφρά, 1 με 2 λεπτά. Προσθέτουμε το γάλα, το ζωμό, την τριμμένη γραβιέρα, τη ρίγανη, το θυμάρι και το μαϊντανό, ανακατεύοντας συνεχώς για να μην δημιουργηθούν σβόλοι. Σιγοβράζουμε τη σάλτσα, μέχρι να πήξει ελαφρά (θέλουμε να αποκτήσει την πυκνότητα κρέμας γάλακτος). Αν είναι πολύ πυκνή, την αραιώνουμε με λίγο γάλα. Δοκιμάζουμε και αλατοπιπερώνουμε ανάλογα με το γούστο μας.",
    "Βάζουμε τα κομμάτια του κοτόπουλου σε μία στρώση μέσα στη σάλτσα, με το δέρμα προς τα πάνω. Ψήνουμε στο φούρνο για 30 με 35 λεπτά, χωρίς να σκεπάσουμε την κατσαρόλα, μέχρι να μαγειρευτεί το κοτόπουλο και να μαλακώσει. Αν δούμε ότι η σάλτσα έχει πήξει πολύ, την αραιώνουμε με λίγο γάλα και ανακατεύουμε, ανακινώντας την κατσαρόλα από τα χερούλια.",
    "Το σερβίρουμε ζεστό, πασπαλισμένο με φρέσκο μαϊντανό. Η νόστιμη κρεμώδης σάλτσα ταιριάζει πολύ με ζυμαρικά, ιδιαίτερα ταλιατέλες, ή ρύζι ως συνοδευτικό πιάτο."
  ],
  "ingredients": [
    "0",
    "4 ολόκληρα μπούτια κοτόπουλου, κομμένα στη μέση",
    "(επιλέξτε το βάρος τους ανάλογα με το μέγεθος",
    "της μερίδας που σας ταιριάζει≈1200g)",
    "2 κ.σ. ελαιόλαδο",
    "1 μικρό κρεμμύδι, ψιλοκομμένο",
    "1 κούπα λιαστές ντομάτες στο λάδι, στραγγισμένες",
    "και κομμένες σε λωρίδες (στραγγισμένο βάρος≈100g)",
    "2−3 σκελίδες σκόρδο, στην πρέσα",
    "¼ κ.γλ. μπούκοβο (προαιρετικά)",
    "1½ κ.σ. αλεύρι",
    "1½ κούπα γάλα (360ml)",
    "½ κούπα ζωμό κοτόπουλο",
    "½ κούπα πικάντικη γραβιέρα, τριμμένη (50g)",
    "½ κ.γλ. ρίγανη",
    "½ κ.γλ. θυμάρι",
    "¼ κούπας φύλλα μαϊντανού, ψιλοκομμένα",
    "αλάτι, φρεσκοτριμμένο πιπέρι"
  ],
  "__v": 1
}