{
  "hash": "d46350a06c525a0f50d3505ec2cb044fc25b9cd7",
  "title": "Mexican-Style Tortilla Wings",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/mexican-style-tortilla-wings-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-04-26T23:46:08.946000",
  "users": [
    null
  ],
  "keywords": [
    "plain",
    "tortilla",
    "chips",
    "corn",
    "oil",
    "mild",
    "chili",
    "oregano",
    "cumin",
    "cayenne",
    "pepper",
    "paprika",
    "black",
    "chicken",
    "wings",
    "wing",
    "joint"
  ],
  "directions": [
    "0",
    "Preheat the oven 375 degrees F. Oil a large baking sheet.",
    "Using a food processor or blender, pulverize the tortilla chips until finely ground, then place them in a bowl.",
    "In a separate bowl, whisk together the corn oil, chili powder, oregano, cumin, cayenne pepper, paprika, and black pepper. Dip the wings into the oil mixture, let excess oil drip off, then dredge them in the tortilla coating. Place coated wings on a large oiled baking sheet and bake for 35 to 40 minutes, following the method below, until the tortilla coating is browned and uniformly crispy.",
    "Method for Baking Wings: Using a paper towel, lightly oil a 9 by 13-inch baking sheet to prevent wings from sticking. Place your prepared wings in a single layer on a prepared baking sheet and bake in a preheated 350 degrees F oven until crispy brown, 30 to 40. If you are using a marinade, you can periodically baste wings for the first 15 minutes. If you are applying a barbecue glaze, apply during the last 10 minutes of cooking. For extra-crispy wings, you may place the wings under the broiler to 2 to 3 minutes at the end of cooking.",
    "Recipe courtesy Christopher B. O'Hara, Wing It!: Delectable Recipes for Everyone's Favorite Bar Snack, Clarkson Potter, 2004"
  ],
  "ingredients": [
    "0",
    "36 ounces plain tortilla chips",
    "1 1/2 cups corn oil",
    "1/4 cup mild chili powder",
    "3 teaspoons dried oregano",
    "3 teaspoons ground cumin",
    "1 teaspoons cayenne pepper",
    "1 teaspoon paprika",
    "1/2 teaspoon freshly ground black pepper",
    "30 chicken wings, small wing joint removed"
  ],
  "__v": 1
}