{
  "hash": "05875282f52d859a7d47d8342d15b41884f90dea",
  "title": "Cannoli",
  "image": "",
  "href": "https://cheftap.com/recipes/cannoli-8/",
  "extension": "Chrome",
  "firstAdded": "2018-11-12T18:44:28.446000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "SHELLS",
    "Sift together flour, sugar, and salt.",
    "With fingers, work the wine gradually into the dry ingredients to form a stiff dough.",
    "Form into ball, wrap in plastic, and let rest at room temp for 1 hour.",
    "On a lightly floured surface, roll the dough to 1/8 inch thickness.",
    "With a cutter, cut out rounds 5 inches in diameter.",
    "In batches, wrap each round onto a cannoli mold, sealing the edges with egg white.",
    "In a deep saute pan, heat the oil to 350 degrees F.",
    "Fry the cannoli in batches until just golden brown and crisp, about 2 minutes.",
    "Drain on paper towels, let cool, then gently slip the molds from the cannoli.",
    "(Note: Shells can be made up to three days in advance and kept at room temperature in an airtight container.)",
    "FILLING",
    "Whip the cream.",
    "Fold in the ricotta with a rubber spatula, working until creamy.",
    "Fold in the sugar and liqueur.",
    "Place one shell on a flat surface.",
    "Working from one end, fill with the filling, pressing gently to make sure the middle is filled.",
    "Dip both ends in the melted chocolate, then into the pistachios and place on a waxed paper lined baking sheet.",
    "Repeat and serve."
  ],
  "ingredients": [
    "0",
    "FOR THE SHELLS",
    "1 1/2 cups all purpose flour",
    "1 tablespoon sugar",
    "1/8 tablespoon salt",
    "1/2 cup dry Marsala or other dry red wine",
    "Cannoli molds",
    "2 beaten egg whites",
    "Vegetable oil for frying",
    "FILLING",
    "1/2 cup heavy cream",
    "1 pound ricotta",
    "1/2 cup powdered sugar",
    "2 teaspoon but flavored liqueur such as Amaretto",
    "1/2 cups melted semisweet chocolate",
    "1/4 cup chopped pistachios"
  ],
  "__v": 1
}