{
  "__v": 1,
  "directions": [
    "0",
    "Prepare the short dough and the italian meringue and set aside in the refrigerator to chill.",
    "1",
    "Place the milk in a heavy bottomed pot. Cut the vanilla bean in half lengthwise, and scrape the seeds into the pot. Add the seed pod as well. Add the cinnamon sticks and blood orange zest strips (careful that the zest strips don't contain any of the pith). Bring the milk to a simmer.",
    "Once the milk has reached a simmer, remove the pot from the heat and let it cool to room temperature with the vanilla bean pod, cinnamon stick, and blood orange zest strips in it.",
    "In the mean time, mix the cornstarch, sugar, salt and eggs together in a bowl. Set aside.",
    "After the milk has reached room temperature, remove the vanilla bean pod, cinnamon stick, and blood orange zest strips",
    "Bring the milk back to a simmer. Once the milk begins to simmer, slowly pour some of the milk into the sugar mixture while whisking vigorously to temper the eggs. Return the tempered egg mixture to the pot with the remaining milk.",
    "Heat the mixture over medium-high heat and bring it to a boil, stirring or whisking constantly. Once at a boil, continue cooking for another 30 seconds to ensure the cornstarch taste is cooked out.",
    "Remove from the heat and stir in the butter. Mix until the butter is completely melted.",
    "Allow the custard to cool to room temperature before placing in the fridge to chill. Chill for 2 hours or until completely chilled and set.",
    "2",
    "In the meantime, preheat the oven to 375°F.",
    "Once the dough has chilled, roll it out to about ⅛-1/4\" thickness. Using a sharp paring knife, cut out circles about 2\" wider in diameter than the tartlet pans. Carefully place the dough in each pan, pushing it down to fill in the corners. Cut off the excess. Refrigerate the dough in the pans for 30 minutes.",
    "Once chilled and hardened again, line each tart pan with parchment paper, pressing it against the bottom and sides of the dough. Fill each pan with pie weights or dry beans.",
    "Place the weighted tart pans in the oven and bake for 15 to 20 minutes, or until the dough has set.",
    "Carefully remove the pie weights or beans, and the parchment paper, and return to the oven. Bake for another 10 to 15 minutes or until the crust is golden brown. Remove and let cool.",
    "Once cool, fill each tart with enough custard to reach the top.",
    "In the meantime, heat the honey in a pot over medium-low heat, just until it thins out. Top each tart with a few blood orange segments, and brush the orange segments with the honey.",
    "Top each tart with a dollop of italian whipped cream, and torch the whipped cream."
  ],
  "firstAdded": "2014-08-08T00:45:18.624000",
  "hash": "a3b8b16c6af5638305bbb0ae11eb32ee653c8d52",
  "href": "http://chasingdelicious.com/blood-orange-cinnamon-vanilla-tarts/",
  "image": "http://chasingdelicious.com/wp-content/uploads/2014/02/MG_9938-620x775.jpg",
  "ingredients": [
    "0",
    "Italian Meringue, recipe here",
    "Sweet Lemon Oat Short Dough, recipe here",
    "1",
    "1 qt. milk",
    "1 vanilla bean",
    "1 cinnamon stick",
    "Zest strips from 2 blood oranges",
    "2 oz. cornstarch",
    "8 oz. sugar",
    "½ tsp. salt",
    "3 eggs",
    "3 oz. unsalted butter",
    "2",
    "2 blood oranges, segmented with pith and zest removed",
    "¼ cup honey"
  ],
  "keywords": [
    "italian",
    "meringue",
    "recipe",
    "lemon",
    "oat",
    "short",
    "dough",
    "milk",
    "vanilla",
    "bean",
    "cinnamon",
    "zest",
    "strips",
    "blood",
    "oranges",
    "cornstarch",
    "sugar",
    "salt",
    "eggs",
    "unsalted",
    "butter",
    "segmented",
    "pith",
    "honey"
  ],
  "title": "Blood Orange & Cinnamon Vanilla Tarts",
  "users": [
    null
  ]
}