{
  "hash": "2da98b1b5b494239404a9cd6b7e99d2a12ddeaf2",
  "title": "CURRY TURKEY BITES + APRICOT-GINGER SAUCE",
  "image": "http://nomnompaleo.net/wp-content/uploads/2016/07/curturk00.jpg",
  "href": "http://nomnompaleo.com/post/147964016043/curry-turkey-bites-apricot-ginger-sauce",
  "extension": "Chrome",
  "firstAdded": "2016-12-19T00:38:32.793000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 400° F convection bake or 425° F non-convection bake with the rack in the middle position. Line two rimmed baking sheets with parchment paper and set aside.",
    "In a large bowl, combine all the turkey bite ingredients: ground turkey, shredded sweet potatoes, chopped chard leaves, whisked egg…",
    "…garlic, ginger, serrano pepper (if using), sliced scallions, curry powder…",
    "…salt, and the zest and juice from one lime.",
    "Yes, these patties are packed with vegetables.",
    "Using your hands, mix all the ingredients together until well combined, but don’t overwork the mixture.",
    "You can check for seasoning by pinching off a bit of the meat mixture and frying up a tiny patty. Taste it, and adjust the seasoning as needed.",
    "Scoop out heaping tablespoon balls and arrange them on the two lined baking sheets, making sure they sit about 2 inches apart.",
    "Smoosh each ball with your fingers into ½-inch thick patties.",
    "Cook one tray in the oven for 15 minutes or until browned on the edges and cooked through, rotating the tray at the midway point. Bake the second tray of patties the same way.",
    "While the bites are baking, make the dipping sauce.",
    "In a small saucepan, combine the coconut aminos, apricot jam…",
    "…and fresh ginger.",
    "Stir the sauce over medium heat until simmering.",
    "Remove the pot from the heat, and add the freshly ground black pepper and lemon juice.",
    "Serve the turkey bites with the dipping sauce.",
    "Pro-tip: The turkey bites can be stored in a sealed container in the fridge for up to a week or in the freezer for up to a month. I fry the frozen patties over medium heat with some melted ghee (about 2-3 minutes per side) and transport them in a nifty LunchBots Thermals to keep them warm until you’re ready to nosh! It’s the gift that keeps on giving."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Curry Turkey Bites",
    "1 pound ground turkey (step away from the super low-fat stuff!)",
    "2 cups (230 g) shredded sweet potato (about 1 large one)",
    "1 cup (60 g) finely chopped Swiss chard leaves, loosely packed",
    "1 large egg, whisked",
    "1 teaspoon minced garlic",
    "1 teaspoon minced ginger",
    "1 serrano pepper, seeded and minced (optional)",
    "2 scallions, thinly sliced",
    "1 tablespoon Indian curry powder",
    "2 teaspoons kosher salt",
    "Juice and zest from 1 lime",
    "Apricot-Ginger Sauce",
    "2 tablespoons coconut aminos",
    "½ cup apricot jam (sweetened with fruit juice)",
    "½ teaspoon minced fresh ginger",
    "¼ teaspoon freshly ground black pepper",
    "2 tablespoons lemon juice"
  ],
  "__v": 1
}