{
  "hash": "f34ec46983023857a8d4450c25cb87c51c49d49e",
  "title": "Frozen Margarita Pie",
  "image": "https://imagesvc.meredithcorp.io/?w=180&url=https://images.media-allrecipes.com/userphotos/6374503.jpg",
  "href": "http://www.eatingwell.com/recipe/248516/frozen-margarita-pie/?printview",
  "extension": "Chrome",
  "firstAdded": "2020-05-25T17:52:29.265000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Step 1",
    "To make crust: Preheat oven to 350 degrees F. Lightly oil a 9-inch pie pan or coat it with nonstick spray.",
    "Step 2",
    "Combine pretzels and sugar in a food processor and process until finely ground. Add egg white, oil and water and pulse until moistened. Press firmly into bottom and sides of prepared pan.",
    "Step 3",
    "Bake crust for 10 minutes. Cool completely on a wire rack.",
    "Step 4",
    "To make filling: Whisk condensed milk, lime juice, tequila, orange zest and food coloring (if using) in a medium bowl until smooth. Set aside.",
    "Step 5",
    "Combine warm water, powdered egg whites and cream of tartar in another mixing bowl. Stir gently until egg whites are dissolved, about 2 minutes. Beat with an electric mixer on medium-high speed until soft peaks form. Gradually add sugar, beating until stiff and glossy.",
    "Step 6",
    "Beat cream in a small chilled bowl with chilled beaters with an electric mixer on medium speed until soft peaks form. (Alternatively, use a chilled wire whisk.)",
    "Step 7",
    "With a rubber spatula, gently fold reserved condensed milk mixture into beaten whites; fold in whipped cream. Pour filling into cooled crust. Freeze, uncovered, until firm, about 1 hour. Cover and freeze for at least 6 hours more.",
    "Step 8",
    "Soften pie in the refrigerator for 20 to 30 minutes before slicing. Garnish with lime slices and Sour Cream Topping, if desired."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Pretzel Crust",
    "3 cups thin salted pretzel sticks, (about 4 ounces)",
    "3 tablespoons sugar",
    "1 large egg white",
    "1 tablespoon canola oil",
    "1 tablespoon water",
    "Margarita Filling",
    "1 14-ounce can nonfat sweetened condensed milk",
    "⅓ cup lime juice",
    "2 tablespoons tequila",
    "1 teaspoon freshly grated orange zest",
    "6 tablespoons warm water",
    "2 drops green food coloring (optional)",
    "2 tablespoons dried egg whites (see Tip)",
    "Pinch of cream of tartar",
    "¼ cup sugar",
    "⅓ cup whipping cream",
    "Lime slices and Sour Cream Topping (see Associated Recipes) for garnish (optional)"
  ],
  "__v": 1
}