{
  "hash": "4ee6909bfaedbc305de579cc699dc0711c0a602a",
  "title": "No-Knead Dinner Rolls",
  "image": "https://static01.nyt.com/images/2018/12/21/dining/em-no-knead-bread-rolls/merlin_148333197_fb42362e-f3db-4844-ba5b-24395822205e-articleLarge.jpg",
  "href": "https://cooking.nytimes.com/recipes/1019859-no-knead-dinner-rolls?campaign_id=58&em_pos=medium&emc=edit_ck_20200327&instance_id=17084&nl=cooking&nl_art=0&ref=headline&regi_id=79859114&segment_id=23071&te=1&user_id=4264688f24592aeeb06433e5d96d7150",
  "extension": "Firefox",
  "firstAdded": "2020-03-28T20:22:39.862000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large bowl, stir the flour, sugar, yeast and salt until combined. In a small saucepan, heat 2/3 cup/160 mililiters milk over medium-low until it’s just warm to the touch (about 95 degrees), about 1 to 2 minutes. Add 3 tablespoons butter and heat until melted. Remove the saucepan from the heat. If it is much warmer than 95 degrees, let cool briefly before continuing.",
    "In a small bowl, lightly whisk the eggs just until combined. Gradually whisk the eggs into the milk mixture, then pour into the bowl with the flour. Using a wooden spoon or silicone spatula, stir the dough until it’s uniformly combined. If it seems dry or isn’t coming together, stir in more milk 1 tablespoon at a time (up to 3 tablespoons) to bring it together. (This milk does not need to be heated.) The dough should be sticky.",
    "Cover the bowl with plastic wrap, and let rise in a warm place until doubled in size, 2 to 2 1/2 hours.",
    "Grease a 9-by-9-inch baking pan with butter. Divide the dough into 9 even pieces (about 85 grams each), and round each into a tight ball. Place the rolls evenly spaced into the prepared pan. (They will not be touching. There will be about 1/4 to 1/2-inch between each roll.)",
    "Cover the pan with greased plastic wrap, and let rolls rise until they nearly double in size, about 35 to 45 minutes: They will now touch inside the pan and look puffy and risen. Toward the end of the rise time, heat the oven to 375 degrees.",
    "Melt the remaining 3 tablespoons butter in a small pot over medium heat or in a small dish in a microwave. Remove the plastic wrap from the rolls, and brush the tops of the rolls generously with about half the butter. Bake until the rolls are golden brown, 20 to 24 minutes. Halfway through baking, brush the surface of the rolls with more butter and rotate the pan.",
    "When the rolls come out of the oven, brush them with the remaining butter. Let cool at least 5 minutes before serving warm."
  ],
  "ingredients": [
    "0",
    "3 ½ cups/450 grams all-purpose flour",
    "2 tablespoons granulated sugar",
    "2 ½ teaspoons instant yeast",
    "1 ½ teaspoons kosher salt",
    "⅔ cup/160 milliliters whole milk, plus 1 to 3 tablespoons, if needed",
    "7 tablespoons/100 grams unsalted butter, plus more for the pan",
    "2 large eggs"
  ],
  "__v": 2
}