{
  "__v": 3,
  "directions": [
    "0",
    "To begin, make the dough. Dissolve the yeast in the water in the bowl of a stand mixer fitted with a dough hook attachment, and allow it to sit for 5 minutes, until bubbly. Add 3 cups of the flour, 1 cup of milk, the melted butter, 1/4 cup sugar, salt and eggs. Beat at medium speed for 3 minutes. Stir in enough of the remaining flour, 1/4 cup at a time, until the dough is firm and not sticky. Increase the speed of the mixer to medium high, and allow the dough hook to knead the dough for 3-4 minutes. All of the dough should form a ball on the hook, and the sides and bottom of the mixing bowl should be clean. Place dough in a greased bowl, turning once to grease the top. Cover and refrigerate overnight.",
    "For the caramel, place the brown sugar, cubed butter and 6 tablespoons milk in a microwave-safe bowl. Cook on high for approximately 3 minutes, stopping to stir after each 1-minute interval, until mixture is bubbly and sugar is completely dissolved. Pour half of the caramel into the greased Bundt pan and sprinkle with half of the pecans.",
    "Punch the risen dough down, and roll it out into a large rectangle on a floured surface. Use a pizza cutter to cut the dough into 40-50 squared, and then shape each square into a ball.",
    "Mix together the sugar and cinnamon in a pie plate. Pour the melted butter into another pie plate. Roll the dough balls in the butter and then coat with the cinnamon-sugar mixture. Place half of the balls in the pan, and then pour the the remaining caramel on top and sprinkle with the remaining the pecans. Finish with a final layer of the remaining dough balls. Cover the pan and let rise until doubled, approximately 1 hour.",
    "Bake at 350 degrees until the top is a deep golden brown, 40-50 minutes. (I highly recommend placing the Bundt pan on a baking sheet to prevent any boiling-over messes.) Cool for 10 minutes before inverting onto a serving plate. Serve warm."
  ],
  "firstAdded": "2014-11-16T02:41:28.639000",
  "hash": "aeda07636c83c47db904464efb20d565249ecb53",
  "href": "http://www.pepperplate.com/recipes/view.aspx?id=4925340",
  "image": "http://cdn2.pepperplate.com/recipes/4925340.jpg?preset=sitethumb",
  "ingredients": [
    "0",
    "2 1/4 teaspoons active dry yeast ((1 package))",
    "1/4 cup warm water (110-115 degrees)",
    "5 cups all-purpose flour",
    "1 cup warm whole milk (110-115 degrees)",
    "1/3 cup butter (melted)",
    "1/4 cup sugar",
    "1 teaspoon salt",
    "2 large eggs",
    "6 tablespoons butter (cubed)",
    "1 cup brown sugar (packed)",
    "6 tablespoons whole milk",
    "2/3 cups chopped pecans (divided)",
    "1 cup granulated sugar",
    "1 teaspoon ground cinnamon",
    "1/2 cup butter (melted)"
  ],
  "keywords": [
    "active",
    "dry",
    "yeast",
    "water",
    "degrees",
    "allpurpose",
    "flour",
    "milk",
    "butter",
    "sugar",
    "salt",
    "eggs",
    "cubed",
    "brown",
    "pecans",
    "divided",
    "granulated",
    "cinnamon"
  ],
  "title": "CARAMEL-PECAN MONKEY BREAD",
  "users": [
    null
  ]
}