{
  "hash": "632998d98d946baca41524606232e7b85c88c0f3",
  "title": "FRESH TOMATO AND MOZZARELLA PANZEROTTI",
  "image": "http://www.saveur.com/sites/saveur.com/files/styles/large_1x_/public/images/2016/02/panzerotti_1600x1200.jpg?itok=5h4PD1eg",
  "href": "http://www.saveur.com/Fresh-Tomato-And-Mozzarella-Panzerotti-Recipe",
  "extension": "Chrome",
  "firstAdded": "2016-03-07T23:30:08.896000",
  "users": [
    null
  ],
  "keywords": [
    "dough",
    "allpurpose",
    "flour",
    "sugar",
    "kosher",
    "salt",
    "active",
    "dry",
    "yeast",
    "oil",
    "greasing",
    "frying",
    "filling",
    "olive",
    "garlic",
    "medium",
    "tomatoes",
    "cored",
    "roughly",
    "basil",
    "black",
    "pepper",
    "mozzarella"
  ],
  "directions": [
    "0",
    "Instructions",
    "Make the dough: In a large bowl, mix the flour with the sugar, salt, and yeast. Make a well in the center of the flour and pour in the oil and 1 cup water. Stir with a wooden spoon until the dough comes together, and then cover with a kitchen towel. Let the dough stand at room temperature for 2 hours.",
    "Divide the dough into 12 pieces and then shape each piece into a ball. Place the dough balls on a parchment paper-lined baking sheet and let stand for 1 hour.",
    "Meanwhile, make the tomato sauce: In a 10-inch skillet, heat the oil over medium. Add the garlic, and cook, stirring, until golden, about 2 minutes. Add the tomatoes, and cook, stirring, until broken down into a sauce, about 20 minutes. Remove the garlic from the sauce, and then season with salt and pepper and stir in the basil.",
    "On a lightly oiled work surface, roll each dough ball into a 5-inch disk. Place 1 heaping tablespoon of tomato sauce on one half of each disc, and then top with 2 tablespoons of the mozzarella. Fold the dough over the filling and press down with your thumb to seal it.",
    "Pour enough oil to come 1 inch up the side of a deep 10-inch skillet, and attach a deep-fry thermometer to the side of the pan; heat the oil to 350°. Working with one panzerotti at a time, add to the oil and fry, turning once, until golden brown on both sides, about 4 to 5 minutes. Using a slotted spoon, remove each panzerotti from the oil and transfer to paper towels to drain. Repeat with the remaining panzerotti and serve while hot."
  ],
  "ingredients": [
    "0",
    "For the Dough",
    "3 1⁄4 cups all-purpose flour",
    "2 tbsp. plus 1 tsp. sugar",
    "4 tsp. kosher salt",
    "2 1⁄4-oz. packets active dry yeast",
    "3 tbsp. vegetable oil, plus more for greasing and frying",
    "For the Filling",
    "3 tbsp. olive oil",
    "2 garlic cloves, peeled",
    "3 medium fresh tomatoes, cored and roughly chopped",
    "1 tbsp. minced basil",
    "Kosher salt and freshly ground black pepper",
    "1 lb. fresh mozzarella, finely chopped"
  ],
  "__v": 1
}