{
  "hash": "eadca384097df3a919ee0467df8f769aaf4112bb",
  "title": "Double Chocolate Cookies",
  "image": "https://static01.nyt.com/images/2016/12/05/dining/05COOKING-CHOCOLATECHIPCOOKIES1/05COOKING-CHOCOLATECHIPCOOKIES1-articleLarge.jpg",
  "href": "http://cooking.nytimes.com/recipes/1018459-double-chocolate-cookies?smid=fb-nytimes&smtyp=cur",
  "extension": "Chrome",
  "firstAdded": "2016-12-14T03:13:19.578000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "PREPARATION",
    "In a medium bowl, whisk together flour, cocoa powder, salt, baking powder and baking soda. Set aside.",
    "In a stand mixer fitted with the paddle attachment, beat together butter, brown sugar and granulated sugar until very light, about 5 minutes. Add egg and vanilla and beat until well combined.",
    "With the mixer on low, add the dry ingredients and beat just until combined. Add the chocolate discs and mix briefly to combine. Press plastic wrap against the dough and chill it for at least 24 hours and up to 36.",
    "Heat oven to 350 degrees. Line a baking sheet with parchment paper. Portion the dough out into balls slightly larger than golf balls, about 3 1/2 ounces each, and transfer five balls to the baking sheet. (They will spread significantly.) Bake the cookies until set, being careful to remove cookies from the oven when still soft in the center, about 18 minutes. Transfer the parchment with the cookies to a rack to cool. Repeat with the remaining dough, baking a second batch of four or five cookies. Serve warm."
  ],
  "ingredients": [
    "0",
    "1cup/145 grams all-purpose flour",
    "¾cup/75 grams Dutch-process cocoa powder",
    "¾teaspoon kosher salt",
    "½teaspoon baking powder",
    "½teaspoon baking soda",
    "10tablespoons/141 grams unsalted butter, at room temperature",
    "¾cup/150 grams dark brown sugar",
    "⅔cup/133 grams granulated sugar",
    "1large egg",
    "2teaspoons pure vanilla extract",
    "2cups/305 grams semisweet or bittersweet chocolate discs (or use 2 cups/340 grams chocolate chips)"
  ],
  "__v": 1
}