{
  "hash": "068ea32bcbde010461099509f439ed198cac765d",
  "title": "Spicy Sweet Potato and Vegetable Hash",
  "image": "http://target.scene7.com/is/image/Target/c_Spicy-Sweet-Potato-and-Vegetable-Hash_RT?hei=340",
  "href": "http://www.cooking.com/recipes-and-more/recipes/spicy-sweet-potato-vegetable-hash-recipe?CCAID=cknwfhne06295av&s=s0085567335s&mid=2108404&rid=85567335",
  "extension": "Chrome",
  "firstAdded": "2015-05-01T17:28:56.467000",
  "users": [
    null
  ],
  "keywords": [
    "leek",
    "white",
    "light",
    "green",
    "parts",
    "red",
    "pepper",
    "potatoes",
    "brussels",
    "sprouts",
    "trimmed",
    "stemmed",
    "kale",
    "eggs",
    "extra",
    "virgin",
    "olive",
    "oil",
    "kosher",
    "salt",
    "cracked",
    "black"
  ],
  "directions": [
    "0",
    "In a large, nonstick or cast iron skillet over medium-high heat, add 2 tablespoons olive oil. Into the warm oil, add leeks and cook for 30 to 45 seconds, or until they are fragrant and softened. Stir in red pepper flakes, then add the shredded potatoes, stir to incorporate leeks and press into a single layer. Cook undisturbed for 3 to 5 minutes, or until a browned crust begins to form. Stir and cook for 3 minutes more. Season with salt and pepper.",
    "Stir Brussels sprouts into the potato mixture and cook, stirring frequently for another 3 to 5 minutes, or until sprouts start to wilt. Next add the kale and cook until wilted. Season with salt and pepper.",
    "Meanwhile, in another large, greased skillet over medium-high heat, crack 5 eggs. Cook eggs until the whites are set (for over easy, flip eggs after the whites set slightly and then cook on other side for 30 seconds to a minute).",
    "Serve hash hot with a fried egg on top."
  ],
  "ingredients": [
    "0",
    "1 large leek, white and light green parts thinly sliced",
    "1 teaspoon red pepper flakes",
    "3 small sweet potatoes, or two large sweet potatoes, peeled and shredded",
    "1 pound Brussels sprouts, trimmed and shredded",
    "2 cups stemmed, chopped kale",
    "5 eggs",
    "Extra virgin olive oil",
    "Kosher salt",
    "Freshly cracked black pepper"
  ],
  "__v": 1
}