{
  "hash": "f463ba9d9d75813837bd95d1d54885019e2fd2e4",
  "title": "Vanilla Pudding with Baked Rhubarb",
  "image": "https://assets.marthastewart.com/styles/wmax-300/d28/baked-rhubarb-0605-mla101057/baked-rhubarb-0605-mla101057_vert.jpg?itok=VIZNay8P",
  "href": "https://www.marthastewart.com/345537/vanilla-pudding",
  "extension": "Chrome",
  "firstAdded": "2018-02-08T05:12:30.767000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Whisk together sugar, flour, and salt in a medium bowl; set aside. Pour milk into a medium saucepan; scrape in vanilla seeds, and add the pods. Stir together. Cook over medium heat until tiny bubbles begin to form around edges of pan, about 7 minutes.",
    "2.",
    "Gradually add the milk mixture to the flour mixture, whisking constantly. Transfer the milk-flour mixture to the saucepan; cook over low heat, whisking constantly, 5 minutes.",
    "3.",
    "Put egg yolks in a small bowl. Whisk in a small amount of the hot milk-flour mixture. Add yolk mixture to saucepan. Cook over medium heat, whisking constantly, until mixture comes to a boil and thickens, 10 to 12 minutes.",
    "4.",
    "Remove from heat; discard pods. Add butter; whisk until melted. Pass pudding through a fine sieve into a medium bowl, forcing it through holes with a rubber spatula. Cover surface of pudding with plastic wrap to prevent a skin from forming. Let stand at room temperature until slightly cooled, about 30 minutes. Spoon pudding into bowls; top with baked",
    "rhubarb."
  ],
  "ingredients": [
    "0",
    "1 cup sugar",
    "1/4 cup all-purpose flour",
    "Great Value All Purpose Flour, 32 ozIn Stores OnlySee Everyday Low Price",
    "1/2 teaspoon salt",
    "Great Value Iodized Salt, 26 ozIn Stores OnlySee Everyday Low Price",
    "2 cups milk (not skim)",
    "1 1/2 vanilla beans, halved lengthwise",
    "4 large egg yolks, lightly beaten",
    "4 tablespoons unsalted butter, cut into small pieces",
    "Baked Rhubarb"
  ],
  "__v": 1
}