{
  "hash": "8a213b469085be7e1a5f11ae2ad449a89dc91e13",
  "title": "Seeded Gluten Free Sourdough Bread",
  "image": "http://i1.wp.com/www.bakingmagique.com/wp-content/uploads/2015/02/seeded-gluten-free-sourdough-bread-12.jpg?resize=683%2C1024",
  "href": "http://www.bakingmagique.com/2015/02/seeded-gluten-free-sourdough-bread/",
  "extension": "",
  "firstAdded": "2015-11-12T01:46:28.986000",
  "users": [
    null
  ],
  "keywords": [
    "brown",
    "rice",
    "flour",
    "cold",
    "sourdough",
    "starter",
    "water",
    "wet",
    "room",
    "temp",
    "psyllium",
    "husk",
    "golden",
    "flax",
    "seeds",
    "dry",
    "oat",
    "buckwheat",
    "corn",
    "starch",
    "potato",
    "dark",
    "sesame",
    "sunflower",
    "chia",
    "granulated",
    "sugar",
    "salt"
  ],
  "directions": [
    "0",
    "In the evening: Mix brown rice flour, sourdough starter and water in a small bowl or jug and cover with cling film. Let sit over night(8-12 hours) in a warm and non-drafty place.",
    "In the morning: Mix water, psyllium husk and ground flaxseeds in a bowl and whisk until a thick gel forms.",
    "Add the sourdough starter that you made the night before to the gel and mix.",
    "In a separate bowl mix all of the dry ingredients(flours, seeds, sugar and salt).",
    "Make a well in the middle of the dry ingredients and add the wet to the dry.",
    "Using an electric hand mixer with dough hooks, work the dough until the flour is fully incorporated.",
    "Tip the dough out onto a floured work surface and shape it into a loaf.",
    "Place the loaf in a proofing basket lined with a tea towel(+ some buckwheat flour to avoid the dough from sticking to the towel)",
    "Fold the towel over the loaf and place the basket in a plastic bag.",
    "Allow to rise in a warm and non-drafty place(for example a switched off oven) for 4-6 hours.",
    "Preheat the oven to 400°F/200°C with a baking pan inside + a baking pan on the bottom of the oven.",
    "Flip the dough upside down on a parchment paper and transfer to the hot baking pan. Score the bread with a small knife.",
    "Bake the bread in the middle of the oven with a tin foil tent on top and put a couple of tablespoons of water on the pan in the bottom of the oven and quickly close the oven door. Bake with the tin foil tent on top for 40 min. Bake another 20 min without the foil.",
    "Let cool on a wire rack for at least 1 hour."
  ],
  "ingredients": [
    "0",
    "80 g brown rice flour",
    "140 g cold sourdough starter",
    "110 g water",
    "———WET———",
    "350 g water at room temp",
    "20 g psyllium husk",
    "10 g ground golden flax seeds",
    "———DRY———",
    "60 g of each",
    "- oat flour",
    "- buckwheat flour",
    "- corn starch",
    "- potato starch",
    "20 g dark flax seeds",
    "20 g sesame seeds",
    "20 g sunflower seeds",
    "10 g chia seeds",
    "24 g granulated sugar",
    "1 tsp salt"
  ],
  "__v": 1
}