{
  "hash": "be2fbbc52918aaab25fddfd6402db7ec275a605f",
  "title": "Oaxacan Yolk Bread",
  "image": "https://patijinich.com/wp-content/uploads/2017/09/609-pan-de-yema-912x622.jpg",
  "href": "https://patijinich.com/recipe/pan-de-yema/",
  "extension": "Chrome",
  "firstAdded": "2017-10-29T13:26:29.684000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a small bowl, combine the yeast granules with the 1 teaspoon of sugar and the lukewarm water (make sure it is not cold or hot, or the yeast will not react). Stir, let it sit in a warm area of your kitchen with no wind drafts, and after a few minutes, mix to dissolve. Let it sit again (in the same place) for a couple minutes more, until the mixture has reacted and looks frothy on top. Incorporate 1 cup of the flour and mix well. Cover with a clean kitchen towel and let it rise for an hour.",
    "In a mixer fitted with the paddle attachment, beat the butter with the 2/3 cup sugar on medium speed until soft and creamy. Reduce speed to low, add yeast mixture along with the egg yolks, 2 eggs, the rest of the flour, and a pinch of salt.",
    "After a few minutes, switch the paddle attachment for the hook attachment. Let the mixer knead the dough on low to medium speed for about 10 to 12 minutes, until the dough is very soft, smooth and shiny, and you can gather it into a ball.",
    "Butter a large bowl. Gather the dough into a ball and place it in the bowl. Cover with a clean kitchen towel and place in the warm area of your kitchen with no drafts. Let it rise for about an hour until it doubles in size.",
    "Pre-heat the oven to 350 degrees Fahrenheit and butter 3 baking sheets.",
    "Uncover the dough and punch it down. Divide it in half, and consecutively halve the pieces until you have 16 pieces of dough. Roll each one into a ball and set on the buttered baking sheets. Place in the warm area of your kitchen for 45 minutes to an hour for a final rise.",
    "In a small bowl, beat the remaining egg with a tablespoon of water. Make a 3 slashes on the top of each bun and brush with egg wash. Bake for 20 minutes, until cooked through and browned on top."
  ],
  "ingredients": [
    "0",
    "3envelopesactive dry yeast granules",
    "2/3cupsugarplus 1 teaspoon",
    "1 1/4cupslukewarm water",
    "6cupsall-purpose flourdivided, plus more for shaping dough",
    "1cupunsalted butterplus more for greasing a large bowl and baking sheets",
    "9egg yolks",
    "2large eggsplus 1 for egg wash",
    "Pinchkosher or coarse sea salt",
    "Pinch of kosher or coarse sea salt"
  ],
  "__v": 1
}