{
  "__v": 1,
  "directions": [
    "0",
    "In a medium to large saucepan heat oil and add leeks, shallots, and garlic and a few pinches of salt. Saute until translucent (3-4 minutes). Add a splash of white wine and scrape any bits that are starting to stick to the bottom of the pan. Let wine cook down for 30 seconds to a minute. Add frozen garabanzo beans and vegetable broth. Let simmer for 5 or so minutes until the garbanzos are thawed and tender. Add another few pinches of salt.",
    "Remove from heat and let cool to room temperature. (it’s important to add the herbs when cooled, you don’t want to cook them in this soup, they’ll be more vibrant here if they’re pureed in their raw form).",
    "In a blender, puree the cooled soup mixture. Add almond milk, lemon juice, grated nutmeg, parsley, basil, honey, and pulse until the herbs are well chopped, but some flecks of green are still visible. Taste and adjust seasonings to your preference (salt, pepper if it’s too bland, sugar if it’s too tangy, a splash of vinegar or more lemon if it’s too earthy, more olive oil if it’s not rich and silky enough).",
    "Chill soup in the fridge for 30 minutes or up to a day.",
    "Remove from fridge and stir in a bit of water if soup is too thick. Taste again and make adjustments. I added another squeeze of lemon and drizzled in some walnut oil.",
    "Serve with garnish of chopped herbs, a drizzle of walnut oil, and a dollop of yogurt sauce."
  ],
  "firstAdded": "2014-07-10T22:26:24.753000",
  "hash": "91f1ef42b310dfdd4821af78a8cc208b5a87b3ff",
  "href": "http://www.loveandlemons.com/2012/04/30/green-garabanzo-leek-soup/",
  "image": "http://d1wcgy4dy6voh7.cloudfront.net/wp-content/uploads/2012/04/0429_garbanzosoup2.jpg",
  "ingredients": [
    "0",
    "2 T olive oil",
    "2 small leeks, light green & white parts, coarsley chopped",
    "1 shallot, coarsley chopped",
    "2 garlic cloves, coarsley chopped",
    "splash of white wine (optional)",
    "bag of frozen green garbanzo beans (about 2 cups)",
    "1.5 cups vegetable broth",
    "pinches of salt and pepper",
    "1/2 cup almond milk",
    "1/8 tsp freshly grated nutmeg",
    "handful of parsley, some stems are ok",
    "5 or 6 large basil leaves",
    "splash of honey or agave (or sugar)",
    "juice of half a lemon (or more or less, to taste)",
    "splash of champagne or white wine vinegar (optional)",
    "1/2 cup water if needed",
    "walnut oil for drizzling"
  ],
  "keywords": [
    "olive",
    "oil",
    "leeks",
    "light",
    "green",
    "white",
    "parts",
    "coarsley",
    "shallot",
    "garlic",
    "splash",
    "wine",
    "frozen",
    "garbanzo",
    "beans",
    "broth",
    "pinches",
    "salt",
    "pepper",
    "almond",
    "milk",
    "nutmeg",
    "parsley",
    "stems",
    "basil",
    "leaves",
    "honey",
    "agave",
    "sugar",
    "juice",
    "lemon",
    "champagne",
    "vinegar",
    "water",
    "needed",
    "walnut",
    "drizzling"
  ],
  "title": "GREEN GARBANZO & LEEK SOUP",
  "users": [
    null
  ]
}