{
  "__v": 1,
  "directions": [
    "0",
    "Heat oven to 325.",
    "In your largest Dutch oven or stock pot, heat to a boil enough water to cover your Potatoes and Corn. Once it’s boiling, toss in your Potatoes, Corn, and Salt. Cover and let boil for around 15-20 minutes or until your Potatoes are tender. Then drain your vegetables and put them back in the pot. Make sure your pot isn’t in a hot spot on your stove top.",
    "While your Potatoes and Corn are boiling, make your Vegan Seafood. Put your Vegan Prawns and Shrimp Balls in a glass baking dish and put them in the oven uncovered. Let them cook for 5 minutes, then use a spatula to toss the Vegan Seafood to make sure they cook evenly. Do this every 5 minutes while they cook to make sure they don’t stick. It will take about 15 minutes for your Vegan Seafood to be completely warmed all the way through and have a firm but thin “skin” or crust on the outside. Once they’re done, take them out. Once your Vegetables are done boiling and have been drained, toss your Vegan Seafood into the pot with the cooked Potatoes and Corn and leave uncovered.",
    "While your Vegetables are boiling and your Vegan Seafood is baking, make your sauce. In a saucepan, heat your Margarine over a medium heat. Once it has melted, use a whisk to blend in the remaining ingredients until smooth. Once it begins to bubble, remove your sauce from heat.",
    "Once your Vegetables and Vegan Seafood are mixed in the pot, pour the Sauce over the top to get an even coating. Slice the Lemons into wedges and sprinkle Parsley over the top."
  ],
  "firstAdded": "2014-08-18T23:17:15.464000",
  "hash": "8b44f0f9ca86b8a5eb7ceeb18ef22f5911b37aab",
  "href": "http://www.meettheshannons.com/the-cruelty-free-crawfish-boil/",
  "image": "http://i2.wp.com/www.meettheshannons.com/wp-content/uploads/blogger/-X96sJlDQA0Q/TwrxwPdZ1BI/AAAAAAAACt4/KjCNWG5MVn4/s640/crawfish5.jpg?resize=426%2C640",
  "ingredients": [
    "0",
    "The Cruelty-Free Crawfish Boil",
    "1 1/2 Cups Vegan Prawns (defrosted)",
    "1 1/2 Cups May Wah’s Shrimp Balls (defrosted)",
    "1 Pound Whole Small Red Potatoes",
    "2-3 Whole Ears Fresh Corn (break each ear in half)",
    "2 Whole Lemons",
    "2 Tablespoons Fresh Parsley (diced)",
    "2 teaspoons Crushed Pink Himalayan Salt",
    "Sauce",
    "1/2 Cup Margarine",
    "3 Cloves Garlic (minced)",
    "3-4 Tablespoons Hot Sauce",
    "4 Tablespoons Beer (we used a brown ale but I think a red beer would be great too)",
    "4 Tablespoons Lemon Juice",
    "2 Tablespoons + 2 teaspoons Tony Chachere’s Original Creole Seasoning",
    "1/4 Red Onion (diced)",
    "1/2 teaspoons Cumin",
    "Pinch of Celery Seed",
    "Dash of Liquid Smoke"
  ],
  "keywords": [
    "crueltyfree",
    "crawfish",
    "boil",
    "vegan",
    "prawns",
    "defrosted",
    "wahs",
    "shrimp",
    "balls",
    "red",
    "potatoes",
    "ears",
    "corn",
    "break",
    "ear",
    "lemons",
    "parsley",
    "pink",
    "himalayan",
    "salt",
    "margarine",
    "garlic",
    "hot",
    "used",
    "brown",
    "ale",
    "think",
    "beer",
    "great",
    "lemon",
    "juice",
    "tony",
    "chacheres",
    "original",
    "creole",
    "seasoning",
    "onion",
    "cumin",
    "celery",
    "seed",
    "smoke"
  ],
  "title": "The Cruelty-Free Crawfish Boil",
  "users": [
    null
  ]
}