{
  "hash": "59437815a565457cb709f2936562d188d0420eb0",
  "title": "Chicken Fried Chicken",
  "image": "http://4.bp.blogspot.com/-SkWCdRHWd8A/TWHMnFi-SLI/AAAAAAAAOE4/2AlBD64fqDE/s400/Chicken+Fried+Chicken+Serving.jpg",
  "href": "http://www.deepsouthdish.com/2011/02/chicken-fried-chicken-recipe-with.html",
  "extension": "Chrome",
  "firstAdded": "2017-05-18T23:51:33.371000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Use a rubber mallet to gently pound the thicker part of the chicken breasts between two sheets of plastic wrap until breast is flattened and even. Cut in half to make 8 cutlets, and season both sides with Cajun seasoning. Place a rack over a baking sheet covered with paper towels; set aside.",
    "Whisk together the flour, salt and pepper; remove and set aside 1/4 cup of the seasoned flour mixture for the gravy. Beat the cup of milk with 2 large eggs for an egg wash. Dip the chicken into the seasoned flour, the egg wash and back in the flour, shaking to remove any excess flour. Let cutlets rest at room temperature for about 10 minutes.",
    "Heat the cooking oil and bacon fat in a cast iron or heavy bottomed skillet over a medium high heat. Cook the chicken in batches to avoid overcrowding the skillet, until browned on the bottom; turn and finish cooking until golden brown and cooked through. Place onto the rack of the prepared pan and tent very loosely with aluminum foil to hold.",
    "Remove all of the oil from the skillet except for 1/4 cup, and over medium heat, sprinkle in the 1/4 cup of reserved seasoned flour a little at a time. Cook, stirring constantly until a light blond color. Slowly whisk in 1-1/2 cups of milk until fully incorporated and until mixture begins to thicken. Bring to a boil, reduce heat and let cook for a few minutes, adding additional milk, if needed, to reach desired consistency. Taste, season with salt and plenty of pepper and adjust as needed.",
    "Place a piece of chicken on each plate and spoon a bit of the gravy across the center of the chicken. Serve immediately with homemade mashed potatoes and a green vegetable.",
    "Tip: To substitute for self rising flour, use 2 cups of all purpose flour with 1-1/2 teaspoons of baking powder; add salt and pepper and proceed as above. To speed up the process, remove 1/4 cup of the pan drippings and start the gravy in another skillet while the last batch of chicken is cooking. Brining also makes a difference with chicken, so if you have time, brine the chicken in advance. Place into a zipper bag filled with water and 2 tablespoons of kosher salt for about 2 hours. Drain well and proceed.",
    "Saltine Variation: Increase flour to 4 cups and season with salt and pepper; take out 1/4 cup of the seasoned flour and set that aside for the gravy. Divide the remaining seasoned flour into 2 bowls. Crush one sleeve of saltine crackers fine and mix with one bowl of the flour. Whisk together milk and egg. Dredge the chicken in the seasoned flour. Dip into the egg wash and dredge in the cracker crumb mixture. Set on a rack until ready to fry."
  ],
  "ingredients": [
    "0",
    "For the Chicken:",
    "4 boneless, skinless chicken breasts, halved and pounded flat (for 8 cutlets)",
    "1/2 teaspoon of Creole or Cajun seasoning (like Slap Ya Mama), or to taste",
    "2 cups of self rising flour",
    "1/2 teaspoon of kosher salt",
    "1/4 teaspoon of freshly cracked black pepper",
    "1 cup of milk",
    "2 large eggs",
    "One-half inch of cooking oil (canola, vegetable) for the skillet, plus 2 tablespoons of bacon drippings",
    "For the Gravy:",
    "1/4 cup of reserved pan drippings",
    "1/4 cup of reserved seasoned flour",
    "1-1/2 to 2 cups of milk",
    "1 teaspoon of kosher salt, or to taste",
    "1/2 teaspoon of freshly cracked black pepper, or to taste"
  ],
  "__v": 1
}