{
  "__v": 1,
  "directions": [
    "0",
    "Place the stock in a medium sized pot over high heat. Bring to a boil then reduce the heat so that it stays at a low simmer.",
    "Place the olive oil and butter in a large pot over medium heat. Add the onion and cook, stirring frequently, until it is soft and just starting to brown, about 5-7 minutes. Add the garlic and cook for 1 minute more.",
    "Add the arborio rice to the large pot with the onions and butter and cook for 1 minute, stirring frequently. Add the wine to the pot and stir until it has been mostly absorbed.",
    "Add a ladle full of the hot broth to the pot with the rice and stir well. Continue stirring occasionally until it has been mostly absorbed, about 1-2 minutes. Continue adding the broth, 1 ladle at a time waiting until most of the broth has been absorbed by the rice before you add more. Stir the rice a few times between each addition of broth. The risotto is cooked when the rice is soft but not mushy ... think al dente pasta.",
    "When the risotto is soft remove the pan from the heat and stir through the parmesan cheese. Season to taste generously with sea salt and fresh cracked pepper.",
    "Pour the risotto onto a rimmed baking sheet and spread it out evenly. Place it in your fridge to cool. Once it has cooled completely you can begin making the arancini.",
    "1",
    "Remove the cold risotto from the fridge. Gather a small bit in your hand, (you can make them as large or small as you like) and press a small piece of Boursin cheese into the middle. Roll the risotto into a ball. Note: this process is a little less sticky if you have damp hands.",
    "Once all the risotto has been rolled into balls, set up 3 medium sized bowls. Fill one with the flour, sea salt and pepper and mix it together. Fill another with the eggs whisked with a splash of water and fill the last bowl with panko.",
    "Place the vegetable oil in a small pot with high sides over medium high heat. Attach an oil thermometer to the side. When the temperature reaches 300 degrees reduce the heat to medium and let it continue to heat until it is 375 degrees.",
    "Dip each risotto ball first in the flour, next in the egg and finally in the panko. Keep one hand for the flour and panko and the other for the egg. I like to work with 3-4 balls at a time to speed things up. Place the panko coated balls on a rimmed baking sheet.",
    "Set up another rimmed baking sheet and place a cooling rack on top of it.",
    "When the oil has reached 375 degrees carefully drop 3 balls into the pot and give it a little stir. Cook the balls for 1 minute, or until they are light brown. Remove the balls from the oil and place them on the cooling rack. Repeat until all the balls are cooked.",
    "Serve immediately.",
    "2",
    "The arancini can be made up to 3 days in advance and kept in a covered container in your fridge or frozen for up to 1 month. Re-crisp the arancini in a 400 degree oven for about 15 minutes from the fridge or 20 minutes from the freezer."
  ],
  "firstAdded": "2014-10-04T06:18:59.644000",
  "hash": "c518fc715e2d67d06f96502982b5d92a1068e755",
  "href": "http://www.theendlessmeal.com/crispy-boursin-arancini/",
  "image": "http://www.theendlessmeal.com/wp-content/uploads/2014/03/arancini-600.jpg",
  "ingredients": [
    "0",
    "6 cups good-quality (preferably homemade) stock (*see note)",
    "2 tablespoons olive oil",
    "2 tablespoons butter",
    "1 medium onion, finely minced",
    "1 garlic clove, finely minced",
    "2 cups arborio rice",
    "1 ½ cups dry white wine",
    "1 cup freshly grated parmesan cheese",
    "1-2 teaspoons sea salt, or to taste",
    "Fresh cracked pepper, to taste",
    "1 -150 gram box of Boursin cheese",
    "1 cup flour",
    "¼ teaspoon sea salt",
    "¼ teaspoon fresh cracked pepper",
    "2 eggs",
    "1 ½ cups panko",
    "2 cups vegetable oil"
  ],
  "keywords": [
    "goodquality",
    "preferably",
    "stock",
    "olive",
    "oil",
    "butter",
    "medium",
    "onion",
    "garlic",
    "clove",
    "arborio",
    "rice",
    "dry",
    "white",
    "wine",
    "parmesan",
    "cheese",
    "salt",
    "cracked",
    "pepper",
    "gram",
    "box",
    "boursin",
    "flour",
    "eggs",
    "panko"
  ],
  "title": "Crispy Boursin Arancini",
  "users": [
    null
  ]
}