{
  "hash": "6cc8e5e1dbaf44e8258e3e30e04301373ed7c04c",
  "title": "Catherine Walthers' Kale Latkes",
  "image": "http://a.abcnews.com/images/Lifestyle/ht_kale_latkes_alison_shaw_mt_141216_4x3t_384.jpg",
  "href": "http://abcnews.go.com/GMA/recipe/kale-latkes-recipe-catherine-walthers-27636210?nwltr=GMAR_tryPic_pos1",
  "firstAdded": "2014-12-19T20:01:10.647000",
  "users": [
    null
  ],
  "keywords": [
    "latkes",
    "kale",
    "stripped",
    "stalk",
    "rinsed",
    "olive",
    "oil",
    "salt",
    "idaho",
    "potatoes",
    "onion",
    "allpurpose",
    "flour",
    "eggs",
    "peanut",
    "butter",
    "cooking",
    "dill",
    "sour",
    "cream",
    "yogurt",
    "prepared",
    "horseradish",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "Cooking Directions",
    "Place the kale in a large bowl and add the 2 teaspoons olive oil and two pinches of salt. Massage the kale for 2 to 3 minutes. If it seems moist, use a few paper towels to absorb any excess moisture.",
    "Either grate the potatoes with a box grater, or quarter them lengthwise and use the shredder attachment on a food processor. You should have about 6 cups. Place the grated potatoes in a bowl of water for 10 minutes or so. Line a second bowl with a clean kitchen towel or two layers of paper towels. Lift the potatoes out of the water a handful at a time, squeezing out the water with your hands over the soaking bowl as you go, and place in the clean towel or paper towels. Save the bowl with the soaking water and potato starch, and let the starch settle to the bottom (this might take a few minutes). Squeeze the towel to soak up any excess moisture from potatoes, getting them as dry as possible. Add the potatoes to the kale, along with the onion.",
    "Pour off the water in the soaking bowl, leaving the starch at the bottom of the bowl (there will be up to 4 tablespoons). Add the eggs and flour to the starch and mix with a fork. Add this mixture to the latkes. Season with salt. (Sometimes I cook a test latke to help find the right level of salt.)",
    "Heat one or two large skillets (nonstick work nicely) over medium-high heat and coat the bottom with about a tablespoon of olive oil or a combination of olive oil and a little butter. Pack a 1/4-cup measuring cup with the potato mixture. Unmold into the skillet and place another few scoops of the mixture in the pan, without crowding, gently flattening each with a spatula. Panfry until each latke is golden, then gently flip and cook the other side, 10 to 14 minutes in total. Repeat with the remaining latke mixture. Place the latkes on a paper towel???lined baking sheet in a 200 degree F oven to keep warm, until ready to serve.",
    "Serve with sour cream mixed with the chopped dill and horseradish, with salt and pepper to taste.",
    "Recipe Summary",
    "Main Ingredients: kale, idaho potatoes, onion, sour cream, dill, oil",
    "Course: Appetizer/Starter"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "For the latkes:",
    "3 cups kale (stripped from stalk, finely chopped, rinsed and dried)",
    "2 teaspoons olive oil",
    "Salt",
    "2 pounds Idaho potatoes, peeled",
    "1/2 cup finely minced onion (about 1/2 onion)",
    "1/4 cup all-purpose flour",
    "2 large eggs",
    "Olive oil, peanut oil or butter, for cooking",
    "For the dill sour cream:",
    "1/2 cup sour cream or yogurt",
    "1 tablespoon chopped fresh dill",
    "2 teaspoons prepared horseradish (optional)",
    "Salt and freshly ground black pepper"
  ],
  "__v": 1
}