{
  "hash": "52ecc2b94f6a4b27c41c5dabc397d0928b64e75f",
  "title": "Quinoa Pizza Crust",
  "image": "https://lifesciencepharmacy.files.wordpress.com/2013/01/dsc_0882.jpg?w=523&h=350",
  "href": "https://lifesciencepharmacy.wordpress.com/tag/quinoa-pizza/",
  "firstAdded": "2015-01-25T21:24:00.312000",
  "users": [
    null
  ],
  "keywords": [
    "crust",
    "quinoa",
    "soaked",
    "hours",
    "rinsed",
    "water",
    "olive",
    "oil",
    "salt",
    "clove",
    "garlic",
    "italian",
    "seasoning"
  ],
  "directions": [
    "0",
    "Instructions",
    "1. Soak the quinoa in filtered water for at least 8 hours. *This step is crucial as the recipe won’t work with dry quinoa. Rinse and drain the quinoa.",
    "2. Add all of the ingredients except the olive oil to a food processor or high-speed blender and combine until the dough resembles pancake batter. Adjust the water as needed.",
    "3. There are 2 methods for cooking the dough (so far, we have only tried in the oven). In the oven: Preheat oven to 450 degrees and coat either a cast iron skillet or an 8-inch round cake pan with olive oil. Allow the skillet or cake pan to heat up in the oven for about 10 minutes (this is good to do while you’re preparing the dough and chopping the veggies). Remove skillet/cake pan from the oven and immediately add the quinoa “dough,” using a spatula to even it out as needed. Place the dough in the oven to bake for 10-15 minutes, or until the bottom side is crispy. Flip the dough and bake another 10 minutes, or until brown and crispy.",
    "OR, on the stove: This is the method to use when pressed for time. Heat a skillet with olive oil over medium heat. Pour the dough into the skillet and use a spatula to even it as needed. Allow to cook for approximately 5-10 minutes or until the bottom is turning brown and crispy. Flip and cook for another 5 minutes, or until evenly cooked on both sides.",
    "4. Now comes the fun part! Add whatever toppings you want and feel free to be creative.",
    "5. Place the pizza in the oven under the broiler after adding the toppings just to heat everything, without really cooking the veggies (raw is always better).",
    "6. Serve and enjoy."
  ],
  "ingredients": [
    "0",
    "Crust Ingredients",
    "¾ cup Quinoa, soaked for at least 8 hours, rinsed and drained",
    "¼-½ cup Water",
    "2-3 tablespoons Olive Oil",
    "½ teaspoon Salt",
    "1 clove Garlic, sliced (optional)",
    "2 teaspoon Italian Seasoning"
  ],
  "__v": 1
}