{
  "hash": "13946cff2f6fbf27c0e2dc44912eb34f226480d4",
  "title": "Dark Chocolate Pecan Pie",
  "image": "https://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/dark-chocolate-pecan-pie-5.jpg",
  "href": "https://sallysbakingaddiction.com/2017/10/30/dark-chocolate-pecan-pie/",
  "extension": "Chrome",
  "firstAdded": "2018-09-15T22:13:32.117000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "The crust: Prepare my pie crust recipe through step 5.",
    "After the pie crust has chilled, adjust the oven rack to the lower third position and preheat the oven to 350°F (177°C).",
    "Roll out the chilled pie dough: On a floured work surface, roll out one of the discs of chilled dough (you can freeze the 2nd for later use, see note). Turn the dough about a quarter turn after every few rolls until you have a circle 12 inches in diameter. Carefully place the dough into a 9-inch pie dish.* Tuck it in with your fingers, making sure it is smooth. Flute or crimp the edges of the crust. No need to pre-bake the crust.",
    "The filling: Spread pecans evenly inside pie crust and sprinkle the chocolate chips evenly on top. Set aside. Whisk the eggs, corn syrup, brown sugar, melted butter, vanilla, salt, and cinnamon together in a large bowl. Once completely combined and thick, pour evenly over pecans and chocolate chips.",
    "Bake the pie for 40-50 minutes, or until the top is lightly browned. After the first 20 minutes of bake time, I place a pie crust shield on top of the pie to prevent the edges from browning too quickly. You can also tent a piece of aluminum foil over the whole pie if the top is browning too quickly. Remove finished pie from the oven and place on a wire rack to cool completely. The pie filling will set as it cools.",
    "Slice and serve pie warm or at room temperature. Top with whipped cream and chocolate shavings, if desired. Cover and store leftover pie at room temperature for 1-2 days or in the refrigerator for 4-5 days.",
    "Make ahead tip/Freezing: Pecan pie is a wonderful dessert to make ahead of time. You can get started by combining all the filling ingredients (except the pecans and chocolate chips) one day ahead of time. Keep it covered tightly in the refrigerator until ready to assemble the pie. You can also make the pie dough 1-5 days in advance since it needs to chill. If you want to bake the pie 1 full day in advance, bake it as directed, allow it to completely cool, then cover tightly and keep at room temperature until ready to serve the next day. Baked pie freezes well for up to 3 months. Thaw overnight in the refrigerator and allow to come to room temperature before serving.",
    "Recipe Notes:",
    "*You can freeze the 2nd pie dough for up to 3 months. Thaw overnight in the refrigerator before using.",
    "*I strongly recommend a glass pie dish so you can see when the crust on the sides is browning, which signals that the pie is finished.",
    "*Instead of dark chocolate chips, you can use semi-sweet chocolate chips. Or 6 ounces of chopped semi-sweet, dark, or bittersweet chocolate.",
    "*You can use light corn syrup instead. I have no subtitution suggestions yielding the same texture, moisture, and flavor. Corn syrup is a must in traditional pecan pie."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "Homemade Pie Crust (my recipe makes 2 crusts; you can halve the crust recipe or freeze the 2nd half)",
    "2 and 1/2 cups (250g) shelled pecans",
    "1 cup (180g) dark chocolate chips*",
    "3 large eggs, at room temperature",
    "1 cup (240ml) dark corn syrup*",
    "1/2 cup (100g) packed dark brown sugar (or light brown)",
    "1/4 cup (60g) unsalted butter, melted and slightly cooled",
    "1 and 1/2 teaspoons pure vanilla extract",
    "1/2 teaspoon sea salt",
    "1/2 teaspoon ground cinnamon",
    "sea salt for topping"
  ],
  "__v": 1
}