{
  "hash": "ad194be68626bf43e4a48d82af3835a7fa4a6266",
  "title": "Mouth-Watering Crispy Brussels Sprouts (plus 7 ways to flavour them!)",
  "image": "http://cdn.ohsheglows.com/wp-content/uploads/2015/11/bestbrusselssprouts_thumb.jpg",
  "href": "http://ohsheglows.com/2015/11/21/mouth-watering-crispy-brussels-sprouts-plus-7-ways-to-flavour-them/",
  "extension": "Chrome",
  "firstAdded": "2016-02-15T22:10:18.405000",
  "users": [
    null
  ],
  "keywords": [
    "brussels",
    "sprouts",
    "trimmed",
    "outer",
    "leaves",
    "prepped",
    "coconut",
    "olive",
    "oil",
    "dry",
    "harissa",
    "spice",
    "blend",
    "salt",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "Directions:",
    "Preheat the oven to 400F and line a large baking sheet with parchment paper.",
    "With a paring knife, trim off the ends of the sprouts, then slice in half lengthwise, and pick off any loose outer leaves. Place the prepped sprouts into a large bowl.",
    "Add the oil onto the sprouts in the bowl and stir or toss with hands until throughly coated. Add the Harissa and salt, and stir until combined.",
    "Spread the Brussels sprouts onto the prepared baking sheet in a uniform layer. Garnish with freshly ground black pepper.",
    "Roast the sprouts for 20 minutes, then flip with spatula, and continue roasting for another 5-15 minutes until browned to your liking. I tend to \"overcook\" these because I like them crispy and charred (I usually brown mine more than the photos show). Smaller sprouts will brown faster than larger ones.",
    "Drizzle with a teaspoon or so of melted coconut oil and quickly toss to coat. This infuses with flavour and moistens them a bit after roasting. Sometimes I also sprinkle on toasted sesame seeds if I have some on hand. Taste and add another tiny pinch of salt, if desired, and serve immediately - the hotter the better.",
    "Tips:",
    "*If using melted coconut oil, make sure that your Brussels sprouts are at room temperature before mixing in the oil. If the sprouts are chilled from the fridge, the oil will harden when mixing. Keep in mind that using virgin coconut oil will impart a very light coconut flavour. You can use flavourless refined coconut oil if you prefer.",
    "**I found the Harissa spice blend at Whole Foods in the US (it’s the Whole Foods Market brand). It contains: paprika, caraway, chilis pepper, cayenne pepper, coriander, cumin, garlic, peppermint, sea salt. I’ve also been told that it can be found at Bulk Barn and Sobey’s in some Canadian locations. You can also find it online here."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "2 pounds Brussels sprouts, trimmed, halved, outer leaves removed (6 cups prepped)",
    "2 tablespoons coconut oil, melted or olive oil*, plus more for serving",
    "1 teaspoon dry Harissa spice blend**",
    "3/4 teaspoon fine sea salt",
    "Freshly ground black pepper, to taste"
  ],
  "__v": 1
}