{
  "hash": "31b4fff2c2f8319e1ad1df57951cc0afcc36b8e9",
  "title": "garlic butter white wine pasta with fresh herbs",
  "image": "https://www.savorynothings.com/wp-content/uploads/2016/06/Garlic-Butter-White-Wine-Pasta-with-Fresh-Herbs-Recipe-image-3.jpg",
  "href": "https://www.savorynothings.com/garlic-butter-white-wine-pasta-with-fresh-herbs/",
  "extension": "",
  "firstAdded": "2017-07-13T22:55:39.887000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the breadcrumbs by roasting the bread in one tablespoon olive oil until completely toasted, about five to ten minutes. Chop the herbs and add to the breadcrumbs right before serving to prevent from getting soggy.",
    "Bring a large pot of water to the boil, salt generously and cook the pasta just al dente.",
    "In the meantime, heat 2 tablespoons olive oil in a large frying pan over medium-high heat. Add the shallots and cook for a minute. Add the minced garlic and chili flakes and cook for another two minutes. Deglaze with the white wine, add the bayleaf and simmer for three minutes. Pour in 1 1/2 cups chicken stock and cook for another five minutes. If the sauce seems too dry, add more stock. Take off the heat, stir in the cream and butter and season with salt and pepper to taste. Again, if the sauce seems too dry, add more cream tablespoon by tablespoon until you like the consistency.",
    "Toss the hot pasta with the sauce, divide between four plates and top with breadcrumbs, finely grated lemon zest, extra chili and parmesan cheese. Serve with watercress, if desired."
  ],
  "ingredients": [
    "0",
    "10 1/2 ounces dry spaghetti 300g, or other long pasta shapes",
    "1 cup crusty bread torn into small pieces, 100g",
    "3 tablespoons olive oil divided",
    "2 cups fresh herbs (I used a mix of parsley chervil and tarragon) loosely packed, 40g",
    "2 shallots chopped",
    "4-8 cloves garlic finely minced on a microplane",
    "1/2 teaspoon chili flakes",
    "1 cup white wine 230ml",
    "1 bayleaf",
    "1 1/2 - 2 cups chicken stock 350-470ml",
    "1/2 - 3/4 cup heavy cream 120-180ml",
    "2 tablespoons butter",
    "Salt & pepper to taste",
    "Finely grated lemon zest extra chili flakes, parmesan cheese and watercress, to serve"
  ],
  "__v": 1
}