{
  "hash": "479db97e727936028a041fb2462d07cac8836d9c",
  "title": "Marinated Kale and Chicken Bowls with Sun Dried Tomato Sauce",
  "image": "",
  "href": "http://pinchofyum.com/marinated-kale-and-chicken-bowls-with-sun-dried-tomato-sauce",
  "extension": "Chrome",
  "firstAdded": "2016-10-30T18:06:51.700000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "MARINATE: Whisk the marinade ingredients together. Cut the kale. Marinate the chicken and the kale (separate bags, please!) in the marinade sauce in the fridge. In terms of timing, your best bet is to let the kale go overnight, but the chicken doesn't need quite as long - the lemon juice starts to mess with the texture after a while, so if you can, try for 30 minutes to 2 hours of marinating with the chicken.",
    "COOK CHICKEN: Place a nonstick pan over medium high heat. Add the chicken and saute until golden brown on both sides and cooked through. Let stand a few minutes before cutting.",
    "QUINOA: Cook the quinoa according to package directions. When the quinoa is done, stir ½ cup of the sauce throughout to distribute.",
    "SUN DRIED TOMATO SAUCE: While the quinoa cooks, make the tomato sauce by pulsing everything together in a food processor (add almonds last to preserve a little bit of crunchiness).",
    "SERVING: To serve, fill bowls with quinoa, kale, chicken, avocado, and sun dried tomato sauce. Top with sesame seeds, red pepper flakes, olive oil, or anything else you want because it's a free country and food is delicious!"
  ],
  "ingredients": [
    "0",
    "⅓ cup olive oil",
    "a few good squeezes of lemon juice (totaling about 3 tablespoons)",
    "½ teaspoon salt",
    "1",
    "2 cups uncooked quinoa",
    "1 bunch kale",
    "1 avocado",
    "1 lb. boneless skinless chicken breasts",
    "sesame seeds or crushed red pepper flakes for topping",
    "2",
    "1 16 ounce jar sun dried tomatoes, drained",
    "1-2 cloves garlic",
    "½ teaspoon salt (more to taste - I prefer more like 1 teaspoon)",
    "juice of one lemon",
    "½ cup olive oil",
    "½ cup almonds"
  ],
  "__v": 1
}