{
  "hash": "f1a2d1e6be0bbe7cbf19309b64f8a5432b359c77",
  "title": "VEGAN LASAGNA RECIPE WITH ROASTED VEGGIES & GARLIC HERB RICOTTA",
  "image": "http://vegetariangastronomy.com/wp-content/uploads/2016/12/vegan-lasagna-recipe-roasted-veggie-7-750x1125.jpg",
  "href": "https://vegetariangastronomy.com/vegan-lasagna-recipe-roasted-veggies/",
  "extension": "Chrome",
  "firstAdded": "2017-07-25T19:27:10.851000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "To Prepare Roasted Veggies:",
    "Pre-heat the oven 450 degrees. Line a baking tray with parchment paper .",
    "Combine all the sliced veggies (mushrooms, bell peppers, onions) in a mixing bowl . Toss with 2-3 teasp olive oil and season with salt.",
    "Add the veggies onto the lined baking tray and spread out evenly.",
    "Bake in the oven for 15-25 minutes until the veggies are roasted and just slightly charred (be careful not to burn them). You may need to toss the veggies once in between to keep from burning. Once they are done, remove and set aside.",
    "To Prepare the Lasagna:",
    "While the veggies are roasting, heat a large pot of water to boiling. Add a little salt and olive oil to the water. Once boiling, reduce heat to maintain a gentle boil and add the lasagna sheets. Depending on the type of pasta you are using, follow the directions on the box and cook the sheets till very al dente (be sure not to over cook since you will continue to cook the pasta later when it's baking in the oven). Stir often to prevent from sticking.",
    "When ready, drain in a colander and rinse with cool water, gently separating any noodles that may be sticking together.",
    "Reduce the oven temperature to 375 degrees.",
    "Grab a 9x13\" glass baking dish. Spread a layer of marinara sauce at the bottom of the dish.",
    "Arrange one layer of lasagna noodles lengthwise (about 3 long noodles, edge may overlap, depending on your pan) over the sauce. Spread a layer of the Garlic Basil Vegan Ricotta over the lasagna noodles. Top with a generous layer of marinara sauce. followed by a layer of roasted veggies.",
    "Repeat the above step TWICE for two more layers of lasagna noodles lengthwise, followed by the vegan ricotta, a generous layer of marinara sauce, and some roasted veggies.",
    "Finish with another layer of noodles (using about 12 sheets total). Spread the remaining sauce over the top layer of noodles.",
    "Seal the baking dish with foil and bake in the oven at 375 degrees for about 15-20 minutes until heated through.",
    "While the lasagna is baking, prepare the breadcrumbs by combining all the ingredients for Italian Breadcrumbs above into a mixing bowl. Add a tiny amount of olive oil and mix once more. Set aside.",
    "Remove the foil, top the lasagna with a generous layer of the prepared Italian seasoned breadcrumbs (note that you do not need to use all of the amount prepared).",
    "Bake once again, UN-COVERED, for another 15 minutes or until the breadcrumbs are golden brown in color.",
    "Remove the lasagna from the oven, top with finely chopped fresh basil and a drizzle of balsamic vinegar (use a spoon for this to avoid large amounts).",
    "(optional) Top with freshly ground black pepper and red crushed pepper for some added spice.",
    "Serve the lasagna with a side salad or some home-made garlic bread! Store any extra covered in the fridge and simply reheat in the microwave when needed.",
    "Cuisine: Italian",
    "|",
    "Recipe Type: Vegan, Gluten-free"
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "12 Tinkyada Brown Rice Lasagna Sheets",
    "Garlic Basil Vegan Ricotta",
    "26 oz. Marinara Sauce (or more)",
    "balsamic vinegar",
    "fresh basil, finely chopped (for garnish)",
    "olive oil",
    "freshly ground black pepper",
    "salt",
    "For the Roasted Veggies:",
    "20 cremini mushrooms, sliced",
    "2 green bell peppers, thinly sliced and halved",
    "2 red bell pepper, thinly sliced and halved",
    "1 medium-large onion, thinly sliced and quartered",
    "For the Italian Breadcrumbs:",
    "1 1/4 cups Plain Breadcrumbs (opt gluten-free breadcrumbs)",
    "2/3 teasp salt",
    "1/4 teasp onion powder",
    "1/3 teasp garlic powder",
    "1/3 teasp dry Italian seasoning (or just dried oregano )"
  ],
  "__v": 1
}