{
  "hash": "d62de46bce0505fd01439b07d3bbee5946487286",
  "title": "My Ginger Cookies",
  "image": "//images.food52.com/BQivH7Yv0CGwcUaVCkBoc5sdQDs=/753x502/92615718-d956-44f5-99ae-fb261a204340--2015-0915_ginger-molasses-cookies_bobbi-lin_10395.jpg",
  "href": "https://food52.com/recipes/38513-my-ginger-cookies",
  "extension": "Firefox",
  "firstAdded": "2015-10-11T13:51:16.869000",
  "users": [
    null
  ],
  "keywords": [
    "unbleached",
    "allpurpose",
    "flour",
    "baking",
    "soda",
    "ginger",
    "cinnamon",
    "allspice",
    "salt",
    "unsalted",
    "butter",
    "unsulphured",
    "mild",
    "fullflavored",
    "molasses",
    "blackstrap",
    "sugar",
    "firmly",
    "brown",
    "light",
    "muscovado",
    "root",
    "egg",
    "chips",
    "crystallized",
    "dice",
    "shaken",
    "coarse",
    "strainer",
    "loose",
    "demerara",
    "turbinado",
    "granulated",
    "rolling"
  ],
  "directions": [
    "0",
    "If you are baking the cookies right away, position the racks in the upper and lower thirds of the oven and preheat the oven to 350° F.",
    "In a medium bowl, combine the flour, baking soda, ginger, cinnamon, allspice, and salt and mix thoroughly with a whisk. Set aside.",
    "Combine the warm butter, molasses, both sugars, fresh ginger, and the egg in a large bowl and mix thoroughly. Add the flour mixture and ginger chips and stir until incorporated. The dough will be soft. If possible, cover and refrigerate the dough for at least 2 hours, or (better still) overnight, for the best flavor and texture.",
    "Form the dough into 1-inch balls (15 grams of dough for each). Roll balls in the Demerara sugar and place them 2 inches apart on baking sheets lined with parchment paper. Bake, rotating the sheets from back to front and top to bottom about halfway through the baking, for 10 to 12 minutes, or until they puff up and crack on the surface and then begin to deflate in the oven. For chewier cookies, remove them from the oven when at least half or more of the cookies have begun to deflate; for crunchier edges with chewy centers, bake a minute or so longer.",
    "Set the pans or just the parchment liners on cooling racks. Cool the cookies completely before storing. Cookies keep for several days in an airtight container."
  ],
  "ingredients": [
    "0",
    "2 1/4 cups (285 grams) unbleached all-purpose flour",
    "2 teaspoons baking soda",
    "2 teaspoons ground ginger",
    "1 1/2 teaspoons ground cinnamon",
    "1/2 teaspoon ground allspice",
    "1/4 teaspoon salt",
    "8 tablespoons (113 grams) unsalted butter, melted and just warm",
    "1/4 cup (85 grams) unsulphured mild or full-flavored molasses (not blackstrap)",
    "1/2 cup (100 grams) sugar",
    "1/3 cup (66 grams) firmly packed brown sugar or light muscovado sugar",
    "2 tablespoons finely minced or grated fresh ginger root",
    "1 large egg",
    "3/4 cup (113 grams) ginger chips or crystallized ginger, cut into 1⁄4-inch dice, shaken in a coarse strainer to remove loose sugar",
    "About 1/2 cup (100 grams) Demerara or turbinado or granulated sugar for rolling"
  ],
  "__v": 1
}