{
  "hash": "75d0d140f7cfab1c698248eefbe73c40db4381f0",
  "title": "How to Make Mongolian BBQ at Home",
  "image": "http://recipe-folder.com/img/recipe-images/067/814/3308927767.jpg",
  "href": "http://recipe-folder.com/recipe/5e882fdffeeafa5b9d38e1ac",
  "extension": "User Added",
  "firstAdded": "2020-04-04T06:57:35.201000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "https://steamykitchen.com/43914-make-mongolian-bbq-home.html",
    "1",
    "Step 1: Meat or Seafood",
    "2",
    "The first step in any stir fry starts with the meat or seafood. Proteins are cooked first, until seared and just about halfway cooking through.",
    "3",
    "Add cooking oil to the wok and let it heat up until very hot, but not smoking. Oil shimmers when it’s the perfect temperature.",
    "4",
    "This allows you to get really nice browning on the protein without any other ingredient interfering or vegetables causing too much moisture (which would make the protein boil or steam instead of sear). See how there is plenty of room in the wok to allow each shrimp to cook in the oil?",
    "5",
    "Cook the meat or seafood on one side, then flip to brown the other side.",
    "6",
    "Remove the protein once it’s halfway cooked through. Set aside for now.",
    "7",
    "Step 2: Aromatics",
    "8",
    "There should be oil left in the wok. If not, add in a little more oil and let it heat up until it shimmers again. Add in your desired aromatics. For my dish, I’m adding onion and sliced garlic.",
    "9",
    "Once it’s fragrant (aromatic!) it’s time for vegetables.",
    "10",
    "Step 3: Vegetables",
    "11",
    "Add vegetables in the order of those taking longest to cook to shortest time.",
    "12",
    "Longer to cook: Stems from Chinese leafy greens, bell peppers, carrots",
    "13",
    "Shorter time to cook: Soft leafy vegetables, mushrooms, snow peas",
    "14",
    "Step 4: Noodles",
    "15",
    "Once the vegetables are nearly cooked through, add in the noodles and about 1 tablespoon of water.",
    "16",
    "The water will help create a bit of steam, which helps the noodles warm up and finish cooking.",
    "17",
    "Step 5: Cooking Sauce",
    "18",
    "Use whatever cooking sauce you like! We’re using San-J Mongolian BBQ Cooking Sauce. Add about 2 tablespoons.",
    "19",
    "Step 6: Add meat/seafood back in",
    "20",
    "Now it’s time to add back in the meats or seafood that you’ve seared and cooked about halfway through. It will finish cooking in this step!",
    "21",
    "I like to add in bean sprouts now. I like bean sprouts crunchy, so I don’t cook them long.",
    "22",
    "How about some roasted sesame seeds?"
  ],
  "ingredients": [
    "0",
    "VEGETABLES",
    "1",
    "Cabbage: shaved or shredded. I use my large chef’s knife to cut long shreds as thin as possible.",
    "2",
    "Carrots: buy pre-cut in julienne strips or use a julienne peeler.",
    "3",
    "Bean Sprouts: Just leave whole, you can pinch the tail (root) off if desired.",
    "4",
    "Bell Peppers: Sliced thinly.",
    "5",
    "Zucchini: Most vegetables in a noodle dish are cut into julienne strips. Generally, for a Chinese stir-fry, the chef tries to cut all ingredients to a similar size and shape. But zucchini is one of those vegetables that do better as a large dice or half-moons. That’s because this vegetable soggy and mushy when over-cooked. These are cut into 1/2″ dice.",
    "6",
    "Snow Peas or Sugar Snap Peas: Pinch the stem end and peel off the stringy part. It unzips easily. You can leave snow peas whole, but I prefer to cut peas into long strips diagonally.",
    "7",
    "Tofu: Buy extra-firm, but can be hard to stir fry since it will break apart if not careful. Drain all the water, Place on large plate with several layers of paper towels. On top of tofu block, place another large plate, and then something heavy on top. Let it sit for 20 minutes. This will press out a lot of water from the tofu – making the tofu more firm and easier to stir-fry with.",
    "8",
    "Corn: Fresh, canned or frozen. Honestly, I prefer frozen!",
    "9",
    "Peas: Fresh or frozen.",
    "10",
    "Tomatoes: Large dice, but try to drain liquid and seeds from the tomatoes (save the liquid for your morning smoothie)",
    "11",
    "Bamboo Shoots: Canned, cut into julienne or strips",
    "12",
    "Baby Corn: Canned, cut into smaller pieces",
    "13",
    "Green Beans: Parboil or steam first. Easiest way – boil a cup of water in a small saucepan, add in the beans, cover and let cook for 2 minutes until just about cooked through.",
    "14",
    "Broccoli – Parboil or steam partway. Or, you can cut the florets into the finest pieces.",
    "15",
    "Spinach – Fresh spinach leaves",
    "16",
    "Pineapple",
    "17",
    "MEATS",
    "18",
    "Meats: If you go to an Asian market, you’ll likely find already-sliced meats, packaged specifically for Hot Pot, Teppanyaki, Korean BBQ & Mongolian BBQ. These meats are sliced frozen by the butcher on a electric meat slicer. They are so thin, almost shaven, that they’ll cook in seconds.",
    "19",
    "Seafood: Shrimp and bay scallop (the smaller scallop) are great in Mongolian BBQ. It’s a little harder to stir-fry fish, unless it’s firm fish. For all seafood, drain and pat very dry.",
    "20",
    "BASE OF FLAVOR: Aromatics",
    "21",
    "Onion: Slice onions very thinly.",
    "22",
    "Garlic: I like to slice the garlic thinly as well, especially if you are new to stir-frying. Minced garlic using a garlic crusher makes the garlic too easy to burn. Burnt garlic tastes bitter, so you really have to cook fast and know exactly when to add the garlic. Sliced garlic gives you more leeway.",
    "23",
    "Garlic: I like to slice the garlic thinly as well, especially if you are new to stir-frying. Minced garlic using a garlic crusher makes the garlic too easy to burn. Burnt garlic tastes bitter, so you really have to cook fast and know exactly when to add the garlic. Sliced garlic gives you more leeway.",
    "24",
    "NOODLES",
    "25",
    "Rice noodles, Korean sweet potato noodles, egg noodles, zucchini noodles, thick Japanese udon noodles, ramen noodles….the list goes on and on.",
    "26",
    "Boil the noodles according to package instructions, but shave off about 45 seconds from the stated cooking time (the noodles will continue to cook in the wok during the stir-fry, and you don’t want over-cooked, mushy noodles!) After cooking, immediately drain and rinse with cool water to immediately stop the cooking. I like to mix in just a drizzle of Asian sesame oil or regular cooking oil to keep the noodles from sticking and clumping to each other.",
    "27",
    "Today, we’re using fresh Chinese noodles: These are found in the Asian market, in the refrigerated section. The noodles are already partly cooked. All that I need to do is add very hot water to heat up the noodles for about 30 seconds. Then drain immediately and mix in a very small drizzle of sesame oil to prevent sticking.",
    "28",
    "COOKING SAUCES",
    "29",
    "Sesame oil",
    "30",
    "Mongolian BBQ (San-J)"
  ],
  "__v": 1,
  "hidden": true
}