{
  "hash": "7ff8b7323bb8c0dd1a07f01b6f18ccb17f179224",
  "title": "Grilled Corn, Tomato, Feta, and Herb Salad",
  "image": "http://www.seriouseats.com/recipes/assets_c/2014/09/20140902-grilled-corn-tomato-salad-recipe-3-thumb-625xauto-410161.jpg",
  "href": "http://www.seriouseats.com/recipes/2014/09/grillled-corn-tomato-feta-herb-salad-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-06-10T19:07:34.812000",
  "users": [
    null
  ],
  "keywords": [
    "best",
    "quality",
    "extravirgin",
    "olive",
    "oil",
    "juice",
    "lemon",
    "ears",
    "corn",
    "husks",
    "tomatoes",
    "bitesize",
    "chunks",
    "roughly",
    "flatleaf",
    "parsley",
    "leaves",
    "basil",
    "mint",
    "feta",
    "cheese",
    "kosher",
    "salt",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "1 Combine olive oil and lemon juice in a small bowl and whisk to combine. Set aside.",
    "2 Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. Clean and oil the grilling grate. To char corn without a grill, see note above.",
    "3 Place corn directly over hot side of grill and cook, turning occasionally, until charred on all sides and fully tender, about 10 minutes total. Remove corn from grill and allow to rest until cool enough to handle, about 5 minutes.",
    "4 Working one ear at a time, hold the corn vertically inside a large bowl and use a sharp knife to remove the kernels. Discard the cob. Add tomatoes, parsley, basil, mint, and feta cheese to the bowl. Whisk the dressing and add it to the bowl. Season with salt and pepper and gently fold with clean hands until all the ingredients are incorporated and coated in the dressing. Serve immediately."
  ],
  "ingredients": [
    "0",
    "3 tablespoons best quality extra-virgin olive oil",
    "1 tablespoon juice from 1 lemon",
    "4 ears sweet corn, husks removed",
    "2 pounds ripe tomatoes (see note above), cut into bite-size chunks",
    "1/4 cup roughly chopped fresh flat-leaf parsley leaves",
    "1/4 cup roughly chopped fresh basil leaves",
    "1/4 cup roughly chopped fresh mint leaves",
    "8 ounces feta cheese, cut into 1/2-inch chunks",
    "Kosher salt and freshly ground black pepper"
  ],
  "__v": 1
}