{
  "hash": "84e34f6436a2d0eff58e39a2f1d564dae940576d",
  "title": "Roasted Asparagus and Arugula Pizza",
  "image": "http://ohmyveggies.com/wp-content/uploads/2016/04/Roasted_asparagus_arugula_pizza.jpg",
  "href": "http://ohmyveggies.com/roasted-asparagus-and-arugula-pizza/?",
  "extension": "Chrome",
  "firstAdded": "2016-05-01T18:08:53.432000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 400ºF.",
    "Add the asparagus and red onion to a rimmed baking sheet. Drizzle with the olive oil, then sprinkle with the garlic, salt and red pepper flakes. Toss to combine and spread in an even layer. Bake for about 10 to 12 minutes, stirring once halfway through, until crisp tender. Set aside to cool slightly.",
    "Increase the oven temperature to 500ºF. If you have a pizza stone, carefully place it in the oven to heat.",
    "Meanwhile, roll out and shape the pizza dough on a well-floured surface. Transfer the shaped dough to a piece of parchment paper that has been lightly dusted with cornmeal. Lightly brush the dough with the olive oil. Top with the mozzarella, the goat cheese and the roasted veggies.",
    "Transfer to the oven (put the parchment paper with the pizza directly on the hot pizza stone; if you don’t have a pizza stone, set the parchment on a large baking sheet instead). Bake for about 10 to 13 minutes, or until the crust is golden brown. Remove from the oven, then sprinkle with the lemon zest and top with the arugula. Let cool for about 5 minutes before slicing."
  ],
  "ingredients": [
    "0",
    "1/2 pound asparagus, ends trimmed and cut into 2 inch chunks",
    "1/2 small red onion, sliced",
    "1 tablespoon olive oil",
    "1 large clove garlic, minced",
    "1/4 teaspoon salt",
    "Pinch of red pepper flakes",
    "1 pound refrigerated pizza dough",
    "About 1 tablespoon olive oil",
    "1 1/2 cups shredded mozzarella cheese",
    "2 ounces goat cheese, crumbled",
    "Zest of 1 medium lemon",
    "1 cup lightly packed baby arugula"
  ],
  "__v": 1
}