{
  "__v": 2,
  "directions": [
    "0",
    "Preheat the oven to 150°C. Lightly butter a 20x20cm (8x8”) square cake tray.",
    "Place the dark chocolate in a metal or heatproof bowl set over a pan of simmering water. Remove when the chocolate has melted. Set aside to cool.",
    "When the chocolate has cooled but is still liquid, beat in the butter and sugar until light.",
    "Add the eggs, one at a time, mixing well after each addition. Split the vanilla pod and scrape the seeds into the mixture or add the vanilla extract. Mix well and add the salt.",
    "Pour in the cooled, melted chocolate and mix well to a glossy and smooth consistency.",
    "Mix the two types of flours and chopped nuts.",
    "old the flour mixture into the chocolate mixture with a rubber spatula until well incorporated, but do not overmix.",
    "Pour the brownie batter into the prepared cake tray to a 2cm height. Bake in the preheated oven for 50 minutes, or until a skewer inserted into the brownie comes out with some moist crumbs attached. Allow to cool completely in the pan. At this stage, you can glaze the brownie, or simply turn out, dust with cocoa powder and cut into squares.",
    "To glaze, melt the dark chocolate over simmering water. Remove and cool slightly before pouring over the cooled brownie. Dust the top with cocoa powder and cut into squares or fingers."
  ],
  "firstAdded": "2014-10-16T10:02:42.230000",
  "hash": "6e7c74819a385ca89e4a2d8fe3d01d30725551ff",
  "href": "http://www.thestar.com.my/Lifestyle/Food/Recipes/2005/11/23/Walnut-Brownies/",
  "image": "http://www.thestar.com.my/~/media/Images/TSOL/Photos-Gallery/Kuali/2005/11/brownie.ashx?",
  "ingredients": [
    "0",
    "210g dark chocolate",
    "320g unsalted butter, at room temperature",
    "210g light brown caster sugar",
    "5 large eggs, at room temperature",
    "1 vanilla pod or 2 teaspoons pure vanilla extract",
    "1 pinch salt",
    "150g plain flour, sifted",
    "50g potato flour, sifted",
    "160g walnuts or pecan nuts, chopped roughly",
    "--------------",
    "Glazing:",
    "--------------",
    "200g dark chocolate, chopped",
    "3 tablespoons cocoa powder, for dusting"
  ],
  "keywords": [
    "dark",
    "chocolate",
    "unsalted",
    "butter",
    "room",
    "light",
    "brown",
    "caster",
    "sugar",
    "eggs",
    "pod",
    "vanilla",
    "salt",
    "plain",
    "flour",
    "sifted",
    "potato",
    "walnuts",
    "pecan",
    "nuts",
    "roughly",
    "glazing",
    "cocoa",
    "dusting"
  ],
  "title": "Walnut Brownies",
  "users": [
    null
  ]
}