{
  "hash": "d56e24d7108710700201ef813be187366be336ef",
  "title": "Gazpacho",
  "image": "",
  "href": "https://www.foodnetwork.com/recipes/alton-brown/gazpacho-recipe-1937573",
  "extension": "Chrome",
  "firstAdded": "2018-09-22T13:41:48.043000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Fill a 6-quart pot halfway full of water, set over high heat and bring to a boil.",
    "Make an X with a paring knife on the bottom of the tomatoes. Drop the tomatoes into the boiling water for 15 seconds, remove and transfer to an ice bath and allow to cool until able to handle, approximately 1 minute. Remove and pat dry. Peel, core and seed the tomatoes. When seeding the tomatoes, place the seeds and pulp into a fine mesh strainer set over a bowl in order to catch the juice. Press as much of the juice through as possible and then add enough bottled tomato juice to bring the total to 1 cup.",
    "Place the tomatoes and juice into a large mixing bowl. Add the cucumber, bell pepper, red onion, jalapeno, garlic clove, olive oil, lime juice, balsamic vinegar, Worcestershire, cumin, salt and pepper and stir to combine. Transfer 1 1/2 cups of the mixture to a blender and puree for 15 to 20 seconds on high speed. Return the pureed mixture to the bowl and stir to combine. Cover and chill for 2 hours and up to overnight. Serve with chiffonade of basil."
  ],
  "ingredients": [
    "0",
    "1 1/2 pounds vine-ripened tomatoes, peeled, seeded and chopped",
    "Tomato juice",
    "1 cup cucumber, peeled, seeded and chopped",
    "1/2 cup chopped red bell pepper",
    "1/2 cup chopped red onion",
    "1 small jalapeno, seeded and minced",
    "1 medium garlic clove, minced",
    "1/4 cup extra-virgin olive oil",
    "1 lime, juiced",
    "2 teaspoons balsamic vinegar",
    "2 teaspoons Worcestershire sauce",
    "1/2 teaspoon toasted, ground cumin",
    "1 teaspoon kosher salt",
    "1/4 teaspoon freshly ground black pepper",
    "2 tablespoons fresh basil leaves, chiffonade"
  ],
  "__v": 1
}