{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 315 degrees. Place 10 parchment muffin liners in a 12-cup muffin tin; set aside.",
    "In a large bowl, whisk together the eggs, yogurt, maple syrup and vanilla until well blended. Using a spoon, stir in the almond flour, baking soda and salt until well incorporated. Set batter aside. In a small bowl, add the streusel ingredients (except the nuts) and whisk together until well combined.",
    "Add a spoonful of the muffin batter to each of the lined muffin cups making sure to fill no more than 1/3 of the muffin liner. Using both hands, lift the muffin tin evenly tap the bottom on the counter to evenly distribute the batter in the bottom of the muffin cups.",
    "Then using a small spoon, place a dollop of the streusel in the center of each muffin. Next, place another spoonful of batter on top of the streusel layer, making sure to evenly distribute the remaining batter among all the muffin cups. If using nuts, top each muffin with nuts. Then, using a fork, evenly drizzle the remaining streusel over the top of each muffin. (You will end up with a little leftover streusel, see idea below on how to use it.)",
    "Bake for approximately 25 minutes, until a toothpick placed in the center comes out clean. Allow to cool in the pan for 5-10 minutes, then serve. Mmm! (Original recipe can be found at Comfy Belly.)"
  ],
  "hash": "9d76b7dd808a87585da79352b7601c0deaec40b6",
  "href": "http://thenourishinghome.com/2012/03/cinnamon-streusel-muffins-gf/#52f51cb5bf94c9b106000072",
  "image": "http://thenourishinghome.com/wp-content/uploads/2012/03/Cinnamuffins.jpg",
  "ingredients": [
    "0",
    "2 large eggs",
    "1/3 cup plain whole milk yogurt",
    "1/4 cup pure maple syrup",
    "1 tsp pure vanilla extract",
    "2 1/2 cups blanched almond flour",
    "1/4 tsp sea salt",
    "1/2 tsp baking soda",
    "3 tbsp pure honey (I prefer sage honey due to its mild flavor)",
    "2 tbsp butter, melted",
    "1 tbsp, plus 1 tsp ground cinnamon",
    "1/4 tsp pure vanilla extract",
    "Crispy walnut pieces (optional)"
  ],
  "keywords": [
    "eggs",
    "plain",
    "milk",
    "yogurt",
    "maple",
    "syrup",
    "vanilla",
    "almond",
    "flour",
    "salt",
    "baking",
    "soda",
    "prefer",
    "sage",
    "honey",
    "mild",
    "flavor",
    "butter",
    "cinnamon",
    "crispy",
    "walnut",
    "pieces"
  ],
  "title": "Cinnamon Streusel Muffins (GF)",
  "users": [
    null
  ]
}