{
  "hash": "ce22361979696da2f2b1a7ea66211260d75cc03c",
  "title": "Chinese-Style Fried Chicken",
  "image": "http://images2.yummy.ph/March_2014/Chinese-style-Fried-Chicken.jpg",
  "href": "http://www.yummy.ph/recipe/chinese-style-fried-chicken",
  "extension": "Chrome",
  "firstAdded": "2016-07-02T02:52:28.339000",
  "users": [
    null,
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "COOKING PROCEDURE",
    "Stuff chicken with lemongrass and green onions; set aside.",
    "Mix together soy sauce, brown sugar, cooking wine, garlic, five-spice powder, salt, and pepper in a bowl. Mix until sugar dissolves.",
    "Place chicken and soy sauce mixture in a large zip-top bag. Seal and marinate in the refrigerator overnight.",
    "Meanwhile, make the gravy: combine chicken stock, sugar, soy sauce, five-spice powder, and star anise in a saucepan. Bring to a boil, then reduce to a simmer. Season to taste with salt and pepper. Add dissolved cornstarch and cook until the sauce thickens. Turn off heat and remove star anise pieces. Set aside and keep warm.",
    "To cook chicken, preheat a steamer. Drain chicken, reserving the marinade. Steam chicken for 15 minutes. Remove from the steamer and brush reserved marinade all over the chicken. Refrigerate for 15 minutes.",
    "Preheat oil in a deep, heavy-bottomed pan until it registers 350°F on a deep-fry thermometer. Cut chicken into quarters or into 8 pieces. Deep-fry in batches just until skin is golden and crisp. Drain on paper towels to remove excess oil.",
    "Serve immediately with gravy on the side."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1 (1.2kilos) whole chicken, cleaned",
    "2 bundles lemongrass (tanglad), pounded",
    "1 bundle green onions",
    "1/2 cup soy sauce",
    "1/3 cup brown sugar",
    "1/4 cup chinese cooking wine",
    "1 table spoon garlic, minced",
    "1 1/2 teaspoons five-spice powder",
    "1 teaspoon salt",
    "1/2 teaspoon ground white pepper",
    "cooking oil for deep-frying, (such as vegetable, corn, canola, or peanut oil)",
    "1 cup chicken stock, or 1/4 chicken bouillon cube dissolved in 1 cup hot water",
    "1 1/2 tablespoons sugar",
    "1 table spoon soy sauce",
    "3/4 teaspoon five-spice powder",
    "2 pieces star anise",
    "salt, to taste",
    "pepper, to taste",
    "1 1/2 tablespoons cornstarch, dissolved in 2 tablespoons water"
  ],
  "__v": 2
}