{
  "hash": "b6c76592477b70fb68c50711d0a8d74168f5c22f",
  "title": "Chicken Rollatini with Spinach alla Parmigiana\nGina’s Weight Watcher Recipes Servings: 8 • Serving Size: 1 piece • Points+: 5 pts • Smart Points 5\nCalories: 194.7 • Fat: 7 g • Protein: 24.2 g • Carb: 7.2 g • Fiber: 1.5 g",
  "image": "http://recipe-folder.com/img/recipe-images/023/035/958154423.jpg",
  "href": "http://www.skinnytaste.com/chicken-rollatini-with-spinach-alla/print/",
  "extension": "Chrome",
  "firstAdded": "2016-09-07T20:54:06.389000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "Wash and dry cutlets, season with salt and pepper. Preheat oven to 450°. Lightly spray a baking dish with non-stick spray.",
    "Combine breadcrumbs and 2 tbsp grated cheese in one bowl and 1/4 cup egg beaters or egg whites in another.",
    "Shred or finely chop 1.5 oz of mozzarella cheese and combine with remaining grated cheese, spinach (make sure you squeeze it dry), 2 tbsp egg beaters, and ricotta cheese.",
    "Lay chicken cutlets down on a working surface and spread 2 tbsp of spinach-cheese mixture on each cutlet. Loosely roll each one and keep seam side down.",
    "Dip chicken in egg mixture, then in breadcrumbs and place seam side down in a baking dish (no toothpicks needed). Repeat with the remaining chicken. When finished, lightly spray with olive oil.",
    "Bake 25 minutes. Remove from oven, top with sauce then cheese.",
    "Bake until cheese is melted and bubbling, about 3 more minutes. Serve with additional sauce on the side and grated cheese.",
    "© Skinnytaste - http://www.skinnytaste.com/chicken-rollatini-with-spinach-alla/"
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "8 thin chicken cutlets, 3 oz each",
    "1/2 cup whole wheat Italian seasoned breadcrumbs",
    "1/4 cup grated parmesan cheese, divided",
    "6 tablespoons egg whites or egg beaters",
    "5 oz frozen spinach, squeezed dry of any liquid",
    "6 tbsp part skim ricotta cheese",
    "6 oz part skim mozzarella (I used Polly-O)",
    "olive oil non-stick spray (I use my Misto)",
    "1 cup pomodoro sauce or your favorite marinara sauce",
    "salt and pepper to taste"
  ],
  "__v": 1
}