{
  "hash": "df7ef9f71df9a877d678fd5f67e85ee12609da77",
  "title": "Slow Cooker Brisket and Onions",
  "image": "https://atmedia.imgix.net/06dc268e2ccc139e6444d7b5ede5eef4b22dfa77?auto=format&q=45&w=600.0&h=800.0&fit=max&cs=strip",
  "href": "https://www.thekitchn.com/recipe-slow-cooker-brisket-and-onions-recipes-from-the-kitchn-45437",
  "extension": "Chrome",
  "firstAdded": "2017-12-31T01:28:47.797000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat a deep sauté pan or cast iron skillet over medium heat with the olive oil. Add the onions and cook on medium-low to medium heat, stirring frequently, for about 20 minutes or until the onions have caramelized lightly.",
    "While the onions are cooking, take the brisket out of its packaging and pat it dry. Season the meat generously with salt and pepper. Heat a large skillet or sauté pan over medium-high heat and turn on your vent or fan, if you have one. Sear the brisket until a golden brown crust appears on both sides of the meat. Remove and place in a slow-cooker insert, fatty side up.",
    "Sprinkle the minced garlic over the meat. When the onions are lightly browned, pile them on top and around the meat. Mix the broth, Worcestershire sauce, and soy sauce, and pour into the slow-cooker insert.",
    "Cover and cook in the slow cooker on LOW for 6 to 8 hours or until the brisket is very tender. Let rest for at least 20 minutes before serving in the slow cooker set on WARM. (If your slow cooker doesn't have a WARM setting, transfer to a baking dish and cover tightly with foil while resting.)",
    "The brisket can be sliced or shredded immediately and served with the onions and juices. Or let the meat cool then refrigerate overnight. Before reheating, scrape away and discard the layer of fat that has formed around the meat.",
    "To reheat: Heat the oven to 300°F. Transfer the brisket and all its juices to a baking dish and cover tightly with a lid or two layers of foil. Warm in the oven for 1 hour or until warmed through (time will depend greatly on the size and shape of the brisket; cut into smaller pieces for faster reheating)."
  ],
  "ingredients": [
    "0",
    "1 tablespoon olive oil",
    "1 1/2 pounds yellow or red onions (about 2 large onions), sliced into half moons",
    "3 1/2 pounds beef brisket",
    "Coarse kosher salt and freshly ground black pepper",
    "6 cloves garlic, minced",
    "2 cups beef broth",
    "2 tablespoons Worcestershire sauce",
    "1 tablespoon soy sauce (or tamari, if gluten-free)"
  ],
  "__v": 1
}