{
  "__v": 1,
  "directions": [
    "0",
    "Preheat your oven to 350°F. Grease well a 9-inch square baking pan and set it aside.",
    "First, make the cake batter. In a large bowl, place the flour, xanthan gum, baking powder, baking soda, cinnamon, salt and sugar, and whisk to combine well. Create a well in the center of the dry ingredients, and add the butter, eggs, vanilla, sour cream and milk, mixing to combine after each addition. The batter will be thick. Scrape the batter into the prepared baking pan, and spread it into an even layer with a wet spatula. Set the pan aside.",
    "Make the topping. In a medium-size bowl, place the flour, cinnamon and salt, and whisk to combine well. Add the brown sugar, and whisk again, working out any lumps in the brown sugar. Add the melted shortening and vanilla, and mix to combine well. The mixture will be relatively thick but soft. Scrape the topping onto the cake batter in the pan. WIth an offset spatula or large spoon, spread the topping into an even layer on top of the cake batter layer, stopping about 1/4 inch short of the edge of the cake batter. This will help prevent the topping from spreading over the edges of the cake during baking, where it may burn.",
    "Place the cake in the center of the preheated oven and bake until a toothpick inserted in the center of the cake comes out with no more than a few moist cake crumbs attached (about 45 minutes). The topping will remain slightly wet, especially toward the center, but the cake underneath should not.",
    "Remove the cake from the oven and allow to cool in the pan for at least 30 minutes before turning it out onto a wire rack to cool completely. Slice and serve. Wrap any leftovers tightly and freeze."
  ],
  "firstAdded": "2014-08-29T22:18:43.659000",
  "hash": "ffe739d7d4e394bddb7bba9b6f2e3d0f0aaa1655",
  "href": "http://glutenfreeonashoestring.com/gluten-free-cinnamon-coffee-cake/",
  "image": "http://glutenfreeonashoestring.com/wp-content/uploads/2013/10/on-rack.jpg",
  "ingredients": [
    "0",
    "Cake",
    "2 1/2 cups (350 g) all purpose gluten free flour",
    "1 teaspoon xanthan gum (omit if your blend already contains it)",
    "1 teaspoon baking powder",
    "1/2 teaspoon baking soda",
    "1/2 teaspoon ground cinnamon",
    "1/2 teaspoon kosher salt",
    "1 cup (200 g) granulated sugar",
    "8 tablespoons (112 g) unsalted butter, at room temperature",
    "2 eggs (120 g, out of shell) at room temperature, beaten",
    "2 teaspoons pure vanilla extract",
    "1 1/3 cups (300 g) sour cream, at room temperature (can substitute an equal amount, by weight, of Greek yogurt)",
    "1/4 cup (2 fluid ounces) milk (any kind), at room temperature",
    "Topping",
    "1/4 cup (35 g) all purpose gluten free flour (with or without xanthan gum)",
    "2 teaspoons ground cinnamon",
    "1/4 teaspoon kosher salt",
    "1/2 cup (109 g) packed light brown sugar",
    "6 tablespoons (72 g) shortening, melted (I use Spectrum nonhydrogenated vegetable shortening)",
    "1 teaspoon pure vanilla extract"
  ],
  "keywords": [
    "cake",
    "purpose",
    "gluten",
    "free",
    "flour",
    "xanthan",
    "gum",
    "omit",
    "blend",
    "contains",
    "baking",
    "soda",
    "cinnamon",
    "kosher",
    "salt",
    "granulated",
    "sugar",
    "unsalted",
    "butter",
    "room",
    "eggs",
    "shell",
    "vanilla",
    "sour",
    "cream",
    "equal",
    "weight",
    "greek",
    "yogurt",
    "milk",
    "kind",
    "light",
    "brown",
    "use",
    "spectrum",
    "nonhydrogenated",
    "shortening"
  ],
  "title": "Gluten Free Cinnamon Coffee Cake",
  "users": [
    null
  ]
}