{
  "hash": "69399114edb5e848421d3231c101f2eb34138a0d",
  "title": "Pork Belly Carnitas",
  "image": "https://d2k9njawademcf.cloudfront.net/indeximages/43443/full/wildcard_carnitas_food52_mark_weinberg_14-05-27_0296.jpg?1403293265",
  "href": "http://food52.com/recipes/23136-pork-belly-carnitas",
  "extension": "Chrome",
  "firstAdded": "2015-06-10T01:04:30.587000",
  "users": [
    null
  ],
  "keywords": [
    "apple",
    "pineapple",
    "juice",
    "garlic",
    "cinnamon",
    "cumin",
    "bay",
    "leaves",
    "oregano",
    "pork",
    "belly",
    "cubes",
    "reduce",
    "omit",
    "using",
    "stock",
    "salt",
    "unsalted",
    "chicken"
  ],
  "directions": [
    "0",
    "In a container or large freezer bag, combine the apple or pineapple juice, garlic powder, cinnamon, cumin, bay leaves, and oregano. Add the pork belly and refrigerate while it marinates for at least 1 hour and up to overnight.",
    "Remove the pork belly from the fridge an hour before cooking.",
    "Preheat the oven to 350° F. Tip the marinade into a large Dutch oven and spread the pork belly pieces in a single layer in the pan. Pour over your stock. Add salt if you're using unsalted stock. Cook for 2 hours with a lid on.",
    "After 2 hours, remove the lid and cook the pork belly for another hour. This will cook off the remaining liquid and finish rendering the pork fat.",
    "Remove the pork belly from the oven. Transfer the pork pieces to a large, flat-bottomed skillet. Spoon off as much of the fat as you can from the Dutch oven and add it to the skillet with the pork belly pieces. Avoid any solids from the bottom of the pan, as these will burn!",
    "Over medium heat, continue to cook the pork belly in its own rendered fat. The pan should be bubbling but not spitting. Flip the pork belly pieces so that they brown evenly on all sides. This should take about 30 minutes.",
    "When all sides are brown and a little crispy, remove the pork belly from the pan and drain on some paper towels. Shred the meat with two forks and enjoy!"
  ],
  "ingredients": [
    "0",
    "2 cups apple or pineapple juice",
    "2 tablespoons garlic powder",
    "1 1/2 teaspoons ground cinnamon",
    "1 1/2 tablespoons cumin",
    "4 bay leaves",
    "2 tablespoons dried oregano leaves",
    "2 1/2 pounds pork belly, cut into 1 1/2-inch cubes",
    "1 tablespoon salt (reduce or omit if using stock with salt in it)",
    "2 cups unsalted chicken or pork stock"
  ],
  "__v": 1
}