{
  "hash": "82f0534098c045617f6fe4c06db978005f7f0dfa",
  "title": "Butter Cookies with Orange & Chocolate Ganache",
  "image": "",
  "href": "https://sallysbakingaddiction.com/2018/09/28/butter-cookies-chocolate-ganache/",
  "extension": "Chrome",
  "firstAdded": "2018-10-09T17:33:26.055000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preliminary note: The chocolate ganache requires at least 30 minutes to thicken before it can be used in the cookie sandwiches. I recommend starting the ganache as the cookies bake!",
    "In a large bowl using a hand-held or stand mixer fitted with a paddle attachment, beat the butter on medium high speed until completely smooth and creamy, about 2 minutes. Add the confectioners' sugar and orange zest, then beat until combined, about 1 minute. Next, add the egg, egg yolk, vanilla extract, and salt. Beat on high speed until combined, scraping down the sides and up the bottom of the bowl as needed. Finally, beat in the flour on low speed until combined. The cookie dough will be soft.",
    "Lightly flour your hands, work surface, and rolling pin. Divide the dough into 2 equal parts. Roll each portion out onto a piece of parchment paper or a lightly floured silicone baking mat (I prefer the nonstick silicone mat) to about 1/4-inch thickness. The rolled-out dough can be any shape, as long as it is evenly 1/4-inch thick.",
    "Stack the pieces, with parchment paper between the two, onto a baking sheet and refrigerate for at least 1 hour and up to 2 days. If chilling for more than a couple hours, cover the top dough piece with a single piece of parchment paper.",
    "Once chilled, preheat oven to 350°F (177°C). Line 2 large baking sheets with parchment paper or silicone baking mats. Remove one of the dough pieces from the refrigerator and, using a 1.5-inch cookie cutter, cut into shapes. I used the 1.5 inch fluted round cookie cutter from this adorable set. Re-roll the remaining dough and continue cutting until all is used. Repeat with 2nd dough piece. Arrange cookies on baking sheets 2 inches apart. If desired, sprinkle + press some coarse sugar into the tops.",
    "Bake cookies for 9-10 minutes until very lightly browned around the edges. Make sure you rotate the baking sheet halfway through bake time. Allow cookies to cool on the baking sheet for 5 minutes then transfer to a wire rack to cool completely before decorating.",
    "Make the ganache: Place chopped chocolate in a bowl. Heat the cream in a small saucepan until it begins to gently simmer. (Do not let it come to a rapid boil-- that's too hot!) Pour over chocolate and let it sit for 2-3 minutes to gently soften the chocolate. Slowly stir until completely combined and chocolate has melted. Allow to cool and thicken for at least 30 minutes or until spreadable consistency.",
    "Spread the ganache onto the flat side of one cookie and sandwich with the other. Repeat with remaining.",
    "Cookies will stay fresh covered at room temperature for 3 days or in the refrigerator for 1 week."
  ],
  "ingredients": [
    "0",
    "1 cup (2 sticks; 230g) unsalted butter, softened to room temperature",
    "3/4 cup (90g) confectioners' sugar",
    "1 and 1/2 Tablespoons orange zest (about 1 orange)",
    "1 large egg, at room temperature",
    "1 large egg yolk, at room temperature",
    "1 and 1/2 teaspoons pure vanilla extract",
    "1/4 teaspoon salt",
    "2 cups (250g) all-purpose flour, plus more as needed for rolling",
    "optional: coarse sugar for topping"
  ],
  "__v": 1
}