{
  "hash": "192399ae6b9afaa328f4ca4e5a92695d1a27807b",
  "title": "Toloache's Dulce de Leche Sufganiyot",
  "image": "http://a.abcnews.com/images/Lifestyle/ht_dulce_de_leche_toloache_mt_141216_4x3t_384.jpg",
  "href": "http://abcnews.go.com/GMA/recipe/dulce-de-leche-sufganiyot-recipe-whitefish-guacamole-27636944?nwltr=GMAR_featureChef_pos3",
  "firstAdded": "2014-12-19T19:59:49.291000",
  "users": [
    null
  ],
  "keywords": [
    "ngredients",
    "dulce",
    "leche",
    "filling",
    "evaporated",
    "milk",
    "doughnuts",
    "purpose",
    "flour",
    "instant",
    "dry",
    "yeast",
    "salt",
    "shortening",
    "egg",
    "sugar",
    "water",
    "oil",
    "confectioners"
  ],
  "directions": [
    "0",
    "Cooking Directions",
    "Make the Dulce de Leche Filling: Halfway fill a large pot with water, bring to a hard boil.",
    "Place the three unopened cans of evaporated milk in the boiling water; allow water to continue on a hard boil for 3 hours.",
    "After the three hours, remove cans from the water. Open the cans and pour the dulce de leche into a pastry bag with a small tip. Keep dulce de leche at room temperature until ready to use.",
    "Make the Donuts: Combine the flour, dry milk, salt, shortening, eggs and sugar in a large bowl. Mix well. Then add the water, stirring until the mixture thickens to form the dough.",
    "Take the dough by hand to shape it into 1-inch balls.",
    "Pour the vegetable oil in a large pot and bring to a boil. Drop the balls of dough into the vegetable oil and allow to cook for about 5 minutes, or until golden brown. When the donuts are ready, take them out of the oil and place on paper towels to absorb excess oil.",
    "Assemble and Serve: With a pairing knife, make an incision into the center of each donut. Fill each donut with the Dulce de Leche using the pastry bag.",
    "Place 2 donuts per plate and sprinkle with Confectioners' Sugar."
  ],
  "ingredients": [
    "0",
    "ngredients",
    "For the Dulce de Leche Filling:",
    "1 can evaporated milk",
    "For the Doughnuts:",
    "1/2 pound of all purpose flour",
    "1 1/2 tablespoons instant dry milk",
    "1 1/2 tablespoons dry yeast",
    "1 teaspoon salt",
    "1 ounce shortening",
    "1 egg",
    "2 ounces sugar",
    "7 ounces water",
    "1 quart vegetable oil",
    "Confectioners' Sugar"
  ],
  "__v": 1
}