{
  "hash": "fe6e00bc013c7c209e649f1b59af66bb0ee12754",
  "title": "Jamaican Beef Patty",
  "image": "",
  "href": "http://thejamaicanfoodie.blogspot.com/2014/01/jamaican-beef-patty.html",
  "extension": "Chrome",
  "firstAdded": "2016-09-08T05:09:06.317000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparation:",
    "For pastry dough:",
    "Add flour, salt and turmeric to a large bowl and mix thoroughly.",
    "Rub shortening into flour there are small pieces of the shortening completely covered with flour.",
    "Pour in 1/2 cup iced water and mix with your hand to bring the dough together. Keep adding iced water 2 - 3 tablespoons at a time until the mixture forms a dough. At this stage, you can cut the dough into 2 large pieces, wrap in plastic wrap and refrigerate for half and our before using it. Or, cut the dough into 10 - 12 equal pieces, place on a platter or baking street, cover securely with plastic wrap and let chill for half an hour or while you make the filling.",
    "For filling:",
    "Add minced beef to a large bowl. Sprinkle in all all-spice and black pepper. Mix together and set aside.",
    "Heat oil in a pan until hot.",
    "Add onions and saute until translucent. Add hot pepper, garlic and thyme and continue to saute for another minute. Add 1/4 teaspoon salt.",
    "Add minced beef, toss to mix breaking up any clumps and let cook until the meat is no longer pink.",
    "Add ketchup and salt to taste.",
    "Pour in 2 cups of water and stir. Bring the mixture to a boil then reduce heat and let simmer until most of the liquid has evaporated and whatever is remaining has reduced to a thick sauce. Sprinkle and fold in green onions. Remove from heat and let cool completely.",
    "Assembling:",
    "Beat the egg and water together to make an egg wash. Set aside.",
    "Now, you can prepare the dough in two ways:",
    "No. 1",
    "Flour the work surface and rolling pin. If you had cut it into 2 large pieces, then take one of the large pieces and roll in out into a very large circle. Take a bowl with a wide rim (about 5 inches) and cut out three circles.",
    "Place about 3 heaped tablespoons of the filling onto one half of each circle; dip a finger into the water and moisten the edges of the pastry, fold over the other half and press to seal. Take a fork and crimp the edges. Cut off any extra to make it look neat and uniform. Place on a parchment-lined baking sheet and continue to work until you have rolled all the dough and filled the patties.",
    "No. 2",
    "If you had pre-cut the dough into individual pieces, then working with one piece of dough at a time, roll it out on a floured surface into a 5-inch circle or it little larger; don’t worry if the edges are not perfect. Place 3 heaped tablespoons of the filling on one side of the circle; dip a finger into the water and moisten the edges of the pastry, fold over the other half and press to seal. Take a fork and crimp the edges. Cut off any extra to make it look neat and uniform. Place on a parchment-lined baking sheet and continue work until you have rolled all the dough and filled the patties.",
    "Add the pans to the refrigerator to chill while you preheat the oven to 350 degrees F.",
    "Just before adding the pans with the patties to the oven, brush the patties with egg wash.",
    "Bake patties for 30 minutes or until golden brown.",
    "Cool on wire racks.",
    "Serve warm."
  ],
  "ingredients": [
    "0",
    "FOR PASTRY DOUGH:",
    "4 cups all-purpose flour",
    "1 teaspoon salt",
    "1 teaspoon ground turmeric (substitute with curry powder)",
    "1 + 1/3 cups cold vegetable shortening (250 grams or 8.81 oz)",
    "1 cup ice cold water (plus more on standby)",
    "FOR FILLING:",
    "2 pounds minced beef",
    "1 teaspoon ground all-spice",
    "1/2 teaspoon ground black pepper",
    "2 tablespoons vegetable oil",
    "1 cup diced onions",
    "Minced hot pepper to taste",
    "2 teaspoons minced garlic",
    "1 tablespoon minced fresh thyme",
    "2 tablespoons tomato ketchup",
    "Salt to taste",
    "2 cups water",
    "1/2 cup finely sliced green onions (white and green parts)",
    "FOR ASSEMBLING:",
    "1 large egg and 1 tablespoon water",
    "1/4 cup water"
  ],
  "__v": 1
}