{
  "__v": 1,
  "directions": [
    "0",
    "Line an 8x8-inch pan with aluminum foil leaving overhang, spray with cooking spray; set aside.",
    "In a large, microwave-safe bowl combine corn syrup, peanut butter, brown sugar, and heat on high power for 1 minute; stir to combine.",
    "Return bowl to micro and heat for 1 more minute on high power, and stir to combine.",
    "Add vanilla, cocoa, optional salt, and whisk to combine.",
    "Add oats and stir to combine.",
    "Add 1 cup rice cereal and gently stir to combine so cereal doesn't become too crushed. Slowly add the second cup of cereal, stirring while adding to incorporate. Mixture will be very thick, which is good so bars hold together after they're set up. However, if your mixture seems extremely thick or dry, and doesn't quite need the entire second cup or cereal, refrain from adding it all.",
    "Add 3/4 cup chocolate chips and stir to combine. The mixture is warm and chips will likely begin to melt, which is okay but the less stirring, the less melting. Reserve remaining 1/4 cup chips.",
    "Turn mixture out into prepared pan and pack it down firmly with a spatula or hands.",
    "Evenly sprinkle with the remaining 1/4 cup chocolate chips and very lightly tap them down with a spatula.",
    "Cover pan with a sheet of foil (to prevent fridge/freezer smells) and place pan in the fridge for at least 2-3 hours or in the freezer for at least 1 hour, or until bars have set up.",
    "Using foil overhang, remove bars from pan, place on cutting board, and slice. Mine are sliced 4-inches long by 1/2-inch wide, similar in size and shape to Quaker Chewy Granola Bars. Wrap bars individually in plasticwarp. Bars will keep wrapped in plasticwrap inside a large ziplock at room temperature for up to 1 month, in the fridge for up to 2 months, or in the freezer for up to 6 months."
  ],
  "firstAdded": "2014-06-12T09:10:06.043000",
  "hash": "408bec99e5c1dd53bd8e8fc21b076c4f48879c95",
  "href": "http://www.averiecooks.com/2014/05/no-bake-double-chocolate-peanut-butter-granola-bars.html",
  "image": "http://www.averiecooks.com/wp-content/uploads/2014/05/chocpbgranolabars-7.jpg",
  "ingredients": [
    "0",
    "2/3 cup light corn syrup (brown rice syrup to keep vegan or honey may be substituted) heaping 1/2 cup creamy peanut butter 1/4 cup light brown sugar, packed 1/4 cup unsweetened natural cocoa powder 1 1/2 teaspoons vanilla extract 1/2 teaspoon salt, optional and to taste 2 cups quick cook oats (Quaker, Bob's, or similar; don't use whole-rolled oats, pulse/grind briefly if that's what you have) 2 cups crispy rice cereal (Rice Krispies, Erewhon, or similar) 1 cup mini semi-sweet or dark chocolate chips, divided"
  ],
  "keywords": [
    "corn",
    "syrup",
    "vegan",
    "honey",
    "substituted",
    "heaping",
    "creamy",
    "peanut",
    "butter",
    "light",
    "brown",
    "sugar",
    "natural",
    "cocoa",
    "vanilla",
    "salt",
    "quick",
    "quaker",
    "bobs",
    "dont",
    "use",
    "wholerolled",
    "oats",
    "pulsegrind",
    "briefly",
    "thats",
    "crispy",
    "cereal",
    "rice",
    "krispies",
    "erewhon",
    "similar",
    "mini",
    "semisweet",
    "dark",
    "chocolate",
    "chips",
    "divided"
  ],
  "title": "No-Bake Double Chocolate Peanut Butter Granola Bars",
  "users": [
    null
  ]
}