{
  "hash": "d455aed43324ab89dddee22d7cf622fb8270cb18",
  "title": "Beijing Beef",
  "image": "http://rasamalaysia.com/wp-content/uploads/2016/03/beijing-beef.jpg",
  "href": "http://rasamalaysia.com/beijing-beef-recipe/2/",
  "extension": "Chrome",
  "firstAdded": "2017-10-02T22:57:17.870000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare the Marinade in a bowl and mix well. Marinate the beef for 15 minutes.",
    "In a seperate bowl, mix all the Beijing Sauce ingredients. Set aside.",
    "Place cornstarch in a bag/bowl. Toss marinated beef in cornstarch, coat well and set aside in the refrigerator.",
    "Heat up enough oil over high heat. Coat beef slices with cornstarch again, making sure the beef slices are well coated. Shake off the excess cornstarch from beef slices. Prepare to deep-fry beef (in small batches). Drop in the beef slices and deep-fry for 1-2 minutes or until light golden brown. Dish out, drained on paper towel and set aside.",
    "In a wok, heat up the oil over high heat. Stir-fry the onion and bell pepper until fragrant and slightly charred, add in the garlic and continue to stir-fry for 10 seconds. Remove from wok.",
    "Heat up wok over medium-high heat, pour in the Beijing Sauce seasoning. Bring it to a simmer or until it thickens. You may adjust salt, soy sauce, water, etc., to taste.",
    "Toss in the deep-fried beef and stir-fried onion, bell pepper, and garlic. Stir well for 1 minute or until the beef is completely cooked and absorbed the sauce. Dish out and serve with hot steamed rice.",
    "Cook’s Note:",
    "You can use chicken instead of beef."
  ],
  "ingredients": [
    "0",
    "8 oz flank steak, sirloin or beef flap, cut against the grain into 1/4 inch slices",
    "2 tablespoons oil",
    "2 cloves garlic, minced",
    "1/2 medium-sized yellow onion, sliced",
    "1/2 medium-sized red bell pepper, cut into pieces",
    "Cornstarch, to dust beef for deep-frying",
    "Salt and sugar to taste",
    "Marinade:",
    "1 egg, beaten",
    "1/2 teaspoon cornstarch",
    "A dash of ground white pepper",
    "1/2 teaspoon salt",
    "Beijing Sauce:",
    "4 tablespoons water",
    "2 tablespoons sugar",
    "1 1/2 tablespoons ketchup",
    "3 tablespoons Hoisin sauce",
    "2 teaspoons light soy sauce",
    "1 teaspoon oyster sauce",
    "2 teaspoons sweet chili sauce",
    "1-2 teaspoons crushed chili peppers",
    "1 tablespoon apple cider vinegar"
  ],
  "__v": 1
}