{
  "hash": "6d0a90a751acc06363c0dd3b846b405eefa5d6b9",
  "title": "Mashed Potato and Rutabaga Gratin",
  "image": "http://www.finecooking.com/CMS/uploadedImages/Images/Cooking/Articles/Issues_111-120/051115w-01-mashed-potato-and-rutabega-gratin_xlg.jpg",
  "href": "http://www.finecooking.com/recipes/mashed-potato-rutabaga-gratin.aspx",
  "extension": "Firefox",
  "firstAdded": "2015-12-18T02:59:24.360000",
  "users": [
    null
  ],
  "keywords": [
    "tbs",
    "unsalted",
    "butter",
    "softened",
    "baking",
    "dish",
    "medium",
    "yukon",
    "gold",
    "potatoes",
    "chunks",
    "rutabaga",
    "kosher",
    "salt",
    "cream",
    "cheese",
    "dry",
    "mustard",
    "pecorino",
    "milk",
    "needed",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "Butter an 8x11-inch baking dish and set aside.",
    "Put the potatoes and rutabaga in a 5- to 6-quart saucepan or Dutch oven and cover with cool water by about 1 inch (the rutabaga will float to the top). Add 1/2 tsp. salt and bring to a boil over medium-high heat. Reduce the heat to medium, cover partially, and cook until the potatoes are very tender and the rutabaga is soft, about 25 minutes.",
    "Drain the vegetables and return them to the pot. Set over medium heat for a minute or two, shaking and stirring to rid them of excess moisture and steam.",
    "Transfer the vegetables to a stand mixer fitted with the paddle attachment (or use a large mixing bowl and an electric hand mixer). On low speed, break up the vegetables until the potatoes are smooth and there are small chunks of rutabaga in the mixture. Gradually add the cream cheese, increase the speed to medium, and beat until absorbed. Gradually add the butter and beat until absorbed. Add the mustard and half of the pecorino and beat until combined. If the purée seems too dry, add enough milk to make it light and fluffy but not wet. (You may not need to use any milk.) Season to taste with salt and pepper.",
    "Transfer the mash to the prepared baking dish, smoothing the top with a spatula. Sprinkle the remaining cheese on top.",
    "Position a rack in the center of the oven and heat the oven to 375°F. If the gratin was made assembled ahead and refrigerated, let it sit at room temperature while the oven heats. Bake uncovered until heated though and the top is golden, about 40 minutes for a refrigerated gratin or about 20 minutes for a freshly made gratin. Let sit for 15 minutes before serving.",
    "The gratin may be made ahead, up to the point of baking, 2 days ahead. Cover it with pastic wrap and refrigerate it."
  ],
  "ingredients": [
    "0",
    "2 oz. (4 Tbs.) unsalted butter, softened; more for the baking dish",
    "5 medium Yukon Gold potatoes (1-3/4 lb.), peeled and cut into 1- to 1-1/2-inch chunks",
    "1 large rutabaga (about 1-1/2 lb.), peeled and cut into 1-inch chunks",
    "Kosher salt",
    "8 oz. cream cheese, cut into 4 chunks, softened",
    "1/2 tsp. dry mustard",
    "1/2 cup (2 oz.) finely grated pecorino cheese",
    "Whole milk, as needed",
    "Kosher salt",
    "Freshly ground black pepper"
  ],
  "__v": 1
}