{
  "hash": "06ebd567dfe015c6f38d310b45fff93531d3c771",
  "title": "Classic Buttermilk Pancakes",
  "image": "http://www.finecooking.com/CMS/uploadedImages/Images/Cooking/Articles/Issues_101-110/051102039-01-buttermilk-pancakes-recipe_xlg.jpg",
  "href": "http://www.finecooking.com/recipes/classic-buttermilk-pancakes.aspx",
  "extension": "Chrome",
  "firstAdded": "2015-03-23T17:34:42.876000",
  "users": [
    null
  ],
  "keywords": [
    "tbs",
    "unsalted",
    "butter",
    "unbleached",
    "allpurpose",
    "flour",
    "granulated",
    "sugar",
    "baking",
    "soda",
    "kosher",
    "salt",
    "buttermilk",
    "eggs",
    "oil",
    "griddle",
    "maple",
    "syrup"
  ],
  "directions": [
    "0",
    "Heat the oven to 200°F. Melt the butter in a small bowl in the microwave or in a small saucepan on the stove and set aside to cool briefly.",
    "In a large bowl, whisk the flour, sugar, baking powder, baking soda, and salt. In a medium bowl, whisk the buttermilk and eggs. Pour the wet ingredients into the dry ingredients. Whisk gently until the dry ingredients are almost incorporated; stop before the batter is evenly moistened. Add the cooled melted butter and mix just until the batter is evenly moistened (there will be lumps). Let the batter rest while you heat the griddle.",
    "Heat a griddle or a large skillet over medium heat (or set an electric griddle to 375°F) until drops of water briefly dance on the surface before evaporating. Lightly oil the griddle. Working in batches, pour 1/4 cup of the batter onto the griddle for each pancake, spacing them about 1 inch apart. Let cook undisturbed until bubbles rise to the surface and the edges look dry, 1 to 2 minutes. Check the underside of each pancake to make sure it’s nicely browned; then flip. Cook until the second side is nicely browned, about 1 minute more. Transfer the pancakes to a baking sheet and keep warm in the oven while you repeat with the remaining batter.",
    "Serve hot with butter and maple syrup.",
    "Make Ahead Tips",
    "Cooked pancakes will keep, sealed in freezer bags, for up to 2 days in the refrigerator and up to 1 month in the freezer. Defrost in the refrigerator overnight and reheat in a 350°F oven for 5 minutes."
  ],
  "ingredients": [
    "0",
    "3 Tbs. unsalted butter; more for serving",
    "9 oz. (2 cups) unbleached all-purpose flour",
    "1/4 cup granulated sugar",
    "2-1/2 tsp. baking powder",
    "1/2 tsp. baking soda",
    "1/2 tsp. kosher salt",
    "2 cups buttermilk",
    "2 large eggs",
    "Vegetable oil for the griddle",
    "Pure maple syrup for serving"
  ],
  "__v": 1
}