{
  "hash": "74f717156b6f33b28ebb5fb9f45a0deebc509009",
  "title": "lazy pizza dough + favorite margherita pizza",
  "image": "http://smittenkitchen.com/wp-content/uploads/lazy-pizza-dough-+-favorite-margherita-pizza.jpg",
  "href": "http://smittenkitchen.com/blog/2013/10/lazy-pizza-dough-favorite-margarita-pizza/",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T22:54:00.728000",
  "users": [
    null
  ],
  "keywords": [
    "allpurpose",
    "bread",
    "flour",
    "works",
    "slightly",
    "heaped",
    "active",
    "dry",
    "yeast",
    "overnight",
    "allday",
    "partday",
    "schedules",
    "respectively",
    "kosher",
    "salt",
    "water",
    "needed",
    "updated"
  ],
  "directions": [
    "0",
    "In a very large bowl, mix all ingredients with a spoon. The dough will be craggy and rough; this is fine, but if it feels excessively so, add another spoonful or even two of water. (See Note up top about altered water level/flour heaviness.) Cover bowl with plastic and keep at room temperature for approximately 22 (for Overnight schedule), 12 (for All-Day schedule) or 6 (for Part-Day schedule) hours, or until the dough has more than doubled. This takes longer in a chilly room and less in a very warm one, but don’t fret too much over this, as the dough is generally forgiving of a loosened schedule.",
    "About 30 minutes before dough is ready, begin draining tomatoes if you’ll be following the margherita recipe below. Prepare pizza stone and paddle sprinkling it with cornmeal. You can also use any old baking sheet you have around, however, based on early commenters, the pizza tends to stick to these more, so I now recommend that you prepare it by very lightly, thinly coat it with olive oil or a nonstick cooking spray before sprinkling it with cornmeal. Heat oven to its highest temperature, usually between 500 and 550 degrees F. If you’re using a pizza stone, place it in the oven so that it heats too.",
    "Flour your counter very well. Scrape dough out of bowl onto floured counter; in the time it has risen it should change from that craggy rough ball to something very loose, soft, sticky and stretchy. Flour the top of the dough, and divide dough in half (or more pieces, if you’re making smaller pizzas). Form them into ball-like shapes. Grab first round with floured hands and let the loose, soft dough stretch and fall away from your hands a few times before landing the dough on your prepared baking sheet/paddle. Use floured fingers to press and nudge dough into a roughly round or rectangular shape. Add desired fixings (see below for My Favorite Margherita Pizza) and bake pizza for 10 to 15 minutes, rotating if it’s baking unevenly, until the top is blistered and the crust is golden. Repeat with remaining dough."
  ],
  "ingredients": [
    "0",
    "3 cups (375 grams) all-purpose flour (bread flour works too)",
    "Slightly heaped 1/8, 1/4 or 1/2 teaspoon active dry yeast (for Overnight, All-Day, or Part-Day Schedules respectively, above)",
    "1 1/2 teaspoons sea or kosher salt",
    "1 1/4 cup water, plus an additional tablespoon or two if needed (updated)"
  ],
  "__v": 1
}