{
  "hash": "2caa8f290dc81f0f7b8496b971ec1f58a9acfb2d",
  "title": "Baked “Fish” Cakes With Lemon Herb Mayo [Vegan]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/04/fish.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/baked-fish-cakes-with-lemon-herb-mayo/",
  "extension": "",
  "firstAdded": "2015-04-04T13:58:00.042000",
  "users": [
    null
  ],
  "keywords": [
    "chickpeas",
    "sheets",
    "roasted",
    "nori",
    "scissors",
    "pieces",
    "white",
    "miso",
    "eggless",
    "mayo",
    "lemon",
    "juice",
    "kosher",
    "salt",
    "cracks",
    "black",
    "pepper",
    "onion",
    "light",
    "green",
    "flat",
    "parsley",
    "panko",
    "crumbs"
  ],
  "directions": [
    "0",
    "Preheat oven to 375 degrees.",
    "Pulse chickpeas 1 cup at a time in a food processor, about 9 pulses so it is a course meal. You don’t want it to be smooth like hummus and a few whole chickpeas are fine. Place each batch into a large bowl until all the chickpeas are pulsed.",
    "Cut nori sheets with scissors into small pieces and add to the chickpeas. In a small bowl whisk the miso, mayo, lemon juice, salt and pepper until thoroughly combined. Add to the chickpeas and with a spatula combine the ingredients until mixed.",
    "Add the onions, parsley and 3 tablespoons panko and stir until well combined.",
    "In a shallow bowl or pie plate, add the rest of the panko crumbs. Line a baking sheet with parchment paper.",
    "Using ¼-measuring cup, scoop level amount of chickpea mixture and lightly pack. Take the mixture out of the cup and form into a patty about 2-2 1/2 inches wide. Lightly press both sides into panko crumbs and set on lined baking sheet. Repeat with the rest of the mixture. I got eight ¼ cup cakes and one slightly smaller cake. Bake for 15-17 minutes until golden brown.",
    "While the cakes are baking, make the sauce. Combine all ingredients to a food processor or blender and process until very smooth. Set aside until cakes are ready.",
    "Transfer cakes to serving plate and top with sauce and chives. Serve with lemon wedges."
  ],
  "ingredients": [
    "0",
    "2 1/2 cups cooked chickpeas",
    "2 sheets roasted nori, cut with scissors into small pieces",
    "2 tablespoons white miso",
    "3 tablespoons eggless mayo",
    "3 teaspoons fresh lemon juice",
    "½ teaspoon kosher salt",
    "3 cracks of black pepper",
    "1 green onion, green and light green part only, minced",
    "2 tablespoons minced flat parsley",
    "3 tablespoons plus ½ cup panko crumbs",
    "1",
    "¼ cup eggless mayo",
    "1-tablespoon fresh lemon juice",
    "2 tablespoons fresh minced parsley",
    "1 green onion, green and light green part only, minced plus 1 tablespoon thinly sliced green onion for garnish",
    "¼ teaspoon kosher salt",
    "2 cracks of black pepper"
  ],
  "__v": 1
}