{
  "hash": "d31d04afb489f34031172cbd15366b200ce37bed",
  "title": "Super Thick Coconut Yogurt (the shortcut method!)",
  "image": "http://cdn.ohsheglows.com/wp-content/uploads/2015/05/coconutyogurtreciperaw-8749.jpg",
  "href": "http://ohsheglows.com/2015/05/20/super-thick-coconut-yogurt-the-shortcut-method/",
  "extension": "Chrome",
  "firstAdded": "2016-02-15T22:20:03.085000",
  "users": [
    null
  ],
  "keywords": [
    "thawed",
    "young",
    "thai",
    "coconut",
    "meat",
    "headnote",
    "use",
    "filtered",
    "water",
    "lemon",
    "juice",
    "reduce",
    "tart",
    "flavour",
    "probiotic",
    "capsules",
    "desired",
    "pink",
    "salt",
    "sweetener",
    "natural",
    "cane",
    "sugar"
  ],
  "directions": [
    "0",
    "Directions:",
    "Add all ingredients into a high speed blender and blend on low, gradually increasing the speed to high, until super smooth. Keep blending until it’s not grainy anymore. Adjust sweetness to taste by adding sweetener if desired and blending again. I add a tablespoon of cane sugar and blend on high to pulverize it in my Vitamix.",
    "Spoon the yogurt into an air-tight container and chill in the fridge for at least a couple hours.",
    "Serve with granola and chia seed jam, parfait-style, if desired. Or simply enjoy alone. This yogurt is also great mixed into vegan overnight oats or added to smoothies! I’m not positive on the shelf life because we usually enjoy it within a couple days, but I imagine it lasts at least a few days in the fridge in an air-tight container.",
    "Tips:",
    "Tip: In the photo, I made parfaits with strawberry-raspberry chia seed jam paired with a granola that I’m testing for my next cookbook (in the meantime, check out my Lightened Up Summer granola and the granola clusters in the Oh She Glows Cookbook)"
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "2 cups fresh young Thai coconut meat (or thawed Young Thai Coconut Meat, see headnote)",
    "1/2 cup coconut water (or use filtered water in a pinch)",
    "1 tablespoon fresh lemon juice (reduce for a less tart flavour)",
    "1/4-1/2 teaspoon probiotic powder, optional (you can empty probiotic capsules, if desired)",
    "pinch of pink salt or fine grain sea salt",
    "liquid sweetener to taste (I use 1 tablespoon natural cane sugar)"
  ],
  "__v": 1
}