{
  "hash": "4aee56e485709319aafc8d0d8c3f175d7c8658c2",
  "title": "leblebi (north african chickpea soup)",
  "image": "https://alexandracooks.com/wp-content/uploads/2016/01/bowlofleblebi-1.jpg",
  "href": "https://alexandracooks.com/2016/01/28/leblebi-moroccan-chickpea-stew/",
  "extension": "Chrome",
  "firstAdded": "2019-01-02T23:57:52.954000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Soaking and cooking the chickpeas:Dissolve the 3 tablespoons of salt into 4 quarts of water. Add the chickpeas and soak for 8 to 24 hours. Drain, rinse and place in a pot with 1 teaspoon of salt. Cover with water by three inches. Bring to a boil, then lower heat and cook at the gentlest simmer for about 45 minutes or until the chickpeas are cooked through. Let the chickpeas cool in their cooking liquid. Store the chickpeas in their cooking liquid.",
    "Heat a soup pot over high heat. Add the oil, then the onion and salt. Stir, turn the heat to low, and cover the pot. Check and stir after a few minutes, letting the moisture on the lid drip back into the pot to keep things steamy. Lower the heat if there is any browning going on, and re-cover. Cook like this until the onion is tender, about 15 minutes.",
    "Add the cumin, paprika, pepper flakes, cilantro and garlic and stir for 1 minute. Add the tomatoes and cook for a couple of minutes more, stirring occasionally. Add 6 cups of the cooked chickpeas and enough of their cooking liquid to cover by 2 inches, raise the heat, and bring to a boil. (You’ll need about 4 cups liquid total: all of the cooking liquid, which was 3 cups plus 1 cup extra water — the chickpeas may not be covered by 2 inches, but it will be fine.)",
    "Lower to a simmer and cook for 20 minutes. Put 2 ladles of soup in a blender or food mill and purée — careful: it’s hot. (I used an immersion blender and puréed partially.) Return to the soup pot and stir in to thicken the leblebi slightly. Taste for seasonings and add water or any reserved cooking liquid if it’s too thick. Note: When reheating, you most likely will need to add water to achieve desired consistency.",
    "To serve: ladle the leblebi into bowls. Pass a bowl of harissa on the side. Serve with warm flatbreads."
  ],
  "ingredients": [
    "0",
    "1 lb. dried chickpeas",
    "3 tablespoons + 2 teaspoon kosher salt",
    "4 tablespoons olive oil",
    "1 large yellow onion, diced",
    "2 teaspoons cumin seeds",
    "1 teaspoon paprika",
    "crushed red pepper flakes",
    "1/2 cup roughly chopped cilantro stems and leaves",
    "2 garlic cloves, sliced or chopped",
    "3/4 cup crushed tomatoes (see notes above)",
    "harissa for serving (for Peternell’s quick recipe, see notes above)",
    "flatbreads for serving"
  ],
  "__v": 1
}