{
  "hash": "65394d63e8f8c13483b2fc5a4af5db19916059a1",
  "title": "Caramel Sauce",
  "image": "http://ketocook.files.wordpress.com/2012/11/ketogenic-carmel-sauce.jpg?w=630&h=700",
  "href": "http://ketocook.com/2012/11/08/caramel-sauce-method-of-serving-fat/",
  "extension": "Chrome",
  "firstAdded": "2015-10-11T05:22:44.490000",
  "users": [
    null
  ],
  "keywords": [
    "butter",
    "salted",
    "use",
    "unsalted",
    "caramel",
    "flavor",
    "cream",
    "sweetener",
    "used",
    "truvia"
  ],
  "directions": [
    "0",
    "Use the smallest non-stick pan you have. I have this 8-inch pan. Melt the butter in the pan over LOW heat.",
    "Let the butter cook until it begins to turn golden brown. It is best to not rush this process because once it starts to turn brown it can quickly go too far and taste burnt.",
    "Once the butter has turned light golden brown, remove the pan from the heat and add the cream and sweetener.",
    "Immediately return the pan to the low heat and stir the cream into the butter. The cream will foam and bubble, the cream should come to a full boil. The cream and the butter may look separated, but keep stirring!",
    "Once the bubbling has slowed and the ingredients are well combined, continue cooking until it has thickened and feels “sticky” (The bubbles will take longer to come to the surface).",
    "This step only took about 1 minute for a batch of 60g cream and 60g butter, and a few seconds for the 12g batch.",
    "Once you remove it from the heat, continue to stir until it begins to cool. If you let it sit while it is hot, the butter and cream will separate. Continue to stir it for a few minutes and it will hold together as a thick sauce. You can pour it into candy molds at this point if you wish."
  ],
  "ingredients": [
    "0",
    "1 part butter, use salted if you like “salted caramel” flavor. Use un-salted for traditional caramel flavor",
    "1 part 40% heavy cream",
    "Sweetener, I used 3g of Truvia"
  ],
  "__v": 1
}