{
  "hash": "4d598e22be7533146b5a32abaff1130057c6e688",
  "title": "Real cashew-based vegan brie!\n1 December 2016 - 9:06 by Martine in Dips & Spreads\nTags: Gluten free, Paleo, Soy free\nTime: Preparation time 20 minutes,\tcooking time 0 minutes, total time 20 minutes\nServes: 1/2 pound cheese",
  "image": "https://lowcarb-vegan.net/wp-content/uploads/2016/11/IMG_5973_1-770x579.jpg",
  "href": "https://lowcarb-vegan.net/real-cashew-based-vegan-brie/",
  "extension": "Chrome",
  "firstAdded": "2018-04-05T02:13:58.769000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Drain the soaked cashews and add them to the jar of your blender or food processor along with the water, coconut oil, yogurt, camembert rind (or penicillium candidum) and salt. Blend into a smooth mass. Depending on the strength of your machine, this could take a few minutes. Add one or two tablespoons more water if needed to help the blending.",
    "Take a flat bottomed round bowl that can serve as a cheese mold and cover it with plastic wrap. Pour the cheese mixture into the mold. Cover and put the cheese into the fridge for 8 to 16 hours so it can firm up.",
    "Once the cheese is set, carefully peel away the plastic wrap and place the cheese onto a piece of parchment paper, in a sealed plastic container that is large enough so the cheese has a little space to breathe. Make sure to touch it as little as possible with your bare hands, so you do not contaminate it with the wrong molds or bacteria, especially in the beginning. Place the container in a room where the temperature is between 11 and 15 degrees C / 50-60 F. If you do not have such a room, the least cold spot in your fridge will do if you don't set it super cold (often the top shelf is warmest).",
    "The cheese now needs to ripen for about 3 weeks at this temperature. Turn it over every day with the aid of a piece of parchment paper. If there is condensation on the sides of the container, wipe it off with a paper towel. Replace the parchment paper when it gets wet. The sealed container helps to keep humidity high, but it should not get wet inside. The cheese's odor can change from day to day, from fruity to sour or even a bit yeast like. This is all fine.",
    "After five to six days the fungus will start to grow (see the pictures). It can have a grayish white or yellowish color. The cheese will continue to firm up. At some point you will be able to place it on a sushi mat or similar item instead of the parchment paper to allow more air to reach its bottom. Keep turning the cheese regularly so it do not stick to the mat. If the fungus on one side of the cheese grows faster than that on the other side, you can leave the slow growing side facing up for a few days so it gets more air. However, keep lifting the bottom off the mat every day, to prevent sticking.",
    "After about three weeks your cheese will finally be covered with a nice thick layer of white fungus. You can now eat it, or keep it in the fridge a while longer. The fungus will continue to grow. If you want to make more cheese after this one, cut off a nice clean piece of fresh rind and start all over again with the recipe."
  ],
  "ingredients": [
    "0",
    "1 cup (130 g) raw cashew nuts, soaked for 8 hours",
    "1/3 cup (80 ml) water",
    "1/4 cup (60 ml) neutral tasting coconut oil, melted",
    "1 tablespoon soy or coconut yogurt",
    "5 gram (1 square inch piece) rind from a cashew camembert or 1 drop penicillium candidum",
    "1/3 teaspoon non-iodized salt"
  ],
  "__v": 1
}