{
  "hash": "bd5100231c844e977fe4ceb6e77b817b148aff78",
  "title": "CROCK-POT CHEESY CHICKEN SPAGHETTI\nIf you love creamy, spicy pasta dishes, this Crock-Pot version of my Cheesy Chicken Spaghetti will blow your mind. Cook the sauce for a few hours and then toss with pasta when you're ready to serve!\nYield: 4 servings Prep Time: 10 minutes Cook Time: 4 hours 30 minutes Total Time: 4 hours 40 minutes",
  "image": "http://www.laurenslatest.com/wp-content/uploads/2015/02/IMG_0186_edited-11.jpg",
  "href": "http://www.laurenslatest.com/crock-pot-cheesy-chicken-spaghetti/",
  "extension": "Chrome",
  "firstAdded": "2015-11-04T20:18:28.411000",
  "users": [
    null
  ],
  "keywords": [
    "yellow",
    "onion",
    "red",
    "bell",
    "pepper",
    "green",
    "mild",
    "chiles",
    "cumin",
    "garlic",
    "salt",
    "chicken",
    "breasts",
    "cream",
    "mushroom",
    "soup",
    "spaghetti",
    "cheddar",
    "cheese",
    "splashes",
    "stock"
  ],
  "directions": [
    "0",
    "Place onion, bell peppers, green chiles, cumin, garlic powder, salt, pepper, chicken, mushroom soup and 1 cup of grated cheese together in a crock-pot. Stir to mix ingredients. Cook on high for 3-4 hours or until chicken is fully cooked. Remove chicken breasts, shred and return to crock-pot. Pour in cooked spaghetti and remaining cheese. Toss to coat pasta in sauce and melt cheese, adding in a few splashes of chicken stock where necessary to get sauce consistency you want. Cook another 20-30 minutes on low and serve.",
    "**Freezer directions: Place onion, bell peppers, green chiles, cumin, garlic powder, salt, pepper, chicken, mushroom soup and 1 cup of grated cheese together in a large plastic freezer bag. Seal and freeze. To cook, defrost in fridge, place in crockpot and cook according to directions listed above."
  ],
  "ingredients": [
    "0",
    "1/2 cup diced yellow onion",
    "1/2 red bell pepper, diced",
    "1/2 green bell pepper, diced",
    "1 small can mild diced green chiles",
    "1/2 teaspoon cumin",
    "1/2 teaspoon garlic powder",
    "salt & pepper, to taste",
    "2 chicken breasts {about 1 lb.}",
    "1 can cream of mushroom soup",
    "3/4-1 lb. cooked spaghetti",
    "3 cups grated cheddar cheese",
    "a few splashes chicken stock {optional}"
  ],
  "__v": 3
}