{
  "hash": "2996358383ec03a8be8d725b6292b4b83c377ffe",
  "title": "Sunchoke-Kale Hash with Farro",
  "image": "http://cdn-image.foodandwine.com/sites/default/files/styles/recipe_carousel_551_551/public/2014-r-xl-shrimp-and-grits.jpg?itok=wbfq62Q7",
  "href": "http://www.foodandwine.com/recipes/sunchoke-kale-hash-with-farro",
  "extension": "Chrome",
  "firstAdded": "2015-12-18T20:34:17.588000",
  "users": [
    null
  ],
  "keywords": [
    "farro",
    "sunchokes",
    "pieces",
    "salt",
    "tuscan",
    "kale",
    "tough",
    "stems",
    "discarded",
    "extravirgin",
    "olive",
    "blended",
    "oil",
    "red",
    "onion",
    "unsalted",
    "butter",
    "oyster",
    "mushrooms",
    "pepper"
  ],
  "directions": [
    "0",
    "In a medium saucepan, cover the farro with 2 inches of water. Bring to a boil, cover and cook over low heat until the farro is tender, about 25 minutes. Drain the farro.",
    "Meanwhile, in a large saucepan, cover the sunchokes with water and add a pinch of salt. Boil until the sunchokes are tender, 10 minutes; drain. Slice the sunchokes 1/4 inch thick.",
    "Fill the large saucepan with water and bring to a boil. Add the Tuscan kale and cook until just tender, about 3 minutes. Drain the kale and let cool slightly. Squeeze out any excess liquid from the kale leaves and then coarsely chop them.",
    "In a small skillet, heat 2 tablespoons of the blended oil. Add the red onion and a pinch of salt and cook over moderately low heat, stirring occasionally, until browned, about 12 minutes.",
    "In a nonstick skillet, melt the butter in 2 tablespoons of the blended oil. Add the sunchokes in an even layer and cook over high heat until browned on the bottom, about 3 minutes. Turn the sunchokes, reduce the heat to moderately high and continue cooking until starting to brown, about 2 minutes. Push the sunchokes to the side of the skillet.",
    "Add 1 more tablespoon of the oil and the oyster mushrooms. Season with salt and pepper and cook over moderately high heat until browned, 3 minutes. Add the remaining 1 tablespoon of oil along with the farro, kale and onion and cook, stirring, until hot. Season with salt and pepper and serve."
  ],
  "ingredients": [
    "0",
    "3/4 cup farro",
    "2 1/2 pounds large sunchokes, peeled and cut into 2-inch pieces",
    "Salt",
    "1 pound Tuscan kale, tough stems discarded",
    "3 tablespoons extra-virgin olive oil blended with 3 tablespoons of vegetable oil",
    "1 small red onion, sliced 1/4 inch thick",
    "1 tablespoon unsalted butter",
    "1/2 pound oyster mushrooms, halved if large",
    "Freshly ground pepper"
  ],
  "__v": 1
}