{
  "hash": "0b01f09a207168a77699294856de6af6164e546f",
  "title": "Creamy One-Pot Pasta with Peas and Mint",
  "image": "",
  "href": "https://www.bonappetit.com/recipe/creamy-one-pot-pasta-with-peas-and-mint",
  "extension": "Firefox",
  "firstAdded": "2018-10-05T17:47:24.509000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Bring a large pot filled with water to a boil over high heat. When water starts to steam, add a palmful of salt.",
    "When water has reached a rolling boil, add 10 oz. frozen peas. Cook until peas start to float and are tender, about 3 minutes. Using a spider or slotted spoon, transfer peas to a large bowl, allowing water to drain back into pot.",
    "Bring water back to a boil and add 1 lb. pasta shells, stirring once or twice with a wooden spoon to prevent sticking. Cook according to package instructions until pasta is tender but still al dente.",
    "While pasta is cooking, assemble your pea mixture. Start by setting aside about ¼ cup mint leaves for serving; finely chop remaining ¼ cup mint. Add chopped mint to bowl with peas.",
    "Using a microplane, finely grate 1 garlic clove and zest of 1 lemon into bowl with pea mixture. Reserve zested lemon for serving.",
    "Add ½ cup cream, 2 Tbsp. oil, and ½ cup cheese to bowl with pea mixture and mash with a potato masher to break up peas. You want a mix of whole peas and smooth, mushy parts.",
    "When pasta is finished cooking, transfer to bowl with peas with spider (it’s okay if some pasta cooking liquid piggybacks into bowl—in fact, it’s a good thing!).",
    "Season mixture generously with pepper and more salt, if needed, and toss with a wooden spoon vigorously so hot pasta melts cheese and thickens to a creamy sauce.",
    "Divide pasta among bowls. Top with remaining cheese and reserved mint. Drizzle with oil.",
    "Cut reserved lemon into wedges and serve alongside for squeezing over."
  ],
  "ingredients": [
    "0",
    "Kosher salt",
    "1 10-oz. bag frozen peas (no need to thaw)",
    "1 lb. medium shell pasta",
    "½ cup mint leaves, divided",
    "1 garlic clove",
    "1 lemon",
    "½ cup heavy cream",
    "2 Tbsp. extra-virgin olive oil, plus more for drizzling",
    "1 cup store-bought grated Parmesan",
    "Freshly ground black pepper"
  ],
  "__v": 1
}