{
  "hash": "fce42285b3e66c11032b340415c231cb58af584f",
  "title": "PORK CHIMICHANGAS WITH PORK CHILI VERDE",
  "image": "",
  "href": "http://mexican.betterrecipes.com/pork-chimichangas-with-pork-chili-verde.html",
  "extension": "Chrome",
  "firstAdded": "2018-01-27T14:59:00.643000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 375 degrees. Mix the adobo seasoning, garlic salt, salt, pepper, and Mexican oregano in a bowl. Combine adobo seasoning, salt, pepper and oregano in a bowl. Add garlic salt and ground red pepper. Trim fat from roast and rub in seasonings. Place roast in oven, cover with a 1/4 inch of water and top with 1/4 of onion and 2 garlic cloves. Bake for 30 minutes, then check temperature. Roast should reach an internal temperature of 140 degrees. If this is not reached at this point, bake roast an additional 15 minutes. In a food processor, mix diced green chilies, jalapenos, tomatillos, 2 garlic cloves and 1/4 of onion, then process until smooth. Once the roast is done, cut in half. Use one half for green chili, the other half will be shredded for chimichangas. In a large pan, use remaining water from pork roast to saute remaining onions and garlic. Saute until tender and clear. Stir flour into onion and garlic mixture until the flour is absorbed, then add broth. Cook and stir until mixture comes to boil and is slightly thickened. Add cubed meat and green chili mixtures. Add ground cumin and ground chili to taste. Simmer for at least 1 hour, stirring occasionally to prevent sticking to pan. Spray a 13X9 baking dish with nonstick cooking spray. Prepare one chimichanga a time, by placing a handful of shredded cheese, shredded pork and one diced tomato inside of eachtortilla, and roll into a burrito. Place in baking dish and continue until all shredded pork is used. Should use about 6 tortillas. Spray the top of your chimichangas with nonstick cooking spray. This makes the tortillas crispy. You also top with cheese. Bake 15-20 minutes. Remember to keep checking. Once your chimichangas are done, plate with Spanish rice, refried beans, then serve with green chili on top. Serve with favorite sides."
  ],
  "ingredients": [
    "0",
    "2-3 lbs\tPork Roast",
    "1\tLarge Onion",
    "6\tGarlic Cloves, minced",
    "6 Tbsp\tFlour",
    "2 cups\tDiced Green Chilies",
    "3\tLarge Tomatillos",
    "1× 15 oz can\tTomatoes",
    "2-4 tsp\tJalapenos",
    "5 cups\tChicken Broth",
    "2 Tbsp\tGround Cumin",
    "2 Tbsp\tGround Chili Powder",
    "6\tLarge Flour Tortillas",
    "1 Tbsp\tAdobo Seasoning",
    "1 tsp\tGarlic Salt",
    "Kosher Salt & Pepper, to taste",
    "Mexican Oregano",
    "1 tsp\tGround Red Pepper"
  ],
  "__v": 1
}