{
  "hash": "e9c0228d947906a758c25f522909d83ca2869069",
  "title": "Best Basic Pizza Dough Recipe",
  "image": "http://i0.wp.com/www.foodrepublic.com/wp-content/uploads/2015/03/Grandma-Pie.jpg?resize=800%2C%20450",
  "href": "http://www.foodrepublic.com/recipes/best-basic-pizza-dough-recipe/",
  "extension": "Chrome",
  "firstAdded": "2015-07-04T08:17:13.580000",
  "users": [
    null
  ],
  "keywords": [
    "active",
    "dry",
    "yeast",
    "sugar",
    "olive",
    "oil",
    "brushing",
    "bowl",
    "dough",
    "ball",
    "crust",
    "kosher",
    "salt",
    "purpose",
    "flour",
    "dusting",
    "work",
    "surface",
    "slightly",
    "water"
  ],
  "directions": [
    "0",
    "Directions",
    "In the bowl of a mixer fitted with a dough hook, pour the warm water in and sprinkle with yeast. Let stand until foamy, about 5 minutes. *Do not use hot water or it will kill the yeast and your dough will not rise.",
    "Add the sugar, oil, and salt into yeast mixture.",
    "With the mixer on low, slowly add the flour and mix until a dough ball forms. You may want to transfer to a floured work surface and knead by hand until a smooth ball comes together. Transfer dough to an oiled bowl and brush top with oil. Cover bowl with plastic wrap and set aside in a warm area for about an hour. The dough should double in size.",
    "Cut the dough in half. Place both pieces on a floured work surface and gently knead. You can roll one piece out now into a 12- inch round.",
    "To cook now, top with your favorite toppings. Brush the exposed dough with olive oil and place in a 450 degree oven on a pizza stone (if you have one) for 12 to 15 minutes until the dough is golden brown.",
    "To freeze the second piece, wrap the dough in plastic and place it in a resealable freezer bag for up to 3 months."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1\tpacket\tactive dry yeast",
    "1\ttablespoon sugar",
    "2\ttablespoons\tolive oil, plus more for brushing bowl, dough ball and crust",
    "1\tteaspoon\tkosher salt",
    "3\tcups\tall- purpose flour, plus more for dusting your work surface",
    "1\tcup\tslightly warm water"
  ],
  "__v": 1
}