{
  "hash": "c10fbb886aa2a37b60a7cb5efcf609c12ea471c7",
  "title": "Sweet Hot Mustard",
  "image": "",
  "href": "http://www.chowhound.com/recipes/sweet-hot-mustard-11105",
  "extension": "Chrome",
  "firstAdded": "2016-11-03T22:36:31.874000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "SUMMARY",
    "Is Your Green Smoothie Making You Fat? Sponsored by NutriBullet",
    "Making your own mustard is easy and allows you to customize the flavor. This version is a honey and beer mustard that’s sweet but has a big kick of heat. Try it with our Soft Pretzel Rolls or atop your next grilled cheese.",
    "What to buy: We used Colman’s mustard powder for this recipe. It can be found at most grocery stores.",
    "Game plan: This mustard is usable after 24 hours, but it mellows the longer it sits. We like it best after 5 to 7 days. It will last up to a month in the refrigerator.",
    "This recipe was featured as part of our Oktoberfest Food photo gallery.",
    "by Aida Mollenkamp",
    "INSTRUCTIONS",
    "1Whisk together mustard powder and 1/4 cup of the beer or water in a small heatproof bowl and let sit at room temperature for at least 10 minutes. Meanwhile, bring 1 inch of water to a simmer in a small pot.",
    "2Add vinegar, garlic, brown sugar, honey, and salt to mustard mixture and whisk to combine. Place the bowl over the simmering water (the bowl shouldn’t touch the water) and cook, stirring frequently, until the mustard is slightly thickened and yellow-brown and the taste has mellowed a little, about 7 to 10 minutes.",
    "3Whisk in remaining beer or water to thin out the mustard, cover, and immediately refrigerate. Keep refrigerated at least 24 hours before using."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS (7)",
    "1/2 cup mustard powder",
    "1/4 cup plus 1 tablespoon light beer or water",
    "2 tablespoons white wine vinegar",
    "1 medium garlic clove, minced (about 1/2 teaspoon)",
    "2 tablespoons packed dark brown sugar",
    "2 teaspoons honey",
    "1/2 teaspoon kosher salt"
  ],
  "__v": 1
}