{
  "hash": "e921309ed9b927966d3a7c7d6f4eae85b93b6c7d",
  "title": "Baby Peas with Bacon and Crispy Leeks",
  "image": "http://cdn-image.foodandwine.com/sites/default/files/styles/200x250/public/200411-r-bacon-leek-baby-peas.jpg?itok=QwKHEsGJ",
  "href": "http://www.foodandwine.com/recipes/baby-peas-with-bacon-and-crispy-leeks",
  "extension": "Chrome",
  "firstAdded": "2015-05-08T19:08:52.676000",
  "users": [
    null
  ],
  "keywords": [
    "leeks",
    "white",
    "tender",
    "green",
    "parts",
    "crosswise",
    "separated",
    "rings",
    "oil",
    "frying",
    "salt",
    "pepper",
    "slices",
    "thickcut",
    "bacon",
    "thyme",
    "sprigs",
    "rich",
    "turkey",
    "stock",
    "lowsodium",
    "chicken",
    "broth",
    "cream",
    "boxes",
    "frozen",
    "baby",
    "peas",
    "thawed",
    "cornstarch",
    "mixed",
    "water"
  ],
  "directions": [
    "0",
    "Wash the leeks well and pat dry. In a large saucepan, heat 1/2 inch of oil until shimmering. Add all but 1/2 cup of the leeks and cook over moderate heat, stirring, until golden brown, 10 to 12 minutes. Using a slotted spoon, transfer the leeks to a paper towel–lined plate. Discard the oil. Season with salt and pepper.",
    "In a large, deep skillet, cook the bacon over moderately high heat, turning once, until golden, about 5 minutes. Drain the bacon on paper towels and crumble.",
    "Add the remaining 1/2 cup of leeks and the thyme to the fat in the skillet and cook over moderately low heat until the leeks are softened, about 8 minutes. Add 1/2 cup of the Rich Turkey Stock and cook over moderate heat until it is reduced by half, about 7 minutes. Add the heavy cream and cook over moderately high heat until it is reduced by half, about 5 minutes. Stir in the peas, crumbled bacon and the remaining 1/2 cup of stock and bring to a boil. Discard the thyme sprigs. Season with salt and pepper. Add the cornstarch mixture and cook until the sauce is slightly thickened, 3 to 4 minutes. Transfer the peas to a bowl and top with the crispy leeks just before serving."
  ],
  "ingredients": [
    "0",
    "3 large leeks, white and tender green parts only, sliced crosswise 1/4 inch thick and separated into rings",
    "Vegetable oil, for frying",
    "Salt and freshly ground pepper",
    "6 slices thick-cut bacon",
    "4 thyme sprigs",
    "1 cup Rich Turkey Stock or low-sodium chicken broth",
    "3/4 cup heavy cream",
    "Three 10-ounce boxes frozen baby peas, thawed",
    "1 teaspoon cornstarch mixed with 1 tablespoon water"
  ],
  "__v": 1
}