{
  "hash": "04be7cf0049a746f5a34481b08ed2554c6bd03c9",
  "title": "Cod in Creamy Red Roasted Pepper Sauce",
  "image": "",
  "href": "http://www.littlebroken.com/2015/01/21/cod-in-creamy-red-roasted-pepper-sauce/",
  "extension": "Chrome",
  "firstAdded": "2016-10-31T02:25:02.530000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium skillet over medium heat, cook peppers, garlic, and basil in olive oil for 10 minutes, stirring occasionally, until flavors come together.",
    "Transfer the pepper mixture to a food processor and puree until smooth.",
    "Return the mixture to the same skillet and bring to a simmer; stir in cream, cheese, and season with salt and pepper to taste; simmer for 5 minutes, stirring; set aside.",
    "1",
    "Layer the veggies on a bottom of a large baking dish (about size of 9X13 maybe a little smaller- I used a round baking dish). Season lightly with salt and pepper. Top with single layer of cod fillets; season the cod with salt/pepper and sprinkle with fresh parsley.",
    "Pour the red pepper sauce over the cod and veggies.",
    "Bake, uncovered in a 350F oven for 30-40 minutes until the fish is flaky and veggies are tender.",
    "Sprinkle with fresh chopped parsley. Serve immediately."
  ],
  "ingredients": [
    "0",
    "12 oz. jar whole roasted red peppers, drained and chopped (or you can purchase already chopped roasted red peppers)",
    "2 Tbsp. minced garlic (about 6 medium cloves)",
    "2 Tbsp. chopped fresh basil",
    "3 Tbsp. olive oil",
    "1¼ cup light cream",
    "¼ cup grated Parmigiano-Reggiano cheese",
    "salt and pepper",
    "1",
    "2 lbs. cod fillets, cut into serving pieces (I had 2 fillets and was able to cut into 2-3 pieces each)",
    "1 small zucchini, cut into matchsticks",
    "1 small yellow squash, cut into matchsticks",
    "½ red onion, sliced",
    "1 Tbsp. fresh chopped parsley, plus extra for garnish",
    "salt and pepper"
  ],
  "__v": 1
}