{
  "hash": "b62d389ddcf13a4cd8895da1c9483f8678babdc5",
  "title": "Brownie Ice Cream Cake with Fudge Sauce Recipe",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2019/06/Brownie-Ice-Cream-Cake-LEAD-2.jpg",
  "href": "https://www.simplyrecipes.com/recipes/brownie_ice_cream_cake_with_fudge_sauce/",
  "extension": "Chrome",
  "firstAdded": "2020-02-01T20:25:34.463000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare the oven: Preheat the oven to 325°F. Grease and line a 10-inch springform pan with parchment.",
    "Make the brownie base: Prepare the brownie batter according to the recipe, then spread it into the prepared springform pan. Bake for 20-25 minutes, or until the brownie is done, and a toothpick inserted in the center comes out with a few moist crumbs.",
    "Cool and freeze the brownie base: Remove from the oven and cool on a rack. Once cooled, place in the freezer for about 1 hour. We are freezing the brownie and pan together so both are very cold when we add the ice cream layers.",
    "Crush the cookies: Put the Oreos in a ziptop bag, seal it, then smash them with a wooden spoon or rolling pin until you have chunks that range in size from small fragments to chunks the size of dimes and nickels.",
    "Prepare the ice cream layer: About 15 minutes before the brownie layer is done freezing, let the ice cream stand at room temp for about 10 minutes until it’s soft enough to scoop but isn’t so soft that it is melting. Scoop the ice cream into the bowl of a stand mixer and beat with the paddle until the ice cream is an even texture and soft enough to spread.",
    "You can also let the ice cream soften a little more and mix it by hand. The mixing helps homogenize the texture and makes the ice cream easier to spread, while also making sure you don’t get weird, icy spots when it refreezes.",
    "6 Add the ice cream layer and freeze: Spread half of the ice cream over the frozen brownie, top with the crushed cookies, and spread the remaining ice cream over the top. Freeze for about 5 hours or until solid.",
    "7 Make the fudge: While the cake freezes, make the fudge sauce. In a medium microwave-safe bowl, combine the condensed milk, chocolate, and water.",
    "Microwave on high for 30-second intervals, stirring between each until the fudge is smooth. Stir in a pinch of salt and let the fudge cool to room temperature. Cover and keep it in the refrigerator until ready to spoon over the cake.",
    "8 Unmold the cake: Once the cake has frozen, remove the springform collar. I use a hair dryer to do this: I just point it about 2-3 inches away from the outside of the pan, and rotate the pan. This melts the outside just enough to remove the collar. You can also use a paring knife to loosen the cake from the pan, and place it on a serving dish.",
    "9 Top with fudge: The fudge will have thickened, but it should still be spreadable. Pour about 1/2 to 3/4 cup cooled fudge onto the center of the cake. Use a spoon or spatula to gently push it to the edges until the top is completely covered and some fudge drips down the side.",
    "Add more fudge if necessary. Serve the cake immediately after topping with the fudge.",
    "Alternatively, you can top the cake with the fudge and freeze it again. The fudge will not be saucy, but it will take on a truffle-like texture once frozen.",
    "10 Cut and serve: Dip a knife in hot water. Dry the blade, then cut the cake into slices. Freeze any leftover cake slices wrapped well in plastic."
  ],
  "ingredients": [
    "0",
    "For the ice cream cake:",
    "1 box of brownie mix (or favourite brownie recipe), made as instructed but baked in a springform pan",
    "1 gallon vanilla ice cream, or any flavor you like",
    "6 ounces Oreo cookies, crushed (about 15 cookies)",
    "For the fudge sauce (Makes 2 cups):",
    "1 (14 oz) can sweetened condensed milk",
    "5 ounces bittersweet chocolate, chopped (or chips)",
    "1/4 cup water",
    "Pinch of kosher salt"
  ],
  "__v": 2
}