{
  "hash": "e50520690c5dcfce85b923dd7fe21d5214faebd9",
  "title": "Kürbis-Gnocchi",
  "image": "http://www.veganguerilla.de/wp-content/themes/bigcity/shortcodes-ultimate/lib/timthumb.php?src=http://www.veganguerilla.de/wp-content/uploads/2013/10/IMG_9676.jpg&h=420&w=630&zc=0",
  "href": "http://www.veganguerilla.de/kuerbis-gnocchi/",
  "extension": "Firefox",
  "firstAdded": "2016-10-13T17:13:06.220000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Den Ofen auf 200°C vorheizen.",
    "Den Kürbis, abhängig von der Sorte die ihr verwendet, vorher schälen und im Anschluss in Stückchen schneiden. In eine Auflaufform geben und mit den Knoblauchzehen (geschält, am Stück), etwas Öl sowie Salz vermengen. In den Ofen geben und garen bis der Kürbis weich ist (je nach der Größe die eure Kürbisstücke haben variiert die Zeit hier, nach spätestens 20 Minuten sollte das Ganze jedoch erledigt und der Kürbis gar sein). Die Kürbisstückchen etwas abkühlen lassen (bis ihr sie mit der Hand anfassen könnt).",
    "Knoblauch heraus nehmen und zerhacken. Zusammen mit dem Kürbis und dem Mehl in eine Schale geben und vermengen. Das Mehl nach und nach hinzugeben und verkneten, bis ihr eine gleichmäßige Masse habt. Die Menge kann je nach verwendeter Mehlsorte variieren – einfach so viel benutzen, bis die Masse nicht mehr an den Fingern klebt und sich daraus gut Gnocchi formen lassen.",
    "Den Ofen auf 200°C vorheizen. Wasser in einem großen Topf zum köcheln bringen, etwas Salz hinzugeben.",
    "Die Cherrytomaten mit etwas Öl, Salz und Oregano in eine Auflaufform geben und vermengen. Die Auflaufform mit den Tomaten in den Ofen geben bis sie gar sind und beginnen aufzuplatzen.",
    "Die Gnocchi in das köchelnde Wasser geben. Wenn sie an der Oberfläche schwimmen sind sie gar und können herausgefischt werden. Wer möchte kann die Gnocchi im Anschluss noch in einer Pfanne mit etwas Öl anbraten – ist aber kein Muss und schmeckt auch ohne.",
    "Etwas frische Petersilie hacken, mit den Gnocchi und Tomaten vermengen – fertig!"
  ],
  "ingredients": [
    "0",
    "1 (gehäufte) Tasse voll Kürbis (entspricht 1 kleinem Kürbis in Stückchen geschnitten. Habt ihr mehr oder weniger einfach die Menge des Mehls variieren! Ich hab das Rezept bisher nur mit Butternut und Delicia Kürbissen ausprobiert, andere Sorten sollten aber ebenso gut funktionieren)",
    "ca. 1/2 Tasse Mehl",
    "2 Knoblauchzehen",
    "Salz",
    "etwas Öl",
    "Oregano",
    "ca. 200g Cherrytomaten",
    "frische Petersilie"
  ],
  "__v": 3
}