{
  "hash": "03c5dca4c8b37f20caab0c3b792067dacfa4b6d3",
  "title": "SKILLET CHIPOTLE SHRIMP",
  "image": "http://www.thecookierookie.com/wp-content/uploads/2017/02/skillet-chipotle-shrimp-2-of-8.jpg",
  "href": "http://www.thecookierookie.com/skillet-chipotle-shrimp/",
  "extension": "Chrome",
  "firstAdded": "2017-07-05T23:51:55.356000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Preheat oven to 200 degrees F. Stack the tortillas, wrap them in foil then place in the oven to warm while preparing the shrimp.",
    "In a food processor, place the tomatoes, chilies (plus sauce clinging from them) and ¾ teaspoon kosher salt. Pulse 1 minute or until almost smooth. (NOTE** Only half of the sauce will be used in this recipe. The remaining sauce should be frozen for later use.)",
    "In a 12-inch nonstick skillet, heat 2 tablespoons oil over medium-high heat just until it begins to smoke. Add half the shrimp and cook 45 seconds, turning often. Transfer the cooked shrimp to a bowl and repeat with the remaining shrimp. Place the remaining cooked shrimp in the bowl and mix with 2 tablespoons of the lime juice.",
    "Turn the heat to medium-high and add the remaining 2 tablespoons oil to the skillet. Add the onion and sauté for 3-4 minutes; add garlic and oregano and cook just until it begins to brown, about 1 minute. Stir in the wine and the leftover shrimp juice from the bowl. Cook until liquid is nearly evaporated. Turn heat to low and add half of the prepared chipotle sauce. Simmer, stirring, until the mixture thickens enough to coat the back of a spoon, approximately 10-12 minutes.",
    "Remove the skillet from the heat and add the shrimp; stir gently. Cover and let sit until the shrimp are opaque and cooked through, 2-4 minutes. Add the cilantro and remaining lime juice, stir. Taste, then season with salt and pepper, if needed.",
    "Serve with warmed tortillas, slices of avocado, sour cream or Mexican crema and lime wedges."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 (14.5 oz) can Fire-Roasted Tomatoes",
    "2-4 chipotle chilies in adobo sauce, plus the sauce clinging to them",
    "Kosher salt",
    "Freshly ground black pepper",
    "¼ cup olive oil",
    "1½ lb. extra-large raw shrimp; peeled, deveined, tails removed and patted dry",
    "¼ cup fresh lime juice, divided",
    "½ medium sweet yellow onion, diced",
    "4 garlic cloves, peeled and minced",
    "½ teaspoon dried oregano",
    "¼ cup dry white wine",
    "½ cup chopped cilantro, plus extra for garnish",
    "For serving:",
    "8 (6-inch) corn tortillas, warmed",
    "avocado slices",
    "sour cream or Mexican crema",
    "lime wedges"
  ],
  "__v": 1
}