{
  "hash": "a71ca8fcc2bb0e7cfb53136cbc53f0d6a07bb1b4",
  "title": "TASTY MUSHROOM & TOMATO SKILLET FRITTATA",
  "image": "",
  "href": "http://breakfast.betterrecipes.com/tasty-mushroom-and-tomato-skillet-frittata.html",
  "extension": "Chrome",
  "firstAdded": "2015-10-12T14:10:44.813000",
  "users": [
    null
  ],
  "keywords": [
    "eggs",
    "salt",
    "black",
    "pepper",
    "parmesan",
    "cheese",
    "olive",
    "oil",
    "medium",
    "onion",
    "red",
    "bell",
    "mushrooms",
    "cherry",
    "tomatoes",
    "parsley",
    "oregano"
  ],
  "directions": [
    "0",
    "In a mixing bowl, whisk the eggs, salt, and black pepper together vigorously to beat out a lot of the air to create a fluffier texture for the frittata. Gently mixed in the sliced tomato, yellow and green peppers and parmesan cheese. Set aside. Grease sides and bottom of on oven-proof skillet with olive oil and heat over medium-high heat. Once hot, add a bit more olive oil in pan and toss in sliced onion. Sauté for 5 minutes until onion is soft. Turn heat down to medium-low and add egg mixture with mushrooms, red pepper, and tomatoes into skillet. As mixture cooks, use a spatula to gently lift cooked edges to allow uncooked eggs to run down to bottom of skillet. Once eggs begin to set around edges, about 5 minutes. Lower heat to low, cover the skillet and cook for 5-8 minutes. As it cooks, occasionally shake the skillet to loosen edges a little. When eggs are just about set (top will be slightly runny) turn off stove, and sprinkle on chopped fresh herbs. Turn the oven broil on and place skillet in oven. Broil for 3-4 minutes or until frittata is lightly brown and fluffy. Remove from oven and loosen with a gentle shake of the pan. Serve."
  ],
  "ingredients": [
    "0",
    "6\tLarge Eggs",
    "Salt",
    "Ground Black Pepper",
    "½ cup\tParmesan Cheese, grated",
    "2 Tbsp\tOlive Oil",
    "½\tMedium Onion, sliced",
    "1\tRed Bell Pepper, sliced",
    "1 cup\tMushrooms, sliced",
    "1½ cup\tCherry Tomatoes, cut in half",
    "Parsley, chopped",
    "Oregano, chopped"
  ],
  "__v": 1
}