{
  "hash": "85b2bf95959359749bdc01e7c5bfe76a1b1ae6a8",
  "title": "GEVULDE PUNTPAPRIKA'S MET QUINOASALADE",
  "image": "http://www.hapjesprinces.be/wp-content/uploads/2016/11/gevulde-puntpaprikas-met-quinoa-3-683x1024.jpg",
  "href": "http://www.hapjesprinces.be/gevulde-puntpaprikas-quinoasalade/",
  "extension": "Chrome",
  "firstAdded": "2016-12-12T22:01:57.688000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Verwarm de oven voor tot 200°C.",
    "Spoel de quinoa en doe hem in een pot en voeg een dubbele hoeveelheid groentebouillon toe. Breng de zaadjes aan de kook. Als je merkt dat alle vocht is opgeslorpt, kan je eventueel nog wat water bij doen als de quinoa nog niet helemaal klaar is.",
    "Snij de zoete puntpaprika’s overlangs in twee. Voor de decoratie mag het steeltje eraan blijven. Verwijder de zaadjes en leg de halve vruchten in een ovenschaal. Druppel er een beetje olijfolie over en gaar ze gedurend 10 minuten in de oven van 200 °C, tot ze zachter zijn, maar tegelijk nog knapperig. (Hou de oven warm.)",
    "Rooster de pijnboompitten goudbruin in een droge koekenpan (Schud de pitten regelmatig op en hou ze goed in de gaten.) Spoel de peterselie en de kervel schoon en laat de kruiden uitlekken. Pluk de taaiste stelen weg en snij de blaadjes matig fijn. Doe ze in een mengschaal en knijp er vers citroensap overheen. Pel de look en plet de teen tot pulp. Voeg de lookpulp en de pijnboompitten toe.",
    "Verbrokkel ook de feta in de kom. Meng alles en roer er de gare quinoa doorheen. (De feta zal een beetje wegsmelten in het mengsel.) Kruid de salade met versgemalen peper en wat zout. Voeg naar persoonlijke smaak extra citroensap toe.",
    "Vul de halve puntpaprika’s met een portie van de quinoasalade met feta en kruiden.",
    "Zet de ovengrill op.",
    "Strooi over elke gevulde puntpaprika een laagje panko. Druppel er nog een likje olijfolie overheen en schuif ze onder de hete grill, gedurende zo’n 10 minuten. (Tot ze een krokant korstje hebben.)",
    "Tip: Serveer de gevulde puntpaprika’s met een rucolasla."
  ],
  "ingredients": [
    "0",
    "- 2 puntpaprika's",
    "- 4 dl groentenbouillon",
    "- 200 g Griekse feta",
    "- 150 g quinoa",
    "- 1 teentje look",
    "- ½ citroen",
    "- 1 bussel fijne kervel",
    "- ½ bussel platte peterselie",
    "- 60 g pijnboompitten",
    "- 4 eetlepels panko (grof Japans paneermeel)",
    "- scheutje olijfolie",
    "- peper & zout"
  ],
  "__v": 1
}