{
  "hash": "d9864ceafc3b1bec45378688725971d4b6ecd0ca",
  "title": "Cornbread And Sausage Stuffing",
  "image": "",
  "href": "http://www.marthastewart.com/337095/cornbread-and-sausage-stuffing",
  "extension": "Chrome",
  "firstAdded": "2016-10-28T15:58:54.131000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "Preheat oven to 350 degrees. In a large nonstick skillet, cook sausage (and giblets, if using) over medium-high heat, stirring often, until browned and cooked through, 5 to 8 minutes. With a slotted spoon, transfer to a large bowl.",
    "To pan, add onion, celery, and 1/4 cup water. Reduce heat to medium; cook, scraping up browned bits with a wooden spoon, until vegetables soften, about 10 minutes. Season generously with salt and pepper. Add to sausage.",
    "Add cornbread, sage, and eggs to sausage and vegetables. Bring broth to a simmer in a small saucepan; pour 1/2 cup over stuffing, and toss gently (cornbread will break down into smaller pieces). If needed, add up to 1/2 cup more broth, until stuffing feels moist, but not wet. Stuff into turkey, using about 4 cups. Spoon remaining stuffing into a baking pan; it should reach the top. Refrigerate stuffing in pan and remaining broth separately, covered, until ready to bake.",
    "COOK'S NOTES",
    "If you aren't planning on cooking the stuffing inside the turkey, pour all the chicken broth over the entire amount of stuffing, and transfer to a large baking dish."
  ],
  "ingredients": [
    "0",
    "Cornbread And Sausage Stuffing",
    "Some cooks like to add diced giblets (heart, gizzard, and liver) to the stuffing for an extra meaty taste.",
    "PREP: 40 MINS TOTAL TIME: 1 HOUR 40 MINS SERVINGS: 10",
    "13.2 k",
    "SHARES",
    "PHOTOGRAPHY: DAVID LOFTUS",
    "SOURCE: EVERYDAY FOOD, NOVEMBER 2005",
    "ON SALE",
    "What's on sale near to you",
    "Hmm. Looks like these ingredients aren't on sale today",
    "INGREDIENTS",
    "1 pound fresh pork sausage, casings removed, crumbled (plus giblets, diced; optional)",
    "1 large onion, (about 2 cups), finely chopped",
    "3 celery, finely chopped (1 1/2 cups)",
    "Coarse salt and ground pepper",
    "2 pounds prepared cornbread, cut into 3/4-inch cubes (12 cups)",
    "3 tablespoons finely chopped fresh sage",
    "3 large eggs, lightly beaten",
    "1 to 2 cups reduced-sodium chicken broth"
  ],
  "__v": 1
}