{
  "hash": "62c8743e892adf6fd6e653ff82b222c6713c2def",
  "title": "Slow Cooker Rosemary Bread",
  "image": "https://img.buzzfeed.com/tasty-app-user-assets-prod-us-east-1/tips/d79eb9c0ec44471ea2a8465ba263d87e.jpeg?output-quality=auto&downsize=180:*",
  "href": "https://tasty.co/recipe/slow-cooker-rosemary-bread?fbclid=IwAR0CZurXo3wRicS7CWYu0SMxFOyyH4jRVaRBG_7IM4L_GJjzO5LdJ7gQc10",
  "extension": "Chrome",
  "firstAdded": "2019-03-17T17:55:39.383000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large bowl, mix together the water and sugar. Sprinkle the yeast over the water and stir. Let sit for 15 minutes, until the surface is foamy.",
    "Add the salt, olive oil, and rosemary. Mix well.",
    "Slowly add the flour and mix with a wooden spoon until well combined.",
    "Knead the dough for at least 10 minutes, until it is no longer sticky.",
    "Set the dough in the middle of a piece of parchment paper large enough to line the slow cooker.",
    "Place the parchment paper with the dough in the slow cooker. Drape a kitchen towel over the top and cover with the lid. Set the slow cooker to warm and let the dough proof for about 30 minutes, until doubled in size. Check occasionally to make sure the dough is not cooking.",
    "Lift the parchment paper to remove the dough from the slow cooker.",
    "Sprinkle a bit of flour on a clean surface. Knead the dough for about 5 minutes, then shape it into a ball that will fit in the slow cooker.",
    "Place the dough back on the parchment paper and return to the slow cooker. Sprinkle the top with salt and rosemary.",
    "Cover the slow cooker with the towel and the lid and cook on high heat for 1½-2 hours, until the bread has a thick, dry, white crust, or a thermometer inserted in the loaf reaches 190°F (90°C).",
    "Preheat the oven to 500°F (260°C).",
    "Using the parchment paper, transfer the bread to a baking sheet. Trim the excess parchment.",
    "Bake for 5-10 minutes, until the crust is golden brown.",
    "Let cool for about 15 minutes, then slice.",
    "Enjoy!"
  ],
  "ingredients": [
    "0",
    "for 1 loaf",
    "1 ¼ cups lukewarm water",
    "1 teaspoon sugar",
    "1 packet active dry yeast, about 2 1/4 teaspoons",
    "1 teaspoon salt, plus more for sprinkling",
    "3 tablespoons olive oil",
    "2 tablespoons fresh rosemary, chopped, plus more for sprinkling",
    "3 ¾ cups all-purpose flour, plus more for dusting"
  ],
  "__v": 1
}