{
  "hash": "cfe9744220930fb23e9e665848bb24ed07ae5dc5",
  "title": "Black-Eyed Peas",
  "image": "https://tastykitchen.com/recipes/wp-content/uploads/sites/2/2011/12/hoppin-420x280.jpg",
  "href": "https://thepioneerwoman.com/cooking/black-eyed-peas/",
  "extension": "Firefox",
  "firstAdded": "2019-07-14T23:24:45.243000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "(Soak black-eyed peas in cool water for at least 6 hours. Rinse before using.)",
    "Heat butter in a large pot over medium-high heat. Add onion, garlic, green pepper, and celery and stir. Cook for 3 to 4 minutes. Stir in soaked beans, then add chicken broth, ham hock, salt & pepper, and cayenne to taste. Bring to a boil, then reduce heat and cover the pot for 30 minutes.",
    "After 30 minutes, check the liquid level; if it's too soupy, cook with the lid off for another 15 minutes or so. If it's too thick, splash in a little more broth.",
    "Stir in vinegar, then taste for seasonings. Add more spice if needed.",
    "Serve over white or brown rice, making sure to get plenty of the cooking liquid spooned over the top. Or, you may mix the bean mixture with the rice before serving.",
    "Variations: add red bell pepper, canned diced tomatoes, diced jalapenos, diced ham (instead of ham hocks), or sliced bacon (instead of ham hocks). Stir in torn-up kale when 5 minutes of cooking time remain.",
    "Variation: use canned, drained black-eyed peas if preferred. Just use diced ham instead of ham hock and a little less broth, as peas won't need to cook as long."
  ],
  "ingredients": [
    "0",
    "4 Tablespoons Butter",
    "1 whole Large Onion, Diced",
    "4 cloves Garlic, Minced",
    "1 whole Green Bell Pepper, Diced",
    "2 stalks Celery, Diced",
    "4 cups Soaked Black-eyed Peas",
    "5 cups Low-sodium (or No-sodium) Chicken Broth",
    "1 whole Ham Hock",
    "Salt And Pepper, to taste",
    "Cayenne Pepper To Taste",
    "2 Tablespoons White Vinegar",
    "White Or Brown Rice, For Serving"
  ],
  "__v": 1
}