{
  "hash": "e3089475f677cc0bc88254de618f6e1e389f3662",
  "title": "MUSSELS AND FENNEL IN ALE",
  "image": "",
  "href": "http://theyearinfood.com/2011/03/mussels-and-fennel-in-ale.html",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T22:28:37.363000",
  "users": [
    null
  ],
  "keywords": [
    "mussels",
    "shells",
    "medium",
    "fennel",
    "bulb",
    "cored",
    "bottle",
    "belgian",
    "ale",
    "shallots",
    "garlic",
    "butter",
    "dijon",
    "mustard",
    "parsley",
    "cream",
    "used",
    "salt",
    "pepper"
  ],
  "directions": [
    "0",
    "It’s important to use mussels the same day that you buy them. Just before you begin, carefully place the mussels in a large bowl of cold water for about ten minutes. Scrub the mussels to remove any debris attached to their shells. Debeard them by either yanking the beard or slicing with a knife. If any mussels are open, tap them against the counter to urge them closed. If they remain open after a minute or two, they aren’t alive and should be discarded. Likewise discard any mussels whose shells are cracked or broken. When you place the mussels in the broth, you want to make sure that they all begin closed.",
    "Heat a large pot over a medium flame. Add the tablespoon of butter. Add the fennel, shallots and garlic and stir. Saute them for about 4-5 minutes, stirring occasionally to prevent anything from browning. When the fennel has started to soften, add the ale, mustard and parsley, along with salt and pepper to your liking. Bring to a boil, then reduce to a simmer.",
    "At this time, add the mussels. Again, make sure that they are all closed at this point. Cover and let them steam for about 5 minutes. When the mussels have opened wide, they are cooked. Remove them with a slotted spoon as they do so. Discard any mussels that don’t open.",
    "When all the mussels are opened, turn off the heat. Stir in the two tablespoons cream. Add the broth to the mussels and serve in a large bowl, or divided amongst two or three smaller bowls. And have plenty of bread on hand!"
  ],
  "ingredients": [
    "0",
    "1.5-2 pounds mussels in shells",
    "1 medium fennel bulb, cored and sliced",
    "1 12 ounce bottle Belgian ale",
    "3 medium shallots, sliced",
    "2 cloves garlic, minced",
    "1 tablespoon butter",
    "1 teaspoon Dijon mustard",
    "2 tablespoons fresh parsley, chopped",
    "2 tablespoons cream (I used half and half)",
    "salt +pepper to taste"
  ],
  "__v": 1
}