{
  "hash": "bfcd8dd03c4ef6e4323d9587040f9a4fbb902dad",
  "title": "Panko Crusted Pork Tenderloin with Dijon Cream Sauce",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2014/10/panko-crusted-pork-dijon-vertical-2.jpg",
  "href": "http://www.simplyrecipes.com/recipes/panko_crusted_pork_tenderloin_with_dijon_cream_sauce/",
  "extension": "Chrome",
  "firstAdded": "2015-03-20T12:45:12.245000",
  "users": [
    null
  ],
  "keywords": [
    "pork",
    "tenderloin",
    "buttermilk",
    "dijon",
    "mustard",
    "brown",
    "sugar",
    "kosher",
    "salt",
    "panko",
    "breadcrumbs",
    "olive",
    "oil",
    "black",
    "pepper",
    "butter",
    "shallot",
    "tbps",
    "clove",
    "garlic",
    "cream",
    "parsley"
  ],
  "directions": [
    "0",
    "1 Combine the marinade ingredients (buttermilk, Dijon mustard, brown sugar, salt) in a medium bowl. Add the pork tenderloin to the marinade. Cover with plastic wrap and refrigerate for at least one hour, or up to overnight. Remove the pork tenderloin from the refrigerator an hour before you intend to cook it.",
    "2 Heat a thick-bottomed sauté pan on medium high heat. Add the panko breadcrumbs to the pan. Lower the heat to medium and slowly toast the panko breadcrumbs until golden brown. Remove from heat. Stir the olive oil, salt, and pepper into the panko breadcrumbs until they are well coated.",
    "3 Preheat the oven to 375°F. Line a roasting pan with aluminum foil and place a baking rack or roasting rack over it. Place the toasted panko in a shallow bowl for dredging. Remove the pork tenderloin from the buttermilk marinade and place it in the bowl of breadcrumbs. Dredge the tenderloin in the breadcrumbs, pressing the tenderloin firmly into the crumbs as you roll it to help the crumbs adhere.",
    "4 Place the breaded tenderloin on the baking rack and bake at 375°F for 30 to 40 minutes, until the internal temperature is 145°F. (Please note that the USDA now recommends that pork be cooked to 145°F, meaning the cooked pork will be a little pink, and that's perfectly okay.) Remove the pork from the oven when done and let rest on the rack for 10 to 15 minutes while you make the sauce.",
    "5 To make the sauce, melt a tablespoon of butter in a shallow saucepan. Add the minced shallots and cook on medium heat until softened, about 3 to 4 minutes. Add the minced garlic and cook a minute more. Add one cup of cream, the mustard, salt, and pepper to the shallots. Stir to combine and let come to a simmer. Simmer gently until slightly thickened, 2 to 3 minutes. Stir in 1 Tbsp of chopped parsley. Set aside until ready to serve. (If you need to reheat the sauce to serve and it has thickened up, loosen it with a little water while you reheat.)",
    "6 Gently transfer the pork tenderloin to a cutting board and slice into 1/2-inch thick medallions. Place sauce on a serving platter and place the pork medallions on top of the sauce. Sprinkle everything with chopped parsley."
  ],
  "ingredients": [
    "0",
    "1 1/4 to 1 1/2 pound pork tenderloin",
    "3/4 cup buttermilk",
    "1 Tbsp Dijon mustard",
    "1 Tbsp brown sugar",
    "1 teaspoon kosher salt",
    "1 cup panko breadcrumbs",
    "1 Tbsp olive oil",
    "1/2 teaspoon kosher salt",
    "1/4 teaspoon freshly ground black pepper",
    "1 Tbsp butter",
    "1 small shallot, minced (about 1 to 2 Tbps)",
    "1 small clove garlic, minced (about 1 teaspoon)",
    "1 cup cream",
    "1/2 teaspoon Dijon mustard",
    "1/4 teaspoon kosher salt",
    "A pinch of black pepper",
    "2 Tbsp finely chopped fresh parsley"
  ],
  "__v": 1
}