{
  "hash": "a812f114b799848067ea33bc48ea07b4ed913739",
  "title": "Cheesy Sausage Rigatoni",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2015/6/19/2/WU1012H_Cheesy-Sausage-Rigatoni_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/ree-drummond/cheesy-sausage-rigatoni.html",
  "extension": "Firefox",
  "firstAdded": "2015-07-04T04:12:19.231000",
  "users": [
    null
  ],
  "keywords": [
    "rigatoni",
    "onion",
    "olive",
    "oil",
    "italian",
    "sausage",
    "red",
    "pepper",
    "jars",
    "marinara",
    "balls",
    "mozzarella",
    "cubes",
    "parmesan",
    "parsley"
  ],
  "directions": [
    "0",
    "Bring a large pot of water to a boil. Cook the rigatoni according to the package instructions; drain and set aside to cool.",
    "Saute the onions in the olive oil in a skillet over medium heat until golden, 3 to 4 minutes. Crumble in the sausage, add the crushed red pepper and cook for a couple of minutes. Add the marinara sauce, mix everything together and cook for 5 to 7 minutes. Set aside to cool.",
    "To assemble, add about 2 spoonfuls of the sauce--just enough to coat the bottom--to a baking dish. Then layer half of the cooled noodles, half of the mozzarella cubes and half of the remaining sauce. Repeat the process: layer the remaining noodles, mozzarella and sauce, then top with the Parmesan. Cover and put in the fridge or freezer until ready to cook.",
    "When ready to cook, preheat the oven to 350 degrees F. Cook the rigatoni until heated through and bubbling, 25 minutes straight from the fridge, or 2 hours straight from the freezer. Garnish with minced parsley before serving.",
    "Cook's Note: This dish can also be cooked immediately after assembling in a preheated oven for 20 to 25 minutes at 350 degrees F.",
    "Recipe courtesy of Ree Drummond"
  ],
  "ingredients": [
    "0",
    "1 pound rigatoni",
    "1 onion, finely diced",
    "2 tablespoons olive oil",
    "1 1/2 pounds Italian sausage",
    "1 teaspoon crushed red pepper flakes",
    "Two 25-ounce jars marinara sauce",
    "Two 8-ounce balls fresh mozzarella, cut into large cubes",
    "1/2 cup grated Parmesan",
    "Minced fresh parsley, for garnish"
  ],
  "__v": 1
}