{
  "hash": "258741a64efd9a3832f7c84ccdfdc0371f1abd76",
  "title": "Boerenkool Stamppot (Kale Hash)",
  "image": "https://thedomesticatedman.files.wordpress.com/2015/10/img_3424.jpg?w=800",
  "href": "http://thedomesticman.com/2015/06/09/boerenkool-stamppot-kale-hash/",
  "extension": "Chrome",
  "firstAdded": "2016-01-19T16:49:32.743000",
  "users": [
    null
  ],
  "keywords": [
    "lbs",
    "white",
    "potatoes",
    "washed",
    "partially",
    "chunks",
    "bay",
    "leaves",
    "smoked",
    "fullycooked",
    "mild",
    "sausage",
    "kielbasa",
    "butter",
    "cubed",
    "divided",
    "medium",
    "onion",
    "bunch",
    "kale",
    "stems",
    "chicken",
    "broth",
    "cream",
    "coconut",
    "milk",
    "salt",
    "pepper"
  ],
  "directions": [
    "0",
    "Place the potatoes and bay leaves in a large stockpot and add enough water to cover the potatoes by 1″. Add a bit of salt to the water, then bring to a boil over high heat; reduce heat to medium and simmer until the potatoes are easily pierced by a fork, about 15 minutes.",
    "As the potatoes boil, let’s get the sausages going. I grilled them over indirect heat for 20 minutes (turned off the burners on one side of the grill and put them on the cool side), but you could also pan-fry them over medium heat until crispy. Some folks like to throw them in the water with the potatoes as they boil, and that’s cool too. Either way, cook them up and set them aside once done.",
    "Similarly, as the potatoes boil, you can prep the onion and kale. Add 2 tbsp of the butter to a medium-sized pot and heat over medium heat; add the onion and saute until softened, about 6 minutes. Add the chicken broth and bring it to a simmer, then add the kale. Saute until the kale is bright green and starting to wilt, about 3 minutes, then remove from the heat and set aside.",
    "Once the potatoes are done, drain them then return them to the stockpot. Add the kale mixture, the remaining 4 tbsp of cubed butter, a pinch of ground cloves, and half of the cream, then mash with a potato masher or a sturdy fork. Add more cream as needed to ensure the potatoes are nice and fluffy, then taste and add salt and pepper until it tastes just perfect.",
    "Finally, slice the sausage into bite-sized pieces and stir into the Stamppot, then serve.",
    "** To make this dish Whole30, use ghee instead of the butter and coconut milk instead of cream."
  ],
  "ingredients": [
    "0",
    "3 lbs white potatoes, washed and partially peeled, cut into 1″ chunks",
    "2 bay leaves",
    "1 lb smoked (fully-cooked) mild sausage, like kielbasa",
    "6 tbsp butter, cubed, divided",
    "1 medium onion, chopped",
    "1 bunch kale (about 1/3 lb), stems removed and chopped",
    "1 cup chicken broth",
    "1 pinch ground cloves",
    "1 cup heavy cream (or coconut milk), divided",
    "salt and pepper to taste (about 1/2 tsp each)"
  ],
  "__v": 1
}