{
  "hash": "29efb48b55548a21f52f2d65b3f3b8081dc845ba",
  "title": "Chole",
  "image": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1460/k/Photo/Recipes/2019-05-chole-ramadan-dish-i-look-forward-to/CholeOption1Cropped",
  "href": "https://www.thekitchn.com/ramadan-chole-recipe-22909085",
  "extension": "Chrome",
  "firstAdded": "2019-06-03T14:42:26.725000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place the drained soaked chickpeas, 2 teaspoons of the salt, and 1/2 teaspoon of the oil in a large pot and add water to cover by 2 inches. Bring to a boil over high heat. Reduce the heat to medium-low and simmer until the chickpeas are soft but not mushy, about 1 hour. Meanwhile, cook the onions.",
    "Heat the remaining 3 tablespoons oil in aDutch oven over medium-low heat until shimmering. Add the onions and cook, stirring occasionally, until they start to soften and turn translucent, about 10 minutes. Add 1/2 teaspoon of the salt and continue cooking, stirring occasionally, until the onions turn deep golden brown or, if you can wait, until they darken and start to crisp, 40 to 90 minutes. You can cook the onions on higher heat so long as you are vigilant. Add a splash of water whenever the onions start sticking to the pan. Meanwhile, toast the spices.",
    "Place 1 teaspoon of the cumin and the coriander in a small frying pan over medium heat and toast, stirring often, until they deepen in color and are fragrant, about 10 minutes. Remove from the heat and let cool about 5 minutes, then grind with a coffee grinder or a mortar and pestle.",
    "Add the ground cumin and coriander, turmeric, and 1/4 cup water to the browned onions. Increase the heat to medium, and cook, stirring frequently, until no liquid remains in the bottom of the pot, 1 to 2 minutes.",
    "When the chickpeas are ready, reserve 1/2 cup of the cooking liquid, then drain the chickpeas. Add the chickpeas and cooking liquid to the onion mixture. Cook, stirring frequently, until no liquid remains in the bottom of the pan, 5 to 10 minutes. Meanwhile, place the remaining 1 teaspoon cumin in a small frying pan over medium heat and toast, stirring often, until it deepens in color and is fragrant, about 10 minutes. Stir into the chickpea mixture. Taste and season with the remaining 1/2 teaspoon salt if needed.",
    "Stir the cilantro, red onion, chiles, and lime juice if desired into the chickpea mixture just before serving."
  ],
  "ingredients": [
    "0",
    "1 cup dried chickpeas (black if you can find them), soaked in water 8 to 16 hours and drained",
    "3 teaspoons fine sea salt, divided",
    "3 tablespoons plus 1/2 teaspoon olive oil, divided",
    "4 medium yellow onions, thinly sliced",
    "2 teaspoons cumin seeds, divided",
    "1 teaspoon coriander seeds",
    "1/4 teaspoon ground turmeric"
  ],
  "__v": 1
}