{
  "hash": "e58b7b196f10d2df17372a97272bb4b17df5711a",
  "title": "Ultimate \"Cheese\" Sauce",
  "image": "http://www.veggiesdontbite.com/wp-content/uploads/2015/07/classic-cheese-sauce-macaroni-43-Edit.jpg",
  "href": "http://www.veggiesdontbite.com/2015/07/08/ultimate-cheese-sauce/",
  "extension": "",
  "firstAdded": "2015-11-12T15:57:42.186000",
  "users": [
    null
  ],
  "keywords": [
    "medium",
    "red",
    "potatoes",
    "pepper",
    "orange",
    "use",
    "baby",
    "carrots",
    "mild",
    "onion",
    "diameter",
    "garlic",
    "roasted",
    "long",
    "raw",
    "cashews",
    "lemon",
    "juice",
    "chickpea",
    "miso",
    "mustard",
    "seed",
    "paprika",
    "himalayan",
    "pink",
    "salt",
    "depending",
    "preference",
    "favorite",
    "pasta",
    "making",
    "mac",
    "cheese"
  ],
  "directions": [
    "0",
    "If you haven’t roasted the garlic, peel and mix with a splash of veggie broth. Wrap in tin foil, and/orparchment and roast at 400 degrees in a regular or toaster oven, about 20-25 minutes, until garlic just starts browning.",
    "Bring a pot of water to a boil and cook potatoes (skins on), red pepper, carrots and onion until potatoes are soft enough to pierce with a fork, about 25 minutes. Drain veggies and place on plate to cool slightly. You can reserve some of the cooking water to thin out sauce if needed, depending on what you are using it for.",
    "Place potatoes only into a high speed blender (if you don’t have a high speed blender use a regular one, but consistency may not be as creamy, smooth or gooey). Blend on high until you get a gooey sticky consistency. If you have a Vitamix, use the tamper tool to push down the potatoes. If you don’t have one, then you will need to stop and push down the potatoes every once in a while.",
    "Once potatoes are blended and gooey, add pepper, carrots, onion and garlic to the blender and blend again until smooth.",
    "Add in the rest of the ingredients and blend. If you want to thin it out, add some of the reserved cooking water, 1 tablespoon at a time until you get the desired consistency. Use as a dip, over pasta or in baked recipes.",
    "Keep this cheese sauce in the fridge. It will thicken as it cools so when you take it out, heat it slowly and mix well to get the smoothness back. Add water if you need to thin it out. You can also freeze leftovers in a freezer safe container as it freezes great. Defrost slowly when ready to eat. You may think it didn't freeze well, but as you heat it up the consistency comes back! You will need to mix it well as you did after cooling it in the fridge.",
    "1",
    "Cook your pasta according to package directions.",
    "Drain pasta reserving about 1 cup pasta water.",
    "Add the pasta back into the pot and add desired amount of cheese sauce.",
    "Then add pasta water 1 tablespoon at a time, mixing well in between additions, until you get the desired consistency of your Mac n Cheese. If your pasta is too starchy (as some gluten free pastas are) you can also use regular water to do this. Add salt if needed, it most likely will since the sauce is no longer as concentrated. Devour!"
  ],
  "ingredients": [
    "0",
    "• 3 medium red potatoes (about 4 inches by 3 inches)",
    "• ⅓ of a medium red pepper (about 4 inches by 3 inches)",
    "• 2 orange carrots (about 5 inches by 1 inch, can also use 5 baby carrots)",
    "• ½ a small sweet mild onion (about 3 inches in diameter)",
    "• 4 medium garlic cloves, roasted (about 1 inch long)",
    "• ½ cup raw cashews (see note)",
    "• 1 teaspoon fresh lemon juice",
    "• ¾ teaspoon chickpea miso",
    "• ½ teaspoon mustard seed powder",
    "• ½ teaspoon paprika",
    "• 1 ½ teaspoons Himalayan pink salt (can use less or more depending on taste preference)",
    "• Your favorite pasta if making Mac n Cheese"
  ],
  "__v": 1
}