{
  "__v": 1,
  "directions": [
    "0",
    "Heat a large pot of water to boiling and salt generously. When at a rolling boil, add the linguine and cook for 9 to 11 minutes or until al dente. Drain the pasta, return it to the cooking pot, and toss with a drizzle of olive oil.",
    "Meanwhile, in a small saucepan heat a drizzle of olive oil over low heat and cook the garlic for 3 minutes or until golden and fragrant. If desired, add a sprinkle of red pepper flakes. Add the white wine and cook for 2 minutes, until slightly reduced. Add the chicken broth and bring to a simmer. Squeeze in the lime juice, add the cilantro, and taste and adjust seasoning. Keep warm at a low simmer while you cook the scallops.",
    "Heat a heavy frying pan over high heat. Add a drizzle of olive oil.",
    "If cooking larger sea scallops, place them in the pan (don't crowd it) and sprinkle lightly with salt and pepper. Cook for about 1 1/2 minutes then flip. Cook for 3 minutes total. They should develop a golden sear on each side.",
    "If cooking the smaller bay scallops add the scallops and cook very quickly, shaking and stirring, until they are barely golden on the outside and warm within. This will take 1 to 2 minutes.",
    "To serve, fill 2 to 4 bowls with pasta. Divide the scallops between the bowls and pour the warm broth over them. Garnish with additional cilantro and eat immediately."
  ],
  "hash": "2bf12b0f9dc0803b0b9dea5972bac3d54bb71c8c",
  "href": "http://www.thekitchn.com/recipe-scallops-14694#52d41df997f2fcdc4f000013",
  "image": "http://p-fst1.pixstatic.com/522f30dc697ab05339005043._w.540_s.fit_.jpg",
  "ingredients": [
    "0",
    "1 pound linguine",
    "Olive oil",
    "4 garlic cloves, minced",
    "Red pepper flakes, optional",
    "1/2 cup dry white wine",
    "2 cups chicken broth",
    "1 lime, juiced",
    "1/2 packed cup finely chopped cilantro, plus more to garnish",
    "1 pound bay or sea scallops",
    "Salt and freshly ground black pepper"
  ],
  "keywords": [
    "linguine",
    "olive",
    "oil",
    "garlic",
    "red",
    "pepper",
    "dry",
    "white",
    "wine",
    "chicken",
    "broth",
    "lime",
    "juiced",
    "cilantro",
    "bay",
    "scallops",
    "salt",
    "black"
  ],
  "title": "Scallops with Lime & Cilantro",
  "users": [
    null
  ]
}