{
  "hash": "b593a03e2f48c65ce1d0e9619bb983c888cd3ecd",
  "title": "Stuffed Pizza Bites",
  "image": "http://www.gimmesomeoven.com/wp-content/uploads/2009/09/stuffed-pizza-bites.jpg",
  "href": "http://www.gimmesomeoven.com/stuffed-pizza-bites/",
  "extension": "Chrome",
  "firstAdded": "2016-08-28T23:42:36.123000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to temperature specified on pizza dough package. Usually it's 400 degrees. (This is also a good option if you make your own dough.)",
    "Unroll your pizza dough onto a lightly-floured surface. Pat or roll the dough so it's at least 12\" by 8\". Use a pizza cutter to slice the dough into 24 squares.",
    "Place cheese and desired toppings on each square. I found that it worked best if you layer the cheese on first, as this makes a softer bottom layer for the dough to fold around. Make sure to use just enough toppings so that the dough can fold easily around them.",
    "When all of your dough squares have cheese and toppings on them, carefully lift up each square and wrap the dough around the toppings. Pinch to make sure each ball is sealed shut and then place seam-side-down in a lightly sprayed pie pan (or similar sized dish).",
    "Brush the tops of the dough balls with olive oil (or melted butter) and then sprinkle with the garlic and Italian seasoning. Top with Parmesan cheese.",
    "Place pan in the oven and cook for about 15-20 minutes or the dough is slightly golden. Doughs vary, so keep an eye on them and begin checking them after 10 minutes.",
    "Serve warm with warmed marinara sauce on the side for dipping."
  ],
  "ingredients": [
    "0",
    "1 roll refrigerated pizza dough (or make your own)",
    "marinara/pizza sauce",
    "2 Tbsp. grated Parmesan cheese",
    "1 Tbsp. olive oil or melted butter",
    "1/2 tsp. garlic powder",
    "1 tsp. dried Italian seasoning",
    "mozzarella or Italian blend cheese",
    "pizza toppings of your choice (ham and pineapple, pepperoni, sausage, chopped green peppers or onions, etc.)"
  ],
  "__v": 1
}