{
  "hash": "a5c6014124eefa4cee2004648dcbd4a254cd4a13",
  "title": "Lemon-and-Artichoke Paella with Pumpkin",
  "image": "",
  "href": "https://www.shape.com/recipe/lemon-and-artichoke-paella-with-pumpkin",
  "extension": "Chrome",
  "firstAdded": "2020-03-29T20:25:23.833000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DirectionsInstructions Checklist",
    "Step 1",
    "To make the spice blend: Finely grind together the coriander and fennel seeds and saffron, and immediately mix with the turmeric and Aleppo pepper.",
    "Step 2",
    "To make the paella: Coat a large saute pan with oil (2 to 3 tablespoons), and heat over medium heat. Add the onion, 2 pinches of the spice blend, and a pinch of salt. Stir well, spread in an even layer, and cover. Cook until the onion is just translucent, about 6 minutes.",
    "Step 3",
    "Add the bell peppers, 2 more pinches of the spice blend, and a pinch of salt, and stir well. Cook, stirring occasionally, until the peppers are bright, about 4 minutes. Reduce the heat to low, cover, and cook until the peppers are almost tender, about 3 minutes. If the vegetables seem like they're burning, add a little more oil. Transfer the vegetables to a plate.",
    "Step 4",
    "Coat the pan generously with more oil (3 to 4 tablespoons), and raise the heat to medium-high. Add the artichokes and lemon, and season with salt. Stir well, spread in an even layer, and cover. Cook, stirring occasionally, until crisp-tender, 5 to 6 minutes.",
    "Step 5",
    "Raise the heat to high. Add the pumpkin puree, rice, chickpeas, the vegetables, 4 1/2 cups cold water, the remaining spice blend, and a large pinch of salt. Stir continuously until the mixture is bubbling and the rice absorbs some of the liquid, about 2 minutes. Reduce the heat to low and simmer, uncovered, until the rice is just cooked through, about 20 minutes. Raise the heat to high, and cook until a crust forms on the bottom of the rice, about 5 minutes. Remove from the heat, tent loosely with foil, and let stand for 10 minutes before serving.",
    "Tips",
    "Recipe reprinted from Mastering Spice, by Lior Lev Sercarz. Copyright 2019. Published by Clarkson Potter, an imprint of Penguin Rand"
  ],
  "ingredients": [
    "0",
    "IngredientsSpice Blend",
    "2 ½ teaspoons coriander seeds",
    "2 ½ teaspoons fennel seeds",
    "Pinch of saffron",
    "1 teaspoon ground turmeric",
    "½ teaspoon Aleppo pepper",
    "Paella",
    "Extra-virgin olive oil",
    "1 medium yellow onion, diced Kosher salt",
    "Kosher salt",
    "1 small red bell pepper, cut into 1-inch chunks",
    "1 small green bell pepper, cut into 1-inch chunks",
    "1 can (14 ounces) artichoke hearts, drained, quartered, and sliced 3/4 inch thick",
    "1 lemon, diced with its rind and seeded",
    "½ cup pumpkin puree",
    "1 ½ cups bomba rice (a short-grain rice from Spain; available online)",
    "1 cup cooked chickpeas, drained and rinsed"
  ],
  "__v": 1
}