{
  "hash": "f35af26e64971e3742f20d3d3748df97b53e4f36",
  "title": "Spiced Multi-layer Chinese Pancake",
  "image": "https://chinasichuanfood.com/wp-content/uploads/2016/11/Spiced-Muti-layper-pancake-12-copy.jpg",
  "href": "https://www.chinasichuanfood.com/spiced-multi-layer-chinese-pancake/",
  "extension": "Chrome",
  "firstAdded": "2018-08-25T23:27:42.495000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "In a large bowl, mix a small pinch of salt with flour. Stir warm water in and then knead until get smooth and elastic dough. The dough should be much softer than normal pancakes. Then cover the bowl and set aside for 30 minutes.",
    "In a saucepan, heat around 2 tablespoons of cooking oil with minced garlic until fragrant. Add chopped doubanjiang, fry for 1-2 minutes over slow fire. Place black vinegar, sugar, oyster sauce and hot water. Mix well and let the sauce simmer for 4-5 minutes. Set aside.",
    "Divide the dough into 4 equal pieces. Take one out and roll out to a large rectangle piece on a slightly oiled operating board. Then cut 2 slices each long side of the dough to separate it into 9 portions. Then we roll the large rectangle up. Start from the bottom part; fold the two side slaps over the middle one. And then fold the three layers over the most middle one. Repeat to finish the top part and then fold the remaining piece over. You will end up with a small and neat rectangle. Then roll it out to a larger rectangle (about 2 or 2.5 times of the original size).",
    "Then heat around 1 tablespoon of oil in pan and fry the pancake around 3-5 minutes each side with over medium fire. Brush a thin layer of sauce before garnishing toasted sesame seeds and chopped scallion.",
    "Cut into one-bite sizes and serve warm."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "300g all-purpose flour",
    "180ml to 190ml Luke warm water",
    "a small pinch of salt",
    "4 tablespoons of cooking oil+ plus more for brushing",
    "Chinese five spice powder or ground Sichuan pepper",
    "Mixed sauce (4 pancakes only use half of the sauce, but I recommend simmering a larger batch each time)",
    "2 tablespoons of cooking oil",
    "2 tablespoons Sichuan Doubanjiang, finely chopped",
    "3 garlic cloves, minced",
    "1 tablespoon oyster sauce",
    "⅛ teaspoon Chinese five spice powder",
    "1 tablespoon sugar",
    "¼ teaspoon black vinegar",
    "2 tablespoon hot water",
    "Garnish",
    "Toasted sesame seeds",
    "Chopped scallion"
  ],
  "__v": 1
}