{
  "hash": "a28038d7bff50eef735eb402bcd6d3e4d09e96e0",
  "title": "No Bake Peanut Butter Cup Cheesecakes",
  "image": "http://cdn.minimalistbaker.com/wp-content/uploads/2014/07/SUPER-creamy-Vegan-Peanut-Butter-Cup-Cheesecakes-Oreo-crust-PB-centers-with-ganache-swirl-9-ingredients-no-bake-filling-SUPER-delicious.jpg",
  "href": "http://minimalistbaker.com/no-bake-peanut-butter-cup-cheesecakes/",
  "firstAdded": "2015-02-18T04:21:45.051000",
  "users": [
    null
  ],
  "keywords": [
    "oreo",
    "cookies",
    "coconut",
    "oil",
    "sub",
    "vegan",
    "butter",
    "raw",
    "cashews",
    "soaked",
    "water",
    "hours",
    "lemon",
    "juiced",
    "scant",
    "fat",
    "milk",
    "instructions",
    "maple",
    "syrup",
    "agave",
    "nectar",
    "honey",
    "salted",
    "natural",
    "peanut",
    "creamy",
    "crunchy",
    "semisweet",
    "chocolate",
    "chips",
    "dairyfree",
    "warmed",
    "simmer",
    "mini",
    "dark",
    "veganfriendly"
  ],
  "directions": [
    "0",
    "Preheat oven to 350 degrees and blitz oreos in a food processor until a fine meal remains. Add 2 Tbsp melted coconut oil (or vegan butter) and pulse once more.",
    "Cut 12 small strips of parchment paper (or use paper liners) and place them in a standard, 12-slot muffin tin. One at a time, hold down a strip in the center of the tin, add 1 generous spoonful of crust mixture, then use a small cup or your spoon to pack it down as evenly as possible. I like using a small glass because it packs it in really tight and gets the top flat. Continue until all tins are filled and no crust remains.",
    "Bake for 5 minutes, then remove and set aside to cool.",
    "NOTE: For the coconut milk, I like to scoop the \"cream\" off the top because it provides a richer texture. But if yours is already all mixed together, just add it in as is.",
    "Add drained cashews, lemon juice, coconut oil, coconut milk, maple syrup and peanut butter to a blender and process until very smooth and creamy - about 3-4 minutes - scraping down sides as needed. You need to make sure you get it really smooth with no small pieces or you’ll taste them in the final result. If your mixture is too thick, add a bit more coconut milk or oil to get it going. Taste and adjust seasonings as needed.",
    "Pour evenly into muffin tins on top of crust and gently top on counter to remove air bubbles.",
    "Prepare ganache by bringing 3 Tbsp coconut milk to a simmer in the microwave (30 seconds) or on the stove top in a small saucepan. Place the chocolate chips in a small mixing bowl and pour the coconut milk on top. DON’T touch for 3 minutes so it has a chance to warm the chips. Then stir gently until smooth. Microwave or set over a double boiler briefly if the chips didn’t fully melt.",
    "Spoon 1/2 Tbsp amounts of ganache over the cheesecakes and swirl with a toothpick or knife.",
    "Sprinkle 3/4 of the peanut butter cups on top of the cheesecakes and press down slightly.",
    "Cover loosely with plastic wrap and freeze until firm - at least 3 hours.",
    "To remove from muffin tin, simply pull on tabs at the same time and the cheesecakes should release. Otherwise, use a butter knife to pop them out. Serve immediately frozen or let soften for 10-15 minutes.",
    "Top with any remaining ganache (reheated), chopped peanut butter cups and/or coconut whipped cream."
  ],
  "ingredients": [
    "0",
    "10 ounces crushed oreo cookies",
    "2 Tbsp coconut oil (or sub melted or vegan butter)",
    "1",
    "1.5 cups raw cashews, soaked in water 4-6 hours then drained",
    "1 lemon, juiced (scant 1/4 cup)",
    "1/3 cup coconut oil, melted",
    "1/2 cup + 2 Tbsp full fat coconut milk (see instructions for note)",
    "1/2 cup maple syrup or agave nectar (or honey if not vegan)",
    "1/3 cup salted natural peanut butter (creamy or crunchy)",
    "2",
    "3/4 cup semisweet chocolate chips (dairy-free)",
    "3 Tbsp full fat coconut milk, warmed to a simmer",
    "3",
    "18 mini dark chocolate PB Cups (vegan-friendly), chopped"
  ],
  "__v": 1
}