{
  "hash": "3ba310c0cb0498f6d0e070d8a8faa25d71125051",
  "title": "LOADED KALE SALAD",
  "image": "https://minimalistbaker.com/wp-content/uploads/2017/12/HEALTHY-Loaded-Kale-Salad-in-just-30-minutes-Roasted-and-fresh-veggies-sprouts-quinoa-and-tahini-dressing-dinner-vegan-glutenfree-salad-healthy-minimalistbaker-recipe-8.jpg",
  "href": "https://minimalistbaker.com/loaded-kale-salad/",
  "extension": "",
  "firstAdded": "2018-04-30T16:49:48.605000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat a small pot over medium heat and add rinsed, drained quinoa. Toast for 1-2 minutes, stirring frequently. Then add water and bring to a low boil. Once boiling, reduce heat to a simmer, cover, and cook for 18-20 minutes or until liquid is completely absorbed. Once cooked, fluff with a fork, remove lid, and set aside.",
    "Preheat oven to 375 degrees F (190 C) and add carrots and beets to a baking sheet. Add water (or oil) and seasonings of choice and toss to coat. Roast for 25-30 minutes or until tender and slightly golden brown. (This method is adapted from my oil-free vegetables recipe).",
    "In the meantime, prepare dressing by adding tahini, lemon juice, maple syrup, and salt to a small mixing bowl and whisking to combine. Then add water 1 Tbsp (15 ml) at a time and whisk until pourable. Taste and adjust flavor as needed, adding more lemon juice for acidity, salt for saltiness, or maple syrup for sweetness. See notes for savory version.",
    "Arrange kale on a serving platter or bowl and top with tomatoes, avocado, cooked quinoa, roasted vegetables, and any other desired toppings, such as hemp seeds or sprouts. Serve with dressing on the side, or toss to combine.",
    "Store leftovers (keep dressing separate for best results) in the refrigerator up to 3 days. Dressing will keep well covered in the refrigerator up to 1 week."
  ],
  "ingredients": [
    "0",
    "QUINOA",
    "3/4 cups (138 g) quinoa*, well rinsed",
    "1 1/2 cups (360 ml) water",
    "VEGETABLES",
    "4 large carrots* (245 g), halved + roughly chopped",
    "1 beet* (135 g), thinly sliced",
    "2 Tbsp (30 ml) water (or sub avocado or melted coconut oil)",
    "Pinch sea salt",
    "optional: 1/2 tsp curry powder",
    "DRESSING",
    "1/3 cup (80 ml) tahini",
    "2-3 Tbsp (30-45 ml) lemon juice*",
    "1-2 Tbsp (15-30 ml) maple syrup (depending on preferred sweetness*)",
    "Pinch sea salt",
    "Water to thin (~1/4 cup or 60 ml)",
    "SALAD",
    "8 cups (530 g) kale, torn or roughly chopped (or sub other green)",
    "1/2 cup (90 g) chopped cherry tomatoes",
    "1 ripe avocado, cubed (~200 g)",
    "optional: 1/4 cup (40 g) hemp seeds",
    "optional: 1/2 cup (10 g) sprouts of choice (I used broccoli)"
  ],
  "__v": 1
}