{
  "__v": 1,
  "directions": [
    "0",
    "method:",
    "1. In a heavy bottomed sauce pan, bring the water, butter, sugar, and salt to a brisk boil. Immediately add in the flour and whisk until it's completely incorporated. Keep stirring over the heat, but keep it at a low/medium. Remove as much moisture as possible for a fluffier pastry later on. When you see a thin film on the bottom of the an, the batter is ready and you can transfer the dough to the bowl of a stand mixer.",
    "2. Use the paddle attachment to stir the dough for a minute to aid the cooling process. Turn the speed to medium and add one egg at a time - don't add the next one until the first one is fully incorporated.",
    "3. Add one egg white and blend until the dough becomes smooth and glossy, if it's not getting smooth and glossy, add the other egg white. If not, don't. Transfer dough to a large pastry bag with a large star tip.",
    "4. Preheat your oil to 370 degrees in a deep saucepan. Cut about 20 3x3 squares out of parchment paper. Spray each square (one side) with butter nonstick spray. Pipe a ring of dough onto each square.",
    "5. Place cruller and paper into hot oil. The paper will automatically separate from the oil, and the cruller will float on the hot oil, bubbling away. Flip cruller once, and fry until light brown (about 1-2 minutes). Drain/cook on a wire cooling rack.",
    "6. Make the glaze: combine all glaze ingredients until smooth.",
    "7. When crullers are cold to the touch, dip each top half of the doughnut into the glaze, flip over, and place back on the rack to cool) with a cookie sheet under the wire rack to catch the drippings. When the glaze has hardened, the doughnuts are ready to devour."
  ],
  "firstAdded": "2014-07-20T19:21:45.930000",
  "hash": "d006f5c6f86a26f201222656c14eac4d8b7ffe27",
  "href": "http://bakingwithblondie.blogspot.com/2013/10/homemade-french-cruller-doughnuts.html",
  "image": "http://1.bp.blogspot.com/-GxqxczgXIqc/UmSFLIVY2lI/AAAAAAAAOLU/JP58satZOug/s640/101_2529.JPG",
  "ingredients": [
    "0",
    "crullers:",
    "1 C water",
    "6 T unsalted butter",
    "2 T granulated sugar",
    "1/4 t salt",
    "1 C all-purpose flour, sifted",
    "3 large egg yolks",
    "1-2 egg whites, beaten",
    "vegetable oil for frying",
    "vanilla almond glaze",
    "vanilla almond glaze:",
    "1 1/2 C powdered sugar",
    "1 t vanilla extract",
    "1/4 t almond extract",
    "3-4 T milk or water"
  ],
  "keywords": [
    "crullers",
    "water",
    "unsalted",
    "butter",
    "granulated",
    "sugar",
    "salt",
    "allpurpose",
    "flour",
    "sifted",
    "egg",
    "yolks",
    "whites",
    "oil",
    "frying",
    "vanilla",
    "almond",
    "glaze",
    "milk"
  ],
  "title": "Homemade French Cruller Doughnuts",
  "users": [
    null
  ]
}