{
  "hash": "1c69d22eb5b52a943285624d35442f3a35460e06",
  "title": "Bibimbap - Korean Mixed Rice with Meat and Assorted Vegetables",
  "image": "https://mykoreankitchen.com/wp-content/uploads/2013/07/1.Korean-mixed-rice-Bibimbap-150x150.jpg",
  "href": "https://mykoreankitchen.com/bibimbap-korean-mixed-rice-with-meat-and-assorted-vegetables/",
  "extension": "Chrome",
  "firstAdded": "2018-09-12T22:47:18.866000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare and cook ingredients as below. - For meat, mix the beef mince with the meat sauce listed above. Marinate the meat for about 30 mins while you are working on other ingredients to enhance the flavour. Add some cooking oil into a wok and cook the meat on medium high to high heat. It takes about 3 to 5 mins to thoroughly cook it.- Mix the Bibimbap sauce ingredients in a bowl.- Spinach and bean sprouts per linked recipe.- Rinse, peel and julienne the carrots. Add some cooking oil and 1/4 tsp of fine sea salt in a wok and cook the carrots on medium high to high heat for 2 to 3 mins.- Clean/rinse the shiitake mushrooms and thinly slice them. Add some cooking oil and 1/4 tsp of fine sea salt in a wok and cook the mushrooms on medium high to high heat until they are all cooked. (It takes 2 to 3 mins.)- Make fried eggs. (While sunny side up is common, you can make them per your preference.)",
    "Put the rice into a bowl and add the meat, assorted vegetables, seasoned seaweed, Bibimbap sauce and the egg on top of the rice. Serve it.",
    "Mix the ingredients well in the bowl and enjoy!"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Meat and meat sauce",
    "100 g beef mince (3.5 ounces), (or other cuts)",
    "1 Tbsp soy sauce",
    "1 Tbsp sesame oil",
    "1 tsp sugar , I used brown sugar",
    "1/4 tsp minced garlic",
    "Vegetables and other",
    "250 g spinach (mildly seasoned) (0.6 pounds)",
    "350 g bean sprouts (mildly seasoned) 0.8 pounds, You don’t have to use them up if you think it’s too much but I love having lots of vegetables on my Bibimbap!",
    "100 g shiitake mushroom (3.5 ounces)",
    "120 g carrots (4.2 ounces, 1 small)",
    "1/2 tsp fine sea salt (1/4 tsp each will be used when cooking shiitake mushroom and carrots)",
    "3 cups steamed rice (3 to 4 serving portions )",
    "3 eggs (3 or 4 depending on the serving portion)",
    "Some cooking oil (to cook the meat, mushroom, carrots and eggs – I used rice bran oil.)",
    "Some Korean seasoned seaweed shredded (long thin cut)",
    "Bibimbap sauce - The below sauce might be only enough for 3 servings if you like eating it spicy.",
    "2 Tbsp gochujang",
    "1 Tbsp sesame oil",
    "1 Tbsp sugar - I used raw sugar",
    "1 Tbsp water",
    "1 Tbsp toasted sesame seeds",
    "1 tsp vinegar - I used apple vinegar",
    "1 tsp minced garlic"
  ],
  "__v": 1
}