{
  "hash": "b98403a8c5401f5e88fb07b80d222f72e8c72b41",
  "title": "LEMON RASPBERRY CUPCAKES",
  "image": "https://www.lifeloveandsugar.com/wp-content/uploads/2018/04/Lemon-Raspberry-Cupcakes5.jpg",
  "href": "https://www.lifeloveandsugar.com/lemon-raspberry-cupcakes/",
  "extension": "Chrome",
  "firstAdded": "2019-02-10T23:11:38.424000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350°F (176°C) and add cupcake liners to a cupcake pan.",
    "Cream the butter and sugar together until light and fluffy, 3-4 minutes.",
    "Add the sour cream, vanilla extract and lemon zest and mix until combined.",
    "Add the egg whites in two batches, mixing until well combined after each. Scrape down the sides of the bowl as needed to make sure all is incorporated and smooth.",
    "In a separate bowl, combine the dry ingredients. In another small bowl or measuring cup, combine the milk, water and lemon juice.",
    "Add half of the dry ingredients to the batter and mix until well combined. Add the milk mixture and mix until well combined. Add the remaining dry ingredients and mix until well combined. Scrape down the sides of the bowl as needed to be sure all ingredients are well incorporated.",
    "Fill cupcake liners about 3/4 full and bake for 15-17 minutes, or until a toothpick inserted comes out with a few crumbs.",
    "Remove the cupcakes from the oven and allow to cool for about 2-3 minutes, then remove to a cooling rack to cool completely.",
    "To make the frosting, add the raspberries to a food processor and puree until smooth. Strain the puree through a fine mesh sieve. You’ll end up with about 1/4 cup of puree. Set puree aside.",
    "Beat the butter and shortening together in a large mixer bowl until well combined and smooth.",
    "Add about half of the powdered sugar and mix until well combined and smooth.",
    "Add 2 tablespoons of raspberry puree and mix until well combined",
    "Add the remaining powdered sugar and mix until smooth.",
    "Add the remaining raspberry puree as needed to get the right consistency of frosting and flavor.",
    "Pipe the frosting onto the cupcakes.",
    "Top each cupcake with a lemon slice and raspberry and serve."
  ],
  "ingredients": [
    "0",
    "LEMON CUPCAKES",
    "6 tbsp (84g), unsalted butter, room temperature",
    "3/4 cups (155g) sugar",
    "6 tbsp (86g) sour cream",
    "1/2 tsp vanilla extract",
    "1 tbsp finely grated lemon zest",
    "3 large egg whites",
    "1 1/4 cups (163g) all purpose flour",
    "2 tsp baking powder",
    "¼ tsp salt",
    "4 tbsp (60ml) milk",
    "2 tbsp (30ml) water",
    "2 tbsp lemon juice",
    "RASPBERRY FROSTING",
    "4 oz (113g) raspberries",
    "1/2 cup (112g) salted butter, room temperature",
    "1/2 cup (95g) shortening",
    "4 cups (460g) powdered sugar",
    "Raspberries, for topping",
    "Lemon slices, for topping"
  ],
  "__v": 1
}