{
  "hash": "cdb5136dfe93fb4db93330850e2ed85f1c3db89f",
  "title": "Blood Orange Upside-Down Cake\nA simple yet vibrant blood orange upside-down cake made with yogurt, olive oil, and almond flour.\nPrep Time\n30 mins\nCook Time\n40 mins\nTotal Time\n1 hr 10 mins",
  "image": "https://www.katiebirdbakes.com/wp-content/uploads/2017/02/20170215-Blood-Orange-Upside-Down-Cake-katiebirdbakes.com-12-150x150.jpg",
  "href": "https://www.katiebirdbakes.com/blood-orange-upside-down-cake/",
  "extension": "Chrome",
  "firstAdded": "2020-03-06T01:26:53.977000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "nstructions",
    "For the Blood Orange Topping (do this first):",
    "In a microwave-safe bowl or a saucepan on the stove, melt the butter. Whisk in the sugar until it melts. Pour the mixture into the bottom of a greased 9-inch round cake pan. Arrange the orange slices on top of the mixture, overlapping slightly, in a spiral pattern. You may wind up not using all the orange slices, depending on their size. Have a snack.",
    "For the Cake:",
    "Preheat the oven to 350 degrees F. In a large bowl, whisk together the flour, almond flour, baking powder, and salt.",
    "In a medium bowl, place the sugar and orange zest and rub them together with your fingers until the sugar smells fragrantly orange. This releases the oils in the zest and flavors the cake.",
    "Add the yogurt, eggs, olive oil, and almond extract to the sugar and whisk vigorously until the mixture is very well blended. Whisk some more for good measure.",
    "Add the dry ingredients, and fold and stir them in with a wooden spoon until fully blended and the batter is smooth and thick.",
    "Pour the batter over the orange slices in the cake pan and bake for 35-40 minutes, or until the cake is golden brown and beginning to come away from the pan. A knife or toothpick inserted in the center should come out clean.",
    "Let the pan cool on a rack for 5 minutes, then run a knife or thin spatula around the edges of the cake. Place a large plate over the pan, then flip so the cake comes out upside-down onto the plate.",
    "Let cool to room temperature. Serve alone or with whipped cream. Cake will keep, well-wrapped at room temperature, for 3-4 days.",
    "Notes",
    "*I did not remove the orange rind when taking pictures of this cake because it's prettier that way, but the rinds impart a slightly bitter flavor, so I'd recommend removing them.",
    "Cake recipe adapted from Dorie Greenspan's French Yogurt Cake in Baking: From My Home to Yours."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Blood Orange Topping on Cake:",
    "4 tablespoons unsalted butter",
    "1/3 cup brown sugar",
    "2 blood oranges, rinds removed* and thinly sliced",
    "Cake:",
    "1 cup all-purpose flour",
    "1/2 cup almond flour (or another 1/2 cup all-purpose flour)",
    "2 teaspoons baking powder",
    "Pinch of salt",
    "3/4 cup sugar",
    "Grated zest of 1 blood orange",
    "1/2 cup plain Greek yogurt",
    "3 large eggs",
    "1/2 teaspoon almond extract",
    "1/2 cup extra-virgin olive oil"
  ],
  "__v": 1
}