{
  "hash": "74054268cf896801349f9cfd17676b47e38541d3",
  "title": "Easy Seafood Paella Recipe",
  "image": "http://cdn3.themediterraneandish.com/wp-content/uploads/2015/04/Spanish-Seafood-Paella-Recipe-10.jpg",
  "href": "http://www.themediterraneandish.com/easy-seafood-paella-recipe/",
  "extension": "Chrome",
  "firstAdded": "2016-05-08T13:14:05.137000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large pot, bring 3 cups of water to a rolling boil. Add the lobster tails and let boil very briefly (1-2 minutes) until pink. Turn the heat off. Remove the lobster tails with a pair of tongs. Do not discard the lobster cooking water. When the lobster is cool enough to handle, remove the shell and cut into large chunks.",
    "In a large deep pan or skillet, heat 3 tbsp olive oil. Turn the heat to medium-high and add the chopped onions. Saute the onions for 2 minutes then add the rice, and cook for 3 more minutes, stirring regularly. Now add the chopped garlic and the lobster cooking water. Stir in the saffron and it's soaking liquid, paprika, cayenne pepper, aleppo pepper, and salt. Stir in the chopped tomatoes and green beans. Bring to a boil and let the liquid slightly reduce, then cover (with lid or tightly with foil) and cook on low heat for 20 minutes.",
    "Uncover and spread the shrimp over the rice, pushing it into the rice slightly. Add a little water if needed. Cover and cook for another 10-15 minutes until the shrimp turns pink. Finally, add the cooked lobster chunks. When the lobster is warmed through, turn heat off. Garnish with parsley.",
    "Serve the paella hot with your favorite white wine."
  ],
  "ingredients": [
    "0",
    "4 small lobster tails (6-12 oz each)",
    "Water",
    "3 tbsp olive oil",
    "1 large yellow onion, chopped",
    "2 cups Spanish rice or short grain rice, soaked in water for 15 minutes and then drained",
    "4 garlic cloves, chopped",
    "2 large pinches of Spanish saffron threads soaked in ½ cup water",
    "1 tsp paprika",
    "1 tsp cayenne pepper",
    "½ tsp aloppo pepper flakes",
    "Salt",
    "2 large Roma tomatoes, finely chopped",
    "6 oz French green beans",
    "1 lb prawns or large shrimp or your choice, peeled and deveined",
    "¼ cup chopped fresh parsley"
  ],
  "__v": 1
}