{
  "hash": "ce19fb37daf651e8e921c83d1825754ad88b9c68",
  "title": "Pressure Cooker Braised Short Ribs",
  "image": "http://cdn.marksdailyapple.com/wordpress/wp-content/themes/Marks-Daily-Apple-Responsive/images/blog/ShortRibs1.jpg",
  "href": "http://www.marksdailyapple.com/pressure-cooker-braised-short-ribs/",
  "firstAdded": "2015-01-26T05:25:36.306000",
  "users": [
    null
  ],
  "keywords": [
    "bonein",
    "beef",
    "short",
    "ribs",
    "long",
    "salt",
    "pepper",
    "coconut",
    "oil",
    "red",
    "onions",
    "coarsely",
    "garlic",
    "ginger",
    "allspice",
    "cumin",
    "broth",
    "water",
    "clove",
    "bay",
    "leaf",
    "cinnamon",
    "parsley",
    "cilantro",
    "riced",
    "cauliflower"
  ],
  "directions": [
    "0",
    "Instructions:",
    "Use a 6-quart or larger pressure cooker.",
    "Heat the coconut oil in the pressure cooker (no lid) over medium high heat. Add the meat in batches, browning all sides of the ribs. Remove from the pressure cooker and set aside.",
    "Add the onion, garlic and ginger. Sauté to soften the onion, 3 to 5 minutes. Add the allspice and cumin and mix well into the onion. Add the broth, water, clove, bay leaf and cinnamon stick. Stir up any bits of meat sticking to the bottom of the pot. Add the meat.",
    "Click the lid into place on the pressure cooker, making sure it’s secure. Over high heat, bring the pressure cooker to high pressure. Reduce to medium high and cook for 35 minutes. Turn off the heat and let the pressure come down naturally.",
    "Carefully remove the lid.",
    "Take the meat out.",
    "Pour the liquid through a find mesh strainer, discarding the solids. Skim excess fat off the top of the liquid or use a fat separator. Simmer the liquid a few minutes to thicken, or to thicken further and balance out any saltiness whisk in whole cream.",
    "Serve the sauce over the ribs and some vegetables (like roasted cauliflower or cauliflower rice). Garnish with parsley or cilantro.",
    "Not Sure What to Eat? Get the Primal Blu"
  ],
  "ingredients": [
    "0",
    "4 pounds bone-in beef short ribs, each about 2 to 3 inches (50 mm to 76 mm) long and thick, seasoned with salt and pepper (1.8 kg)",
    "2 tablespoons coconut oil (30 ml)",
    "1 1/2 red onions, coarsely chopped",
    "4 garlic cloves, finely chopped",
    "2-inch piece of ginger, finely chopped (50 mm)",
    "1/4 teaspoon allspice (a pinch)",
    "1/2 teaspoon cumin (2.5 ml)",
    "3/4 cup beef broth (180 ml)",
    "1/2 cup water (120ml)",
    "1 clove",
    "1 bay leaf",
    "1 cinnamon stick",
    "Finely chopped parsley or cilantro for garnish",
    "Riced cauliflower on the side"
  ],
  "__v": 1
}