{
  "hash": "1a85e2df3713cb352abd9c021fe11183ef7e2102",
  "title": "Foolproof Standing Rib Roast with Pan Sauce",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2013/5/15/0/ED0308H_foolproof-standing-rib-roast-with-pan-sauce-recipe_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/paula-deen/foolproof-standing-rib-roast-with-pan-sauce-recipe.html",
  "firstAdded": "2014-12-24T15:27:00.423000",
  "users": [
    null
  ],
  "keywords": [
    "standing",
    "rib",
    "roast",
    "paula",
    "deens",
    "house",
    "seasoning",
    "recipe",
    "follows",
    "beef",
    "stock",
    "canned",
    "broth",
    "sprig",
    "thyme",
    "deen",
    "merlot",
    "wine",
    "steak",
    "butter",
    "salt",
    "pepper",
    "garlic",
    "black"
  ],
  "directions": [
    "0",
    "For the roast: Preheat the oven to 375 degrees F. Allow the roast to stand at room temperature for at least 1 hour.",
    "Rub roast all over with the House Seasoning. Place the roast on a rack in a pan with the rib side down and the fatty side up. Roast for 1 hour. Turn off the oven. Leave the roast in the oven but do not open the oven door for another 3 hours.",
    "Thirty to forty-five minutes before serving time, turn the oven to 375 degrees F to reheat the roast. Do not remove the roast or re-open the oven door from the time the roast is put in until ready to serve.",
    "For the pan sauce: While the roast is resting, prepare the pan sauce. Skim off the fat from the pan drippings. Place the roasting pan over medium heat and add the stock and thyme. Bring to a boil and simmer for 5 minutes. Whisk in the steak sauce and butter. Add salt and pepper to taste. Serve warm alongside the rib roast.",
    "Mix the salt, garlic powder and black pepper together. Store in an airtight container for up to 6 months.",
    "Recipe courtesy Paula Deen"
  ],
  "ingredients": [
    "0",
    "One 5-pound standing rib roast",
    "1 tablespoon Paula Deen's House Seasoning, recipe follows",
    "2 cups beef stock or canned broth",
    "1 sprig fresh thyme or 1/2 teaspoon dried thyme",
    "2 tablespoons steak sauce, such as Paula Deen Merlot Wine Steak Sauce",
    "2 tablespoons butter",
    "Salt and pepper",
    "1 cup salt",
    "1/4 cup garlic powder",
    "1/4 cup black pepper"
  ],
  "__v": 1
}