{
  "hash": "e875cc4baa73e7cfa16db44645c6cb21cf0ec29e",
  "title": "Perfect Vegan Pie Crust",
  "image": "https://images.food52.com/YMGlcp3mvxETOUhTDAfuk3jMmMo=/753x502/24ec9b8b-23ee-4dc5-a502-a73916922082--food52_10-31-12-5604.jpg",
  "href": "https://food52.com/recipes/19559-perfect-vegan-pie-crust",
  "extension": "",
  "firstAdded": "2018-02-06T01:10:36.430000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "I like to use a food processor for my pie crusts, which would make some crust connoisseurs cringe, but is fast and easy. Start by placing the flour, salt, and sugar in the bowl of a food processor fitted with the S blade. Pulse to combine. Add your solid coconut oil and pulse until mixture is crumbly and will stick together when you squeeze it. Pulse in 1/3 cup water, or until the dough holds together well when you make a handful of it and is visibly starting to come together in the food processor. It’s fine to have a lot of crumbs still--that’ll make a good, flaky crust--but it should be easy to shape into a large ball, too. If necessary, add a little more water until the texture is right. Alternately, you can cut the oil into very small pieces and work them into the flour with bare, dry hands. Add the water and knead the whole mixture together until it has the texture described a moment ago.",
    "Turn dough onto a clean, dry surface that has been dusted with flour. If you’re not ready to use the crust, shape it into a flat ball, wrap with saran, place in a freezer bag, and freeze. If you are ready to use it but not this very second, you can store it in the fridge till it’s time to bake.",
    "When you are ready to use the crust, make sure it’s soft enough to roll, and use a rolling pin to roll the dough into a large circle--enough that you can imagine easily covering your pie pan--using extra flour to keep things from sticking as you go. Gingerly lift it onto your pie crust (little tears are fine, and you can fix them later). Squeeze the edges to make a pretty, puckered pattern. Refrigerate crust till you have the filling made and are ready to bake it."
  ],
  "ingredients": [
    "0",
    "2 1/4 cups all purpose flour",
    "1/2 cup (more as necessary) coconut oil, cool enough to be solid",
    "1 teaspoon salt",
    "1 tablespoon cane or demerara sugar",
    "1/3 - 1/2 cups ice water"
  ],
  "__v": 1
}