{
  "hash": "a4f1f93a99ad78715f414e80c43eac0d63e5e056",
  "title": "Indian Peanutty Noodles",
  "image": "",
  "href": "http://recipe-folder.com/recipe/5e5bb38c48b07208212956cd",
  "extension": "User Added",
  "firstAdded": "2020-03-01T13:07:24.863000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Roast the peanuts in a 350°F oven (or toaster oven, like I do) for 6 to 8 minutes, or until the nuts have turned dark brown, a shade darker than golden brown. Keep an eye on them! (After 3 minutes, turn the pan in such a way that the peanuts in the back come to the front.) Turn the oven off, take the peanuts out, and let cool.",
    "1",
    "In a food processor or blender, blitz all of the chutney ingredients (cumin powder, red chile powder, and salt) along with the peanuts into a coarse powder. Keep in a zip-top bag or tightly sealed jar.",
    "2",
    "Cook the noodles according to the instructions on their packet and set aside. Keep half a cup of water in which you boiled the noodles.",
    "3",
    "Heat the vegetable oil in a skillet. Add broccoli and saute for 5 minutes. Feel free to add broccoli stems too. Follow with red bell pepper for about 3 to 4 minutes. (We want both these vegetables to lose their raw flavor, yet still have a bite.) Feel free to substitute with vegetables of your choice as long as the vegetables retain some bite, shape and do not become mushy. Carrots, red onions, snap peas, zucchini, water chestnuts, baby corn, mushrooms, french beans are great substitutes. Add half of the scallions and let cook for a minute.",
    "4",
    "Add peanut chutney and mix well, followed by the soy sauce, and sauté till the sauce coats all of the vegetables.",
    "5",
    "Add boiled noodles and mix till the noodles are coated evenly with the soy sauce/peanut chutney mixture. Pour some of the starchy noodle water if you like your noodles wetter.",
    "6",
    "Garnish with rest of the scallions and serve hot with fresh red pepper chile garlic sauce on the side."
  ],
  "ingredients": [
    "0",
    "Peanut chutney",
    "1",
    "1 cup raw peanuts",
    "2",
    "1/2 teaspoon cumin powder",
    "3",
    "1/2 teaspoon red chile powder",
    "4",
    "1/4 teaspoon salt",
    "5",
    "Indian peanutty noodles",
    "6",
    "8 ounces udon or soba noodles",
    "7",
    "2 tablespoons vegetable oil",
    "8",
    "1 cup broccoli florets, chopped into 1-inch pieces",
    "9",
    "1 cup red bell pepper, chopped into 1-inch pieces",
    "10",
    "3/4 cup thinly sliced scallions, divided",
    "11",
    "2 tablespoons peanut chutney, prepared above",
    "12",
    "1 to 2 tablespoons light soy sauce, to taste"
  ],
  "__v": 1,
  "hidden": true
}