{
  "hash": "fa7b270374181de34eb4cd0f5a775a22c90d0cee",
  "title": "Blotkake (Norwegian Cream Cake)",
  "image": "https://static01.nyt.com/images/2016/11/12/dining/COOKING-BLOTKAKE1/COOKING-NORWEGIAN1-articleLarge.jpg",
  "href": "http://cooking.nytimes.com/recipes/1018389-blotkake-norwegian-cream-cake",
  "extension": "Chrome",
  "firstAdded": "2016-12-05T21:07:11",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "PREPARATION",
    "Bake the cake: Heat oven to 350 degrees and mist a 9-inch springform pan with cooking spray. Combine eggs, sugar and vanilla in a large bowl and beat with an electric mixer (or the whisk attachment of a stand mixer) until light and fluffy, 3 to 4 minutes.",
    "Sift cake flour and baking powder into a separate bowl, then fold into the egg mixture in 2 additions.",
    "Pour batter into pan and bake on the middle rack of the oven for 25 to 30 minutes, or until a cake tester inserted into the middle comes out clean. Let cool completely before removing from pan.",
    "Make the frosting and filling: Beat whipping cream, vanilla and confectioners’ sugar with an electric mixer until stiff peaks form. Transfer 1/3 of the whipped cream to a separate bowl and stir in preserves.",
    "Use a serrated knife to slice cake horizontally into 3 equal layers. Arrange top layer of the cake cut-side-up on a platter. Poke a few holes in the cake layer with a toothpick, then sprinkle with 1/3 of the liqueur or juice.",
    "Spread half the whipped cream and preserves mixture over the cake layer, then arrange middle layer on top. Poke holes in the middle layer with a toothpick and sprinkle with another 1/3 of the liqueur or juice. Top with remaining whipped cream and preserves mixture.",
    "Arrange the bottom cake layer on top of the stack, cut-side-down. Poke more holes and sprinkle with remaining liqueur or juice. Frost top and sides of cake with the whipped cream, using a pastry bag to pipe on stars or other designs, if you'd like. Decorate with fresh berries."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "FOR THE CAKE:",
    "Nonstick cooking spray",
    "4 large eggs",
    "1 cup/200 grams granulated sugar",
    "1 teaspoon vanilla sugar or 1 teaspoon vanilla extract",
    "1 cup/120 grams cake flour",
    "1 teaspoon baking powder",
    "FOR THE FILLING AND FROSTING:",
    "3 cups/720 milliliters whipping cream",
    "1 teaspoon vanilla extract",
    "2 tablespoons confectioners’ sugar",
    "3 tablespoons cloudberry, raspberry or blackberry preserves",
    "⅓ cup cloudberry or raspberry liqueur (such as Chambord), or berry juice of your choice",
    "12 ounces/340 grams fresh raspberries or blackberries, for decorating (optional)"
  ],
  "__v": 1
}