{
  "hash": "20c886a0d1a16b29e051e9be7eba8ae55a74baae",
  "title": "Butternut Squash Pie-Cake",
  "image": "//images.food52.com/bPeP5DbLl8YPwxIriX1RCViY1QQ=/753x502/6fe8d3b7-2f06-4978-946d-042b1aa55fdb--2015-1015_butternut-squash-pie-cake_james-ransom-025.jpg",
  "href": "https://food52.com/recipes/38760-butternut-squash-pie-cake",
  "extension": "Firefox",
  "firstAdded": "2015-11-08T17:34:30.196000",
  "users": [
    null
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "sugar",
    "baking",
    "kosher",
    "salt",
    "chilled",
    "unsalted",
    "butter",
    "cubes",
    "egg",
    "lightly",
    "cubed",
    "butternut",
    "squash",
    "brown",
    "divided",
    "zest",
    "juice",
    "orange",
    "honey",
    "olive",
    "oil",
    "cardamom",
    "hazelnuts"
  ],
  "directions": [
    "0",
    "In a food processor, pulse the flour with the sugar, baking powder, and salt. Add the 2 sticks butter and pulse until it forms pea-sized crumbs. Pour in the egg and pulse until the dough just comes together and forms large clumps.",
    "Put a large piece of plastic wrap on your work surface. Remove about 1/3 of the dough from the food processor, place it on the plastic wrap, and use the wrap to flatten it into a disk. Flatten the remaining dough into a disk on another piece of plastic wrap. Wrap each piece well and refrigerator for at least 1 hour.",
    "Now start on the squash. Preheat the oven to 425° F and line a rimmed baking sheet with parchment paper. In a large bowl, toss the squash with 1 tablespoon brown sugar and all of the ingredients except the hazelnuts. Make sure it is well coated in the oil, spices, and sweeteners. Bake for 20 to 25 minutes, stirring once or twice, until the squash is tender but not falling apart (it should be cooked to the point right before you'd want to eat it). Remove the squash from the oven and allow to cool.",
    "Turn the oven temperature down to 350° F. Grease a 9-inch pie dish (a slightly deeper dish than usual is better, and I used a glass pie dish so that I could monitor the browning). On a lightly floured work surface, use a rolling pin to roll the larger disk until it's 1/4- to 1/8-inch thick. Now is time to transfer it to the pie plate. You won't be able to transfer the dough in one go (as it crumbles apart), so just remove thin pieces and press them into the pie plate until you've got the whole thing over. You'll want to use the pads of your fingers to make sure the dough is uniformly thick around the bottom and edges of the pan. Reserve any scraps.",
    "Mix the hazelnuts into the cooled squash, then dump it into the prepared pie dish. Sprinkle the remaining 1 tablespoon of brown sugar evenly over the squash.",
    "Roll out the other piece of dough (it can be slightly thicker than the first piece—I rolled to about 1/2-inch thickness). Pinch off small pieces of the this disk and scatter, along with the scraps from the bottom dough, all over the squash, creating shingle-like pieces. (You might have some extra dough—I shaped mine into cookies and baked them for about 15 minutes!)",
    "Bake the cake until golden brown and bubbling in the center, about 1 hour 15 minutes. Transfer the cake to a rack and let cool completely before serving."
  ],
  "ingredients": [
    "0",
    "2 cups (9 ounces) all-purpose flour",
    "1 cup (7 ounces) sugar",
    "1 teaspoon baking powder",
    "1/2 teaspoon kosher salt",
    "2 sticks chilled unsalted butter, cut into 1/2-inch cubes",
    "1 large egg, lightly beaten",
    "1",
    "2 pounds peeled and cubed butternut squash (1/4- to 1/2-inch cubes)",
    "2 tablespoons brown sugar, divided",
    "Zest and juice of 1/2 orange",
    "1 tablespoon honey",
    "1 tablespoon olive oil",
    "1 teaspoon cardamom",
    "1/3 cup chopped toasted hazelnuts"
  ],
  "__v": 1
}