{
  "hash": "c4009cc33eb7ecebfeace58ca56b3ca2bba6f135",
  "title": "Stir-fried Eggplant, Potatoes & Peppers (Di San Xian - 地三鲜)",
  "image": "http://thewoksoflife.com/wp-content/uploads/2016/07/di-san-xian-7.jpg",
  "href": "http://thewoksoflife.com/2016/08/di-san-xian-stir-fry/",
  "extension": "Chrome",
  "firstAdded": "2016-08-03T18:08:13.233000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "First let’s prepare the following: smash and peel the garlic, chop the scallions, and mix the cornstarch with the water in a small bowl. Set everything aside.",
    "Then wash and wipe all the vegetables dry using a clean kitchen towel (this is key!) before cutting them into large bite-sized pieces. Don’t let the cut potato and eggplant sit for too long before cooking, because they will oxidize and become discolored.",
    "Now we’re ready to cook. Heat the oil in your wok over medium heat. Add the potato, and brown lightly for about 8 minutes until cooked through. Stir occasionally to avoid burning them. Now add the bell peppers, and stir-fry for another minute. Transfer everything to a dish and set aside.",
    "There should be oil left in the wok. Add the eggplant and brown slightly. I learned this technique from Bill: spread the eggplant pieces into a single layer, cover the lid for a minute, uncover, stir the eggplant to avoid burning, then repeat. Do this 2-3 times until the eggplant is cooked through. Transfer to a dish.",
    "Add a bit of oil if the wok is very dry at this point. In my case, the wok was still well-oiled, so I didn’t need additional oil. Add the garlic, cook it for a few seconds, and add all the vegetables back to the wok. Now quickly add the Shaoxing wine, light soy sauce, sugar, white pepper, and sesame oil. Stir and mix everything well. Time to turn up the heat and add the cornstarch slurry (stir well before adding, as the cornstarch settles to the bottom) and the scallions. Stir a couple of times to coat the vegetables with sauce, add salt to taste, and you’re ready to serve!"
  ],
  "ingredients": [
    "0",
    "3 cloves garlic, smashed and peeled",
    "2 scallions, chopped",
    "1½ tablespoons cornstarch",
    "3 tablespoons water",
    "2 long Chinese eggplants, cut on an angle into large bite-sized pieces",
    "1 large potato (about 8 ounces), peeled and cut on an angle into large bite-sized pieces",
    "½ red bell pepper, cut into large bite-sized pieces",
    "½ orange bell pepper, cut into large bite-sized pieces",
    "4 tablespoons oil",
    "1 tablespoon Shaoxing wine",
    "2 tablespoons light soy sauce",
    "½ teaspoon sugar",
    "¼ teaspoon white pepper",
    "½ teaspoon sesame oil",
    "Salt, to taste"
  ],
  "__v": 1
}