{
  "__v": 1,
  "directions": [
    "0",
    "How To Prepare Raj Kachori",
    "Sieve the sooji and maida in a bowl and add salt, 1 table spoon oil in it. Mix the ingredients well and knead the flour with water. Cover the dough and leave it for half an hour. Now punch the dough to make it smooth. Dough to make kachori is ready.",
    "Heat oil in a pan.",
    "Take a small portion of the dough and roll it with hands into a round ball. Now keep this ball on a rolling board and roll it into a flat disc of 3 inch.",
    "Put this kachori into the pan and fry it in the oil. Press the kachori so it rises well. As soon as the kachori rises, lower down the flame and fry till it turns brown in colour. Take out the kachori on a plate and prepare more kachoris in the same manner. Let it cool down.",
    "Kachori is ready. Now its time to stuff the kachori. We already have all the ingredients to stuff the kachori.",
    "Break the kachori from the center from the side which is thin to put the ingredients into it. Keep the kachori on a plate. Put 4-5 pieces of potatoes, 1 spoon boild moong, 2 dahi pakodi, 2-3 papadi dipped in curd, roasted cumin seeds, black pepper, red chilli powder, sweet chutney, curd, green chutney, sev bhujiya, pomegranate seeds, cumin seeds powder again, red chilli powder, coriander leaves, curd and chutney. Put these ingredients in the same given sequence.",
    "Raj Kachori is ready.",
    "You can substitute and reduce or increase the quantity of the ingredients while stuffing as per your taste. If you do not have papadi, then you can use the kachoris which did not rise while frying. Break them into small pieces and put it inside the kachori. You can use boiled peas, instead of channa."
  ],
  "firstAdded": "2014-03-31T14:42:19.226000",
  "hash": "02dd222e84ca9d12d44c47a2fc1c882bdfde7299",
  "href": "http://nishamadhulika.com/en/364-raj-kachori-recipe.html",
  "image": "http://nishamadhulika.com/files/raj-kachori-recipe.jpg",
  "ingredients": [
    "0",
    "Ingredients to Knead the flour to make Kachori.",
    "Sooji - 200 gms. (2 cup)",
    "Maida (all purpose flour) - 2 table spoon.",
    "Salt - 1/2 tea spoon. (according to the taste)",
    "Oil - to fry.",
    "Ingredients for Stuffing the Raj Kachori",
    "Potato - 2-3 (boiled) (chopped)",
    "Moong or channa - 1/2 cup (boiled)",
    "Small Papadi made of maida - 20",
    "Dahi pakodi - 10",
    "Curd - 400 gms. (2 cup) (whisked)",
    "Cumin seeds - 2 tea spoon (roast and grind)",
    "Black pepper - 1 tea spoon.",
    "Red chilli powder - 1 tea spoon.",
    "Sweet chutney - 1/2 cup.",
    "Green chutney - 1/2 cup.",
    "Sev bhuiya - 1/2 cup.",
    "Pomegranate - 1/2 cup (peeled)",
    "Coriander leaves - 1/2 cup (chopped)"
  ],
  "keywords": [
    "knead",
    "flour",
    "make",
    "kachori",
    "sooji",
    "gms",
    "maida",
    "purpose",
    "salt",
    "tea",
    "according",
    "oil",
    "fry",
    "stuffing",
    "raj",
    "potato",
    "boiled",
    "moong",
    "channa",
    "papadi",
    "dahi",
    "pakodi",
    "curd",
    "whisked",
    "cumin",
    "seeds",
    "roast",
    "grind",
    "black",
    "pepper",
    "red",
    "chilli",
    "chutney",
    "green",
    "sev",
    "bhuiya",
    "pomegranate",
    "coriander",
    "leaves"
  ],
  "title": "Raj Kachori",
  "users": [
    null
  ]
}