{
  "hash": "9da4ad1fa12bed6191b93f6bc7e604e239935cc1",
  "title": "Cinnamon Snap Cookies",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2010/12/cinnamon-snap-cookies.jpg",
  "href": "http://www.simplyrecipes.com/recipes/cinnamon_snap_cookies/",
  "extension": "Chrome",
  "firstAdded": "2015-10-21T19:38:48.769000",
  "users": [
    null
  ],
  "keywords": [
    "flour",
    "baking",
    "soda",
    "salt",
    "cinnamon",
    "ginger",
    "unsalted",
    "butter",
    "room",
    "sugar",
    "vanilla",
    "honey",
    "egg",
    "extra",
    "coating"
  ],
  "directions": [
    "0",
    "Sift together the flour, baking soda, salt, cinnamon, ginger, and cloves.",
    "Set aside.",
    "Beat the butter and sugar together in an electric mixer on medium speed until light and fluffy.",
    "Add the honey, egg, and vanilla extract and beat for another minute on medium until well incorporated. Be sure to pause halfway through to scrape down the sides and bottom of the bowl.",
    "Slowly mix in the dry ingredients and mix until they are incorporated into the dough and the dough is smooth.",
    "Lightly flour a work surface and divide the dough into two equal parts.",
    "Lightly roll them out into logs about 2-inches in diameter.",
    "Place them on pieces of plastic wrap and wrap them up and carefully smooth the logs out.",
    "Place in the freezer and chill at least 2 hours, preferably overnight.",
    "Preheat the oven to 350F and line two baking sheets with parchment paper or silicone mats.",
    "Set aside a small bowl and add some cinnamon and sugar in whatever proportions you enjoy best (I find 1/4 cup of sugar to a teaspoon of cinnamon is perfect for me, but taste and go with what works for you).",
    "Slice the dough into 1/4-inch rounds with a sharp knife.",
    "Take each round and press one side into the cinnamon sugar you mixed earlier.",
    "Place the dough round sugar-side up.",
    "Give the cookies plenty of space as they will spread when they bake.",
    "Bake for 10-13 minutes or until a dark golden-brown.",
    "Be sure to watch them very carefully after 10 minutes as they can burn very quickly.",
    "The cookies will puff up a bit and remain soft once out of the oven.",
    "Don't worry as they will become crisp as they cool.",
    "Allow the cookies to cool on the sheet for a minute before transferring to a wire rack to cool completely."
  ],
  "ingredients": [
    "0",
    "2 cups + 2 tablespoons flour",
    "1 1/2 teaspoons baking soda",
    "1/2 teaspoon salt",
    "1 tablespoon ground cinnamon",
    "1/2 teaspoon ground ginger",
    "1/4 teaspoon ground cloves",
    "12 tablespoons unsalted butter (3/4 cup or 1 1/2 sticks), at room temperature",
    "2/3 cup sugar",
    "1/2 teaspoon vanilla extract",
    "1/4 cup honey",
    "1 large egg",
    "extra sugar and ground cinnamon for coating"
  ],
  "__v": 3
}