{
  "__v": 1,
  "directions": [
    "0",
    "Add 1 inch of water to the bottom of a heavy-bottomed stock pot. Add the clams and lobster tails (if the lobster tails are already cooked, skip this step) to the water. Cover the pot and bring the water to a simmer over medium-high heat. Shake the pot a couple times and after 3 or 4 minutes, check to see if the clams have opened. If most of the clams have opened and a few remain closed, cover the pot and let them cook for another minute. If there are still shells that are completely closed, discard them. Drain the water off, remove the clams and lobster tails, rinse out the pot, and return it to the stove.",
    "Remove the clams from their shells by pulling them off the muscle attached to the shell. Remove the outer casings from the clam meat and chop the clams. Remove the lobster meat from the tail shells and roughly chop the meat. Set the clams and lobster aside and discard all of the shells.",
    "In a 3-quart saucepan, gently heat the seafood stock and water over medium-low heat - do not allow it to simmer.",
    "Meanwhile, set the large stock pot back over medium-high heat and add the bacon. Cook until it is almost crispy and then add the onions; cook until the onions have softened, about 5-7 minutes. Add the thyme and cook for 30 seconds. Whisk in the flour and cook for 1 minute, whisking constantly. Whisk in the warmed seafood stock/water mixture, scraping up any bits on the bottom of the pan. Add the bay leaf and potatoes. Allow the liquid to come to a simmer and thicken, about 5 minutes. Reduce the heat to medium. Add the scallops and shrimp and simmer the soup until the potatoes are fork-tender, about 5 to 7 more minutes. Stir the chopped clams and lobster into the soup.",
    "Stir in the cream, sherry, and parsley. Allow the cream to warm through in the soup for a couple of minutes but don't let the soup boil. Season with salt and pepper to taste - my soup needed 2 teaspoons of salt but yours may be different. Remove the bay leaf and serve hot. Leftovers can be kept refrigerated for up to 3 days or frozen for 2 months."
  ],
  "firstAdded": "2014-08-20T21:09:11.122000",
  "hash": "e7bf1463f1339ed7e555db9e73c9f3e32b1b1c71",
  "href": "http://www.smells-like-home.com/2013/09/new-england-seafood-chowder/",
  "image": "http://farm6.staticflickr.com/5478/9815613725_2758b23924_z.jpg",
  "ingredients": [
    "0",
    "1 ½ dozen little neck or cherrystone clams, shells scrubbed clean",
    "2 lobster tails (about 6 oz total)",
    "½ lb sea scallops, halved or quartered (if they are really big)",
    "¾ lb shrimp, peeled, deveined, and roughly chopped",
    "4 cups seafood stock",
    "2 cups water",
    "7 oz thick-cut bacon, chopped",
    "1 large onion, diced medium",
    "1 tbsp fresh thyme",
    "6 tbsp flour",
    "1 bay leaf",
    "1 lb Yukon gold potatoes, peeled and ½-inch diced",
    "1 ½ cups heavy cream or half-and-half",
    "1 tbsp dry sherry",
    "2 tbsp fresh parsley, chopped",
    "Coarse salt and freshly ground black pepper"
  ],
  "keywords": [
    "dozen",
    "neck",
    "cherrystone",
    "clams",
    "shells",
    "scrubbed",
    "clean",
    "lobster",
    "tails",
    "total",
    "scallops",
    "really",
    "shrimp",
    "roughly",
    "seafood",
    "stock",
    "water",
    "thickcut",
    "bacon",
    "onion",
    "medium",
    "thyme",
    "flour",
    "bay",
    "leaf",
    "yukon",
    "gold",
    "potatoes",
    "cream",
    "halfandhalf",
    "dry",
    "sherry",
    "parsley",
    "coarse",
    "salt",
    "black",
    "pepper"
  ],
  "title": "New England Seafood Chowder",
  "users": [
    null
  ]
}