{
  "hash": "760c5d2b8654d6e443ba03a45350db5dbd33ef6e",
  "title": "St. John Beans and Bacon",
  "image": "https://static01.nyt.com/images/2020/02/19/dining/18britsrex1/merlin_167663715_42b2294f-ef8c-478b-8e60-f0c4c3cad029-articleLarge.jpg",
  "href": "https://cooking.nytimes.com/recipes/1020868-st-john-beans-and-bacon?em_pos=medium&ref=headline&nl_art=1&te=1&nl=cooking&emc=edit_ck_20200219&campaign_id=58&instance_id=16085&segment_id=21410&user_id=4264688f24592aeeb06433e5d96d7150&regi_id=79859114emc=edit_ck_20200219",
  "extension": "Firefox",
  "firstAdded": "2020-02-25T00:37:23.406000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Drain the beans and put them in a medium pot. Cover by about 1 inch of cold water, bring to the boil, reduce to a simmer and cook until beans are thoroughly giving (but not mushy). This will take approximately 1 to 2 hours, depending on the freshness of the beans. Once cooked, remove from the heat, but keep them in their liquor so they do not dry out.",
    "Get a large, deep pan hot and add the duck fat (or oil). Add the lardons and cook over low heat to render the fat, stirring occasionally, about 20 minutes.",
    "In a saucepan, combine stock, garlic cloves and bouquet garni. Heat to a simmer then cook, 30 minutes. Turn off the heat and set aside.",
    "When the lardons are golden, remove with a slotted spoon. To the fat in the pan, add onions, leeks and celery, season with salt and cook until softened, about 10 minutes. Add the sage and the entire tin of tomatoes and their juices, crushing the tomatoes in your hands as you do so. Let this cook down for 15 minutes to thicken the tomatoes, stirring to remove all the good lardon bits that might adhere to the pan. Stir in 1 cup of the simmered stock. Season to taste.",
    "Drain the beans and add them to the pan with the tomato mixture. Add the lardons and 1 more cup stock and gently mix everything together. Season very well with salt and pepper. Cover and let cook over low heat for 10 to 20 minutes, adding stock a ladleful at a time if the mixture seems to be drying out. Serve hot."
  ],
  "ingredients": [
    "0",
    "1",
    "pound dried white beans, soaked overnight",
    "¼",
    "cup duck fat or extra-virgin olive oil",
    "1",
    "pound salt pork or pancetta, cut into large lardons (about 1/4 inch by 1 inch)",
    "1",
    "quart good-quality chicken or meat stock",
    "6",
    "garlic cloves, left whole (no need to peel)",
    "1",
    "large bouquet garni of sage, thyme, rosemary and parsley, tied",
    "2",
    "large white or yellow onions, chopped",
    "2",
    "leeks, trimmed, white and pale green parts thinly sliced",
    "3",
    "celery stalks, thinly sliced",
    "Sea salt and black pepper",
    "3",
    "tablespoons chopped fresh sage",
    "1",
    "(14-ounce) can Italian plum tomatoes and their juices"
  ],
  "__v": 1
}