{
  "hash": "aa7ceca811dbab88a2df3f9b3c4d9ac18c0f66bc",
  "title": "Kerryann’s tuna pasta bake",
  "image": "//cdn.jamieoliver.com/recipe-database/oldImages/335_448/1488_2_1432023782.jpg",
  "href": "https://www.jamieoliver.com/recipes/pasta-recipes/kerryann-s-tuna-pasta-bake/",
  "extension": "Chrome",
  "firstAdded": "2018-02-08T13:27:42.021000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 200ºC/400ºF/gas 6. Peel and finely chop the onion and garlic. Place a large shallow pan over a medium-high heat. Add 2 tablespoons of oil, the onion, garlic and chilli flakes (if using) and fry for 5 to 10 minutes, or until softened, stirring occasionally. Turn the heat up to high and pour in the chopped tomatoes. Tear the leaves from the basil stalks, keeping a few pretty ones aside for later, and stir them into the sauce. Bring to the boil, reduce the heat to low and simmer for 20 minutes.",
    "Meanwhile, place a large pan of water on to boil. Once boiling, add a good pinch of salt followed by the pasta. Cook according to the packet instructions, draining just before it’s done – it’ll finish cooking in the oven.",
    "Drain the tuna and stir through the sauce, making sure you don’t break it up too much. Season with a tiny pinch of salt and a generous pinch of black pepper. When the pasta is ready, drain and tip straight into the sauce. Toss and coat the pasta in the sauce, then transfer to an ovenproof baking dish (roughly 25cm x 30cm).",
    "Coarsely grate the cheese and sprinkle over the pasta. Arrange the reserved basil leaves on top, then sprinkle lightly with black pepper. Drizzle lightly with oil, then place in the oven for 15 to 20 minutes, or until golden and bubbling. Leave to stand for 5 minutes, then serve with a nice salad."
  ],
  "ingredients": [
    "0",
    "1 onion",
    "2 cloves of garlic",
    "olive oil",
    "1 pinch of dried chilli flakes",
    "3 x 400 g tins of chopped tomatoes",
    "1 bunch of fresh basil , (or use 1 teaspoon dried oregano instead)",
    "sea salt",
    "freshly ground black pepper",
    "500 g dried penne",
    "2 x 180 g tins of tuna from sustainable sources , (275g drained weight)",
    "150 g mature Cheddar cheese"
  ],
  "__v": 1
}