{
  "hash": "a8104dc8c1a5cd5e0f388759c240034a6b083e1b",
  "title": "Apple Cider Donuts",
  "image": "https://images.food52.com/fbqjS4fEiLOTWjr-SS51lmWSzqA=/753x502/e3ac5bf6-3a14-413d-bfdc-e0bc52ee213c--ZI4A3873.jpg",
  "href": "https://food52.com/recipes/24244-apple-cider-donuts",
  "extension": "Chrome",
  "firstAdded": "2018-01-02T16:45:01.431000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Bring the apple cider to a boil over high heat and cook it until it has reduced to 1/3 cup, 7-10 minutes. Set aside to cool while you prepare the rest of the donuts.",
    "Sift the cake flour, baking powder, salt and nutmeg.",
    "In the bowl of a stand mixer, mix the shortening and sugar together on medium speed until sandy. Add in the egg and egg yolk and mix on high until light and thickened, about 5 minutes.",
    "Mix the reduced apple cider and buttermilk together. Then add the flour mixture, alternating with the milk mixture to the mixer in three additions mixing until just combined. The dough will be soft and sticky much like cookie dough.",
    "Transfer the mixture to a clean bowl and cover with plastic wrap. Refrigerate the dough for at least one hour or overnight.",
    "When you are ready to roll and fry the donuts, heat a large pot or dutch oven with at least 2 inches of oil over medium heat until the oil reaches 370º on a candy thermometer. Gently roll the chilled dough out onto a generously floured board or piece of parchment paper into a circle about 1/2'' thick and about 8'' wide. Cut as many donuts and holes as possible, making sure to flour the cutters before each cut. Gently reroll the scraps and cut more holes. If at any time the dough becomes too soft to handle, just put it in the refrigerator for a few minutes. Place the cut donuts on a parchment lined baking sheet and refrigerate for 15 minutes until they are slightly firm and easier to handle. While the donuts are chilling, stir together the cinnamon and sugar for the topping in a shallow, wide bowl.",
    "Brush off any excess flour and fry the donuts for about 1 minute per side, being careful not to crowd the pan. When the donuts are deep golden brown on each side, remove them from the oil, gently blot off excess oil and toss immediately in the cinnamon sugar."
  ],
  "ingredients": [
    "0",
    "1 cup apple cider",
    "2 3/4 cups cake flour",
    "1 teaspoon baking powder",
    "1 teaspoon salt",
    "1/4 teaspoon freshly grated nutmeg",
    "2/3 cup sugar",
    "2 tablespoons non-hydrogenated shortening or lard",
    "1 egg",
    "1 egg yolk",
    "1/3 cup buttermilk",
    "canola oil, for frying",
    "1/2 cup sugar, for topping",
    "2 teaspoons cinnamon, for topping",
    "2 1/4'' circle cookie cutter",
    "1 1/4'' circle cookie cutter"
  ],
  "__v": 1
}