{
  "hash": "c668d34c2d434cf53930cb467f880b3abe8683f2",
  "title": "One Pot Middle Eastern Chicken and Rice",
  "image": "",
  "href": "http://www.evseats.com/one-pot-middle-eastern-chicken-rice/",
  "extension": "Chrome",
  "firstAdded": "2017-04-07T07:56:23.604000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine the chicken and all the ingredients for the chicken in a large resealable bag, and let marinade for at least 30 minutes (preferably over night for more flavor).",
    "Preheat the oven to 190C.",
    "In a large oven-safe skillet, heat 1 tbsp of olive oil over medium-high heat. Place the chicken in the skillet skin side down and cook until golden brown (about 3-5 minutes), then flip over and cook the other side until golden brown (another 3-5 minute).",
    "Remove the chicken and set aside.",
    "Remove any black or burnt bits from the pan, and add another tablespoon of olive oil to the pan over medium-high heat.",
    "Add the onions to the skillet with the oregano, turmeric, and cumin. Saute until the onions become translucent.",
    "Add the garlic and basmati rice and saute for 1 minute, just until the rice begins to turn golden.",
    "Add the chicken broth, water, and salt and bring to a simmer. Place the cooked chicken thighs directly on top of the rice and liquid. Once the liquid has begun to simmer, cover with a lid, and transfer to the oven to continue cooking.",
    "Bake in the oven for 30 minutes. After 30 minutes, remove the lid and continue to bake for an additional 15 minutes, until all the liquid has been absorbed.",
    "Remove from the oven and let sit for 10 minutes before serving. Garnish with grilled lemon slice and fresh parsley.",
    "Serve as is, or with Greek yoghurt and fresh kale that has been massaged with olive oil, salt, and pepper."
  ],
  "ingredients": [
    "0",
    "For Chicken",
    "6 skin on, bone in chicken thighs",
    "2 tbsp of lemon juice",
    "2 tbsp of turmeric",
    "1 tbsp of cumin",
    "½ tbsp of curry",
    "1 tbsp dried oregano",
    "4 garlic cloves, minced",
    "1 tsp of salt",
    "1 tsp of black pepper",
    "For Rice",
    "2 tbsp olive oil, divided",
    "1 small onion, finely chopped",
    "1 clove of garlic, finely minced",
    "350g cups basmati rice",
    "350ml cups chicken broth",
    "250ml cup water",
    "1 tbsp dried oregano",
    "1 tbsp of turmeric",
    "1 tsp of cumin",
    "1 tsp salt"
  ],
  "__v": 5
}