{
  "hash": "00fcb68ea928632b200db00b2e542becd5127a9a",
  "title": "Jerky ham hocks",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/298_1_1350548212_lrg.jpg",
  "href": "http://www.jamieoliver.com/recipes/pork-recipes/jerky-ham-hocks/",
  "firstAdded": "2014-12-31T14:52:47.691000",
  "users": [
    null
  ],
  "keywords": [
    "cured",
    "higherwelfare",
    "ham",
    "hocks",
    "ask",
    "butcher",
    "skin",
    "olive",
    "oil",
    "extra",
    "virgin",
    "clementine",
    "jerk",
    "seasoning",
    "garlic",
    "roughly",
    "scotch",
    "bonnet",
    "peppers",
    "deseeded",
    "red",
    "shallots",
    "sprigs",
    "thyme",
    "bay",
    "leaves",
    "level",
    "salt",
    "allspice",
    "runny",
    "honey",
    "golden",
    "rum",
    "wine",
    "malt",
    "vinegar"
  ],
  "directions": [
    "0",
    "Soak the ham hocks in a large bowl of water overnight to draw out the salt, then drain just before you want to cook them. Preheat the oven to 180°C/350°F/gas 4.",
    "For the jerk seasoning, blitz all the ingredients in a food processor until smooth. Pop some rubber gloves on, then rub the seasoning all over the ham hocks, drizzle them with oil, then place in a medium-sized roasting tray (roughly 25 x 30cm) and cover with tin foil. Cook in the oven for around 3½ hours, or until the meat is deliciously tender and falling off the bone. Turn the hocks 2 or 3 times during cooking to baste and really get all those beautiful flavours into the meat.",
    "Use your hands or a couple of forks to shred the ham off the bone, discarding the bones and any wobbly bits of fat. Drizzle with a little extra virgin olive oil and a good squeeze of clementine juice and this will keep in a sealed container in the fridge for up to a week – such a great trick to have up your sleeve.",
    "Here are a couple of great ways to use up your jerky ham:",
    "Reheat the jerky ham in a frying pan until crispy, sticky and golden. Knock up a nice little winter salad to go with it using chopped watercress, romaine and quartered radishes. Drizzle with extra virgin olive oil and a splash of balsamic vinegar or clementine juice, then top with the crispy pork. Cut a pomegranate in half, bash the seeds out with the back of a spoon and sprinkle over the salad. Delicious.",
    "Get yourself some nice wedges of crusty bread, some beautiful sliced tomatoes, a dollop of creamy mayo and some crisp lettuce. Sandwich it all together with a pinch of warmed up crispy ham and serve with pickles, gherkins and even a few crisps on the side – this is a BLT like you've never seen before."
  ],
  "ingredients": [
    "0",
    "4 x 500 g cured higher-welfare ham hocks, ask your butcher to skin them for you",
    "olive oil",
    "extra virgin olive oil",
    "1 clementine",
    "For the jerk seasoning",
    "3 cloves garlic, peeled and roughly chopped",
    "3 scotch bonnet peppers, deseeded and chopped",
    "3 red shallots, peeled and diced",
    "3 sprigs fresh thyme",
    "3 fresh bay leaves",
    "3 cloves",
    "3 level teaspoons sea salt",
    "3 teaspoons allspice",
    "3 teaspoons runny honey",
    "3 tablespoons golden rum",
    "3 tablespoons red wine vinegar or malt vinegar"
  ],
  "__v": 1
}