{
  "hash": "baabf2f6c8e79b50d590292e3e11a1f442e89ec2",
  "title": "Dark Chocolate Strawberry Cashew Truffles {Paleo & Vegan}",
  "image": "http://i1.wp.com/www.paleorunningmomma.com/wp-content/uploads/2016/03/Strawberry-cashew-truffles.jpg?resize=800%2C1105",
  "href": "http://www.paleorunningmomma.com/strawberry-cashew-truffles-paleo-vegan/",
  "extension": "Chrome",
  "firstAdded": "2016-03-12T13:25:04.096000",
  "users": [
    null
  ],
  "keywords": [
    "frozen",
    "strawberries",
    "defrosted",
    "water",
    "squeezed",
    "mashed",
    "creamy",
    "cashew",
    "butter",
    "maple",
    "syrup",
    "tapioca",
    "flour",
    "organic",
    "coconut",
    "vanilla",
    "free",
    "dark",
    "chocolate",
    "chips",
    "used",
    "enjoy",
    "life",
    "oil",
    "extra",
    "rolling",
    "mixture",
    "balls"
  ],
  "directions": [
    "0",
    "In a blender or food processor blend together the strawberries, cashew butter, maple syrup, vanilla, tapioca flour and 2 Tbsp of the coconut flour until a thick paste forms. Scrape the sides and stir together, then chill in the freezer for about 10 minutes to firm.",
    "While the mixture chills, make the chocolate shell by melting the chocolate chips and coconut oil together over very low heat while stirring continuously. Remove from heat once mixture has just melted and continue to stir until smooth.",
    "Remove the chilled mixture from freezer and stir in 1-2 more tsp coconut flour until you have a consistency that you can scoop (it will be sticky, that's okay.)",
    "To create the balls, rub coconut oil on your hands as needed to prevent sticking! Line a large baking sheet with parchment paper and scoop tbsp sized balls one at a time, rolling gently, then dipping in chocolate (I used a spoon for this) and placing on the sheet. You can do them in batches, chilling the mixture as needed and greasing your hands with coconut oil to prevent stickiness.",
    "Once all the mixture has been formed into balls and dipped in chocolate, chill in the freezer for 30 minutes or the refrigerator (fridge will take longer) until the chocolate has hardened.",
    "Store chilled in the freezer or fridge and enjoy!"
  ],
  "ingredients": [
    "0",
    "2 cups frozen strawberries, defrosted, most of the water squeezed out, and mashed",
    "⅔ cup creamy cashew butter",
    "2 tbsp pure maple syrup",
    "⅓ cup tapioca flour",
    "2 Tbsp + 1-2 tsp organic coconut flour*",
    "½ tsp pure vanilla extract",
    "1 and ½ cups dairy free dark chocolate chips (I used Enjoy Life)",
    "2 tsp organic coconut oil",
    "extra coconut oil for rolling mixture into balls**"
  ],
  "__v": 1
}