{
  "hash": "30e3d3174c2554d1180a3e3c9e3c229976eac1af",
  "title": "Mash of the Titans!",
  "image": "http://s3.amazonaws.com/hungry-girl/uploads/section_image/715/Mashies4_web3.png",
  "href": "http://www.hungry-girl.com/chew/show/2140-low-fat-garlic-mashed-potatoes-recipe?utm_source=about.com&utm_medium=article&utm_term=How-to-Make-Low-Calorie-Mashed-Potatoes&utm_campaign=about.com",
  "extension": "Chrome",
  "firstAdded": "2015-04-10T07:43:55.664000",
  "users": [
    null
  ],
  "keywords": [
    "head",
    "garlic",
    "olive",
    "oil",
    "mediumsized",
    "russet",
    "potato",
    "cauliflower",
    "florets",
    "fatfree",
    "whipped",
    "butter",
    "light",
    "buttery",
    "spread",
    "brummel",
    "brown",
    "salt",
    "black",
    "pepper",
    "chives"
  ],
  "directions": [
    "0",
    "Directions:",
    "Preheat oven to 425 degrees.",
    "Remove papery outer layer from garlic, leaving skins around the cloves intact. Slice off the top of the garlic head, 1/4 - 1/2 inch, exposing the tops of the cloves. Place garlic on a piece of foil, drizzle with oil, and use your fingers to coat. Wrap foil tightly around garlic, enclosing it completely. Place in a baking pan.",
    "Bake garlic in the oven for about 40 minutes, until soft enough to mash. Set aside to slightly cool.",
    "Meanwhile, bring a large pot of water to a boil on the stove. While waiting for the water to boil, peel and cube the potato. Add potato and cauliflower to boiling water. Return to a boil, and then reduce heat to medium. Cook until potato and cauliflower are very tender, 15 - 20 minutes.",
    "Drain water and transfer potato and cauliflower to a large bowl; set aside. Once foil-wrapped garlic is cool enough to handle, unwrap garlic and remove cloves; discard skin. Add the soft cloves to the large bowl.",
    "To the bowl, add half & half, butter, and salt. Mash it all together with a potato masher, until completely blended. If you like, season to taste with pepper and additional salt. If needed, bring to desired temperature in the microwave or oven. Top with chopped chives, if you like, and enjoy!"
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "1 head of garlic",
    "1 tsp. olive oil",
    "1 medium-sized russet potato (about 12 oz.)",
    "5 cups cauliflower florets (about 1 head)",
    "3 tbsp. fat-free half & half",
    "2 tbsp. light whipped butter or light buttery spread (like Brummel & Brown)",
    "1/2 tsp. salt, or more to taste",
    "Optional: black pepper, chopped chives"
  ],
  "__v": 1
}