{
  "hash": "785c7ef9fa68e616fe90a9f419011e875738118e",
  "title": "Smoked Salmon Corn Chowder",
  "image": "http://tastykitchen.com/recipes/wp-content/uploads/sites/2/2013/06/Smoked-Salmon-Corn-Chowder-by-Jessie-on-June-23-2013-410x273.jpg",
  "href": "http://tastykitchen.com/recipes/soups/smoked-salmon-corn-chowder/",
  "extension": "Chrome",
  "firstAdded": "2017-03-21T18:01:39.573000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large soup pot, heat oil over medium-high heat. Add onion, garlic, salt and pepper and cook until onion is translucent, about 3 minutes.",
    "Add flour to pot and stir to incorporate all ingredients and form a roux. Cook 1 minute.",
    "Add a few tablespoons of stock and stir until any lumps of flour are worked out. Add the rest of the stock and stir to combine.",
    "Tie thyme, bay leaves, and parsley together with a piece of kitchen twine to form a bouquet garni. Add to the soup and stir.",
    "Add chopped potatoes to soup and stir. Bring to a simmer, then cook 20-25 minutes until potatoes have cooked and stock has reduced.",
    "Add milk and half-and-half to soup and stir. Return soup to a simmer and cook 10 minutes so that the milk has a chance to reduce.",
    "Flake the smoked salmon into the soup, then add the corn kernels. Cook an additional 10-15 minutes until soup has reduced to the desired consistency. Remove bouquet garni before serving.",
    "Ladle into bowls and garnish with extra smoked salmon and chopped green onions. Serve immediately."
  ],
  "ingredients": [
    "0",
    "3 Tablespoons Extra Virgin Olive Oil",
    "½ whole Yellow Onion, Diced",
    "2 cloves Garlic, Minced",
    "1 pinch Salt And Pepper, to taste",
    "3 Tablespoons Flour",
    "3-½ cups Chicken, Turkey Or Vegetable Stock",
    "5 sprigs Fresh Thyme",
    "2 whole Bay Leaves",
    "4 sprigs Fresh Parsley",
    "3 whole Red Potatoes, Diced",
    "¼ cups Milk (I Use Skim)",
    "1 cup Half-and-half",
    "4 ounces, weight Smoked Salmon, Plus Extra For Garnish",
    "1 cup Cooked Corn Kernels (I Like To Grill Mine!)",
    "4 whole Green Onions, Chopped For Garnish"
  ],
  "__v": 1
}