{
  "__v": 1,
  "directions": [
    "0",
    "Procedimento:",
    "Mescolare la farina 00 e la farina di semola su una superficie di lavoro, meglio in legno, e formare una fontana con un buco ampio e profondo nel mezzo. Lì rompere le uova, aggiungere l’olio e il sale e cominciare pian piano con una forchetta ad amalgamare uova e farina. Quando la consistenza è briciolosa, impastare con le mani aggiungendo se necessario qualche cucchiaio di acqua fredda.",
    "Continuare ad impastare, più si impasta e più si formerà glutine, dando resistenza alle sfoglie di pasta.",
    "Quando la palla di pasta sarà liscia, vellutata e non più appiccicosa, avvolgerla nella pellicola trasparente e lasciarla riposare per 30 minuti a temperatura ambiente.",
    "Dopo i 30 minuti di riposo, tirare la sfoglia. Qualunque sia il modo che si preferisce usare – con la macchina a mano, elettrica o il mattarello -, tirare una sfoglia il più possibile sottile, larga e regolare.",
    "Ungere il fondo delle teglie e coprirle con un primo strato di pasta fresca. Distribuire uniformemente i pomodori pachino tagliati in quattro parti, la mozzarella fiordilatte affettata sottile, abbondanti foglie di basilico fresco, il parmigiano grattato, un po’ di sale e pepe nero macinato fresco e condire con un filo d’olio extravergine di oliva.",
    "Continuare così facendo circa 4 strati per ogni teglia e finire con la pasta fresca, cosparsa di parmigiano e un filo d’olio extravergine di oliva.",
    "Cuocere in forno caldo a 180°C per almeno 30 minuti, finché la pasta non è cotta e le lasagne non sono dorate in superficie. Lasciar riposare una mezzoretta in forno tiepido prima di servire."
  ],
  "firstAdded": "2014-10-12T13:48:45.456000",
  "hash": "98c8e3c20f0d433895d324264173e18b12839ce8",
  "href": "http://it.julskitchen.com/primi-piatti/pasta-fresca/lasagne-vegetariane",
  "image": "http://farm7.static.flickr.com/6126/5987298892_a93d118ebb_b.jpg",
  "ingredients": [
    "0",
    "Per il ripieno: 2 kg di pomodori pachino, tagliati in quatto parti - 1,5 kg di mozzarella fiordilatte - 400 g di Parmigiano Reggiano grattato - basilico fresco - olio extravergine di oliva - sale - pepe nero appena macinato"
  ],
  "keywords": [
    "ripieno",
    "pomodori",
    "pachino",
    "tagliati",
    "quatto",
    "parti",
    "mozzarella",
    "fiordilatte",
    "parmigiano",
    "reggiano",
    "grattato",
    "basilico",
    "fresco",
    "olio",
    "extravergine",
    "oliva",
    "sale",
    "pepe",
    "nero",
    "appena",
    "macinato"
  ],
  "title": "LASAGNE AI POMODORI PACHINO E MOZZARELLA FIORDILATTE",
  "users": [
    null
  ]
}