{
  "hash": "588782744e66a6584e9030809dc8db79444b5f5c",
  "title": "Buckwheat Pancakes",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2011/04/buckwheat-pancakes-horiz-a-1600.jpg",
  "href": "https://www.simplyrecipes.com/recipes/buckwheat_pancakes/",
  "extension": "",
  "firstAdded": "2018-01-28T00:59:09.252000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Pre-heat skillet: Heat a well-seasoned griddle, cast iron skillet, or stick-free pan on medium heat. The pan or griddle should be ready for the batter as soon as it is mixed.",
    "2 Make pancake batter: Whisk together the dry ingredients—the flours, sugar, salt, baking soda—in a large bowl.",
    "In Pour the melted butter over the dry ingredients and start stirring.",
    "Beat the egg with a fork and stir it into half of the buttermilk. Add the buttermilk/egg mixture to the dry ingredients, then slowly add in the rest of the buttermilk as needed to get to the right consistency for your batter (you may not need all of the buttermilk, depending on what type of buttermilk you are using and the brand of flour).",
    "Stir only until everything is combined. Do not over-mix! A few lumps are fine.",
    "3 Ladle batter onto hot pan: Put a small amount (a half teaspoon) of vegetable oil on the pan or griddle and spread it around with a paper towel to coat.",
    "Ladle the batter onto the hot surface to the desired size, about 4-5 inches wide. (A 1/4 cup measure will ladle about a 4-inch pancake.) Reduce the heat to medium-low. Allow the pancake to cook for 2-3 minutes on this first side.",
    "4 Flip pancakes over to other side: Watch for bubbles on the surface of the pancake. When air bubbles start to rise to the surface at the center of the pancake, flip the pancake. Cook for another 1-2 minutes, or until nicely browned.",
    "5 Keep finished pancakes warm: Keep your pancakes warm on a rack in the oven set on \"warm,\" or stack them on a plate and cover with a towel as you make more. Spread more oil on the pan as needed between batches of pancakes.",
    "Serve with butter and maple syrup."
  ],
  "ingredients": [
    "0",
    "Vegetable oil for coating the pan",
    "3/4 cup (100g or 3.5 oz) buckwheat flour",
    "3/4 cup (100g or 3.5 oz) all-purpose flour (can sub with buckwheat flour for a 100% gluten-free buckwheat pancake if you wish)",
    "3 Tbsp sugar",
    "1/2 teaspoon salt",
    "1 teaspoon baking soda",
    "3 Tbsp unsalted butter, melted",
    "1 egg (optional)",
    "2 cups (475 ml) buttermilk"
  ],
  "__v": 1
}