{
  "hash": "e955b4a6e95aa5d07e3ef7ae21f80f8adc1053f7",
  "title": "Moroccan Lamb Shoulder with Preserved Lemon Couscous and Spiced Crème Fraîche",
  "image": "http://prodstatics3cdn1.tastingtable.com/images/articles/2013_04/CRE64_0313_lamb_549x305.jpg",
  "href": "http://www.tastingtable.com/entry_detail/chefs_recipes/13236/Moroccan_Lamb_Shoulder_with%C2%A0Lemon_Couscous_Recipe.htm",
  "firstAdded": "2015-01-20T19:40:53.783000",
  "users": [
    null
  ],
  "keywords": [
    "curry",
    "cinnamon",
    "coriander",
    "boneless",
    "lamb",
    "shoulder",
    "roast",
    "kosher",
    "salt",
    "divided",
    "crme",
    "frache",
    "water",
    "couscous",
    "lemon"
  ],
  "directions": [
    "0",
    "Make the lamb: Preheat the oven to 350°. In a small bowl, mix together the curry powder, cinnamon and coriander. Set the lamb on a cutting board and if the roast is tied, remove and discard the string. Rub the spices all over both sides of the lamb, then rub with 1 tablespoon of the salt. Roll the lamb into a tidy roast and use butcher's twine to retie the lamb in 1½-inch intervals. Place the lamb in a baking dish and roast until an instant-read thermometer inserted into the thickest part of the lamb reads 140°, about 1 hour and 10 minutes. Remove from the oven, loosely tent with aluminum foil and set aside to rest for 15 minutes.",
    "While the lamb rests, make the couscous: Bring the water to a boil in a medium saucepan. Add the couscous and the salt. Stir, cover the saucepan and turn off the heat. Let the couscous absorb the water until it is fluffy and tender, about 5 minutes. Remove the lid and use a fork to stir in the preserved lemon.",
    "In a medium bowl, mix together the crème fraîche, ras el hanout (if using) and remaining ½ teaspoon of salt. Carve the lamb crosswise into thin slices and serve with the couscous and a dollop of the spiced crème fraîche."
  ],
  "ingredients": [
    "0",
    "2 tablespoons curry powder",
    "1 tablespoon ground cinnamon",
    "1 tablespoon ground coriander",
    "3- to 3½-pound boneless lamb shoulder roast",
    "1 tablespoon plus ½ teaspoon kosher salt, divided",
    "1 cup crème fraîche",
    "1 cup water",
    "1 cup couscous",
    "½ teaspoon kosher salt",
    "2 teaspoons finely diced preserved lemon"
  ],
  "__v": 1
}