{
  "hash": "8677f3d0cd80d8121e709014fd299aef1718e42e",
  "title": "kasha with Kale",
  "image": "http://www.savvyvegetarian.com/images/recipes/kasha-with-kale-275x242.jpg",
  "href": "http://www.savvyvegetarian.com/vegetarian-recipes/kasha-with-kale.php",
  "extension": "Chrome",
  "firstAdded": "2015-08-17T08:10:04.497000",
  "users": [
    null
  ],
  "keywords": [
    "buckwheat",
    "groats",
    "salt",
    "extravirgin",
    "olive",
    "oil",
    "onions",
    "garlic",
    "aleppo",
    "pepper",
    "cayenne",
    "foraging",
    "flavor",
    "black",
    "coarsely",
    "kale",
    "leaves",
    "firmly",
    "bunches",
    "zest",
    "juice",
    "lemon",
    "raw",
    "pumpkin",
    "seeds",
    "dimension",
    "heat",
    "distinctive",
    "sweetsour",
    "reminiscent",
    "sundried",
    "tomatoes"
  ],
  "directions": [
    "0",
    "Directions:",
    "Fill a large pot about 2/3 full with water and bring to a boil over high heat.",
    "Add the buckwheat and 3/4 tsp of the salt, stirring well. Return to a boil.",
    "Decrease the heat to medium and simmer until tender, about 12 minutes. Drain and set aside.",
    "Put the oil in a large saucepan over medium-high heat and add the onion. Cook, stirring frequently, until the onions soften and just begin to brown at the edges, about 5 minutes.",
    "Add the garlic, optional Aleppo pepper, and black pepper, and cook stirring constantly, until the garlic begins to color lightly, about 1 minute",
    "Add the kale and stir until well combined. Cook stirring frequently until the kale wilts, about 2 minutes.",
    "Add the remaining 1/4 tsp salt and cook, stirring frequently, until the kale is tender, 5 - 7 minutes. Add a small amount of water, about 1 tabelspoon at a time, as needed to keep the mixture moist.",
    "When the kale is tender, add the buckwheat, stirring until well combined.",
    "Cook, stirring almost constantly, ntil warmed through, 3 to 5 minutes",
    "Remove from the heat and stir in the pumpkin seeds, lemon zest, and lemon juice until well combined",
    "Serve at once"
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "1 1/2 cups buckwheat groats",
    "1 tsp sea salt",
    "1 Tbsp extra-virgin olive oil",
    "3 cups diced onions",
    "4 cloves garlic, minced",
    "2 tsp crushed Aleppo pepper, or 1.2 tsp cayenne (see Foraging for Flavor below)",
    "1/4 tsp freshly ground black pepper",
    "2 cups coarsely chopped kale leaves, firmly packed (about 2 large bunches)",
    "Zest and juice of 1 lemon",
    "1/3 cup raw or toasted pumpkin seeds",
    "Foraging for Flavor: Aleppo pepper is optional here, but including it will add both the dimension of heat and it's own distinctive flavor, a sweet-sour note reminiscent of sun-dried tomatoes."
  ],
  "__v": 1
}