{
  "hash": "271cb8cb42beb9855f23d63851472614c96de846",
  "title": "GROENTESTOOFSCHOTEL MET POMPOEN",
  "image": "https://www.iamafoodie.nl/wp-content/uploads/2016/12/Bestand-01-12-16-19-00-12-690x554.jpg",
  "href": "https://www.iamafoodie.nl/kerstrecept-hoofdmaaltijd-groentestoofschotel-pompoen/",
  "extension": "Chrome",
  "firstAdded": "2016-12-21T20:41:40.431000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Stap voor Stap:",
    "Verwarm de oven voor op 200 graden Celsius.",
    "Leg een theedoek onder de pompoen zodat de pompoen tijdens het snijden niet weg glijdt. Snijd de pompoen door midden en verwijder de draden en pitten. Besprenkel de pompoenhelften met olie en plaats ze in de oven voor 30 minuten*.",
    "Snijd de courgette, paprika en tomaten in stukjes en snijd de broccoli in kleine stronkjes.",
    "Doe de olie in een braadpan en voeg de courgette, paprika, tomaten en broccoli toe. Voeg vervolgens 1 dl water toe + de Al-Anadalus kruiden en laat het geheel 15 minuten stoven op zacht vuur. Regelmatig omscheppen is belangrijk!",
    "Check tussendoor hoe het met de pompoen gaat!",
    "Voeg de kikkererwten doe en laat het nog 5 minuten stoven op zacht vuur.",
    "Prik met een vork in de pompoen om te controleren of het vruchtvlees gaar is. Haal de pompoenhelften uit de oven als het vruchtvlees gaar is.",
    "Lepel een deel van het vruchtvlees van de pompoen eruit en voeg dit toe aan de stoofschotel, laat het nog 1-2 minuten stoven en haal vervolgens de stoofschotel van het vuur af.",
    "Presenteer de groentestoofschotel in de pompoen en voeg wat koriander en tomaat toe voor de garnering."
  ],
  "ingredients": [
    "0",
    "Ingrediënten voor 4 personen:",
    "2 pompoenen",
    "1 courgette",
    "4 tomaten",
    "1 paprika",
    "1 kleine stronk broccoli",
    "400 gram kikkererwten",
    "1 dl water",
    "5 eetlepel Al-Andalus kruiden van Jonnie Boer",
    "Verse koriander",
    "3 eetlepels olie (waarvan 1 eetlepel om pompoen mee te besprenkelen)",
    "Voor variatie kan je natuurlijk ook andere groentesoorten gebruiken zoals wortel, aubergine, sperziebonen, gele of oranje paprika, groene aspergetips of bloemkool!"
  ],
  "__v": 1
}