{
  "hash": "2075b452d991e05ef50da53530387c8c6f46bfe3",
  "title": "THE BEST GLAZED ORANGE SWEET ROLLS",
  "image": "http://cdn.averiecooks.com/wp-content/uploads/2014/06/orangesweetrollstext.jpg",
  "href": "http://www.averiecooks.com/2014/06/the-best-glazed-orange-sweet-rolls.html",
  "extension": "Chrome",
  "firstAdded": "2016-07-29T16:36:09.537000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "dough:",
    "in a stand mixer with dough hook, add 3 cups of flour, sugar, salt and yeast, set aside.",
    "melt dough butter in bowl",
    "add buttermilk to melted butter and heat until warm, NOT HOT, don't kill the yeast",
    "add buttermilk mixture to dry ingredients",
    "beat the eggs and then add to the bowl",
    "turn mixer speed on low and knead dough for 5 to 7 minutes. If dough is too wet add 1/4c flour as needed. remember though, the more flour added the denser the rolls will be. if too dry add more buttermilk until desired consistency is reached.",
    "remove dough from mixing bowl and put in a lightly oiled bowl",
    "cover bowl with plastic and place in a warm spot for 2-2 1/2 hours or until dough has doubled in size (may take longer)",
    "after dough has doubled in size punch it down and place on floured surface. with a rolling pin or hands roll dough into a 26 x 13 rectangle, making sure edges are as straight as you can make them.",
    "butter dough surface while leaving a 1/2 inch border around it",
    "spread out about 3/4c of marmalade, keeping it thin-ish so that it doesn't spill out the sides, leavng the same 1/2 border.",
    "starting with the long end (The 26 inch side) roll the dough up tightly, sealing the seam.",
    "using dental floss, cut dough into 20 or so, even rolls, you can use a knife to make hash marks before you start cutting to make sure you keep them even.",
    "arrange rolls in pan and cover with plastic wrap.",
    "if baking rolls straight through, preheat oven to 375F",
    "if baking straight away, let rolls sit out and double in size again. if making overnight rolls, cover with plastic wrap and place in fridge overnight or 16 hours.",
    "IF MAKING OVERNIGHT ROLLS: take out of fridge and let sit out until rolls have doubled in size, then proceed to make them the same as if you were straight through.",
    "bake in preheated oven at 375F for 15 minutes or until golden brown on top and cooked through, may need more minutes depending on oven",
    "orange glaze:",
    "while rolls are baking add orange juice, vanilla, powdered sugar and salt in mixing bowl and whisk until combined.",
    "whisk in about 2 teaspoons of the orange zest",
    "pour glaze over rolls a few minutes after rolls are done baking so the glaze can soak into them.",
    "sprinkle remaining orange zest over rolls",
    "best served right after done baking, can be frozen up to 6 months"
  ],
  "ingredients": [
    "0",
    "3 cups all-purpose flour, or as needed",
    "1/4 cup granulated sugar",
    "2 1/4 teaspoons instant dry yeast (one 1/4-ounce packet, I use Red Star Platinum)",
    "pinch salt, to taste",
    "1/2 cup unsalted butter, melted (1 stick)",
    "1/2 cup buttermilk",
    "2 large eggs, lightly whisked",
    "Filling",
    "6 tablespoons unsalted butter (3/4 of 1 stick), very soft - let it sit out while dough rises",
    "about 1 cup orange marmalade",
    "1/2 cup light brown sugar, packed",
    "Orange Glaze",
    "1/4 cup orange juice",
    "1/2 teaspoon vanilla extract (orange extract may be substituted)",
    "2 cups confectioners' sugar",
    "pinch salt, optional and to taste (helps balance the sweetness)",
    "about 3 tablespoons milk or cream, or as needed for consistency",
    "3 teaspoons orange zest, divided"
  ],
  "__v": 2
}