{
  "hash": "6199fcd9e19e7bc62562d043de5d61f5166a603a",
  "title": "MEDITERRANES OFENGEMÜSE MIT QUARKDIP",
  "image": "https://www.almased.ch/fileadmin/user_upload/content-images/40_00_Rezepte/40_20_60_Vegetarsich/Detail/3_11_Ofengemuese_m_Quarkdip_679.jpg",
  "href": "https://www.almased.ch/rezepte/vegetarische-gerichte/mediterranes-ofengemuese-mit-quarkdip/",
  "extension": "",
  "firstAdded": "2018-04-25T15:53:35.351000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Ein Backblech mit Backpapier auslegen. Den Ofen auf 180 °C (Umluft 160 °C) vorheizen.",
    "Oreganoblättchen und Rosmarinnadeln grob hacken, mit Rapsöl, Pfeffer und Salz vermischen.",
    "Die Kartoffeln waschen, halbieren und mit der Schnittseite auf einem Viertel des Backblechs verteilen.",
    "Das Gemüse waschen, putzen und in ca. 1 cm dicke Scheiben schneiden, Paprikaschoten achteln. Die Zwiebel schälen und achteln.",
    "Das Gemüse mit dem Kräuteröl vermischen und auf das Backblech legen. Das restliche Öl über die Kartoffeln träufeln.",
    "Knoblauch in der Schale ebenfalls auf dem Backblech verteilen und das Ganze ca. 20 Minuten im Ofen garen.",
    "In der Zwischenzeit den Quarkdip herstellen: Die Kräuter waschen und klein schneiden. Den Quark mit dem Mineralwasser glatt rühren, mit Pfeffer, Paprika und Salz würzen, die Kräuter unterrühren.",
    "Zusammen mit Gemüse und Kartoffeln vom Blech anrichten und servieren."
  ],
  "ingredients": [
    "0",
    "ZUTATEN (FÜR 2 PERSONEN):",
    "1 EL Rosmarinnadeln 1/2 Bund Oregano 3 EL Rapsöl 200 g kleine Kartoffeln (Drillinge, vorwiegend festkochend) 120 g Karotte 400 g Aubergine 200 g Zucchini 150 g rote Paprikaschote 250 g Kirschtomaten 1 mittelgroße Zwiebel 5 Knoblauchzehen schwarzer Pfeffer grobes Meersalz 200 g Magerquark 50-75 ml Mineralwasser mit Kohlensäure 1 Prise Paprikapulver 6 Stiele Petersilie 1/2 Bund Schnittlauch",
    "15 min 1 Portion enthält ca. 397 kcal und 3,4 BE"
  ],
  "__v": 1,
  "hidden": true
}