{
  "hash": "3ca1777ff0245bfa759d5c7682cb5b1f3b6795e2",
  "title": "Mediterranean Spiral Pasta",
  "image": "http://www.recipe30.com/wp-content/uploads/2017/03/Mediterranean-Spiral-Pasta-848x477.jpg",
  "href": "http://www.recipe30.com/mediterranean-spiral-pasta.html/",
  "extension": "Chrome",
  "firstAdded": "2017-04-07T20:30:30.660000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large pot, add water for your pasta, bring to the boil and add salt once it boils.",
    "Trim the top and tail of your eggplant. Slice length wise. You should get six good slices plus the end trimmings.",
    "Remove the stem and seeds from capsicum (bell pepper) and slice lengthwise into nice flat pieces. Trim off any white parts so you get even cooking.",
    "Place a griddle on high heat, brush with a little olive oil when hot and grill the eggplant first. Flip over and do both sides. Set aside to cool down. Once cool cut width wise about the same size as the pasta shape. Repeat process with capsicum (bell pepper).",
    "Pit the olives and cut into halves if small or quarters if large. Set aside.",
    "In a frying pan on moderate heat, add 2 tbsp olive oil, the garlic, minced. Sweat a little, do not brown and add the tomato passata. Season with salt and pepper. Add the olives, sun dried tomatoes, capsicum, eggplant and thin down the sauce with some pasta water.",
    "Drain and add the pasta, toss or mix well. Add more pasta water to adjust consistency of sauce.",
    "Using your hands, crumble the feta cheese over the pasta (keep a little for later) and mix well. Place in the serving plates.",
    "Tear off some fresh basil leaves and shred them by rolling them up like a tight cigar and cutting with a knife. Place basil on top and a little more crumbed feta cheese."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "13oz - 375g (approx 4½ cups) Fusilli pasta (spiral)",
    "2 red capsicums (bell pepper)",
    "1 egg plant",
    "½ cup sundried tomatoes",
    "½ cup green olives",
    "2 cups of passata, or tomato purée",
    "1 cup of fresh basil",
    "4 garlic cloves",
    "4 tbsp olive oil",
    "salt and pepper"
  ],
  "__v": 1
}