{
  "hash": "4c4a66b1b8b31c2ea52ab4adf36d6a6d73e13ef3",
  "title": "Chickpea Bolognese",
  "image": "https://images.food52.com/ibqWMlfMAsy-XAreSpMaC2dS_Pk=/753x502/a292a2a3-7701-4f54-bc43-391c16854080--2014-0422_finalist_chickpea-bolognese-228.jpg",
  "href": "https://food52.com/recipes/27654-chickpea-bolognese",
  "extension": "Chrome",
  "firstAdded": "2018-01-05T13:02:11.140000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Pour the cup of boiling water over the porcini and let steep for about 30 minutes.",
    "Meanwhile, place the onion, celery, carrot, garlic, and pancetta in the bowl of a food processor and process until not quite smooth. You want a little texture here.",
    "Heat the 4 tablespoons of oil in a Dutch oven and add the chickpeas. Sauté over medium heat for a few minutes, making sure the chickpeas are coated with the oil. Add the processed mixture and continue to sauté until the vegetables soften and become fragrant.",
    "Add the basil, oregano, and crushed red pepper flakes and continue to sauté another minute or two. Remove the porcini mushrooms from the soaking liquid and chop finely. Add them to the pot. Strain and reserve the liquid.",
    "With your clean hands, crush the tomatoes and add them to the pot along with the wine and the porcini soaking liquid. Bring up to a simmer and simmer, partially covered, for about an hour. Stir occasionally.",
    "After an hour, use an immersion blender to break down about half of the chickpeas. Add the light cream and bring back up to a simmer. Taste and adjust for salt and pepper. Off the heat, stir in the torn basil leaves.",
    "Serve over pasta garnished with Parmesan and drizzled with a little olive oil if you like."
  ],
  "ingredients": [
    "0",
    "1/4 cup dried porcini mushrooms",
    "1 cup boiling water",
    "1 medium onion, roughly chopped",
    "2 stalks celery, roughly chopped",
    "1 medium carrot, roughly chopped",
    "3 cloves garlic, chopped",
    "3 ounces pancetta (or bacon in a pinch) chopped",
    "4 tablespoons extra virgin olive oil, plus more for drizzling",
    "3 cups cooked chickpeas, or two 15-ounce cans, drained and rinsed",
    "1 teaspoon dried basil",
    "1/2 teaspoon dried oregano",
    "1/4 to 1/2 teaspoons crushed red pepper flakes (optional but oh so good!)",
    "One 28-ounce can San Marzano tomatoes (or another good plum tomato)",
    "1 cup dry white wine",
    "1/2 cup light cream or half and half",
    "Salt and black pepper, to taste",
    "A nice handful of fresh basil leaves, torn",
    "Parmesan cheese for finishing",
    "1 pound dried pasta, cooked to al dente"
  ],
  "__v": 1
}