{
  "hash": "b0c5f75d5442fe3bf65622fd57def389681b8738",
  "title": "torta soffice al limone",
  "image": "https://www.fattoincasadabenedetta.it/wp-content/uploads/2016/05/Screenshot-2016-05-07-12.29.46-150x150.png",
  "href": "https://www.fattoincasadabenedetta.it/torta-soffice-al-limone-ricetta-facile-senza-latte-senza-burro-lemon-sponge-cake-easy-recipe/",
  "extension": "Chrome",
  "firstAdded": "2020-02-18T21:43:16.335000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In una ciotola frulliamo le quattro uova e aggiungiamo lo zucchero, la buccia grattugiata di un limone, l’acqua, l’olio e, continuando a frullare, aggiungiamo la farina un po’ alla volta. Quando il tutto è ben amalgamato uniamo il lievito vanigliato e continuiamo a frullare per bene.",
    "Versiamo il composto in una teglia (diametro 28 cm) oleata ed infarinata, livelliamo bene ed inforniamo a forno caldo (180°C – forno statico) e lasciamo cuocere per 40 minuti circa. Sforniamo e lasciamo raffreddare.",
    "Quando la torta sarà fredda tagliamola a metà e prepariamo la crema al limone.",
    "In un tegame versiamo 100 ml di succo di limone, 100 ml di succo di arancia ( il succo di arancia serve a non rendere la crema al limone troppo aspra), aggiungiamo 2 cucchiai di zucchero, 2 cucchiai di farina, portiamo sul fuoco e facciamo cuocere, mescolando con una frusta, fino a quando il composto si addensa.",
    "Riprendiamo la torta che avevamo tagliato in due dischi e farciamo con la crema al limone.",
    "Poi, per rendere l’aspetto della nostra torta al limone più originale, possiamo spolverarla di zucchero a velo"
  ],
  "ingredients": [
    "0",
    "PER LA TORTA",
    "4 Uova",
    "200g di Zucchero",
    "100g di Olio di Semi di Girasole",
    "100g di Acqua",
    "250g di Farina 00",
    "la buccia grattugiata di un limone",
    "1 bustina di lievito vanigliato (16g)",
    "CREMA AL LIMONE",
    "100 ml di succo di limone",
    "100 ml di succo d’arancia",
    "2 cucchiai di zucchero",
    "2 cucchiai di farina."
  ],
  "__v": 3
}