{
  "hash": "dee243ba47fd1ce806f62adb4b051647ff29891a",
  "title": "Pumpkin Sage Biscuits",
  "image": "http://cdn3.minimalistbaker.com/wp-content/uploads/2014/10/Fluffy-1-Bowl-Vegan-Pumpkin-Sage-Muffins-Perfect-for-fall-and-Thanksgiving.jpg",
  "href": "http://minimalistbaker.com/pumpkin-sage-biscuits/",
  "extension": "Chrome",
  "firstAdded": "2015-11-23T04:19:52.109000",
  "users": [
    null
  ],
  "keywords": [
    "plain",
    "almond",
    "milk",
    "lemon",
    "juice",
    "allpurpose",
    "flour",
    "used",
    "unbleached",
    "wheat",
    "pastry",
    "baking",
    "soda",
    "salt",
    "cinnamon",
    "nutmeg",
    "nondairy",
    "unsalted",
    "use",
    "earth",
    "balance",
    "butter",
    "pumpkin",
    "puree",
    "roughly",
    "torn",
    "sub",
    "dry",
    "sage"
  ],
  "directions": [
    "0",
    "Preheat oven to 450 degrees F.",
    "Measure almond milk in a large liquid measuring cup and add lemon juice. Let curdle 5 minutes, then whisk in pumpkin puree.",
    "Mix flour(s), salt, baking soda, baking powder, cinnamon, nutmeg in a large bowl.",
    "Add cold butter and use a pastry cutter or fork to combine until small pieces remain and it looks like wet sand. Work quickly so the butter doesn’t get too warm. Add chopped sage and mix once more.",
    "Using a wooden spoon, stir gently while pouring in the almond-pumpkin mixture 1/4 cup at a time. You may not need all of it. Stir until just slightly combined – it will be a little sticky, not too much.",
    "Turn onto a lightly floured surface, dust the top with a bit of flour and then very gently turn the dough over on itself a couple times – hardly kneading.",
    "Form into a 1-inch thick disc, handling as little as possible.",
    "Use a 1-inch thick dough cutter or a similar-shaped object with sharp edges (such as a small drinking glass) and push straight down through the dough, then slightly twist. Repeat and place biscuits on a baking sheet in two rows making sure they just touch – this will help them rise uniformly. Gently reform the dough and cut out one or two more biscuits – you should have 7-9 depending on the size of your cutter.",
    "Brush the tops with a bit more melted non-dairy butter and gently press a small divot in the center using your thumb. This will also help them rise evenly, so the middle won’t form a dome.",
    "Bake for 13-17 minutes or until fluffy and golden brown. These take a little longer to bake than traditional biscuits because the pumpkin adds extra moisture.",
    "Serve immediately as is or with additional butter and/or maple syrup. Let remaining biscuits cool completely before storing them in an airtight container or bag. Will keep for up to a few days, though best when fresh."
  ],
  "ingredients": [
    "0",
    "3/4 cup unsweetened PLAIN almond milk + 1 Tbsp fresh lemon juice",
    "2 1/4 cups unbleached all-purpose flour (I used a 2:1 mix of unbleached AP & whole wheat pastry)",
    "1 Tbsp baking powder",
    "1/2 tsp baking soda",
    "3/4 tsp sea salt",
    "pinch each ground cinnamon and nutmeg",
    "4 Tbsp non-dairy, unsalted butter + more for topping (I use Earth Balance butter sticks)",
    "1/4 cup pumpkin puree",
    "3 Tbsp fresh sage, roughly chopped or torn (or sub 1 tsp dry sage)"
  ],
  "__v": 1
}