{
  "hash": "d25c813e4c503489a0319e7df23e97c842784841",
  "title": "How to Make Samosas",
  "image": "",
  "href": "http://www.wikihow.com/index.php?title=Make-Samosas&printable=yes",
  "extension": "Chrome",
  "firstAdded": "2015-04-17T10:33:24.360000",
  "users": [
    null
  ],
  "keywords": [
    "dough",
    "purpose",
    "flour",
    "salt",
    "oil",
    "ghee",
    "water",
    "frying",
    "filling",
    "boiled",
    "potato",
    "cubes",
    "green",
    "peas",
    "yellow",
    "onion",
    "ginger",
    "garlic",
    "hot",
    "chile",
    "peppers",
    "coriandercumin",
    "seed",
    "turmeric",
    "garam",
    "masala"
  ],
  "directions": [
    "0",
    "Part 1 of 3: Dough",
    "1",
    "Sieve the flour and salt together in a bowl. You can add a little more or less salt to taste if you desire.",
    "2",
    "Add the ghee or oil. Mix it in with your fingers, working with a handful of flour at a time. Keep mixing until all of the flour is coated with fat and a dough has begun to form. It should still be quite dry and flaky.",
    "3",
    "Mix in 5 tablespoons of water. Use your finger to work the water into the dough to loosen it up. The consistency should be soft and pliable, but not wet. Add more water if necessary.",
    "4",
    "Turn out the dough and knead it. Put the dough on a clean surface and knead it with your hands for about 4 minutes, until it is smooth and slightly shiny. Form it into the shape of a ball.",
    "5",
    "Rest the dough for 30 minutes. Cover it with plastic wrap and let it rest on the counter while you make the filling. This will help the dough achieve a better texture.[1][2]",
    "Part 2 of 3: Filling",
    "1",
    "Heat the ghee in a large saucepan. Place it over medium high heat and allow the ghee to get hot.",
    "2",
    "Toast the cumin seeds. Toasting the seeds brings out the best in their flavor and scent. Toast them until the room becomes fragrant and the seeds start to crackle, about 30 seconds.",
    "3",
    "Add the onion and ginger. Sauté them with the seeds for about five minutes, until the onion becomes translucent.",
    "4",
    "Add the garlic, chili peppers, turmeric, salt, and garam masala. Sauté the spices and fold them into the mixture for one minute.",
    "5",
    "Add the potatoes and peas. Stir the mixture gently and cook until the potatoes become dry, which should take about 3 minutes. Mix well and mash lightly.",
    "6",
    "Cool the filling. Remove it from heat and allow it to cool while you prepare the chapatti for filling.",
    "Part 3 of 3: Assembling Samosas",
    "1",
    "Divide the dough into eight equal portions. You can use a measuring cup, but it's easier to just eyeball it.",
    "2",
    "Roll in each round into chapattis. A chapatti is a thin, flat circular bread or dough. In this case, each one should be about 6 inches (15.2 cm) in diameter. Use a rolling pin or press the chapattis into shape with your fingers.",
    "3",
    "Cut each chapatti into two halves. Use a knife to slice each one in half.",
    "4",
    "Stuff and fold the samosas. Spoon 2 teaspoons of filling into the center of a piece of dough, then bring the edges together to form a cone shape. Seal the edges carefully using a little water. (You can also make paste using flour and water for easier sealing).",
    "Use your fingers to press the edges of each samosa into place.",
    "For a lovelier edge, you can use a fork to press the edges together.",
    "5",
    "Repeat with the remaining chapattis and filling. As you finish filling each one, set it aside on a plate or a baking sheet.",
    "6",
    "Heat the oil. Pour several inches of oil into a large dutch oven or a high-sided frying pan. Heat the oil until it reaches 350 °F (177 °C). Use a candy thermometer to test whether the oil is hot, or place a small piece of dough in the oil to see if it sizzles.",
    "7",
    "Fry the samosas. Place 3 to 4 samosas in the pot to fry. Deep fry them for about 10 minutes, until both sides are golden brown. Don't try to crowd the pot with too many at once, or they may fall apart instead of cooking properly.",
    "After each batch is finished frying, use a slotted spoon to move the finished samosas to a plate lined with paper towels to drain off the extra oil.",
    "Take care not to let them fry for too long, or the dough will become tough.",
    "8",
    "Serve hot with green chutney. Hot crispy samosas are ready to eat with chut"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "For the Dough",
    "2 cups all purpose flour",
    "1 teaspoon salt",
    "2 teaspoons oil or ghee",
    "1 cup water",
    "Vegetable oil, for frying",
    "For the Filling",
    "1 cup of boiled potato, cut into cubes",
    "1/2 cup of green peas, cooked",
    "1/2 cup yellow onion, diced",
    "2 teaspoons minced fresh ginger",
    "2 teaspoons minced garlic",
    "2 hot green chile peppers, minced",
    "1 teaspoon ground coriander-cumin seed",
    "1/2 teaspoon turmeric",
    "1/2 a teaspoon garam masala",
    "2 tablespoons oil or ghee",
    "Salt to taste"
  ],
  "__v": 1
}