{
  "hash": "10bb1e375d155cfbb25fd81058f9dfea1bf7798d",
  "title": "Cherry Clafouti",
  "image": "//d3cizcpymoenau.cloudfront.net/images/24382/square_hero_mobile_2x_SFS_cherry_clafuti-21.jpg",
  "href": "https://www.americastestkitchen.com/recipes/8422-cherry-clafouti",
  "extension": "Chrome",
  "firstAdded": "2016-08-31T13:35:21.422000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "SERVES 6 TO 8",
    "NOTE FROM THE TEST KITCHEN We prefer whole milk in this recipe, but 1 or 2 percent low-fat milk may be substituted. Do not substitute frozen cherries for the fresh cherries.",
    "1. Adjust oven racks to lowest and upper-middle positions; place 12-inch skillet on lower rack and heat oven to 425 degrees. Line rimmed baking sheet with aluminum foil and place cherries, cut side up, on sheet. Roast cherries on upper rack until just tender and cut sides look dry, about 15 minutes. Transfer cherries to medium bowl, toss with lemon juice, and let cool for 5 minutes. Combine 2 teaspoons flour and cinnamon in small bowl; dust flour mixture evenly over cherries and toss to coat thoroughly.",
    "2. Meanwhile, whisk eggs, 2/3 cup sugar, vanilla, and salt in large bowl until smooth and pale, about 1 minute. Whisk in remaining 1/2 cup flour until smooth. Whisk in cream and milk until incorporated.",
    "3. Remove skillet (skillet handle will be hot) from oven and set on wire rack. Add butter and swirl to coat bottom and sides of skillet (butter will melt and brown quickly). Pour batter into skillet and arrange cherries evenly on top (some will sink). Transfer skillet to lower rack and bake until clafouti puffs and turns golden brown (edges will be dark brown) and center registers 195 degrees, 18 to 22 minutes, rotating skillet halfway through baking. Transfer skillet to wire rack and let cool for 25 minutes. Sprinkle clafouti evenly with remaining 2 teaspoons sugar. Slice into wedges and serve.",
    "TECHNIQUES",
    "Secret Source of Cherry Flavor: Pits",
    "Cherry clafouti is traditionally made with unpitted cherries because, surprisingly, the stones lend the dessert a fragrant spice flavor—but they also make it tricky to slice and eat. The solution? Use pitted cherries and toss them with a little cinnamon. If that sounds like an odd solution, it’s not; both cherry pits and cinnamon contain a compound called linalool that lends the dessert a similarly warm, floral complexity.",
    "An Unlikely Swap:",
    "Cinnamon mimics the warm, floral flavor of cherry pits.",
    "Cherry pits",
    "Cinnamon",
    "Roast the Cherries First",
    "Briefly roasting halved and pitted cherries for our clafouti adds a little time to traditional approaches that call for tossing whole raw cherries into the batter—but we think it’s worth the effort. Instead of bursting and leaking juices into the custard, which leave it soggy and stained red, the fruit adds bright, sweet-tart flavor that complements the rich custard.",
    "Batter Up: Getting the Ratio Right for Tender, Sliceable Clafouti",
    "Custards can range from soft and creamy, like pastry cream, to more resilient and bready, like a crêpe. The textural difference largely depends on the ratio of three key ingredients: eggs, dairy, and flour. The proteins in the eggs provide the structure, linking together into a network as the custard heats, while both fat from the dairy and starch from the flour dilute that structure by interrupting the egg proteins and preventing them from knitting together too tightly.",
    "So when we set out to achieve the tender-but-set texture of our Cherry Clafouti, we conducted more than a dozen tests, fiddling with the amounts of each component. Not surprisingly, too much flour made the custard too bready, whereas an excess of dairy yielded custard that was too loose. Ultimately, we settled on a relatively moderate amount of each: 1 2/3 cups of dairy, four eggs, and 1/2 cup of flour, which yielded a clafouti that was soft but sliceable.",
    "PASTRY CREAM:",
    "2 cups dairy, 6 eggs, 1/4 cup flour",
    "CLAFOUTI:",
    "1 2/3 cups dairy, 4 eggs, 1/2 cup flour",
    "CRÊPES:",
    "1 1/2 cups dairy, 3 eggs, 1 cup flour"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 ½",
    "pounds fresh sweet cherries, pitted and halved",
    "1",
    "teaspoon lemon juice",
    "2",
    "teaspoons all-purpose flour, plus 1/2 cup (2 1/2 ounces)",
    "⅛",
    "teaspoon ground cinnamon",
    "4",
    "large eggs",
    "⅔",
    "cup (4 2/3 ounces) plus 2 teaspoons sugar",
    "2 ½",
    "teaspoons vanilla extract",
    "¼",
    "teaspoon salt",
    "1",
    "cup heavy cream",
    "⅔",
    "cup whole milk",
    "1",
    "tablespoon unsalted butter"
  ],
  "__v": 1
}