{
  "hash": "dea3343ddfd1542cba2c79989933749f1c6ad190",
  "title": "Rustic Tuscan-Style Sausage, White Bean, and Kale Soup",
  "image": "http://sharedappetite.com/wp-content/uploads/2014/02/IMG_1435-6.jpg",
  "href": "http://sharedappetite.com/recipes/rustic-tuscan-style-sausage-white-bean-and-kale-soup/",
  "extension": "Chrome",
  "firstAdded": "2016-11-30T04:37:35.752000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large pot, heat 2 tablespoons olive oil over medium heat. Add sausage and brown, stirring occasionally to break into smaller pieces, approximately 10 minutes.",
    "Add onion, carrots, potato, and bay leaves. Season generously with kosher salt and cook until vegetables begin to soften, stirring occasionally, approximately 10 minutes. Add garlic and beans, and cook for another 2-3 minutes. Add kale, and cook until it becomes slightly wilted. Add chicken stock, season with salt and pepper, and cover with lid.",
    "Bring soup to a boil, then reduce heat and keep at a simmer for about 45 minutes, although a bit longer is completely fine. The soup will thicken as the potatoes begin to release their starch into the soup.",
    "*the soup tastes best the second day. If time allows, cool soup completely, and refrigerate it for the following day. Reheat before serving.",
    "When about ready to serve, slice baguette. Drizzle each slice with a little olive oil and season with kosher salt. Bake at 350 degrees for about 5 minutes, until toasted. Top with grated gruyere and asiago cheese and broil for about 2-3 minutes, until cheese is melted. It can go from melted to burnt pretty fast, so don't leave broiler unattended.",
    "Divide soup among bowls and top with a few slices of cheesy baguette."
  ],
  "ingredients": [
    "0",
    "2 tablespoons olive oil",
    "1 pound Italian sweet sausage, casing removed",
    "1 medium onion, finely chopped",
    "2 large carrots, finely diced",
    "1 large potato, finely diced",
    "2 cloves garlic, minced",
    "2 bay leaves",
    "2 (15 ounce)cans white cannelini beans, drained and rinsed",
    "2 bunches kale, stems removed and roughly chopped",
    "52 oz. good quality low-sodium chicken stock",
    "Kosher Salt and Freshly Ground Black Pepper, to taste",
    "1 loaf baguette bread",
    "Gruyere and Asiago Cheese, shredded"
  ],
  "__v": 1
}