{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 350 degrees F. and line an 8×8 inch baking pan with tin foil that’s been generously sprayed with cooking spray. Make sure foil goes all the way up and over the edges for this one. It will be a full pan",
    "Place cake mix, egg, and butter into a large mixing bowl. Mix with hands until a nice dough forms. similar to a cookie dough. Press half of the dough into the bottom of the prepared pan. Layer with graham crackers, white chips then marshmallows. Top with remaining half of dough pressing evenly. Drizzle sweetened condensed milk over top then bake for 28-33 minutes, until cooked through and golden brown on top. Remove from oven. Let cool for 5 minutes then take a plastic knife and run along edges to loosen marshmallow (this will make your life easier when pulling foil out of pan to remove bars Let cool completely then remove bars from pan with foil edges. Cut off all edges if desired, about 1/2 inch each side. I save the edges to snack on too. Cut bars into squares and serve. They are delicious room temperature or chilled."
  ],
  "firstAdded": "2014-07-20T19:31:24.042000",
  "hash": "c5be7df646f8f83d3c3de1de7e0787f11b84c150",
  "href": "http://picky-palate.com/2011/07/25/white-chocolate-smores-gooey-cake-bars/",
  "image": "http://602660503.r.cdn77.net/wp-content/uploads/2011/07/White-Chocolate-Smores-Cake-Bars-3.jpg",
  "ingredients": [
    "0",
    "1 box yellow cake mix",
    "1 large egg",
    "1 stick (1/2 cup) unsalted butter, softened",
    "4 1/2 full graham crackers",
    "10 ounce bag white chocolate chips",
    "2 cups mini marshmallows",
    "1/2 cup sweetened condensed milk"
  ],
  "keywords": [
    "box",
    "yellow",
    "cake",
    "egg",
    "unsalted",
    "butter",
    "softened",
    "graham",
    "crackers",
    "white",
    "chocolate",
    "chips",
    "mini",
    "marshmallows",
    "sweetened",
    "condensed",
    "milk"
  ],
  "title": "White Chocolate S’mores Gooey Cake Bars",
  "users": [
    null
  ]
}