{
  "__v": 1,
  "directions": [
    "0",
    "Sift the flour into a bowl and add the salt.",
    "Place the butter and lard into the bowl. Start by squeezing the flour into the butter and lard and then as things start to blend pick up clumps of flour between your hands and rub your hands together like you are trying to warm them up. Do this until the flour looks like course cornmeal. It is ok if there are some larger pieces of butter still in the mix.",
    "Add the water and using your hands knead the dough right in the bowl until it comes together. Remove the dough from the bowl to a counter top and knead it two or three times.",
    "Divide the dough in half, pat it into two rounds then wrap in plastic wrap and put it in the fridge 30 minutes or more. If you let it sit in the fridge for two hours or more make sure you pull it out and let it warm up a little before trying to roll it.",
    "To roll the crust first dust your counter top with some flour. I then dip one of the dough pieces into the flour bin itself and give it a shake.",
    "Place the dough on the counter top and starting in the middle of the dough roll with your rolling pin away from you then put the pin back in the middle and roll, backwards, towards yourself. Now turn the dough 45 degrees so it is oblong and horizontal. Roll with your pin, again, starting in the middle. Continue this process until the crust is 10 to 12 inches in diameter and about an 1/8 to 1/4 inch thick.",
    "Using the rolling pin for support roll the dough lightly around the pin, like a carpet, and place it into a 9 inch pie pan.",
    "Roll out the remaining piece of dough.",
    "1",
    "Preheat the oven to 400? Fahrenheit. Bring a large pot of water to a boil and blanch the peaches for 10 to 20 seconds. Remove them to a bowl. Leave the water on because as you are peeling the peaches you may find a peach that needs to be blanched a little longer.",
    "Slip the peaches from their skins, halve them, pit them and then slice each half into 3 pieces. Place the peaches into a large bowl.",
    "Mix the sugar with the cornstarch. This will help to prevent the cornstarch from clumping.",
    "Combine the peaches with the sugar/cornstarch mix, cinnamon, lemon juice and nutmeg. Using your hands gently turn the peaches to distribute the sugar and spices.",
    "Remove the peaches and put them into the crust lined pie pan. Pour the juice over the top until it comes 3/4 of the way to the top. You may have more juice than you need. If you have less, don’t worry -- it is fine.",
    "Roll out the top crust and either cut it into strips for a lattice top or use it whole. Either way brush the edge of the bottom crust with egg white to help attach the top crust. Trim the excess crust.",
    "Crimp the crust. Brush the top crust with egg wash and dust with sugar. Place the pie on a sheet tray with edges just in case it bubbles over and because it will be much easier to get in and out of the oven.",
    "Bake the pie for 20 minutes at 400 ?F then turn the heat to 350? F and bake another 40 to 50 minutes or until the juices are bubbling and the crust browned. Remove and let cool.",
    "Slice and serve cold or warm, with cream or ice cream or just skip and go naked."
  ],
  "firstAdded": "2014-08-12T23:04:19.382000",
  "hash": "46cc7de804584a55d82c61a13c947dd0ce4908da",
  "href": "https://food52.com/recipes/14147-honest-peach-pie",
  "image": "https://d2k9njawademcf.cloudfront.net/indeximages/21205/original/TJH_1504.jpg?1403260551",
  "ingredients": [
    "0",
    "1 1/2 cup whole wheat flour",
    "1 1/2 cup all purpose flour",
    "1 teaspoon kosher salt",
    "1/2 cup lard",
    "1/2 cup unsalted butter, cubed and chilled",
    "1/2 cup ice cold water",
    "1",
    "6 to 8 peaches depending on their size, firm but ripe, look for free stone peaches, meaning the pit comes out easy. I used Indiana red havens which are semi-free and if they are",
    "1/2 cup sugar",
    "2 tablespoons cornstarch",
    "juice of half a lemon",
    "1/4 teaspoon ground cinnamon",
    "1/4 teaspoon ground nutmeg",
    "1 egg white mixed with 2 teaspoons of water",
    "sugar for dusting"
  ],
  "keywords": [
    "wheat",
    "flour",
    "purpose",
    "kosher",
    "salt",
    "lard",
    "unsalted",
    "butter",
    "cubed",
    "chilled",
    "ice",
    "cold",
    "water",
    "depending",
    "size",
    "firm",
    "look",
    "free",
    "stone",
    "peaches",
    "meaning",
    "pit",
    "comes",
    "easy",
    "used",
    "indiana",
    "red",
    "havens",
    "semifree",
    "sugar",
    "cornstarch",
    "juice",
    "lemon",
    "cinnamon",
    "nutmeg",
    "egg",
    "white",
    "mixed",
    "dusting"
  ],
  "title": "Honest Peach Pie",
  "users": [
    null
  ]
}