{
  "hash": "8ceb4ffbeb3d8e6b68a3971011b64a58e79ae5c4",
  "title": "Lasagna con Melanzane e besciamella",
  "image": "https://blog.giallozafferano.it/cucinafamiliare/wp-content/uploads/2012/10/IMG_1608.jpg",
  "href": "https://blog.giallozafferano.it/cucinafamiliare/lasagna-con-melanzane-e-besciamella/",
  "extension": "Chrome",
  "firstAdded": "2020-01-03T16:10:24.628000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparate la salsa di pomodoro: tritate sottilmente aglio, cipollina e metteteli in un tegame con poco olio. fate leggermente brasare ed aggiungetevi il passato di pomodoro, poco sale e basilico abbondante. Fate cuocere il sugo per circa 30 minuti",
    "Per la besciamella, fate fondere il burro a fuoco dolce, quindi unite la farina. Mescolate per 2 minuti, poi versate il latte poco alla volta. Portate a ebollizione mescolando. Salate e pepate. Fate sobbollire per 5 minuti.",
    "Tagliate con l’affettatrice le melanzane a fette alte circa 1 centimetro. Salatele, risciacquatele bene, strizzatele delicatamente e fatele cuocere su una piastra ben calda su entrambi i lati per pochi minuti.",
    "Riscaldate il forno a 200° C.",
    "Tagliate la mozzarella a fettine sottili.",
    "Imburrate una teglia rettangolare (piccola). Disponetevi, alternando, uno strato di lasagne, la passata di pomodoro condita, uno strato di melanzane e le fette di mozzarella. Continuate a ripetere gli strati.",
    "Terminate con uno strato di lasagne. Versatevi sopra la besciamella e ancora pomodoro , insaporite con il parmigiano. Infornate per 35 minuti. A metà cottura, coprite le lasagne con un foglio di carta da forno."
  ],
  "ingredients": [
    "0",
    "2 spicchi di aglio",
    "1 cipollina piccola",
    "400 gr pomodori pelati (lattina)",
    "400 gr passata di pomodoro",
    "2 cucchiai di basilico sminuzzato",
    "250 gr di mozzarella",
    "2 melanzane",
    "10-12 lasagne pronte da cuocere (200 gr)",
    "80 gr di parmigiano",
    "125 gr di burro",
    "sale, pepe",
    "Per la besciamella: 50 gr di burro, 50 gr di farina, 50 cl di latte, sale, pepe"
  ],
  "__v": 3
}