{
  "hash": "6ab00fdcdf2b11ffe782f9cc1e76528eaad80acd",
  "title": "THE PERFECT BAKED POTATO",
  "image": "http://www.gimmesomeoven.com/wp-content/uploads/2016/03/Perfect-Baked-Potato-5.jpg",
  "href": "http://www.gimmesomeoven.com/baked-potato/",
  "extension": "Chrome",
  "firstAdded": "2016-08-28T03:31:02.791000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS:",
    "Heat oven to 450°F. Line a baking sheet with parchment paper or aluminum foil.**",
    "Using a dinner fork or a small paring knife, poke the potato multiple times on all sides.",
    "Place the potato on the baking sheet. Bake for 25 minutes, then remove from oven.",
    "Using a pastry brush, brush the outside of the potato with olive oil or melted butter until it is completely coated on all sides. Sprinkle the potato with a generous pinch of Kosher salt and black pepper.",
    "Return to oven and cook for an additional 20 minutes, turning the potato halfway through (after 10 minutes) so that it can bake evenly on all sides. Check for doneness by squeezing the potato (using an oven mitt since it's a hot potato!). If the insides are nice and soft and give under pressure, remove the potato from the oven. Otherwise, continue cooking in 5-minute increments until the potato is done.",
    "Use a small paring knife to cut down the middle of the potato, and then give it a squeeze to open. Serve immediately, with your desired toppings.",
    "*For super-even cooking, you can alternately cook the potato either directly on the oven racks. Or you can also place a small cooling rack directly on top of your baking sheet, and place the potato on that. For either of those methods, you can (obviously) skip the parchment paper or aluminum foil.",
    "**If using parchment paper, make sure your paper can tolerate 450 degree heat (Reynolds brand only tolerates up to 425 degrees), as you want to make sure the paper doesn't burn! You can also use aluminum foil."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS:",
    "1 medium-to-large Russet potato, scrubbed clean of any dirt",
    "olive oil or melted butter",
    "Kosher salt",
    "freshly-cracked black pepper"
  ],
  "__v": 1
}