{
  "hash": "56d570851e60db0c133a9504808d3d3fe9421008",
  "title": "Red Eye and Cider Brew House Wings",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2011/10/3/0/DV1207_red-eye-and-cider-brew-house-wings_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/red-eye-and-cider-brew-house-wings-recipe.html",
  "firstAdded": "2015-01-24T19:44:56.653000",
  "users": [
    null
  ],
  "keywords": [
    "butter",
    "hot",
    "amber",
    "ale",
    "cider",
    "mayo",
    "blue",
    "cheese",
    "crumbles",
    "sour",
    "cream",
    "white",
    "vinegar",
    "garlic",
    "cracked",
    "black",
    "pepper",
    "chicken",
    "wings",
    "lemon",
    "salt"
  ],
  "directions": [
    "0",
    "For the sauce: Heat the butter, hot sauce, ale and cider together in a large saucepan over medium heat until fully melted and combined. Set aside until the wings are cooked.",
    "For the blue cheese dressing: Combine the mayo, 3/4 cup blue cheese, sour cream, vinegar and garlic in a large bowl. Season with black pepper to your liking and set aside. Sprinkle the remaining 1/4 cup blue cheese on top just before serving.",
    "For the wings: Sprinkle the wings with lemon pepper and salt. From there you can fry, grill or saute them until done. This usually takes up to 30 minutes, depending on the cooking method used and the size of the wings. When cooked, toss them in the cider sauce and serve with the blue cheese sauce on the side.",
    "This recipe was provided by a professional chef or restaurant and may have been scaled down from a bulk recipe. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results.",
    "Recipe courtesy Ryan Kelly, Tampa Bay Brewing Co."
  ],
  "ingredients": [
    "0",
    "1 pound butter",
    "2 cups hot sauce",
    "1/2 cup amber ale",
    "1/2 cup cider",
    "1 cup mayo",
    "1 cup blue cheese crumbles",
    "1/2 cup sour cream",
    "1/4 cup white vinegar",
    "1/2 tablespoons finely chopped garlic",
    "Cracked black pepper",
    "6 to 8 pounds chicken wings",
    "Lemon pepper",
    "Salt"
  ],
  "__v": 1
}