{
  "hash": "21f3b2b2ee132c02d8ff8a8407ddd22fb01ffe60",
  "title": "Mega veggie nachos",
  "image": "//cdn.jamieoliver.com/recipe-database/335_448/Dirk0pZtqkj8f8Xrji74cy.jpg",
  "href": "http://www.jamieoliver.com/recipes/vegetable-recipes/mega-veggie-nachos/",
  "extension": "Chrome",
  "firstAdded": "2016-11-08T08:30:37.353000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Method",
    "Place the oven on to 180ºC/350ºF/gas 4.",
    "Place a griddle pan over a high heat and cook the whole peppers, chilli, tomatoes and trimmed spring onions until soft and charred.",
    "Put the peppers and chilli in a bowl, cover with clingfilm and set aside for 5 minutes.",
    "Dice the tomatoes and spring onions, then add to another bowl. Peel, deseed and dice the peppers and chillies, then add to the tomatoes and spring onions.",
    "Pick in a few coriander leaves, season, then mix in a good squeeze of lime juice and a drizzle of oil. Wipe the griddle pan and return to the heat.",
    "Cut the tortillas into wedges and arrange over two baking sheets. Bake in the oven for 5 minutes, or until golden.",
    "Place a large frying pan over a high heat and toast the cumin seeds for a few seconds. Add the Tabasco sauce and beans and cook for a few minutes, or until thick, stirring occasionally.",
    "Peel, destone and slice the avocado into wedges, then drizzle with the remaining lime juice.",
    "Arrange the tortillas in a bowl. Top with the beans, salsa, dressed avocado, feta and pick over the remaining coriander, then serve."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 mixed-colour peppers",
    "1 fresh red chilli",
    "3 ripe tomatoes , on the vine",
    "6 spring onions",
    "1 bunch of fresh coriander",
    "2 limes",
    "extra virgin olive oil",
    "4 corn tortillas",
    "1/2 teaspoon cumin seeds",
    "Chipotle Tabasco sauce",
    "1 x 400g tin of black beans",
    "1 ripe avocado",
    "20 g feta cheese"
  ],
  "__v": 1
}