{
  "hash": "b2dd43e2e64290e4be2912e3960904e7fb4ad3c0",
  "title": "Old-Fashioned Biscuits",
  "image": "//food.fnr.sndimg.com/content/dam/images/food/fullset/2013/3/4/1/FNM_040113-Old-Fashioned-Biscuits-Recipe_s3x4.jpg.rend.hgtvcom.826.620.suffix/1371614133057.jpeg",
  "href": "https://www.foodnetwork.com/recipes/paula-deen/old-fashioned-biscuits-recipe-2121346",
  "extension": "",
  "firstAdded": "2019-10-22T16:12:39.554000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "Combine the dry ingredients: Preheat the oven to 425 degrees F. Mix the flour, sugar, baking powder and salt in a large bowl with a fork.",
    "Cut in the lard: Cut the chilled lard into small cubes and add to the dry ingredients.",
    "Use a pastry blender (or two forks) to cut the lard into the flour, pressing and twisting until the lard is in pea-size bits.",
    "The mixture is ready when all the lard has been broken down into flour-coated bits and the mixture resembles coarse meal.",
    "Add the milk: Make a well in the flour-fat mixture and slowly pour in the milk. Mix with a fork until just combined, then knead gently with your hands until the dough comes together into a sticky ball.",
    "Roll out the dough: Turn the dough out onto a floured surface. Knead until smooth and pliable; do not overwork. Roll out into a 1/2-inch-thick round, flouring the rolling pin and dough as needed.",
    "Cut out the biscuits: Smear a 10-inch hoe cake pan or cast-iron skillet with softened butter. Cut out 2-to-3-inch biscuits using a clean empty can, the mouth of a glass or a biscuit cutter. Put the biscuits on the pan. Reroll the scraps and cut out more biscuits. Make a fist and mark the top of each biscuit with your knuckles. Dot with softened butter. Bake until golden, 15 to 20 minutes.",
    "Photograph by"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 cups all-purpose flour, plus more for dusting",
    "1 teaspoon sugar",
    "1 tablespoon baking powder",
    "1 teaspoon salt",
    "8 tablespoons cold lard (or unsalted butter)",
    "1/2 cup whole milk",
    "Unsalted butter, softened, for the pan and biscuit tops"
  ],
  "__v": 1
}