{
  "hash": "8cd50e7099f21745eb2bea8736ba5fb453840732",
  "title": "Fall Off the Bone Oven Baked Pork Spareribs with Homemade Sweet & Spicy Barbecue Sauce",
  "image": "//1.bp.blogspot.com/-UP88LPRKlyA/UKSmEgsr0HI/AAAAAAAAUB0/wFnxe-wKmP0/s400/Fall+off+the+Bone+Oven+Baked+Ribs+01.jpg",
  "href": "https://www.deepsouthdish.com/2009/03/fall-off-bone-oven-baked-pork-spareribs.html?",
  "extension": "Chrome",
  "firstAdded": "2020-05-05T03:52:50.349000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Preheat oven to 250 degrees F. Ribs will cook for a total time of 4 hours.",
    "Combine all of the dry rub ingredients in a small bowl. Prepare the rack by removing the membrane from the back of the ribs and cutting away that extra little flap of tough meat across the top - just discard that or save for another use. Line a baking pan with aluminum foil. On the bottom side of the ribs, sprinkle on a generous amount of the dry rub and rub it in. Set the ribs on the baking pan with the seasoned side down, and apply the remaining dry rub on the top side. Roast uncovered at 250 degrees F for 2 hours.",
    "After the ribs have cooked for 2 hours, remove them and pour some of the sauce over the top of the ribs. Using a brush, gently spread the sauce all over the ribs. Cover the entire pan tightly with aluminum foil and return to the oven, baking for an additional 2 hours, or until the meat begins to pull away from the bone. If you like, unwrap, brush with a bit of sauce and finish under the broiler for a minute or so.",
    "When ready to serve, brush a little extra sauce on each serving but definitely serve with a side of sauce for dipping. Don't forget some pasta salad, or maybe potato salad and what else but baked beans? Maybe some corn on the cob with compound butter would be nice too!",
    "Cook's Notes: Depending on what kind of sauce you use, if you want a bit more of smokey flavor to the ribs, just before you put on the rub, take a teaspoon of liquid smoke and mix it with a tablespoon of water. Brush that on both sides of the ribs, then apply the dry rub. Not sure what to do with leftovers? Build a BBQ Sundae!"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 rack (approx. 5 pounds) of pork spareribs or baby back ribs",
    "Commercial or homemade barbecue sauce",
    "Dry Rub",
    "1 teaspoon garlic salt",
    "1 teaspoon cumin",
    "20 turns of the pepper grinder",
    "1 teaspoon paprika",
    "1 teaspoon chili powder",
    "1 teaspoon oregano",
    "1/4 teaspoon of white pepper",
    "1/4 cup of brown sugar"
  ],
  "__v": 1
}