{
  "hash": "d0462699b2593f84838a31f03c3cfded1bf1981a",
  "title": "Baked Eggs With Beans and Greens",
  "image": "https://static01.nyt.com/images/2018/11/01/dining/ch-sausage-beans-greens-eggs/merlin_144807984_cbb42ddb-6453-4ff0-88e7-f9d4261b5c78-articleLarge.jpg",
  "href": "https://cooking.nytimes.com/recipes/1019704-baked-eggs-with-beans-and-greens",
  "extension": "Chrome",
  "firstAdded": "2019-02-21T17:20:44.586000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the oven to 375 degrees. Heat the olive oil in a 12-inch ovenproof skillet over medium heat. If using the sausage, add to the pan and cook, breaking it into 1/2-inch pieces, by pressing with the back of spatula or wooden spoon until crisp and cooked through, about 8 minutes. Remove with a slotted spoon and set aside.",
    "Add the onion to the skillet and cook until softened, about 3 to 5 minutes. Add the chickpeas and the garlic and cook until the garlic is fragrant, about 1 minute. Season with salt. Add the sausage back to the pan along with the tomatoes and stir to combine. Bring to a simmer and gradually add in the chopped greens by the handful, tossing together until wilted. Season with salt.",
    "Using a spoon, create hollows in the sauce and gently crack the eggs into each, and season the eggs with salt and pepper. Transfer to the oven and cook until the eggs are set, about 7 to 9 minutes. Scatter the herbs on top along with a tablespoon or two of grated cheese, if using."
  ],
  "ingredients": [
    "0",
    "2",
    "tablespoons olive oil",
    "½",
    "pound sweet or spicy Italian sausage, casings removed (optional)",
    "1",
    "medium yellow onion, thinly sliced",
    "1",
    "(15-ounce) can chickpeas or white beans, drained and rinsed",
    "2",
    "garlic cloves, finely chopped",
    "Kosher salt",
    "1",
    "(28-ounce) can whole tomatoes, gently crushed by hand",
    "4",
    "cups stemmed and packed roughly chopped greens such as spinach, kale or Swiss chard",
    "6",
    "large eggs",
    "Black pepper",
    "2",
    "tablespoons mixed herbs, such as Italian parsley and basil, for garnish",
    "Grated cheese, such as pecorino or Parmesan, for serving (optional)"
  ],
  "__v": 1
}