{
  "hash": "bea78a16db7cdf4eccfdd1f6da3b1fcf362bd831",
  "title": "Vegan gingerbread people",
  "image": "//www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe/recipe-image/2016/12/vegan-gingerbread.jpg?itok=rF-YCND1",
  "href": "https://www.bbcgoodfood.com/recipes/vegan-gingerbread-people",
  "extension": "Chrome",
  "firstAdded": "2018-11-29T17:43:35.126000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Put the chia seeds in a small bowl and stir in 3 tbsp water. Leave to soak for 5-10 mins until gloopy. Meanwhile put the flour into a large mixing bowl and rub in the coconut oil until it’s almost disappeared into the flour. Stir in the spices.",
    "In another bowl mix together the sugar, maple syrup, chia mixture and 2 tbsp water until smooth then pour over the flour. Stir until well combined then knead together to make a soft dough. Wrap in cling film until ready to use.",
    "Heat oven to 180C/160C fan/gas 6. Roll out the dough on a lightly floured surface then cut into gingerbread people (or whatever shape you like) and bake for 10-12 mins on baking sheets lined with baking parchment until just starting to darken at the edges. Let them cool for a couple of minutes on the tray then transfer to a wire rack to cool.",
    "While the gingerbread cools whip the aquafaba in a bowl using electric beaters until really foamy. Add 3/4 of the icing sugar and whisk until smooth and thick, then whisk in the rest of the icing sugar and the lemon juice. Whisk again until the mixture forms stiff peaks. Transfer to a piping bag until ready to use. Snip a little off the end of the piping bag and use to create designs and faces on your gingerbread."
  ],
  "ingredients": [
    "0",
    "1 tbsp chia seeds",
    "400g plain flour, plus extra for dusting",
    "200g coconut oil",
    "2 tbsp ground ginger",
    "1 tsp ground cinnamon",
    "200g dark muscovado sugar",
    "50g maple syrup Maple syrup may-pul sir-rupThe rising spring sap of a number of varieties of maple tree…",
    "100ml aquafaba (water from a can of chickpeas)",
    "500g icing sugar",
    "½ tsp lemon juice"
  ],
  "__v": 1
}