{
  "hash": "9a0f8dde8a462a3e08272f1ae9a750f3e00fca82",
  "title": "Easy Pressure Cooker Chicken and Chickpea Masala Recipe",
  "image": "http://www.seriouseats.com/recipes/assets_c/2014/01/20140125-pressure-cooker-chicken-chickpea-spinach-masala-recipe-18-thumb-625xauto-380282.jpg",
  "href": "http://www.seriouseats.com/recipes/2014/01/quick-easy-pressure-cooker-chicken-and-chickpea-masala.html",
  "extension": "Chrome",
  "firstAdded": "2017-05-11T17:09:52.108000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat butter in a pressure cooker over medium-high heat (\"sear\" setting on an electric pressure cooker) until foaming subsides. Add onions, garlic, and ginger. Cook, stirring frequently, until pale brown, about 5 minutes. Add cumin, paprika, coriander, turmeric, cayenne pepper, and black pepper and cook, stirring frequently, until aromatic, about 30 seconds. Add crushed tomatoes and spinach. Cover and cook, stirring occasionally, until spinach is wilted, about 2 minutes.",
    "Add half of cilantro, chicken stock, and chicken pieces. Stir to combine. Seal pressure cooker and heat to high pressure. Once high pressure is reached, cook for 15 minutes.",
    "Allow to cool, release pressure, remove lid, add heavy cream, drained chickpeas, 2 tablespoons lemon juice, and simmer, stirring frequently, until sauce is thickened. Stir in remaining lemon juice and season to taste with salt. Serve immediately, garnished with remaining cilantro leaves."
  ],
  "ingredients": [
    "0",
    "2 tablespoons unsalted butter",
    "1 medium onion, finely diced (about 1 cup)",
    "4 cloves garlic, minced (about 4 teaspoons)",
    "1 tablespoon grated fresh ginger",
    "1 tablespoon ground cumin",
    "1 1/2 teaspoons paprika",
    "1 1/2 teaspoons ground coriander",
    "1 teaspoon ground turmeric",
    "1/4 teaspoon cayenne pepper (more or less to taste)",
    "1/2 teaspoon ground black pepper",
    "1 (15 ounce) can crushed tomatoes",
    "1 pound fresh spinach leaves, trimmed",
    "1/4 cup fresh juice from 2 to 3 lemons",
    "1/2 cup chopped fresh cilantro leaves",
    "3 pounds chicken drumsticks and thighs (4 to 6 of each)",
    "1/2 cup homemade or store-bought low-sodium chicken stock",
    "2 (15-ounce) cans chickpeas, drained",
    "1/2 cup heavy cream",
    "Kosher salt"
  ],
  "__v": 1
}