{
  "hash": "9356619e5c81429be8a4ff5055dbf67a1b5160cf",
  "title": "Slow-Cooker Lemon-Thyme Steamed Artichokes",
  "image": "https://images.food52.com/3HRwZZXujBVxfrrhZsV7q18v7N4=/753x502/00c10414-2cc6-4c5f-a25a-5225de2cda34--Lemon-Thyme_Steamed_Artichokes_with_Bagna_Cauda_Sauce_c-Meredith_Corporation.jpg",
  "href": "https://food52.com/recipes/78159-slow-cooker-lemon-thyme-steamed-artichokes",
  "extension": "Chrome",
  "firstAdded": "2018-12-28T19:39:15.590000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "For the artichokes: Remove 3 strips of zest from lemon. Cut lemon in half. Trim stems from artichokes to stand; remove loose outer leaves. Cut about 1 inch off the top of each artichoke; snip off sharp leaf tips. Rub cut edges of artichokes with a lemon half to prevent browning. In a 3½- or 4-qt. slow cooker place artichokes, stem ends down. Pour 1 cup water around artichokes. Squeeze lemon halves over artichokes. Sprinkle artichokes with garlic, salt, and pepper. Drizzle with oil. Add lemon strips and thyme sprigs. Cover and cook on low 6 to 7 hours or high 3 to 3½ hours or until a leaf easily pulls out of artichoke. Using a slotted spoon, transfer artichokes to a platter. Drizzle with 2 Tbsp. Bagna Cauda Sauce. Sprinkle with snipped thyme. Serve with remaining sauce. For the optional bagna cauda sauce: In a small saucepan combine 1½ tsp. minced garlic; 3 Tbsp. olive oil; 2 Tbsp. butter; 2 canned anchovies, minced (2 tsp.); and ¼ tsp. crushed red pepper. Cook over low heat 5 minutes or until sauce begins to bubble. Remove from heat. Makes ⅓ cup sauce."
  ],
  "ingredients": [
    "0",
    "Lemon-thyme steamed artichokes",
    "1\tlemon",
    "2\tartichokes",
    "1\ttablespoon minced garlic",
    "1/2\tteaspoon kosher salt",
    "1/2\tteaspoon freshly ground black pepper",
    "1\ttablespoon olive oil",
    "2\tsprigs fresh thyme, plus 2 teaspoons snipped fresh thyme",
    "Bagna cauda sauce (optional)",
    "1 1/2\tteaspoons minced garlic",
    "3\ttablespoons olive oil",
    "2\ttablespoons butter",
    "2\tcanned anchovies, minced",
    "1/4\tteaspoon crushed red pepper"
  ],
  "__v": 1
}