{
  "hash": "90fb80a7417f082c0a615017ed422f8632bb5eae",
  "title": "Gina's Perfect Roast Chicken with Gravy",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2009/5/18/0/0067582-02_Perfect-Roast-Chicken-with-Gravy_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/patrick-and-gina-neely/ginas-perfect-roast-chicken-with-gravy-recipe.html",
  "firstAdded": "2015-01-24T20:34:41.649000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "butter",
    "softened",
    "thyme",
    "leaves",
    "sage",
    "rosemary",
    "salt",
    "black",
    "pepper",
    "medium",
    "onion",
    "roasting",
    "chicken",
    "rinsed",
    "giblets",
    "lemon",
    "slices",
    "sprig",
    "garlic",
    "smashed",
    "herb",
    "white",
    "wine",
    "broth"
  ],
  "directions": [
    "0",
    "In a small bowl, add the butter, chopped thyme, rosemary, and sage. Season with salt and pepper and mix together with a wooden spoon. Reserve.",
    "Preheat oven to 475 degrees F.",
    "Lay onion slices down the center of a large cast iron skillet to create 2 rows that are touching.",
    "Season the cavity of the chicken with salt and pepper, add lemon slices, thyme, rosemary, sage and garlic cloves.",
    "Using your hands, gently separate the skin from the meat of the breast. Evenly spread the herb butter on the meat underneath the skin. Take the remaining butter and gently rub the skin. Wash hands and season the skin with salt and pepper. Tie drumsticks together using twine. Place the chicken on the onion slices.",
    "Transfer the pan to the preheated oven and roast until the skin is golden brown and crisp, about 1 hour and 20 minutes. Use an instant-read thermometer to make sure the thighs have reached 165 degrees F.",
    "Remove the chicken from the oven. Transfer to a cutting board, tent with foil and let rest.",
    "Spoon off as much fat from the pan as possible. Place the pan over high heat and add white wine. Use a wooden spoon to scrape up all the browned bits on the bottom of the pan. Add chicken broth and let reduce to about half, about 4 to 5 minutes. Strain out the onions. Add the gravy back to the pan and keep warm.",
    "Cut the twine from the drumsticks and carve. Pour the gravy into a serving bowl and serve with the chicken.",
    "Recipe courtesy The Neelys"
  ],
  "ingredients": [
    "0",
    "4 tablespoons unsalted butter, softened",
    "1 teaspoon freshly chopped thyme leaves",
    "1 teaspoon freshly chopped sage leaves",
    "1 teaspoon freshly chopped rosemary leaves",
    "Salt and freshly ground black pepper",
    "1 medium onion, peeled and sliced 1/2-inch thick",
    "1 (5-pound) roasting chicken, rinsed, dried and giblets removed",
    "2 lemon slices",
    "1 sprig fresh thyme, chopped",
    "1 sprig fresh rosemary, chopped",
    "1 sprig fresh sage, chopped",
    "3 large cloves garlic, peeled and smashed",
    "Herb Butter",
    "1/4 cup white wine",
    "1 cup chicken broth"
  ],
  "__v": 1
}