{
  "hash": "fbc699dad64a1daf4c202867a48f1cb446e2d7a0",
  "title": "GLAZED YEAST DONUTS",
  "image": "https://bakerbettie.com/wp-content/uploads/2014/05/glazed-yeast-donuts.jpg",
  "href": "https://bakerbettie.com/glazed-yeast-donuts/",
  "extension": "Chrome",
  "firstAdded": "2018-01-26T22:33:49.781000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Warm the milk to 105-110ºF. Sprinkle the yeast over the warm milk, stir, and let it sit until it begins to get foamy. About 5 minutes.",
    "In the bowl of a stand mixer, stir together the butter, sugar, salt, and egg.",
    "Fit the mixing bowl onto the mixer with the dough hook. With the mixer on the lowest setting, pour in the milk/yeast mixture and the flour. Increase speed to medium and let the dough knead for about 5 minutes until it forms a soft sticky dough. The mixture will seem quite wet at first, but will form a smooth soft dough once kneaded in the mixer for the full time. If the mixture is too wet after kneading, add more flour 1 TBSP at a time until a soft but sticky dough forms.",
    "Cover the bowl with a clean kitchen towel or loosely with plastic wrap and allow to rise at room temp to double in size. About 1 1/2 hours. Chill the dough in the refrigerator for at least 30 minutes and up to overnight.",
    "On a lightly floured clean work surface with a lightly floured rolling pin, roll out the dough to 1/2\" thickness. Use a donut cutter or a large and small circular cookie cutter to cut out donut shapes. Place the donuts on a baking sheet lined with parchment paper to rise. Cover loosely with plastic wrap and let rise for about 45 minutes. If you are frying the donut holes, they only need to rise for about 20 minutes.",
    "Heat about 2\" of frying oil in a shallow pot to about 350ºF. A fry thermometer is very helpful here. Set up a cooling rack over a baking sheet. Gently slide the donuts into the oil (you can use a slotted spoon for this) and fry for 1 1/2- 2 minutes, until lightly browned, before flipping once and cook for another 1 1/2- 2 minutes. Remove from the oil and allow to cool slightly on the cooling racks before glazing. Use either a slotted spoon or a chopstick to flip and remove from the oil, tongs can deflate the donut.",
    "for the glaze",
    "Place the powdered sugar and the vanilla extract in a large bowl and whisk in enough milk to make a smooth pourable glaze.",
    "Dip the slightly cooled donuts into the glaze, turning to coat both sides. Allow the glaze to set for about 5 minutes before serving."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2/3 cup milk",
    "1 package active dry yeast (0.25 oz package or 2 1/4 tsp)",
    "6 TBSP unsalted butter, room temperature and cut into small pieces",
    "1/4 cup sugar",
    "3/4 tsp kosher salt",
    "1 large egg",
    "3 cups plus 2 TBSP all-purpose flour",
    "frying oil (canola, peanut, vegetable)",
    "for the glaze",
    "2 cups confectioners (powdered) sugar",
    "2 tsp vanilla extract",
    "4-5 TBSP milk"
  ],
  "__v": 1
}