{
  "hash": "00e1c809f2e77d5ad3b30726e42269f564c1dd51",
  "title": "Blueberry Crumb Muffins",
  "image": "http://img.sndimg.com/food/image/upload/w_555,h_416,c_fit,fl_progressive,q_95/v1/img/recipes/44/08/35/pic6SJgja.jpg",
  "href": "http://www.food.com/recipe/blueberry-crumb-muffins-440835",
  "extension": "Chrome",
  "firstAdded": "2015-11-28T23:10:13.773000",
  "users": [
    null
  ],
  "keywords": [
    "crumb",
    "allpurpose",
    "flour",
    "light",
    "brown",
    "sugar",
    "cinnamon",
    "unsalted",
    "butter",
    "cold",
    "bits",
    "batter",
    "baking",
    "salt",
    "cooled",
    "eggs",
    "milk",
    "vanilla",
    "blueberries",
    "prefer",
    "lesser"
  ],
  "directions": [
    "0",
    "Preheat oven to 375 degrees F. Line or butter muffin tin.",
    "To make topping: put flour, brown sugar, and cinnamon in a small bowl and toss together. Add in the cold butter bits, and toss to coat, then use your fingers to rub the butter into the dry ingredients until you have irregularly shaped crumbs. Set aside the mix in the refrigerator while you prepare the batter.",
    "In a large bowl, whisk together the flour, sugar, baking powder, and salt. Stir in the brown sugar.",
    "In another bowl, whisk the melted butter, eggs, milk, and vanilla together until well combined.",
    "Pour the liquid ingredients into the dry, and fold together quickly to blend. Fold in the blueberries. The batter will be lumpy.",
    "Divide the batter evenly between the muffin cups, sprinkle some topping over each muffin, and use your fingertips to gently press the crumbs into the batter.",
    "Bake for about 20 minutes, or until the tops are golden and a thin knife inserted into the center of the muffins comes out clean.",
    "Cool for 5 minutes before removing from the tin."
  ],
  "ingredients": [
    "0",
    "Crumb Topping",
    "1⁄2 cup all-purpose flour",
    "1⁄2 cup light brown sugar, packed",
    "1⁄2 teaspoon cinnamon",
    "5 tablespoons unsalted butter, cold, cut into bits",
    "Batter",
    "2 cups all-purpose flour",
    "1⁄2 cup sugar",
    "1 tablespoon baking powder",
    "1⁄4 teaspoon salt",
    "1⁄4 cup light brown sugar, packed",
    "1⁄2 cup unsalted butter, melted and cooled",
    "2 large eggs",
    "3⁄4 cup milk",
    "1⁄4 teaspoon vanilla extract",
    "3⁄4-1 cup blueberries, I prefer the lesser amount"
  ],
  "__v": 1
}