{
  "hash": "b73443f8a344b9ebbd418ccb0b537c60153f7a95",
  "title": "Squash Soup with Cumin",
  "image": "http://del.h-cdn.co/assets/cm/15/10/54f8c165497fb_-_squash-soup-cumin-xlg.jpg",
  "href": "http://www.delish.com/cooking/recipe-ideas/recipes/a30004/squash-soup-cumin-thanksgiving-recipes/?zoomable",
  "extension": "Chrome",
  "firstAdded": "2016-06-22T19:37:42.916000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "Preheat oven to 450 degrees. Line 15 1/2\" by 10 1/2\" jelly-roll pan with foil. Place squash halves, cut sides down, in lined pan, and roast about 45 minutes or until very tender when pierced with knife. Cool until easy to handle, then, with spoon, scoop squash from skins and place in large bowl. Discard skins.",
    "Meanwhile, in 5- to 6-quart saucepot, heat oil on medium until hot. Add celery and onion, and cook 10 minutes. Stir in cumin, chipotle chile, 1/2 teaspoon salt, and 1/4 teaspoon freshly ground black pepper; cook 30 seconds, stirring.",
    "Add broth, water, and squash to saucepot; cover and heat to boiling on high. Reduce heat to low, and simmer 10 minutes.",
    "In batches, ladle squash mixture into blender. With center part of blender cover removed to allow steam to escape, blend squash mixture until pureed. Pour soup into large bowl. Return all soup to saucepot and heat through. Garnish each serving with pumpkin seeds and chives. Makes 10 1/2 cups.",
    "Serving size is based on a 1-cup serving.",
    "To make Squash Soup with Rosemary: Prepare squash as above in step 1. In step 2, omit cumin and chipotle chile powder, and add 1 teaspoon chopped fresh rosemary leaves along with the salt and pepper. Complete recipe as in steps 3 and 4, but omit garnish, and top each serving with several Pecorino Romano shavings if you like. Makes about 10 1/2 cups.",
    "Each cup: About 90 calories, 3 g protein, 19 g carbohydrate, 2 g total fat (0 g saturated), 3 g fiber, 0 mg cholesterol, 350 mg sodium.",
    "To make Squash Soup with Curried Pear: Prepare squash as above in step 1. In step 2, omit cumin and chile powder. Add 2 Bartlett or Anjou pears, peeled, cored, and chopped, 1 tablespoon curry powder, and salt and pepper to saucepot after celery and onion have cooked 8 minutes. Cook 5 minutes longer. Complete recipe as in steps 3 and 4, but garnish each serving with a drizzle of low-fat yogurt. Makes about 13 cups.",
    "Each cup: About 85 calories, 2 g protein, 19 g carbohydrate, 1 g total fat (0 g saturated), 3 g fiber, 0 mg cholesterol, 270 mg sodium."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "2 medium butternut squash",
    "1 tbsp. olive oil",
    "2 medium stalks celery",
    "1 medium onion",
    "1 tsp. ground cumin",
    "¼ tsp. chipotle chile powder",
    "salt and pepper",
    "2 can chicken broth (3 1/2 cups)",
    "2 c. water",
    "Roasted salted pumpkin seeds (pepitas) and fresh chives for garnish"
  ],
  "__v": 1
}