{
  "hash": "4ba846c2c109167d2fae662758918559c92730f2",
  "title": "Easy Slow Cooker Cinnamon Rolls",
  "image": "https://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2015/12/slow-cooker-cinnamon-rolls-5.jpg",
  "href": "https://sallysbakingaddiction.com/2015/12/21/easy-slow-cooker-cinnamon-rolls/",
  "extension": "Chrome",
  "firstAdded": "2018-09-15T22:32:41.011000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "Make the dough: In a small saucepan, warm the milk over low heat until lukewarm-- no need to use a thermometer, but to be precise: about 95°F (35°C). Pour the warm milk into the bowl of a stand mixer fitted with the dough hook attachment (OR you can use a handheld mixer OR no mixer, but a stand mixer is ideal). With a spoon, manually stir in the yeast and 1 teaspoon sugar. Cover with a towel and let sit until the yeast is foamy, about 5-10 minutes. This is called proofing the yeast. If the yeast does not dissolve and foam, start over with fresh active yeast. On low speed, beat in the remaining 1/4 cup sugar, salt, butter, egg, and 2 cups of flour until combined. The dough will be wet. While continuing to beat on low speed, add the remaining flour 1/4 cup at a time until a soft dough forms. Dough will be ready when it gently pulls away from the side of the bowl and has an elastic consistency. I always need 2 and 3/4 cups flour total, no more no less. **If you do not have a mixer, you can stir the dough by hand with a wooden spoon in this step.",
    "Turn the dough out onto a lightly floured surface. Knead the dough for 2 minutes. Let the dough rest for about 10 minutes. During this 10 minutes, line a 4 or 5 quart slow cooker with greased parchment paper. (I heavily spray it with non-stick spray, but brushing oil all over it works too.) If you have a larger slow cooker, that's ok- just space the rolls out more.",
    "Make the filling: After 10 minutes, roll the dough out in a 14x8 inch rectangle. Spread the softened butter on top. Mix together the cinnamon and sugar and sprinkle it all over the dough. Roll up the dough tightly, then cut into 10-12 even pieces and place them inside the lined slow cooker. Place a paper towel right under the lid of the slow cooker-- this will help keep condensation off of the cooking rolls. Do not leave that step out and do not use a cloth towel-- a paper towel.",
    "Turn your slow cooker on high speed and cook for 2 hours, or until the rolls are fully cooked through. It's always 2 hours for me, sometimes 2 hours and 15 minutes. Once they're done, remove the rolls from the cooker right away by lifting out the parchment paper.",
    "Make the glaze: Right before serving, top your cinnamon rolls with glaze. Whisk the confectioners' sugar, maple syrup, and milk together until smooth. Add a little more milk if too thick. Drizzle over the warm rolls.",
    "Rolls are best enjoyed the same day, but stay fresh and soft in a covered container at room temperature or in the refrigerator for 5 days. Rolls (with or without glaze) freeze well up to 3 months. Thaw overnight in the refrigerator and heat up however you prefer.",
    "Make ahead/overnight: This dough can be made the night before through step 3 and placed into a greased pie dish or cake pan. Cover with plastic wrap and keep in the refrigerator overnight. The next morning, remove from the refrigerator and place each roll into the lined slow cooker. Then continue with the recipe. The rolls may take less time, around 1 and 1/2 hours.",
    "Recipe Notes:",
    "This is a dough formulated to be \"quick.\" It's imperative that you follow the dough recipe exactly to ensure satisfactory results with this slow cooker method.",
    "Make sure you are using an instant yeast, as any non-instant yeast varieties will result in a slower cook time for the dough.",
    "If you'd like your rolls to have a beautiful golden brown, toasty look to them you can pull the rolls out of the slow cooker when they are done by lifting out the parchment paper. Then, place the entire thing (the parchment paper and rolls) into an appropriate size pan. Mine fit into a 9 inch pie dish. Bake at 300°F (149°C) for 5-10 minutes."
  ],
  "ingredients": [
    "0",
    "3/4 cup (180ml) milk (I recommend whole or 2%)",
    "1 packet Red Star Platinum Yeast or any instant yeast (1 packet = 2 and 1/4 teaspoons)",
    "1/4 cup + 1 teaspoon (55g) granulated sugar, divided",
    "1 teaspoon salt",
    "3 Tablespoons (43g) unsalted butter, melted and slightly cooled",
    "1 large egg",
    "2 and 3/4 cups (345g) all-purpose flour (spoon & leveled)"
  ],
  "__v": 1
}