{
  "hash": "5d2847d6a1a5117183e637cc88de2d00be35f2bb",
  "title": "Mascarpone, cherry and grappa trifle",
  "image": "",
  "href": "http://www.ottolenghi.co.uk/recipes/mascarpone-cherry-and-grappa-trifle-shop",
  "extension": "Chrome",
  "firstAdded": "2016-01-02T00:13:14.666000",
  "users": [
    null
  ],
  "keywords": [
    "sponge",
    "butter",
    "sugar",
    "salt",
    "zest",
    "lemon",
    "eggs",
    "plain",
    "white",
    "flour",
    "poached",
    "cherries",
    "pod",
    "split",
    "seeds",
    "scraped",
    "vanilla",
    "soaking",
    "syrup",
    "cherry",
    "cooking",
    "liquids",
    "grappa",
    "water",
    "cream",
    "mascarpone",
    "cheese",
    "double",
    "icing",
    "serve",
    "largish",
    "meringues",
    "broken",
    "pieces",
    "stems",
    "creme",
    "fraiche"
  ],
  "directions": [
    "0",
    "Preheat the oven to 160C/325F/gas mark 3. Line a 22cm cake tin with greaseproof paper. In a mixer, cream the butter, sugar, salt and lemon zest until light. Slowly add the eggs and then fold in the flour. Pour into the cake tin, level with a spatula and bake for about 30 minutes. To check if it's done, insert a skewer - it should come out clean. Remove from the oven. Cool.",
    "In the meantime, pour the sugar into a saucepan, add 3 tbsp of water and place over a medium heat. Bring to the boil and allow to bubble, occasionally brushing the inside of the pan with cold water, just above the bubbling syrup (this prevents the sugar from crystallising). Keep a close eye on it until you get a semi-dark caramel colour, then remove from the heat and, keeping your face at a safe distance from the pan (the syrup may spit), pour in the cherries and vanilla seeds. Mix with a wooden spoon and return to the heat. Simmer for about 8 minutes or until the cherries are soft. Remove from the heat, allow to cool, then strain, keeping the fruit and liquid separate. Now make the soaking syrup by mixing 100ml of your cherry poaching liquids with the grappa and 30ml water.",
    "Whisk together all the cream ingredients until they begin to thicken, then take the cake out of the tin and carefully cut it into 2-3 thin discs.",
    "To assemble the trifle, place one sponge disc on the bottom of a 2.5l glass bowl (you might need to trim it to fit). Brush the sponge with the syrup using a pastry brush, making sure it's well soaked. Then spread a generous layer of cream on top and cover with the cherries. Repeat the process once or twice more, finishing with a layer of cream. Scatter over the meringue pieces and garnish in the centre with the whole cherries. Chill, then serve with a dollop of creme fraiche on the side."
  ],
  "ingredients": [
    "0",
    "For the sponge:",
    "125g butter",
    "125g sugar",
    "½ tsp salt",
    "Zest of ½ lemon",
    "2 eggs, beaten",
    "125g plain white flour",
    "For the poached cherries:",
    "250g sugar",
    "500g pitted cherries",
    "½ vanilla pod, split, seeds scraped out, or ½ tsp vanilla paste",
    "For the soaking syrup:",
    "100ml cherry cooking liquids",
    "100ml grappa",
    "30ml water",
    "For the cream:",
    "350g mascarpone cheese",
    "200ml double cream",
    "½ vanilla pod, split, seeds scraped out, or ½ tsp vanilla paste",
    "Zest of ½ lemon",
    "3 tbsp icing sugar",
    "To serve:",
    "3-4 largish meringues, broken into pieces",
    "2 whole cherries with stems",
    "Creme fraiche"
  ],
  "__v": 1
}