{
  "hash": "8594d9bdc35da8ba7bd4e2b7e9db05b1bd4c40e5",
  "title": "Ina Garten's Roasted Vegetable Torte (Barefoot Contessa)",
  "image": "http://img.sndimg.com/food/image/upload/w_555,h_416,c_fit,fl_progressive,q_95/v1/img/recipes/23/06/89/pic4p0Lbn.jpg",
  "href": "http://www.food.com/recipe/ina-gartens-roasted-vegetable-torte-barefoot-contessa-230689",
  "extension": "Chrome",
  "firstAdded": "2015-07-02T10:37:25.779000",
  "users": [
    null
  ],
  "keywords": [
    "zucchini",
    "slices",
    "red",
    "onion",
    "lengthwise",
    "garlic",
    "olive",
    "oil",
    "kosher",
    "salt",
    "pepper",
    "bell",
    "peppers",
    "cored",
    "seeded",
    "yellow",
    "eggplant",
    "unpeeled",
    "parmesan",
    "cheese"
  ],
  "directions": [
    "0",
    "Preheat the oven to 400 degrees.",
    "Cook the zucchini, onions, garlic, and 2 tablespoons olive oil in a large sauté pan over medium heat for 10 minutes until the zucchini is tender. Season with salt and pepper.",
    "Brush the red and yellow peppers and eggplant with olive oil, season with salt and pepper, and roast on a baking sheet for 30 to 40 minutes, until soft but not browned.",
    "In a 6-inch round cake pan, place each vegetable in a single, overlapping layer, sprinkling Parmesan cheese and salt and pepper to taste between each of the layers of vegetables.",
    "Begin with half of the eggplant, then layer half of the zucchini and onions, then all of the red peppers, then all of the yellow peppers, then the rest of the zucchini and onions, and finally the rest of the eggplant.",
    "Cover the top of the vegetables with a 6-inch round of parchment paper or waxed paper. Place a 6-inch flat disk (another cake pan or the bottom of a false-bottom tart pan) on top and weight it with a heavy jar. Place on a plate or baking sheet (it will leak) and chill completely.",
    "Drain the liquids, place on a platter, and serve at room temperature."
  ],
  "ingredients": [
    "0",
    "2 zucchini, cut into 1/4 inch slices",
    "1 red onion, cut in half lengthwise and sliced",
    "1 garlic, minced",
    "olive oil",
    "kosher salt",
    "fresh ground pepper",
    "2 red bell peppers, halved, cored, and seeded",
    "2 yellow bell peppers, halved, cored, and seeded",
    "1 eggplant, unpeeled, cut into 1/4 -inch slices (1 1/2 pounds)",
    "1⁄2 cup freshly grated parmesan cheese"
  ],
  "__v": 1
}