{
  "hash": "ead76b341d854801f322ff6f60876fc7158ee90f",
  "title": "Tex-Mex Chili Mac",
  "image": "https://monkeyandmekitchenadventures.com/wp-content/uploads/2018/07/Tex-Mex-Chili-Mac.jpg",
  "href": "https://monkeyandmekitchenadventures.com/tex-mex-chili-mac/?fbclid=IwAR1K4dsYkE2aK1qtoMwdwyDFccSrZR6eOb4NeBhORBoUVYYcASMhrD5LTOY",
  "extension": "Chrome",
  "firstAdded": "2019-09-17T11:46:00.048000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare all your dry seasonings/spice mixture (onion powder, garlic powder, cumin, chili powder, chipotle powder, smoked paprika and sea salt) into a small bowl and mix well. Set aside.",
    "In a large ceramic/enamel lined Dutch oven/pot or similarly large stockpot, add the diced onion, red and green bell peppers, and jalapeno pepper(s). Sauté over medium heat for 5 to 7 minutes to soften them. Add a splash of water if they start to stick.",
    "Once the onions and peppers are softened, then turn down the heat a little, and add the minced garlic and sauté for 30 seconds.",
    "Then add the spice mixture over top of the sautéed veggies, stir, and heat the spices to release their fragrance, about one minute. Stirring the spices constantly.",
    "Next add the 4 cups of tomato juice and 1 cup of vegetable broth and increase the heat to a boil, then immediately lower to a simmer. Stir to incorporate everything.",
    "After the mixture is heated, add the pasta, stir to incorporate, and cook until the pasta is about half-way done, then add the beans and corn, and continue to cook.",
    "When the pasta is nearly done, remove from the heat, stir in the nutritional yeast and maple syrup, and cover the pot with a tight-fitting lid for 5 minutes. Note: If you do not have a tight-fitting lid, then just continue to cook until the pasta reaches the desired tenderness, (and skip step 8 below).",
    "After 5 minutes, test the pasta. If the pasta has not reached the desired tenderness, then cover the pot with the lid again for another few minutes until the pasta reaches the desired tenderness.",
    "Serve with your favorite toppings."
  ],
  "ingredients": [
    "0",
    "1 large yellow onion, fine dice",
    "1 red bell pepper, diced",
    "1 green bell pepper, diced",
    "1 to 2 jalapeño peppers, seeded and finely diced (use 2 if the jalapeños are mild)",
    "2 heaping Tablespoon finely minced garlic (approx. 8 cloves)",
    "4 cups organic tomato juice",
    "1 cup veggie broth (we used Pacific Organic Vegetable Broth) *",
    "1 teaspoon garlic powder",
    "1 teaspoon onion powder",
    "1 teaspoon cumin",
    "1 teaspoon smoked paprika",
    "¼ teaspoon chipotle powder",
    "1 Tablespoon chili powder (regular/mild)",
    "2 teaspoon sea salt (+/- to taste) *",
    "2 cups pasta of choice, uncooked (we used gluten free elbow macaroni)",
    "1 – 15 oz. can black beans, drained and rinsed",
    "1 – 15 oz. can pinto beans, drained and rinsed",
    "1 to 1 ½ cups frozen corn, thawed (+/-)",
    "2 teaspoons 100% organic maple syrup",
    "2 Tablespoons nutritional yeast"
  ],
  "__v": 1
}