{
  "hash": "4ad1ff85e401a136c65fefdf242f0bbcd88018f8",
  "title": "Breakfast Egg & Avocado Tostada",
  "image": "http://www.melecotte.com/wp-content/uploads/2012/07/AvocadoSalsa.jpg",
  "href": "http://www.melecotte.com/2012/07/breakfast_tostada/?utm_source=rss&utm_medium=rss&utm_campaign=breakfast_tostada",
  "extension": "Chrome",
  "firstAdded": "2015-03-08T14:36:10.410000",
  "users": [
    null
  ],
  "keywords": [
    "corn",
    "tostadas",
    "eggs",
    "cumin",
    "black",
    "pepper",
    "salt",
    "oregano",
    "chili",
    "paprika",
    "milk",
    "butter",
    "clove",
    "garlic",
    "bell",
    "red",
    "onion",
    "avocado",
    "jack",
    "cheese",
    "slices",
    "tomato",
    "sour",
    "cream"
  ],
  "directions": [
    "0",
    "In a bowl, whisk together eggs, seasoning, and milk; set aside.",
    "Prepare the avocado. With a sharp knife that is longer than the avocado, cut the avocado, lengthwise, around the seed. Place the avocado in the palm of your hand and carefully twist the two halves to separate. To remove the seed, use the knife to cautiously “hit” the seed, penetrating the seed ¼-inch. (To remove the seed from your knife, use your thumb and finger to press the seed over the blunt side of the knife.) Use a spoon to scoop out the avocado meat. Cut into twelve slices. Squeeze, and gently toss, with lemon or lime juice to prevent discoloring. Set aside.",
    "In a large skillet, melt butter over medium heat. Add garlic and cook for 1 minute, stirring frequently, until fragrant. Add pepper and onion and cook until soft, about 5 minutes. When vegetables are soft, add the eggs. Stir to scramble, about 3 minutes, depending on preference for doneness. Remove from heat.",
    "Turn oven broiler on to heat while assembling the tostadas. Place one tomato slice on tostada. Add ¼ of the egg mixture to each tomato slice. Top with three slices of avocado. Sprinkle 1 Tbsp. of cheese on each tostadas. Place under the broiler for 1-2 minutes, until the cheese melts. Serve immediately.",
    "Cook’s Notes:",
    "Adding salsa adds an additional level of flavor.",
    "I used Guerrero Tostadas and 2% milk.",
    "A mixed pepper mix, with green, red, and yellow peppers, adds color and flavor.",
    "While flavors commonly found in Mexican foods are used here, seasonings for egg can be adjusted to preference.",
    "For an even lower calorie/fat tostada, use canola spray instead of the butter, scramble only the egg whites, and omit sour cream garnish"
  ],
  "ingredients": [
    "0",
    "4 corn tostadas",
    "4 eggs",
    "¼ tsp. cumin",
    "¼ tsp. black pepper",
    "¼ tsp. fine sea salt",
    "¼ tsp. oregano",
    "pinch chili powder",
    "pinch paprika",
    "2 Tbsp. milk",
    "1 Tbsp. butter",
    "1 clove garlic, minced",
    "1 cup diced bell pepper mix",
    "½ cup chopped red onion",
    "1 ripe Avocado",
    "4 Tbsp. shredded pepper jack cheese",
    "4 slices ripe tomato",
    "sour cream for garnish (optional)"
  ],
  "__v": 1
}