{
  "hash": "0b3e62f57d7be82fa6703c077e1fa5a45b1c9e5c",
  "title": "Oven Roasted Potatoes",
  "image": "http://www.myadventuresinthecountry.com/wp-content/uploads/2012/03/ovenroastedpot6-150x150.jpg",
  "href": "http://www.myadventuresinthecountry.com/2012/03/23/oven-roasted-potatoes/",
  "firstAdded": "2014-11-23T20:59:20.887000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "hickory",
    "smoked",
    "bacon",
    "lbs",
    "yukon",
    "gold",
    "potatoes",
    "garlic",
    "parmigianoreggiano",
    "coarse",
    "salt",
    "pepper",
    "parsley"
  ],
  "directions": [
    "0",
    "Scrub potatoes and place in a large pot. Fill pot with water until potatoes are covered by 2-3 inches of water. Bring water to a boil and cook for 12-15 minutes or until potatoes are fork tender. My potatoes were fairly large, so this took close to 15 minutes.",
    "Meanwhile, partially freeze bacon for easier cutter. (Ten minutes in the freezer works well.) Slice bacon strips in half, then cut into 1/2-inch pieces. I like to cut my bacon prior to cooking. It's easier to work with in the skillet and easy to drain with slotted spoon.",
    "Cook bacon in a skillet until golden, but still flexible. You don't want it crunchy. Remove cooked bacon onto a plate lined with paper towels. Reserve the bacon drippings.",
    "Check potatoes and if fork tender, drain and allow to cool. If making this recipe again, I would peel the potatoes before I boiled them or try leaving the skins on all-together. Yukon Golds have a relatively thin skin, so I think this would have added a nice look and texture to the potatoes.",
    "While potatoes are cooling, preheat the oven to 425° and mince the garlic and parsley. Also, grate the Parmigiano-Reggiano.",
    "Next, prepare the baking sheet by brushing 1 tablespoon of olive oil and half the bacon drippings on the bottom of the pan. I used a fairly large cookie sheet for this and it worked well.",
    "Once the potatoes are cool, peel and cut in half, or quarter if potatoes are large.",
    "Place cut side down on prepared pan and sprinkle with course salt and fresh ground pepper. Place in 425° oven for 35-40 minutes. Rotate potatoes halfway through the baking time to ensure an even color. I did not do this and some of mine were more golden than others.",
    "Reduce temperature to 375°, turn potatoes over and sprinkle with the bacon, garlic, and Parmigiano-Reggiano.",
    "Add more salt and pepper if desired. Return to oven for an additional 15-20 minutes or until potatoes are evenly browned and cheese is melted. Remove from oven and sprinkle with fresh parsley. Makes 4-6 servings, depending on serving size. Serve immediately!"
  ],
  "ingredients": [
    "0",
    "1 Tbsp olive oil",
    "1/2 lb hickory smoked, thick sliced bacon",
    "3 1/2 lbs Yukon Gold Potatoes",
    "2 cloves garlic, minced",
    "1/4 cup Parmigiano-Reggiano, freshly grated",
    "coarse salt",
    "fresh ground pepper",
    "fresh parsley"
  ],
  "__v": 1
}