{
  "hash": "dd34a6e8ecc1653fecaebe3da918d07b2e69019a",
  "title": "Homemade Soft Pretzels",
  "image": "",
  "href": "http://www.imperialsugar.com/recipes/category/breads/Homemade-Soft-Pretzels",
  "extension": "Chrome",
  "firstAdded": "2016-08-28T21:51:18.928000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "*Spoon & Sweep method: Use a spoon to fill measuring cup with flour until required amount is obtained. Scooping measuring cup directly into flour bag will firmly pack flour resulting in too much flour required for recipe.",
    "DIRECTIONS",
    "Preheat oven to 450°F. Line two baking sheets with parchment paper.",
    "Stir together water, butter and yeast in the bowl of a stand mixer until yeast is mostly dissolved. Let stand for 5 minutes. Add salt and brown sugar and stir to combine.",
    "Add flour and mix use dough hook attachment on medium speed until combined. Touch the dough -- if it is still really sticky and is clinging to mixing bowl, add an additional 1/4 cup flour at a time until dough balls up and no longer sticks to bowl. Continue mixing using the dough hook attachment on medium speed for an additional 5 minutes. (If you do not have a stand mixer, you can knead by hand for 5 minutes instead.)",
    "Turn dough out onto a floured surface, and use a knife or a bench scraper to cut dough into 8 equal pieces. Stretch each piece into long even ropes, about 18-20\" long.",
    "Form ropes into pretzel shapes on parchment-covered baking sheets. To do so, form rope into a large circle, pull ends up, criss-cross (twist) ends once or twice, and then lay them back on bottom of circle for form a standard pretzel shape. Or form ropes into whatever shape you'd like.",
    "Whisk egg in a small bowl to form an egg wash, and brush tops of each pretzel until they are coated. (You can also use melted butter.)",
    "Sprinkle with desired seasonings (see instructions below), and bake for 6 minutes. Change heat to broil, and watching very carefully, broil pretzels to brown tops for 2-4 minutes until they reach your desired level of browning. Be careful, as the tops of pretzels can go from brown to burnt very quickly.",
    "Remove and serve immediately. Pretzels are best eaten the first day, but if stored in a sealed container, they can last up to 4 days.",
    "IMPERIAL SUGAR INSIGHT",
    "Salted Pretzels: Sprinkle pretzels with coarse sea salt before baking.",
    "Cinnamon Sugar Pretzels: Sprinkle pretzels with a mixture of cinnamon and sugar before baking. (1 part cinnamon to 3 parts sugar.)",
    "Parmesan Pretzels: Sprinkle pretzels with grated Parmesan cheese immediately after removing from oven, or before the final minute of broiling. Cheese will burn if under the broiler for more than 1 minute.",
    "Italian Garlic Pretzels: Sprinkle pretzels with garlic salt and Italian seasonings before baking.",
    "Cajun Pretzels: Sprinkle pretzels with Cajun or blackening seasoning before baking.",
    "Recipe developed for Imperial Sugar by Ali Ebright @Gimme Some Oven.",
    "Better Cooking & Baking Tips »",
    "Conversion Charts »",
    "Coupons »",
    "Share",
    "Email this Page",
    "Print This Page"
  ],
  "ingredients": [
    "0",
    "1 cup lukewarm water",
    "4 tablespoons (1/4 cup) melted butter, lukewarm",
    "1 packet (2 1/4 teaspoons) active yeast",
    "2 teaspoons salt",
    "2 tablespoons, packed Imperial Sugar Light Brown Sugar",
    "3 cups bread flour or all-purpose flour*",
    "1 large egg or (additional) 1/4 cup melted butter"
  ],
  "__v": 1
}