{
  "hash": "53b1d9dab6c3e7244aab2dd8afe41538626811bc",
  "title": "30 Minute Spicy Ancho Turkey Chili",
  "image": "http://cdn.pinchofyum.com/wp-content/uploads/2014/09/ancho-turkey-chili-11.jpg",
  "href": "http://pinchofyum.com/30-minute-spicy-ancho-turkey-chili",
  "extension": "Chrome",
  "firstAdded": "2017-02-28T21:45:13.175000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Bring the chicken broth and 1 cup of water to a boil in a small saucepan. Add the farro (or rice or whatever grain you're using), cover the pot, and reduce to a simmer for about 30 minutes or until all liquid is evaporated.",
    "While the farro is cooking, heat the olive oil over medium high heat. Add the onions, garlic, and jalapeños and saute for 1-2 minutes, stirring frequently to avoid burning the garlic. Add the turkey and cook until all the meat is browned and broken apart into \"crumbles\". Add the black beans, ancho chili powder, chili powder, cumin, salt, and salsa and simmer for a few minutes. Add the tomatoes and however much of the remaining 2 cups water that you feel like you need to get the right consistency. Simmer for a few minutes while the farro finishes cooking in a separate pot.",
    "Add the cooked farro to the pot of chili and stir to combine. Top with sour cream, cheese, green onions, and tortilla chips."
  ],
  "ingredients": [
    "0",
    "1 cup farro (another grain like brown rice or quinoa would work)",
    "2 cups chicken broth",
    "3 cups water, divided",
    "1 tablespoon olive oil",
    "½ red onion, minced",
    "2-3 cloves garlic, minced",
    "2-3 jalapeños, minced (remove ribs and seeds if you don't want it to be spicy)",
    "1 lb. ground turkey",
    "1 14-ounce can black beans, rinsed and drained",
    "2 teaspoons ancho chili powder",
    "2 teaspoons chili powder",
    "1 teaspoon cumin",
    "1 teaspoon salt",
    "1 cup salsa (works best with a \"fresh\" salsa brand like Salsa Lisa)",
    "2 14-ounce cans crushed fire roasted tomatoes",
    "toppings (sour cream, cheese, green onions, tortilla chips)"
  ],
  "__v": 1
}