{
  "hash": "5643d8954fd28fac344e48466d7cbe4ba21ab3a6",
  "title": "No-Bake Chocolate Cheesecake",
  "image": "https://beyondfrosting.com/wp-content/uploads/2018/02/Best-Ever-No-Bake-Chocoalte-Cheesecake-009-text.jpg",
  "href": "https://beyondfrosting.com/2018/02/26/best-ever-no-bake-chocolate-cheesecake/",
  "extension": "Firefox",
  "firstAdded": "2020-01-02T09:48:23.797000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the crust: Prepare a 9-inch springform pan by lightly greasing the edges of the pan with cooking spray, and then wiping gently with a paper towel. Line the bottom of the pan with parchment paper.",
    "Grind the cookies into a fine crumb using a food processor or blender.",
    "In a small bowl, melt the butter in the microwave for 30 to 45 seconds. Pour the melted butter over the cookie crumbs and stir until the crumbs are well coated.",
    "Pour the crumbs into your springform pan and press firmly into the bottom and up on the sides to create a thick crust. Refrigerate the crust while you are preparing the filling.",
    "For the filling: In a microwave-safe bowl, combine the dark chocolate and 4 tablespoons of heavy whipping cream. Microwave at 50% power in 30-second increments, stirring each time until the chocolate is melted. Stir until completely smooth.",
    "Place the mixing bowl and whisk attachment in the freezer for 5 to 10 minutes to chill.",
    "Prepare the whipped cream. Pour 1 ½ cups heavy whipping cream into the chilled bowl and use an electric mixer to beat the heavy cream on medium-high speed until the cream starts to thicken. Slowly add the powdered sugar and continue beating on high speed until stiff peaks form. Set the whipped cream aside.",
    "Beat the softened cream cheese until it’s completely smooth. Scrape down the sides of the bowl as needed. Next add the granulated sugar and vanilla extract and continue beating until smooth.",
    "Next add the melted chocolate, beating until it’s completely mixed into the cream cheese.",
    "Finally, slowly fold in the whipped cream in two batches until it’s completely smooth. Pour the filling into the prepared crust, spreading evenly. Refrigerate for 3-4 hours minimum.",
    "For the topping: Prepare another batch of whipped cream by placing your bowl in the freezer for 5-10 minutes. To prepare the whipped cream, pour the heavy whipping cream into the chilled bowl and use an electric mixer to beat the heavy cream on medium-high speed until the cream starts to thicken. Slowly add the powdered sugar and continue beating on high speed until stiff peaks form.",
    "Pipe the borders of the pie with whipped cream using a large open star tip. Garnish with fresh fruit. This cheesecake must stay refrigerated."
  ],
  "ingredients": [
    "0",
    "For the crust:",
    "1 package (14.3 oz) Oreos",
    "½ cup (8 tablespoons) unsalted butter, melted",
    "For the cheesecake filling:",
    "8 ounces dark chocolate",
    "1 ½ cups + 4 tablespoons heavy whipping cream, divided",
    "½ cup powdered sugar",
    "16 ounces (2 pkgs) cream cheese (must be full fat)",
    "1/2 cup granulated sugar",
    "1 teaspoon pure vanilla extract",
    "For the topping:",
    "1 cup heavy whipping cream",
    "½ cup powdered sugar",
    "fresh fruit as desired"
  ],
  "__v": 1
}