{
  "hash": "adbbf23222f1ff9bcb71b0347dd44a7828ef6e94",
  "title": "Slow-Cooked Smoky Spanish Pork Shoulder with Romesco",
  "image": "http://recipe-folder.com/img/recipe-images/019/814/3649941619.jpg",
  "href": "http://recipes.anovaculinary.com/recipe/slow-cooked-smoky-spanish-pork-shoulder-with-romesco",
  "extension": "Chrome",
  "firstAdded": "2015-12-06T11:54:51.226000",
  "users": [
    null
  ],
  "keywords": [
    "smoked",
    "paprika",
    "gram",
    "red",
    "pepper",
    "kosher",
    "salt",
    "bonein",
    "pork",
    "shoulder",
    "trimmed",
    "california",
    "chiles",
    "almonds",
    "slices",
    "baguette",
    "lightly",
    "torn",
    "pieces",
    "garlic",
    "extra",
    "virgin",
    "olive",
    "oil",
    "sherry",
    "vinegar",
    "boiling",
    "water",
    "soaking",
    "parsley"
  ],
  "directions": [
    "0",
    "Directions",
    "Step 1",
    "Set the Anova Precision Cooker to 150ºF (65.6ºC).",
    "Step 2",
    "In a small bowl, mix together smoked paprika, red pepper flakes, and 1 tablespoon (11 grams) salt.",
    "Step 3",
    "Rub paprika mixture on all sides of the pork. Transfer pork to a large zipper lock or vacuum seal bag. Seal the bag using the water immersion technique or a vacuum sealer on the dry setting.",
    "Step 4",
    "Place the bag in the water bath and set the timer for 36 hours. Cover the water bath with plastic wrap to minimize evaporation. You may need to add water periodically to keep the pork submerged.",
    "Step 5",
    "Meanwhile, prepare the romesco sauce: Place the chiles in a dry pan over medium heat. Toast, flipping occasionally, until the chiles begin to swell and become aromatic. Remove from the heat and let cool for a few minutes.",
    "Step 6",
    "Discard the stem end of the chiles and tear into 2-inch pieces. Shake out the seeds. Place the chiles in a medium bowl and cover with boiling water. Let soak until pliable, about 30 minutes. Drain well.",
    "Step 7",
    "Combine the almonds, bread, garlic and soaked chiles in the bowl of a food processor. Process until mixture is well-ground, 30 seconds to 1 minute.",
    "Step 8",
    "With the food processor running, slowly drizzle in the olive oil and vinegar through the feed tube. Thin the sauce with 1 to 2 tablespoons water, as desired. Season to taste with salt and vinegar. Transfer to the refrigerator until the pork is finished. (Bring the sauce to room temperature before serving.)",
    "Finishing Steps",
    "Step 1",
    "When the timer goes off, remove the bag from the water bath. Remove the pork from the bag and discard any cooking liquid and/or rendered fat. Slice the meat from the bone and serve with the romesco sauce, topped with parsley."
  ],
  "ingredients": [
    "0",
    "Ingredients for 6",
    "2 tablespoons (7.5 grams) smoked paprika",
    "1/2 teaspoon (about 1 gram) red pepper flakes",
    "Kosher salt",
    "3–3 1/2 pounds (1.4–1.6 kg) bone-in pork shoulder, trimmed",
    "2 whole dried California chiles (10-12 grams)",
    "3/4 cup (113 grams) whole almonds, toasted and chopped",
    "2 (1-inch) slices baguette (25 grams), lightly toasted and torn into small pieces",
    "4 cloves garlic (15 grams), chopped",
    "3/4 cup (177 mL) extra virgin olive oil",
    "1 tablespoon (11 mL) sherry vinegar, plus more to taste",
    "1–2 tablespoons (11 mL–22 mL) water, plus boiling water for soaking chiles",
    "Chopped fresh parsley, for serving"
  ],
  "__v": 1
}