{
  "hash": "6654674fbaea2d5109fac34b566d676417181156",
  "title": "Instant Pot Lentil Soup",
  "image": "https://i2.wp.com/wellplated.com/wp-content/uploads/2018/02/Instant-Pot-French-Lentil-Soup-600x690.jpg",
  "href": "https://www.wellplated.com/instant-pot-lentil-soup/",
  "extension": "Chrome",
  "firstAdded": "2019-12-03T22:23:05.305000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Drizzle the oil into the Instant Pot. Set to SAUTE. Once the oil is hot, add the onion and stir. Continue to cook the onion, stirring often, until the onions are very soft and beginning to nicely brown and break down, about 8 minutes.",
    "While the onion cooks, peel the carrots and cut into small dice. Small dice the celery as well. Add the carrots, celery, thyme springs (you can tie them together if you like to make them easier to fish out later), salt, smoked paprika, and pepper. Sauté until the carrots and celery are barely soft, about 2 minutes.",
    "Add the lentils and garlic to the pot and stir to coat them in the spices. Let cook 30 seconds, until the garlic is fragrant. Add the diced tomatoes, crushed tomatoes, and vegetable broth.",
    "Cover and seal the Instant Pot, and then set to cook on HIGH pressure for 15 minutes. After 15 minutes of high pressure, allow the cooker to release pressure naturally. This will take about 10 to 15 additional minutes.",
    "Open the lid and stir the soup. Remove the thyme stems, leaving the leaves in the soup. If the soup is too thick for your liking, thin with a bit of water or additional stock until you reach your desired consistency. (We tend to like our soups pretty thick and hearty around here.) Taste and adjust the seasonings as desired. Serve hot with a sprinkle of parsley, Parmesan (if using), and bread for dipping."
  ],
  "ingredients": [
    "0",
    "2 tablespoons extra-virgin olive oil",
    "1 medium yellow onion — small diced",
    "4 medium carrots",
    "3 stalks celery",
    "4 springs fresh thyme",
    "1 teaspoon kosher salt",
    "3/4 teaspoon smoked paprika",
    "1/2 teaspoon black pepper",
    "1 1/2 cups French green lentils",
    "4 cloves garlic — minced (about 4 teaspoons)",
    "1 can fire-roasted diced tomatoes — (15 ounces)",
    "1 can crushed tomatoes — (15 ounces)",
    "4 cups low-sodium vegetable broth",
    "Chopped fresh parsley — for serving",
    "Freshly grated Parmesan cheese — optional for serving",
    "Crusty bread — optional for serving"
  ],
  "__v": 1
}