{
  "hash": "107091cdae85ed71b761b4c67e800455c2a3abe2",
  "title": "French Chocolate Tart with Brown Butter Crust",
  "image": "http://thecafesucrefarine.com/wp-content/uploads/2015/05/Tarte-au-chocolat-6.jpg",
  "href": "http://thecafesucrefarine.com/2015/05/french-chocolate-tart-with-brown-butter-crust/",
  "extension": "Chrome",
  "firstAdded": "2016-04-05T19:40:31.725000",
  "users": [
    null
  ],
  "keywords": [
    "crust",
    "butter",
    "mild",
    "flavored",
    "oil",
    "use",
    "canola",
    "water",
    "sugar",
    "salt",
    "slightly",
    "round",
    "allpurpose",
    "flour",
    "ganache",
    "filling",
    "cream",
    "good",
    "quality",
    "chocolate"
  ],
  "directions": [
    "0",
    "Preheat the oven to 410º F (210º C).",
    "Cut butter into small pieces and place in a medium-sized ovenproof bowl (I use Pyrex). Add the oil, water, sugar, and salt.",
    "Place the bowl in the oven until mixture is bubbling and just starting to brown, about 15 minutes.",
    "Remove bowl from the oven and reduce temperature to 375˚F.. The bowl will be very hot so handle with a hot pad till it cools down. Immediately add the flour (stand back a bit as the mixture may sputter as flour is added). With a heat-proof spatula stir until the mixture forms a ball.",
    "Transfer the dough to a 8 or 9-inch* (23 cm) tart mold with a removable bottom. When it's cooled down a bit, press dough to an even layer with your fingers. I like to start with the sides and then press the remaining dough on the bottom. (David Lebovitz suggests reserving a small ball of dough to patch up any cracks once the crust is baked. I do this if the filling is a runny egg mixture but with this thick chocolate ganache, I don't worry about it.)",
    "Pierce the bottom with a fork all over. Also press the sides of the crust with a fork to reinforce.",
    "Bake for 15 minutes or until crust is golden brown.",
    "Remove from the oven and allow to cool completely before filling.",
    "For the ganache filling, break the chocolate into small pieces and place in a medium size bowl.",
    "Heat the cream. When it reaches the boiling point, remove. You can heat the cream on the stovetop or in the microwave. Remove it from the heat just as it starts to boil.",
    "Pour the hot cream over the chocolate. Stir with a heat-proof spatula till creamy and all chocolate has melted. Add the butter and stir well to incorporate.",
    "Pour chocolate mixture into cooled crust and refrigerate for at least one hour. Can be made up to 24 hours in advance. Top with raspberries, strawberries, caramel, whipped cream or whatever strikes your fancy!"
  ],
  "ingredients": [
    "0",
    "For the crust:",
    "3 ounces butter (90g)",
    "1 tablespoon vegetable oil, any mild flavored oil is fine. I use canola.",
    "3 tablespoons water",
    "1 tablespoon sugar",
    "⅛ teaspoon salt",
    "1 slightly round cup all-purpose flour (150g or 5 ounces)",
    "For the ganache filling",
    "1 cup heavy cream (250ml)",
    "8 ½ ounces good quality chocolate** (250g)",
    "1 ounce butter (30g)"
  ],
  "__v": 1
}