{
  "hash": "33110cd92e8eb0b3927490c13b88c561ff93659c",
  "title": "HOMEMADE VEGAN BUTTER (PALM OIL-FREE, SOY-FREE)",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2013/11/Homemade-Vegan-Butter.jpg",
  "href": "http://www.onegreenplanet.org/plant-based-recipes/homemade-vegan-butter-palm-oil-free-soy-free/",
  "firstAdded": "2015-01-19T15:29:40.227000",
  "users": [
    null
  ],
  "keywords": [
    "raw",
    "cashews",
    "soy",
    "milk",
    "water",
    "apple",
    "cider",
    "vinegar",
    "salt",
    "coconut",
    "oil",
    "room",
    "tbs",
    "organic",
    "canola",
    "heaping",
    "sunflower",
    "lecithin",
    "guar",
    "xanthan",
    "gum"
  ],
  "directions": [
    "0",
    "Have all your ingredients and the molds ready so you can work quickly. In a food processor, combine the cashews and water and mix until you have a smooth puree. The consistency should be like cream. (Note: I did not soak my cashews but only because I didn’t plan on making this in advance. If you know you are going to make this in advance, soak the cashews for a few hours). Pour the cashew puree into a bowl, add the apple cider vinegar and salt. Stir and set aside for about 10 minutes. It should thicken a bit.",
    "Clean out the food processor. If your coconut oil is not at room temperature, you can heat it until it’s just melted and then let it cool to room temperature. I knew I was using the whole jar so I just left it out of the fridge until it was at room temperature.",
    "Add the coconut oil, the canola oil, the cashew puree mixture, the sunflower lecithin and the guar gum to the food processor. Process for about 2 minutes until it is completely smooth. Pour the mixture into the mold and freeze it until it is solid, about an hour or so. You can use an ice cube mold for short sticks of butter or you can use a small container for a tub effect. When it is solid, carefully pop the butter out of the mold.",
    "The recipe made 3 short sticks of butter. I wrapped each in plastic wrap and put them in the freezer where they should last for a year. When I want to use one, I will transfer it to the fridge in an airtight container. That’s it! We have butter! Enjoy!"
  ],
  "ingredients": [
    "0",
    "1/3 cup raw cashews (or soy milk)",
    "2/3 cup water",
    "1 tsp. raw apple cider vinegar",
    "1/4 tsp. sea salt",
    "2/3 cup raw coconut oil, room temperature",
    "1 Tbs. + 1 tsp. organic canola oil (or your choice of oil)",
    "1 heaping tsp. raw sunflower lecithin (or soy lecithin)",
    "1/4 + 1/8 tsp. guar gum (or xanthan gum)"
  ],
  "__v": 1
}