{
  "hash": "80fa64f7ad8b3ef13a5783c803051781d6db4d89",
  "title": "Blueberry Cornmeal Galette",
  "image": "https://prods3.imgix.net/images/articles/2014_03/Blueberry_Cornmeal_Galette_Sarah_Botcher_Black_Walnut_Bakery_Minneapolis_Dessert_Recipe_Article_Image.jpg?auto=format%2Ccompress&h=980&ixjsv=2.2.3",
  "href": "https://www.tastingtable.com/cook/recipes/Blueberry-Cornmeal-Galette",
  "extension": "Chrome",
  "firstAdded": "2017-07-01T02:08:28.218000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "1. Make the dough: In the bowl of a stand mixer fitted with the paddle attachment, mix together the all-purpose flour, pastry flour, corn flour, sugar and the salt. Add the butter and paddle on medium-low speed until the mixture looks like coarse meal with butter pieces no larger than a small pea. Add the water and continue to mix until the dough comes together.",
    "2. Turn the dough out onto a sheet of plastic wrap and pat into a 1-inch-thick circle. Enclose in plastic wrap and refrigerate for at least 30 minutes (or up to 2 days; if chilling the dough for more than 30 minutes, let it sit out at room temperature for 10 minutes before rolling). Set the dough onto 2 overlapping sheets of plastic wrap (you want at least a 15-inch diameter of plastic wrap beneath the dough) and cover with another sheet of plastic wrap. Roll out the dough to a diameter of 8 inches, then adjust the plastic wrap and add another overlapping sheet so you can continue to roll the dough into a 14-inch circle that is slightly less than ¼-inch thick. Transfer the dough circle (still sandwiched between the plastic wrap) to a rimmed baking sheet and refrigerate for 30 minutes.",
    "3. Make the galette: Preheat the oven to 375°. Remove the baking sheet from the refrigerator and set the dough aside. Line the baking sheet with a piece of parchment paper. To a large bowl, add the blueberries, ¼ cup plus 1 tablespoon of the sugar, cornstarch, half of the lemon zest and the lemon juice.",
    "4. Peel off the top layer of plastic wrap from the dough and invert it onto the parchment-lined baking sheet (trim the edges of the dough slightly for a cleaner look). Turn the blueberry mixture out onto the center of the dough circle, mounding it slightly and leaving a 2½-to 3-inch border around the edges. Gently fold the edges of the dough over the blueberries, overlapping the dough slightly and gently pressing it together to create folds.",
    "5. Brush the edges of the dough with the beaten egg and sprinkle with 2 tablespoons of the sugar. Bake the galette until the crust is golden and fruit is thick and bubbling, rotating the baking sheet midway through cooking, for 35 to 40 minutes.",
    "6. Remove the galette from the oven and set aside to cool completely. Meanwhile, in a medium bowl, mix together the mascarpone, remaining lemon zest and the remaining 1 tablespoon of sugar. Sprinkle the galette with the thyme leaves and serve in wedges with a dollop of the lemon mascarpone."
  ],
  "ingredients": [
    "0",
    "Dough",
    "1 cup plus 2 tablespoons all-purpose flour, plus extra for shaping",
    "1 cup plus 2 tablespoons pastry flour",
    "½ cup plus 1 tablespoon corn flour or fine cornmeal",
    "2 teaspoons granulated sugar",
    "1 teaspoon kosher salt",
    "2 sticks (16 tablespoons) cold unsalted butter, cut into ½-inch cubes",
    "3 to 4 tablespoons ice water",
    "Galette",
    "5 cups (2½ pints) fresh blueberries",
    "½ cup granulated sugar, divided",
    "1¼ teaspoons cornstarch (if using plums use 1 extra teaspoon)",
    "Zest of 2 lemons, plus 1 tablespoon fresh lemon juice, divided",
    "1 large egg, lightly beaten",
    "1 teaspoon fresh thyme leaves",
    "1 cup mascarpone"
  ],
  "__v": 1
}