{
  "hash": "0e0410b5d35453927f89fa15bca1382de20620ae",
  "title": "MEXICAANSE OVENSCHOTEL",
  "image": "http://www.francescakookt.nl/wp-content/uploads/Mexicaanse-ovenschotel_2.jpg",
  "href": "http://www.francescakookt.nl/mexicaanse-ovenschotel/",
  "extension": "Chrome",
  "firstAdded": "2016-09-08T19:40:49.844000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Verwarm de oven voor op 200 graden.",
    "Hak de ui, knoflook en peper (zonder zaadlijsten) helemaal fijn in een hakmolentje. Snijd de paprika en tomaat in kleine blokjes.",
    "Verhit 2 eetlepels olijfolie in een hapjespan en fruit hierin het uimengsel voor 2 minuten. Voeg dan de Mexicaanse kruiden toe en bak dit nog zachtjes 2 minuten mee. Daarna komt het gehakt erbij, rul dit totdat het gaar is. Vervolgens bak je de stukjes paprika nog 2 minuten mee.",
    "Zet het vuur wat zachter en schep de stukjes tomaat en de uitgelekte bonen en mais door het gehakt, samen met de crème fraîche en ketchup. Laat dit nog een paar minuten zachtjes sudderen en proef. Breng eventueel extra op smaak met peper en zout en als je wat meer scherpte wilt dan maal je er nog wat chili over."
  ],
  "ingredients": [
    "0",
    "- 1 ui",
    "- 3 teentjes knoflook",
    "- 1/2 groene of rode peper (zonder kind aan tafel had ik er een hele voor gebruikt)",
    "- 1 groene paprika",
    "- 1 rode paprika",
    "- 2 tomaten",
    "- 2 volle tl Mexicaanse kruiden (ik gebruikte de Picadillo kruiden van Jonnie Boer, deze nieuwe ‘original spices’ kruidenlijn is geweldig! Te vinden bij de grotere supermarkten. Natuurlijk kun je ook tacokruiden of andere Mexicaanse kruiden gebruiken)",
    "- 400gr gehakt",
    "- 1 blik (400gr) kidneybonen (afgespoeld en uitgelekt)",
    "- 1 blik (400gr) zwarte bonen (afgespoeld en uitgelekt)",
    "- 150gr mais (uitgelekt)",
    "- 125gr crème fraîche",
    "- 2 volle el ketchup",
    "- tacochips naturel",
    "- 150gr geraspte kaas die goed smelt",
    "- olijfolie om in te bakken",
    "- zeezout",
    "- zwarte peper"
  ],
  "__v": 1
}