{
  "hash": "4067d3f16e0e25be16685f0f72f93bd074b3521a",
  "title": "Beef Barbacoa Sliders",
  "image": "https://patijinich.com/wp-content/uploads/2014/01/151214_Patti_S3_BeefBarbacoaSliders_180_Cropped-1-912x622.jpg",
  "href": "https://patijinich.com/recipe/beef-barbacoa-sliders/",
  "extension": "Chrome",
  "firstAdded": "2017-10-29T11:32:31.095000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the marinade: Heat a large skillet or comal over medium heat. Add the dried guajillo and ancho chiles and toast them for no more than 20 seconds per side, taking care not to burn them. Transfer the toasted chiles to a medium saucepan and add the water, place over medium heat and cook for 12 to 15 minutes, until the chiles have softened and rehydrated.",
    "Transfer the chiles to a blender, and add 2 cups of their cooking liquid (discard the remaining liquid), the vinegar, tomato, onion, garlic, oregano, cinnamon, allspice, black pepper, cloves and salt. Puree until smooth.",
    "Wipe out the medium saucepan and add the oil. Place over medium heat for 1 to 2 minutes, then add the pureed chile mixture, being careful to avoid any splatters. Partially cover and cook for 10 to 12 minutes, stirring once or twice, until the color darkens and the mixture thickens to a paste-like consistency.",
    "For the meat: Place the beef in a large bowl and cover it with the marinade. If you will not cook it that day, cover and place in the refrigerator for up to 48 hours. Wrap the individual meat chunks in pieces of banana leaf or aluminum foil as you would wrap burritos or tamales - making sure to add a generous amount of marinade in each packet.",
    "Preheat the oven to 350°F. Place the meat packets inside a large, heavy ovenproof French oven or casserole, pour in the beer and cover with a tight-fitting lid. Roast for about 3 hours, until the meat is succulent and comes apart when pulled with a fork. Transfer to the stovetop (off of the heat), and let everything rest for 10 to 15 minutes before opening the meat packets.",
    "Serve on slider buns with drunken salsa and/or pickled jalapeños."
  ],
  "ingredients": [
    "0",
    "10guajillo chilesstemmed and seeded",
    "10ancho chilesstemmed and seeded",
    "5cupswater",
    "1/3cupapple cider vinegar",
    "1medium Roma tomatoquartered",
    "1/2medium white onioncoarsely chopped (about 1/2 cup)",
    "3medium clovesgarlic",
    "1tablespoondried oregano",
    "1/2teaspoonground cinnamon",
    "1/2teaspoonground allspice",
    "1/2teaspoonfreshly ground black pepper",
    "5whole clovesstems removed",
    "2 1/2teaspoonskosher or coarse sea salt",
    "3tablespoonssafflower or vegetable oil",
    "4poundsbeef round roast or brisketcut into 4-inch chunks",
    "1poundBanana leavesor aluminum foil",
    "12ounceslight beer(1 bottle)",
    "24small slider bunsbrioche or challah buns are specially good with this!",
    "pickled jalapeñosoptional"
  ],
  "__v": 1
}