{
  "__v": 2,
  "directions": [
    "0",
    "Make the tangzhong. In a small saucepan, gently heat the bread flour + water, while slowly whisking. When the mixture thickens, and swirl lines appear – remove from heat and cool. You will only end up using half of this mixture – store the other half in the refrigerator (covered) for up to 3 days.",
    "Make the cream pan dough. In a bread machine pan, add the tangzhong, butter, sugar, salt, and egg beaten with the milk. On top of those ingredients, add the bread flour. Make a depression in the center of the bread flour, and add the yeast. Turn the bread machine on the “basic dough” setting. (Alternately, you can make the dough by hand – knead all of the ingredients together for 10-15 minutes, then allow the dough to rise (covered) for 1 hour in a warm place. Punch down, and allow to rise another 30 minutes.)",
    "While the dough is rising, make the custard cream. Scald the milk and butter in a large pyrex measuring cup by microwaving for 2-3 minutes.",
    "Beat the egg yolk with a whisk, and add the flour, cornstarch, salt, and sugar. Whisk together to form a thick paste.",
    "Add about 1/3 of the warm milk mixture to the paste, and whisk constantly. (This step tempers the egg, and loosens up the paste so that you can add the remaining warm milk.) Add the second 1/3 of the warm milk, and whisk until combined. Then add the last 1/3 of the warm milk, and whisk until combined.",
    "Strain the egg mixture into a saucepan. (This will catch any lumps, and any bits of egg that may have “scrambled”.)",
    "Add the vanilla bean paste (or vanilla extract, or scraped vanilla bean guts), then slowly heat the saucepan over medium low heat (whisking constantly). When the mixture thickens so that swirl lines appear, remove from heat and continue whisking another 30 seconds.",
    "Refrigerate the custard cream until cold and thick in a covered container for several hours.",
    "Dust a work surface liberally with flour. Divide the dough into 16 pieces. Using a cookie scoop, portion out 16 balls of chilled custard cream. (I usually set the custard portions on top a sheet of reynold’s non-stick foil.)",
    "Flatten each piece of dough with the palm of your hand and place in a small custard cup. Use a small spoon to put a portion of chilled custard into the depression.",
    "Pinch the edges upwards to seal and place seam side down on a silicone lined cookie sheet.",
    "Cover with plastic wrap and allow to rise for another 30-60 minutes. Brush the tops of the buns with the egg wash, and bake at 335 degrees for 15 minutes.",
    "Remove from oven and cool thoroughly. Refrigerate to store."
  ],
  "firstAdded": "2014-06-17T22:47:39.751000",
  "hash": "458594e6939789630f4dedde71d044e5e2af2152",
  "href": "http://www.the350degreeoven.com/2012/02/japanese-hawaiian/japanese-cream-pan-japanese-custard-filled-sweet-bread-buns/",
  "image": "http://www.the350degreeoven.com/wp-content/uploads/2012/01/DSC_0900-1024x680.jpg",
  "ingredients": [
    "0",
    "Cream Pan Dough:",
    "2 1/2 c. bread flour",
    "2 tsp. active dry yeast",
    "4 T. sugar",
    "3 T. unsalted butter",
    "1/2 tsp. salt",
    "1/2 c. tangzhong",
    "1 egg",
    "1/2 c. milk",
    "Tangzhong:",
    "1/3 c. bread flour",
    "1 c. water",
    "Japanese custard cream:",
    "1 3/4 c. milk",
    "4 T. unsalted butter",
    "4 egg yolks",
    "1/2 c. sugar",
    "5 T. flour",
    "2 T. cornstarch",
    "1/2 tsp. salt",
    "2 tsp. vanilla bean paste (or vanilla extract, or seeds scraped out of 1 vanilla bean pod)",
    "Egg Wash:",
    "1 egg yolk beaten with 1 T. water"
  ],
  "keywords": [
    "cream",
    "pan",
    "dough",
    "bread",
    "flour",
    "active",
    "dry",
    "yeast",
    "sugar",
    "unsalted",
    "butter",
    "salt",
    "tangzhong",
    "egg",
    "milk",
    "water",
    "japanese",
    "custard",
    "yolks",
    "cornstarch",
    "seeds",
    "scraped",
    "vanilla",
    "bean",
    "pod",
    "wash",
    "yolk"
  ],
  "title": "Japanese Cream Pan (Japanese custard filled sweet bread buns)",
  "users": [
    null
  ]
}