{
  "hash": "b191a1fff8cf36bd73bc85d6710373d78de262e4",
  "title": "BBQ Jackfruit Sandwiches with Avocado Slaw",
  "image": "https://minimalistbaker.com/wp-content/uploads/2015/03/AMAZING-BBQ-Jackfruit-Sandwiches-The-texture-is-spot-on-and-the-flavor-is-BIG-vegan-glutenfree.jpg",
  "href": "https://minimalistbaker.com/bbq-jackfruit-sandwiches-with-avocado-slaw/",
  "extension": "Firefox",
  "firstAdded": "2018-12-03T08:36:32.871000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Rinse, drain, and thoroughly dry jackfruit. Chop off the center \"core\" portion of the fruit and discard. Place in a mixing bowl and set aside.",
    "Mix together BBQ seasoning and add to jackfruit. Toss to coat.",
    "Heat a large skillet over medium heat. Once hot, add 1-2 Tbsp oil of choice and seasoned jackfruit (use more oil, as needed, if increasing batch size). Toss to coat and cook for 2-3 minutes to achieve some color.",
    "Add BBQ sauce and thin with enough water to make a sauce. Stir and reduce heat to low- medium and cook for about 20 minutes (up to 35 minutes on low for a deeper flavor).",
    "Remove lid and stir occasionally. TIP: For finer texture, use two forks to shred the jackfruit as it cooks down.",
    "In the meantime, make slaw by adding all ingredients except vegetables (avocado through salt + pepper) to a small mixing bowl and whisk to combine. Thin with water until a thick sauce is made, then add veggies and toss to coat. Set in the refrigerator until serving.",
    "Once the jackfruit has been properly simmered, turn up heat to medium-high and cook for 2-3 more minutes to get a little extra color/texture (a tip I learned from Namely Marly!). Then remove from heat.",
    "Place generous portions of slaw on the bottom buns, top with generous serving of BBQ jackfruit, and cashews. Serve with extra BBQ sauce!",
    "Leftover jackfruit keeps for up to a couple days in the fridge, though best when fresh."
  ],
  "ingredients": [
    "0",
    "BBQ JACKFRUIT",
    "2 20-ounce cans young green jackfruit in water (NOT in syrup or brine)",
    "1/4 cup BBQ seasoning (For 1/4 cup or ~45 g BBQ seasoning, use 2 Tbsp brown sugar + 1 tsp paprika + 1 tsp garlic powder + 1/2 tsp salt + 1/2 tsp pepper + 1/2 tsp chili powder)",
    "3/4 cup BBQ sauce (ensure it’s vegan // plus more for topping)",
    "AVOCADO SLAW (optional)",
    "2 cups shredded cabbage + carrots (Trader Joe’s has a great cruciferous veg mix)",
    "1/2 ripe avocado",
    "1 Tbsp maple syrup (or sweetener of choice)",
    "1 lemon or lime (juiced)",
    "Salt + pepper (to taste)",
    "Water (to thin)"
  ],
  "__v": 1
}