{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 350 degrees. Prepare an 8 x 8 inch baking dish by lining it with parchment paper, leaving extra paper hanging over two of the sides. If you don't have parchment paper, spray the dish with non-stick cooking spray.",
    "1",
    "In a medium bowl, stir together cream cheese, sugar, egg, and lemon juice until smooth and creamy. Set aside.",
    "2",
    "In another medium bowl, whisk together flour, baking powder, baking soda, and salt. Set aside.",
    "In the bowl of an electric stand mixer, mix oil and sugar. Add egg and mix well.",
    "Add Greek yogurt, lemon zest and lemon juice. Mix well on medium speed until smooth and creamy.",
    "Gradually add the flour mixture to the batter and mix until incorporated on low speed. Be careful not to over mix.",
    "Spoon the batter into the prepared baking dish and smooth it out to the edges.",
    "Carefully spread the cream cheese mixture over the top of the batter, spreading it almost to the edges.",
    "3",
    "To make the crumb topping, pour the flour, sugar and cold cubed butter into a medium bowl, and using a pastry cutter or two forks, cut the butter into the flour and sugar until you are have pea sized crumbs of flour coated butter. Pour the crumb mixture over the cream cheese layer.",
    "Bake the coffee cake at 350 degrees for 40-45 minutes. Allow to cool, and then dust with powdered sugar. Remove from the dish using parchment paper to a cutting board, and cut into 16 squares."
  ],
  "firstAdded": "2014-07-20T19:44:02.509000",
  "hash": "9f3df9442fab258ee30753f6a501a18814ffe31a",
  "href": "http://lovelylittlekitchen.com/greek-yogurt-cream-cheese-lemon-coffee-cake/",
  "image": "http://d2t88cihvgacbj.cloudfront.net/manage/wp-content/uploads/2014/01/Greek-Yogurt-Cream-Cheese-Lemon-Coffe-Cake-7.jpg",
  "ingredients": [
    "0",
    "8 ounces Greek Yogurt Cream Cheese, softened (regular cream cheese is fine too)",
    "1/4 cup sugar",
    "1 egg",
    "1 1/2 teaspoon fresh lemon juice",
    "1",
    "1 1/2 cups flour",
    "1/2 teaspoon baking powder",
    "1/4 teaspoon baking soda",
    "1/4 teaspoon salt",
    "1/2 cup vegetable oil",
    "3/4 cup sugar",
    "1 egg",
    "1/2 cup Greek yogurt",
    "zest of one lemon",
    "1 tablespoon fresh lemon juice (add more for stronger lemon flavor)",
    "2",
    "1/2 cup flour",
    "1/4 cup sugar",
    "2 tablespoons cold cubed butter",
    "powdered sugar for dusting"
  ],
  "keywords": [
    "greek",
    "yogurt",
    "softened",
    "regular",
    "cream",
    "cheese",
    "sugar",
    "egg",
    "lemon",
    "juice",
    "flour",
    "baking",
    "soda",
    "salt",
    "oil",
    "zest",
    "stronger",
    "flavor",
    "cold",
    "cubed",
    "butter",
    "dusting"
  ],
  "title": "Greek Yogurt Cream Cheese Lemon Coffee Cake",
  "users": [
    null
  ]
}