{
  "hash": "815baa71aec58571aa33ba7c19b2fd7e3beb89d8",
  "title": "mon Roll Cupcakes",
  "image": "http://3.bp.blogspot.com/_n2M31R4Iv58/TKSV2VoMsvI/AAAAAAAABps/bvx3kyEM-uw/s400/9-27-10+017.1.jpg",
  "href": "http://homeiswheretheholmansare.blogspot.com.es/2010/09/apple-cinnamon-roll-cupcakes.html",
  "extension": "Chrome",
  "firstAdded": "2015-09-03T17:36:41.306000",
  "users": [
    null
  ],
  "keywords": [
    "dough",
    "milk",
    "active",
    "dry",
    "yeast",
    "sugar",
    "salt",
    "allpurpose",
    "flour",
    "rolling",
    "eggs",
    "unsalted",
    "butter",
    "room",
    "filling",
    "brown",
    "cinnamon",
    "nutmeg",
    "used",
    "golden",
    "apples"
  ],
  "directions": [
    "0",
    "In a small saucepan, heat milk to about 110 degrees. Add yeast and sugar to bowl of a stand mixer and pour in the milk, stir to dissolve. Add salt and two cups of flour and beat for two minutes. Beat in eggs and butter. Stir in the remaining flour half a cup at a time, beating well after each addition. Switch to dough hook and knead about five minutes, until smooth and elastic. Spray a large deep bowl with cooking spray, shape dough into a ball, put it in the bowl, turn once to coat and cover it with a clean towel. Set in a warm place and allow to rise for about 40 minutes or until doubled in volume.",
    "Meanwhile make the filling by combining the sugars, cinnamon, nutmeg, cloves and apples in a small bowl. Melt remaining butter in a small dish.",
    "Dust counter top with flour and roll out dough into a long rectangle about 1/4 inch thick. Brush with about half of the melted butter. Top with the apple mixture, sprinkle evenly over the dough, leaving about an inch empty on all sides.",
    "Line cupcake pans with 24 liners. Roll dough into a log beginning on the long side of the rectangle. Trim off both ends to remove the uneven part that doesn't have any filling. Slice the log into approximately 24 even pieces. Place each piece in a cupcake liner, folding the ends together to make a “C” shape. The pieces should come to about the top of the liners. Cover the cupcake tins with a clean towel and set in a warm place to rise for another 40 minutes.",
    "Preheat the oven to 350 F. Brush the tops of the cupcakes with remaining melted butter. Bake for about 20 minutes or until the tops are golden.",
    "Glaze:",
    "1 cup powdered sugar",
    "About 2 tablespoons milk",
    "In a small bowl, mix powdered sugar and milk until combined. Start with one tablespoon of milk and add more as necessary until you have a glaze that is thick but runs easily off the spoon. Drizzle over warm cupcakes and serve. Store in an airtight container and reheat leftover cupcakes in the microwave for about 20 seconds before serving."
  ],
  "ingredients": [
    "0",
    "Dough:",
    "2 cups milk",
    "1 packet active dry yeast",
    "1/3 cup sugar",
    "2 teaspoons salt",
    "6 1/2 cups all-purpose flour, plus more for rolling",
    "2 eggs",
    "1/4 cup unsalted butter, room temperature",
    "Filling:",
    "1/4 cup unsalted butter, melted",
    "1 cup sugar",
    "1 cup brown sugar",
    "3 tablespoons cinnamon",
    "1/4 tsp ground nutmeg",
    "1/4 tsp ground cloves",
    "2 cups finely chopped apples (I used Golden Delicious apples)"
  ],
  "__v": 1
}