{
  "hash": "38db2648a34a713c22ce95da664812e64930e682",
  "title": "Carrot Cake with Maple Cream Cheese Frosting",
  "image": "https://i1.wp.com/farm4.static.flickr.com/3094/3092973178_d1abf4f712_z.jpg",
  "href": "https://smittenkitchen.com/2008/12/carrot-cake-with-maple-cream-cheese-frosting/",
  "extension": "Chrome",
  "firstAdded": "2017-04-15T12:41:10.824000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To assemble a carrot layer cake, frost the top of one cake, place the other cake on top. Frost the sides and top, swirling decoratively. Refrigerate the cake for 30 minutes to set up frosting."
  ],
  "ingredients": [
    "0",
    "Makes 24 cupcakes (or one two-layer cake, instructions at end)",
    "2 cups all purpose flour",
    "2 teaspoons baking soda",
    "1 teaspoon table salt",
    "2 teaspoons ground cinnamon",
    "1/2 teaspoon ground nutmeg",
    "1 teaspoon ground ginger",
    "2 cups granulated sugar",
    "1 1/4 cups canola oil",
    "4 large eggs",
    "3 cups grated peeled carrots",
    "1 cups coarsely chopped walnuts (optional)",
    "1/2 cup raisins (optional)",
    "Preheat oven to 350°F.",
    "Line 24 cupcake molds with papers, or butter and flour them.",
    "Whisk flour, baking soda, salt, cinnamon, nutmeg and ginger in medium bowl to blend. Whisk sugar and oil in large bowl until well blended. Whisk in eggs 1 at a time. Add flour mixture and stir until blended. Stir in carrots, walnuts and raisins, if using them. Divide batter among cupcake molds, filling 3/4 of each.",
    "Bake cupcakes 14 to 18 minutes, or until a tester inserted into the center of one comes out clean. Let cool in pans for five minutes or so, then transfer cakes to a cooling rack. Let cool completely before icing them.",
    "To make a carrot layer cake: Butter two 9-inch-diameter cake pans instead of cupcake molds. Line bottom of pans with waxed parchment paper. Butter and flour paper; tap out excess flour. Divide the batter between the prepared pans, and bake the layers for about 40 minutes each, or until a tester inserted into center comes out clean. Cool cakes in pans 15 minutes. Turn out onto racks. Peel off paper; cool cakes completely.",
    "Maple Cream Cheese Frosting",
    "Two (8-ounce) packages cream cheese, softened",
    "1 stick unsalted butter, room temperature",
    "2 cups confectioners’ sugar",
    "1/4 cup pure maple syrup",
    "In a stand mixer beat all the ingredients on medium until fluffy. Chill the frosting for 10 to 20 minutes, until it has set up enough to spread smoothly.",
    "The spazzy star decorations were created by putting the maple cream cheese frosting into a piping bag fitted with a large star tip and dolloping away. An extra layer of dollops were piped nearer to the center, to create a domed effect."
  ],
  "__v": 1
}