{
  "hash": "0d7cdfb604ba56ac31184c7f9e0a228a7969eb01",
  "title": "Paulina siempre soñó con tener un programa de cocina... ¡Pero nunca con ser cocinera!\nEstás en: Inicio > Recetas > Dulces y postres > Mug Cake de Chocolate: ¡torta en 3 minutos!\nMug Cake de Chocolate: ¡torta en 3 minutos!",
  "image": "http://www.paulinacocina.net/wp-content/uploads/2015/06/mug-cake-de-chocolate-PLAY.jpg",
  "href": "http://www.paulinacocina.net/mug-cake-de-chocolate/7469",
  "extension": "Chrome",
  "firstAdded": "2015-06-19T19:09:10.081000",
  "users": [
    null
  ],
  "keywords": [
    "ngredientes",
    "para",
    "mug",
    "cake",
    "chocolate",
    "cdas",
    "rasas",
    "leudante",
    "tambin",
    "puede",
    "ser",
    "harina",
    "comn",
    "cdita",
    "polvo",
    "hornear",
    "azcar",
    "cacao",
    "bueno",
    "amargo",
    "tens",
    "del",
    "otro",
    "leche",
    "aceite",
    "neutro",
    "maz",
    "girasol",
    "huevo",
    "impalpable",
    "decorar"
  ],
  "directions": [
    "0",
    "s sencillo, imposible",
    "1. Mezclar en la taza directamente todos los ingredientes secos, con un tenedor: la harina, el cacao y el azúcar. Unir bien.",
    "2. Agregar el huevo y batir bien, raspando los bordes para asegurarnos que no quede harina pegada. Batir hasta que no quede ningún grumo.",
    "3. Incorporar los líquidos: la leche y el aceite. Mezclar bien. La mezcla para el mug cake de chocolate no debe quedar muy líquida, podría salirse, ensuciarte todo el microondas y acabarías llorando en la panadería. Si es necesario, le agregás un poquito más de harina.",
    "4. Llevar a microondas: colocar en el borde de la bandeja giratoria (si la hay), no en el centro. Como te explico en el video, cada microondas es un mundo, de modo que habrá que probar con el tuyo. No estaría mal que te hagas a la idea de que este primer mug cake de chocolate te va a salir feito de forma… aunque comible. Mis tiempos son: 2 minutos a potencia máxima y 1 minuto y medio a potencia media. Empezá probando con 1 minuto y medio a potencia máxima y luego andá experimentando.",
    "5. Sacar y espolvorear con azúcar impalpable. Comer calentito, que es cuando mejor está la masa. Y con un poco de helado de crema… ¡Viva el mug cake de chocolate!"
  ],
  "ingredients": [
    "0",
    "ngredientes",
    "para 1 mug cake de chocolate",
    "4 cdas. rasas de harina leudante (también puede ser harina común + 1/2 cdita. de polvo para hornear)",
    "4 cdas. rasas de azúcar",
    "2 cdas. de cacao en polvo (del bueno, el amargo… y si no tenés, del otro…)",
    "2 cdas. de leche",
    "2 cdas. de aceite neutro (de maíz o girasol)",
    "1 huevo",
    "Azúcar impalpable para decorar"
  ],
  "__v": 1
}