{
  "hash": "7e00f0ca8943948694ec9bbc86bb7dd5a9eb3467",
  "title": "Asian Beef with Mushrooms & Snow Peas",
  "image": "https://farm3.staticflickr.com/2950/15393701622_200de99ab0_c.jpg",
  "href": "http://juliasalbum.com/2014/09/asian-beef-with-snow-peas/",
  "firstAdded": "2015-01-03T17:15:36.967000",
  "users": [
    null
  ],
  "keywords": [
    "tamari",
    "lowsodium",
    "soy",
    "brown",
    "sugar",
    "garlic",
    "ginger",
    "rice",
    "vinegar",
    "snow",
    "peas",
    "olive",
    "oil",
    "mushrooms",
    "beef",
    "sirloin",
    "strips",
    "flank",
    "steak"
  ],
  "directions": [
    "0",
    "Combine all the sauce ingredients in a bowl - whisk to combine. Set aside.",
    "Bring water in a medium pan to boil. Add snow peas, boil them for 5 minutes, drain. Set aside.",
    "Heat a large skillet until hot, add 2 tablespoons olive oil - it should sizzle. Immediately add thinly sliced mushrooms - cook them on high heat, turning occasionally, until they brown nicely. Salt them midway, a little bit (not too much salt, as you will be adding tamari sauce later). Remove mushrooms to a bowl.",
    "To the same skillet, on high heat, add 2 tablespoons of olive oil, which will sizzle right away. Immediately add thinly sliced meat. You might want to do this in 2 batches, because you will want each slice of meat to touch the bottom of the skillet and for meat slices not to be crowded. This will ensure that meat will brown on high heat. Cook meat on one side until it browns nicely. Turn over all meat slices to the opposite side, and cook more, on high heat, until all slices brown nicely. Remove this batch to a bowl. Add a second batch of meat, and repeat.",
    "Return all of the cooked meat back to the skillet. Add the snow peas and cooked mushrooms, then the sauce. On high heat - stir everything to combine, for about 1 minute. Turn off heat. Cover the skillet with a lid.",
    "Serve over rice."
  ],
  "ingredients": [
    "0",
    "1/2 cup tamari (or low-sodium soy sauce)",
    "5 tablespoons brown sugar",
    "6 garlic cloves, minced",
    "1/2 teaspoon ginger",
    "2 teaspoons rice vinegar",
    "10 oz snow peas",
    "4 tablespoons olive oil",
    "10 oz mushrooms, sliced thinly",
    "1 pound beef, thinly sliced (sirloin steak strips, flank steak, or any other steak)",
    "2 cups cooked rice"
  ],
  "__v": 1
}