{
  "__v": 1,
  "directions": [
    "0",
    "Whisk the flour, granulated sugar, baking powder and salt in a large bowl. Whisk the eggs in a medium bowl until frothy; add the buttermilk, mashed banana, 4 tablespoons of the butter and vanilla and stir to combine. Stir the wet mixture into the dry until just combined, taking care not to over mix. Cover with plastic wrap and let the mixture rest for 10 minutes.",
    "Preheat a waffle iron to medium-high. Preheat the oven to 200°F. Brush the inside of the iron evenly with some of the remaining butter. Pour in enough batter to lightly cover the surface of the iron, about 1/3 to 3/4 cup, depending on the size of the iron. (Take into consideration that the batter will spread once the lid is closed.) Cook until the waffles are crisp and golden, 5 to 7 minutes. Repeat with the remaining butter and batter, keeping the cooked waffles warm in the oven until ready to serve.",
    "Whisk the cream and confectioner's sugar in a medium bowl until soft peaks form. Slice the remaining banana if using. Serve the waffles topped with the whipped cream, banana slices and walnuts and drizzled with maple syrup.",
    "Copyright 2013 Television Food Network, G.P. All rights reserved.",
    "From Food Network Kitchen"
  ],
  "firstAdded": "2014-11-13T19:57:02.349000",
  "hash": "de6ecddb32f858718d775efcd0b1701766a0b2b9",
  "href": "http://www.foodnetwork.com/recipes/food-network-kitchens/banana-buttermilk-waffles.html",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2013/11/25/0/RX-KOHLS_MRB-Banana-Buttermilk-Waffles_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "ingredients": [
    "0",
    "2 cups all-purpose flour",
    "3 tablespoons granulated sugar",
    "2 teaspoons baking powder",
    "¼ teaspoon fine salt",
    "2 large eggs",
    "1 ¾ cups buttermilk, at room temperature",
    "1 very ripe banana, mashed, plus 1 banana, for serving (optional)",
    "4 tablespoons unsalted butter, melted and cooled, plus more for the waffle iron",
    "1 teaspoon pure vanilla extract",
    "½ cup heavy cream, very cold",
    "2 tablespoons confectioners' sugar",
    "½ cup toasted walnuts, broken into small pieces",
    "Maple syrup, for serving"
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "granulated",
    "sugar",
    "baking",
    "salt",
    "eggs",
    "buttermilk",
    "room",
    "mashed",
    "banana",
    "unsalted",
    "butter",
    "cooled",
    "waffle",
    "iron",
    "vanilla",
    "cream",
    "cold",
    "confectioners",
    "walnuts",
    "broken",
    "pieces",
    "maple",
    "syrup"
  ],
  "title": "Banana Buttermilk Waffles",
  "users": [
    null
  ]
}