{
  "hash": "c374e3b9e5b03cd3fc08095c68974cc3f684b8bc",
  "title": "GARDEN VEGETABLE LASAGNA SOUP",
  "image": "https://www.budgetbytes.com/wp-content/uploads/2016/04/Garden-Vegetable-Lasagna-Soup-spoon-1-380x380.jpg",
  "href": "https://www.budgetbytes.com/2016/04/garden-vegetable-lasagna-soup/",
  "extension": "",
  "firstAdded": "2018-05-02T22:46:26.624000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Dice the onion and mince the garlic. Add both to a large soup pot along with the olive oil. Sauté over medium heat until the onions are soft and transparent (about 3-5 minutes).",
    "While the onions and garlic are sautéing, peel and slice the carrots. Slice the zucchini and then cut the slices into quarter rounds. Add the carrots and zucchini to the pot and sauté for about 2 minutes more, or just until the zucchini begin to soften.",
    "Add the diced tomatoes (with juices), tomato sauce, Italian seasoning blend, and vegetable broth to the soup pot. Stir to combine. Place a lid on the pot, turn the heat up to medium-high, and bring the pot to a boil.",
    "While waiting for the pot to boil, break the lasagna noodles into 1-inch pieces. Once the soup is boiling, add the broken lasagna noodles and continue to boil for 10-12 minutes, or until the noodles are tender.",
    "While the pasta is boiling in the soup, combine the ricotta cheese, 1/2 cup shredded mozzarella, Parmesan, salt, and freshly cracked pepper in a bowl (save the other half of the mozzarella for topping the soup bowls). Stir until the cheeses and seasonings are well combined.",
    "Once the pasta is tender, add the frozen spinach and stir until the spinach is thawed and mixed well into the soup.",
    "To serve, place a dollop of the cheese blend in each bowl, then ladle the hot soup over top. Add a pinch of the remaining shredded mozzarella on top."
  ],
  "ingredients": [
    "0",
    "1 Tbsp olive oil $0.16",
    "1 yellow onion $0.40",
    "4 cloves garlic $0.32",
    "2 carrots $0.24",
    "1 zucchini (1/2 lb.) $0.77",
    "15 oz can diced tomatoes $0.65",
    "15 oz can tomato sauce $0.70",
    "1 Tbsp Italian seasoning blend $0.30",
    "4 cups vegetable broth* $0.52",
    "8 oz lasagna noodles $0.95",
    "1/4 lb frozen spinach $0.40"
  ],
  "__v": 1
}