{
  "hash": "fd77e26c3cb9e949e02385270b0c1e895f6501c9",
  "title": "Peanut Butter Chocolate Chip Shortbread Cookies",
  "image": "http://cf.theviewfromgreatisland.com/wp-content/uploads/2012/03/Peanut-Butter-Chocolate-Chip-Shortbread-Cookies-31.jpg",
  "href": "http://theviewfromgreatisland.com/peanut-butter-chocolate-chip-shortbread-cookies/",
  "extension": "Chrome",
  "firstAdded": "2015-12-09T15:44:31.218000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "butter",
    "room",
    "important",
    "creamy",
    "peanut",
    "jif",
    "vanilla",
    "purpose",
    "flour",
    "confectioners",
    "sugar",
    "scant",
    "salt",
    "milk",
    "chocolate",
    "chips"
  ],
  "directions": [
    "0",
    "Cream the butter and the peanut butter together in a stand mixer, with a hand mixer, or a wooden spoon. Make sure to get the butter and peanut butter completely combined and creamy. Beat in the vanilla.",
    "Whisk the dry ingredients together and add to the butter mixture. Mix until the dough comes together and is no longer crumbly.",
    "Stir in the chips, and turn the dough out onto a piece of waxed paper. Gently pull the dough together and form it into a log. If it is still crumbly, work it with your hands until it holds together smoothly. Roll it up in the paper, smoothing the shape as you go. Twist the ends securely and refrigerate for at least a couple of hours. The log will be about 71/2--8 inches long.",
    "While the dough is chilling, pre-heat the oven to 350F",
    "Slice the log into slices with a sharp knife. Not too thick, not too thin, about 1/3 inch. If a slice crumbles a bit, just smoosh the dough back together. These don't have to be perfect disks.",
    "Bake on a parchment or silpat lined baking sheet at 350F for about 12-14 minutes, depending on how thick your cookies are. The cookies will not be browned, and they may look undone, but don't over bake. One of the joys of shortbread cookies is that they fall apart and melt in your mouth.",
    "Let the cookies cool on the pan for 5 minutes before transferring to a rack."
  ],
  "ingredients": [
    "0",
    "1 stick, (1/2 cup, 4 ounces) unsalted butter, at room temperature (important!)",
    "1/3 cup creamy peanut butter (I like Jif)",
    "1/2 tsp vanilla extract",
    "1 1/4 cup (156 grams) all purpose flour",
    "1/4 cup (31 grams) confectioner’s sugar",
    "scant 1/2 tsp sea salt",
    "3/4 cup milk chocolate chips"
  ],
  "__v": 1
}