{
  "hash": "cd2eb50480c448d879c6e90bd72301c907894a11",
  "title": "Hot and Numbing Sichuan Chicken Salad (Bang Bang Ji Si) Recipe",
  "image": "http://www.seriouseats.com/recipes/assets_c/2015/05/20150525-bang-bang-chicken-sichuan-recipe-18-thumb-1500xauto-423396.jpg",
  "href": "http://www.seriouseats.com/recipes/2015/06/sichuan-chicken-salad-chinese-bang-bang-hot-and-numbing-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-10-18T19:23:12.284000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Season chicken generously with salt and pepper. Place chicken in zipper-lock bags or vacuum bags and add half of garlic, roughly chopped scallions, and all of ginger. Remove air from zipper-lock bags by closing the bags, leaving the last inch of the top un-sealed. Slowly lower into a pot of water, sealing the bag completely just before it fully submerges. If using a vacuum bag, seal according to manufacturer instructions.",
    "If Cooking in a Sous-Vide Precision Cooker: Preheat a sous-vide cooker to 150°F. Add chicken and cook for at least 1 hour and up to 4. Transfer to an ice bath and let chill for 15 minutes.",
    "If Cooking in a Cooler: Heat 2 quarts of water in a large, heavy-bottomed saucepan or Dutch oven over medium-high heat until it registers 155°F on an instant-read thermometer. Transfer to a small cooler, add chicken, and seal cooler. Cook for at least 1 hour and up to 4, topping up with boiling water as necessary to maintain temperature of 150°F. Transfer to an ice bath and let chill for 15 minutes.",
    "While chicken cooks, grind Sichuan peppercorns in a mortar and pestle until a rough powder is formed. Add sugar, remaining 3 cloves garlic, and sesame seeds and pound until a rough paste is formed. Add sesame paste, soy sauce, and vinegar and pound until a smooth paste is formed. Stir in chili oil and sediment. Set dressing aside.",
    "When chicken is cooked, remove from bags and discard garlic, scallions, and ginger. Stir 2 tablespoons of juices from the bag into the dressing. Remove skin and bones from chicken and discard. Shred meat and transfer to a large bowl. Add dressing and sliced scallions. Toss chicken to coat in dressing and adjust seasoning with salt and pepper. Serve immediately, sprinkled with more scallions and sesame seeds and drizzled with additional chili oil if desired."
  ],
  "ingredients": [
    "0",
    "1 3/4 pounds whole bone-in, skin-on split chicken breast halves (2 to 3 breast halves)",
    "Kosher salt and freshly ground black pepper",
    "6 cloves garlic, smashed, divided",
    "6 whole scallions, 2 roughly chopped, 4 thinly sliced at a sharp bias",
    "1 (1-inch) knob peeled fresh ginger, thinly sliced",
    "2 teaspoons toasted whole Sichuan peppercorns",
    "1 tablespoon sugar",
    "2 teaspoons black or plain sesame seeds, plus more for garnish",
    "1 tablespoon sesame paste, preferably Chinese",
    "1 tablespoon soy sauce",
    "4 teaspoons Chinkiang or black vinegar",
    "1/4 cup chili oil with sediment (see note above)"
  ],
  "__v": 1
}