{
  "hash": "cb4afdf2a0364b38b9a3e1aca194e49841807cf6",
  "title": "Moroccan Chickpea Barley Salad",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2010/08/moroccan-chickpea-barley-salad-horiz-a2-1800.jpg",
  "href": "https://www.simplyrecipes.com/recipes/moroccan_chickpea_barley_salad/",
  "extension": "",
  "firstAdded": "2018-01-27T22:55:43.597000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Cook the barley: Heat 2 tablespoons of olive oil in a large pot on medium high heat. Add the barley and sauté for 3-4 minutes, stirring often.",
    "Add the broth, water, and a teaspoon of salt. Bring to a simmer and simmer until the barley is tender, anywhere from 30 minutes to an hour, depending on how old the barley is.",
    "2 Strain the barley, toss with olive oil: Strain the cooked barley through a colander or sieve and run cold water over to cool it quickly. Toss and mix in the colander to strain as much water as you can.",
    "Lay out the barley on a sheet pan and drizzle olive oil over it. Mix to coat well and set aside.",
    "3 Combine salad ingredients: In a large bowl, add the chickpeas, pistachios, apricots, green onions and parsley and mix well.",
    "Add the zest and juice of the lemon and mix again.",
    "Add the barley and mix.",
    "Sprinkle the ras el hanout spice mixture over the barley and mix well. Taste, and add salt if needed.",
    "4 Marinate before serving: Let the salad marinate for an hour or so before serving. If the barley has absorbed all the olive oil, drizzle a little more on right before serving."
  ],
  "ingredients": [
    "0",
    "1 1/2 cups barley",
    "1 1/2 cups chicken or veggie broth (use veg broth for vegan version)",
    "1 1/2 cups water",
    "1 teaspoon salt",
    "Olive oil",
    "1 15-ounce can of chickpeas (garbanzo beans), rinsed and strained",
    "1 cup shelled pistachio nuts",
    "1 cup diced dried apricots",
    "2-3 chopped green onions or scallions",
    "1 cup chopped parsley",
    "Zest and juice of a lemon",
    "1 Tbsp of ras el hanout spice mix*",
    "Salt to taste",
    "1 teaspoon black pepper",
    "1 teaspoon cardamom",
    "1/4 teaspoon cayenne",
    "1/4 teaspoon ginger",
    "1/4 teaspoon nutmeg",
    "1/4 teaspoon cinnamon",
    "1/2 teaspoon turmeric"
  ],
  "__v": 1
}