{
  "hash": "fb65ab146527d5472a42e414c76739460b65bdb0",
  "title": "Mini Strawberry Tart",
  "image": "http://www.byrontalbott.com/wp-content/uploads/2014/10/Screen-Shot-2014-10-22-at-12.24.18-PM.png",
  "href": "http://www.byrontalbott.com/mini-strawberry-tart/",
  "extension": "Chrome",
  "firstAdded": "2016-06-24T01:16:12.839000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Add 1 1/4 cups of all purpose flour to a large mixing bowl along with a 1/4 tsp salt, 1 tsp baking powder, 8 tbsp cold diced butter, and 2 to 3 tbsp cold water. Using a pastry blender or your hands, begin to blend the dough just until the flour starts to develop large dough “flakes”.",
    "Once the majority of the flour and butter are combined into these dough “flakes”, transfer the dough onto a lightly floured surface and roll the dough into a small rectangle. Wrap with plastic film and allow to chill in the fridge for 20 minutes or so.",
    "While the dough is cooling down in the fridge, add 15-20 large strawberries (approx 2 cups cut strawberries) to a large sauté pan that’s on medium heat, then add 2 tbsp vanilla extract (fresh vanilla beans or vanilla paste work as well), 1 cup of Truvia Brown Sugar Blend, and 1/2 cup of water. Cook the strawberries for 20 minutes until they soften and the liquid becomes a thick red syrup. It should generously coat the back of a spoon when dipped. Transfer to a blender or food processor and blend until smooth. Transfer the strawberry filling to the fridge to cool down for 30 minutes.",
    "Pull the chilled flaky dough out of the fridge and and start rolling it out on a floured working surface. I rolled my dough to about 1/8? thickness or so, but feel free to play with the thickness a little if you wanna try something different. If you have a very large rectangle cutter use that for the shape of the dough, but if not, use a ruler to accurately mark the dough to your specific shape. I cut the dough into 3 1/2? x 5? rectangles. Transfer the cut out dough onto a baking tray lined with parchment paper or a silpat. If your dough is too soft to work with at this point, put it back into the fridge for a few minutes before moving forward. If the dough is ready then brush a little egg wash (50/50 blend of water and egg yolk) on two (half) of the tart dough cut outs, add 1-2 tbsp of the chilled strawberry filling in the center of the same egg washed cut outs, then gently cover the prepared tart dough with the other rectangle of dough. Crimp the edges with your fingers making sure that there aren’t any holes for the filling to escape from. If the edges are a little rough up after crimping, you can use a pairing knife to even them out. Finish it off by cutting a few steam slits and give it one more brush of egg wash, then put it into a 375f oven for 20 minutes.",
    "In the meantime add 1 cup of Truvia Brown Sugar Blend to a blender and blend on high speed until it becomes powdery. Sift the powdered Truvia Brown Sugar Blend into a medium mixing bowl with 1/2 cup whipped cream cheese, 1 tbsp cornstarch, 1 tbsp whole milk, and 1 tbsp vanilla extract. Mix until very smooth, then transfer to a pastry bag and set aside until it’s time to use.",
    "After the mini tarts are done baking and have a wonderful light golden brown color, pull them out of the oven and allow to cool for 15-20 minutes before frosting.",
    "Once they’re cooled down, generously cover the the tarts with the frosting and enjoy!"
  ],
  "ingredients": [
    "0",
    "FLAKY DOUGH:",
    "1 1/4 cups all purpose flour",
    "1/4 tsp salt",
    "1 tsp baking powder",
    "8 tbsp cold diced unsalted butter",
    "2 tbsp cold water",
    "STRAWBERRY FILLING:",
    "15-20 large strawberries (approx 2 cups cut strawberries)",
    "1 cup Truvia Brown Sugar Blend",
    "1/2 cup water",
    "2 tbsp vanilla extract",
    "FROSTING:",
    "1 cup Truvia Brown Sugar Blend",
    "1/2 cup whipped cream cheese",
    "1 tbsp cornstarch",
    "1 tbsp vanilla extract"
  ],
  "__v": 1
}