{
  "hash": "6f78273b8bba66f0e5a292ed9397452f73ac6eab",
  "title": "Seppie con piselli",
  "image": "http://www.giallozafferano.it/images/ricette/178/17883/foto_hd/hd450x300.jpg",
  "href": "http://ricette.giallozafferano.it/Seppie-con-piselli.html",
  "extension": "Chrome",
  "firstAdded": "2018-01-15T12:57:28.781000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Per realizzare le seppie con piselli come prima cosa realizzate il brodo vegetale. Una volta filtrato mantenetelo in caldo; poi mondate la cipolla e tritatela con il coltello (1). Ora prendete le vostre seppie già pulite (se non lo fossero potete seguire le nostre indicazioni che trovate nella scheda come pulire le seppie). Staccate i tentacoli (2), eliminate l'occhio e riduceteli a pezzetti (3).",
    "Tagliate a striscioline piuttosto larghe il mantello (4). Scaldate l’olio di oliva in un tegame ampio, versate il trito di cipolla (5) e fate stufare a fuoco medio per circa 10 minuti, aggiungendo al bisogno del brodo vegetale caldo (6) così da evitare di far asciugare troppo la cipolla.",
    "Quando la cipolla risulterà ben morbida e trasparente, versate le seppie (7), salate e pepate. Le seppie potrebbero rilasciare dell’acqua quindi potete alzare la fiamma per asciugarle. Quando avranno perso la loro acqua, sfumate con il vino bianco (8) e lasciate evaporare. Aggiungete infine i piselli (9),",
    "i pomodori pelati precedentemente schiacciati e privati del picciolo (10); aggiungete un mestolo di brodo e proseguite la cottura a fuoco dolce per 15/20 minuti. Intanto lavate, asciugate e tritate anche il prezzemolo (11). Quando le seppie con piselli saranno morbide, spegnete il fuoco, aromatizzate con il prezzemolo fresco e servite subito (12)."
  ],
  "ingredients": [
    "0",
    "Pisellini 500 g Seppie pulite 1 kg Cipolle bianche 1 Olio extravergine d'oliva 4 cucchiai Sale fino q.b. Prezzemolo q.b. Brodo vegetale q.b. Pomodori pelati 500 g Vino bianco 50 g Pepe nero q.b."
  ],
  "__v": 1
}