{
  "hash": "6fd41f2febb030acdc059cfb3c6ae8591eff3f10",
  "title": "Steamed Scallion Buns - Hua Juan",
  "image": "https://chinasichuanfood.com/wp-content/uploads/2016/06/Steamed-scallion-buns-steps-11.jpg",
  "href": "https://www.chinasichuanfood.com/steamed-scallion-buns-hua-juan/",
  "extension": "Chrome",
  "firstAdded": "2018-08-25T23:32:16.226000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "In a large bowl or in a stand-mixer bowl, add flour, instead yeast, water and salt. Grasp all the ingredients together and then knead the flour into smooth and soft dough. At the very beginning, it might be a little bit sticky. Just keep kneading and you will get cute dough (or you can simply use a stand mixer to knead the dough for 7-8 minutes with slow speed)",
    "Cover the bowl and let the dough rest for around 1 hour (the time might be longer in winter )or until the paste ball doubles in size.",
    "When the dough is double in size, get paste ball out and punch the air out. And then divide the dough into two equal halves.",
    "Assembling",
    "Firstly roll one half of the dough into a large rectangle on a slightly floured surface. Then brush oil evenly, sprinkle salt and Chinese five spice powder and then dump the scallions across the surface. Roll it up tight and divide it into 10 equal portions.",
    "Get two portions and overlay one piece right on the top of the other one. Take a chopstick and press down in the middle. Remove the chopstick and grip the two ends in two hands and then fold the two ends together downside.",
    "Place them in lined steamer and set aside for 15-20 minutes. Steam over high fire for 15 minutes after the water boils, then turn off fire and rest for 5 minutes with lid on.",
    "How to keep",
    "Let the steamed buns to cool down and then keep them in plastic bags. These buns can be frozen and steam to heat again before serving."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "300g all-purpose flour",
    "3g salt",
    "150-170ml water (adjust the softness)",
    "1 and ½ teaspoon instead yeast",
    "1 cup finely chopped scallion",
    "oil for brushing",
    "salt for sprinkling",
    "Chinese five spice powder (op"
  ],
  "__v": 1
}