{
  "hash": "4174e084dc6e5a71b198f8c7caca121a0a760156",
  "title": "Mexican Risotto with Sweet Corn and Cotija Cheese",
  "image": "https://www.bowlofdelicious.com/wp-content/uploads/2015/07/Mexican-Risotto-with-Sweet-Corn-and-Cotija-Cheese-1-150x150.jpg?is-pending-load=1",
  "href": "https://www.bowlofdelicious.com/mexican-risotto-with-sweet-corn-and-cotija-cheese-made-with-brown-rice/",
  "extension": "Chrome",
  "firstAdded": "2020-03-27T14:41:07.069000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Simmer chicken stock on low to warm up in a small pot on the stovetop.",
    "In a large pot or dutch oven, sauté the onion, red bell pepper, and jalapeño pepper in the olive oil over medium-high heat until browned and softened (about 5 minutes).",
    "Add the rice, salt and pepper, and cayenne pepper. Stir to coat.",
    "Add 1/2 cup of the stock, stir, and allow all of the liquid to be absorbed.",
    "Once the liquid is absorbed, add 1/2 cup more of the stock. Keep repeating this process until the rice is almost cooked through (You'll need to taste-test this a lot. Tough life, I know).",
    "When the rice is almost cooked, add the sweet corn kernels and continue as you were with adding the stock gradually.",
    "When the rice is completely cooked, turn off the heat and stir in the cilantro and cheese until completely melted.",
    "Serve with extra cilantro and cheese, if desired."
  ],
  "ingredients": [
    "0",
    "1 cup brown rice",
    "3-4 cups chicken stock/broth or vegetable broth",
    "2 tablespoons extra-virgin olive oil",
    "1 medium yellow onion diced",
    "1 small or 1/2 large red bell pepper diced",
    "1 jalapeño pepper seeded and diced (leave seeds in for extra spicy risotto)",
    "kosher salt to taste",
    "black pepper to taste",
    "1/8-1/4 teaspoon cayenne pepper depending on how spicy you want it",
    "2 ears fresh sweet corn kernels removed (or 2 cups frozen corn)",
    "1/4 cup fresh cilantro chopped, plus more for garnish",
    "1 cup cotija cheese crumbled, plus more for garnish"
  ],
  "__v": 1
}