{
  "hash": "4cc96c5a14473e000236280764dffe3e8b9b3924",
  "title": "MASSAMAN BEEF CURRY",
  "image": "http://skinnymixers.com.au/wp-content/uploads/2015/01/skinnymixers-Massaman-Beef-Curry2-300x200.jpg",
  "href": "http://skinnymixers.com.au/skinnymixers-massaman/",
  "extension": "Chrome",
  "firstAdded": "2018-11-28T07:09:02.829000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Paste directions",
    "Preheat oven to 180°C or 350°F. Add chillies, lemongrass, unpeeled garlic cloves and shallots onto a baking tray. Bake 10 min or until garlic and shallots are soft. Peel when finished.",
    "Meanwhile, add whole cloves, cardamom pods, cinnamon stick, cumin seeds,coriander seeds and mace to mixer bowl. Dry fry 5 min/100°C or 212°F/speed 1/MC off.",
    "Mill 1 min/speed 8/MC on.",
    "Add oil, roasted garlic, chilli, shallots, lemongrass, coriander roots and stems, galangal, lime leaves and salt. Pulverise for 30 sec/speed 9/MC on. Scrape bowl down, add 30 g or 1 oz water and repeat only the pulverising (not the water content) 30 sec/speed 7/MC on twice.",
    "Remove to a sterilised jar or portion into 60 g or 2.1 oz lots",
    "Curry directions",
    "Without washing the bowl from making the curry paste, add dates and tamarind to mixer bowl. Chop 2 sec/speed 9/MC on. Scrape bowl down and repeat once.",
    "Add onion to mixer bowl. Chop 3 sec/speed 6/MC on. Scrape bowl down.",
    "Add massaman curry paste and 100 g or 3.5 oz coconut cream to mixer bowl. Cook 5 min/100°C or 212°F/speed 2/MC off.",
    "Add beef, remaining coconut cream, kaffir lime leaves, lemongrass, vegetable stock concentrate, cinnamon stick, bay leaf, cardamom pods and fish sauce to mixer bowl. Cook 60 min/100°C or 212°F/slowest speed/reverse/MC on.",
    "Check seasoning and adjust to taste. Cook 20 min/100°C or 212°F/slowest speed/reverse/MC off.",
    "Add potato to mixer bowl. Cook 20 min/100°C or 212°F/slowest speed/reverse/MC off. Tip: Put simmering basket on top of the mixer to avoid food splatter!",
    "Remove whole spices, stir through thai basil leaves and garnish with a few strands of thinly sliced kaffir lime leaves and peanuts."
  ],
  "ingredients": [
    "0",
    "5 long red chillis, deseeded and chopped roughly",
    "2 stalk lemongrass (white only, around 8 cm or 3\" each), chopped roughly",
    "7 cloves garlic, unpeeled",
    "5 shallots, unpeeled and halved (small brown ones)",
    "2 whole cloves",
    "5 whole green cardamom pods",
    "½ stick cinnamon (or ¼ tsp ground cinnamon)",
    "1 tsp cumin seeds",
    "1 tbsp coriander seeds",
    "1 pinch mace (or nutmeg)",
    "80 g | 2.8 oz oil of choice",
    "5 coriander roots and stems",
    "20 g | 0.7 oz fresh galangal, sliced into coins (or ginger)",
    "2 whole kaffir lime leaves",
    "½ tsp salt"
  ],
  "__v": 1
}