{
  "hash": "bba05cf55cd8de6d933db8b37984705de26fe48f",
  "title": "Bergamot Madeleines",
  "image": "http://chezpim.typepad.com/.a/6a00d83451bc0669e2012876fbd24e970c-800wi",
  "href": "http://chezpim.com/bake/bergamot-madeleines",
  "firstAdded": "2015-01-15T09:19:40.952000",
  "users": [
    null
  ],
  "keywords": [
    "eggs",
    "sugar",
    "bergamot",
    "syrup",
    "make",
    "zest",
    "minus",
    "flour",
    "baking",
    "cooled",
    "room",
    "use",
    "salted",
    "butter",
    "generous",
    "salt",
    "unsalted",
    "youll",
    "need",
    "tabelspoons",
    "soften",
    "tin"
  ],
  "directions": [
    "0",
    "In a small pan, cook bergamot juice and sugar over very low heat until syrupy and reduced by about 1/3, but don’t allow it to caramelize too much. Allow to cool completely before use. (Zest the bergamot before juicing and set aside for use in the recipe.)",
    "In a stand mixer, beat egg and sugar until pale and fluffy. Add the bergamot syrup and the zest and beat well to combine.",
    "Sift the flour and baking powder together. With the mixer speed on the lowest setting, fold in the dry ingredient gently. Remove the mixing bowl from the stand mixer and finish folding the rest of the flour into the batter by hand (with a rubber spatula).",
    "Pour the butter into the batter. With the spatula, fold it in into the batter gently. Cut a piece of plastic wrap and press it directly on top of the batter to cover it completely to prevent a skin from forming. Cover the entire batter bowl and refrigerate for a few hours (or overnight) before use. Or instead of wraping the bowl, you can transfer the batter into a pastry bag and refrigerate the whole bag. This is what I do, and then you can pipe the batter right into the mold directly from the bag. Quite handy, really.",
    "The rest period is important to ensure the classic madeleine bump – the batter must rest at least a couple of hours until it is cold, cold before use, the longer the better, up to a day ahead of baking.",
    "If you’re making this for a party, you can make the batter up to a day ahead of time and let it rest in the fridge. Butter and flour the madeleine tin beforehand and keep it somewhere cold – the fridge is good if you have room. Make sure your oven is heated up to the right temperature, and just before it’s time for dessert, pipe the madeleine batter into the mold and bake them to order – it only takes 10 minutes. You’ll have crisp, fragrant madeleines that will both surprise and delight your guests.",
    "Preheat the oven to 450F. Butter and flour tin madeleine mold. Use soften butter and not melted butter for this. Use a pastry brush (or crumple up a slightly damp towel) to brush the butter in each cavity, make sure you get into all the nooks and edges. Sift the flour over the buttered tin, shake it to distribute evenly, then flip the tin over and tap out the excess flour.",
    "Pipe",
    "or spoon the batter into the pan (about 1.5″ round). Don’t over fill the molds as your madeleines won’t bump up nicely – so err on the side of underfill. This amount of",
    "batter is easily enough for 36 madeleines. Bake for 6 minutes, then lower the heat to 400, crack open the oven door – stick a wooden spoon",
    "in it if it doesn’t stay open on its own, and continue to bake for 2-4",
    "minutes. Keep your eye on this, some ovens don’t lower the heat that",
    "quickly, and your madeleines may be done in just two minutes. Remove",
    "them from the oven as soon as the edges are brown and the top springs",
    "back slightly when touched.",
    "Let the tin rest on the countertop for a minute, then give a gentle tap on the counter, your madeleines should pop right out of the mold. They are at their best right then and there, so serve (or eat) them immediately if you can. Otherwise, let the madeleines cool down completely on a rack before transfering into an airtight container.",
    "Wipe the tin clean with a damp towel, cool it for a couple minutes",
    "in the freezer, then butter and flour the tin again to bake another batch.",
    "Repeat until you finish all the batter. Or you can just wrap up the batter and keep it in the fridge to bake later. The batter, properly wrapped, will keep for a couple days in the fridge."
  ],
  "ingredients": [
    "0",
    "4 eggs",
    "1/2 cup sugar",
    "1/3 cup bergamot syrup* (make this first)",
    "zest from 1 bergamot",
    "2 cups minus 2 tablespoons flour",
    "1 teaspoon baking powder",
    "1.5 stick(12 tablespoons or 180g) melted butter, cooled to room temperature (I use salted butter, or you can add a generous pinch of salt if all you have is unsalted.)",
    "You’ll also need about 2 Tabelspoons of soften butter and a little flour for the tin."
  ],
  "__v": 1
}