{
  "hash": "e89fcba8cc4b486d8ce35c54b51923c4ac9465fa",
  "title": "ROASTED TOMATOES",
  "image": "http://www.thebittenword.com/.a/6a00e55015ee52883301b8d13dc3be970c-650wi",
  "href": "http://www.thebittenword.com/thebittenword/2015/07/the-best-way-to-roast-tomatoes-roasted-tomatoes.html",
  "extension": "Chrome",
  "firstAdded": "2015-07-28T14:18:10.765000",
  "users": [
    null
  ],
  "keywords": [
    "makes",
    "cooks",
    "illustrated",
    "avoid",
    "using",
    "diameter",
    "smaller",
    "ratio",
    "flavorful",
    "jelly",
    "skin",
    "larger",
    "tomatoes",
    "double",
    "recipe",
    "use",
    "minutes",
    "rotate",
    "switch",
    "sheets",
    "halfway",
    "baking",
    "step",
    "increase",
    "roasting",
    "time",
    "hours",
    "cored",
    "trimmed",
    "garlic",
    "smashed",
    "oregano",
    "kosher",
    "salt",
    "pepper",
    "extravirgin",
    "olive",
    "oil"
  ],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "1. Adjust oven rack to middle position and heat oven to 425 degrees. Line rimmed baking sheet with aluminum foil. Arrange tomatoes in even layer on prepared sheet, with larger slices around edge and smaller slices in center. Place garlic cloves between tomatoes. Sprinkle with oregano and 1/4 teaspoon salt and season with pepper to taste. Drizzle oil evenly over tomatoes.",
    "2. Bake for 30 minutes, rotating sheet halfway through baking. Remove sheet from oven. Reduce oven temperature to 300 degrees and prop open door with wooden spoon to cool oven. Using thin spatula, flip tomatoes.",
    "3. Return tomatoes to oven and continue to cook until spotty brown, skins are blistered, and tomatoes have collapsed to 1/4 to 1/2 inch thick, 1 to 2 hours. Remove from oven and let cool completely, about 30 minutes. Discard garlic and transfer tomatoes and oil to airtight container. (Tomatoes can be refrigerated for up to 5 days or frozen for up to 2 months.)",
    "GREAT USES FOR ROASTED TOMATOES",
    "Savory-sweet roasted tomatoes can punch up countless dishes:",
    "TOPPINGS: Sandwiches, crostini, pizza, polenta, scrambled eggs",
    "MIX-INS: Frittata, quiche, pasta, deli salads, bread dough",
    "DRESSING: During roasting, the oil picks up concentrated flavor that makes it great for whisking into salad dressings; drizzling over meat, fish, vegetables, or pasta; or usin"
  ],
  "ingredients": [
    "0",
    "MAKES 1 1/2 CUPS",
    "Note from Cook's Illustrated: Avoid using tomatoes smaller than 3 inches in diameter, which have a smaller ratio of flavorful jelly to skin than larger tomatoes. To double the recipe, use two baking sheets, increase the baking time in step 2 to 40 minutes, and rotate and switch the sheets halfway through baking. In step 3, increase the roasting time to 1 1/2 to 2 1/2 hours.",
    "INGREDIENTS",
    "3 pounds large tomatoes, cored, bottom 1/8 inch trimmed, and sliced 3/4 inch thick",
    "2 garlic cloves, peeled and smashed",
    "1/4 teaspoon dried oregano",
    "Kosher salt and pepper",
    "3/4 cup extra-virgin olive oil"
  ],
  "__v": 1
}