{
  "hash": "150da1503c0a3f286dfd883d869847991153f17e",
  "title": "Plain Vanilla Sponge Cake - Moist and Fluffy",
  "image": "http://kannammacooks.com/wp-content/uploads/Moist-fluffy-best-simple-vanilla-cake-hot-milk-cake-indian-tea-cake-serve.jpg",
  "href": "http://www.kannammacooks.com/easyrecipe-print/1579-0/",
  "extension": "Chrome",
  "firstAdded": "2016-03-31T21:49:36.364000",
  "users": [
    null
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "maida",
    "baking",
    "sugar",
    "eggs",
    "room",
    "butter",
    "milk",
    "vanilla",
    "use",
    "real",
    "kind"
  ],
  "directions": [
    "0",
    "Preheat the oven to 350F/180C.",
    "Line and grease two 8 inch round pans and keep them ready.",
    "Take a large mixing bowl and add the eggs,sugar and vanilla in it. Set the bowl over a pan of simmering water. Heat the eggs,sugar and vanilla until slightly hot, stirring constantly to prevent curdling. Keep stirring untill all the sugar is completely dissolved. Run your fingers in the batter and feel the batter. It should be smooth. If its grainy, stir for some more time. This whole process can take between 3-5 minutes.",
    "Using the whisk beater, beat the mixture on high speed for 5 minutes or until triple in volume. If you are using a hand beater you might need to beat for at least 10 minutes.",
    "Combine flour and baking powder and sift. Add it to the batter. Whisk until smooth.",
    "In a small saucepan, heat milk and melted butter just until the mixture is slightly hot. Add hot milk mixture to the batter. Gently whisk to fold in the batter.",
    "The batter will not be thick. Pour the batter in two 8 inch pans and bake for 40 minutes or until a toothpick inserted in the center comes out clean. Cool on a wire rack."
  ],
  "ingredients": [
    "0",
    "2 and ¼ cup all-purpose flour (maida)",
    "2 and ¼ teaspoon baking powder",
    "2 cups sugar",
    "4 eggs at room temperature",
    "½ cup melted butter",
    "1 and ¼ cup milk",
    "1 teaspoon vanilla extract (use the real kind)"
  ],
  "__v": 1
}