{
  "hash": "f0a44ddf6be3c25682a0e958fceacd7e821f18cc",
  "title": "Very-Veggie Spaghetti Squash",
  "image": "",
  "href": "http://iowagirleats.com/2015/10/16/very-veggie-spaghetti-squash/",
  "extension": "Chrome",
  "firstAdded": "2016-09-27T19:58:28.623000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "Preheat oven to 400 degrees then line a baking sheet with foil, spray with nonstick spray, and then set aside. Pearce spaghetti squash with a sharp knife four or five times across the center then microwave for 2 minutes. Slice in half lengthwise then scoop out seeds and place cut side up on prepared baking sheet. Mist or brush with extra virgin olive oil then season generously with garlic salt, pepper, and Italian Seasoning. Roast for 30-40 minutes, rotating baking sheet halfway through, until a knife inserted into the thickest part of the squash goes in easily. Let cool for 10 minutes or so then use a fork to shred the meat onto a plate and set aside.",
    "Heat extra virgin olive oil in a large skillet over medium heat then add shallots or onions, season with salt and pepper, and then saute until tender, 5-7 minutes. Add garlic then saute for 1 more minute. Add tomatoes then saute until just barely staring to break down, 1-2 minutes. Add baby spinach, season with salt and pepper, then saute until just starting to wilt, 1 minute. Add shredded spaghetti squash, feta cheese, kalamata olives, and basil to skillet then toss to combine and serve."
  ],
  "ingredients": [
    "0",
    "SERVES 2",
    "1 medium-sized spaghetti squash",
    "Italian seasoning",
    "garlic salt and pepper",
    "1 Tablespoon extra virgin olive oil, plus extra for brushing",
    "1 large shallot or 1/2 small onion, chopped",
    "3 cloves garlic, minced",
    "2 vine-ripened tomatoes, seeded then chopped",
    "2 cups baby spinach, roughly chopped",
    "1/2 cup crumbled feta cheese",
    "1/4 cup pitted kalamata olives, sliced",
    "1/4 cup lightly packed fresh basil, chopped"
  ],
  "__v": 1
}