{
  "hash": "18cf9de21546e42fc222b327a652c30cce8f918a",
  "title": "Guinness Lamb Stew with Vegetables",
  "image": "http://www.onceuponachef.com/images/2012/03/guinness-lamb-stew-575x470.jpg",
  "href": "http://www.onceuponachef.com/2012/03/guinness-lamb-stew-with-vegetables.html",
  "extension": "Chrome",
  "firstAdded": "2016-01-11T00:04:14.715000",
  "users": [
    null
  ],
  "keywords": [
    "lamb",
    "shoulder",
    "welltrimmed",
    "pieces",
    "salt",
    "black",
    "pepper",
    "olive",
    "oil",
    "medium",
    "yellow",
    "onions",
    "chunks",
    "garlic",
    "smashed",
    "tomato",
    "allpurpose",
    "flour",
    "guinness",
    "beef",
    "broth",
    "water",
    "cooking",
    "bay",
    "leaf",
    "sprig",
    "rosemary",
    "sugar",
    "carrots",
    "diagonal",
    "white",
    "boiling",
    "potatoes",
    "baby",
    "yukons",
    "frozen",
    "green",
    "peas"
  ],
  "directions": [
    "0",
    "Pat the lamb dry and season with salt and pepper. In a large Dutch oven or heavy pot, heat one tablespoon of oil over medium-high heat until hot and shimmering. Brown the lamb in three batches, adding one more tablespoon of oil for each batch. Do not crowd the pan and let the meat develop a brown crust before turning with tongs. It should take 5-8 minutes per batch. Transfer the browned meat to large bowl and set aside.",
    "Add the onions, garlic and 2 tablespoons of water to the pot. Cook until the onions are soft, stirring with a wooden spoon to scrape any brown bits from the bottom of pan, about 5 minutes.",
    "Stir in the tomato paste and cook a few minutes more.",
    "Add the lamb with its juices back to the pan and sprinkle with flour. Stir with a wooden spoon until the flour is dissolved, 1-2 minutes.",
    "Add the Guinness, beef broth, water, bay leaf, rosemary sprig and sugar. Stir with a wooden spoon to loosen any brown bits from the bottom of the pan and bring to a boil. Cover the pot with a lid, turn the heat down to low and simmer for one hour and twenty minutes.",
    "Add the carrots and potatoes to the stew, then cover and continue simmering until the vegetables are cooked and the meat is very tender, 30-40 minutes. (Be sure to stir a few times to prevent vegetables from sticking to bottom.)",
    "Remove the bay leaf and rosemary sprig, and then taste and adjust seasoning if necessary. If serving right away, add the frozen peas and cook until the peas are warmed through. Otherwise, let the stew cool, then cover and store in the refrigerator until ready to serve. Reheat gently on the stovetop and add the peas right before serving."
  ],
  "ingredients": [
    "0",
    "3 pounds lamb shoulder, well-trimmed and cut into 1-1/2-inch pieces",
    "2 teaspoons salt",
    "1 teaspoon freshly ground black pepper",
    "3 tablespoons vegetable or olive oil",
    "2 medium yellow onions, cut into 1/2-inch chunks",
    "6 cloves garlic, peeled and smashed",
    "3 tablespoons tomato paste",
    "1/4 cup all-purpose flour",
    "1 cup Guinness",
    "3 cups beef broth",
    "2 cups water, plus 2 tablespoons more for cooking onions and garlic",
    "1 bay leaf",
    "1 small sprig fresh rosemary",
    "2 teaspoons sugar",
    "4 large carrots, peeled and cut into 1-inch chunks on diagonal",
    "1 pound small white boiling potatoes (baby yukons), cut in half",
    "1 cup frozen green peas"
  ],
  "__v": 1
}