{
  "hash": "6f3bb332a85ecb0fbaec53fa9fc96a206ba41e78",
  "title": "Gulyásleves (Authentic Hungarian Goulash)",
  "image": "http://1.bp.blogspot.com/-BkdUQMz1mYc/VmtgK7ugOKI/AAAAAAAAAGE/SAbEU7PQfvg/s400/goulash.jpg",
  "href": "http://www.hearthritual.com/2015_12_01_archive.html",
  "extension": "",
  "firstAdded": "2015-12-12T09:39:38.059000",
  "users": [
    null
  ],
  "keywords": [
    "beef",
    "stew",
    "chuck",
    "flat",
    "iron",
    "shoulder",
    "onion",
    "rib",
    "celery",
    "tomato",
    "roma",
    "tomatoes",
    "red",
    "bell",
    "pepper",
    "carrot",
    "root",
    "parsnip",
    "russet",
    "potatoes",
    "hungarian",
    "known",
    "regular",
    "paprika",
    "smoked",
    "caraway",
    "seeds",
    "parsley"
  ],
  "directions": [
    "0",
    "Chop all of the vegetables into similar size shapes depending on how large you like your veg in a soup or stew, about 1/2 inch or so. Cut your beef into similar size shapes and season with salt.",
    "Heat a large dutch oven with some oil or bacon fat if you have it, and drop in your diced onion. Cook on medium low heat until the onions are almost clear, 5-10 minutes depending on your heat. Add the beef all at once, then the bell peppers, and give everything a stir; then sprinkle the top with enough paprika to cover the dish. If you have some caraway seeds, use about a teaspoon and add it now also. Cover the dutch oven by adding the lid and let it cook on the stove for about 15 minutes, until the meat looks cooked on the outside.",
    "Raise the heat to medium high before adding the rest of the ingredients. Add the carrots, celery, tomato, parsnip, and celery root. You can add the potatoes now if you would like them to soften in the soup and thicken it, but I like to wait about ten minutes before adding them to keep their shape. Add about 6 cups of water, stir everything together, and wait until you notice a simmer before returning the heat to a low setting. Now is also the time to taste for salt and add it to your taste. Continue to cook on low for about 40 minutes with a gentle simmer, or just until the vegetables cook through.",
    "This dish gets better the longer it sits. If you can, make a day ahead and re-warm for guests for the tastiest flavor. It is not necessary to use celery root or parsnip, you can substitute them for other root vegetables, or double up on the potato. I have used rutabaga instead of celery root many times if I can't find the celery root. The caraway is a traditional addition that is not only tasty, but helps with digestion. The soup has a thin broth that is thickened with the addition of the vegetables, and if the paprika that you are using is fine enough, it acts as a thickener as well; you do not need to add any more thickeners since this is not a \"stew.\" Serve with some good, fresh white bread."
  ],
  "ingredients": [
    "0",
    "2 pounds beef for stew (chuck, flat iron, any shoulder cut)",
    "1 small onion, diced",
    "1 rib of celery",
    "1 small tomato or 2 roma tomatoes",
    "1 or 2 red bell pepper",
    "1 large carrot",
    "1 small celery root",
    "1 parsnip",
    "2 russet potatoes",
    "Hungarian paprika (also known as sweet paprika or regular paprika, NOT smoked)",
    "Caraway seeds if you have them",
    "Parsley for garnish, if you like"
  ],
  "__v": 1
}