{
  "hash": "7f02235a74c240e596c3b836dd92cad25a10b66a",
  "title": "Homemade cookie butter recipe",
  "image": "",
  "href": "http://www.craftsy.com/blog/2015/01/homemade-cookie-butter-recipe/",
  "extension": "Chrome",
  "firstAdded": "2016-08-07T18:55:58.843000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Step 1:",
    "In a food processor or a blender with food processing capabilities, crush the cookies until they become fine crumbs, as if you were going to make a cookie crust with them.",
    "Step 2:",
    "Stop processing and add the brown sugar, cinnamon, nutmeg, vanilla and salt. Give them a mix, and then add the honey (or molasses) and butter. Mix until combined. The mixture will still be slightly coarse, but with each mix it will become creamier.",
    "Step 3:",
    "If using a processor, add the water a little bit at a time with the processor running, until it has reached a creamy consistency. This is really when the mixture will come together into the creamy consistency. If using a blender, add a little water and then mix until incorporated, stopping the blender for each addition. You can grind fully for a very creamy texture, or leave it a little \"crunchy.\" You may not use all of the water. Keep in mind that as the mixture sets it will become more firm.",
    "Step 4:",
    "Because the processor will have warmed the ingredients a bit, the mixture may be a bit warm. It may be pourable. Pour into an airtight container, using a rubber spatula to get any last bits. Store in the refrigerator. The cookie butter will become more firm as it chills."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "16 ounces caramelized biscuit cookies, such as Biscoff (this is about 2 packages of Biscoff cookies)",
    "2 tablespoons packed dark brown sugar",
    "4 teaspoons cinnamon",
    "1/2 teaspoon ground nutmeg",
    "1 teaspoon vanilla extract",
    "Pinch salt",
    "1 tablespoon honey (or molasses)",
    "2 tablespoons melted butter",
    "1 cup water"
  ],
  "__v": 1
}