{
  "hash": "f1f84bb8c7aec805210fe84b2db9d09c816b5d4f",
  "title": "Meatballs with Sweet Vinegar Sauce",
  "image": "http://recipe-folder.com/img/recipe-images/050/7.5/815092750.jpg",
  "href": "http://recipe-folder.com/recipe/5c56f3dc1d4c575ccd825330",
  "extension": "User Added",
  "firstAdded": "2019-02-03T13:59:56.579000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "First, let’s prepare the atsuage, thick deep-fried tofu. Slice off the fried edges. If atsuage is not available, firm tofu can be used instead but make sure to remove the excess water thoroughly before cooking.",
    "Then, chop the edges into fine pieces.",
    "Next, break the tofu into small pieces.",
    "Now, place the lean ground pork in a bowl and add the salt, pepper, sake, soy sauce, grated ginger root and the beaten egg.",
    "Squeeze the mixture to combine all the ingredients.",
    "Then, loosely spread your fingers forming a rake shape with your hand to thoroughly mix the meat until it becomes kind of gooey. This will help to combine other ingredients later.",
    "Now, add the atsuage, chopped long green onion and the potato starch.",
    "Thoroughly mix the meat mixture again.",
    "Then, divide the meat into 10 pieces and place them onto a plate.",
    "Now, let’s make the meatballs. Add the vegetable oil to a pan and turn on the burner. Coat your hands with oil, shape each piece into a ball and quickly place it into the pan.",
    "Using a spatula, brown the meatballs.",
    "In this recipe, we used lean meat to reduce the amount of fat and added the tofu to help make the meatballs tender. You can also use regular ground pork, beef or chicken, and leave out the atsuage or tofu.",
    "When they are golden brown, add 1 tablespoon of water.",
    "Cover and cook the meatballs for 1 to 2 minutes to avoid undercooking the meat.",
    "Remove the lid and allow the remaining water to evaporate.",
    "Then, place the meatballs onto a plate.",
    "SWEET VINEGAR SAUCE. Now, clean the pan with a paper towel. Then, combine the chicken stock, sugar, vinegar, soy sauce and the pepper.",
    "Mix all the ingredients and pour it into the pan. Re-heat the pan and dissolve the sugar. Then, turn off the burner.",
    "Thoroughly stir the diluted potato starch and gradually add it to the sauce. If the heat is too strong, the starch will instantly clump up before it can be distributed.",
    "Heat the pan again. And thoroughly cook the sauce.",
    "Then, add the meatballs and coat them with the sauce.",
    "Now, they are ready.",
    "Place the meatballs onto a plate along with the cherry tomatoes and green leaf lettuce. Pour the remaining sauce over the top."
  ],
  "ingredients": [
    "0",
    "MEATBALLS",
    "150 g\tGround Pork lean meat",
    "1 pinch\tSalt",
    "White Pepper",
    "1 tsp\tSake",
    "1 tsp\tSoy Sauce",
    "5 g\tGrated Ginger Root",
    "1/2\tEgg",
    "70 g\tAtsuage thick deep-fried tofu",
    "20 g\tLong Green Onions (Naganegi) coarsely chopped",
    "1/2 tbsp\tPotato Starch",
    "Vegetable Oil",
    "SWEET VINEGAR SAUCE",
    "60 ml\tChicken Stock 1/4 tsp Chinese-style chicken stock powder, dissolved",
    "1 tbsp\tSugar",
    "2 tsp\tVinegar",
    "2 tsp\tSoy Sauce",
    "White Pepper",
    "1 tsp\tPotato Starch",
    "1 tsp\tWater"
  ],
  "__v": 4,
  "hidden": true
}