{
  "hash": "40752f439a68b510df208689396fb587a78b388b",
  "title": "Oosterse groenteschotel met kip en rijst",
  "image": "http://i0.wp.com/i46.photobucket.com/albums/f104/reny7/DSC05330_zps6bj0vzdy.jpg?resize=702%2C467",
  "href": "http://www.mindyourfeed.nl/recepten/diner/oosterse-groenteschotel-met-kip-en-rijst/",
  "extension": "Chrome",
  "firstAdded": "2016-09-28T20:47:13.579000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Bereiden: Snij de kip in stukjes en doe in een schaaltje. Schenk hier de olie en de vissaus bij en voeg de droge kruiden toe. Pers de knoflook, rasp de gember en voeg toe aan de kipfilet. Goed omscheppen en even laten staan.",
    "Zet een pan met water op voor de rijst.",
    "Snij de groenten: paprika’s, uien, bleekselderij, mag allemaal in reepjes of blokjes, wat je wilt. De prei in ringen snijden en even wassen onder de kraan om het zand weg te spoelen. De komkommer is straks pas aan de beurt, die eten we koud.",
    "Verhit wat olie in de pan en voeg de kip hierbij. Bak de kip rondom mooi bruin en laat nog heel even in de pan om te garen. Was het schaaltje waar de kip in zat even af met wat lauwwarm water en een mild sopje. Schep de kip uit de pan, in je net schone schaaltje. Voeg eventueel nog wat olie toe en voeg nu de groenten toe aan de (zelfde) pan. Schep goed om en laat zachtjes fruiten.",
    "Kookt het water van de rijst, dan doe je de rijst in de pan. Roer af en toe even door.",
    "Schep nu de kip weer bij de groenten. Voeg de kokosmelk, de vissaus, citroensap, honing en wat peper toe en meng met de groenten en kip. Laat zachtjes tegen de kook aan komen, maar de saus hoeft niet te koken. Knip alvast wat verse peterselie. Maak de komkommer schoon en snij in plakken.",
    "Giet de rijst af, en meng met de groenteschotel. Schep alles goed door en voeg als laatste nog wat peterselie toe. Je kunt ook koriander gebruiken, maar dat is hier in huis niet zo favoriet."
  ],
  "ingredients": [
    "0",
    "Voor de kip:",
    "200 gr kipfilet",
    "2 el Japanse vissaus",
    "1 el olijfolie",
    "1 tl paprikapoeder",
    "1 tl komijn",
    "1 teen knoflook",
    "1 cm gember",
    "Groenten:",
    "1 rode paprika",
    "1 gele paprika",
    "2 prei",
    "2 rode uien",
    "4 stengels bleekselderij",
    "1 komkommer",
    "Verder:",
    "150 gr rijst (ik gebruikte een mix van rijst en quinoa)",
    "150 ml kokosmelk",
    "2 el honing",
    "2 el vissaus",
    "1 el citroensap",
    "peper",
    "peterselie (optioneel)",
    "olie om te bakken"
  ],
  "__v": 1
}