{
  "hash": "202bea3f49f6d76718189f0f7ab103359ea02a5b",
  "title": "Lemon-Thyme Croutons",
  "image": "http://prodstatics3cdn1.tastingtable.com/images/articles/2014_03/Lemon_Thyme_Croutons_Recipe_Tim_Dornon_Qui_Austin_Texas_Topping_Recipe_Article_Image.png",
  "href": "http://www.tastingtable.com/entry_detail/chefs_recipes/14380/Lemon_Thyme_Croutons_from_Tim_Dornon_of_Qui_in_Austin.htm",
  "firstAdded": "2015-01-20T19:38:26.760000",
  "users": [
    null
  ],
  "keywords": [
    "lemon",
    "sourdough",
    "loaf",
    "unsalted",
    "butter",
    "salt",
    "black",
    "pepper",
    "thyme",
    "sprigs"
  ],
  "directions": [
    "0",
    "On a cutting board, place the:",
    "Use a vegetable peeler to remove the rind from half of the lemon. Turn the rind strips over and use a paring knife to slice off the white pith from the peel. Add the lemon strips to a small saucepan and cover with cold water. Bring the water to a boil over high heat, then use a slotted spoon to transfer the peel to a small bowl. Discard the water in the saucepan, return the peel to the saucepan, cover with water, and repeat the boiling process twice more.",
    "Transfer the peel to a cutting board and slice it into ⅛-inch-wide strips. Slice it crosswise into small pieces.",
    "2. On a cutting board, place the:",
    "Use a bread knife to remove the crusts, then tear the interior of the loaf into small, bite-size pieces (you should have about 3½ cups). To a nonstick skillet set over medium heat, melt:",
    "Add:",
    "Slowly brown the croutons, stirring often, until the croutons start to become golden, 4 to 5 minutes. Add:",
    "Continue cooking until the croutons are deeply golden and the thyme is fragrant (take care, as the thyme may spatter), 2 to 3 minutes. Transfer the croutons to a paper-towel-lined plate.",
    "Repeat with the remaining bread, butter, salt, pepper, thyme and lemon peel. Serve warm or completely cooled (the croutons are best used within 1 day of making them)."
  ],
  "ingredients": [
    "0",
    "Lemon, 1",
    "Small sourdough loaf, ½",
    "Unsalted butter, 10 tablespoons",
    "Fine sea salt, ½ teaspoon",
    "Freshly ground black pepper, ½ teaspoon",
    "Fresh thyme, 6 sprigs"
  ],
  "__v": 1
}