{
  "hash": "e4945bccccddf2596be90f97e3947552e376567c",
  "title": "Lemon Herb Mediterranean Chicken + Potatoes (One Pot)",
  "image": "https://cafedelites.com/wp-content/uploads/2016/09/One-Pan-Garlic-Lemon-Herb-Mediterranean-Chicken-and-Potatoes-1-1-100x150.jpg",
  "href": "https://cafedelites.com/garlic-lemon-herb-mediterranean-chicken-potatoes/",
  "extension": "Chrome",
  "firstAdded": "2018-02-07T14:22:50.242000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Pat thighs dry with paper towel. In a shallow dish, combine the lemon juice, 2 tablespoon of olive oil, vinegar, garlic, basil, oregano, parsley and salt. Pour out half of the marinade and store in a jug to use later.",
    "Add the chicken to the marinade in the dish and coat evenly. Cover and marinate for 15 minutes if rushed; 1 hour if time allows; or over night, turning each chicken thigh occasionally in the marinade.",
    "Preheat oven to 220°C | 430°F. Heat the remaining 1 tablespoon of olive oil in a large oven-proof pan or skillet over medium-high heat. Sear the chicken on both sides until golden browned (about 4 minutes each side). Drain some of the excess fat, leaving about a tablespoon for added flavour.",
    "Arrange the vegetables around each chicken thigh. Drizzle the vegetables with the remaining marinade, tossing them through the oil mixture to evenly coat.",
    "Cover skillet or dish with lid (or foil), and bake until the potatoes are soft and the chicken is completely cooked through (about 35 minutes). Change oven setting to grill / broil on a medium heat setting; uncover and cook for about 5-10 minutes, or until chicken and potatoes are crispy and golden browned. Serve with olives and lemon slices."
  ],
  "ingredients": [
    "0",
    "You are here: Home / Recipes / Garlic Lemon Herb Mediterranean Chicken + Potatoes (One Pan)",
    "SEPTEMBER 12, 2016 BY KARINA 33 COMMENTS",
    "garlic lemon herb mediterranean chicken + potatoes (one pan)",
    "Share",
    "Tweet",
    "Pin",
    "+1",
    "Stumble",
    "garlic lemon herb mediterranean chicken and potatoes, all made in the one pan for an easy weeknight dinner the whole family will love!",
    "Garlic Lemon Herb Mediterranean Chicken And Potatoes is an easy and healthy recipe for the perfect dinner!",
    "With all of the recipe testing, video making and chaotic hair pulling going on around here, this one pan meal was welcomed with opened arms. There’s nothing easier than throwing ingredients into a pan and letting the oven do the work.",
    "Juicy, crisp chicken infused with lemon, garlic and herbs, baked in the same pan as crispy potatoes, charred peppers (capsicums), zucchini and onion. A complete meal in a pan ready in less than an hour!",
    "One pot and pan dinners are a favourite around here. Spanish Chicken and Rice (HELLO YUM), Ravioli in a Creamy Tomato Beef Sauce (HELLO SAUCY CARBS), Lemon Garlic Baked Salmon + Asparagus (HELLO DELICIOUS DIET FOOD), to name a few. But this one takes the cake — or the potato, as the case may be.",
    "For this recipe, you’re going to sear your chicken first, because HELLO crispy skin! THEN you’re going to throw the rest of the veggies into the pan, throw the pan into the oven, and throw yourself onto the couch for a well need half hour nap before it’s done. I hear you cheering. I’m cheering right here with you.",
    "THEN you’re going to order someone to wash that ONE PAN for you….plus any dirty dishes, while you go take a warm bath with a full stomach and content grin on your face. Am I right?",
    "REMEMBER TO SUBSCRIBE TO CAFE DELITES NEWSLETTER FOR FREE AND RECEIVE FRESH RECIPE NOTIFICATIONS DELIVERED INTO YOUR INBOX!",
    "If you try a recipe, please use the hashtag #cafedelites on INSTAGRAM for a chance to be featured!",
    "FOLLOW CAFE DELITES ON FACEBOOK | INSTAGRAM | PINTEREST | TWITTER FOR ALL OF THE LATEST CONTENT, RECIPES AND UPDATES.",
    "REMEMBER TO SUBSCRIBE TO CAFE DELITES NEWSLETTER FOR FREE AND RECEIVE FRESH RECIPE NOTIFICATIONS DELIVERED INTO YOUR INBOX!",
    "If you try a recipe, please use the hashtag #cafedelites on INSTAGRAM for a chance to be featured! FOLLOW CAFE DELITES ON FACEBOOK | INSTAGRAM | PINTEREST | TWITTER FOR ALL OF THE LATEST CONTENT, RECIPES AND UPDATES.",
    "5 from 10 votes",
    "Print",
    "Lemon Herb Mediterranean Chicken + Potatoes (One Pot)",
    "Prep Time",
    "10 mins",
    "Cook Time",
    "45 mins",
    "Total Time",
    "55 mins",
    "Garlic Lemon Herb Mediterranean Chicken And Potatoes, all made in the ONE PAN for an easy weeknight dinner the whole family will love!",
    "Course: Dinner",
    "Cuisine: Mediterranean",
    "Servings: 4",
    "Author: Karina - Cafe Delites",
    "Ingredients",
    "4 skin-on , bone-in chicken thighs",
    "¼ cup lemon juice (juice of 1 lemon)",
    "3 tablespoons olive oil , divided",
    "1 tablespoon red wine vinegar",
    "4 large garlic cloves , crushed",
    "3 teaspoons dried basil",
    "2 teaspoons dried oregano",
    "2 teaspoons dried parsley",
    "2 teaspoons salt , plus extra",
    "8 baby potatoes , halved",
    "1 red onion , cut into wedges",
    "1 red bell pepper (capsicum), deseeded and cut into wedges",
    "1 large zucchini , sliced",
    "4 tablespoons pitted Kalamata olives",
    "Lemon slices , to serve"
  ],
  "__v": 1
}