{
  "__v": 1,
  "directions": [
    "0",
    "Preparate la pastella: in una ciotola sgusciate le uova e sbattetele con una frusta insieme ai due tipi di farina e al sale. Aggiungete gradualmente il latte, tenendo conto che potrebbe non servirvi tutto (controllate di volta il volta la consistenza della pastella fino ad ottenimento di quella desiderata). Mescolate accuratamente con una frusta fino ad ottenere una pastella omogenea. Fatela riposare per circa 30 minuti.",
    "Nel frattempo preparate il ripieno: mondate la cipolla e fatela dorare in una capiente padella antiaderente insieme ad un filo di olio extravergine di oliva. Unite la pancetta affumicata, fatela rosolare mescolando con un cucchiaio di legno ed aggiungete il radicchio tagliato a listarelle. Regolate di sale e di pepe e portate a cottura. Tenete presente che questo condimento deve essere il più possibile asciutto, altrimenti bagnerà le crespelle. Fate raffreddare.",
    "Preparate quindi le crespelle: scaldate una padellina antiaderente del diamentro di circa 18 cm e ungetela con poco olio che distribuirete su tutta la superficie aiutandovi con un foglio di carta assorbente (ricordatevi di farlo spesso, magari ogni 2-3 crespelle). Rimestate la pastella con la frusta (anche questa operazione va fatta spesso perché la farina di grano saraceno macinata grossa è pesante e tende a distribuirsi sul fondo della ciotola) e versatene un mestolo scarso all’interno della padella, che farete roteare in modo da creare un disco sottile. Fate cuocere fino a quando i lati inizieranno a sollevarsi leggermente (sollevando la crespella controllate se è effettivamente cotta), girate e fate cuocere dall’altro lato. Proseguite in questo modo fino ad esaurimento della pastella, disponendo le crespelle pronte su di un piatto, intervallandole di tanto in tanto con un foglio di carta assorbente. Fatele raffreddare.",
    "Tagliate il Brie a fettine molto sottili. Imburrate abbondantemente due pirofile (o una sola a seconda di quante ne volete fare) e iniziate a farcire le crespelle. Prendetene una, disponetevi sulla metà inferiore il condimento al radicchio e aggiungetevi sopra il brie cercando di distribuirlo il maniera omogenea. Coprite con la metà di crespella senza condimento, schiacciate leggermente, e piegate di nuovo in modo da formare un triangolo. Procedete in questo modo fino ad esaurire gli ingredienti. Disponete le crespelle così preparate all’interno delle pirofile prescelte e cospargetele con fiocchetti di burro (apponetene sempre uno nelle zone dove le crespelle si toccano tra loro, in questo modo non si attaccheranno) e parmigiano grattugiato. Passate il tutto nel forno già caldo a 180°, modalità ventilata, fino a quando le crespelle saranno gratinate e dorate e il formaggio Brie al loro interno sarà fuso. Sfornate e servite subito.",
    "Vino consigliato: un prosecco millesimato extra dry, che con il suo perlage e la giusta morbidezza vanno a equilibrare le note leggermente amarognole date dal radicchio presente nel piatto."
  ],
  "firstAdded": "2014-10-20T19:57:21.922000",
  "hash": "4a32994988b3032378017a7a3c6ac3f42f87563d",
  "href": "http://www.cucchiaio.it/fiordifrolla/crespelle-saracene-al-radicchio-e-brie/",
  "image": "http://farm8.staticflickr.com/7025/6703013415_4214a97624_o.jpg",
  "ingredients": [
    "0",
    "Ingredienti per 12 crespelle:",
    "per la pastella:",
    "2 uova",
    "60 g di farina 00",
    "65 g di farina di grano saraceno",
    "350 ml circa di latte intero",
    "sale",
    "per il ripieno:",
    "1 cipolla piccola",
    "400 g di radicchio trevigiano (in alternativa Castelfranco)",
    "120 g di pancetta affumicata",
    "250 g di Brie",
    "olio extravergine di oliva",
    "sale, pepe",
    "per gratinare:",
    "burro",
    "parmigiano grattugiato"
  ],
  "keywords": [
    "ingredienti",
    "crespelle",
    "pastella",
    "uova",
    "farina",
    "grano",
    "saraceno",
    "circa",
    "latte",
    "intero",
    "sale",
    "ripieno",
    "cipolla",
    "piccola",
    "radicchio",
    "trevigiano",
    "alternativa",
    "castelfranco",
    "pancetta",
    "affumicata",
    "brie",
    "olio",
    "extravergine",
    "oliva",
    "pepe",
    "gratinare",
    "burro",
    "parmigiano",
    "grattugiato"
  ],
  "title": "Crespelle saracene al radicchio e Brie",
  "users": [
    null
  ]
}