{
  "hash": "aeca0bdf1a87fdc6e380c2db39ae5ee3552cecf6",
  "title": "Dal Makhani",
  "image": "",
  "href": "http://recipe-folder.com/recipe/5bd4c9919d3ecd063979208b",
  "extension": "User Added",
  "firstAdded": "2018-10-27T20:24:49.387000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Soak the lentils and beans overnight.",
    "1",
    "Pressure cook black gram and Kidney beans in 3.5 cups of water with salt and chili powder for 3-4 whistles (25 minutes at high pressure once pressure has reached).",
    "2",
    "Or use a slow cooker to cook urad beans and keep ready. Kidney beans cannot be cooked in a slow cooker from raw state, so use 1 cup cooked canned beans.",
    "3",
    "In a large pan, add oil and heat on medium-high heat.",
    "4",
    "Add cumin seeds and cook till they start to change color.",
    "5",
    "Add ginger, garlic and green chili and saute until golden.",
    "6",
    "Add onion, asafetida and cook until translucent.",
    "7",
    "Add the tomato and turmeric and cook until tomatoes are mushy. (13-15 minutes till this step).",
    "8",
    "Add the cooked black gram, kidney beans and the water they were cooked in.",
    "9",
    "Add garam masala, fenugreek and the milks. Mix, taste and adjust salt.",
    "10",
    "Add more water if the mixture is too thick.",
    "11",
    "Simmer on low heat till the dals/beans are totally soft. Mash some of the lentils with the spatula. 30 minutes.",
    "12",
    "Or Pressure cook for 5 minutes at high pressure once the pressure has reached. (1 whistle + simmer for 5)",
    "13",
    "Top with a small dollop of vegan butter or olive oil and cilantro.",
    "14",
    "Serve with Roti/Naan flatbread or Rice Pilaf or other cooked grains like Quinoa, millet."
  ],
  "ingredients": [
    "0",
    "For the Lentils:",
    "1",
    "1 cup whole black gram Urad Whole or use black lentils",
    "2",
    "1/2 cup kidney beans Rajma",
    "3",
    "3.5 cups water",
    "4",
    "1 teaspoon salt or to taste",
    "5",
    "1/2 teaspoon red chili powder or cayenne or to taste",
    "6",
    "For the Tempering:",
    "7",
    "2 tsp oil",
    "8",
    "1 teaspoon cumin seeds",
    "9",
    "2-3 green chilis finely chopped I use Serrano chili pepper",
    "10",
    "1 inch ginger finely chopped",
    "11",
    "5-6 garlic cloves finely chopped",
    "12",
    "1 medium size onion chopped",
    "13",
    "1/8 teaspoon asafoetida hing",
    "14",
    "1/2 teaspoon turmeric powder",
    "15",
    "2 medium size tomatoes chopped",
    "16",
    "1 teaspoon garam masala regular or punjabi",
    "17",
    "1 Tablespoon dried fenugreek leaves Kasoori methi, or Use a 1/2 teaspoon fenugreek/methi seeds-Optional",
    "18",
    "2 Tablespoons Almond milk",
    "19",
    "1/4 cup Cashew milk I used So delicious Cashew milk. Or Soak cashews and blend to make milky cashew cream.",
    "20",
    "Vegan butter such as Earth Balance as needed"
  ],
  "__v": 1,
  "hidden": true
}