{
  "hash": "d74205063c218a3a556b4b9f07c5af8a81628abc",
  "title": "KOKEILE..Sea Bream with Tomato and Herb Salsa",
  "image": "",
  "href": "http://seemecook.com/2013/06/sea-bream-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-10-19T08:56:53.258000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "frying",
    "bream",
    "fillets",
    "tomato",
    "herb",
    "salsa",
    "cherry",
    "tomatoes",
    "black",
    "olives",
    "herkkusieni",
    "bunch",
    "coriander",
    "basil",
    "lemon",
    "salt",
    "pepper"
  ],
  "directions": [
    "0",
    "First make the salsa. Place a small saucepan over a gentle heat and add 3 tablespoons of olive oil. Chop the tomatoes in half and add to the oil. Add the olives, season with salt and pepper and stir over a low heat for 1–2 minutes. Set aside.",
    "Hold the coriander and basil stalks together and slice down with a sharp knife to shave off the leaves. Discard the stalks, then gently roll the coriander and basil leaves into a ball and chop. Keeping a little back for garnish, add the coriander and basil to the salsa and stir to combine.",
    "Roll the lemon on a chopping board to soften it and release the juices, then cut in half. Add the juice of one half to the pan, stir and set the salsa aside to allow the flavours to infuse.",
    "To cook the bream, heat a heavy-based frying pan over a high heat. Meanwhile, slash the skin of the fillets in 2 or 3 places. Add a dash of oil to the pan and, when really hot, add the bream fillets skin side down. Season and cook for 2–3 minutes until the fish is dark golden and the skin is crisp. (The flesh should be opaque two-thirds of the way up the fillet.)",
    "Turn the fillets and cook on the other side for 1 minute, basting with the oil in the pan, until just cooked through.",
    "To serve, sit the fish fillets on top of the tomato and herb salsa and sprinkle with the reserved coriander and basil."
  ],
  "ingredients": [
    "0",
    "Olive oil, for frying",
    "2 sea bream fillets, about 150g each",
    "FOR THE TOMATO AND HERB SALSA:",
    "Olive oil",
    "200g cherry tomatoes",
    "60g pitted black olives (Herkkusieni)",
    "Small bunch of coriander",
    "Small bunch of basil",
    "1 lemon",
    "Sea salt and freshly ground black pepper"
  ],
  "__v": 2
}