{
  "hash": "ae939c7b5873e26ae34ef364db6ca2b0f5e9a6ea",
  "title": "Oven Roasted Salmon with Plantains and Pineapple",
  "image": "http://f.tqn.com/y/southamericanfood/1/0/Q/N/-/-/salmon200.jpg",
  "href": "http://southamericanfood.about.com/od/healthyeating/r/Oven-Roasted-Salmon-With-Plantains-And-Pineapple.htm",
  "extension": "Chrome",
  "firstAdded": "2015-05-12T17:47:31.495000",
  "users": [
    null
  ],
  "keywords": [
    "salmon",
    "filets",
    "yellowblack",
    "plantains",
    "pineapple",
    "rings",
    "maple",
    "syrup",
    "balsamic",
    "vinegar",
    "soy",
    "salt",
    "pepper",
    "red",
    "onion",
    "lime",
    "cilantro"
  ],
  "directions": [
    "0",
    "PREPARATION",
    "Preheat the oven to 450 degrees. Line a large baking sheet with aluminum foil, placed shiny side up. Brush the aluminum foil lightly with olive oil.",
    "Peel and slice the plantains into 1/3-inch thick strips or slices. Place the plantains on one side of the foil-lined baking sheet. Place the pineapple rings on the foil alongside the plantain slices.",
    "In a small bowl, mix together the maple syrup, balsamic vinegar, and soy sauce. Brush mixture lightly onto the plantains and pineapple.",
    "Place baking sheet in the middle of the oven, and roast for 10-15 minutes, turning once.",
    "Remove baking sheet from the oven and remove the pineapple rings to a cutting board to cool. Add the salmon filets to the baking sheet. Season them lightly with salt and pepper, then brush them generously with the maple syrup mixture. If the plantains are caramelized and soft, remove them and set aside. If they need more time to cook, leave them on the baking sheet.",
    "Place the salmon in the oven and roast for about 10 minutes (for 1 inch thick pieces), or until the salmon flakes when you cut into it and is slightly opaque.",
    "While the salmon is cooking, chop the pineapple into 1/2 inch pieces, and place in a bowl. Add the onion and cilantro to the bowl, and squeeze the juice from 1/2 of the lime over the mixture. Toss and taste for seasoning, adding more lime juice and/or salt and pepper if desired.",
    "When salmon is ready, remove it from the oven. Serve salmon warm with the plantains and pineapple salsa."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "16-20 ounces of salmon, cut into 4 filets",
    "2 very ripe (yellow/black) plantains",
    "3-4 large pineapple rings",
    "2 tablespoon maple syrup",
    "2 tablespoons balsamic vinegar",
    "1 tablespoon soy sauce",
    "Salt and pepper to taste",
    "1/4 finely chopped red onion",
    "1 lime",
    "1 tablespoon minced cilantro"
  ],
  "__v": 1
}