{
  "hash": "ae2d47292013c1b95238b9e114e955b502930727",
  "title": "Honey-Soy Broiled Salmon",
  "image": "http://www.drweilonhealthyaging.com/hya/file/honey+soy+salmon.jpg?id=3982",
  "href": "http://www.drweilonhealthyaging.com/hya/ecs/subpage/recipedetail.html?docid=RCP02038",
  "extension": "Chrome",
  "firstAdded": "2016-01-26T03:44:52.289000",
  "users": [
    null
  ],
  "keywords": [
    "scallion",
    "reducedsodium",
    "soy",
    "rice",
    "vinegar",
    "honey",
    "ginger",
    "centercut",
    "salmon",
    "fillet",
    "skinned",
    "tip",
    "portions",
    "sesame",
    "seeds"
  ],
  "directions": [
    "0",
    "Whisk scallion, soy sauce, vinegar, honey and ginger in a medium bowl until the honey is dissolved. Place salmon in a sealable plastic bag, add 3 tablespoons of the sauce and refrigerate; let marinate for 15 minutes. Reserve the remaining sauce.",
    "Preheat broiler. Line a small baking pan with foil and coat with cooking spray. Transfer the salmon to the pan, skinned-side down. (Discard the marinade.) Broil the salmon 4 to 6 inches from the heat source until cooked through, 6 to 10 minutes. Drizzle with the reserved sauce and garnish with sesame seeds.",
    "TIP: How to skin a salmon fillet: Place salmon fillet on a clean cutting board, skin-side down. Starting at the tail end, slip the blade of a long knife between the fish flesh and the skin, holding down firmly with your other hand. Gently push the blade along at a 30° angle, separating the fillet from the skin without cutting through either.",
    "TIP: To toast seeds: Cook in a small dry skillet over medium-low heat, stirring constantly, until fragrant and lightly browned, 2 to 4 minutes."
  ],
  "ingredients": [
    "0",
    "1 scallion, minced",
    "2 tablespoons reduced-sodium soy sauce",
    "1 tablespoon rice vinegar",
    "1 tablespoon honey",
    "1 teaspoon minced fresh ginger",
    "1 pound center-cut salmon fillet, skinned (see Tip) and cut into 4 portions",
    "1 teaspoon toasted sesame seeds (see Tip)"
  ],
  "__v": 1
}