{
  "hash": "62d9cbcd54274acf983b03dbbc0e277bf2ba27a7",
  "title": "Baked eggs in popped beans",
  "image": "//cdn.jamieoliver.com/recipe-database/oldImages/335_448/1578_9_1439906407.jpg",
  "href": "http://www.jamieoliver.com/recipes/eggs-recipes/baked-eggs-in-popped-beans/",
  "extension": "Chrome",
  "firstAdded": "2017-07-03T22:31:42.624000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Method",
    "Halve the tomatoes, place in a bowl and toss with the lemon juice, 1 tablespoon of oil and a pinch of sea salt. Pick, tear and toss in the basil leaves (reserving the smaller ones for garnish), then leave aside to macerate for a few minutes.",
    "Meanwhile, place a large non-stick frying pan on a high heat.",
    "Drain the beans and put into the hot pan with the fennel seeds and a pinch of black pepper. Leave for 5 minutes, shaking occasionally – you want them to char and pop open, bursting their skins.",
    "Pour the macerated tomatoes into the pan with 100ml of water, season, then leave to bubble away vigorously for 1 minute.",
    "Crack in an egg on each side, then cover with a lid, plate or tin foil, reduce to a medium-low heat and slow-cook for 3 to 4 minutes for nice soft eggs, or longer if you prefer. Meanwhile, toast the bread.",
    "Divide the ricotta and spread over the two pieces of hot toast, then serve on the side of the baked eggs in beans.",
    "Sprinkle the reserved baby basil leaves over the top and tuck right in. Nice finished with a drizzle of balsamic vinegar and/or a drizzle of hot chilli sauce. Delicious."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "250 g mixed-colour ripe cherry tomatoes",
    "½ a lemon",
    "extra virgin olive oil",
    "4 sprigs of fresh basil",
    "1 x 400 g tin of cannellini beans",
    "1 good pinch of fennel seeds",
    "2 large free-range eggs",
    "2 slices of seeded wholemeal bread",
    "2 heaped teaspoons ricotta cheese",
    "thick balsamic vinegar , optional",
    "hot chilli sauce , optional"
  ],
  "__v": 1
}