{
  "hash": "7e8c70d0ba22940fc13eaa8ab0472414472f66e9",
  "title": "Harissa, Kale and Chickpea Spicy Soup Recipe",
  "image": "http://i0.wp.com/healthishappiness.com/wp-content/uploads/2012/10/IMG_4724.jpg?resize=500%2C333",
  "href": "http://healthishappiness.com/2012/11/05/harissa-kale-and-chickpea-spicy-soup-recipe/",
  "firstAdded": "2015-02-08T08:44:19.312000",
  "users": [
    null
  ],
  "keywords": [
    "medium",
    "onion",
    "garlic",
    "harissa",
    "quite",
    "spicy",
    "chickpeas",
    "xml",
    "bunch",
    "dinosaur",
    "kale",
    "leaves",
    "trimmed",
    "stems",
    "ribbons",
    "broth",
    "possible",
    "bay",
    "sprigs",
    "thyme",
    "salt",
    "pepper",
    "really",
    "depend",
    "salty",
    "olive",
    "oil"
  ],
  "directions": [
    "0",
    "In a big sauce pan on medium heat, add the olive oil with the garlic and Harissa paste. Fry for about 1 minute stirring constantly. Then add the onions, oregano and a little salt and pepper. Cook for 5-7 minutes until soft and translucent.",
    "Add the chickpeas, bay leaves and vegetable broth to the pot. Cover and bring to a boil. Reduce heat and let simmer for 30 minutes.",
    "Remove 2-3 cups of chickpeas and broth, a few ladles full. Blend in an upright blender or in a bowl with an immersion blender. Add the pureed chickpeas and broth back to the soup. This will add thickness to the soup.",
    "Add the chopped kale at this point and cook for 15 more minutes. Taste and adjust seasoning. Just note that you won’t be able to properly taste the soup until it cools a little, so be sure not to over season it when it is piping hot.",
    "Serve in bowls on a cold day."
  ],
  "ingredients": [
    "0",
    "1 medium onion, chopped",
    "6 garlic cloves, finely chopped",
    "1/2 tablespoon harissa (or 1 whole tbsp if you like it quite spicy)",
    "4 cups cooked chickpeas (2x540ml cans)",
    "1 bunch of dinosaur kale, leaves trimmed from stems and chopped into ribbons (about 3 packed cups chopped)",
    "10 cups vegetable broth (homemade if possible)",
    "2 bay leaves",
    "a few sprigs of fresh thyme",
    "sea salt and pepper to taste (amount will really depend on how salty the broth is)",
    "3 tablespoons olive oil"
  ],
  "__v": 1
}