{
  "hash": "6e03bbcedbc4c3de936be43d665eeab73f8bc282",
  "title": "Dark Chocolate Coconut Rum Truffles",
  "image": "https://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2016/04/dark-chocolate-coconut-rum-truffles-7.jpg",
  "href": "https://sallysbakingaddiction.com/2016/04/25/dark-chocolate-coconut-rum-truffles/",
  "extension": "Chrome",
  "firstAdded": "2018-09-16T22:21:24.214000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 300°F (150°C). Line a large baking sheet with parchment paper or a silicone baking mat. Spread pecans on top and toast for 7-8 minutes. Allow to cool for 5 minutes, then give them a fine chop or pulse in a food processor until finely chopped. See photo above for how mine look.",
    "Add all of the ingredients except for the chopped chocolate to a medium bowl. Stir to combine. The mixture will be sticky. Cover and chill in the refrigerator for 45 minutes (and up to 2 days) before forming into balls. Chilling makes the mixture sturdier and easier to work with.",
    "During the last few minutes of the chilling time, begin melting the chocolate. You can melt the chocolate in a double boiler or the microwave. If using the microwave: place the chocolate in a medium heat-proof bowl. I like to use a liquid measuring cup. Its depth makes it easier for dipping. Melt in 30 second increments in the microwave, stirring after each increment until completely melted and smooth. Let the warm chocolate sit for 5 minutes to slightly cool before dipping.",
    "Remove chilled mixture from the refrigerator. Take 2 teaspoons of the mixture and roll into a ball, then dip completely into the chocolate using a dipping tool (see video above for how I dip!). Repeat with the remaining mixture. When lifting the ball out of the chocolate, remember to tap the dipping tool gently on the side of the bowl to allow excess chocolate to drip off. Place balls back onto the baking sheet after you dip each one. Refrigerate for 30 minutes or until chocolate has completely set before serving."
  ],
  "ingredients": [
    "0",
    "1 and 1/2 cups (150g) graham cracker crumbs (about 10 full sheets)",
    "1 cup (110g) Diamond of California shelled pecans",
    "1/2 cup (60g) confectioners' sugar",
    "2 Tablespoons (10g) cocoa powder",
    "2 Tablespoons (45g) honey",
    "1/4 cup (60ml) coconut rum1",
    "1 cup (80g) sweetened shredded coconut",
    "2 teaspoons orange zest",
    "1 teaspoon pure vanilla extract",
    "10 ounces (282g) quality semi-sweet or bittersweet chocolate, coarsely chopped2"
  ],
  "__v": 1
}