{
  "hash": "31c84f811e4ad019a6222855e870e7907b603a2e",
  "title": "GREEK YOGURT CHEESE",
  "image": "http://www.tasteloveandnourish.com/wp-content/uploads/2013/07/Greek-Yogurt-Cheese-3.jpg",
  "href": "http://www.tasteloveandnourish.com/2013/07/31/greek-yogurt-cheese/",
  "extension": "Chrome",
  "firstAdded": "2018-08-25T22:57:49.568000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Place the sieve onto the bowl and line it with the cheese cloth. Spoon the entire container of yogurt into the lined sieve.",
    "Bring up the sides of the cheese cloth to cover the yogurt and place one of your largest cans on top (Don't use two cans, like in the photo! I really just use one). This will help press the whey out even more. Place the entire contraption in your fridge and leave it alone for about three to four days. If you want, you can unwrap it after two days, but it just won't be as firm.",
    "Remove the cheese from the refrigerator. Discard the whey. Unwrap the cheese and place it in a medium bowl. Add the salt and the olive oil and blend in well using a rubber spatula. Draw a line down the center with the spatula.",
    "Take half of the cheese and place it on the sheet of parchment. Bring up one side of the parchment over the cheese and using your hands, form a log out of the cheese. Roll it up in the paper and roll the log on your counter to give it shape. Repeat with the other half of the cheese.",
    "Refrigerate the cheese logs or serve immediately.",
    "To serve, I like to drizzle the top of the cheese with more olive oil and some fresh herbs. Try using flatbread crackers topped with the cheese and some assorted veggies.",
    "NOTES"
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "32 ounce non-fat plain Greek yogurt",
    "¾ teaspoon sea salt",
    "1 tablespoon extra virgin olive oil",
    "Your choice of herbs (parsley, rosemary, basil, mint)",
    "You'll need:",
    "cheese cloth",
    "large fine mesh sieve",
    "bowl with high sides (be sure the bottom of the sieve sits high above the bottom of the bowl)",
    "two sheets of parchment paper"
  ],
  "__v": 1
}