{
  "hash": "af506d663ed54fee66f116da9be60c83af5ed5d0",
  "title": "Paneer Tikka Masala",
  "image": "http://indianhealthyrecipes.com/wp-content/uploads/2014/11/paneer-tikka-masala-restaurant-style-.jpg",
  "href": "http://indianhealthyrecipes.com/paneer-tikka-masala-recipe-sanjeev-kapoor/",
  "extension": "Chrome",
  "firstAdded": "2017-03-28T23:53:36.799000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Firstly, marinate paner and veggies with the marination ingredients mentioned above.",
    "Add chopped tomatoes, cashews and onions to a blender and make a smooth puree, Set this aside.",
    "Heat a tbsp oil or butter in a wide pan on a high flame, drop the paner in the tawa and toss them on a high flame till the marinade dries up and it turns golden. Over frying can make it harder and rubbery.",
    "Now in the same pan, place the veggies on the pan and flip to the other side till the marinade sticks up to the veggies and they look partially charred.",
    "Heat oil in a pan, add bay leaf and cardamom. Fry ginger garlic paste until the raw smell goes off.",
    "Add the onion tomato puree,and cook until the mixture begins to leave the sides. Add garam masala , chili powder and salt. Saute for a minute.",
    "Add 1 cup water , Bring it to a boil and cook till you see a thick gravy for about 3 to 5 minutes on a medium flame. Add kasuri methi and cook for 1 to 2 minutes.",
    "Add paneer tikka along with veggies and cook for 2 mins on a medium heat, overcooking can break panir and can make them rubbery too.",
    "Pour the cream of your choice, add coriander leaves. mix and off the stove. Serve paneer tikka masala with roti, butter naan or veg pulao."
  ],
  "ingredients": [
    "0",
    "200 grams paneer or 1 ½ cup paneer",
    "½ cup onions cubed layers seperated",
    "½ cup capsicum/ bell peppers (green or red)",
    "1",
    "½ cup of hung curd/yogurt (refer notes how to make hung curd)",
    "1 ½ tsp ginger garlic paste",
    "¾ tsp chili powder",
    "¾ tsp garam masala or tandoori masala",
    "⅛ tsp turmeric",
    "salt to taste",
    "1 tsp oil (optional)",
    "¼ tsp kasuri methi/ dried fenu greek leaves",
    "2",
    "12 to 15 cashew nuts or 2 tbsp. cashew paste",
    "1 to 1 ¼ cup of ripe tomatoes chopped",
    "1 cup cubed onions",
    "3",
    "1 small bay leaf",
    "2 green cardamoms",
    "1 ½ tsp ginger garlic paste",
    "¾ to 1 tsp red chili powder",
    "1 tsp garam masala",
    "¼ tsp kasuri methi",
    "2 to 4 tbsp of cream (can use cashew milk or almond milk for healthier option)",
    "few coriander leaves chopped",
    "oil or butter as needed"
  ],
  "__v": 1
}