{
  "hash": "ecfaa4264adbb49278342de9ace3a240f61a19ee",
  "title": "VEGAN BROCCOLI CASSEROLE\n★★★★★\n5 from 6 reviews\nAuthor: Beth Hornback Prep Time: 30 minutes Cook Time: 30 minutes Total Time: 55 minutes Yield: 8 servings",
  "image": "",
  "href": "https://passtheplants.com/vegan-broccoli-casserole/",
  "extension": "Chrome",
  "firstAdded": "2018-11-17T02:22:47.957000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "MAKE THE SAVORY CASHEW CREAM",
    "After soaking the cashews or pepitas*, drain, rinse, and add to a blender or food processor.",
    "Add water/milk, miso, salt, nutritional yeast, and vinegar, and blend until smooth and creamy. If using a high-speed blender, no soaking is necessary.",
    "MAKE THE CASSEROLE",
    "Preheat the oven to 425 degrees F.",
    "Add the frozen broccoli to a 13×9 casserole dish and place it in the oven while it is preheating. Bake for 15-20 minutes until the broccoli is heated through and tender, stirring occasionally to ensure even heating.",
    "After the broccoli is cooked, set aside and reduce oven temperature to 350F.",
    "Preheat a large skillet or saucepan over medium-high heat.",
    "Add mushrooms and onions to the pan and cook for 5-6 minutes, until mushrooms have released their liquid and onions are browned and soft.",
    "Add cashew cream to the onion/mushroom mixture and stir to combine.",
    "Reduce heat to medium, and cook for 4-5 minutes until mixture has thickened slightly. Remove from heat.",
    "Pour the sauce over the broccoli in the casserole dish and stir to combine. Season to taste with salt and pepper.",
    "Spread cracker crumbs over the top of the broccoli mixture in an even layer.",
    "Bake casserole, uncovered, for 30 minutes on the middle rack.",
    "NOTES",
    "*Quick-soak method for raw cashews or pepitas: In a medium saucepan, add nuts or seeds along with enough water to cover. Bring to boil, then maintain a low boil for 15 minutes. Drain and rinse, and proceed with the recipe.",
    "NUTRITION",
    "Serving Size: 1 cup",
    "Calories: 347"
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "2 32 oz. bags frozen broccoli cuts",
    "2 cups raw cashews or pepitas (soaked for 2-8 hours if possible (*see note for quick-soak method))",
    "3 cups water or plain unsweetened plant milk",
    "1 tablespoon miso paste (optional)",
    "1 teaspoon salt",
    "2 tablespoons nutritional yeast",
    "2 tablespoons apple cider vinegar (lemon juice, or unsweetened rice vinegar)",
    "1 yellow onion (diced)",
    "8 ounces crimini or button mushrooms (diced)",
    "salt and pepper to taste",
    "1-2 sleeves Ritz crackers (crushed into crumbs, or substitute 2 GF plain bread crumbs for gluten-free option)"
  ],
  "__v": 1
}