{
  "hash": "ef5187f9094702249f5a9b82ef4aa355b5eaf9af",
  "title": "Fried rice cakes with creamed leeks and egg",
  "image": "",
  "href": "http://www.ottolenghi.co.uk/recipes/fried-rice-cakes-with-creamed-leeks-and-egg-shop",
  "extension": "Chrome",
  "firstAdded": "2016-01-01T23:54:16.684000",
  "users": [
    null
  ],
  "keywords": [
    "saffron",
    "strands",
    "rice",
    "variety",
    "gruyre",
    "salt",
    "black",
    "pepper",
    "olive",
    "oil",
    "extra",
    "frying",
    "cakes",
    "leeks",
    "trimmed",
    "cmthick",
    "slices",
    "stock",
    "double",
    "cream",
    "peppercorns",
    "tarragon",
    "freerange",
    "eggs"
  ],
  "directions": [
    "0",
    "In a small bowl, stir the saffron with about a tablespoon of boiling water, leave to infuse for a couple of minutes, then stir into the rice. Add the gruyère to the rice mix, and season well.",
    "Next, heat the olive oil in a large frying pan and, on high heat, fry the leeks for three minutes to give them a little colour. Add the stock, cream and plenty of crushed black peppercorns, and carry on cooking on a slow simmer for about 10 minutes, until the leeks are soft and the sauce is thick. Add salt to taste and keep warm. Stir in the tarragon just before serving.",
    "Add one egg to the rice mix, and stir well. Pour a tiny amount of olive oil into a large, nonstick frying pan and place over a medium heat. With a spoon, take some of the rice mix and press it down into the hot oil to create four flat cakes about 1cm thick and 7cm in diameter. Fry them on both sides until crispy and brown, about four minutes a side. Transfer to absorbent paper and keep warm while you make another four cakes.",
    "Once all the rice cakes are made, crack the four remaining eggs into the same pan and fry, seasoning just before they're done. Serve two cakes per person and spoon over some of the creamed leeks. Top each portion with a fried egg and serve."
  ],
  "ingredients": [
    "0",
    "1 tsp saffron strands",
    "400g cooked rice of any variety",
    "100g diced gruyère",
    "Salt and freshly ground black pepper",
    "2 tbsp olive oil, plus extra for frying the cakes",
    "3 leeks, trimmed and cut into 1cm-thick slices",
    "250ml vegetable stock",
    "100ml double cream",
    "Freshly crushed black peppercorns",
    "2 tbsp chopped tarragon",
    "5 free-range eggs"
  ],
  "__v": 1
}