{
  "hash": "61517eff98ff9c968a2eccd8e5d37d700c907886",
  "title": "Sausage, Peppers, and Onions",
  "image": "http://www.simplyrecipes.com/recipes/sausage_peppers_and_onions/print/data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
  "href": "http://www.simplyrecipes.com/recipes/sausage_peppers_and_onions/print/",
  "extension": "Firefox",
  "firstAdded": "2016-09-27T21:37:00.587000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Brown the sausages: Heat the olive oil over medium heat in a large pan that has a lid. When the oil is hot, add the sausages and brown them slowly. If they sizzle and crackle too much, turn the heat down. You want a gentle browning, not a sear.",
    "Cook for several minutes, turning them occasionally so they brown on all sides. When the sausages are browned, remove from the pan and set aside.",
    "2 Sauté the onions, peppers, garlic: Increase the heat to high and add the onions and peppers. Toss so they get coated with the oil in the pan and sear them as well as you can, stirring every so often.",
    "You want some blackening. Once the onions and peppers soften, sprinkle some salt on them. Once you get some searing on the onions and peppers, add the garlic and cook for 1 more minute.",
    "3 Deglaze pan with wine: Add the Marsala or red wine if you are using, and with a wooden spoon scrape the bottom of the pan to release all the browned and blackened bits. Let the wine cook down by half.",
    "4 Add tomatoes, seasoning, sausages, then simmer: Add the tomatoes, oregano and red pepper flakes (if using) and stir well to combine. Add the sausages back in. Bring to a simmer then reduce the heat to low. Cover and simmer until the peppers are soft the sausages are cooked through, about 20 minutes.",
    "Sausage, peppers and onions will keep in the fridge for several days.",
    "Serve over polenta, or with penne pasta, or load up in a hoagie roll. Any leftover sauce makes a great sauce for pasta."
  ],
  "ingredients": [
    "0",
    "4 Italian sausage links (sweet, hot, or a couple of each)",
    "2 Tbsp olive oil",
    "1 green bell pepper, sliced into 2 to 3 inch long strips",
    "1 red bell pepper, sliced into 2 to 3 inch long strips",
    "1 bell pepper of another color (yellow or orange or purple), sliced into strips 2-3 inches long",
    "4 garlic cloves, sliced into slivers",
    "1 large sweet or yellow onion, sliced into 1/4-inch half-moons",
    "1 small (15 ounce) can of crushed tomatoes",
    "1 Tbsp of dried oregano",
    "1/2 cup Marsala or red wine (optional)",
    "1/2 teaspoon red pepper flakes (optional)",
    "Salt to taste"
  ],
  "__v": 1
}