{
  "hash": "a4c6ced26b0e11e1dbadc16fac112bbece0c69f9",
  "title": "Mary Berry Foolproof Cooking, part one: Brioche bread and butter pudding",
  "image": "http://i.dailymail.co.uk/i/pix/2016/02/02/16/30C9885300000578-0-image-a-58_1454431556899.jpg",
  "href": "http://www.dailymail.co.uk/home/you/article-3428533/Mary-Berry-Foolproof-Cooking-one-Brioche-bread-butter-pudding.html",
  "extension": "Chrome",
  "firstAdded": "2017-08-22T10:43:35.353000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 You will need a 28cm (11in) wide-based round ovenproof dish, and a roasting tin large enough to place it in.",
    "2 Cut the brioche loaf into 1.5cm (⅝ in) slices and brush each slice with melted butter on both sides. Arrange the slices in a spiral in the buttered dish and scatter over the sultanas.",
    "3 To make the custard, place all the ingredients in a large bowl and whisk together by hand until well mixed. Pour the custard over the brioche in the dish and gently press the exposed bread crusts down into the liquid. Sprinkle with the demerara sugar and leave to stand for about 30 minutes (see Tip). While the pudding is standing, preheat the oven to 180C/160C fan/gas 4 and grease the dish with a little butter.",
    "4 Half fill the roasting tin with boiling water, and place the ovenproof dish into it. Bake in the oven for about 40 minutes until golden on top and puffed up. The layers will shrink down a little on cooling. Serve warm with cream.",
    "PREPARE AHEAD",
    "The brioche and sultanas can be assembled in the buttered dish up to 6 hours ahead. Pour over the custard 30 minutes before baking. Leftovers will keep for a day in the fridge.",
    "MARY’S FOOLPROOF TIP",
    "Allowing the dish to stand for 30 minutes once the custard has been poured over allows the brioche to soak up the liquid and gives a light, fluffy pudding."
  ],
  "ingredients": [
    "0",
    "SERVES 6",
    "1 x 300g (11oz) brioche loaf",
    "50g (2oz) butter, melted, plus extra for greasing",
    "100g (4oz) sultanas",
    "3 tbsp demerara sugar",
    "FOR THE CUSTARD",
    "3 large eggs",
    "75g (3oz) caster sugar",
    "150ml (5fl oz) double cream",
    "600ml (1pt) full-fat milk",
    "1 tsp vanilla extract",
    "finely grated zest of 1 small lemon"
  ],
  "__v": 1
}