{
  "hash": "ca2c2de8021ca9fa89d5d85faacc0e6b7a63c66a",
  "title": "No-tatoes Bubble ‘n’ Squeak",
  "image": "https://cdn.ruled.me/wp-content/uploads/2017/09/no-tatoes-bubble-n-squeak-second.jpg",
  "href": "https://www.ruled.me/no-tatoes-bubble-n-squeak/",
  "extension": "Chrome",
  "firstAdded": "2018-04-15T16:46:08.666000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "If you have left over mashed cauliflower bring this out now. If not simply use the cauliflower florets and place in a bowl with 1 tablespoon of butter and your cream. Microwave on high for 4 minutes uncovered, and when done take out and mix to avoid drying the cauliflower out.",
    "Place back in the microwave for another 4 minutes. By now the cauliflower should be soft and falling apart. Season to taste with salt and pepper.",
    "Blend with an immersion blender until nice and creamy. It will be quite thick. Add your mozzarella to melt while still hot. Set this aside to cool.",
    "Place your chopped bacon into a pan on medium-high heat and allow your bacon to cook until it's crispy and the fat renders out. Remove the bacon and place on a paper towel.",
    "Add 1 tablespoon of butter to the bacon fat in the pan. Add the garlic and cook for about a minute on medium heat.",
    "Add the onion and sauté for about 3-5 minutes, until onion is translucent.",
    "Add the roughly chopped leeks and Brussels sprouts. Allow them to cook down for about 5-10 minutes or until soft.",
    "Add the green onions to the pan and cook for about another minute. We want the green onions to reserve some of their freshness.",
    "Remove from the heat and allow to cool.",
    "Add the bacon into the vegetable mixture, then add that to the mashed cauliflower. Have a taste and season with salt and pepper if necessary.",
    "Once your mixture is well combined, heat a pan over medium heat and add the duck fat. Once the duck fat is melted, place your egg rings in the pan and sprinkle some Parmesan inside the rings.",
    "Add the cauliflower mix into the rings. Sprinkle Parmesan on top.",
    "Give the mixture a chance to warm through (especially if using left overs.) Flip over and allow to cook until a crisp crust forms. Be careful that they don't get too hot or the mixture may run. If you find they aren’t crisping on the outside, turn up the heat in the pan and press down on them for a minute or so on each side."
  ],
  "ingredients": [
    "0",
    "½ medium cauliflower, cut into florets",
    "2 tablespoons heavy whipping cream",
    "1 tablespoon butter",
    "Salt and pepper to taste",
    "3 slices bacon, diced",
    "1 tablespoon butter",
    "¼ medium onion, diced",
    "50 g leek, sliced",
    "1 stalk green onion, sliced",
    "50 g chopped Brussels sprouts",
    "¼ cup grated mozzarella",
    "¼ cup grated Parmesan",
    "2 tablespoons duck fat",
    "1 teaspoon minced garlic"
  ],
  "__v": 1
}