{
  "hash": "99501a72f965e96e35aed2df90d44b7cd306a7e3",
  "title": "Green Chile and Harissa Chili",
  "image": "https://images.food52.com/rf9Yuy3hMhAnDp0Xo1fQuGRNsfo=/753x502/9fd56b98-789c-49e9-9437-c7e531caa842--2016-1213_nature-sweet-chilli_bobbi-lin_13548.jpg",
  "href": "https://food52.com/recipes/66050-green-chile-and-harissa-chili",
  "extension": "Chrome",
  "firstAdded": "2017-01-30T21:23:32.983000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large, heavy pot over medium-high heat, pour in the vegetable oil. Add the onions, garlic, and green pepper, season with salt and pepper, and cook until the onions are translucent.",
    "Add the beef and pork, breaking the meat up into small pieces. Season with salt and pepper. When the meat is cooked through, add the harissa and tomato paste, and cook for an additional couple of minutes while stirring.",
    "If you're using fresh tomatoes, chop them in half before adding them to the pot. (If you are using canned tomatoes, drain them—alternatively, if you'd like a saucier chili, you can opt to not drain them.) Stir in the tomatoes, green chiles, and chili powder. If using fresh tomatoes, cook for 5-10 minutes only (you don't want the tomato flesh to disappear into mush). If using canned tomatoes, you’ll want to cook the chili for a longer amount of time (canned tomatoes contain more moisture than fresh tomatoes, and you want to reduce this extra moisture to a stew-like consistency). The canned tomatoes will not fall apart in the same way as the fresh tomatoes, so you don't need to worry about overcooking them. Season with salt to taste.",
    "Serve the chili over a bed of chips with sour cream and pickled jalapeños, stir it into queso dip, make sandwiches with potato rolls, pack it into a Frito's bag for walking tacos, or bake it on loaded nachos. It can be stored in the fridge for a few days and just reheat if you'd like to serve it on it's own."
  ],
  "ingredients": [
    "0",
    "2 tablespoons vegetable oil",
    "1 large onion, minced",
    "1 large green pepper, finely chopped",
    "3 garlic cloves, minced",
    "Kosher salt and freshly ground black pepper, to taste",
    "1/2 pound ground beef",
    "1/2 pound ground pork",
    "2 to 4 tablespoons harissa, depending on how spicy you want it",
    "2 tablespoons tomato paste",
    "2 pints fresh cherry tomatoes, or one 28-ounce can of diced tomatoes plus one 14.5-ounce can of diced tomatoes",
    "2 4-ounce cans of green chiles (hot or mild)",
    "1 tablespoon chili powder"
  ],
  "__v": 1
}