{
  "hash": "cf937b21c7c304955bb9ef257b5d076ed2492f5a",
  "title": "cauliflower pasanda",
  "image": "https://i.guim.co.uk/img/static/sys-images/Lifeandhealth/Pix/pictures/2014/9/17/1410955583174/Jack-Monroes-cauliflower--010.jpg?w=300&q=55&auto=format&usm=12&fit=max&s=af62f9ff2ce4090820a7812433cdb6e9",
  "href": "https://www.theguardian.com/lifeandstyle/2014/sep/17/jack-monroe-cauliflower-pasanda-recipe",
  "extension": "Chrome",
  "firstAdded": "2017-08-06T05:35:25.541000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the oven to 180C/350F/gas mark four. Get your thumbs into the middle of your cauliflower and prise it apart. It falls into florets, looks better, makes less mess and is faster than chopping. Put the pieces in a roasting tin, splash with oil, scatter with ginger and turmeric, and roast in the middle of the oven for about 40 minutes, until slightly crispy and browned around the edges.",
    "Put the onions and garlic into a large pan with another splash of oil. Add the chilli, cumin seeds and garam masala, and cook on a low heat, stirring occasionally, for at least 15 minutes.",
    "Remove the onions from the heat and allow to cool for a few minutes. Stir through the yoghurt and cream, season, and let it all luxuriate in the pan until the cauliflower is ready – adding dairy when the mix has cooled avoids splitting and curdling.",
    "When the cauliflower is roasted, fold it through the curry pan – the turmeric should give it all a gentle, creamy yellow colour – and bring it back up to heat. Season, garnish with the coriander, sultanas and almonds, if using, and serve with rice or bread."
  ],
  "ingredients": [
    "0",
    "1 head of cauliflower",
    "Oil for cooking (I use groundnut)",
    "1 tbsp fresh ginger, grated",
    "1 tsp turmeric",
    "2 large onions, finely sliced",
    "4 fat cloves of garlic, roughly chopped",
    "1 red chilli, finely chopped",
    "1 tsp cumin seeds",
    "1 tsp garam masala",
    "300ml natural yoghurt",
    "300ml double cream",
    "Fistful of fresh coriander",
    "Advertisement",
    "A handful of sultanas",
    "Chopped almonds (optional)"
  ],
  "__v": 1
}