{
  "hash": "b2b3a43857529fbfa9930958b68107cc51e87a82",
  "title": "Baked Pasta with Broccoli Rabe and Sausage",
  "image": "http://farm3.staticflickr.com/2849/9724542162_a395dc2570.jpg",
  "href": "http://smittenkitchen.com/blog/2013/09/baked-pasta-with-broccoli-rabe-and-sausage/",
  "firstAdded": "2014-12-08T00:41:41.468000",
  "users": [
    null
  ],
  "keywords": [
    "pasta",
    "assembly",
    "chunky",
    "love",
    "bell",
    "shapes",
    "details",
    "bundle",
    "broccoli",
    "rabe",
    "options",
    "stems",
    "leaves",
    "segments",
    "italian",
    "sausage",
    "spicy",
    "pork",
    "chicken",
    "casings",
    "parmesan",
    "pecorino",
    "romano",
    "cheese",
    "mozzarella",
    "cubes",
    "bechamel",
    "milk",
    "fat",
    "ideal",
    "unsalted",
    "butter",
    "allpurpose",
    "flour",
    "salt",
    "black",
    "pepper",
    "garlic",
    "gratings",
    "nutmeg"
  ],
  "directions": [
    "0",
    "mportant: This is my dream of a baked pasta dish — not too heavy, not to rich or gooey, tons of crunchy edges. As you might see in the photos above, it’s on the firm side. If you’d like a baked pasta with more sauce, which I expect most of you will, you’ll want to use 1 1/2 times the bechamel and cheese below.",
    "Broccoli rabe (also called raab or rapini) is a leafy green vegetable with buds that somewhat resemble broccoli. It’s slightly bitter and holds up well to cooking. If you can’t find it, regular broccoli or broccolini will work here as well; they will only need 3 and 2 minutes respectively of boiling time with the pasta to keep it semi-crisp. If you’d like to make this without meat, the sausage can definitely be omitted. You could add some lightly sauteed chunky brown mushrooms for extra bulk, as well.",
    "The pasta shape I used here is called toscani and it’s from the brand Seggiano. I have found it at Whole Foods and, if you’re in the East Village, Commodities Natural Market on 1st Ave. (plus I’m sure other stores). When I can’t get, it I use Barilla’s similar campanelle or seriously any chunky pasta you like to bake with.",
    "Pasta and assembly",
    "1 pound chunky pasta of your choice (I love bell shapes; see above for details)",
    "1 bundle broccoli rabe (see above for options), stems and leaves cut into 1-inch segments",
    "1 pound Italian sausage (sweet or spicy pork or chicken), casings removed",
    "2/3 cup grated parmesan or pecorino romano cheese",
    "6 ounces mozzarella, cut into small cubes",
    "Bechamel",
    "2 cups milk, full fat is ideal",
    "4 tablespoons unsalted butter",
    "1/4 cup all-purpose flour",
    "1/2 teaspoon table salt",
    "Freshly ground black pepper",
    "2 cloves garlic, minced",
    "Few gratings fresh nutmeg",
    "Cook the pasta and rabe: Bring a large pot of well-salted water to a boil. Add pasta and five minutes before its cooking time is up, add the broccoli rabe. It will seem like too much for the water, but with a stir or two, the rabe should wilt and cook alongside the pasta. Drain the broccoli rabe and pasta together and place in a large bowl.",
    "Cook your sausage: Meanwhile, heat 1 to 2 tablespoons olive oil in a large, wide saucepan (you will use this for the bechamel in a few minutes; you could also use your pasta pot, once it is drained) over medium heat. When hot, add the sausage, breaking it up with a wooden spoon until it starts to brown, about five minutes. Remove with slotted spoon or spatula, leaving any fat behind. Eyeball the drippings (pork sausage will leave some; chicken usually does not) — use one tablespoon less butter next if it looks like there’s a tablespoon there. Any less, don’t worry about adjusting the butter.",
    "Heat oven to 400 degrees.",
    "Make the bechamel: Melt your butter in same saucepan over medium heat. Once melted, add your flour and stir it into the butter until smooth. Cook the mixture together for a minute, stirring constantly. Pour in a small drizzle of your milk, whisking constantly into the butter-flour mixture until smooth. Continue to drizzle a very small amount at a time, whisking constantly. Once you’ve added a little over half of your milk, you’ll find that you have more of a thick sauce or batter, and you can start adding the milk in larger splashes, being sure to keep mixing. Once all of the milk is added, add the salt, garlic, nutmeg, and few grinds of black pepper, and bring the mixture to a lower simmer and cook it, stirring frequently, for 10 minutes. Taste and adjust seasonings if needed.",
    "Assemble and bake: Add the sausage and bechamel to the bowl with the pasta and broccoli rabe. Stir in mozzarella and half of grated parmesan or pecorino until combined. Pour into a lasagna pan, deep 9×13-inch baking dish* or 3-quart casserole dish and coat with remaining parmesan or pecorino. Bake for 20 to 30 minutes, until the edges and craggy points are nicely bronzed.",
    "Eat warm. Reheat as needed."
  ],
  "ingredients": [
    "0",
    "Pasta and assembly",
    "1 pound chunky pasta of your choice (I love bell shapes; see above for details)",
    "1 bundle broccoli rabe (see above for options), stems and leaves cut into 1-inch segments",
    "1 pound Italian sausage (sweet or spicy pork or chicken), casings removed",
    "2/3 cup grated parmesan or pecorino romano cheese",
    "6 ounces mozzarella, cut into small cubes",
    "Bechamel",
    "2 cups milk, full fat is ideal",
    "4 tablespoons unsalted butter",
    "1/4 cup all-purpose flour",
    "1/2 teaspoon table salt",
    "Freshly ground black pepper",
    "2 cloves garlic, minced",
    "Few gratings fresh nutmeg"
  ],
  "__v": 1
}