{
  "__v": 3,
  "directions": [
    "0",
    "The first two ingredients are for a tangzhong mixture, the ancient Japanese bread secret. Whisk together the flour and milk in a small saucepan and heat over medium heat until the mixture thickens, but don’t bring it to a full boil. Remove from heat and set aside to cool. This makes enough tangzhong for two recipes (two pans) of bread, so double the rest of the ingredients for 2 pans of bread.",
    "For the rest of the dough, in a small bowl, combine the warm milk, yeast and sugar. Whisk to combine, set aside to let the yeast start.",
    "In a large bowl or mixer bowl (I told you there were a lot of steps), combine flour, salt and powdered milk.",
    "Once your tangzhong is cooled off so that it won’t hurt your yeast, measure out half of it (120 grams) into the yeast mixture with 1 large egg. Mix together and pour over dry ingredients in the large bowl.",
    "Let your dough hook work the dough until mixed, then add the softened butter. Let the hook work that in.",
    "Now, at this point, your dough may be very shaggy. If it is, add some flour (up to 1/4 cup or so) a little at a time until the dough doesn’t cling to the sides of the bowl any more. Let the mixer knead the dough about 5–8 minutes.",
    "Remove the dough onto a lightly floured surface and knead by hand until the dough becomes less sticky and forms a smooth ball.",
    "Let dough rise in an oiled bowl for 60 minutes, or until doubled. If your house is cool, put a few inches of warm water in your sink and set your bowl into it, covering the dough with plastic wrap.",
    "Once risen, divide dough into 4 pieces. Form each piece into a ball shape, then flatten out into an round disc shape, about 6 inches across. Roll the discs up like you would dough for cinnamon buns and lay in a greased pan. For this recipe, I just used an 8″ round cake pan. Repeat with each piece and fit them all into the pan.",
    "Let rise under plastic wrap about 45 minutes to an hour. Carefully brush with the remaining egg (beaten). Bake at 350ºF for about 30 minutes. At the 20-minute mark, I lay a piece of foil gently over the top to keep the bread from over-browning.",
    "Eat it hot with tons of butter, but if there is any left, let it cool and place in a Ziploc bag to keep it fresh!"
  ],
  "firstAdded": "2014-06-18T02:40:09.774000",
  "hash": "6daacc69b54c6b072184d3af378d6a6d56f6970a",
  "href": "http://tastykitchen.com/recipes/breads/japanese-milk-bread/",
  "image": "http://static.tastykitchen.com/recipes/files/2011/04/hokkaido2-410x273.jpg",
  "ingredients": [
    "0",
    "FOR THE TANGZHONG MIXTURE:",
    "⅓ cups Flour",
    "1 cup Milk",
    "_____",
    "FOR THE REST OF THE DOUGH:",
    "½ cups Warm Milk",
    "2 teaspoons Dry Yeast",
    "3 Tablespoons Sugar",
    "2-¾ cups Flour",
    "1 teaspoon Salt",
    "1 Tablespoon Dry Milk Powder",
    "2 whole Eggs, Divided",
    "2 Tablespoons Butter, Softened"
  ],
  "keywords": [
    "tangzhong",
    "mixture",
    "flour",
    "milk",
    "rest",
    "dough",
    "dry",
    "yeast",
    "sugar",
    "salt",
    "eggs",
    "divided",
    "butter",
    "softened"
  ],
  "title": "Japanese Milk Bread",
  "users": [
    null
  ]
}