{
  "hash": "5bd2ebb38c719b0220c5b6a5c27f06ad64f34a7d",
  "title": "OLD SOUTH COCA-COLA PORK LOIN",
  "image": "https://scontent.ford1-1.fna.fbcdn.net/v/t1.0-9/13882683_1765451550376367_4151059472297084043_n.jpg?oh=2bbb498b140722e3128d0ff0032516b5&oe=581F0328",
  "href": "https://www.facebook.com/photo.php?fbid=1765232357064953&set=a.1389992667922259.1073741826.100007346172893&type=3&theater",
  "extension": "Chrome",
  "firstAdded": "2016-08-09T02:25:28.035000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine all the ingredients except for the meat, to form a marinade. Set the pork roast in a plastic bag with a zip-type seal, pour in the marinade and seal the bag. Set the plastic bag in a serving bowl large enough to steady the roast and keep the marinade ingredients from spreading away from the roast.",
    "Let stand for 24 hours or overnight in the refrigerator, patting and turning the bag every few hours to ensure the meat marinates evenly. This helps the roast absorb the marinating liquids and creates a tender, juicy and flavorful roast.",
    "Remove roast from marinade and discard the marinade. Place roast, fat side up, on rack in roasting pan. Insert roast meat thermometer so the bulb is centered in the thickest part. Do not add water. Do not cover. Roast in a slow 325 degree preheated oven until the thermometer registers to 175 degrees. Allow 30 to 40 minutes per pound for roasting, so for a 5 pound loin roast, you would be roasting for about 2-1/2 to 3 hours. During last 1/2 hour of cooking time, brush on the glaze. If you prefer, you can just as easily cook on the grill or in the smoker. Remove from the oven and out of the pan onto a platter; cover with foil tent to seal steam and rest the meat 15 minutes before slicing and this results in a much juicier roast. NOTE: Alternatively, you can slow-roast. Instead of roasting at 325, use a slow oven at 250 - 275 degrees, and allow almost twice as long. The meat will be even more tender. Use your meat thermometer or whatever means you like to achieve desired doneness.",
    "Glaze",
    "Sea salt and fresh ground pepper",
    "Mix together all ingredients in sauce pan; simmer and stir to thicken. Brush or spoon glaze on meat frequently during cooking. You can also serve any remaining sauce with the sliced pork if you like.",
    "Janet's Appalachian Kitchen."
  ],
  "ingredients": [
    "0",
    "1/4 cup soy sauce",
    "1 cup Coca-Cola",
    "1/2 cup dark brown sugar",
    "2 tablespoons Dijon mustard",
    "3 tablespoons oil",
    "2 tablespoons Worcestershire sauce",
    "1/3 cup ketchup",
    "2 cloves garlic, minced",
    "1 tablespoon dry mustard",
    "2 tablespoons balsamic vinegar",
    "1 teaspoon ginger",
    "1 teaspoon thyme, crushed",
    "5 pounds pork loin roast, boned & rolled",
    "Glaze",
    "1 cup brown sugar",
    "1 tablespoon cornstarch",
    "1/2 teaspoon dry mustard",
    "2 tablespoons butter",
    "1/3 cup balsamic vinegar",
    "2/3 cup Coca-Cola",
    "Sea salt and fresh ground pepper",
    "."
  ],
  "__v": 3
}