{
  "hash": "6f6ce434b665f36a6789cbe1c32d1c094b4fb04a",
  "title": "Spinach and Philly Lasagne",
  "image": "http://images.sweetauthoring.com/recipe/6750_593.jpg",
  "href": "https://www.philadelphia.co.uk/recipes/Spinach%20and%20Philly%20Lasagne?r=6750",
  "extension": "Chrome",
  "firstAdded": "2015-08-30T16:30:59.438000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "onion",
    "garlic",
    "clove",
    "celery",
    "carrots",
    "tomato",
    "tins",
    "tomatoes",
    "frozen",
    "spinach",
    "philadelphia",
    "light",
    "parmesan",
    "cheese",
    "mint",
    "leaves",
    "lasagne",
    "sheets"
  ],
  "directions": [
    "0",
    "For the tomato sauce; soften the onion, celery, carrot and garlic in the olive oil. It`s best to do this over a really low heat - try not to let them colour.",
    "Stir in the tomato puree and continue cooking for another 5 minutes before adding the tinned tomatoes. Simmer for about 20 minutes in an uncovered pan. Then, using a liquidiser or hand held blender, puree the sauce until smooth - it should be pretty thick and cooked.down. Add a pinch of sugar if the tomatoes taste acidic.",
    "While the sauce is cooking, make the spinach filling. Put the frozen spinach int a pan and warm until it has defrosted. Drain off any additional liquid. Leave on one side to cool.",
    "Heat the oven to 180 °C/gas 4.",
    "Put the Philadelphia Light in a separate bowl an stir until smooth, then add the spinach, half the parmesan and the chopped mint.",
    "Spread a thin layer of tomato sauce in an ovenproof dish, followed by a layer of the spinach mixture topped with the lasagne sheets. Continue repeating the process, ending with a layer of tomato sauce.",
    "Sprinkle the top with the remaining Parmesan and bake the lasagne for bout 30 minutes until bubbling and golden on top. Serve with salad and crusty bread."
  ],
  "ingredients": [
    "0",
    "Ingredients for 6",
    "1 tbsp olive oil",
    "1 onion, chopped",
    "1 large garlic clove, crushed",
    "2 sticks celery, finely chopped",
    "2 small carrots, finely chopped",
    "1 tbsp tomato purée",
    "800 g tins chopped tomatoes",
    "1000 g frozen spinach",
    "300 g Philadelphia Light",
    "3 tbsp grated Parmesan cheese",
    "2 tbsp mint leaves, chopped",
    "10 lasagne sheets"
  ],
  "__v": 2
}