{
  "hash": "93f66b7e392b4f70aa7eb950063f00757e41356e",
  "title": "vegetarian cabbage soup",
  "image": "https://alexandracooks.com/wp-content/uploads/2017/11/bowlofcabbagesoup680-1-150x150.jpg",
  "href": "https://alexandracooks.com/2017/11/03/cabbage-soup-updated-no-bacon-vegetable-stock/",
  "extension": "Chrome",
  "firstAdded": "2019-01-08T01:41:25.065000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place cabbage in a large bowl. Bring enough water to a boil — I fill a tea kettle, but you could always fill a large sauce pan — to submerge the cabbage in the bowl. Pour the water over the cabbage; let sit one minute or longer; drain.",
    "Meanwhile, in a large pot, heat the oil over high heat until it shimmers. Add the onions, immediately turn the heat down to medium or low, and cook, stirring, until they are soft, about 15 minutes. Sprinkle with flour and stir. (Note: If you do not wish to add the flour, see the notes above for an alternative method for thickening the soup.) Add the broth or water, stirring rapidly with a wire whisk. When the mixture simmers, add the cabbage, carrots, potatoes, salt, pepper, caraway seeds, vinegar and sugar.",
    "Simmer, stirring every so often, for about about 30 minutes. Stir in the cream and simmer five minutes. Add the chopped dill to the pot. Taste and adjust as needed with more salt and pepper to taste. I typically add 1 to 2 teaspoons more salt, but I am a salt lover, so adjust as needed. Serve, adding more chopped dill to each bowl if desired."
  ],
  "ingredients": [
    "0",
    "12 cups shredded cabbage*",
    "1/4 cup olive oil",
    "2 to 3 cups finely diced onions",
    "1/2 cup flour, see notes above",
    "10 cups homemade vegetable stock or water, see notes",
    "2 cups finely diced carrots",
    "2 to 3 cups finely diced potatoes",
    "2 teaspoons kosher salt, plus more to taste",
    "freshly ground black pepper to taste",
    "2 teaspoons whole caraway seeds, crushed or pulverized",
    "1/4 cup white balsamic vinegar",
    "1 teaspoon sugar",
    "1 cup heavy cream",
    "1/4 cup finely chopped fresh dill (or more or less to taste)"
  ],
  "__v": 1
}