{
  "hash": "cfd06be359cc6006c6f9c75d470292e6c63e73a3",
  "title": "Golden Macaroni and Cheese",
  "image": "http://3.bp.blogspot.com/_4ClOFmBnEeU/SSBhmOi4QAI/AAAAAAAABi8/XVheFslzryA/s600/IMG_4133_edited.jpg",
  "href": "http://elizabethsedibleexperience.blogspot.co.il/2008/11/turkey-day-troubles-installment-2.html",
  "extension": "Chrome",
  "firstAdded": "2015-12-27T22:01:20.497000",
  "users": [
    null
  ],
  "keywords": [
    "elbow",
    "macaroni",
    "use",
    "milk",
    "allpurpose",
    "flour",
    "onion",
    "salt",
    "blocks",
    "divided",
    "sharp",
    "block",
    "extrasharp",
    "cheddar",
    "cheese",
    "soft",
    "recipe",
    "suggest",
    "store",
    "bought",
    "italian",
    "breadcrumbs",
    "plain",
    "margarine",
    "butter"
  ],
  "directions": [
    "0",
    "COOK macaroni according to package directions; drain well. Set aside.",
    "PLACE milk, flour, and onion salt in a quart jar; cover tightly, and shake vigorously 1 minute.",
    "STIR together flour mixture, 3 1/2 cups cheese, and macaroni.",
    "POUR macaroni mixture into a lightly greased 13x9 baking dish or 2 (11 inch) oval baking dishes.",
    "Sprinkle evenly with breadcrumbs and remaining 1 cup cheese; drizzle evenly with melted butter.",
    "BAKE at 350 degrees for 45 minutes or until golden brown.",
    "The easy method for making the thickener for the cheese sauce is the key to this recipe. You simply shake the ingredients in a jar - it is fool proof and fun! I know that Baked Macaroni and Cheese may not be the most traditional Thanksgiving side item, but I promise you it will be a hit if you decide to include it on your menu. The children at your dinner will be ecstatic, because what child doesn't love Mac n' Cheese? And the adults will be thankful for this classically rich dish as well."
  ],
  "ingredients": [
    "0",
    "1 (8-ounce) package elbow macaroni",
    "2 cups milk (I use whole milk)",
    "1/4 cup all-purpose flour",
    "1 teaspoon onion salt",
    "2 (10-ounce) blocks sharp Cheddar cheese, shredded and divided ( I use one block of Sharp Cheddar and one block of Extra-Sharp Cheddar cheese)",
    "1 cup soft plain breadcrumbs ( The recipe suggest homemade breadcrumbs, but I use store bought - not Italian breadcrumbs, just plain)",
    "1/4 cup butter or margarine, melted (I use butter)"
  ],
  "__v": 1
}