{
  "__v": 1,
  "directions": [
    "0",
    "To make the gingerbread cookie dough. In a small bowl combine the flour, whole wheat flour, baking soda, cinnamon, ginger, cloves, allspice and salt. Set aside.",
    "In a large mixing bowl (using a hand mixer) or bowl of a stand mixer cream together the the coconut oil and brown sugar, beating for about 3-4 minutes until light and fluffy. Add the molasses and egg, beat until combined. Gradually mix in the dry ingredients until no streaks are showing in the dough. Line two cookie sheets with parchment paper or a silpat.",
    "Remove the dough from the bowl and flour a clean work surface, and the dough. Roll it out as thin or thick as you like. If you want the cookies crisp roll thin and if you want them softer roll a thicker dough. Personally for this granola I thought somewhere in the middle of super thin and supper thick was good! Using a small ginger bread man (or girl!) cookie cutter. I used one from this pack -http://www.amazon.com/gp/product/B00004Y67U/ref=as_li_qf_sp_asin_il_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=B00004Y67U&linkCode=as2&tag=halbakhar-20",
    "Cut out shapes with a cookie cutter, cutting them as close to one another as possible to minimize waste.",
    "Transfer the cookies to the prepared cookie sheets. Cover the baking sheets and place them in the fridge while you make the granola.",
    "Preheat oven to 325 degrees F.",
    "In a large bowl combine the oats, shredded coconut, candid ginger pecans (almonds or macadamia nuts), pistachios, pumpkin seeds, wheat germ and cranberries. Toss well.",
    "Melt the coconut in the microwave for 30 seconds, stir in the molasses and maple syrup. Place the mixture back in the microwave for another 30 seconds. Sprinkle the espresso powder over top and stir to dissolve. Add the cinnamon, ginger and salt. Stir in the vanilla.",
    "Pour the warm mixture over the dry oat mixture and stir to fully combine. I normally stir for a good 3 to 5 minutes.",
    "Spread the granola out on a parchment lined baking sheet with sides and drizzle with 2 tablespoons honey. Bake for 30 to 40 minutes stirring every 15 minutes so the granola will get evenly toasted. The last time you stir the granola drizzle it with the remaining 2 tablespoons honey. Remove from the oven and let cool five minutes. Up the oven temperature to 350 degrees F.",
    "After 5 minutes spray the bottom of a flat 1 cup measuring cup or a flat bottomed glass with cooking spray. Press the granola into the pan using the bottom of the measuring cup so that you have a flat slab of granola that looks like they could be cut into bars. Let the granola sit for one hour to cool and harden. After an hour break the granola up into clusters.",
    "While the granola cools bake the gingerbread cookies. Remove the pans from the fridge and bake the cookies just until they're slightly brown around the edges 8 to 12 minutes, or until they feel firm. Let the cookies cool completely before tossing with the granola.",
    "When everything is cool toss about half the cookies or however many you wish with the granola. Enjoy!"
  ],
  "firstAdded": "2014-08-18T20:43:48.667000",
  "hash": "984f898c5d5b81281132d1b2c0cd93b68d58180a",
  "href": "http://www.halfbakedharvest.com/gingerbread-boy-granola/",
  "image": "http://hbh.halfbakedharvest.netdna-cdn.com/wp-content/uploads/2013/12/Gingerbread-Man-Granola-11.jpg",
  "ingredients": [
    "0",
    "3/4 cup flour",
    "3/4 cup white whole wheat flour or whole wheat pastry flour",
    "1/2 teaspoon baking soda",
    "1/2 teaspoon cinnamon",
    "1/2 teaspoon ground ginger",
    "1/4 teaspoon ground cloves",
    "1/4 teaspoon allspice",
    "1/4 teaspoon salt",
    "6 tablespoons coconut oil, at room temperature",
    "1/4 cup brown sugar",
    "1/3 cup molasses",
    "1 egg yolk",
    "3 cups oats",
    "1 cup shredded unsweetened flaked coconut",
    "1/2 cup candid ginger",
    "1/2 cup pistachios",
    "1/2 cup pecans, almond or macadamia nuts",
    "1 cup raw pumpkin seeds (pepitas)",
    "1/4 cup toasted wheat germ",
    "1 cup dried cranberries",
    "1/4 cup molasses",
    "1/2 cup pure maple syrup",
    "4 tablespoon coconut oil, melted (may sub butter)",
    "3 teaspoon instant espresso powder",
    "1 teaspoon cinnamon",
    "3/4 teaspoon ginger (use 1 teaspoon for a better ginger flavor!)",
    "1/2 teaspoon salt",
    "1 teaspoon vanilla extract",
    "4 tablespoons honey"
  ],
  "keywords": [
    "flour",
    "white",
    "wheat",
    "pastry",
    "baking",
    "soda",
    "cinnamon",
    "ginger",
    "allspice",
    "salt",
    "coconut",
    "oil",
    "room",
    "brown",
    "sugar",
    "molasses",
    "egg",
    "yolk",
    "oats",
    "flaked",
    "candid",
    "pistachios",
    "pecans",
    "almond",
    "macadamia",
    "nuts",
    "raw",
    "pumpkin",
    "seeds",
    "pepitas",
    "germ",
    "cranberries",
    "maple",
    "syrup",
    "sub",
    "butter",
    "instant",
    "espresso",
    "use",
    "better",
    "flavor",
    "vanilla",
    "honey"
  ],
  "title": "Gingerbread Man Granola",
  "users": [
    null
  ]
}