{
  "hash": "83920271bb82b228e16e86d391bd08834ff5a721",
  "title": "Copycat Sour Cherry Pie FillingSour Cherry Spoon Cake (Vegan, Gluten Free)",
  "image": "http://i2.wp.com/willfrolicforfood.com/wp-content/uploads/2015/06/sour-cherry-spoon-cake-gluten-free-vegan-4230.jpg?resize=685%2C457",
  "href": "http://willfrolicforfood.com/2015/06/sour-cherry-spoon-cake-vegan-gluten-free.html",
  "extension": "",
  "firstAdded": "2015-11-11T16:39:10.963000",
  "users": [
    null
  ],
  "keywords": [
    "sour",
    "cherries",
    "coconut",
    "turbinado",
    "sugar",
    "depending",
    "vanilla",
    "lemon",
    "zest",
    "arrowroot",
    "brown",
    "rice",
    "flour",
    "white",
    "almond",
    "meal",
    "tapioca",
    "works",
    "called",
    "mochiko",
    "psyllium",
    "work",
    "baking",
    "soda",
    "salt",
    "oil",
    "redwhite",
    "wine",
    "vinegars",
    "apple",
    "cider",
    "vinegar",
    "preferably",
    "nondairy",
    "milk",
    "soy",
    "oat",
    "flake",
    "sunflower",
    "seeds",
    "cherry",
    "using",
    "deep",
    "pie",
    "dish",
    "use",
    "filling"
  ],
  "directions": [
    "0",
    "Add your cherries, sugar, vanilla, and lemon zest to a large sauce pot and simmer for 10-15 minutes on medium high heat.",
    "Pour the arrowroot powder into a medium bowl.",
    "Add 1 cup of the hot cherry juice from the sauce pot to the arrowroot and whisk to combine, making sure you've removed all lumps. The mix should be glossy and even.",
    "Add the arrowroot and juice mixture to the pot of cherries, whisking everything together as you pour it in.",
    "Give the pot another couple of stirs to make sure the arrowroot is totally incorporated.",
    "Cook 1 minute further, stirring occasionally, then cut off the heat.",
    "To store, pour the cherry pie filling into heat safe mason jars and cap, or pour into another heat-safe glass container with a lid and cover. Let cool to room temperature, then store in the fridge. Keeps up to 1 week in the fridge.",
    "*To can your pie filling, check out The Kitchn's resources on canning basics.",
    "1",
    "Grease a 9\" tart pan with ½ teaspoon of coconut oil. Set aside. Preheat the oven to 350F.",
    "In a medium mixing bowl, combine the brown rice, white rice, almond, tapioca, and sweet rice flours with the psyllium, baking powder, baking soda, sugar, and salt. Mix evenly.",
    "Add the wet ingredients directly to the flour mix: melted coconut oil, vanilla, vinegar, and non-dairy milk. Stir together until your batter is smooth and there are no lumps.",
    "Stir in the flake coconut and sunflowers seeds.",
    "Set aside for 10 minutes (this allows the psyllium to saturate).",
    "Spoon your pie filling into your tart pan and spread it out to fill the bottom of the pan.",
    "Pour the cake batter over the filling, spreading it gently overtop without stirring the two together.",
    "Bake 25-30 minutes, until the cake is golden brown and a knife inserted in the center comes out clean.",
    "Let cool to room temperature before serving (with ice cream!)"
  ],
  "ingredients": [
    "0",
    "4-5 cups pitted sour cherries",
    "1.5-2 cups coconut sugar or turbinado sugar (depending on how sweet you like it)",
    "optional: 1 tablespoon vanilla extract",
    "optional: 1 tablespoon lemon zest",
    "¾ cups arrowroot powder",
    "1",
    "60 grams / ½ cup brown rice flour",
    "40 grams / ¼ cup white rice flour",
    "40 grams / ½ cup almond meal",
    "20 grams / ¼ cup tapioca flour (arrowroot flour also works)",
    "20 grams / ⅛ cup sweet rice flour (also called mochiko rice flour)",
    "2 tablespoons psyllium (ground and whole both work)",
    "1 teaspoon baking powder",
    "½ teaspoon baking soda",
    "110 grams / ¾ cup coconut sugar or turbinado sugar",
    "pinch salt",
    "½ cup coconut oil, melted",
    "2 teaspoons pure vanilla extract",
    "1 teaspoon vinegar (red/white wine vinegars or apple cider vinegar preferably)",
    "¾ cup non-dairy milk (almond, soy, oat, coconut, etc.)",
    "¾ cup unsweetened flake coconut",
    "¼ cup sunflower seeds",
    "2 cups cherry pie filling (if using a deep pie dish you can use more filling)"
  ],
  "__v": 1
}