{
  "hash": "d2a5e1b47cd58bc6731cdad63d7052eeb4305a23",
  "title": "Chicken Cannelloni with Pancetta",
  "image": "http://www.recipe30.com/wp-content/uploads/2017/02/chicken-cannelloni-848x477.jpg",
  "href": "http://www.recipe30.com/chicken-cannelloni-with-pancetta.html/",
  "extension": "Chrome",
  "firstAdded": "2017-04-07T18:01:34.139000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Wash leek, trim off the green part (keep for soup or other) trim the root end. Split in half, cut lengthwise and chop finely. Place a pot on moderate heat, add 2 tbsp olive oil, minced garlic and sweat for 3 minutes.",
    "Cut up the pancetta in lardons add to chopped leek, chop the sage (keep 20 leaves for later) and add to mixture. Cook 2 minutes.",
    "Mince your chicken thighs (skip this step if using bought chicken mince) using a food processor. Add to your leek mixture with salt and pepper, break up any chicken chunks and cook for 5 more minutes. Turn off heat and leave to cool. (you can refrigerate once cool enough).",
    "For the white cheese sauce, add the butter to a saucepan on moderate heat. Once butter has melted, add the flour, turn heat to low and continue stirring over heat with a wooden spoon for 3 minutes. Add one third of the milk and continue mixing using a whisk until mixture is smooth. It will turn into a thick paste, then add another third of the milk, keep whisking, repeat process one more time with remaining milk and keep whisking until velvet smooth. Add some freshly grated nutmeg, salt and pepper and half the grated Parmesan cheese.",
    "To your cooled down chicken filling mixture, add the ricotta cheese and two whole happy eggs. Mix well, set aside.",
    "On a large baking dish, coat the bottom with one third of the white sauce.",
    "If using a disposable pipping bag, cut off the tip with a knife or scissors, it should be small enough to fit in pasta tubes. Fold back the sides and add the mixture. Twist the top and squeeze bag until mixture reaches the end of the tip. Tear off a small piece of aluminium foil. Pick up a pasta tube, place the foil in your hand and place the pasta tube on the foil holding with one hand. Fill the tube by inserting the pipping bag tip and squeezing. Feel completely ensuring their are no gaps.",
    "Place all the filled cannelloni tubes into the baking dish allowing a small space between each one. Once the dish if full, cover with the white sauce. If the sauce has set, reheat it so it pours nicely. Top with grated Parmesan cheese and bake for 40 min at 320°F – 160°C.",
    "In a frying pan, add 2 tbsp olive oil, once hot, add the fresh sage leaves and fry until crisp. Should take approx 60 seconds if oil is hot enough. Remove cannelloni from oven and scatter some of the sage leaves on top. Leave to cool 10 to 15 minutes before serving."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "4 chicken thighs (or 1lb - 500g chicken mince)",
    "1 leek",
    "2 garlic cloves",
    "7 oz - 200g pancetta",
    "1 bunch of sage (approx 40 leaves)",
    "1 cup of ricotta cheese",
    "2 whole happy eggs",
    "8 to 12 cannelloni tubes depending on size (I used 10)",
    "Salt and Pepper",
    "4 tbsp olive oil"
  ],
  "__v": 1
}