{
  "hash": "5a2d68c5439d125ca362c8c184898ca45d877469",
  "title": "BABY BACK BBQ RIBS",
  "image": "http://img.cooks.com/i/rec/IMG_2789-200.jpg",
  "href": "http://www.cooks.com/rec/story/217/",
  "extension": "Firefox",
  "firstAdded": "2015-06-14T11:24:27.466000",
  "users": [
    null
  ],
  "keywords": [
    "kosher",
    "salt",
    "paprika",
    "granulated",
    "garlic",
    "onion",
    "cumin",
    "seed",
    "durkee",
    "ancho",
    "pepper",
    "dry",
    "mustard",
    "black",
    "red",
    "wine",
    "vinegar",
    "water",
    "soy"
  ],
  "directions": [
    "0",
    "Cook ribs over indirect heat (250°F-300°F) for 3-4 hours. Hickory, mesquite, apple or other fruit wood may soaked in water and tossed in small quantities over the hot coals periodically during the cooking in order to impart a smoky flavor. You will need to also add more charcoal to the fire as the cooking progresses in order to maintain temperature.",
    "After 3 or 4 hours of slow barbequing, arrange the ribs on a shallow-sided disposable aluminum pan and mop them on both sides with the mixture below. Cook for another hour, mop again, turn. Baste the ribs and check the coals at least once every hour for the next 3-4 hours.",
    "Baste on both sides well with your preferred BBQ sauce (we make our own molasses-based sauce), sprinkle lightly with garlic and onion powder, and wrap each rack of ribs well (straight from the grill) in heavy duty aluminum foil. Allow to rest in the foil for 30 minutes. If the coals are nearly out by now, it's ok to rest the ribs on the edges of the grill away from the coals.",
    "When ribs are done, they will be fall-off-the-bone tender, and the meat will have shrunken away from the ends of the bone by 1/4-inch or so.",
    "Total cooking time is approximately 4-8 hours but this will vary according to your grill and the size of the rib rack (s) being cooked. The ribs are done when falling-off-the-bone tender and you just can't wait any longer!"
  ],
  "ingredients": [
    "0",
    "2 tbsp. kosher salt",
    "2 tbsp. paprika",
    "4 tbsp. granulated garlic",
    "1 tbsp. onion powder",
    "1 tsp. cumin seed",
    "1 tsp. Durkee Ancho pepper",
    "2 tsp. dry mustard",
    "2 tsp. black pepper",
    "1 cup red wine vinegar",
    "1 tablespoon garlic",
    "1 cup water",
    "3 tablespoons soy sauce"
  ],
  "__v": 1
}