{
  "hash": "2a8a6d960637fa4c286c5ba1ff0cb64583100d1c",
  "title": "Creamy Cinnamon Apple and Walnut Fruit Salad",
  "image": "http://www.cookingclassy.com/wp-content/uploads/2016/08/creamy_cinnamon_apple_fruit_salad4..jpg",
  "href": "http://www.cookingclassy.com/2016/08/creamy-cinnamon-apple-walnut-fruit-salad/",
  "extension": "Chrome",
  "firstAdded": "2016-08-16T03:12:53.883000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the dressing:",
    "In a mixing bowl using an electric hand mixer, whip together Neufchatel cheese, brown sugar, cinnamon and nutmeg on high speed until light and fluffy, about 3 minutes. Add sour cream and vanilla and blend until combined. Chill until ready to serve salad.",
    "For the salad:",
    "In a medium mixing bowl combine water and lemon juice. Dice apples into cubes, while cutting out core, and as your cutting them in batches dump them into the lemon water mixture and let rest about 1 minute then drain on paper towels (this just reduces the browning). Transfer apples to a bowl along with about 3/4 of the walnuts and 3/4 of the cranberries, and the Neufchatel cheese mixture. Toss to coat apples evenly. Sprinkle remaining 1/4 of the walnuts and cranberries over top. Keep chilled and serve within an hour for best results*.",
    "*The dressing can be made a day in advance just don't cut the apples until your almost ready to serve this. Also, it makes a big batch so if you aren't serving that many you can cut the recipe in half.",
    "Recipe source: Cooking Classy"
  ],
  "ingredients": [
    "0",
    "1 (8 oz) pkg Neufchatel cheese, softened slightly",
    "1/2 cup packed light brown sugar",
    "2 tsp ground cinnamon",
    "1/8 tsp ground nutmeg",
    "1 (8 oz) pkg light sour cream",
    "1 tsp vanilla extract",
    "4 lbs crisp, sweet apples, chilled (I used a combo of Gala, Jazz and Golden Delicious)",
    "2 cups cold water, for soaking apples",
    "2 Tbsp fresh lemon juice, for soaking apples",
    "1 cup chopped Fishers Walnuts",
    "3/4 cup dried cranberries"
  ],
  "__v": 1
}