{
  "hash": "bbeb03f07726bbfc32252e18f1121062394680f5",
  "title": "Roasted Salmon With Jalapeño, Honey and Lime",
  "image": "https://static01.nyt.com/images/2019/12/11/dining/lh-chile-and-honey-roasted-salmon/merlin_165684687_b76a3730-bb9c-44d6-9b56-fae20467eb5f-articleLarge.jpg",
  "href": "https://cooking.nytimes.com/recipes/1020713-roasted-salmon-with-jalapeno-honey-and-lime?em_pos=medium&ref=headline&nl_art=4&te=1&nl=cooking&emc=edit_ck_20200219&campaign_id=58&instance_id=16085&segment_id=21410&user_id=4264688f24592aeeb06433e5d96d7150&regi_id=79859114emc=edit_ck_20200219",
  "extension": "Firefox",
  "firstAdded": "2020-02-25T00:38:54.305000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the oven to 400 degrees. While the oven heats, combine the honey, jalapeños, vinegar and soy sauce in a small saucepan. Bring to a boil, then turn the heat to low and simmer for 10 minutes. Set aside.",
    "Pat the salmon fillets dry using paper towels. Brush a 9-by-9-inch baking pan (or other similar-size baking pan or dish) with olive oil, then place the fillets in the pan, arranging them evenly without crowding. Brush the fillets generously with olive oil and sprinkle with salt. Pour the glaze and jalapeños over the salmon, spooning some of the glaze onto the fish as it collects in the bottom of the pan.",
    "Roast the salmon for 6 minutes, then baste with the glaze. Return to the oven and roast until the salmon is cooked through but still slightly rare in the center, another 6 to 8 minutes.",
    "Spoon the glaze in the pan over the salmon, then squeeze the lime over the salmon, and sprinkle with salt and cilantro, if using. Serve hot with rice on the side, pouring any glaze that remains in the pan over the rice."
  ],
  "ingredients": [
    "0",
    "¼",
    "cup honey",
    "3",
    "medium jalapeños, thinly sliced crosswise into rings",
    "2",
    "tablespoons apple cider vinegar or rice wine vinegar",
    "1",
    "tablespoon soy sauce or tamari",
    "4",
    "(6-ounce) skin-on salmon fillets, about 1-inch thick",
    "Olive oil, for brushing",
    "Kosher salt, to taste",
    "½",
    "lime, for serving",
    "Chopped fresh cilantro, for serving (optional)",
    "Steamed rice, for serving"
  ],
  "__v": 1
}