{
  "hash": "c8ef98bf89bc16bcf3eaa0181a440e69b10e3221",
  "title": "SPIRALIZED SHANGHAI BEEF AND BROCCOLI",
  "image": "https://www.skinnytaste.com/wp-content/uploads/2015/02/SpiralizedShanghaiBeefandBroccoli-170x255.jpg",
  "href": "https://www.skinnytaste.com/spiralized-shanghai-beef-and-broccoli/print/",
  "extension": "Chrome",
  "firstAdded": "2018-07-19T20:00:46.361000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine the hoisin, orange juice and soy sauce with a whisk and reserve. Add sirloin steaks to marinade and refrigerate for 2 hours.",
    "While steaks are marinating, bring a large pot of water to a boil. Place the broccoli in a wire basket and cook for about 3 to 4 minutes at a slow boil to blanch. Remove from pot and place in ice water to stop the cooking process. Let sit in ice bath for a couple minutes until chilled.",
    "Remove steak from refrigerator and allow to come to room temperature for about 5 minutes before cooking. Remove from marinade, reserving the marinade for later.",
    "Heat a medium nonstick sauté pan on high heat, spray with oil when hot then place the steaks and cook 3 minutes on each side (for medium-rare). Transfer to a cutting board.",
    "Add the reserved marinade to the skillet, reduce heat to medium-low, bring to a boil and simmer 2 to 3 minutes.",
    "While the steaks are cooking, place the sesame oil in a large nonstick skillet, add the onions, garlic and ginger and cook on high 1 to 2 minutes. Add the broccoli noodles, season with salt and cook 3 minutes. Add the blanched broccoli and cook until hot.",
    "Divide the zoodles unto 2 separate plates. Place the beef on a cutting board and cut into thin strips. Lay steak on top of the noodles, top with sauce and serve."
  ],
  "ingredients": [
    "0",
    "1/4 cup hoisin sauce",
    "1/4 cup fresh squeezed orange juice",
    "2 tbsp reduced sodium soy sauce",
    "2 (6 oz total) 2-inch thick broccoli stems, spiralized",
    "cooking spray",
    "(2) 5 ounce sirloin steaks, 1” thick",
    "2 cups broccoli florets",
    "1 teaspoon aji sesame oil",
    "1/4 large white onion, julienned",
    "1 tablespoon garlic, minced",
    "1 tablespoon fresh ginger, minced"
  ],
  "__v": 1
}