{
  "hash": "a19661656f433da1bea8b23eee65532cde47dd03",
  "title": "Mantou (Chinese Steamed Bun)",
  "image": "http://cdn4.yireservation.com/wp-content/uploads/2015/12/IMG_5938_500.jpg?x48477",
  "href": "http://yireservation.com/recipes/mantou-chinese-steamed-bun/",
  "extension": "Chrome",
  "firstAdded": "2017-05-22T20:14:20.726000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Activate the yeast by combining the yeast with lukewarm water for about 5 minutes. The mixture will become milky and bubbly.",
    "In a bread machine or stand mixer, add the flour, baking powder, salt, and sugar. Turn on the bread machine / stand mixer, and slowly add the activated yeast and milk/water.",
    "When adding the milk/water, do it slowly and in batches. Also slowly add the cooking oil. Continue to knead for about 10 to 15 minutes as a dough ball is formed. Pay close attention to the texture of the dough. If it’s hard, add a little more water/milk. If it’s too wet or the surface is sticky, add a little more flour. At the end you should see a smooth, soft, but non-sticky dough ball.",
    "Cover the dough with plastic wrap and side aside to rest. Depending on the room temperature, let the dough rest for 45 – 60 minutes or until the dough doubles the size. If the dough smells very sour, add a tiny portion of baking soda to reduce the sourness. Turn on the bread machine/ stand mixer once again and knead for about 5 minutes until smooth dough is formed.",
    "Place the dough on a flour-covered work station, cut the dough into two halves.",
    "Roll each half of the dough into a long log about 1.5 inch in diameter. Flatten the log using a rolling pin.",
    "Lightly brush some water on the flat dough. Starting from one side of the flat dough, roll the dough towards the other end to form a log.",
    "Remove the ends of the log and cut the remaining log into 4 equal pieces or the size of your choice. Repeat the previous 3 steps for the half of the dough. Place each piece in a wax-paper-covered steamer.",
    "Do not steam the dough right away. Loosely cover the dough with a damped towel and let the dough rest and rise for about 30 minutes. The dough should become 1.5x the original size. Finally steam the dough over boiling water for 12 to 15 minutes. After you turn off the heat keep the lid on for extra five minutes to prevent the buns from becoming saggy."
  ],
  "ingredients": [
    "0",
    "400g All purpose flour",
    "1 tsp instant yeast",
    "30ml lukewarm water",
    "200ml milk or water +/- 10ml",
    "½ tsp baking powder",
    "1tbsp cooking oil",
    "40g sugar",
    "2g salt",
    "1/10 tsp baking soda (optional)"
  ],
  "__v": 1
}