{
  "hash": "6f5cb3e6f7bb27b47b49151d2d31df09289138ec",
  "title": "Perfect Peach Iced Tea",
  "image": "http://cdn.minimalistbaker.com/wp-content/uploads/2014/06/Perfect-Peach-Iced-Tea-So-easy-and-perfect-for-hot-summer-days-by-the-pool.jpg",
  "href": "http://minimalistbaker.com/perfect-peach-iced-tea/",
  "firstAdded": "2015-02-18T04:22:41.477000",
  "users": [
    null
  ],
  "keywords": [
    "organic",
    "cane",
    "sugar",
    "water",
    "peaches",
    "loose",
    "leaf",
    "black",
    "tea",
    "depending",
    "strong",
    "prefer",
    "filtered"
  ],
  "directions": [
    "0",
    "Bring sugar, water and peaches to a boil in a small saucepan. Then lower heat and use a wooden spoon to stir and crush the peaches to infuse the flavor.",
    "Once the sugar is dissolved, cover, remove from heat and let steep for for 25-30 minutes.",
    "In the meantime, brew your tea using either a large pot or a tea maker. I use this loose leaf tea steeper from IngenuiTEA. NOTE: Use less tea if you prefer it weaker, or more tea if you prefer it stronger, and try not to let it steep longer than 4-5 minutes or it can get bitter.",
    "Once brewed, remove tea bags or strain out loose leaf tea and transfer to a pitcher. Refrigerate to cool.",
    "Once your simple syrup is finished, pour into a bottle or container over a fine mesh strainer to strain out peaches. You can reserve the peaches for later use, such as to place over oats or ice cream sundaes.",
    "To serve, either set out simple syrup and add as much to the tea as you like, or add all of the simple syrup to the tea and stir. I prefer leaving it separate. Serve tea over ice and fresh sliced peaches. Yields about 10 servings (with ice and peaches)."
  ],
  "ingredients": [
    "0",
    "1 cup organic cane sugar",
    "1 cup water",
    "2 ripe peaches, thinly sliced + more for serving",
    "1",
    "2-3 Tbsp loose leaf black tea (3-4 tea bags), depending on how strong you prefer it",
    "8 cups filtered water"
  ],
  "__v": 1
}