{
  "hash": "5a50108f57d2f16487b9a24e57bbca0594dc8c8c",
  "title": "Color Changing Galaxy Cocktail",
  "image": "https://sofabfood.com/wp-content/uploads/2018/12/Galaxy-Cocktail-800x-overhead.jpg",
  "href": "https://sofabfood.com/galaxy-cocktail-color-changing-cocktail/",
  "extension": "Chrome",
  "firstAdded": "2020-01-08T13:59:41.909000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "To Make Blue Butterfly Pea Flower Simple Syrup:",
    "Brew 1 cup of Blue Butterfly Pea Flower Tea with 3 tablespoons food-grade, edible Blue Butterfly Pea Flowers, and boiling water.",
    "Add 1 cup granulated white sugar.",
    "To Make the Cocktail:",
    "Build the cocktail up with your chilled glass filled with ice cubes. Add the simple syrup, then the vodka, and then finish with the club soda.",
    "Sprinkle pomegranate seeds, place the rosemary sprig and straws for serving. Drizzle honey over the top and sprinkle sparkling sugar.",
    "When you want to change the color from blue to purple-pink, add a squeeze of lemon or lime juice (or both) and stir. Enjoy!",
    "Notes",
    "Home Chef Tip: 1) Use a honey dipper to get a perfect drizzle. 2) Chill the glass in the freezer for 5-10 minutes before making the cocktail which helps keep the recipe cold. 3) You can store any remaining simple syrup in the refrigerator in an air-tight container for up to two weeks."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "For the Simple Syrup:",
    "1 cup water",
    "Blue Butterfly Pea Flower Tea",
    "3 tbsp food-grade, edible Blue Butterfly Pea Flowers",
    "For the Galaxy Cocktail:",
    "1-2 shots vodka (1.5 ounce each)",
    "2-3 tbsp Blue Butterfly Pea Flower Simple Syrup, amount to taste",
    "Splash of club soda or seltzer water, amount to taste",
    "1-2 sprigs rosemary",
    "Pomegranate seeds",
    "Lemon and lime wedges for squeezing",
    "Lime and lemon slices",
    "Sparkling sugar (or any coarse raw sugar)"
  ],
  "__v": 1
}