{
  "hash": "a475fa296025cc5a6ccfa552f6c0c1eb27a9b2f0",
  "title": "Утка по-пекински",
  "image": "http://www.gastronom.ru/binfiles/images/00000004/s_00030152.jpg",
  "href": "http://www.gastronom.ru/recipe/6180/utka-po-pekinski",
  "extension": "Chrome",
  "firstAdded": "2016-01-21T20:45:18.774000",
  "users": [
    null
  ],
  "keywords": [],
  "directions": [
    "0",
    "Шаг 1 Замороженную утку необходимо разморозить. Лучше сделать это постепенно. Сначала вынуть ее из морозильной камеры и сутки подержать в холодильнике при температуре +3...+4°С. Потом еще на 10-12 часов оставить ее оттаивать при комнатной температуре. Когда утка окончательно разморозится, отрезать ножом или ножницами для птицы верхние фаланги крыльев.",
    "Шаг 2 Уберите с утки весь лишний жир - его больше всего в районе шеи и гузки. Жир, который находится под кожей, после правильной обработки растопится и вытечет во время запекания в духовке.",
    "Шаг 3 Готовить утку нужно начиная за сутки до ее подачи на стол. Вскипятите чайник, подвечьте утку за шею (лучше на крюк, но можно и просто держать вертикально) и обдайте ее крутым кипятком так, чтобы кожа утки побелела.",
    "Шаг 4 Дайте воде стечь, промокните утку досуха бумажным полотенцем. Возьмите сухой херес или китайское рисовое вино, натрите им утку снаружи и внутри. Оставьте ее полежать 5-10 мин.",
    "Шаг 5 Возьмите крупную морскую соль и натрите ею утку - снаружи и внутри. После этого утку нужно на 12 часов поместить в холодильник, ничем не закрывая. Лучше всего, если она будет находиться в вертикальном положении - подвешенная или насаженная на бутылку. Из утки будет вытекать кровь, так что под нее нужно поставить тарелку.",
    "Шаг 6 Через 12 часов выньте уткук из холодильника и смажьте ее снаружи медом. Мед должен быть распределен по поверхности тонким равномерным слоем. Снова положите ее в холодильник (опять-таки предпочтительно в вертикальном положении) - пусть она подсыхает еще 12 часов.",
    "Шаг 7 Нагрейте духовку до 190°С. Положите утку грудкой вверх на решетку, под которой закреплен противень. Налейте в противень стакан холодной воды и накройте утку фольгой так, чтобы плотно закрытой оказалась вся конструкция вместе с противнем. Поставьте ее а разогретую духовку на 1 час.",
    "Шаг 8 Смешайте имбирь с кунжутным маслом, перцем и соевым соусом так, чтобы получилась густая масса. Выньте утку из духовки, снимите фольгу и уберите противень с жидкостью, Кисточкой равномерно обмажьте утку получившейся массой. Увеличьте температуру духовки до 260°С. Поместите утку на решетке обратно в духовку на 25 мин. Следите, чтобы она не пригорела!",
    "Шаг 9 Выньте утку из духовки и смажьте смесью 2 ст. л. меда и 1 ст. л. соевого соуса. Выключите огонь и включите гриль. Поставьте утку на решетке в нижнюю часть духовки на 5-10 мин. до образования хрустящей корочки. Выньте утку из духовки, дайте остыть. Аккуратно срежьте все мясо с костейи порежьте его небольшими кусочками, чтобы корочка оказалась на каждом.",
    "Шаг 10 Приготовьте тесто для блинчиков. Смешайте муку с водой и яйцом так, чтобы не было комочков. Помешивая, постепенно добавьте молоко и растительное масло. Мелко порежьте зеленый лук и положите его в готовое тесто. Выпекайте очень тонкие блинчики (лучше взять сковороду с антипригарным покрытием, чтобы жарить бех масла).",
    "Шаг 11 Порежьте зеленый лук. Огурцы очистите от кожуры и семян, порежьте тонкими длинными полосками и оставьте на бумажном полотенце, чтобы стек лишний сок. Возьмите блинчик, смажьте небольшим количеством соуса хой-син, сверху положите начинку - лук, огурец и утку, сверните блинчик."
  ],
  "ingredients": [
    "0",
    "соус хой-син",
    "огурцы – 1 шт. большого размера",
    "зеленый лук – 2 больших пучка",
    "яйцо – 1 шт.",
    "мука – 1 чашка",
    "молоко – 2/3 чашки",
    "масло растительное – 2 ст. л.",
    "утка – 2,5-3 кг",
    "херес или рисовое вино – 1/4 стакана",
    "соль морская",
    "мед – 4 ст. л.",
    "масло кунжутное – 1 ст. л.",
    "соус соевый – 5 ст. л.",
    "имбирный порошок – 1 ст. л.",
    "перец черный свежемолотый – 1 ст. л.",
    "вода – 1 чашка"
  ],
  "__v": 1
}