{
  "hash": "17fc5fceb7dde5cb6ff5f43f47523b47711f1658",
  "title": "Toasted Farro Salad with Roasted Leeks and Root Vegetables",
  "image": "https://images.food52.com/2b9JPp7_8aGqBjUhp4qYNxrrVfo=/753x502/52a3a9d1-8c92-49cf-842f-b3d7cdcfdbcc--toasted_farro_roast_vegetable_salad20.jpg",
  "href": "https://food52.com/recipes/34082-toasted-farro-salad-with-roasted-leeks-and-root-vegetables",
  "extension": "",
  "firstAdded": "2018-01-28T22:09:45.371000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 400° F. Move oven shelf to the top third of the oven. For easy cleanup, line one large and one small baking sheet with parchment.",
    "Trim the dark green section from the leeks, and halve lengthwise. Immerse leeks in water and shake out any sand and excess water. Trim the roots, and cut each half into 3-inch segments. In a medium-sized bowl, toss the leeks with 2 tablespoons olive oil, sea salt, and pepper. Spread the leeks out on the small baking sheet.",
    "In the same bowl used for the leeks, toss the turnip and rutabaga half moons with 1 tablespoon olive oil, sea salt, and black pepper. Spread out on the large baking sheet.",
    "Slide both baking sheets into the oven and roast for 20 minutes. Use a spatula to flip the turnips and rutabagas. The leeks should roast for 20 to 25 minutes, or until quite soft with browned edges. Roast the turnips and rutabagas until edges are nicely browned, 30 to 35 minutes total.",
    "Meanwhile, cook the farro. Set a large pot of salted water over high heat to boil. Set a large skillet over medium-high heat, add the dry farro, and, shaking the pan frequently, toast just until farro browns slightly and is fragrant, about 2 minutes. Add farro to the salted water and simmer for 20 minutes, or until farro still has a little bite. Drain, toss with 2 tablespoons lemon juice and 3 tablespoons minced parsley, and set aside.",
    "Toss the farmer's cheese with 2 tablespoons olive oil, lemon zest, sea salt, pepper, and a tablespoon each minced parsley and dill.",
    "To plate the salad, toss the farro with the roasted turnips and rutabagas. Top with roasted leeks, crumbled farmers cheese, and remaining dill and parsley, and toss gently."
  ],
  "ingredients": [
    "0",
    "2 leeks",
    "2 medium turnips, trimmed, peeled, and sliced into 1/2 inch-thick half moons",
    "1 large rutabaga, trimmed, peeled, and sliced into 1/2 inch-thick half moons",
    "1/4 cup extra-virgin olive oil, divided",
    "Sea salt, to taste",
    "Ground black pepper, to taste",
    "3/4 cup dry farro",
    "Zest of 1 lemon plus 2 tablespoons juice",
    "1/4 cup minced parsley, divided",
    "2 tablespoons minced dill, divided",
    "1/4 cup crumbled farmer's cheese"
  ],
  "__v": 1
}