{
  "hash": "d56931b77587edf5addc0b3c61da83a1f9ff0de2",
  "title": "Gluten Free Vegan Peanut Butter Cups (V, GF, DF)",
  "image": "https://beamingbaker.com/wp-content/uploads/2016/08/Gluten-Free-Vegan-Peanut-Butter-Cups-V-GF-DF-1.jpg",
  "href": "https://beamingbaker.com/gluten-free-vegan-peanut-butter-cups-v-gf-df/",
  "extension": "Chrome",
  "firstAdded": "2017-10-11T15:55:53.370000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Line a standard 12-cup muffin pan with cupcake liners. Set aside. Clear some space in the freezer for the muffin pan.",
    "Make the peanut butter filling: In a small bowl, whisk together peanut butter, maple syrup and coconut flour. Whisk until well incorporated.",
    "Cover the bowl and place into the freezer for 15-20 minutes—this allows the peanut butter filling to chill and harden for easier molding.",
    "Remove bowl from the freezer. Scoop 2 teaspoons of peanut butter filling into your hands and press into a flat disc. Repeat until you've made 12 peanut butter discs.",
    "Make the chocolate: Two methods for making the chocolate coating: Use the double boiler method or the microwave method. For the microwave method: in a medium, microwave safe bowl, add chocolate chips and coconut oil. Place in the microwave and heat for 30 seconds. Stir. Heat again in 20-30 second increments until the chocolate chips are just softened. Be careful not to overheat. Remove from the microwave and stir until smooth.",
    "Make the peanut butter cups: Drop 2 teaspoons of melted chocolate into each muffin cup. Lightly tap the pan to smooth chocolate into an even layer, filling the bottom of the cup. Gently lay a peanut butter disc flat on top of the melted chocolate layer. Repeat until each cup has a peanut butter disc.",
    "Spoon 1 tablespoon of melted chocolate over the peanut butter disc. Gently spread until you get an even top. Repeat until you have finished making every cup.",
    "Place muffin pan into freezer. Freeze for 15-20 minutes.",
    "Remove from the freezer. Peel off cupcake liners. Allow to thaw for 10-20 minutes. Enjoy!"
  ],
  "ingredients": [
    "0",
    "½ cup unsalted, natural peanut butter*",
    "1 tablespoon pure maple syrup",
    "1 tablespoon coconut flour",
    "1",
    "2 cups vegan chocolate chips",
    "2 tablespoons coconut oil"
  ],
  "__v": 1
}