{
  "hash": "1cc9f955bbd340f136fa988a3a1632d20dc02ee3",
  "title": "Garlicky Kale Burgers",
  "image": "http://myzone.7kfuffpuegx.netdna-cdn.com/wp-content/uploads/2016/06/kale-burgers-3.jpg",
  "href": "http://www.connoisseurusveg.com/garlicky-kale-burgers/",
  "extension": "",
  "firstAdded": "2016-08-26T20:45:56.779000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Clean and remove stems from kale, then tear the leaves into 2 inch pieces. Place into a steaming device of your choice (stovetop or microwave), and steam until leaves are just wilted and bright green, about 5 minutes.",
    "Place kale leaves into food processor bowl, along with beans, 1 cup panko, sunflower seeds, basil, garlic and lemon juice. Pulse a few times until well blended, stopping to scrape down sides of bowl as needed. Add up to an additional ¼ cup of panko if mixture seems too soft. Season the mixture with salt and pepper to taste.",
    "Shape the mixture into 4 to 6 patties.",
    "Lightly oil the bottom of a medium skillet and place over medium heat. Working in batches if needed, place patties into skillet and cook until browned on bottoms, about 4 minutes. Flip and cook until browned on opposite sides, about 4 minutes more.",
    "Stuff into buns and top with toppings of choice. Serve."
  ],
  "ingredients": [
    "0",
    "½ lb. curly kale (about 1 small bunch or ½ of a large bunch)",
    "1-15 oz. can cannellini beans, drained and rinsed",
    "1 to 1¼ cups panko breadcrumbs",
    "½ cup roasted sunflower seeds",
    "½ cup fresh basil leaves, lightly packed",
    "4 garlic cloves, minced (or more, if you want your burger very garlicky!)",
    "2 tbsp. lemon juice",
    "salt and pepper to taste",
    "oil, for grilling",
    "1",
    "4 to 6 burger buns",
    "4 to 6 lettuce leaves, or a few handfuls of shredded lettuce",
    "1 large tomato, sliced",
    "1 medium onion, sliced (I like mine sautéed too)",
    "vegan mayo"
  ],
  "__v": 1
}