{
  "hash": "8169d7c2a9599bed5f9b1486f2716e87009178e6",
  "title": "Shakshuka",
  "image": "http://www.seriouseats.com/recipes/assets_c/2016/09/20160926-shakshuka-17-thumb-1500xauto-434268.jpg",
  "href": "http://www.seriouseats.com/recipes/2016/09/shakshuka-north-african-shirred-eggs-tomato-pepper-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2017-05-06T23:48:45.250000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat olive oil in a large, deep skillet or straight-sided sauté pan over high heat until shimmering. Add onion, red pepper, and chili and spread into an even layer. Cook, without moving, until vegetables on the bottom are deeply browned and beginning to char in spots, about 6 minutes. Stir and repeat. Continue to cook until vegetables are fully softened and spottily charred, about another 4 minutes. Add garlic and cook, stirring, until softened and fragrant, about 30 seconds. Add paprika and cumin and cook, stirring, until fragrant, about 30 seconds. Immediately add tomatoes and stir to combine (see note above). Reduce heat to a bare simmer and simmer for 10 minutes, then season to taste with salt and pepper and stir in half of cilantro or parsley.",
    "Using a large spoon, make a well near the perimeter of the pan and break an egg directly into it. Spoon a little sauce over edges of egg white to partially submerge and contain it, leaving yolk exposed. Repeat with remaining 5 eggs, working around pan as you go. Season eggs with a little salt, cover, reduce heat to lowest setting, and cook until egg whites are barely set and yolks are still runny, 5 to 8 minutes.",
    "Sprinkle with remaining cilantro or parsley, along with any of the optional toppings. Serve immediately with crusty bread."
  ],
  "ingredients": [
    "0",
    "3 tablespoons extra-virgin olive oil, plus more for drizzling",
    "1 medium onion, thinly sliced",
    "1 large red pepper (stems, seeds, and ribs removed) thinly sliced",
    "1 fresh small hot chili (stems, seeds, and ribs removed) thinly sliced",
    "2 to 3 cloves garlic, thinly sliced",
    "1 1/2 tablespoons sweet Hungarian or smoked Spanish paprika",
    "2 teaspoons whole or ground cumin seed",
    "1 28-ounce can whole peeled tomatoes",
    "Kosher salt and freshly ground black pepper",
    "Large handful minced cilantro, parsley, or a mix",
    "6 eggs",
    "Sliced oil-cured black olives, feta cheese, or artichoke hearts, for serving (all optional)",
    "Crusty bread, for serving"
  ],
  "__v": 2
}