{
  "hash": "eba4348deebe6f08b3c75eabbd98da39217436ab",
  "title": "PASTA WITH HOT ITALIAN SAUSAGE, KALE, GARLIC, AND RED PEPPER FLAKES",
  "image": "https://k8643br9gv-flywheel.netdna-ssl.com/wp-content/uploads/2011/08/1-550-pasta-sausage-kale-500x500-kalynskitchen-1-300x300.jpg",
  "href": "https://kalynskitchen.com/recipe-for-pasta-with-hot-italian/",
  "extension": "Chrome",
  "firstAdded": "2020-01-06T23:20:11.779000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the 1 or 2 tsp. olive oil in a small frying pan, squeeze sausage out of casings, and cook until sausage is nicely browned, breaking apart with a turner as it cooks. (If you use hot turkey Italian sausage you’ll need 2 tsp. of olive oil; sausage with more fat will not need as much oil.)",
    "While the sausage is cooking, wash kale leaves and shake dry (they don’t need to be perfectly dry.) Pile up a stack of leaves and then thinly slice them crosswise, continuing until you have about 12 cups of thinly sliced kale leaves.",
    "Slice the garlic cloves and then coarsely chop.",
    "In a large heavy frying pan (big enough to hold all the pasta when it’s cooked) put the 3 T olive oil, garlic, and hot pepper flakes.",
    "Turn heat to medium and cook until you can barely start to smell garlic, then add the thinly sliced kale. (Don’t let the garlic brown.) Cook kale and garlic 2-3 minutes, turning over several times, until the kale is all wilted.",
    "Add chicken stock or broth and cooked sausage to the kale and lower heat to a gentle simmer. Let this simmer while you cook the pasta.",
    "Fill a medium-large pot half full with water, add a generous amount of salt, and bring the water to a boil.",
    "Add pasta, stir, lower heat, and cook until barely al-dente, following package directions for cooking times. (I cooked the Dreamfields Rotini exactly 9 minutes.) Save 1/2 cup pasta cooking water, then drain pasta.",
    "Gently mix the cooked pasta into the sausage/kale mixture, adding as much pasta cooking water as you think you need for it to be moist enough. (I used about half the water.)",
    "Then mix in the Parmesan cheese and serve pasta hot, with extra Parmesan cheese to add at the table."
  ],
  "ingredients": [
    "0",
    "3 links (12 oz) hot Italian sausage (use hot turkey Italian sausage for South Beach Diet)",
    "8 oz. kale leaves, thinly sliced (about 12 cups thinly sliced kale)",
    "6 large garlic cloves, coarsely chopped (I would not use garlic from a jar for this recipe)",
    "3 T + 1-2 tsp. olive oil",
    "1/4 tsp. red pepper flakes (use more or less to taste)",
    "2 cups homemade chicken stock or 1 can chicken broth",
    "1 pkg. (13.25 oz.) Dreamfields Rotini pasta (or use your favorite whole wheat, gluten-free, or regular pasta in a shape like this)",
    "salt for pasta cooking water (at least 1 T)",
    "1/2 cup coarsely grated Parmesan cheese, plus more for serving"
  ],
  "__v": 1
}