{
  "hash": "35f3622fc824f7980a0413f9f8858510d97e99ef",
  "title": "Sweet potato, peanut butter & chilli quesadillas",
  "image": "//www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe/recipe-image/2016/12/vegan-quesadillas.jpg?itok=BmIbCLf1",
  "href": "https://www.bbcgoodfood.com/recipes/sweet-potato-peanut-butter-chilli-quesadillas",
  "extension": "Firefox",
  "firstAdded": "2017-05-01T12:00:38.975000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat oven to 200C/180C fan/gas 6. Toss the sweet potatoes with the paprika and 2 tbsp olive oil in a roasting tin. Roast for 15 mins, tossing halfway through, until the potatoes are beginning to crisp.",
    "Stone, peel and chop the avocado, tip into a bowl with the lime juice and zest, and season generously. Mash together with a fork and set aside. In a small bowl, combine the peanut butter and remaining olive oil. Set aside.",
    "Heat a griddle pan or frying pan over a medium heat until very hot. Brush each tortilla on one side with the remaining oil. Place one tortilla, oiled-side down, in the pan and spread over half the peanut butter mixture, half the sweet potatoes, a little chilli sauce and half the coriander. Top with another tortilla, oiled-side up. Press down with a heavy saucepan and cook for 2-3 mins each side until the quesadilla is crisp outside and warm in the middle. Repeat to make a second quesadilla, then cut each into quarters and serve with the crushed avocado and lime wedges."
  ],
  "ingredients": [
    "0",
    "sweet potatoes Sweet potato sweet po-tate-toeSweet potatoes have a creamy texture and a sweet-spicy flavour that makes them ideal for savoury…",
    "olive oil Olive oil ol-iv oylProbably the most widely-used oil in cooking, olive oil is pressed from fresh olives. It's…",
    "avocado Avocado av-oh-car-dohAlthough it's technically a fruit, the mild-flavoured avocado is used as a vegetable. Native…",
    "lime Lime ly-mThe same shape, but smaller than…"
  ],
  "__v": 1
}