{
  "hash": "a330983f47e7f334947adec902095d6fed51997b",
  "title": "Pinsa Romana (Roman-Style Pizza)",
  "image": "https://media2.s-nbcnews.com/j/newscms/2020_08/1541473/anthony-scotto-today-main-200221-2_d496524060dda09f9b877ede5c40ecf2.today-inline-large.jpg",
  "href": "https://www.today.com/recipes/pinsa-romana-roman-style-pizza-recipe-t174404",
  "extension": "Chrome",
  "firstAdded": "2020-02-22T02:58:52.243000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparation",
    "For the pinsa dough:",
    "1. In a large bowl, combine all-purpose flour, rice flour, spelt, wheat flour, rye flour and yeast.",
    "2. Continuously whisking, slowly add cold water.",
    "3. Add extra virgin olive oil and salt. Mix well. Cover the bowl with plastic wrap ora lid and let rest for 30 minutes. Mix again and let rest for another 30 minutes.",
    "4. Mix with a wooden spoon for the third time.",
    "5. Now cover again with a plastic wrap or a lid and place the bowl in the fridge for at least 24 hours.",
    "6. After the dough has chilled, turn the bowl upside down and let the dough come out of the bowl.",
    "7. Divide the dough into two parts. Using your hands, form a round ball out of each piece of the dough.",
    "8. Cut two rectangular pieces of parchment paper that fit your baking sheet.",
    "9. Place each dough ball on a parchment paper and dust with rice flour.",
    "10. Cover the dough with a linen towel and let rise for 1 hour.",
    "11. After letting the dough rest, pour a drizzle of extra-virgin olive oil on each piece of the dough and, using your fingers, press into the dough stretching it from center to sides, forming an oval pinsa shape.",
    "To assemble:",
    "1. Preheat oven to 450°F. Transfer parchment paper with pinsa onto a baking sheet.",
    "2. Drizzle with some more olive oil.",
    "3. Bake in a lower third of a preheated oven for about 10 minutes.",
    "4. Remove from the oven and top with mozzarella and tomato sauce. Return to the oven and bake pizzas on the middle rack until pinsa has browned on the edges and cheese has melted.",
    "5. Garnish with chopped parsley and freshly ground pepper."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "PINSA DOUGH",
    "2 cups all-purpose flour",
    "½ cup whole wheat flour",
    "1/2 cup rice flour",
    "1 cup cold water",
    "1 teaspoon salt",
    "½ cup spelt flour",
    "½ cup rye flour",
    "1/2 teaspoon dry yeast",
    "1 tablespoon extra-virgin olive oil, plus more for rubbing",
    "PINSA TOPPING",
    "12 ounces mozzarella cheese",
    "4 tablespoons tomato sauce",
    "Fresh parsley, chopped",
    "Extra-virgin olive oil",
    "Salt and freshly ground black pepper, to taste"
  ],
  "__v": 1
}