{
  "__v": 1,
  "directions": [
    "0",
    "Heat the dried chiles (anchos, pasillas, costenos, guajillos and chiles de arbol) in a dry, cast-iron skillet on medium for a couple of minutes on each side. Turn off the heat and then add enough water to the skillet to cover the chiles, and let them soak for half an hour.",
    "Meanwhile, in a large heavy pot, such as a Dutch oven, fry up your bacon. When done, remove from pan and crumble (Don’t worry if you opt to eat a slice—you deserve it!) and leave the bacon grease in the pot (it should be about 3) tablespoons. In the pot, cook your beef in the bacon grease on medium heat, a few minutes on each side until lightly browned. You will probably have to cook these in two batches.",
    "Remove the browned beef from the pot, and add your onions. Cook on medium until clear. Add the garlic and cook for another minute. Put the beef back in the pot, and mix in the coffee, the beer, two cups of water, bacon crumbles and the dry spices. Turn the heat up to high.",
    "Your soaking chiles should be soft by now. Drain them and discard the soaking water (it will be bitter) and place them in a blender along with the canned chipotle chiles and one cup of fresh water. Puree until nice and smooth and then add the chile puree to the chili pot.",
    "When chili begins to boil, turn heat down to low and let simmer for five hours, stirring occasionally. Taste it once an hour, and if the flavors are too muted, feel free to add more of any of the spices. Also, it starts to get too dry, add more liquid (your choice!).",
    "After five hours, take a Mexican hot chocolate disc, and finely grate 1/3 of it into the pot. Scoop out 1 cup of broth and add the masa harina. Mix it well and then reincorporate it back into the pot. Stir until chili is thickened.",
    "Let the chili simmer for another half hour or so. When done, serve with cheddar, onions and tortillas.",
    "Note: If you can't find all of these chiles, I would just use the more readily available anchos and chipotles. I'd use 6-8 anchos, following the same soaking and pureeing method, and two chipotles."
  ],
  "firstAdded": "2014-08-16T22:46:31.281000",
  "hash": "7f6971e4f43ed303f729c3713b88cfa76c3f703c",
  "href": "http://www.homesicktexan.com/2009/02/more-precise-texas-chili-recipe.html",
  "image": "http://4.bp.blogspot.com/_eOBTgTn007E/SYmRi5S9oTI/AAAAAAAABks/Xk-IR6CvOic/s400/chili_DSC3882.jpg",
  "ingredients": [
    "0",
    "6 anchos",
    "2 pasilla",
    "2 costeñas",
    "2 guajillos",
    "4 chiles de arbol",
    "4 pieces of bacon",
    "4 pounds of chuck roast, cut into 1/4 inch cubes",
    "1 large onion diced",
    "6 cloves of garlic, crushed",
    "1 cup of brewed coffee",
    "1 bottle of beer",
    "2 cups of water",
    "1/2 tsp cinnamon",
    "1/2 tsp clove",
    "1/2 tsp allspice",
    "1 tsp coriander",
    "1/2 tsp cayenne",
    "1 tablespoon cumin",
    "(For all spices, please feel free to add more to taste throughout cooking if you like.)",
    "2 chipotles in adobo",
    "Salt to taste",
    "1/4 cup masa harina",
    "1/3 Mexican hot chocolate tablet, grated"
  ],
  "keywords": [
    "anchos",
    "pasilla",
    "costeas",
    "guajillos",
    "chiles",
    "arbol",
    "pieces",
    "bacon",
    "chuck",
    "roast",
    "cubes",
    "onion",
    "garlic",
    "brewed",
    "coffee",
    "bottle",
    "beer",
    "water",
    "cinnamon",
    "clove",
    "allspice",
    "coriander",
    "cayenne",
    "cumin",
    "spices",
    "feel",
    "free",
    "cooking",
    "chipotles",
    "adobo",
    "salt",
    "masa",
    "harina",
    "mexican",
    "hot",
    "chocolate",
    "tablet"
  ],
  "title": "Texas chili",
  "users": [
    null
  ]
}