{
  "hash": "2043a6682aae4023409dad881964d9da156c772d",
  "title": "Pineapple-Chipotle Grilled Short Ribs",
  "image": "",
  "href": "http://www.tastingtable.com/chefs_recipes/chefs_recipes/how-to-make-pineapple-chipotle-grilled-short-ribs-recipe",
  "firstAdded": "2015-02-06T03:06:38.521000",
  "users": [
    null
  ],
  "keywords": [
    "pineapple",
    "juice",
    "soy",
    "worcestershire",
    "lime",
    "brown",
    "sugar",
    "ginger",
    "roughly",
    "garlic",
    "clove",
    "cumin",
    "chipotle",
    "peppers",
    "adobo",
    "korean",
    "flankenstyle",
    "short",
    "ribs",
    "plum",
    "tomato",
    "jalapeo",
    "red",
    "onion",
    "extravirgin",
    "olive",
    "oil",
    "cilantro",
    "kosher",
    "salt"
  ],
  "directions": [
    "0",
    "Make the short ribs: In a food processor or a blender, blend together the pineapple juice, soy sauce, Worcestershire sauce, lime juice, sugar, ginger, garlic, cumin and chipotles until blended into a smooth sauce. Reserve about ⅓ cup for serving, then pour the rest into a large bowl or baking dish. Add the short ribs, making sure to coat both sides of each piece with the sauce. Set aside.",
    "While the meat marinates, make the pico de gallo: In a mixing bowl, combine all the ingredients, season with salt and set aside.",
    "Heat a gas grill or grill pan to high heat. Grill the short ribs, flipping once, until each side is nicely charred and the meat is cooked to your desired doneness, 2 to 3 minutes per side, or 6 to 7 minutes per side on a grill pan on the stove, for medium rare. Remove the short ribs and let them rest for a few minutes before cutting each short rib into sections around each bone.",
    "Drizzle the short ribs with the reserved marinade and serve with pineapple pico de gallo.",
    "Note: For maximum flavor, let the meat marinate overnight in the refrigerator. Take it out 30 minutes before grilling to take the chill off."
  ],
  "ingredients": [
    "0",
    "¾ cup pineapple juice",
    "⅓ cup soy sauce",
    "¼ cup Worcestershire sauce",
    "¼ cup fresh lime juice",
    "½ cup brown sugar",
    "One 1-inch piece fresh ginger, peeled and roughly chopped",
    "1 garlic clove, peeled",
    "2 teaspoons ground cumin",
    "3 chipotle peppers in adobo",
    "3 pounds Korean or flanken-style short ribs, cut ½ inch thick",
    "1½ cups diced fresh pineapple",
    "1 plum tomato, diced (about ⅓ cup)",
    "1 jalapeño, minced",
    "¼ of a red onion, diced (about ¼ cup)",
    "3 tablespoons fresh lime juice",
    "3 tablespoons extra-virgin olive oil",
    "2 tablespoons finely chopped cilantro",
    "Kosher salt, to taste"
  ],
  "__v": 1
}