{
  "hash": "6fe4b6f4578ab1420f53d830598533caea840620",
  "title": "Pull-Apart Vanilla-Wafer Cupcake Cake with Berries",
  "image": "https://assets.marthastewart.com/styles/wmax-750/d60/pull-apart-vanilla-wafer-cupcake-cake-with-berries-103293959/pull-apart-vanilla-wafer-cupcake-cake-with-berries-103293959_horiz.jpg?itok=hpRAY5na",
  "href": "https://www.marthastewart.com/1528363/pull-apart-vanilla-wafer-cupcake-cake-berries",
  "extension": "Chrome",
  "firstAdded": "2020-01-05T21:15:13.251000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 degrees. Line a standard muffin tin with paper liners. Whisk together cookie crumbs, flour, baking powder, and salt.",
    "Beat butter with granulated sugar on medium speed until pale and fluffy, about 1 minute. Beat in eggs, one at a time. Reduce speed to low and add flour mixture in 3 batches, alternating with milk, beginning and ending with flour mixture and beating until combined after each addition. Fold in coconut.",
    "Divide batter among cups. Bake until cupcakes are golden brown and centers bounce back when gently pressed, 22 to 24 minutes. Let cool completely in tin on a wire rack.",
    "Add 2 tablespoons water to a small saucepan. Sprinkle with gelatin; let stand until thick, about 5 minutes. Gently heat over medium until gelatin has dissolved. Remove from heat; let cool 5 minutes (but don't let it set).",
    "Beat together cream, confectioners' sugar, and vanilla on medium speed until very soft peaks form, 1 to 2 minutes. Add gelatin mixture; beat on medium until stiff peaks form, about 1 minute more.",
    "Remove cupcakes from tin and arrange on a platter in a three-by-four rectangle. Spoon frosting over each row of cupcakes; using an offset spatula, smooth to cover tops, forming a rectangular shape. Refrigerate at least 1 hour and up to 3 hours. Sprinkle with berries before serving."
  ],
  "ingredients": [
    "0",
    "45 vanilla-wafer cookies, pulsed in a food processor until finely ground (1 1/2 cups)",
    "1/2 cup unbleached all-purpose flour",
    "1 teaspoon baking powder",
    "1/4 teaspoon kosher salt",
    "1 stick unsalted butter, softened",
    "3/4 cup granulated sugar",
    "2 large eggs, room temperature",
    "3/4 cup whole milk",
    "1 cup sweetened shredded coconut",
    "1 teaspoon unflavored gelatin",
    "1 cup cold heavy cream",
    "2 tablespoons confectioners' sugar",
    "1/4 teaspoon pure vanilla extract",
    "1 1/2 cups mixed fresh berries, such as blueberries, raspberries, and blackberries"
  ],
  "__v": 3
}