{
  "hash": "3e90f65e725f9c9c936862d74da9dd9b0dde51dd",
  "title": "Bizcocho Genovés",
  "image": "http://elrincondelaurag.com/wp-content/uploads/2014/04/bizcocho-genoves-4.jpg",
  "href": "http://elrincondelaurag.com/receta-de-bizcocho-basico-bizcochuelo-casero/",
  "extension": "Chrome",
  "firstAdded": "2015-08-20T12:20:15.001000",
  "users": [
    null
  ],
  "keywords": [
    "tip",
    "puedes",
    "hacerlo",
    "chocolate",
    "simplemente",
    "reemplazando",
    "parte",
    "polvo",
    "por",
    "ejemplo",
    "aadir",
    "cacao",
    "quitar",
    "gramos",
    "harina",
    "ingredientes",
    "para",
    "bizcocho",
    "bizcochuelo",
    "tamao",
    "normal",
    "huevos",
    "grandes",
    "temperatura",
    "ambiente",
    "del",
    "tiempo",
    "azcar",
    "comn",
    "trigo"
  ],
  "directions": [
    "0",
    "Como ves no lleva levadura ni polvo leudante ni bicarbonato. La esponjosidad se consigue con el método mecánico o método italiano antiguo que es batiendo mucho mucho los huevos con el azúcar metiendo muchas burbujas de aire en la masa. Este método lo usaban antiguamente los pasteleros italianos cuando no se había inventado el baking powder o polvos leudantes para repostería Royal y no usaban levadura porque deja el característico sabor a pan en las comidas.",
    "El bizcocho se puede hacer del tamaño que quieras añadiendo o quitando según la siguiente proporción: para cada huevo tamaño grande lleva 30 gramos de azúcar y 30 gramos de harina… si quieres un bizcocho más grande o más chico sólo tienes que re-calcular las cantidades con esas proporciones y siempre sale estupendo.",
    "Necesitarás un molde del tamaño deseado, ya sea redondo o rectangular al que tendrás que untar con mantequilla y espolvorear con harina. También puedes usar un papel de hornear en el fondo del molde y en los laterales para facilitar el desmoldado.",
    "Enciende el horno a temperatura mediana para que esté listo y precalentado para cuando tengas la masa. Si es un horno de gas al menos tiene que estar encendido 15 minutos antes de meter el bizcocho. Si es un horno eléctrico con 5 minutos será suficiente.",
    "Si te has olvidado de sacar los huevos del frigo puedes pasarlos por agua caliente del grifo para que tomen temperatura ambiente.",
    "Vamos con la receta. Lo primero que tienes que hacer es poner en un bowl o cuenco los huevos con el azúcar."
  ],
  "ingredients": [
    "0",
    "Tip: Puedes hacerlo de chocolate, simplemente reemplazando parte de la harina por cacao en polvo (por ejemplo añadir 60 gramos de cacao y quitar 60 gramos de harina).",
    "Ingredientes para un bizcocho o bizcochuelo de tamaño normal:",
    "5 huevos grandes (L) a temperatura ambiente / del tiempo",
    "150 gramos de azúcar común",
    "150 gramos de harina de trigo común 0000"
  ],
  "__v": 1
}