{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 375 degrees. Corn tip: break cobs in half and then cut the kernels off with a sharp knife. This gives you a stable base for cutting and more control when removing the kernels. Line a rimmed half sheet pan with parchment paper or foil and place the corn kernels in an even layer on the pan. Roast in the oven for 30-40 minutes, tossing every 15 minutes or so until the kernels begin to brown and the roasted corn aroma fills your kitchen. Remove from the oven and let cool a bit.",
    "In a large bowl, combine the mayonnaise, cotija cheese, onion, cilantro, jalapeño, garlic and 1 teaspoon chili powder. Stir together well and add a pinch of sea salt. Add the slightly cooled and roasted corn and mix. Taste to see if more sea salt is needed. Before serving, crumble extra cotija cheese on top of the salad and a sprinkle of chili powder. Can be made the day before and kept in the refrigerator."
  ],
  "firstAdded": "2014-09-09T19:28:07.990000",
  "hash": "c436b5ae45e9ec3e3c5146cd740360c3a1d831be",
  "href": "http://www.dulanotes.com/mexican-street-corn-salad/",
  "image": "http://www.dulanotes.com/wp-content/uploads/2012/08/Mexicancornsalad6-632x419.jpg",
  "ingredients": [
    "0",
    "6 ears fresh corn, shucked and kernals cut off the cob",
    "3 tablespoons mayonnaise",
    "4 ounces cotija or feta cheese, finely crumbled, plus more for serving",
    "3/4 cup white onion, finely chopped",
    "3/4 cup fresh cilantro leaves, finely chopped",
    "1-2 jalapeño peppers, stem, seeds and inside rib removed and finely minced",
    "2 medium garlic cloves, grated or pressed",
    "2 limes, juiced",
    "1 teaspoon fresh chili powder, plus more for serving",
    "sea salt, to taste"
  ],
  "keywords": [
    "ears",
    "corn",
    "shucked",
    "kernals",
    "cob",
    "mayonnaise",
    "cotija",
    "feta",
    "cheese",
    "crumbled",
    "white",
    "onion",
    "cilantro",
    "leaves",
    "jalapeo",
    "peppers",
    "stem",
    "seeds",
    "inside",
    "rib",
    "medium",
    "garlic",
    "pressed",
    "limes",
    "juiced",
    "chili",
    "salt"
  ],
  "title": "Mexican Street Corn Salad",
  "users": [
    null
  ]
}