{
  "hash": "38d39383458d6c35833fa72fb1d8038e93026f67",
  "title": "Braised oxtail with basil dumplings",
  "image": "http://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--9053_11.jpg?itok=Sr90LZUc",
  "href": "http://www.bbcgoodfood.com/recipes/5534/braised-oxtail-with-basil-dumplings",
  "extension": "",
  "firstAdded": "2016-09-21T18:58:37.333000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat oven to 180C/fan 160C/gas 4. Season the flour with salt and pepper, then toss the oxtail in it until evenly coated. Heat the oil in a large flameproof casserole. Working in batches, brown the meat really well on all sides. Remove from the pan, then add the veg and garlic and fry for 3-4 mins until starting to colour. Stir in the tomato purée and herbs. Tip the meat back into the pan, pour over the wine, then crumble in the stock cube. Season, cover the pan and braise in the oven for 3 hrs until the meat is meltingly tender. Can be cooked up to 2 days ahead. If you make it ahead, chill in the fridge and lift any fat off the top before reheating.",
    "To make the dumplings, tip the flour and basil (reserving a few leaves for a garnish) into a food processor with a generous pinch of salt, then blitz until the basil is finely chopped. Add the butter and blitz until it’s the texture of breadcrumbs, then gradually add the egg whites until everything comes together. On a floured surface, roll the dumplings into small, walnut-size balls, then cover with a tea towel until ready to cook.",
    "To serve, bring a large pan of salted water to the boil. Simmer dumplings for 15 mins, then remove with a slotted spoon. While the dumplings are cooking, gently reheat the meat in the sauce. Serve a few chunks of meat in a soup bowl with a few dumplings, drizzled with olive oil and scattered with a few basil leaves."
  ],
  "ingredients": [
    "0",
    "2 tbsp plain flour",
    "2 oxtail, jointed and cut into pieces",
    "4 tbsp sunflower oil Sunflower oilA variety of oils can be used for baking. Sunflower is the one we use most often at Good Food as… , for frying",
    "2 onion Onion un-yunOnions are endlessly versatile and an essential ingredient in countless recipes. Native to Asia… , chopped",
    "3 carrot Carrot ka-rotThe carrot, with its distinctive bright orange colour, is one of the most versatile root… , cut into small chunks",
    "2 celery Celery sell-er-eeA collection of long, thick, juicy stalks around a central, tender heart, celery ranges in… sticks, cut into small chunks",
    "2 garlic clove, chopped",
    "2 tbsp tomato purée",
    "bay leaves and thyme sprigs, tied together",
    "1 bottle full-bodied red wine"
  ],
  "__v": 1
}