{
  "hash": "1152ae64a1e44f82612ecc65719dd3bb50932255",
  "title": "Soy-Glazed Sweet Potatoes with Sesame Seeds",
  "image": "http://1.bp.blogspot.com/_s--n1TR94Vs/SvDulE8ihrI/AAAAAAAAMek/pIZ6NsasiSU/s400/soy-sweet-potatoes-400x400-kalynskitchen.jpg",
  "href": "http://www.kalynskitchen.com/2009/11/recipe-for-soy-glazed-sweet-potatoes.html",
  "extension": "Chrome",
  "firstAdded": "2015-07-14T19:48:22.577000",
  "users": [
    null
  ],
  "keywords": [
    "medium",
    "orangefleshed",
    "store",
    "produce",
    "department",
    "probably",
    "calls",
    "yams",
    "theyre",
    "really",
    "potatoes",
    "black",
    "sesame",
    "seeds",
    "white",
    "color",
    "use",
    "green",
    "onions",
    "glaze",
    "oil",
    "splenda",
    "brown",
    "sugar",
    "verjuice",
    "rice",
    "vinegar",
    "dont",
    "care",
    "content",
    "mirin",
    "deborah",
    "madison",
    "garlic",
    "puree",
    "soy",
    "water"
  ],
  "directions": [
    "0",
    "Instructions:",
    "Preheat oven to 400F/205C. In a measuring cup combine the sesame oil, Splenda, sugar, Verjuice or rice vinegar, garlic puree, soy sauce, and water. Spray baking dish with non-stick spray or olive oil, using a dish with a lid if you have one.",
    "Cut pointed ends from sweet potatoes, then peel with a sharp vegetable peeler. Cut sweet potatoes in half lengthwise, then cut each half on the diagonal into slices about an inch thick. (Cut some of the larger slices in half again if you need to so you have same-size pieces.)",
    "Put sweet potatoes into a bowl or a plastic bag, then pour in glaze mixture and stir or turn over bag until the sweet potatoes are well-coated with the glaze mixture. Pour sweet potatoes and glaze into baking dish, cover, and bake 20 minutes.",
    "Remove cover stir, so potatoes are all basted with the glaze mixture, then set timer for 10 minutes and continue to stir and reset timer every 10 minutes. Total cooking time should be about 50 minutes, or until sweet potatoes are soft when pierced with a fork and lightly browned and glaze has all been absorbed.",
    "Garnish with black and white sesame seeds or green onions and serve hot."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "3-4 medium or 2-3 large orange-fleshed sweet potatoes (Your store produce department probably calls them yams or sweet yams, but they're really sweet potatoes!)",
    "1 tsp. black sesame seeds",
    "1 tsp. white sesame seeds",
    "(or use all one color sesame seeds or use sliced green onions as a garnish)",
    "Glaze Ingredients:",
    "1 T sesame oil",
    "1 T Splenda",
    "1 T brown sugar",
    "(or use 2 T Splenda or 2 T brown sugar)",
    "2 T Verjuice or rice vinegar (Or if you don't care about sugar content, use Mirin like Deborah Madison did.)",
    "1 T garlic puree",
    "3 T soy sauce",
    "1 T water"
  ],
  "__v": 1
}