{
  "hash": "799749fbca7a52169b58996fafa48434f92ba49b",
  "title": "Ramen Noodles With Spring Onions and Garlic Crisp",
  "image": "",
  "href": "https://www.bonappetit.com/recipe/ramen-noodles-with-spring-onions?utm_campaign=likeshopme&client_service_id=31198&utm_social_type=owned&utm_brand=ba&service_user_id=1.78e%2016&utm_content=instagram-bio-link&utm_source=instagram&utm_medium=social&client_service_name=bonappetitmag&supported_service_name=instagram_publishing",
  "extension": "Chrome",
  "firstAdded": "2020-04-28T10:40:37.114000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place half of spring onions in a large heatproof bowl and set a fine-mesh sieve on top; set aside. Combine remaining spring onions with ginger, garlic, and oil in a small saucepan. Set over medium-high and cook, stirring occasionally, until garlic is golden and scallions are beginning to crisp and turn golden brown, 8–10 minutes.",
    "Pour mixture through reserved sieve onto spring onions. Turn out garlic crisp in sieve onto paper towels to drain. Stir spring onions in bowl until just softened, about 1 minute. Stir in chile, herbs, soy sauce, vinegar, sesame seeds, pepper, salt, and sugar. Let dressing sit 10 minutes.",
    "Meanwhile, cook noodles according to package directions. Drain and rinse under warm water to get rid of any excess starch.",
    "Transfer noodles to bowl with dressing and add butter and half of garlic crisp; toss to coat noodles. Divide among bowls; top with remaining garlic crisp."
  ],
  "ingredients": [
    "0",
    "1 bunch spring onions or scallions, very thinly sliced, divided",
    "1 3\" piece ginger, peeled, thinly sliced",
    "4 garlic cloves, thinly sliced",
    "½ cup vegetable or sunflower oil",
    "½ serrano or other green chile, thinly sliced (with seeds)",
    "¼ cup finely chopped tender herbs (such as cilantro, mint, and/or basil)",
    "2 Tbsp. low-sodium soy sauce",
    "1 Tbsp. unseasoned rice vinegar",
    "1 Tbsp. toasted sesame seeds",
    "1 tsp. freshly ground black pepper",
    "½ tsp. kosher salt",
    "½ tsp. sugar",
    "2 5-oz. packages fresh wavy ramen noodles",
    "1 Tbsp. unsalted butter, cut into pieces"
  ],
  "__v": 1
}