{
  "hash": "ef83e159f1d26421c40db15ba9095a0cde0b70a5",
  "title": "Mushroom Spinach and Swiss French Bread Pizzas",
  "image": "http://www.budgetbytes.com/wp-content/uploads/2015/07/Spinach-Mushroom-Pizzas-text.jpg",
  "href": "https://www.budgetbytes.com/2015/07/mushroom-spinach-and-swiss-french-bread-pizzas/",
  "extension": "Chrome",
  "firstAdded": "2016-12-28T19:30:08.680000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Wipe the mushrooms clean, then slice thinly. Add 1 tablespoon of olive oil to a large skillet along with the minced garlic. Sauté the garlic over medium heat for one minute or just until fragrant. Add the sliced mushrooms and sauté for 3-5 minutes more, or until they are limp and dark brown (add a pinch of salt to help them release their moisture if needed).",
    "Add the frozen spinach to the skillet and continue to sauté until it is heated through. Season the mushrooms and spinach with salt and freshly cracked pepper to taste (I used about ¼ tsp salt and 10 cranks of a pepper mill.",
    "Adjust your oven rack so that the top of the French bread will be 5-6 inches from the broiler unit. Preheat the broiler on high for a few minutes. While it's heating, cut the loaf of French bread into two 8 inch sections, then slice each piece in half lengthwise to open like a sandwich.",
    "Line a baking sheet with foil. Place the pieces of French bread on the baking sheet open side up. Brush the remaining 2 tablespoons of olive oil over the open surface of the bread. Place the bread under the broiler for about 3 minutes, or just until it is golden brown.",
    "Top each piece of bread with ¼ of the spinach and mushroom mixture, and one piece of swiss. Return the topped bread to the oven and broil for 1-2 minutes, or just until the cheese is hot and bubbly. Watch them closely to prevent burning. Serve hot."
  ],
  "ingredients": [
    "0",
    "3 Tbsp olive oil, divided $0.48",
    "2 cloves garlic, minced $0.16",
    "8 oz. button mushrooms $1.99",
    "8 oz. frozen spinach $1.17",
    "salt & pepper to taste $0.05",
    "16\" loaf soft French bread $0.90",
    "4 slices Swiss cheese $1.01"
  ],
  "__v": 1
}