{
  "__v": 1,
  "directions": [
    "0",
    "One of most important bits of jam prep is to sterilise the jars you’ll be using. The way my Mum has always done it is to wash the jars and put them in a roasting tin (without their lids) then heat in the oven from cold to 100 degrees Celsius. In this case you’ll need five 200ml jars.",
    "I also put a plate in the fridge. Yeah, I know that sounds like a strange thing to do but you’ll see why further down.",
    "Now to prepare our ingredients. Trim and deseed the chillies then pulse in a blender. Remove any loose stalks from the crab apples and pierce the skin in several places.",
    "Add all of the ingredients to a large, heavy bottomed pan and bring to a rolling boil for around 15 minutes.",
    "Now here is where our plate comes in handy. Take a spoon and drop a small amount of jam on to the plate. After a minute or two, give the jam a gentle push with your finger. If the jam wrinkles or ‘skins up’, your jam is done. If not, keep checking every 5 minutes until you get it there.",
    "When your jam is done, remove the apples and skim any foam off the top. Take your jars out of the oven and ladle in the hot jam. Unless you have extraordinarily steady hands, you’ll probably need a funnel to do this, or failing that a jug.",
    "Screw the lids on tightly and leave to cool. If you hear loud pops, that’s a very happy jam noise -the buttons in the lid are inverting to show they’ve sealed. Wahoo!"
  ],
  "firstAdded": "2014-06-09T13:54:30.290000",
  "hash": "7c1b37999407091f6aa6ae65d3d6f652d35afe34",
  "href": "http://www.alifeofgeekery.co.uk/2013/09/sweet-sticky-chilli-jam.html",
  "image": "",
  "ingredients": [
    "0",
    "100g Chillies",
    "1.2kg Sugar",
    "470ml Apple cider vinegar",
    "About 8 small crab apples (or 3 large cooking apples)"
  ],
  "keywords": [
    "chillies",
    "sugar",
    "apple",
    "cider",
    "vinegar",
    "crab",
    "cooking",
    "apples"
  ],
  "title": "SWEET, STICKY, CHILLI JAM",
  "users": [
    null
  ]
}