{
  "hash": "2cd9257ae366fc3b8460f12c882e20acd056f5d9",
  "title": "Not Your Mother's Meatballs -- slow cooker recipe",
  "image": "https://2.bp.blogspot.com/-GwcD27uthzc/Tuy40DxaiKI/AAAAAAAAERI/S_Ry-BEw2_I/s400/slow+cooker+meatballs.JPG",
  "href": "http://www.ayearofslowcooking.com/2011/12/not-your-mothers-meatballs-slow-cooker.html",
  "extension": "Chrome",
  "firstAdded": "2016-12-12T14:29:48.561000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "The Directions.",
    "Use a 6-quart slow cooker. Spray the inside of your cooker with cooking spray, or rub it down with a bit of olive oil (don't go crazy, just a little glisten) and set aside. In a good-sized mixing bowl, combine the chopped parsley, ground beef, and diced bacon. Add in Parmesan cheese, breadcrumbs, eggs, and the dried spices. Combine well--- I'd use your hands (remove rings, wash appropriately, and all that good stuff that if I had a legal team they'd tell me to include).",
    "After the meat is mixed, line a cookie sheet with parchment paper or non-stick foil.",
    "Pour 1 cup of flour (I used rice flour) into a shallow dish (pie pan works great).",
    "Report this ad",
    "Roll meat into golfball-sized balls and then lightly dust each meat ball with flour before placing onto the lined cookie sheet.",
    "When all the meat is gone, put the whole cookie sheet into the freezer for 1 hour, or until completely frozen. It's okay to freeze overnight, if you'd like to break this into two days (put in sealed dish/tupperware if freezing for longer).",
    "Once your meatballs are frozen, place them one-by-one (this means don't dump!) into your lightly greased slow cooker. It's okay to stack them. In a small mixing bowl, whisk together the broth and tomato paste to create a gravy.",
    "Pour this evenly over the meatballs. Cover, and cook on low for 5 hours, or until the meatballs have browned and are fully cooked. I cooked the meatballs pictured above on low for 5 hours, then let them sit on warm for another 3 1/2 hours before dinner was served.",
    "Serve alongside pasta or rice, or all on their own. These are filling!"
  ],
  "ingredients": [
    "0",
    "1/4 cup chopped Italian Parsley",
    "1.5 pounds lean ground beef",
    "4 slices smoked bacon, diced (raw; don't cook it)",
    "1/4 cup grated Parmesan cheese",
    "1/4 cup Panko-style breadcrumbs (I used Kinnikinnick Gluten Free Bread Crumbs)",
    "2 eggs (the eggs pictured are duck eggs! thanks, Grandpa John!)",
    "2 tablespoons dried minced onion flakes",
    "1 tablespoon garlic powder",
    "1/2 teaspoon kosher or sea salt",
    "1/2 teaspoon ground black pepper",
    "additional ingredients:",
    "1 cup flour (I used rice flour)",
    "2 cups chicken broth (can use beef)",
    "1 (6-ounce) can tomato paste"
  ],
  "__v": 1
}