{
  "hash": "491c0296325336e3225e33ea4dc994523f16f2b9",
  "title": "Spicy Dr. Pepper Shredded Pork",
  "image": "http://tastykitchen.com/recipes/wp-content/uploads/sites/2/2011/03/5551711173_dc42f7fc4b_z-420x280.jpg",
  "href": "http://thepioneerwoman.com/cooking/2011/03/spicy-dr-pepper-shredded-pork/",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T22:37:48.073000",
  "users": [
    null
  ],
  "keywords": [
    "onion",
    "shoulder",
    "pork",
    "butt",
    "salt",
    "black",
    "pepper",
    "chipotle",
    "peppers",
    "adobo",
    "brown",
    "sugar"
  ],
  "directions": [
    "0",
    "Preheat oven to 300 degrees.",
    "Peel the onion and cut it into wedges. Lay them in the bottom of a large dutch oven.",
    "Generously salt and pepper the pork roast, then set it on top of the onions in the pan.",
    "Pour the can of chipotle peppers over the pork (include the sauce.) Pour in both cans of Dr Pepper. Add brown sugar to the juice and stir in.",
    "Place lid tightly on pot, then set pot in the oven. Cook for at least six hours, turning roast two or three times during the cooking process. Check meat after six hours; it should be absolutely falling apart (use two forks to test.) If it's not falling apart, return to the oven for another hour.",
    "Remove meat from pot and place on a cutting board or other work surface. Use two forks to shred meat, discarding large pieces of fat. Strain as much of the fat off the top of the cooking liquid as you can and discard it. Return the shredded meat to the cooking liquid, and keep warm until ready to serve. (You can also refrigerate the meat and liquid separately, then remove hardened fat once it's cold. Then heat up the liquid on the stovetop and return the meat to the liquid to warm up.",
    "Serve on warm flour tortillas. Top with shredded lettuce, diced tomatoes, grated cheese, avocado slices, salsa, and whatever else you'd like."
  ],
  "ingredients": [
    "0",
    "1 whole Large Onion",
    "1 whole Pork Shoulder (\"pork Butt\") - 5 To 7 Pounds",
    "Salt And Freshly Ground Black Pepper",
    "1 can (11 Ounce) Chipotle Peppers In Adobo Sauce",
    "2 cans Dr. Pepper",
    "2 Tablespoons Brown Sugar"
  ],
  "__v": 1
}