{
  "hash": "e01d9788f36df162e8368aa3cf70256108541450",
  "title": "Grow Your Own Bread - Sprouted Lentil Bread",
  "image": "http://1.bp.blogspot.com/-zkMugTjrsFE/T05bYb37ZMI/AAAAAAAAASg/Aly1_qJ9hg8/s320/Sprouted+Lentil+Bread+with+sunbutter.jpg",
  "href": "http://poorandglutenfree.blogspot.com/2012/02/grow-your-own-bread-sprouted-lentil.html",
  "extension": "",
  "firstAdded": "2015-12-30T12:19:13.992000",
  "users": [
    null
  ],
  "keywords": [
    "soaked",
    "overnight",
    "hrs",
    "long",
    "days",
    "sprouts",
    "directions",
    "make",
    "sprouted",
    "lentils",
    "totally",
    "mason",
    "jar",
    "flax",
    "seed",
    "salt",
    "water"
  ],
  "directions": [
    "0",
    "Spray a baking sheet with oil and lay a sheet of parchment paper over it.",
    "Either in a food processor or coffee grinder, grind the lentil sprouts until they form a paste. In a coffee grinder you will have to do several batches, and it will be lumpier. (See the photo of the dough) This is fine.",
    "Preheat oven to 250 degree.",
    "Mix all ingredients together for 3 minutes to make a sticky lump. If adding fruit or extras, now is the time to do it. Let the dough rest for 10 minutes while the oven heats up.",
    "Wet hands with water and form an oval or circle flat bread shape with the dough and lay out on the baking sheet.",
    "Bake for approximately 1.5 - 2 hours, checking every half hour or so. Baking time will depend on the height of your bread, the higher it is the longer it will take. The outside will get crusty and brown fairly quickly, but the inside takes longer to bake. If you want to do this as raw food, you could do this in a dehydrator at a lower heat for a longer time - I'm no raw food expert so I can't give specifics but I'm sure you could follow directions for regular Ezekiel bread on this one. I have a dehydrator, but little patience!",
    "Notes: The second time I made this I ground up 2 Tbsp of sunflower seeds and added that. I also added 1 Tbsp of poppy seeds, and ¼ cup of raisins. The bread is nice and sweet now, with a slightly nutty flavour.",
    "If you try this, please let me know if you've added anything! I'd love to hear your suggestions :)"
  ],
  "ingredients": [
    "0",
    "¾-1 c dried lentils, soaked overnight (8-12hrs) and sprouted for until 1” long (about 3-4 days) see sprouts for directions. This will make about 3 – 3.5 cups sprouted lentils and will totally fill a large mason jar.",
    "4 Tbsp ground flax seed",
    "½ tsp salt",
    "1 Tbsp water"
  ],
  "__v": 1
}