{
  "hash": "dc8e7a217ce103d7ef92f6de694f1a0c5cb52f74",
  "title": "Short Rib Pot Pie",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/short-rib-pot-pie",
  "extension": "Chrome",
  "firstAdded": "2016-01-21T10:43:09.765000",
  "users": [
    null
  ],
  "keywords": [
    "allpurpose",
    "flour",
    "kosher",
    "salt",
    "chilled",
    "unsalted",
    "butter",
    "pieces",
    "shortening",
    "beef",
    "lard",
    "boneless",
    "short",
    "ribs",
    "black",
    "pepper",
    "olive",
    "oil",
    "frozen",
    "pearl",
    "onions",
    "thawed",
    "garlic",
    "tomato",
    "dry",
    "red",
    "wine",
    "sprigs",
    "rosemary",
    "thyme",
    "flaky",
    "maldon",
    "cream",
    "brushing"
  ],
  "directions": [
    "0",
    "Pulse flour and salt in a food processor; add butter and shortening and pulse until mixture resembles coarse meal with a few pea-size pieces of butter remaining. Transfer flour mixture to a large bowl and drizzle with ½ cup ice water. Mix with a fork until dough just comes together.",
    "Knead dough lightly, adding more water by the tablespoonful if needed, until no dry spots remain (dough will be slightly shaggy but moist). Form into a disk and wrap tightly in plastic. Chill until firm, at least 2 hours.",
    "DO AHEAD: Crust can be made 2 days ahead; keep chilled.",
    "1",
    "Preheat oven to 375°. Season short ribs with kosher salt and pepper; toss with ½ cup flour on a rimmed baking sheet. Heat oil in a large heavy pot over medium-high heat. Working in batches, shake excess flour from ribs and cook, turning occasionally, until deeply browned, 8–10 minutes per batch. Using a slotted spoon, transfer to a large bowl.",
    "Add onions to same pot and cook, stirring occasionally, until golden brown; season with kosher salt and pepper and, using a slotted spoon, transfer to a small bowl. Reduce heat to medium, add garlic to pot, and cook, stirring, until softened, about 2 minutes.",
    "Add tomato paste and cook, stirring often, until slightly darkened in color, 5–8 minutes. Add wine, rosemary, and thyme sprigs, bring to a boil, and cook, scraping up browned bits, until liquid is reduced by half, 8–10 minutes. Add 6 cups water to pot and bring to a boil.",
    "Return short ribs to pot; season with kosher salt and pepper. Reduce heat and simmer gently, uncovered, until short ribs are almost falling apart and liquid is thick enough to lightly coat a spoon, 2½–3 hours.",
    "Add onions and chopped thyme to pot and stir to break up short ribs; season filling with kosher salt and pepper. Remove herb sprigs.",
    "Roll out dough on a lightly floured surface to about ⅛” thick. Transfer filling to a shallow 2-qt. baking dish. Place over filling and trim, leaving overhang. Tuck edges under and crimp. Cut a few slits in crust. Brush with cream and sprinkle with sea salt. Alternatively, you can use 8 individual dishes.",
    "Place dish on a rimmed baking sheet and bake pot pie until filling is bubbling and crust is golden brown, 50–60 minutes (35–40 minutes for smaller dishes). Let sit 5–10 minutes before serving.",
    "DO AHEAD: Filling can be made 2 days ahead. Let cool; cover and chill. Reheat gently before assembling pie."
  ],
  "ingredients": [
    "0",
    "3 cups all-purpose flour",
    "2 teaspoons kosher salt",
    "½ cup (1 stick) chilled unsalted butter, cut into pieces",
    "½ cup vegetable shortening or beef lard",
    "1",
    "3 pounds boneless beef short ribs, cut into 2” pieces",
    "Kosher salt and freshly ground black pepper",
    "½ cup all-purpose flour, plus more",
    "2 tablespoons olive oil",
    "1 10-oz. package frozen pearl onions, thawed",
    "4 garlic cloves, chopped",
    "2 tablespoons tomato paste",
    "2 cups dry red wine",
    "2 sprigs rosemary",
    "6 sprigs thyme, plus 2 Tbsp. chopped thyme",
    "Flaky sea salt (such as Maldon)",
    "Heavy cream (for brushing)"
  ],
  "__v": 1
}