{
  "hash": "4d1e787674cef49ac4c52b706ac9009448daf5a9",
  "title": "Jalapeño Corn Soup with Seared Scallops",
  "image": "//images.food52.com/k3KZE6hTioVTQe64PehyHXK-JZk=/753x502/9a8201c7-ce66-43f3-babe-d174c856481f--jalapeno-corn-with-scallops_food52_mark_weinberg_14-09-09_0553.jpg",
  "href": "http://food52.com/recipes/28329-jalapeno-corn-soup-with-seared-scallops",
  "extension": "Chrome",
  "firstAdded": "2016-02-20T13:13:19.430000",
  "users": [
    null
  ],
  "keywords": [
    "ears",
    "corn",
    "kernels",
    "cobs",
    "reserved",
    "onion",
    "jalapeos",
    "seeded",
    "garlic",
    "lowsodium",
    "chicken",
    "stock",
    "cream",
    "butter",
    "salt",
    "pepper",
    "scallops",
    "preferably",
    "andor",
    "drypacked",
    "neutral",
    "oil",
    "canola",
    "grapeseed"
  ],
  "directions": [
    "0",
    "Melt the butter over medium heat in a large heavy pot or dutch oven. Add in the onion and jalapeño and cook for 5 to 7 minutes, or until soft but not brown. Add in the garlic and the corn kernels and cook for another minute or until fragrant, making sure that the garlic doesn't burn.",
    "Pour in the chicken stock and cream and add the corn cobs. Season with a few large pinches of salt and pepper. Bring soup to a boil, lower to a simmer, and cook for about 45 minutes.",
    "Discard the cobs and blend the soup until smooth. Check for seasoning and add more salt and pepper if needed.",
    "Ladle the soup into a shallow bowl and top with seared scallops. Soup can also be cooled and refrigerated for a few days or frozen for a couple months.",
    "1",
    "Melt the butter and oil together in a large heavy skillet until very hot, but not smoking.",
    "Rinse the scallops, pat very dry, and season generously with salt and pepper.",
    "Add the scallops to the pan and cook for 2 to 3 minutes per side, or until caramelized on the outside and just slightly translucent in the center."
  ],
  "ingredients": [
    "0",
    "9 ears of corn, kernels removed and 4 cobs reserved",
    "1 onion, diced",
    "2 jalapeños, seeded and diced",
    "3 cloves of garlic, peeled and minced",
    "4 cups low-sodium chicken stock",
    "1/2 cup heavy cream",
    "3 tablespoons butter",
    "Salt and pepper",
    "1",
    "12 large sea scallops, preferably fresh and/or dry-packed",
    "1 tablespoon butter",
    "1 tablespoon neutral oil, like canola or grapeseed",
    "Salt and pepper"
  ],
  "__v": 1
}