{
  "hash": "0d8e8353b4e27a069b5c77a65eda6fee81c75250",
  "title": "NUTELLA LAVA CUPCAKES",
  "image": "http://cleobuttera.com/wp-content/uploads/2015/02/fererro.jpg",
  "href": "http://cleobuttera.com/cupcakes/nutella-lava-cupcakes/",
  "extension": "Chrome",
  "firstAdded": "2018-01-02T17:10:49.315000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the cupcakes:",
    "Adjust oven rack to middle position. Preheat oven to 350F/180F. Line 2 cupcake pans with 20 to 22 cupcake liners.",
    "In the bowl of a stand mixer fitted with the whisk attachment (or in a large bowl, if using a handheld mixer), whisk the butter on high speed until smooth.",
    "Add the brown sugar and mix together until slightly lightened in color, about 3 minutes.",
    "Scrape down the bowl, then add the eggs, one at a time, mixing well after each addition.",
    "Add in the vanilla and continue mixing until lightened more in color and texture and looks fluffy, 3 to 5 minutes. Scrape down the bowl.",
    "Add the cocoa powder, baking soda, salt and mix until well blended. Scrape down the bowl.",
    "With the mixer on lowest speed, add one-third of the flour, followed by half of the sour cream, then mix to blend. Then add the second third of the flour, followed by the rest of the sour cream, mix again. End with the remaining flour and mix just until combined. Scrape the bowl as needed.",
    "With the mixer running on medium low speed, drizzle in the hot water (or coffee) and mix until very smooth, about 1 minute. Batter will be very thin and soupy.",
    "Portion the batter evenly among the cupcake liners (I like to use a 3 tablespoons measure ice cream scoop for a smaller cupcake) until ⅔ full, or (a ¼ cup measure ice cream scoop for a larger cupcake) until ¾ full.",
    "Bake until the tops spring back to the touch and a toothpick inserted into the center of the cupcake comes clean or with a few cooked crumbs attached, 16 to 17 minutes. Start checking after 15 minutes. The cupcakes might deflate slightly after they come out of the oven, but should NOT look sunken. If the do sink, that means they were underbaked. They should have slightly domed tops.",
    "Let cool in the pan for about 5 minutes or until cool enough to handle, then transfer to a wire rack to cool completely before filling and frosting.",
    "While the cupcakes are baking and cooling, make the frosting and filling (instructions below)",
    "To make a hole in the cupcake, use a pairing knife to make a deep circular (1-inch in diameter) cut in the center of the cupcake. Make sure you only cut about halfway through the cupcake, and don't go all the way through the bottom. An apple corer would also work perfectly here. Using the tip of the knife, lift the cut piece of cake from deep inside and remove it completely. Let's call this the 'plug.' Cut the bottom half of the 'plug' and snack on it or do whatever you want with it. Set aside the top half of the plug, which will be used to cover the cupcake after filling them.",
    "Using a small spoon or a piping bag or a zipper lock bag with the corner snipped off, pour in the Nutella sauce into each cupcake. Be generous:) Fill almost to the top.",
    "Use the cake 'plug' to cover the tops of the cupcakes, where they have been filled.",
    "Using your favorite piping tip (I used a large round tip Ateco 808) or an offset spatula to frost the cupcakes with the Very Nutella Frosting. The way it's done here, is by starting to pipe in the center, going aroung once, the ending in the center with a burst of pressure.",
    "If desired, drizzle with leftover Nutella Sauce, or chocolate syrup, then top with Ferrero Rocher, sprinkles or chocolate curls.",
    "Store cupcakes in an airtight container.",
    "For the Very Nutella Frosting:",
    "In a medium microwavable bowl, place both types of chocolate chips and melt in the microwave, stopping every 20 second to stir the chocolate. Heat and stir until almost completely melted. The warmth of the melted chocolate will melt whatever bits of chocolate left. Set aside to cool slightly.",
    "In another medium bowl, combine the butter and cream cheese and beat using an electric mixer until smooth and well blended.",
    "Add in the Nutella and mix until completely incorporated. Scrape down the bowl.",
    "Add in the melted chocolate and mix until everything is well combined, scraping the bowl as need.",
    "For the Nutella Sauce Filling:",
    "Combine the Nutella and milk in a medium bowl, whisk well until completely smooth.",
    "NOTES",
    "*The cupcake batter will make anywhere between 16 and 17 cupcakes. Making 16 will result in a larger cupcake with a muffin-top-like cap. Making 17 on the other hand, will produce cupcakes that rise just right above the cupcake liner (just like the ones pictured above).",
    "*Dutch processed cocoa powder gives a deeper, more chocolatey flavor to these cupcakes. However, if you can't find it, no worries, natural unsweetened cocoa works really well too, without affecting the outcome. If using natural cocoa, use the darkest, best quality cocoa you can find. I use Hintz unsweetened cocoa and love it!",
    "*Cake flour gives these cupcakes a soft and tender crumb, but it could be hard to find, at least where I live. I substitute this by placing 3 tablespoons of cornstarch or cornflour in my measuring cup, then add the all-purpose flour on top of that and continue measuring like I normally would. So I end up using 1½ cups minus 3 tablespoons of all-purpose flour plus 3 tablespoons cornstarch. If you have cake flour, just use that.",
    "*Using coffee in chocolate baked goods intensifies the chocolate flavor without making it taste like coffee. I just stir in 1½ teaspoons of instant coffee (Nescafe) into my ¾ cup of hot water. If you're not okay with using coffee then just use hot water instead."
  ],
  "ingredients": [
    "0",
    "For the Cupcakes: (you can substitute your favorite cake mix for a shortcut)",
    "½ cup (4oz/113.4g) unsalted butter, softened to room temperature",
    "1½ cups (10½oz/ 298g) soft light brown sugar, packed",
    "2 egg, at room temperature",
    "1½ teaspoons vanilla extract",
    "½ cup (1½oz/ 40g) unsweetened cocoa powder, preferably Dutch-process* (see note)",
    "1½ teaspoons (7g) baking soda",
    "¼ teaspoon salt",
    "1½ cups (6.4 oz/ 180g) cake flour* (see note for substitution)",
    "⅔ cups (5.3oz/ 150g) sour cream, at room temperature",
    "¾ cups (177ml) hot water (or coffee)* (see note)",
    "For the Very Nutella Frosting (makes about 3½ cups):* (see note above)",
    "¾ cup (6oz/ 170g)) unsalted butter, softened to room temperature",
    "6 tablespoons (3 oz/ 85g)) cream cheese (or 6 Kiri squares), softened but slightly cool",
    "1 cup plus 2 tablespoon (12 oz/ 340g) Nutella",
    "½ cup minus 1 tablespoon (3 oz/ 85g) semisweet chocolate chips",
    "½ cup minus 1 tablespoon (3 oz/ 85g) milk chocolate chips",
    "For the Nutella Sauce Filling:",
    "¾ cup (8oz/ 227g) Nutella",
    "¼ cup (60ml) whole milk",
    "Leftover Nutella sauce filling or chocolate syrup for drizzling on top, optional",
    "16 to 17 Ferrero Rocher, or sprinkles or chocolate curls for topping, optional"
  ],
  "__v": 1
}