{
  "hash": "f6419090105ab2407e0279ad7e413e9d0e7593ae",
  "title": "Curried Coconut Quinoa and Greens with Roasted Cauliflower",
  "image": "https://cookieandkate.com/images/2018/10/curried-coconut-quinoa-greens-roasted-cauliflower-1-2.jpg",
  "href": "https://cookieandkate.com/2014/curried-coconut-quinoa-greens-roasted-cauliflower/",
  "extension": "Firefox",
  "firstAdded": "2018-11-27T18:46:13.738000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Roast the cauliflower: Preheat oven to 425 degrees Fahrenheit. Toss the cauliflower florets with coconut oil, cayenne pepper and a light sprinkle of sea salt. Roast for 25 to 30 minutes on the middle rack, turning halfway, until the cauliflower is tender and golden on the edges.",
    "Cook the quinoa: In a large pot with a lid, warm the coconut oil over medium heat. Add the onion and cook until it is turning translucent, stirring often, about 5 minutes. Add the ginger, turmeric, curry powder and cardamom and stir until fragrant, about 30 seconds. Pour in the coconut milk, water, rinsed quinoa and raisins. Bring the mixture to a boil, then cover and reduce heat to a simmer. Cook for 15 minutes, then remove the pot from heat and let it rest for 5 minutes.",
    "Fluff the quinoa with a fork. Stir in the salt, vinegar and greens (if you intend to eat this dish as leftovers, I recommend storing leafy greens separate from the quinoa, as the greens don’t reheat well). Divide the quinoa into bowls and top with roasted cauliflower. Garnish with green onions and red pepper flakes if you’d like."
  ],
  "ingredients": [
    "0",
    "Roasted Cauliflower",
    "1 head cauliflower, cut into bite-sized florets",
    "2 tablespoons melted coconut oil or olive oil",
    "¼ teaspoon cayenne pepper",
    "Sea salt",
    "Curried coconut quinoa with greens",
    "2 teaspoons melted coconut oil or olive oil",
    "1 medium yellow onion, chopped",
    "1 teaspoon ground ginger",
    "1 teaspoon ground turmeric",
    "½ teaspoon curry powder of choice (optional)",
    "½ teaspoon ground cardamom",
    "1 can (14 ounces) light coconut milk",
    "½ cup water",
    "1 cup quinoa, rinsed well in a fine mesh colander",
    "⅓ cup raisins",
    "1 teaspoon sea salt",
    "1 tablespoon apple cider vinegar",
    "4 cups baby arugula or chopped chard, spinach, maybe even kale*",
    "Optional garnishes: 2 green onions, chopped, and a sprinkle of red pepper flakes"
  ],
  "__v": 1
}