{
  "__v": 1,
  "directions": [
    "0",
    "Give the split peas and lentils a good rinse - until they no longer put off murky water. Place them in an extra-large soup pot, cover with the water, and bring to a boil. Reduce heat to a simmer and add the carrot and 1/4 of the ginger. Cover and simmer for about 30 minutes, or until the split peas are soft.",
    "In the meantime, in a small dry skillet or saucepan over low heat, toast the curry powder until it is quite fragrant. Be careful though, you don't want to burn the curry powder, just toast it. Set aside. Place the butter in a pan over medium heat, add half of the green onions, the remaining ginger, and raisins. Saute for two minutes stirring constantly, then add the tomato paste and saute for another minute or two more.",
    "Add the toasted curry powder to the tomato paste mixture, mix well, and then add this to the simmering soup along with the coconut milk and salt. Simmer, uncovered, for 20 minutes or so. The texture should thicken up, but you can play around with the consistency if you like by adding more water, a bit at a time, if you like. Or simmer longer for a thicker consistency. The thicker this soup got, the more I liked it.",
    "I've been enjoying big ladles of this soup over ~1/2 cup of warm farro (leftover from this Farro & Bean Stew) - brown rice was good as well. Sprinkle each bowl generously with cilantro and the remaining green onions.",
    "Serves 6."
  ],
  "firstAdded": "2014-07-07T10:42:59.588000",
  "hash": "11a49a27e184697be911f8e36d6db3a47ae15408",
  "href": "http://www.101cookbooks.com/archives/coconut-red-lentil-soup-recipe.html",
  "image": "http://www.101cookbooks.com/mt-static/images/food/esalen_dal_recipe.jpg",
  "ingredients": [
    "0",
    "1 cup / 7 oz / 200g yellow split peas",
    "1 cup 7 oz / 200g red split lentils (masoor dal)",
    "7 cups / 1.6 liters water",
    "1 medium carrot, cut into 1/2-inch dice",
    "2 tablespoons fresh peeled and minced ginger",
    "2 tablespoons curry powder",
    "2 tablespoons butter or ghee",
    "8 green onions (scallions), thinly sliced",
    "1/3 cup / 1.5 oz / 45g golden raisins",
    "1/3 / 80 ml cup tomato paste",
    "1 14-ounce can coconut milk",
    "2 teaspoons fine grain sea salt",
    "one small handful cilantro, chopped"
  ],
  "keywords": [
    "yellow",
    "split",
    "peas",
    "red",
    "lentils",
    "masoor",
    "dal",
    "water",
    "medium",
    "carrot",
    "dice",
    "ginger",
    "curry",
    "butter",
    "ghee",
    "green",
    "onions",
    "scallions",
    "golden",
    "raisins",
    "tomato",
    "coconut",
    "milk",
    "salt",
    "cilantro"
  ],
  "title": "Coconut Red Lentil Soup",
  "users": [
    null
  ]
}