{
  "hash": "7cdabda9fe8c9c45a0fc0b61cc3dda03b577c68b",
  "title": "Topinamburový krém",
  "image": "",
  "href": "http://www.menudomu.cz/topinamburovy-krem/",
  "extension": "Chrome",
  "firstAdded": "2015-12-08T09:32:38.942000",
  "users": [
    null
  ],
  "keywords": [
    "ingredience",
    "porce",
    "zeleninovho",
    "vvaru",
    "neoloupanch",
    "topinambur",
    "stedn",
    "velk",
    "brambor",
    "men",
    "cibule",
    "smetany",
    "mono",
    "vynechat",
    "pep",
    "citronov",
    "vtviek",
    "erstvho",
    "tyminu",
    "msla"
  ],
  "directions": [
    "0",
    "Samotný krém je opravdu jednoduchý. Pro lepší chuť používejte vývar – ať už zeleninový a nebo kuřecí. To platí u všech krémových polévek. Chuť topinamburu sice tu artyčokovou vážně připomíná, ale je méně výrazné a hlízy obsahují hodně vody, takže je dobré je něčím podpořit. Pro lepší konzistenci bramborem, pro chuť cibulkou a trochou citronové šťávy. Nesmí chybět sůl a pepř.",
    "Na dostatku másla v hrnci s těžkým dnem orestujte cibulku nebo šalotku dozlatova. Mezi tím oškrabkujte a nebo alespoň okartáčkujte topinambury. I ve všech záhybech. Nakrájejte na tenčí kolečka a pokud je ihned nepřidáváte do hrnce, je nutno je ponořit stejně jako klasické artyčoky do kyselé vody, která zabrání jejich přirozenému tmavnutí na vzduchu. Vmíchejte k cibulce a přidejte i oloupaný a naplátkovaný brambor. Ideálně také čerstvá tymián. Trochu soli, pepře a vývar. Přiklopte poklicí a nechte vařit asi 20 minut, dokud brambor nezměkne tak, že půjde krásně rozmixovat. Topinambury budou v tu dobu ještě mnohem rozměklejší. Vše promixujte, přidejte trochu smetany, promíchejte a dochuťte solí (pokud byl vývar nesolený), pepřem a citronovou šťávou. Základ hotov. Ale teď tomu dát ještě švih.",
    "K chuti téhle polévky bezvadně sedne cokoli uzeného. Třeba kachní prso…nebo hovězí jazyk… a tak podobně. Stačí jen trochu, pár malých kostiček. Hodí se i opečené krutony. Často se dávají i topinamburové chipsy – tedy prostě velmi tenké plátky syrových topinamburů, které klasicky usmažíte. Dál si jeruzalémské artyčoky dobře rozumí s houbami. A bylinkami.",
    "Já jsem koupila uzené kachní prsíčko. Stáhla z něho trochu přečnívající kůže s tukem. Pokrájela na malinké kostičky a nechala na sucho vypéct sádlo na pánvi. Tím se udělaly škvarečky. K nim jsem přidala shii take na plátky, orestovala, přidala asi 5 minut vařené drobné růžičky květáku a také uvařenou čočku Beluga. Spojila trochou smetany. Ochutila bylinkami (konkrétně kerblíkem a koriandrem) a přidala trochu kachního masa. Funguje to jako úžasný vlažný salát, mimochodem… :) Ale i jako superluxusní vložka do topinamburového krému.",
    "A ještě se zastavím u kouřotvořítka. Správně řečeno udící pistoli (instant smoker) můžete pořídit buď v takovém domácím levnějším provedení z plastu a nebo v kovové profiverzi. Prodávají se k tomu i různé druhy pilin (nejen z různých dřev, ale může to mít i příchutě!). Když na youtube zadáte „aladin smoker“ najdete spoustuvideí o používání tohohle udělátka. Zkrátka piliny to chce lehce navlhčit, vystlat jimi zásobník, ve kterém máte jemné sítko, zapnout motůrek, který začne vsávat vzduch a podpálit zapalovačem. Čoudit to začne okamžitě a bude dokud buď piliny nevyhoří nebo dokud nevypnete motor. Kouř musíte nahánět někam, kde zůstane uzavřený spolu s pokrmem, který hodláte udit. Stačí třeba vysoký pekáč pořádně obalený fresh folií. V ní uděláte dirku, tudy kouř naženete a pak přetáhnete další vrstvou folie, která dirku zalepí. Obvykle stačí nechávat jídlo v kouři 5 – 10 minut. Udit se dá cokoli od tataráku po máslo. A my to postupem času taky všechno načudíme!"
  ],
  "ingredients": [
    "0",
    "Ingredience na 2 porce",
    "500 ml zeleninového vývaru",
    "250 g neoloupaných topinamburů",
    "1 středně velký brambor",
    "1 menší cibule",
    "40 g smetany (možno vynechat)",
    "sůl",
    "pepř",
    "citronová šťáva",
    "pár větviček čerstvého tymiánu",
    "40 g másla"
  ],
  "__v": 1
}