{
  "hash": "ada176d2a3567906ac6f4221c235ddfec13ee3fd",
  "title": "One Pan Roast Chicken with Root Vegetables",
  "image": "http://hipfoodiemom.com/wp-content/uploads/2014/09/One-Pan-Roasted-Chicken-with-Root-Vegetables_main.jpg",
  "href": "http://hipfoodiemom.com/2014/09/08/one-pan-roast-chicken-with-root-vegetables-a-cookbook-giveaway/",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T21:28:41.720000",
  "users": [
    null
  ],
  "keywords": [
    "red",
    "potatoes",
    "unpeeled",
    "pieces",
    "brussels",
    "sprouts",
    "trimmed",
    "shallots",
    "carrots",
    "ends",
    "lengthwise",
    "oil",
    "garlic",
    "thyme",
    "rosemary",
    "bonein",
    "chicken",
    "breasts",
    "drumsticks",
    "thighs",
    "salt",
    "pepper",
    "finish",
    "serve",
    "sugar"
  ],
  "directions": [
    "0",
    "Place potatoes, Brussels sprouts, shallots, carrots, 2 tablespoons oil, garlic, 2 teaspoons thyme and 1 teaspoon rosemary in 1-gallon zipper-lock bag. Press out the air and seal; toss to coat.",
    "Place chicken, remaining 2 tablespoons oil, remaining 2 teaspoons thyme, remaining 1 teaspoon rosemary, ¼ teaspoon salt, and ⅛ teaspoon pepper in separate 1-gallon zipper-lock bag. Press out the air and seal; toss to coat.",
    "1",
    "Refrigerate chicken and vegetable mixture zipper-lock bags for at least one hour or overnight, up to 24 hours, flipping the bag at least once or twice to ensure the chicken marinates evenly.",
    "2",
    "Adjust the oven rack to upper-middle position and heat oven to 475 degrees. Spread vegetables in a single layer in rimmed baking sheet, discarding any excess liquid and arranging Brussels sprouts in center and potatoes and carrots along the outside. Season vegetables with sugar, salt and pepper.",
    "Place chicken skin side up on top of vegetables, arranging breast pieces in the center and leg and thigh pieces around the perimeter of the sheet. Bake chicken until breasts register 160 degrees and drumsticks and thighs register 175 degrees, for about 35 to 40 minutes, rotating the sheet halfway through baking.",
    "Transfer the chicken to serving platter, tent loosely with aluminum foil, and let rest for 5 to 10 minutes. Return vegetables to oven and continue to bake until lightly browned, 5 to 10 minutes. Toss vegetables with any accumulated chicken juices and transfer to platter with chicken. Serve and enjoy."
  ],
  "ingredients": [
    "0",
    "12 ounces red potatoes, unpeeled, cut into 1-inch pieces",
    "12 ounces Brussels sprouts, trimmed and halved",
    "8 shallots, peeled and halved",
    "4 carrots, peeled and cut into 2-inch pieces, thick ends halved lengthwise",
    "¼ cup vegetable oil",
    "6 garlic cloves, peeled",
    "4 teaspoons minced fresh thyme",
    "2 teaspoons minced fresh rosemary",
    "3½ pounds bone-in chicken pieces (breasts, drumsticks and thighs)",
    "salt and pepper",
    "To finish and serve: 1 teaspoon sugar"
  ],
  "__v": 1
}