{
  "hash": "d1f7c115dbc4670eba0130082aa16270049b0428",
  "title": "Baked Macaroni & Cheese with Spinach & Red Peppers",
  "image": "",
  "href": "http://www.thekitchn.com/recipe-lighter-baked-mac-and-cheese-207869",
  "extension": "Chrome",
  "firstAdded": "2017-02-12T17:23:09.116000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the oven to 350°F. Spray a 3-quart casserole dish with nonstick coating.",
    "Bring a large pot of water to boil. Salt the water generously and add the macaroni. Cook the pasta until it's just barely al dente — a little bit of chew is fine here. Drain and immediately transfer the hot pasta to a large mixing bowl.",
    "Add the spinach and toss to combine. Cover the bowl with plastic wrap or a dinner plate and let the spinach wilt in the heat of the pasta for about 10 minutes. Shake the bowl occasionally to mix up the pasta and spinach — some of the spinach might not completely wilt; this is fine.",
    "Whisk the eggs until well-combined, then whisk in 2 cups of the cheese, cottage cheese, sour cream, and salt. Pour the egg mixture over the pasta and wilted spinach. Add the diced red peppers and gently stir until combined and all the ingredients are evenly coated with sauce.",
    "Transfer the macaroni and cheese to the baking dish. Cover tightly with foil. At this point, the casserole can be refrigerated for up to 24 hours before baking.",
    "Bake, covered, for 30 minutes. Remove the foil and sprinkle the remaining 1/2 cup of cheese over the top of the casserole. Bake, uncovered, for another 15 to 20 minutes, until the cheese has melted and you can hear the casserole bubbling. (If baking straight from the fridge, extend the covered baking time to 45 minutes.)",
    "Let the casserole cool for a few minutes before serving. Leftovers will keep, covered and refrigerated, for up to a week.",
    "Recipe Notes",
    "Substitute low-fat (1% or 2%) cottage cheese and sour cream if desired. Nonfat substitutes can also be used, but the casserole will be looser.",
    "To freeze: The entire casserole can be frozen, baked or unbaked, but cook the pasta very al dente so it doesn't get mushy. Warm baked casseroles in the microwave or a low oven until warmed through. Cook unbaked casseroles straight from the freezer for an hour, then uncover, top with cheese, and continue baking until bubbly."
  ],
  "ingredients": [
    "0",
    "12 ounces macaroni (2 1/2 cups dry macaroni)",
    "12 to 16 ounces baby spinach (7 to 8 large handfuls)",
    "2 large eggs",
    "2 1/2 cups shredded cheddar cheese, divided",
    "1 1/2 cups cottage cheese",
    "3/4 cup sour cream",
    "1 teaspoon salt",
    "2 (12-ounce) jars roasted red peppers, drained and diced",
    "Fresh pepper, to taste"
  ],
  "__v": 1
}