{
  "hash": "ced09c851b7b7be2599b362c17f61b6d134a66c2",
  "title": "Hearty Middle Eastern Chicken Soup",
  "image": "http://tastykitchen.com/recipes/wp-content/uploads/sites/2/2017/02/DSC_0756-410x273.jpg",
  "href": "http://tastykitchen.com/recipes/soups/hearty-middle-eastern-chicken-soup/",
  "extension": "Chrome",
  "firstAdded": "2017-03-21T17:07:33.717000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "First, prep the veggies and aromatics. Set up a food processor and combine the eggplant, garlic, onion, mushrooms, cilantro and rosemary in its bowl. Pulse it all together until it is almost pureed but still has some texture. Then get out a large dutch oven and heat the olive oil in it over medium high heat. Pour the veggies and aromatics into it and let them become fragrant and soft for a couple of minutes. Add in the diced chicken and let it completely cook through and lightly brown for 5 minutes or so.",
    "While the chicken cooks season it with the turmeric, coriander, seasoned salt, smoked paprika, cinnamon and nutmeg. Once it is cooked add in the chickpeas, chicken stock and bay leaves. Bring the soup to a low boil and reduce it to a simmer. Let it simmer for 30 minutes. When the 30 minutes is up, set up a blender. Scoop 1 cup of the soup into the blender and completely puree it until it is thick and smooth. Stir it back into the soup and let it simmer for another 30 minutes. Then serve immediately while hot with crusty bread!"
  ],
  "ingredients": [
    "0",
    "1 whole Eggplant, Cut Into Chunks",
    "3 cloves Garlic",
    "1 whole Onion, Quartered",
    "8 ounces, weight Cremini Mushrooms, Quartered",
    "1 Tablespoon Fresh Cilantro",
    "1 sprig Fresh Rosemary Leaves",
    "1 dash Olive Oil",
    "4 whole Boneless, Skinless Chicken Breasts, Diced Small",
    "½ teaspoons Coriander",
    "½ teaspoons Turmeric",
    "½ teaspoons Lawry's Seasoned Salt",
    "½ teaspoons Smoked Paprika",
    "½ teaspoons Cinnamon",
    "½ teaspoons Nutmeg",
    "1 can (15 Oz. Size) Chickpeas",
    "1 quart Chicken Stock",
    "2 whole Bay Leaves"
  ],
  "__v": 1
}