{
  "hash": "e5bf722af438e6748edb8d7d387246920647604b",
  "title": "Triple Chocolate Poke Cake",
  "image": "http://cf.beyondfrosting.com/wp-content/uploads/2016/10/Sinful-Triple-Chocolate-Poke-Cake-023.jpg",
  "href": "http://beyondfrosting.com/2013/12/08/triple-chocolate-poke-cake/",
  "extension": "Chrome",
  "firstAdded": "2017-05-06T22:10:08.747000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350°F.",
    "Combine the cake mix and dry pudding mix with eggs, vanilla extract, milk, vegetable oil and sour cream. Beat on medium speed until well combined.",
    "Bake the cake in 9x13” for 22-28 minutes. Check for doneness by inserting a toothpick into the middle of the cake. If the toothpick comes out clean, you cake is done. Allow the cake to cool for 10 minutes.",
    "While the cake is still warm, take the end of a wooden spoon or another round object and poke holes all over the top of your cake.",
    "Heat the jar of hot fudge sauce in the microwave for about 30 seconds until you can stir it and thin it out. You may need an additional 30 seconds. Pour the entire jar of hot fudge sauce on the top of cake and allow it to absorb in the cake until cake is cooled. Let set until completely cooled.",
    "When the cake has cooled, prepare the pudding layer by mixing a package of instant dark chocolate pudding with 1¾ cups of cold milk. Before the pudding sets, pour it over the top of the cake and put the cake in the fridge to let the pudding set, about 15 minutes.",
    "Prepare the whipped cream. Put the bowl and whisk attachment in the freezer for 5-10 minutes to get them really cold (this step is optional, but a common practice I use.). In the cold mixing bowl, beat the heavy whipping cream on medium speed for about 3 minutes. Add the hot chocolate mix and increase speed to medium high. Beat until stiff peak form.",
    "Spread the whipped cream over the top of cake. You can top you cake with a chocolate drizzle and some crushed white and milk chocolate chips, or any of your favorite chocolate goodies."
  ],
  "ingredients": [
    "0",
    "1 Box Chocolate fudge cake mix",
    "1 Box Hershey’s dark chocolate instant pudding mix (3.4 oz)",
    "3 large eggs",
    "2 teaspooons pure vanilla extract",
    "1 cup Milk",
    "½ cup Vegetable oil",
    "½ cup Light sour cream",
    "1",
    "1 Jar Hot fudge sauce (12.8oz)",
    "1 box Hersey’s Dark Chocolate instant pudding mix (3.4 oz)",
    "1¾ C Milk",
    "2",
    "2 C Heavy Whipping Cream",
    "1½ C Hot chocolate mix (about 10 sleeves of instant hot chocolate)",
    "Additional hot fudge sauce for drizzling",
    "¼ C White chocolate chips, crushed",
    "¼ C Milk chocolate chips, crushed"
  ],
  "__v": 1
}