{
  "hash": "ccf02aab8dded45e7c953a74fc65650f1dad902f",
  "title": "Roasted Tomato Mac and Cheese",
  "image": "http://cdn-image.myrecipes.com/sites/default/files/styles/300x300/public/roasted-tomato-mac-cheese-ck.jpg?itok=-VfZcZPg",
  "href": "http://www.myrecipes.com/recipe/roasted-tomato-mac-cheese?XID=mr_socialflow_facebook",
  "extension": "Chrome",
  "firstAdded": "2016-06-21T23:43:39.730000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Remove top oven rack, and cover with foil; lightly coat with cooking spray. Preheat broiler to high.",
    "Arrange tomato slices on prepared rack; lightly coat with cooking spray. Broil 8 to 10 minutes or until tomatoes are lightly browned. Transfer tomatoes to a plate; set aside.",
    "Combine flour and butter in a bowl until a paste forms.",
    "Place a large high-sided sauté pan over medium-high heat. Add stock, 2 cups milk, salt, and mustard, stirring with a whisk. Add pasta to pan; bring to a boil. Cook 12 minutes or until pasta is done, stirring frequently. Stir in remaining 1 cup milk and artichokes; cook 2 minutes. Add butter-flour paste, in pieces, stirring constantly to blend and thicken. Remove from heat; stir in cheddar, fontina, 6 tablespoons Parmesan, and pepper.",
    "Arrange broiled tomato slices on top of pasta. Sprinkle with remaining 4 tablespoons Parmesan. Broil 2 minutes or until cheese begins to brown."
  ],
  "ingredients": [
    "0",
    "Cooking spray",
    "5 plum tomatoes, cut into 1/2-inch-thick slices (about 16 slices)",
    "2 tablespoons brown rice flour or all-purpose flour",
    "2 tablespoons butter, softened",
    "4 cups unsalted chicken stock",
    "3 cups 1% low-fat milk, divided",
    "3/4 teaspoon salt",
    "3/4 teaspoon Dijon mustard",
    "18 ounces brown rice elbows (such as Tinkyáda) or whole-grain pasta shells",
    "4 1/2 ounces (1/2 package) frozen artichoke hearts, thawed and halved",
    "6 ounces reduced-fat sharp cheddar cheese, shredded (about 1 1/2 cups)",
    "3 ounces fontina cheese, shredded (about 3/4 cup)",
    "2.5 ounces Parmesan cheese, grated and divided (about 10 tablespoons)",
    "1/2 teaspoon freshly ground black pepper"
  ],
  "__v": 1
}