{
  "__v": 1,
  "directions": [
    "0",
    "PROCEDIMENTO",
    "Appuntamento settimanale con Maffei",
    "La sfoglia extrafine Maffei, sfoglia ideale per un pasticcio con verdure, profumato con ricotta affumicata.",
    "Il gusto deciso del formaggio abbinato alle delicate verdure di stagione.",
    "Per un abbinamento classico, ma sempre d'effetto.",
    "PROCEDIMENTO",
    "Taglia le verdure a cubetti molto piccoli. Scalda una padella con un po' d'olio e salta le verdure per 5/7 minuti, così da dare loro una prima cottura, ma mantienile croccanti.",
    "A parte scalda il latte, aggiungi sale e pepe.",
    "In un pentolino sciogli gli 80 grammi di burro, aggiungi la farina a pioggia e mescola fino ad ottenere un roux chiaro (la farina non deve cuocere).",
    "Aggiungi il roux al latte caldo e mescola con una frusta, finchè non addensa. Regola di sale.",
    "Affetta la ricotta affumicata con la parte larga della grattugia.",
    "Imburra una pirofila per il forno. Stendi un leggero strato di bechamelle e rivesti il fondo della pirofila con la Sfoglia extrafine Maffei, che non necessita di cottura prima di passare in forno.",
    "Aggiungi le verdure saltate, la ricotta a lamelle e dell'altra bechamelle. Prosegui componendo più strati, fino a completare la teglia con bechamelle, ricotta e formaggio grattugiato.",
    "Copri con un velo di carta stagnola e cuoci in forno a 170° C per circa 15 minuti. Rimuovi la stagnola e completa la cottura per altri 20 minuti.",
    "Sforna e servi ben calda, con una fogliolina di salvia a profumare il tutto.",
    "Prova la Sfoglia extrafine Maffei con un ragout d'anatra ed una besciamelle al Morlacco."
  ],
  "firstAdded": "2014-10-08T15:26:14.543000",
  "hash": "10645cad19abada52c105379c9af2bc78ebb35bd",
  "href": "http://www.cucchiaio.it/ricette/ricetta-sfoglia-extrafine-maffei-verdure-ricotta-affumicata-bufala",
  "image": "http://www.cucchiaio.it/sites/www.cucchiaio.dev.softecspa.it/files/imagecache/ricetta_immagine_grande_620/ricetta/immagini/2013/10/sfoglia_maffei_standard.jpg",
  "ingredients": [
    "0",
    "400 g di sfoglia extrafine Maffei",
    "2 carote",
    "1 peperone",
    "2 zucchine"
  ],
  "keywords": [
    "sfoglia",
    "extrafine",
    "maffei",
    "carote",
    "peperone",
    "zucchine"
  ],
  "title": "Sfoglia extrafine Maffei, verdure e ricotta affumicata di bufala",
  "users": [
    null
  ]
}