{
  "hash": "08e4231c6f7fb544dbb2ecd47f697c5a76b55785",
  "title": "Broccoli Quinoa Casserole",
  "image": "http://damndelicious.net/wp-content/uploads/2014/10/Broccoli-Quinoa-Casserole.jpg",
  "href": "http://damndelicious.net/2014/03/05/broccoli-quinoa-casserole/",
  "firstAdded": "2014-12-21T16:47:05.317000",
  "users": [
    null
  ],
  "keywords": [
    "quinoa",
    "head",
    "broccoli",
    "florets",
    "olive",
    "oil",
    "divided",
    "panko",
    "boneless",
    "skinless",
    "thinsliced",
    "chicken",
    "breasts",
    "kosher",
    "salt",
    "black",
    "pepper",
    "unsalted",
    "butter",
    "allpurpose",
    "flour",
    "milk",
    "cheddar",
    "cheese",
    "greek",
    "yogurt"
  ],
  "directions": [
    "0",
    "Preheat oven to 350 degrees F. Lightly oil an 9x13 baking dish or coat with nonstick spray.",
    "In a large saucepan of 2 cups water, cook quinoa according to package instructions. Within the last 5 minutes of cooking time, add broccoli on top and steam until cooked through.",
    "Heat 1 tablespoon olive in a large skillet over medium high heat. Add Panko and cook, stirring, until browned and toasted, about 3 minutes; set aside.",
    "Heat remaining 1 tablespoon olive oil in the skillet. Season chicken breasts with salt and pepper, to taste. Add to skillet and cook, flipping once, until cooked through, about 3-4 minutes per side. Let cool before dicing into bite-size pieces; set aside.",
    "Melt butter in the skillet over medium heat. Whisk in flour until lightly browned, about 1 minute. Gradually whisk in milk, and cook, whisking constantly, until slightly thickened, about 3-4 minutes. Stir in quinoa, broccoli, chicken, 1 cup cheese and Greek yogurt; season with salt and pepper, to taste.",
    "Spread broccoli mixture into the prepared baking dish; sprinkle with remaining 1/2 cup cheese. Place into oven and bake until cheese has melted, about 5 minutes.",
    "Serve immediately, sprinkled with Panko, if desired."
  ],
  "ingredients": [
    "0",
    "1 cup quinoa",
    "1 head broccoli, cut into florets and finely chopped",
    "2 tablespoon olive oil, divided",
    "1/3 cup Panko*",
    "3 boneless, skinless thin-sliced chicken breasts",
    "Kosher salt and freshly ground black pepper, to taste",
    "2 tablespoons unsalted butter",
    "2 tablespoons all-purpose flour",
    "2 cups 2% milk",
    "1 1/2 cups shredded cheddar cheese, divided",
    "1/3 cup Greek yogurt"
  ],
  "__v": 1
}