{
  "__v": 1,
  "directions": [
    "0",
    "Process a few slices of bread in food processor to make about 4-5 cups of fresh breadcrumbs. Add Parmesan and 2 tsp onion powder. Set aside. Melt butter in a bowl and mix with oil. Set aside. Wash and clean chicken breasts.Pat dry and cut each breast into two pieces. You will have two pretty thin slices.Place a chicken piece on a cutting board. Lay a plastic wrap over the chicken piece and pound with a mallet to about a 1/4 inch thickness. Take care not to pound too hard because the meat may tear or create holes. Do the same thing with all the chicken pieces. You should have 10 chicken pieces to the original 5.",
    "Season each chicken piece with a bit of salt/pepper and the remaining 2 tsp onion powder. Be careful not to over salt the chicken as it is quite thin and the cheese and ham are also salty.",
    "Bring all the other ingredients in close proximity. Take out the deli ham and place on a plate.Take cheese out...I usually like to cut the cheese slices in half in case I have to overlap them.Take a chicken piece and place a slice of ham and a slice of cheese(or 2 if you cut the original in half).Roll chicken ...making sure you tuck the sides in as much as possible(this prevents the cheese from oozing out too much in the final baking time). You can secure it with a toothpick. I have, as of lately, started to omit this step. But if you are doing this for the first time, it might help to secure it with the toothpicks. Take the chicken roll and dip into the melted butter/oil...make sure all the sides are well coated.",
    "Take the butter coated chicken roll and then roll it in the breadcrumbs/Parmesan mixture.Place in a casserole dish or plate. Finish with the rest. You can sprinkle some dried herbs of your choice if you like. I sprinkled some dried basil. Place in the refrigerator for at least an hour to ensure that the breadcrumbs stay put on the chicken:). When ready to bake, place each chicken roll on a parchment lined jelly roll pan(this will help with the cleaning later) making sure you don't overcrowd them.Bake in a preheated 375 oven for 15-20 minutes. Place the pan on the top third rack. Don't over cook the chicken. You can easily do this in a toaster oven as well."
  ],
  "firstAdded": "2014-11-17T23:54:02.265000",
  "hash": "09c83a07483a33ed9e46fb816b13b5acb34cdc78",
  "href": "http://www.bigoven.com/recipe/baked-chicken-cordon-bleu/171850",
  "image": "http://mda.bigoven.com/pics/rs/256/baked-chicken-cordon-bleu-43.jpg",
  "ingredients": [
    "0",
    "5 chicken breasts; split in 2 (total yield 10 pieces)",
    "4 tsps onion powder; divided",
    "3 cups fresh bread crumbs",
    "3/4 cup shredded Parmesan",
    "salt/pepper; to taste",
    "4 tbsp butter; melted",
    "3 tbsp olive oil; or canola",
    "10 slices deli ham; sliced thinly",
    "10 slices Gruyere/Swiss cheese",
    "basil/parsley; optional sprinkle"
  ],
  "keywords": [
    "chicken",
    "breasts",
    "split",
    "total",
    "yield",
    "pieces",
    "tsps",
    "onion",
    "divided",
    "bread",
    "crumbs",
    "parmesan",
    "saltpepper",
    "butter",
    "olive",
    "oil",
    "canola",
    "slices",
    "deli",
    "ham",
    "gruyereswiss",
    "cheese",
    "basilparsley",
    "sprinkle"
  ],
  "title": "Baked Chicken Cordon Bleu",
  "users": [
    null
  ]
}