{
  "hash": "bb125fabb6594efda5750b523f5b94fa299a78c3",
  "title": "Herb and Radish Salad With Feta and Walnuts",
  "image": "",
  "href": "https://cooking.nytimes.com/recipes/1018648-herb-and-radish-salad-with-feta-and-walnuts",
  "extension": "Chrome",
  "firstAdded": "2018-07-14T19:38:49.144000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat oven to 350 degrees. Spread walnuts in a single layer on a baking sheet and toast for 10 to 12 minutes until lightly golden. Let cool, then chop roughly. Place in a sieve and shake away loose skin and crumbs. Set chopped nuts aside.",
    "Use a sharp knife or mandoline to slice the radishes and cucumbers into thin coins roughly 1/8-inch thick. Place in a medium bowl. Add walnuts.",
    "In a small glass or jar, whisk together lemon juice and olive oil to make the dressing. Season with salt and pepper to taste.",
    "Just before serving, season radishes, cucumbers and walnuts with a pinch of salt and dress lightly with 3 to 4 tablespoons of vinaigrette. Toss well to combine. Add crumbled cheese and toss gently to combine without breaking the cheese down too much. Arrange in a loose mound in a shallow serving bowl (or on a platter).",
    "Place herbs in the mixing bowl, season with a pinch of salt, and dress very lightly with about 1 tablespoon vinaigrette. Toss to combine, then pile the herb salad atop the radishes and cucumbers. Serve immediately."
  ],
  "ingredients": [
    "0",
    "1",
    "cup walnuts",
    "2",
    "bunches small radishes, trimmed (about 15 radishes)",
    "3",
    "Persian cucumbers, ends trimmed",
    "2",
    "tablespoons lemon juice",
    "¼",
    "cup extra-virgin olive oil",
    "Salt and ground black pepper",
    "3",
    "ounces sheep’s milk feta cheese, crumbled (preferably French feta)",
    "½",
    "cup chives cut into 1-inch pieces (about 1 bunch)",
    "1",
    "cup loosely packed cilantro leaves and tender stems (about 1 bunch)",
    "1",
    "cup loosely packed dill fronds, stems removed (about 1 large bunch)",
    "½",
    "cup loosely packed mint leaves (about 1 small bunch)",
    "2",
    "sprigs tarragon, leaves stripped"
  ],
  "__v": 1
}