{
  "hash": "a6defebd7cf37d28ceb07347ac7437ba7fa26c39",
  "title": "COOKIE GLAZE",
  "image": "",
  "href": "http://kitchengifts.com/glaze.html",
  "firstAdded": "2014-11-27T15:12:37.957000",
  "users": [
    null
  ],
  "keywords": [
    "confectioners",
    "sugar",
    "water",
    "light",
    "corn",
    "syrup",
    "flavoring",
    "almond",
    "orange",
    "lemon",
    "couple",
    "drops",
    "white",
    "coloring",
    "makes",
    "glaze",
    "opaque",
    "transparent",
    "desired"
  ],
  "directions": [
    "0",
    "Here is the secret for making \"shiny\" cookies. Glaze your cookies with this recipe and then add details with royal icing.",
    "3 cups confectioners' sugar",
    "1/4 cup warm water",
    "1 T. light corn syrup",
    "1/4 t. flavoring (almond, orange, lemon, etc.)",
    "A couple drops of white coloring (this makes the glaze opaque rather than transparent)",
    "Desired coloring",
    "Add syrup and extract to warm water in mixing bowl. Mix to dissolve syrup in warm water. Add sugar and white coloring. Mix on low until you form a smooth glaze. Before putting in on the cookie, you want it warm, so put it in the microwave a few seconds before using, until it is baby bottle warm.",
    "When you have finished making the glaze, store it in a a plastic covered container. NO need to refrigerate. It will stay for over a week.",
    "After storing glaze it is not unusual for the heavier sugars to settle to the bottom of the container. Simply put the glaze in the microwave to soften it again and mix thoroughly.",
    "You can apply to the cookie in different ways. The easiest is to simply dip the top of the cookie into the glaze until fully covered. Just hold the cookies around the edges with your fingers to do this. You aren't trying to dip the back of the cookie. Place the cookie on a cookie rack to drip (with wax paper underneath). Or you can put the glaze into squirt bottles and use them to 'fill' in areas previously outlined. Also, you can dip a cookie in one color, and while it is still wet on the cookie rack, apply a different colored glaze with a squirt bottle in a decorative fashion.",
    "Cookies made with this glaze can be decorated ahead of time and frozen."
  ],
  "ingredients": [
    "0",
    "3 cups confectioners' sugar",
    "1/4 cup warm water",
    "1 T. light corn syrup",
    "1/4 t. flavoring (almond, orange, lemon, etc.)",
    "A couple drops of white coloring (this makes the glaze opaque rather than transparent)",
    "Desired coloring"
  ],
  "__v": 1
}