{
  "hash": "fda3161f67d1e0218bc28eaaf4996a9abda4ea01",
  "title": "Braised Venison Tongue With Cinnamon and Star Anise Over Rice Stick Noodles (serves four)",
  "image": "",
  "href": "https://www.fieldandstream.com/articles/hunting/whitetails/2004/11/how-cook-four-gourmet-recipes-gut-pile",
  "extension": "Chrome",
  "firstAdded": "2019-01-09T02:21:31.636000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "[1] Bring a large pot of water to a boil. Add the tongues, reduce the heat, and simmer slowly, covered, for about 2 hours. Remove the tongues with tongs, let rest until just cool enough to touch, and peel off the skin. (It will come off easier when the tongues are warm. If the skin still adheres, trim it with a paring knife.) Cut into ¼-inch slices and set aside.",
    "[2] Heat the oil over medium-high heat in a large pot. Add the garlic, cinnamon, cloves, star anise, and hot chile paste and saute until fragrant--only 15 seconds or so. Then add the water, soy sauce, and fish sauce and bring to a boil. Put in the tongue slices and reduce the heat until you have a slow but steady simmer.",
    "[3] Using tongs, char the ginger and onion halves directly over a gas flame, until evenly scorched. (For electric stoves, heat a heavy dry skillet over high heat and sear the ginger and onion on all sides until nearly blackened.) Add these to the pot.",
    "[4] Let simmer, covered, for about 2 hours, or until the tongue slices are very tender. Remove the cinnamon sticks, star anise, ginger, and onions, reserving the onions. Cook the noodles. Chop the onions roughly and return them to the pot along with the spinach. Bring to a boil, and then remove from the heat.",
    "[5] Divide the warm noodles among four bowls and ladle the meat, broth, and spinach on top. If desired, add minced scallions and either roughly chopped cilantro or sweet basil.",
    "*Rice stick noodles are available at Asian markets. You can substitute fettuccine if needed."
  ],
  "ingredients": [
    "0",
    "4 VENISON TONGUES (ABOUT 1 POUND TOTAL)",
    "1 TEASPOON VEGETABLE OIL",
    "5 GARLIC CLOVES, LIGHTLY SMASHED, PEELED, AND THINLY SLICED",
    "2 CINNAMON STICKS",
    "2 WHOLE CLOVES",
    "2 WHOLE STAR ANISE",
    "1 TEASPOON HOT CHILE PASTE",
    "9 CUPS WATER",
    "1/2 CUP SOY SAUCE",
    "2 TABLESPOONS VIETNAMESE OR THAI FISH SAUCE (OPTIONAL)",
    "2 MEDIUM ONIONS, PEELED AND HALVED",
    "1 3-INCH PIECE GINGER",
    "8 OUNCES SPINACH, TRIMMED, RINSED, AND DRAINED",
    "8 OUNCES MEDIUM RICE STICK NOODLES*, COOKED ACCORDING TO PACKAGE DIRECTIONS, RINSED, AND DRAINED",
    "CHOPPED CILANTRO OR SWEET BASIL, AND MINCED SCALLIONS FOR GARNISH (OPTIONAL)"
  ],
  "__v": 1
}