{
  "hash": "4418ee64a0c360ac8968c46f91cdc8368708672b",
  "title": "PANKO CRUSTED BAKED COD FISH",
  "image": "https://kitchendreaming.com/wp-content/uploads/2014/10/Panko-Crusted-Cod_IG.jpg",
  "href": "https://kitchendreaming.com/panko-crusted-baked-cod-fish/",
  "extension": "Chrome",
  "firstAdded": "2019-04-30T15:47:58.711000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat over to 450 degrees F.",
    "Spray large cookie sheet with cooking spray.",
    "Create a dredge station. Beat egg and egg white in a bowl. Into another shallow dish, place the panko. In a third bowl mix the herbs and spices.",
    "Sprinkle all sides of the fish with he herb and spice mixture.",
    "Dip fish into egg, then into panko, pressing fish into the panko and then turning to coat both sides.",
    "Place fish on cookie sheet, after all fish is coated, spray fish lightly with non-fat cooking spray.",
    "Bake for approximately 15 minutes until coating is nicely browned and fish flakes easily. NOTE: If cooking from frozen allow yourself about 20-30 minutes baking time depending on the thickness of your fillets.",
    "NOTE: If cooking from frozen allow yourself about 20-30 minutes baking time depending on the thickness of your fillets."
  ],
  "ingredients": [
    "0",
    "Fresh cod, cut into 5 (6-ounce serving-size) pieces – I use freshly caught cod",
    "Panko breadcrumbs – I prefer these to plain breadcrumbs but plain may be substituted",
    "Egg plus egg whites (or egg substitute) – Used as a coating to dredge the fish and coat with breadcrumbs",
    "Garlic salt – Roasted garlic powder is my absolute favorite.",
    "Onion powder – This has a very strong onion flavor, a little goes a long way.",
    "Cayenne pepper – just a pinch for some spice",
    "Dried herbs – your choice parsley, thyme, basil, oregano. I vary mine depending on the flavor we are craving.",
    "Salt – I use fine Kosher salt but table salt may be used.",
    "Ground Black Pepper – freshly cracked has more flavor but ground black pepper may also be used.",
    "Non-Fat Cooking Spray – for encouraging browning."
  ],
  "__v": 1
}