{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 350 F. Put the whole, unpeeled potatoes in a pot of water to cover by a couple of inches and bring to a simmer. Cook the potatoes until they are easily pierced with a knife but not falling apart, about 20 minutes. Let them cool slightly, then peel, press through a ricer onto a sheet pan and let cool completely.",
    "Scrape the potatoes into a bowl, and sift over them the flour, baking powder and salt. Mix in the egg to make a smooth dough. Oil a 15 x 10-inch (38 x 25 cm) cookie sheet with olive oil. On a floured surface, roll the dough onto a rectangle almost as large as the cookie sheet, or as large as you can get it. You can roll between layers or parchment paper to make it easier to handle. Transfer dough to cookie sheet and press the dough out to almost reach the edges of the pan.",
    "Top the dough evenly with the mozzarella, leaving a ½-inch (1 cm) border around the edges. Top with the sliced tomatoes, then drizzle with the 2 tbsp (30 mL) olive oil. Sprinkle with dried oregano and grated cheese. Bake until the crust is browned on the bottom and cooked through, about 35 minutes. Allow the pizza to cool on the baking sheet for a few minutes before cutting into squares to serve.",
    "Makes 4 to 6 servings"
  ],
  "firstAdded": "2014-05-09T22:31:37.125000",
  "hash": "7ecb62c6ad67ea53f3f00004b7f9ad82dfe264c2",
  "href": "http://www.vancouversun.com/life/Wine+Match+Pizza+Patate+Potato+Pizza/9510039/story.html",
  "image": "http://www.vancouversun.com/life/Wine+Match+Pizza+Patate+Potato+Pizza/9510039/cms/binary/9510040.jpg",
  "ingredients": [
    "0",
    "1 pound (454 g) russet potatoes",
    "1 ½ cups (375 mL) all-purpose flour, plus more for rolling dough",
    "2 tsp (10 mL) baking powder",
    "2 ½ tsp (12 mL) kosher salt",
    "1 large egg, beaten",
    "2 tbsp (30 mL) extra-virgin olive oil, plus more for cookie sheet",
    "12 oz (340 g) fresh mozzarella, thinly sliced",
    "4 cherry or other small tomatoes, thinly sliced",
    "1 tsp (5 mL) dried oregano",
    "¼ cup (60 mL) grated Grana Padano or Parmigian-Reggiano"
  ],
  "keywords": [
    "russet",
    "potatoes",
    "allpurpose",
    "flour",
    "rolling",
    "dough",
    "baking",
    "kosher",
    "salt",
    "egg",
    "extravirgin",
    "olive",
    "oil",
    "cookie",
    "sheet",
    "mozzarella",
    "cherry",
    "tomatoes",
    "oregano",
    "grana",
    "padano",
    "parmigianreggiano"
  ],
  "title": "Pizza di Patate (Potato Pizza)",
  "users": [
    null
  ]
}