{
  "hash": "ee34c4afd12667ae9c2f8bf4212c880e60cd06ca",
  "title": "Slow Cooker Loaded Baked Potato Soup",
  "image": "http://thechicsite.com/wp-content/uploads/2013/10/TheChic_potato-soup1.jpg",
  "href": "http://thechicsite.com/2013/10/07/slow-cooker-loaded-baked-potato-soup/",
  "extension": "Chrome",
  "firstAdded": "2015-03-03T20:01:56.281000",
  "users": [
    null
  ],
  "keywords": [
    "slices",
    "bacon",
    "pieces",
    "garlic",
    "onion",
    "thyme",
    "allpurpose",
    "flour",
    "lowsodium",
    "chicken",
    "broth",
    "russet",
    "potatoes",
    "chunks",
    "sharp",
    "cheddar",
    "cheese",
    "cream",
    "milk",
    "kosher",
    "salt",
    "black",
    "pepper",
    "green",
    "onions",
    "sour"
  ],
  "directions": [
    "0",
    "In a large skillet, cook bacon over medium heat until crisp. Transfer cooked bacon to paper towel-lined plate and set aside. Keep 3 Tbsp of bacon fat and discard rest. You'll want to keep all that burnt little bits in the pan. They will provide the onions with a lot of flavor.",
    "Heat skillet with 3 Tbsp of bacon fat over medium heat. Add minced garlic and cook for 15-20 seconds until fragrant. Add onions and thyme. Cook until onions have softened.",
    "Add flour and stir to combine. Cook for about one minute and then slowly add 1 cup of chicken broth. Stir to combine. Transfer onion mixture (including all the browned bacon bits from the pan) into the slow cooker pot.",
    "Add cut potatoes in slow cooker pot, following by remaining 4 cups of chicken broth. Cover slow cooker with lid and set to cook for 4-5 hours on low.",
    "Keep slow cooker on \"keep warm\" setting. Once potatoes are soft and tender, scoop out 3 cups of potato from slow cooker. Place in a large bowl and mash using a fork (spoon or muddle work too). Add milk and cream. Stir to combine. Return mixture to slow cooker.",
    "Add shredded cheese to slow cooker and stir to distribute. Cover slow cooker and let sit for 5 minutes until cheese has melted. Season with 1 1/2 tsp salt and 1/2 tsp black pepper. Sample and season more according to taste. Serve with green onions, crumbled bacon, additional cheddar cheese, sour cream, and other toppings your enjoy with baked potato."
  ],
  "ingredients": [
    "0",
    "5 slices bacon, cut into 1-inch pieces",
    "3 garlic cloves, minced",
    "1 large onion, minced",
    "1 tsp fresh thyme, or 1/2 tsp dried thyme",
    "2 Tbsp all-purpose flour",
    "5 cups low-sodium chicken broth",
    "3 pounds russet potatoes, peeled, cut into 1/2-inch chunks",
    "1 1/2 cups sharp cheddar cheese, shredded",
    "1/2 cup heavy cream",
    "1/4 cup whole milk",
    "1 1/2 tsp kosher salt",
    "1/2 tsp black pepper",
    "green onions, for serving",
    "sour cream, for serving",
    "additional sharp cheddar cheese, shredded for serving"
  ],
  "__v": 1
}