{
  "__v": 1,
  "directions": [
    "0",
    "In a stand mixer fitted with the paddle attachment (or a large bowl using a hand mixer) (or a whisk, but be prepared to have sore ass arms), beat the butter on medium speed for about 2 minutes, until creamy. Scrape down the sides of the bowl and add the sugar and vanilla extract; mix on medium speed for an additional minute then add the flax egg and mix just until combined. Off the mixer, scrape down the sides of the bowl, and add the baking soda, baking powder, salt, and flour; mix until combined. Add the chocolate chips and mix until they’re evenly distributed throughout the dough. Wrap dough in plastic and refrigerate for at least four hours or overnight (overnight is best, y’all).",
    "When you’re ready to make the cookies, preheat the oven to 350˚F and line a small baking sheet with parchment paper. Using a 1 1/2 tablespoon cookie scoop, drop dough onto the prepared baking sheet and freeze for 10 minutes. Line a large baking sheet with a silicone mat or parchment paper, and line with chilled cookies, leaving 2-3″ between each cookie. Sprinkle with flaky sea salt then bake at 350˚F for 10 minutes. Allow cookies to cool on sheet for 5 minutes, then transfer to a wire rack to cool completely. You can either repeat the process with the remaining scooped dough (which should be in the freezer while the first batch of cookies are baking), or transfer the rounds to an air tight container and store in the freezer for up to 6 weeks. Allow dough that’s been thoroughly frozen to thaw for 10 minutes before baking. Baked cookies will keep in an air tight container for up to four days.",
    "Yield: About 2 dozen cookies"
  ],
  "firstAdded": "2014-07-07T09:55:12.937000",
  "hash": "d6fb5270c16c325fa00b743bb7192bc949231c87",
  "href": "http://www.ohladycakes.com/2014/02/sea-salt-chocolate-chip-cookies.html",
  "image": "http://farm8.staticflickr.com/7352/12729531794_96479694be_z.jpg",
  "ingredients": [
    "0",
    "1/2 cup vegan butter, cold",
    "2/3 cup brown sugar",
    "1 tsp pure vanilla extract",
    "1 flax egg",
    "1/4 tsp baking soda",
    "1/2 tsp baking powder",
    "1/2 tsp fine sea salt",
    "1 1/4 cups/180g unbleached flour",
    "1/2 cup chocolate chips (or chopped dark chocolate)",
    "Flaky sea salt, for topping"
  ],
  "keywords": [
    "vegan",
    "butter",
    "cold",
    "brown",
    "sugar",
    "vanilla",
    "flax",
    "egg",
    "baking",
    "soda",
    "salt",
    "cupsg",
    "unbleached",
    "flour",
    "chips",
    "dark",
    "chocolate",
    "flaky"
  ],
  "title": "SEA SALT CHOCOLATE CHIP COOKIES",
  "users": [
    null
  ]
}