{
  "hash": "52307eab4e3ee6d97eed7089d9ec3b72ae80df87",
  "title": "SKINNY SLOW COOKER KUNG PAO CHICKEN",
  "image": "https://therecipecritic.com/wp-content/uploads/2017/01/Skinny-Slow-Cooker-Kung-Pao-Chicken-1-650x975.jpg",
  "href": "https://therecipecritic.com/skinny-slow-cooker-kung-pao-chicken/",
  "extension": "",
  "firstAdded": "2019-06-08T15:20:45.021000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large zip-top bag, toss in chicken, salt and black pepper. Shake until well-coated.",
    "Heat a large skillet over medium-high heat. Cook chicken about 2-3 minutes on each side, until lightly browned. **Skip this step if in a pinch and add chicken directly to the slow cooker.",
    "Transfer chicken into slow cooker. (SEE NOTE FOR STOVETOP DIRECTIONS)",
    "In a medium bowl, whisk together the soy sauce, water, honey, hoisin sauce, garlic, ginger and red pepper chili flakes and pour over chicken.",
    "Cover and cook on LOW for 2.5 - 4 hours or HIGH for 1.5 - 3 hours. (SEE NOTE)",
    "About 30 minutes before serving, whisk together the cornstarch and water in a small bowl. Stir into the slow cooker. Add the dried red chili peppers, red bell peppers, zucchini and cashews.",
    "Cover and cook on HIGH for another 20-30 minutes or until the vegetables are tender and the sauce has thickened up. (Add more water to thin out sauce to your preferred consistency).",
    "Sprinkle with sesame seeds, green onions and serve over rice, quinoa or zoodles, if desired."
  ],
  "ingredients": [
    "0",
    "¼ tsp black pepper",
    "⅛ tsp salt",
    "1 - 1¼ lbs boneless, skinless chicken breasts (about 2-3 pieces), cut into bite-sized chunks",
    "3-4 tablespoons olive oil",
    "**4 - 6 dried red chili peppers (to taste) found in Asian supermarkets or the International section of a large chain grocery store - see NOTE",
    "⅔ cup roasted cashews (or roasted peanuts)",
    "1 red bell pepper, chopped into bite-sized pieces",
    "1 medium zucchini, chopped into halves"
  ],
  "__v": 1
}