{
  "hash": "6ceb192351086065475162167d7cc9233d0e6f8e",
  "title": "Shrimp, tomato, and spinach pasta in garlic butter sauce",
  "image": "https://farm4.staticflickr.com/3948/15040593023_26ace8db3c_c.jpg",
  "href": "http://juliasalbum.com/2014/10/shrimp-tomato-and-spinach-pasta-in-garlic-butter-sauce/",
  "firstAdded": "2015-02-20T00:49:29.823000",
  "users": [
    null
  ],
  "keywords": [
    "shrimp",
    "uncooked",
    "shelled",
    "medium",
    "tomatoes",
    "cubes",
    "spinach",
    "garlic",
    "butter",
    "olive",
    "oil",
    "lemon",
    "salt",
    "red",
    "pepper",
    "paprika",
    "fettuccine",
    "pasta",
    "parmesan",
    "cheese"
  ],
  "directions": [
    "0",
    "Cook pasta according to package instructions. Drain and rinse with cold water to prevent pasta from cooking and getting mushy.",
    "Heat a large skillet on medium-high heat, add 1 tablespoon butter and 1 tablespoon olive oil until melted. Add fresh shrimp and half the minced garlic. Cook for 1 minute on one side until pink on that side. While it's cooking, generously sprinkle paprika and salt over uncooked side of the shrimp. Flip the shrimp over and cook for another 1 or 2 minutes until pink on the other side.",
    "To the skillet with shrimp, add chopped fresh tomatoes, cooked spinach, and remaining amount of minced garlic. Add 1/2 teaspoon crushed red pepper (or more). Mix everything well, and make sure the tomatoes are cooked well remove from heat while you cook pasta.",
    "Add pasta to the skillet with shrimp and vegetables with 1 or 2 tablespoons of butter. Add freshly squeezed lemon juice (depending on the juiciness of your lemon, it could be 1/4 of small lemon or 1/2 lemon). Don't add too much lemon juice. Season with salt and more crushed red pepper. Warm it up on medium heat until shrimp is cooked through, and all ingredients are heated through.",
    "To serve, top with grated Parmesan cheese."
  ],
  "ingredients": [
    "0",
    "1 pound fresh shrimp, uncooked, shelled and deveined",
    "5 medium tomatoes, fresh, chopped into large cubes",
    "1 cup cooked spinach",
    "5 garlic cloves, minced",
    "3 or 4 tablespoons butter",
    "1 tablespoon olive oil",
    "1/4 small lemon",
    "salt",
    "1/2 teaspoon crushed red pepper (or more)",
    "paprika",
    "10 oz fettuccine pasta",
    "1/2 cup Parmesan cheese, grated, for serving"
  ],
  "__v": 2
}