{
  "hash": "4ae963f6736426e9587c885f4062b2d670ae6dc3",
  "title": "Vegan Macadamia Nut Brie En Croute",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2013/12/macadmia-nut-brie-en-croute.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/vegan-macadamia-nut-brie-en-croute/",
  "extension": "",
  "firstAdded": "2015-04-01T06:28:37.405000",
  "users": [
    null
  ],
  "keywords": [
    "macadamia",
    "nuts",
    "soaked",
    "hours",
    "cold",
    "water",
    "rinsed",
    "tine",
    "used",
    "macadamias",
    "cashews",
    "liked",
    "better",
    "boiling",
    "tapioca",
    "flour",
    "makes",
    "firmer",
    "brie",
    "maple",
    "syrup",
    "yellow",
    "miso",
    "tahini",
    "rice",
    "vinegar",
    "dijon",
    "mustard",
    "salt",
    "vegan",
    "butter",
    "pamonas",
    "brand",
    "pectin",
    "work",
    "recipe",
    "cranberries",
    "ocean",
    "spray",
    "apple",
    "cider",
    "thyme",
    "wheat",
    "sesame",
    "seeds",
    "black",
    "extra",
    "virgin",
    "olive",
    "oil",
    "smoked",
    "paprika",
    "veggie"
  ],
  "directions": [
    "0",
    "Lightly oil a small round dish (I used a glass tupperware), set aside.",
    "Measure out half of the dry pectin, about 4.5 teaspoons.",
    "Combine calcium packet from pectin box with 1/2 C. water (not listed in ingredients above) in a small lidded jar and shake til thoroughly combined.",
    "Blend all ingredients except pectin and calcium water in your turbo blender or food processor until completely smooth.",
    "Add dry pectin and half (1/4 C.) of the calcium water and pulse until all combined and thick.",
    "Immediately scrape hot brie out into the small round prepared dish.",
    "Refrigerate for a couple hours, turn out on to a plate, brie will be slightly soft (as brie is) but ready to use in this recipe.",
    "1",
    "Combine all ingredients in a saucepan.",
    "Bring to a boil, stirring occasionally. Reduce heat and simmer for 10-15 minutes.",
    "Remove from heat, pour into glass jar.",
    "Let cool and refrigerate until ready for use (this will keep up to a month in the fridge and longer in the freezer and leftovers can easily be saved for the holidays).",
    "2",
    "Preheat oven to 400 degrees. Process all ingredients but water til combined in your food processor.",
    "Add half the water, then add a water a tablespoon at a time (you may not need it all) while pulsing until a round ball of dough forms.",
    "Put dough on a sheet of parchment paper and roll out until PAPER thin (or as thin as you can possibly roll them out).",
    "Brush surface with water and sprinkle with a bit more sea salt or veggie salt.",
    "Cut into squares with a pizza wheel.",
    "Bake for on a baking tray for 8-10 minutes, then remove crackers from parchment paper and bake an additional few minutes on the tray until golden.",
    "3",
    "Preheat oven to 400 degrees. Roll out puff pastry a bit. (I reused the parchment paper I cooked the crackers on for this task) Spoon 1/2 C. Maple Cranberry Sauce into the center.",
    "Top with Macadamia Nut Brie (smooth side touching the cranberry sauce). Leaving a few inches all around, cut puff pastry into a round following the brie as a guide. Tuck edges up in a pinwheel fashion.",
    "Turn right side up and decorate spookily (or festively for other Holidays) with remaining scraps if desired. My attempt at a spiderweb is a little lame, but whateves. I brushed my pastry with 1 T. water and 1 T. pure maple syrup to make it extra glossy.",
    "Bake for 20 minutes until pastry is golden. I broiled mine for 3 minutes to get the pastry to a deeper golden color and it ended up being 2 minutes too long.",
    "Feed to Vegan Zombies on a tray with the savory oven crackers and a side of extra cranberry sauce."
  ],
  "ingredients": [
    "0",
    "1 C. macadamia nuts, soaked 4-8 hours in cold water, then drained and rinsed. Last tine I made this I used 1/2 Macadamias and 1/2 cashews and I liked it even better",
    "1 C. boiling water",
    "2 T. Tapioca Flour (optional, makes for a firmer brie)",
    "1 T. pure maple syrup",
    "1 T. yellow miso",
    "2 T. tahini",
    "1 T. rice vinegar",
    "1 t. dijon mustard",
    "1 t. sea salt",
    "2 T. vegan butter",
    "1/2 package Pamona’s Pectin (only this brand of pectin will work in this recipe)",
    "1",
    "1 package fresh cranberries (I used ocean spray)",
    "2/3 C. pure maple syrup",
    "2/3 C. apple cider",
    "1/4 t. crushed thyme",
    "1/4 t. sea salt",
    "2",
    "1 C. whole wheat flour",
    "1/4 C. sesame seeds (I used black)",
    "2 T. extra virgin olive oil",
    "6-8 T. cold water",
    "1 t. smoked paprika",
    "1 t. veggie salt or sea salt"
  ],
  "__v": 1
}