{
  "hash": "ce7cdcb0ccee048533c6b5c4fc9b32f6c62f6302",
  "title": "Curried Butternut Squash Soup",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2010/02/curried-squash-soup-horiz-a-1600.jpg",
  "href": "https://www.simplyrecipes.com/recipes/curried_squash_soup/",
  "extension": "",
  "firstAdded": "2018-01-28T01:13:05.784000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Sauté the cubed squash: Heat a tablespoon of olive oil in a large, thick-bottomed stock pot on medium heat. Add a dab of butter to the olive oil.",
    "Working in two batches so as not to crowd the pan, add the cubed butternut squash to the pan. Toss to coat all sides with oil. Sprinkle a little salt over the squash. Then spread out in an even layer and let cook, stirring only occasionally, so that the edges and sides get lightly browned.",
    "You may need to adjust the heat up to ensure browning, or down to prevent burning or drying out. Add more oil and butter for the additional batches. Remove from pan and set aside.",
    "2 Sauté the onions, spices, ginger: Heat another tablespoon of olive oil in the pot, on medium heat. Add the chopped onions and cook, stirring now and then, until softened. Add the curry powder, mustard seeds, cumin, and fresh ginger, and cook for a minute or so longer. Use a flat bottomed wooden or metal spatula to scrape up any browned bits.",
    "3 Add the squash, stock, salt, then simmer: Return the butternut squash to the pot. Add the chicken stock and a teaspoon of salt. Increase the heat to bring to a simmer, then lower the heat to maintain a low simmer, cover the pot. Cook for 40 minutes until squash is completely tender.",
    "4 Purée the soup: Use an immersion blender (or a stand up blender in which case work in batches) to blend the soup smooth. Add more salt to taste if needed.",
    "5 Serve with sour cream and cilantro: Serve in individual bowls with a dollop of sour cream and some chopped cilantro."
  ],
  "ingredients": [
    "0",
    "1 2-lb butternut squash, peeled, seeded, diced into 1/2-inch to 3/4-inch cubes, yielding about 6 cups of cubed squash (see how to cut and peel a butternut squash)",
    "Olive oil",
    "1 teaspoon butter",
    "Salt",
    "1 large yellow onion, chopped",
    "2 teaspoons yellow curry powder",
    "1 teaspoon whole mustard seeds (if you substitute ground mustard, only use 1/4 teaspoon)",
    "A dash of ground cumin",
    "1 Tbsp minced fresh ginger",
    "4 cups chicken stock",
    "1 teaspoon salt",
    "1/2 cup sour cream (can substitute plain yogurt)",
    "1/4 cup chopped fresh cilantro (can substitute parsley)"
  ],
  "__v": 1
}