{
  "hash": "1fc5922aabbdc01bc16e97cce7b6976a79256b65",
  "title": "Hearty Paleo Sweet Potato Bread",
  "image": "http://www.paleorunningmomma.com/wp-content/uploads/2016/10/sweet-potato-bread-9.jpg",
  "href": "http://www.paleorunningmomma.com/hearty-paleo-sweet-potato-bread/",
  "extension": "Chrome",
  "firstAdded": "2017-08-07T01:52:03.157000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat your oven to 350 degrees and line an 8 x 4\" loaf pan*** (medium) with parchment paper",
    "In a large mixing bowl whisk the eggs with the mashed sweet potato until smooth. Whisk in the coconut oil, honey or maple and vinegar until combined (don't over-beat)",
    "In a separate medium bowl, combine the almond, coconut, and tapioca flours, baking soda, and salt.",
    "Slowly and carefully mix the dry ingredients into the wet, without over-mixing the batter - mix until just moistened.",
    "Transfer the batter with a rubber spatula into the parchment lined loaf pan, and bake in the preheated oven for 1 hour (you can check around 50 minutes - the top of the loaf should be nicely browned and a toothpick inserted in the center should come out totally clean.",
    "Allow the loaf to cool for about 10 minutes in the load pan, then transfer (grabbing both sides of parchment paper) to a wire rack to cool for at least 1-2 hours before slicing.",
    "Store leftovers in the refrigerator, tightly wrapped in plastic or parchment paper, and enjoy! This bread is great toasted with nut butter, pastured butter, with eggs, or even as a sandwich bread."
  ],
  "ingredients": [
    "0",
    "4 large eggs",
    "½ cup mashed sweet potato* - white sweet potato recommended**",
    "5 tbsp organic coconut oil, melted and cooled to almond room temp",
    "1 tsp raw honey or pure maple syrup",
    "1 tbsp raw apple cider vinegar",
    "1 cup + 5 Tbsp blanched almond flour",
    "3 Tbsp organic coconut flour",
    "¼ cuptapioca flour",
    "1 tsp baking soda",
    "½ tsp plus a pinch of fine grain sea salt"
  ],
  "__v": 1
}