{
  "hash": "793cb1f8d49f4b18a08bd16f26b1547d2ceb2cb2",
  "title": "Maple Peanut Butter Chocolate Chip Oatmeal Cookies!",
  "image": "http://cookieandkate.com/images/2014/05/flourless-peanut-butter-chocolate-chip-cookies1.jpg",
  "href": "http://cookieandkate.com/2014/maple-sweetened-peanut-butter-chocolate-chip-oatmeal-cookies/",
  "firstAdded": "2015-01-07T11:20:39.344000",
  "users": [
    null
  ],
  "keywords": [
    "natural",
    "peanut",
    "butter",
    "real",
    "maple",
    "syrup",
    "preferably",
    "grade",
    "unsalted",
    "coconut",
    "oil",
    "egg",
    "vanilla",
    "baking",
    "soda",
    "finegrain",
    "salt",
    "oldfashioned",
    "rolled",
    "oats",
    "seconds",
    "food",
    "processor",
    "blender",
    "semisweet",
    "chocolate",
    "chips"
  ],
  "directions": [
    "0",
    "Preheat the oven to 350 degrees Fahrenheit with two racks in the middle. Line two baking sheets with parchment paper (if you don't have parchment paper, lightly grease the baking sheets).",
    "Measure out the peanut butter and maple syrup—I found this easiest to do in a 2-cup liquid measuring cup. Add peanut butter to the ⅔ cup line, then pour in maple syrup until you reach the 1⅓ cup total liquid line.",
    "Pour the peanut butter and maple syrup mixture into a mixing bowl. Add the melted butter and whisk until the mixture is well blended. Use your whisk to beat in the egg, scraping down the side of the bowl once it's incorporated, then whisk in the vanilla, baking soda, baking powder and salt. Switch to a big spoon and stir in the ground oats, rolled oats and chocolate chips until they are evenly combined. Drop the dough by the tablespoon onto your prepared baking sheets.",
    "Bake the cookies, reversing the pans midway through (swap the cookies on the top rack with the cookies on the lower rack) until they're barely set and just beginning to turn golden around the edges, about 12 minutes. Remove the cookies from the oven and let them cool completely on the pans."
  ],
  "ingredients": [
    "0",
    "⅔ cup natural peanut butter",
    "⅔ cup real maple syrup, preferably grade B",
    "4 tablespoons (2 ounces) unsalted butter or coconut oil, melted",
    "1 large egg",
    "1 teaspoon vanilla extract",
    "½ teaspoon baking soda",
    "½ teaspoon baking powder",
    "½ teaspoon fine-grain sea salt",
    "1¼ cup old-fashioned rolled oats, ground for 30 seconds in a food processor or blender",
    "1½ cups old-fashioned rolled oats",
    "2 cups (12 ounces) semi-sweet chocolate chips"
  ],
  "__v": 1
}