{
  "hash": "cfbab4e81f0d11dd94ef24ca9906c9e90a645860",
  "title": "CALZONES",
  "image": "",
  "href": "http://lidiasitaly.com/recipes/calzones/",
  "extension": "Chrome",
  "firstAdded": "2018-02-28T16:53:10.067000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "Line a sieve with a double thickness of cheesecloth or basket-type coffee filter. Dump the ricotta in and set the sieve over a bowl. Cover with plastic wrap and refrigerate overnight or up to 1 day. Discard the drained liquid.",
    "Prepare the pizza dough. It isn’t necessary to divide the dough before the second rising.",
    "Slice the leeks crosswise, ½ inch thick. In a large, deep skillet or braising pan, heat 3 tablespoons olive oil over medium-high heat. Add the leeks, season lightly with salt and pepper, and cook until softened, about 4 minutes.",
    "Stir in the spinach a large handful at a time, waiting for each handful to wilt somewhat before adding the next. Continue cooking until the spinach is completely wilted and all the liquid is evaporated, about 4 minutes.",
    "Drain in the colander, pressing lightly to remove excess liquid. Stir the drained ricotta and mozzarella together in a bowl until blended. Season to taste with salt and pepper.",
    "Place one oven rack in the lowest position and the second rack in the upper third of the oven. Center a baking stone, if using, over the lower rack. Preheat the oven to 450 degrees. If not using a baking stone, sprinkle two large baking sheets generously with coarse cornmeal.",
    "Divide the dough in half. Working with one half at a time, roll the dough out on a lightly floured surface to about 1/4 –inch thick. Cut the dough into 4-inch circles and reserve the unused dough. Spread 3 tablespoons of the cheese mixture in an even layer over half of each circle, leaving a ½-inch border around the edge. Top the cheese with about 1 tablespoon of the spinach and leeks. Brush the edges of the circles with water and fold the uncovered dough over the spinach-cheese filling. Seal the edges by pressing firmly with the tips of fork tines or by plaiting the edges. Poke holes into the top of each calzone several times with a fork. Brush the tops of the calzones with olive oil. Let stand until slightly puffed, about 15 minutes.",
    "To bake the calzones on a baking stone first sprinkle a pizza peel or perfectly flat baking sheet generously with cornmeal. Place three or four of the calzones on the prepared peel and slide them onto one side of the stone, leaving some space between them. Repeat with a second round of three or four calzones. Bake the calzones until lightly browned on the underside, about 8 minutes.",
    "Transfer the calzones directly to the upper rack and continue baking until deep golden brown, about 20 minutes. Start baking a second batch on the stone once you remove the first batch.",
    "Let stand at least 10 minutes before serving."
  ],
  "ingredients": [
    "0",
    "1 pound fresh ricotta, or one 15-ounce container whole-milk ricotta",
    "Pizza Dough (recipe)",
    "2 medium leeks, white and light green parts only, trimmed and cleaned",
    "3 tablespoons extra-virgin olive oil, plus more for brushing the calzones",
    "salt",
    "Freshly ground black pepper",
    "1 pound fresh bunch spinach, stems removed, leaves washed and drained, or one 10-ounce bag",
    "12 ounces fresh mozzarella, cut into ½-inch cubes",
    "Coarse cornmeal"
  ],
  "__v": 1
}