{
  "hash": "d66b3e75234ebd9b9757df6fa7aec4a9db995138",
  "title": "Overnight Kale Breakfast Strata",
  "image": "https://yummybeet.com/wp-content/uploads/2015/11/Strata-recipe-with-kale-683x1024.jpg",
  "href": "https://yummybeet.com/stratarecipe/",
  "extension": "Firefox",
  "firstAdded": "2018-10-02T05:10:12.717000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large high-sided skillet, melt 2 Tbsp butter or oil over medium heat. Add onion and sauté for 8 to 10 minutes, until soft and beginning to brown. Add kale, cover, and cook until wilted (about 1 minute; add a splash of water to hasten process). Stir to incorporate. Add to a large mixing bowl along with cubed bread. Grease an 8×8-inch ceramic or glass casserole dish or large cast-iron skillet with additional butter or oil. Add bread mixture in an even layer.",
    "In a medium bowl, whisk eggs until emulsified. Whisk in milk, thyme, salt, pepper, and nutmeg. Slowly and evenly pour over bread mixture. Press down with your hands to make the bread soaks it up. Cover and refrigerate overnight, bringing to room temperature before popping it in the oven; if baking immediately, allow the strata to sit for 30 minutes before baking.",
    "Preheat oven to 350ºF. Bake strata for 40 minutes to 1 hour, until puffed, golden brown, and the centre is just set and hot (test with a knife inserted in the centre). Let sit for 5 minutes before slicing and serving. Leftovers reheat beautifully."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "2 tablespoons butter (unsalted or salted) or coconut oil, plus more for greasing",
    "1 onion, diced",
    "1/2 bunch kale (about 4 packed cups), de-stemmed and cut into bite-sized pieces",
    "1/2 (1 1/4 pound loaf; so about 2/3 pound or 5 cups cubed) day-old, rustic-style sourdough rye or day-old rustic-style sourdough of choice, cut into 1-inch cubes",
    "5 large eggs",
    "2 cups unsweetened plain almond milk or milk of choice",
    "1/2 teaspoon dried thyme",
    "1/2 teaspoon salt",
    "ground black pepper, to taste",
    "1/8 teaspoon ground nutmeg"
  ],
  "__v": 1
}