{
  "hash": "3647c52d24399b82672a0c392e41533fb3b14860",
  "title": "BREAKFAST SANDWICHES",
  "image": "https://i1.wp.com/www.simplysissom.com/wp-content/uploads/2017/02/finalverticalbreakfastsandwich-copy.jpg?resize=680%2C1020",
  "href": "http://www.simplysissom.com/batch-prep-breakfast-sandwiches/",
  "extension": "Chrome",
  "firstAdded": "2017-10-30T12:08:04.763000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "NSTRUCTIONS",
    "Heat oven to 325 and coat a 12″x16″ rimmed baking sheet with non-stick spray. Chop peppers, onions and turkey sausage. Scatter chopped veggies and sausage on prepared baking sheet.",
    "In a medium sized mixing bowl, combine eggs, milk, salt and pepper. Whisk to combine. Pour egg mixture onto rimmed baking sheet. Bake until eggs are solid, about 30 minutes. Remove from oven and allow eggs to cool completely.",
    "Blot eggs with a paper towel to remove excess moisture. Use the top of a wide mouth mason jar to cut out egg circles (or just slice eggs into squares using a sharp knife).",
    "Build breakfast sandwiches by layering English muffin bottom, cheese, egg, and English muffin top.",
    "Wrap each sandwich in plastic wrap and use a sharpie to write date. Store in freezer.",
    "To serve, pop sandwich into the microwave or oven until warmed through. Add spinach, mashed avocado and a hot sauce."
  ],
  "ingredients": [
    "0",
    "HOW TO BATCH PREP BREAKFAST SANDWICHESskip to recipe",
    "February 9, 2017 by Bailey Sissom Leave a Comment",
    "Tweet",
    "Share",
    "28",
    "Pin",
    "245",
    "Yum",
    "1",
    "SHARES 274",
    "How To Batch Prep Breakfast Sandwiches for the entire week (or even month) so that you have a healthy grab-n’ go breakfast option.",
    "Pin How To Batch Prep Breakfast Sandwiches for later!",
    "Save",
    "Ok guys.. so this is a post I am SO SO SO excited about. Since I blog about things that I am making and eating in my real life, you may have noticed that I am officially having a moment with batch-prepping. In other words, if you are already making something, why not make LOTS of it and save some for later?",
    "Most of my batch prepping looks something like this… Double the recipe I’m making for dinner and then portion the leftovers into individual containers that I can eat for lunch throughout the week. It has really helped eliminate impulsive unhealthy snacking and lunch choices throughout the day.",
    "These breakfast sandwiches are a little different. First of all, these aren’t for me, they’re for Joe. While I’m perfectly happy with avocado toast and some ALL the coffee in the morning, he likes something a little more filling. Unfortunately for him, his wife isn’t an early rising domestic goddess that whips up eggs, sausage, biscuits and gravy each morning (or really any morning for that matter).",
    "I have always found prepping breakfast sandwiches to be tedious (so I rarely did it). First toast all the bread, then cook all the sausage patties, fry eggs 1 at a time for what seems like hours.. you get the idea! You guys, yesterday I saw a video on my Facebook page and breakfast around here is forever changed.",
    "Cook eggs (with sausage and veggies) on a sheet pan, slice it up and throw it on a sandwich. Where has this been all my life? Check out how simple this is!",
    "Start by chopping your veggies, spraying your sheet pan and mixing up the egg mixture.",
    "Save",
    "Report this ad",
    "Next, poor the egg mixture into the sheet pan, bake, cool and then cut out circles! I used a wide mouth mason jar and the circles were perfect for my English muffins. Cutting circles took a little time and wasted quite a bit of egg. If you aren’t going for looks you can always just slice the eggs into squares. It may not fit the bread perfectly, but the taste is all the same!",
    "Save",
    "Slice English Muffins in half, build your sandwiches, wrap em up, date em and freeze.",
    "Save",
    "Report this ad",
    "To serve, pop them in the oven or the microwave until they are nice and toasty and load em up with all your favorite good for you things. I like smashed avocado, hot sauce and baby spinach leaves.",
    "Save",
    "Time Saving Tips and Tricks:",
    "Prep: If you’re using veggies they can be chopped ahead of time. You can also pre-cook sausage and store it in the fridge for 1-2 days.",
    "Make Ahead: Of course!!! That’s the point of batch prepping.",
    "Freezer: Yes! These sandwiches are completely freezer friendly. Just make sure that you don’t skip the step of blotting the eggs with a paper towel prior to freezing.",
    "PRINT",
    "HOW TO BATCH PREP BREAKFAST SANDWICHES",
    "Save",
    "Author: Bailey Sissom",
    "Prep Time: 15 mins",
    "Cook Time: 30 mins",
    "Total Time: 45 minutes",
    "Yield: 12-16 sandwiches",
    "INGREDIENTS",
    "1 bell pepper, diced",
    "1 small onion, diced",
    "7 oz. pre-cooked turkey sausage (I used Applegate)",
    "8 eggs",
    "1 1/2 cups milk",
    "1 tsp salt",
    "1/2 tsp pepper",
    "12 – 16 whole-grain English muffins",
    "8 slices cheese, thin sliced",
    "Optional Toppings: spinach, guacamole, sliced avocado, hot sauce"
  ],
  "__v": 1
}