{
  "hash": "8cf536639d73973e98ab05cade309bbc7092e8b4",
  "title": "Garlic Butter Steak",
  "image": "http://recipe-folder.com/img/recipe-images/023/174/4275198223.jpg",
  "href": "http://recipe-folder.com/recipe/5e4d075948b072082129555b",
  "extension": "User Added",
  "firstAdded": "2020-02-19T10:00:57.183000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 200°F (95°C).",
    "1",
    "Generously season all sides of the steak with salt and pepper.",
    "2",
    "Transfer to a wire rack on top of a baking sheet, then bake for about 45 minutes to an hour until the internal temperature reads about 125°F (51° C) for medium-rare. Adjust the bake time based on if you like your steak more rare or more well-done (you monster).",
    "3",
    "Heat the canola oil in a pan over high heat until smoking. Do not use olive oil, as its smoke point is significantly lower than that of canola oil and will smoke before reaching the desired cooking temperature.",
    "4",
    "Sear the steak for 30 seconds on the first side, then flip.",
    "5",
    "Add the butter, garlic, rosemary, and thyme and swirl around the pan.",
    "6",
    "Transfer the garlic and herbs on top of the steak and baste the steak with the butter using a large spoon.",
    "7",
    "Baste for about 30 seconds, then flip and baste the other side for about 15 seconds.",
    "8",
    "Turn the steak on its side and cook to render off any excess fat.",
    "9",
    "Rest the steak on a cutting board or wire rack for about 10 minutes. Slicing the steak before the resting period has finished will result in a lot of the juices leaking out, which may not be desirable.",
    "10",
    "Slice the steak into ½ -inch (1 cm) strips, then fan out the slices and serve.",
    "11",
    "Enjoy!"
  ],
  "ingredients": [
    "0",
    "for 2 servings",
    "1",
    "1 ribeye steak, 2 inch (5 cm) thick, preferably USDA Prime",
    "2",
    "salt, to taste",
    "3",
    "pepper, to taste",
    "4",
    "3 tablespoons canola oil",
    "5",
    "3 tablespoons butter",
    "6",
    "3 cloves garlic, peeled and smashed",
    "7",
    "2 sprigs fresh rosemary",
    "8",
    "3 sprigs fresh thyme"
  ],
  "__v": 1,
  "hidden": true
}