{
  "hash": "0243866feb488475f302fc730eb7bd2612f18c67",
  "title": "Candied citrus peel",
  "image": "http://www.bbcgoodfood.com/sites/bbcgoodfood.com/files/recipe_images/candied-citrus-peel.jpg",
  "href": "http://www.bbcgoodfood.com/recipes/candied-citrus-peel",
  "firstAdded": "2014-12-11T21:13:38.337000",
  "users": [
    null
  ],
  "keywords": [
    "unwaxed",
    "oranges",
    "lemons",
    "granulated",
    "sugar",
    "bar",
    "dark",
    "chocolate",
    "glutenfree",
    "alternative"
  ],
  "directions": [
    "0",
    "Cut the fruit into 8 wedges, then cut out the flesh, leaving about 5mm thickness of peel and pith. Cut each wedge into 3-4 strips.",
    "Put the peel in a pan and cover with cold water. Bring to the boil, then simmer for 5 mins. Drain, return to the pan and re-cover with fresh water. Bring to the boil, then simmer for 30 mins.",
    "Set a sieve over a bowl and drain the peel, reserving the cooking water. Add 100g sugar to each 100ml water you have. Pour into a pan and gently heat, stirring to dissolve the sugar. Add the peel and simmer for 30 mins until the peel is translucent and soft. Leave to cool in the syrup, then remove with a slotted spoon and arrange in 1 layer on a wire rack set over a baking sheet. Put in the oven at the lowest setting for 30 mins to dry.",
    "Sprinkle a layer of sugar over a sheet of baking parchment. Toss the strips of peel in the sugar, a few at a time, then spread out and leave for 1 hr or so to air-dry.",
    "Pack the peel into an airtight storage jar or rigid container lined with baking parchment. Will keep for 6-8 weeks in a cool, dry place.",
    "To make into a delicious gift, melt the chocolate in a small bowl. Dip the candied orange peel into the chocolate to half-coat them, shaking off the excess. Put them on baking parchment to set, then pack into small cellophane bags tied with ribbon or pretty kitchen string."
  ],
  "ingredients": [
    "0",
    "4 large unwaxed oranges, or 2 oranges and 2 lemons",
    "big bag of granulated sugar",
    "100g bar of dark chocolate (or gluten-free alternative), optional"
  ],
  "__v": 1
}