{
  "hash": "8e993aa3ab890ac2ef00f0176c8940804a3469af",
  "title": "Caponata",
  "image": "https://farm6.staticflickr.com/5690/20482575850_ccf1fd9a13_z.jpg",
  "href": "https://smittenkitchen.com/2015/09/caponata/",
  "extension": "Chrome",
  "firstAdded": "2018-09-07T17:07:52.841000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large skillet (12 inches is ideal), heat oil over medium-high heat. Once very hot, working in batches, fry eggplant cubes in one layer at a time, stirring and turning occasionally until golden brown, about 3 to 5 minutes. Use a slotted spoon to drain eggplant over skillet, then transfer to a paper towel-lined plate and immediately season with salt. Repeat with remaining eggplant. Transfer drained and mostly cooled eggplant to a large bowl.",
    "Pour off all but 3 tablespoons olive oil, and reserve the rest for another use. Cook onions and and celery with salt and pepper over medium-high heat until beginning to brown, about 10 minutes. Reduce heat to medium, add tomato paste and water and cook, stirring, until caramelized and almost evaporated, 2 minutes. Reduce heat to medium and add crushed tomatoes; cook for 10 minutes. Stir in olives, vinegar, raisins, capers, and sugar and cook, stirring occasionally, until thickened, about 15 minutes more. Transfer to bowl with eggplant, along with basil and pine nuts, and stir to combine. Season with salt and pepper to taste, and let cool to room temperature before serving.",
    "Do ahead: If you have time to spare, covering your cooling bowl of caponata with plastic and letting it sit for at least 2 hours gives an even more developed flavor. It’s even better on the second day. Keep it in the fridge and bring it out an hour before you plan to eat it to take the chill off. Caponata keeps for one week in the fridge."
  ],
  "ingredients": [
    "0",
    "Enough olive oil to deep fry",
    "2 pound eggplant, cut into 1″ cubes",
    "1 large yellow or sweet-variety onion, chopped medium-small",
    "1 to 2 celery ribs, thinly sliced",
    "Kosher salt and freshly ground black pepper, to taste",
    "3 tablespoons tomato paste",
    "1⁄4 cup water",
    "1 cup crushed canned tomatoes (or use fresh, see directions up top)",
    "6 ounces (about 1 cup) green olives, pitted and roughly chopped",
    "1⁄2 cup white wine vinegar",
    "1⁄2 cup golden raisins (I used half for a less sweet caponata)",
    "1⁄4 cup salt-packed capers, rinsed and drained",
    "1 to 2 tablespoons sugar (I used 1 tablespoon, but sweeter is more traditional)",
    "1⁄2 cup finely slivered basil",
    "2 tablespoons pine nuts, toasted until golden and cooled"
  ],
  "__v": 1
}