{
  "hash": "4117826ea3224d1d5c5353edd90c6c489aa5e910",
  "title": "YOUR PERSONALITY TYPE IS:\nPROTAGONIST (ENFJ-T)",
  "image": "https://storage.googleapis.com/neris/public/images/types/results/enfj.png",
  "href": "https://www.16personalities.com/enfj-personality",
  "extension": "Chrome",
  "firstAdded": "2017-03-15T16:02:21.563000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "YOUR PERSONALITY TYPE IS:",
    "PROTAGONIST (ENFJ-T)"
  ],
  "ingredients": [
    "0",
    "This trait determines how we interact with our environment.",
    "80%",
    "EXTRAVERTED",
    "20%",
    "ENERGY",
    "This trait shows where we direct our mental energy.",
    "73%",
    "INTUITIVE",
    "27%",
    "NATURE",
    "This trait determines how we make decisions and cope with emotions.",
    "46%",
    "THINKING",
    "54%",
    "FEELING",
    "TACTICS",
    "This trait reflects our approach to work, planning and decision-making.",
    "57%",
    "JUDGING",
    "43%",
    "PROSPECTING",
    "IDENTITY",
    "This trait underpins all others, showing how confident we are in our abilities and decisions.",
    "31%",
    "ASSERTIVE",
    "69%",
    "TURBULENT",
    "GET RESULTS BY E-MAIL",
    "START READING",
    "859K",
    "SHARES",
    "PROTAGONIST PERSONALITY (ENFJ, -A/-T)",
    "Everything you do right now ripples outward and affects everyone. Your posture can shine your heart or transmit anxiety. Your breath can radiate love or muddy the room in depression. Your glance can awaken joy. Your words can inspire freedom. Your every act can open hearts and minds.",
    "David Deida",
    "Protagonists are natural-born leaders, full of passion and charisma. Forming around two percent of the population, they are oftentimes our politicians, our coaches and our teachers, reaching out and inspiring others to achieve and to do good in the world. With a natural confidence that begets influence, Protagonists take a great deal of pride and joy in guiding others to work together to improve themselves and their community."
  ],
  "__v": 1
}