{
  "hash": "0f90300c38e58e23c19590a26d0aa00ff2d42184",
  "title": "The Gefilteria’s carrot citrus horseradish\nYields about 24 oz.",
  "image": "http://t5dw12a2mxz42vnqk1utxqwi.wpengine.netdna-cdn.com/wp-content/uploads/sites/2/2014/04/CCH-Cropped.png",
  "href": "http://www.ediblebrooklyn.com/2014/04/09/recipe-gefilterias-carrot-citrus-horseradish/",
  "firstAdded": "2015-02-02T21:02:15.368000",
  "users": [
    null
  ],
  "keywords": [
    "carrots",
    "washed",
    "trimmed",
    "horseradish",
    "root",
    "sugar",
    "kosher",
    "passover",
    "white",
    "vinegar",
    "water",
    "lemon",
    "juice",
    "zest",
    "salt"
  ],
  "directions": [
    "0",
    "Place carrots in a saucepan and fill with enough water to cover them. Boil carrots until lightly cooked but not mushy (about 5 minutes, although times vary depending on thickness of carrots), drain and set aside.",
    "In a separate saucepan, combine water with the sugar and vinegar. Heat until mixture arrives at a slow boil, stirring until sugar is dissolved. Remove from heat and set aside.",
    "Place horseradish root in food processor with cooked carrots, lemon juice, lemon zest and salt. Pulse processor, pouring vinegar solution into the processor gradually, making sure to stir ingredients between pulses. You do not want the mixture to be soupy, so add liquid only until the carrot-horseradish mix is fully coated, shiny and moist. Be careful not to put your face too close to the processor while taking the top off. It will be intense!",
    "Place horseradish in a sealed container. Add more vinegar solution if mixture looks dry. Let it sit in the refrigerator for at least 24 hours before eating."
  ],
  "ingredients": [
    "0",
    "1 lb. carrots, washed, peeled, and trimmed",
    "1/2 lb. horseradish root, washed, peeled, and trimmed",
    "1/2 cup sugar",
    "1/2 cup kosher for Passover white vinegar",
    "1 cup water",
    "3 1/2 tablespoons lemon juice",
    "1 tablespoon grated lemon zest",
    "1/2 teaspoon salt"
  ],
  "__v": 1
}