{
  "__v": 1,
  "directions": [
    "0",
    "Preheat the oven to 150 -170 degrees F. If your oven doesn't go this low, simply set it to the lowest temperature and prop the door open.",
    "Puree the strawberry pulp and lemon juice in a food processor. If you choose another fruit you can chop it and stew it with the lemon juice until it softens before pureeing it. Stewing the fruit helps it retain its color. If it is a fruit with seeds, a food mill will remove the seeds more easily than a food processor and strainer. Add a small amount of water to the mixture if necessary so that it has a pourable consistency.",
    "Cover a baking sheet with plastic, parchment paper, or a silicon baking pad. The temperature of the oven is low enough not to affect the plastic. (Note: wax paper will not work for this recipe, it will stick.)",
    "Spray or brush with vegetable oil, then spread the fruit puree onto the sheet tray with an offset spatula or knife to 1/8-1/4 inch thickness. Place it in the oven for 6-8 hours. Make sure there is air circulating to prevent scorching. Alternatively place it in the sun for 6-8 hours.",
    "Invert the fruit leather onto another baking sheet covered in plastic or silicon baking pad, and oil, and remove the first lining. Place in the oven or sun for another 6-8 hours. If it becomes too brittle at any point, simply brush on water with a pastry brush to rehydrate it.",
    "Cool the sheet tray and cut the fruit leather into desired sizes. Dust with corn starch to prevent sticking, cover in plastic and store in a cool place in a sealed container."
  ],
  "firstAdded": "2014-07-10T22:16:16.141000",
  "hash": "d35b84bbe6ca22636382dd938b67818aeadd1969",
  "href": "http://georgiapellegrini.com/2010/07/23/recipes/homemade-fruit-leather/",
  "image": "",
  "ingredients": [
    "0",
    "2 cups fruit pulp",
    "1 tablespoon lemon Juice",
    "¼ cup sugar (optional, depending on the sweetness of your fruit)"
  ],
  "keywords": [
    "fruit",
    "pulp",
    "lemon",
    "juice",
    "sugar",
    "depending",
    "sweetness"
  ],
  "title": "“Homemade Fruit Leather”",
  "users": [
    null
  ]
}