{
  "hash": "863586d88878e23460dbd4420164c893ca53da69",
  "title": "VEGAN SWEDISH BEYOND MEATBALLS\nSERVES\n4 PREP TIME\n20 MINUTES COOK TIME\n30 MINUTE",
  "image": "https://beyondmeat-uploads.s3.amazonaws.com/recipes/vegan-swedish-beyond-meatballs/10431568_477357575733911_8406031527937527111_n.jpg",
  "href": "https://www.beyondmeat.com/recipes/view/vegan-swedish-beyond-meatballs",
  "extension": "Chrome",
  "firstAdded": "2018-11-30T02:22:34.749000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Saute the finely diced onion in 2 tablespoons Earth Balance over medium high heat until soft.",
    "Remove and allow to cool.",
    "In a mixing bowl, mix the bread cubes with the cashew cream, only adding a bit of the cream (or soy cream) at a time until the bread becomes moist, not saucy.",
    "Set aside for about 10 minutes or so.",
    "Add the onions to the bread mixture along with all of the remaining ingredients and seasonings for the meatballs.",
    "Simply pinch off and round each meatball with your hands.",
    "Try and keep them somewhat uniform.",
    "Apply medium pressure with balling so they will not break apart while cooking.",
    "Heat 6 tablespoons of Earth Balance in a large saute pan over medium heat.",
    "When the butter has melted, start browning your meatballs.",
    "DO NOT CROWD! Do the Browning in batches.",
    "Use care when turning them so they do not fall apart. Sing to them. Tell them how lovely they are.",
    "Remove each batch as the are browned on all sides.",
    "Use a slotted spoon to remove them as you want to keep the butter and drippings in the pan for the sauce.",
    "You may have to add more butter if most is gone or if it tastes burnt.",
    "You want to keep the equivalent of 6 tablespoons of butter in the pan.",
    "Slowly whisk in your flour.",
    "Stir constantly until it looks like a golden caramel color.",
    "Remove from heat.",
    "Heat your veggie stock.",
    "Once it has a light steam to it, replace your butter/flour to the burner and whisk in the veggie stock. Stir constantly. Add in your mushrooms and keep whisking.",
    "Reduce the heat and add your meatballs.",
    "Cover and simmer until the sauce thickens. If it thickens too much, add a bit of creamer or veg stock by whisking. Keep an eye on it.",
    "Turn your meatballs, grab your dry sherry and splash some in while whisking vigorously.",
    "Can you smell it? Yum! Now remove from the heat once the gravy is the thickness you desire.",
    "Using a slotted spoon, remove the balls and plate them over your pasta or rice. Add the vegan sour cream while still whisking vigorously.",
    "Once well blended and gorgeous, ladle over the meat balls and serve with style and grace to your friends or family. I like to top mine with just a whisper of chopped cilantro and some Lingonberry sauce on the side."
  ],
  "ingredients": [
    "0",
    "For the meatballs:",
    "1 medium yellow onion finely minced",
    "2 tablespoons Earth Balance",
    "2/3 cups CASHEW cream or plain soy creamer",
    "3 slices of bread, crusts cut off, and cubed 1 package of Beyond Meat Crumbles, thawed",
    "1 package (chub) of Gimme Lean Sausage Style.",
    "2 teaspoons of sea salt",
    "1/2 teaspoon of nutmeg",
    "1/2 teaspoon of cardamom",
    "1 teaspoon of black pepper",
    "Sauce:",
    "6 tablespoons of Earth Balance",
    "1/3 cup of unbleached flour",
    "1 quart of veggie chicken stock or plain veggie stock with a tablespoon of poultry seasoning added",
    "12 ounces of vegan sour cream, or even more to taste.",
    "Sea salt to taste",
    "1 cup of crimini mushrooms sliced thin",
    "1/4 cup of dry sherry (optional)"
  ],
  "__v": 1
}