{
  "hash": "16d3c40f85d088c167fd2a714960f91aeda7ba39",
  "title": "Chicken Thighs with Tomato, Orzo, Olives, and Feta",
  "image": "https://images.food52.com/Nz-L0SriAUpery06jiwjO7-P-rA=/753x502/a3fb4271-6b16-443b-a5b1-b41ef013eac4--2015_1006_chicken-thighs-tomato-orzo-olives-and-feta_bobbi-lin_12728.jpg",
  "href": "https://food52.com/recipes/34205-chicken-thighs-with-tomato-orzo-olives-and-feta",
  "extension": "Chrome",
  "firstAdded": "2018-01-16T01:45:30.844000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "First, toast the orzo. It’s a bit of a pain, but it really improves the flavor. Heat a large skillet or a Dutch oven if you’re so inclined (I find a reason to use my Staub cocotte for everything) over medium-high heat. Toast the orzo until it is lightly browned, but before it gets too fragrant. Spoon the orzo into a bowl and set aside.",
    "Next up is the chicken. Pat the thighs dry and season with oregano, paprika, salt, and pepper. Heat 1 tablespoon of olive oil in the skillet or Dutch oven on medium-high heat until it is nice and hot and beginning to smoke. Brown the chicken for roughly three minutes on each side, then remove it and set it aside. Turn the heat down a notch and add in the other tablespoon of oil and the minced garlic. Cook for 30 seconds, until fragrant, but be careful not to burn it. Then pour in the broth and throw in the tomatoes and orzo. Give the mixture a good stir and bring it to a boil.",
    "Finally, add the chicken back in, cover the skillet/Dutch oven, and let it sit on medium-low heat until the orzo is tender and the chicken is cooked through. This will take 15 minutes or so. Be sure to check on the dish from time to time as you don’t want the orzo to become mushy and overcooked.",
    "When ready, turn off the heat and add in the red pepper flakes, capers, Kalamata olives, feta, and basil. Top it all off with a drizzle of nice finishing oil, give it another good stir or two and you’re ready to serve!"
  ],
  "ingredients": [
    "0",
    "2 tablespoons olive oil",
    "1 1/2 pounds boneless chicken thighs",
    "1 teaspoon dried oregano",
    "1/2 teaspoon smoked paprika",
    "1/4 teaspoon red pepper flakes",
    "1 cup orzo",
    "3 garlic cloves, minced",
    "8 ounces grape tomatoes, halved",
    "1 1/2 cups low-sodium chicken broth",
    "1 tablespoon capers",
    "2 tablespoons Kalamata olives, halved",
    "1/4 to 1/2 cups crumbled feta",
    "Fresh basil, chopped",
    "Kosher salt and freshly ground black pepper to taste",
    "Drizzle of finishing olive oil—I like the smoked variety"
  ],
  "__v": 1
}