{
  "hash": "22daf4a981e52c77ba17f87f5717e247c4ce57a9",
  "title": "Poor Man Cookies (Fattigman)",
  "image": "https://www.thespruceeats.com/thmb/rkyXjBPqewJN2R9bi883LiVImYg=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/fattigman-poor-man-cookies-2952727-hero-01-5beb306f46e0fb005156a6fb.jpg",
  "href": "https://www.thespruceeats.com/fattigman-poor-man-cookies-2952727",
  "extension": "Chrome",
  "firstAdded": "2018-12-11T13:13:17.792000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Steps to Make It",
    "Gather the ingredients.",
    "Cream together the eggs, sugar, and brandy (if using).",
    "Stir in the melted butter.",
    "Gently fold the whipped cream into the batter.",
    "Sift together the flour, cardamom, baking powder, and salt.",
    "With a light hand, mix the dry ingredients into the batter to form a soft dough. You want to avoid handling the dough much. Otherwise, the cookies will end up tough.",
    "Chill the dough, covered, for at least 30 minutes or overnight.",
    "Roll the chilled dough out on a floured board to a thickness of 1/8 inch.",
    "Using a fattigman cutter or a pastry cutter, cut the dough into diamond shapes about 1 1/4-inch wide by 3 1/2-inches long. If you're using a pastry cutter, cut the dough first into 1 1/4-inch strips and then cut across these diagonally to form diamonds.",
    "Use a knife to cut a 1/2-inch slash in the middle of each diamond.",
    "Twist one corner of each diamond up through the center slash to make a knot.",
    "Heat 2 inches of oil in the bottom of a heavy pot to 375 F.",
    "Drop in the pastry knots and fry them until they are golden brown, turning occasionally.",
    "Remove and drain on paper towels.",
    "Sprinkle the cookies with vanilla sugar or powdered sugar and serve immediately",
    "Storage",
    "You can store your cookies for up to a week in an airtight container. But many people think they taste best as soon as they've cooled enough to enjoy, immediately after frying.",
    "Tip",
    "If you're preparing the cookies ahead, store them in an airtight container without sprinkling with sugar. Warm them in a low oven before serving and then sprinkle with the sugar."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 eggs",
    "1/4 cup superfine baker's sugar",
    "Optional: 1 tablespoon cognac or brandy",
    "3 tablespoons butter (melted)",
    "1/3 cup heavy cream (whipped into stiff peaks)",
    "2 cups all-purpose flour",
    "1 teaspoon cardamom (freshly ground)",
    "1/2 teaspoon baking powder",
    "1/2 teaspoon salt",
    "For frying: 6 cups vegetable or canola oil",
    "Garnish: vanilla sugar or powdered sugar"
  ],
  "__v": 1
}