{
  "__v": 1,
  "directions": [
    "0",
    "Prep:15min › Cook:1hr › Ready in:1hr15min",
    "Using a pair of kitchen scissors cut the sausages into small chunks. Heat the oil in a large pan and fry the sausages for 5 minutes until browned. Remove the sausages from the pan into a flameproof casserole.",
    "Drain most of the oil from the pan then add the onion and cook for 5 minutes. Add the carrots, leek and garlic and cook for a further 5 to 10 minutes until starting to soften. Add the flour and red wine and stir with a wooden spoon, scraping at the bottom of the pan. Stir in the tomato puree, then transfer the mixture to the casserole.",
    "Add the herbs, bay leaf, seasoning and stock to the casserole and stir thoroughly. Bring to the boil then cover and reduce the temperature and simmer for 30 to 45 minutes, stirring occasionally. Serve with a dollop or two of mash.",
    "Slow cooker method",
    "Alternatively follow step 1 then transfer all the ingredients into a slow cooker, cook on a high setting for 1 hour then reduce to a low setting and cook for a further 6 to 8 hours.",
    "Tip",
    "Slicing the sausages before cooking results in them absorbing the juices during the cooking process and remaining juicy and full of flavour."
  ],
  "firstAdded": "2014-10-18T15:12:14.725000",
  "hash": "b316c81dbb4212a02136cf4345c60607a176e7d4",
  "href": "http://allrecipes.co.uk/recipe/33423/cumberland-sausage-casserole.aspx?o_is=LV3",
  "image": "",
  "ingredients": [
    "0",
    "Serves: 4",
    "6 cumberland sausages",
    "1 teaspoon olive oil",
    "1 onion, chopped",
    "2 carrots, chopped",
    "1 leek, chopped",
    "2 cloves garlic, chopped",
    "1 tablespoon plain flour",
    "175ml red wine",
    "1 teaspoon tomato puree",
    "1 teaspoon mixed herbs",
    "1 bay leaf",
    "1 pinch salt",
    "1 pinch ground black pepper",
    "300ml vegetable stock (hot)"
  ],
  "keywords": [
    "serves",
    "cumberland",
    "sausages",
    "olive",
    "oil",
    "onion",
    "carrots",
    "leek",
    "garlic",
    "plain",
    "flour",
    "red",
    "wine",
    "tomato",
    "puree",
    "mixed",
    "herbs",
    "bay",
    "leaf",
    "salt",
    "black",
    "pepper",
    "stock",
    "hot"
  ],
  "title": "Cumberland sausage casserole",
  "users": [
    null
  ]
}