{
  "__v": 2,
  "directions": [
    "0",
    "Make the cookies:",
    "Preheat the oven to 350ºF.",
    "In the bowl of a stand mixer fitted with the paddle attachment, cream together the butter and sugar until light and fluffy.",
    "In a separate bowl, whisk together the flour, baking powder and salt. In three increments, add the flour mixture to the creamed butter, mixing between each addition and scraping down the sides of the bowl as necessary. Add the milk and vanilla extract, blending until combined and the dough begins to come together in large pieces.",
    "Use your hands to divide the dough in half, pressing it together to compact it into two disks. Wrap the disks securely in plastic wrap and refrigerate them until firm, about 1 hour.",
    "Once the dough has chilled, roll each disk out onto a lightly floured surface until it is 1/8-inch thick. Cut out as many cookies as possible with a doughnut-shaped cookie cutter. (See Kelly's Notes for cookie cutter alternatives.) Place the cut-out cookies on a Silpat or parchment paper-lined baking sheet and repeat with remaining dough.",
    "Bake the cookies for 10 to 12 minutes, rotating the baking sheet half-way through, until the cookies are pale golden brown. Transfer the cookies to a wire wrack to cool completely.",
    "Make the coconut topping:",
    "Spread the coconut flakes onto a baking sheet lined with parchment paper. Bake the coconut for about 10 minutes in a 350ºF oven until toasted, stirring frequently to ensure even browning and so that it does not burn. (See Kelly's Notes.) Remove the toasted coconut from the oven and set it aside.",
    "Melt the caramels, milk and salt in a double-boiler by placing the caramels in a medium saucepot set over a large saucepot of simmering water. Cook, stirring, until the caramels are fully melted. Remove the saucepot from the heat and combine 3/4 of the caramel with the toasted coconut in a large bowl.",
    "Carefully spread the remaining 1/4 cup of caramel atop the cooled cookies then press on a portion of the coconut mixture. Let the cookies cool for 30 minutes. If the caramel-coconut mixture thickens too much at any point while pressing it onto the cookies, return it to the double-boiler and warm it until it's spreadable again.",
    "Melt the dark chocolate in a double-boiler or in the microwave. Dip the bottoms of the cookies in the chocolate and place them on a wax paper-lined baking sheet. Use a fork to drizzle the tops with chocolate. Let the cookies sit until the chocolate hardens fully.",
    "Kelly's Notes:",
    "If you don't have a doughnut-shaped cookie cutter, you can use two cookies cutters (such as a circular 2-inch and a circular 1-inch) to form the ring shape. Alternately, you can use the caps to any dry spices to serve as cookie cutters.",
    "If the dough is too firm to roll out after being refrigerated, let it rest at room temperature for 10 minutes before rolling and cutting out the cookies.",
    "The shortbread should be very pale golden in color. When in doubt, underbake it!",
    "If using dark chocolate chips, 8 ounces is equal to about 1 1/3 cups chocolate chips.",
    "Coconut burns very quickly, so keep an eye on it and stir often!",
    "Spreading the cookies with the reserved 1/4 cup of caramel gives the coconut mixture a stickier base to adhere to."
  ],
  "firstAdded": "2014-07-20T19:03:29.197000",
  "hash": "c578ef3c07ac226efb3fd4240f2b1195a4918e5a",
  "href": "http://www.justataste.com/2013/02/homemade-samoas-girl-scout-cookies-recipe/",
  "image": "http://www.justataste.com/wp-content/uploads/2013/02/Samoas-logo-175x265.jpg",
  "ingredients": [
    "0",
    "For the cookies:",
    "1 cup (2 sticks) unsalted butter, at room temperature",
    "1/2 cup sugar",
    "2 cups all-purpose flour",
    "1/4 teaspoon baking powder",
    "1/2 teaspoon salt",
    "2 Tablespoons milk",
    "1/2 teaspoon vanilla extract",
    "1",
    "For the cookies:",
    "1 cup (2 sticks) unsalted butter, at room temperature",
    "1/2 cup sugar",
    "2 cups all-purpose flour",
    "1/4 teaspoon baking powder",
    "1/2 teaspoon salt",
    "2 Tablespoons milk",
    "1/2 teaspoon vanilla extract"
  ],
  "keywords": [
    "cookies",
    "unsalted",
    "butter",
    "room",
    "sugar",
    "allpurpose",
    "flour",
    "baking",
    "salt",
    "milk",
    "vanilla"
  ],
  "title": "Homemade Samoas Girl Scout Cookies",
  "users": [
    null,
    null
  ]
}