{
  "hash": "a39f83a1d13d4b4bf4b66d8203e809014202655b",
  "title": "LEBANESE SPICED CHICKPEAS & EGGPLANT WITH PITA",
  "image": "https://uk.meatfreeweek.org/sites/default/files/New_Feast_lebanese%20chickepeas%20568.jpg",
  "href": "https://uk.meatfreeweek.org/content/lebanese-spiced-chickpeas-eggplant-pita",
  "extension": "Chrome",
  "firstAdded": "2015-06-28T22:29:21.322000",
  "users": [
    null
  ],
  "keywords": [
    "vineripened",
    "tomatoes",
    "extravirgin",
    "olive",
    "oil",
    "medium",
    "onions",
    "long",
    "green",
    "chillies",
    "seeds",
    "ginger",
    "cinnamon",
    "allspice",
    "black",
    "pepper",
    "stock",
    "salt",
    "eggplant",
    "aubergine",
    "fat",
    "wedges",
    "chickpeas",
    "goodquality",
    "tinned",
    "pita",
    "greekstyle",
    "yoghurt"
  ],
  "directions": [
    "0",
    "Preheat the oven to 200°C (400°F). Arrange the tomatoes in a roasting tin and drizzle with a generous tablespoon of oil. Roast for 10 minutes, or until the skins are slightly coloured and splitting away from the flesh. Set aside until cool enough to handle, then peel away the skins.",
    "Heat another few tablespoons of oil in a heavy-based flame-proof casserole or saucepan and add the onions, chillies and spices. Saute very gently for 10 minutes, or until very soft and translucent. Add the vegetable stock to the pan and bring to the boil. Add . teaspoon of salt and reduce to a simmer. Tip in the tomatoes with their roasting juices and simmer for 15–20 minutes, or until the liquid has reduced by around a quarter.",
    "Meanwhile, arrange the eggplant in a large roasting tin and toss with 100 ml (3 ½ fl oz) extra-virgin olive oil and a sprinkling of salt. Roast for 15–20 minutes, or until tender. Shake the pan from time to time to ensure they colour evenly.",
    "Add the chickpeas to the tomato mixture and continue cooking for a further 5 minutes. Finally, add the cooked eggplant (keep the roasting tin to one side and the oven on) and stir in very gently.",
    "Roll up the pita into a tight roll and shred into cm strips. Scatter into the eggplant roasting tin and drizzle with a little more oil. Cook for 5–7 minutes, shaking from time to time, until the bread crisps and browns evenly.",
    "Spoon the fatteh into a deep serving bowl. Dollop the yoghurt around the edge of the bowl and then scatter the toasted bread over the top. Serve straight away.",
    "Serves 4-6"
  ],
  "ingredients": [
    "0",
    "500 g (1 lb 2 oz) vine-ripened tomatoes",
    "Extra-virgin olive oil",
    "2 medium onions, thinly sliced",
    "2 long green chillies, seeds removed, finely shredded",
    "½ teaspoon ground ginger",
    "½ teaspoon ground cinnamon",
    "½ teaspoon ground allspice",
    "½ teaspoon freshly ground black pepper",
    "½ teaspoon freshly ground black pepper",
    "250 ml (9 fl oz) vegetable stock",
    "Sea salt",
    "640 g (1 lb 7 oz) eggplant (aubergine), peeled and cut into fat wedges",
    "250 g (9 oz) cooked chickpeas (good-quality tinned will do, at a pinch)",
    "1 pita",
    "250 g (9 oz) Greek-style yoghurt"
  ],
  "__v": 1
}