{
  "hash": "29408a049e8a08bbc3ca43045b48f2e02ebee1cd",
  "title": "SLOWLY BRAISED BEEF CHEEKS IN PEDRO XIMENEZ WITH CAULIFLOWER PUREE",
  "image": "http://movida.wpengine.netdna-cdn.com/wp-content/uploads/carillera-de-buey-beef-cheek1-480x319.jpg",
  "href": "http://movida.com.au/slowly-braised-beef-cheeks-in-pedro-ximenez-with-cauliflower-puree-carillera-de-buey/",
  "firstAdded": "2014-12-26T08:37:50.724000",
  "users": [
    null
  ],
  "keywords": [
    "beef",
    "cheeks",
    "olive",
    "oil",
    "carrots",
    "roughly",
    "garlic",
    "bulb",
    "brown",
    "onion",
    "pedro",
    "ximenez",
    "sherry",
    "red",
    "wine",
    "bay",
    "leaves",
    "thyme",
    "salt",
    "head",
    "cauliflower",
    "broken",
    "florets",
    "cream",
    "butter"
  ],
  "directions": [
    "0",
    "Trim the beef cheeks to neaten them up and remove any sinew and silver skin. Season well.",
    "Heat half the olive oil in a large heavy-based saucepan over high heat. Brown the beef cheeks for 2 minutes on each side, or until golden, then remove from the pan.",
    "Add the remaining olive oil, then add the carrot, garlic and onion and sauté over high heat for 12-15 minutes, or until well browned. Stir in the sherry, wine, bay leaves, thyme, sea salt and 500 ml (17 fl oz/2 cups) water.",
    "Reduce the heat as low as possible, add the beef cheeks, then cover and cook for 3-4 hours, or until the cheeks are beginning to fall apart.",
    "Meanwhile, put the cauliflower, cream and butter in a saucepan, season to taste with salt, then cover and cook over low heat for 35 minutes, or until very tender. Place the cauliflower mixture in a blender and process until smooth. Keep the puree warm.",
    "The sauce from the beef cheeks should by now be reduced and glaze-like. If it needs further reducing, remove the cheeks from the pan, cover with foil to keep them warm and simmer the sauce over high heat until nicely reduced. Strain the sauce through a fine sieve and return to the pan; gently reheat the cheeks in the sauce if necessary.",
    "Serve the cheeks and their sauce on warm plates with the cauliflower puree on the side."
  ],
  "ingredients": [
    "0",
    "1.5 kg (3 lb 5 oz) beef cheeks",
    "125 ml (4 fl oz/½ cup) olive oil",
    "3 carrots, roughly chopped",
    "1 garlic bulb, halved",
    "1 brown onion, sliced",
    "500 ml (17 fl oz/2 cups) Pedro Ximenez sherry",
    "500 ml (17 fl oz/2 cups) red wine",
    "3 bay leaves",
    "3 tablespoons thyme leaves",
    "1 teaspoon fine sea salt",
    "1 head of cauliflower, broken into florets",
    "185 ml (6 fl oz/¾ cup) cream",
    "40g (1 ½ oz) butter"
  ],
  "__v": 2
}