{
  "__v": 1,
  "directions": [
    "0",
    "Directions:",
    "Preheat your oven to 350 (175c)",
    "This was a breakfast for two, so if you need more just double (or triple) the amounts. Start by finely chopping your onion. You can also use shallots for this, I mainly grab whatever I find in my pantry. Do the same with the ham.",
    "I’ve used fresh and vibrant organic/biological tomatoes for this and I must say, there’s definitely a noticeable difference in flavor. I was always skeptical about it, but it’s just really a deeper and more pure flavor. Hard to describe. Anyway, give them a rough chop. Remove as many of the seeds as you can but don’t sweat it, most of the seeds will fall off when you transfer them to the skillet later on.",
    "Using a little drop of olive oil, sautee your onions over medium heat until translucent. Add the tomatoes and cook for one more minute before adding the ham. Let everything heat through for an additional minute now.",
    "I’ve used ramekins for this, but any small, individual baking dish will do, just lightly grease it. My ramekins don’t look great with all the gray on white (especially not in photos), but they do have a huge advantage to them – a non stick interior, so I’ll gladly trade in pretty pictures for comfort. Spoon the vegetable mix in whatever you’re gonna use to bake it in and top with a little grated cheese.",
    "The egg saga. Need I say more? Just crack an egg over each baking dish.",
    "Now there’s a slight chance one (or all) of your eggs survived the crash, so we’ll just have to burst their bubbles ourselves. If you leave the yolk intact it’s gonna end up all dried out, small, sad and shriveled up. It’s not a pretty sight and quite frankly, it scares me. What can I say? I’m a woman, I tend to panic when I think about things ending up sad and shriveled up. Anything. So use something sharp to break the yolk and let it run its course. Don’t mix things.",
    "Pop them in a preheated oven for about 15 minutes and keep an eye on them. If after 15 minutes the egg white doesn’t look completely firm give it a few more minutes. You want the egg to be fully cooked but the yolk underneath still a bit soft and runny.",
    "In the mean time I make toast that I cut up in small strips. The kiddo loves dipping them in the runny yolks and I love my kiddo, so I’ll gladly make them. You can lightly butter them if you like.",
    "Sprinkle salt and pepper on top, a little parsley if you want to get real fancy and you’re done."
  ],
  "firstAdded": "2014-10-01T06:47:05.936000",
  "hash": "07124e32b5c7e2f37361f318c103a5564a54f0fa",
  "href": "http://www.kayotic.nl/blog/egg-drop",
  "image": "http://farm4.static.flickr.com/3223/2892009597_60d042bc5f.jpg",
  "ingredients": [
    "0",
    "Ingredients:",
    "drop of olive oil",
    "1/2 small onion",
    "grated cheese",
    "1 tomato",
    "2oz ham",
    "2 eggs",
    "pepper",
    "salt"
  ],
  "keywords": [
    "drop",
    "olive",
    "oil",
    "onion",
    "cheese",
    "tomato",
    "ham",
    "eggs",
    "pepper",
    "salt"
  ],
  "title": "Egg Drop",
  "users": [
    null
  ]
}