{
  "hash": "ea13d547ed36d94f9d75e480c60f96eb71796867",
  "title": "Hearty Split Pea and Smoky Bacon Soup with Rustic Garlic-Butter Croutons",
  "image": "http://thecozyapron.com/wp-content/uploads/2015/03/hearty-split-pea-soup_02-20-15_6_ca.jpg",
  "href": "http://thecozyapron.com/hearty-split-pea-smoky-bacon-soup-for-when-something-of-substance-is-craved/",
  "extension": "Chrome",
  "firstAdded": "2017-02-18T20:56:35.953000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparation:",
    "-Place a medium-large or large soup pot over medium-high heat, and add in just a small drizzle of oil; once the oil is hot, add in the chopped bacon, and cook until golden and crispy; remove bacon with a slotted spoon, set aside, and wipe out most of the bacon grease, leaving about 1 tablespoon worth in the pot.",
    "-Place the pot back on medium heat, and add in the butter; once melted, add in the onion, celery, and carrot, and saute those for a couple of minutes just until they begin to become tender.",
    "-Add in the marjoram, a pinch or two of salt, the black pepper, and the garlic, and stir to combine; cook for a moment or two until the garlic becomes aromatic.",
    "-Add in the split peas, along with the stock, and stir to combine; bring the soup up to a rolling simmer/boil, and then cover, and reduce the heat to low, simmering the soup very gently for about 45-50 minutes, stirring occasionally, or until the peas have split and are tender.",
    "-Finish the soup by adding in the chopped parsley and the thyme, along with a squeeze of lemon juice, and check to see if any additional salt or pepper is needed.",
    "-Ladle the soup into bowls, and garnish with some of the Rustic Garlic-Butter croutons, and a generous sprinkle of the crispy bacon.",
    "Rustic Garlic-Butter Croutons Ingredients:",
    "• 4 tablespoons unsalted butter",
    "• 2 small cloves garlic, pressed through garlic press",
    "• Black pepper",
    "• Salt",
    "• ½ teaspoon Italian seasoning",
    "• 8 ounces ciabatta bread, sliced into ½” thick slices, and then cubed into small cubes",
    "Preparation:",
    "-Preheat the oven to 425°, and line a baking sheet with foil.",
    "-Melt the butter in a small bowl in the microwave for a few moments; to it add the pressed garlic cloves, a pinch of black pepper, a couple of pinches of salt, and the Italian seasoning, and mix with a fork to combine.",
    "-Place the cubed ciabatta into a medium-size bowl, and pour the butter mixture evenly over the cubes; toss to coat, and pour the cubes out in a single layer onto the prepared baking sheet, and bake for about 12-15 minutes, tossing the cubes occasionally for even crisping/browning.",
    "-Remove from oven and allow the cubes to cool completely on the baking sheet; use immediately, or keep in a ziplock. (You can re-crisp them, if necessary, in a low-heat toaster oven for about 8-10 minutes.)"
  ],
  "ingredients": [
    "0",
    "• Canola oil",
    "• 6 slices thick-cut, apple-smoked bacon, finely chopped",
    "• 2 tablespoons unsalted butter",
    "• 1 onion, finely chopped",
    "• 2 ribs celery, finely diced",
    "• 2 carrots, peeled and finely diced",
    "• 2 teaspoons dried marjoram",
    "• Salt",
    "• ½ teaspoon black pepper",
    "• 4 large cloves garlic, pressed through garlic press",
    "• 1 pound green split peas, picked through and rinsed",
    "• 6 cups hot chicken stock",
    "• 1 tablespoon chopped flat-leaf parsley",
    "• 1 teaspoon fresh thyme leaves",
    "• Squeeze of lemon",
    "• Rustic Garlic-Butter Croutons (recipe below)"
  ],
  "__v": 1
}