{
  "__v": 1,
  "directions": [
    "0",
    "Preheat the oven to 350F. Spray three 9x2 inch cake pans with nonstick spray. Set aside.",
    "Make the cake. Using a handheld or stand mixer with a paddle attachment, beat the butter on high until creamy - about 1 minute. Add granulated and brown sugars and beat on medium-high speed until creamed, about 2-3 minutes. Scrape down the sides and bottom of the bowl as needed. Add eggs and vanilla. Beat on medium speed until everything is combined, about 2 full minutes. Scrape down the sides and bottom of the bowl as needed. Set aside.",
    "In a large sized bowl, toss together the flour, baking powder, and salt. Slowly add the dry ingredients to the wet ingredients. Beat on low speed for 5 seconds, then add the milk, lemon zest, and lemon juice. Remove from the mixer and stir lightly until everything is just combined. Toss the blueberries in 1 Tablespoon of flour and fold into the batter. Batter is extremely thick. Do not overmix at any point. Overmixing will lend a tough, dense textured crumb.",
    "Spoon batter evenly into 3 prepared cake pans. If only using 2 cake pans, your bake time will be longer. Bake the three layers for about 21-26 minutes or until a toothpick inserted in the center comes out clean. Mine took 21 minutes. Remove from the oven and allow to cool completely before frosting.",
    "Make the frosting. Using a handheld or stand mixer with a paddle attachment, beat cream cheese and butter together on medium speed until no lumps remain, about 3 full minutes. Add confectioners' sugar, 1 Tablespoon cream, vanilla extract, and salt with the mixer running on low. Increase to high speed and beat for 3 minutes. Add 1 more Tablespoon of cream to thin out, if desired.",
    "Assemble and frost. First, using a large serrated knife, trim the tops off the cake layers to create a flat surface. Place 1 layer on your cake stand. Evenly cover the top with cream cheese frosting. Top with 2nd layer, more frosting, then the third layer. Top with frosting and spread around the sides. The recipe doesn't make a ton of frosting, just enough for a light frost. Top with blueberries or lemon garnish if desired. Refrigerate for at least 45 minutes before cutting or else the cake may fall apart as you cut.",
    "Make 1 day in advance if you'd like. Extras keep well in the refrigerator for up to 3days."
  ],
  "firstAdded": "2014-07-20T19:29:14.465000",
  "hash": "1124bf0441e07e3557caebdc01b66b008a6dd8a0",
  "href": "http://sallysbakingaddiction.com/2014/02/09/lemon-blueberry-layer-cake/",
  "image": "http://sallysbakingaddiction.com/wp-content/uploads/2014/02/Deliciously-sweet-and-light-Lemon-Blueberry-Layer-Cake.-Tangy-cream-cheese-frosting-gives-each-bite-a-sweet-touch_-9.jpg",
  "ingredients": [
    "0",
    "CAKE",
    "1 cup (230g) unsalted butter, softened to room temperature",
    "1 and 1/4 cups (250g) granulated sugar",
    "1/2 cup (100g) light brown sugar",
    "4 large eggs, at room temperature*",
    "1 Tablespoon vanilla extract",
    "3 cups (375g) all-purpose flour, careful not to overmeasure*",
    "1 Tablespoon baking powder",
    "1/2 teaspoon salt",
    "1 cup (240ml) buttermilk*",
    "zest + juice of 3 medium lemons*",
    "1 and 1/2 cups blueberries, fresh (258g) or non-thawed frozen (275g)",
    "1 Tablespoon all-purpose flour",
    "CREAM CHEESE FROSTING",
    "8 ounces (224g) full-fat cream cheese, softened to room temperature",
    "1/2 cup (115g) unsalted butter, softened to room temperature",
    "3 and 1/2 cups (420g) confectioners' sugar",
    "1 - 2 Tablespoons (15-30ml) heavy cream*",
    "1 teaspoon vanilla extract",
    "pinch salt"
  ],
  "keywords": [
    "cake",
    "unsalted",
    "butter",
    "softened",
    "room",
    "granulated",
    "sugar",
    "light",
    "brown",
    "eggs",
    "vanilla",
    "allpurpose",
    "flour",
    "careful",
    "overmeasure",
    "baking",
    "salt",
    "buttermilk",
    "zest",
    "juice",
    "medium",
    "lemons",
    "blueberries",
    "nonthawed",
    "frozen",
    "cream",
    "cheese",
    "frosting",
    "fullfat",
    "confectioners"
  ],
  "title": "Lemon Blueberry Layer Cake",
  "users": [
    null
  ]
}