{
  "hash": "1597e787eb36bb5ee473df3fb1d1f9c0fd97a5ac",
  "title": "LENTIL LOAF WITH TOMATO GLAZE [VEGAN, GLUTEN-FREE]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/01/Pastel-de-lentejas-6-1024x682.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/lentil-loaf-with-tomato-glaze/",
  "firstAdded": "2015-02-07T21:40:58.455000",
  "users": [
    null
  ],
  "keywords": [
    "uncooked",
    "lentils",
    "olive",
    "oil",
    "medium",
    "onion",
    "supertiny",
    "stalks",
    "celery",
    "carrots",
    "garlic",
    "tomato",
    "ketchup",
    "breadcrumbs",
    "walnuts",
    "parsley",
    "thyme",
    "tamari",
    "soy",
    "flaxseed",
    "salt",
    "pepper"
  ],
  "directions": [
    "0",
    "If using uncooked lentils, boil 2 cups of them in 5 cups of water. Leave them until they are soft.",
    "Pre-heat the oven to 350 degrees.",
    "Chop the onion, celery and carrot as tiny as possible. I pulse them in the food processor until they’re tiny.",
    "In a skillet add olive oil to heat and add the vegetables with a good pinch of salt.",
    "When they are already starting to brown, stir in the garlic. Leave it for about 10 min. They’re ready when the garlic is cooked.",
    "Add the lentils with the remaining ingredients and cooked vegetables in a large bowl.",
    "Add salt and pepper.",
    "Put the mixture into a loaf pan prepared with a piece of parchment paper first. It is better if the paper come out of the mold, it make it easier when transferring to a serving platter.",
    "Press the mixture with a spoon and top it with the glaze. I add, about half of it. (To prepare the glaze, just mix all ingredients in a bowl.)",
    "Put the lentil loaf in the oven for 30-45 min. until it is browned and feels firm."
  ],
  "ingredients": [
    "0",
    "2 cups uncooked lentils and 4 cups of cooked lentils",
    "2 tablespoons olive oil",
    "1 medium onion, chopped super-tiny (half cup or so)",
    "2 stalks celery, chopped super-tiny (half cup or so)",
    "2 chopped carrots super-tiny (half cup or so)",
    "3 cloves of garlic",
    "1/4 cup tomato paste (or ketchup if none)",
    "1/2 cup breadcrumbs",
    "1/2 cup chopped walnuts",
    "1/4 cup fresh parsley or 2 tablespoons dried parsley",
    "1 teaspoon thyme or 1/2 teaspoon dried thyme",
    "2 tablespoons tamari or soy sauce",
    "3 tablespoons ground flaxseed",
    "salt and pepper"
  ],
  "__v": 1
}