{
  "hash": "9495dea7b039c0f71a4288035830b92d0edb25eb",
  "title": "Jam-Stuffed French Toast",
  "image": "https://munchies-images.vice.com/wp_upload/how-to-stuffed-french-toast-2.jpg?crop=1xw:0.8445945945945946xh;center,center&resize=1536:*",
  "href": "https://munchies.vice.com/en_us/article/9a8973/jam-stuffed-french-toast",
  "extension": "Chrome",
  "firstAdded": "2017-07-08T06:14:29.877000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Chef's Tip: If you aren't using the same weight of berries as above, here's how you figure out your measurements for the sugar and lemon juice: - Weigh your berries in grams - Weight of berries x .67 = weight of sugar - Weight of berries x .024 = weight of lemon juice - Increase or decrease brandy to taste.Set a towel down next to the stove. On top of it, place a thermometer and a bowl with water and a skimmer in it. Take 5 small plates and stick them into the freezer.",
    "For the raspberry and brandy jam, place the raspberries into a food processor and pulse until just combined.",
    "Pour the mixture in a jam pan. Add sugar and stir with a heat-resistant spatula. Add lemon juice and stir again to combine all ingredients. Turn the heat to high and stir, pushing from the bottom of the pan closest to you to the furthest away. Stir often (and always if working in stainless steel), and skimming the foam off the top when necessary. Use your thermometer to check the bottom of the pot. The pot temperature should read around 210 degrees before performing \"plate tests.\"",
    "When the bottom of the pot reads 210, place a dollop of jam onto a plate from the freezer and place it back into the freezer for one minute. Remove the jam from freezer. Push a finger from one side to the other. If it parts like the red sea, and the top furrows like a wrinkled brow, the jam is done. If not, keep cooking and testing every couple of minutes. It is easy to overcook jam. The final mixture should still be loose.",
    "When jam passes the test, add the brandy and cook for 30 more seconds. Turn off stove, stir a few more times, and set pot on an unused burner to cool.",
    "Preheat oven on to 350 degrees. To make the custard, in a large bowl, add all the custard ingredients together and whisk in a mixer until pale yellow in color, about 2–3 minutes. Transfer to a non-metal bowl.",
    "For the French toast, take two slices of brioche and with a knife, make a 2\" slit in one side of the bread, bringing the tip of the knife to the center of the bread, making a pocket for the jam. Open the slit with your fingers, and with a spoon, pour in a tablespoon of raspberry jam.",
    "Place two skillets on the stove and turn on to medium-high heat. Toss a tablespoon of butter into each skillet, letting the butter melt and bubble. While the butter melts, take the two stuffed brioche slices and dunk them into the custard, ensuring both sides are full of custard. Place the bread slices into the hot skillets and let the slices sear, 1 minute. Flip the brioche after a minute, ensuring it has a nice sear, and pop into the oven for 6 minutes.",
    "Remove from the oven and place onto the plate. Sift powdered sugar on top of each Finished french toast. Add a dollop of crème fraiche (using a spoon that is first dunked into a cup of hot water to get that nice quenelle if you want to be fancy), a squeeze of lemon, an additional spoonful of jam over the crème fraiche, and a pinch of fleur de sel to finish. Prepare to mouthgasm."
  ],
  "ingredients": [
    "0",
    "for the raspberry and brandy jam:",
    "1 lb. fresh raspberries",
    "3 lbs. organic sugar",
    "3 1/2 tablespoons lemon juice",
    "1/4 cup raspberry brandy (we used St. George Spirits)",
    "for the custard:",
    "6 eggs",
    "½ cup cream",
    "1 tablespoon sugar",
    "1 teaspoon salt",
    "for the French toast:",
    "2 slices 1.5\"-cut brioche slices",
    "2 tablespoons unsalted butter",
    "2 tablespoons raspberry & brandy jam",
    "powdered sugar",
    "whipped crème fraiche",
    "squeeze of lemon juice",
    "fleur de sel, to taste"
  ],
  "__v": 1
}