{
  "hash": "c33b837f899b5757007842f72927684140893c16",
  "title": "Roasted Squash and shallots with merguez chickpeas",
  "image": "http://www.rivercottage.net/images/phpThumb.php/q=100;zc=1;290x205;/var/members/member752041/squash.png",
  "href": "http://www.rivercottage.net/recipes/roasted-squash-and-shallots-with-merguez-chickpeas/",
  "firstAdded": "2014-12-31T14:00:28.243000",
  "users": [
    null
  ],
  "keywords": [
    "mixed",
    "squash",
    "deseeded",
    "chunks",
    "shallots",
    "garlic",
    "lightly",
    "bashed",
    "tbs",
    "olive",
    "oil",
    "salt",
    "pepper",
    "merguez",
    "chickpeas",
    "soaked",
    "overnight",
    "water",
    "bay",
    "leaves",
    "cumin",
    "seeds",
    "fennel",
    "coriander",
    "caraway",
    "black",
    "peppercorns",
    "clove",
    "rosemary",
    "smoked",
    "paprika",
    "cayenne"
  ],
  "directions": [
    "0",
    "Drain the chick peas and put in a large saucepan. Cover with plenty of cold water and bring to a boil and boil hard for 10 minutes and then reduce to a simmer. Skim off any scum and add the bay leaves and simmer for about an hour topping up with water as necessary.",
    "Divide the squash between shallow roasting tins so that you have a single layer. Divide the shallots and garlic between the tins, trickle over olive oil and season with salt and pepper. Toss the vegetables to coat in oil and seasoning, roast in the oven for about an hour stirring from time to time to ensure the vegetables are evenly cooked and caramelised.",
    "Toast the merguez spices in a dry frying pan until fragrant, crush to a coarse powder in a pestle and mortar. Combine the spices with the garlic, rosemary, paprika and cayenne, salt and extra virgin oil in a pan heat gently for a minute and set aside.",
    "When the chickpeas are cooked, drain them well and return to the hot pan and add the spiced oil.",
    "Plate a portion of squash and shallots, sprinkle over chickpeas and serve with orange and date cous cous and a spoon of spiced yogurt."
  ],
  "ingredients": [
    "0",
    "1.5kg Mixed squash, peeled, deseeded and cut into 2cm chunks",
    "450g Shallots, peeled and halved if large",
    "6-7 Garlic cloves, lightly bashed",
    "4tbs Olive oil",
    "Salt & pepper",
    "Merguez Chickpeas",
    "300g Dried chickpeas, soaked overnight in water",
    "3 Bay leaves",
    "1 ½ tsp Cumin seeds",
    "1 ½ tsp Fennel seeds",
    "1 ½ tsp Coriander seeds",
    "1 ½ tsp Caraway seeds",
    "1 tsp Black peppercorns",
    "1 Large Garlic clove",
    "1 ½ tsp Rosemary leaves, finely chopped",
    "1 ½ tsp Sweet smoked paprika",
    "¼ tsp Cayenne pepper",
    "½ tsp fine salt",
    "75ml Olive oil"
  ],
  "__v": 1
}