{
  "hash": "19f39b54872c04967d5a32baa7baa09a288fb3eb",
  "title": "Lavender-Honey Lemon Tart\nRating: Unrated",
  "image": "",
  "href": "https://www.bhg.com/recipe/lavender-honey-lemon-tart/",
  "extension": "Chrome",
  "firstAdded": "2020-05-25T19:34:32.933000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Step 1",
    "In a medium bowl whisk together flour, powdered sugar, and 1/4 tsp. salt. Stir in melted butter until dough comes together. Press dough evenly into bottom and up sides of a 14x4-inch rectangular or 9-inch round tart pan with removable bottom. Refrigerate crust at least 20 minutes or until firm.",
    "Step 2",
    "Preheat oven to 350°F. Prick bottom of crust all over with a fork. Line crust with foil or parchment paper; fill with pie weights or dried beans. Bake 20 minutes. Remove foil and pie weights; bake 10 to 15 minutes more or until golden. Let cool on a wire rack.",
    "Step 3",
    "For lavender honey: In a small saucepan combine honey and lavender buds. Heat over medium until honey simmers. Reduce heat to medium-low and simmer 15 minutes, stirring occasionally. Remove from heat; let stand 15 minutes. Pour honey through a fine-mesh sieve to remove lavender; discard lavender. Set honey aside.",
    "Step 4",
    "In a small bowl sprinkle gelatin over 4 teaspoons cold water; set aside.",
    "Step 5",
    "In a medium saucepan whisk together eggs, granulated sugar, and lemon zest until combined. Whisk in lemon juice. Cook over medium, whisking constantly, 6 to 8 minutes or until thick and creamy. (Lemon curd will coat the back of a spoon, and a streak will remain visible if you run your finger across the spoon.)",
    "Step 6",
    "Remove from heat; stir in cut-up butter until it melts into curd. Stir in gelatin until combined. (The heat will melt gelatin.) Pour curd into cooled crust. Refrigerate tart 4 hours or until completely set.",
    "Step 7",
    "Top tart with whipped cream and Candied Lemons. Drizzle with remaining lavender honey. Serves 8."
  ],
  "ingredients": [
    "0",
    "1 cup all-purpose flour",
    "¼ cup powdered sugar",
    "¼ teaspoon salt",
    "½ cup unsalted butter, melted",
    "¾ cup honey",
    "3 tablespoons food-grade dried lavender buds",
    "1 teaspoon unflavored gelatin",
    "4 large eggs",
    "¾ cup granulated sugar",
    "4 lemons (2 tsp. zest, 3/4 cup juice)",
    "2 tablespoons unsalted butter, cut into pieces",
    "Whipped cream",
    "Candied Lemons (see recipe)"
  ],
  "__v": 1
}