{
  "hash": "a8bcb3b91c25ff42ed9ccbb0ec4c7c7daa58ade1",
  "title": "Almond Amaretto Pound Cake",
  "image": "http://www.sharedsugarfiles.com/admin/ckfinder/userfiles/images/RecipeImages/Almond-Amaretto-Pound-Cake.jpg",
  "href": "http://www.dixiecrystals.com/recipes/desserts/cakes/Almond-Amaretto-Poundcake",
  "extension": "Chrome",
  "firstAdded": "2017-06-04T01:30:29.332000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "Preheat oven to 325°F. Grease a 10-inch bundt pan with baking spray or butter and flour it. Set aside.",
    "In small bowl, whisk together milk and vinegar. Set aside. In a medium bowl, whisk together flour, baking soda and salt. Set aside.",
    "In large bowl of stand mixer, cream butter and sugar until light and fluffy. Beat in eggs one at a time, then stir in vanilla and almond until well combined. Beat in flour mixture alternating with milk and amaretto.",
    "Pour batter into prepared bundt pan. Bake for 55 to 65 minutes, until center is set and a toothpick inserted comes out clean. Allow cake to cool completely (in bundt pan) before inverting onto cake plate.",
    "Amaretto Sauce: Combine the butter, brown sugar and granulated sugar in a small saucepan. Heat over medium heat, stirring often, until smooth. Add the cream and amaretto and bring to a simmer. Simmer for 5 minutes, stirring often. Remove from heat and let cool for 10 minutes.",
    "Serve pound cake warm drizzled with amaretto sauce.",
    "DIXIE CRYSTALS INSIGHT",
    "Recipe developed for Dixie Crystals by Jessica Segarra @TheNoviceChef."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1 cup whole milk",
    "1 tablespoon white vinegar",
    "3 cups all-purpose flour*",
    "1/2 teaspoon baking soda",
    "1/2 teaspoon salt",
    "1 cup (2 sticks) unsalted butter, softened",
    "2 3/4 cup Dixie Crystals Extra Fine Granulated Sugar",
    "4 large eggs",
    "1 tablespoon vanilla extract",
    "2 teaspoons almond extract",
    "1/4 cup amaretto",
    "Amaretto Sauce",
    "1/2 cup (1 stick) unsalted butter",
    "1/2 cup packed Dixie Crystals Light Brown Sugar",
    "1/2 cup Dixie Crystals Extra Fine Granulated Sugar",
    "1/3 cup half & half",
    "3 tablespoons amaretto"
  ],
  "__v": 1
}