{
  "hash": "b869b11eb0e892128f9e02a7541209e24ade2b4c",
  "title": "Chocolate Peanut Butter Popcorn Pie",
  "image": "",
  "href": "https://tasty.co/recipe/chocolate-peanut-butter-popcorn-pie",
  "extension": "Chrome",
  "firstAdded": "2018-11-01T17:09:57.107000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Melt the butter in a large pot over medium heat, then add the marshmallows and stir until starting to melt. Add ⅓ cup (80 g) of peanut butter and stir until completely melted. Remove the pot from the heat.",
    "Add the popcorn to the pot and stir to coat completely. Let cool for 2 minutes.",
    "Grease a 9-inch (23-cm) springform pan with nonstick spray. Press the popcorn mixture into the pan using the bottom of a measuring cup, creating an even layer along the bottom and halfway up the sides. Set aside.",
    "Add the dark chocolate chips and milk chocolate chips to a medium bowl and melt in the microwave, stirring every 30 seconds, about 2 minutes total. Set aside to cool to room temperature.",
    "In a separate medium bowl, whip the cream with an electric hand mixer until stiff peaks form, then add 3 tablespoons of powdered sugar and 1 teaspoon of vanilla and beat to incorporate.",
    "Fold the whipped cream into the cooled chocolate.",
    "Spoon the chocolate mixture into the popcorn crust. Spread evenly.",
    "In a small bowl, combine the remaining ⅓ cup (80 g) peanut butter, 1 tablespoon powdered sugar, 1 teaspoon of vanilla, and the milk, stirring until smooth. Transfer to a small piping bag or zip-top bag.",
    "Pipe lines across the surface of the pie. Drag a toothpick through, perpendicular to the lines, alternating directions from top to bottom.",
    "Chill the pie in the refrigerator for at least 4 hours.",
    "Release the springform, then slice and serve.",
    "Enjoy!"
  ],
  "ingredients": [
    "0",
    "2 tablespoons",
    "unsalted butter",
    "7 oz",
    "marshmallow",
    "(200 g)",
    "⅔ cup",
    "peanut butter, divided",
    "(160 g)",
    "8 cups",
    "popcorn, popped",
    "(80 g)",
    "nonstick cooking spray, for greasing",
    "2 cups",
    "dark chocolate chip",
    "(350 g)",
    "2 cups",
    "milk chocolate chips",
    "(350 g)",
    "1 ½ cups",
    "heavy cream",
    "(360 mL)",
    "4 tablespoons",
    "powdered sugar, divided",
    "2 teaspoons",
    "vanilla extract, divided",
    "3 tablespoons",
    "milk"
  ],
  "__v": 1
}