{
  "hash": "28b19f23e79c11d35d8f11afd5cd853e1699a667",
  "title": "Sous Vide Pork Tenderloin",
  "image": "https://images.anovaculinary.com/sous-vide-pork-tenderloin/finishing-steps/sous-vide-pork-tenderloin-finishing-steps-image-5.jpg",
  "href": "https://recipes.anovaculinary.com/recipe/pork-tenderloin",
  "extension": "Chrome",
  "firstAdded": "2018-06-27T23:08:57.234000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat a water bath to 135° F",
    "Season pork generously on all sides with salt and pepper.",
    "Place the chicken in the bag, along with any aromatics such as fresh herbs or spices (if using)",
    "Seal the bag",
    "Place the bag in the water bath, using a binder clip to clip it to the side of the container to prevent it from floating around and blocking the air intake in the cooker.",
    "Cook 45 minutes-4 hours.",
    "Remove the pork from the water bath and remove it from the bag, discarding any aromatics. You can save the juice to deglaze your pan later on for a pan sauce if desired.",
    "Carefully pat the pork dry using paper towels.",
    "Heat a tablespoon of oil over high heat in a heavy skillet. When shimmering, add the pork and cook, turning occasionally, until it is well-browned on most sides, about 2 minutes total.",
    "When you get to the final side, add a tablespoon of butter along with fresh aromatics like shallots, garlic, thyme, or oregano (if desired).",
    "Spoon the melting butter and aromatics over the pork. continue cooking until the final side is browned, about 45 seconds longer. Transfer the pork to a wire rack set in a rimmed baking sheet. If you're planning to make a pan sauce, skip to the next step. Otherwise, pour the drippings over it.",
    "OPTIONAL: If you'd like a simple sauce with your pork, add one tablespoon of minced shallot to the skillet and sauté until aromatic, about 15 seconds. Add a cup of dry white wine or vermouth and let it reduce by half. Add a dollop of whole grain mustard, the liquid reserved from the sous vide bag, and a tablespoon of butter. Swirl until the sauce is emulsified and season to taste with salt and pepper. Remove from heat.",
    "Discard the aromatics, slice the pork, and serve, spooning the sauce on top or simply with a sprinkle of coarse sea salt."
  ],
  "ingredients": [
    "0",
    "1 Whole Pork Tenderloin, about 1 pound",
    "Kosher salt",
    "Freshly Ground Black Pepper",
    "6 to 8 Sprigs Fresh Herbs (Fresh thyme, oregano, or rosemary - optional)",
    "2 Garlic Cloves (optional)",
    "2 Small Shallots, Sliced (optional)",
    "1 tbsp / 15 ml Vegetable, Canola, or Rice Bran Oil",
    "1 tbsp / 15 g Butter"
  ],
  "__v": 3
}