{
  "hash": "b70b4b8b9633c01be3cd3ebcd431445aaaea98cc",
  "title": "Apple ‘n Cabbage Slaw With A Light Cider Vinaigrette",
  "image": "http://picturetherecipe.com/wp-content/uploads/2013/05/Sticky-Caramelized-Pork-Sandwich-with-Apple-Cabbage-Slaw-PTR.jpg",
  "href": "http://picturetherecipe.com/recipes/apple-n-cabbage-slaw-with-a-light-cider-vinaigrette/",
  "extension": "Chrome",
  "firstAdded": "2019-05-24T01:19:26.719000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "– Shred the red cabbage and green cabbage (I didn’t have regular cabbage so I used lettuce instead) into fine strips. Measure 2 cups of the red cabbage and 1 of the green (or lettuce) for color and add it to a large mixing bowl.",
    "– Grate the carrots using a big holed grater and add it to the bowl along with sliced green onions.",
    "– Finely chop a small handful of cilantro and add it to the salad mix.",
    "– Lastly, cut the apple into thin match-stick pieces and add it to the salad. If you’re chopping up this sald ahead of time, don’t cut the apple till you’re ready to dress the salad cos they’ll turn brown. Toss everything together well.",
    "– For the dressing start with 2 tablespoons of salad oil in a jar or a bowl.",
    "– Add the honey, apple cider, lime juice, salt, pepper and a light dusting of cayenne to the oil.",
    "– Put the lid on and shake the dressing (if you’re using a bowl simply whisk it with a fork) until the oil and other liquids are mixed well.",
    "– Drizzle over the salad and toss well until everything is coated in the dressing.",
    "– Serve chilled."
  ],
  "ingredients": [
    "0",
    "2 cups red cabbage",
    "1 cup green cabbage/ or lettuce",
    "1 – 1/2 apples (I used golden delicious apples)",
    "2 carrots (about 1 cup)",
    "3 green onions",
    "small handful cilantro",
    "1",
    "2 tbsp salad oil",
    "2 tbsp honey",
    "2 tbsp apple cider vinegar",
    "juice of one lime (about 1 tbsp)",
    "salt & pepper to taste",
    "dash of cayenne"
  ],
  "__v": 1
}