{
  "__v": 1,
  "directions": [
    "0",
    "Place the gelatine and milk in a pan, then\nleave it to one side to soak. Meanwhile,\nplace the orange zest, vanilla pods and sugar\nin a pan. Add 800ml of the cream, then bring\nto the boil. Simmer until the mixture is\nreduced by one-third. While the cream is\nreducing, remove the gelatine from the milk,\nset aside, then warm the milk. When it is\nwarm, add the soaked gelatine and stir until\ncompletely dissolved. Add to the warm cream,\npass through a sieve, then leave to cool.",
    "Lightly whip the remaining cream, then\nfold into the setting mixture. Pour the\nmixture into a 1-litre pudding bowl, then\nplace in the fridge to set for at least 5 hrs.",
    "While the panna cotta is setting, make the\nsauce for the orange salad. Tip the sugar into\na non-stick pan, then place on the heat to\ncook down to a caramel. Pour in the Grand\nMarnier and orange juice – this will make the\ncaramel harden, so just simmer on a low\nheat, stirring, until it’s dissolved to a syrupy\nconsistency. Remove from the heat.",
    "Take the panna cotta out of the fridge, slide\na knife around the edge of the bowl and dip\nvery briefly in hot water to loosen. Tip the\npanna cotta into the middle of a plate, then\narrange the orange segments around it.\nSpoon the orangey sauce over the panna\ncotta and oranges, then scatter over the zest."
  ],
  "firstAdded": "2014-10-21T10:30:35.650000",
  "hash": "7bc2c92b7d575fdd412ea0e71d1b03950fe42c0a",
  "href": "http://www.bbcgoodfood.com/recipes/757639/vanilla-panna-cotta-with-caramelised-orange",
  "image": "http://www.bbcgoodfood.com/sites/bbcgoodfood.com/files/recipe_images/recipe-image-legacy-id--390488_12.jpg",
  "ingredients": [
    "0",
    "6 gelatine leaves",
    "125ml milk",
    "zest 2 oranges",
    "2 vanilla pods, split",
    "140g golden caster sugar",
    "1.2l double cream",
    "1",
    "250g caster sugar",
    "5 tbsp Grand Marnier",
    "5 oranges, zested and segmented, any juice retained"
  ],
  "keywords": [
    "gelatine",
    "leaves",
    "milk",
    "zest",
    "oranges",
    "vanilla",
    "pods",
    "split",
    "golden",
    "caster",
    "sugar",
    "double",
    "cream",
    "marnier",
    "zested",
    "segmented",
    "juice",
    "retained"
  ],
  "title": "Vanilla panna cotta with caramelised orange",
  "users": [
    null
  ]
}