{
  "hash": "31617154b93f0b520d8ee7c83178e0a5ca3ea31a",
  "title": "Coconut-Curry Salmon Kebabs",
  "image": "http://www.drweilonhealthyaging.com/hya/file/coconut_curry_salmon.jpg?id=197",
  "href": "http://www.drweilonhealthyaging.com/hya/ecs/subpage/recipedetail.html?docid=RCP00141",
  "extension": "Chrome",
  "firstAdded": "2016-01-26T03:41:06.854000",
  "users": [
    null
  ],
  "keywords": [
    "marinade",
    "canned",
    "lite",
    "coconut",
    "milk",
    "red",
    "bell",
    "pepper",
    "coarsely",
    "scallions",
    "whites",
    "greens",
    "cilantro",
    "parsley",
    "jalapeo",
    "seeded",
    "clove",
    "garlic",
    "lime",
    "juice",
    "curry",
    "salt",
    "kebabs",
    "sugarcane",
    "swizzle",
    "long",
    "salmon",
    "fillet",
    "wedges"
  ],
  "directions": [
    "0",
    "To prepare marinade: Place coconut milk, bell pepper, scallion whites, cilantro (or parsley), jalapeño, garlic, lime juice, curry powder, salt and pepper in a food processor or blender and puree. Reserve 1⁄2 cup of this mixture to use as a sauce; cover it and refrigerate.",
    "To prepare kebabs: Cut each swizzle stick in half crosswise, angling your knife so the cuts form sharp points.",
    "Remove salmon skin and cut the salmon into 12 strips about 3 1⁄2 inches long and 1 inch wide. Using a metal skewer, make a lengthwise tunnel through each salmon strip. Insert a piece of sugarcane through this tunnel. Arrange the resulting kebabs in a baking dish. Pour the marinade over the kebabs, turning several times. Cover and marinate in the refrigerator for at least 2 hours or for up to 4 hours.",
    "Preheat grill to high. Oil the grill grate (see tip). Arrange the kebabs diagonally on the grill. Grill until cooked through, 2 to 3 minutes per side. Transfer to a platter, sprinkle with the reserved scallion greens and serve immediately, with lime wedges and the reserved sauce.",
    "To oil the grill grate:",
    "Oil a folded paper towel, hold it with tongs and rub it over the grate. (Do not use cooking spray on a hot grill.) When grilling delicate foods like tofu and fish, it is helpful to spray the food with cooking spray."
  ],
  "ingredients": [
    "0",
    "Marinade & Sauce",
    "1 cup canned \"lite\" coconut milk",
    "1⁄2 red bell pepper, coarsely chopped",
    "2 scallions, whites coarsely chopped, greens finely chopped, for garnish",
    "2 tablespoons chopped fresh cilantro or parsley",
    "1 jalapeño pepper, seeded and coarsely chopped",
    "1 clove garlic, coarsely chopped",
    "2 tablespoons fresh lime juice",
    "2 teaspoons curry powder",
    "1⁄2 teaspoon salt, or to taste",
    "Freshly ground pepper to taste",
    "Kebabs",
    "6 sugarcane swizzle sticks, about 8 inches long",
    "1 1⁄2 pounds salmon fillet",
    "1 lime, cut into wedges, for garnish"
  ],
  "__v": 1
}