{
  "hash": "4c3fd5208c2ea8a981d03232581f723521122ee2",
  "title": "PHILLY CHEESESTEAK SANDWICH",
  "image": "http://img.sndimg.com/food/image/upload/w_707,h_398,c_fill,fl_progressive,q_80/v1/img/recipes/94/03/1/AuaF7hJoSpyBVt2UVb4s_philly-cheesesteak-2.jpg",
  "href": "http://www.geniuskitchen.com/recipe/philly-cheesesteak-sandwich-authentic-94031?photo=cGhvdG8tMzg1ODA2",
  "extension": "Chrome",
  "firstAdded": "2018-02-04T16:53:20.636000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat a griddle or a large saute pan over medium-high heat.",
    "When hot, cover bottom with olive oil.",
    "Add the onions and bell pepper and cook, stirring, until carmelized, which will take about 6 to 8 minutes.",
    "Add the garlic, salt and pepper, and cook for about 30 seconds.",
    "Then, push the mixture off to one side of the griddle.",
    "Add the meat to the hot part of the griddle.",
    "Cook, continuously flipping the meat over and slightly chopping the meat into slightly smaller pieces with 2 spatulas, until the meat is not pink, which should take about 2 minutes.",
    "Mix the meat and the carmelized onions and bell pepper together.",
    "Divide into 2 portions, and top both portions with the cheese to melt.",
    "If using Italian or French bread, cut the bread in half, crosswise, and slice lengthwise to open for the 2 sandwiches.",
    "Hollow out some of the soft white bread part from inside and place face down on top of the meat and cheese.",
    "When the cheese is melted, and with 1 or 2 spatulas, flip the sandwiches over and add topping, such as marinara sauce or ketchup, if desired, and serve immediately.",
    "Submit a Correction"
  ],
  "ingredients": [
    "0",
    "1 loaf Italian bread or 1 loaf French bread or 2 large hoagie rolls or 2 large sub rolls",
    "1⁄2 lb deli roast beef (very rare, sliced wafer thin, or you can use a frozen Rib-Eye roast shaved on an electric slicer, wh)",
    "1 white onion (thinly sliced)",
    "1 green bell pepper (thinly sliced) (optional)",
    "2 teaspoons garlic (minced)",
    "1⁄2 lb provolone cheese (thinly sliced)",
    "extra virgin olive oil (for grilling)",
    "salt and pepper",
    "marinara sauce (optional topping) or ketchup (optional topping)"
  ],
  "__v": 1
}