{
  "hash": "ac637d4bf68bd22f1c6be578f000cadd2c398fa5",
  "title": "Braised Chicken with Preserved Lemon and Olives",
  "image": "",
  "href": "http://www.tastingtable.com/entry_detail/chefs_recipes/16107/Braised_Chicken_with_Preserved_Lemon_and_Olives_Recipe.htm",
  "firstAdded": "2015-01-20T19:36:41.298000",
  "users": [
    null
  ],
  "keywords": [
    "sprigs",
    "thyme",
    "bay",
    "leaf",
    "peppercorns",
    "parsley",
    "leaves",
    "stems",
    "skinon",
    "chicken",
    "legs",
    "drumstick",
    "thigh",
    "patted",
    "dry",
    "salt",
    "black",
    "pepper",
    "olive",
    "oil",
    "heads",
    "garlic",
    "separated",
    "unsalted",
    "butter",
    "flour",
    "white",
    "wine",
    "stock",
    "broth",
    "cerignola",
    "picholine",
    "olives",
    "green",
    "brinecured",
    "used",
    "lemons",
    "rounds",
    "roasted",
    "potatoes",
    "boiled",
    "egg",
    "noodles",
    "slices",
    "country",
    "bread",
    "rubbed"
  ],
  "directions": [
    "0",
    "Make an herb sachet: Lay the thyme, bay leaf, peppercorns and parsley stems on a piece of cheesecloth or in a tea bag. Tie or seal it up.",
    "Season the chicken generously with salt and pepper. Set a wide, heavy braising pan or Dutch oven over medium-high heat. When hot, add just enough oil to coat the bottom of the pan, about 1½ tablespoons. Cook half the chicken, skin-side down, without moving, until brown, about 2 to 3 minutes. Turn and brown the other side. Transfer to a plate. Add more oil as needed. Brown the remaining chicken and transfer to the plate. Add the garlic cloves to the pan and sauté until golden brown, 1 to 2 minutes. Transfer the garlic to a bowl.",
    "Add 2 tablespoons of the butter and the flour to the pan and whisk over low heat until golden brown, about 1 minute. Add the wine and bring it to a boil, scraping the pan with a wooden spoon to pull up the brown bits, until reduced by one-third. Add the stock, browned garlic cloves, olives and herb sachet to the pan. Tuck the chicken, skin-side up, into the sauce. Bring to a boil, then simmer, covered, for 35 minutes.",
    "Preheat the oven t o 425°F. Transfer the chicken to a large baking sheet along with the preserved lemon slices. Use a slotted spoon to transfer the garlic and olives to a bowl. Discard the sachet. If you choose, strain the sauce and return it to the braising pan. Boil the sauce until it thickens, skimming the top from time to time. Whisk in the remaining 1 tablespoon butter and season to taste with salt and pepper.",
    "While the sauce reduces, put the chicken and lemons in the oven to brown, about 20 minutes for the chicken, and 25 for the lemons. Transfer the garlic, olives, and browned chicken back into the reduced sauce. Place the preserved lemon slices on the chicken. Sprinkle with some chopped parsley.",
    "Serve with egg noodles or roasted potatoes, or on a toasted slice of country bread rubbed with garlic and oil."
  ],
  "ingredients": [
    "0",
    "2 sprigs thyme",
    "1 bay leaf",
    "10 peppercorns",
    "Small handful of parsley leaves, chopped, plus a few stems",
    "6 skin-on chicken legs (drumstick and thigh), patted dry",
    "Salt and freshly ground black pepper",
    "Olive oil",
    "2 heads garlic, cloves separated and peeled",
    "3 tablespoons unsalted butter",
    "2 tablespoons flour",
    "3 cups white wine",
    "2 cups chicken stock or broth",
    "16 Cerignola olives (Picholine olives or other green brine-cured olive can be used)",
    "2 small preserved lemons, cut into ⅛-inch thick rounds",
    "Roasted potatoes, boiled egg noodles or toasted slices of country bread rubbed with garlic and oil (optional)"
  ],
  "__v": 1
}