{
  "hash": "aa53d1f0be3561d04c844776f08da1a7e3aee78f",
  "title": "Blueberry Coconut Cake with Lemon Sauce",
  "image": "http://www.melskitchencafe.com/wp-content/uploads/2013/04/Blueberry-Cake-jpg.jpg?x26164",
  "href": "http://www.melskitchencafe.com/blueberry-coconut-cake-with-lemon-sauce/",
  "extension": "Chrome",
  "firstAdded": "2017-01-04T18:09:20.886000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS",
    "Report this ad",
    "Preheat the oven to 350 degrees F. Lightly grease a 9X13-inch aluminum baking dish and set aside.",
    "In a large bowl, combine the flour, sugar, baking powder and salt. In a medium bowl, whisk together the eggs, milk and oil. Stir the wet ingredients into the dry ingredients with a rubber spatula just until moistened. Toss the fresh or frozen blueberries with the 2 tablespoons flour and fold them in very gently to the batter. Don't overmix or the batter will start take on a blue-ish tinge.",
    "Scrape the batter into the prepared baking dish. Sprinkle the top of the cake with the coconut and bake for 18-25 minutes, until a toothpick inserted in the center comes out clean. Cool the cake in the pan on a wire rack.",
    "For the sauce, in a small saucepan, combine the sugar, cornstarch and grated lemon zest. Gradually whisk in the water until blended. Bring the mixture to a boil over medium heat, whisking often, and cook, stirring constantly, for 2 minutes at a boil until the mixture is thickened. Remove the pan from the heat and stir in the butter and lemon juice. The sauce can be used warm or at room temperature.",
    "Cut the cake into squares and drizzle each piece with the lemon sauce. Serve."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "For the cake:",
    "2 cups all-purpose flour",
    "1 cup granulated sugar",
    "1 tablespoon baking powder",
    "1/4 teaspoon salt",
    "2 large eggs",
    "1 cup milk",
    "1/2 cup vegetable or canola oil",
    "1 1/2 cups fresh or frozen blueberries (unthawed)",
    "2 tablespoons flour",
    "1 cup flaked sweetened coconut",
    "For the sauce:",
    "1/2 cup granulated sugar",
    "4 1/2 teaspoons cornstarch",
    "1 teaspoon grated lemon zest",
    "1 cup water",
    "1 tablespoon butter",
    "2 tablespoons fresh lemon juice (from about 1 lemon)"
  ],
  "__v": 1
}