{
  "hash": "f61ec4112e3992906cf072435d3153fb351739c0",
  "title": "Cinnamon Rolls",
  "image": "http://themamasgirls.com/wp-content/uploads/2013/09/Cinnamon-Rolls-that-melt-in-your-mouth-So-good.jpg",
  "href": "http://themamasgirls.com/cinnamon-rolls-that-melt-in-your-mouth/",
  "extension": "Chrome",
  "firstAdded": "2016-01-18T18:34:27.640000",
  "users": [
    null
  ],
  "keywords": [
    "pkg",
    "yeast",
    "water",
    "sugar",
    "salt",
    "oil",
    "eggs",
    "evaporated",
    "milk",
    "flour",
    "cinnamon",
    "brown",
    "cream",
    "cheese",
    "icing",
    "tblspns",
    "butter",
    "vanilla"
  ],
  "directions": [
    "0",
    "Dissolve yeast in the warm water. Add the remaining ingredients in the order listed (the dough will be soft.) Turn out onto floured surface and knead until smooth and elastic (about 10 minutes.) If using an electric mixer with a dough hook, add just enough flour to clean the sides of the mixing bowl and knead the dough on medium speed for about 6 minutes. Place the dough in greased bowl, cover and allow to rise in a warm place until dough has doubled in bulk. Punch down and shape into cinnamon rolls by rolling the dough into a rectangle that is 15 inches long by 18″ wide.",
    "Spread the rectangle of dough generously with softened butter. Sprinkle with a good amount of brown sugar and cinnamon. (You can go heavy on the cinnamon if you like them really cinnamon-y.) Roll tightly from the 15″ edge and pinch the seam to seal all of the butter, sugar and cinnamon inside.",
    "Using a sharp serrated knife, slice the rolls into 15 – 1″ rolls. Place them on a greased baking sheet (3 across and 5 down.) They will be touching when they are all risen and baked.",
    "Cover the rolls with a clean kitchen towel and allow to rise until double in size (about 45 minutes to an hour.) Bake in 375° oven for 25 minutes. Remove from the oven and drizzle with icing or use store bought vanilla frosting that has been warmed in the microwave (this helps it to drizzle more easily!) I make a simple icing using powdered sugar, vanilla extract and a tiny bit of milk. Stir it until it’s smooth.",
    "They are best eaten while warm. I doubt you’ll have any leftovers, but if you do, just keep them in an airtight contai"
  ],
  "ingredients": [
    "0",
    "1 pkg. yeast",
    "3/4 c. warm water",
    "1/3 c. sugar",
    "1 t. salt",
    "1/3 c. oil",
    "3 eggs, beaten",
    "1/4 c. evaporated milk",
    "4 – 4 1/2 c. flour",
    "Cinnamon",
    "Brown Sugar",
    "4 oz - Cream Cheese (Icing)",
    "2 Tblspns - Butter (Icing)",
    "2 cups - Powdered Sugar (Icing)",
    "2-4 Tblspns - Milk (Icing)",
    "1 teaspoon - Vanilla (Icing)"
  ],
  "__v": 2
}