{
  "hash": "12e8ab05d14a95f943bee109826e89d05cc47192",
  "title": "Recipe: Spicy Chiptole Meatballs",
  "image": "http://eatdrinkpaleo.com.au/wp-content/uploads/2013/10/Spicy_chipotle_meatballs_recipe.jpg",
  "href": "http://eatdrinkpaleo.com.au/spicy-chipotle-meatballs-recipe/",
  "extension": "Chrome",
  "firstAdded": "2016-08-18T21:29:26.962000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "If using dried chipotle chilies, place in hot water for at least an hour before using to rehydrate.",
    "Sauté the onion in lard or ghee for 3-5 minutes, until translucent. Use half of the onion in the meatball mix and reserve the rest for the sauce.",
    "While onion is cooking, pre-chop other ingredients for the meatballs. Slice the chipotle chilies in half and remove the seeds. Chop or grind with mortar and pestle.",
    "Combine beef mince with half of the cooked onion, chopped garlic, chipotle chilies, paprika, cumin, coriander seed, salt and olive oil. Combine and knead with your hands. Using clean, wet hands roll the mix into small balls (somewhere between a walnut and a golf ball size). Set aside until ready to cook.",
    "Preheat a dollop of lard in the large frying pan until sizzling hot. Cook the meatballs on medium/high heat for 3 minutes on each side, until well browned.",
    "Add the rest of the cooked onion, garlic, two chopped chilies and sauce spices to the pan with the meatballs. Stir through and add the tomato puree. Combine and cook for 8-10 minutes uncovered, stirring frequently to make sure the meatballs cook evenly and the sauce is well combined. Taste for salt. Drizzle with a little lime juice before serving."
  ],
  "ingredients": [
    "0",
    "1 large, deep frying pan",
    "1 large brown onion, peeled and diced finely",
    "1 tsp of lard or ghee (clarified butter)",
    "1",
    "800g of grass fed beef mince (1.8 pounds ground beef)",
    "3 medium dried chipotle chilies (tinned chipotle can also be used), seeds out",
    "2 tbsp chopped fresh coriander (cilantro)",
    "2 large garlic cloves, finely diced",
    "1 tsp ground coriander seed or powder",
    "1 tsp ground cumin seed or powder",
    "1 tsp sweet or medium paprika",
    "1 tbsp virgin olive oil",
    "1 ½ tsp of sea salt",
    "2 tbsp lard (I used a mix of lard and ghee)",
    "2",
    "½ of the onion mentioned above",
    "2 garlic cloves, finely chopped",
    "2 medium chipotle chilies, seeds out",
    "½ tsp ground coriander seed or powder",
    "1 tsp ground cumin seed or powder",
    "½ tsp paprika",
    "2 bay leaves",
    "400g of diced tomatoes or tomato puree (about 1 ½ cups)",
    "½ tsp sea salt"
  ],
  "__v": 1
}