{
  "hash": "35d0ddd04fb551f3d5b19d0d03fce696762f886b",
  "title": "Khao Poon",
  "image": "https://www.196flavors.com/wp-content/uploads/2012/11/khao-poon-3.jpg",
  "href": "https://www.196flavors.com/laos-khao-poon-kapoon/",
  "extension": "Chrome",
  "firstAdded": "2018-12-11T13:32:33.957000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Khao Poon",
    "Put the pieces of chicken in a large stockpot, covered with water. Slice the galangal finely and add to the pot with a teaspoon of salt. Cook on medium for 30 minutes.",
    "While waiting, cook rice vermicelli in boiling water for 3 to 5 minutes. Then, drain in a colander and flush with cold water. Set aside.",
    "After chicken is cooked, remove from pot, debone and shred into tiny pieces.",
    "Drain chicken broth to a large bowl and set aside.",
    "In the stockpot, add 2 tablespoons of oil. Add the garlic and cook on medium for 1 minute. Then, add the red curry paste. Stir and sauté for a few minutes.",
    "Add the shredded chicken, and stir to coat with the red curry paste.",
    "Add the bamboo shoots and stir to coat. Continue to cook for 5 minutes.",
    "Add the coconut milk and stir.",
    "Add at least 6 cups of the reserved chicken broth, or more according to taste. Add a teaspoon of salt.",
    "To serve, place rice vermicelli in a bowl, then ladle soup on top. Garnish with a combination of shredded carrots, shredded cabbage, cilantro, mint, banana flower, and squeeze some lime on top.",
    "Eat immediately.",
    "Red Curry Paste",
    "Soak the chili peppers in water for 10 minutes, and then drain them.",
    "Mix the dry spices (white pepper, cumin, coriander) together. Set aside.",
    "In a large mortar, pound the sliced chili pepper with salt for about 5 minutes.",
    "Add the garlic, shallots, lemongrass, galangal, and kaffir lime peel, and continue pounding for at least 10 minutes.",
    "Mix in the dry spices, and continue to pound to obtain a homogeneous paste.",
    "Alternatively, you can use a blender instead of a mortar, although the result will not be as authentic."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "For the khao poon",
    "2 lb chicken pieces (bone-in)",
    "1 oz. galangal (or ginger root)",
    "3 cloves garlic , crushed",
    "8 tablespoons red curry paste (recipe below)",
    "2 (8 oz.) cans bamboo shoots",
    "1 (14 oz.) can coconut milk",
    "Garnish",
    "2 carrots , julienned",
    "1 cabbage , thinly shredded",
    "1 banana flower",
    "A few mint leaves",
    "A few cilantro leaves",
    "2 limes",
    "For the Red Curry Paste",
    "12 dry red Thai chili peppers",
    "4 teaspoons ground white pepper",
    "1 teaspoon ground cumin powder",
    "1 teaspoon ground coriander",
    "15 cloves garlic",
    "2 tablespoon thinly sliced lemongrass",
    "4 shallots",
    "1 tablespoon sliced galangal (or ginger)",
    "Peel of a kaffir lime",
    "1 teaspoon salt"
  ],
  "__v": 1
}