{
  "hash": "4852917f7f01e26f3a2f0398dc36184e2f531df2",
  "title": "Low Carb Lemon Bar Recipe - Keto & Gluten Free",
  "image": "http://www.ibreatheimhungry.com/wp-content/uploads/2015/03/lemonbars5wmsmall-492x700.jpg",
  "href": "http://www.ibreatheimhungry.com/2015/03/low-carb-lemon-bar-recipe-keto-gluten-free.html?utm_content=bufferf77f6&utm_medium=social&utm_source=facebook.com&utm_campaign=buffer",
  "extension": "Chrome",
  "firstAdded": "2016-08-14T16:03:18.794000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Melt the butter in the microwave or a small saucepan. Add the almond flour, sweetener, and lemon zest, stirring until fully combined. Press the dough evenly along the bottom and ½ inch up the sides of an 8 x 8 inch square pan. For best results line the pan with parchment paper or foil first, then you can simply lift out the completed lemon bars. Bake at 350 degrees (F) for 10 minutes. Remove and cool while you make the filling.",
    "1",
    "Melt the butter in a small saucepan on low heat. Remove from heat and whisk in sweetener, lemon juice, and lemon zest until dissolved. Whisk in the egg yolks and return to the stove over low heat. Whisk continually until the curd starts to thicken. Remove from the heat and strain into a small bowl. Whisk in the the xanthan gum and gelatin until dissolved and smooth.",
    "Pour the filling over the pre-baked crust and spread out evenly to the edges of the pan. Bake the bars at 350 degrees (F) for 15 minutes. Remove and cool. Sprinkle with Powdered Swerve before serving if desired. Cut into sixteen 2 x 2 squares."
  ],
  "ingredients": [
    "0",
    "6 Tbl butter",
    "2 cups almond flour",
    "⅓ cup granulated sugar substitute (I used Swerve)",
    "1 Tbsp freshly grated lemon zest",
    "1",
    "½ cup butter",
    "½ cup granulated sugar substitute (I used Swerve)",
    "½ cup fresh lemon juice",
    "¼ cup lemon zest",
    "6 egg yolks",
    "½ tsp xanthan gum",
    "2 Tbsp unflavored gelatin (I used Great Lakes)"
  ],
  "__v": 1
}