{
  "hash": "d07fbb3ef807ec11ddc767b40c867727250f9d7e",
  "title": "Recipe: One-Bowl Vanilla Sheet Cake with Sprinkles",
  "image": "https://atmedia.imgix.net/3b69feee15f6582f6c63765df541905bead2dac6?auto=format&q=45&w=600.0&h=800.0&fit=max&cs=strip",
  "href": "https://www.thekitchn.com/one-bowl-vanilla-cake-vanilla-sheet-cake-with-sprinkles-244000",
  "extension": "Chrome",
  "firstAdded": "2017-11-29T01:33:41.456000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the cake: Arrange a rack in the middle of the oven and heat to 350°F. Coat a 13x18-inch rimmed baking sheet (also known as a half sheet pan) with cooking spray; set aside.",
    "Whisk the flour, sugar, baking powder, and salt together in a large bowl. Add the eggs, oil or butter, milk, and vanilla and mix with an electric hand mixer on medium speed until smooth, about 3 minutes.",
    "Pour the batter into the baking sheet. Bake until the cake is lightly browned and springs back when gingerly pressed with a finger, 20 to 25 minutes. Cool the cake on a wire rack while preparing the frosting.",
    "Make the frosting: Beat the butter in a large bowl with an electric hand mixer on medium speed until smooth. Add the powdered sugar 1/2 cup at a time, beating well after each addition. Add the vanilla and milk and beat until smooth and fluffy.",
    "Spread the frosting right on top of the cake and use the tip end of a small spoon to work the frosting back and forth, creating a striped pattern. Decorate with sprinkles if using."
  ],
  "ingredients": [
    "0",
    "Cooking spray",
    "3 cups all-purpose flour",
    "1 3/4 cups granulated sugar",
    "1 1/2 teaspoons baking powder",
    "3/4 teaspoon salt",
    "4 large eggs",
    "3/4 cup canola oil, or melted and cooled unsalted butter",
    "1 cup whole milk",
    "1 tablespoon vanilla extract",
    "For the frosting:",
    "8 tablespoons (1 stick) unsalted butter, at room temperature",
    "3 cups powdered sugar",
    "1 teaspoon vanilla extract",
    "1 tablespoon whole milk",
    "Disc sprinkles (optional)"
  ],
  "__v": 1
}