{
  "hash": "6820225712229ffd93e6e1ee9a7590091dfaf989",
  "title": "Stir-Fried Chicken with Snap Peas and Basil",
  "image": "",
  "href": "http://katu.com/amnw/am-northwest-cooking-recipes/milk-street-stir-fried-chicken-wsnap-peas-basil",
  "extension": "Chrome",
  "firstAdded": "2017-10-09T23:17:07.822000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium bowl, stir together the chicken, soy sauce, 1 tablespoon of the fish sauce and ½ teaspoon white pepper. Let sit for 15 minutes, then drain and pat dry with paper towels.",
    "In a 12-inch nonstick skillet, heat 1 tablespoon of the oil over medium-high until just smoking. Add the chicken, distributing it in an even layer. Cook, stirring occasionally, until well browned and cooked through, 5 to 7 minutes. Transfer to a clean bowl, then stir in the chopped basil and vinegar. Set aside.",
    "Add the remaining 2 tablespoons oil to the skillet and heat over medium-high until just smoking. Add the snap peas, scallion whites and chilies. Cook, stirring occasionally, until the peas are lightly browned, about 3 minutes. Add the garlic and cook, stirring, until fragrant, about 30 seconds. Stir in the sugar. Add the scallion tops and the chicken with the accumulated juices and cook, stirring, until most of the juices have evaporated, about 1 minute.",
    "Off heat, add the remaining 2 tablespoons fish sauce and the torn basil. Stir until the basil is wilted. Taste and season with white pepper."
  ],
  "ingredients": [
    "0",
    "o prepare the chicken, cut each breast lengthwise into ½-inch strips, then cut the strips crosswise into 1-inch pieces. Using both chopped basil (mixed with the cooked chicken) and whole basil leaves (stirred in at the end) provided the full herbal flavor and fragrance we were looking for. Serve with steamed white or brown jasmine rice.",
    "Don't begin cooking until all ingredients are prepared. The stir-fry comes together quickly, so make sure everything is ready and close at hand.",
    "1 pound boneless, skinless chicken breasts, cut into 1-inch pieces",
    "3 tablespoons fish sauce, divided",
    "1 tablespoon soy sauce",
    "Ground white pepper",
    "3 tablespoons peanut oil, divided",
    "¼ cup chopped fresh basil leaves, plus 3 cups torn and lightly packed",
    "2 tablespoons white vinegar",
    "4 ounces sugar snap peas, strings removed, halved on the bias",
    "8 scallions, white and light green parts finely chopped, dark green tops cut into 1-inch pieces",
    "2 or 3 serrano chilies, stemmed and thinly sliced",
    "4 garlic cloves, thinly sliced",
    "1 tablespoon white sugar"
  ],
  "__v": 1
}