{
  "hash": "75915c4bdb90aedd4de3c7d039a037a703149bea",
  "title": "Basque-Style Paella",
  "image": "http://www.nhmagazine.com/images/customdata/a37ca59ad8f12791d53277d5cdb67607.jpg",
  "href": "http://www.nhmagazine.com/Recipes/index.php/name/Basque-Style-Paella/record/3364/",
  "extension": "Chrome",
  "firstAdded": "2018-01-20T04:21:35.088000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prep:",
    "Preheat oven to 475° F. Wash the mussels under running water, scrubbing them well and pulling off their beards. Throw away any that are open. Peel and de-vein shrimp, leaving the tail on.",
    "Cook:",
    "Put the mussels in the French oven with water, cover and cook over medium heat until they open. Remove with a slotted spoon to a bowl. Save the cooking liquid in a measuring cup.",
    "Wipe out the French oven, add 3 tablespoons oil, toss in the chorizo and cook over medium-low heat until the oil is well flavored from the chorizo, about 5 minutes. Remove the chorizo to a large bowl. Keep the oil in the French oven.",
    "Liberally season the chicken with salt and pepper. In the ovenproof skillet, heat remaining oil until shimmering hot, add the chicken and brown on all sides, 10–14 minutes.",
    "Transfer the skillet to the hot oven for another 17 minutes or until the chicken is cooked. Remove from the oven and toss the chicken into the bowl.",
    "Add a little more oil to the skillet, if needed. Heat until it is shimmering hot, toss in the shrimp and cook on medium until pink. Transfer to the bowl.",
    "Add a little more oil to the French oven, if needed, and when it is shimmering hot, toss in the onion, garlic and bell peppers and cook on medium for 6 minutes.",
    "Add the rice, stock, turmeric, piment d’Espelette, thyme and crushed red pepper flakes. Bring to a boil over medium heat, reduce to a simmer, cover and cook for about 20 minutes, until the rice is cooked.",
    "Nestle the contents from the bowl into the rice in the French oven. Garnish with roasted red pepper and prosciutto. Add lemon quarters, sprinkle with parsley and bring to the table to serve."
  ],
  "ingredients": [
    "0",
    "2 pounds mussels",
    "16 medium or large shrimp",
    "2 cups water",
    "6 tablespoons extra virgin olive oil, divided",
    "1 cup thinly sliced half moon chorizo sausage",
    "8 boneless chicken thighs with skin",
    "Salt and pepper, to taste",
    "1 medium yellow onion, finely chopped",
    "½ teaspoon crushed red pepper flakes",
    "1 8-ounce jar roasted red peppers, sliced into thin strips",
    "6 ounces prosciutto (or French Jambon de Bayonne, if you have access to it), sliced into ½-inch wide ribbons",
    "2 organic lemons, quartered",
    "¼ bunch flat-leaf parsley, stemmed and leaves minced",
    "4 large cloves garlic",
    "2 large red bell peppers, sliced into ¼-inch strips",
    "2 cups short-grain rice or Arborio rice",
    "6 or more cups chicken stock",
    "1 tablespoon ground turmeric",
    "2 teaspoons piment d’Espelette (smoked paprika or sweet paprika as an alternative)",
    "2 tablespoons fresh thyme leav"
  ],
  "__v": 1
}