{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 425 Fahrenheit.",
    "Cut the squash in 2 halves, scrape out the seeds and the fiber out of each half. Spray oil over the cut sides of the squash. Spray the baking sheet with oil and place the squash on the baking sheet cut side down.",
    "Bake for about 30-40 minutes. Remove it from the oven when it's cooked through and soft, and let it cool. Flip the squash so that cut side faces up – that will speed up the cooling. After squash cools, scrape squash with a fork to remove flesh in long strands and transfer to a bowl.",
    "Heat olive oil in a large skillet on medium-high heat. Add sliced zucchini and minced garlic and saute for about 3 minutes, stirring, on medium heat, uncovered. Season with salt, stir, and continue cooking for another 3-4 minutes, covered, occasionally stirring, until zucchini softens and browns a bit. We are cooking it covered to preserve the juices. Note: Depending on the size of your skillet, you might have to cook zucchini in 2 separate batches.",
    "Add spaghetti squash to the skillet with zucchini and mix to combine, on low heat.",
    "Add freshly shredded Parmesan cheese into the skillet and stir on low heat to melt the cheese. Add salt and pepper, to taste. Top with toasted pine nuts."
  ],
  "firstAdded": "2014-09-17T22:13:27.894000",
  "hash": "b37a636a9bdc77242d333058db2865c74f83cf59",
  "href": "http://juliasalbum.com/2014/09/zucchini-spaghetti-squash-with-pine-nuts/",
  "image": "https://farm4.staticflickr.com/3886/14998462099_42a656a8ff_c.jpg",
  "ingredients": [
    "0",
    "3 tablespoons olive oil",
    "4 zucchinis or 1 very large zucchini, sliced",
    "4 garlic cloves, minced",
    "1 spaghetti squash, medium size",
    "1 cup freshly shredded Parmesan cheese",
    "1/2 cup pine nuts, toasted",
    "salt and pepper"
  ],
  "keywords": [
    "olive",
    "oil",
    "zucchinis",
    "zucchini",
    "garlic",
    "spaghetti",
    "squash",
    "medium",
    "size",
    "parmesan",
    "cheese",
    "pine",
    "nuts",
    "salt",
    "pepper"
  ],
  "title": "Parmesan Zucchini & Spaghetti Squash with Pine Nuts",
  "users": [
    null
  ]
}