{
  "hash": "7c11aee008dba7991a1a10c4274a77ca95ed1d8c",
  "title": "Puff pastry",
  "image": "http://recipe-folder.com/img/recipe-images/001/931/200846501.jpg",
  "href": "https://www.womensweeklyfood.com.au/recipes/puff-pastry-6491",
  "extension": "Chrome",
  "firstAdded": "2020-04-03T00:35:42.377000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Process flour, melted butter, salt and water until combined and beginning to form a dough in the processor. Tip out onto a lightly floured surface; knead briefly until dough is smooth. Cut a cross in the top; wrap in plastic-wrap. Refrigerate 30 minutes.",
    "Meanwhile, place cold butter between 2 sheets baking paper. Hit with a rolling pin until an even 1.5cm thickness and about 12cm x 12cm. Refrigerate until required.",
    "Remove pastry from refrigerator. Place on lightly floured work bench. Press rolling pin into top \"corner\" of dough, and roll out a \"petal\". Give the dough a quarter turn and repeat. Do this step twice more until you have a rough cross shape in front of you, with a slight lump in the centre.",
    "Place the chilled butter in the centre of the cross, on the mound. Fold petals over butter to enclose.",
    "Lightly tap the top of the pastry with a rolling pin to seal the edges and to enlarge and flatten the square a little.",
    "Roll out to a long rectangle, approximately 25cm x 55cm. It is important to keep the edges of the rectangle as straight as possible.",
    "Fold the bottom quarter of the pastry up towards the centre, taking care to align the edges. Brush off any flour. Fold top quarter down to centre. Fold top half over bottom half to make a neat rectangle; brush off any excess flour (this is a double fold). You should have a neat square of pastry with the fold at the bottom. Turn the pastry a quarter turn to the right (so the seam is facing your right hand side)",
    "Roll pastry into a long rectangle. Fold into thirds (this is a single fold). Roll out to a similarly sized rectangle as the first roll and make a double fold (see above). Wrap in plastic wrap. Refrigerate 30 minutes.",
    "Roll out to a long rectangle and repeat 7 and 8 twice more. Wrap and refrigerate 10 minutes before rolling and shaping for baking.",
    "Pastry can be kept refrigerated for 2 days or frozen for several months. It is an easy principle to follow and therefore not hard to make beautiful puff pastry, although it is time-consuming. However the flavour and texture are vastly superior to bought puff pastry.",
    "Rough puff can easily be made by rolling and folding a normal shortcrust pastry in the same manner as in the puff recipe above. This will not give the same results but is slightly simpler to manage."
  ],
  "ingredients": [
    "0",
    "500 gram plain flour",
    "50 gram butter, melted, cooled",
    "1 teaspoon salt",
    "1 cup (250ml) iced water",
    "250 gram cold butter",
    "flour, extra, for dusting"
  ],
  "__v": 1
}