{
  "__v": 1,
  "directions": [
    "0",
    "Glaze: Combine the orange juice, chilies, sugar and vinegar in a non-reactive pot over medium-high heat. Bring to simmer to reduce by two-thirds, or until it resembles a light syrup. Remove from the heat and strain, discarding the solids. Set aside.",
    "Preheat oven to 400 F. Trim off the top and bottom of the squash and cut into four wedges, leaving the skin on. Scoop out the seeds and guts of the squash and discard. Slice each quarter of the squash into ¼-inch (6 mm) half moons. Combine the squash with 2 tbsp (30 mL) of the olive oil in a large bowl. Season with salt and pepper and spread evenly onto a baking sheet. Roast the squash just tender, about 20 minutes uncovered.",
    "Meanwhile, trim ¼-inch (6 mm) off the end of each mushroom. Slice them lengthwise, ¼-inch (6 mm) thick. Toss the mushrooms with 2 tbsp (30 mL) of the olive oil in a medium bowl. Season with salt and pepper and set aside.",
    "Toss the pepitas with the remaining 1 tbsp (15 mL) olive oil. Place them on a separate baking sheet and bake until lightly browned, about 8 minutes. As soon as you remove the seeds from the oven, toss with salt.",
    "After the squash has roasted for 20 minutes, remove the pan from the oven and immediately spread the mushrooms over the top. Return to the oven and continue baking until the mushrooms have wilted, another 5 minutes.",
    "Toss the squash and mushrooms with the orange glaze and roasted pepitas and serve."
  ],
  "firstAdded": "2014-05-09T22:24:44.880000",
  "hash": "2cfc500b580a902635b98a5351089cae96405a3a",
  "href": "http://www.vancouversun.com/life/Wine+Match+Orange+glazed+Acorn+Squash+with+Roasted+Mushrooms+Pumpkin+Seeds/9483094/story.html",
  "image": "http://www.vancouversun.com/life/Wine+Match+Orange+glazed+Acorn+Squash+with+Roasted+Mushrooms+Pumpkin+Seeds/9483094/cms/binary/9483095.jpg",
  "ingredients": [
    "0",
    "1 cup (250 mL) fresh orange juice",
    "4 dried Thai chilies",
    "2 tbsp (30 mL) sugar",
    "1 tbsp (15 mL) sherry vinegar",
    "1 acorn squash (about 1 ½ lbs/680 g)",
    "5 tbsp (75 mL) extra-virgin olive oil",
    "Salt",
    "Freshly ground black pepper",
    "8 oz (225 g) trumpet royale mushrooms",
    "2/3 cup (160 mL) pepitas (hulled pumpkin seeds)"
  ],
  "keywords": [
    "orange",
    "juice",
    "thai",
    "chilies",
    "sugar",
    "sherry",
    "vinegar",
    "acorn",
    "squash",
    "lbs",
    "extravirgin",
    "olive",
    "oil",
    "salt",
    "black",
    "pepper",
    "trumpet",
    "royale",
    "mushrooms",
    "pepitas",
    "hulled",
    "pumpkin",
    "seeds"
  ],
  "title": "Orange-glazed Acorn Squash with Roasted Mushrooms and Pumpkin Seeds",
  "users": [
    null
  ]
}