{
  "hash": "16302d4495a954a6b2fcacb930ef17c99db8dfd6",
  "title": "HAVERMOUT ONTBIJT CAKE",
  "image": "http://fitbeauty.nl/wp-content/uploads/2014/04/recept-havermout-ontbijt-cake-12.jpg",
  "href": "http://fitbeauty.nl/recept-havermout-ontbijt-cake/",
  "extension": "Chrome",
  "firstAdded": "2016-10-05T17:19:52.919000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Verwarm de oven vast voor op 180 graden Celcius",
    "Doe het vet, melk en honing in een kom en meng dit met een vork door. Het kan zijn dat het vet niet goed gemengd wordt, maar dat is niet erg. Eenmaal in de oven zal het toch wel smelten.",
    "Doe vervolgens de havermout erbij en roer dit erdoor",
    "Lijnzaad!",
    "Een ei erbij",
    "En toen ging ik los met mijn potje kaneel. Hoera!",
    "Vet je bakblik in en snijd de banaan in plakjes zodat je deze op de bodem kunt neerleggen",
    "Doe vervolgens het mengsel erover, ik heb de bovenkant nog een beetje besrpinkelt met lijnzaad",
    "Handje bosbessen bovenop. Je hoeft ze er niet in te duwen, ze zakken vanzelf in de oven. Zet dit 40 tot 50 minuten in de voorverwarmde oven. Het is afhankelijk van je oven hoelang ze erin moeten blijven, dus houd het even in de gaten!",
    "Je zult merken dat het wat “nattig” is als het de oven uit komt. Maar het komt goed! Laat het helemaal afkoelen (of neem alvast een klein hapje), ik heb het in de koelkast gelegd en ben direct naar bed gegaan. Niet kunnen wachten tot het ontbijt!",
    "De volgende ochtend ging mijn wekker en ik dacht alleen maar: MIJN CAKE! IK WIL HET NU PROEVEN!",
    "Met een kopje koffie erbij, héérlijk ontbijtje zo voor het werk!",
    "Ik ben dol op de smeuïgheid! En vooral ook de “verrassing” van de plakjes banaan aan de onderkant. Goed gelukt dus als je het mij vraagt!"
  ],
  "ingredients": [
    "0",
    "Goed, wat heb je nodig?",
    "160 gram havermout",
    "3 eetlepels kokosvet (of boter)",
    "480 ml plantaardige melk",
    "4 eetlepels lijnzaad",
    "1 ei",
    "120 ml honing",
    "1 banaan",
    "handje bevroren bosbessen (hoeveelheid mag je zelf bepalen)",
    "heeeeel veeeeeel kaneel als je dat lekker vindt",
    "Bakblik"
  ],
  "__v": 1
}