{
  "hash": "4ab5b03f19fe6c8091dc9cbff21b15926f430de7",
  "title": "Mini Calzones",
  "image": "http://www.elephantasticvegan.com/wp-content/uploads/2015/10/vegan-mini-calzones4.jpg",
  "href": "http://www.elephantasticvegan.com/vegan-mini-calzones/",
  "extension": "Chrome",
  "firstAdded": "2016-07-06T23:53:05.892000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the dough put all ingredients in a kitchen machine or mix by hand and let it rise until it doubles in size, but keep it covered under a clean kitchen towel otherwise the dough will dry out.",
    "Prepare the Nooch Cheese Sauce.",
    "Preheat the oven as hot as possible.",
    "Cut the dough in 8 equal pieces and roll them out on a floured surface.",
    "Clean the mushrooms and spinach, cut the mushrooms in thin slices and put the mushrooms in a hot pan (You want the mushrooms to lose most of their water now, they shouldn't water up the calzone later). Add the spinach to let it cook down.",
    "For the tomato sauce mix the tomato purée with the salt, ground pepper, fresh oregano, onion powder and liquid smoke. (Adjust the sauce to your taste)",
    "Spread the tomato sauce over half of the calzone pizzas, add the mushroom-spinach mixture and add the vegan cheese sauce.",
    "Fold the calzone and press it down on the edges. Fold the edges again and a third time to make it pretty! Repeat until all calzones are fold.",
    "Brush the calzones with a bit of olive oil and bake them in the oven for about 20-30 minutes. Enjoy!"
  ],
  "ingredients": [
    "0",
    "3 cups / 360g all-purpose flour",
    "¼ teaspoon salt",
    "1 teaspoon olive oil",
    "½ package / 4g active dry yeast",
    "¾ cup + 1 teaspoon warm water",
    "1",
    "2 cups mushrooms",
    "2-3 cups fresh spinach",
    "Homemade Nooch Cheese (or sub with your favorite vegan cheese shreds)",
    "1½ cups tomato purée* (if you don't want tomato sauce to dip the Calzones in afterwards, half the amount of tomato purée!)",
    "¼ teaspoon salt",
    "ground pepper",
    "⅛ teaspoon garlic powder",
    "¼ teaspoon Liquid Smoke",
    "a few twigs fresh oregano",
    "olive oil for brushing the top"
  ],
  "__v": 1
}