{
  "hash": "ed51e55e886524c16a362697add754e2dbde1fe6",
  "title": "Best Lentil Dal",
  "image": "http://recipe-folder.com/img/recipe-images/087/308/2442706687.gif",
  "href": "https://www.thekitchn.com/how-to-make-the-best-lentil-dal-at-home-236344",
  "extension": "Chrome",
  "firstAdded": "2020-02-02T16:35:28.416000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cook the lentils. Sort through the lentils and remove any debris. Rinse in a fine-mesh strainer under cool, running water. Place the lentils and 3 cups water in a small saucepan and bring to a simmer over medium-high heat. Reduce the heat slightly to maintain a simmer, and cook until the lentils are tender, about 30 minutes. Meanwhile, cook the spices.",
    "Sauté the aromatics and spices. Heat the ghee in a medium skillet over medium-high heat. Add the onion, garlic, and ginger, and cook until browned, about 8 minutes. Add the salt, cumin, turmeric, coriander, and bay leaf, and cook until fragrant, about 1 minute more.",
    "Add the tomatoes. Add the tomatoes along with their juices, reduce the heat to low, and keep warm while the lentils cook.",
    "Add the aromatics and tomatoes to the lentils. Add the tomato mixture to the cooked lentils and stir to combine. Do not be gentle, use a wooden spoon or spatula to mash the lentils and combine the mixture.",
    "Make the tadka. Heat the ghee in a small saucepan or skillet over medium heat (you can use the same skillet you cooked the aromatics and tomatoes in, just wipe it clean before proceeding). Have a lid handy. Tilt the pan to form a pool of ghee, add the cumin and black pepper, and cover immediately. Once the spices stop spluttering, remove from the heat and add the garlic. It will brown quickly, so transfer the tadka to another bowl for serving after it browns, or add immediately to the lentils.",
    "Serve. Add the tadka to the lentils, garnish with cilantro if using, stir, and serve hot over rice or with roti."
  ],
  "ingredients": [
    "0",
    "1 cup split red lentils",
    "3 cups water",
    "2 tablespoons ghee",
    "1 small yellow onion, diced small",
    "4 cloves garlic, thinly sliced",
    "1 (1/2-inch) piece fresh ginger, peeled and minced",
    "1/2 teaspoon kosher salt",
    "1/2 teaspoon ground cumin",
    "1/2 teaspoon ground turmeric",
    "1/4 teaspoon ground coriander",
    "1 bay leaf",
    "1 (15-ounce) can diced tomatoes, or 2 diced large, ripe tomatoes"
  ],
  "__v": 1
}