{
  "hash": "2e0098f5d41dee1e5c4ef674f4f75345104d625c",
  "title": "Ratatouille",
  "image": "http://acleanbake.com/wp-content/uploads/2015/08/IMG_9212-683x1024.jpg",
  "href": "http://acleanbake.com/ratatouille/",
  "extension": "Chrome",
  "firstAdded": "2016-08-05T01:06:53.182000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350F. Lightly grease a 6\"x9\" baking dish and set aside.",
    "In a medium mixing bowl, combine the crushed tomatoes, oil and vinegar. Stir in the garlic, basil, herbs de Provence, salt, pepper, and chili powder.",
    "Pour the tomato mixture into the prepared baking dish and smooth it into an even layer on the bottom of the pan.",
    "Stack the veggie slices in alternating patters (e.g.: onion, zucchini, eggplant, tomato; repeat) and place them on their side in the pan, leaning against the edge of the pan. Repeat until you've formed a couple of rows of veggies, filled the pan, and used up all of the veggie slices.",
    "Optionally, spray or brush the exposed tops of the veggies with oil to encourage browning in the oven. This is more for appearance, so feel free to skip this step if you want.",
    "Bake for about an hour, until the tomato sauce at the bottom is bubbling and the veggies are tender.",
    "Garnish with additional chopped fresh basil before serving (optional). Serve hot or cold."
  ],
  "ingredients": [
    "0",
    "1 cup crushed tomatoes",
    "1 Tablespoon extra virgin olive oil",
    "1/4 teaspoon apple cider vinegar",
    "1 teaspoon minced garlic",
    "1 Tablespoon fresh basil, sliced (about 3-4 large leaves), plus more for garnish",
    "1 teaspoon herbs de Provence spice mix",
    "1/4 teaspoon salt",
    "1/4 teaspoon pepper",
    "1/4 teaspoon chili powder",
    "1 medium sweet or red onion, sliced",
    "1 large zucchini, sliced (about 1 1/2 cups slices)",
    "1 large japanese eggplant, sliced (about 3 cups slices)",
    "3 large roma tomatoes, sliced (about 3 cups slices)"
  ],
  "__v": 1
}