{
  "hash": "596afd11b52accb38f499522b748f1f048ae02ca",
  "title": "Green Shakshuka",
  "image": "https://www.leannebrown.com/wp-content/uploads/2017/03/xclose-up-of-yolks-1024x1402.jpg.pagespeed.ic.5GngVdyksD.webp",
  "href": "https://www.leannebrown.com/green-shakshuka/",
  "extension": "",
  "firstAdded": "2018-05-01T20:45:04.163000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large pan or dutch oven melt the butter on medium heat. Add the garlic and scallions and saute for just a minute until you can smell them.",
    "Add the spinach to the pan and stir to coat in the butter and garlic. Place a lid on the pan to allow the spinach to steam for 2 to 3 minutes.",
    "Next add the dill and mint, and a sprinkling of salt and stir. The spinach should be wilted and greatly reduced in volume. The spinach will release some water as it cooks and you'll want to try to cook off as much of this water as possible. Taste it and add more salt if needed.",
    "Once the spinach doesn't look too watery it's time to cook the eggs! Make 4 indents, one in each corner of the pan.",
    "Crack the eggs, one at a time into a bowl. Pour each egg into your prepared indents. Sprinkle them with salt and pepper and place the lid on top for about 2 minutes, until the whites of the eggs are fully cooked but the yolks are still nice and runny.",
    "While your eggs cook prepare your toast your bread or pita so it's hot and ready when the eggs are cooked.",
    "Take the shakshuka off the heat and drizzle yogurt over the top. Alternatively you can serve it and drizzle the yogurt over each bowl.",
    "Serve in bowls with the toast or pita and enjoy!"
  ],
  "ingredients": [
    "0",
    "1 Tbsp olive oil or butter",
    "2 cloves garlic finely chopped",
    "4 to 6 scallions chopped",
    "9 oz fresh spinach roughly chopped (or substitute about 4 oz frozen)",
    "1/2 cup fresh dill chopped",
    "1/4 cup fresh mint chopped",
    "4 large eggs",
    "Salt and pepper to taste",
    "1/4 cup yogurt for topping",
    "toast or pita bread for serving"
  ],
  "__v": 1
}