{
  "hash": "7a89d3e245150948db0e668922a20d4fafa3b8de",
  "title": "Triple Dark Chocolate Donuts w/ Cacao Nibs (Vegan, Gluten Free)",
  "image": "http://i0.wp.com/willfrolicforfood.com/wp-content/uploads/2015/01/triple-chocolate-donuts-vegan-gluten-free-5561.jpg?resize=685%2C457",
  "href": "http://willfrolicforfood.com/2015/01/triple-dark-chocolate-doughnuts-w-cacao-nibs-vegan-gluten-free.html",
  "extension": "",
  "firstAdded": "2015-11-11T16:50:17.849000",
  "users": [
    null
  ],
  "keywords": [
    "sorghum",
    "flour",
    "white",
    "rice",
    "coconut",
    "tapioca",
    "sugar",
    "cocoa",
    "cardamom",
    "cinnamon",
    "psyllium",
    "work",
    "baking",
    "salt",
    "soda",
    "unsweet",
    "applesauce",
    "oil",
    "vanilla",
    "hot",
    "water",
    "frosting",
    "cacao",
    "nibs",
    "semisweet",
    "chocolate",
    "chips",
    "fat",
    "milk"
  ],
  "directions": [
    "0",
    "Preheat oven to 325F. Grease 2 donut pans with coconut oil. Set aside.",
    "In a large bowl, combine sorghum, white rice, coconut, and tapioca flours with the coconut sugar, cocoa powder, cardamom, cinnamon, psyllium, baking powder, sea salt, and baking soda.",
    "Stir to combine evenly.",
    "Add applesauce, coconut oil, vanilla extract, and hot water to the dry ingredients and stir to evenly combine everything.",
    "Let sit 10 minutes to give the psyllium time to saturate.",
    "Using a tablespoon, scoop out two tablespoons of the donut batter into each of your donut forms -- spreading the batter out evenly in the molds with a spoon or your finger.",
    "Bake on the center rack for 18 minutes, rotating the pans half-way through.",
    "Remove from the oven and let cool 5 minutes.",
    "Loosen the donuts by running a sharp knife around the outside edges and the center hole, then pop them out using your knife (or flip your pan upside down).",
    "Let cool to room temperature. Set out your chocolate frosting and place the cacao nibs out on a plate or in a wide mouth bowl.",
    "To frost, dip each donut once or twice in the chocolate ganache frosting. Then roll the frosted side in nibs.",
    "1",
    "While the donuts are baking, make the frosting. Place the chocolate chips in a wide mouth bowl. Set aside.",
    "Pour the coconut milk (preferably mostly thick coconut cream) into a small pot or milk warmer. Heat to a simmer.",
    "Pour the hot coconut milk over your chocolate chips and stir to get all of the chocolate chips in contact with the milk. Let sit 2 minutes.",
    "Stir the melted chocolate chips into the coconut milk until you have a glossy, even ganache."
  ],
  "ingredients": [
    "0",
    "½ cup sorghum flour",
    "¼ cup white rice flour",
    "⅓ cup coconut flour",
    "¾ cups tapioca flour",
    "1 cups coconut sugar",
    "4 tablespoons cocoa powder",
    "¼ teaspoon ground cardamom",
    "½ teaspoon ground cinnamon",
    "1 teaspoons psyllium (whole & powdered both work)",
    "1 teaspoon baking powder",
    "¼ teaspoon sea salt",
    "⅛ teaspoon baking soda",
    "½ cup unsweet applesauce",
    "½ cup coconut oil",
    "½ tablespoon vanilla extract",
    "¾ cup hot water",
    "frosting",
    "1 cup cacao nibs",
    "1",
    "1 cup semi-sweet chocolate chips",
    "½ cup full fat coconut milk"
  ],
  "__v": 1
}