{
  "hash": "5549ad4e7203066d63ca0d9dce4f8b2c175add4c",
  "title": "Easy Homemade Glazed Doughnut Holes",
  "image": "https://www.justataste.com/wp-content/uploads/2014/03/homemade-glazed-doughnut-holes.jpg",
  "href": "https://www.justataste.com/easy-homemade-glazed-doughnut-holes-recipe/",
  "extension": "Chrome",
  "firstAdded": "2018-01-23T02:57:15.373000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "MAKE THE GLAZE:",
    "Sift the confectioners' sugar into a medium bowl. Slowly stir in 3 tablespoons of milk and the vanilla extract until the mixture is smooth. If the glaze isn't thin enough, stir in 1 additional tablespoon of milk. Cover the glaze with plastic wrap and set it aside while you make the doughnut holes.",
    "MAKE THE DOUGHNUT HOLES:",
    "Add the vegetable oil to a large, heavy-bottomed pot. (There should be at least 2 inches of oil in the pot and at least 2 inches between the top of the oil and the top of the pot.) Attach the deep-fry thermometer to the pot and begin heating the oil over medium heat to 350ºF. Line a baking sheet with paper towels.",
    "In a small bowl, whisk together the milk and the egg.",
    "In a separate medium bowl, whisk together the flour, sugar, baking powder and salt. Stir the milk-egg mixture into the dry ingredients, then stir in the melted butter, mixing until a soft dough forms.",
    "Once the oil has reached 350ºF, use a small ice cream scoop to drop about 1 tablespoon scoops of dough into the oil, careful not to overcrowd the pan. (See Kelly's Notes.) Fry the doughnut holes, flipping them in the oil, for about 2 minutes or until they're golden brown. Using a slotted spoon, transfer the doughnut holes to the paper towel-lined baking sheet.",
    "Allow the doughnut holes to cool slightly. Place a cooling rack atop a baking sheet, then one by one, dip the doughnut holes into the glaze and transfer them to the rack to allow the excess glaze to drip off. Serve immediately.",
    "KELLY'S NOTES:",
    "The dough expands when fried, so 1 tablespoon of batter will yield about a 2-inch doughnut hole. If you prefer smaller doughnut holes, drop about 1 teaspoon of batter into the oil. This recipe yields about 2 dozen of the larger doughnut holes or 4 dozen of the smaller variety.",
    "The roundness of the doughnut holes depends on how clean of a scoop of batter you drop into the hot oil. If you don't have a small ice cream scoop, you can use two small spoons to form the batter into mounds, however your doughnut holes will not be as uniformly round in shape."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "FOR THE GLAZE:",
    "1 1/2 cups confectioners' sugar",
    "3 1/2 tablespoons whole milk",
    "2 teaspoons vanilla extract",
    "FOR THE DOUGHNUT HOLES:",
    "5 cups vegetable oil, for frying",
    "1 cup milk",
    "1 large egg",
    "2 cups all-purpose flour",
    "2 Tablespoons sugar",
    "4 1/2 teaspoons baking powder",
    "1/2 teaspoon salt",
    "1/4 cup (1/2 stick) unsalted butter, melted",
    "EQUIPMENT:",
    "Deep-fry thermometer; Small ice cream scoop"
  ],
  "__v": 1
}