{
  "hash": "0688e70d4c89a730459428b015a8b2d4d3775a62",
  "title": "Basque Apple Tart with Thyme Custard",
  "image": "http://www.bascofinefoods.com/spanish-recipes/wp-content/uploads/2014/09/basque_apple_tart_with_thyme_custard_3-1024x683.jpg",
  "href": "https://www.bascofinefoods.com/spanish-recipes/basque-apple-tart-with-thyme-custard/",
  "extension": "Chrome",
  "firstAdded": "2017-07-20T23:48:32.638000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the custard, heat the milk and cream with the thyme sprigs and lemon peel and simmer gently for 5 minutes. Remove from the heat, cover with cling film and allow to infuse for 10 minutes. In a large bowl, whisk the egg yolks and caster sugar until pale and thick. Return the milk mixture to the heat, bring to the boil, remove from the heat and strain without the thyme or lemon peel into the egg mixture and mix well. Return the mix to the pan and with a wooden spoon stir constantly on a gentle heat without allowing the mixture to boil until a nice custard of single cream consistency is achieved. It takes about 5 minutes. You can test the consistency by dipping the spoon in the custard, lifting it up and running your finger across the flat surface, if the straight line stays, you’ve got it.",
    "For the apple puree, peel the apples and cut into quarters removing the core, chop roughly into small pieces. In a sauté pan, melt the butter and add the chopped apple and sugar, frying it fairly quickly until the apple starts to caramelise and soften up. Add the calvados and flambé with a lighter or the cooking flames and allow the mixture to cook on a low heat until very soft. Set aside and allow to cool down.",
    "For the tart, pre-heat the oven at 180˚C/350˚F/Gas Mark 4.",
    "With the use of a pastry brush, stick the long strip around the puff pastry disc to make an edge to the tart. Place on a baking tray with non-stick paper and prick the base of the tart with a fork. Spread the apple puree across the entire base and on top lay the thin apple slices in a fan shape, one on top of the other, round the whole tart. Sprinkle the tart with brown sugar and a few knobs of butter.",
    "Bake in the oven for 20 minutes, remove from the oven, place carefully on a wire tray and brush with the rest of the melted butter, return to the oven for a further 20 minutes. Remove from the oven. Place the apricot jam into a small pan and cover slightly with water, place on a low heat and melt with a whisk until a uniform glaze is formed. Brush the tart with the apricot glaze until all shiny.",
    "Cut the tart into portions and serve with the thyme custard."
  ],
  "ingredients": [
    "0",
    "1 Rectangular piece of ready-made puff pastry of 35cm width, 12cm depth and 3mm thick",
    "Long strips of puff pastry enough to go round the rectangle, 1cm wide and 3mm thick",
    "2 Russet apples, peeled, cut into quarters, core removed and sliced into thin wedges",
    "25g butter, half melted",
    "1 tbsp brown sugar",
    "1 egg yolk, beaten",
    "3 tbsp apricot jam",
    "1",
    "3 russet apples",
    "50g butter",
    "50g caster sugar",
    "25ml calvados",
    "2",
    "1Ltr fresh whole milk",
    "200ml double cream",
    "Small bunch of fresh wild thyme",
    "1 piece of lemon peel, no white rind on it",
    "250g caster sugar",
    "10 egg yolks"
  ],
  "__v": 1
}