{
  "hash": "07c9b7ff3e47e74f4359d92fc30283e13015a8be",
  "title": "INSANELY DELICIOUS TURTLE COOKIES",
  "image": "",
  "href": "http://www.newsobserver.com/2014/12/09/4387894_winning-holiday-treat-contest.html?rh=1",
  "firstAdded": "2014-12-25T21:39:19.617000",
  "users": [
    null
  ],
  "keywords": [
    "dough",
    "allpurpose",
    "flour",
    "cocoa",
    "salt",
    "butter",
    "softened",
    "sugar",
    "separated",
    "egg",
    "white",
    "milk",
    "vanilla",
    "pecans",
    "caramel",
    "filling",
    "soft",
    "candies",
    "cream",
    "chocolate",
    "drizzle",
    "semisweet",
    "shortening"
  ],
  "directions": [
    "0",
    "COMBINE flour, cocoa, and salt. Set aside.",
    "BEAT butter and sugar with an electric mixer on medium-high speed until light and fluffy, about 2 minutes. Add egg yolk, milk and vanilla; mix until incorporated. Reduce speed to low and add flour mixture until just combined. Wrap dough in plastic wrap and refrigerate until firm, 1 hour.",
    "WHISK egg whites in a bowl until frothy. Place chopped pecans in another bowl. Roll chilled dough into 1-inch balls, dip in egg whites, and then roll in pecans. Place balls about 2 inches apart on a baking sheet. Using a half-teaspoon measuring spoon, make an indentation in the center of each dough ball.",
    "BAKE at 350 degrees until set, about 12 minutes.",
    "MAKE caramel filling: Microwave caramels and cream together in a small bowl, stirring occasionally, until smooth, about 1 to 2 minutes.",
    "ONCE cookies are removed from the oven, gently re-press the indentations. Fill each indentation with about 1/2 teaspoon of the caramel mixture. Cool on the pan for 10 minutes, then transfer to a wire rack to cool completely.",
    "MAKE chocolate drizzle: Place chocolate and shortening in a small zip-top plastic bag. Set bag in a bowl of warm water to soften. Gently knead the chocolate with your fingers until melted and smooth, placing back in the warm water for a minute or two as needed.",
    "SNIP a very small hole in the corner of the plastic bag. Drizzle chocolate over the cooled Turtle Cookies.",
    "Yields: about 15 cookies"
  ],
  "ingredients": [
    "0",
    "For the dough:",
    "1 cup all-purpose flour",
    "1/3 cup cocoa powder",
    "1/4 teaspoon salt",
    "8 tablespoons (1 stick) butter, softened",
    "2/3 cup sugar",
    "1 large egg, separated, plus 1 additional egg white",
    "2 tablespoons milk",
    "1 teaspoon vanilla extract",
    "1 1/4 cups pecans, finely chopped",
    "For the caramel filling:",
    "14 soft caramel candies",
    "3 tablespoons. heavy cream",
    "For the chocolate drizzle (optional):",
    "2 ounces semi-sweet chocolate",
    "1 teaspoon shortening"
  ],
  "__v": 1
}