{
  "hash": "0d29cf2a95c096164f5262fea2cbde342d347599",
  "title": "Mocha Cupcakes with Espresso Buttercream Frosting",
  "image": "http://www.browneyedbaker.com/wp-content/uploads/2010/08/mocha-cupcakes-1-525.jpg",
  "href": "http://www.browneyedbaker.com/mocha-cupcakes-with-espresso-buttercream-frosting/",
  "extension": "Chrome",
  "firstAdded": "2015-10-29T01:08:46.763000",
  "users": [
    null
  ],
  "keywords": [
    "cupcakes",
    "allpurpose",
    "flour",
    "cocoa",
    "baking",
    "soda",
    "salt",
    "milk",
    "strong",
    "brewed",
    "coffee",
    "room",
    "espresso",
    "vanilla",
    "unsalted",
    "butter",
    "granulated",
    "sugar",
    "light",
    "brown",
    "egg",
    "buttercream",
    "frosting"
  ],
  "directions": [
    "0",
    "DIRECTIONS:",
    "1. To make the Cupcakes: Mix the espresso powder into the brewed coffee until dissolved; set aside to cool to room temperature.",
    "2. Preheat the oven to 350 degrees F. Line a standard-size muffin tin with paper liners.",
    "3. Whisk together the flour, cocoa powder, baking powder, baking soda and salt.",
    "4. Beat the butter and both sugars together on medium-high speed until light and fluffy, about 2-3 minutes. Add the egg and beat until combined. In a measuring cup, combine the milk, brewed coffee mixture and vanilla. Slowly add the flour mixture, alternating with the coffee mixture, ending with the flour mixture.",
    "5. Divide the batter evenly between the 12 liners. Baking for 17-20 minutes or until a toothpick inserted in the center of a cupcake comes out clean. Cool completely before frosting cupcakes.",
    "6. To make the Frosting: Mix the espresso powder into the vanilla until dissolved; set aside.",
    "7. Using the whisk attachment of a stand mixer, whip the butter on medium-high speed for 5 minutes, stopping once to scrape the sides of the bowl. Reduce the mixer speed to low and add the powdered sugar a little at a time, waiting until it is mostly incorporated before adding more. Once all of the powdered sugar has been added, scrape the sides of the bowl and increase the speed to medium-high and whip until fluffy, about a minute or two. Add the espresso and vanilla mixture and continue to mix at medium-high until it is completely incorporated, scraping the sides as necessary.",
    "Note: To make the swirls on the cupcakes, I used a 1M decorating tip."
  ],
  "ingredients": [
    "0",
    "For the Cupcakes:",
    "1⅓ cups all-purpose flour",
    "⅓ cup unsweetened cocoa powder",
    "1 teaspoon baking powder",
    "½ teaspoon baking soda",
    "¼ teaspoon salt",
    "½ cup whole milk",
    "½ cup strong brewed coffee, at room temperature",
    "1½ teaspoons espresso powder",
    "1 teaspoon vanilla extract",
    "½ cup (1 stick) unsalted butter, at room temperature",
    "½ cup granulated sugar",
    "½ cup light brown sugar",
    "1 egg, at room temperature",
    "For the Espresso Buttercream Frosting:",
    "1 cup (2 sticks) unsalted butter, at room temperature",
    "2½ cups powdered sugar",
    "1½ teaspoons vanilla extract",
    "1½ teaspoons espresso powder"
  ],
  "__v": 1
}