{
  "hash": "a22c8218c54afe66d0385e4cf5f078815d391142",
  "title": "Kathy Brennan & Caroline Campion's Skillet Lasagna",
  "image": "https://images.food52.com/yUr636sIVJIVLD7y1zgK3qPW2sE=/753x502/6f9bcdae-5ab9-454e-9469-414f6818dc28--2016-1011_genius-one-pan-skillet-lasagna_james-ransom-566.jpg",
  "href": "https://food52.com/recipes/64482-kathy-brennan-caroline-campion-s-skillet-lasagna",
  "extension": "Chrome",
  "firstAdded": "2016-12-16T17:17:50.297000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large high-sided sauté pan with a 3-quart capacity and a lid, heat the oil over high heat until it shimmers. Add the sausages and cook, stirring often and breaking up the meat, until browned, about 4 minutes. Leaving as much oil in the pan as possible, transfer the sausage to a medium bowl and set aside.",
    "Reduce the heat to medium-low, add the onions, garlic and pepper flakes to the pan, and cook, stirring occasionally, until the onions are softened, about 7 minutes. Add the oregano, the tomatoes and their juices, crushing the tomatoes with your hands or a potato masher, the sprig of basil, and the cooked sausage and any juices. Season with salt and pepper, then gently simmer for 5 minutes, stirring occasionally. Check the seasonings (it should be a little salty) and discard the basil sprig. Editor's note: Canned tomatoes can vary—if it’s really soupy (and you’re not into that) you can let the liquid boil off a little more, if it’s looking dry, add a little water.",
    "Break half of the lasagna noodles in half crosswise (it’s fine if smaller pieces break off) and as you do so, push each piece into the sauce under the sausage, distributing them evenly throughout the pan (it can help to do this off the heat, and to use an extra noodle to nudge them under—try to leave a little cushion of sauce beneath them, so they don't stick to the bottom and burn). Break the remaining half of the noodles in half and distribute them evenly over the sauce, then push down on them with the back of a spoon to submerge them. Cover the pan and gently simmer (raising the heat a little, if needed) until the noodles are tender and the sauce has thickened slightly, about 12 minutes.",
    "Dollop the mascarpone over the lasagna and swirl it into the sauce. Top with the mozzarella and gently simmer, covered, until the cheese is melted, about 2 minutes. Off the heat, top with the basil leaves, tearing any large ones. Let the lasagna rest, uncovered, for about 10 minutes, then serve."
  ],
  "ingredients": [
    "0",
    "2 tablespoons olive oil",
    "1 pound sweet or hot Italian sausages, casings removed",
    "1 small yellow onion, finely chopped",
    "4 garlic cloves, minced",
    "Large pinch of hot red pepper flakes",
    "1 teaspoon dried oregano",
    "Two 28-ounce cans whole, peeled tomatoes",
    "1 sprig basil, plus a handful of basil leaves",
    "Salt and pepper",
    "One 9-ounce package no-boil lasagna noodles (they aren't all 9-ounce, so be sure to check!)",
    "4 ounces mascarpone cheese or cream cheese (1/2 cup)",
    "1/2 pound fresh mozzarella, thinly sliced and patted dry"
  ],
  "__v": 1
}