{
  "hash": "8b2c92d7e4eb661c898b9506c94e30a87a4e5b04",
  "title": "LOW CARB PALEO TORTILLAS",
  "image": "https://www.wholesomeyum.com/wp-content/uploads/2016/02/www.wholesomeyum.com-coconut-tortillas-img-7546-hero-150x150.jpg",
  "href": "https://www.wholesomeyum.com/recipes/coconut-tortillas/",
  "extension": "Chrome",
  "firstAdded": "2020-02-26T18:50:04.870000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large bowl, whisk all ingredients together until smooth. Let the batter sit for a minute or two to account for the natural thickening caused by coconut flour. The batter should be very runny right before cooking - it should pour easily (add more almond milk and eggs in *equal* proportions if needed to achieve this).",
    "If you are using the optional gelatin, add it last. Sprinkle it over the top of the batter (instead of dumping) and whisk as you do to avoid clumping. Then, add an extra 1/4 cup almond milk.",
    "Heat a small skillet (about 8 in (20 cm) diameter) over medium to medium-high heat and grease lightly (use oil of choice or an oil mister). Pour 1/4 cup (60 mL) of batter onto the skillet and immediately, rapidly tilt in different directions to evenly distribute, like making crepes. Cook, covered with a lid, until the edges are golden and you see bubbles forming in the middle. The edges will curl inward when you lift the lid (about 1-2 minutes). Flip over, cover again, and cook until browned on the other side (1-2 more minutes). Repeat until the batter is used up."
  ],
  "ingredients": [
    "0",
    "1/2 cup Coconut flour",
    "6 large Eggs (up to 7-8, see notes)",
    "1 1/4 cup Unsweetened almond milk (up to 1 1/2 cup, see notes; can also use any milk of choice - use coconut milk beverage for nut-free)",
    "3/4 tsp Sea salt (optional)",
    "1 tbsp Unflavored gelatin powder (optional - for more pliable, sturdy tortillas)",
    "1/2 tsp Cumin (optional)",
    "1/2 tsp Paprika (optional)"
  ],
  "__v": 1
}