{
  "__v": 1,
  "directions": [
    "0",
    "Cut the cauliflower into bite-size pieces and place in a large casserole. Add 1 tablespoon water; cover and microwave on HIGH about 6-7 minutes, stirring after half the time. Let stand, covered, 5 minutes then drain and return the cauliflower to the casserole. I recommend chilling the cauliflower until it's at least lukewarm before adding the remaining ingredients. Stir in the celery and onions.",
    "In a small bowl, mix all of the remaining ingredients except the eggs; pour over cauliflower and mix well. Peel and cut the eggs into large chunks. Gently stir into the salad so you don't break up the yolks too much. Chill well before serving.",
    "Makes 10 servings, about 4 ounces or 3/4 cup each",
    "Do not freeze",
    "* I use liquid Splenda equal to about 5 teaspoons granular.",
    "Per Serving: 211 Calories; 20g Fat; 4g Protein; 5.5g Carbohydrate; 2g Dietary Fiber; 3.5g Net Carbs",
    "This is a slight adaptation of Dana Carpender's recipe that can be found in her \"500 Low-Carb Recipes\" book page 22I thought that 2 cups of mayonnaise would have been way too much dressing so I cut all of the dressing ingredients in half. There was more than enough dressing using half. I also used less celery, but kept the amount of onion and eggs the same as Dana's recipe called for. Since my cauliflower was probably a little smaller than Dana's, I'm figuring to get about 8 servings rather than 12. This is very good and may be my favorite faux potato salad. Also, Dana's carb counts are much too low. There are actually a little more than double the amount per serving than she states.",
    "UPDATE: I've updated the counts after carefully weighing the salad ingredients and refiguring the number of servings to be closer to 10 instead of justA serving is about 3/4 cup of salad or about 4 ounces."
  ],
  "firstAdded": "2014-09-20T18:40:37.478000",
  "hash": "2ddf8fa7987d4161f2ffebe6f62f3f9597ac9d3f",
  "href": "http://www.genaw.com/lowcarb/unpotato_salad.html",
  "image": "http://www.genaw.com/lowcarb/food_photos/unpotato_salad.jpg",
  "ingredients": [
    "0",
    "Small-medium fresh cauliflower (about 21 ounces trimmed)",
    "1 cup celery, chopped (about 2 large stalks or 5 1/4 ounces)",
    "1 cup red onion, chopped (about 4 ounces or one small-medium onion)",
    "1 cup mayonnaise",
    "2 tablespoons cider vinegar",
    "1 teaspoon salt",
    "1 teaspoon granular Splenda, or to taste *",
    "1/4 teaspoon pepper",
    "4 hard boiled eggs"
  ],
  "keywords": [
    "smallmedium",
    "cauliflower",
    "trimmed",
    "celery",
    "stalks",
    "red",
    "onion",
    "mayonnaise",
    "cider",
    "vinegar",
    "salt",
    "granular",
    "splenda",
    "pepper",
    "hard",
    "boiled",
    "eggs"
  ],
  "title": "DANA'S UNPOTATO SALAD",
  "users": [
    null
  ]
}