{
  "hash": "303c540f24ca502a9bf5e9b8443149400009b63b",
  "title": "Tacos de Canasta",
  "image": "https://patijinich.com/wp-content/uploads/2015/04/012716_PattiJ_S4_TacosDeCanasta_380_Cropped-912x622.jpg",
  "href": "https://patijinich.com/recipe/basket-tacos-fresh-cheese-basket-a-k-a-sweaty-tacos/",
  "extension": "Chrome",
  "firstAdded": "2017-10-29T11:42:49.486000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare a basket: Line it with large, thick layers of plastic wrap to cover the entire interior of the basket (they should be big enough that they cover the interior of the basket and fold over the top). Place a couple kitchen towels in the bottom of the basket on top of the plastic. Lastly, add butchers’ style paper or parchment paper on top of the kitchen towels and on the side of the basket.",
    "In a large skillet over medium heat, heat enough oil to come 1/2-inch up the sides of the pan. Once hot, add the onion slice and garlic cloves, let them brown for at least 10 minutes.",
    "Pass the corn tortillas, one by one with a set of tongs, “through hot oil.” That is, quickly fry for 3 seconds per side, and set on a cooling rack or plate covered with paper towels, until all are done.",
    "In another skillet, set over medium heat, pour 3 tablespoons of the onion and garlic seasoned oil. Once hot, add the scallions or cebollitas and chile, and cook for about 3 to 4 minutes until softened. Add the tomatoes and salt, and cook stirring occasionally, for about 8 to 10 minutes until completely cooked and mushy. Stir in cilantro or epazote, cook for a couple more minutes and remove from heat. In a mixing bowl, combine the requesón, along with the tomato mixture and season with more salt to taste, if needed.",
    "Pre-heat a comal or skillet over medium heat.",
    "One by one, add a couple tablespoons of the cheese and tomato mix into a fried tortilla and fold into a half-moon shape. Repeat with the rest of the tortillas. (You may eat them at this point, but they won’t be “basket” or “sweaty” tacos yet!) Place the filled tortillas on the hot comal or skillet. Heat thoroughly for about a minute per side.",
    "Arrange the heated tacos in layers in the basket as they come off comal. Once you are done, add another layer of paper over the tacos, cover with another kitchen towel, and finally the plastic, which should fold over it all from the interior lining of the basket. Let the tacos rest and sweat (at least 10 minutes) and keep covered until ready to eat.",
    "Serve with your choice of salsa, slices of Mexican avocado or pickled jalapeños."
  ],
  "ingredients": [
    "0",
    "vegetable oilfor frying",
    "1/2-inchslice of white onion",
    "3clovesgarlic",
    "12corn tortillas",
    "1/2cupfinely sliced scallionsor cebollitas de cambray in Mexico",
    "1jalapeno chileseeded and finely chopped, more or less to taste",
    "1poundroma tomatoeschopped",
    "1/2teaspoonkosher or coarse sea saltor to taste",
    "1/2cupchopped cilantro or epazote",
    "1pound (about 2 1/2 cups)requesón or farmer’s cheese"
  ],
  "__v": 1
}