{
  "hash": "2378febc078bba7dcd3602a9f8a8bb51721d4184",
  "title": "Chocolate \"Peanut Butter\" Cookie Bars",
  "image": "http://media.paleomg.com/2016/06/IMG_4338-2-150x150.jpg",
  "href": "http://paleomg.com/chocolate-peanut-butter-cookie-bars/",
  "extension": "Chrome",
  "firstAdded": "2017-09-01T23:51:08.148000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 325 degrees F. Grease a rectangle quiche pan (13-3/4\" x 4-1/4\")*. Add all ingredients for the crust into a food processor and pulse until completely combine. The dough should combine into a slight ball once combine. Put dough in a pan and use your fingers to press dough around evenly throughout the pan, pressing the dough higher on the sides. Use a fork to poke about 10-12 holes in to keep the crusting from rising as it bake. Bake crust for 15-18 minutes, until golden brown. Remove then let crust cool for about 30 minutes.",
    "Once crust has cooled, wipe out the inside of the food processor and then place cashew butter, maple sugar, ghee, vanilla extra and salt in the food processor and pulse until completely combine. Use a spatula to remove all the mixture and place in the crust and smooth out. Place in the freezer to harden for 30 minutes.",
    "Lastly, melt chocolate. Pour chocolate on top of slightly hardened \"peanut butter\" mixture, smooth out then sprinkle with salt on top. Place in fridge for 10 minutes to harden chocolate before slicing into bar or triangles or whatever shape you prefer!"
  ],
  "ingredients": [
    "0",
    "1½ cup almond flour",
    "¼ cup + 1 tablespoon coconut flour",
    "¼ cup + 1 tablespoon tapioca flour",
    "½ teaspoon baking soda",
    "4 tablespoons ghee",
    "4 tablespoons maple syrup",
    "1 teaspoon vanilla extract",
    "1",
    "1½ cup cashew butter (or any nut butter you prefer)",
    "¾ cup maple sugar (or coconut sugar, i just prefer the taste of maple sugar)",
    "2 tablespoons ghee",
    "2 teaspoon vanilla extract",
    "pinch of salt",
    "2",
    "1 cup chocolate chips, melted",
    "couple pinches of flaked salt"
  ],
  "__v": 1
}