{
  "hash": "2a9996c5b9b7e83a20623fa7db66c242665b429c",
  "title": "How to Make Pastry Cream",
  "image": "http://recipe-folder.com/img/recipe-images/050/6.5/890172650.jpg",
  "href": "http://www.thekitchn.com/how-to-make-pastry-cream-168126",
  "extension": "Chrome",
  "firstAdded": "2015-03-10T17:11:32.542000",
  "users": [
    null
  ],
  "keywords": [
    "milk",
    "cream",
    "sugar",
    "flour",
    "salt",
    "egg",
    "yolks",
    "vanilla",
    "equipment",
    "saucepan",
    "whisk",
    "strainer"
  ],
  "directions": [
    "0",
    "Instructions",
    "1. Warm the Milk: Warm the milk in the saucepan until you start to see wisps of steam. It should not actually be boiling.",
    "2. Make the Egg-Sugar Base: In a medium bowl, whisk together the sugar, flour, and salt. Add the egg yolks and whisk them into the dry ingredients. This will form a thick paste. It's fine if the paste looks crumbly or smooth; the important thing is that the ingredients are thoroughly combined.",
    "3. Add the Milk to the Egg Mixture: Pour a little of the hot milk into the eggs and whisk to combine. Continue pouring the milk slowly into the eggs, whisking continuously. It's ok to switch back and forth between pouring milk and whisking if you can't manage both at the same time.",
    "When all the milk has been added to the eggs, pour everything back into the saucepan. Set a strainer over a bowl and place this near the stove.",
    "4. Heat the Pastry Cream: Set the pan back over medium heat. Whisk constantly. At first, the pastry cream will look very thin and frothy, but it will start to thicken after a few minutes. When it has thickened to a pudding-like consistency, pause whisking every few seconds to see if the cream has come to a boil. If you see large bubbles popping on the surface, whisk for a few more seconds and then remove the pan from heat.",
    "5. Strain and Cool the Pastry Cream: Stir the vanilla into the pastry cream and then pour the cream into the strainer set over the bowl. Stir to push it through the strainer. This will catch any bits of cooked egg that may be in your pastry cream.",
    "Cover the pastry cream with a piece of plastic wrap pressed right up against the surface of the cream and chill completely.",
    "Additional Notes:",
    "• Pastry cream will keep for several days in the refrigerator. Make sure that it is covered with plastic wrap touching the surface (this prevents the pastry cream from forming a skin).",
    "• For a lighter pastry cream, whip a half cup of heavy cream until it forms soft peaks and fold it into the pastry cream when it no longer piping hot but not yet completely chilled",
    "• You can make a half batch or a double batch of pastry cream. Use the ingredients in this recipe as a ratio."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 1/2 cups whole milk, heavy cream, or a mix",
    "1/2 cup sugar",
    "1/4 cup flour",
    "1/4 teaspoon salt",
    "4 large egg yolks",
    "1 teaspoon vanilla extract",
    "Equipment",
    "Saucepan",
    "Whisk",
    "Strainer"
  ],
  "__v": 1
}