{
  "hash": "32fc3b58d4b0ca97daa24d744ba120b98e78888f",
  "title": "Black Bean Veggie Burgers",
  "image": "https://www.jessicagavin.com/wp-content/uploads/2018/05/vegan-black-bean-burgers-12.jpg",
  "href": "https://www.jessicagavin.com/black-bean-burgers/",
  "extension": "Firefox",
  "firstAdded": "2018-12-29T08:23:20.619000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Line a baking sheet with three layers of paper towels.",
    "Reserve 6 tablespoons of the liquid from the black beans and place in a medium-sized bowl.",
    "Rinse the black beans, shake to remove excess moisture and evenly spread across the paper towels. Allow beans to dry while preparing the other ingredients.",
    "Add flour to the bowl with the bean liquid and whisk until smooth.",
    "Add minced onions, cilantro, garlic, cumin, coriander, chili powder, smoked paprika, salt and pepper, stir to combine. Set aside.",
    "Add chips to a food processor and process on high speed until finely ground, about 30 seconds.",
    "Add the dried black beans to the food processor and pulse until coarsely ground, about 5 pulses.",
    "Add black bean mixture to the bowl with the flour mixture. Stir to combine.",
    "Measure out 1/2 cup of the black bean mixture and form and flatted into 4-inch wide patties. Makes 5 black bean burgers.",
    "Heat a 12-inch nonstick skillet over medium heat. Add in 1 tablespoon of oil.",
    "Once the oil is hot carefully and in 3 patties. Cook patties until browned and lightly crisp, about 5 minutes.",
    "Carefully flip over the patties and add in 1 tablespoon of oil. Cook until the other side is browned and crisp, about 3 to 5 minutes.",
    "Repeat cooking process with the remaining two patties and 2 tablespoons of oil.",
    "Serve patties with burger buns and desired toppings."
  ],
  "ingredients": [
    "0",
    "30 ounces canned black beans, (851g)",
    "2 tablespoons all-purpose flour, (17g, 1/2 ounce)",
    "1/4 cup minced green onions, (32g, 1 ounce)",
    "3 tablespoons minced cilantro",
    "2 teaspoons minced garlic, (4g)",
    "1 teaspoon cumin, (2g)",
    "1/2 teaspoon coriander",
    "1/4 teaspoon chili powder",
    "1/4 teaspoon smoked paprika",
    "1/4 teaspoon kosher salt",
    "1/4 teaspoon black pepper",
    "1 3/4 cups corn tortilla chips, (30g, 1 ounce)",
    "1/4 cup olive oil, (60ml) divided",
    "5 hamburger buns"
  ],
  "__v": 1
}