{
  "hash": "87ac7ff7c94fed5f40739204c4335334f60982ac",
  "title": "Japanese Cheesecake (Regular, Chocolate, Cherry)",
  "image": "https://images.food52.com/9rkSQ3mNr_rWCoYlF9wy3cHTkzE=/753x502/5fd62ef3-ac02-47ad-acb4-328ba4a9d857--2018-0108_japanese-cheesecake_3x2_bobbi-lin_6623.jpg",
  "href": "https://food52.com/recipes/75515-japanese-cheesecake-regular-chocolate-cherry",
  "extension": "Chrome",
  "firstAdded": "2018-03-01T01:32:58.722000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 325° F. Lightly grease a 9-inch springform pan and line the sides and base with parchment paper (don’t grease the paper). Place the springform pan inside a deep casserole dish or other pan (you’ll be baking the cake in a water bath, so put a pot or kettle of water on to boil now and let it stay warm).",
    "Bring a pot of water to a simmer over medium heat. Place the cream cheese, butter, and milk in a medium bowl and place over the pot of simmering water.",
    "Heat, stirring constantly, until the butter and cream cheese are melted and smooth. Remove from the heat and stir in the vanilla extract.",
    "Add the egg yolks and whisk well to combine. Sift the cake flour, cornstarch, and salt over the bowl and gently fold to combine. Stir in the lemon zest and juice.",
    "Place the egg whites and cream of tartar in the bowl of an electric mixer fitted with the whip attachment. Whip on medium speed until it becomes just becomes white, then stream in the sugar gradually and continue to whip on high speed to stiff peaks.",
    "Add about 1/4 of the egg whites to the cream cheese mixture (batter)—it’s ok to mix this in slightly more vigorously because it helps “temper” the base, making it easier to fold the remaining meringue in.",
    "Add the remaining meringue in 2-3 additions, folding gently until just combined.",
    "Gently transfer the batter to the prepared pan and spread gently into an even layer.",
    "Transfer the pan to the oven, and pour the hot water into the casserole dish, ideally coming about 1/2 way up the side of the pan.",
    "Bake the cake for 1 hour to 1 hour and 15 minutes. The cake will be very puffy and the surface lightly golden.",
    "Remove from the oven and remove the cake from the water bath. Let cool completely before unmolding and peeling away the parchment paper.",
    "Garnish with powdered sugar and/or whipped cream to serve.",
    "Chocolate Japanese Cheesecake: Reduce cake flour by 3 tablespoons (21 g) and add 1/3 cup (28 g) unsweetened cocoa powder with the flour. Eliminate the lemon zest and juice. Cherry Japanese Cheesecake: Before you begin, measure 1/2 cup (113 g) cherry juice in a small pot. Bring to a simmer over medium heat and reduce to about 3 tablespoons (about 40g). Let cool to room temperature. Substitute this for the lemon juice and eliminate the zest."
  ],
  "ingredients": [
    "0",
    "8 ounces (227 g) cream cheese",
    "4 tablespoons (57 g) unsalted butter",
    "1/3 cup (76 g) whole milk",
    "6 large eggs, separated (213 g large egg whites and 128 g large egg yolks)",
    "1/2 cup (60 g) cake flour",
    "1/4 cup (28 g) cornstarch",
    "1/2 teaspoon (2 g) fine sea salt",
    "zest and juice of 1 lemon",
    "1/4 teaspoon (1 g) cream of tartar",
    "1 cup (198 g) granulated sugar",
    "powdered sugar and/or whipped cream, for finishing"
  ],
  "__v": 1
}