{
  "__v": 3,
  "directions": [
    "0",
    "Sponge Cake",
    "Directions",
    "1. Preheat oven to 375°F and adjust rack to middle position. Spray a 9-inch cake pan with cooking spray and set aside.",
    "2. Combine flour and cornstarch in a medium bowl, set aside. Combine both oils in a measuring cup, set aside.",
    "3. In the bowl of a stand mixer fitted with whisk attachment, beat eggs, yolks, sugar, salt and vanilla on high speed until thick and pale yellow color, about 4-6 minutes. Remove bowl from stand and quickly fold in flour mixture with the whisk attachment by hand. Gradually drizzle oil into bowl and continue to whisk unit fully combined.",
    "4. Pour batter into prepared pan, set in on a baking sheet and bake cake until toothpick inserted into center of cakes comes out clean, about 22-25 minutes.",
    "5. Remove cake from oven and immediately turn cake out onto a lightly greased wire rack. Cool completely, about 45-60 minutes.",
    "6. Trim sponge cake and place cake in the bottom of an 8-inch cake ring or a 8-inch spring-form pan. Set aside.",
    "Coconut Mousse",
    "Directions",
    "1. In a small bowl, add cold water and sprinkle gelatin over the top, set aside and let stand for 5 minutes.",
    "2. In a medium saucepan, warm coconut milk, 1/2 cup of sugar, rum and salt until sugar dissolved. Add gelatin and stir to dissolve. Remove from heat, pour mixture into a large bowl and let cool to room temperature, about 15-20 minutes.",
    "3. In the bowl of a stand mixer fitted with a whisk attachment, beat heavy cream to soft peaks on medium speed. Add remaining 1 tablespoon of sugar gradually and beat to medium peaks. Stir 1/4 of the whipped cream into the cooled coconut mixture, then fold in the remaining whipped cream until well combined. Pour coconut mixture into prepared cake base, all the way to the top. (you may have extra coconut mixture) Smooth top with metal spatula, cover with plastic wrap and refrigerate for at least 3 hours. (Freeze for 2 hours if you are in a hurry).",
    "Assembly",
    "Directions",
    "1. Mix both shredded coconut in a small bowl. Remove cake from refrigerator, peel off plastic wrap and sprinkle top with shredded coconut; press lightly to adhere. Decorate center with coconut flakes, if use.",
    "3. Place cake, still in ring mold, on cake stand or serving platter. Wrap warm towel around ring and let stand for a minute. Slide ring up and off the mousse cake. Serve immediately.",
    "Note: if make ahead, do step 2 & 3 when you are ready to serve."
  ],
  "firstAdded": "2014-07-09T00:55:01.454000",
  "hash": "a2fe7814fcf9a13cbcfc3be5bd3a6951ff7c1021",
  "href": "http://www.huffingtonpost.com/ken-leung/sense-of-taste-coconut-mousse-cake_b_4647383.html",
  "image": "http://images.huffingtonpost.com/2014-01-22-cake_coconut_mousse_quad-thumb.jpg",
  "ingredients": [
    "0",
    "Sponge Cake",
    "Ingredients",
    "1/2 cup (2 ounces) cake flour",
    "6 tablespoons (1-1/2 ounce) cornstarch",
    "1/4 cup canola oil",
    "3/4 cup coconut oil, in liquid form",
    "3 large eggs, room temperature",
    "3 large egg yolks, room temperature",
    "1/2 cup (3-1/2 ounces) granulated sugar",
    "1/2 teaspoon fine sea salt",
    "2 teaspoons pure vanilla extract",
    "Coconut Mousse",
    "Ingredients",
    "1/4 cup cold water",
    "1-1/2 teaspoons unflavored powdered gelatin",
    "2 cups unsweetened canned coconut milk",
    "1/2 cup (3-1/2 ounces), plus 1 tablespoon granulated sugar, divided",
    "2 teaspoons coconut rum",
    "Pinch of fine sea salt",
    "2 cups heavy cream",
    "Assembly",
    "Ingredients",
    "Coconut Mousse cake",
    "1/2 cup shredded unsweetened coconut",
    "1/2 cup shredded sweetened coconut",
    "1/4 cup large coconut flakes (optional)"
  ],
  "keywords": [
    "sponge",
    "cake",
    "flour",
    "cornstarch",
    "canola",
    "oil",
    "coconut",
    "form",
    "eggs",
    "room",
    "egg",
    "yolks",
    "granulated",
    "sugar",
    "salt",
    "vanilla",
    "mousse",
    "cold",
    "water",
    "unflavored",
    "gelatin",
    "canned",
    "milk",
    "divided",
    "rum",
    "cream",
    "assembly",
    "sweetened"
  ],
  "title": "Coconut Mousse Cake",
  "users": [
    null
  ]
}