{
  "hash": "29b93913b56fdef44653a0654d28a6dd66aadc49",
  "title": "ASIAN CAULIFLOWER FRIED RICE",
  "image": "http://68.media.tumblr.com/tumblr_m1mvvp3K5h1qdei8m.jpg",
  "href": "http://nomnompaleo.com/post/3195098303/asian-cauliflower-fried-rice",
  "extension": "Chrome",
  "firstAdded": "2017-01-14T17:43:32.048000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "First, I pulsed the cauliflower in a food processor until the pieces were the size of rice and chopped the rest of the ingredients.",
    "I tossed the diced bacon into a large cast iron skillet over medium heat and fried until the bits were crispy.",
    "While the bacon was cooking, I whisked the two eggs in a small bowl with some salt and pepper to taste. When the bacon was done, I removed the crunchy swine to a separate plate.",
    "I poured the whisked eggs into the hot bacon grease and fried a thin egg omelet. I took the egg out of the pan, sliced it thinly, and set it aside.",
    "I always keep a large knob of ginger on hand in my freezer. It keeps really well. When I need to use it, I take it out of the freezer, peel off the skin with my vegetable peeler, and microplane it. It’s almost like making ginger-flavored shaved ice.",
    "The microplane is the best tool for grating ginger – no stringiness and the ginger blends in really well into your dish. (The microplane is one of my all-time favorite kitchen tools. If you don’t have one, stop reading this post and get one immediately.)",
    "I cranked up the heat for my cast iron skillet to medium-high heat and added the chopped onions (along with a dash of salt and pepper). Once the onion softened, I tossed in the sliced mushrooms (along with yet another sprinkle of S&P) and stir-fried everything until the mushrooms were browned.",
    "After adding the ginger and stirring it around for 30 seconds, I threw in the cauliflower and even more salt and pepper.",
    "I put a lid on the skillet and lowered the heat to low and cooked it covered for about 5 minutes. When the cauliflower was tender (but not too mushy), I added the coconut aminos, the herbs, and the sliced egg omelet. You can also add a little coconut vinegar to add a tiny bit of tang to the dish. And splash on some fish sauce for good measure!",
    "Before serving, I tossed on the reserved crispy bacon bits. Voila!",
    "This dish was velly tasty. (That’s terrible of me to type. I really shouldn’t make fun of my mom’s accent like that. AND you can only laugh at that line if you’re Asian…)"
  ],
  "ingredients": [
    "0",
    "1 small head of cauliflower, separated in florets",
    "3 slices of uncured bacon, cut into small dice",
    "2 large eggs",
    "1-inch knob of ginger, grated with a microplane",
    "1 small onion, minced",
    "4 ounces of sliced mushrooms",
    "2 scallions, thinly sliced",
    "2 tablespoons of chopped cilantro leaves",
    "2 tablespoons of chopped basil",
    "1 tablespoon of chopped mint",
    "1-2 tablespoons of coconut aminos",
    "Kosher salt",
    "Freshly ground black pepper",
    "Splash of coconut vinegar (optional)",
    "Splash of Red Boat Fish Sauce (not optional)"
  ],
  "__v": 2
}