{
  "hash": "1e5d71779d8c354b958cd892005c9e2a8cf46d4b",
  "title": "Super Soft Steam Bun",
  "image": "http://recipe-folder.com/img/recipe-images/097/055/1465363897.jpeg",
  "href": "http://lilysbest.blogspot.com/2010/12/super-soft-pau.html",
  "firstAdded": "2015-02-19T05:47:50.649000",
  "users": [
    null
  ],
  "keywords": [
    "tangzhong",
    "starter",
    "pau",
    "flour",
    "water",
    "waterdo",
    "leave",
    "adjustment",
    "use",
    "sugar",
    "shortening",
    "double",
    "action",
    "baking",
    "gms",
    "instant",
    "yeast"
  ],
  "directions": [
    "0",
    "Method:",
    "For the Tangzhong Starter:",
    "Measure 125 ml tap water in a glass measuring pyrex jug and whisk in 2 1/2 tbsp pau flour until there is no lumps.",
    "Microwave on high for 30 seconds ( 20 seconds - if you are having a higher wattage microwave). Stir well and continue to microwave on high for another 30 seconds - stirring after every 10 seconds to get the roux to a temperature of about 65 c/150f.",
    "For pau:",
    "Put all the ingredients into the breadmachine bowl starting with the list above accordingly, starting with the starter and ending with the yeast on top of the flour.",
    "Choose the dough function on the bread machine and press start.",
    "In the initial stage of kneading, check if the dough is binding, add the remaining 2 tbsps of water or add more if necessary. Do not add too much as if the dough is too soft, the pau will not have a nice shape.",
    "Prepare the filling while the breadmachine is having all the fun.",
    "When the fun is over in about 1 1/2 hour, the breadmachine will beep and you can start shaping the paus.",
    "Cut into equal portions and roll all the portions into a very thin circle before wrapping in filling.",
    "Wrap the first circle and so forth.",
    "Let it rise for 20 minutes.",
    "Heat up the steamer and when water is rolling hot, steam small buns for 7 - 8 minutes and big ones for 12 - 15 minutes."
  ],
  "ingredients": [
    "0",
    "For the Tangzhong starter:",
    "2 1/2 tbsp/25 g pau flour",
    "125 ml water",
    "For the pau",
    "All the Tangzhong starter",
    "240 ml water(do not use all, leave 2 tbsp for adjustment - you might have to use more than this amount)",
    "5 tbsp sugar",
    "2 tbsp shortening",
    "1 ¼ tsp double action baking powder",
    "3 1/2 cups/480 - 500 gms pau flour",
    "1 ½ tsp instant yeast."
  ],
  "__v": 2
}