{
  "hash": "dc389ea98d0f956f8a4f998faea75da4dcab50a0",
  "title": "Creamy Shrimp and Mushroom Pasta",
  "image": "https://farm6.staticflickr.com/5603/15532232542_4fc37cf8af_c.jpg",
  "href": "http://juliasalbum.com/2014/10/creamy-shrimp-and-mushroom-pasta/",
  "firstAdded": "2015-02-20T00:59:26.494000",
  "users": [
    null,
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "shrimp",
    "shells",
    "garlic",
    "basil",
    "red",
    "pepper",
    "paprika",
    "mushrooms",
    "parmesan",
    "cheese",
    "mozzarella",
    "pasta",
    "water",
    "fettuccine",
    "use",
    "tinkyada",
    "gluten",
    "free",
    "brown",
    "rice"
  ],
  "directions": [
    "0",
    "Heat a large skillet until hot - add 2 tablespoons of olive oil and immediately add garlic and shrimp, cook on one side for about 1 minute until pink on one side, on medium-high heat. Flip the shrimp to the other side, sprinkle the top of cooked side of shrimp with dry basil, paprika, and salt, cook for another 1-2 minutes, occasionally stirring, until shrimp is pink on both sides. Remove the shrimp from skillet. If shrimp is a little undercooked - it's OK because you will continue cooking it in the sauce.",
    "To the same skillet add sliced mushrooms. Add more olive oil if necessary. Cook on high heat for about 2 minutes, occasionally stirring, until mushrooms become soft and release juices. Salt midway through cooking.",
    "To the skillet with mushrooms, add cooked shrimp. Immediately add 1 cup half and half and all of the cheese - bring to boil, then reduce to simmer, and cook, constantly stirring, until all cheese melts. Cover with lid and remove from heat.",
    "Cook pasta according to package instructions. Reserve some of pasta water. Drain and rinse pasta with cold water. Add pasta to the skillet with shrimp and mushrooms and cream sauce. Stir well, season with more salt and add more crushed red pepper flakes and basil, if desired.",
    "If the cream sauce is too thick and you want it creamier - add some pasta water in small amounts until you reach desired consistency."
  ],
  "ingredients": [
    "0",
    "2 tablespoons olive oil",
    "1 pound fresh shrimp (10 big shrimp or 20 small shrimp) without shells, deveined",
    "3 garlic cloves",
    "dried basil",
    "crushed red pepper flakes",
    "paprika",
    "8 oz mushrooms, thinly sliced",
    "1 cup half and half",
    "1/2 cup Parmesan cheese, shredded",
    "3/4 cup Mozzarella cheese, shredded",
    "cooked pasta water",
    "8 oz fettuccine pasta (for gluten free version, use Tinkyada gluten free brown rice pasta)"
  ],
  "__v": 2
}