{
  "hash": "c8c7ff4b3b415ada8f6b0aded5b0dc19690e9eb8",
  "title": "Vanilla Latte Cupcakes",
  "image": "http://lemon-sugar.com/wp-content/uploads/2013/03/Vanilla-Latte-Cupcakes-1-3-e1364322578528.jpg",
  "href": "http://lemon-sugar.com/2013/03/vanilla-latte-cupcakes.html/",
  "extension": "Chrome",
  "firstAdded": "2015-10-29T01:16:30.987000",
  "users": [
    null
  ],
  "keywords": [
    "sugar",
    "eggs",
    "allpurpose",
    "flour",
    "milk",
    "oil",
    "baking",
    "vanilla",
    "seeds",
    "bean",
    "added",
    "brewed",
    "black",
    "coffee",
    "gelatin",
    "water",
    "whipping",
    "cream",
    "confectioners",
    "unsalted",
    "butter",
    "pieces",
    "salt"
  ],
  "directions": [
    "0",
    "Preheat oven to 325 degrees F. Prepare two cupcake tins with paper liners and set aside.",
    "Beat together eggs and sugar until slightly thickened, about 1 minute.",
    "Add flour, milk, oil, baking powder, vanilla extract and vanilla bean seeds and beat for another minute.",
    "Pour batter into lined cupcake tins, filling each tin ⅔ full.",
    "Bake for 20 minutes, and allow to cool on a wire rack.",
    "1",
    "While the cupcakes are baking, combine sugar and brewed coffee in a small saucepan.",
    "Over medium heat, bring mixture to a low boil, and stir until sugar completely dissolves.",
    "Set aside. to cool slightly.",
    "Once cupcakes have cooled for 10-15 minutes, generously brush each cupcake with the syrup, using a pastry brush. Apply 1 coat for a light coffee flavor, 3 coats for a mild coffee flavor, and 5 coats for a strong coffee flavor.",
    "Prepare whipped cream.",
    "2",
    "In a small bowl, combine water and gelatin, and stir to moisten all of the gelatin.",
    "Allow to sit for 2 minutes, then microwave for 30 seconds to 'melt' the gelatin. Set aside.",
    "Pour cold cream into the clean bowl of a stand mixer fitted with the whisk attachment.",
    "Beat on medium until the cream thickens and soft peaks form.",
    "Add vanilla, gelatin and sugar. Beat until stiff peaks form.",
    "Spoon whipped cream into a piping bag, and frost as desired.",
    "3",
    "Melt the butter in a heavy-bottomed saucepan over medium heat.",
    "Add the sugar and cook, stirring occasionally, until the sugar begins to foam a bit.",
    "It will look and smell like it’s on the verge of burning.",
    "Remove from the heat and add the heavy cream.",
    "Stir until the sauce is smooth, returning to heat if necessary to smooth it out, then mix in the vanilla and salt.",
    "Let cool. This can be stored in the refrigerator for up to 2 weeks.",
    "Garnish cupcakes with caramel sauce and a chocolate covered espresso bean.",
    "Enjoy!"
  ],
  "ingredients": [
    "0",
    "2 cups sugar",
    "4 eggs",
    "2 and ½ cups all-purpose flour",
    "1 cup milk",
    "¾ cup vegetable oil",
    "2 and ¼ teaspoons baking powder",
    "1 teaspoon vanilla",
    "Seeds from 1 vanilla bean, optional (I added this.)",
    "1",
    "½ cup sugar",
    "½ cup brewed, black coffee",
    "2",
    "2 teaspoons powdered gelatin",
    "2 Tablespoons water",
    "2 cups whipping cream",
    "⅔ cup confectioners' sugar",
    "2 teaspoons vanilla",
    "3",
    "1 stick (8 Tablespoons) unsalted butter, cut into pieces",
    "1 cup sugar",
    "1 cup heavy cream",
    "¼ teaspoon vanilla extract",
    "Pinch of salt"
  ],
  "__v": 1
}