{
  "hash": "c4cd4f932ca7faa8009e2f42535342f5915345fd",
  "title": "Slow-Cooker Bolognese Sauce",
  "image": "",
  "href": "https://www.myrecipes.com/recipe/slow-cooker-bolognese-sauce-pappardelle-pasta",
  "extension": "Chrome",
  "firstAdded": "2020-06-11T16:19:55.517000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Step 1",
    "Sauté first 3 ingredients in hot oil in a large skillet over medium-high heat 8 minutes or until tender. Add garlic and tomato paste; cook, stirring constantly, 30 seconds. Transfer to a 6-qt. slow cooker.",
    "Step 2",
    "Add beef to skillet, and cook, stirring often, 7 minutes or until crumbled and no longer pink; drain. Stir in kosher salt and next 5 ingredients. Stir in wine, and cook, stirring occasionally, 7 minutes or until almost all liquid evaporates. Add to slow cooker, and stir to combine.",
    "Step 3",
    "Drain tomatoes, reserving liquid. Using your hands, crush tomatoes, and break them apart. Add to slow cooker, and stir to combine.",
    "Step 4",
    "Cover and cook on LOW 6 hours. Stir in cream. Check sauce; it should be thick and creamy. (If soupy, uncover and cook 30 more minutes. If dry, stir in reserved canned tomato liquid, 1 Tbsp. at a time, to thin sauce.) Discard bay leaf.",
    "Step 5",
    "Cook pasta according to package directions. Drain well. Toss together pasta and 4 cups sauce. (Reserve remaining sauce for another use.) Spoon into serving dishes, and sprinkle with desired amount of cheese. Serve immediately.",
    "Chef's Notes",
    "Refrigerate sauce up to 5 days, or freeze for up to 3 months."
  ],
  "ingredients": [
    "0",
    "1 medium-size yellow onion, finely chopped",
    "2 celery ribs, finely chopped",
    "1 medium carrot, finely chopped",
    "1 tablespoon olive oil",
    "2 garlic cloves, minced",
    "2 tablespoons tomato paste",
    "2 pounds lean ground beef",
    "1 tablespoon kosher salt",
    "2 teaspoons sugar",
    "2 teaspoons dried Italian seasoning",
    "1/2 teaspoon ground black pepper",
    "1/4 teaspoon ground nutmeg",
    "1 bay leaf",
    "1/2 cup red wine",
    "2 (28-oz.) cans whole peeled tomatoes",
    "2/3 cup heavy cream",
    "1 pound pappardelle pasta or wide fettuccine",
    "Freshly shaved or grated Parmigiano-Reggiano cheese"
  ],
  "__v": 1
}