{
  "hash": "b12bc7cc4ec0eb23bb1d147b96c1676aab5f3391",
  "title": "Red lentil & chorizo soup",
  "image": "//www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--1253451_8.jpg?itok=2-EH9fXx",
  "href": "https://www.bbcgoodfood.com/recipes/red-lentil-chorizo-soup",
  "extension": "Chrome",
  "firstAdded": "2020-04-28T19:35:05.288000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the oil in a large pan. Add the chorizo and cook until crisp and it has released its oils. Remove with a slotted spoon into a bowl, leaving the fat in the pan. Fry the onion, carrots and cumin seeds for 10 mins until soft and glistening, then add the garlic and fry for 1 min more. Scatter over the paprika and sugar, cook for 1 min, then splash in the vinegar. Simmer for a moment, then stir in the lentils, and pour over the tomatoes and chicken stock.",
    "Give it a good stir, then simmer for 30 mins or until the lentils are tender. Blitz with a hand blender until smooth-ish but still chunky. Can be made several days ahead or frozen for 6 months at this point. Serve in bowls, drizzled with yogurt and olive oil, scattered with the chorizo and a sprinkling of paprika."
  ],
  "ingredients": [
    "0",
    "1 tbsp olive oil Olive oil ol-iv oylProbably the most widely-used oil in cooking, olive oil is pressed from fresh olives. It's… , plus extra for drizzling",
    "200g cooking chorizo Chorizo chore-reeth-ohA coarsely textured, spiced pork sausage widely used in Spanish and Mexican cooking. It is made… , peeled and diced",
    "1 large onion Onion un-yunOnions are endlessly versatile and an essential ingredient in countless recipes. Native to Asia… , chopped",
    "2 carrots Carrot ka-rotThe carrot, with its distinctive bright orange colour, is one of the most versatile root… , chopped",
    "pinch of cumin seeds",
    "3 garlic cloves, chopped",
    "1 tsp smoked paprika, plus extra for sprinkling",
    "pinch of golden caster sugar",
    "small splash red wine vinegar",
    "250g red lentil",
    "2 x 400g cans chopped tomato",
    "850ml chicken stock",
    "plain yogurt Yogurt yog-ertYogurt is made by adding a number of types of harmless bacteria to milk, causing it to ferment.… , to serve"
  ],
  "__v": 1
}