{
  "__v": 1,
  "directions": [
    "0",
    "Make the pulled chicken and pesto: Debone the chicken legs, and remove the skin from the meat. Scrape off any fat-lumps attached to the under-side of the skin, but carefully without breaking it. Set the skins over a baking rack to dry off slightly. Then heat up a non-stick skillet over medium-high heat, with 2 tbsp of olive oil. Lightly season the chicken-meat with approx 1/2 tsp of salt and 1/4 tsp of black pepper, and cook in the skillet until nicely browned on both sides and cooked through completely, a few min on each sides. Reserve the oil and liquid in the skillet and set the chicken aside to cool.",
    "To make the pesto, start with ingredients that are the hardest to break down. In a mortar (or you can use food-processor if it’s powerful enough to grind sesame seeds), first finely grind the sesame seeds. Then add/finely grind the leafy part of kafir lime leaves (with the tough center-rib removed). Then add ginger, garlic and shallots and pound into a paste. Add the fresh mint, fresh basil, green scallion and red chili, again grind into a fine paste. Finally, add fish sauce, shredded coconut, lime zest and ground white pepper, plus 2 tbsp of the oil used to cook the chicken. Mix evenly into a pesto. Set aside.",
    "Shred the cooked chicken with your hands. The shredding creates textures and strings in the meats that hold onto any sauce/pesto much better than pieces that are cut with a knife. Reserve 1 tbsp of liquid from the pesto for the chicken skin, then mix all of the rest with shredded chicken. Let the chicken/pesto sit for 1 hour to deepen the flavour. At the last minute before serving, mix in 1 tbsp of lime juice.",
    "Make the chicken skin crackling: Preheat the oven on 410ºF/210ºC.",
    "Lay a large piece of parchment paper on a large baking-sheet. Dab the chicken skin on both sides with paper towel to remove excess moisture, and season both sides with salt and black pepper. Lay the chicken skin flat on the parchment paper without any foldings or overlapping. Brush the reserved pesto liquid over the skin, then lay another piece of parchment paper on top of the skin, press down with your hands, then put another large baking-sheet on top (the baking-sheet on top has to cover the entire surface-area of the chicken skin). It’s VERY IMPORTANT to sandwich the skin with parchment papers so that it doesn’t stick to the baking-sheets.",
    "Bake in the oven for 15 min first. Take the baking-sheets out of the oven and remove the top sheet. Peel the top-parchment paper from the side to allow the steam/moisture inside to escape. Reposition the chicken skins if you see uneven brownings, then press them down again with parchment paper and the top baking-sheet. Return to the oven and bake for another 8 ~ 10 min. It should take a total of approximately 25 min for the chicken skins to become perfectly crispy. Once they do, remove them from the baking-sheet and place on top of a cooling rack to dry off slightly for 5 min.",
    "Serve the pulled chickens in pesto with steamed white rice and a large piece of skin crackling on top, plus a wedge of lime to squeeze"
  ],
  "firstAdded": "2014-06-19T14:17:29.868000",
  "hash": "a5320a79c5ff950d48505c50389b98ee6cdeee24",
  "href": "http://www.ladyandpups.com/2013/07/14/ugly-crackling-chicken-rice-eng/",
  "image": "http://www.ladyandpups.com/wp-content/uploads/2013/07/herb-chicken-rice-featured-header.jpg",
  "ingredients": [
    "0",
    "2 whole chicken legs with skin (drumsticks plus thighs)",
    "1/2 tsp of salt",
    "1/4 tsp of freshly ground black pepper",
    "2 tbsp of extra virgin olive oil",
    "Asian pesto:",
    "1 tsp of toasted sesame seeds",
    "5 kafir lime leaves, with the tough center-ribs removed",
    "3 tbsp of ginger",
    "3 cloves of garlic",
    "2 shallots",
    "2 heaping tbsp of fresh mint",
    "2 heaping tbsp of fresh basil",
    "2 heaping tbsp of green scallion",
    "1 Thai red chili",
    "2 1/2 tbsp of fish sauce",
    "2 tbsp of unsweetened finely shredded coconut",
    "1/4 tsp of lime zest",
    "1/2 tsp of ground white pepper",
    "1 tbsp of lime juice",
    "1 tsp of toasted sesame seeds",
    "5 kafir lime leaves, with the tough center-ribs removed",
    "3 tbsp of ginger",
    "3 cloves of garlic",
    "2 shallots",
    "2 heaping tbsp of fresh mint",
    "2 heaping tbsp of fresh basil",
    "2 heaping tbsp of green scallion",
    "1 Thai red chili",
    "2 1/2 tbsp of fish sauce",
    "2 tbsp of unsweetened finely shredded coconut",
    "1/4 tsp of lime zest",
    "1/2 tsp of ground white pepper",
    "1 tbsp of lime juice",
    "Steamed rice and extra lime to serve"
  ],
  "keywords": [
    "chicken",
    "legs",
    "skin",
    "drumsticks",
    "thighs",
    "salt",
    "black",
    "pepper",
    "extra",
    "virgin",
    "olive",
    "oil",
    "asian",
    "pesto",
    "sesame",
    "seeds",
    "kafir",
    "lime",
    "leaves",
    "tough",
    "centerribs",
    "ginger",
    "garlic",
    "shallots",
    "heaping",
    "mint",
    "basil",
    "green",
    "scallion",
    "thai",
    "red",
    "chili",
    "fish",
    "coconut",
    "zest",
    "white",
    "juice",
    "steamed",
    "rice",
    "serve"
  ],
  "title": "Pulled chicken in Asian pesto w/ skin crackling",
  "users": [
    null
  ]
}