{
  "hash": "87e365818a72ace5a6088ae30f256dcf46c34f58",
  "title": "Chipotle Salmon Burger",
  "image": "http://www.epicurious.com/images/recipesmenus/bookcovers/clean-green-eats_116.jpg",
  "href": "http://www.epicurious.com/recipes/food/views/chipotle-salmon-burger-56389785?mbid=nl_07232015_Daily_CTN%20(1)&CNDID=&spMailingID=7927468&spUserID=OTg2ODcyNTM1ODIS1&spJobID=723028891&spReportId=NzIzMDI4ODkxS0",
  "extension": "Chrome",
  "firstAdded": "2016-09-06T01:26:51.727000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium bowl, whisk together the mayonnaise, lime juice, and soy sauce. Add the bell pepper, onion, and chopped chipotle peppers, and stir until well combined. Fold in the panko, flaxseed, and beaten egg. Gently fold in the salmon.",
    "Divide the mixture into six equal parts and, using clean hands, shape each into a ball. Pat each ball into 2 1/2-inch-wide and 3/4-inch-thick burger patties. Place the patties into an airtight container and cover.",
    "Heat a medium grill pan or cast- iron skillet over medium- high heat. Add the olive oil, reduce the heat to medium, and cook the patties, in batches, until golden brown, 2 to 3 minutes. Gently turn them over and brown the opposite sides for an additional 2 to 3 minutes. Transfer the cooked patties to a paper towel-lined plate while you prepare the sauce.",
    "In a small bowl, whisk together the yogurt, chives, and Worcestershire sauce.",
    "To serve, place each burger on a toasted bun, smear on a dollop of the sauce, and layer on the kale and thinly sliced red onion.",
    "1",
    "Instead of making burgers, you can shape the salmon mixture into mini-salmon cakes for bite- size party appetizers. Top with a little dollop of creamy chive sauce and watch your guests devour these bites!"
  ],
  "ingredients": [
    "0",
    "2 tablespoons olive oil mayonnaise",
    "2 tablespoons fresh lime juice",
    "3 tablespoons reduced- sodium tamari soy sauce",
    "1/2 red bell pepper, seeded, ribs removed, and finely chopped",
    "1/2 small red onion, finely chopped",
    "2 tablespoons chipotle peppers in adobo sauce, finely chopped (omit for kids)",
    "1/2 cup panko bread crumbs",
    "1/2 cup flaxseed meal",
    "1 large egg, beaten",
    "Three 5–6-ounce cans high-quality boneless and skinless wild salmon, drained",
    "2 tablespoons extra- virgin olive oil",
    "1",
    "1 package regular or gluten- free mini-slider buns, toasted",
    "12 small kale leaves, tough ribs or stems removed, torn",
    "1/2 red onion, thinly sliced",
    "2",
    "1/2 cup Greek yogurt",
    "1/4 cup fresh chives, finely sliced on the diagonal",
    "1 tablespoon Worcestershire sauce"
  ],
  "__v": 1
}