{
  "hash": "89fea23eb327a149c12500041180450435a96410",
  "title": "The 3 Days (so worth it) Beef Bourguignon Recipe",
  "image": "",
  "href": "http://www.frenchtoday.com/blog/beef-bourguignon-recipe",
  "extension": "Chrome",
  "firstAdded": "2016-11-03T00:55:08.469000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Day #1 – The Boeuf Bourguignon Marinade",
    "The key to a great Beef bourguignon (or just ‘bourguignon’ as we most often call it) is to marinate the raw meat before you actually cook with it. The problem is that if you simply cut your meat and pour wine on top of it, the meat actually develops a taste of alcohol which I don’t find nice. Since we’re in this for 3 days, let’s start properly!",
    "In a large pot, pour the 2 bottles of wine and add the carrots cut into large pieces, the medium size onions roughly cut, the bay leafs, the peeled garlic cloves and the bouquet garni. Bring everything to a boil for about 10 minutes. Let it cool down to room temperature and put it in the fridge for 1 or 2 hours until cold.",
    "In the mean time, cut the meat into large chunks (about 5cm cubes) and trim the excess fat. Once the marinade is cool, pour it over the meat into a non reactive dish/pan, cover and put in the fridge overnight (minimum 8 hours).",
    "Note: you might wonder why we are using a whole 2 bottles of wine when most other recipes you’ve seen usually have one bottle. We do this for 2 reasons, 1 is that because we will cook this bourguignon twice, there will be a lot of evaporation and 2, there’s nothing more frustrating than being left with having to ration the sauce when you go in for a second serving. It’s a stew, it should be stewy, not just chunks of meat! (If you must, you can substitute 1 of the bottles for some beef stock, just be careful about the salt if you do).",
    "Note #2: Don’t be (too) cheap on the wine. The golden rule is that if you don’t enjoy drinking the wine, then don’t use it for cooking. I often serve the same wine that was used for the dish while we are eating the dish (sort of like a culinary Inception ;-)",
    "Day #2 – Cooking The Beef Bourguignon",
    "Take the marinade and meat out of the fridge. Take all the meat pieces out and using paper towels, make sure they are as dry as you can. Discard the marinade… NOOOO, just kidding, of course you don’t discard the marinade, at this point it’s red gold! Set it aside preciously on a soft pillow while you take care of the meat.",
    "Leave the meat out for 30 minutes so that it comes back to room temperature and put your oil in a thick skillet. When the oil is really hot, sear the pieces of meat 5 or 6 at a time to make sure you don’t crowd the pan. Try to get as much of a crust onto the meat as possible. Add pepper and salt to the meat only right after you dropped it in the pan (putting salt before, even 5 minutes, will draw moisture out of the meat and you’ll be steaming, not searing). Put aside.",
    "Discard any remaining oil from the pan and put in the ‘lardons’ (bacon) on high heat. Stir so that they get a nice color then take them out of the pan and put them with the meat.",
    "Lower the heat to a medium fire under the pan, strain all the solids from the marinade (keep the bay leaf and bouquet garni aside) and put them into the pan. Cook for 5 or 7 minutes until you start seeing some color, make sure you scrape the bottom of the pan to get all the nice bacon and meat bits that stuck. Sprinkle the flour and mix it in so that it doesn’t lump up. Add salt and pepper.",
    "Put the wine back into the pan and add the meat, bacon, bay leaves, bouquet garni and tomato paste. Cover and let it cook slowly.",
    "In the mean time, peel the Pearl onions (which as small white onions you usually serve whole) and let them roast slowly in a pan with a bit of olive oil. You are looking to get some color but to also cook the onions through (don’t overcook them, since they’ll cook some more in the bourguignon and then need to hold their shape, yet be tender).",
    "In another pan, heat up some oil. Clean the mushrooms and depending on their size, either keep them whole or cut them in half or quarter. Roast them in a hot pan until they get some color. Make sure the pan is not too small, there should be room between the individual pieces of mushrooms so as to not steam them but roast them. Do it in several batches if you prefer.",
    "After about 1 hour of cooking, incorporate the onions and mushrooms with the rest of the bourguignon and check the seasoning and adjust if needed… At this point, add the 3 squares of dark chocolate, trust me with this. It’ll add lots of depth to your sauce and give it a really nice shine.",
    "Cook gently for another 30 minutes and turn the heat off. At this point, go ahead and eat a piece of meat, you know you can’t resist and you deserve it. If you have some crusty bread, you can even dunk one of 2 pieces in the sauce to eat… I won’t say anything :-)",
    "Let it sit a few hours until it’s cool enough to put in the fridge overnight.",
    "Day #3 – The Finishing Touches to Your Beef Bourguignon",
    "What is the thing that people say EVERY time they eat reheated leftover stew? “it’s so much better the next day”. And this is why we delay gratification and wait and extra day to eat the Boeuf bourguignon. This also allows us to skim the fat from the top and make a much leaner bourguignon than you could otherwise make.",
    "Take the dish out of the fridge and using a spoon, remove as much as the fat from the top as you can. Turn your oven to 180C (about 360F).",
    "When the oven is hot, put the Boeuf bourguignon in a covered oven safe serving dish (mine happens to be both stove top and oven safe which is even more practical).",
    "At this point, you could serve the bourguignon once it’s completely reheated but to give it an even extra touch, you might want to serve it with a nice puff pastry crust.",
    "Unroll a sheet of puff pastry. In France we can find some delicious store made puff pastry, there is really no need to make your own unless you think that 3 days for a boeuf bourguignon is not enough work :-) Once it’s unrolled, put it back in the fridge so that it gets really cold.",
    "After about 20 minutes of reheating, drape the puff pastry on top of the bourguignon, make a slight criss cross on top with a knife edge and brush the pastry with a bit of the egg wash. Quickly put back in the oven until the puff pastry is golden color.",
    "It’s finally ready to eat! I like serving it with a side of greens like french green beans and either fettucine pasta or gnoccis with just a bit of butter but you could also serve it the more traditional way with steamed potatoes."
  ],
  "ingredients": [
    "0",
    "2kg (~4 lb) of boneless braising beef meat (cross-rib roast or shin). In France the cut is called: “Paleron“",
    "120g (1/4 lb) of lardons -m (thick bacon cut into rectangles)",
    "2 bottles of Burgundy red wine (like a Cote du Rhone or Pinot Noir) (du vin rouge de Bourgogne -m)",
    "3 carrots (des carottes -f)",
    "2 medium size onions (des oignons -m)",
    "20 or so small white (Pearl) onions (des oignons grelots -m)",
    "300g (2/3 lb) of fresh mushrooms (des champignons -m)",
    "3 bay leafs (des feuilles de laurier -f)",
    "1 large teaspoon of tomato paste (du concentré de tomate -m)",
    "1 bouquet garni (it’s a french word already :-)",
    "3 cloves of garlic (des gousses d’ail -f)",
    "Olive oil (de l’huile d’olive -f)",
    "3 squares of really dark (bitter) chocolate (80% cocoa or more) (du chocolat noir amer -f)",
    "3 tablespoons of flour (de la farine -f)",
    "salt, pepper (du sel et du poivre -m)",
    "Optional:",
    "1 or 2 sheets of puff pastry (de la pâte feuilletée -f)",
    "Egg wash (an egg yolk mixed in with 3-4 tablespoons of room water)"
  ],
  "__v": 2
}