{
  "hash": "0c411841c7dc8e15c3a6958f6dd76a4b88f6edf1",
  "title": "Epic roast chicken salad",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/979_1_1384367108_lrg.jpg",
  "href": "http://www.jamieoliver.com/recipes/chicken-recipes/epic-roast-chicken-salad/",
  "firstAdded": "2014-12-31T14:20:12.996000",
  "users": [
    null
  ],
  "keywords": [
    "roast",
    "chicken",
    "olive",
    "oil",
    "freerange",
    "salt",
    "pepper",
    "bunch",
    "thyme",
    "lemon",
    "mixed",
    "cherry",
    "tomatoes",
    "bulb",
    "garlic",
    "salad",
    "country",
    "loaf",
    "roughly",
    "rashers",
    "quality",
    "smoked",
    "streaky",
    "bacon",
    "green",
    "beans",
    "topped",
    "extra",
    "virgin",
    "wholegrain",
    "mustard",
    "cider",
    "vinegar",
    "flatleaf",
    "curly",
    "parsley",
    "leaves",
    "picked",
    "mint",
    "spring",
    "onions"
  ],
  "directions": [
    "0",
    "I could tell you that this is a wonderful way of using leftover chicken, and it but it's fully worth cooking a whole chicken to perfection to make this beautiful salad.",
    "Preheat your oven to 200°C/400°F/gas 6. Drizzle olive oil all over the chicken and sprinkle it with salt and pepper. Pick and scatter over the thyme leaves (reserving the stalks). Rub the flavours into the skin, then halve the lemon and put it inside the cavity along with the thyme stalks. Pop the chicken into a large roasting tray (roughly 25 x 32cm) and cook in the oven for 1 hour. Meanwhile, halve the cherry tomatoes, then smash up your garlic bulb and discard the papery white skin. After about 30 minutes, throw the tomatoes and garlic into the chicken tray, ideally holding the chicken up with tongs while you slush everything around and coat the tomatoes in the juices underneath. Put the chicken back on top, then return it to the oven for the remaining 30 minutes, or until the chicken is golden and the juices from the thigh run clear when pricked with a knife.",
    "Transfer the roasted chicken to a plate, cover with tin foil and leave to cool. Tear the bread into the roasting tray in thumb-sized croutons, then toss them in all the cooking juices. Spread the croutons out in the tray and lay the rashers of bacon on top. Pop back in the oven for around 15 to 20 minutes, or until everything is crispy, golden and gorgeous.",
    "Meanwhile, remove all the chicken skin and set aside, then use two forks to strip every last bit of meat off the bone. Pile the meat into a large bowl and drizzle over any resting juices from the plate. Cook your green beans in boiling salted water for 5 to 6 minutes, until cooked but not squeaky when you bite them. Quickly drain and add them to the bowl of shredded meat, with 5 to 6 tablespoons of good-quality extra virgin olive oil, the wholegrain mustard and a few good swigs of cider vinegar. Chop up the parsley and mint leaves and finely slice the spring onions. Add them to the bowl. Toss everything together, then have a taste and adjust with more vinegar or seasoning if you like.",
    "Once the croutons are golden, quickly tear the chicken skin into the roasting tray (skip this if you want a healthier salad) and put back into the oven just until it crisps up again. When it's looking lovely, tip everything from the bowl into the tray or on to a large serving platter. Toss everything together and serve in the middle of the table."
  ],
  "ingredients": [
    "0",
    "For the roast chicken",
    "olive oil",
    "1 x 1.2 kg free-range chicken",
    "sea salt",
    "freshly ground pepper",
    "a small bunch of fresh thyme",
    "1 lemon",
    "400 g mixed cherry tomatoes",
    "1 bulb of garlic",
    "For the salad",
    "1 country loaf (roughly 300g)",
    "6 rashers of quality smoked streaky bacon",
    "200 g green beans, topped",
    "extra virgin olive oil",
    "1 tablespoon wholegrain mustard",
    "cider vinegar",
    "a bunch of fresh flat-leaf or curly parsley, leaves picked",
    "a bunch of fresh mint, leaves picked",
    "6 spring onions"
  ],
  "__v": 1
}