{
  "hash": "9ba295aca7fb8bc06ca443a6de137de8e4418bd5",
  "title": "Ash-e Reshteh (Iranian Noodle Soup)",
  "image": "https://www.saveur.com/resizer/RxXbReHYClxE_Payz_JLNmqGHec=/1034x776/filters:focal(1000x750:1001x751)/arc-anglerfish-arc2-prod-bonnier.s3.amazonaws.com/public/XO5FDD6YFGPZ4JW44VREIEZ2OE.jpg",
  "href": "https://www.saveur.com/article/Recipes/Ash-e-Reshteh-1000089833/",
  "extension": "Chrome",
  "firstAdded": "2019-08-18T22:22:06.728000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat 1⁄4 cup oil in an 8-qt. saucepan over medium-high heat. Add onions, and cook until caramelized, about 20 minutes. Transfer half the onions to a bowl; set aside for garnish. Add all beans, turmeric, and salt and pepper to onions in pan; cook, stirring, for 5 minutes. Add 12 cups water; bring to a boil. Reduce heat to medium-low; cook, covered, until beans are barely tender, about 50 minutes. Add spinach, parsley, lentils, and chives; cook for 20 minutes. Add noodles, and cook until noodles and beans are tender, about 12 minutes more.",
    "Meanwhile, heat remaining oil in a 10\" skillet over medium-high heat. Add garlic; cook until lightly browned and crisp, about 3 minutes. Using a slotted spoon, transfer to paper towels to drain. Return skillet to heat and add mint; cook until fragrant, about 1 minute. Ladle soup into bowls; top with reserved caramelized onions and garlic chips, then drizzle with the mint oil and whey."
  ],
  "ingredients": [
    "0",
    "1⁄2 cup canola oil",
    "2 onions, thinly sliced",
    "1⁄2 cup each dried kidney and cannellini beans, chickpeas, soaked overnight, drained",
    "1 1⁄2 tbsp. ground turmeric",
    "Kosher salt and freshly ground black pepper, to taste",
    "6 cups chopped spinach",
    "1 cup chopped parsley",
    "1⁄2 cup brown lentils",
    "1 bunch chives, finely chopped",
    "2 cups reshteh or dried linguini",
    "8 cloves garlic, thinly sliced",
    "2 tbsp. dried mint",
    "1⁄4 cup powdered whey (optional; see recipe, mixed with 4 tbsp. water)"
  ],
  "__v": 1
}