{
  "hash": "0e02c87feed1fa752c76fa163be844f56364bd0a",
  "title": "Chicken Wings Coated, Spicy Hot and so Good",
  "image": "http://img.sndimg.com/food/image/upload/w_555,h_416,c_fit,fl_progressive,q_95/v1/img/recipes/41/23/46/picUcv35x.jpg",
  "href": "http://www.food.com/recipe/chicken-wings-coated-spicy-hot-and-so-good-412346",
  "extension": "Chrome",
  "firstAdded": "2016-02-03T14:07:43.160000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "midjoint",
    "wings",
    "allpurpose",
    "flour",
    "salt",
    "cayenne",
    "pepper",
    "smoked",
    "paprika",
    "panko",
    "breadcrumbs",
    "eggs",
    "milk",
    "homogenized",
    "butter",
    "sriracha",
    "hot",
    "chili",
    "black",
    "granulated",
    "garlic",
    "canola",
    "extra",
    "virgin",
    "olive",
    "oil"
  ],
  "directions": [
    "0",
    "Remove wing tips and any loose skin and discard. Leave the remaining skin on if desired.",
    "Rinse wings in cold water, pat dry with paper towels and set aside.",
    "In a large zip-loc bag, combine flour, salt, cayenne pepper and paprika, shake well.",
    "Add chicken to the zip-loc bag, seal and toss to coat well. Refrigerate for 1 to 4 hours. \"Chilling the chicken wings is important to achieve nice, crispy wings.\".",
    "In a mixing bowl add Panko bread crumbs.",
    "In another bowl, whisk together eggs and milk until frothy.",
    "Remove chicken from the refrigerator and shake off any excess flour coating.",
    "Dip coated chicken in the egg mixture, then roll in the Panko bread crumbs until well coated.",
    "In a heavy bottom 12 inch frying pan or skillet, add oil and heat to 375°F.",
    "Place chicken in the pan with the main meat side up and fry for 6 minutes.",
    "Turn the chicken over and continue to fry for another 6 minutes. The wings should be nicely browned.",
    "Test for doneness by making a cut into the thick portion of the wing to make sure there is no pink showing.",
    "Remove chicken from the frying pan onto paper towels to absorb any excess oil, and immediately place in a large bowl.",
    "In a small saucepan, add butter, Sriracha hot chili sauce, black pepper, granulated garlic powder and heat just to boil, stirring constantly.",
    "Pour the hot sauce over the chicken wings and toss to coat well.",
    "Serve immediately or while they are still hot.",
    "You may also freeze the chicken after it is cooked and then reheated in a preheated 400 F oven for 10 minutes.",
    "NOTE: You may also use the following choices of hot sauces.",
    "1 tablespoon of Red Hot Sauce - wings will be medium hot.",
    "2 tablespoons of Sriracha Hot Chili Sauce - wings will be hot.",
    "2 teaspoons of Sambal Oelek - wings will be very hot."
  ],
  "ingredients": [
    "0",
    "12 chicken mid-joint wings",
    "1⁄3 cup all-purpose flour",
    "1⁄2 teaspoon salt",
    "1⁄4 teaspoon cayenne pepper",
    "1⁄2 teaspoon smoked paprika",
    "3⁄4 cup panko breadcrumbs",
    "2 large eggs",
    "3 tablespoons whole milk, homogenized",
    "1⁄3 cup butter, melted",
    "2 tablespoons sriracha hot chili sauce, See Note",
    "1⁄8 teaspoon black pepper",
    "1⁄2 teaspoon granulated garlic powder",
    "1 -2 cup canola oil or 1 -2 cup extra virgin olive oil"
  ],
  "__v": 1
}