{
  "__v": 1,
  "directions": [
    "0",
    "Adjust oven rack to lower middle position and heat to 300 degrees. Combine all the ingredients in a large Dutch oven, including the spent orange halves and juice. Bring the mixture to a simmer over medium-high heat, uncovered. Once it simmers, cover pot and transfer it to the oven. Cook until the meat falls apart when prodded with a fork, about 2 hours.",
    "Remove the pot from the oven and turn on the broiler. Use a slotted spoon to remove the meat from the pan and place it on a large foil-lined jelly roll pan. Remove and discard everything from the pot except for the cooking liquid. Place pot over high heat on the stove and boil until thick and syrupy, about 20 minutes. You should have about 1 C of liquid remaining when it is finished.",
    "While the liquid is reducing, use two forks to pull each cube of pork into three equal sized pieces. Once the liquid has become a syrup, gently fold in the pieces of pork into the pot. Try not to break up the pork any further. Taste and add additional salt and pepper.",
    "Spread the pork back onto the foil lined pan and evenly spread the meat around so there is a single layer of meat. Place the jelly roll pan on the lower middle rack of the oven and broil until the top of the meat is well browned and edges are slightly crisp, about 5 to 8 minutes. Using a wide metal spatula, flip the pieces of meat and broil the other side until well browned and edges are slightly crisp, 5 to 8 minutes. Serve immediately in a tortilla with all your favorite toppings."
  ],
  "firstAdded": "2014-07-25T18:45:09.941000",
  "hash": "1d675dae4474514df85ffe278419a81f297a107e",
  "href": "http://www.mykitchenescapades.com/2012/11/pork-carnitas.html",
  "image": "http://4.bp.blogspot.com/-aHfdmu8RKos/UJqPXNUOJcI/AAAAAAAAB7g/KyXY-GC7gG0/s640/DSC_0005.JPG",
  "ingredients": [
    "0",
    "4 pound boneless pork butt, fat trimmed and cut into 2 inch cubes",
    "1 1/2 tsp salt",
    "3/4 tsp pepper",
    "1 tsp ground cumin",
    "1 onion, peeled and halved",
    "2 bay leaves",
    "1 tsp dried oregano",
    "2 Tb fresh lime juice",
    "2 C water",
    "1 medium orange, juiced and keep the spent halves"
  ],
  "keywords": [
    "boneless",
    "pork",
    "butt",
    "fat",
    "trimmed",
    "cubes",
    "salt",
    "pepper",
    "cumin",
    "onion",
    "bay",
    "leaves",
    "oregano",
    "lime",
    "juice",
    "water",
    "medium",
    "orange",
    "juiced",
    "spent",
    "halves"
  ],
  "title": "PORK CARNITAS",
  "users": [
    null
  ]
}