{
  "hash": "97fff2eabaee3d21e28c65cac81d87aefdfb9bba",
  "title": "Stock-Braised Turkey Legs",
  "image": "",
  "href": "https://www.bonappetit.com/recipe/stock-braised-turkey-legs",
  "extension": "Chrome",
  "firstAdded": "2018-12-02T20:44:53.866000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place salt and brown sugar in a small bowl and work together with your fingers to incorporate. Place turkey legs on a wire rack set inside a rimmed baking sheet. Sprinkle dry brine all over both sides of legs. Chill, uncovered, at least 12 hours and up to 2 days.",
    "Preheat oven to 250°. Rinse turkey legs and pat dry. Sprinkle on all sides with flour. Heat 2 Tbsp. oil in a large skillet over medium-high. Cook 2 turkey legs, skin side down, until skin is browned and crisp, about 5 minutes. Transfer legs to a large roasting pan. Repeat with remaining 2 Tbsp. oil and 2 turkey legs.",
    "Reduce heat to medium and add garlic and orange, cut side down, and rosemary and chile to skillet and cook, undisturbed, until garlic is lightly browned, about 2 minutes. Add wine, scraping to release any browned bits stuck to the bottom of pan. Cook until wine is almost completely evaporated, about 2 minutes. Scrape into roasting pan with turkey legs. Pour in stock and cover tightly with 2 layers of foil.",
    "Transfer pan to oven and braise turkey until leg joints wiggle freely and meat is fork-tender, 2½–3 hours.",
    "Place turkey legs, skin side up, on a foil-lined rimmed baking sheet. Transfer garlic, orange, rosemary, and chile to a platter. Start with 2 cups braising liquid to make sauce. If you have more than that, set roasting pan over medium-high heat and bring liquid to a boil. Cook until reduced to 2 cups. Reduce heat so liquid is simmering and whisk in butter a piece at a time, incorporating each piece completely before adding more.",
    "Heat broiler. Broil turkey legs until skin is browned and crisp, about 2 minutes. Transfer to platter and serve with pan sauce poured over or alongside.",
    "Do Ahead: Turkey legs can be braised 3 days ahead. Let cool in braising liquid; cover and chill. Reheat, covered, until heated through before broiling."
  ],
  "ingredients": [
    "0",
    "2 tablespoons Diamond Crystal or 1 tablespoon plus ½ teaspoon Morton kosher salt",
    "1½ teaspoons light brown sugar",
    "4 turkey legs (thigh and drumstick; about 6½ pounds total), patted dry",
    "2 tablespoons all-purpose flour",
    "4 tablespoons extra-virgin olive oil",
    "3 heads of garlic, halved crosswise",
    "1 small orange, halved",
    "2 sprigs rosemary",
    "1 red chile (such as Fresno or cayenne)",
    "1 cup dry white wine",
    "4 cups Thanksgiving Stock or water",
    "4 tablespoons unsalted butter, cut into pieces"
  ],
  "__v": 1
}