{
  "hash": "7b5def24e9637738dd0706ff5e40e198641f4018",
  "title": "Sweet Potato and Pecan Puree",
  "image": "https://patijinich.com/wp-content/uploads/2016/10/Sweet-Potato-Puree-912x622.jpg",
  "href": "https://patijinich.com/recipe/sweet-potato-and-pecan-puree/",
  "extension": "Chrome",
  "firstAdded": "2017-10-29T13:08:06.471000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place pecans, thyme and nutmeg in a small saucepan and cover with the milk. Set over low heat, once it comes to a gentle simmer, turn off heat and cover. Let it sit while the sweet potatoes cook.",
    "Bring salted water to a rolling boil over high heat in a large pot. Carefully add the sweet potatoes, making sure the water covers them, and reduce heat to medium. Continue cooking at a medium simmer until the sweet potatoes are completely cooked through, soft, and the tip of a paring knife can easily slide through any piece, about 15 to 20 minutes. Drain.",
    "Place half of the sweet potatoes and half of the pecan and milk mixture in a food processor. Puree until completely smooth, scrape onto a bowl. Repeat with the remaining half of the sweet potatoes and pecan and milk mixture, but this time add the adobo sauce and 1/4 teaspoon salt. Puree until completely smooth and scrape into the same bowl.",
    "Set the same large pot that the sweet potatoes were cooked in over medium heat. Add the butter, and once it melts and bubbles, add the pureed sweet potatoes. Stirring with a spatula, pour in the crema and cook for a couple minutes more, until completely heated through. Serve."
  ],
  "ingredients": [
    "0",
    "1cuppecans",
    "1/2teaspoondried thyme",
    "1/2teaspoonground nutmeg",
    "1cupwhole milk",
    "3poundssweet potatoespeeled, cut into 3/4-inch pieces",
    "2tablespoonsadobo saucefrom chipotles in adobo",
    "1/4teaspoonkosher or coarse sea saltplus more to salt water",
    "4tablespoonsunsalted butter",
    "1/4cupMexican crema"
  ],
  "__v": 1
}