{
  "hash": "0c61426e69375f17abe3a8e00f13e0b1a601315b",
  "title": "Pepperoni Garlic Bread Burgers (Grilled Cheeseburgers With Pepperoni Sauce Served on Garlic Bread Rolls) Recipe",
  "image": "http://www.seriouseats.com/recipes/assets_c/2013/06/20130611-burger-week-grilled-burger-variations-11-thumb-625xauto-332642.jpg",
  "href": "http://www.seriouseats.com/recipes/2013/06/pepperoni-garlic-bread-burgers-cheeseburgers-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-10-03T05:01:29.447000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the Pepperoni Sauce: Heat olive oil and pepperoni in a small saucepan over medium heat until pepperoni is just starting to crisp, about 2 minutes. Add garlic and stir until fragrant, about 30 seconds. Add tomatoes, bring to a boil, reduce to a bare simmer, and cook, stirring occasionally, until reduced to a thick paste with the consistency of chunky ketchup, about 20 minutes. Stir in vinegar and season to taste with salt and pepper. Set aside.",
    "For the Garlic Butter: Heat butter in a small saucepan over low heat until melted. Add garlic and oregano. Season with salt and pepper. Continue cooking until foaming just subsides, about 30 seconds. Stir in parsley or basil and set aside.",
    "When ready to serve, season burger patties generously with salt and pepper and cook burgers to desired doneness on a hot grill or in a skillet on the stovetop, 125°F for medium rare or 135°F for medium. Transfer to a plate and allow to rest for 5 minutes.",
    "Adjust rack to 6 inches below element and heat broiler to high. Brush burger buns on both cut surfaces with garlic butter and place cut-side-up on a broiler pan. Add burgers and top with provolone cheese. Broil burgers and buns just until cheese melts, about 45 seconds. Return burgers to plate and continue broiling buns until well browned and bubbling, about 1 minute longer.",
    "Place burgers on bottom buns. Top with pepperoni sauce and shards of parmesan cheese. Close burgers and serve."
  ],
  "ingredients": [
    "0",
    "For the Pepperoni Sauce:",
    "1 tablespoon extra-virgin olive oil",
    "4 ounces stick pepperoni, finely diced",
    "3 medium cloves garlic, minced (about 1 tablespoon)",
    "1 cup crushed tomatoes",
    "1/2 teaspoon red wine vinegar",
    "Kosher salt and freshly ground black pepper",
    "For the Garlic Butter:",
    "4 tablespoons butter",
    "2 medium cloves garlic, minced (about 2 teaspoons)",
    "1/2 teaspoon dried oregano",
    "1 tablespoon chopped fresh parsley or basil leaves",
    "For the Burgers:",
    "20 ounces freshly ground chuck, divided into four 5-ounce patties",
    "4 hamburger buns",
    "4 slices sharp or mild provolone cheese",
    "3 ounces parmesan cheese, cut into shards with a vegetable peeler"
  ],
  "__v": 1
}