{
  "hash": "bf11181a2d62b9f2b575d083e4733ab5f2a3ea7b",
  "title": "Stovetop Lasagna",
  "image": "http://target.scene7.com/is/image/Target/c_Stove-Top-Lasagna_RT?hei=340",
  "href": "http://www.cooking.com/recipes-and-more/recipes/stove-top-lasagna-recipe",
  "extension": "Chrome",
  "firstAdded": "2015-08-28T00:02:22.982000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "italian",
    "sausage",
    "patties",
    "mushrooms",
    "vidalia",
    "onion",
    "marinara",
    "noboil",
    "noodles",
    "barilla",
    "ovenready",
    "lasagna",
    "sheets",
    "ricotta",
    "cheese",
    "mozzarella",
    "parsley"
  ],
  "directions": [
    "0",
    "Heat the oil in a large deep skillet over medium-high heat. Add the sausage and cook, breaking it up with a spoon, until browned, about 5 minutes. Add the mushrooms and onion and cook, stirring occasionally, until tender, about 5 minutes. Transfer the sausage mixture to a bowl.",
    "Add 1 cup sauce to the skillet and heat over low heat. Place two lasagna sheets, about 1/2-inch apart, over the sauce (the sheets will expand to fill the gap as they cook). Spread half of the sausage mixture evenly over the lasagna sheets. Spoon half of the ricotta, in dollops, over the sausage mixture. Top with 1/2 cup sauce and 1/2 cup mozzarella. Repeat, using two more lasagna sheets, the remaining sausage mixture, the remaining ricotta, 1/2 cup sauce and 1/2 cup mozzarella. Top with the remaining two lasagna sheets and the remaining sauce.",
    "Cover and simmer, over medium-low heat, until the noodles are tender, about 25 minutes. Sprinkle with the remaining mozzarella and the parsley. Cover and cook until the cheese is melted, about 2 minutes. Remove from the heat. Uncover and let stand 10 minutes for easier serving."
  ],
  "ingredients": [
    "0",
    "2 tablespoons olive oil",
    "1 pound Italian sweet sausage patties",
    "1 (10-ounce) package mushrooms, thinly sliced",
    "1 Vidalia onion, finely chopped",
    "3 cups marinara sauce",
    "6 no-boil lasagna noodles (like Barilla Oven-Ready lasagna sheets)",
    "1 cup ricotta cheese",
    "2 cups shredded mozzarella cheese",
    "2 tablespoons chopped fresh parsley"
  ],
  "__v": 1
}