{
  "hash": "4ed36769cc1076780eb6efb57d97aac54591bfbb",
  "title": "Chicken Salad",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/chicken-salad-recipe4.html",
  "firstAdded": "2015-01-24T15:43:04.653000",
  "users": [
    null
  ],
  "keywords": [
    "fryer",
    "chicken",
    "preferably",
    "free",
    "range",
    "organic",
    "salt",
    "black",
    "pepper",
    "lemon",
    "juiced",
    "dijon",
    "mustard",
    "celery",
    "seed",
    "ribs",
    "red",
    "onion",
    "bunch",
    "flatleaf",
    "parsley",
    "mayonnaise",
    "sandwich",
    "buns",
    "mixed",
    "greens",
    "desired"
  ],
  "directions": [
    "0",
    "Preheat the oven to 350 degrees F.",
    "Rub the chicken inside and out with salt and pepper. Place the chicken in shallow roasting pan and roast until cooked through, 35 to 40 minutes. Test for doneness by twisting the drumstick, as it will release at the joint when done. Pour off any accumulated pan juices and reserve. Place the chicken and the reserved juices in the refrigerator to chill.",
    "When the chicken is completely chilled, remove the meat from the bones and place in a mixing bowl. Melt the reserved juices in the microwave, then pour over the chicken and toss so that all of the juices can be re-absorbed.",
    "Add the lemon juice and Dijon mustard and toss again to coat the meat. Add the celery seed, celery, onions, and parsley. Toss with just enough mayonnaise to moisten the salad. Season with salt and pepper, to taste.",
    "Serve as a chicken salad sandwich, grilled or cold, or on a bed of mixed greens garnished with fresh vegetables.",
    "This recipe was provided by professional chefs and has been scaled down from a bulk recipe provided by a restaurant. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results.",
    "Recipe courtesy Curtis Dorsett, Sunflower Caffe, Sonoma, CA"
  ],
  "ingredients": [
    "0",
    "1 whole fryer chicken, 3 to 3 1/2 pounds (preferably free range, organic)",
    "Salt and freshly ground black pepper",
    "1 lemon, juiced",
    "2 tablespoons Dijon mustard",
    "1 tablespoon celery seed",
    "6 ribs celery, diced",
    "1 sweet red onion, diced",
    "1 small bunch fresh flat-leaf parsley, finely chopped",
    "1/4 cup mayonnaise",
    "Sandwich buns, mixed greens and fresh vegetables, for serving, if desired"
  ],
  "__v": 1
}