{
  "hash": "54efc6571ce84aba5fdcb99c1c2c253bf4b494e3",
  "title": "Mac Attack",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2012/10/18/0/DV1508H_mac-attack-recipe_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/mac-attack-recipe.html",
  "firstAdded": "2015-01-24T15:44:14.286000",
  "users": [
    null
  ],
  "keywords": [
    "elbow",
    "pasta",
    "american",
    "cheese",
    "cheddar",
    "onions",
    "butter",
    "allpurpose",
    "flour",
    "milk",
    "romano",
    "jack",
    "salt",
    "black",
    "pepper",
    "hot",
    "beef",
    "strips",
    "bacon",
    "crisp",
    "hamburger",
    "buns",
    "halfpound",
    "burger"
  ],
  "directions": [
    "0",
    "Boil the pasta until cooked, 10 to 12 minutes. Drain out the water and place the pasta back into the pot. Take the sliced cheeses and cube them.",
    "In a separate saucepan, fry the onions in the butter until translucent and soft. Add the flour and whisk repeatedly, making a roux, until the mixture is golden brown. Add in the milk and let simmer until the sauce thickens, stirring occasionally so it does not burn or stick. When the sauce starts to thicken, add in the American, Cheddar, Romano and 4 ounces of the Cheddar Jack. Stir until the cheeses melt and make a thick cheese sauce. Stir in the salt and black pepper, and pour the sauce over the pasta. Add the hot sauce, and mix thoroughly until the pasta is completely mixed with the sauce. Place in the refrigerator and let cool.",
    "Take the ground beef and make 4 ounce patties. (Sprinkle with salt and pepper if you wish). In a fry pan or skillet over medium-high heat, cook the burgers to your desired temperature.",
    "In a separate fry pan, make four 4-ounce portions of the mac and cheese, placing them flat in the pan. (Like little mac and cheese pancakes). Warm them up and cover them with the remaining Cheddar Jack. The cheese should melt and become crispy on the bottom. Using a spatula, place the mac and cheese discs on top of the burger, and then top with 2 strips of bacon on each. Put the burger on the bun and enjoy your very own Mac Attack!",
    "This recipe was provided by a chef, restaurant or culinary professional and may have been scaled down from a bulk recipe. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results.",
    "Recipe courtesy Paul Malvone, Boston Burger Company"
  ],
  "ingredients": [
    "0",
    "1 pound elbow pasta",
    "4 ounces sliced American cheese",
    "4 ounces sliced Cheddar",
    "1/2 cup chopped onions",
    "1/2 stick butter",
    "1/4 cup all-purpose flour",
    "4 cups milk",
    "6 ounces grated Romano",
    "1 pound shredded Cheddar Jack",
    "1 tablespoon salt",
    "1 1/2 tablespoons ground black pepper",
    "4 ounces hot sauce",
    "2 pounds ground beef (80/20)",
    "8 strips bacon, cooked until crisp",
    "4 hamburger buns, large enough for a half-pound burger"
  ],
  "__v": 1
}