{
  "hash": "0d05b69d2eaf05a1c129fd366feabb12a956ff5e",
  "title": "Shrimp Thai Green Curry",
  "image": "http://media.paleomg.com/2016/04/IMG_2458-150x150.jpg",
  "href": "http://paleomg.com/shrimp-thai-green-curry/",
  "extension": "Chrome",
  "firstAdded": "2016-10-27T19:33:36.426000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place shrimp, lime juice, ginger, red pepper flakes and fresh salt in a bow, mix and set aside.",
    "Slice pepper, onion, and garlic while the shrimp marinates. Place 2 tablespoons of ghee in a large high rimmed pan. Once hot, add all the veggies to the pan and cook for 6-7 minutes, until onion is translucent and peppers are soft. Remove from pan and set aside.",
    "Add 1 more tablespoon of ghee to the pan. Once hot, place shrimp in pan to cook on each side for 1-2 minutes, then remove and set aside. (I did this in 2 batches to make sure the shrimp got a perfect color and crust on it, making sure the temperature of the pan doesn't drop too much).",
    "Once shrimp has been removed, add green curry paste and whisk around. After about 30 seconds of whisking, add coconut milk, almond butter, honey, fish sauce, ginger, lime juice, kaffir lime leaves and lemongrass. Whisk together to combine. Let simmer for 5 minutes then add the pepper/onion mixture back to the pan along with thinly sliced red jalapeños. Simmer for another 5 minutes. When there are 2 minutes left, add in shrimp to heat through. Once it's done cooking, add basil, cilantro, and cashews.",
    "Before serving, removing lime leaves and lemon grass!",
    "Garnish with extra cilantro!"
  ],
  "ingredients": [
    "0",
    "1 pound shrimp, deveined and peeled",
    "juice of ½ lime",
    "½ teaspoon grated ginger",
    "1 teaspoon red pepper flakes",
    "pinch of salt",
    "1",
    "½ yellow onion, diced",
    "1 red bell pepper, thinly sliced",
    "1 orange bell pepper, thinly sliced",
    "3 garlic cloves, thinly sliced",
    "3 tablespoons ghee",
    "2 tablespoons green curry paste",
    "2 (14 ounce) cans full fat coconut milk",
    "2 heaping tablespoons almond butter",
    "2 tablespoons honey",
    "3 teaspoons fish sauce",
    "1 teaspoon grated ginger",
    "juice of 2 limes (about 4-5 tablespoons)",
    "5-6 lime leaves, rolled between your fingers to release the fragrance",
    "1 lemon grass stalk, cut in half lengthwise",
    "2 red jalapeno peppers, thinly sliced (remove seeds for less spice)",
    "3 large basil leaves, thinly sliced",
    "handful of cilantro, roughly chopped",
    "⅓ cup cashews, roughly chopped"
  ],
  "__v": 1
}