{
  "__v": 1,
  "directions": [
    "0",
    ". Boil the milk in a pot and add in the elbow noodles. Cook until al dente at a low boil, stirring constantly so that the milk does not burn. Turn off the stove and add in the shredded cheese, garlic, mustard, onion and pepper flakes and stir until cheese is completely melted. Add in the cheese cubes and stir to distribute but do not let them melt.",
    "Pour macaroni and cheese in an 8 x 8 dish. Cover top with plastic wrap and press down on macaroni to compress it. Add something to add weight on top and then place in fridge for several hours or overnight.",
    "When ready to make, cut out burger buns with ramekins, glass cups, or biscuit cutter rounds about the size of a full burger bun. Turn stove to medium high heat and add in about 1/2 inch to 1 inch of oil to a sauce pan being used for frying. Meanwhile, beat egg and place in a medium bowl. In another bowl, add flour. In another bowl add the bread crumbs.",
    "Take noodle bun and coat in egg, then flour and then bread crumbs. Repeat so that it is double coated in each. Add to oil and fry on each side for about 30 seconds to 1 minute or until breading becomes brown and crisp. Remove from oil and repeat with remaining noodle buns.",
    "Add your favorite burger ingredients to your buns. I used premade burger patties, tomato slices, lettuce, ketchup and bacon."
  ],
  "firstAdded": "2014-08-18T23:41:37.393000",
  "hash": "7478a5d3a0be67028548c5d43df307a31c378db9",
  "href": "http://kirbiecravings.com/2013/10/mac-attack-burger.html",
  "image": "https://lh3.googleusercontent.com/-lGzo-mdYvLk/UmirDz9Lg4I/AAAAAAAERVs/LC-l2d72nvE/s800/mac-attack-burger-13.jpg",
  "ingredients": [
    "0",
    "For the mac and cheese:",
    "2 cups elbow macaroni",
    "2 cups skim milk",
    "1 1/2 cups shredded cheddar cheese",
    "1 tsp mustard powder",
    "1/2 tsp garlic powder",
    "1/2 tsp onion powder",
    "1 tsp red pepper flakes",
    "1/2 cup of sharp cheddar cheese cut into small cubes (about 1/4 inch by 1/4 inch)",
    "for the breading:",
    "1 egg",
    "1 cup all purpose flour",
    "1 cup Italian or panko bread crumbs",
    "burger toppings of your choice:",
    "premade beef patty",
    "lettuce",
    "tomato",
    "bacon",
    "mustard/ketchup"
  ],
  "keywords": [
    "mac",
    "cheese",
    "elbow",
    "macaroni",
    "skim",
    "milk",
    "cheddar",
    "mustard",
    "garlic",
    "onion",
    "red",
    "pepper",
    "sharp",
    "cubes",
    "breading",
    "egg",
    "purpose",
    "flour",
    "italian",
    "panko",
    "bread",
    "crumbs",
    "burger",
    "toppings",
    "premade",
    "beef",
    "patty",
    "lettuce",
    "tomato",
    "bacon",
    "mustardketchup"
  ],
  "title": "MAC ATTACK BURGER",
  "users": [
    null
  ]
}