{
  "hash": "f2028c46af39969e96c065b50bd105d9c9424170",
  "title": "Rosemary Pecan Goat Cheese Truffles",
  "image": "http://thecafesucrefarine.com/wp-content/uploads/Rosemary-Pecan-Goat-Cheese-Truffles-1-1.jpg",
  "href": "http://thecafesucrefarine.com/2016/03/rosemary-pecan-goat-cheese-truffles/",
  "extension": "Chrome",
  "firstAdded": "2016-03-20T09:33:06.525000",
  "users": [
    null
  ],
  "keywords": [
    "plain",
    "goat",
    "cheese",
    "softened",
    "hour",
    "room",
    "cream",
    "pecans",
    "extra",
    "virgin",
    "olive",
    "oil",
    "honey",
    "sriracha",
    "kosher",
    "salt",
    "currants",
    "cranberries",
    "golden",
    "raisins",
    "rosemary",
    "parsley"
  ],
  "directions": [
    "0",
    "Combine softened goat cheese and cream cheese in a medium size bowl. Whisk together until smooth and creamy, then refrigerate for at least one hour or place mixture in the freezer for 15-20 minutes.",
    "While cheese is chilling, preheat oven to 325˚F. Line a small sheet pan with parchment paper.",
    "Combine pecans, oil, honey and Sriracha on the prepared pan. Bake for 3 minutes then remove pan from oven and stir well. Return to oven and bake another 3-5 minutes or until pecans are golden brown. Remove from oven and sprinkle with kosher salt. Toss and set aside to cool.",
    "Combine cooled pecans, dried fruit, chopped rosemary and chopped parsley on a dinner plate. Set aside.",
    "Scoop up 1 tablespoon size portions of the chilled cheese mixture** and roll into balls (the balls will be a bit sticky, but chilling helps make it less sticky). Drop the ball onto the plate with the pecan coating and gently roll the cheese ball around in the mixture, patting it into the cheese, until it is fully coated. At this point you can reshape your balls into nicer circles, if they have become misshapen. Place on a clean dinner plate and place in the refrigerator until 30 minutes prior to serving. Serve with crackers, crostini or pita wedges or on their own for a low carb appetizer."
  ],
  "ingredients": [
    "0",
    "6 ounces plain goat cheese, softened for an hour at room temperature",
    "4 ounces cream cheese, softened for an hour at room temperature",
    "¾ cup chopped pecans",
    "1 teaspoon extra virgin olive oil",
    "1 teaspoon honey",
    "½ teaspoon Sriracha",
    "¼ teaspoon kosher salt",
    "2 tablespoons currants*",
    "2 tablespoons dried cranberries*",
    "2 tablespoons golden raisins*",
    "1 tablespoon finely chopped fresh rosemary",
    "3 tablespoons finely chopped fresh parsley"
  ],
  "__v": 1
}