{
  "hash": "beb8efae1e5c538ee1264463d8e8d73b93d330f3",
  "title": "Spicy Roasted Pumpkin Wedges",
  "image": "https://i0.wp.com/whereismyspoon.co/wp-content/uploads/2016/11/roasted-pumpkin-yogurt-dip.jpg?zoom=2&w=1170&ssl=1",
  "href": "https://whereismyspoon.co/spicy-roasted-pumpkin-wedges/",
  "extension": "Chrome",
  "firstAdded": "2018-09-09T12:26:34.502000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 200 degrees Celsius/ 400 degrees Fahrenheit.",
    "Wash and dry the Hokkaido pumpkin, you don't have to peel this sort. If you are using butternut squash or other sort of pumpkin, you will have to peel those. Remove the seeds. Cut the pumpkin into wedges, about 1.5 cm/ 0.6 inches thick. Place them in a bowl or in a casserole dish if you are baking them directly.",
    "In a small bowl mix together the roughly chopped garlic and the spices. Add the olive oil and stir to blend. You could add more olive oil if you wish, but I don't find it necessary. Add salt and pepper to taste. Pour the mixture over the pumpkin wedges and rub well with your hands to make sure that all the wedges are coated in the spice mixture. Leave to marinate for a while or roast immediately for about 25-30 minutes until the wedges are as soft as you like them. You could start checking after about 20 minutes already.",
    "Serve hot with yogurt tahini dip or as a side dish.",
    "For the yogurt tahini dip: mix together 150 g/ about ⅔ cup Greek yogurt with 1 tablespoon tahini, 1 teaspoon za'atar, 1 grated garlic clove and salt, pepper and lemon juice to taste."
  ],
  "ingredients": [
    "0",
    "1 small Hokkaido pumpkin, about 750 g/ 26.5 oz (butternut squash or other kind of tasty pumpkin can be used instead)",
    "2 garlic cloves",
    "1 teaspoon ground cumin",
    "½ teaspoon ground coriander",
    "1 teaspoon hot paprika powder",
    "½ teaspoon turmeric powder",
    "3-4 tablespoons olive oil",
    "salt and pepper to taste"
  ],
  "__v": 1
}