{
  "hash": "bbc0aef678fc51dcc25a4cf48ee586d7994bcc3d",
  "title": "GARLIC TOAST WITH BALSAMIC TOMATOES AND WHITE BEANS",
  "image": "https://www.budgetbytes.com/wp-content/uploads/2017/10/Garlic-Toast-with-Balsamic-Tomatoes-and-White-Beans-H-380x380.jpg",
  "href": "https://www.budgetbytes.com/2017/10/garlic-toast-balsamic-tomatoes-white-beans/",
  "extension": "",
  "firstAdded": "2018-05-02T12:29:30.456000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place the sliced bread on a baking sheet. Slice the clove of garlic in half and rub the open face of the garlic over the surface of the sliced bread (leave the garlic peel on to make it easier to handle). Pour the olive oil in a small bowl, then brush it over the surface of the garlic rubbed bread. Set the bread aside and reserve the clove of garlic and leftover oil for the tomatoes.",
    "Heat a large skillet over medium heat. Once hot, pour the remaining olive oil from the bowl into the skillet and swirl it to coat the surface. Add the grape tomatoes and allow them to cook, stirring only occasionally, until they blister, pop, and begin to lose their shape. The juices will brown and caramelize on the skillet.",
    "While the tomatoes are cooking, mince the garlic clove. Once the tomatoes have split open and lost their shape, add the minced garlic and continue to sauté for 1-2 minutes, or until the garlic is a little softened and has lost its raw edge.",
    "Turn the heat down to medium-low, add the balsamic vinegar and rosemary*, and stir and cook until the vinegar has dissolved any brown bits from the bottom of the skillet and it has thickened just slightly. Turn the heat down even further (to low), add the butter and a pinch of salt, and stir until the butter has melted into the sauce.",
    "Rinse and drain the Cannellini beans, then add them to the skillet. Stir them into the tomatoes and sauce, and allow them to heat through.",
    "While the beans are heating, turn the oven on to broil and place the baking sheet with the bread into the oven. Watch the bread closely as it broils and remove it from the oven when the top is golden brown (depending on how close the oven's rack is to the broiler, this may be only a few minutes).",
    "To serve, top each slice of bread with a hefty scoop of the tomatoes and beans, then add a pinch of Parmesan."
  ],
  "ingredients": [
    "0",
    "4 slices hearty bread $1.00",
    "1 large clove garlic $0.08",
    "2 Tbsp olive oil $0.26",
    "1 pint grape tomatoes $1.69",
    "2 Tbsp balsamic vinegar $0.22",
    "1/8 tsp dried rosemary $0.02",
    "1 Tbsp butter $0.13",
    "pinch salt $0.01",
    "15 oz. can Cannellini beans $0.69",
    "2 tsp Parmesan $0.06"
  ],
  "__v": 1
}