{
  "hash": "5fc2fc39db0b7c89c26a34a2a996a360ad5cf6b1",
  "title": "Asian \"Peanut\" Sauce Noodle Bowl",
  "image": "http://media.paleomg.com/2014/02/PaleOMG-Blueberry-Pumpkin-Breakfast-Bars_2-150x150.jpg",
  "href": "http://paleomg.com/asian-peanut-sauce-noodle-bowl/",
  "extension": "Chrome",
  "firstAdded": "2017-07-17T11:22:55.186000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large dutch oven or high rimmed sauté pan over medium-high heat, add ground pork, onion, red bell pepper and garlic cloves.",
    "Use a wooden spoon to break up meat and cook down. Add a bit of salt and pepper along ¼ tablespoon of red pepper flakes. Mix well and cook until no pink remains in the meat.",
    "Once meat is cooked through, add spiral sliced zucchini noodles to the meat and cook on low for 5 minutes, mixing the noodles into the pork mixture. After 5 minutes, reduce heat to low.",
    "Place a small saucepan over medium heat. Add coconut milk, sunflower seed butter, coconut aminos, chili sauce, lime juice, ¼ tablespoon red pepper flakes, and a bit of salt and pepper. Whisk to combine.",
    "Once sauce is smooth, reduce heat to low and let thicken for about 5 minutes.",
    "After sauce has reduced, pour sauce on noodle and pork mixture and mix well to combine.",
    "Serve noodle bowls with fresh cilantro and cashews garnished on top."
  ],
  "ingredients": [
    "0",
    "1 pound ground pork",
    "½ small yellow onion, diced",
    "1 red bell pepper, diced",
    "2 garlic cloves, minced",
    "3 medium zucchinis, spiral sliced into noodles then patted dry with paper towels for 10 minutes to soak up excess water (I used a Paderno Spiral Slicer)",
    "1 (14 ounce) can coconut milk",
    "½ cup sunflower seed butter (or other nut butter)",
    "¼ cup coconut aminos (or gluten free soy sauce)",
    "3 tablespoons chili garlic sauce (or sriracha)",
    "juice of ½ a lime",
    "½ tablespoon red pepper flakes, divided",
    "salt and pepper, to taste",
    "fresh cilantro, to garnish",
    "cashews, to garnish"
  ],
  "__v": 1
}