{
  "hash": "87e6d8feadc8ef5859ee6e2395b468e4b1bd079f",
  "title": "Linguine With Green Olive Sauce And Zesty Breadcrumbs",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/linguine-green-olive-sauce-zesty-breadcrumbs",
  "extension": "Chrome",
  "firstAdded": "2017-02-03T14:06:54.710000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparation",
    "Heat 1 Tbsp. oil in a medium skillet over medium and cook panko, stirring, until golden, about 5 minutes. Season with salt and pepper; transfer to paper towels to drain and toss with dill and lemon zest.",
    "Cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain, reserving ½ cup pasta cooking liquid.",
    "Meanwhile, mash anchovies and garlic to a paste on a cutting board with the side of a chef’s knife. Combine with parsley, basil, and half of olives and capers in a large bowl. Chop remaining olives and capers and add to bowl, along with remaining ½ cup oil. Mix well; season sauce with salt and pepper.",
    "Add pasta and ¼ cup reserved pasta cooking liquid to sauce. Toss, adding Parmesan a bit at a time, along with more pasta cooking liquid as needed, until sauce coats pasta. Add lemon juice; season with salt and pepper.",
    "Serve pasta topped with panko and more Parmesan."
  ],
  "ingredients": [
    "0",
    "Linguine With Green Olive Sauce And Zesty Breadcrumbs",
    "Bursting with the big brash flavors of green olives, anchovies, and capers, this herbaceous pasta sauce isn't afraid to bite back.",
    "Ingredients",
    "4 SERVINGS",
    "1 tablespoon plus ½ cup olive oil",
    "¼ cup panko (Japanese breadcrumbs)",
    "Kosher salt and freshly ground black pepper",
    "2 tablespoons chopped fresh dill",
    "1 teaspoon finely grated lemon zest",
    "12 ounces linguine or other long pasta",
    "4 oil-packed anchovy fillets",
    "1 small garlic clove",
    "1 cup chopped fresh parsley",
    "½ cup chopped fresh basil",
    "1 cup green olives, pitted, halved",
    "3 tablespoons drained capers",
    "½ ounce Parmesan, finely grated (about ½ cup), plus more for serving",
    "2 tablespoons fresh lemon juice"
  ],
  "__v": 1
}