{
  "__v": 1,
  "directions": [
    "0",
    "Place oven rack in lower-middle position and heat oven to 350 degrees. Spread nuts on rimmed baking sheet and bake until deep golden brown, 10 to 15 minutes. Transfer nuts to cutting board to cool; chop coarsely and set aside. Toast coconut on same rimmed baking sheet, stirring 2 to 3 times, until light golden, about 5 to 7 minutes; set aside. (Keep a close eye on the coconut when toasting as it can burn quickly.) Lower oven temperature to 325 degrees F. Lightly butter a 13- by 9-inch baking pan; set aside. If the pan is glass or Pyrex, turn the oven heat down to 300 degrees F.",
    "Whisk flour, salt and baking soda together in a medium bowl; set aside.",
    "In a Large bowl, whisk melted butter, brown and granulated sugars together until combined. Add egg, egg yolk, and vanilla and mix well. Fold dry ingredients into egg mixture until just combined. Do not overmix. Fold in chips, coconut, and nuts, if desired, and turn batter into prepared pan, smoothing top with spatula.",
    "Bake until top is light golden brown, slightly firm to the touch, and edges start pulling away from sides of pan, about 25 to 30 minutes. Cool to room temperature on wire rack, 1 to 2 hours. Transfer to cutting board, cut into bars and serve.",
    "Makes about 3 dozen (1 1/2- by 2 1/2-inch) bars."
  ],
  "firstAdded": "2014-11-18T00:16:26.755000",
  "hash": "a47bf51e940781038273cb0ebf591871eb63d3f5",
  "href": "http://www.bigoven.com/recipe/chewy-chocolate-chip-bar-cookies/163794",
  "image": "http://mda.bigoven.com/pics/rs/256/chewy-chocolate-chip-bar-cookies-2.jpg",
  "ingredients": [
    "0",
    "2 cups bleached all-purpose flour; plus 2 tbsps",
    "1/2 teaspoon Salt",
    "1/2 teaspoon Baking soda",
    "3/4 cup unsalted butter; (1 1/2 sticks), melted and cooled slightly",
    "1 cup light brown sugar; firmly packed",
    "1/2 cup Granulated sugar",
    "1 large Egg",
    "1 large Egg yolk",
    "2 teaspoon Vanilla extract",
    "1 package (12 oz) Semisweet chocolate chips",
    "1/2 cup unsweetened shredded coconut; toasted (optional)",
    "1/2 cup pecans or walnuts; toasted and coarsely chopped (optional)"
  ],
  "keywords": [
    "bleached",
    "allpurpose",
    "flour",
    "tbsps",
    "salt",
    "baking",
    "soda",
    "unsalted",
    "butter",
    "cooled",
    "slightly",
    "light",
    "brown",
    "sugar",
    "firmly",
    "granulated",
    "egg",
    "yolk",
    "vanilla",
    "semisweet",
    "chocolate",
    "chips",
    "coconut",
    "pecans",
    "walnuts",
    "coarsely"
  ],
  "title": "Chewy Chocolate Chip Bar Cookies",
  "users": [
    null
  ]
}