{
  "hash": "085917cc3edad89b58ac22c478c09fb882ccbbbe",
  "title": "Risotto ai funghi porcini",
  "image": "http://www.giallozafferano.it/images/ricette/6/685/foto_hd/hd450x300.jpg",
  "href": "http://ricette.giallozafferano.it/Risotto-ai-funghi-porcini.html",
  "extension": "Chrome",
  "firstAdded": "2015-09-09T14:13:43.272000",
  "users": [
    null
  ],
  "keywords": [
    "porcini",
    "riso",
    "carnaroli",
    "arborio",
    "burro",
    "olio",
    "oliva",
    "cucchiai",
    "cipolle",
    "piccola",
    "dorata",
    "aglio",
    "spicchio",
    "sale",
    "pepe",
    "macinato",
    "momento",
    "piacere",
    "prezzemolo",
    "tritato",
    "rasi",
    "parmigiano",
    "reggiano",
    "grattugiato",
    "brodo",
    "vegetale"
  ],
  "directions": [
    "0",
    "Mondate i funghi porcini togliendo la terra alla base del gambo, staccando le cappelle dai gambi e strofinandoli delicatamente con un panno umido e pulito (o con carta da cucina inumidita).",
    "Una volta puliti i funghi porcini, affettate sia le cappelle che i gambi.",
    "In un tegame piuttosto capiente mettete a fondere metà del burro indicato, quindi aggiungete la cipolla mondata e tritata finemente e lasciatela appassire senza farle prendere colore; unite anche il riso e fatelo tostare per due minuti, quindi aggiungete un mestolo di brodo vegetale e lasciate cuocere a fuoco moderato, mescolando e unendo poco brodo quando serve.",
    "In un altro tegame di acciaio, o di materiale antiaderente, mettete l’olio e uno spicchio di aglio schiacciato che farete rosolare qualche istante; unite poi i funghi precedentemente puliti e tagliati a fette.",
    "Fate saltare i funghi a fuoco allegro, aggiungendo a metà cottura il sale e in ultimo il pepe macinato al mulinello; aggiungete, se necessario, poco brodo vegetale fino a terminare la cottura (deve durare un massimo di 10-12 minuti totali), poi spegnete il fuoco e, se volete, aggiungete 2 cucchiai rasi di prezzemolo tritato.",
    "Cinque minuti prima che il riso termini la sua cottura unite i funghi precedentemente preparati, tenendone da parte 2 cucchiai che vi serviranno per guarnire i 4 piatti di risotto.",
    "A cottura avvenuta, spegnete il fuoco, aggiungete il parmigiano grattugiato e il restante burro, mantecate per bene il tutto e lasciate riposare qualche secondo.",
    "A questo punto, dividete il risotto in 4 piatti, guarnite la sommità di ognuno di essi con i funghi tenuti da parte e servite immediatamente portando a tavola dell’altro parmigiano grattugiato in modo che i commensali, se lo desiderano, si possano servire da soli."
  ],
  "ingredients": [
    "0",
    "Porcini 400 g",
    "Riso Carnaroli (o Arborio) 320 gr",
    "Burro 60 g",
    "Olio di oliva 2 cucchiai",
    "Cipolle 1 piccola dorata",
    "Aglio 1 spicchio",
    "Sale q.b.",
    "Pepe macinato al momento a piacere",
    "Prezzemolo tritato 2 cucchiai rasi",
    "Parmigiano reggiano grattugiato 50 gr",
    "Brodo vegetale 1 l"
  ],
  "__v": 3
}