{
  "hash": "0a549fc01a3d49bdd6380f6537f5466a24f4afe4",
  "title": "Chocolate fondants",
  "image": "http://www.bbcgoodfood.com/sites/bbcgoodfood.com/files/recipe_images/fondant.jpg",
  "href": "http://www.bbcgoodfood.com/recipes/chocolate-fondants",
  "firstAdded": "2015-02-24T18:40:40.405000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "butter",
    "greasing",
    "cocoa",
    "dark",
    "chocolate",
    "broken",
    "pieces",
    "eggs",
    "egg",
    "yolks",
    "caster",
    "sugar",
    "plain",
    "flour",
    "sifted",
    "clotted",
    "vanilla",
    "ice",
    "cream",
    "serve"
  ],
  "directions": [
    "0",
    "Heat oven to 200C/180C fan/gas 6 and put a baking tray on the middle shelf. Brush the inside of 5 dariole or pudding moulds with the melted butter, then put the cocoa in one and turn it to coat the inside, holding it over the second mould to catch any that escapes. Repeat with the other moulds.",
    "Put the butter and chocolate in a heatproof bowl, set over, but not touching, a pan of simmering water and stir occasionally until melted. allow to cool slightly.",
    "Using electric beaters, whisk together the whole eggs, yolks, sugar and a pinch of salt until pale and moussey (the mixture should almost double in volume), this will take 3-4 mins. Gently fold in the melted chocolate and butter, and then the flour, being careful not to knock out too much air. Spoon into the prepared moulds, stopping just shy of the top. Chill for at least 1 hr.",
    "Put on a hot baking tray and cook for 12-14 mins until the tops are set and coming away from the sides of the moulds. Stand for 30 secs, then serve in the moulds or turn out onto plates. Great with clotted cream or plain ice cream."
  ],
  "ingredients": [
    "0",
    "120g unsalted butter, diced, plus 20g melted for greasing",
    "2 tbsp cocoa powder",
    "120g dark chocolate, broken into pieces",
    "2 eggs and 2 egg yolks",
    "120g caster sugar",
    "1 tbsp plain flour, sifted",
    "clotted cream or vanilla ice cream, to serve (optional)"
  ],
  "__v": 1
}