{
  "hash": "162c0827ce4d8e2f55bd49be9cfaa1665d1515f9",
  "title": "SOUTHERN HOMEMADE SWEET POTATO PIE",
  "image": "https://divascancook.com/wp-content/uploads/2009/11/homemade sweet potato pie recipe.jpg",
  "href": "https://divascancook.com/southern-homemade-sweet-potato-pie-recipe-so-easy-so-delicious/",
  "extension": "Chrome",
  "firstAdded": "2019-11-20T14:09:03.263000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 F",
    "Let's Make The Crust!",
    "In a bowl add the flour and cut in the shortening, until it resembles breadcrumbs.",
    "Stir in the sugar & the salt.",
    "Mix the egg up inside the ice cold water. Pour into the crust mixture and stir until combined.",
    "Turn the crust mixture out onto a floured surface and gather it into a large ball. You may need to kneed it lightly just to get all the dry crumbs to incorporate into a ball.",
    "Divide the ball into two pieces. (Store the other ball in the refrigerator and use it for another yummy pie in the future!)",
    "Roll the dough out about 1/4 inch thick and then place it into a deep dish pie pan.",
    "Press the crust into place with your hands.",
    "Refrigerate until ready to use. You can brush it with egg whites to get that shiny crust if you'd like.",
    "To make the filling, place sweet potatoes in a large pot and fill with water just until it covers them.",
    "Bring to a boil and boil for 45 -50 minutes or until they are fork tender.",
    "When done, let cool and then remove the skin. It should peel off very easily.",
    "Place peeled sweet potatoes in a bowl and break it up with a fork.",
    "Use a mixer to mix the sweet potatoes until smooth and creamy.",
    "Add in butter and mix to combine.",
    "Add in sugars, milk, eggs, nutmeg, cinnamon, ginger, vanilla, and flour. Beat until mixture is smooth. It may be a little speckled, don't worry it won't be that way when it's done.",
    "Pour into prepared pie crust and bake for 55-60 minutes. (don't be alarmed if the pie puffs up while cooking. It will sink down)",
    "Let cool on the counter for about 30 minutes and then chill in the refrigerator for at least 3 hours to fully set."
  ],
  "ingredients": [
    "0",
    "The Crust makes two pie crust",
    "4 cups all-purpose flour",
    "1 ¾ cups butter flavored shortening",
    "3 tablespoons granulated sugar",
    "2 teaspoons salt",
    "1 egg",
    "1/2 cup ice water",
    "The Sweet Potato Filling",
    "2 cups sweet potatoes 2 medium sweet potatoes usually does it. I always have a bit extra left",
    "1/2 cup butter",
    "1/2 cup white sugar",
    "1/2 cup brown sugar",
    "1/2 cup evaporated milk",
    "2 eggs",
    "1/2 teaspoon ground nutmeg",
    "1/2 teaspoon ground cinnamon",
    "1/4 teaspoons ginger",
    "1 Tablespoon flour",
    "1 teaspoon vanilla extract"
  ],
  "__v": 1
}