{
  "hash": "da53aa99830b42010f5c24409ac77892c419d405",
  "title": "18th century fried chicken. 10/10 would recommend.",
  "image": "https://i.redditmedia.com/zfsSdYmmoWRF_hCoMoxX5pJl29Z2GmRi4xRh1STDJWA.jpg?w=1024&s=984c01bcf9258083811a67eb0a397825",
  "href": "https://www.reddit.com/r/food/comments/4p8dw5/we_tried_18th_century_fried_chicken_1010_would/",
  "extension": "Chrome",
  "firstAdded": "2016-06-23T15:01:10.529000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Add flour to a medium bowl. While stirring (with a stick or other utensil) add the white wine until the batter reaches the consistency of thin pancake batter. Then, add the egg yolks and salt to the bowl. Mix well, and feel free to add more wine if necessary to ensure the batter keeps the same consistency as before.",
    "Frying",
    "In a deep pot heat your oil of choice to its appropriate temperature for frying. For a more traditional experience, use lard or clarified butter, and potentially an open fire.",
    "Take your pieces of chicken from the marinade, dip and completely cover them in the batter mixture, then slowly submerge them in the oil with tongs. To keep the oil at a high temperature, and for safety, fry the chicken pieces in batches until the outside is crispy and \"mahogany brown.\" While the last batch is frying, add fresh (but very well dried off) parsley to the oil. Cook the parsley for several minutes until crispy, and crumble over the fried chicken when cooled."
  ],
  "ingredients": [
    "0",
    "Marinade",
    "* The juice of two large, fresh lemons (approx. 1/2 cup or 120 ml)",
    "* Approx. 1/2 cup (120 ml) of vertjus or malt vinegar (cider vinegar also works)",
    "* 2 dried bay leaves (use only 1 if using fresh leaves)",
    "* 1 tsp (4 g) of salt",
    "* 1 tsp (4 g) of pepper",
    "* 1/4 tsp (1 g) of ground cloves",
    "* 1/2 cup (75 g) chopped green onions (or potentially shallots if you want)",
    "Depending on the amount of chicken you are frying, you may want to double or even triple this part of the recipe. Add all ingredients to a medium bowl, mix well. Then add your chicken pieces (ensuring they are well covered) and let sit for 3 hours in the refrigerator.",
    "Batter",
    "* 1 1/2 cup (180 g) all-purpose flour",
    "* White wine (cider or water are also appropriate)",
    "* Yolks of 3 eggs",
    "* 1 tsp (4 g) of salt"
  ],
  "__v": 1
}