{
  "hash": "5ef7aa214bdbe31876dbc46a700dcf1800109810",
  "title": "\"Zoodle\" (Zucchini Noodle) Shrimp Scampi",
  "image": "",
  "href": "http://www.food.com/recipe/quot-zoodle-quot-zucchini-noodle-shrimp-scampi-523307",
  "extension": "Chrome",
  "firstAdded": "2015-10-06T04:02:23.607000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "shelled",
    "jumbo",
    "shrimp",
    "used",
    "garlic",
    "red",
    "pepper",
    "vary",
    "according",
    "spicy",
    "salt",
    "black",
    "white",
    "wine",
    "lemon",
    "juice",
    "squeezed",
    "medium",
    "zucchini",
    "spiralized",
    "use",
    "veggiepasta",
    "blade",
    "spiralizer",
    "amazon",
    "parsley",
    "garnishing"
  ],
  "directions": [
    "0",
    "Place a large saute pan over low-medium heat and add olive oil. Heat for 1 minute.",
    "Add garlic and crushed red pepper flakes and cook for 1 minute, constantly stirring.",
    "Add shrimp, and cook thoroughly (all sides should turn pink when cooked), about 3 minutes. Continue to stir as needed.",
    "Season the shrimp with the salt and black pepper. (I added some cayenne pepper at this point. I LOVE spicy food!).",
    "Using a slotted spoon, transfer the prepped shrimp to a bowl, leaving any liquid in the pan.",
    "Increase the heat to medium, and then add the white wine (if using), and the lemon juice. Scrape any brown bits from the bottom and sides of the pan and cook for 2 minutes.",
    "Add the Zoodles and cook for another 2 minutes, occasionally stirring.",
    "Add the shrimp and toss to combine.",
    "Garnish with parsley and serve immediately. Enjoy your nom nom!"
  ],
  "ingredients": [
    "0",
    "2 tablespoons olive oil",
    "1 lb shelled deveined jumbo shrimp (I used 31-30ct)",
    "1 tablespoon minced garlic",
    "1⁄4-1⁄2 tablespoon crushed red pepper flakes (vary according your taste for spicy)",
    "1⁄8-1⁄4 teaspoon salt (vary according to your taste)",
    "1⁄8 teaspoon black pepper (optional)",
    "1⁄4 cup white wine (optional)",
    "2 tablespoons lemon juice, freshly squeezed",
    "2 medium zucchini, spiralized (I use the VeggiePasta 4-blade Spiralizer. You can get it off Amazon)",
    "1 tablespoon chopped parsley (for garnishing)"
  ],
  "__v": 1
}