{
  "hash": "c18125ae01f3f40c74adff8fdb4facb6c973a6c5",
  "title": "Lemony Chicken Soup With Fennel and Dill",
  "image": "https://static01.nyt.com/images/2019/11/11/dining/06romanrex-1/06romanrex-1-articleLarge.jpg",
  "href": "https://cooking.nytimes.com/recipes/1020049-lemony-chicken-soup-with-fennel-and-dill?te=1&nl=cooking&emc=edit_fwd_20191108?campaign_id=90&instance_id=13730&segment_id=18647&user_id=4264688f24592aeeb06433e5d96d7150&regi_id=7985911420191108",
  "extension": "Firefox",
  "firstAdded": "2019-11-24T19:08:13.807000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Season chicken with salt and pepper. Heat 2 tablespoons olive oil in a large Dutch oven or heavy-bottomed pot over medium-high heat.",
    "Working in batches, add chicken, skin-side down, and cook until skin is well browned and fat has started to render, 5 to 8 minutes. Using tongs, flip chicken and continue to cook until well browned, another 3 to 5 minutes. Leaving all the fat and drippings behind, transfer chicken to a rimmed baking sheet, a large plate or a cutting board and let rest.",
    "Meanwhile, if you’ve got the top of the fennel bulb, thinly slice it, fronds and all; set aside.",
    "Coarsely chop the white part of the fennel bulb and add to the pot along with the garlic and onion. Season with salt and pepper and cook, stirring occasionally, until the vegetables have softened but not yet browned, 5 to 8 minutes. Add potatoes, chopped lemon and chiles, and stir to coat.",
    "Return chicken to the pot and add broth, seasoning with salt and pepper. Bring to a simmer and place the lid on the pot. Reduce heat to medium-low and continue to cook at a strong simmer until chicken is cooked through and nearly falling off the bone, 20 to 25 minutes. Using tongs, remove chicken and let rest until it’s cool enough to handle. Pick the meat from the chicken, removing any cartilage, skin and bones. (Alternatively, leave the chicken pieces intact and serve that way.)",
    "Return meat to the pot along with the thinly sliced fennel top, if using. Season the soup with salt and pepper, turn the heat to medium-low and continue to gently simmer while you make the toasted fennel seed topping.",
    "Heat remaining 4 tablespoons olive oil in a small pot or skillet over medium. Add fennel seed and half of the fresh dill, and swirl until fennel seed is toasted and dill is sizzling and crispy, about 2 minutes.",
    "Divide soup among bowls, and spoon fennel seed topping over it, followed by scallions and remaining fresh dill. Add a dollop of yogurt or sour cream (or crumbles of feta) and sprinkle with sumac, if you like. Zest the remaining lemon over the bowls, then cut lemon in half to squeeze juice over them too."
  ],
  "ingredients": [
    "0",
    "2 to 3 pounds bone-in, skin-on chicken legs, thighs, drumsticks or a mix",
    "Kosher salt and black pepper",
    "6 tablespoons olive oil",
    "1 large fennel bulb (preferably with the top on)",
    "4 garlic cloves, thinly sliced",
    "1 large yellow onion, coarsely chopped",
    "1 pound small potatoes, sliced about 1/4-inch thick",
    "1 lemon, coarsely chopped (discard the seeds), plus 1 additional lemon for zesting and juicing",
    "4 dried chiles de árbol or 1/2 teaspoon red-pepper flakes (optional)",
    "6 cups chicken or vegetable broth",
    "1 tablespoon fennel seed",
    "1 cup dill, coarsely chopped",
    "Scallions, thinly sliced",
    "Sour cream, full-fat Greek yogurt or feta (optional)",
    "Sumac (optional)"
  ],
  "__v": 2
}