{
  "hash": "2b8e9b16a4afd320da6539174484bde70c1aec2f",
  "title": "Sticky's Finger Joint's Latke Chicken Fingers",
  "image": "http://a.abcnews.com/images/Lifestyle/ht_latke_chicken_fingers_stickys_mt_141216_4x3t_384.jpg",
  "href": "http://abcnews.go.com/GMA/recipe/latke-chicken-fingers-recipe-stickys-finger-joint-27636287?nwltr=GMAR_tryPic_pos6",
  "firstAdded": "2014-12-19T20:03:07.254000",
  "users": [
    null
  ],
  "keywords": [
    "boneless",
    "chicken",
    "breast",
    "pieces",
    "buttermilk",
    "water",
    "lemon",
    "squeeze",
    "apple",
    "puree",
    "onion",
    "kosher",
    "salt",
    "freshground",
    "black",
    "pepper",
    "allpurpose",
    "flour",
    "eggs",
    "matzo",
    "meal",
    "panko",
    "bread",
    "crumbs",
    "russet",
    "sub",
    "crunchy",
    "potato",
    "stix",
    "instant",
    "mashed",
    "potatoes",
    "oil",
    "frying"
  ],
  "directions": [
    "0",
    "Cooking Directions",
    "Combine buttermilk, apple sauce, onion puree, 1 teaspoon kosher salt and 1/2 teaspoon fresh ground black pepper and marinade chicken in mixture in a plastic bag in refrigerator as little as 4 hours or ideally overnight. Do not leave chicken in marinade for more then 24 hours.",
    "Put 1 cup all-purpose flour in a shallow pan or plate. In separate bowl, beat 2 large eggs for the egg wash. Combine matzo meal, 1 teaspoon kosher salt, 1 teaspoon onion powder, 1/2 teaspoon fresh ground black pepper and the potatoes on a plate or in shallow pan.",
    "Take the chicken out of the refrigerator and pat dry on paper towels. Dispose of the remaining liquid. Take pat dried chicken and coat in the flour. Next coat in egg wash, then potato mixture. Let coated finger sit for 10-15 min in the fridge. Clean and sanitize working area and wash your hands.",
    "Heat enough oil to semi cover the surface of a pan on medium high flame. Cook the finger for 5-6 minutes on each side (depending on thickness). Let sit for 10 minutes before serving. You can also keep this in a warm oven for up to an hour before serving.",
    "Serve with sour cream, apple sauce or any sauce that tickles your tastebuds.",
    "Recipe Summary",
    "Main Ingredients: chicken breast, buttermilk, apple sauce, eggs, flour, onion, potatoes",
    "Course: Main Course"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 pound boneless chicken breast cut into 1.5-2 ounce pieces",
    "2 cups buttermilk (or 2 cups of water with half a lemon squeeze)",
    "1/4 cup apple sauce",
    "1/4 cup of onion puree (1 small onion)",
    "2 teaspoon kosher salt",
    "1 teaspoon fresh-ground black pepper",
    "1 cup all-purpose flour",
    "2 large eggs",
    "2 cups Matzo Meal or Panko bread crumbs",
    "1 teaspoon onion powder",
    "4 cups of peeled, shredded and blanched russet potatoes (you can sub this out with 3 cups crunchy potato stix and 1 cup instant mashed potatoes)",
    "Oil for frying"
  ],
  "__v": 1
}