{
  "hash": "3785b92d220977a60cd83da7ce0a0807cd34326d",
  "title": "The Real Mushroom Soup",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/619_1_1421761551_lrg.jpg",
  "href": "http://www.jamieoliver.com/recipes/vegetables-recipes/the-real-mushroom-soup/",
  "extension": "",
  "firstAdded": "2015-03-14T07:18:45.851000",
  "users": [
    null
  ],
  "keywords": [
    "porcini",
    "olive",
    "oil",
    "mixed",
    "wild",
    "mushrooms",
    "chanterelles",
    "girolles",
    "trompettes",
    "mort",
    "shiitake",
    "oyster",
    "clean",
    "garlic",
    "red",
    "onion",
    "thyme",
    "leaves",
    "picked",
    "salt",
    "black",
    "pepper",
    "litre",
    "organic",
    "chicken",
    "stock",
    "flatleaf",
    "parsley",
    "roughly",
    "mascarpone",
    "cheese",
    "lemon",
    "truffle"
  ],
  "directions": [
    "0",
    "Get a large casserole-type pan nice and hot, then add a good couple of lugs of olive oil and your fresh mushrooms.",
    "Stir around very quickly for a minute, then add your garlic, onion and thyme and a small amount of seasoning.",
    "After about a minute you'll probably notice moisture cooking out of the mushrooms. Carry on cooking for about 20 minutes until most of the moisture disappears.",
    "Season to taste, and add your stock. Bring to the boil and simmer for around 20 minutes. I usually remove half the soup from the pan and whiz it up to a purée at this point, then pour it back in, adding the parsley and mascarpone, and seasoning carefully to taste.",
    "You can serve this soup as you like, but there are a few things to remember when finishing it off. Mix together a pinch of salt and pepper with the zest of one lemon and the juice of half of it, then spoon a little of this into the middle of the soup. When you go to eat it, stir it in and it gives a wonderful flavour. Other things you can consider are little slices of grilled crostini put into the bottom of the bowls before the soup is poured over. Or you could even quickly fry some nice-looking mushrooms – like girolles, chanterelles or oysters – and sprinkle these on top of the soup. If I was going to use truffle oil, then I would use it on its own – a few drips on the top just before serving."
  ],
  "ingredients": [
    "0",
    "1 small handful dried porcini",
    "olive oil",
    "600 g mixed fresh wild mushrooms (chanterelles, girolles, trompettes de mort, shiitake, oyster), clean and sliced",
    "2 cloves garlic, peeled and finely sliced",
    "1 red onion, peeled and finely chopped",
    "1 handful fresh thyme, leaves picked",
    "sea salt",
    "freshly ground black pepper",
    "1 litre organic chicken or vegetable stock",
    "1 handful fresh flat-leaf parsley, leaves picked and roughly chopped",
    "1 tablespoon mascarpone cheese",
    "1 lemon",
    "truffle oil, optional"
  ],
  "__v": 3
}