{
  "hash": "1f77a089b32f5fc70d922683315e005f123511d8",
  "title": "Lasagne alla Bolognese",
  "image": "http://www.giallozafferano.it/images/ricette/1/118/foto_hd/hd450x300.jpg",
  "href": "http://ricette.giallozafferano.it/Lasagne-alla-Bolognese.html",
  "extension": "Chrome",
  "firstAdded": "2016-08-12T09:19:02.474000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Per preparare le lasagne alla bolognese cominciate con la preparazione del ragù che necessità di lunghi tempi di cottura. Tritate finemente la cipolla, la carota e il sedano aiutandovi con un coltello oppure tritando con il mixer (. Fate scaldare in un tegame l’olio e aggiungete le verdure tritate. Lasciatele rosolare a fuoco basso per almeno 20 minuti fino a che il soffritto risulterà completamente asciutto. Poi aggiungete la pancetta trita di maiale (2) e quella di manzo (3).",
    "Fate rosolare la carne, mescolando con un cucchiaio di legno (4) per cuocere in maniera uniforme ed evitare che si attacchi al fondo del tegame. Quando la carne risulterà ben rosolata ed asciutta, aggiungete il vino bianco (5) e lasciate sfumare fino a completa evaporazione. Dopodiché versate anche la passata di pomodoro (6).",
    "A questo punto aggiungete l’acqua (7), mescolate bene tutti gli ingredienti e lasciate cuocere per almeno 2 ore: se in cottura il ragù dovesse asciugarsi troppo, aggiungete dell’altra acqua: è importante però che a cottura ultimata il ragù sia ben asciutto. Aggiustate poi di sale e pepe (8). Quando il ragù sarà quasi pronto e rappreso, aggiungete il latte (9) che consente di attenuare il sentore acido del pomodoro e continuate a mescolare gli ingredienti per amalgamarli. Terminate la cottura, spegnete il fuoco e tenete il ragù da parte.",
    "Procedete dunque alla preparazione della besciamella: prendete un pentolino e fate a scaldare il latte. Nel frattempo in un altro tegame sciogliete i pezzetti di burro a fuoco basso (10) e, quando sarà sciolto, toglietelo dal fuoco ed aggiungetevi la farina setacciata (11). Mescolate energicamente con la frusta (12) per ottenere un composto senza grumi (il roux). Quindi rimettete il pentolino sul fuoco, per dorarlo leggermente.",
    "Quando il latte sarà caldo, aromatizzatelo con la noce moscata grattugiata (13) e un pizzico di sale. A questo punto potete unirlo al composto di burro e farina (14). Mescolate energicamente gli ingredienti con una frusta a mano e fate addensare a fuoco dolce (1: il composto deve risultare omogeneo e senza grumi. Cuocete la besciamella per circa 5-6 minuti a fuoco dolce, fino a quando non sarà cremosa.",
    "Dopodiché passate alla composizione delle lasagne: prendete una teglia o una pirofila rettangolare dalle dimensioni di 30x20 cm. Distribuite un filo di besciamella sulla teglia in modo uniforme su tutta la superficie (1, poi adagiate le lasagne verdi agli spinaci (17) e versate nuovamente un sottile strato di besciamella (18).",
    "Distribuite ora il ragù e il formaggio grattugiato (19) avendo cura di coprire tutta la superficie della teglia. Create quindi un altro strato di lasagne verdi, questa volta disponendole nel senso opposto rispetto al primo strato in modo che risultino incrociate (20). Quindi procedete creando un nuovo strato di besciamella (21). Abbiate cura di distribuirla su tutta la superficie della teglia.",
    "Ripetete l'operazione, disponendo strati besciamella, di ragù (22) e parmigiano grattugiato(23), fino ad ottenere 6 strati. Terminate con lo strato di ragù e una spolverata di abbondante formaggio grattugiato. Una volta terminata la preparazione della teglia, cuocete in forno statico preriscaldato a 200° per circa 25 minuti (oppure in forno ventilato a 180° per 15 minuti): le lasagne saranno pronte quando vedrete una leggera crosticina dorata in superficie. Sfornatele e lasciatele intiepidire prima di portare in tavola e gustare le vostre lasagne alla bolognese (24)!"
  ],
  "ingredients": [
    "0",
    "21 sfoglie lasagne all'uovo",
    "250g parmigiano reggiano grattugiato",
    "Per il ragu:",
    "50g carote",
    "60 g cipolle",
    "50 g sedano",
    "500 g pancetta fresca tritata di maiale",
    "500 g carne bovina polpa di manzo tritata",
    "250 g passata di pomodoro",
    "50 g latte latte fresco intero",
    "20 g olio di oliva",
    "sale q.b.",
    "pepe a piacere",
    "150g vino bianco",
    "Per la besciamella:",
    "1 l latte fresco intero",
    "100 g burro",
    "80 g farina",
    "noce moscata a piacere",
    "sale un pizzico",
    "pepe a piacere"
  ],
  "__v": 2
}