{
  "hash": "32e2ba4ff8973b8bedc82aab5807087e075ac9ec",
  "title": "Texas Chicken Hash",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2009/11/1/0/DV0702_Texas-Chicken-Hash_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/texas-chicken-hash-recipe.html",
  "firstAdded": "2015-01-24T19:32:15.572000",
  "users": [
    null
  ],
  "keywords": [
    "boneless",
    "chicken",
    "breasts",
    "chili",
    "garlic",
    "black",
    "pepper",
    "potatoes",
    "butter",
    "divided",
    "green",
    "red",
    "bell",
    "peppers",
    "onions",
    "oil",
    "deepfrying",
    "frying",
    "eggs",
    "corn",
    "tortillas",
    "allpurpose",
    "flour",
    "milk",
    "habenero",
    "cheese",
    "tony",
    "chacheres",
    "seasoning",
    "avocado",
    "slices",
    "tomato"
  ],
  "directions": [
    "0",
    "Preheat the oven to 350 degrees F.",
    "Season the chicken with garlic powder, chili powder, and black pepper. Put into a roasting pan and cover with foil. Roast the chicken until cooked through, about 45 minutes. Remove to a cutting board and chop.",
    "Add the potatoes and 1/2 stick of butter to a medium skillet and saute until tender. Remove from the pan and set aside. Add the green bell peppers and onions to the pan and saute until soft but not mushy!",
    "Heat a deep-fryer with oil and fry the tortillas until crispy. Transfer the tortillas to paper towels to drain.",
    "In a large saucepan add the flour and the remaining 1/2 stick of butter and cook the flour for 5 minutes, stirring constantly. Slowly add the milk and cook until slightly thick. Add the chopped red bell peppers and the habenero. Stir in the grated cheese and cook until melted.",
    "Coat a large fry pan with oil and add the eggs. Cook the eggs sunny side up.",
    "In a large pot over low heat, add the potatoes, bell pepper mixture and the chopped chicken. Season with Tony Chachere's seasoning, to taste. Stir the potato mixture until heated through.",
    "Put 4 tortillas on a plate in stacks of 2. Spoon some of the chicken mixture on top of both stacks. Top each stack with 1 sunny side up egg and drizzle with the cheese sauce, to taste. Repeat the process with the remaining tortillas, eggs and cheese. Garnish each plate with avocado and tomato slices.",
    "Serve immediately.",
    "This recipe was provided by professional chefs and has been scaled down from a bulk recipe provided by a restaurant. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results.",
    "Recipe courtesy Edith Lankford Prior owner of Lankford Grocery in Houston, TX."
  ],
  "ingredients": [
    "0",
    "4 boneless chicken breasts",
    "Chili powder",
    "Garlic powder",
    "Ground black pepper",
    "4 potatoes, diced",
    "1 stick butter, divided",
    "6 green bell peppers, chopped, plus 2 red bell peppers, chopped",
    "4 onions, chopped",
    "Oil, for deep-frying, plus more for frying eggs",
    "16 corn tortillas",
    "1 cup all-purpose flour",
    "3 cups milk",
    "1 habenero pepper, chopped",
    "4 cups grated cheese, any cheese of choice",
    "8 eggs",
    "Tony Chachere's seasoning, to taste",
    "Avocado slices, for garnish",
    "Tomato slices, for garnish"
  ],
  "__v": 1
}