{
  "hash": "e6a058d9ca333d583f4f4d3779f66d67b3f92d7e",
  "title": "Shrimp Mushroom Fettuccini",
  "image": "http://img.sndimg.com/food/image/upload/w_614,h_461,c_fit/v1/img/submissions/recipe/0/8eMLVw2PR5CjP8GOpHxT_shrimpmushroomfetticcini.jpg",
  "href": "http://www.food.com/recipe/shrimp-mushroom-fettuccini-523680",
  "extension": "Chrome",
  "firstAdded": "2015-10-06T03:04:48.016000",
  "users": [
    null
  ],
  "keywords": [
    "fettuccine",
    "pasta",
    "olive",
    "oil",
    "shrimp",
    "raw",
    "cleaned",
    "garlic",
    "basil",
    "red",
    "pepper",
    "paprika",
    "mushrooms",
    "halfandhalf",
    "parmesan",
    "cheese",
    "mozzarella"
  ],
  "directions": [
    "0",
    "Cook fettuccini according to package instructions. Drain and rinse with cold water. Set aside.",
    "Heat 2 tablespoons of the olive oil in a large skillet over medium heat until hot. Add shrimp; cook on one side for 1-2 minutes until pink. Flip the shrimp to the other side; sprinkle the top of cooked side of shrimp with basil, pepper flakes and paprika. Add garlic and cook until shrimp is pink on both sides, about1-2 minutes. Remove the shrimp from skillet and sprinkle with remaining seasonings. It’s ok if the shrimp is a little undercooked; it will finish cooking in the sauce. Add 1 Tblsp olive oil, red peppers, onions and the sliced mushrooms to the same skillet. Cook on medium-high heat for about 5 minutes, stirring as needed, until peppers, onions and mushrooms become soft. Add cooked shrimp, and immediately add 1 ½ cup half and half and all of the cheese. Bring to a boil, stirring constantly; reduce to simmer and cook, stirring as needed, until all cheese melts. Add pasta to the skillet with shrimp and mushrooms and cream sauce; stir well. If needed, add the additional ½ cup of the milk as pasta heats. Serve and enjoy."
  ],
  "ingredients": [
    "0",
    "8 ounces fettuccine pasta",
    "3 tablespoons olive oil",
    "1 lb fresh shrimp, raw and cleaned",
    "3 teaspoons minced garlic",
    "1⁄2 teaspoon dried basil",
    "1⁄2 teaspoon crushed red pepper flakes",
    "1⁄4 teaspoon paprika",
    "8 ounces mushrooms, thinly sliced",
    "1 1⁄2-2 cups half-and-half",
    "1⁄2 cup grated parmesan cheese",
    "3⁄4 cup shredded mozzarella cheese"
  ],
  "__v": 1
}