{
  "hash": "cdbf8ba28914ac39baa8adadd3e5492592f4c067",
  "title": "Authentic Bolognese Sauce",
  "image": "http://i2.wp.com/foodnouveau.com/wp-content/uploads/2010/09/IMG_6058.jpg?resize=535%2C695",
  "href": "http://foodnouveau.com/destinations/europe/italy/how-to-make-an-authentic-bolognese-sauce/",
  "extension": "Chrome",
  "firstAdded": "2016-01-21T09:42:36.129000",
  "users": [
    null
  ],
  "keywords": [
    "makes",
    "servings",
    "olive",
    "oil",
    "butter",
    "yellow",
    "onion",
    "evenly",
    "carrots",
    "heart",
    "celery",
    "stalks",
    "garlic",
    "pancetta",
    "cubes",
    "kosher",
    "salt",
    "black",
    "pepper",
    "lean",
    "meat",
    "blend",
    "veal",
    "pork",
    "beef",
    "dry",
    "white",
    "wine",
    "chardonnay",
    "milk",
    "san",
    "marzano",
    "tomatoes",
    "stock"
  ],
  "directions": [
    "0",
    "Heat the butter and the oil together in a large saucepan over medium heat. When the butter is melted and the saucepan is hot, add the onion, carrot, celery, garlic and a good pinch of salt (about ½ tsp [2.5 ml]) and sauté for 5 minutes, stirring often. Add the diced pancetta and cook for a further 10 minutes, until vegetables are softened and pancetta is golden.",
    "Finely dice the onion, carrot and celery to make a basic soffritto – and to end up with a better sauce texture too.",
    "Increase the heat to high and add the meat a third at a time, stirring and breaking lumps with a spoon between each addition. Adding the meat gradually allows its liquid to evaporate – which is key if you want to brown your meat and not boil it. After the last addition, when no pink can be spotted in the meat and no lumps remain, set a timer to 15 minutes. You want your meat to caramelize and even become crispy in spots. More liquids will evaporate and flavors will concentrate. You want golden bits of meat to stick to the bottom of your pan, which will be deglazed later. Watch over your pan as you don’t want the meat to burn. When you see some serious caramelization action happening, lower heat to medium to reach the end of the 15-minute sautéing time (on my stove, that’s after 8-9 minutes).",
    "Left: sauteed vegetables and pancetta; Right: caramelized bottom of pan before deglazing with white wine.",
    "Over medium heat, pour the white wine into the sauce pan. With a wooden spoon, scrape all the brown bits stuck to the bottom of the pan. Push the meat all around to make sure you scrape it all off. By the time you’re finished, the wine will be evaporated (2-3 minutes). Be careful not to let the meat stick again (lower the heat if necessary).",
    "Add milk, diced tomatoes and their liquid, beef stock, 1 tsp [5 ml] salt and a good grinding of black pepper. Bring to a boil and then lower to the lowest heat and let simmer very slowly, half-covered, for 4 hours. Stir once in a while. If your sauce starts sticking before the end of your cooking time, lower the heat (if possible) and/or add a bit of stock or water. In the end, the sauce should be thick, more oil- than water-based and thick like oatmeal. Adjust the seasoning one last time – don’t be afraid of adding more salt (tasting each time you add some), it is this recipe’s key seasoning.",
    "Simmer the bolognese sauce very slowly, half-covered, for 4 hours on the lowest heat possible.",
    "To serve: Reheat the sauce. Mix in a knob or two of butter and about two generous tablespoons [30 ml] of freshly grated parmigiano-reggiano per serving – these last additions will produce an incredibly creamy flavor. Cook the pasta, drain it thoroughly and return to the pot. Spoon some sauce, just enough to coat the pasta. Serve in bowls with a few leaves of basil sprinkled on top and more freshly grated parmigiano-reggiano, to taste."
  ],
  "ingredients": [
    "0",
    "Makes about 8 servings",
    "2 tbsp [30 ml] olive oil",
    "¼ cup [60 ml] butter",
    "1 large yellow onion, finely and evenly diced",
    "4 small (or 2 very large) carrots finely diced",
    "4 stalks celery heart (or 2 large celery stalks) finely diced",
    "4 garlic cloves, very finely diced",
    "4.5 oz [125 g] diced pancetta (¼-inch cubes)",
    "Kosher or sea salt",
    "Freshly ground black pepper",
    "2.2 lb [1 kg] lean ground meat (blend of veal, pork and beef – or just beef)",
    "1 cup [250 ml] dry white wine (like a Chardonnay)",
    "2 cups [500 ml] milk",
    "1 28-oz [828 ml] can whole San Marzano tomatoes, diced (both the liquid and the tomatoes)",
    "1 cup [250 ml] beef stock"
  ],
  "__v": 1
}