{
  "hash": "13db39fae0ec2cf90df74f4f422b7feb176a573c",
  "title": "No-Knead Dutch Oven Bread Recipe",
  "image": "https://opimedia.azureedge.net/-/media/images/men/editorial/articles/magazine-articles/2007/12-01/no-knead-dutch-oven-bread-recipe/no-knead-dutch-oven-bread-recipe-jpg.jpg",
  "href": "https://www.motherearthnews.com/real-food/no-knead-dutch-oven-bread-recipe-zmaz07djzgoe",
  "extension": "Chrome",
  "firstAdded": "2020-05-29T18:35:47.313000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large bowl, dissolve yeast in water. Add the flour and salt, stirring until blended. The dough will be shaggy and sticky. Cover bowl with plastic wrap. Let the dough rest at least 8 hours, preferably 12 to 18, at warm room temperature, about 70 degrees.",
    "The dough is ready when its surface is dotted with bubbles. Lightly flour a work surface and place dough on it. Sprinkle it with a little more flour and fold it over on itself once or twice. Cover loosely with plastic wrap and let it rest for about 15 minutes.",
    "Using just enough flour to keep the dough from sticking to the work surface or to your fingers, gently shape it into a ball. Generously coat a clean dish towel with flour, wheat bran or cornmeal. Put the seam side of the dough down on the towel and dust with more flour, bran or cornmeal. Cover with another towel and let rise for about 1 to 2 hours. When it’s ready, the dough will have doubled in size and will not readily spring back when poked with a finger.",
    "At least 20 minutes before the dough is ready, heat oven to 475 degrees. Put a 6- to 8-quart heavy covered pot (cast iron, enamel, Pyrex or ceramic) in the oven as it heats. When the dough is ready, carefully remove the pot from the oven and lift off the lid. Slide your hand under the towel and turn the dough over into the pot, seam side up. The dough will lose its shape a bit in the process, but that’s OK. Give the pan a firm shake or two to help distribute the dough evenly, but don’t worry if it’s not perfect; it will straighten out as it bakes.",
    "Cover and bake for 30 minutes. Remove the lid and bake another 15 to 20 minutes, until the loaf is beautifully browned. Remove the bread from the Dutch oven and let it cool on a rack for at least 1 hour before slicing."
  ],
  "ingredients": [
    "0",
    "1/4 tsp active dry yeast",
    "1-1/2 cups warm water",
    "3 cups all-purpose flour, plus more for dusting. You may use white, whole wheat or a combination of the two.",
    "1-1/2 tsp salt",
    "Cornmeal or wheat bran for dusting"
  ],
  "__v": 1
}