{
  "hash": "cd2136e147d54c382801dc62d75af20a2fa3b149",
  "title": "Spiced Oatmeal Cookies",
  "image": "http://cookieandkate.com/images/2016/12/best-oatmeal-cookies-recipe-2.jpg",
  "href": "http://cookieandkate.com/2016/spiced-oatmeal-cookies-recipe/",
  "extension": "Chrome",
  "firstAdded": "2017-02-23T19:54:31.209000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 325°F. Line two cookie sheets with parchment paper, or lightly grease them.",
    "In a medium mixing bowl, combine the butter, coconut sugar and cane sugar. With a hand-held electric mixer or by hand, beat them together until they are fully incorporated and lighter in color.",
    "Add the egg and vanilla and beat well, until the mixture is light and fluffy. Add the cinnamon, nutmeg, baking soda, baking powder and salt, and blend until combined.",
    "Lastly, add the oats, oat flour and whole wheat flour. Blend on low speed until combined. Scrape the sides and bottom of the bowl with a spatula, and mix briefly to be sure it’s evenly blended.",
    "With a cookie dough scoop or two spoons, scoop about 1 tablespoon of dough at a time onto the prepared baking sheets, leaving at least 2 inches of space around each cookie.",
    "Bake the cookies for 12 to 13 minutes, until they're a light golden brown with slightly darker edges. Their middles may still look a tiny bit shiny; that's OK, they'll continue to bake as they cool on the pan.",
    "Remove the cookies from the oven, place the pan on a cooling rack, and let the cookies cool completely on the pan before handling (these cookies are delicate when warm). Repeat with any remaining cookies."
  ],
  "ingredients": [
    "0",
    "½ cup (1 stick/8 tablespoons) unsalted butter, softened*",
    "½ cup packed coconut sugar",
    "2 tablespoons sugar (I used organic cane sugar)",
    "1 large egg",
    "1½ teaspoons Frontier Co-Op vanilla extract",
    "1 teaspoon Frontier Co-op ground Ceylon cinnamon",
    "½ teaspoon Frontier Co-op ground nutmeg",
    "½ teaspoon baking soda",
    "¼ teaspoon baking powder",
    "¼ teaspoon fine sea salt",
    "1¾ cup old-fashioned oats",
    "⅓ cup oat flour**",
    "⅓ cup white whole wheat flour or regular whole wheat flour***"
  ],
  "__v": 1
}