{
  "hash": "615627b293c588fba60998a84fde582a53e5c5f8",
  "title": "Remy’s Ratatouille",
  "image": "http://www.fictionalfood.net/wp-content/gallery/sweethearts/thumbs/thumbs_you-love-me-cookie.jpg",
  "href": "http://www.fictionalfood.net/2011/09/remys-ratatouille/",
  "extension": "Chrome",
  "firstAdded": "2017-01-02T08:14:33.556000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat oven to 450 degrees. Place pepper halves on a foil-lined sheet, cut side down. Roast until skin loosens, about 15 minutes. Remove from heat and let rest until cool enough to handle. Peel and chop finely. This makes the piperade.",
    "Combine oil, garlic, and onion in medium skillet over low heat until very soft but not browned, about 8 minutes. Add tomatoes, their juices, thyme, parsley, and bay leaf. Simmer over low heat until very soft and very little liquid remains, about 10 minutes, do not brown; add peppers and simmer to soften them. Season to taste with salt, and discard herbs.",
    "Puree in a blender and spread on bottom of baking pan.",
    "Heat oven to 275 degrees. Using a mandoline, thinly slice the zucchini, yellow squash, eggplant, and tomatoes. Down center of the pan, arrange a strip of alternating slices of vegetables over piperade, overlapping so that 1/4 inch of each slice is exposed. Repeat until pan is filled; all vegetables may not be needed.",
    "Mix garlic, oil, and thyme leaves in bowl and season with salt and pepper to taste. Sprinkle over vegetables. Cover with parchment paper. Bake until vegetables are tender when tested with a paring knife, about 2 hours. Uncover and bake for 30 minutes more.",
    "For vinaigrette, combine 1 tbsp piperade, oil, vinegar, herbs, and salt and pepper to taste in a bowl. Drizzle vinaigrette around plate. Serve hot."
  ],
  "ingredients": [
    "0",
    "1 red pepper sliced in half, seeds and ribs removed",
    "1/2 yellow or orange pepper, seeds and ribs removed",
    "2 tablespoons extra virgin olive oil",
    "1 teaspoon minced garlic",
    "1/2 cup finely diced yellow onion",
    "3 tomatoes (about 12 ounces total weight), peeled, seeded, and finely diced, juices reserved",
    "2 sprigs thyme",
    "2 sprigs flat-leaf parsley",
    "1/2 a bay leaf",
    "Kosher salt",
    "1 zucchini",
    "1 summer squash",
    "1 eggplant",
    "3 roma tomatoes",
    "1/2 teaspoon minced garlic",
    "2 teaspoons olive oil",
    "1/8 teaspoon thyme leaves",
    "Kosher salt",
    "freshly ground black pepper",
    "1 tablespoon extra virgin olive oil",
    "1 teaspoon balsamic vinegar",
    "Assorted fresh herbs (thyme flowers, chervil, thyme)",
    "Kosher salt and freshly ground black pepper"
  ],
  "__v": 1
}