{
  "hash": "fac53ed23699a7ac906ee3314f003eb00609bffc",
  "title": "Sausage and Rice Casserole",
  "image": "http://3.bp.blogspot.com/-oX_KVjyqh64/Uwu7wFKfK7I/AAAAAAAARSg/zVCvw5-vErs/s1600/sausage+and+rice+casserole+2.jpg",
  "href": "http://www.southyourmouth.com/2014/02/sausage-and-rice-casserole.html",
  "extension": "Chrome",
  "firstAdded": "2017-05-29T11:24:45.190000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Brown and crumble sausage in a large skillet. When sausage is about half cooked, add onion, celery and red pepper flakes and continue cooking until sausage is no longer pink and veggies are starting to become translucent. If your sausage is particularly fatty, drain off some of the fat – mine wasn't so I didn't need to.",
    "Spray a medium-sized casserole dish with cooking spray or rub with butter. You don’t need anything as big as a 13x9 casserole. A 1.5 quart dish should do the trick. I used the precious red oval dish my friend Dawn left at my house. Yo, Dawn, good luck getting that one back, hooker! It’s my new favorite!",
    "In a separate bowl, whisk together broth and soup until smooth. Pour soup mixture and rice into skillet and stir until all ingredients are thoroughly incorporated. Pour into prepared casserole dish, cover tightly with aluminum foil and bake at 350 degrees for 1 hour. Remove casserole from oven and let rest, covered, for 10-15 minutes before serving.",
    "*You can use other creamed soup flavors but I highly encourage you to use Cream of Celery. I'd never used it before and really didn't know what to expect but I was genuinely impressed with it. And I'm not even a huge fan of celery! I picked it because I was already using chicken broth and I didn't want the dish to be too “chickeny” (now, there’s a word I never thought I’d use) but you can certainly use whichever soup suits your fancy. Also? I think I’m getting over my aversion to cream of whatever soups. Maybe they've just gotten better over years."
  ],
  "ingredients": [
    "0",
    "Sausage & Rice Casserole",
    "Recipe adapted from Paula Deen",
    "1 pound pork sausage (I used “hot”)",
    "1 medium onion, diced",
    "2-3 stalks celery, finely diced (about a cup and a half)",
    "1/4 teaspoon red pepper flakes (optional)",
    "1 14.5-ounce can chicken or vegetable broth (about 1 3/4 cups)",
    "1 can cream of celery soup*",
    "1 cup uncooked white rice"
  ],
  "__v": 1
}