{
  "__v": 1,
  "directions": [
    "0",
    "Heat the oven to 425 degrees.",
    "Put the squash and sliced onion on a rimmed baking sheet and toss with 2 tablespoons of the olive oil and a pinch of salt. Roast until tender and lightly browned, about 40 minutes, stirring once in the middle.",
    "Bring a large pot of water to a boil; add 1 or 2 tablespoons salt and the orecchiette; cook until al dente.",
    "While the pasta is cooking, place a large sauté pan over medium-high heat; when the pan is hot, add the ground pepper and toast until fragrant, about 1 minute. Add the butter and remaining 2 tablespoons olive oil. Stir together until the butter melts, then remove from the heat.",
    "Drain the pasta, reserving 3/4 cup of the cooking water in a heatproof measuring cup. Put the sauté pan over medium heat again. Add the pasta to the pan along with the squash, onion, and the pecorino; toss it all together. Add some of the reserved water, a few tablespoons at a time, until the cheese melts into a creamy sauce; you might not use it all.",
    "Stir the kale leaves and burrata into the hot pasta, and stir until the leaves are wilted. Serve with additional cheese on the side."
  ],
  "firstAdded": "2014-09-28T17:37:35.803000",
  "hash": "f070b6d348ab908a52724e7346b4437a2f5c96a9",
  "href": "http://www.thekitchykitchen.com/?recipes=/orecchiette-cacio-e-pepe-with-roasted-squash-kale-burrata/",
  "image": "http://www.thekitchykitchen.com/wp-content/uploads/2013/10/DSC_4624-620x930.jpg",
  "ingredients": [
    "0",
    "3 cups squash, peeled and cut into 1-inch pieces",
    "1 yellow onion, halved and sliced",
    "1/4 cup olive oil",
    "kosher or sea salt",
    "1/2 pound orecchiette pasta",
    "2 tablespoons butter",
    "1 teaspoon fresh cracked pepper",
    "3/4 cup grated Pecorino Romano cheese, plus additional for serving",
    "2 cup Tuscan kale leaves; torn or chopped into 1 inch pieces",
    "4 ounces burrata, roughly chopped"
  ],
  "keywords": [
    "squash",
    "pieces",
    "yellow",
    "onion",
    "olive",
    "oil",
    "kosher",
    "salt",
    "orecchiette",
    "pasta",
    "butter",
    "cracked",
    "pepper",
    "pecorino",
    "romano",
    "cheese",
    "tuscan",
    "kale",
    "leaves",
    "torn",
    "burrata",
    "roughly"
  ],
  "title": "Orecchiette Cacio e Pepe”",
  "users": [
    null
  ]
}