{
  "hash": "997b9f0d8a0f1c9b562e55fcb691dfc1f39c99d1",
  "title": "How To Make Braised Short Ribs",
  "image": "https://atmedia.imgix.net/569857c1676d0f5a77b9d286cf39b4035b4d409f?auto=format&q=45&w=600.0&h=800.0&fit=max&cs=strip",
  "href": "http://www.thekitchn.com/how-to-make-braised-short-ribs-105868",
  "extension": "Chrome",
  "firstAdded": "2017-10-07T19:59:18.009000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Salt and pepper the meat: Heat the oven to 325°F. Brush each short rib with vegetable oil, then sprinkle generously with salt and pepper.",
    "Sear the short ribs: Heat a deep, wide Dutch oven or sauté pan over medium high heat. Add the short ribs in one layer, leaving room between each (work in batches if necessary). Now would be a good moment to turn on your hood vent or fan, if you have one! Sear the short ribs without moving for several minutes on each side, letting them brown deeply. Use tongs to turn and sear all sides. This will take about 15 minutes total.",
    "Cook the onions: Turn the heat down to medium and add the onion and garlic around the browned short ribs. Let the onions sweat for about 5 minutes or until they soften.",
    "Add liquid: Add the liquid — beer, wine, or broth — and bring to a simmer.",
    "Bake in the oven: After the liquid comes to a simmer, add the herb sprigs, then cover the pan tightly. Put the covered pan in the oven. (Alternately, this is the point where you can transfer to the slow cooker for 8 hours on LOW, or continue cooking on very low heat on the stovetop.) Bake for 2 to 2 1/2 hours, or until the meat is very tender and coming away from the bone.",
    "Rest the meat: When the meat is done, rest in a covered pan for 20 minutes before serving. Serve by gently tugging the chunks of meat away from the bone and spooning the saucy onions over top.",
    "OPTIONAL STEP — Refrigerate overnight: While short ribs can be served immediately, they are a very fatty cut, which makes the dish very rich and even greasy. I prefer to refrigerate them overnight and then scrape away the hardened layer of fat from the top before serving. They will also improve in flavor and tenderness while resting overnight.",
    "Reheat: To reheat, cover and warm over low heat on the stove for 15 to 20 minutes.",
    "Recipe Notes",
    "Slow Cooker Instructions: To cook in the slow cooker, progress through step 4, then transfer the meat, onions, and liquid to a slow cooker insert. Cook on LOW for 8 hours.",
    "Stovetop Instructions: Instead of transferring the pan to the oven, you can also cook the short ribs on the stovetop. Keep the pan covered and cook over low heat for 2 to 3 hours, checking liquid levels intermittently and making sure the bottom isn't scorching.",
    "More Flavor Variations: This is of course just the most basic method. You can get creative by using a stronger spice rub, different kinds of beer (I like the slight bitterness an IPA provides) or red wine, or sherry. You can use soy sauce and mirin with Chinese five-spice; you could go Spanish with smoked paprika and Rioja."
  ],
  "ingredients": [
    "0",
    "3 pounds short ribs, bone-in",
    "2 tablespoons vegetable oil",
    "Salt and freshly ground black pepper",
    "1 large onion, sliced",
    "4 cloves garlic, minced",
    "3 cups liquid, such as beer, wine, or broth",
    "2 to 4 sprigs fresh herbs, such as rosemary or thyme"
  ],
  "__v": 3
}