{
  "hash": "31ca07307b39f7e9d1d76c5258625d454b3e403f",
  "title": "Raw Raspberry Chocolates",
  "image": "http://gourmandeinthekitchen.com/wp-content/uploads/2014/12/How-to-Make-Raw-Raspberry-Chocolates-gourmandeinthekitchen.com_.jpg?c3c4ca",
  "href": "http://gourmandeinthekitchen.com/2014/raw-raspberry-chocolates/",
  "firstAdded": "2015-02-09T22:04:39.332000",
  "users": [
    null
  ],
  "keywords": [
    "raw",
    "cacao",
    "butter",
    "shaved",
    "cupml",
    "coconut",
    "nectar",
    "seeds",
    "scraped",
    "bean",
    "use",
    "vanilla",
    "httpamzntouqmqwq",
    "instead",
    "freeze",
    "raspberries",
    "coarse",
    "pink",
    "himalayan",
    "salt"
  ],
  "directions": [
    "0",
    "Place shaved cacao butter in a heat-proof glass bowl.",
    "Fill a small to medium saucepan with a couple inches of water and bring to a boil. Turn off and place the glass bowl with the cacao butter on top of the saucepan. (For a truly raw chocolates use an instant read thermometer to ensure that the temperature of the melting cacao butter does not go over 118 F.)",
    "Leave cacao butter to melt for a few minutes (this can take about 5 minutes or more). Once melted, whisk thoroughly and remove bowl from saucepan.",
    "Whisk in cacao powder until smooth, followed by the coconut nectar and vanilla bean seeds. Keep whisking for several minutes until smooth and the mixture had cooled and thickened slightly.",
    "Line a mini-cupcake tin with liners or use a chocolate mold. Spoon chocolate into each cup or mold about 2/3 full.",
    "Crush a few raspberries in the palm of your hand and place them in the center of each cup, pushing down lightly to submerge some of the pieces. Top with a pinch of salt and place in the freezer for fridge to set until firm (about 15 minutes in the freezer and 45 minutes in the fridge.",
    "Store refrigerated in an airtight container and serve at room temperature."
  ],
  "ingredients": [
    "0",
    "½ cup/ 112g raw cacao butter , finely shaved",
    "1 cup/ 80g raw cacao powder",
    "¼ cup/60ml raw coconut nectar",
    "Seeds scraped from ½ a vanilla bean or you can use [vanilla powder http://amzn.to/1uQmQWQ] instead but not extract.",
    "Freeze dried raspberries to top",
    "Coarse pink Himalayan salt to top"
  ],
  "__v": 1
}