{
  "hash": "64d2d9326b3d986838383ef491803536e3b5c22f",
  "title": "Hot, Salty & Sour: My Kimchi Recipe",
  "image": "http://nourishedkitchen.com/wp-content/uploads/2012/04/kimchi.jpg",
  "href": "http://nourishedkitchen.com/kimchi-recipe/",
  "extension": "Chrome",
  "firstAdded": "2015-06-28T09:07:35.860000",
  "users": [
    null
  ],
  "keywords": [
    "ginger",
    "chunks",
    "chili",
    "peppers",
    "trimmed",
    "stems",
    "seeded",
    "desired",
    "tbsps",
    "unrefined",
    "cane",
    "sugar",
    "chemicalfree",
    "fish",
    "salt",
    "divided",
    "heads",
    "napa",
    "cabbage",
    "lbs",
    "carrots",
    "scraped",
    "fingerlength",
    "daikon",
    "radish",
    "strips",
    "garlic"
  ],
  "directions": [
    "0",
    "Place ginger, chili peppers, sugar, fish sauce and 1 tbsp sea salt into a food processor. Process until you form a smooth paste.",
    "Place chopped cabbage into a large mixing bowl, sprinkle with remaining sea salt and cover with warm (not hot) water. Stir until sea salt dissolves and allow the cabbage to sit for twenty to thirty minutes. Drain the cabbage and pat it dry.",
    "Place the cabbage, carrots, radish and garlic in a large mixing bowl. Spoon in the chili and ginger paste you prepared in step #1 and toss to coat.",
    "Transfer the mixture, cup by cup, into a gallon-sized vegetable fermenter or fermentation crock (available here) and pound down with a wooden spoon until the vegetables release their juice. Continue layering and pounding until all the vegetables have been transferred to the crock. Pound again until the vegetables have released all their juice and the level of brine fully covers the vegetables and that the vegetables rest within one inch of the crock's lip.",
    "Weight the vegetables down with your crock's weight or a small sterilized stone, cover and ferment at room temperature for at least one week before trying the kimchi. If you prefer a sourer flavor, ferment longer. Transfer to the refrigerator when the kimchi has reached the desired level of sourness where it will keep for at least six months."
  ],
  "ingredients": [
    "0",
    "1/4 lb ginger (peeled and cut into chunks)",
    "1/4 lb fresh chili peppers (trimmed of stems, seeded if desired)",
    "2 tbsps whole, unrefined cane sugar (find it here)",
    "2 tbsps fish sauce (find chemical-free fish sauce here)",
    "1/4 cup unrefined sea salt (divided)",
    "2 large heads Napa cabbage (chopped into large chunks about 2 inches by 2 inches)",
    "1 1/2 lbs carrots (scraped and cut into finger-length sticks 1/4-inch thick)",
    "1 1/2 lbs daikon radish (scraped and cut into finger-length strips 1/4-inch thick)",
    "8 heads garlic (peeled and chopped)"
  ],
  "__v": 1
}