{
  "hash": "ddcd805dfea6041b5b72a900974f913dc6c25ba5",
  "title": "Garlic Herb Flatbread",
  "image": "https://minimalistbaker.com/wp-content/uploads/2015/10/EASY-Vegan-Flatbread-with-Garlic-and-Herbs-Perfect-for-wraps-dips-and-more-vegan-flatbread-bread-healthy-recipe-spelt.jpg",
  "href": "https://minimalistbaker.com/garlic-herb-flatbread/",
  "extension": "Firefox",
  "firstAdded": "2019-07-15T00:18:31.505000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To a large mixing bowl, add yeast, garlic, herbs, sea salt, organic cane sugar, all-purpose flour, and spelt flour and whisk.",
    "Make a well in the dry ingredients and add olive oil and two-thirds of the warm water to start (1/2 cup or 120 ml as original recipe is written // adjust if altering batch size). Stir with a wooden spoon to mix. Add more water as needed until a dough forms.",
    "Transfer to a clean, well-floured surface and knead until smooth and elastic - about 2 minutes - adding more flour as needed to prevent sticking.",
    "Wipe out mixing bowl and add a bit of oil (1 tsp as original recipe is written // adjust if altering batch size). Roll dough around to coat and position seam-side down in the bowl. Cover with a damp towel or plastic wrap. Set in a warm place to rise for 1 hour.",
    "Once doubled in size (see photo), cut dough into 6 even pieces (amount as original recipe is written // adjust if altering batch size), arrange on a clean surface, and lay a damp towel on top. Let rest.",
    "In the meantime, heat a large skillet (electric or cast iron) to medium-high heat (~375 degrees F/ 190 C).",
    "One at a time on a lightly floured surface, roll each piece of dough into a large circle that's fairly thin (not paper thin, but less than 1/8th inch thick - see photo).",
    "Lightly grease preheated skillet and lay down flatbread. Don’t touch, cook for 2 1/2 minutes. Flip and cook for 2 1/2 minutes on the other side. Repeat, adding more oil to coat surface, until all flatbread is cooked.",
    "Enjoy immediately, or let cool completely and store in a well-sealed bag or container up to 3 days (though best when fresh)."
  ],
  "ingredients": [
    "0",
    "1 packet active dry yeast (1 packet yields 2 1/4 tsp)",
    "2 cloves garlic, minced (2 cloves yield ~1 Tbsp or 6 g)",
    "1 Tbsp minced herbs (rosemary and thyme)",
    "3/4 tsp sea salt",
    "1/2 tsp organic cane sugar",
    "1 1/4 cups Bob’s Red Mill Unbleached All-Purpose Flour",
    "3/4 cup Bob’s Red Mill Spelt Flour (or sub more all purpose)",
    "1 Tbsp olive oil (plus more for coating bowl)",
    "3/4 cup warm water*"
  ],
  "__v": 1
}