{
  "hash": "66b5a808e9dbeff5ddb5212408aa59a2a3936cbd",
  "title": "Jack Daniel's Smoky Bacon Mac and Cheese",
  "image": "",
  "href": "http://www.theslowroasteditalian.com/2014/02/jack-daniels-bacon-mac-and-cheese-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2017-05-22T17:52:27.876000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Bring an 8 quart covered pot filled with water to a boil over high heat. Once it boils, add a handful of salt and pasta. Reduce heat to medium high and cook uncovered to al dente (has a bite to it). Drain and set aside.",
    "Meanwhile warm a large 12” skillet over medium-high heat. Using clean kitchen shears cut bacon into bite size pieces over the skillet and let them to fall into the pan. Stir occasionally as needed. Cook until crisp.",
    "While the bacon is cooking, shred cheeses and prepare remaining ingredients.",
    "Once bacon is cooked through, remove bacon to a bowl with a slotted spoon. Reserve 2 tablespoons of bacon drippings and discard the rest. Wipe the side of the skillet to avoid flame ups.",
    "Pour reserved bacon drippings back into the skillet over medium heat and add butter. Once melted add flour and whisk to combine. Add spices, chili paste, Worcestershire, whiskey and chicken broth. Whisk to combine. Allow to come to a bubble for 3 minutes, whisking occasionally to help pick up the bits on the bottom of the pan. Add milk. Whisk to combine. Bring back to a bubble and add cheeses. Stir until cheese is melted and smooth.",
    "Add pasta to sauce and stir to combine. Add bacon. Cook pasta in sauce for 5 minutes over medium heat until sauce thickens and the pasta has a chance to absorb some of the sauce.",
    "Sprinkle with croutons, if desired.",
    "Serve and enjoy!"
  ],
  "ingredients": [
    "0",
    "½ tsp kosher salt + more for pasta water",
    "12 oz Hickory smoked peppered bacon, uncooked",
    "2 Tbsp unsalted butter",
    "½ cup Jack Daniel's Whiskey",
    "½ cup chicken broth",
    "¼ cup all-purpose flour",
    "½ teaspoon smoked paprika",
    "1 teaspoon garlic powder",
    "½ teaspoon New Mexico chili powder",
    "1 tablespoon chili pepper paste",
    "½ tablespoon Worcestershire sauce",
    "2 cups milk",
    "4 ounces extra sharp cheddar (white), shredded",
    "2 ounces smoked provolone cheese, shredded",
    "2 ounces Asiago cheese, shredded",
    "8 oz dry elbow pasta",
    "croutons (garnish)"
  ],
  "__v": 1
}