{
  "__v": 1,
  "directions": [
    "0",
    "PREP:",
    "Scrub potatoes and use peeler to peel off skin in stripes; Peel and dice onions; Open cans of Broth; Peel Kale leaves from the stalk and lightly chop, discarding the stalks.",
    "In pan, saute Italian sausage until slightly browned. Add crushed red pepper ONLY if a spicier flavor is desired. Drain excess fat and place in bowl. Refrigerate while preparing other ingredients.",
    "In same pan, saute bacon. Remove and crumble; set aside. Save 1 tablespoon of grease and use it to saute the onions, and garlic for approximately 15 minutes or until onions are soft and clear.",
    "In pot, add broth and onion mixture; cook through until boiling on medium high heat.",
    "Add potatoes and kale, cover, and cook on Medium High until soft..about 30 minutes.",
    "Add cream, crumbled bacon, sausage; simmer 4 minutes and serve.",
    "Serving Size: Approximately 1 1/2 cup"
  ],
  "firstAdded": "2014-11-18T05:08:14.663000",
  "hash": "8251728eb29ce601562b9f0576378dd1800a6df1",
  "href": "http://www.bigoven.com/recipe/olive-garden-style-zuppa-toscana-wedding-soup/164174",
  "image": "http://mda.bigoven.com/pics/rs/256/olive-garden-style-zuppa-toscana-we-2.jpg",
  "ingredients": [
    "0",
    "1/4 teaspoon crushed red pepper; use only if a spicier flavor is desired",
    "1/2 pound Owens Italian Sausage; crumbled",
    "6 slices bacon",
    "1 each white onion; diced",
    "2 teaspoons Garlic; minced",
    "230 ounces chicken broth; (4 Large 49.5 oz cans and a 32 ounce box)",
    "2 each large baking potatoes; scrubbed, peeled in stripes, and cubed",
    "1/2 cup heavy whipping cream",
    "1 bunch kale; lightly chopped and packed, can substitute with escarole"
  ],
  "keywords": [
    "red",
    "pepper",
    "use",
    "spicier",
    "flavor",
    "desired",
    "owens",
    "italian",
    "sausage",
    "crumbled",
    "slices",
    "bacon",
    "white",
    "onion",
    "garlic",
    "chicken",
    "broth",
    "box",
    "baking",
    "potatoes",
    "scrubbed",
    "stripes",
    "cubed",
    "whipping",
    "cream",
    "bunch",
    "kale",
    "lightly",
    "escarole"
  ],
  "title": "Olive Garden Style Zuppa Toscana Wedding Soup",
  "users": [
    null
  ]
}