{
  "hash": "4c5dfece5c6b067df35e903c1c8f569f140869e6",
  "title": "Tomato Risotto",
  "image": "https://static01.nyt.com/images/2019/08/07/dining/02kitchrex1/02kitchrex1-articleLarge.jpg",
  "href": "https://cooking.nytimes.com/recipes/1020378-tomato-risotto?em_pos=medium&ref=headline&nl_art=1&te=1&nl=cooking&emc=edit_ck_20190807?campaign_id=58&instance_id=11453&segment_id=15946&user_id=4264688f24592aeeb06433e5d96d7150&regi_id=79859114emc=edit_ck_20190807",
  "extension": "Firefox",
  "firstAdded": "2019-08-07T17:08:28.701000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Put 3 tablespoons olive oil in a heavy-bottomed saucepan over medium-high heat, then add the onion, and season generously with salt. Add pepper to taste, and cook until softened, about 5 minutes.",
    "Add the rice and cook the onions, stirring, until the onions are barely brown, about 2 minutes. Add red-pepper flakes, garlic, white wine and diced tomatoes, and cook until most of the liquid has evaporated, about 5 minutes more.",
    "Add 2 cups boiling water and adjust the heat to a brisk simmer. Cook for 5 to 6 minutes, stirring well with a wooden spoon every minute or so.",
    "When the liquid is absorbed, add remaining 1 cup water and continue to cook for another 5 minutes, until the rice is cooked, but the grains are still firm. Taste and adjust the seasoning, adding another splash of water if necessary to loosen the mixture. Turn off the heat, stir in the pecorino and 2 more tablespoons olive oil.",
    "Transfer to a low, wide serving bowl. Surround the rice with tomato slices and season them with salt and pepper. Sprinkle with parsley and basil. Pass more grated cheese at the table."
  ],
  "ingredients": [
    "0",
    "Extra-virgin olive oil",
    "1",
    "large onion, diced (about 1 1/2 cups)",
    "Salt and pepper",
    "1 ½",
    "cups arborio or carnaroli rice",
    "Pinch of red-pepper flakes",
    "2",
    "garlic cloves",
    "½",
    "cup white wine",
    "2",
    "cups diced ripe red tomatoes",
    "3",
    "cups boiling water or vegetable broth",
    "½",
    "cup grated pecorino or Parmesan, plus more for serving",
    "4",
    "medium tomatoes, in different colors, sliced",
    "Chopped parsley, for garnish",
    "Snipped basil, for garnish"
  ],
  "__v": 1
}