{
  "hash": "d69d47bcb9e23cce4d8e947b75356b1a009bb074",
  "title": "FROZEN PEANUT BUTTER PIE",
  "image": "https://lilluna.com/wp-content/uploads/2016/04/Frozen-Peanut-Butter-Pretzel-Pie-1.jpg",
  "href": "https://lilluna.com/frozen-peanut-butter-pretzel-pie/",
  "extension": "Chrome",
  "firstAdded": "2018-09-07T17:57:15.285000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "To make the crust: Preheat oven to 350 degrees. In medium mixing bowl combine the cookie or graham cracker crumbs, pretzel crumbs, butter, and brown sugar. Toss with a spoon until moist. Press into the bottom and up the sides of a 9-inch pie dish (I recommend a pie dish with a tall rim). Freeze for 10 minutes, then place in the oven and bake for 8 minutes. Remove and allow to cool.",
    "To make the filling: Using a stand or handheld mixer, beat the cream cheese and peanut butter until smooth and creamy, about 2 minutes. Add the powdered sugar and vanilla extract, mix until combined. In a separate mixing bowl, beat the heavy cream until soft peaks form. Using a rubber spatula, fold in half of the whipped cream into the peanut butter mixture. Fold the remaining whipped cream in until smooth and creamy. Pour into the cooled crust, then spread into an even layer.",
    "For the topping: Combine the chocolate and cream in a 2 cup glass measuring cup or a medium size microwave-safe bowl, heat at half power for one minute, stir then repeat. Remove and whisk for 1 minute until smooth. Spread over the filling, then top with chunks of peanut butter cups and pretzels. Chill for 2 hours, remove 10 minutes before serving and cut with a sharp knife (rinse under warm water if needed to get a nice clean cut). Serve cold."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "For the crust:",
    "1¼ c. chocolate cookie or graham cracker crumbs",
    "½ c. pretzel crumbs",
    "6 tbsp. unsalted butter, melted",
    "2 tbsp. dark brown sugar",
    "-",
    "For the filling:",
    "8 oz. (1 block) cream cheese, at room temperature",
    "1¼ c. smooth peanut butter",
    "¾ c. powdered sugar",
    "1 tbsp. vanilla extract",
    "2 c. heavy whipping cream",
    "-",
    "For the topping:",
    "½ c. semi-sweet chocolate chips",
    "1 c. milk chocolate chips",
    "½ c. heavy whipping cream",
    "⅓ c. chopped pretzels",
    "½ c. chopped peanut butter cups"
  ],
  "__v": 1
}