{
  "hash": "7bb24329b4a1ceda3b0f033ae319314eb5f05236",
  "title": "low carb keto everything bagels",
  "image": "",
  "href": "https://peaceloveandlowcarb.com/low-carb-keto-everything-bagels/",
  "extension": "Chrome",
  "firstAdded": "2018-04-15T14:48:01.607000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 425°. Line a rimmed baking sheet with parchment paper or a Silpat.",
    "In a medium mixing bowl, combine the almond flour, baking powder, garlic powder, onion powder, and dried Italian seasoning. Mix until well combined. I like to put the mixture through a flour sifter to ensure that all the baking powder gets mixed in with the rest of the ingredients.",
    "Crack one of the eggs into a small bowl and fork whisk. This will be the egg wash for the top of the bagels. The other two eggs will go in the dough.",
    "In a large microwave safe mixing bowl, combine the mozzarella cheese and cream cheese. Microwave for 1 minute and 30 seconds. Remove from microwave and stir to combine. Return to microwave for 1 additional minute. Mix until well combined.",
    "To the mixing bowl, add the remaining 2 eggs and the almond flour mixture. Mix until all ingredients are well incorporated. If the dough gets too stringy and unworkable, simply put it back in the microwave for 30 seconds to soften and continue mixing.",
    "Divide the dough into 6 equal portions. Roll each portion into a ball.",
    "Gently press your finger into the center of each dough ball to form a ring. Stretch the ring to make a small hole in the center and form it into a bagel shape.",
    "Brush the top of each bagel with the egg wash.",
    "Top each bagel with Everything Bagel Seasoning.",
    "Bake on the middle rack for 12-14 minutes or until golden brown."
  ],
  "ingredients": [
    "0",
    "2 cups almond flour (get it here)",
    "1 tablespoon baking powder",
    "1 teaspoon garlic powder (I use this brand)",
    "1 teaspoon onion powder",
    "1 teaspoon dried Italian seasoning",
    "3 large eggs, divided",
    "3 cups shredded low moisture mozzarella cheese",
    "5 tablespoons cream cheese",
    "3 tablespoons Everything Bagel Seasoning (Get the recipe here)"
  ],
  "__v": 1
}