{
  "__v": 1,
  "directions": [
    "0",
    "Place the racks of lamb in a large non-metallic dish. Mix together 8tbsp olive oil, the lemon juice, half the oregano, garlic and seasoning and pour over the lamb. Leave to marinate in the fridge for at least 2 hours or up to 24 hours if possible. To make the balsamic glaze, mix together the balsamic vinegar, clear honey, mint, salt and freshly milled black pepper in a small bowl, then set aside.",
    "Preheat the oven to 200 C, 180 C fan, 400 F, gas 6. Brown the racks of lamb in a little olive oil until browned on the outside, then place on a large baking tray and roast for 20 minutes per 450g (1lb) for pink lamb, 25 minutes for well done.",
    "Arrange the potato, sweet potato, courgette and onion slices in a large roasting dish. Drizzle over the remaining olive oil and season well. Bake in the oven for 30 to 40 minutes or until golden.",
    "Five minutes before the end of cooking, brush the lamb racks with the balsamic glaze, then cook for another 5 minutes or until cooked but slightly pink in the middle. Pour the rest of the balsamic glaze into a small bowl and serve with the lamb. Carve the lamb into cutlets and serve with the sweet potato gratin."
  ],
  "firstAdded": "2014-06-26T12:00:36.768000",
  "hash": "b668266e0c3bc51cb93c6f6f4e0c1201807fb6df",
  "href": "http://www.womanandhome.com/recipes/292604/balsamic-glazed-rack-of-lamb-with-sweet-potato-gratin-recipe",
  "image": "http://womanandhome.media.ipcdigital.co.uk/21348/000008376/47f4_orh2000w570/WAH-SC-04FOOD5-RT.jpg",
  "ingredients": [
    "0",
    "3 or 4 racks of lamb",
    "12tbsp olive oil",
    "juice 1 lemon",
    "large handful oregano, chopped",
    "4 garlic cloves, chopped",
    "5tbsp aged balsamic vinegar",
    "1.5tbsp clear honey",
    "4tbsp chopped fresh mint",
    "300g (10oz) potatoes, thinly sliced",
    "300g (10oz) sweet potatoes, thinly sliced",
    "3 courgettes, thinly sliced",
    "2 red onions, thinly sliced"
  ],
  "keywords": [
    "racks",
    "lamb",
    "olive",
    "oil",
    "juice",
    "lemon",
    "oregano",
    "garlic",
    "aged",
    "balsamic",
    "vinegar",
    "clear",
    "honey",
    "mint",
    "potatoes",
    "courgettes",
    "red",
    "onions"
  ],
  "title": "Balsamic glazed rack of lamb with sweet potato gratin recipe",
  "users": [
    null
  ]
}