{
  "hash": "2e6dc1bbf32e7426d437babbcf445dd33e13304b",
  "title": "Spaghetti Aglio e Olio",
  "image": "http://cdn.noshon.it/wp-content/uploads/2011-01-24-spaghetti-aglio-olio-3.jpg",
  "href": "http://noshon.it/recipes/spaghetti-aglio-e-olio/",
  "extension": "Chrome",
  "firstAdded": "2016-05-03T15:53:54.708000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Bring a large pot of water to a boil and add a generous handful of salt. Add the dried pasta and cook according to the package directions, subtracting 1-2 minutes to ensure that the pasta is al dente. Stir occasionally to prevent sticking.",
    "As soon as you add the dried pasta to the water, add the olive oil and garlic to a cold large saucepan. Heat the pan over medium heat until the garlic starts to sizzle, about 5 minutes.",
    "Continue cooking the garlic for an additional 2-3 minutes until it just starts to brown lightly around the edges. Add the crushed red chile flakes and cook for 30 seconds.",
    "Remove 1 cup of the pasta cooking water from the large pot. Add ½ cup of this pasta water to the pan with the garlic and oil and simmer for 1-2 minutes to form the sauce. By this time, the pasta should be done. Transfer the pasta directly from the pot to the saucepan using tongs.",
    "Toss the pasta with the garlic and oil mixture and continue to simmer until there’s almost no visible liquid left in the bottom of the pan. If the pan looks dry from the beginning, add a few splashes of the remaining reserved pasta water.",
    "Add the parmesan cheese, parsley, lemon zest, and salt. Toss to combine then serve."
  ],
  "ingredients": [
    "0",
    "s",
    "1 pound spaghetti",
    "3/4 cup extra virgin olive oil",
    "6 cloves garlic, peeled and sliced thinly",
    "1 teaspoon crushed red chile flakes",
    "1 cup parmesan cheese, grated",
    "1/4 cup Italian parsley, minced",
    "½ teaspoon kosher salt",
    "Zest of 1 lemon"
  ],
  "__v": 1
}