{
  "hash": "a7f557607ebcdfc4b9323b42c29afc35978e1b2c",
  "title": "Crisp Mozzarella Sticks",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2013/4/26/0/FNK_CRISP-MOZZARELLA-STICKS_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/food-network-kitchens/crisp-mozzarella-sticks-recipe.html",
  "firstAdded": "2015-01-24T23:45:21.689000",
  "users": [
    null,
    null
  ],
  "keywords": [
    "wholegrain",
    "melba",
    "toasts",
    "wheat",
    "breadcrumbs",
    "oregano",
    "kosher",
    "salt",
    "black",
    "pepper",
    "cayenne",
    "egg",
    "whites",
    "clove",
    "garlic",
    "pastry",
    "unbleached",
    "allpurpose",
    "flour",
    "partskim",
    "mozzarella",
    "string",
    "cheese",
    "crosswise",
    "olive",
    "oil",
    "cooking",
    "spray",
    "coating",
    "storebought",
    "marinara",
    "warmed"
  ],
  "directions": [
    "0",
    "Pulse the melba toasts in a food processor to make semi-coarse crumbs; transfer to a medium bowl or dish. Mix in the breadcrumbs, oregano, 1/4 teaspoon each salt and pepper and the cayenne if using.",
    "Whisk together the egg whites, whole egg, garlic and 1/4 teaspoon each salt and pepper in another bowl.",
    "Put the flour and 1/4 teaspoon salt in a resealable plastic bag. Add the cheese pieces to the bag, close and shake to coat. Dip one piece of the cheese at a time in the egg mixture first, and then roll firmly in the breadcrumb mixture; then dip the same piece again in the egg mixture followed by the breadcrumb mixture. (Note: Use one hand with the dry mixture and the other with the wet mixture.) Place on a parchment paper-lined plate or baking sheet. Freeze for 15 minutes, or up to overnight.",
    "Preheat the oven to 475 degrees F. Transfer the frozen cheese sticks to another baking sheet. Fully coat the cheese sticks with the olive oil cooking spray. Bake until golden, about 12 minutes. Sprinkle with additional salt and pepper to taste.",
    "Serve immediately with the warm marinara sauce.",
    "From Food Network Kitchens"
  ],
  "ingredients": [
    "0",
    "10 whole-grain melba toasts",
    "1/3 cup whole wheat breadcrumbs",
    "1 tablespoon minced fresh oregano",
    "Kosher salt and freshly ground black pepper",
    "Large pinch ground cayenne, optional",
    "2 large egg whites",
    "1 large egg",
    "1 clove garlic, minced",
    "1/3 cup whole wheat pastry flour or unbleached all-purpose flour",
    "8 sticks part-skim mozzarella string cheese, halved crosswise",
    "Olive oil cooking spray, for coating the cheese sticks",
    "1/3 cup store-bought marinara sauce, warmed, for serving"
  ],
  "__v": 2
}