{
  "hash": "630d75fb0cd50445603a5acdd1407b115595a05d",
  "title": "Incredible Boneless Pork Roast With Vegetables",
  "image": "http://img.sndimg.com/food/image/upload/w_266/v1/img/recipes/50/02/10/picVfFiim.jpg",
  "href": "http://www.food.com/recipe/incredible-boneless-pork-roast-with-vegetables-500210",
  "firstAdded": "2015-01-23T00:26:59.901000",
  "users": [
    null
  ],
  "keywords": [
    "lbs",
    "boneless",
    "pork",
    "loin",
    "garlic",
    "onion",
    "parsley",
    "seasoning",
    "salt",
    "extra",
    "virgin",
    "olive",
    "oil",
    "black",
    "pepper",
    "yukon",
    "gold",
    "potatoes",
    "baby",
    "carrots",
    "spanish",
    "beef",
    "broth"
  ],
  "directions": [
    "0",
    "Place Pork Loin fat side down in a 9 x 13 pan and arrange vegetables around it.",
    "In a small bowl mix Garlic powder, onion powder, seasoned salt and black pepper until combined and rub it onto the pork (top only, not the bottom).",
    "Sprinkle the parsley on top, and then the garlic. Drizzle the olive oil over top of the pork. You can season the vegetables as well, I recommend to. Just sprinkle all of the same dry seasonings over top.",
    "Add beef broth from one of the corners of the pan, do not pour over pork. Place foil, slightly vented, over the pork, and fitting the pan. Cook it on 325 for 2 1/2 hours. Midway through rotate the pork so it it fat side up and replace the foil so it is covered again.",
    "After its done take the foil off and put the broiler on HIGH. Flip the pork again to meat side up and broil for 10 minutes. You will do this twice (meat side up, 10 mins, fat side up 10 mins, and then meat side up one last time for 10 mins.) For a total of 30 minutes You may need a few mins longer depending on your oven. Just look to see how browned its getting.",
    "Let meat rest for 30 minutes.",
    "Enjoy! The vegetables with have an incredible flavor and so will the meat.",
    "**You may add more veggies but You'll probably have to go with a bigger pan size.",
    "**If you'd really like to kick it up, make a rue and add PAN JUICES and some red wine and let it reduce, stirring often to make a nice gravy!"
  ],
  "ingredients": [
    "0",
    "4 -5 lbs boneless pork loin",
    "1 tablespoon garlic powder",
    "1 tablespoon onion powder",
    "1 tablespoon parsley",
    "1 tablespoon seasoning salt",
    "1 tablespoon extra virgin olive oil",
    "1 teaspoon black pepper",
    "10 fresh garlic cloves, Chopped",
    "5 -6 yukon gold potatoes, quartered",
    "8 -16 ounces baby carrots",
    "1 large Spanish onion, quartered",
    "1 (8 ounce) can beef broth (MUST!!)"
  ],
  "__v": 1
}