{
  "hash": "9e0d0867d26fe1378c2c38c1baa279ad3487264c",
  "title": "Fried Deviled Eggs",
  "image": "",
  "href": "http://www.spoonforkbacon.com/2017/12/fried-deviled-eggs/",
  "extension": "Chrome",
  "firstAdded": "2018-01-02T17:01:41.850000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "1. Carefully scoop egg yolks from the egg whites, into a mixing bowl and set whites aside.",
    "2. Add mayonnaise, relish and mustard to yolks and lightly season with salt and pepper.",
    "3. Mash together until smooth and creamy. Adjust seasonings, cover with plastic wrap and set aside.",
    "4. Set up an assembly line with the egg whites, flour in a shallow baking dish, eggs in a mixing bowl, and the panko and crushed crackers mixed together in another shallow baking dish.",
    "5. Dredge egg whites into the flour, eggs and finally the panko-cracker mixture, shaking off any excess after each addition. Repeat until all the egg whites have been breaded.",
    "6. Fill a tall pot with 2 inches oil and preheat to 350˚F.",
    "7. Carefully add egg whites to the pot, a few at a time, and fry on each side for 2 to 3 minutes or until golden brown. Drain fried whites onto a paper towel and lightly season with salt and pepper. Transfer whites to a cooling rack (to prevent them from getting soggy) and repeat until all have been fried.",
    "8. Scoop about 1-2 tablespoons of the yolk mixture into each well(or scoop mixture into a piping bag and pipe into the wells).",
    "9. Finish each egg with a sprinkle of chives and serve."
  ],
  "ingredients": [
    "0",
    "Makes 24",
    "Ingredients:",
    "12 large hardboiled eggs, peeled and halved lengthwise",
    "2 tablespoons mayonnaise",
    "1 1/2 tablespoons sweet pickle relish",
    "2 teaspoons Dijon mustard",
    "salt and pepper to taste",
    "1 1/2 cups all purpose flour",
    "2 large eggs, beaten",
    "1 1/2 cups panko breadcrumbs",
    "1 cup finely crushed butter crackers (i.e. Ritz)",
    "thinly sliced chives for garnish",
    "oil for frying"
  ],
  "__v": 1
}