{
  "hash": "b18f9c43c87f024fae51b8ba79c5efac0c2ea888",
  "title": "Instant Pot Chicken Adobo",
  "image": "//food.fnr.sndimg.com/content/dam/images/food/fullset/2017/2/28/0/FNK_Instapot-Chicken-In-Adobo-H-8670_s4x3.jpg.rend.hgtvcom.826.620.suffix/1488313699262.jpeg",
  "href": "https://www.foodnetwork.com/recipes/food-network-kitchen/instant-pot-chicken-adobo-3649636",
  "extension": "",
  "firstAdded": "2019-06-08T15:16:06.934000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Season the chicken legs generously with salt and pepper. Turn the Instant Pot® (see Cook's Note) to the high saute setting. Add the oil and once it's shimmering, but not smoking, add half the chicken pieces and brown on both sides, about 7 minutes. Remove with tongs to a plate and brown the remaining chicken pieces. Return all the chicken to the multi-cooker and add the soy sauce, sugar, vinegar, garlic, bay leaves, onion and 1/2 teaspoon pepper.",
    "Follow the manufacturer's guide for locking the lid and preparing to cook. Set to pressure cook, on high, for 8 minutes. After the pressure cook cycle is complete follow the manufacturer's guide for quick release and wait until the quick release cycle is complete. Careful of any remaining steam, unlock and remove the lid and turn the Instant Pot® back to the high saute setting. Let the sauce come to a boil and reduce it until dark brown and very fragrant, about 20 minutes. Remove the bay leaves.",
    "Transfer the chicken and sauce to a serving platter, sprinkle with scallions and serve with rice."
  ],
  "ingredients": [
    "0",
    "4 chicken legs, thighs and drumsticks separated",
    "Kosher salt and freshly ground black pepper",
    "2 tablespoons vegetable oil",
    "1/3 cup soy sauce",
    "1/4 cup sugar",
    "1/4 cup white distilled vinegar",
    "5 cloves garlic, smashed",
    "2 bay leaves",
    "1 large yellow onion, sliced",
    "2 scallions, sliced",
    "Cooked rice, for serving"
  ],
  "__v": 1
}