{
  "__v": 2,
  "directions": [
    "0",
    "By all means use dark meat if preferred. If using breasts, make 1/3″/1cm deep, diagonal scores all over the surface of the meat and cut them into small pieces (5″/4cm squares), then marinade in the rest of the ingredient for approx 1 ~ 2 hours. The breasts could, better yet, be brined for a juicier texture. But truth be told, I never find myself in a situation where I “plan” to make these poppers. They are always a last minute craving that must be satisfied in a couple hours max. That’s why I always use dark meat instead of white.",
    "When the meats are marinading, mix together all the ingredients in “spice mixture”. Now, the MSG is optional. I know how many people out there are wary of this badly-represented crystal. Don’t like the sound of “MSG”? How about “UMAMI”? That’s right. UMAMI. It’s a chemical source found in SEAWEED by the JAPANESE, hence called the UMAMI! So next time when people are talking about “umami this” and “umami that”, or “umami in a tube”… just know that it is actually referring to – M. S. G! If you value authenticity above all else. MSG is a must in the spice mixture. Just like it is in almost ALL Asian savory street foods.",
    "Combine all the ingredients in the “breading” in a bowl. The breading calls for tapioca flour and I’m afraid to say that this one isn’t negotiable. It HAS TO be tapioca starch. Not flour. Not cornmeals. No. It isn’t the same. Tapioca starch tends to form little granules of itself and these little bits of starch will become little bits of crunchiness in the finished product. It is visually, and texturally irreplaceable for an authentic salty-crispy-chicken. Tapioca starch is made from yams or cassava, and can be found in major supermarkets or ONLINE. Taiwanese brands are preferred.",
    "Mix 2/3 of a beaten egg into the chicken breasts and combine evenly, then toss them in the breading A FEW PIECES at a time. Make sure each piece has an even coating of the breading. Place the breaded chicken breasts on a baking rack and LET IT REST FOR 30 MIN. This step is important in order for the starch to hydrate from the moisture. If you skip this step and goes right to the frying, you will get a “powdery” texture and taste.",
    "Preheat the oven on 300ºF/150ºC. In a frying pot (hopefully comes with a basket and a lid), heat up 3 cups of canola oil (or more if needed) on medium high heat. Test the temperature of the oil by sticking the end of a wooden chopstick into it. If it bubbles up quickly along the side of the chopstick, the oil is ready. DON’T CROWD THE FRYING POT. Depending on the size of pot, only put as many pieces of chicken in at a time so that they still have rooms to move around in the pot. Start frying the chicken 1 batch at a time until they turn golden brown on all sides. Keep the done-batches warm in the preheated oven on a baking sheet when you are frying the next batch. It took me 4 batches to fry all the pieces.",
    "When the meats are frying, finely mince 3 cloves of garlic and set in a big bowl. Thai basil is traditionally used in the recipe but I added a few other herbs that I’m growing in my apartment which are sage, mint, rosemary and shiso leaf. They are all optional EXCEPT for the basil.",
    "When done frying all the chickens, keep’em warm in the oven, then take the frying basket out of the oil and place all the herbs in it. With the lid on (see picture), drop the basket into the hot oil. NOW. This is why a LID is VERY IMPORTANT. Herbs = a lot of water. Water + hot grease = SPLATTER! If you are looking for an excellent reason to renovate the kitchen, by all means leave the lid. If you are using a dutch oven or whatever instead of a frying pot, then immediately put the lid on after herbs are dropped. Either way, when the sizzling sound resides, that means the herbs are crispy. It’s safe to open the lid now. Lift the basket and add the crispy herbs to the minced garlic.",
    "Add the chicken to the garlic and herbs. Sprinkle the spice mixture GENEROUSLY onto the chicken and toss to combine."
  ],
  "firstAdded": "2014-06-19T15:29:35.418000",
  "hash": "9f920ef2a9dbeb74171127439cc81d18a67c3d09",
  "href": "http://www.ladyandpups.com/2012/08/05/salty-crispy-poppers-eng/",
  "image": "http://www.ladyandpups.com/wp-content/uploads/2012/07/Salt-crispy-chicken-13-1024x702.jpg",
  "ingredients": [
    "0",
    "Chicken Marinade:",
    "1 1/2 chicken breast (that’s 1.5 “set” of breast)",
    "1 tbsp of soy sauce",
    "1/2 tsp of salt",
    "1/8 tsp of five spice",
    "1/4 tsp of freshly ground black pepper",
    "1/4 tsp of white pepper",
    "2 smashed garlic",
    "Spice Mixture:",
    "1 tbsp of fine sea salt",
    "1 1/2 tbsp of white pepper",
    "1 tbsp of ground black pepper",
    "1/2 tsp of five spice powder",
    "1/4 tsp of Sichuan peppercorn powder",
    "Breading:",
    "1 1/2 cup of tapioca starch",
    "1 1/2 tbsp of black pepper",
    "1 1/2 tbsp of white pepper",
    "1 tsp of salt",
    "2 tsp of garlic powder",
    "*important details about the breading below",
    "To Finish:",
    "3 cloves of minced garlic",
    "Thai basil and a few favorite herbs"
  ],
  "keywords": [
    "chicken",
    "marinade",
    "thats",
    "set",
    "breast",
    "soy",
    "salt",
    "spice",
    "black",
    "pepper",
    "white",
    "smashed",
    "garlic",
    "mixture",
    "sichuan",
    "peppercorn",
    "breading",
    "tapioca",
    "starch",
    "important",
    "details",
    "finish",
    "thai",
    "basil",
    "favorite",
    "herbs"
  ],
  "title": "SALTY CRISPY POPPERS",
  "users": [
    null
  ]
}