{
  "__v": 2,
  "directions": [
    "0",
    "Prepare one 12 in x 9in baking tray (use two trays if you want thinner rolls)",
    "Method:",
    "Preheat oven to 220C (428F). Line a baking paper/parchment paper on a greased baking pan. Stir in green tea powder into hot water and mix thoroughly. Mix plain flour and corn flour.",
    "Whisk the egg yolks with 100gm sugar until smooth, creamy but not bubbly. Stir in tea powder mixture and combine well.",
    "Whisk egg whites for a while until bubbles form. Mix in 60gm sugar with small amount at a time for 3 times, beat until stiff peaks form.",
    "Fold in egg whites to egg yolks mixture, 1/3 portion at a time.",
    "Sift in the plain flour and corn flour to the mixture. Then quickly add in oil.",
    "Pour the batter in the lined baking tray and level it. Bake for 10-15 minutes, or until golden brown.",
    "Remove from the oven and transfer to a wire rack. Let the cake cool down.",
    "Green Tea Swiss Roll Procedures02",
    "[Pin on Pinterest]",
    "To make the filling:",
    "Chill mixer and mixing bowl in the fridge for 15 minutes.",
    "Beat whipping cream with caster sugar with the chilled electric mixer and bowl until smooth and creamy.",
    "To ensemble the Swiss roll:",
    "Turn the surface of cake onto a large paper. Peel off the baking paper.",
    "Spread fillings evenly and roll the cake. Cut edges to complete. For best results, keep roll in fridge before serving.",
    "Green Tea Swiss Roll02",
    "[Pin on Pinterest]",
    "Tips on how to roll a Swiss roll:",
    "After cooling the cake for a while, and the cake is still warm, use a clean tea towel to pre-roll the cake and let sit for 10 to 15 minutes. Then off you go for spreading the filling and rolling the cake nicely. The pre-roll method helps stretch the cake and then can be easily rolled in a round shape. The surface of the cake won’t stick onto the tea towel.",
    "When you're ready to roll the cake, use a sharp knife to score three lines at one end, each line 0.5cm apart. And start rolling from this end.",
    "Use a baking tray a bit bigger than mine, the cake would be thinner, and easier to roll."
  ],
  "firstAdded": "2014-06-17T23:30:08.213000",
  "hash": "8e6ad6c3c107073cc01138bfcfe442f5d385cf40",
  "href": "http://en.christinesrecipes.com/2010/06/green-tea-matcha-swiss-roll.html",
  "image": "http://lh6.ggpht.com/_V0CoK16CILc/TBDX5WrMVKI/AAAAAAAAIrI/sOhMijJy0Fg/s800/%E7%B6%A0%E8%8C%B6%E8%9B%8B%E5%8D%B7%20Green%20Tea%20Swiss%20Roll02.jpg",
  "ingredients": [
    "0",
    "Ingredients:",
    "6 egg whites",
    "9 egg yolks",
    "100 + 60 gm caster sugar",
    "90 gm plain flour",
    "25 gm corn flour",
    "50 ml olive oil (or vegetable oil)",
    "3 Tbsp hot water",
    "2 Tbsp green tea powder",
    "Ingredients of filling:",
    "1/2 cup whipping cream",
    "4 tsp caster sugar"
  ],
  "keywords": [
    "egg",
    "whites",
    "yolks",
    "caster",
    "sugar",
    "plain",
    "flour",
    "corn",
    "olive",
    "oil",
    "hot",
    "water",
    "green",
    "tea",
    "filling",
    "whipping",
    "cream"
  ],
  "title": "Green Tea (Matcha) Swiss Roll",
  "users": [
    null
  ]
}