{
  "hash": "f2caca51781b8bd16692f8ea7a5875df9b8ae4ee",
  "title": "Almond Flour Frosted Sugar Cookies",
  "image": "//detoxinista.com/wp-content/uploads/2012/03/DSC06048.jpg",
  "href": "http://detoxinista.com/2012/03/almond-flour-frosted-sugar-cookies/",
  "extension": "Chrome",
  "firstAdded": "2016-02-11T15:56:49.355000",
  "users": [
    null
  ],
  "keywords": [
    "cookies",
    "honeyville",
    "almond",
    "flour",
    "coconut",
    "oil",
    "softened",
    "use",
    "butter",
    "instead",
    "raw",
    "honey",
    "salt",
    "frosting"
  ],
  "directions": [
    "0",
    "Preheat oven to 350F.",
    "In a medium bowl, mix together the cookie ingredients until a thick, creamy batter is formed.",
    "Using a cookie scoop, drop the batter by rounded tablespoons onto a baking sheet, lined with a Silpat or parchment paper. Press and shape the dough with your fingers to desired shape--> I opted mostly for circles, but also tried a few cut-out shapes! (note: To make cut-out cookies, it helps to chill the batter in the fridge for 30 minutes first!)",
    "Bake for about 8 minutes at 350F, or until the edges turn golden brown.",
    "Allow to cool on the pan for 10 minutes, then transfer to a wire rack to cool completely.",
    "For the frosting, simply cream together the coconut oil, honey, almond extract and salt, until well combined. If the coconut oil starts to melt (it melts at temperatures above 76 degrees), briefly place the mixture in the fridge to help it set.",
    "Frost the cooled cookies, and let them set in the fridge for a more solid-frosting."
  ],
  "ingredients": [
    "0",
    "For the cookies: 2 cups Honeyville blanched almond flour",
    "¼ cup coconut oil, softened (or use butter instead)",
    "¼ cup raw honey",
    "½ teaspoon almond extract",
    "¼ teaspoon fine sea salt",
    "For the frosting: 2 tablespoons coconut oil, softened",
    "2 tablespoons raw honey",
    "½ teaspoon almond extract",
    "pinch of fine sea salt"
  ],
  "__v": 1
}