{
  "hash": "dc1d8e0431d23071bb8843ca490cb9165823db27",
  "title": "Chocolate-Caramel Domes",
  "image": "//food.fnr.sndimg.com/content/dam/images/food/fullset/2018/7/30/0/FN_CHOCOLATE-CARAMEL-DOMES-OVERHEAD-SOLO-H_s4x3.jpg.rend.hgtvcom.826.620.suffix/1532976493939.jpeg",
  "href": "https://www.foodnetwork.com/recipes/food-network-kitchen/chocolate-caramel-domes-5347664",
  "extension": "Chrome",
  "firstAdded": "2020-01-04T20:10:08.828000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the cake: Preheat the oven to 350 degrees F. Spray an 8-inch square glass baking dish with nonstick cooking spray.",
    "Whisk together the flour, sugar, cocoa powder, baking soda, baking powder and salt in a large bowl. Whisk in the milk, vegetable oil, vanilla, egg and 1 teaspoon hot water until smooth and combined.",
    "Pour into the prepared baking dish and bake until a knife inserted in the center comes out clean, about 20 minutes. Cool for 10 minutes on a wire rack, then flip out onto a cutting board to cool completely, about 20 minutes.",
    "Use a 2 1/2-inch round biscuit cutter to cut out 6 circles from the cake (save the scraps for another use); set aside.",
    "For the chocolate domes and mousse: Meanwhile, add the coconut oil and 3 ounces of the chocolate to a medium microwave-safe bowl. Microwave in 1-minute intervals, stirring in between each, until the chocolate and coconut oil are melted and the mixture is smooth, about 2 minutes. Pour the chocolate mixture into the cavities of a silicone half-sphere mold with six 3-ounce-capacity cavities and tilt the mold to swirl the chocolate around until each half-sphere is coated entirely (you can also use your finger to swirl the chocolate around). Some chocolate may spill over on top of the mold, which is fine; it will break off when you unmold the domes. Tap out any excess chocolate and freeze until the chocolate is hardened, about 5 minutes.",
    "Put 1/4 cup of the cream in a small bowl and stir in the gelatin. Put the butter and remaining 6 ounces chocolate in a medium microwave-safe bowl and microwave in 1-minute intervals, stirring in between each, until the chocolate and butter are melted and the mixture is smooth, about 2 minutes. Stir the gelatin mixture into the chocolate mixture until the gelatin is dissolved. Cool to room temperature, about 10 minutes.",
    "Whip the remaining 3/4 cup cream in a large bowl with an electric mixer on medium speed until stiff peaks form, 2 to 3 minutes. Add half of the chocolate-gelatin mixture and continue beating until well combined. Add the remaining chocolate-gelatin mixture and continue beating until no streaks remain.",
    "For the filling and topping: Scoop 1/3 cup of the mousse into each chocolate cavity in the half-sphere mold. Using the back of a teaspoon, make a divot in the middle of each portion of chocolate mousse about halfway down. Pour a heaping teaspoon of caramel sauce into each divot. Top each half-sphere with a cake round, pressing down gently into the mousse (use a paper towel to wipe away any mousse that may seep out of the mold). Freeze until the mousse is set, about 1 hour.",
    "Gently peel the mold away from each of the half-spheres and place them cake-side down on a serving platter.",
    "Use a vegetable peeler to shave 1 tablespoon of chocolate curls from the chocolate. Put the remaining chocolate in a small microwave-safe bowl and microwave in 30-second intervals, stirring in between each, until melted, about 1 minute. Drizzle the melted chocolate over each dome and sprinkle with the chocolate shavings. Serve immediately."
  ],
  "ingredients": [
    "0",
    "Cake:",
    "Nonstick cooking spray, for the baking dish",
    "1/4 cup all-purpose flour",
    "1/4 cup sugar",
    "2 tablespoons cocoa powder, such as Baker's® 100% Pure Cocoa Powder",
    "1/4 teaspoon baking soda",
    "1/4 teaspoon baking powder",
    "Pinch of kosher salt",
    "2 tablespoons milk",
    "1 tablespoon vegetable oil",
    "1/4 teaspoon pure vanilla extract",
    "1 large egg",
    "Chocolate Domes and Mousse:",
    "1 tablespoon extra-virgin unrefined coconut oil",
    "9 ounces semisweet chocolate, such as Baker's® Semi-Sweet Chocolate Baking Bar, chopped",
    "1 cup heavy cream",
    "One 1/4-ounce package unflavored gelatin",
    "2 tablespoons unsalted butter",
    "Filling and Topping:",
    "1/4 cup caramel sauce",
    "2 ounces semisweet chocolate, such as Baker's® Semi-Sweet Chocolate Baking Bar"
  ],
  "__v": 1
}