{
  "hash": "6ef0379df5f22987c2015dfbd1f8d16caebb6499",
  "title": "Pumpkin Spice Cookies (Paleo, Vegan, Low-Carb Options)",
  "image": "https://cmt.azureedge.net/media/pumpkin_spice_cookies_paleo_vegan_low_ca_201811112027124465956s11w.jpg",
  "href": "https://www.copymethat.com/r/n7cvevU/pumpkin-spice-cookies-paleo-vegan-low-ca/",
  "extension": "",
  "firstAdded": "2018-12-28T23:35:55.075000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium mixing bowl, stir together the almond flour, coconut flour, baking soda, pumpkin pie spice and salt. Set aside.",
    "In a large mixing bowl with an electric hand mixer or using a stand mixer, beat together the coconut oil, coconut sugar, almond butter and vanilla at medium speed until well combined, about 1 minute.",
    "Beat in the egg on low and mix until well incorporated.",
    "Stir in the flour mixture until well combined.",
    "Then stir in 1 cup (170 grams) chocolate chips. Place the bowl in the refrigerator for about 1 hour or until the dough is firm.",
    "Preheat the oven to 350 °F (175 °C) and line a baking sheet with a piece of parchment paper.",
    "Roll the dough into 8 (75-gram) balls and place the remaining 1/4 cup (43 grams) of chocolate chips on the top and on the sides of the dough balls. Place 4\" apart on the prepared baking sheet. Press the cookies down lightly with the palm of your hand.",
    "Bake for 11-14 minutes or until the surface of the center of the cookies no longer appears wet. They'll be very soft but will continue to cook as they sit on the cookie sheet.",
    "Let cool completely on the baking sheet. Store in an airtight container for up to 3 days."
  ],
  "ingredients": [
    "0",
    "1 cup (100 grams) blanched almond flour 1",
    "1/4 cup (32 grams) coconut flour 2",
    "1 tablespoon pumpkin pie spice ( here's how to make it yourself)",
    "1 teaspoon baking soda",
    "1/4 teaspoon salt",
    "6 tablespoons (84 grams) coconut oil or unsalted butter, room temperature (if your coconut oil is a little melty, put it in the fridge for about 10-20 minutes or until firmer, like softened butter.) 3",
    "3/4 cup (150 grams) coconut sugar, very tightly packed or brown sugar 4 or Lakanto Monkfruit Sweetener for low-carb",
    "6 tablespoons (98 grams) natural almond butter (the kind with just almonds in it and no added fat / sugar), room temperature 5 (here's how to make almond butter)",
    "1 1/2 teaspoons vanilla extract",
    "1 large egg, room temperature (or 1 chia egg for vegan) 6",
    "1 1/4 cups (213 grams) chocolate chips, divided (make sure to use paleo-friendly / vegan / low-carb chocolate chips, if desired)"
  ],
  "__v": 1
}