{
  "hash": "61d3cb5faf57b116b0cee2721d7ea8ff45e49c2f",
  "title": "Eggplant Lentil Stew with Pomegranate Molasses",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2006/12/eggplant-lentil-stew.jpg",
  "href": "https://www.simplyrecipes.com/recipes/eggplant_lentil_stew_with_pomegranate_molasses/",
  "extension": "",
  "firstAdded": "2018-01-28T20:46:35.673000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Partially peel the eggplant so it has lengthwise stripes, then cut it lengthwise into 4 slices. Score each slice on 1 side in a crosshatch pattern. Cut each slice crosswise into 3 pieces and set on a rimmed baking sheet. Sprinkle with salt. Let stand for 1 hour.",
    "2 In a small saucepan, cover the lentils with 2 inches of water and bring to a boil. Reduce the heat to moderate and simmer until tender, about 15 minutes. Drain the lentils.",
    "3 Coat a small (3-quart) enameled cast-iron casserole with 1 tablespoon of the olive oil. In a bowl, toss the onion with the garlic, tomatoes, green chiles, mint, tomato paste, crushed red pepper and 2 teaspoons of salt.",
    "4 Rinse the eggplant and pat dry. Spread 1/2 cup of the vegetable mixture in the casserole and top with half of the eggplant. Cover with half of the lentils and half of the remaining vegetable mixture. Top with the remaining eggplant, lentils and vegetables. Pour the remaining olive oil around the side and over the vegetables, then drizzle with the pomegranate molasses.",
    "5 Heat the stew until the liquid in the stew is simmering. Cover and cook over low heat until the eggplant is very tender, about 1 1/2 hours. Serve hot, warm or at room temperature."
  ],
  "ingredients": [
    "0",
    "One 1 1/2-pound globe eggplant (or enough eggplants for 1 1/2 pounds)",
    "Salt",
    "1/2 cup brown lentils",
    "Water",
    "2/3 cup extra-virgin olive oil",
    "1 medium onion, finely chopped",
    "4 medium garlic cloves, minced",
    "2 medium tomatoes, chopped",
    "2 long green chiles, such as Anaheims—stemmed, seeded and coarsely chopped",
    "2 Tbsp chopped mint leaves",
    "1 tablespoon tomato paste",
    "1/4 teaspoon crushed red pepper",
    "1/4 cup pomegranate molasses"
  ],
  "__v": 1
}