{
  "hash": "913bad70c0b07cad82ea3614dafb4f57b23eac8b",
  "title": "White Chicken Chili Recipe",
  "image": "http://cdn-jpg.thedailymeal.net/sites/default/files/styles/hero_image_670x400/public/white_chicken_chili_heather_christo_450x360.jpg?itok=4xlBOr0J",
  "href": "http://www.thedailymeal.com/white-chicken-chili-recipe",
  "firstAdded": "2015-02-04T23:37:16.722000",
  "users": [
    null
  ],
  "keywords": [
    "bonein",
    "skinon",
    "split",
    "chicken",
    "breasts",
    "kosher",
    "salt",
    "olive",
    "oil",
    "yellow",
    "onions",
    "garlic",
    "jalapeo",
    "frozen",
    "white",
    "pearl",
    "thawed",
    "broth",
    "beans",
    "rinsed",
    "red",
    "pepper",
    "cumin",
    "smoked",
    "paprika",
    "cinnamon",
    "wine",
    "vinegar",
    "avocadoes",
    "cubed"
  ],
  "directions": [
    "0",
    "Directions",
    "Preheat the oven to 400 degrees.",
    "Place the chicken breasts skin side up on a baking sheet. Season them heavily with kosher salt and place in the oven. Roast until the chicken is cooked almost all the way through, about 25 minutes.",
    "Remove from the oven and set aside to cool. Meanwhile, in a large, heavy pot, heat the olive oil over medium heat. Add the onions and season with salt, to taste. Cook until the onions are beginning to soften and turn translucent, about 5 minutes.",
    "Add the garlic and jalapeño and continue to cook over medium heat. (Make sure that the onions and garlic are not browning.) When the onions and garlic are soft, add the pearl onions and cook for 2-3 more minutes.",
    "Add the chicken broth and let it come to a simmer. Meanwhile, take the chicken breasts and discard the skin, fat, and bones, keeping the breast meat. Using forks, shred the chicken into bite-sized chunks and set aside.",
    "Once the broth and onions are simmering, add the chicken and white beans. Season the chili with the red pepper flakes, cumin, paprika, cinnamon, and vinegar. Cover the pot and let the chili simmer for about 30 minutes.",
    "Remove the lid, reduce heat to low, and cook for 20 more minutes. Season with additional kosher salt or red pepper flakes. Serve hot and top with smoked paprika and the cubed avocadoes."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "4 large bone-in, skin-on split chicken breasts",
    "kosher salt, to taste",
    "3 olive oil",
    "2 large sweet yellow onions, diced",
    "2 cloves garlic, minced",
    "1 jalapeño, minced",
    "10 frozen white pearl onions, thawed",
    "8 chicken broth",
    "five 16-ounce cans white beans, drained and rinsed",
    "1/2 crushed red pepper flakes, or to taste",
    "4 cumin",
    "2 smoked paprika, plus more for garnish",
    "1/2 cinnamon",
    "2 red wine vinegar",
    "2 ripe avocadoes, cubed"
  ],
  "__v": 1
}