{
  "hash": "519e5348433740a66dc9e58b20f3196e18457825",
  "title": "Cranberry Chocolate Chip Snack Bars",
  "image": "https://data.beyonddiet.com/getimage.imhx?img=01_82_36_40_1823640-239853.jpg&w=710&cust=2x1",
  "href": "https://www.beyonddiet.com/recipes/47540/cranberry-chocolate-chip-snack-bars?food=figs&tag=cranberrychocolatechipsnackbarsfb",
  "extension": "Chrome",
  "firstAdded": "2017-11-10T17:26:03.273000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "Soak dates in a bowl of warm water for 10-15 minutes.",
    "Combine almonds, sunflower seeds, flax seeds, and cinnamon in a food processor or blender. Process until pretty fine (some chunks are okay). Pour into a medium bowl, and set aside.",
    "Puree the dates (with a few tablespoons of water) in the food processor/blender. Once smooth, move date puree to the bowl with the nuts and seeds. Add oats to the bowl, and mix very well.",
    "In a small saucepan, combine honey, almond butter, vanilla, and cocoa powder. Heat over medium heat, stirring constantly, until mixture is smooth. Pour mixture over nut/seed/date/oat mixture, and mix well.",
    "Stir in chocolate chips and dried cranberries.",
    "Line a small baking sheet with wax paper. Spread mixture onto sheet evenly. Move baking sheet to the freezer, and let sit for at least an hour before cutting into 12 bars.",
    "To store bars: Wrap in wax paper, and place in Ziploc bags or Tupperware containers in the freezer."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 c. date, organic1/2 c. almonds, organic, raw1/2 c. sunflower seeds, raw, unsalted, organic1/4 c. flax seeds, organic1 tsp. cinnamon, ground, organic3/4 c. oats, old fashioned rolled, dry, organic1/2 c. honey, raw, unfiltered, organic1/2 c. almond butter, organic, raw1 tsp. vanilla extract, organic1/4 c. cacao powder, raw, organic1/2 c. chocolate chips, dark, 70%, raw, organic1/2 c. cranberries, dried, organic"
  ],
  "__v": 1
}