{
  "__v": 1,
  "directions": [
    "0",
    "Prepare Pancake Batter: Whisk flours, sugar, cinnamon, baking powder and the salt in a medium bowl, set aside. Warm the milk until lukewarm, not hot (you should be able to keep your finger submerged for 10 seconds). Whisk milk, butter, egg and the vanilla together until blended.",
    "Make a well in the center of the flour mixture. Pour milk mixture into the well and stir with a fork until mixed and only small clumps of flour remain. Do not over mix batter.",
    "Note: The batter will be quite thick. If it is unreasonably thick, add 1 to 2 tablespoons more milk to thin it out a little.",
    "Cook Pancakes: Heat a large skillet (or use griddle) over medium heat. The pan is ready if when you splatter a little water onto the pan surface, the water dances around the pan and eventually evaporates.",
    "Lightly brush skillet with melted butter. Spoon a 1/4-cup of the batter onto the skillet and gently spread into a 4-inch circle. (If the batter is thick, you may need to use the back of a spoon to spread the batter into a circle).",
    "When edges look dry and bubbles start to appear and pop on the top surfaces of the pancakes, turn over, about 2 minutes. Once flipped, cook 1 to 2 minutes or until lightly browned and cooked in the middle. Serve warm with syrup, bananas or other toppings."
  ],
  "firstAdded": "2014-08-18T22:21:44.762000",
  "hash": "c498da45c8411b12f2ed901b8e0ce24a6e610729",
  "href": "http://www.inspiredtaste.net/25202/easy-whole-wheat-pancakes-recipe/",
  "image": "http://www.inspiredtaste.net/wp-content/uploads/2013/11/Whole-Wheat-Pancakes-Recipe-1.jpg",
  "ingredients": [
    "0",
    "3/4 cups (105 grams) whole wheat flour (we use Gold Medal flour)",
    "3/4 cups (105 grams) all-purpose flour (we use Gold Medal unbleached all-purpose flour)",
    "2 tablespoons sugar",
    "1/2 teaspoon ground cinnamon, optional",
    "1 tablespoon baking powder",
    "3/4 teaspoon kosher salt",
    "1 1/4 to 1 1/2 cups (295 to 350 ml) milk, whole or 2% reduced fat milk are best",
    "1 large egg",
    "4 tablespoons unsalted butter, melted, plus more for skillet",
    "1 1/2 teaspoons vanilla extract"
  ],
  "keywords": [
    "wheat",
    "use",
    "gold",
    "medal",
    "flour",
    "unbleached",
    "allpurpose",
    "sugar",
    "cinnamon",
    "baking",
    "kosher",
    "salt",
    "reduced",
    "fat",
    "milk",
    "best",
    "egg",
    "unsalted",
    "butter",
    "skillet",
    "vanilla"
  ],
  "title": "Easy Whole Wheat Pancakes Recipe",
  "users": [
    null
  ]
}