{
  "hash": "7c8b2f5be188b014f612142080cc13b7823524a1",
  "title": "Thai Coconut Curry Butternut Squash Soup",
  "image": "http://hostthetoast.com/wp-content/uploads/2014/10/Thai-Curry-Butternut-Squash-Soup-2.jpg",
  "href": "http://hostthetoast.com/thai-coconut-curry-butternut-squash-soup/",
  "extension": "Chrome",
  "firstAdded": "2016-11-30T04:52:01.818000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the oil in a large soup pot over medium heat. Add in the garlic and onion, and saute until soft and fragrant, about 3 minutes. Add in the ginger and curry paste and stir to combine with the onion and garlic. Cook for 3 more minutes, stirring often.",
    "Add in the raw butternut squash cubes and slowly pour in the broth, stirring to combine. Bring to a boil and then reduce heat to a simmer and cover. Cook for 20 minutes, or until butternut squash is tender. Remove from heat and let cool for a few minutes.",
    "Pour the soup into a blender in batches and blend until smooth. Pour the blended soup back into the soup pot over medium heat and warm through, stirring occasionally.",
    "Before serving, remove from heat and mix in the coconut milk (saving a few tablespoons to garnish), lime juice, salt, pepper, and Sriracha (if using). Mix well. Pour into bowls and drizzle the remaining coconut milk on top. Swirl the coconut milk with your spoon or a toothpick. Sprinkle with chopped cilantro and chopped peanuts. Serve warm with Naan bread."
  ],
  "ingredients": [
    "0",
    "1 tablespoon canola oil",
    "2 cloves garlic, minced",
    "1 small yellow onion, diced",
    "1 teaspoon ginger, freshly grated",
    "1½ tablespoons Thai red curry paste",
    "2 cups chicken or vegetable broth",
    "4 cups butternut squash, peeled, seeded, and cut into 1\" cubes",
    "1 (15-ounce) can coconut milk",
    "Juice of ½ lime",
    "½ teaspoon Sriracha, optional",
    "½ teaspoon salt",
    "¼ teaspoon freshly ground pepper",
    "⅓ cup cilantro, chopped, to garnish",
    "⅓ cup unsalted, dry-roasted peanuts, chopped, to garnish",
    "Naan, to serve"
  ],
  "__v": 1
}