{
  "hash": "aa84b32d282f503a5f8a598681b6dc6582c75743",
  "title": "Southern Cornbread",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2012/10/southern-cornbread-vertical-a-1200.jpg",
  "href": "https://www.simplyrecipes.com/recipes/southern_cornbread/",
  "extension": "Chrome",
  "firstAdded": "2018-01-25T02:21:09.875000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat pan with bacon drippings: Put the bacon drippings in a 9 or 10-inch cast iron skillet and put the skillet into the oven. Then preheat the oven to 400°F with the skillet inside. (If you don't have an iron skillet, you can use an uncovered Dutch oven or a metal cake pan.)",
    "Make the batter: Whisk together all the dry ingredients (cornmeal, baking soda, salt, sugar if using) in a large bowl. In another bowl, beat the egg (if using) and buttermilk until combined, then mix that into the bowl of dry ingredients. Stir in the melted butter.",
    "Pour batter into hot skillet and bake: When the oven is hot, take out the skillet (carefully, as the handle will be hot!). Add the cornbread batter and make sure it is evenly distributed in the skillet.",
    "Bake at 400°F for about 20 minutes, or until the edges are beginning to brown and a toothpick inserted in the center of the bread comes out clean.",
    "4 Rest bread in skillet, then serve: Let the bread rest for 10-30 minutes in the skillet before cutting it into wedges and serving.",
    "To avoid burning your hand because you've forgotten the pan is hot, I recommend placing a pot holder on the pan's handle while the cornbread is resting, or cooling the handle down a bit with an ice cube."
  ],
  "ingredients": [
    "0",
    "1 Tbsp bacon drippings",
    "2 cups cornmeal OR 1 1/2 cups cornmeal and 1/2 cup flour",
    "2 teaspoons baking soda",
    "1 teaspoon salt",
    "1 Tbsp sugar (optional)",
    "1 egg (optional)",
    "1 1/4 cups buttermilk",
    "6 Tbsp unsalted butter, melted"
  ],
  "__v": 1
}