{
  "hash": "284774014c72273d4b1b79f9699f8f9e96956022",
  "title": "Frallor",
  "image": "http://img.recept.nu/largeimage/frallor.jpg",
  "href": "http://www.recept.nu/okand/frallor/",
  "extension": "Chrome",
  "firstAdded": "2015-12-18T11:42:23.027000",
  "users": [
    null
  ],
  "keywords": [
    "fullfat",
    "coconut",
    "milk",
    "thai",
    "kitchen",
    "brand",
    "example",
    "oil",
    "gram",
    "semi",
    "choc",
    "chips",
    "vanilla"
  ],
  "directions": [
    "0",
    "Gör så här",
    "Smula jästen i en bunke.",
    "Blanda vatten och mjölk och häll lite över jästen.",
    "Rör om så att jästen löser sig.",
    "Tillsätt resten av vatten- och mjölkblandning, salt och honung.",
    "Rör ner fullkornsvetemjöl och det mesta av vetemjölet (spara ca 1 dl till utbakningen).",
    "Arbeta snabbt ihop den lösa degen.",
    "Strö över lite vetemjöl, täck med bakduk och låt degen jäsa 1–1 ½ timme. Den ska bara jäsa en gång.",
    "Strö ut ca ½ dl vetemjöl på bakbordet och tippa försiktigt ut den lösa degen. Obs! Knåda inte – jäsbubblorna ska vara kvar.",
    "Strö ytterligare lite vetemjöl över degen, ca ½ dl.",
    "Platta försiktigt och lätt ut degen med handen till ca 30 x 40 cm.",
    "Skär snabbt degen i 6–7 cm smala remsor. Det går lättast med en degskrapa av metall.",
    "Dela varje remsa i 2–3 delar på snedden. Det gör ingenting om bröden inte får samma form, bara de får ungefär samma storlek.",
    "Vik ihop och lägg bröden (de är fortfarande lösa) på plåtar med bakplåtspapper eller direkt på perforerade plåtar.",
    "Grädda genast i intervallånga 230º i 5 minuter från det att ugnen är varm.",
    "Ändra till varmluft 230˚ och fortsätt grädda i ytterligare 4–5 minuter tills bröden får fin, ljusbrun färg.",
    "Låt svalna på galler utan bakduk, så blir brödskorpan härligt frasig."
  ],
  "ingredients": [
    "0",
    "160 ml full-fat coconut milk (from a can, like Thai Kitchen brand for example)",
    "15 ml coconut oil",
    "55 gram semi sweet choc chips",
    "1 teaspoon vanilla extract"
  ],
  "__v": 3
}