{
  "hash": "16ef89f50d5b1ed6a9702ecfea3a275f894a7a2e",
  "title": "Grain Free Vanilla Bean Birthday Cake",
  "image": "//www.everydaymaven.com/wp-content/uploads/2015/01/IMG_5033edit.jpg",
  "href": "http://www.everydaymaven.com/2015/grain-free-vanilla-bean-birthday-cake/",
  "extension": "",
  "firstAdded": "2016-01-01T15:17:47.788000",
  "users": [
    null
  ],
  "keywords": [
    "unsalted",
    "butter",
    "greasing",
    "pans",
    "room",
    "organic",
    "sugar",
    "eggs",
    "plain",
    "hemp",
    "fat",
    "cows",
    "milk",
    "vanilla",
    "bean",
    "pods",
    "scraped",
    "mixed",
    "almond",
    "flour",
    "coconut",
    "gluten",
    "free",
    "baking",
    "salt",
    "equipment",
    "round",
    "cake",
    "stand",
    "handheld",
    "mixer",
    "tester",
    "cooling",
    "racks"
  ],
  "directions": [
    "0",
    "Instructions",
    "Begin by preheating oven to 350F. Drop ½ Tablespoon of butter into each pan and spread around until each cake pan is greased. Set aside.",
    "In the bowl of a stand mixer (or a large mixer to be used with a hand mixer), cream together room temperature butter and sugar until smooth. I used speed 4 on my Kitchen Aid Stand Mixer.",
    "While mixer is still on speed 4, add in eggs, one at a time. TIP: Make sure to crack your eggs individually into a separate dish or bowl before adding to batter to avoid any shells.",
    "Reduce mixer speed to 2 and slowly add in milk and vanilla bean seeds until well mixed.",
    "In a separate mixing bowl, combine almond flour, coconut flour, baking powder and sea salt. Use a spatula or fork to mix around and get rid of any large lumps.",
    "Add flour mixture into wet ingredients in small batches with mixer still running on lower speed (about 2 should work). Repeat until all flour is incorporated into batter and is thoroughly mixed and looks creamy.",
    "Divide batter into cakes pans, use a spatula to spread around and even out top and bang the cake pans a couple times to allow any air bubbles to rise to the surface.",
    "Place both cake pans into the oven on the center rack and bake for 40 minutes, alternating the cake pans at the halfway point (mostly because most ovens have hot spots and this helps with a more even bake time).",
    "Use a cake tester or wood toothpick to gently test the center of each cake. If it comes out clean, place cake pan on cooling rack. If the tester comes out with cake batter on it, place back in the oven and check again in 3 to 4 minutes.",
    "Allow cakes to cool for at least 30 to 45 minutes in the pans on a cooling rack. Grab a flat plate and place on top of cake. Gently flip over so that cake releases onto plate and place wax paper on bottom of cake. Place cooling rack under wax paper and gently flip back over so that cake is now cooling on a piece of wax paper on the cooling rack.",
    "Allow cakes to cool completely - this may take a couple of hours - before frosting. Like I said in the notes, I like to make these the day before and allow to sit out and cool for most of the day. They are much easier to work! Right before frosting, use a sharp paring knife to gently scrape the top layer of each cake. This two layers will become the inside and it looks prettier if you don't see dark cake next to light frosting. If you are using a dark frosting like chocolate, skip this step!",
    "I used this Frosting recipe and placed the cake on wax paper on a cake board I bought from a craft store for a couple of bucks. You could also use a cake stand or other cake platter. Frost as desired, serve and Enjoy!",
    "Tweet",
    "Share",
    "Pin",
    "EverydayMaven.com is a p"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1½ cups unsalted butter + 1 Tablespoon for greasing the pans, at room temperature",
    "2 cups organic sugar",
    "8 large eggs, room temperature",
    "1 cup plain, unsweetened hemp milk (or full fat cow's milk)",
    "2 vanilla bean pods, scraped and mixed with milk",
    "12 ounces (340 grams) blanched almond flour",
    "4 ounces (113 grams) coconut flour",
    "4 teaspoons gluten free baking powder",
    "½ teaspoon finely ground sea salt",
    "Additional Equipment:",
    "Two 9\" x 2\" round cake pans",
    "Stand Mixer or Handheld Mixer",
    "Cake Tester",
    "Cooling Racks"
  ],
  "__v": 1
}