{
  "hash": "4c7c80d9d9c80b30935383b1ebfe48c421b07c15",
  "title": "Pita Bread",
  "image": "http://4.bp.blogspot.com/-bX_95DfOYN0/TuA5TFWjRBI/AAAAAAAAJFc/ykyVpB-wU9U/s320/IMAG0551.jpg",
  "href": "http://freelifeglutenfree.blogspot.com/2011/12/pita-bread.html",
  "extension": "",
  "firstAdded": "2015-11-13T21:16:54.482000",
  "users": [
    null
  ],
  "keywords": [
    "water",
    "fastrising",
    "yeast",
    "honey",
    "olive",
    "oil",
    "apple",
    "cider",
    "vinegar",
    "flour",
    "blend",
    "salt"
  ],
  "directions": [
    "0",
    "Directions:",
    "In a small bowl mix together water, yeast, honey, oil, and vinegar. Let sit for 5 minutes to proof.",
    "In a stand mixer, combine flour and salt. Add in the yeast mixture and mix on low until combined.",
    "Add in enough additional water to make the dough sticky but stay together as a ball. This won't be the typical gluten-free bread dough which is a thick, sticky batter. It's does actually resemble regular bread dough, but is quite a bit sticky. I added in just over 1/4 cup to get mine to the right consistency.",
    "Once the consistency is right, mix it on high speed for 3-5 minutes.",
    "Turn the dough out on a floured surface and divide into 8 pieces.",
    "Flatten each piece with your fingers and the palm of your hand, shaping it into a round. Each pita should be about 5-6 inches. Place the rounds in a warm place (I placed mine on parchment paper on top of my range...it's always the perfect temp for rising breads, especially if you're preheating the oven at the same time). and cover them with a towel. Let rise for 30 minutes or until they start to get puffy.",
    "Place a pizza stone on the lowest rack of the oven and preheat the oven to 500F. Spray the dough rounds lightly with water right before placing them in the oven. Bake each pita for 4-5 minutes, or until the bread puffs. Make sure to keep the other rounds covered while the pitas in the oven are cooking.",
    "Remove the pita from the oven and place in a brown paper bag and seal it to steam and soften the bread. After they've steamed for at least 5 minutes, place in Ziploc bags to keep them soft. When you cut them in half, if there isn't a hole in the middle, go ahead and slice down inside of the bread to make one."
  ],
  "ingredients": [
    "0",
    "1 1/4 cup warm water",
    "1 tablespoon fast-rising yeast",
    "1 tablespoon honey",
    "2 tablespoon olive oil",
    "1 teaspoon apple cider vinegar",
    "3 cups GF flour blend",
    "1 teaspoon salt",
    "1/4-1/2 cup additional warm water"
  ],
  "__v": 1
}