{
  "hash": "aad74d6647c7089aa8ccb50c888d5b4c25060339",
  "title": "Chocolate Lava Cake",
  "image": "",
  "href": "http://recipe-folder.com/recipe/5b7730c83d946d7ece1c64c5",
  "extension": "User Added",
  "firstAdded": "2018-08-17T20:32:08.708000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "We’re going to start by melting chocolate in a double boiler. Boil some water in a pot and place a large glass bowl on top to melt the chocolate in. Place 4 ounces of dark chocolate in the glass bowl and use a rubber spatula to mix. Be sure to keep the water at a simmer, and melt until nice and smooth. Slowly drizzle in ½ cup of heavy cream and stir.",
    "1",
    "Once mixture is fully combined and smooth, place in freezer for 1 hour or until frozen.",
    "2",
    "Using the double boiler again, melt 10 ounces of dark chocolate and 1 ½ sticks of butter (12 Tbsp), mixing until smooth.",
    "3",
    "In a separate bowl combine 6 large eggs and ½ a cup of light brown sugar. Beat the eggs together until they are light and frothy, and then add 1 tsp of vanilla extract and 2 Tbsp of Grand Marnier.",
    "4",
    "Once that’s combined, SLOWLY add the chocolate mixture to egg and brown sugar mixture, and whisk to combine.",
    "5",
    "Now add 6 Tbsp of all purpose flour and stir to combine.",
    "6",
    "Butter some ramekins and coat the inside with raw sugar. This will help get the cakes out of the ramekins.",
    "7",
    "Fill each ramekin a little under halfway with your cake mixture.",
    "8",
    "Remove the chocolate ganache from the freezer and place 1-2 Tbsp into the center of the cake mixture. Fill ramekins the rest of the cake batter.",
    "9",
    "Preheat your oven to 425° F and bake for 11 minutes.",
    "10",
    "While that’s baking quarter some strawberries and set aside.",
    "11",
    "Remove cake ramekins from oven and place on a cooling rack. Run a knife around the edge of each cake to help release them from their ramekin.",
    "12",
    "Place a plate on top of the ramekin, flip over so the ramekin is on top, and slowly lift up to make sure the cake is in tact.",
    "13",
    "Plate with some whipped cream, powdered sugar, cocoa powder, strawberries and blueberries.",
    "14",
    "Serve and enjoy!"
  ],
  "ingredients": [
    "0",
    "14 ounces dark chocolate",
    "1",
    "½ cup heavy cream",
    "2",
    "12 Tbsp butter",
    "3",
    "6 large eggs",
    "4",
    "½ cup of light brown sugar",
    "5",
    "1 tsp vanilla extract",
    "6",
    "2 Tbsp Grand Marnier",
    "7",
    "6 Tbsp all purpose flour",
    "8",
    "Raw Sugar",
    "9",
    "Strawberries",
    "10",
    "Blueberries",
    "11",
    "Powdered sugar",
    "12",
    "Cocoa powder"
  ],
  "__v": 1,
  "hidden": true
}