{
  "hash": "416e68bddf4fc8dcb0dd10aca1a4f45739fd1889",
  "title": "Thai Iced Tea Recipe",
  "image": "//whiteonricecouple.com/recipe/images/thai-tea-recipe-thumb-200.jpg",
  "href": "http://whiteonricecouple.com/recipes/thai-tea-recipe/",
  "extension": "Chrome",
  "firstAdded": "2015-09-09T17:29:05.699000",
  "users": [
    null,
    null
  ],
  "keywords": [
    "pantai",
    "thai",
    "tea",
    "water",
    "granulated",
    "sugar",
    "folks",
    "use",
    "coconut",
    "sweetened",
    "condensed",
    "milk",
    "ice",
    "organic",
    "black",
    "anise",
    "stars",
    "green",
    "cardamom",
    "pod",
    "smashed"
  ],
  "directions": [
    "0",
    "Bring water to boil and add the thai tea mix. Add sugar and gently stir to completely dissolve sugar. Gently boil tea for about 3 minutes. Remove from heat.",
    "Allow tea to steep for at least 30 minutes and allow it to cool. The more concentrated the tea flavor, the better the Thai tea tastes.",
    "If you are using the Thai tea mix, strain the tea leaves. Set finished Thai tea aside to cool.",
    "You can make this ahead of time and have the Thai tea chilling in the fridge. We usually like to make this tea mix one day ahead.",
    "Fill glasses with ice and pour in Thai tea leaving enough room to fill in your half and half (or other creamer). For an 8 oz. glass we like to add about 2-3 tablespoons of half and half for a creamier flavor.",
    "1",
    "Bring water to boil and add the tea bags, sugar, anise starts, cardamom pod and cloves. Stir until all the sugar disolves. Gently boil tea for about 3 minutes. Remove from heat.",
    "Allow tea to steep for at least 30 minutes and allow it to cool. The more concentrated the tea flavor, the better the Thai tea tastes. We prefer to allow the tea bags to seep for about 2 hours for maximum flavor. During this time, the thai tea can cool.",
    "Remove the tea bags and spoon out the anise starts, cardamom pod and cloves. If tea is still warm, we will refrigerate it so it can be chilled.",
    "You can make this ahead of time and have the organic Thai tea chilling in the fridge.",
    "Fill glasses with ice and pour in organic Thai tea leaving enough room to fill in your half and half (or other creamer). For an 8 oz. glass we like to add about 2-3 tablespoons of half and half for a creamier flavor."
  ],
  "ingredients": [
    "0",
    "1 cup (80g) Pantai Thai Tea Mix",
    "4 cups (950ml) water",
    "3/4 cup (150g) granulated sugar",
    "about 1 cup (240ml) half and half (some folks also use coconut milk, whole milk, sweetened condensed milk)",
    "ice",
    "1",
    "4 cups water",
    "4 organic black tea bags",
    "3/4 cups granulated sugar",
    "2 anise stars",
    "1 green cardamom pod, smashed",
    "2 whole cloves",
    "about 1 cup (240ml) half and half (some folks also use coconut milk, whole milk, sweetened condensed milk)",
    "ice"
  ],
  "__v": 2
}