{
  "hash": "2303360d7966aae5a398ba5c495ac807f4646638",
  "title": "Pumpkin Magic Bars",
  "image": "http://media.paleomg.com/2016/09/A04CEB1E-4F79-45EE-8947-20BE19A207F3-150x150.jpg",
  "href": "http://paleomg.com/pumpkin-magic-bars/",
  "extension": "Chrome",
  "firstAdded": "2016-10-27T19:21:06.785000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 325 degrees F.",
    "Place all pumpkin cream ingredients in a saucepan, except for the arrowroot powder, and whisk. Let come to boil and reduce for about 20 minutes. It should reduce by almost half. Once reduced, whisk in arrowroot powder until completely combine. Set aside.",
    "Grease an 8x8 glass baking dish and line with parchment paper and grease once more. Add all ingredients for the crust into a food processor and pulse until completely combine. The dough should combine into a slight ball once combine. Put dough in the greased dish and use your fingers to press dough around evenly throughout the dish, pressing the dough higher on the sides. Use a fork to poke about 10-12 holes in to keep the crust from rising as it bakes. Bake crust for 15 minutes. Turn oven temperature up to 400 degrees.",
    "Once baked, remove from oven and place chopped pecans on top. Then pour the pumpkin layer on top and spread out evenly. Next the chocolate chips and then shredded coconut.",
    "Place in oven to bake for 8-10 minutes, until coconut has browned. Remove from oven and let cool completely then place in the fridge to set for about 1-2 hours. You really want it to cool completely because the pumpkin will be very runny if it hasn't cooled.",
    "Once cool, drizzle on some caramel sauce, if you like, and cut into squares and eat up!"
  ],
  "ingredients": [
    "0",
    "1 cup of canned full fat coconut milk",
    "1 cup of Pacific Foods Organic Pumpkin Puree",
    "2 tablespoons maple syrup",
    "1 tablespoon pumpkin pie spice",
    "1 teaspoon vanilla extract",
    "1 tablespoon arrowroot powder",
    "1",
    "1½ cup almond flour",
    "¼ cup + 1 tablespoon coconut flour",
    "¼ cup + 1 tablespoon tapioca flour",
    "½ teaspoon baking soda",
    "4 tablespoons ghee",
    "4 tablespoons maple syrup",
    "1 teaspoon vanilla extract",
    "2",
    "1 cup pecans, chopped",
    "1 cup unsweetened shredded coconut",
    "1 cup mini chocolate chips",
    "optional: Vanilla Bean Caramel Sauce from Juli Bauer's Paleo Cookbook (on page 250), for garnish"
  ],
  "__v": 1
}