{
  "hash": "ddbc1999e4450bb100f18c37dd3bdfdb981ac00f",
  "title": "Garlic Lime Steak and Noodle Salad",
  "image": "https://farm2.staticflickr.com/1746/40676995570_755baee57f_z.jpg",
  "href": "https://smittenkitchen.com/2018/06/garlic-lime-steak-and-noodle-salad/",
  "extension": "Chrome",
  "firstAdded": "2018-08-07T16:46:59.466000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make marinade and dressing: Combine brown sugar, smaller amount of fish sauce, lime juice, garlic, and chili heat of your choice in a medium bowl. Taste it; you want it to be salty and sour first, followed by sweetness and heat; I usually find I need more fish sauce.",
    "Place steak in a sealable freezer bag. Pour in about 1/3 of this mixture and press all of the air out of the bag so it stays on the meat. Place steak in the fridge for about an hour and up to a day. I am usually in a rush, and just marinate it for as long as I am prepping everything else.",
    "Slowly whisk 3 tablespoons oil into remaining marinade; this is now your dressing. Adjust flavors, again, to taste. Set aside until needed.",
    "Prepare other salad ingredients: Bring a medium pot of salted water to boil. For regular sized green beans, cook them for 2.5 minutes; for haricot vert (skinny green beans), cook them for 2 minutes, then scoop out with a slotted spoon and drop into a bowl of ice water to cool, then drain and transfer to a bowl.",
    "I use the water again to cook the noodles according to package directions; mine say to remove the boiling water from the heat, add the noodles, and let them soak for 5 minutes, until softened. Drain, place in bowl, and set aside until needed. If they get sticky, you can run cold water over them, or toss them with a splash of oil.",
    "To grill steak: Get your grill really hot and lightly coat grates with oil. Remove steak from marinade and cook for about 3 1/2 minutes, and up to 5 minutes, per side, depending on thickness. Season both sides with salt and pepper as you grill. (I did 4 minutes per side in the thinnish flank steaks shown, and they were too medium for our tastes, but your mileage may vary.) Remove Let rest for 5 minutes before slicing very thin and putting on a serving plate.",
    "To serve: Place cherry tomatoes, cucumbers (see Note), and herbs each in their own bowl with a spoon for serving. I like to put out extra sliced bird’s eye chili on the side, splashing a little rice or plain vinegar on it for extra kick. Put out your noodles, steak, and salad dressing too. A tiny ladle (I have one like this) is ideal for the dressing, because mine always separates, and this allows people to stir a bit before spooning it over.",
    "To eat! We like to start with a small pile of noodles, followed by a few slices of steak, big spoonfuls of each vegetable, a few chilis, and a ladle of the dressing, followed by the herbs (don’t skimp; they’re perfect here). Repeat as needed."
  ],
  "ingredients": [
    "0",
    "1/4 cup (50 grams) brown sugar, light or dark",
    "3 to 4 tablespoons (45 to 60 ml) fish sauce, to taste",
    "1/3 cup (80 ml) lime juice",
    "2 to 3 cloves garlic, minced",
    "Thai chili powder, red chili flakes, or thinly sliced Thai/bird’s eye chili to taste",
    "1 1/4 pound (565 grams) flank steak",
    "3 tablespoons (45 ml) vegetable or another neutral oil, plus more for grill",
    "8.8-ounce (250 grams) package thin rice noodles (I used these)",
    "1 pound (455 grams) green beans, trimmed",
    "Salt and freshly ground black pepper",
    "8 ounces (225 grams) cherry tomatoes, halved (mixed colors are lovely here)",
    "12 ounces (340 grams) Persian-style small cucumbers, unpeeled, thinly sliced",
    "About 1/2 cup chopped mix of fresh cilantro and mint"
  ],
  "__v": 1
}