{
  "hash": "a7fccbe226bb1ff4e17431b21f048d76cb82760c",
  "title": "MEAT SAUCE BOLOGNESE",
  "image": "",
  "href": "http://lidiasitaly.com/recipes/meat-sauce-bolognese/",
  "extension": "Chrome",
  "firstAdded": "2018-02-28T17:02:22.021000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat the olive oil in a wide, 3 to 4-quart pan or Dutch oven over medium heat. Stir in the onion, carrot and celery, season them lightly with salt and cook, stirring, until the onion is translucent. Crumble in the ground beef and pork and continue cooking, stirring to break up the meat, until all the liquid the meat has given off has evaporated and the meat is lightly browned, about 10 minutes. Pour in the wine and cook, scraping the bottom of the pan, until the wine is evaporated, 3 to 4 minutes. Stir in the tomato paste and cook a few minutes, then pour in the tomatoes, toss in the bay leaves, and season lightly with salt and pepper. Bring to a boil, then lower the heat so the sauce is at a lively simmer. Cook, stirring occasionally, until the sauce is dense but juicy and a rich, dark red color. This will take about 2 to 3 hours—the longer you cook it, the better it will become. While the sauce is cooking, add hot water as necessary to keep the meats and vegetables covered. (Most likely, a noticeable layer of oil will float to the top toward the end of cooking. Once finished, the oil can be removed with a spoon or reincorporated in the sauce, which is what is traditionally done."
  ],
  "ingredients": [
    "0",
    "3 tablespoons extra virgin olive oil",
    "1 medium yellow onion, minced (about 1 cup)",
    "1 medium carrot, peeled and finely shredded (about 1/2 cup)",
    "1/2 cup minced celery with leaves",
    "2 teaspoons kosher salt",
    "1 pound ground beef",
    "1 pound ground pork",
    "1/2 cup dry red wine",
    "1 tablespoon tomato paste",
    "3 cups canned Italian plum tomatoes, preferably San Marzano, crushed by hand or passed through a food mill",
    "3 fresh or 4 dried bay leaves",
    "Freshly ground black pepper to taste",
    "4 cups hot water, or as needed"
  ],
  "__v": 1
}