{
  "hash": "f88783448a7ece2bc0e3a5aeb159f28ab86fcf91",
  "title": "Chinese Style Butter Cookie with Black Sesame",
  "image": "http://www.chinasichuanfood.com/wp-content/uploads/2015/06/Chinese-Style-Butter-Cookie-with-black-sesame-2.jpg",
  "href": "http://www.chinasichuanfood.com/chinese-style-butter-cookie-with-black-sesame/",
  "extension": "Chrome",
  "firstAdded": "2016-05-04T18:08:49.950000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Mix sugar and salt with butter in a deep bowl and then cream with an electric mixer until very light and fluffy. This step is really important cause it will influence the texture if the final mixture and the taste of the baked cookie.",
    "Add egg yolk, vanilla extract and whipping cream and whip until all the ingredients are well combined.",
    "Sift the low-gluten flower in, garnish toasted black sesame and use a rubber spatula to combine the mixture well. And then transfer the mixture in a pastry bag assembled with coupler and tip. You can choose to use any tip that can make gorgeous swirled roses.",
    "Firstly, get the baking sheet lined and pre-heat the oven to 175 degree C.",
    "Start to pipe the rose cookies: hold the pastry bag vertically and start in the center and uniformly rotate the pastry bag while pushing the mixture with uniform force. Space the cookie around 4cm apart.",
    "Bake in middle rack for 15-20 minutes. Check in the ending minutes until they get a slightly brown color. Wait for several minutes and then transfer to wire rack to cool down.",
    "Keep all the cookies within airtighter container."
  ],
  "ingredients": [
    "0",
    "Making around 15 cookies",
    "80g unsalted butter (room temperature)",
    "30g icing sugar, sifted",
    "1 egg yolk",
    "Really small pinch of salt",
    "25ml whipping cream",
    "1/2 teaspoon vanilla extract (optional)",
    "100g low-gluten flower (cake flour or self-raising flour)",
    "1 and 1/2 tablespoon toasted black sesame seeds or more as needed"
  ],
  "__v": 1
}