{
  "hash": "ea6bdca166a9d6d6662d82837c00ddf2c734104b",
  "title": "Cozy Butternut, Sweet Potato, and Red Lentil Stew",
  "image": "https://cdn1.blovcdn.com/bloglovin/aHR0cCUzQSUyRiUyRmNkbi5vaHNoZWdsb3dzLmNvbSUyRndwLWNvbnRlbnQlMkZ1cGxvYWRzJTJGMjAxNiUyRjExJTJGY296eWJ1dHRlcm51dC1zd2VldC1wb3RhdG8tcmVkLWxlbnRpbC1zdGV3LTU0MjQtMTAyNHg2ODMuanBn?checksum=311fa5b56b955b6000c6c5b9b43be50d1ccd54cc&format=j",
  "href": "https://www.bloglovin.com/blogs/oh-she-glows-351255/cozy-butternut-sweet-potato-red-lentil-stew-5284939681",
  "extension": "Chrome",
  "firstAdded": "2016-11-24T15:28:17.353000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "To a large pot, add the oil, onion, and garlic. Stir to combine. Increase the heat to medium and sauté for 3 to 5 minutes, until the onion is softened.",
    "Add the squash and sweet potato and stir to combine. Add a pinch of salt and continue sautéing for a few minutes longer.",
    "Add the broth, diced tomatoes (with juices), coconut milk, lentils, tomato paste, turmeric, cumin, chili powder, cayenne, salt, and pepper. (If you are spice-shy, feel free to add half the amount to start and increase from there after cooking, to taste.) Stir well to combine.",
    "Increase heat and bring to a boil. Reduce the heat to medium, stir again, and simmer uncovered for about 30 minutes, stirring occasionally, until the squash and potato are fork-tender. Reduce the heat if necessary.",
    "Add the apple cider vinegar to taste. Adjust the other seasonings if desired.",
    "Optional step: Using a handheld immersion blender, blend the stew for only 2 to 3 seconds (any more and you’ll blend too much of the veggies). This thickens the broth.",
    "Stir in the chard, and cook for another couple minutes until the greens are wilted.",
    "Scoop some cooked rice onto the bottom of a bowl and then ladle the stew overtop. Garnish with minced cilantro or parsley and a good dusting of garlic and chili powder, if desired.",
    "Leftovers will keep in the fridge for up to 5 days, and they freeze beautifully too.",
    "Tips:",
    "* Make sure to dice the squash and potato very small (about the size of almonds), as this will expedite cooking. Also, if you are short on time, you can skip peeling the butternut squash as the skin is edible. (I don’t recommend skipping peeling the potato, though.)",
    "** You can swap the red lentils for 1 (14-ounce/398 mL) can chickpeas (drained and rinsed).",
    "*** You can swap the chard for 5 ounces of baby spinach or a bunch of kale (stemmed). I recommend chopping the greens into small bite-size pieces for easier eating."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "For the stew:",
    "2 tablespoons (30 mL) extra-virgin olive oil",
    "1 medium onion, diced (about 2 cups/280 g)",
    "3 to 4 large garlic cloves, minced",
    "3 cups (400 g) peeled, seeded, and diced butternut squash*",
    "1 large sweet potato (450 g), peeled and diced (2 1/2 cups/340 g)*",
    "3 cups (750 mL) low-sodium vegetable broth",
    "1 (14-ounce/398 mL) can diced tomatoes",
    "1 (14-ounce/398 mL) can light coconut milk",
    "1/2 cup (100 g) dried red lentils, rinsed**",
    "3 tablespoons (45 mL) tomato paste",
    "1 1/2 teaspoons ground turmeric",
    "1 1/2 teaspoons ground cumin",
    "1/2 teaspoon chili powder",
    "1/4 teaspoon cayenne pepper, or more if you like heat",
    "Fine sea salt, to taste (I use 1 1/2 teaspoons pink salt)",
    "Freshly ground black pepper, to taste",
    "3 teaspoons (15 mL) apple cider vinegar, or to taste",
    "1 bunch chard, stemmed and finely chopped***"
  ],
  "__v": 1
}