{
  "hash": "76636157e95801c8c3961ec21efb8dbe61f30623",
  "title": "CHOCOLATE TIRAMISU (GRAIN-FREE)",
  "image": "//deliciouslyorganic.net/wp-content/uploads/2015/08/Chocolate-Tiramisu-Recipe-Grain-Free.jpg",
  "href": "http://deliciouslyorganic.net/chocolate-tiramisu-grain-free-paleo/",
  "extension": "Chrome",
  "firstAdded": "2016-02-14T13:50:15.418000",
  "users": [
    null
  ],
  "keywords": [
    "nutfree",
    "chocolate",
    "cake",
    "recipe",
    "strong",
    "brewed",
    "herbal",
    "coffee",
    "whip",
    "coconut",
    "cream",
    "paleo",
    "option",
    "using",
    "method",
    "maple",
    "syrup",
    "cocoa"
  ],
  "directions": [
    "0",
    "Instructions",
    "Preheat the oven to 350ºF and adjust the rack to the middle position. Oil a 18 x 26 - inch baking sheet. Place a piece of parchment paper (that exactly fits the dimensions of the baking sheet) on the pan. Brush again with oil or butter.",
    "Pour the chocolate cake batter on the prepared baking sheet and spread evenly. Bake for 20-23 minutes until a cake tester inserted in the center comes out clean. Cool completely.",
    "Using a pastry brush, brush the entire cake with coffee.",
    "Pour the heavy cream and maple syrup in the bowl of a standing mixer. Whisk on medium-high until soft peaks form.",
    "If serving in round glasses then take one of the glasses as a cookie-cutter and cut rounds out of the chocolate cake. Then, take a knife and trim the each circle just a little bit (this will enable the cake circles to easily slide into the glasses). Place a round of cake on the bottom of a glass. Place a nice spoonful of whipped cream on top of the cake round and spread evenly. Dust with cocoa powder. Repeat with another layer of cake, whipped cream and cocoa. Serve."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 recipe nut-free chocolate cake (see recipe here)",
    "1/2 cup strong brewed coffee (or an herbal coffee)",
    "2 cups heavy cream (or you can whip coconut cream for a Paleo option using this method)",
    "3 tablespoons maple syrup",
    "1/4 cup cocoa powder"
  ],
  "__v": 1
}