{
  "hash": "804b285841e4476a312bdd8dc09df7527d5f4a51",
  "title": "Chicken Parmesan Baked Pasta",
  "image": "https://farm6.staticflickr.com/5117/14054601777_946de1b75e_z.jpg",
  "href": "http://fakeginger.com/2014/05/22/chicken-parmesan-baked-pasta/",
  "firstAdded": "2015-02-20T01:44:36.233000",
  "users": [
    null
  ],
  "keywords": [
    "tomatoes",
    "olive",
    "oil",
    "garlic",
    "oregano",
    "red",
    "pepper",
    "kosher",
    "salt",
    "water",
    "lowsodium",
    "chicken",
    "broth",
    "pasta",
    "parmesan",
    "divided",
    "black",
    "mozzarella",
    "boneless",
    "skinless",
    "breasts",
    "pieces",
    "basil"
  ],
  "directions": [
    "0",
    "Preheat the oven to 400F.",
    "Add the tomatoes to the bowl of your food processor and pulse until coarsely chopped, about 10 pulses.",
    "Set an oven-safe 12-inch skillet over medium-high heat. Add the oil, garlic, oregano, red pepper flakes, and salt and cook just until fragrant, about 1 minute. Add the chopped tomatoes, the water, 1 cup of the chicken broth, and the pasta to the pan, stirring to combine. Bring the mixture to a vigorous simmer, then cover the pan and continue simmering (you may need to reduce the heat slightly) until the pasta is tender, about 16-18 minutes. Stir the pasta frequently as it cooks.",
    "Once tender, remove the cover and stir in 3/4 cup of the Parmesan cheese, the pepper, and the chicken. Season to taste with additional salt and pepper if necessary. If the mixture seems dry, mix in as much of the remaining 1/2 cup of chicken broth as needed to loosen it up. Sprinkle the top evenly with the mozzarella cheese and the remaining Parmesan cheese.",
    "Transfer the pan to the oven and bake for 5-10 minutes, or until the cheese has melted and bubbles around the edges. Garnish with the basil before serving."
  ],
  "ingredients": [
    "0",
    "1 (28 ounce) can whole peeled tomatoes",
    "1 tablespoon olive oil",
    "6 garlic cloves, minced",
    "1/4 teaspoon dried oregano",
    "1/8 teaspoon crushed red pepper flakes",
    "1/4 teaspoon kosher salt",
    "2 cups water",
    "1 – 1 1/2 cups low-sodium chicken broth",
    "12 ounces pasta",
    "1 cup grated Parmesan, divided",
    "1/4 teaspoon black pepper",
    "1 cup shredded mozzarella",
    "1 pound boneless, skinless chicken breasts, cooked and cut into bite-sized pieces",
    "2 tablespoons chopped fresh basil"
  ],
  "__v": 1
}