{
  "hash": "8d4e862b31934171d80f2204467d492b0107d84e",
  "title": "Seven-Hour Lamb",
  "image": "//files.meilleurduchef.com/mdc/photo/recipe/seven-hour-lamb/seven-hour-lamb-1200.jpg",
  "href": "https://www.meilleurduchef.com/cgi/mdc/l/en/recipe/seven-hour-lamb.html",
  "extension": "Chrome",
  "firstAdded": "2016-03-10T13:59:33.850000",
  "users": [
    null
  ],
  "keywords": [
    "leg",
    "lamb",
    "carrot",
    "onions",
    "garlic",
    "sprig",
    "thyme",
    "bay",
    "leaves",
    "sprigs",
    "parsley",
    "tomatoes",
    "veal",
    "stock",
    "dry",
    "white",
    "wine",
    "flour",
    "peppercorns",
    "salt",
    "pepper",
    "utensils",
    "matfer",
    "boning",
    "knife",
    "stainless",
    "steel",
    "mixing",
    "bowl"
  ],
  "directions": [
    "0",
    "Method for Seven-Hour Lamb:",
    "1",
    "Before starting this Seven-Hour Lamb recipe, make sure you have organised all the necessary ingredients.",
    "2",
    "Start by boning the leg along the bone, using a boning knife.",
    "3",
    "Trim the meat around the articulation and cut to remove the bone.",
    "4",
    "Keep the bone and trimmings.",
    "5",
    "Using cooking string, tie the leg up in order to give it its initial shape...",
    "6",
    "... and to prevent it from coming apart while cooking.",
    "7",
    "Peel the carrots and onions and cut into a coarse mirepoix.",
    "8",
    "In a sauté pan with sunflower oil, brown the trimmings, carrots, 2 whole garlic cloves, 2 sprigs of parsley, onions and bone.",
    "9",
    "When the ingredients have a golden brown colour...",
    "10",
    "... add the veal stock...",
    "11",
    "... and the white wine, peppercorns and a pinch of salt.",
    "12",
    "Simmer on a gentle boil for 30 minutes...",
    "13",
    "... with a lid on.",
    "14",
    "In the meantime, heat the leg in a casserole or frying pan...",
    "15",
    "... and brown on all sides. Browning the meat on all sides prevents it from releasing its juices while cooking.",
    "16",
    "When the meat is a nice golden brown, place the leg into a recipient that is sufficiently big and that can be sealed with dough (a casserole dish for example).",
    "17",
    "Add the tomatoes cut into quarters, the bay leaves, a sprig of thyme...",
    "18",
    "... and the stock. You can adjust the amount of liquid by adding brown veal stock. The leg should be immersed halfway up.",
    "19",
    "In a mixing bowl, make a flour dough by working flour and water together.",
    "20",
    "The dough should have the consistency of a sticky bread dough.",
    "21",
    "Place a string of dough around the edge of the casserole.",
    "22",
    "Place the lid on top and work the dough back onto the lid in order to seal it properly. This operation is referred to as 'luter'.",
    "23",
    "Place in the oven, making sure the casserole is in the centre of the oven. Heat the oven to 120°C (gas 1/2) and cook for 7 hours. It is best to prepare this recipe the day before. When cooked, simply leave the casserole in the oven (turned off) overnight. The leg of lamb will cool down in the oven during the night.",
    "24",
    "The following day...",
    "25",
    "... break the dough seal and remove the lid. Use a knife (preferably with a stiff blade) if needed. Take extra precautions to avoid cuts.",
    "26",
    "Gently remove the leg of lamb from the casserole. At this stage, the meat is really moist, hence the need to handle it gently. Place the tomato quarters on a separate tray.",
    "27",
    "Remove the string and place the lamb on the baking tray. Reheat in the oven for 15-20 minutes on high heat. In the meantime, sieve the remaining cooking juices. Bring to a boil, extract the fact and season to taste. Serve the sauce separately in a sauce boat. As a side dish, you may serve a home-made potato mash."
  ],
  "ingredients": [
    "0",
    "Ingredients for 6-8:",
    "1 leg of lamb",
    "1 carrot",
    "2 onions",
    "2 garlic cloves",
    "1 sprig of thyme",
    "2 bay leaves",
    "2 sprigs of fresh parsley",
    "4 big tomatoes",
    "50cl veal stock",
    "25cl dry white wine",
    "40g flour",
    "10 peppercorns",
    "Salt",
    "Pepper",
    "Utensils:",
    "Matfer boning knife",
    "Stainless Steel Mixing Bowl Ø 30cm"
  ],
  "__v": 1
}