{
  "hash": "2edc87fb6469eb25e7ea7dbeeca81bb74e415785",
  "title": "Perfect Slow Cooker Roast Chicken",
  "image": "http://blog.paleohacks.com/wp-content/uploads/2014/07/PerfectSlowCookerRoastChickenPaleohacks-682x1024.jpg",
  "href": "http://blog.paleohacks.com/perfect-slow-cooker-roast-chicken/",
  "extension": "Chrome",
  "firstAdded": "2016-02-06T15:29:12.040000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "yellow",
    "onion",
    "head",
    "garlic",
    "lemon",
    "orange",
    "work",
    "paprika",
    "salt",
    "pepper",
    "thyme",
    "kitchen",
    "twine",
    "tired",
    "old",
    "carrots",
    "parsnips",
    "celery"
  ],
  "directions": [
    "0",
    "Directions:",
    "Quarter your onion and your lemon and halve the head of garlic by cutting in around the middle. Notice how pretty that garlic looks.",
    "Combine your salt, pepper and thyme into a cute little bowl. This will keep your gross chicken fingers from contaminating your regular salt dish and allow you to pinch and sprinkle like a pro.",
    "If you’ve decided to make use of some tired old carrots, parsnips, or celery, place them on the bottom of the slow cooker like a roasting rack. (Keep these with the carcass for broth.)",
    "Unwrap your chicken. Untie the legs and place your chicken in the slow cooker. (You might as well contaminate as few kitchen surfaces as possible.) Remove any giblets that might be inside the cavity.",
    "Sprinkle the the inside of the cavity with the salt, pepper and thyme. Use about half.",
    "Stuff the cavity with half the head of garlic, a piece or two of onion, and some lemon. Repeat. Try to alternate items and stuff as much in there as you can. Don’t worry if all of it doesn’t fit, just be sure to use some of each. Finish stuffing with a piece of lemon, leaving it rind side out so it acts as a kind of plug to the cavity.",
    "Tie the legs together so that the veg in the cavity stays in place.",
    "Sprinkle the rest of the salt, pepper and thyme onto the top of the chicken.",
    "Wash your hands, you are now done with chicken ick!",
    "Lastly, liberally sprinkle paprika on top of the chicken. The paprika doesn’t really do much for flavor, but it really helps the chicken to look “roasted.” If you miss this step your chicken will still be delish but it will look sad and anemic.",
    "Place the lid on your slow cooker and cook on high for four hours. This makes it easy peasy and you’ll only one dish to clean."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "1 4-to-6 pound whole chicken",
    "1 yellow onion",
    "1 head of garlic (optional)",
    "1 lemon (an orange will also work)",
    "1 tablespoon paprika",
    "2 teaspoon sea salt",
    "2 teaspoon pepper",
    "1teaspoon dried thyme",
    "8 inches kitchen twine",
    "2 tired old carrots, parsnips, or celery"
  ],
  "__v": 1
}