{
  "hash": "9942fcdc0dd1229998c1905fea5fca7e7f2b8131",
  "title": "Chicken in Peanut Sauce",
  "image": "https://lh4.googleusercontent.com/-Ppd88xaRngE/UONTB2x7zcI/AAAAAAAAJNw/JRTnrtL6xCw/s640/Peanut+Chicken+front.jpg",
  "href": "http://www.budgetbytes.com/2013/01/chicken-in-peanut-sauce/comment-page-4/",
  "extension": "Chrome",
  "firstAdded": "2016-08-21T14:07:53.051000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "If you don’t have cooked jasmine rice on hand, begin cooking your rice first so it will be ready by the time the chicken and sauce are complete. To begin the sauce, mince the garlic and then peel and grate the ginger into a large skillet or pot. Saute both in the vegetable oil over medium heat for about 2 minutes or until they are soft and fragrant.",
    "Cut the chicken into small pieces (about one inch across). Add them to your skillet or pot. Saute until lightly browned and cooked through (about 10 minutes).",
    "Turn the heat down to low and add the coconut milk and peanut butter. Stir gently to combine the two and dissolve any browned bits off of the bottom of the pan. Once the sauce is relatively smooth, add the soy sauce, brown sugar, sriracha, and juice from half of the lime. Stir to combine and heat through (about ten minutes).",
    "Pull the cilantro leaves from their stems and roughly chop. Scoop about one cup of jasmine rice into the bottom of each bowl and then top with the chicken and sauce (about ¾ cup). Sprinkle the fresh cilantro over top and enjoy!"
  ],
  "ingredients": [
    "0",
    "2 cloves garlic $0.16",
    "2 inches fresh ginger $0.14",
    "1 Tbsp vegetable oil $0.08",
    "1 lb. chicken breast* $1.99",
    "1 (14 oz.) can coconut milk $2.14",
    "½ cup natural peanut butter $0.66",
    "1 Tbsp soy sauce $0.10",
    "1 Tbsp brown sugar $0.02",
    "½ teaspoon sriracha hot sauce (optional) $0.02",
    "1 medium lime $0.50",
    "¼ bunch cilantro (optional) $0.20",
    "4 cups cooked jasmine rice $0.69"
  ],
  "__v": 1
}