{
  "hash": "32e9fb2ee852400fa363b31b2a903bd595801b5e",
  "title": "Kitchari Patties (Spiced Red Lentils and Rice) [Vegan, Gluten-Free]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/05/kichari-patties-575x262.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/kitchari-patties-spiced-red-lentils-and-rice/",
  "extension": "Chrome",
  "firstAdded": "2015-06-17T09:46:57.488000",
  "users": [
    null
  ],
  "keywords": [
    "clove",
    "garlic",
    "ginger",
    "onion",
    "red",
    "lentils",
    "brown",
    "rice",
    "basmati",
    "long",
    "short",
    "water",
    "veggies",
    "broccoli",
    "cauliflower",
    "mushrooms",
    "potatoes",
    "peas",
    "carrots",
    "kale",
    "cilantro",
    "parsley",
    "cumin",
    "seeds",
    "mustard",
    "turmeric",
    "black",
    "pepper",
    "oil"
  ],
  "directions": [
    "0",
    "In a medium pot, combine 1 Tbsp oil, garlic, ginger and onion and saute on medium heat until lightly browning. Add red lentils, rice and water and bring to a low boil. Cover pot and lower to a simmer. Let cook for 20-25 minutes until rice and lentils are cooked and it has reached a porridge like consistency. Uncover pot, turn off heat, and let rest, it will thicken a bit.",
    "When rice and lentils are done cooking, heat 1 Tbsp of oil in a skillet and add cumin and mustard seeds, heat on medium low until mustard seeds begin to pop, usually 1-2 minutes. Do not let them burn. Add turmeric and black pepper to oil and stir. Add chopped vegetables of choice to skillet and cook on medium low heat until just tender and salt to taste. Add fresh herbs and stir into cooling rice/lentil mixture.",
    "Preheat oven to 400 degrees and lightly oil baking sheet, or line with parchment paper. When cool enough to handle, form kichari into small balls with your hands and lay on sheet evenly spaced. Bake at 400 degrees for 10-15 minutes on each side until golden brown and crispy. They will remain soft and delicious inside. Drizzle with tamarind sauce, or condiment of choice, Sriracha would work well here. Enjoy!"
  ],
  "ingredients": [
    "0",
    "1 clove garlic, chopped",
    "1 tsp fresh ginger, chopped",
    "1/2 cup onion, chopped",
    "1 cup red lentils",
    "1 cup brown rice (basmati, long grain, or short grain)",
    "2.5 cups water",
    "3 veggies of choice, 1 cup of each, finely chopped: broccoli, cauliflower, mushrooms, potatoes, peas, carrots, kale, etc.",
    "1/4 cup fresh cilantro, chopped",
    "1/4 cup fresh parsley, chopped",
    "1/2 tsp cumin seeds",
    "1/2 tsp mustard seeds",
    "1/2 tsp turmeric",
    "1/2 tsp black pepper",
    "1-2 Tbsp oil"
  ],
  "__v": 1
}