{
  "hash": "bcf4c56451fc47d3e61de6b03dd3f8cadb7f95bd",
  "title": "Double Chocolate Crinkle Cookies",
  "image": "https://sallysbakingaddiction.com/wp-content/uploads/2015/11/double-chocolate-crinkle-cookies-220x220.jpg",
  "href": "https://sallysbakingaddiction.com/2015/11/30/double-chocolate-crinkle-cookies/",
  "extension": "Firefox",
  "firstAdded": "2018-01-25T02:23:13.103000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large bowl using a hand-held mixer or stand mixer fitted with a paddle attachment, beat the butter for 1 minute on medium speed until completely smooth and creamy. Add the granulated sugar and brown sugar and beat on medium high speed until fluffy and light in color. Beat in egg and vanilla on high speed. Scrape down the sides and bottom of the bowl as needed.",
    "In a separate bowl, whisk the flour, cocoa powder, baking soda and salt together until combined. On low speed, slowly mix into the wet ingredients until combined. The cookie dough will be quite thick. Switch to high speed and beat in the chocolate chips. The cookie dough will be sticky. Cover dough tightly with aluminum foil or plastic wrap and chill for at least 3 hours and up to 3 days. Chilling is mandatory for this cookie dough. I always chill mine overnight.",
    "Remove cookie dough from the refrigerator and allow to sit at room temperature for 20 minutes-- if the cookie dough chilled longer than 3 hours, let it sit at room temperature for about 30 minutes. This makes the cookie dough easier to scoop and roll.",
    "Preheat oven to 350°F (177°C). Line two large baking sheets with parchment paper or silicone baking mats. (Always recommended for cookies.) Set aside.",
    "Scoop and roll balls of dough, about 1.5 Tablespoons of dough each, into balls. Roll each ball generously in the confectioners' sugar and place on the baking sheets.",
    "Bake the cookies for 8-9 minutes. My oven has hot spots and yours may too- so be sure to rotate the pan once during bake time. The baked cookies will look extremely soft in the centers when you remove them from the oven. Allow to cool for 5 minutes on the cookie sheet. They will slightly deflate as you let them cool. Transfer to cooling rack to cool completely.",
    "Make ahead tip: Cookies stay fresh covered at room temperature for up to 1 week. Baked cookies freeze well - up to three months. Unbaked cookie dough balls (that are not coated in confectioners' sugar) freeze well - up to three months. Coat the frozen cookie dough balls in confectioners' sugar, then bake for about 10 minutes. No need to thaw them."
  ],
  "ingredients": [
    "0",
    "1/2 cup (115g) unsalted butter, softened to room temperature",
    "1/2 cup (100g) granulated sugar",
    "1/2 cup (100g) packed light or dark brown sugar",
    "1 large egg, at room temperature",
    "1 teaspoon pure vanilla extract",
    "1 cup (125g) all-purpose flour (spoon & leveled)",
    "1/2 cup + 2 Tablespoons (53g) unsweetened cocoa powder",
    "1 teaspoon baking soda",
    "1/8 teaspoon salt",
    "1 cup (180g) mini or regular size semi-sweet chocolate chips",
    "1 cup (120g) confectioners' sugar, for rolling"
  ],
  "__v": 1
}