{
  "hash": "71f5dfdf7fa37938ca67282ac8c3d052ac173ceb",
  "title": "Blood-orange Braised Cabbage on Barley",
  "image": "http://mynewroots.org/site/wp-content/uploads/2013/02/braisedcabbage.jpg",
  "href": "https://www.mynewroots.org/site/2013/02/blood-orange-braised-cabbage-on-barley/",
  "extension": "",
  "firstAdded": "2018-01-28T23:46:13.293000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a measuring cup, measure out 1 cup of barley, cover with water and rub grains together to wash. Drain and repeat until water is almost clear. Drain and place in a small saucepan with 2 cups water or broth and salt. Cover, bring to a boil, reduce to simmer and cook until tender, about 40-50 minutes (if the liquid evaporates before the barley is cooked, add another half cup water). Remove from heat, let sit for a few minutes, then fluff with a fork.",
    "While the barley is cooking, prepare all the vegetables. Slice the cabbage into thin ribbons, slice onions, mince garlic. Juice oranges, and segment one for garnish, set aside.",
    "Heat a knob of coconut oil or ghee in a large stockpot. Add mustard seeds. When mustard seeds begin to pop, add fennel seeds, bay leaves, star anise, and a few grinds of black pepper. Let cook for about a minute. Add onions, stir to coat and cook until softened, about 5 minutes. Add garlic, salt, and cabbage, stir to coat and let sit on medium heat for a couple minutes to caramelize the vegetables.",
    "Next add the apple cider vinegar and stir – this will deglaze the bottom of the pot. Pour in the orange juice, stir well. With the pot covered, bring to a boil, reduce to simmer and let cook for 10-20 minutes, stirring occasionally, until the cabbage is cooked to your liking (I prefer mine al dente, tender but with a slight crispness still left).",
    "Section a blood orange for garnish, set aside. Roughly chop parsley.",
    "To serve, place a helping of barley on each plate, followed by the braised cabbage, a few segments of blood orange, parsley, and a drizzle of olive oil. Enjoy warm, or folded together as a salad in the warmer months."
  ],
  "ingredients": [
    "0",
    "1 cup / 200g lightly pearled or hulled barley",
    "2 – 2 ½ cups water or broth",
    "¼ tsp. sea salt",
    "1 small head red cabbage (approx. 500g /1 lb.)",
    "2 medium onions",
    "4 cloves garlic",
    "knob of coconut oil or ghee",
    "½ tsp. sea salt",
    "5 bay leaves",
    "1 Tbsp. fennel seeds",
    "½ Tbsp mustard seeds",
    "2 whole star anise",
    "black pepper",
    "1 cup blood orange juice (from 3-4 oranges, any orange would be fine)",
    "2 Tbsp. apple cider vinegar",
    "1 blood orange, segmented for garnish",
    "olive oil to garnish",
    "flat-leaf parsley (or mint), for garnish if desired"
  ],
  "__v": 1
}