{
  "hash": "6a5a5e8f0f31e0df5b6e206f741f1d8f26c720ab",
  "title": "Salmon with Sunflower-Dill Pesto Sauce",
  "image": "http://honestcooking.com/wp-content/uploads/2015/05/pan-seared-salmon-sunflower-dill-pesto-680.jpg",
  "href": "http://honestcooking.com/salmon-sunflower-dill-pesto-sauce/",
  "extension": "Chrome",
  "firstAdded": "2015-07-03T03:54:22.402000",
  "users": [
    null
  ],
  "keywords": [
    "sunflower",
    "seeds",
    "basil",
    "leaves",
    "dill",
    "olive",
    "oil",
    "squeezed",
    "juice",
    "lemon",
    "green",
    "onion",
    "stem",
    "garlic",
    "clove",
    "mayonnaise",
    "head",
    "broccoli",
    "florettes",
    "intact",
    "possible",
    "salt",
    "salmon",
    "fillets",
    "cracked",
    "pepper"
  ],
  "directions": [
    "0",
    "Preheat the oven to broil with a rack at the very top. If you know your oven broils very hot, as some do, lower the rack one notch. Line a baking tray with parchment paper.",
    "Place the sunflower seeds, basil leaves, dill, olive oil, lemon juice, green onion and garlic in a small blender. ( A Magic Bullet works great.) Blend until everything is smooth and creamy. Pour the pesto into a small bow and stir though the mayo. Season to taste with sea salt. If you'd like you can think the pesto with a little water to make it more drizzle-able.",
    "Lay the broccoli on the prepared baking sheet. Drizzle with the oil and sprinkle over the sea salt and put it in your oven on the top rack. Let it roast for 10 minutes, or until it is dark and crispy. It will smell like it is burning a little, this is ok!",
    "Heat the oil in a non-stick frying pan over medium high heat. Season the skin of the salmon fillets with a little pinch of salt and pepper and put them in the pan, skin side down. Let them sear for 3 minutes, or until the skin has begun to get crispy.",
    "Lower the heat in the oven to 320. Open the door and let the oven cool down for about 1 minute. Put the fish in the oven and let it finish by slowly baking, for about 5 more minutes. You want the salmon to reach an internal temperature of 140 degrees. It will flake easily and still look very moist when it is done.",
    "Serve the salmon with the pesto over top and the broccoli on the side. Sprinkle a few sunflower seeds and dill sprigs over top, if you'd like."
  ],
  "ingredients": [
    "0",
    "¼ cup toasted sunflower seeds",
    "¼ cup basil leaves",
    "¼ tablespoons fresh dill",
    "¼ tablespoons olive oil",
    "2 tablespoons fresh squeezed lemon juice, from ½ lemon",
    "1 tablespoon chopped green onion (about 1 stem)",
    "1 garlic clove, minced",
    "1 tablespoon mayonnaise",
    "1",
    "1 head of broccoli, sliced into small florettes - keep as much as the stem intact as possible",
    "1 teaspoon olive oil",
    "¼ teaspoon sea salt",
    "2",
    "1 teaspoon olive oil",
    "4 salmon fillets",
    "Sea salt and fresh cracked pepper",
    "Sunflower seeds and dill, for garnish"
  ],
  "__v": 1
}