{
  "hash": "ea606a04d83582f37d666da9b2a0d2358c567098",
  "title": "Classic Tomato Soup",
  "image": "http://www.finecooking.com/cms/uploadedimages/images/cooking/articles/issues_91-100/051091055_01_xlg.jpg",
  "href": "http://www.finecooking.com/recipes/meyers-classic-tomato-soup.aspx",
  "extension": "Chrome",
  "firstAdded": "2016-02-08T17:05:45.886000",
  "users": [
    null,
    null
  ],
  "keywords": [
    "tbs",
    "extravirgin",
    "olive",
    "oil",
    "unsalted",
    "butter",
    "white",
    "onion",
    "clove",
    "garlic",
    "smashed",
    "allpurpose",
    "flour",
    "lowersalt",
    "chicken",
    "broth",
    "plum",
    "tomatoes",
    "pured",
    "include",
    "juice",
    "sugar",
    "sprig",
    "thyme",
    "kosher",
    "salt",
    "black",
    "pepper",
    "basil",
    "chives",
    "dill",
    "mixture",
    "omit",
    "using",
    "garnishes"
  ],
  "directions": [
    "0",
    "In a nonreactive 5- to 6-quart Dutch oven, heat the oil and butter over medium-low heat until the butter melts. Add the onion and garlic and cook, stirring occasionally, until soft but not browned, about 8 minutes. Add the flour and stir to coat the onion and garlic.",
    "Add the broth, tomatoes, sugar, thyme, and 1/4 tsp. each salt and pepper. Bring to a simmer over medium-high heat while stirring the mixture to make sure that the flour is not sticking to the bottom of the pan. Reduce the heat to low, cover, and simmer for 40 minutes.",
    "Discard the thyme sprig. Let cool briefly and then purée in two or three batches in a blender or food processor. Rinse the pot and return the soup to the pot. Season to taste with salt and pepper. Reheat if necessary. Serve warm but not hot, garnished with the herbs or dolloped with one of the garnishes below.",
    "This soup stores beautifully and tastes better the second day. You can keep it in the refrigerator as long as you bring it to a boil every two days. Or you can stash it in the freezer for up to three months.",
    "To add a creamy touch, try one of these garnishes:",
    "Sour cream, goat cheese & Parmesan garnish: In a small bowl, combine 1/2 cup sour cream with 1/4 cup crumbled goat cheese. Add 1 Tbs. freshly grated Parmigiano-Reggiano, 1 Tbs. thinly sliced chives, and 1 Tbs. extra-virgin olive oil. Mix thoroughly and season to taste with kosher salt and freshly ground black pepper. Add a dollop to each serving.",
    "Crème fraîche, herb & horseradish garnish: In a small bowl, combine 1/2 cup crème fraîche with 1 Tbs. minced fresh dill and 1 Tbs. minced scallion. Add 1/2 Tbs. well-drained prepared white horseradish and mix well. Season to taste with kosher salt and freshly ground black pepper. Add a dollop to each serving."
  ],
  "ingredients": [
    "0",
    "2 Tbs. extra-virgin olive oil",
    "1 Tbs. unsalted butter",
    "1 large white onion, finely chopped",
    "1 large clove garlic, smashed and peeled",
    "2 Tbs. all-purpose flour",
    "3 cups lower-salt chicken broth",
    "28-oz. can whole peeled plum tomatoes, puréed (include the juice)",
    "1-1/2 tsp. sugar",
    "1 sprig fresh thyme",
    "Kosher salt and freshly ground black pepper",
    "3 Tbs. thinly sliced fresh basil, chives, or dill, or a mixture of all three (omit if using one of the garnishes below)"
  ],
  "__v": 2
}