{
  "hash": "6af5996f6fa0d592993e5df9e2bb7dfbfa834801",
  "title": "Blueberry Sourcream Muffins",
  "image": "http://i285.photobucket.com/albums/ll45/huntleygang/idearoom/bluemuffin.jpg",
  "href": "http://www.theidearoom.net/2010/02/blueberry-sourcream-muffins.html",
  "firstAdded": "2015-02-13T02:10:47.281000",
  "users": [
    null
  ],
  "keywords": [
    "unbleached",
    "allpurpose",
    "flour",
    "baking",
    "salt",
    "eggs",
    "sugar",
    "unsalted",
    "butter",
    "sour",
    "cream",
    "frozen",
    "blueberries",
    "wild"
  ],
  "directions": [
    "0",
    "Adjust oven rack to middle position and heat oven to 350 degrees. Grease muffin tin.",
    "Whisk flour, baking powder, and salt in medium bowl until combined. Whisk egg in second medium bowl until well-combined and light-colored, about 20 seconds. Add sugar and whisk vigorously until thick and homogenous, about 30 seconds; add melted butter in 2 or 3 additions, whisking to combine after each addition. Add sour cream in 2 additions, whisking just to combine.",
    "Add frozen berries to dry ingredients and gently toss just to combine. Add sour cream mixture and fold with rubber spatula until batter comes together and berries are evenly distributed, 25 to 30 seconds. (Small spots of flour may remain and batter will be thick. Do not overmix.)",
    "Use ice cream scoop or large spoon to drop batter into greased muffin tin. Bake until light golden brown and insert toothpick into the center of muffin comes out clean, 25 to 30 minutes, rotating pan from front to back halfway through baking time. Invert muffins onto wire rack, stand muffins upright, and cool 5 minutes. Serve as is or with the cinnamon sugar topping below.",
    "Cinnamon Sugar Topping:",
    "While muffins are cooling, mix 1/2 cup sugar and 1/2 teaspoon ground cinnamon in small bowl and melt 4 tablespoons butter in small saucepan. After baked muffins have cooled 5 minutes, and working one at a time, dip top of each muffin in melted butter and then cinnamon sugar. Set muffins upright on wire rack."
  ],
  "ingredients": [
    "0",
    "2 cups unbleached all-purpose flour",
    "1 tablespoon baking powder",
    "1/2 teaspoon salt",
    "2 large eggs",
    "1 cup sugar",
    "4 tablespoons unsalted butter melted",
    "1 1/4 cups sour cream (10 ounces)",
    "1 1/2 cups frozen blueberries (wild)"
  ],
  "__v": 1
}