{
  "hash": "f3f300287b1370bfebf4c4137dfcce3c08c76ae4",
  "title": "Cod Fritters with Garlic Potato Puree(Bakaliaros Skordalia)",
  "image": "http://www.mygreekdish.com/wp-content/uploads/2013/10/Cod-Fritters-with-Garlic-Potato-PureeBakaliaros-Skordalia-800x622.jpg",
  "href": "http://www.mygreekdish.com/recipe/cod-fritters-garlicky-potato-puree-bakaliaros-skordalia/",
  "extension": "Chrome",
  "firstAdded": "2015-12-15T14:20:50.387000",
  "users": [
    null
  ],
  "keywords": [
    "salted",
    "cod",
    "oil",
    "frying",
    "water",
    "allpurpose",
    "flour",
    "extra",
    "dredging",
    "beer",
    "dry",
    "yeast",
    "tsps",
    "salt",
    "skordalia",
    "potatoes",
    "boiled",
    "garlic",
    "olive",
    "milk",
    "red",
    "wine",
    "vinegar",
    "juice",
    "lemons"
  ],
  "directions": [
    "0",
    "Instructions",
    "To prepare the cod fritters, it is very important to leach the cod fish from the salt. To do that soak the cod in water and put in the fridge. Leave it for 2-3 days and change the water 3 times a day. If you like you can buy some fresh cod fish and skip this procedure.",
    "When done, dry well the fish with paper towel and remove all the bones. Cut into small bites, 4-5 cm.",
    "To prepare the batter for the cod fritters add into a bowl the beer, the water and the yeast and mix with a whisk, until the yeast is dissolved. Add the rest of the ingredients and whisk, until the batter is smooth.",
    "Into a deep frying pan, heat the oil to high heat. Add some four into a bowl. Take one piece of cod and dredge into the flour, shaking it to remove the excess flour and then deep it into the batter, flipping it on all sides. Using a spoon remove the cod from the batter and put it slowly into the hot oil. Dip the spoon into some water and repeat with the rest of the pieces. Deep fry the cod fritters flipping them with allotted spoon, until nicely colored on all sides. Remove the cod fritters from the pan and place on some kitchen paper to drain. (Fry the cod fritters in batches, so that the surface of the pan is comfortably filled.)",
    "Serve with creamy traditional Greek skordalia (garlic potato puree) and pita breads. Enjoy!"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1-1.2kg of salted cod (40 ounces)",
    "vegetable oil for frying",
    "500g water (18 ounces)",
    "500g all-purpose flour, plus some extra for dredging (18 ounces)",
    "330ml beer (1 and 1/3 cups)",
    "10g dry yeast (3 and 1/2 tsps)",
    "a pinch of salt",
    "For the sauce (Skordalia)",
    "1 kg potatoes, boiled (35 ounces)",
    "4 cloves of garlic",
    "1/2 cup of olive oil",
    "1/2 cup of milk",
    "1/3 cup of red wine vinegar or juice of 2 lemons",
    "salt to taste"
  ],
  "__v": 1
}