{
  "hash": "162fd5a7a5847e29509cc83c4a9d0aa36698e7f5",
  "title": "SIMPLE WONTON SOUP",
  "image": "http://thewoksoflife.com/wp-content/uploads/2013/12/DSC_0271.jpg",
  "href": "http://thewoksoflife.com/2013/12/simple-wonton-soup-2/",
  "extension": "Chrome",
  "firstAdded": "2017-04-01T13:02:24.673000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Start by thoroughly washing the vegetables. Bring a large pot of water to a boil and blanch the vegetables just until wilted. Drain and rinse in cold water.",
    "Grab a good clump of veg and carefully squeeze out as much water as you can. Very finely chop the vegetables (you can also speed up the process by throwing them in the food processor). In a medium bowl, add the finely chopped vegetables, ground pork, sesame oil, white pepper, soy sauce, salt, and wine. Mix very thoroughly until the mixture is totally emulsified—almost like a paste.",
    "Now it’s time to assemble! Fill a small bowl with water. Grab a wrapper and use your finger to moisten the edges of the wrapper. Add a little over a teaspoon of filling to the middle. Fold the wrapper in half and press the two sides together so you get a firm seal.",
    "Hold the bottom two corners of the little rectangle you just made and bring the two corners together. You can use a bit of water to make sure they stick. And that’s it! Keep assembling until all the filling is gone. Place the wontons on a baking sheet or plate lined with parchment paper to prevent sticking.",
    "At this point, you can cover the wontons with plastic wrap, put the baking sheet/plate into the freezer, and transfer them to Ziploc bags once they’re frozen. They’ll keep for a couple months in the freezer, and be ready for wonton soup whenever you want it.",
    "To make the soup, heat your chicken stock to a simmer and add sesame oil , white pepper, and salt.",
    "Bring a separate pot of water to a boil. Carefully add the wontons one at a time to the pot. Pick up the pot and use a swirling, twisting motion to keep the pot moving and prevent the wontons from sticking to the bottom. If they do stick, don’t worry, They should come free once they’re cooked. They’re done when they float. Take care not to overcook them – mushy wontons are a sin! Remove the wontons with a slotted spoon and put them in bowls.",
    "Pour the soup over the wontons and garnish with scallions. Serve!"
  ],
  "ingredients": [
    "0",
    "10 oz. baby bok choy or similar green vegetable",
    "1 cup ground pork",
    "2½ tablespoons sesame oil",
    "Pinch white pepper Coupons",
    "1 tablespoon seasoned soy sauce",
    "½ teaspoon salt",
    "1 tablespoon shaoxing wine",
    "Water",
    "1 pack wonton skins",
    "6 cups good chicken stock",
    "1 tablespoon sesame oil",
    "White pepper and salt to taste",
    "1 scallion"
  ],
  "__v": 1
}