{
  "hash": "1cf58e68443a3dc3254263910a5845a748b87683",
  "title": "Summer Garden Risotto",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2013/08/summer-garden-risotto-vertical.jpg",
  "href": "http://www.simplyrecipes.com/recipes/summer_garden_risotto/",
  "extension": "",
  "firstAdded": "2017-07-13T22:25:24.617000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Bring the water to a simmer in a small pot. In another pot, heat the olive oil over medium-high heat. When the olive oil is shimmery hot, add the garlic and sauté until fragrant, about 30 seconds. Stir in the rice and coat with the olive oil. Sauté, stirring constantly, for 2-3 minutes, at which point the rice will begin to smell nutty.",
    "2 Add the white wine to the rice and stir. From this point on, you will be stirring the risotto rice almost constantly. After a minute or two the rice will have absorbed the wine and when you stir, the spoon will leave streaks on the bottom of the pan. Add a cup of the hot water to the pot. Add a generous pinch of salt. Stir until the water has been absorbed by the rice and your spoon is again leaving a trail at the bottom of the pan. Add another cup of hot water and repeat.",
    "3 When this second cup of water is absorbed, add the corn and red bell pepper. Add another cup of water and stir until it is absorbed. Repeat with another cup of water and another healthy pinch of salt.",
    "4 By now the rice should be close to being done; it should be fully cooked but still al dente, a little firm, not completely soft. When the rice reaches this stage, stir in the green onions and grated parmesan. When the water has been completely absorbed, add a little more water so the risotto is loose. The risotto should fill a bowl, not sit on a plate.",
    "5 Stir in the basil and butter, and sprinkle with black pepper to taste . Once the butter has melted, serve at once."
  ],
  "ingredients": [
    "0",
    "2 Tbsp olive oil",
    "1 large garlic clove, minced",
    "1 1/2 cups Arborio or other risotto rice",
    "1/2 cup white wine",
    "5 cups hot water",
    "Salt and black pepper",
    "1/2 cup sweet corn kernels (fresh or frozen)",
    "1/2 cup diced red bell pepper (small dice)",
    "2 green onions, chopped (white and green parts)",
    "1/2 cup grated parmesan cheese",
    "10-12 basil leaves, torn up small",
    "2 Tbsp unsalted butter (optional)"
  ],
  "__v": 1
}