{
  "hash": "ae77694bd389214381142d9c3da870cf73409ebc",
  "title": "VEGAN AND GLUTEN-FREE TOMATO AND GARLIC FOCCACIA",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/01/foccacia.png",
  "href": "http://www.onegreenplanet.org/vegan-recipe/vegan-and-gluten-free-tomato-and-garlic-foccacia/",
  "firstAdded": "2015-01-21T11:17:35.302000",
  "users": [
    null
  ],
  "keywords": [
    "cooking",
    "spray",
    "flaxseed",
    "tbs",
    "water",
    "dry",
    "active",
    "yeast",
    "sugar",
    "divided",
    "glutenfree",
    "allpurpose",
    "flour",
    "xanthan",
    "guar",
    "gum",
    "kosher",
    "salt",
    "garlic",
    "thyme",
    "vinegar",
    "extravirgin",
    "olive",
    "oil",
    "roma",
    "tomatoes",
    "oregano",
    "basil"
  ],
  "directions": [
    "0",
    "Spray some oil on a 9 x 13 baking sheet. Cover with parchment paper and spray the top with more cooking spray. Dust the pan with some flour and set aside.",
    "In a mug or small bowl, combine the flaxseed with one cup of warm water. Mix and let stand for 10 minutes until it is a thick gel. In a 2-cup mixing cup, combine 2 cups warm water with the yeast. Add 2 tsp. of sugar to feed the yeast. Stir and let sit for 10 minutes until it gets thick and frothy.",
    "In a large bowl, combine the flour, xanthan gum, the remaining Tbs. of sugar, salt, garlic powder and thyme. Mix them well. To the dry ingredients add the flax gel, vinegar, oil and the yeast mixture. Mix well with a wooden spoon until you have a thick batter.",
    "Preheat the oven to 400 degrees. Transfer the batter to the baking sheet, spreading it evenly with a flat spatula. Cover the pan loosely with plastic wrap and then a damp cloth. Set the pan in a warm place (I put mine on top of the stove) and let the dough rise for 1 hour. The dough should puff up and almost double in size.",
    "When the dough has risen, brush the top with some oil. Press the tomato slices into the dough at various depths – you want to see tomatoes towards the middle when you cut the bread. Sprinkle garlic, coarse salt and fresh herbs over the top.",
    "Bake the dough for 30-40 minutes, depending on your oven. Using the parchment paper, lift the bread out of the pan and put it on a metal rack to cool for at least 10 minutes. Cut into squares and serve."
  ],
  "ingredients": [
    "0",
    "Cooking spray",
    "2 Tbs. flaxseed + 6 Tbs. warm water",
    "1 package dry active yeast",
    "2 cups warm water",
    "2 tsp. + 1 Tbs. sugar, divided",
    "2 3/4 cup gluten-free, all-purpose flour",
    "1 tsp. xanthan gum or guar gum",
    "1 Tbs. sugar",
    "1 ½ tsp. Kosher salt + more for garnish",
    "½ tsp. garlic powder",
    "½ tsp. dried thyme",
    "1 tsp. vinegar",
    "4 Tbs. extra-virgin olive oil",
    "2 large Roma tomatoes, sliced",
    "2 cloves garlic, minced",
    "1 Tbs. fresh oregano, chopped",
    "1 Tbs. fresh basil, chopped"
  ],
  "__v": 1
}