{
  "__v": 1,
  "directions": [
    "0",
    "The proper way to measure flour using measuring cups is to aerate it first. This is done either by sifting flour, or aerating it by fluffing it up and whisking it well, then spooning it into the measuring cup, then carefully removing any excess flour with a knife. If you just stick that measuring cup in the bag of flour and scoop some out, you will get a lot more flour than what the recipe calls for. Do aerate the flour, or you will end up with dry dough! :)",
    "Preheat oven to 350 degrees Fahrenheit. Using an electric mixer, cream peanut butter and butter in a mixing bowl until smooth. Add brown sugar; beat until combined. Add eggs and vanilla, and continue beating until creamy.",
    "In a separate bowl, whisk together flour, baking powder. Gradually add dry ingredients from step 2 to wet ingredients in step 1, beating on low speed.",
    "Prepare baking sheet by lining it with parchment paper or lightly greased aluminum foil. Place granulated sugar on a plate. Roll spoonfuls of cookie dough into balls, rolling each ball between your hands. Roll balls in sugar to coat them completely.",
    "Place cookie balls 2 inches apart on a prepared baking sheet. Bake until cookies begin to puff up slightly, about 12 minutes, until cookies just brown around the edges and crackle on top. Remove from oven and let the cookies cool at least 10 minutes on baking sheet before transferring cookies to rack to cool completely."
  ],
  "firstAdded": "2014-08-08T00:40:43.471000",
  "hash": "b4b95d5eee5b23cce06d50254080f2a2ea4a03d1",
  "href": "http://juliasalbum.com/2014/07/easy-peanut-butter-cookies/",
  "image": "https://farm3.staticflickr.com/2926/14670970725_a83dbd986c_c.jpg",
  "ingredients": [
    "0",
    "1/4 cup creamy peanut butter (can use natural one too)",
    "2 tablespoons unsalted butter, room temperature (not melted - just let the butter from refrigerator sit on the counter for about an hour or so)",
    "1/2 cup brown sugar",
    "1 egg",
    "1/2 teaspoon pure vanilla extract",
    "3/4 cup all-purpose flour, sifted or aerated (see important note below!)",
    "1/2 teaspoon baking powder",
    "2 tablespoons granulated sugar for coating"
  ],
  "keywords": [
    "creamy",
    "peanut",
    "butter",
    "use",
    "natural",
    "unsalted",
    "room",
    "refrigerator",
    "sit",
    "counter",
    "hour",
    "brown",
    "sugar",
    "egg",
    "vanilla",
    "allpurpose",
    "flour",
    "sifted",
    "aerated",
    "important",
    "baking",
    "granulated",
    "coating"
  ],
  "title": "The best (and easy) peanut butter cookies",
  "users": [
    null
  ]
}