{
  "hash": "5aab5739cc9fc48068f01bd65e55c5dbdcc3047b",
  "title": "Kerriesoep met rijst en ei",
  "image": "http://i0.wp.com/i46.photobucket.com/albums/f104/reny7/kerriesoep%20met%20rijst%20en%20ei%20IMG_8263_zps2wqotipl.jpg?resize=667%2C1000",
  "href": "http://www.mindyourfeed.nl/recepten/diner/kerriesoep-met-rijst-en-ei/",
  "extension": "Chrome",
  "firstAdded": "2016-09-18T19:43:57.144000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Doe ruim water in een pan en breng dit aan de kook. Voeg de zilvervliesrijst toe en kook in zo’n 20 minuten beetgaar.",
    "Schil en snipper de ui. Maak de knoflook schoon. Verwijder het buitenste blad van de prei en snij in ringen. Was de prei in een vergiet onder de kraan.",
    "Zet de soeppan op het vuur en laat de boter in de pan smelten. Voeg dan de ui toe en fruit deze aan. Pers de knoflook uit en bak even zachtjes aan. Voeg de prei toe en schep door. Laat zachtjes meebakken.",
    "Doe de bloem in de pan en doe nu ook de kerrie, kurkuma en nootmuskaat erbij. Schep goed om, er mogen geen klontjes achterblijven. Schenk het water in delen in de pan en roer tussendoor. Voeg nu ook het bouillonblokje toe.",
    "Laat de kerriesoep zo’n 15 minuten zachtjes pruttelen en roer regelmatig even door. Kook ondertussen de eieren, in zo’n 6 minuten, we willen hardgekookte eitjes in deze soep.",
    "Giet de rijst af en laat even uitlekken in het vergiet. Voeg daarna toe aan de kerriesoep en roer door. Het vuur mag aanblijven, maar wel zacht. Schenk de room bij de soep, en breng verder op smaak met peper en zout. Ik deed er ook nog een flinke theelepel sambal bij.",
    "Pel de eieren en snij in stukjes. Verwijder het buitenste blad van de lente-ui en snij in ringen. Garneer de kerriesoep met rijst met ei en ui en enjoy!"
  ],
  "ingredients": [
    "0",
    "100 gr zilvervliesrijst",
    "4 eieren",
    "2 uien",
    "2 prei",
    "1 lente-ui",
    "2 teentjes knoflook",
    "4 tl kerrie",
    "1 tl kurkuma",
    "1/2 tl nootmuskaat",
    "25 gr boter",
    "3 el (spelt)bloem",
    "1,2 liter water",
    "1 bouillonblokje",
    "100 ml (plantaardige) room",
    "peper",
    "zout",
    "optioneel; sambal"
  ],
  "__v": 2
}