{
  "hash": "8ff3e9744cdb153d7a08ea7d251271d2c13ef4ba",
  "title": "Prosciutto and Fontina Panini with Arugula Pesto",
  "image": "https://d2k9njawademcf.cloudfront.net/slides/298/original/102709F_0552.JPG?1256821385",
  "href": "http://food52.com/recipes/1202-prosciutto-and-fontina-panini-with-arugula-pesto",
  "extension": "Chrome",
  "firstAdded": "2015-06-10T01:07:27.058000",
  "users": [
    null
  ],
  "keywords": [
    "cider",
    "vinegar",
    "sugar",
    "salt",
    "shallot",
    "loaf",
    "ciabatta",
    "lengthwise",
    "prosciutto",
    "slices",
    "fontina",
    "pine",
    "nuts",
    "garlic",
    "baby",
    "arugula",
    "lemon",
    "juiced",
    "olive",
    "oil"
  ],
  "directions": [
    "0",
    "Make the pickled shallots: bring the cider, sugar, and salt to a boil in a small saucepan over a medium flame. Simmer for a minute, until the sugar has dissolved, then pour the hot liquid over the shallots in a small bowl or jar so they are fully submerged. Allow to sit for 20 minutes, then place in an airtight container until ready for use. This can be done up to a week before.",
    "Make the pesto: in a small food processor, pulse the pine nuts and garlic until coarsely chopped. Add the arugula, lemon juice, and salt and pulse to combine. Stream in olive oil and continue to blend until all the ingredients are finely chopped and the pesto is smooth and creamy. Taste for seasoning and add more salt if necessary.",
    "Preheat the broiler. Place the two slices of bread crust side down on a baking sheet and toast in the oven for 3-5 minutes, until beginning to crisp but not totally browned. Slather the bottom half of bread evenly with pesto and arrange the cheese slices in a single layer. Return just this slice of bread to the oven and continue to toast until the cheese has melted, about 3-5 minutes.",
    "Slather the other slice of bread with the remaining pesto and arrange the pickled shallots on top, followed by the prosciutto. Sandwich the halves together.",
    "Heat a large skillet over medium-high heat. Depending on the size of your pan and the size of the ciabatta, you may have to cut the sandwich in half. Set the sandwich top side down in the pan and weight it with a smaller skillet and/or a heavy bowl so the bread is crushed and flattened as it toasts. When the bread has browned, repeat on the other side. When finished, the panini should be browned, crisped, and flattened, and should have cheese oozing from it. Toast the remaining half (if necessary), and then cut it again to create four sandwiches."
  ],
  "ingredients": [
    "0",
    "¼ cup cider vinegar",
    "2 tablespoons sugar",
    "1/2 teaspoon salt",
    "1 large shallot, thinly sliced",
    "1 loaf ciabatta, sliced lengthwise",
    "1/3 pound prosciutto (about 10 slices)",
    "1/3 pound fontina, thinly sliced",
    "1",
    "¼ cup toasted pine nuts",
    "2 garlic cloves",
    "2 cups baby arugula",
    "½ lemon, juiced",
    "1/2 teaspoon salt",
    "¼ cup olive oil"
  ],
  "__v": 1
}