{
  "hash": "6881c7823abaede53ac9829a38de573849e12bcf",
  "title": "BASIC BUTTERCREAM AND VARIATIONS",
  "image": "",
  "href": "http://origin.www.epicurious.com/recipes/food/views/basic-buttercream-and-variations-51112020",
  "extension": "Chrome",
  "firstAdded": "2015-05-04T20:04:14.380000",
  "users": [
    null
  ],
  "keywords": [
    "egg",
    "whites",
    "sugar",
    "cream",
    "tartar",
    "unsalted",
    "butter",
    "room",
    "cubes",
    "vanilla",
    "salt"
  ],
  "directions": [
    "0",
    "PREPARATION",
    "Using a hand whisk, whisk together the egg whites, sugar, and cream of tartar in the clean bowl of a stand mixer. Place the bowl over (not in) a saucepan of simmering water. The egg white mixture will be gloppy and thick, but as the mixture begins to warm up, it will become more fluid. Continue to gently whisk the mixture until it is very hot to the touch (130°F on a candy thermometer).",
    "Move the bowl to the stand mixer and, using the whisk attachment, whip the whites on medium-high speed until they have tripled in volume and are thick and glossy and hold stiff peaks (like meringue), 3 to 4 minutes. Turn the mixer down to medium-low speed until the mixing bowl is just cool to the touch, 1 to 2 minutes. Kick the mixer back up to medium-high speed and add the butter one piece at a time, adding the next piece just as the previous one has been incorporated. Stop the mixer every so often to scrape down the escaping buttercream from the sides of the bowl. At some point, the buttercream will take on a curdled appearance; don't worry, this is normal. Just keep on mixing until it comes together. Once all the butter is incorporated and the frosting is fluffy and creamy, blend in the vanilla and salt until fully combined.",
    "Covered with plastic wrap, buttercream will last 2 days at room temperature or 7 days in the refrigerator. If refrigerated, the buttercream must be brought to room temperature before you use it. Either way, the buttercream must be rewhipped-either by hand if kept at room temperature or with a mixer if refrigerated-before you frost a cake with it.",
    "Raspberry Buttercream:",
    "Mash and strain 4 cups (10 ounces) of raspberries, fresh or frozen, through a fine mesh sieve to catch the seeds. (If using frozen berries, measure them before thawing.) Discard the seeds and set aside the puree while you follow the method for making Basic Buttercream. Add the berry puree at the end of the recipe, with the vanilla and the salt."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "6 egg whites",
    "1 1/4 cups (8 3/4 ounces) sugar",
    "1/4 teaspoon cream of tartar",
    "2 cups (1 pound) unsalted butter, at room temperature, cut into small cubes",
    "2 teaspoons pure vanilla extract",
    "1/8 teaspoon fine sea salt"
  ],
  "__v": 1
}