{
  "hash": "6f0056cce47b01d7883e8e5c006a36d67ecb5927",
  "title": "9 Surprising Ways to Put Coke to Work in Your Home: Just More Reasons Not to Drink it",
  "image": "http://cdn.thealternativedaily.com/wp-content/uploads/2014/03/dirty-pot-300x238.jpg?781744",
  "href": "http://www.thealternativedaily.com/9-surprising-ways-put-coke-work-home-just-reasons-drink/?utm_source=internal&utm_medium=email&utm_campaign=clickbankD4",
  "extension": "Chrome",
  "firstAdded": "2016-02-06T15:56:48.240000",
  "users": [
    null
  ],
  "keywords": [
    "cocacola",
    "syrup",
    "formula",
    "trade",
    "secret",
    "kept",
    "guarded",
    "known",
    "contains",
    "equivalent",
    "sugar",
    "easier",
    "cheaper",
    "purchase",
    "coke",
    "world",
    "countries",
    "clean",
    "drinking",
    "water",
    "body",
    "hit",
    "minutes",
    "consuming",
    "alone",
    "percent",
    "consumed",
    "daily",
    "astounding",
    "sweetness",
    "make",
    "vomit",
    "phosphoric",
    "acid",
    "keeps",
    "happening",
    "skyrockets",
    "begins",
    "turn",
    "huge",
    "fat",
    "shortly",
    "blood",
    "pressure",
    "rises",
    "liver",
    "delivers",
    "bloodstream",
    "pleasure",
    "centers",
    "brain",
    "stimulated",
    "manner",
    "heroin",
    "used",
    "hour",
    "crash",
    "carbonation",
    "irritates",
    "stomach",
    "lining",
    "draws",
    "heal",
    "irritation",
    "low",
    "pulls",
    "compensate",
    "reduces",
    "calcium",
    "bones",
    "caffeine",
    "causes",
    "insomnia",
    "high",
    "irregular",
    "heartbeat",
    "birth",
    "defects",
    "anxiousness",
    "breast",
    "lumps",
    "implicated",
    "forms",
    "cancer",
    "study",
    "published",
    "journal",
    "respirology",
    "states",
    "soft",
    "drinks",
    "associated",
    "breathing",
    "lung",
    "disorders",
    "asthma",
    "chronic",
    "obstructive",
    "pulmonary",
    "disease",
    "copd",
    "studies",
    "consume",
    "beverages",
    "increase",
    "heart",
    "attack",
    "stroke",
    "risk",
    "compared",
    "people",
    "drink",
    "sodas",
    "average",
    "glasses",
    "soda",
    "day",
    "based",
    "information",
    "presented",
    "host",
    "appears",
    "americans",
    "better",
    "employing",
    "home"
  ],
  "directions": [
    "0",
    "Here are 9 ways to put Coke to work in your home. It appears as though the same ingredients that destroy your stomach lining, promote obesity and decrease your calcium supplies can be great household helpers.",
    "Clean toilet bowls: To clean hard water stains from your toilet bowl, pour a little Coke into a spray bottle and spray the rings thoroughly. Let the Coke sit for about an hour in the toilet bowl. For stubborn stains, use a toilet brush. For extra tough stains, let the Coke sit overnight. Flush the toilet and see the wondrous work of the phosphoric acid.",
    "Remove blood stains: Spray some full-strength Coke on the stain and let it sit overnight. Wash the piece of clothing as usual. Mythbusters confirmed that this method for removing blood stains really does do the job.",
    "Clean burnt pans: Fill the pan with Coke and allow it to set until the food is loosened. Use a plastic scraper to remove as much of the residue as possible. Rinse the pot and wash as usual. If any burnt residue remains, apply a thin layer of baking soda, and wash again.",
    "Loosen rusty bolts: If you need to remove a rusty bolt, reach for your Coke. Pour a little cola in a bowl and use it to soak a cloth. It must be thoroughly soaked in order to do the trick. Fold the cloth over and cover the bolt entirely. The carbonic acid in the cola will break down the rust on the bolt. If rust is not totally gone, repeat again until you see no visible rust.",
    "Eliminates slugs and snails: If you have a garden burdened by snails or slugs, Coke is the ultimate trap. Put a small amount of flat Coke in a bowl and place in the garden. Like many humans, slugs and snails are attracted to the Coke – and as with us, the acid causes them serious damage. Once they slide in the little bowl of Coke, they get more than they can handle.",
    "Remove gum from hair: Getting gum stuck in your hair can be uncomfortable and also embarrassing. There are many home remedies in circulation for removing gum from the hair, including peanut butter, ice cubes and vinegar. But, did you know that cola also makes that list? If you find your hair sticky and matted with gum, soak it thoroughly with Coke. Once saturated, the gum should slide right out.",
    "Clean grout: If you are tired of your dirty and dingy grout, try pouring a little cola on it and watch it go to work. Leave it to set for just a few minutes, and use a stiff bristle brush to scrub it clean.",
    "Strip paint off of metal: If you have some painted metal that you wish to refinish, skip the commercial paint strippers and let Coke go to work. Soak a cloth in Coke and cover the area you wish to strip. Keep the cloth saturated with Coke and in a few days the paint will wipe right off. This works best for small pieces of metal, as you can go through a lot of Coke with larger pieces."
  ],
  "ingredients": [
    "0",
    "The Coca-Cola syrup formula trade secret is kept well guarded, known only to a few. What is known is that Coke contains the equivalent of 15 teaspoons of sugar, and that it is easier and cheaper to purchase Coke in many third world countries than it is to get clean drinking water.",
    "What Coke does to your body",
    "All 15 teaspoons of sugar hit your system in the first 10 minutes of consuming a Coke. This alone is over 100 percent of the amount that should be consumed daily. The astounding sweetness would make anyone vomit, but the phosphoric acid keeps this from happening.",
    "In the first 20 minutes of drinking a Coke, blood sugar skyrockets and the liver begins to turn the huge amount of sugar into fat. Shortly after, blood pressure rises and the liver delivers more sugar into the bloodstream. Pleasure centers in the brain are stimulated in the same manner as when heroin is used. Within a hour, the body has a sugar crash.",
    "The carbonation in Coke irritates the stomach lining, and the body draws calcium from the blood to heal the irritation. The blood, low on calcium, pulls it from the bones to compensate. The phosphoric acid also reduces the calcium in bones.",
    "Caffeine in Coke causes insomnia, high blood pressure, irregular heartbeat, birth defects, anxiousness, breast lumps and has even been implicated in some forms of cancer.",
    "A study published in the journal Respirology states that drinking soft drinks is associated with breathing and lung disorders including asthma and chronic obstructive pulmonary disease (COPD).",
    "Other studies show that people who consume beverages such as Coke daily have just under a 50 percent increase in heart attack and stroke risk, compared to people who do not drink sodas at all.",
    "Over 50 percent of Americans drink an average of 2.5 glasses of soda each day. Based on the information presented above, along with a host of other studies, it appears as though Americans might be better off employing Coke in their home rather than consuming it."
  ],
  "__v": 1
}