{
  "hash": "4cd475baa4464d3b3035879592ca6a1d37145093",
  "title": "Sweet Potato, Black Bean & Egg White Breakfast Burritos",
  "image": "http://www.ambitiouskitchen.com/wp-content/uploads/2014/04/5-IMG_3418.jpg",
  "href": "http://www.ambitiouskitchen.com/2014/04/healthy-sweet-potato-black-bean-avocado-breakfast-burritos/",
  "extension": "Chrome",
  "firstAdded": "2017-01-03T01:38:23.237000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cook sweet potatoes: Pierce sweet potatoes with fork a few times. Place in microwave and microwave on high for 4-6 minutes or until cooked though. This may take up to 10 minutes depending on how thick your sweet potatoes are. Alternatively you can roast them in the oven at 400 degrees for 45 minutes. Once sweet potatoes are cooked, remove the skins and place potatoes in a medium bowl. Mash with a fork; set aside.",
    "In a separate large bowl, add black beans, cumin, chili powder and red pepper flakes if desired. Stir to combine then set aside.",
    "In a separate medium bowl, beat egg whites together. Spray a skillet with nonstick cooking spray and place over medium-low heat. Add in egg whites and cook. Fold every few minutes to get fluffy eggs. Once cooked, remove from heat.",
    "To assemble burritos, make sure you have warm tortillas; it makes them easier to roll. You can warm them up for 10-20 seconds in the microwave before assembling. Lay out warm tortillas and evenly distribute and spread mashed sweet potato on each. Evenly distribute egg whites, diced avocado, black beans, and shredded cheese on each tortilla. Next drizzle about tablespoon of enchilada sauce in each. Season with salt and pepper, if desired. Tuck ends in, then roll up burritos. To warm up: Place on baking sheet in oven at 300 degrees for 5-10 minutes or simply microwave them for a minute or two. Serve with sour cream, greek yogurt, salsa, or hot sauce. Makes 6 burritos."
  ],
  "ingredients": [
    "0",
    "6 low carb whole wheat tortillas",
    "3 medium sweet potatoes",
    "1- 15 oz can black beans, rinsed and drained",
    "1/4 teaspoon cumin",
    "1/4 teaspoon chili powder",
    "few dashes of red pepper flakes, if desired",
    "8 large egg whites",
    "1 avocado, diced",
    "1/2 cup reduced fat shredded mexican or colby jack cheese",
    "1/3 cup red enchilada sauce"
  ],
  "__v": 1
}