{
  "hash": "1cf7a44312b061c1ed2bf6b5b311876c38098558",
  "title": "Gulab Jamun Recipe With Milk Powder",
  "image": "http://www.rachnas-kitchen.com/wp-content/uploads/2014/11/P10901101.jpg",
  "href": "http://www.rachnas-kitchen.com/gulab-jamun-recipe-with-milk-powderrestaurant-style-gulab-jamun/",
  "extension": "Chrome",
  "firstAdded": "2016-11-03T16:01:15.172000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparing gulab jamun dough balls",
    "First sieve dry ingredients into a mixing bowl(milk powder, plain flour and baking soda).",
    "Mix in yogurt and ghee and start to mix the ingredients lightly to make soft sticky dough.",
    "Now pinch small portions and put 1 piece of elaichi dana in the middle and bring the sides up around it, rolling it into a smooth ball about the size of a large walnut.(refer pics )",
    "Make sure there are no cracks on the surface else the ball will break when it is being cooked. Shape the rest of the dough similarly.",
    "Prepare Sugar Syrup",
    "Meanwhile to a saucepan add sugar, water and crushed cardamom pods and stir well, place on low flame. Stir well until the sugar dissolves and the syrup thickens slightly, this may take 5 minutes. (No string consistencies needed). Then remove from flame and add a drop of rose essence, set aside.",
    "Frying gulab jamun",
    "Place a frying pan on flame and pour oil to deep fry the balls.",
    "Now after the oil heats up, (oil should not be too hot), gently slide the prepared balls into it. Do not over crowd the pan. And check that the flame is in low mode.",
    "The balls will sink to the bottom and then it will gently rise up. Slowly turn each balls with a slotted spoon, at frequent intervals to make sure that the balls brown evenly.",
    "Remove balls from flame and place on a tissue paper to remove excess oil.",
    "Once they turn golden brown, remove them from oil with a help of a slotted spoon and transfer them to the prepared sugar syrup.",
    "Serving",
    "The Gulab Jamun should rest in the sugar syrup for at least 1 hour before serving so that they absorb the sugar syrup well and become soft and melt in mouth treats.",
    "You can serve these delicious melt in mouth Gulab Jamun warm, cold or chilled on their own, garnished with pistachio. I served them warm with a scoop of cold ice cream."
  ],
  "ingredients": [
    "0",
    "For the gulab jamuns",
    "1 cup milk powder (Use ful fat milk powder)",
    "¼ cup all purpose flour or maida",
    "1 tsp oil or ½ tsp ghee",
    "A pinch of salt (optional)",
    "A pinch of baking soda",
    "1 to 2 tbsp yogurt",
    "A few piece of sweet Makhana/Elaichi Dana",
    "A few blanched pistachio or almond slices for garnishing",
    "For the sugar syrup",
    "2 cups water",
    "1.5 cups sugar",
    "3-4 green cardamoms, husked & crushed or powdered",
    "A pinch of saffron (optional)",
    "1 tsp rose water (optional)"
  ],
  "__v": 1
}