{
  "hash": "08a0b28d2298c2c3571ae3abd64b11ef7e4c1386",
  "title": "Vanilla-Almond Macarons - Family, Food and Faith",
  "image": "http://sugarspiceandglitter.com/wp-content/uploads/2016/01/strawberry-1.jpg",
  "href": "http://sugarspiceandglitter.com/strawberry-macarons/",
  "extension": "Chrome",
  "firstAdded": "2017-08-26T05:06:33.837000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350°F and line 2 large baking sheets with parchment paper or silicone baking mats",
    "Put powdered sugar, almond flour, and salt in a food processor and pulse several times until all of the ingredients are fine and well combined. Place in a large bowl and set aside.",
    "Place the whisk attachment on your mixer, and beat the eggs on medium speed until opaque and foamy. Add a pinch of cream of tartar, increase the speed to medium high, continue to beat until the egg whites are white in color and hold the line of the whisk.",
    "With the mixer running, slowly add the granulated sugar, and strawberry puree/compote until combined, the peaks are stiff, and the whites are shiny, about 1 minute.",
    "Using a silicone spatula, gently fold the dry mixture with the egg whites in 1 cup increments until the dry ingredients are just combined.",
    "Spoon half of batter into pastry bag fitted with 1/2-inch plain round tip. (Or a large ziplock bag which you can cut the corner off of.) Pipe batter onto each prepared sheet in 12 walnut-size mounds, spaced 3\" apart because cookies will spread slightly.",
    "Tap the cookie sheets flat against the counter - you want to get any possible air bubbles out of the cookie batter before baking.",
    "Bake cookies, 1 sheet at a time, until firm to touch in center, about 14 minutes. You may want to rotate your cookie sheets midway through baking to ensure even cooking (imperative with macarons).",
    "Immediately slide the parchment paper off of the baking sheet to cool. Leaving the cookies on the hot baking sheet will continue to cook them past taking them out of the oven.",
    "Strawberry Filling:",
    "Using a mixer, cream butter until smooth. Add the powdered sugar and beat until light and fluffy.",
    "Add the vanilla and strawberry jam. Beat until combined. Place in a piping bag with a small round tip, like a #5.",
    "Assemble your cookies by matching cookies with similar sizes (diameters). Pipe a small amount of strawberry buttercream into the center of one cookie, and sandwich with it's other half."
  ],
  "ingredients": [
    "0",
    "2 cups powdered sugar",
    "1 cup almond flour or almond meal",
    "1/4 teaspoon Sea Salt",
    "3 large egg whites, room temperature",
    "Pinch cream of tartar",
    "3 Tablespoons granulated sugar",
    "1-2 Tablespoons strawberry puree, compote or jam",
    "Filling Ingredients:",
    "1 stick unsalted butter, softened",
    "1 1/2 cup powdered sugar",
    "1/2 teaspoon vanilla extract",
    "1-1 1/2 Tablespoon strawberry puree/compote (jam in a pinch)"
  ],
  "__v": 1
}