{
  "hash": "96618b02bdbee3bb44653550cdb1814a2745598c",
  "title": "Raw Mixed Berry and Vanilla Bean Cheesecake",
  "image": "http://downshiftology.com/wp-content/uploads/2015/05/raw-mixed-berry-and-vanilla-bean-cheesecake1-1024x683.jpg",
  "href": "https://downshiftology.com/recipes/raw-mixed-berry-and-vanilla-bean-cheesecake/",
  "extension": "Chrome",
  "firstAdded": "2016-01-08T19:49:05.789000",
  "users": [
    null
  ],
  "keywords": [
    "raw",
    "cashews",
    "soaked",
    "overnight",
    "water",
    "prefer",
    "white",
    "honey",
    "coconut",
    "oil",
    "lemon",
    "juice",
    "vanilla",
    "beans",
    "scraped",
    "macadamia",
    "nuts",
    "pecans",
    "medjool",
    "dates",
    "salt",
    "raspberries",
    "blackberries",
    "blueberries"
  ],
  "directions": [
    "0",
    "Place all of the crust ingredients (and ½ of the ¾ cup of shredded coconut) into a food processor. Note: you'll use that remaining ¼ cup shredded coconut later. Pulse the processor until the ingredients are mixed to your desired level of chunky or fine texture.",
    "Sprinkle the remaining ¼ cup of shredded coconut in the bottom of a 9-inch springform pan. this helps the cheesecake not to stick to the bottom. Place the crust mixture on top and gently flatten it with your fingers on the bottom of the pan.",
    "For the main cheesecake filling, place all ingredients in a high-powered blender. A high-powered blender makes the filling creamy and fine (which is my recommendation), but you can also use your food processor. Blend for a minute or two, until thick and creamy.",
    "Pour your filling on top of the crust. Shake the pan gently to remove any air bubbles. Then, place your pan in the freezer for 30 minutes.",
    "While your cheesecake is hardening in the freezer, you can make your topping. Place all of the topping ingredients in your food processor (after you've cleaned it), and pulse it for 30 seconds. Then set aside until your cheesecake has hardened.",
    "After 30 minutes, your cheesecake should have hardened enough to place the topping. Gently spoon the berry mixture on top and place back in the freezer. Freeze your cheesecake for at least 4 hours before serving.",
    "When you're ready to serve the cheesecake, take it out of the freezer at least 20 minutes before eating. It will be much easier to slice after it's softened. Garnish with additional berries and enjoy!"
  ],
  "ingredients": [
    "0",
    "3½ cups raw cashews (soaked overnight)",
    "1 cup water",
    "¾ cup raw honey (I prefer white honey)",
    "½ cup coconut oil",
    "½ cup lemon juice",
    "2 vanilla beans, scraped",
    "1",
    "1½ cups raw macadamia nuts",
    "¾ cup raw pecans",
    "¾ cup shredded coconut",
    "10 Medjool dates, pitted",
    "¼ tsp salt",
    "2",
    "1 cup raspberries",
    "1 cup blackberries",
    "1 cup blueberries",
    "2 tbsp raw honey"
  ],
  "__v": 1
}