{
  "hash": "fbc184ed06df04700efd36a77d5a950d0fe26752",
  "title": "Baked Egg and Chorizo Enchiladas",
  "image": "http://atmedia.imgix.net/68d3e97894cc4255a12daed9347d307d44f2be9b?auto=compress&w=640.0&fit=max",
  "href": "http://www.thekitchn.com/recipe-baked-egg-and-chorizo-enchiladas-230292",
  "extension": "Chrome",
  "firstAdded": "2017-01-05T04:08:09.943000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "On a rimmed baking sheet, broil the tomatillos, garlic, serrano chile, and the thick slices of onion. Make sure the vegetables are as close to the preheated broiler as possible. The tomatillos will take about 10 to 12 minutes; the other vegetables will take less time. Turn the vegetables when one side is nice and charred. The tomatillos are done when they are soft and starting to let out some juice. Let cool.",
    "When the vegetables are cool enough to handle, remove the skins from the garlic and the stem of the chile. Add everything to a blender, including any liquid from the tomatillos. Blend with 1 teaspoon of salt until a coarse purée forms.",
    "Pour the sauce into a large pan and add the chicken stock. Reduce over medium-high heat for 10 to 12 minutes. Stir frequently. Stir in the 1/2 cup of cilantro and cook 1 to 2 minutes more. Remove from the heat.",
    "While the sauce is simmering, prepare the chorizo filling. In a medium cast iron pan, heat a thin layer of grapeseed oil over medium-high heat. Break up the chorizo into the pan and brown for 5 to 8 minutes. Use a slotted spoon to scoop into a bowl and set aside.",
    "Wipe out the pan and heat up another thin layer of oil. Over medium-high heat, fry each tortilla on both sides — just until they are heated through. Add more oil if needed. Drain on paper towels.",
    "Heat the oven to 400°F and set a rack in the middle.",
    "To assemble the enchiladas, dip both sides of a tortilla in the tomatillo sauce. Add about 2 1/2 tablespoons of chorizo down the middle of a tortilla, and top with a few slices of raw onion, a small dollop of the cream, and a little sprinkle of queso fresco. Roll the tortilla up as tightly as you can and place seam-side down in a medium-sized cast iron pan. Repeat with the rest of the tortillas.",
    "Line up all the enchiladas tightly next to each other. Spoon the rest of the sauce over and around the enchiladas. Move the sauce around a bit to create shallow wells for the eggs. Carefully crack in 4 eggs. Sprinkle over with generous amounts of Monterey Jack cheese.",
    "Bake in the oven for 6 to 8 minutes and then broil for 3 to 4 minutes more. Rotate the pan halfway through for even cooking. The enchiladas are done when the eggs are set, but the yolks are still runny. Serve immediately with cilantro and additional queso fresco."
  ],
  "ingredients": [
    "0",
    "1 pound tomatillos, husked and rinsed",
    "4 garlic cloves, skin on",
    "1 fresh serrano chile",
    "1 medium white onion, half thickly sliced, half thinly sliced",
    "1 teaspoon salt",
    "1 cup water or chicken stock",
    "1/2 cup chopped cilantro, plus more for garnish",
    "1/2 pound fresh Mexican chorizo, casings removed",
    "Grapeseed oil, divided",
    "8 corn tortillas",
    "Sour cream or Mexican crema",
    "Queso fresco, divided",
    "4 eggs",
    "1/2 cup Monterey jack cheese"
  ],
  "__v": 1
}