{
  "hash": "4caca2643a0030cdfb3493fdef9db419158554da",
  "title": "Triple Chocolate Layer Cake",
  "image": "https://sallysbakingaddiction.com/wp-content/uploads/2013/04/triple-chocolate-cake-4-220x220.jpg",
  "href": "https://sallysbakingaddiction.com/2013/04/08/triple-chocolate-layer-cake/",
  "extension": "Firefox",
  "firstAdded": "2018-01-23T21:17:42.124000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350F degrees. Butter & flour two 9 inch round cake pans4, or use non-stick spray. See note about 9x13 pan option.",
    "Make the cake: Sift together the flour, sugar, cocoa powder, baking powder, baking soda, and salt in a medium sized bowl. Set aside.",
    "Using a handheld or stand mixer on high speed, mix the buttermilk, oil, room temperature eggs, and vanilla in a large bowl until combined. Slowly add the dry ingredients to the wet ingredients with the mixer on low. Add the coffee. The batter will be VERY thin. This is ok.",
    "Pour the batter into prepared baking pans and bake for 23-27 minutes or until a toothpick inserted in the center comes out clean. My cakes took exactly 24 minutes. Allow to cool before frosting.",
    "Make the frosting: Using a handheld or stand mixer fitted with a paddle attachment, beat the butter on high speed until smooth and creamy - about 2 full minutes. This creates a creamy base for the frosting. Turn speed to LOW and slowly add 3.5 cups of confectioners' sugar and the cocoa powder. Beat until sugar/cocoa are absorbed into the butter, about 2 minutes. Turn mixer to medium speed and add the vanilla and cream. Once added, turn the mixer to high speed and beat for 1 minute. Add up to 1/2 cup of confectioners' sugar if you'd like to increase the frosting's thickness. Taste, and add salt to taste.",
    "Assemble the cake: Place 1 layer, flat side up, on a plate or cake stand. With a knife or offset spatula, spread the top with frosting. Place the second layer on top, rounded side up, and spread the frosting evenly on the top and sides of the cake. Decorate with chocolate chips or as desired."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "Chocolate Cake",
    "1 and 3/4 cups (220g) all-purpose flour (spoon & leveled)",
    "1 and 3/4 cup (350g) granulated sugar",
    "3/4 cup (65g) unsweetened natural cocoa powder (not dutch processed)",
    "1 teaspoon baking powder",
    "2 teaspoons baking soda",
    "1 teaspoon salt",
    "1 cup (240ml) buttermilk1",
    "1/2 cup (120ml) vegetable oil (or canola oil, or melted coconut oil)",
    "2 large eggs, at room temperature2",
    "1 teaspoon pure vanilla extract",
    "1 cup (240ml) freshly brewed strong hot coffee3",
    "Milk Chocolate Frosting",
    "1.25 cups (2.5 sticks or 290g) unsalted butter, softened to room temperature",
    "3-4 cups (360-480g) confectioners' sugar",
    "3/4 cup (65g) unsweetened cocoa powder",
    "3-5 Tablespoons (45-75ml) heavy cream (or half-and-half)",
    "1 teaspoon pure vanilla extract",
    "1/2 - 3/4 teaspoon salt (to taste)",
    "optional for decoration: 15 oz (1.5 bags) semi-sweet chocolate chips"
  ],
  "__v": 1
}