{
  "hash": "ad78b2f76e83d33934aca3e0af57a15d5ab63a02",
  "title": "5 from 1 vote Print\nAlcapurrias",
  "image": "https://www.africanbites.com/wp-content/uploads/2017/07/IMG_9807.jpg",
  "href": "https://www.africanbites.com/alcapurrias/",
  "extension": "Chrome",
  "firstAdded": "2018-10-23T21:16:10.544000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Masa (Dough)",
    "Cut of both ends of cassava /yuca and then cut them in half.",
    "Make a shallow cut into the skin of the cassava and gradually work your knife under the layer of the cassava/yuca to remove the skin. Split in half then remove the inner woody core in the center discard it.",
    "Cut into small chunks and wash immediately to prevent discoloration and leave them in cool water until ready to use.",
    "Pulse the cassava/yuca in a food processor with until puree or use a grater to grate it. You may have to do so in batches .",
    "Pour it out in a large bowl, then add the garlic powder, onion, salt , oil and sazon- thoroughly mix and set aside",
    "Picadillo",
    "Add about 2 tablespoons oil in a skillet followed by onions, garlic, cumin, smoked paprika, cayenne, oregano, sweat for about a minute.",
    "Then add bell pepper, tomato sauce, bring to a simmer, add ground meat, and cook for about 7-10 minutes, while stirring frequently to prevent burning burn add about broth or water as needed",
    "Season with salt, chicken bouillon or sazon.",
    "Finally add olives , green onions and cilantro, adjust for seasoning. Remove and set aside",
    "Assemble",
    "Scoop about 3 tablespoons yuca mixture into palm of hand. Then flatten it out into until it covers the palm of your hand.",
    "Add about 1 tablespoon of picadillo into center of dough. Fold dough over filling to enclose; then gently fold over dough and roll out it out d to form cylinder about 3” long. Place on a plate or clean surface . Repeat process with remaining dough and filling until you have used up all the dough.",
    "Heat oil in heavy, deep pot, sauce pan or skillet over medium-high heat. If using a thermometer until oil registers 350°F. Add about 3 alcapurria at a time , do not , crowd pan. It may cause the dough to soak up all and make it really soggy",
    "Fry , flipping with slotted metal spoon, until outside of alcapurria is crisp and dough inside is cooked through (internal temperature of 165°F), 7-10 minutes, depending on the size of alcapurria . Remove from the pan with a slotted spoon , transfer to paper towel-lined plate to drain. Serve warm. Repeat with remaining dough",
    "Recipe Notes",
    "You can also customize these Alcapurrias according to your preference. You may sub the ground beef filling with ground chicken, turkey, stewed crab or salted cod and still enjoy the same rich and flavorful experience.",
    "After you cut the Yucca into small chunks, wash them immediately and soak them in cool water until you're ready to use to avoid discoloration.",
    "Do not overcrowd the pan when frying. It'll make the dough all soggy.",
    "You may assemble all of it in advance, wrap them in plastic and freeze it for future use. Thaw out and toss in the fryer when you want to indulge on these snacks."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Masa (Dough)",
    "3 lbs cassava / yuca",
    "2 teaspoons garlic",
    "1 tablespoon onion",
    "½ teaspoon salt",
    "1 packet Sazon with achiote",
    "2 tablespoon vegetable oil",
    "Picadillo",
    "2 tablespoon canola oil",
    "½ pound ground meat",
    "½ medium onion chopped",
    "1 teaspoon minced garlic",
    "½ cup tomato sauce",
    "1 tablespoon smoked paprika",
    "1 small green, yellow or red pepper",
    "2 tablespoons cilantro",
    "¼ cup olives chopped",
    "1 teaspoon oregano",
    "Sazon to taste"
  ],
  "__v": 1
}